<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,megadeth,the world needs a hero">
<title>Megadeth: The World Needs A Hero</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Megadeth: The World Needs A Hero</font></h1><BR> (57:56 / Metal-is)</center></P>

<p>Das letzte Album von Megadeth - das von industrial Einfl&#252;ssen getragene &quot;Risk&quot; - kam f&#252;r viele (mich eingeschlossen) einer gro&#223;en Katastrophe gleich und nicht wenige w&#228;hnten die Band schon in den ewigen Jagdgr&#252;nden. Okay, letzteres war vielleicht etwas voreilig, hat die Band mit ihrem neuen Album &quot;The World Needs A Hero&quot; (auf dem zum ersten mal ex-Savatage Gitarrist Al Pitrelli zu h&#246;ren ist) noch mal so gerade die Kurve gekratzt, was nix anderes hei&#223;en soll, da&#223; die uns&#228;glichen und absolut &#252;berfl&#252;ssigen Industrial Einfl&#252;sse gl&#252;cklicherweise wieder der Vergangenheit angeh&#246;ren. Tja, da&#223; war aber auch dann schon das positive, denn eine wirklich runde Sache ist auch &quot;The World Needs A Hero&quot; leider nicht geworden und kann an alte Meilensteine der Marke &quot;Countdown To Extinction&quot; oder &quot;Rust In Peace&quot; zu keinster Weise ankn&#252;pfen. Okay, die &quot;Hangar 18&quot; Fortsetzung &quot;Return To Hangar&quot;, das an alte 
(Speed) Glanztaten erinnernde &quot;Moto Psycho&quot; oder die typischen Megadeth Banger &quot;Dread And The Fugitive Mind&quot; &amp; &quot;Burning Bridges&quot; sind ganz okay, aber &#252;ber das restliche Material breiten wir mal lieber den Mantel des Schweigens. Egal, ob der blutleere Titeltrack, die schwache Halbballade &quot;Losing My Senses&quot; oder das &#252;berfl&#252;ssige &quot;Burning Bridges&quot; - das ist bestenfalls fader Durchschnitt, den heutzutage niemand wirklich braucht und erst recht nicht von einer Band mit dem Status von Megadeth. Bleibt unter dem Strich zwar ein Album, da&#223; den `99er Totalausfalle &quot;Risk&quot; aussticht (was auch nicht besonders schwer war), aber ansonsten sich eher an schw&#228;cheren Megadeth Alben der Marke &quot;Youthanasia&quot; orientiert und aus diesem Grunde 
wohl eher in die Rubrik &quot;Durchschnitt&quot; einzuordnen ist. Aber wem erz&#228;hle ich das eigentlich? Die-Hard Megadeth Fans werden versuchen, noch das positive aus diesem Longplayer zu ziehen und alle anderen sollten sich erstmal die Fr&#252;hwerke der Band besorgen. Bei Gefallen kann man &quot;The World Needs A Hero&quot; immer noch antesten, aber blind zugreifen sollte man wirklich nicht!</P>

<p>Fazit: 5 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd2.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
