<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, steel prophet,goddess principle">
<title>Oldie Review: Steel Prophet`s Goddess Principle</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><center><h1><font color="#00ff00">Oldie Review: Steel Prophet`s The Goddess Principle</font></h1><br> (53:38 / Brainstorm Division)</Center><br>

<p>Unterbwertete Bands gibt es leider viel zu viele. So auch die Amerikaner Steel Prophet, die regelm&#228;&#223;ig absolute Killeralben rausbringen, aber erst mit dem Wechsel zu Nuclear Blast und dem `98er Meisterwerk &quot;Dark Hallucinations&quot; einem gr&#246;&#223;eren Publikum bekannt werden, obwohl auch die beiden Vorg&#228;nger &quot;Into The Void&quot; (1997 - Pflichtkauf!) und das hier vorgestellte &quot;The Goddess Principle&quot; nicht minder schlecht waren.</P>

<p>Als dieses Album 1995 ver&#246;ffentlicht wurde, waren Steel Prophet nur wenigen Fans ein Begriff und so ist es nicht weiter verwunderlich, da&#223; &quot;The Goddess Principle&quot; in Europa nur m&#228;&#223;ig vertrieben wurde und der Band auch kein alzu gro&#223;es Budget zur Verf&#252;gung stand. Letzteres l&#228;sst sich auch am Sound dieser Scheibe festmachen, der zwar nicht wie ein Demo klingt, aber auch alles andere als zeitgem&#228;&#223; ist. Die Mukke selber aber war schon damals &#252;ber jede Kritik erhaben, wenngleich die Jungs damals noch etwas progressiver und sperriger zu Werke gingen, als beispielsweise auf &quot;Messiah&quot; oder dem aktuellen Longplayer &quot;Book Of The Dead&quot;. Die Kompositionen sind von vielen Tempowechseln gepr&#228;gt und weisen einen deutlichen Fates Warning Einschlag auf, was
nicht nur anhand des Openers &quot;Reign Of Christ&quot; oder dem superben &quot;Parthenogenesis&quot; deutlich wird. Trotzdem geht die Band schon hier mit erstuanlich viel Eigenst&#228;ndigkeit vor und ballert dem staunenden Fan 9 obergeile Tracks samt einem beeindruckendem Instrumental namens &quot;Ruby Dreams&quot; vor den Latz - keine Frage: Fans progressiver , teilweise sehr harten Metal T&#246;nen werden Songs wie &quot;The Inner Voice Silenced&quot;, &quot;Fatal Euphoria&quot; oder &quot;Devoid Of Logi
c&quot; sofort in ihr Herz schlie&#223;en und dieses Album nicht mehr missen wollen.</P>

<p>Problem an der ganzen Sache ist nur leider die Tatsache, da&#223; &quot;The Goddes Principle&quot; - wie oben bereits erw&#228;hnt - in Europa nur m&#228;&#223;ig vetrieben wurde und deswegen nicht mehr an jeder Ecke zu kriegen ist. Wer das Teil also auf einer Plattenb&#246;rse oder in einem Second Hand Laden entdeckt, sollte sofort zugreifen. Wird mal Zeit, da&#223; &quot;The Goddess Principle&quot; neu aufgelegt wird!</P>

<p>Fazit: 10 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="oldie.jpg"></P>
<p><img src="kit.gif"></P></center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
