<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Forum</H1>
<P>
In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot;
zusammengefasst.
</P>
<P><B>Wenn Ihr einen Beitrag habt, schreibt bitte an:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Carsten Schr&ouml;der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Helmoltstra&szlig;e 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">37081 G&ouml;ttingen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>E-Mail: <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A></B></P>
<H2>1. Die Frage des Monats - wir m&ouml;chten eure Meinung erfahren</H2>
<P>
Jeden Monat stellen wir euch in dieser Rubrik eine Amiga-bezogene Frage
oder machen eine provokante Bemerkung (die &uuml;brigens nicht unbedingt unsere
Meinung wiedergeben muss), in der Hoffnung, dass ihr euch m&ouml;glichst
zahlreich mit Kommentaren zu Wort meldet. Wir werden eure Beitr&auml;ge in der
jeweils folgenden Ausgabe ver&ouml;ffentlichen. Schickt sie an <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A>
</P>
<P>
Die Frage des letzten Monats lautete: &raquo;Was h&auml;ltst du von der Ank&uuml;ndigung
AMIGAs, einen offiziellen Amiga-Emulator f&uuml;r x86-Rechner auf den Markt zu
bringen?&laquo;
</P>
<P>
Andreas Falkenhahn &auml;u&szlig;ert sich skeptisch zu dem Projekt: &raquo;Ich denke, dass
ein offizieller Amiga-Emulator f&uuml;r x86-Systeme das absolute Ende vom
klassischen Amiga, wie wir ihn kennen und lieben, darstellen w&uuml;rde, da
solch ein Emulator durchaus Potential besitzen kann, den Klassik-Amiga in
Punkto Geschwindigkeit und Grafikausgabe ziemlich alt aussehen zu lassen.
Dies mag vielen Benutzern gefallen, es kann aber im Interesse der Amiga-
Community, die viel Geld in ihre Hardware investiert hat, einfach keine
endg&uuml;ltige L&ouml;sung sein. Der Amiga mutiert so zum Windows-Addon, als
eigenst&auml;ndiges Computer-System wird er so nicht mehr existent sein. Deshalb
muss Amiga sich fragen, ob sie mit dieser L&ouml;sung, sich nicht selbst das
eigene Grab schaufeln, wenn man mal davon ausgeht, dass Amiga noch
Interesse am klassischen Rechner hat, was nach derzeitigem Stand der Dinge
ja zu best&auml;tigen w&auml;re. Auch ruft sich hier eindeutig die Commodore-
Vergangenheit wieder ins Ged&auml;chtnis: Denn auch Commodore hat schon versucht,
den Amiga mittels PC-Karten und &auml;hnlichem x86-tauglich zu machen, anstatt
ihn als eigenst&auml;ndiges System v&ouml;llig unabh&auml;ngig zum damals noch schwachen
Gegner zu vermarkten. Es kann deshalb nicht sein, dass Amiga denselben Weg
einschl&auml;gt. Der Amiga muss unabh&auml;ngig bleiben, da ein x86-Betriebssystem
immer im Schatten von Windows stehen wird.&laquo;
</P>
<P>
Der k&uuml;rzeste Kommentar, den ich jemals erhalten habe, stammt von Andreas
Steup: &raquo;&Uuml;berfl&uuml;ssig.&laquo;
</P>
<P>
Gernod Schomberg sieht die Ank&uuml;ndigung dagegen positiv: &raquo;Es w&auml;re eine sehr
gute Sache, wenn sie nur mit ganzer Kraft durchgesetzt w&uuml;rde. Und die
weitere Entwicklung des AmigaOS sollte nicht daran vorbei gehen.
Schlie&szlig;lich wurde doch gesagt, dass AmigaOS 5 nativ unter anderem auf x86
laufen soll.
</P>
<P>
Ich bin ein Commodore-Benutzer der ersten Stunde (PET 2000) und Amiga-Fan
der zweiten (mein erster Amiga war bereits 2000 mit OS 1.3), aber da ich
bef&uuml;rchte, dass AmigaOS 4.0 lediglich ein Port des OS 3.9 auf PPC ist und
dass die Programme nur Umsetzungen der vorhandenen sind, glaube ich nicht,
dass ich auf AmigaOne umsteige. F&uuml;r x86-Maschinen gibt es inzwischen in dem
Bereich, in dem Amiga einmal f&uuml;hrend war, sehr viele Programme, die unseren
Rechner so alt aussehen lassen, wie er ist. Ich w&auml;re begeistert, wenn ich
die Vorteile beider Welten auf einem Rechner erleben k&ouml;nnte. Und wenn man
dann in den Genuss eines schlanken Betriebsystems k&auml;me, das durch die
Unterst&uuml;tzung der Amiga-Programmierer wieder sein ganzes K&ouml;nnen ausspielen
kann, zweifele ich nicht, dass da eine echte Konkurrenz f&uuml;r Windows
entstehen k&ouml;nnte.&laquo;
</P>
<P><B>Nun zur aktuellen Frage des Monats:</B></P>
<P>
&raquo;Wie beurteilst du - auch im Hinblick auf AMIGAs &quot;Amithlon&quot; - die
Ank&uuml;ndigung von Haage &amp; Partner, einen weiteren Amiga-Emulator, diesmal f&uuml;r
das Betriebssystem QNX, auf den Markt zu bringen?&laquo;
</P>
<P><B>Schickt eure Beitr&auml;ge bitte an <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A></B></P>
<P ALIGN="RIGHT">
<A HREF="Forum.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Forum2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
