<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Workbench 3.9: Neue Tastatur-Shortcuts mit CatEdit (von G. Schomberg)</H2>
<P>
Manchmal ist es gut, wenn man nicht das Original verwendet, denn die im
Folgenden beschriebene einfache Methode hat leider einen Nachteil: Sie
funktioniert nur, wenn eine Catalog-Datei aufgerufen wird! Das hei&szlig;t,
Benutzer der (internen) englischen Version der Workbench k&ouml;nnen sie nicht
anwenden. Meine (vielleicht unzureichenden) Versuche, eine englische
Catalog-Datei einzurichten, waren erfolglos, die Workbench hat einfach
nicht danach gefragt.
</P>
<P>
Seit langem habe ich in meiner Tools-Schublade das Programm &quot;CatEdit&quot;,
Version 1.2b (oder 38.951, im Programm stehen zwei verschiedene
Versionsnummern) vom M&auml;rz 1995 von Rafael D'Halleweyn. Das Programm
verwendete ich gelegentlich, um Catalog-Dateien etwas anzupassen. Nach dem
Start steht einem eine Art Editor zur Verf&uuml;gung, in den man Catalog-Dateien
laden und bearbeiten kann. Ich will hier nicht weiter auf die M&ouml;glichkeiten
eingehen, da das Programm wirklich sehr einfach zu bedienen ist, wenn man
sich erst mal ein wenig mit dem Aufbau der Catalog-Dateien befasst hat.
</P>
<P>
Wenn ich mich recht entsinne, sind ab AmigaOS 3.5 Tastatur-Eingaben zur
Ausf&uuml;hrung von Workbench-Men&uuml;befehlen m&ouml;glich. Aber erst mit dem AOS 3.9
fiel mir auf, dass ich zwar mit RAmiga-J den Inhalt eines Fensters
aufr&auml;umen konnte, aber zur Gr&ouml;&szlig;enanpassung und zur Fixierung musste ich
immer noch das Men&uuml; &ouml;ffnen.
</P>
<P>
Bei anderen Programmen, ich dachte dabei z.B. an die RexxReqTools-
Erweiterung von ARexx, ist eine Tastaturbelegung sehr einfach m&ouml;glich, ich
hoffte, dass das auch bei der Workbench klappen sollte. Da im Men&uuml; die
Tastatur-Codes neben den lokalisierten Bezeichnungen stehen, schaute ich
mir einmal im Verzeichnis SYS:Locale/Catalogs/Deutsch/sys/ die Datei
&quot;workbench.catalog&quot; mit CatEdit an und wurde tats&auml;chlich f&uuml;ndig. Im WB-Men&uuml;
&quot;Fenster - Inhalt aufr&auml;umen - Nach Spalten&quot; steht der Buchstabe &quot;J&quot; hinter
dem invertierten &quot;A&quot;. Mit der Suchfunktion des Editors von CatEdit fand ich
die Zeichenkette &quot;Nach Spalten&quot; und davor die Zeichenfolge &quot;J0&quot;. Bei den
meisten &uuml;brigen Punkten war die Position des &quot;J&quot; leer.
</P>
<P>
<A HREF="img/catedit.png"><IMG SRC="thumb/catedit.jpg" WIDTH="120" HEIGHT="47" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Ich pr&uuml;fte, welche Tasten noch frei sind (inzwischen habe ich die Belegung
in den deutschen OS3.9-FAQ gefunden), suchte mir die Zeichenfolge &quot;Gr&ouml;&szlig;e
anpassen&quot;, schrieb ein &quot;G&quot; davor, machte das Gleiche mit &quot;alles&quot; (vom
Men&uuml;punkt &quot;Fenster - Fixieren - alles&quot;), allerdings schrieb ich da ein &quot;X&quot;
davor und speicherte die Catalog-Datei wieder ab. Zun&auml;chst war ich etwas
skeptisch, ob es wirklich so einfach sein sollte, aber das war es wirklich.
Sofort nach Neustart, um die Catalog-Datei aus dem Speicher zu entfernen
(&quot;FLUSH&quot; gen&uuml;gt nicht, weil die Workbench die Datei im Speicher blockiert),
konnte ich nun mit Tastendruck nicht nur eine Schublade aufr&auml;umen, sondern
auch die Gr&ouml;&szlig;e anpassen und alles fixieren.
</P>
<P>
So kann man allen noch freiem Men&uuml;punkten Zeichen zuordnen.
</P>
<P>
Selbstverst&auml;ndlich sind auch &Auml;nderungen m&ouml;glich, wenn einem der vorgegebene
Buchstabe nicht gef&auml;llt. Allerdings sollte man Doppelbelegungen vermeiden,
obwohl bei mir dadurch keine Systemfehler auftraten. Es werden bei
Tasteneingabe offenbar nacheinander alle Positionen abgesucht und die erste
gefundene wird ausgef&uuml;hrt.
</P>
<P>
<HR>
Auszug aus den offiziellen deutschen AmigaOS 3.9 FAQ:
</P>
<P>
Tastaturk&uuml;rzel<BR>
1.<BR>
</P>
<P>
F:<BR>
Welche Tastaturk&uuml;rzel unterst&uuml;tzt die Workbench?<BR>
</P>
<P>
A:<BR>
&lt;R-AMIGA&gt;+&lt;-&gt; Nur Dateien mit Piktogramm anzeigen<BR>
&lt;R-AMIGA&gt;+&lt;+&gt; Alle Dateien anzeigen<BR>
&lt;R-AMIGA&gt;+&lt;1&gt; Inhalt als Piktogramme auflisten<BR>
&lt;R-AMIGA&gt;+&lt;2&gt; Inhalt nach Namen auflisten<BR>
&lt;R-AMIGA&gt;+&lt;3&gt; Inhalt nach Datum auflisten<BR>
&lt;R-AMIGA&gt;+&lt;4&gt; Inhalt nach Gr&ouml;&szlig;e auflisten<BR>
&lt;R-AMIGA&gt;+&lt;5&gt; Inhalt nach Art auflisten<BR>
&lt;R-AMIGA&gt;+&lt;a&gt; Alles ausw&auml;hlen<BR>
&lt;R-AMIGA&gt;+&lt;b&gt; Workbench als Hintergrund<BR>
&lt;R-AMIGA&gt;+&lt;c&gt; Kopieren<BR>
&lt;R-AMIGA&gt;+&lt;e&gt; Befehl ausf&uuml;hren<BR>
&lt;R-AMIGA&gt;+&lt;f&gt; Suchen<BR>
&lt;R-AMIGA&gt;+&lt;i&gt; Information anzeigen<BR>
&lt;R-AMIGA&gt;+&lt;j&gt; Inhalt nach Spalten aufr&auml;umen<BR>
&lt;R-AMIGA&gt;+&lt;k&gt; Schlie&szlig;en<BR>
&lt;R-AMIGA&gt;+&lt;l&gt; Auslagern<BR>
&lt;R-AMIGA&gt;+&lt;m&gt; Aktualisieren<BR>
&lt;R-AMIGA&gt;+&lt;n&gt; Neue Schublade anlegen<BR>
&lt;R-AMIGA&gt;+&lt;o&gt; &Ouml;ffnen<BR>
&lt;R-AMIGA&gt;+&lt;p&gt; Zur&uuml;cklegen<BR>
&lt;R-AMIGA&gt;+&lt;q&gt; Workbench verlassen<BR>
&lt;R-AMIGA&gt;+&lt;r&gt; Umbenennen<BR>
&lt;R-AMIGA&gt;+&lt;s&gt; Fixieren<BR>
&lt;R-AMIGA&gt;+&lt;u&gt; Position freigeben<BR>
&lt;R-AMIGA&gt;+&lt;z&gt; Markierungen l&ouml;schen<BR>
&lt;R-AMIGA&gt;+&lt;L-Maustaste&gt; Kopieren statt verschieben<BR>
&lt;R-AMIGA&gt;+&lt;L-Maustaste Doppelklick auf ein Schublade&gt; &Ouml;ffnet die angew&auml;hlte Schublade, schlie&szlig;t aber das Mutterverzeichnis.<BR>
&lt;L-AMIGA&gt;+&lt;b&gt; Warnmeldung abbrechen<BR>
&lt;L-AMIGA&gt;+&lt;m&gt; N&auml;chster Bildschirm<BR>
&lt;L-AMIGA&gt;+&lt;n&gt; Vorheriger Bildschirm<BR>
&lt;L-AMIGA&gt;+&lt;v&gt; Warnmeldung best&auml;tigen<BR>
</P>
<HR>
<P><B>Gernod Schomberg &lt;<A HREF="mailto:g.schomberg@t.online.de">g.schomberg@t.online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
