<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Workshops / Hintergrundberichte / Buchvorstellungen</H1>
<H2>1. Workshop: Video Conferencing mit dem Amiga (von Dirk Wenk)</H2>
<H3>Unm&ouml;glich? Zu teuer? Nein, nichts dergleichen!</H3>
<P>
Es gab zwar schon mal eine professionelle Software mit dem Namen Coctail,
aber sie hatte sich nie durchsetzen k&ouml;nnen. Nun gibt es eine M&ouml;glichkeit
mit etwas Software, die man im Aminet findet, genau das Selbe zu tun.
Dazu brauchen wir das IRC-Programm BlackIRC und das Audioprogramm AmiPhone.
OK! Jetzt werden einige sagen, dass BlackIRC ja schon Video-&Uuml;bertragung
unterst&uuml;tzt und mit AmiPhone nur noch Audio hinzukommt, aber man m&uuml;sse
BlackIRC ja nicht unbedingt als ICR-Client nutzen, um eine Videokonferenz
abzuhalten!
</P>
<H3>Wie es geht? Ganz einfach!</H3>
<P>
Zuerst entpackt man beide Archive auf seine Festplatte. Danach installieren
wir AmiPhone so, wie es im Guide steht. Nicht vergessen, das Programm in
den TCP/IP-Stack einzubindenden, damit es automatisch startet, wenn man
angerufen wird! Man kann das Ganze dann testen, in dem man sich selbst
anruft.
</P>
<H3>Nun kommen wir zum Video-Teil</H3>
<P>
Von BlackIRC brauchen wir nur die beiden Programme AmVideoConf und
AmVideoConfD. Am besten, wir lassen beide in der Schublade &quot;Plugins&quot;, da
sich dort auch noch die passenden JPEG-Encoder und -Decoder befinden. Je
nach vorhandenem Prozessor sollte man diese gegen optimierte 68k- oder PPC-
Versionen austauschen.
</P>
<P>
Nachdem wir unsere Kamera an die V-Lab gest&ouml;pselt haben, k&ouml;nnen wir
anfangen. Zun&auml;chst starten wir unseren Server, damit andere uns sehen
k&ouml;nnen. Das machen wir durch folgenden Shell-Aufruf:
</P>
<PRE>
&quot;BlackIRC:Plugins/AmVideoConfD 26543 1&quot;
</PRE>
<P>
Ohne Anf&uuml;hrungszeichen (&quot;) eintippen! Sollte die Kamera an Port 0 sein,
tragen wir entsprechend statt der 1 eine 0 ein bzw. f&uuml;r den S-VHS-Eingang
eine 2. Haben wir das richtig gemacht, erscheint auch schon die Meldung:
&quot;Waiting for requests&quot;. So, ab jetzt sind wir f&uuml;r andere sichtbar, wenn
diese uns anw&auml;hlen sollten. Gehen wir davon aus, dass unser Gegen&uuml;ber dies
auch schon erledigt hat.
</P>
<P>
Dann versuchen wir jetzt, ihn anzuw&auml;hlen, damit wir ihn sehen k&ouml;nnen.
Das machen wir durch folgenden Shell-Aufruf:
</P>
<PRE>
&quot;BlackIRC:Plugins/AmVideoConf <IP> 26543 Frank&quot;
</PRE>
<P>
Dort wo <IP> steht, m&uuml;ssen wir die aktuelle Internetadresse des Gegen&uuml;ber
einsetzten. Die k&ouml;nnen wir herausfinden, in dem wir uns z.B. im IRC-Kanal
treffen und diese Information durch &quot;/userhost Frank&quot; (Frank ist der Name
des Gegen&uuml;bers) ermitteln, 26543 ist wieder der Port und Frank steht dann
als &Uuml;berschrift auf dem Fenster (damit wir wissen, mit wem wir uns
unterhalten). Jetzt m&uuml;sste sich ein Fenster &ouml;ffnen und nach kurzer
Zeit ein Bild des Gegen&uuml;bers angezeigt werden. Je nach Bandbreite der
Internetverbindung kann man jetzt zwischen 3 &Uuml;bertragungsarten w&auml;hlen:
JPEG, Bitmap oder Truecolor. Mit einer Modemverbindung funktioniert am
Besten die Truecolor-&Uuml;bermittlung.
</P>
<P>
Jetzt brauchen wir nur noch AmiPhone zu starten. Als Zieladresse geben wir
hier die selbe IP ein, wie wir sie auch bei AmVideoConf benutzt haben. Nach
kurzer Zeit haben wir so eine Bild- und Audio&uuml;bertragung hergestellt.
Sollte mal beim Versuch, eine Videoverbindung aufzubauen, nur das Fenster
mit der Meldung &quot;Connecting&quot; und nach ca. 30 Sekunden immer noch kein Bild
erscheinen, dann wurde wahrscheinlich die IP-Adresse falsch eingetragen.
Dieses Fenster bekommt man leider nicht so einfach wieder weg, man muss die
Task mit einem Hilfsprogramm, wie zum Beispiel SIP oder XOpa, entfernen.
</P>
<P>
<A HREF="img/videoconf.jpg"><IMG SRC="thumb/videoconf.jpg" WIDTH="120" HEIGHT="80" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Will man die &Uuml;bermittlung der eigenen Bilder unterbrechen, braucht man nur
das Fenster, in dem &quot;Waiting for request&quot; stand, anzuw&auml;hlen und die Tasten
<Ctrl + C> dr&uuml;cken.
</P>
<P>
Ich hoffe, dass hierdurch ein paar Leute mehr diese tollen Programme laufen
lassen. Idealerweise zusammen mit einem IRC- oder ICQ-Client!
</P>
<P>
Hiermit m&ouml;chte ich mich noch mal bei NX_Loki f&uuml;r die Tests bedanken, die wir
durchgef&uuml;hrt haben, bis es endlich fehlerfrei funktionierte.
</P>
<P><B>Nochmal zu &Uuml;bersicht:</B></P>
<P>
Man braucht an Hardware: Audiodigitizer (Parallelport oder Soundkarte),
ein Mikrofon, eine Vlab (Vlab Par oder Vlab S-VHS), ein Videomodul bzw.
eine Kamera.
</P>
<P>
An Software: Das BlackIRC-Packet und AmiPhone.
</P>
<P><B>Viel Spa&szlig;!</B></P>
<P><B>Dirk Wenk &lt;<A HREF="mailto:Dirk@wax7.de">Dirk@wax7.de</A>&gt;, ICQ:21835869</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
