<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Der Zwischenruf
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Der Zwischenruf (von Ralf Driesner)</H1>
<P><B>Aller guten Dinge sind....wieviel?</B></P>
<P>
Ja, das ist diesen Monat die Frage. Nachdem der Sommer sich schon nicht
entscheiden konnte, ob er uns nun mit trockener Hitze backen oder mit
extremer Schw&uuml;le d&uuml;nsten soll, wird uns das Leben auch im Herbst nicht
leichter gemacht. Haage &amp; Partner k&uuml;ndigten nun einen AmigaOS-Emulator auf
QNX-Basis an.
</P>
<P>
Ich bin ehrlich....ich habe manchmal schon Probleme beim Kaffeekauf. Hat
mir das braune Pulver von letzter Woche nun gemundet? Soll ich ein anderes
ausprobieren? Oder lag es doch an der Kondensmilch, deren chemische
Halbwertzeit m&ouml;glicherweise schon &uuml;berschritten war?
</P>
<P>
Amiga-User geh&ouml;ren einer aussterbenden Rasse an. Die alte Hardware
kompostiert schon langsam vor sich hin; will dringend abgel&ouml;st werden. Im
Wochentakt werden nun neue Boards, Emulatoren, Betriebssysteme - und
welche, die es werden wollen - angek&uuml;ndigt, und jetzt noch ein neuer
Emulator auf Basis eines uns zumindest namentlich bekannten Betriebssystems
(QNX).
</P>
<P>
Eine technische Wertung wird wohl erst mit der Verf&uuml;gbarkeit m&ouml;glich sein.
Rein strategisch kommt dieser neue Emulator jedoch zur Unzeit. Wer soll ihn
kaufen? Wer will ihn kaufen? Oder ist das ganze am Ende nur der ber&uuml;hmte
Wadlbei&szlig;er-Effekt, um Amiga Inc. zur Eile anzutreiben?
</P>
<P>
So oder so....die Situation erinnert sehr stark an einen Kampf vergangener
Zeiten. WarpUP oder PowerUP? Das Ende ist jedem bekannt: Insolvenzen,
gemeinsamer Stillstand, Dampfplauderei und gegenseitige Schuldzuweisungen.
</P>
<P>
Soll ich nun auf der alten Maschine bleiben? Oder wird's doch ein bPlan-
Board? AmigaONE will auch gekauft werden, und wie steht's mit all den
vielen Spielzeugen, die uns Amiga, Inc. in Form des besseren PDAs
versprochen hat?
</P>
<P>
Wieder einmal wird es Zeit, die Akteure an einen Fakt zu erinnern: Der
Markt ist klein. Und gekauft wird nur bei einem klaren Kurs. Zu viele
Amiga-User haben in der Vergangenheit schon Fehlk&auml;ufe get&auml;tigt. Also...was
tun?
</P>
<P>
L&ouml;sung: Abwarten und Teetrinken. Keine verfr&uuml;hten K&auml;ufe von halben
L&ouml;sungen, solange nicht klar ist, ob ein Unternehmen mal wieder eine
schnelle Finanzspritze braucht oder wirklich solide, vern&uuml;nftige Hard- und
Softwaretechnik auf den Markt bringt.
</P>
<P>
Die renommierte S&uuml;ddeutsche Zeitung schrieb am 31.08.2001 auf Seite 21
(&quot;Computerbranche in der Flaute - Entdeckung der Langsamkeit&quot;) von der
M&uuml;digkeit des Verbrauchers, viel Geld f&uuml;r subjektiv unn&ouml;tige Technik
auszugeben. Auch wenn sich dieser Artikel eher auf die neue Generation von
Intel- und AMD-Prozessoren bezog - die aktuelle Flaute im Halbleiter-
Bereich ist auf die Markts&auml;ttigung in diesem Segment zur&uuml;ckzuf&uuml;hren -,
steht es uns allen gut an, kritisch und mit einem gesunden Finanzgebahren
alle Neuentwicklungen auf ihre tats&auml;chliche Qualit&auml;t und ihre Notwendigkeit
hin zu untersuchen.
</P>
<P>
Ob sich jedoch dieser weitere Konkurrenzanw&auml;rter positiv oder negativ auf
den Amiga-Markt auswirken wird, vermag ich nicht im Kaffeesatz zu lesen.
Darum auch mein obiger Rat: Teetrinken; vielleicht hilft's ja?!
</P>
<P><B>Lebt lang und erfolgreich</B></P>
<P><B>Euer</B></P>
<P><B>Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
