<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - Editorial</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<H1 ALIGN="CENTER">Editorial</H1>

<P>
<B>Leider</B> kommt diese Ausgabe mit einer &auml;u&szlig;erst deftigen Versp&auml;tung
heraus - faktisch ist eine komplett ausgefallen.
</P>

<P>
Einen Teil dieser Zeitspanne mu&szlig; ich auf meine Kappe nehmen, da ich
aus pers&ouml;nlichen (bzw. beruflichen) Gr&uuml;nden f&uuml;r eine ungew&ouml;hnlich lange
Dauer kaum f&uuml;r den AmZeiger aktiv werden konnte. Der andere Part geht zu
Lasten der HTML-Umwandlung, die durch Krankheit und Zeitmangel unseres
HTML-Redakteurs verursacht wurde (und die in diesem Moment noch nicht
abgeschlossen ist).
</P>

<p><i>[Zusatzbemerkung zur zus&auml;tzlichen Versp&auml;tung der HTML-Ausgabe: Da unser
HTML-Redakteur die Redaktion &uuml;berraschenderweise pl&ouml;tzlich verlassen hat, mu&szlig;te ich
die Konvertierung zus&auml;tzlich selbst &uuml;bernehmen, so da&szlig; die HTML-Seiten unglaublich 
sp&auml;t verf&uuml;gbar sind. Auf inzwischen eingetretene Ereignisse, wie die erneute Amiga-&Uuml;bernahme,
das Phase 5-Insolvenzverfahren etc., wird daher in der n&auml;chsten Ausgabe eingegangen, die
im &uuml;brigen die letzte AmZeiger-Ausgabe sein wird; d. Chefred.]</i></p>

<P>
Ja, selbst der Beta-Test in der Redaktion hat sich wieder als sinnvoll
erwiesen. Ein fehlendes Anf&uuml;hrungszeichen an einer Stelle in der Guide-Ausgabe hat bei bestimmten AmigaGuide-Datatype-Versionen zum Absturz
gef&uuml;hrt. Also kamen viele ung&uuml;nstige Umst&auml;nde zusammen.
</P><P>
Positiver Effekt (denn man soll ja allem auch etwas Positives
abgewinnen! ;) ist, da&szlig; wir so auch die Gelegenheit genutzt haben,
eine <A HREF="../amz1299/hewb.htm">Messe-Zusammenfassung</A> einzuf&uuml;gen. Au&szlig;erdem begr&uuml;ssen wir
mit dieser Ausgabe auch wieder einen <A HREF="../cc/9912bas.htm">Coder's Corner</A>-Redakteur
in unserer Mitte: <B>Marco Miljak</B> nimmt sich von nun an den Bed&uuml;rfnissen
der Programmierer an.
</P><P>
Doch f&uuml;r unsere <A HREF="../amz1299/intern.htm">Interna</A> gibt es ja auch einen eigenen Abschnitt, auf den
ich f&uuml;r weitere Informationen rund um den AmZeiger verweise, wie z.B.
die verl&auml;ngerte Frist f&uuml;r das Preisausschreiben, bei dem es zwei &quot;<B>Phoenix</B>&quot;-
Exemplare zu gewinnen gibt...
</P><P>

<hr>

</P><P>
Die <B>Home Electronics World 99</B>, ehemals den vergleichsweise griffigen
Namen &quot;Computer 99&quot; tragend, hat sich insgesamt vor allem f&uuml;r die
Besucher als Flop erwiesen. Zumindest wenn man gewisse Erwartungen
an sie als Messe im Wortsinn hatte. F&uuml;r einen gem&uuml;tlichen Plausch
mit Prominenten des Amiga-Umfeldes war zumindest Gelegenheit. Anderes
war nach der rasanten negativen Entwicklung der letzten Zeit wohl auch
nicht zu erwarten gewesen.
</P><P>
Der Chefredakteur des nun eingestellten Magazins 'Amiga Plus' Gerhard
Bauer hat im Amiga-Club-Forum die Vermutung ge&auml;u&szlig;ert, da&szlig; die Messe
auf Grund hoher Verluste f&uuml;r den Veranstalter die letzte gewesen ist.
</P><P>

<hr width="50%">

</P><P>
Die Fakten zur aktuellen Entwicklung bei Amiga habe ich bereits bei
<A HREF="../amz1299/news.htm">Am Puls</A> umrissen. Einzig erfreulich, wenn auch losgel&ouml;st von den
anderen Ereignissen, ist die tats&auml;chliche Realisierung und Auslieferung
des Amiga-OS 3.5 - auch wenn ich pers&ouml;nlich die Voraussetzung des
Kickstart 3.1-ROMs f&uuml;r einen Fehler halte. Sogut wie alle einstmals
verkauften A 1200 und 4000 wurden mit Kickstart 3.0 ausgeliefert und
werden auch heute noch damit betrieben. Eine weitere Investition, neben
dem eigentlichen Kauf, w&uuml;rde also f&uuml;r viele notwendig werden.
</P><P>
-
</P><P>
<B>Jim Colla</B> ist nach acht furiosen Monaten, in denen eine 'revolution&auml;re'
Erkl&auml;rung die andere jagte, also wieder von der Bildfl&auml;che verschwunden.
</P><P>
Versuchte er die 'Amiga-Gemeinde' noch k&uuml;rzlich von der, seiner Meinung
nach, einzig vern&uuml;nftigen L&ouml;sung der Verwendung von <B>Linux</B> f&uuml;r den Kern
des zuk&uuml;nftigen Amiga-OS, zu &uuml;berzeugen, so trat er nun sehr schnell
und auffallend leise von seinem Posten zur&uuml;ck.
</P><P>
[Direkte <B>Reaktionen</B>, auch zu dem Gebahren von Amiga, auf die Linux-
Entscheidung, k&ouml;nnen Sie auch in unserem Forum <A HREF="../alf/9912alf.htm">ALF</A> nachlesen.]
</P><P>
Nachdem er so lange versuchte in fast religi&ouml;ser Manier die <B>heilige Flamme</B>
der 'Amiga-Gemeinde' am K&ouml;cheln zu halten, erscheint mir dieser Abgang
merkw&uuml;rdig.
</P><P>
Sicher wird (vertraglich) sichergestellt sein, da&szlig; er keine Details &uuml;ber
die wirklichen Gr&uuml;nde ausplaudert. Einen <B>Maulkorb</B>, der selbst allgemeine
Worte des Abschieds verhindert, kann dies sicherlich nicht darstellen.
Das er genau darauf aber verzichtet oder keinen Wert gelegt hat, ist
m&ouml;glicherweise sehr bezeichnend - gerade, wenn man seine Art an Gef&uuml;hle
zu appellieren und Vertrauen zu beschw&ouml;ren, in Rechnung stellt.
</P><P>
Allgemein wird spekuliert, da&szlig; <B>das b&ouml;se Gateway-Management</B> ihn nicht mehr
schalten und walten lassen wollte, wie es ihm gefiel. Das sie gegen die
Pl&auml;ne von tollen Amigas waren und alles nur kaputtmachen wollten.
</P><P>
M&ouml;glich, da&szlig; da etwas dran ist. Aber kann es nicht auch sein, da&szlig; sich
pl&ouml;tzlich und nicht mehr verschleierbar herausstellte, da&szlig; es sich um
eine Menge <B>Seifenblasen</B> handelte, die nun zerplatzten? Das in diesem
Zeitrahmen gar keine und schon gar nicht die gew&uuml;nschten Ergebnisse
realisierbar waren?
</P><P>
Wenn man nach dem ver&ouml;ffentlichten Zeitplan geht, dann m&uuml;&szlig;te der Gro&szlig;teil
der neuen Technologie bei Jim Collas R&uuml;cktritt ja schon mindestens im
Beta-Stadium gewesen sein. Wer aber glaubt eigentlich <B>ernsthaft</B> daran,
da&szlig; au&szlig;er ein paar Geh&auml;use-Studien etwas greifbares existiert(e)?
</P><P>
Diese Designs waren f&uuml;r mich schon <B>demaskierend</B> genug. Sicher sind sie
nicht unattraktiv - f&uuml;r eine Konsole oder Set-Top-Box. Aber wenn die
Geh&auml;use f&uuml;r zuk&uuml;nftige Computer gedacht waren - wo war der Einschub bzw.
Platz f&uuml;r das CD- oder DVD-Laufwerk? - von anderen Erweiterungen gar
nicht zu sprechen.
</P><P>
Die f&uuml;r viele entt&auml;uschenden Erkl&auml;rungen des neuen Amiga-Pr&auml;sidenten
<B>Thomas 'Tom' Schmidt</B>, der die Aufgabe des NG-Projektes und Hinwendung
zur Entwicklung von Internet Appliances bekanntgab, haben auch ihr
Gutes: sie brachten einige auf den Boden der Tatsachen zur&uuml;ck. Von
Amiga ist (im gro&szlig;en Rahmen) nichts zu erwarten! L&ouml;sungen der Misere
k&ouml;nnten h&ouml;chstens durch die (unwahrscheinliche) B&uuml;ndelung der Kr&auml;fte
von Drittherstellern und/oder eine neue Lizensierungs-Strategie von
Amiga erreicht werden.
</P><P>
<I><B>&quot;Aus Ihrer Perspektive gibt es ein gro&szlig;es Problem. Klingt toll, aber was
hat diese neue Richtung mit dem originalen Amiga zu tun? Ganz ehrlich,
nichts!&quot;</B></I> Thomas J. Schmidt in einer Mitteilung an die Amiga-User
</P><P>
Immerhin eine erfrischende Offenheit. Wem nutzen himmelhochjauchzende
Versprechungen, die niemals eingehalten werden?
</P><P>
Tom Schmidt steht der Lizensierung von Amiga-Technologien offen gegen&uuml;ber.
Wenn sich das als wahr erweisen w&uuml;rde, g&auml;be es vielleicht noch eine Chance.
Mittlerweise ist die amerikanische Amiga-Zentrale aber nicht mehr zu
erreichen. Es w&uuml;rde mich nicht wundern, wenn sie ihre Gesch&auml;ftst&auml;tigkeit
eingestellt hat.
</P><P>
Was ich schon so oft schrieb, bleibt also auch diesmal g&uuml;ltig:
</P><P>
<center><h3>Es bleibt spannend!</h3></CENTER>

<br><P>
Wie immer mit der Bitte um <A HREF="support.htm">Unterst&uuml;tzung</A> und Lesermeinungen verbleibt,</P>

Ihr<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A><BR>
Chefredakteur<BR>

<DIV ALIGN="CENTER">...und unser <A HREF="danke.htm">DANK</A> geht an...<DIV ALIGN="CENTER">

</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="main.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../amz1299/news.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
