<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - Messe-Zusammenfassung</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>Home Electronics World 99</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>
Weniger Besucher, weniger Aussteller, durchwachsene Stimmung, relativ
gute Ums&auml;tze der verbliebenen H&auml;ndler - so kann man die Messe wohl am
besten mit wenigen Worten charakterisieren.
</P><P>
Unter denen, die ihren Weg nicht mehr zur Messe gefunden haben, sind
Firmen wie <B>VillageTronic</B>, <B>Oberland</B> (fr&uuml;her auch als AmigaOberland
bekannt), die sich inzwischen bereits vom Amiga verabschiedet haben,
aber auch z.B. <B>Phase 5</B> - kein gutes Zeichen.
</P><P>
<B>Amiga International</B> war mit dem gr&ouml;&szlig;ten Messestand vertreten, verziert
von einem &uuml;berdimensionalen aufgeblasenen Boing-Ball. Da man, wie bei
<A HREF="../amz1299/news.htm">Am Puls</A> beschrieben, keine revolution&auml;ren Entwicklungen oder auch nur
jedwede Neuigkeiten pr&auml;sentieren konnte, wurde aus der Not eine Tugend
gemacht und in eine Ausstellung &quot;Amiga-History&quot; zur Besichtigung der
bisherigen Amiga-Modelle eingeladen. Auch der legend&auml;re 'Amiga-Walker'
war dort zu bestaunen.
</P><P>
Auf kleinen St&auml;nden waren bei Amiga auch andere Entwickler, Clubs und
kleine Firmen zu finden, sowie ein Internet-Cafe.
</P><P>
<A HREF="http://www.amiga.de/">http://www.amiga.de/</A>
</P><P>

<HR width=50%>

</P><P>
<B>Haage &amp; Partner</B> stellten auf dem Amiga-Stand ein neues Entwicklermodell
vor, das auf einem Standard-POP-Board (fr&uuml;her CHRP) von IBM basiert und
mit einem von H&amp;P zu entwickelnden nativen PPC-AmigaOS laufen k&ouml;nnte,
wenn Amiga bereit w&auml;re, die entsprechenden Lizenzen zu vergeben. Im
Moment bem&uuml;ht sich H&amp;P intensiv darum.
</P><P>
Auch auf dem eigenen Stand pr&auml;sentierte Haage &amp; Partner einen Gro&szlig;teil
des aktuellen Angebots, so z.B. 'Pagestream 4', 'Tornado 3D 3.0',
'ArtEffect 3.0', 'AmigaWriter' (die neue Version 2.0 l&auml;&szlig;t immer noch
auf sich warten), 'Warp 3D' und das Internet-Komplettpaket 'NetConnect
3.0', das u.a. die aktuelle Version 3.0 des Browsers 'Voyager' enth&auml;lt,
der endlich JavaSkript-Unterst&uuml;tzung bietet.
</P><P>
Gefragt waren hier auch die brandneuen '<B>AMIGA Developer-CDs 2.1</B>', die
u.a. den Ver&auml;nderungen und Erweiterungen des AmigaOS 3.5 Rechnung tr&auml;gt.
Als Sahnest&uuml;ckchen ist der StormC 68K C/C++ Compiler 3.0 enthalten.
</P><P>
<A HREF="http://www.haage-partner.com/">http://www.haage-partner.com/</A>
</P><P>

<HR width=50%>

</P><P>
Die Firma <B>Metabox</B>, obwohl ohne eigenen Messestand vor Ort, f&uuml;hrte
einen funktionsf&auml;higen Prototypen der G3-Turbokarte f&uuml;r den A 1200
'<B>AmiJoe 1200</B>' vor. Die Auslieferung ist f&uuml;r das n&auml;chste Jahr
vorgesehen.
</P><P>
<A HREF="http://www.metabox.de/">http://www.metabox.de/</A>
</P><P>

<HR width=50%>

</P><P>
<B>individual computers</B> stellte eine neue 10 MBit-Ethernet-Karte f&uuml;r die
Zorro-II-Schnittstelle vor. Sie bietet neben RJ-45 (&quot;Twisted Pair&quot;)
auch BNC-Anschl&uuml;sse.
</P><P>
Der 'SilverSurfer' ist ein MIDI-kompatible serielle Schnittstelle f&uuml;r den
A1200 und Buddha, die eine maximale Baudrate von 460.800 Baud m&ouml;glich
macht und durch gro&szlig;e Fifo's f&uuml;r geringe CPU-Belastung sorgt.
</P><P>
<A HREF="http://www.jschoenfeld.com/">http://www.jschoenfeld.com/</A>
</P><P>

<HR width=50%>

</P><P>
Auch <B>Stefan Ossowskis Schatztruhe</B> war wieder auf der Amiga-Messe vertreten
und bot einiges an Software feil, so z.B. 'DOpus Magellan' oder auch
'AmigaOS 3.5'.
</P><P>
<A HREF="http://www.schatztruhe.de/">http://www.schatztruhe.de/</A>
</P><P>

<HR width=50%>

</P><P>
Die <B>KATO Development Group</B> zeigte die neue serielle Schnittstellenkarte
'Twister 1200 NG', die von DCE gefertigt wird und dank automatischer
Datenflusskontrolle unabh&auml;ngig von der CPU eine Baudrate von 460.800
Baud erreicht. Sie ist kompatibel zur 'Melody 1200'.
</P><P>
Mit 'Unity Net' soll Anfang n&auml;chsten Jahres eine neue Fast-Ethernetkarte
f&uuml;r Zorro-II erscheinen, die u.a. 100Base-TX und 10Base-T (in diesem Modus
voll duplexf&auml;hig), 64 KB Datenpuffer, automatische Konfiguration, RJ-45
Anschlu&szlig; (&quot;Twisted Pair&quot;) und SANA 2-Treiber zu ihren Leistungsmerkmalen
z&auml;hlt.
</P><P>
<A HREF="http://www.katodev.de/">http://www.katodev.de/</A>
</P><P>

<HR width=50%>

</P><P>
<B>Titan Computer</B> pr&auml;sentierte eine Demo von 'Heretic II', das derzeit von
Hyperion Software auf den Amiga portiert wird. Voraussetzung wird ein
schneller PPC-Prozessor sein, eine 3D-Grafikkarte ist zus&auml;tzlich zu
empfehlen.
</P><P>
Auch das Morph-Programm 'Fantastic Dreams' war auf dem Stand zu bestaunen.
Es ist nun u.a. auch f&auml;hig einzelne Sequenzen als Animationen zu speichern.
</P><P>
<A HREF="http://www.titancomputer.de/ami/index.html">http://www.titancomputer.de/ami/index.html</A>
</P><P>

<HR width=50%>

</P><P>
<B>RBM Digitaltechnik</B> bietet Towergeh&auml;use, die man sich in der gew&uuml;nschten
Farbe markieren lassen kann.
</P><P>
Ebenfalls erh&auml;ltlich war das Scanprogramm 'ScanQuix 5', das nun u.a. das
ICS-Farbmanagement beherrscht.
</P><P>
<A HREF="http://www.rbm.de/">http://www.rbm.de/</A>
</P><P>

<HR width=50%>

</P><P>
<B>Paul Burkey</B>, Programmierer des Amiga-Spielehits 'Foundation' war auf dem
Epic Marketing-Stand. Er arbeitet im Moment an einem Update zu 'Foundation
- The Directors Cut', das dann auf der Homepage erh&auml;ltlich sein wird.
</P><P>
<A HREF="http://www.sneech.freeserve.co.uk/foundation.html">http://www.sneech.freeserve.co.uk/foundation.html</A>
</P><P>

<HR width=50%>

</P><P>
Weiterhin f&uuml;hrte <B>Epic Marketing</B> das neue Spiel 'Dafel Bloodline' vor. Das
actionlastige Rollenspiel erinnert an Zelda und wird neben AGA oder
Grafikkarten, auch ein neuartiges Surround-Soundsystem nutzen k&ouml;nnen.
</P><P>
<A HREF="http://epic-marketing.de/">http://epic-marketing.de/</A>
</P><P>

<HR width=50%>

</P><P>
Soviel ohne Anspruch auf Vollst&auml;ndigkeit zu den wichtigsten Neuigkeiten
von der HEW 99.
</P><P>
Weitere Neuigkeiten finden Sie bei <A HREF="../amz1299/news.htm">Am Puls</A>.
</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../amz1299/web_adv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../amz1299/iv.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
