<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - Interna Infernale</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN="CENTER"><H1>Interna Infernale</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<H3><B>Interna allgemein</B></H3>

<P>
Nachdem unsere <B>Coder's Corner</B> f&uuml;r eine gewisse Zeit unter keiner
speziellen Obhut mehr war, hat sich nun mit <B>Marco Miljak</B> ein neuer
Redakteur f&uuml;r diese Aufgabe gefunden. Wie &uuml;blich ist diese erste
Ausgabe an der er mitwirkt, seine 'Probezeit'.
</P><P>
Wer ihn unterst&uuml;tzen m&ouml;chte, der lese bitte seine <A HREF="../cc/9912bas.htm">Einf&uuml;hrung</A>.
</P><P>

<HR WIDTH=50%>

</P><P>
Unser MMX-Redakteur <B>André Wyrwa</B> ist derzeit fern von Heim und Herd,
bzw. auch Computern, und konnte sich daher f&uuml;r diese Ausgabe nicht
selbst um die 'Media Mal X'-Rubrik k&uuml;mmern.
</P><P>
<HR WIDTH=50%>
</P><P>
Die <B>E-Mail-Adresse</B> unseres freien Autoren J&uuml;rgen Rosch hat sich
ge&auml;ndert. Er ist nun unter <a href="mailto:GrafikArtStudio@gmx.de">GrafikArtStudio@gmx.de</A> oder
<a href="mailto:GMJ.Rosch@t-online.de">GMJ.Rosch@t-online.de</a> zu erreichen.
</P><P>
<HR WIDTH=50%>
</P><P>
Wir verl&auml;ngern das <B>Jubil&auml;ums-Preisausschreiben</B>, in Absprache mit dem
APC&amp;TCP bis zum 18. M&auml;rz. Es gibt zwei Exemplare von &quot;<B>Phoenix</B>&quot;
- dem Weltraumkampfspiel in WingCommander-Tradition, das auf dem Amiga
vermutlich Ma&szlig;st&auml;be setzen wird, zu gewinnen.
</P><P>
Sobald es verf&uuml;gbar ist, gehen die Exemplare an die Gewinner - vermutlich
noch bevor der Handel beliefert wird!
</P><P>
Sie m&uuml;ssen eine <B>Gewinnfrage</B>, die ich gleich stelle, beantworten. Senden
Sie die Antwort <B>bis zum 18. M&auml;rz 2000</B> per eMail oder Postkarte <B>an
den APC&amp;TCP</B> mit dem Stichwort &quot;AmZeiger&quot; (bei der eMail unter Betreff).
</P><P>
Die Adresse lautet: APC&amp;TCP, Postfach 83, D-83236 &Uuml;bersee;<a href="mailto:Andreas@chiemgau.baynet.de">
                    Andreas@chiemgau.baynet.de</A>
</P><P>
Angeh&ouml;rige der Redaktion des AmZeigers, sowie des APC&amp;TCP-Vorstands
d&uuml;rfen nicht teilnehmen. Der Rechtsweg ist ausgeschlossen.
</P><P>
Nun aber <B>die Frage:</B>
</P><P>
&quot;Wie lautet die Langform der Abk&uuml;rzung ALF, die, neben unserer
Interpretation 'AmZeiger-LeserForum', auch &uuml;blich ist und die
so gar nichts mit Computern zu tun hat?&quot;
</P><P>
Wir lassen eine bestimmte deutsche und englische Variante gelten.
Die Gewinner werden in der n&auml;chsten Ausgabe bekanntgegeben.
</P><P>
Viel Gl&uuml;ck!
</P><P>
<HR WIDTH=50%>
</P><P>
Diesmal gibt es wieder 'nur' ein Mitglied der <A HREF="../infml.htm">Abo-Mailingliste</A>, dessen
eMail-Adresse nicht mehr korrekt ist. Wenn Michael Cygon trotzdem mitliest
und sich entdeckt: Bitte melden!
</P><P>
Hier die ung&uuml;ltige Adresse:
</P><P>
pizza@santana.gun.de
</P><P>
<hr width=70%>

<H2 align=center><B>Hinweise zu dieser Ausgabe #10</B></H2>

</P><P>
Es ist nun doch eine Dezember-Ausgabe geworden. Zur <B>Verz&ouml;gerung</B> siehe
<A HREF="../amz1299/about.htm">Editorial</A>.
</P><P>
<hr width=50%>
</P><P>
Probleme gab es dieses Mal beim sinnvollen F&uuml;llen der <B>Hardware-Rubrik</B>.
F&uuml;r die Zukunft k&ouml;nnen Sie uns ganz sicher <A HREF="../hw/9912maus.htm">helfen</A>!
</P><P>
<hr width=50%>
</P><P>
Als <B>Tips</B> f&uuml;r diese Ausgabe kann ich den intensiven <A HREF="../cc/9912poin.htm">Pointer-Workshop</A>
f&uuml;r Programmierer empfehlen. Die PD- und Software-Rubriken sind mit
einigen interessanten Tests gef&uuml;llt, alleine <A HREF="../sw/9912wast.htm">Wasted Dreams</A> haben
wir schon oft vergeblich angek&uuml;ndigt.
</P><P>
Auch die dieses Mal wieder wohlgef&uuml;llte <A HREF="../mmx/9912mmx.htm">Media Mal X-Rubrik</A> mu&szlig; ich
einfach erw&auml;hnen.
</P><P>
<hr width=70%>

<H2 align=center><B>Hinweise zur letzten Ausgabe #9</B></H2>
</P><P>
<B>Nachtr&auml;ge zur - HTML-Ausgabe:</B>
</P><P>
Im Gesamt-Artikelverzeichnis war das <a href="../amz0399/iv.htm">Interview</A> mit Petra Struck
(Ausgabe #8) versehentlich entfernt worden.
</P>
<hr width=50%>
<P>
Aus nicht nachvollziehbaren Gr&uuml;nden waren ebenfalls im
Artikelverzeichnis alle lokalen Links bei <a href="../artverz/art_m1.htm">MMX-Buch</A> defekt.
</P><P>
Beides ist mit dieser Ausgabe behoben.
</P><P>
<hr width=70%>

<H2 align=center><B>Hinweise zur n&auml;chsten Ausgabe #11</B></H2>

</P><P>
Neben den Fortsetzungen zu den jeweiligen Kursteilen gibt es u.a. einen
Test des AmigaOS 3.5, der Amiga Developer-CD 2.1, der Wirtschaftssimulation
'Seaside' und des Updates von Amiga Forever.
</P><P>
Der AmZeiger wird voraussichtlich Ende Februar/Anfang M&auml;rz 2000 erscheinen.
Diesmal hoffentlich p&uuml;nktlicher.
</P><P>
Mit <B>W&uuml;nschen, Hinweisen</B> oder sogar eigenen Artikeln, einfach <A HREF="../kontakt.htm">hier</A> melden!
</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../amz1299/pdnews.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../alf/9912alf.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
