<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - Interview: Felix Schwarz</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>Interview</U></H1><P ALIGN="CENTER">mit<BR><b>Felix Schwarz</b></P>

<P>
     <B>Innovative</B> entwickelt schon seit l&auml;ngerem hochwertige Software
     f&uuml;r den Amiga, z.B. UltraConv. Mit der Internet-Pr&auml;sentation
     und phantastisch anmutenden Presseerkl&auml;rungen vom Sommer diesen
     Jahres, die die neue Bildbearbeitung fxPaint ank&uuml;ndigten, wurde
     auch der Name der Firma dahinter bekannter.
</P><P>
     Mit dem Macher von Innovative, Felix Schwarz, f&uuml;hrte ich vor der
     Messe <A HREF="../amz1299/hewb.htm">HEW 99</A> dieses Interview. Inzwischen ist fxPaint, wie
     angek&uuml;ndigt, p&uuml;nktlich erschienen.
</P>

<P><B>
AmZ:</b> Gregor Franz <br>
<b>FS :</b> Felix Schwarz         </P>

<hr>
 
<P>
<TABLE BORDER="1">
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
<TD>Kannst Du uns zuerst etwas zu Innovative selbst sagen? Seit wann
     gibt es Euch, wie fing alles an und wer steht dahinter? </TD>
</TR>
<TR BGCOLOR="#DADADA">
<TH>FS :</TH>
<TD>Innovative war zuerst nur eine Bezeichnung f&uuml;r die AMIGA-
     Produktreihe. Mit dem AMIGA arbeiten wir seit 1991, die ersten
     Entwicklungsarbeiten an unserem ersten kommerziellen
     Softwareprodukt (Ultraconv) begannen 1995.
</P><P>
     Version 1.0 war nur ein einfaches Programm zum Skalieren von
     Hunderten von Grafiken. Seither hat sich nat&uuml;rlich viel getan:
     Ultraconv ist heute der Converter mit den umfangreichsten
     Konvertier- und Bearbeitungsm&ouml;glichkeiten und wird auch gerne
     im Profi-Sektor eingesetzt, z.B. von verschiedenen kleineren
     Lokalsendern oder aber auch von Videoproduktionsfirmen wie IOM.
</P><P>
     Mittlerweile ist auch unser Team gr&ouml;&szlig;er geworden, wobei ich nach
     wie vor den L&ouml;wenanteil der Arbeit bew&auml;ltige, wie etwa Vertrieb,
     Webdesign, Entwicklung und PR. Vor Kurzem ist auch ein Grafiker
     zu uns gestossen, der in Zukunft daf&uuml;r sorgen wird, dass die
     Oberfl&auml;chen unserer Produkte genauso gut aussehen wie das Produkt
     selbst ist.
</P><P>
     Ansonsten arbeiten noch einige andere Software-Entwickler an
     Zusatzmodulen oder Teilen unserer Software. Hier setzen wir auf
     Spezialisten auf ihrem Gebiet, um h&ouml;chste Qualit&auml;t zu garantieren.
     F&uuml;r die Zukunft planen wir auch den Vertrieb von Software, die
     nicht aus unserem Hause stammt. An einer Zusammenarbeit
     interessierte Entwickler k&ouml;nnen sich auch jetzt schon unter
     sales@innovative-web.de an uns wenden.
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
<TH>AmZ:</TH><TD> Innovative's verf&uuml;gbares Software-Repertoire enth&auml;lt einige Amiga-
     Perlen wie UltraConv, BlackIRC und VLRec NG. Wie werden sie von
     den Kunden angenommen? L&auml;uft das Gesch&auml;ft ausreichend gut in der
     im allgemeinen Umfeld ansonsten angespannten Situation?</TD>
</TR>   
<TR BGCOLOR="#DADADA">  
<TH>FS :</TH><TD> Unsere Produkte wurden durchweg gut aufgenommen. Vor allem VLRec NG
     erfreut sich einer hohen Beliebtheit, was wohl vor allem an der
     einfachen Handhabung und der dennoch hohen Flexibilit&auml;t dieses
     Produkts liegt.
</P><P>
     Ultraconv ist unser Flaggschiff und hat sich in den letzten Jahren
     zum beliebtesten Konverter und Animationstool auf dem AMIGA
     entwickelt.
</P><P>
     Auch BlackIRC findet guten Anklang, allerdings bisher noch nicht
     in dem Umfang, den wir uns anfangs erhofft haben. Wer es allerdings
     einmal benutzt hat, wird es nie mehr missen wollen. Leider haben
     hier Raubkopien die Verkaufszahlen stark gedr&uuml;ckt, weshalb BlackIRC
     z. Zt. auch nicht die h&ouml;chste Priorit&auml;t bei der Weiterentwicklung
     hat.
</TD></TR>
<TR BGCOLOR="#FFFFFF">
<TH>AmZ:</TH><TD> Noch in diesem Jahr wollt Ihr mit fxPAINT eine neue Bildbearbeitung
     vorstellen, die so ziemlich alles bisher Dagewesene in den Schatten
     stellen soll. Wie liegt Ihr im Zeitplan und was wird, kurz gesagt,
     fxPAINT seinen Konkurrenten voraus haben?</TD></TR>
<TR BGCOLOR="#DADADA">
<TH>FS :</TH><TD>fxPAINT ist quasi fertig. &quot;Quasi&quot; heisst, dass es absolut stabil
     l&auml;uft, alle angek&uuml;ndigten Features (und mehr!) einwandfrei
     funktionieren und implementiert wurden. Die n&auml;chsten Wochen wird
     die CD-R zusammengestellt und fxPAINT der letzte Schliff verpasst,
     evtl. auch nochmals neue Filter hinzugef&uuml;gt. Die Verpackung ist
     bereits fertiggestellt und ein &quot;Preview&quot; derselben wird demn&auml;chst
     auf unserer Homepage zu bestaunen sein. Am 8. Oktober geht die CD
     dann final in Produktion. Auf der Home Electronics World wird
     fxPAINT also mit absoluter Sicherheit zu kaufen sein.
</P><P>
     fxPAINT hat in vielen Punkten einen enormen Vorsprung vor seinen
     Konkurrenten. Neben der umwerfenden Oberfl&auml;che, der offenen
     Architektur, der vollen PPC-Unterst&uuml;tzung und einzigartigen Effekten
     (z.B. die Mosaik-Funktion, die ein Bild durch viele kleinere Bilder
     ersetzt (wie auf dem Filmplakat zu &quot;The Trueman Show&quot;) - allein
     dieser Effekt kostet Sie auf dem PC-Markt 100 DM, auf dem AMIGA-
     Markt ist fxPAINT das einzige Produkt, dass diesen Effekt bietet)
     geht fxPAINT weit &uuml;ber die Funktionalit&auml;t eines gew&ouml;hnlichen
     Bildbearbeitungs- und Zeichenprogramms hinaus und enth&auml;lt zus&auml;tzlich
     eine Bildverwaltung (fxALBUM), ein Konvertiermodul (fxCONV) und
     Unterst&uuml;tzung f&uuml;r quasi jede aktuelle und h&auml;ufig eingesetzte Hard-
     und Software (VLab, PPC, ScanQuix, ...). Auch das Bildverwaltungstool
     ist &auml;u&szlig;erst m&auml;chtig, erlaubt den Export von Alben als HTML&amp;JPEG-Datei,
     den Druck von &Uuml;bersichten, eine Einbindung in fxCONV etc.
</P><P>
     Was mich pers&ouml;nlich besonders stolz macht, ist die Tatsache, dass
     fx-PAINT als erstes Produkt auf dem AMIGA &uuml;berhaupt volle
     Unterst&uuml;tzung von AmigaOS 3.5 bietet. Der neue Icon-Standard wird
     genauso unterst&uuml;tzt, wie die neuen Bilddatatypes und Druckermodule.
     &Uuml;ber ein spezielles Plugin ist es sogar m&ouml;glich, die Workbench zu
     erweitern und quasi wie ein Modul in fxPAINT einzubinden.
</P><P>
     Wie leicht zu erkennen ist, geht fxPAINT in allen Bereichen wirklich
     ins Detail - kein Bereich wurde oberfl&auml;chlich realisiert, sondern bis
     ins letzte Detail ausgefeilt.
</TD></TR>
<TR BGCOLOR="#FFFFFF">
<TH>AmZ:</TH><TD> Vor der Pressemitteilung vom Juli diesen Jahres hat man von diesem
     offensichtlich sehr umfangreichen und aufwendigen Projekt noch nichts
     geh&ouml;rt gehabt. Wie kommt das und wann begann die Entwicklung von
     fxPAINT?</TD></TR>
<TR BGCOLOR="#DADADA">
<TH>FS :</TH><TD> Die Entwicklungsarbeiten an fxPAINT begannen im November 1998. Es
     d&uuml;rfte viele verwundern, wie es m&ouml;glich ist, in weniger als einem
     Jahr ein derartiges Produkt auf die Beine zu stellen. Das stellt
     aber f&uuml;r uns kein Problem dar, da der Gro&szlig;teil des ben&ouml;tigten
     Wissens zur Realisierung bereits von anderen Projekten (vor allem
     Ultraconv und VLRec) vorhanden war. Obwohl fxPAINT keine Zeile
     Sourcecode mit diesen Projekten teilt, sondern eine komplette
     Neuentwicklung darstellt, war der Gro&szlig;teil des Projekts (vor
     allem der Effekte) schnell realisiert. Das fxPAINT-Logo etwa
     wurde im Februar erstellt, mit V0.2&szlig; von fxPAINT!
</P><P>
     Das vor Juli nichts bekannt wurde, hat mehrere Gr&uuml;nde. Zum Einen
     wollten wir den Konkurrenten nicht zu fr&uuml;h die M&ouml;glichkeit geben,
     neue, innovative Features von der Featuresliste zu &quot;klauen&quot; (und
     deshalb wurden auch noch nicht alle ver&ouml;ffentlicht!) und zu
     implementieren, zum Anderen k&uuml;ndigen wir erst dann ein Produkt an,
     wenn sicher ist, dass es auch in vollem Umfang realisiert werden
     wird, um nachhaltigen, negativen Entt&auml;uschungen unter den Anwendern
     wie nach Ank&uuml;ndigungen anderer Hersteller vorzubeugen.
</TD></TR>
<TR BGCOLOR="#FFFFFF">
<TH>AmZ:</TH><TD> Mit MultiLiveCam Pro habt Ihr, neben dem bekannten BlackIRC, ein
     Produkt, das speziell auf das Web ausgerichtet ist. UltraConv NG
     hat einen HTML-ImageMap-Editor eingebaut, Bestellungen lassen sich
     direkt &uuml;ber Eure Web-Site abwickeln.
</P><P>
     Offensichtlich stellt das Internet einen wichtigen Faktor f&uuml;r
     Innovative dar. Wie wichtig, meinst Du, ist es wirklich f&uuml;r Euch?
     Wird das Internet zur letzten Chance f&uuml;r Nischenm&auml;rkte?
</TD></TR>
<TR BGCOLOR="#DADADA">
<TH>FS :</TH><TD> Das Internet ist der Markt der Zukunft und tats&auml;chlich wird ein
     Gro&szlig;teil unserer gesch&auml;ftlichen T&auml;tigkeiten &uuml;ber das Internet
     abgewickelt. Auch die Entwicklungen werden &uuml;ber das Internet
     koordiniert. Zudem bieten wir ja auch Webservices an, die sich immer
     gr&ouml;&szlig;erer Beliebtheit erfreuen. Von Newsletter-Engines &uuml;ber Foren,
     Chatrooms, e-commerce-L&ouml;sungen, Countern und Inno-GEMM, einem Produkt
     zum globalen Managen von E-Mails bieten wir die gesamte Palette.
</P><P>
     Zu unseren Kunden in diesem Bereich z&auml;hlen unter anderem SAT.1 mit
     Ihrem SAT.1-Text-Newsletter, die amigaOS und die Amiga Future, sowie
     der Multimedia-Spezialist Cash Multimedia. Nicht zuletzt spielt auch
     die Faszination und die M&ouml;glichkeiten f&uuml;r dieses neue Medium eine
     entscheidende Rolle.
</TD></TR>
<TR BGCOLOR="#FFFFFF">
<TH>AmZ:</TH><TD> Das erw&auml;hnte MultiLiveCam Pro basiert auf einer Entwicklung, die
     urspr&uuml;nglich f&uuml;r eine Internet-Pr&auml;sentation von BMW programmiert
     wurde. Wie kam es dazu und setzt es der Autohersteller noch ein?
</TD></TR>
<TR BGCOLOR="#DADADA">
<TH>FS :</TH><TD> Ich weiss nicht, wie das &quot;CU AMIGA Magazine&quot; damals auf uns kam, aber
     die britische Videoproduktionsfirma &quot;vitesse communications Brian
     Mayor&quot; rief uns an und fragte uns, ob wir eine LiveCam-L&ouml;sung
     realisieren k&ouml;nnten, die den Betrieb mehrerer LiveCams an einem
     System erlaubt. Tats&auml;chlich waren/sind PC-Systeme, die dies leisten
     entweder nicht erschwinglich oder einfach nicht zu haben. Unser
     Produkt f&uuml;llt also eine echte Marktl&uuml;cke.
</P><P>
     Wie sich herausstellte, war die Firma von BMW damit beauftragt
     worden, ein entsprechendes System auf einer Baustelle f&uuml;r ein neues
     BMW-Werk aufzustellen und den Fortgang des Projekts im Web zu zeigen
     und eine Zeitrafferanimation zu erstellen. Daraus entstand
     MultiLiveCam pro 1.0.
</P><P>
     Da ich seit Lieferung des Systems an &quot;vitesse communications&quot; leider
     keinen Kontakt mehr mit dieser Firma habe, wei&szlig; ich leider nicht, ob
     es noch im Einsatz ist. Es ist allerdings anzunehmen, denn mir ist
     kein anderes System auf dem Markt bekannt, dass f&uuml;r unter 1000 DM
     eine selbstst&auml;ndige Einheit bildet (incl. Rechner, Modem, Festplatte
     zur Aufnahme der Zeitrafferanimation, etc.), mehrere Eing&auml;nge sowie
     eine hohe Qualit&auml;t bietet.
</TD></TR>
<TR BGCOLOR="#FFFFFF">
<TH>AmZ:</TH><TD> Was k&ouml;nnen wir in n&auml;chster und fernerer Zukunft von Innovative noch
     erwarten? Habt Ihr weitere Pfeile im K&ouml;cher?
</TD></TR>
<TR BGCOLOR="#DADADA">
<TH>FS :</TH><TD> Zun&auml;chst einmal wird fxPAINT 1.0 kommen. Entweder gleichzeitig oder
     davor wird es ein umfangreiches Update von VLRec NG auf Version 3.5
     geben, das einen neuen Standard auf dem AMIGA definieren wird. Evtl.
     (das ist noch nicht ganz sicher und h&auml;ngt auch nicht von uns alleine
     ab) wird es auf der K&ouml;lner Messe auch noch eine oder zwei weitere
     &Uuml;berraschungen geben. Auch nach der Messe ist nat&uuml;rlich weiter mit
     uns und neuen Produkten zu rechnen.
</TD></TR>
<TR BGCOLOR="#FFFFFF">
<TH>AmZ:</TH><TD> In Eurer letzten Pressemitteilung erw&auml;hnt Ihr die &quot;K&ouml;lner Messe&quot;.
     Aus gutem Grund, denn sie hat Ihren Namen ja schon wieder gewechselt.
     Ist Innovative als Aussteller vertreten? Wenn ja, sind au&szlig;er dem
     erneuten Bezeichnungswechsel weitere Ver&auml;nderungen im Messekonzept
     sp&uuml;rbar?
</TD></TR>
<TR BGCOLOR="#DADADA">
<TH>FS :</TH><TD> Wir werden auf der &quot;Home Electronics World&quot; (so der derzeitige Name)
     vertreten sein. Meine Wenigkeit wird am Freitag, Samstag und Sonntag
     auf dem Stand von rbm digitaltechnik fxPAINT vorf&uuml;hren. fxPAINT wird
     dort auch zum Messepreis zu kaufen sein.
</TD></TR>
<TR BGCOLOR="#FFFFFF">
<TH>AmZ:</TH><TD> Auch das Amiga-OS 3.5 soll, unabh&auml;ngig von allen Querelen, unter der
     Federf&uuml;hrung von Haage &amp; Partner auf der Messe erscheinen. Was h&auml;ltst
     Du von dem Update in dieser Form?
</TD></TR>
<TR BGCOLOR="#DADADA">
<TH>FS :</TH><TD> Das AmigaOS 3.1 ist einfach nicht mehr ganz der Stand der Dinge und
     viele entscheidende Fragen sind ungekl&auml;rt oder bleiben unbeantwortet.
     Zudem ersticken wir Entwickler zunehmend an einer dichten Decke von
     amateurhaft programmierten Hacks, die das System instabil und
     inkompatibel machen.
</P><P>
     OS 3.5 ist zwar nicht das Allheilmittel, bedeutet aber einen Schritt
     nach vorne. Es wurden einige Fragen bzgl. Standards endlich eindeutig
     gekl&auml;rt und wichtige Teile des Betriebssystems &uuml;berarbeitet und
     erweitert. Ich war noch vor einem Jahr ein gro&szlig;er Kritiker an dem
     Projekt. Nachdem ich nun Einblick in die OS 3.5-Interna erhalten
     habe, bin ich allerdings der Auffassung, dass jeder AMIGA-Anwender
     sich dieses Update holen sollte, da damit fantastische neue
     M&ouml;glichkeiten geboten werden. Diese neuen M&ouml;glichkeiten wird
     fxPAINT als erstes AMIGA-Programm durchgehend nutzen und ist auch
     deswegen jedem OS 3.5-K&auml;ufer ans Herz zu legen. Vor allem das
     Workbencherweiterungs-Plugin von fxPAINT ist im Alltag ungeheuer
     n&uuml;tzlich.
</TD></TR>
<TR BGCOLOR="#FFFFFF">
<TH>AmZ:</TH><TD> Ein leidiges, wenngleich auch ergiebiges Thema, ist sicherlich der
     Trudelkurs von Amiga respektive Gateway. Kannst Du ein kurzes
     Statement zur Lage der Dinge aus Deiner Sicht geben? Werdet Ihr
     Konsequenzen ziehen und wie sind die diversen Versuche von dritter
     Seite, den Amiga oder zumindest die Amiga-Idee am Leben zu erhalten
     (Phoenix, AQUA, IMP, KOSH, AROS), zu bewerten?
</TD></TR>
<TR BGCOLOR="#DADADA">
<TH>FS :</TH><TD> Was hat sich ge&auml;ndert? AMIGA hat bisher kein einziges Produkt auf
     die Beine stellen k&ouml;nnen, seit Jahren bewegt sich nichts. Umso
     wichtiger sehen wir die Ver&ouml;ffentlichung von AmigaOS 3.5 und einem
     baldigen Erscheinen des BoXeR und der G4-Karten an.
</P><P>
     Ich kann auch das Entsetzen vieler Nutzer nach dem Weggang von
     Collas nicht ganz verstehen, denn jeder, der einen scharfen Blick
     auf die Ank&uuml;ndigungen geworfen hat, wird festgestellt haben, dass
     Amiga Inc. wieder einmal nur leere Versprechungen in die
     &Ouml;ffentlichkeit geworfen hat. Firmen wie die SuSe GmbH aus N&uuml;rnberg
     arbeiten schon jahrelang an einer benutzerfreundlichen Linux-
     Distribution und AMIGA Inc. will das quasi &uuml;ber Nacht
     bewerkstelligen, einen kompletten Rechner dazu entwickeln (Linux
     auf 32 MB Ram LAUFEN lassen ??) und dabei noch innovativ sein.
</P><P>
     Auch die Spezifikationen des &quot;AMIGA MCC&quot; lassen stark daran zweifeln,
     dass dieser Rechner preislich f&uuml;r den Massenmarkt geeignet w&auml;re.
</P><P>
     Da sich AMIGA Inc. bisher vor allem durch unprofessionelles Auftreten
     und Sch&auml;digen des AMIGA-Marktes profilieren konnte, zuletzt sogar
     besser wissen wollte, was den AMIGA ausmacht, als die AMIGA-Gemeinde
     selbst, kann diese &quot;Firma&quot; nicht mehr ernst genommen werden, bevor
     nicht etwas Konkretes zu sehen ist (und damit meine ich jetzt nicht
     Bleistifte, Kartenspiele, Socken oder Feuerzeuge). Die wahren
     Entwickler und Handelnden sitzen bei Haage &amp; Partner (AmigaOS 3.5),
     Phase 5 (G4-Karten), Access Innovations (BoXeR) und nat&uuml;rlich bei
     uns. :)
</P><P>
     Wir selbst sind dem Phoenix Consortium beigetreten, d.h. aber nicht,
     dass wir in Zukunft alle beschlossenen Handlungen desselben billigen,
     vielmehr wollen wir damit zeigen, dass wir dem AMIGA auch weiterhin
     die Treue halten werden und an einer Zukunft dieses Systems grosses
     Interesse haben.
</P><P>
     Abschliessend l&auml;sst sich sagen, dass es nicht an AMIGA Inc. liegt,
     ob wir den AMIGA unterst&uuml;tzen oder nicht, sondern an den Anwendern
     und ihrer Bereitwilligkeit, uns zu unterst&uuml;tzen: Piraterie killt
     den AMIGA!
</TD></TR>
<TR BGCOLOR="#FFFFFF">
<TH>AmZ:</TH><TD> Themawechsel: Ein Blick zur&uuml;ck in die gute alte Zeit. ;)  Wann und
     wie bist Du eigentlich zum Computern gekommen?
</TD></TR>
<TR BGCOLOR="#DADADA">
<TH>FS :</TH><TD> Mit der Programmiererei angefangen habe ich auf einem ZX Spectrum.
     Das war 1988. Ein gro&szlig;artiger Computer, mit dem sich viele
     interessante Sachen machen liessen und der, &auml;hnlich wie der
     AMIGA, seiner Zeit voraus war.
</TD></TR>
<TR BGCOLOR="#FFFFFF">
<TH>AmZ:</TH><TD> Wie sieht Dein Leben abseits des Amigas aus? Was machst Du sonst
     so und welche anderen Hobbys besch&auml;ftigen Dich?
</TD></TR>
<TR BGCOLOR="#DADADA">
<TH>FS :</TH><TD> Abseits des AMIGAs gibt es nicht viel Zeit f&uuml;r andere Dinge (in
     stressigen Zeiten wie diesen verbringe ich schon einmal 8-12
     Stunden vor dem AMIGA, um Termine einzuhalten). Sollte ich dennoch
     abends einmal einige freie Zeit finden, so trifft man mich oft in
     lokalen Diskotheken oder Kinos beim Abspannen.
</TD></TR>
<TR BGCOLOR="#FFFFFF">
<TH>AmZ:</TH><TD> Unsere Standardfrage darf nicht fehlen: Kanntest Du den AmZeiger
     vor der Interview-Anfrage und wie findest Du ihn?
</TD></TR>
<TH>FS :</TH><TD> Ich kannte den AmZeiger schon davor und halte ihn f&uuml;r sehr gut
     gelungen.
</TD></TR>
<TR BGCOLOR="#FFFFFF">
<TH>AmZ:</TH><TD> Vielen Dank f&uuml;r das Interview!</TD></TR>
</P>
</TABLE>
<P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../amz1299/hewb.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../sw/9912geo.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
