<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - Am Puls</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U><A NAME="Top">Am Puls - Kurzmeldungen:</A></U></H1><P ALIGN="CENTER">
<A HREF="#Software">Software</A> / <A HREF="#Hardware">Hardware</A> / <A HREF="#Spiele">Spiele</A> / <A HREF="#Sonstiges">Sonstiges</A><br>
Weitere News: <a href="pdnews.htm">PD-News-Box</a></p>

<H2 ALIGN="CENTER">Amiga-Allgemein</H2>

</P><P>
Ein kurzer Abri&szlig; der Amiga Inc.-Geschehnisse im zweiten Halbjahr des letzten Jahres:

</P><P>
Am 8. Juli teilt <B>QNX</B>, die Firma, die von Amiga im letzten Herbst als
Lieferant des zuk&uuml;nftigen Amiga-OS bekanntgegeben wurde, in einer
Presseerkl&auml;rung mit, da&szlig; ihre Bem&uuml;hungen, das neue OS fertigzustellen,
planm&auml;&szlig;ig laufen und die Amiga-Anwender, sowie -Entwickler von nun an
intensiver in die Vorbereitungen einbezogen werden sollen. Ein spezielles
Unterst&uuml;tzungsprogramm w&uuml;rde initiert werden, Entwickler kostenlos mit
Support-Paketen versorgt.
</P><P>
<hr width="25%">
</P><P>
Einen Tag sp&auml;ter, am 9. Juli, erscheint auf der Amiga-Website eine kurze
Erkl&auml;rung, da&szlig; sich Amiga f&uuml;r <B>Linux</B> als Basis des zuk&uuml;nfigen Amiga-OS
entschieden h&auml;tte. Auf QNX wird nicht eingegangen, Details sind nicht
erw&auml;hnt.
</P><P>
<hr width="25%">
</P><P>
Danach treibt gro&szlig;e <B>Unruhe</B> die 'Amiga-Gemeinde' um. Weitere Erkl&auml;rungen
von verschiedenen Seiten folgen und Jim Collas, Pr&auml;sident von Amiga
versucht die Entscheidung mittels seiner Autorit&auml;t und pers&ouml;nlichen
&Uuml;berzeugungskraft zu legitimieren und den Amiga-Anwendern zu vermitteln.
</P><P>
<hr width="25%">
</P><P>
Am 1. September wird bekannt, da&szlig; <B>Jim Collas</B>, erst seit Februar
vielgelobter neuer Amiga-Chef, von seinem Posten zur&uuml;cktrat. Eine
Erkl&auml;rung &uuml;ber seine Gr&uuml;nde gibt es nicht.
</P><P>
Neuer Pr&auml;sident wird sein Stellvertreter <B>Thomas J. Schmidt</B>. Er gibt
bekannt, da&szlig; Pl&auml;ne, Hardware zu entwickeln fallengelassen wurden und
stattdessen bahnbrechende Internet-L&ouml;sungen (sogenannte 'Internet
Appliances') herausgebracht werden sollen. Der Idee, einen AmigaNG
m&ouml;glicherweise durch Drittfirmen realisieren zu lassen, steht er
offen gegen&uuml;ber.
</P><P>
<hr width="25%">
</P><P>
Von den Querelen unbeeindruckt l&auml;uft das Betatest-Programm des <B>Amiga-OS
3.5</B> f&uuml;r die bestehenden Amigas erfolgreich an und die Auslieferung
beginnt nach verh&auml;ltnism&auml;&szlig;ig kurzer Verz&ouml;gerung im September.
Voraussetzung zum Betrieb ist ein Kickstart 3.1-ROM.
</P><P>
<A HREF="http://www.qnx.com/amiga/">http://www.qnx.com/amiga/</A>
<A HREF="http://www.amiga.com/">http://www.amiga.com/</A>
<A HREF="http://www.amiga.de/">http://www.amiga.de/</A>
</P><P>
</P><P>
</P><P>
<hr width="50%">
</P><P>
QNX will sein <B>Neutrino OS</B> f&uuml;r die PowerUp-Karten von Phase 5 umsetzen.
Es soll mit den neuen G3/G4-Karten des Oberurseler Hardware-Herstellers
im Herbst ausgeliefert werden und auch auf PPC 603 und 604 laufen, sowie
f&uuml;r deren Nutzer kostenlos erh&auml;ltlich sein. Ein 68000-Emulator von Phase
5 wird f&uuml;r Amiga OS 3.x-Support sorgen.
</P><P>
<hr width="50%">
</P><P>
Das Printmagazin <B>Amiga Special</B> wurde eingestellt.
</P><P>
<hr width="50%">
</P><P>
Die <B>Amiga Future</B> hat nun auch ein Web-Angebot:
</P><P>
<A HREF="http://www.amigafuture.de/">http://www.amigafuture.de/</A>
<hr width="50%">
</P><P>
Die Zeitschrift '<B>Amiga Plus</B>' geht in der 'AmigaOS' auf, was faktisch
einer Einstellung gleichkommt. Abonnements werden von der 'AmigaOS'
&uuml;bernommen, die 'AmigaFuture', als Sonderpublikation der 'Amiga Plus',
vorl&auml;ufig weitergef&uuml;hrt.
</P><P>
<A HREF="http://www.amigaplus.de/">http://www.amigaplus.de/</A>
<hr width="50%">
</P><P>
Die im November stattfindende Messe 'Computer 99' ist in <B>Home
Electronics World 99</B> umbenannt worden.
</P><P>

<HR WIDTH="100%">
<A NAME="Hardware"><H2 ALIGN=CENTER>Hardware</H2></A>
</P><P>
Die Oberhausener DCE GmbH wird, neben einem Teil der Phase 5-
Produktpalette (s. 'Am Puls' im AmZeiger #9), auch die Soundkarte
'<B>Melody 1200</B>' (Base und Pro) und die serielle Schnittstelle '<B>Twister
1200</B>' der Firma KATO Development Group in Lizenz fertigen.
</P><P>
<A HREF="http://www.dcecom.de/">http://www.dcecom.de/</A><p></p>
<hr width="50%">
</P><P>
Phase 5, deren neue <B>G4-PPC-Turbokarten</B> sich offensichtlich verz&ouml;gern,
will nun doch nicht standardm&auml;&szlig;ig SCSI und IEEE-1394 integrieren, um die
Kosten zu senken. Sp&auml;tere Erweiterungen k&ouml;nnen &Uuml;ber Mini-PPC-Konnektoren
nachger&uuml;stet werden. Au&szlig;erdem wird SDRAM verwendet und mit zwei USB-Ports
wird der Einsatz einer wachsenden Zahl von Peripherieger&auml;ten erm&ouml;glicht.
</P><P>
Auch eine neue Grafikkarte f&uuml;r die neuen Beschleunigerkarten ist geplant.
Sie soll unter dem Namen 'CyberVisionNG' einen aktuellen Grafikchip mit
128 Bit-Engine und 32 MByte f&uuml;r voraussichtlich 180 EURO bieten.
</P><P>
<hr width="25%">
</P><P>
Au&szlig;erdem werden nun doch keine G3-Karten, sondern ausschlie&szlig;lich G4-
Beschleuniger gefertigt werden. Vorbesteller einer 400 MHz G3-Karte
werden ohne Zusatzkosten mit einer 400 MHz G4-Karte beliefert.
</P><P>
<hr width="25%">
</P><P>
Nach den nicht realisierten Computersystemen A\Box und pre\box plant
Phase 5 nun den <B>AMIRAGE K2</B>.
</P><P>
Neben einer gro&szlig;en Anschlu&szlig;freudigkeit soll er vor allem durch seine
Multiprozessorf&auml;higkeit (bis zu vier PPC G4-CPUs), Geschwindigkeit und
den Einsatz des QNX Neutrino OS gl&auml;nzen.
</P><P>
Ein Amiga OS 3.x Legacy-Pack wird f&uuml;r die Verbindung und Unterst&uuml;tzung
des bestehenden Amiga-Systems sorgen. Die Spezifikationen der weiteren
genannten Merkmale k&ouml;nnen sich noch erheblich &auml;ndern.
</P><P>
Die Auslieferung ist f&uuml;r Anfang 2000 vorgesehen.
</P><P>
Da QNX aber bis mindestens Ende Oktober kein Entwicklersystem von
Phase 5 erhalten hat, wird die Firma nach eigener Aussage eine
Umsetzung von QNX Neutrino kaum im geplanten Zeitrahmen schaffen
k&ouml;nnen.
</P><P>
<A HREF="http://www.phase5.de/">http://www.phase5.de/</A>
<A HREF="http://www.qnx.de/">http://www.qnx.de/</A><p></p>
<hr width="50%">
</P><P>
<B>Village Tronic</B> sieht Probleme bei dem Absatz von Amiga-Produkten. Die
Ariadne II und das zuk&uuml;nftige 3D-Modul 'ParaGlide' f&uuml;r die Picasso IV
sollen weiterhin angeboten; Paloma, Pablo und Concierto eingestellt und
die Picasso IV nur nach gen&uuml;gender Vorbestellungszahl (bei den
Distributoren) in einer voraussichtlich letzten Serie neu aufgelegt
werden.
</P><P>
<hr width="25%">
</P><P>
Nach dem <B>Umzug</B> nach Hannover hat sich die Postanschrift des Unternehmens
ge&auml;ndert. Sie lautet nun:
</P><P>
Village Tronic Marketing GmbH, Karlsruher Str. 2b, 30519 Hannover
</P><P>
<A HREF="http://www.villagetronic.de">http://www.villagetronic.de</A><p></p>
<hr width="50%">
</P><P>
TGV Haupt bietet eine <B>Zorro IV</B>-Busplatine f&uuml;r Mikronik-, Elbox-, Winner-
und Power-Tower an. Es handelt sich um eine eigene Weiterentwicklung
des Zorro II-Standards.
</P><P>
Die Platine enth&auml;lt f&uuml;r 299,- DM f&uuml;nf Zorro II-Slots, zwei Z4-LocalSlots
(mit 19 MB/s die doppelte Busbandbreite von Zorro III), zwei Zorro II-
Slots - umschaltbar auf Fast-Z2, das doppelte Geschwindigkeit f&uuml;r speziell
angepa&szlig;te Karten bieten soll, und vier Uhren-Ports.
</P><P>
Modifizierte Erweiterungskarten sind in Vorbereitung.
</P><P>
<A HREF="http://www.tgv-haupt.de/">http://www.tgv-haupt.de/</A>
</P><P>
<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Software">Software</A></H2>
</P><P>
Die neue Grafikbearbeitung '<B>fxPAINT</B>' ist verf&uuml;gbar und besticht durch
Eigenschaften, wie volle PPC- und Grafikkarten-Unterst&uuml;tzung, Realtime-
Modus f&uuml;r die zahlreichen Effekte, intensive Unterst&uuml;tzung externer
Ger&auml;te, eine moderne Oberfl&auml;che und hohe Geschwindigkeit. Der Preis
betr&auml;gt 139,- DM.
</P><P>
[s. dazu auch unser <A HREF="../amz1299/iv.htm">Interview</A> mit Felix Schwarz von Innovative.]
</P><P>
<A HREF="http://www.innovative-web.de/">http://www.innovative-web.de/</A><p></p>
<hr width="50%">
</P><P>
Das Spezial-Effekte-Programm '<B>Wildfire 7\PPC</B>' ist im Preis von 279,- auf
249,- DM gesenkt worden. Das 100-min&uuml;tige Beispiel-Video 'Wildfire-f&uuml;r-
Movieshop-Operator' kostet nun statt 40 nur noch 35 DM.
</P><P>
Andreas K&uuml;ssner, Marrinksweg 5, 48531 Nordhorn
E-Mail: eksec@eure.de<p></p>
<hr width="50%">
</P><P>
Von Great Effects Development erscheint nun bei Schatztruhe die Version
3 des <B>'PFS'</B> (Professional File System). Das gegen&uuml;ber dem FastFileSystem
maximal um den Faktor F&uuml;nf schnellere Produkt, bei dem es auch keine
validierten Festplatten mehr geben kann, enth&auml;lt nun u.a. mit dem PFS
Doctor ein Reparaturprogramm, eine optionale Dateinamenl&auml;nge von 100
Zeichen und einiges mehr.
</P><P>
<A HREF="http://www.schatztruhe.de/">http://www.schatztruhe.de/</A><p></p>
<hr width="50%">
</P><P>
Bei Epic Marketing ist nun f&uuml;r 49,- DM die Vollversion des Movieplayers
'<B>MooVID</B>' erh&auml;ltlich. Er ist vollst&auml;ndig in Assembler programmiert und
unterst&uuml;tzt neben MOV und AVI auch Intel's INDEO-Format 3.1 &amp; 3.2.
</P><P>
<A HREF="http://www.epic-marketing.de/">http://www.epic-marketing.de/</A><p></p>
<hr width="50%">
</P><P>
Von Haage &amp; Partner ist nun '<B>STFax 4.0</B>' erh&auml;ltlich. Hinzugekommen sind
120 Ansagetexte auf Deutsch und Englisch und viele Funktionen wurden
verbessert und erweitert.
</P><P>
<hr width="25%">
</P><P>
In K&uuml;rze erscheint Active Technologies '<B>NetConnect 3</B>' in der Version
3.2. Enthalten sind die Internet-Programme AmiTCP-Genesis, VoyagerNG,
Microdot-II, AmFTP, AmIRC, AmTelnet, AmTerm, NetInfo, AmTalk und X-Arc.
</P><P>
Der Vertrieb erfolgt in Deutschland wie bisher &uuml;ber Haage &amp; Partner.
</P><P>
<hr width="25%">
</P><P>
Das Projekt einer JavaVirtualMachine f&uuml;r den Amiga '<B>Merapi</B>' wurde
aufgegeben, da diverse Informationen und Lizenzen von SUN nicht
erh&auml;ltlich gewesen sein sollen.
</P><P>
<A HREF="http://www.haage-partner.com/">http://www.haage-partner.com/</A><p></p>
<hr width="50%">
</P><P>
Auch Holger Kruse, Programmierer des TCP-Stacks 'Miami', wird keine
Java-Implementierung f&uuml;r den Amiga erstellen. Das geplante '<B>Daytona</B>'
f&auml;llt seiner Neuanstellung bei Rebol 'zum Opfer'.
</P><P>
<A HREF="http://www.nordicglobal.com/">http://www.nordicglobal.com/</A><p></p>
<hr width="50%">
</P><P>
Nova Design plant eine Version 4 des Bildbearbeitungs-Programmes '<B>ImageFX</B>'.
Es wird, neben vielen Verbesserungen und Erweiterungen, eine umfangreiche
Animationsunterst&uuml;tzung beinhalten.
</P><P>
<A HREF="http://www.novadesign.com/">http://www.novadesign.com/</A>
</P><P>
<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Spiele">Spiele</A></H2>
</P><P>
Das 3D-Rennspiel '<B>Wipeout 2097</B>' ist nun in einer Umsetzung f&uuml;r den Amiga
bei Schatztruhe herausgekommen. Die Anforderungen an die Hardware sind
allerdings hoch: PPC 603e und 3D-Grafikkarte sind Voraussetzung.
</P><P>
<A HREF="http://www.schatztruhe.de/">http://www.schatztruhe.de/</A><p></p>
<hr width="50%">
</P><P>
ClickBOOM plant, bis zum Ende des Jahres eine Umsetzung des PC-Spiels
<B>'Nightlong'</B> f&uuml;r den Amiga auf drei CDs zu realisieren.
</P><P>
<A HREF="http://www.clickboom.de">http://www.clickboom.de</A><p></p>
<hr width="50%">
</P><P>
Der Zusammenbruch des Publishers Sadeness zog beinahe die Aufgabe des
'<B>Operation Counterstrike</B>'-Projektes nach sich. Die Entwickler von
BlueBlack Solution wollen die Entwicklung des Echtzeit-Strategiespiel
aber weiterf&uuml;hren.
</P><P>
<A HREF="http://www.thesnakepit.demon.co.uk">http://www.thesnakepit.demon.co.uk</A>
</P><P>
<hr width="50%">
</P><P>
Updates zu '<B>Foundation</B>', bisher auch von Sadeness vertrieben, werden
zuk&uuml;nftig bei Epic Marketing erscheinen.
</P><P>
<hr width="25%">
</P><P>
Der Wing Commander-Klon '<B>Starfighter</B>' ist nun von Epic ver&ouml;ffentlicht
worden.
</P><P>
<hr width="25%">
</P><P>
Auch die Formel 1-Simulation '<B>Virtual GP</B>' ist nun nach einigen
Verz&ouml;gerungen erh&auml;ltlich.
</P><P>
<hr width="25%">
</P><P>
Epic Marketing hat sich die Lizenz f&uuml;r '<B>Simon the Sorcerer 2</B>' gesichert.
Das bekannte Adventure wird so doch noch f&uuml;r den Amiga erscheinen.
</P><P>
<A HREF="http://www.epicmarketing.ltd.net/">http://www.epicmarketing.ltd.net/</A>
</P><P>
<hr width="50%">
</P><P>
Bei Titan Computer wird '<B>Joyride</B>' erscheinen - ein Spiel, das dem Klassiker
'XTreme Racing' nachempfunden sein soll. Mehr als zehn Strecken und sechs
Autos mit unterschiedlichen Eigenschaften werden auf der CD-ROM enthalten
- AGA, 68030 und 8 MB RAM Voraussetzung sein. Grafikkarten-Unterst&uuml;tzung
ist geplant.
</P><P>
<A HREF="http://www.titancomputer.de/">http://www.titancomputer.de/</A><p></p>
<hr width="50%">
</P><P>
Alive Mediasoft will, neben den 96er NEO-Spielen <B>'Cedric'</B> und '<B>Whales
Voyage II</B>', eine &uuml;berarbeitete Goal-Version unter dem Titel '<B>Goal 2000</B>'
herausbringen.
</P><P>
<A HREF="http://www.innotts.co.uk/alive-mediasoft/">http://www.innotts.co.uk/alive-mediasoft/</A>
</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../amz1299/about.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../amz1299/pdnews.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
