<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/99 - Frau Gisela's Problemecke</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<TABLE BORDER=0 WIDTH="100%">
<TR>
<TD><H1>Frau Gisela's Problemecke</H1></TD><TD ALIGN="RIGHT"><IMAGE SRC="../images/frg.gif"></TD>
</TR></TABLE>

<P><B>Dies ist eine Rubrik</B>, in der diverse Fragen gestellt oder Probleme
geschildert werden k&ouml;nnen. Da Frau Gisela in dieser Ausgabe (wie immer)
gerade bei einer bekannten deutschen Frauenzeitschrift unabk&ouml;mmlich ist,
werden gezwungenerma&szlig;en wir versuchen zu helfen bzw. den Sachverhalt
hier ver&ouml;ffentlichen, um jemanden zu finden, der dies kann.
</P><HR>
<B>Drei wichtige Anmerkungen:</B>
<UL>
<LI>Wir weisen noch einmal daraufhin (s. <A HREF="impres.htm">IMPRESSUM</A>), da&szlig; f&uuml;r die
Richtigkeit von Angaben, in diesem Fall f&uuml;r Tips, Hinweise, Scripte
o.&auml;., <B>keine Gew&auml;hr bzw. Haftung</B> f&uuml;r eventuelle Folgen &uuml;bernommen
werden kann.</LI>
<LI>Sollten jemandem Fehler, Bugs oder sonstige Ungereimtheiten auffallen,
oder er selbst praktische Tips oder Probleml&ouml;sungen kennen, so w&uuml;rden
wir uns &uuml;ber eine Nachricht sehr freuen.</LI>
<LI>Und wer Probleme hat, sollte sich nicht scheuen, Sie uns zu schildern,
weil ihm drei Monate Wartezeit zu lang sind. Die Redaktion versucht
selbstverst&auml;ndlich sofort zu helfen.</LI>
</UL>
<HR>

<P>Dieses Mal werde ich selbst [der Chefredakteur; d. Chefred.] die
uns unglaublicherweise so schm&auml;hlich im Stich lassende Frau Gisela
vertreten...</P>

<P><A HREF="mailto:101.1331@germanynet.de">Florian Geiger</A> wandte sich mit folgender
Frage an uns:</P>

<pre>F&gt; Ich bin vieleicht zu doof</pre>

<P>Nat&uuml;rlich nicht, meist liegt es nur an einer Kleinigkeit.</P>

<pre>F&gt; aber <b>ich bekomme es nicht hin, ein Rar-Archiv zu unraren...</b>
F&gt;
F&gt; Wie geht das???</pre>

<P>Ich bin mal so frei, den entsprechenden Abschnitt aus unserem vor
einiger Zeit ver&ouml;ffentlichten Packer-Kurs zu zitieren:</P>

<hr width=75%>

<p>Hinweis:<br>
Die Version 2.01 von Amiga-Unrar hat einen Bug, es sollte
daher auf jeden Fall Version 2.02 verwendet werden!</p>

    <P>Unrar x &lt;Archiv&gt; &lt;Pfad_des_Zielverzeichnisses&gt;
    Zum Auspacken des Archivs.</P>

    <P>Unrar l &lt;Archiv&gt;<BR>
    Listet den Inhalt des Archivs.</P>

    <P>Unrar t &lt;Archiv&gt;<BR>
    Checkt den Inhalt des Archivs.</P>

<hr width=75%>

<pre>F&gt; danke, Florian</pre>

<P>Ich hoffe, das hilft Dir weiter. Wenn Du immer noch Probleme hast,
melde Dich ruhig noch mal und beschreibe, wo und wie es hakt und
dann werden wir weitersehen.</P>

<hr>

<P>Nun zu dem Problem von <A HREF="mailto:GGeidel@t-online.de">G&uuml;nter Geidel</A>, dessen
'unproblematischer' Briefteil im <a href="../amz1299/postsack.htm">Postsack</a> zu lesen ist.</P>

<pre>G&gt; Da ich nun schon schreibe, gleich noch eine Frage um Rat:
G&gt;
G&gt; <b>gelegentlich, also nicht immer, erscheint nach dem Reset des Rechners</b>
G&gt; <b>eine Fehlermeldung "AFS-Floppy Error-Requester, Initialisation failed".</b>
G&gt;
G&gt; Nach Wegklicken baut sich die Workbench auf, und das System friert
G&gt; v&ouml;llig ein. Ein folgender Reset verl&auml;uft dann normal.
G&gt;
G&gt; Ich habe zwar PFS2 installiert (nur auf IDE-HDs, nicht auf SCSI-HD),
G&gt; aber nie den Vorg&auml;nger AFS besessen und kann mir nach Durchforsten
G&gt; der Partitionen die Ursache des Requesters nicht erkl&auml;ren.
G&gt;
G&gt; System: A1200 in Micronik-Tower, Blizzard 1230 IV, Z2-Board, WB3.1,
G&gt; MCP, Fusion, PCX usw.
G&gt;
G&gt; Ich kann zwar bisher mit dem gelegentlichen "Fehlstart" leben, ertrage
G&gt; aber keine unerkl&auml;rlichen Dinge in meiner Umgebung. W&auml;re sch&ouml;n, 
G&gt; wenn von Euch jemand Rat w&uuml;&szlig;te.
G&gt;
G&gt; Mit freundlichen Gr&uuml;ssen
G&gt; G&uuml;nter</pre>

<P>Wir hatten daraufhin nur die Idee, da&szlig; es sich um ein merkw&uuml;rdiges
&Uuml;berbleibsel des Vorg&auml;ngers handelt, da&szlig; gelegentlich aus den Tiefen
des Speichers hervordringt.</P>

<P>Oder hattest Du vielleicht einmal das ganz alte PFS installiert, das
nur f&uuml;r Floppy-Laufwerke gedacht war?</P>

<P>Wenn jemand eine bessere Idee hat oder besser noch eine L&ouml;sung, dann
schreibt doch bitte G&uuml;nter oder auch uns, damit andere daran teilhaben
k&ouml;nnen.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../mmx/9912blut.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../amz1299/postsack.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
