<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Neues zum AmigaNG
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>2. AMIGA und Bernd Meyer geben die Lizenzierung von Amithlon 2.0 bekannt</H2>
<P><B>AMIGA, Inc. (<A HREF="http://www.amiga.com" TARGET="_top">http://www.amiga.com</A>) informiert:</B></P>
<P>
&raquo;23. Juni 2002 - Snoqualmie, Washington, USA und Melbourne, Australien -
AMIGA, Inc. gab heute die gegenseitige Lizenzierung von  Amithlon 2.0
bekannt. Die Vereinbarung wurde geschlossen mit dem Autor und Inspirator
von Amithlon, mit Bernd &quot;Bernie&quot; Meyer. Als ihren Teil der Vereinbarung
wird AMIGA, Inc. den Vertrieb von Kickstart 3.1 und Teilen des Amiga OS 3.9
zusammen mit Amithlon 2.0 lizenzieren. AMIGA wird auch Amithlon 2.0 aktiv
f&ouml;rdern und an OEM-Kunden lizenzieren, die nach einem Amiga-Emulator auf
x86-Plattformen suchen.
</P>
<P>
Bill McEwen, Pr&auml;sident und CEO von AMIGA, sagte, &quot;Bernie war ein guter
Freund und Partner f&uuml;r AMIGA. Ich habe als Erster eine Beta-Version von
Amithlon vor fast einem Jahr auf der Ausstellung in Sacramento vorgestellt.
Schon damals war mir die Qualit&auml;t des Produkts und sein Potenzial ganz
klar. Seit damals wurde es deutlich aufpoliert und spiegelt ganz klar die
Leidenschaft und Programmierkunst wieder, zu der Bernie f&auml;hig ist.&quot;
</P>
<P>
&quot;Ich war auch beeindruckt durch die Moral und ethische Integrit&auml;t, die
Bernie vorstellte, als er sich mit AMIGA verband. Viel zu oft mussten wir
in der Vergangenheit mit Gesellschaften umgehen, denen nichts lieber war
als einen Keil in die Amiga-Gemeinschaft zu treiben. Bernie lagen immer die
Interessen der Gemeinschaft am Herzen und er schuf ein Produkt, auf das wir
alle wirklich stolz sein k&ouml;nnen.&quot;
</P>
<P>
&quot;Es ist mir eine gro&szlig;e Freude, dass ich endlich direkt mit AMIGA ins
Gesch&auml;ft komme&quot;, sagte Bernie Meyer. &quot;Diese neue Version, die mit der
ausdr&uuml;cklichen Anerkennung von AMIGA vertrieben wird, bietet den Kunden die
Gewissheit, dass Amithlon ein aktiv entwickeltes Produkt mit gro&szlig;artigen
Aussichten ist. Diese Partnerschaft gestattet es den Anwendern des
klassischen AmigaOS die Benutzung ihrer Programme auf moderner,
erschwinglicher Hardware.&quot;
</P>
<P>
Eine Demo-Version von Amithlon 2.0 wird in K&uuml;rze zur Verf&uuml;gung stehen, und
sie kann kostenlos von der Vertriebs-Site
<A HREF="http://www.amithlon.net/demo.shtml" TARGET="_top">http://www.amithlon.net/demo.shtml</A> heruntergeladen werden. Die Demo-Version
kann durch ein einfaches Keyfile, das online gekauft werden kann, zur
vollen Funktionalit&auml;t aufgewertet werden.
</P>
<P><B>&Uuml;ber Amithlon 2.0</B></P>
<P>
Es war das Ziel des Amithlon-Projekts, das AmigaOS 3.9 auf gew&ouml;hnlicher PC-
Hardware laufen zu lassen. Anders als bei anderen L&ouml;sungsmethoden f&uuml;r
dieses Problem (UAE, Fellows) bietet Amithlon dem AmigaOS die vollst&auml;ndige
Kontrolle &uuml;ber die Hardware. Aufgesetzt auf einen besonders angepassten
Linux-Kern betreibt die CPU von Amithlon das AmigaOS. Jeder Zugang zu
Grafik, Sound, Netzwerk und Interface-Hardware erfolgt &uuml;ber Standardtreiber
des AmigaOS. Amithlon 2.0 wird vertrieben als selbstbootendes CD-ROM-Image.
</P>
<P><B>&Uuml;ber AMIGA</B></P>
<P>
Im Jahr 1985 brachte AMIGA mit dem Start des unglaublichen Amiga 1000
Multimedia in die Welt. Das war eine Revolution der Hardware mit besonderen
Audio- und Grafik-Chips und einer revolution&auml;ren Software mit dem ersten
32-Bit-Betriebssystem mit pr&auml;emptivem Multitasking. Er dominierte die
restlichen 80er und fr&uuml;hen 90er Jahre, brachte Pionierleistungen bei der
Videobearbeitung und Animationserzeugung und verhalf vielen der heutigen
Spitzenfirmen im Spielbereich zum Aufstieg. Diese Tradition wird
fortgef&uuml;hrt mit dem Start des brandneuen AmigaOne Desktop-Computers und
dessen Weggef&auml;hrten, dem AmigaOS 4.0, welche bestimmt sind, neue Standards
setzen und Erwartungen in der Welt des digitalen Lebens zu erwecken. AMIGA
ist im Internet zu finden unter <A HREF="http://www.amiga.com" TARGET="_top">http://www.amiga.com</A>.
</P>
<P><B>&Uuml;ber Bernie Meyer</B></P>
<P>
Bernie Meyer ist ein frei schaffender Software-Planer mit fast
zwanzigj&auml;hriger Erfahrung in professioneller Software-Entwicklung. Er
studierte Elektrotechnik und Computer-Wissenschaften in Deutschland und
Australien, und zur Zeit macht er seinen Doktor (PhD) &uuml;ber Bild-
Verarbeitung (Image Modeling) bei der Monash-Universit&auml;t in Melbourne,
Australien. Im Jahr 2000 verlie&szlig;en zwei von Bernies Hobby-Projekten seine
Hand. Eines wurde zu Glicbawls, dem Sieger einer Kathegorie im
&quot;International Obfuscated C Code Contest&quot; des Jahrs 2000, aus dem anderen
entstand ein Just-In-Time Compiler f&uuml;r den Amiga Emulator UAE, der  dadurch
wesentlich gr&ouml;&szlig;erer Emulationsgeschwindigkeit erhielt. Im Jahr 2001
verfeinerte Bernd den JIT Compiler weiter, um ihn f&uuml;r den Einsatz in
Amithlon zur Verf&uuml;gung zu haben.&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</P>
<P><B>Nachtrag:</B></P>
<P>
Urspr&uuml;nglich sollte Amithlon 2 bereits am 1. Juli ver&ouml;ffentlicht werden,
doch Bernie Meyer erl&auml;utert in einem Mailinglisten-Posting, das unter der
URL <A HREF="http://groups.yahoo.com/group/amithlon/message/8441" TARGET="_top">http://groups.yahoo.com/group/amithlon/message/8441</A> nachzulesen ist,
dass dieser Termin nicht eingehalten werden konnte. Begr&uuml;ndet wurde dies
mit einer Nachwirkung der bisherigen Gesch&auml;ftsbeziehung mit Haage &amp;
Partner.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
