<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Diverse Amiga-News
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>3. Neuigkeiten von der Amiga Arena</H2>
<P><B>Amiga Arena (<A HREF="http://online-club.de/~ARENA/" TARGET="_top">http://online-club.de/~ARENA/</A>) informiert:</B></P>
<P><B>&raquo;*Amiga Arena - Interview mit &quot;Michael Christoph&quot; (Toolsmen&uuml;)*</B></P>
<P>
Programme die es erlauben in der Men&uuml;leiste der Workbench weitere
Hauptverzeichnisse zu erzeugen gibt es einige.
</P>
<P>
Das bekannteste und weitverbreiteste d&uuml;rfte &quot;Toolsprefs&quot; sein.
</P>
<P>
Seit einiger Zeit befindet sich mit &quot;Toolsmen&uuml;&quot; ein neues Programm dieser
Art in Entwicklung.
</P>
<P>
&quot;Michael Christoph&quot; der Entwickler von &quot;Toolsmen&uuml;&quot; und ehemalige
Mitarbeiter der Firma &quot;proDAD&quot; spricht im Interview mit mit der &quot;Amiga
Arena&quot; &uuml;ber die Entwicklung von &quot;Toolsmen&uuml;&quot; sowie der bald erscheinenden
Version 45.8 Neben &quot;Toolsmen&uuml;&quot; hat &quot;Michael Christoph&quot; noch PD Spiele wie
&quot;myLocomotion&quot; oder &quot;FuncyFuxies&quot; entwickelt die alle Grafikkarten
unterst&uuml;zen.
</P>
<P>
Weitere interessante Meinungen &uuml;ber die Zukunft von Amiga runden das
Interview ab.&laquo;
</P>
<P><B>&raquo;*Amiga Arena - Vollversion &quot;Flamingo Tours ECS&quot;*</B></P>
<P>
Der Reisemanager &quot;Flamingo Tours&quot; von &quot;Sayonara Software&quot; liegt zum
Download bereit.
</P>
<P>
Besonderen Dank an &quot;Jo Seitz&quot; f&uuml;r die Genehmigung und &quot;Kai W.&quot; f&uuml;r die
Bereitstellung der Orginal Version.&laquo;
</P>
<P><B>&raquo;*PuzzelBOBS - Neuer LevelSet &quot;Time&quot;*</B></P>
<P>
20 neue Levels gilt es unter Zeitvorgabe zu meistern!
Mit dem &quot;Time&quot; LevelSet von Emanuele Cesaroni (Nexus Development) dem
Entwickler von &quot;PuzzelBOBS&quot;  gibt es &quot;Nachschub&quot; f&uuml;r alle &quot;PuzzelBOBS&quot;
Freunde.
</P>
<P>
Dazu sind weitere spezial &quot;Bubbles&quot; enthalten wie Bomben,Inaktiv oder
Regenbogen!
Das LevelSet liegt im Bereich &quot;PuzzelBOBS Suppport Seite&quot; zum Download
bereit!
Weitere Infos zum Spiel finden Sie auch dort!&laquo;
</P>
<P><B>&raquo;*Amiga Arena - Vollversion &quot;TimeKeepers&quot;*</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Mit der Genehmigung von Paul Carrington (Vulcan Software Ltd.) liegt das&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Puzzel Spiel&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&quot;TimeKeepers I&quot; in der Deutschsprachigen HD Version zum&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Download bereit.&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Bei &quot;TimeKeepers I&quot; handelt es sich um ein Action / Knobelspiel in Form von
&quot;Lemminge&quot; oder &quot;Humans&quot;.
</P>
<P>
Ziel des Spiels ist es Ihre 14 Polizeieinheiten durch die Levels zu
steuern!
</P>
<P><B>*Amiga Arena - &quot;The Prophet&quot; Update*</B></P>
<P>
Das wohl letzte 3D Rollenspiel f&uuml;r den Amiga - &quot;The Prophet&quot; von Mark Ford
wurde im letztem Jahr exklusiv durch die &quot;Amiga Arena&quot; zum freien Download
ver&ouml;ffentlicht,leider enthielt die Final Verkaufsversion einen Bug!
Mit dem Update ist dieser behoben und &quot;The Prophet&quot; kann nun bis zum Ende
durchgespielt werden!&laquo;
</P>
<P>
&raquo;*Amiga Arena - Interview mit &quot;Steffen Nitz&quot; (SN-M&uuml;nz Archiv)*
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Mit &quot;SN-M&uuml;nz Archiv&quot; wurde vor kurzem ein neues &quot;Shareware&quot; Programm von&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&quot;Steffen Nitz&quot;,&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">einigen bekannt von Programmen wie &quot;B&uuml;rgermeister&quot; oder&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&quot;CMlVII&quot; ver&ouml;ffentlicht.&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Die &quot;Amiga Arena&quot; sprach mit &quot;Steffen Nitz&quot; &uuml;ber sein neues
Programm,Sharewasoftware und welche Beweggr&uuml;nde Ihn dazu veranlast haben,es
zu entwickeln!&laquo;
</P>
<P><B>&raquo;*Amiga Arena - Vollversion &quot;Samba Partie Pro. AGA/ECS&quot;*</B></P>
<P>
Zur &quot;Feier des Tages&quot;,liegt der zweite Teil des Fussballmanagers &quot;Samba
Partie&quot; in der ECS und AGA Version von &quot;Sayonara Software&quot; zum Download
bereit.
</P>
<P>
Besonderen Dank an Stefan I. f&uuml;r die Bereitstellung der AGA Version und
Sylvester B. f&uuml;r die ECS Version.
</P>
<P><B>*Amiga Arena - &quot;Blade&quot; Tip*</B></P>
<P>
Das Action RPG Spiel &quot;Blade&quot; von &quot;Mark Sheeky&quot; wurde Erfolgreich mit dem
Tool &quot;NoAGA&quot; auf einem Amiga 4000/60 mit OS3.9 in der HD Version getestet.
Nachdem das Spiel exklusiv von der &quot;Amiga Arena&quot; in der Deutschen Version
zum Download angeboten wird,hatten immer wieder User Probleme &quot;Blade&quot; von
HD zu Spielen!&laquo;
</P>
<P><B>&raquo;*Amiga Arena - Interview mit &quot;Andreas Kleinert&quot; (akDatatypes,SView)*</B></P>
<P>
&quot;Andreas Kleinert&quot; vielen Amiga Usern durch Programme wie
&quot;SView&quot;,&quot;akMPEG&quot;,&quot;SBase&quot; bekannt ver&ouml;ffentlichte vor wenigen Tagen seine
&quot;akDatatypes&quot; in einer neuen Version und optimiert f&uuml;r &quot;Amithlon&quot;.
Zugleich wurder der &quot;Sharware&quot; Status seine Datatypes aufgehoben und Sie
liegen jetzt als Freeware vor.
</P>
<P>
Die &quot;Amiga Arena&quot; sprach mit &quot;Andreas Kleinert&quot; &uuml;ber seine Erfahrung mit
&quot;Amithlon&quot;, ob es weitere Optimierungen seiner Software in Zukunft f&uuml;r
&quot;Amithlon&quot; gibt sowie &uuml;ber die Zukunft und MorphOS!&laquo;
</P>
<P>
&raquo;*Amiga Arena - Interview mit &quot;Alfred Faust&quot; (BarsnPipes New)*
</P>
<P>
Dank &quot;Alfred Faust&quot; erfreuen sich &quot;BarsnPipes&quot; Anwender seit 2001 &uuml;ber die
stetige weiterentwicklung des wohl besten Multimedia-MIDI-Sequencers f&uuml;r
den Amiga.
</P>
<P>
In dem sehr ausf&uuml;hrlichen Interview mit der &quot;Amiga Arena&quot; spricht &quot;Alfred
Faust&quot; nicht nur &uuml;ber die Zukunft von &quot;BarsnPipes&quot; sondern geht viel mehr
&uuml;ber die Vorz&uuml;ge und m&ouml;glichkeiten des Programms ein und berichtet wie es
zur Freigabe der Sourcen kam.
</P>
<P><B>*PuzzleBOBS GFX Anleitung*</B></P>
<P>
Die Deutschsprachige Anleitung zur Erstellung eigener Grafiken f&uuml;r das
Spiel &quot;PuzzleBOBS&quot; ist Online!
Somit haben Sie die m&ouml;glichkeit Ihre eigenen Hintergr&uuml;nde und Spiel Figuren
zu erstellen.
</P>
<P>
Leider sind noch einige Abschitte der Anleitung nicht &uuml;bersetzt,wer dies
gerne &uuml;bernehmen m&ouml;chte, m&ouml;ge sich in Verbindung mit mir setzten.
Zudem w&auml;re es sch&ouml;n wenn User Spass daran h&auml;tten neue Level Designs zu
erstellen!&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
