<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Forum1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Forum
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>2. Anmerkung zu &raquo;Kleine Helfer&laquo;, Ausgabe 06/02 (von Christian Rosentreter)</H2>
<P>
Yuppa...und wieder einmal musste ich innerlich schmunzeln, als ich
Christians (nicht ich! :) ) PatchRAM-Test f&uuml;r OS 3.9.2 in der letzten AMIGA
aktuell las... :)
</P>
<P>
Das Ph&auml;nomen der &quot;100% voll&quot;-Anzeige hat ja schon viele - mehr oder
weniger intelligente - Programmierer zur &Uuml;berzeugung gebracht, dass daran
etwas ge&auml;ndert werden m&uuml;sste. Also schreibt der Schelm einen Patch.
</P>
<P>
Komisch nur, dass daran eigentlich gar nichts ge&auml;ndert werden muss. Die
Funktion werkelt n&auml;mlich hundertprozentig korrekt.
</P>
<P>
Wie wir sicherlich alle wissen, ist die RAM&sup1; ein Laufwerk von dynamischer
Gr&ouml;&szlig;e, welches sein physisches Dasein im Arbeitsspeicher fristet&sup2;. D.h.
wenn eine Datei auf die RAM-Disk&sup3; kopiert wird, vergr&ouml;&szlig;ert sie sich
automatisch - entsprechend der Dateigr&ouml;&szlig;e. Umgekehrt funktioniert das
genauso: L&ouml;scht man die Datei, wird die RAM-Disk wieder kleiner
(entsprechend der Dateigr&ouml;&szlig;e :) ) und verbraucht auch weniger Speicher.
</P>
<P>
Kommen wir zur Schlussfolgerung: Die RAM-Disk ist nur ein Teil des
eigentlichen RAM. Der Speicherverbrauch der RAM-Disk richtet sich nach der
auf ihr gespeicherten Dateien. Daher ist im Moment der logischen Existenz
(kann man das so ausdr&uuml;cken? :) ) der RAM-Disk diese zu 100 Prozent voll.
Praktisch passt nat&uuml;rlich noch was rein, aber das hat ja nichts mit der
Berechnung des F&uuml;llstandes zu tun. :)
</P>
<P>
Stellt euch mal vor, die RAM-Disk w&auml;re identisch mit dem eigentlichen
Arbeitsspeicher, da w&auml;re ja kein Byte mehr &uuml;brig, um ein Programm zu
starten. Oder wir k&ouml;nnten den Programmcode als Dateifragment in der RAM-
Disk bewundern...hihi...das w&auml;re was! :)
</P>
<P>
Nun ja...letzten Endes ist's wohl ein philosophischer Aspekt. Der eine
m&ouml;chte es halt so...der andere halt so. Jedem seine Freiheit. Ich pl&auml;diere
aber immer daf&uuml;r, jeden unn&uuml;tzen Patch zu vermeiden. :)
</P>
<P>
&Uuml;brigens freue ich mich schon auf den Tag, an dem ein Patch herauskommt,
der das &quot;100% voll&quot;-Problem bei den CD-ROM-Filesystemen l&ouml;st. Den werde ich
mir garantiert installieren...hihi. ;)
</P>
<P>
&sup1;) nicht &quot;der&quot; RAM, da &quot;die&quot; RAM-Disk<BR>
&sup2;) das ist w&ouml;rtlich zu nehmen<BR>
&sup3;) umgangssprachlich: &quot;ins RAM&quot;<BR>
</P>
<P><B>Christian Rosentreter &lt;<A HREF="mailto:karibu@gmx.net">karibu@gmx.net</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Forum3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
