<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Forum.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Forum
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Forum</H1>
<P>
In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot;
zusammengefasst.
</P>
<P><B>Wenn ihr einen Beitrag habt, schreibt bitte an:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Carsten Schr&ouml;der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Helmoltstra&szlig;e 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">37081 G&ouml;ttingen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>E-Mail: <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A></B></P>
<H2>1. Die Frage des Monats - wir m&ouml;chten eure Meinung erfahren</H2>
<P>
Jeden Monat stellen wir euch in dieser Rubrik eine Amiga-bezogene Frage
oder machen eine provokante Bemerkung (die &uuml;brigens nicht unbedingt unsere
Meinung wiedergeben muss), in der Hoffnung, dass ihr euch m&ouml;glichst
zahlreich mit Kommentaren zu Wort meldet. Wir werden eure Beitr&auml;ge in der
jeweils folgenden Ausgabe ver&ouml;ffentlichen. Schickt sie an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>
</P>
<P><B>Die Frage des letzten Monats lautete:</B></P>
<P>
&raquo;Sollte bplan die Entwicklung von MorphOS stoppen und statt dessen eine
AmigaOS4.0-Lizenz f&uuml;r Pegasos erwerben?&laquo;
</P>
<P><B>Frank Gutschow antwortet auf die Frage wie folgt:</B></P>
<P>
&raquo;Ja, denn es w&auml;re wirtschaftlich mit Sicherheit die kl&uuml;gere Variante, eine
einheitliche Essenz zu schaffen. Andererseits sollten im Falle einer
weiteren Teilung des Marktes von den Entwicklern konsequent alle gr&ouml;&szlig;eren
Marktsplitter unterst&uuml;tzt werden, ansonsten vergrault man die momentan
bittern&ouml;tigen Kunden.
</P>
<P><B>Ich sehe da erstrangig folgende Teilm&auml;rkte:</B></P>
<UL>
<LI> AmigaOS 3.9 auf echtem Classic-Amiga mit 68040/060 (bzw. 040/060 +
  PowerPC)
</LI>
<BR><LI> AmigaOS 3.9 auf Amithlon (emuliertem 68040)
</LI>
<BR><LI> AmigaOS 4.x auf PowerPC
</LI>
<BR><LI> und dann den weiteren eventuellen Teilmarkt MorphOS 1.x auf PowerPC
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Eine Software nur f&uuml;r einen der Teilm&auml;rkte zu entwickeln, geht garantiert&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">in die Hose.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Den einzigen wirtschaftlichen Sinn, den eine Ver&ouml;ffentlichung von MorphOS
hat, ist m.E., dass ein paar &quot;Hardcore&quot;-MorphOS-Anh&auml;nger (welche im Falle
des Nichterscheinens von MorphOS den Amiga-Markt verlassen w&uuml;rden) am
Amiga-Markt bleiben. Verglichen mit den anderen oben aufgef&uuml;hrten
Marktteilen w&uuml;rde MorphOS mit Sicherheit als erstes durch das Netz einer
Erreichbarkeitsstudie fallen. Letztlich bedeutet die Ver&ouml;ffentlichung von
MorphOS f&uuml;r die Entwickler von Applikationen weiteren zeitlichen und
finanziellen Aufwand f&uuml;r die Anpassung ihrer Software, damit der kleine
Pool von MorphOS-Kunden sie nutzen kann.
</P>
<P>
W&auml;re der Markt zehn- oder zwanzigmal so gro&szlig;, k&ouml;nnte man evtl. dar&uuml;ber
diskutieren, aber in diesem Fall gibt's von mir ein klares &quot;Nein&quot; zur
Ver&ouml;ffentlichung von MorphOS.
</P>
<P>
M&ouml;glichkeiten w&auml;ren die gemeinsame Arbeit der MorphOS-Mannschaft mit der
AmigaOS-Mannschaft an einem &quot;AmigaOS 4&quot;, oder zumindest die
Ver&ouml;ffentlichung einer Charge von Pegasos-Rechnern mit AmigaOS 4 (wenn
nicht durch bplan oder Hyperion, dann evtl. von einer dritten Partei). Den
Einsatz von zwei verschiedenen &quot;ROM-gedongleten&quot; AmigaOS-Betriebssystemen
machten fr&uuml;her sogenannte Kickstart-Umschaltplatinen m&ouml;glich. ;)&laquo;
</P>
<P><B>Auch Achim Stegemann erl&auml;utert seine Ansicht ausf&uuml;hrlich:</B></P>
<P>
&raquo;Unabh&auml;ngig von dem momentanen Lizenzstreit zwischen AMIGA, Inc. und bplan
bzgl. MorphOS sollte bplan auf jeden Fall eine AmigaOS4.0-Lizenz erwerben.
Hierf&uuml;r gibt es f&uuml;r mich zwei Gr&uuml;nde:
</P>
<P>
1. Je flexibler das OS-Angebot f&uuml;r des Pegasos-Board ist, umso gr&ouml;&szlig;er wird
der Kreis etwaiger Kunden und damit die Chancen, Pegasos an den Mann/Frau
zu bringen.
</P>
<P>
2. Einige der Leser werden sich vielleicht erinnern (Amiga-News), dass ich
im April eine Umfrage gehalten habe, in der es unter anderem auch um eine
Favorisierung von AmigaOne oder Pegasos ging. Das Umfrage-Ergebnis war f&uuml;r
mich nicht &uuml;berraschend. Fast Dreiviertel aller Umfrage-Teilnehmer w&uuml;rden
Pegasos vor AmigaOne vorziehen, weil das Pegasos in seiner CPU-Anpassung
flexibler ist, als der AmigaOne (was sich aber auch &auml;ndern soll). Aber -
und hier ist der entscheidende Punkt - es ziehen genauso viele das OS4 vor
MorphOS auf dem Pegasos vor. Die Mehrheit der Teilnehmer empfindet MorphOS
als willkommene Spielerei, aber zum ernsthaften Arbeiten w&uuml;rde sie das OS4
vorziehen.
</P>
<P>
Der Wunsch des Kunden ist also eine Pegasos/OS4-Kombination. Und das ist so
ziemlich das Gegenteil von dem, was momentan in der Planung ist. Wenn bplan
also klug reagiert und sich nach dem Wunsch der Kunden richtet, sollte es
auf jeden Fall eine OS4-Lizenz erwerben, unabh&auml;ngig von MorphOS!
</P>
<P>
Der Grund f&uuml;r das Vorziehen von OS4 gegen&uuml;ber MorphOS erkl&auml;re ich mir
folgenderma&szlig;en (man m&ouml;ge mir widersprechen, wenn ich hier etwas falsches
darstelle!): Momentan hat es den Anschein, als ob MorphOS lediglich ein
PPC-Port des OS3.1 ist. Sch&ouml;n, man kann seine alte Amiga-Software unter der
PPC-Emulation laufen lassen, und neue Programme f&uuml;r OS3.1+ laufen dann,
sofern sie in einer MorphOS-nativen Version erscheinen, sehr schnell. Aber
wo sind die Neuerungen? Leider benutzen die MorphOS-Entwickler immer noch
das PowerUP-Konzept von phase5, das heutzutage so gut wie niemand mehr
benutzt. Es wird zwar eine WarpOS-Kompatibilit&auml;t versprochen, aber leider
funktioniert diese nicht hundertprozentig.
</P>
<P>
Anders sieht das bei OS4 aus. OS4 ist kein reiner OS3.1-Port, sondern
stellt ein neues AmigaOS dar, welches abw&auml;rtskompatibel zu OS3.1 sein soll,
aber eben mit Neuerungen. Und das macht OS4 sowohl f&uuml;r Benutzer als auch
f&uuml;r Programmierer interessant.
</P>
<P>
F&uuml;r mich pers&ouml;nlich ist MorphOS nur eine Spielerei, die mir eigentlich
nichts Neues bringt. Wenn ich OS3.1-Programme in einem
Geschwindigkeitsrausch erleben will, so kann ich genauso UAE oder Amithlon
benutzen. Da fahre ich jedenfalls - was die Kompatibilit&auml;t betrifft - auf
der sicheren Seite.
</P>
<P>
Summa summarum: In meinen Augen w&uuml;rde bplan einen Riesenfehler machen, wenn
es das OS4 nicht lizenzieren w&uuml;rde. Die Amiganer sind nicht an einem
Pegasos-Board interessiert, auf dem sie LinuxPPC laufen lassen k&ouml;nnen.
Daf&uuml;r kann man sich auch einen PC kaufen, was wesentlich billiger ist. Wer
sich das Pegasos-Board zulegt, will seinen Amiga darauf wiedererkennen
k&ouml;nnen - und nichts anderes.&laquo;
</P>
<P><B>Kai Stegemann schreibt:</B></P>
<P>
&raquo;MorphOS sollte weiterentwickelt werden UND AmigaOS 4 sollte zus&auml;tzlich
lizenziert werden - wenn der Preis stimmt.&laquo;
</P>
<P><B>Giancarlo Piscitello meint:</B></P>
<P>
&raquo;Es gibt nur 1 offizielles AmigaOS! Ersatzl&ouml;sungen sind nur dann sinnvoll,
wenn die Zukunft nicht selbst geschmiedet werden kann (siehe PowerUp,
Scalos).
</P>
<P>
x86...no comment.
</P>
<P>Der Rest ist Plan B.&laquo;</P>
<P><B>Stefan Kleinheinrich sieht die Sache anders:</B></P>
<P>
&raquo;Ich fass mal zusammen: bplan soll also sein fast fertiges OS in die Tonne
kloppen (f&uuml;r das auch schon flei&szlig;ig entwickelt wird), um sich ganz dem Wohl
oder Wehe eines Fremd-OS zu unterwerfen, von dem es weder eine Betaversion
noch einen halbwegs realistischen Zeitplan gibt? Dass der &quot;Leiter der
Entwicklung&quot; seit Monaten nichts anderes zu tun zu haben scheint, als mit
Dreck nach bplan zu werfen, kommt dann noch als Bonus hinzu...
</P>
<P>
Also ich versteh nicht, warum bplan nicht auf diesen vern&uuml;nftigen Vorschlag
eingeht...
</P>
<P>
Ernsthaft:
bplan/Thendic, schickt Hyperion ein Board (oder bringt es in den Handel).
Macht die Hardware-Dokumentation verf&uuml;gbar (am besten &ouml;ffentlich, damit
nicht behauptet wird, man h&auml;tte nichts erhalten).
</P>
<P>
AMIGA, Inc./Hyperion, wenn ihr irgendwann ein interessantes Produkt habt,
k&ouml;nnt ihr mich auf der Hardware MEINER Wahl treffen (notfalls mit USB-
Dongle). Wenn nicht, dann eben nicht.&laquo;
</P>
<P><B>Jens Bache fordert die AmigaOS-Lauff&auml;higkeit auf Pegasos:</B></P>
<P>
&raquo;Jawohl, bplan sollte eine Lizenz f&uuml;r AmigaOS 4.0 erwerben. Ich will einen
Rechner mit AmigaOS, und ich w&uuml;rde mich auf jeden Fall f&uuml;r den Pegasos
entscheiden, wenn AmigaOS 4 drauf laufen w&uuml;rde!
Da bplan aber schon bekannt gegeben hat, dass sie daran kein Interesse
haben und ihren Rechner lieber mit MorphOS (kein AmigaOS) ausstatten
wollen, bin ich da nicht sehr zuversichtlich!&laquo;
</P>
<P><B>Daniel Pollok hat denselben Wunsch:</B></P>
<P>
&raquo;Das Wirrwarr um nicht kompatible Hard- und Software am Amiga hat schon
immer geschadet! Deshalb bin ich der Meinung, dass MorphOS, so innovativ es
sein mag, eingestellt wird, und bplan mit Amiga an einem Strang ziehen
sollte. Es ist nat&uuml;rlich schade um die verbrauchten Entwicklungsressourcen,
kommt uns Usern aber sicherlich entgegen. Denn ich m&ouml;chte bald wieder einen
funktionierenden, unterst&uuml;tzten und vor allem modernen Amiga besitzen,
damit ich die &quot;Dose&quot; wirklich nur noch f&uuml;r die Arbeit brauche!&laquo;
</P>
<P>
<B>J&uuml;rgen Sperling pl&auml;diert f&uuml;r eine Verschmelzung von AmigaOS und MorphOS:</B>
</P>
<P>
&raquo;Mag sein, dass die Amiga-&quot;Gemeinschaft&quot; schon seit l&auml;ngerem &uuml;ber die
Richtung PowerPC-AmigaOS 4 oder MorphOS tief zerstritten ist. Leider kann
ich in dieser Beziehung mit niemandem &quot;life&quot; streiten. :-(
</P>
<P>
Ich kann mir eigentlich noch gar kein Urteil &uuml;ber dieses oder jenes
Betriebssystem machen (erlauben). Ich kenne ja nur die Fakten aus der
AMIGAplus und seit M&auml;rz aus NoCover / AMIGA aktuell. Das ist mir doch ein
bisschen zuwenig Wissen, um mich jetzt auf ein System festzulegen. Obwohl,
ein bisschen tendiere ich zu AmigaOS 4.
</P>
<P>
Kein besonderer Grund, aber ich halte AMIGA, Inc. f&uuml;r den legitimen
Besitzer der Amiga-Rechte und -Lizenzen. Ich kenne mich mit so etwas nicht
aus, kann mir aber vorstellen, dass es irgendwann mit oder wegen MorphOS
oder einem anderen OS Probleme gibt. (War da nicht schon etwas mit Amithlon
oder AmigaXL?)
</P>
<P>
bplan sollte die Arbeit an MorphOS nicht stoppen, aber ich meine, sich
einigen, die Gemeinsamkeiten und das Beste herausfiltern und z.B. als das
*offizielle* &quot;Amiga-MorphOS4&quot;-Betriebssystem herausgeben.
</P>
<P>
Ich wei&szlig;, dann dauert es noch l&auml;nger bis zu einem neuen OS, aber ein
Gegeneinander mit zwei oder auch drei Betriebssystemen hilft uns als
Anwender und denen, die die Programme schreiben, auch nicht viel weiter
(St&uuml;ckzahlen der Programme oder zu viele Programmierwerkzeuge).
</P>
<P>
Ich f&uuml;r meinen Teil warte auf jeden Fall auf Testberichte und eine Liste
der unterst&uuml;tzten Programme und Hardware.&laquo;
</P>
<P>
<B>J&uuml;rgen Schober gibt MorphOS in seiner jetzigen Form wenig Chancen:</B>
</P>
<P>
&raquo;MorphOS ist wohl kaum legal - in China vielleicht. Irgendwie sind die
Verantwortlichen ja auch ungeschickt. Wenn sie nur einmal &ouml;ffentlich
best&auml;tigen, die RKMS f&uuml;r MorphOS benutzt zu haben, haben sie schon das
Copyright verletzt! Das w&auml;re ja ungef&auml;hr so, als w&uuml;rde ich ein Buch
abschreiben, es neu unter einem anderen Namen ver&ouml;ffentlichen, und mich
darauf berufen, dass die Quelle ja f&uuml;r jedermann zug&auml;nglich war!
Ich kann mir durchaus vorstellen, dass ein Gericht MorphOS zul&auml;sst. Aber
wohl nur, ohne den Namen Amiga verwenden zu d&uuml;rfen, dazu kommt die
zeitliche Verz&ouml;gerung beim Time-To-Market, und danach der Aufwand, ein
neues, unbekanntes OS zu pushen und vermarkten zu m&uuml;ssen. Sollte MorphOS
ohne diese rechtliche Grundlagen erscheinen, h&auml;tte AMIGA, Inc. - im Falle
eines sp&auml;teren positiven Gerichtsurteils - wohl Anspruch auf Schadenersatz.
Also, rein vom betriebswirtschaftlichen Standpunkt w&uuml;rde ich bplan
empfehlen, MorphOS fallen zu lassen oder als &quot;embedded OS&quot; ohne Amiga-Bezug
zu bringen, und gleichzeitig eine AmigaOS4-Lizenz zu kaufen. bplan steht
wohl an der Stelle, wo Phase5 aufgeh&ouml;rt hat. Hoffentlich machen sie's
diesmal besser. Ich w&uuml;rde mir jedenfalls AmigaOS 4 f&uuml;r den Pegasos
w&uuml;nschen.&laquo;
</P>
<P><B>Nun zur aktuellen Frage des Monats:</B></P>
<P>
&raquo;Sollten nach einem Erscheinen von AmigaOS 4 und MorphOS die
Softwareentwickler ihre Programme in dem jeweiligen nativen PPC-Code der
beiden Betriebssysteme schreiben oder, um die Softwarekompatibilit&auml;t
untereinander und auch mit AmigaOS3.x-Rechnern (also beispielsweise
Amithlon) zu gew&auml;hrleisten und damit eine Spaltung des Marktes zu
verhindern, 68k-Programmcode verwenden?&laquo;
</P>
<P>
Schickt eure Beitr&auml;ge bitte an unsere NEUE E-Mail-Adresse <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>
</P>
<P ALIGN="RIGHT">
<A HREF="Forum.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Forum2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
