<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Abschlie&szlig;end
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
<H2>Amiga-Gegenwart und -Zukunft: Ein Blick aus der Ferne (von Marco Siegel)</H2>
</P>
<P>
Da ich darum gebeten wurde, meine pers&ouml;nliche Ansicht der Dinge zu Papier
zu bringen, kommt es hiermit zu dem unglaublichen Skandal, dass ein
Windows-Benutzer sich des Schlussworts annimmt. ;)
</P>
<P>
Nicht ohne Interesse verfolge ich (nicht allzu stetig) &ouml;fter mal das
Geschehen auf dem Amiga-Markt aus der weiten Ferne. Und als jemand, der den
Amiga sieben Jahre lang verwendet hat, kann ich bei der derzeitigen
Situation und der sich mal wieder abzeichnenden Spaltung nur den Kopf
sch&uuml;tteln.
</P>
<P>
Um darzulegen, was genau so l&auml;cherlich ist, gen&uuml;gt es, eine kleine Rechnung
aufzustellen und diverse Dinge aus objektiver Sicht zu betrachten:
</P>
<P>
Tatsache ist, dass ein neuer Amiga ohne Zweifel f&uuml;r lange Zeit nur ein
Nischenrechner sein w&uuml;rde, da ganz einfach niemand ein ausreichendes
Marketing-Budget hat, um den &quot;Gro&szlig;en&quot; signifikante Marktanteile abjagen zu
k&ouml;nnen (was nicht mal etwas Schlechtes sein muss).
</P>
<P>
Diese Nische sollte allerdings vorher erst einmal gefunden werden. Der
Rechner m&uuml;sste eine bestimmte Hardware in Verbindung mit einmaliger
Software bieten, die es nirgendwo anders gibt, zum Beispiel ein
Komplettrechner der Video-Ein- und -Ausg&auml;nge bietet, einen qualitativ guten
Encoder-Chip hat, Firewire-Anschluss besitzt, eine g&uuml;nstige und
leistungsf&auml;hige Schnittsoftware im Bundle mitbringt und preiswert (ich
benutze bewusst nicht den Begriff &quot;billig&quot;) ist.
</P>
<P>
Und das ist nicht mal die einzige Nische, die es zu belegen g&auml;be...da b&ouml;ten
sich es im Lowtech-Grafikbereich und Soundsektor genau dieselben (wenn
nicht) bessere Chancen.
</P>
<P>
Alles sch&ouml;n und gut, aber leider scheint sich keiner der beiden
&quot;M&ouml;chtegern-Beerber&quot; dar&uuml;ber Gedanken gemacht zu haben. Sie verkaufen ein
Board, wenn es hochkommt, ein Board im Tower mit (wohl billiger)
Grafikkarte und einem OS, bei dem so gut wie nichts sicher ist (au&szlig;er, dass
die Icons billig aussehen) ;). Da keimt der noch geringe Verdacht, dass
scheinbar nicht viele langfristige &Uuml;berlegungen und Pl&auml;ne dahinterstehen.
</P>
<P>
Noch eine andere kleine Kalkulation, die diesen aufkeimenden Verdacht
verst&auml;rkt: Es gibt (wohlwollend gerechnet) noch 30.000 aktive Amiga-User in
Europa. Einige davon sind mit ihrem 68k-Rechner zufrieden, andere wollen
kein Geld f&uuml;r einen neuen Rechner ausgeben bzw. haben aus verschiedenen
Gr&uuml;nden kein Geld daf&uuml;r, so dass man g&uuml;nstigstenfalls davon ausgehen kann,
dass 50 Prozent sich f&uuml;r einen der neuen Rechner entscheiden w&uuml;rden. Das
w&auml;ren also h&ouml;chstens 15.000 Europ&auml;er, die sich auf beide Systeme verteilen.
Laut einer Online-Umfrage, die ich irgendwo gefunden habe, tendieren mehr
als die H&auml;lfte wohl f&uuml;r die offizielle L&ouml;sung, w&auml;hrend sich die Deutschen
tendenziell st&auml;rker an bplan orientieren. Egal, der Einfachheit halber
gehen wir davon aus, dass jeder denselben Anteil, n&auml;mlich 7.500 K&auml;ufer,
bekommt.
</P>
<P>
Da das Werbebudget bei beiden verschwindend klein ausfallen wird, kann sich
jeder an f&uuml;nf Fingern ausrechnen, dass au&szlig;er aus dem Amiga-Stammmarkt keine
neuen K&auml;ufer hinzukommen werden. Woher auch? Es gibt ja nicht einmal die
Chance, &uuml;ber einen solchen Rechner zu stolpern und einen Zufallskauf zu
t&auml;tigen, was auch nicht weiter verwundert, denn es gibt keine &ouml;ffentlich
erh&auml;ltlichen Magazine mehr, und Amiga-L&auml;den lassen sich an zwei H&auml;nden
abz&auml;hlen. Keine Neukunden also!
</P>
<P>
Nun soll mir jemand plausibel erkl&auml;ren, wer f&uuml;r eine Anwenderschar von
7.500 Leuten kommerzielle und zeitgem&auml;&szlig;e Software entwickeln soll? Das kann
niemand und das wird auch niemand tun!
In so einer Marktsituation ist es schlichtweg schwachsinnig, alternative
&quot;Projekte&quot; zu lancieren - es sei denn, man will nur kurz ein paar Tausend
Boards loseisen, ehe die Chance endg&uuml;ltig vorbei ist. Da hat keiner eine
Vision oder gro&szlig;artige Ideen...beide wollen nur Geld.
</P>
<P>
Wenn es um die weitere Entwicklung des Amiga-Marktes gehen w&uuml;rde, dann
h&auml;tte bplan nie versucht, solch eine Spaltung herbeizuf&uuml;hren, oder sie
h&auml;tten sich geeinigt, anstatt sich gegenseitig ans Bein zu pinkeln.
</P>
<P>
Unterm Strich bleibt der Verdacht, dass beim AmigaOne kurzfristig Geld mit
dem Verkauf asiatischer PPC-Boards an Land gezogen werden soll. Man k&ouml;nnte
noch wohlwollend argumentieren, dass die ersten Profite aus dem Verkauf des
AmigaOne dann auch in ein neues Produkt investiert werden, das einen
Mehrwert gegen&uuml;ber dem Original besitzt und vielleicht auch mit Software
gebundlet wird, um die fehlende Marktnische zu besetzen.
</P>
<P>
Zu bplan kann ich nichts Gutes sagen. Ohne Lizenz versuchen sie, sich ein
St&uuml;ck vom Kuchen abzuschneiden, und spalten den sowieso schon winzigen
Markt. Es ist v&ouml;llig egal, ob ihr angek&uuml;ndigtes System tats&auml;chlich besser
ist oder nicht - es besiegelt die Erstickung der letzten kleinen Chance f&uuml;r
ein &Uuml;berleben des Amiga-Marktes.
</P>
<P>
Und w&auml;hrenddessen sitzt AMIGA, Inc. in den Staaten und meint, die
chronische Geldnot mit PDA-Kram beseitigen zu k&ouml;nnen, wo doch die momentane
(und prognostizierte) Umsatzentwicklung im PDA-Markt steil nach unten geht.
Viel Gl&uuml;ck auch.
</P>
<P>
Der Amiga war und ist ein wundervoller Rechner. Leider ist der Mangel an
bestimmter Software eklatant. Wenn man aber keine h&ouml;heren Anspr&uuml;che hat und
darauf verzichten kann, die neuesten Games zu zocken, l&auml;sst es sich immer
noch relativ gut damit leben. Falls nicht, muss man sich halt eine andere
Plattform suchen, denn ein Rechner ist vorrangig ein Werkzeug (auch wenn
ihn manche als Religion ansehen/ansahen).
</P>
<P>
Bleibt bei eurem Amiga, so lange ihr damit leben k&ouml;nnt. Schaut euch
Scenedemos an, lest Diskmags, werdet selbst kreativ (pixelt, macht Sound,
etc.), tretet in Kontakt mit Gleichgesinnten - das hilft, selbst die
gr&ouml;&szlig;eren Depressionen zu vertreiben.
</P>
<P>
Und kauft euch euren wegweisenden bplan-Rechner, wenn ihr unbedingt wollt,
aber sagt nicht, das euch keiner gewarnt hat. F&uuml;r mich hat das Ganze
jedenfalls einen fahlen Beigeschmack.
</P>
<P><B>Marco Siegel &lt;<A HREF="mailto:xenusion@xenusion.com">xenusion@xenusion.com</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
