<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>4. Oldies but Goldies: &raquo;Marble Madness&laquo;</H2>
<P><B>&quot;VORSICHT! DER STAUBSAUGER!!! ... ARRRGH!&quot;</B></P>
<P>
Merkw&uuml;rdige &Uuml;berschrift, oder? Es gibt aber sicher ein paar (oder mehr)
Leute, die diesen Ausruf nur zu gut kennen (ich bin einer davon ;) ). Da
mir zu Ohren gekommen ist, dass es tats&auml;chlich Leute gibt, die damit nichts
anzufangen wissen, schreibe ich heute einmal &uuml;ber den All-Time-Klassiker
&quot;Marble Madness&quot;.
</P>
<P>
Tja, damals... die selige Zeit, als der Amiga wirklich noch ein Traum f&uuml;r
eine Menge Leute war (zu dieser Zeit war er in Deutschland noch gar nicht
erh&auml;ltlich ;) )... Electronic Arts, eine damals eher kleine, recht neue
Spielefirma, k&uuml;ndigte etliche Games f&uuml;r die damals brandneue Plattform
Amiga an, darunter eine Umsetzung eines Automaten-Spiels, eben &quot;Marble
Madness&quot;. Die Ank&uuml;ndigung lie&szlig; vielen Spielhallen-Freaks den Sabber die
Mundwinkel heruntertropfen, denn die Amiga-Version sollte eine 1:1-
Umsetzung des Automaten-Vorbilds werden, mit einem kleinen Unterschied: Man
bezahlt f&uuml;r theoretisch ewiges Spielen nur einmal. ;)
</P>
<P>
Als es dann endlich soweit war, konnte man sehen, dass EA ganze Arbeit
geleistet hatte. Das Spiel war grafisch und soundtechnisch kaum vom
Automaten-Original zu unterscheiden (ein paar Kleinigkeiten waren dann doch
anders, das hat aber niemanden wirklich gest&ouml;rt. ;)
</P>
<P>
Worum geht's denn jetzt bei &quot;Marble Madness&quot;? Nun, vereinfacht gesagt: Man
muss mit einer Murmel eine Art 3D-Rennstrecke absolvieren, und das in
m&ouml;glichst kurzer Zeit. Klingt im ersten Moment nicht besonders aufregend,
ich wei&szlig;. Der Reiz des Ganzen entsteht ja auch erst durch die vielen
unterschiedlichen Gegner und Fallen. Der absolute Hammer ist aber die
M&ouml;glichkeit, zus&auml;tzlich zu den kleinen eingebauten Gemeinheiten, gegen
einen menschlichen Gegner anzutreten. Wenn man sich die Screenshots
ansieht, wird man die Tatsache bemerken, dass die &quot;Rennstrecke&quot; keine
Begrenzungen am Rand hat und die eigene Murmel deshalb auch von der Strecke
&quot;abst&uuml;rzen&quot; kann. Die Schnelldenker unter den Lesern werden daher auch
sofort bemerkt haben, worin der Reiz des Zwei-Spieler-Modus liegt: Selbst
die Punkte f&uuml;r gute Zeiten zu kassieren und den Gegner &uuml;ber den Rand zu
schubsen. Dieser erscheint zwar wieder, verliert aber ein Leben und vor
allen Dingen Zeit. Zeit ist n&auml;mlich mit Abstand das Wichtigste bei Marble
Madness. Schafft man es, einen Level vor Ablauf einer festgelegten Zeit zu
absolvieren, gibt es Punkte und einen Zeitbonus, der einem im n&auml;chsten
Level nat&uuml;rlich einen Vorteil verschafft.
</P>
<P>
 <A HREF="img/marble1.png"><IMG SRC="thumb/marble1.jpg" WIDTH="115" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
 <A HREF="img/marble2.png"><IMG SRC="thumb/marble2.jpg" WIDTH="118" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Das alles klingt im ersten Moment gar nicht so schwer, aber...
</P>
<P>
Die Steuerung der Murmel ist nur ein Problem, das es zu meistern gilt. Die
Murmel hat, wie jede Masse in Bewegung, eine gewisse Tr&auml;gheit, die es bei
einer Richtungs&auml;nderung zu ber&uuml;cksichtigen gilt. Es ist also nicht nur
schnelle Reaktion gefragt, sondern auch Weitsicht und Geschicklichkeit.
Dazu kommt, dass die Murmel bei einem Zusammensto&szlig; mit einer anderen Murmel
oder einer Wand das eigene Bewegungsmoment &uuml;bertr&auml;gt und auch das
entsprechende Gegenmoment erf&auml;hrt. Physik vom Feinsten also.
</P>
<P>
Man kann sich vorstellen, was bei der Abwehr einer gegnerischen Murmel
passiert, wenn man sehr nahe &quot;am Abgrund steht&quot;: Wenn man nicht aufpasst,
f&auml;llt man selbst runter! Das zweite Problem sind die, mitunter recht
fiesen, computergesteuerten Gegner. Man sollte sich darauf konzentrieren,
die Schw&auml;chen der Gegner zu nutzen. Genaue Beobachtung ihres Verhaltens ist
hier das A und O.
</P>
<P>
Da wir gerade bei Gegnern sind: Allein die Beobachtung der &quot;eingebauten&quot;
Gegner ist &auml;u&szlig;erst spa&szlig;ig, denn diese sind erstklassig animiert und
stellenweise wirklich lustig. Da w&auml;re zum Beispiel der Staubsauger, der an
manchen R&auml;ndern einer Strecke auftaucht. Er versucht (wen wundert's?), die
Murmel des Spielers aufzusaugen. Wie oft habe ich meine Murmel einsaugen
lassen, nur um die witzige Animation zu sehen...
</P>
<P>
Es gibt die schwarzen Murmeln, die, ihrem &Auml;u&szlig;eren angemessen, eine
erhebliche Anziehungskraft auf die Murmel des Spielers aus&uuml;ben und die
&quot;Navigation&quot; ziemlich erschweren. Haben sie die Murmel des Spielers im
W&uuml;rgegriff, versuchen sie, diese &uuml;ber den Rand zu schubsen. Und da sind
noch die niedlichen gr&uuml;nen Raupen. Diese wandern zuerst harmlos umher, aber
wenn die Murmel eines Spielers in ihre N&auml;he kommen, verwandeln sich die
Raupen in gefr&auml;&szlig;ige Monster. Sie springen in die Luft und versuchen sich
&uuml;ber die Murmel des Spielers zu st&uuml;lpen, um sie zu fressen.
</P>
<P>
 <A HREF="img/marble3.png"><IMG SRC="thumb/marble3.jpg" WIDTH="115" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Hat man die Steuerung erst mal im Griff, kommt richtig Freude auf. Selbst
wenn man die Rennstrecke relativ friedlich absolviert, macht es einen
Heidenspa&szlig;, &uuml;ber die rampen&auml;hnlichen Steigungen zu springen, die Kurven in
bester Formel1-Manier zu nehmen, Staubsauger als Beschleuniger zu
missbrauchen, die Anziehungskraft der schwarzen Murmeln f&uuml;r besonders
elegante &quot;Schubs-Man&ouml;ver&quot; zu nutzen und, und, und.
</P>
<P>
Die Level selbst sind ebenfalls sehr abwechslungsreich gestaltet: Es gibt
Abgr&uuml;nde, die &uuml;bersprungen werden m&uuml;ssen, Fallrohre, Mini-Ausgaben der
Raupen und der schwarzen Murmeln (walz sie platt, und es gibt Punkte oder
Bonus-Zeit) und sogar ein Level mit optischen T&auml;uschungen à la Escher ist
dabei. Man bekommt also wirklich einiges geboten.
</P>
<P>
 <A HREF="img/marble4.png"><IMG SRC="thumb/marble4.jpg" WIDTH="115" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Probiert's selbst aus, sofern ihr einen passenden Amiga oder Emulator zur
Hand habt. Als Download ist Marble Madness bei &quot;AMI Sector One&quot;
(<A HREF="http://amiga.emucamp.com/marblem.htm" TARGET="_top">http://amiga.emucamp.com/marblem.htm</A>) erh&auml;ltlich. Ich gehe einfach mal
davon aus, dass der Download legal ist (mir ist zumindest nichts
Gegenteiliges bekannt).
</P>
<P>
Hm, irgendwie habe ich jetzt wieder Lust auf eine kleine Runde &quot;Marble
Madness&quot;, also werfe ich mal die Originale an (Original Amiga 1000, und da
stopfe ich die Original-Diskette rein... ;)
</P>
<P><B>Wolfgang Hosemann &lt;<A HREF="mailto:whose@gmx.de">whose@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
