<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>5. AmigaOS vs. Amiga Anywhere vs. MorphOS: Das meint Thomas Steiding/Epic</H2>
<P><B>Zum Thema AmigaDE/Amiga Anywhere:</B></P>
<P>
Die Grundkonzeption von intent/AmigaDE schien uns anfangs eine sehr
interessante Sache, da mit einmaligem Aufwand viele verschiedene
Hardwareplattformen bedient werden k&ouml;nnten. Aus diesem Grund haben wir uns
entschlossen, zwei kleinere Spiele f&uuml;r diese Plattform zu entwickeln.
Leider zeigte es sich aber, dass derzeit nur ein sehr begrenzter
Absatzmarkt f&uuml;r DE-Applikationen vorhanden ist, so dass wir uns daf&uuml;r
entschieden, weitere Projekte (Portierung von Simon 2 und Birdie Shoot auf
intent/AmigaDE) vorerst einzufrieren. Ich hoffe, AMIGA, Inc. findet noch
irgendwie eine M&ouml;glichkeit, sich in diesem h&auml;rter werdendem Markt zu
etablieren, bin aber mittlerweile sehr skeptisch, ob das gelingen wird, da
andere (und vor allem gr&ouml;&szlig;ere) Unternehmen mittlerweile mit &auml;hnlicher
Technik auf den Markt dr&auml;ngen. Ich f&uuml;rchte einfach, dass der Zug hier f&uuml;r
AMIGA, Inc. abgefahren ist.
</P>
<P><B>Zum Thema AmigaOS 4 vs. MorphOS:</B></P>
<P>
Wir haben uns recht fr&uuml;h dazu entschlossen, die Kombination aus
Pegasos/MorphOS mit Software zu bedienen, da wir der Meinung sind, dass
diese Kombination eigentlich das ist, worauf Amigauser seit 1996 sehnlichst
warten: Ein PPC-natives Betriebssystem, das dem AmigaOS in Komfort und
Leistung in nichts nachsteht, kombiniert mit moderner und aktueller PPC-
Hardware. Zu diesem Zeitpunkt war seitens AMIGA, Inc. betont worden, dass
man nicht gedenke, das Classic-OS weiterzuf&uuml;hren. Auch eine Hardware-L&ouml;sung
existierte zu diesem Zeitpunkt nur in den Gedankenspielen einiger Amiga-
Verantwortlicher.
</P>
<P>
Bis Ende 2002 planen wir rund ein halbes Dutzend Spiele f&uuml;r MorphOS zu
ver&ouml;ffentlichen, darunter Earth 2150 und Simon 3D.
</P>
<P><B>Thema OS4:</B></P>
<P>
Zun&auml;chst einmal m&ouml;chte ich unseren Respekt f&uuml;r den Mut aussprechen, dass
sich Hyperion die Portierung von AmigaOS auf den PPC aufgeladen hat. Es ist
sicher ein Mammutprojekt, und die (monet&auml;re) Belohnung f&uuml;r den Aufwand wird
sicherlich kaum ausreichend sein. Es bedarf einer ganzen Menge
Enthusiasmus, der bei den Hyperion-Jungs sicher vorhanden ist, um dieses
Projekt unter den gegebenen Rahmenbedingungen durchzuziehen.
</P>
<P>
Aus &ouml;konomischer Sicht kann ich die Entscheidung jedoch nicht ganz
nachvollziehen, da mit MorphOS eine M&ouml;glichkeit existiert h&auml;tte, den
bestehenden Amiga-Markt schneller mit PPC-Hardware zu versorgen. Ich denke,
mit etwas mehr Engagement der beiden Lager, vor allem aber seitens AMIGA,
Inc., h&auml;tte hier eine &Uuml;bereinkunft erzielt werden k&ouml;nnen, von der letztlich
alle Beteiligten profitiert h&auml;tten. So wird sich der Markt, in schlechter
Amiga-Tradition seit 1997, wieder einmal spalten. Zudem werden mit dieser
Entscheidung wertvolle Ressourcen verschwendet, die m.E. anderweitig
sinnvoller h&auml;tten eingesetzt werden k&ouml;nnen, z.B. f&uuml;r die Portierung
wichtiger Applikationen oder Spiele.
</P>
<P>
Wir haben uns dazu entschlossen, Pegasos/MorphOS zu unterst&uuml;tzen, da ich
derzeit in dieser Kombination mehr Marktpotenzial sehe, da eben nicht nur
der verbliebene, ohnehin schon sehr kleine Amiga-Markt, bedient werden
soll. Zum anderen steht die Pegasos/MorphOS-Kombination m.E. dicht vor der
Auslieferung an den Endkunden, w&auml;hrend ich bez&uuml;glich des Status von
AmigaOne/AmigaOS4 immer noch ziemlich im Dunkeln tappe.
Aber ich sch&auml;tze, wenn AmigaOS4/AmigaOne ebenfalls dicht vor dem
Verkaufsstart stehen w&uuml;rden, h&auml;tten wir, als eine der wenigen verbliebenen
Softwarefirmen, die auch noch auf den Amiga portiert hat, von offizieller
Seite eine Anfrage erhalten, ob wir AmigaOS 4 unterst&uuml;tzen werden bzw.
einen Fahrplan/Featureliste erhalten, der uns aufkl&auml;rt, wann mit der
Markteinf&uuml;hrung zu rechnen ist. Da dies bislang nicht der Fall war, gehe
ich davon aus, dass ein Endkundenprodukt wohl kaum im 3. Quartal
ausgeliefert werden wird.
</P>
<P>
Thomas Steiding &lt;<A HREF="mailto:thomas@epic-interactive.com">thomas@epic-interactive.com</A>&gt;,
e.p.i.c. interactive entertainment gmbh (<A HREF="http://www.epic-interactive.com" TARGET="_top">http://www.epic-interactive.com</A>)
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
