<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Workshops.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Workshops
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Workshops / Hintergrundberichte / Buchvorstellungen</H1>
<H2>1. Workshop: AFPL Ghostscript 6.50 - Teil 3 (von Uwe Pannecke)</H2>
<P><B>Crash-Kurs durch die Ghostscript-Untiefen</B></P>
<H3>1. Dokumentenschau</H3>
<P>
Bleiben wir zu Beginn unseres dritten Teils noch ein wenig bei der Anzeige
von Postscript- und PDF-Dokumenten.
</P>
<H4>1.1 DOpus - des geisterhaften Interpreters Freund</H4>
<P>
Bisher haben wir uns vorrangig &uuml;ber die Shell mit Ghostscript verst&auml;ndigt.
Das wird auch im Wesentlichen f&uuml;r den grunds&auml;tzlichen Einstieg in den
Umgang mit dem Programm so bleiben. Doch sollen im allt&auml;glichen Einsatz PS-
und PDF-Dateien m&ouml;glichst schnell und aufwandsarm auf dem Bildschirm
gezaubert werden, bietet sich die Einbindung des Interpreters in
Dateimanager wie etwa Directory Opus an.
</P>
<P>
Nachfolgend ein Beispiel f&uuml;r die DOpus-Konfiguration zur Anzeige von PS-
Dateien. Sinngem&auml;&szlig; k&ouml;nnt ihr die Ausf&uuml;hrungen selbstverst&auml;ndlich ebenso auf
die Anzeige von PDF-Dokumenten &uuml;bertragen. Startet also DOpus und w&auml;hlt im
Men&uuml; den Abschnitt &quot;Einstellungen&quot; und dort den Unterpunkt &quot;Dateitypen...&quot;.
</P>
<P>
 <A HREF="img/gs_dopus1.png"><IMG SRC="thumb/gs_dopus1.jpg" WIDTH="120" HEIGHT="59" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
In selbigem definieren wir nun einen passenden Dateityp &quot;Postscript&quot;, der
DOpus in die Lage versetzten wird, bei Doppelklick auf eine PS-Datei
automatisch Ghostscript mit der Anzeige der Datei zu beauftragen. Also
klickt auf den Button &quot;Add&quot;.
</P>
<P>
Sogleich &ouml;ffnen sich zwei Fenster. Wir wenden uns dem Dateityp-Fenster zu,
erkennbar an der oberen Zeile mit den Eintr&auml;gen &quot;Namen&quot;, &quot;ID&quot; und &quot;PRI&quot;. In
das Feld hinter &quot;Name&quot; tragt ihr eine aussagekr&auml;ftige Bezeichnung, unter
der der Dateityp aufgelistet werden soll, ein. Angemessen ist sicherlich
&quot;Postscript&quot;. Hinter &quot;ID&quot; tippt ihr &quot;PS&quot; ein und &quot;Pri&quot; bleibt auf der
Vorgabe &quot;0&quot;. Wichtig ist nun, DOpus mitzuteilen, woran der Dateimanager
erkennen soll, dass es sich um eine Postscript-Datei handelt. W&auml;hlt mit
einem Klick auf das Schubladen-Symbol den Eintrag &quot;Match Name&quot; aus und f&uuml;gt
in der Zeile die charakteristische Dateiendung mit dem Eintrag &quot;#?.ps&quot;
hinzu. Ein Klick auf &quot;Use&quot; schlie&szlig;t die Definition ab.
</P>
<P>
 <A HREF="img/gs_dopus2.png"><IMG SRC="thumb/gs_dopus2.jpg" WIDTH="120" HEIGHT="33" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
&Uuml;brig bleibt nun noch das Ereignis-Fenster, in dem ihr festlegt, was DOpus
bei einer bestimmten Aktion mit der angew&auml;hlten Datei machen soll. Wir
haken &quot;Doubleclick&quot; ab und w&auml;hlen anschlie&szlig;end den Button &quot;Edit&quot;. Im sich
daraufhin &ouml;ffnenden Fenster veranlassen wir in zwei Zeilen die Anlage eines
ausreichenden Stapelspeichers f&uuml;r den Interpreter und &uuml;bergeben Ghostscript
mit &quot;{f}&quot; die sp&auml;ter im Dateilister ausgew&auml;hlte Datei. Zus&auml;tzlich haken wir
die Option &quot;Output to window&quot; ab und veranlassen so Ghostscript, das
Anzeige-Fenster so lange offen zu lassen, bis wir es explizit schlie&szlig;en.
</P>
<P>
 <A HREF="img/gs_dopus3.png"><IMG SRC="thumb/gs_dopus3.jpg" WIDTH="120" HEIGHT="33" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Mit drei letzten Mausklicks auf &quot;Use&quot;, noch einmal &quot;Use&quot; und &quot;Save&quot; ist die
Konfiguration abgeschlossen.
</P>
<H4>1.2 Zeig mir deine Schokoladenseiten</H4>
<P>
Zwischenzeitlich werden die Ghostscript-Freunde unter euch vielleicht schon
diverse PDF-Dokumente betrachtet oder auch gedruckt haben. Nicht immer
m&ouml;chte man den kompletten Umfang des Dokuments nutzen. Sollen von solch
einer Datei nur bestimmte Seiten angezeigt oder zu Papier gebracht werden,
kann Ghostscript selbstverst&auml;ndlich die entsprechende Auswahl vornehmen.
Die passenden Aufrufoptionen sind in diesem Fall
&quot;-dFirstPage=AnfangsSeitennummer&quot; und &quot;-dLastPage=EndSeitennummer&quot;.
Wie ihr sicher schon w&auml;hrend ersten Experimenten bei der Ghostscript-
Nutzung bemerkt habt, besteht das Programm Amiga-un&uuml;blich (daf&uuml;r aber
Unix/Linux-typisch) auf eine peinlich genaue Beachtung der Gro&szlig;- und
Kleinschreibung in der Syntax.
</P>
<H3>2. Eine Bildershow mit Ghostscript</H3>
<P>
Ghostscript kann nicht nur mit PS- und PDF-Dokumenten umgehen. Ebenso ist
der Interpreter in der Lage, Bilder im GIF-, JPEG-, PBM-, PCX- und CMYK-
Format direkt ohne vorherige Konvertierung auf dem Bildschirm auszugeben.
In solchen F&auml;llen bedient sich der Interpreter der im Ghostscript-eigenen
&quot;Libs&quot;-Verzeichnis abgelegten Hilfsprogramme &quot;viewgif.ps&quot;, &quot;viewjpeg.ps&quot;,
&quot;viewpbm.ps&quot;, &quot;viewjpeg.ps&quot;, &quot;viewpcx.ps&quot; und &quot;viewcmyk.ps&quot;.
</P>
<P>
Die entsprechende Syntax der Befehle werden wir uns mit der Anzeige eines
JPEG-Bilds verdeutlichen. Sinngem&auml;&szlig; sind die restlichen unterst&uuml;tzten
Formate zu handhaben. Wir begeben uns also wieder in die Shell, beamen uns
mittels &quot;cd Ghostscript:&quot; in das Interpreter-Verzeichnis und setzen mit
&quot;stack 200000&quot; den Stapelspeicher auf eine ausreichende H&ouml;he. Anschlie&szlig;end
starten wir Ghostscript und &uuml;bergeben dem Programm dabei mit &quot;gs
viewjpeg.ps&quot; eine PS-Hilfsdatei, die den Interpreter in die Lage versetzt,
das entsprechende Bildformat anzuzeigen.
</P>
<P>
Die eigentliche Bildschirmpr&auml;sentation erfolgt im interaktiven Dialog mit
dem Interpreter durch den Aufruf &quot;(Bildname.jpg) viewJPEG&quot;.
</P>
<P>
 <A HREF="img/gs_picview.jpg"><IMG SRC="thumb/gs_picview.jpg" WIDTH="110" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Analog k&ouml;nnt ihr mit allen unterst&uuml;tzen Bildformaten verfahren, beachtet
dabei wieder wie gehabt die korrekte Gro&szlig;- und Kleinschreibung, also
beispielsweise &quot;(Bildname.gif) viewGIF&quot;.
</P>
<H3>3. Konvertieren, bis der Prozessor gl&uuml;ht</H3>
<P>
Eine weitere interessante Seite des Postscript-Interpreters ist seine
F&auml;higkeit, bestimmte Dateiformate ineinander umwandeln zu k&ouml;nnen.
Nachfolgend einige M&ouml;glichkeiten zur Anregung f&uuml;r eigene Experimente:
</P>
<H4>3.1 Adobe Illustrator</H4>
<P>
Wer seine PS-Dateien in das Grafikformat &quot;AI&quot; des Adobe Illustrator
umwandeln m&ouml;chte, bedient sich des Hilfsprogramms &quot;ps2ai.ps&quot;, zu finden
wiederum im &quot;libs&quot;-Verzeichnis.
</P>
<P>
Wir wollen im Zusammenspiel von &quot;ps2ai.ps&quot; und Ghostscript den allseits
bekannten Tiger aus der &quot;Examples&quot;-Schublade in eine Adobe Illustrator-
Datei transformieren. Da die Kommandofolge
&quot;gs ps2ai.ps zu_konvertierende_Datei.ps&quot; lediglich das
Konvertierungsergebnis in der Shell ausgeben w&uuml;rde, leiten wir mit
&quot;&gt;RAM:neue_Datei.ai&quot; die Ausgabe in die Datei &quot;neue_Datei.ai&quot; in der RAM-
Disk um. Selbstverst&auml;ndlich kann f&uuml;r die Ausgabeumleitung anstelle der RAM-
Disk auch ein beliebiges Verzeichnis auf der/den Amiga-Festplatte(n)
benutzt werden.
</P>
<P>
F&uuml;r unser konkretes Beispiel lautet so der komplette Aufruf
&quot;gs &gt;RAM:Tiger.ai ps2ai.ps examples/tiger.ps&quot;.
</P>
<P>
 <A HREF="img/gs_ps2ai.png"><IMG SRC="thumb/gs_ps2ai.jpg" WIDTH="120" HEIGHT="53" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Mehr oder weniger kurze Zeit nach ihrem Postscript-Absprung ist die
Gro&szlig;katze als AI-Tiger gelandet, zumindest fast: Da AFPL Ghostscript in den
ersten vier Zeilen der AI-Dateien Hinweise zu sich selbst und den
verwendeten Fonts ohne Voranstellung der Kommentareinleitung &quot;%%&quot;
vermerkte, mussten diese Zeilen in einem Texteditor entweder zuvor entfernt
oder der Anfang jeder Zeile mit &quot;%%&quot; versehen werden, bevor Adobe
Illustrator die AI-Datei als solche akzeptierte.
</P>
<H4>3.2 In der Destille</H4>
<P>
Hier soll es nicht um hochprozentige, mehr oder wenig gut schmeckende
Fl&uuml;ssigkeiten gehen, vielmehr versetzen wir den Interpreter in die Lage,
Postscript-Dateien in das PDF-Format zu wandeln. Und hier kommt auch gleich
ein gro&szlig;er Vorteil der aktuellen Version 6.50 gegen&uuml;ber der alten 5.10 zum
tragen: Fonts k&ouml;nnen als solche in einem zu erstellenden PDF-Dokument
eingebettet werden.
</P>
<P>
Ghostscript 5.10 und auch andere PDF-erstellende Programme auf dem Amiga
wandeln diese Fonts zumeist in Bitmaps um. Dies bl&auml;ht die erstellte PDF-
Datei erheblich auf und sorgt au&szlig;erdem f&uuml;r eine sehr bescheidene
Schriftqualit&auml;t. Ghostscript 6.50 kann diese Klippe bei der Umwandlung der
meisten Postscript-Dateien elegant umschiffen.
</P>
<P>
Wieder soll ein Beispiel die Vorgehensweise demonstrieren: In der RAM-Disk
liegt die Postscript-Datei &quot;shell.ps&quot;, &uuml;ber das Device &quot;pdfwrite&quot; wird
diese nach PDF gewandelt und als &quot;shell.pdf&quot; erneut in der RAM-Disk
abgelegt.
</P>
<P>
 <A HREF="img/gs_pdfwrite.png"><IMG SRC="thumb/gs_pdfwrite.jpg" WIDTH="120" HEIGHT="20" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Da Ghostscript bei der interaktiven Bearbeitung nach jeder konvertierten
Seite auf eine Best&auml;tigung f&uuml;r die Bearbeitung der nachfolgenden Seite
wartet, k&ouml;nnt ihr bei umfangreichen Dokumenten den Interpreter mit dem
Kommando &quot;-dNOPAUSE&quot; &uuml;berreden, alle Seiten in einem Rutsch zu bearbeiten.
Soll sich Ghostscript nach getaner Arbeit selbst&auml;ndig beenden, hilft der
Schalter &quot;-dBATCH&quot;.
</P>
<H4>3.3 Von PDF nach Postscript</H4>
<P>
Was zumeist mit sehr brauchbaren Ergebnissen von PS nach PDF funktioniert,
gelingt ebenso in der Konvertierung von PDF nach Postscript. Die
Vorgehensweise entspricht der der PS-nach-PDF-Konvertierung, nur dass
diesmal das Device &quot;pswrite&quot; zum Zuge kommt. Aus einem 18seitigen Folien-
Satz zur Knoppix-CD [2] sollen in unserem Fall lediglich die Seiten 17 und
18 ins Postscript-Format umgesetzt werden, deshalb erzwingt der Schalter
&quot;-dFirstpage=17&quot; die Ignorierung der ersten 16 Seiten.
</P>
<P>
 <A HREF="img/gs_pswrite.png"><IMG SRC="thumb/gs_pswrite.jpg" WIDTH="120" HEIGHT="25" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Die in den PDF-Dokumenten eventuell vorhandenen interaktiven Links k&ouml;nnt
ihr in dem erstellen PS-Dokument, obwohl abgebildet, prinzipbedingt
nat&uuml;rlich nicht mehr nutzen. Daf&uuml;r steht einem &quot;Durch&quot;-Bl&auml;ttern des
Dokuments nichts im Wege.
</P>
<H3>4. Und tsch&uuml;s</H3>
<P>
So, jetzt habt ihr genug Material, um intensiv mit Ghostscript spielen und
die Zeit bis zum n&auml;chsten Teil &uuml;berbr&uuml;cken zu k&ouml;nnen. :)
Wenn alles wie geplant verl&auml;uft, schauen wir uns dann das Extrahieren von
Inhaltsbestandteilen, wie Textpassagen und Bilder, aus PDF-Dateien und das
Drucken der PS- und PDF-Dokumente ein wenig n&auml;her an.
</P>
[1] im Aminet unter <A HREF="http://de.aminet.net/aminetbin/find?gfx+conv+GS650-+.lha">/gfx/conv/GS650-***.lha</A><BR>
[2] <A HREF="http://www.knopper.net" TARGET="_top">http://www.knopper.net</A><BR>
<P><B>Uwe Pannecke &lt;<A HREF="mailto:Uwe.Pannecke@t-online.de">Uwe.Pannecke@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
