<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - MMX: For the Masses</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;DM - For the Masses&quot;</H1>von<BR><A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></DIV>
<P>Seit Anfang der 80er Jahre schafft es eine britische Pop-Band, sich einen
eigenen ganz speziellen Stil und Status zu erhalten und dabei dennoch
immer Neues zu kreieren. Obgleich ihr Name wohl kaum einem Menschen
unbekannt sein d&uuml;rfte, besitzen sie einen konstanten Fan-Kreis, der
wie eine eingeschworene Gemeinde wirkt.
</P><P>
Seit Anfang des Achten dieses Jahres gesellt sich ein Tribut-Album mit
&auml;hnlichem Charme zu den Werken, die von und um diese Gruppierung
produziert wurden. Der Name der Band ist <B>Depeche Mode</B>, der der CD &quot;For
the Masses&quot;.
</P><P>
Die Begr&uuml;nder des kleinen Labels <B>1500 Records</B> haben ein Aufgebot an Bands
f&uuml;r dieses Album zusammengetrommelt, deren Liste es bereits in den Ohren
klingeln l&auml;&szlig;t. Von den <B>Smashing Pumpkins</B> und <B>The Cure</B> reicht das Spektrum
&uuml;ber <B>Dishwalla</B>, <B>Locust</B> und <B>Apollo Four Fourty</B> bis hin zu <B>Rammstein</B>, deren
Beitrag &quot;Stripped&quot; derzeit durch H&ouml;rfunk und Charts geistert.
</P><P>
Und damit werden wir auch schon konkret. Das Album startet mit der
Pumpkins-Version von &quot;<B>Never let me down again</B>&quot;, die bereits 1993 erschien
und sich anh&ouml;rt, als k&auml;me der Song von ihnen selbst. Er geh&ouml;rte bereits
beim ersten Durchh&ouml;ren klar zu meinen Favoriten. &Auml;hnlich verh&auml;lt es sich
mit The Cures &quot;<B>World in my eyes</B>&quot;. Dazwischen vertritt sich das Label
selbst durch die eigene Band God lives underwater mit &quot;<B>Fly on the
windscreen</B>&quot; und wir finden eine &quot;<B>Enjoy the silence</B>&quot;-Version von Failure.
Einen ebenso bekannten Titel fanden Dishwalla in &quot;<B>Policy of Truth</B>&quot;.
</P><P>
Besonders gef&uuml;hlvoll ist das von Veruca Salt gesungene Solo &quot;<B>Somebody</B>&quot;,
es bildet einen regelrechten Ruhepol auf der CD, eine kurze
Verschnaufpause nach den ersten 5 Titeln und gleichzeitig eine geschickte
&Uuml;berleitung zu den Vertretern des n&auml;chsten musikalischen Stils. Hier
finden wir nach Meat Beat Manifestos &quot;<B>Everything counts</B>&quot; Hooverphonic,
die vor kurzem ihr zweites Album ver&ouml;ffentlichten und hier mit einer
verspielten Version von &quot;<B>Shake the desease</B>&quot; aufwarten.
</P><P>
Da gestaltet sich der &Uuml;bergang zum direkt folgenden &quot;<B>Master und servant</B>&quot;,
dem von Locust ein v&ouml;llig neuer Charme eingehaucht wurde, nat&uuml;rlich
flie&szlig;end. Dieses Duett von m&auml;nnlicher und weiblicher Stimme ist so
angenehm, da&szlig; ich bereits vergessen habe, wie das Original klingt.
</P><P>
Es folgen Self mit &quot;<B>Shame</B>&quot; und Monster Magnet mit &quot;<B>Black Celebration</B>&quot;,
um dann durch einen weiteren Highlight-Block abgel&ouml;st zu werden, der in
&quot;<B>Waiting for the night</B>&quot; von Rabbit in the Moon, Apollo Four Fortys
&quot;<B>I feel you</B>&quot; und Gus Gus, die sich mit &quot;<B>Monument</B>&quot; einen eher unbekannten
Titel aussuchten, besteht. Zu diesen Titeln ist nicht viel zu sagen, denn
die St&uuml;cke klingen, wie man es sich von den Bands erwartet h&auml;tte.
</P><P>
Fehlen noch die Deftones mit &quot;<B>To have and to hold</B>&quot; und Rammstein.
</P><P>
Das alles pa&szlig;te tats&auml;chlich auf eine kleine Silberscheibe, die damit
eine Gesamtspielzeit von 73,56 Minuten erreicht. Das Booklet verdankt
seine sehr passende Gestaltung Martyn Arkins, der hier gekonnten
Minimalismus walten lie&szlig;.
</P><P>
Alles in allem ist das eine der rundesten CDs, die sich in meinem
Besitz befinden. Beim Cover angefangen &uuml;ber die Musik selbst bis hin zur
Zusammenstellung und Sortierung stimmt hier einfach alles. Mit Sicherheit
werden an dieser Produktion nicht nur eingefleischte Depeche Mode-Fans
angesprochen werden, und das ist ja nicht zuletzt Ziel eines solchen
Tribut-Albums.
</P>
&copy; 1995 1500 Records
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9809mmx.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9809cd2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
