<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - MMX: No Prisoner</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;No Prisoner&quot; / Phil Christian</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>
<P>Auf dem CD-Cover wird damit geworben, da&szlig; hier, neben dem ehemaligen
<B>Cheap Trick</B>-Mitglied Phil Christian, Steve Salas von <B>Colorcode</B> und
Jason Scheff von <B>Chicago</B> an der CD beteiligt w&auml;ren.
</P><P>
Das Booklet, das im &uuml;brigen entt&auml;uscht, da es beinahe lediglich eine
Aufstellung der Songs bietet, zeigt dann, da&szlig; diese Angaben zwar nicht
falsch sind, da&szlig; aber Jason Scheff z.B. lediglich bei einem Titel
(&quot;Waiting 4 U&quot;) in der Band mitgespielt hat. Gl&uuml;cklicherweise erweist
sich, da&szlig; der kleine Etikettenschwindel keine (negativen) Auswirkungen
auf die Qualit&auml;t hatte.
</P><P>
Mit dem ersten Titel &quot;<B>Just Another Broken Heart</B>&quot; geht es schon recht
furios los. Dynamische Instrumentierung, teilweise treibende Rhythmen
und engagierter Gesang wissen zu gefallen.
</P><P>
&quot;<B>Hey Andrea</B>&quot; ist in der Tat wieder einer dieser Titel aus der Serie
der `Frauennamen-Songs` (Suzanna, Nikita usw.) :) . Klingt gut und l&auml;dt
wie so mancher andere Titel auf dieser CD zum Mitsingen (zumindest des
Refrains) ein.
</P><P>
In dem (halben) Titelsong &quot;<B>Prisoner</B>&quot; singt Phil Christian zwischen den
Kehrreim-Sequenzen sich etwas zur&uuml;cknehmend und wei&szlig; dem Titel mit seiner
Stimme, die zeitweise einen rauchigen Einschlag haben und dann auch wieder
ganz klar klingen kann, eine ganz eigene Note zu geben. Ansonsten handelt
es sich um waschechten, positiven Rock.
</P><P>
&quot;<B>Million Miles Away</B>&quot; ist ein ruhiger, ein sehr sch&ouml;ner Song. Mit
&quot;<B>Nothing Good In Goodbye</B>&quot; wird wieder zu dem frischen, lebensbejahenden
Rock zur&uuml;ckkehrt, wie auch &quot;<B>Facing The Fire</B>&quot; und &quot;<B>Waiting 4 U</B>&quot; Spa&szlig;
machen.
</P><P>
&quot;<B>Pain For The Pleasure</B>&quot;, enth&auml;lt mit seinem ruhigerem Hauptteil und dem
rauheren Refrain einen netten Kontrast. &quot;<B>Living In The Bad World</B>&quot; ist
etwas h&auml;rter und auch etwas unmelodi&ouml;ser als die anderen Titel.
</P><P>
&quot;<B>Mary, Mary</B>&quot; ist eine sanfte Ballade, die auch mit zwischengeschoben
schnelleren Takten aufwarten kann, wie &uuml;berhaupt kaum einer der Titel
wirklich statisch ist.
</P><P>
&quot;<B>Mama Don`t Cry</B>&quot; basiert meiner Meinung nach teilweise auf einem
Kinderreim, den ich jetzt nicht namentlich benennen k&ouml;nnte. Irgwendwie
gew&ouml;hnungsbed&uuml;rftig, aber auch interessant.
</P><P>
&quot;<B>China`s Crying</B>&quot; ist sicherlich einer der herausragenden Titel der CD.
Thematisch befa&szlig;t er sich mit den Vorg&auml;ngen bei dem Massaker der
chinesischen Polizei gegen Studenten auf dem Platz des Himmlischen
Friedens vor einigen Jahren, ragt also aus der sonstigen Liebe-/ Herz-/
Schmerz-Schiene heraus. Und er klingt auch noch wirklich gut! ;)
</P><P>
Bei &quot;<B>Nina`s Song</B>&quot; schlie&szlig;lich handelt es sich um ein etwa zweimin&uuml;tiges
Instrumental, das mich vom Stil her stark an den `Kindergarten Cop`-
Soundtrack erinnert. Ein ruhiger Ausklang der CD.
</P><P>
Alles in allem also eine frische, rockig/positive CD, die vom Stil her
teilweise an den Sound der achtziger Jahre erinnert. Die Titel sind
gut gespielt und gesungen und brechen mit gelegentlichen kurzen
Instrumentaleinlagen, bei der die Gitarre oft eine wichtige Rolle
spielt, hier und da aus dem Trott des Text/Chorus-Schemas aus.
</P><P>
Laut Booklet gilt f&uuml;r diese CD &uuml;brigens:
</P><P>
                  <CENTER><B>&quot;For Best Results - TURN IT UP!&quot;</B></CENTER>
</P><P>
&copy;/(P) Explorer/Empire Records 1997, Vertrieb: Point Music.
</p>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9809cd1.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9809cd3.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
