<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - MMX: Gattaca</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Gattaca</H1>von<BR><A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></DIV>

<P><B>Visionen</B> &uuml;ber eine nicht allzu ferne zuk&uuml;nftige menschliche Gesellschaft,
die durch die totale Kontrollierbarkeit des Individuums gekennzeichnet
sind, gibt es nicht erst seit ein paar Jahren. Da mu&szlig; man sich schon
einiges einfallen lassen, um auf dieser Basis ein originelles Szenario
f&uuml;r einen Film zu entwerfen. Andrew Caroll versuchte sich daran mit
einigem Erfolg, indem er eine Welt bastelte, in der das Bewu&szlig;tsein &uuml;ber
den eigenen genetischen Code zu allt&auml;glicher Gegenw&auml;rtigkeit geworden ist.
</P><P>
Auf der Suche nach Perfektion sind die Menschen dahin gekommen, ihre
genetische Struktur vor der Geburt zu manipulieren. Wir erleben die Zeit
des &Uuml;bergangs, eine Zeit, in der sich die Gesellschaft in zwei Klassen
teilt: die eine der validen, gez&uuml;chteten Menschen, die andere der
in-validen, normalgeborenen. Die Erbinformation ist dabei wichtigster
Bestandteil der eigenen Pers&ouml;nlichkeit geworden, man wird praktisch
nach ihr beurteilt.
</P><P>
In diese Welt hinein wird Vincent Anton Freeman geboren, ein Gotteskind,
wie die in-validen auch genannt werden, der bald einen perfektionierten
Bruder zur Seite gestellt bekommt. Zwischen ihnen w&auml;chst unweigerlich ein
Konflikt, eine harte Konkurrenz, in der der eine gewohnt ist, unterlegen,
der andere, &uuml;berlegen zu sein. Bis sich eines Tages alles &auml;ndert, f&uuml;r
Vincent zumindest.
</P><P>
An dieser Stelle lernen wir Gattaca kennen, das hiesige Raumfahrtzentrum,
in welchem Vincent seinem unerreichbaren Traum, in den Weltraum zu
fliegen, nachgeht. Als er aber merkt, da&szlig; seine genetische Identit&auml;t
ihm den Weg dorthin unweigerlich versperrt, sucht er einen anderen Weg...
</P><P>
Das Thema ist wirklich vielversprechend, etliche Probleme brechen auf,
von denen Niccol auch einige anschneidet (Freiheit, Macht, Diskriminierung,
Ehrgeiz u.a.). Im Mittelpunkt aber steht der Werdegang Vincents, bei dem
diese Probleme nat&uuml;rlich auftauchen, jedoch nie so weit in den Vordergrund
schwemmen k&ouml;nnen, da&szlig; ihnen gr&ouml;&szlig;ere Bedeutung zukommt.
</P><P>
Stattdessen erleben wir eine Art Katz-und-Maus-Spiel zwischen dem Helden
und der allgegenw&auml;rtigen genetischen Kontrolle, vertreten durch ein paar
Detektive. Folge ist, da&szlig; Gattaca viel von seinem Potential &uuml;berhaupt
nicht entfalten kann, das gelungene Szenario wird &uuml;berhaupt nicht
ausgereizt. Niccol erz&auml;hlt zwar in sch&ouml;nen eindrucksvollen Bildern,
jedoch erz&auml;hlt er nur. Die Geschichte wird zu eingeengt, zu klein und
abgeschirmt, bleibt daher auch ohne Konsequenz.
</P>
Gattaca bietet einen gro&szlig;en Rahmen, in dem ein Werk von bewegendem Ausma&szlig;
Platz gehabt h&auml;tte, in dem sich aber nur ein kleines angestaubtes
Familienfoto befindet.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9809film.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9809fil3.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
