<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - MMX: Calm Before Storm</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Calm Before Storm&quot; / DARE</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>
<P>Diese CD macht schon einmal mit einem wundersch&ouml;nen Cover auf sich
aufmerksam, auf dem man ein M&auml;dchen anmutig &uuml;bers Wasser in Richtung
eines malerischen Sonnenuntergangs laufen sieht. Das Bild, das ein
M&uuml;nchner Airbrush-K&uuml;nstler f&uuml;r die englische Band schuf, bezieht sich
aber nicht auf den Titelsong, sondern auf den ersten Song &quot;<B>Walk On The
Water</B>&quot;.
</P><P>
Und dieser Song ist mit Sicherheit auch eines der Prachtst&uuml;cke der CD.
Eine langsame Einf&uuml;hrung, mit sanften Gitarrenkl&auml;ngen und diversem
leisen Sprechfunk im Hintergrund, leitet zu der eigentlichen Intro &uuml;ber,
bis Darren Wharton`s Stimme voller Gef&uuml;hl und Inbrunst einsetzt. Nein,
das ist kein ausgesprochen langsamer Song, sondern er rei&szlig;t einen auf
seine Art mit, verf&uuml;hrt einen mit seinen Tempowechseln und fasziniert
mit der gelungenen, ausgewogenen Instrumentierung, bis schlie&szlig;lich der
Titel mit einer langen, ruhigen Sequenz nach fast sieben Minuten
wieder ausklingt.
</P><P>
&quot;<B>Someday</B>&quot; ist von der Geschwindigkeit schneller und &uuml;berzeugt
sowohl durch Melodik und Lyrik:
</P><P>
<B><CENTER>&quot;Father look what they`ve done<BR>
They`ve taken the heart of your son<BR>
It`s a long road that leads to my soul<BR>
But I still hear the words that you said<BR>
There`s a cold wind blowin` outside&quot;</CENTER></B>
</P><P>
&quot;<B>Calm Before The Storm</B>&quot; ist ein weiterer herausragender Song. Er beginnt
sehr ruhig, fast ein wenig melancholisch, wird aber dann mit dem ersten
Refrain temperamentvoller, ohne die Grundstimmung zu &auml;ndern. Eine lange,
angenehme Iinstrumental-Sequenz schlie&szlig;t auch ihn ab. Der Titel vermag
Emotionen zu wecken und ist absolut h&ouml;renswert.
</P><P>
Flotter weiter geht es mit &quot;<B>Rescue Me</B>&quot; - auch ein sehr sch&ouml;ner Titel,
ebenso wie der sehr langsame und gef&uuml;hlvolle, ein wenig traurige
&quot;<B>Silence Of Your Head</B>&quot;, der seine Kraft gerade im Kehrreim entfaltet.
</P><P>
Mit &quot;<B>Rising Sun</B>&quot; und &quot;<B>Ashes</B>&quot; folgen zwei weitere eher ruhige, sanfte Songs
bis &quot;<B>Crown Of The Thorns</B>&quot; wieder einen kleinen Gegenpol setzt, mit h&ouml;herem
Tempo und kr&auml;ftigerer Instrumentierung. &quot;<B>Deliverance</B>&quot; ist dann wieder
langsamer, hat aber eine wunderbar markante Melodie, die mit der
&quot;schwereren&quot; Begleitung in Einklang steht.
</P><P>
&quot;<B>Still In Love With You</B>&quot;... na klingelt`s? Denn wenn man diesen Titel
h&ouml;rt, erkennt man ihn zuerst wirklich nicht wieder. Es handelt sich um
das sehr bekannte St&uuml;ck, das schon Michael Bolton tr&auml;llerte. Nur das
man diese Ballade, die ja sehr h&auml;ufig im Radio gespielt wurde, wegen
des heraustriefenden Schmalzes kaum noch h&ouml;ren konnte.
</P><P>
Hier jedoch erh&auml;lt der Titel eine v&ouml;llig neue Qualit&auml;t durch den Gesang
von Darren Wharton, der zeigt, welches Potential in der Vorlage liegt,
und das man f&uuml;r einen wirklich gef&uuml;hlvollen Vortrag keine unechten
&Uuml;bertreibungen ben&ouml;tigt! Das mir der Titel so gefallen k&ouml;nnte, h&auml;tte
ich vorher nicht angenommen!
</P><P>
Wie man erkennt, handelt es sich bei dieser CD also um eine vornehmlich
ruhige Melodic Rock-Scheibe, die mit einigen absoluten Glanzlichtern
aufwarten kann und durchweg h&ouml;renswerte Songs bietet.
</P><P>
&copy; &amp; (P) MTM Music 1998; ca. 30 DM



<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9809cd3.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9809film1.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
