<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - MMX: Ray of Light</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Ray of Light&quot; / Madonna</H1>von<BR><A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></DIV>
<P>Seit dem Erscheinen des aktuellen Madonna-Albums &quot;Ray of light&quot; sind
bereits einige Tage ins Land gegangen, die gro&szlig;e Revival-Welle hat sich
gelegt und die Songs geistern nicht mehr gar so h&auml;ufig durch das Programm
diverser Radiostationen. Zu solchen Zeiten kann es dann gerade gen&uuml;&szlig;lich
sein, sich das Objekt der allgemeinen Euphorie zur Hand zu nehmen und zu
Gem&uuml;te zu f&uuml;hren. Und genau das werde ich nun tun.
</P><P>
Das interessanteste, was mir seinerzeit an diesem Album auffiel, war -
neben einer angenehm ver&auml;nderten Erscheinung der K&uuml;nstlerin freilich -
vor allem der Name <B>William Orbit</B>, der zahlreich in den Credits der Songs
und des Albums auftaucht. Jener geh&ouml;rt zu den wohl eher unauff&auml;lligen und
daher auch unbekannteren Musikern unserer Tage, der allerdings in
zahlreichen Projekten seine Finger hat und auch selbst einige sch&ouml;ne
Trance- und Ambient-St&uuml;cke ver&ouml;ffentlichte.
</P><P>
Diese Konstellation einer gemeinsamen Produktion von ihm, diesem den
Mainstream eher meidenden Techno-Instrumentalisten, und der klassischen
Pop-Ikone schlechthin machte nat&uuml;rlich neugierig, obgleich mir &quot;<B>Frozen</B>&quot;
in jenen Tagen nat&uuml;rlich nahezu st&auml;ndig wohlig in den Ohren lag.
</P><P>
Was mir dann beim Durchh&ouml;ren der CD ins Geh&ouml;r rieselte, rechtfertigte
allen Rummel, der sp&auml;ter folgen sollte, wobei mir erlaubt sei,
vorwegnehmend anzumerken, da&szlig; der Titelhit &quot;Ray of light&quot; f&uuml;r meinen
Geschmack der schlechteste Track des Albums ist. Im ersten Moment fragte
man sich eben wirklich, ob das wirklich das &quot;Material Girl&quot; ist oder die
Urheberin des &quot;Erotica&quot;-Albums mit allen es umgebenden Klatsch und
Ger&uuml;chten. Was sich hier pr&auml;sentierte glich einem &Uuml;berholen ohne
einzuholen.
</P><P>
Madonnas letzte Ver&ouml;ffentlichungen schienen dem Zeitgeist immer mehr
nachzulaufen, aber hier war pl&ouml;tzlich wieder etwas innovatives, neues,
wirklich aktuelles, das sich dar&uuml;ber hinaus richtig gut anh&ouml;rt, hier
erhielt der alte Popstern Madonna pl&ouml;tzlich wieder neuen Glanz. Wieviel
Anteil daran William Orbit hat, bleibt nat&uuml;rlich ungekl&auml;rt, immerhin aber
hat er einigen Anteil an den Kompositionen des Albums und das ist auch
h&ouml;rbar.
</P><P>
&Uuml;ber die Songs im einzelnen will ich gar nicht so viele Worte verlieren,
Stil und Spektrum werden hinreichend durch die beiden oben erw&auml;hnten
Auskopplungen markiert. Frozen ist vermutlich der sanfteste Track und
w&auml;hrend &quot;<B>Ray of light</B>&quot; mit seiner Geschwindigkeit schon ein wenig aus
dem Album heraussticht, siedeln sich die anderen Titel zwischen diesen
beiden an, wobei sie unverwechslbar denselben Stil haben. Dies lie&szlig; mich
zun&auml;chst bef&uuml;rchten, da&szlig; die Scheibe mangels Abwechslung allzu schnell
ihren Reiz verlieren w&uuml;rde, doch weit gefehlt. Trotz dieser unleugbaren
&Auml;hnlichkeit der Titel klingt doch keiner wie der andere und man wird des
angenehmen Schwingen und Pl&auml;tscherns in den Ohren kaum &uuml;berdr&uuml;ssig.
</P><P>
Die Texte besch&auml;ftigen sich mit den &uuml;blichen Themen: Liebe, Freundschaft,
Lebensweisheiten, freilich aber auf eine der neuen Madonna w&uuml;rdige reife
Art und Weise.
</P><P>
Resumierend bleibt zu sagen, da&szlig; Madonna hier Anfang dieses Jahres eine
echte Bereicherung f&uuml;r den Pop-Markt abgeliefert hat, die ein breites
Spektrum an H&ouml;rern gefunden haben d&uuml;rfte und sicherlich in der Zukunft
eines der ber&uuml;hmteren Alben der S&auml;ngerin bleiben d&uuml;rfte, wenn es nicht
sowieso als der Wendepunkt in ihrer Schaffensperiode gehandelt wird.
</P><P>
Bei WOM ist im &uuml;brigen ein Remix-Kurzalbum zum Titel &quot;Frozen&quot; erh&auml;ltlich,
bei dem es sich um einen Japan-Import handelt. Die enthaltenen Mixe sind
wirklich abwechslungsreich und d&uuml;rften vor allem f&uuml;r Freunde von Dance
und House interessant sein.
</P>
&copy; 1998 Warner Bros. Records Inc.

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9809cd2.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9809cd4.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
