<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - MMX: Lola rennt</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Lola rennt</H1>von<BR><A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></DIV>

<P><B>Rennen</B> - eine Fortbewegungsart, die die Menschen mit zunehmendem Alter
immer mehr zu meiden scheinen. W&auml;hrend die ganz Kleinen unter uns offenbar
nichts lieber tun, als in wilder Hast durch die Gegend zu flitzen, fluchen
die Mittzwanzigj&auml;hrigen bereits, wenn sie mal dem Bus nachlaufen m&uuml;ssen.
Vom gesetzten Elternteil, der gleich nach den Autoschl&uuml;sseln fingert, wenn
es ums Zigarettenholen geht, soll hier gar nicht die Rede sein. Aber dies
soll ja sowieso weniger ein medizinisch-p&auml;dagogischer Appell an alle
Sportmuffel sein, als vielmehr ein Kommentar zu Tom Tykwers aktuellem
Kinohit.</P><P>

Diesem wurde ja auch mittels eines flotten Soundtracks, der auch vorab
als Single &quot;Wish&quot; erschien, und einigem &uuml;brigen Medienrummel zu einem
gl&uuml;cklichen Start verholfen, wobei gerade dies aber f&uuml;r den Film selbst
zum Problem wird.
</P><P>
Dieser lebt n&auml;mlich von seinen &uuml;berraschenden Wendungen und Spielereien
und wenn da jeder schon vorher wei&szlig;, da&szlig; dieselbe Story dreimal erz&auml;hlt
wird und mit Zeichentrick- und anderen Elementen gearbeitet wurde, dann
kann dies beim Zuschauer freilich kaum noch gro&szlig;e Wirkung zeigen. Wir
verpassen also den Kritikern, Moderatoren und sonstigen Beteiligten
einen kleinen Gonzo und widmen uns wieder dem Streifen selbst.
</P><P>
Dieser beginnt recht furios mit einem schon sehr eigenwilligen Vorspann
und verbei&szlig;t sich dann f&uuml;r ein paar Minuten in einem etwas
gew&ouml;hnungsbed&uuml;rftig gespielten Telefongespr&auml;ch zwischen Manni (Moritz
Bleibtreu) und Lola (Franka Potente). Ist dies jedoch erst einmal
beendet, gehts endlich richtig los:
</P><P>
                             <B>*Lola rennt!*</B>
</P><P>
Da&szlig; sie 100.000 DM in 20 Minuten auftreiben soll, ist ja auch bereits
in aller Munde.
</P><P>
Mehr erlaubt der Film allerdings auch gar nicht preiszugeben und so
verlassen wir das detaillierte Geschehen und versuchen uns ein wenig
im um den Brei herumreden.
</P><P>
Was Tykwers Werklein - das gute St&uuml;ck hat sich nach etwa 70 Minuten
ausgehechelt - interessant macht, ist die Geschwindigkeit. Die rennende
Lola ist so etwas wie der Rote Faden etlicher kleiner Miniaturstories,
die durch die von uns betrachtete ebenso kleine Geschichte in einen
Zusammenhang gesetzt werden. Das Sch&ouml;ne daran ist, da&szlig; Tykwer um die
M&auml;ngel seines Stoffes wei&szlig; und daher nicht ihn zum Thema macht, sondern
vielmehr seinen Film selbst. Tykwer scheut sich nicht, mit den Mitteln,
die ihm das Kino zur Verf&uuml;gung stellt, zu experimentieren, wobei einige
seiner Spielereien nat&uuml;rlich auch schon in anderen Filmen f&uuml;r Abwechslung
und verbl&uuml;ffte Gesichter sorgten. Somit wirkt &quot;Lola rennt&quot; nicht
gro&szlig;artig anders, als ein experimenteller Gro&szlig;bild-Videoclip.
</P><P>
Das Konzept geht auf. W&auml;hrend die Augen des Zuschauers sich im h&auml;ufigen
Szenenwechsel damit besch&auml;ftigen, die laufende Lola nicht aus dem Blick
zu verlieren, verleiht der einfache aber schwungvolle Soundtrack den
Gedanken den richtigen Rhythmus und es entsteht eine Art entspannte
Spannung, kein wirkliches Mitfiebern, sondern eher eine wohlige Neugier,
die gerade f&uuml;r siebzig Minuten Aufmerksamkeit ausreicht.
</P><P>
&quot;Lola rennt&quot; ist ein mit witzigen Ideen angereicherter, schwungvoller
Kino-Clip, der ein nettes Abendst&uuml;ndchen bescheren kann, jedoch unter
dem &uuml;berm&auml;&szlig;igen Medienrummel leidet, der ihn begleitet und der vielleicht
auch etwas &uuml;bertrieben ist.
</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9809fil2.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../amz0998/uhl.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
