<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - MMX: Dark City</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Dark City</H1>von<BR><A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></DIV>
<P><B>Es nimmt einfach kein Ende</B>. Seitdem E.T. seinen Freunden verklickert
hat, da&szlig; die Bewohner des Planeten Erde im Grunde sehr viel Angst vor
nicht auf ihrem Heimatplaneten geborenem Leben haben, kommen jene in
Scharen, um ein wenig mit uns herumzustenkern.
</P><P>
Na gut, das mag vielleicht ein wenig an den Haaren herbeigezogen sein,
jedoch frage ich mich, wann ich das letzte mal einen Au&szlig;erirdischen auf
unseren Leinw&auml;nden bewundern durfte, der nicht Angst und Schrecken
verbreitet h&auml;tte. Und ich mu&szlig; gestehen: Ich kann mich nicht erinnern.
</P><P>
Und damit sind wir auch schon mittendrin, in &quot;Dark City&quot;, dem dunklen
<B>SciFi-Abenteuer</B> aus der Hand des &quot;The Crow&quot;-Regisseurs Alex Proyas.
Ja, dunkel ist es allemal, denn irgendwer hat das Tageslicht ausgeknipst.
Wer das war, wird uns gleich zu Anfang verschwiegen, als uns Dr. Schreber
(Kiefer Sutherland oder in diesem Fall sein Synchron-Sprecher) mittels
einiger einleitender Worte, die er etwas arg verkrampft herunterstammelt,
sich selbst und die Situation in Dark City vorstellt. Wir erfahren
immerhin, da&szlig; es &quot;Fremde&quot; sind, die die Stadt und eben scheinbar nicht
nur diese kontrollieren.
</P><P>
Dieser spontane Informationsschub sollte jedoch nicht allzu schnell
verzehrt werden, denn im folgenden werden wir gezwungen, uns zun&auml;chst
in Enthaltung zu &uuml;ben. Szenen reihen sich aneinander, die zwar durch
wunderh&uuml;bsche Kamerafahrten, bescheidene Beleuchtung und matte Farben
eine herrlich finstere Stimmung h&auml;tten verbreiten k&ouml;nnen, dies jedoch
durch den Mangel an dichtem Inhalt nicht erreichen. Wir sehen Rufus
Sewell als John Murdock, der unschwer als der Held der Story erkennbar
ist, William Hurt als Inspektor Bumstead und einige andere mehr oder
minder storytragende Figuren, die allerdings zun&auml;chst noch gar nicht
oder nur in sehr d&uuml;nnem Zusammenhang zueinander stehen.
</P><P>
Sp&auml;ter soll sich die Geschichte noch verdichten, aber bis dahin wirkt
alles unn&ouml;tig gest&uuml;ckelt. Die Figuren bleiben zu lange farblos und
daher auf Distance. Zu ihnen geh&ouml;ren freilich auch die &quot;Fremden&quot; (oder
doch die Einheimischen?), die ihre physische Umwelt mit Hilfe des
blo&szlig;en Willens kontrollieren und ver&auml;ndern (&quot;tunen&quot;) k&ouml;nnen. Nat&uuml;rlich
sind diese vom Aussterben bedroht und vergreifen sich an den Menschen
nur, um ihre eigene Rasse zu erhalten. Soviel zur nicht ganz neuen,
aber durchaus ergiebigen Idee.
</P><P>
Die interessanten Aspekte, die sich in diesem Zusammenhang ergeben,
geraten allerdings wieder einmal ins Hintertreffen, werden erst gegen
Ende des Films er&ouml;ffnet und h&auml;tten doch gerade den ersten Teil so viel
interessanter machen k&ouml;nnen. So aber dient nur der Inhalt einiger
Manteltaschen unseres Helden als Wegweiser durch die fantasievolle Reise
in die Finsternis. Erst als er alle f&uuml;nf beteiligten Parteien und somit
auch alle F&auml;den der Geschichte zusammenf&uuml;hrt, wird die Sache dicht
genug, um Spannung aufkommen zu lassen.
</P><P>
Wir erleben einige Aha-Effekte, erfreuen uns an ein wenig eingeflochtener
Romantik und schwimmen so unaufhaltsam dem Showdown entgegen. Dieser endet
in einem ebenso vorhersehbaren wie effektgeladenen Duell zwischen Gut und
B&ouml;se, bei welchem letztere nat&uuml;rlich wie immer den k&uuml;rzeren Ziehen und
einem nahezu perfektionierten Happy-End.
</P><P>
Dark City ist zwar durchgehend dunkel, aber nicht d&uuml;ster. Die Finsternis,
die die Bilder in sich tragen, f&auml;llt durch die L&ouml;cher einer leider viel
zu gro&szlig;maschig gewebten Story durch und kann auch von der besseren
zweiten H&auml;lfte des Films nicht mehr aufgefangen werden. Ergo ist es
nicht verwunderlich, da&szlig; den Zuschauer Freude &uuml;berkommt, wenn der Held
sich am Ende imstande sieht, das Licht wieder anzuschalten.
</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9809cd4.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9809fil2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
