<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, konzert, hammerfall, virgin steele, freedom call">
<title>Konzertbericht: HammerFall & Virgin Steele & Freedom Call</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><h1><font color="yellow">HammerFall, Virgin Steele und Freedom Call</Font></center></h1></P>

<p>Eines der geilsten Packages, das man f&#252;r das noch junge neue Jahr in Sachen Melodic Power Metal / True Metal zusammengeschn&#252;rrt hatte, ging auf Tournee und gastierte auch in der Oberhausener Turbinenhalle am 22.1.01. Klar, da&#223; durfte man sich nun wirklich nicht entgehen lassen.</P>

<p>Den Opener machten die Melodic Power Metaller von Freedom Call, derren neues Album &quot;Crystal Empire&quot; justament an diesem Tag ver&#246;ffentlicht wurde. So war das Set folgerichtig eine Mischung aus alten St&#252;cken (&quot;We Are One&quot;, &quot;Hymn To The Brave&quot;) und neuen Kompositionen (&quot;Quest&quot;, &quot;Freedom Call&quot;, &quot;Rise Up&quot;), die das Publikum erstaunlich gut aufnahm und f&#252;r eine Vorband recht euphorisch abfeierte. Auch die Band selber (mit Gamma Ray Schlagzeuger Daniel Zimmermann, der zu Beginn des Sets eine kleine Feuerspuckeinlage bot), zeigte sich in sichtlicher Spiellaune und hat sich die guten Resonanzen redlich verdient. Daumen hoch!</P>

<p>Als n&#228;chstes folgte die Band, auf die ich mich pers&#246;nlich an diesem Abend am meisten gefreut hatte: Virgin Steele! Die Band, die sowohl mit einem neuen Bassisten als auch einem neuen Drummer aufwartete, um das geniale Duo David DeFeis und Edward Pursino er&#246;ffnete ihren Set mit dem Invictus Track &quot;In
victus&quot; (und dem passendem Intro) und lieferten eine astreine Performance ab, die mich ziemlich beeindruckte. Leider war die Spielzeit von knapp 60 Minuten viel zu kurz f&#252;r so eine Killerband bemessen und reichte nichtmal ansatzweise aus, um s&#228;mtliche Highlight`s der Bandgeschichte abzudecken. So mussten sich die Fans mit einem Querschnitt, der u.a. &quot;The Wine Of Violence&quot;, &quot;Token Of My Hatred&quot;, &quot;The Burning Of Rome&quot;, &quot;Emalith&quot; (in einer megageilen Accustic Version!!), &quot;Noble Savage&quot; und &quot;Great Sword Of Flame&quot; enthielt, begn&#252;gen. Auch Virgin Steele boten eine tighte Performance, wobei erwartungsgem&#228;&#223; David DeFeis am meisten f&#252;r die Stimmung im Publikum tat - selbiger war an diesem Abend &#252;brigens nicht nur f&#252;r die 
Vocals sondern auch f&#252;r die Keyboards verantwortlich. Highlight der Virgin Steele Show war meiner Anischt nach der Moment, in dem David DeFeis mit einem brennendem Schwert (!) auf die B&#252;hne zur&#252;ckkehrte und danach &quot;Great Sword Of Flame&quot; zum besten gegeben wurde. Alles in allem ein geiler, aber viel zu kurzer Gig der Ami`s. By the gods!</P>

<p>Tja, und dann war HammerFall Time - man merkte sofort, da&#223; ein Gro&#223;teil des Publikums nur gekommen war, um die schwedischen Chartst&#252;rmer live erleben zu k&#246;nnen; darunter &#252;brigens erstaunlich viele weibliche Fans. HammerFall nutzten die recht kleine B&#252;hne konsequent aus, indem sie in die Mitte eine Burg (!) mit Zugbr&#252;cke (!!) bauten, die beim Opener &quot;The Templars Of Steel&quot; runtergeklappt wurde und den Blick auf das Drumkit freigab. Vorher marschierte noch der HammerFall Warrior auf die B&#252;hne und z&#252;ndete diverse Fakkeln der Burg an. Auch HammerFall pr&#228;sentierten sich bestens gelaunt, wenngleich S&#228;nger Joacim Cans an diesem Abend aus gesundheitlichen Gr&#252;nden etwas k&#252;rzer treten musste. Allerdings muss ich sagen, da&#223; mir die Midtemponummer &quot;The
Templars Of Steel&quot; als Opener &#252;berhaupt nicht passte - eine Speednummer der Marke &quot;Keep the Flame burning&quot; (die leider &#252;berhaupt nicht im Set auftauchte) h&#228;tte da wesentlich mehr Sinn gemacht. Anyway, optisch hatte die Band einige Spielereien mitgebracht und z&#252;ndete erstmal ordentlich Pyros. Im weiteren Verlauf des Sets (Tracklist siehe unten) lie&#223; der HammerFall Frontmann dann mittels eines an seinem Handgelenks befestigtem Pyro Bausatz die Funken spr&#252;hen und am Ende wurde noch etwas Glanzpapier in die Menge gesch&#252;ttet. Der Set von HammerFall war ebenfalls recht kurzweilig, enthielt aber weder die beiden st&#228;rksten St&#252;cke vom neuen Album (&quot;Keep The Flame Burning&quot;, &quot;Living In Victory&quot;) noch den Legacy Of Kings Nackenbrecher &quot;Dreamland&quot; und konte mich nicht 100%ig zufriedenstellen. Anyway, die Band war hochmotiviert und scherzte bisweilen auch mit einem Lautst&#228;rkemeter herum - auch Macho Spr&#252;che der Marke Manowar haben HammerFall mitlerweile auf Lager, was aber eher peinlich wirkte. Insgesamt also ein trotz kleiner M&#228;ngel gutes Set, welches mit dem Instrumental &quot;Raise The Hammer&quot; allerdings auch einen Ausfall enthielt. Entsch&#228;digt wurde man daf&#252;r durch das zwar recht kurze, aber eindrucksvolle Drumsolo im Vorfeld des Instrumentals, bei dem sogar zwei Becken angez&#252;ndet wurden - sah wirklich m&#228;chtig cool aus. Insgesamt also eine gelungene HammerFall Show, die trotz des (aus meiner Sicht) nicht ganz so starken &quot;Renegade&quot; Albums ein Erfolg war.</P>

<p><u>Setlist HammerFall (zur Abwechselung mal mit der richtigen Reihenfolge):</U></P>

<p>1. Intro<BR>
2. Templars Of Steel (Pyro)<BR>
3. The Metal Age (Pyro)<BR>
4. Stronger Than All<BR>
5. A Legend Reborn<BR>
6. Steel Meets Steel<BR>
7. At The End Of The Rainbow<BR>
8. Let The Hammer Fall (Pyro)<BR>
9. The Dragon Lies Bleeding<BR>
10. Drumsolo<BR>
11. Raise The Hammer<BR>
12. Glory To The Brave<BR>
13. The Way Of The Warrior<BR>
14. Legacy Of Kings<BR>
15. Renegade<BR>
16. Heeding The Call<BR>
17. HammerFall (Pyro)</P>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
