<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Neuigkeiten von Airsoft Softwair

Airsoft Softwair (http://www.airsoftsoftwair.de) informiert:


»Rainboot4 befindet sich momentan in Entwicklung. War Rainboot in 
vorherigen Version nur ein Programm, um atemberaubende Shows w&auml;hrend des 
Bootvorgangs anzuzeigen, hat es mit der Version 4 nun den Weg zum 
Multimedia-Authoring-System geschafft, d.h. es ist nun eine 
Programmiersprache die es erm&ouml;glicht, auf einfachste Art und Weise mittels 
einer Skriptsprache Multimedia Anwendungen zu erstellen. Der Benutzer 
bekommt von Rainboot4 viele Funktionen zur Verf&uuml;gung gestellt, damit er 
sich nicht um Nebens&auml;chlichkeiten k&uuml;mmern muss. Der Benutzer muss sich z.B. 
keine Gedanken machen, ob sein Programm &uuml;berall l&auml;uft, denn Rainboot4 passt 
das Programm immer an, egal ob der Picasso96, Cgfx, AGA oder ECS benutzt 
wird. Hier ist eine kleine &Uuml;bersicht, was jetzt schon m&ouml;glich ist:

-100% systemfreundlich! L&auml;uft auf allen Amiga-Systemen!
-Anwendung l&auml;uft im Fenster oder auf eigenem Bildschirm
-Transparente Fenster auf der Workbench (siehe Screenshot)
-&Uuml;berblendeffekte
-Funktionen zum fl&uuml;ssigen Bewegen (scrollen) von Grafiken
-Transparente Grafiken
-Compiler und Linker f&uuml;r die Erstellung von Programmen als Executable
-Einfache Abfrage von Usereingaben (Tastatur, Maus)
-DOS Funktionen
-String Funktionen
-Mathematische Funktionen
-Variablen und Arrays
-Anwendungen laufen unabh&auml;ngig von Bildschirmmodus
-Kompatibilit&auml;t mit fr&uuml;heren Rainboot-Versionen
-Verschiedene Schriften k&ouml;nnen verwendet werden
-Unterst&uuml;tzung von IFF-Animpinseln
-Unterst&uuml;tzung f&uuml;r verschiedene Soundmodulformate und Samples
-Bedingungen (if, else, elseif, endif)
-Schleifen (for, next, while, wend)
-System-Funktionen
-kann immer noch w&auml;hrend dem Bootvorgang eingesetzt werden
-MorphOS und AmigaOS4 Versionen geplant
-und viel mehr!

Das interessante dabei ist, dass Rainboot4 die ganze Arbeit &uuml;bernimmt.
Folgendes Skript &ouml;ffnet z.B. ein Fenster mit der Datei MeinBild.iff als 
Hintergrund und schreibt "Hello World" zentriert in das Fenster:

%BGPIC1=MeinBild.iff

%CODE
%Locate(CENTER,CENTER)
%PrintStr("Hello World")
%WaitLeftMouse
%Quit

Diese Einfachheit &uuml;bertr&auml;gt sich auf alle Bereiche von Rainboot4. Und dabei
ist Rainboot4 v&ouml;llig systemfreundlich. Alle Operationen werden &uuml;ber das
Betriebssystem ausgef&uuml;hrt bzw. &uuml;ber das RTG-Betriebssystem falls vorhanden.
Nie war es einfacher intuitive Programme zu schreiben mit sehr geringem
Zeitaufwand und trotzdem maximaler Effektivit&auml;t und User-Freundlichkeit!

Screenshots zu Rainboot4 gibt es auf der Airsoft Softwair
Homepage www.airsoftsoftwair.de«


»Auf der Airsoft Softwair Homepage www.airsoftsoftwair.de wurde soeben 
Version 1.6 vom CD32 & CDTV Emulator Akiko (f&uuml;r Windows) ver&ouml;ffentlicht. 
Die neue Version unterst&uuml;tzt nun mehr Spiele und bietet noch bessere 
Kompatibilit&auml;t. Au&szlig;erdem wird nun ein umfangreiches Cover-Archiv angeboten, 
welches die Cover f&uuml;r &uuml;ber 160 CD32 Spiele beinhaltet (selbstverst&auml;ndlich 
passend aufbereitet f&uuml;r die Akiko Oberfl&auml;che). Ab sofort stehen deshalb 
zwei verschiedene Versionen von Akiko zum Download bereit: Eine Version mit 
allen Covers (8 Megabyte) und eine ohne Covers (1.5 Megabyte). Akiko 1.6 
kann ab sofort von dieser Homepage heruntergeladen werden.  Bitte schaut 
auch nochmal in die Dokumentation, denn ich suche noch einige CD32-Spiele 
zum Kaufen sowie einige CDTV-Spiele f&uuml;r Akiko, damit er alle unterst&uuml;tzt.«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
