<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. Neuigkeiten von IOSPIRIT

IOSPIRIT (http://www.iospirit.de) informiert:


»13.07.2002
Webinterface f&uuml;r Mailinglisten auf iospirit.de

Als Teil unseres Services bieten wir Ihnen kostenlose Mailinglisten an. Mit 
dem Abonnement einer Mailingliste k&ouml;nnen Sie sich mit anderen Anwendern 
austauschen, die neuesten Tipps und Tricks diskutieren oder stets die 
aktuellen News empfangen. 
Ab sofort stellen wir Ihnen nun auch ein Webinterface zur Verf&uuml;gung, mit 
dem Sie die bisherigen Eintr&auml;ge einer Mailingliste komfortabel &uuml;ber Ihren 
Browser einsehen k&ouml;nnen. 

Sie erreichen das Webinterface zu der jeweiligen Mailingliste &uuml;ber einen 
Klick auf den Namen der Mailingliste in der &Uuml;bersicht (unter "Service" in 
der linken Navigationsleiste).«


»18.07.2002
Ab sofort auch Online-Registrierung m&ouml;glich

Wenn Sie nach dem 10.4.2002 ein Produkt direkt von uns gekauft haben (egal 
ob Download- oder Paketversion), wurden Sie bereits automatisch 
registriert. 
Beim Kauf eines unserer Produkte &uuml;ber einen H&auml;ndler hingegen mu&szlig;ten Sie 
bisher eine Registrierkarte oder ein Formular einschicken. 

Da wir stets darum bem&uuml;ht sind, unseren Service f&uuml;r Sie zu verbessern und 
zu vereinfachen, besteht f&uuml;r Sie ab sofort die M&ouml;glichkeit, Porto und Zeit 
zu sparen und unsere Produkte direkt online zu registrieren. 

Einen Link zur Online-Registrierung finden Sie in der linken Leiste unter 
"Service" oder direkt unter http://register.iospirit.de/.« 
 
 
»22.07.2002
fxSCAN 4.02 mit nativer x86-Unterst&uuml;tzung (Amithlon)

Als die erste gr&ouml;&szlig;ere Applikation unterst&uuml;tzt fxSCAN Amithlon mit x86-
nativen Versionen seiner CPU-Module. Damit l&auml;uft fxSCAN nun nativ auf 
680x0, PPC (WarpUP, PowerUP, MorphOS) und x86 (Amithlon) mit voller 
Geschwindigkeit. Die Umsetzung der OCR-Engine und des Servertasks (f&uuml;r 
jedes System einen) bringen erneut eine Erh&ouml;hung der Geschwindigkeit auf 
mindestens das Zweifache der emulierten 68K-CPU. 
Unter "Downloads" steht ein kostenloser Patch von Version 4.0/4.01 auf 4.02 
zum Herunterladen bereit. 

Alle &Auml;nderungen seit V4.01 im &Uuml;berblick: 

* direkte Unterst&uuml;tzung von TurboPrint (nicht mehr nur &uuml;ber 
  GraphicsPublisher), auch beim Kopieren. Teils starker 
  Geschwindigkeitszuwachs. 
* x86-native Versionen des Servertasks und der OCR-Engine f&uuml;r Amithlon. 
* bei JPEGs wird nun die DPI-Information mit abgespeichert 
* fxWARP3-System in Version 8 (neuer "fxWARP Memory Guard" zur Umgehung von 
  Bugs und Einschr&auml;nkungen in WarpUP) 
* das Standardtool in den abgespeicherten NewIcons l&auml;sst sich nun mit einem 
  Tooltype PICTURETOOL &auml;ndern«


»
IOSPIRIT Felix Schwarz
Am Gr&uuml;ndla 3
D-91074 Herzogenaurach
Germany

EMail: info@iospirit.de
WWW:   http://www.iospirit.de/
Phone: +(0)049 (0)9132/732844
Fax:   +(0)049 (0)9132/732843«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
