<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
AMIGA-aktuell-Forum
-------------------

In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken "Leserbriefe", "Kleinanzeigen", und "Problemecke"
zusammengefasst.

Wenn ihr einen Beitrag habt, schreibt bitte an:

        Carsten Schr&ouml;der
        Helmoltstra&szlig;e 10
        37081 G&ouml;ttingen

E-Mail: aakt@gmx.de


1. Die Frage des Monats - wir m&ouml;chten eure Meinung erfahren

Jeden Monat stellen wir euch in dieser Rubrik eine Amiga-bezogene Frage
oder machen eine provokante Bemerkung (die &uuml;brigens nicht unbedingt unsere
Meinung wiedergeben muss), in der Hoffnung, dass ihr euch m&ouml;glichst
zahlreich mit Kommentaren zu Wort meldet. Wir werden eure Beitr&auml;ge in der
jeweils folgenden Ausgabe ver&ouml;ffentlichen. Schickt sie an aakt@gmx.de


Die Frage des letzten Monats lautete:

»Sollten nach einem Erscheinen von AmigaOS 4 und MorphOS die 
Softwareentwickler ihre Programme in dem jeweiligen nativen PPC-Code der 
beiden Betriebssysteme schreiben oder, um die Softwarekompatibilit&auml;t 
untereinander und auch mit AmigaOS3.x-Rechnern (also beispielsweise 
Amithlon) zu gew&auml;hrleisten, 68k-Code verwenden?«


Achim Stegemann schreibt:

»F&uuml;r die diesmalige Frage des Monats m&ouml;chte ich als Programmentwickler
antworten:

F&uuml;r mich steht f&uuml;r ein Programm erst einmal die Lauff&auml;higkeit unter OS 3.9 
(68k und PPC/WarpOS) im Vordergrund. Dies sichert mir auf jeden Fall eine 
Kompatibilit&auml;t zu Amithlon, QNX-AmigaXL, WinUAE und eventuell auch AmigaOS
4.0.
Ich selbst programmiere ausschlie&szlig;lich mit StormC V3, so dass die
genannten Kompatibilit&auml;ten erf&uuml;llt sind.

F&uuml;r MorphOS zu schreiben, lehne ich ab. Dies hat mehrere Gr&uuml;nde:

* Ich bekomme MorphOS mit meinem A4000T (CyberstormPPC) nicht zum Laufen 
  (lief fr&uuml;her mal auf einem A4000D).
* Nur der GCC- bzw. der vbcc-Compiler sind momentan in der Lage, MorphOS-
  Code zu erzeugen. Ich lehne aber beide Compiler f&uuml;r mich ab, da ich mich 
  nicht mit den Eigenarten eines jeden Compilers herumschlagen will. Das 
  macht die Programmierung nur komplizierter.
* Es gibt keine Garantie daf&uuml;r, dass MorphOS jemals legalen Status erhalten
  wird (siehe Streitigkeiten von AMIGA, Inc. vs. MorphOS/bplan).
* MorphOS ist in der momentanen Betaversion zu instabil, zu fehlerhaft und
  zu sehr limitiert, um damit ernsthafte gro&szlig;e Projekte durchzuziehen, die 
  vom OS alles abverlangen.

Gerade im Hinblick auf die enorme Leistungsf&auml;higkeit von Amithlon ist es 
gerade jetzt wieder interessant geworden, auch 68k-Code bei ehemals 
langsamen Programmen zu kompilieren. Ich selbst musste fasziniert und
zugleich schockiert mit ansehen, wie auf einem 1,6-GHz-Athlon 68k-Programme
unter Amithlon doppelt so schnell liefen wie das PPC-Pendant auf einem
A4000 mit CyberstormPPC!

Ich selbst gebe den AmigaOne- und Pegasos-Boards nur eine geringe 
Verkaufschance. Wenn Amithlon unter der bald zu erwartenden Version 2 seine 
Kompatibilit&auml;t und Geschwindigkeit noch einmal steigern kann, so wird es zu 
einer ernsthaften Konkurrenz zu den neuen Boards. Da kann dann auch ein OS 
4 nicht weiterhelfen. Denn es besteht hier schnell die Gefahr, dass selbst 
ein G3-Prozessor irgendwann von einem PC mit entsprechender Taktrate 
abgeh&auml;ngt wird. Und der Preis von Amithlon im Vergleich zu AmigaOne/Pegasos 
spricht f&uuml;r sich.
OS 4 hat nur eine Chance, wenn es wirklich ECHTE Neuerungen zum OS 3.9 
bringt und nicht nur ein optisch aufgep&auml;ppeltes PPC-natives OS 3.9 ist.

Fazit: Ich selbst werde weiter auf der Schiene OS 3.9 mit 68k/PPC fahren. 
OS4-Code wird es f&uuml;r mich nur geben, wenn ich mir daf&uuml;r keinen neuen 
Compiler kaufen muss. MorphOS-Code kommt f&uuml;r mich nicht in Frage.«


Thorsten Mampel favorisiert PPC-Code: 

»Warum sollte ich mir einen PPC-Rechner kaufen, wenn dieser nur mit 
angezogener Handbremse Programme &uuml;ber einen Emulator ablaufen l&auml;sst. Gerade 
Programme, bei denen Geschwindigkeit wichtig ist (Videoplayer, MP3-
Konverter, Spiele), m&uuml;ssen nativ laufen.

Kleinere Tools, bei denen die Geschwindigkeit nicht so wichtig ist, k&ouml;nnen 
ja weiterhin in 68K-Code geschrieben werden.

Denkbar w&auml;ren auch verschiedene Version f&uuml;r alle Prozessoren, damit eine 
m&ouml;glichst gro&szlig;e Anwenderzahl erreicht wird. Amithlon darf hier aber nicht 
bevorzugt werden. Es ist ein Emulator und nichts weiter. Es ist o.k., um 
noch einzelne Anwender bei der Stange zu halten. Ich pers&ouml;nlich werde nach 
den vorliegenden Informationen auf OS 4 setzen und w&uuml;nsche mir daher zuerst 
hierf&uuml;r Programme.«


Wolfgang Bonk pl&auml;diert f&uuml;r die 68k-Kompatibilit&auml;t:

»Nach dem Erscheinen von AmigaOS 4 w&uuml;rde ich es begr&uuml;&szlig;en, wenn die 
Softwarekompatibilit&auml;t gewahrt w&uuml;rde und besonders der 68k-Programmcode bei 
der Entwicklung von neuen Programmen zur Anwendung k&auml;me.
Sollte dies nicht geschehen, k&ouml;nnen viele Besitzer des A4000-68060/50 mit 
OS 3.9 diesen einmotten und als Museumsst&uuml;ck f&uuml;r die Nachwelt aufheben.
Wahrscheinlich hat sowieso jeder zweite Amiga-Benutzer bereits einen PC 
neben der Amiga stehen oder ist komplett umgestiegen.«


Walter J&auml;ckel ist anderer Meinung:

»Wenn es nach mir ginge, w&uuml;rde nur AmigaOS 4.0 auf den Markt kommen und 
dann nat&uuml;rlich nur Software auf PPC- und AmigaOS4.0-Basis programmiert 
werden!
MorphOS braucht sowieso keiner, und der 680x0er hat schon l&auml;ngst das 
Rentenalter erreicht. Wir m&uuml;ssen auch etwas mit der Zeit gehen, das hei&szlig;t: 
Alle Spiele und Programme sollten auf dem PPC laufen, wer jetzt noch 
Programme f&uuml;r den 680x0er haben will, der will wohl auch noch in einer 
H&ouml;hle wohnen!«


Wolf Zimmer zieht einen Vergleich zwischen Amiga und VW K&auml;fer:

»Es ist doch wirklich nicht mehr wegzudiskutieren, dass der Amiga-Markt
wirklich ein winziger Nischenmarkt geworden ist. Und das auch nur, weil ein
paar "verr&uuml;ckte" Enthusiasten (so wie ich) am ach so geliebten Amiga
festhalten. Um diesen winzigen Bereich nicht noch weiter zu st&uuml;ckeln, ist
es doch nicht Aufgabe von Softwareentwicklern ein "Sicherungsband" zu
weben, sondern hier sollten sich schon die Hardwareentwickler
zusammensetzen, sich absprechen und an einem Strang ziehen.

An der Entwicklung ist auch der User nicht ganz von Schuld freizusprechen.
Wenn ein Besitzer eines VW-K&auml;fers sich modern im Verkehr bewegen will, hat
er sich auch ein zeitgem&auml;&szlig;es Modell des Golfs oder eine Nummer gr&ouml;&szlig;er 
zugelegt. Aber wenn er in seinem K&auml;fer sitzt, tr&auml;umt er vielleicht 
manchmal, dass sein K&auml;fer auch ein Herby sein m&ouml;ge, damit er fliegen, sich 
mit ihm unterhalten oder ansonsten gewaltig auffallen kann. Wenn die Ampel 
aber auf Gr&uuml;n schaltet, legt er den ersten Gang ein und f&auml;hrt ganz normal 
los und pflegt seine 34 PS. Ihm w&uuml;rde aber nie im Traum einfallen, einen 
Beatle zu kaufen, um das K&auml;ferfeeling zu behalten, aber mit Intensit&auml;t 
einen Boxermotor verlangen, damit der Beetle auch K&auml;fer bleibt. Das sollten 
sich die Amiga-Besitzer hinter die Ohren schreiben, wenn sie nach moderner
Technik verlangen.«


J&uuml;rgen Sperling ist sich nicht sicher, welches der vielversprechendste Weg 
ist:

»Sobald ein neues Programm nur f&uuml;r ein Betriebssystem (AmigaOS 3.x, AmigaOS 
4 oder MorphOS) entwickelt wird, ist die Spaltung da.
Also f&uuml;r das alte Betriebssystem (OS 3.x) entwickeln? Das ist auch nicht 
die L&ouml;sung.
Doch was ist die L&ouml;sung? Ich wei&szlig; es auch nicht. Ich programmiere (leider) 
nicht, daher wei&szlig; ich auch nicht, ob es m&ouml;glich ist, ein Programm einmal zu 
schreiben und vielleicht f&uuml;r drei Betriebssysteme zu kompilieren. Aber wenn 
es das g&auml;be, w&auml;re ja auch die Frage des Monats &uuml;berfl&uuml;ssig.
Wenn aber die neuen Maschinen und damit ihre Betriebssysteme sehr schnell
sind, dann sollte alles in 68k-Programmcode geschrieben werden und damit
allen zug&auml;nglich sein.
Aber auch das wird niemandem so richtig gefallen, denn dann laufen die 
neuen nur mit Halbgas.
Das ist eine richtige Zwickm&uuml;hle!
Was ist nun zu tun? 
Entwickelt f&uuml;r das neue AmigaOS 4 und denkt an den Anwender mit dem 
Classic-Betriebssystem, denn ich glaube, das ergibt die gr&ouml;&szlig;te
Anwenderschaft.«


Nun zur aktuellen Frage des Monats:

»Was erwartest du dir von der Aachener Amiga-Messe im Dezember? Wirst du 
sie besuchen?«

Schickt eure Beitr&auml;ge bitte an aakt@gmx.de

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
