<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - Editorial</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER">Editorial</H1>
<BR>

<P>Und wieder sind drei Monate rum. Neues zu dieser, bzw. zur letzten
Ausgabe gibt es bei <A HREF="intern.htm">Interna</A>.</P>

<P>Im Gegensatz zu anderen Magazinen halten wir uns nicht an die neue
deutsche <B>Rechtschreibreform</B> (obwohl dazu die Meinung und Schreibung
des jeweiligen Autors respektiert wird).</P>

<P><B>Warum nicht?</B> Neben allen Querelen um ihre Einf&uuml;hrung, um die absolut
undemokratischen Prozedere, mit der sie einherging und der Frage, warum
dies nun pl&ouml;tzlich von &quot;oben&quot; beschlossen werden muﬂte, wo die deutsche
Sprache (auch und gerade die Schriftsprache) doch z.B. in den letzten
einhundert Jahren unzweifelhaft sehr starken Ver&auml;nderungen unterworfen
war, ohne daﬂ dies auf gr&ouml;ﬂeren Widerstand bei Bev&ouml;lkerung,
Schriftstellern oder anderen Gruppen gestoﬂen w&auml;re - neben diesen
Dingen geht die Frage ihrer Qualit&auml;t unter. Ist sie nicht vielleicht
doch wirklich sinnvoll, bringt sie groﬂe Erleichterungen?</P>

<P>Ich hatte mir aus einer Anzahl von Ver&ouml;ffentlichungen und wachen Auges
eine Meinung gebildet, bevor ich auf eine Webseite stieﬂ, die mich
best&auml;tigt hat und die in kompakter, kompetenter Form, die neuen
Regelungen vorstellt aber auch viele Beispiele f&uuml;r deren Unsinnigkeit
aufzeigt. Dazu will ich mich nicht weiter auslassen, aber informieren
sollten Sie sich zu diesem Thema, das uns fr&uuml;her oder sp&auml;ter alle
betrifft, ob computerbegeistert oder nicht!
(<A HREF="http://home.t-online.de/home/j.langhans/reform.htm">http://home.t-online.de/home/j.langhans/reform.htm</A>)</P>

<P>Trotzdem wollen wir eines nicht aus dem Blick verlieren: und das ist
der Amiga! ;) Die <A HREF="com98.htm">Computer 98</A> brachte ein paar Neuigkeiten: Im PPC-
Sektor bewegt sich doch noch etwas, denn ein Prototyp einer G3-
Beschleunigerkarte wurde vorgestellt, allerdings nicht von Phase5,
die die Messe nicht durch ihre Anwesenheit beehrten und sich weiterhin
vornehm zur&uuml;ckhalten, sondern durch die (als eigenst&auml;ngige Firma)
Neuen von Escena.</P>

<P>Von der Firma, die die Markenrechte des Amiga`s besitzt und die selber
auf die gleiche Bezeichnung h&ouml;rt, war, bis auf handsignierte Uhren,
mittelpr&auml;chtiger Dance-H&uuml;pfer und weitere Presseerkl&auml;rungen, nat&uuml;rlich
nicht viel zu erwarten.</P>

<P>Ein eigentlich ziemlich unbekanntes (bis jetzt u.a. PC-)Betriebssystem
der Firma <B>QNX</B>, die eher in anderen Bereichen ans&auml;ssig und auch durchaus
angesehen ist, soll jetzt der zuk&uuml;nftige OS-Kern werden. Na ja, bis da
etwas greifbares herauskommt... - und das ist sicherlich nicht lediglich
eine Ahnung.</P>

<P>Weitere Kleinigkeiten betreffen nat&uuml;rlich das Hickhack um <B>Amiga-OS 3.5</B>,
von dem auf Grund der Apathie und offensichtlichen Uninteressiertheit Amiga`s
schon wieder einige freie Entwickler abgesprungen sind, u.a. A.C.T, die
das neue Soundsystem programmieren wollten oder der Zeichner der
wirklich guten neuen Icons (GlowIcons -
<A HREF="http://reality.sgi.com/mchaput_aw/glowicons.html">http://reality.sgi.com/mchaput_aw/glowicons.html</A>), ein Angestellter
von Silicon Graphics, die nicht andauernd dem &quot;Auftraggeber&quot;
hinterherrennen und darum betteln wollten, doch etwas f&uuml;r Amiga
tun zu d&uuml;rfen. Fleece Moss, Projektchef bei Amiga, wurde zwar nicht
entlassen, aber sein Vertrag nicht verl&auml;ngert, was auf das selbe
hinauskommt.</P>

<P>Es g&auml;be also einiges zu bekritteln und man wird es schon fast etwas
&uuml;ber, denn es erscheint einem gelegentlich beinahe nutzlos, aber daf&uuml;r
haben wir ja auch die <A HREF="iv.htm">Interviews</A> - und Oliver Kastl von Elaborate
Bytes, bekannt u.a. durch IDEfix, der aus der Sicht eines Entwicklers
Tacheles redet!</P>

<P><B>Novum</B> f&uuml;r den Amiga in dieser Form ist sicherlich auch die Meldung, daﬂ
massiv Paﬂw&ouml;rter und Zugangscodes von (u.a.) Amiga-Usern f&uuml;r das Internet
ausgesp&auml;ht und verbreitet wurden. Der Miami-Autor Holger Kruse ging in
die Offensive und informierte durch Presseerkl&auml;rungen &uuml;ber Ursachen und
Schutzm&ouml;glichkeiten. Vorsicht vor gewissen Datatype.libraries! Mehr dazu
bei <A HREF="news.htm">Am Puls</A>.</P>
<P>
Wie immer mit der Bitte um <A HREF="support.htm">Unterst&uuml;tzung</A> und Lesermeinungen verbleibt,</P>
<BR> <BR>
Ihr<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A><BR>
Chefredakteur<BR>

<DIV ALIGN="CENTER">...und unser <A HREF="danke.htm">DANK</A> geht an...<DIV ALIGN="CENTER">

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="main.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="news.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
