<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Amiga-Emulator-Paket AmigaOS XL offiziell angek&uuml;ndigt</H2>
<P>
Haage &amp; Partner hat Mitte September das in Entwicklung befindliche Amiga-
Emulator-Paket AmigaOS XL offiziell angek&uuml;ndigt. Die folgende Erl&auml;uterung
ist auf <A HREF="http://amigaxl.haage-partner.de" TARGET="_top">http://amigaxl.haage-partner.de</A> zu finden:
</P>
<P><B>&raquo;AmigaOS XL f&uuml;r x86</B></P>
<P><B>Der leistungsf&auml;higste Amiga aller Zeiten</B></P>
<P>
Glash&uuml;tten, den 10. September 2001: Die HAAGE&amp;PARTNER Computer GmbH
und Amiga Inc. pr&auml;sentieren den schnellsten Amiga(r) aller Zeiten.
</P>
<P>
Auf dem gezeigten Rechnersystem laufen g&auml;ngige Amiga-68k-Anwendungen
um den Faktor 10 - 20 mal schneller ab, als auf einem herk&ouml;mmlichen
68060-System. Diese enorme Geschwindigkeit wird durch die Verwendung
eines modifizierten und enorm beschleunigten 68k-Emulators erreicht.
</P>
<P>
Pr&auml;sentiert wird auf einem Standard PC mit 1,2 GHz Athlon Prozessor
und dem f&uuml;r einen PC in mittlerer Preisklasse &uuml;blichen Zubeh&ouml;r.
</P>
<P>
Die verwendete JIT-Technologie erm&ouml;glicht ungeahnte
Geschwindigkeitssteigerrungen von fast allen Programmen. Endlich
erh&auml;lt man so turboschnelle Versionen von PageStream, ImageFX,
ArtEffect, Cinema4D, Real3D und allen anderen Amiga Programmen.
Bekannte 68k Spiele wie Napalm, Earth2140 oder Foundation m&uuml;ssen
sogar teilweise gebremst werden da sie sonst zu schnell ablaufen.
</P>
<P>
Erstmals ist es nun m&ouml;glich, einen PC-Laptop mit einem AmigaOS
Betriebssystem zu installieren. Ein Fortschritt, den viele seit 16
Jahren erwarten.
</P>
<P>
Ein Ende weiterer Geschwindigkeitssteigerungen ist nicht abzusehen.
Fast monatlich &uuml;berbieten sich die Hersteller von Prozessoren und
Mainboards mit neuen Gigahertz- Sch&ouml;pfungen. Ein Wettrennen, von dem
nun auch der Amiga profitieren wird.
</P>
<P>
AmigaOS XL besteht aus zwei Emulatorsystemen: AMIthlon und AmigaXL for
QNX.
</P>
<P><B>AMIthlon - Der schnellste Amiga aller Zeiten</B></P>
<P>
CD-Rom einlegen, PC anschalten und schon bootet der schnellste Amiga
aller Zeiten. Kein kompliziertes und langatmiges Installieren. Die
Entwickler Harald Frank (VMC) und Bernd Meyer haben es sogar
geschafft, durch native Unterst&uuml;tzung von nVidia und Matrox
Grafikkarten das Maximum an Grafikleistung herauszuholen. Das &Ouml;ffnen
von Fenstern auf der Workbench oder das Anzeigen von Piktogrammen
geht so schnell, dass man es kaum mehr wahrnehmen kann.
</P>
<P>
Sogar Ihre alte Amiga-Festplatte kann im PC unter AMIthlon weiter
verwendet werden. Einfach umbauen, AMIthlon starten und fertig.
</P>
<P>
AmigaXL for QNX - Der funktionellste Amiga aller Zeiten
</P>
<P>
Das Host-System f&uuml;r AmigaXL ist QNX 6.1, das im Paket enthalten ist.
QNX hat viele &Auml;hnlichkeiten mit dem AmigaOS. Es besitzt einen
Microkernel und die Treiber sind separate Prozesse. Wie die Devices
und Handler beim AmigaOS k&ouml;nnen diese dynamisch gestartet und wieder
gestoppt werden. Dadurch ist das System sehr leichtgewichtig und
ressourcen-schonend
</P>
<P>
Die unter QNX zur Verf&uuml;gung gestellten Eigenschaften k&ouml;nnen direkt
unter AmigaOS genutzt werden. Dazu z&auml;hlen die
Netzwerkfunktionalit&auml;ten und Multimedia-Eigenschaften. QNX Programme
wie zum Beispiel der Web Browser Opera(r) k&ouml;nnen direkt vom AmigaOS aus
gestartet werden. Man kann sagen, dass beide Betriebssysteme sehr
harmonisch zusammenarbeiten.
</P>
<P><B>Systemvoraussetzungen:</B></P>
<P>
Athlon-, Duron, Pentium-, Celeron-CPU ab 500 MHz. AmigaOS XL
unterst&uuml;tzt die g&auml;ngigen Grafik-, Sound-, Modem- und Netzwerk-Karten.
Eine ausf&uuml;hrliche Liste ist auf unserer Homepage
amigaxl.haage-partner.de oder www.amithlon.com verf&uuml;gbar.
</P>
<P><B>Lieferumfang und Preise:</B></P>
<P>
AmigaOS XL wird komplett mit Kickstart-, AmigaOS 3.9-Lizenz, QNX 6.1
und dem Emulator-Paket auf einer CD-ROM geliefert. Der empfohlene
Verkaufspreis liegt bei 299,- DM inkl. gesetzlicher Mehrwertsteuer.
Ebenso werden verschiedene Komplettsysteme angeboten, auf denen
Amithlon und AmigaXL bereits vorinstalliert sind.
</P>
<P><B>Liefertermin:</B></P>
<P>
Die Auslieferung beginnt voraussichtlich in der Kalenderwoche 41.
Vorbestellungen werde gerne entgegen genommen.
</P>
<P><B>Vertrieb:</B></P>
<P>Amiga-Fachh&auml;ndler oder &uuml;ber unseren Online-Shop auf <A HREF="http://www.amiga-shop.de">www.amiga-shop.de</A></P>
<P><B>USA:</B> Amiga Inc., Software Hut</P>
<P><B>UK:</B> Virtual Programming, Eyetech, Blittersoft, Analogic, Power Computing</P>
<P><B>Italy:</B> Virtual Works</P>
<P><B>Stimmen</B></P>
<P>
Bereits der ersten Version wurden von Nutzern nur beste Qualit&auml;ten und
h&ouml;chste Performance bescheinigt.
</P>
<P>
&quot;We installed ImageFX on AmigaXL during a private meeting in St.Louis and
the speed was amazing. It was like having ImageFX completely native on a
fast PowerPC machine!!&quot; Kermit Woodall, Nova Design&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
