<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Forum</H1>
<P>
In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot;
zusammengefasst.
</P>
<P><B>Wenn Ihr einen Beitrag habt, schreibt bitte an:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Carsten Schr&ouml;der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Helmoltstra&szlig;e 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">37081 G&ouml;ttingen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>E-Mail: <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A></B></P>
<H2>1. Die Frage des Monats - wir m&ouml;chten eure Meinung erfahren</H2>
<P>
Jeden Monat stellen wir euch in dieser Rubrik eine Amiga-bezogene Frage
oder machen eine provokante Bemerkung (die &uuml;brigens nicht unbedingt unsere
Meinung wiedergeben muss), in der Hoffnung, dass ihr euch m&ouml;glichst
zahlreich mit Kommentaren zu Wort meldet. Wir werden eure Beitr&auml;ge in der
jeweils folgenden Ausgabe ver&ouml;ffentlichen. Schickt sie an <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A>
</P>
<P><B>Die Frage des letzten Monats lautete:</B></P>
<P>
&raquo;Wie beurteilst du - auch im Hinblick auf AMIGAs &quot;Amithlon&quot; - die
Ank&uuml;ndigung von Haage &amp; Partner, einen weiteren Amiga-Emulator, diesmal f&uuml;r
das Betriebssystem QNX, auf den Markt zu bringen?&laquo;
</P>
<P>
Thomas Nosutta schreibt dazu: &raquo;Ich halte weder Amithlon noch AmigaOS XL f&uuml;r
&quot;&uuml;berfl&uuml;ssig&quot;, sondern f&uuml;r n&ouml;tig, er&ouml;ffnen uns beide Emulatoren doch den
x86-Markt. Endlich wird der Traum eines Amiga-Laptops Wirklichkeit.
Die Angst vor Windows teile ich nicht da es ja dem Anwender obliegt ob er
Windows parallel nutzt oder nicht. Den Untergang des Amiga sehe ich auch
nicht, da &quot;wenn&quot; der AmigaOne und AmigaOS 4.0 erscheinen, das AmigaOS 3.9
eh &quot;outdated&quot; ist, also was verliert man? Wir k&ouml;nnen gar nichts verlieren,
eher gewinnen, n&auml;mlich x86-User, die das moderne AmigaOS sehen und evtl.
auf einen AmigaOne umsteigen.
</P>
<P>
Und sollte dieses nicht eintreten, &auml;ndert das auch kaum etwas an der
Situation, denn User w&uuml;rden wir verlieren ob mit oder ohne einem X86-Amiga-
Emulator.&laquo;
</P>
<P>
Andreas Steup meint &raquo;Ich wei&szlig;, es klingt etwas albern, aber meine Antwort
ist auch dieses Mal: Genauso &uuml;berfl&uuml;ssig wie Amithlon.&laquo;
</P>
<P>
Gernod Schomberg sieht es folgenderma&szlig;en: &raquo;Die Frage hat inzwischen einen
anderen Sinn bekommen. H&amp;P bietet ja den &quot;Amithlon&quot; und &quot;AmigaXL&quot; im
Doppelpack - &quot;AmigaOS XL&quot;! Also keine Konkurrenz zu AMIGA Inc. Das ist
zumindest beruhigend. Ich habe mir einen PC bestellt und m&ouml;chte darauf das
Amiga-Gef&uuml;hl erleben. Die UAE-CD habe ich schon hier liegen, ich denke, den
Doppelpack werde ich mir auch noch leisten. Dann hat Cloanto meinen Anteil
bekommen und von den Dreihundert Mark wird H&amp;P ja hoffentlich auch AMIGA
Inc. etwas abgeben.
</P>
<P>
Meine Beurteilung? Ich wundere mich nicht mehr &uuml;ber solche Entwicklungen
auf dem Amiga. Seitdem unser Rechner nur noch ein Schattendasein f&uuml;hrt,
werden, wenn die Zeit reif f&uuml;r etwas ist, immer die gleichen Dinge von
Mehreren gleichzeitig auf unterschiedlichen Wegen geschaffen. Bei dem
kleinen Markt h&auml;tte sicher ein Produkt, in das das Wissen der verschiedenen
Entwickler eingeflossen ist, die Chance auf h&ouml;here Verkaufsziffern, als die
Summe der Einzelentwicklungen (im aktuellen Falle vielleicht ein Emulator,
der AGA kann, aber auch von einer angeschlossenen Amiga-Festplatte lesen
kann). Aber darauf hattest du, Carsten, ja auch schon hingewiesen. Und
deshalb ist es direkt erfrischend, wenn zwar nicht das K&ouml;nnen der
Entwickler ein gemeinsames Produkt ergab, aber wenigstens die
Konkurrenzprodukte im gemeinsamen Paket vermarktet werden. ;-)&laquo;
</P>
<P>
Nun zur aktuellen Frage des Monats. Sie befasst sich wiederum mit der
Amiga-Zukunft:
</P>
<P>
&raquo;Hat deiner Meinung nach der PowerPC-Prozessor angesichts der j&uuml;ngsten
Entwicklungen im Amiga-Bereich noch eine Chance?&laquo;
</P>
<P><B>Schickt eure Beitr&auml;ge bitte an <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A></B></P>
<P ALIGN="RIGHT">
<A HREF="Forum.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Forum2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
