<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. AMIGA-aktuell-Wunschliste (von Christian Aichinger)</H2>
<P>
Oh je! Leider sind mir 50% aller eingegangenen Mails f&uuml;r die Wunschliste
abhanden gekommen :(. Das (noch) relativ Gute daran: Es war effektiv nur
eine Mail, die im Daten-Nirvana verschwunden ist, was weiterhin zum Schlu&szlig;
f&uuml;hrt, da&szlig; sich nur zwei Leser bei AMIGA aktuell gemeldet hatten. Ich bitte
doch denjenigen, der sich wegen der hier nicht ver&ouml;ffentlichten Mail
angesprochen f&uuml;hlen sollte ;) um nochmalige Zusendung an mich
(<A HREF="mailto:christian@aakt.de">christian@aakt.de</A>). F&uuml;r alle anderen Leser, die Vorschl&auml;ge f&uuml;r zuk&uuml;nftige
Artikel machen wollen, gilt dasselbe: E-Mail an mich oder Carsten Schr&ouml;der
(<A HREF="mailto:carsten@aakt.de">carsten@aakt.de</A>) und ab der n&auml;chsten Ausgabe steigen die Chancen einer
Ver&ouml;ffentlichung des Wunschartikels.
</P>
<P>
Eine E-Mail kam von Mathias Klingner betreffs des Euro-Problems unter
AmigaOS. Aber bitte lest selbst:
</P>
<P>
&raquo;Ich h&auml;tte da mal folgenden Vorschlag als n&auml;chstes aktuelles Thema:
Da bald der Euro auf uns alle zurollt w&auml;re es doch mal an der Zeit
dar&uuml;ber zu schreiben, wie es m&ouml;glich ist, das Euro-Zeichen auf die
Amiga-Tastatur zu bekommen. Ich habe da zwar mit FinalWriter 97 und dem
Makro &quot;FontCode&quot; die M&ouml;glichkeit durch Eingabe des Codes 128 das Euro-
Zeichen in den Text zu stellen, jedoch ist diese Methode auf Dauer etwas
umst&auml;ndlich. Geht es eventuell auch anders? TTF-Fonts mit Euro-Zeichen gibt
es ja dank der Windows-Rechner gen&uuml;gend, und die Einbindung dieser Schriften
auf dem Amiga funktioniert dank eines kleinen Programms (TTF-Manager,
oder so &auml;hnlich) hervorragend. Soviel dazu. [...]&laquo;
</P>
<P>
[Anm. d. Red.: Gemeint ist die Software &quot;ttflib&quot;, die im Aminet unter
&quot;util/libs/ttflib.lha&quot; kostenlos bezogen werden kann.]
</P>
<P>
Ich denke, die Idee dazu ist nicht schlecht. Vielleicht gibt es ja einen
Leser, der Zeit und Lust dazu hat, sich damit mal n&auml;her zu besch&auml;ftigen
(und nat&uuml;rlich seine Resultate in die Tastatur zu h&auml;mmern ;))? Sp&auml;testens
Ende dieses Jahres wird das &quot;Euro-Problem&quot; zumindest f&uuml;r Amiga-User zu
einem echten Problem. Tja, und wenn sich Amiga-User nicht um solche Dinge
k&uuml;mmern - die offiziellen &quot;VIPs&quot; in der Amiga-Szene scheinen sich in
letzter Zeit nur noch mit &ouml;ffentlichen Schlammschlachten besch&auml;ftigen zu
m&uuml;ssen - die haben f&uuml;r solche &quot;Kleinigkeiten&quot; leider keine Zeit.
</P>
<P>
So und jetzt zu der anderen Mail, die leider im &quot;NIL:&quot; verschwunden ist.
Wenn mich meine grauen Gehirnzellen gerade nicht im Stich lassen ging es um
einen C-Kurs. Nicht etwa um den X-ten Einsteigerkurs, sondern darum, wie
die g&auml;ngigsten Systemfunktionen (aus DOS, Intuition, Exec, Gadtools,
Utility, etc.) des AmigaOS angesprochen werden und was es da f&uuml;r nette
Strukturen und Objekte gibt. Ich f&auml;nde so einen Kurs &uuml;brigens selbst h&ouml;chst
interessant - vor allem im Hinblick auf die vielen neuen Funktionen, die
unter AmigaOS 3.5 und 3.9 dazugekommen sind. Also, alle Hobby- und/oder
Profi-C-Programmierer sollten sich hiermit aufgefordert f&uuml;hlen, unbedingt
einen umfassenden Amiga-C-Kurs f&uuml;r AMIGA aktuell zu schreiben ;).
</P>
<P><B>Hier noch einige &auml;ltere Leserw&uuml;nsche zur Erinnerung:</B></P>
<UL>
<LI> Sock5-Konfiguration unter Genesis
</LI>
<BR><LI> Vergleichstest EASys, Scalos, Directory Opus Magellan
</LI>
<BR><LI> Vernetzung z.B. ADSL mit Amiga, Vernetzung Amiga mit Mac, Amiga mit
  Linux, Amiga mit Windows, Amiga mit Amiga. Vernetzung und Konfiguration
  von Netzwerken ist eigentlich immer interessant ;).
</LI>
</UL>
<P><B>Christian Aichinger &lt;<A HREF="mailto:christian@aakt.de">christian@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Forum3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
