<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. &Uuml;berblick: &raquo;Payback 1.5&laquo; - mehr Spa&szlig; mit neuen Karten</H2>
<P>
 <A HREF="img/payback.jpg"><IMG SRC="thumb/payback.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Payback ist ja ein wirklich geniales Spiel. Aber irgendwann kommt man an
den Punkt, wo man alle Missionen durchgezockt hat. Aber selbst da bietet
Payback ja genug Abwechslung: es gibt einen Mehrspieler-Modus, in dem bis
zu vier Kontrahenten gegeneinander antreten k&ouml;nnen oder dasselbe auch f&uuml;r
eine Person, hier hei&szlig;t es Demolition-Mode. Es geht einzig darum, m&ouml;glichst
viel kaputt zu machen, bevor man von der Polizei geschnappt wird. Leider
gibt es nicht viele verschiedene Karten f&uuml;r diese beiden Modi. Aber es gibt
ja einen Editor und so sind mittlerweile einige neue Maps erschienen.
Diese findet ihr im Internet (<A HREF="http://www.apex-designs.net" TARGET="_top">http://www.apex-designs.net</A>) oder aber auch
auf der kommenden AmigaFuture-CD.
</P>
<P>
Einfach herunterladen, in den Ordner &quot;User Maps&quot; eurer Payback-Installation
entpacken und das Spiel starten. Wenn ihr nun den Mehrspieler- oder
Demolition-Modus startet stehen die neuen Karten zur Auswahl. Ich habe mir
die zus&auml;tzlichen Karten mal angeschaut und werde sie hier mal kurz
beschreiben. In Klammern stehen jeweils der Autor der Karte sowie das Datum
der angespielten Version.
</P>
<P><B>Amigalien´s Metropolis Day and Night! (Ricco Clemens, 27.07.2001)</B></P>
<P>
 <A HREF="img/Amigalien_Metropolis.png"><IMG SRC="thumb/Amigalien_Metropolis.jpg" WIDTH="96" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
 <A HREF="img/Amigalien_Metro_Night.png"><IMG SRC="thumb/Amigalien_Metro_Night.jpg" WIDTH="96" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Starten wir gleich mit meiner Lieblingskarte. Dies ist eine riesige Stadt
mit allem, was dazu geh&ouml;rt: kleine, enge Gassen, viele Stra&szlig;en und
vierspurige Autobahnen. Diese Karte ist bis auf eine Br&uuml;cke ebenerdig, aber
ansonsten perfekt. Man kann sich an vielen Stellen verstecken, was
gerade im Mehrspieler-Modus extrem Spa&szlig; macht. Es gibt einige geheime Orte,
wo man nicht allzu leicht hinkommt. Versucht mal sie zu finden. Die Waffen
sind gut verteilt. Aber der Clou: diese Karte liegt in zwei Versionen vor.
Als Tag- und (bisher als einzige Mehrspielerkarte!) als Nachtversion. Und
nachts macht die ganze Sache noch mal soviel Spa&szlig;.
</P>
<P><B>Beach City (Marvin Noble, 16.04.2001)</B></P>
<P>
 <A HREF="img/BeachCity.png"><IMG SRC="thumb/BeachCity.jpg" WIDTH="96" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Eine der ersten zus&auml;tzlichen Karten. Deshalb mache ich dem Autor keine
Vorw&uuml;rfe, da&szlig; es noch nicht allzuviel Abwechslung gibt. Gro&szlig;e Rasenfl&auml;chen
wechseln sich mit viel Sand ab. In der Mitte ein paar H&auml;user. Keine
Riesensache. Cool sind die versteckten Waffen (z.B. auf Hausd&auml;chern)
</P>
<P><B>Calum (Calum Millican, 04.05.2001)</B></P>
<P>
 <A HREF="img/Calum.png"><IMG SRC="thumb/Calum.jpg" WIDTH="96" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Klein aber Oho. Diese Karte ist von den Ausma&szlig;en her nicht gerade riesig.
Trotzdem garantiert sie stundenlangen Spielspa&szlig;, vor allem im
Mehrspieler-Modus. Es ist ziemlich eng in der Stadt, Verfolgungsjagden
erweisen sich als ziemlich schwer. Au&szlig;erdem gibt es viele versteckte
Winkel. Der Clou ist allerdings eine Rennstrecke auf der man sich zum
&quot;Death-Race&quot; verabreden kann. Hier gibt es einige Schikanen, wie ein
Wasserloch und eine Hubbelstrecke zu &uuml;berwinden. M&ouml;ge der bessere gewinnen.
</P>
<P><B>D-Town (Philipp B&ouml;decker, 27.07.2001)</B></P>
<P>
 <A HREF="img/D-Town.png"><IMG SRC="thumb/D-Town.jpg" WIDTH="96" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Eine sehr liebevoll gestaltete Karte. Diese Kleinstadt ist (fast) zu sch&ouml;n
um sie im Zerst&ouml;rungsmodus auseinanderzunehmen. Allerdings haben sich hier
und da ein paar Fehler eingeschlichen, welche den super Eindruck ein
bisschen tr&uuml;ben. Trotzdem mit unter den Top 3 meiner Lieblingskarten. Vor
allem wegen der Tatsache, da&szlig; sich die Stadt &uuml;ber verschiedene Eben
erstreckt und es superviel Fetz macht mit einem Auto den riesigen Berg
herunterzurasen.
</P>
<P><B>Fortress (Mathieu Lebrun, 04.05.2001)</B></P>
<P>
 <A HREF="img/Fortress.png"><IMG SRC="thumb/Fortress.jpg" WIDTH="96" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Zerst&ouml;rung braucht nicht viel Platz. In diesem Level gibt es keine Stra&szlig;en,
St&auml;dte und dergleichen. Eigentlich sind es zwei relativ kleine Orte, durch
eine lange Br&uuml;cke voneinander getrennt. Auf beiden Seiten der Br&uuml;cke kann
man sich mit Waffen versorgen und dann gegeneinander antreten. Cooles
Mehrspieler-Level, im Zerst&ouml;rungsmodus ist es extrem cool auf der langen
Br&uuml;cke Wagen abzudr&auml;ngen.
</P>
<P><B>Gettin´ High (Philipp B&ouml;decker, 21.03.2001)</B></P>
<P>
Die erste und kleinste Zusatzkarte. Der einzige Clou dieser Karte ist, da&szlig;
man auf die D&auml;cher mu&szlig; um an Waffen zu kommen. Nicht der Hit, im Gegensatz
zu all den anderen Karten, die es gibt.
</P>
<P><B>House Park (Mila Lesak, 20.08.2001)</B></P>
<P>
 <A HREF="img/House_Park.png"><IMG SRC="thumb/House_Park.jpg" WIDTH="96" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
WOW. Ein wahres Labyrinth an Stra&szlig;en. Mit Br&uuml;cken, Tunnels und allem was
dazugeh&ouml;rt. Hier kommen Raser auf ihre Kosten. Leider bietet die Stadt
wenig &Uuml;berraschungen und Platz zum Verstecken. F&uuml;r den Mehrspieler-Modus
gibt es also spannendere Karten.
</P>
<P><B>Hyrtola Offroad (Marko Roiha, 27.07.2001)</B></P>
<P>
 <A HREF="img/Hyrtola_Offroad.png"><IMG SRC="thumb/Hyrtola_Offroad.jpg" WIDTH="96" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Unbedingt antesten! Diese Karte ist wirklich ultracool. Und das, obwohl es
eigentlich keine Stadt ist. Es gibt ein paar H&auml;user und eine gro&szlig;e Stra&szlig;e.
Ansonsten ist alles gr&uuml;n. Aber gerade dieses riesige Au&szlig;engel&auml;nde macht
extrem Spa&szlig;. Es ist n&auml;mlich nicht eben, sondern schr&auml;g und mit den vielen
verteilten Erdh&uuml;geln als Sprungschanzen eignet es sich geradezu f&uuml;r eine
Mehrspieler-Verfolgungsjagd der Extraklasse. Aber auch der
Zerst&ouml;rungsmodus hat es in sich, den selbst wenn man die Aggressivit&auml;t der
Polizei auf sehr gering stellt haben es die Burschen in sich.
</P>
<P><B>Little Chicago (Roger Monkman, 03.07.2001)</B></P>
<P>
 <A HREF="img/Little_Chicago.png"><IMG SRC="thumb/Little_Chicago.jpg" WIDTH="96" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Chicago geh&ouml;rt nat&uuml;rlich zu jedem Gangsterspiel. Und diese Karte wird ihrem
Namen gerecht. Es gibt viele Stra&szlig;en &uuml;ber verschiedenen Ebenen. Dies macht
im Mehrspieler-Modus extrem viel Bock, da der Gegner ja sieht, in welcher
Richtung man gerade ist, nicht aber auf welcher Ebene. Die Waffen sind fair
verteilt.
</P>
<P><B>Little Indy (Roger Monkman, 04.05.2001)</B></P>
<P>
 <A HREF="img/Little_Indy.png"><IMG SRC="thumb/Little_Indy.jpg" WIDTH="96" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Eine der nicht ganz so guten Karten. Eine breite Stra&szlig;e, die um eine
(zugegebene gut gelungene) Dorflandschaft f&uuml;hrt. Wenig Action. F&uuml;r die, die
gerne im Kreis fahren ist diese Karte ein mu&szlig;, alle anderen sollten nur im
Notfall hierauf zur&uuml;ckgreifen. Ich mag halt einfach keine Stra&szlig;e, die
nirgendwo hinf&uuml;hrt sondern deren einziges Ziel es ist, da zu sein.
</P>
<P><B>Little Paris (Xavier Bodenand, 26.05.2001)</B></P>
<P>
 <A HREF="img/Little_Paris.png"><IMG SRC="thumb/Little_Paris.jpg" WIDTH="96" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Ganz anders geht es dann schon bei dieser Karte zu. Hier kann man sich mal
so richtig austoben. Es gibt viele breite Stra&szlig;en, enge Gassen und
Verstecke zwischen den H&auml;usern. Der Clou sind die Unterf&uuml;hrungen, wo man
einen prima Hinterhalt planen kann. Es ist auch sch&ouml;n, endlich mal wieder
auf der &quot;richtigen&quot; Stra&szlig;enseite zu fahren.
</P>
<P><B>Underground (Peter Turhede, 20.08.2001)</B></P>
<P>
 <A HREF="img/Underground.png"><IMG SRC="thumb/Underground.jpg" WIDTH="96" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Schade. Hieraus h&auml;tte man mehr machen k&ouml;nnen. Das Spiel mit den
verschiedenen Ebenen wei&szlig; absolut zu &uuml;berzeugen und verwirrt im
Mehrspieler-Modus garantiert jeden. Einzig bei der riesigen gr&uuml;nen Fl&auml;che
kommt etwas Entt&auml;uschung auf. Zwar kann man sich hier cool jagen, aber auf
die Dauer ist dies etwas langweilig. Ein paar nat&uuml;rliche Sprungschanzen wie
in Hyrtola-Offroad h&auml;tten aus diesem Level ein wahres Meisterwerk gemacht.
</P>
<P><B>Woods (Oliver Martin, 26.05.2001)</B></P>
<P>
 <A HREF="img/Woods.png"><IMG SRC="thumb/Woods.jpg" WIDTH="96" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Woods soll eine Hommage an das original Payback sein. Und so findet man hier
auch alles, was das Verbrecherherz begehrt: Viele Autos und Menschen f&uuml;r
den Zerst&ouml;rungsmodus, Winkel zum Verstecken, breite Stra&szlig;en und sogar eine
Rennstrecke f&uuml;r den Mehrspieler-Modus sowie viel Liebe zum Detail. Diese
Karte hat es nur deshalb bei mir nicht auf Platz 1 geschafft, weil es sie
nicht als Nachtlevel gibt. Guter Zweiter!
</P>
<P>
Die Extra-Maps-Sektion von Payback wird st&auml;ndig erweitert und erneuert. Ihr
seht, es gibt also gen&uuml;gend Futter bis zum erscheinen von PaybackPPC,
welches sich aufgrund der unglaublichen neuen Features noch ein bisschen
verz&ouml;gert.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
