<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Der Zwischenruf
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Der Zwischenruf (von Ralf Driesner)</H1>
<P>
<B>Noch'n Toast, noch'n Ei, noch'n Kaffee und 'n Brei</B>
</P>
<P>
Die &quot;Gebr&uuml;der Blattschuss&quot;, gewisserma&szlig;en Vorreiter und Pioniere moderner
(abwechslungsreicher) Ern&auml;hrungsphysiologie hatten bereits vor vielen
Jahren die ausgekl&uuml;gelste L&ouml;sung f&uuml;r ein nagendes Problem: Mutter arbeitet
aus Sicht der genannten Br&uuml;der zuviel. Um sich selbst nicht der st&auml;ndigen
Kasteiung aussetzen zu m&uuml;ssen (die Mutter so schwer arbeiten zu sehen; Anm.
f&uuml;r begriffsstutzige Leser) lie&szlig;en sie Muttern die T&uuml;r zur K&uuml;che schlie&szlig;en.
Oder war's doch die Sorge um die W&ouml;lfin, die ja nur ihre Jungen beh&uuml;tet?
Nun ja; aus den Augen aus dem Sinn....und das Fr&uuml;hst&uuml;ck ist dann schneller
drin.
</P>
<P>
Oben genannte Familienbande ist der &quot;Primat modern-gepr&auml;gter Interaktion&quot;.
Wer den Satz jetzt nicht verstanden hat: keine Panik. Ich hab auch nur
Realschulabschluss gemacht.
</P>
<P><B>Versuchen wir's also mit folgender Parabel:</B></P>
<P>
Eine Firma, nennen wir sie X, bastelt an einem neuen Betriebssystem,
welches so revolution&auml;r ist, dass selbst Fidel Castro erbleicht. Eine
zweite Firma, Y, ist von dieser Entwicklung angetan und k&uuml;ndigt an,
Software auch f&uuml;r dieses neue Betriebssystem zu entwickeln. Als Belohnung
f&uuml;r Y's Treue genehmigt X die behutsame Weiterentwicklung eines bestehenden
Systems, um sowohl X als auch Y ein wenig Zwischenverpflegung
(Verkaufserl&ouml;s) zu erm&ouml;glichen. Man hat ja schlie&szlig;lich Verantwortung f&uuml;r
die (noch) motivierten Mitarbeiter und den Betriebskater.
</P>
<P>
An einem diesigen Morgen nun stellt der Chef von Y (nach einem sehr daneben
gegangenen Aufstehen und dem Auffinden der vom Betriebskater zerfetzten
Pantoffeln) ad hoc fest, dass Firma X daran Schuld sein muss, dass sowohl
Wecker als auch Betriebskatze in konspirativer Absicht vorhatten, Y den Tag
zu versauen.
</P>
<P>
Klarer Fall von Paranoia stellt der geneigte Leser fest. Wecker klingeln
immer unangenehm und Kater (besonders unkastrierte) zerlegen in einem
Wutanfall nach verpatztem Rendezvous gern Hausschuhe.
</P>
<P>
Sei es drum. Dieses Szenario spiegelt (jedenfalls nach Kenntnisstand des
Zwischenrufers) nicht das Entstehungsdrama um die Amiga-Emulatorl&ouml;sung
wider. Welche Beweggr&uuml;nde Haage &amp; Partner hat, ausgerechnet jetzt diese
L&ouml;sungen zu ver&ouml;ffentlichen, dar&uuml;ber vermag ich nur zu spekulieren. In
nicht enden wollenden Diskussionen jedoch kochen die Emotionen der Anwender
hoch.
</P>
<P>
Im letzten Zwischenruf empfahl ich abzuwarten und Tee zu trinken. F&uuml;r
diejenigen, die sich das aus ern&auml;hrungsphysiologischen Gr&uuml;nden nicht antun
wollen, habe ich diesen Monat einen weiteren Tip: Macht doch Eure T&uuml;ren
einfach mal f&uuml;r einen Monat dicht. Genie&szlig;t Euer Fr&uuml;hst&uuml;ck. Und nach dieser
Zeit wissen wir (hoffentlich) alle, ob es sich lohnt, 150 Euro f&uuml;r eine CD
und (ggf.) einige Tausender f&uuml;r einen PC auszugeben.
</P>
<P>
In jedem Fall umh&uuml;llt uns alle momentan eine gewisse Nebelschwade, wenn es
um die Zukunft eines wirklich(!!) neuen Amigas geht.
</P>
<P><B>Lebt lang und erfolgreich</B></P>
<P><B>Euer</B></P>
<P><B>Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;</B></P>
<P>
P.S.: Die Ereignisse des 11. Septembers 2001 in New York haben mich
geschockt und erf&uuml;llen mich mit tiefer Trauer. Ich m&ouml;chte im Namen der
gesamten AMIGA-aktuell-Redaktion den Angeh&ouml;rigen der Opfer mein Beileid
aussprechen und sagen &quot;Kopf hoch!! Wir werden das alle gemeinsam
durchstehen&quot;.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
