<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x00 - p.OS</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x000B.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x000A.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x000C.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0007.html">Art Effect</A> | <A HREF="0x0008.html">Cygnus Ed</A> | <A HREF="0x0009.html">Fusion</A> | <A HREF="0x000A.html">Draw Studio</A> | <A HREF="0x000B.html">p.OS</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0001.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0002.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0003.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0004.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0005.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0007.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x000C.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x000D.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x000E.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x000F.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0011.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>p.OS - Das portable Betriebssytem - PreRelease</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Das AmigaOS ist im Laufe der Jahre schon einigermassen
angestaubt. Reicht es nun, das Gebilde einfach mal kraeftig abzuspritzen?
Das neue Betriebssystem <A HREF="http://194.123.204.15/de/p-OS.html">p.OS</A>
aus dem Hause <A HREF="http://194.123.204.15/de/index.html">proDad</A>
versucht es nun mit einem bunten Neubau. </FONT><BR>

<P ALIGN=CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Sp&auml;testens seit der gefeierten 'final Beta' einer bunten PC-
Betriebssystemoberfl&auml;che bekommt so mancher User eine G&auml;nsehaut, wenn er
die PreRelease eines Betriebsystems in den H&auml;nden h&auml;lt. Erinnerungen werden 
wach an n&auml;chtelange Installationsorgien und Reparaturversuche. Selbst die 
neugewonnene Freundschaft zu fdisk und der endlich wieder freie 
Festplattenspeicher k&ouml;nnen den Erkenntnisschmerz nicht mildern, da&szlig; der 
liebgewonnene Computer &uuml;ber keine kompatible Hardware verf&uuml;gt, alle 
Speicherformen grunds&auml;tzlich unterdimensioniert sind und die CPU kurz vor der 
Fr&uuml;hpensionierung steht. Beobachtet man allerdings die nachfolgende 
Entwicklung am Speichermarkt, kann man sich ueber rapide sinkende Preise 
freuen. So gesehen kann man sogar einem bunten PC Betriebsystem noch etwas 
positives abgewinnen. Dagegen versp&uuml;rt der typische Amiga-User 
traditionellerweise eher selten das Bed&uuml;rfnis, seine Hardware aufzur&uuml;sten. Wozu 
auch, schlie&szlig;lich waren wir schon immer kompatibel.</P>

<P ALIGN=CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Trotzdem konnten wir der Verlockung nicht widerstehen, das neue 
Betriebsystem einmal wirklich auszuprobieren. Schon das CD-Cover erinnert an 
alte Zeiten: bunt und verspielt, dabei aber nicht stillos oder &uuml;bertrieben 
wirkend, eben so richtig 'Amiga-like'. Nur bei der Englischen &Uuml;bersetzung sind 
wir schon besseres gewohnt. Hier gleich der Tip f&uuml;r humorvolle Menschen mit 
Englischkentnissen : p.OS unbedingt auf englisch betreiben.</P>

<P ALIGN=CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Als erstes Opfer f&uuml;hrten wir Stephans treuen 3000er zur Installations-
Schlachtbank. Dazu die technischen Details: A3000, OS3.1, Powerchanger040 
(wirklich), 2Meg Chip, 8Meg Fast, PicassoII, Mulitface3. Das Ganze l&auml;uft unter 
einer &auml;lteren Version von Picasso96, gew&uuml;rzt mit einigen Commodities und 
Patches, kurz gesagt : Dieser Rechner ist die ideale Testumgebung. Also Z&auml;hne 
zusammenbeissen und rein mit der CD.</P>

<P ALIGN=CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Die Installation erfolgt problemlos per Amiga Installer. Dem Benutzer bleibt 
dabei die Wahl, nach dem n&auml;chsten Neustart automatisch ins p.OS zu booten 
oder ein Start-Icon auf die Workbench zu legen. Aus Sicherheitsgr&uuml;nden 
entschieden wir uns zun&auml;chst f&uuml;r letzteres. Auch werden w&auml;rend der Installation 
etwaige Commodities gesucht und stolz dem Benutzer pr&auml;sentiert. Dieser kann 
sie dann wahlweise ausschalten. Wir wollten es nicht unn&ouml;tig schwer machen 
und schalteten alles aus, was gefunden wurde.</P>

<P ALIGN=CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Daraufhin erfolgt der p.OS Systemstart. Dieser erinnert auf den ersten Blick ein 
wenig an MacOS, die fogende Oberfl&auml;che sieht aus wie ein gepatchtes 
AmigaOS. Da f&uuml;hlt sich der Amiga-User fast schon zuhause. Zuerst fallen links, 
rechts und unten die liebevoll gezeichneten Icons auf. Die Preferences sind 
leicht erkannt und schnell gestartet. Links oben im Fenster befindet sich ein 
einziges Icon mit dem Namen 'System', darunter ist noch viel Platz f&uuml;r m&ouml;gliche 
weitere Preferences. Das ganze macht einen recht vern&uuml;nftigen Eindruck bis zu 
dem Zeitpunkt als wir versuchten, das Iconset umzustellen.</P>

<P ALIGN=CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Den englischen Inhalt des Requesters m&ouml;chten wir niemandem vorenthalten:</P>

<P ALIGN=CENTER>
    Iconset &quot;Bl_ue&quot; were activated.<BR>
    Please wait for ending discactivison<BR>
    and then confirm this reqester.</P>

<P ALIGN=CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>W&auml;hrend wir noch einen Kugelschreib&auml;r suchten, verschwand der Requester 
von selbst und die erw&uuml;nschte &Auml;nderung blieb aus. Sehr interessant ist auch das 
Kopieren von Dateien &uuml;ber die grafische Oberfl&auml;che. Ein wunderbares Fenster 
sagt eigentlich alles, was n&ouml;tig ist: Was, Wohin und eine Anzeige des 
Fortschrittes. Weniger wunderbar ist hingegen was nebenbei geschieht - erst 
einmal n&auml;mlich gar nichts. Erst wenn der Kopiervorgang beendet ist, werden 
die gepufferten Mouse-Operationen nachtr&auml;glich ausgef&uuml;hrt, was der Platte 
einiges an Stress beschert. Naja, ein bischen Aerobic tut meiner Platte sicher 
gut, damit sie nicht FAT wird. Das Starten der Shell ist nur leichte 
Plattengymnastik im krassen Gegensatz zum Start eines der mitgelieferten 
Demoprogramme.</P>

<P ALIGN=CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Interessant an der Shell ist, da&szlig; der Befehl mount beim Fehlschlagen einen 
Requester auf die Oberfl&auml;che ausgiebt und nicht direkt in die Shell, aus welcher 
er eigentlich gestartet wurde.</P>

<P>Man darf allerdings nicht aus den Augen verlieren, da&szlig; es sich hierbei um die 
PreRelease eines Betriebssystemes handelt. p.OS ist zwar noch nicht vollst&auml;ndig, 
aber es l&auml;uft erfr&auml;ulich stabil und die html-Dokumentation verspricht so 
unglaubliche Dinge wie Multiuser. Gepaart mit saubern Netzwerkprotokollen, 
funktionierenden Servern und einer guten Security k&ouml;nnte p.OS, und damit 
unser Amiga, zur besten Freundin des Netzwerkadmins werden. Trotz allem 
w&auml;re es von Vorteil, k&ouml;nnte man die Oberfl&auml;che auf das Wesentliche reduzieren, 
die Reqesterflut etwas eind&auml;mmen und der Festplatte etwas weniger Stre&szlig; 
bescheren um deutlicheren Abstand zu den bunten PC-Oberfl&auml;chen zu 
gewinnen.
Pr&auml;gnant dazu sind die ersten Worte von Olivers Freundin: &quot;Endlich sieht euer 
Amiga auch so aus wie mein Windows95.&quot; </P>

<P ALIGN=CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Im Gegensatz zu Stephans 3000er war es weniger einfach, p.OS auf Olivers 2000er zum 
Funktionieren zu &uuml;berreden (so wie er auch mit seiner Freundin bez&uuml;glich der 
Systemwahl noch zu k&auml;mpfen hat...), denn fies, wie er numal so ist, deaktivierte 
er gar keine der angezeigten Commodities und mu&szlig;te somit einige Abst&uuml;rze 
des geliebten Amigas in Kauf nehmen. Von der Hardware-Seite her konnte es 
eigentlich keine Probleme geben, denn ein B2000 Rev.6.2 mit GForce030, 
1MB Chip, 16MB Fast, PicassoII mit Picasso96 1.31, Multiface III, Ariadne und 
einer MaestroPro ist fast schon als Standardausr&uuml;stung anzusehen. Dennoch 
dauerte es geraume Zeit, bis wir draufkamen, da&szlig; es ChangeScreen, das Commodity der 
'alten' Picasso-Software von VillageTronic zum Screen-Umlenken, war, welches die 
Probleme verursachte. Erst nach entfernen desselben aus der WBStartup begann  
auch auf diesem Rechner p.OS mit der Plattenumstrukturierung. Zumindest erschien 
es so, denn es tat sich eine Weile lang gar nichts. Doch mit etwas Geduld 
erhielten wir dann auch hier einen sch&ouml;nen p.OS-Screen, der unabh&auml;ngig der 
gew&auml;hlten Aufl&ouml;sung die Icons immer brav an den Rand plaziert.</P>

<P ALIGN=CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Was mit einem 40MHzigem 68030er als Erstes auff&auml;llt, ist die massive 
Beh&auml;bigkeit und Tr&auml;gheit, die man von einem Amiga nicht gewohnt ist. Die 
Reaktionszeiten auf Mausklicks sind sp&uuml;rbar vorhanden und was am 
&auml;rgerlichsten auff&auml;llt, ist, da&szlig; der Mauszeiger inzwischen immer wieder 
steckenbleibt. Da f&auml;llt ein gewichtiges Argument gegen Windoofs ins Wasser :-((</P>

<P ALIGN=CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Da es von p.OS hei&szlig;t, da&szlig; intern alles in 24Bit gerechnet wird, erwarteten wir 
eine Leistungssteigerung durch Umstellung des p.OS-Screens auf einen TrueColor-
Screen. Es war aber absolut kein Unterschied zu bemerken. Eher ist 
anzumerken, da&szlig; es soetwas wie ein Screenmode in den Preferences (noch?) 
nicht gibt und man die Aufl&ouml;sung nur mit Hilfe einer Neuinstallation oder 
durch Einsetzen der entsprechenden hexadezimalen Screen-ID in das Startscript 
einstellen kann.</P>

<P ALIGN=CENTER><A NAME="12" HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Beim Austesten f&auml;llt auch auf, da&szlig; sich ein Demo, pBall, einfach nicht starten 
l&auml;&szlig;t. Ist das System gut aufgelegt, erscheint manchmal noch ein Fenster am 
Screen, das sich aber auch gleich wieder schlie&szlig;t. Auch eine Tetrisabart ist unter 
den Demos vorhanden, allerdings in einer fast unspielbaren Version, da die 
Bewegungen und Reaktionen nicht wirklich die schnellsten sind.</P>

<P ALIGN=CENTER><A NAME="13" HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#14"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Das ganze System ist sehr auf graphische Schmankerl ausgelegt, wie zum 
Beispiel animierte Depth-, Drag-, und Close-Gadgets in den Fenstern. Die 
Men&uuml;zeile erscheint nicht am oberen Screenrand, sondern als Popup-Men&uuml; an 
der Stelle des Mauszeigers. Wer die Art und Weise kennt, wie ein Mac seine 
Fenster &ouml;ffnet (mit dem sich vergr&ouml;&szlig;erndem Rahmen), wei&szlig; auch, wie sowas 
beim pOS aussieht. Verschieben lassen sich die Fenster mit vollem Inhalt, was 
im Gegensatz zum restlichen System erstaunlich fl&uuml;ssig und leichtg&auml;ngig 
funktioniert.</P>

<P ALIGN=CENTER><A NAME="14" HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#15"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Die Shell hat eine eingebaute History und mit einem Druck auf TAB lassen sich 
auch die Filenamen, die im Pfad zu finden sind, vervollst&auml;ndigen.</P>

<P>Es ist eine bunte Sache, die vorerst nur parallel zum AmigaOS und zur 
Workbench l&auml;uft und so wirkt, wie ein verspielter Workbenchersatz. Sp&auml;ter soll 
p.OS ein eigenst&auml;ndiges System werden, ob es sich allerdings durchsetzen kann, 
bleibt angesichts der doch h&ouml;heren Anforderungen an die Hardware 
abzuwarten. Schlie&szlig;lich sollte unserer Meinung nach ein Betriebssystem nicht 
die Prozessorzeit der Programme wegnehmen, es ist ja schlie&szlig;lich immer noch 
ein Amiga. Nat&uuml;rlich kann eine Prerelease nie das Leistungsspektrum eines 
Neuansatzes zeigen und es ist wahrscheinlich, da&szlig; auch performancem&auml;&szlig;ig 
noch einiges unternommen wird. Im gegenw&auml;rtigen Zustand ist es jedenfalls 
auf einem blanken 1200er kaum zu verwenden, da ja auch AGA nicht das 
Schnellste ist.</P>

<P ALIGN=CENTER><A NAME="15" HREF="#14"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Auch ist noch offen, wie viele Leute ihre Software auf p.OS umsetzen werden
und wie es unter diesem System zu programmieren ist. Laut Hersteller ist es nur 
erforderlich, neue Includes zu verwenden und die Namen der 
Betriebssstemaufrufe entsprechend zu ver&auml;ndern. Der Rest soll gleichbleiben 
k&ouml;nnen.</P>

<P>Eigentlich sollte ja schon in dieser (ersten :-)) ) Ausgabe ein Test von StormC 
unter p.OS zu lesen sein, doch es war kein Exemplar dieses Compilers mit den 
p.OS-Extensions zu erhalten. Wir hoffen jedoch, dies in einer der n&auml;chsten 
Ausgaben nachholen zu k&ouml;nnen.</P>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x000B.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>
					<A HREF="as-redax.html#stevie">Stephan Bischoff</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x000B.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Mehr &uuml;ber <A HREF="http://194.123.204.15/de/p-OS.html">p.OS</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://194.123.204.15/de/index.html">proDad</A> Homepage<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/pos_directory.gif">p.OS Directory</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/pos_discactivision.gif">p.OS lustiger Requester</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/pos_fire.gif">p.OS Fire Demo</A> - it looks like...
<IMG WIDTH=103 HEIGHT=107 SRC="../images_00/pos_test.gif" ALT="[Logo]" ALIGN=RIGHT HSPACE=20><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/pos_fire2.gif">p.OS Fire Demo</A> - ...Cedric? ;-)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/pos_html-viewer.gif">p.OS HTML Viewer</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/pos_icons_blue.gif">p.OS Blue Icons</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/pos_icons_comic.gif">p.OS Comic Icons</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/pos_icons_original.gif">p.OS Original Icons</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/pos_teapot.gif">p.OS TeaPot</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/pos_tetris.gif">p.OS Tetris</A><BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x000A.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x000C.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
