<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x00 - Draw Studio</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x000A.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0009.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x000B.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0007.html">Art Effect</A> | <A HREF="0x0008.html">Cygnus Ed</A> | <A HREF="0x0009.html">Fusion</A> | <A HREF="0x000A.html">Draw Studio</A> | <A HREF="0x000B.html">p.OS</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0001.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0002.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0003.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0004.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0005.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0007.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x000C.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x000D.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x000E.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x000F.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0011.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Draw Studio 2.0</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Zur beliebtesten Software-Gattung am Amiga
z&auml;hlen wohl die Grafikprogramme. W&auml;hrend auf anderen
Computersystemen jedoch haupts&auml;chlich strukturierte Zeichenprogramme
eine starke Position einnehmen konzentrieren sich diese auf dem Amiga eher
auf die pixelorientierten Malprogramme. Mit DrawStudio gibt es jetzt jedoch
auch auf dem Amiga wieder ein leistungsf&auml;higes strukturiertes
Zeichenprogramm oder Vektor-Zeichenprogramm wie diese auch oft bezeichnet
werden.</FONT><BR>

<P ALIGN=CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Im Gegensatz zu den Malprogrammen wird hier die Zeichnung aus exakten
geometrischen Figuren wie Linie, Rechteck, Kreis, Ellipse usw. zusammengesetzt.
Die Koordinaten und Dimensionen dieser Objekte merkt sich das Programm und sie
k&ouml;nnen nachtr&auml;glich in ihrer Form und Gr&ouml;&szlig;e ver&auml;ndert sowie dupliziert werden.
Malprogramme haben zwar auch Funktionen zum Zeichen von Linien, Rechtecken,
Kreisen, jedoch dienen diese nur dazu, die entsprechenden Punkte auf dem
Bildschirm zu setzen. Nachdem ein Malprogramm eine Linie gezeichnet hat wei&szlig; es
von dieser nichts mehr und sie kann deshalb nachtr&auml;glich nicht mehr in ihren
Eigenschaften ver&auml;ndert werden. Eine weitere Eingenschaft, die Zeichungen von
strukturierten Zeichenprogrammen gegen&uuml;ber denen von Malprogrammen hervorhebt
ist die Tatsache, da&szlig; jene beliebig skaliert werden k&ouml;nnen, ohne da&szlig; unsch&ouml;ne
Treppen auftreten.</P>

<P ALIGN=CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Getestet wurde die CD-Version von DrawStudio 2.0. Auf der CD befindet sich noch
die Vorg&auml;ngerversion. Die aktuelle Version 2.0 wird auf zwei Disketten,
zus&auml;tzlich zur CD mitgeliefert. Auf einer dritten Diskette sind noch n&uuml;tzliche
Zusatzprogramme wie eine registrierte Version von MetaView, mit dem man
verschiedene Zeichenformate ansehen, drucken und konvertieren kann enthalten.
Die Installation erfolgt dank Standard-Installer einfach und schnell jedoch
leider nur auf englisch. Die Bedienoberfl&auml;che von DrawStudio selbst ist jedoch
auch auf deutsch verf&uuml;gbar. Wenn man das Programm das erste mal startet sollte
man zuerst eine zur Hardwareausstattung des eigenen Rechners passende
Bildschirmaufl&ouml;sung und Farbtiefe w&auml;hlen, denn standardm&auml;&szlig;ig ist hier ein 16
farbiger Interlace Screen -- der kleinste gemeinsame Nenner -- voreingestellt.
Unabh&auml;ngig von der gew&auml;hlten Bildschirmdarstellung arbeitet das Programm intern
jedoch immer mit 24 Bit Echtfarben, soda&szlig; auch auf Rechnern die keine
Grafikkarte besitzen qualitativ hochwertige Zeichnungen erstellt werden k&ouml;nnen.
Die Bedieneroberfl&auml;che basiert auf MUI (mitgeliefert) und erm&ouml;glicht somit eine
flexible Anpassung an die jeweiligen pers&ouml;nlichen Vorstellungen.  Hier mu&szlig;
jedoch unbedingt beachtet werden, da&szlig; f&uuml;r die DrawStudio-Fenster als
Refresh-Art immer smart eingestellt ist, denn die Einstellung simple f&uuml;hrt zum
Blockieren des Programms, wogegen nur mehr ein Neustarten des Rechners hilft.</P>

<P ALIGN=CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>DrawStudio erm&ouml;glicht, wie auch bei CAD-Programmen &uuml;blich, das Arbeiten in
verschiedenen Ebenen (Layers). So k&ouml;nnen Teile der Zeichung ausgeblendet sowie
unabh&auml;ngig von anderen bearbeitet werden. Leider k&ouml;nnen Zeichnungselemente
nicht einfach von einer Ebene auf eine andere &uuml;bertragen werden. Man mu&szlig; dazu
immer &uuml;ber das Clipboard gehen, was bedeutet, da&szlig; das Objekt neu Positioniert
werden mu&szlig;. Positiv hingegen ist, da&szlig; bis zu 10 Projekte gleichzeitig ge&ouml;ffnet
werden k&ouml;nnen und jedes Projekt zus&auml;tzlich mehrere Seiten umfassen kann wobei
auch jede Seite eine andere Gr&ouml;&szlig;e besitzen darf.</P>

<P ALIGN=CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>DrawStudio bietet neben den &uuml;blichen Zeichenprimitiven wie Linie, Ellipse,
Rechteck usw. auch Bézier-Kurven mit denen komplexe Objekte erstellt werden
k&ouml;nnen. Das Werkzeug zum Erstellen der Bézier-Kurven wird auch zum Zeichnen von
Polygonz&uuml;gen verwendet. So k&ouml;nnen je nachdem ob man beim Ziehen mit der Maus
die linke Taste gedr&uuml;ckt h&auml;lt oder nicht, Linien und Kurvensegmente
aneinandergereiht werden. Diese lassen sich auch nachtr&auml;glich ver&auml;ndern.  Hier
w&uuml;rde man sich jedoch mehr M&ouml;glichkeiten w&uuml;nschen. So kann ein Liniensegment
nachtr&auml;glich nicht mehr in eine Kurve oder umgekehrt verwandelt werden und man
mu&szlig; deshalb umst&auml;ndlich mit Auftrennen und Zusammenf&uuml;gen arbeiten. Auch gibt es
keine Unterst&uuml;zung daf&uuml;r zwischen Geraden- und Kurvensegmenten bzw. zwischen
zwei Kurvensegmenten eines Bézier-Objektes glatte &Uuml;berg&auml;nge zu erzwingen.  Die
Linienst&auml;rke kann bei allen Objekten festgelegt werden. Einige g&auml;ngige sind
bereits vorgegeben und k&ouml;nnen schnell ausgew&auml;hlt werden. Jedoch kann sie auch
individuell angegeben werden, wenn einem die Vorgaben nicht ausreichen.
Weitere Attribute, die man festlegen kann sind die Linienart wie ausgezogen,
strichliert, strichpunktiert usw. sowie die Endabschl&uuml;sse einer Linie oder
Kurve. Diese k&ouml;nnen f&uuml;r beide Enden einzeln ausgew&auml;hlt werden. Hier fehlt
jedoch die M&ouml;glichkeit einer individuellen Gestaltung. Als Vorgaben stehen ein
Runder und ein Eckiger Linienabschlu&szlig;, sowie verschiedene Pfeile und &Auml;hnliches
zur Auswahl.</P>

<P ALIGN=CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>F&uuml;r eine effektvolle Gestaltung der Zeichnung ist man mit DrawStudio gut
ausger&uuml;stet. So k&ouml;nnen aufwendige Farbverl&auml;ufe innerhalb und mit der
Duplizierfunktion sogar &uuml;ber mehrere Objekte hinweg erstellt werden. Auch die
Kombination von Pixel- und Vektorgrafik ist m&ouml;glich. Bitmaps k&ouml;nnen eingebunden
werden und Objekte k&ouml;nnen mit Bitmaps und Mustern gef&uuml;llt werden. Als
F&uuml;llmuster werden 8x8 Pixel gro&szlig;e Bitmaps verwendet. Ein F&uuml;llen mit vektoriell
erstellten Mustern so wie bei CAD-Programmen &uuml;blich w&auml;hre jedoch zus&auml;tzlich
w&uuml;nschenswert. Als besondere Eigenschaft ist auch die M&ouml;glichkeit zu erw&auml;hnen,
mit Transparenz zu arbeiten. So kann beispielsweise die Deckkraft der Farben
eingestellt werden.</P>

<P ALIGN=CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Das Programm verwendet in seinen Zeichungen f&uuml;r die Texte ausschlie&szlig;lich
Postscript Type 1 Zeichens&auml;tze welche sich durch hohe Ausgabeqalit&auml;t
auszeichnen, da auch deren Hints ausgewertet werden. Amiga Bitmap- und
Compugraphic-Fonts werden nicht unterst&uuml;tzt. Das keine Bitmap-Fonts verwendet
werden k&ouml;nnen ist bei einem vektororientierten Programm einsichtig jedoch w&auml;hre
die Verwendbarkeit der Agfa Compugraphic-Fonts troz der im Handbuch angef&uuml;hrten
Einw&auml;nde einer unvorhersehbaren Ausgabequalit&auml;t w&uuml;nschenswert. &Uuml;berhaupt wei&szlig;
DrawStudio mit den am Amiga etablierten Dateiformaten wenig anzufangen. So
k&ouml;nnen zwar Zeichnungen in dem am Amiga als Standard geltenden DR2D-Format
gelesen, jedoch nicht gespeichert werden. So wird das Einbinden von
Zeichnungen die mit DrawStudio erstellt wurden in andere Programme erschwert.
Der mitgelieferte Konverter MetaView kann wiederum das DrawStudio-Format nicht
lesen und hilft somit auch nicht weiter. Wenigstens k&ouml;nnen die Zeichnungen im
PostScript-Format exportiert werden.  Hierbei kann man festlegen ob normales
PostScript f&uuml;r die Druckerausgabe oder EPS, das sich zum Einbinden in
Desktop-Publishing Systeme eignet, erzeugt werden soll.  Das exportieren im
PostScript-Format erkauft man sich jedoch mit einigen Einschr&auml;nkungen. So gehen
dabei gewisse Eigenschaften wie die Tranzparenz von Farben und das F&uuml;llen von
Objekten mit BitMaps verloren. Diese Einschr&auml;nkungen liegen aber dem
PostScrip-Format zu Grunde und k&ouml;nnen nicht DrawStudio angelastet werden. Auch
bei einem Export ins DR2D-Format m&uuml;&szlig;te man, falls sich die Programmierer in
einer sp&auml;teren Version doch noch dazu entschlie&szlig;en k&ouml;nnen diese Funktion zu
integrieren mit einigen Einschr&auml;nkungen rechnen, was aber ein g&auml;nzliches Fehlen
dieser Funktion nicht rechtfertigt. Neben den Vektorformaten kann eine
Zeichnung auch noch als BitMap-Grafik z.B. im Amiga-Standardformat ILBM
exportiert und so in Programme &uuml;bernommen werden, die nichts von Vektorgrafiken
verstehen. Die Aufl&ouml;sung der zu erstellenen BitMap-Grafik kann frei eingestellt
werden.</P>

<P ALIGN=CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Neben den Zeichenwerkzeugen sind auch die Zeichenhilfen f&uuml;r die
Leistungsf&auml;higkeit eines Programmes von Bedeutung. Hier bietet DrawStudio
Lineale, Raster und Fanghilfen. Die Linieale k&ouml;nnen einzeln ein- und
ausgeblendet, sowie auf verschiedene Ma&szlig;einheiten eingestellt werden.
Auch der Rasterabstand kann sowohl horizontal als auch vertikal getrennt
verstellt werden. Ein Drehen des Rasters ist jedoch nicht m&ouml;glich.
Eine besondere Hilfe beim Zeichnen regelm&auml;&szlig;iger Objekte ist das Einschnappen
auf Rasterpunkte. Einen guten Ansatz um genaue Zeichnungen erstellen zu k&ouml;nnen
stellt die von CAD-Programmen bekannte M&ouml;glichkeit dar, bestimmte Punkte
anderer Objekte zu fangen. So kann eine Linie ganau an eine andere oder an
eine Kurve angesetzt werden. Das Programm ver&auml;ndert dabei den Mauszeiger um
anzuzeigen welcher Fangmodus gerade aktiv ist. Insbesondere diese
Fangm&ouml;glichkeiten  machen Appetit auf mehr. Hier k&ouml;nnt man f&uuml;r die n&auml;chste
Version ansetzen und diese Funktionalit&auml;t weiter ausbauen. So w&auml;re es sehr
hilfreich wenn auch noch die restlichen von CAD-Programmen bereitgestellten
Fangm&ouml;glichkeiten wie Schnittpunkt zweier Objekte, Mitte einer Linie,
Quadrantenpunkte eines Kreises usw. unterst&uuml;tzt w&uuml;rden.
Nachteilig f&uuml;r exaktes Arbeiten ist jedoch, da&szlig; die Koordinaten nicht per
Tastatur eingegeben werden k&ouml;nnen. Nur schon gezeichnete Objekte k&ouml;nnen
nachtr&auml;glich umst&auml;ndlich &uuml;ber einen Einstellungsdialog mittels direkter
Koordinatenangabe ver&auml;ndert werden.</P>

<P ALIGN=CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Einen Pluspunkt bekommt das Programm f&uuml;r seine ARexx-F&auml;higkeit. Damit kann man
sich Skripte schreiben, die einem das Leben erleichtern. Au&szlig;erdem sind damit
Dinge m&ouml;glich, die man mit der Hand nur sehr m&uuml;hsam oder &uuml;berhaupt nicht
erledigen kann. Auf die M&ouml;glichkeiten dieser Schnittstelle werden wir in einer
der n&auml;chsten Ausgaben von AmigaScene noch genauer eingehen.</P>

<P ALIGN=CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Die Ausgabe auf dem Drucker erfolgt sowohl in Farbe als auch in Graustufen mit
sehr hoher Qualit&auml;t, insbesondere wenn man TurboPrint besitzt, denn dieses wird
von DrawStudio direkt unterst&uuml;tzt. Allerdings braucht man daf&uuml;r viel Geduld.
Schneller geht es da wenn man einen PostScript-Drucker verwendet, denn der
PostScript-Export ist im nu fertig.</P>

<P ALIGN=CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Bei der praktischen Arbeit merkt mann schnell, da&szlig; f&uuml;r ein angenehmes Arbeiten
ein flotter Rechner erforderlich ist. Bei etwas aufwendigeren Zeichnungen mu&szlig;
man auch auf einem mit 68060 best&uuml;ckten Rechner und schneller Grafikkarte
warten bis der Bildausschnitt neu gezeichnet ist. Leider l&auml;&szlig;t auch die
Stabilit&auml;t des Programms zu w&uuml;nschen &uuml;brig. So mu&szlig;te der Rechner w&auml;rend des
Erstellens einer Testzeichnung mehrmals neu gebootet werden. Weiters kann es
sogar passieren, da&szlig; spezielle Kurven das Programm so durcheinander bringen,
da&szlig; nicht mehr ordnungsgem&auml;&szlig; weitergezeichnet werden kann. Dann hilft nur mehr
das L&ouml;schen dieses Kurvenzuges. Diese M&auml;ngel bed&uuml;rfen unbeding einer umgehenden
Nachbesserung seitens der Autoren und eines kostenloser Bugfix via Aminet um
den ansonsten guten Gesammteindruck des Programmes nicht zu schm&auml;lern.</P>

<P ALIGN=CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Die beiliegende deutsche Bedienungsanleitung ist &uuml;bersichtlich gestaltet und
aufgrund der vielen Abbildungen findet man sich schnell im Programm zurecht.
Auf der mitgelieferten CD finden sich weitere Leckerbissen f&uuml;r grafische
Arbeiten. Einerseits ist dort ein umfangreiches Archiv von Clip-Arts, sowie
BitMaps untergebracht und au&szlig;erdem eine registrierte Version von ImageStudio,
ein Bildbearbeitungsprogramm, das sich insbesondere durch die F&auml;higkeit
auszeichnet auch gro&szlig;e 24-Bit-Bilder, wie man sie nach dem Scannen erh&auml;lt zu
bearbeiten, weil es mit einer virtuellen Speicherverwaltung arbeitet. Auch f&uuml;r
ImageStudio wird eine gedruckte Anleitung mitgeliefert welche im Gegensatz zu
der von DrawStudio aber in englischer Sprache verfa&szlig;t ist. Auch die
Bedienoberfl&auml;che des Programms ist nur englisch. Auf die F&auml;higkeiten von
ImageStudio einzugehen w&uuml;rde jedoch den Rahmen dieses Testberichtes sprengen.
Vielleicht widmen wir uns in einer der n&auml;chsten Ausgaben speziell diesem
Programm.</P>

<P ALIGN=CENTER><A NAME="12" HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>
Ausstattung der Testrechner:</P>

<P>Amiga 4000, AmigaOS 3.1<BR>
Prozessorkarte CyberStorm MK II, MC 68060, 50MHz<BR>
2 MB Chip, 16 MB Fast RAM<BR>
4 GB SCSI-II Festplatte<BR>
Picasso IV Grafikkarte, Picasso 96 Treibersoftware<BR>
Ariadne Netzwerkkarte<BR>
A2368 SX Br&uuml;ckenkarte</P>

<P>Amiga 4000, Amiga OS 3.0<BR>
Prozessor MC 68040, 25 MHz<BR>
2 MB Chip, 16 MB Fast RAM<BR>
1 GB IDE Festplatte<BR>
CyberVision 64 Grafikkarte, CyberGrafix Treibersoftware<BR>
A2065 Netzwerkkarte</P>

<P>CD&#179;&#178; mit SX 32, Amiga OS 3.1<BR>
2 MB Chip, 8 MB Fast RAM<BR>
170 MB IDE Festplatte</P>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#thomas">Thomas &Ouml;llinger</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x000A.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/drawstudio_1.gif">Drawstudio Screenshot 1</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/drawstudio_2.gif">Drawstudio Screenshot 2</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/drawstudio_maus.jpeg">Die sch&ouml;ne originale Commodore-Maus!</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/drawstudio_maus.dsdr">Die Maus zum Downloaden im DSDR-Format!</A> (shift-click!)<BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp;
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0009.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x000B.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
