<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x00 - CygnusEd</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0008.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0007.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0009.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0007.html">Art Effect</A> | <A HREF="0x0008.html">Cygnus Ed</A> | <A HREF="0x0009.html">Fusion</A> | <A HREF="0x000A.html">Draw Studio</A> | <A HREF="0x000B.html">p.OS</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0001.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0002.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0003.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0004.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0005.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0007.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x000C.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x000D.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x000E.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x000F.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0011.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>CygnusEd V4.2 Professional</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Unglaublich, es vergehen Jahre um Jahre und man
wundert sich, warum denn kein Update des schnellsten Editors der Welt
erscheint. Und auf einmal kommt aus heiterem Himmel eine Ank&uuml;ndigung
und wenige Wochen sp&auml;ter bereits die Vollversion - rechtzeitig zu
CygnusEd's 10j&auml;hrigen Jubil&auml;um. </FONT><BR>

<P ALIGN=CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Seit 1991, als mir zum Arbeiten noch ein Amiga 500 ohne Harddisk(!)
gen&uuml;gte, benutze ich nun Ced. Textvorlagen f&uuml;r Dokumente schaffen, mein
Log-Buch schreiben, Binaries betrachten, Homepages
erstellen - Wer braucht schon einen HTML-Editor? - Newsposts verfassen,
Mails schreiben, Sourcecodes tippen, ja sogar wenn ich wei&szlig;, da&szlig; ich diesen
oder jenen Text einmal in eine Textverarbeitung hineinladen werde, schreibe
ich ihn bis zur vollst&auml;ndigen Fehlerkorrektur im Ced. Kurz gesagt, es kommt
mir auch kein Programm, das einen externen Editor benutzt, um den Ced
herum.</P>

<P ALIGN=CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Genug der Lobeshymnen, ich wende mich nun dem Produkt an sich zu. Auf
der CD befinden sich nebst CygnusEd auch noch eine Menge Arexx-Scripts,
bzw. Programme, die mit Hilfe von Ced erstellt wurden, wie zum Beispiel
RDB-Salv V1.1, Term V4.8, MakeCD V2.5, Filer V4.04, Barfly V1.28, Beyond
The Dark V1.10, und noch andere mehr! Schon alleine dies sollte die
Hemmschwelle, &quot;sich fuer einen Editor gar eine ganze CD zu kaufen&quot;, sehr
herabsetzen, denn jedes der beiliegenden Programme l&auml;&szlig;t sich ohne Probleme
installieren. leider war ja CygnusEd eines der (z.B. neben DeluxePaint) am
&ouml;ftesten raubkopierten Programme...</P>

<P ALIGN=CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>So, und jetzt ist mir endlich ein negativer Punkt zu CygnusEd
aufgefallen: Fr&uuml;her konnte man Abs&auml;tze neu formatieren, allerdings f&uuml;gte Ced
nach jedem Satzzeichen gerne 2 Leerzeichen ein - nun kann man die
Anzahl der nachfolgenden Leerzeichen frei einstellen! Leider wird dieser Wert 
nicht gespeichert. Mein Vorschlag, da ja die Men&uuml;s von Ced so angepa&szlig;t
sind, da&szlig; sie auch auf einem NTSC 320x200-Screen nicht abgeschnitten werden
- ja, Ced lief in der alten Version sogar noch unter Kickstart 1.2 - w&auml;re
folgender: Diesen Men&uuml;punkt bei &quot;Global&quot; einf&uuml;gen, und daf&uuml;r
&quot;Global-Zifferntasten...&quot; nach &quot;Datei&quot; verlegen. Neu ist au&szlig;erdem, da&szlig; die
Men&uuml;s der Fenster nicht mehr mit dem &quot;System-Texte&quot;-Font, sondern mit dem
&quot;Andere Texte&quot;-Font (aus Prefs:Fonts) dargestellt werden. Gar nicht einmal
so dumm! Nur wenn man einen proportionalen Font verwendet, sind die Men&uuml;s
nicht mehr ganz so ultraschnell wie mit Topaz-8. Hoppla, da hatte ich ja
tats&auml;chlich f&uuml;r einen 4-Farbigen EditorBildschirm meinen
24Bit-WorkbenchScreen geclont - was f&uuml;r eine Vergeudung! Schaltet man
auf Farbtiefe 8Bit um, so flitzen die Men&uuml;s wieder wie gewohnt dahin!
:-)</P>

<P ALIGN=CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Das Programm kommt komplett in Deutsch daher, das Manual in Englisch.
Verflixt, es h&auml;tte genau umgekehrt sein sollen (Anm: Localisation auf
CD vorhanden)! Naja egal, was gibt es also zu sagen? Also, auf den ersten
Blick sehen die Unterschiede zum CygnusEd V3.5 recht gering aus, aber einer
ist bereits sehr gravierend: Endlich kann CygnusEd auf allen
Grafikkarten-Screens ohne Grafikfehler ge&ouml;ffnet werden, es ist schon
komfortabel, auf einem 57x80-Zeichen Screen zu arbeiten (und das mit
640x480!). Oder wie w&auml;re es mit 95x130 Zeichen? So bekommt man
schlie&szlig;lich doch jedes noch so &quot;breite&quot; C-Listing in den
Griff! Die Scrollingroutinen sind schnell wie eh und je, man kann nun
alternativ zu den &quot;hauseigenen&quot; auch System-Scrollroutinen
einstellen, bzw. den Screen als Public-Screen &ouml;ffnen - hier spricht
Ced dann nicht mehr direkt den Blitter an.</P>

<P ALIGN=CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Ein Teil der Feature-List:</P>

<DL><DT></DT>
<DD><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Search/Replace-Requester unterst&uuml;tzen Escape-Sequenzen (\n, \t,..)
<BR><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Grenzenloses Undo/Redo, Delete/Undelete
<BR><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Suchen von 100.000 Chars/Sekunde bereits auf einem 68000er!
<BR><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> 32.000 Chars pro Zeile
<BR><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Cursorposition kann in Icons gespeichert werden
<BR><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> MetaMac - eigener Macro-Editor mit GUI
<BR><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> neue Arexx Befehle und eine komplette Referenz (!) im Manual
<BR><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> konsequentes &quot;drag and drop&quot;, AppWindows, AppMen&uuml;s
<BR><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> PicassoII, CyberGraphics und Picasso96 Unterst&uuml;tzung
<BR><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> RecoverCEDFiles - rettet Files nach einem Absturz
<BR><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> optimierte 68020er Version
<BR><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Dokument-Gr&ouml;&szlig;e nur durch Speicher begrenzt (z.B. 18MB...)
<BR><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Bl&ouml;cke einr&uuml;cken, Bl&ouml;cke l&ouml;schen (direkt aus dem Speicher)
<BR><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Spaces in Tabs umwandeln, Tabs als Spaces darstellen
<BR><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> zur Stelle der letzten Handlung zur&uuml;ckspringen
<BR><IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Finde zugeh&ouml;rige Klammern, HTML-Tags und C-Kommentare (/* -- */)
</DD></DL>

<P ALIGN=CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Zum Undo/Redo: Es l&auml;uft ja auch immer ein Counter mit, der die
Ver&auml;nderungen am File mitspeichert. Dieser ist so intelligent, da&szlig; er z.B.
ein &quot;Copy&quot; nicht als Ver&auml;nderung ansieht (klar!), und wenn ein File
gespeichert wird, dann wird der Counter resettiert. Wenn man nun weitere
&Auml;nderungen zur&uuml;cknimmt, wird der Z&auml;hler negativ. So sieht man immer, wie
&quot;weit&quot; man von der zuletzt geladenen Version &quot;entfernt&quot; ist. Praktisch,
wenn man ein File schon 20 mal gespeichert hat, und wissen will, wie es
ganz am Anfang ausgesehen hat.</P>

<P>Aktivierung &uuml;ber Hotkey: Ced kann beim Verlassen ein AppIcon oder einen
Eintrag im Tool-Men&uuml; der Workbench erzeugen, sowie &uuml;ber einen Hotkey immer
aktiviert werden: Einfach feste mit der Faust auf's Keyboard hauen und
schauen, da&szlig; man die Tasten Alt-Shift-Return erwischt - ist ganz einfach -
schon springt Ced auf den Schirm. Files k&ouml;nnen hinzugeladen werden, wenn
man sie aktiviert und dann den Men&uuml;punkt (im Tool-Men&uuml;) anw&auml;hlt, oder man
zieht sie auf das AppIcon. H&auml;lt man dabei Shift gedr&uuml;ckt, werden die Files
an der aktuellen Cursorposition eingef&uuml;gt, sonst wird ein eigener View
f&uuml;r das File erzeugt - Ced unterst&uuml;tzt verschiedene Views von
verschiedenen Files und auch ein File kann (z.B. &quot;Amiga-d&quot; =
Split View) unter mehreren Ansichten betrachtet werden - h&auml;lt man bei
diesem &quot;drag and drop&quot; Control gedr&uuml;ckt, so werden die
Filenamen (getrennt durch LF) eingef&uuml;gt!</P>

<P ALIGN=CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Voreinstellungen: Ced speichert zu Files mit einer beliebigen Extension
seine Voreinstellungen mit, so wird beim Editieren eines HTML-Files
ceddefaults.html geladen, ansonsten ceddefaults, wenn kein passendes
ceddefaults.(Extension) gefunden wurde. Weiters k&ouml;nnen auch verschiedene
Views eigene Voreinstellungen haben, auch wenn es sich um ein und dasselbe
Ced handelt, auf dem sie dargestellt sind. Klickt man auf einen anderen
View, werden die Voreinstellungen angepa&szlig;t - der Benutzer merkt es nicht
einmal. So kann man bequem ein Html-File und ein Text-File nebeneinander
bearbeiten und hat z.B. fuer das Bearbeiten des Html-Files Umbruch
abgeschaltet, fuer Bearbeitung des Textfiles Tabs=12, Umbruch aktiviert,
rechter Rand=74 - es funkt prima!</P>

<P>Makros: Ich will hier nicht gro&szlig;artig Reden schwingen, darum ein
einfaches Beispiel: Jemand hat ein Textfile, will es nach HTML konvertieren
und alle Abs&auml;tze, getrennt durch 2 Linefeeds, in umgekehrter Reihenfolge in
dem Html-File gespeichert haben: Als Vorbereitung: Amiga-) und zwei CRs in
Serie markieren mit Amiga-c. In die erste Zeile, schon geht's los: Amiga-m,
F10, Amiga-R, Amiga-v, TAB, Amiga-v, zum Anfang der Zeile, &lt;, /, P,
&gt;, zum Ende der Zeile, &lt;, P, &gt;, Return, t, Return, Amiga-m. Das
war das erste Makro zum umwandeln der Abs&auml;tze, nun Numero Deux: Amiga-m,
F9, Control-Down, Amiga-a, Amiga-a, 2x Left, Amiga-b, Amiga-s, 2x Left,
Amiga-x, Control-Up, Amiga-v, Amiga-m. Wie man sieht, ist mit Arexx-, Dos-
und Makrobefehlen (fast) alles m&ouml;glich, au&szlig;er Kaffeekochen.</P>

<P ALIGN=CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Ansicht: Hier kann man zum Beispiel die Statuszeile ein/ausblenden
(statt Name werden dann Zeilen, Gr&ouml;&szlig;e und Ver&auml;nderungen angezeigt,
wahlweise auch Seiten), bzw. statt der Anzeige der LWIT-Tags kann der
ASCII-Wert des aktuellen Zeichens eingeblendet werden. Rollbalken k&ouml;nnen
links, rechts oder gar nicht gesetzt werden (wegen OS 2.04-Bug: Die Mausspitze
konnte nicht ganz zum rechten Rand bewegt werden). Weiters kann man den
Bereich definieren, wo noch nicht gescrollt werden darf. Sobald dieser
Bereich nach rechts/links/oben/unten &uuml;berschritten wird, wird sanft
weitergescrollt.</P>

<P>Scrollen: &quot;Keiner scrollt sanfter und schneller&quot; k&ouml;nnte ein Werbeslogan
f&uuml;r CygnusEd hei&szlig;en: Und in der Tat, mit dem Scrolling zu spielen, ist fast
schon so lustig, wie mit dem Programm &quot;PicassoMode&quot; ScreenSettings
einzustellen ;-). Man versuche folgendes: Ein langes File mit viel Text
einladen, CursorDown gedr&uuml;ckt halten. Nun nehme man abwechselnd Alt, Shift,
oder beides dazu - Scrollen in 4 Geschwindigkeiten! Berechnet man dazu, da&szlig;
man 3 Arten von Scrollroutinen und 4 Arten von Scrollweiten einstellen
kann, macht das insgesamt 48 Scrollgeschwindigkeiten!</P>

<P ALIGN=CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Und sonst so...: Zu alledem kann man noch in Ced Sprungmarken setzen,
zugeh&ouml;rige Klammern finden (wichtig bei verschachtelten Funktionen!),
ASCII-Werte direkt eingeben, Rotieren (13), CRs entfernen, Worte in
Klein/Gro&szlig; umwandeln, Case vertauschen, Bereiche in Such- oder
Ersetz-Puffer direkt einf&uuml;gen, das Standardpiktogramm &auml;ndern, zwischen 3
Speicherungsarten (simple, safe, .bak) w&auml;hlen, und vieles mehr, aber wer
hat bis hierher gelesen und nicht schon l&auml;ngst zum Telefon gegriffen um
die neue Version von CygnusEd zu bestellen - was, <B>Sie?</B> Unglaublich,
meint jedenfalls...</P>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#lutz">Bernhard Lukas</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0008.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.pointdesign.com/">PointDesign</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/ced_red.gif">View-Mania</A> in Red...<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/ced_esgruent.gif">Es gr&uuml;nt so gr&uuml;n</A> wie Spanien's G&auml;rten bl&uuml;h'n!<BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0007.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0009.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
