<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x00 - Fusion</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0009.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0008.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x000A.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0007.html">Art Effect</A> | <A HREF="0x0008.html">Cygnus Ed</A> | <A HREF="0x0009.html">Fusion</A> | <A HREF="0x000A.html">Draw Studio</A> | <A HREF="0x000B.html">p.OS</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0001.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0002.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0003.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0004.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0005.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0007.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x000C.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x000D.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x000E.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x000F.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0011.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>(Shape)shift to Fusion ??</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Seit dem Erscheinen des PD MAC Emulators
Shapeshifter wurde es kommerziellen Apple Emulatoren am Amiga nicht gerade
leicht gemacht. Nach dem wenig erfolgreichen EMPLANT holt Jim Drew jetzt
mit dem Fusion zum Gegenschlag aus. Wie gut seine Chancen stehen, haben wir
uns angesehen. </FONT><BR>

<P ALIGN=CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Installation: Der Fusion, wir haben schon die neue V2.0 getestet, wird
in einer CD-H&uuml;lle mit veraltetem Aufdruck und ohne Handbuch
ausgeliefert. Der erste negative Eindruck wird leider beim &Ouml;ffnen der
CD-H&uuml;lle best&auml;rkt: In der H&uuml;lle befindet sich nur eine
Diskette, daf&uuml;r aber mit einer netten Auswurfmechanik.</P>

<P>Die Installation erfolgt &uuml;ber den Amiga Installer und l&auml;uft
problemlos ab. Am Ende der Installation wird, wie auch bei den anderen MAC
Emulatoren, in der startup-sequence ein kleines Programm installiert, das
einen f&uuml;r die Emulation ben&ouml;tigten Speicher im untersten
Speicherbereich des Computers reserviert (rsrvwarm). Laut Readme auf der
Fusion Diskette soll dieses Programm auch noch mit dem Emplant kompatibel
sein. Nach einem Reset sollte dem neuen Applevergn&uuml;gen nichts mehr im
Wege stehen.</P>

<P ALIGN=CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Doch ganz so paradiesisch ist es leider doch nicht. Die erste H&uuml;rde
unserer Testinstallation war ein set040 in der startup-sequence, mit dem
sich der Fusion offensichtlich nicht vertr&auml;gt (Guru Meditation beim
Booten). Doch erst jetzt wird die Sache wirklich kompliziert, es folgt nun
die ...</P>

<P>Konfiguration: Wer schon einmal den aus dem gleichen Haus (Microcode
Solutions) stammenden PCx gestartet hat tut sich mit der auf 10 Seiten
aufgeteilten Konfiguration schon leichter, alle anderen sollten sich die
ausf&uuml;hrliche aber englische Dokumentation zu Gem&uuml;te f&uuml;hren.
Konfigurationsfehler werden n&auml;mlich vom Fusion meistens nur mit einem
totalen Versagen ohne jegliche Fehlermeldung quittiert. Daf&uuml;r darf man
auch gleich den ganzen Amiga neu starten, da sich auch auf der Workbench
nichts mehr tut. :-(</P>

<P ALIGN=CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Nach einigen erfolglosen Startversuchen wurder der
Haupt&uuml;belt&auml;ter im Bereich der Device Optionen gefunden. Wird dem
Fusion keine &quot;brauchbare&quot; Partition zur Verf&uuml;gung gestellt
geht gar nichts mehr .....</P>

<P>Erfreulich hingegen ist die M&ouml;glichkeit, eine vorhandene
Shapeshifter Partition, wenn auch nur mit einem Trick, weiter f&uuml;r den
Fusion n&uuml;tzen zu k&ouml;nnen: Der Fusion kann nur vom Amiga gemountete
Partitionen verwenden. Daher mu&szlig; die Shapeshifter Partition zuerst in
der HD Toolbox als mountable gekennzeichnet werden.(Vorheriges Sichern der
MAC Daten nicht vergessen!!!) Nach einen Reboot scheint die MAC Harddisk im
Fusion Device Fenster auf und kann als Fusion Harddisk konfiguriert
werden.</P>

<P>Dies gilt aber auch f&uuml;r alle anderen Partitionen, die man vom
Fusion aus nutzen will: Ohne sie vorher unter AmigaOS zu mounten findet der
Fusion sie nicht in seinem Konfigurationsfenster. Einmal als Fusionharddisk
konfiguriert kann man die Partition aber wieder als nicht mountable
eintragen und erspart sich das Icon auf der Workbench.</P>

<P ALIGN=CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Wie der Shapeshifter unterst&uuml;zt der Fusion auch die Emulation der
Harddisk in einer AmigaOS Datei. Das Verwenden einer Shapeshifer Filedisk
f&uuml;r den Fusion soll laut Informationen aus dem Netz funktionieren, in
der Praxis scheiterte es aber an der M&ouml;glichkeit im Fusion eine
Filedisk mit exact der gleichen Gr&ouml;&szlig;e wie unter dem Shapeshifter
einzurichten.</P>

<P>Auch die Konfiguration der Videotreiber ist nicht ganz so einfach. Es
stehen hier die unterschiedlichsten Treiber, von B/W auf der Workbench bis
zu Truecolor auf Picasso96 oder CyberGraphX zur Verf&uuml;gung. Weiters
wird zwischen DirectXL und Refresh Treibern unterschieden. Die direkt
Treiber k&ouml;nnen kein Truecolor, verbrauchen daf&uuml;r aber auch kein
kostbares Chipram. </P>

<P ALIGN=CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Weiters gibt es noch Men&uuml;s zur Konfiguration von CD-ROM, Audio
(hier wird auch AHI unterst&uuml;tzt), SCSI, Netzwerkkarte, Floppy, dem
verwendeten MAC ROM Image (256kb bis 1 MB) und den IO Ports. In der
Dokumentation wird ein ROM mit 512kb oder 1 MB empfohlen.</P>

<P> Auch bei der Speicherkonfiguration zeigt sich der Fusion sehr
vielseitig: Neben der Gr&ouml;&szlig;e des zugeteilten Speichers wird hier
die Verwendung der MMU gesteuert (z.B. um Speicher in den ZorroII Bereich
zu mappen oder gar die MMU zur Steuerung des Virtuellen Speichers zu
nutzen). Der dem MAC zugeteilte Speicher kann hier auch gleich mittels
einem integrierten Speichertest &uuml;berpr&uuml;ft werden.</P>

<P>In einem weiteren Men&uuml;punkt wird auch noch der emulierte MAC, sowie
die Priorit&auml;ten der Emulation im Vorder-und im Hintergrund
geregelt.</P>

<P>Mit dem Button [Start Emulator] wird der virtuelle MAC nach
erfolgreicher Konfigurierarbeit zum Leben erweckt.</P>

<P ALIGN=CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Nach dem Start &auml;ndert sich das Konfigurationsmen&uuml; am
Workbenchbildschirm um und erlaubt nun die Kontrolle der Emulation. Von
hier aus kann man MAC Partitionen f&uuml;r den Amiga mounten, den Emulator
(unsanft) beenden und die Einstellungen f&uuml;r CPU Cache und
Grafikrefresh &auml;ndern. Auch am MAC abgemeldete Devices lassen sich hier
erneut anmelden.</P>

<P>Als Betriebssystem ben&ouml;tigt der Fusion MAC OS 7.1 bis 8.0.
Empfohlen wird aber MAC OS ab Version 7.5.1.</P>

<P ALIGN=CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Von unserer auf der Shapeshifter Partition installierte Version 7.5.1
bootet der Fusion ohne Probleme, einzig die Aufl&ouml;sung und die
Farbtiefe mu&szlig;ten neu eingestellt werden.Hier f&auml;llt vor allem die
flexible Bildschirmverwaltung auf.Wie auch bei einem echten MAC
l&auml;&szlig;t sich beim Fusion die Aufl&ouml;sung und die Farbtiefe
direkt im Betrieb ohne Neustart umschalten. Werden mehrere
Grafikkartentreiber konfiguriert k&ouml;nnen auch mehrere Bildschirme in
unterschiedlichen Aufl&ouml;sungen und Farbtiefen, ja sogar auf
verschiedenen Grafikkarten (unter Picasso96), verwendet werden. Laut
Dokumentation sind maximal 6 Bildschirme m&ouml;glich, in der Praxis gibt
es aber ab 3 Bildschirmen Grafikfehler, vor allem wenn diese Bildschirme
&uuml;ber das Kontrollfeld Monitor untereinander angeordnet werden. Das
Umschalten zwischen den Bildschirmen erfolgt MAC-like durch Verlassen des
aktuellen Bildschirms mit den Mauszeiger. Werden mehrere Screens auf
derselben Grafikkarte verwendet, wird blitzschnell auf den neuen Screen
umgeschaltet. So l&auml;&szlig;t sich z.B. ein 256 Farben Schirm zum
Arbeiten und ein Truecolor Bildschirm zum Anzeigen der fertigen Bilder
verwenden.</P>

<P>Richtig interessant wird aber die M&ouml;glichkeit ab Fusion 2.0 MAC OS
8.0 zu verwenden. Hier mu&szlig; aber eine MAC OS Vollversion verwendet
werden. Die einem neuen MAC beigepackte Version l&auml;uft nicht auf dem
Fusion.</P>

<P ALIGN=CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>In unserem Testrechner ist eine CyberStorm040/40 eingebaut, die mit dem
MAC OS 8.0 keinerlei Probleme hatte. Laut Dokumentation l&auml;uft am
Fusion OS 8.0 auch auf 68030 und 68060 Prozessoren, auf letzteren leider
nicht im SuperScalar Modus. Dies ist aber ein Problem des MAC OS und
l&auml;&szlig;t sich nat&uuml;rlich auch durch die Emulation nur sehr
schwer beheben.</P>

<P>Im Gegensatz zum Shapeshifter gibt es am Fusion auch fast keine Probleme
mit dem CyberSCSI Device. Lediglich unser internes SCSI ZIP Laufwerk
bereitete kleine Probleme, die sich aber durch ein Mounten der ZIP Disk vor
dem Start des Fusion beheben lie&szlig;en. Auch die CD-ROM Emulation (im
Testrechner wurde ein Toshiba XM5701 verwendet) klappte auf Anhieb, einzig
Audio CD-ROM`s werden vom Fusion (noch) nicht erkannt.</P>

<P>Die im Testrechner installierte ConneXtion Ethernetkarte (im A2065
Modus) lie&szlig; sich vom MAC aus nicht verwenden, ein Zugriff auf die
Karte wurde mit einem Totalabsturz quittiert.</P>

<P>Ohne Probleme hingegen funktionierte die Einbindung der Multiface III.
&Uuml;ber ein daran angeschlossenes USR 33.6er Modem und den im OS8.0
integrierten TCP/IP Stack gelang uns auf Anhieb die Einwahl ins Internet.
Auch der &uuml;ber die parallele Schnittstelle der Multiface angeschlossene
HP Deskjet lieferte &uuml;ber den passenden MAC Treiber ein einwandfreies
Druckergebnis.</P>

<P ALIGN=CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Folgende Software wurde am Fusion getestet und lief ohne Probleme: Adobe
Photoshop 3.0, QuarkXpress3.2, Netscape Navigator 3.0, Photo Flash, sowie
einige Spiele.</P>

<P>Durch die nicht besonders hohe Rechenleistung der 68040 CPU ist ein
Abspielen von Filmen in 32000 Farben mit gleichzeitiger Ausgabe von 16 Bit
Stereosound &uuml;ber die Concierto nicht mehr ganz ohne St&ouml;rungen im
Film m&ouml;glich. Auf einem 68060 sollte dies aber ruckfrei
funktionieren.</P>

<P ALIGN=CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Fazit: Der Fusion ist ein, von der umst&auml;ndlichen Konfiguration
einmal abgesehen, problemloser MAC Emulator. Vor allem f&uuml;r Besitzer
einer Phase5 SCSI Hardware ist er empfehlenswert, hier treten weitaus
weniger Kompatibilit&auml;tsprobleme als beim Shapeshifter auf. Auch kann
mit dem Fusion einer schon vorhandenen alten MAC Emulatorhardware neues
Leben eingehaucht werden. Besonders erfreulich ist die Ank&uuml;ndigung
einer PPC Version. Damit soll es PowerUP Besitzern m&ouml;glich sein, einen
modernen MAC mit PowerPC CPU zu emulieren.</P>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#dieter">Dieter Sabathi</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0009.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.ctaz.com/~msdei/FUSION/FUSION.html">Fusion</A>-Page<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/fusion_device.gif">Fusion Devices</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/fusion_device_1.gif">Fusion Device Prefs</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/fusion_device_2.gif">Fusion Device Prefs</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/fusion_memory.gif">Fusion Memory Prefs</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/fusion_video.gif">Fusion Video Prefs</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/fusion_vergleich.gif">Fusion VS ShapeShifter</A><BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0008.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x000A.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
