<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x00 - Computer 97 Special</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x000E.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x000D.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x000F.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=100 HEIGHT=25 SRC="../images/_special_.gif" ALT="[Special]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="#03">Phase5</A> | <A HREF="#04">VillageTronic</A> | <A HREF="#05">Micronik</A> | <A HREF="#06">IrrSee</A> | <A HREF="#07">Haage Und Partner</A> | <A HREF="#08">DCE</A> | <A HREF="#09">Index Information</A> | <A HREF="#11">Amiga International</A> | <A HREF="#12">Resumee</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0001.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0002.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0003.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0004.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0005.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0007.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x000C.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x000D.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x000E.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x000F.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0011.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>K&ouml;ln:Computer 97</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Wie jedes Jahr fand auch heuer wieder vom 14.-16.
November die Computer97 - die Amiga Messe schlecht hin - in K&ouml;ln
statt. Da&szlig; sie &uuml;berhaupt stattfand, k&ouml;nnen wir der Rettung
des Amiga in letzter Sekunde verdanken. Wie die Messe besucht war und wie
die allgemeine Stimmung auf der Messe war, lesen Sie hier. </FONT><BR>

<P ALIGN=CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P ALIGN=CENTER><A HREF="../images_00/c97_01.jpeg"><IMG SRC="../images_00/c97_01.jpeg" WIDTH=400 HEIGHT=180 ALT="[K&ouml;ln - die Messe]" BORDER=0></A></P>

<P ALIGN=CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P> Gleich vorweg: Die Stimmung auf der Messe war durchwegs positiv und
auch durch Optimismus gekennzeichnet. Im Gegensatz zum vorgigen Jahr war
die Messe in einer gr&ouml;&szlig;eren Halle untergebracht und es kamen
wesentlich mehr Besucher und Aussteller. Sowas wie Leerfl&auml;chen
zwischen den St&auml;nden (wie letztes Jahr) gab es diesmal nicht. Alle
gro&szlig;en Namen der Amiga Szene waren anwesend, wenn auch davon nur mehr
eine Hand voll &uuml;brig geblieben ist.</P>

<P ALIGN=CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Phase 5</B> war da und zeigte seine PowerPC basierenden Beschleuniger
boards. Derzeit ist die CyberStormPPC f&uuml;r den Amiga 4000 (und Amigas
mit kompatiblem CPU Slot) erh&auml;ltlich. Die kleineren Geschwister
f&uuml;r den A1200, das Blizzard 603, die Version f&uuml;r den A2000
(Blizzard 2604) sowie die CyberVision(s) f&uuml;r die PowerUp boards waren
noch nicht zu sehen. Obwohl die Blizzard 603e zum Zeitpunkt des Erscheinens
dieses Artikels wohl schon zu haben sein wird. In einer n&auml;chsten
Ausgabe werden wir einen Praxisbericht der CyberStormPPC im Einsatz in
einem A3000 bringen und auch die Softwareunterst&uuml;tzung beleuchten.</P>

<P ALIGN=CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>VillageTronic</B> hatte einen etwas kleineren Stand und
verw&ouml;hnte den Messebesucher mit Aktionspreisen, die den H&auml;ndlern
wohl den Schwei&szlig; auf die Stirn trieb. Eine Picasso IV war schon um DM
545,-zu haben! Dazu wurden die neuen Add-On-Module f&uuml;r die Picasso IV
gezeigt. Mit dem Video IN Modul PalomaIV kann man in einem Fenster ein
Live-Videobild betrachten. Die Darstellung erfolgt dabei immer mit der
vollen Farbanzahl, selbst wenn die Workbench nur unter 256 Farben
l&auml;uft. Zudem l&auml;&szlig;t sich die Gr&ouml;&szlig;e des Fensters
frei varieren ohne die Darstellungsgeschwindigkeit zu beeintr&auml;chtigen.
Mit dem Vidoe OUT Modul PabloIV (der Nachfolger des von der PicassoII
bekannten Pablo) kann die Picasso nun ihre Grafikdaten an einen
Videorekorder weitergeben. Somit steht einer Aufzeichnung von
Videosequenzen, die auf der PicassoIV abgespielt werden, nichts mehr im
Wege. Das Sound Modul ConciertoIV bietet 16 Bit Stereo Sound zum kleinen
Preise - wenn auch leider nur als AddOn f&uuml;r Besitzer der PicassoIV
Karte. Das Modul unterst&uuml;tzt den offenen Treiberstandard AHI und
l&auml;&szlig;t sich so in zahlreichen Anwendungen ohne gro&szlig;en
Aufwand einsetzen. Au&szlig;erdem kann dieses kleine Ding neben Sound
wiedergeben auch Sound digitalisieren. Einen Test der Concierto werden wir
in einer n&auml;chsten Ausgabe bringen.</P>

<P ALIGN=CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Micronik</B> &uuml;berraschte die Messebesucher mit einer kleinen
Revolution im Amiga Sektor. Sie zeigten einen Prototyp einer Busplatine
f&uuml;r den Amiga 1200, die neben einem CPU Slot (kompatibel zum A4000,
damit l&auml;uft die CyberStorm (PowerPC) Karte im A1200), 5 Zorro II/III
Steckpl&auml;tzen, einem SCSI-2 Controller und einem (optionalen) Videoslot
auch noch aktive PCI Steckpl&auml;tze beinhaltet. Erstmals lassen sich so
Standard (PC-)Komponenten wie Grafikkarten, Netzwerkkarten etc. im Amiga
verwenden. Man darf gespannt sein, wie die Software Hersteller darauf
reagieren und ob sie in der Lage sind, entsprechende PCI Treiber f&uuml;r
den Amiga zu erstellen. Grafiktreiber f&uuml;r Cybergraphics bzw. Picasso96
sind bereits angek&uuml;ndigt.</P>

<P ALIGN=CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>IrseeSoft</B> stellte die aktuelle Version von TurboPrint 6 und der
Bildverabeitungssoftware Picture Manager 5 vor. TurboPrint hat einen
Spooler verpa&szlig;t bekommen und kann nun endlich im Hintergrund drucken.
Beide Programme versprechen durch optimierte PowerPC-Unterst&uuml;tzung
atemberaubende Geschwindigkeit.</P>

<P ALIGN=CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Haage&amp;Partner</B> zeigte seine gesamte Produktpalette, darunter das
neue Tornado3D, die aktuelle Version 3.3 des DTP-Klassikers PageStream,
ArtEffekt 2.5 sowie den StormC Compiler in der aktuellen Version 3.0.
Leider war Merapi, die Amiga Version von Sun's JAVA noch nicht fertig. Mit
Merapi wird es erstmals m&ouml;glich sein, Programme, die f&uuml;r eine
andere Platform geschrieben wurden, auf dem Amiga ablaufen zu lassen. Eine
Java Version einiger Office Pakete gibt es bereits. Diese w&uuml;rden eine
L&uuml;cke im Amiga Software Markt schlie&szlig;en. Merapi wird als
shared.library implementiert und &uuml;bernimmt das Abarbeiten von in Java
geschriebenen Programmen. Merapi soll eventuell noch dieses Jahr
fertiggestellt werden. Au&szlig;erdem &uuml;berzeugte Haage&amp;Partner mit der
Demonstration einer (illegalen) Version des PC Klassikers <B>Quake</B> auf
dem Amiga. Dazu wurde das WarpUp PowerPC Kernel von Haage&amp;Partner
eingesetzt. In Punkto Geschwindigkeit stand diese Version der PC Version -
mit Pentium-Rechenleistung! - in nichts nach.</P>

<P ALIGN=CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>DCE</B> Zeigte auf der Computer97 erstmals ihren neuen Amiga Clone
A5000, hier noch in der Version mit 68030/50MHz Prozessor. Man konnte sich
von der Fuktionst&uuml;chtigkeit des Rechners selbst &uuml;berzeugen. Der
Preis f&uuml;r einen vollst&auml;ndig ausger&uuml;steten Rechners mit 10-24
fach CD ROM, 1.7 GB Festplatte, Diskettenlaufwerk, Tastatur, Maus, RAM (2
MB Chip, 16 MB Fast) im Minitower Geh&auml;use sollte nicht mehr als DM
1.500,- ausmachen. Der endg&uuml;ltige Rechner soll aber lt. letzten
Informationen mit 68040/25-40MHz daherkommen und ab DM 1.600,- ab M&auml;rz
1998 erh&auml;ltlich sein. N&auml;here Infos in unserem News Teil.</P>

<P ALIGN=CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Index Information</B>, in Zusammenarbeit mit BlitterSoft UK., zeigten
ebenfalls ihre Amiga Clones. Der Access ist ein Amiga Clone mit AGA
Chipsatz und 020er Prozessor. Das Board ist so klein, da&szlig; es in einen
5¼" Einschub eines Towergeh&auml;uses pa&szlig;t. Index gibt als Zielgruppe
Kiosk- und Informationssysteme an. Neben dem Acces wurde auch das Boxer
Motherboard gezeigt. Das Boxer board setzt als CPU einen 68040 oder 68060
Prozessor ein und verkraftet Taktfrequenzen zwischen 25 und 75 MHz. Die
Platine pa&szlig;t in ein Standard Baby AT Geh&auml;use (kein ATX !) und
beinhaltet 4 Zorro II/III-, 1 Video-, 1 abgespeckten Video/Genlock- und 2
aktive ISA (!) Steckpl&auml;tze. Au&szlig;erdem befindet sich der AGA
Chipsatz auf dem Board. Als Eingabeger&auml;t l&auml;&szlig;t sich
wahlweise eine PC- oder Amigatastatur einsetzen. Die Platine alleine - ohne
CPU etc - soll so um die DM 1.000,- kosten. Wann sie erh&auml;ltlich sein
wird, konnten wir noch nicht in Erfahrung bringen.</P>

<P ALIGN=CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Au&szlig;erdem wurde noch <B>Reflections</B> in einer PowerPC Version
gezeigt, Ossowskis Schatztruhe verkaufte neue Versionen des Klassikers
<B>Cygnus Ed 4</B> und <B>TurboCalc Version 5</B>, das nun auch Excel
Tabellen direkt laden kann.</P>

<P ALIGN=CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Zum Schlu&szlig; noch zu <B>Amiga International</B>. Erfreulich war,
da&szlig; endlich wieder die Mutter des Amiga auf der Messe vertreten war.
Das gab den Beteiligten und auch den Besuchern wieder ein wenig Hoffung
f&uuml;r die Zukunft. Es wird neue Produkte geben und der Markt hat wieder
ein Zugpferd bekommen. Allerdings war von einer gro&szlig;en
Ank&uuml;ndigung zur Computer 97 nicht viel zu sehen. Jedoch mu&szlig; man
AI zu gute halten, da&szlig; sie bem&uuml;ht sind, den Amiga nicht nur am
Leben zu erhalten, sondern auch weiter zu entwickeln. Wahrscheinlich hat
die Zeit seit der &Uuml;bernahme noch nicht ausgereicht, um gro&szlig;e
Spr&uuml;nge zu machen. Die Kernaussage auf der Messe war, da&szlig; man
bis Anfang 1998 eine neue Version des Betreibssystems (V 3.5) herausgeben
und bis Ende 1998 eine neue Amiga Platform definieren will. Amiga, Inc.,
die neu gegr&uuml;ndete Tochter von Gateway2000, mit dem Sitz in den USA,
wird die Entwicklung neuer Amiga Produkte &uuml;bernehmen. Das Spektrum
reicht von Kleincomputern (SetTop Boxen) (als Konkurrenz zu WindowsCE) bis
zu Desktop Systemen. Amiga, Inc. will aber selbst keine Rechner
produzieren, sonder durch Referenzsysteme Vorgaben schaffen, die
Fremdhersteller unter Lizenz fertigen sollen. Diesen Weg best&auml;tigt
auch Hr. Tyschtschenko in einem Gespr&auml;ch, wo er darauf hinweist,
da&szlig; bis jetzt 17 Lizenzen f&uuml;r veschiedene Amiga Produkte
vergeben wurden.</P>

<P ALIGN=CENTER><A NAME="12" HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Das Resume. Na ja, ich w&uuml;rde mal sagen, wenn man sich von der Messe
bahnbrechende Neuerungen erwartet hat, wurde man vielleicht
entt&auml;uscht. Andererseits, "Totgeglaubte leben wirklich l&auml;nger".
Denn wer h&auml;tte einer Firma, die praktisch seit 3 Jahren von der
Bildfl&auml;che verschwunden war, zugetraut wieder ein Event zu
veranstalten, das so gut besucht war, wie diese Messe. Nach dem Besuch der
Computer96 voriges Jahr war die Stimmung auf dem Nullpunkt. Vielleicht ist
es 1997 Zweckoptimismus, aber trotzem sind Benutzer und auch Hersteller
gewillt, diesen Weg weiter zu gehen. Das hat diese Messe eindeutig gezeigt.
Also, der Amiga lebt. Was die Aufgabe f&uuml;r das n&auml;chste Jahr sein
wird, wurde auch klar: Es m&uuml;ssen billigere und schnellere
konkurrenzf&auml;hige Ger&auml;te her. Durch eine Lizensierungspolitik
d&uuml;rfte das machbar werden. Das zeigt auch das Beispiel DCE. Noch auf
der Messe wurde der A5000 mit 030 gezeigt, 1 Woche sp&auml;ter war nur mehr
von 040er als low end die Rede - wohl nicht nur lt. Auskunft von Hr.
Dellert durch die Nachfrage der Messebesucher nach mehr Leistung, sondern
auch durch ein Konkurrenzsystem von Index Information. Konkurrenz belebt
das Gesch&auml;ft! Also, wir d&uuml;rfen wirklich gespannt in die Zukunft
sehen, meinen </P>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#juergen">J&uuml;rgen Schober</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x000E.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>
					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x000E.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/c97_01.jpeg">Computer97</A> Messefoto<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/c97_dce5000.jpeg">A5000 Motherboard</A> JPEG-Bild<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/c97_a5000b.gif">A5000 Motherboard</A> GIF-Bild (High Quality)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.dcecom.de/html/index.html">DCE Computer</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/c97_boxermb.jpeg">Boxer Moterhboard</A> zum anschauen!<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.cix.co.uk/~index/welcome.htm">Index Information</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.blittersoft.com/">Blittersoft UK</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.irseesoft.com/">IrseeSoft</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.haage-partner.com/">Haage&amp;Partner</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.phase5.de/">Phase 5</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.villagetronic.com/amiga/">VillageTronic</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.amiga.de/">Amiga International</A><BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x000D.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x000F.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
