<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x00 - Art Effect</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0007.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0006.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0008.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0007.html">Art Effect</A> | <A HREF="0x0008.html">Cygnus Ed</A> | <A HREF="0x0009.html">Fusion</A> | <A HREF="0x000A.html">Draw Studio</A> | <A HREF="0x000B.html">p.OS</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0001.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0002.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0003.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0004.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0005.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0007.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x000C.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x000D.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x000E.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x000F.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0011.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Art Effect 2.0</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Vorweg ein paar Worte in eigener Sache (zum
allgemeinen Verst&auml;ndnis): Zum ersten bin ich hauptberuflich Graphiker
und zum zweiten in Sachen Schreiben gewiss noch nicht versiert genug um die
nachfolgende Beurteilung wirklich professionell aussehen zu lassen, aber
vielleicht liegt gerade darin der Reiz, da&szlig; ganz &quot;normale&quot;
Menschen sich auch einmal ein Urteil anma&szlig;en, und dabei Blickwinkel
auftun, die den Profis, wie wir sie von den diversen Fachzeitschriften her
kennen, eventuell sogar verborgen bleiben. </FONT><BR>

<P ALIGN=CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Jetzt aber zu der Beurteilung bzw. Betrachtung der von mir
ausgew&auml;hlten Software: &quot;ArtEffect&quot; V2.0. Wie schon zuvor
erw&auml;hnt bringt mein Beruf als Graphiker es mit sich, da&szlig; man an
solchen Programmen wie zum Beispiel Adobe`s Photoshop gar nichtvorbeikommt
- das erkl&auml;rt auch die immer wieder vorkommenden Vergleiche in den
nachfolgenden Zeilen. Es hat wohl sein Gutes wie auch sein Schlechtes,
da&szlig; zum Zeitpunkt nur die Version 2.0 am Markt erh&auml;ltlich war.
Schlecht insofern, als da&szlig; man sich &uuml;ber die eine oder andere
Unzul&auml;nglichkeit &auml;rgert. Gut, als da&szlig; man somit auch auf
Verbesserungen hoffen darf. Klingt schlimmer als es wirklich ist, weil
allein schon die Tatsache erfreulich ist, da&szlig; es jetzt am Amiga
endlich ein Bildbearbeitungsprogramm gibt, das einen nicht dazu zwingt ein
Programm von Anfang an neu zu erlernen. (Ich mu&szlig; dazu sagen,
da&szlig; ich au&szlig;er mit Brilliance, ADpro und ImageFX kein anderes
Programm am Amiga aus dieser Sparte l&auml;nger als 10 Minuten zum
Begutachten benutzt habe.) Sprich: Die &Auml;hnlichkeit zu Photoshop ist
un&uuml;bersehbar. Warum das so ist, dar&uuml;ber k&ouml;nnen die
Verantwortlichen sicher einiges sagen. Im Sinne von &quot;never change a
winning team&quot; hab ich f&uuml;r die &Auml;hnlichkeit vollstes
Verst&auml;ndnis. Aber ganz zur&uuml;ck zum Anfang.</P>

<P ALIGN=CENTER><A NAME="03" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Weil ich die Erfahrung gemacht habe da&szlig; die deutschen
&Uuml;bersetzungen der Requester immer ein gewisses Ma&szlig; an Kryptik mit
sich bringen, greif ich zur englischen Version... netter Versuch... Aber
trotzdem, ich darf nicht klagen, es war dann doch ganz simpel. Das war dann
auch gleich die erste angenehme Erfahrung mit diesem Programm: Leicht
installiert, gestartet - l&auml;uft! Und wie schon gesagt, wenn man
Photoshop kennt f&uuml;hlt man sich gleich wohler. Beziehungsweise
erleichtert diese &Auml;hnlichkeit manch einem potentiellen Jung-Designer
dann das Arbeiten auf anderen Plattformen. Danach kam allerdings die erste
Ern&uuml;chterung: Jedes Fenster will separat aktiviert sein (Ich bin mir
sicher, da&szlig; es daf&uuml;r einen terminus technicus gibt, aber alles
kann man auch nicht wissen.) Diese &quot;Eigenart&quot; hat
m&ouml;glicherweise ihre Vorteile, f&uuml;hrt aber bei einem simplen
Werkzeugwechsel (es sei denn man hat die Kurzbefehle schon alle auswendig
gelernt... doh, gibt es daf&uuml;r Kurzbefehle?) zu unn&ouml;tig vermehrten
Aufwand.</P>

<P ALIGN=CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Zum Werkzeug ist mir wiederum angenehm aufgefallen, da&szlig; die
diversen Malwerkzeuge wie z.B. Kreis zeichnen (sh. Brilliance)
&quot;mitgenommen&quot; wurden. Gut ist auch die M&ouml;glichkeit,
da&szlig; man mehrere Filter-Requester gleichzeitig offenlassen kann. Das
bietet einen feinen Freiraum zum experimentieren, da das Ergebnis einer
Filter-Operation sofort in die jeden weiteren Preview &uuml;bernommen wird.
Allerdings sind einige Filter schon so rechenaufwendig, da&szlig; auch ein
060er etwas in die Knie geht. F&uuml;r professionelle Bildbearbeitung wird
man wohl noch auf die PPC-Versionwarten m&uuml;ssen. Abgesehen davon wird
man wohl an der Speicherverwaltung noch ein wenig feilen m&uuml;ssen, weil
ein 4MB File bei 48MB Ram und der default-Swap-Partition f&uuml;hrte
unweigerlich zum Absturz. Was ist mir sonst noch so aufgefallen?</P>

<P ALIGN=CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Das Handbuch: Ist meiner Meinung nach f&uuml;r ein professionelles
Programm ein wenig zu d&uuml;nn ausgefallen, daf&uuml;r aber innen recht
&uuml;bersichtlich gestaltet. (andererseits hab ich pers&ouml;nlich wieder
die Maler-B&uuml;rste auf der Titelseite als unpassend empfunden)</P>

<P>Der Zeitpunkt: Irgendwie finde ich es schade da&szlig; dieses Programm
so sp&auml;t entwickelt wurde, h&auml;tte es sich doch sch&ouml;n mit dem
060er bundlen lassen, und vielleicht somit f&uuml;r einen besseren Absatz
sorgen k&ouml;nnen.</P>

<P>Lustig: Bei dem Filter f&uuml;r den Histogrammausgleich gibt es einen
Random-Button</P>

<P>Internet: In Zeiten des WorldWideWaits w&auml;re es ganz gut wenn man
auch GIF`s speichern k&ouml;nnte und nicht nur laden. Im Gro&szlig;en und
Ganzen ein Programm mit sehr viel Potential, sowohl was es bis jetzt
leistet, als auch was da noch kommen mag. Und der Preis? Ist in der
Relation zur Leistungsf&auml;higkeit ein guter. F&uuml;r den Profi-Bereich
wage ich es allerdings noch nicht zu empfehlen. Anfragen, Beschwerden, etc
an:</P>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#tom">Tom Kutschera</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0007.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.haage-partner.com/">Haage Und Partner</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_00/arteffect_1.gif">Screenshot</A> - leider nur in 256 Farben :-((((<BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp;
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0006.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0008.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
