<HTML><HEAD><TITLE>Wie alles begann...</TITLE></HEAD>
<BODY bgcolor=#ffffff text=#000000 link=#ff0000 vlink=#0000ff alink=#00ff00 background="granit.jpg">
<H1>Tabellen</H1>
<H2>Schritt für Schritt Anleitung</H2><H3>Einleitung</H3>
Tja, wozu brauchst du nun überhaupt Tabellen wirst du vileicht fragen. Ganz einfach: Für so ziemlich alles. Ob du nun deinem Text einen Rand verpassen willst, einen schmucken Wertungskasten zaubern willst, oder einfach nur eine kleine Tabelle mit ein par Zahlen schreiben willst: Tabellen sind die ideale Layouthilfe in HTML. Man kann eine ganze Menge mit ihnen anstellen, sie sind flexibel und anpassungsfähig. Wenn du z.B. eine Liste mit &lt;PRE&gt; definierst, so wird ein User mit geringer Auflößung immer mit dem Schiebebalken zu kämpfen haben, da die Breite recht starr ist. Tabellen dagegen können sich der Breite des Screens anpassen, und bleiben trotzdem leserlich. Der Nachteil ist nun natürlich, daß mam mehr Zeit und Arbeit in den HTML-Code investieren muß, aber ich finde diese Arbeit lohnt sich wirklich! Und für diejenigen, die keine Ahnung von HTML haben, und auch keine schlauen Bücher zur Hand haben wollte ich einfach mal diese kleine Hilfe schreiben. Wenn danach noch irgendwas unklar sein sollte, kontaktiert mich, ihr erhaltet garantiert Antwort.<H3>Anleitung</H3>
In diesem Kursteil kannst du lernen eine HTML Tabelle aufzubauen und zu ver&auml;ndern. Ich werde versuchen m&ouml;glichst viele der M&ouml;glichkeiten aufzuweisen, die HTML bietet. Aber eine gute Portion Fantasie mu&szlig;t du nat&uuml;rlich auch mitbringen. Also fangen wir mal an.<BR>
Eine Tabelle wird mit dem Befehl &lt;TABLE&gt; ge&ouml;ffnet, und mu&szlig; mit &lt;/TABLE&gt; wieder beendet werden. Innerhalb des Tabellen TAGs lassen sich nat&uuml;rlich noch einige Sachen einstellen, dazu sp&auml;ter mehr.<BR>
Als n&auml;chstes &ouml;ffnest du mit &lt;TR&gt; eine Horizontale Zeile. &lt;TR&gt; mu&szlig; im Grunde nicht geschlo&szlig;en werden, es gilt als geschlo&szlig;en sobald das n&auml;chste &lt;TR&gt; auftaucht.<BR>
Als n&auml;chsten TAG haben wir 2 St&uuml;ck zur Auswahl:<OL>
<LI>&lt;TH&gt; Table Header- Spalte f&uuml;r &uuml;berschriften
<LI>&lt;TD&gt; Table Dings :)- Normale Spalte f&uuml;r Text und alles m&ouml;gliche.</OL>
Statt &lt;TR&gt; kannst du auch noch einen TAG verwenden, n&auml;hmlich &lt;CAPTION&gt;-Eine besondere Zeile, wirklich nur f&uuml;r &uuml;ber- oder Unterschriften.
Wir nehmen nun als erstes mal &lt;CAPTION&gt;. Als Wert l&auml;&szlig;t sich hier nur ALIGN einstellen. Da wir eine &uuml;berschrift wollen, schreiben wir ALIGN=TOP in den TAG. So sieht unser "Listing" bisher aus:
<PRE>
&lt;TABLE&gt;
	&lt;CAPTION ALIGN=TOP&gt;
		Deine &uuml;berschrift
	&lt;/CAPTION&gt;
&lt;/TABLE&gt;
</PRE>
Das sieht alles auf den ersten Blick komplizierter aus als es wirklich ist. Bisher bewirkt es auch nicht viel mehr als das hier:<BR><TABLE><CAPTION align=TOP>Deine &uuml;berschrift</CAPTION></TABLE><BR>
Wow, genial! Aber mal im Ernst, diese Tabelle erkennt man noch nicht einmal als solch eine. Wenn du willst, da&szlig; ein Rahmen um die Tabelle gezeichnet wird, mu&szlig;t du im &lt;TABLE&gt; TAG BORDER schreiben, und im eventuell noch eine Zahl zuweisen. Diese entspricht dann der Dicke des Rahmens in Pixeln.
<PRE>
&lt;TABLE BORDER=3&gt; &lt;!--3 ist die Dicke in Pixel--&gt;
	&lt;CAPTION ALIGN=TOP&gt;
		Deine &uuml;berschrift
	&lt;/CAPTION&gt;
&lt;/TABLE&gt;
</PRE>
And so it looks:<BR>
<TABLE BORDER=3><CAPTION align=TOP>Deine &uuml;berschrift</CAPTION></TABLE><BR>
Nun wollen wir aber endlich irgendwas schreiben. Zu diesem Zwecke mu&szlig;t du zuerst eine Zeile und dann eine Spalte &ouml;ffnen. In die Spalte (Wird mit dem Befehl &lt;TD&gt; ge&ouml;ffnet) kannst du dann deinen Text, deine Bilder, deine Limmericks oder sogar neue Tabellen reinschreiben.
<PRE>
&lt;TABLE BORDER=3&gt; &lt;!--3 ist die Dicke in Pixel--&gt;
	&lt;CAPTION ALIGN=TOP&gt;
		Deine &uuml;berschrift
	&lt;/CAPTION&gt;
	&lt;TR&gt; &lt;!--&ouml;ffnet die Zeile--&gt;
		&lt;TD&gt; &lt;!&ouml;ffnet die erste Spalte--&gt;
			Hier ist Platz f&uuml;r deinen Text...
		&lt;/TD&gt; &lt;!--Schlie&szlig;t die Spalte--&gt;
	&lt;/TR&gt; &lt;!--Schlie&szlig;t die Zeile--&gt;
&lt;/TABLE&gt;
</PRE>Und wieder mal:<BR><TABLE BORDER=3><CAPTION align=TOP>Deine &uuml;berschrift</CAPTION><TR><TD>Hier ist Platz f&uuml;r deinen Text...</TD></TR></TABLE><BR>Du kannst nat&uuml;rlich auch einzelne Spalten nebeneinander &ouml;ffnen, z.B. f&uuml;r Wertungsk&auml;sten. Links die Bezeichnung, rechts die Wertung. Daf&uuml;r &ouml;ffnest du einfach noch eine Zweite Spalte, bevor du die Zeile dichtmachst.
<PRE>
&lt;TABLE BORDER=3&gt; &lt;!--3 ist die Dicke in Pixel--&gt;
	&lt;CAPTION ALIGN=TOP&gt;
		No Cover Bewertung
	&lt;/CAPTION&gt;
	&lt;TR&gt; &lt;!--&ouml;ffnet die Zeile--&gt;
		&lt;TD&gt; &lt;!&ouml;ffnet die erste Spalte--&gt;
			Spieltitel:
		&lt;/TD&gt; &lt;!--Schlie&szlig;t die Spalte--&gt;
		&lt;TD&gt;
			Mega&uuml;bersuperdupergame
		&lt;/TD&gt;
	&lt;/TR&gt; &lt;!--Schlie&szlig;t die Zeile--&gt;
&lt;/TABLE&gt;
</PRE>Und so sieht`s aus:<BR><TABLE BORDER=3><CAPTION align=TOP>No Cover Bewertung</CAPTION><TR><TD>Spieltitel:</TD><TD>Mega&uuml;bersuperdupergame</TD></TR></TABLE><BR>St&ouml;rt es dich nicht auch, da&szlig; der Hintergrund in der Tabelle noch sichtbar ist? Den k&ouml;nnen wir ganz schnell &uuml;bermalen, n&auml;mlich mittels BGCOLOR im &lt;TABLE&gt; TAG.
<PRE>
&lt;TABLE BORDER=3 BGCOLOR=#FFFFFF&gt; &lt;!--FFFFFF ist die Farbe--&gt;
	&lt;CAPTION ALIGN=TOP&gt;
		No Cover Bewertung
	&lt;/CAPTION&gt;
	&lt;TR&gt; &lt;!--&ouml;ffnet die Zeile--&gt;
		&lt;TD&gt; &lt;!&ouml;ffnet die erste Spalte--&gt;
			Spieltitel:
		&lt;/TD&gt; &lt;!--Schlie&szlig;t die Spalte--&gt;
		&lt;TD&gt;
			Mega&uuml;bersuperdupergame
		&lt;/TD&gt;
	&lt;/TR&gt; &lt;!--Schlie&szlig;t die Zeile--&gt;
&lt;/TABLE&gt;
</PRE>G&auml;&auml;hhhn:<BR><TABLE BORDER=3 BGCOLOR=#FFFFFF><CAPTION align=TOP>No Cover Bewertung</CAPTION><TR><TD>Spieltitel:</TD><TD>Mega&uuml;bersuperdupergame</TD></TR></TABLE><BR>In einer Tabelle kann nat&uuml;rlich auch ein Link stehen:
<PRE>
&lt;TABLE BORDER=3 BGCOLOR=#FFFFFF&gt; 
	&lt;CAPTION ALIGN=TOP&gt;
		No Cover Bewertung
	&lt;/CAPTION&gt;
	&lt;TR&gt; 
		&lt;TD&gt; 
			Spieltitel:
		&lt;/TD&gt; 
		&lt;TD&gt;
			Mega&uuml;bersuperdupergame
		&lt;/TD&gt;
	&lt;/TR&gt; 
	&lt;TR&gt; &lt;!--Horizontale Zeile Nr. 2--&gt;
		&lt;TD&gt;
			Hersteller:
		&lt;/TD&gt;
		&lt;TD&gt;
			&lt;A HREF="DeineURL.html"&gt;Amiga Games&lt;/A&gt;
		&lt;/TD&gt;
	&lt;/TR&lt;
&lt;/TABLE&gt;
</PRE>Die Zeile mit "DeineURL.html" und "Amiga Games" ersetzt du nat&uuml;rlich durch den Hersteller des Spiels. Und so siehts dann aus:<BR><TABLE BORDER=3 BGCOLOR=#FFFFFF><CAPTION align=TOP>No Cover Bewertung</CAPTION><TR><TD>Spieltitel:</TD><TD>Mega&uuml;bersuperdupergame</TD></TR><TR><TD>Hersteller</TD><TD><A HREF="Hier deinen Link eintragen!!!!">Amiga Games</A></TD></TR></TABLE><BR>
Da mein Editor nur 100 Zeilen zul&auml;&szlig;t geht es jetzt
<A HREF="-anleitung2.html"> HIER</A> weiter!<P><A HREF="workshop_tables.html">Inhalt</A><BR><CENTER><A HREF="NoCover.html"><IMG SRC="l_hauptinhalt.jpg" border=0 width=320 height=50 alt="Hauptinhalt, JPG, Link zur NoCover, 639x99, Größe ca. 29KB"></A></CENTER><BR></BODY></HTML>
