<HTML><HEAD><TITLE>Monkey Island 1</TITLE></HEAD> <BODY BGCOLOR=#000000 text=#ffffff link=#00ff00 alink=#00ff00 vlink=#00ff00>
<TABLE WIDTH=100% cellpadding=5 border=0><TR><TD>
 <P><CENTER><IMG SRC="lucas2.gif" width=261 height=65 alt="Lucas Films Arts"></CENTER>
<HR WIDTH=261 color=#ff00000>
</P>
<I><font color=#dddddd>"ICH verfluchte nochmals mein Schicksal, als ich mich in die Kehle des
steinernen Affen hinablie&szlig;. Sind meine Tr&auml;ume vom Pl&uuml;ndern reicher Galeonen, von
Sch&auml;tzen und Abenteuern derart geplatzt? "Drei kleine Pr&uuml;fungen, dann geh&ouml;rst du
zu uns!" haben sie gesagt. Das klang fair. Wenn ich nur dieses seltsame Zeug
runterkriegen w&uuml;rde, das diese M&auml;nner der See in sich hineinsch&uuml;tten. Wie konnte
ich denn ahnen, da&szlig; ich eine m&auml;chtige und sch&ouml;ne Frau treffen w&uuml;rde, mit einem
Geliebten, der vor lauter Eifersucht nicht bemerkt, da&szlig; er schon mehrere Jahre
tot ist? Und jetzt krabble ich durch die Eingeweide des steinernen Affen, auf
der Suche nach einem Mann, der drei Zentimeter &uuml;ber dem Boden schwebt und jeden
Morgen seinen Bart anz&uuml;ndet."</I>(Auszug aus den Memoiren von Guybrush
Threepwood, <I><B>"Meine Jahre auf Monkey Island"</b></I>)</FONT></P><BR> <H1><CENTER><FONT COLOR=#dddd00><u>Willkommen auf Monkey Island <SUP>TM</SUP></U></FONT></CENTER></H1>
Jawoll, wer kennt es nicht, dieses fast schon legend&auml;re Adventure von Lucas
Arts. Geniale Grafiken mit einem revolution&auml;rem Farbsystem, super Musik, eine
irrwitzige Story und das bew&auml;hrte Scumm System zeichneten dieses Adventure im
Jahre 1991 A.D. aus. Und heute? Nun, pusten wir einfach mal den Staub von der
alten Packung, und f&uuml;hren noch einmal den Helden mit dem unaussprechlichen Namen zur
sagenumwobenen Insel Monkey Island, durch seinen Kampf mit LeChuck und zum
umwerfenden Ende mit Elaine...<P>

<A NAME="story"></A>
<hr width=70% color=#0000dd size=2><P>
 Anscheinend sind wir bereits mitten in der
Story dieses fazienierenden Adventure angelangt, daher hier nochmal schnell von
vorn:<BR>Du &uuml;bernimmst den Part von Guybrush Threepwood (sag das mal 3x schnell
nacheinander...), kleiner M&ouml;chtegern- Abenteurer und Pirat, der gerne ein echter
Pirat werden w&uuml;rde. Wie schon gesagt sollst du daf&uuml;r zun&auml;chst 3 Pr&uuml;fungen
bestehen, doch nachdem du das unm&ouml;gliche dann endlich vollbracht hast, dein
Leben mehr als nur einmal auf Spiel aufs Spiel gesetzt hast, etliche Leute
betrogen, belogen und beklaut hast, und nun mit deinen unbezahlbaren
Errungenschaften auf dem Weg zu den 3 m&auml;chtigen Oberpiraten bist kommt alles
anders:<BR>LeChuck, ein untoter Geist, der der Legende nach irgendwo unter
Monkey Island <SUP>TM</SUP> leben soll, hat in einem akuten Anfall von
Eifersucht, Gr&ouml;&szlig;enwahn und Bo&szlig;heit die Governeurin gekidnappt. Jenes
wunderh&uuml;bsche Gesch&ouml;pf, welchem du bereits auf der Suche nach dem Idol der
vielen H&auml;nde begegnest bist, und welches dein Herz in einem wahren Sturm erobert

     hat, kannst du nat&uuml;rlich nicht seinem eigenem Schicksal &uuml;berlassen. Du
machst dich also auf die Suche nach einer geeigneten Crew, wirfst deine
Piratenpl&auml;ne &uuml;ber den Haufen, und machst dich auf diesem wiederlichen Gesch&ouml;pf
Einhalt zu gebieten, koste es was es wolle. Auf dem Weg zu seiner geheimen
Festung gilt es nun so manches unl&ouml;sbares R&auml;tsel zu l&ouml;sen, unm&ouml;gliche Fallen zu
&uuml;berwinden, und &uuml;berm&auml;chtige Gegner zu bezwingen. Das Schicksal der Gouverneurin
h&auml;ngt nun ganz allein von dir ab, und solltest du versagen, so w&uuml;rde dein
gr&ouml;&szlig;ter Alptraum wahr werden:<BR>LeChuck w&uuml;rde Elaine heiraten, und du h&auml;ttest
f&uuml;r immer verloren.<P>
<a name="gfx"></A>
<hr width=70% color=#0000dd size=2><P>

Auf deinem Weg begleiten dich f&uuml;r die damalige Zeit geniale Grafiken, in bis zu 256 Farben. Dies geschiet unter Beihilfe des genialen, aber verha&szlig;ten Piraten Copper, der schon so manchem Screenshot mutig Einhalt geboten hat. Nichtsdestotroz kann sich die Umgebung dennoch sehen lassen, die Architekten waren damals wohl schon recht weit. Es gibt auf Meele und Monkey Island <SUP>TM</SUP> dutzende Gespr&auml;chspartner, denen tu teilweise Angesicht zu Angesicht gegen&uuml;ber stehen kannst. Das Geld der Bewohner reichte sogar aus, so riesige Geb&auml;ude wie eine Kirche oder den Amtsitz der Gouverneurin zu bauen. Auf Monkey Island <SUP>TM</SUP> angekommen gibt es dann die sch&ouml;nsten Landschaften zu erblicken, und das Auge darf sich an den weichsten Bewegungs&uuml;berg&auml;ngen erfreuen, die in Begleitung von 
AGA 
leider nur allzu verwaschen wirken. Wenn du deine Freundin allerdings artgerecht kastrierst, sollten keine Probleme mehr auftauchen. Zauberer aus fernen L&auml;ndern berichteten &uuml;berdies von einem sagenumwobenem »HD-Installer«, mit dem jegliche Augenprobleme der Vergangenheit angeh&ouml;ren sollen. Bevor er mich in die Weiten des Trashcans verlie&szlig; murmelte der Zauberer noch irgendwas von »Aminet«, wahrscheinlich auch so eine Teufelei, die diese Hexen sich ausgedacht haben! Und das, obwohl wir nun schon einige Jahrhunderte seit dem Mittelalter hinter uns haben :-)<P>
<A NAME="sound"></A>
<hr width=70% color=#0000dd size=2><P>
Wenn auch die Umwelt ein wenig farbarm wirkt, so kann doch die Musik voll &uuml;berzeugen. An den unterschiedlichen Pl&auml;tzen, die du im Laufe der Zeit besuchen wirst, ert&ouml;nen wie von Geisterhand die sch&ouml;nsten Melodien. Zauberei? Es scheint mehr, da&szlig; der Programmierer (the Big one...) Ahnung von Paula hatte. Da merkt man doch richtig wieder, da&szlig; auch ein A500 das Ma&szlig; aller Dinge sein konnte...<BR>Hachja, also die Musik ist herrlich... Leider genau wie die Grafik nicht zu rippen... Tja, schade... aber macht ja nichts, im Spiel wirkt sie absolut genial!<P>
<a name="gameplay"></A>
<hr width=70% color=#0000dd size=2><P>
W&auml;hrend ich an diesen Zeilen schreibe, soll der Spielspa&szlig; nat&uuml;rlich nicht zu kurz kommen, und hier trumpft <I>The Secret of Monkey Island</I> geh&ouml;rig auf. Grafik und Sound m&ouml;gen vergehen, aber Spielspa&szlig; bleibt immerdar! Wo Indy oft ein wenig trocken wirkte, und andere Adventures unknackbar sind, bietet Monkey Island <SUP>TM</SUP> eine geh&ouml;rige Portion Humor, genug Spielraum zum rumprobieren (wenn auch keine mehrfach l&ouml;sbaren R&auml;tsel ala Maniac Mansion), und einen Schwierigkeitsgrad, der genau richtig bemessen ist. Es ist schaffbar, aber auch nicht zu leicht. Und es ist eines der wenigen Spiele, die man nach 4 Jahren aus dem Regal ziehen kann, und die dich dennoch wieder in ihren Bann ziehen werden. Die Story ist so athmosph&auml;risch (Das Wort ist falsch geschrieben, ich wei&szlig;! Ich wei&szlig; nur nicht, wie es richtig hei&szlig;t ;-), wie es immer von Myst erz&auml;hlt wird. Nun, Myst hab ich bisher nicht gezockt, aber das hier ist auch nicht schlecht!<P>
<a name="cheats"></A>
<hr width=70% color=#0000dd size=2><P>
Cheats gibts &uuml;brigens auch f&uuml;r dieses Game:<OL><LI>Wenn du Control-w (Alt-W ???) dr&uuml;ckst sollst du angeblich gewinnen. (Wie genial! F&uuml;r jeden der diesen Cheat mag, hier noch gleich einer: Schreib in eine Textdatei "Du hast gewonnen!", und sieh sie dir mit More an. Wow, gewonnen...)<LI>Wenn Guybrush ers&auml;uft wird, einfach 10 Minuten warten, dann hast du bald ne Wasserleiche...</OL>
<hr width=70% color=#0000dd size=2><P>
Und hier wie immer der <A HREF="-wertungskasten.html">Wertungskasten.</A>
<P>
<hr width=70% color=#0000dd size=2><P>
<TABLE BORDER=2 cellpadding=2 bordercolor=orange bordercolordark=orange bordercolorlight=orange><TR><TD>
Damit w&auml;hren wir wohl mal wieder am Ende des diesmonatigen Oldie-Tests angelangt. Bleibt vileicht noch zu sagen, da&szlig; zu diesem Spiel inzwischen jede Menge Komplettl&ouml;sungen erschienen, in der NC 54 hab ich auch eine geschrieben (Eigenlob stinkt, ich wei&szlig; ;-). Au&szlig;erdem ist vor &uuml;ber 5 Jahren der beinahe noch bessere 2. Teil von Monkey Island erschienen, und vor knapp einem Jahr erhielten die PC-User eine uns&auml;gliche weil absolut billige und schlechte 3. Version. Wollen wir mal hoffen, da&szlig; die Adventures auf dem Amiga nicht auch so ein niederes Niveau wie Monkey 3 annehmen. In Shadow of Time sieht ja schonmal sehr gut aus...<BR>

Na dann, bis zum n&auml;chsten mal sagt...</TD></TR></TABLE><P>
<CENTER><A HREF="mitglieder/castro.html"><IMG SRC="thesaint.gif" border=0 width=142 height=51 alt="The Saint, Gif, 142x51, Gr&ouml;&szlig;e ca. 2.5 KB, Link zur Mitgliederliste."></A></CENTER><BR><CENTER><FONT SIZE=1 color=#ffff00>Markus Castro</FONT></CENTER></P><P><CENTER><A HREF="NoCover.html"><IMG SRC="l_hauptinhalt.jpg" width=320 height=50 border=0 alt="Hauptinhalt, JPG, Link zur NoCover, 639x99, Gr&ouml;&szlig;e ca. 30 KB"></A></CENTER></P>
</TD></TR></TABLE>
</BODY></HTML>