<HTML>
<HEAD>
<TITLE>Hausfrauen Teil II</TITLE>
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#0000FF" ALINK="#FF0000" BACKGROUND="l_bg.gif">

<CENTER>
<H1>
<FONT COLOR="#FF0000">Hausfrauen Teil II</FONT></H1></CENTER>

<CENTER></CENTER>
Ich finde es toll, da&szlig; 2 Clubber auf meinen, zugegeben etwas &uuml;berzogenen,
Diskussionsbeitrag reagiert haben. Schade ist nur, da&szlig; die nicht
b&ouml;se gemeinte Ironie etwas falsch verstanden wurde...

<P><FONT COLOR="#666666"><I>"Soll in der NC nicht &uuml;ber alles geschrieben
werden k&ouml;nnen?"</I></FONT>
<BR><I><FONT COLOR="#666666">"Wenn "wir" (gemeint sind alle!) wirklich
nur &uuml;ber den Amiga schreiben w&uuml;rden, m&uuml;ssten einige andere
Themen ebenfalls aus der NC raus: Story Games, ein gro&szlig;er Teil vom
SmallTalk und auch meine Heavy Metal CD Tests; alles m&uuml;sste aus der
NC raus." </FONT>-</I> Kilian Servais

<P>Dagegen habe ich doch garnichts gesagt! Ich pers&ouml;nlich meine nicht,
da&szlig; NUR noch &uuml;ber Amiga-Themen geschrieben werden darf. Andere
Themen interessieren mich schlie&szlig;lich auch noch und nur Amiga w&auml;re
auf die Dauer auch ziemlich langweilig, oder? Es leuchtet mir auch ein,
da&szlig; nicht alle Artikel von jedem Clubber gelesen werden, weil sich
nicht alle daf&uuml;r interessiern. Meine MultimediaEcke lesen bestimmt
auch nicht alle, weil sie vielleicht Demos langweilig finden. Aber es ist
doch das gute Recht des Schreibers, Themen auszuchen zu denen er etwas
sagen kann und dieses Recht will ich keinem nehmen. In den Demo-Szene-Magazinen
wird schlie&szlig;lich auch nicht nur &uuml;ber Demos geschrieben, sonderen
auch mal was zu allt&auml;glichen Problemen oder Gedichte usw.

<P><I><FONT COLOR="#666666">"Als erstes m&ouml;chte ich aber klarstellen,
dass ich nicht beleidigt bin, einen Artikel f&uuml;r ein "Hausfrauenmagazin"
geschrieben zu haben. Mich st&ouml;rte nur die Art und Weise, wie argumentiert
wird, dass unser Clubmagazin zu wenig amigaspezifische Artikel bringe."</FONT>
-</I> Wolf Zimmer

<P>Ich wollte den Leser eben mit diesem ironischen Text wachr&uuml;tteln,
weil ich eben davon ausging, da&szlig; auf eine normale Aufforderung zum
schreiben von mehr Tests oder Berichten keine Reaktion erfolgt! Seit einigen
Ausgaben sind Standardrubriken wie Workshops, Hardware, Multimedia, Tools,
CD und DF&Uuml; sp&auml;rlich mit Artikeln besetzt. Im Sommer dachte ich,
es l&auml;ge am &uuml;blichen Sommerloch, aber als im Herbst immer noch
keine Besserung in Sicht war, versp&uuml;rte ich den Drang, mir meinen
Frust &uuml;ber diese Situation in kurzer, ironischer Form von der Seele
zu schreiben. Da&szlig; es un&uuml;berlegt war, Deine und Cord Hagen's
Artikel so stark miteinzubeziehen, tut mir wirklich leid! Ehrlich!

<P><I><FONT COLOR="#666666">"Unter amigaspezifischen Artikel verstehe ich
aber keinesfalls wieder das Aufflammen des leidlichen Themas "Amiga the
best - PC grrrrrr". Und was soll ein armer User nun &uuml;ber einen Computer
schreiben, der zwischenzeitig in die Jahre gekommen ist? Durchhalteparolen
und &auml;hnliches ist so abgedroschen wie das eben erw&auml;hnte Thema.
Und die Tips und Tricks sind auch alle schon mindestens dreimal beschrieben
worden."</FONT></I> - Wolf Zimmer

<P>NEUE Software erscheint doch f&uuml;r den Amiga schlie&szlig;lich noch,
sei es im PD-Markt (z.B. Aminet) oder kommerzielle Anwenderprogramme und
Spiele. Okay, im kommerziellen Bereich sieht es nicht mehr so rosig aus,
wie vor 7 Jahren, aber es erscheinen immer noch neue Programme. Au&szlig;erdem
kann man doch &uuml;ber sein Lieblingsspiel, ein gutes Anwenderprogramm,
oder irgendeiner anderen soften Ware berichten, die zwar nicht so neu ist,
aber vielleicht noch nicht jeder kennt. Ich teste z.B. auch nicht immer
die neuesten Programme aus dem Aminet, sondern auch mal etwas &Auml;lteres.
Weil Altes mu&szlig; doch nicht gleich schlecht und uninteressant sein,
oder?

<P><I><FONT COLOR="#666666">"Und wenn Gerd Wolpert eigentlich nur anregen
wollte, dass wieder vermehrt die alten Schreiberlinge ihren Griffel spitzen
und Beitr&auml;ge &uuml;ber unsere Freundin bringen, dann h&auml;tte er
es auch sagen sollen."</FONT></I> - Wolf Zimmer

<P>Gut, dann versuche ich es mal:

<P><FONT COLOR="#FFAA00"><B><FONT SIZE=+1>Leute, schreibt mal vermehrt
ein paar Tests oder Berichte zum Thema Amiga!!! &Uuml;ber was, ist eigentlich
egal, hauptsache die verwaisten Rubriken der NoCover werden wieder mit
gutem Material gef&uuml;llt. Auch die neuen Mitglieder oder die, die sich
noch nicht getraut haben einen Artikel zu schreiben, sind aufgefordert
!</FONT></B></FONT>
<BR>&nbsp;

<P><FONT SIZE=+1><A HREF="MITGLIEDER/WOLPERT.HTML">YONDER&nbsp; ---&nbsp;
Gerd Wolpert</A></FONT>

<P>E-Mail:<A HREF="mailto:gerd_wolpert@t-online.de?subject=Multimedia-Ecke">gerd_wolpert@t-online.de</A>
<BR>&nbsp;
<BR>&nbsp;

<P>
<HR>
<CENTER><A HREF="NoCover.html"><IMG SRC="l_hauptinhalt.jpg" BORDER=0 HEIGHT=99WIDTH=639></A></CENTER>

</BODY>
</HTML>
