<HTML>
<HEAD>
<TITLE>Amiga vs. PC</TITLE>
</HEAD>
<BODY TEXT=black link=blue alink=red bgcolor=white>
<CENTER>
</CENTER>

<P><H1>Wir brauchen die pezeeh-Szene nicht!!</H1></P>


<P>Viele Amiga®-Anwender trauern der Zeit nach, wo noch fast jeden Monat Spiele
f&uuml;r den Amiga® erschienen, die entweder vom pezeeh konvertiert wurden oder zuerst auf
dem Amiga ver&ouml;ffentlicht wurden. Aber warum trauert man diesen Zeiten nach?</P>

<P>1. Es erscheinen fast nur noch vereinzelt Spiele oder es werden Versprechungen
gemacht, die dann meistens nicht eingehalten werden, wie z. B. wollten sich
manche Firmen NIE vom Amiga abwenden und doch haben sie es irgendwann getan.</P>

<P>2. Wurden Spiele vom pezeeh konvertiert und dann wurden irgendwelche Abstriche
gemacht. Mit der Begr&uuml;ndung: "man kann es nur sehr schwer realisieren" oder "Der
Amiga ist einfach nicht der richtige Computer daf&uuml;r", nur wissen wir, die
Amiga-User ja wohl besser was in unserer `Freundin' steckt und was sie alles
Leisten kann.</P>

<P>Nicht umsonst wird der Amiga beim Fernsehen und beim Film (Babylon 5, SeaQuest
DSV, High Crusade) eingesetzt und das die pezeeh Hardware bzw. das ganze System total veraltet
ist, wei&szlig; man auch nicht seit gestern.</P>

<P>Denn, meine Theorie ist folgende: Ein System, das (fast) t&auml;glich(!)
aufger&uuml;stet werden mu&szlig;, nur weil das ein oder andere Spiel nicht
l&auml;uft, kann doch nichts taugen, oder? Beim Amiga kauft man sich sein System (das weitaus billiger ist,
als eine Dose!) und kauft sich vielleicht hin und wieder ein paar Sachen dazu,
wie z. B. CD-ROM-Laufwerk, Festplatte, Turbokarte (oder besser: PPC-Board) :)
und vielleicht noch eine GraKa (Grafik-Karte).</P>

<P>Doch beim pezeeh ist das im folgenden so: (Keine Angst, ich werde mir keine Dose
k&auml;ufen (Richiem&auml;sig)) ;)</P>

<P>Man k&auml;uft sich folgendes System:</P>

<P>Intel Pentium MMX, 200 MHz, 32 MB Ram, 850 MB HD, 4x Speed CD-ROM  f&uuml;r lockere
3299,- DM(!), dazu kommt noch ein Monitor für ebenfalls lockere 1299,- DM.
Also f&uuml;r summa summarum 4598,- DM!</P>

<P>Alles gut und sch&ouml;n, doch wenn ich dann den Computer zuhause habe, stelle ich fest,
das das Spiel das ich mir gekauft habe, dann auf meinem System nicht l&auml;uft, da
die Grafikkarte nicht gerade die allerneueste ist. Also zum n&auml;chsten
H&auml;ndler und eine neue GraKa f&uuml;r unschlagbare 249,- DM gekauft (wohl
das g&uuml;nstigere Zubeh&ouml;r, das man kaufen kann) :), dann zuhause angekommen, baue ich die Karte ein und
installiere das Spiel auf die Festplatte und mu&szlig; feststellen, das die Festplatte
auch nicht mehr ausreicht, da Windoofs schon eine ganze Menge an Festplatten-
speicher ben&ouml;tigt und Corel Draw (das beste(?) Malprogramm) auch seinen Platz
auf der HD einnehmen m&ouml;chte, also eine neue Festplatte gekauft; eine 3 GB
Platte f&uuml;r 549,- DM. Naja, mittlerweile ist es doch relativ sp&auml;t geworden
und ich beschlie&szlig;e morgen weiter zu machen.</P>

<P>Am n&auml;chsten Morgen:</P>

<P>Also, ich mich wieder an meinen Computer gesetzt und das System installiert.
Nachdem dies geschehen ist, installiere ich endlich mein hei&szlig;ersehntes Spiel, um
dann nach dem installieren festzustellen, das mein CD-ROM zu langsam ist, ich
also wieder zu meinem H&auml;ndler, der mich schon freudestrahlend empf&auml;ngt und mir
schon ansieht, was ich haben m&ouml;chte. Er dr&uuml;ckt mir ein 8x Speed CD-ROM in die
Hand und kn&uuml;pft mir daf&uuml;r 150,- DM ab.</P>

<P>Jetzt habe ich den Rechner, den ich für die n&auml;chsten Tage(!) brauche und habe
insgesamt 5546,- DM ausgegeben und es wird in den n&auml;chsten Tagen und Wochen
bestimmt noch etwas dazu kommen.</P>

<P>Jetzt stelle ich mal einen Vergleich auf, wenn ich mir einen Amiga-
(Spiele-)Computer gekauft h&auml;tte.</P>

<P>Ich habe kaufe mir folgendes System:</P>

<P>Amiga 1200, 2 MB, 1,6 GB Festplatte, 4x Speed CD-ROM f&uuml;r 1000 DM(!!),
Monitor für 399,- DM (!!).</P>

<P>Da ich aber nicht mit 2 MB sinnvoll arbeiten kann, der Computer mir von Haus
aus zu langsam war, ich auf dem neuesten Stand sein wollte, kaufte ich mir eine
PPC-Karte mit 160 MHz f&uuml;r 749,- DM, 32 MB Fastram f&uuml;r 140,- DM und die
BVision 4 MB SGRam f&uuml;r 499,- DM. Jetzt wird der Platz im Desktop Geh&auml;use zu eng,
also kaufe ich mir ein Towergeh&auml;use f&uuml;r 249,- DM und ein 24x CD-ROM
f&uuml;r 115,- DM. </P>

<P>Das Amiga-System hat mich, alles zusammen, nur 3151,- DM gekostet, also
2395,- DM weniger und kann mir noch einige Sachen mehr leisten als beim pezehh,
denn Corel Draw habe ich oben nicht mitgerechnet.</P>

<P>Doch viele werden sich jetzt fragen, was will er uns mit diesem Vergleich sagen?
Na, ganz einfach, das der pezeeh sowas von Sch...teuer ist, das es nicht zu glauben
ist, das sich fast jeder so ein Ding in die Wohnung stellen will, wenn er doch
beim Amiga billiger weg kommt. Und noch etwas ist mir aufgefallen, und zwar:
Jeder pezeeh-Looser sagt doch, das der Amiga ein Spielecomputer ist, aber wieso
kaufen dann soviele Leute den pezeeh? Spielkonsolen gibt es doch genug, oder?
:-)</P>


<P>Naja, mal schauen, ob sich jemand dazu &auml;u&szlig;ert, oder ob ich auf taube Ohren bzw.
blinde Augen gesto&szlig;en bin.</P>

<P>Hoffend auf viel Resonanz verabschiedet sich heute</P>

<TABLE border=0 align=center> 
<TD align=center valign=center>
<IMG SRC="silvio.gif" border=0 width=150 height=60 alt="» Silvio «"> 


<P>Nachtrag: Eigentlich wollte ich ja einen Artikel schreiben, der davon handelt, warum
wir nicht unbedingt die Konvertierungen vom pezeeh brauchen, sondern unsere
eigenen Spiele machen k&ouml;nnen, denn wer braucht schon die pezeeh-Szene? Wir
bestimmt nicht!!! Und bitte verzeiht mir dieses schreckliche Layout, denn das
ist mein erster HTML-Artikel. :-)</P>

</P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
