<HTML> 
<HEAD>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#000080">
<I><U><FONT COLOR="#ffffff"><H1>Kurz und b&uuml;ndig ....</H1>
</I></U><P>&nbsp;</P>
</FONT><FONT SIZE=4 COLOR="#ffffff"><P>Liebe Leute, es fehlt an Zeit ! Immer seltener kann ich immer weniger f&uuml;r die gute alte NoCover tun, - sorry ! Gl&uuml;cklicherweise kommen ja immer wieder neue Schreiberlinge hinzu und so wird es auch k&uuml;nftig viel interessantes zu lesen geben. Das war ja schon immer so, da&szlig; Schreiber kommen und gehen ....</P>
<P>Oh, - ich gedenke jetzt nicht, hier meinen Abschiedsbrief zu tippen und es wird auch kein Testament Euch zugunsten gemacht ;-)</P>
<P>Nein, vielmehr m&ouml;chte ich darauf hinweisen, da&szlig; ich auch k&uuml;nftig nur noch selten in der NoCover vertreten sein werde. Mir juckt es zwar gewaltig in den Fingern, wenn ich zu einem Diskussionsbeitrag zu gern etwas loswerden w&uuml;rde. Und solche Herausforderungen, wie sie von Yonder in die NC gebracht wurden, w&uuml;rde ich wirklich allzugern entgegentreten, .... warts ab Gerd, - irgendwann bekommst Du den von Dir gew&uuml;nschten B&uuml;geleisentest noch ganz bestimmt - ich werde Deinen Wunsch bestimmt nicht vergessen ;-))). Na jedenfalls l&auml;&szlig;t es die Zeit nicht mehr &uuml;brig - zuviele Aufgaben habe ich mir hier aufgebrummt, die noch viel wichtiger sind und vor allem, von deren Ergebnisse ich leben mu&szlig;. Meine "Kleinstunternehmen" w&auml;chst von Monat zu Monat .... nicht nur, was gl&uuml;cklicherweise den Umsatz, Leistungsangebot und die Sortimente betrifft, sondern vor allem auch die damit verbundene Arbeit. Ihr habt also hoffentlich Verst&auml;ndnis daf&uuml;r, da&szlig; ich mich in erster Linie um das k&uuml;mmern mu&szlig;, was Geld bringt, oder w&uuml;rdet Ihr auf einen Teil Eures Lohnes verzichten, um gratis f&uuml;r die NC schreiben zu d&uuml;rfen ? - Tja, das Leben ist hart und gemein - "alles wird besser, doch nie wieder gut" (</FONT><I><FONT COLOR="#ffffff">Rosenstolz</I></FONT><FONT SIZE=4 COLOR="#ffffff">) !</P>
<P>Ich m&ouml;chte mich aber hier und heute noch eben flink bedanken ....</P>
<P>Bei Sieglinde - Vielen herzlichen Dank f&uuml;r Deinen tollen Letter - ich hatte mich tierisch dar&uuml;ber gefreut und war schon richtig sauer, da&szlig; ich es bislang nie schaffen konnte, mich daf&uuml;r bei Dir zu bedanken .... Da hast Du Dir meinetwegen so viel Arbeit gemacht .... DANKE SCH&Ouml;N !!!</P>
<P>Bei Gerd Wolpert - Hey alter Retter in der Not ;-) - Nur keine Bange ... wehe Dir, wenn ich mal wieder etwas Zeit &uuml;brig habe ... Du bekommst Deinen B&Uuml;GELEISENTEST, sei Dir sicher ;-)))</P>
<P>Bei Wolf - Kannst Du es mir verzeihen, da&szlig; ich solange nichts mehr von mir habe lesen lassen ? - Es ist aber wirklich f&uuml;r einen guten Zweck, was den Amiga betrifft, .... Du wei&szlig;t ja Bescheid ;-) Deine Artikel finde ich stets hervorragend gelungen. Ein Gl&uuml;ck, da&szlig; Du Dich doch noch hast &uuml;berreden lassen, f&uuml;r die NC zu schreiben .... erinnerst Du Dich noch ? Erst wolltest Du ja nicht so richtig .....</P>
<P>Noch etwas an alle Amiganer .... - Jungs haltet noch weiterhin durch, - es lohnt sich glaube ich. Die PPC-Karten oder vielleicht bald die neuen G3-Karten, ein ZorroIV-Bus uvm. Und vor allem tut sich Dank der neuen Emulatoren ein gewaltiger Softwaremarkt vor uns auf .... MAC-OS 8 &uuml;ber FusionPPC, Win98 &uuml;ber PCX oder PC-TaskPPC .... WAHNSINN ! Wenn das wirklich gut nutzbar umgesetzt wird und die Chancen bestehen ja durchaus, wird aus unserem uralten dahin&auml;chtzenden Amiga vielleicht noch das erste halbwegs vern&uuml;nftige Multisystem auf dem Markt. Warum noch einen iMac kaufen, wenn &uuml;ber FusionPPC die Mac-Software kaum gebremst stabil auf unserem Amiga l&auml;uft ? Ich pers&ouml;nlich finde diese neuen M&ouml;glichkeiten mindestens genauso interessant, wie vielleicht ein komplett neues Amigasystem, von dem icxh jetzt noch gar nicht wissen kann, wie mir das Teil dann gef&auml;llt ....</P>
<P>So, - jetzt habe ich aber genug geschwafelt .....</P>
<P>Vielleicht noch eine Kleinigkeit - Wir sitzen mit einem 14-k&ouml;pfigen Team an einem neuen Amigaprojekt ! Dar&uuml;ber werde ich aber jetzt &uuml;berhaupt noch nichts veraten, - lasst Euch &uuml;berraschen, wenns soweit ist ;-)</P>
<P>F&uuml;r eben dieses Projekt k&ouml;nnten wir noch einen f&auml;higen Grafiker und einen Programmierer gebrauchen, um etwas flinker voran zu kommen. Es wird ein kommerzielles Projekt, - Ihr geht also mit relativ guter Wahrscheinlichkeit nicht leer aus, da es unser Projekt bislang noch NICHT f&uuml;r den Amiga gibt ! Einzige Bedingung, - Ihr m&uuml;&szlig;t per Email erreichbar sein, um im gesamten Team arbeiten zu k&ouml;nnen. Weitere Infos gibt es bei mir : </FONT><A HREF="mailto:Higgins@Datatype.Capella.de">Higgins@Datatype.Capella.de</A><FONT SIZE=4 COLOR="#ffffff"> !</P>
<P>Das w&auml;rs jetzt aber wirklich, - also noch von mir ALLES GUTE f&uuml;rs neue Jahr Euch allen und lasst es Euch gut gehen.</P>
<P>&nbsp;</P>
<P>Euer Higgins</P>
<I><P ALIGN="RIGHT">Cord Hagen</P></I></FONT></BODY>
</HTML>
