<html>
<head>
<meta name="description" content="Wolf-INFO">
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="st_wolfinfo.gif" text=black link=blue alink=red bgcolor="#FFFFCC">
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" width="100%" bgcolor="#808080"><font
color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td>
</tr>
</table>

<table border="0" cellpadding="3" cellspacing="3" width="100%">
<tr>
<td valign="top" bgcolor="#808080"><font color="#000080"><b>Inhalt</b></font>
<p><a href="#a1"><font size="1" face="arial">Hausfrauen-Report
</font></a></p>
<p><a href="#a2"><font size="1" face="arial">Feedback Corner
</font></a></p>
<p><a href="#a3"><font size="1" face="arial">NoCover Index
</font></a></p>
<p><a href="#a4"><font size="1" face="arial">Online News
</font></a></p>

<p><center> <a href="mitglieder/zimmer.html">
<img src="st_wolfinfo.jpg" width=90 height=90 border=0></a><br><br><br>
<font size="2"> eMail: </font> <a href="mailto:wozim@t-online.de">
<font size="1" face="arial">wozim@t-online.de</font></a>
</center></p>
<p><a href="NoCover.html#a14"><font size="1" face="arial">Zur&#252;ck zum NoCover-Index
</font></a></p>
</td>
<td valign="top"><a name="a1"><font color="800000" size="7"><center>
<b>Die NoCover - <br> ein Hausfrauenmagazin</font></b></a></center><br>
<p><font size="+1">
Diesen Titel m&#246;chte ich trotzdem weiterhin beibehalten, da dieser in der
Qintesenz mit Lethargie in Zusammenhang stehen sollte, wenn Gerd Wolpert sich in
seinem ersten Beitrag deutlicher ausgedr&#252;ckt h&#228;tte. Er hat ja
vollkommen recht, wenn er bedauert, dass momentan etwas wenig an Beitr&#228;gen
eingereicht wird. Wenn man nun den Umfang der entpackten NoCover sich anschaut,
muss man dennoch staunen, denn entpackt ergibt die NoCover-58 beinahe 2,4 MB an
Daten.</p>
<p>
Aber schauen wir doch einmal etwas genauer hin. 24% entfallen auf Amiga Aktuell
und der verbleibende Anteil setzt sich nun aus &#188; Text und &#190; Bilddaten
zusammen. Dieses Verh&#228;ltnis finde ich pers&#246;nlich nicht besonders
gelungen. Das hat aber auch &quot;The Saint&quot; (Markus, wie kommst Du nur auf
den Namen: Der Heilige&quot;?) schon zum Ausdruck gebracht. Ich gebe ja zu, dass
in meiner letzten Wolf-INFO das gleiche Verh&#228;ltnis entstanden war, dies ist
aber eher eine Ausnahme, schlie&#223;lich war dies eine Authentizit&#228;t des
Messegeschehens in K&#246;ln und die wollte ich nicht vorenthalten. Um bei den
Bilddaten zu bleiben, manche von Euch nutzen ganz sch&#246;ne, aber
speicherfressende Hintergr&#252;nde.</p></font></td></tr></table>
<p><font size="+1">
Und wenn Ihr Eure WB anstelle mit 16 Farben, einmal auf 256 Farben hochschaltet
und dann Euren Beitrag anschaut, wird mancher doch ins Gr&#252;beln kommen, ob
dies wohl der richtige Hintergrund sei. Umgekehrt sollte man es auch machen. Und
ich gebe zu, dass ich mich auch nicht daran halte. Denn was auf einem 16 bit
oder 24 bit Screen so sch&#246;n in Pastellfarben leuchtet, wird bei einer 4 bit
Aufl&#246;sung gar nicht mehr oder vollkommen falsch dargestellt. Wenn ich nun
im Text oder als Hintergrund Farbwerte angebe, versuche ich mich an die Tabelle
zu halten, die ich in der NoCover-53 mal angesprochen hatte. Wie gesagt ich
versuche es, leider vergesse ich da und dort mein Vorhaben, und schon schimpfen
wieder manche 16-Farben Screen-User.</p>
<p>
Mein hier verwendeter Hintergrund ist bei 16 Farben fast gar nicht zu sehen. Bei
Verwendung von 64 Farben ist er zu ahnen und mit einer Aufl&#246;sung von 256
Farben ist er immer noch nicht optimal. Die Steinstruktur kommt erst bei 16 Bit
zur Geltung. Ich werde mich auf den Weg machen und mir einen anderen Hintergrund
suchen, der trotzdem angenehm anzuschauen sein soll.</p>
<p>
Wo ich gerade mal wieder so sch&#246;n am L&#228;stern bin, m&#246;chte ich
eines noch sagen. Wenn man Einladungen ausspricht oder sich vorstellt, ist es
nach meinem Daf&#252;rhalten sehr opportun, Name, Zeit und Ort
hinzuzuf&#252;gen. &#214;sterreich ist gro&#223; und ein Jahr hat in der Regel
365 Tage. Und ganz ehrlich, wer nimmt schon f&#252;r eineinhalb Tage
Unterhaltung 1000 bis 2000 Km Anreiseweg auf sich. Ich nicht. Da liegt Kassel
viel n&#228;her bei mir und wie ich sehr stark annehme, wird auch dieses Jahr im
Fr&#252;hsommer dort wieder ein Meeting abgehalten werden, wof&#252;r ich schon
heute meine Zusage erteile.</p>
<p>
Nun noch etwas was ich nicht ganz verstanden habe, warum muss man einen Artikel
zweimal einbringen? Da die AmigaAktuell ein fester Bestandteil der NoCover ist,
reicht doch wahrhaftig die dortige Platzierung, denn die AA wird ja als Teil
weiterer Magazine und als selbst&#228;ndiges Magazin ver&#246;ffentlicht, die
NoCover ohne AA aber nicht. Um einen gr&#246;&#223;eren Leserkreis zu erreichen,
reicht also die Implementierung in der Amiga Aktuell. Verstanden h&#228;tte ich
diese Ma&#223;nahme nur aus dem Gesichtspunkt, wenn zwei verschiedenartige
Inhalte ver&#246;ffentlicht werden sollten, einmal f&#252;r eine Allgemeinheit
und dann zum zweiten spezifisch f&#252;r NoCoverleser, also Clubmitglieder.
</font></p><hr>
<p>
<a name="a2"><font color="800000" size="7"><center>
<b>Feedback Corner</font></b></a></center></p>
<p><font size="+1">
Als seinerzeit die Feedbackcorner eingerichtet wurde, wurde teils vehement
geschimpft, teils wohlwollend gelobt. Seit Cord Hagen aus verschiedenen
Gr&#252;nden diese Betreuung abgegeben hat, ist diesbez&#252;glich nicht mehr
viel los im Staate NoCover. Dadurch, dass diese &#196;u&#223;erungen
pl&#246;tzlich so peu &#224; peu einfach wegbleiben, sind manche der paar
verbliebenen Autoren etwas verunsichert. Das beste Beispiel hierf&#252;r ist die
Frage der beiden Zeichenk&#252;nstler, ob die Comic-Ecke bleiben oder ob diese
eingestellt werden soll. Wer sich die M&#252;he macht und im Editorial
nachschaut, wieviele Autoren diesmal beteiligt waren, muss feststellen, es
werden langsam aber sicher immer weniger. Dass eine gewisse Fluktuation
vorhanden ist, ist selbstmurmelnd. Das Abitur steht vor der T&#252;re oder die
Klausuren h&#228;ufen sich, weil man bestrebt ist, kein weiteres Semester
anzuh&#228;ngen, der Beruf l&#228;&#223;t momentan wenig Spielraum oder die
Familie pocht auf seinem Recht. Die Gr&#252;nde sind manigfaltiger Natur. Nur
bei dem Wort Fluktuation setzt man voraus, dass Ausscheidende durch
Neueinsteiger ersetzt werden. Nur zur Zeit scheint mehr eine Rezession
vorzuherrschen. Der Nachwuchs fehlt. Aus diesem Grunde m&#252;ssen wohl oder
&#252;bel die Ausscheidenswillige &#252;bberredet werden, weiter aktiv zu
sein.</p>
<i><br>
Wo bleibt die Nostalgie? Damals vor 13 Jahren.<br>
Wo bleibt der Workshop? LINUX, das alternative Betriebssystem.<br>
Wo bleiben die Netznachrichten? Online-Online und Bockmarkz.<br>
Wo bleibt Storygame, der Spielball der Autoren?<br>
Wo bleiben die Sonderecken? Wie z.B. Fastfood etc.<br>
Wo bleibt......?????? </i><br>
<p>
Ja es gibt zur Zeit viele &quot;Wo bleibt?&quot;. Und hier ist jedermann
aufgerufen, zu pr&#252;fen, ob nicht doch die M&#246;glichkeit besteht, mehr
Initiative zu entwickeln und wieder einen (oder auch mehrere) Beitrag
(Beitr&#228;ge) zu plazieren. Die NoCover lebt von und mit den Mitgliedern und
stellt im eigentlichen Sinne ein genaues Stimmungsbarometer dar.</p>
<p>
Der Hinweis, andere Magazine florieren doch zur Zeit, ist ein Trugschlu&#223;.
Denn diese Magazine werden von festen Redakteuren erstellt und ein klein wenig
mit Beitr&#228;gen von Outsidern aufgef&#252;llt. Die NoCover-Redakteure sind
die einzelnen Mitglieder und es gibt nur einen, der diese Beitr&#228;ge
lobenderweise zusammenstellt und nicht dreiviertel alles alleine schreiben muss.
Stellt Euch doch nur vor, jeder einzelne von Euch m&#252;sste ca 900 KB Daten
schreiben und das Monat f&#252;r Monat. Und dann m&#246;glichst noch alle
Fachrichtungen treffen und so schreiben, dass ein Au&#223;enstehender auch alles
liest und nicht gleich wieder wegklickt. Dann k&#246;nnt Ihr sagen, ich mache
ein Magazin und warte noch auf weitere Beitr&#228;ge. Wenn also jeder seinen
Artikel schreibt und zwar &#252;ber das, was ihm Freude bereitet und von dem er
auch Ahnung hat, dann brauchen wir keinen Ober-GURU und das Magazin NoCover wird
wieder lebendig.</font></p><hr>
<p>
<a name="a3"><font color="800000" size="7"><center>
<b>NoCover Index</font></b></a></center></p>
<p><font size="+1">
Mit gro&#223;er, nein mit sehr gro&#223;er &#220;berraschung habe ich gelesen,
dass in der FD-Hitparade in der Abteilung Multimedia mein NoCover Index an
erster Stelle steht. Da sitzt man nun zu Hause und schreibt und schreibt und man
h&#246;rt &#252;berhaupt nichts, aber auch rein gar nichts &#252;ber die Arbeit,
die man so vor sich hin entwickelt. Und pl&#246;tzlich sieht man sich in der
Hitparade und dann noch auf Platz Eins. Bin ich nun stolz? Bin ich froh? Bin ich
ger&#252;hrt oder doch unger&#252;hrt? Ich wei&#223; es nicht. Ich wei&#223; es
wirklich nicht. Vor gar nicht so langer Zeit ging ich sogar mit dem Gedanken
schwanger, die Arbeit einfach einzustellen und irgend etwas ganz anderes zu
beginnen. Und nun stehe ich auf Platz Eins. Was soll ich nur davon halten?</p>
<p>
Nun habe ich den Index auf die Schnelle aktualisiert und auch ein paar kleine
Fehler &#252;bersehen und habe Andreas gebeten, diesen Index als lha-File auf
die Club Homepage zum Downloaden zu platzieren. Beim n&#228;chsten Update werden
die Fehler hoffentlich alle beseitigt sein.</p>
<p>
Und jetzt noch ein Vierzeiler (f&#252;r's Poesiealbum?)<br><br>
<center><table border="0"><tr><td><font size="+1">
Auf den hohen Felsenklippen<br>
sitzen sieben Robbensippen,<br>
die sich in die Rippen picken,<br> 
bis sie von den Klippen kippen.</font></td></tr></table></center></p><hr>
<p>
<a name="a4"><font color="800000" size="7"><center>
<b>Online News</font></b></a><br>
<font color="800000" size="+1">(Auszug aus den Medien-News)</center></font></p>
<p><font size="+1"><strong>Untersuchung &#252;ber Banken im Internet:</strong> Das
Institut f&#252;r Bankinformatik und Bankstrategie an der Universit&#228;t Regensburg
(Ibi) hat die Webpr&#228;senzen von 410 Geldh&#228;usern in Deutschland, &#246;sterreich und
der Schweiz nach den Vorgaben einer internationalen Jury unter die Lupe
genommen. Im Zentrum stand die Frage, inwieweit die Banken das Know-how zu einem
gekonnten Marktauftritt im Internet besitzen. Die Deutsche Bank und ihre
Direktbank-Tochter Bank 24 gingen beim ersten </font>
<a href="http://website-rating.ibi.de"><font size="+1">Internet-Banken-Ranking
</font></a><font size="+1"> im deutschsprachigen
Raum als Sieger hervor.</font></p>

<p><font size="+1"><strong>politik-digital verst&#228;rkt Internet-Pr&#228;senz:
</strong></font><a href="http://www.politik-digital.de"><font
size="+1">politik-digital</font></a><font size="+1"> will mit seinen
redaktionellen Inhalten an m&#246;glichst vielen Stellen im Internet vertreten zu
sein. Deshalb wurde jetzt eine Kooperation mit den Internetmagazinen </font><a
href="http://www.firstsurf.de"><font size="+1">FirstSurf</font></a><font
size="+1"> und </font><a href="http://www.com-online.de"><font size="+1">com!
online</font></a><font size="+1"> eingegangen. Dabei stellt politik-digital
kostenlos Beitr&#228;ge f&#252;r seine Partner zur Verf&#252;gung und wird im Gegenzug
entsprechend in das jeweilige Angebot eingebunden. Das Internetmagazin FirstSurf
berichtet als reines Onlinemagazin &#252;ber aktuelle Themen aus der Internetszene.
FirstSurf wird von Symposion Publishing, D&#252;sseldorf, produziert und kooperiert
unter anderem mit dem deutschen Suchdienst Dino-Online sowie Tomorrow. com!
online, Schwester des gleichnamigen Internetmagazins mit einer verkauften
Auflage von 480.000 Exemplaren, stellt t&#228;glich neue Web-Seiten vor, gibt Tips
f&#252;r Netizens und organisiert regelm&#228;&#223;ig attraktive Gewinnspiele. Um der
Internet-Branche den Puls zu f&#252;hlen, hat com! online mit dem CIX (com! Internet
Index) einen eigenen Aktienindex aufgelegt, der ausschlie&#223;lich Anbieter von
Internet-Technik, -Zug&#228;ngen und -Inhalten enth&#228;lt. </font></p>

<p><font size="+1"><strong>Kommerzielles und wissenschaftliches Internet r&#252;cken
enger zusammen:</strong> Zwischen dem bundesdeutschen
Breitband-Wissenschaftsnetz (B-WiN) und dem kommerziellen Internet sollen
bessere Verbindungen geschaffen werden. Geplant ist eine merkliche Erh&#246;hung der
Bandbreite an der Nahtstelle von WiN- und Internet-Service-Providern (ISPs), die
heute 34 Mbit/s betr&#228;gt. Darauf haben sich der DFN-Verein zur F&#246;rderung eines
Deutschen Forschungsnetzes e.V. (Berlin) und der Verband der deutschen
Internet-Wirtschaft, </font><a href="http://www.eco.de"><font size="+1">eco
Electronic Commerce Forum e.V. </font></a><font size="+1">(K&#246;ln),
verst&#228;ndigt.</font></p>

<p><font size="+1"><strong>EU-Rat f&#252;r totale Internet-&#252;berwachung: </strong>Wie
in Br&#252;ssel bekannt wurde, gibt es Pl&#228;ne des Europ&#228;ische Rats der Justiz- und
Innenminister, die Anbieter von Festnetz-, Mobilfunk- und Internetanschl&#252;ssen
k&#252;nftig zu veranlassen, den Zugriff auf s&#228;mtliche Telekommunikationsdaten ihrer
Kunden zu erm&#246;glichen. Die Anbieter sollen den &quot;gesetzlich erm&#228;chtigten
Beh&#246;rden&quot; Kundendaten wie Name, Adresse, aber auch Pa&#223;w&#246;rter, Kontonummern
und Informationen &#252;ber das Benutzerverhalten auf Anforderung zur Verf&#252;gung
stellen.</font></p>

<p><font size="+1"><strong>Markennamen im Internet:</strong> Verletzung von
Markenrechten oder Benutzung eines Markennamens zur gerechtfertigten Kritik?
Diese Frage besch&#228;ftigt derzeit die amerikanische Justiz. Anfang November ging
ein Unternehmen namens </font><a href="http://www.adiosaol.com/"><font
size="+1">Adios AOL</font></a><font size="+1"> an den Start und bot den Kunden von
Onlinediensten wie AOL Hilfe an, wenn sich diese zum Wechsel zu einem
&quot;vern&#252;nftigen&quot; Provider entscheiden sollten. Gegen diese
Namenverwendung wollen die AOL-Juristen jetzt mit einer Klage vorgehen.
Unbehelligt bleibt dagegen eine andere Web-Site, </font><a
href="http://www.aolsucks.com/"><font size="+1">AOLSucks.com</font></a><font
size="+1">, die sich des AOL-Namens bedient, um seitenweise Kritik am gr&#246;&#223;ten
Online-Dienst der Welt zu posten. Schlechte Karten hat dagegen eine gegen
Netscape gerichtete Site mit dem &#228;hnlichen Namen NetscapeSucks.com. Der
Betreiber bekam umgehend eine Klage des Browser-Herstellers an den
Hals.</font></p><hr>

<center>
<table border="0" width=100% bgcolor="#808080"><tr><td>
<br>
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://home.chiemgau.com/amagerl/members/wolf"> http://home.chiemgau.com/amagerl/members/wolf </a>
<br><br>Gehe &#160; <a href="#top"> zum Anfang </a><br>
</table></center><br>
</body>
</html>

