<HTML>
<HEAD>
<meta name="description" content="Adrenalin Teil 5">
<meta name="author" content="Sylvester Beck">
<TITLE>Adrenalin Teil 5</TITLE>
</HEAD>
<BODY background="l_bg.gif" TEXT=black link=blue alink=red bgcolor="#dddddd">
<HR>
<BR>Lange mußtet ihr darauf warten, doch das warten hat ein Ende, denn hier
ist er nun der neueste Teil meiner Story:</BR>
<HR noshade width=100% size=6 color=yellow> 
<H2 align=center>Adrenalin</H2>
<H2 align=center>Teil 5</H2>
<H2 align=center>by</H2>
<TABLE border=0 align=center>
<TD align=center valign=center>
<IMG SRC="silvio.gif" border=0 width=150 height=60 alt="» Silvio «">
</CENTER> 
<HR noshade width=100% size=6 color=yellow>
<P>
"Hier Ruiz."</P>
"Hi, Ruiz, ich habe die Ergebnisse vom Labor."</P>
"Hast was gut, » Silvio «, warst die ganze Nacht auf, was?"</P>
"Mann tut, was man kann. Also, an dem Fleischerbeil sind nur die Abdr&uuml;cke von
der Frau und dem Jungen. Die Kugeln stammen alle aus derselben Waffe. Auf dem
Feuerzeug war nichts, was wir verwerten konnten. Und jetzt pa&szlig; auf, ich hab
einen Freund, der arbeitet in einer Reifenfirma, hab denen den Abdruck gefaxt,
265er, ganz seltenes Profil, asymmetrisch, war eine Sonderserie, wird nicht
mehr hergestellt. Wurden haupts&auml;chlich f&uuml;r ein Modell verwendet, von dem nur
1000 St&uuml;ck gebaut wurden. Und jetzt halt dich fest, von dem Wagen gibt's in
der Stadt nur f&uuml;nf St&uuml;ck. Einer steht bei einem Sammler, ist nie zugelassen
worden. Warte, ich geb dir Namen und Adresse der Halter."<BR>
<P>
Ruiz nahm sich einen Block und fing mitzunotieren.</P>
"Barrault?"</P>
"Ja, Ruiz, Frank Barrault, so hei&szlig;t der, kennst du den?"</P>
"Allerdings, du hast gerade bei uns angefangen, da hatten wir ihn mal hier, zu
einem Verh&ouml;r, kam aber nichts raus dabei."</P>
"Ich komm jetzt r&uuml;ber, bin in zwanzig Minuten im B&uuml;ro."</P>
"Leg dich aufs Ohr, » Silvio «, du mu&szlig;t todm&uuml;de sein."</P>
"Ach was, ich bin in Ordnung."</P>
<P>
Ruiz ging ins Archiv und suchte sich zusammen, was sie &uuml;ber Frank Barrault
hatten. Er ging mit einem Armvoll Akten zur&uuml;ck in sein B&uuml;ro und machte sich an
die Arbeit. Um diese Zeit war er au&szlig;er den Leuten, die Nachtdienst hatten, der
einzige im ganzen Haus.</P>
<P>
Ruiz machte sich ein paar Notizen. Barrault besa&szlig; mehrere Puffs, einige
Nachtlokale, in denen illegal gespielt wurde, und er kontrollierte einen Teil
des Stra&szlig;enstrichs der Stadt. Sowohl das Drogendezernat als auch der
Ausschu&szlig; f&uuml;r organisierte Kriminalit&auml;t und Ruiz' eigene Abteilung hatten sich schon
unabh&auml;ngig voneinander f&uuml;r ihn interessiert.</P>
<P>
Allein in vier verschiedenen Mordf&auml;llen war er bereits als dringend
Tatverd&auml;chtigter verh&ouml;rt worden. Ruiz war bei einem Verh&ouml;r dabeigewesen, als
er gerade als Kommissar in der Stadt anfing.</P>
<P>
Mehrere Leute, die f&uuml;r Barrault gearbeitet hatten, sa&szlig;en wegen Mordes,
Totschlags und Betrugs ein.
In den meisten F&auml;llen galt Barrault als Drahtzieher, dennoch waren sie noch an
ihn herangekommen.</P>
<P>
Ein V-Mann, der erfolgreich in Barraults Organisation eingeschleust werden
konnte, verschwand eines Tages und wurde Monate sp&auml;ter bei br&uuml;ckenbauarbeiten
mit abgeschnittenen Genitalien gefunden.</P>
<P>
Einem Zeugen, der gesehen hatte, wie Barrault einen Barbesitzer nach einem
Streit in den Hinterkopf geschossen hatte, wurde mit einer Motors&auml;ge ein Bein
abgetrennt. Der Zeuge befand sich noch immer in einer psychiatischen Anstalt
und war nicht vernehmungsf&auml;hig.</P>
<P>
Ruiz sah auf den Berg von Akten vor sich. Er stand mal wieder da, wo er schon
oft gestanden hatte. Selbst wenn er die M&ouml;rder schnappen w&uuml;rde und es
tats&auml;chlich Franks Leute waren, w&uuml;rden sie dichthalten, sie wu&szlig;ten, wenn sie
rauskamen, bekamen sie eine satte Pr&auml;mie. Ihren Familien, falls sie welche
hatten, w&uuml;rde es in der Zwischenzeit an nichts fehlen. Frank w&uuml;rde an ein paar
F&auml;den ziehen, der Proze&szlig; w&uuml;rde sich hinschleppen, vielleicht
w&uuml;rde es nicht
mal f&uuml;r eine Verurteilung reichen. Machten sie den Mund auf und sagten gegen
Frank aus, bekamen sie im Gef&auml;ngnishof oder unter der Dusche ein Messer
zwischen die Rippen. Man konnte denen, die auf der richtigen Seite standen,
nicht viel bieten.</P>

<H2 align=center>***</H2>
<HR><P>
"Carmen?"</P>
"Hmmh, wer ist dran?" Ihre Stimme klang verschlafen.</P>
<P>
Sal blickte auf die Uhr in der Hotelhalle, es war kurz nach halb sechs Uhr
morgens.
Nachdem Tamie eingeschlafen war, hatte er sich behutsam aus ihren Armen
gewunden und war aus der Suite geschlichen. Ohne Licht zu machen, war er
durchs Hotel gewandert und hatte gegen&uuml;ber der Lobby einen M&uuml;nzfernsprecher
entdeckt.</P>

"Ich bin es, Sal, ist Frank bei dir?"</P>
"Frank kommt nie hierher", murmelte sie.</P>
"H&ouml;r zu, Carmen, ich hab nicht viel Zeit, jeden Moment wird das ganze Hotel
wach. Es hat geklappt, ich hab den Wagen."</P>
"Ich weiß, Frank hat gesch&auml;umt wie ein Hund."</P>
"Hast du die Telefonnummer von dem Araber?"</P>
"Er hei&szlig;t Habbas, wohnt im »Hilton«, welches Zimmer wei&szlig; ich nicht."</P>
"Wei&szlig;t du, was in dem Wagen ist?"</P>
"Nein, keine Ahnung, aber es mu&szlig; wertvoll sein, ich hab's dir gesagt."</P>
"Was k&ouml;nnen wir verlangen, was wollte der Araber Frank zahlen?"</P>
"Sal, woher soll ich das wissen, Frank spricht nicht mit mir &uuml;ber seine
Gesch&auml;fte."</P>
"Du hast den Rest ja auch herausgefunden, es ist wichtig!"</P>
"Sal, das war reiner Zufall!"</P>
"Carmen, ich kann nicht den Araber anrufen und wie ein Idiot auftreten, sonst
k&ouml;nnen wir es gleich vergessen."</P>
"Sal, ich bin nicht bescheuert, aber ich mu&szlig; vorsichtig sein. Das ist die
einzige Chance, die ich habe. Entweder es klappt, oder sie finden mich im
Flu&szlig;."</P>
"Carmen, h&ouml;r zu, wir haben nur diesen einen Trumpf in der Hand, tu was!"</P>
"Sal, okay, ich brauch ein bi&szlig;chen Zeit, gestern war Habbas in Franks
B&uum;ro,
ich stand die ganze Zeit an der T&uuml;r, aber sie haben nicht &uuml;ber Geld
gesprochen, der Araber hat nur dauernd von Wang erz&auml;hlt, den er kennt."</P>
"Was f&uuml;r ein Wang?"</P>
"Ein Chinese, mit dem Frank mal einen Haufen Auml;rger hatte, aber das war vor
meiner Zeit, ich wei&szlig; so gut wie nichts dar&uuml;ber."</P>
"Ein Chinese, huh?"</P>
"Ich bin sp&auml;ter bei Frank, ich tu, was ich kann, Sal, aber bleib cool. Und
pa&szlig;
auf, da&szlig; Franks Leute dich nicht finden. Die machen Hackfleisch aus dir."
"Wei&szlig;t du, wer hinter uns her ist?"</P>
"Keine Ahnung, aber es wird dieser Block sein, und wahrscheinlich hat er Tony
dabei. Tamie kennt die auch, frag sie."</P>
"Ich soll Tamie alles erz&auml;hlen?"</P>
"Ich bin zwar nicht begeistert, da&szlig; sie bei euch ist. Aber was hauml;tt' ich tun
sollen? Ihr vielleicht erz&auml;hlen, hey, Tamie, du bleibst besser hier, ich
versuch n&auml;mlich grad Frank zu verarschen, der eine war Sal. Was, du kennst
die? Ja, Tamie-schatz!"</P>
"Was sind das f&uuml;r Typen, Carmen?"</P>
"Ich hab ein paar Geschichten &uuml;ber Block geh&ouml;rt, huh, mir l&auml;ufts jedesmal kalt
&uuml;bern R&uuml;cken, wenn ich den seh. Sieht aus wie dein eigener Onkel, aber Frank
h&auml;lt ihn f&uuml;r seinen besten Mann, und du kannst die vorstellen, was das
hei&szlig;t!"
"Ich mu&szlig; Schlu&szlig; machen, Carmen, da taucht gerade ein Typ vom Hotel auf, ich
ruf dich an."</P>
"Sal, warte!"</P>
Er hatte schon den H&ouml;rer vom Ohr genommen, aber er h&ouml;rte sie rufen und nahm
ihn wieder auf.</P>
"Was?"</P>
"Mein Gott, Sal, h&ouml;r zu, ich habs beinahe vergessen. Ich hab nicht alles
mitbekommen, was der Araber gesagt hat, aber was immer es ist, es mu&szlig; in einer
der T&uuml;ren sein."</P>
"Pa&szlig; auf dich auf, Carmen."</P>
"Pa&szlig; du auf dich auf, Sal!"</P>

Als Sal zur&uuml;ck in die Suite kam, stand Moses am Fenster und sah auf die Berge,
eine riesige Mauer, &uuml;ber deren Sims gerade Streifen Licht kroch. Das Hotel
stand in einem Einschnitt dieser Felssperre, die die W&uuml;ste vom Bergland
trennte. Sal wunderte sich, Moses schon auf den Beinen zu sehen.</P>

"Hey, Moses, was ist los, schon auf?" Er legte ihm die Hand auf die Schulter.</P>
"Hm, ja, sind die nicht sch&ouml;n", sagte Moses, ohne sich umzudrehen. "Ich denke
gerade daran, wie wir damals auf dieser H&uuml;tte hoch oben gehaust haben. Mann,
war das kalt da, was, Sallie?"</P>
"Moses, ich mu&szlig; mit dir reden."</P>
"Quatsch, ich wei&szlig; alles."</P>
"Du wei&szlig;t alles?"</P>
"Sal, ich bin doch nicht blind, es macht mir nicht das geringste aus."</P>
"Ist dir vollkommen egal?"</P>
"Na, klar, sie ist nett, aber ich find sie ein bi&szlig;chen d&uuml;nn,
wei&szlig;t du."</P>
"Moses, ich will dir aber..."</P>
"Nun h&ouml;r schon auf, ist okay f&uuml;r mich, hab ich dir schon mal
Schei&szlig; erz&auml;hlt, hm?"</P>
"Nein, Moses, aber..."</P>
"Hey, ihr seid schon alles auf", sagte Tamie, als sie zur T&uuml;r reinkam und sich
die Augen rieb, "Bande von Fr&uuml;haufstehern hier, was?"</P>
"Ich hab Hunger, die sollen uns ein Fr&uuml;hst&uuml;ck reinrollen", sagte Moses und
ging zum Telefon hin&uuml;ber.</P>
<HR>
<H2 align=center>***</H2>
<HR><P>
"Guten Tag, Carl", sagte Ruiz in den H&ouml;rer.</P>
"Ruiz, lange nicht geh&ouml;rt, wie gehts deinen Kindern?"</P>
"Sie wachsen, Carl. Jedesmal, wenn ich sie sehe, sind sie ein St&uuml;ck gr&ouml;ßer."</P>
"Und Emma?"</P>
"Spricht kein Wort mit mir."</P>
"Schei&szlig;e, Ruiz, wie lang ist das jetzt schon her?"</P>
"Das sie mit mir gesprochen hat?"</P>
"Nein, ich meine die Scheidung."</P>
"Zweihundert Jahre, Carl."</P>
"Ruiz? Komm doch mal wieder vorbei, Martha fragt immer nach dir, sie macht uns
einen riesigen Braten, und dann quatschen wir wieder mal. Warst verdammt lang
nicht hier."</P>
"Gern, Carl. Aber ich ruf wegen was anderem an, euer Kommission war doch mal
an Barrault dran, wegen krimineller Vereinigung oder wie ihr das nennt."</P>
"Sind wir immer noch."</P>
"Ich hab drei Morde, Tankstelle drau&szlig;en in der W&uuml;ste. Reifenspuren von einem
Wagen, der vielleicht Barrault geh&ouml;rt, und ein Feuerzeug mit einem Monogramm: »F.B.«."</P>
"Nicht viel gegen einen wie Barrault."</P>
"Ich hab gerade erst angefangen, Carl."</P>
"Okay, Ruiz, wie kann ich dir helfen?"</P>
"Sag mir alles, was du &uuml;ber ihn wei&szlig;t."</P>
"Gut, bevor ich anfange, kennst du einen Wang Chu?"</P>
"Wie lange bin ich hier, Carl, seit gestern?"</P>
"Ruiz, du mu&szlig;t uns wirklich mal wieder besuchen kommen, ewig allein in deiner
Bude, das tut keinem gut auf Dauer."</P>
"Du hast recht, aber was ist mit dem Chinesen, Carl?"</P>
"Also gut, entspann dich und h&ouml;r zu. Barrault kontrolliert hier eine ganze
Menge, mu&szlig; ich dir nicht erz&auml;hlen, aber der ist mehr ein Einzelk&auml;mpfer. War
aber schon hier, da gabs &uuml;berhaupt noch keine Gelben in der Stadt. Wang ist
die chinesische Familie. Kennst die Bande, wiegen ihr Geld auf Paletten, wenn
sie einen Deal machen, Verbindungen, wei&szlig; der Teufel wie weit. Also, Wang
taucht auf mit seinem Clan, schon gehts los. Zers&auml;gen einen von Barraults
Dealern in St&uuml;cke und werfen sie in den Flu&szlig;. Appetithappen oder Warnung, bei
den Schlitzaugen blickst du nicht durch. Barrault nimmt es pers&ouml;nlich, holt
sich den Schwager von Wang, betoniert ihm die Schuhe und schickt ihn
schwimmen. Wir finden ihn in einer Schiffsschraube. Gibt einen blutigen Krieg,
Wang verliert eine Menge Leute, Frank noch mehr. Die Sache beginnt teuer zu
werden. Wir haben hier so einen Finanzfreak, der hat mal nachgerechnet.
Sch&auml;tzt, da&szlig; Frank zwei Jahre s&auml;mtliche Einnahmen und einige seiner Reserven
f&uuml;r Leute, Waffen, Logistik, Uuml;berwachung und seinen pers&ouml;nlichen Schutz
ausgegeben hat. F&uuml;r Wang ist es auch nicht gerade ein Spaziergang, kann sich
aber schon mal was erlauben, mit dem Geld des Clans hinter sich. Dann aber
k&ouml;nnen sie beide ihre Kunden nicht mehr richtig versorgen, die Dealer trauen
sich nicht mehr aus den L&ouml;chern, und die Konkurrenz wird schon neugierig. Dann
machen sie die Sache klar. Sollen sich sogar getroffen und Tee getrunken haben
zusammen. Frank und Tee, kannst du dir das vorstellen, Ruiz? Frank mu&szlig; ein
paar Dinge aufgeben und sich strikt an gewisse Grenzen halten. Mit dem Stoff
macht er Schlu&szlig;. Da, wo am meisten Geld war, h&auml;tten die Schlitzaugen niemals
nachgegeben, auch wenn sie die ganze Stadt in die Luft h&auml;tten sprengen
m&uuml;ssen, um den letzten seiner Dealer zu kriegen. Seit f&uuml;nf Jahren ist jetzt Ruhe. Erst
seit letzten Sommer siehst du Frank wieder ohne eine Horde Leibw&auml;chter aus dem
Haus gehen. Scheint sich sicher zu f&uuml;hlen. Du wei&szlig;t ja, Ruiz, wie die das
sehen. Solange es allen gutgeht, schei&szlig;t keiner dem anderen vor die
T&uuml;r. Frank hat sowiesio nur die Kr&uuml;mel, den Kuchen teilen sich die Chinesen."</P>
"Und ihr?"</P>
"Wir haben erst letzte Woche wieder einen V-Mann verloren, kannte ihn gut."</P>
"Wie?"</P>
"Italienisch, Ruiz, hatte seine Eier im Mund. Seidem die den »Paten« im Kino
gesehen haben, versuchen sie auch noch witzig zu sein. Laufen pl&ouml;tzlich in
Maßanz&uuml;gen rum und denken sich Rituale aus."</P>
"Was haben wir f&uuml;r einen Job, Carl?"</P>
"Den beschissensten von allen, w&uuml;rd' ich sagen."</P>
"Haben wir eine Chance?"</P>
"Gegen die? Freu dich, wenn du mal jemanden einen Mord anh&auml;ngen kannst, der zu
dir ins B&uuml;ro kommt und schw&ouml;rt, er wars. Viel mehr ist es nicht."</P>
"Vielleicht hast du recht, Carl, ich sollte euch mal wieder besuchen, dich und
Martha."</P>
"Wir w&uuml;rden uns freuen, Ruiz."</P>
"Gr&uuml;&szlig; sie von mir."</P>
"Mach ich, Ruiz."</P>
<BR>
Ruiz legte auf und blickte aus dem Fenster seines B&uuml;ros. Das &uuml;bliche
mu&szlig;te jetzt getan werden, hinfahren zu denen, rauf auf die H&uuml;gel am Rande der Stadt,
großes Geld, große H&auml;user. Er w&uuml;rde seinen klapprigen Dienstwagen in einer
schattigen Allee parken und schnaufend ihre Einfahrften, lang und breit wie
ein Fußballfeld, hinaufkeuchen. W&auml;hrend er vor der T&uuml;r wartete,
w&uuml;rde er sich erinnern, da&szlig; er seit Monaten neue Schuhe hatte kaufen und den Knopf an seinen
Trench hatte ann&auml;hen wollen. &Uuml;ber eine dichte Hecke, der japanische
G&auml;rtner gerade mit einer Nagelschere den letzten Schliff gaben, w&uuml;rde man das leise
»Plopp«, »Plopp« vom Privattennisplatz des Nachbarn h&ouml;ren. Herrgott noch mal!
Und dann w&uuml;rde man seine d&auml;mlichen Fragen stellen, und wenn man einen
Spitzentag hatte, bekam man noch ganze drei d&auml;mlichere Antworten, bevor der
Kerl in seinem Seidenpyjama sagen w&uuml;rde, ach , Kommissar, haben sie Dr.
Soundso schon kennengelernt, wir wollten geade zusammen fr&uuml;hst&uuml;cken. Warten
Sie, ich hol ihn schnell, oder wollen Sie einen Happen mitessen? Nein? Also,
zuf&auml;llig ist er mein Anwalt, vielleicht rufen Sie ihn n&auml;chste Woche mal an und
fragen ihn. Er wei&szlig; viel besser, wo ich zu der und der Zeit immer so bin.</P>
<BR>
So war das, und er konnte diesen Abschaum nicht einfach packen, ihn Arsch
voraus auf den Marmorboden bef&ouml;rden, ihm mit einer Bronzeskulptur, die aussah
wie ein kackender B&uuml;ffel, das Knie zertr&uuml;mmern und dann sagen, Frankie, du
Dreckskerl! Sag, was du wei&szlig;t, oder ich stopf dir diesen Vier-Polizisten-
Jahresgeh&auml;lter-Seidenteppich in den Hintern!</P>
<BR>
Nein, statt dessen sah er sich jetzt tats&auml;chlich seine Schuhe an und wartete,
bis jemand diese original f&uuml;nf Tonnen indisches Palasttor vor seiner Nase
&ouml;ffnen w&uuml;rde.</P>
<HR>
<H2 align=center***></H2>
<HR><BR>
"Frank?"</P>
<BR>
Carmen steckte vorsichtig den Kopf ins Badezimmer, Frank hatte sie sp&auml;t in der
Nacht noch in ihrem Appartment angerufen, sie solle ihren Arsch bewegen und
herkommen. Er schickte sie zwar nicht mehr auf den Strich seit ein paar Jahren,
aber sie hielt es auch nicht für einen Fortschritt, Franks Privatspielzeug zu
sein.</P>
<BR>
"Was ist jetzt schon wieder, Carm?"</P>
"Da ist ein Kommissar, der dich sprechen will."</P>
"Nicht schon wieder dieser Schei&szlig;-Rusi oder wie der hei&szlig;t."</P>
"Er sagt, er hei&szlig;t Ruiz."</P>
"Ja, ja, zeig ihm das Wohnzimmer, ich komme."</P>
<BR>
Ruiz stand in einem sechs Meter hohen Raum und blickte durch get&ouml;nte Glasscheiben
hinunter auf das H&auml;usermeer der Stadt, das hei&szlig;t auf soviel davon,
wie sich jenseits eines Pools von der Gr&ouml;&szlig;e des st&auml;dtischen Schwimmbads erkennen
lie&szlig.</P>
<BR>
"Aaaah, Kommissar Rusi, was f&uuml;r eine Ehre!"</P>
"Guten Tag, ich komme doch nicht ungelegen?" sagte Ruiz und drehte sich nach
Frank um, der in Shorts und einem Poloshirt mit ausgebreiteten Armen ins
Wohnzimmer stolzierte.</P>
<BR>
"Sie sind mir immer wollkommen, Kommissar. Sie wissen, ich helfe euch Jungs, wo
ich kann!"</P>
<BR>
Der Kerl hatte das Grinsen eines Schmierenkom&ouml;dianten im Gesicht, der sich
f&uuml;r einen verkannten Oscar-Anw&auml;rter h&auml;lt.</P>
<BR>
"Einen sch&ouml;nen Garten haben Sie, ich h&auml;tte mich beinahe verlaufen", sagte Ruiz
und blickte wieder durchs Fenster.</P>
"Was kann ich f&uuml;r Sie tun, Kommissar?"</P>
<BR>
Frank lie&szlig; sich in einen orangenfarbenen Kalbsledersessel fallen. Anscheinend
war Orange im Moment die Farbe. An der Wand hingen Gem&auml;lde mit orangenen
Strichen und Punkten, einige zeigten regelm&auml;ßig Quader in derselben Farbe.</P>
<BR>
"Ich habe geh&ouml;rt, Sie fahren einen wunderbaren Wagen, was Offenes, soll nicht
mehr viele davon geben", sagte Ruiz und drehte sich um.</P>
"Kann sein, wollen Sie ihn kaufen, Kommissar?"</P>
"Ich hab schon einen Wagen."</P>
"W&auml;r leider auch nicht m&ouml;glich gewesen, ich wollte gerade Ihren Kollegen
anrufen, man hat ihn mir gestohlen."</P>
"Bedauerlich so was", sagte Ruiz.</P>
"Ja, sehr. Stellen Sie sich vor, ich sitze mit Carmen, die Sie gerade gesehen
haben, und meiner Nichte ..."</P>
<BR>
Man konnte es beinahe nicht glauben, der Kerl &uuml;bte anscheinend vor dem Spiegel.
Er brachte so etwas wie den &Auml;rger eines aufrechten Kleing&auml;rtners
&uuml;ber die Schlechtigkeit der Menschen in sein Gesicht.</P>
<BR>
"Sie haben Geschwister?"</P>
"Was, wieso? Also ich sitze im Restaurant, will pissen gehen, da schlagen mich
zwei zusammen, sehen Sie sich meine Nase an, rauben mich aus und stehlen mir den
Wagen, was sagen Sie dazu?"</P>
<BR>
Den Kleing&auml;rtner lie&szlig; er jetzt wieder weg, es kam wieder der Frank zum
Vorschein, der immer noch selbst bei einem M&auml;dchen und Klubs das Geld abholte
und einem Restaurantbesitzer, mit dem er &uuml;ber die Rechnung stritt, eine halbe
Stunde sp&auml;ter in einer Seitengasse in den Kopf scho&szlig;.</P>
<BR>
"Machen Sie eine Anzeige", sagte Ruiz.</P>
"Ich sagte doch, wollte Sie gerade anrufen."</P>
"Kennen Sie einen Tony Sacchi?" Ruiz besah sich die Sammlung orangener
Tierskulpturen auf einer Mahagonianrichte.</P>
"Skakki? Kollege von Ihnen, nimmt der meine Anzeige auf?"</P>
"Ich glaube nicht", sagte Ruiz.</P>
"Hm, ich kenn eine Menge Leute, aber der Name sagt mir im Moment nichts."</P>
"Wann war das mit Ihrer Nase?"</P>
"Vorgestern abend, fragen Sie Carm?"</P>
"Und wann hat man den Wagen gestohlen?"</P>
"Na, gleich danach."</P>
"Wenn der Wagen wieder auftaucht, sagen Sie mir dann Bescheid? Ich mag Autos."</P>
"Ich mag Sie, Kommissar, wenn ich Ihnen irgendwie mal helfen kann, lassen Sie es
mich wissen!"</P>
<BR>
Wie lange stand man vor einem Spiegel, um das Gesicht so verziehen zu k&ouml;nnen?</P>
<BR>
"Ich komme auf Sie zu", sagte Ruiz.</P>
"Tun Sie das." Frank stand auf und breitete wieder die Arme aus, das
gr&ouml;&szlig;te Bedauern, den Jungs von der Polizei nicht besser helfen zu
k&ouml;nnen, im Gesicht.
Ruiz dachte an die schauspielerischen Qualit&auml;ten von Pornodarstellern.</P>
<BR>
"Ach, ich habe Ihr Feuerzeug gefunden", sagte Ruiz und zog etwas aus der Tasche.</P>
"Zeigen Sie her, woher haben Sie's?" fragte Frank und kam einen Schritt n&auml;her.</P>
<BR>
Seine Augen verrieten &Auml;rger, aber keinerlei Sorge, so als ob Ruiz ein
G&auml;rtner w&auml;re, der Frank gerade erz&auml;hlt, ein Tennisball h&auml;tte in die Gartenhecke
eingeschlagen und das Werk eines ganzen Tages Nagelscherenarbeit zerst&ouml;rt.</P>
<BR>
"Tony Sacchi hat es mir gegeben"</P>
<BR>
Frank zuckte nicht mal, nur sein &Auml;rger &uuml;ber diese l&auml;stige
St&ouml;rungen schien sich zu steigern, mehrere Tennisb&auml;lle hatten in die Hecke eingeschlagen, und drei
Tage Arbeit war im Eimer.</P>
<BR>
"Frank?"</P>
<BR>
Die Frau, die Frank »Carm« nannte, kam z&ouml;gernd herein, sie war nicht mehr ganz
jung, aber sie hatte klare Gesichtz&uuml;ge, und ihr K&ouml;rper war jugendlich. Als sie
Ruiz die T&uuml;r ge&ouml;ffnet hatte, war ihm eine merkw&uuml;rdige Entschlossenheit in ihren
Augen aufgefallen. An ihrer Wange hatte er eine kleine Schramme registriert.
Jetzt wo sie Frank ansprach, wirkte sie z&ouml;gerlich, aber dennoch hatte sie diesen
Blick in ihren Augen. Ruiz dachte an sich selbst, wie er mit Carl telefoniert
hatte, dieses Gef&uuml;hl, einen Weg zu gehen, auf dem nicht viel zu gewinnen war,
und es dennoch immer wieder zu versuchen.</P>
<BR>
"Carm, was ist denn, du siehst doch, da&szlig; gerade mit dem Kommissar spreche, mach
die T&uuml;r wieder zu und verschwinde."</P>
<BR>
Frank sprach wie zu sich selbst, mit einem Ton gereizter Langeweile, er sah sie
nicht einmal an. Ruiz stellte sich vor, wie Frank sie schlagen w&uuml;rde, wenn ihm
danach war.</P>
<BR>
"Es ist nur, Habbas ruft gerade an und ..."</P>
<BR>
Es schien ihr wichtig zu sein, da&szlig; Frank den Anruf entgegennahm, es war nicht,
als ob Franks Bankier anrufen w&uuml;rde, um ihm eine neue phantastische Anleihe
aufzuschw&auml;tzen, f&uuml;r die die Bank die Platzierung &uuml;bernommen hatte.</P>
<BR>
"Ich wollte sowieso gerade gehen", sagte Ruiz.</P>
"Aber nein, Kommissar, bleiben Sie doch noch!"</P>
"Ein andermal."</P>
<BR>
Ruiz beeilte sich. Er lief die Einfahrt von Frank Anwesen hinunter, erinnerte
sich an die Telefonzelle, die ihm aufgefallen war, als er den Wagen an der
Stra&szlig;e geparkt hatte. Er hatte Gl&uuml;ck, die Zelle war frei, er
ri&szlig; die Tür auf, schon im Laufen hatte er M&uuml;nzen hervorgeholt. Er war
ein wenig au&szlig;er Atem, als sich die altvertraute Stimme seines Freundes meldete.</P>
<BR>
"Carl, ich brauch deine Hilfe, aber mach schnell! Ihr kennt euch doch mit dem
Kram aus. Ich steh hier in einer Telefonzelle vor Barraults Haus. Ruf die vom
Amt an, sie sollen dir sagen, von wo Frank gerade angerufen wird!"</P>
"Ruiz, wei&szlig;t du, was du verlangst, es gibt da ein paar Vorschriften ..."</P>
"Carl, tu mir den gefallen und verschon mich mit dem Bl&ouml;dsinn! Da&szlig;
ihr f&uuml;r solche F&auml;lle nicht schon eine Standleitung eingerichtet habt, ist doch alles."</P>
"Ruiz, du bist von der Mordkommission, und ich bin ..."</P>
"Du tust es f&uuml;r mich, Carl, und nicht f&uuml;r die beschissene Mordkommission, okay?"</P>
"Bleib dran!"</P>
<BR>
Ruiz schnappte nach Luft, verdammt, er sollte nicht soviel rauchen, dachte er.</P>
<BR>
"Ruiz?" meldete sich Carl wieder.</P>
"Ja."</P>
"Es war hier in der Stadt, das »Hilton«, willst du auch die Zimmernummer?"</P>
"Nein, ich hab zum Spa&szlig; angerufen", sagte Ruiz, "kennst du einen Habbas?"</P>
"Die Zimmernummer ist 904. Meinst du Rashid Habbas?"</P>
"Habbas spricht mit Frank?"</P>
"Sieht so aus, Carl."</P>
"Wei&szlig;t du, das ist merkw&uuml;rdig. Habbas ist gro&szlig; im Gesch&auml;ft mit Papier. Er ist
ein H&auml;ndler, nicht die Sorte, die ich mit Frank in denselben Topf werfen
w&uuml;rde."</P>
"Papier, Carl?"</P>
"Pl&auml;ne f&uuml;r Waffen, milit&auml;rische Anlagen, Geheimdokumente und so weiter."</P>
"Was meinst du, wie macht er das?"</P>
"Du meinst, die Sachen rausschaffen?"</P>
"Hm."</P>
"Er ist verdammt gerissen, dein Habbas. Ich kenn ein paar Geschichten. Kein
Mensch wei&szlig;, ob sie stimmen, man hat noch nie etwas gefunden bei ihm. Einmal
hatte er ein Schiff gechartert, er selber ist aber zum Flughafen gefahren. An
der Pa&szlig;kontrolle haben sie ihn auseinandergenommen, sie haben ihm einen Finger
in den Hintern gesteckt und ihn sogar ger&ouml;ntgt. Nichts. Riesenaufregung. Wo ist
das Boot? K&uuml;stenwache, Hubschrauber und so weiter. Bringen das Boot auf, ein
paar schl&auml;frige Typen an Bord. Schleppen es zur&uuml;ck in den Hafen, holen es aus
dem Wasser und zerlegen die Jacht bis zur letzten Schraube. Ein ganz Pfiffiger
hat sogar Vollholzplanken zers&auml;gen lassen. Nichts. Den Rest kannst du dir
vorstellen. Der verantwortliche Beamte f&auml;hrt jetzt Streife in einem
F&uuml;nfhundert-Seelen-Dorf, oben im Norden. Das Boot war zw&ouml;lf Millionen wert -
bevor sie es zerlegt haben, mein ich."</P>
"Das ist also Habbas, hm ..."</P>
"Ja, Ruiz. Rashid Habbas."</P>
"Und du glaubst, Frank ist eine Nummer zu klein f&uuml;r den?"</P>
"Drei Nummern, Ruiz."</P>
"Was will er denn von ihm?"</P>
"Vielleicht kauft er was anderes oder will sich am&uuml;sieren, Frank hat mehr im
Angebot."</P>
"Einen Wagen ..."</P>
"Wie kommst du auf einen Wagen, Ruiz?"</P>
"Nur so, Carl."</P>
<BR>
Ruiz ging wieder zur&uuml;ck zu seinem Wagen. Er setzte sich ans Steuer und blickte
auf die L&ouml;wen an Franks Einfahrt. Wo war der Zusammenhang? &uuml;berlegte er. Habbas
telefoniert mit Frank, einer von Franks M&auml;nnern liegt mit gespaltenem
Sch&auml;del an einer Tankstelle, Frank behauptet, sein Wagen w&auml;re geklaut, und seine Nase ist
gebrochen. Der Wagen f&auml;hrt durch die W&uuml;ste, mitsamt einem Dutzend Motorradfahrer.
Franks Mann, Tony, tr&auml;gt Motorradstiefel, und Franks Feuerzeug liegt neben einer
toten Frau.</P>
<BR>
Gab es &uuml;berhaupt einen Zusammenhang?</P>
<BR>
Um dieser Carmen noch ein bi&szlig;chen auf den Zahn zu f&uuml;hlen, war es zu
sp&auml;t gewesen. Das mit dem Telefonat herauszukriegen, war im Moment wichtiger.
Au&szlig;erdem w&uuml;rde es besser sein, sie allein zu erwischen, wenn Frank nicht dabei
war.</P>
<BR>
Wo mu&szlig;te man ansetzen? Wo war der Schl&uuml;ssel zu dieser Geschichte?</P>
<BR>
Der Wagen f&auml;hrt durch die W&uuml;ste, mitsamt einem Dutzend Motorradfahrer. Franks
Mann, Tony, tr&auml;gt Motorradstiefel, und Franks Feuerzeug liegt neben einer toten Frau.</P>
<BR>
Der Wagen f&auml;hrt durch die W&uuml;ste. Er mu&szlig;te den Wagen finden!</P>
<BR>
Die L&ouml;wen an Franks Einfahrt sahen kitschig aus, aber es war eine Wohltat
f&uuml;rs Auge, da&szlig; sie wenigstens nicht orange waren.</P>
<BR>
Ein kleiner Zuh&auml;lter, der sich nach oben gek&auml;pft hatte, &uuml;berlegte Ruiz; er
schnappte sich das Funkger&auml;t.</P>
<BR>
"Charlie vier sieben an Zentrale, bitte kommen."</P>
<BR>
Ruiz schaltete auf Empfang und mu&szlig;te einen Moment warten. Es rauschte, und dann
knackte es, als sich eine weibliche Stimme meldete.</P>
<BR>
"Hier Zentrale, was kann ich f&uuml;r dich tun, einsamer J&auml;ger?"</P>
"Du k&ouml;nntest mal wieder mit mir Essen gehen", sagte Ruiz.</P>
"Springst du dann wieder in meine Suppe und h&auml;lst dem Mann am Nachbartisch deine
Kanone unter die Nase, wie letztes Mal?"</P>
"Nein, wir k&ouml;nnten bei mir essen."</P>
"Ravioli oder Dosenbier?"</P>
<BR>
Es klang nicht sp&ouml;ttisch, ihre Stimme war ganz sanft.</P>
<BR>
"H&ouml;r zu, ich hab was f&uuml;r dich, gib eine Fahndung raus, ich geb dir die Daten."</P>
"Ich h&ouml;re."</P>
<BR>
Nachdem er ihr den Wagen beschrieben hatte, sagte er, ich ruf dich an die
Tage, und sie meinte noch, da&szlig; sie auch bei ihr essen k&ouml;nnten, dann
h&auml;ngten sie auf.</P>
<BR>
Ruiz steckte sich eine an und blies den Rauch gegen die Scheibe. In diesem
Moment rollte aus Franks Einfahrt ein Wagen, ein japanisches Modell, das
ziemlich klapprig aussah. Hinter dem Steuer erkannte Ruiz die Frau, die ihm
ge&ouml;ffnet und die Frank »Carm« genannt hatte.</P>
<HR>
<H2 align=center>***</H2>
<HR><BR>
Sal kam aus dem Badezimmer und blieb einen Moment vor dem großen Fenster stehen,
das eine ganze Wand des Wohnzimmers ihrer Suite einnahm. Seine Haut war wieder
sauber, aber es kam ihm vor, als w&uuml;rde darunter eine schwarze, klebrige Masse
durch seine Adern flie&szlig;en.</P>
<BR>
Die Bergkette gegen&uuml;ber dem Hotel war erst umri&szlig;haft zu erkennen, die Grate und
Gipfel hoben sich scharf vor dem dunstigen Blau des Himmels ab, aber die Flanken
der Steinriesen lagen noch immer in lichtlosem Schatten. Die Sonne hing als
helle Scheibe in einer Scharte fest und tastete mit ein paar Lichtstrahlen ins
Zimmer.</P>
<BR>
Sal wandte sich wieder vom Fenster ab, er hatte eine schnelle Dusche genommen,
seine Haare waren noch na&szlig;, er schlurfte zu den beiden anderen, die schon beim
Fr&uuml;hst&uuml;ck sa&szlig;en. Die Hotelmannschaft mu&szlig;te inzwischen wieder eine ganze
Servierwagenkolonne ins Zimmer gerollt haben.</P>
<BR>
Auf dem Tisch standen riesige Teller mit gebratenen Eiern und Speck, zwei Kannen
Kaffee, frisch gepreßter Orangensaft, M&uuml;sli mit kleingeschnittenen
Fr&uuml;chten, Br&ouml;tchen, ein Korb Schwarzbrot, eine K&auml;se- und zwei Wurstplatten, eine Kanne
hei&szlig;er Schokolade, ein paar Salate, gegrillte W&uuml;rstchen, ein Krug kalter Milch,
Apfelpfannkuchen, Trauben, Bananen, Kiwis, weichgekochte Eier, drei Gl&auml;ser
Tomatensaft, ein paar Schalen Joghurt, eingelegte Pfirsische und eine Schale
N&uuml;sse.</P>
<BR>
Es war Moses gewesen, der sich um die Bestellung gek&uuml;mmert hatte.</P>
<BR>
Die anderen langten ordentlich zu, aber Sal hatte keinen Appetit. Er a&szlig; ein
bi&szlig;chen von den Eiern, um das flaue Gef&uuml;hl im Magen zu vertreiben, und er hatte
noch nicht zuende gekaut, da steckte er sich schon eine Zigarette in den Mund.
Er machte einen tiefen Zug und dachte an das Telefonat mit Carmen.</P>
<BR>
"Hey, Sallie-Boy", sagte Moses, "was machen wir mit dem Wagen, wir k&ouml;nnten ihn
zu Geld machen, was meinst du?"</P>
"Ja, daran habe ich auch schon gedacht. Ich hab da ein paar Ideen", sagte Sal.</P>
Er starrte mit leeren Blick einen Punkt an der Wand an.</P>
"Gut, welche?"</P>
"La&szlig; mich nur machen, Moses."</P>
<BR>
Sal fiel Asche auf den Teller, und er verbrannte sich die Finger. Tamie sah ihn
mit gro&szlig;en Augen an und spitzte den Mund, er fabrizierte ein schwaches
L&auml;cheln auf sein Gesicht. Sie strahlte ihn an. Sie waren auf Wolken durch die Nacht
gedriftet, tief unten hatte Frank gestanden, dann waren sie h&ouml;her und
h&ouml;her gewirbelt, und Frank war weit unten verschwunden. Sie kamen weiter und weiter
hinauf, und einen kurzen Moment hatte er das Licht gesehen. Er konnte sich nicht
erinnern, ihm schon einmal n&auml;her gewesen zu sein, als in dieser Nacht. Am
liebsten w&auml;re er jetzt aufgesprungen, h&auml;tte Tamie gepackt und sie im Zimmer
herumgewirbelt, aber er f&uuml;hlte sich wie ein umgefallener K&auml;fer, der mit den
Beinen in der Luft herumruderte, um wieder auf die F&uuml;&szlig;e zu kommen. Die Welt
stand kopf, und er strampelte und keuchte, und mit dem Kopf am Boden sah er eine
Planierraupe auf sich zurollen.</P>
<BR>
Es war so viel, was er ihr sagen wollte, aber er wu&szlig;te nicht mal, wo er
h&auml;tte anfangen sollen. Was er nicht sagen wollte, aber unbedingt mu&szlig;te, war: Lauf weg,
Tamie, jetzt sofort und so schnell du kannst, stell dich an die Stra&szlig;e in deinem
Sommerkleid, halt den N&auml;chstbesten an und steig erst Lichtjahre wieder aus!
Herrgott noch mal, bist du blind? Wir sind vielleicht losgezogen, um das Licht
zu suchen, aber viel eher reiten wir direkt in die H&ouml;lle. Allein kannst du's
schaffen, mach dich aus dem Staub, bevor es zu sp&auml;t ist!</P>
<BR>
Und dann Moses, der einzige Freund, den er hatte, der ritt einfach mit, und er
hatte ihm nicht mal gesagt, wohin. Moses w&auml;re auch so von Anfang an
dabeigewesen, aber nicht, weil der auch nicht anders konnte wie er, sondern weil
er jeden Dreck mitmachte. Moses hatte noch nie an die Folgen von irgend etwas
gedacht, aber der h&auml;tte dennoch nicht eine Kiste wie die vorgeschlagen. Wenn man
Moses Chips in die Hand gab, dann spielte er auch, aber er lief nicht herum und
suchte nach dem Casino. Deswegen ging es auch nicht darum, ob er Moses alles
gesagt h&auml;tte oder nicht, er hatte Moses gar nichts gesagt. Der Punkt war, er
h&auml;tte es alleine, ganz alleine mit Carmen tun m&uuml;ssen, die wu&szlig;te, was sie da tat,
verdammt, so sah das Spiel jetzt aus, keine Zeit mehr, die Karten neu zu
mischen, es lag jetzt an ihm, entweder - oder, was du anf&auml;ngst, ziehst du durch
und Ende, so war das eben.</P>
<HR>
<H2 align=center>***</H2>
<HR><BR>
Block hielt an und kramte eine Karte hervor. Es hatte keinen Sinn, geradeaus
f&uuml;hrte die Stra&szlig;e durch die W&uuml;ste, dann war er in der n&auml;chsten Stadt. Auf dem
Abzweig nach Osten stieg die Stra&szlig;e an, und man fuhr &uuml;ber den
Pa&szlig; durch die Berge, von dem ein paar Seitenstra&szlig;en abzweigten.</P>
<BR>
Er w&uuml;rde umkehren und zur&uuml;ck zu diesem Rastplatz fahren, den er gerade gesehen
hatte. Dann sollte er wohl besser Frank anrufen, &uuml;berlegte er, vielleicht hatte
der eine Idee. Und vor allem w&uuml;rde er etwas essen und sich ein Bier genehmigen.
Es hing ihm zum Hals heraus. Er war jetzt schon mehr als drei&szlig;ig Stunden am
St&uuml;ck unterwegs und hatte nur drei, vier Stunden geschlafen, als Tony gefahren
war, und das konnte man auch nicht gerade als Schlaf bezeichnen.</P>
<BR>
Er wendete den Wagen und fuhr ein paar Kilometer zur&uuml;ck. In der
Rastst6auml;tte bestellte er sich erst einen Teller mit Kartoffeln und ein Bier, dann machte er
sich auf den Weg zum Telefon.</P>
<BR>
"Frank, hier ist Block", sagte er, als es in der Leitung klickte.</P>
"Hast du den Wagen?"</P>
"Noch nicht, Frank. Das ist nicht so einfach."</P>
<BR>
Er erkl&auml;rte ihm die Situation und konnte h&ouml;ren, wie Frank schnaufte.</P>
<BR>
"Block, du schaffst das nicht, ich schick dir ein paar Leute nach."</P>
<BR>
Block erstarrte, Frank hatte ihn immer alleine arbeiten lassen. Nur Tony hatte
er meistens dabeigehabt. Das bedeutete nichts Gutes. Ein flaues Gef&uuml;hl stieg in
ihm hoch.</P>
<BR>
"Frank, das ist ein Klacks, wenn ich die erst mal habe, dann geh&ouml;ren die mir."
"Block, wir haben keine Zeit, dieser Rusi war bei mir, der hat gesehen, was ihr
f&uuml;r eine Schei&szlig;e an der Tankstelle gebaut habt, ich mu&szlig;te sogar den Wagen als
gestohlen melden."</P>
"Die fahnden nach dem Wagen?" In Block arbeitete es, er mu&szlig;te das alleine
hinkriegen, sonst war er geliefert.</P>
"Was werden die wohl tun, Block? Eine Annonce aufgeben, Wagen entlaufen, seine
Mama vermi&szlig;t ihn sehr?"</P>
"Frank, kennst du niemanden von den Bullen? Wenn die den gefunden haben, dann
sollen sie es dir sagen, und ich fahr hin und hol ihn."</P>
"Block, das ist doch gequirlte Schei&szlig;e, wenn die Bullen den finden, dann haben
die ihn schon. Ich kann nicht den ganzen Laden schmieren."</P>
"Frank, ich schaff das schon irgendwie."</P>
"Schei&szlig;e, Block, du erzählst Schei&szlig;e, ich sag dir, was du tust. Du
f&auml;hrst in die Berge, wenn du meinst, okay, fahr in die Berge, soll mir recht sein. Und ich
schick ein paar Leute los, die fahren in diese Schei&szlig;stadt da. Die finden die
da schon!"</P>
<BR>
Frank hatte einfach aufgelegt. Block wischte sich &uuml;ber die Stirn. Niemand, der
einen Wagen klaute, f&auml;hrt in die Berge, die fahren in eine Stadt, und dann
verkloppen die den und hauen ab. Wenn Frank ihn in die Berge schickte, dann
brauchte er gar nicht mehr zur&uuml;ckzufahren. Frank hatte Witze gemacht, er hatte
ihn verarscht, Frank machte nie Witze, wenn es um einen Job ging, es sei denn,
Herrgott - er war drau&szlig;en!</P>
<BR>
»Die finden die dann schon«, hatte Frank gesagt, es war nicht mehr sein Job,
fahr hin, wohin du willst, das hatte er gemeint, Frank k&uuml;mmerte sich jetzt
selbst darum - auf einmal -, der k&uuml;mmerte sich nie um was selbst,
daf&uuml;r war er da, aber er hatte versagt; wenn er zur&uuml;ckfuhr, brachte er besser gleich einen
Sarg f&uuml;r sich mit. Schei&szlig;e.</P>
<HR>
<H2 align=center>***</H2>
<HR><BR>
Sal zog an einer neuen Zigarette und schaute aus dem Fenster, als ob dort etwas
Wichtiges passieren w&uuml;rde.</P>
<BR>
"Ich finde, wir sollten den Wagen schnell loswerden, Frank sucht ihn bestimmt",
sagte Tamie; sie wirkte munter, sie begriff nichts, sie war einfach abgehauen,
in den Wagen eingestiegen und mitgefahren.</P>
<BR>
"Er schickt Leute hinter uns her", sagte Sal abwesend.</P>
"Woher willst du das wissen?" fragte Moses und sah ihn an.</P>
"Davon gehe ich aus." Sal starrte noch immer aus dem Fenster.</P>
"Wir k&ouml;nnten die zwei von der Tankstelle anrufen", schlug Tamie vor, "vielleicht
haben sie was gesehen."</P>
<BR>
Sie redete, als ob es sich lediglich um ein technisches Problem handelte,
da&szlig; Frank ihnen ein paar Killer hinterhetzte. Man rief mal irgendwo an, um es
genauer zu wissen, und das wars auch schon.</P>
<BR>
"Am Ende haben die b&ouml;sen Buben sogar dort getankt", grinste Moses.</P>
"B&ouml;se Buben?" Sal sah ihn an, er schien etwas runterzuschlucken.</P>
"Du hast recht", sagte er dann, "wir k&ouml;nnen es probieren. Ich habe
Streichh&ouml;lzer von dort mitgenommen, vielleicht steht die Telefonnummer drauf."</P>
<BR>
Sal kramte in seinen Taschen.</P>
Wie auch immer, sie hatten alle Karten in der Hand, die Eins&auml;tze lagen auf dem
Tisch, wer jetzt ausstieg, verlor alles, und es wurde langsam Zeit, dem Gegner
ins Auge zu sehen und zu spielen.</P>
<BR>
"Ja, da steht die Nummer", sagte Sal, "ich geh mal runter in die Halle und ruf
an."</P>
"Sallie-Baby", kr&auml;hte Moses, "ist nicht mehr wie fr&uuml;her bei uns, wir haben
Telefoohoon auf dem Ziihiimmer!"</P>
"Hmmh, ist nicht mehr wie fr&uuml;her, huh!" sagte Sal und ging zum Telefon.</P>
<BR>
Er w&auml;hlte, es klickerte ungew&ouml;hnlich lang, dann kam der Ruf durch.</P>
<BR>
"Polizeidienststelle II, Ruiz, kann ich Ihnen helfen?"</P>
<BR>
Sal legte auf. "Ich habe mich verw&auml;hlt", sagte er und sah die anderen an. Er
hielt den Telefonh&ouml;rer und das Streichholzbriefchen in einer Hand und
w&auml;hlte Nummer für Nummer noch mal.</P>
<BR>
"Polizeidienststelle II, Ruiz, kann ich Ihnen helfen?"</P>
<BR>
Sal wollte gerade wieder auflegen, da sagte die Stimme am anderen Ende:</P>
<BR>
"H&ouml;ren Sie, legen Sie nicht auf, ich habe eine Nachricht f&uuml;r Sie!"</P>
<BR>
Sal sagte nichts, aber pre&szlig;te den H&ouml;rer ans Ohr. Hatten die anderen sich neue
Karten geben lassen? Hatten sie die Regeln ge&auml;ndert?</P>
<BR>
"Sie wollten eine Tankstelle anrufen, richtig?" sagte die Stimme.</P>
"Ja."</P>
"Haben Sie eine Panne?"</P>
"Nein, nicht direkt."</P>
"Sind Sie ein Verwandter?"</P>
"Hmmh, ja, so was &Auml;hnliches."</P>
<BR>
Sal tippte auf sein Handgelenk und winkte Moses, er sollte r&uuml;berkommen. Moses
verstand und kam zu ihm. Sal packte seinen Arm und sah auf die Uhr, er hatte
irgendwo gelesen, es dauert drei&szlig;ig Sekunden, bis die Polizei den Ausgangspunkt
eines Telefongespr&auml,ches orten konnte, und seine eigene Uhr hatte keinen
Sekundenzeiger.</P>
<BR>
"H&ouml;ren Sie, mein Name ist Ruiz, Paolo Ruiz, ich bin Kommissar der Mordkommission, und ich muß Ihnen ..."</P>
<BR>
Der andere sprach langsam, fast stolpernd, Sal legte auf.
Er wollte nicht glauben, was er geh&ouml;rt hatte, die W&auml;nde des Zimmers kamen auf
ihn zu, der Raum wurde enger und enger, er bekam keine Luft, einer zog am Boden
unter ihm, noch ein Ruck, und er w&uuml;rde ins Leere taumeln und fallen und
fallen ...</P>
<BR>
"Was ist los?" fragte Moses. Tamie war inzwischen auch aufgestanden und um den
Tisch herumgekommen.</P>
<BR>
"Da war einer dran", kr&auml;chzte Sal, "ein Ruhiz oder so, sagt, er w&auml;r von der
Mordkommission."</P>
<BR>
Seine Kehle f&uuml;hlte sich an wie mit Sandpapier ausgelegt.</P>
<BR>
"Mordkommission? Du hast dich verw&auml;hlt", sagte Moses.</P>
"Nein, er wu&szlig;te, da&szlig; ich die Tankstelle wollte."</P>
<BR>
Tamie setzte sich. "Die haben sie umgebracht", sagte sie leise.</P>
"Quatsch", sagte Moses, "da kann sonst was passiert sein, vielleicht hast du
dich doch verw&auml;hlt."</P>
"Der hat gefragt, ob ich ein Verwandter bin." Sal f&uuml;hlte sich schwindelig,
kleine blaue Fl&auml;mmchen tanzten vor seinen Augen.</P>
<BR>
"DIE HABEN SIE UMGEBRACHT!" schrie Tamie und sprang auf.</P>
<BR>
Ihre Augen waren riesengro&szlig;, ihr Mund eine aufgerissene Stra&szlig;e, sie machte
Bewegungen, als w&auml;re sie unter Wasser und w&uuml;rde ertrinken.</P>
<BR>
"Seid ihr alle BESCHEUERT?" Moses lief durch den Raum und ruderte mit den Armen
duch die Luft. "Ihr spinnt doch, Sal verw&auml;hlt sich ein bi&szlig;chen und schon flippen
alle aus!"</P>
<BR>
Tamie fa&szlig;te sich an den Hals, die Adern traten aus ihrer Stirn, sie zitterte,
Sal dachte, gleich w&uuml;rde etwas in ihr zerspringen.
Dann st&uuml;rzte sie los und lief wie wild um den Tisch herum und schrie in einem
fort: "DIE HABEN SIE UMGEBRACHT - NEIN, O GOTT, NEIN - DIE HABEN SIE
UMGEBRACHT!"</P>
<BR>
Sal packte Moses am Arm. ES WURDE JETZT WIRKLICH ZEIT!</P>
<BR>
"H&ouml;r zu", sagte er, "versuch du, Tamie zu beruhigen, und dann such unseren Kram
zusammen, wir ziehen wieder los."</P>
"Was f&uuml;r einen Kram, Sal, hast du hier Koffer gesehen? Kann mir einer
erkl&auml;ren, was hier los ist?"</P>
"Sp&auml;ter Moses, ich mu&szlig; telefonieren."</P>
"Du mu&szlig;t was?"</P>
<BR>
Aber Sal war schon drau&szlig;en und lief die Treppen in die Halle hinunter.</P>
<HR>
<H2 align=center>(to be continued...) in this issue, i hope!</H2>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=250 height=60></A>
</CENTER>
</BODY>
</HTML>

