<HTML>
<HEAD>
<meta name="description" content="Adrenalin Teil 6">
<meta name="author" content="Sylvester Beck aka » Silvio «">
<TITLE>Adrenalin Teil 6</TITLE>
</HEAD>
<BODY background="l_bg.gif" TEXT=black link=blue alink=red bgcolor="#dddddd">
<HR noshade width=100% size=6 color=blue>
<H2 align=center>Adrenalin</H2>
<H2 align=center>Teil 6</H2>
<H2 align=center>by</H2>
<TABLE border=0 align=center>
<TD align=center valign=center>
<IMG SRC="silvio.gif" border=0 width=150 height=60 alt="» Silvio «">
</CENTER>
<HR noshade width=100% size=6 color=blue>
<P> 
Verdammte Schei&szlig;e, dachte Block, als er vor seinem Teller und dem Bier
sa&szlig;. Er war wie auf Watte zu seinem Tisch gewandert. Das mit Tony, das
h&auml;tte nicht passieren d&uuml;rfen, das war sein Job, er hatte Mist gebaut. Okay, war aber auch
ein Schei&szlig;pack, das! Hocken an ihrer Schei&szlig;tankstelle und gehen den Leuten, die
vorbeikommen, auf die Eier. Block nippte an seinem Bier.</P>
<BR>
Aber das h&auml;tte man doch noch hingekriegt, ein Klacks war das, Auto
zur&uuml;ckholen, da hatte man schon ganz andere Sachen gemacht, was? Aber jetzt schickt der einen
in die Berge, was soll ich da, Urlaub machen? O Frank, zwangzig Jahre hab ich
f&uuml;r dich die Schei&szlig;e wegger&auml;umt, und jetzt, was ist jetzt?</P>
<BR>
L&auml;&szlig;t deinen alten Block einfach fallen, serviert ihn ab. Machst einen
gro&szlig;en Fehler, Frank! Block stocherte lustlos in dem Teller mit den Eiern herum.</P>
<BR>
Wie willst du es machen, machst du es selber? Nee, du machst dir die H&auml;nde nicht
dreckig, holst einen guten Mann daf&uuml;r. Mich mu&szlig;test du holen, du brauchst den
besten, ich m&uuml;&szlig;te mich selber umlegen.</P>
<BR>
Aber das wird nicht einfach, Frank, das kann ich dir jetzt schon verklickern!
Frag mal Sam oder den Schweden, oder frag ruhig auch Sartino - wird nicht
leicht, den alten Block zu begraben.</P>
<BR>
Der Schei&szlig;t euch vor die T&uuml;r, werdet ihr schon sehen. Wen nimmst du? Sam? Den
pust ich weg, da hat er noch nicht mal gemerkt, da&szlig; ich hinter ihm bin. Den
Schweden? Der ist doch froh, wenn er seinen Schwanz findet, wenn er mal danach
sucht. Sartino? Okay, der ist ihn Ordnung, der war dabei, als wir den Bl&ouml;dmann
das Bein abges&auml;gt haben. Der hat noch gelacht, da hast du schon beinahe in die
Ecke gekotzt, Frankie!</P>
<BR>
Nimm Sartino, Frank, dann hab ich auch noch ein bi&szlig;chen Spa&szlig;, bevor ich abtrete.
Aber jetzt find mich erst mal, Arschloch. Such mich, schick sie los, die
Anfänger. Dein alter Block erholt sich jetzt erst mal, macht ein bi&szlig;chen Urlaub,
macht immer noch genau, was du ihm sagst, Frank!</P>
<BR>
Block trank die Dose aus und stellte sie auf den Tisch.</P>
<HR>
<H2 align=center>***</H2>
<HR><BR>
Als Ruiz in sein B&uuml;ro zur&uuml;ckgekehrt war, hatte er sich als erstes von der
Zulassungsstelle den Halter des japanischen Wagens durchgeben lassen, in dem er
diese »Carm« aus Franks Einfahrt fahren sah.</P>
<BR>
Carmen Riolla war der Namen des Halters.</P>
<BR>
Ich (» Silvio «), der die ganze Nacht im Labor verbracht hatte, k&uuml;mmerte mich inzwischen
darum, da&szlig; alle Anrufe f&uuml;r die Tankstelle, an der man die drei Leichen gefunden
hatte, an ein Telefon auf Ruiz' Schreibtisch weitergeleitet wurden.</P>
<BR>
Die Fangschaltung hatte gerade gestanden, als der erste Anruf kam. Es war zwar
gleich wieder aufgelegt worden, aber der zweite kam kurz danach, vermutlich
hatte zweimal der selbe Mann angerufen.</P>
<BR>
Ruiz sprang auf und lief zur T&uuml;r.</P>
<BR>
"Hey, » Silvio «, ruf das Telefonamt an, da war gerade ein Gespr&auml;ch
f&uuml;r die Tankstelle", sagte er.</P>
<BR>
Ich sah ihn mit riesigen Augen hinter dicken Brillengl&auml;sern an. Ruiz war aus
dem Glaskasten, der sein B&uuml;ro war, getreten und hatte mir &uuml;ber einige Tische
hinweg zugerufen.</P>
<BR>
Ruiz setzte sich wieder hinter seinen Schreibtisch und sah aus dem Fenster, er
versuchte sich den Anrufer vorzustellen. Die Gespr&auml;che f&uuml;r die Tankstelle an
ihn weiterleiten zu lassen, war eine gute Idee gewesen. Er war noch nicht
sicher, ob es ihn wirklich weiterbringen konnte, aber man w&uuml;rde ja sehen.</P>
<BR>
Es war nicht sehr wahrscheinlich, da&szlig; der oder die M&ouml;rder versuchten, mit Leuten
zu telefonieren, die sie selbst eben umgebracht hatten. Als ihm die Idee mit der
Ruf&uuml;bermittlung kam, hatte er eher an Verwandte oder Freunde gedacht, die ihm
etwas &uuml;ber die Frau und den Marokkaner sagen konnten.</P>
<BR>
Sie hatten absolut nichts &uuml;ber die beiden, das einzige, was sie
wu&szlig;ten, war, da&szlig; der Frau die Tankstelle geh&ouml;rt hatte. Vermutlich hatte der Marokkaner bei ihr
gewohnt, sein Ausweis hatte in einer Schublade in einem der Schlafzimmer gelegen.</P>
<BR>
Wer war der Anrufer? fragte sich Ruiz. Er w&auml;r' »so was &Auml;hnliches« wie ein
Verwandter, hatte der Mann gesagt und dann einfach wieder aufgelegt. Wenn er es
ernst meinte, dann war etwas &Auml;hnliches wie ein Verwandter ein Freund. Warum
legt ein Freund einfach auf? Gedankenverloren bl&auml;tterte Ruiz mit der Hand in
einem Fernschreiben &uuml;ber Rashid Habbas, das ihm die Kollegen aus der Hauptstadt
geschickt hatten.</P>
<BR>
Er hatte dem Unbekannten gegen&uuml;ber behauptet, eine Nachricht für ihn zu haben,
entweder dieser hatte es nicht verstanden, oder er glaubte nicht daran, weil er
von dem Tod der beiden wu&szlig;te. Wenn er davon wu&szlig;te, warum rief er dann wieder an?
Es f&uuml;hrte zu nichts, sie mu&szlig;ten ihn finden, wenn sie konnten. So kam man nicht
weiter.</P>
<BR>
Ich steckte den Kopf zur T&uuml;r herein.</P>
<BR>
"Ist ein Hotel, Ruiz, eine ganze Ecke von hier."</P>
"Im S&uuml;den?"</P>
"Ja, in den Bergen."</P>
"Hm", machte Ruiz</P>
"Wie meinst'n das, Ruiz?"</P>
"Das Cabrio, die Motorradfahrer und der andere Wagen, den Gonschalk gesehen
hat, sind nach S&uuml;den gefahren."</P>
"Das mu&szlig; nichts hei&szlig;en." Ich sah ihn zweifelnd an.</P>
"Ruf die zust&auml;ndige Dienststelle aus der Gegend an", sagte Ruiz. "Die sollen
eine Streife bei dem Hotel vorbeischicken. Sollen nach dem Wagen von Barrault
suchen und sich die Hotelg&auml;ste anschauen. Aber unauff&auml;llig. Das Cabrio
stehenlassen, wenn sie es finden, und keinen von den G&auml;sten verh&ouml;ren. Sag ihnen,
es geht um drei Morde, nicht um den Wagen. Wenn es der Wagen von Barrault ist,
nimmst du ihn sofort aus der Fahndung raus. Sie sollen schnell machen und sofort
Nachricht geben. Ich fahr jetzt los, ich mu&szlig; jemanden treffen, du erreichst mich
im Wagen."</P>
"Ruiz?"</P>
"Ja, » Silvio «?"</P>
"Ach, nichts."</P>
<HR>
<H2 align=center>***</H2>
<HR><BR>
Sal jagte durch die Halle und stellte sich in die Telefonbox. Er hatte das
Gef&uuml;hl, auf einer gl&uuml;henden Herdplatte zu stehen, er konnte die
F&uuml;&szlig;e nicht ruhighalten, er steckte einen Finger in das dicke, zerfledderte Telefonbuch und
suchte herum, seine Augen rasten die Kolonnen hinauf und hinunter. Als er es
endlich hatte, war es der richtige Laden, aber die falsche Stadt, gleich
w&uuml;rde er platzen, und seine Fetzen w&uuml;rden durch die ganze Hotelhalle fliegen.
Konzentrier dich, verdammt noch mal! Er w&uuml;hlte sich durch das Buch wie jemand,
der in tiefen Schnee gefallen ist. Endlich wars die richtige Stadt, wo war das
»H«, er wollte sich wieder aufrichten, in diesem Zustand in geb&uuml;ckter Haltung,
das war unertr&auml;glich. »Harris«, zweitausend davon, die ganze Welt
hie&szlig; pl&ouml;tzlich so, die Buchstaben verschwammen und tanzten herum wie Wildesel, endlich hatte er
die Nummer gefunden. Er fuhr mit der Hand in die Hosentasche, 86 45 23, merk dir
die Nummer, nochmal findest du die nicht mehr, ein paar M&uuml;nzen klingelten auf
den Boden, 86 45 23, er lie&szlig; sie liegen, nahm die anderen und stopfte so viel in
den Schlitz, da&szlig; er China h&auml;tte anrufen k&ouml;nnen. Ein Zug kam in seinem Kopf
kreischend zum Stehen, Funken stoben unter den R&auml;dern hervor, er mu&szlig;te Ruhe in
seine Gedanken bringen, 86 45 23, das war die Sache seines Lebens jetzt,
entweder - oder, machs cool, er darf nicht merken, da&szlig; er mit einem vollkommenen
Anf&auml;nger spricht, ha, und wie macht man das? 86 45 23, er setzte den Finger auf
wie Watte, was gehen mu&szlig;, das geht auch, leg den Gang ein und gib alles.</P>
<BR>
"Hier Empfang »Hilton«, kann ich Ihnen helfen?"</P>
"Ein gewisser Habbas wohnt bei Ihnen?" fragte Sal.</P>
"Bleiben Sie dran, ich werde nachschauen."</P>
<BR>
Der am anderen Ende raschelte herum, Sal h&ouml;rte ihn in den H&ouml;rer atmen.</P>
<BR>
In der Hotelhalle war niemand zu sehen, das h&auml;tte jetzt noch gefehlt, vielleicht
ein &auml;lterer Herr mit einer Baseballm&auml;tze und einem Eis lutschenden kleinen
M&auml;dchen an der Hand, der geduldig neben der Telefonbox stehen und warten
w&uuml;rde...</P>
<BR>
"Sie meinen Rashid Habbas?" fragte der andere.</P>
"Haben Sie noch mehr?"</P>
"Nein, ich bedaure."</P>
"Verbinden Sie mich."</P>
"Gern, bleiben Sie dran."</P>
<BR>
Es dauerte einen Moment. Die ganze Wand vor Sals Augen war mit Werbetafeln
zugekleistert: PHANTASTISCHE AUSSICHT VOM BELLEVUE PLATEAU, NUR EINE STUNDE VON
DA, WO SIE GERADE STEHEN!</P>
<BR>
Sal konnte f&uuml;hlen, wie der Strom durch jedes Nervenende jagte, BEI WIND UND
WETTER - CLARA, DAS SPRAY VON ZETTLER! Huh, MANOLA LIGHTS, sollte man sich das
wirklich vorstellen, den BESONDEREN GESCHMACK einer Leichtzigarette mit NUR 0,1
MG NIKOTIN UND 0,5 MG TEER?</P>
<BR>
Es klickte in der Leitung, das war der Gong, Ring frei.</P>
<BR>
"Ja, bitte?"</P>
<BR>
Geh aus deiner Ecke, du hast drei S&auml;tze, dann mu&szlig;t du ihn haben. Sal
schlo&szlig; die Augen und machte einen Schritt in den Ring hinein.</P>
<BR>
"Spreche ich mit Rashid Habbas?"</P>
"Mit wem h&auml;tte er das Vergn&uuml;gen?"</P>
<BR>
Eine &uuml;beraus h&ouml;fliche Stimme mit gutturalem, fremden Akzent war das, der
Ministerpr&auml;sident eines W&uuml;stenstaates w&uuml;rde nicht anders klingen, der Araber war
Profi.</P>
<BR>
"Mit jemand, der einen Wagen verkaufen m&ouml;chte."</P>
"Ich habe bereits einen Wagen gekauft", sagte der andere.</P>
<BR>
La&szlig; die Deckung sinken, ganz wenig, der andere steht noch immer in der Ecke und
r&uuml;hrt sich nicht, durchatmen, lock ihn raus.</P>
<BR>
"Wurde er schon geliefert?"</P>
<BR>
Durchatmen, kein Wort mehr, beeil dich nicht, mach es langsam, nimm die F&auml;uste
ganz langsam nach oben.</P>
<BR>
"Welche Vorz&uuml;ge hat ihr Wagen?" fragte der Araber, nicht ein Hauch von Interesse
lag in seiner Stimme.</P>
<BR>
"Er hat alle Extras."</P>
"Zu welchem Preis?"</P>
<BR>
Aha, da kam er, ganz langsam, aber er kam aus der Ecke. Ant&auml;uschen, steck keine
Kraft in diesen Schlag, la&szlig; ihn nur die Faust sehen.</P>
<BR>
"Der Preis ist der gleiche geblieben."</P>
"Der Preis war zu hoch, ich habe dem Eigent&uuml;mer schon gesagt, da&szlig; mir die Farbe
nicht gef&auml;llt." Der Araber war immer noch h&ouml;flich, aber er hatte den ersten
Schlag getan, er stand ihm jetzt gegen&uuml;ber im Ring.</P>
<BR>
"Die Farbe, ja ..."</P>
"Sie ist ein wenig aufdringlich, finden Sie nicht?"</P>
<BR>
Der Araber t&auml;uschte jetzt ebenfalls an, Sal hatte seine Faust gesehen, jetzt
mu&szlig;te man rangehen, deck ihn ein!</P>
<BR>
"Es tut mir leid, da&szlig; ich Sie gest&ouml;rt habe", sagte Sal, "ich w&uuml;nsche Ihnen noch
einen sch&ouml;nen Tag."</P>
"Warten Sie."</P>
"Ja?"</P>
<BR>
Sal hatte ihn erwischt, er war nicht richtig getroffen, nur ein bi&szlig;chen gezuckt
hatte er, aber der Ringrichter trennte sie und hob kurz den Finger, sie standen
sich gegen&uuml;ber. >Fight<, sagte der Unparteiische und trat zur&uuml;ck.</P>
<BR>
"Wo k&ouml;nnte man den Wagen besichtigen?" fragte der Araber, jetzt eine Spur von
Interesse in seiner Stimme, h&ouml;flich, perfektes Timing.</P>
<BR>
Herrgott, `Wo' hatte der gesagt, Sal lie&szlig; einen Moment die F&auml;uste sinken, er
hatte nicht alle Regeln beachtet, dann fing er sich wieder.</P>
<BR>
"Hmm, kennen Sie das Bellevue Plateau?"</P>
"Kennen Sie das »Hilton«?</P>
<BR>
Der Araber hatte Sals Bl&ouml;&szlig;e entdeckt und blitzschnell zugeschlagen, jetzt
entweder ein harter Konter, oder der andere schickte ihn auf die Bretter und
ging nach Hause.</P>
<BR>
"H&ouml;ren Sie", sagte Sal und holte aus, "ich bin ein bi&szlig;chen empfindlich, ich
liebe diesen Wagen, er ist mir ans Herz gewachsen, und wenn Ihnen die Farbe
nicht gef&auml;llt ..."</P>
"Hat man eine sch&ouml;ne Aussicht von diesem Plateau?"</P>
"Die sch&ouml;nste, die Sie sich vorstellen k&ouml;nnen."</P>
"Sch&ouml;ner als aus einem Hubschrauber?"</P>
"Vergleichen Sie selbst."</P>
<BR>
Sal war durchgekommen mit seinem Konter, der andere lie&szlig; ihm wieder Platz.</P>
<BR>
"Wann w&auml;ren Sie dort?"</P>
"Sagen wir um zw&ouml;lf?"</P>
"Ich werde dar&uuml;ber nachdenken, w&auml;hrend ich einen Mokka zu mir nehme", sagte der
Araber.</P>
Ein letzter kleiner Schlag, aber es war eine Finte, niemand w&uuml;rde das Handtuch
werfen, bevor nicht die n&auml;chste Runde eingel&auml;utet wurde.</P>
<BR>
"Tun Sie das", sagte Sal und legte auf.</P>
<BR>
Er rannte durch die Halle und die Treppen hinauf, gleich w&uuml;rde ihm der Kopf
wegfliegen, seine Zeit in der Ecke war kurz, er mu&szlig;te bereit sein, wenn sie
wieder in den Ring traten.</P>
<BR>
Als er ins Zimmer st&uuml;rzte, hielt Moses Tamie im Arm, sie schluckte noch, aber
sie schien sich wieder unter Kontrolle zu haben. Ein paar Sachen lagen auf dem
Boden herum, sie mu&szlig;ten damit um sich geworfen haben.</P>
<BR>
"Was für eine Schuhgr&ouml;&szlig;e hast du, Tamie?" schnaufte Sal.</P>
"Was?" Sie sah ihn mit trotzigen Augen an. Er h&auml;tte sie jetzt gern in den Arm
genommen und ihr alles erkl&auml;rt, aber eine Frau am Ring ist der Tod eines
Boxers.</P>
<BR>
"Die haben unten einen Jagdmodeshop oder so was", erkl&auml;rte Sal, "wir brauchen
ein paar Sachen, wir fahren weiter in die Berge, dort ist es ganz sch&ouml;n kalt!"</P>
"Sechzunddrei&szlig;ig", sagte Tamie.</P>
<BR>
Sal machte kehrt und rannte die Treppe wieder hinunter.</P>
<HR>
<H2 align=center>***</H2>
<HR><BR>
Ruiz klingelte an der T&uuml;r eines heruntergekommenen Apartmenthauses. Der
Schlie&szlig;er summte, und er trat in einen Flur, in dem es nach Essen roch. Die
Farbe bl&auml;tterte von den W&auml;nden, und aus dem Treppengel&auml;nder waren die meisten
St&auml;be herausgebrochen.</P>
<BR>
Als er im dritten Stock ankam, stand Carmen Riolla am Ende des Flurs und sah ihm
entgegen. Sie sah m&uuml;de aus.</P>
<BR>
"Sie kennen mich noch?" fragte er im Gehen.</P>
"Kommissar Ruiz, Sie waren bei Frank." Ihre Stimme war ausdruckslos.</P>
"H&ouml;ren Sie, ich habe keine Vorladung, ich halte Sie nicht für eine
Tatverd&auml;chtige, und ich werde jederzeit wieder gehen, wenn Sie es w&uuml;nschen. Ich
m&ouml;chte nur verschiedene Dinge besser verstehen. Darf ich hereinkommen?"</P>
"Bitte, Kommissar." Sie trat zur Seite.</P>
<BR>
Ruiz sah sich um, es war ein trostloses kleines Appartment, karg m&ouml;bliert, von
den Fensterrahmen bl&auml;tterte die Farbe, und von die Decke hatte Spr&uuml;nge. Aber es
war sauber und aufger&auml;umt.</P>
<BR>
In der Mitte des Raumes stand ein großes Bett mit sauberen Laken. Ein Stapel
frisch gesp&uuml;ltes Geschirr war auf einem Tisch aufget&uuml;rmt, neben dem Bett sah
Ruiz einen Staubsauger, auf einem Fensterbrett war ein Eimer mit dampfenden
Wasser. Er hatte sie offentsichtlich beim Hausputz gest&ouml;rt.</P>
<BR>
Ruiz entdeckte keine pers&ouml;nlichen Dinge; immer auf dem Sprung, die Lady, dachte
er.</P>
<BR>
"Hab' Sie beim Saubermachen gest&ouml;rt?"</P>
<BR>
Ruiz stellte sich ans Fenster und sah in einen grauen Hinterhof, in dem Kinder
Verstecken spielten.</P>
<BR>
"War gerade fertig, Kommissar", sagte sie und verschr&auml;nkte die Arme.</P>
"Lassen Sie den Kommissar, sagen Sie einfach Ruiz."</P>
<BR>
Er sah, wie sich ein Kind hinter einer Mülltonne versteckte, w&auml;hrend ein anderes
mit dem Kopf zur Wand stand und z&auml;hlte.</P>
<BR>
"Wie Sie wollen."</P>
"Sagen Sie, Carmen, wie hei&szlig;t Franks Nichte?" fragte Ruiz und drehte sich wieder
rum.</P>
"Ich wei&szlig; nicht, ob Frank eine Nichte hat, ich glaube nicht", sagte sie und
&ouml;ffnete einen H&auml;ngeschrank &uuml;ber dem Sp&uuml;lbecken.</P>
"Hat Frank Sie geschlagen?"</P>
"Ich bin gegen eine Wand gelaufen."</P>
"Das M&auml;dchen, das dabei war, als Frank zusammengeschlagen wurde, wie
hei&szlig;t die?"</P>
"Tamie?" Sie drehte sich nach ihm um, die Schrankt&uuml;r in der Hand.</P>
<BR>
"Wo, glauben Sie, kann ich sie finden, diese Tamie?"</P>
"Ich wei&szlig; nicht, ich hab sie seit dem Abend nicht mehr gesehen."</P>
"Haben Sie etwas dagegen, wenn ich mich setze, ich habs ein bi&szlig;chen am Bein, man
hat mich mal angeschossen. Haben Sie auch was? Sie hinken ein bi&szlig;chen", sagte
Ruiz und zog einen Klappstuhl hervor, der halb unter dem Tisch mit dem Geschirr
stand.</P>
"Entschuldigen Sie", murmelte Carmen, "setzen Sie sich, macht es Ihnen was aus,
wenn ich mir einen einschenke?" fragte sie.</P>
"F&uuml;hlen Sie sich wie zu Hause", sagte Ruiz, "auch wenn Sie glauben, Sie
w&auml;ren es nicht, ich hab auch so eine Bude. Vielleicht machen Sie mir dasselbe?"</P>
<BR>
Er setzte sich.</P>
Sie nahm zwei Gl&auml;ser und zwei Flaschen aus dem Schrank und &ouml;ffnete den
K&uuml;hlschrank, um Eisw&uuml;rfel hervorzuholen.</P>
<BR>
"Sie haben gedacht, ich bin im Dienst", sagte er und schaute ins Leere.</P>
<BR>
Sie gab ihm einen langen Blick, dann setze sie sich zu ihm an den Tisch.</P>
<BR>
"Sind Sie's nicht?"</P>
"Ich hab vergessen, was der Unterschied ist. Rauchen Sie?" fragte er und kramte
ein P&auml;ckchen Camel hervor.</P>
"Leidenschaftlich", sagte sie und nahm eine Zigarette.</P>
"Wissen Sie, Carmen, da drau&szlig;en an der Tankstelle haben wir drei Leichen
aufgefunden", er hielt ihr Feuer hin, "ich m&ouml;chte Ihnen gerne die Fotos zeigen,
die wir gemacht haben, aber trinken Sie erst was, ich mach dasselbe, es sind
keine sehr sch&ouml;nen Fotos."</P>
<BR>
Ruiz nickte ihr zu und nahm einen großen Schluck. Sie sah ihm zu, dann nippte
sie, überlegte es sich und leerte ihr Glas bis zur H&auml;lfte.</P>
<BR>
"Wie mixen Sie den? Da, wo ich den immer trinke, schmeckt er nach Seife", sagte
Ruiz.</P>
<BR>
Sie erkl&auml;rte es ihm, und er h&ouml;rte aufmerksam zu.</P>
<BR>
"Ein Freund von mir sucht einen Barkeeper, wenn Sie mal einen Job suchen ..."</P>
"Im Moment nicht, aber vielen Dank", sagte sie und gab ihm ein schwaches
L&auml;cheln.</P>
<BR>
Er zog einen braunen Umschlag aus seinem Jackett und entnahm Fotos, die aus
verschiedenen Perspektiven einen Marokkaner zeigten, der blu&uuml;berstr&ouml;mt auf dem
Boden lag. Sein halbes Gesicht war ein dunkler, unf&ouml;rmiger Klumpen Fleisch. Ein
anderes zeigte den leblosen K&ouml;rper einer Frau vor einem Klavier. In einer
Großaufnahme sah man ihr Gesicht. Nase und Wangenknochen waren eingedr&uuml;ckt, ihre
Gesichtsz&uuml;ge waren nicht mehr zu erkennen. Andere Fotos zeigten einen Mann in
Motorradstiefeln, der auf dem Bauch lag. Sein Hinterkopf war unf&ouml;rmig
verbreitert und klaffte auf. Auf einer Nahaufnahme konnte man sein Gehirn
erkennen. Auf einer anderen sah man ihn von vorn.</P>
<BR>
Carmen schluckte und setzte ihr Glas an den Mund. Sie trank es leer und griff
hinter sich nach der Flasche, die neben der Sp&uuml;le stand. Sie sparte sich die
M&uuml;he, Tomatensaft in den Wodka zu kippen, sie trank pur.</P>
<BR>
"Carmen, ich werde Sie nicht fragen, ob Sie einen der Toten hier kennen. Es ist
f&uuml;r mich nicht wichtig", er blies Rauch &uuml;ber die Fotos. "Ebensowenig
interessiere ich mich f&uuml;r gestohlene Autos. Ich suche keine Autos, ich suche die
Tiere, die so etwas tun."</P>
<BR>
Sie sah ihn an. Sie mochte seine Art, auch wenn sie nicht auf seiner Seite
stand. Er stellte Fragen und bekam Antworten, ganz leicht. Er versuchte kein
Spiel, großer b&ouml;ser Polizist.</P>
<BR>
"Ich sage Ihnen, was ich denke", fuhr er fort, "eines dieser Tiere haben Sie
gerade schon gesehen. Ein anderes l&auml;uft noch herum und sucht etwas. Ich suche
dasselbe. Die Frage ist nur, wer wird schneller sein diesmal?"</P>
<BR>
Er sah sie an, sie f&uuml;hlte sich flau, sie dachte an Tamie, Sal, seinen Freund
Moses und an Block. Aber sie hatte nur diese einzige Chance.
Sie starrte ihn an. Er hatte jetzt einen traurigen Zug um den Mund und Augen,
die sahen.
Einen kurzen Moment dachte sie daran, ihm alles zu sagen, vielleicht w&uuml;rde er
Block finden, und die drei h&auml;tten eine Atempause, aber das war Quatsch, er
w&uuml;rde alles kaputtmachen.
Was du anf&auml;ngst, ziehst du durch und Ende, dachte sie.</P>
<BR>
"Kennen Sie einen Habbas?" fragte er.</P>
"Fl&uuml;chtig."</P>
"Er macht Gesch&auml;fte mit Frank?"</P>
"Ich glaube, ja."</P>
"H&ouml;ren Sie, Carmen, ich geb Ihnen eine Nummer, unter der Sie mich Tag und Nacht
erreichen k&ouml;nnen, ich w&uuml;rde gerne wieder von Ihnen h&ouml;ren - bald, Carmen!"</P>
"Hmmh", machte sie.</P>
"Noch eine Frage, f&auml;hrt Tony Sacchi Motorrad?"</P>
"Ich habe ihn nie auf einen gesehen, Ruiz."</P>
<HR>
<H2 align=center>(to be continued ...)</H2>
</HR>
<P>
Nachtrag: Bitte verzeiht mir das "billige" Layout, doch dies sind meine ersten
Versuche mit HTML!! :-)
<P>
<BR>
Für die, die die ersten Teile noch nicht gelesen haben, die sollen mir einen Brief
mit einer Disk (voll mit PD) und Rückporto zuschicken, dann kann ich ihm die
vorigen Teile draufkopieren; ohne Rückporto läuft da nichts. :-) Achja, laßt
euch nicht von der Post ausnehmen und schreibt auf den Brief einfach
"Warensendung" drauf und klebt auf den Brief nur 1,30 DM drauf und nicht 2,20 DM
wie manche fälschlicherweise meinen, denn der Andreas verschickt ja seine Briefe
auch immer als "Warensendung" und klebt auch nur 1,30 DM drauf. So, ich denke
das sollte mal gesagt werden, denn wollen wir die Post reich machen, oder was??
Nein, ganz bestimmt nicht, denkt mal, mit dem eingesparten Porto könnt ihr
wieder ein paar PD Disk beim APC&TCP bestellen (Achtung, das riecht verdächtig
nach Schleichwerbung) :-) und da hat man mehr davon als wenn man den
Halbgötter in "gelb" auch noch ihre Rente bezahlen müssen.
<P>

<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=120 height=60></A>
</CENTER>
</BODY>
</HTML> 

