<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>HTML-Tabellenerstellung</title>
</head>
<body background="st_wolfinfo.gif" text=black link=blue alink=red bgcolor="#ffffe6"><br>
<font color="#800000" size="7">
<center><b>HTML-Tabellenerstellung</b></font></center>

<p>Seit NoCover Nr.50 existiert eine Kurzanleitung von Thomas Szedlak, auch
Kalauerman genannt, in Intern mit dem Titel: Anleitung zum Artikelschreiben. Bedingt
durch manche missgl&uuml;ckten Versuche, Tabellen zu erstellen, bzw. durch
Fragestellungen in Leserbriefen, habe ich mich entschlossen, einen Versuch zu
unternehmen, einen Workshop &uuml;ber HTML-Tabellen zu schreiben. Eines sei dabei
vorweggenommen, vollst&auml;ndig kann er nicht sein und manche HTML-Browser
interpretieren die Anweisungen verschieden. Trotzdem sollte man sich derzeit an
den HTML-Standard 3.2 halten, weil die meisten Browser (neuester Version) aller
Plattformen, diesen Standard großenteils verstehen. Und noch eines. Manche Tags
(Anweisung) k&ouml;nnen unterschiedliche Schreibweisen (zwischen Englisch und
Amerikanisch) aufzeigen. Es wird empfohlen, dann die amerikanische Schreibweise
vorzuziehen, damit keine fehlerhafte Interpretation erfolgt.</p>

<p>F&uuml;r das Erstellen einer Tabelle gibt es eigentlich nur wenige Tags, die aber
alle mit einem End-Tag abgeschlossen werden m&uuml;ssen. Das ist der Tag mit einem
Schr&auml;gstrich davor.</p>

<p>Um das Rad nicht zweimal erfinden zu m&uuml;ssen, habe ich einige Passagen aus dem
Werk &quot;SelfHTML&quot; von Stefan M&uuml;nz mit herangezogen und &uuml;bernommen. Er
wird hoffentlich nichts dagegen haben.</p>

<p>Bevor ich nun beginne, ist noch zu sagen, dass derzeit die Browser IBrowse 1.22,
AWeb 3.2(Demo) und Voyager NG 2.88 (das sind die drei Browser, die ich habe) die
nachfolgenden Befehle alle nicht 100%ig richtig interpretieren, wobei bei AWeb die
wenigsten Fehler auftreten, Voyager dagegen noch viel lernen muss.</p>

<p>Eine Tabelle besteht aus mindestens einer, normalerweise aus mehreren Zeilen.
Eine Zeile besteht aus mindestens einer, normalerweise aus mehreren Zellen.
Dadurch ergeben sich die Spalten der Tabelle.<pre>
    &lt;table border&gt;
        &lt;tr&gt;
          &lt;th&gt;Kopfzelle: 1. Zeile, 1. Spalte&lt;/th&gt;
          &lt;th&gt;Kopfzelle: 1. Zeile, 2. Spalte&lt;/th&gt;
          &lt;th&gt;Kopfzelle: 1. Zeile, 3. Spalte&lt;/th&gt;
        &lt;/tr&gt;
        &lt;tr&gt;
          &lt;td&gt;Datenzelle: 2. Zeile, 1. Spalte&lt;/td&gt;
          &lt;td&gt;Datenzelle: 2. Zeile, 2. Spalte&lt;/td&gt;
          &lt;td&gt;Datenzelle: 2. Zeile, 3. Spalte&lt;/td&gt;
        &lt;/tr&gt;
        &lt;tr&gt;
          &lt;td&gt;Datenzelle: 3. Zeile, 1. Spalte&lt;/td&gt;
          &lt;td&gt;Datenzelle: 3. Zeile, 2. Spalte&lt;/td&gt;
          &lt;td&gt;Datenzelle: 3. Zeile, 3. Spalte&lt;/td&gt;
        &lt;/tr&gt;
    &lt;/table&gt;
</pre></p>
<p><b>&lt;tr&gt;</b> leitet eine neue Tabellenzeile ein (<i>tr = table row =
Tabellenzeile</i>). Im Anschlu&szlig; daran werden die Zellen (Spalten) der
betreffenden Reihe definiert. Das Ende einer Tabellenzeile wird durch ein
abschlie&szlig;endes Tag <b>&lt;/tr&gt;</b> angezeigt.</p>

<p>Eine Tabelle kann Kopfzellen und gew&ouml;hnliche Datenzellen enthalten. Text
in Kopfzellen wird hervorgehoben (meist <b>fett</b> und zentriert ausgerichtet).
<b>&lt;th&gt;</b> definiert eine Kopfzelle, <b>&lt;td&gt;</b> eine normale
Datenzelle (<i>th = table header = Tabellenkopf, td = table data =
Tabellendaten</i>). Der Inhalt einer Zelle wird jeweils hinter dem Tag notiert.
In einer Tabellenzelle k&ouml;nnen beliebige Elemente stehen, d.h. au&szlig;er
normalem Text z.B. auch Verweise oder Bilder. Sogar eine weitere Tabelle kann
innerhalb einer Zelle definiert werden</p>

<p>Die Tags <b>&lt;th&gt;</b> und <b>&lt;td&gt;</b> k&ouml;nnen zwar auch
alleine (ohne End-Tag) stehen. Dennoch ist es dringend zu empfehlen, stets die
zugeh&ouml;rigen End-Tags zu notieren, also am Ende der Zelle ein
abschlie&szlig;endes Tag <b>&lt;/th&gt;</b> bzw. <b>&lt;/td&gt;</b>.</p>

<p>Die Anzahl der Zellen sollte bei jeder Zeile gleich sein, so dass die Tabelle
durchweg die gleiche Anzahl Spalten hat. In der ersten Zeile werden deshalb durch die
Anzahl der definierten Zellen die Anzahl der Spalten der Tabelle festgelegt.</p>

<p>Gr&ouml;&szlig;ere Tabellen k&ouml;nnen im Quelltext schnell
un&uuml;bersichtlich werden. Deshalb ist es empfehlenswert, eine
&uuml;bersichtliche Darstellungsform mit Einr&uuml;ckungen und
Zeilenumbr&uuml;chen (&auml;hnlich wie im Beispiel oben) zu w&auml;hlen. Auf die
Pr&auml;sentation im Browser hat die Darstellung im Quelltext keinen
Einflu&szlig;, da innerhalb von Tabellenzellen die &uuml;blichen Regeln beim
Editieren von HTML gelten.</p>

<p>Tabellenzellen d&uuml;rfen auch leer sein. Wenn in einer Zeile f&uuml;r
eine Spalte keine Daten vorhanden sind, reicht f&uuml;r die meisten Browser ein einfaches
<b>&lt;td&gt;</b><b>&lt;/td&gt;</b>. Es ist zu ber&uuml;cksichtigen, da&szlig;
mancher WWW-Browser die Zelle in diesem Fall als &quot;nicht vorhanden&quot;
darstellt. In diesen F&auml;llen ist es deshalb sinnvoll, das Leerzeichen
<b>&lt;td&gt;&amp;#160;&lt;/td&gt;</b> in die leere Tabellenzelle zu setzen.</p>
<hr width=80%>

<p>Kommen wir also zu unserem ersten Beispiel. Nun gibt es die M&ouml;glichkeit, Tabellen
mit und ohne Gitterlinien zu erstellen. Die Anweisung hierf&uuml;r lautet &quot;<b>border
</b>&quot;.
<table width=100%><tr><td>
<h3>Tabelle mit Gitternetzlinien</h3></td><td>die Anweisung</td></tr>
<tr><td>
  <table border>
    <tr>
      <th>Berlin</th>
      <th>Hamburg</th>
      <th>M&uuml;nchen</th>
    </tr>
    <tr>
      <td>Milj&ouml;h</td>
      <td>Kiez</td>
      <td>Bierdampf</td>
    </tr>
    <tr>
      <td>Buletten</td>
      <td>Frikadellen</td>
      <td>Fleischpflanzerl</td>
    </tr>
  </table>
</td>
<td><pre>
  &lt;table border&gt;
    &lt;tr&gt;
      &lt;th&gt;Berlin&lt;/th&gt;
      &lt;th&gt;Hamburg&lt;/th&gt;
      &lt;th&gt;M&uuml;nchen&lt;/th&gt;
    &lt;/tr&gt;
    &lt;tr&gt;
      &lt;td&gt;Milj&ouml;h&lt;/td&gt;
      &lt;td&gt;Kiez&lt;/td&gt;
      &lt;td&gt;Bierdampf&lt;/td&gt;
    &lt;/tr&gt;
    &lt;tr&gt;
      &lt;td&gt;Buletten&lt;/td&gt;
      &lt;td&gt;Frikadellen&lt;/td&gt;
      &lt;td&gt;Fleischpflanzerl&lt;/td&gt;
    &lt;/tr&gt;
  &lt;/table&gt;
</pre></td></tr></table>

<table width=100%><tr><td>
<h3>und ohne Gitternetzlinien</h3></td><td>die Anweisung</td></tr>
  <table>
    <tr>
      <th>Berlin</th>
      <th>Hamburg</th>
      <th>M&uuml;nchen</th>
    </tr>
    <tr>
      <td>Milj&ouml;h</td>
      <td>Kiez</td>
      <td>Bierdampf</td>
    </tr>
    <tr>
      <td>Buletten</td>
      <td>Frikadellen</td>
      <td>Fleischpflanzerl</td>
    </tr>
  </table>
</td>wie oben, nur das Wort border ist weggelassen
</td></tr></table>

<p>Die Dicke des Au&szlig;enrahmens einer Tabelle wird in Pixeln bestimmt.<pre>
    &lt;table border=8&gt;
      &lt;!--hier folgt der Tabelleninhalt--&gt;
    &lt;/table&gt;
</pre></p>
<p>Damit die Tabelle &uuml;berhaupt einen Rahmen erh&auml;lt, muss
<tt>border</tt> mit angegeben werden. Mit <tt>border=[Pixel]</tt> wird die Dicke des
Au&szlig;enrahmens festgelegt. Wenn nur <tt>border</tt> angegeben ist, wird per
Voreinstellung eine Rahmendicke von 2 Pixeln verwendet.</p>

<p>Die Dicke der Gitternetzlinien zwischen den Zeilen und
Spalten einer Tabelle wird ebenfalls in Pixeln bestimmt.<pre>
    &lt;table border=8 cellspacing=10&gt;
      &lt;!--hier folgt der Tabelleninhalt--&gt;
    &lt;/table&gt;
</pre></p>
<p>Damit die Tabelle &uuml;berhaupt Gitternetzlinien erh&auml;lt, muss
<tt>border</tt> bzw. <tt>border=</tt> (Au&szlig;enrahmendicke) angegeben sein. Mit
<tt>cellspacing=[Pixel]</tt> wird die Dicke der Gitternetzlinien
innerhalb der Tabelle (<i>cellspacing = Zellenbema&szlig;ung</i>) bestimmt.</p>

<p>In vielen F&auml;llen sieht ein gewisser Abstand der Zellendaten zum
Zellenrand besser aus. Der Randabstand wird in Pixeln bestimmt.<pre>
    &lt;table border=8 cellpadding=12&gt;
       &lt;!--hier folgt der Tabelleninhalt--&gt;
    &lt;/table&gt;
</pre></p>

<p>Mit <tt>cellpadding=[Pixel]</tt> bestimmt man den Randabstand zwischen
Zellenrand und Zelleninhalt (<i>cellpadding = Zelleninhaltbema&szlig;ung</i>).
Dies gilt sowohl f&uuml;r Tabellen mit Gitternetzlinien als auch f&uuml;r blinde
Tabelle (ohne Gitternetzlinien).</p>
<hr width=80%>

<p>Man kann eine Tabelle in Gesamtbreite und Gesamth&ouml;he auf ein bestimmtes
Ma&szlig; bringen.<pre>
    &lt;table border width=60% height=400&gt;
       &lt;!--hier folgt der Tabelleninhalt--&gt;
    &lt;/table&gt;
</pre></p>

<p>Durch das Attribut <tt>width=</tt> im einleitenden Tag einer Tabelle erreicht
man, dass der Browser die Tabelle so breit anzeigt wie angegeben (<i>width =
Breite</i>). man kann eine Zahl oder einen Prozentwert angeben. Mit einer Zahl,
z.B. 300, erzwingt man, dass die Tabelle so viel Pixel breit dargestellt wird
wie angegeben. Mit einem Prozentwert erreicht man, dass die Tabelle maximal so
viel Breite des Anzeigefensters einnimmt wie angegeben. F&uuml;r eine
prozentuale Angabe schreibt man hinter der Zahl einfach ein Prozentzeichen.</p>

<p>Durch das Attribut <tt>height=</tt> erreicht man, dass der Browser die
Tabelle so hoch anzeigt wie angegeben (<i>height = H&ouml;he</i>). Auch hier
kann man eine Zahl oder einen Prozentwert angeben. Mit einer Zahl, z.B. 1000,
wird eine Tabellenh&ouml;he unabh&auml;ngig von der Gr&ouml;&szlig;e des
Anzeigefensters erzwungen. Mit einem Prozentwert kann die H&ouml;he der Tabelle
relativ zur Gr&ouml;&szlig;e des Anzeigefensters bestimmt werden.</p>

<p>Die Angabe <tt>height=</tt> ist im Gegensatz zu <tt>width=</tt> nicht im
HTML-Standard erw&auml;hnt, wird aber von tabellenf&auml;higen Browsern
interpretiert.</p>

<p>Die Angaben zu Breite und H&ouml;he einer Tabelle sind nur wirksam, wenn der
Tabelleninhalt kleiner ist, so dass leerer Raum entsteht. Wenn der
Tabelleninhalt gr&ouml;&szlig;er ist, werden die Angaben zu Breite und H&ouml;he
au&szlig;er Kraft gesetzt. Die Tabelle wird in diesem Fall vom WWW-Browser so
dimensioniert, dass der gesamte Inhalt angezeigt wird.</p>

<p>Man kann die Breite einzelner Spalten einer Tabelle bestimmen.<pre>
    &lt;table border&gt;
        &lt;tr&gt;
          &lt;th width=300&gt;Kopfzelle: 1. Zeile, 1. Spalte&lt;/th&gt;
          &lt;th&gt;Kopfzelle: 1. Zeile, 2. Spalte&lt;/th&gt;
          &lt;th&gt;Kopfzelle: 1. Zeile, 3. Spalte&lt;/th&gt;
        &lt;/tr&gt;
        &lt;tr&gt;
          &lt;td&gt;Datenzelle: 2. Zeile, 1. Spalte&lt;/td&gt; &lt;!-- Breite 300 gilt auch hier --&gt;
          &lt;td&gt;Datenzelle: 2. Zeile, 2. Spalte&lt;/td&gt;
          &lt;td&gt;Datenzelle: 2. Zeile, 3. Spalte&lt;/td&gt;
        &lt;/tr&gt;
        &lt;tr&gt;
          &lt;td&gt;Datenzelle: 3. Zeile, 1. Spalte&lt;/td&gt;  &lt;!-- Breite 300 gilt auch hier --&gt;
          &lt;td&gt;Datenzelle: 3. Zeile, 2. Spalte&lt;/td&gt;
          &lt;td&gt;Datenzelle: 3. Zeile, 3. Spalte&lt;/td&gt;
        &lt;/tr&gt;
    &lt;/table&gt;
</pre></p>
<p>
  <table border>
    <tr>
      <th width=300>Berlin</th>
      <th>Hamburg</th>
      <th>M&uuml;nchen</th>
    </tr>
    <tr>
      <td>Milj&ouml;h</td>
      <td>Kiez</td>
      <td>Bierdampf</td>
    </tr>
    <tr>
      <td>Buletten</td>
      <td>Frikadellen</td>
      <td>Fleischpflanzerl</td>
    </tr>
  </table></p>
<br>
<p>Durch das Attribut <tt>width=</tt> im einleitenden Tag einer Kopfzelle
(<tt>&lt;th&gt;</tt>) oder einer Datenzelle (<tt>&lt;td&gt;</tt>) erzwingt man
eine bestimmte Spaltenbreite (<i>width = Breite</i>). Man kann eine Zahl oder
einen Prozentwert angeben. Mit einer Zahl, z.B. 300, wird erzwungen, dass die
Spalte so viel Pixel breit dargestellt wird wie angegeben. Mit einem Prozentwert
erreicht man, dass die Spalte maximal so viel Breite des Anzeigefensters
einnimmt wie angegeben. F&uuml;r eine prozentuale Angabe wird hinter der
Zahl einfach ein Prozentzeichen gesetzt.</p>

<p>Da die Angabe spaltenweit gilt, braucht sie nur einmal pro Spalte notiert zu
werden. Am sinnvollsten ist es, die Angabe in der ersten Zeile der Tabelle zu
setzen. Im obigen Beispiel wird die gesamte erste Spalte der Tabelle, die aus
drei Zeilen besteht, auf 300 Pixel Breite gebracht.</p>

<p>Die Angabe zur Spaltenbreite ist nur wirksam, wenn der Spalteninhalt in jeder
Zeile kleiner ist, so dass leerer Raum entsteht. Wenn der Inhalt
gr&ouml;&szlig;er ist, wird die Angabe au&szlig;er Kraft gesetzt. Die Spalte
wird in diesem Fall so dimensioniert, dass der gesamte Inhalt angezeigt wird.
Das ist beispielsweise der Fall, wenn in der Spalte eine Grafik vorkommt, die
breiter ist als die angegebene Spaltenbreite.</p>

<p>Falls zugleich eine bestimmte Breite der gesamten Tabelle angeben wird,
hat die Angabe zur Gesamtbreite im Konfliktfall Vorrang gegen&uuml;ber der
angegebenen Breite einer einzelnen Spalte.</p>

<p>Erzwungene Spaltenbreiten und erzwungene Zeilenh&ouml;hen sind kombinierbar.</p>

<p>Man kann auch die H&ouml;he einzelner Zeilen einer Tabelle bestimmen.<pre>
    &lt;table border&gt;
        &lt;tr&gt;
          &lt;th height=300&gt;Kopfzelle: 1. Zeile, 1. Spalte&lt;/th&gt;
          &lt;th&gt;Kopfzelle: 1. Zeile, 2. Spalte&lt;/th&gt;  &lt;!-- H&ouml;he 300 gilt auch hier --&gt;
          &lt;th&gt;Kopfzelle: 1. Zeile, 3. Spalte&lt;/th&gt;  &lt;!-- H&ouml;he 300 gilt auch hier --&gt;
        &lt;/tr&gt;
        &lt;tr&gt;
          &lt;td height=200&gt;Datenzelle: 2. Zeile, 1. Spalte&lt;/td&gt;
          &lt;td&gt;Datenzelle: 2. Zeile, 2. Spalte&lt;/td&gt;  &lt;!-- H&ouml;he 200 gilt auch hier --&gt;
          &lt;td&gt;Datenzelle: 2. Zeile, 3. Spalte&lt;/td&gt;  &lt;!-- H&ouml;he 200 gilt auch hier --&gt;
        &lt;/tr&gt;
        &lt;tr&gt;
          &lt;td height=100&gt;Datenzelle: 3. Zeile, 1. Spalte&lt;/td&gt;
          &lt;td&gt;Datenzelle: 3. Zeile, 2. Spalte&lt;/td&gt;  &lt;!-- H&ouml;he 100 gilt auch hier --&gt;
          &lt;td&gt;Datenzelle: 3. Zeile, 3. Spalte&lt;/td&gt;  &lt;!-- H&ouml;he 100 gilt auch hier --&gt;
        &lt;/tr&gt;
    &lt;/table&gt;
</pre></p>
<p><table width=100%><tr><td>
<table border>
    <tr>
      <th height=150>Berlin</th>
      <th>Hamburg</th>
      <th>M&uuml;nchen</th>
    </tr>
    <tr>
      <td height=100>Milj&ouml;h</td>
      <td>Kiez</td>
      <td>Bierdampf</td>
    </tr>
    <tr>
      <td height=50>Buletten</td>
      <td>Frikadellen</td>
      <td>Fleischpflanzerl</td>
    </tr>
  </table>
</td><td><pre>
  Die Anweisung lautet:

  &lt;table border&gt;
    &lt;tr&gt;
      &lt;th height=150&gt;Berlin&lt;/th&gt;
      &lt;th&gt;Hamburg&lt;/th&gt;
      &lt;th&gt;M&uuml;nchen&lt;/th&gt;
    &lt;/tr&gt;
    &lt;tr&gt;
      &lt;td height=100&gt;Milj&ouml;h&lt;/td&gt;
      &lt;td&gt;Kiez&lt;/td&gt;
      &lt;td&gt;Bierdampf&lt;/td&gt;
    &lt;/tr&gt;
    &lt;tr&gt;
      &lt;td height=50&gt;Buletten&lt;/td&gt;
      &lt;td&gt;Frikadellen&lt;/td&gt;
      &lt;td&gt;Fleischpflanzerl&lt;/td&gt;
    &lt;/tr&gt;
  &lt;/table&gt;
</pre></td></tr></table></p>
<br>
<p>Durch das Attribut <tt>height=</tt> im einleitenden Tag einer Kopfzelle
(<tt>&lt;th&gt;</tt>) oder einer Datenzelle (<tt>&lt;td&gt;</tt>) erzwingt man
eine bestimmte Zeilenh&ouml;he (<i>height = H&ouml;he</i>). Man kann eine Zahl
oder einen Prozentwert angeben. Mit einer Zahl, z.B. 300, wird erzwungen, dass
die Zeile so viel Pixel hoch dargestellt wird wie angegeben. Mit einem
Prozentwert erreicht man, dass die Spalte maximal so viel H&ouml;he des
Anzeigefensters einnimmt wie angegeben. F&uuml;r eine prozentuale Angabe
ist hinter der Zahl einfach ein Prozentzeichen zu setzen.</p>

<p>Da die Angabe f&uuml;r die gesamte Zeile gilt, brauchen sie nur einmal pro
Zeile geschrieben zu werden. Am sinnvollsten ist es, die Angabe in der ersten
Spalte einer Zeile zu setzen.</p>

<p>Die Angabe zur Zeilenh&ouml;he ist nur wirksam, wenn der Inhalt in jeder
Spalte der Zeile kleiner ist, so dass leerer Raum entsteht. Wenn der Inhalt
gr&ouml;&szlig;er ist, wird die Angaben au&szlig;er Kraft gesetzt. Die Zeile
wird in diesem Fall so dimensioniert, dass der gesamte Inhalt angezeigt wird.
Das ist beispielsweise der Fall, wenn in der Zeile eine Grafik vorkommt, die
h&ouml;her ist als die angegebene Zeilenh&ouml;he.</p>

<p>Falls zugleich eine bestimmte H&ouml;he der gesamten Tabelle angeben wurde,
hat die Angabe zur Gesamth&ouml;he im Konfliktfall Vorrang gegen&uuml;ber der
angegebenen H&ouml;he einer einzelnen Zeile.</p>

<p>Erzwungene Zeilenh&ouml;hen und erzwungene Spaltenbreiten sind
kombinierbar.</p>

<p>Zelleninhalte werden bei erzwungener Zeilenh&ouml;he mittig ausgerichtet,
wenn nichts anderes angeben wurde. Man kann den Zelleninhalt nach oben oder unten
ausrichten.</p>

<p>man kann festlegen, dass beim Inhalt einer Zelle kein automatischer
Zeilenumbruch erfolgen darf. Die Spalte der Tabelle wird bei der Anzeige
entsprechend breit dimensioniert.<pre>
    &lt;table border&gt;
        &lt;tr&gt;
          &lt;th&gt;Kopfzelle: 1. Zeile, 1. Spalte&lt;/th&gt;
          &lt;td nowrap&gt;Datenzelle: 1. Zeile, 2. Spalte - Text wird nicht umgebrochen!&lt;/td&gt;
        &lt;/tr&gt;
    &lt;/table&gt;
</pre></p>
<p><table border>
    <tr>
      <th>Hallo-Welt-Befehl in JavaScript</th>
      <td nowrap><tt>document.write(&quot;Hello World&quot;); /* umbruchgesch&uuml;tzt */</tt></td>
    </tr>
  </table></p>
<br>
<p>Durch das Attribut <tt>nowrap</tt> im einleitenden Tag einer Kopfzelle
(<tt>&lt;th&gt;</tt>) oder einer Datenzelle (<tt>&lt;td&gt;</tt>) verhindert man
einen automatischen Zeilenumbruch beim folgenden Zelleninhalt.</P>

<p>Diese Angabe ist nur bei relativ kurzen und bestimmten Zellinhalten sinnvoll,
zum Beispiel bei Quellcode-Zeilen eines Programms.</p>
<hr width=80%
<p><h3 class="xmp">weitere Beispiele:</h3>
  <table border>
    <tr>
      <th width=200 align=left>Berlin</th>
      <th width=200>Hamburg</th>
      <th width=200 align=right>M&uuml;nchen</th>
    </tr>
    <tr>
      <td>Milj&ouml;h</td>
      <td align=center>Kiez</td>
      <td align=right>Bierdampf</td>
    </tr>
    <tr>
      <td>Buletten</td>
      <td align=center>Frikadellen</td>
      <td align=right>Fleischpflanzerl</td>
    </tr>
  </table>
</p>
<p>Die Anweisung lautet:<pre>

   &lt;table border&gt;
     &lt;tr&gt;
       &lt;th width=200 align=left&gt;Berlin&lt;/th&gt;
       &lt;th width=200&gt;Hamburg&lt;/th&gt;
       &lt;th width=200 align=right&gt;M&uuml;nchen&lt;/th&gt;
     &lt;/tr&gt;
     &lt;tr&gt;
       &lt;td&gt;Milj&ouml;h&lt;/td&gt;
       &lt;td align=center&gt;Kiez&lt;/td&gt;
       &lt;td align=right&gt;Bierdampf&lt;/td&gt;
     &lt;/tr&gt;
     &lt;tr&gt;
       &lt;td&gt;Buletten&lt;/td&gt;
       &lt;td align=center&gt;Frikadellen&lt;/td&gt;
       &lt;td align=right&gt;Fleischpflanzerl&lt;/td&gt;
     &lt;/tr&gt;
   &lt;/table&gt;
</pre></p>


<p>Man kann mehrere Zellen in einer Spalte verbinden, so dass sich
eine Zeile in dieser Spalte &uuml;ber mehrere Zeilen hinweg erstreckt.</p>
<p><table width=100%><tr><td>
    <table border>
      <tr>
        <th colspan=2>Die Menschheit besteht aus</th>
      </tr>
      <tr>
        <td align=center>Eseln</td>
        <td align=center>Affen</td>
      </tr>
    </table>
</td><td><pre>
    Die Anweisung lautet:

    &lt;table border&gt;
      &lt;tr&gt;
        &lt;th colspan=2&gt;Die Menschheit besteht aus&lt;/th&gt;
      &lt;/tr&gt;
      &lt;tr&gt;
        &lt;td align=center&gt;Eseln&lt;/td&gt;
        &lt;td align=center&gt;Affen&lt;/td&gt;
      &lt;/tr&gt;
    &lt;/table&gt;

</pre></td></tr></table></p><br>
<p><table width=100%><tr><td>
    <table border>
      <tr>
        <th rowspan=2>Die Eselheit besteht aus</th>
        <td>echten Eseln</td>
      </tr>
      <tr>
        <td>verkappten Eseln (Menschen)</td>
      </tr>
      <tr>
        <th rowspan=2>Die Affenheit besteht aus</th>
        <td>echten Affen</td>
      </tr>
      <tr>
        <td>verkappten Affen (Menschen)</td>
      </tr>
    </table>
</td><td><pre>
    Die Anweisung lautet:

    &lt;table border&gt;
      &lt;tr&gt;
        &lt;th rowspan=2&gt;Die Eselheit besteht aus&lt;/th&gt;
        &lt;td&gt;echten Eseln&lt;/td&gt;
      &lt;/tr&gt;
      &lt;tr&gt;
        &lt;td&gt;verkappten Eseln (Menschen)&lt;/td&gt;
      &lt;/tr&gt;
      &lt;tr&gt;
        &lt;th rowspan=2&gt;Die Affenheit besteht aus&lt;/th&gt;
        &lt;td&gt;echten Affen&lt;/td&gt;
      &lt;/tr&gt;
      &lt;tr&gt;
        &lt;td&gt;verkappten Affen (Menschen)&lt;/td&gt;
      &lt;/tr&gt;
    &lt;/table&gt;
</pre></td></tr></table></p><br>
<p><table width=100%><tr><td>
    <table border>
      <tr>
        <th colspan=2 rowspan=2>Der Mensch ist...</th>
        <td align=center>zum einen Teil ein Esel</td>
      </tr>
      <tr>
        <td align=center>zum anderen Teil ein Affe</td>
      </tr>
      <tr>
        <td>weder ein richtiger Esel</td>
        <td>noch ein richtiger Affe</td>
        <td><b>menschlich, allzumenschlich</b></td>
      </tr>
    </table>
</td><td><pre>
    Die Anweisung lautet:
    &lt;table border&gt;
      &lt;tr&gt;
        &lt;th colspan=2 rowspan=2&gt;Der Mensch ist...&lt;/th&gt;
        &lt;td align=center&gt;zum einen Teil ein Esel&lt;/td&gt;
      &lt;/tr&gt;
      &lt;tr&gt;
        &lt;td align=center&gt;zum anderen Teil ein Affe&lt;/td&gt;
      &lt;/tr&gt;
      &lt;tr&gt;
        &lt;td&gt;weder ein richtiger Esel&lt;/td&gt;
        &lt;td&gt;noch ein richtiger Affe&lt;/td&gt;
        &lt;td&gt;&lt;b&gt;menschlich, allzumenschlich&lt;/b&gt;&lt;/td&gt;
      &lt;/tr&gt;
    &lt;/table&gt;
</pre></td></tr></table></p><br>
<p>Zum Abschluss noch etwas über Hintergrund und Farbe.</p>
<table border background="work_back01.jpg" cellpadding=4>
      <tr>
        <th align=left>&#160;</th>
        <th align=left background="work_back03.gif"><font color=#FFFFCC>Erde</font></th>
        <th align=left background="work_back03.gif"><font color=#FFFFCC>Mars</font></th>
        <th align=left background="work_back03.gif"><font color=#FFFFCC>Venus</font></th>
      </tr>
      <tr>
        <th align=left valign=top background="work_back03.gif"><font color=#FFFFCC>Allgemeines</font></th>
        <td align=left valign=top>
W&auml;hrend der ersten rund 500 Millionen Jahre nach ihrer Entstehung blieb die
Temperatur der Erde relativ stabil bei 875 Grad Celsius. Die Erde setzte sich
vor allem aus Eisen und Silikaten zusammen, enthielt aber auch kleine Mengen
radioaktiver Elemente, und zwar haupts&auml;chlich Uran, Thorium und Kalium. Im
Verlaufe des Zerfallsprozesses dieser Elemente entstand Strahlung, die die Erde
langsam erhitzte, was zur Folge hatte, da&szlig; das Eisen und die Silikate
schmolzen. Das Eisen sank zum Zentrum ab und dr&auml;ngte dadurch die leichteren
Silikate an die Oberfl&auml;che. Dadurch wurden die gewaltigen Prozesse in Gang
gesetzt, die die Erdoberfl&auml;che so geformt haben, wie wir sie kennen und die
sie auch heute noch pr&auml;gen.
        </td>
        <td align=left valign=top>
Da der Planet Mars gut sichtbar und seine Atmosph&auml;re d&uuml;nn und
transparent ist, wissen wir mehr &uuml;ber ihn als &uuml;ber alle anderen
Planeten, die Erde ausgenommen. Ein Tag dauert auf Mars ungef&auml;hr so lange
wie auf der Erde, da Mars 24 Stunden und 37 Minuten ben&ouml;tigt, um sich um
seine eigene Achse zu drehen; sein Jahr jedoch dauert 687 Erdentage. Seine
Entfernung von der Sonne kann infolge seiner exzentrischen Umlaufbahn um rund 60
Millionen Kilometer variieren.
        </td>
        <td align=left valign=top>
Die Venus, geheimnisumwobener und direkter Nachbar der Erde, wurde nach der
gleichnamigen r&ouml;mischen Liebesg&ouml;ttin benannt. Aus ungekl&auml;rten
Gr&uuml;nden dreht sich die Venus &quot;r&uuml;ckw&auml;rts&quot; um die eigene
Achse, das hei&aacute;t in der ihrer Drehbewegung um die Sonne entgegengesetzten
Richtung.
        </td>
      </tr>
      <tr>
        <th align=left valign=top background="work_back03.gif"><font color=#FFFFCC>Atmosph&auml;re</font></th>
        <td align=left valign=top>
Zwischen dem Kern aus Eisen und der Kruste aus festem Gestein befindet sich ein
Mantel aus schwerem Silikatgestein von etwa 2800 Metern Dicke. Der Mantel ist
weder fest noch fl&uuml;ssig, sondern von einer z&auml;hfl&uuml;ssigen
Konsistenz, auf der die Kruste schwimmt. Diese Kruste besteht nicht aus einem
zusammenh&auml;ngenden St&uuml;ck fester Masse, sondern aus mehreren voneinander
getrennten Platten, an deren Grenzen die geologischen Prozesse weiterhin auf die
Erdoberfl&auml;che einwirken.
        </td>
        <td align=left valign=top>
Aufgrund seiner blutroten Farbe gaben die R&ouml;mer dem Planeten Mars den Namen
ihres Kriegsgottes; die Farbe ist auf Eisenoxid (&quot;Rost&quot;) an der
Oberfl&auml;che zur&uuml;ckzuf&uuml;hren. Kanal&auml;hnliche Formationen an der
Oberfl&auml;che des Planeten haben Wissenschaftler lange hoffen lassen, Wasser
zu finden, was h&auml;tte darauf hindeuten k&ouml;nnen, da&aacute; auf Mars
Leben existiert.
        </td>
        <td align=left valign=top>
Die Venus ist tats&auml;chlich &quot;umwoben&quot; von einer geheimnisvollen,
undurchdringlichen schweren Schicht von Wolken aus Schwefels&auml;ure &uuml;ber
einer Atmosph&auml;re aus 96 Prozent Kohlendioxid.
        </td>
      </tr>
  </table><br>
<p>Und hier die Anweisung:<pre>
    &lt;table border background="work_back01.jpg" cellpadding=4&gt;
      &lt;tr&gt;
        &lt;th align=left&gt;&#160;&lt;/th&gt;
        &lt;th align=left background="work_back03.gif"&gt;&lt;font color=#FFFFCC&gt;Erde&lt;/font&gt;&lt;/th&gt;
        &lt;th align=left background="work_back03.gif"&gt;&lt;font color=#FFFFCC&gt;Mars&lt;/font&gt;&lt;/th&gt;
        &lt;th align=left background="work_back03.gif"&gt;&lt;font color=#FFFFCC&gt;Venus&lt;/font&gt;&lt;/th&gt;
      &lt;/tr&gt;
      &lt;tr&gt;
        &lt;th align=left valign=top background="work_back03.gif"&gt;&lt;font color=#FFFFCC&gt;Allgemeines&lt;/font&gt;&lt;/th&gt;
        &lt;td align=left valign=top&gt;

             T E X T
        &lt;/td&gt;
        &lt;td align=left valign=top&gt;

             T E X T
        &lt;/td&gt;
        &lt;td align=left valign=top&gt;

             T E X T
        &lt;/td&gt;
      &lt;/tr&gt;
      &lt;tr&gt;
        &lt;th align=left valign=top background="work_back03.gif"&gt;&lt;font color=#FFFFCC&gt;Atmosph&auml;re&lt;/font&gt;&lt;/th&gt;
        &lt;td align=left valign=top&gt;

             T E X T
        &lt;/td&gt;
        &lt;td align=left valign=top&gt;

             T E X T
        &lt;/td&gt;
        &lt;td align=left valign=top&gt;

             T E X T
        &lt;/td&gt;
      &lt;/tr&gt;
  &lt;/table&gt;
  </pre></p>

<hr>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://home.chiemgau.com/amagerl/members/wolf"> http://home.chiemgau.com/amagerl/members/wolf </a>
</font>
<br>
<center>
<a href="NoCover.html#a3"> <img border=0 src="l_hauptinhalt.jpg" width=495 height=75></a>
</center></table></center></center><br>
</body>
</html>

