<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - MMX: &quot;Double Medication Tuesday&quot;</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Double Medication Tuesday&quot; / Harlan Cage</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Hierbei handelt es sich um das zweite Album der kalifornischen Gruppe
<B>Harlan Cage</B>. Das Cover, in metallische Blaut&ouml;ne getaucht, zeigt ein etwas
abstraktes Bild mit zahlreichen Gesichtsmasken, die in einem Raum schweben.
Das Artwork ist recht gut und neben den Texten gibt es im Booklet u.a.
auch ein Bild der Formation zu sehen.</P>

<P>Den Anfang macht &quot;<B>Blow Wind Blow</B>&quot;, der schon die markante, au&szlig;ergew&ouml;hnliche
Stimme des S&auml;ngers offenbart und ruhig rockig recht &quot;schweren&quot; Sound bietet
- gut.</P>

<P>&quot;<B>Halfway Home</B>&quot; beginnt mit einer sehr eindrucksvollen Einf&uuml;hrung, deren
Grundthema sich auch weiter durch den Titel zieht. Auf seine, ein wenig
d&uuml;stere, aber nicht deprimierende Art, ist der Song mitrei&szlig;end und der
Hauptrhythmus sehr eing&auml;ngig.</P>

<P>&quot;<B>Lola`s In Love</B>&quot; beginnt rockig/furios und es bleibt so flott. Gitarre
und Schlagzeug sind auch hier sehr pr&auml;gend, ein eigener Stil ist
unverkennbar.</P>

<P>&quot;<B>Solitary Dance</B>&quot; ist dann wesentlich ruhiger. Eine wirklich wunderbare
Ballade - gef&uuml;hlvoll gesungen, gespielt und mit einer sch&ouml;nen Melodie.</P>

<P>Mit leisen T&ouml;nen beginnt auch &quot;<B>My Mama Said</B>&quot;, bis der S&auml;nger seine
Geschichte zu `Erz&auml;hlen` bzw. zu Singen beginnt. Hier werden wieder
ungew&ouml;hnliche musikalische Schritte beschritten und auch wenn seine
Mutter meint, eine bestimmte Frau sei die Richtige f&uuml;r ihn, scheinen
sich die Dinge zum Schlechten ver&auml;ndert - und M&uuml;tter nicht immer Recht
zu haben.</P>

<P>&Uuml;bergangslos mit einer Mundharmonika-Einleitung, die an einen Supertramp-
Song erinnert, beginnt der n&auml;chste Titel &quot;<B>Dearborn Station</B>&quot;, dann setzt
eindringlich die Liedstimme ein. Nur allm&auml;hlich von hinzukommenden
Instrumenten unterst&uuml;tzt, die erst beim Refrain voll einsetzen, hier
schon orchestral wirken. Es klingt sehr &quot;voll&quot;, vom Klangspektrum her
gesehen, was man hier h&ouml;rt.</P>

<P>&quot;<B>Defend This Heart Of Mine</B>&quot; startet flott aber verhalten und zeigt seine
Power erst im Kehrreim. Instrumental wieder voll auf der H&ouml;he, bietet
Harlan Cage beim besten Willen keinen Eintopf an, sondern bleibt virtuos
und variabel.</P>

<P>&quot;<B>Restless Hearts</B>&quot; - mit ruhiger Intro geht es los, w&auml;hrend der Refrain
sehr nachdr&uuml;cklich vorgebracht wird. Kein leiser Song und wie einige
andere Titel in seinem Tempo sehr variierend und das nicht nur dort.</P>

<P>&quot;<B>Lights For Our Losers</B>&quot; folgt ein wenig dem Muster des vorangegangenen
Titels, allerdings mit anderer Melodie - die akzentuierte, eindringliche
Singweise heben ihn &uuml;ber den Durchschnitt, in den er ansonsten, in Bezug
auf die Qualit&auml;t des restlichen Albums, zu rutschen drohen w&uuml;rde.</P>

<P>&quot;<B>As You Are</B>&quot; ist besser. Nicht nur besser, sondern phantastisch! Eine
Liebesballade par excellence, mit soften Kl&auml;ngen, passend eingesetztem
Saxophone, gef&uuml;hlvollem Gesang und nicht zuletzt einer Melodie, die einen
wirklich entf&uuml;hrt - wenn man dazu bereit ist.</P>

<P>&quot;<B>Turn Up The Radio</B>&quot; ist wieder sehr interessant instrumentiert und bietet
nat&uuml;rlich zum vorigen Titel einen z&uuml;nftigen Gegensatz, wenn es gerade im
Refrain wieder richtig rockig zur Sache geht.</P>

<P>Der letzte Titel ist &quot;<B>Joker On The Kings Highway</B>&quot;. Nachdenklichkeit kommt
her&uuml;ber, die mit Schwerm&uuml;tigkeit einher geht:</P>
<DIV ALIGN="CENTER">
<B>                &quot;Callin` to me, the one who runs<br>
                      Away with my dreams<br>
                   I`ve done my time ya know,<br>
                    In the jail of her arms<br>
                   In a whirlwind of leaves<br>
                Blowin through prisons and schools<br>
                  I`ve done my share of walking<br>
                  In my fathers worn out shoes    &quot;<br> </B></DIV>

<P>Die Stimmung bleibt durchweg, auch wenn im Refrain Temperament durchbricht.
Absolut wirkungsvoll erreicht der Song sein Ziel, denn er ber&uuml;hrt einen -
ist etwas besonderes.</P>

<P>Etwas besonderes ist auch diese CD, die mich voll &uuml;berzeugt hat. Hier
sollte jeder an Melodic Rock / AOR Interessierte unbedingt zumindest
einmal hineinh&ouml;ren. Am Anfang war ich mir noch nicht im Klaren, ob ich
mich an die ungew&ouml;hnliche Stimme des S&auml;ngers L.A. Greene gew&ouml;hnen w&uuml;rde,
aber er singt wirklich gut, ist sicherlich ein wesentliches Element, das
den Stil der Gruppe ausmacht. Aber nicht das einzige, denn Melodien und
Instrumentierung zeigen Eigenst&auml;ndigkeit, eben Stil.</P>

<P>Man darf gespannt sein, was von diesen Jungs noch zu erwarten ist.</P>

<P>&copy; &amp; (P) 1998 MTM Music M&uuml;nchen, Vertrieb durch Intercord, ca. 30,- DM</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812cd5.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812film.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


