<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - MMX: Apollo</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Apollo - Atmospheres &amp; Soundtracks&quot; / Brian Eno</H1>von<BR><A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></DIV>

<P>Das der Film &quot;<B>Trainspotting</B>&quot; seinerzeit in aller Munde war und sich als
einer der Kultfilme schlechthin entpuppte, verdankte er sicherlich in
nicht zu verachtendem Maﬂe auch der Auswahl des ihn begleitenden
Soundtracks, welcher sich ja auch sehr gut verkaufte. Neben Underworlds
ber&uuml;hmt gewordenem &quot;Born slippy&quot; findet man darauf eine sehr gelungene
Querbeet-Mischung, die nicht nur durch St&uuml;cke von Iggy Pop und Leftfield
Partytauglichkeit beweist. Einen der Grenzpunkte der Scheibe bildet ein
St&uuml;ck, das mich auf die Suche nach weiterem Material seines Autors
schickte: &quot;<B>Deep Blue Day</B>&quot; von Brian Eno.</P>

<P>Dabei durfte ich denn feststellen, daﬂ selbiger zu den Ber&uuml;hmtheiten
gez&auml;hlt werden darf, die keiner kennt. Das erste Mal f&uuml;ndig wurde ich
bei WOM. Die pr&auml;sentierten mir ein gut sortiertes Fach, in dem mehr als
20 Alben des Komponisten standen, leider zu einem recht groﬂen Teil zu
&uuml;berzogenen Preisen. Jedenfalls durfte ich feststellen, daﬂ der gute Herr
bereits in einigen nicht unbekannten Soundtracks mitgemischt hat, seine
St&uuml;cke gern hier und da zur Hinterlegung von Fernsehreportagen genutzt
werden, daﬂ es nicht nur rein instrumentelles von ihm gibt, und und und.</P>

<P>Den oben genannten Track fand ich auf dem Album &quot;<B>Apollo</B>&quot; wieder, der
Soundtrack zu einem Dokumentarfilm &uuml;ber die erste Mondlandung. Vielleicht
ist meine Phantasie ja durch die Toilettentieftauchszene, bei der das
St&uuml;ck in &quot;Trainspotting&quot; zu h&ouml;ren war, vorbelastet, mir treten jedenfalls
beim H&ouml;ren der CD eher Bilder von einer U-Bootfahrt durch die Tiefen des
Meeres vor Augen, als das dahintreiben durch die leere Distanz zwischen
unserem Planeten und seinem kleinen Schwesterchen Luna. </P>

<P>Aber es geht uns ja auch viel mehr um die Musik. &quot;<B>Deep Blue Day</B>&quot; bildet
diesbez&uuml;glich auch wiederum eine Abgrenzung der Scheibe, n&auml;mlich in
Richtung Melodigkeit. Die anderen St&uuml;cke sind in der Regel wesentlich
weniger mitsummbar, erinnern wirklich mehr an ein Driften, als an ein
rhythmisches Vorantreiben. Dumpfe Schwingungen werden lange gehalten,
hier und da h&ouml;rt man es Blubbern, dort klagt ein Wal sein Leid, pl&ouml;tzlich
h&ouml;rt man das Aufschlagen eines gesunkenen Tankers durch das dichte Naﬂ
hallen. </P>

<P>Ganz und gar nicht unbekannt und wirklich recht spacig erscheinen, will
mir &quot;<B>An Ending</B>&quot;. Wollte ich bei meiner Tiefsee-Metaphorik bleiben, so
w&auml;re dieser Titel das zwischenzeitliche Auftauchen inmitten eines
r&ouml;tlich-gelben ozeanischen Sonnenaufgangs bei ruhigstem Seegang.</P>

<P>Wie gesagt wird aber bei diesem Titel auch das Eintreten der Apollo-
Kapsel in den Mond-Orbit sehr plastisch, sobald man seine Gedanken nur
in diese Richtung lenkt.</P>

<P>Aber schon der n&auml;chste Titel &quot;<B>Under Stars II</B>&quot; zieht mich mit aller Macht
wieder in die Tiefe, das eiserne Knarren des Schiffsrumpfes unter dem
Druck etlicher Gallonen Wassers scheint deutlich h&ouml;rbar. Gitarrenechos
ziehen wie Korallenriffe vor&uuml;ber. </P>

<P>&quot;<B>Silver Morning</B>&quot; hebt uns wieder etwas empor, wir holen erneut Luft, um
uns dann endlich in den &quot;Deep Blue Day&quot; zu st&uuml;rzen. Insgesamt 12 Tracks
und 49 Minuten Musik b&ouml;ten Gelegenheit, diese Bebilderungen sicher noch
ein Weilchen fortzuf&uuml;hren und tats&auml;chlich f&auml;llt mir kein besserer Weg
ein, zu beschreiben, was man hier findet, ich will es aber dabei
bewenden lassen.</P>

<P>Viele w&uuml;rden es sicher langweilig finden, es handelt sich eben um reine
Elektro-Instrumentals, so relaxt, wie eine Mondkapsel durchs All driftet,
oder eben wie ein Tauchboot sich nahezu ger&auml;uschlos in fremdartig irreal
anmutende Unterwasserregionen vortastet, oder was immer sonst einem
Menschen dabei durch den Kopf gehen mag.</P>
<P>
Wer Instrumental-Soundtracks, Synthi-Kompositionen, NewAge, Ambient oder
was auch immer vergleichbares mag, bereut es sicher nicht, Herrn Eno
mal sein Ohr zu leihen. </P>

<P>Wie &quot;Trainspotting&quot; eindrucksvoll beweist, kann man dabei sogar auf die
Idee kommen, aus einem Toilettenbecken einen Ozean werden zu lassen. </P>

<P>&quot;Apollo&quot; / Brian Eno, &copy; 1983 Virgin Records Ltd.</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812cd3.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812cd4.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


