<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - MMX: ANTZ</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;ANTZ&quot;</H1>von<BR><A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></DIV>

<P>Abgesehen davon, daﬂ schon der Titel &quot;ANTZ&quot; Spaﬂ macht, repr&auml;sentiert
er in seiner Zweideutigkeit auch bestens das Thema des zweiten reinen
Computer-Animationsfilms der Kinogeschichte.</P>

<P>Einerseits haben wir da einen Haufen kleinster Insekten, die so winzig
sind, daﬂ sie tats&auml;chlich nur im Plural erw&auml;hnenswert scheinen, und dann
wiederum tr&auml;gt doch jede einzelne von ihnen einen Namen, im Falle unseres
Helden &quot;Z&quot; zwar kein spektakul&auml;rer, aber immerhin Name genug, um seiner
Individualit&auml;t Ausdruck zu verleihen.</P>

<P>Steht dieses Aufgehen in der Masse im Widerspruch zur Selbstidentifikation
als denkendes und handelndes Individuum? Oder l&auml;ﬂt sich das &quot;Ich&quot; mit dem
&quot;Wir&quot; in der Realit&auml;t vielleicht durch einen ebenso leichten Trick
vereinen, wie es das Wortspiel des Titels demonstriert?</P>

<P>Dieser und &auml;hnlichen Fragen widmet <B>Spielberg</B> seinen Film und entwickelt
sie in einer kleinen Ameisenkolonie auf irgendeiner Wiese am Rande
irgendeiner Stadt. Verpackt wird das ganze in eine kurzweilige Geschichte,
die ihren &quot;Schema F&quot;-Charakter nicht zu verbergen sucht. Es ist eben
einfach &quot;eine der &uuml;blichen Junge verliebt sich, Junge rettet seine
Freundin, Junge ver&auml;ndert die Gesellschaft-Stories&quot;, wie der Held
am Ende das Werk ironisch kommentierend, verlauten l&auml;ﬂt.</P>

<P>Aber die Betonung liegt hier wirklich auf kurzweilig, denn die
eingemischten Zutaten bestehen nicht nur in Slapstick, Parodien auf
Kinoklassiker und amysantem Wortwitz, sondern dar&uuml;ber hinaus in der
unterschwelligen Einbindung der oben erw&auml;hnten Fragen, die hier und da
zum Denken anregen und letztlich klarstellen, daﬂ die Zielgruppe
keineswegs nur in Menschen j&uuml;ngeren Alters besteht. Angefangen von
der Relativit&auml;t des Blickwinkels bei der Bewertung der eigenen Realit&auml;t,
&uuml;ber den durchweg als Grundmotiv zu sp&uuml;renden Aufruf zum Selbsthandeln
und Selbstdenken, bis hin zur sozialen und politischen Strukturanalyse
finden sich zahlreiche H&auml;kchen, bei denen die Gedanken gern einen Moment
verweilen w&uuml;rden, wenn sie nicht f&uuml;rchten m&uuml;ﬂten, dabei schon wieder die
n&auml;chste Anspielung zu verpassen.</P>

<P>&quot;ANTZ&quot; ist die <B>gelungene Mischung</B> aus einem humorvollen, unterhaltsamen
und beschwingten Film, bei dem man nicht nachdenken muﬂ, so man nicht
will, und einer voller dezent eingebrachter Gedanken und Fragen steckenden
Abstraktion der menschlich-gesellschaftlichen Realit&auml;t in die Welt der
Ameisen, an der dann der Rest Spaﬂ hat. </P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812cd6.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812stor.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


