<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - MMX: &quot;Never Say Goodbye&quot;</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Never Say Goodbye&quot; / Ten</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>
<P>&quot;<B>Never Say Goodbye</B>&quot; - das ist mehr als eine &Uuml;berbr&uuml;ckungs-CD der
britischen Melodic Hardrock-Band `Ten`, bevor im Januar 1999 in
Europa ihr neues Album &quot;Spellbound&quot; erscheinen wird.</P>

<P>Es handelt sich um eine Doppel-CD in edler Aufmachung, aufgenommen w&auml;hrend
zweier Tourneen (The Name of the Rose &amp; The Robe 1997/98) plus einiger
vorher unver&ouml;ffentlichter Studiotitel.</P>

<P>Da die Tonqualit&auml;t, insbesondere in Anbetracht der Liveaufnahme, absolut
zu &uuml;berzeugen wei&szlig; und keineswegs an gewisse Bootlegs erinnert, und einer
wirklich kraftvollen und inspirierten Darbietung der Gruppe, wie auch des
S&auml;ngers Gary Hughes, bieten diese beiden randvollen CD`s einen sehr guten
Querschnitt &uuml;ber das bisherige Schaffen der Gruppe. Zum normalen Preis von
etwa 33 DM gibt es hiermit quasi eine `Best Of` der letzten drei Alben.</P>

<P>Da ich das erste (<A HREF="9803cd4.htm">&quot;X&quot;</A>) und das dritte (<A HREF="9806cd4.htm">&quot;The Robe&quot;</A>) Album im AmZeiger
bereits vorgestellt habe, gehe ich etwas allgemeiner auf diese
Neuerscheinung ein. </P>

<P>Auf dem schwarzen Cover prangt das vom letzten Album bekannte Ten-Logo im
Lorbeerkranz. Im Booklet gibt es gro&szlig;e Photos von allen Bandmitgliedern,
aufgenommen auch w&auml;hrend der Liveauftritte, au&szlig;erdem auch die Texte zu
allen Songs (au&szlig;er den Bonustracks)! - Ungew&ouml;hnlich f&uuml;r viele Best-Of`s
und erst recht f&uuml;r Live-CD`s.</P>

<P>Die meisten Titel halten von Aufwand und G&uuml;te der Instrumentierung
problemlos mit ihren Album-Pendants mit, auch wenn sie nat&uuml;rlich nicht
den gleichen Schliff aufweisen k&ouml;nnen. Daf&uuml;r werden leichte Variationen
geboten und insbesondere springt der `Funke` &uuml;ber! Man f&uuml;hlt - die Jungs
sind mit Freude bei der Sache. Das Publikum jubelt und applaudiert (ohne
die Songs zu &uuml;bert&ouml;nen - was mich an manchen anderen Liveaufnahmen st&ouml;rt)
und der S&auml;nger fordert sie h&auml;ufig zum Mitmachen auf. Auch gibt Gary Hughes
gelegentlich Erl&auml;uterungen vor dem Beginn eines Titels oder stellt mitten
in einem Titel in einem g&uuml;nstigen Augenblick die Gruppe, jeweils von
Applaus begleitet, vor. Es macht Spa&szlig; sich von der Begeisterung der
Gruppe und des Publikums mitrei&szlig;en zu lassen.</P>

<P>Dabei gibt es auch neben den schnellen, gelegentlich durchaus h&auml;rteren,
aber immer melodi&ouml;sen Titeln, auch Raum f&uuml;r leisere T&ouml;ne, wie bei
&quot;<B>Yesterday Lies In The Flames</B>&quot; oder bei &quot;<B>The Rainbow</B>&quot;, bei dem es
um den Selbstmord einer ber&uuml;hmten Sch&ouml;nen geht.</P>

<P>Hier ein Auszug aus dem Text:</P>

<DIV ALIGN="CENTER">
<B>        &quot;The truth behind the headline should have read<br>
             The crowd below could hear her call<br>
          But had no patience for the words she said<br>
             They only came to watch her fall&quot;</B></DIV>

<P>Gerade bei &quot;<B>You`re In My Heart</B>&quot; kommt das Potential des Frontmannes voll
zur Wirkung, denn bei dieser Version der sch&ouml;nen Ballade handelt es sich,
anders als auf dem Album, um eine Akustikvariante, bei der der S&auml;nger nur
von Klavier begleitet wird und auch ohne weitere instrumentale
Unterst&uuml;tzung voll zu &uuml;berzeugen wei&szlig;.</P>

<P>Bei &quot;<B>Goodnight Saigon</B>&quot; handelt es sich um einen eindringlichen Anti-
Kriegs-Song, &quot;<B>Ten Fathoms Deep</B>&quot; handelt dagegen von dem Untergang des
Schiffes &quot;Marie Celeste&quot;.</P>

<P>F&uuml;r die Fans des bombastisch/pomp&ouml;sen gibt es z.B. &quot;<B>The Robe</B>&quot; und &quot;<B>Arcadia</B>&quot;
jeweils mit einer, von einer sonoren Stimme gesprochenen Einf&uuml;hrung. Auch
bei dem Instrumental &quot;<B>The Pharao`s Prelude</B>&quot; gibt es eine gesprochene
Einf&uuml;hrung, die aus der Grabinschrift eines jungen Pharaos besteht -
beeindruckend!</P>

<P>Absolut gute Reisser d&uuml;rfen nat&uuml;rlich nicht fehlen: &quot;<B>Don`t Cry</B>&quot;, &quot;<B>After
The Love Has Gone</B>&quot; und &quot;<B>Standing On The Edge Of Time</B>&quot; runden die Produnktion
ab.</P>

<P>Es w&uuml;rde zu weit f&uuml;hren auf alle Songs einzugehen, so da&szlig; ich mich nur
noch kurz den neuen Studiotracks zuwenden m&ouml;chte. Dabei handelt es sich
um vier St&uuml;ck: &quot;<B>Black Moon Rising</B>&quot; gef&auml;llt mir ehrlich gesagt nicht
besonders, w&auml;hrend &quot;<B>Venus And Mars</B>&quot; mit einer sehr markanten Keyboard-
Sequenz beginnt, die den Titel auch weiterhin begleitet - gut.
&quot;<B>If Only For A Day</B>&quot; startet auch sehr markant mit einer Strophe, die
wirkt, als k&auml;me sie von einer alten knisternden Schallplatte, bis dann
der volle Klang hinzukommt. &quot;<B>Give Me A Piece Of Your Heart</B>&quot; ist, wie die
anderen Titel eine gute Abrundung einer Sammlung, z&auml;hlt aber eher zu
solidem Standard.</P>

<P>Alles in allem f&uuml;r Fans also ein Mu&szlig;, da sich Live-Versionen und Alben
wirkungsvoll erg&auml;nzen und es sich z.B. mit dem Akustik- und den
Bonustiteln, die hinzukommen, wirklich lohnt. F&uuml;r &quot;Neueinsteiger&quot; und
Interessierte bestimmt die beste Variante sich mit dieser Gruppe
vertraut zu machen.</P>

<P>(P) &amp; &copy; by Now & Then Productions 1998; Vertrieb durch Point Music;
ca. 33,- DM</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812mmx.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812cd1.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


