<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - MMX: &quot;Where You Gonna Run&quot;</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Where You Gonna Run&quot; / Firefly</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Bekannte Musiker, wie Ricky Phillips (Toto &amp; Bad English), Ron Wikso (The
Storm), sowie Bob Gilles (The Innocent) haben sich zusammen mit Michael
Alemania und John Pratt zu <B>Firefly</B> zusammengetan und hiermit ihr Debut
vorgelegt.</P>

<P>Auf dem Cover l&auml;uft ein Mann schemenhaft durch ein rotes Flammenmeer -
eindeutig im Computer erzeugt, aber stark aussehend. Im Booklet sind
auch alle Songtexte enthalten.</P>

<P>Das Album beginnt mit dem Titelsong &quot;<B>Where You Gonna Run</B>&quot; schon recht
munter, wenn auch bestimmte Sequenzen nach dem Refrain leider eher etwas
unharmonisch klingen und der Titel dadurch verliert.</P>

<P>Weiter geht es mit &quot;<B>Holes In The Wall</B>&quot;, der besser gef&auml;llt. Schnell,
melodisch, mit h&auml;rteren Kl&auml;ngen zwischendurch. Die Stimme und Singweise
von John Pratt ist allerdings erst einmal etwas gew&ouml;hnungsbed&uuml;rftig, hier
aber gelungen.</P>

<P>Der n&auml;chste Titel &quot;<B>Money</B>&quot; ist durchaus als Hardrock zu bezeichnen und
leider ziemlich unmelodisch.</P>

<P>&quot;<B>Calling Out Your Name</B>&quot; startet verhaltener, bis der S&auml;nger im Kehrreim
die unterdr&uuml;ckten Gef&uuml;hle rauslassen kann, aus seinem Herz keine
M&ouml;rdergrube mehr zu machen braucht. Die Musik - prima mit markanter
Gitarre und interessantem Keyboardhintergrund - mischt gelegentlich
disharmonisch wirkende Tonfolgen in den Background ein, was berechnet
erscheint und sich am Schlu&szlig; gewisserma&szlig;en zu einem Crescendo steigert,
ein interessanter, wirkungsvoller Effekt. Der Gesang von John Pratt wirkt
leider an manchen Stellen etwas zu &quot;kreischig&quot;, was in diesem Titel aber
zu verschmerzen ist. </P>

<P>&quot;<B>Scion</B>&quot; dagegen beginnt wieder hart, wenn auch langsam und das geht auch
bis zum Schlu&szlig; so weiter. Die Instrumente, sowie der Gesang wirken schwer
und d&uuml;ster, passend zum Text. Insgesamt aber doch nur Durchschnitt.</P>

<P>Ein ruhigerer Song ist &quot;<B>One Silent Voice</B>&quot;, mit einer sehr gef&auml;lligen
Melodie, die voll durchschlagen k&ouml;nnte, wenn der S&auml;nger hier nicht leider
zeitweise unertr&auml;glich zu &quot;Kreischen&quot; beg&auml;nne. Scheinbar befindet sich da
doch einiges vom Klangspektrum au&szlig;erhalb seiner M&ouml;glichkeiten oder es
liegt an der pers&ouml;nlichen Art - ich jedenfalls kann es in manchen Titeln
nicht verknusen.</P>

<P>&quot;<B>What Will Be Tomorrow</B>&quot; beginnt mit einer sch&ouml;nen instrumentalen Intro,
bis langsam der Gesang einsetzt, leider mit dem eben beschriebenen Effekt,
was dem an sich guten Titel auch seine negative Marke aufdr&uuml;ckt.</P>

<P>Bei &quot;<B>Take Me Back</B>&quot; bleibt dies aber im gr&uuml;nen Bereich, so da&szlig; es doch
noch einen recht guten Titel zu h&ouml;ren gibt, der zusammen mit dem
Hintergrundgesang und der durchaus markanten Begleitung &uuml;ber dem
Durchschnitt liegt. </P>

<P>&quot;<B>120 P.S.</B>&quot; ist wieder Hartrock in Reinkultur, in diesem Fall wieder kaum
melodi&ouml;s. F&uuml;r mich stellt aber Melodi&ouml;sit&auml;t auch bei h&auml;rteren Titeln ein
G&uuml;tezeichen dar. Dieser Song ist unterdurchschnittlich.</P>

<P>Der darauffolgende Titel &quot;<B>Lydia</B>&quot; ist einer der besten der CD und, das sei
dazu gesagt, auch generell sehr gut! Es ist ein gef&uuml;hlvoller Song, bei dem
die cool anzuh&ouml;rende Instrumentierung, mit dem Hintergrundgesang und dem
hier sehr passenden und guten Gesang von John Pratt zusammenspielt (es
geht also doch!). Wirklich ein Schmuckst&uuml;ckchen auf der CD.</P>

<P>Auch beim letzten Song &quot;<B>I Will, You Wont</B>&quot; beweist der S&auml;nger, da&szlig; er
tats&auml;chlich gut singen kann, wenn er in seinem Bereich bleibt, denn
hier handelt es sich um einen langsamen Akustiktitel, in dem er nur von
Akustikgitarren begleitet wird. Allerdings &uuml;berzeugt der Song selbst
nicht besonders und man kann ihn auch nicht unter Pop oder Rock einordnen
sondern er geht vielleicht sogar ganz leicht in die Richtung Folk/Country.</P>

<P>Sicherlich handelt es sich hier um ein musikalisch interessantes Debut,
allerdings mit im Endeffekt wenigen herausragenden Titeln. Viel von dem
Potential wurde durch den S&auml;nger vergurkt, aber eine Gruppe ist halt doch
die Summe seiner Mitglieder, so da&szlig; man es nicht ihm allein anlasten kann.</P>

<P>Schade, da h&auml;tte mehr draus werden k&ouml;nnen.</P>

<P>&copy; 1998 Escape Music Ltd., Vertrieb durch Point Music, ca. 30,- DM</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812cd2.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812cd6.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


