<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - MMX: Es sind Ratten im Souffl&#233;</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Es sind Ratten im Souffl&#233;</H1>Miniaturgeschichten-Versuche<BR>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A><BR>&copy; reserved.</DIV>


<P><B>Nachdem ich von einem Kurzgeschichten-Wettbewerb (SF oder Fantasy) gelesen
hatte, werkelte ich am folgenden Tage in der Mittagspause bereits am
Computer, obwohl ich die Konventionen nur &uuml;berflogen und deshalb undeutlich
im Ged&auml;chtnis hatte. Ich meinte, daﬂ die Story mit &quot;Es sind Ratten im
SoufflÈ!&quot; beginnen m&uuml;sse, sowie maximal 150 W&ouml;rter z&auml;hlen d&uuml;rfe.</P>

<P>Es hat sich aber leider herausgestellt, daﬂ beides nicht ganz korrekt war
- dazu sp&auml;ter mehr. Trotzdem ist das Endergebnis und die Entwicklung dahin
recht interessant.</P>

<P>Hier also erst einmal der dritte, finale Versuch, der den vermeintlichen
Vorgaben entsprochen h&auml;tte:</B></P>

<P><B><BR><U>Versuch 3:</U></B></P>

<P><BR><U>&quot;Es sind Ratten im SoufflÈ!&quot;</U><BR>
&quot;W&uuml;nsche guten Appettit!&quot;
<BR><U>&quot;Kommen Sie mir nicht so. Das ist ja skandal&ouml;s!&quot;</U><BR>
&quot;Solche G&auml;ste sind h&ouml;chstens skandal&ouml;s. Nur weil es kaum noch Restaurants
mit menschlicher Bedienung gibt, muﬂ sich meine Zunft st&auml;ndig mit dem
`Fliege in der Suppe`-Syndrom herumschlagen.&quot;
<BR><U>&quot;Ich verbitte mir solche Unterstellungen! Schauen Sie doch selbst!&quot;</U><BR>
&quot;Ups...&quot;
<BR><U>&quot;Da bleibt Ihnen wohl die Spucke weg?!&quot;</U><BR>
&quot;Hm, also mein Herr, ich muﬂ mich entschuldigen. Ich habe daf&uuml;r keine
Erkl&auml;rung!&quot;
<BR><U>&quot;Das wird teuer!&quot;</U>
<BR><I>&quot;Schnappt ihn Euch!&quot;</I>
<BR><U>&quot;Nein, argh.&quot;</U>
&quot;Warum haben sie ihn festgenommen?&quot;
<BR><I>&quot;Polizei! Wir sind vom Betrugsdezernat. Sehen sie diesen Apparat hier, den
er in seiner Jackentasche trug? Damit hat er versucht, die letzten besseren
Speiselokale zu betr&uuml;gen! Es ist ein neuartiger Hologramm-Projektor. - Wir
m&uuml;ssen jetzt los!&quot;</I><BR>
&quot;Diesen Blick in den Auflauf werde ich wohl nie vergessen! Was wird die
Technik in Zukunft wohl noch an &Uuml;berraschungen f&uuml;r mich bereithalten?&quot;</P>

<P>(146 W&ouml;rter) </P>

<P><B>Hier ist also die Idee auf das Wesentliche (in diesem Fall durch den Kniff
der ausschlieﬂlichen w&ouml;rtlichen Rede) konzentriert, ohne allzuviel der
Elemente, die ich unterbringen wollte, wegzulassen. An den folgenden
ersten beiden Versuchen kann man die Entwicklung dahin gut ablesen.</P>

<P>Begonnen hatte ich mit folgendem Text, der schon auf der urspr&uuml;nglichen
(Mini-)Idee basierte.</B></P>

<B><BR><U>Versuch 1:</U></B>

<P>&quot;Es sind Ratten im SoufflÈ!&quot;<BR>
&quot;W&uuml;nsche guten Appetit!&quot;, antwortete ich.<BR>
Er sah mich etwas konsterniert an. &quot;Nein, nein. Wirklich!&quot;, sagte er.<BR>
Er ging mir so auf die Nerven! Schon als er das Restaurant betreten hatte,
war er mir unangenehm aufgefallen. Griesgr&auml;mig und &uuml;belgelaunt war er mir
erschienen. Dann soll er doch lieber in eines der Automatik-Lokale gehen,
wo es keine menschliche Bedienung mehr gibt, hatte ich mir gedacht, oder
zu McRobot. Ausgerechnet an einem Tisch in meinem Bedienungsbereich hatte
er dann Platz genommen.<BR>
&quot;Sie w&uuml;nschen?&quot;, hatte ich gefragt, nachdem ich ihn eine Weile die Karte
studieren gelassen hatte.<BR>
Seine Stirn schlug Falten, als er intensiv &uuml;berlegte. Ich wunderte mich,
daﬂ er mehrmals verstohlene Blicke hinter sich warf. Schlieﬂlich traf er
seine Entscheidung: &quot;Pilz-SoufflÈ&quot;.<BR> Und jetzt dies. Noch bevor ich meine
Hand von der gerade vor ihm abgestellten Auflaufform zur&uuml;ckziehen konnte,
stellte er schon diese absurde Behauptung auf. Die ber&uuml;hmte Fliege in
der Suppe war mir ja bereits gel&auml;ufig und mit ihr, wie auch mit diversen
anderen Unzul&auml;nglichkeiten, wie z.B. Z&auml;hnen (meistens, die der Kunden)
hatte ich umzugehen gelernt.</P>

<P>(178 W&ouml;rter)</P>

<P><B>Hier sch&ouml;pfe ich noch aus dem Vollen und lasse den Protagonisten nach dem
kurzen Beginn zur Einf&uuml;hrung die letzten Minuten Revue passieren. Dann
allerdings habe ich doch die W&ouml;rter z&auml;hlen lassen und somit hatte sich
das schon erledigt.</B></P>

<P><B><BR><U>Versuch 2:</U></B></P>

<P>&quot;Es sind Ratten im SoufflÈ!&quot;<BR>
&quot;W&uuml;nsche guten Appetit!&quot;, antwortete ich. Wieder einer, der auf `Fliege
in der Suppe` machen wollte. Solche Typen hatten in den McRobot-Restaurants
nat&uuml;rlich schlechte Karten und daher versuchten sie es hin- und wieder hier.<BR>
Er sah mich etwas konsterniert an. &quot;Nein, nein. Wirklich!&quot;, sagte er.<BR>
Ich sah hinunter auf den Auflauf, den ich gerade vor ihm auf den Tisch
gestellt hatte und von dem ich noch nicht einmal die Hand zur&uuml;ckziehen
konnte, als er schon etwas auszusetzen hatte.<BR>
Nun zuckte sie allerdings sehr ruckartig von der Auflaufform zur&uuml;ck, als
mir durch die dampfende Oberschicht mit stumpfem Blick eine offensichtlich
tote Ratte entgegenlugte.<BR>
&quot;&Ouml;h!&quot;, war der erste Laut, zu dem ich in meiner Perplexit&auml;t erst einmal
f&auml;hig war.<BR>
&quot;Schnappt ihn Euch!, erklangen pl&ouml;tzlich vom Nebentisch Rufe und ein paar
M&auml;nner sprangen auf und legten ihm blitzschnell Handschellen an. Sichtlich
geknickt wartete er auf seinen Abtransport. </P>

<P><B>(An dieser Stelle fiel mir schon auf, daﬂ es wieder zu lang wird [148
W&ouml;rter bis dahin], aber ich entschloﬂ mich, diesen Versuch zu Ende zu
bringen.)</B></P>

<P>Einer der M&auml;nner trat auf mich zu, faﬂte dem Gast in die Tasche und zog
einen kleinen Apparat mit ein paar blinkenden Anzeigen heraus. Er hielt
mir einen Ausweis entgegen.<BR>
&quot;Wir sind vom Betrugsderzernat der Polizei. Unser Proband hier zockt der
Reihe nach Lokale mit menschlicher Bedienung ab, mit Hilfe dieses&quot;, er
nickte in Richtung des Ger&auml;tes, das er in der anderen Hand hielt,
&quot;neuartigen Holoprojektors.&quot;<BR>
Er verabschiedete sich abrupt und weg waren sie.<BR>
Meinen Blick in den Auflauf werde ich nie vergessen. Was w&uuml;rde die Technik
in Zukunft noch an &Uuml;berraschungen f&uuml;r mich bereithalten?</P>

<P>(243 W&ouml;rter)</P>

<P><B>Der R&uuml;ckblick ist also wegrationalisiert, was nicht gen&uuml;gte, zumindest, da
ich trotz der Wortbegrenzung nicht an den sprachlichen Mitteln herumk&uuml;rzen
wollte - auch wenn es so und so kein Anw&auml;rter auf den Literaturnobelpreis
ist. Vielleicht lesen Sie noch einmal das Endergebnis, denn jetzt k&ouml;nnen
Sie beurteilen, ob das Wesentliche noch enthalten ist.</P>

<P>Jedenfalls hat sich, wie erw&auml;hnt, herausgestellt, daﬂ die Vorgaben etwas
anders sind. Der Anfangssatz soll n&auml;mlich &quot;Da waren schon wieder Ratten im
SoufflÈ&quot; lauten und die maximale Wortanzahl 100 betragen. Die Idee ist
somit wertlos, aber das Probieren war ganz lustig.</B></P>

<P>05.11.1998 / Kommentare 20.11.1998.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812film.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../amz1298/uhl.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


