<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - MMX: &quot;All Or Nothing&quot;</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;All Or Nothing&quot; / Tower City</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>
<P>Das Deb&uuml;talbum dieser Gruppe <A HREF="9712lbf.htm">&quot;A Little Bit Of Fire&quot;</A> habe ich bereits in
der Ausgabe #3 vorgestellt. Vor wenigen Monaten ist endlich das zweite
Werk der drei Amerikaner um den S&auml;nger Larry Saltis erschienen.</P>

<P>Auf dem CD-Cover ist ein Falschfarbenbild mit einem Stra&szlig;enmusikanten,
seinem Banjo und Hund zu sehen. Gegen&uuml;ber dem letzten Album eher ein
designm&auml;&szlig;iger R&uuml;ckschritt stellt auch das Booklet dar, da&szlig; aber
zumindest dieses Mal mehr als einen, n&auml;mlich alle Texte enth&auml;lt.</P>

<P>Wichtiger ist aber sicherlich die Musik selbst. &quot;<B>Hot Water</B>&quot; macht schon
keinen schlechten Eindruck, der n&auml;chste Titel &quot;<B>Hungry</B>&quot; ist aber besser
und wei&szlig; an den Stil und die Klasse der besten Titel des Deb&uuml;ts
anzukn&uuml;pfen. Ruhige und temperamentvolle Sequenzen halten sich
hier gelungen die Waage, w&auml;hrend kraftvolle, bis in den Background
gute Instrumentalisierung und der mitrei&szlig;ende Gesang inklusive der
Hintergrunds&auml;nger einfach Spa&szlig; machen. </P>

<P>&Auml;hnliches gilt f&uuml;r &quot;<B>Fire With Fire</B>&quot;, einen Titel f&uuml;r M&ouml;chtegern-
Revoluzzer. ;) &quot;In These Arms&quot; ist trotz `rauhen` Gesangs etwas ruhiger
und bringt einige neue Elemente in die Musik ein, ohne einen Stilbruch
zu bewirken - klingt gut! &quot;<B>Two Sides Of Love</B>&quot; erinnert an die h&auml;rteren
Titel des ersten Albums, bleibt aber problemlos im gr&uuml;nen Bereich.</P>

<P>Dann folgt der Titelsong &quot;<B>All Or Nothing</B>&quot;, nicht schlecht, wenn auch
im Refrain vielleicht etwas zu hektisch. In &quot;No Regrets&quot; zeigt Tower
City ein ganz anderes Gesicht als gewohnt: Viel ruhiger, ohne langweilig
zu sein, aber auch mit einem wesentlich geringeren `Rock-Faktor&quot; - das
klingt gef&auml;llig, mal etwas anderes.</P>

<P>&quot;<B>Another Brother</B>&quot; hat zwar einen hohen &quot;Rock-Faktor&quot;, ist mir aber
zu unmelodi&ouml;s und hat zu wenig Basis - nicht gut. Neben &quot;<B>Hungry</B>&quot; am
meisten an das erste Album ankn&uuml;pfen und das auf die positivste Weise,
kann der nun folgende Titel &quot;<B>I Won`t Surrender</B>&quot;. Er ist melodi&ouml;s,
einf&uuml;hlsam, gut vorgetragen - musikalisch Spitze!</P>

<P>F&uuml;r &quot;<B>Rush</B>&quot; gilt in etwa meine Einsch&auml;tzung zu &quot;Another Brother&quot; - etwas
zu hart und zu unmelodi&ouml;s. &quot;<B>Stockholm</B>&quot; ist wieder einer der Titel, der
neue Seiten an Tower City aufzeigt. Er erinnert (erschreckend) stark an,
meiner Meinung nach etwas seichten, zeitgen&ouml;ssischen BritPop. Das stellt
nun doch schon leider einen ziemlich herben Stilbruch dar.</P>

<P>Der letzte Titel &quot;<B>I Just Wanna Be The One</B>&quot; kehrt zwar in etwas bew&auml;hrtere
Jagdgr&uuml;nde zur&uuml;ck, wiederholt aber zu sehr bekannte Muster und bietet
nichts Neues.</P>

<P>Dahinter versteckt sich noch ein Bonussong auf den allerdings die auf
dem Cover korrekt angegebene Titell&auml;nge hinweist. Es handelt sich um
den vom ersten Album bekannten Titel &quot;<B>Surrender</B>&quot;, der einen doch etwas
schmerzhaft daran erinnert, was man von dem neuen Album erwartet und
doch nur ungen&uuml;gend erf&uuml;llt bekommen hat.</P>

<P>Nur wenige Titel k&ouml;nnen wirklich an die gleiche Qualit&auml;t ankn&uuml;pfen,
es wird zuviel Standard geboten oder mit faktischen Stilbr&uuml;chen
herumexperimentiert. Vielleicht h&auml;tte eine etwas gr&ouml;&szlig;ere Pause der
Produktion doch gut getan.</P>

<P>F&uuml;r Fans ist die CD auf jeden Fall mal ein Reinh&ouml;ren wert, denn die
betreffenden Titel lohnen auf jeden Fall und &uuml;ber Geschmack l&auml;&szlig;t sich
ja bekanntlich (nicht?) streiten.</P>

<P>(P) &amp; &copy; by MTM Music M&uuml;nchen 1998, ca. 30,- DM </P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812cd1.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812cd2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


