<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Haage &amp; Partner nimmt Stellung zur PowerPC-Version von ArtEffect</H2>
<P><B>Haage &amp; Partner (<A HREF="http://www.haage-partner.de" TARGET="_top">http://www.haage-partner.de</A>) informiert:</B></P>
<P>
&raquo;Warum gibt es keine PPC-Version von ArtEffect bzw. den Plugins?
</P>
<P>
Wenn wir die Plugins f&uuml;r den PowerPC kompilieren, dann ist der
Geschwindigkeitsvorteil bei der Version 3 und 4 gering bis gar nicht
vorhanden. Dies liegt zum gro&szlig;en Teil an der internen Struktur von AE, die
im Rahmen der virtuellen Speicherverwaltung st&auml;ndig auf das OS zugreift.
Hier kommen dann die bekannten Umschaltzeiten zwischen PPC- und 68k-CPU
auf den phase5-Boards zum Tragen, die den gesamten Geschwindigkeitsvorteil
aufheben.
</P>
<P>
Eine Umstellung von AE auf die Gegebenheit, da&szlig; das OS fast komplett auf
dem 68k ausgef&uuml;hrt wird, w&uuml;rde eine weitgehende Neuprogrammierung
bedeuten. Dies w&auml;re wenig sinnvoll, weil es auf einem &quot;normalen&quot;
PPC-System (ohne 68k-CPU) wieder zur vollen Geschwindigkeit kommen w&uuml;rde.
Nur warten wir leider schon seit 3 Jahren auf dieses System, was wir aber
nicht Wissen konnten.
</P>
<P>
Eine Best&auml;tigung unserer urspr&uuml;nglichen Vermutungen und dieser Aussage ist
am Produkt AmigaWriter zu sehen. Hier haben wir mit gro&szlig;em Aufwand eine
spezielle phase5-PPC-Optimierung gemacht. Diese resultiert in einem
Geschwindigkeitszuwachs von 5 - 30% bei einigen Funktionen. Das ist damit
meilenweit entfernt von der erwarteten 5 bis 10-fachen
Geschwindigkeitssteigerung (allein 5-fach durch den rund 5x h&ouml;heren Takt
des PPC und eine Verdoppelung durch die bessere Technik der CPU).
</P>
<P>
Andere Programmierer k&ouml;nnen dies mit Sicherheit best&auml;tigen. Es gibt dabei
auch Ausnahmen, n&auml;mlich dann, wenn das Programm in idealen Modulen
vorliegt, bei denen die reine Rechenroutine m&ouml;glichst lange direkt auf dem
PPC arbeiten kann, ohne zum 68k wechseln zu m&uuml;ssen. Beispiele hierf&uuml;r sind
Tornado3D und Wildfire, die tats&auml;chlich Faktoren von 5-10 aus dem PPC
herausholen.
</P>
<P>
Wir hatten in der Vergangenheit des&ouml;fteren &uuml;berlegt, ob wir eine derartige
Betrachtung ver&ouml;ffentlichen sollen. Wir haben aber davon abgesehen, weil
wir den Markt nicht weiter gef&auml;hrden wollten, denn f&uuml;r Hersteller und
H&auml;ndler ist es schon seit langem ein Weg am Abgrund. Wir waren auch immer
guter Hoffnung, da&szlig; es bald &quot;echte&quot; PPC-Karten f&uuml;r den Amiga geben w&uuml;rde,
denn schlie&szlig;lich wu&szlig;ten wir intern von gut einem halben Dutzend solcher
Projekten. Verwunderlich ist es, da&szlig; sich offensichtlich nur Wenige
gefragt haben, warum wir keine PPC-Versionen unserer Programme auf den
Markt gebracht haben, wo wir doch in der Werbung des StormC-Compilers
gesagt hatten, da&szlig; daf&uuml;r nur ein Neu-Compilieren notwendig ist. Unter dem
Druck der Amiga-Gemeinde h&auml;tten wir es dann vermutlich auch fr&uuml;her so
dargestellt, da aber kaum einer gefragt hat...
</P>
Markus Nerding<BR>
Gesch&auml;ftsf&uuml;hrer&laquo;<BR>
<P ALIGN="RIGHT">
<A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
