<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses7.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>6. Neuigkeiten von Airsoft Softwair</H2>
<P><B>Airsoft Softwair (<A HREF="http://www.airsoftsoftwair.de" TARGET="_top">http://www.airsoftsoftwair.de</A>) informiert:</B></P>
<P>
&raquo;Auf der Airsoft Softwair Homepage wurde soeben ein neues Update des CD32
Games Install Kits f&uuml;r Besitzer der ´The Best Of Airsoft Softwair Gold
Edition´ CD-ROM ver&ouml;ffentlicht. Version 4.4 NG unterst&uuml;tzt jetzt insgesamt
182 Spiele! Au&szlig;erdem gab es einige Optimierungen und es wurde auch ein
kleinerer Fehler behoben.
</P>
<P>
Die Version 4.4 steht ab sofort im gesch&uuml;tzten Downloadbereich
der The Best Of Airsoft Softwair Gold Edition CD-ROM zur Verf&uuml;gung.&laquo;
</P>
<P>
&raquo;Auf der Airsoft Softwair Homepage steht das CD32 Games Install
Kit v4.41 NG f&uuml;r Besitzer des The Best OF Airsoft Softwair Gold Edition
CD-ROM zum Download bereit. Es wurde ein schwerer Fehler behoben
und jeder sollte deshalb dieses Update installieren.&laquo;
</P>
<P>
&raquo;Weil schon einige Emulationsseiten dar&uuml;ber berichtet haben,
m&ouml;chte ich hier noch ein offizielles &quot;Statement&quot; nachliefern zur
Windows Version meines CD32 Games Install Kits: Die Version wird in
Verbindung mit dem WinUAE laufen und sehr bald ver&ouml;ffentlicht werden.
Dabei ist die Kompatibilit&auml;t sehr hoch, da jedes Spiel einzeln angepasst
wird (genau wie in der Amiga Version). Auch wenn der Name es sagt, in
der Windows Version m&uuml;ssen die Spiele nicht mehr installiert werden sondern
laufen direkt von der CD-ROM. CD Audio wird bisher noch nicht unterst&uuml;tzt
ist aber in fester Planung (der UAE m&uuml;sste hierzu modifiziert werden). Die
erste Version des CD32 Games Install Kits 4.5 (Win32 1.0) wird
voraussichtlich Ende n&auml;chster Woche erscheinen. Momentan allerdings nur f&uuml;r
Besitzer des The Best Of Airsoft Softwair Gold Edition Cd-ROM. Auf der
Airsoft Softwair Homepage stehen einige Screenshots der Windows Version
bereit.&laquo;
</P>
<P>
&raquo;Ab sofort k&ouml;nnen meine Programme auch per Kreditkarte
&uuml;ber RegNet bestellt werden. Weitere Informationen dazu
gibt es auf der Airsoft Softwair Homepage unter der
Rubrik &quot;Order&quot;. Diese Option d&uuml;rfte haupts&auml;chlich f&uuml;r
Benutzer au&szlig;erhalb von Europa interessant sein, da durch
den hohen Dollar-Kurs (bzw. schwachen Euro-Kurs) etwa
10 DM mehr an Kosten anfallen. Daf&uuml;r geht es nat&uuml;rlich
viel bequemer.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses7.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
