<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Die AMIGA-aktuell-Wunschliste (von Christian Aichinger)</H2>
<P>
Ganze 2 Leser haben uns, nach meinem Aufruf im Schlu&szlig;wort der letzten
Ausgabe, ihre Artikelw&uuml;nsche mitgeteilt. Entweder die lieben Leser sind
wirklich etwas schreibfaul oder absolut zufrieden mit dem, was AMIGA
aktuell ihnen bietet ;).
</P>
<P><B>Werner Schneemelcher &lt;<A HREF="mailto:WSchnee@t-online.de">WSchnee@t-online.de</A>&gt; schrieb folgende EMail:</B></P>
<P><B>&raquo;Hallo Christian</B></P>
<P>
bin deinem Aufruf gefolgt und schreibe dir hier ein paar Anmerkungen. Als
erstes muss ich sagen, dass mir die AA gut gef&auml;llt, und Ihr so weitermachen
solltet. Die AA ist &uuml;bersichtlich gestaltet, und nicht &uuml;berladen. Es m&uuml;sste
eigentlich f&uuml;r jeden etwas dabei sein. Die Preisfragen sind f&uuml;r jeden
l&ouml;sbar.
</P>
<P>
Als Themen w&uuml;rde ich mir zum Beispiel w&uuml;nschen: Telefonieren &uuml;ber Internet
mit dem Amiga, bzw. der Euro auf dem Amiga.
</P>
<P>
Mit freundlichen Gr&uuml;&szlig;en<BR>
Werner Schneemelcher&laquo;<BR>
</P>
<P><B>Kai Eckardt &lt;<A HREF="mailto:eckardt@stud.fh-hannover.de">eckardt@stud.fh-hannover.de</A>&gt; schrieb:</B></P>
<P><B>&raquo;Moin!</B></P>
<P>
Noch eine kurze Anmerkung zur konstruktiven Kritik: Ich habe keine! Wenn
euch diesbez&uuml;glich keine oder nur wenige E-Mails erreichen, w&uuml;rde ich sagen,
ihr k&ouml;nnt davon ausgehen, da&szlig; das Magazin so gut ist, oder die Leser auch
nicht wissen, was man noch besser machen k&ouml;nnte. Wenn die Beteiligung bei
z.B. der FD-Hitparade so schlecht ist, liegt das wohl daran, da&szlig; es f&uuml;r den
Leser auch Arbeit bedeutet sich Spiele zu suchen, testen und zu bewerten.
Das m&uuml;&szlig;te er n&auml;mlich tun, wenn er nicht in seiner Freizeit sowieso st&auml;ndig
PD-Software ausprobiert. Da finde ich die Rubrik &quot;kleine Helfer im Amiga-
Alltag&quot; noch sinnvoller.
</P>
<P>
Leute, die sich &uuml;ber Rubriken Aufregen oder nur Beleidigungen an euch
senden kann ich &uuml;brigens nat&uuml;rlich auch nicht verstehen.
</P>
<P>
Einen Wunschartikel m&ouml;chtet ihr wissen? Hm, da f&auml;llt mir nur eins zu ein:
Ich habe jetzt endlich Socks5 mit Genesis zum laufen bekommen, mit dem
Server route ich meine Dose durch den Amiga ins Internet. Dummerweise habe
ich keine Idee wie man das Ding konfiguriert, so da&szlig; die Firewall zum
Einsatz kommt. Zur Zeit ist er immer noch so offen wie minisockd aus dem
Aminet, ohne Sicherheitsprotokolle. Ein Artikel zum Thema &quot;Wie konfiguriere
ich sinnvollerweise socks5&quot; w&auml;re f&uuml;r mich prima. Aber auch schon recht
speziell.
</P>
<P>
Ups, jetzt ist die Mail doch l&auml;nger geworden als ich dachte.. :)
</P>
<P><B>Gru&szlig;, Kai&laquo;</B></P>
<P>
Danke erst mal f&uuml;r eure E-Mails und die netten Komplimente. Die genannten
Themen sind bestimmt auch f&uuml;r andere Leser sehr interessant. Falls es
jemanden gibt, der mit Internet-Telefonie, Euro auf dem Amiga und Socks5-
Konfiguration Erfahrung hat...immer ran an die Tastatur und her mit den
Artikeln ;)! Wir von AMIGA aktuell suchen au&szlig;erdem noch Autoren, die etwas
&uuml;ber die diversen PCI-Erweiterungen von DCE (G-Rex) und Matay (Prometheus)
schreiben k&ouml;nnten. Vor einiger Zeit hatte auch ein Leser den Wunsch
ge&auml;u&szlig;ert, gerne einmal einen direkten Vergleich zwischen Opus Magelan,
EASys und Scalos zu lesen. Auch das Thema Vernetzung (Ethernet, Router,
Hubs, Switches, TCP/IP, ADSL und &auml;hnliche Dinge) stehen ganz weit oben auf
der Wunschliste der Leser.
</P>
<P>
Wir haben  uns &uuml;berlegt, da&szlig; es keine schlechte Idee w&auml;re, diese
Wunschliste ganz regul&auml;r in AMIGA aktuell zu integrieren. Jeder Leser ist
eingeladen uns seine Artikelw&uuml;nsche mitzuteilen. Ich w&uuml;rde mich bereit
erkl&auml;ren, diese Wunschliste zusammenzustellen und bei Bedarf im Forum zu
ver&ouml;ffentlichen. Dies w&uuml;rde aber sehr von der Resonanz des Lesers (also
genau dir, der da gerade diese Zeilen lie&szlig;t ;)) abh&auml;ngen. Bekommen wir
ausschlie&szlig;lich Leserw&uuml;nsche mitgeteilt, dazu aber keinerlei passende
Artikel, ist die Erstellung einer Wunschliste verst&auml;ndlicherweise
&uuml;berfl&uuml;ssig.
</P>
<P><B>Christian Aichinger &lt;<A HREF="mailto:christian@aakt.de">christian@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
