<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
An dieser Stelle m&uuml;ssen wir eine schlechte Nachricht in eigener Sache
bekannt geben: In den letzten Monaten ist bei den Hard- und
Softwarentwicklern bzw. -h&auml;ndlern die Bereitschaft, Preise f&uuml;r das AMIGA-
aktuell-Gewinnspiel zu stiften, leider immer mehr zur&uuml;ckgegangen. Zwar ist
dies zweifellos vor allem in der katastrophalen Amiga-Situation begr&uuml;ndet,
nichtsdestotrotz macht ein Gewinnspiel ohne Preise keinen Sinn.
</P>
<P>
Aus diesem Grund haben wir uns nach einiger Diskussion dazu entschlossen,
das AMIGA-aktuell-Gewinnspiel vorerst auszusetzen. Sowie uns jedoch wieder
gen&uuml;gend Preise f&uuml;r mindestens vier Ausgaben zur Verf&uuml;gung stehen, werden
wir die Rubrik wiederbeleben.
</P>
<P>
In der Zwischenzeit werdet ihr aber dennoch nicht auf die Meinungsfrage
verzichten m&uuml;ssen, sie wird von nun an in leicht ver&auml;nderter Form und
nat&uuml;rlich ohne Gewinnm&ouml;glichkeit in der Rubrik &quot;Forum&quot; gestellt. Bitte
meldet euch auch weiterhin mit euren Kommentaren zu Wort!
</P>
<P>
So, nun aber zur vorerst letzten Gewinnspiel-Auswertung: Mitgemacht haben
diesmal 31 Leser.
</P>
<P><B>Jetzt zur Aufl&ouml;sung:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Standard-Frage:&nbsp;</TD><TD VALIGN="TOP">Wie hei&szlig;t der von Sharp angek&uuml;ndigte PDA (Pers&ouml;nlicher&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Digitaler Assistent), f&uuml;r den AMIGA, Inc. Inhalte liefert?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Das Ger&auml;t soll den Namen &raquo;Zaurus&laquo; tragen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Master-Frage:&nbsp;</TD><TD VALIGN="TOP">Wie lautet der Name der japanischen Messe, auf der der oben&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">gesuchte PDA im letzten Monat pr&auml;sentiert wurde?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Es handelte sich um die &raquo;(Japanese) Business Show 2001&laquo;.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Meinungsfrage:&nbsp;</TD><TD VALIGN="TOP">Wirst du dir diesen PDA zulegen?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 (Ja, auf jeden Fall.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">2&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Ja, wahrscheinlich.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">4&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3 (Nein, wahrscheinlich nicht.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">15&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">4 (Nein, auf keinen Fall.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">9&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Ein Teilnehmer hat keine Meinung ge&auml;u&szlig;ert.
</P>
<P>
Einige Einsender hatten zu ihrer Beantwortung der Meinungsfrage Stellung
bezogen:
</P>
<P>
Stellan Pistoor antwortet auf die Frage &raquo;Wirst du dir diesen PDA zulegen?&laquo;
mit &raquo;Nein, auf keinen Fall. Mir ist schon mein 21&quot; Monitor zu klein.&laquo;
</P>
<P>
Auch Kai Eckardt meint &raquo;Nein, auf keinen Fall. Das liegt aber haupts&auml;chlich
daran, da&szlig; er so furchtbar teuer ist, wenn man den Nutzeffekt betrachtet.
AmigaDE auf einem Palm 100 f&uuml;r max. 250 DM w&auml;re da was anderes.&laquo;
</P>
<P>
Claus Luethje sieht das v&ouml;llig anders: &raquo;Endlich geht's im Amiga-Bereich
wieder richtig los. Im Herbst werde ich mir einen AmigaOne zulegen und kurz
vor Weihnachten einen Zaurus. &quot;freu&quot;&laquo;
</P>
<P>
Stefan Schulze will sich kein solches Ger&auml;t zulegen: &raquo;So ein PDA ist
sicherlich n&uuml;tzlich f&uuml;r den einen oder anderen, aber ich warte auf einen
richtigen Desktop-Computer (selbst wenn das noch Jahre dauert).&laquo;
</P>
<P>
Kai Stegmann formuliert die wohl vorherrschende Meinung kurz und knapp:
&raquo;Ich bin bisher ohne PDA ausgekommen, warum sollte sich das jetzt &auml;ndern?&laquo;
</P>
<P>
So beurteilt es auch Markus M&uuml;ller: &raquo;So positiv ich auch die Kooperation
mit Sharp sehe, ich pers&ouml;nlich brauche einfach keinen PDA...&laquo;
</P>
<P>
Und auch Sascha Atrops ist dieser Meinung: &raquo;Ich selbst brauche keinen PDA,
ich programmiere und brauche daher eher einen Laptop... Was w&uuml;rde ich f&uuml;r
einen Amiga-Laptop geben?!&laquo;
</P>
<P>
Michael Stum wartet ab: &raquo;Der Zaurus muss erst mal richtig auf dem Markt
sein, dann werde ich &uuml;ber eine Anschaffung nachdenken.&laquo;
</P>
<P>
Yvan Gutknecht sieht die Sache positiv: &raquo;Ich brauche einen Ersatz f&uuml;r
meinen Psion 3c, und ein Linux-basierter PDA mit AmigaDE ist echt cool.&laquo;
</P>
<P>
Gernod Schomberg antwortet mit &raquo;Nein, auf keinen Fall.&laquo;, betont aber:
&raquo;Diese Antwort ist keine Wertung. Es ist einfach so, dass ich als uralter
Rentner Zeit genug habe, meine Arbeiten am Computer zu Hause zu erledigen.
Irgend welche dringenden Au&szlig;endienst-T&auml;tigkeiten, bei denen man alle Daten
dabei haben m&uuml;sste, kommen deshalb auch nicht vor. Und als Spielzeug
brauche ich ihn nicht.&laquo;
</P>
<P><B>Fazit:</B></P>
<P>
Zwar begr&uuml;&szlig;en viele User AMIGAs Kooperation mit Sharp, f&uuml;r sie pers&ouml;nlich
kommt die Anschaffung eines PDA jedoch meist nicht in Frage. M&ouml;glicherweise
NOCH nicht - denn bekanntlich haben sich auch Handies anfangs nur langsam
verbreitet, aber welche Rolle sie heute spielen, wissen wir alle.
</P>
<P><B>Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:</B></P>
1 x Vollversion von &quot;AFiloFaxPro&quot;: Sascha Atrops<BR>
1 x Vollversion von &quot;Foundation Gold&quot;: Ralf Junius<BR>
1 x 3-Ausgaben-Abo der Amiga Future; mit CD, ohne Pr&auml;mie: Markus M&uuml;ller<BR>
<P><B>Herzlichen Gl&uuml;ckwunsch!</B></P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
