<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Intern</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Intern1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Intern.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Intern3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Intern
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. FAQ (H&auml;ufig gestellte Fragen zu AMIGA aktuell)</H2>
<P><B>Das AMIGA-aktuell-FAQ</B></P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Zusammensteller&nbsp;</TD><TD VALIGN="TOP">: Christian Aichinger (<A HREF="mailto:christian@aakt.de">christian@aakt.de</A>)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Herausgeber&nbsp;</TD><TD VALIGN="TOP">: Carsten Schr&ouml;der (<A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A>)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Copyright&nbsp;</TD><TD VALIGN="TOP">: freely distributable (Freeware)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Version&nbsp;</TD><TD VALIGN="TOP">: $VER: Version 0.0.4 deutsche Ausgabe vom 25.02.2001&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Bezugsquelle&nbsp;</TD><TD VALIGN="TOP">: <A HREF="http://www.aakt.de" TARGET="_top">http://www.aakt.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Vorbemerkung</B></P>
<P>
Das AMIGA-aktuell-FAQ (FAQ = frequently asked questions = H&auml;ufig gestellte
Fragen) ist dazu da, um der Redaktion von AMIGA aktuell &quot;den Kopf frei zu
halten&quot; und nat&uuml;rlich um Deine Fragen so schnell und so einfach wie m&ouml;glich
zu beantworten. Also bevor Du Fragen an Carsten Schr&ouml;der oder mich stellst,
lies Dir zuerst dieses Dokument gr&uuml;ndlich durch. Dieses Dokument enth&auml;lt
zum Teil Fragen, die eigentlich noch nie gestellt wurden. Nach meiner
Meinung sind aber viele dieser &quot;erfundenen&quot; Fragen durchaus wert gestellt
und auch beantwortet zu werden. Bist Du der Meinung, da&szlig; in diesem FAQ
wichtige Fragen bzw. Antworten fehlen oder Du Vorschl&auml;ge hast, wie man das
FAQ verbessern k&ouml;nnte, dann schicke bitte eine Mail an <A HREF="mailto:christian@aakt.de">christian@aakt.de</A> .
Das FAQ wird dann unverz&uuml;glich erweitert.
</P>
<H3>1. Allgemeine Fragen</H3>
<P><B>F: Was ist AMIGA aktuell?</B></P>
<P>
A: AMIGA aktuell ist ein deutsches Infotainment-Magazin, das sich
haupts&auml;chlich mit der Computerplattform &quot;Amiga&quot; (<A HREF="http://www.amiga.com" TARGET="_top">http://www.amiga.com</A>)
besch&auml;ftigt. In AMIGA aktuell werden Neuigkeiten, Workshops, Testberichte
und noch vieles andere ver&ouml;ffentlicht. AMIGA aktuell erscheint in einer
HTML- und AmigaGuide-Version und wird dem interessierten Leser kostenlos
zur Verf&uuml;gung gestellt. Es wird weiterhin eine englischsprachige
(internationale) Version angeboten. AMIGA aktuell erscheint monatlich und
normalerweise immer in der ersten Woche des Monats. Die internationale
Ausgabe erscheint ca. drei Wochen sp&auml;ter und ist nur im HTML-Format
erh&auml;ltlich.
</P>
<P><B>F: Wie bekomme ich AMIGA aktuell?</B></P>
<P>
A: Es gibt mehrere M&ouml;glichkeiten, AMIGA aktuell zu beziehen. Die zwei
wichtigsten sind:
</P>
<UL>
<LI> Von der Homepage (<A HREF="http://www.aakt.de" TARGET="_top">http://www.aakt.de</A>). Hier befindet sich die Online-
  Ausgabe von AMIGA aktuell. Die aktuelle Ausgabe kann als LHA-Archiv geladen
  werden. Zu finden ist dort auch ein Archiv mit &auml;lteren Ausgaben.
</LI>
<BR><LI> Aus dem Aminet: Im Verzeichnis docs/mags befinden sich fast alle Ausgaben
  von AMIGA aktuell. Auch die aktuelle Ausgabe wird so schnell wie m&ouml;glich
  auf den Aminet-Server geladen.
</LI>
</UL>
<P>
Unter der AMIGA-aktuell-Rubrik &quot;Intern/Distribution&quot; k&ouml;nnen weitere
Bezugsquellen, aber auch Informationen zum Abonnement gefunden werden.
</P>
<H3>2. Fragen zum Artikelschreiben</H3>
<P>
<B>F: Ich m&ouml;chte einen Artikel schreiben. Mu&szlig; ich daf&uuml;r HTML oder AmigaGuide
beherrschen?</B>
</P>
<P>
A: Nein. Wenn du einen Artikel schreibst, sollte der Text im ASCII-Format
vorliegen. Die Konvertierung des Textes &uuml;bernehmen flei&szlig;ige Mitarbeiter von
AMIGA aktuell. Wenn Du diesen Mitarbeitern das Leben etwas leichter machen
m&ouml;chtest, kannst du darauf achten, da&szlig; die Zeilenl&auml;nge nicht mehr als 75
Zeichen betr&auml;gt. Noch besser w&auml;re es, wenn sich jeder Absatz in nur einer
Zeile befindet (also unbegrenzte Anzahl Zeichen pro Zeile und Absatz). Wenn
Du mit dem Artikel fertig bist, &uuml;berpr&uuml;fe bitte noch mal die
Rechtschreibung. Mach am besten vorher einen Tag &quot;Pause&quot; und lies Dir den
Text dann noch mal durch oder frag jemanden aus Deinem Bekannten-
/Verwandtenkreis, ob derjenige den Text noch mal &uuml;berpr&uuml;fen w&uuml;rde. Meisten
lassen sich auf diese Weise immer noch einige Fehler finden. Artikel werden
selbstverst&auml;ndlich auch noch mal von Carsten Schr&ouml;der und/oder den
&Uuml;bersetzern Korrektur gelesen.
</P>
<P>
<B>F: Mu&szlig;/Kann ich meine Texte f&uuml;r die internationale Ausgabe in Englisch
verfassen/&uuml;bersetzen?</B>
</P>
<P>
A: Das AMIGA aktuell-Team besteht unter anderem aus mehreren flei&szlig;igen
&Uuml;bersetzern. Wenn Du Dir allerdings die &Uuml;bersetzung des Textes selbst
zutraust, kannst Du das nat&uuml;rlich machen. Wir w&uuml;rden uns &uuml;ber die
Arbeitserleichterung jedenfalls sehr freuen. Die &Uuml;bersetzung ist aber
keinesfalls Pflicht.
</P>
<P>
<B>F: Ich m&ouml;chte meinen Artikel mit einigen Grafiken veranschaulichen.
In welchem Format soll ich die Grafiken abspeichern?</B>
</P>
<P>
A: Grafiken im High- und Truecolor-Format (15/16/24bit) m&uuml;ssen im JPEG-
Format vorliegen. Die Qualit&auml;t sollte auf 75-80 Prozent verringert werden.
Andere Grafiken (&lt;=8bit) m&uuml;ssen im PNG-Format gespeichert werden. Die
Aufl&ouml;sung der Grafiken sollte nicht mehr als 800x600 Pixel betragen. Die
Dateinamen der Grafiken sollten, mit R&uuml;cksicht auf englischsprachige Leser,
englische Bezeichnungen erhalten. Zum Beispiel nicht &quot;voreinsteller.jpg&quot;
sondern &quot;settings.jpg&quot; oder &quot;preferences.jpg&quot;. Werden mehrere Screenshots
verwendet sollten diese in der entsprechenden Reihenfolge durchnummeriert
werden (z.B. ArtEffekt1.jpg, ArtEffekt2.png, etc.).
</P>
<P><B>F: Gibt es zus&auml;tzliche Dinge zu beachten?</B></P>
<P>
A: Ja. Werden Screenshots im Text verwendet, sollten diese nach M&ouml;glichkeit
von der englischen Version der Software gemacht werden. Handelt es sich bei
dem Programm um Shareware oder kommerzielle Software sind zus&auml;tzliche
Preisangaben in Euro und/oder in DM und/oder US-Dollar anzugeben. Au&szlig;erdem
sollte, falls bekannt, eine europ&auml;ische und/oder deutsche Bezugsquelle
angegeben werden.
</P>
<H3>3. Fragen zum Abonnement</H3>
<P>
<B>F: Ist es m&ouml;glich, die AMIGA-aktuell-Specials zu abonnieren ohne das Magazin
zu beziehen?</B>
</P>
<P>
A: Nein. Die Verteilerliste f&uuml;r das Magazin und die Specials wird nicht
getrennt gef&uuml;hrt. Betrachte die AMIGA-aktuell-Specials als eine Art Bonus.
</P>
<P>
<B>F: Ich w&uuml;rde gerne die AmigaGuide-Version und die HTML-Version abonnieren.
Die AmigaGuide-Ausgabe landet fr&uuml;her in meinem Postfach aber die HTML-
Ausgabe l&auml;&szlig;t sich angenehmer bzw. auch auf meinem PC lesen. Wenn ich jetzt
beide Ausgaben abonniere, ist es m&ouml;glich, die Grafiken nur einmal zu
bekommen?</B>
</P>
<P>
A: Ja, die Grafiken werden nur einmal verschickt. Es sollte aber folgendes
beachtet werden: Wenn beide Ausgaben (HTML und AmigaGuide) abonniert
wurden, werden dir auch immer die Specials doppelt geschickt.
</P>
<P>
<B>F: Mein E-Mail-Programm hat Probleme beim Dekodieren des AMIGA-aktuell-Archivs.
Woran liegt das?</B>
</P>
<P>
A: Du verwendest ein &auml;lteres E-Mail-Programm, das nicht mit &quot;base64&quot;-
kodierten Daten klar kommt. Besorg Dir eine neuere Version oder verwende
ein anderes E-Mail-Programm. Wenn Du das nicht m&ouml;chtest, kannst du im
Aminet auch sehr viele Tools finden, die diese &quot;base64&quot;-kodierten Daten
dekodieren k&ouml;nnen.
</P>
<P>
<B>F: Aber warum wird kein Amiga-Format zum Kodieren des AMIGA-aktuell-Archivs
verwendet?</B>
</P>
<P>
A: Es gibt kein Amiga-Format f&uuml;r diese Art der kodierten Daten (genauso
wenig wie es ein PC- oder Macintosh-Format daf&uuml;r gibt). Es ist eine Frage
der Aktualit&auml;t deines verwendeten E-Mail-Programms. Jedes neuere (Amiga-)
E-Mail-Programm kann E-Mails im &quot;base64&quot;-Format dekodieren. Wende dich bei
solchen Problemen lieber an den Autor.
</P>
<P>
<B>F: Ich habe auf meinem PC keinen LhA-Entpacker. Gibt es die AMIGA-aktuell-Archive
auch ZIP-komprimiert?</B>
</P>
<P>
A: Bislang nicht, da LhA das Standard-Amiga-Komprimierungsformat ist.
Allerdings gibt es auch f&uuml;r Windows diverse LhA-Entpacker, unter anderem
auch im Aminet.
</P>
<H3>4. Sonstige Fragen</H3>
<P>
<B>F: Ich habe mir gerade AMIGA aktuell geladen, bekomme aber keine Grafiken angezeigt.
Was mache ich falsch?</B>
</P>
<P>
A: AMIGA aktuell wird als AmigaGuide- und als HTML-Ausgabe ver&ouml;ffentlicht.
Je nachdem, um welche Version es sich handelt, sind folgende Dinge zu
beachten:
</P>
<P><B>AmigaGuide-Ausgabe:</B></P>
<P>
Du ben&ouml;tigst einen PNG- und einen JPEG-Datatype. Erst seit AmigaOS 3.5 wird
ein JPEG-Datatype mitgeliefert (aber kein Datatype f&uuml;r PNG-Grafiken).
Besorge dir einen Datatype aus dem Aminet (z.B. WarpPNG). Es ist au&szlig;erdem
zu beachten, da&szlig; sich die Grafiken im selben Verzeichnis wie das
AmigaGuide-Dokument befinden m&uuml;ssen.
</P>
<P>
Besitzer des Magic-Packs, das zusammen mit einem Amiga von Escom gekauft
werden konnte, k&ouml;nnen auch den JPEG-Datatype aus der &quot;Personal Paint V6.4&quot;-
Distribution verwenden. Dieser befindet sich auf der &quot;Personal Paint
Datendiskette&quot; in der Schublade &quot;JPEG&quot;.
</P>
<P><B>HTML-Ausgabe:</B></P>
<P>
Moderne Amiga-Webbrowser k&ouml;nnen das PNG- und JPEG-Format bei korrekter
Installation problemlos anzeigen. Falls nicht, kann es sein, da&szlig; f&uuml;r die
Grafik-Anzeige auf Datatypes zur&uuml;ckgegriffen wird. In dem Fall gilt das
gleiche wie f&uuml;r die AmigaGuide-Ausgabe. Die Grafiken m&uuml;ssen sich au&szlig;erdem
im Unterverzeichnis &quot;img&quot; befinden.
</P>
<P>
Als Beispiel die deutsche AMIGA-aktuell-Ausgabe 0101 (Januar 2001):
Die Grafiken m&uuml;ssen nach &quot;deutsch/Ausgabe0101/img/&quot; kopiert werden.
F&uuml;r die internationale AMIGA-aktuell-Ausgabe 1200 (Dezember 2000) m&uuml;ssen
die Grafiken nach &quot;international/edition1200/img/&quot; kopiert werden.
</P>
<P>
<B>F: Nanu, das FAQ ist ja schon zu Ende? Ich habe noch eine wichtige Frage,
die leider nicht beantwortet wurde. Wen kann ich deswegen fragen?</B>
</P>
<P>
A: Schicke eine Mail an mich (<A HREF="mailto:christian@aakt.de">christian@aakt.de</A>) oder Carsten Schr&ouml;der
(<A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A>).
</P>
<P ALIGN="RIGHT">
<A HREF="Intern1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Intern3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
