<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses7.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
Was wir brauchen, ist ein Zeichen (von Carsten Schr&ouml;der)
</P>
<P>
Mitte/Ende September wird in K&ouml;ln eine Amiga-Messe abgehalten werden,
faktisch handelt es sich jedoch leider nur um einen (kleinen) Amiga-Bereich
auf einer (gro&szlig;en) Macintosh-Veranstaltung. Wenige Tage sp&auml;ter ist bekannt
geworden, dass die Amiga Plus, das einzige deutschsprachige Amiga-Print-Magazin,
das bislang noch &uuml;ber den Zeitschriftenhandel vertrieben wurde, in
K&uuml;rze nur noch per Abonnement erh&auml;ltlich sein wird.
</P>
<P>
Diese Ereignisse zeigen uns leider auf drastische Weise, dass der Amiga-Markt
mittlerweile dort angekommen ist, wo der Atari schon l&auml;nger sein
trauriges Dasein fristet - am Rande der absoluten Bedeutungslosigkeit.
</P>
<P>
In der Hoffnung auf einen Amiga-Nachfolger konnten wir fr&uuml;her mit dem
wichtigen strategischen Vorteil einer relativ gro&szlig;en Zahl an Anwendern,
Entwicklern und H&auml;ndlern aufwarten - dies h&auml;tte die Verbreitung eines neuen
Amiga wesentlich f&ouml;rdern k&ouml;nnen. Doch mittlerweile ist davon praktisch
nichts mehr &uuml;brig:
</P>
<UL>
<LI> Die Zahl der User ist, wie wir erkennen m&uuml;ssen, nicht einmal mehr gro&szlig;
  genug, um eine Zeitschrift gewinnbringend &uuml;ber den Handel vertreiben oder
  effektiv eine eigenst&auml;ndige Amiga-Messe veranstalten zu k&ouml;nnen.
</LI>
<BR><LI> Es erscheinen kaum noch neue Programme bzw. Softwareversionen, und wenn
  doch, dann k&ouml;nnen sie in aller Regel bei weitem nicht mit den Vertretern
  anderer Betriebssysteme mithalten - als Beispiele seien nur die Amiga-WWW-Browser
  und -Textverarbeitungen genannt, die ihren PC-Kollegen jeweils
  meilenweit hinterherhinken - und der Abstand vergr&ouml;&szlig;ert sich immer mehr.
</LI>
<BR><LI> Auch ist ein fl&auml;chendeckendes Netz von Amiga-Fachh&auml;ndlern l&auml;ngst nicht
  mehr vorhanden - mittlerweile d&uuml;rften h&ouml;chstens noch 20 Prozent der
  Anwender einen H&auml;ndler in ihrem n&auml;heren Umkreis finden.
</LI>
</UL>
<P>
Was ich damit deutlich machen will: Der Vorteil, den AMIGA fr&uuml;her gegen&uuml;ber
seinen Konkurrenten, wie etwa Be und QNX, hatte, eine existente
Infrastruktur n&auml;mlich, ist mittlerweile so gut wie nicht mehr gegeben.
Damit liegt es nun allein in der Hand des Unternehmens, einen Amiga-Nachfolger
am Markt zu etablieren und die daf&uuml;r notwendigen Strukturen, zum
Beispiel auf dem Gebiet der Distribution, aufzubauen.
</P>
<P>
Leider ist die derzeitige Amiga-F&uuml;hrung nicht v&ouml;llig schuldlos an der
Misere. Gewiss, der Niedergang des Amiga ist ganz &uuml;berwiegend vor dem Jahr
2000 erfolgt - er hat sich jedoch in den letzten anderthalb Jahren eher
noch beschleunigt. Dies d&uuml;rfte vor allem in der immer noch nicht klaren
Strategie und der leider ohne &Uuml;bertreibung vollkommen inakzeptablen
Informationspolitik AMIGAs seine Ursache finden. Und darin liegt auch der
Schl&uuml;ssel f&uuml;r eine m&ouml;gliche Besserung der Lage in der Zukunft. Auf der
kommenden K&ouml;lner Messe muss AMIGA ein Zeichen setzen:
</P>
<P>
Die &Ouml;ffentlichkeitsarbeit muss vollkommen umgekrempelt werden. Das
Unternehmen muss klipp und klar sagen, welche Strategie es verfolgt und
wann welche AmigaDE-Versionen mit welchen Features und f&uuml;r welche
Betriebssysteme auf den Markt kommen werden. Es muss sichtbar werden, dass
die Entwicklung von Desktop-Versionen des AmigaDE Fortschritte macht und
es sich bei der Software um mehr als nur eine Multimedia-Erweiterung f&uuml;r
Betriebssysteme handelt.
</P>
<P>
An diesen Worten ist das Unternehmen dann zu messen. Sollte AMIGAs Kurs
weiterhin keine klare Linie aufweisen oder aber in K&ouml;ln bekanntgegebene
Ank&uuml;ndigungen bzw. Zeitpl&auml;ne nicht eingehalten werden, dann hat das
Unternehmen - leider zurecht - jeden Kredit verspielt - ganz davon
abgesehen, dass der Amiga in diesem Fall wohl endg&uuml;ltig nicht mehr zu
retten ist.
</P>
<P><B>Damit bis zum n&auml;chsten Monat,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses7.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
