<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele8.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>7. Review: Slot-Machine-Simulation &raquo;Cheatmania&laquo; (von Sebastian Rosa)</H2>
<P>
Cheatmania ist ein hei&szlig;es Teil f&uuml;r Zocker (und nicht nur f&uuml;r die). Wenn du
es dir nicht leisten kannst, nach Las Vegas zu reisen oder einfach nur
Angst hast, in ein Casino zu gehen, weil du dort verlieren k&ouml;nntest (wer
wei&szlig;, vielleicht gewinnst du ja auch), dann ist es Zeit mal deine
Spielerqualit&auml;ten an diesem Spiel zu testen.
</P>
<P>
Cheatmania ist vergleichbar mit Monster Mind oder dem demn&auml;chst
erscheinenden Poker Challenge, eines dieser - in der Theorie - simplen
Spiele von Stylon Crew. Stylon Crew ist ein Team von Szenenmitgliedern.
Programm/Code wurde von Twyster geschrieben, niedliche 256 Farben-Bilder
von Mitgliedern der Gruppen Scoopex, TRSI, Kefrens und von Einzelg&auml;ngern
wie Made und Hotshot. Allem wurde ein sch&ouml;ner atmosph&auml;rischer Sound gegeben
der von XTD und Odie komponiert wurde.
</P>
<P>
Gro&szlig;artige Mischung, oder? Aber worum geht es eigentlich in dem Spiel?
</P>
<P>
Cheatmania ist ein Simulator eines einarmigen Banditen im Horror-Style.
W&auml;hrend einer Reise mu&szlig; dein Wagen repariert werden. Es regnet, st&uuml;rmt und
nur die Blitze erhellen die Umgebung. W&auml;hrend eines Blitzes siehst Du das
Schlo&szlig; und beschlie&szlig;t dorthin zu gehen. Soweit zur Standard-
Hintergrundgeschichte.
</P>
<P>
<A HREF="img/cheatmania1.jpg"><IMG SRC="thumb/cheatmania1.jpg" WIDTH="120" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Unser einarmiger Bandit ist etwas ungew&ouml;hnlicher als andere. Auf den Walzen
sind anstatt der sonst &uuml;blichen Fr&uuml;chte wie Pflaumen, Bananen, Kirschen,
&Auml;pfel oder andere Bilder, welche daf&uuml;r sorgen, dass wir den Gewinn erkennen
sondern: Spinnen, Biester, Sch&auml;del, Pentagramme oder Jack'o'Lanterns. Es
gibt vier Walzen, nicht drei, so erm&ouml;glicht es mehr Variationen und weniger
Chancen zu gewinnen. Du mu&szlig;t drei oder vier gleiche Symbole gleichzeitig
haben. Sehr wichtig ist dein Einsatz. Wenn Du ihn erh&ouml;hst (so auf 10$),
dann erh&ouml;hst Du auch die Gewinnchancen und wir k&ouml;nnen unser Gl&uuml;ck in einem
der vielen Bonusspiele versuchen.
</P>
<P>
Ja! Cheatmania ist nicht einfach nur am Hebel ziehen, um neue Drehungen der
Walzen zu starten sondern man spielt auch Bonusspiele wie K&auml;fer schie&szlig;en,
Symbole fangen, raten wo der Kristall ist und so weiter. Die Menge der
Bonusspiele h&auml;ngt vom Einsatz ab. F&uuml;r nur 3$ bekommen wir den Biest-Mode,
f&uuml;r 5$ den Scull-Mode, f&uuml;r 7$ den Cash-Mode und f&uuml;r das Maximum von 10$ den
Jackpot-Mode. Jeder Modus erm&ouml;glicht spezielle Spiele.
</P>
<P>
<A HREF="img/cheatmania2.jpg"><IMG SRC="thumb/cheatmania2.jpg" WIDTH="120" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Das ist noch nicht das Ende. Wenn wir etwas gewinnen, k&ouml;nnen wir unseren
Gewinn sechsmal verdoppeln. Hier m&uuml;ssen wir beweisen, wie schnell wir sind.
Webn wir bei sechsmal verdoppeln sind, bekommen wir ein neues Bonusspiel,
das auch zu bekommen ist, wenn wir die Zahl des Teufels -666- erwischen.
</P>
<P>
Fassen wir zusammen: Es gibt 11 Spiele. Jedes hat viele M&ouml;glichkeiten,
abh&auml;ngig von den Symbolen auf den Walzen. Wenn wir die sechs speziellen
Bonusspiele zurechnen, kommen wir zu dem Ergebnis, dass Cheatmania
interessant ist und beim Spieler keine Langeweile aufkommen kann.
</P>
<P>
Und wir sind immer noch nicht am Ende. Der Autor dachte sich, da&szlig; nur
spielen, um zu spielen, weder sch&ouml;n noch unterhaltsam ist. Cheatmania l&auml;&szlig;t
uns unseren Gewinn investieren. F&uuml;r 50$ bekommen wir die M&ouml;glichkeit,
unsere F&auml;higkeiten in einem der Bonusspiele zu verbessern. F&uuml;r 150$ k&ouml;nnen
wir die Galerie betreten und eines der vielen Bilder kaufen. Bilder aus dem
Spiel, alle in dem Horrorstil gehalten, und ich mag sie. Es gibt ungef&auml;hr
40 von ihnen. Die M&ouml;glichkeit, diese Bilder auf Disk zu speichern ist f&uuml;r
uns eine Art Belohnung. Sie sind im IFF-Format und k&ouml;nnen so unserer
Sammlung hinzugef&uuml;gt werden. Ich finde, das ist eine gute Idee. Da wei&szlig;
man, wof&uuml;r man spielt.
</P>
<P>
<A HREF="img/cheatmania3.jpg"><IMG SRC="thumb/cheatmania3.jpg" WIDTH="120" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Wie Ihr seht, ist Cheatmania nicht einfach nur ein Gl&uuml;cksspiel, sondern man
ben&ouml;tigt auch F&auml;higkeiten wie Schnelligkeit oder &auml;hnliches. Es gibt dir die
Chance, den Gewinn einzustreichen, und es hat auch einen tieferen Sinn (die
Bilder).
</P>
<P>
Cheatmania ist ein sehr sch&ouml;nes Spiel. Es ist Beispiel daf&uuml;r, wie man aus
einem simplen Spiel ein interessantes Spiel mit gro&szlig;artigen audiovisuellen
Effekten machen kann. Cheatmania ben&ouml;tigt mindestens den AGA-Chipsatz, mehr
als 1.7 MB freies Chipram und 3 MB Fast-RAM. Bevor wir das Spiel starten,
m&uuml;ssen wir noch einen Speicherpfad f&uuml;r die Bilder angeben. Cheatmania kann
man beim Autor oder im Aminet bekommen. Es ist Freeware.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name:&nbsp;</TD><TD VALIGN="TOP">Cheatmania&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Autor:&nbsp;</TD><TD VALIGN="TOP">Stylon Crew (O.H. Kohler)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">10 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sound:&nbsp;</TD><TD VALIGN="TOP">10 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Handhabung:&nbsp;</TD><TD VALIGN="TOP">9 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spa&szlig;:&nbsp;</TD><TD VALIGN="TOP">10 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Sebastian &quot;Mailman&quot; Rosa &lt;<A HREF="mailto:sebastian.rosa@wp.pl">sebastian.rosa@wp.pl</A>&gt;</B></P>
<P><B>Deutsche &Uuml;bersetzung: Thomas &quot;Gojira&quot; Nosutta (<A HREF="http://acbb.de" TARGET="_top">http://acbb.de</A>)</B></P>
<P>
Nachtrag von Christian Aichinger:
Das Archiv ist ca. 13 MB gro&szlig;. Also schon mal die Kaffeemaschine
fertigmachen ;).
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele8.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
