<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele7.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>6. PD-Spieletests</H2>
<P>
Heute geh ich lieber gleich zur Sache. Hat sich mal wieder nicht viel
getan, n&auml;chsten Monat gibt's daf&uuml;r Tests von der Amiga Arena. Jo, jo...
</P>
<P><B>Diesmal im Programm:</B></P>
<UL>
<LI> Stratoscuro
</LI>
<BR><LI> LegoBlast
</LI>
</UL>
<PRE>
-----------------
---Stratoscuro---
-----------------
</PRE>
<P>
Regeln sind da, um gebrochen zu werden. Nicht nur RTL II, auch das
Entwicklerteam von &quot;On the dole&quot; haben sich dies anscheinend zum
Werbeslogan gemacht. Doch w&auml;hrend RTL II nur alle Regeln (oder besser
Grenzen) des schlechten Geschmacks bricht, brachen &quot;On the dole&quot; die Regel,
dass das Gute immer gewinnt. Bei Stratoscuro spielt man n&auml;mlich die
b&ouml;sen, b&ouml;sen Au&szlig;erirdischen, die versuchen, die Erde zu erobern.
</P>
<P>
Hierzu stellen sie dem Spieler einen Kampfroboter zur Verf&uuml;gung, der einem
gewissen Power-Ranger-Mega-Super-Duper-Zord nicht un&auml;hnlich sieht.
Mit diesem Unget&uuml;m wird einem vor jedem Level eine Aufgabe gegeben, die
irgendwie immer was mit Zerst&ouml;ren zu tun hat. Um diese Aufgabe zu
erledigen, steht einem standardm&auml;&szlig;ig eine miese Phaserwaffe zur Verf&uuml;gung,
diese l&auml;sst sich jedoch durch Extras, die man in den Levels findet,
aufr&uuml;sten.
</P>
<P>
Das Aufr&uuml;sten wirkt sich jedoch leider nur auf die Schusskraft aus, nicht
auf die Schnelligkeit der Waffe. Das ist schlecht, da sich die Menschen
sowieso schon kaum treffen lassen und auch recht schnell unterwegs sind.
Auch unpraktisch ist die Grafik. Das Spiel wird in einer Isometrischen
3D-Perspektive dargestellt, das Scrolling des Screens setzt jedoch erst
ein, wenn man fast ganz an den Rand des Bildschirms l&auml;uft, was zur Folge
hat, dass man Gegner erst sieht, wenn sie bereits auf einen Geschossen
haben.
</P>
<P>
Ansonsten ist die Grafik aber sehr sch&ouml;n geworden, besonders die
vorgerenderte Spielfigur ist gelungen.
</P>
<P>
Auch soundm&auml;&szlig;ig wird einiges Geboten, neben Samples, die von Desert Strike
geklaut sind, ein Haufen Hintergrundlieder.
</P>
<P>
Alles im allen jedoch nur mittelm&auml;&szlig;ige Ware, da das Game unspielbar schwer,
oder besser gesagt unfair, ist. Wer Lust auf Hardocre hat, kann es sich ja
runterladen...
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name:&nbsp;</TD><TD VALIGN="TOP">Stratoscuro&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Author:&nbsp;</TD><TD VALIGN="TOP">On the dole&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">7 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sound:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Steuerung:&nbsp;</TD><TD VALIGN="TOP">6 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spielspa&szlig;:&nbsp;</TD><TD VALIGN="TOP">5 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Subjektiver Gesamteindruck des Redakteurs: 6 von 10 Punkten</B></P>
<PRE>
---------------
---LegoBlast---
---------------
</PRE>
<P>
Ja, ein erneuter Clone des Kultgames Dynablaster. Da dies nicht gerade das
neueste Spielprinzip ist, und ich beim letzten Dynablaster-Clone-Test vom
Programmierer ordentlich eins auf die M&uuml;tze bekommen hab, fass ich mich
lieber kurz.
</P>
<P>
LegoBlast ist sehr an Super Bomberman (SNES) angelehnt, beinhaltet aber
keinen Einzelspielermodus, nur Multiplayer. Das ist nicht weiter schlimm,
da der Einzelspielermodus bei allen Dynablastern eher mittelm&auml;&szlig;ig war.
An Extras gibt es aber wieder die volle Ladung: mehr Sprengkraft, mehr
Bomben gleichzeitig, Unverwundbarkeit, Schnelligkeit und viele andere.
Grafisch und soundtechnisch wird nicht viel neues geboten, was in
Anbetracht der Vorg&auml;nger auf keinen Fall negativ aufzufassen ist.
</P>
<P>
Insgesamt gesehen ein ordentliches St&uuml;ck Software, aber nichts neues.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name:&nbsp;</TD><TD VALIGN="TOP">LegoBlast&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Author:&nbsp;</TD><TD VALIGN="TOP">Proxima&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sound:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Steuerung:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spielspa&szlig;:&nbsp;</TD><TD VALIGN="TOP">7 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Subjektiver Gesamteindruck des Redakteurs: 7 von 10 Punkten</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele7.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
