<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Der Zwischenruf
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Der Zwischenruf (von Ralf Driesner)</H1>
<P><B>Kaffee und Glasreiniger</B></P>
<P>
Morgens ist die Welt noch in Ordnung. Das hab ich mal irgendwo gelesen.
Meistens ist es ja auch so. Und wenn die Sonne schon morgens so richtig
sch&ouml;n scheint, sollte es sogar fast nicht auffallen wenn mal wieder die
Kondensmilch f&uuml;r den Kaffee ausgegangen ist. Nur die ungeputzten
Fensterscheiben &auml;rgern mich ein bisschen; weil die ja den &quot;ungetr&uuml;bten&quot;
Genuss des Sonnenscheins ein wenig d&auml;mpfen. Der Entschluss ist gefasst: die
Fenster werden mal wieder geputzt.
</P>
<P>
Eine Situation, wie sie uns t&auml;glich begegnet. Etwas st&ouml;rt, also wird es
beseitigt. Jedenfalls solange uns nicht jemand anderes Kn&uuml;ppel zwischen die
Beine wirft (und zum Beispiel den Glasreiniger versteckt!?).
</P>
<P>
Jedoch st&ouml;ren mich in letzter Zeit auffallend viele Sachen. Egal in welcher
Richtung. Der notwendige Wandel in technischer wie gesellschaftlicher
Hinsicht hakt an allen Ecken und Enden.
</P>
<P>
Ob das nun darauf zur&uuml;ckzuf&uuml;hren ist, dass k&uuml;rzlich Dennis Tito einen
kleinen Ausflug zur ISS gemacht hat oder ich einmal zu oft den Film
&quot;Mission to Mars&quot; gesehen habe lasse ich mal als Fragezeichen bestehen.
</P>
<P>
Die Unruhe in mir w&auml;chst. Verpasse ich oder der Rest der Menschheit etwas?
Die Technikwandel vollzieht sich (theoretisch) recht schnell. Aber der
Einsatz der Mittel krankt.
</P>
<P>
Dabei wurden durch das Ende des kalten Krieges so gro&szlig;e Hoffnungen
gesch&uuml;rt. Ein gro&szlig;er Knoten schien gel&ouml;st zu sein. Die M&ouml;glichkeit, sich
jetzt endlich um die wirklich wichtigen Probleme der Menschheit zu k&uuml;mmern,
schien endlich da zu sein. Dem politischen Wandel folgte der
gesellschaftliche und der technische.
</P>
<P>
Aber trotzdem bin ich unzufrieden. Nicht nur das in einigen Regionen der
Erde wieder Kriege auszubrechen drohen bzw. w&uuml;ten, die Umweltverschmutzung
munter weitergeht und der Hunger und das Leid ganzer V&ouml;lker das Gewissen
der Menschheit beschatten. Auch ist der Ton im eigenen Land wieder anders
geworden. Hat sich zuerst das Volk bejammert und hat seine Schelte von der
Politik und der Wirtschaft bekommen, so jammert jetzt die Politik und die
Wirtschaft und versteht so gar nicht, wieso die jeweilige Message nicht
ankommt.
</P>
<P>
Die Presse verr&auml;t mir, dass dies ein globales Ph&auml;nomen ist. Und scheinbar
kennt niemand den Ausweg aus diesem Dilemma.
</P>
<P>
Mein pers&ouml;nlicher Rat an die ganze Menschheit: Wir haben eine gigantische
dreckige Fensterscheibe vor unserer Nase. Es wird Zeit, dass wir die mal
richtig sauber machen. Vielleicht sehen wir dann alle einen wundersch&ouml;nen
Sonnenaufgang und &auml;rgern uns dann nicht mal mehr dar&uuml;ber, dass wir wieder
vergessen haben Kondensmilch einzukaufen.
</P>
<P>
Wer jetzt fragt, wie das alles zum Amiga passt .... keine Ahnung.
</P>
<P>
Vielleicht f&auml;llt mir bis zum n&auml;chsten Zwischenruf was ein. Vorschl&auml;ge nehme
ich gerne entgegen!!
</P>
<P><B>Lebt lang und erfolgreich</B></P>
<P><B>Euer</B></P>
<P><B>Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
