<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Dynaaminen HTML&nbsp;k&auml;yt&auml;nn&ouml;ss&auml;</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">&quot;Tohtori AivoTurmio&quot;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Olet opetellut HTML-kielen, ja nyt kiinnostaisi oppia sit&auml; lis&auml;&auml;. Yksi vaihtoehto on kirja nimelt&auml; &quot;Dynaaminen HTML k&auml;yt&auml;nn&ouml;ss&auml;&quot;. Paginan kirjoissa on hyvin keksitty laittaa jo kanteen nelj&auml; eri vaihtoehtoa kohderyhmiksi: aloittelija, perusk&auml;ytt&auml;j&auml;, kokenut k&auml;ytt&auml;j&auml;, ammattilainen. T&auml;m&auml;n kirjan kannessa on valittu kohderyhmiksi perusk&auml;ytt&auml;j&auml; ja kokenut k&auml;ytt&auml;j&auml;.
						<p>Kirjan ideana on opettaa CSS-, XML- ja DOM-kielien k&auml;ytt&ouml;&auml;. Ohjelmaesimerkit on tehty JavaScriptill&auml;, joten jos et JavaScripti&auml; tai muuten C-kielen kaltaisia ohjelmointikieli&auml; hallitse, niin t&auml;t&auml; tuskin kannattaa alkaa lukea.</p>
						<p>Kielist&auml; opetetaan vain muutamia juttuja, jotka kirjan kirjoittajat ovat kuvitelleet lukijaa kiinnostavan. Itse asiassa koko kirja on kirjoitettu siten, ett&auml; kannattaa ensin opetella CSS jostain muusta kirjasta ja sitten vain lukea t&auml;m&auml; kirja sen j&auml;lkeen muistin virkist&auml;miseksi ja sen vuoksi, ett&auml; t&auml;ss&auml; kerrotaan muutama erikoisasia, jotka luultavasti puuttuvat monista muista kirjoista.</p>
						<p>Min&auml;&auml;n opetuskirjana t&auml;m&auml; ei mielest&auml;ni toimi, mutta hyv&auml;n&auml; pikakatsauksena eri HTML-lis&auml;jutuista kyll&auml;kin. Toinen haitta kirjassa on ajankohtaisuus, sill&auml; kolmen vuoden p&auml;&auml;st&auml; t&auml;st&auml; kirjasta ei ole muuhun kuin nuotion sytykkeeksi, koska asiat ovat vanhentuneita. Kirjaa sent&auml;&auml;n hieman pelastaa lopusta l&ouml;ytyv&auml;t kohtalaiset liitteet.</p>
						<p>Liite A: Viitteet. T&auml;st&auml; l&ouml;ytyy kirjassa mainittujen paikkojen osoitteet ja lis&auml;&auml; paikkoja joissa kannattaa k&auml;yd&auml;, jos on nettisivujen teosta kiinnostunut. Ihan sopivanlainen m&auml;&auml;r&auml; paikkoja on liitteess&auml; mainittu, ja lis&auml;ksi alkuun on laitettu parhaat ja kerrottu, mink&auml;laiseen tarkoitukseen paikka sopii.</p>
						<p>Liite B: N&auml;in k&auml;yt&auml;t nsgmls:&auml;&auml;. Amigisti ei t&auml;ll&auml; liitteell&auml; tee yht&auml;&auml;n mit&auml;&auml;n, sill&auml; t&auml;m&auml; oli jokin PC:n ohjelma jonka toiminnasta neuvottiin, joten hypp&auml;sin yli.</p>
						<p>Liite C: V&auml;rit. Kokeneemmalle t&auml;m&auml; on l&auml;hes turha, mutta jollekin aloittelevalle ihan hyv&auml; muistilappu, jossa kerrotaan eri v&auml;rit jotka on sanoin m&auml;&auml;ritelty HTML:ss&auml; sek&auml; niiden heksamerkint&auml;.</p>
						<p>Liite D: Esimerkki tyyliarkista. Esimerkkiohjelma olisi muuten ihan mukava, mutta kun siin&auml; k&auml;ytet&auml;&auml;n koodia, jota yksik&auml;&auml;n selain ei viel&auml; t&auml;h&auml;n menness&auml; t&auml;ysin tue. Esimerkki on loppujen lopuksi yht&auml; tyhj&auml;n kanssa, sill&auml; voihan koodin seassa olla jokin virhekin, kun sit&auml; ei kerran pystytty tarkistamaan k&auml;yt&auml;nn&ouml;ss&auml;.</p>
						<p>Lyhyesti kirjasta voisi sanoa, ett&auml; lue, jos et muuta saa ja aihe kiinnostaa. L&auml;mpim&auml;sti t&auml;t&auml; kirjaa en suosittele kenellek&auml;&auml;n.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Kirjoittajat:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Jesper Ek ja Karl-Johan Noren</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Julkaisija:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.pagina.fi" target="_blank">Kustannus Oy Pagina</a>, puh. (09) 887 0400, <a href="mailto:pagina@pagina.fi">pagina@pagina.fi</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">250 mk</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Painos:</font></td>
					<td width="50%" bgcolor="#d8ecfd">1. painos, 1999, ISBN 951-50-1007-1</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Laajuus:</font></td>
					<td width="50%" bgcolor="#d8ecfd">n. 300 sivua, joista 26 liitesivuja</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
