<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Epic Encyclopedia of the Paranormal</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">&quot;Tohtori AivoTurmio&quot;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Encyclopedia tarkoittaa hakuteosta, eli Encyclopedia of the Paranormal on paranormaalien asioiden hakuteos CD:ll&auml;. Paranormal CD on jaettu seitsem&auml;&auml;n eri kategoriaan:
						<ul>
							<li>&quot;UFOs &amp; aliens&quot;: juuri ne pienet vihre&auml;t miehet l&ouml;ytyv&auml;t t&auml;&auml;lt&auml;.
							<li>&quot;Strangelife&quot;: oudot eli&ouml;muodot kuten Lumimies.
							<li>&quot;Ghosts &amp; spirits&quot;: haamujutut ja spiritismilauta l&ouml;ytyv&auml;t t&auml;&auml;lt&auml;.
							<li>&quot;Mind over matter&quot;: mieli voittaa materian -osasto, josta l&ouml;ytyy paljain jaloin tulella k&auml;velyt, telepatiat ja lusikoiden taivuttamiset
							<li>&quot;The unexplained&quot;: selitt&auml;m&auml;tt&ouml;miksi j&auml;&auml;neet asiat, kuten verta itkev&auml;t Neitsyt Mariat ja itsest&auml;&auml;n palamaan syttyneet ihmiset.
							<li>&quot;Myths and legends: myytit ja legendat, josta l&ouml;ytyy Kreikan jumalat ja V&auml;in&auml;m&ouml;isen hahmot.
							<li>&quot;Mysticism&quot;: mystiikka, johon siis kuuluu lohik&auml;&auml;rmeet sun muut.
						</ul>
						<p>Kuvia CD:lt&auml; l&ouml;ytyy runsaasti, ja onpa sill&auml; muutama AVI-videop&auml;tk&auml;kin. Muuten CD olisi erinomainen, mutta ensimm&auml;inen pienempi haitta on, ett&auml; aiheet eiv&auml;t ole aakkosj&auml;rjestyksess&auml;, mik&auml; vaikeuttaa asioiden l&ouml;yt&auml;mist&auml; huomattavasti. Toinen, suurempi haitta, joka pilaa CD:t&auml; todella paljon, on asian v&auml;hyys. Esimerkiksi Juri Gagarinista, josta on kirjoitettu varmastikin satoja kirjoja ja joka itsekin on tainnut kirjoittaa pari kirjaa, l&ouml;ytyy yksi kesken j&auml;&auml;v&auml; videop&auml;tk&auml;, yksi kuva ja kolme rivi&auml; teksti&auml;. Itse olisin halunnut tiet&auml;&auml; Juri Gagarinista enemm&auml;nkin, mutta t&auml;ll&auml; CD:ll&auml; en h&auml;nen ulkon&auml;k&ouml;&auml;&auml;n lukuun ottamatta paljon viisastunut.</p>
						<p>Kolmantena haittana on asioiden keskener&auml;isyys, esimerkkin&auml; &auml;sken mainittu Juri Gagarin -videop&auml;tk&auml;. Juri Gagarin istuu lentokoneessa CIA:n miesten kanssa ja selitt&auml;&auml;, kuinka h&auml;nen teht&auml;v&auml;n&auml;&auml;n on painaa nappia siin&auml; vaiheessa, kun ollaan h&auml;nen mielest&auml;&auml;n toisen lentokoneen onnettomuuspaikan yll&auml; ja lis&auml;ksi kertoa, onko kyse sabotaasista vai vahingosta. Mielenkiintoistahan tuo on, mutta viel&auml; mielenkiintoisempaa olisi ollut saada tiet&auml;&auml; my&ouml;s miten siin&auml; k&auml;vi, eli tiesik&ouml; Juri Gagarin paikan ja syyn oikein vai ei.</p>
						<p>Turhauttavaa on my&ouml;s juttujen kritiikitt&ouml;myys. Kerrotaan esimerkiksi merielukan ruumiista, joka oli saatu nostettua kalastusveneeseen mutta joka oli kuvien oton j&auml;lkeen pahan hajun vuoksi heitetty takaisin mereen - ja sitten ei kerrota ollenkaan, mik&auml; kyseisen elukan arvellaan olleen!</p>
						<p>CD:n paras anti on kuvissa, joita my&ouml;s todella riitt&auml;&auml;. Harmi vain, ettei Paranormal CD:ss&auml; ole tajuttu tehd&auml; samoin kuin Epic Interactive Encyclopedia 1998 CD:ss&auml; on tehty: slide showssa kuvia tulee summamutikassa. Paranormalissakin kyll&auml; on slide show, mutta kuvat tulevat aina samassa j&auml;rjestyksess&auml;.</p>
						<p>Jos asiatietoa etsit paranormaaleista asioista, niin t&auml;t&auml; romppua karta, mutta tuhansien kuvien, satojen samplejen ja monien videop&auml;tkien ansiosta on t&auml;m&auml; silti varsin mielenkiintoinen. Jos pid&auml;t CD-hakuteoksista ja paranormaaleista ilmi&ouml;ist&auml;, niin uskoisin ett&auml; pid&auml;t t&auml;st&auml;kin.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Julkaisija:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.epicmarketing.ltd.net" target="_blank">Epic Marketing Ltd.</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
					<td width="50%" bgcolor="#d8ecfd">AGA, CD-ROM</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Yleisarvosana:</font></td>
					<td width="50%" bgcolor="#d8ecfd">68%</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
