<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Paloma IV</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Timo Kemppaala &lt;<a href="mailto:apache@mbnet.fi">apache@mbnet.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<img height="55" width="150" src="kuvat/vtlogo.gif" alt=" ">
							<p><img height="60" width="220" src="kuvat/paloma_logo.gif" alt=" "></p>
						</center>
						<p>Paloma IV on TV-lis&auml;moduli Amigan Zorro-pohjaiseen Picasso IV -n&auml;ytt&ouml;korttiin. Paketissa oli kortin lis&auml;ksi samantapainen ohjevihkonen, joka Picasso IV:n mukanakin oli tullut. Vihkonen kertoi, miten asentaa kortti Picasson p&auml;&auml;lle. Paloma kytket&auml;&auml;n suoraan Picassoon, joten se ei vie yht&auml;&auml;n Zorro-paikkaa.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Panikointia asennuksessa</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Noudatin ohjeita ja asennus sujui hyvin. Paloman fyysinen asennus oli helppoa: kuin tunkisi levykkeen asemaan. Ensimm&auml;inen pahan olon aalto tosin iski, kun avasin antistaattisen pussin ja l&ouml;ysin kortin sielt&auml;. Kortin videoulostulon er&auml;s nasta oli v&auml;&auml;ntynyt, mutta &quot;tekniikan nerona&quot; p&auml;&auml;tin oikaista nastan ihan itse. Ongelmia ei syntynyt miss&auml;&auml;n.
						<center>
							<p><img height="106" width="200" src="kuvat/paloma.gif" alt=" "></p>
						</center>
						<p>Fyysisen asennuksen j&auml;lkeen tuli kauhistuttava ongelma. Olin aikaisemmin yritt&auml;nyt p&auml;ivitt&auml;&auml; Picasson firmwarea uudempaan versioon, mutta kone ei suostunut toimimaan sill&auml; versiolla, ellei Paloma olisi kiinni. Panikoiduin samoin kuin MultiFaceCard 3:n kanssa, joka hajosi ilmeisesti ROMin laukeamiseen, sill&auml; kone ei en&auml;&auml; l&ouml;yt&auml;nyt kortin &quot;MFC.resource&quot;-nimist&auml; toimintoa, jolla kortti tunnistetaan! (Wizor kaikessa neroudessaan on kuulemma saanut MFC3:n kuitenkin toimimaan, joten h&auml;n siit&auml; saakoon kortin palkinnoksi pit&auml;&auml;.)</p>
						<p>Sama toiminto puuttui Picassosta, enk&auml; pystynyt mitenk&auml;&auml;n asentamaan oikeita ajureita kortille, ennen kuin kokeilin tunkea vanhemman 7.1-revisionin asennuksen flashista kortille. Tietenk&auml;&auml;n kuvaa Picasso ei antanut Amiga-videollakaan, kun korttia ei &quot;ole&quot;, joten jouduin pist&auml;m&auml;&auml;n taas monitorin Amigan videoon kiinni. T&auml;m&auml; ei kuitenkaan ole haitaksi, jos jaksaa siirrell&auml; monitoria. Kortti ei halunnut ottaa vastaan mit&auml;&auml;n flasheja, mutta kun tarpeeksi tungin, niin kyll&auml; se sinne lopulta meni. Se ihmetytt&auml;&auml; minua - PC:ll&auml; moinen ei v&auml;ltt&auml;m&auml;tt&auml; onnistuisi. K&auml;ytin kortin mukana tullutta asennusohjelmaa, ja Picasso IV tunnistui normaalisti, eik&auml; ongelmia revisionista en&auml;&auml; ollut!</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Kanavia mets&auml;st&auml;m&auml;&auml;n</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Sitten p&auml;&auml;sinkin itse ohjelman kimppuun ja hakemaan kanavia RF-kaapelista. Kanavien hakeminen tuntui kest&auml;v&auml;n ja kest&auml;v&auml;n, ja ohjelma n&auml;ytti palkkia haun edistymisest&auml;. Kanavia l&ouml;ytyi itsell&auml;ni 60, joista osa ei ollut kunnollisia kanavia tai olivat salattuja.
						<p>Kuva Palomassa on ter&auml;v&auml;, ja kuvan saa halutessaan Workbenchin p&auml;&auml;lle tai omalle ruudulleen (800x600x24). Kuvaa n&auml;ytet&auml;&auml;n 24-bittisell&auml; resoluutiolla, my&ouml;s WB:n p&auml;&auml;ll&auml;. Olen kerran pari kokeillut katsoa telkkua 1600x1200x16-resoluutiossa, mutta kuva rakeilee jo silloin liian paljon, joten se ei kannata muutoin kuin elvistelytarkoituksessa. :) Kuvaa WB:n p&auml;&auml;ll&auml; katsellessa ei ratiolla sit&auml; korjata, jos ikkunan kokoa muutetaan, mik&auml; on huono juttu. Asiasta on varmaankin valitettu moneen otteeseen. Picassohan omaa t&auml;m&auml;n toiminnon kuitenkin, mutta miksei sit&auml; hy&ouml;dynnet&auml; muutoin kuin k&auml;ytt&auml;jien ohjelmissa?</p>
						<p>Palomassa on my&ouml;s S-VHS/CVBS-liit&auml;nn&auml;ll&auml; varustettu palikka, johon voi vaikka kiinnitt&auml;&auml; Playstationin tai videokameran tai jonkin muun laitteen, josta kuvaa tulee. Pablo IV -lis&auml;modulilla kuvan (800x600) saisi ulos televisioon, jossa voisi pelata vaikka Quakea Voodoo-1-kiihdyttimell&auml;, jahka se tulee. :) Periaatteessa kaikki 800x600:aan mahtuva softa n&auml;kyisi siis ihan normaalissa telkussa Picasson kautta, eli pelitkin n&auml;ytt&auml;isiv&auml;t isommilta. Minua kiinnostaa se siksi, ett&auml; Genetic Speciesi&auml; ja muita pelej&auml; olisi kiva pelata isolla ruudulla. My&ouml;s AGA-tilojen, jotka tulevat t&auml;m&auml;n sis&auml;&auml;n, pit&auml;isi n&auml;ky&auml;.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Omistajan onnea</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Broadlinen Seppo Virtasen mukaan olen ensimm&auml;inen Suomessa olevan Amigan TV-kortin omistaja - ja onnellinen sellainen! Kuvassa ei ole mink&auml;&auml;nlaista nykim&auml;&auml; miss&auml;&auml;n tilanteessa, sill&auml; se tunkee videodatan suoraan Picasson muistiin ilman &quot;v&auml;lik&auml;si&auml;&quot;. Jopa ikkunoinnissa py&ouml;ritett&auml;v&auml;n&auml; Paloma k&auml;ytt&auml;&auml; Picasson PiP-toimintoa (Picture in Picture), jolloin ikkuna voidaan asettaa mihin tahansa ruutuun mihin tahansa kohtaan ilman ett&auml; joutuu k&auml;ytt&auml;m&auml;&auml;n CPU:ta.
						<p>Ik&auml;v&auml;kseni voin todeta, ett&auml; Picasson softa antaa vain yhden PiP-ikkunan toistoon. Muuten kaikkia TV-kanavia saa pit&auml;&auml; vaikka 10 kertaa p&auml;&auml;llekk&auml;in mik&auml;li huvittaa nopeuden siit&auml; k&auml;rsim&auml;tt&auml; lainkaan moniajossa. Viel&auml; kun oikein mietin, niin rajoitus taisi olla sittenkin hardiksessa. Toisaalta, jos haluaa katsella kaikkia kanavia yht&auml;aikaa, sekin onnistuu erillisell&auml; ohjelmalla. PalomaWall-ohjelma pist&auml;&auml; kuvan kerrallaan PiP-ikkunalle, jonka koon ja tilan voi m&auml;&auml;ritell&auml; haluamakseen. Ruudunp&auml;ivitys on sitten noin 2-3 FPS koneesta riippuen. <i>[Toim. huom.: T&auml;t&auml; ohjelmaa ei Aminetist&auml; eik&auml; hakukoneillakaan t&auml;ll&auml; hetkell&auml; l&ouml;ydy, joten ohjelmaa voinee tiedustella suoraan artikkelin kirjoittajalta.]</i></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Liikkuvaa kuvaa - my&ouml;s talteen</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Videon kaappaaminenkin onnistuu PalomaPEG- ja PalomAVI-ohjelmilla joko mustavalkoiseksi MPEG-1:ksi tai v&auml;rilliseksi AVIksi. PalomAVI tarvitsee v&auml;hint&auml;&auml;n SCSI-kortin ja nopean kiintolevyn, sill&auml; kuvavirran m&auml;&auml;r&auml; on 1 Mt/sek luokkaa minunkin koneellani. Kuitenkin AVI-videot saavat 14 FPS FFS-filerointij&auml;rjestelm&auml;ll&auml; aikaan. PFS-2 pystyi jopa 20 FPS, ja hakuaika oli huomattavasti nopeampi. Esimerkiksi Saku 99:n web-kamera oli toteutettu PalomaTV:n ja ARexxin avulla. Videotakin koitin kaapata suoraan verkkoon, mutta trafiikki oli liian kova 1 Mt/sek liikenteelle. :)
						<p>Tietenkin turbon tai koneen oma SCSI-v&auml;yl&auml; hoitaa siirtelyt ilman CPU:ta, joten luonnollisesti aika k&auml;ytet&auml;&auml;n silloin kuvadatan tekemiseen eik&auml; levyn kirjoitteluun, jolloin FPS m&auml;&auml;r&auml;ytyy CPU:n eik&auml; levynsapatuksen tahdissa AVIa k&auml;ytett&auml;ess&auml;. MPEG-kaappaus ei paljonkaan hy&ouml;dy nopeammasta SCSI-toiminnosta. Joka tapauksessa mill&auml; tahansa SCSI-ohjaimella, joka siirt&auml;&auml; 32 bitti&auml; leve&auml;ll&auml; v&auml;yl&auml;ll&auml; dataa on huomattavasti nopeampi kaappaustulos kuin minun A4040:llani. Jopa kaappaus levylle on nopeampaa kuin omalla koneellani muistiin, mik&auml; kertoo jo aika paljon.</p>
						<p>Jos videoita haluaa katsella koneellaan, on siin&auml; oltava siis v&auml;hint&auml;&auml;n 68040-kiihdytin ja mielell&auml;&auml;n 32 Mt muistia. (Amigan valtti on aina ollut video, ja siin&auml; se tulee pysym&auml;&auml;nkin, mik&auml;li BoXeR joskus valmistuu. Se on seuraava koneeni, melkoinen tykkivehje kun on.)</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Pient&auml; miinusta</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Ainoa t&auml;h&auml;nastisissa testauksissa esille tullut ongelma on PalomaTV-ohjelman bugittaminen. Ohjelma kaatuilee silloin t&auml;ll&ouml;in vieden koko koneen mukanaan. Ei kuitenkaan niin ett&auml; se kaatuu, vaan koneella ei n&auml;e tehd&auml; yht&auml;&auml;n mit&auml;&auml;n, sill&auml; Picasson grafiikkamuisti menee sekaisin. Lis&auml;ksi kanavien hakeminen on jotenkin CPU-tehoa viev&auml;&auml; puuhaa, eik&auml; se muutenkaan ole mit&auml;&auml;n herkkua, sill&auml; se vie kanavista ja tehosta riippuen noin seitsem&auml;n minuuttia.
						<p>Ohjelmia:</p>
						<ul>
							<li>PalomaWall, kaikki kanavat samaan aikaan ruudulle
							<li>PalomaPEG, MPEG-1-mustavalko-kaappari (<a href="http://ftp.sunet.se/pub/aminet/gfx/board/PalomaPEG.lha">11&nbsp;kt</a>)
							<li>PalomAVI, AVI-kaappausta v&auml;reiss&auml;, &auml;&auml;ni vaatii Concierto-lis&auml;kortin (<a href="http://ftp.sunet.se/pub/aminet/gfx/board/PalomAVI.lha">28&nbsp;kt</a>)
							<li>PalomaFE, GUI PalomaTV:lle (<a href="http://ftp.sunet.se/pub/aminet/gfx/board/PalomaFEv2.1.lha">203&nbsp;kt</a>)
							<li>PIV-MooVId, paras AVI/MOV-playeri, rekister&ouml;im&auml;ll&auml; Intel Indeo -tuki! (<a href="http://ftp.sunet.se/pub/aminet/gfx/board/PIV-MooVId.lha">89&nbsp;kt</a>)
							<li>akMPEG4, AGA/P96/CGX-MPEG-playeri, PiP-tuki (<a href="http://ftp.sunet.se/pub/aminet/gfx/show/akMPEG4.lha">188&nbsp;kt</a>)
							<li>RiVA, AGA/P96/CGX-MPEG-playeri, PiP-tuki (<a href="http://ftp.sunet.se/pub/aminet/gfx/show/RiVA.lha">28&nbsp;kt</a>)
							<li>AmiPEG, AGA/P96/CGX-MPEG-playeri, PiP-tuki (<a href="http://ftp.sunet.se/pub/aminet/gfx/show/aMiPEG_1.1_bin.lha">99&nbsp;kt</a>)
						</ul>
					</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.villagetronic.com" target="_blank">Village Tronic Marketing GmbH</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Edustaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.dlc.fi/~broline" target="_blank">Broadline Oy</a>, puh. (09) 874 7900, <a href="mailto:broline@dlc.fi">broline@dlc.fi</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">1095 mk (joulukuun 1999 hinnastossa)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hyv&auml;&auml;:</font></td>
					<td width="50%" bgcolor="#d8ecfd">
						<ul>
							<li>liit&auml;nn&auml;t RF-kaapeli/S-VHS-CVBS
							<li>erinomainen kuvanlaatu
							<li>&auml;&auml;nikoodaus stereo/mono
						</ul>
					</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Huonoa:</font></td>
					<td width="50%" bgcolor="#d8ecfd">
						<ul>
							<li>ei Nicam stereota
							<li>ei teksti-tv:t&auml;
							<li>tv-ohjelman automaattinen ratio-korjaus
						</ul>
					</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Arvosana:</font></td>
					<td width="50%" bgcolor="#d8ecfd">97%</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
