<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>X-Surf</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<img height="64" width="254" src="kuvat/xsurfp.gif" alt=" ">
							<p><img height="100" width="195" src="kuvat/xsurf.jpg" alt=" "></p>
						</center>
						<p>Aikanaan paljon parjattu ja haukuttu Amiga 1200:n PCMCIA-korttipaikka on osoittautunut my&ouml;hemmin ly&ouml;m&auml;tt&ouml;m&auml;ksi eduksi p&ouml;yt&auml;koneisiin verrattuna: siihen saa halpoja, parinsadan markan ethernet-verkkokortteja, joilla A1200 on todella helppo liitt&auml;&auml; l&auml;hiverkkoon tai kiinte&auml;&auml;n Internet-letkuun. Jo pitk&auml;&auml;n ainoa joten kuten saatavissa oleva Zorro-v&auml;yl&auml;inen kortti on ollut Ariadne II, mutta senkin saatavuus on ollut viime vuosina melko heikkoa. Kun desktop-Amigoiden tyt&auml;rkorttilaajennusten ISA-paikatkin ovat vain kosmeettisia kapistuksia, iski ADSL-yhteytt&auml; himoavalle p&auml;&auml;toimittajalle tenkkapoo: mill&auml;s nyt kone verkkoon?</p>
						<p>Pelastukseksi koitui jokapaikan h&ouml;yl&auml; saksanmaalta: Jens Sch&ouml;nfeld, jonka Saku 99:ss&auml; k&auml;yneet tai niihin aikoihin #saku99-IRC-kanavalla piipahtaneet amigistit saattavat muistaakin. Jens oli tapahtumassa kertomassa Individual Computers -yrityksens&auml; valmistamista Amiga-tuotteista, joita ovat mm. Buddha-IDE-ohjain, IDEfix-IDE-laajennus, Catweasel-levykeasemaohjain ja ulkoinen Graffiti-n&auml;ytt&ouml;kortti. Yksi uusimmista lis&auml;yksist&auml; villisti lis&auml;&auml;ntyv&auml;&auml;n tuotevalikoimaan on X-Surf (&quot;Cross-Surf&quot;), ethernet-kortti Zorro-v&auml;ylill&auml; varustettuihin Amigoihin.</p>
						<p>Itse kortti antoi ensin&auml;kem&auml;lt&auml; vekkulin vaikutelman: kyseess&auml; on nimitt&auml;in ISA-v&auml;yl&auml;iseen verkkokorttiin lis&auml;elektroniikan kera &quot;pultattu&quot; Zorro-v&auml;yl&auml;liitin. Hitusen verran ep&auml;ilytt&auml;v&auml;st&auml; ulkomuodosta huolimatta kortti tuntuu olevan eritt&auml;in tukevaa tekoa. Ja syyt&auml; onkin: ainoa murhe koko kortin kanssa on ollut sen asennusvaihe. Zorro-v&auml;yli&auml; on monenlaisia ja monen valmistajan tekem&auml;n&auml;, ja tuntuu ett&auml; kaikilla ovat mitat lipsuneet himpun verran sinne sun t&auml;nne. N&auml;in k&auml;vi my&ouml;s oman A3000:ni majapaikkana olevan Micronik Classic -tornin tyt&auml;rkortin kanssa.</p>
						<p>Ensi alkuun kortti tuntui sujahtavan mukavasti paikalleen, Amigan early startup -valikkokin l&ouml;ysi kortin ja n&auml;ytti sit&auml; viel&auml; toimivanakin pit&auml;v&auml;n. Softanasennusvaihe todisti toista. Kortin mukana tulee yksi asennuslevyke jossa on DEVS:Networks-hakemistoon kopioitava x-surf.device ja pieni apuohjelma kortin tilan kyselyyn. Lis&auml;ksi mukana on vain yksi kaksipuolinen A4-arkki, jossa englannin kielell&auml; kerrotaan olennaiset asiat - eip&auml; enemp&auml;&auml; kyll&auml; tarvittaisikaan. Kun kortti ei vastannut huhuiluun, oli pakko kurkistaa korttia uudemman kerran.</p>
						<p>Tarkempi tiirailu osoitti, ett&auml; Zorro-v&auml;yl&auml;ss&auml; on hieman &quot;l&ouml;ys&auml;&auml;&quot; ja X-Surf painoi sen verran lujasti torniin takasein&auml;ss&auml; olevaa pelti&auml; vasten, ett&auml; loppup&auml;&auml;ss&auml; v&auml;yl&auml;n ja X-Surfin nastat eiv&auml;t osuneetkaan kohdalleen. Sen verran ilmeisesti, ett&auml; kortti n&auml;kyi koneelle p&auml;in oikein muttei silti toiminut kunnolla. Sorvailuun tottuneena amigistina kaivoin esiin rautasahan ja voimapihdit - eiv&auml;t ole mit&auml;&auml;n muovia n&auml;m&auml; Micronikin Classic-tornit, niin kuin oli edesmennyt Infinitiv - ja silpaisin laajennuskorttien pidikeraudasta v&auml;h&auml;n lis&auml;&auml; tilaa kortille. Nyt kortti meni kunnolla paikoilleen, ja saatoin kytke&auml; verkkokaapelin kortin per&auml;&auml;n. Nyt kortti vastasi iloisesti kyselyyn, kuten kiltin &quot;ISA-kortin&quot; pit&auml;&auml;kin:</p>
						<p>xsurf testprg V1.2 (13.12.1999)<br>
						Searching for xsurf card (VEN_ID=4626, PROD_ID=23)....found<br>
						Board address = 0xe90000<br>
						ISA Plug and Pray [&auml;hm] Play setup...<br>
						01-CARD VendorID = 0x19808c4a SerNr=0x19b733 CRC==x52<br>
						Setup PNP card...<br>
						Searching for RTL8019 at 0x300...found!<br>
						Testing 16bit memory...ok!<br>
						Ethernet address = 52:54:40:25:89:e4<br>
						Chip is in PnP mode<br>
						Chip is using half-duplex mode<br>
						Chip is using IOBase something (0x3) and IRQ 2/9</p>
						<p>Ohjelmapuolella asennus ei olisi voinut juuri yksinkertaisempaa olla: x-surf.device DEVS:Networks-hakemistoon ja Miamin kimppuun. M&auml;&auml;rittelin uudeksi laitteeksi Ethernet-kortin ja opastin Miamin oikean devicen kimppuun. T&auml;m&auml;n j&auml;lkeen sy&ouml;tin vain verkkoasetukset kuntoon. My&ouml;s DHCP toimii, mutta palveluntarjoajallani ne ovat Amigan kannalta hieman hankalasti vinksollaan, joten tyydyin m&auml;&auml;ritt&auml;m&auml;&auml;n asetukset itse. Ja wiuh, kone oli verkossa.</p>
						<p>Hankkimani ADSL-liittym&auml;n (t&auml;st&auml; enemm&auml;n artikkelissa &quot;<a href="../sekalaiset/adslamiga.html">ADSL Amigassa</a>&quot;) nopeus on koneesta verkkoon p&auml;in 1 Mbit ja koneelle p&auml;in 7 Mbit. X-Surf riitt&auml;&auml; t&auml;h&auml;n mainiosti, onhan se 20 Mbit -kortti, joten varaa teoriassa viel&auml; j&auml;isikin. K&auml;yt&auml;nn&ouml;n siirtovauhdit ovat parhaimmillaan olleet koneelle p&auml;in n. 650 kt/sek ja koneelta ulos 100 kt/sek. Ei valittamista, kun on aikanaan aloittanut 300 bps -mopomodeemilla eik&auml; ole koskaan ole ollut mahdollisuuksia kiinte&auml;ll&auml; letkulla varustettuun opiskelija-asuntoonkaan...</p>
						<p>X-Surfissa on sek&auml; BNC- ett&auml; twisted-pair (RJ-45) -liit&auml;nn&auml;t. N&auml;ist&auml; voi k&auml;ytt&auml;&auml; siis vain jompaa kumpaa, ja kortti tunnistaa k&auml;ytetyn liittimen automaattisesti. Puskurimuistia on 16 kiloa, piirisarja on Realtekin. Kortti on IEEE 802.3:n mukainen ja siin&auml; on 10Base2- and 10Base-T-tuki. Sana-II-ajuri (x-surf.device) tulee kortin mukana, ja Miamin mukana tulee lis&auml;ksi MNI-ajuri, jota kortti kiltisti tottelee. Kortti k&auml;y my&ouml;s A1200:n v&auml;yl&auml;korttilaajennuksiin. Gentle Eye myy korttia 690 markan hintaan, joten se on noin satasen verran halvempi kuin verrokkinsa Ariadne II.</p>
						<p>X-Surf on kuitenkin paljon muutakin kuin vain verkkokortti. Siin&auml; on nimitt&auml;in koko liuta laajennuspaikkoja Individual Computersin muille laitteille. Kahteen A1200-tyyppiseen kelloporttiin voi liitt&auml;&auml; esimerkiksi HyperCom- tai SilverSurfer-I/O-kortin, Delfina 1200 siin&auml; ei tosin Jensin kertoman mukaan toimi. 26-nastainen laajennusportti on vastaava kuin Buddha- ja Catweasel-ohjaimissa. Kaiken huipuksi kortilla on viel&auml; kaksi IDE-v&auml;yl&auml;&auml; (2,5&quot; ja 3,5&quot;) kiintolevyj&auml; ja romppuasemia varten. N&auml;m&auml; aktivoidaan IDEfix-ohjelmiston avulla, boottaamaan niit&auml; tosin ei saa, eik&auml; esim. polttavaa CD-asemaa n&auml;ihin IDE-v&auml;yliin voi laittaa.</p>
						<p>Kaikki laajennusv&auml;yl&auml;t ovat toisistaan riippumattomia ja niit&auml; voidaan kaikkia k&auml;ytt&auml;&auml; yht&auml; aikaa. K&auml;yt&auml;nn&ouml;ss&auml; en laajennusmahdollisuuksia ole itse kokeillut, sill&auml; t&auml;ll&auml; hetkell&auml; minulla ei ole tarvetta millek&auml;&auml;n niist&auml;. L&auml;hinn&auml; voisin kuvitella hankkivani varastolevyksi (k&auml;ytt&ouml;levyin&auml; kun Amigassani on kaksi UW-SCSI-kiintolevy&auml;) jonkin ison IDE-kiintolevyn, niiden hinnat kun eiv&auml;t taivaita raavi t&auml;ll&auml; hetkell&auml;.</p>
						<p>Hintansa kortti on jo &quot;haukkunut&quot;, eik&auml; mit&auml;&auml;n ongelmia sen kanssa ole alun ahdistuksen j&auml;lkeen ollut. MNI-ajurilla tuntuu saavan hieman enemm&auml;n nopeutta irti kortista, joten sit&auml; olen k&auml;ytt&auml;nyt nyky&auml;&auml;n. T&auml;ll&auml; hetkell&auml; ADSL-yhteytt&auml; jakaa PC (Amigan lis&auml;ksi my&ouml;s toiselle PC-koneelle), ja yhteys sen ja Amigan v&auml;lill&auml; on toiminut moitteetta. Amigallakin yhteyden jakaminen toki onnistuisi, mutta tuli halvemmaksi (yhteens&auml; n. 200 mk) ostaa kaksi verkkokorttia PC:hen kuin Amigaan...</p>
						<p>Lievist&auml; alkuvaiheen asennusvaikeuksista huolimatta voin suositella X-Surfia vilpitt&ouml;m&auml;sti, sen verran hyvin se on teht&auml;v&auml;st&auml;&auml;n suoriutunut. Lis&auml;liit&auml;nn&auml;t ovat tietenkin yksi houkutin lis&auml;&auml; hankkia kortti, mutta jo pelk&auml;st&auml;&auml;n verkkokorttina t&auml;m&auml; on harkitsemisen arvoinen.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.jschoenfeld.com" target="_blank">Individual Computers</a>, <a href="mailto:jens@siliconsonic.de">Jens Sch&ouml;nfeld</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Edustaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.ge.vip.fi" target="_blank">Gentle Eye Ky</a>, puh. (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">690 markkaa</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Zorro-v&auml;yl&auml; (A2/3/4000, k&auml;y my&ouml;s A1200:n Zorro-v&auml;yl&auml;kortteihin), Sana-II-TCP/IP-pino (Miami, Genesis, AmiTCP ym.)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Amiga 3000, Micronik Classic -tornikotelo ja tyt&auml;rkortti, CSPPC 604e/200 MHz, 68060/50 MHz, 128 Mt Fast, OPOY:n ADSL-liittym&auml; 1/7 Mbit</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hyv&auml;&auml;:</font></td>
					<td width="50%" bgcolor="#d8ecfd">
						<ul>
							<li>saatavuus, kohtuullinen hinta
							<li>vaivaton k&auml;ytt&ouml;&ouml;notto
							<li>luotettava toiminta
							<li>lis&auml;laajennusmahdollisuudet
						</ul>
					</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Huonoa:</font></td>
					<td width="50%" bgcolor="#d8ecfd">
						<ul>
							<li>tarkka asennus Zorro-v&auml;yl&auml;&auml;n
						</ul>
					</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekniikkaa</font></td>
					<td width="50%" bgcolor="#d8ecfd">
						<ul>
							<li>IEEE 802.3, 10Base2- ja 10Base-T-tuki
							<li>BNC- ja twisted-pair (RJ-45) -liittimet
							<li>20 Mbit (full duplex, twisted-pair)
							<li>16 kt puskurimuistia
							<li>Realtek-piirisarja
							<li>h&auml;iri&ouml;suojattu v&auml;yl&auml;liitin
							<li>2 x A1200-kelloportti
							<li>1 x Buddha/Catweasel-laajennusportti
							<li>1 x 2,5&quot; IDE-liitin, 1 x 3,5&quot; IDE-liitin
						</ul>
					</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Yleisrvosana:</font></td>
					<td width="50%" bgcolor="#d8ecfd">95%</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
