<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<!-- Author = Cord Hagen -->

<TITLE>Der Schwarzseher</TITLE>
</HEAD>

<BODY background="dk_cord1.jpg" text="#fffff0" bgcolor="#000000">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<H1 align="center"><FONT color="#ffff00"><B>Der Schwarzseher</B></FONT></H1>

<H3 align="center"><FONT color="#ffff00"><B>- politische Runde in der
NoCover</B></FONT></H3>

<P>Wir hatten fr&uuml;her in der NoCover einmal eine recht interessante
politische Diskussionsrunde, die sich &uuml;ber mehrere Ausgaben hinzog.
Gut fand ich vor allem die unterschiedlichen Meinungen, die dennoch mit
viel Respekt anderer Denkrichtungen diskutiert wurden. Ich geh&ouml;re
(leider?) zu Denjenigen, die unsere vergangene Wahl am 22. September 2002
nicht nachvollziehen kann und m&ouml;chte heute gern eine solche
Diskussionsrunde lostreten, um andere Meinungen zu erkennen und
nachvollziehen zu k&ouml;nnen. Lasst mich bitte nicht h&auml;ngen, schreibt
Eure Meinung, egal, f&uuml;r welche "Farbe" Ihr Euch entschieden habt. Ob
rot, gr&uuml;n, gelb, schwarz oder sonstwie. Ich akzeptiere und respektiere
jede Meinung, aber es muss auch eine Meinung sein. Aber dazu gleich
mehr.</P>

<P>Ich pers&ouml;nlich hatte sehr gehofft, dass eine andere Regierung
zustande kommt. Wenn ich mich hier in der n&ouml;rdlichen Gegend
umh&ouml;re, wenn jemand die SPD gew&auml;hlt hat (und das scheinen hier
die Meisten getan zu haben), warum er sich dann daf&uuml;r entschieden hat,
kommt fast immer nur "weil Schr&ouml;der symphatischer" ist. Nanu! - Was
ist denn das f&uuml;r ein Grund??? W&auml;hlten wir den Showmaster des
Jahres, oder die politische Richtung der kommenden vier Jahre? Ich mag
weder Schr&ouml;der mit seiner nordischen "Schnodderschnauze" (und ich
mach&acute; das so - das sach&acute; ich so!), noch Stoiber mit seinem
leicht verzerrtem Grinsen - aber darauf kommt es doch nun &uuml;berhaupt
nicht an. Und es trifft jetzt so ein, wie ich es bef&uuml;rchtet hatte,
(&uuml;brigens auch schon seit 1998) - kaum sind die Wahlen durch, wird
&uuml;berlegt, welche Steuer als erstes und welche als zweites erh&ouml;ht
wird und die Gr&uuml;nen f&uuml;hlen sich in ihrer Politik sehr
best&auml;tigt - genug Grund, um die Sache mit der &Ouml;kosteuer noch mal
am liebsten zu verdreifachen. Durch Steuererh&ouml;hungen wird die
Wirtschaft ganz sicher nicht in Gang gebracht.</P>

<P>Im Gewerbe herrscht absoluter Katastrophenalarm. Hier im Norden geht ein
kleines Unternehmen nach dem Anderen vor die Hunde - nicht die
Neueinsteiger (die sowieso), sondern Unternehmen, die es schon seit
Generationen gibt. Unsere Regierung &uuml;berlegt, wie man das Debakel
durch immer h&ouml;here Steuern in den Griff bekommt und wie man
Arbeitslose geschickter verwaltet - aber wozu das Ganze, wenn die Ursache
nicht bek&auml;mpft wird? Immer mehr Firmen gehen kaputt, wieder fallen
Arbeitspl&auml;tze weg und wenn dann dadurch die Ausgaben steigen und die
Einnahmen sinken, wird wieder entgegengewirkt, indem der Rest einfach noch
mehr zahlen soll.</P>

<P>Dann das gr&uuml;ne Argument, dass durch die &Ouml;kosteuer ja die
Lohnnebenkosten gesenkt werden. Ja rechnet das denn niemand nach? Der
durchschnittliche Arbeitnehmer zahlt doch viel mehr durch die
&Ouml;kosteuer rein, als er mehr Lohn am Monatsende herausbekommt.
Zun&auml;chst muss er tagt&auml;glich selbst mobil sein, um &uuml;berhaupt
zur Arbeit zu gelangen und wieder zur&uuml;ck. Dann steigen &uuml;berall
s&auml;mtliche Preise, denn selbstverst&auml;ndlich gibt es nicht eine
einzige in Deutschland k&auml;ufliche Ware, die nicht von A nach B
transportiert werden muss. Wo sollen denn diese pl&ouml;tzlichen Mehrkosten
aufgefangen werden? Nat&uuml;rlich mit Erh&ouml;hung des
Endverkaufspreises. Dazu muss man doch nicht gelernter Kaufmann sein, um
sich das denken zu k&ouml;nnen. Bis dann Einzelteile aus anderen
L&auml;ndern hierher verschifft werden, hier veredelt und weiterverarbeitet
werden, dann zum Gro&szlig;markt transportiert, von hieraus zu den
Einzelh&auml;ndlern und dann zum Endverbraucher, legt jeder Artikel eine
betr&auml;chtliche Strecke zur&uuml;ck und durch gestiegende
Transportkosten rollt sich eine regelrechte Lawine zusammen. Die
&Ouml;kosteuer hat weit mehr Verteuerungseffekt, als viele Menschen
zun&auml;chst bedenken. Das war aber JEDEM W&auml;hler der SPD und der
Gr&uuml;nen vorher klar, denn es stand in den Programmen der Parteien. Also
darf hier niemand jammern, wenn mal wieder alles teurer zu werden
scheint.</P>

<P>Die &Ouml;kosteuer als solches funktioniert ja noch nicht mal als
solches. Das die Strassen und Autobahnen immer weiter verkommen ist
logisch, denn da fliesst das Geld ja nicht hinein. So wie es beispielsweise
in Nachbarl&auml;ndern der Fall ist, die ihre gesamte Verkehrssituation
weit besser im Griff haben. Und weniger tanken kann der Mensch auch in den
meisten F&auml;llen nicht. Der kleine Arbeiter muss doch zur Arbeit fahren
und muss vielleicht einen alten PKW nehmen. Durch die hohen Spritkosten
kann er sich aber nichts zur Seite legen, um sich mal ein neueres Auto
leisten zu k&ouml;nnen. Es verdienen nun mal nicht alle Menschen mehrere
tausend Euro.</P>

<P>Dann die Au&szlig;enpolitik! Man kann eigentlich nur noch ins Ausland,
um sich zu entschuldigen. Na Ihr verfolgt das ja bestimmt alles selbst. Es
ist einfach katastrophal, was da in den letzten Wochen zerst&ouml;rt wurde.
Noch vor einem Jahr geh&ouml;rte den Amerikanern unsere bedingungslose
Solidarit&auml;t und jetzt w&uuml;rden wir uns an milit&auml;rischen
Projekten nicht einmal mehr beteiligen, wenn UNO oder NATO das f&uuml;r
sinnvoll halten? Den Krieg will wirklich niemand, das steht doch gar nicht
erst zur Debatte! Aber wie w&uuml;rde sich Deutschland verhalten, wenn
Terorristen Berlin zerbomben w&uuml;rden? W&uuml;rde unsere Regierung
sagen, dass das alles sehr schlimm sei, wir aber nichts tun werden, weil
man ja keinen Krieg beginnen m&ouml;chte? Wenn hier ein derartiger Anschlag
passiert w&auml;re h&auml;tte man sich auf die Solidarit&auml;t der
Amerikaner verlassen k&ouml;nnen und da w&auml;re es sehr sicher nicht bei
einem Versprechen geblieben, wo man ein Jahr sp&auml;ter auch noch
Beleidigungen erster G&uuml;te vom Stapel l&auml;sst. Niemand m&ouml;chte
privat so von Freunden behandelt werden. In der Politik gilt dasselbe.</P>

<P>Also ich konnte am Wahltag nur noch mit dem Kopf sch&uuml;tteln. Ich
will gar nicht mal behaupten, dass CDU/CSU alles viel besser gemacht haben,
aber dort wurde lt. Programm zumindest erkannt, das die Ursachen allen
innerwirtschaftlichen &Uuml;bels in der mittleren Wirtschaft liegen und
dort zuerst angepackt werden muss. Toll, wenn gro&szlig;e Komissionen erst
einmal die Arbeitslosen besser auf die paar freien Stellen verteilen
wollen. Dazu muss man sich aber die freien Stellen genauer ansehen. Ein
gro&szlig;er Anteil an Stellen bleibt beim Arbeitsamt im Computer gelistet,
weil die Betriebe nicht melden, wenn die Stelle bereits belegt ist. Dann
ein gro&szlig;er Anteil von tempor&auml;ren Arbeitsstellen. Es gibt nun mal
einen Anteil, der mit der Verwaltungsgeschwindigkeit nicht mitkommt und
zwangsl&auml;ufig als frei auftaucht. Ein Firma hat einen freien Platz,
meldet ihn, der kommt in die Statistik, Platz wird besetzt, aber er bleibt
noch in der Statistik. Dann noch ein Teil an Stellen der Unsinn ist. Mit
Saisonarbeitspl&auml;tzen und Teilzeit (zB. im Sommer morgens 2h Spargel
stechen) ist NIEMANDEM geholfen - wer soll denn davon leben? Man kann
&uuml;brigens JETZT auch in dieser Jahreszeit lt. Arbeitsamt-System freie
Stellen als Spargelstecher bekommen (!) Daran sieht man doch schon, dass da
was nicht ganz richtig sein kann, oder? Es muss nicht mehr Verwaltung der
Pseudo-Arbeitsstellen her, sondern wieder mehr Arbeitspl&auml;tze und dazu
muss es den Betrieben wieder besser gehen. Der Stellenabbau im Sozialen
h&auml;ngt nat&uuml;rlich auch damit zusammen. Schlechte Wirtschaft, mehr
Entlassungen bis hin zur Unternehmenspleite und Komplettentlassung der
Belegschaft. Aus Einzahlern werden Geldempf&auml;nger. Statt "+" gibts
f&uuml;r den Staat "-"! Das Minus muss abgefangen werden, am einfachsten
und schnellsten, indem man die Einnahmen erh&ouml;ht und die Ausgaben
senkt. Das ist wie eine Lawine. Es wird an wichtigen Stellen gek&uuml;rzt -
in den Schulen, den Krankenh&auml;usern und anderen &ouml;ffentlichen
Einrichtungen. Der B&uuml;rger zahlt mehr und bekommt immer weniger. Der
Frust steigt, die Lebensqualit&auml;t sinkt.</P>

<P>Schulden machen ist falsch? Ja stimmt, - es sei denn, das man damit den
Karren wieder flott bekommt. Ein Land funktioniert da nicht viel anders,
wie ein Unternehmen. Was macht denn ein Unternehmen, wenn der einzige LKW
kaputt ist und man damit nicht mehr richtig arbeiten kann? Notfalls nimmt
man sich einen Kredit auf um einen neuen LKW zu kaufen, um wieder
wettbewerbsf&auml;hig zu sein und Schulden &uuml;berhaupt erst abbauen zu
k&ouml;nnen. Zur Auswahl steht nur, den LKW notd&uuml;rftig zu flicken und
immer wieder Geld in die Reparatur zu stecken. Bis nichts mehr geht und
unser Beispielunternehmen wahrscheinlich pleite gegangen ist. Nur kann
Deutschland nicht einfach Konkurs anmelden.</P>

<P>Und sich mit der Weltwirtschaft herauszureden ist auch relativer Unsinn.
Warum betrifft es dann nicht unsere Nachbarl&auml;nder? Ich weiss noch als
Ende der Neunziger durch den neuen Markt die B&ouml;rsenkurse an den Gipfel
reichten und Bundeskanzler Schr&ouml;der sich damit br&uuml;stete, dass das
bereits zum gro&szlig;en Teil der erste Effekt seiner neuen Politik sei.
Jetzt sind die B&ouml;rsenkurse unten und deswegen ist das Ergebnis der
richtigen Politik so schlecht, denn an allem ist die globale Wirtschaft
Schuld? Aber Widerspr&uuml;che und Dementierungen waren in den letzten
Jahren ja nichts &Uuml;berraschendes mehr. Die meisten Arbeitspl&auml;tze
werden von den umliegenden kleinen Unternehmen geboten. Der B&auml;cker,
Schlachter, Lebensmittelmarkt, Installateur, Tischler usw. und die sind
nicht vom Weltgeschehen in erster Linie abh&auml;ngig, sondern von der
Innenwirtschaft. Selbst unsere europ&auml;ischen Nachbarn k&ouml;nnen
Rot-gr&uuml;n zum gro&szlig;en Teil nicht nachvollziehen und erst recht
nicht einsch&auml;tzen. Kanzler Kohl hat jahrelang aufgebaut, Deutschland
f&uuml;r Europa fit zu machen und die neue Regierung geht nun den deutschen
Weg allein und trampelt sich seinen Weg durch die Au&szlig;enpolitik.</P>

<P>&Ouml;kologische Verantwortung?</P>

<P>Es werden Hermes-Kredite vergeben, welche Projekte im Ausland absichern,
die &ouml;kologisch v&ouml;llig sinnlos sind, - sogar gef&auml;hrlich, weil
beispielsweise ein gigantischer Staudamm in einem Erdbebengebiet durch
deutsche Hermes-Sicherungen erm&ouml;glicht wird. Eine ganze Stadt wird
daf&uuml;r dort dem Erdboden gleich gemacht und deren Bewohner marschieren
mit Transparenten gegen Deutschland durch ihre Strassen, weil sie ihre
Heimat ersatzlos verlieren. Das alles hat es noch nie gegeben!
&Ouml;kologisches Bewusstsein demonstriert man scheinbar lieber im Inland
mit Erh&ouml;hung der &Ouml;kosteuer.</P>

<P>Liebe Leute - lediglich zwei Tage nach der Wahl denkt gr&uuml;n
&uuml;ber weitere Phasen der &Ouml;kosteuer nach und nur vier Tage nach der
Wahl wird &uuml;ber andere Steuererh&ouml;hungen diskutiert - der
allererste Gedanke nach der Wahl ist dieses kl&auml;gliche Ergebnis!</P>

<P>Und wenn gro&szlig;e Unternehmen der Pleite entgegengehen, wird
werbewirksam und mit breitem L&auml;cheln im Fernsehen kopflos und
kurzfristig geholfen. Bei Firmen, denen ohnehin nicht mehr realistisch zu
helfen ist, denn noch so gute Kredite fangen Verluste in
Milliardenh&ouml;he nat&uuml;rlich nicht wieder auf. Der Konkurs wird nur
verz&ouml;gert, nicht verhindert. Und was macht ein kleines Unternehmen,
das dem Ende entgegensieht? Wer hilft hier? Diese Regierung auf keinen
Fall. Ist das eine gerechte Politik? Eine soziale Politik?</P>

<P>Die gro&szlig;en K&ouml;rperschaften brauchten nach dem letzten
"Steuergebastel" keinen m&uuml;den Cent an Steuern zahlen - die ohnehin
ausgesaugten Kleinunternehmer daf&uuml;r umso mehr. Wem soll das
n&uuml;tzlich sein, bis auf die wenigen Menschen in den Vorst&auml;nden der
gro&szlig;en Unternehmen, die ohnehin in ganz anderen Kategorien Ihr Geld
zur Seite legen um sich im Ausland Ihre Altersresidenz zu bauen? Dann wird
die Karre auch dort wieder an den Baum gefahren und das Management mit
hoher Abfindung "bestraft".</P>

<P>Und was war das mit den UMTS-Einnahmen? Die "Mitspieler" hatten ja die
Wahl - entweder diesen irrwitzigen Weg mitgehen, ohne zu wissen wie man das
je finanzieren k&ouml;nnte, oder aber aussen vor bleiben, noch ein paar
Jahre mit der alten Technik wirtschaften, den Zug dann irgendwann
v&ouml;llig verpassen. Also mit guter Wahrscheinlichkeit jetzt kein Geld
mehr und das aus (siehe MobilCom) oder eben ohne k&uuml;nftige Technologie
und dann in ein paar Jahren weg vom Fenster, weil man nicht mehr anbieten
kann, was der Markt verlangt. Die Regierung freut sich &uuml;ber die
horrenden zu keinem Verh&auml;ltnis stehenden Einnahmen und schaut dabei
zu, wie ein bis dahin gesundes Unternehmen zugrunde geht.</P>

<P>Ich finde die Politik sehr spannend, - muss mich aber genausogut
dar&uuml;ber &auml;rgern, nach welchen Gesichtspunkten heute viele Menschen
ihre Wahl treffen um ihre eigenen Interessen vertreten zu wissen. Es kann
doch nicht wahr sein, dass eine einzelne Person gew&auml;hlt wird, die im
Moment angenehmer l&auml;chern kann!</P>

<P>Es ist gut, dass Menschen unterschiedlicher Meinung sind. Es muss auch
nicht richtig sein, wie ich mir mein Bild gestaltet habe. Das sind allein
meine pers&ouml;nlichen Ansichten und eine Meinung sollte sich jeder machen
und offen dar&uuml;ber diskutieren k&ouml;nnen. Macht oft auch Spass andere
Meinungen kennenzulernen, aber die SPD-W&auml;hler, die ich hier bislang
kennengelernt habe, hatten &uuml;berhaupt keine politische Meinung. Sie
fanden Schr&ouml;der einfach nur "netter" und da habe ich dann wirklich so
meine Probleme mit....</P>

<P>Oder ein anderes gern verwendetes Statement ist "ist doch eh egal, wer
regiert - die k&ouml;nnen ja doch nichts ver&auml;ndern".... Es gibt leider
aber NUR monit&auml;re und polit&auml;re M&ouml;glichkeiten in die
Wirtschaft eines Landes einzuwirken. Monit&auml;re Mittel werden von den
Zentralbanken bestimmt, indem Zinsen gesenkt oder erh&ouml;ht werden. Den
Rest kann nur noch die Politik in einem Land bewirken. Wenn allso nicht die
Regierung eines Landes etwas verbessern kann, - wer soll es denn dann tun?
Durch viel geschickte und gut durchdachte Politik ist dieses Land erst
&uuml;berhaupt so reich und sozial geworden? Das kam nicht durch nichtstun,
sondern durch politische Einfl&uuml;sse. Es ist also sehr wohl wichtig,
welche K&ouml;pfe sich Gedanken &uuml;ber welche Ziele und Aufgaben machen.
Anders geht es &uuml;berhaupt nicht.</P>

<P>Zudem ist ganz schlimm, dass sich Rot-gr&uuml;n nun auch noch in seiner
Richtung best&auml;rkt f&uuml;hlt und meint, alles richtig getan zu haben
und so weiter machen m&ouml;chte. Das muss man sich mal vorstellen. In fast
allen Bereichen ist die Lage schlechter geworden. Wirtschaft,
Arbeitslosenzahlen, Aussenpolitik, Gesundheitswesen, Renten, Bildung,....
und das ist jetzt der richtige Weg in die richtige Richtung???
Rot-gr&uuml;n h&auml;tte keinesfalls vier weitere Jahre haben d&uuml;rfen,
- es gibt einfach KEINEN plausiblen Grund daf&uuml;r! Oder habe ich da
irgendetwas &uuml;bersehen? Das bessere &Uuml;bel w&auml;hlen, um Stoiber
und seine Politik zu verhindern? Mal davon abgesehen, dass auch so
argumentierende W&auml;hler sich in den meisten F&auml;llen nicht einmal
die M&uuml;he gemacht haben, die politischen Programme der Parteien
durchzulesen - Dann h&auml;tten sie eben lieber den Tierschutzverein oder
die grauen Panther w&auml;hlen sollen. So w&uuml;sste wenigstens jede
folgende Regierung, dass die Bev&ouml;lkerung im gro&szlig;en Teil eben
nicht zufrieden ist mit dieser immer negativer werdenden Entwicklung.</P>

<P>So liebe Leser, - und jetzt m&ouml;chte ich in der n&auml;chsten Ausgabe
Paroli von Euch hier bekommen. Ich m&ouml;chte wissen, welche guten
Gr&uuml;nde ich &uuml;bersehen habe, die SPD oder die Gr&uuml;nen zu
w&auml;hlen. Ich kann diese Wahl 2002 nicht nachvollziehen, - lass mich da
aber ehrlich sehr gern aufkl&auml;ren. Ich habe bewusst hier etwas
provokant geschrieben, denn es muss doch m&ouml;glich sein, &uuml;ber eine
so wichtige Wahl offen diskutieren zu k&ouml;nnen.</P>

<P>Also schreibt und lasst mich an Eurer Meinung teilhaben,<BR>
Euer HIGGINS<BR>
Cord Hagen</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

