<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Anonym im Netz</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="6"><B>Unser Recht auf
          Anonymit&auml;t</B></FONT></P>

          <P><IMG src="st_anonym1.gif" width="300" height="260" border="0" alt="Unser
          Recht auf Anonymit&auml;t" align= "left"> Gibt es &uuml;berhaupt ein Recht
          auf Anonymit&auml;t und woraus w&auml;re es gegebenenfalls abzuleiten? Oder
          ist das Recht auf Anonymit&auml;t etwas so Selbstverst&auml;ndliches, dass
          es einer expliziten gesetzlichen Regelung gar nicht bedarf? In welchen
          Situationen ist Anonymit&auml;t gesellschaftlich akzeptiert, ja unbedingt
          notwendig und unter welchen Voraussetzungen muss die Anonymit&auml;t
          aufgehoben werden, zum Beispiel um Straft&auml;ter zu identifizieren? Wie
          ver&auml;ndert die Nutzung moderner Technik die Chancen von
          Anonymit&auml;t? K&ouml;nnen wir im Internet das gleiche Ma&szlig; an
          Anonymit&auml;t erwarten wie im allt&auml;glichen Leben? Braucht es zum
          Schutz der Anonymit&auml;t neuer Gesetze oder einer besseren Technik?<BR
          clear="all"> </P>

          <P>Fragen von Datenschutzbeauftragten:<BR> Wo bleibt der notwendige
          Politikwechsel zum wirksameren Schutz der Privatsph&auml;re?</P>

          <P>Im Herbst 1998 formulierten die Datenschutzbeauftragten Berlins,
          Brandenburgs, Bremens, Nordrhein-Westfalens und Schleswig-Holsteins zehn
          Punkte f&uuml;r einen Politikwechsel zum wirksameren Schutz der
          Privatsph&auml;re</P>

          <CENTER>
            <A href=
            "http://www.lda.brandenburg.de/tb_info/tb/tb7/tb7anhang.htm#a01.">
            http://www.lda.brandenburg.de/tb_info/tb/tb7/tb7anhang.htm#a01.</A>
          </CENTER>

          <P>Ein Jahr sp&auml;ter traten diese
          Datenschutzbeauftragten mit einem erg&auml;nzenden
          Thesenpapier unter der &Uuml;berschrift "F&uuml;r eine
          freie Telekommunikation in einer freien Gesellschaft"
          erneut an die &Ouml;ffentlichkeit</P>

          <CENTER>
            <A href=
            "http://www.lda.brandenburg.de/tb_info/tb/tb8/tb8anh.htm#B.">
            http://www.lda.brandenburg.de/tb_info/tb/tb8/tb8anh.htm#B.</A>
          </CENTER>

          <P>Beide Papiere haben bis heute nichts von ihrer Bedeutung verloren. Im
          Gegenteil ist festzustellen, dass ihre notwendige Umsetzung in weiten
          Teilen noch aussteht und in bestimmten Bereichen sogar massiv
          gef&auml;hrdet wird:</P>

          <UL>
            <LI>Die Aufnahme eines Grundrechts auf Datenschutz in das Grundgesetz ist
            noch nicht erfolgt.</LI>

            <LI>Eine h&ouml;here Priorit&auml;t f&uuml;r Sicherheit und
            Ordnungsm&auml;&szlig;igkeit der Datenverarbeitung wird nur z&ouml;gerlich
            in Angriff genommen.</LI>

            <LI>Die F&ouml;rderung wirksamer Verschl&uuml;sselungsverfahren ist noch
            nicht erreicht, stattdessen gibt es immer wieder &Uuml;berlegungen, das
            Recht auf Kryptographie zu beschr&auml;nken.</LI>

            <LI>Die gr&uuml;ndliche Modernisierung und Effektivierung der
            Datenschutzgesetze steht nach wie vor an.</LI>

            <LI>Die Schaffung eines substantiellen Datenschutzniveaus in den
            bereichsspezifischen Regelungen ist nicht &uuml;berall gelungen.</LI>

            <LI>Die systematische &Uuml;berpr&uuml;fung der Effektivit&auml;t von
            Eingriffsbefugnissen im Sicherheitsbereich und die &Uuml;berpr&uuml;fung
            von Sonderbefugnissen aus der Terrorismusfahndung m&uuml;ssen hinreichend
            sichergestellt werden.</LI>

            <LI>Die Gew&auml;hrleistung des Datenschutzes bleibt eine Daueraufgabe bei
            der Verwaltungsreform.</LI>

            <LI>Die Einf&uuml;hrung eines allgemeinen Informationszugangsrechts hat der
            Bund in dieser Legislaturperiode erneut nicht geschafft.</LI>

            <LI>Nicht unfassend gew&auml;hrleistet ist das Recht der B&uuml;rgerinnen
            und B&uuml;rger auf un&uuml;berwachte Telekommunikation, ohne die eine
            freie Informationsgesellschaft nicht denkbar ist. Im Gegenteil werden stets
            neue Eingriffe zugelassen.</LI>

            <LI>Der rechtliche und organisatorische Ausbau des Datenschutzes im
            privaten Bereich kommt kaum voran.</LI>
          </UL>

          <P>Vier Jahre nach der erstmaligen Formulierung dieser Forderungen, ist es
          an der Zeit, hiermit die Politik erneut zu konfrontieren.</P>

          <P>Vor dem Hintergrund neuer technischer Entwicklungen stehen
          au&szlig;erdem weitere datenschutzpolitische Forderungen auf der
          Tagesordnung, deren Erf&uuml;llung in der kommenden Legislaturperiode
          dringlich sind.</P>

          <P><B>1. Umfassende Modernisierung des Bundesdatenschutzgesetzes</B></P>

          <P>Auch das neue Bundesdatenschutzgesetz vom Mai 2001 wird den
          Anforderungen der Informationsgesellschaft nicht gerecht. Wie das Gutachten
          des Bundesinnenministeriums zur Modernisierung des Datenschutzrechts zeigt,
          bedarf es vielmehr einer grundlegenden Neustrukturierung des Datenschutzes.
          Im Vordergrund muss dabei die St&auml;rkung der informationellen
          Selbstbestimmung und des Selbstdatenschutzes stehen: Jeder Mensch muss
          tats&auml;chlich selbst entscheiden k&ouml;nnen, welche Datenspuren er
          hinterl&auml;sst und wie diese Datenspuren verwertet werden. Wenn es um die
          Nutzung von Daten f&uuml;r Werbezwecke geht, muss die informierte und freie
          Einwilligung der Betroffenen vorliegen ("opt in" statt "opt out").
          Hersteller und Anbieter m&uuml;ssen verpflichtet werden, den Nutzerinnen
          und Nutzern die geeigneten Mittel zur Geltendmachung ihrer Rechte auch auf
          technischem Wege zur Verf&uuml;gung zu stellen.</P>

          <P><B>2. Mehr Marktwirtschaft im Datenschutz</B></P>

          <P>Bislang ist das Datenschutzrecht in Deutschland in erster Linie als
          Ordnungsrecht ausgestaltet. Seine Einhaltung soll durch Kontrolle, Kritik
          und Beanstandung durchgesetzt werden. Es fehlen Anreize f&uuml;r Firmen und
          Beh&ouml;rden, ein vorbildliches Datenschutzkonzept zu verwirklichen. Mit
          dem Datenschutzaudit k&ouml;nnte Firmen und Beh&ouml;rden ein gutes
          Datenschutzkonzept best&auml;tigt werden und es w&uuml;rde ihnen die
          M&ouml;glichkeit er&ouml;ffnen, damit nach au&szlig;en zu werben. Das
          G&uuml;tesiegel k&ouml;nnte ein Anreiz sein, IT-Produkte von vornherein
          datenschutzgerecht zu gestalten und damit Marktvorteile zu erringen. Eine
          datenschutzkonforme Technikgestaltung ist eine wichtige Voraussetzung
          f&uuml;r einen effizienten Datenschutz. Audit und G&uuml;tesiegel
          w&uuml;rden die Aufmerksamkeit des Publikums auf das Thema Datenschutz
          lenken und so die st&auml;rkere Einbeziehung von Kundinnen und Kunden
          f&ouml;rdern. Bislang sind Audit und G&uuml;tesiegel im
          Bundesdatenschutzgesetz nur angek&uuml;ndigt. Es fehlen die Regelungen zur
          notwendigen Umsetzung.</P>

          <P><B>3. F&ouml;rderung von datenschutzgerechter Technik</B></P>

          <P>Die Verwirklichung des Grundrechtsschutzes h&auml;ngt nicht allein von
          Gesetzen ab. Auch die Gestaltung der Informationstechnik hat gro&szlig;en
          Einfluss auf das Datenschutzrecht der B&uuml;rgerinnen und B&uuml;rger.
          Datenschutzgerechte Technik stellt sich aber nicht von alleine ein, sondern
          bedarf der F&ouml;rderung durch Anreize. Neben der Schaffung von
          G&uuml;tesiegeln kommt vor allem die staatliche Forschungs- und
          Entwicklungsf&ouml;rderung in Betracht. Bislang spielt das Thema
          Datenschutz bei den &ouml;ffentlichen IT-Entwicklungsprogrammen, wenn
          &uuml;berhaupt, allenfalls eine untergeordnete Rolle. ForscherInnen und
          EntwicklungsingenieurInnen designen deshalb neue IT-Produkte nur selten
          unter dem Blickwinkel, ob sie datenschutzgerecht, datenschutzf&ouml;rdernd
          oder wenigstens nicht datenschutzgef&auml;hrdend sind.</P>

          <P><B>4. Anonyme Internetnutzung</B></P>

          <P>Das Surfen im WorldWideWeb mit seinen immensen
          Informationsm&ouml;glichkeiten und das Versenden von e-mails sind heute
          f&uuml;r viele selbstverst&auml;ndlich. W&auml;hrend aber in der realen
          Welt jeder Mensch zum Beispiel in einem Buchladen st&ouml;bern oder ein
          Einkaufszentrum durchstreifen kann, ohne dass seine Bewegungen registriert
          werden, ist dies im Internet nicht von vornherein gew&auml;hrleistet. Dort
          erzeugt jeder Mausklick eine oft personenbezogene Datenspur, deren Summe zu
          einem aussagekr&auml;ftigen Pers&ouml;nlichkeitsprofil wird und f&uuml;r
          vielf&auml;ltige Zwecke (z.B. Marketing, Auswahl unter Stellenbewerbungen,
          Observation von Personen) genutzt werden kann. Das Recht auf
          Anonymit&auml;t und der Schutz vor zwangsweiser Identifizierung sind in der
          realen Welt gew&auml;hrleistet (in keiner Buchhandlung k&ouml;nnen
          KundenInnen dazu gezwungen werden, einen Ausweis vorzulegen), werden aber
          im Netz durch Pl&auml;ne f&uuml;r eine umfassende Vorratsspeicherung von
          Verbindungsdaten massiv bedroht.</P>

          <P><B>5. Unabh&auml;ngige Evaluierung der Eingriffsbefugnisse der
          Sicherheitsbeh&ouml;rden</B></P>

          <P>Schon vor den Terroranschl&auml;gen des 11. September 2001 stand den
          deutschen Sicherheitsbeh&ouml;rden nach einer Reihe von Antiterror- und
          anderen Gesetzen gegen die Organisierte Kriminalit&auml;t ein breites
          Arsenal an Eingriffsbefugnissen zur Verf&uuml;gung, das
          Datensch&uuml;tzerInnen und B&uuml;rgerrechtlerInnen Sorgen bereitete.
          Durch die &uuml;bereilten Gesetzesversch&auml;rfungen der letzten Monate
          sind diese Befugnisse so erweitert worden, dass immer weniger
          Freir&auml;ume f&uuml;r unbeobachtete individuelle oder gesellschaftliche
          Aktivit&auml;ten und Kommunikation bestehen. Video&uuml;berwachung,
          Lauschangriff, Rasterfahndung, langfristige Aufbewahrung der Daten bei der
          Nutzung des Internet und der Telekommunikation, Zugriff auf Kundendaten und
          Geldbewegungen bei den Banken - unser Rechtsstaat wird zum
          Pr&auml;ventions- und &Uuml;berwachungsstaat. B&uuml;rgerliche
          Freiheitsrechte und Datenschutz werden immer mehr gef&auml;hrdet, der freie
          und offene demokratische Prozess droht von der Allgegenw&auml;rtigkeit
          staatlicher Kontrolle durch Polizei und Geheimdienste erstickt zu
          werden.</P>

          <P>Wir brauchen eine offene Diskussion dar&uuml;ber, wie der gebotene
          Ausgleich zwischen kollektiver Sicherheit und individuellen
          Freiheitsrechten wieder neu hergestellt werden kann. Dazu ist eine
          umfassende und systematische Evaluierung aller Eingriffsbefugnisse der
          Sicherheitsbeh&ouml;rden durch unabh&auml;ngige Stellen und an Hand
          objektiver Kriterien &uuml;berf&auml;llig. Sie muss aufzeigen, wo
          zur&uuml;ckgeschnitten werden muss, wo Instrumente untauglich sind oder wo
          die negativen Folgewirkungen &uuml;berwiegen.</P>

          <P><B>6. St&auml;rkung des Schutzes von Gesundheitsdaten</B></P>

          <P>Zwar sch&uuml;tzt die jahrtausendealte &auml;rztliche Schweigepflicht
          Kranke davor, dass Informationen &uuml;ber ihren Gesundheitszustand von
          denjenigen unbefugt weitergegeben werden, die sie medizinisch betreuen.
          Medizinische Daten werden aber zunehmend au&szlig;erhalb des besonderen
          Vertrauensverh&auml;ltnisses zwischen Arzt und Patient verarbeitet.
          Telemedizin und High-Tech-Medizin f&uuml;hren &uuml;berall zu umfangreichen
          automatischen Datenspeicherungen. Hinzu kommt ein zunehmender Druck,
          Gesundheitsdaten z.B. zur Einsparung von Kosten, zur Verhinderung von
          Arzneimittelnebenfolgen oder zur Qualit&auml;tssicherung einzusetzen. Die
          Informatisierung der Medizin durch elektronische Aktenf&uuml;hrung, Einsatz
          von Chipkarten, Nutzung des Internet zur Konsultation bis hin zur
          ferngesteuerten Behandlung mit Robotern ist nur zu verantworten, wenn auch
          die Instrumente zum Schutz von Gesundheitsdaten weiterentwickelt
          werden.</P>

          <P><B>7. Datenschutz und Gentechnik</B></P>

          <P>Die Entwicklung der Gentechnik ist atemberaubend. Schon ein
          ausgefallenes Haar, ein Speichelrest an Besteck oder Gl&auml;sern,
          abgesch&uuml;rfte Hautpartikelchen oder gar ein Blutstropfen im
          Taschentuch, mit dem eine kleine Wunde betupft wurde - dies alles eignet
          sich als Untersuchungsmaterial, um den genetischen Bauplan eines Menschen
          entschl&uuml;sseln zu k&ouml;nnen. Inzwischen werden Gentests frei
          verk&auml;uflich f&uuml;r Jedermann angeboten. Je mehr Tests gemacht
          werden, desto gr&ouml;&szlig;er wird das Risiko f&uuml;r jeden Menschen,
          dass seine Pers&ouml;nlichkeit von anderen auch gegen seinen Willen
          analysiert wird. Versicherungen oder ArbeitgeberInnen werden ebenfalls
          Testergebnisse erfahren wollen. Dies muss gesetzlich grunds&auml;tzlich
          ausgeschlossen werden; ein Gesetz zum datenschutzgerechten Umgang mit
          genetischen Daten ist dringend erforderlich. Niemand darf zu Gentests, die
          &uuml;ber die Identit&auml;tsfeststellung hinausgehen, gezwungen werden.
          Die Durchf&uuml;hrung eines Tests ohne Wissen und Wollen der betroffenen
          Person muss unter Strafe gestellt werden.</P>

          <P><B>8. Arbeitnehmerdatenschutz</B></P>

          <P>Pers&ouml;nlichkeitsrechte und Datenschutz sind im
          Arbeitsverh&auml;ltnis vielf&auml;ltig bedroht. Besch&auml;ftigtendaten
          werden in leistungsf&auml;higen Personalinformationssystemen gesammelt und
          zur Erstellung von Pers&ouml;nlichkeitsprofilen genutzt. Immer wieder kommt
          es zu schweren Eingriffen in das informationelle Selbstbestimmungsrecht der
          Arbeitnehmer: Das Arbeitsverhalten wird durch Videokameras &uuml;berwacht.
          Die Nutzung von e-mail und das Surfen im Internet am Arbeitsplatz werden
          protokolliert und vom ArbeitgeberInnen oft umfassend kontrolliert. Die
          Preisgabe von hochsensiblen pers&ouml;nlichen Informationen, etwa zum
          Gesundheitszustand, wird zur Voraussetzung f&uuml;r eine Einstellung
          gemacht - auch dann, wenn dies f&uuml;r die angestrebte T&auml;tigkeit ohne
          Bedeutung ist. Drogen-screening und psychologische Testverfahren werden
          ohne vorhergehende Aufkl&auml;rung oder gegen den Willen von
          Besch&auml;ftigten eingesetzt, Schranken sind hier bislang nur
          einzelfallweise durch die Arbeitsgerichte definiert worden. Der Bund
          k&uuml;ndigt seit vielen Jahren ein Arbeitnehmerdatenschutzgesetz an, das
          auch in der abgelaufenen Legislaturperiode nicht verabschiedet wurde. Es
          ist &uuml;berf&auml;llig, dass in einem Arbeitnehmerdatenschutzgesetz
          endlich klare gesetzliche Vorgaben geschaffen werden.</P>

          <P><B>9. Informationszugang er&ouml;ffnen - Transparenz schaffen</B></P>

          <P>Informationen sind die Entscheidungsgrundlage f&uuml;r selbstbestimmtes
          Handeln. Ihr Stellenwert gewinnt in der entstehenden Informations- und
          Wissensgesellschaft immer mehr an Bedeutung. Deutschland ist allerdings
          europaweit das Schlusslicht in Sachen Informationsfreiheit. Nur in
          Brandenburg, Berlin, Schleswig-Holstein und Nordrhein-Westfalen haben die
          Menschen bisher einen Rechtsanspruch auf Information. Auf Bundesebene ist
          ein solches Gesetz noch nicht zustande gekommen, die diskutierten
          Entw&uuml;rfe glichen mit ihren vielen Ausnahmen eher einem
          Informationsverhinderungsgesetz. Das im Bundesrat gescheiterte
          Verbraucherinformationsgesetz w&auml;re zwar ein Schritt in die richtige
          Richtung gewesen, h&auml;tte sich aber im Wesentlichen auf Informationen
          &uuml;ber Lebensmittel und Bedarfsgegenst&auml;nde beschr&auml;nkt sowie
          auf einen Informationsanspruch allein gegen&uuml;ber &ouml;ffentlichen
          Stellen.</P>

          <P><B>10. St&auml;rkung einer unabh&auml;ngigen, effizienten
          Datenschutzkontrolle</B></P>

          <P>Die deutschen Datenschutzbeh&ouml;rden haben bis heute nicht die
          "v&ouml;llige Unabh&auml;ngigkeit", die die Europ&auml;ische
          Datenschutzrichtlinie vorschreibt. In den meisten Bundesl&auml;ndern ist
          die Aufsicht &uuml;ber den Datenschutz bei Privatunternehmen nach wie vor
          bei den Innenministerien und nachgeordneten Stellen angesiedelt. Selbst in
          den F&auml;llen, in denen die Landesbeauftragten diese Aufgabe wahrnehmen,
          unterliegen sie zumindest einer Rechtsaufsicht der Regierung. Auch im
          &ouml;ffentlichen Bereich wird die Unabh&auml;ngigkeit h&auml;ufig durch
          die organisatorische Einbindung in Parlamentsverwaltungen oder Regierungen
          eingeschr&auml;nkt. Den Kontrollstellen fehlt die Befugnis, ihre
          Feststellungen gegen&uuml;ber den gepr&uuml;ften Stellen auch
          durchzusetzen. Die M&ouml;glichkeit, im privaten Bereich Bu&szlig;gelder zu
          verh&auml;ngen, reicht nicht aus, um rechtswidrige Datenverarbeitung zu
          verhindern, zumal f&uuml;r die Ahndung von Ordnungswidrigkeiten h&auml;ufig
          andere Beh&ouml;rden zust&auml;ndig sind.</P> <HR>

          <P>Am 26.August 2002 hat im Rahmen der Sommerakademie 2002 im Kieler
          Schloss zum Tagesthema <B>"Unser Recht auf Anonymit&auml;t"</B> Dr. Helmut
          B&auml;umler, Landesbeauftragter f&uuml;r den Datenschutz und Leiters des
          Unabh&auml;ngigen Landeszentrums f&uuml;r Datenschutz Schleswig-Holstein
          die Er&ouml;ffnungsrede gehalten.<BR> (gefunden:
          www.datenschutzzentrum.de/somak/):</P>

          <P>Als wir vor vielen Monaten dar&uuml;ber nachdachten, welches Thema wir
          f&uuml;r diese Sommerakademie w&auml;hlen sollten, haben wir lange
          gez&ouml;gert, uns f&uuml;r "Anonymit&auml;t" zu entscheiden. Wozu etwas
          Selbstverst&auml;ndliches hinterfragen, was gesellschaftlich auch ohne
          gro&szlig;e Diskussion breit anerkannt ist? Zu eindeutig erschien es uns zu
          sein, dass selbstverst&auml;ndlich jeder Mensch das Recht hat, sich auf
          Wunsch auch anonym zu verhalten. Obwohl - weder ein Blick in die
          Verfassung, noch in die Entscheidungen des Bundesverfassungsgerichts
          f&ouml;rderte auf die Schnelle etwas Einschl&auml;giges zu Tage. Immerhin
          hatte das Kammergericht Berlin schon 1987 kurz und b&uuml;ndig
          festgestellt: "Das allgemeine Pers&ouml;nlichkeitsrecht beinhaltet den
          Anspruch, in gew&auml;hlter Anonymit&auml;t zu bleiben und die eigene
          Person nicht in der &Ouml;ffentlich-keit dargestellt zu sehen."</P>

          <P>Wer allerdings ein Gesp&uuml;r f&uuml;r langfristige Entwicklungen hat,
          der kann die Behandlung eines Themas in den Medien wie ein Wetterleuchten
          drohender Gewitter deuten. Immer wieder gab es in den vergangenen Jahren
          gro&szlig; aufgemachte Berichte &uuml;ber einzelne Kriminalf&auml;lle im
          Internet, die nicht selten mit der unterschwelligen Botschaft gew&uuml;rzt
          waren, die Anonymit&auml;t im Internet sei ein N&auml;hrboden f&uuml;r
          Kriminalit&auml;t. Die Reaktion von Sicherheitspolitikern lie&szlig; nicht
          lange auf sich warten. Vermehrt gab es in den letzten Monaten
          Vorst&ouml;&szlig;e, das Recht auf Anonymit&auml;t im Internet aufzuheben
          und stattdessen eine Pflicht der Anbieter einzuf&uuml;hren, das
          Abrufverhalten der Nutzer zu protokollieren. Was man zun&auml;chst als
          bayerische Pflicht&uuml;bung im Bundesrat abtun konnte, zumal das
          g&uuml;ltige Teledienstedatenschutzrecht das genaue Gegenteil garantiert,
          n&auml;mlich ein Recht auf anonyme Internetnutzung, hatte sich im Juni 2002
          pl&ouml;tzlich zu einer Mehrheitsentscheidung des Bundesrates
          gemausert.</P>

          <P>So schnell kann es also, zumal in Wahlkampfzeiten, gehen, dass aus einer
          vermeintlich selbstverst&auml;ndlichen, gesicherten Rechtsposition Wachs in
          den H&auml;nden der Sicherheitspolitiker wird. Salopp gesagt, dank Herrn
          Beckstein haben wir bei der Sommerakademie 2002 pl&ouml;tzlich ein
          brandaktuelles Thema.</P>

          <P>Wenn wir &uuml;ber Anonymit&auml;t sprechen, dann fallen uns ganz
          unterschiedliche Assoziationen ein. Jetzt, so kurz vor der Bundestagswahl,
          ist uns vielleicht besonders gel&auml;ufig, dass die geheime und das
          hei&szlig;t im Grunde anonyme Stimmabgabe das Lebenselexier der Demokratie
          ist. Wir denken wom&ouml;glich auch an anonyme Spender, sagen wir f&uuml;r
          caritative Zwecke, anonyme Alkoholiker oder aber auch an anonyme
          Bombendrohungen. Anonymit&auml;t tr&auml;gt also wie so vieles den Keim des
          Positiven und des Negativen in sich. Der vor wenigen Wochen im Deutschen
          Bundestag diskutierte Plan, anonyme Geburten rechtlich abzusichern, zeigt
          die ganze Ambivalenz: Eine M&ouml;glichkeit f&uuml;r anonyme Geburten
          k&ouml;nnte vielleicht Babys das Leben retten, aber sie versperrt ihnen
          auch auf immer die M&ouml;glichkeit, N&auml;heres zu ihrer Abstammung zu
          erfahren. Mit der Anonymit&auml;t verh&auml;lt es sich nicht anders als mit
          vielen Dingen des Lebens: sie kann Segensreiches bewirken oder aber
          missbraucht werden.</P>

          <P>Gibt es nun ein Recht auf Anonymit&auml;t auf das sich jeder berufen
          kann? Ich bin gespannt, welche dogmatischen Grunderkenntnisse uns dazu Herr
          Professor Denninger vermitteln wird, aber eines scheint mir klar zu sein:
          wenn das Recht auf informationelle Selbstbestimmung das Recht bedeutet, im
          Grundsatz selbst zu entscheiden, wem gegen&uuml;ber man welche
          Informationen &uuml;ber sich selbst offenbaren m&ouml;chte, dann macht
          dieses Recht nur Sinn, wenn man sich auch daf&uuml;r entscheiden kann, gar
          nichts &uuml;ber sich zu offenbaren, also anonym aufzutreten. Die
          Rechtsordnung liefert einige Indizien daf&uuml;r, dass die namentliche
          Kennzeichnung nicht der voraussetzungslose Normalfall ist. Wie anders
          w&auml;re sonst zu erkl&auml;ren, dass es im Polizeirecht eigene
          Bestimmungen dar&uuml;ber braucht, unter welchen Voraussetzungen die
          Polizei die Identit&auml;t eines Menschen feststellen darf. Nach wie vor
          ist im &Uuml;brigen in Deutschland nach dem Pass- und Personalausweisgesetz
          niemand verpflichtet, Ausweise bei sich zu tragen, um allf&auml;llige
          Identifizierungen zu erleichtern.</P>

          <P>Jenseits aller juristischen Feinheiten sind es die meisten Menschen
          gewohnt, zwischen Offenheit und Lockerheit sowie Zur&uuml;ckhaltung und
          Anonymit&auml;t instinktiv und virtuos zu changieren. Jeder kennt
          Situationen, in denen er ausdr&uuml;cklich nicht erkannt werden
          m&ouml;chte, auch wenn er nichts Verbotenes oder gar Strafbares tut. Auch
          im Alltag genie&szlig;en wir es, dass wir &uuml;ber die Einkaufsmeile
          bummeln k&ouml;nnen, ohne dass wir ein Namensschild tragen m&uuml;ssen. Und
          wenn wir uns irgendwo ein Br&ouml;tchen oder eine Tasse Kaffee kaufen,
          w&uuml;rden wir den Verk&auml;ufer f&uuml;r ziemlich unversch&auml;mt
          ansehen, wenn er es zur Bedingung machen w&uuml;rde, zuvor unseren Namen zu
          erfahren. Deshalb m&ouml;chte ich auch dem E-Commerce nicht viel Chancen
          geben, wenn nicht Mittel und Wege gefunden werden, die K&auml;ufe des
          Alltags so anonym wie im gewohnten Alltag abzuwickeln. Ich bin mir sicher,
          dass unser Wirtschaftsminister, Herr Professor Rohwer, nachher auch auf
          diesen Aspekt eingehen wird.</P>

          <P>Die moderne Gesellschaft, in der wir nicht mehr in Kasten und
          Z&uuml;nften organisiert sind, sondern alle gleiche und freie B&uuml;rger
          sind, tr&auml;gt die Anonymit&auml;t gleichsam wie eine
          selbstverst&auml;ndliche Voraussetzung in sich. Wenngleich nicht in einem
          statischen Verst&auml;ndnis, denn die Frage, in welchen Situationen wir
          anonym auftreten, ja &uuml;berhaupt anonym bleiben wollen, unterliegt dem
          Wandel. Das sehen wir besonders deutlich in den Medien. Die fr&uuml;here
          Praxis, als Verschwiegenes und Intimes im Fernsehen nur zu sehen und zu
          h&ouml;ren war, wenn die Person unkenntlich gemacht war, wird mehr und mehr
          von der schrillen Selbstdarstellung abgel&ouml;st. Auffallen um jeden
          Preis, auch den der Selbstentbl&ouml;&szlig;ung, Freunde und
          Familienmitglieder inklusive, wahrgenommen werden in der anonymen Masse,
          ist vielen wichtiger als Diskretion.</P>

          <P>Aber sollten wir wegen ein paar &uuml;berdrehter Talkshows im Ernst das
          Recht auf Anonymit&auml;t als solches in Frage stellen? Sind wir schon so
          weit, dass derjenige, der nicht beobachtet werden will, eine
          Begr&uuml;ndung liefern muss und nicht derjenige, der beobachten will? Zu
          Recht warnt Frau Professor R&ouml;ssler in ihrem Buch &uuml;ber den "Wert
          des Privaten" vor der panoptischen Gesellschaft, die ihre Verwandtschaft
          mit dem panoptischen Gef&auml;ngnis nur schwerlich leugnen k&ouml;nne. Die
          M&ouml;glichkeit, sich anonym zu verhalten, ist, wenn ich Frau R&ouml;ssler
          richtig verstanden habe, mehr als nur die Verwirklichung eines abstrakten
          Rechtssatzes, den wir seit dem Volksz&auml;hlungsurteil bekanntlich etwas
          umst&auml;ndlich als das Recht auf informationelle Selbstbestimmung
          bezeichnen. Es geht darum, die Chancen f&uuml;r ein autonomes,
          selbstbestimmtes Leben zu erhalten, das, wie es Frau R&ouml;ssler
          formuliert hat "eine gewisse Stabilit&auml;t des Gef&uuml;ges von Wissen,
          Erwartungen und Kontrolle" voraussetzt.</P>

          <P>Wie viel von dieser Autonomie haben wir eigentlich noch? Es ist nicht
          nur der Gesetzgeber, der das Recht auf Anonymit&auml;t beschneidet, sondern
          auch die Entwicklung der Informationstechnik selbst. Dies l&auml;sst sich
          exemplarisch an der polizeilichen Identit&auml;tsfeststellung zeigen: etwa
          zur gleichen Zeit, als in den 80er Jahren intensiv und kontrovers
          dar&uuml;ber diskutiert wurde, ob es akzeptabel sei, der Polizei im
          Musterentwurf f&uuml;r ein einheitliches Polizeirecht die Befugnis
          einzur&auml;umen, jedermanns Identit&auml;t an gef&auml;hrlichen oder
          gef&auml;hrdeten Orten jederzeit festzustellen, wurde das Zentrale
          Verkehrsinformationssystem ZEVIS eingef&uuml;hrt. Es erm&ouml;glicht es
          technisch, zu jeder Tages- und Nachtzeit per Computerabfrage festzustellen,
          wessen Auto da gerade im ruhenden oder im flie&szlig;enden Verkehr
          unterwegs ist. Gewiss, der Halter ist nicht immer gleich der Fahrer, aber
          ZEVIS hat jedenfalls die M&ouml;glichkeiten einer heimlichen
          Identit&auml;tsfeststellung mit einer leidlich guten
          Trefferwahrscheinlichkeit betr&auml;chtlich erh&ouml;ht. &Auml;hnlich
          verh&auml;lt es sich mit vielen anderen Technikentwicklungen, bis hin zum
          IMSI-Catcher unserer Tage. Ubiquitous Computing wird dazu beitragen, dass
          wir &uuml;berall Datenspuren hinterlassen, ganz zu schweigen von der
          zunehmenden Installation von Videokameras oder gar von
          Beobachtungssatelliten aus dem Weltall. Die Maschinen, die unser Leben auf
          vielen Feldern erleichtern sollen, haben die Eigenheit, uns gleichsam wie
          stumme Zeugen zu beobachten und all unsere Bewegungen zu registrieren.</P>

          <P>Geradezu zu einem Generalangriff auf das Recht auf Anonymit&auml;t
          wollen nun aber diejenigen blasen, die die Internetprovider gesetzlich zur
          Protokollierung aller Zugriffe zwingen wollen. Als w&auml;re nicht die
          Anonymit&auml;t im Internet ohnehin durch Hacker und Datenhaie bedroht, als
          m&uuml;sste man nicht eigentlich die Internetnutzer dringend besser vor der
          Neugier anderer sch&uuml;tzen, als m&uuml;sste also nicht endlich den
          Garantien des Teledienstedatenschutzgesetzes auf anonyme Internetnutzung
          Geltung verschafft werden, droht nun die totale Rolle r&uuml;ckw&auml;rts.
          Unbeeindruckt vom Prinzip der Datenvermeidung und Datensparsamkeit im
          geltenden Bundesdatenschutzgesetz sollen nach den Vorstellungen der
          Mehrheit im Bundesrat alle Anbieter von Telekommunikations- und von
          Telediensten verpflichtet werden, das Verhalten ihrer Kunden aufzuzeichnen.
          Dann w&auml;re zum Beispiel nachvollziehbar, wer sich wof&uuml;r im
          Internet interessiert, wie lange er sich bei einem Thema aufh&auml;lt, was
          ihm vermutlich dabei eingefallen ist, denn man k&ouml;nnte ja anhand des
          Clickstreams sehen, was er als N&auml;chstes aufgerufen hat, usw. Was
          w&auml;re das etwas anderes als eine Art Gedankenpolizei?</P>

          <P>Dagegen wehren wir uns entschieden. Sie k&ouml;nnen sicher sein, meine
          Damen und Herren, dass die Kampagne des Unabh&auml;ngigen Landeszentrums
          f&uuml;r Datenschutz unter dem Motto "Rote Karte f&uuml;r
          Internetschn&uuml;ffler" keine Eintagsfliege ist. Wir werden an diesem
          Thema dran bleiben und versuchen, m&ouml;glichst viele Menschen
          dar&uuml;ber zu informieren, welch gravierender Eingriff in ihre Rechte da
          geplant ist. Zwar hat die Bundesregierung in ihrer Stellungnahme die
          Pl&auml;ne des Bundesrates zun&auml;chst abgelehnt. Das war so kurz vor der
          Bundestagswahl kaum anders zu erwarten. Die Begr&uuml;ndung f&uuml;r die
          Ablehnung ist f&uuml;r meinen Geschmack aber etwas d&uuml;nn ausgefallen.
          Ich w&uuml;rde nicht darauf wetten, dass die Bundesregierung in dieser
          Frage wirklich festgelegt ist. So oder so bleibt das Thema auf der
          Tagesordnung, es sei denn, Herr Staatssekret&auml;r Geiger kann gleich
          nachhaltig und auf Dauer Entwarnung geben.</P>

          <P>Es versteht sich von selbst, dass auch in unseren Augen die
          Anonymit&auml;t nicht schrankenlos gew&auml;hrleistet ist. Der Mensch als
          soziales Wesen tritt in Kontakt mit anderen und muss es sich gefallen
          lassen, dass andere sich f&uuml;r ihn interessieren. Wer in die Rechte
          anderer z. B. in sch&auml;digender Weise eingreift, hat kein Recht, anonym
          zu bleiben. Straft&auml;ter, die zun&auml;chst unter dem Deckmantel der
          Anonymit&auml;t ebenso wie &uuml;brigens unter Ausnutzung anderer
          Freiheitsrechte Straftaten begehen -Zwischenbemerkung: man denke nur an die
          Mobilit&auml;t des modernen Verbrechens: hat etwa je jemand auch nur im
          Ernst dar&uuml;ber nachgedacht, deshalb die freie Fahrt f&uuml;r freie
          B&uuml;rger einzuschr&auml;nken -, m&uuml;ssen damit rechnen, dass die
          Polizei sie enttarnt und zur Rechenschaft zieht.</P>

          <P>Hier beginnen die wirklich spannenden Fragen: wie schaffen wir es,
          Anonymit&auml;t zu wahren, die pr&auml;ventive Totalkontrolle der
          B&uuml;rger zu vermeiden und trotzdem beim Verdacht von Straftaten
          handlungsf&auml;hig zu bleiben? Dies ist einer der interessanten Aspekte,
          die wir im Rahmen unseres Projektes AN.ON, das sp&auml;ter noch n&auml;her
          vorgestellt wird, untersuchen. Ich m&ouml;chte die Polizei und andere
          Interessierte einladen, in einen konstruktiven Dialog mit uns einzutreten,
          wie wir mit intelligenten L&ouml;sungen Freiheit und Sicherheit zugleich
          erreichen k&ouml;nnten.</P>

          <P>Dabei tun wir alle uns sicher leichter, wenn wir zun&auml;chst die
          Fakten n&uuml;chtern analysieren. Tatsache ist, dass unser
          Anonymisierungsdienst AN.ON seit Betriebsaufnahme vor 13 Monaten ca. 1,2
          Millio-nen mal genutzt worden ist. In insgesamt nur 17 F&auml;llen gab es
          Nachfragen der Polizei, weil der Anfangsverdacht einer Straftat vorlag. Das
          ist in meinen Augen ein verschwindend geringer Prozentsatz, wenn man
          bedenkt, dass AN.ON wirklich Anonymit&auml;t garantiert. Da k&ouml;nnte man
          meinen, dass dies Kriminelle geradezu als Einladung betrachten
          k&ouml;nnten. Aus unseren Untersuchungen kann man, bei aller Vorsicht,
          vermutlich den Schluss ziehen, dass das Internet weit weniger
          kriminalit&auml;tsbelastet ist, als es die rei&szlig;erische
          Berichterstattung &uuml;ber einzelne Kriminalf&auml;lle Glauben machen
          k&ouml;nnte.</P>

          <P>Die Fragen, die mit der Anonymit&auml;t zusammenh&auml;ngen, ihrer
          Gew&auml;hrleistung und Sicherung einerseits und ihrer Einschr&auml;nkung
          und Relativierung andererseits, sind in Wirklichkeit die Kernfragen des
          Datenschutzrechts. Nicht erst seit unserer Sommerakademie 1996 unter dem
          Titel "Datenschutz durch Technik" wissen wir, dass ein effizienter
          Datenschutz nicht nur gute Gesetze, sondern auch eine ad&auml;quate
          Technikgestaltung braucht. Die Entwicklung der Informationstechnik
          beg&uuml;nstigt, ich erw&auml;hnte dies bereits, in vielf&auml;ltiger Weise
          die Entstehung von Datenspuren. Wir m&uuml;ssen diese Technik zur Hilfe
          nehmen, um f&uuml;r den Einzelnen die Risiken f&uuml;r sein
          Pers&ouml;nlichkeitsrecht &uuml;berschaubar und beherrschbar zu machen.
          Deshalb besch&auml;ftigen wir uns beim Unabh&auml;ngigen Landeszentrum
          f&uuml;r Datenschutz in Kiel schon seit geraumer Zeit mit dem Thema
          Identit&auml;tsmanagement und wir beabsichtigen, dies noch weiter zu
          intensivieren. Warum sollte eine Technik, die uns verspricht, so vieles
          "auf Knopfdruck" zu liefern, nicht im Stande sein, uns den selbstbewussten,
          situationsad&auml;quaten und sozial vertr&auml;glichen Umgang mit unserer
          Identit&auml;t zu erleichtern? Wir sehen in einem technikgest&uuml;tzten
          Identit&auml;tsmanagement jedenfalls ein wichtiges Datenschutzinstrument
          der Zukunft.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

