<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
<TITLE>BigBrotherAwards, Deutschland - 2001</TITLE>
</HEAD>

<BODY bgcolor="#ffffff" link="#000080" vlink="#000066" alink="#000066">
<A name="top"><FONT size="+1"><B>
<A href="javascript:history.back()">zur&uuml;ck</A> zum Artikel</B></FONT></A>

<CENTER>
<TABLE width="600" border="0" cellspacing="0">
<TR>
<TD colspan="5">
<CENTER>
<IMG src="bba/bba1.gif" width="395" height="94" alt="">
</CENTER>
</TD>
</TR>

<TR>
<TD>
<CENTER>
<H3><FONT color="#000066">Informationen zum Preistr&auml;ger der Kategorie
"Politik"</FONT></H3>
</CENTER>

<UL>

<LI> <FONT color="#000066">Die <B>Frankfurter Allgemeine
Sonntagszeitung</B> am 07.10.2001 zum Thema: <A href=
"#faz"><B>Wissenschaft</B></A></FONT></LI>

<LI> <FONT color="#000066">Die <B>Financial Times Deutschland</B> am
24.9.2001 zum Thema: <A href= "#ftd"><B>Otto Schily: Der rosarote
Kanther</B></A></FONT></LI>

<LI> <FONT color="#000066"><B>telepolis</B> am 12.10.2001 zum Thema:
<A href="#tp"><B>Schilys Geheimplan im Kampf gegen den
Terrorismus</B></A></FONT></LI>
</UL>
</TD>
</TR>

<TR>
<TD>
<FONT color="#000066"><A name="faz"></A></FONT>
<HR>

<CENTER>
<H3>Wissenschaft</H3>
</CENTER>

<P>Bundesinnenminister Otto Schily ist guten Mutes: Die Rasterfahndung sei
"sehr erfolgstr&auml;chtig". Erstaunlicher Optimismus spricht da aus ihm.
Denn zur Zeit ist die Methode noch eher schw&auml;chlich. Die Kriterien,
die in Hessen in die Rasterfahndung eingehen, sind das beste Beispiel. Laut
Beschlu&szlig; des Amtsgerichts Wiesbaden, das die Kriterien festlegt, wird
nach Personen zwischen 18 und 40 Jahren mit "islamischer
Religionszugeh&ouml;rigkeit" gefahndet, bei denen zus&auml;tzlich folgendes
erf&uuml;llt ist: "Meldeanschrift Hessen", "Student oder ehemaliger Student
in Hessen", "legaler Aufenthaltsstatus ohne r&auml;umliche
Beschr&auml;nkung", "keine kriminalpolizeilichen Erkenntnisse", "keine
eigenen Kinder" und "finanziell autark", au&szlig;erdem Herkunft aus einem
von 21 ausgew&auml;hltenL&auml;ndern (von Marokko bis Indonesien).</P>

<P>Die Liste zeigt das Prinzip: Die Fahnder erhalten Zugriff auf
Personen-Datenbanken bei &ouml;ffentlichen und privaten Stellen. Sie
&uuml;bernehmen diese Daten in ihr eigenes Computersystem - ein aufwendiger
Akt, wenn Datenformate angeglichen werden m&uuml;ssen. In den gesammelten
Daten werden Eintr&auml;ge gesucht, die der Kriterienliste entsprechen. Die
Methode soll auf Personen hinweisen, die sodann mit traditionellen Mitteln
beleuchtet werden k&ouml;nnen. Doch es ist kaum anzunehmen, da&szlig; die
Fahndungskriterien befriedigende Ergebnisse bringen werden: Sie sind zu
unspezifisch.</P>

<P>Der Beschluss wurde offenbar "in gro&szlig;er Eile und wenig reflektiert
zusammengeschrieben", sagt der Frankfurter Strafrechtsanwalt Walther Graf,
der 1997 mit einer Evaluationsstudie &uuml;ber "Rasterfahndung und
organisierte Kriminalit&auml;t" promovierte und als einer der wenigen nicht
im Kriminaldienst t&auml;tigen Experten auf dem Gebiet gelten darf.
Insbesondere der Kriterienkatalog sei "eine Katastrophe", befindet Graf.
Das Profil sei so unscharf, da&szlig; es am Ende "alle m&auml;nnlichen
Studenten islamischen Glaubens" ermittle. Die Religionszugeh&ouml;rigkeit
sei ein Kriterium von zweifelhafter Leistungsf&auml;higkeit: Beh&ouml;rden
erfassen in der Regel nur, ob katholische oder evangelische Konfession und
damit die Pflicht zur Kirchensteuerleistung besteht. Sinnvoller ist das
Kriterium der "nicht nachvollziehbaren, unregelm&auml;&szlig;igen
Zahlungseing&auml;nge auf ein Konto".</P>

<P>Doch ob diese Zahlungen stattfinden, k&ouml;nnen die Beh&ouml;rden
derzeit nicht &uuml;berpr&uuml;fen. Der hessische Beschlu&szlig;
ber&uuml;cksichtigt die Daten der Meldebeh&ouml;rden, Universit&auml;ten
und des Luftfahrtbundesamtes, nicht aber die der Banken. Ob eine Person
Geld von Bin Ladin erh&auml;lt, dar&uuml;ber gibt die Rasterfahndung keinen
Aufschlu&szlig;; das k&ouml;nnte freilich anders werden, wenn die von
Bundesfinanzminister Hans Eichel (SPD) angestrebte Kontenkontrolle
durchgesetzt wird. Banken k&ouml;nnten mithelfen, indem sie Software
einsetzen, die Kundenprofile mit Kontenbewegungen vergleicht und
Ungew&ouml;hnliches meldet. Die heutige Rasterfahndung jedenfalls
f&ouml;rdert im Prinzip nur Triviales zutage - und l&auml;&szlig;t
wesentliche Fragen offen: Welche Querverbindungen gibt es zwischen
einzelnen Personen? &Uuml;ber welche Kommunikationsmittel werden sie
gepflegt? Daten aus Telekommunikationsverbindungen k&ouml;nnten da
gr&uuml;ndlichere Auskunft geben. Die f&uuml;r die Ermittlung solcher
Strukturen benutzten Software-Werkzeuge m&uuml;&szlig;ten freilich - im
Unterschied zu den simplen Raster-Datenbanken - ein Modell der Verbindungen
darstellen k&ouml;nnen, etwa als Grafik auf dem Bildschirm. Nur wenige
Landeskriminal&auml;mter verf&uuml;gen &uuml;ber moderne Fahndungssoftware.
Sie leistet mehr, als nur Datens&auml;tze mit einem logischen Und-Operator
zu verkn&uuml;pfen: Sie erlaubt es beispielsweise, in den Datenhaufen mit
unscharfer Logik ("fuzzy logic") zu suchen, also grobe &Auml;hnlichkeiten
aufzusp&uuml;ren. Man kann auch ein Datenbank-Objekt ausw&auml;hlen -im
Fall der Terroristenfahndung w&auml;re dies ein T&auml;terprofil - und
quantitativ festlegen, welche seiner Kriterien einem wie bedeutsam
erscheinen; die anschlie&szlig;ende Suche zeigt dann eine Hitliste der
interessantesten Objekte. Solch ein Programm kann auch eine Vielzahl
relationaler Datenbanksysteme direkt ansprechen, also die heute
g&auml;ngige Art von Programmen, die mit komplex verkn&uuml;pften Daten
umgehen. Alle Objekte lassen sich sodann als Netz- oder Baumstrukturen auf
dem Bildschirm darstellen. Die nun genehmigten Budgets f&uuml;r
Anti-Terror-Ma&szlig;nahmen erlauben den Landeskriminal&auml;mtern erstmals
nach vielen Jahren, moderne Technik anzuschaffen und das n&ouml;tige
Personal anzuwerben. Wolfgang Dicke, Gesch&auml;ftsf&uuml;hrer der
Gewerkschaft der Polizei, bedauert es, da&szlig; "erst Ereignisse wie der
11. September die verantwortlichen Politiker dazu bewegt haben, unsere
jahrelangen Forderungen zu erf&uuml;llen". Bis die neue Technik
einsatzbereit ist, wird jedoch noch einige Zeit vergehen. Man mu&szlig;
schlie&szlig;lich auch lernen, damit umzugehen. Und von fortgeschrittenen
Methoden wie etwa Data Mining - mit dem Marketingspezialisten gro&szlig;er
Unternehmen heute die lohnenden Kundenprofile von den weniger
eintr&auml;glichen unterscheiden - sind die Fahnder noch immer weit
entfernt.</P>

<P>Im Vergleich zu Hessen scheint Berlin das Primitivwerkzeug
Rasterfahndung wenigstens etwas intelligenter einzusetzen. Laut
Beschlu&szlig; des Amtsgerichts Tiergarten wird man dort erstens mehr Daten
erheben, zweitens aber im Datenabgleich mit strengeren Kriterien arbeiten.
Berlin verlangt nicht wie Wiesbaden die Daten von Personen aus 21
islamischen L&auml;ndern, sondern nur aus 15. Zudem will es nach "reger
Reiset&auml;tigkeit", "h&auml;ufigen Visabeantragungen" und
"Mehrsprachigkeit" filtern. Allerdings, so gibt Walther Graf zu bedenken,
sei es bei ausl&auml;ndischen Studenten &uuml;blich und daher nicht
kriminalistisch interessant, da&szlig; sie au&szlig;er der Muttersprache
noch andere Sprachen beherrschen. Immerhin befragen die Berliner neben
Luftfahrtschulen auch zahlreiche private Stellen, die kritische
Infrastruktur verwalten: Ver- und Entsorgungsunternehmen, Hersteller und
H&auml;ndler von chemischen, biologischen und radiologischen
Gefahrenstoffen, Verkehrsbetriebe, Kommunikationsdienstleister,
Sicherheitsdienste, Catering- und selbst Reinigungs-Firmen. Auf diese Weise
konnten die Berliner Fahnder bereits aus&nbsp;&nbsp;45000 Studenten 23
Personen herausfiltern, die sie dann verh&ouml;rten. Der Strafrechtler
Walther Graf bleibt trotzdem skeptisch: "Die Methode verspricht viel und
h&auml;lt wenig." F&uuml;r die Terrorismusbek&auml;mpfung sei sie "nicht
geeignet".</P>

<P>Der einzige Erfolg, den die Terroristenj&auml;ger mittels Rasterfahndung
erzielen konnten, war Graf zufolge die Festnahme des RAF-Terroristen Rolf
Hei&szlig;ler am 9. Juni 1979. Er wurde 1982 zu lebenslanger Haft
verurteilt; am 26. Oktober dieses Jahres will man ihn entlassen. Auch im
Kampf gegen die organisierte Kriminalit&auml;t erwies sich die
vielger&uuml;hmte Methode als nur von begrenztem Nutzen. Als das bayerische
Landeskriminalamt im Januar 1993 mit einer Rasterfahndung auf Mafia-Jagd
ging, verlief die Aktion offenbar im Sande: Damals ermittelte das
Einwohnermeldeamt M&uuml;nchen alle m&auml;nnlichen Einwohner italienischer
Staatsangeh&ouml;rigkeit, die &auml;lter als 18 Jahre waren und entweder in
Agrigent oder in Palma de Montecherio auf Sizilien geboren wurden. Die
Daten glich das LKA mit den Datenbest&auml;nden des polizeilichen
Informationssystems Inpol ab. &Uuml;brig blieben 80 Personen, deren Daten
der italienischen Polizei &uuml;bergeben wurde. Diese &uuml;berpr&uuml;fte,
ob eine Person einem Mafia-Clan angeh&ouml;rte. Von einem brauchbaren
Ergebnis h&ouml;rten die Bayern nie etwas. Im Juli 1993 wurde die
Trefferliste vernichtet.</P>

<P>Bundesinnenminister Schily irrt daher, wenn er an schnelle Erfolge
glaubt. Erst eine umfassende &Uuml;berwachung der Telekommunikation
k&ouml;nnte die "Schl&auml;fer" enttarnen - vielleicht. Die
Kommunikationskontrolle w&auml;re indes ein schwerer Eingriff in
Grundrechte. Sie m&uuml;&szlig;te dem Prinzip der
Verh&auml;ltnism&auml;&szlig;igkeit gen&uuml;gen, und zu ihm z&auml;hlen
Juristen das Kriterium der Notwendigkeit. An dieser Stelle k&ouml;nnte die
Begr&uuml;ndung schwerfallen. Wer die Fahndung verbessern will, mu&szlig;
in erster Linie in Ausbildung und Anzahl des Personals investieren. Hier
bleibt am meisten zu tun.</P> </TD> </TR>

<TR>
<TD width="600" align="right"><FONT size="2"><B>
<A href="#top">Seitenanfang</A></B></FONT></TD>
</TR>

<TR>
<TD>
<FONT color="#000066"><A name="ftd"></A></FONT>
<HR>

<CENTER>
<H3>Otto Schily: Der rosarote Kanther</H3>
</CENTER>

<P>Er ist Sheriff, Sch&ouml;ngeist und ein uns&auml;glicher Tyrann. Vor
allem aber ist Otto Schily Schr&ouml;ders wichtigster Mann vor der
Bundestagswahl.</P>

<P>Es war eine Antwort wie ein Schlangenbiss - kurz und gezielt: "Artikel
87a des Grundgesetzes", zischte Otto Schily seinem Gegner Rudolf Scharping
entgegen. Ihr Streit: Soll die Bundeswehr mithelfen, Terror in Deutschland
zu verhindern? Das widerspreche der Verfassung, mahnte Scharping. Otto
Schily, Bundesinnenminister und Jurist, sieht das anders -Artikel 87a eben.
Steht alles drin. Wenn Scharping will, kann er&rsquo;s ja nachlesen. Schily
hasst es, wenn man ihm widerspricht. Er ist Rechtsgelehrter, er hat Recht -
auch wenn viele Juristen seine Interpretation des Artikels 87a
bezweifeln.</P>

<P>Das Feuer brennt noch in Schily. Eigentlich wollte er 2002 mit 70 Jahren
aufh&ouml;ren. Macht er aber nicht. Bundeskanzler Schr&ouml;der braucht ihn
noch. Er braucht ihn jetzt, wo die Deutschen nach dem Terror in den USA die
Angst packt. Er braucht ihn morgen, also bei der n&auml;chsten
Bundestagswahl. Da wird Schily zum wichtigsten Mann im Kabinett. Er deckt
den rechten Rand ab, er zeigt den Leuten, dass auch die Sozialdemokraten
das Land sicher machen k&ouml;nnen. Er strahlt Seriosit&auml;t aus,
H&auml;rte und Sachverstand. Er ist der Sheriff.</P>

<P>Dieser Mann kann den harten Jungs aus der CSU Paroli bieten. Edmund
Stoiber wei&szlig; nicht mehr, ob er lachen oder weinen soll. Seine
Parteifreunde finden Otto ziemlich gut: Bei der Debatte &uuml;ber die
Terroranschl&auml;ge in den USA haben die Unions-Abgeordneten Schily
begeistert applaudiert.</P>

<P>Seine alten Weggef&auml;hrten von den Gr&uuml;nen waren da ruhiger.
"Otto Schily &auml;hnelt immer mehr einem Innenminister Kanther und nicht
einem Otto Schily, wie er einmal war", sagte der gr&uuml;ne
Europaabgeordnete Daniel Cohn-Bendit nach dem G8-Gipfel in Genua. Dort
hatte Schily nach den Stra&szlig;enschlachten gegen die
Globalisierungsgegner Front gemacht.</P>

<P>Sie lieben ihn nicht, die Gr&uuml;nen und die Sozialdemokraten, im
Gr&uuml;ppchen nennen sie ihn den "rosaroten Kanther", doch das sei
eigentlich viel zu freundlich f&uuml;r ihn, sagen einige. Kaum einer von
Schilys Untergebenen will seinen Namen nennen, wenn er &uuml;ber ihn
spricht. Denn Otto Schily f&uuml;hrt nicht, Schily herrscht. K&ouml;nig
Otto, Herr &uuml;ber Verfassungsschutz und Polizei. Er gilt als
"aufbrausend" und "rechthaberisch". Er habe " Schwierigkeiten, Leuten zu
vertrauen".</P>

<P>Der FDP-Innenexperte Max Stadler mutma&szlig;t, wieso dies so ist:
"Schily ist keiner, der andere mitnimmt bei seinen &Uuml;berlegungen." Es
erstaune ihn, wie unsensibel Schily gegen&uuml;ber den Gr&uuml;nen
versuchte, das Zuwanderungsgesetz durchzuziehen: "Das h&auml;tte Kanther
nie gemacht, einen Gesetzentwurf &ouml;ffentlich zu pr&auml;sentieren, ohne
ihn mit dem Koalitionspartner abzustimmen."</P>

<P>Schily tut's - er muss nicht jedermanns Liebling sein: Wenn er die
Lippen und die blauen Augen zusammenkneift, sein Gegen&uuml;ber fixiert,
wei&szlig; man, gleich watscht er wieder ab. Dann hebt er den Zeigefinger
und spricht mit eiskalter Stimme. Schily zeigt kein Temperament, er zeigt
Arroganz und Selbstwertgef&uuml;hl. Egal, wer ihm querkommt -Scharping, ein
Staatssekret&auml;r oder ein Mitarbeiter.</P>

<P>Manche kommen ihm &ouml;fter quer: Die Gr&uuml;nen-Chefin Claudia Roth
verspottet Schily gerne als Gutmenschen. Oder belehrt sie vor laufender
Kamera, etwa mit einer Sentenz Wilhelm von Humboldts: "Sicherheit ist die
Voraussetzung von Freiheit."</P>

<P>Die Bundesjustizministerin Herta D&auml;ubler-Gmelin ist eine der
wenigen, die offen Sympathie f&uuml;r Schily zeigt: "Der macht seinen Job
wirklich gut", sagt sie, und Fragen nach Schilys bisweilen eisenharter
Politik beantwortet sie mit dem Satz: "Ich mag den Otto Schily."</P>

<P>Viele Linke in Deutschland sagen eher das Gegenteil. Sie werfen ihm
Verrat vor, namentlich seinen Wandel vom Anwalt der RAF in den 70er Jahren
zum heutigen Law-and-Order-Innenminister.</P>

<P>Doch war es wirklich eine Verwandlung? Es war eher eine Entwicklung -
drei bekannte Fotos verdeutlichen dies. Das erste Bild stammt von 1974.
Schily steht neben seinem Freund, dem Studentenf&uuml;hrer Rudi Dutschke,
am Grab des Terroristen Holger Meins. Das zweite Bild zeigt Schily Anfang
der 80er Jahre. Er nimmt mit Heinrich B&ouml;ll in Mutlangen an einer
Sitzblockade gegen den Nato-Doppelbeschluss teil; Polizisten tragen den
damaligen Gr&uuml;nen-Politiker weg. Das dritte Foto, aufgenommen im
Februar 2001, zeigt den Bundesinnenminister zusammen mit
Bundesgrenzsch&uuml;tzern. Schily tr&auml;gt einen Polizeihelm und schwingt
stolz einen Schlagstock.</P>

<P><B>Keine radikale Ver&auml;nderung</B></P>

<P>Bei allem Kontrast - die Bilder zeigen auch, dass sich Schily vielleicht
gar nicht so radikal ver&auml;ndert hat, wie viele glauben: Auf allen Fotos
ist er gutb&uuml;rgerlich gekleidet, mit Anzug und Krawatte - ob er neben
Dutschke steht oder sich von der Polizei wegtragen l&auml;sst. Und auf
allen Bildern wirkt er deplatziert, er geh&ouml;rt einfach nicht richtig
dazu: nicht zur RAF-Trauergemeinde, nicht zur Friedensdemo und nicht zur
Polizeitruppe.</P>

<P>Das ist es, das hat sich nicht ge&auml;ndert: "Wo Otto Schily ist, ist
er fremd", sagt seine ehemalige Parteifreundin Antje Vollmer. Der
Gr&uuml;ne Christian Str&ouml;bele, ehemals ebenfalls RAF-Anwalt, sagt:
"Schily war nie ein Linksextremer". Und er erg&auml;nzt: "Schily war ein
exzellenter Strafverteidiger."</P>

<P>Schilys Fragetechnik beim Prozess gegen das RAF-Mitglied Horst Mahler
hatte den als Zeugen geladenen Verleger Axel Springer zu dem Urteil
gebracht: "Der Mann ist gro&szlig;artig. Schade, dass er auf der anderen
Seite steht." Doch auf welcher Seite war er wirklich? Schily war
&uuml;berall und nirgends: In den 70er Jahren sahen die Konservativen in
ihm einen Linksextremen; bei den Linken galt er als b&uuml;rgerlicher
Liberaler. Schily bezeichnete sich damals als "Liberaler Kommunist".</P>

<P>Kurz darauf trat er bei den Gr&uuml;nen ein. 1983 geh&ouml;rt er zur
ersten gr&uuml;nen Bundestagsfraktion, wo er seine Rolle als Reizfigur
kultivierte. In der Fraktion war er mit seinen extremen Realo-Positionen
von Anfang an isoliert. Ende 1989 h&auml;lt er es nicht mehr aus und
wechselt zur SPD.</P>

<P>Dort ergeht es ihm zun&auml;chst nicht besser. Die Genossen von der
bayerischen SPD waren nicht besonders froh &uuml;ber den Quereinsteiger und
geben ihm Platz 21 auf der Liste. Von 1990 an sitzt er vier Jahre lang als
Hinterb&auml;nkler im Bundestag - eine Schmach. Nach einer angemessenen
Quarant&auml;nezeit darf Schily Karriere machen und wird stellvertretender
Fraktionschef. Bald macht er sich als SPD-Unterh&auml;ndler f&uuml;r den
Gro&szlig;en Lauschangriff stark - wof&uuml;r ihn die eher linken
bayerischen Genossen mit Listenplatz 29 abstrafen.</P>

<P>Otto Schilys gro&szlig;e Stunde schl&auml;gt im Oktober 1998: Er wird
Innenminister, bekommt einen der wichtigsten Posten im Kabinett. Seitdem
wandelt sich der einstige Liberale immer mehr zum Bef&uuml;rworter von "Law
and Order". Er spricht das b&ouml;se Wort von der "Grenze der
Belastbarkeit", die beim Zuzug von Ausl&auml;ndern &uuml;berschritten sei.
Er genie&szlig;t den Tabubruch und vermutet bei seinen Widersachern im
rot-gr&uuml;nen Lager "Wonnen der Emp&ouml;rung".</P>

<P>Die d&uuml;rften seine ehemaligen gr&uuml;nen Parteifreunde auch
f&uuml;hlen, wenn sie Schily in diesen Tagen zuh&ouml;ren: Er verlangt
weniger Datenschutz und strengere Asylgesetze.</P>

<P>Bei Koalitionsrunden zur Zuwanderung kanzelt er die Gr&uuml;nen
regelm&auml;&szlig;ig ab. Spitzengr&uuml;ne wie Kerstin M&uuml;ller staucht
er vor laufender Kamera zusammen. In diesen Momenten zeigt sich, dass da
noch Wunden sind, alte Wunden. Nie haben ihm die Gr&uuml;nen den Rang, den
Respekt gegeben, der ihm, Otto Schily, zugestanden h&auml;tte.</P>

<P>Daf&uuml;r muss nun die Bundesausl&auml;nderbeauftragte Marieluise Beck
b&uuml;&szlig;en, der Schily mit Verachtung begegnet. Auch die Chefin der
Gauck-Beh&ouml;rde, Marianne Birthler, bekam einiges ab. Sie wollte gegen
den Willen Schilys Stasi-Akten Prominenter der &Ouml;ffentlichkeit
zug&auml;nglich machen. Er warf der Gr&uuml;nen "Renitenz" vor. Ein Schily
duldet keinen Widerspruch. Wer nicht seiner Meinung ist, der ist dumm. Das
ist seine &Uuml;berzeugung. Und das, so sagen rote wie gr&uuml;ne
Abgeordnete, macht es so schwer, sich mit ihm zu einigen.</P>

<P>Schily, der Despot - f&uuml;r Au&szlig;enstehende scheint das nicht zu
passen. Zeigt er sich doch gerne als Gro&szlig;b&uuml;rger und Feingeist.
Liest Novellen von Pirandello und gibt mit seiner Tochter Jenny, einer
Schauspielerin, in Berlin Rezitationsabende. Besonders gef&auml;llt sich
Schily in der Rolle des Anthroposophen. Schon sein Vater, ein
H&uuml;ttendirektor, hielt viel von der anthroposophischen Einteilung der
Welt in Gut und B&ouml;se. Das l&auml;sst Schily nicht los: Vor kurzem, bei
"Sabine Christiansen" schwadronierte er &uuml;ber das B&ouml;se, das sich
"Geist und Seele" der Terroristen bem&auml;chtigt habe. "Das B&ouml;se"
gelte es zur&uuml;ckzudr&auml;ngen. Das bringt ihm das Vertrauen des
Kanzlers und den Respekt der Konservativen. Schon ist von einem Trio
Infernale die Rede - gemeint sind Schily und der bayerische Innenminister
G&uuml;nther Beckstein, CSU, und der saarl&auml;ndische
Ministerpr&auml;sident Peter M&uuml;ller, CDU.</P>

<P>Die drei trafen sich mehrmals, um das Zuwanderungsgesetz vorzubereiten.
Beckstein lobte Schily einmal sogar mit den Worten: "Der ist bei mir in die
Lehre gegangen." Das hat den Schily ge&auml;rgert. Nicht weil er sich
politisch von Beckstein distanzieren m&ouml;chte, sondern weil er sich als
Lehrherr sieht, nicht als Lehrling.</P>

<P><B>Sp&auml;tentwickler</B></P>

<P><I>Vorfahren:</I> Die pr&auml;gende Erinnerungen von Otto Schily ist,
dass Nationalsozialisten in das Haus der Schilys drangen und B&uuml;cher
beschlagnahmten, weil seine Eltern Anthroposophen waren. Zu seinen Ahnen
geh&ouml;ren der Dichter und Komponist Peter Cornelius sowie der Anwalt
Victor Schily, der ein Freund von Karl Marx war.</P>

<P><I>Werdegang:</I> Schily studierte in Hamburg, M&uuml;nchen und Berlin
Jura und Politische Wissenschaften. 1963 lie&szlig; er sich als Anwalt in
Berlin nieder.</P>

<P><I>Wirken:</I> Bekannt wurde Schily als RAF-Anwalt. Im Stammheimer
Prozess war er Vertrauensanwalt von Gudrun Ensslin. Er bezeichnete sich als
"politischer Sp&auml;tentwickler" und war bei den Gr&uuml;nen, bevor er zur
SPD ging.</P>

<P>Innenminister</P>

<P><I>Terror:</I> Der Bundesinnenminister ist zust&auml;ndig f&uuml;r die
Wahrung der inneren Sicherheit. Polizei und Verfassungsschutz unterliegen
seiner Verantwortung. Mit der Erg&auml;nzung des Anti-Terrorgesetzes
reagierte er auf die Anschl&auml;ge in den USA.</P>

<P><I>Zuwanderung:</I> Schily hat seine Absicht bekr&auml;ftigt, das
Zuwanderungsgesetz noch in dieser Legislaturperiode zu verabschieden. Um
eine Mehrheit zu finden, ist er der Union zum Leidwesen der Gr&uuml;nen in
seinem Entwurf deutlich entgegengekommen.</P>

<P><I>Staatsb&uuml;rgerschaftsrecht:</I> Als erste gro&szlig;e Reform der
rot-gr&uuml;nen Regierung hat Schily das seit 1913 geltende
Staatsb&uuml;rgerschaftsrecht erneuert.</P>
</TD>
</TR>

<TR>
<TD width="600" align="right"><FONT size="2"><B>
<A href="#top">Seitenanfang</A></B></FONT></TD>
</TR>

<TR>
<TD>
<FONT color="#000066"><A name="tp"></A></FONT>
<HR>

<CENTER>
<H3>Schilys Geheimplan im Kampf gegen den Terrorismus</H3>
</CENTER>

<P>Der Bundesinnenminister r&uuml;ttelt mit seinem zweiten
Anti-Terror-Paket an den Grundfesten des Rechtsstaats und stellt alle
B&uuml;rger unter Generalverdacht</P>

<P>W&auml;hrend das erste Anti-Terror-Paket der Bundesregierung gerade
durch die Gremien wandert ( Das Rennen um die innere Sicherheit [0]), hat
Bundesinnenminister Otto Schily schon sein zweites B&uuml;ndel
geschn&uuml;rt. Darin geht es vor allem um eine deutliche Ausweitung der
Macht des Bundeskriminalamts, das in Zukunft den Terrorismus bereits
"vorbeugend" bek&auml;mpfen und ohne Verdachtsmomente ermitteln k&ouml;nnen
soll. Der Schritt zum Geheimdienst w&auml;re damit nicht mehr gro&szlig;.
Auch der Bundesverfassungsschutz soll ungehemmt schn&uuml;ffeln
d&uuml;rfen. Vorgesehen sind zudem tiefe Einschnitte ins Ausl&auml;nder-
und Asylrecht.</P>

<P>Das &nbsp;Bundesinnenministerium [1] hat ein weiteres Anti-Terror-Paket
vorbereitet, mit dem die Ermittlungsbefugnisse des Bundeskriminalamts (
&nbsp;BKA [2]), des Bundesgrenzschutzes ( &nbsp;BGS [3]) sowie des
&nbsp;Verfassungsschutzes [4] deutlich ausgeweitet und
verdachtsunabh&auml;ngige Recherchen m&ouml;glich werden sollen.</P>

<P>Der ausf&uuml;hrliche, sich noch in der Abstimmung befindliche
"Gesetzesentwurf zur Bek&auml;mpfung des internationalen Terrorismus", der
Telepolis bereits vorliegt und Ende Oktober auf der Agenda des
Bundeskabinetts steht, soll die Grundlagen schaffen f&uuml;r die Aufnahme
von Fingerabdr&uuml;cken in P&auml;ssen, "Sky-Marshals" des BGS an Bord von
Verkehrsflugzeugen bringen und Banken gegen&uuml;ber dem Verfassungsschutz
auskunftspflichtig machen. Ausl&auml;nder m&uuml;ssten bei Inkrafttreten
der &Auml;nderungen auf deutlich sch&auml;rfere Kontrollen gefasst
sein.</P>

<P>Der in einzelne Artikel unterteilte Vorsto&szlig; formuliert nach
Ansicht des Innenministeriums "die gesetzlichen Voraussetzungen zur
Verbesserung des Informationsaustausches sowie der Schaffung notwendiger
identit&auml;tssichernder Ma&szlig;nahmen, die f&uuml;r eine entschlossene
aber auch wirkungsvolle Bek&auml;mpfung des internationalen Terrorismus
dringend erforderlich sind." Betroffen sind die Inhalte von insgesamt elf
Gesetzen und Verordnungen: Die Palette reicht vom BKA-Gesetz &uuml;ber das
Bundesverfassungsschutzgesetz, das Passgesetz oder das Ausl&auml;ndergesetz
bis hin zu Ausl&auml;nderdateienverordnung.</P>

<P>Der von Bundesinnenminister Otto Schily entworfene
Ma&szlig;nahmenkatalog, der Bund und L&auml;ndern erhebliche Mehrkosten
aufb&uuml;rden w&uuml;rde, r&uuml;hrt an den Grundfesten rechtsstaatlicher
Prinzipien. So dringt der SPD-Politiker darauf, dass BKA-Ermittler in
Zukunft ohne strafprozessualen Anfangsverdacht und verst&auml;rkt auch
verdeckt t&auml;tig werden k&ouml;nnen. Konkret plant Schily, einen neuen
&sect; 7a ins Bundeskriminalamtgesetz ( &nbsp;BKAG [5]) einzuf&uuml;hren.
Demnach soll das Bundeskriminalamt "zur Feststellung, ob zureichende
tats&auml;chliche Anhaltspunkte f&uuml;r eine Straftat vorliegen, in den
F&auml;llen, in denen es f&uuml;r die Strafverfolgung nach &sect; 4 Absatz
1 zust&auml;ndig ist, personenbezogene Daten erheben sowie weitere
Ma&szlig;nahmen durchf&uuml;hren" k&ouml;nnen.</P>

<P>Was sich zun&auml;chst unspektakul&auml;r anh&ouml;rt, f&uuml;hrt seit
Jahren zu heftigen Diskussionen unter Juristen und k&ouml;nnte die
Arbeitsweise des BKA an die Methoden von Geheimdiensten ann&auml;hern.
Bisher d&uuml;rfen Kriminalbeamte in der Regel nur ihre Arbeit aufnehmen,
wenn eine deutliche Gefahr f&uuml;r ein Rechtsgut erkennbar ist. Auch der
Staatsanwalt kann nur ermitteln, wenn ein erster Verdacht vorliegt.</P>

<P><B>Jeder ist in Verdacht</B></P>

<P>Derlei Regelungen sind zur Begrenzung der Befugnisse der
Strafverfolgungs- und Justizbeh&ouml;rden ins Polizeirecht eingef&uuml;gt
worden. Eine Lockerung dieser Grunds&auml;tze ist &auml;u&szlig;erst
strittig. So warnen Experten wie Fredrik Roggan von der Universit&auml;t
Bremen vor einem "Verschwimmen der Grenzen zwischen Polizei- und
Strafprozessrecht" sowie drohenden Kompetenz&uuml;berschreitungen der
Verfolger bei der vorgeschlagenen Schaffung der
"Vorfeldermittlungsbefugnis". Dem Juristen stellt sich die Frage, ob zu
Zeitpunkten, in dem noch keine Gefahr besteht und noch keine
Strafverfolgung zu besorgen ist, &uuml;berhaupt schon eine Qualifizierung
von Betroffenen als St&ouml;rer, Nichtst&ouml;rer (oder gar
Tatverd&auml;chtiger) seri&ouml;s vorgenommen werden kann.</P>

<P>Solange aber nicht verbindlich festgestellt werden kann, so Roggan, ob
ein von polizeirechtlichen Vorfeld-Ma&szlig;nahmen Betroffener als
St&ouml;rer oder Nichtst&ouml;rer zu qualifizieren sein wird, k&ouml;nnen
auch die gesetzlichen Schutznormen f&uuml;r "Nichtst&ouml;rer" ihre Aufgabe
nicht erf&uuml;llen. Ganz erhebliche, das polizeiliche Handeln sonst
steuernde Ma&szlig;gaben existierten hier also nicht. Das polizeiliche,
auch heimliche T&auml;tigwerden werde damit nicht begrenzt und kann sich
folglich gegen jeden B&uuml;rger richten. Im Bereich der heimlichen
Datenerhebungen im Vorfeld sei das polizeiliche T&auml;tigwerden demnach
gerade hinsichtlich des Adressatenkreises und des Umfangs der Befugnisse
kaum einer effektiven Kontrolle ausgesetzt, da naturgem&auml;&szlig; viele
der Betroffenen von den Datenerhebungen nichts erfahren w&uuml;rden.</P>

<P><B>Internet bietet Terroristen und Polizisten neue
T&auml;tigkeitsfelder</B></P>

<P>Verst&auml;rkt ins Visier nehmen soll das BKA auf Wunsch des
Innenministeriums das Internet, da Datennetze auch "Terroristen ein neues
T&auml;tigkeitsfeld" bieten. Den T&auml;tern steht gem&auml;&szlig;
Begr&uuml;ndung des Gesetzesentwurfs mit dem Netz "eine
leistungsf&auml;hige Infrastruktur zur Durchf&uuml;hrung von Straftaten,
insbesondere M&ouml;glichkeiten zum Angriff auf die Informationsund
Kommunikationssysteme zur Verf&uuml;gung". Das h&auml;tten "Erfahrungen aus
dem Ermittlungsbereich" gezeigt. Den "anlassunabh&auml;ngigen" Streifen im
Netz, die das BKA bereits durchf&uuml;hrt, sowie dem Einsatz der
automatisierten "Rasterfahndung"-Suchmaschine INTERMIT will Schily daher
nun eine Erm&auml;chtigungsgrundlage nachreichen ( Die Automatisierung der
Web-&Uuml;berwachung [6]).</P>

<P>Beschr&auml;nkt werden soll sie auf die Beschaffung von
Verdachtsmomenten rund um die gesamte Palette der so genannten
"Hackerparagraphen", also das Aussp&auml;hen (&sect; 202 a
Strafgesetzbuch), die Datenver&auml;nderung (&sect; 303 a StGB) sowie die
Computersabotage (&sect; 303b StGB), die "zu erheblichen Auswirkungen auf
die innere oder &auml;u&szlig;ere Sicherheit der Bundesrepublik Deutschland
f&uuml;hren oder einen erheblichen Verm&ouml;gensschaden herbeif&uuml;hren"
k&ouml;nnten.</P>

<P><B>Verfassungsschutz soll die Lauscher aufstellen</B></P>

<P>Auch dem Bundesverfassungsschutz will Schily ein deutlich aufgestocktes
Instrumentarium an die Hand geben. Er soll das Recht erhalten,
"Bestrebungen zu beobachten, die sich gegen den Gedanken der
V&ouml;lkerverst&auml;ndigung oder gegen das friedliche Zusammenleben der
V&ouml;lker richten". Sie k&ouml;nnten "ein gef&auml;hrlicher
N&auml;hrboden f&uuml;r den wachsenden Terrorismus" sein, ist der
Begr&uuml;ndung des Gesetzesentwurf zu entnehmen. Um seiner
"pr&auml;ventiven" Funktion gerecht werden zu k&ouml;nnen, will das
Innenministerium den Verfassungsschutz mit allen n&ouml;tigen Informationen
&uuml;ber die Kommunikationswege der Terroristen sowie ihre
Nachrichteninhalte im Wege von &Uuml;berwachungsm&ouml;glichkeiten nach dem
"G-10-Gesetz" versorgen, das das Fernmeldegeheimnis einschr&auml;nkt (
Bundestag verabschiedet Lauschgesetz [7]).</P>

<P>Die Beh&ouml;rde soll dazu Zugriff auf die Verbindungsdaten erhalten,
Bewegungsbilder Verd&auml;chtiger &uuml;ber die Auswertung der
Standortangaben von Mobiltelefonen erstellen und sogar den umstrittenen
"IMSI-Catcher" zur Ermittlung von Ger&auml;te- und Kartennummern einsetzen
d&uuml;rfen ( &nbsp;Regierung h&auml;lt IMSI-Catcher f&uuml;r (fast) legal
[8]). Die sieht das Innenministerium als "Einstiegsinformationen", die zur
Ermittlung der Telefonnummer und damit f&uuml;r einen
ordnungsgem&auml;&szlig;en Antrag auf Anordnung der
Telekommunikations&uuml;berwachung nach dem G 10 erforderlich sind.</P>

<P>Die Verfassungssch&uuml;tzer sollen au&szlig;erdem Geldfl&uuml;sse und
Kontobewegungen &uuml;berwachen, um die logistischen Vorbereitungen von
Terroranschl&auml;gen und ihre Finanzierung zu verhindern. Der Entwurf will
zu diesem Zweck Banken und Finanzinstitute zur Auskunftspflicht verdonnern.
Dabei sei sicherzustellen, "dass jede Transaktion zur&uuml;ckverfolgt
werden kann".</P>

<P><B>Biometrie f&uuml;r Pass und Personalausweis</B></P>

<P>Ein weiteres Steckenpferd Schilys ist die Verbesserung der
computergest&uuml;tzten Identifizierung einer Person auf der Grundlage
eines Ausweisdokumentes. W&auml;hrend Amerikaner und Briten noch &uuml;ber
die Einf&uuml;hrung nationaler Identifikationskarten debattieren, sieht der
deutsche Entwurf daher bereits &Auml;nderungen des Passgesetzes sowie des
Gesetzes &uuml;ber Personalausweise vor. In beiden soll eine
Rechtsgrundlage geschaffen werden, neben dem Lichtbild und der Unterschrift
weitere biometrische Informationen, wie etwa Fingerabdr&uuml;cke,
Handgeometrie oder Gesichtsgeometrie, in die Dokumente aufzunehmen.</P>

<P>Damit hinge die Zuverl&auml;ssigkeit der Identifizierung einer Person
nicht mehr allein vom visuellen Vergleich zwischen Lichtbild und
Kontrollobjekt und damit von der subjektiven Wahrnehmungsf&auml;higkeit ab,
begr&uuml;nden die Autoren des Entwurfs die neuen Vorgaben. Au&szlig;erdem
werde sie auch durch zahlreiche andere Faktoren, wie der Qualit&auml;t des
Lichtbildes, den nat&uuml;rlichen Alterungsprozess oder der
Ver&auml;nderung von Haarund Barttracht, nicht mehr negativ
beeintr&auml;chtigt. Um den Abgleich der Daten per Computer zu
erm&ouml;glichen, sollen sie auf den Ausweiskarten verschl&uuml;sselt
gelagert werden.</P>

<P><B>Sprachproben und Data-Mining sollen potenzielle Terroristen
outen</B></P>

<P>Vervollst&auml;ndigt wird das 135 Seiten umfassende Paket durch
&Auml;nderungen des Ausl&auml;ndergesetzes und des Asylrechts. Die zu
Terrorakten bereiten "Schl&auml;fer" unter den ausl&auml;ndische
Mitb&uuml;rgern sollen dadurch leichter identifiziert werden und die
Einreise von Extremisten von Anfang an besser verhindert werden
k&ouml;nnen. So &uuml;berlegt das Innenministerium, etwa bei Asylbwerbern
ohne Papiere eine gesetzliche Grundlage f&uuml;r Sprachaufzeichnungen zu
schaffen, mit der eine identit&auml;tssichernde Sprachanalyse zur
Bestimmung der Herkunftsregion erfolgen kann. Bei Terrorismus- und
Extremismusverdacht sollen zudem Visa einfacher versagt werden
k&ouml;nnen.</P>

<P>Das Ausl&auml;nderzentralregister, das wichtige Daten im Zusammenhang
der Vergabe von Visa enth&auml;lt, will Schily zu diesem Zweck deutlich
ausbauen. Um die Arbeit der Nachrichtendienste und Strafverfolger
effektiver zu gestalten, will sie das Innenministerium mit der
M&ouml;glichkeit versehen, den gesamten Datenbestand automatisiert
abzurufen sowie "Gruppenausk&uuml;nfte" zu erheben.</P>

<P>Insgesamt geh&ouml;rt auch die bessere Informationsausstattung aller
deutschen Auslandsvertretungen neben der weiteren Vernetzung des
Datenbestandes und des Informationsflusses zwischen den innerstaatlichen
Beh&ouml;rden zu den Kernanliegen des Papiers.</P>

<P><B>Die Kosten f&uuml;r die Sicherheit</B></P>

<P>Den finanziellen Mehraufwand, zu dem die Einf&uuml;hrung erweiterter
Ermittlungs- und Befugniskompetenzen bei den Sicherheitsbeh&ouml;rden sowie
die Intensivierung der Kontrollt&auml;tigkeiten und Sicherheitsaufgaben
beim Bundeskriminalamt und dem Bundesamt f&uuml;r Verfassungsschutz oder
auch der Einsatz der Sky-Marshals f&uuml;hren k&ouml;nnte, ist laut
Bundesinnenministerium zum "gegenw&auml;rtigen Zeitpunkt nicht hinreichend
genau absch&auml;tzbar". Allein die Verbesserung der Datenbest&auml;nde im
Ausl&auml;nderzentralregister d&uuml;rfte den Bund voraussichtlich in
H&ouml;he von 33,7 Millionen Euro bis zum Jahr 2005 belasten.</P>

<P>Von dem finanziellen Sicherheitspaket in H&ouml;he von 3 Milliarden
Mark, das die Bundesregierung bereits eingeplant und aufgeteilt hat, sind
bislang "nur" 500 Millionen Mark f&uuml;r das Innenministerium vorgesehen.
Der L&ouml;wenanteil in H&ouml;he der H&auml;lfte der Gelder soll dem
Verteidigungsministerium zur Verf&uuml;gung gestellt werden. Dass die
"Peanuts" f&uuml;r die innere Sicherheit mit dem Vorhaben Schilys
kompatibel sind, ist zu bezweifeln. Neben der beschlossenen Erh&ouml;hung
der Tabaksteuer um 2 Cent pro Zigarette und der Anhebung der
Versicherungssteuer um ein Prozent werden vermutlich weitere Teuerungen auf
die Verbraucher zukommen ( Her mit den Kippen [9]).</P>

<P><B>Links</B></P>

<UL>
<LI>[0]
http://www.heise.de/tp/deutsch/inhalt/te/9783/1.html</LI>

<LI>[1] http://www.bmi.bund.de/</LI>

<LI>[2] http://www.bundeskriminalamt.de/</LI>

<LI>[3] http://www.bundesgrenzschutz.de/</LI>

<LI>[4] http://www.verfassungsschutz.de/</LI>

<LI>[5] http://bundesrecht.juris.de/bundesrecht/bkag_1997/index.html</LI>

<LI>[6] http://www.heise.de/tp/deutsch/inhalt/te/7690/1.html</LI>

<LI>[7] http://www.heise.de/tp/deutsch/inhalt/te/7630/1.html</LI>

<LI>[8] http://www.heise.de/newsticker/data/jes-07.09.01-001/default.shtml</LI>

<LI>[9] http://www.heise.de/tp/deutsch/inhalt/glosse/9609/1.html</LI>
</UL>
</TD>
</TR>

<TR>
<TD width="600" align="right"><FONT size="2"><B>
<A href="#top">Seitenanfang</A></B></FONT></TD>
</TR>

<TR>
<TD bgcolor="#000066" width="390">
<CENTER>
<FONT color="#ffffff" size="2"><B>Stand: 26. Oktober 2001 // FoeBuD e.V, Bielefeld //
http(s)://www.foebud.org // bba@foebud.org</B></FONT>
</CENTER>
</TD>
</TR>
</TABLE>
</CENTER>
<FONT size="+1"><B>
<A href="javascript:history.back()">zur&uuml;ck</A> zum Artikel</B></FONT>
<BR>
</BODY>
</HTML>

