<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<!-- Author = Wolf Zimmer -->

<TITLE>Datenschutz</TITLE>
</HEAD>

<BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<P align="center"><FONT color="#000080" size="7"><B>Datenschutz</B></FONT><BR>
<FONT color="#000080" size="5"><B>www.datenschutz.de</B></FONT></P>

<P>Diese Website ist ein gemeinsamer Service von Datenschutzinstutionen aus
aller Welt. Beim Datenschutz geht es nicht allein um den Schutz von Daten,
sondern um den Schutz der Menschen, deren Daten verarbeitet werden. Hier
erfahren wir z.B.:</P>

<UL>
<LI>was das <B>Recht auf informationelle Selbstbestimmung</B>
bedeutet,</LI>

<LI>welche <B>Rechte</B> wir haben,</LI>

<LI>oder wie wir uns <B>selbst sch&uuml;tzen</B> k&ouml;nnen.</LI>
</UL>

<P>Wenn wir konkrete, etwa unsere Person betreffende Fragen haben, so
sollten wir uns an unsere zust&auml;ndige Datenschutzinstitution wenden,
die auch die Kontrolle &uuml;ber die Stellen wahrnimmt, die unsere
personenbezogenen Daten verarbeiten.</P>

<P><B>Wer ist f&uuml;r mich zust&auml;ndig?</B></P>

<P>Kommt ganz darauf an. In Deutschland sind die Zust&auml;ndigkeiten
danach verteilt, wer unsere Daten verarbeitet: Verwaltung oder
Wirtschaft?</P>

<UL>
<LI>Wenn unsere Daten von einer <I>&ouml;ffentlichen Stelle</I> verarbeitet
werden, sind die <B>Datenschutzbeauftragten des Bundes</B> oder
<B>Datenschutzbeauftragten der L&auml;nder</B> f&uuml;r uns zust&auml;ndig.
&Ouml;ffentliche Stellen der L&auml;nder sind z.B. die Verwaltungen von
St&auml;dten, Gemeinden und Kreisen, Landesbeh&ouml;rden und die meisten
Schulen und Universit&auml;ten. &Ouml;ffentliche Stellen des Bundes sind
z.B. die Bundesbeh&ouml;rden, Arbeits&auml;mter und die Bundeswehr.</LI>

<LI>Wenn unsere Daten von einer <I>privaten Stelle</I> verarbeitet werden,
sind meist die sogenannten <B>Aufsichtsbeh&ouml;rden des Bundes</B> oder
der <B>L&auml;nder</B> zust&auml;ndig. Private Stellen sind Firmen wie z.B.
Versandh&auml;user, Adressh&auml;ndler, Auskunfteien, Internet-Provider,
aber auch Vereine, &Auml;rzte und Angeh&ouml;rige anderer freier
Berufe.</LI>

<LI>F&uuml;r die Kontrolle der Verarbeitung personenbezogener Daten durch
kirchliche Stellen sind die Datenschutzbeauftragten der
<B>evangelischen</B> und <B>katholischen</B> Kirchen zust&auml;ndig.</LI>

<LI>Der Rundfunk (Radio, Fernsehen) ist aus verfassungsrechtlichen
Gr&uuml;nden aus der Kontrollbefugnis der Landesdatenschutzbeauftragten
ausgenommen. In diesem Bereich werden eigene <B>Datenschutzbeauftragte
f&uuml;r den Rundfunk</B> t&auml;tig.</LI>
</UL>

<P>Weitere Datenschutzinstitutionen sind in anderen <B>europ&auml;ischen
L&auml;ndern</B> oder dar&uuml;ber hinaus im <B>internationalen Bereich</B>
aktiv. Die lassen wir nun aber an dieser Stelle einmal
unber&uuml;cksichtigt.</P>
<HR>

<P>Nun zu den einzelnen Punkten:</P>

<P><B><FONT size="+1">Informationelle Selbstbestimmung -Was bedeutet
das?</FONT></B></P>

<P>Kurz beantwortet bedeutet informationelle Selbstbestimmung: Jeder hat
das Recht zu wissen, wer was wann &uuml;ber ihn wei&szlig;.</P>

<P>Das ist nat&uuml;rlich viel zu kurz formuliert. Um genauer zu werden:
Das Bundesverfassungsgericht hat im Volksz&auml;hlungsurteil vom 15.12.1983
den Begriff <B>Recht auf informationelle Selbstbestimmung</B> erstmals in
dem Sinne verwendet, dass es sich bei dem Datenschutz um ein
<B>Grundrecht</B> handelt. Das Gericht hat auf die Verwendung von
Juristen-Deutsch verzichtet und im 1. und 2. Leitsatz dazu
ausgef&uuml;hrt:</P>

<P><I>Das Grundrecht gew&auml;hrleistet insoweit die Befugnis des
Einzelnen, grunds&auml;tzlich selbst &uuml;ber die Preisgabe und Verwendung
seiner pers&ouml;nlichen Daten zu bestimmen. Einschr&auml;nkungen dieses
Rechts auf "informationelle Selbstbestimmung" sind nur im
&uuml;berwiegenden Allgemeininteresse zul&auml;ssig.</I></P>

<P>Gem&auml;&szlig; dieser Entscheidung wird der Schutz des Einzelnen gegen
unbegrenzte Erhebung, Speicherung, Verwendung und Weitergabe seiner
pers&ouml;nlichen Daten von dem allgemeinen Pers&ouml;nlichkeitsrecht des
Art. 2 Abs. 1 in Verbindung mit Art. 1 Abs. 1 GG umfasst. Demnach bildet
das allgemeine Pers&ouml;nlichkeitsrecht in Zusammenhang mit der
Menschenw&uuml;rde die verfassungsrechtliche Grundlage f&uuml;r das Recht
auf informationelle Selbstbestimmung.</P>

<P>Die Grundaussage des Volksz&auml;hlungsurteils zur informationellen
Selbstbestimmung l&auml;sst sich mit dem Satz zusammenfassen: <I>So viel
Freiheit wie m&ouml;glich und so viel Bindung wie n&ouml;tig</I>. Die
Freiheit der B&uuml;rger wird dabei grunds&auml;tzlich vorangestellt;
zugleich wird den Anforderungen der Gemeinschaft Rechnung getragen.</P>

<P>(Literaturhinweis:<BR> Helmut B&auml;umler, Astrid Breinlinger,
Hans-Hermann Schrader, (Hrsg.), 1999: Datenschutz von A-Z, Stichwort
"Informationelle Selbstbestimmung" (I300); Neuwied; Krieftel:
Luchterhand)</P>
<HR>

<P><B><FONT size="+1">Recht in Deutschland - Gesetze und Verordnungen des
Bundes</FONT></B></P>

<UL>
<LI><B>Grundgesetz f&uuml;r die Bundesrepublik Deutschland (GG)</B><BR>
(Stand: 16.07.1998)</LI>

<LI><B>Bundesdatenschutzgesetz (BDSG)</B> in einer(nicht-amtlichen)
Arbeitsfassung des BMI<BR> (Stand: 22.05.2001)</LI>

<LI><B>Weitere Rechtsvorschriften des Bundes</B></LI>

<UL>
<LI><B>Allgemeine Vorschriften in Deutschland zum Datenschutz und zur
Datenverarbeitung</B></LI>

<LI><B>Datenschutz im ...</B></LI>

<UL>
<LI><B>... Arbeits- und &Ouml;ffentlichen Dienstrecht</B></LI>

<LI><B>... Bau-, Planungs- und Wohnungsrecht</B></LI>

<LI><B>... Kultur-, Schul- und Wissenschaftsrecht</B></LI>

<LI><B>... Haushalts-, Steuer- und Verm&ouml;gensrecht</B></LI>

<LI><B>... Gesundheits- und Sozialrecht</B></LI>

<LI><B>... Parlaments- und Wahlrecht</B></LI>

<LI><B>... Sicherheits- und Ordnungsrecht</B></LI>

<LI><B>... Straf-, Zivil- und Proze&szlig;recht</B></LI>

<LI><B>... Telekommunikations- und Medienrecht</B></LI>

<LI><B>... Wirtschafts- und Umweltrecht</B></LI>
<BR> </UL> </UL> </UL>

<P>Die meisten Gesetze, Gesetzentw&uuml;rfe und deren Novellierungen sind
auf dieser Webseite als ZIP- oder PDF-Dateien downloadbar.</P> <HR>

<P><B><FONT size="+1">Bundesdatenschutzgesetz (BDSG)</FONT></B><BR>

BDSG-Arbeitsfassung zu dem am 23. Mai 2001 in Kraft tretenden
&Auml;nderungsgesetz</P>

<P>(Hinweis: das BMI wird den Wortlaut des BDSG in der vom Inkrafttreten
geltenden Fassung gesondert im Bundesgesetzblatt bekannt machen; bis dahin
ist f&uuml;r den authentischen Wortlaut der einzelnen Bestimmungen auf den
Wortlaut des BDSG vom 20.12. 1990 (BGBl. I S. 2954), zuletzt ge&auml;ndert
durch Artikel 2 Abs. 5 des Gesetzes vom 17.12. 1997 (BGBl. I S. 3108),
i.d.F. des &Auml;nderungsgesetzes vom 22.05. 2001 abzustellen)</P> <A
name="top"></A>

<P><B>Inhalts&uuml;bersicht</B></P>

<B>Erster Abschnitt - Allgemeine und gemeinsame Bestimmungen</B>

<UL>
<LI><A href="#&sect; 1">&sect;&nbsp;1</A> Zweck und Anwendungsbereich des
Gesetzes</LI>

<LI><A href="#&sect; 2">&sect;&nbsp;2</A> &Ouml;ffentliche und nicht
&ouml;ffentliche Stellen</LI>

<LI><A href="#&sect; 3">&sect;&nbsp;3</A> Weitere Begriffsbestimmungen</LI>

<LI><A href="#&sect; 3a">&sect;&nbsp;3a</A> Datenvermeidung und
Datensparsamkeit</LI>

<LI><A href="#&sect; 4">&sect;&nbsp;4</A> Zul&auml;ssigkeit der
Datenerhebung, -verarbeitung und -nutzung</LI>

<LI><A href="#&sect; 4a">&sect;&nbsp;4a</A> Einwilligung</LI>

<LI><A href="#&sect; 4b">&sect;&nbsp;4b</A> &Uuml;bermittlung
personenbezogener Daten ins Ausland sowie an &uuml;ber- und
zwischenstaatliche Stellen</LI>

<LI><A href="#&sect; 4c">&sect;&nbsp;4c</A> Ausnahmen</LI>

<LI><A href="#&sect; 4d">&sect;&nbsp;4d</A> Meldepflicht</LI>

<LI><A href="#&sect; 4e">&sect;&nbsp;4e</A> Inhalt der Meldepflicht</LI>

<LI><A href="#&sect; 4f">&sect;&nbsp;4f</A> Beauftragter f&uuml;r den
Datenschutz</LI>

<LI><A href="#&sect; 4g">&sect;&nbsp;4g</A> Aufgaben des Beauftragten
f&uuml;r den Datenschutz</LI>

<LI><A href="#&sect; 5">&sect;&nbsp;5</A> Datengeheimnis</LI>

<LI><A href="#&sect; 6">&sect;&nbsp;6</A> Unabdingbare Rechte des
Betroffenen</LI>

<LI><A href="#&sect; 6a">&sect;&nbsp;6a</A> Automatisierte
Einzelentscheidung</LI>

<LI><A href="#&sect; 6b">&sect;&nbsp;6b</A> Beobachtung &ouml;ffentlich
zug&auml;nglicher R&auml;ume mit optischelektronischen Einrichtungen</LI>

<LI><A href="#&sect; 6c">&sect;&nbsp;6c</A> Mobile personenbezogene
Speicher- und Verarbeitungsmedien</LI>

<LI><A href="#&sect; 7">&sect;&nbsp;7</A> Schadensersatz</LI>

<LI><A href="#&sect; 8">&sect;&nbsp;8</A> Schadensersatz bei
automatisierter Datenverarbeitung durch &ouml;ffentliche Stellen</LI>

<LI><A href="#&sect; 9">&sect;&nbsp;9</A> Technische und organisatorische
Ma&szlig;nahmen</LI>

<LI><A href="#&sect; 9a">&sect;&nbsp;9a</A> Datenschutzaudit</LI>

<LI><A href="#&sect; 10">&sect;&nbsp;10</A> Einrichtung automatisierter
Abrufverfahren</LI>

<LI><A href="#&sect; 11">&sect;&nbsp;11</A> Erhebung, Verarbeitung oder
Nutzung personenbezogener Daten im Auftrag</LI> </UL>

<B>Zweiter Abschnitt - Datenverarbeitung der &ouml;ffentlichen Stellen</B>

<UL>

<LI><B>Erster Unterabschnitt - Rechtsgrundlagen der Datenverarbeitung
</B></LI>

<UL>
<LI><A href="#&sect; 12">&sect;&nbsp;12</A> Anwendungsbereich</LI>

<LI><A href="#&sect; 13">&sect;&nbsp;13</A> Datenerhebung</LI>

<LI><A href="#&sect; 14">&sect;&nbsp;14</A> Datenspeicherung,
-ver&auml;nderung und -nutzung</LI>

<LI><A href="#&sect; 15">&sect;&nbsp;15</A> Daten&uuml;bermittlung an
&ouml;ffentliche Stellen</LI>

<LI><A href="#&sect; 16">&sect;&nbsp;16</A> Daten&uuml;bermittlung an
nicht-&ouml;ffentliche Stellen</LI>

<LI><A href="#&sect; 17">&sect;&nbsp;17</A> weggefallen</LI>

<LI><A href="#&sect; 18">&sect;&nbsp;18</A> Durchf&uuml;hrung des
Datenschutzes in der Bundesverwaltung</LI><BR>
</UL>

<LI><B>Zweiter Unterabschnitt - Rechte des Betroffenen</B></LI>

<UL> <LI><A href="#&sect; 19">&sect;&nbsp;19</A> Auskunft an den
Betroffenen</LI>

<LI><A href="#&sect; 19a">&sect;&nbsp;19a</A> Benachrichtigung</LI>

<LI><A href="#&sect; 20">&sect;&nbsp;20</A> Berichtigung, L&ouml;schung und
Sperrung von Daten; Widerspruchsrecht</LI>

<LI><A href="#&sect; 21">&sect;&nbsp;21</A> Anrufung des Bundesbeauftragten
f&uuml;r den Datenschutz</LI><BR>
</UL>

<LI><B>Dritter Unterabschnitt - Bundesbeauftragter f&uuml;r den
Datenschutz</B></LI>

<UL>
<LI><A href="#&sect; 22">&sect;&nbsp;22</A> Wahl des Bundesbeauftragten
f&uuml;r den Datenschutz</LI>

<LI><A href="#&sect; 23">&sect;&nbsp;23</A> Rechtsstellung des
Bundesbeauftragten f&uuml;r den Datenschutz</LI>

<LI><A href="#&sect; 24">&sect;&nbsp;24</A>
Kontrolle durch den Bundesbeauftragten f&uuml;r den
Datenschutz</LI>

<LI><A  href="#&sect;  25">&sect;&nbsp;25</A>  Beanstandungen   durch   den
Bundesbeauftragten f&uuml;r den Datenschutz</LI>

<LI><A    href="#&sect;   26">&sect;&nbsp;26</A>   Weitere   Aufgaben   des
Bundesbeauftragten f&uuml;r den Datenschutz</LI><BR>
</UL> </UL>

<B>Dritter Abschnitt - Datenverarbeitung nicht
&ouml;ffentlicher Stellen und &ouml;ffentlich
-rechtlicherWettbewerbsunternehmen</B> 

<UL>
<LI><B>Erster Unterabschnitt - Rechtsgrundlagen der Datenverarbeitung
</B></LI>

<UL>

<LI><A href="#&sect; 27">&sect;&nbsp;27</A> Anwendungsbereich </LI>

<LI><A href="#&sect; 28">&sect;&nbsp;28</A> Datenerhebung, -verarbeitung
und -nutzung f&uuml;r eigene Zwecke</LI>

<LI><A href="#&sect; 29">&sect;&nbsp;29</A> Gesch&auml;ftsm&auml;&szlig;ige
Datenerhebung und -speicherung zum Zwecke der &Uuml;bermittlung</LI>

<LI><A href="#&sect; 30">&sect;&nbsp;30</A> Gesch&auml;ftsm&auml;&szlig;ige
Datenerhebung und -speicherung zum Zwecke der &Uuml;bermittlung in
anonymisierter Form</LI>

<LI><A href="#&sect; 31">&sect;&nbsp;31</A> Besondere Zweckbindung</LI>

<LI><A href="#&sect; 32">&sect;&nbsp;32</A> weggefallen</LI><BR>
</UL>

<LI><B>Zweiter Unterabschnitt - Rechte des Betroffenen</B></LI>

<UL>
<LI><A href="#&sect; 33">&sect;&nbsp;33</A> Benachrichtigung des
Betroffenen</LI>

<LI><A href="#&sect; 34">&sect;&nbsp;34</A> Auskunft an den
Betroffenen</LI>

<LI><A href="#&sect; 35">&sect;&nbsp;35</A> Berichtigung, L&ouml;schung und
Sperrung von Daten</LI><BR>
</UL>

<LI><B>Dritter Unterabschnitt -Aufsichtsbeh&ouml;rde</B></LI>

<UL>
<LI><A href="#&sect; 36">&sect;&nbsp;36</A> weggefallen</LI>

<LI><A href="#&sect; 37">&sect;&nbsp;37</A> weggefallen</LI>

<LI><A href="#&sect; 38">&sect;&nbsp;38</A> Aufsichtsbeh&ouml;rde</LI>

<LI><A href="#&sect; 38a">&sect;&nbsp;38a</A> Verhaltensregeln zur
F&ouml;rderung der Durchf&uuml;hrung datenschutzrechtlicher
Regelungen</LI><BR>
</UL> </UL>

<B>Vierter Abschnitt -Sondervorschriften</B>

<UL>
<LI><A href="#&sect; 39">&sect;&nbsp;39</A> Zweckbindung bei
personenbezogenen Daten, die einem Berufs oder besonderen Amtsgeheimnis
unterliegen</LI>

<LI><A href="#&sect; 40">&sect;&nbsp;40</A> Verarbeitung und Nutzung
personenbezogener Daten durch Forschungseinrichtungen</LI>

<LI><A href="#&sect; 41">&sect;&nbsp;41</A> Erhebung, Verarbeitung und
Nutzung personenbezogener Daten durch die Medien</LI>

<LI><A href="#&sect; 42">&sect;&nbsp;42</A> Datenschutzbeauftragter der
Deutschen Welle</LI>
</UL>
<B>F&uuml;nfter Abschnitt - Schlussvorschriften</B> 

<UL>
<LI><A href="#&sect; 43">&sect;&nbsp;43</A> Bu&szlig;geldvorschriften</LI>

<LI><A href="#&sect; 44">&sect;&nbsp;44</A> Strafvorschriften</LI>
</UL>
<B>Sechster Abschnitt - &Uuml;bergangsvorschriften</B> 

<UL>
<LI><A href="#&sect; 45">&sect;&nbsp;45</A> Laufende Verwendungen</LI>

<LI><A href="#&sect; 46">&sect;&nbsp;46</A> Weitergeltung von
Begriffsbestimmungen</LI>

<LI><A href="#anlage &sect;9">Anlage(zu &sect;&nbsp;9 Satz 1)</A></LI>
</UL>
<HR>

<P><FONT size="+1"><B>Erster Abschnitt</B></FONT><BR>
<B>Allgemeine und gemeinsame Bestimmungen</B></P>

<P><B><A name="&sect; 1">&sect;&nbsp;1</A> Zweck und Anwendungsbereich des
Gesetzes</B></P> (1) Zweck dieses Gesetzes ist es, den einzelnen davor zu
sch&uuml;tzen, dass er durch den Umgang mit seinen personenbezogenen Daten
in seinem Pers&ouml;nlichkeitsrecht beeintr&auml;chtigt wird.<BR> <BR>
(2) Dieses Gesetz gilt f&uuml;r die Erhebung, Verarbeitung und Nutzung
personenbezogener Daten durch

<OL>
<LI>&ouml;ffentliche Stellen des Bundes,</LI>

<LI>&ouml;ffentliche Stellen der L&auml;nder, soweit der Datenschutz nicht
durch Landesgesetz geregelt ist und soweit sie<BR>

a) Bundesrecht ausf&uuml;hren oder<BR>

b) als Organe der Rechtspflege t&auml;tig werden und es sich nicht um
Verwaltungsangelegenheiten handelt,</LI>
               
<LI>nicht &ouml;ffentliche Stellen, soweit sie die Daten unter Einsatz von
Datenverarbeitungsanlagen verarbeiten, nutzen oder daf&uuml;r erheben oder
die Daten in oder aus nicht automatisierten Dateien verarbeiten, nutzen
oder daf&uuml;r erheben, es sei denn, die Erhebung, Verarbeitung oder
Nutzung der Daten erfolgt ausschlie&szlig;lich f&uuml;r pers&ouml;nliche
oder famili&auml;re T&auml;tigkeiten.</LI>
</OL>

(3) Soweit andere Rechtsvorschriften des Bundes auf personenbezogene Daten
einschlie&szlig;lich deren Ver&ouml;ffentlichung anzuwenden sind, gehen sie
den Vorschriften dieses Gesetzes vor. Die Verpflichtung zur Wahrung
gesetzlicher Geheimhaltungspflichten oder von Berufs- oder besonderen
Amtsgeheimnissen, die nicht auf gesetzlichen Vorschriften beruhen, bleibt
unber&uuml;hrt.<BR> <BR>

(4) Die Vorschriften dieses Gesetzes gehen denen des
Verwaltungsverfahrensgesetzes vor, soweit bei der Ermittlung des
Sachverhalts personenbezogene Datenverarbeitet werden.<BR> <BR>
(5) Dieses Gesetz findet keine Anwendung, sofern eine in einem anderen
Mitgliedstaat der Europ&auml;ischen Union oder in einem anderen
Vertragsstaat des Abkommens &uuml;ber den Europ&auml;ischen Wirtschaftsraum
belegene verantwortliche Stelle personenbezogene Daten im Inland erhebt,
verarbeitet oder nutzt, es sei denn, dies erfolgt durch eine Niederlassung
im Inland. Dieses Gesetz findet Anwendung, sofern eine verantwortliche
Stelle, die nicht in einem Mitgliedstaat der Europ&auml;ischen Union oder
in einem anderen Vertragsstaat des Abkommens &uuml;ber den
Europ&auml;ischen Wirtschaftsraum belegen ist, personenbezogene Daten im
Inland erhebt, verarbeitet oder nutzt. Soweit die verantwortliche Stelle
nach diesem Gesetz zu nennen ist, sind auch Angaben &uuml;ber im Inland
ans&auml;ssige Vertreter zu machen. Die S&auml;tze 2 und 3 gelten nicht,
sofern Datentr&auml;ger nur zum Zwecke des Transits durch das Inland
eingesetzt werden. &sect;&nbsp;38 Abs.&nbsp;1 Satz&nbsp;1 bleibt
unber&uuml;hrt.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 2">&sect;&nbsp;2</A> &Ouml;ffentliche und
nicht&ouml;ffentliche Stellen</B></P>

(1) &Ouml;ffentliche Stellen des Bundes sind die Beh&ouml;rden, die Organe
der Rechtspflege und andere &ouml;ffentlichrechtlich organisierte
Einrichtungen des Bundes, der bundesunmittelbaren K&ouml;rperschaften,
Anstalten und Stiftungen des &ouml;ffentlichen Rechts sowie deren
Vereinigungen ungeachtet ihrer Rechtsform. Als &ouml;ffentliche Stellen
gelten die aus dem Sonderverm&ouml;gen Deutsche Bundespost durch Gesetz
hervorgegangenen Unternehmen, solange ihnen ein ausschlie&szlig;liches
Recht nach dem Postgesetz zusteht.<BR> <BR>

(2) &Ouml;ffentliche Stellen der L&auml;nder sind die Beh&ouml;rden, die
Organe der Rechtspflege und andere &ouml;ffentlich-rechtlich organisierte
Einrichtungen eines Landes, einer Gemeinde, eines Gemeindeverbandes und
sonstiger der Aufsicht des Landes unterstehender juristischer Personen des
&ouml;ffentlichen Rechts sowie deren Vereinigungen ungeachtet ihrer
Rechtsform.<BR> <BR>

(3) Vereinigungen des privaten Rechts von &ouml;ffentlichen Stellen des
Bundes und der L&auml;nder, die Aufgaben der &ouml;ffentlichen Verwaltung
wahrnehmen, gelten ungeachtet der Beteiligung nicht &ouml;ffentlicher
Stellen als &ouml;ffentliche Stellen des Bundes, wenn

<OL>
<LI>sie &uuml;ber den Bereich eines Landes hinaus t&auml;tig werden
oder</LI>

<LI>dem Bund die absolute Mehrheit der Anteile geh&ouml;rt oder die
absolute Mehrheit der Stimmen zusteht.</LI>
</OL>
Andernfalls gelten sie als &ouml;ffentliche Stellen der L&auml;nder.<BR>
<BR>

(4) Nicht &ouml;ffentliche Stellen sind nat&uuml;rliche und juristische
Personen, Gesellschaften und andere Personenvereinigungen des privaten
Rechts, soweit sie nicht unter die Abs&auml;tze&nbsp;1 bis 3 fallen. Nimmt
eine nicht &ouml;ffentliche Stelle hoheitliche Aufgaben der
&ouml;ffentlichen Verwaltung wahr, ist sie insoweit &ouml;ffentliche Stelle
im Sinne dieses Gesetzes.<BR>

<A href="#top"><B>^</B></A>

<HR>

<P><B><A name="&sect; 3">&sect;&nbsp;3</A> Weitere Begriffsbestimmungen
</B></P>

(1) Personenbezogene Daten sind Einzelangaben &uuml;ber pers&ouml;nliche
oder sachliche Verh&auml;ltnisse einer bestimmten oder bestimmbaren
nat&uuml;rlichen Person (Betroffener).<BR> <BR>

(2) Automatisierte Verarbeitung ist die Erhebung, Verarbeitung oder Nutzung
personenbezogener Daten unter Einsatz von Datenverarbeitungsanlagen. Eine
nicht automatisierte Datei ist jede nicht automatisierte Sammlung
personenbezogener Daten, die gleichartig aufgebaut ist und nach bestimmten
Merkmalen zug&auml;nglich ist und ausgewertet werden kann.<BR> <BR>

(3) Erheben ist das Beschaffen von Daten &uuml;ber den Betroffenen.<BR>
<BR>

(4) Verarbeiten ist das Speichern, Ver&auml;ndern, &Uuml;bermitteln,
Sperren und L&ouml;schen personenbezogener Daten. Im einzelnen ist,
ungeachtet der dabei angewendeten Verfahren:

<OL> <LI>Speichern das Erfassen, Aufnehmen oder Aufbewahren
personenbezogener Daten auf einem Datentr&auml;ger zum Zwecke ihrer
weiteren Verarbeitung oder Nutzung,</LI>

<LI>Ver&auml;ndern das inhaltliche Umgestalten gespeicherter
personenbezogener Daten,</LI>

<LI>&Uuml;bermitteln das Bekanntgeben gespeicherter oder durch
Datenverarbeitung gewonnener personenbezogener Daten an einen Dritten in
der Weise, dass<BR>

a) die Daten an den Dritten weitergegeben werden oder<BR>

b) der Dritte zur Einsicht oder zum Abruf bereitgehaltene Daten einsieht
oder abruft,</LI>

<LI>Sperren das Kennzeichnen gespeicherter personenbezogener Daten, um ihre
weitere Verarbeitung oder Nutzung einzuschr&auml;nken,</LI>

<LI>L&ouml;schen das Unkenntlichmachen gespeicherter personenbezogener
Daten.</LI> </OL> (5) Nutzen ist jede Verwendung personenbezogener Daten,
soweit es sich nicht um Verarbeitung handelt.<BR> <BR>

(6) Anonymisieren ist das Ver&auml;ndern personenbezogener Daten derart,
dass die Einzelangaben &uuml;ber pers&ouml;nliche oder sachliche
Verh&auml;ltnisse nicht mehr oder nur mit einem
unverh&auml;ltnism&auml;&szlig;ig gro&szlig;en Aufwand an Zeit, Kosten und
Arbeitskraft einer bestimmten oder bestimmbaren nat&uuml;rlichen Person
zugeordnet werden k&ouml;nnen.<BR> <BR>

(6a) Pseudonymisieren ist das Ersetzen des Namens und anderer
Identifikationsmerkmale durch ein Kennzeichen zu dem Zweck, die Bestimmung
des Betroffenen auszuschlie&szlig;en oder wesentlich zu erschweren.<BR>
<BR>

(7) Verantwortliche Stelle ist jede Person oder Stelle, die
personenbezogene Daten f&uuml;r sich selbst erhebt, verarbeitet oder nutzt
oder dies durch andere im Auftrag vornehmen l&auml;sst.<BR> <BR>

(8) Empf&auml;nger ist jede Person oder Stelle, die Daten erh&auml;lt.
Dritter ist jede Person oder Stelle au&szlig;erhalb der verantwortlichen
Stelle. Dritte sind nicht der Betroffene sowie Personen und Stellen, die im
Inland, in einem anderen Mitgliedstaat der Europ&auml;ischen Union oder in
einem anderen Vertragsstaat des Abkommens &uuml;ber den Europ&auml;ischen
Wirtschaftsraum personenbezogene Daten im Auftrag erheben, verarbeiten oder
nutzen.<BR> <BR>

(9) Besondere Arten personenbezogener Daten sind Angaben &uuml;ber die
rassische und ethnische Herkunft, politische Meinungen, religi&ouml;se oder
philosophische &Uuml;berzeugungen, Gewerkschaftszugeh&ouml;rigkeit,
Gesundheit oder Sexualleben.<BR> <BR>

(10) Mobile personenbezogene Speicher- und Verarbeitungsmedien sind
Datentr&auml;ger,

<OL>
<LI>die an den Betroffenen ausgegeben werden,</LI>

<LI>auf denen personenbezogene Daten &uuml;ber die Speicherung hinaus durch
die ausgebende oder eine andere Stelle automatisiert verarbeitet werden
k&ouml;nnen und</LI>

<LI>bei denen der Betroffene diese Verarbeitung nur durch den Gebrauch des
Mediums beeinflussen kann.</LI>
</OL>

<A href="#top"><B>^</B></A>

<HR>

<P><B><A name="&sect; 3a">&sect;&nbsp;3a</A> Datenvermeidung und
Datensparsamkeit</B></P>
Gestaltung und Auswahl von Datenverarbeitungssystemen haben sich an dem
Ziel auszurichten, keine oder so wenig personenbezogene Daten wie
m&ouml;glich zu erheben, zu verarbeiten oder zu nutzen. Insbesondere ist
von den M&ouml;glichkeiten der Anonymisierung und Pseudonymisierung
Gebrauch zu machen, soweit dies m&ouml;glich ist und der Aufwand in einem
angemessenen Verh&auml;ltnis zu dem angestrebten Schutzzweck steht.<BR>

<A href="#top"><B>^</B></A>

<HR>

<P><B><A name="&sect; 4">&sect;&nbsp;4</A> Zul&auml;ssigkeit der
Datenerhebung, -verarbeitung und -nutzung</B></P>

<A name="&sect; 4 Abs 1">(1)</A> Die Erhebung, Verarbeitung und Nutzung
personenbezogener Daten sind nur zul&auml;ssig, soweit dieses Gesetz oder
eine andere Rechtsvorschrift dies erlaubt oder anordnet oder der Betroffene
eingewilligt hat.<BR> <BR>

<A name="&sect; 4 Abs 2">(2)</A> Personenbezogene Daten sind beim
Betroffenen zu erheben. Ohne seine Mitwirkung d&uuml;rfen sie nur erhoben
werden, wenn

<OL>
<LI>eine Rechtsvorschrift dies vorsieht oder zwingend voraussetzt oder</LI>

<LI>die zu erf&uuml;llende Verwaltungsaufgabe ihrer Art nach oder der
Gesch&auml;ftszweck eine Erhebung bei anderen Personen oder Stellen
erforderlich macht oder</LI>

<LI>die Erhebung beim Betroffenen einen unverh&auml;ltnism&auml;&szlig;igen
Aufwand erfordern w&uuml;rde und keine Anhaltspunkte daf&uuml;r bestehen,
dass &uuml;berwiegende schutzw&uuml;rdige Interessen des Betroffenen
beeintr&auml;chtigt werden.</LI>
</OL>

<A name="&sect; 4 Abs 3">(3)</A> Werden personenbezogene Daten beim
Betroffenen erhoben, so ist er, sofern er nicht bereits auf andere Weise
Kenntnis erlangt hat, von der verantwortlichen Stelle &uuml;ber

<OL>
<LI>die Identit&auml;t der verantwortlichen Stelle,</LI>

<LI>die Zweckbestimmungen der Erhebung, Verarbeitung oder Nutzung und</LI>

<LI>die Kategorien von Empf&auml;ngern nur, soweit der Betroffene nach den
Umst&auml;nden des Einzelfalles nicht mit der &Uuml;bermittlung an diese
rechnen muss,zu unterrichten. Werden personenbezogene Daten beim
Betroffenen aufgrund einer Rechtsvorschrift erhoben, die zur Auskunft
verpflichtet, oder ist die Erteilung der Auskunft Voraussetzung f&uuml;r
die Gew&auml;hrung von Rechtsvorteilen, so ist der Betroffene hierauf,
sonst auf die Freiwilligkeit seiner Angaben hinzuweisen. Soweit nach den
Umst&auml;nden des Einzelfalles erforderlich oder auf Verlangen, ist er
&uuml;ber die Rechtsvorschrift und &uuml;ber die Folgen der Verweigerung
von Angaben aufzukl&auml;ren.</LI>
</OL>

<A href="#top"><B>^</B></A>

<HR>

<P><B><A name="&sect; 4a">&sect;&nbsp;4a</A> Einwilligung</B></P>

(1) Die Einwilligung ist nur wirksam, wenn sie auf der freien Entscheidung
des Betroffenen beruht. Er ist auf den vorgesehenen Zweck der Erhebung,
Verarbeitung oder Nutzung sowie, soweit nach den Umst&auml;nden des
Einzelfalles erforderlich oder auf Verlangen, auf die Folgen der
Verweigerung der Einwilligung hinzuweisen. Die Einwilligung bedarf der
Schriftform, soweit nicht wegen besonderer Umst&auml;nde eine andere Form
angemessen ist. Soll die Einwilligung zusammen mit anderen Erkl&auml;rungen
schriftlich erteilt werden, ist sie besonders hervorzuheben.<BR> <BR>

(2) Im Bereich der wissenschaftlichen Forschung liegt ein besonderer
Umstand im Sinne von Absatz&nbsp;1 Satz&nbsp;3 auch dann vor, wenn durch
die Schriftform der bestimmte Forschungszweck erheblich beeintr&auml;chtigt
w&uuml;rde. In diesem Fall sind der Hinweis nach Absatz&nbsp;1 Satz&nbsp;2
und die Gr&uuml;nde, aus denen sich die erhebliche Beeintr&auml;chtigung
des bestimmten Forschungszwecks ergibt, schriftlich festzuhalten.<BR> <BR>

(3) Soweit besondere Arten personenbezogener Daten (&sect;&nbsp;3
Abs.&nbsp;9) erhoben, verarbeitet oder genutzt werden, muss sich die
Einwilligung dar&uuml;ber hinaus ausdr&uuml;cklich auf diese Daten
beziehen.<BR>

<A href="#top"><B>^</B></A>

<HR>

<P><B><A name="&sect; 4b">&sect;&nbsp;4b</A> &Uuml;bermittlung
personenbezogener Daten ins Ausland sowie an &uuml;ber- oder
zwischenstaatliche Stellen</B></P>

(1) F&uuml;r die &Uuml;bermittlung personenbezogener Daten an Stellen

<OL>
<LI>in anderen Mitgliedstaaten der Europ&auml;ischen Union,</LI>

<LI>in anderen Vertragsstaaten des Abkommens &uuml;ber den
Europ&auml;ischen Wirtschaftsraum oder</LI>

<LI>der Organe und Einrichtungen der Europ&auml;ischen Gemeinschaften
gelten &sect;&nbsp;15 Abs.&nbsp;1, &sect;&nbsp;16 Abs.&nbsp;1 und
&sect;&sect;&nbsp;28 bis 30 nach Ma&szlig;gabe der f&uuml;r diese
&Uuml;bermittlung geltenden Gesetze und Vereinbarungen, soweit die
&Uuml;bermittlung im Rahmen von T&auml;tigkeiten erfolgt, die ganz oder
teilweise in den Anwendungsbereich des Rechts der Europ&auml;ischen
Gemeinschaften fallen.</LI>
</OL>

(2) F&uuml;r die &Uuml;bermittlung personenbezogener Daten an Stellen nach
Absatz 1, die nicht im Rahmen von T&auml;tigkeiten erfolgt, die ganz oder
teilweise in den Anwendungsbereich des Rechts der Europ&auml;ischen
Gemeinschaften fallen, sowie an sonstige ausl&auml;ndische oder &uuml;ber-
oder zwischenstaatliche Stellen gilt Absatz 1 entsprechend. Die
&Uuml;bermittlung unterbleibt, soweit der Betroffene ein
schutzw&uuml;rdiges Interesse an dem Ausschluss der &Uuml;bermittlung hat,
insbesondere wenn bei den in Satz 1 genannten Stellen ein angemessenes
Datenschutzniveau nicht gew&auml;hrleistet ist. Satz 2 gilt nicht, wenn die
&Uuml;bermittlung zur Erf&uuml;llung eigener Aufgaben einer
&ouml;ffentlichen Stelle des Bundes aus zwingenden Gr&uuml;nden der
Verteidigung oder der Erf&uuml;llung &uuml;ber- oder zwischenstaatlicher
Verpflichtungen auf dem Gebiet der Krisenbew&auml;ltigung oder
Konfliktverhinderung oder f&uuml;r humanit&auml;re Ma&szlig;nahmen
erforderlich ist.<BR> <BR>

(3) Die Angemessenheit des Schutzniveaus wird unter Ber&uuml;cksichtigung
aller Umst&auml;nde beurteilt, die bei einer Daten&uuml;bermittlung oder
einer Kategorie von Daten&uuml;bermittlungen von Bedeutung sind;
insbesondere k&ouml;nnen die Art der Daten, die Zweckbestimmung, die Dauer
der geplanten Verarbeitung, das Herkunfts- und das Endbestimmungsland, die
f&uuml;r den betreffenden Empf&auml;nger geltenden Rechtsnormen sowie die
f&uuml;r ihn geltenden Standesregeln und Sicherheitsma&szlig;nahmen
herangezogen werden.<BR> <BR>

(4) In den F&auml;llen des &sect;&nbsp;16 Abs.&nbsp;1 Nr. 2 unterrichtet
die &uuml;bermittelnde Stelle den Betroffenen von der &Uuml;bermittlung
seiner Daten. Dies gilt nicht, wenn damit zu rechnen ist, dass er davon auf
andere Weise Kenntnis erlangt, oder wenn die Unterrichtung die
&ouml;ffentliche Sicherheit gef&auml;hrden oder sonst dem Wohl des Bundes
oder eines Landes Nachteile bereiten w&uuml;rde.<BR> <BR>

(5) Die Verantwortung f&uuml;r die Zul&auml;ssigkeit der &Uuml;bermittlung
tr&auml;gt die &uuml;bermittelnde Stelle.<BR> <BR>

(6) Die Stelle, an die die Daten &uuml;bermittelt werden, ist auf den Zweck
hinzuweisen, zu dessen Erf&uuml;llung die Daten &uuml;bermittelt
werden.<BR>

<A href="#top"><B>^</B></A>

<HR>

<P><B><A name="&sect; 4c">&sect;&nbsp;4c</A> Ausnahmen</B></P>

(1) Im Rahmen von T&auml;tigkeiten, die ganz oder teilweise in den
Anwendungsbereich des Rechts der Europ&auml;ischen Gemeinschaften fallen,
ist eine &Uuml;bermittlung personenbezogener Daten an andere als die in
&sect;&nbsp;4b Abs. 1 genannten Stellen, auch wenn bei ihnen ein
angemessenes Datenschutzniveau nicht gew&auml;hrleistet ist, zul&auml;ssig,
sofern

<OL>
<LI>der Betroffene seine Einwilligung gegeben hat,</LI>

<LI>die &Uuml;bermittlung f&uuml;r die Erf&uuml;llung eines Vertrags
zwischen dem Betroffenen und der verantwortlichen Stelle oder zur
Durchf&uuml;hrung von vorvertraglichen Ma&szlig;nahmen, die auf
Veranlassung des Betroffenen getroffen worden sind, erforderlich ist,</LI>

<LI>die &Uuml;bermittlung zum Abschluss oder zur Erf&uuml;llung eines
Vertrags erforderlich ist, der im Interesse des Betroffenen von der
verantwortlichen Stelle mit einem Dritten geschlossen wurde oder
geschlossen werden soll,</LI>

<LI>die &Uuml;bermittlung f&uuml;r die Wahrung eines wichtigen
&ouml;ffentlichen Interesses oder zur Geltendmachung, Aus&uuml;bung oder
Verteidigung von Rechtsanspr&uuml;chen vor Gericht erforderlich ist,</LI>

<LI>die &Uuml;bermittlung f&uuml;r die Wahrung lebenswichtiger Interessen
des Betroffenen erforderlich ist oder</LI>

<LI>die &Uuml;bermittlung aus einem Register erfolgt, das zur Information
der &Ouml;ffentlichkeit bestimmt ist und entweder der gesamten
&Ouml;ffentlichkeit oder allen Personen, die ein berechtigtes Interesse
nachweisen k&ouml;nnen, zur Einsichtnahme offensteht, soweit die
gesetzlichen Voraussetzungen im Einzelfall gegeben sind.</LI>
</OL>

Die Stelle, an die die Daten &uuml;bermittelt werden, ist darauf
hinzuweisen, dass die &uuml;bermittelten Daten nur zu dem Zweck verarbeitet
oder genutzt werden d&uuml;rfen, zu dessen Erf&uuml;llung sie
&uuml;bermittelt werden.<BR> <BR>

(2) Unbeschadet des Absatzes 1 Satz 1 kann die zust&auml;ndige
Aufsichtsbeh&ouml;rde einzelne &Uuml;bermittlungen oder bestimmte Arten von
&Uuml;bermittlungen personenbezogener Daten an andere als die in &sect; 4b
Abs. 1 genannten Stellen genehmigen,wenn die verantwortliche Stelle
ausreichende Garantien hinsichtlich des Schutzes des
Pers&ouml;nlichkeitsrechts und der Aus&uuml;bung der damit verbundenen
Rechte vorweist; die Garantien k&ouml;nnen sich insbesondere aus
Vertragsklauseln oder verbindlichen Unternehmensregelungen ergeben. Bei den
Post- und Telekommunikationsunternehmen ist der Bundesbeauftragte f&uuml;r
den Datenschutz zust&auml;ndig. Sofern die &Uuml;bermittlung durch
&ouml;ffentliche Stellen erfolgen soll, nehmen diese die Pr&uuml;fung nach
Satz 1 vor.<BR> <BR>

(3) Die L&auml;nder teilen dem Bund die nach Absatz 2 Satz&nbsp;1
ergangenen Entscheidungen mit.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 4d">&sect;&nbsp;4d</A> Meldepflicht</B></P>

<A name="&sect; 4d Abs 1">(1)</A> Verfahren automatisierter Verarbeitungen
sind vor ihrer Inbetriebnahme von nicht &ouml;ffentlichen verantwortlichen
Stellen der zust&auml;ndigen Aufsichtsbeh&ouml;rde und von
&ouml;ffentlichen verantwortlichen Stellen des Bundes sowie von den Postund
Telekommunikationsunternehmen dem Bundesbeauftragten f&uuml;r den
Datenschutz nach Ma&szlig;gabe von &sect;&nbsp;4e zu melden.<BR> <BR>

<A name="&sect; 4d Abs 2">(2)</A> Die Meldepflicht entf&auml;llt, wenn die
verantwortliche Stelle einen Beauftragten f&uuml;r den Datenschutz bestellt
hat.<BR> <BR>

<A name="&sect; 4d Abs 3">(3)</A> Die Meldepflicht entf&auml;llt ferner,
wenn die verantwortliche Stelle personenbezogene Daten f&uuml;r eigene
Zwecke erhebt, verarbeitet oder nutzt, hierbei h&ouml;chstens vier
Arbeitnehmer mit der Erhebung, Verarbeitung oder Nutzung personenbezogener
Daten besch&auml;ftigt und entweder eine Einwilligung der Betroffenen
vorliegt oder die Erhebung, Verarbeitung oder Nutzung der Zweckbestimmung
eines Vertragsverh&auml;ltnisses oder vertrags&auml;hnlichen
Vertrauensverh&auml;ltnisses mit den Betroffenen dient.<BR> <BR>

<A name="&sect; 4d Abs 4">(4)</A> Die Abs&auml;tze 2 und 3 gelten nicht,
wenn es sich um automatisierte Verarbeitungen handelt, in denen
gesch&auml;ftsm&auml;&szlig;ig personenbezogene Daten von der jeweiligen
Stelle

<OL>
<LI>zum Zweck der &Uuml;bermittlung oder</LI>

<LI>zum Zweck der anonymisierten &Uuml;bermittlung</LI>
</OL>
gespeichert werden.<BR><BR>

<A name="&sect; 4d Abs 5">(5)</A> Soweit automatisierte Verarbeitungen
besondere Risiken f&uuml;r die Rechte und Freiheiten der Betroffenen
aufweisen, unterliegen sie der Pr&uuml;fung vor Beginn der Verarbeitung
(Vorabkontrolle). Eine Vorabkontrolle ist insbesondere durchzuf&uuml;hren,
wenn

<OL>
<LI>besondere Arten personenbezogener Daten (&sect;&nbsp;3 Abs.&nbsp;9)
verarbeitet werden oder</LI>

<LI>die Verarbeitung personenbezogener Daten dazu bestimmt ist, die
Pers&ouml;nlichkeit des Betroffenen zu bewerten einschlie&szlig;lich seiner
F&auml;higkeiten, seiner Leistung oder seines Verhaltens,es sei denn, dass
eine gesetzliche Verpflichtung oder eine Einwilligung des Betroffenen
vorliegt oder die Erhebung, Verarbeitung oder Nutzung der Zweckbestimmung
eines Vertragsverh&auml;ltnisses oder vertrags&auml;hnlichen
Vertrauensverh&auml;ltnisses mit dem Betroffenen dient.</LI>
</OL>

(6) Zust&auml;ndig f&uuml;r die Vorabkontrolle ist der Beauftragte f&uuml;r
den Datenschutz. Dieser nimmt die Vorabkontrolle nach Empfang der
&Uuml;bersicht nach &sect;&nbsp;4g Abs.&nbsp;2 Satz&nbsp;1 vor. Er hat sich
in Zweifelsf&auml;llen an die Aufsichtsbeh&ouml;rde oder bei den Post- und
Telekommunikationsunternehmen an den Bundesbeauftragten f&uuml;r den
Datenschutz zu wenden.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 4e">&sect;&nbsp;4e</A> Inhalt der Meldepflicht </B>
</P>

Sofern Verfahren automatisierter Verarbeitungen meldepflichtig sind, sind
folgende Angaben zu machen:

<OL>
<LI>Name oder Firma der verantwortlichen Stelle,</LI>

<LI>Inhaber, Vorst&auml;nde, Gesch&auml;ftsf&uuml;hrer oder sonstige
gesetzliche oder nach der Verfassung des Unternehmens berufene Leiter und
die mit der Leitung der Datenverarbeitung beauftragten Personen,</LI>

<LI>Anschrift der verantwortlichen Stelle,</LI>

<LI>Zweckbestimmungen der Datenerhebung, -verarbeitung oder -nutzung,</LI>

<LI>eine Beschreibung der betroffenen Personengruppen und der
diesbez&uuml;glichen Daten oder Datenkategorien,</LI>

<LI>Empf&auml;nger oder Kategorien von Empf&auml;ngern, denen die Daten
mitgeteilt werden k&ouml;nnen,</LI>

<LI>Regelfristen f&uuml;r die L&ouml;schung der Daten,</LI>

<LI>eine geplante Daten&uuml;bermittlung in Drittstaaten,</LI>

<LI>eine allgemeine Beschreibung, die es erm&ouml;glicht, vorl&auml;ufig zu
beurteilen, ob die Ma&szlig;nahmen nach &sect;&nbsp;9 zur
Gew&auml;hrleistung der Sicherheit der Verarbeitung angemessen sind.</LI>
</OL>

&sect;&nbsp;4d Abs.&nbsp;1 und 4 gilt f&uuml;r die &Auml;nderung der nach
Satz 1 mitgeteilten Angaben sowie f&uuml;r den Zeitpunkt der Aufnahme und
der Beendigung der meldepflichtigen T&auml;tigkeit entsprechend.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 4f">&sect;&nbsp;4f</A> Beauftragter
f&uuml;r den Datenschutz</B></P>

(1) &Ouml;ffentliche und nicht &ouml;ffentliche Stellen, die
personenbezogene Daten automatisiert erheben, verarbeiten oder nutzen,
haben einen Beauftragten f&uuml;r den Datenschutz schriftlich zu bestellen.
Nicht &ouml;ffentliche Stellen sind hierzu sp&auml;testens innerhalb eines
Monats nach Aufnahme ihrer T&auml;tigkeit verpflichtet. Das Gleiche gilt,
wenn personenbezogene Daten auf andere Weise erhoben, verarbeitet oder
genutzt werden und damit in der Regel mindestens 20 Personen
besch&auml;ftigt sind. Die S&auml;tze 1 und 2 gelten nicht f&uuml;r nicht
&ouml;ffentliche Stellen, die h&ouml;chstens vier Arbeitnehmer mit der
Erhebung, Verarbeitung oder Nutzung personenbezogener Daten
besch&auml;ftigen. Soweit aufgrund der Struktur einer &ouml;ffentlichen
Stelle erforderlich, gen&uuml;gt die Bestellung eines Beauftragten f&uuml;r
den Datenschutz f&uuml;r mehrere Bereiche. Soweit nicht &ouml;ffentliche
Stellen automatisierte Verarbeitungen vornehmen, die einer Vorabkontrolle
unterliegen oder personenbezogene Daten gesch&auml;ftsm&auml;&szlig;ig zum
Zweck d er &Uuml;bermittlung oder der anonymisierten &Uuml;bermittlung
erheben, verarbeiten oder nutzen, haben sie unabh&auml;ngig von der Anzahl
der Arbeitnehmer einen Beauftragten f&uuml;r den Datenschutz zu
bestellen.<BR> <BR>

(2) Zum Beauftragten f&uuml;r den Datenschutz darf nur bestellt werden, wer
die zur Erf&uuml;llung seiner Aufgaben erforderliche Fachkunde und
Zuverl&auml;ssigkeit besitzt. Mit dieser Aufgabe kann auch eine Person
au&szlig;erhalb der verantwortlichen Stelle betraut werden.
&Ouml;ffentliche Stellen k&ouml;nnen mit Zustimmung ihrer
Aufsichtsbeh&ouml;rde einen Bediensteten aus einer anderen
&ouml;ffentlichen Stelle zum Beauftragten f&uuml;r den Datenschutz
bestellen.<BR> <BR>

(3) Der Beauftragte f&uuml;r den Datenschutz ist dem Leiter der
&ouml;ffentlichen oder nicht &ouml;ffentlichen Stelle unmittelbar zu
unterstellen. Er ist in Aus&uuml;bung seiner Fachkunde auf dem Gebiet des
Datenschutzes weisungsfrei. Er darf wegen der Erf&uuml;llung seiner
Aufgaben nicht benachteiligt werden. Die Bestellung zum Beauftragten
f&uuml;r den Datenschutz kann in entsprechender Anwendung von
&sect;&nbsp;626 des B&uuml;rgerlichen Gesetzbuches, bei nicht
&ouml;ffentlichen Stellen auch auf Verlangen der Aufsichtsbeh&ouml;rde,
widerrufen werden.<BR> <BR>

(4) Der Beauftragte f&uuml;r den Datenschutz ist zur Verschwiegenheit
&uuml;ber die Identit&auml;t des Betroffenen sowie &uuml;ber Umst&auml;nde,
die R&uuml;ckschl&uuml;sse auf den Betroffenen zulassen, verpflichtet,
soweit er nicht davon durch den Betroffenen befreit wird.<BR> <BR>

(5) Die &ouml;ffentlichen und nicht &ouml;ffentlichen Stellen haben den
Beauftragten f&uuml;r den Datenschutz bei der Erf&uuml;llung seiner
Aufgaben zu unterst&uuml;tzen und ihm insbesondere, soweit dies zur
Erf&uuml;llung seiner Aufgaben erforderlich ist, Hilfspersonal sowie
R&auml;ume, Einrichtungen, Ger&auml;te und Mittel zur Verf&uuml;gung zu
stellen. Betroffene k&ouml;nnen sich jederzeit an den Beauftragten f&uuml;r
den Datenschutz wenden.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 4g">&sect;&nbsp;4g</A> Aufgaben des Beauftragten
f&uuml;r den Datenschutz</B></P>

(1) Der Beauftragte f&uuml;r den Datenschutz wirkt auf die Einhaltung
dieses Gesetzes und anderer Vorschriften &uuml;ber den Datenschutz hin. Zu
diesem Zweck kann sich der Beauftragte f&uuml;r den Datenschutz in
Zweifelsf&auml;llen an die f&uuml;r die Datenschutzkontrolle bei der
verantwortlichen Stelle zust&auml;ndige Beh&ouml;rde wenden. Er hat
insbesondere

<OL>
<LI>die ordnungsgem&auml;&szlig;e Anwendung der
Datenverarbeitungsprogramme, mit deren Hilfe personenbezogene Daten
verarbeitet werden sollen, zu &uuml;berwachen; zu diesem Zweck ist er
&uuml;ber Vorhaben der automatisierten Verarbeitung personenbezogener Daten
rechtzeitig zu unterrichten,</LI>

<LI>die bei der Verarbeitung personenbezogener Daten t&auml;tigen Personen
durch geeignete Ma&szlig;nahmen mit den Vorschriften dieses Gesetzes sowie
anderen Vorschriften &uuml;ber den Datenschutz und mit den jeweiligen
besonderen Erfordernissen des Datenschutzes vertraut zu machen.</LI>
</OL>

(2) Dem Beauftragten f&uuml;r den Datenschutz ist von der verantwortlichen
Stelle eine &Uuml;bersicht &uuml;ber die in &sect;&nbsp;4e Satz 1 genannten
Angaben sowie &uuml;ber zugriffsberechtigte Personen zur Verf&uuml;gung zu
stellen. Im Fall des &sect;&nbsp;4d Abs.&nbsp;2 macht der Beauftragte
f&uuml;r den Datenschutz die Angaben nach &sect;&nbsp;4e Satz 1 Nr.&nbsp;1
bis 8 auf Antrag jedermann in geeigneter Weise verf&uuml;gbar. Im Fall des
&sect;&nbsp;4d Abs.&nbsp;3 gilt Satz 2 entsprechend f&uuml;r die
verantwortliche Stelle.<BR> <BR>

(3) Auf die in &sect; 6 Abs. 2 Satz 4 genannten Beh&ouml;rden findet Absatz
2 Satz 2 keine Anwendung. Absatz 1 Satz 2 findet mit der Ma&szlig;gabe
Anwendung, dass der beh&ouml;rdliche Beauftragte f&uuml;r den Datenschutz
das Benehmen mit dem Beh&ouml;rdenleiter herstellt; bei Unstimmigkeiten
zwischen dem beh&ouml;rdlichen Beauftragten f&uuml;r den Datenschutz und
dem Beh&ouml;rdenleiter entscheidet die oberste Bundesbeh&ouml;rde.<BR>
<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 5">&sect;&nbsp;5</A>
Datengeheimnis</B></P>

Den bei der Datenverarbeitung besch&auml;ftigten Personen ist untersagt,
personenbezogene Daten unbefugt zu erheben, zu verarbeiten oder zu nutzen
(Datengeheimnis). Diese Personen sind, soweit sie bei nicht
&ouml;ffentlichen Stellen besch&auml;ftigt werden, bei der Aufnahme ihrer
T&auml;tigkeit auf das Datengeheimnis zu verpflichten. Das Datengeheimnis
besteht auch nach Beendigung ihrer T&auml;tigkeit fort.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 6">&sect;&nbsp;6</A> Unabdingbare
Rechte des Betroffenen</B></P>

(1) Die Rechte des Betroffenen auf Auskunft (&sect;&sect;&nbsp;19, 34) und
auf Berichtigung, L&ouml;schung oder Sperrung (&sect;&sect;&nbsp;20, 35)
k&ouml;nnen nicht durch Rechtsgesch&auml;ft ausgeschlossen oder
beschr&auml;nkt werden.<BR> <BR>

(2) Sind die Daten des Betroffenen automatisiert in der Weise gespeichert,
dass mehrere Stellen speicherungsberechtigt sind, und ist der Betroffene
nicht in der Lage festzustellen, welche Stelle die Daten gespeichert hat,
so kann er sich an jede dieser Stellen wenden. Diese ist verpflichtet, das
Vorbringen des Betroffenen an die Stelle, die die Daten gespeichert hat,
weiterzuleiten. Der Betroffene ist &uuml;ber die Weiterleitung und jene
Stelle zu unterrichten. Die in &sect;&nbsp;19 Abs.&nbsp;3 genannten
Stellen, die Beh&ouml;rden der Staatsanwaltschaft und der Polizei sowie
&ouml;ffentliche Stellen der Finanzverwaltung, soweit sie personenbezogene
Daten in Erf&uuml;llung ihrer gesetzlichen Aufgaben im Anwendungsbereich
der Abgabenordnung zur &Uuml;berwachung und Pr&uuml;fung speichern,
k&ouml;nnen statt des Betroffenen den Bundesbeauftragten f&uuml;r den
Datenschutz unterrichten. In diesem Fall richtet sich das weitere Verfahren
nach &sect;&nbsp;19 Abs.&nbsp;6.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 6a">&sect;&nbsp;6a</A> Automatisierte
Einzelentscheidung</B></P>

(1) Entscheidungen, die f&uuml;r den Betroffenen eine rechtliche Folge nach
sich ziehen oder ihn erheblich beeintr&auml;chtigen, d&uuml;rfen nicht
ausschlie&szlig;lich auf eine automatisierte Verarbeitung personenbezogener
Daten gest&uuml;tzt werden, die der Bewertung einzelner
Pers&ouml;nlichkeitsmerkmale dienen.<BR> <BR>

(2) Dies gilt nicht, wenn 

<OL>
<LI>die Entscheidung im Rahmen des Abschlusses oder der Erf&uuml;llung
eines Vertragsverh&auml;ltnisses oder eines sonstigen
Rechtsverh&auml;ltnisses ergeht und dem Begehren des Betroffenen
stattgegeben wurde oder</LI>

<LI>die Wahrung der berechtigten Interessen des Betroffenen durch geeignete
Ma&szlig;nahmen gew&auml;hrleistet und dem Betroffenen von der
verantwortlichen Stelle die Tatsache des Vorliegens einer Entscheidung im
Sinne des Absatzes&nbsp;1 mitgeteilt wird. Als geeignete Ma&szlig;nahme
gilt insbesondere die M&ouml;glichkeit des Betroffenen, seinen Standpunkt
geltend zu machen. Die verantwortliche Stelle ist verpflichtet, ihre
Entscheidung erneut zu pr&uuml;fen.</LI>
</OL>

(3) Das Recht des Betroffenen auf Auskunft nach den &sect;&sect;&nbsp;19
und 34 erstreckt sich auch auf den logischen Aufbau der automatisierten
Verarbeitung der ihn betreffenden Daten.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 6b">&sect;&nbsp;6b</A> Beobachtung &ouml;ffentlich
zug&auml;nglicher R&auml;ume mit optisch-elektronischen
Einrichtungen</B></P>

(1) Die Beobachtung &ouml;ffentlich zug&auml;nglicher R&auml;ume mit
optisch-elektronischen Einrichtungen (Video&uuml;berwachung) ist nur
zul&auml;ssig, soweit sie            

<OL>
<LI>zur Aufgabenerf&uuml;llung &ouml;ffentlicher Stellen,</LI>

<LI>zur Wahrnehmung des Hausrechts oder</LI>

<LI>zur Wahrnehmung berechtigter Interessen f&uuml;r konkret festgelegte
Zwecke erforderlich ist und keine Anhaltspunkte bestehen, dass
schutzw&uuml;rdige Interessen der Betroffenen &uuml;berwiegen.</LI>
</OL>

(2) Der Umstand der Beobachtung und die verantwortliche Stelle sind durch
geeignete Ma&szlig;nahmen erkennbar zu machen.<BR> <BR>

(3) Die Verarbeitung oder Nutzung von nach Absatz 1 erhobenen Daten ist
zul&auml;ssig, wenn sie zum Erreichen des verfolgten Zwecks erforderlich
ist und keine Anhaltspunkte bestehen, dass schutzw&uuml;rdige Interessen
der Betroffenen &uuml;berwiegen. F&uuml;r einen anderen Zweck d&uuml;rfen
sie nur verarbeitet oder genutzt werden, soweit dies zur Abwehr von
Gefahren f&uuml;r die staatliche und &ouml;ffentliche Sicherheit sowie zur
Verfolgung von Straftaten erforderlich ist.<BR> <BR>

(4) Werden durch Video&uuml;berwachung erhobene Daten einer bestimmten
Person zugeordnet, ist diese &uuml;ber eine Verarbeitung oder Nutzung
entsprechend &sect;&sect; 19a und 33 zu benachrichtigen.<BR> <BR>

(5) Die Daten sind unverz&uuml;glich zu l&ouml;schen, wenn sie zur
Erreichung des Zwecks nicht mehr erforderlich sind oder schutzw&uuml;rdige
Interessen der Betroffenen einer weiteren Speicherung entgegenstehen.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 6c">&sect;&nbsp;6c</A> Mobile personenbezogene
Speicher- und Verarbeitungsmedien</B></P>

(1) Die Stelle, die ein mobiles personenbezogenes Speicher- und
Verarbeitungsmedium ausgibt oder ein Verfahren zur automatisierten
Verarbeitung personenbezogener Daten, das ganz oder teilweise auf einem
solchen Medium abl&auml;uft, auf das Medium aufbringt, &auml;ndert oder
hierzu bereith&auml;lt, muss den Betroffenen

<OL>
<LI>&uuml;ber ihre Identit&auml;t und Anschrift,</LI>

<LI>in allgemein verst&auml;ndlicher Form &uuml;ber die Funktionsweise des
Mediums einschlie&szlig;lich der Art der zu verarbeitenden
personenbezogenen Daten,</LI>

<LI>dar&uuml;ber, wie er seine Rechte nach den &sect;&sect;&nbsp;19, 20, 34
und 35 aus&uuml;ben kann, und</LI>

<LI>&uuml;ber die bei Verlust oder Zerst&ouml;rung des Mediums zu
treffenden Ma&szlig;nahmen unterrichten, soweit der Betroffene nicht
bereits Kenntnis erlangt hat.</LI>
</OL>

(2) Die nach Absatz&nbsp;1 verpflichtete Stelle hat daf&uuml;r Sorge zu
tragen, dass die zur Wahrnehmung des Auskunftsrechts erforderlichen
Ger&auml;te oder Einrichtungen in angemessenem Umfang zum unentgeltlichen
Gebrauch zur Verf&uuml;gung stehen.<BR> <BR>

(3) Kommunikationsvorg&auml;nge, die auf dem Medium eine Datenverarbeitung
ausl&ouml;sen, m&uuml;ssen f&uuml;r den Betroffenen eindeutig erkennbar
sein.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 7">&sect;&nbsp;7</A> Schadensersatz</B></P>

F&uuml;gt eine verantwortliche Stelle dem Betroffenen durch eine nach
diesem Gesetz oder nach anderen Vorschriften &uuml;ber den Datenschutz
unzul&auml;ssige oder unrichtige Erhebung, Verarbeitung oder Nutzung seiner
personenbezogenen Daten einen Schaden zu, ist sie oder ihr Tr&auml;ger dem
Betroffenen zum Schadensersatz verpflichtet. Die Ersatzpflicht
entf&auml;llt, soweit die verantwortliche Stelle die nach den
Umst&auml;nden des Falles gebotene Sorgfalt beachtet hat.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 8">&sect;&nbsp;8</A> Schadensersatz bei
automatisierter Datenverarbeitung durch &ouml;ffentliche Stellen</B></P>

(1) F&uuml;gt eine verantwortliche &ouml;ffentliche Stelle dem Betroffenen
durch eine nach diesem Gesetz oder nach anderen Vorschriften &uuml;ber den
Datenschutz unzul&auml;ssige oder unrichtige automatisierte Erhebung,
Verarbeitung oder Nutzung seiner personenbezogenen Daten einen Schaden zu,
ist ihr Tr&auml;ger dem Betroffenen unabh&auml;ngig von einem Verschulden
zum Schadensersatz verpflichtet.<BR> <BR>

(2) Bei einer schweren Verletzung des Pers&ouml;nlichkeitsrechts ist dem
Betroffenen der Schaden, der nicht Verm&ouml;gensschaden ist, angemessen in
Geld zu ersetzen.<BR> <BR>

(3) Die Anspr&uuml;che nach den Abs&auml;tzen 1 und 2 sind insgesamt auf
einen Betrag von 250&nbsp;000 Deutsche Mark begrenzt. Ist aufgrund
desselben Ereignisses an mehrere Personen Schadensersatz zu leisten, der
insgesamt den H&ouml;chstbetrag von 250&nbsp;000 Deutsche Mark
&uuml;bersteigt, so verringern sich die einzelnen Schadensersatzleistungen
in dem Verh&auml;ltnis, in dem ihr Gesamtbetrag zu dem H&ouml;chstbetrag
steht.<BR> <BR>

(4) Sind bei einer automatisierten Verarbeitung mehrere Stellen
speicherungsberechtigt und ist der Gesch&auml;digte nicht in der Lage, die
speichernde Stelle festzustellen, so haftet jede dieser Stellen.<BR> <BR>

(5) Auf das Mitverschulden des Betroffenen und die Verj&auml;hrung sind die
&sect;&sect;&nbsp;254 und 852 des B&uuml;rgerlichen Gesetzbuches
entsprechend anzuwenden.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 9">&sect;&nbsp;9</A> Technische und organisatorische
Ma&szlig;nahmen</B></P>

&Ouml;ffentliche und nicht &ouml;ffentliche Stellen, die selbst oder im
Auftrag personenbezogene Daten erheben, verarbeiten oder nutzen, haben die
technischen und organisatorischen Ma&szlig;nahmen zu treffen, die
erforderlich sind, um die Ausf&uuml;hrung der Vorschriften dieses Gesetzes,
insbesondere die in der <A href="#anlage &sect;9">Anlage</A> zu diesem
Gesetz genannten Anforderungen, zu gew&auml;hrleisten. Erforderlich sind
Ma&szlig;nahmen nur, wenn ihr Aufwand in einem angemessenen Verh&auml;ltnis
zu dem angestrebten Schutzzweck steht.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 9a">&sect;&nbsp;9a</A> Datenschutzaudit</B></P>

Zur Verbesserung des Datenschutzes und der Datensicherheit k&ouml;nnen
Anbieter von Datenverarbeitungssystemen und -programmen und
datenverarbeitende Stellen ihr Datenschutzkonzept sowie ihre technischen
Einrichtungen durch unabh&auml;ngige und zugelassene Gutachter pr&uuml;fen
und bewerten lassen sowie das Ergebnis der Pr&uuml;fung
ver&ouml;ffentlichen. Die n&auml;heren Anforderungen an die Pr&uuml;fung
und Bewertung, das Verfahren sowie die Auswahl und Zulassung der Gutachter
werden durch besonderes Gesetz geregelt.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 10">&sect;&nbsp;10</A> Einrichtung automatisierter
Abrufverfahren</B></P>

(1) Die Einrichtung eines automatisierten Verfahrens, das die
&Uuml;bermittlung personenbezogener Daten durch Abruf erm&ouml;glicht, ist
zul&auml;ssig, soweit dieses Verfahren unter Ber&uuml;cksichtigung der
schutzw&uuml;rdigen Interessen der Betroffenen und der Aufgaben oder
Gesch&auml;ftszwecke der beteiligten Stellen angemessen ist. Die
Vorschriften &uuml;ber die Zul&auml;ssigkeit des einzelnen Abrufs bleiben
unber&uuml;hrt.<BR> <BR>

(2) Die beteiligten Stellen haben zu gew&auml;hrleisten, dass die
Zul&auml;ssigkeit des Abrufverfahrens kontrolliert werden kann. Hierzu
haben sie schriftlich festzulegen:

<OL>
<LI>Anlass und Zweck des Abrufverfahrens,</LI>

<LI>Dritte, an die &uuml;bermittelt wird,</LI>

<LI>Art der zu &uuml;bermittelnden Daten,</LI>

<LI>nach &sect;&nbsp;9 erforderliche technische und organisatorische
Ma&szlig;nahmen.</LI>
</OL>

Im &ouml;ffentlichen Bereich k&ouml;nnen die erforderlichen Festlegungen
auch durch die Fachaufsichtsbeh&ouml;rden getroffen werden.<BR> <BR>

(3) &Uuml;ber die Einrichtung von Abrufverfahren ist in F&auml;llen, in
denen die in &sect;&nbsp;12 Abs.&nbsp;1 genannten Stellen beteiligt sind,
der Bundesbeauftragte f&uuml;r den Datenschutz unter Mitteilung der
Festlegungen nach Absatz&nbsp;2 zu unterrichten. Die Einrichtung von
Abrufverfahren, bei denen die in &sect;&nbsp;6 Abs.&nbsp;2 und in
&sect;&nbsp;19 Abs.&nbsp;3 genannten Stellen beteiligt sind, ist nur
zul&auml;ssig, wenn das f&uuml;r die speichernde und die abrufende Stelle
jeweils zust&auml;ndige Bundes- oder Landesministerium zugestimmt hat.<BR>
<BR>

(4) Die Verantwortung f&uuml;r die Zul&auml;ssigkeit des einzelnen Abrufs
tr&auml;gt der Dritte, an den &uuml;bermittelt wird. Die speichernde Stelle
pr&uuml;ft die Zul&auml;ssigkeit der Abrufe nur, wenn dazu Anlass besteht.
Die speichernde Stelle hat zu gew&auml;hrleisten, dass die
&Uuml;bermittlung personenbezogener Daten zumindest durch geeignete
Stichprobenverfahren festgestellt und &uuml;berpr&uuml;ft werden kann. Wird
ein Gesamtbestand personenbezogener Daten abgerufen oder &uuml;bermittelt
(Stapelverarbeitung), so bezieht sich die Gew&auml;hrleistung der
Feststellung und &Uuml;berpr&uuml;fung nur auf die Zul&auml;ssigkeit des
Abrufes oder der &Uuml;bermittlung des Gesamtbestandes.<BR> <BR>

(5) Die Abs&auml;tze 1 bis 4 gelten nicht f&uuml;r den Abruf allgemein
zug&auml;nglicher Daten. Allgemein zug&auml;nglich sind Daten, die
jedermann, sei es ohne oder nach vorheriger Anmeldung, Zulassung oder
Entrichtung eines Entgelts, nutzen kann.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 11">&sect;&nbsp;11</A> Erhebung, Verarbeitung oder
Nutzung personenbezogener Daten im Auftrag</B></P>

(1) Werden personenbezogene Daten im Auftrag durch andere Stellen erhoben,
verarbeitet oder genutzt, ist der Auftraggeber f&uuml;r die Einhaltung der
Vorschriften dieses Gesetzes und anderer Vorschriften &uuml;ber den
Datenschutz verantwortlich. Die in den &sect;&sect;&nbsp;6, 7 und 8
genannten Rechte sind ihm gegen&uuml;ber geltend zu machen.<BR> <BR>

(2) Der Auftragnehmer ist unter besonderer Ber&uuml;cksichtigung der
Eignung der von ihm getroffenen technischen und organisatorischen
Ma&szlig;nahmen sorgf&auml;ltig auszuw&auml;hlen. Der Auftrag ist
schriftlich zu erteilen, wobei die Datenerhebung, -verarbeitung oder
-nutzung, die technischen und organisatorischen Ma&szlig;nahmen und etwaige
Unterauftragsverh&auml;ltnisse festzulegen sind. Er kann bei
&ouml;ffentlichen Stellen auch durch die Fachaufsichtsbeh&ouml;rde erteilt
werden. Der Auftraggeber hat sich von der Einhaltung der beim Auftragnehmer
getroffenen technischen und organisatorischen Ma&szlig;nahmen zu
&uuml;berzeugen.<BR> <BR>

(3) Der Auftragnehmer darf die Daten nur im Rahmen der Weisungen des
Auftraggebers erheben, verarbeiten oder nutzen. Ist er der Ansicht, dass
eine Weisung des Auftraggebers gegen dieses Gesetz oder andere Vorschriften
&uuml;ber den Datenschutz verst&ouml;&szlig;t, hat er den Auftraggeber
unverz&uuml;glich darauf hinzuweisen.<BR> <BR>

(4) F&uuml;r den Auftragnehmer gelten neben den &sect;&sect; 5, 9, 43 Abs.
1 Nr. 2, 10 und 11, Abs. 2 Nr. 1 bis 3 und Abs. 3 sowie &sect; 44 nur die
Vorschriften &uuml;ber die Datenschutzkontrolle oder die Aufsicht, und zwar
f&uuml;r

<OL>
<LI>a) &ouml;ffentliche Stellen,<BR>
b) nicht &ouml;ffentliche Stellen, bei denen der &ouml;ffentlichen Hand die
Mehrheit der Anteile geh&ouml;rt oder die Mehrheit der Stimmen zusteht und
der Auftraggeber eine &ouml;ffentliche Stelle ist, die
&sect;&sect;&nbsp;18, 24 bis 26 oder die entsprechenden Vorschriften der
Datenschutzgesetze der L&auml;nder,</LI>

<LI>die &uuml;brigen nicht &ouml;ffentlichen Stellen, soweit sie
personenbezogene Daten im Auftrag als Dienstleistungsunternehmen
gesch&auml;ftsm&auml;&szlig;ig erheben, verarbeiten oder nutzen, die
&sect;&sect;&nbsp;4&nbsp;f , 4&nbsp;g und 38.</LI>
</OL>
(5) Die Abs&auml;tze 1 bis 4 gelten entsprechend, wenn
die Pr&uuml;fung oder Wartung automatisierter Verfahren
oder von Datenverarbeitungsanlagen durch andere Stellen
im Auftrag vorgenommen wird und dabei ein Zugriff auf
personenbezogene Daten nicht ausgeschlossen werden
kann.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><FONT size="+1">Zweiter Abschnitt</FONT><BR>
Datenverarbeitung der &ouml;ffentlichen Stellen<BR>
Erster Unterabschnitt - Rechtsgrundlagen der
Datenverarbeitung</B></P>

<P><B><A name="&sect; 12">&sect;&nbsp;12</A>
Anwendungsbereich</B></P>
(1) Die Vorschriften dieses Abschnittes gelten f&uuml;r
&ouml;ffentliche Stellen des Bundes, soweit sie nicht als
&ouml;ffentlich-rechtliche Unternehmen am Wettbewerb
teilnehmen.<BR>
<BR>

(2) Soweit der Datenschutz nicht durch Landesgesetz geregelt ist, gelten
die &sect;&sect;&nbsp;12 <B></B>bis 16, <B></B>19 <B></B>bis <B></B>20 auch
f&uuml;r die &ouml;ffentlichen Stellen der L&auml;nder, soweit sie

<OL>
<LI>Bundesrecht ausf&uuml;hren und nicht als &ouml;ffentlich-rechtliche
Unternehmen am Wettbewerb teilnehmen oder</LI>

<LI>als Organe der Rechtspflege t&auml;tig werden und es sich nicht um
Verwaltungsangelegenheiten handelt.</LI>
</OL>

(3) F&uuml;r Landesbeauftragte f&uuml;r den Datenschutz gilt &sect;&nbsp;23
Abs.&nbsp;4 entsprechend.<BR> <BR>

(4) Werden personenbezogene Daten f&uuml;r fr&uuml;here, bestehende oder
zuk&uuml;nftige dienst- oder arbeitsrechtliche Rechtsverh&auml;ltnisse
erhoben, verarbeitet oder genutzt, gelten anstelle der &sect;&sect;&nbsp;13
bis 16, 19 bis 20 der &sect;&nbsp;28 Abs.&nbsp;1 und 3 Nr.&nbsp;1 sowie die
&sect;&sect;&nbsp;33 bis 35, auch soweit personenbezogene Daten weder
automatisiert verarbeitet noch in nicht automatisierten Dateien verarbeitet
oder genutzt oder daf&uuml;r erhoben werden.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 13">&sect;&nbsp;13</A> Datenerhebung</B></P>

(1) Das Erheben personenbezogener Daten ist zul&auml;ssig, wenn ihre
Kenntnis zur Erf&uuml;llung der Aufgaben der verantwortlichen Stelle
erforderlich ist.<BR> <BR>

(1a) Werden personenbezogene Daten statt beim Betroffenen bei einer nicht
&ouml;ffentlichen Stelle erhoben, so ist die Stelle auf die
Rechtsvorschrift, die zur Auskunft vepflichtet, sonst auf die
Freiwilligkeit ihrer Angaben hinzuweisen.<BR> <BR>

(2) Das Erheben besonderer Arten personenbezogener Daten (&sect;&nbsp;3
Abs.&nbsp;9) ist nur zul&auml;ssig, soweit

<OL>
<LI>eine Rechtsvorschrift dies vorsieht oder aus Gr&uuml;nden eines
wichtigen &ouml;ffentlichen Interesses zwingend erfordert,</LI>

<LI>der Betroffene nach Ma&szlig;gabe des &sect;&nbsp;4a Abs.&nbsp;3
eingewilligt hat,</LI>

<LI>dies zum Schutz lebenswichtiger Interessen des Betroffenen oder eines
Dritten erforderlich ist, sofern der Betroffene aus physischen oder
rechtlichen Gr&uuml;nden au&szlig;erstande ist, seine Einwilligung zu
geben,</LI>

<LI>es sich um Daten handelt, die der Betroffene offenkundig
&ouml;ffentlich gemacht hat,</LI>

<LI>dies zur Abwehr einer erhelbichen Gefahr f&uuml;r die &ouml;ffentliche
Sicherheit erforderlich ist,</LI>

<LI>dies zur Abwehr erheblicher Nachteile f&uuml;r das Gemeinwohl oder zur
Wahrung erheblicher Belange des Gemeinwohls zwingend erforderlich ist,</LI>

<LI>dies zum Zweck der Gesundheitsvorsorge, der medizinischen Diagnostik,
der Gesundheitsversorgung oder Behandlung oder f&uuml;r die Verwaltung von
Gesundheitsdiensten erforderlich ist und die Verarbeitung dieser Daten
durch &auml;rztliches Personal oder durch sonstige Personen erfolgt, die
einer entsprechenden Geheimhaltungspflicht unterliegen,</LI>

<LI>dies zur Durchf&uuml;hrung wissenschaftlicher Forschung erforderlich
ist, das wissenschaftliche Interesse an der Durchf&uuml;hrung des
Forschungsvorhabens das Interesse des Betroffenen an dem Ausschluss der
Erhebung erheblich &uuml;berwiegt und der Zweck der Forschung auf andere
Weise nicht oder nur mit unverh&auml;ltnism&auml;&szlig;igem Aufwand
erreicht werden kann oder</LI>

<LI>dies aus zwingenden Gr&uuml;nden der Verteidigung oder der
Erf&uuml;llung &uuml;ber- oder zwischenstaatlicher Verpflichtungen einer
&ouml;ffentlichen Stelle des Bundes auf dem Gebiet der
Krisenbew&auml;ltigung oder Konfliktverhinderung oder f&uuml;r
humanit&auml;re Ma&szlig;nahmen erforderlich ist.</LI>
</OL>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 14">&sect;&nbsp;14</A> Datenspeicherung,
-ver&auml;nderung und -nutzung</B></P>

(1) Das Speichern, Ver&auml;ndern oder Nutzen personenbezogener Daten ist
zul&auml;ssig, wenn es zur Erf&uuml;llung der in der Zust&auml;ndigkeit der
verantwortlichen Stelle liegenden Aufgaben erforderlich ist und es f&uuml;r
die Zwecke erfolgt, f&uuml;r die die Daten erhoben worden sind. Ist keine
Erhebung vorausgegangen, d&uuml;rfen die Daten nur f&uuml;r die Zwecke
ge&auml;ndert oder genutzt werden, f&uuml;r die sie gespeichert worden
sind.<BR> <BR>
           

(2) Das Speichern, Ver&auml;ndern oder Nutzen f&uuml;r andere Zwecke ist
nur zul&auml;ssig, wenn<BR> <BR>

<OL>
<LI>eine Rechtsvorschrift dies vorsieht oder zwingend voraussetzt,</LI>

<LI>der Betroffene eingewilligt hat,</LI>

<LI>offensichtlich ist, dass es im Interesse des Betroffenen liegt, und
kein Grund zu der Annahme besteht, dass er in Kenntnis des anderen Zwecks
seine Einwilligung verweigern w&uuml;rde,</LI>

<LI>Angaben des Betroffenen &uuml;berpr&uuml;ft werden m&uuml;ssen, weil
tats&auml;chliche Anhaltspunkte f&uuml;r deren Unrichtigkeit bestehen,</LI>

<LI>die Daten allgemein zug&auml;nglich sind oder die verantwortliche
Stelle sie ver&ouml;ffentlichen d&uuml;rfte, es sei denn, dass das
schutzw&uuml;rdige Interesse des Betroffenen an dem Ausschluss der
Zweck&auml;nderung offensichtlich &uuml;berwiegt,</LI>

<LI>es zur Abwehr erheblicher Nachteile f&uuml;r das Gemeinwohl oder einer
Gefahr f&uuml;r die &ouml;ffentliche Sicherheit oder zur Wahrung
erheblicher Belange des Gemeinwohls erforderlich ist,</LI>

<LI>es zur Verfolgung von Straftaten oder Ordnungswidrigkeiten, zur
Vollstreckung oder zum Vollzug von Strafen oder Ma&szlig;nahmen im Sinne
des &sect;&nbsp;11 Abs.&nbsp;1 Nr.&nbsp;8 des Strafgesetzbuches oder von
Erziehungsma&szlig;regeln oder Zuchtmitteln im Sinne des
Jugendgerichtsgesetzes oder zur Vollstreckung von
Bu&szlig;geldentscheidungen erforderlich ist,</LI>

<LI>es zur Abwehr einer schwerwiegenden Beeintr&auml;chtigung der Rechte
einer anderen Person erforderlich ist oder</LI>

<LI>es zur Durchf&uuml;hrung wissenschaftlicher Forschung erforderlich ist,
das wissenschaftliche Interesse an der Durchf&uuml;hrung des
Forschungsvorhabens das Interesse des Betroffenen an dem Ausschluss der
Zweck&auml;nderung erheblich&uuml;berwiegt und der Zweck der Forschung auf
andere Weise nicht oder nur mit unverh&auml;ltnism&auml;&szlig;igem Aufwand
erreicht werden kann.</LI>
</OL>

(3) Eine Verarbeitung oder Nutzung f&uuml;r andere Zwecke liegt nicht vor,
wenn sie der Wahrnehmung von Aufsichtsund Kontrollbefugnissen, der
Rechnungspr&uuml;fung oder der Durchf&uuml;hrung von
Organisationsuntersuchungen f&uuml;r die verantwortliche Stelle dient. Das
gilt auch f&uuml;r die Verarbeitung oder Nutzung zu Ausbildungsund
Pr&uuml;fungszwecken durch die verantwortliche Stelle, soweit nicht
&uuml;berwiegende schutzw&uuml;rdige Interessen des Betroffenen
entgegenstehen.<BR> <BR>

(4) Personenbezogene Daten, die ausschlie&szlig;lich zu Zwecken der
Datenschutz-kontrolle, der Datensicherung oder zur Sicherstellung eines
ordnungsgem&auml;&szlig;en Betriebes einer Datenverarbeitungsanlage
gespeichert werden, d&uuml;rfen nur f&uuml;r diese Zwecke verwendet
werden.<BR> <BR>

(5) Das Speichern, Ver&auml;ndern oder Nutzen von besonderen Arten
personen-bezogener Daten (&sect;&nbsp;3 Abs.&nbsp;9) f&uuml;r andere Zwecke
ist nur zul&auml;ssig, wenn

<OL>
<LI>die Voraussetzungen vorliegen, die eine Erhebung nach &sect;&nbsp;13
Abs.&nbsp;2 Nr.&nbsp;1 bis 6oder 9 zulassen w&uuml;rden oder</LI>

<LI>dies zur Durchf&uuml;hrung wissenschaftlicher Forschung erforderlich
ist, das &ouml;ffentliche Interesse an der Durchf&uuml;hrung des
Forschungsvorhabens das Interesse des Betroffenen an dem Ausschluss der
Zweck&auml;nderung erheblich &uuml;berwiegt und der Zweck der Forschung auf
andere Weise nicht oder nur mit unverh&auml;ltnism&auml;&szlig;igem Aufwand
erreicht werden kann.</LI>
</OL>

Bei der Abw&auml;gung nach Satz&nbsp;1 Nr.&nbsp;2 ist im Rahmen des
&ouml;ffentlichen Interesses das wissenschaftliche Interesse an dem
Forschungsvorhaben besonders zu ber&uuml;cksichtigen.<BR> <BR>

(6) Die Speicherung, Ver&auml;nderung oder Nutzung von besonderen Arten
personen-bezogener Daten (&sect;&nbsp;3 Abs.&nbsp;9) zu den in
&sect;&nbsp;13 Abs.&nbsp;2 Nr.&nbsp;7 genannten Zwecken richtet sich nach
den f&uuml;r die in &sect;&nbsp;13 Abs.&nbsp;2 Nr.&nbsp;7 genannten
Personen geltenden Geheimhaltungspflichten.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 15">&sect;&nbsp;15</A> Daten&uuml;bermittlung an
&ouml;ffentliche Stellen</B></P>

(1) Die &Uuml;bermittlung personenbezogener Daten an &ouml;ffentliche
Stellen ist zul&auml;ssig, wenn

<OL>
<LI>sie zur Erf&uuml;llung der in der Zust&auml;ndigkeit der
&uuml;bermittelnden Stelle oder des Dritten, an den die Daten
&uuml;bermittelt werden, liegenden Aufgaben erforderlich ist und</LI>

<LI>die Voraussetzungen vorliegen, die eine Nutzung nach &sect;&nbsp;14
zulassen w&uuml;rden.</LI>
</OL>

(2) Die Verantwortung f&uuml;r die Zul&auml;ssigkeit der &Uuml;bermittlung
tr&auml;gt die &uuml;bermittelnde Stelle. Erfolgt die &Uuml;bermittlung auf
Ersuchen des Dritten, an den die Daten &uuml;bermittelt werden, tr&auml;gt
dieser die Verantwortung. In diesem Falle pr&uuml;ft die &uuml;bermittelnde
Stelle nur, ob das &Uuml;bermittlungsersuchen im Rahmen der Aufgaben des
Dritten, an den die Daten &uuml;bermittelt werden, liegt, es sei denn, dass
besonderer Anlass zur Pr&uuml;fung der Zul&auml;ssigkeit der
&Uuml;bermittlung besteht. &sect;&nbsp;10 Abs.&nbsp;4 bleibt
unber&uuml;hrt.<BR> <BR>

(3) Der Dritte, an den die Daten &uuml;bermittelt werden, darf diese
f&uuml;r den Zweck verarbeiten oder nutzen, zu dessen Erf&uuml;llung sie
ihm &uuml;bermittelt werden. Eine Verarbeitung oder Nutzung f&uuml;r andere
Zwecke ist nur unter den Voraussetzungen des &sect;&nbsp;14 Abs.&nbsp;2
zul&auml;ssig.<BR> <BR>

(4) F&uuml;r die &Uuml;bermittlung personenbezogener Daten an Stellen der
&ouml;ffentlich-rechtlichen Religionsgesellschaften gelten die
Abs&auml;tze&nbsp;1 bis 3 entsprechend, sofern sichergestellt ist, dass bei
diesen ausreichende Datenschutzma&szlig;nahmen getroffen werden.<BR> <BR>

(5) Sind mit personenbezogenen Daten, die nach Absatz 1 &uuml;bermittelt
werden d&uuml;rfen, weitere personenbezogene Daten des Betroffenen oder
eines Dritten so verbunden, dass eine Trennung nicht oder nur mit
unvertretbarem Aufwand m&ouml;glich ist, so ist die &Uuml;bermittlung auch
dieser Daten zul&auml;ssig, soweit nicht berechtigte Interessen des
Betroffenen oder eines Dritten an deren Geheimhaltung offensichtlich
&uuml;berwiegen; eine Nutzung dieser Daten ist unzul&auml;ssig.<BR> <BR>

(6) Absatz 5 gilt entsprechend, wenn personenbezogene Daten innerhalb einer
&ouml;ffentlichen Stelle weitergegeben werden.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 16">&sect;&nbsp;16</A> Daten&uuml;bermittlung an
nicht-&ouml;ffentliche Stellen</B></P>

(1) Die &Uuml;bermittlung personenbezogener Daten an nicht &ouml;ffentliche
Stellen ist zul&auml;ssig, wenn

<OL>
<LI>sie zur Erf&uuml;llung der in der Zust&auml;ndigkeit der
&uuml;bermittelnden Stelle liegenden Aufgaben erforderlich ist und die
Voraussetzungen vorliegen, die eine Nutzung nach &sect;&nbsp;14 zulassen
w&uuml;rden, oder</LI>

<LI>der Dritte, an den die Daten &uuml;bermittelt werden, ein berechtigtes
Interesse an der Kenntnis der zu &uuml;bermittelnden Daten glaubhaft
darlegt und der Betroffene kein schutzw&uuml;rdiges Interesse an dem
Ausschluss der &Uuml;bermittlung hat. Das &Uuml;bermitteln von besonderen
Arten personenbezogener Daten (&sect;&nbsp;3 Abs.&nbsp;9) ist abweichend
von Satz&nbsp;1 Nr.&nbsp;2 nur zul&auml;ssig, wenn die Voraussetzungen
vorliegen, die eine Nutzung nach &sect;&nbsp;14 Abs.&nbsp;5 und 6 zulassen
w&uuml;rden oder soweit dies zur Geltendmachung, Aus&uuml;bung oder
Verteidigung rechtlicher Anspr&uuml;che erforderlich ist.</LI>
</OL>

(2) Die Verantwortung f&uuml;r die Zul&auml;ssigkeit der &Uuml;bermittlung
tr&auml;gt die &uuml;bermittelnde Stelle.<BR> <BR>

(3) In den F&auml;llen der &Uuml;bermittlung nach Absatz&nbsp;1 Nr.&nbsp;2
unterrichtet die &uuml;bermittelnde Stelle den Betroffenen von der
&Uuml;bermittlung seiner Daten. Dies gilt nicht, wenn damit zu rechnen ist,
dass er davon auf andere Weise Kenntnis erlangt, oder wenn die
Unterrichtung die &ouml;ffentliche Sicherheit gef&auml;hrden oder sonst dem
Wohle des Bundes oder eines Landes Nachteile bereiten w&uuml;rde.<BR> <BR>

(4) Der Dritte, an den die Daten &uuml;bermittelt werden, darf diese nur
f&uuml;r den Zweck verarbeiten oder nutzen, zu dessen Erf&uuml;llung sie
ihm &uuml;bermittelt werden. Die &uuml;bermittelnde Stelle hat ihn darauf
hinzuweisen. Eine Verarbeitung oder Nutzung f&uuml;r andere Zwecke ist
zul&auml;ssig, wenn eine &Uuml;bermittlung nach Absatz&nbsp;1 zul&auml;ssig
w&auml;re und die &uuml;bermittelnde Stelle zugestimmt hat.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 17">&sect;&nbsp;17</A> Daten&uuml;bermittlung an
Stellen au&szlig;erhalb des Geltungsbereiches</B></P>

dieses Gesetz ist weggefallen.<BR>
<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 18">&sect;&nbsp;18</A> Durchf&uuml;hrung des
Datenschutzes in der Bundesverwaltung</B></P>

(1) Die obersten Bundesbeh&ouml;rden, der Pr&auml;sident des
Bundeseisenbahnverm&ouml;gens, sowie die bundesunmittelbaren
K&ouml;rperschaften, Anstalten und Stiftungen des &ouml;ffentlichen Rechts,
&uuml;ber die von der Bundesregierung oder einer obersten
Bundesbeh&ouml;rde lediglich die Rechtsaufsicht ausge&uuml;bt wird, haben
f&uuml;r ihren Gesch&auml;ftsbereich die Ausf&uuml;hrung dieses Gesetzes
sowie anderer Rechtsvorschriften &uuml;ber den Datenschutz sicherzustellen.
Das gleiche gilt f&uuml;r die Vorst&auml;nde der aus dem
Sonderverm&ouml;gen Deutsche Bundespost durch Gesetz hervorgegangenen
Unternehmen, solange ihnen ein ausschlie&szlig;liches Recht nach dem
Postgesetz zusteht.<BR> <BR>

(2) Die &ouml;ffentlichen Stellen f&uuml;hren ein Verzeichnis der
eingesetzten Daten-verarbeitungsanlagen. F&uuml;r ihre automatisierten
Verarbeitungen haben sie die Angaben nach &sect;&nbsp;4e sowie die
Rechtsgrundlage der Verarbeitung schriftlich festzulegen. Bei allgemeinen
Verwaltungszwecken dienenden automatisierten Verarbeitungen, bei welchen
das Auskunftsrecht des Betroffenen nicht nach &sect;&nbsp;19 Abs.&nbsp;3
oder 4 eingeschr&auml;nkt wird, kann hiervon abgesehen werden. F&uuml;r
automatisierte Verarbeitungen, die in gleicher oder &auml;hnlicher Weise
mehrfach gef&uuml;hrt werden, k&ouml;nnen die Festlegungen zusammengefasst
werden.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B>Zweiter Unterabschnitt - Rechte des Betroffenen</B></P>

<P><B><A name="&sect; 19">&sect; 19</A> Auskunft an den Betroffenen</B></P>

(1) Dem Betroffenen ist auf Antrag Auskunft zu erteilen &uuml;ber

<OL>
<LI>die zu seiner Person gespeicherten Daten, auch soweit sie sich auf die
Herkunft dieser Daten beziehen,</LI>

<LI>die Empf&auml;nger oder Kategorien von Empf&auml;ngern, an die die
Daten weitergegeben werden, und</LI>

<LI>den Zweck der Speicherung.</LI>
</OL>

In dem Antrag soll die Art der personenbezogenen Daten, &uuml;ber die
Auskunft erteilt werden soll, n&auml;her bezeichnet werden. Sind die
personenbezogenen Daten weder automatisiert noch in nicht automatisierten
Dateien gespeichert, wird die Auskunft nur erteilt, soweit der Betroffene
Angaben macht, die das Auffinden der Daten erm&ouml;glichen, und der
f&uuml;r die Erteilung der Auskunft erforderliche Aufwand nicht au&szlig;er
Verh&auml;ltnis zu dem vom Betroffenen geltend gemachten
Informationsinteresse steht. Die verantwortliche Stelle bestimmt das
Verfahren, insbesondere die Form der Auskunftserteilung, nach
pflichtgem&auml;&szlig;em Ermessen.<BR> <BR>

(2) Absatz 1 gilt nicht f&uuml;r personenbezogene Daten, die nur deshalb
gespeichert sind, weil sie aufgrund gesetzlicher,
satzungsm&auml;&szlig;iger oder vertraglicher Aufbewahrungsvorschriften
nicht gel&ouml;scht werden d&uuml;rfen, oder ausschlie&szlig;lich Zwecken
der Datensicherung oder der Datenschutzkontrolle dienen und eine
Auskunftserteilung einen unverh&auml;ltnism&auml;&szlig;igen Aufwand
erfordern w&uuml;rde.<BR> <BR>

(3) Bezieht sich die Auskunftserteilung auf die &Uuml;bermittlung
personenbezogener Daten an Verfassungsschutzbeh&ouml;rden, den
Bundesnachrichtendienst, den Milit&auml;rischen Abschirmdienst und, soweit
die Sicherheit des Bundes ber&uuml;hrt wird, andere Beh&ouml;rden des
Bundesministeriums der Verteidigung, ist sie nur mit Zustimmung dieser
Stellen zul&auml;ssig.<BR> <BR>

(4) Die Auskunftserteilung unterbleibt, soweit 

<OL>
<LI>die Auskunft die ordnungsgem&auml;&szlig;e Erf&uuml;llung der in der
Zust&auml;ndigkeit der verantwortlichen Stelle liegenden Aufgaben
gef&auml;hrden w&uuml;rde,</LI>

<LI>die Auskunft die &ouml;ffentliche Sicherheit oder Ordnung
gef&auml;hrden oder sonst dem Wohle des Bundes oder eines Landes Nachteile
bereiten w&uuml;rde oder</LI>

<LI>die Daten oder die Tatsache ihrer Speicherung nach einer
Rechtsvorschrift oder ihrem Wesen nach, insbesondere wegen der
&uuml;berwiegenden berechtigten Interessen eines Dritten, geheimgehalten
werden m&uuml;ssen</LI>
</OL>

und deswegen das Interesse des Betroffenen an der Auskunftserteilung
zur&uuml;cktreten muss.<BR> <BR>

(5) Die Ablehnung der Auskunftserteilung bedarf einer Begr&uuml;ndung
nicht, soweit durch die Mitteilung der tats&auml;chlichen und rechtlichen
Gr&uuml;nde, auf die die Entscheidung gest&uuml;tzt wird, der mit der
Auskunftsverweigerung verfolgte Zweck gef&auml;hrdet w&uuml;rde. In diesem
Falle ist der Betroffene darauf hinzuweisen, dass er sich an den
Bundesbeauftragten f&uuml;r den Datenschutz wenden kann.<BR> <BR>

(6) Wird dem Betroffenen keine Auskunft erteilt, so ist sie auf sein
Verlangen dem Bundesbeauftragten f&uuml;r den Datenschutz zu erteilen,
soweit nicht die jeweils zust&auml;ndige oberste Bundesbeh&ouml;rde im
Einzelfall feststellt, dass dadurch die Sicherheit des Bundes oder eines
Landes gef&auml;hrdet w&uuml;rde. Die Mitteilung des Bundesbeauftragten an
den Betroffenen darf keine R&uuml;ckschl&uuml;sse auf den Erkenntnisstand
der verantwortlichen Stelle zulassen, sofern diese nicht einer
weitergehenden Auskunft zustimmt.<BR> <BR>

(7) Die Auskunft ist unentgeltlich.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 19a">&sect;&nbsp;19a</A> Benachrichtigung</B></P>

(1) Werden Daten ohne Kenntnis des Betroffenen erhoben, so ist er von der
Speicherung, der Identit&auml;t der verantwortlichen Stelle sowie &uuml;ber
die Zweck-bestimmungen der Erhebung, Verarbeitung oder Nutzung zu
unterrichten. Der Betroffene ist auch &uuml;ber die Empf&auml;nger oder
Kategorien von Empf&auml;ngern von Daten zu unterrichten, soweit er nicht
mit der &Uuml;bermittlung an diese rechnen muss. Sofern eine
&Uuml;bermittlung vorgesehen ist, hat die Unterrichtung sp&auml;testens bei
der ersten &Uuml;bermittlung zu erfolgen.<BR> <BR>

(2) Eine Pflicht zur Benachrichtigung besteht nicht, wenn

<OL>
<LI>der Betroffene auf andere Weise Kenntnis von der Speicherung oder der
&Uuml;bermittlung erlangt hat,</LI>

<LI>die Unterrichtung des Betroffenen einen
unverh&auml;ltnism&auml;&szlig;igen Aufwand erfordert oder</LI>

<LI>die Speicherung oder &Uuml;bermittlung der personenbezogenen Daten
durch Gesetz ausdr&uuml;cklich vorgesehen ist.</LI>
</OL>

Die verantwortliche Stelle legt schriftlich fest, unter welchen
Voraussetzungen von einer Benachrichtigung nach Nummer 2 oder 3 abgesehen
wird.<BR> <BR>

(3) &sect;&nbsp;19 Abs.&nbsp;2 bis 4 gilt entsprechend.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 20">&sect;&nbsp;20</A> Berichtigung, L&ouml;schung
und Sperrung von Daten; Widerspruchsrecht</B></P>

(1) Personenbezogene Daten sind zu berichtigen, wenn sie unrichtig sind.
Wird festgestellt, dass personenbezogene Daten, die weder automatisiert
verarbeitet noch in nicht automatisierten Dateien gespeichert sind,
unrichtig sind, oder wird ihre Richtigkeit von dem Betroffenen bestritten,
so ist dies in geeigneter Weise festzuhalten.<BR> <BR>

(2) Personenbezogene Daten, die automatisiert verarbeitet oder in nicht
automatisierten Dateien gespeichert sind, sind zu l&ouml;schen, wenn

<OL>
<LI>ihre Speicherung unzul&auml;ssig ist oder</LI>

<LI>ihre Kenntnis f&uuml;r die verantwortliche Stelle zur Erf&uuml;llung
der in ihrer Zust&auml;ndigkeit liegenden Aufgaben nicht mehr erforderlich
ist.</LI>
</OL>

(3) An die Stelle einer L&ouml;schung tritt eine Sperrung, soweit

<OL>
<LI>einer L&ouml;schung gesetzliche, satzungsm&auml;&szlig;ige oder
vertragliche Aufbewahrungs-fristen entgegenstehen,</LI>

<LI>Grund zu der Annahme besteht, dass durch eine L&ouml;schung
schutzw&uuml;rdige Interessen des Betroffenen beeintr&auml;chtigt
w&uuml;rden, oder</LI>

<LI>eine L&ouml;schung wegen der besonderen Art der Speicherung nicht oder
nur mit unverh&auml;ltnism&auml;&szlig;ig hohem Aufwand m&ouml;glich
ist.</LI>
</OL>

(4) Personenbezogene Daten, die automatisiert verarbeitet oder in nicht
automatisierten Dateien gespeichert sind, sind ferner zu sperren, soweit
ihre Richtigkeit vom Betroffenen bestritten wird und sich weder die
Richtigkeit noch die Unrichtigkeit feststellen l&auml;sst.<BR> <BR>

(5) Personenbezogene Daten d&uuml;rfen nicht f&uuml;r eine automatisierte
Verarbeitung oder Verarbeitung in nicht automatisierten Dateien erhoben,
verarbeitet oder genutzt werden, soweit der Betroffene dieser bei der
verantwortlichen Stelle widerspricht und eine Pr&uuml;fung ergibt, dass das
schutzw&uuml;rdige Interesse des Betroffenen wegen seiner besonderen
pers&ouml;nlichen Situation das Interesse der verantwortlichen Stelle an
dieser Erhebung, Verarbeitung oder Nutzung &uuml;berwiegt. Satz 1 gilt
nicht, wenn eine Rechtsvorschrift zur Erhebung, Verarbeitung oder Nutzung
verpflichtet.<BR> <BR>

(6) Personenbezogene Daten, die weder automatisiert verarbeitet noch in
einer nicht automatisierten Datei gespeichert sind, sind zu sperren, wenn
die Beh&ouml;rde im Einzelfall feststellt, dass ohne die Sperrung
schutzw&uuml;rdige Interessen des Betroffenen beeintr&auml;chtigt
w&uuml;rden und die Daten f&uuml;r die Aufgabenerf&uuml;llung der
Beh&ouml;rde nicht mehr erforderlich sind.<BR> <BR>

(7) Gesperrte Daten d&uuml;rfen ohne Einwilligung des Betroffenen nur
&uuml;bermittelt oder genutzt werden, wenn

<OL>
<LI>es zu wissenschaftlichen Zwecken, zur Behebung einer bestehenden
Beweisnot oder aus sonstigen im &uuml;berwiegenden Interesse der
verantwortlichen Stelleoder eines Dritten liegenden Gr&uuml;nden
unerl&auml;sslich ist und</LI>

<LI>die Daten hierf&uuml;r &uuml;bermittelt oder genutzt werden
d&uuml;rften, wenn sie nicht gesperrt w&auml;ren</LI>
</OL>

(8) Von der Berichtigung unrichtiger Daten, der Sperrung bestrittener Daten
sowie der L&ouml;schung oder Sperrung wegen Unzul&auml;ssigkeit der
Speicherung sind die Stellen zu verst&auml;ndigen, denen im Rahmen einer
Daten&uuml;bermittlung diese Daten zur Speicherung weitergegeben wurden,
wenn dies keinen unverh&auml;ltnism&auml;&szlig;igen Aufwand erfordert und
schutzw&uuml;rdige Interessen des Betroffenen nicht entgegenstehen.<BR>
<BR>

(9) &sect;&nbsp;2 Abs.&nbsp;1 bis 6, 8 und 9 des Bundesarchivgesetzes ist
anzuwenden.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 21">&sect;&nbsp;21</A> Anrufung des
Bundesbeauftragten f&uuml;r den Datenschutz</B></P>

Jedermann kann sich an den Bundesbeauftragten f&uuml;r den Datenschutz
wenden, wenn er der Ansicht ist, bei der Erhebung, Verarbeitung oder
Nutzung seiner personenbezogenen Daten durch &ouml;ffentliche Stellen des
Bundes in seinen Rechten verletzt worden zu sein. F&uuml;r die Erhebung,
Verarbeitung oder Nutzung von personenbezogenen Daten durch Gerichte des
Bundes gilt dies nur, soweit diese in Verwaltungsangelegenheiten t&auml;tig
werden.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B>Dritter Unterabschnitt - Bundesbeauftragter f&uuml;r den
Datenschutz</B></P>

<P><B><A name="&sect; 22">&sect;&nbsp;22</A> Wahl des Bundesbeauftragten
f&uuml;r den Datenschutz</B></P> (1) Der Deutsche Bundestag w&auml;hlt auf
Vorschlag der Bundesregierung den Bundesbeauftragten f&uuml;r den
Datenschutz mit mehr als der H&auml;lfte der gesetzlichen Zahl seiner
Mitglieder. Der Bundesbeauftragte muss bei seiner Wahl das 35. Lebensjahr
vollendet haben. Der Gew&auml;hlte ist vom Bundespr&auml;sidenten zu
ernennen.<BR> <BR>

(2) Der Bundesbeauftragte leistet vor dem Bundesminister des Innern
folgenden Eid:

<BLOCKQUOTE>
"Ich schw&ouml;re, dass ich meine Kraft dem Wohle des deutschen Volkes
widmen, seinen Nutzen mehren, Schaden von ihm wenden, das Grundgesetz und
die Gesetze des Bundes wahren und verteidigen, meine Pflichten gewissenhaft
erf&uuml;llen und Gerechtigkeit gegen jedermann &uuml;ben werde. So wahr
mir Gott helfe."
</BLOCKQUOTE>

Der Eid kann auch ohne religi&ouml;se Beteuerung geleistet werden.<BR> <BR>

(3) Die Amtszeit des Bundesbeauftragten betr&auml;gt f&uuml;nf Jahre.
Einmalige Wiederwahl ist zul&auml;ssig.<BR> <BR>

(4) Der Bundesbeauftragte steht nach Ma&szlig;gabe dieses Gesetzes zum Bund
in einem &ouml;ffentlich-rechtlichen Amtsverh&auml;ltnis. er ist in
Aus&uuml;bung seines Amtes unabh&auml;ngig und nur dem Gesetz unterworfen.
Er untersteht der Rechtsaufsicht der Bundesregierung.<BR> <BR>

(5) Der Bundesbeauftragte wird beim Bundesministerium des Innern
eingerichtet. Er untersteht der Dienstaufsicht des Bundesministeriums des
Innern. Dem Bundesbeauftragten ist die f&uuml;r die Erf&uuml;llung seiner
Aufgaben notwendige Personal- und Sachausstattung zur Verf&uuml;gung zu
stellen; sie ist im Einzelplan des Bundesministeriums des Innern in einem
eigenen Kapitel auszuweisen. Die Stellen sind im Einvernehmen mit dem
Bundesbeauftragten zu besetzen. Die Mitarbeiter k&ouml;nnen, falls sie mit
der beabsichtigten Ma&szlig;nahme nicht einverstanden sind, nur im
Einvernehmen mit ihm versetzt, abgeordnet oder umgesetzt werden.<BR> <BR>

(6) Ist der Bundesbeauftragte vor&uuml;bergehend an der Aus&uuml;bung
seines Amtes verhindert, kann der Bundesminister des Innern einen Vertreter
mit der Wahrnehmung der Gesch&auml;fte beauftragen. Der Bundesbeauftragte
soll dazu geh&ouml;rt werden.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 23">&sect;&nbsp;23</A> Rechtsstellung des
Bundesbeauftragten f&uuml;r den Datenschutz</B></P>

(1) Das Amtsverh&auml;ltnis des Bundesbeauftragten f&uuml;r den Datenschutz
beginnt mit der Aush&auml;ndigung der Ernennungsurkunde. Es endet

<OL>
<LI>mit Ablauf der Amtszeit,</LI>

<LI>mit der Entlassung.</LI>
</OL>

Der Bundespr&auml;sident entl&auml;sst den Bundesbeauftragten, wenn dieser
es verlangt oder auf Vorschlag der Bundesregierung, wenn Gr&uuml;nde
vorliegen, die bei einem Richter auf Lebenszeit die Entlassung aus dem
Dienst rechtfertigen. Im Falle der Beendigung des Amtsverh&auml;ltnisses
erh&auml;lt der Bundesbeauftragte eine vom Bundespr&auml;sidenten
vollzogene Urkunde. Eine Entlassung wird mit der Aush&auml;ndigung der
Urkunde wirksam. Auf Ersuchen des Bundesministers des Innern ist der
Bundesbeauftragte verpflichtet, die Gesch&auml;fte bis zur Ernennung seines
Nachfolgers weiterzuf&uuml;hren.<BR> <BR>

(2) Der Bundesbeauftragte darf neben seinem Amt kein anderes besoldetes
Amt, kein Gewerbe und keinen Beruf aus&uuml;ben und weder der Leitung oder
dem Aufsichtsrat oder Verwaltungsrat eines auf Erwerb gerichteten
Unternehmens noch einer Regierung oder einer gesetzgebenden
K&ouml;rperschaft des Bundes oder eines Landes angeh&ouml;ren. Er darf
nicht gegen Entgelt au&szlig;ergerichtliche Gutachten abgeben.<BR> <BR>

(3) Der Bundesbeauftragte hat dem Bundesministerium des Innern Mitteilung
&uuml;ber Geschenke zu machen, die er in bezug auf sein Amt erh&auml;lt.
Das Bundesministerium des Innern entscheidet &uuml;ber die Verwendung der
Geschenke.<BR> <BR>

(4) Der Bundesbeauftragte ist berechtigt, &uuml;ber Personen, die ihm in
seiner Eigenschaft als Bundesbeauftragter Tatsachen anvertraut haben, sowie
&uuml;ber diese Tatsachen selbst das Zeugnis zu verweigern. Dies gilt auch
f&uuml;r die Mitarbeiter des Bundesbeauftragten mit der Ma&szlig;gabe, dass
&uuml;ber die Aus&uuml;bung dieses Rechts der Bundesbeauftragte
entscheidet. Soweit das Zeugnisverweigerungsrecht des Bundesbeauftragten
reicht, darf die Vorlegung oder Auslieferung von Akten oder anderen
Schriftst&uuml;cken von ihm nicht gefordert werden.<BR> <BR>

(5) Der Bundesbeauftragte ist, auch nach Beendigung seines
Amtsverh&auml;ltnisses, verpflichtet, &uuml;ber die ihm amtlich
bekanntgewordenen Angelegenheiten Verschwiegenheit zu bewahren. Dies gilt
nicht f&uuml;r Mitteilungen im dienstlichen Verkehr oder &uuml;ber
Tatsachen, die offenkundig sind oder ihrer Bedeutung nach keiner
Geheimhaltung bed&uuml;rfen. Der Bundesbeauftragte darf, auch wenn er nicht
mehr im Amt ist, &uuml;ber solche Angelegenheiten ohne Genehmigung des
Bundesministeriums des Innern weder vor Gericht noch au&szlig;ergerichtlich
aussagen oder Erkl&auml;rungen abgeben. Unber&uuml;hrt bleibt die
gesetzlich begr&uuml;ndete Pflicht, Straftaten anzuzeigen und bei
Gef&auml;hrdung der freiheitlichen demokratischen Grundordnung f&uuml;r
deren Erhaltung einzutreten. F&uuml;r den Bundesbeauftragten und seine
Mitarbeiter gelten die &sect;&sect;&nbsp;93, 97, 105 Abs.&nbsp;1, &sect;
111 Abs.&nbsp;5 in Verbindung mit &sect; 105 Abs.&nbsp;1 sowie &sect; 116
Abs.&nbsp;1 der Abgabenordnung nicht. Satz&nbsp;5 findet keine Anwendung,
soweit die Finanzbeh&ouml;rden die Kenntnis f&uuml;r die Durchf&uuml;hrung
eines Verfahrens wegen einer Steuerstraftat sowie eines damit
zusammenh&auml;ngenden Steuerverfahrens ben&ouml;tigen, an deren Verfolgung
ein zwingendes &ouml;ffentliches Interesse besteht, oder soweit es sich um
vors&auml;tzlich falsche Angaben des Auskunftspflichtigen oder der f&uuml;r
ihn t&auml;tigen Personen handelt. Stellt der Bundesbeauftragte einen
Datenschutzversto&szlig; fest, ist er befugt, diesen anzuzeigen und den
Betroffenen hier&uuml;ber zu informieren.<BR> <BR>

(6) Die Genehmigung, als Zeuge auszusagen, soll nur versagt werden, wenn
die Aussage dem Wohle des Bundes oder eines deutschen Landes Nachteile
bereiten oder die Erf&uuml;llung &ouml;ffentlicher Aufgaben ernstlich
gef&auml;hrden oder erheblich erschweren w&uuml;rde. Die Genehmigung, ein
Gutachten zu erstatten, kann versagt werden, wenn die Erstattung den
dienstlichen Interessen Nachteile bereiten w&uuml;rde. &sect;&nbsp;28 des
Bundesverfassungsgerichtsgesetzes bleibt unber&uuml;hrt.<BR> <BR>

(7) Der Bundesbeauftragte erh&auml;lt vom Beginn des Kalendermonats an, in
dem das Amtsverh&auml;ltnis beginnt, bis zum Schluss des Kalendermonats, in
dem das Amtsverh&auml;ltnis endet, im Falle des Absatzes 1 Satz&nbsp;6 bis
zum Ende des Monats, in dem die Gesch&auml;ftsf&uuml;hrung endet,
Amtsbez&uuml;ge in H&ouml;he der einem Bundesbeamten der Besoldungsgruppe B
9 zustehenden Besoldung. Das Bundesreisekostengesetz und das
Bundesumzugskostengesetz sind entsprechend anzuwenden. Im &uuml;brigen sind
die &sect;&sect;&nbsp;13 bis 20 des Bundesministergesetzes in der Fassung
der Bekanntmachung vom 27. Juli 1971 (BGBl. I S.&nbsp;1166), zuletzt
ge&auml;ndert durch das Gesetz zur K&uuml;rzung des Amtsgehalts der
Mitglieder der Bundesregierung und der Parlamentarischen
Staatssekret&auml;re vom 22. Dezember 1982 (BGBl. I S. 2007), mit der
Ma&szlig;gabe anzuwenden, dass an die Stelle der zweij&auml;hrigen Amtszeit
in &sect;&nbsp;15 Abs.&nbsp;1 des Bundesministergesetzes eine Amtszeit von
f&uuml;nf Jahren tritt. Abweichend von Satz 3 in Verbindung mit den
&sect;&sect;&nbsp;15 bis 17 des Bundesministergesetzes berechnet sich das
Ruhegehalt des Bundesbeauftragten unter Hinzurechnung der Amtszeit als
ruhegehaltsf&auml;hige Dienstzeit in entsprechender Anwendung des
Beamtenversorgungsgesetzes, wenn dies g&uuml;nstiger ist und der
Bundesbeauftragte sich unmittelbar vor seiner Wahl zum Bundesbeauftragten
als Beamter oder Richter mindestens in dem letzten gew&ouml;hnlich vor
Erreichen der Besoldungsgruppe B&nbsp;9 zu durchlaufenden Amt befunden
hat.<BR> <BR>

(8) Absatz&nbsp;5 Satz 5 bis 7 gilt entsprechend f&uuml;r die
&ouml;ffentlichen Stellen, die f&uuml;r die Kontrolle der Einhaltung der
Vorschriften &uuml;ber den Datenschutz in den L&auml;ndern zust&auml;ndig
sind.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 24">&sect;&nbsp;24</A> Kontrolle durch den
Bundesbeauftragten f&uuml;r den Datenschutz</B></P>

(1) der Bundesbeauftragte f&uuml;r den Datenschutz kontrolliert bei den
&ouml;ffentlichen Stellen des Bundes die Einhaltung der Vorschriften dieses
Gesetzes und anderer Vorschriften &uuml;ber den Datenschutz.<BR> <BR>

(2) Die Kontrolle des Bundesbeauftragten erstreckt sich auch auf

<OL>
<LI>von &ouml;ffentlichen Stellen des Bundes erlangte personenbezogene
Daten &uuml;ber den Inhalt und die n&auml;heren Umst&auml;nde des Brief-,
Post- und Fernmeldeverkehrs, und</LI>

<LI>personenbezogene Daten, die einem Berufs- oder besonderen
Amtsgeheimnis, insbesondere dem Steuergeheimnis nach &sect;&nbsp;30 der
Abgabenordnung, unterliegen.</LI>
</OL>

Das Grundrecht des Brief-, Post- und Fernmeldegeheimnisses des Artikels 10
des Grundgesetzes wird insoweit eingeschr&auml;nkt. Personenbezogene Daten,
die der Kontrolle durch die Kommission nach &sect;&nbsp;9 des Gesetzes zu
Artikel 10 Grundgesetz unterliegen, unterliegen nicht der Kontrolle durch
den Bundesbeauftragten, es sei denn, die Kommission ersucht den
Bundesbeauftragten, die Einhaltung der Vorschriften &uuml;ber den
Datenschutz bei bestimmten Vorg&auml;ngen oder in bestimmten Bereichen zu
kontrollieren und ausschlie&szlig;lich ihr dar&uuml;ber zu berichten. Der
Kontrolle durch den Bundesbeauftragten unterliegen auch nicht
personenbezogene Daten in Akten &uuml;ber die
Sicherheits&uuml;berpr&uuml;fung, wenn der Betroffene der Kontrolle der auf
ihn bezogenen Daten im Einzelfall gegen&uuml;ber dem Bundesbeauftragten
widerspricht.<BR> <BR>

(3) Bei den Bundesgerichten ist die unmittelbar der Rechtsprechung dienende
T&auml;tigkeit der Richter von der Kontrolle ausgenommen.<BR> <BR>

(4) Die &ouml;ffentlichen Stellen des Bundes sind verpflichtet, den
Bundesbeauftragten und seine Beauftragten bei der Erf&uuml;llung ihrer
Aufgaben zu unterst&uuml;tzen. Ihnen ist dabei insbesondere

<OL>
<LI>Auskunft zu ihren Fragen sowie Einsicht in alle Unterlagen,
insbesondere in die gespeicherten Daten und in die
Datenverarbeitungsprogramme, zu gew&auml;hren, die im Zusammenhang mit der
Kontrolle nach Absatz&nbsp;1 stehen,</LI>

<LI>jederzeit Zutritt in alle Dienstr&auml;ume zu gew&auml;hren.</LI>
</OL>

Die in &sect;&nbsp;6 Abs.&nbsp;2 und &sect;&nbsp;19 Abs.&nbsp;3 genannten
Beh&ouml;rden gew&auml;hren die Unterst&uuml;tzung nur dem
Bundesbeauftragten selbst und den von ihm schriftlich besonders
Beauftragten. Satz&nbsp;2 gilt f&uuml;r diese Beh&ouml;rden nicht, soweit
die oberste Bundesbeh&ouml;rde im Einzelfall feststellt, dass die Auskunft
oder Einsicht die Sicherheit des Bundes oder eines Landes gef&auml;hrden
w&uuml;rde.<BR> <BR>

(5) Der Bundesbeauftragte teilt das Ergebnis seiner Kontrolle der
&ouml;ffentlichen Stelle mit. Damit kann er Vorschl&auml;ge zur
Verbesserung des Datenschutzes, insbesondere zur Beseitigung von
festgestellten M&auml;ngeln bei der Verarbeitung oder Nutzung
personenbezogener Daten, verbinden. &sect;&nbsp;25 bleibt
unber&uuml;hrt.<BR> <BR>

(6) Absatz&nbsp;2 gilt entsprechend f&uuml;r die &ouml;ffentlichen Stellen,
die f&uuml;r die Kontrolle der Einhaltung der Vorschriften &uuml;ber den
Datenschutz in den L&auml;ndern zust&auml;ndig sind.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 25">&sect;&nbsp;25</A> Beanstandungen durch den
Bundesbeauftragten f&uuml;r den Datenschutz</B></P>

(1) Stellt der Bundesbeauftragte f&uuml;r den Datenschutz
Verst&ouml;&szlig;e gegen die Vorschriften dieses Gesetzes oder gegen
andere Vorschriften &uuml;ber den Datenschutz oder sonstige M&auml;ngel bei
der Verarbeitung oder Nutzung personenbezogener Daten fest, so beanstandet
er dies

<OL>
<LI>bei der Bundesverwaltung gegen&uuml;ber der zust&auml;ndigen obersten
Bundesbeh&ouml;rde,</LI>

<LI>beim Bundeseisenbahnverm&ouml;gen gegen&uuml;ber dem
Pr&auml;sidenten,</LI>

<LI>bei den aus dem Sonderverm&ouml;gen Deutsche Bundespost durch Gesetz
hervorgegangenen Unternehmen, solange ihnen ein ausschlie&szlig;liches
Recht nach dem Postgesetz zusteht, gegen&uuml;ber deren
Vorst&auml;nden,</LI>

<LI>bei den bundesunmittelbaren K&ouml;rperschaften, Anstalten und
Stiftungen des &ouml;ffentlichen Rechts sowie bei Vereinigungen solcher
K&ouml;rperschaften, Anstalten und Stiftungen gegen&uuml;ber dem Vorstand
oder dem sonst vertretungsberechtigten Organ</LI>
</OL>

und fordert zur Stellungnahme innerhalb einer von ihm zu bestimmenden Frist
auf. In den F&auml;llen von Satz 1 Nr.&nbsp;4 unterrichtet der
Bundesbeauftragte gleichzeitig die zust&auml;ndige
Aufsichtsbeh&ouml;rde.<BR> <BR>

(2) Der Bundesbeauftragte kann von einer Beanstandung absehen oder auf eine
Stellungnahme der betroffenen Stelle verzichten, insbesondere wenn es sich
um unerhebliche oder inzwischen beseitigte M&auml;ngel handelt.<BR> <BR>

(3) Die Stellungnahme soll auch eine Darstellung der Ma&szlig;nahmen
enthalten, die auf Grund der Beanstandung des Bundesbeauftragten getroffen
worden sind. Die in Absatz 1 Satz 1 Nr.&nbsp;4 genannten Stellen leiten der
zust&auml;ndigen Aufsichtsbeh&ouml;rde gleichzeitig eine Abschrift ihrer
Stellungnahme an den Bundesbeauftragten zu.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 26">&sect;&nbsp;26</A> Weitere Aufgaben des
Bundesbeauftragten f&uuml;r den Datenschutz</B></P>

(1) Der Bundesbeauftragte f&uuml;r den Datenschutz erstattet dem Deutschen
Bundestag alle zwei Jahre einen T&auml;tigkeitsbericht. Er unterrichtet den
Deutschen Bundestag und die &Ouml;ffentlichkeit &uuml;ber wesentliche
Entwicklungen des Datenschutzes.<BR> <BR>

(2) Auf Anforderung des Deutschen Bundestages oder der Bundesregierung hat
der Bundesbeauftragte Gutachten zu erstellen und Berichte zu erstatten. Auf
Ersuchen des Deutschen Bundestages, des Petitionsausschusses, des
Innenausschusses oder der Bundesregierung geht der Bundesbeauftragte ferner
Hinweisen auf Angelegenheiten und Vorg&auml;nge des Datenschutzes bei den
&ouml;ffentlichen Stellen des Bundes nach. Der Bundesbeauftragte kann sich
jederzeit an den Deutschen Bundestag wenden.<BR> <BR>

(3) Der Bundesbeauftragte kann der Bundesregierung und den in
&sect;&nbsp;12 Abs.&nbsp;1 genannten Stellen des Bundes Empfehlungen zur
Verbesserung des Datenschutzes geben und sie in Fragen des Datenschutzes
beraten. Die in &sect;&nbsp;25 Abs.&nbsp;1 Nr.&nbsp;1 bis 4 genannten
Stellen sind durch den Bundesbeauftragten zu unterrichten, wenn die
Empfehlung oder Beratung sie nicht unmittelbar betrifft.<BR> <BR>

(4) Der Bundesbeauftragte wirkt auf die Zusammenarbeit mit den
&ouml;ffentlichen Stellen, die f&uuml;r die Kontrolle der Einhaltung der
Vorschriften &uuml;ber den Datenschutz in den L&auml;ndern zust&auml;ndig
sind, sowie mit den Aufsichtsbeh&ouml;rden nach &sect;&nbsp;38 hin.
&sect;&nbsp;38 Abs.&nbsp;1 Satz 3 und 4 gilt entsprechend.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><FONT size="+1"><B>Dritter Abschnitt</B></FONT><BR>

<B>Datenverarbeitung nicht &ouml;ffentlicher Stellen und
&ouml;ffentlichrechtlicher Wettbewerbsunternehmen</B></P>

<P><B>Erster Unterabschnitt - Rechtsgrundlagen der
Datenverarbeitung</B></P>

<P><B><A name="&sect; 27">&sect;&nbsp;27</A> Anwendungsbereich</B></P>

(1) Die Vorschriften dieses Abschnittes finden Anwendung, soweit
personen-bezogene Daten unter Einsatz von Datenverarbeitungsanlagen
verarbeitet, genutzt oder daf&uuml;r erhoben werden oder die Daten in oder
aus nicht automatisierten Dateien verarbeitet, genutzt oder daf&uuml;r
erhoben werden durch

<OL>
<LI>nicht &ouml;ffentliche Stellen,</LI>

<LI>a) &ouml;ffentliche Stellen des Bundes, soweit sie als
&ouml;ffentlich-rechtliche Unternehmen am Wettbewerb teilnehmen,<BR>
b) &ouml;ffentlichen Stellen der L&auml;nder, soweit sie als
&ouml;ffentlich-rechtliche Unternehmen am Wettbewerb teilnehmen,
Bundesrecht ausf&uuml;hren und der Datenschutz nicht durch Landesgesetz
geregelt ist.</LI>
</OL>

Dies gilt nicht, wenn die Erhebung, Verarbeitung oder Nutzung der Daten
ausschlie&szlig;lich f&uuml;r pers&ouml;nliche oder famili&auml;re
T&auml;tigkeiten erfolgt. In den F&auml;llen der Nummer&nbsp;2
Buchstabe&nbsp;a gelten anstelle des &sect;&nbsp;38 die
&sect;&sect;&nbsp;18,&nbsp;21 und 24 bis 26.<BR> <BR>

(2) Die Vorschriften dieses Abschnittes gelten nicht f&uuml;r die
Verarbeitung und Nutzung personenbezogener Daten au&szlig;erhalb von nicht
automatisierten Dateien, soweit es sich nicht um personenbezogene Daten
handelt, die offensichtlich aus einer automatisierten Verarbeitung
entnommen worden sind.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 28">&sect;&nbsp;28</A> Datenerhebung, -verarbeitung
und -nutzung f&uuml;r eigene Zwecke</B></P>

(1) Das Erheben, Speichern, Ver&auml;ndern oder &Uuml;bermitteln
personenbezogener Daten oder ihre Nutzung als Mittel f&uuml;r die
Erf&uuml;llung eigener Gesch&auml;ftszwecke ist zul&auml;ssig

<OL>
<LI>wenn es der Zweckbestimmung eines Vertragsverh&auml;ltnisses oder
vertrags-&auml;hnlichen Vertrauensverh&auml;ltnisses mit dem Betroffenen
dient,</LI>

<LI>soweit es zur Wahrung berechtigter Interessen der verantwortlichen
Stelle erforderlich ist und kein Grund zu der Annahme besteht, dass das
schutzw&uuml;rdige Interesse des Betroffenen an dem Ausschluss der
Verarbeitung oder Nutzung &uuml;berwiegt<BR> <BR>
oder</LI>

<LI>wenn die Daten allgemein zug&auml;nglich sind oder die verantwortliche
Stelle sie ver&ouml;ffentlichen d&uuml;rfte, es sei denn, dass das
schutzw&uuml;rdige Interesse des Betroffenen an dem Ausschluss der
Verarbeitung oder Nutzung gegen&uuml;ber dem berechtigten Interesse der
verantwortlichen Stelle offensichtlich &uuml;berwiegt.</LI>
</OL>

Bei der Erhebung personenbezogener Daten sind die Zwecke, f&uuml;r die die
Daten verarbeitet oder genutzt werden sollen, konkret festzulegen.<BR> <BR>

(2) F&uuml;r einen anderen Zweck d&uuml;rfen sie nur unter den
Voraussetzungen des Absatzes&nbsp;1 Satz 1 Nr.&nbsp;2 und 3
&uuml;bermittelt oder genutzt werden.<BR> <BR>

(3) Die &Uuml;bermittlung oder Nutzung f&uuml;r einen anderen Zweck ist
auch zul&auml;ssig:

<OL>
<LI>soweit es zur Wahrung berechtigter Interessen eines Dritten oder</LI>

<LI>zur Abwehr von Gefahren f&uuml;r die staatliche und &ouml;ffentliche
Sicherheit sowie zur Verfolgung von Straftaten erforderlich ist, oder</LI>

<LI>f&uuml;r Zwecke der Werbung, der Markt- und Meinungsforschung, wenn es
sich um listenm&auml;&szlig;ig oder sonst zusammengefasste Daten &uuml;ber
Angeh&ouml;rige einer Personengruppe handelt, die sich auf<BR>
a) eine Angabe &uuml;ber die Zugeh&ouml;rigkeit des Betroffenen zu dieser
Personengruppe,<BR>
b) Berufs-, Branchen- oder Gesch&auml;ftsbezeichnung,<BR>
c) Namen,<BR>
d) Titel,<BR>
e) akademische Grade,<BR>
f) Anschrift und<BR>
g) Geburtsjahr<BR>
beschr&auml;nken und kein Grund zu der Annahme besteht, dass der Betroffene
ein schutzw&uuml;rdiges Interesse an dem Ausschluss der &Uuml;bermittlung
oder Nutzung hat, oder</LI>

<LI>wenn es im Interesse einer Forschungseinrichtung zur Durchf&uuml;hrung
wissenschaftlicher Forschung erforderlich ist, das wissenschaftliche
Interesse an der Durchf&uuml;hrung des Forschungsvorhabens das Interesse
des Betroffenen an dem Ausschluss der Zweck&auml;nderung erheblich
&uuml;berwiegt und der Zweck der Forschung auf andere Weise nicht oder nur
mit unverh&auml;ltnism&auml;&szlig;igem Aufwand erreicht werden kann.</LI>
</OL>

In den F&auml;llen des Satzes 1 Nr. 3 ist anzunehmen, dass dieses Interesse
besteht, wenn im Rahmen der Zweckbestimmung eines
Vertragsverh&auml;ltnisses oder vertrags-&auml;hnlichen
Vertrauensverh&auml;ltnisses gespeicherte Daten &uuml;bermittelt werden
sollen, die sich

<OL>
<LI>auf strafbare Handlungen,</LI>

<LI>auf Ordnungswidrigkeiten sowie</LI>

<LI>bei &Uuml;bermittlung durch den Arbeitgeber auf arbeitsrechtliche
Rechtsverh&auml;ltnisse</LI>
</OL>

beziehen.<BR><BR>

(4) Widerspricht der Betroffene bei der verantwortlichen Stelle der Nutzung
oder &Uuml;bermittlung seiner Daten f&uuml;r Zwecke der Werbung oder der
Markt- oder Meinungsforschung, ist eine Nutzung oder &Uuml;bermittlung
f&uuml;r diese Zwecke unzul&auml;ssig. Der Betroffene ist bei der Ansprache
zum Zweck der Werbung oder der Markt- oder Meinungsforschung &uuml;ber die
verantwortliche Stelle sowie &uuml;ber das Widerspruchsrecht nach Satz 1 zu
unterrichten; soweit der Ansprechende personenbezogene Daten des
Betroffenen nutzt, die bei einer ihm nicht bekannten Stelle gespeichert
sind, hat er auch sicherzustellen, dass der Betroffene Kenntnis &uuml;ber
die Herkunft der Daten erhalten kann. Widerspricht der Betroffenen bei dem
Drittten, dem die Daten nach Absatz 3 &uuml;bermittelt werden, der
Verarbeitung oder Nutzung zum Zwecke der Werbung oder der Markt- oder
Meinungsforschung, hat dieser die Daten f&uuml;r diese Zwecke zu
sperren.<BR> <BR>

(5) Der Dritte, dem die Daten &uuml;bermittelt worden sind, darf diese nur
f&uuml;r den Zweck verarbeiten oder nutzen, zu dessen Erf&uuml;llung sie
ihm &uuml;bermittelt werden. Eine Verarbeitung oder Nutzung f&uuml;r andere
Zwecke ist nicht &ouml;ffentlichen Stellen nur unter den Voraussetzungen
der Abs&auml;tze&nbsp;2 und 3 und &ouml;ffentlichen Stellen nur unter den
Voraussetzungen des &sect;&nbsp;14 Abs.&nbsp;2 erlaubt. Die
&uuml;bermittelnde Stelle hat ihn darauf hinzuweisen.<BR> <BR>

(6) Das Erheben, Verarbeiten und Nutzen von besonderen Arten
personen-bezogener Daten (&sect;&nbsp;3 Abs.&nbsp;9) f&uuml;r eigene
Gesch&auml;ftszwecke ist zul&auml;ssig, soweit nicht der Betroffene nach
Ma&szlig;gabe des &sect;&nbsp;4a Abs.&nbsp;3 eingewilligt hat, wenn

<OL>
<LI>dies zum Schutz lebenswichtiger Interessen des Betroffenen oder eines
Dritten erforderlich ist, sofern der Betroffene aus physischen oder
rechtlichen Gr&uuml;nden au&szlig;erstande ist, seine Einwilligung zu
geben,</LI>

<LI>es sich um Daten handelt, die der Betroffene offenkundig
&ouml;ffentlich gemacht hat,</LI>

<LI>dies zur Geltendmachung, Aus&uuml;bung oder Verteidigung rechtlicher
Anspr&uuml;che erforderlich ist und kein Grund zu der Annahme besteht, dass
das schutzw&uuml;rdige Interesse des Betroffenen an dem Ausschluss der
Erhebung, Verarbeitung oder Nutzung &uuml;berwiegt, oder</LI>

<LI>dies zur Durchf&uuml;hrung wissenschaftlicher Forschung erforderlich
ist, das wissenschaftliche Interesse an der Durchf&uuml;hrung des
Forschungsvorhabens das Interesse des Betroffenen an dem Ausschluss der
Erhebung, Verarbeitung und Nutzung erheblich &uuml;berwiegt und der Zweck
der Forschung auf andere Weise nicht oder nur mit
unverh&auml;ltnism&auml;&szlig;igem Aufwand erreicht werden kann.</LI>
</OL>

(7) Das Erheben von besonderen Arten personenbezogener Daten (&sect;&nbsp;3
Abs.&nbsp;9) ist ferner zul&auml;ssig, wenn dies zum Zweck der
Gesundheitsvorsorge, der medizinischen Diagnostik, der
Gesundheitsversorgung oder Behandlung oder f&uuml;r die Verwaltung von
Gesundheitsdiensten erforderlich ist und die Verarbeitung dieser Daten
durch &auml;rztliches Personal oder durch sonstige Personen erfolgt, die
einer entsprechenden Geheimhaltungspflicht unterliegen. Die Verarbeitung
und Nutzung von Daten zu den in Satz 1 genannten Zwecken richtet sich nach
den f&uuml;r die in Satz 1 genannten Personen geltenden
Geheimhaltungspflichten. Werden zu einem in Satz 1 genannten Zweck Daten
&uuml;ber die Gesundheit von Personen durch Angeh&ouml;rige eines anderen
als in &sect;&nbsp;203 Abs.&nbsp;1 und 3 des Strafgesetzbuches genannten
Berufes, dessen Aus&uuml;bung die Feststellung, Heilung oder Linderung von
Krankheiten oder die Herstellung oder den Vertrieb von Hilfsmitteln mit
sich bringt, erhoben, verarbeitet oder genutzt, ist dies nur unter den
Voraussetzungen zul&auml;ssig, unter denen ein Arzt selbst hierzu befugt
w&auml;re.<BR> <BR>

(8) F&uuml;r einen anderen Zweck d&uuml;rfen die besonderen Arten
personenbezogener Daten (&sect;&nbsp;3 Abs.&nbsp;9) nur unter den
Voraussetzungen des Absatzes 6 Nr. 1 bis 4 oder des Absatzes 7 Satz 1
&uuml;bermittelt oder genutzt werden. Eine &Uuml;bermittlung oder Nutzung
ist auch zul&auml;ssig, wenn dies zur Abwehr von erheblichen Gefahren
f&uuml;r die staatliche und &ouml;ffentliche Sicherheit sowie zur
Verfolgung von Straftaten von erheblicher Bedeutung erforderlich ist.<BR>
<BR>

(9) Organisationen, die politisch, philosophisch, religi&ouml;s oder
gewerkschaftlich ausgerichtet sind und keinen Erwerbszweck verfolgen,
d&uuml;rfen besondere Arten personenbezogener Daten (&sect;&nbsp;3
Abs.&nbsp;9) erheben, verarbeiten oder nutzen, soweit dies f&uuml;r die
T&auml;tigkeit der Organisation erforderlich ist. Dies gilt nur f&uuml;r
personen-bezogene Daten ihrer Mitglieder oder von Personen, die im
Zusammenhang mit deren T&auml;tigkeitszweck regelm&auml;&szlig;ig Kontakte
mit ihr unterhalten. Die &Uuml;bermittlung dieser personenbezogenen Daten
an Personen oder Stellen au&szlig;erhalb der Organisation ist nur unter den
Voraussetzungen des &sect;&nbsp;4a Abs.&nbsp;3 zul&auml;ssig. Absatz 3 Nr.
2 gilt entsprechend.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 29">&sect;&nbsp;29</A>
Gesch&auml;ftsm&auml;&szlig;ige Datenerhebung und -speicherung zum Zwecke
der &Uuml;bermittlung</B></P>

(1) Das gesch&auml;ftsm&auml;&szlig;ige Erheben, Speichern oder
Ver&auml;ndern personenbezogener Daten zum Zwecke der &Uuml;bermittlung,
insbesondere wenn dies der Werbung, der T&auml;tigkeit von Auskunfteien,
dem Adresshandel oder der Markt- und Meinungs-forschung dient, ist
zul&auml;ssig, wenn

<OL>
<LI>kein Grund zu der Annahme besteht, dass der Betroffene ein
schutzw&uuml;rdiges Interesse an dem Ausschluss der Erhebung, Speicherung
oder Ver&auml;nderung hat, oder</LI>

<LI>die Daten aus allgemein zug&auml;nglichen Quellen entnommen werden
k&ouml;nnen oder die verantwortliche Stelle sie ver&ouml;ffentlichen
d&uuml;rfte, es sei denn, dass das schutzw&uuml;rdige Interesse des
Betroffenen an dem Ausschluss der Erhebung, Speicherung oder
Ver&auml;nderung offensichtlich &uuml;berwiegt.</LI>
</OL>

&sect;&nbsp;28 Abs.&nbsp;1 Satz&nbsp;2 ist anzuwenden.<BR> <BR>

(2) Die &Uuml;bermittlung im Rahmen der Zwecke nach Absatz&nbsp;1 ist
zul&auml;ssig, wenn

<OL>
<LI>a) der Dritte, dem die Daten &uuml;bermittelt werden, ein berechtigtes
Interesse an ihrer Kenntnis glaubhaft dargelegt hat oder<BR> b) es sich um
listenm&auml;&szlig;ig oder sonst zusammengefasste Daten nach
&sect;&nbsp;28 Abs. 3 Nr.&nbsp;3 handelt, die f&uuml;r Zwecke der Werbung
oder der Markt- oder Meinungsforschung &uuml;bermittelt werden sollen,
und</LI>

<LI>kein Grund zu der Annahme besteht, dass der Betroffene ein
schutzw&uuml;rdiges Interesse an dem Ausschluss der &Uuml;bermittlung
hat.</LI>
</OL>

&sect;&nbsp;28 Abs.&nbsp;3 gilt entsprechend. Bei der &Uuml;bermittlung
nach Nummer&nbsp;1 Buchstabe&nbsp;a sind die Gr&uuml;nde f&uuml;r das
Vorliegen eines berechtigten Interesses und die Art und Weise ihrer
glaubhaften Darlegung von der &uuml;bermittelnden Stelle aufzuzeichnen. Bei
der &Uuml;bermittlung im automatisierten Abrufverfahren obliegt die
Aufzeichnungspflicht dem Dritten, dem die Daten &uuml;bermittelt
werden.<BR> <BR>

(3) Die Aufnahme personenbezogener Daten in elektronische oder gedruckte
Adress-, Telefon-, Branchenoder vergleichbare Verzeichnisse hat zu
unterbleiben, wenn der entgegenstehende Wille des Betroffenen aus dem
zugrunde liegenden elektronischen oder gedruckten Verzeichnis oder Register
ersichtlich ist. Der Empf&auml;nger der Daten hat sicherzustellen, dass
Kennzeichnungen aus elektronischen oder gedruckten Verzeichnissen oder
Registern bei der &Uuml;bernahme in Verzeichnisse oder Register
&uuml;bernommen werden.<BR> <BR>

(4) F&uuml;r die Verarbeitung oder Nutzung der &uuml;bermittelten Daten
gilt &sect;&nbsp;28 Abs.&nbsp;4 und 5.<BR> <BR>

(5) &sect;&nbsp;28 Abs.&nbsp;6 bis 9 gilt entsprechend.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 30">&sect;&nbsp;30</A>
Gesch&auml;ftsm&auml;&szlig;ige Datenerhebung und -speicherung zum Zwecke
der &Uuml;bermittlung in anonymisierter Form</B></P>

(1) Werden personenbezogene Daten gesch&auml;ftsm&auml;&szlig;ig erhoben
und gespeichert, um sie in anonymisierter Form zu &uuml;bermitteln, sind
die Merkmale gesondert zu speichern, mit denen Einzelangaben &uuml;ber
pers&ouml;nliche oder sachliche Verh&auml;ltnisse einer bestimmten oder
bestimmbaren nat&uuml;rlichen Person zugeordnet werden k&ouml;nnen. Diese
Merkmale d&uuml;rfen mit den Einzelangaben nur zusammengef&uuml;hrt werden,
soweit dies f&uuml;r die Erf&uuml;llung des Zweckes der Speicherung oder zu
wissenschaftlichen Zwecken erforderlich ist.<BR> <BR>

(2) Die Ver&auml;nderung personenbezogener Daten ist zul&auml;ssig, wenn

<OL>
<LI>kein Grund zu der Annahme besteht, dass der Betroffene ein
schutzw&uuml;rdiges Interesse an dem Ausschluss der Ver&auml;nderung hat,
oder</LI>

<LI>die Daten aus allgemein zug&auml;nglichen Quellen entnommen werden
k&ouml;nnen oder die verantwortliche Stelle sie ver&ouml;ffentlichen
d&uuml;rfte, soweit nicht das schutzw&uuml;rdige Interesse des Betroffenen
an dem Ausschluss der Ver&auml;nderung offensichtlich &uuml;berwiegt.</LI>
</OL>

(3) Die personenbezogenen Daten sind zu l&ouml;schen, wenn ihre Speicherung
unzul&auml;ssig ist.<BR> <BR>

(4) &sect;&nbsp;29 gilt nicht.<BR> <BR>

(5) &sect; 28 Abs. 6 bis 9 gilt entsprechend.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 31">&sect;&nbsp;31</A> Besondere Zweckbindung</B></P>

Personenbezogene Daten, die ausschlie&szlig;lich zu Zwecken der
Datenschutzkontrolle, der Datensicherung oder zur Sicherstellung eines
ordnungsgem&auml;&szlig;en Betriebes einer Datenverarbeitungsanlage
gespeichert werden, d&uuml;rfen nur f&uuml;r diese Zwecke verwendet
werden.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 32">&sect;&nbsp;32</A> Meldepflichten</B></P>

weggefallen<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B>Zweiter Unterabschnitt - Rechte des Betroffenen</B></P>

<P><B><A name="&sect; 33">&sect;&nbsp;33</A> Benachrichtigung des
Betroffenen</B></P>

(1) Werden erstmals personenbezogene Daten f&uuml;r eigene Zwecke ohne
Kenntnis des Betroffenen gespeichert, ist der Betroffene von der
Speicherung, der Art der Daten, der Zweckbestimmung der Erhebung,
Verarbeitung oder Nutzung und der Identit&auml;t der verantwortlichen
Stelle zu benachrichtigen. Werden personenbezogene Daten
gesch&auml;ftsm&auml;&szlig;ig zum Zwecke der &Uuml;bermittlung ohne
Kenntnis des Betroffenen gespeichert, ist der Betroffene von der
erstmaligen &Uuml;bermittlung und der Art der &uuml;bermittelten Daten zu
benachrichtigen. Der Betroffene ist in den F&auml;llen der S&auml;tze 1 und
2 auch &uuml;ber die Kategorien von Empf&auml;ngern zu unterrichten, soweit
er nach den Umst&auml;nden des Einzelfalles nicht mit der &Uuml;bermittlung
an diese rechnen muss.<BR> <BR>

(2) Eine Pflicht zur Benachrichtigung besteht nicht, wenn

<OL>
<LI>der Betroffene auf andere Weise Kenntnis von der Speicherung oder der
&Uuml;bermittlung erlangt hat,</LI>

<LI>die Daten nur deshalb gespeichert sind, weil sie aufgrund gesetzlicher,
satzungsm&auml;&szlig;iger oder vertraglicher Aufbewahrungsvorschriften
nicht gel&ouml;scht werden d&uuml;rfen oder ausschlie&szlig;lich der
Datensicherung oder der Datenschutzkontrolle dienen und eine
Benachrichtigung einen unverh&auml;ltnism&auml;&szlig;igen Aufwand
erfordern w&uuml;rde,</LI>

<LI>die Daten nach einer Rechtsvorschrift oder ihrem Wesen nach, namentlich
wegen des &uuml;berwiegenden rechtlichen Interesses eines Dritten,
geheimgehalten werden m&uuml;ssen,</LI>

<LI>die Speicherung oder &Uuml;bermittlung durch Gesetz ausdr&uuml;cklich
vorgesehen ist,</LI>

<LI>die Speicherung oder &Uuml;bermittlung f&uuml;r Zwecke der
wissenschaftlichen Forschung erforderlich ist und eine Benachrichtigung
einen unverh&auml;ltnism&auml;&szlig;igen Aufwand erfordern
w&uuml;rde,</LI>

<LI>die zust&auml;ndige &ouml;ffentliche Stelle gegen&uuml;ber der
verantwortlichen Stelle festgestellt hat, dass das Bekanntwerden der Daten
die &ouml;ffentliche Sicherheit oder Ordnung gef&auml;hrden oder sonst dem
Wohle des Bundes oder eines Landes Nachteile bereiten w&uuml;rde,</LI>

<LI>die Daten f&uuml;r eigene Zwecke gespeichert sind und<BR>
a) aus allgemein zug&auml;nglichen Quellen entnommen sind und eine
Benachrichtigung wegen der Vielzahl der betroffenen F&auml;lle
unverh&auml;ltnism&auml;&szlig;ig ist, oder<BR>
b) die Benachrichtigung die Gesch&auml;ftszwecke der verantwortlichen
Stelle erheblich gef&auml;hrden w&uuml;rde, es sei denn, dass das Interesse
an der Benachrichtigung die Gef&auml;hrdung &uuml;berwiegt, oder</LI>

<LI>die Daten gesch&auml;ftsm&auml;&szlig;ig zum Zwecke der
&Uuml;bermittlung gespeichert sind und<BR> a) aus allgemein
zug&auml;nglichen Quellen entnommen sind, soweit sie sich auf diejenigen
Personen beziehen, die diese Daten ver&ouml;ffentlicht haben, oder<BR>
b) es sich um listenm&auml;&szlig;ig oder sonst zusammengefasste Daten
handelt (&sect;&nbsp;29 Abs.&nbsp;2 Nr.&nbsp;1 Buchstabe&nbsp;b)</LI>
</OL>

und eine Benachrichtigung wegen der Vielzahl der betroffenen F&auml;lle
unverh&auml;ltnism&auml;&szlig;ig ist.<BR> <BR>

Die verantwortliche Stelle legt schriftlich fest, unter welchen
Voraussetzungen von einer Benachrichtigung nach Satz 1 Nr. 2 bis 7
abgesehen wird.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 34">&sect;&nbsp;34</A> Auskunft an den
Betroffenen</B></P>

(1) Der Betroffene kann Auskunft verlangen &uuml;ber 

<OL>
<LI>die zu seiner Person gespeicherten Daten, auch soweit sie sich auf die
Herkunft dieser Daten beziehen,</LI>

<LI>Empf&auml;nger oder Kategorien von Empf&auml;ngern, an die Daten
weitergegeben werden, und</LI>

<LI>den Zweck der Speicherung.</LI>
</OL>

Er soll die Art der personenbezogenen Daten, &uuml;ber die Auskunft erteilt
werden soll, n&auml;her bezeichnen. Werden die personenbezogenen Daten
gesch&auml;ftsm&auml;&szlig;ig zum Zwecke der &Uuml;bermittlung
gespeichert, kann der Betroffene &uuml;ber Herkunft und Empf&auml;nger nur
Auskunft verlangen, sofern nicht das Interesse an der Wahrung des
Gesch&auml;ftsgeheimnisses &uuml;berwiegt. <I></I>In diesem Falle ist
Auskunft &uuml;ber Herkunft und Empf&auml;nger auch dann zu erteilen, wenn
diese Angaben nicht gespeichert sind.<BR> <BR>

(2) Der Betroffene kann von Stellen, die gesch&auml;ftsm&auml;&szlig;ig
personenbezogene Daten zum Zwecke der Auskunftserteilung speichern,
Auskunft &uuml;ber seine personen-bezogenen Daten verlangen, auch wenn sie
weder in einer automatisierten Verarbeitung noch in einer nicht
automatisierten Datei gespeichert sind. Auskunft &uuml;ber Herkunft und
Empf&auml;nger kann der Betroffene nur verlangen, sofern nicht das
Interesse an der Wahrung des Gesch&auml;ftsgeheimnisses &uuml;berwiegt.<BR>
<BR>

(3) Die Auskunft wird schriftlich erteilt, soweit nicht wegen der
besonderen Umst&auml;nde eine andere Form der Auskunftserteilung angemessen
ist.<BR> <BR>

(4) Eine Pflicht zur Auskunftserteilung besteht nicht, wenn der Betroffene
nach &sect;&nbsp;33 Abs.&nbsp;2 Satz 1 Nr. 2, 3 und 5 bis 7 nicht zu
benachrichtigen ist.<BR> <BR>

(5) Die Auskunft ist unentgeltlich. Werden die personenbezogenen Daten
gesch&auml;ftsm&auml;&szlig;ig zum Zwecke der &Uuml;bermittlung
gespeichert, kann jedoch ein Entgelt verlangt werden, wenn der Betroffene
die Auskunft gegen&uuml;ber Dritten zu wirtschaftlichen Zwecken nutzen
kann. Das Entgelt darf &uuml;ber die durch die Auskunftserteilung
entstandenen direkt zurechenbaren Kosten nicht hinausgehen. Ein Entgelt
kann in den F&auml;llen nicht verlangt werden, in denen besondere
Umst&auml;nde die Annahme rechtfertigen, dass Daten unrichtig oder
unzul&auml;ssig gespeichert werden, oder in denen die Auskunft ergibt, dass
die Daten zu berichtigen oder unter der Voraussetzung des &sect;&nbsp;35
Abs.&nbsp;2 Satz&nbsp;2 Nr.&nbsp;1 zu l&ouml;schen sind.<BR> <BR>

(6) Ist die Auskunftserteilung nicht unentgeltlich, ist dem Betroffenen die
M&ouml;glichkeit zu geben, sich im Rahmen seines Auskunftsanspruchs
pers&ouml;nlich Kenntnis &uuml;ber die ihn betreffenden Daten und Angaben
zu verschaffen. Er ist hierauf in geeigneter Weise hinzuweisen.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 35">&sect;&nbsp;35</A> Berichtigung, L&ouml;schung
und Sperrung von Daten</B></P>

(1) Personenbezogene Daten sind zu berichtigen, wenn sie unrichtig
sind.<BR> <BR>

(2) Personenbezogene Daten k&ouml;nnen au&szlig;er in den F&auml;llen des
Absatzes&nbsp;3 Nr.&nbsp;1 und 2 jederzeit gel&ouml;scht werden.
Personenbezogene Daten sind zu l&ouml;schen, wenn

<OL>
<LI>ihre Speicherung unzul&auml;ssig ist,</LI>

<LI>es sich um Daten &uuml;ber die rassische oder ethnische Herkunft,
politische Meinungen, religi&ouml;se oder philosophische &Uuml;berzeugungen
oder die Gewerkschaftszugeh&ouml;rigkeit, &uuml;ber Gesundheit oder das
Sexualleben, strafbare Handlungen oder Ordnungswidrigkeiten handelt und
ihre Richtigkeit von der verantwortlichen Stelle nicht bewiesen werden
kann,</LI>

<LI>sie f&uuml;r eigene Zwecke verarbeitet werden, sobald ihre Kenntnis
f&uuml;r die Erf&uuml;llung des Zweckes der Speicherung nicht mehr
erforderlich ist, oder</LI>

<LI>sie gesch&auml;ftsm&auml;&szlig;ig zum Zweck der &Uuml;bermittlung
verarbeitet werden und eine Pr&uuml;fung jeweils am Ende des vierten
Kalenderjahres beginnend mit ihrer erstmaligen Speicherung ergibt, dass
eine l&auml;ngerw&auml;hrende Speicherung nicht erforderlich ist.</LI>
</OL>

(3) An die Stelle einer L&ouml;schung tritt eine Sperrung, soweit

<OL>
<LI>im Falle des Absatzes&nbsp;2 Nr.&nbsp;3 einer L&ouml;schung
gesetzliche, satzungsm&auml;&szlig;ige oder vertragliche
Aufbewahrungsfristen entgegenstehen,</LI>

<LI>Grund zu der Annahme besteht, dass durch eine L&ouml;schung
schutzw&uuml;rdige Interessen des Betroffenen beeintr&auml;chtigt
w&uuml;rden, oder</LI>

<LI>eine L&ouml;schung wegen der besonderen Art der Speicherung nicht oder
nur mit unverh&auml;ltnism&auml;&szlig;ig hohem Aufwand m&ouml;glich
ist.</LI>
</OL>

(4) Personenbezogene Daten sind ferner zu sperren, soweit ihre Richtigkeit
vom Betroffenen bestritten wird und sich weder die Richtigkeit noch die
Unrichtigkeit feststellen l&auml;sst.<BR> <BR>

(5) Personenbezogene Daten d&uuml;rfen nicht f&uuml;r eine automatisierte
Verarbeitung oder Verarbeitung in nicht automatisierten Dateien erhoben,
verarbeitet oder genutzt werden, soweit der Betroffene dieser bei der
verantwortlichen Stelle widerspricht und eine Pr&uuml;fung ergibt, dass das
schutzw&uuml;rdige Interesse des Betroffenen wegen seiner besonderen
pers&ouml;nlichen Situation das Interesse der verantwortlichen Stelle an
dieser Erhebung, Verarbeitung oder Nutzung &uuml;berwiegt. Satz 1 gilt
nicht, wenn eine Rechtsvorschrift zur Erhebung, Verarbeitung oder Nutzung
verpflichtet.<BR> <BR>

(6) Personenbezogene Daten, die unrichtig sind oder deren Richtigkeit
bestritten wird, m&uuml;ssen bei der gesch&auml;ftsm&auml;&szlig;igen
Datenspeicherung zum Zwecke der &Uuml;bermittlung au&szlig;er in den
F&auml;llen des Absatzes&nbsp;2 Nr.&nbsp;2 nicht berichtigt, gesperrt oder
gel&ouml;scht werden, wenn sie aus allgemein zug&auml;nglichen Quellen
entnommen und zu Dokumentationszwecken gespeichert sind. Auf Verlangen des
Betroffenen ist diesen Daten f&uuml;r die Dauer der Speicherung seine
Gegendarstellung beizuf&uuml;gen. Die Daten d&uuml;rfen nicht ohne diese
Gegendarstellung &uuml;bermittelt werden.<BR> <BR>

(7) Von der Berichtigung unrichtiger Daten, der Sperrung bestrittener Daten
sowie der L&ouml;schung oder Sperrung wegen Unzul&auml;ssigkeit der
Speicherung sind die Stellen zu verst&auml;ndigen, denen im Rahmen einer
Daten&uuml;bermittlung diese Daten zur Speicherung weitergegeben werden,
wenn dies keinen unverh&auml;ltnism&auml;&szlig;igen Aufwand erfordert und
schutzw&uuml;rdige Interessen des Betroffenen nicht entgegenstehen.<BR>
<BR>

(8) Gesperrte Daten d&uuml;rfen ohne Einwilligung des Betroffenen nur
&uuml;bermittelt oder genutzt werden, wenn

<OL>
<LI>es zu wissenschaftlichen Zwecken, zur Behebung einer bestehenden
Beweisnot oder aus sonstigen im &uuml;berwiegenden Interesse der
verantwortlichen Stelleoder eines Dritten liegenden Gr&uuml;nden
unerl&auml;sslich ist und</LI>

<LI>die Daten hierf&uuml;r &uuml;bermittelt oder genutzt werden
d&uuml;rften, wenn sie nicht gesperrt w&auml;ren.</LI>
</OL>

<A href="#top"><B>^</B></A>
<HR>

<P><B>Dritter Unterabschnitt -Aufsichtsbeh&ouml;rde</B></P>

<P><B><A name="&sect; 36">&sect;&nbsp;36</A> Bestellung eines Beauftragten
f&uuml;r den Datenschutz</B></P> weggefallen<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 37">&sect;&nbsp;37</A> Aufgaben des Beauftragten
f&uuml;r den Datenschutz</B></P>

weggefallen<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 38">&sect;&nbsp;38</A> Aufsichtsbeh&ouml;rde</B></P>

(1) Die Aufsichtsbeh&ouml;rde kontrolliert die Ausf&uuml;hrung dieses
Gesetzes sowie anderer Vorschriften &uuml;ber den Datenschutz, soweit diese
die automatisierte Verarbeitung personenbezogener Daten oder die
Verarbeitung oder Nutzung personenbezogener Daten in oder aus nicht
automatisierten Dateien regeln einschlie&szlig;lich des Rechts der
Mitgliedstaaten in den F&auml;llen des &sect;&nbsp;1 Abs.&nbsp;5. Die
Aufsichtsbeh&ouml;rde darf die von ihr gespeicherten Daten nur f&uuml;r
Zwecke der Aufsicht verarbeiten und nutzen; &sect;&nbsp;14 Abs.&nbsp;2 Nr.
1 bis 3, 6 und 7 gilt entsprechend. Insbesondere darf die
Aufsichtsbeh&ouml;rde zum Zweck der Aufsicht Daten an andere
Aufsichtsbeh&ouml;rden &uuml;bermitteln. Sie leistet den
Aufsichtsbeh&ouml;rden anderer Mitgliedstaaten der Europ&auml;ischen Union
auf Ersuchen erg&auml;nzende Hilfe (Amtshilfe). Stellt die
Aufsichtsbeh&ouml;rde einen Versto&szlig; gegen dieses Gesetz oder andere
Vorschriften &uuml;ber den Datenschutz fest, so ist sie befugt, die
Betroffenen hier&uuml;ber zu unterrichten, den Versto&szlig; bei den
f&uuml;r die Verfolgung oder Ahndung zust&auml;ndigen Stellen anzuzeigen
sowie bei schwerwiegenden Verst&ouml;&szlig;en die
Gewerbeaufsichtsbeh&ouml;rde zur Durchf&uuml;hrung gewerberechtlicher
Ma&szlig;nahmen zu unterrichten. Sie ver&ouml;ffentlicht
regelm&auml;&szlig;ig, sp&auml;testens alle zwei Jahre, einen
T&auml;tigkeitsbericht. &sect;&nbsp;21 Satz 1 und &sect;&nbsp;23
Abs.&nbsp;5 Satz 4 bis 7 gelten entsprechend.<BR> <BR>

(2) Die Aufsichtsbeh&ouml;rde f&uuml;hrt ein Register der nach
&sect;&nbsp;4d meldepflichtigen automatisierten Verarbeitungen mit den
Angaben nach &sect;&nbsp;4e Satz&nbsp;1. Das Register kann von jedem
eingesehen werden. Das Einsichtsrecht erstreckt sich nicht auf die Angaben
nach &sect;&nbsp;4e Satz&nbsp;1 Nr.&nbsp;9 sowie auf die Angabe der
zugriffsberechtigten Personen.<BR> <BR>

(3) Die der Kontrolle unterliegenden Stellen sowie die mit deren Leitung
beauftragten Personen haben der Aufsichtsbeh&ouml;rde auf Verlangen die
f&uuml;r die Erf&uuml;llung ihrer Aufgaben erforderlichen Ausk&uuml;nfte
unverz&uuml;glich zu erteilen. Der Auskunftspflichtige kann die Auskunft
auf solche Fragen verweigern, deren Beantwortung ihn selbst oder einen der
in &sect;&nbsp;383 Abs.&nbsp;1 Nr.&nbsp;1 bis&nbsp;3 der
Zivilprozessordnung bezeichneten Angeh&ouml;rigen der Gefahr
strafgerichtlicher Verfolgung oder eines Verfahrens nach dem Gesetz
&uuml;ber Ordnungswidrigkeiten aussetzen w&uuml;rde. Der
Auskunftspflichtige ist darauf hinzuweisen.<BR> <BR>

(4) Die von der Aufsichtsbeh&ouml;rde mit der Kontrolle beauftragten
Personen sind befugt, soweit es zur Erf&uuml;llung der der
Aufsichtsbeh&ouml;rde &uuml;bertragenen Aufgaben erforderlich ist,
w&auml;hrend der Betriebs- und Gesch&auml;ftszeiten Grundst&uuml;cke und
Gesch&auml;ftsr&auml;ume der Stelle zu betreten und dort Pr&uuml;fungen und
Besichtigungen vorzunehmen. Sie k&ouml;nnen gesch&auml;ftliche Unterlagen,
insbesondere die &Uuml;bersicht nach &sect;&nbsp;4g Abs.&nbsp;2 Satz&nbsp;1
sowie die gespeicherten personenbezogenen Daten und die
Datenverarbeitungsprogramme, einsehen. &sect;&nbsp;24 Abs.&nbsp;6 gilt
entsprechend. Der Auskunftspflichtige hat diese Ma&szlig;nahmen zu
dulden.<BR> <BR>

(5) Zur Gew&auml;hrleistung des Datenschutzes nach diesem Gesetz und
anderen Vorschriften &uuml;ber den Datenschutz, soweit diese die
automatisierte Verarbeitung personenbezogener Daten oder die Verarbeitung
personenbezogener Daten in oder aus nicht automatisierten Dateien regeln,
kann die Aufsichtsbeh&ouml;rde anordnen, dass im Rahmen der Anforderungen
nach &sect;&nbsp;9 Ma&szlig;nahmen zur Beseitigung festgestellter
technischer oder organisatorischer M&auml;ngel getroffen werden. Bei
schwerwiegenden M&auml;ngeln dieser Art, insbesondere, wenn sie mit
besonderer Gef&auml;hrdung des Pers&ouml;nlichkeitsrechts verbunden sind,
kann sie den Einsatz einzelner Verfahren untersagen, wenn die M&auml;ngel
entgegen der Anordnung nach Satz&nbsp;1 und trotz der Verh&auml;ngung eines
Zwangsgeldes nicht in angemessener Zeit beseitigt werden. Sie kann die
Abberufung des Beauftragten f&uuml;r den Datenschutz verlangen, wenn er die
zur Erf&uuml;llung seiner Aufgaben erforderliche Fachkunde und
Zuverl&auml;ssigkeit nicht besitzt.<BR> <BR>

(6) Die Landesregierungen oder die von ihnen erm&auml;chtigten Stellen
bestimmen die f&uuml;r die Kontrolle der Durchf&uuml;hrung des
Datenschutzes im Anwendungsbereich dieses Abschnittes zust&auml;ndigen
Aufsichtsbeh&ouml;rden.<BR> <BR>

(7) Die Anwendung der Gewerbeordnung auf die den Vorschriften dieses
Abschnitts unterliegenden Gewerbebetriebe bleibt unber&uuml;hrt.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 38a">&sect;&nbsp;38a</A>
Verhaltensregeln zur F&ouml;rderung der Durchf&uuml;hrung
datenschutzrechtlicher Regelungen</B></P>

<P><A name="&sect; 38 Abs 1">(1)</A> Berufsverb&auml;nde und andere
Vereinigungen, die bestimmte Gruppen von verantwortlichen Stellen
vertreten, k&ouml;nnen Entw&uuml;rfe f&uuml;r Verhaltensregeln zur
F&ouml;rderung der Durchf&uuml;hrung von datenschutzrechtlichen Regelungen
der zust&auml;ndigen Aufsichtsbeh&ouml;rde unterbreiten.</P>

<P><A name="&sect; 38 Abs 2">(2)</A> Die Aufsichtsbeh&ouml;rde
&uuml;berpr&uuml;ft die Vereinbarkeit der ihr unterbreiteten Entw&uuml;rfe
mit dem geltenden Datenschutzrecht.<BR>

<A href="#top"><B>^</B></A></P>
<HR>

<P><FONT size="+1"><B>Vierter Abschnitt</B></FONT><BR>
<B>Sondervorschriften</B></P>

<P><B><A name="&sect; 39">&sect;&nbsp;39</A> Zweckbindung bei
personenbezogenen Daten, die einem Berufs- oder besonderen Amtsgeheimnis
unterliegen</B></P> (1) Personenbezogene Daten, die einem Berufs- oder
besonderen Amtsgeheimnis unterliegen und die von der zur Verschwiegenheit
verpflichteten Stelle in Aus&uuml;bung ihrer Berufs- oder Amtspflicht zur
Verf&uuml;gung gestellt worden sind, d&uuml;rfen von der verantwortlichen
Stelle nur f&uuml;r den Zweck verarbeitet oder genutzt werden, f&uuml;r den
sie sie erhalten hat. In die &Uuml;bermittlung an eine nicht
&ouml;ffentliche Stelle muss die zur Verschwiegenheit verpflichtete Stelle
einwilligen.<BR> <BR>

(2) F&uuml;r einen anderen Zweck d&uuml;rfen die Daten nur verarbeitet oder
genutzt werden, wenn die &Auml;nderung des Zwecks durch besonderes Gesetz
zugelassen ist.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 40">&sect;&nbsp;40</A> Verarbeitung und Nutzung
personenbezogener Daten durch Forschungseinrichtungen</B></P>

(1) F&uuml;r Zwecke der wissenschaftlichen Forschung erhobene oder
gespeicherte personenbezogene Daten d&uuml;rfen nur f&uuml;r Zwecke der
wissenschaftlichen Forschung verarbeitet oder genutzt werden.<BR> <BR>

(2) Die personenbezogenen Daten sind zu anonymisieren, sobald dies nach dem
Forschungszweck m&ouml;glich ist. Bis dahin sind die Merkmale gesondert zu
speichern, mit denen Einzelangaben &uuml;ber pers&ouml;nliche oder
sachliche Verh&auml;ltnisse einer bestimmten oder bestimmbaren Person
zugeordnet werden k&ouml;nnen. Sie d&uuml;rfen mit den Einzelangaben nur
zusammengef&uuml;hrt werden, soweit der Forschungszweck dies erfordert.<BR>
<BR>

(3) Die wissenschaftliche Forschung betreibenden Stellen d&uuml;rfen
personenbezogene Daten nur ver&ouml;ffentlichen, wenn

<OL>
<LI>der Betroffene eingewilligt hat oder</LI>

<LI>dies f&uuml;r die Darstellung von Forschungsergebnissen &uuml;ber
Ereignisse der Zeitgeschichte unerl&auml;sslich ist.</LI>
</OL>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 41">&sect;&nbsp;41</A> Erhebung, Verarbeitung und
Nutzung personenbezogener Daten durch die Medien</B></P>

(1) Die L&auml;nder haben in ihrer Gesetzgebung vorzusehen, dass f&uuml;r
die Erhebung, Verarbeitung und Nutzung personenbezogener Daten von
Unternehmen und Hilfsunternehmen der Presse ausschlie&szlig;lich zu eigenen
journalistisch-redaktionellen oder literarischen Zwecken den Vorschriften
der &sect;&sect;&nbsp;5, 9 und 38a entsprechende Regelungen
einschlie&szlig;lich einer hierauf bezogenen Haftungs-regelung entsprechend
&sect;&nbsp;7 zur Anwendung kommen.<BR> <BR>

(2) F&uuml;hrt die journalistisch-redaktionelle Erhebung, Verarbeitung oder
Nutzung personenbezogener Daten durch die Deutsche Welle zur
Ver&ouml;ffentlichung von Gegendarstellungen des Betroffenen, so sind diese
Gegendarstellungen zu den gespeicherten Daten zu nehmen und f&uuml;r
dieselbe Zeitdauer aufzubewahren wie die Daten selbst.<BR> <BR>

(3) Wird jemand durch eine Berichterstattung der Deutschen Welle in seinem
Pers&ouml;nlichkeitsrecht beeintr&auml;chtigt, so kann er Auskunft
&uuml;ber die der Berichterstattung zugrundeliegenden, zu seiner Person
gespeicherten Daten verlangen. Die Auskunft kann nach Abw&auml;gung der
schutzw&uuml;rdigen Interessen der Beteiligten verweigert werden, soweit

<OL>
<LI>aus den Daten auf Personen, die bei der Vorbereitung, Herstellung oder
Verbreitung von Rundfunksendungen berufsm&auml;&szlig;ig journalistisch
mitwirken oder mitgewirkt haben, geschlossen werden kann,</LI>

<LI>aus den Daten auf die Person des Einsenders oder des
Gew&auml;hrstr&auml;gers von Beitr&auml;gen, Unterlagen und Mitteilungen
f&uuml;r den redaktionellen Teil geschlossen werden kann,</LI>

<LI>durch die Mitteilung der recherchierten oder sonst erlangten Daten die
journalistische Aufgabe der Deutschen Welle durch Ausforschung des
Informationsbestandes beeintr&auml;chtigt w&uuml;rde.</LI>
</OL>

Der Betroffene kann die Berichtigung unrichtiger Daten verlangen.<BR> <BR>

(4) Im &uuml;brigen gelten f&uuml;r die Deutsche Welle von den Vorschriften
dieses Gesetzes die &sect;&sect;&nbsp;5, 7, 9 und 38a. Anstelle der
&sect;&sect;&nbsp;24 bis 26 gilt &sect;&nbsp;42, auch soweit es sich um
Verwaltungsangelegenheiten handelt.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 42">&sect;&nbsp;42</A> Datenschutzbeauftragter der
Deutschen Welle</B></P>

(1) Die Deutsche Welle bestellt einen Beauftragten f&uuml;r den
Datenschutz, der an die Stelle des Bundesbeauftragten f&uuml;r den
Datenschutz tritt. Die Bestellung erfolgt auf Vorschlag des Intendanten
durch den Verwaltungsrat f&uuml;r die Dauer von vier Jahren, wobei
Wiederbestellungen zul&auml;ssig sind. Das Amt eines Beauftragten f&uuml;r
den Datenschutz kann neben anderen Aufgaben innerhalb der Rundfunkanstalt
wahrgenommen werden.<BR> <BR>

(2) Der Beauftragte f&uuml;r den Datenschutz kontrolliert die Einhaltung
der Vorschriften dieses Gesetzes sowie anderer Vorschriften &uuml;ber den
Datenschutz. Er ist in Aus&uuml;bung dieses Amtes unabh&auml;ngig und nur
dem Gesetz unterworfen. Im &uuml;brigen untersteht er der Dienst- und
Rechtsaufsicht des Verwaltungsrates.<BR> <BR>

(3) Jedermann kann sich entsprechend &sect;&nbsp;21 Satz 1 an den
Beauftragten f&uuml;r den Datenschutz wenden.<BR> <BR>

(4) Der Beauftragte f&uuml;r den Datenschutz erstattet den Organen der
Deutschen Welle alle zwei Jahre, erstmals zum 1. Januar 1994 einen
T&auml;tigkeitsbericht. Er erstattet dar&uuml;ber hinaus besondere Berichte
auf Beschluss eines Organes der Deutschen Welle. Die
T&auml;tigkeitsberichte &uuml;bermittelt der Beauftragte auch an den
Bundesbeauftragten f&uuml;r den Datenschutz.<BR> <BR>

(5) Weitere Regelungen entsprechend den &sect;&sect;&nbsp;23 bis 26 trifft
die Deutsche Welle f&uuml;r ihren Bereich. Die &sect;&nbsp;4f und 4g
bleiben unber&uuml;hrt.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><FONT size="+1"><B>F&uuml;nfter Abschnitt</B></FONT><BR>

<B>Schlussvorschriften</B></P>

<P><B><A name="&sect; 43">&sect;&nbsp;43</A>
Bu&szlig;geldvorschriften</B></P> (1) Ordnungswidrig handelt, wer
vors&auml;tzlich oder fahrl&auml;ssig </P>

<OL>
<LI>entgegen &sect;&nbsp;4d Abs. 1, auch in Verbindung mit &sect;&nbsp;4e
Satz 2, eine Meldung nicht, nicht richtig, nicht vollst&auml;ndig oder
nicht rechtzeitig macht,</LI>

<LI>entgegen &sect;&nbsp;4f Abs.&nbsp;1 Satz&nbsp;1 oder 2, jeweils auch in
Verbindung mit Satz&nbsp;3 und 6, einen Beauftragten f&uuml;r den
Datenschutz nicht, nicht in der vorgeschriebenen Weise oder nicht
rechtzeitig bestellt,</LI>

<LI>entgegen &sect;&nbsp;28 Abs.&nbsp;4 Satz&nbsp;2 den Betroffenen nicht,
nicht richtig oder nicht rechtzeitig unterrichtet oder nicht sicherstellt,
dass der Betroffene Kenntnis erhalten kann,</LI>

<LI>entgegen &sect; 28 Abs. 5 Satz 2 personenbezogene Daten
&uuml;bermittelt oder nutzt,</LI>

<LI>entgegen &sect;&nbsp;29 Abs.&nbsp;2 Satz&nbsp;3 oder 4 die dort
bezeichneten Gr&uuml;nde oder die Art und Weise ihrer glaubhaften Darlegung
nicht aufzeichnet,</LI>

<LI>entgegen &sect;&nbsp;29 Abs.&nbsp;3 Satz&nbsp;1 personenbezogene Daten
in elektronische oder gedruckte Adress-, Rufnummern-, Branchen- oder
vergleichbare Verzeichnisse aufnimmt,</LI>

<LI>entgegen &sect;&nbsp;29 Abs.&nbsp;3 Satz&nbsp;2 die &Uuml;bernahme von
Kennzeichnungen nicht sicherstellt,</LI>

<LI>entgegen &sect;&nbsp;33 Abs.&nbsp;1 den Betroffenen nicht, nicht
richtig oder nicht vollst&auml;ndig benachrichtigt,</LI>

<LI>entgegen &sect;&nbsp;35 Abs.&nbsp;6 Satz&nbsp;3 Daten ohne
Gegendarstellung &uuml;bermittelt,</LI>

<LI>entgegen &sect;&nbsp;38 Abs.&nbsp;3 Satz&nbsp;1 oder Abs.&nbsp;4 Satz 1
eine Auskunft nicht, nicht richtig, nicht vollst&auml;ndig oder nicht
rechtzeitig erteilt oder eine Ma&szlig;nahme nicht duldet oder</LI>

<LI>einer vollziehbaren Anordnung nach &sect;&nbsp;38 Abs.&nbsp;5
Satz&nbsp;1 zuwiderhandelt.</LI>
</OL>

(2) Ordnungswidrig handelt, wer vors&auml;tzlich oder fahrl&auml;ssig

<OL>
<LI>unbefugt personenbezogene Daten, die nicht allgemein zug&auml;nglich
sind, erhebt oder verarbeitet,</LI>

<LI>unbefugt personenbezogene Daten, die nicht allgemein zug&auml;nglich
sind, zum Abruf mittels automatisierten Verfahrens bereith&auml;lt,</LI>

<LI>unbefugt personenbezogene Daten, die nicht allgemein zug&auml;nglich
sind, abruft oder sich oder einem anderen aus automatisierten
Verarbeitungen oder nicht automatisierten Dateien verschafft,</LI>

<LI>die &Uuml;bermittlung von personenbezogenen Daten, die nicht allgemein
zug&auml;nglich sind, durch unrichtige Angaben erschleicht,</LI>

<LI>entgegen &sect;&nbsp;16 Abs.&nbsp;4 Satz&nbsp;1, &sect;&nbsp;28
Abs.&nbsp;5 Satz&nbsp;1, auch in Verbindung mit &sect;&nbsp;29 Abs.&nbsp;4,
&sect;&nbsp;39 Abs.&nbsp;1 Satz&nbsp;1 oder &sect;&nbsp;40 Abs.&nbsp;1, die
&uuml;bermittelten Daten f&uuml;r andere Zwecke nutzt, indem er sie an
Dritte weitergibt, oder</LI>

<LI>entgegen &sect;&nbsp;30 Abs.&nbsp;1 Satz&nbsp;2 die in &sect;&nbsp;30
Abs.&nbsp;1 Satz&nbsp;1 bezeichneten Merkmale oder entgegen &sect;&nbsp;40
Abs.&nbsp;2 Satz&nbsp;3 die in &sect;&nbsp;40 Abs.&nbsp;2 Satz&nbsp;2
bezeichneten Merkmale mit den Einzelangaben zusammenf&uuml;hrt.</LI>
</OL>

(3) Die Ordnungswidrigkeit kann im Falle des Absatzes&nbsp;1 mit einer
Geldbu&szlig;e bis zu f&uuml;nfzigtausend Deutsche Mark, in den F&auml;llen
des Absatzes&nbsp;2 mit einer Geldbu&szlig;e bis zu f&uuml;nfhunderttausend
Deutsche Mark geahndet werden.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 44">&sect;&nbsp;44</A> Strafvorschriften</B></P>

(1) Wer eine in &sect;&nbsp;43 Abs.&nbsp;2 bezeichnete vors&auml;tzliche
Handlung gegen Entgelt oder in der Absicht, sich oder einen anderen zu
bereichern oder einen anderen zu sch&auml;digen, begeht, wird mit
Freiheitsstrafe bis zu zwei Jahren oder mit Geldstrafe bestraft.<BR> <BR>

(2) Die Tat wird nur auf Antrag verfolgt. Antragsberechtigt sind der
Betroffene, die verantwortliche Stelle, der Bundesbeauftragte f&uuml;r den
Datenschutz und die Aufsichtsbeh&ouml;rde.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><FONT size="+1"><B>Sechster Abschnitt</B></FONT><BR>
<B>&Uuml;bergangsvorschriften</B></P>

<P><B><A name="&sect; 45">&sect;&nbsp;45</A> Laufende Verwendungen</B></P>

Erhebungen, Verarbeitungen oder Nutzungen personenbezogener Daten, die am
... [einsetzen: Tag nach der Verk&uuml;ndung dieses Gesetzes] bereits
begonnen haben, sind binnen drei Jahren nach diesem Zeitpunkt mit den
Vorschriften dieses Gesetzes in &Uuml;bereinstimmung zu bringen. Soweit
Vorschriften dieses Gesetzes in Rechtsvorschriften au&szlig;erhalb des
Anwendungsbereichs der Richtlinie 95/46/EG des Europ&auml;ischen Parlaments
und des Rates vom 24. Oktober 1995 zum Schutz nat&uuml;rlicher Personen bei
der Verarbeitung personenbezogener Daten und zum freien Datenverkehr zur
Anwendung gelangen, sind Erhebungen, Verarbeitungen oder Nutzungen
personenbezogener Daten, die am ... [einsetzen: Tag nach der
Verk&uuml;ndung dieses Gesetzes] bereits begonnen haben, binnen f&uuml;nf
Jahren nach diesem Zeitpunkt mit den Vorschriften dieses Gesetzes in
&Uuml;bereinstimmung zu bringen.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="&sect; 46">&sect;&nbsp;46</A> Weitergeltung von
Begriffsbestimmungen</B></P>

(1) Wird in besonderen Rechtsvorschriften des Bundes der Begriff Datei
verwendet, ist Datei

<OL>
<LI>eine Sammlung personenbezogener Daten, die durch automatisierte
Verfahren nach bestimmten Merkmalen ausgewertet werden kann (automatisierte
Datei), oder</LI>

<LI>jede sonstige Sammlung personenbezogener Daten, die gleichartig
aufgebaut ist und nach bestimmten Merkmalen geordnet, umgeordnet und
ausgewertet werden kann (nicht automatisierte Datei).</LI>
</OL>

Nicht hierzu geh&ouml;ren Akten und Aktensammlungen, es sei denn, dass sie
durch automatisierte Verfahren umgeordnet und ausgewertet werden
k&ouml;nnen.<BR> <BR>

(2) Wird in besonderen Rechtsvorschriften des Bundes der Begriff Akte
verwendet, ist Akte jede amtlichen oder dienstlichen Zwecken dienende
Unterlage, die nicht dem Dateibegriff des Absatzes 1 unterf&auml;llt; dazu
z&auml;hlen auch Bild- und Tontr&auml;ger. Nicht hierunter fallen
Vorentw&uuml;rfe und Notizen, die nicht Bestandteil eines Vorgangs werden
sollen.<BR> <BR>

(3) Wird in besonderen Rechtsvorschriften des Bundes der Begriff
Empf&auml;nger verwendet, ist Empf&auml;nger jede Person oder Stelle
au&szlig;erhalb der verantwortlichen Stelle. Empf&auml;nger sind nicht der
Betroffene sowie Personen und Stellen, die im Inland, in einem anderen
Mitgliedstaat der Europ&auml;ischen Union oder in einem anderen
Vertragsstaat des Abkommens &uuml;ber den Europ&auml;ischen Wirtschaftsraum
personenbezogene Daten im Auftrag erheben, verarbeiten oder nutzen.<BR>

<A href="#top"><B>^</B></A>
<HR>

<P><B><A name="anlage &sect;9">Anlage (zu &sect;&nbsp;9 Satz&nbsp;1)</A>
</B> </P>

Werden personenbezogene Daten automatisiert verarbeitet oder genutzt, ist
die innerbeh&ouml;rdliche oder innerbetriebliche Organisation so zu
gestalten, dass sie den besonderen Anforderungen des Datenschutzes gerecht
wird. Dabei sind insbesondere Ma&szlig;nahmen zu treffen, die je nach der
Art der zu sch&uuml;tzenden personenbezogenen Daten oder Datenkategorien
geeignet sind,

<OL>
<LI>Unbefugten den Zutritt zu Datenverarbeitungsanlagen, mit denen
personen-bezogene Daten verarbeitet oder genutzt werden, zu verwehren
(Zutrittskontrolle),</LI>

<LI>zu verhindern, dass Datenverarbeitungssysteme von Unbefugten genutzt
werden k&ouml;nnen (Zugangskontrolle),</LI>

<LI>zu gew&auml;hrleisten, dass die zur Benutzung eines
Datenverarbeitungssystems Berechtigten ausschlie&szlig;lich auf die ihrer
Zugriffsberechtigung unterliegenden Daten zugreifen k&ouml;nnen, und dass
personenbezogene Daten bei der Verarbeitung, Nutzung und nach der
Speicherung nicht unbefugt gelesen, kopiert, ver&auml;ndert oder entfernt
werden k&ouml;nnen (Zugriffskontrolle),</LI>

<LI>zu gew&auml;hrleisten, dass personenbezogene Daten bei der
elektronischen &Uuml;bertragung oder w&auml;hrend ihres Transports oder
ihrer Speicherung auf Datentr&auml;ger nicht unbefugt gelesen, kopiert,
ver&auml;ndert oder entfernt werden k&ouml;nnen, und dass
&uuml;berpr&uuml;ft und festgestellt werden kann, an welche Stellen eine
&Uuml;bermittlung personenbezogener Daten durch Einrichtungen zur
Daten-&uuml;bertragung vorgesehen ist (Weitergabekontrolle),</LI>

<LI>zu gew&auml;hrleisten, dass nachtr&auml;glich &uuml;berpr&uuml;ft und
festgestellt werden kann, ob und von wem personenbezogene Daten in
Datenverarbeitungssysteme eingegeben, ver&auml;ndert oder entfernt worden
sind (Eingabekontrolle),</LI>

<LI>zu gew&auml;hrleisten, dass personenbezogene Daten, die im Auftrag
verarbeitet werden, nur entsprechend den Weisungen des Auftraggebers
verarbeitet werden k&ouml;nnen (Auftragskontrolle),</LI>

<LI>zu gew&auml;hrleisten, dass personenbezogene Daten gegen zuf&auml;llige
Zerst&ouml;rung oder Verlust gesch&uuml;tzt sind
(Verf&uuml;gbarkeitskontrolle),</LI>

<LI>zu gew&auml;hrleisten, dass zu unterschiedlichen Zwecken erhobene Daten
getrennt verarbeitet werden k&ouml;nnen.</LI>
</OL>
<A href="#top"><B>^</B></A> zum Inhalt<BR>
<A href="#&sect; 9"><B>^</B></A> zum Artikel 
<HR>
</TD>
</TR>
</TABLE>

<CENTER>
<TABLE border="8" width="95%" cellspacing="0" cellpadding="8" summary="">
<TR bgcolor="#88ccff">
<TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
<TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
<TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
</TR>
</TABLE>
</CENTER>
<BR>
</BODY>
</HTML>

