<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<!-- Author = Wolf Zimmer -->

<TITLE>Wolf hat wieder etwas zu sagen</TITLE>
</HEAD>

<BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<P align="center"><FONT color="#000080" size="7"><B>FoeBuD eV</B></FONT></P>

<P>Wie wirklich unschwer zu erkennen ist, habe ich meinen Schwerpunkt in
dieser Ausgabe auf Datenschutz und Datensicherheit gelegt. Wer und was ist
FoeBuD?</P> <HR>

<P><IMG src="st_foebud1.gif" align="left" width="263" height="234"
vspace="5" hspace="10"> Der FoeBuD in Bielefeld...<BR>

...hei&szlig;t mit ganzem Namen <B>"Verein zur F&ouml;rderung des
&ouml;ffentlichen bewegten und unbewegten Datenverkehrs e.V."</B> und ist
eine Vereinigung, die durch die Bezeichnung "Computerclub" nur unzureichend
charakterisiert wird. Hier treffen Menschen mit den unterschiedlichsten
Interessen aufeinander. Der FoeBuD richtet sich in erster Linie an Menschen
vor dem Computer: Technikinteressierte sind hier ebenso vertreten wie
Menschen, die sich in den Bereichen Politik, Umwelt oder Menschenrechte
engagieren, M&auml;nner wie Frauen.</P>

<P>Jeden Monat findet die Veranstaltung <FONT color="#0000ff">PUBLIC
DOMAIN</FONT> statt, mit Vortr&auml;gen und Aktionen zu Themen aus dem
Bereich Zukunft und Technik, Wissenschaft und Politik, Kunst und Kultur.
Jede Woche gibt es ein Treffen in einem Caf&eacute; wo sich die Aktiven in
gro&szlig;er Runde zum Gedankenaustausch einfinden, und das gleichzeitig
auch Anlaufpunkt f&uuml;r alle Interessierten ist. (Alle Schaltfl&auml;chen
sind deaktiviert, da sie sich fast alle auf andere Kapitel innerhalb der
Homepage beziehen.)</P>

<P>Der FoeBuD unterh&auml;lt in den eigenen R&auml;umen die <FONT
color="#0000ff">Mailbox //BIONIC</FONT>. Hier befinden sich auch das
Archiv, &ouml;ffentliche Terminals sowie eine kleine Teek&uuml;che - ein
beliebter Treffpunkt. Nicht nur auf der j&auml;hrlichen Computermesse CeBIT
in Hannover ist der FoeBuD seit einigen Jahren mit einem eigenen Stand
vertreten, auch an anderen Congressveranstaltungen und Messen beteiligt er
sich aktiv mit eigenem Programm.</P>

<P>Ein weiterer Schwerpunkt liegt im Design anwenderfreundlicher Software,
Ver&ouml;ffentlichung allgemeinverst&auml;ndlicher Fachliteratur und
Kommunikationsdesign im weitesten Sinne, beispielsweise Konzeption und
Organisation eines Mediencaf&eacute; ("Globaler Dorfbrunnen"). Hier werden
Ideen erdacht und L&ouml;sungen entwickelt.</P>

<H2>Historisch. Futuristisch.</H2>

<P>Es begann in einer Galerie: Bei Art d'Ameublement in Bielefeld wurde
1985 zum ersten Mal ein Computerclub als Kunstwerk ausgestellt. Von dort
bis zur <FONT color= "#0000ff">PUBLIC DOMAIN</FONT> war es nur noch ein
kleiner Schritt -- die K&uuml;nstlerInnen Rena Tangens und padeluun
konzipierten diese monatliche Veranstaltung, um aufzuzeigen, wieviel
kreatives Potential im Bereich Technik, Wissenschaft, Kultur und Neue
Medien steckt.</P>

<P>Die Veranstaltungen waren auf Anhieb ein gro&szlig;er Erfolg und
entwickelten sich schnell zun&auml;chst zum Treffpunkt der Bielefelder und
sp&auml;ter dann der bundesweiten Szene. 1987 gr&uuml;ndeten Menschen, die
sich bei der PUBLIC DOMAIN zusammengefunden hatten, den FoeBuD e.V. Die
Besucherzahlen stiegen und stiegen, l&auml;ngst hatte es sich
herumgesprochen, da&szlig; die PUBLIC DOMAIN jedesmal ein
gesellschaftliches Ereignis ist, das den Rahmen des &uuml;blichen sprengt.
Viele Besucherinnen und Besucher reisen z.T. erheblich mehr als hundert
Kilometer weit an. Die Themenvielfalt ist gro&szlig;: Werfen Sie einmal
einen Blick auf die <FONT color="#0000ff">PUBLIC DOMAINs</FONT> ...</P>

<H2>Feminines Computerhandling</H2>

<P>Im Computerbereich immer noch nicht selbstverst&auml;ndlich, deshalb
erw&auml;hnenswert: Im FoeBuD arbeiten etliche Frauen an entscheidender
Stelle. Es gibt hier keine Frauenf&ouml;rderung im Sinne von
Entwicklungshilfe, die darauf abzielt, Menschen irgendeinem
IndustrieStandard anzugleichen. Vielmehr werden beim FoeBuD
unterschiedliche Motivationen im Umgang mit Technik bewu&szlig;t
wahrgenommen. Der soziale Kontext spielt ebenso wie die individuellen
Qualit&auml;ten eine wichtige Rolle. Weiterhin wird gro&szlig;er Wert
darauf gelegt, Vielfalt, Experimentierfreude und eine gewisse Wachheit und
Offenheit zu Die eher ganzheitliche Herangehensweise von Frauen an
Anwendungen, die Vorliebe f&uuml;r andere Spiele und der andere Stil beim
Programmieren bis hin zur (Fach-)Sprache sind eine eigene kulturelle
Qualit&auml;t. Der FoeBuD versucht, den Austausch im Umgang mit dem Rechner
und im Umgang miteinander zu f&ouml;rdern und f&uuml;r Frauen <I>und</I>
M&auml;nnern die Entwicklung einer eigenen Identit&auml;t zu
erm&ouml;glichen.</P>

<H2>Datennetze - Netzstrukturen</H2>

<P>Der FoeBuD setzt sich unter anderem f&uuml;r die allgemeine
Zug&auml;nglichkeit &ouml;ffentlicher Informationen &uuml;ber <FONT color=
"#0000ff">MailBox-Netze</FONT> ein. <FONT color= "#0000ff">MailBoxen</FONT>
sind das einzige Neue Medium, das nicht nur interaktiv ist, sondern auch
die bisher un&uuml;berwindliche Grenze zwischen Produzenten und Konsumenten
aufhebt. Jede und jeder kann nicht nur lesen, sondern auch schreiben --
kommentieren, anfragen und selbst ver&ouml;ffentlichen -- ohne Zensur. Die
deutschsprachigen B&uuml;rgernetze Z-NETZ und <FONT
color="#0000ff">CL</FONT> sind unabh&auml;ngig und besitzen eine dezentrale
Netzstruktur. Sie erm&ouml;glichen lokale und weltweite Kommunikation
f&uuml;r alle zum Telefon-Ortstarif.</P>

<P>Damit alle (also auch diejenigen, die keinen Computer, kein Modem oder
Telefon haben) die Chance haben, an dieser Kommunikation teilzunehmen,
fordert der FoeBuD &ouml;ffentliche Terminals, z.B. in Bibliotheken und in
eigens daf&uuml;r geschaffenen R&auml;umen wie den geplanten
Mediencaf&eacute;s. Dort sollen nicht nur die technischen
M&ouml;glichkeiten vorhanden sein, sondern auch qualifiziertes Personal zur
Verf&uuml;gung stehen, das den kompetenten Umgang -- technisch und
inhaltlich --damit vermitteln kann. Denn was n&uuml;tzt eine allgemein
zug&auml;ngliche Umweltdatenbank, wenn ich nicht wei&szlig;, wie die
Informationen abzufragen oder wie sie zu deuten sind.</P>

<P>Im kleinen Rahmen passiert das schon in den R&auml;umen des FoeBuD, wo
sich neben der <FONT color= "#0000ff">Mailbox //BIONIC</FONT> auch das
Archiv, &ouml;ffentliche Terminals und eine winzige Teek&uuml;che befinden.
Was hier bereits l&auml;uft -- bisher ehrenamtlich und mit gro&szlig;em
pers&ouml;nlichen Engagement -- kann als Labormodell betrachtet werden, das
nun durch eine &ouml;ffentliche Finanzierung auf die n&auml;chsth&ouml;here
Stufe der Entwicklung gestellt werden mu&szlig;, damit das hier auf engstem
Raum versammelte wertvolle Know-How f&uuml;r die Allgemeinheit nutzbar
gemacht werden kann.</P>

<H2>Techno-Kultur - Kulturtechnik</H2>

<P>Dem FoeBuD geht es um die F&ouml;rderung eines "sch&ouml;pferisch-
kritischen" Umgangs mit Wissenschaft und Technik: Ganzheitliches Herangehen
an Probleme, kreative und unkonventionelle L&ouml;sungen suchen und
interdisziplin&auml;re Zusammenarbeit. Der FoeBuD will zum einen
Forschungs- und Entwicklungsprozesse aktiv mitgestalten und zum anderen
wissenschaftliche Erkenntnisse aus Bereichen wie Biologie, Physik und
Informatik ebenso wie P&auml;dagogik, Psychologie und
Kommunikationswissenschaft f&uuml;r den Alltag einzusetzen.</P>

<P>Unsere Welt wird immer komplexer, das verf&uuml;gbare Wissen nimmt
t&auml;glich zu, Probleme spielen sich schon l&auml;ngst nicht mehr nur
lokal oder innerhalb einer Fachdisziplin ab. Eine Vielfalt von
Wechselwirkungen will bedacht werden, Wahrnehmung und Sprache
ver&auml;ndern sich durch die Medien. Ebenso sind neue Kulturtechniken
gefragt, beispielsweise ein sinnvoller Umgang mit einem &Uuml;berangebot an
Information. Das Informationszeitalter hat l&auml;ngst begonnen. &Uuml;ber
die Bedeutung von Streitkultur, Datenschutz und Privatsph&auml;re in der
Demokratie mu&szlig; neu nachgedacht werden. Umw&auml;lzungen in der
Technik haben immer auch Auswirkungen auf das soziale Verhalten der
Menschen -- ein Bewu&szlig;tsein f&uuml;r eine zeitgem&auml;&szlig;e Kultur
mu&szlig; aber erst geschaffen werden.</P>

<H2>BigBrotherAwards</H2>

<P>Seit Oktober 2000 organisiert der FoeBuD e.V. die Verleihung der <FONT
color= "#0000ff">BigBrotherAwards</FONT>: Die BigBrotherAwards Deutschland
wurden ins Leben gerufen, um die &ouml;ffentliche Diskussion um
Privatsph&auml;re und Datenschutz zu f&ouml;rdern - sie sollen
missbr&auml;uchlichen Gebrauch von Technik und Informationen aufzeigen.
Seit 1998 wird ein solcher "Preis" in verschiedenen L&auml;ndern und seit
dem Jahr 2000 auch in Deutschland an Firmen, Organisationen und Personen
verliehen, die in besonderer Weise und nachhaltig die Privatsph&auml;re von
Menschen beeintr&auml;chtigen oder (pers&ouml;nliche) Daten Dritten
zug&auml;nglich machen. Aus dieser Arbeit heraus enstand auch das Projekt
<FONT color= "#0000ff">Privacy-Card</FONT> -- viele gute Punkte f&uuml;r
den Datenschutz.</P>

<H2>Der "Biele-feldversuch"</H2>

<P>Jeden Dienstag <FONT color="#0000ff">treffen sich</FONT> beim FoeBuD
Mitglieder, MailBox-NutzerInnen und Interessierte zu einer zwanglosen
Gespr&auml;chsrunde, in der Themen aufgearbeitet und neue Ideen
ausgebr&uuml;tet werden. So finden sich bereits heute in vielen
ausw&auml;rtigen Projekten Ideen und MitarbeiterInnen aus Bielefeld.</P>

<P>Mit dem "Bielefeldversuch" ist ein Kristallisationspunkt verschiedener
Interessen, F&auml;higkeiten und Talente entstanden. F&uuml;r einige bietet
der FoeBuD den essentiellen Freiraum zum Experimentieren, f&uuml;r andere
ist er ein Berufs(er)findungslabor oder eine innovative SoftWare-Schmiede.
Eine Bielefelder Zeitung sprach davon, da&szlig; hier der Expertennachwuchs
der Region gemacht wird und f&uuml;r Art d'Ameublement liegt der
Schwerpunkt nat&uuml;rlich auf dem k&uuml;nstlerischen Aspekt.</P>

<P>Es gilt, eine umfassende Konzeption mit Modellcharakter zu entwickeln,
um innovative Ideen, soziale Verantwortung und kritischen Geist zur
Entfaltung zu bringen und zur Gestaltung einer lebenswerten Zukunft
f&uuml;r uns alle einzusetzen.</P>

<P><B>Unterst&uuml;tzen Sie unsere Arbeit</B>:<BR> &Uuml;ber Menschen, die
bei uns mitarbeiten wollen, freuen wir uns ebenso wie &uuml;ber Spenden und
F&ouml;rdermitgliedschaften, die uns erm&ouml;glichen, unser Projekt zu
finanzieren!</P> <HR>

<P>Soweit die eigene Vorstellung auf der Website <FONT
color="#0000ff"><B><A href="st_foebud1.html" target= "_top">&lt;
http//www.foebud.org&gt;,</A></B></FONT> die hier als Original bewundert
werden kann.</P>

<P>Leicht sind die derzeitigen vier wichtigen Engagements unter Aktuell
nachzulesen. Wobei der Punkt 4: "PGP, Das deutsche Handbuch" wohl von
Anfang mit dabei ist. Dieses Buch gibt es nun in der vierten Auflage und
ist komplett als HTML-Datei auf der Homepage lesbar. Bei Bestellung als
Buch wird eine CD mitgeliefert. Zur Verdeutlichung des ganzen habe ich die
Genehmigung, hier das Vorwort &uuml;bernehmen zu d&uuml;rfen:</P> <HR>

<H2>Von der E-Card zur E-Mail</H2>

<P>Vergehen und Verbrechen gegen die "Privatheit" sind heimt&uuml;ckisch:
Die Auswirkungen sind zwar zu sp&uuml;ren, aber selten im Zusammenhang mit
der Ursache. Die technische Entwicklung und ihre Nutzung ist
dissipativ&nbsp;- sie l&auml;&szlig;t sich nicht umkehren. Alles was wir
heute tun und zulassen, werden wir auch in Zukunft ertragen m&uuml;ssen.
Nahezu jeder Vorgang in unserem Leben, was wir einkaufen, wann wir an
welchem Automaten Geld abheben, wann wir die Toilettensp&uuml;lung
dr&uuml;cken, wann wir uns verlieben, ist fernabfragbar. Die Generation der
Gro&szlig;v&auml;ter war der ethischen &Uuml;berzeugung, da&szlig; diese
Daten, die ja meist nur als Abfallprodukt der Abrechnung anfielen, nicht
zur passiven Spionage im Alltag genutzt werden w&uuml;rden. Die Enkel
jedoch sehen gerade die Auswertung und den Verkauf dieser Daten als
Schl&uuml;sseltechnologie um "richtig dick Schotter zu machen". Schon bald
werden Sie im gehobenen Dienst keinen Job mehr bekommen, ohne da&szlig; der
designierte Arbeitgeber vorher eine Profilaufstellung von Ihnen in Auftrag
gibt. Der Menschheitstraum vom freien Leben innerhalb einer starken
Gemeinschaft r&uuml;ckt damit noch ein St&uuml;ckchen weiter in die Ferne.
Nur die Spie&szlig;er werden&nbsp;- egal ob mit Tattoo und Piercing oder
ohne&nbsp;weiterhin ein kleines, kl&auml;gliches Leben f&uuml;hren
k&ouml;nnen. Bis der Terror auch sie erreicht.</P>

<P>Die Entwicklung ist schleichend&nbsp;- aber rasant. Mit Zugriff auf eine
einzige Datenbasis, n&auml;mlich z.B. die der Firma EDS (Electronic Data
Systems) k&ouml;nnten Sie nahezu jeden 'zivilisierten' Menschen auf dieser
Welt 'in den Griff kriegen'. Sie w&uuml;&szlig;ten, wann er gereist ist,
mit wem, neben wem er im Flugzeug gesessen hat, wie er sein Ticket bezahlt
hat, wann er Geld abgehoben hat, wer vor ihm oder nach ihm am selben
Geldautomaten Geld abgehoben hat und w&uuml;&szlig;ten, was er im
Restaurant bestellt. Sie kennen seine Lieblingsfarbe und seinen
Kreditrahmen. Stellen Sie sich vor: Auch andere Menschen k&ouml;nnten
pl&ouml;tzlich mehr &uuml;ber Sie wissen, als Sie selbst.</P>

<P>"Mir doch egal?" - Oder denken Sie einfach nur, da&szlig; Ihnen gerade
kein Argument gegen diese Entwicklung einf&auml;llt? Sie brauchen nicht zu
begr&uuml;nden, warum Sie niemand Unbefugtes Ihre Briefe lesen lassen. Sie
brauchen nicht zu erkl&auml;ren, warum Sie anderen verbieten, Daten
&uuml;ber Sie zu speichern und zu verarbeiten. Es ist Ihr Leben und Sie und
Ihre Privatheit sind kein Eigentum anderer. Sie sollten sich nicht an das
'komische Gef&uuml;hl in der Magengrube' gew&ouml;hnen.</P>

<P>Sie wollen eigentlich so ber&uuml;hmt sein wie Marilyn Monroe? Und noch
kennt Sie keiner? Nein, dadurch, da&szlig; Sie Ihre Privatsph&auml;re
aufgeben werden Sie nicht ber&uuml;hmt. Und sicher kennen Sie auch das alte
Sprichwort: Reden ist Silber&nbsp;- Schweigen ist Gold. Es n&uuml;tzt Ihrem
eigenen Leben mehr, wenn Sie nichts fremdbestimmt von sich preisgeben. Im
Gegenteil: Es n&uuml;tzt Ihnen letztendlich mehr, wenn Sie auch die Daten
anderer sch&uuml;tzen.</P>

<P>"Gebt Ihnen doch die Daten - das kann doch sowieso niemand auswerten."
Falsch. "Data Mining" ist einfach. Sie haben es vielleicht selbst schon
gemacht, wenn Sie eine Internetsuchmaschine nutzen. Sie geben drei Begriffe
ein mit ein paar Pluszeichen davor und statt einigen Millionen sehen Sie
pl&ouml;tzlich nur noch drei Treffer. Das ganze in wenigen
(Milli-)Sekunden.</P>

<P>"Ich kann ja doch nichts tun." - Falsch. "Jede und jeder hat einen
Einflu&szlig; gr&ouml;&szlig;er als null." Untersch&auml;tzen Sie das
nicht. Ihr Denken, Bedenken und besonders Ihr Handeln beeinflu&szlig;t die
Umgebung weit mehr, als sich die meisten Menschen vorstellen. Eine Umgebung
von Duckm&auml;usern wird Duckm&auml;user erzeugen. Eine geistig anregende,
freie Gesellschaft wird geistig anregende, freie Menschen bedingen. Und die
Ausnahmen best&auml;tigen dann lediglich die Regel.</P>

<P>Lassen Sie sich nicht erz&auml;hlen, da&szlig; Sicherheit, Ordnung und
unsere Demokratie durch Verschl&uuml;sselung gef&auml;hrdet seien: "Es hat
keinen Sinn, die Demokratie dadurch zu sch&uuml;tzen, indem wir sie
abschaffen." Dieser Satz von Ingo Ruhmann ist schlicht, einfach und
richtig. Und wenn der Schutz der Privatsph&auml;re kriminell wird, haben
nur noch Kriminelle Privatsph&auml;re. Ab wann aber zum Beispiel 'Global
Management' kriminell ist, m&uuml;ssen Sie als 'Souver&auml;n' bestimmen.
Denn gar nicht mehr so sehr 'der Staat' ist der 'Big Brother', sondern wir
brauchen endlich wieder mehr Staat (eine wehrhafte Demokratie), die
verhindert, da&szlig; wir zulassen, da&szlig; der letzte Rest Kontrolle
&uuml;ber die Kapital- und Machtinteressen vollends aus den H&auml;nden der
Gesellschaft genommen wird. Liberal ist ok. Aber der real existierende
Liberalismus ist mindestens genauso gef&auml;hrlich wie die Nachbarn
Kapitalismus, Nationalismus und Kommunismus.</P>

<H2>Gedankenstrich...</H2>

<P>Dies ist nun schon die vierte v&ouml;llig neu bearbeitet Version dieses
Buches. Wir sind gl&uuml;cklich &uuml;ber und dankbar f&uuml;r den riesigen
Arbeitseinsatz, den Christopher Creutzig geleistet hat. Er hat neben der
inhaltlichen Arbeit auch noch das Layout (mit T<SMALL>E</SMALL>X) gemacht,
die CD zusammengestellt und ebenso wie Andreas Buhl, der den Windows-Teil
schrieb, hat er unglaublich viel ehrenamtliche Lebensenergie in dieses Buch
gesteckt. Also lesen Sie das jetzt aber auch bitte gr&uuml;ndlich und
stecken Sie Ihre Datenpostkarten zuk&uuml;nftig in Briefumschl&auml;ge.
Denn ohne PGP versandten Sie bisher keine E-Mails sondern lediglich
E-Cards. Allerdings k&ouml;nnen wir Ihnen nicht alle M&uuml;he abnehmen.
Auch Sie m&uuml;ssen sich ein wenig plagen, PGP und die
Verschl&uuml;sselung mit &Ouml;ffentlichem und Privatem Schl&uuml;sseln zu
verstehen. Es gibt keine Sicherheit mit "Klick&amp;Go". Falsch verstandene
und fahrl&auml;ssig verwendete Verschl&uuml;sselung kann den
Unsicherheitsgrad noch um den Faktor erh&ouml;hen, da&szlig; Sie sich nun
sicher glauben, aber dennoch ausspioniert werden. In einer Firma, deren
Patentunterlagen beim Versand per E-Mail in die H&auml;nde der Konkurrenz
fallen, kann das unangenehm sein...</P>

<P>Kein Meister wird vom Himmel fallen. Und auch wenn Sie der kluge Kopf in
Ihrer Abteilung sind, so m&uuml;ssen es ja auch alle anderen
Mitarbeiterinnen und Mitarbeiter verstehen. Falls Sie weiter Hilfe
ben&ouml;tigen, so m&ouml;chte ich Sie hier auf die Struktur von Seminaren
aufmerksam machen, die Ihnen den Einstieg und das Nutzen von PGP
erleichtern. Sie finden Informationen dazu unter
<TT>www.foebud.org/seminare</TT>. Bei Drucklegung werden solche Seminare
von unseren Partner in N&uuml;rnberg, Leipzig, M&uuml;nchen und von uns in
Bielefeld angeboten.</P>

<P>Willkommen im Netzwerk des Vertrauens</P>

<P>Rena Tangens &amp; padeluun</P>

<P><B><A href="copyright.html">Copyright-Vermerke</A></B><BR>
<B><A href="order.html">Buch bestellen</A></B></P>
<HR>

<UL>
<LI>1. Leseanleitung</LI>

<LI>2. &Uuml;bersetzung und Fachbegriffe</LI>

<LI>3. Konventionen</LI>

<LI>4. Danksagungen</LI>
</UL>

<H2><B>1. Leseanleitung</B></H2>

<P>Dieses Buch beschreibt eine Reihe &auml;hnlicher Programme. Zum Einen
sind da verschiedene Versionen von PGP zu nennen, im Wesentlichen die
Version&nbsp;2.6.2i f&uuml;r nahezu alle Betriebssysteme (MS-DOS, Unix,
Linux, VMS, MacOS, Amiga, Archimedes, Atari,&nbsp;...), des Weiteren die
Versionen 5.0, 5.5.3i und 6.0 f&uuml;r MS&nbsp;Windows. Dar&uuml;ber hinaus
behandelt dieses Buch auch eine "Open Source"-Implementation des
OpenPGP-Standards, ein Programm namens GnuPG (f&uuml;r Unix, Linux,
MS&nbsp;Windows). Im allgemeinen Teil und auch in Teil&nbsp;II finden Sie
Formulierungen der Art "PGP arbeitet so:...". Diese allgemeinen
Beschreibungen schlie&szlig;en&nbsp;- sofern nicht aus dem Kontext anders
deutlich&nbsp;- auch GnuPG mit ein.</P>

<P>Welche Kapitel dieses Buches Sie in welcher Reihenfolge lesen sollten,
h&auml;ngt au&szlig;er von Ihren Vorkenntnissen auch davon ab, welche
Version von PGP Sie auf welchem Betriebssystem einsetzen m&ouml;chten.
Allen Lesenden wird dringend angeraten, dieses einleitende Kapitel komplett
zu lesen, um im weiteren Text zu verstehen, was mit bestimmten Begriffen
gemeint ist. Wenn Sie sich fragen, was und wozu Sie verschl&uuml;sseln
sollten, empfehlen wir Abschnitt&nbsp;6.1. Weiterhin sei allen Menschen,
die sich noch nicht eingehend mit Verschl&uuml;sselungssystemen
besch&auml;ftigt haben, Abschnitt&nbsp;2.5 ans Herz gelegt, um einen
&Uuml;berblick zu erhalten, was PGP eigentlich tut. Bedauerlicherweise ist
es nicht m&ouml;glich, echte Sicherheit zu erlangen, indem man irgendwo ein
paar Kn&ouml;pfchen dr&uuml;ckt, ohne zu verstehen, was passiert. Von
Kapitel&nbsp;4 ist beim ersten schnellen &Uuml;berfliegen zumindest
Abschnitt&nbsp;4.4.3 ratsam. Kapitel&nbsp;5 ist kaum zu vermeiden, wenn die
durch PGP erreichte Sicherheit nicht ausgesprochen tr&uuml;gerisch sein
soll. Kapitel&nbsp;7 gibt Ihnen das notwendige Wissen an die Hand, um mit
Personen, die Sie nie getroffen haben, eine gesicherte Kommunikation
aufzubauen. Au&szlig;erdem bewahrt die Lekt&uuml;re jenes Kapitels Sie
hoffentlich vor einigen schwerwiegenden "Anf&auml;ngerfehlern".</P>

<P>Erst nach diesen Hintergrundinformationen ist es sinnvoll, sich die
Installation und Bedienung des Programms anzuschauen. Falls Sie sich noch
nicht sicher sind, welche Version Sie einsetzen sollten, gibt hoffentlich
Anhang&nbsp;B die n&ouml;tigen Informationen f&uuml;r die Entscheidung.
F&uuml;r diejenigen unter Ihnen, die eine kommandozeilenorientierte
PGP-Version (und evtl. anschlie&szlig;end ein graphisches Frontend)
installieren wollen, ist der Teil&nbsp;II geschrieben. Diejenigen, die
lieber eine "reine" Windows-Applikation haben m&ouml;chten, finden die
n&ouml;tigen Informationen in Teil&nbsp;III. Beide Teile setzen die
Kenntnis des allgemeinen Teils voraus.</P>

<P>Informationen zur Lizensierung von PGP, Distribution, Copyrights,
Warenzeichen, Gew&auml;hrleistungen und Exportbeschr&auml;nkungen
enth&auml;lt der Anhang&nbsp;F.</P>

<P>Noch ein paar Worte &uuml;ber die Verwendung maskuliner und femininer
Formen bei Begriffen wie "Anwender" oder "Programmiererin": In dieser
Anleitung werden maskuline und feminine Formen austauschbar verwendet. In
jedem Fall sind beide Geschlechter gemeint. Nebenbei bemerkt versuchen wir,
nach alter Rechtschreibung zu schreiben, Abweichungen davon sind also echte
Fehler und nicht einem Versuch der Umstellung zuzuschreiben. Das soll keine
Rechthaberei sein&nbsp;wir sind nur in der neuen Rechtschreibung bei weitem
nicht sattelfest genug, um Ihnen diesen Text in der Qualit&auml;t zu geben,
die wir selbst von uns erwarten.</P>

<H2>2. &Uuml;bersetzung und Fachbegriffe</H2>

<P>Bei &Uuml;bersetzungen und deutschen Texten zu EDV-Themen ist es
h&auml;ufig schwer, zu entscheiden, in welchem Umfang Fachbegriffe
eingedeutscht werden sollten. Werden zu viele Begriffe &uuml;bersetzt, kann
das Leserinnen verwirren, denen die englischen Begriffe vertraut sind.
Umgekehrt kann ein zu wenig eingedeutschter Text f&uuml;r diejenigen
unverst&auml;ndlich bleiben, die die englischen Begriffe nicht kennen. Wir
haben uns f&uuml;r eine recht weitgehende Eindeutschung entschieden. Um
nicht zuviel Verwirrung zu stiften, finden Sie in Tabelle&nbsp;I-1.1 eine
Liste der Worte, die Ihnen evtl. in der englischen Form gel&auml;ufiger
sind, die wir aber in der deutschen Form verwenden.</P>

<TABLE>
<CAPTION>
<STRONG>Tabelle:</STRONG> Von uns verwendete &Uuml;bersetzungen
</CAPTION>

<TR>
<TD>
 <DIV align="CENTER">
   <TABLE cols="4">
     <COL align="CENTER">
     <COL align="LEFT">
     <COL align="LEFT">
     <COL align="CENTER">

     <TR>
       <TD nowrap>englischer Begriff</TD> 
       <TD nowrap>unsere &Uuml;bersetzung</TD>
     </TR>

     <TR>
       <TD nowrap>default</TD>            
       <TD nowrap>Standard</TD>
     </TR>

     <TR>
       <TD nowrap>directory</TD>          
       <TD nowrap>Verzeichnis</TD>
     </TR>

     <TR>
       <TD nowrap>environment variable</TD>
       <TD nowrap>Umgebungsvariable</TD>
     </TR>

     <TR>
       <TD nowrap>exit code</TD>           
       <TD nowrap>Beendigungscode</TD>
     </TR>

     <TR>
       <TD nowrap><A name="158">&nbsp;</A> <A name="159">&nbsp;</A>
       <A name="160">file</A> name extension</TD>
       <TD nowrap>Nameserweiterung/Suffix</TD>
     </TR>

     <TR>
       <TD nowrap>fingerprint</TD>  
       <TD nowrap>Fingerabdruck</TD>
     </TR>

     <TR>
       <TD nowrap>grassroot organization</TD> 
       <TD nowrap>politische Basisorganisation</TD>
     </TR>

     <TR>
       <TD nowrap><A name="161">&nbsp;</A> <A name="162">&nbsp;</A>
       <A name="163">&nbsp;</A> <A name="164">&nbsp;</A>
       <A name="165">key</A> compromise/revocation certificate</TD>
       <TD nowrap>Schl&uuml;ssel-R&uuml;ckrufurkunde</TD>
     </TR>

     <TR>
       <TD nowrap>key ring</TD>
       <TD nowrap>Schl&uuml;sselbund</TD>
     </TR>

     <TR>
       <TD nowrap>message digest</TD>
       <TD nowrap>Textpr&uuml;fsumme</TD>
     </TR>

     <TR>
       <TD nowrap>pass phrase</TD>
       <TD nowrap>Mantra</TD>
     </TR>

     <TR>
       <TD nowrap>public key ring</TD>
       <TD nowrap>&ouml;ffentlicher Schl&uuml;sselbund</TD>
     </TR>

     <TR>
       <TD nowrap>private key ring</TD> 
       <TD nowrap>geheimer Schl&uuml;sselbund</TD>
     </TR>

     <TR>
       <TD nowrap>swapfile</TD>     
       <TD nowrap>Auslagerungsdatei</TD>
     </TR>

     <TR>
       <TD nowrap>
       </TD>
     </TR>
   </TABLE>
 </DIV>
</TD>
</TR>
</TABLE>

<P>Weitere Fachausdr&uuml;cke finden Sie im Glossar erl&auml;utert. Wir
haben uns M&uuml;he gegeben, Begriffe mit wohldefinierter Bedeutung zu
w&auml;hlen. Formulierungen wie "10 verlorene Bereiche in 8 Bereichen"
(dies verlautbarten &auml;ltere Versionen des MS-DOS-Programms
<TT>chkdsk</TT>) haben sich hoffentlich nicht eingeschlichen.</P>

<H2>3. Konventionen</H2>

<P>In diesem Buch verwenden wir die folgenden Darstellungen:
<EM>Wichtiges</EM> wird kursiv geschrieben, <TT>Eingaben</TT> und
<TT>Ausgaben</TT> werden, ebenso wie <TT>Men&uuml;eintr&auml;ge</TT>, in
Schreibmaschinenschrift dargestellt.<BR>
Angaben der Form Sch95] sind Literaturangaben, das Literaturverzeichnis
finden Sie im Anhang. In der Kopfzeile finden Sie stets die Angabe des
aktuellen Kapitels und Abschnittes darin einschlie&szlig;lich der Nummer
des Buchteils, in dem Sie gerade lesen.</P>

<H2>4. Danksagungen</H2>

<P>An dieser Stelle m&ouml;chte ich zun&auml;chst Philip Zimmermann danken,
da&szlig; er PGP geschrieben und der Allgemeinheit zur Verf&uuml;gung
gestellt hat. Die Existenz dieses Programmes hat vieles &uuml;berhaupt erst
erm&ouml;glicht, nicht zuletzt dieses Buch. Ebenso geb&uuml;hrt den
weiteren Entwicklern PGPs mein Dank. Marc Aurel m&ouml;chte ich danken,
da&szlig; er mich vor vielen Jahren auf meinen ersten Schritten mit PGP
begleitet hat. Die erste &Uuml;bersetzung der Anleitung zu PGP&nbsp;2.3a
(der Ur-Ur-Gro&szlig;vater des Buchs, das Sie in H&auml;nden halten) begann
als Gemeinschaftsprojekt von sechs Leuten, von denen schlie&szlig;lich Abel
Deuring und ich &uuml;brigblieben.</P>

<P>F&uuml;r die Verbreitung PGPs in Deutschland waren mehrere Leute
wesentlich. Zun&auml;chst m&uuml;ssen wir uns hier selbst nennen, den
FoeBuD&nbsp;e.V., der nicht nur diese Anleitung verbreitet hat (als PGP
noch kaum bekannt war), sondern dar&uuml;ber hinaus sowohl durch Schulungen
als auch politische Arbeit und nicht zuletzt ausf&uuml;hrliche Betreuung
von Journalisten und Politikern an der Schaffung des n&ouml;tigen Rahmens
mitgewirkt hat. Au&szlig;erdem sind hier von den vielen beteiligten
Menschen Lutz Donnerhacke f&uuml;r seine Arbeit mit dem Aufbau einer
Zertifizierungsstruktur und PGP&nbsp;2.6.3in und Kai Raven f&uuml;r seine
Einsteiger-Anleitung zu erw&auml;hnen.</P>

<P>F&uuml;r die aktuelle Auflage geht mein Dank an Donald E. Knuth f&uuml;r
sein System T<SMALL>E</SMALL>X und an Leslie Lamport und das
L<SUP><SMALL>A</SMALL></SUP>T<SMALL>E</SMALL>X3-Team f&uuml;r
L<SUP><SMALL>A</SMALL></SUP>T<SMALL>E</SMALL>X2<SUB>e</SUB>; au&szlig;erdem
Markus Kohm f&uuml;r KOMA-Script. Typographische Fehler sind sicherlich
meinen &Auml;nderungen zuzuschreiben.</P>

<P>Den Korrekturleserinnen und Korrekturlesern m&ouml;chte ich hier
besonders danken, ohne sie w&auml;re dieses Buch zwar eher fertig geworden,
aber inhaltlich gewonnen hat es auf jeden Fall. Besonders zu nennen sind
hier padeluun, Tom Budewig, Ursula Begerow und J&ouml;rg Jenetzky. Weitere
wichtige Kommentare kamen von Manuel Beckmann und Arvid Requate. Dem
Autoren GnuPGs, Werner Koch, m&ouml;chte ich au&szlig;er f&uuml;r jenes
Programm auch f&uuml;r seine technischen Anmerkungen und Korrekturen zu
diesem Handbuch danken.</P>
<HR>

<P>So das sollte nun als Vorstellung der sehr interessanten Website
reichen. Alles was ich noch geschrieben hatte, habe ich gel&ouml;scht, da
ja im Endeffekt doch schon alles gesagt ist. &Uuml;ber die Aktion:
Privacy-Card habe ich einen ganzen Artikel verfasst, aber da das ganze
Verfahren noch offen ist, lasse ich eine Ver&ouml;ffentlich lieber
sein.</P>                 
</TD>
</TR>
</TABLE>

<CENTER>
<TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
summary="">
<TR bgcolor="#88ccff">
<TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
<TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
<TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
</TR>
</TABLE>
</CENTER>
<BR>
</BODY>
</HTML>

