<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<!-- Author = Wolf Zimmer -->

<TITLE>Rote Karte</TITLE>
</HEAD>

<BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<A name="top"></A> 

<CENTER>
<H1><FONT color="#000080"><B>Rote Karte f&uuml;r Internetschn&uuml;ffler</B></FONT></H1>
Kampagne gegen Vorratsdatenspeicherung im Internet und in der Telekommunikation
</CENTER>

<P>Der Bundesrat hat einen Gesetzentwurf mit der Pflicht zur
Vorratsspeicherung aller Bestands-, Verbindungs- und Nutzungsdaten auf den
Weg gebracht. Jetzt und hier ist es nun angebracht, n&auml;here
Informationen zu suchen, zu sammeln und somit zu erfahren, was das Ganze
soll und vordergr&uuml;ndig, wie man sich sch&uuml;tzen und nat&uuml;rlich
auch dagegen tun kann.</P>

<CENTER>
<TABLE width="90%" border="0" align="center" cellspacing="5" summary="">
<TR>
<TD>
<DIV align="center">
<A href="#rk1">Worum geht es?</A><BR>
<IMG src="st_rotekarte01.gif" alt="" width="200" height="5">
</DIV>
</TD>
</TR>
</TABLE>

<TABLE width="100%" cellpadding="0" cellspacing="5"
align="center" summary="">
<TR>
<TD width="28%" align="right">
<DIV align="left">
<P><A href="#rk2">Text und Stand der Gesetzesvorschl&auml;ge</A><BR>
<IMG src="st_rotekarte02.gif" alt="" width="170" height="5"></P>

<P><A href="#rk3">Hintergrundinformationen</A><BR>
<IMG src="st_rotekarte02.gif" alt="" width="170" height="5"></P>
</DIV>
</TD>

<TD width="40%" align="center" valign="middle"><BR>
<IMG src="st_rotekarte1.gif" alt="" width="109" height="139"></TD>

<TD width="32%" align="left">
<DIV align="right">
<P><A href="#rk4">So k&ouml;nnt ihr euch wehren</A><BR>
<IMG src="st_rotekarte03.gif" alt="" width="170" height="5"></P>

<P><A href="#rk5">So k&ouml;nnt ir euch
sch&uuml;tzen</A><BR>
<IMG src="st_rotekarte03.gif" alt="" alt="" width="170" height="5"></P>
</DIV>
</TD>
</TR>

<TR>
<TD colspan="3" align="center"><A href="#rk6">Noch Fragen?</A><BR>
<IMG src="st_rotekarte01.gif" alt="" width="200" height="5"> </TD>
</TR>
</TABLE>
</CENTER>

<P>&nbsp;</P>
<HR>

<P><A name="rk1"></A><FONT size="+1"><B>Worum geht es?</B></FONT></P>

<P>Der Bundesrat hat einen Gesetzentwurf beschlossen , der vorsieht, dass
sowohl im Bereich der klassischen Telekommunikation (Festnetz, Handy, SMS,
Fax usw.) als auch im Internet alle verf&uuml;gbaren Daten auf Vorrat
gespeichert werden sollen. Zweck soll es sein, daf&uuml;r zu sorgen, dass
die Geheimdienste und Strafverfolgungsbeh&ouml;rden im Bedarfsfall Daten
vorfinden, auf die sie zugreifen k&ouml;nnen. Einzelheiten sollen nicht auf
gesetzlicher Ebene festgeschrieben, sondern von der Bundesregierung durch
Rechtsverordnung festgelegt werden.</P>

<P>F&uuml;r Daten aus den Bereichen Telekommunikation und Internet gilt zur
Zeit genau die gegenteilige Regelung: Grunds&auml;tzlich sind alle Daten,
die nicht zur Abrechnung gebraucht werden, zu l&ouml;schen. Insbesondere im
Internet sind nach wie vor die meisten Angebote kostenlos, auch bei
Bezahldiensten werden zur Abrechnung nur wenige Daten ben&ouml;tigt. Daher
m&uuml;ssen die allermeisten Daten gel&ouml;scht werden.</P>

<P>Bei einer Speicherpflicht drohen im Gegensatz dazu nahezu
unbeschr&auml;nkte Zwangspeicherungen durch alle beteiligten Akteure. So
h&auml;tte ein Webhosting-Provider zu speichern, wer seine Seiten besucht.
Access-Provider m&uuml;ssten speichern, wann der Nutzer welche Inhalte
abruft. Damit entst&uuml;nde ein komplettes Verzeichnis all dessen,
wof&uuml;r sich die B&uuml;rger im Netz interessieren, was sie online
einkaufen, mit wem sie was chatten oder welche Informationsmedien sie
bevorzugen.</P>

<P>Derartige gesetzliche Regelungen w&uuml;rden das Datenschutzrecht der
B&uuml;rger vollst&auml;ndig aushebeln. Der vom Bundesverfassungsgericht
aufgestellte Grundsatz, dass es keine Vorratsspeicherung zu unbestimmten
Zwecken geben darf, w&uuml;rde ignoriert und in sein Gegenteil verkehrt.
Damit entst&uuml;nde ein &Uuml;berwachungspotenzial, das in dieser Form mit
nichts vergleichbar ist, was bisher in demokratischen Regimen
existiert.</P>

<P>Mittlerweile liegt die Stellungnahme der Bundesregierung zu dem
Gesetzentwurf des Bundesrates vor. Die Bundesregierung &auml;u&szlig;ert
sich darin eher zur&uuml;ckhaltend, lehnt aber eine Speicherpflicht
-jedenfalls f&uuml;r den Bereich Internet - auch nicht vollst&auml;ndig
ab.</P>

<P>Nach dem jetzigen Stand des Gesetzgebungsverfahrens d&uuml;rfte damit zu
rechnen sein, dass vor der Bundestagswahl am 22.09.2002 keine
entscheidenden Ver&auml;nderungen der Rechtslage mehr erfolgen. Die
vorsichtige und nach allen Seiten offene &Auml;u&szlig;erung der
Bundesregierung zeigt aber eines: Nach der Wahl wird es mit ziemlicher
Sicherheit erneute Anl&auml;ufe zu Durchsetzung einer Verpflichtung zur
Vorratsspeicherung geben - unabh&auml;ngig davon, wie der Kanzler dann
hei&szlig;en wird.</P>

<P><B>Links:</B></P>

<P>Gesetzentwurf des Bundesrates in der Beschlussfassung vom 31. Mai
(Bundesratsdrucksache 275/02).: <FONT color=
"#000080"><B>&lt;http://www.dud.de/dud/documents/brdrs-0275-02-020531(besch
luss).pdf&gt;</B></FONT></P>

<P>Stellungnahme der Bundesregierung zu dem Gesetzentwurf des Bundesrates;
Bundestagsdrucksache vom 17.Juli 2002 <FONT color=
"#000080"><B>&lt;http://www.parlamentsspiegel.de/tiffprint/9141028631247.ti
f.pdf&gt;</B></FONT></P>

<P>Weg der Gesetzgebung: <FONT color=
"#000080"><B>&lt;http://www.bundesrat.de/Wissen/Funktion5.html&gt;</B></FONT></P>

<P>Urteilstext des Bundesverfassungsgerichts zur Vorratsdatenspeicherung zu
unbestimmten Zwecken bei der Uni W&uuml;rzburg, Rn. 161: <FONT color=
"#000080"><B>&lt;http://www.uni-wuerzburg.de/dfr/bv065001.html&gt;
</B></FONT></P>
<A href="#top">nach oben</A> <HR>

<P><A name="rk2"></A><FONT size="+1"><B>Gesetzesvorschl&auml;ge</B></FONT></P>

<UL>
<LI>Gesetzentwurf des Bundesrates vom 31.05.2002</LI>

<LI>Stellungnahme der Bundesregierung vom 16.07.2002</LI>
</UL>

<H3><B>Stand des Gesetzgebungsverfahrens</B></H3>

<UL>
<LI>31.05.2002: Beschlussfassung im Bundesrat</LI>

<LI>12.06.2002: Antrag Th&uuml;ringens im Bundesrat</LI>

<LI>21.06.2002: Bundesrat fordert Versch&auml;rfung der
Telekommunikations&uuml;berwachung</LI>
</UL>

<P><B>Gesetzentwurf des Bundesrates vom 31.05.2002</B></P>

<P>Den Entwurf finden wir unter<BR> <FONT color="#000080"><B>
&lt;http://www.dud.de/dud/documents/brdrs-0275-02-020531(beschluss).pdf/&gt;
</B></FONT><BR>

in der Fassung, wie er am 31. Mai vom Plenum des Bundesrats verabschiedet
wurde (Bundesratsdrucksache 275/02).</P>

<P>Bisher wurde an dieser Stelle auf den Beschluss des Rechtsausschusses
des Bundesrates verwiesen. In diesem Papier konnte gut nachvollzogen
werden, dass die Vorschl&auml;ge zur Vorratsdatenspeicherung
nachtr&auml;glich von den L&auml;ndern Bayern und Th&uuml;ringen in den
urspr&uuml;nglich von Niedersaches eingebrachten Entwurf eingef&uuml;gt
wurden. Den Betreibern des Servers www.dud.de, der diese Materialien
vorhielt, wurde nun vom Bundesrat untersagt, den Beschluss des
Rechtsausschusses zu ver&ouml;ffentlichen. Angeblich handele es sich um
eine Unterlage, die als nur f&uuml;r den Dienstgebrauch klassifiziert
worden sei.</P>

<P><B>Stellungnahme der Bundesregierung vom 16.07.2002</B></P>

<P>Wie im Gesetzgebungsverfahren vorgesehen, hat die Bundesregierung den
Entwurf des Bundesrates - versehen mit einer eigenen Stellungnahme - an den
Bundestag weitergeleitet. In der Bundestagsdrucksache <B>14/9801</B> vom
17.07.2002 <FONT color="#000080"><B>
&lt;http://www.parlamentsspiegel.de/tiffprint/9141028631247.tif.pdf&gt;
</B></FONT> ist auch die Stellungnahme der Bundesregierung
nachzulesen.</P>

<P><B>Stand des Gesetzgebungsverfahrens:</B></P>

<P><B>31.05.2002: Beschlussfassung im Bundesrat</B><BR>
Der Entwurf wird nach der Beschlussfassung im Bundesrat am 31.05.2002 der
Bundesregierung vorgelegt. Dies d&uuml;rfte sp&auml;testens im Laufe der
23. Kalenderwoche erfolgt sein. Die Bundesregierung hat ab Eingang des
Entwurfs sechs Wochen Zeit, um eine Stellungnahme dazu zu erarbeiten.
Danach, also voraussichtlich sp&auml;testens innerhalb der 29.
Kalenderwoche, muss der Entwurf dem Bundestag vorgelegt werden. Zum Weg der
Gesetzgebung siehe: <FONT color="#000080"><B>
&lt;http://www.bundesrat.de/Wissen/Funktion5.html&gt; </B></FONT></P>

<P><B>12.06.2002: Antrag Th&uuml;ringens im Bundesrat</B><BR>

Mit einer erneuten Initiative will Th&uuml;rigen eine Entschlie&szlig;ung
des Bundesrates in der Sitzung am 21.06.2002 herbeif&uuml;hren, in der die
Bundesregierung u.a. zur Beschleunigung des Gesetzgebungsverfahrens zur
Vorratsdatenspeicherung aufgefordert wird. Zus&auml;tzlich werden
weitere,<BR>

in dem Entwurf vom 31.05.2002 noch nicht enthaltene Delikte
aufgef&uuml;hrt, auf die die Befugnis zu
Telekommunikationsabh&ouml;rma&szlig;nahmen erstreckt werden soll.
Au&szlig;erdem soll die Auskunftsverpflichtung von Staatsanwaltschaften aus
dem Zentralen Staatsanwaltschaftlichen<BR> Verfahrensregister
gegen&uuml;ber Betroffenen eingeschr&auml;nkt werden.</P>

<P><B>21.06.2002: Bundesrat fordert Versch&auml;rfung der
Telekommunikations&uuml;berwachung</B><BR>
Bei der Beschlussfassung des Bundesrates wurde der Antrag des Landes
Th&uuml;ringen vom 12.06.2002 von der Mehrheit der Bundesl&auml;nder
unterst&uuml;tzt. Der Bundesrat macht sich damit die von Th&uuml;ringen
aufgestellten Vorschl&auml;ge zur z&uuml;gigen Einf&uuml;hrung der
Vorratsdatenspeicherung und zur Versch&auml;rfung der
Telekommunikations&uuml;berwachung zu Eigen. Die Entschliessung ist als
<FONT color="#000080"><B>
&lt;http://www.parlamentsspiegel.de/tiffprint/9141028631247.tif.pdf&gt;
</B></FONT> Bundesratsdrucksache <B>513/02</B> verf&uuml;gbar.</P>

<P><B>16.07.2002: Die Bundesregierung gibt den Gesetzentwurf des
Bundestages - versehen mit einer eigenen Stellungnahme - an den Bundestag
weiter</B></P>

<P>Der Bundestag hat nun &uuml;ber den Antrag zu entscheiden. Der
Gesetzentwurf wird dort als <FONT color="#000080"><B>
&lt;http://www.parlamentsspiegel.de/tiffprint/9141028631247.tif.pdf&gt;
</B></FONT> Drucksache <B>14/9801</B> vom 17.07.2002 gef&uuml;hrt.
Interessant ist die Stellungnahme der Bundesregierung zu den Vorschriften,
mit denen die Speicherpflichten im Bereich der klassischen
Telekommunikation und des Internet eingef&uuml;hrt werden sollen.</P>

<A href="#top">nach oben</A> 
<HR>

<P><A name="rk3"></A><FONT size="+1"><B>Hintergrundinformationen</B></FONT></P>

Zur Bedeutung und zum Hintergrund der vom Bundesrat beschlossenen
Vorratsspeicherung

<P>Im Folgenden soll kurz dargestellt werden, welche Bedeutung die
vorgesehen Speicherpflicht vor dem Hintergrund der tats&auml;chlich
stattfindenden Datenverarbeitung in der Telekommunikation und im Internet
hat, welche Gef&auml;hrdungen sie mit sich bringt und wie sie rechtlich zu
bewerten ist. Au&szlig;erdem wird kurz dargestellt, welche Vorgeschichte
der Gesetzentwurf hat.</P>

<TABLE border="0" width="100%">
<TR>
<TD colspan="4" align="right">
<IMG src="st_rotekarte2.gif" alt="" width="139" height="44" alt="">
</TD>
</TR>

<TR>
<TD valign="TOP"><B><A href="#rk3a">1.</A></B></TD>
<TD>&nbsp;</TD>
<TD>&nbsp;</TD>
<TD valign="TOP"><B><A href="#rk3a">Um welche Daten geht es?</A></B></TD>
</TR>

<TR>
<TD>&nbsp;</TD>
<TD valign="TOP"><A href="#rk3a1">1.1</A></TD>
<TD>&nbsp;</TD>
<TD valign="TOP"><A href="#rk3a1">Verbindungsdaten in der klassischen Telekommunikation</A></TD>
</TR>

<TR>
<TD>&nbsp;</TD>
<TD valign="TOP"><A href="#rk3a2">1.2</A></TD>
<TD>&nbsp;</TD>
<TD valign="TOP"><A href="#rk3a2">Bestandsdaten in der klassischen Telekommunikation</A></TD>
</TR>

<TR>
<TD>&nbsp;</TD>
<TD valign="TOP"><A href="#rk3a3">1.3</A></TD>
<TD>&nbsp;</TD>
<TD valign="TOP"><A href="#rk3a3">Bereits im Gange: Vorratsspeicherung der Bestandsdaten</A></TD>
</TR>

<TR>
<TD>&nbsp;</TD>    
<TD valign="TOP"><A href="#rk3a4">1.4</A></TD>
<TD>&nbsp;</TD>
<TD valign="TOP"><A href="#rk3a4">Nutzungsdaten im Internet</A> </TD>
</TR>

<TR>
<TD>&nbsp;</TD>
<TD valign="TOP"><A href="#rk3a5">1.5</A></TD>
<TD>&nbsp;</TD>
<TD valign="TOP"><A href="#rk3a5">Derzeitige Rechtslage und Umsetzungsdefizite</A></TD>
</TR>

<TR>
<TD>&nbsp;</TD>
<TD valign="TOP"><A href="#rk3a6">1.6</A></TD>
<TD>&nbsp;</TD>
<TD valign="TOP"><A href="#rk3a6">Bestandsdaten im Internet</A></TD>
</TR>

<TR>
<TD valign="TOP"><B><A href="#rk3b">2.</A></B></TD>
<TD>&nbsp;</TD>
<TD>&nbsp;</TD>
<TD valign="TOP"><B><A href="#rk3b">Gefahren der Vorratsspeicherung</A></B></TD>
</TR>

<TR>
<TD valign="TOP"><B><A href="#rk3c">3.</A></B></TD>
<TD>&nbsp;</TD>      
<TD>&nbsp;</TD>
<TD valign="TOP"><B><A href="#rk3c">Verfassungswidrigkeit der Speicherpflicht</A></B></TD>
</TR>

<TR>
<TD valign="TOP"><B><A href="#rk3d">4.</A></B></TD>
<TD>&nbsp;</TD>       
<TD>&nbsp;</TD>       
<TD valign="TOP"><B><A href="#rk3d">Fr&uuml;here Initiativen zur Vorratsspeicherung</A></B> </TD>
</TR>

<TR>
<TD valign="TOP"><B><A href="#rk3e">5.</A></B></TD>
<TD>&nbsp;</TD>      
<TD>&nbsp;</TD>      
<TD valign="TOP"><B><A href="#rk3e">Gesetzentwurf des Bundesrates: Gang der Gesetzgebung</A></B></TD>
</TR>
</TABLE>
<HR>

<P><A name="rk3a"></A><FONT size="+1"><B>Um welche Daten geht
es?</B></FONT></P>

<P>Nach dem Willen der Bundesratsmehrheit soll die Vorratsspeicherung
sowohl im Bereich der "klassischen" Telekommunikation als auch im Bereich
des Internet stattfinden. In beiden Sektoren gibt es zur Zeit klare
Rechtsvorschriften, die Datenerhebung, -speicherung und -verwendung
ausschlie&szlig;lich zu eindeutig definierten Zwecken zulassen. Dazu
z&auml;hlen vor Allem die technische Erbringung der Dienste und die
Abrechnung. Sind die Daten zu diesen Zwecken nicht mehr erforderlich, so
m&uuml;ssen sie gel&ouml;scht werden; f&uuml;r die Abrechnungsdaten gilt
dazu eine Frist von sechs Monaten nach Versendung der Rechnung. F&uuml;r
den Telekommunikationsbereich regelt dies &sect; 89
Telekommunikationsgesetz (TKG; <FONT color="#000080"><B>
&lt;http://jurcom5.juris.de/bundesrecht/tkg/index.html&gt; </B></FONT>);
die Einzelheiten finden sich in der dazu erlassenen
Telekommunikations-Datenschutzverordnung (TDSV; <FONT color="#000080"><B>
&lt;http://jurcom5.juris.de/bundesrecht/tdsv_2000/index.html&gt;
</B></FONT>). F&uuml;r den Bereich Internet und Online-Dienste gelten das
Teledienstedatenschutzgesetz (TDDSG; <FONT color="#000080"><B>
&lt;http://jurcom5.juris.de/bundesrecht/tddsg/index.html&gt;</B></FONT>)
und der Mediendienste-Staatsvertrag (MDStV; <FONT color="#000080"><B>
&lt;http://www.iid.de/iukdg/gesetz/mdstv.html&gt; </B></FONT> ).</P>

<P><A name="rk3a1"></A><FONT size="+1"><B>1.1 Verbindungsdaten in der
klassischen Telekommunikation</B></FONT></P>

<P>In der Praxis werden im Bereich der "klassischen" Telekommunikation
(d.h., Alles, was ausschlie&szlig;lich &uuml;ber die herk&ouml;mmlichen
Kommunikationsleitungen geht sowie die mobile Telefonie) in den meisten
F&auml;llen die Verbindungsdaten bis zu sechs Monaten nach Versendung der
Rechungen aufbewahrt. Zu den Verbindungsdaten geh&ouml;ren nach &sect; 6
Abs. 1 TDSV vor allem Datum und Uhrzeit von Verbindungen, angerufene Nummer
(z.T. gek&uuml;rzt um die letzten drei Ziffern) und die in Anspruch
genommenen Dienste, bei Mobilfunk auch Angaben &uuml;ber die Funkzelle.
Zwar haben die Kunden auch die gesetzliche Option, vom
Telekommunikationsunternehmen zu verlangen, dass ihre Verbindungsdaten nach
Versendung der Rechnung vollst&auml;ndig gel&ouml;scht werden. Da dann aber
die M&ouml;glichkeit wegf&auml;llt, sich gegen eventuelle
&uuml;berh&ouml;hte Rechnungen zu wehren, w&auml;hlen die Wenigsten diese
Variante. Aufgrund dieser Situation liegen im Bereich der "klassischen"
Telekommunikation in der Regel Daten vor, die den
Strafverfolgungsbeh&ouml;rden und sonstigen Sicherheitsbeh&ouml;rden zur
Erf&uuml;llung ihrer gesetzlichen Zwecke grunds&auml;tzlich zur
Verf&uuml;gung stehen. Erforderlich ist dazu in den meisten F&auml;llen ein
entsprechender richterlicher Beschluss.</P>

<P><A name="rk3a2"></A><FONT size="+1"><B>1.2 Bestandsdaten in der
klassischen Telekommunikation</B></FONT></P>

<P>Die Verbindungsdaten n&uuml;tzen den Sicherheitsbeh&ouml;rden allerdings
nur dann etwas, wenn sie einer Nummer oder sonstigen Kennung eine bestimmte
Person zuordnen k&ouml;nnen. Aus diesem Grund wurden die
Telekommunikationsunternehmen schon bei Erlass des TKG im Jahr 1996 dazu
verpflichtet, Verzeichnisse &uuml;ber ihre Kunden und die diesen
zugewiesenen Rufnummern (diese Daten geh&ouml;ren zu den Bestandsdaten) zu
f&uuml;hren. Die Sicherheitsbeh&ouml;rden haben auf diese Verzeichnisse,
die mittlerweile eingerichtet sind, einen online-Zugriff, der &uuml;ber die
Regulierungsbeh&ouml;rde (die Aufsichtsbeh&ouml;rde im Bereich der
Telekommunikation) realisiert wird. F&uuml;r die betroffenen Unternehmen
selbst handelt es sich um eine Black Box, d.h. sie d&uuml;rfen nicht
mitlesen k&ouml;nnen, welche Abfragen der Datenbanken eingehen.</P>

<P><A name="rk3a3"></A><FONT size="+1"><B>1.3 Bereits im Gange:
Vorratsspeicherung der Bestandsdaten</B></FONT></P>

<P>Die entsprechende Vorschrift im TKG betrifft ihrem Wortlaut nach nur
solche Kundendaten, die die Unternehmen f&uuml;r eigene Zwecke ohnehin
speichern w&uuml;rden; also vor allem solche Kunden, die sich dauerhaft
vertraglich binden und die die Leistung erst im Nachhinein zahlen (&sect;
90 TKG). Damit w&auml;ren nicht die Kunden erfasst gewesen, die Handys mit
Prepaid-Karten erwerben, da die Unternehmen hier kein eigenes prim&auml;res
Interesse an der Speicherung haben. Allerdings legte die
Regulierungsbeh&ouml;rde den &sect; 90 TKG von Anfang so aus, dass auch
Prepaid-Handys erfasst wurden, weswegen sich auch die K&auml;ufer dieser
Karten registrieren lassen m&uuml;ssen. Gegen diese Praxis klagten mehrere
Mobilfunkprovider und bekamen vor dem Verwaltungsgericht K&ouml;ln (<FONT
color="#000080"><B>
&lt;http://www.datenschutzzentrum.de/material/themen/presse/urthandy.htm&gt;
</B></FONT>) in erster Instanz Recht. Da damit zu rechnen ist, dass diese
Entscheidung in der zweiten Instanz best&auml;tigt wird, hat die
Bundesregierung ein <FONT color="#000080"><B>
&lt;http://www.bmwi.de/textonly/Homepage/Politikfelder/Telekommunikation&gt;
</B></FONT> gestartet, mit dem &sect; 90 TKG so
ge&auml;ndert werden soll, dass sich die Speicherpflicht
f&uuml;r die Bestandsdaten f&uuml;r alle Telekommunikationsprovider
zweifelsfrei aus dem Gesetz ergibt. Dagegen haben sich die
Datenschutzbeauftragten von Bund und L&auml;ndern in einer
Entschlie&szlig;ung gewandt (<FONT color="#000080"><B>
&lt;http://www.bfd.bund.de/information/DS-Konferenzen/63_64_ent1.html&gt;
</B></FONT>).</P>

<P>Man kann der Auffassung sein, dass diese Verpflichtung, Bestandsdaten
ohne betriebliche Notwendigkeit und nur f&uuml;r Zwecke der
Sicherheitsbeh&ouml;rden zu speichern, der erste S&uuml;ndenfall war, mit
dem eindeutig gegen die Vorgaben des Bundesverfassungsgerichts
versto&szlig;en wurde.</P>

<P><A name="rk3a4"></A><FONT size="+1"><B>1.4 Nutzungsdaten im
Internet</B></FONT></P>

<P>Anders als in der Telekommunikation ist die Datenlage im Internet recht
uneinheitlich. Hier gibt es zahlreiche M&ouml;glichkeiten,
unterschiedlichste Daten &uuml;ber die Nutzer und ihre Aktivit&auml;ten zu
sammeln. Ausgangspunkt ist dabei die IP-Nummer, die technische Grundlage
f&uuml;r die Kommunikation im Internet.</P>

<P>F&uuml;r die Rechner im Internet sind IP-Nummern das, was Telefonnummern
im Bereich der herk&ouml;mmlichen Telefonnetze darstellen: Ohne eine Nummer
l&auml;sst sich kein anderer Rechner adressieren; jeder Rechner
ben&ouml;tigt f&uuml;r die Kommunikation im Internet eine IP-Nummer.
W&auml;hrend die Internet-Server feste IP-Nummern haben, gilt dies f&uuml;r
die allermeisten Nutzer nicht. Wer sich mit einem Online-Dienst oder
&uuml;ber einen sonstigen so genannten Access-Provider mit dem Internet
verbindet, muss keine eigene IP-Nummer mitbringen. Vielmehr bekommt er
diese von seinem Access-Provider f&uuml;r die jeweilige Internet-Session
zur Verf&uuml;gung gestellt. Der Access-Provider verf&uuml;gt &uuml;ber
eine Vielzahl solcher sog. dynamischer IP-Nummern. Diese teilt er jeweils
der Reihe nach den Nutzern zu, die sich neu einw&auml;hlen. Technisch
bedingt kommt es teilweise auch zu einer neuen Vergabe von IP-Adressen
w&auml;hrend eines Zugriffs. Die Nutzer k&ouml;nnen hier also relativ
sicher sein, dass sie mindestens bei jeder neuen Session mit einer anderen
IP-Adresse im Internet aktiv werden. Nur der Access-Provider kann zuordnen,
wer wann mit welcher IP-Nummer im Internet unterwegs war.</P>

<P>Dagegen kann der Betreiber eines anderen Rechners im Web nicht ohne
bestimmte zus&auml;tzliche Identifikationsmittel (wie z.B. Cookies)
identifizieren, welcher Nutzer sich hinter einer bestimmten IP-Nummer
verbirgt. Wer nur die IP-Adresse des Nutzers erf&auml;hrt, kann allenfalls
zuordnen, zu welchem Access-Provider beziehungsweise Online-Dienst diese
geh&ouml;rt.</P>

<P>Neben dieser f&uuml;r die meisten privaten Nutzer typischen
Konstellation gibt es auch eine Vielzahl von Rechnern, die &uuml;ber fest
vergebene IP-Adressen verf&uuml;gen. Zum einen sind dies h&auml;ufig die
Rechner in Universit&auml;ten und Firmen. Hier haben die Organisationen oft
einen gro&szlig;en Bereich von Nummern erworben, die sie den einzelnen zu
ihnen geh&ouml;rigen Rechnern fest zuweisen. Aber auch private Nutzer, die
sehr fr&uuml;h im Internet pr&auml;sent waren, hatten seinerzeit noch gute
Chancen, eine feste IP-Adresse zu bekommen. In diesen F&auml;llen
l&auml;sst sich die IP-Adresse h&auml;ufig auch ohne weitere Hilfsmittel
einem bestimmten Nutzer zuordnen.</P>

<P><A name="rk3a5"></A><FONT size="+1"><B>1.5 Derzeitige Rechtslage und
Umsetzungsdefizite</B></FONT></P>

<P>Das Erheben und Speichern von Nutzungsdaten ist im Internet nur dann
erlaubt, wenn diese Daten technisch erforderlich sind, um den Dienst zu
erbringen, oder wenn sie zu Abrechnungszwecken gebraucht werden (&sect; 6
TDDSG). Dies gilt sowohl f&uuml;r die Access-Provider wie auch f&uuml;r
diejenigen, die Webserver und sonstige Server im Internet betreiben. In den
allermeisten F&auml;llen erfolgt die Abrechnung bei den Access-Providern
nach Zeit oder Datenvolumen. Sie d&uuml;rften daher l&auml;ngerfristig zur
Abrechung allenfalls speichern, von wann bis wann ein Nutzer eingeloggt war
bzw. welches Datenvolumen transferiert wurde. Da die meisten Web-Seiten
nach wie vor kostenlos zur Verf&uuml;gung stehen und eine Abrechnung damit
entf&auml;llt, d&uuml;rfen die Betreiber der Web-Server
regelm&auml;&szlig;ig keine IP-Nummern l&auml;ngerfristig speichern. In der
Praxis wird allerdings nicht selten gegen diese strengen Bestimmungen
versto&szlig;en. An den Webservern wird h&auml;ufig aufgezeichnet, mit
welchen IP-Nummern welche Angebote abgefragt wurden; die Access-Provider
speichern oft f&uuml;r eine gewisse Zeit, welchem Nutzer welche IP-Nummer
zugeordnet war.</P>

<P>Liegen Straftaten vor, so k&ouml;nnen sich die
Strafverfolgungsbeh&ouml;rden bei ihren Ermittlungen auf diese Daten
st&uuml;tzen. In der Regel sto&szlig;en die Ermittler zun&auml;chst auf
eine IP-Adresse, die mit der konkreten Tat in Verbindung gebracht werden
kann. Die Ermittlungsbeh&ouml;rden wenden sich dann mit der ihnen bekannten
IP-Adresse an den Access-Provider, zu dessen Adresspool die Nummer
geh&ouml;rt und bitten um Auskunft dar&uuml;ber, welchem Nutzer diese zum
Nutzungszeitraum, der sich in der Regel auch aus dem Log-Protokoll am
Server ergibt, zugewiesen war. Meistens lassen sich auf diese Weise
entweder bestimmte angemeldete Nutzer identifzieren, oder es ergeben sich
sonstige Anhaltspunkte (wie bei Call-by-Call-Verbindungen Telefonnummern).
Der Zugriff auf Nutzungsdaten setzt einen richterlichen Beschluss
voraus.</P>

<P><A name="rk3a6"></A><FONT size="+1"><B>1.6 Bestandsdaten im
Internet</B></FONT></P>

<P>Selbstverst&auml;ndlich gibt es auch im Internet Bestandsdaten. Zu
denken ist z.B. an die Daten, die ein Access-Provider im Rahmen einer
Vertragsbeziehung mit dem Kunden erhebt. Auf diese d&uuml;rfen die
Sicherheitsbeh&ouml;rden auch im Einzelfall zugreifen. Allerdings besteht
anders als bei der klassischen Telekommunikation f&uuml;r die Provider
nicht die Pflicht, s&auml;mtliche Kunden und die vergebenen Kennungen
f&uuml;r den Online-Abruf durch die Sicherheitsbeh&ouml;rden in einer Datei
zu speichern. Dementsprechend sind sie auch nicht wie die Unternehmen aus
dem Bereich der Telekommunikation verpflichtet, durch Kontrolle der
Ausweise sicherzustellen, dass z.B. beim Einrichten von Webmail-Accounts
die vom Kunden gemachten Angaben zu seiner Identit&auml;t auch
tats&auml;chlich zutreffen.</P>

<P align="right"><A href="#rk3"><IMG src="st_rotekarte2.gif" width="139"
height="44" alt=""></A></P> <HR>

<P><A name="rk3b"></A><FONT size="+1"><B>2. Gefahren der
Vorratsspeicherung</B></FONT></P>

<P>Trotz der im Ergebnis f&uuml;r die Ermittlungsbeh&ouml;rden ohnehin
nicht ung&uuml;nstigen tats&auml;chlichen Lage ist aus Politik und Polizei
der Ruf danach laut geworden, eine Verpflichtung f&uuml;r die
Telekommunikationsunternehmen und Internet-Provider einzuf&uuml;hren,
wonach diese - im genauen Gegensatz zur gegenw&auml;rtigen Rechtslage - die
Daten &uuml;ber die Nutzungen nicht zu l&ouml;schen, sondern zu speichern
h&auml;tten. Dabei ist wohl an eine Mindestspeicherfrist von sechs Monaten
gedacht.</P>

<P>Die vorgesehenen Speicherpflichten w&uuml;rden eine erhebliche
Verschlechterung f&uuml;r die Kunden der Telekommunikation und vor allem
f&uuml;r die Nutzer des Internet mit sich bringen. Die geltenden
Datenschutzvorschriften sollten gerade dem Ziel dienen, die Nutzer davor zu
sch&uuml;tzen, dass ihr gesamtes online-Verhalten transparent und
nachvollziehbar ist. Der Gesetzgeber ist zu Recht davon ausgegangen, dass
es keinen etwas angeht, in welcher Reihenfolge sich ein Nutzer durch die
Angebote von Online-Zeitschriften oder Versandh&auml;user klickt, wann er
welche E-Mails schickt und so weiter. Gerade weil in den digitalen
Informationsmedien anders als in den herk&ouml;mmlichen die technische
M&ouml;glichkeit der &Uuml;berwachung gegeben ist, sollte der Nutzer von
Rechts wegen davor gesch&uuml;tzt werden. Die gesetzlichen Regelungen
f&uuml;r den Bereich Internet sind gerade im vergangenen Jahr in leicht
&uuml;berarbeiteter Form vom Gesetzgeber best&auml;tigt worden. Der
Bundestag hielt damit erkennbar an der Grundidee fest, die Nutzer im
Internet davor zu sch&uuml;tzen, dass ihr gesamtes Informationsund
Kommunikationsverhalten transparent und &uuml;berwachbar wird.</P>

<P>Diese vern&uuml;nftige und letztlich auch verfassungsrechtlich gebotene
Regelung soll nun nach Wunsch der Bundesratsmehrheit in ihr Gegenteil
verkehrt werden. Man ist dort offenbar der Auffassung, dass keine
technische Option zur &Uuml;berwachung ungenutzt bleiben sollte. In der
Praxis w&uuml;rde das wohl bedeuten, dass die Provider dazu verpflichtet
werden, die oben bezeichneten Daten zu speichern.</P>

<P>Durch die Pflicht zur Vorratsspeicherung droht die Gefahr, dass auch die
letzten M&ouml;glichkeiten der anonymen und pseudonymen Nutzung des
Internet, die de facto durch das Fehlen einer Identifizierungspflicht der
Nutzer sowie aufgrund der Angebote von Anonymisierungsdiensten im Internet
noch bestehen, verloren gehen und s&auml;mtliche Online-Bewegungen des
Nutzers von Dritten nachvollzogen werden k&ouml;nnen.</P>

<P>Die Access-Provider sind die Stelle, &uuml;ber die der gesamte
Datenverkehr der Nutzer l&auml;uft. Daher d&uuml;rften sie auch
verpflichtet werden aufzuzeichnen und zu speichern, welche Seiten und
Informationen die einzelnen Nutzer abrufen. Damit entst&uuml;nden dann
staatlich angeordnete Nutzerprofile f&uuml;r jeden Internet-Nutzer. Zwar
sollen diese "nur" "f&uuml;r die Zwecke der Strafverfolgung und der
Gefahrenabwehr und f&uuml;r die Erf&uuml;llung der gesetzlichen Aufgaben
der Verfassungsschutzbeh&ouml;rden des Bundes und der L&auml;nder, des
Bundesnachrichtendienstes, des Milit&auml;rischen Abschirmdienstes sowie
des Zollkriminalamtes" zur Verf&uuml;gung stehen. Es ist jedoch
offensichtlich, dass diese Datensammlungen auch die Begehrlichkeiten von
Unberechtigten wecken d&uuml;rften und damit die Datenschutzrechte der
Nutzer noch weitergehend gef&auml;hrden. Aber auch im Hinblick auf die
Zweckbestimmung f&uuml;r sicherheitsbeh&ouml;rdliche Aufgaben stellt sich
die grunds&auml;tzliche Frage, ob der vorgesehene Aufbau einer
&Uuml;berwachungsinfrastruktur, die in Deutschland bisher ohne Beispiel
ist, noch im Verh&auml;ltnis zur beabsichtigten Erleichterung der Arbeit
der genannten Beh&ouml;rden steht.</P>

<P align="right"><A href="#rk3"><IMG src= "st_rotekarte2.gif" width="139"
height="44" alt=""></A></P> <HR>

<P><A name="rk3c"></A><FONT size="+1"><B>3. Verfassungswidrigkeit der
Speicherpflicht</B></FONT></P>

<P>Aus rechtlicher Sicht d&uuml;rfte das Vorhaben gleich aus mehreren
Gr&uuml;nden verfassungswidrig sein. Zum einen steht es in deutlichem
Gegensatz zum vom Bundesverfassungsgericht im Zusammenhang mit dem
Grundrecht auf informationelle Selbstbestimmung hervorgehobenen Verbot der
Vorratsspeicherung. Dieser im sog. <FONT color="#000080"><B>
&lt;http://www.uni-wuerzburg.de/dfr/bv065001.html&gt;</B></FONT>
<B>Volkz&auml;hlungsurteil</B> aufgestellt Grundsatz besagt, dass es keine
Vorratsspeicherung zu unbestimmten Zwecken geben darf. Er w&uuml;rde durch
die vorgesehene Regelung ignoriert und in sein Gegenteil verkehrt.</P>

<P>Weiterhin ist auch die Verh&auml;ltnism&auml;&szlig;igkeit der
Grundrechtseinschr&auml;nkung mehr als zweifelhaft. Die Vorratsspeicherung
w&uuml;rde einen schwerwiegenden Eingriff in Kommunikationsgrundrechte
einhalten, weil die einzelnen Kommunikationsvorg&auml;nge f&uuml;r
staatliche Zwecke aufgehoben w&uuml;rden und zugleich auch das
Missbrauchsrisiko bei den privaten Daten speichernden Stellen stiege. Im
&Uuml;brigen ist zu erwarten, dass die B&uuml;rger von ihren Grundrechten
auf Zugang zu Informationen und zur freien Meinungs&auml;u&szlig;erung dann
zur&uuml;ckhaltender Gebrauch machen, wenn sie damit rechnen m&uuml;ssen,
bei entsprechenden Aktivit&auml;ten in eine vorsorgliche Protokollierung zu
geraten.</P>

<P>Ein klarer Versto&szlig; gegen Verfassungsrecht ist es
schlie&szlig;lich, dass derartig weitreichende Einschr&auml;nkungen in
einem Gesetz lediglich erw&auml;hnt und dann im Wege der
Verordnungserm&auml;chtigung pauschal in das Belieben der Regierung
gestellt werden. Damit wird gegen eine andere Vorgabe des Grundgesetzes
versto&szlig;en, wonach das Parlament selbst die wesentlichen
Angelegenheiten, zu denen vor allem Grundrechtseinschr&auml;nkungen
geh&ouml;ren, regeln soll.</P>

<P align="right"><A href="#rk3"><IMG src="st_rotekarte2.gif" width="139"
height="44" alt=""></A></P> <HR>

<P><A name="rk3d"></A><FONT size="+1"><B>4. Fr&uuml;here Initiativen zur
Vorratsspeicherung</B></FONT></P>

<P>Bereits anl&auml;sslich der parlamentarischen Diskussion des TKG im Jahr
1996 wurde von Seiten der Sicherheitsbeh&ouml;rden der Ruf nach
Mindestspeicherfristen laut. Ein entsprechender Vorschlag wurde allerdings
vom Bundestag mehrheitlich abgelehnt. Erwartungsgem&auml;&szlig; war das
Thema damit jedoch nicht vom Tisch. Die Konferenz der Innenminister
forderte erneut in einem Beschluss aus dem Jahr 2000, dass
Vorratsspeicherungen zu Pflicht gemacht werden m&uuml;ssten. Dagegen hatten
sich die Datenschutzbeauftragten der L&auml;nder haben sich mit
gro&szlig;er Mehrheit gegen diese Vorhaben gewandt (Pressemitteilung vom
30. November 2000).</P>

<P>Auch der Innen- und Rechtsausschuss des Schleswig-Holsteinischen
Landtages hatte sich im Januar 2001 nachdr&uuml;cklich gegen die
Einf&uuml;hrung einer entsprechenden Speicherverpflichtung f&uuml;r
Internet-Serviceprovider ausgesprochen. Der Innenminister des Landes
Schleswig-Holstein erkl&auml;rte daraufhin allerdings, dass er die Sicht
des Ausschusses nicht teilen k&ouml;nne und wies auf die aus polizeilicher
und aus seiner Sicht erforderliche Notwendigkeit einer derartigen
Datenspeicherung hin.</P>

<P>Im Zuge der Versch&auml;rfung der Eingriffsbefugnisse nach den
Terroranschl&auml;gen in den USA wurden in einem Gesetzentwurf der
L&auml;nder Bayern und Th&uuml;ringen "zur Verbesserung des
strafrechtlichen Instrumentariums" konkrete Vorschl&auml;ge f&uuml;r
Speicherpflichten vorgelegt (BR-Drs. 1014/01; <FONT color="#000080"><B>
&lt;http://www.parlamentsspiegel.de/cgi-bin/hyperdoc/show_dok.pl?k=BBD1014/01&gt;
</B></FONT>). Die von den beiden L&auml;ndern im Bundesrat eingebrachte
Vorlage schlug genau die &Auml;nderungen des TKG und des TDDSG vor, dieser
Gesetzentwurf wurde allerdings am 22.03.2002 mit der seinerzeitigen
Mehrheit im Bundesrat abgelehnt.</P>

<P align="right"><A href="#rk3"><IMG src="st_rotekarte2.gif" width="139"
height="44" alt=""></A></P> <HR>

<P><A name="rk3e"></A><FONT size="+1"><B>5. Gesetzentwurf des Bundesrates:
Gang der Gesetzgebung</B></FONT></P>

<P>Nach der Wahl in Sachsen-Anhalt am 21. April 2002 &auml;nderten sich
bekanntlich die Mehrheitsverh&auml;ltnisse im Bundesrat. Bereits am 27.
M&auml;rz 2002 hatte das Land Niedersachsen den Entwurf eines "Gesetzes zur
Verbesserung der Ermittlungsma&szlig;nahmen wegen des Verdachts sexuellen
Missbrauchs von Kindern und der Vollstreckung freiheitsentziehender
Sanktionen" im Bundesrat eingebracht, der unter Anderem verschiedene
Vorschl&auml;ge zur Versch&auml;rfung der Befugnisse der
Strafverfolgungsbeh&ouml;rden im Bereich &Uuml;berwachung der
Telekommunikation enthielt (BR-Drs. 275/02; <FONT color="#000080"><B>
&lt;http://www.dud.de/dud/documents/brdrs-0275-02-020327.pdf&gt;
</B></FONT> ). Diesen Entwurf benutzten Bayern und Th&uuml;ringen quasi
als Container und erg&auml;nzten ihn mit dem Wortlaut der im M&auml;rz noch
abgelehnten Pflichten zur Vorratsspeicherung. Nachvollziehbar ist dies aus
dem Beschluss des Rechtsausschusses des Bundesrates (<FONT color="#000080"><B>
&lt;http://www.dud.de/dud/documents/ermittlungsg-e-020515.pdf&gt;
</B></FONT>). Nachdem am 31. Mai 2002 das Plenum des Bundesrates
dem Nieders&auml;chsischen Entwurf und den dazu im Rechtsausschuss
angenommenen &Auml;nderungen zugestimmt hat, wurde der Gesetzentwurf
zun&auml;chst der Bundesregierung zur Stellungnahme zugeleitet. Wie im
Gesetzgebungsverfahren vorgesehen, hat die Bundesregierung den Entwurf des
Bundesrates - versehen mit einer eigenen Stellungnahme - am 16.07.2002 an
den Bundestag weitergeleitet (<FONT color="#000080"><B>
&lt;http://www.parlamentsspiegel.de/tiffprint/9141028631247.tif.pdf&gt;
</B></FONT> <B>Bundestags-Drucksache 14/9801 vom 17.07.2002</B>).</P>

<P>Die Bundesregierung &auml;u&szlig;ert sich in ihrer Stellungnahme eher
zur&uuml;ckhaltend. Zwar lehnt sie die &Auml;nderung des
Telekommunikationsgesetzes (Einf&uuml;gen einer
Verordnungserm&auml;chtigung) ab, mit der die Speicherpflicht in der
Telekommunikation umgesetzt werden soll (Art. 3 Nr. 2 des Gesetzentwurfs).
Als Begr&uuml;ndung wird angef&uuml;hrt, dass die Ermittlungsarbeit der
Sicherheitsbeh&ouml;rden mit Regelungen des Datenschutzes, dem
Fernmeldegeheimnis, dem Grundrecht auf informationelle Selbstbestimmung
sowie der Berufsfreiheit in einem nat&uuml;rlichen Spannungsverh&auml;ltnis
stehe. Weiter hei&szlig;t es, die Bundesregierung sei bestrebt,
&bdquo;einen angemessenen Interessenausgleich herbeizuf&uuml;hren, der das
wichtige &ouml;ffentliche Interesse an einer effektiven Strafverfolgung,
insbesondere an einer erfolgreichen und schnellen Aufkl&auml;rung schwerer
Straftaten, mit den Grundrechten der Betroffenen in ein ausgewogenes
Verh&auml;ltnis bringt.&ldquo; Diese Ausf&uuml;hrungen m&uuml;ssen wohl so
verstanden werden, dass eine Zwangsspeicherung im Bereich der
Telekommunikation dieses ausgewogene Verh&auml;ltnis st&ouml;ren w&uuml;rde
und damit als unverh&auml;ltnism&auml;&szlig;ig anzusehen w&auml;re.</P>

<P>Weniger eindeutig f&auml;llt allerdings die Stellungnahme zur
Speicherpflicht im Bereich Internet (Art. 4 des Gesetzentwurfs) aus. Dort
wird zun&auml;chst umfangreich ausgef&uuml;hrt, welche unterschiedlichen
"tats&auml;chlichen und rechtlichen Gegebenheiten" bei der Entscheidung
&uuml;ber die Einf&uuml;hrung einer Speicherpflicht abzuw&auml;gen und in
Einklang zu bringen seien. Dazu z&auml;hlt die Stellungnahme der
Bundesregierung in erster Linie die Grundrechte auf, die durch eine
Speicherpflicht eingeschr&auml;nkt w&uuml;rden. Au&szlig;erdem weist sie
darauf hin, dass der Datenschutz eine wesentliche Voraussetzung f&uuml;r
die Akzeptanz der Dienste der Informationsgesellschaft sei. Die an dieser
Stelle zu erwartende Schlussfolgerung, dass eine Speicherpflicht abzulehnen
sei, bleibt allerdings aus. Statt dessen wird nur ins Feld gef&uuml;hrt,
dass der Entwurf des Bundesrates die f&uuml;r die Einf&uuml;hrung einer
solchen Regelung erforderliche Abw&auml;gung nicht erkennen lasse. Dies
trifft sicherlich zu und wird best&auml;tigt durch die Art und Weise, wie
der Gesetzentwurf im Bundesrat zustande gekommen ist. Allerdings zeigen
diese Ausf&uuml;hrungen auch, dass die Bundesregierung nach einer
entsprechend umfassenden Pr&uuml;fung und Abw&auml;gung eine
Vorratsspeicherpflicht im Bereich Internet nicht f&uuml;r v&ouml;llig
undenkbar h&auml;lt.</P>

<P>Es ist jetzt Sache des Bundestages, &uuml;ber den Entwurf zu befinden.
(<FONT color="#000080"><B>
&lt;http://www.bundesrat.de/Wissen/Funktion5.html&gt;</B></FONT>
<B>Verfahren bei Gesetzentw&uuml;rfen des Bundesrates</B>). An welche
Stellen und Personen Sie sich in Bundesregierung und Bundestag wenden
k&ouml;nnen, erfahrt ihr auf <A href="#rk6">der Aktionsseite</A>.</P>

<P>Nach dem jetzigen Stand des Gesetzgebungsverfahrens d&uuml;rfte damit zu
rechnen sein, dass vor der Bundestagswahl am 22.09.2002 keine
entscheidenden Ver&auml;nderungen der Rechtslage mehr erfolgen. Die
vorsichtige und nach allen Seiten offene Stellungnahme der Bundesregierung
zeigt aber Eines: Nach der Wahl wird es mit ziemlicher Sicherheit erneut
Anl&auml;ufe zur Schaffung einer Rechtspflicht zur Vorratsspeicherung geben
- unabh&auml;ngig davon, wie der Bundeskanzler dann hei&szlig;en wird.</P>
<A href="#top">nach oben</A> <HR>

<P><A name="rk4"></A><FONT size="+1"><B>So k&ouml;nnt ihr euch
wehren</B></FONT></P>

<P>Nachdem der Bundesrat den Gesetzentwurf beschlossen hat, nimmt die
Bundesregierung dazu Stellung. Im Anschluss wird der Entwurf dem Bundestag
zuleitet, der dar&uuml;ber abzustimmen hat (<FONT color="#000080"><B>
&lt;http://www.bundesrat.de/Wissen/Funktion5.html&gt;</B></FONT>).</P>

<P>Teilt der Bundesregierung und den Bundestagsabgeordneten mit, was ihr
von der Vorratsspeicherung haltet!</P>

<P><B>Adressen der BT-Abgeordneten</B><BR>
Rechtsausschuss des BT: <FONT color="#000080"><B>
&lt;http://www.bundestag.de/gremien/a6/index.html&gt;</B></FONT><BR>

Innenausschuss des BT: <FONT color="#000080"><B>
&lt;http://www.bundestag.de/gremien/a4/a4_m.html&gt;</B></FONT></P>

<P><B>Fraktionen SPD-Fraktion</B><BR>
Fraktionsvorsitzender: <FONT color="#000080"><B>
&lt;http://www.bundestag.de/mdbhome/&gt;</B></FONT><BR>

Ausschuss-Arbeitsgruppe Inneres: <FONT color="#000080"><B>
&lt;http://www.spdfrak.de/pa/ag/innen/&gt;</B></FONT><BR>

Ausschuss-Arbeitsgruppe Recht: <FONT color="#000080"><B>
&lt;http://www.spdfrak.de/perl/mdb?id=295&gt;</B></FONT></P>

<P><B>Fraktion B&Uuml;NDNIS90/GR&Uuml;NE</B><BR>
Fraktionsvorsitzende(r): <FONT color="#000080"><B>
&lt;http://www.gruene-fraktion.de/rsvgn/rs_dok/0,,792,00.htm&gt;</B></FONT><BR>

Fachpolitische(r) Sprecher(in) Innenpolitik: <FONT color="#000080"><B>
&lt;http://www.gruene-fraktion.de/rsvgn/rs_dok/0,,795,00.htm&gt;</B></FONT><BR>

Fachpolitische(r) Sprecher(in) Rechtspolitik: <FONT color="#000080"><B>
&lt;http://www.gruene-fraktion.de/rsvgn/rs_dok/0,,766,00.htm&gt;</B></FONT></P>

<P><B>CDU/CSU-Fraktion</B><BR>
Fraktionsvorsitzender: <FONT color="#000080"><B>
&lt;http://www.cducsu.de/abgeordnete/fvs_detail.jsp?ID=86&amp;NavID=5113&gt;</B></FONT><BR>

Arbeitsgruppe Innen: <FONT color="#000080"><B>
&lt;http://www.cducsu.de/themen/arbeitsgruppen_detail.jsp?ID=2&amp;NavID=3300#&gt;
</B></FONT><BR>

Arbeitsgruppe Recht: <FONT color="#000080"><B>
&lt;http://www.cducsu.de/themen/arbeitsgruppen_detail.jsp?ID=1&amp;NavID=3300#&gt;
</B></FONT></P>

<P><B>FDP-Fraktion</B><BR>
Fraktionsvorsitzender: <FONT color="#000080"><B>
&lt;http://mdb.liberale.de/gerhardt/&gt;</B></FONT><BR>

Innenpolitischer Sprecher: <FONT color="#000080"><B>
&lt;http://mdb.liberale.de/stadler/&gt;</B></FONT><BR>

Rechtspolitischer Sprecher: <FONT color="#000080"><B>
&lt;http://mdb.liberale.de/funke/&gt;</B></FONT></P>

<P><B>PDS-Fraktion</B><BR>
Fraktionsvorsitzender: <FONT color="#000080"><B>
&lt;http://www.pds-im-bundestag.de/mdb/singlemdb.php?name=claus&gt;</B></FONT><BR>

Innenpolitische(r) Sprecher(in): <FONT color="#000080"><B>
&lt;http://www.pds-im-bundestag.de/mdb/singlemdb.php?name=jelpke&gt;</B></FONT><BR>

Rechtspolitische(r) Sprecher(in): <FONT color="#000080"><B>
&lt;http://www.pds-im-bundestag.de/mdb/singlemdb.php?name=Kenzler&gt;</B></FONT></P>
<A href="#top">nach oben</A> 
<HR>

<P><A name="rk5"></A><FONT size="+1"><B>DAS k&ouml;nnt ihr
tun!</B></FONT></P>

<P>Sollte der Gesetzentwurf, den der Bundesrat bereits verabschiedet hat,
in Kraft tereten, w&uuml;rden Kommunikationsdaten ohne R&uuml;cksicht auf
deren Inhalt automatisch aufgezeichnet. Sie k&ouml;nnen jedoch ganz
grunds&auml;tzlich daf&uuml;r sorgen, dass <B>Ihre pers&ouml;nlichen
Daten</B> nicht lesbar sind und nicht verwertet werden k&ouml;nnen.
Nachfolgend stellen wir einige Tools vor, mit denen Sie sicher stellen
k&ouml;nnen, dass Ihre Privatsph&auml;re besser gesch&uuml;tzt wird.</P>

<P>Um zu verhindern, dass Beobachter von au&szlig;en erkennen k&ouml;nnen,
welche Internetseiten ihr aufruft, verwendet den <B>Java Anon Proxy -
JAP</B>. (Leider nicht f&uuml;r Amiga!). Diesen betreiben <FONT color=
"#000080"><B>&lt;http://www.datenschutzzentrum.de&gt;</B></FONT> gemeinsam
mit der TU-Dresden im Rahmen eines Projekts, gef&ouml;rdert vom
Bundeswirtschaftsministerium. Nach Installation des Programms werden die
Seitenaufrufe nicht direkt zum Zielserver geschickt, sondern &uuml;ber eine
Reihe von Zwischenstationen. Auf diese Weise ist nur zu erkennen, dass Sie
Daten mit dem Anonymit&auml;tsdienst austauschen. Ob Sie in Wirklichkeit
ein Online-Kaufhaus oder ein politisches Forum besucht haben, bleibt Ihre
<B>Privatsache</B>.</P> <HR>

<P><FONT size="+1"><B>E-Mails ohne Mitleser</B></FONT></P>

<P>Um zu verhindern, dass fremde unsere private E-Mail Korrespondenz
mitlesen k&ouml;nnen, empfehlen die Datensch&uuml;tzer die
<B>Verschl&uuml;sselung</B> mit PGP oder GnuPG. Beide Programme sind
kostenlos aus dem Internet zu beziehen und sch&uuml;tzen die
pers&ouml;nlichen Nachrichten zuverl&auml;ssig.</P>

<P>Ein Verschl&uuml;sselungsverbot wird regelm&auml;&szlig;ig in die
Diskussion gebracht - dabei w&auml;re es vollkommen sinnlos. Es ist ohne
gro&szlig;en Aufwand m&ouml;glich, Nachrichten in ein Tr&auml;germedium
einzubetten, zum Beispiel eine unverf&auml;ngliche Bilddatei. Der
Empf&auml;nger der Grafik kann die Nachricht wieder davon trennen und dann
ggf. entschl&uuml;sseln. Ein Beobachter sieht nur, dass hier eine harmlose
Abbildung verschickt wird. Von einer versteckten Nachricht bekommt er
nichts mit. Die Technik, Nachrichten in andere Tr&auml;ger einzubetten,
bezeichnet man als Steganographie. Auf dem Markt sind hierf&uuml;r
verschiedene Tools erh&auml;ltlich, zum Teil sogar gratis.</P>

<P>Die Zeitschrift c't hat verschiedene Programme zum Einbetten von Texten
in JPG-Grafiken getestet und die Ergebnisse zu einer eigenen <FONT color=
"#000080"><B>&lt;http://www.heise.de/ct/pgpCA/stego.shtml&gt;</B></FONT>
<B>Steganographie-Seite</B> zusammengefasst.</P> <HR>

<P>Die genannten Beispiele zeigen, dass man den Schutz der
Privatsph&auml;re mit einfachen Mitteln realisieren kann. Die
ben&ouml;tigten Tools haben wir f&uuml;r Sie zusammengestellt. Sie sind
frei erh&auml;ltlich und f&uuml;r den pers&ouml;nlichen Gebrauch
gratis.</P>

<P>Lasst euch euer Recht auf ungest&ouml;rte Kommunkation nicht nehmen!</P>

<P>Weitere Infos findet ihr auf der Website <FONT color=
"#000080"><B>&lt;http://www.datenschutzzentrum.de/selbstdatenschutz/&gt;</B
></FONT>.</P> <A href="#top">nach oben</A> <HR>

<P><A name="rk6"></A></P>

<P><A name="rk3e"></A><FONT size="+1"><B>Allgemeine FAQs zur
Informationsfreiheit</B></FONT></P>

<UL>
<LI><A href="#1">Was ist ein
Informationsfreiheitsgesetz?</A></LI>

<LI><A href="#2">Wo gibt es solche Gesetze?</A></LI>

<LI><A href="#3">Was soll damit erreicht werden?</A></LI>

<LI><A href="#4">Wer muss die Informationen herausgeben?</A></LI>

<LI><A href="#5">Bin ich gegen&uuml;ber Verwaltungen in
Bundesl&auml;ndern ohne ein solches Gesetz rechtlos?</A></LI>

<LI><A href="#5a">Wer hat Anspruch auf Informationszugang?</A></LI>

<LI><A href="#5b">Welche Voraussetzungen hat der Anspruch auf Herausgabe
von Informationen</A></LI>

<LI><A href="#6">Was habe ich als B&uuml;rger konkret von diesem neuen
Recht? Gibt es praktische Beispiele?</A></LI>

<LI><A href="#7">Ist der Antrag auf Information zu begr&uuml;nden?</A></LI>

<LI><A href="#8">In welcher Form werden die Informationen zug&auml;nglich
gemacht?</A></LI>

<LI><A href="#8a">Innerhalb welcher Frist m&uuml;ssen die Informationen
zug&auml;nglich gemacht werden?</A></LI>

<LI><A href="#9">Welche Ausk&uuml;nfte d&uuml;rfen verlangt
werden?</A></LI>

<LI><A href="#10">D&uuml;rfen die Beh&ouml;rden auch Informationen
&uuml;ber meine Person an andere herausgeben? Kann ich mich dagegen
sch&uuml;tzen?</A></LI>

<LI><A href="#11">Welche Informationen d&uuml;rfen oder m&uuml;ssen
allgemein verweigert werden?</A></LI>

<LI><A href="#12">Kostet das etwas?</A></LI>

<LI><A href="#13">Was kann ich tun, wenn ich mich individuell beraten
lassen m&ouml;chte bzw. mir Ausk&uuml;nfte verweigert werden?</A></LI>

<LI><A href="#14">Wo finde ich im Internet n&auml;here Informationen zu
diesem Thema?</A></LI>
</UL>
<BR>
<HR>

<A name="1"></A> <B>Was ist ein Informationsfreiheitsgesetz?</B>

<BLOCKQUOTE>
<P>Ein Informationsfreiheitsgesetz gew&auml;hrt den B&uuml;rgern in seinem
Geltungsbereich einen grunds&auml;tzlich freien Zugang zu allen bei den
&ouml;ffentlichen Verwaltungen existierenden Informationen. Es regelt die
entsprechenden Rechte und legt das n&auml;here Verfahren fest, um diesen
freien Zugang zu gew&auml;hren.</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>
<A name="2"></A> <B>Wo gibt es solche Gesetze?</B> 

<BLOCKQUOTE>
<P>In der Bundesrepublik Deutschland gibt es ein solches Gesetz bisher nur
in den L&auml;ndern Brandenburg, Berlin, Schleswig-Holstein und
Nordrhein-Westfalen. Die Bundesregierung hat sich in ihrer
Koalitionsvereinbarung ebenfalls vorgenommen, auf Bundesebene ein solches
Gesetz zu schaffen. F&uuml;r den speziellen Bereich der
Verbraucherinformationen ist zur Zeit ein Gesetzgebungsverfahren in Gange,
das noch indieser Legislaturperiode zum Abschluss gebracht werden soll.
Lediglich f&uuml;r den Bereich der Umweltinformation existiert seit 1994
das inzwischen novellierte Umweltinformationsgesetz des Bundes.<BR> Im
internationalen Vergleich ist die Bundesrebublik Deutschland damit eher ein
Schlusslicht. &Auml;hnliche Gesetze gibt es schon lange in den USA und
Kanada, aber vor allem auch in den meisten europ&auml;ischen L&auml;ndern
(Skandinavien, Frankreich, Spanien, Portugal, Niederlande, Griechenland,
Italien, Belgien, Irland und &Ouml;sterreich sowie in Osteuropa Polen,
Ungarn, Russ. F&ouml;deration und Tschechische Republik).</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>
<A name="3"></A> <B>Was soll damit erreicht werden?</B> 

<BLOCKQUOTE>
<P>Die B&uuml;rger sollen wissen, wie die &ouml;ffentliche Verwaltung
arbeitet, wie dort die Entscheidungen zustande kommen und welche Absichten
und Intentionen dahinter stehen. Auf diese Weise wird die &ouml;ffentliche
Verwaltung transparent und die B&uuml;rger haben bessere
M&ouml;glichkeiten, den politischen Prozess mitzugestalten und die
Entscheidungen zu kontrollieren.</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>

<A name="4"></A> <B>Wer muss die Informationen herausgeben?</B>

<BLOCKQUOTE>
<P>Dem Gesetzeszweck entsprechend richtet sich der Anspruch
grunds&auml;tzlich gegen s&auml;mtliche Stellen der Exekutiven, also gegen
Beh&ouml;rden der Kommunen oder des jeweiligen Landes (oder auch des
Bundes). Ausgenommen sind in der Regel der Landtag als Legislativorgan und
die Organe der Rechtspflege.</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>

<A name="5"></A> <B>Bin ich gegen&uuml;ber Verwaltungen in
Bundesl&auml;ndern ohne ein solches Gesetz rechtlos?</B>

<BLOCKQUOTE>
<P>Einen vergleichbaren allgemeinen Anspruch auf Einsichtnahme in
Beh&ouml;rdenakten gibt es sonst nur im Umweltbereich auf der Grundlage des
Umweltinformationsgesetzes. Im &uuml;brigen ist der Zugang zu den Akten und
Informationen in den Beh&ouml;rden herk&ouml;mmlicherweise an bestimmte
Verfahrensgestaltungen gebunden oder von der Darlegung eines besonderen
Interesses abh&auml;ngig. Akteneinsicht oder Ausk&uuml;nfte werden etwa
dann erteilt, wenn man Beteiligter eines Verfahrens ist, wenn es nur um die
eigenen Daten geht oder wenn man aus wirtschaftlich motivierten
Gr&uuml;nden Ausk&uuml;nfte aus &ouml;ffentlichen Registern wie z.B. das
Grundbuch, die Gewerberegister oder auch das KFZ-Halterverzeichnis der
Stra&szlig;enverkehrsbeh&ouml;rde ben&ouml;tigt. Abgesehen von dem
erw&auml;hnten Umweltinformationsgesetz bestehen Einsichtsrechte, die von
jedermann ohne den Nachweis eines bestimmten Interesses wahrgenommen werden
k&ouml;nnen, nur als Ausnahme (Einsicht in das Handelsregister oder in
einigen L&auml;ndern in Wasserb&uuml;cher).</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>

<A name="5a"></A> <B>Wer hat Anspruch auf Informationszugang?</B>

<BLOCKQUOTE>
<P>Jede nat&uuml;rliche und juristische Person des Privatrechts, also
einzelne B&uuml;rger, aber auch rechtsf&auml;hige Vereine, Gesellschaften
und Stiftungen.</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>

<A name="5b"></A> <B>Welche Voraussetzungen hat der Anspruch auf Herausgabe
von Informationen?</B>

<BLOCKQUOTE>
<P>Keine, au&szlig;er dass Sie einen Antrag stellen. Dies kann
m&uuml;ndlich, schriftlich oder elektronisch geschehen.</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>

<A name="6"></A> <B>Was habe ich als B&uuml;rger konkret von diesem neuen
Recht? Gibt es praktische Beispiele?</B>

<BLOCKQUOTE>
<P>Vielleicht interessieren Sie sich f&uuml;r die Haushaltslage Ihrer
Gemeinde oder f&uuml;r die j&uuml;ngsten Planungsvorhaben in Ihrem Ort.
Oder Sie m&ouml;chten wissen, nach welchen Kriterien der Auftrag zur
Planung und Errichtung eines Schulneubaus vergeben wurde, wie die letzte
B&uuml;rgerversammlung gelaufen ist oder was bei der j&uuml;ngst
durchgef&uuml;hrten Verkehrsz&auml;hlung herausgekommen ist. Oder Sie sind
umgezogen und m&ouml;chten wissen, wie "streng" in der neuen Heimatgemeinde
bestimmte Gesetze oder Verordnungen umgesetzt werden.</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>

<A name="7"></A> <B>Ist der Antrag auf Information zu begr&uuml;nden?</B>

<BLOCKQUOTE>
<P>Nein! Da die Informationsfreiheit gerade darauf aus ist, wirklich Jedem
einen freien Zugang zu Informationen zu erm&ouml;glichen, kann es nicht
darauf ankommen, warum Sie sich f&uuml;r bestimmte Fragen interessieren
oder was Sie in Ihrer Position "damit anfangen k&ouml;nnen".</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>

<A name="8"></A> <B>In welcher Form werden die Informationen
zug&auml;nglich gemacht?</B>

<BLOCKQUOTE>
<P>Ma&szlig;gebend ist grunds&auml;tzlich der Antrag des
Informationssuchenden. In Frage kommen z.B. die Gew&auml;hrung von
Akteneinsicht, die Erteilung von Ausk&uuml;nften oder die Anfertigung von
Kopien.</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>

<A name="8a"></A> <B>Innerhalb welcher Frist m&uuml;ssen die Informationen
zug&auml;nglich gemacht werden?</B>

<BLOCKQUOTE>
<P>Grunds&auml;tzlich innerhalb eines Monats; in bestimmten
Ausnahmef&auml;llen innerhalb von zwei Monaten.</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>
<A name="9"></A> <B>Welche Ausk&uuml;nfte d&uuml;rfen verlangt werden?</B>

<BLOCKQUOTE>
<P>Um den Aufwand bei den Beh&ouml;rden in einem zumutbaren Rahmen zu
halten, ist der Informationsanspruch auf die bei den Beh&ouml;rden
vorhandenen Informationen beschr&auml;nkt. Sind die Informationen
tats&auml;chlich nicht vorhanden, geht der Antrag in's Leere. Es kommt
nicht darauf an, ob die Beh&ouml;rde die Information aufgrund ihrer
Aufgaben eigentlich haben sollte. Es kann auch nicht verlangt werden, dass
die Informationen erst mit viel Aufwand neu zusammengestellt werden.</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>
<A name="10"></A> <B>D&uuml;rfen die Beh&ouml;rden auch Informationen
&uuml;ber meine Person an andere herausgeben? Kann ich mich dagegen
sch&uuml;tzen?</B>

<BLOCKQUOTE>
<P>Der Umgang mit Informationen &uuml;ber einzelne B&uuml;rgerinnen und
B&uuml;rger ist unter Ber&uuml;cksichtigung der datenschutzrechtlichen
Vorgaben festgelegt. Der prinzipielle Schutz dieser Daten kann aber
zur&uuml;cktreten, wenn beispielsweise das Informationsinteresse der
Allgemeinheit oder auch eines Einzelnen f&uuml;r gewichtiger befunden wird.
Bevor aber personenbezogene Daten an einen Dritten herausgegeben werden,
ist der Betroffene hier&uuml;ber auf jeden Fall zu informieren und er
erh&auml;lt Gelegenheit, sich hierzu zu &auml;u&szlig;ern. Werden seine
Daten gegen seinen Willen offenbart und h&auml;lt er dies f&uuml;r
rechtswidrig, kann er dagegen auch juristisch vorgehen.</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>
<A name="11"></A> <B>Welche Informationen d&uuml;rfen oder m&uuml;ssen
allgemein verweigert werden?</B>

<BLOCKQUOTE>
<P>Ausdr&uuml;cklich gesch&uuml;tzt sind in der Regel bestimmte
&ouml;ffentliche und private Belange. So w&auml;re es beispielsweise
gegen&uuml;ber dem &ouml;ffentlichen Interesse nicht zu vertreten, durch
die Offenbarung von Informationen eine wirksame Rechtsdurchsetzung zu
vereiteln oder den beh&ouml;rdlichen Entscheidungsprozess zu
beeintr&auml;chtigen. Als private Belange sind die Betriebs- und
Gesch&auml;ftsgeheimnisse von Unternehmen und personenbezogene Daten
einzelner B&uuml;rger gesch&uuml;tzt.</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>
<A name="12"></A> <B>Kostet das etwas?</B> 

<BLOCKQUOTE>
<P>Ja! Die Erteilung von Ausk&uuml;nften, die Gew&auml;hrung von
Akteneinsicht oder auch die Anfertigung von Kopien kann mit einem
erheblichen Verwaltungs- und Personalaufwand verbunden sein, der den
Beh&ouml;rden und ihren Tr&auml;gern nicht grenzenlos zugemutet wird. Die
bestehenden Informationsgesetze sehen daher die M&ouml;glichkeit vor, in
einem angemessenen Rahmen Verwaltungsgeb&uuml;hren zu erheben und sich
Auslagen erstatten zu lassen.</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>
<A name="13"></A> <B>Was kann ich tun, wenn ich mich individuell beraten
lassen m&ouml;chte bzw. mir Ausk&uuml;nfte verweigert werden?</B>

<BLOCKQUOTE>
<P>Nach den bestehenden Informationsgesetzen der L&auml;nder ist den
jeweiligen Landesbeauftragten f&uuml;r den Datenschutz die Aufgabe
&uuml;bertragen worden, die B&uuml;rger bei der Wahrnehmung ihrer
Informationszugangsrechte zu unterst&uuml;tzen. Sie beraten sowohl die
B&uuml;rger als auch Beh&ouml;rden und fungieren im Streitfall quasi als
au&szlig;ergerichtliche Schiedstelle. Unabh&auml;ngig davon k&ouml;nnen die
B&uuml;rger nat&uuml;rlich auch die ihnen zustehenden Rechtsmittel gegen
beh&ouml;rdliche Entscheidungen einlegen (Widerspruch, Klage zum
Verwaltungsgericht).</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>
<A name="14"></A> <B>Wo finde ich im Internet n&auml;here Informationen zu
diesem Thema?</B>

<BLOCKQUOTE>
<P>Die Texte der bestehenden Gesetze und weitere Materialien zu den
Gesetzen sind auf den Homepages der jeweiligen Landesbeauftragten f&uuml;r
den Datenschutz zu finden oder &uuml;ber das <FONT color="#000080"><B>
&lt;http://www.datenschutz.de&gt;</B></FONT> <B>virtuelle Datenschutzb&uuml;ro
</B>.</P>
</BLOCKQUOTE>
<A href="#rk6">Fragen-Inhalt</A>
<HR>

<P>Anmerkung zum Schluss: Die vorliegenden Fragen sind bewusst sehr
allgemein gehalten; die Antworten gehen ebenso bewusst nicht auf Komplexe
ein, die von Land zu Land anders zu beantworten w&auml;ren.</P>
<A href="#top">nach oben</A> 
<HR>
</TD>
</TR>
</TABLE>

<CENTER>
<TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
summary="">
<TR bgcolor="#88ccff">
<TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
<TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
<TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
</TR>
</TABLE>
</CENTER>
<BR>
</BODY>
</HTML>

