<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Der Schwarzseher</TITLE>
  </HEAD>

  <BODY background="dk_cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>Der grosse
          Tintenstrahl-Workshop</B></FONT></H1>

          <H3 align="center"><FONT color="#ffff00"><B>- Teil 1</B></FONT></H3>

          <P>Hallo und Willkommen in unseren mehrteiligen Drucker-Workshop, indem wir
          uns rund um das Thema der Tintenstrahldrucker k&uuml;mmern werden. Wir
          werden uns mit den Vor- und Nachteilen des Tintendruckes befassen und genau
          auf die unterschiedlichen Verfahren eingehen. In den letzteren Teilen sehen
          wir dann unter die "Motorhaube" der verschiedenen Druckerhersteller.</P>

          <P><B>1. Grundlagen der Tintenstrahltechnologie</B><BR> Im Laufe der
          Tintenstrahltechnik entwickeln die Hersteller auch heute noch zum
          gr&ouml;&szlig;ten Teil auf die alte Technik, welche die Firma Canon im
          Jahre 1981 in einer Weltpremiere der Bubble-Jet-Technologie vorgestellt
          hat. Aufl&ouml;sungen von 1200dpi beherrschen bereits die
          preisg&uuml;nstigsten Tintenstrahldrucker f&uuml;r deutlich unter 100,-
          Euro. Die alte Technologie wurde st&auml;ndig optimiert, so dass mit den
          aktuellen Druckern hochaufl&ouml;sende Fotos gestochen scharf und in
          erstklassiger Qualit&auml;t ausgedruckt werden. Auch der Textdruck erinnert
          l&auml;ngst nicht mehr an die fr&uuml;hen Anfangszeiten. Selbst die
          g&uuml;nstigen Einstiegsdruckermodelle bieten laserscharfen Textdruck. Auch
          die Tinten selbst wurden immer weiter entwickelt. Zun&auml;chst durch
          Pigmentierungen, um brillantere und sehr gut deckende Farben zu
          erm&ouml;glichen. Auch das Verlaufen der Farben wurde gestoppt und die
          bedruckte Seite kommt bereits trocken aus dem Drucker. Gerade in der
          letzten Zeit haben die Tintenentwickler daran gearbeitet, dass die
          Ausdrucke nicht mehr verblassen und zum Teil nun &uuml;ber Jahre ihre
          Farben behalten. Zun&auml;chst war dann vom fotorealistischen Ausdrucken
          die Rede, dann &uuml;ber die Fotoqualit&auml;t bis heute zu echten
          m&ouml;glichen Fotoausdrucken. Auch der Preis der verbrauchten Tinten
          spielt eine gro&szlig;e Rolle. Zuerst brachte Canon seinerzeit mit der
          Single-Ink-Technik ein System heraus, indem jede einezelne Farbe getrennt
          auswechselbar war. Aus Kostengr&uuml;nden verzichtete Canon dann eine Weile
          darauf, bis man sich mittlerweile wieder auf dieses &ouml;konomischere
          Verfahren besann.</P>

          <P><B>2. Viel Druck, aber nur zwei Techniken</B><BR> Im Tintendruckbereich
          gibt es lediglich zwei unterschiedliche Verfahren, um die Tinte auf das
          Papier zu bekommen. Die g&auml;ngiste Technik ist die von Canon entwickelte
          Bubble-Jet-Technik, die eine thermische Technologie unterst&uuml;tzt. Zu
          dieser Technik fand ein Mitarbeiter Canons mehr zuf&auml;llig, als ihm sein
          L&ouml;tkolben herunterfiel und dabei die heisse Spitze auf einen
          F&uuml;llfederhalter fiel. Dadurch wurde ein Tropfen aus dem F&uuml;ller
          geschossen. So war der Weg geebnet zu den meisten heute verkauften
          Tintenstrahlern.</P>

          <P>Das zweite Verfahren ist der piezoelektrische Druck, der lediglich von
          der Firma Epson und einigen wenigen Herstellern verwendet wird.</P>

          <P>Durch zus&auml;tzliche kleine Tricks besonders, um heutigen Fotodruck zu
          erm&ouml;glichen k&ouml;nnen unterschiedliche
          Tr&ouml;pfchengr&ouml;&szlig;en auf das Papier geschleudert werden. Auch
          mehr Farben kommen mittlerweile immer h&auml;ufiger zum Einsatz.</P>

          <P><B>3. Thermischer Tintenstrahldruck</B><BR> Wie schon erw&auml;hnt ist
          das am h&auml;ufigsten verwendete Verfahren aktueller Tintenstrahler der
          thermische Tintenstrahldruck, der zumeist als "Bubble-Jet"-Technologie
          bezeichnet wird. So setzen die Tintendrucker von Hewlett-Packard, Canon und
          Lexmark auf das thermische Tintendruckverfahren. Auch die meisten weniger
          bekannten Hersteller verwenden dieses Verfahren in Ihren Druckern,
          Faxger&auml;ten usw.</P>

          <P>F&uuml;r die schwarze Tinte wird ein Druckkopf aus einer Reihe von bis
          zu vierhundert D&uuml;sen verwendet. Einige Druckermodelle verwenden sogar
          f&uuml;r jede weitere Farbe soviel D&uuml;sen. Jede einzelne Druckd&uuml;se
          ist mit einem Heizelement ausgestattet, dass im Betrieb auf mehrere hundert
          Grad erhitzt werden kann. Dadurch wird die Tinte in einem winzigen
          Bruchteil einer Sekunde erhitzt und es entsteht dadurch ein regelrechte
          Dampfblase, sowie ein &Uuml;berdruck in der Druckd&uuml;se. Dann wird der
          Tintentropfen durch die D&uuml;se auf das Papier geschossen. Heutige
          Druckermodelle schiessen mit Frequenzen von 18KHz und erreichen dabei
          Tropfenzahlen von &uuml;ber sieben Millionen Tintentropfen in jeder Sekunde
          alleine mit den drei Druckfarben. Manches aktuelle Druckermodell wird sogar
          mit zwei Heizelementen ausgestattet, wodurch unterschiedlich gro&szlig;e
          Tr&ouml;pfchengr&ouml;&szlig;en m&ouml;glich sind und das Druckbild noch
          detailreicher wird.</P>

          <P>Die thermische Technik hat einen entscheidenden Nachteil. Durch die
          extremen millionenfachen Temperaturwechsel verschlei&szlig;en die
          thermischen Elemente und m&uuml;ssen nach einiger Zeit ersetzt werden.
          Darum werden meistens mit den Tintenpatronen auch gleich die
          Druckk&ouml;pfe mit ausgewechselt, die dann mit der Farbkartusche eine
          Einheit bilden. Leider sind dadurch die Verbrauchskosten auch h&ouml;her.
          Bei Druckern, wo Druckkopf und Tintentanks getrennt sind, m&uuml;ssen die
          Druckk&ouml;pfe nach einer bestimmten Seitenzahl ausgetauscht werden. Bei
          einigen Druckermodellen werden elektronisch die ausgedruckten Seiten
          gez&auml;hlt und akustisch oder per Software auf einen n&ouml;tigen Wechsel
          hingewiesen.</P>

          <P><B>4. Piezo Tintenstrahldruck</B><BR> Die Firma Epson ging mit ihrer
          Piezo-Technologie den anderen wichtigen Weg der sonst nur noch von sehr
          wenigen Herstellern verwendet wird. In den Druckk&ouml;pfen beim
          piezoelektrischen Tintenstrahldruck werden Piezo-Elemente durch elektrische
          Spannung verformt. Dadurch wird dann der Drucksto&szlig; erzeugt und der
          Tintentropfen wird aus der Druckd&uuml;se geschossen. Die Spannung wird
          wieder ausgeschaltet und das Piezo-Element kehrt in seine Ausgangsform
          zur&uuml;ck.</P>

          <P>Das zweite wichtige Verfahren, das von Epson und wenigen anderen
          Herstellern verwendet wird, ist der piezoelektrischer Tintenstrahldruck.
          Piezo-Elemente sind aus Feuerzeugen bekannt, wo sie durch pl&ouml;tzliche
          Kompression eine hohe Spannung erzeugen, die den Z&uuml;ndfunken ergibt. In
          einem Druckkopf wird das Prinzip umgekehrt. Durch eine angelegte Spannung
          verformt sich das Piezo-Element. Dadurch wird ein Drucksto&szlig; erzeugt,
          der den Tintentropfen aus der D&uuml;se ausst&ouml;&szlig;t. Wird die
          Spannung ausgeschaltet, kehrt das Piezo-Element in seine Ausgangsform
          zur&uuml;ck. Damit nicht weitere kleine Tropfen unkontrolliert aus der
          D&uuml;se heraustreten k&ouml;nnen, wird das Piezo-Element durch negative
          Spannung in die entgegengesetzte Richtung verformt, was die Tinte an der
          D&uuml;sen&ouml;ffnung leicht zur&uuml;ckzieht. Ein Vorteil der
          Piezotechnik liegt darin, dass man durch unterschiedliche Spannungen an den
          Piezo-Elementen auch unterschiedlich gro&szlig;e
          Tr&ouml;pfchengr&ouml;&szlig;en erzeugen kann. Ein Grund daf&uuml;r, warum
          Epson lange Zeit immer einen leichten Vorsprung bei fotorealistischen
          Ausdrucken hatte. Ein weiterer Vorteil ist die eigentlich
          verschlei&szlig;freie Technik der Druckk&ouml;pfe gegen&uuml;ber dem
          thermischen Verfahren. So werden die Druckk&ouml;pfe fest im Drucker
          verbaut und arbeiten dort ein Druckerleben lang. Allerdings hat sich dieser
          Vorteil auch schon manches mal zum Nachteil umgekehrt, wenn dann doch mal
          ein Druckkopf zu fr&uuml;h defekt war, musste der komplette Drucker
          entsorgt werden, w&auml;hrend bei der Konkurrenz lediglich der Druckkopf
          ausgetauscht werden konnte. Auch die Schussfrequenzen liegen bei der
          Piezotechnologie mit 20 bis 30 KHz h&ouml;her, als beim thermischen
          Verfahren.</P>

          <P>Verpasst nicht den n&auml;chsten Teil, idem wir uns mit der
          Aufl&ouml;sung und anderen Feinheiten befassen werden.</P>

          <P>Allseits guten Druck w&uuml;nscht Euch<BR>
          Euer HIGGINS<BR>
          Cord Hagen</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

