<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
				<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
					<br>
				</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Internet-yhteyden jakaminen MiamiDx:ll&auml;</b></font></td>
				</tr>
				<tr height="15">
					<p>
						<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><a href="http://www.saunalahti.fi/halmej/" target="_blank">Joni Halme</a> &lt;<a href="mailto:halmej@saunalahti.fi">halmej@saunalahti.fi</a>&gt;</font></td>
					</p>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">T&auml;m&auml; juttu on kirjoitettu Assembly 2001 -tapahtumassa suoraan lennosta. Ajan puutteen takia en laita t&auml;h&auml;n tarkkoja ohjeita yhteyden luomiseen, vaan k&auml;yn l&auml;pi t&auml;rkeimm&auml;t p&auml;&auml;piirteet ja liit&auml;n mukaan <a href="MiamiDx.reititin">asetustiedoston</a>, jota voitte k&auml;ytt&auml;&auml;.</font></p>
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Min&auml;kin p&auml;&auml;tin t&auml;n&auml; vuonna ottaa projektiksi l&auml;hte&auml; Assembly-tapahtumaan. Koneet hyv&auml;&auml;n pakettiin, ja serkun kanssa 400 kilometrin reissulle Helsinkiin. Kun sitten viimein saimme koneemme kuljetettua Hartwall-areenalle ja kaiken piti olla kunnossa, ei verkkokortti suostunutkaan toimimaan. Testasin kolmea eri verkkokorttia tuloksetta - ei partyverkkoa minulle. Olimme kuitenkin ottaneet mukaan nollakaapelin, ja keksimme niinkin hullun idean kuin jakaa toisen Amigan Internet-yhteys kyseisen kaapelin avulla.</font></p>
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ohjelmistona k&auml;ytimme Miami Deluxea. Emme ole koskaan kokeilleetkaan mit&auml;&auml;n t&auml;m&auml;n tyylist&auml;, ja koko homma oli melkoista hakuammuntaa. MiamiDx:ss&auml; voit luoda useita yhteyksi&auml;, toisin kuin vanhemmilla Miamin versioilla. Loimme serkun Amigaan kaksi yhteytt&auml;: Ethernet-yhteys partyverkkoon ja nollakaapeliyhteys minun koneeseeni. Miami pit&auml;&auml; my&ouml;s muistaa konfiguroida toimimaan reitittimen&auml; (router). Minun koneeseeni taas luotiin vain nollakaapeliyhteys reitittimeen. Miamin konfiguroiminen on todella ik&auml;v&auml;&auml; touhua, varsinkin ellet ole koskaan tehnyt mit&auml;&auml;n vastaavaa. Laitoimme asetukset suurimmaksi osaksi oletusten pohjalta, ja sitten vain muuttelimme asetuksia yksitellen, kunnes osuimme oikeaan. Seuraavat neuvot ovat ne joilla me saimme yhteyden toimimaan. Voi hyvin olla, ett&auml; olisi olemassa helpompi tai parempikin tapa, mutta alla oleva toimii, ja sill&auml; selv&auml;.</font></p>
						<div align="center">
							<p><img src="kuvat/verkko_1.gif" width="282" height="142" border="0" alt=" "></p>
							<p><img src="kuvat/verkko_2.gif" width="367" height="140" border="0"></p>
						</div>
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Homma alkoi siit&auml;, ett&auml; loimme reitittimen&auml; toimivan Amigan MiamiDx:n Ethernet-yhteyden verkkoon. T&auml;m&auml; k&auml;vi t&ouml;rke&auml;n helposti. Loimme ensin uuden laitteistom&auml;&auml;rityksen eli hardwaren, tyyppi Ethernet, MNI-ajuri X-Surf-kortille jne. Sitten loimme uuden Interfacen, tyyppi Ethernet, yhteys LAN, hardware oli x-surf, DHCP IP:t jne. Kone oli verkossa alta aikayksik&ouml;n. Sitten loimme toisen hardwaren. Tyyppi oli Serial, Miamin sarja-ajuri, nopeus 115200. Muista ruksata kohta &quot;Use CD&quot; ja &quot;Modem Settings&quot; -sivulta kohta &quot;Null modem&quot;.</font></p>
						<div align="center">
							<p><img src="kuvat/verkko_4.gif" width="358" height="186" border="0"></p>
						</div>
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Nollakaapelia varten pit&auml;&auml; luoda my&ouml;s Dialer. Poista &quot;Dial script&quot; -kent&auml;st&auml; kaikki kohdat ja anna nimeksi esim. Nolla tai null. Viel&auml; pit&auml;&auml; luoda interface nollakaapelia varten. Tyyppi on &quot;(C)SLIP dial-out&quot;. Reitittimen&auml; toimiva Amiga ruksaa kohdan LAN. Hardwareksi valitaan nollakaapeli ja dialeriksi nolla. Laita IP-tyypiksi Static ja osoitteeksi 192.168.0.1. T&auml;m&auml; on reitittimen IP-osoite. Jos haluat tiet&auml;&auml; lis&auml;&auml; IP-osoitteiden sielunel&auml;m&auml;st&auml;, niin voit lukea niist&auml; Miamin oppaista. Vaikka valitsetkin itse IP:n, se ei saa olla mik&auml; tahansa. Gateway:n tyypiksi laita static ja osoitteeksi sen koneen IP, jonka kanssa haluat yhteyden jakaa. Vaikka 192.168.2.1. Reitittimen on laitettava gatewayn prioriteetiksi 0.</font></p>
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Mene seuraavaksi Database-sivulle ja valitse &quot;hosts&quot;. Lis&auml;&auml; uusi host, jonka osoitteeksi laita 127.0.0.1 ja nimeksi Localhost. Lis&auml;&auml; viel&auml; toinenkin, laita osoitteeksi 192.168.2.1 ja nimeksi computer2. Mene TCP/IP-sivulle ja ruksaa kohdat &quot;Gateway&quot; ja &quot;T/TCP&quot;. Klikkaa &quot;LAN-Connect&quot;. Interfaces-kent&auml;ss&auml; molemmissa yhteyksiss&auml; pit&auml;isi lukea LAN. Jos ei, niin korjaa asia. Klikkaa kohdasta &quot;SocksD Enable&quot;. T&auml;m&auml;n pit&auml;isi riitt&auml;&auml; yhteyden jakamiseen, mutta voit my&ouml;s kokeilla IP-NAT:ia. Nyt reitittimen pit&auml;isi olla valmis. Seuraavaksi toisen koneen kimppuun.</font></p>
						<div align="center">
							<p><img src="kuvat/verkko_3.gif" width="172" height="106" border="0"></p>
							<p><img src="kuvat/verkko_5.gif" width="215" height="170" border="0" alt=" "></p>
						</div>
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Toiseen koneeseen pit&auml;&auml; my&ouml;s luoda hardware-sivulle nollakaapeli ja dialer-sivulle nolla, samalla tavalla kuten reititinkoneeseenkin. Interfacen luominen on sitten hieman erilainen. Valitse tyypiksi &quot;(C)SLIP dial-out&quot; ja valitse kohta &quot;Internet&quot;. IP:n tyyppi on static ja osoitteeksi laita 192.168.2.1, gateway:n tyypiksi static ja osoitteeksi reitittimen osoite eli t&auml;ss&auml; tapauksessa 192.168.0.1, ja muista nostaa &quot;Pri&quot; nollaa isompaan arvoon. Klikkaa &quot;TCP/IP settings&quot; ja ruksaa kohta &quot;Use ICMP&quot;. Vaihda &quot;Get dynamic DNS servers&quot; kohtaan &quot;verify&amp;add&quot;. Seuraavaksi siirry Database-sivulle ja kohtaan &quot;hosts&quot;. Luo kaksi uutta is&auml;nt&auml;&auml;: computer1 192.168.0.1 ja Localhost 127.0.0.0. Mene kohtaan &quot;DNS servers&quot;.</font></p>
						<div align="center">
							<p><img src="kuvat/verkko_6.gif" width="374" height="189" border="0"></p>
							<p><img src="kuvat/verkko_7.gif" width="373" height="142" border="0" alt=" "></p>
						</div>
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">T&auml;m&auml; onkin mielenkiintoista. Assemblyn partyverkko antoi nimipalvelimet dynaamisesti. Kun yritin k&auml;ske&auml; Miamin etsi&auml; dynaamisia nimipalvelimia, sain vastaukseksi virheilmoituksen, joten katsoin osoitteen reititinkoneen &quot;DNS servers&quot; -sivulta. Reititinkoneessa pit&auml;&auml; olla verkko auki. Lis&auml;&auml; koneelle reititinkoneelta l&ouml;ytyv&auml; nimipalvelin. Mene TCP/IP-sivulle, kirjoita &quot;Default host name&quot; -kentt&auml;&auml;n computer2. Ruksaa kohta &quot;T/TCP&quot;. Klikkaa &quot;LAN-Connect&quot;. Varmista, ett&auml; yhteyden kohdalla lukee &quot;Internet&quot;. Ruksaa kohta &quot;SocksD enable&quot;. Mene Socks-sivulle. Ruksaa kohta &quot;Enable SOCKS&quot; ja poista ruksi kohdasta &quot;Allow DNS forwarding&quot;. Kirjoita SOCKS-serveriksi reititinkoneen osoite eli 192.168.0.1. Nyt asetusten pit&auml;isi olla kunnossa. Huom.: pit&auml;isi. Konfiguroidessamme kahta Miamia pime&auml;ss&auml; hallissa iltamy&ouml;h&auml;ll&auml; alkoi keskittyminen olla heikkoa. Onneksi paikan p&auml;&auml;ll&auml; oli T&ouml;yryl&auml;n Harri antamassa hyvi&auml; neuvoja. Terveisi&auml; h&auml;nelle.</font></p>
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Nyt kun reititinkoneella on verkko- ja nollakaapeliyhteydet auki ja omalla koneella nollakaapeliyhteys auki, niin p&auml;&auml;sen omalta koneeltani verkkoon. Siirtonopeus on reilu 9 kt/s. Miinusta oli, ett&auml; IRC saattoi olla auki vain toisella koneella kerrallaan, ja kun reititinkone kaatui, my&ouml;s toisen koneen netti j&auml;m&auml;hti - tietenkin se tosiasia, ett&auml; olin 1 gigabitin verkossa SARJAPORTIN kautta. N&auml;it&auml; asetuksia on helppo soveltaa esim. useampaan verkkokortilla varustettuun Amigaan, kytkimiin, hubeihin jne. Lis&auml;&auml; hyvi&auml; ohjeita l&ouml;yd&auml;t Miamin manuaaleista.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>