<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Sakunetin et&auml;luku nyt my&ouml;s e-mailitse</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Esa Heikkinen &lt;<a href="mailto:picard@sci.fi">picard@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vaikka nyky&auml;&auml;n Internet- ja webbipohjaiset keskustelufoorumit ovat suosittuja, on vanha kunnon Sakunet yh&auml; elossa. Oikeastaan kummallakin on omat k&auml;ytt&auml;j&auml;kuntansa, netiss&auml; py&ouml;riv&auml;t sopivat niille, joilla on kiinte&auml; Internet-yhteys ja rajattomasti aikaa kirjoitella viestej&auml; on-line. Sakunet taasen sopii my&ouml;s sellaisille, joilla kiinte&auml;&auml; yhteytt&auml; ei ole.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Historia toistaa itse&auml;&auml;n. Esimerkiksi webbifoorumeissa on palattu takaisin siihen aikaan, kun BBS-j&auml;rjestelmiss&auml; eli bokseissa ei viel&auml; ollut et&auml;lukutukea. Kaikki viestit piti kirjoittaa linjalla, ja siten laajempi keskustelu oli k&auml;yt&auml;nn&ouml;ss&auml; mahdotonta kalliiden yhteyskustannusten my&ouml;t&auml;. Webbifoorumeissa on t&auml;m&auml; sama vika, mutta sill&auml; erolla, ett&auml; nyky&auml;&auml;n joillakin on etuoikeutettu asema rajattomaan netin k&auml;ytt&ouml;&ouml;n; ongelma ei ole yht&auml; paha kuin boksiaikaan - t&auml;ll&ouml;inh&auml;n etuoikeutettuja olivat ne, jotka asuivat l&auml;hipuhelualueella suhteessa k&auml;ytt&auml;m&auml;&auml;ns&auml; boksiin. Boksiaikaan eriarvoisuutta tasoitti se, ett&auml; boksien v&auml;lille syntyi viestiverkkoja, jotka tarjosivat yh&auml; useammalle mahdollisuuden lukea viestej&auml; ppm-alueella sijaitsevasta boksista.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Et&auml;luentaa</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Viestien lukeminen linjalla ei ole kuitenkaan ainoastaan k&auml;ytt&auml;j&auml;n ongelma, vaan my&ouml;s boksin. Suurin osa bokseistahan oli yksityisesti harrastajavoimin yll&auml;pidettyj&auml;, ja ne toimivat vain esimerkiksi osan vuorokautta &ouml;isin. Lis&auml;ksi kun lankaliittym&auml;t olivat (ja ovat yh&auml;) kalliita, ei boksille voitu yleens&auml; varata kuin yksi linja. N&auml;in ollen boksissa oli mahdollista olla vain yhden k&auml;ytt&auml;j&auml;n kerrallaan. Jos t&auml;m&auml; k&auml;ytt&auml;j&auml; varasi linjan pitk&auml;ksi aikaa esimerkiksi viestien lukemista varten, saivat muut k&auml;ytt&auml;j&auml;t jonotella vuoroaan (tuut-tuut-tuut... BUSY). Viestien lukemisen osalta t&auml;m&auml;n ongelman korjasi varsin varhaisessa vaiheessa kehitelty tapa lukea viestit off-line eli et&auml;lukuna.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Homma toimii siten, ett&auml; k&auml;ytt&auml;j&auml; soittaa boksiin ja k&auml;ynnist&auml;&auml; toiminnon, joka kokoaa edellisen kerran j&auml;lkeen tulleet uudet viestit k&auml;ytt&auml;j&auml;n valitsemilta alueilta ja tekee niist&auml; paketin imuroitavaksi. Kun paketti on siirretty, on homma selv&auml; ja yhteyden boksiin voi katkaista. T&auml;m&auml;n j&auml;lkeen k&auml;ytt&auml;j&auml; lataa omalla tietokoneellaan et&auml;lukuohjelman (offline reader) ja avaa paketin. Lopputuloksena h&auml;n voi lukea viestej&auml; rauhassa, ilman kallista linjalla oleilua ja k&auml;yt&ouml;ss&auml; on l&auml;hes samat toiminnot kuin boksissakin. Kun k&auml;ytt&auml;j&auml; haluaa kommentoida keskustelua tai l&auml;hett&auml;&auml; uusia viestej&auml;, h&auml;n kirjoittaa ne samaan tapaan kuin boksissakin, mutta k&auml;ytt&auml;en esimerkiksi mieleist&auml;&auml;n tekstieditoria omalla koneellaan. Kun kaikki viestit on k&auml;yty l&auml;pi ja vastaukset ja uudet viestit kirjoitettu, suljetaan istunto, jolloin syntyy vastauspaketti. Kun k&auml;ytt&auml;j&auml; seuraavan kerran k&auml;y boksissa, h&auml;n l&auml;hett&auml;&auml; vastauspaketin boksiin siihen varattua toimintoa k&auml;ytt&auml;en, ja lopputuloksena h&auml;nen kirjoittamansa viestit tallentuvat boksiin aivan kuin ne olisi kirjoitettu linjalla.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">N&auml;in Internet-aikaan t&auml;m&auml;nkaltainen et&auml;luku onnistuu joillakin postituslistoilla, jotka perustuvat s&auml;hk&ouml;postiosoitteiden k&auml;ytt&ouml;&ouml;n. Listalle kirjoitettavat viestit l&auml;hetet&auml;&auml;n tiettyyn osoitteeseen, jossa toimiva kone l&auml;hett&auml;&auml; ne edelleen kaikille listalle ilmoittautuneille. Homma toimii hienosti, eik&auml; tarvita kiinte&auml;&auml; yhteytt&auml;. Lis&auml;ksi Internet tarjoaa news-alueet, joita voi lukea mainiosti ilman kiinte&auml;&auml; liittym&auml;&auml;kin. K&auml;ytt&auml;jien m&auml;&auml;r&auml; on valtaisa, alueita l&ouml;ytyy kaikilta el&auml;m&auml;n aloilta ja itse asiassa systeemi on l&auml;hes t&auml;ydellinen.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kolikon k&auml;&auml;nt&ouml;puoli on kuitenkin se, ett&auml; suureen joukkoon mahtuu my&ouml;s ei-toivottuja lukijoita, jotka eiv&auml;t itse asiassa lue viestej&auml; ollenkaan, vaan ker&auml;&auml;v&auml;t ihmisten s&auml;hk&ouml;postiosoitteita. Osoitteista kootaan valtaisa tiedosto, jota myyd&auml;&auml;n CD-ROMilla ymp&auml;ri maailmaa. Osoitteet joutuvat ennen pitk&auml;&auml; markkinavoimien k&auml;siin, ja sen j&auml;lkeen postilaatikkoon sataa mainoksia (roskapostia, sp&auml;mmi&auml;) ymp&auml;ri maailmaa. S&auml;hk&ouml;postiosoite on saastunut, eik&auml; asialle ole teht&auml;viss&auml; en&auml;&auml; mit&auml;&auml;n. Riitt&auml;&auml;, ett&auml; kirjoittaa yhden kerran viestin jollekin news-alueelle, ja jonkin ajan kuluttua postilaatikkoon tulee useita roskaviestej&auml; joka p&auml;iv&auml;. Suuri ja avoin systeemi ei siis olekaan aktiivisen keskustelijan taivas. Toinen ongelma, jonka suuruus tuo tullessaan on viestien m&auml;&auml;r&auml; - news-alueiden keskusteluissa on todella ty&ouml;l&auml;st&auml; pysy&auml; mukana, vaikka seuraisikin vain muutamaa aluetta.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Mit&auml; kuuluu Sakunetille?</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Olen kertoillut Sakunetin syntyhetkist&auml; aiemmin mm. Sakussa #11 (<a href="ftp://ftp.funet.fi/pub/amiga/misc/diskmags/Finnish/Saku/SAKU11.lha" target="_blank">levykeversio</a> 380 kt, <a href="ftp://ftp.funet.fi/pub/amiga/misc/diskmags/Finnish/Saku/SAKU11.aguide.lha" target="_blank">AmigaGuide-versio</a> 280 kt) ja sen my&ouml;hemmist&auml; vaiheista <a href="http://batman.jypoly.fi/~saku/lehti/online/18/index.html" target="_top">numerossa #18</a>, joten jos lukijoiden joukossa on uusia harrastajia, joille koko k&auml;site on tuntematon, kannattaa tutustua. Lyhyen&auml; kertauksena voin t&auml;ss&auml; todeta, ett&auml; kyse on boksien v&auml;lisest&auml; viestiverkosta, joka on perustettu 6.1.1995, aikana jolloin Internet oli kaikkea muuta kuin kokoelma pelkki&auml; v&auml;rikk&auml;it&auml; mainoksia sis&auml;ll&auml;&auml;npit&auml;v&auml; kokoelma webbisivuja.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Sakunet perustettiin palvelemaan p&auml;&auml;osin Amigan k&auml;ytt&auml;ji&auml; sek&auml; yhdistyst&auml;, mutta se on samalla my&ouml;s keskustelupaikka varsin laajalle aihepiirille - k&auml;yt&auml;nn&ouml;ss&auml; keskustelu kaikenlaisista asioista on mahdollista. My&ouml;hemmin totesinkin, ett&auml; t&auml;m&auml; mahdollisuus kaikenlaiseen keskusteluun pit&auml;&auml; koko verkon hengiss&auml;, mit&auml; pelk&auml;st&auml;&auml;n Amiga-aiheinen keskustelu ei riit&auml; tekem&auml;&auml;n. Verkko on palvellut k&auml;ytt&auml;ji&auml;&auml;n varsin mukavasti, sill&auml; sen kautta on t&auml;t&auml; nyky&auml; l&auml;hetetty yli 82000 viesti&auml;. Sakunet k&auml;sitt&auml;&auml; seuraavat keskustelualueet (vai pit&auml;isik&ouml; nyky&auml;&auml;n puhua foorumeista?):</font></p>
						<table border="0" cellpadding="0" cellspacing="0">
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Amiga</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amiga yleinen</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Amiga/Uutiset</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amiga uutiset/uutuudet</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.BBS</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Boksit ja boksin pito</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Boksilistat</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Boksilistat</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Elektroniikka</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Elektroniikka; harrastus/rakentelu yms.</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Hifi</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Hifi, kotiteatteri yms.</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Huuhaa</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Aihe on vapaa</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Info</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tiedotuskanava (K&Auml;YTT&Auml;JILLE READ ONLY)</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Internet</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Internet-aiheinen keskustelu</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Ilmoitukset</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ilmoitukset</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Boksimainokset</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Boksimainokset</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Markkinat</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Myynti/ostoilmoitukset</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Musiikki</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Musiikin harrastaminen</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Muut</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Muut aiheet</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Netti</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Verkkoa koskeva keskustelu</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Ohjelmointi</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ohjelmointikeskutelu</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.PC</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">PC-keskustelu</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Pelit</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Pelit ja pelaaminen</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Rajatiede</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Rajatiede/mystiikka</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Roolipelit</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Roolipelit</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Saku</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku yleinen</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Saku/Info</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Sakun tiedotuskanava</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Saku/Ohjelmointi&nbsp;&nbsp;</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Sakun ohjelmointi</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Saku/Toimitus</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Sakun toimitusasiat</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Saku/Yhdistys</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yhdistyksen ilmoituskanava</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.SciFi</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Science-fiction keskustelu</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Software</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Softailmoittelu</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Teeseitse</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tee-se-itse remonttireiskat</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Tietokoneet</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Muut koneet ja oheislaitteet</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Tietoliikenne</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tietoliikennekeskustelu</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.TV/Elokuvat</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">TV/Video/Satelliitti/Elokuvat</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Urheilu</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Urheiluaiheinen keskustelu</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.UU-Code</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">UU-koodatut tiedostot alle 32kB</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AZ.Vitsit</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vitsit</font></td>
							</tr>
						</table>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Keskustelun aiheet pyrit&auml;&auml;n jakamaan niille kuuluville alueille, mutta mit&auml;&auml;n tiukkoja s&auml;&auml;nt&ouml;j&auml; ei ole, joten lipsahdukset ja asian vierest&auml; kirjoittaminen eiv&auml;t ole rangaistavaa. Arvatenkin alue AZ.Huuhaa on suosituin, koska siell&auml; aihe on t&auml;ysin vapaa ja keskustelut juontuvat ajan kanssa mukavasti yhdest&auml; aiheesta t&auml;ysin toiseen ja niin edesp&auml;in.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Sakunet oli varsin suosittu kultavuosinaan, uusia viestej&auml; liikkui joka p&auml;iv&auml; toista sataa. Jos halusi pysy&auml; mukana keskustelussa ja seurasi kaikkia viestialueita, vaati homma jo toisinaan ponnisteluja lukijaltakin. Boksien kuollessa on my&ouml;s Sakunetiss&auml; mukana olevien boksien lista kuihtunut tasaisen tappavaan tahtiin, mutta t&auml;st&auml;kin huolimatta verkko el&auml;&auml;. Viime aikoina tahti on ollut luokkaa toistasataa uutta viesti&auml; viikossa, ja ainakin nyt kes&auml;lomien aikaan on ollut jopa l&auml;hemm&auml;s kolmisensataa uutta viesti&auml; per viikko. Keskustelu py&ouml;rii kuitenkin varsin pieness&auml; piiriss&auml;, mukana on muutama hyperaktiivinen viestien kirjoittaja. Pieni porukka tuo kuitenkin keskusteluun mukavan sis&auml;piiritunnelman, jota ei l&ouml;ydy Internetin suurista foorumeista. Silti mukaan mahtuu rajattomasti lukijoita, ja keskustelutaitoiset henkil&ouml;t olisivat ilman muuta enemm&auml;n kuin tervetulleita.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Er&auml;&auml;n&auml; syyn&auml; v&auml;hentyneeseen lukijakuntaan saattaa olla, ettei kaikilla ole modeemia ja siten mahdollisuutta p&auml;&auml;st&auml; soittamaan bokseihin. Toinen syy on sitten tietenkin se, ettei ole liiemmin boksejakaan, johon soittaa... No, ainakin saamani palautteen mukaan on olemassa k&auml;ytt&auml;ji&auml;, joita Sakunet kiinnostaisi, mutta lukeminen on modeemittomuuden vuoksi ollut mahdotonta. Sitten on toki suuri joukko uudehkoja harrastajia, jotka ovat tulleet mukaan hyvin &auml;skett&auml;in. He eiv&auml;t ole mahdollisesti koskaan kuulleetkaan bokseista ja niiden v&auml;lisist&auml; viestiverkoista...</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Miten mukaan?</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Parhaiten mukaan p&auml;&auml;see tietenkin perinteiseen malliin, soittamalla esimerkiksi johonkin seuraavista bokseista...</font></p>
						<table border="0" cellpadding="0" cellspacing="0">
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Boksi</b></font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Avoinna&nbsp;</b>&nbsp;</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Numero(t)</b></font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Sysop</b></font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amiga Zone</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">24h</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">017-611015 (Modeemi)&nbsp;&nbsp;</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Esa Heikkinen</font></td>
							</tr>
							<tr>
								<td></td>
								<td></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">017-611014 (ISDN)</font></td>
								<td></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">G-Point</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">24h</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">03-2258579</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Esa Lyttinen</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">The Black Force&nbsp;&nbsp;</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">24h</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">02-6469525</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Hannu Johansson</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Giga-Box</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">24h</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">09-4557486</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kimmo Mustonen</font></td>
							</tr>
						</table>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amiga Zone lienee bokseihin tottumattomalle helppok&auml;ytt&ouml;isin (ainakin helppok&auml;ytt&ouml;isyyden eteen olen tehnyt paljon ohjelmointity&ouml;t&auml;). The Black Forcesta taasen l&ouml;ytyy runsaasti muitakin viestialueita ja verkkoja, mm. Fidonet ja Internetin news-alueita. G-Point on taasen puhtaasti Amigaan keskittynyt boksi.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Giga-Boxiin p&auml;&auml;sev&auml;t my&ouml;s modeemittomat Internetin k&auml;ytt&auml;j&auml;t. Homma onnistuu nimitt&auml;in telnetill&auml;, osoitteeseen <a href="telnet:tzimmola.tky.hut.fi">tzimmola.tky.hut.fi</a>. Artikkelia kirjoitettaessa yritin testata tuota boksia ja tarkistaa, kulkevatko uudet Sakunetin viestit sinne asti, mutta kun olen vieraillut viimeksi vuosia sitten, niin en muistanut en&auml;&auml; salasanaani ja testi j&auml;i sikseen... Mutta joka tapauksessa Giga-Boxinkin kautta pit&auml;isi p&auml;&auml;st&auml; mukaan Sakunetin keskusteluihin telnet-yhteydell&auml;!</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Jospa tiet&auml;m&auml;tt&auml;si omistat modeemin?</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Monissa nykyaikaisissa GSM-matkapuhelimissa on dataominaisuudet sis&auml;&auml;nrakennettuina. Jotkut puhelimet (mm. Nokian 7110 ja uudemmat) tukevat jopa suoraan ns. Hayes AT -komentokantaa, jota modeemeissa k&auml;ytet&auml;&auml;n. T&auml;m&auml; tarkoittaa sit&auml;, ett&auml; t&auml;llainen puhelin on mahdollista saada toimimaan t&auml;ysin kuten tavallinen modeemi, my&ouml;s Amigan per&auml;ss&auml;. Hieman i&auml;kk&auml;&auml;mmiss&auml; puhelimissakin (Nokian 2110:sta alkaen) on dataominaisuudet, mutta ne vaativat joko hankalan PCMCIA-kortin tai ainoastaan Windowsille l&ouml;ytyv&auml;t ajurit, jotka sitten softapohjaisesti emuloivat modeemia.</font>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Jos bokseihin soittelu on vain modeemin puutteesta kiinni ja kiinnostusta osallistua keskusteluihin et&auml;lukuna l&ouml;ytyisi, kannattaa oman puhelimen kyvyt selvitt&auml;&auml;. Viestipaketin hakeminen ja vastauspaketin l&auml;hetys esimerkiksi viikoittain ei vie kauaa aikaa eik&auml; n&auml;in ollen nosta merkitt&auml;v&auml;sti puhelinlaskua.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Nyky&auml;&auml;n l&auml;htev&auml; 9600 bps datapuhelu pit&auml;isi onnistua ainakin Soneran liittymist&auml; ilman ett&auml; palvelua t&auml;ytyy erikseen tilata/kytke&auml; p&auml;&auml;lle. Hiljattain Sonera ainakin ilmoitteli, ett&auml; l&auml;htev&auml; data 9600 bps nopeudella olisi kytketty kaikkiin liittymiin. Kuukausimaksua kyseisest&auml; palvelusta ei perit&auml;, ja itse yhteys on jokseenkin saman hintainen kuin tavallinen puhelu. Radiolinjan asiakkaillekin pit&auml;isi datapuhelu olla mahdollinen, mutta yksityiskohdat kannattaa kysy&auml; asiakaspalvelusta. Joten jos sinulla on sopiva puhelin, omistat itse asiassa my&ouml;s modeemin!</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">GSM-puhelimen datayhteys eroaa tavallisesta lankamodeemista edukseen, sill&auml; my&ouml;s ISDN-numeroihin voi soittaa (esimerkiksi Amiga Zonelle)! Nopeus ei tosin nouse 9600 bps:st&auml; ylemm&auml;s (paitsi High-Speed data puhelimella ja -palvelulla), mutta yhteyden kytkeytyminen tapahtuu huomattavasti nopeammin ja t&auml;ll&auml; tavoin s&auml;&auml;styy ainakin muutamia pennej&auml; joka yhteydell&auml;. Joissakin puhelimissa (esimerkiksi 9110i Communicator) pit&auml;&auml; ennen ISDN-numeroon soittamista antaa komento ATS35=0, jotta yhteys syntyisi. Tarkempia ohjeita kannattaa etsi&auml; laitteen k&auml;ytt&ouml;ohjeista tai Internetist&auml;.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Et&auml;lukua e-mailitse</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Uutena mahdollisuutena p&auml;&auml;st&auml; Sakunetiin mukaan olen luonut j&auml;rjestelm&auml;n, jonka avulla et&auml;luku onnistuu e-mailitse. Joudun t&auml;ll&auml; hetkell&auml; tekem&auml;&auml;n hommaa l&auml;hinn&auml; manuaalisesti, mutta se ei vaadi merkitt&auml;v&auml;sti vaivaa, koska viestipaketit l&auml;hetet&auml;&auml;n kerran viikossa. J&auml;rjestelm&auml; on tarkoitettu niille, joilla ei kertakaikkiaan ole mahdollisuutta modeemin k&auml;ytt&ouml;&ouml;n eik&auml; my&ouml;sk&auml;&auml;n Giga-Box jostain syyst&auml; olisi k&auml;ytett&auml;viss&auml;.</font>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Riitt&auml;&auml;, ett&auml; k&auml;ytt&auml;j&auml; omaa s&auml;hk&ouml;postiosoitteen ja mahdollisuuden liitetiedostojen k&auml;sittelyyn ja tietenkin jonkin et&auml;lukuohjelman (QWK- tai WWF-formaatille). L&auml;het&auml;n kerran viikossa s&auml;hk&ouml;postitse liitetiedostona uuden viestipaketin (esim. AZONE.QWK), jossa on mukana uudet viestit Sakunetin alueilta sek&auml; Amiga Zonen local-alueilta. Pyrin l&auml;hett&auml;m&auml;&auml;n paketit perjantai-iltaisin, jotta k&auml;ytt&auml;j&auml;ll&auml; olisi paremmin aikaa k&auml;ytett&auml;v&auml;ksi viestien parissa. Paketin saanut k&auml;ytt&auml;j&auml; tallentaa liitteen aivan kuin se olisi imuroitu suoraan boksista ja avaa sen et&auml;lukuohjelmaan. Paketin k&auml;sitelty&auml;&auml;n voi k&auml;ytt&auml;j&auml; l&auml;hett&auml;&auml; syntyneen vastauspaketin (AZONE.REP) takaisin s&auml;hk&ouml;postitse. K&auml;sittelen sen t&auml;&auml;ll&auml; p&auml;&auml;ss&auml;, ja viestit p&auml;&auml;tyv&auml;t Sakunetiin.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Mik&auml;li haluaisit mukaan Sakunetiin ja s&auml;hk&ouml;postivaihtoehto on ainoa k&auml;ytett&auml;viss&auml; oleva, ilmoittaudu minulle (<a href="mailto:picard@sci.fi">picard@sci.fi</a>). Kerro viestiss&auml;, mist&auml; p&auml;in olet (kaupunki), mit&auml; konetta k&auml;yt&auml;t (Amiga vai PC) sek&auml; Amigan tapauksessa lis&auml;ksi haluatko viestipaketit QWK- vai WWF-formaatissa. N&auml;iden tietojen avulla luon Amiga Zonelle tarvittavat k&auml;ytt&auml;j&auml;tiedot ja viestipakettien asetukset, jotka sopivat koneellesi. Saat paluupostissa ensimm&auml;isen viestipaketin ja jatkossa uudet paketit yleens&auml; perjantaisin. Ainoastaan et&auml;lukuohjelman hankinta ja asennus j&auml;&auml; teht&auml;v&auml;ksi (ja tietenkin osallistuminen keskusteluun...). :-)</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kuoleeko Sakunet?</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Joitakin lukijoita voi askarruttaa, kuinka kauan Sakunet on viel&auml; hengiss&auml;. T&auml;h&auml;n kysymykseen on mahdotonta minun vastata, mutta sen verran voin kommentoida, ettei mit&auml;&auml;n aikomusta ole lopettaakaan. Sen sijaan pyrin tuomaan mahdollisuutta esille ja pident&auml;&auml; verkon ik&auml;&auml; t&auml;m&auml;ntyyppisill&auml; artikkeleilla ja tiedottamalla.</font>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">K&auml;yt&auml;nn&ouml;ss&auml; Sakunet kuolee sitten, kun mukana ei ole en&auml;&auml; yht&auml;&auml;n boksia ja viimeist&auml;&auml;n sitten, kun sinne ei en&auml;&auml; tule uusia viestej&auml;. Verkon tulevaisuus onkin siis t&auml;ysin teist&auml; k&auml;ytt&auml;jist&auml; kiinni. Toistaiseksi tilanne on viel&auml; ihan hyv&auml;, uusia viestej&auml; liikkuu runsaasti, mutta niit&auml; kirjoittava k&auml;ytt&auml;j&auml;ryhm&auml; on pienehk&ouml;. Lukijoita on silti monia, hyvin moni hakee s&auml;&auml;nn&ouml;llisesti uuden viestipaketin, mutta ei juuri koskaan osallistu keskusteluihin.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tervetuloa mukaan luomaan tunnelmaa!</font></p>
					</td>
				</tr>
			</table>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>