<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Sammon verkkopankki toimimaan Amigalla</b></font></td>
				</tr>
				<tr height="15">
					<p>
						<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><a href="http://www.saunalahti.fi/halmej/" target="_blank">Joni Halme</a> &lt;<a href="mailto:halmej@saunalahti.fi">halmej@saunalahti.fi</a>&gt;</font></td>
					</p>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Nyky&auml;&auml;n alkaa homma menn&auml; siihen suuntaan, ettei k&auml;teist&auml; en&auml;&auml; kanneta mukana, vain muovia, ja laskut maksetaan Internetiss&auml;. K&auml;vin paikallisessa Sammon (entinen Leonia) toimipisteess&auml; hoitamassa raha-asioitani, ja myyj&auml; mainosti minulle, ett&auml; t&auml;m&auml; k&auml;visi paljon helpommin Internetin v&auml;lityksell&auml;. Kun myyj&auml; viel&auml; sanoi taikasanat &quot;ei maksa mit&auml;&auml;n&quot;, vaihdoin tilini online-pakettiin. Olin my&ouml;s aina ollut kiinnostunut, onnistuuko moinen Amigallani. Sain kasan papereita t&auml;ytetty&auml;ni mukaani viel&auml; isomman kasan papereita, tunnusluvun ja liudan pankkiavaimia.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Sammon OnLine-paketti:<br>
								Etu- ja kanta-asiakkaiden kk-maksu 5 mk<br>
								Alle 26-vuotiaiden kk-maksu 0 mk<br>
								Muiden asiakkaiden kk maksu 20 mk<br>
								Sis&auml;lt&auml;&auml;:<br>
								- palveluavaimet<br>
								- pankki- tai automaattikortti<br>
								- verkkopankin ja puhelinpankin k&auml;ytt&ouml;oikeus<br>
								- puhelinpankin k&auml;ytt&ouml;oikeus<br>
								- verkkomaksut<br>
								- laskunmaksut automaattisena maksupalveluna, suoralaskuna, verkkopankissa, WAP-palveluna* ja puhelinpankin palvelussa (* WAP-palvelun kk-maksu 5 mk)<br>
								- k&auml;teisnostot Otto-automaateilla ja konttoreissa<br>
								- tiliote kuukausittain verkkopankissa</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Palvelun k&auml;ytt&ouml;&ouml;n tarvitset arvatenkin tietokoneen, jossa on Internet-yhteys, mutta tarkemmin tarvitset Amigaasi nettiselaimen (mielell&auml;&auml;n mahdollisimman uusi versio, jossa on SSL-tuki) sek&auml; SSL-kirjastot (AmiSSL, MiamiSSL). Ei siin&auml; muuta tarvita. Verkkopankki hy&ouml;dynt&auml;&auml; ev&auml;steit&auml; ja Javascripti&auml;, mutta n&auml;m&auml; eiv&auml;t ole pakollisia selaimelta, vaan palvelu toimii hyvin ilman niit&auml;kin.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Verkkopalvelua p&auml;&auml;set k&auml;ytt&auml;m&auml;&auml;n henkil&ouml;kohtaisilla pankkiavaimillasi. Avaimet muodostuvat 8-numeroisesta asiakasnumerosta, 4-numeroisesta tunnusluvusta ja turvakortista, jossa on avainluku-turvaluku-pareja. Verkkoasiointi turvataan SSL-salausmenetelm&auml;ll&auml; (Secure Socket Layer) ja henkil&ouml;kohtaisilla asiakastunnisteilla, palveluavaimilla. Asiakasnumeroa ja tunnuslukua k&auml;ytet&auml;&auml;n sis&auml;&auml;nkirjautumiseen ja kertak&auml;ytt&ouml;isi&auml; avainluku-turvalukupareja tehdess&auml; toimeksiantoja. Jos ep&auml;ilet, ett&auml; joku on n&auml;hnyt tunnuksesi, voit lukita verkkopalvelusi verkkopankin etusivulla. T&auml;m&auml; lukitsee kaikki palveluavaimilla toimivat palvelut. Lukituksen voi avata ainoastaan Sammon konttorissa. Verkkopankin k&auml;ytt&ouml; tulisi aina lopettaa k&auml;ytt&auml;m&auml;ll&auml; &quot;Lopetus&quot;-painiketta. Yhteys lopetetaan automaattisesti 7 minuutin toimettomuuden j&auml;lkeen. Pankki suosittelee my&ouml;s tyhjent&auml;m&auml;&auml;n selaimen v&auml;limuistin verkkopankin k&auml;yt&ouml;n j&auml;lkeen.</font></p>
						<div align="center">
							<p><img src="kuvat/leonia.jpg" width="400" height="369" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">P&auml;&auml;sin kotiin ja avasin netin. K&auml;yt&ouml;ss&auml;ni on MiamiDx. K&auml;vin hakemassa Nordic Globalin sivuilta uusimman version MiamiSSL-paketista (v2.21). MiamiSSL vaatii rekister&ouml;idyn version Miamista. Jos t&auml;llaista ei l&ouml;ydy, niin yhten&auml; vaihtoehtona on AmiSSL, joka on ilmainen, mutta sit&auml; en ole kokeillut. MiamiSSL tulee kahdessa paketissa. P&auml;&auml;paketin voit hakea suoraan Nordic Globalin sivuilta, encryption-paketti on toisella palvelimella, mutta t&auml;m&auml;kin k&auml;y helposti Nordic Globalin sivuilla. Asennus sujui my&ouml;s t&ouml;rke&auml;n helposti.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ensin kokeilin verkkopankkia Voyagerin versiolla 3.3b104. K&auml;vin asetuksista katsomassa, ett&auml; SSL on p&auml;&auml;ll&auml; ja sitten suuntasin osoitteeseen www.leonia.fi. Ensimm&auml;inen ongelma on siin&auml;, ett&auml; Sampo, kuten moni muukin yhti&ouml;, olettaa kaikkien surffailevan Windowsilla, IE:lla ja parhaassa tapauksessa tietyll&auml; n&auml;yt&ouml;ntarkkuudella. Verkkopankin sivuilla neuvotaan klikkaamaan &quot;kirjaudu sis&auml;&auml;n&quot; -painiketta. Mutta sellaista en n&auml;hnyt miss&auml;&auml;n, kunnes tajusin, ett&auml; se j&auml;&auml; reunan alle piiloon. Sain painikkeen esille suurentamalla sivuille varattua tilaa n&auml;yt&ouml;ll&auml;. T&auml;m&auml; oli kyll&auml;kin Voyagerin vika. Uusin p&auml;ivitys korjaili paljon asetteluongelmia, mutta pari on viel&auml; ilmeisesti korjaamatta.</font></p>
						<p><img src="kuvat/avain.gif" width="120" height="145" border="0" align="left" alt=" "><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Seuraavaksi minulta kysyttiin asiakasnumeroa ja tunnuslukua. Asiakasnumero l&ouml;ytyi tiliavaimesta ja tunnusluvun sain suljetussa kuoressa pankista. Eteenp&auml;in. Sitten minulta kysyttiin pankkiavainta. Pankkiavain on kaksiosainen, itse avain ja sen turvaluku. Selain pyyt&auml;&auml; sinulta avaimeen sopivaa turvalukua. Kun avain on kerran k&auml;ytetty, se ei en&auml;&auml; toimi ja pit&auml;&auml; k&auml;ytt&auml;&auml; seuraavaa pankkiavainta. Avaimia saa pankista heti mukaansa aimo kasan, ja kun ne loppuvat, pankki l&auml;hett&auml;&auml; sinulle automaattisesti uudet avaimet. Sitten minua pyydettiin vaihtamaan tunnuslukuni turvallisuuden vuoksi. T&auml;ss&auml; tuli ensimm&auml;inen ongelma. Vaikka kirjoitin kaikki tiedot oikein, en p&auml;&auml;ssyt jatkamaan eteenp&auml;in. Olin jo miettinyt, mit&auml; valittaisin asiakaspalveluun, kunnes mieleeni juolahti kokeilla toista selainta. Avasin AWeb 3.4:n.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AWebissa oli omat ongelmansa sivujen asettelussa, mutta se p&auml;&auml;sti minut tunnuksen vaihdon ohitse, ja viimein p&auml;&auml;sin ihailemaan tilini saldoa tietokoneruudulla. Kun tunnus oli muutettu AWebilla, p&auml;&auml;sin my&ouml;s Voyagerilla verkkopankkiin. T&auml;ss&auml; vaiheessa on hyv&auml; muistuttaa er&auml;&auml;st&auml; yksityiskohdasta, johon t&ouml;rm&auml;si kaikilla selaimilla. Kirjoittaessasi tunnuslukuja tms. sinun pit&auml;&auml; jatkaa klikkaamalla &quot;Jatka&quot;-painiketta, ei painamalla enteri&auml; tekstikent&auml;ss&auml;. Vain n&auml;in p&auml;&auml;see eteenp&auml;in. Hassu ominaisuus, mutta ei se haittaa. My&ouml;s jos painat kahdesti &quot;Jatka&quot;-painiketta, tyss&auml;&auml; matkasi siihen, samaten jos painat ensin Enter ja sitten Jatka. Tarkkaa touhua.</font></p>
						<div align="center">
							<p><img src="kuvat/tilit.gif" width="400" height="205" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Sitten oli ensimm&auml;isen laskun maksun aika: R&auml;hin&auml;linjan k&auml;nnykk&auml;lasku. T&auml;ytin tiedot lomakkeeseen ja hyv&auml;ksyin maksun, ja selain ilmoitti maksun l&auml;hteneen. Tarkistin asian viel&auml; tilitiedoista, ja l&ouml;ytyih&auml;n se suoritus sielt&auml;. En sitten tied&auml;, l&auml;htik&ouml; maksu samana p&auml;iv&auml;n&auml; vai vasta parin p&auml;iv&auml;n p&auml;&auml;st&auml;, viikonloppu kun oli, mutta onko sill&auml; niin v&auml;li&auml;, kun lasku oli muutenkin kolme p&auml;iv&auml;&auml; my&ouml;h&auml;ss&auml; :).</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Mutta kyll&auml; olen tyytyv&auml;inen verkkopankkiin. Aiemmin laskut roikkuivat miss&auml; sattuvat. Piti maksaa, mutta illalla huomaatkin unohtaneesi laskun. Nyt kun muistan, ett&auml; tuokin piti maksaa, kone linjoille ja verkkopankkiin. Helppoa kuin hein&auml;nteko. Sammon verkkopankissa voit my&ouml;s hoidella sijoituksiasi, muuttaa tilisi ominaisuuksia, hakea pankkikortteja, seurata Visan tapahtumia, vakuutuksia jnejne...</font></p>
						<div align="center">
							<p><img src="kuvat/maksu.gif" width="400" height="199" border="0"><br>
								<i><font face="Trebuchet MS,Verdana,Arial,Helvetica"><font size="2">Ottakaapa oppia t&auml;st&auml; maksusta...</font></font></i></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Testasin siis selaimilla Voyager 3.3b104, AWeb 3.4 ja IBrowse 2. Kaikki tuntuivat toimivan hyvin verkkopankin kanssa, paitsi Voyager ei osannut vaihtaa tunnuslukua, mutta muuten kaikki toimi. Sivujen asettelu nyt heitteli joka selaimella miten sattuu. Ehk&auml; uskaltaisin sanoa, ett&auml; IBrowse hallitsee parhaiten sivujen asettelun, mutta toisaalta makunsa kullakin. K&auml;ytit sitten mit&auml; selainta tahansa, suosittelen k&auml;ytt&auml;m&auml;&auml;n mahdollisimman uutta versiota. IBrowsen kanssa tuli ongelma, ettei se osannut n&auml;ytt&auml;&auml; kaikkia Sammon sivuja, ja jouduin menem&auml;&auml;n verkkopankkiin suoraan osoitteella www.leonia.fi/verkkopankki/. Muista my&ouml;s IB2:ta k&auml;ytt&auml;ess&auml; k&auml;yd&auml; ruksaamassa asetuksista kohta &quot;k&auml;yt&auml; MiamiSSL&quot;.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Ohjelmistoa:</b><br>
								Miami ja MiamiSSL: <a href="http://www.nordicglobal.com" target="_blank">http://www.nordicglobal.com</a><br>
								AmiSSL: <a href="http://www.bigfoot.com/~TheAntony/AmiSSL" target="_blank">http://www.bigfoot.com/~TheAntony/AmiSSL</a><br>
								Voyager v3: <a href="http://v3.vapor.com" target="_blank">http://v3.vapor.com</a><br>
								IBrowse: <a href="http://www.hisoft.co.uk" target="_blank">http://www.hisoft.co.uk</a><br>
								AWeb: <a href="http://www.amitrix.com" target="_blank">http://www.amitrix.com</a><br>
							</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Verkkopankit:</b><br>
								Sampo (Leonia): <a href="http://www.leonia.fi/verkkopankki" target="_blank">http://www.leonia.fi/verkkopankki</a><br>
								Nordea (Merita): <a href="http://www.merita.fi/" target="_blank">http://www.merita.fi/</a><br>
								Osuuspankki: <a href="http://www.osuuspankki.fi/" target="_blank">https://kultaraha.osuuspankki.fi/</a><br>
								S&auml;&auml;st&ouml;pankki: <a href="https://inetpankki.samlink.fi/login.htm">https://inetpankki.samlink.fi/login.htm</a><a href="https://inetpankki.samlink.fi/login.htm"><br>
								</a>Paikallisosuuspankit: <a href="https://inetpankki.samlink.fi/pop" target="_blank">https://inetpankki.samlink.fi/pop</a><a href="https://inetpankki.samlink.fi/pop" target="_blank"><br>
								</a>Aktia S&auml;&auml;st&ouml;pankki: <a href="https://inetpankki.samlink.fi/aktia" target="_blank">https://inetpankki.samlink.fi/aktia</a><a href="https://inetpankki.samlink.fi/aktia" target="_blank"><br>
								</a>Mandatum: <a href="http://www.mandatum.fi/" target="_blank">http://www.mandatum.fi/</a><a href="http://www.mandatum.fi/" target="_blank"><br>
								</a>&Aring;landsbanken: <a href="https://online.alandsbanken.fi/sv/" target="_blank">https://online.alandsbanken.fi/sv/</a><a href="https://online.alandsbanken.fi/sv/" target="_blank"><br>
								</a></font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Testilaitteisto:</b><br>
								A4000, OS 3.5, CyberStormPPC, CyberVisionPPC, 128 Mt, kiinte&auml; ISDN 128k, MiamiSSL 2.21, Voyager 3.3, IBrowse 2.2, AWeb 3.4</font></p>
						<div align="center">
							<p><img src="kuvat/lopetus.gif" width="400" height="126" border="0" alt=" "></p>
						</div>
					</td>
				</tr>
			</table>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>