<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, rawhead rexx, glenmore, Rawhead Rexx, Volk">
<title>Rawhead Rexx: Rawhead Rexx</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="#00ff00">Rawhead Rexx: Rawhead Rexx</font></h1><BR> (AFM / 58:41)</center></P>

<p>Kann sich noch jemand an die melodische Progressive Metal Band Glenmore erinnern, die f&#252;r meinen Geschmack mit &quot;For The Sake Of Truth&quot; seinerzeit ein b&#228;renstarkes Album abgeliefert haben? Mit Drummer Dany L&#246;ble und S&#228;nger J&#252;rgen Volk sind jetzt zwei Members von Glenmore wieder mit einer neuen Truppe namens Rawhead Rexx am Start und werden dabei von Bassist Face (ex-Erotic Jesus) sowie Gitarrist R&#252;diger Fleck (ex-Letter-X) unterst&#252;tzt. Alles in allem schonmal technisch gesehen gute Vorraussetzungen f&#252;r Rawhead Rexx, die zur allgemeinen Verwunderrung aber nicht auf verspielten Melodic Metal in Glenmore Tradition setzen, sondern dem geneigten H&#246;rer straighten Power Metal mit deutlicher US Schlagseite vor den Latz knallen, der insbesondere von der ausergew&#246;hnlichen Stimme von J&#252;rgen Volk lebt, der nicht nur Schreie in bester Halford Manie auf Lager hat, sondern auch Halballaden wie &quot;Blood On My Hands&quot; gef&#252;hlvoll veredeln kann. Mal abgesehen von dieser Halbballade, setzen Rawhead Rexx ansonsten auf schn&#246;rkellosen Metal und lassen es mit dem speedigen Opener &quot;Town Of Skulls&quot; auch gleich zu Beginn ganz sch&#246;n krachen, um im weiteren Verlauf krachende Stampfer wie die excellente Bandhymne &quot;Rawhead Rexx&quot; oder das treibende &quot;Opposing Force&quot; folgen zu lassen. Nicht vergessen darf man das eing&#228;ngige &quot;
Mr.Hyde&quot; sowie den abschlie&#223;enden Rausschmei&#223;er &quot;The Scream&quot;, der mit zu den st&#228;rksten Kompositionen auf diesem beileibe nicht schwachem Debutalbum zu z&#228;hlen ist. Dabei pr&#228;sentiert sich die Combo im Laufe der knappen Stunde immer abwechselungsreich und alles andere als eindimensional, zumal die Jungs mit dem &#252;berlangen &quot;Sons Of Mayhem&quot; noch eine weitere Soundperle an Bord haben, die ein klein wenig Erinerrungen an Dio wach werden l&#228;sst. Lediglich die beiden Bonus Tracks, die der Erstauflage samt Computerspiel beiliegen, konnten mich nicht so vom Hocker hauen, was durch die astreine und druckvolle Produktion von Charly Bauernfeind allemal wieder ausgeglichen wird. Zudem h&#228;tte man sich f&#252;r meinen Geschmack das d&#228;mliche Coverartwork klemmen k&#246;nnen, aber das ist sicherlich Geschmackssache. Wer auf klassischen Heavy Metal ohne Spielereien steht, der sollte dieses starke Debut unbedingt antesten. Von Rawhead Rexx wird man in Zukunft sicherlich noch h&#246;ren!</P>

<p>Fazit: 8 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd6.jpg"></P>
<p><img src="kit.gif"></P>
</Center>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
