<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, tarantula, dream maker, Tarantula, Dream Maker">
<title>Tarantula: Dream Maker</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="#00ff00">Tarantula: Dream Maker</font></h1><BR> (AFM / 43:22)</center></P>

Wenn ich jetzt sagen w&#252;rde, da&#223; es sich bei Tarantula um eine Melodic Metal Kapelle mit einer - je nach Song - mehr oder minder ausgpr&#228;gten Power Metal Schlagseite handelt, d&#252;rften vielen Metallern Combos wie HammerFall, Gamma Ray, Stratovarius und entsprechende Nachahmer einfallen, von denen es in den letzten Wochen und Monaten ja nicht gerade wenig gab und von denen wirklich nicht alle zu gefallen wussten. Tarantula geh&#246;ren aber mitnichten zu den unz&#228;hligen Clones, sondern liefern mit &quot;Dream Maker&quot; eine Scheibe ab, die nicht nur geschickt alle Klischee`s umschifft, sondern auch recht eigenst&#228;ndig daherkommt. Als grobe musikalische Orientierung kann vielleicht das alte Material von Dokken dienen, was am deutlichsten beim Ohrwurmopener &quot;Dream Maker&quot; wird. Auch die stampfende Midtemponummer &quot;The Nature Of Sin&quot; wei&#223; ebenso zu gefallen wie das zwar simpel strukturierte, aber daf&#252;r umso eing&#228;ngigere &quot;You Can Always Touch The Sky&quot;. Aber auch das Gaspedal wird bei den Herrschaften von Tarantula durchaus mal durchgetreten, was 
h&#228;rtere Songs wie &quot;Changes Coming&quot; und &quot;A New Horizon&quot; eindrucksvoll beweisen. Lediglich die Nummer &quot;The Sun Will Rise Again&quot; f&#228;llt im direkten Vergleich ein wenig ab und das abschlie&#223;ende belanglose Instrumental &quot;To Feel The Light&quot; h&#228;tten sich Tarantula auch gleich schenken k&#246;nnen. Das schm&#228;lert den positiven Gesamteindruck aber nur am Rande, denn insgesamt gesehen ist &quot;Dream Maker&quot; eine kraftvolle und gut produzierte Melodic Metal Scheibe geworden, die nicht nur im Lager der Melodic Metal Fans gut ankommen d&#252;rfte, sondern sicherlich auch den einen oder anderen Fan des melodischen Power Metal`s, der genug von Schwerten, Rittern und Drachen hat, ansprechen d&#252;rfte. Tarantula haben eindrucksvoll bewiesen, da&#223; man auch heute noch Melodic Metal in der Tradition der seligen 80er machen kann und keine &#252;berfl&#252;ssigen Soundexperimente eingehen muss, um die Fans auf seine Seite zu ziehen. Denn das wird Tarantula mit &quot;Dream Maker&quot; n&#228;mlich unter Garantie gelingen!</P>

<p>Fazit: 8 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd7.jpg"></P>
<p><img src="kit.gif"></P>
</Center>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
