<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Toimitukselliset</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				<table width="100%">
					<tr><td>SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY.</td><td>KOKOUSMUISTIO</td></tr>
					<tr><td>HALLITUS 1999-2000</td><td></td></tr>
					<tr><td></td><td>9.1.2000</td></tr>
				</table>
				<br>
				HALLITUKSEN KOKOUS 5/99<br>
				<br>
				<table width="100%">
					<tr><td valign="top">AIKA</td><td>20. syyskuuta - 31. joulukuuta</td></tr>
					<tr><td valign="top">PAIKKA</td><td>Internet-postituslista</td></tr>
					<tr><td valign="top">L&Auml;SN&Auml;</td><td>Terho Henriksson<br>Tomi Jaskari<br>Timo Kemppaala<br>Oliver Kruusi<br>Valtteri Murto<br>Jarmo Piippo<br>Janne Pikkarainen<br>Anu Seilonen<br>Tapani Tanskanen<br>Paula-Christiina Wirtanen</td></tr>
				</table>
				<br>
				<b>1</b><br>
				<b>T&auml;st&auml; kokousmuistiosta</b><br>
				<br>
				T&auml;h&auml;n muistioon on ker&auml;tty Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n hallituksen Internetiss&auml; postituslistallaan 20.9.-31.12.1999 k&auml;ym&auml;n keskustelun p&auml;&auml;kohtia. Otteet ovat eritt&auml;in tiiviit&auml; lyhennelmi&auml;, eik&auml; muistion ole edes tarkoitus sis&auml;lt&auml;&auml; selvityst&auml; kaikista k&auml;sitellyist&auml; aiheista, vaan tuoda esille yhdistystoiminnan kannalta merkitt&auml;v&auml;t seikat.<br>
				<br>
				Hallituksen postituslista tavoittaa kaikki hallituksen j&auml;senet, mutta kaikki eiv&auml;t v&auml;ltt&auml;m&auml;tt&auml; ole ottaneet osaa kaikkiin aiheisiin. Listalla oli 1.1.2000 saakka my&ouml;s Janne Sir&eacute;n, vaikka h&auml;n ei en&auml;&auml; kuulunut varsinaisesti hallitukseen.<br>
				<br>
				<b>2</b><br>
				<b>K&auml;siteltyj&auml; aiheita</b><br>
				<br>
				Yhdistyksen kahden edellisen tilikauden tilinp&auml;&auml;t&ouml;sasiakirjojen kirjoittaminen ja tarkastus ovat yh&auml;kin tekem&auml;tt&auml; tilinhoidosta vastaavan henkil&ouml;n muiden kiireiden vuoksi. Siksi ei ole my&ouml;sk&auml;&auml;n ollut mahdollista j&auml;rjest&auml;&auml; suunniteltua ylim&auml;&auml;r&auml;ist&auml; yhdistyskokousta vastuuvapauden my&ouml;nt&auml;mist&auml; varten aiemmille hallituksille ja vastuuhenkil&ouml;ille. Alkuvuoden kaikkein t&auml;rkein tavoite onkin saada asiakirjat ajan tasalle ja kokous j&auml;rjestetty&auml; p&auml;&auml;t&ouml;sten virallistamiseksi.<br>
				<br>
				Yhdistyksen Internet-kotisivujen webmasterointi on lokakuussa siirretty Janne Pikkaraiselle. H&auml;nen mahdollisuutensa hoitaa teht&auml;v&auml;&auml; ovat kuitenkin syksyn aikana oleellisesti heikentyneet, joten seuraava muutos tilanteeseen tulee todenn&auml;k&ouml;isesti jo vuoden 2000 tammikuussa. Teht&auml;v&auml; siirtyy tuolloin ilmeisesti Jarmo Piipolle.<br>
				<br>
				Sakunetin tulevaisuudenn&auml;kymi&auml; selviteltiin pienell&auml; tilannekyselyll&auml; Sakunetin BBS-viestialueella. Kysely ep&auml;onnistui, sill&auml; vastauksia tuli vain kolmelta SysOpilta. Vaikka tuloksista ei voikaan mit&auml;&auml;n varmaa purkkimaailman tilanteesta p&auml;&auml;tell&auml;, on kuitenkin varsin mahdollista, ett&auml; pieni aktiivinen joukko jatkaa viel&auml; ainakin toistaiseksi Sakunetin yll&auml;pitoa. Toisaalta purkkien jatkamisesta riippumatta yhdistyksen koko j&auml;senist&ouml;n (ja amigistien yleens&auml;kin) saamista mukaan my&ouml;s Internetin k&auml;ytt&auml;jiksi pidet&auml;&auml;n toivottavana.<br>
				<br>
				Aloitettiin taustaselvittely ja tilannearviointi siit&auml;, onko yhdistyksell&auml; riitt&auml;v&auml;sti resursseja k&auml;ytett&auml;viss&auml;&auml;n mahdollisen Saku 2000 -tapahtuman j&auml;rjest&auml;miseen. Lopullista p&auml;&auml;t&ouml;st&auml; j&auml;rjest&auml;misest&auml; ei voida tehd&auml; ennen laajojen selvityst&ouml;iden valmistumista. Todettiin kuitenkin kaikkien keskusteluun osallistuneiden toivovan, ett&auml; tapahtuma voitaisiin pit&auml;&auml;.<br>
				<br>
				Paikkakuntakohtaisten kerhoiltojen j&auml;rjest&auml;mist&auml; pidettiin mahdollisena, mik&auml;li tarkoitukseen sopivia tiloja ja asiansa todella osaavia j&auml;rjest&auml;ji&auml; l&ouml;ytyy. Vaatimuksena yhdistyksen nimiss&auml; pidett&auml;ville tilaisuuksille tietysti on, ett&auml; toiminta on kaikkien taiteen s&auml;&auml;nt&ouml;jen mukaista ja antaa kaikille tilaisuudessa k&auml;vij&ouml;ille yhdistyksest&auml; hyv&auml;n ja ammattimaisesti organisoidun kuvan.<br>
				<br>
				Ideaa yhdistyksen omista kerhotiloista pidettiin hyv&auml;n&auml;, mutta tilat vaatisivat runsaasti ylim&auml;&auml;r&auml;ist&auml; aikaa omaavan, luotettavan vastuuhenkil&ouml;n huolehtimaan niiden siisteydest&auml;, turvallisuudesta, k&auml;yt&ouml;n ja k&auml;ytt&auml;jien asiallisuudesta jne. Lis&auml;ksi tilojen tulisi olla ainakin kohtalaisen edustuskelpoiset, joten niiden saaminen ilman kohtuuttoman suurta rahallista panostusta on ep&auml;todenn&auml;k&ouml;ist&auml;.<br>
				<br>
				Saku-lehden levykeversion ulkoasun p&auml;ivitys on ollut j&auml;lleen tapetilla, ja asian t&auml;rkeydest&auml; ei ole ep&auml;ilyst&auml;k&auml;&auml;n, onhan nykyinen lehtikoodi kielt&auml;m&auml;tt&auml; selv&auml;sti vanhentunut, Janne Sir&eacute;nin tekemi&auml; toiminnallisia parannuksia lukuunottamatta. Teht&auml;v&auml; on kuitenkin eritt&auml;in vaativa, eik&auml; yhdistyksen voimavaroja haluta sitoa siihen ainakaan nykytilanteessa. Uusi lehtikoodi voidaan tietysti teett&auml;&auml; my&ouml;s ulkopuolisella vapaaehtoisella, mutta tuloksen laadun ja toimivuuden lis&auml;ksi ohjelman tekij&auml;n t&auml;ytyy pysty&auml; takaamaan my&ouml;s sitoutuvansa yll&auml;pit&auml;m&auml;&auml;n ja aina tarvittaessa p&auml;ivitt&auml;m&auml;&auml;n ohjelmaa, jos muutoksille on kysynt&auml;&auml;. Ohjelmointity&ouml; on nimitt&auml;in palveluammatti, eik&auml; suinkaan kertaluonteinen rakennusprojekti.<br>
				<br>
				Sakun HTML-version rakenne ja ulkon&auml;k&ouml; p&auml;&auml;tettiin uusia t&auml;ysin, ja varmistaa uuden ja entist&auml; vaativamman HTML-lehden tekemiselle olevan riitt&auml;v&auml;sti ty&ouml;aikaa k&auml;ytett&auml;viss&auml; luopumalla kokonaan AmigaGuide-version julkaisusta. Todettiin, ettei ohjeita artikkelien l&auml;hett&auml;misest&auml; toimitukseen tarvitse muuttaa muilta osin kuin ett&auml; deadlinen noudattamisen t&auml;rkeys korostuu, jotta lehden molemmat julkaisumuodot saadaan t&auml;ydell&auml; varmuudella ilmestym&auml;&auml;n samana p&auml;iv&auml;n&auml;.<br>
				<br>
				Yhdistyksen Internet-kotisivuille on ehdotettu monenlaisia uudistuksia. Janne Pikkarainen esitti tietokantapohjaisten palvelujen tarjoamista, esimerkiksi uutispalvelun tai ilmoitustaulun voisi toteuttaa kyseisell&auml; tekniikalla varsin edustavasti ja monipuolisesti. Harmi kyll&auml; tekniikan luotettavuus ei ainakaan nykyisell&auml;&auml;n vakuuttanut, ja vaikka tietokanta olisikin vain pieni osapalvelu kotisivuillamme, olemme silti vastuussa sen sis&auml;ll&ouml;st&auml; ja toiminnasta. J&auml;&auml;mme siis odottamaan varmatoimista tietokantaratkaisua, ennen kuin liit&auml;mme sellaisen mukaan sivustoomme.<br>
				<br>
				Taannoin julkaisujen P&auml;iv&auml;n namupalojen paluuta kuvioihin on toivottu. Ty&ouml;h&ouml;n sitoutumaan valmiita kirjoittajia vain ei ole, joten ep&auml;varmasti toimivaa palvelua emme voi hyv&auml;ksy&auml;. Lis&auml;ksi jos namupaloja joskus alettaisiin tehd&auml; uudestaan, olisi ehk&auml; parempi ettei en&auml;&auml; puhuttaisi p&auml;iv&auml;n tai edes viikon namupaloista, vaan niit&auml; julkaistaisiin sitoutumatta aikatauluun.<br>
				<br>
				Pohdittiin saatua ehdotusta osallistua bannerien vaihteluun eri web-sivustojen kesken. Liikennem&auml;&auml;ri&auml; ja julkisuutta ajatellen se olisi tietysti positiivinen ajatus, mutta jouduimme toteamaan, ettemme halua muuttaa etusivumme ilmett&auml; niin oleellisella tavalla, vaan haluamme s&auml;ilytt&auml;&auml; sen tyylikk&auml;&auml;n asiallisena ja puhtaana ylim&auml;&auml;r&auml;isest&auml; "kr&auml;&auml;s&auml;st&auml;".<br>
				<br>
				Yhdistyksen pikkujoulujen tapahtumavastaavaksi valittiin Timo Kemppaala, ja tiedotuksesta huolehti hallituksen luvalla Janne Sir&eacute;n. Janne auttoi my&ouml;s suurelta osin varsinaisissa j&auml;rjestelyiss&auml;. Tapahtumassa ei ollut yhdistyksen puolesta kuvaajaa, ja vastaisuudessa tapahtumien dokumentointi ja erityisesti kuvaaminen onkin otettava jo etuk&auml;teen suunnittelussa huomioon.<br>
				<br>
				Hallituksen varaj&auml;sen Valtteri Murto siirtyi vuoden 2000 ensimm&auml;isess&auml; palvelukseenastumiser&auml;ss&auml; suorittamaan varusmiespalvelustaan.<br>
				<br>
				Esitettiin huoli DOT:n Amiga-aiheisen s&auml;hk&ouml;postilistan keskustelun tasosta listalla v&auml;lill&auml; esiintyneiden loukkaavaan s&auml;vyyn kirjoitettujen viestien takia. Vaikka yhdistyksell&auml; ei listan toimintaan sananvaltaa olekaan, ehk&auml;p&auml; voisimme vaikka pyyt&auml;&auml; listan yll&auml;pitoa julkaisemaan listalle sellaisen ohjetiedoston tai FAQ:n kuin joillakin news-ryhmill&auml; on ollut, dokumentin jossa sanellaan listan viestiliikenteen s&auml;&auml;nn&ouml;t. Amiga-postilistan tilanne kuitenkin onneksi rauhoittui, joten p&auml;&auml;timme j&auml;&auml;d&auml; seuraamaan tilannetta.<br>
				<br>
				Yhdistyksen entinen varapuheenjohtaja Janne Sir&eacute;n on aikaa ja vaivaa s&auml;&auml;st&auml;m&auml;tt&auml; toiminut koko syksyn ajan yhteisty&ouml;ss&auml; uuden hallituksen kanssa ja antanut meille korvaamattoman arvokasta konsultointiapua ty&ouml;ss&auml;mme. V&auml;symyksest&auml; huolimatta h&auml;n on jaksanut valppaasti selitt&auml;&auml; kulloisellekin ruorimiehelle, mihin suuntaan yhdistyslaivaa pit&auml;&auml; ohjata ja opettanut, miksi jonkun on aina oltava keulassa t&auml;hyilem&auml;ss&auml; eteenp&auml;in ja huutamassa tarvittaessa "J&auml;&auml;vuori edess&auml;!". Hallitus kiitt&auml;&auml; Jannea ja lupaa muistaa, ettei t&auml;m&auml; purkki suinkaan ole uppoamaton, vaan pysyy pinnalla ainoastaan siten ett&auml; miehist&ouml; omistautuu ihan tosissaan jokaiseen saamaansa teht&auml;v&auml;&auml;n.<br>
				<br>
				Muistion kokosi ja kirjoitti Jarmo Piippo. Oikoluvusta kiitos Anu Seiloselle.
			</td></tr>
		</table>
		</p>
		<p>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

