<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Toimitukselliset</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n tiedotteita</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				T&auml;m&auml; on yhteenveto yhdistyksen viime Sakun j&auml;lkeen julkaisemista tiedotteista.
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="#b0c4de" align="center">
				<font color="black"><b>19.10.1999 - SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY:N TOIMINTA JATKUU ENTISELL&Auml;&Auml;N</b></font>
			</td></tr>

			<tr><td width="50%" bgcolor="#d8ecfd">
				Viime viikkojen tapahtumat Amiga-maailmassa ovat her&auml;tt&auml;neet paljon kysymyksi&auml;, jotka perustuvat sek&auml; todellisiin huolenaiheisiin ett&auml; ep&auml;selv&auml;n tilanteen synnytt&auml;miin huhuihin. Useat Amiga-k&auml;ytt&auml;j&auml;t ovat ilmaisseet huolestuneisuutensa my&ouml;s Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n toiminnan ja Saku-lehden jatkumisesta.<br>
				<br>
				Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. on luonnollisesti pahoillaan Amiga-maailman ajautumisesta ep&auml;varmaan tilaan mutta muistuttaa samalla, ett&auml; koko yhdistys perustettiin taannoin Commodoren konkurssin j&auml;lkeen ja ett&auml; toiminta on jatkunut kaikki vuodet, niin my&ouml;t&auml;- kuin vastam&auml;ess&auml;kin. On my&ouml;s syyt&auml; tiedostaa, ett&auml; monet nykyhetken ep&auml;varmuudet perustuvat v&auml;&auml;rin ymm&auml;rrettyihin ja jopa t&auml;ysin virheellisiin huhuihin.<br>
				<br>
				Saku-lehti ja Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. jatkavat toimintaansa niin kauan kuin j&auml;senkunta haluaa ja toiminnan yll&auml;pit&auml;miseen riitt&auml;&auml; kiinnostusta ja resursseja. Ainakin t&auml;ll&auml; hetkell&auml; riitt&auml;v&auml;t toimintaedellytykset ovat olemassa, ja itse kullakin on mahdollisuus vaikuttaa toiminnan jatkuvuuteen esimerkiksi kirjoittamalla lehteen.<br>
				<br>
				Yhdistys uskoo edelleen, ett&auml; Amiga-yhti&ouml; saattaa tuoda markkinoille Amiga-k&auml;ytt&auml;ji&auml; kiinnostuvaa teknologiaa, mutta samalla tutkitaan my&ouml;s mahdollisuuksia tukea alkuper&auml;isen ja virallisen Amigan lis&auml;ksi vaihtoehtoisia Amigan seuraajia, mik&auml;li sellaisia ilmaantuu ja j&auml;senkunta sek&auml; suomalainen Amiga-yhteis&ouml; niist&auml; kiinnostuu.<br>
				<br>
				Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. on ker&auml;nnyt vuosien saatossa yhteisen harrastuksen ymp&auml;rille satoja, kenties tuhansia tietokoneharrastajia. Yhdistys on luonut yhteyksi&auml; ja yst&auml;vyyksi&auml;, jotka loppujen lopuksi painavat toiminnan jatkumisessa paljon enemm&auml;n kuin Amigan tilanne maailmalla.
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="#b0c4de" align="center">
				<font color="black"><b>2.12.1999 - SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY. J&Auml;RJEST&Auml;&Auml; AMIGA-AIHEISET PIKKUJOULUT</b></font>
			</td></tr>

			<tr><td width="50%" bgcolor="#d8ecfd">
				Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. kutsuu Amigasta ja hyv&auml;st&auml; seurasta kiinnostuneet pikkujouluhenkiseen kerhoiltaan. Luvassa on vapaamuotoista ohjelmaa AmigaOS 3.5 -esittelyn, Amiga-aiheisten videoiden, Internet- yhteyden ja alkoholittomien virvokkeiden siivitt&auml;m&auml;n&auml;. Paikalla on my&ouml;s Amiga-j&auml;lleenmyyj&auml; tuotteineen sek&auml; mahdollisuus ostaa Saku-rompun kakkospainos ja liitty&auml; yhdistyksen j&auml;seneksi. Pikkujouluihin on vapaa p&auml;&auml;sy.<br>
				<br>
				Tapahtumapaikka on sama kuin yhdistyksen elokuisella vuosikokouksella eli taloyhti&ouml;n kerhotila osoitteessa Kaivomestarinkatu 8, Espoo. Paikka l&ouml;ytyy Helsingin puhelinluettelon karttasivulta 17 ruudusta 36-77. Pikkujoulut j&auml;rjestet&auml;&auml;n lauantaina 11.12. noin kello 16-20. Suosittelemme kuitenkin seuraamaan tiedotuskanavia silt&auml; varalta ett&auml; joutuisimme taloyhti&ouml;n tilatarpeiden vuoksi turvautumaan varap&auml;iv&auml;m&auml;&auml;r&auml;&auml;n.<br>
				<br>
				Kaivomestarinkatu on lyhyen k&auml;velymatkan p&auml;&auml;ss&auml; Espoon juna-asemalta (Helsingist&auml; l&auml;hijunat E, L, S) ja se sijaitsee hotelli Kuninkaantiest&auml; katsoen Kirkkokadun vastakkaisella puolella. L&auml;helt&auml; kulkee l&auml;hiliikenteen linja-autoja ja henkil&ouml;autoille on maksutonta pys&auml;k&ouml;intitilaa. Kerhotilan edess&auml;, Kaivomestarinkadun k&auml;&auml;nt&ouml;paikalla, on tilaisuuden alkaessa opashenkil&ouml;.<br>
				<br>
				Lis&auml;tietoja l&ouml;ytyy Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n kotisivuilta osoitteesta <a href="http://batman.jytol.fi/~saku/" target="_top">http://batman.jytol.fi/~saku/</a> tai <a href="http://tzimmola.tky.hut.fi/saku/" target="_top">http://tzimmola.tky.hut.fi/saku/</a>. Tarjolla on mm. kuvitettu saapumisopas ja tapahtumap&auml;iv&auml;n&auml; web-kamera. S&auml;hk&ouml;postitse lis&auml;tietoja voi udella tilaisuuden tiedotushenkil&ouml;lt&auml; Janne Sir&eacute;nilt&auml; (<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>).
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="#b0c4de" align="center">
				<font color="black"><b>4.12.1999 - LAHJANVAIHTOA J&Auml;LLEEN SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY:N PIKKUJOULUISSA</b></font>
			</td></tr>

			<tr><td width="50%" bgcolor="#d8ecfd">
				Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. j&auml;rjest&auml;&auml; pikkujouluhenkisen kerhoillan lauantaina 11. joulukuuta noin kello 16-20 Kirkkoj&auml;rvell&auml;, Espoossa (p&auml;iv&auml; ja aika voivat muuttua). Aikaisemmin ilmoitettujen ohjelmanumeroiden lis&auml;ksi viime vuonna suosituksi osoittautunut lahjanvaihto on mukana. Kun tuot pikkujouluihin paketoidun Amiga-aiheisen joululahjan, esimerkiksi vanhan, toimivan alkuper&auml;ispelin tai -ohjelman, saat vaihdossa jonkun toisen vierailijan tuoman lahjan mukaasi.<br>
				<br>
				Tervetuloa viihtym&auml;&auml;n! Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. toivottaa samalla j&auml;senilleen ja kaikille Amiga-k&auml;ytt&auml;jille erinomaista joulua ja sopivan tapahtumarikasta vuosituhannen vaihdetta.<br>
				<br>
				Lis&auml;tietoja l&ouml;ytyy Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n kotisivuilta osoitteesta <a href="http://batman.jytol.fi/~saku/" target="_top">http://batman.jytol.fi/~saku/</a> tai <a href="http://tzimmola.tky.hut.fi/saku/" target="_top">http://tzimmola.tky.hut.fi/saku/</a>. Tarjolla on mm. kuvitettu saapumisopas ja tapahtumap&auml;iv&auml;n&auml; web-kamera. S&auml;hk&ouml;postitse lis&auml;tietoja voi udella tilaisuuden tiedotushenkil&ouml;lt&auml; Janne Sir&eacute;nilt&auml; (<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>).
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="#b0c4de" align="center">
				<font color="black"><b>Finnish Amiga Users Group Announces 1999 Christmas Meeting</b></font>
			</td></tr>

			<tr><td width="50%" bgcolor="#d8ecfd">
				FOR IMMEDIATE RELEASE<br>
				<br>
				ESPOO, FINLAND - December 4, 1999 - To celebrate the holiday season, Finnish Amiga Users Group, famous for its Saku events, will once again host  small christmas meeting for Amiga users on Saturday December 11th from 16:00 to 20:00 (time and date may change) in Espoo, Finland.<br>
				<br>
				Amiga related activities include an AmigaOS 3.5 demonstration, Internet connection and video films. Also, visitors can exchange christmas presents and an Amiga retailer will be present with Amiga items for sale. Admission will be free of charge.<br>
				<br>
				Please visit <a href="http://batman.jytol.fi/~saku/" target="_top">http://batman.jytol.fi/~saku/</a> or our mirror site <a href="http://tzimmola.tky.hut.fi/saku/" target="_top">http://tzimmola.tky.hut.fi/saku/</a>, for instructions on how to get there, latest news, webcam and more. E-mail inquiries may be sent to Janne Sir&eacute;n (<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>).<br>
				<br>
				About Finnish Amiga Users Group<br>
				<br>
				Finnish Amiga Users Group (Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.) is a non-profit organization for promoting Amiga computing and helping Amiga users in Finland. Also known as Saku, after its disk magazine, the group is trying to accomplish its goals by organizing meetings and by publishing a disk magazine. Since 1993 the Finnish Amiga Users Group and its predecessors have released over thirty issues of the disk magazine and held several public gatherings. Other accomplishments include the Web site and Sakunet, a national Fidonet style network of Amiga related bulletin board systems.
			</td></tr>
		</table>
		</p>
		<p>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

