<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Toimitukselliset</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>V u o s i &nbsp; 1 9 9 9 &nbsp; - &nbsp; v a i k e u k s i e n &nbsp; k a u t t a &nbsp; v o i t t o o n</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;<br>
				Kuvat: Johanna Makkonen, Janne Sir&eacute;n, Toni Walther</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				Vuosi 1998 oli kiistatta Suomen Amiga-k&auml;ytt&auml;jien unionin ja sen virallisen seuraajan Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n t&auml;h&auml;nastisen, l&auml;hes seitsem&auml;nvuotisen taipaleen menestyksekk&auml;in. Vanhan vuosituhannen viimeiseen (keskustelu vuosituhannen laskentatavasta sivuutetaan) vuoteen siirryttiin siis suurin odotuksin, varovaisen optimistisissa tunnelmissa. Vuosi 1999 alkoikin hyvin, yhdistys puuhasi ahkerasti Saku 99 -tapahtumaa ja Jim Collas rohkaisi joukkoja Amigan uutena johtohahmona. Harmaita pilvi&auml; alkoi kuitenkin kasaantua syksyn pimetess&auml;, kunnes vuoden vaihtuminen pudotti j&auml;lleen uutispommin...<br>
				<br>
				Perinteisesti olemme tarkastelleet edellist&auml; vuotta aina vuoden ensimm&auml;isess&auml; Saku-lehdess&auml;, emmek&auml; tee poikkeusta nytk&auml;&auml;n. Aikaisemmista saavutuksista kiinnostuneiden kannattaa tutustua my&ouml;s vuoden 1998 raporttiin Saku-lehden numerossa #27 (1/99) sek&auml; yhdistyksen kattavaan historiakatsaukseen numerossa #25 (2/98).
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="#b0c4de" align="center">
				<font color="black"><b>Kotisivut uudistuivat</b></font>
			</td></tr>

			<tr><td width="50%" bgcolor="#d8ecfd">
				Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n kotisivut (<a href="http://batman.jytol.fi/~saku/" target="_top">http://batman.jytol.fi/~saku/</a>) uudistuivat edellisen kerran vuonna 1997, jolloin hajanaiset Saku-arkistojen rippeet yhdistettiin kerralla yhdistyksen k&auml;yntikortiksi, Saku-lehtien kirjastoksi ja Amiga-k&auml;ytt&auml;jien uutispalveluksi. Kokonaisuus alkoi kuitenkin paisua hallitsemattomaksi, ja niinp&auml; vuoden 1999 kev&auml;&auml;ll&auml; yhdistyksen silloinen varapuheenjohtaja Janne Sir&eacute;n toteutti toisen sivu-uudistuksen ja kehitti avukseen joukon pieni&auml; apuohjelmia, joilla uudistuneita sivuja voitiin k&auml;sitell&auml; selv&auml;sti aikaisempaa tehokkaammin. Uudet sivut otettiin k&auml;ytt&ouml;&ouml;n toukokuussa.<br>
				<br>
				Kev&auml;&auml;ll&auml; tarjottiin my&ouml;s vuonna 1998 esitelty&auml; Saku-romppua postitse niille, jotka eiv&auml;t sit&auml; edellisvuoden tapahtumissa olleet ehtineet lunastaa. Janne Sirénin koostaman rompun lis&auml;monistamisesta ja postimyynnist&auml; vastasi menestyksekk&auml;&auml;sti Jarmo Piippo. Lis&auml;ksi hallitus kokoontui kev&auml;&auml;ll&auml; ahkerasti ja yhdistyksen turhaksi k&auml;yneet Amiga 2000 -laitteistot valmisteltiin myyt&auml;v&auml;ksi; yksi saatiin kaupaksikin.<br>
				<br>
				<center><img src="kuvat/vuosi1999_1.jpg" width="400" height="311" alt=""></center><br>
				Kes&auml; k&auml;ytettiin hallituksen ja avustajien piiriss&auml; Saku 99 -tapahtuman valmisteluissa, ja piipahtivatpa Janne Sir&eacute;n ja Janne Pikkarainen my&ouml;s Lontoon World of Amiga '99 -messuilla, josta he raportoivat suoraan Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n kotisivuille Internetin ja matkapuhelinten v&auml;lityksell&auml;. Suositun World of Amiga '99 -p&auml;iv&auml;kirjan p&auml;ivitt&auml;misess&auml; auttoi Anu Seilonen, ja p&auml;iv&auml;kirja l&ouml;ytyy paitsi yhdistyksen kotisivuilta, my&ouml;s Saku-lehden numerosta #30 (4/99).
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="#b0c4de" align="center">
				<font color="black"><b>Petro peruuntui</b></font>
			</td></tr>

			<tr><td width="50%" bgcolor="#d8ecfd">
				Elokuussa 1999 j&auml;rjestetiin pienimuotoinen vuosikokous, ensimm&auml;ist&auml; kertaa yhdistykselle ilmaisessa taloyhti&ouml;n kerhotilassa Espoossa. Kokouksesta oli ensimm&auml;ist&auml; kertaa my&ouml;s yhteys Internetiin IRC-kanavan ja web-kameran voimin. Pienen mutta pippurisen kokouksen p&auml;&auml;tteeksi katseltiin joukko Amiga-aiheisia videofilmej&auml;. Ilmaiset, joskin aikaisemmin k&auml;ytetty&auml; Heurekaa selv&auml;sti vaatimattomammat tilat osoittautuivat kokousten vuosittain toistuvan, hyvin pienen osanoton valossa j&auml;rkev&auml;ksi ratkaisuksi.<br>
				<br>
				<center><img src="kuvat/vuosi1999_2.jpg" width="200" height="267" alt=""></center><br>
				Vuosikokouksessa viel&auml; haettiin videonauhalta tunnelmaa Jim Collasin kev&auml;isest&auml; puheesta, mutta vain muutama p&auml;iv&auml; kokouksen j&auml;lkeen saimme lukea Internetist&auml; Collasin eronneen Amigan johdosta. P&auml;iv&auml;&auml; my&ouml;hemmin Janne Sir&eacute;n sai puhelinsoiton Amigalta Saksasta - tapauksen vuoksi Petro Tyschtschenko joutui perumaan seuraavalle viikonlopulle Saku 99:n yhteyteen sovitun vierailunsa Suomeen.<br>
				<br>
				J&auml;rkytyksest&auml; kuitenkin toivuttiin, ja Saku 99:ss&auml; oli edelleen mukana yksi ulkomainen vieras, saksalainen Individual Computersin Jens Sch&ouml;nfeld, ja Petro Tyschtschenkokin saatiin puhumaan Heurekan auditoriossa puhelimen v&auml;lityksell&auml;. Syyskuun ensimm&auml;isen&auml; viikonloppuna j&auml;rjestetty Saku 99 ker&auml;si Vantaan tiedekeskus Heurekalta vuokrattuihin, aikaisempaa suurempiin tiloihin arviolta 400-600 henkil&ouml;&auml; ja onnistui lukuisista takaiskuista, kuten laitteiston rikkoontumisista ja yhteisty&ouml;kumppanien peruutuksista huolimatta erinomaisesti. Ty&ouml;ryhm&auml; sai todella onnitella itse&auml;&auml;n: vaikeuksien kautta voittoon.<br>
				<br>
				<center><img src="kuvat/vuosi1999_3.jpg" width="400" height="300" alt=""></center><br>
				Tapahtuman muita kohokohtia olivat mm. AmigaOS 3.5:n ennakkoversion esittely, Amigatorin ja Gentle Eye Ky:n myyntip&ouml;yd&auml;t, Petsoff LP:n Delfina Plus -&auml;&auml;nikortti sek&auml; turkulaisen Elys&eacute;e Arenan k&auml;ytt&auml;m&auml;n Amiga-laitteiston demonstraatio. Tapahtumassa esitettiin my&ouml;s Commodoren konkurssista kertova Deathbed Vigil -videofilmi, arvottiin kaksi uutta Amigan lahjoittamaa A1200-pakettia, jaettiin kymmenitt&auml;in Amigan promotuotteita, kuten levyj&auml;, AmiCola-t&ouml;lkkej&auml;, sukkia, boksereita, hiirimattoja, hiiri&auml;, julisteita jne. Mukana olivat lis&auml;ksi tutut pelikilpailut, upouusi Saku-romppu, PowerPC Linux -demo, A1000-historiaosasto sek&auml; IRC-yhteys ja web-kamera.<br>
				<br>
				Tarkemmin Saku 99:n mittavista j&auml;rjestelyist&auml; on kerrottu Saku-lehden numerossa #30 (4/99). Samaisessa numerossa on my&ouml;s yksityiskohtainen lista tapahtuman tekoon osallistuneista henkil&ouml;ist&auml; ja heid&auml;n teht&auml;vist&auml;&auml;n.
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="#b0c4de" align="center">
				<font color="black"><b>Valta vaihtui</b></font>
			</td></tr>

			<tr><td width="50%" bgcolor="#d8ecfd">
				Elokuisessa vuosikokouksessa valittu uusi hallitus astui valtaan kokouksen p&auml;&auml;t&ouml;ksell&auml; viiv&auml;stetysti Saku 99 -tapahtuman j&auml;lkimaininkien laannuttua. Syksy kuluikin tehden t&ouml;it&auml; kulissien takana vanhan tietotaidon siirt&auml;misess&auml; eteenp&auml;in merkitt&auml;vilt&auml; osin uusiutuneelle hallitukselle. Muistiot ja oppaat osoittautuivat kultaakin arvokkaammiksi, joten tehdyn ty&ouml;n kirjaaminen kannattaa jatkossakin.<br>
				<br>
				<center><img src="kuvat/vuosi1999_4.jpg" width="400" height="263" alt=""></center><br>
				Vaikka Amiga-maailma olikin ajautunut Collasin eron j&auml;lkeen entist&auml; ep&auml;varmempaan ja synke&auml;mp&auml;&auml;n tilaan, juhlistettiin joulukuussa vuoden p&auml;&auml;ttymist&auml; hallituksen j&auml;senen Timo Kemppaalan aloitteesta pienimuotoisella pikkujoulutilaisuudella Espoossa. Paikalla oli Amiga-tuotteineen Gentle Eye Ky, ja yhdistys sponsoroi virvokkeita sek&auml; AmigaOS 3.5 -demonstraation ja Amiga-aiheisia videoesityksi&auml;.<br>
				<br>
				Perinteik&auml;s Saku-lehti jatkoi ilmestymist&auml;&auml;n l&auml;pi vuoden Anu Seilosen toimittamana, ja Risto M&auml;ki-Pet&auml;yksen avustamana palautettiin my&ouml;s lehden HTML-versio tuotantoon. Loppuvuodesta Terho Henriksson suunnitteli lis&auml;ksi uuden, uljaan ulkoasun HTML-pohjaiselle Saku-lehdelle ja hallitus teki p&auml;&auml;t&ouml;ksen tarpeettomaksi k&auml;yv&auml;n AmigaGuide-painoksen siirt&auml;misest&auml; historiaan. Saku-lehtikin on siis vakiintuneesta asemastaan huolimatta edelleen kehityksen tilassa.
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="#b0c4de" align="center">
				<font color="black"><b>Uudelle vuosituhannelle</b></font>
			</td></tr>

			<tr><td width="50%" bgcolor="#d8ecfd">
				Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. jatkaa uudelle vuosituhannelle uuden hallituksen ja uudistuvan Saku-lehden voimin. My&ouml;s tulevista tapahtumaj&auml;rjestelyist&auml; keskustellaan, mutta n&auml;ht&auml;v&auml;ksi j&auml;&auml;, millaiset edellytykset Amiga-maailman tulevaisuus keskusteluille petaa. Amiga-yhteis&ouml;n apatia ja omistajan vaihtuminen her&auml;tt&auml;v&auml;t varmasti itse kussakin ristiriitaisia tuntemuksia, mutta l&auml;hikuukaudet tekev&auml;t meist&auml; toivottavasti viisaampia.<br>
				<br>
				L&auml;mmin kiitos kaikille onnistuneen yhdistysvuoden 1999 toteuttamiseen osallistuneille. Amiga-maailman myllerryksest&auml; huolimatta olemme onnistuneet yll&auml;pit&auml;m&auml;&auml;n tasokasta yhdistystoimintaa, ja paitsi hy&ouml;dyllist&auml;, my&ouml;s hauskaa sellaista. Pidet&auml;&auml;n siit&auml; kiinni jatkossakin. Hyv&auml;&auml; uutta vuotta!<br>
				<br>
				<center><img src="kuvat/vuosi1999_5.jpg" width="400" height="265" alt=""></center>
			</td></tr>
		</table>
		</p>
		<p>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

