<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Amiga500</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="inh0">
<AREA shape="rect" coords="467,1,539,22" href="inhalt.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="inhalt0.gif" alt="" width="640" height="22" border="0" usemap="#inh0">
<HR>

<H3 align="center"><B>A500/A600/A1200 in PC-Geh&auml;use einbauen</B></H3>

<P>Dieser Artikel wendet sich an alle, die - wie ich - eines sch&ouml;nen
Tages vor dem Problem standen, da&szlig; die Ausr&uuml;stung den Umfang des
einst geplanten l&auml;ngst &uuml;berschritten hat. So t&uuml;rmen sich
HDs, Floppys, Modem etc. etc. auf dem Schreibtisch. Zig versch.
Geh&auml;use in noch versch. Farben verschandeln das Computereck und nehmen
unn&ouml;tig viel Platz weg. Ganz zu schweigen von dem Kabelverhau, der
sich vor, hinter, auf, unter und zuweilen im Schreibtisch angeh&auml;uft
hat. Manche Zeitgenossen l&ouml;sen das Problem auf ihre eigene Art. Sie
verscherbeln ihre teuer angeh&auml;ufte Ausr&uuml;stung, nur um auf einen
gr&ouml;&szlig;eren Amiga (mit Desktop-/Tower-Geh&auml;use!) umzusteigen.
So wird mancher voll aufger&uuml;stete A 500 durch einen A 2000 mit
derselben Ausstattung ersetzt, nur weil es einfach praktischer ist. Den
horrenden Geldverlust nimmt man dabei z&auml;hneknirschend in Kauf. Aber
halt !! Es geht auch noch anders: Billiger, schneller, individueller... Und
Spa&szlig; machts auch noch!</P>

<P>(Und PCs sind auch noch zu was nutze dabei !). Wie ? Man baut seinen
Amiga einfach um. Das dies gar nicht mal sooo schwer ist, soll dieser
Artikel zeigen. Er gliedert sich in 3 Teile. Teil 1 ist ein Brief, den ich
auf ein Inserat im Computer-Flohmarkt bekam. Teil 2 bezieht sich auf Teil 1
und verdeutlicht, wie ich bei meinem Umbau vorgegangen bin. Teil 3 ist ein
weiterer Brief, der den Umbau in einen Tower beschreibt. Die Anleitungen
sind zwar vorrangig f&uuml;r den A 500 (Tower: A 2000) geschriben worden;
allerdings d&uuml;rfte die Abwandlung f&uuml;r den A 600/A 1200 keine all
zu gro&szlig;en Schwierigkeiten bereiten. Einziges gr&ouml;&szlig;eres
Problem d&uuml;rfte sein, den PCMCIA-Steckplatz nach au&szlig;en zu
f&uuml;hren, was wohl unter Zuhilfenahme einer S&auml;ge oder Fr&auml;se zu
meistrern sein sollte. Aber jetzt zur Anleitung. Nachfolgend der Brief:</P>

<P>Zu deiner Frage einen A500 in ein PC-Geh&auml;use einzubauen, kann man
grunds&auml;tzlich 'ja - es geht, aber nicht problemlos' sagen. Ich selbst
habe meinen A500 in ein PC Geh&auml;use eingebaut und er verrichtet bereits
seit zwei Jahren ohne St&ouml;rung seine Arbeit. Aber...</P>

<P>Es braucht eine Menge Geduld und eigene Ideen.</P>

<P>Ich m&ouml;chte dir hier mal meinen Umbau beschreiben.</P>

<H3><B>Geh&auml;use</B></H3>

<P>Als erstes besorgte ich mir ein PC-Geh&auml;use. Dieses ist ein
sogenanntes PC-Klappgeh&auml;use, das es bei CONRAD-Electronic f&uuml;r
60-70 DM zu kaufen gibt. Klappgeh&auml;use deshalb, weil sich der obere
Teil des Geh&auml;uses mit einem Scharnier nach hinten klappen
l&auml;&szlig;t und man einfachen Zugang zur Elektronik hat. Nat&uuml;rlich
ist theoretisch auch ein Einbau in ein A1000 bzw. A200 Geh&auml;use
machbar, aber es d&uuml;rfte recht schwierig werden ein A2000 Geh&auml;use
aufzutreiben und von einem A1000 Geh&auml;use rate ich wegen der niedrigen
Bauform ab (Je h&ouml;her je besser; aus Gr&uuml;nden, die ich sp&auml;ter
noch beschreiben werde. siehe Expansion-Bus). Grunds&auml;tzlich ist jedes
PC-Geh&auml;use brauchbar, dessen Grundfl&auml;che wenigstens ein paar
Zentimeter gr&ouml;&szlig;er ist als die Hauptplatine des Amiga. Einer
meiner Freunde hat sich bei einem H&auml;ndler ein PC-40 Geh&auml;use
besorgt und konnte sogar noch seine Festplatte (Macrotec) ohne
gr&ouml;&szlig;ere Umbauten am ExpansionBus anstecken.</P>

<H3><B>Netzteil</B></H3>

<P>Selbst bei einem gro&szlig;en Geh&auml;use ist es praktisch
unm&ouml;glich das Amiga Netzteil mit in das Geh&auml;use zu bauen. Auch
die von verschiedenen Anbietern erh&auml;ltlichen XT/AT-Netzteile brauchen
zuviel Platz, deshalb ist es g&uuml;nstiger das Netzteil zu lassen wie es
ist und nur eine Steckbuchse f&uuml;r den Anschlu&szlig; des Netzteils
vorzusehen. Dazu gen&uuml;gt eine g&auml;ngige 5polige DinBuchse, aber
sicherer ist eine Buchse, die sich nach dem Zusammenstecken verriegeln
l&auml;&szlig;t (kostet ein paar Mark mehr, aber man ist auf der sicheren
Seite).</P>

<H3><B>Tastatur</B></H3>

<P>Man besorgt sich ein Tastaturgeh&auml;use, welches die normale A500
Tastatur aufnehmen kann (gibts bei verschiedenen Herstellern, ist aber
nicht ganz billig; ca 150 DM ). Dies bedeutet den geringsten Aufwand. </P>

<TABLE border="0" summary="">
<TR>
<TD colspan="2">Bei der Tastatur gibt es
mehrere M&ouml;glichkeiten:</TD>
</TR>

<TR>
<TD valign="top">1.</TD>
</TR>

<TR>
<TD valign="top">2.</TD>

<TD>Man kauft ein AT-TastaturInterface (ca. 50 DM) und eine AT-Tastatur
(ca. 100 - 150 DM). Dazu ist zu sagen, da&szlig; es zum damaligen Zeitpunkt
nicht ganz einfach war eine AT-Tastatur zu finden, die mit dem Interface
zur Zusammenarbeit zu bewegen war. Au&szlig;erd em liegen die Amiga-Tasten
dann auf den Funktionstasten F11 und F12 und die Laufwerks LED des DF0: und
die Power LED sind ebenfalls im Interface untergebracht und m&uuml;ssen
extra ins PC-Geh&auml;use eingebaut werden. (Dies ist die L&ouml;sung eines
meiner Freunde.)</TD> </TR>

<TR>
<TD valign="top">3.</TD>

<TD>Kann man eine A2000 Tastatur auftreiben (Preis so um die 100 Mark), so
kann man auch diese anschlie&szlig;en, aber man mu&szlig; beachten,
da&szlig; die Anschlu&szlig;belegung der beiden Tastaturen grundverschieden
ist und man ohne ein Hardwarehandbuch oder dem Handbuch zum A 2000, in dem
wie im 500er Handbuch auf den letzten Seiten ein paar primitive
Schaltpl&auml;ne, u.a. auch die Anschlu&szlig;belegung der Tastatur, zu
finden ist, und einige Kenntnisse der Elektronik ziemlich aufgeschmissen
ist. Au&szlig;erdem ist es nicht m&ouml;glich, mit LAmiga-RAmiga-Ctrl einen
Reset auszul&ouml;sen, da bei der 2000er Tastatur keine Resetleitung
vorhanden ist. Man kann aber in das Geh&auml;use einen Tastschalter
einbauen, der mit der Resetleitung des Tastatursteckers auf der
Hauptplatine des 500ers auf der Einen und m it Masse auf der anderen Seite
verbunden werden mu&szlig; und so einen Reset ausl&ouml;sen. Auch die
Caps-Lock-LED verweigert beharrlich den Dienst aber damit kann man leben.
Ebenso mu&szlig; die Power-LED und die Laufwerks-LED, deren Anschl&uuml;sse
eben falls auf dem Tastaturstecker der Hauptplatine liegen woanders
eingebaut werden. (So habe ich es bei mir gel&ouml;st.)</TD>
</TR>
</TABLE>

<P>Meiner Meinung nach ist die einfachste L&ouml;sung sich wie in 1.
beschrieben ein Tastaturgeh&auml;use f&uuml;r die alte Tastatur zu
besorgen. Man spart sich den &Auml;rger mit den LED's ebenso wie das
endlose studieren von Handb&uuml;chern und Steckerbelegungen (Gut gemeinter
Rat ... auch wenn's ein bi&szlig;chen teurer ist). Auf jeden Fall sollte
eine entsprechende Buchse (z.B. Einbau-DIN-Buchse wie bei Stereoanlagen)
zum Anstecken der Tastatur an der Frontblende angebracht werden.</P>

<H3><B>Laufwerke</B></H3>

<P>Zu diesem Thema ist zu sagen, da&szlig; es ebenfalls gr&ouml;&szlig;erer
Anstrengung bedarf eine Blende f&uuml;r das interne df0: Laufwerk
aufzutreiben, welches ja nun ebenfalls in das PC-Geh&auml;use eingebaut
werden mu&szlig; und ohne Blende ziemlich 'bescheiden' aussieht. (Mir ist
es auch erst nach l&auml;ngerem Suchen gelungen so'n Ding aufzutreiben, das
ich dann auch noch nur unter Zuhilfenahme von S&auml;ge und Feile in den
Einbaurahmen einpassen konnte. Es lebe der Sekundenkleber... ) Um das oder
die Laufwerk(e) einzubauen ben&ouml;tigt man meist noch entsprechende
Einbaurahmen, da die zugeh&ouml;rigen Halterungen und Ausschnitte in den
meisten PC-Geh&auml;usen auf 5 1/4" Laufwerke zugeschnitten sind. Diese
Rahmen kosten pro Laufwerk auch noch mal so um die 30 DM. Beim Einbau von
Df0: ist darauf zu achten, da&szlig; man evtl. auch die Laufwerks-LED
gleich mit einbaut. Au&szlig;erdem braucht man evtl. noch ein l&auml;ngeres
Anschlu&szlig;kabel f&uuml;r die Floppy und die Floppystromversorgung. Dies
kommt aber auf die Einbaulage der Hauptplatine an und sollte erst einmal
ausprobiert werden. Diese Kabel gibts im Versandhandel oder bei den meisten
Computerh&auml;ndlern. Beim Abziehen der Kabel unbedingt auf die Polung
achten. Sowieso ist es am Besten bei allen Kabeln genau buchzuf&uuml;hre n,
wie sie auf den entsprechenden Stecker geh&ouml;ren!</P>

<H3><B>Anschl&uuml;sse</B></H3>

<P>Die ganzen Anschl&uuml;sse des Amigas m&uuml;ssen logischerweise
herausgef&uuml;hrt werden. Das bedeutet eine ganze Menge L&ouml;tarbeit,
wenn man nicht bei jedem Ein- und Ausstecken, z.B. des Druckers, das
Geh&auml;use &ouml;ffnen will. Man mu&szlig; sich also zu jedem
Anschlu&szlig;, der auf der R&uuml;ckseite des Amigas ist ein passendes
Kabel mit Buchse und Stecker l&ouml;ten (soweit ich wei&szlig;, gibts die
nicht fertig zu kaufen). Dabei mu&szlig; man unbedingt aufpassen, da&szlig;
man sauber arbeitet, um Kurzschl&uuml;sse, welche die CIA's 8520
besch&auml;digen k&ouml;nnten, zu vermeiden. Also lieber noch mal mit einem
Multimeter durchmessen! Einfacher geht es mit Flachbandkabel und
Steckern/Buchsen auf die man das Kabel einfach aufpressen kann (Gibt's
ebenfalls bei CONRAD-Elektronik, aber auch in den meisten
Elektronik-Fachgesch&auml;ften. Ich w&uuml;rde es das n&auml;chste mal auf
jeden Fall so machen!). Ebenso ben&ouml;tigt man noch verschiedene
Slotbleche. Dies sind schmale Blechstreifen, die genau in die hinteren
Aussparungen f&uuml;r Steckkarten passen und die es bereits fertig
ausgeschnitten und zur Befestigung der Sub-D-Buchsen und Stecker
vorbereitet, gibt. Sie erm&ouml;glichen die stabile Befestigung der
herausgef&uuml;hrten Stecker und Buchsen.</P>

<H3><B>Hauptplatine</B></H3>

<P>Zum Einbau der Hauptplatine habe ich erst mal die Laufwerkshalterung im
PC-Geh&auml;use &auml;ndern m&uuml;ssen, da dieses genau da, wo die
Hauptplatine hin sollte, ein F&uuml;&szlig;chen hatte. Dazu habe ich mir
aus Blech ein "Z" gebogen und damit die Halterung wieder angeschraubt.
Somit war dieses Problem schon mal beseitigt. Nun mu&szlig; man die Platine
so hineinlegen wie sie sp&auml;ter einmal aussehen soll und die Bohrungen
anzeichnen. Unbedingt darauf achten, da&szlig; auf der linken Seite, also
am Expansion-Bus noch drei bis vier Zentimeter Platz bleiben. Man nimmt am
besten alle Befestigungspunkte wie im originalen Geh&auml;use, damit sich
die Platine sp&auml;ter nicht durchbiegt und evtl. Leiterbahnen brechen.
Ich habe meine Platine mit Kunststoffabstandshaltern in 'Snap-In-Technik'
befestigt. Somit hat man keine Probleme mit Muttern, die nicht auf die
Schrauben wollen oder Kunststoffr&ouml;llchen, die, wie der Name schon
sagt, gern davonrollen. Au&szlig;erdem ist die L&ouml;tseite vor
unbeabsichtigten Kontakt mit dem Geh&auml;use sicher. Ist eine interne
Ram-Erweiterung vorhanden sollte man an die Stelle, an die sie sp&auml;ter
zu liegen kommt, einen Streifen Schaumgummi aufkleben, da man sie mangels
Bohrung meist nicht befestigen kann und man unbedingt einen Kontakt mit dem
Geh&auml;use vermeiden mu&szlig;.</P>

<P>Bei meinem PC-Klappgeh&auml;use von CONRAD-Elektronik war es eine
gr&ouml;&szlig;ere Spielerei die Platine unter die Laufwerkshalterung zu
bekommen aber mit Hilfe eines Freundes und der 'einer - schiebt - der
-andere - zieht - aber - vorsichtig' - Technik ist es dann doch gelungen.
Anschlie&szlig;end k&ouml;nnen die Laufwerke montiert und deren Kabel
(richtigherum !!) auf die Hauptplatine aufgesteckt werden. Auch kann man
nun die Adapterkabel und die Slotbleche montieren sowie das
Verbindungskabel zum Netzteil und zur Tastaturbuchse. Au&szlig;erdem evtl.
die Anschl&uuml;sse zur Power-LED, wenn nicht sowieso in der Tastatur
vorhanden (siehe oben) und zum Reset-Taster. Diese Arbeiten sollten, wie
eigentlich alles, mit gr&ouml;&szlig;ter Sorgfalt und erst wenn man sich
absolut sicher ist wieherum ein Kabel aufgesteckt werden mu&szlig;,
ausgef&uuml;hrt werden. (Ich spreche da aus schlimmer Erfahrung...viel
Weh!!! ...sp&auml;ter mehr dazu.)</P>

<H3><B>ExpansionBus</B></H3>

<P>Tja... Das ist ein Fall f&uuml;r sich. Soll externe Peripherie
angesteckt werden, so mu&szlig; man sich ein Busverl&auml;ngerungskabel
besorgen. Vom Selbstbau rate ich ab, da es nicht besonders witzig ist,
zweimal 86 Kabel an einen Stecker und ein St&uuml;ck zweiseitiger Platine
anzul&ouml;ten, zumal es nicht einfach ist einen 86poligen Platinenstecker
zu bekommen von einer entsprechend breiten zweiseitigen Platine gar nicht
zu reden. Au&szlig;erdem mu&szlig; man auf Feinschl&uuml;sse besonders
achten, weil zum L&ouml;ten zwischen den Beinchen nicht besonders viel
Platz bleibt. Ich habe mir damals meinen Platinenstecker aus zwei
abges&auml;gten und zusammengeklebten St&uuml;cken 'gebastelt', ebenso die
Platine (Wo w&auml;re ich ohne Sekundenkleber...?). Jedesmal, wenn ich
meine Festplatte oder meine externe Speiche rerweiterung ausbaue,
verabschieden sich garantiert ein oder zwei Kabel. (lieber einmal 100 DM
setzen und dann Ruhe haben...)</P>

<P>Nun stellt sich die Frage, wohin mit der Peripherie? Ich habe mir eine
zweite Ebene in das Geh&auml;use eingebaut. Dazu habe ich mir in einem
Heimwerkermarkt ein paar Alu-U-Schienen gekauft und erst einmal von links
nach rechts zwei St&uuml;ck ungef&auml;hr auf der H&auml;lfte der
Geh&auml;useh&ouml;he und links und rechts vom Expansion-Bus eingebaut. Der
Abstand der Schienen zueinander h&auml;ngt von der Breite des
Expansion-Bus-Kabels ab, welches auf jeden Fall dazwischen passen
mu&szlig;. Anschlie&szlig;end werden zwei weitere Schienen abges&auml;gt,
die ungef&auml;hr die L&auml;nge der Peripherieplatine haben sollten. Dann
wird der Abstand der Befestigungsbohrungen der Peripherie ausgemessen, die
zwei Schienen auf den anderen zwei Schienen im 90 Grad Winkel angeschraubt
und die Befestigungsl&ouml;cher angezeichnet und gebohrt. Diese Arbeiten
m&uuml;ssen unbedingt vor dem Einbau der Hauptlatine und der anderen
Ger&auml;te geschehen, da Bohrsp&auml;ne auf jeden Fall absolut
t&ouml;dlich sind; zumindest f&uuml;r den Amiga. Beim Anstecken mu&szlig;
man besonders aufpassen, da die Anschl&uuml;sse des Expansi on-Bus um
zweimal 90 Grad gedreht auf der zweiten Ebene ankommen!!! (Das ist nicht
nur so'n Spruch. Auf diese Weise habe ich meine externe 4Mb
Speichererweiterung in die ewigen Jagdgr&uuml;nde gesendet. Na gut... war
'n bi&szlig;chen &uuml;bertrieben aber 70 DM, weil's d ie PAL's zerlegt
hat, und ein halbes Jahr Wartezeit hat mich der Spa&szlig; gekostet. Mich
hat's aber ehrlich gewundert, da&szlig; dem Amiga nichts passiert ist. Das
nur zur Warnung...) Am besten erstmal so Anstecken als ob man das
zus&auml;tzliche Ger&auml;t neben das Geh&auml;use stellen wollte und dann
im angesteckten Zustand entsprechend drehen und mit Abstandhaltern
befestigen.</P>

<P>Soll eine Festplatte eingebaut werden empfiehlt es sich einen
L&uuml;fter einzubauen. Am besten einen 220Volt Pabst-L&uuml;fter. Der ist
ziemlich leise und es ergeben sich keine Probleme mit der Stromversorgung.
Aber Achtung: 220 Volt ist eine gef&auml;hrliche Sache. Also lieber einmal
einen Fachmann fragen! Der L&uuml;fter mu&szlig; mit einem
L&uuml;fterschutzgitter nach au&szlig;en hin abgedeckt werden, damit man
nicht die Finger hineinbringen kann. Bei einem 220Volt L&uuml;fter ist
richtig Power dahinter!!</P>

<P>Soviel zu meinem Umbau.</P>

<P>Sollten weitere Fragen auftauchen bin ich unter 08261/5339 ab ca. 16Uhr
zu erreichen. (Keine Angst, ich bei&szlig; nicht...)</P>

<P>Also viel Gl&uuml;ck, eine ruhige Hand und gute Nerven w&uuml;nscht
Dir</P>

<P>Norbert Dimpfl</P>

<P>Nach dieser Anleitung bin ch vorgegangen, habe allerdings auch einige
&Auml;nderungen vorgenommen. Diese sind nachfolgend beschrieben:</P>

<H3><B>ERG&Auml;NZUNG ZUR UMBAUANLEITUNG "AMIGA 500 IN
PC-GEH&Auml;USE"</B></H3>

<P>Bei folgenden Punkten bin ich von Norberts Anleitung abgewichen.
Nachfolgend wird beschrieben, was ich anders gemacht habe und weshalb.
Sollte jemand weitere Ideen, Tips, Bezugsquellen f&uuml;r Teile etc. haben,
soll er sich bitte an mich wenden. Ich habe vor, so etwas wie eine
"Amiga-Umbau-Datenbank" aufzubauen, auf die sp&auml;ter jedermann gegen
Unkostenerstattung Zugriff hat.</P>

<P>Meine Adresse: Joachim Schwanter, Keilbergweg 5, D - 83301 Traunreut</P>

<P>Bitte R&uuml;ckporto und 2 DM f&uuml;r Kopierkosten (nur bei Anforderung
von Anleitung) nicht vergessen, ansonsten kann keine Bearbeitung erfolgen
!!</P>

<H3><B>1.: Das Geh&auml;use</B></H3>

<P>Von allen genannten Alternativen rate ich zum Klapp-Geh&auml;use. Es
erleichtert sp&auml;tere &Auml;nderungen, Kontrollen etc. Ein L&uuml;fter
war bei mir neulich binnen 2 Minuten montiert -ohne Abbauen des ganzen
Systems, Schrauberei etc. Das Herumbasteln im LAUFENDEN Computer sollte auf
jeden Fall unterlassen werden - es kann f&uuml;r Mensch und Maschine
lebensgef&auml;hrlich sein!!! Beim Geh&auml;use ist es wie mit Klamotten:
Lieber eine Nummer zu gro&szlig;. La&szlig;t Euch keine Slimline- oder
Babygeh&auml;use andrehen -f&uuml;r unseren Zweck unbrauchbar !</P>

<H3><B>2.: Das Netzteil</B></H3>

<P>Entgegen Norberts Angaben ist es mir doch gelungen, mein
PC-Schaltnetzteil mit ins Geh&auml;use zu zw&auml;ngen. Allerdings habe ich
ein Riesengeh&auml;use und es war Millimeter-Arbeit. Au&szlig;erdem
bl&auml;st der L&uuml;fter nach innen statt nach drau&szlig;en. Drum habe
ich mir noch einen 2. L&uuml;fter eingebaut. Au&szlig;erdem solltet Ihr das
Netzteil gut gegen Wackeln oder gar Umfallen sichern, wenn es - wie bei
mir- nicht festgeschraubt werden kann. Zum Sichern nur NICHTLEITENDE
Materialien verwenden, z. B. Styropor oder Holz. Die Kante der Platine habe
ich, wo sie das Netzteil ber&uuml;hren k&ouml;nnte, mit Isolierband
&uuml;berklebt. Au&szlig;erdem habe ich das Netzteil an derselben Stelle
ebenfalls mit Isolierband beklebt und dazwischen ein St&uuml;ck Styropor
geklemmt. Zus&auml;tzlich wurde das Netzteil mit doppelseitigem Klebeband
am Geh&auml;useboden und an der rechten Geh&auml;usewand fixiert.</P>

<H3><B>3.: Die Tastatur</B></H3>

<P>Hier habe ich mir am wenigsten Arbeit gemacht und ein fertiges
Geh&auml;use gekauft. Das Kabel von der Hauptplatine zur Tastatur, welches
man h&ouml;chstwahrscheinlich selber bauen mu&szlig;, sollte mindestens 2 m
lang sein.</P>

<H3><B>4.: Die Laufwerke</B></H3>

<P>Solltet Ihr Euer Geh&auml;use lackieren oder mit Folie bekleben (z. B.
DC-Fix), k&ouml;nnt Ihr die Blende auch aus Pappe oder d&uuml;nnem Plastik
zuschneiden, da man nach der Behandlung den Unterschied ja nicht mehr
sieht. Ansonsten solltet Ihr nach defekten LWs Ausschau halten. Die gibts
billiger (siehe CF) als eine neue Blende (im Elektronikhandel von
10,aufw&auml;rts). Wenn Ihr Gl&uuml;ck habt, pa&szlig;t sie auf Anhieb,
ansonsten m&uuml;&szlig;t Ihr halt mit Feile und S&auml;ge etwas
nachhelfen.</P>

<H3><B>5.: Die Anschl&uuml;sse</B></H3>

<P>Wenn Euer Geh&auml;use tief genug ist und Ihr ein Klappgeh&auml;use
habt, kann man sich das Herausf&uuml;hren der Anschl&uuml;sse sparen. Es
sollten hinter der Platine jedoch mindestens 7 cm Platz zum "St&ouml;pseln"
sein. Solltet Ihr an Eurem Compi oft herumstecken, w&uuml;rde ich auch eher
Norberts Methode durchf&uuml;hren. Aber wer steckt schon dauernd z. B.
Netzstecker oder Monitor um ? F&uuml;r die Joysticks gibt es z. B. Weichen.
Da hat man nicht nur l&auml;ngere Kabel, sondern kann an 1 Buchse 2 Joys
anschlie&szlig;en, ohne umstecken zu m&uuml;ssen. F&uuml;r den Port 1
w&uuml;rde ich einen Umschalter Maus/Joy empfehlen (da funktioniert die
Weiche nicht !!), dessen Buchsen und Schalter man an der
Geh&auml;user&uuml;ckwand befestigen kann. Die anderen Kabel lassen sich
leicht durch vorhandene L&ouml;cher im Geh&auml;use herausf&uuml;hren.</P>

<H3><B>6.: Die Hauptplatine</B></H3>

<P>Ich hatte das Problem, da&szlig; in meinem Geh&auml;use die PC-Platine
auf 2 etwa 0,5 cm hohen Schienen montiert war. Diese Schienen sind am
Geh&auml;useboden festgeschwei&szlig;t. Was tun ? Als erstes werden die
beiden Schienen mit Isolierband beklebt, und zwar so, das kein Kontakt
zwischen aufliegender Platine und Schiene entstehen kann. Dann werden dort,
wo die Platine &uuml;ber die Schienen hinaussteht (bei mir rechte
Geh&auml;useh&auml;lfte und vorn) Filzpl&auml;ttchen oder
Gummif&uuml;&szlig;chen (beides im Heimwerkermarkt erh&auml;ltlich)
aufgeklebt. Die Pl&auml;ttchen oder F&uuml;&szlig;chen d&uuml;rfen
selbstverst&auml;ndlich ebenfalls nur eine H&ouml;he von 0,5 cm haben ! Ich
habe die Filzpl&auml;ttchen dort hingeklebt, wo die Platine im alten
Geh&auml;use festgeschraubt war. Au&szlig;erdem habe ich auch noch ein paar
in die Zwischenr&auml;ume, z. B. unter der CPU wegen meiner Turbokarte,
zwischen den Schienen etc. verteilt. Durch die Bohrungen habe ich dann die
Schrauben in den Filz bzw. Gummi hineingedreht. H&auml;lt besser, als es
den Anschein hat ! Hierbei eignen sich Gummif&uuml;&szlig;chen
nat&uuml;rlich besser, da Gummi h&auml;rter als Filz ist. Aber wer seinen
Compi nicht st&auml;ndig transportiert, dem kann dies eigentlich egal sein,
da hier die Verschraubung nicht au&szlig;erordentlich belastet wird. Beim
Einbau habe ich das Plastik, welches im alten Geh&auml;use zwischen
Abschirmblech und Platinenunterseite war, an der Platine gelassen (zur
Sicherheit). Au&szlig;erdem kann man so &uuml;bersch&uuml;ssige Kabel (z.
B. das ewig lange Netzkabel) unter die Platine hineinschieben, ohne Platine
oder Kabel zu gef&auml;hrden.</P>

<P>Ansonsten bin ich der Anleitung von Norbert gefolgt, die mir im
&uuml;brigen gro&szlig;e Dienste geleistet hat. Nun w&uuml;nsche ich viel
Spa&szlig; beim Basteln und w&uuml;rde mich freuen, wenn Ihr mir Eure
Erfahrungen, Tips etc. zusendet.</P>

<P>Sollte jemand irgendwelche Probleme, Fragen, Anregungen etc. haben:
Bitte an mich wenden (Siehe Anschrift / Tele.-Nr. am Anfang dieses
Artikels). Au&szlig;erdem bin ich per DF&Uuml; erreichbar; und zwar in der
Box HIGH VOLTAGE, Tel.-Nr. 08642/1336, Username: BORGWARD. Ihr k&ouml;nnt
mir Mails, Texte, Pics etc. an meine PM senden; ich antworte so schnell wie
m&ouml;glich.</P>

<P>Ich kann auch ben&ouml;tigte Teile, von der Schraube &uuml;ber
L&uuml;fter, LW-Blenden bis hin zum DeskTop- /BigTower-Geh&auml;use billig
&uuml;ber eine Computerrecycling-Firma besorgen. Ein paar Preisbeispiele:
3,5"-LW-Blende 0,20 DM, 12V-L&uuml;fter 3,- an DM, BigTower-Geh&auml;use
von NCR, 80 * 60 * 20 cm; ohne Netzteil 50,- DM, mit
400-Watt-Schaltnetzteil 100,- DM usw. usw. Bei gr&ouml;&szlig;eren Mengen
Rabatte!</P>

<TABLE border="0" width="100%" summary="">
<TR>
<TD colspan="2">Zum Abschlu&szlig; nun noch
die Anleitung zum Umbau in einen Tower:</TD>
</TR>

<TR>
<TD colspan="2">&nbsp;<BR>
<U><B>Umbau des Amiga 2000 zum
Tower</B></U></TD>
</TR>

<TR>
<TD valign="top">Ben&ouml;tigtes
Werkzeug:</TD>

<TD>1. Schraubendreher<BR>
2. Messer oder Schere<BR>
3. L&ouml;tkolben<BR>
4. Feins&auml;ge<BR>
5. Schl&uuml;sselfeilen</TD>
</TR>

<TR>
<TD valign="top">Ben&ouml;tigtes
Material:</TD>

<TD>1. Kabelreste(verschiedenster
Querschnitte)<BR>
2. Isolierband<BR>
3. L&ouml;tzinn<BR>
4. Abreibeschriftsymbole<BR>
5. Plastikkleber<BR>
6. Baupappe (beige)<BR>
7. Klettband<BR>
8. Schalter, Taster /je nach Bedarf)</TD>
</TR>

<TR>
<TD valign="top">Alle ben&ouml;tigten
Teile<BR>
k&ouml;nnen z.B. bezogen<BR>
werden &uuml;ber:</TD>

<TD>Firma<BR>
Conrad Elektronik<BR>
Klaus-Conrad-Stra&szlig;e 1<BR>
92240 Hirschau</TD>
</TR>
</TABLE>

<H3><B>Umbaubeschreibung:</B></H3>

<P>Zuerst werden alle externen Ger&auml;te und Kabel (Monitor,Maus pp.)
entfernt.Nun stellt man den Rechner mit zugewandter Frontseite auf eine
gro&szlig;e, ebene Arbeitsfl&auml;che. Um die Arbeiten durchf&uuml;hren zu
k&ouml;nnen, mu&szlig; die Technik des Amigas freigelegt werden. Zu diesem
Zweck l&ouml;sen wir die 4 Schrauben, die sich links und rechts an den
Geh&auml;usew&auml;nden befinden.Anschlie&szlig;end zieht man die
Ger&auml;teverkleidung langsam und vorsichtig nach vorn ab. Das Innenleben
des Amigas liegt nun frei und zug&auml;nglich vor uns.Die Abdeckung wird
f&uuml;r die n&auml;chsten Arbeitsschritte nicht ben&ouml;tigt, weshalb sie
neben der Tischplatte abgestellt werden kann.Unsere Aufmerksamkeit gilt
nunmehr der Poweranzeige des Amigas und zwar genau dort, wo die Power-LED
und die Harddisk-LED montiert sind. Wir l&ouml;sen den Stecker der
Power-LED vom Motherboard ab. Falls notwendig, auch den Stecker der
Festplatte-LED. Zur Denontage des Anzeigenelementes m&uuml;ssen die
Befestigungshaken, die die Anzeige mit dem Rechner verbinden,
zusammengedr&uuml;ckt und gleichzeitig das Anzeigenelement nach vorn
abgezogen werden.</P>

<P>Nun wenden wir uns der 5.25" Schachtblende zu. An dieser Stelle sollen
sp&auml;ter die neuen Bedienungselemente installiert werden. Hierzu
m&uuml;ssen wir das abgestellte Geh&auml;useoberteil zur Hand nehmen. Die
Abdeckung besteht aus einem Metallk&ouml;rper und einem Plastikfrontteil.
Die Befestigungsschrauben des Frontteils werden gel&ouml;st und die Front
herausgenommen. Den Metallk&ouml;rper stellen wir seitlich ab und wenden
uns dem Kunststoffteil zu. Als n&auml;chstes entfernen wir die Schrauben
der 5.25" Schachtblende. So gelangen wir an die Blende, die nunmehr
bearbeitet werden mu&szlig;. Da das LED-Anzeigenelement in einem
Teilbereich der 5.25" Schachtblende untergebracht werden soll, mu&szlig;
die Blende rechtsseitig um ca. 23 mm gek&uuml;rzt werden. Die neuen
Blendenma&szlig;e betragen: 125 mm x 44 mm. Da das Anzeigenelement breiter
als 44 mm ist, mu&szlig; es seitlich befeilt werden. Diese Arbeit sollte
mit gr0&szlig;er Sorgfalt ausgef&uuml;hrt werden, um in der Breite nur
soviel abzunehmen, da&szlig; ein leichter Pre&szlig;sitz im 5.25"
Schachtblendenausschnitt erzeugt wird.</P>

<P>Nun kommt die Entscheidung, welche Schalter auf der eigentlichen Blende
untergebracht werden sollen.In diesem Fall sind es ein Power-Schalter,ein
TV-Umschalter,ein Reset-Taster und ein Kickstart-Umschalter. Hat man sich
&uuml;ber die Art, Anzahl und vor allem die Plazierung der Schalter bzw.
Taster entschieden,m&uuml;ssen dementsprechend gro&szlig;e L&ouml;cher bzw.
Ausschnitte in die Restblende gebohrt und gefeilt werden. Sind alle
Schalter an ihrem Platz, geht es an die Verdrahtung.</P>

<P>Vorsicht beim Power-Schalter, hier liegen 220 Volt an ! Arbeiten hierran
immer nur bei gezogenem Netzstecker durchf&uuml;hren.</P>

<P>&Ouml;ffnen Sie nun die Abschirmung des Netzteils, indem Sie die 6
kleinen Schrauben links und rechts des Geh&auml;uses l&ouml;sen. Verwenden
Sie ausschlie&szlig;lich nur f&uuml;r Netzspannung ausgelegtes
Kabel.L&ouml;sen Sie die beiden Stecker vom Schalter des Netzteils und
verbinden sie mit dem Kabel, welches Sie zuvor mit dem neuen
Powerschalter,der ja nun in der Blende untergebracht ist, verl&ouml;tet
haben.Die neue Verbindung am besten mit Isolierband abisolieren, um die
n&ouml;tige Sicherheit gew&auml;hrleisten zu k&ouml;nnen. Die L&auml;nge
des Kabels sollte bei ca.50cm liegen und m&ouml;glichst durch die
vorhandene &Ouml;ffnung, durch die auch die &uuml;brigen Kabel gehen, nach
au&szlig;en gef&uuml;hrt werden. Die Abschirmung des Netzteils kann jetzt
wieder aufgesetzt und festgeschraubt werden.</P>

<P>Die fertig verdrahtet und verl&ouml;tete Blende wird nun wieder
eingesetzt. Sie wird einmal durch die Schraube gehalten, mu&szlig; aber
zus&auml;tzlich noch mit dem LED-Anzeigenelement verklebt werden, damit die
ben&ouml;tigete Stabilit&auml;t erreicht wird. Beim verkleben ist darauf zu
achten, da&szlig; das Element leicht nach oben geneigt wird (s.Aufnahme) Um
das Anzeigenelement in Betrieb nehmen zu k&ouml;nnen, mu&szlig; die
Anschlu&szlig;leitung noch verl&auml;ngert werden.Dazu wird einfach ein
St&uuml;ck 2-adriges Kabel in der ben&ouml;tigten L&auml;nge zwischen
Stecker und LED gel&ouml;tet und der Stecker wieder auf dem Motherboard
befestigt.Richtige Polung beachten!</P>

<P>Die Plastikfront nun mit dem Metallk&ouml;rper verschrauben und
vorsichtig auf den Computer aufschieben.Alle 4 Schrauben festziehen. Den
Rechner senkrecht hinstellen. Um das Loch, das durch das fehlende
Anzeigenelement entstanden ist zu verdecken, kann man sich eines Aufklebers
oder wie abgebildet einer festen Pappe bedienen.Dazu besorgen Sie sich
einfach einen ca.45x100cm gro&szlig;en Pappkarton und knicken ihn auf die
Form des Computers zu.</P>

<P>Der Vorteil der Papp-Verkleidung ist, da&szlig; der Computer auf
irgendeinen stabilen Gegenstand gestellt werden kann, den die Verkleidung
dann v&ouml;llig abdeckt.Damit l&auml;&szlig;t sich, bedingt durch die
Flexibilit&auml;t dieser M&ouml;glichkeit die H&ouml;he und die
Bedienungsfreundlichkeit individuell anpassen.Zur Befestigung der
Verkleidung eignet sich selbstklebendes Klettband aufgrund des dauerhaften
Halteverm&ouml;gen besonders gut.Die eine Seite des Klettbandes wird mit
der Pappe, die andere am Geh&auml;use des Computers verklebt.</P>

<P>So, wenn nun alles planm&auml;&szlig;ig verlaufen ist, haben Sie einen
vollwertigen "AMIGA-2000-TOWER" vor sich stehen.</P>

<P>Das Ganze sollte eigentlich auch mit jedem anderen Amiga
funktionieren.</P>

<P>Dann w&uuml;nsche ich allen Freaks viel Spa&szlig; beim Basteln.</P>

<P>Abschlie&szlig;end noch eine Kurzbeschreibung meiner Maschine:</P>

<TABLE border="0" width="100%" summary="">
<TR>
<TD valign="top">TECHNIK:</TD>

<TD>A 500 Rev. 6a mit 1 MB Chip, 1,5 MB 16-Bit- u. 4 MB 32-Bit-FastRAM 2
3,5"-DD-Floppys, 1 3,5"-HD-Floppy ALF-2-RLL-Adapter mit Controller Seagate
ST 11 R 1 Seagate ST 4144 R und 1 Seagate ST 4096 (je 120 MB) Turboboard
Harms-prof. 020 mit 32-Bit-RAM und Coproz. 68881</TD> </TR>
<TR>
<TD valign="top">Periph.:</TD>

<TD>Alfa-Data-Maus, voll-optisch, mit 3 Tasten 2 Competition-Pro Joystick
und 1 QuickShot 2 24-Nadel-Farbdrucker Fujitsu DL 1100 Color
Tintenstrahldrucker Siemens PT 88 Parallel-Umschaltbox (f&uuml;r die
Drucker) elektronisches Digital-Thermometer (Raum- u. Prozessor-Temp.)
Modem CSR 1496 (dieses wurde nicht eingebaut (wg. gesetzl. Bestimmungen
&gt;BZT-Zulassung&lt;) Monitor Philips CM 8802 (auch nicht
eingebaut...)</TD> </TR>

<TR>
<TD valign="top">OPTIK:</TD>

<TD>1 XT-Desktop-Geh&auml;use f&uuml;r den Rechner und alle Hardware
au&szlig;er Modem und Seagate 4096 sowie HD-Floppy 1 Slimline-Geh&auml;use
f&uuml;r Seagate 4096 und HD-Floppy (sowie evtl. weitere Peripherie...)
<BR><BR>
Beide Geh&auml;use stehen &uuml;bereinander. Sie sind schwarz lackiert
sowie mit DC-Fix-Folie mit Neonmuster beklebt.</TD>
</TR>
</TABLE>

<P>Wenn ich mal VIEEL Lust habe, fotografiere ich das Ger&auml;t mal, lasse
das Bild scannen und schicks an Andy zwecks Ver&ouml;ffentlichung....</P>

<P>Tsch&uuml;&szlig;chen, Euer Joachim</P>
<HR>
<IMG src="inhalt0.gif" alt="" width="640" height=
"22" border="0" usemap="#inh0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

