<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Amiga contra PC</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="smt0">
<AREA shape="rect" coords="460,1,550,22" href="smt.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="smt0.gif" alt="" width="640" height="22" border="0" usemap="#smt0">
<HR>
<BR>
                   

<H3 align="center"><B>Amiga contra PC</B></H3>

<P>Geschichte eines Computersystems</P>

<P>Vom ultraschnellen Flugsimulator zur Workstation</P>

<P>Am Anfang war die Idee von einem Computersystem, unwahr scheinlich
schnell sollte es sein, gute und schnelle Grafiken mu&szlig;te es bringen.
Gedacht war an den Einsatz als Flugsimulator f&uuml;r Spielhallen. Der Mann
der dahinterstand war kein anderer als Jay Miner. Bis dahin war auf dem
gesamten Markt kein Rechner f&uuml;r solche Zwecke brauchbar. In seiner
Firma, die als Joystickfirma getarnt war, sollte dieser neuartige Computer
gebaut werden. Im Jahr 1984 wurde der Computer dem begeistertem
Fachpublikum vorgestellt. Aber schon bald waren die Sponsoren nicht mehr
bereit mehr Geld in das Projekt Amiga zu stecken. Der Verkauf des Amigas
war unumg&auml;nglich. Nach anf&auml;nglichem Interesse von Atari
&uuml;bernahm dann Commodo re die Amiga Inc. f&uuml;r rund 27 Millionen
Dollar. Unter der Schirmherrschaft von Commodore wurde die Entwicklung
voran getrieben. Das Konzept jedoch wurde stark ver&auml;ndert, keine
Spielkonsole sollte es werden sondern ein PC. Alle Hardware komponenten
mu&szlig;ten dazu integriert werden. Das gr&ouml;&szlig;te Problem gab es
mit der Erstellung eines Betriebssystems. Das erste fertige Betriebssystem
kam von der Firma Metacomco und hatte noch sehr viele Fehler.</P>

<P>Im Mai 1985 war es dann soweit, der Amiga 1000 wurde der
&Ouml;ffentlichkeit vorgestellt. Der Amiga wurde zum Traum vieler
Computerfans, aber da der Einf&uuml;hrungspreis ca. 7000,- DM betrug war er
f&uuml;r die meisten zu hoch. Zur selben Zeit er schienen dann die Atari
ST's und die waren erheblich g&uuml;nstiger und verdanken Atari seinen
Erfolg. Dann aber wurde der Amiga billiger, es kamen die Modelle 500 und
2000 auf den Markt und der Amiga wurde f&uuml;r jeden erschwinglich. Dann
ging alles immer schneller, die Modelle 2500, 3000(Unix, Tower..)
erschienen und wo wir heute stehen das wissen wir alle.</P>

<P>Commodore hat in den Anfangsjahren viel Falsch in der Modell- und
Marketinpolitik gemacht. Jetzt endlich, nach fast 10 Jahren wird Commodore
vern&uuml;nftig und lernt aus den Fehlern aus der Vergangenheit. Weil jetzt
mehr der professionelle Markt gezielt wird kommt auch mehr gute Software
auf den Markt z. B. Lagerverwaltungssoftware wie FAMOS, Textver arbeitungen
der Spitzenklasse wie AmiWrite, DTP-Programme... . Solche Programme mit
dieser Leistungsf&auml;higkeit gab es fr&uuml;her nur auf den MS-Dosen.
Nun, hoffen wir, das jetzt wo der Computermarkt &uuml;berf&uuml;llt ist und
ein Anbieter den anderern mit billig-Angeboten unterbietet, da&szlig; es
wieder aufw&auml;rtsgeht mit unserem System. Der Amiga wurde von vielen
schon totgesagt, aber es hat sich zum Gl&uuml;ck nie bewahrheitet.</P>

<P>Wie hei&szlig;t es doch so sch&ouml;n:"Totgesagte leben
l&auml;nger"!!!</P>

<P>Wenn sich ein Neueinsteiger auf dem Computermarkt einen Rechner zulegen
will und geht in einen Computershop wird so fort von den MS-Dos(en)
Rechnern vollgelabert und vollge blubbert ohne das die Verk&auml;ufer die
Vorteile von anderen Computersystemen aufz&auml;hlen. Was bedeutet
eigentlich "PC"? Nun, PC hei&szlig;t Personal Computer, aber sind nur die
MS-Dosen Personal Computer? Was geh&ouml;rt zu einem Personal Computer? Ich
meine das zu einem PC geh&ouml;rt das man damit Arbeiten kann und alle
m&ouml;glichen Dinge damit anstellen kann. Kann man das etwa mit dem Amiga
nicht? H&auml;tte Commodore den Amiga "Amiga-PC" nennen sollen? Das sind
Fragen die vermutlich niemand so genau beantworten kann. Wer heute einen
MS-Dos PC hat, glaubt etwas zu sein. Beispiel an meinen Onkel: Als ich noch
einen 64er hatte haben wir damit immer ein wenig gespielt und gearbeitet.
Als ich mir dann einen A500 zu legte, kaufte er sich ein soooo tollen 286
PC. Heute hat er ein 386 und labert mich jedesmal voll wenn ich ihn sehe
das sein Computer soooooooooo toll ist und das ich mir einen gescheiten
Computer zulegen soll(Original-Zitat meines Onkels: Kauf' dir doch endlich
einen gescheiten Rechner). Ich habe ihm schon oft erkl&auml;rt so ein
MS-DOS PC nichts besonderes sei und habe ihm die ganzen Vorteile des Amigas
vom Multitasking bis Multimedia erkl&auml;rt und er Antwortet der Amiga sei
sowie so nur ein Spielekiste. Ich k&ouml;nnte hier noch weiter
erz&auml;hlen, aber das w&uuml;rde den Rahmen der Story sprengen.</P>

<P>Mich w&uuml;rde es freuen wenn Ihr hier im NoCover auch einmal solche
oder &auml;hnliche Erlebnisse mit MS-Dosen Besitztern(oder auch die
Unbelehrbaren genannt) erz&auml;hlen w&uuml;rdet.</P>

<P>Stefan Wunner</P>
<HR>
<BR>
<IMG src="smt0.gif" alt="" width="640" height="22" border="0" usemap="#smt0">
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

