<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>AmiWrite</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="tls0">
<AREA shape="rect" coords="470,1,525,22" href="tls.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="tls0.gif" alt="" width="640" height="22" border="0" usemap="#tls0"> 
<HR>

<H3 align="center"><B>Testbericht AMI WRITE V1.O AGA</B></H3>

<P>Mhhh, wie f&auml;ngt man am d&uuml;mmsten an ? Ok, mit der Verpackung.
AmiWrite kommt (zumindestens im ActivityPack - oder so &auml;hnlich) in
einer sch&ouml;&ouml;&ouml;n bunten (Schwarz,wei&szlig; und rot)
Papiert&uuml;te auf dem erstmal der Inhalt steht. Es k&ouml;nnte ja sein
das der Zimmerservice das als Wundert&uuml;te anschaut und der
M&uuml;llversorgung zuf&uuml;hrt - Neeee steht alles drauf. Wenn man nun
mit Spannung seine Wundert&uuml;te (&auml;&auml; ,sorry) seine AmiWrite
Verpackungst&uuml;te &ouml;ffnet so kommen einem 7 Disks in einer
Plastikt&uuml;te und ein 288-seitiges Handbuch entgegen. Ehhh momentmal -
und nat&uuml;rlich die Registrierkarte. Nun wird man beim genaueren
hinschauen darauf aufmerksam gemacht das diese Version von AmiWrite (AW)
nur f&uuml;r Festplatten ist. Was tun Leute die keine Festplatte haben ?
Die k&ouml;nnen nat&uuml;rlich die Diskettenversion gegen Einsendung zweier
Programmdisks bestellen (gratis). Stellt sich nur noch die Frage worum man
nicht alle 2 Versionen in ein Pack bekommt? Vielleicht sind es die extrem
hohen Diskettenpreise ,das man nicht 2 Disks mehr reintut ? Aber naja.</P>

<P>Die AmiWrite Installation auf Festplatte ist mit dem mitgelieferten
Installprogramm recht einfach. Im Lieferumfang sind neben 1O AGFA-Fonts
auch einige Cliparts wie V&ouml;gel,Rahmen usw. beigelegt. Das eigentliche
AW belegt nur 1 Disk,der Rest sind 2 Fontdisks, das W&ouml;rterbuch (1),
das Synonymlexicon und die Cliparts (1) ,Druckerzeichens&auml;tze mit
Installationsprogramm sowie eine AmiWriteExtradisk mit Standart Fonts,
Cliparts,einer Beispieldatei und einem Colorfont. AmiWrite
&uuml;nterst&uuml;tzt, wie der Name schon sagt, die neuen Farbpaletten des
A12OO und es 4OOOers, d.h 256 Farben die allersings nicht in einem Dokument
dargestellt werden. In einem Dokument werden die Grafiken in 32 Farbenmodus
umgerechnet und dargestellt. Dies bringt gegen&uuml;ber einer 256
Farb-Grafik einen Geschwindigkeitszuwachs. Das Programm l&auml;uft
allerdings auch auf allen anderen Amigas ab Workbench 1.2 und 1MB Ram. Es
gibt 2 Installationsprogramme. Das eine ist eine "1MB-Version" und das
andere die "Vollversion" die allerdings bei Installation auf Festplatte
1.5MB an Speicher verschlingt.</P>

<IMG src="awr1.gif" alt="" width="640" height= "870">

<P>Intern arbeitet AmiWrite nur mit 3 Textaufl&ouml;sungen, n&auml;hmlich
6O,72! und 8Odpi. Was ich hier vermisse ist, wie es z.B bei FinalCopyII der
Fall is, eine beliebige Textvergr&ouml;&szlig;erung mit Prozentangabe. Bei
einem Font mit 8 Pixel H&ouml;he und der Aufl&ouml;sung von 8Odpi braucht
man allerdings einen seeehr guten Optiker. Auch die 8Odpi Aufl&ouml;sung
entspricht ca.8OO mal 6OO Bildpunkten. Was bei AmiWrite einzigartig ist,
zumindest ist mir keine andere Textverarbeitung bekannt, das AW
Druckerfonts,AGFA-Fonts und normale Workbench also Bitmapfonts auf einer
Textseite gemischt (!) verwalten kann. Um das Ausdruckergebniss zu steigern
kann man auf Wunsch jede der einzelnen Fonts einzeln ausdrucken lassen. Das
Papier wird dann eben 3mal "durchgeschleift". Ebenso verh&auml;lt es sich
bei Grafiken die getrennt von dem &uuml;blichen Text ausgedruckt werden
k&ouml;nnen. Es gibt eine Reihe von Druckereinstellungen die auch in einem
der Screenshots zu sehen.</P>

<P>Beim Speichern l&auml;&szlig;t AW viele Speicherm&ouml;glichkeiten zu.
Leider mu&szlig;te ich feststellen das die "ASCII-Speicherfunktion"
manchmal nicht ganz hinhaut, d.h es wird trotzdem im internen AW-Format
gespeichert. Das m&uuml;&szlig;te auch in einem Screenshot zu sehen sein.
Bei den Schriftarten gibt es das &uuml;bliche wie hochgestellt,fett,kursiv
usw. Die AGFA Fonts lassen sich ohne qualtitative Einbu&szlig;en fast
beliebig vergr&ouml;&szlig;ern. Die Bitmapfonts lassen sich ebenfalls
vergr&ouml;&szlig;ern weisen dann aber die unbeliebten "Treppchen" auf.</P>

<IMG src="awr2.gif" alt="" width="640" height="512"> 

<P>AmiWrite verf&uuml;gt &uuml;ber einen Kopfund
Fu&szlig;zeilenmodu&szlig;, das Seitenlayout indem man seine Seite beliebig
oder vorgegeben (A4,A3,A5,...) einstellen kann.Au&szlig;erdem gibt es eine
Funktion f&uuml;r Seitenummerierung, das Zeitformat und f&uuml;rs
Datumsformat. In den einzelnen Punkten kann man seine Zeitdarstellung
(usw.) bequem ausw&auml;hlen. Nun kommen wir mal zum &auml;u&szlig;erst
n&uuml;tzlichen Men&uuml;punkt namens "Optionen" indem man u.a die
Trennhilfe, die Rechtschreibpr&uuml;ffunktion, die Textbausteine und das
Thesaurus finden kann. Die Rechtschreibung kann sofort beim schreiben oder
beim fertig geschriebenen Text &uuml;berpr&uuml;ft werden. In den
Textbausteinen findet man so allerhand n&uuml;tzliche Formulierungen zur
Anrede oder zur Verabschiedung. Diese werden bequem per Mausklick
eingef&uuml;gt. Es k&ouml;nnen nat&uuml;rlich neue hinzugef&uuml;gt werden
und wenn Sie wollen direkt aus dem Text.</P>

<IMG src="awr3.gif" alt="" width="640" height="512"> 

<P>Das Thesaurus (n&ouml;&ouml; hat nix mit den Dinos zu tun) dient allen
denen die einen langen Text schreiben und nicht immer einen Begriff
f&uuml;r ein Ding nehmen wollen. Das Thesaurus liefert nach Angabe des
Wortes viele (wenn das Wort vorhanden ist) einige andere Ausdr&uuml;cke die
immer weiter "verschachtelt" werden. So kann man z.B f&uuml;r ein Synonym
ein anderes finden usw. Die angezeigten Worte sind nach
Substantiven,Verben.. geordnet. Aber Schlu&szlig; mit der Grammatik - meine
Deutschlehrerinn k&ouml;nnte mich beginnen zu m&ouml;gen - aaaaah.</P>

<P>F&uuml;r die kleinen Freaks die das Spielen nicht lassen k&ouml;nnen ist
in AW ein kleines Spiel eingebaut. Hierbei werden die Buchstaben in einem
Fenster durcheinandergew&uuml;rfelt und diese gilt es dann per Mausklick
wieder zuordnen wobei immer nur ein Feld freibleibt. Eigentlich ist dieses
Spiel recht bekannt. Au&szlig;erdem bietet AW einen internen
Bildschirmschoner der das Bild nach angegebener Zeit dunkel schaltet.
Ziehmlich geschmacklos finde ich, da es im PD-Pool bessere
Bildschirmschoner gibt. F&uuml;r eine kommerzielle Textverarbeitung
d&uuml;rfte es ja kein Problem sein einen einigerma&szlig;en "grafischen"
Bildschirmschoner einzubauen - aber naja. Eigentlich will man ja nicht die
Bildschirmschoner bewundern sondern schreiben und dazu ist AmiWrite allemal
gut genug.</P>

<P>FAZIT:<BR> AmiWrite ist im Activity Pack enthalten und kostet mit
DPaintIV AGA und dem Spiel Nigel Mansell (Test folgt ?!) f&uuml;r rund
15O,-DM zu bekommen (leider mu&szlig; man einen A12OO/A4OOO dazu kaufen !).
Daher kann ich jedem nur empfehlen der sich einen neuen Amiga 12OO oder
gleich einen A4OOO kauft, dieses Paket gleich mitzunehmen - es lohnt
sich.<BR> AmiWrite bietet eine Index Funktion und ist daher auch f&uuml;r
semiprofesionelle Anwender ein gutes Programm was fast alle,z.Z
g&auml;ngigen und ben&ouml;tigten, Funktionen bietet. Aber auch f&uuml;r
den "Gelegenheitsschreiber" ist dieses Programm empfehlenswert. Leider
mu&szlig; ich feststellen das die Grafikausgabe ziehmlich mies (im
Vergleich zu DPaint) ausf&auml;llt. Aber trotzdem - man kann es
empfehlen</P>

<P>Jens aus Chemnitz</P>
<HR>
<IMG src="tls0.gif" alt="" width="640" height="22" border="0" usemap="#tls0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML> 
