<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Backstage</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="gam0">
<AREA shape="rect" coords="467,1,539,22" href="gam.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="gam0.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> 
<HR>

<CENTER>
<IMG src="bac1.png" width="320" height="200" alt="">
</CENTER>

<H3 align="center"><B>Backstage (Art Department)
Freeware-Game/Werbegame</B></H3>

<P><IMG src="bac2.png" width="155" height="100" alt="" align="left"
hspace="6"> Wieder einmal ist ein neuer Stern am Himmel der Werbespiele
aufgetaucht. Backstage, das neuste Werbegame was es zur Zeit auf den Amiga
gibt.</P>

<P>Und sicher werden auch bald die &uuml;blichen N&ouml;rgler aktiv werden,
die &uuml;ber die Werbung in Fernsehen schimpfen.</P>

<P>Klar, so ein Game ist massenweise mit Werung durchsetzt, wie jedes
andere Werbegame auch. Dabei sollte man aber bedenken, das man hier ein
qualitativ gutes Spiel f&uuml;r wenige Pfennige bekommt.</P>

<P>Und wen die Werung nicht passt, der soll halt ins n&auml;chste
Gesch&auml;ft laufen und sich ein Game f&uuml;r 50,- M&auml;rker kaufen.
Oder ne Raubkopie machen ? Naja, kann nen teurer Spa&szlig; werden, wenn
man erwischt wird.</P>

<P>So jetzt bin ich mal wieder ganz gewaltig vom Thema abgeschweift.</P>

<P>In den Spiel Backstage steuert man eine Figur, die bei einem Wettbewerb
mitmachen mu&szlig;. Hierbei m&uuml;&szlig;en diverse R&auml;tsel
gel&ouml;st werden. Aber ganz so einfach wie es sich anh&ouml;rt ist es nun
auch wieder nicht. Schafft man das R&auml;tsel in einer bestimmten Zeit so
hat man nat&uuml;rlich gewonnen.</P>

<CENTER>
<IMG src="bac3.png" width="320" height="200" alt="">
</CENTER>

<P>Aber was soll man bei einem Freeware-Game gro&szlig;artig erz&auml;hlen.
Schaut Euch lieber ein paar Pics aus dem Game an.</P>

<P>Falsch machen kann man ja bei einem Freeware-Game im Grunde nichts. Nur
m&ouml;chte ich hier nochmals darauf hinweisen, solche Games f&uuml;r max.
5 Mark + Versandkosten zu kaufen. Alles was diesen Preis &uuml;berschreitet
ist meiner Meinung nach Wucher. Obwohl das Game bestimmt auch 10,- oder
20,- Silberlinge wert w&auml;re. Aber bei diversen PD-H&auml;ndlern (und
Clubs (smile)) gibts es schon f&uuml;r 1.50 .</P>

<P>Hmm, eins mu&szlig; ich noch zum Thema Liveclub sagen.</P>

<P>Bevor Ihr irgendein Angebot von dieser Disk nutzt (3 CDs/Videos zum
Schnupperpreis), unbedingt GENAU die Mitgliedsbedingungen lesen!!</P>

<P>Fazit: Das Game so schnell wie m&ouml;glich besorgen !</P>

<P>Andreas</P>
<HR>
<IMG src="gam0.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML> 
