<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Backstage</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="tip0">
<AREA shape="rect" coords="467,1,569,22" href="tip.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="tip0.gif" alt="" width="640" height="22" border="0" usemap="#tip0"> 
<HR>
<BR>

<H2 align="center"><B>Komplettl&ouml;sung zu Backstage</B></H2>

<P>Als erstes untersucht man sein Haus nach brauchbaren Gegenst&auml;nden.
So findet man zum Bleistift eine Handsignierte Platte von Axel x,
anschlie&szlig;end schl&auml;gt man sich den Bauch am K&uuml;hlschrank voll
und benutzt dann die Toilette.Dann raus aus dem Haus und mit dem Auto
weiter. Jetzt geht man zum Radiosender 107.1 und besorgt sich die Fragen zu
dem Quiz. Man f&auml;hrt wieder zur&uuml;ck,um dann mit der U-Bahn
weiterzufahren. Im Kaufrausch redet man mit dem Mann der im Eingang
heruml&auml;uft und l&auml;&szlig;t sich die Diskette geben. Nun gehts
wieder nach Hause und schiebt die Disk in den Compi. Die folgende
Telefonnummer w&auml;hlt man am Telefon und schon ist man Mitglied im
Liveclub.</P>

<P>Weiter gehts mit dem Auto zum Schwimmbad doch zum Baden fehlt das
Handtuch und die Badehose. Also f&auml;hrt man wieder nach Hause und holt
sich aus dem Badezimmer das Handtuch und aus dem Schrank die Tasche mit der
Badehose. Wieder am Schwimmbad angekommen redet man mit dem Badegast,der
einen Zettel mit einer L&ouml;sung zu einer Frage verloren hat. Angeblich
befindet der Zettel sich beim Bademeister im M&uuml;lleimer,doch leider
kommt man an den M&uuml;lleimer nicht heran, da der Bademeister alles mit
Kameras &uuml;berwacht.</P>

<P>Also geht es wieder zur&uuml;ck nach hause. Dort hat der Postbote eine
&Uuml;beraschung parat.Ein P&auml;ckchen mit der Clubkarte f&uuml;r den
Liveclub,3 CD`s und einem Gettoblaster. Flugs die CD von Axel in den
Discplayer geschoben und anh&ouml;ren. Schon ist die erste Frage des Quiz
beantwortet! Weiter gehts mit der U-Bahn. Wir jumpen schnell in den
Liveklub und kaufen uns dort unser Lieblingsvideo.</P>

<P>Dann wieder zur&uuml;ck ind die U-Bahn.Den dort sitzenden Mann
&uuml;berzeugen wir, das der Liveklub das Nonplusultra heutzutage w&auml;re
und ab gehts wieder ins traute heim.Dort wartet schonwieder ein
P&auml;ckchen auf uns, diesmal mit einem Anrufbeantworter als Geschenk
daf&uuml;r, das wir ein neues Mitglied (Mann in U-Bahn)f&uuml;r den
Liveclub geworben haben. Den Anrufbeantworter schliesen wir schnell ans
Teflon an.</P>

<P>Wir gehen ein Paar H&auml;user weiter, wo wir bei dem Mann ganz links
eine Anzeige aufgeben, indem wir eine Hansiegnierte Platte von Axel gegen
ein paar tips f&uuml;r das Quiz von Radio 107.1 tauschen wollen. Nun
begeben wir uns in die Musikhalle, wo wir den dortigen Hausmeister
anquatschen, doch der ist so besch&auml;ftigt eine Schachaufgabe zu
l&ouml;sen, das er keine zeit hat uns ein paar ausk&uuml;nfte &uuml;ber
Axel`s show zu geben. Also wieder raus aus dem laden und ab ins Schwimmbad,
denn diesmal haben wir ja unsere Badeklamotten dabei.Den Bademeister dort
geben wir das Video. Dann laufen wir schnell die Treppe herauf und
untersuchen den M&uuml;lleimer. Dort finden wir den Zettel und somit auch
unsere zweite Antwort auf das Quiz!</P>

<P>Wir fahren wieder nach hause und h&ouml;ren uns den Anrufbeantworter an.
Dort ist ein Mann der sich wegen der Anzeige meldet. Wir machen ein treffen
in der &Ouml;rtlichen Pizzeria aus. Bevor wir zu unserem treffen gehen,
schauen wir vorher noch in der Garage vorbei, doch der dort festgebundene
Hund l&auml;st uns nich an das Schaltpult heran. Also gehen wir in die
Pizzeria, wo unser Mann schon auf uns wartet. Wir vollziehen den tausch und
schon haben wir die dritte Antwort! Aus der Pizzeria nehmen wir noch aus
der K&uuml;che den Fleischbrocken mit und verschwinden dann. Jetzt ist
wieder mal ein besuch im Liveklub f&auml;llig. Dort kaufe wir uns das
Schachbuch. Wir gehen zur&uuml;ck zur Garage wo der Hund das Pult
bewacht.Wir schmeisen ihm die Fleischkeule vir die Schnauze und der Weg zum
Schaltpult ist frei. Der Knopf wird gedr&uuml;ckt und das Auto wird
heruntergelassen. Wir &ouml;ffnen das Auto und nehmen den Schl&uuml;ssel
mit. Jetzt gehen wir in das Haus daneben und schliesen die T&uuml;r zur
Dunkelkammer auf. Das Foto das dort h&auml;ngt nehmen wir ab und schauen es
uns an. Unsere vierte Frage w&auml;re somit auch gekl&auml;rt.</P>

<P>Im laufschritt zur Musikhalle, dem Hausmeister das schachbuch geben.
TATATATAAA!!!! Das war die letzte Frage. Das Spiel w&auml;re geschaft.</P>

<P>Wer das Spiel noch nicht hat kann es gegen Leerdisk und gen&uuml;gend
R&uuml;ckporto bei mir anfordern:</P>

<P align="center">Martin Dreisbach<BR>
Rothenberger Str.31<BR>
57271 Hilchenbach<BR>
Tel.:02733/4841</P>
<HR>
<IMG src="tip0.gif" alt="" width="640" height="22" border="0" usemap="#tip0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>                                       
