<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>DPaint</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="inh0">
<AREA shape="rect" coords="470,1,525,22" href="inhalt.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="inhalt0.gif" alt="" width="640" height="22" border="0" usemap="#inh0">
<HR>

<H2 align="center"><B>Deluxe Paint IV AGA</B></H2>

<H3 align="center">Workshop 1. Teil</H3>

<P>Dies ist ein Workshop der vor allem f&uuml;r Anf&auml;nger geeignet ist,
die das Programm noch nicht von allen Feinheiten her kennen. Der Workshop
gliedert sich in einzelne kleine Workshops wie z. B. Farbverl&auml;ufe,
Arbeiten im Perspektive Modus, Animationen... Ich habe mit gedacht das so
etwas besser ist als ein gro&szlig;er ganzer Workshop. Macht man da einmal
einen Fehler und bemerkt es erst sp&auml;ter wenn irgendwas nicht stimmt,
so mu&szlig; man ab dem Fehlerpunkt nochmal anfangen. Macht man hier einen
Fehler ist das nicht so tragisch, denn die Workshops sind klein(aber
oho!!). Wenn Sie dieses File ausdrucken wollen, oben im Men&uuml; vom
Diskettenmagazin, da&szlig; mit Magnetics Pages erstellt wurde, ist ein
Men&uuml;punkt "Drucken"!</P>

<UL>
Man braucht dazu:

<LI>einen AGA - Rechner(A1200-A4000)</LI>

<LI>mind. 2 MB Ram</LI>

<LI>Deluxe Paint IV&nbsp;AGA</LI>

<LI>eine Festplatte oder zwei Laufwerke</LI>

<LI>und einen User der die ganze Sache macht(hahaha)</LI>
</UL>

<P>So, jetzt wollen wir aber mal loslegen:</P>

<H3><B>1. Farbverl&auml;ufe:</B></H3>

<P>Fangen wir am besten mit den Farbverl&auml;ufen an. Mit DPaint kann
Farbverl&auml;ufe bis zu 32 Farben machen. Wir wollen jetzt einen
Farbverlauf mit den Farben Wei&szlig; und Blau machen:</P>

<UL>
<LI>Gehen Sie in das Men&uuml; Farbe/Palette/Mixer ein</LI>

<LI>Oben rechts sind zwei Schalter mit denen man auf die verschiedenen
Farb-Bereiche kommt.</LI>

<LI>Gehen Sie auf Bereich 2 und l&ouml;schen Sie dort alle 32 Farben. Am
besten geht das wenn Sie auf die erste Farbe klicken und den Mauszeiger auf
l&ouml;schen bewegen und dort 1x anklicken. Dann mit "+" Taste eine Farbe
weiter und L&ouml;schen anklicken usw. bis alles gel&ouml;scht ist.</LI>

<LI>Danach gehen Sie auf Bereich 3 und holen sich die Farbe 112 (Die Nummer
steht in der Mitte unter dem K&auml;stchen) indem Sie die Farbe anklicken
und links unten auf den Knopf "Kop" dr&uuml;cken.</LI>

<LI>Am Mauszeiger erscheint nun das Wort "to". Gehen Sie wieder auf Bereich
2 und klicken Sie auf das erste leere Farbfeld. So, die erste Farbe
w&auml;re kopiert.</LI>

<LI>Wiederholen Sie das mit der Farbe 118 im Bereich 3. Legen Sie die Farbe
auf dem letzten freiem Farbfeld im Bereich 3 ab.</LI>

<LI>Klicken Sie nun auf die erste Farbe im Bereich 2 und klicken Sie unten
auf den Knopf "verlauf". Wieder erscheint das "to". Klicken Sie jetzt auf
die letzte Farbe. Schwupp... und schon h&auml;tten wir einen
Farbverlauf.</LI>

<LI>Verlassen Sie den Farbmixer, indem Sie rechts unten auf den O.K Knopf
dr&uuml;cken. Gehen Sie jetzt in das Men&uuml; Farbe und w&auml;hlen
Bereiche an. Gehen Sie jetzt auf Farbbereich 2. Klicken Sie links oben
einmal auf das schwarze leere Feld. Jetzt sind wir im Mix-Bereich 2.
Klicken Sie jetzt auf die erste Farbe; Der Mauszeiger verwandelt sich in
ein Farbfeld. Gehen Sie damit oben in der Mitte auf die Reihe die leer ist
und legen Sie die Farbe dort ab. Jetzt gehen Sie mit der "+" Taste eine
Position weiter. Das machen Sie solange bis die obere Reihe voll ist.</LI>

<LI>Jetzt gehen Sie rechts unten auf den O. K. Knopf. Dann w&auml;hlen Sie
bitte mit der rechten Maustaste den F&uuml;lleimer an. Jetzt erscheint ein
Requester. Unten sieht man schon die Abstufung in form eines Balken.
Klicken Sie jetzt in der 2.H&auml;lfte vom Requester den Knopf an, der
einen Pfeil von oben nach unten zeigt. Schalten Sie jetzt den Zufall-Knopf
ein, der bewirkt, da&szlig; die Grenze zwischen zwei benachbarten Feldern
in der Abstufung gemischt wird( nicht nach einem Muster). Schieben Sie den
Dither-Schalter ganz nach rechts. Die Dither-Funktion bewirkt, da&szlig;
der Kontrast zwischen 2 benachbarten Farben reduziert wird, ohne die Farben
zu ver&auml;ndern.</LI>

<LI>Klicken Sie jetzt auf den O.K. Knopf, schalten Sie die Werkzeugleiste
und die Men&uuml;leiste mit F10 aus und klicken Sie einmal in die leere
Fl&auml;che. Jetzt wird langsam die Abstufung auf dem Bildschirm aufgebaut.
Man erkennt deutlich, da&szlig; es nach oben hin wei&szlig; wird und nach
unten bl&auml;ulich.</LI>

<LI>Jetzt speichern Sie am besten die Palette ab, schalten aber vorher mit
F10 Men&uuml;leiste und Werkzeugleiste wieder an; Gehen Sie ins Men&uuml;
Farbe/Palette/Sichern. Speichern Sie jetzt am besten unter
"Workshop_palette" ab. Vielleicht brauchen wir die Palette in sp&auml;teren
Teilen des DPAINT&nbsp;IV AGA Workshops noch.</LI>
</UL>

<P>Jetzt wissen Sie, wie man eine 32-Farben-Abstufung macht. Die
Abstufungen gehen nat&uuml;rlich auch mit 2, 3, 4, 5, 6 ... Farben. Es gibt
auch noch viele andere Funktionen um eine Abstufung zu gestalten:</P>

<P>z. B.: im F&uuml;lltyp-Requester einfach die verschiedenen Kn&ouml;pfe
wie Lin, Form, Kreis, Kon und GLZ durchpropieren oder mit dem
DitherSchieberiegel und dem Zufalls-Knopf etwas herumpropieren.</P>

<P>So, da&szlig; war der 1. Teil dieses Workshops. In der n&auml;chsten
Ausgabe des No Cover kommt dann der 2. Teil. Dann geht es um 2DAnimationen
und den vielf&auml;ltigen M&ouml;glichkeiten die DPaint zu bieten hat. Bis
dahin</P>

<P>Viel Spa&szlig; mit DPaint IV AGA<BR>
Stefan Wunner</P>
<HR>
<IMG src="inhalt0.gif" alt="" width="640" height="22" border="0" usemap="#inh0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>
