<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Das Stundenglas</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="tip0">
<AREA shape="rect" coords="467,1,569,22" href="tip.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="tip0.gif" alt="" width="640" height="22" border="0" usemap="#tip0"> 
<HR>
<BR>

<H2 align="center"><B>DAS STUNDENGLAS</B></H2>

<P>Das Spiel beginnt im Jahre 2012. Zur Jahrtausendwende ging die
&ouml;kologische Zeitbombe hoch. Die Zivilisation liegt darnieder. Die
Menschen, die &uuml;berlebt haben, werden von pl&uuml;ndernden Banden
bedroht. Der Spieler kann den Spielfortschritt an seiner Punktzahl
erkennen. Man kann 100 Punkte erreichen.</P>

<P>Zu Beginn des Spiels befinde ich mich auf der Stra&szlig;e und mu&szlig;
mich schnellstens der Verfolgung dieser Banden entziehen. Ich gehe nach
Westen und betrete den Spielwarenladen. Um die Verfolger
abzusch&uuml;tteln, schlie&szlig;e ich die T&uuml;r und schiebe den Riegel
vor (1 Punkt). Nun untersuche ich die Truhe und dr&uuml;cke - wie mir die
Anleitung verr&auml;t -Stift 96, woraufhin ein Hohlraum sichtbar wird, in
dem der Schl&uuml;ssel zur Truhe liegt. Also schlie&szlig;e ich die Truhe
auf, &ouml;ffne den Deckel und betrete die Truhe ( 1 Punkt/gesamt: 2
Punkte).</P>

<P>Ich finde mich in einer ganz anderen Welt wieder, schwimmend im
Funkelsee. Da ich in n&ouml;rdlicher Richtung ein Wasserschlo&szlig; sehe,
schwimme ich dorthin. Auf dem Pier befindet sich einer von 12
Torb&ouml;gen. Man sollte jeden Torbogen untersuchen und sich die Nummer
des Torbogens aufschreiben. Ein M&auml;dchen namens Yanyi guckt aus dem
Schlo&szlig; und ruft mich hinein. Im Schlo&szlig; erz&auml;hlt sie mir,
da&szlig; das Stundenglas verschwunden ist. Meine Aufgabe besteht darin,
dieses wiederzufinden. Yanyi kann mir mit 12 Geheimnissen von 12 Weisen
weiterhelfen. Ich soll mich nun ins Flu&szlig;tal begeben und die Namen der
12 Weisen herausfinden, damit mir Yanyi dann das jeweilige Geheimnis
verraten kann. Bevor ich mich auf den Weg mache, gebt sie mir noch einen
Tip: Ich soll nich zuerst zum Zauberer Kautz ins Felsenschlo&szlig; auf dem
Eisenstein begeben und ihn nach dem Stundenglas fragen.</P>

<P>Also verlasse ich das Schlo&szlig; nach S&uuml;den, gehe ins Boot, binde
es los und fahre zum Bootssteg. Bevor ich den Steg betrete, binde ich das
Boot fest. Nun gehe ich auf den Eisenstein, nach Norden zum Schlo&szlig;tor
und klopfe ans Tor. Kautz schaut durchs Guckloch, kann mir aber das Tor
nicht &ouml;ffnen, da ihm der Eisenschl&uuml;ssel fehlt. Da ich hier
zun&auml;chst nicht weiter komme, gehe ich auf die Dorfwiese und betrete
die Kirche. Hier frage ich den Pfarrer nach dem Schl&uuml;ssel.</P> Er
teilt mir mit, da&szlig; die Hexe ihn wohl hat. Um das Spiel l&ouml;sen zu
k&ouml;nnen, mu&szlig; man jede Person nach einer M&uuml;nze fragen. Es
gibt insgesamt 12, die jeweils ein Geheimnis der 12 Weisen
entschl&uuml;sseln helfen. Also frage ich den Pfarrer nach seiner
M&uuml;nze, die er mir ohne Gegenleistung gibt (M&uuml;nze 1). Bevor ich
zur Hexe gehe , frage ich den Pfarrer noch nach dem Stundenglas. Er teilt
mir mit, da&szlig; es von der Munterwasserinsel gestohlen wurde. Nun gehe
ich ins Hexenhaus und frage die Hexe nach dem Schl&uuml;ssel. Sie verlangt
von mir, ihr Kr&ouml;tenwurz zu besorgen. Ich frage sie nach
Kr&ouml;tenwurz und erfahre da&szlig; der Pfarrer der Kr&auml;uterfachmann
ist. Also kehre ich zur Kirche zur&uuml;ck, frage den Pfarrer nach dem
Kr&ouml;tenwurz und erfahre, da&szlig; er im Moor beim Torbogen
w&auml;chst. Im Blubbermoor untersuche ich die Grasb&uuml;schel und nehme
den Kr&ouml;tenwurz, den ich sofort zur Hexe bringe (5/7). Nun erhalte ich
den Eisenschl&uuml;ssel und kann zum Zauberer Kautz zur&uuml;ckkehren. Auf
dem Weg gehe ich aber noch erst in die Wirtsstube kann man nicht zu jeder
Tageszeit, zur Not mu&szlig; man zu einer g&uuml;nstigeren Zeit
wiederkommen. Der Wirt verlangt f&uuml;r seine M&uuml;nze den Zauberstab
der Hexe. ich erfahre auch, da&szlig; zu dem Zeitpunkt als das Stundenglas
verschwand, die H&auml;lfte der Leute aus dem Tal verschwunden ist. Ich
kehre zun&auml;chst auf den Eisenstein zur&uuml;ck, schlie&szlig;e das
Schlo&szlig;tor auf und gehe in die Halle des Felsenschlosses. Jetzt kann
ich Kautz den Eisenschl&uuml;ssel geben. Er schl&auml;gt mir ein
Gesch&auml;ft vor, auf das ich nat&uuml;rlich eingehe: Ich erfahre,
da&szlig; Kautz einen Feind namens Klapautz hat, der auf dem Gletscher in
der Eisfeste wohnt. Klapautz hat das Stundenglas gestohlen. Es gibt aber
die Schwierigkeit, da&szlig; die Eisfeste in einer fremden Welt gelandet
ist. Kautz sagt mir, da&szlig; sechs Leute im Tal jeweils eine M&uuml;nze
besitzen. Nur mit Hilfe dieser M&uuml;nzen kann ich zu Klapautz gelangen.
Es liegt hier auch noch grober Basaltsand, der nach Kautz` Aussage der
richtige f&uuml;r das Stundenglas ist. Zur Zeit sei der Sand im Stundenglas
zu fein. Da das Stundenglas den Rhytmus des Lebens regelt, l&auml;uft alles
viel zu schnell ab. Also mache ich mich daran, die restlichen f&uuml;nf
M&uuml;nzen zu besorgen. </P>
                   

<P>Um das erste Geheimnis zu erfahren, begebe ich mich ins
Wasserschlo&szlig; Yanyi ("binde Boot los", "fahre zum Wasserschlo&szlig;",
"binde Boot fest", "gehe auf Pier"). Man mu&szlig; aufpassen, da&szlig; man
nicht versehentlich statt Pier Steg eingibt, da man kurioserweise dann auf
dem Steg steht, das Boot aber am Pier bleibt! Um das erste Geheimnis zu
erfahren, untersuche ich die M&uuml;nze 1. Die M&uuml;nze hat auf der
Vorderseite die r&ouml;mische Zahl `I` und auf der R&uuml;ckseite das
Symbol des Mondes, der Sonne, des Wassers, der Wolke, des Menschen oder der
Sterne. Dies variiert von M&uuml;nze zu M&uuml;nze und von Spiel zu Spiel.
Man mu&szlig; jetzt das der Spielpackung beiliegende Symbolrad benutzen.
Folgendes Beispiel soll das Verfahren, das sich bei jeder M&uuml;nze
wiederholt, erl&auml;utern: Auf der R&uuml;ckseite der M&uuml;nze I
befindet sich das Symbol des Mondes. Ich stelle das Bild des Mondes auf der
inneren Scheibe unter die I auf der &auml;u&szlig;eren Scheibe und sehe im
gro&szlig;en Fenster die Buchstaben `GER` und eine Wolke. Jetzt drehe ich
die Scheibe bis sich die Wolke unter der `I` befindet. Im kleinen Fenster
stehen die Buchstaben ELO. Der Name des ersten Weisen in diesem Beispiel
lautet also GERELO. Ich frage Yanyi nach dem Namen, den ich mit dem
Symbolrad ernittelt habe und erfahre das erste Geheimnis.</P>

<P>Die 12 Steintore sind magische Tore, die durchnumeriert sind. Wenn man
zum Beispiel zu dem Ort m&ouml;chte, an dem sich Torbogen 5 befindet,
steckt man die M&uuml;nze mit der Nummer 5 in den Schlitz an dem Torbogen,
an dem man sich gerade befindet und geht hindurch. Die in den Schlitz
gesteckte f&auml;llt dann wieder in die Hand zur&uuml;ck. Mit dem Boot
fahre ich wieder zur&uuml;ck und gehe erneut ins Wirtshaus, wo sich der
M&uuml;ller, die Hexe, der Pfarrer und der Wirt aufhalten. Jetzt kann ich
auch den M&uuml;ller nach seiner M&uuml;nze fragen. Er bittet als
Gegenleistung um ein St&uuml;ck Bergkristall.</P>

<P>Um an die M&uuml;nze des Wirtes zu gelangen, gehe ich ins Hexenhaus und
nehme den Zauberstab. Sobald ich das Hexenhaus verlassen will, erscheint
die Hexe und verlangt, da&szlig; ich den Zauberstab wieder hinlege. Ich
folge der Aufforderung beim zweiten Mal. Die Hexe mu&szlig; mich jetzt
fragen, was mir der Wirt f&uuml;r den Zauberstab versprochen hat. Ich gebe
ein: "Er hat mir die M&uuml;nze versprochen", woraufhin die Hexe mir
erlaubt, den Zauberstab zu nehmen. Sie verspricht mir ihre M&uuml;nze, wenn
ich ihr einen Gefallen tue. Sie gibt mir ein Medizinfl&auml;schchen, das
ich dem Troll gegen seinen Schnupfen geben soll. Die Medizin ist allerdings
zu bitter f&uuml;r den Troll. Bevor ich das Haus der Hexe verlasse, nehme
ich den Zauberstab und das Fl&auml;schen. Nun kehre ich ins Wirtshaus
zur&uuml;ck und gebe dem Wirt den Zauberstab, woraufhin ich seine
M&uuml;nze bekomme (5/12) (M&uuml;nze 2). Um die bittere Medizin zu
vers&uuml;&szlig;en, bitte ich den Wirt um Wein ("frage Wirt nach Wein").
Ich &ouml;ffne die Flasche und das Fl&auml;schchen und leere das
Fl&auml;schchen in die Flasche. Jetzt gehe ich zum Steinbruch (oder
n&auml;here Ungebung) und gebe dem Troll die Flasche, die er leert. Am
Steinbruch liegt ein Felsbrocken, auf den ich hinaufgehe. Ich lese die
Verse, die mir die Wegbeschreibung auf den Gipfel des Zackensteins
geben.</P>

<P>Diese brauche ich aber erst sp&auml;ter. Mein n&auml;chstes Ziel ist der
Blaueisgletscher n&ouml;rdlich des Bl&auml;ulichsees, wo ich den
Bergkristall hole. Jetzt kann ich zum Hexenhaus zur&uuml;ckkehren und mir
die M&uuml;nze der Hexe geben lassen ( einfach "warte" eingeben ) (5/7)
(M&uuml;nze 3). Die M&uuml;nze des M&uuml;llers hole ich mir in der
M&uuml;hle, nachdem ich ihm den Bergkristall gegeben habe (5/22)
(M&uuml;nze 4). Von hier aus gehe ich zum Wurzelwald, stecke M&uuml;nze 2
in den Schlitz des Torbogens, gehe durch den Torbogen und lande auf dem
Pier vor dem Wasserschlo&szlig;. Ich brauche das Boot also nicht mehr. Nun
kann ich mir von Yanyi die Geheimnisse f&uuml;r die M&uuml;nzen 2,3 und 4
geben lassen (Verfahren wie oben beschrieben). Yanyi erz&auml;hlt mir,
da&szlig; jemand die Welt durch das Einf&uuml;llen von feinerem Sand in das
Stundenglas aus dem Lot gebracht hat. Das Ziel ist also, das Stundenglas zu
finden und den falschen Sand gegen den richtigen auszutauschen. Ich
erfahre, da&szlig; unter den Eichen auf der Munterwasserinsel eine
Steinpyramide steht, auf der das Stundenglas stand, bevor es entwendet
wurde. Als das Stundenglas verschwand, wurde die Welt
auseinandergerissen.Die H&auml;lfte der Bewohner verschwand, ist aber noch
im Tal und lebt in einer anderen Zeitsph&auml;re. Ich kann mit Hilfe der
sechs M&uuml;nzen in die zweite Zeitsph&auml;re &uuml;berwechseln und dort
die restlichen sechs M&uuml;nzen finden. Nur mit allen zw&ouml;lf
M&uuml;nzen k&ouml;nnen die beiden Zeitsph&auml;ren wieder vereint werden.
Wie ich den Sprung in die zweite Zeitsph&auml;re schaffen kann, bleibt noch
unklar. Nun fehlen mir noch die M&uuml;nzen des Fischers und des Schmieds.
Also gehe ich zun&auml;chst zum Feenwald. Falls der Fischer nicht da ist,
warte ich solange, bis er kommt. Ich frage ihn nach seiner M&uuml;nze,
woraufhin er mich um folgenden Gefallen bittet: Ich soll die Seeschlange
dazu bringen, es zu unterlassen, die Fische im See zu frssen. Ich frage ihn
nach der Seeschlange, worauf er mir den Tip gibt, mich bei der Hexe zu
erkundigen. Also gehe ich zum Hexenhaus. Die Hexe erz&auml;hlt mir,
da&szlig; Sir Archibald, die Seeschlange, mit dem Ungheuer von Loch Ness
verwandt ist, und da&szlig; sie sich einen Dudelsack w&uuml;nscht. Ich
frage die Hexe nach einem Dudelsack, woraufhin sie mir einen zaubert, mit
dem ich zur Seeschlange gehe ( Blubbermoor -am Seeufer ). Nachdem ich der
Seeschlange den Dudelsack gegeben habe, verspricht sie mir, zum Fischer zu
schwimmen, um diesem den gew&uuml;nschten Gefallen zu tun. Wenn ich jetzt
zum Fischer zur&uuml;ckgehe, gibt er mir seine M&uuml;nze (5/27)
(M&uuml;nze 5). Jetzt gehe ich zur Schmiede und frage den Schmied nach
seiner M&uuml;nze. Er verlangt als Gegenleistung einen guten
Schmiedehammer. Er gibt mir noch den Tip, da&szlig; der Troll einen solchen
besitzt, den er nicht mehr braucht. Den Troll finde ich in der N&auml;he
des Steinbruchs. Er ist dieses Mal im n&ouml;rdlichen Finsterwald. Er
verspricht mir den Hammer, wenn ich ihm einen Stra&szlig; Blumen gebe. Da
ich in diesem Wald keine Blumen finden kann, gehe ich in den Wurzelwald, wo
ich das Geb&uuml;sch untersuche und die Blumen finde. Ich bringe sie zum
Troll, erhalte den Hammer, den ich zum Schmied bringe, woraufhin ich dessen
M&uuml;nze erhalte ( 5/32 ) ( M&uuml;nze 6 ). Da ich nun alle sechs
M&uuml;nzen habe, gehe ich zu Yanyi ins Wasserschlo&szlig;. Nun kann ich
von ihr die Geheinmisse 5 und 6 erfahren. Yanyi sagt mir, da&szlig; der
Teppich hier im Wasserschlo&szlig; den &Uuml;bergang in die zweite
Zeitsph&auml;re erm&ouml;glicht. Um dorhin zu gelangen, mu&szlig; ich
einfach die sechs M&uuml;nzen auf den Teppich legen. Um zur&uuml;ckzukehren
mu&szlig; ich alle zw&ouml;lf M&uuml;nzen auf den Teppich legen. Das
sechste Geheimnis rankt sich um den eiskalten Bl&auml;ulichsee. Kein
menschliches Wesen kann in ihm schwimmen, ohne zu erfrieren. An seinem
Grund liegt ein Gegenstand von gro&szlig;er Bedeutung. Nun lege ich die
sechs M&uuml;nzen auf den Teppich, nehme die M&uuml;nzen wieder auf (5/37)
und befinde mich immer noch bei Yanyi. Wenn man das Schlo&szlig;
verl&auml;&szlig;t, sieht man aber gewisse Unterschiede. Nun mu&szlig; ich
zun&auml;chst die restlichen sechs M&uuml;nzen beschaffen. Bevor ich mich
zun&auml;chst zum Haus des Schreiners begebe, gehe ich noch kurz zur
Dorfbr&uuml;cke, wo Fridolin, der Trunkenbold, sitzt, der aber nicht
willens ist, mit mir zu kommunizieren. Dann gehe ich zu Erasmus, dem
Schreiner, und frage ihn nach seiner M&uuml;nze. Er sagt mir, da&szlig;
seine M&uuml;nze von der Dorfbr&uuml;cke in den Flu&szlig; gefallen und
seitdem verschwunden ist. Ich befrage den Schreiner nach der Insel und
erhalte den Hinweis, da&szlig; der Gnom sich immer zum Angeln auf der Insel
aufh&auml;lt. Der Schreiner wei&szlig; auch etwas &uuml;ber Fridolin. Er
gibt mir den Tip, da&szlig; Fridolin manchmal Dinge in seiner Pulle
versteckt. Bevor ich das Haus verlasse, nehme ich noch die
S&auml;gesp&auml;ne und die Axt mit. Der n&auml;chste Bewohner, den ich
nach seiner M&uuml;nze frage, ist Kuno , der Kr&auml;mer, der sich in
seinem Laden aufh&auml;lt. Da er ein Freund von Denksportaufgaben ist,
verlangt er als Gegenleistung die L&ouml;sung folgender Aufgabe: Ich soll
herausfinden, wie alt er gestern geworden ist. Also untersuche ich die
Waren, dann die Kerzen, dann die Stearinkerzen und finde 10 Kisten zu 16
St&uuml;ck. Zwei Schachteln sind leer, in der dritten liegt nur noch eine
Kerze. Also Matheaufgabe: 3*16-1=47. Ich gebe einfach ein "Du bist 47" und
erhalte seine M&uuml;nze (5/42) (M&uuml;nze 7). Jetzt gehe ich zur
Abzweigung am See, wo ich auf Patrizia, die B&auml;uerin, treffe. Ich
untersuche das Bauernhaus, versuche es zu betreten, was aber nicht geht, da
mir eine verschlossene T&uuml;r den Weg versperrt. Ich untersuche die
T&uuml;r und sehe, da&szlig; sich oberhalb des Querbalkens eine
Troph&auml;e befindet: der Sch&auml;del eines Hechtes auf einem Holzteller.
Nun mu&szlig; ich nur noch den Holzteller und das Maul des Hechtes
untersuchen und finde die verschollene M&uuml;nze des Schreiners, die ich
einsacke (5/47) (M&uuml;nze 8). Jetzt frage ich die B&auml;uerin nach ihrer
M&uuml;nze. Ich mu&szlig; sie mir nat&uuml;rlich verdienen: Ich soll das
Einhorn bitten, ihr beim Pfl&uuml;gen zu helfen. Auf die Frage nach dem
Einhorn, sagt sie mir, da&szlig; es im Feenwald wohnt und da&szlig; niemand
seinen richtigen Namen kennt. Der Gnom wei&szlig; offentsichtlich mehr.
Also gehe ich zum Gnom, der sich zur Zeit auf der Dorfbr&uuml;cke befindet
(er ist sonst meistens im Wurzelwald). Ich frage den Gnom nach dem Einhorn
und nach der Sage. Ich erfahre, da&szlig; ein Zauberer dem Einhorn senen
Namen nahm und den Greifen mit einem Bannwort belegt hat. Beide Worte sind
aber irgendwo verzeichnet. Der Gnom wei&szlig;, da&szlig; der Name des
Einhorns auf einem schwarzen Stein steht und da&szlig; Bannwort in die
Rinde des Wunderbaums geritzt ist. Nun frage ich den Gnom noch nach dem
Greifen und erfahre, da&szlig; ich ihn bes&auml;nftigen mu&szlig;, um an
die Greifeneierschale zu gelangen, die der Gnom braucht, um einen Wachtrunk
herzustellen. Von der Dorfbr&uuml;cke springe ich ins Wasser und gelange
nach Osten auf die Munterwasserinsel. Hier ist zun&auml;chst nur das
Alchemiebuch wichtig, das ich mitnehme. Ich gehe nach Westen und klettere
auf die Br&uuml;cke zur&uuml;ck. Jetzt gebe ich dem Gnom sein Alchemiebuch
und frage ihn danach. Die Antwort ist nicht sehr hilfreich. Nun gehe ich in
den Finsterwald, wo ich den Monolithen untersuche, auf dem sich
Schriftzeichen befinden. Ich erfahre den Namen des Einhorns: SCHNEEFLOCKE.
Nun kann ich zum Einhorn im Feenwald gehen und es bitten, der B&auml;uerin
zu helfen ("hilf B&auml;uerin"). Da es als Gegenleistung seinen Namen
verlangt, sage ich: "Du hei&szlig;t Schneeflocke", woraufhin es verspricht,
zu B&auml;uerin zu gehen. Jetzt kann ich auch zur B&auml;uerin gehen und
erhalte ihre M&uuml;nze (5/52) (M&uuml;nze 9). Mein n&auml;chstes Ziel ist
das Haus des Totengr&auml;bers. Um seine M&uuml;nze zu bekommen, mu&szlig;
ich ihm einen Sarg aus Wunderbaumholz beschaffen. Vor seinem Haus steht
eine Schaufel, die ich aber noch nicht nehmen kann.</P>

<P>Jetzt gehe ich zum Schuster und frage ihn nach seiner M&uuml;nze. Da er
Schulden beim Kr&auml;mer hat, mu&szlig; ich dem Schuster versprechen, die
Schulden beim Kr&auml;mer abzuarbeiten. Er gibt mir aber direkt seine
M&uuml;nze als Vorleistung (M&uuml;nze 10). Obwohl nicht n&ouml;tig, tue
ich ihm den Gefallen. Ich gehe also zum Kr&auml;mer zur&uuml;ck. Da ich die
Schulden nicht bezahlen kann, schl&auml;gt er vor, da&szlig; ich einen Tag
in seinem Lager arbeiten soll. Ich mu&szlig; am n&auml;chsten Tag um acht
Uhr zur&uuml;ckkehren.</P>

<P>Um die Zeit zu &uuml;berbr&uuml;cken und um die Geheimnisse 7 bis 10 zu
erfahren, kehre ich zu Yanyi zur&uuml;ck. Das siebte Geheimnis hat mit dem
Donnerfelsen zu tun. Es gab einen geheimen Zugang, der aber zur Zeit von
Ger&ouml;ll versch&uuml;ttet ist. Unter dem Donnerfelsen befindet sich eine
verschlossene T&uuml;r, zu der der Schl&uuml;ssel aber verschwunden ist.
Ich erfahre auch, da&szlig; ein unterirdischer Zugang zum Bl&auml;ulichsee
zugemauert wurde, um eine Grotte trockenzulegen.</P>

<P>Das achte Geheimnis gibt mir Information &uuml;ber den sagenhaften
Silberstein, aus dem ein Schmied Dinge machen kann, die nicht zerbrechen.
Auf dem Gipfel des Eisensteins in der Schlucht soll es noch Silberstein
geben.</P>

<P>Das neunte Geheinmis handelt vom Leder der Zakensteinziege. Das Leder
war nahezu unzerst&ouml;rbar und soll sogar magische Eigenschaften haben.
Ein St&uuml;ck Leder soll im Steinbruch in einer Kuhle unter einem
Felsquader versteckt sein.</P>

<P>Geheimnis 10 handelt von einem unterirdischen Felsendom, in dem eine
Uhr, die in den Boden eingemei&szlig;elt ist, existiert. Von zw&ouml;lf
G&auml;ngen f&uuml;hrt nur einer zu einem Geheimnis, aber erst, wenn die
Uhr richtig aktiviert wird. Um dies zu tun, ben&ouml;tigt man alle
zw&ouml;lf M&uuml;nzen, die man in Vertiefungen legen mu&szlig;, allerdings
nicht in der Reihenfolge ihrer Ziffern. Die richtige Reihenfolge bleibt
zun&auml;chst unklar.</P>

<P>Nun kehre ich zum Kr&auml;merladen zur&uuml;ck und schlafe bis zum
n&auml;chsten Morgen. Ich betrete den Laden und gelange ins Lager, wo ich
Kartoffeln in S&auml;cke f&uuml;llen mu&szlig; ("nimm Sack", "f&uuml;lle
Sack"), solange bis der Kr&auml;mer mich erl&ouml;st. Aus meiner Sicht ist
dies aber &uuml;berfl&uuml;ssig, da es keine Punkte bringt und ich die
M&uuml;nze des Schusters ja bereits habe. Warum also arbeiten?</P>

<P>Mein n&auml;chstes Ziel ist der Blaueisgletscher, wo sich eine gewaltige
Eisfeste befindet. Da mir der Schl&uuml;ssel zum Tor fehlt, klopfe ich an
das Tor. Ich erfahre, da&szlig; ich den Kristallschl&uuml;ssel beschaffen
mu&szlig;, um die Eisfeste betreten zu k&ouml;nnen. Nun erinnere ich mich
an die Wegbeschreibung, die ich auf dem Felsbrocken am Steinbruch gelesen
habe. Der richtige Weg auf die Zackensteinspitze ist folgender vom
Blaueisgletscher aus:<BR>

Ost - Nord - hinauf - Ost - hinauf - Ost - S&uuml;d - hinauf - West - hinauf
- Ost - hinauf - Nord.</P>

<P>Hier finde ich den Wunderbaum, den ich mit der Axt f&auml;lle. Das Holz
kann ich aber nicht tragen. Jetzt untersuche ich noch die Rinde und finde
das gesuchte Bannwort: Abalamahalamatandra.</P>

<P>Nun geht es wieder zur&uuml;ck:<BR>
S&uuml;d - runter - West - runter - Ost - runter
- Nord - West - runter - West - runter - S&uuml;d
- West.</P>

<P>Jetzt auf schnellstem Weg auf den Greifenstein. Hier frage ich den Greif
nach dem Wunderbaum und auf seine Frage, ob ich ihn um einen Gefallen
bitten will, antworte ich "ja". Ich steige auf den Greif und wir fliegen
automatisch zum gef&auml;llten Wunderbaum und dann zum Haus des Schreiners,
wo der Greif mich mit dem Wunderbaum absetzt. Ich gehe nun ins Haus des
Schreiners und bitte ihn, einen Sarg zu bauen ("mach Sarg aus
Wunderbaumholz"). Er verspricht mir, einen Sarg zu bauen, den ich am
n&auml;chsten Tag abholen kann.</P>

<P>Umterwegs zum n&auml;chsten Ziel sollte man Fridolin und die
B&auml;uerin mal zum Stichwort "Schlucht" befragen. Ich begebe mich nun zum
Steinbruch, untersuche die Felsbrocken, hebe den Felsquader und finde ein
B&uuml;ndel in einer Kuhle, das sich als Zackensteinziegenleder entpuppt.
Jetzt gehe ich zum Schuster und gebe ihm das Leder, woraufhin er
verspricht, mir einen Wams anzufertigen, der auch am n&auml;chsten Tag
fertig ist.</P>

<P>Nun gehe ich zur&uuml;ck auf den Greifenstein und spreche das Bannwort
("sag Abalamahalamatandra"). Als Dank f&uuml;r die Befreiung gibt mir der
Greif die Greifeneierschale, die ich umgehend zum Gnom im Wurzelwald
bringe. Er gibt mir daraufhin eine Phiole, die einen Wachtrunk
enth&auml;lt, den ich Fridolin geben soll. Auf die Frage nach Fridolin
erfahre ich unter anderem, da&szlig; der Gnom Salpeter bei ihm kauft, den
er aus den Pilzen holt. Auf die Frage nach den Pilzen, erfahre ich,
da&szlig; die Pilze eine Substanz enthalten, die mit Salpeter ein
hochexplosives Gemisch ergibt. Also frage ich den Gnom nach einer Bombe und
ich erfahre, da&szlig; er S&auml;gesp&auml;ne, Schwefel, Salpeter und Most
ben&ouml;tigt, um eine Bombe zu bauen. Ich frage ihn nach dem Most und
erfahre,da&szlig; ich die B&auml;uerin fragen soll. Ich gehe also zu
Fridolin auf die Dorfbr&uuml;cke und gebe ihm die Phiole. Das Ergebnis ist
aber d&uuml;rftig. Mir ist nicht klargeworden, was man hier tun soll. Um an
Fridolins M&uuml;nze zu kommen, geht man folgenderma&szlig;en vor: Ich
singe, woraufhin Fridolin einschl&auml;ft, ich untersuche die Pulle und
nehme sie. Dies klappt nicht immer gleich beim ersten Mal. Unter
Umst&auml;nden mu&szlig; man das Singen, Untersuchen und Nehmen der Pulle
solange wiederholen, bis man die Pulle hat. Jetzt brauche ich nur noch die
Pulle zu leeren und ich erhalte eine weitere M&uuml;nze (1/53) (M&uuml;nze
11). Das n&auml;chste Ziel ist der Wurzelwald, wo ich die Pilze mit dem
Stock schlage. Es rieselt Salpeter heraus, den ich mitnehme.</P>

<P>Bevor ich nun die letzten Gegenst&auml;nde f&uuml;r die Bombe beschaffe,
gebe ich dem Gnom die S&auml;gesp&auml;ne und den Salpeter. Jetzt gehe ich
zur B&auml;uerin an der Abzweigung am Siee und frage sie nach Most, den sie
mir gibt. Den fehlenden Schwefel finde ich in der Drachenh&ouml;hle, wo ich
die W&auml;nde untersuchen mu&szlig;. Jetzt kehre ich zum Gnom iim
Wurzelwald zur&uuml;ck und gebe ihm den Most und den Schwefel, woraufhin er
mir eine Bombe baut. Er fragt mich, ob ich am Donnerfelsen sprengen will,
was ich bejahe. Er gibt mir auch noch eine Knallerbse, die man in die Bombe
dr&uuml;cken mu&szlig;, um diese zu z&uuml;nden.</P>

<P>Jetzt schlafe ich, bis der n&auml;chste Tag anbricht. Den Wams erhalte
ich jetzt automatisch. Ich kann jetzt ins Haus des Schreiners gehen und den
Sarg nehmen. Um an die letzte M&uuml;nze zu kommen, gehe ich zum
Totengr&auml;ber, gebe ihm den Sarg, erhalte die M&uuml;nze (5/58)
(M&uuml;nze 12), und kann jetzt auch die Schaufel vor dem Haus
mitnehmen.</P>

<P>Das n&auml;chste Ziel ist der Friedhof, wo ich die Gr&auml;ber und die
Kreuze untersuche. Ich grabe am Grab von Adelgund (zweimal) und finde einen
Kristallschl&uuml;ssel (5/63). Nun gehe ich auf den Eisenstein, klettere in
die Schlucht, untersuche die Steine und nehme den Silberstein. Jetzt ist es
wieder Zeit, zu Yanyi ins Wasserschlo&szlig; zur&uuml;ckzukehren, um die
Geheinmisse 11 und 12 zu erfahren. In Geheinmis 11 erhalte ich einen
Hinweis darauf,da&szlig; der Zauberer Kautz mit falschen Karten spielt und
da&szlig; man sich gegen seinen Feuerzauber mit einem magischen Helm aus
Silberstein sch&uuml;tzen kann. Diesen Helm kann der Schmied
anfertigen.</P>

<P>Im zw&ouml;lften Geheinmis berichtet Yanyi &uuml;ber den Zauberer
Klapautz, der den zw&ouml;lften Weisen betrogen hat. Ich erhalte den
Hinweis, da&szlig; ein Wams aus Zachensteinziegenleder mich vor der
Zauberkraft sch&uuml;tzen kann.</P>

<P>Jetzt lege ich alle 12 M&uuml;nzen auf den Teppich und kehre somit in
die erste Zeitsph&auml;re zur&uuml;ck.</P>

<P>Ich nehme die M&uuml;nzen wieder auf und gehe zuerst ins Wirtshaus.
Falls es geschlossen sein sollte, schl&auml;ft man solange, bis es wieder
ge&ouml;ffnet wird. Ich frage den Wirt nach Wein, den er mir auch gibt.</P>

<P>Nun gehe ich zur Schmiede und gebe dem Schmied den Silberstein und den
Hammer. Da sein Feuer aber nicht hei&szlig; genug ist, kann er mir den Helm
nicht bauen.</P>

<P>Nun gehe ich zun&auml;chst zum Troll im n&ouml;rdlichen Finsterwald,
gebe ihm die Weinflasche, woraufhin er mich fragt, ob er ein paar Steine
f&uuml;r mich schleppen soll. Ich sage "ja" und antworte auf seine Frage,
wo er die Steine schleppen soll, mit dem Wort "Donnerfelsen", da ich an den
Ger&ouml;llhaufen denke, der den Zugang zur H&ouml;hle unter dem Wasserfall
versperrt. Der Troll verschwindet und ich folge ihm auf schnellstem Wege
zum Donnerfelsen.</P>

<P>Am Donnerfelsen warte ich solange, bis der Troll den Ger&ouml;llhaufen
wegger&auml;umt hat (5/68). Nun gehe ich nach Norden unter den Felsen und
befinde mich vor einer abgeschlossenen Felsent&uuml;r. Nach Osten kann ich
in eine Grotte gehen. Ich untersuche die Felsfl&auml;che und erkenne,
da&szlig; ich vor einer verwitterten Mauer stehe, die von feinen Ritzen
durchzogen ist. Da ich mich in der N&auml;he des Bl&auml;ulichsees befinde,
k&ouml;nnte es sich um den zugemauerten Zugang zum See handeln. Also stecke
ich die Bombe in die Ritze, dr&uuml;cke die Knallerbse in die Bombe und
gehe sofort nach Westen und dann nach S&uuml;den (5/73).</P>

<P>Die Bombe explodiert, Wasser schie&szlig;t aus der Grotte hervor. Da ich
in dem eiskalten Wasser des Bl&auml;ulichsees ja nicht schwimmen kann,
ben&ouml;tige ich Hilfe. Ich begebe mich zur Seeschlange im Blubbermoor am
Seeufer. Ich frage die Seeschlange nach dem Bl&auml;ulichsee und sage zur
Schlange: "Archibald schwimme zum Bl&auml;ulichsee". Auf die Frage, ob ich
einen Geheimgang entdeckt habe, antworte ich mit "ja", woraufhin die
Seeschlange mir mitteilt, da&szlig; wir uns am Donnerfelsen wiedertreffen.
Sie schwimmt los in Richtung Geheimgang. Am Dommerfelsen fragt mich die
Seeschlange, nachdem sie sich von dem Zugang zum Bl&auml;ulichsee
&uuml;berzeugt hat, ob ich eine Hilfeleistung ben&ouml;tige. Ich sage "ja"
und sie verspricht, in die Tiefen des Sees hinabzutauchen. Treffpunkt ist
oben am See. Also gehe ich zum Bl&auml;ulichsee und warte auf die
Seeschlange. Sie taucht auf und gibt mir einen gro&szlig;en
Felsenschl&uuml;ssel, den sie auf dem Grung des Sees gefunden hat.</P>

<P>Nun gehe ich zun&auml;chst in die Drachenh&ouml;hle auf dem Felsenstein.
Ich frage den Drachen nach Feuer. Auf seine Fragen antworte ich dreimal mit
"ja", steige auf den R&uuml;cken des Drachen und fliege mit ihm zum
Schmied. In der Schmiede facht der Drache das Feuer des Schmiedes an. Der
Schmied kann nun mit dem Hammer den Silberstein bearbeiten. Ich erhalte den
Hel,, den ich ben&ouml;tige, um dem Zauberer Klapautz gegen&uuml;bertreten
zu k&ouml;nnen. Jetzt gehe ich zur Felsent&uuml;r unter dem Dommerfelsen
zur&uuml;ck, &ouml;ffne die T&uuml;r mit dem Felsenschl&uuml;ssel, gehe
nach Norden und zweimal nach Osten und befinde mich im Felsendom. Ich
erinnere mich an das zehnte Geheimnis und lege die M&uuml;nzen in die
Vertiefungen. Die richtige Reigenfolge befindet sich in dem Spiel
beiliegenden Roman "Das Geheimnis der Zeiten" auf Seite 20. Wenn man "lege
die M&uuml;nzen in die Vertiefungen" eingibt, erh&auml;lt man ein Beispiel
wie man die Eingabe vornehmen mu&szlig;. Das Befolgen des Beispieles auf
dem Bildschirm f&uuml;hrt auch bei der richtigen Reihenfolge der
M&uuml;nzen nicht zum gew&uuml;nschten Ergebnis, weil zwischen den Zahlen
der M&uuml;nzen keine Leerstellen zu finden sind. Die Eingabe klappt nur
mit Leerstellen!! Also konkret gesagt, folgende Eingabe f&uuml;hrt zum
Ziel: "lege die M&uuml;nzen in Vertiefungen 8; 12; 9; 10; 1; 6; 11; 4; 2;
5; 7; 3. Der Uhrzeiger bewegt sich und bleibt auf der Zahl 8 stehen. Jetzt
gehe ich in Gang 8 und &ouml;ffne die T&uuml;r. Jetzt kann ich durch
zweimaliges Gehen nach S&uuml;den in die Nebelschlucht gelangen. Da es hier
ein Ungeheuer gibt, darf man nicht den Hebel an der T&uuml;r
bet&auml;tigen, da sonst der Nebel verschwindet und das Ungeheuer
zuschlagen kann. Da ich den Hebel nicht umgelegt habe, kann ich den
kantigen Gegenstand am S&uuml;dende der Nebelschlucht mitnehmen: das
Stundenglas (5/78).</P>

<P>Ich kehre in den Felsendom zur&uuml;ck und nehme die M&uuml;nzen wieder
an mich. Nun kehre ich zu Yanyi ins Schlo&szlig; zur&uuml;ck, lege die
M&uuml;nzen auf den Teppich und gelange wieder in die zweite
Zeitsph&auml;re. Ich nehme die M&uuml;nzen wieder auf und begebe mich auf
den Blaueisgletscher. Das Tor kann ich mit dem Kristallschl&uuml;ssel
aufschlie&szlig;en, womit der Zugang zur Halle der Eisfeste frei ist. Ich
frage den Zauberer Klapautz nach dem Stundenglas. Er fragt mich, ob ich die
Informationen von Kautz habe, was ich bejahe. Nun nehme ich den hier
liegenden Quarzsand. Klapautz fordert mich auf, diesen wieder
zur&uuml;ckzulegen, was ich aber nicht tue. Klapautz wird w&uuml;tend und
schie&szlig;t eine Kugel auf mich ab. Das Wams sch&uuml;tzt mich aber und
ich kann die Eisfeste mit dem Quarzsand verlassen. Ich kehre zu Yanyi ins
Wasserschlo&szlig; zur&uuml;ck und begebe mich mit Hilfe der M&uuml;nzen in
die erste zeitsp&auml;hre. Jetzt gehe ich auf den Eisenstein. Bevor ich das
Felsenschlo&szlig; betrete, &ouml;ffne ich das Stundenglas, leere es und
f&uuml;lle den Quarzsand in das Stundenglas (5/83). Jetzt gehe ich zu Kautz
in die Halle des Felsenschlo&szlig;es und nehme den Basaltsand. Kautz
fordert mich auf, diesen wieder zur&uuml;ckzulegen, was ich aber ignoriere.
Auch er wird w&uuml;tend und schickt einen Feuerstrahl in meine richtung,
der aber keinen Schaden anrichtet, da ich den Helm trage. Jetzt kann ich
den Basaltsand in das Stundenglas f&uuml;llen (5/88) und das Stundenglas
schlie&szlig;en (10/98). Jetzt ist die richtige Sandmischung wieder
hergestellt, und die beiden Zeitsph&auml;ren sind wieder vereint. Nun
mu&szlig; ich nur noch von der Dorfbr&uuml;cke ins Wasser springen, nach
Osten auf die Munterwasserinsel gehen und das Stundenglas auf die Pyramide
stellen (1/99). Alle Bewohner veranstalten ein riesiges Freudenfest. Ich
warte einmal und befinde mich wieder im Spielwarenladen, wo das Spiel
begonnen hat. Das Spiel ist mit 99 Punkten gel&ouml;st. Woher der letzte
noch fehlende Punkt kommt, ist leider unklar.</P>

<HR>
<IMG src="tip0.gif" alt="" width="640" height="22" border="0" usemap="#tip0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>
