<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Englische Magazine</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="smt0">
<AREA shape="rect" coords="460,1,550,22" href="smt.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="smt0.gif" alt="" width="640" height="22" border="0" usemap="#smt0"> 
<HR>
<BR>
                   

<H3 align="center"><B>Englische Magazine</B></H3>

<P>Wer wirklich gute Software legal und preiswert sucht, sollte sich mal
nach Englischen Magazinen umsehen. Zu bekommen sind die Dinger zum Beispiel
in den Buchhandlungen der Bahnh&ouml;fe oder aber im Abonnement, Adressen
folgen unten.</P>

<P>Ich selbst habe mir die letzten Ausgaben von AmigaFormat und Amiga
Computing zugelegt und bin aus dem Staunen nicht mehr rausgekommen. Nicht
nur, das die Magazine nett gemacht und abwechslungsreich sind, die
Coverdisks sind unglaublich gut.</P>

<P>Beispielsweise befindet sich auf den Coverdisks von AmigaComputing
Decemberausgabe ein kommerzieller Midisequencer "Harmoni", und das
kommerzielle Diskettenreperaturprogramm "Quarterback Tools",und zwar
jeweils als Komplettversion ohne Einschr&auml;nkungen, mit der
M&ouml;glichkeit, auf die neueste Version abzudaten(korrekte Formulierung
?).</P>

<P>Den Vogel abgeschossen hat aber AmigaFormat mit der Dezemberausgabe, auf
deren Coverdisk sich IMAGINE 2.0 als Komplettversion befindet,und zwar in
der Version f&uuml;r 68000er ohne FPU.Die Version f&uuml;r Ben&uuml;tzer
mit FPU kann gegen Einsendung der Coverdisk und eine geringe Geb&uuml;hr
angefordert werden,ein Update auf die brandneue Version 3.0 ist
m&ouml;glich und kostet 75 Pfund.F&uuml;r den weniger beg&uuml;terten
Anwender ist eine Beschreibung im Heft,wie man das Programm mit nur 1 MB
zum Laufen bringt, allerdings w&auml;re in diesem Fall wohl eher das Wort
kriechen angebracht...</P>

<P>Falls jemand Interesse an einem Abonnement hat,hier die Adresse des
deutschen Vertreibers:</P>

<P>Abonnement Systemhaus Merkur<BR>
Postfach 11 12 08<BR>
60047 Frankfurt</P>

<P>AmigaComputing kostet im Moment DM 126.00 f&uuml;r 7, DM 234 f&uuml;r 13
Ausgaben.</P>

<P>AmigaFormat kostet im Moment DM 90.00 f&uuml;r 6, DM 180 f&uuml;r 12
Ausgaben.</P>

<P>Abenteuerlustige +/ sparsame sollten vielleicht direkt in
Grossbrittanien bestellen ,der Preis kann je nach Pfundkurs niedriger
liegen, daf&uuml;r wei&szlig; man bei Bestellungen im Ausland nicht immer,
ob das Geld nicht irgendwo verschwindet- ich habe zwar keine
diesbez&uuml;glichen Erfahrungen, mein T&auml;ttowierer kann aber Lieder
davon singen,da er auf die hochqualitative Tinte aus England nicht
verzichten kann und des &ouml;fteren Probleme dieser Art hatte-Entschuldigt
die Ausschweifung.Wer sich von mir nicht beeindrucken l&auml;sst schreibt
vertrauensselig an:</P>

<CENTER>
<TABLE border="0" summary="">
<TR>
<TD><B><U>Amiga Format</U></B></TD> 
<TD>&nbsp;</TD>                     
<TD><B><U>AmigaComputing</U></B></TD>
</TR>

<TR>
<TD colspan="3" align="center">Subscriptions</TD>
</TR>

<TR>
<TD valign="top">Future Publishing Ltd,<BR>
Cary Court<BR>
Somerton, Somerset<BR>
TA 11 7BR<BR>
UK</TD>
<TD></TD>
<TD valign="top">Europress Direct<BR>
Ellesmere Port L65 3EA<BR>
UK</TD>
</TR>
</TABLE>
</CENTER>

<P>Zum Abschluss:S&auml;mtliche Angaben habe ich nach bestem Wissen und
Gewissen eingetippt, sollte was nicht richtig sein, t&auml;te mir das
leid.Diejenigen, die schon l&auml;nger in der Scene sind ,werden diesen
Artikel vielleicht nicht so wichtig finden, totale Anf&auml;nger freuen
sich aber vielleicht doch... Wenn mir jemand schreiben m&ouml;chte,
w&uuml;rde mich das freuen, z.B.wegen Gedankenaustausch etc.,wenn ich sehr
besch&auml;ftigt sein sollte gibts als Antwort nur ne knappe
Postkarte,ansonsten mehr.</P>

<P align="center">Richard Blume<BR>
Postfach<BR>
94124 B&uuml;chlberg</P>

<P>P.S.:Ich mach diese Werbung total umsonst,bin mit den Anbietern weder
verwandt noch verschw&auml;gert und liebe euch alle. Hat irgendwer Imagine
PDs und gibt sie f&uuml;r weniger als die &uuml;blichen DM 5 ab ? Hat
jemand Lust mich an Seinen Erfahrungen betreffs Imagine teilhaben zu
lassen?</P>

<HR>
<BR>
<IMG src="smt0.gif" alt="" width="640" height="22" border="0" usemap="#smt0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

