<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Energie-Manager</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="gam0">
<AREA shape="rect" coords="467,1,539,22" href="gam.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="gam0.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> 
<HR>

<H3 align="center"><B>Energie-Manager</B></H3>

<H4 align="center">von Rauser Software - Freeware-Game/Werbegame</H4>

<P>Endlich, nachdem ich schon seit &uuml;ber 4 Monaten das Spiel hatte,
bekam ich jetzt von Rauser GmbH eine Version des Manager-Spiels
zugeschickt. Wer Energie spart gewinnt! </P>
                   

<P>So beginnt die Anleitung des Energie-Managers. Aufgabe ist es, eine
Resteraunt-Kette aufzubauen und diese Umweltfreundlich und
Energiebewu&szlig;t einzurichten und zu betreiben.</P>

<P>Das f&auml;ngt bei Umweltfreundlichen M&ouml;beln an und h&ouml;rt beim
Fahrad als Transportmittel auf. Unz&auml;hlige M&ouml;glichkeiten sind
gegeben umd den Spielablauf nicht zu eint&ouml;nig erscheinen zu lassen. So
kann man auch an der Bank Aktien kaufen und verkaufen; Kredite aufnehmen
die man leider auch einmal wieder zur&uuml;ckzahlen mu&szlig;.
Nat&uuml;rlich mu&szlig; man auch Personal einstellen, entlassen; die
Restaurants m&uuml;ssen renoviert werden, neue m&uuml;ssen gebaut und
eingerichtet werden.</P>

<P>Wieder einmal ist ein Werbespiel der Spitzenklasse erschienen. Diesmal
unter der Schirmherschaft von Bundesministerium f&uuml;r Wirtschaft.</P>

<P>Jaja, ab und zu macht der Vater Staat doch einmal etwas gutes f&uuml;r
uns.</P>

<P>Bis zu 4 Spieler k&ouml;nnen an diesem Game gegeneinander spielen.
Gespielt wird dabei immer f&uuml;r ein Quartal. Danach kommt der
n&auml;chste Spieler an die Reihe. Ist man alleine oder nur zu zweit
&uuml;bernimmt der Computer automatisch die restlichen Gegner. Allerdings
sind die Computergegner ziemlich leicht zu &uuml;berlisten.</P>

<P>Man f&auml;ngt nat&uuml;rlich mit einen Startkapital an und mu&szlig;
sich nun erst einmal ein Grundst&uuml;ck kaufen. Dann mu&szlig; auf diesem
Grundst&uuml;ck ein Restaurant gebaut werden, f&uuml;r das man dann auch
gleich noch M&ouml;bel kaufen mu&szlig; und gen&uuml;gend Personal
einstellen mu&szlig;.</P>

<P>Desweiteren gibt es noch eine Werbefirma, die man beauftragen kann, auf
verschiedene Arten Werbung f&uuml;r seine H&auml;user zu machen.
Nat&uuml;rlich mu&szlig; man sich nicht auf die &ouml;rtlichen Standort
versteifen. Man kann auch mittels der deutschen Bundesbahn quer durch
Deutschland fahren und dort neue Filialen bauen und er&ouml;ffnen.</P>

<P>So ganz Zwischendurch kann man auch mal im Lotto gewinnen oder es gibt
eine Gasexplosion in einer Filale oder man bekommt Besuch von ein paar
Kakalaken usw.</P>

<P>Das einzigste was auf dem Spielablauf etwas st&ouml;rend einwirkt, ist
die doch ziemliche Menge an Funktionen die man aufrufen mu&szlig;, um ein
Haus zu bauen und einzurichten. Aber bei einem Spiel was man f&uuml;r 1.50
DM bekommen kann ist das wohl noch gerade verschmertzbar.</P>

<P>Au&szlig;erdem ist es nicht gerade schwer das Spiel schnell zu gewinnen.
Wenn man schon &ouml;fters Spiele des Genres gespielt hat, d&uuml;rfte es
kein Problem sein, innerhalb von 3/4 Stunde als Gewinner aus dem Match
herauszugehen.</P>

<P>Fazit: Wers noch nicht hat sollte es sich schleunigst besorgen. Aber
aufpassen !! Es ist ein Freeware-Game; also PD-Soft. Es darf und soll auch
frei kopiert werden. Zahlt auf gar keinen Fall mehr als 3,- DM + Porto
f&uuml;r dieses Game, wenn Ihr es irgendwo kaufen tut. Es ist nun wirklich
nicht Sinn der Sache, das sich gewisse H&auml;ndler mit solchen Games eine
goldene Nase verdienen.</P>

<HR>
<IMG src="gam0.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>
