<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Interview</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="inh0">
<AREA shape="rect" coords="470,1,525,22" href="inhalt.html" alt="zum Inhalt">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="inhalt0.gif" alt="" width="640" height="22" border="0" usemap="#inh0"> 
<HR>

<P>Vor kurzem kam ich doch glatt auf die Idee, mal ein Interview mit der
Firma Art Department zu machen (Karamalz-Cup, Snack-Zone, Backstage), aber
wie so bei uns im Club &uuml;blich ist, wurde aus dem Gespr&auml;ch wieder
einmal das perfekte Chaos.<BR> 
Naja, irgendwann mu&szlig; ich mir doch mal nen Diktierger&auml;t
kaufen.</P>

<P>Also ran an Telefon und die Nummer eingehackt.</P>

<TABLE border="0" width="100%" summary="">
<TR>
<TD valign="top">Telefon:</TD>
<TD>tut, tut (Schon irgendwie bl&ouml;d. Mein Telefon hat schon nen
ziemlich beschr&auml;nkten Wortschatz).</TD>
</TR>

<TR>
<TD valign="top">ArtDep.:</TD>
<TD>Art Department, Gr&uuml;&szlig; Gott.</TD>
</TR>

<TR>
<TD valign="top">APC&amp;TCP:</TD>
<TD>Ja Hallo. Hier ist der Andreas von APC&amp;TCP. Ich br&auml;ucht bitte
mal den Frank.</TD>
</TR>

<TR>
<TD valign="top">ArtDep.:</TD>
<TD>Moment bitte</TD>
</TR>

<TR>
<TD valign="top">Frank:</TD>
<TD>Frank Ziemlinski.</TD>
</TR>

<TR>
<TD valign="top">APC&amp;TCP:</TD>
<TD>Hallo Frank, Andreas von APC&amp;TCP, wie gehts?</TD>
</TR>

<TR>
<TD valign="top">Frank:</TD> 
<TD>Danke, danke. Sind ziemlich im Stre&szlig;. Der ganze Weihnachtstrubel
und der &uuml;bliche Stre&szlig; halt.</TD>
</TR>

<TR>
<TD valign="top">APC&amp;TCP:</TD>  
<TD>Hehe und weils so lustig ist hab ich jetzt nen Attentat auf dich vor!</TD>
</TR>

<TR>
<TD valign="top">Frank:</TD>  
<TD>Oh mein Gott. Na dann schie&szlig; mal los.</TD>
</TR>

<TR>
<TD valign="top">APC&amp;TCP:</TD>

<TD>Oki, also ich m&ouml;chte mal nen Interview mit Dir machen, damit
unsere Leser &uuml;berhaupt mal wissen, wo die Spitzengames
Karamalz-Cup,Snack-Zone und Backstage herkommen.</TD>
</TR>

<TR>
<TD valign="top">Frank:</TD>
<TD>Na klaro, dann fang halt mal einfach an.</TD>
</TR>

<TR>
<TD valign="top">APC&amp;TCP:</TD>
<TD>Wielange gibt es eigentlich Eure Firma schon und wie seid ihr den
&uuml;berhaupt auf die Idee gekommen, eine Firma zu gr&uuml;nden, die
Werbespiele programmiert?</TD>
</TR>

<TR>
<TD valign="top">FRANK:</TD> 
<TD>Also uns gibt es seit ca. 1 1/2 Jahren. Die Firma entstand aus der Idee
heraus, den Computer zu einem Werbetr&auml;ger zu machen. Viele Firmen
wu&szlig;ten und wissen teilweise immer noch nicht, was f&uuml;r ein
gro&szlig;er Werbetr&auml;ger der Computer ist. Ein gutes Spiel ist hier
der Ideale Weg.</TD>
</TR>

<TR>
<TD valign="top">APC&amp;TCP:</TD>
<TD>Und wie gro&szlig; ist inzwischen Eure Firma ?</TD>
</TR>

<TR>
<TD valign="top">FRANK:</TD>                        
<TD>Also wir sind 4 festangestellte und haben noch ca. 50 frei Mitarbeiter.
Das sind dann Programmierer, Grafiker, Konzeptschreiber usw.</TD>
</TR>

<TR>
<TD valign="top">APC&amp;TCP:</TD>     
<TD>Und welche Arbeiten fallen bei Euch so an ?</TD>
</TR>

<TR>
<TD valign="top">FRANK:</TD>
<TD>Im Grunde genommen machen wir alles. Vom Konzept des Spieles
angefangen, &uuml;ber die Programmierung bis hin zur Hotline, Anzeigen
schalten, Verlosungen, Disks verschicken und was halt sonst noch alles
anf&auml;llt.</TD>
</TR>

<TR>
<TD valign="top">APC&amp;TCP:</TD>
<TD>Was ist jetzt eigentlich mit Telekom 2. Da gehen ja ne Menge
Ger&uuml;chte herum?</TD>
</TR>

<TR>
<TD valign="top">FRANK:</TD>
<TD>Tja. Leider ist Telekom kein Freeware-Game. Es darf also nicht kopiert
oder verkauft werden. Die Telekom wollte es leider so. Aber daf&uuml;r
gibts eine riesige Verlosung wo 15.000 St&uuml;ck von Telekom 2 verschenckt
werden. Aber wie gesagt. Weiterkopiert darf es leider nicht werden.</TD>
</TR>

<TR>
<TD valign="top">APC&amp;TCP:</TD>
<TD>Findest Du das gut ?</TD>
</TR>

<TR>
<TD colspan="2" align="center">Gro&szlig;es Schweigen</TD>
</TR>

<TR>
<TD valign="top">APC&amp;TCP:</TD>
<TD>Ok, was werdet Ihr uns denn in der Zukunft bieten ?</TD>
</TR>

<TR>
<TD valign="top">Frank:</TD>
<TD>Eine Menge! Also Bifi 2 kommt, sowie ein Game von einem bekannten
Autoreifenhersteller und ein Game von einem Ministerium wird von uns heraus
gegeben. Au&szlig;erdem wird noch ein Game von Telekom erscheinen. Hier
steuert man eine Spielfigur, die im Bur&ouml;gb&auml;ude einer
Umweltstiftung die Telkomger&auml;te reparieren mu&szlig;. Damit das ganze
nicht zu einfach und langweilig wird, gibt es noch die Sabotagegruppe
S.T.&Ouml;.R. die so ziemlich alles sabotiert, was zu sabotieren geht.</TD>
</TR>

<TR>
<TD valign="top">APC&amp;TCP:</TD>
<TD>Und wann werden wird die ganzen neuen Games in unsere Laufwerke
schieben k&ouml;nnen?</TD>
</TR>

<TR>
<TD valign="top">Frank:</TD>
<TD>Also wenn nichts schief geht, k&ouml;nnt Ihr Mitte 94 schon ein paar
neue Games auf Eure Festplatte bannen.</TD>
</TR>

<TR>
<TD valign="top">APC&amp;TCP:</TD>
<TD>Na gut. Ich sch&auml;tze Du willst jetzt auch mal Feierabend machen.
Ist ja doch schon ziemlich sp&auml;t. Also ich halte Dich jetzt nicht
l&auml;nger auf.</TD>
</TR>

<TR>
<TD valign="top">Frank:</TD>
<TD>Ok, wir h&ouml;ren uns ja bestimmtbald mal wieder. Bis dann und
Tsch&uuml;&szlig;. Ach ja. Noch viele Gr&uuml;&szlig;e an die Mitglieder
des APC&amp;TCP-Clubs.</TD>
</TR>

<TR>
<TD colspan="2">Andreas</TD>
</TR>
</TABLE>
<HR>
<IMG src="inhalt0.gif" alt="" width="640" height="22" border="0" usemap="#inh0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML> 
