<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Jurrasic Park</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="gam0">
<AREA shape="rect" coords="467,1,539,22" href="gam.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="gam0.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> 
<HR>

<H3 align="center"><B><U>JURASSIC PARK(1200`er Version)</U></B></H3>

<P>Etwas sp&auml;t, aber gerade noch rechtzeitig um auf den schon fast
abgefahrenen Zug des Dinofiebers aufzuspringen hat Ocean das Spiel zum Film
herrausgebracht.</P>

<P>Kurz zur Vorgeschichte(Kennt wahrscheinlich eh schon jeder): Ein
steinreicher alter Mann baut einen Park auf dem durch Genmanipulation
"wiederauferstandende" Dinosaurier die Hauptatraktion darstellen sollen. Da
dies eine sehr gewagte Aktion darstellt, wird ein Gruppe von
Wissenschaftlern auf die Insel geschickt, auf der sich der sich der Park
befindet, die die Sicherheit des Parks &uuml;berpr&uuml;fen sollen. Doch
leider kommt es zu einem Zwischenfall im Park, den ein skrupelloser
Gangster verursacht.Die Wissenschaftler stecken mitten auf der von Dinos
nur so wimmelnden Insel fest.Hier kommt nun der Spieler ins Spiel.Ziel des
Spieles ist, sich durch den Park zu schlagen und zum Besucherzentrum
zur&uuml;ckzukehren, um dann mit einem Hubschraubervon der Insel zu
verduften.</P>

<P>Nach einer kurzen Ladepause erscheint ein Bild im dem dan seine
Heimatsprache einsellen kann.Schon hier merkt man das man es mit einer
speziellen 1200`er Version zu tun hat.Auch die Titelmusik ist nicht
schlecht gelungen und stimmt schonmal sorichtig auf die kommende Dinohatz
ein.Das kommende Bild hat nicht mehr die Qualit&auml;t der Vorangegangenen,
ist aber sonst nicht schlecht. Das Spiel selbst ist in zwei Spielebenen
eingeteilt.</P>

<P>Au&szlig;erhalb von Geb&auml;uden bekommt man ein aus der
Vogelperspektive zu sehendes Spielfeld zu Gesicht.</P>

<P>Innerhalb von Geb&auml;uden wird auf eine 3D-Sicht umgeschaltet, die
etwas an Ambermoon erinnert,aber nicht die Qualit&auml;t hat.Daf&uuml;r ist
sie Atemberaubend schnell.</P>

<P>In jedem der einzelnen Level sind kleine Missionen zu erledigen, z.B.
suche die Kinder die sich im Park verlaufen haben oder gehe zum
Versorgungsschupen und aktiviere die Park-Systeme.</P>

<P>Am anfang des Spieles hat man nur eine Waffe, einen "Tazer", der erst
aufladen mu&szlig;, bevor er voll einsatzbereit ist, au&szlig;erdem hat er
nur eine sehr geringe reichweite.</P>

<P>Die zweite Waffe ist eine Schrotflinte.Leider aber ist die Munition arg
begrentzt, so das man sparsam damit umgehen mu&szlig;. So l&auml;uft man
also mehr oder weniger schwerbewaffnet durch die Gehege und knallt
"wehrlose"Dinos ab.</P>

<P>In einigen Spielabschnitten befinden sich Comuterterminals, sogenannte
"Bewegungsmelder".Mit ihrer hilfe kann man verschlossene T&uuml;ren
&ouml;ffnen, oder eine Landkarte aufrufen, oder aber Informationen
&uuml;ber vorhandene Dinosaurier abfragen.</P>

<P>Die Grafik im Spiel ist sehr Detailreich, wirkt aber an h&auml;ufigen
Stellen ziemlich trostlos auch die Dinos sind manchmal gut , oft aber auch
weniger gut gestaltet und animiert.Ab und zu trifft man im Spiel auf
Endgegner. Das sind meistens sehr gro&szlig;e Dinosaurier, die einem das
Leben schwermachen wollen. Als besonders hartn&auml;ckig hat sich der T-Rex
erwiesen.Wer den direkt beim ersten Anlauf meistert kann sich Meister
nennen. Die 3D-Sequenzen sind gut gezeichnet, wirken aber etwas
verschwommen. Der Sound im Spiel ist gut bis sehr gut zu bezeichnen.Man
wird das ganze Spiel &uuml;ber mit Orchestersound beriselt.In den 3D
Abschnitten &auml;ndert sich der Sound sogar wenn man in die n&auml;he
einer Gefahr kommt.</P>

<P>Als nachteil haben sich die langen ladezeiten erwiesen, in denen man
getrost ein oder zwei Kaffe trinken kann.Ein anderer nachteil ist, das man,
wenn man eines von drei Leben verwirkt hat, f&auml;ngt man am anfang des
Levels von vorn an, die meistens nicht gerade sehr klein sind.</P>

<P>Das Spiel ist f&uuml;r die Leute interesant, die entweder Dinos lieben
oder hassen.Denn hier kann man sich seine Lieblinge aus der Urzeit
n&auml;hmlich mal von nahem betrachten.Man kann ihnen aber auch mal so
richtig zeigen wo hier der Hammer h&auml;ngt.</P>

<P>Martin Dreisbach</P>
<HR>
<IMG src="gam0.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>
