<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>LHA</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="tls0">
<AREA shape="rect" coords="470,1,525,22" href="tls.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="tls0.gif" alt="" width="640" height="22" border="0" usemap="#tls0"> 
<HR>

<H3 align="center"><B>"Workbench f&uuml;r den LHA"</B></H3>

<P>Ich habe f&uuml;r Euch 2 Programme getestet die den LHA mit einer
grafischen Benutzeroberfl&auml;che versehen.</P>

<P>Als erstes w&auml;re da Knack von Stephan B&uuml;lling und das
PackerTool von Uwe R&ouml;hm.</P>

<P>Also nun zum Test von Knack. Knack liegt in der Version 1.2 vor und
&ouml;ffnet ein eigenes Window auf der WB. Von dem "Hauptwindow" gelangt
man an die wichtigsten Funktionen von Knack. Das w&auml;ren
(nat&uuml;rlich) das packen,entpacken, anschauen und testen gepackter
Fills. Es wird jeweils ein Dateiauswahl- requester ge&ouml;ffnet indem man
sein gew&uuml;nschtes Fill ausw&auml;hlen kann. Beim packen und entpacken
wird ein neues Shell Fenster ge&ouml;ffnet indem nun alles wie gewohnt
abl&auml;uft. Beim testen kann man gepackte Fills auf evt.Fehler testen
lassen. Weiterhin gibt es eine Formatierfunktion inder man Disks im FFS und
OFS formatieren kann. Wenn man formatieren kann ,kann man auch irgendwelche
Fills l&ouml;schen (wenn mal was schief ging) oder umbennenen.</P>

<IMG src="lha1.gif" alt="" width="640" height= "512">

<P>Weiterhin ist eine "Suchen" Funktion eingebastelt die wie der "Search"
Befehl des CLI arbeitet und manchmal gaaanzsch&ouml;n n&uuml;tzlich ist.
Ooooohh,was haben wir denn danebenein kleines Fragezeichen. Hmmm watn dat
(nach 2 st&uuml;ndigem Probieren) ... ah die Hilfefunktion. Klickt man nun
auf ein Feld so wird eine kleine Information dazu ausgegeben. So das wars
dann eigentlich zu dem Progi. Wenn Ihr mal sehen wollt wie der ganze
Spa&szlig; aussieht dann schaut Euch mal die Screenshots an (d.h wenn
Andreas die mit hierdrauf gemacht hat).</P>

<P>So nun haben wir noch das Packertool von Uwe R&ouml;hm was zur Zeit in
der Version 1.58 vorliegt. Es &ouml;ffnet ,ebenso wie Knack, ein Window auf
der WB. Auch hier kann man &uuml;ber dieses Window fast alle Funktionen
erreichen. Was hierbei anders ist als bei Knack ist folgenes -das
Packertool ist nicht nur f&uuml;r den LHA sondern f&uuml;r nahezu jeden
Packer dieser Art geeignet. Zum Beispiel den Lharc,DMS,Zoo,... . Mittels
eines Requesters kann man dann jeden Packer der installiert ist aufrufen
und mit ihm arbeiten.</P>

<IMG src="lha2.gif" alt="" width="640" height="512">

<P>Bei allen Packern funktionert das &uuml;ber die "Klickfelder" wie
Packen,Entpacken, usw. Das Packertool besitzt ein kleines Menu indem
Packer,Archiev,Ziel und die Datein ausw&auml;hlen kann. All diese
Funktionen sind aber auch mit der Maus erreichbar.</P>

<P>Fazit : Wer nur mit dem LHA arbeitet dem gen&uuml;gt eigentlich Knack.
Knack ist sehr einfach zubedienen und die "Hilfe Funtion" macht die Arbeit
mit Knack f&uuml;r unge&uuml;bte Anwender sehr einfach. Wer au&szlig;er dem
LHA auch noch mit anderen Packern arbeitet dem soll das Packertool ans Herz
gelegt sein. Es ist ebenso leicht zu bedienen wie Knack ,kann aber mehr
Packer "verarbeiten". Beide Tools haben den Sinn den LHA mit einer
Oberfl&auml;che zu versehen voll erf&uuml;llt und ich kann nur jedem
empfehlen sich eines der Tools zubeschaffen.</P>

<P>Jens Neubauer &auml;hm,sorry f&uuml;r die massig Fehler</P>
<HR>
<IMG src="tls0.gif" alt="" width="640" height="22" border="0" usemap="#tls0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>
