<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Lupra Kundenservice</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="smt0">
<AREA shape="rect" coords="460,1,550,22" href="smt.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="smt0.gif" alt="" width="640" height="22" border="0" usemap="#smt0"> 
<HR>
<BR>                                                           

<H3 align="center"><B>Lupra Kundenservice 1. Teil</B></H3>

<P>Wie schaffe ich es, eine Mailbox m&ouml;glichst lange Offline zu halten?
Ihr meint jetzt, da&szlig; das ne bl&ouml;de Frage sei? Stimmt, aber wenn
man ein Modem von Lubra besitzt, sollte diese Frage eigentlich schon
beantwortet sein. Mir erging es n&auml;mlich so:</P>

<P>Ich hab mir ein Lura 14400 Modem besorgt um endlich einmal eine Mailbox
aufzumachen.</P>

<P>Naja, das Modem an sich ist ja nicht schlecht, aber das Personal von
Lupra ??</P>

<P>Ich hatte das alte ROM drin, mit dem es ja massenweise Probleme gab.
Also rief ich die Firma Lupra an und frage nach einem Update. Nachdem ich
den vierten Gespr&auml;chpartner erkl&auml;rt hatte, welches Problem ich
hatte, bekam ich eine Reperaturnummer (Reperatur?) und sollte dann
schnellstm&ouml;glich mein Modem einschicken. Gesagt getan. Am gleichen Tag
schickte ich mein Modem noch zu Lupra. Das war am 19.6.93. Laut den netten
Herrn am Telefon sollte mein Modem schon nach 5 Tagen wieder auf dem Weg zu
mir sein.</P>

<P>Tja, so Mitte Juli packte mich langsam die Panik und ich rief Lupra mal
an.</P>

<P>"Gr&uuml;&szlig; Gott, Sie sind mit Lupra verbunden ..... Bitte
warten."</P>

<P>Diesen Spruch darf man sich erst einmal ein bis zwei Minuten
anh&ouml;ren, bis endlich mal jeamdn an die Leitung geht; und Telekom freut
sich! Naja, die nette Dame erkl&auml;rte mir, das an einem Mittwoch um 11
Uhr vormittags leider keiner der Techniker im Hause sei und ich bitte
nachmittags bei der Hotline anrufen sollte.</P>

<P>Gesagt getan. Nachmittags die Hotlinenummer angerufen und erst mal
f&uuml;r ca. 10 DM den Spruch "Bitte warten" angeh&ouml;rt.</P>

<P>Als ich endlich jemanden an der Strippe hatte, wurde mir so langsam mal
klar, wie dort gearbeitet wird. So sagte einer der Mechaniker folgende nach
meiner Meinung echt coole Spr&uuml;che auf: "ROM-Update? Geht doch noch gar
nicht!", "Aber es sind schon alle Updates herausgegangen", "Sorry, der
Computer zeigt keine Bearbeitung des genannten Modems an!", "Aehmmmm,
moment! Dahinten liegt noch ein Haufen Pakete. Ich schau mal schnell nach".
Ich glaube das die letzte Aussage am treffenden war.</P>

<P>Naja, ich rief noch ein paar mal an, bis man mir auf einmal
erkl&auml;rte, das Modem w&auml;re nie bei ihnen angekommen.</P>

<P>Ok, also ab zur Post und einen Nachforschungsantrag gestellt.</P>

<P>Aber oh Wunder, schwuppdiwupp, am n&auml;chsten Tag kam UPS bei mir
vorbei und brachte mir mein angeblich nicht angekommendes Modem mit neuem
ROM und Rechnung von Lupra ins Haus. Hmm, dachte ich. Eine Rechnung und die
haben angeblich meine Adresse nicht mal in ihren Computer? Komisch!</P>

<P>Jetzt wurde mir entg&uuml;ltig klar, das UPS den Updateservice von Lupra
&uuml;bernommen hat, da Lupra das Modem ja angeblich nie erhalten
hatte.</P>

<P>Also wieder zur Post, Nachforschungsantrag r&uuml;ckg&auml;ngig gemacht
und ab nach Hause um meine Mailbox wieder Online zu schalten.</P>

<P>Aber wies der Teufel will wars damit nix. Modem kaputt ! Echt toll !</P>

<P>Also, noch am gleichen Tag wie ich es bekommen habe, rief ich dann
wieder mal bei Lupra an, zahlte ca. 20 Einheiten f&uuml;r den netten Spruch
vom Tonband um dann zu erfahren, das ich es zur&uuml;ckschicken sollte,
damit sie die "Transportsch&auml;den" beheben k&ouml;nnen.</P>

<P>Gesagt getan, also los zur Post als Einschreiben. Inzwischen hatten wir
aber schon mal Ende Juli.</P>

<P>Nun hatten wir Mitte AUgust und ich rief mal wieder bei Lupra an, da ja
wieder mal ein &uuml;berm&uuml;tiger Techniker gemeint hatte, da&szlig; das
Modem in zwei Tagen fertig w&auml;re. Nach ca. 5 Anrufen bekam ich dann
wieder einmal zu h&ouml;ren, da&szlig; das Modem wieder einmal nicht
angekommen w&auml;re. Da bin ich ehrlich gesagt ziemlich sauer geworden und
hab gleich mal die Anschrift meines Anwalts durchgegeben. Irgendwie hat das
anscheinend doch etwas beeindruckt.</P>

<P>Wenn ich einen Nachforschungsantrag stelle und dieser best&auml;tigt,
da&szlig; das Modem angekommen sei, bek&auml;me ich sofort ein
Ersatzger&auml;t, bis mein eigenes repariert oder aufegunden sei. "Und das
kann dauern, bis man so etwas hier findet" meinte Mister F. noch zu
mir.</P>

<P>Also hab ich mal wieder nen Nachforschungsantrag gestellt.</P>

<P>Vielleicht sollten die sich mal einen Amiga zu verwalten Ihrer
Posteing&auml;nge anschaffen oder jemanden an ihren PC setzten, der sich
damit auskennt.</P>

<P>Freundlich waren die Leute von Supra ja bis jetzt. Dar&uuml;ber kann man
sich wirklich nicht beschweren. Aber was hilft einem das, wenn sie absolut
unf&auml;hig sind f&uuml;r den Job den sie da machen.</P>

<P>Tja, der Nachforschungsantrag best&auml;tigte mir, da&szlig; das Modem
korrekt bei LUPA ausgeliefert worden ist. Diesen schickte ich sofort zu
meiner Lieblingsfirma.</P>

<P>Als ich nach zwei Wochen noch keine Antwort erhalten hatte, rief ich
wieder einmal bei den Jungs von Lupra an. Erst mal mu&szlig;te ich 10
Einheiten warten, bis ich den zust&auml;ndigen Mitarbeiter an der Leitung
hatte. Der wu&szlig;te aber auch nicht weiter und mu&szlig;te erst mal bei
der Gesch&auml;ftsleitung nachfragen. "Die Gesch&auml;ftsleitung ruft
zur&uuml;ck" war dann die Antwort. Na, da bin ich ja mal gespannt?!</P>

<P>Nun, heute haben wir inzwischen den 13.9.93 und ich habe mich mal wieder
erbarmt, bei dieser komischen Firma anzurufen. Zur&uuml;ckgerufen haben sie
&uuml;brigends nicht. Diesmal habe ich mich aber nicht mit einem
Laufburschen unterhalten sondern habe mir gleich mal jemanden von der
Gesch&auml;ftsleitung geben lassen. Als ich endlich jemanden an der Strippe
hatte, lie&szlig; ich erst mal ne 5 min&uuml;tige Schimpforgie auf den
armen Kerl einwirken um mich dann, als ich mich wieder abreagiert hatte,
mit ihm normal zu unterhalten. Trotz von mir eigens entwickelter
Schimpfw&ouml;rter war der nette Herr am anderen Ende der Leitung richtig
&uuml;berfreundlich zu mir. Hatte der etwa nen schlechtes Gewissen ?</P>

<P>Naja, das ganze ging dann so aus, da er mich nochmals zur&uuml;ckrief um
mir mitzuteilen, das ich sp&auml;terstens in 2 Wochen mein Modem oder ein
Ersatzger&auml;t haben sollte. Morgen will er mich deswegen nochmal
anrufen. Bin ja mal gespannt. Man kann sich ja auf Lupra so gut
verlassen.</P>

<P>Jetzt haben wir Montag den 14.9.1993 und die Gesch&auml;ftsf&uuml;hrung
von Lupra hat mich doch glatt pers&ouml;nlich heute fr&uuml;h
zur&uuml;ckgerufen. Jetzt wollte der nette Herr noch einmal alle Angaben
&uuml;ber mein Modem haben. Ein paar Minuten sp&auml;ter erhilt ich einen
Anruf, in dem mit mitgeteilt wurde, das man mein Modem nicht finden
k&ouml;nne und noch heute ein neues Modem an mich per UPS geschickt werde.
Dann h&ouml;rte ich noch ein halbes Dutzend Entschuldigungen und ich legte
mit hochgesteckten Hoffnungen in froher Erwartung auf mein Modem den
H&ouml;rer auf.</P>

<P>So und das Modem kam auch wie versprochen an, aber ...... Das k&ouml;nnt
Ihr in der n&auml;chsten Ausgabe der NoCover lesen ! Denn die Story ist
noch lange nicht zu Ende. Jetzt haben wir dem 2.1.94 und ich habe immer
noch gewaltige Probleme mit Lupra.</P>

<P>Hmm. Die haben wirklich eine verdammt gute Ordnung in ihrem Lager.
Immerhin sind da 2 Modems von mir verschwunden. Und das ist noch lange
nicht alles. In der n&auml;chsten NoCover k&ouml;nnt Ihr die Geschichte von
meinem 3. (!!) verschwundenen Modem bei Lupra lesen..</P>

<P>Andreas</P>
<HR>
<BR>
<IMG src="smt0.gif" alt="" width="640" height="22" border="0" usemap="#smt0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>
