<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Messe 93</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="smt0">
<AREA shape="rect" coords="460,1,550,22" href="smt.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="smt0.gif" alt="" width="640" height="22" border="0" usemap="#smt0"> 
<HR>
<BR>                                                           

<H3 align="center"><B>Messe 93</B></H3>

<P>Ja, ich weiss. F&uuml;r nen Messebericht ist schon ganz sch&ouml;n
sp&auml;t. Aber ich m&ouml;chte ja auch nciht das &uuml;bliche schreiben
was in jeder Zeitung schon steht, sondern einmal das ganze aus der Sicht
des Ausstellers. Die Bilder sind alle abends nach der Messe gemacht worden.
Die Leute die da noch rumlaufen, sind entweder Aussteller oder noch
Nachz&uuml;gler.</P>

<P>Gegen LeerDisk und R&uuml;ckporto kann man &uuml;brigends bei mir eine
Disk bekommen, wo noch mehrere solcher Pics von der Messe drauf sind.</P>

<P>Ich dachte eigentlich, da&szlig; ich mich gut auf die Messe vorbereitet
habe. Naja, dachte ich zuminderst.</P>

<P>Das ganze Chaos ging mit meinem Auto am Dienstag vor der Messe los. Ich
wollte am morgen Einkaufen fahren, stieg ins Auto ein, drehte den
Z&uuml;ndschl&uuml;ssel um und .... nichts! Also ab in die Werkstatt, Wagen
abgeschleppt und am Mittwoch um 9 Uhr morgens konnte ich ihn holen.</P>

<P>So kleine Probefahrt gemacht, abgestellt und dann noch schnell die Post
die sich bei mir angestapelt hat erledigt.</P>

<P>Nachmittags so um 3 Uhr wollte ich zum J&uuml;rgen fahren, der mir ein
Video mit Schwartz Animationen erstellen wollte. Dieses Video wollten wir
auf der Messe vorzeigen. Also stieg ich ins Auto ein, fuhr auf die Autobahn
und bei ca. 180 km starb mir der Motor ab und aus ! Also nichts wie hin mit
dem ADAC zur Werkstatt.</P>

<P>Dort angekommen erkl&auml;rte man mir, da&szlig; man heute keine Zeit
mehr h&auml;tte und ich das Auto fr&uuml;herstens morgen abend haben
k&ouml;nne. Naja es war ja auch schon kurz nach 18 Uhr.</P>

<P>Nur morgen Mittag m&uuml;&szlig;te ich ja schon in K&ouml;ln sein.</P>

<P>Mit etwas flennen und betteln hab ich es dann doch geschafft, da&szlig;
mir ein Mechaniker meine Karre repariert hat. Echt gigantisch. Nen Teil,
ungef&auml;hr so gro&szlig; wie nen KickRom f&uuml;r 200 Mark und 5 Minuten
Arbeit.</P>

<P>So und als ich dann endlich beim J&uuml;rgen ankam war der nicht mehr
da!</P>

<P>Den Videofilm habe ich mir dann um 0.30 bei ihm abgeholt.</P>

<P>Dann haben wir (Meine Freundin und ich) das Auto vollgeladen und sofort
ab nach K&ouml;ln.</P>

<P>War echt toll zum fahren. Kein Auto auf der Autobahn, daf&uuml;r aber
die ersten 600 km Nebel mit Sichweite unter 50 Meter.</P>

<P>Tja und 150 km vor K&ouml;ln hats mir auch noch nen Reifen zerissen. Und
wie sollte es auch anders sein, mein Wagenheber war nat&uuml;rlich kaputt
und ungebrauchbar.</P>

<P>Hehe. Immerhin hat sich meine ADAC-Mitgliedsschaft gelohnt. Innerhalb
von 48 Stunden hatte ich drei mal Besuch vom ADAC.</P>

<P>Ach endlich. Wir haben das Messegel&auml;nde gefunden. Aber wo ist jetzt
die verdammte Laderampe wo ich unser ganzen Zeug ausladen kann ?</P>

<P><IMG src="mes1.png" width="405" height="300" alt="" align="left"
hspace="6"> Aber wer suchet, der findet irgendwann auch. Und dann durften
wir auch noch zu zweit den ganzen Krempel 500 Meter durch die Halle bis zu
unserem Stand schleppen. Und das war ne ganze Menge. (1 Fernseher, 1
Videorekorder, 1 Monitor, 1 A2000, Tastatur, Maus usw., 5000(!) vorkopierte
Disks, ein paar Dutzend 1990 und Databench, Ma&szlig;ig Zettel, Stifte,
Tesa Kabel usw.) K&ouml;nnt ihr euch vorstellen, da&szlig; das alles in
einem 318er BMW drinn war.</P>

<P>Auf dem Stand angekommen klappte dann eigentlich alles Wunderbar. Unsere
Leute kamen alle wie geplant. Der Stand war &uuml;berhaupt schon einmal da
und mit dem aufbauen und herrichten waren wir auch p&uuml;nktlich
fertig.</P>

<P>Am Freitag morgen gings dann los. Kein durchkommen vo unserem Stand und
besch&auml;ftigt waren wir ganz sch&ouml;n. Abends war dann noch ne kleine
Aussteller-Fete die von der Messeleitung veranstaltet wurde. Essen und
Trinken umsonst. Da waren wir nat&uuml;rlich alle dabei.</P>

<P>Am Samstag wars dann die absolute H&ouml;lle an unserem Stand. Obwohl
wir wahnsinnig viele Leute waren, konnten wir uns nicht einmal 5 Minuten
hinsetzen. Und am Abend machte IBM ne kleine Fete an ihrem Stand, wo wir
nat&uuml;rlich auch flei&szlig;ig mitfuttern durften. Tja, Commo konnte
sich sowas anscheinend nicht leisten.</P>

<P><IMG src="mes2.png" width="405" height="315" alt="" align="left"
hspace="6"> Am Sonntag wars dann etwas ruhiger und man konnte sogar mal was
essen. In der Nacht vom Samstag auf Sonntag bekamen wir noch die Backstage
Karten f&uuml;r eine gro&szlig;e Verlosung zugeschickt, die wir dann noch
schnell verteilten. Waren immerhin 10.000 St&uuml;ck.</P>

<P>Der Abzug vom Stand und die Heimfahrt lief Gott sei Dank ohne Probleme
ab.</P>

<P>So und jetzt gibts noch ne kleine Auflistung, was wir so alles gemacht
haben und natuerlich ne Danksagungsliste.</P>

<P>Also wir hatten einen 12 qm Reihenstand. Der war nat&uuml;rlich
zugepflastert mit Plakaten, das man keine Wand mehr gesehen hat. Aufgebaut
hatten wir einen Videorekorder, Fernseher, A500, A1000, A2000, A4000 +
Monitore.<BR> An dem A2000, 4 Laufwerke, A1000, 2 Laufwerke kopierten wir
am Samstag ohne Pause.<BR> Insgesamt haben wir ca. 4500 PD Disks f&uuml;r
DM 2.00 verkauft. (Leider habe ich teiulweise die falschen Disks vorkopiert
und wir mu&szlig;ten den ganzen Samstags Disks &uuml;berkopieren.)<BR> Dann
noch einige 1990, Databench, Games Tips &amp; Tricks Datenbanken usw.
Insgesamt hatten wir einen Umsatz von ca. 10.000 DM. Der deckte aber mehr
oder weniger die ganzen Unkosten.<BR> Gewinn haben wir also keine gemacht.
Aber die Unkosten haben wir rausbekommen. Und das war die Hauptsache. Auf
jedem Fall sind wir n&auml;chstes Jahr wieder dabei !</P>

<P>Ein ganz gro&szlig;es Dankesch&ouml;n m&ouml;chte ich an alle richten,
die uns absolut kostenlos geholfen haben. Und das war meist wirklich harte
Knochenarbeit.</P>

<P>Also fangen wir mal an. Die Reihenfolge ist nat&uuml;rlich rein
Zuf&auml;llig und es soll mir bitte keiner b&ouml;se sein, wenn ich ihn
vergessen habe.<BR clear="all"> </P>

<TABLE border="0" summary="">
<TR>
<TD valign="top">
-&nbsp;J&uuml;rgen&nbsp;Tr&auml;ger:</TD>

<TD>Einer unserer "Verk&auml;ufer". War ne starke Ausgabe der INFOX.</TD>
</TR>

<TR>
<TD valign="top">
-&nbsp;Bernd&nbsp;K&uuml;nnen :</TD>

<TD>Noch ein "Verk&auml;ufer". Danke f&uuml;r den Kaffe.</TD>
</TR>

<TR> <TD valign="top">-&nbsp;Andreas&nbsp;Neuman:</TD>

<TD>Eigemntlich sollte er nur 1990 vorf&uuml;hren. Er entpuppte sich dann
aber als perfekter "Verk&auml;ufer".</TD>
</TR>

<TR>
<TD valign="top">-&nbsp;Markus&nbsp;Spiering:</TD>

<TD>Mein Cosysop. Er war eigentlich nur normaler Besucher auf der Messe.
Als er aber an unserem Stand vorbei schaute, wurde er gleich eingespannt
und erst am Sonntag abend wieder in die Freiheit entlassen. Danke f&uuml;r
die spontane Hilfe.</TD> </TR>

<TR>
<TD valign="top">-&nbsp;Ygar:</TD>

<TD>Super. Er hat uns ca. 2000 Disks auf der Messe kopiert und auch ne
Menge verkauft.</TD>
</TR>

<TR>
<TD valign="top">-&nbsp;Eric&nbsp;Hambuch:</TD>

<TD>Eigentlich sollte auch er nur die Databench vorf&uuml;hren. Aber im
Endeffekt verkaufte er unsere PD-Disks.</TD>
</TR>

<TR>
<TD valign="top">-&nbsp;Ulrich&nbsp;Hambuch:</TD>

<TD>Man, der hatte einen Elan. Und verkaufen konnte der. Einfach
gigantisch. Vor allem war er der j&uuml;ngste von uns allen. Echt super,
wie der geschuftet hat. Nochmals Merci Ulrich! Achja und die
Backstage-Zettel hat er unter anderem auch ganz gewaltig ausgeteilt.
N&auml;chstes mal gehen wir noch zusammen Essen!</TD>
</TR>

<TR>
<TD valign="top">-&nbsp;Erics&nbsp;2.&nbsp;Bruder:</TD>

<TD>Aehm, jetzt habe ich doch glatt seinen Namen vergessen. Is ja richtig
peinlich. Auf jedem Fall hat er uns am Freitag mit Cola und Chips
versorgt.</TD>
</TR>

<TR>
<TD valign="top">-&nbsp;Erics&nbsp;Eltern:</TD>

<TD>Danke da&szlig; meine Freundin und ich bei Euch &uuml;bernachten durfte.</TD>
</TR>

<TR>
<TD valign="top">-&nbsp;Nils&nbsp;Kasupe:</TD>

<TD>Hat auch etwas verkauft &amp; einige Disks kopiert.</TD>
</TR>

<TR>
<TD valign="top">-&nbsp;Christine&nbsp;Hinckel:</TD>

<TD>Meine Freundin:-) Hat auch ganz sch&ouml;n geschuftet und ne Menge
verkauft. Hat auch mich Moralisch etwas aufgebaut, als ich um 4 Uhr
Nachmittags noch keine Zeit zum Essen hatte.</TD>
</TR>

<TR>
<TD valign="top">-&nbsp;Andreas&nbsp;Magerl:</TD>

<TD>Hach, das bin ja ich. Danke :-)</TD>
</TR>

<TR>
<TD valign="top">-&nbsp;Fotograf&nbsp;INFOX:</TD>

<TD>Mal wieder peinlich. Hab doch glatt auch seinen Namen vergessen. Ich
glaub er hie&szlig; Stefan? auf jedem Fall Danke f&uuml;r Deine Hilfe.</TD>
</TR>

<TR>
<TD valign="top">-&nbsp;J&uuml;rgen&nbsp;Winter:</TD>

<TD>F&uuml;r das Starke Video mit Schwartz-Animationen.</TD>
</TR>
</TABLE>

<P>Und nochmal an alle Danke. Sie haben nicht nur umsonst an unserem Stand
geholfen; Nein, sie haben sogar ihre Ausstellerausweise selbst noch
bezahlt. Ich hoffe das alle n&auml;chstes Jahr wieder dabei sind. Es ist ja
wirklich gut gelaufen. Keine Streiterein, absolut super Teamwork. Wir waren
wie ein gut eingespieltes Team. Und das obwohl wir uns teilweise nur vom
Telefon oder durch Briefe kannten. DAAANNNNKKKEEEE !!!</P>

<P>Bedanken mu&szlig; ich mich auch noch bei unseren Mitgliedern, die uns
eine Menge PD-Disks abgekauft haben. Jede dieser Disks hat dazu
beigetragen, das wir die Kosten f&uuml;r den Stand wieder heraus bekommen
haben. DANKE.</P>

<P>Andreas</P>
<HR>
<BR>
<IMG src="smt0.gif" alt="" width="640" height="22" border="0" usemap="#smt0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>
