<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Night Shift</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="gam0">
<AREA shape="rect" coords="467,1,539,22" href="gam.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="gam0.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> 
<HR>

<H3 align="center"><B>Night Shift</B></H3>

<H4 align="center">von Lucasfilm von der M&amp;T SpieleDisk 11/93<BR>
Preis DM 19.80</H4>

<P>Wieder einmal ist ein Lucasfilm Game auf der M&amp;T Spieledisk
erschienen. Anscheinend hat da M&amp;T die ganzen Rechte von Lucasfilm
bekommen. Naja, uns kanns ja rechts sein. Auf diese Art und Weise kommt man
wenigstens zu guten und vor allem g&uuml;nstigen Games. </P>
                   

<P>In diesem Spiel ist man Arbeiter in einer Spielzeugfirma die sich IML
nennt. Genau gesagt stellt diese Firma Spielzeugpuppen her. Und das auf
geniale Art und Weise. W&auml;re sch&ouml;n, wenn das irgendwann einmal
wirklich m&ouml;glich w&auml;re. Es enstehen keine Abf&auml;lle, keine
Abgase und das Rohmaterial besteht aus 100% Recyclingmaterial.</P>

<P>Die Anleitung ist auch sch&ouml;n lange und ausf&uuml;hrlich gehalten
und sogar die Festplatteninstallation funktioniert einwandfrei.</P>

<P>Es l&auml;uft sogar mit 512 KB Ram. Allerdings sollte man dann keine
externen Laufwerke oder andere Programme laufen haben.</P>

<P>Die Musik ist ganz nett gehalten und die Grafik ist auch in Ordnung.
Night Shift ist eine Art Plattformgame, wo man von Plattform zu Plattform
h&uuml;pft um dort bestimmte Aufgaben zu l&ouml;sen. Im Hintergrund ist das
sogenannte BIEST; die Maschine, die die Puppen herstellt. Die Plattformen
sind so integriert, das der Effekt entsteht, das man die Maschine hinauf
und hinunter klettert bzw. h&uuml;pft. Ein paar kleine
F&ouml;rderb&auml;ndern erschweren das ganze noch etwas. Nun hat man die
Aufgabe, die Maschine erst einmal zu starten und dann diverse
Maschinenteile die kaputt gehen wieder zu reparieren. Auch mu&szlig; man
sich ab und zu an einem Fahrrad abstrampeln umd die Batterie die daran
angeschlossen ist, wieder aufzulanden. Das BIEST stellt die Puppen in zwei
Teilen her; das Oberteil und das Unterteil. Diese Teile werden automatisch
zusammengesetzt. Allerdings mu&szlig; man als flei&szlig;iger Arbeiter
aufpassen, das sie auch richtig zusammen gesetzt werden. Zwei K&ouml;pfe
aufeinander schaun nun einmal nicht gerade gut aus.</P>

<P>Au&szlig;erdem mu&szlig; man noch darauf achten, das beide Teile die
gleiche Farbe haben, die Brennkammer nicht ausgeht, gen&uuml;gend
Rohmaterial vorhanden ist ..... usw. Zwischendurch erscheinen dann auch
noch ein paar Monsterkakalaken die man mit einem Staubsauger oder einer
Venusfalle killen mu&szlig;.</P>

<P>Das ganze w&auml;re im Grunde ja ziemlich simpel und einfach, wenn da
nicht eine Zeitbegrenzung w&auml;re in der Mann eine bestimmte Art und eine
bestimmte Menge an Puppen produzieren mu&szlig;.</P>

<P>Im Grunde genommen ist das Spiel f&uuml;r 20,Mark ein absoluter Hit. Nur
ich hatte einige Probleme damit. Ich konnte machen was ich wollte, ich
wurde immer nach der ersten Schicht von meinem Chef gefeuert. Und das
obwohl ich genau den L&ouml;sungsweg f&uuml;r die erste Schicht von der
Anleitung befolgt habe.</P>

<P>Hmm und die verdammte Sicherheitsabfrage machte mir auch ganz gewaltige
Schwierigkeiten. Ich habs einfach nicht geschafft, den richtigen Code
herauszufinden. Viellleicht wurde ich ja deswegen immer gefeuert.</P>

<P>Au&szlig;erdem finde ich, das die Spielfl&auml;che viel zu bunt ist und
man gar nicht genau erkennen kann wo man was machen mu&szlig;. Da hilft
einem auch die Anleitung nicht viel weiter. Die Screenshots wo die
einzelnen Maschinenteile erkl&auml;rt sind sind an der falschen Stelle
plaziert und der Lageplan wurde einfach und simpel per Hand gemalt, wobei
man nicht feststellen kann ob das gezeichnete Objekt oben links oder unten
links an der Maschine sein soll.</P>

<P>Fazit: Man h&auml;tte die Anleitung etwas besser auslegen sollen. Dann
h&auml;tte vielleicht sogar ich die erste Schicht geschafft. Aber was will
man schon gro&szlig;artiges f&uuml;r 19.80 DM verlangen ?</P>

<P>Andreas</P>
<HR>
<IMG src="gam0.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML> 
