<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Spielekiste 350-375</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
"#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary=""
bgcolor="#000000">
<TR>
<TD>
<MAP name="pdl0">
<AREA shape="rect" coords="460,1,550,22" href=
"pdl.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary=
"" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="pdl0.gif" alt="" width="640" height=
"22" border="0" usemap="#pdl0"> 
<HR>
<BR>
                   

<H3 align="center"><B>S p i e l e k i s t e # 350</B></H3>

<H4><B>N a u t i l u s</B></H4>

<P>Mit dem U-Boot hilfst Du diesmal den Arch&auml;ologen beim Suchen und
Einsammeln von T&ouml;pfen und Trinkgef&auml;&szlig;en (Amphoren) auf dem
Meeresgrund. Wenn es nicht mehr weiter geht, dann kannst Du auch schon mal
einen Felsen wegsprengen. Aber Du hast nur eine begrenzte Anzahl Torpedos!
Und dann sind da auch noch gef&auml;hrliche Raubfische, denen Du ausweichen
mu&szlig;t! - Ab 7 Jahre. Shareware.<BR> Autor: MVT-Man</P>

<H4><B>A c h j a a . . .</B></H4>

<P>Wort mit 5 Buchstaben: . A C H S. Aber was ist nur der erste?? Du hast
nur noch wenige Sekunden und nur noch einen Versuch! Etwa W A C H S ?
Vorbei. Falsch geraten. Und dann greifst Du Dir an den Kopf - D A C H S.
Wie konntest Du da nicht drauf kommen??? Ach ja.... Hier ist die wohl beste
Umsetzung des spannenden Wortratequizes aus SAT-1: F&uuml;nf mal F&uuml;nf.
In zw&ouml;lf verschiedenen Spielarten! F&uuml;r alt und jung. Leicht
eingeschr&auml;nkte Sharewareversion (mit begrenzter Wortdatei, ohne Editor
und abspeicherbaren Highscores); die Vollversion ist f&uuml;r DM 10,- beim
Autor erh&auml;ltlich. Ab 8 Jahre.<BR> Autor: Peter H&auml;ndel</P>

<H3 align="center"><B>S p i e l e k i s t e # 351</B></H3>

<H4><B>Jeopard V1.2</B></H4>

<P>Klassisches Strategiespiel f&uuml;r 2-8 Spieler mit dem Ziel, die ganze
Welt zu erobern ("RISIKO"). - Shareware.<BR> Autor: Robert A. Casper</P>

<H4><B>Bubba&acute;N&acute;Stix</B></H4>

<P>Neues knuddeliges Jump&amp;Run der Spitzenklasse! Witzige Animationen,
fesselndes Gameplay und wundersch&ouml;ne Grafiken machen dieses spielbare
Preview zu einem Augenschmaus. Die Vollversion sollte ab Herbst &acute;93
erh&auml;ltlich sein.<BR> Hersteller: CORE Design Limited</P>

<H3 align="center"><B>S p i e l e k i s t e # 352</B></H3>

<H4><B>ComputerBoggle</B></H4>

<P>Wortratespiel f&uuml;r 1 - 3 Spieler. Shareware.<BR> Autor: Paul
Ciulla</P>

<H4><B>68000er Spiel</B></H4>

<P>Wirtschaftssimulation um eine Chip-Produktion der 680xx-Reihe. Aber
Vorsicht - der Markt ist hei&szlig; umk&auml;mpft und Intel darf auch nicht
untersch&auml;tzt werden...<BR> Autor: Werni Ammann</P>

<H3 align="center"><B>S p i e l e k i s t e # 353</B></H3>

<H4><B>BattleStar</B></H4>

<P>Spannenden Text-Adventure in der Art der gro&szlig;en Infocom-Games
(Hitchhiker&acute;s Guide, Zork, u.a.). Du findest Dich mitten im
Kampfget&uuml;mmel in einem kleinen Raumgleiter und m&ouml;chtest "nur" zu
Deinem Planeten zur&uuml;ck... Gute Englisch-Kenntnisse sind
erforderlich!<BR> ---&gt; F&uuml;r Prozessoren ab 68020 aufw&auml;rts gibt
es eine spezielle Version: BattleStar.020 (bitte die zweite
startup-sequence benutzen).<BR> Amiga-Version: David Ingebretsen</P>

<H3 align="center"><B>S p i e l e k i s t e # 354</B></H3>

<H4><B>MineTrasher</B></H4>

<P>Im Jahre 2008 sind die Resourcen der Erde ausgesch&ouml;pft und die
Bodensch&auml;tze kommen vom Planeten XTROM. Doch dort geschieht eine zur
Katastrophe: durch den Raubbau wurde die Oberfl&auml;che so stark
unterh&ouml;hlt, da&szlig; gro&szlig;e Teile einst&uuml;rzten. Es ist nun
Deine Aufgabe als Mine Trasher, da&szlig; Ger&ouml;ll zu beseitigen und die
G&auml;nge wieder passierbar zu machen - wenn da nicht auch noch diese
Aliens w&auml;ren... Mischung aus BoulderDash und Ballergame.
Update-Version Oktober 93. - Freeware.<BR> Autoren: Roy Schneider &amp;
Sven Schr&ouml;der</P>

<H3 align="center"><B>S p i e l e k i s t e # 355</B></H3>

<H4><B>War</B></H4>

<P>Packendes Weltraum-Strategie- und Actiongame f&uuml;r 1 oder 2 Spieler.
Die galaktischen Reiche der Vaganen und Zardonen versuchen die
Vorherrschaft zu gewinnen und es ist nun Deine Aufgabe, ein Volk auf dem
kampfbetonten Weg dahin zu f&uuml;hren. - Shareware.<BR> Autor: Philip G.
Harle</P>

<H3 align="center"><B>S p i e l e k i s t e # 356</B></H3>

<H4><B>KNAX - Das Computerspiel</B></H4>

<P>Als Dodo oder Didi mu&szlig;t Du Fetz Braun und seiner fiesen Bande eins
auswischen. Zun&auml;chst sieht Deine Aufgabe noch recht einfach aus: Du
l&auml;ufst &uuml;ber ein 6x6 Feld und sammelst M&uuml;nzen oder
Nahrungsmittel auf - aber h&uuml;te Dich vor den Ganoven! Doch dann werden
die Felder nur noch in einer Richtung begehbar. - Taktisches Freewarespiel
f&uuml;r 1 oder 2 Spieler.<BR> Hergestellt im Auftrag der SPARKASSE.</P>

<H3 align="center"><B>S p i e l e k i s t e # 357</B></H3>

<H4><B>Amiga-Tanx V1.1</B></H4>

<P>Spielstarke Amigaversion des bekannten Strategie- und
Geschicklichkeitsspiels f&uuml;r zwei Spieler. Mit vielen Optionen und
Einstellungen (wie Schwierigkeitsgrad, Hintergrunddsgrafik, Neigungswinkel
oder Abschu&szlig;energie des Gesch&uuml;tzes) - dabei mu&szlig; aber auch
z.B. noch die Windrichtung und Windst&auml;rke ber&uuml;cksichtig
werden.<BR> Autor: Gary Roberts</P>

<H4><B>Rueda! V1.3</B></H4>

<P>Gl&uuml;cksrad - auf englisch (Wheel of Fortune). Im Wettstreit gegen
den Computer oder einen Mitspieler m&uuml;ssen gesuchte Begriffe (auch
Sprichw&ouml;rter oder Film-/Buchtitel) erraten werden. Hat der Spieler
nach drei Runden das h&ouml;chste Gewinnkonto, so kommt er in die
Finalrunde, in der Hochsee-Yachten, Autos oder Bargeld gewonnen werden
k&ouml;nnen... -Freeware.<BR> --&gt; Bei Rueda! wird &ouml;fters das "
&acute; " - Zeichen ben&ouml;tigt (z.B. bei GIVE &acute;EM HELL). Dieses
Zeichen bekommt man auf einer deutschen Tastatur, indem man " &Auml; "
tippt.<BR> Autor: Beaty Softworks</P>

<H3 align="center"><B>S p i e l e k i s t e # 358</B></H3>

<H4><B>Tsch</B></H4>

<P>Hektisch werdendes Geschicklichkeitsspiel. Mit Deinem "Schiff"
mu&szlig;t Du viele Level durchqueren und dabei "Juwelen" (oder was auch
immer) einsammeln. Aber dabei gibt es auch jede Menge fieser Hindernisse,
die nicht ber&uuml;hrt werden d&uuml;rfen... - Shareware.<BR> Autor:
MiG</P>

<H4><B>Numpty</B></H4>

<P>... and the Alien Invaders. Ein putziges Jump&acute;n Run mit einfacher
Grafik und kniffligen Aufgaben.<BR> Autor: P. J. Gargin</P>

<H4><B>CrazyFroggy</B></H4>

<P>Ein "verr&uuml;ckter" Frosch h&uuml;pft und springt &uuml;ber ein langes
Stra&szlig;enband voller L&ouml;cher und Fallen. 64er Remake<BR> Autor:
Ritchy</P>

<H4><B>Spider V1.1</B></H4>

<P>Doppeldeck-Solitaire.<BR> Autor: Vincent Loechner</P>

<H3 align="center"><B>S p i e l e k i s t e # 359</B></H3>

<H4><B>Energie-Manager</B></H4>

<P>Realistische Wirtschafts- und Umweltsimulation zurm Thema
"Energiesparen" f&uuml;r 1-4 Spieler. Dabei mu&szlig; jeder Spieler in den
verschiedenen Runden versuchen, eine florierende und umweltbewu&szlig;t
gef&uuml;hrte Restaurantkette in Deutschland aufzubauen. Dabei erschweren
(oder erleichtern) zahlreiche Zufallsereignisse eine langfristige
Planung... Empfehlenswert!<BR> Herausgeber: BMWI</P>

<H3 align="center"><B>S p i e l e k i s t e # 360</B></H3>

<H4><B>G h o s t R u n n e r</B></H4>

<P>Klassisches Plattformspiel - gerade richtig auch f&uuml;r die
j&uuml;ngeren Amigafans (ab 6 Jahre). Die Steuerung per Joystick ist recht
einfach und da auch kein Zeitlimit besteht, kommt keine Hektik auf. In den
insgesamt vierzig Leveln m&uuml;ssen jeweils 8 Goldbarren eingesammelt
werden. Die verschiedenen Plattformen kann man &uuml;ber Leitern oder per
Schleuderfahrt (graue Felder) erreichen. Mit den unfreundlich aussehenden
Gesellen sollte man sich aber nicht anlegen, sonst ist sehr schnell eines
der f&uuml;nf Bildschirmleben dahin... Nach jeweils 10 erfolgreich
abgeschlossenen Leveln gibt es ein Passwort; damit kann man das Spiel in
Level 11, 21 oder 31 beginnen. - Shareware!<BR> ---&gt; Die Levelcodes gibt
es f&uuml;r Schummler auch auf der SK-Extra #05 (Helpline).<BR> Autor :
Harald Wagner</P>

<H3 align="center"><B>S p i e l e k i s t e # 361</B></H3>

<H4><B>MatchstickMan</B></H4>

<P>Nettes Jump&acute;n&acute;Run. Diesmal mu&szlig;t Du alle herumliegenden
Streichh&ouml;lzer einsammeln. Die Gegner, die gelegentlich auf dem
Bildschrim erscheinen, d&uuml;rfen dabei nicht ber&uuml;hrt werden; diese
b&ouml;sen Buben m&uuml;ssen einfach &uuml;bersprungen werden. Wenn auch
die ersten Level recht einfach zu l&ouml;sen sind, dann &auml;ndert sich
der Schwierigkeitsgrad aber schnell... Eine Grafik und hervorragende
Joysticksteuerung zeichnen dieses Shareware-Spiel aus.<BR> Autor: Stuart
Fisher</P>

<H3 align="center"><B>S p i e l e k i s t e # 362</B></H3>

<H4><B>TankTeam</B></H4>

<P>Kampf- und Strategiespiel f&uuml;r 2 Spieler. Nach einem umfangreichen
Einstellmenu gelangen die Spieler auf das "Schlachtfeld", das von oben aus
der Vogelperspektive gezeigt wird. Ziel ist dann die gegnerischen Panzer zu
erledigen (ben&ouml;tigt 2 Joysticks). - Shareware.<BR> ---&gt; Programm
ben&ouml;tigt 1 MB Chip-Mem / 2 MB Ram.<BR> Autor: Paul Ciulla</P>

<H4><B>Descender</B></H4>

<P>Guter DEFENDER-Verschnitt im 3D-Look. Im ersten Level bewegen sich auf 3
Fl&auml;chen Objekte in Richtung Boden. Der Spieler mu&szlig; verhindern,
da&szlig; diese Teile die Unterkante der Fl&auml;chen ber&uuml;hren - durch
gezielten Dauerbeschu&szlig;. Im zweiten Level sind es dann vier
Fl&auml;chen, im 3. Level f&uuml;nf... -L&auml;uft nicht unter OS
2.0/3.0.<BR> Autor: Scott G. Thede</P>

<H3 align="center"><B>S p i e l e k i s t e # 363</B></H3>

<H4><B>CombatAirPatrol PV</B></H4>

<P>Die neue gro&szlig;e Flugsimulation von Psygnosis mit "realistischen"
Flugmodellen (wie F-14 und F-18) in einer spielbaren Preview-Version!<BR>
Hersteller: Psygnosis</P>

<H4><B>Boomerang</B></H4>

<P>Nettes Actionspiel f&uuml;r 2 Spieler; mit einem (Kampf-) Bumerang
mu&szlig; der Gegner in verzwickten Labyrinthen erledigt werden. Aber
Vorsicht: ein Kampfbumerang kommt nicht automatisch zur&uuml;ck...<BR>
Autor: Troy Tucker</P>

<H3 align="center"><B>S p i e l e k i s t e # 364</B></H3>

<H4><B>FatalMission</B></H4>

<P>Klassisches Shoot&acute;em Up f&uuml;r 1 oder 2 Spieler nach
bew&auml;hrter Manier: Gegner vernichten, Meteoriten ausweichen und sich
nicht treffen lassen. Dabei ist aber auch eine geh&ouml;rige Portion
Ausdauer vonn&ouml;ten, denn die Gegner m&uuml;ssen mehrfach getroffen
werden, bevor sie sich in ihre atomaren Bestandteile aufl&ouml;sen...
L&auml;uft nicht auf dem A1200.<BR> Autor: Robin Burrows</P>

<H4><B>ThatTennisThing</B></H4>

<P>Klassisches Ping-Pong aus den Kindertagen der Spielekonsolen. Zwei
Spieler versuchen die (eckige) Kugel punktebringend hinter die Grundlinie
zu bef&ouml;rdern. L&auml;uft nicht auf dem A1200.<BR> Autor : Robin
Burrows</P>

<H3 align="center"><B>S p i e l e k i s t e # 365</B></H3>

<H4><B>The Real Popeye</B></H4>

<P>Wer kennt nicht den spinatfressenden Comic-Helden? Hier ist jetzt
(endlich!) eine Amigaversion des 64er Klassikers! Immer hat der b&ouml;se
Brutus seine H&auml;nde im Spiel und es st&uuml;nde schlecht um Olivia -
wenn da nicht PopEye w&auml;re.<BR> Autoren: Bignonia</P>

<H4><B>StarFleet</B></H4>

<P>Ein gro&szlig;es Spiel f&uuml;r 1-4 Spieler um Welten, Eroberungen und
Erforschung des Universums. Nicht nur f&uuml;r Taktik- und
Strategiefans.<BR> Autor: W. Jordan</P>

<H4><B>The GerbGame</B></H4>

<P>Jage die b&ouml;sen Gerbils! Absolut hektische Ballerorgie.<BR> Autor:
Charles Massey</P>

<H3 align="center"><B>S p i e l e k i s t e # 366</B></H3>

<H4><B>Survivor</B></H4>

<P>F&uuml;r Freunde von englischen Text/Grafik-Adventure kommt hier das
richtige Programm f&uuml;r lange Winterabende. Die Aufgabe in einem Satz :
Befreie Deine Raumstation von den Aliens. Die Steuerung erfolgt per
Tastatur; eine ausf&uuml;hrliche englische Anleitung befindet sich mit auf
der Disk.<BR> Autor : Demon</P>

<H3 align="center"><B>S p i e l e k i s t e # 367</B></H3>

<H4><B>Trailblazer</B></H4>

<P>Geschicklichkeitsspiel aus alten 64er-Zeiten. Per Joystick mu&szlig; ein
Ball &uuml;ber einen schachbrettartigen Parcours gesteuert werden. Aber
Vorsicht: die Bahn hat L&ouml;cher, Beschleunigungs- und Bremsfelder! Das
Ziel erreicht aber nur der, der sich die L&ouml;cher nicht von innen
ansehen will. - 1 oder 2 Spieler.<BR> Autoren: Alchemy</P>

<H4><B>Galactoid</B></H4>

<P>Neues Remake auf einen Klassiker (Galaga, Galaxian)! Shoot&acute;em-Up
f&uuml;r 1 oder 2 Spieler. Nicht nur f&uuml;r Nostalgiefans. Shareware.<BR>
Autor: Clay Hellmann</P>

<H4><B>AliensLair</B></H4>

<P>Hektische SEUCK-Ballerei in 5 Leveln. Shareware.<BR> Autor: Frank
Otto</P>

<H3 align="center"><B>S p i e l e k i s t e # 368</B></H3>

<H4><B>WinningPost</B></H4>

<P>Super-Simulation einer Fruitmachine (auch unter dem Begriff "Einarmiger
Bandit" bekannt). Grafik und Animation der vier Walzen lassen
Spielhallenatmosph&auml;re aufkommen. Wenn dann die richtigen
Bildkombinationen erreicht wurden, gelangt man in eine Bonusrunde oder in
eine Art Pferde-Wettrennen.</P>

<H3 align="center"><B>S p i e l e k i s t e # 369</B></H3>

<H4><B>DungeonBlaster</B></H4>

<P>Keiner hat darauf gewartet - doch jetzt ist sie endlich da: die
computergerechte Umsetzung des Amiga-Joker Rollenspiels "The Secret of
Schorsch" (AJ 5/92). Nachdem in einer schaurigen Wintersnacht der
Schlitzophrene Schorsch aus einer geschlossenen Anstalt f&uuml;r
Geisteskranke ausbrach...<BR> Autoren: Boomerang-Team (R. Oehler, &amp; Ch.
Hansmann)</P>

<H4><B>Enigma</B></H4>

<P>Fesselndes Brettspiel mit taktischen und strategischen Elementen
f&uuml;r 1 oder 2 Spieler nach einfachen Regeln. Um zu gewinnen mu&szlig;t
Du nur mehr Steine als Dein Gegner am Ende besitzen.
(Erstver&ouml;ffentlichung auf der CD von Jump-Disk.)<BR> Autor: James
Pretorius</P>

<H3 align="center"><B>S p i e l e k i s t e # 370</B></H3>

<H3><B>Kid&acute;sFun XIX</B>: --&gt; Ab Dezember verf&uuml;gbar!</H3>

<H4><B>S n a k e s + L a d d e r s</B></H4> Autor:

<H4><B>S h a r k !</B></H4> Autor: Jim Webster

<H3 align="center"><B>S p i e l e k i s t e # 371</B></H3>

<H4><B>HiredGuns PV</B></H4>

<P>Ein S&ouml;ldnerteam, bestehend aus 4 knallharten Jungs und M&auml;dels,
hat den Auftrag, auf dem Planeten Graveyard illegale Biolabors in die Luft
zu jagen. Dazu werden an vier strategisch wichtigen Punkten handliche
kleine Atombomben plaziert - in der Tat ist dies aber ein richtiges
Himmelfahrtskommando. -Spielbare Previewversion eines neuen Actionhits!<BR>
Hersteller: Psygnosis</P>

<H3 align="center"><B>S p i e l e k i s t e # 372</B></H3>

<H4><B>Omega V0.78</B></H4>

<P>Gro&szlig;es komplexes Abenteuerspiel im Stile der Klassiker Rogue, Hack
oder Larn. Zuerst mu&szlig;t Du die Stadt Rampart erkunden. Aber sei
vorsichtig! Sonst bist Du schon erledigt, bevor Du noch das erste Dungeon
des Goblin King betreten hast...<BR> --&gt; Disk darf nicht
schreibgesch&uuml;tzt sein!<BR> Amiga-Portierung: Niilo Paasivirta</P>

<H3 align="center"><B>S p i e l e k i s t e # 373</B></H3>

<H4><B>KnuckleHead</B></H4>

<P>Mit dem kleinen Helden KnuckleHead geht es durch 5 schwierige Level. -
Shareware.<BR> --&gt; Das Programm ben&ouml;tigt 1 MB Chip-Memory!<BR>
Autor: Paul Ciulla</P>

<H4><B>BilliardGames</B></H4>

<P>Gelungene Billiard-Umsetzung mit 2 Spielarten. Shareware.<BR> Autor:
Mikko M&auml;kel&auml;</P>

<H3 align="center"><B>S p i e l e k i s t e # 374</B></H3>

<H4><B>Liberator</B></H4>

<P>Das ultimative Shoot&acute;em Up f&uuml;r eingefleischte, nervenstarke
und kaltbl&uuml;tige Ballerspiel-Freaks. Das Spielgeschehen bedarf keiner
n&auml;heren Erkl&auml;rung - einfach Feuer frei! Allerdings verf&uuml;gt
der Spieler nur &uuml;ber ein Bildschirmleben...<BR> Autor: Mark Sheeky</P>

<H4><B>SuperTron</B></H4>

<P>Ausgezeichnete Tron-Umsetzung f&uuml;r 2 Spieler mit 5 (!)
Schwierigkeitsgraden. Shareware.<BR> Autor: Beast/Sfinx</P>

<H3 align="center"><B>S p i e l e k i s t e # 375</B></H3>

<H4><B>Raid IV</B></H4>

<P>Die Fortsetzung einer Legende! Noch besser, noch h&auml;rter, noch
actionreicher. Ein unbedingtes Mu&szlig; f&uuml;r alle Ballerfreaks. - Die
vorhergehenden Teile sind auf: SK #129 (Raid I), SK #244 (Raid II), SK 319
(Raid III).<BR> Autor: A. Fereday/FEZ-Production</P>

<H4><B>BatDog</B></H4>

<P>Kniffliges Jump&amp;Run; ohne &acute;Saft und Kraft&acute; mu&szlig; Du
erst mal durch das Einsammeln von &acute;Kraftpillen&acute; zu Kr&auml;ften
kommen. Dann geht es munter weiter...<BR> Autor: Alan Carter</P>

<H4><B>KnightsTourPuzzle</B></H4>

<P>Mit dem Springer geht es in verschiedenen Aufgaben &uuml;ber das
Schachbrett. Dabei d&uuml;rfen die Felder der wei&szlig;en Bauern nicht
getroffen werden. Denken und Strategie -nicht nur f&uuml;r Schachfans. -
Shareware.<BR> Autor: W. Jordan</P>
<HR>
<BR>

<IMG src="pdl0.gif" alt="" width="640" height= "22" border="0" usemap="#pdl0">
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

