<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>SuperDuper</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="tls0">
<AREA shape="rect" coords="470,1,525,22" href="tls.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="tls0.gif" alt="" width="640" height="22" border="0" usemap="#tls0"> 
<HR>

<H3 align="center"><B>Testbericht SuperDUPER 3.0</B></H3>

<P>Nach dem anklicken &ouml;ffnet SD auf der Workbench ein Fenster das in
drei Bereiche aufteilt. Als erstes w&auml;ren da die Laufwerksgadgets bei
denen man per Mausklick Ziel- und Quellaufwerk ausw&auml;hlen kann. Direkt
daneben ist die Anzeige, in Form eines Balken, wieweit der
Formatier-,Check- oder Kopierverogang vorangeschritten ist. Darunter sind
die wichtigsten Gadgets wie Kopieren, formatieren, &Uuml;berpr&uuml;fen,
stoppen, Iconify und das ARexx Gadget. &Uuml;ber das letzt genannte kann
man &uuml;ber ein Auswahlmenu seine eigenen ARexx Skripte aufrufen und
diese dann auch ausf&uuml;hren lassen. Mit dem Info Gadget kann man alle
,bis dahin Kopierten,Formatierten und &uuml;berpr&uuml;ften Disketten,
nochmal in einem Window anschauen. Im Info-Window befindet sich auserdem
noch die Anzeige wie oft schon aus dem aktuellen Buffer kopiert wurde. Was
zu dieser Version neu gekommen ist ,ist unter anderem die 4 Laufwerks
K&auml;stchen in denen man bei jedem Laufwerk den Kopiervorgang
"&uuml;berwachen" kann. Tritt hierbei ein Fehler auf so wird dieser
graphisch angezeigt. Sollte ein Fehler auftreten so versucht SD es noch bis
zu 3mal und dann -machts weiter.</P>

<IMG src="spd1.gif" alt="" width="640" height=
"870"> 

<P>Bei der Formatier Funktion kann man einige Einstellungen vornehmen die
das Formatieren beinflu&szlig;en. Das w&auml;ren z.B FFS,Date,Verify,IncN
ame und DirCache. Bei DirCache wird die Disk mit dem ,ab WB3.O vorhanden,
Directory Cache formatiert was eine Geschwindigkeitserh&ouml; hung beim
einlesen dieser Diskette ergibt. Bei Incname kann man eine Reihe von
Disketten die den gleichen Namen haben sollen formatieren. Hierbei wird der
Basis- name beibehalten und nur eine neue Nummer angeh&auml;ngt.Zum
Beispiel man formatiert seine Disks auf PD dann m&uuml;&szlig;te es also
weitergehen mit PD.001, PD.002 usw. SD ist auch f&uuml;r Benutzer mit nur
einem Laufwerk geeignet. Es werden hierbei die Daten der Diskette in einen
Buffer geschrieben und sp&auml;ter wieder gelesen und auf eine neue Disk
kopiert werden. Es gibt bei SD 3 verschiedene Buffertypen. Zum ersten
"Buffer" - es kopiert die Daten in den normalen Speicher. Bei "HD Buffer"
werden die Daten nicht in den Speicher sondern auf Festplatte geschrieben
und dies als File. Hierbei mu&szlig; man vorher den Pfad f&uuml;r das File
angeben.Der letzte der 3 Buffer ist "VD Buffer". Er ist in der Lage jedes
Device als Buffer zu verwenden.</P>

<P>FAZIT: Jeder der nur mal so einige PDs kopiert dem sei SuperDuper ans
Herz gelegt. Au&szlig;erdem ist es nicht jedermans Sache sich XCopy
f&uuml;r 80 DM (Angaben ohne Gew&auml;hr) zuzulegen zumal man SuperDuper
zum Nulltarif auf der Fish 9O3 findet.</P>

<P>N.W : (Noch was) Sorry f&uuml;r die vielen Reschtschreibveler.</P>

<P>Jens Neubauer</P>
<HR>
<IMG src="tls0.gif" alt="" width="640" height="22" border="0" usemap="#tls0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>
