<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Timequest</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="tip0">
<AREA shape="rect" coords="467,1,569,22" href="tip.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="tip0.gif" alt="" width="640" height="22" border="0" usemap="#tip0"> 
<HR>
<BR>

<H2 align="center"><B>TIMEQUEST</B></H2>

<P>Diese L&ouml;sung ist nach Zeitzonen geordnet. Kommt man also in einer
Zeitzone nicht weiter, so schaut man unter den entsprechenden Tips nach.
Aber ersteinmal ein paar Tips:</P>

<P>- Einige Puzzles sind nur l&ouml;sbar, wenn man in fr&uuml;heren
Zeitzonen etwas tut. So m&uuml;ssen Sie beispielsweise in einer Zeitzone
etwas verstecken und eine Zeitzone sp&auml;ter "wiederfinden", um jemanden
davon zu &uuml;berzeugen, da&szlig; der Gegenstand echt ist und schon seit
Jahren dort liegt.</P>

<P>- Einige Puzzles sind zeitlich etwas "unlogisch". Wenn Sie einen
wichtigen Gegenstand aus einer Zeitzone entfernen, aber sp&auml;ter wieder
an denselben Platz und selbe Zeit zur&uuml;ckbringen, &auml;ndern Sie nicht
die Zukunft. Ein kniffliges Puzzle basiert auf diesem Effekt.</P>

<P>- Viele R&auml;ume haben nur in einer Zeitzone einen Sinn und sind in
anderen nur zur Dekoration da, oder dienen als Versteck f&uuml;r
Nachrichten von Vettenmyer.</P>

<P>- Wenn Sie nicht mehr weiterkommen, arbeiten Sie sich schrittweise durch
die n&auml;chsten Zeitzonen vor, die in Verbindung mit dem Problem stehen
k&ouml;nnten. Ein Beispiel : Wenn Cleopatra Ihnen einen Gegenstand mit dem
Vermerk "im Osten sehr wertvoll" gibt, lohnt es sich, die Zeiten von Peking
und Baghdad durchzuprobieren, ob der Gegenstand dort gebraucht werden
kann.</P>

<P>- Kaum zu glauben, es gibt auch einen Cheat-Modus. Folgende drei
Kommandos k&ouml;nnen Sie ausf&uuml;hren: "ZMEM" zeigt die
Speicherbelegung, "ZGET" besorgt jeden beliebigen Gegenstand und "ZEND"
richtet alle zehn Ereignisse und gibt Ihnen den Gegenstand, mit dem Sie
Vettenmyers Pl&auml;ne durchkreuzen wollen -Vettenmyer aufsp&uuml;ren
m&uuml;ssen Sie trotzdem noch. Achtung: Wer schummelt, kann definitiv nicht
mit der vollen Punktzahl rechnen.</P>

<P>HQ 2090</P>

<P>Nachdem Vettenmyer wieder verschwunden ist und Drexler seinen Vortrag
beendet hat, kann es losgehen. Achten Sie auf das Bild an der Wand. In
Vettermyers B&uuml;ro &ouml;ffnet man die Schreibtischschublade. Die Karte
kommt in den Schlitz in der Zeitmaschine.</P>

<P>Mexico, 1361 B.C.</P>

<P>Aus Stonehenge (Dover, 1361) wissen Sie (hoffentlich) &uuml;ber die
Sonnenfinsternis Bescheid. Sagen Sie das dem Olmec, sobald Sie im Kochtopf
sind. Wenn dann die Finsternis kommt, alles nehmen und ins Interkron.</P>

<P>Mexico, 44 B.C.</P>

<P>Sie brauchen: "helmet" und "costume". Erscheinen Sie im Kost&uuml;m und
legen Sie den Helm auf das Kissen.</P>

<P>Mexico, 452</P>

<P>Im Labyrinth den Fu&szlig;spuren folgen, am Ende gibt es eine Nachricht.
Weg gut merken.</P>

<P>Mexico, 800</P>

<P>Im Dunkeln durch das Labyrinth, am Ende wartet das Kost&uuml;m.</P>

<P>Mexico, 1215</P>

<P>Sie brauchen: "flint knife". Im Dunkeln durch das Labyrinth bis zur der
Stelle, an der Wind nach oben geht. Rauf, das Opfer befreien, auf dem Tisch
ist eine Nachricht.</P>

<P>Mexico, 1519</P>

<P>Hierhin kommen, wenn Helm in 44 B.C. abgelegt wurde. Warten, bis
Montezuma seine Entscheidung getroffen hat.</P>

<P>ROME, 1361 B.C.</P>

<P>In der Academy sitzt ein alter Mann, der philosophieren will. Reden Sie
mit ihn, dann reisen Sie jeweils eine Zeitzone in die Zukunft und treffen
ihn wieder. Das Ganze machen Sie so lange, bis Sie 1940 seinen
Schl&uuml;ssel erhalten.</P>

<P>ROME, 44 B.C.</P>

<P>Den Wagen repariert man, indem man die Achse ein&ouml;lt, das Rad auf
die Achse steckt und dann mit dem Stift ("peg") sichert. Wenn C&auml;sar
Ihnen einen Wunsch gew&auml;hrt, bitten Sie um einen Lorbeerkranz
("laurel"). Den L&ouml;wen erledigen Sie dann mit dem Schwert.</P>

<P>ROME, 452</P>

<P>Sie brauchen: "mask", "lighter". Wenn Attila ein Wunder verlangt,
z&uuml;nden Sie die Maske an. Der Papst gibt Ihnen aus Dank ein
Pergament.</P>

<P>ROME, 800</P>

<P>Hier m&uuml;ssen Sie zweimal hin :<BR> a.) Sie brauchen: "moltow
cocktail". Nehmen Sie den Korken aus der Flasche, tr&auml;nken Sie das
Taschentuch mit &Auml;ther. Gehen Sie in den Raum mit der Krone,
bet&auml;uben Sie den Priester mit dem Taschentuch und hauen Sie mit der
Krone ab.<BR> b.) Sie brauchen: "crown" (aus der Vitrine in Rome, 1940).
Bringen Sie die Krone wieder zur&uuml;ck und warten Sie die Zeremonie
ab.</P>

<P>ROME, 1519</P>

<P>Gehen Sie in den Petersdom. Wenn dem Papst das Buch zu Boden f&auml;llt,
nehmen und dem Papst zur&uuml;ckgeben. Mit der "indulgence" kaufen Sie die
Plakette beim H&auml;ndler.</P>

<P>ROME, 1588</P>

<P>Die ausgeteilte Pamphlete enthalten eine Nachricht.</P>

<P>ROME, 1798</P>

<P>Sie brauchen "map", "ankh". Nehmen Sie den Stein aus der Stra&szlig;e
und werfen Sie ihn ans Fenster von Napoleon`s Haus. Napoleon zeigen Sie
Karte und Ankh. Er gibt ihnen einen Pa&szlig; und den Auftrag nach
&Auml;gypten zu kommen.</P>

<P>ROME, 1940</P>

<P>Hier m&uuml;ssen Sie zweimal hin :<BR> a.) Betreten Sie das Haus und
erlauschen das Codewort von Mussolini und Hitler. Dann nach Dover,
1940.<BR> b.) Wenn Sie aus Dover zur&uuml;ckkommen, warten Sie, bis
Churchill das Codewort sagt und schalten dann sofort das Radio ab.</P>

<P>Baghdad, 1361 B.C.</P>

<P>Hier ist in den h&auml;ngenden G&auml;rten eine Nachricht versteckt.</P>

<P>Baghdad, 44 B.C.</P>

<P>In der H&ouml;hle eine Nachricht.</P>

<P>Baghdad, 452</P>

<P>Die Nachricht steht auf dem Becher ("jug") in den Ruinen. Nicht
ber&uuml;hren, nur lesen.</P>

<P>Baghdad, 800</P>

<P>Sie brauchen: "foccacio". Das Brot aus Rom geben Sie dem Bettler. Wenn
Ihnen der Sultan die Aufgabe stellt, stimmen Sie zu ("say yes"). Jetzt
unbedingt den Spielstand speichern! Um die richtige Frau zu finden,
m&uuml;ssen Sie raten oder alle ausprobieren. Das geht wie folgt: Kleid
("veil") einer frau anziehen, die Feigen("figs") mitnehmen, nach unten
gehen, dem (Wesir?) eine Feige anbieten. Bei einer Frau wird er schwach.
Wieder nach oben gehen, Kleid ausziehen, unter dem Bett verstecken (und das
alles, bevor die Frauen aus dem Bad kommen). Warten, dann den "slipper"
nehmen und dem Sultan zeigen. Wer nicht alle M&auml;dels durchprobieren
will, entschl&uuml;ssle folgende L&ouml;sung: HSVFM (jeweils einen
Buchstaben zur&uuml;ck).</P>

<P>Baghdad, 1219</P>

<P>Sie brauchen: "vial". Verkaufen Sie dem H&auml;ndler das
Fl&auml;schchen.</P>

<P>Baghdad, 1519</P>

<P>Sie brauchen: "drachma". Kaufen Sie auf dem Markt die "dates". Gehen Sie
in die Gasse, nehmen die Leine ("tether") des Esels und fl&uuml;stern dem
Esel was ins Ohr ("whisper in ear"). Dann holen Sie die Dates mitsamt Urne.
Mit dem Esel in das Haus mit dem M&auml;dchen. Esel wieder
rausf&uuml;hren.</P>

<P>Im Haus "dates" aus der Urne nehmen, m&auml;dchen in der Urne
verstecken, "dates" in die Urne. Dann wieder den Esel holen. Warten, bis
die Soldaten da waren. Wof&uuml;r das Ganze? Erfahren wir eine Zeitzone
weiter.</P>

<P>Baghdad, 1588</P>

<P>Sie d&uuml;rfen nur in der Stadt bleiben, wenn Sie 1519 das M&auml;dchen
gerettet haben. Dann finden Sie in der Gasse eine weitere Nachricht.</P>

<P>Baghdad, 1798</P>

<P>Diesmal ist eine Nachricht in den Teppich gekn&uuml;pft worden, den ein
H&auml;ndler auf dem Markt anbietet.</P>

<P>Cairo, 1361 BC</P>

<P>Sie brauchen "Crown". Holen Sie das Baby aus dem Nil, geben es dem
M&auml;dchen. Folgen Sie Tut. Wenn er ein Geschenk will, geben Sie ihm die
Krone und nehmen dann den Plan.</P>

<P>Cairo, 44 BC</P>

<P>Wenn Sie von Cleopatra eingeladen wurden, einfach am Stra&szlig;enrand
auf sie warten. Der Rest geht weitestgehend automatisch.</P>

<P>Cairo, 452</P>

<P>Eine Nachricht steht auf einem der Steinbl&ouml;cke.</P>

<P>Cairo, 800</P>

<P>Sie brauchen: "Chalk". Geben Sie dem Mann die Kreide, er schreibt eine
weitere Nachricht auf die Tafel.</P>

<P>Cairo, 1215</P>

<P>Sie brauchen: "map", "lighter". gehen Sie in die Pyramide, folgen Sie
den Anweisungen auf der Karte und holen den Ankh.</P>

<P>Cairo, 1519</P>

<P>Die Nachricht ist an der Wand des Grabmals, in dem Sie
materialisieren.</P>

<P>Cairo, 1798</P>

<P>Sie brauchen: "pass", "map", "lighter", "hook", "turban". Wenn Sie
Napoleon &uuml;berzeugen konnten, wartet er hier auf Sie. Gehen Sie in die
Pyramide. Die eingest&uuml;rtzte Br&uuml;cke &uuml;berwinden Sie wie folgt
: Turban an den Haken binden, Haken an den &Uuml;berhang an der Decke
werfen, r&uuml;berschwingen. Napoleon kommt an die Krone ran.</P>

<P>Peking, 1361</P>

<P>Schlie&szlig;en Sie sich der Trauergruppe an. Reichen Sie den Giftbecher
weiter ("pass basin"), setzten Sie sich auf die Bank und lesen Sie in Ruhe
die Tafel. Nach einer Weile sollten Sie automatisch zu meditieren beginnen,
ansonsten helfen Sie mit "medidate" etwas nach. Das Wasser kommt in den
Mund der Statue ("take basin", "pour water in mouth"). Bei der Flucht den
Edelstein nicht vergessen.</P>

<P>Peking, 44</P>

<P>Sie brauchen: "conch shell". Auf der Chienesischen Mauer machen Sie mit
"blow shell" ein wenig Krach. Der Kaiser gibt Ihnen ein Siegel.</P>

<P>Peking, 452</P>

<P>Sie brauchen: "emerald". Geben Sie dem Priester, der um eine Spende
bittet, den Edelstein.</P>

<P>Peking, 800</P>

<P>Wenn Sie 452 eden Edelstein gestiftet haben, d&uuml;rfen Sie zu den
M&ouml;nchen. Dort nehmen Sie die Maske mit.</P>

<P>Peking, 1215</P>

<P>Sie brauchen: "yuan note". Benutzen Sie das Pa&szlig;wort vom
H&auml;ndler aus Baghdad. Im "Haus der tausend Freuden" zeigen Sie die
Yuan-Note und sagen den Damen "follow me". Gehen Sie zu den Soldaten und
&ouml;ffnen Sie das Tor.</P>

<P>Peking, 1519</P>

<P>Warten Sie auf die Prozession. Im Gl&uuml;ckskeks - nach
fer&ouml;stlicher Sitte -steckt eine weitere Nachricht.</P>

<P>Peking, 1588</P>

<P>Der Priester babbelt eine weitere Nachricht.</P>

<P>Peking, 1798</P>

<P>Sie brauchen "seal". Mit dem Siegel kommen Sie in die verbotene Stadt.
In der Box ist eine weitere Nachricht auf einem Jadeblock graviert.</P>

<P>Peking, 1940</P>

<P>Kurz nach zw&ouml;lf fliegt ein Molotow-Cocktail vor Ihre
F&uuml;&szlig;e. Mitnehmen, dann schnell wieder abhauen.</P>

<P>Dover, 1361 BC</P>

<P>Am Strand nehmen Sie die Muschel mit. In Stonehenge setzen Sie sich auf
den speziellen Stein und warten. Den Wissenschaftler fragen Sie dann nach
der Sonne.</P>

<P>Dover, 44 BC</P>

<P>Am Strand liegt etwas Kreide.</P>

<P>Dover, 452</P>

<P>Auf dem Schwert ist eine Nachricht.</P>

<P>Dover, 800</P>

<P>An der Hauswand ist eine Nachricht.</P>

<P>Dover, 1215</P>

<P>In der Kneipe sehen Sie den Kurier, der, als er von den R&auml;ubern
h&ouml;rt, einen Gegenstand in seinem Mantel versteckt. Nehmen Sie das
Pferd, reiten nach Westen und verstecken sich hinter dem Baum. Nachdem der
Kurier &uuml;berfallen wurde, erz&auml;hlen Sie den r&auml;ubern von dem
Gegenstand. Reiten Sie dann weiter und sehen zu, wie die Geschichte wieder
automatisch gerade gebogen wird. Ach ja, beim Sultan ist die Frau in
Gr&uuml;n.</P>

<P>Dover, 1519</P>

<P>Sie brauchen: "plaque". Im G&auml;stezimmer heben Sie das lose Brett an.
Darunter legen Sie die Plakette. Wichtig: legen Sie das Brett wieder
ordentlich zur&uuml;ck, sonst repariert der Wirt es innerhalb der
n&auml;chsten 70 Jahre.</P>

<P>Dover, 1588</P>

<P>Sie brauchen: "parchment". Zuerst m&uuml;ssen Sie in 1519 die Plaette
versteckt haben. Klopfen Sie an die Zimmert&uuml;r, nach dem Eintreten
verbeugen Sie sich ("bow"). Heben Sie das lose Brett an und zeigen der
K&ouml;nigin die Plakette. Dem Seefahrer geben Sie das alte Pergament,
daf&uuml;r kriegen Sie den Helm.</P>

<P>Dover, 1788</P>

<P>Sie brauchen: "pass". Zeigen Sie Nelson den Pa&szlig;. nehmen Sie den
Haken mit.</P>

<P>Dover, 1940</P>

<P>Wenn Sie das Codewort wissen (Rome, 1940) warten Sie auf
ChurchillW&auml;hrend er spricht, greifen Sie nach dem Gegenstand, der dem
Codewort entspricht.</P>

<P>Die Nachrichten :</P>

<P>Vettenmeers Nachrichten enthalten alle eine Zahl - mal ausgeschrieben,
mal codiert. (Beispiel: I ate something. ate spricht sich wie eight, die
Nummer 8). Sortieren Sie die Nachrichten nach den Zahlen. Jeweils der erste
Buchstabe ist entscheidend. Die Nachricht enth&auml;lt Vettenmyers Versteck
und das passende Codewort. F&uuml;r Neugierige steht die Aufl&ouml;sung
weiter unten.</P>

<P>Der Endkampf :</P>

<P>Sie brauchen: "key". Sobald Sie in das Zimmer mit der Zeitmaschine
kommen, zeigt eine Kopie von Ihnen auf die rechte Plattform, also springen
Sie sofort auf die rechte Plattform. Dann warten Sie, bis Sie sich kommen
h&ouml;hren und springen auf die linke Plattform. &Uuml;brigends wissen Sie
ja schon l&auml;ngst, das Sie im Turm zu Babel sind und das Pa&szlig;wort
"say east" gewesen ist. Jetzt k&ouml;nnen Sie mit dem Schl&uuml;ssel die
Bombe entsch&auml;rfen und gleich wieder auf die rechte Plattform springen.
Merken Sie sich die Zahl, die das andere Ich Ihnen zuruft. Vettenmyer
wartet auf Sie und fesselt Sie an den Stuhl. Plauschen Sie mit ihm, bis er
Ihnen eine Quizfrage stellt, deren Antwort die Zahl ist, die Sie sich
selbst zugerufen haben. Jetzt wird`s dramatisch: Warten Sie dann, bis er
Ihnen den R&uuml;cken zudreht, um Ihr anders Ich auf der Plattform zu
entfangen. Geben Sie Vettenmyer einen kr&auml;ftigen Tritt, dann stellen
Sie den Fu&szlig; auf die Fernbedienung. Rufen Sie jetzt die Nummer, die
die L&ouml;sung des Quiz ist. Ab jetzt l&auml;uft alles halbautomatisch,
Sie m&uuml;ssen nur ab und zu "z"(f&uuml;r"wait") eingeben.</P>

<P>Hier haben wir nun noch eine Liste in der die wichtigsten Dinge, die man
braucht, stehen. Au&szlig;erdem steht in dieser Liste auch noch der
Fundort.</P>

<TABLE border="0" summary="" cellpadding="4"
cellspacing="0">
<TR>
<TD>Dover,</TD>

<TD>1361 BC</TD>

<TD>- Conch Shell</TD>
</TR>

<TR>
<TD>Dover,</TD>

<TD>44 BC</TD>

<TD>- Chalk</TD>
</TR>

<TR>
<TD>Dover,</TD>

<TD>452</TD>

<TD>- Nachricht # 10</TD>
</TR>

<TR>
<TD>Dover,</TD>

<TD>800</TD>

<TD>- Nachricht # 8</TD>
</TR>

<TR>
<TD>Dover,</TD>

<TD>1215</TD>

<TD>- Magna Charta</TD>
</TR>

<TR>
<TD>Dover,</TD>

<TD>1588</TD>

<TD>- Queen Elizabeth</TD>
</TR>

<TR>
<TD>Dover,</TD>

<TD>1798</TD>

<TD>- Hook</TD>
</TR>

<TR>
<TD>Dover,</TD>

<TD>1940</TD>

<TD>- Lighter</TD>
</TR>

<TR>
<TD colspan="3">
<HR>
</TD>
</TR>

<TR>
<TD>Baghdad,</TD>

<TD>1361 BC</TD>

<TD>- Nachricht # 1</TD>
</TR>

<TR>
<TD>Baghdad,</TD>

<TD>44 BC</TD>

<TD>- Nachricht # 2</TD>
</TR>

<TR>
<TD>Baghdad,</TD>

<TD>452</TD>

<TD>- Nachricht # 11</TD>
</TR>

<TR>
<TD>Baghdad,</TD>

<TD>800</TD>

<TD>- Sultan -Turban</TD>
</TR>

<TR>
<TD>Baghdad,</TD>

<TD>1215</TD>

<TD>- Drachama note, Yuan note</TD>
</TR>

<TR>
<TD>Baghdad,</TD>

<TD>1588</TD>

<TD>- Nachricht # 16</TD>
</TR>

<TR>
<TD>Baghdad,</TD>

<TD>1798</TD>

<TD>- Nachricht # 3</TD>
</TR>

<TR>
<TD colspan="3">
<HR>
</TD>
</TR>

<TR>
<TD>Peking,</TD>

<TD>1361 BC</TD>

<TD>- Emerald</TD>
</TR>

<TR>
<TD>Peking,</TD>

<TD>44 BC</TD>

<TD>- Seal</TD>
</TR>

<TR>
<TD>Peking,</TD>

<TD>800</TD>

<TD>- Mask</TD>
</TR>

<TR>
<TD>Peking,</TD>

<TD>1215</TD>

<TD>- Genghis Khan</TD>
</TR>

<TR>
<TD>Peking,</TD>

<TD>1519</TD>

<TD>- Nachricht # 7</TD>
</TR>

<TR>
<TD>Peking,</TD>

<TD>1588</TD>

<TD>- Nachricht # 4</TD>
</TR>

<TR>
<TD>Peking,</TD>

<TD>1798</TD>

<TD>- Nachricht # 15</TD>
</TR>

<TR>
<TD>Peking,</TD>

<TD>1940</TD>

<TD>- Molo.Cock.</TD>
</TR>

<TR>
<TD colspan="3">
<HR>
</TD>
</TR>

<TR>
<TD>Rome,</TD>

<TD>44 BC</TD>

<TD>- C&auml;sar</TD>
</TR>

<TR>
<TD>Rome,</TD>

<TD>452</TD>

<TD>- Attila</TD>
</TR>

<TR>
<TD>Rome,</TD>

<TD>800</TD>

<TD>- Charlemag. - Crown</TD>
</TR>

<TR>
<TD>Rome,</TD>

<TD>1215</TD>

<TD>- Nachricht # 5</TD>
</TR>

<TR>
<TD>Rome,</TD>

<TD>1519</TD>

<TD>- Plaque</TD>
</TR>

<TR>
<TD>Rome,</TD>

<TD>1588</TD>

<TD>- Nachricht # 9</TD>
</TR>

<TR>
<TD>Rome,</TD>

<TD>1798</TD>

<TD>- Napoleon - Pass</TD>
</TR>

<TR>
<TD>Rome,</TD>

<TD>1940</TD>

<TD>- Mussolinoi - Key, Crown(#2), Nachricht
# 19</TD>
</TR>

<TR>
<TD colspan="3">
<HR>
</TD>
</TR>

<TR>
<TD>Cairo,</TD>

<TD>1361 BC</TD>

<TD>- Map</TD>
</TR>

<TR>
<TD>Cairo,</TD>

<TD>44 BC</TD>

<TD>- Vial</TD>
</TR>

<TR>
<TD>Cairo,</TD>

<TD>452</TD>

<TD>- Nachricht # 13</TD>
</TR>

<TR>
<TD>Cairo,</TD>

<TD>800</TD>

<TD>- Nachricht # 18</TD>
</TR>

<TR>
<TD>Cairo,</TD>

<TD>1215</TD>

<TD>- Ankh</TD>
</TR>

<TR>
<TD>Cairo,</TD>

<TD>1519</TD>

<TD>- Nachricht # 6</TD>
</TR>

<TR>
<TD>Cairo,</TD>

<TD>1588</TD>

<TD>- Nachricht # 12</TD>
</TR>

<TR>
<TD colspan="3">
<HR>
</TD>
</TR>

<TR>
<TD>Mexico,</TD>

<TD>1361 BC</TD>

<TD>- Knife</TD>
</TR>

<TR>
<TD>Mexico,</TD>

<TD>452</TD>

<TD>- Nachricht # 14</TD>
</TR>

<TR>
<TD>Mexico,</TD>

<TD>800</TD>

<TD>- Costume</TD>
</TR>

<TR>
<TD>Mexico,</TD>

<TD>1215</TD>

<TD>- Nachricht # 17</TD>
</TR>

<TR>
<TD>Mexico,</TD>

<TD>1519</TD>

<TD>- Montezuma</TD>
</TR>

<TR>
<TD colspan="3">
<HR>
</TD>
</TR>
</TABLE>
<HR>
<IMG src="tip0.gif" alt="" width="640" height="22" border="0" usemap="#tip0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML> 
