<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Wonderland</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="tip0">
<AREA shape="rect" coords="467,1,569,22" href="tip.html">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="10" summary="" bgcolor="#ffffff">
<TR>
<TD>
<IMG src="tip0.gif" alt="" width="640" height="22" border="0" usemap="#tip0"> 
<HR>
<BR>

<H2 align="center"><B>WONDERLAND</B></H2>

<P>Zuerst sitzt die liebe Alice in der River Bank und langweilt sich fast
zu Tode. Zum Gl&uuml;ck sind ja wir da und f&uuml;hren sie zum Birnenhaim.
Beim Pear Groves pfl&uuml;ckt sich Alice gleich eine Birne, die sie
erreichen kann, bzw. die Laterne (wenn nach einiger Zeit n&auml;mlich das
wei&szlig;e Kaninchen vorbeil&auml;uft, verwandeln sich die Birnen in
Laternen). Kommt also nach einigen WAITS das wei&szlig;e Kaninchen vorbei,
folgen wir Ihm &uuml;ber`s FIELD zum RABBIT HOLE. Im RABBIT HOLE kriechen
wir nach S&uuml;den und fallen durch das Kaninchenloch. Weil mir nichts
besseres einf&auml;llt, nehme ich doch gleich mal das Marmeladenglas mit,
das auf einem der Regale steht. Nun sind wir in der PASSAGE angelangt,
stehen auf (STAND UP) und untersuchen den Bl&auml;tterhaufen. Dort finden
wir den NUMBER 10-KEY, den wir gleich einstecken. Au&szlig;erdem befindet
sich in dem Raum eine T&uuml;r mit dem Buchstaben C. Nun gehen wir aber
erst einmal in die LONG HALL und finden nach einem schnellen SEARCH eine
Glasbox und unter dem Tisch eine Flasche. Beide laden per Etikett zum
Verzehr ein. Das Essen und Trinken lassen wir vorerst einmal sein. Erst in
MUSIC ROOM nehmen wir, sobald einer der tantzenden St&uuml;hle neben dem
Piano steht, die Notenbl&auml;tter weg. Nun stehen die St&uuml;hle still
und wir k&ouml;nnen nach einem OPEN-Befehl des Pianos auf den Stuhl neben
den Piano die Fl&uuml;ssigkeit in der Flasche trinken. Wor erreichen sofort
den KEY IN G, wenn wir ins Piano h&uuml;pfen. Schnell wieder auf dem
Boden,k&ouml;nnen wir au&szlig;erdem den KEY IN C mitnehmen. Zur&uuml;ck in
der LONG HALL warte ich auf das Kaninchen, das einen blauen F&auml;cher und
Handschuhe in derselben Farbe vergi&szlig;t. Beides nehme ich auf und kann
durch die T&uuml;r mit dem C (aufgeschlossen mit KEY IN C) ins BROOM
CUPBOARD gelangen. Hier finden wir einen "Kartenschuh" und
Kleiderb&uuml;gel plus Overall. Alles mu&szlig; ich mitnehmen. In der LONG
HALL kann ich nach einem kurzen "frische Luft zuf&auml;chern" ein klein
wenig schrumpfen. Wir werden nachdem wir den Overall angezogen haben, vom
Kaninchen aufgefordert als Dienstm&auml;dchen rosa Hausschuhe und
F&auml;cher zu besorgen. Er w&uuml;rde dann an der Eingangst&uuml;re des
Palastes warten, sagt er noch, und verschwindet. Freundlicherweise gibt er
mir einen Schl&uuml;ssel und l&auml;&szlig;t die Eingangst&uuml;re offen
(White Door). Gehen wir also nach Osten, kommen wir endlich ins Wunderland.
Bei den PALACE GATES bekommen wir eine galante Aufforderung des Herzbuben,
ihm doch die Sirubt&ouml;rtchen aus der Speisekammer der Herzk&ouml;nigin
zu stehlen. Daf&uuml;r werde er uns aus dem gar nicht mal so schlechten
Traum heraushelfen. Nachdem er gegangen ist, nehmen wir von einem
Stockinsekten (verjagen durch aufnehmen ins Inventory) seinen Stock und
gehen zum FRONT GARDEN des RABBIT`S HOUSE. Wir m&uuml;ssen nun die
W&auml;scheklammer nehmen und (UNTIE WASHING LINE) die W&auml;scheleine vom
Baum losbinden. Die Haust&uuml;r wird mit dem Haust&uuml;rschl&uuml;ssel
(KAUM ZU GLAUBEN !) ge&ouml;ffnet und wir k&ouml;nnen eintreten. Im Haus
gehen wir erteinmal nach oben, um brav die gew&uuml;nschten Utensilien zu
beschaffen. Die T&uuml;r ist zwar abgeschlossen, aber wir intelligenten
Wesen legen das Notenblatt erst einmal unter die T&uuml;r. Dann &ouml;ffne
ich die Standuhr und finde eine von 13 Spielkarten, die ich im Verlauf des
Spieles noch auffinden werde (Karo 6). Die Karte verschwindet nun im
Kartenschuh. Wir nehmen noch den RIGHT HAND POUCH mit. Leider mu&szlig; ich
jetzt wieder runtergehen, obohl ich das auch schon vorher erledigen
h&auml;tte k&ouml;nnen. In der KITCHEN des Hauses nehmen wir das Ei mit und
die Tasse aus dem Schrank. Durch den Garten gelangen wir in den GARDEN
SHED, wo wir mit dem Schraubstock noch den Kleiderb&uuml;gel geradebiegen
(put coathanger into vice, straighten coathanger and open vice). Dann
schnell zur&uuml;ck ins oberste Stockwerk. Dort kann man nun den
Ex-Kleiderb&uuml;gel ins Schl&uuml;sselloch stecken und der Schl&uuml;ssel
f&auml;llt auf das Notenblatt. Nehmen wir nun mit dem Notenblatt den
Schl&uuml;ssel auf, k&ouml;nnen wir die Bedroom door aufschlie&szlig;en. Im
WHITE RABBIT`S BEDROOM finden wir nach einigem Suchen rosa F&auml;cher,
rosa Handschuhe und eine Quarzflasche, die einen Zaubertrank enth&auml;lt.
Nach dem Verlassen des Wunderlandes holen wir uns endlich eine Aufgabe, die
uns Arbeit bereiten wird. Auf den PALACE GROUNDS entdecken wir
Gartenhandschuhe, die wir ins Inventory bef&ouml;rdern. Die Wooden Door
k&ouml;nnen wir eh nicht &ouml;ffnen, also gehen wir weiter IN FRONT OF THE
PALACE, wo wir die Tasse in den MIST (engl.!) halten. Nun gehen wir mit
Brausepulvertasse zum Haus der Herzogin, da wir in den Palast nicht ohne
Pa&szlig; hineinkommen. In der LOUNGE des DUCHESS`HOUSE nehmen wir
klammheimlich das Brillenetui mit. Nehme ich die GAZETTEN vom Tisch, kann
ich meine zweite Karte aufnehmen (Karo 2), die gleich im Kartenschuh
landet. Nun lege ich besser die Gazetten wieder ab. Im DINING ROOM kann ich
zwar den Pa&szlig; betrachten, jedoch nicht aufnehmen. Ich gehe also nach
oben. Im DUCHESS`BEDROOM finden wir nun ein paar Hausschuhe, die wir sofort
aufnehmen und anziehen. Jetzt ist "Trampel" Alice wenigstens auf leisen
Sohlen unterwegs. Im COOKS`BEDROOM ziehen wir die Gartenhandschuhe an und
gehen nach Osten direkt in den Speiseaufzug. Gegen den Pfeffer hilft nur
die W&auml;scheklammer auf der Nase (put on Nose). Nun machen wir einen
"pull rope"-Befehl und gelangen nach Westen in die K&uuml;che. Da die zwei
hier mit Geschirr um sich schmei&szlig;en, mache ich so schnell wie
m&ouml;glich und save erstmal ab. Jetzt nehmen wir das Tranchiermesser,
&ouml;ffnen den K&uuml;hlschrank, nehmen so schnell wie m&ouml;glich
Schlagsahne un dKrug heraus und schlie&szlig;en den K&uuml;hlschrank wieder
-wegen des Durchzugs. Jetzt gelangt noch der Glasschl&uuml;ssel un unser
Inventory und Alice sollte &uuml;ber den Aufzug den Raum wieder verlassen.
Zur&uuml;ck im DINING ROOM &ouml;ffnen wir mit dem Glasschl&uuml;ssel die
Glasvitrine und nehmen den Pa&szlig; heraus. Suchen wir am besten jetzt den
HORSE CHESTNUT TREE. Hier sehen wir nun ein Grinsen, dem wir die
Schlagsahne vorsetzen. Die Cheshire Cat erscheint und leckt die Sahne auf,
l&auml;&szlig;t uns aber ein bi&szlig;chen Zucker da. Au&szlig;erdem
m&uuml;ssen wir noch den LEFT HAND POUCH mitnehmen. In der EASTERN HALL des
Palastes zeigen wir dem Kaninchen dort seine Handschuhe und den
F&auml;cher. Als Dankesch&ouml;n bekommen wir dessen Pinsel. In der CENTRAL
HALL untersuchen wir sofort das Wappen mit dem Namen "coat of Arms" und
finden darauf zwei crocketspielende Herzkarten. Uns interessiert eigentlich
nur der Haken am Wappen, wir nehmen jedoch beides mit. Am JURY ROSTER sind
die Spielkarten in der Reihenfolge aufgelistet, in der wir sie eingesammelt
haben. Das ist wohl das wichtigste, um das Wunderland zu verlassen. Ich
mache noch den Trohnsaal auf der Karte sichtbar, gehe aber dann ins
Conservatory. Hier geben wir "turn handle clockwise" ein und siehe da, die
Kurbel ist ab. Nachdem wir die Kurbel eingesteckt haben, gehen wir in die
GUARD`S QUARTERS, wo wir 13 abgeschlossene F&auml;cher finden. Mit dem
NUMBER TEN KEY schlie&szlig;en wir das gleichnamige Fach auf. Dort liegt
dann der NUMBER THREE KEY, in dessen zugeh&ouml;rigen Fach wir die Karo 7
finden. Au&szlig;erdem ist in den Fach der Schl&uuml;ssel f&uuml;r Fach
Nummer 7. Dort befindet sich ein Paar Stiefel, die wir zwar mitnehmen, aber
nicht tragen, wenn wir an den Wachen vorbeischleichen. In der obersten
Etage des Schlosses gehen wir in den BATHROOM und nehmen aus dem
Spiegelschr&auml;nkchen den Nagellack. Im QUEEN`s BEDROOM nehmen wir die
Karo Dame. In der Schublade des Nachtschr&auml;nkchens der K&ouml;nigin
(Queenside Drawer) finde ich einen Holzschl&uuml;ssel. Weiter oben im ROYAL
OBSERVATORY liegt die Karo 4. Dann &ouml;ffne wir das Brillenetui, nehmen
die kleine Linse und lassen sie mit der gro&szlig;en Linse hier liegen.
Jetzt gehen wir endlich in die PALACE KITCHENS. DIe Einladung in der
BANQUET HALL befindet sich in einer Glastruhe, die aber verschlossen ist.
In der K&uuml;che sehe ich den mit einem Paier best&uuml;ckten
K&uuml;chenchef. Ich frage ihn, was er mit dem Papier m&ouml;chte. Er
antwortet,das er f&uuml;r die Herzk&ouml;niging T&ouml;rtchen herstellen
soll. Wir m&uuml;ssen nun die Zutaten (Sprudelwasser mit Kohlens&auml;ure,
Zucker, Mehl, Schmalz, Sirub und Brotkumen) f&uuml;r den Galsschl&uuml;ssel
besorgen. Den Zucker geben wir dem Chefkoch sofort. Das STeak in der
K&uuml;che nehmen wir gleich mit. Nun gehen wir die Kellertreppe hinunter
und versuchen die T&uuml;r mit dem Schl&uuml;ssel aufzusperren. Leider ist
die T&uuml;r durch irgend etwas von innen versperrt. Gehen wir jetzt nach
drau&szlig;en in den WALLED GARDEN. Wir gehen in das Baumhaus und
&ouml;ffnen hier die T&uuml;r. Im Westen (auf dem Ast) befestigen wir die
W&auml;scheleine an dem Ast (tie the washing line onto limb) und klettern
so nach unten. Den Igel lassen wir links liegen, obwohl er doch ein guter
Spielball w&auml;re. Bevor wir nun in den Garten gehen k&ouml;nnen, lassen
wir das Seil mit einem "drop"-Befehl los. Die h&ouml;lzerne Fallt&uuml;r
&ouml;ffnen wir, indem wir den Haken in das Loch stecken und am Haken
ziehen. Durch einen geheimen Tunnel gehen wir nun in den Keller des
Palastes. IM CELLAR lassen wir die Flasche geschlossen und stecken sie ein.
Den Keil an der Kellert&uuml;r nehmen wir weg (nicht mit) und gehen
zur&uuml;ck in den Palast. Im PALACE geben wir dem Chefkoch die
Sprudelflasche und gehen in den Garten zur&uuml;ck. Dort geben wir GET
WASHING LINE, CLIMB UP, DROP WASHING LINE ein. Als n&auml;chstes geht`s
dann zum GIANT MUSHROOM, wo wir der Raupe das Brausepulver zum Rauchen
geben, die dann verschwindet. Sie teilt uns gerade noch mit, das wir etwas
von der rechten und von der linken Seite des Pilzes zum Schrumpfen oder zum
Wachsen benutzen k&ouml;nnen. Insgesamt drei Mal schneide ich mit dem
Tranchiermesser ein St&uuml;ck von der linken Seite des Pilzes ab und
bef&ouml;rdere die St&uuml;cke sogleich in den LEFT HAND POUCH WITH CARVING
INTO LEFT HAND POUCH. Dasselbe wird mit der rechten Seite und dem RIGHT
HAND POUCH durchgef&uuml;hrt. Wir k&ouml;nnen jetzt zum Pfad im Nordwesten
des WALNUT TREE gehen. Mit dem Tranchiermesser l&ouml;sen wir den
Ziegelstein aus der Mauer. Im Loch der Mauer befindet sich die n&auml;chste
Karte, die aber in den Garten f&auml;llt. Also wieder zur&uuml;ck in den
WALLED GARDEN. Dort nehmen wir die Karo 9 auf. BY THE RIVER werfen wir
f&uuml;r den Hund den "stick" weg, er kommt mit einem Schl&uuml;ssel
wieder. Wir geben jetzt dem Hund das Steak, um an den SILVER KEY und
veentuelle andere Dinge heranzukommen. Nun gehen wir zum WIGGLY-WAGGLY
PATH, wo der Sirupbrunnen steht. Wir nehmen das Seil, um den Krug daran
festzubinden. Wir geben am Brunnen TIE ROPE TO JUG und DROP JUG ein und
befestigen die Kurbel an der Winde mit TIE WINCH HANDLE TO WINCH. Dann
drehen wir die Kugel im Uhrzeigersinn (wie im CONSERVATORY). Nun ziehen wir
den Krug wieder hoch, binden ihn los und nehmen den Krug voll mit Sirup
(turn handle abticlockwise, untie rope, take jug). Im BACK GARDEN des
RABBIT`S HOUSE ziehen wir die Klammer wieder auf die Nase und durchsuchen
mit der Mistgabel aus dem Garten der Herzogin den Misthaufen. Dann gehen
wir zum DISUSED BEAVER`S HOLE im Flu&szlig; und &ouml;ffnen die Luke. Gehen
wir jetzt nach oben, befindne wir uns in einem Schrank, wahrscheinlich
unter dem Waschbecken, weil hier viele Rohre sind. Wir nehmen das Schmalz
aus dem K&uuml;bel mit. In der K&uuml;che ist eine Teetruhe, die wir
mitnehmen. Im Fr&uuml;st&uuml;cksraum ist eine Serviette, die wir mit FOLD
NAPKIN falten und ins Inventory aufnehmen. Den Segeltuchsack aus dem
Hutzimmer nehmen wir auch mit. Nun gehen wir zur MAD TEA PARTY. Nachdem wir
uns dar&uuml;ber aufgeregt haben, da&szlig; diese Grafik nichts mit der auf
der Packung zu tun hat, klettern wir auf die Tafel. Nun essen wir ein
St&uuml;ck von der rechten Seite des Pilzes, das sich immer noch im RIGHT
HAND POUCH befindet. Nun klettere ich schnell auf die Teekanne und esse
noch ein St&uuml;ck des "rechten Pilzes". Wir lassen nun Alice schnellstens
in die Teekanne klettern und versuchen irgendwie mit der Maus zu sprechen.
Die Maus w&auml;ltz sich jetzt im Schlaf und wir nehmen jetzt die Karo 10.
Nun klettern wir schnell zur&uuml;ck, um &uuml;ber die Tafel wieder auf dem
Boden zu stehen. Wir essen nun am besten noch ein St&uuml;ck Pilz aus der
LEFT HAND POUCH, um zu wachsen. Jetzt haben wir diesen Part gel&ouml;st und
kehren auf demselben Weg zur UNDER THE FOOTBRIDGE zur&uuml;ck, wo wir den
Karo Buben finden. In der PALACE KITCHEN geben wir dem Chefkoch den Sirup,
die Brotkrumen und das SChmalz. Oben im ROYAL OBSERVATORY stellen wir uns
auf die Teetruhe, legen die gro&szlig;e Linse ins gro&szlig;e Ende des
Teleskops und entsprechend die kleine in das kleine Ende (PUT LARGE LENS
INTO LARGE END AND THE SMALL LENS INTO THE SMALL END). Jetzt k&ouml;nnen
wir das Teleskop benutzen. Wir schlie&szlig;en das linke Auge und schauen
durch das Teleskop. Nun drehen wir es solange, bis es nach S&uuml;dosten
auf das Baumhaus zeigt und wir die n&auml;chste Spielkarte sehen
k&ouml;nnen. Nun nehmen wir die Stiefel &uuml;ber dne Keller mit (wo wir
sie vorher auch abgelegt ahben) und egehn zum WALLED GARDEN zur&uuml;ck,
ziehen die blauen Handschuhe an und &ouml;ffnen den Segeltuchsack. Dann
nehmen wir den Igel, legen ihn in den Sack und schlie&szlig;en den Sack
wieder. Auf dem Baumhaus stecken wir Alice`s Arm in das Loch und nehmen die
Karo 9 auf. Am OLD TREE schlie&szlig;en wir die Silbert&uuml;r mit unserem
silbernen Scl&uuml;ssel auf. Dann sind wir in der LONG HALL, wo wir ein
St&uuml;ck PIlz von der rechten Seite essen und kleiner werden. Jetzt
k&ouml;nnen wir durch die TINY DOOR gehen, die im Westen liegt. Wir
m&uuml;ssen dazu den Vorhang beiseite ziehen und die T&uuml;r aufmachen. In
der PASSAGE arbeiten drei Spielkarten an einem der B&uuml;sche mit
wei&szlig;en Rosen. Wir helfen ihnen, die B&uuml;sche mit den pinsel
anzustreichen. Als Dank daf&uuml;r erhalten wir einen Sack Mehl. Mit dem
nagellackentferner reinigen wir den Pinsel wieder (nicht ablegen!). Der
apssende Befehl dazu lautet : DIP PAINT BRUSH INTO NAIL VARNISH REMOVER.
Nun gehen wir bis zum schlafenden Greif. Da er mir sonderbar vorkommt,
wecke ich ihn ert einmal. Jetzt mu&szlig; ich mir die gesamte
englisch-sprachige Unterhaltung Schildkr&ouml;te/Greif anh&ouml;ren. Immer
nur LISTEN TO THEM oder auch nur LISTEN eingeben. Sie sagen, da&szlig; die
Spielkarte, die zuerst im gericht war, mehr gilt, als die, die sp&auml;ter
kommen, auch wenn deren Wert h&ouml;her ist. Nun tausche ich die Schuhe
gegen Stiefel aus und gehe zum Ententeich. Am DUCK POND betreten wir den
teich und nehmen die Karo 5 auf. Wir k&ouml;nnen jetzt die h&ouml;lzerne
T&uuml;r mit dem Holzschl&uuml;ssel aufschlie&szlig;en. Wir ziehen die
Stiefel aus und legen sie ab. Dann ziehen wir wieder die normalen Schuhe
an. Sp&auml;ter m&uuml;ssen wir dann um den Teich herumgehen, da wir sonst
mit Fieber wieder aufwachen. Nun klettern wir auf dem trohn der
K&ouml;nigin, und essen ein St&uuml;ck Pilz aus der LEFT HAND POUCH. Wir
geben PULL BELL PULL ein und die Wand gleitet zur Seite. Wir gehen in den
Geheimgang hinter der Wand und finden den Karo K&ouml;nig und einen roten
Schl&uuml;ssel. In der K&uuml;che geben wir dem Chefkoch das Mehl und der
T&ouml;lpel wirft uns doch tats&auml;chlich einen Glasschl&uuml;ssel zu.
Bevor dieser am Boden zerschellt, geben wir zweimal GET CRYSTAL KEY ein. In
der BANQUET HALL &ouml;ffnen wir mit dem neuen Schl&uuml;ssel die Glastruhe
und nehmen die Einladung zum Crocketspiel der Herzogin. Jetzt braucht das
fanatsievolle Kind nur noch einen Schl&auml;ger f&uuml;rs Crocketspiel.
Also gehen wir noch einmal zum WHITE RABBIT`S BEDROOM und tauchen den
Pinsel in die wei&szlig;e Farbe. Dann machen wir mit PAINT EGG das Ei ganz
wei&szlig;. Wir m&uuml;ssen nun zum GIANT ELM TREE gehen. Um einen langen
Hals zu bekommen, trinken wir die Fl&uuml;ssigkeit aus der Quarzflasche.
Dann legen wir das Ei in den Mund von Alice und warten mit WAIT, bis der
Hals gewachsen ist. Dann geben wir DROP BREAKFAST EGG INTO NEST ein und
warten, bis der Hals wieder normal ist. Dann warten wir ab, bis unsere
Punktzahl gewachen ist. Weil alles so spa&szlig;ig war, essen wir den
kuchen und wachsen wiederum. Der Kuchen befindet sich in der Glasschachtel.
Sind wir dann ein bi&szlig;chen gewachsen, nehmen wir den frisch
gebr&uuml;tenden Flamingo aus dem Nest und warten, bis wir
Normalgr&ouml;&szlig;e erreicht haben. Zur&uuml;ck beim SOUTH OF DUCK PONDS
zeigen wir dem W&auml;chter die Einladung ein- oder mehrmals und wartet,
bis die G&auml;aste eintreffen. Dann auf nach S&uuml;dwesten. Auf dem
CROQUETT GREEN &ouml;ffnen wir den Leinensack und nehmen den Igel heraus.
Wir geben jetzt HIT HEDGEHOG WITH FLAMINGO ein und folgen dem rollenden
Igel. Der rollt UNDER THE BRAMBLE HEDGE, wo wir unsere letzte Spielkarte
finden, das Karo-As. Dann gehen wir um den Ententeich zum TAILOR`S COTTAGE,
wo der Schneider pl&ouml;tzlich da ist. Wir geben ihm den SUIT OF DIAMONDS,
der ein h&uuml;bscher Anzug geworden ist, worauf der Schneider verschwindet
und wir dem Schl&uuml;ssel aus dem Overall des Kochs nehmen k&ouml;nnen.
Wir gehen in den Palast und schlie&szlig;en in der EASTERN HALL mit dem
roten Schl&uuml;ssel die T&uuml;r zum Raum der W&auml;chter zu, um
sp&auml;ter nicht verhaftet zu werden. Jetzt schlie&szlig;en wir in der
PALACE KITCHEN die T&uuml;r zur Speisekammer mit dem Schl&uuml;ssel des
Kochs auf und nehmen die T&ouml;rtchen. Wenn nach ein paar WAITS der
Herzbube kommt, schubst dieser uns in den COURTROOM. Dort werden wir nun
wegen Diebstahls angeklagt. Die Liste der GEschworenen wird vorgelesen und
siehe da - hier tauchen die Karokarten wieder auf, in der Reihenfolge, in
der man sie eingesammelt aht (mitschreiben!). Nun wird immer eine Karte zur
Anklage aufgerufen und man mu&szlig; eine zur Verteidigung bestimmen, die
fr&uuml;her dagewesen (eingesammelt) sein mu&szlig;. Bei uns war die
reihenfolge also 6, 2, 7, Dame, 4, 9, 8, 10, Bube, 3, 5, K&ouml;nig, As.
Zuerst wird nun die 7 zur Anklage aufgerufen. Dann w&auml;hlen wir die 2
(CHOOSE 2). Nun w&auml;hlen wir gegen die 5 die 3, gegen den Buben die 10,
gegen die 9 die 4 usw. Schlie&szlig;lich kann f&uuml;r die 6 nichts Neues
mehr gew&auml;hlt werden - ich bin frei und kann sagen: Ich habe Wonderland
mit voller Punktzahl gel&ouml;st!</P>

<HR>
<IMG src="tip0.gif" alt="" width="640" height="22" border="0" usemap="#tip0"> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>
