<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x04 - TCP/IP</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0066.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0065.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0067.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=155 HEIGHT=25 SRC="../images/_workshop_.gif" ALT="[Workshop]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0063.html">Tunnel Anims</A> | <A HREF="0x0064.html">WGet</A> | <A HREF="0x0065.html">Programmieren</A> | <A HREF="0x0066.html">TCP/IP</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR>
					<A HREF="0x0059.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x005A.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x005B.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x005D.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x005E.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0060.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x0063.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x0067.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0068.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0069.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x006C.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>TCP/IP (Teil 2)</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Wie versprochen, besch&auml;ftigen wir uns in dieser
Ausgabe intensiv mit den TCP/IP Adressen, ihrer Einteilung in Klassen und
&auml;hnlichen Dingen. Dieser Teil wird sehr allgemein gehalten und ist
auch auf andere Computer - und Betriebssysteme - anwendbar.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Beim letzten Mal haben wir erfahren, da&szlig; eine TCP/IP Adresse, die
&quot;Hausnummer&quot; unseres Computers im Internet, derzeit aus vier Byte
besteht, und zur leichteren Lesbarkeit dezimal und mit einem Punkt zwischen
den Bytes dargestellt wird.<BR>

<BR>Da das Internet nicht aus einem einzigen langen Kabel besteht, wird ein
Teil dieser Adresse zur Adressierung des Netzes verwendet, in dem der
Computer h&auml;ngt, der restliche Teil zur eigentlichen
Rechneradressierung. Anhand des ersten Bytes k&ouml;nnen die IP Adressen in
Klassen eingeteilt werden. Je nach Klasse werden mehr Bytes zur
Netzadressierung oder zur Adressierung des einzelnen Rechners in einem Netz
verwendet.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Diese Klasseneinteilung sieht folgenderma&szlig;en aus:<BR>

<BR><TT> Klasse A: 1.x.x.x - 127.x.x.x </TT><BR>

<BR>Hier wird nur das erste Byte zur Adressierung des Netzes verwendet, es
kann also maximal zwischen 127 Netzwerken unterschieden werden, daf&uuml;r
k&ouml;nnen in jedem dieser Netze (theoretisch) 16.777.214 Rechner
h&auml;ngen. Die wenigen Klasse A Netze wurden schon lange vergeben, nur
einige wenige Internetpioniere sind stolzer Besitzer einer solchen
Adresse.<BR>

<BR><TT> Klasse B: 128.x.x.x - 191.x.x.x </TT><BR>

<BR>In dieser Klasse werden die ersten beiden Bytes f&uuml;r die
Netzadresse, die restlichen zwei f&uuml;r die Rechneradresse verwendet.
Dadurch steigt die Anzahl der verf&uuml;gbaren Netze auf 16.384 mit maximal
65.534 angeschlossenen Computern.<BR>

<BR><TT> Klasse C: 192.x.x.x - 223.x.x.x </TT><BR>

<BR>Durch die Verwendung der ersten drei Bytes zur Adressierung des Netzes
k&ouml;nnen hier 2.097.152 Netze mit jeweils 254 Rechnern adressiert
werden.<BR>

<BR><TT> Klasse D: 224.x.x.x - 239.x.x.x </TT><BR>

<BR>Dieser Bereich ist f&uuml;r die sogenannte Multicast-Adressierung
vorgesehen, bei der eine Gruppe von Computern auf einmal angesprochen
werden kann. Die Multicast-Adressierung wird in zuk&uuml;nftigen
Entwicklungen eingesetzt werden und soll hier nicht weiter er&ouml;rtert
werden.<BR>

<BR>Die Adressen zwischen 240.x.x.x und 255.x.x.x sind reserviert und
werden z.B. im neuen IP6 (oder IPNG) verwendet werden.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die obenstehende Aufstellung hat aber noch einen kleinen Fehler. Per
Definition wurden einige Adressbereiche als Sonderadressen eingestuft, die
wir uns auch noch kurz ansehen m&ouml;chten:<BR>

<BR><TT> 127.x.x.x </TT><BR>

<BR>Alle Adressen die mit 127 beginnen, sind sogenannte Loopback Adressen.
Sie d&uuml;rfen nur f&uuml;r interne Tests am Rechner verwendet werden und
in keinem Fall am Kabel aufscheinen. Die wichtigste Adresse hier ist
127.0.0.1, die lokale Loopbackadresse. Da jeder Rechner sich selbst
&uuml;ber diese Adresse ansprechen kann, wird sie zum Test der Installation
verwendet. Die korrekte Funktion der Netzkarte kann damit aber nicht
&uuml;berpr&uuml;ft werden!<BR>

<BR><TT> x.x.x.255 </TT><BR>

<BR>Sind alle Bits der Netzwerkadresse auf 1 gesetzt, werden alle Rechner
im jeweiligen Netzwerk angesprochen. Diese Adressen werden
Broadcast-Adressen genannt.<BR>

<BR><TT> x.x.x.0 </TT><BR>

<BR>Sind alle Bits der Netzwerkadresse auf 0 gesetzt, wird das Netzwerk
selbst adressiert.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Zus&auml;tzlich zu diesen Sonderadressen wurden noch einige
Adressbereiche als privat gekennzeichnet. Diese Adressen werden im Internet
nicht transportiert und sollten daher f&uuml;r die eigenen Netze benutzt
werden. Sollte so ein privates IP Netzwerk dennoch mit dem Internet
verbunden werden, mu&szlig; ein Verbindungsrechner mit NAT (Network Address
Translation, einer Technik zur Umwandlung von privaten in offizielle IP
Adressen) verwendet werden.<BR>

<BR>Folgende private IP Adressen wurden definiert:<BR>

<BR><TT>
 Klasse A: 10.0.0.0 - 10.255.255.255<BR>
 Klasse B: 172.16.0.0 - 172.31.255.255<BR>
 Klasse C: 192.168.0.0 - 192.168.255.255
</TT><BR>

<BR>Durch diese frei verf&uuml;gbaren Adressen ist jeder in der Lage, ein
privates Netzwerk zu konfigurieren, ohne erst eine offizielle IP Adresse
beantragen zu m&uuml;ssen.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Da es aus diversen technischen Gr&uuml;nden nicht m&ouml;glich ist, in
ein einziges Netz (=Kabel) mehrere tausend Computer zu h&auml;ngen, werden
in der Praxis einzelne Netzwerke noch in weitere sogenannte Subnetze
unterteilt. Hier wird durch die Angabe der Subnetmask angegeben, welche
Bits der IP Adresse zur Adressierung des Netzes verwendet werden, und
wieviele Bits noch zur eigentlichen Rechneradressierung frei bleiben. Dabei
werden alle Bits zur Netzwerkadressierung auf 1, alle Bits zur
Rechneradressierung auf 0 gesetzt. Die Subnetmask f&uuml;r ein Klasse A
Netz w&auml;re also 255.0.0.0, f&uuml;r ein Netz der Klasse C z.B.
255.255.255.0.<BR>

<BR>Neben dieser offiziellen Einteilung k&ouml;nnen auch Subnetze
ausserhalb der Klasseneinteilung gebildet werden. Durch die Angabe der
Netmask 255.255.255.240 wird z.B. angegeben, da&szlig; die letzten 4 Bit
zur Adressierung des Computers verwendet werden. Mit 4 Bits sind 16
Kombinationen m&ouml;glich, durch den Wegfall der Broadcast und
Netzwerkadresse k&ouml;nnen also maximal 14 Computer in diesem Netzwerk
installiert werden.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Um einzelne Netzwerke miteinander verbinden zu k&ouml;nnen, werden
Router ben&ouml;tigt. Ein Router ist ein Ger&auml;t, da&szlig; aufgrund von
Routingtabellen unterscheiden kann, an welches der angeschlossenen
Netzwerke ein Datenpacket weitergeschickt (geroutet) werden mu&szlig;. Ein
Router kann ein Computer mit mehreren Netzwerkanschl&uuml;ssen (Ethernet,
Seriell, ISDN) oder eine speziell daf&uuml;r konstruierte Blackbox sein.
Das Defaultgateway gibt dabei an, zu welchem Interface der Router die Daten
schicken soll, dessen Empf&auml;nger er nicht kennt. &Uuml;ber eigene
Routingprotokolle k&ouml;nnen die einzelnen Router untereinander
Informationen austauschen, um die einzelnen Computer im Netzwerk zu finden.
Dabei wird je nach Datendurchsatz eine relativ hohe Rechenleistung
ben&ouml;tigt. Die Router der Firma CISCO, die einen Gro&szlig;teil der
Routingaufgaben im Internet bew&auml;ltigen, sind z.B. je nach
Einsatzgebiet mit 680x0 oder mit MIPS RISC Prozessoren ausgestattet.<BR>

<BR>Viele dieser Informationen sind aber in der Regel nur f&uuml;r die
Betreiber eigener Computernetze (bis hin zu Teilen des Internet) notwendig.
Der Enduser, der sich nur bei seinem Internetprovider einw&auml;hlt,
mu&szlig; sich z.B. nicht um eine IP Adresse k&uuml;mmern. Das ist Aufgabe
seines Internetproviders, der aber nicht einmal f&uuml;r jeden Kunden eine
eigene IP Adresse ben&ouml;tigt. Durch dynamische IP Adressvergabe wird
jedem Kunden nach der Anwahl eine IP Adresse aus einem Pool von Adressen
zugeordnet. Legt der Kunde wieder auf, kann diese Adresse wieder dem
n&auml;chsten Anrufer &uuml;bergeben werden.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Schon sehr bald nach der Entstehung der ersten auf TCP/IP basierenden
Computernetze erkannte man, da&szlig; es sehr umst&auml;ndlich ist, sich
alle ben&ouml;tigten IP Adressen zu merken. Das menschliche Gehirn merkt
sich halt z.B. www.amigascene.com viel leichter als 195.12.193.31. Daher
wurde damit begonnen, eigene Listen zu f&uuml;hren, die jeder IP Adresse
einen Rechnernamen zuordnen. Aber durch den pl&ouml;tzlichen Internetboom
wurde auch die Wartung dieser &quot;hosts&quot; genannten Datei sehr
aufwendig. Kaum auf allen beteiligten Computersystemen installiert, sind
schon wieder neue Rechner dazugekommen und die eben eingerichtete Datei war
wieder veraltet. Um dieses Problem in den Griff zu bekommen, wurden die
Domain Name Services (DNS) entwickelt. Dabei wird die Zuordnung der
Rechnernamen zu den IP Adressen &uuml;ber eine weltweit verteilte Datenbank
geregelt. Jeder Internetprovider betreibt einen DNS Server, der bei Bedarf
Auskunft &uuml;ber die von ihm verwalteten IP Adressen gibt. Sollte aber
eine IP Adresse angefordert werden, die nicht im eigenen Bereich liegt,
wird genau geregelt, &uuml;ber welche anderen DNS Server der
gew&uuml;nschte Rechner gefunden werden kann. Diese Suche wird vom DNS des
Internetproviders durchgef&uuml;hrt, daher mu&szlig; der Endbenutzer nur
den ihm am n&auml;chsten liegenden DNS Server angeben, alles andere
l&auml;uft von selbst im Hintergrund ab.<BR>

<BR>Anhand des Domainnamens kann man auch eine grobe Zuordnung des
besuchten Rechners machen. Endet die Domain z.B. auf .at, so ist ein
Rechner in &Ouml;sterreich angesprochen, .org bezeichnet den Rechner einer
Organisation und unter .ac.at wird sich ein Uni-Rechner in &Ouml;sterreich
melden (academic.austria).<BR>

<BR>So, genug der grauen Theorie, im n&auml;chsten Teil geht es wieder mehr
in die Praxis. Wir werden uns die wichtigsten TCP/IP Stacks am Amiga
ansehen und einige Tips zur Konfiguration geben.<BR>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#dieter">Dieter Sabathi</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0066.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="0x0050.html">Workshop Teil 1</A><BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp;
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0065.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0067.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
