<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x04 - Editorial</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x005A.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0059.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x005B.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=128 HEIGHT=25 SRC="../images/_editorial_.gif" ALT="[Editorial]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x005A.html">April 1998</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR>
					<A HREF="0x0059.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x005A.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x005B.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x005D.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x005E.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0060.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x0063.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x0067.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0068.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0069.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x006C.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Hurra, der Fr&uuml;hling ist da!</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Unbeirrt und scheinbar unber&uuml;hrt schreibe ich
diese Zeilen ganz gelassen, obwohl ich mich insgeheim schon gar nicht mehr
halten kann vor Spannung, Freude, oder &auml;hnlichem. Wovon rede ich? Nun,
von etwas, das uns gerade noch in letzter Minute erreichte, eine geradezu
sensationelle Nachricht. Wer das <A HREF="0x0059.html">Cover</A> schon
gesehen hat, der wird wissen, was ich meine: <B>Crawler</B>, der neue
Prototyp aus dem Hause Amiga Inc.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Jeff Schindler ist schon ganz aus dem H&auml;uschen, endlich kann der
neue Prototyp der Amiga-Gemeinde vorgestellt werden. Das Design erinnert
etwas an den &quot;Walker&quot;, auch der Name. Angeblich taufte man den
neuen Amiga-Prototyp aus Tradition &auml;hnlich. Warum aber kam es
eigentlich so schnell zur Ver&ouml;ffentlichung? Nun, die
Entwicklungsabteilung in den USA war schon so erstaunlich weit
fortgeschritten, da&szlig; Petro Tschytschenko einfach nicht mehr bis zur
n&auml;chsten Herbstmesse warten wollte: &quot;Diese Nachricht mu&szlig;
sofort raus, denn unsere Zeit ist kostbar! Die Amiga-Fans haben lange genug
gewartet!&quot;, so der Pr&auml;sident.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>&quot;Der Crawler stellt eine kleine Revolution im Bereich der Personal
Computer und Internet dar!&quot; frohlockt Jeff, und er f&auml;hrt fort:
&quot;Amiga-User brauchen keine Angst haben, ihre Zorro-Slots zu verlieren.
Das Design bietet momentan Platz f&uuml;r 4 ZorroII/III Slots, 2 Video
Slots und 3 (m&ouml;glicherweise aktive) PCI-Slots. In der Standard
Ausf&uuml;hrung ist der Crawler jedoch nur ein besseres CD32.&quot; gesteht
Jeff. Allerdings kann man sich f&uuml;r den Crawler einen Tower kaufen, der
dann nicht nur SCSI-Ger&auml;ten sondern auch Erweiterungskarten und 2
Netzteilen Platz bieten soll. Erfreulicherweise gibt es ein hervorragend
funktionierendes SCSI-2 Interface on Board, sowie eine 450MB-Harddisk, die
jedoch an einem IDE-Port liegt. Man will ja Geld sparen...<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Das Revolution&auml;re ist das Konzept: In der Standard Ausf&uuml;hrung
ist der Crawler eine reinrassige Settop-Box, und wird auch als solche
vermarktet werden. Der Crawler ist so schmal wie ein Satellitenreceiver und
sieht fast genauso aus, in edlem schwarz. Dazu gibt es einen passenden
Monitorst&auml;nder, der Flatscreen-Bildschirm mit funkelndem Crawler-Logo
kommt vielleicht von Samsung, aber das ist noch nicht fix. Nat&uuml;rlich
kann man den Crawler auch mit einem normalen Fernseher betreiben, aber die
Frequenzen sind dann eben nicht das wahre. Tastatur und Maus bzw.
Controller werden an der Vorderseite des Ger&auml;tes angeschlossen, und
ein Quadspeed CD-ROM Laufwerk mit Tray (kein Caddy!) ist intern (am
IDE-Port) eingebaut. &quot;Und damit werden wir einfach ein preislich
unschlagbares Multimedia Ger&auml;t abliefern.&quot; ist sich Petro
Tschytschenko sicher.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Aber nun zu den technischen Daten: Das ChipSet ist dasselbe wie das des
CD32, und das ganze Ger&auml;t ist demnach beinahe zum CD32 ident,
abgesehen vom 4000er-kompatiblen CPU-Slot und dem SCSI-2 Interface. Positiv
sei noch vermerkt, da&szlig; ein MPEG-Decoder bereits fix eingebaut ist.
&quot;Wenn schon eine Kiste mit CD-ROM unter dem Fernseher steht, dann soll
man damit auch Filme auf CD abspielen k&ouml;nnen, ist doch klar!&quot;
meint Petro. Au&szlig;erdem werden ein paar CD32-Spiele und ein PhotoCD
Viewer sowie weitere &quot;Goodies&quot; mitgeliefert. Aber was uns jetzt
alle interessiert: Wie sieht ein voll ausger&uuml;steter Crawler im Tower
aus? Nun, prinzipiell ein Amiga 4000 mit schnellerem RAM-Interface, einer
internen SCSI-2 Schnittstelle, eingebautem MPEG-Decoder und CD-ROM
Laufwerk. Letzteres kann zum Beispiel auch gegen das geplante
DVD-R/W-Laufwerk, genannt &quot;Q-Drive IV&quot;, ersetzt werden. Bei so
vielen Erweiterungen mu&szlig; nat&uuml;rlich die Hauptplatine irgendwann
in den Tower wandern. Ob man dabei ATX-konform bleiben will, wird Amiga
International noch entscheiden. Zur Zeit ist die erste Version des Boards
alles andere als ATX-kompatibel, aber &quot;Hauptsache, es l&auml;uft
perfekt&quot;, t&ouml;nt es siegesgewi&szlig; aus Jeff's Mund.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Momentan verhandelt Amiga International noch mit Gateway2000 &uuml;ber
organisatorische Details und wie den kleinen Amigafreaks und den
erwachsenen Internetjunkies die Droge Crawler verabreicht werden wird.
W&auml;hrenddessen werkelt man in den USA munter herum und freut sich,
da&szlig; Gateways Geldsegen alle erstickt. &quot;Ein lustiges Detail will
ich noch verraten&quot; fl&uuml;stert Jeff, und man merkt, da&szlig; er
sich kaum noch zur&uuml;ckhalten kann, &quot;weil sie dank unseres
schnellen Fortschritts kurzzeitig unbesch&auml;ftigt waren, haben zwei
Leute aus unserer Abteilung mit dem Bau einer ferngesteuerten
Tortenwerfmaschine begonnen!&quot;<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>STOP PRESS</B>: In wirklich allerletzter Minute erreichte uns die
Meldung, da&szlig; die alten Pl&auml;ne und Prototypen f&uuml;r das
AAA-Chipset wieder aufgefunden wurden! Jeff und seine Kollegen mu&szlig;ten
also die Arbeit am <I>Projekt: PieThrower</I> abbrechen und arbeiten nun
fieberhaft an der Fertigstellung des AAA-Chipsatzes, um selbigen in den
Crawler und andere zuk&uuml;nftige Produkte einzubauen. &quot;Das wird die
Hersteller der Zorro-Grafikkarten aber gar nicht freuen! Damit schaffen wir
sogar auf PAL/NTSC Fernsehern ein flimmerfreies Bild, und HDTV wird auch
schon unterst&uuml;tzt!&quot; grinst Jeff Schindler, der die Sensation
eines 24Bit-AAA Chipsatzes mit Datendurchsatzraten, die Voodoo alt aussehen
lassen werden, nicht mehr verheimlichen konnte. &quot;Ein Kinderspiel, das
Redesign! Warum wir da nicht fr&uuml;her draufgekommen sind. Auch 8MB
CHIP-RAM sind nun keine Utopie mehr. Besitzer eines 4000ers k&ouml;nnen
sich also schon mal einen Chip-Puller zulegen.&quot;<BR>

<BR>Diese neue AAA-Version des Walkers - &auml;hhh, Crawlers, wird dann
allerdings doch erst auf der Computer98 pr&auml;sentiert, daf&uuml;r soll
das fertige Modell wenig sp&auml;ter bereits ausgeliefert werden: Geplanter
Termin ist der 1.April 1999.<BR>

<BR><CENTER>Jaja, im April macht's jeder wie er will!</CENTER>&nbsp;

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#lutz">Bernhard Lukas</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x005A.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp;
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0059.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x005B.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
