<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x04 - ISDN Master II</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x005E.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x005D.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x005F.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=148 HEIGHT=25 SRC="../images/_hardware_.gif" ALT="[Hardware]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x005E.html">ISDN MAster II</A> | <A HREF="0x005F.html">Blizzard PPC 603e</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR>
					<A HREF="0x0059.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x005A.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x005B.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x005D.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x005E.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0060.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x0063.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x0067.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0068.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0069.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x006C.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>ISDN Meisterlich!</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Ein Situationsbericht vom Betrieb der ISDN Master II im
ISDN Netz der PTA. In Deutschland wurde ja schon &ouml;fter dar&uuml;ber
geschrieben, hierzulande war ISDN am Amiga aber kaum bekannt. Da stellt
sich nat&uuml;rlich die Frage, ob ISDN gleich ISDN ist, sprich ob sich die
ISDN Master auch im &ouml;sterreichischen Postnetz bew&auml;hrt. Eines
gleich vorweg - sie tut es.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Wir bei der Point Design haben seit ca. einem Monat die ISDN Master als
&quot;Alles- in-allem-ISDN-L&ouml;sung&quot; in einem Amiga 3000 im
Einsatz. Die Zorro 2 Steckkarte ersetzt neuerdings ein ISDN-Telefon und die
Anrufbeantworter. Au&szlig;erdem dient sie als Schnittstelle ins Internet
(mit Miami 3.0). Die ISDN Karte l&auml;&szlig;t sich also f&uuml;r zwei
Aufgabengebiete einsetzen:<BR>

<BR> 1. f&uuml;r den Datenverkehr<BR> 2. als ISDN Telefon<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Zuerst zum Datenverkehr / Internetanbindung</B></H3>&nbsp;

<BR>Mit Miami 3.0 und der ISDN Master dauert eine Installation und
Inbetriebnahme der ISDN Master maximal 10 Minuten. Zuerst die Install Disk
der ISDN Karte einlegen, Installer starten, danach Miami installieren und
ONLINE clicken. Fertig! Miami 3.0 unterst&uuml;tzt in der neue Version ISDN
direkt. Die Version 2.x konnte das auch, allerdings mu&szlig;te man am
Dial-String noch extra Hand anlegen (als Pr&auml;fix mu&szlig; dort
AT&amp;B6D eingetragen werden). Als Schnittstelle zur Karte dient das
fossil.device das auch noch einen komplettes Hayes kompatibles Modem
emuliert. Damit kann man die Karte auch mit einem normalen Terminal
benutzen (z.B. Term) - vorausgesetzt die Gegenstelle erlaubt eine
Verbindung &uuml;ber ISDN - zu einem als Modem konfigurierten Gegenpart
sieht's da dann schlecht aus.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die wichtigste Frage stellt sich nat&uuml;rlich gerade beim
Internetzugang: Wie schnell ist sie? ISDN hat da eine feste
Transferleistung mit 64 KBit/sec (pro D-Kanal). Das ist auch schon die
Antwort darauf. Maximal lassen sich so um die 8-9 KB pro Sekunde
&uuml;bertragen - meistens allerdings darunter, weil es kaum eine Leitug
gibt die vom Provider her mehr als 5-6 KB/s liefert. Beim FTP Transfer
k&ouml;nnen es aber an &quot;ruhigen&quot; Tagen - und nur einer Connection
(innerhalb &Ouml;sterreichs) schon 8,5 KB/s werden.<BR>

<BR>Surfen wird mit der ISDN Master zur wahren Freude, Bilder werden
&quot;rasend&quot; schnell geladen. &quot;Site Jumping&quot; wird endlich
interessant. Mann sieht eine Ank&uuml;ndigung, mu&szlig; nat&uuml;rlich
gleich hin und kommt drauf, da&szlig; da doch nix interessantes steht -
also n&auml;chste Page her. Mit dem Modem eine Qual - mit ISDN angenehm
schnell.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>An Internetsoftware l&auml;&szlig;t sich so ziemlich alles benutzen.
Ich habe die Preview-Version des YAM 2.0 als Mailbox laufen, benutze den
Voyager und den IBrowse als WWW-Browser und gelegentlich AmFTP um mal was
vom Aminet zu holen. Au&szlig;erdem auch noch telnet-en auf'n Server, um
mal schnell was zu schauen. Da gibt es also keine Einschr&auml;nkungen.<BR>

<BR>Bei so viel Licht gibt's nat&uuml;rlich auch Schatten. Leider ist es
mir bis heute nicht gelungen, die ISDN Master mit AmiTCP/IP zum Laufen zu
bringen. Das liegt an einem Problem des ppp.device. F&uuml;r meine
PPP-Verbindung ben&ouml;tige ich unbedingt einen synchronen PPP Modus der
mit dem AT&amp;B6D im Dialstring (nicht im Init Teil!) eingeschaltet werden
mu&szlig;. Leider hab' ich's nicht geschafft, dem AmiPPP den Dialstring
mitzuteilen - wenn von Euch jemand wei&szlig;, wie man das macht, nur her
damit. AmiTCP w&auml;re wichtig, da Miami derzeit leider nur ein Interface
bedienen kann, wir aber auch ein Ethernet-Netzwerk betreiben. Die
k&uuml;nftige Miami Deluxe Version soll das dann aber auch k&ouml;nnen.
Abwarten.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Ein weiteres Minus ist sicher die f&uuml;r ISDN Verh&auml;ltnisse lange
Connect-Zeit. Zum Aufbau einer Verbindung vergehen leicht 2sec, ISDN
verbindet normalerweise im ms-Bereich. Was Miami leider auch nicht kann,
ist eine Verbindung parken, d.h. z.B. nach einer gewissen Unt&auml;tigkeit
die Verbindung zum Server unterbrechen und beim n&auml;chsten Zugriff
wieder zu verbinden. Bei ISDN k&ouml;nnte man das auf Grund der kurzen
Connect-Zeiten sehr effizient ausn&uuml;tzen, daher ein glatter Minuspunkt.
Jeder kennt das, man entdeckt ein interessantes Online-MagaScene und will
einen Artikel lesen, und nebenbei l&auml;uft der Telefonz&auml;hler
hei&szlig;. Es w&auml;re sch&ouml;n, wenn man nicht nur zahlt, w&auml;hrend
man bl&auml;ttert.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Einsatz als ISDN Telefon</B></H3>&nbsp;

<BR>Zum Betrieb als ISDN Telefon ben&ouml;tigt die ISDN Master das
Telefonmodul, ein kleiner Aufsatz, der am hinteren Ende auf die Karte
gesteckt wird. Zus&auml;tzlich wird noch ein handels&uuml;blicher
Telefonh&ouml;rer ben&ouml;tigt (ich benutze derzeit den H&ouml;rer meines
Swatch-Twin-Phones weil das sonst eh so leise ist, da&szlig; ich nix
verstehe). Angesteckt wird der H&ouml;rer an der 4 poligen Western-Buchse
gleich neben dem durchgef&uuml;hrten (!) S0-Bus. Die Lautst&auml;rke
f&uuml;r H&ouml;rer und Mikrofon lassen sich einzeln programmieren. Eine
Verbindung l&auml;&szlig;t sich stumm schalten, mit Hintergrundmusik parken
(allerdings nur &uuml;ber einen Men&uuml;befehl und nicht mit einem
Gadget!) und der Telefonlautsprecher l&auml;&szlig;t sich sogar auf
Amiga-Audio legen (mit 1-2 sec verz&ouml;gerung &uuml;bern Z2 Bus!).<BR>

<BR>Die Telefon-Software WilhelmTel II ist im Lieferumfang enthalten und
recht einfach gehalten. Es stehen grunds&auml;tzlich alle Funktionen, die
ein Telefon braucht, zur Verf&uuml;gung. MSNs, also Mehrfachnummern (ISDN
kann als &quot;Dienst&quot; mehrere Nummern intern verwalten) lassen sich
beliebig programmieren. Pro MSN kann ein eigener Anrufton eigestellt
werden, der &uuml;brigens als IFF-8SVX Sample vorliegen kann.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Weiters l&auml;&szlig;t sich die Steckkarte auch als Anrufbeantworter
einsetzen. Das auch noch so flexibel, als da&szlig; man f&uuml;r jede MSN
Nummer einen eigenen Text aufnehmen kann. Schlu&szlig; mit dem Aparate
Chaos, nur mehr ein Ger&auml;t f&uuml;r alle Nummern. Rufnummern lassen
sich auch ignorieren. Das ist z.B. interessant, falls eine MSN als Fax
konfiguriert ist. Mit dem Fax will man ja selten Quatschen.<BR>

<BR>WilhelmTel beinhaltet auch ein Telefonbuch das allerdings auch sehr
einfach gehalten wurde und leider keine Schnittstelle nach au&szlig;en
bietet. Nummern lassen sich mit Namen und Adressen speichern und auch in
Gruppen zusammenfassen. Wird bei eingehenden Rufen die Nummer mitgeschickt
(z.B. bei ISDN Telefonen &uuml;blich oder bei GSM Handys), und befindet
sich die Nummer im Adre&szlig;buch, wird der Name des Anrufers auch gleich
angezeigt.<BR>

<BR>Wilhelm Tel II ist ein Commodity und l&auml;uft unauff&auml;llig im
Hintergrund. Die Funktionen sind nicht gerade &uuml;ppig, es kann aber
alles was ein komfortables Arbeiten mit dem ISDN-Telefon braucht. Was ich
allerdings vermisse, ist eine ARexx-Schnittstelle, mit der sich Wilhelm Tel
einfach erweitern lie&szlig;e. Ich denke da z.B. an eine dirkete Anbindung
an eine Lager-, Aufrags- und Kundenverwaltung. Das w&auml;re mit ARexx
relativ einfach zu realisieren.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Keine Faxen!</B></H3>&nbsp;

<BR>Was die ISDN Master leider nicht kann, ist faxen. Angesichts der
M&ouml;glichkeit, nur G3 Faxe &uuml;ber ISDN verschicken zu k&ouml;nnen ist
das allerdings kein wirkliches Manko. Dazu m&uuml;&szlig;te auch die
Gegenstelle ein ISDN Fax besitzen. Ein Fax an ein analoges G2 Fax mit einem
G3 Ger&auml;t ist leider nicht m&ouml;glich - G2 mit der ISDN Master rein
technisch nicht m&ouml;glich.<BR>

<BR>Ja,das war's. Viele werden sagen:&quot;8 KB/s schaffe ich mit meinem
56K Modem auch!&quot;, allerdings kann man auch noch nebenbei telefonieren
- ohne dabei aufstehen zu m&uuml;ssen :) Subjektiv habe ich den Eindruck,
da&szlig; ISDN bei mehreren Connections gleichzeitig, weniger einbricht als
ein Modem, allerdings fehlt mir da die konkrete Vergleichsm&ouml;glickeit
mit einem schnellen 36/56K Modem. Au&szlig;erdem erspart man sich mit der
ISDN Master die serielle Schnittstellenkarte, die bei einem externen
Ger&auml;t wieder extra anfallen w&uuml;rde. Und zu Guter Letzt kostet die
ISDN Master nicht viel: 1.699,- ohne Telefonoption, 1.999,- mit. Zu
beziehen &uuml;ber die <A HREF="http://www.pointdesign.com/">Point Design
Software &amp; Sales</A>. (Ein bi&szlig;chen Werbung sei mir
verziehen).<BR>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#juergen">J&uuml;rgen Schober</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x005E.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_04/isdnmaster2.gif">Die ISDN Master II</A> (GIF;18K)<BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x005D.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x005F.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
