<html>
<head>
<!-- "author" content="Wolf Zimmer"     -->
<title>EMail-Knigge</title>
</head>
<body background="wolf1.gif" text=black link=blue vlink=blue bgcolor=gray>
<a href="onl_email00.html#inh"> zum Inhaltsverzeichnis </a>
<br>
<h2>Ausdruck</h2>
<hr>

<p>Am schwierigsten ist es, in Emails Emotionen zu vermitteln. Die meisten
Menschen geraten in Panik, wenn sie versuchen, genau das zu schreiben, was
sie (laut) sagen w&uuml;rden. Da aber die Stimme fehlt, kann man leicht die
eigentliche Botschaft der Nachricht mi&szlig;verstehen. </p>

<p>Es gibt aber auch bei Texten die M&ouml;glichkeit Emotionen zu
vermitteln.</p>

<h3>Leichte Betonung</h3>

<p>Wenn Sie etwas leicht betonen wollen, sollten Sie es in Sterne (*)
einbetten. Dies entspricht der kursiven Schreibweise. Anstelle von:</p>

<p><tt>Ich sagte, dass ich am Donnerstag gehen w&uuml;rde.</tt></p>

<p>Sagen Sie: </p>

<p><tt>Ich *sagte*, dass ich am Donnerstag gehen w&uuml;rde.</tt></p>

<p>Oder: </p>

<p><tt>Ich sagte, dass ich am *Donnerstag* gehen w&uuml;rde.</tt></p>

<p>Die eine Variante betont das Versprechen (*sagte*), die andere Variante
den Wochentag (nicht Mittwoch!)</p>

<h3>Starke Betonung</h3>

<p>Wenn Sie etwas st&auml;rker betonen wollen, k&ouml;nnen sie das ganze
Wort in Gro&szlig;buchstaben schreiben und einige Ausrufezeichen
hinzuf&uuml;gen.</p>

<p>Also statt:</p>

<p><tt>&gt;Sollte ich auf den roten Schalter dr&uuml;cken? </tt></p>

<p><tt>Nein, wenn Du auf den roten Schalter dr&uuml;ckst, explodiert das
ganze Haus.</tt></p>

<p>besser: </p>

<p><tt>&gt;Sollte ich auf den roten Schalter dr&uuml;cken? </tt></p>

<p><tt>NEIN!!!!! Wenn Du auf den roten Schalter dr&uuml;ckst, EXPLODIERT
das ganze Haus!!!!!</tt></p>

<p>Denken Sie daran, da&szlig; Sie Gros&szlig;buchstaben nur sehr sparsam
einsetzen sollten. Ebenso wie z.B. Blindheit dazu f&uuml;hrt, da&szlig; man
besser h&ouml;rt, f&uuml;hrt eine gro&szlig;e Schlichtheit des Textes dazu,
da&szlig; man die Betonungen besonders beachtet. So entsteht bei sparsamen
Gebrauch der Gros&szlig;buchstaben quasi der Eindruck, da&szlig; Sie
schreien.</p>

<p>Es ist daher auch vollkommen unangemessen einen Text nur mit
Gros&szlig;buchstaben zu schreiben, wenn Sie selbst ruhig und entspannt
sind:</p>

<p><tt>HI, ICH WOLLTE NUR H&Ouml;REN, WIE ES EUCH GEHT. WENN IHR LUST HABT,
K&Ouml;NNT<br> IHR JA MAL ANRUFEN!</tt></p>

<p>Die Empf&auml;nger werden zusammenzucken, wenn Sie das lesen!</p>

<h3>&gt;&gt;AUSSERGEW&Ouml;HNLICHE!!&lt;&lt; Betonung</h3>

<p>Wenn Sie wirklich etwas au&szlig;erordentlich betonen m&uuml;ssen,
k&ouml;nnen Sie loslegen:</p>

<p><tt>Solltest Du diesmal auch zu sp&auml;t kommen, werde ich nie, *nie*,
*NIE*, &gt;&gt;!!**NIE**!!&lt;&lt; wieder mit Dir sprechen!</tt></p>

<p>Dies sollten Sie wirklich selten verwenden!</p>

<h3>Murmeln</h3>

<p>Es gibt diverse M&ouml;glichkeiten, um anzuzeigen, da&szlig; eine
Bemerkung privat und nicht dazu gedacht ist, weiter getragen zu werden. Sie
k&ouml;nnen leiser sprechen, Sie k&ouml;nnen nach links und rechts gucken,
Sie k&ouml;nnen n&auml;her an den Gespr&auml;chspartner herantreten. An
diese Vorgehensweise haben wir uns alle derart gew&ouml;hnt, da&szlig; wir
sie auch verwenden, wenn &uuml;berhaupt kein Dritter anwesend ist. Leider
ist diese Vorgehensweise aber in Emails &auml;u&szlig;erst schwer.</p>

<p>Ich schreibe manchmal das, was ich denke, um dann eine "gereinigte"
Schreibweise hinterher zu schicken:</p>

<p><tt>Mein Boss hat eine seiner *bl&ouml;dsinnigen* Ideen unters Volk...
&auml;&auml;&auml;hh, eine &Uuml;berlegung vorgetragen, die das
Verh&auml;ltnis zwischen Sekretariat und Vertrieb verbessern wird.</tt></p>

<p>Ein Freund von mir benutzt doppelte Klammern, um einen inneren Dialog
anzudeuten:</p>

<p><tt>Mein Boss eine &Uuml;berlegung vorgetragen ((die ja ber&uuml;hmt
sind...)), die das Verh&auml;ltnis zwischen Sekretariat und Vertrieb
verbessern wird ((wers glaubt...)).</tt></p>

<p>Eine andere Sache, die ich manchmal verwende, um Murmeln anzudeuten,
ist, nur in Kleinbuchstaben zu schreiben:</p>

<p><tt>pssst! hey Anne! weisst du was?</tt></p>

<p><tt>ICH HABE DEN AUFTRAG! :-D :-D !!</tt></p>

<p>Ich sollte Sie warnen, da&szlig; es einige wenige Menschen gibt, die
diese Arten der Betonung nicht mag. Sie sind der Meinung, da&szlig; Goethe
auch ohne solche Zeichen Emotionen vermitteln konnte. Nun bin ich aber
nicht Goethe und ich habe auch nicht soviel Zeit, um jede Email
auszufeilen. Im &uuml;brigen ist es besser Unklarheiten zu vermeiden und
damit einige zu ver&auml;rgern, als anders herum! </p>

<hr>
        
<h3>Zusammenfassung</h3>

<p>F&uuml;r die meisten Menschen ist es schwer in einer kurzen Nachricht
Emotionen auszudr&uuml;cken. Gl&uuml;cklicherweise gibt es einige Tricks um
sie trotzdem zu vermitteln. <ul>
<li>Sternchen (zur Betonung)
<li>Gro&szlig;buchstaben
<li>Interpunktion
<li>Kleinbuchstaben
</ul></p>

<hr>

<p>Weiter zum Thema <a href="onl_email05.html">&quot;Mimik und Gestik&quot;</a><br>
zur&uuml;ck zum Thema <a href="onl_email03.html">Seiten-Layout</a><br>
zur&uuml;ck zum <a href="onl_email00.html#inh"> Inhaltsverzeichnis </a></p>

<hr>
        
<p>Bitte beachten Sie die <a href="onl_email00.html#Copyright">Copyright-Information</a>. </p>
<p>&nbsp;
</body>
</html>
