<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gehört - notiert</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses8.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Geruechte.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Geh&ouml;rt - notiert
</font>
</TD></tr>
</TABLE>
<BR>
<H2>Geh&ouml;rt - notiert</H2>
<H2>AMIGA-Meldungen</H2>
<UL>
<LI> Kurz nach Redaktionsschluss des Spieleteils erreichte uns folgende
  Meldung von Peter Elzner: &raquo;Mein erstes gro&szlig;es Amiga Spiel Diamond Caves I
  ist nach knapp 4 Jahren jetzt als Freeware erh&auml;ltlich. Sowohl Spiel, als
  auch der MUI-Leveleditor sind jetzt uneingeschr&auml;nkt nutzbar, viele neue
  Levelgruppen gibt es z.B. im Aminet oder direkt unter
  <A HREF="http://www.diamond-pro.com" TARGET="_TOP">http://www.diamond-pro.com</A>
  Mein Dank gilt den &uuml;ber 250 registrierten benutzern f&uuml;r ihre
  Unterst&uuml;tzung, wer sich trotzdem registrieren lassen m&ouml;chte kann ja
  Diamond Caves II bestellen :-) Ansonsten sind alle User nur aufegfordert,
  mir bei Gefallen eine sch&ouml;ne Ansichtskarte zu schicken.&laquo; (Peter Elzner
  &lt;<A HREF="mailto:peter.elzner@diamond-pro.com">peter.elzner@diamond-pro.com</A>&gt;)
</LI>
<LI> Vor einiger Zeit hat u.a. Vesalia Computer eine ZorroIV(!)-Buserweiterung
  f&uuml;r den A1200 angek&uuml;ndigt. Dabei handelt es sich nach unseren
  Informationen um eine &uuml;bertaktete ZorroII-Erweiterung, die eventuell
  sogar die Geschwindigkeit von ZorroIII &uuml;bertreffen k&ouml;nnte.
<P>
  Mit dem damals von Commodore geplanten ZorroIV-Standard hat das Ganze
  nichts zu tun, ebenso wie die Erweiterung zum 32Bit breiten ZorroIII
  nicht kompatibel ist.
</P>
</LI>
<LI> In diesen Tagen soll bei Haage &amp; Partner (<A HREF="http://www.haage-partner.com" TARGET="_TOP">http://www.haage-partner.com</A>)
  die Version 2 der 3D-Hardware-Treibersoftware Warp3D erscheinen.
  Wichtigste Neuerung wird die Unterst&uuml;tzung des Permedia2-Grafikprozessors
  sein, der auf den Grafikkarten CyberVisionPPC und BVisionPPC zum Einsatz
  kommt.
</LI>
<LI> Toysoft hat eine neue E-Mail-Software namens StarGate angek&uuml;ndigt.
  N&auml;heres soll ab dem 1. Februar auf
  <A HREF="http://www.toysoft-dev.com/stargate.html" TARGET="_TOP">http://www.toysoft-dev.com/stargate.html</A> zu erfahren sein.
</LI>
<LI> Der Sourcecode des Basic-Dialekts AMOS ist freigegeben worden. Er kann
  auf <A HREF="http://www.clickteam.com/web/amos/amos.htm" TARGET="_TOP">http://www.clickteam.com/web/amos/amos.htm</A> heruntergeladen werden.
</LI>
<LI> Die Amiga-Arena (<A HREF="http://online-club.de/~ARENA/" TARGET="_TOP">http://online-club.de/~ARENA/</A>) bietet erneut Shareware
  zu Sonderpreisen an: Die IRC-Software BlackIRC (Test in dieser Ausgabe
  von AMIGA aktuell) gibt es im Bundle mit dem Telefongeb&uuml;hrenmanager AGM
  bis zum 11.02.1999 f&uuml;r 25 Mark (statt 35 Mark). Auch andere Programme von
  Felix Schwarz sind im Bundle g&uuml;nstiger zu erwerben.
<P>
  Ebenfalls neu in der Amiga-Arena ist ein Gewinnspiel, bei dem man eines
  von f&uuml;nf Keyfiles f&uuml;r das Spiel Imperium Terranum 2 gewinnen kann.
  Au&szlig;erdem ist angek&uuml;ndigt, dass es die deutsche Version des Freeware-
  Strategiespiels Task Force voraussichtlich noch in diesem Monat exklusiv
  in der Amiga-Arena geben wird, bevor es im Aminet erscheint.
</P>
</LI>
<LI> Klaus Burkert von Village Tronic schrieb in einem Newsgroup-Posting, dass
  er pers&ouml;nlich das Erscheinen der 3DFX-Erweiterung f&uuml;r die PicassoIV-
  Grafikkarte erst gegen Ende des 2. oder im 3. Quartal erwartet.
</LI>
<LI> VaporWare, u.a. Hersteller bekannter Internetprodukte, hat seine Homepage
  (<A HREF="http://www.vapor.com" TARGET="_TOP">http://www.vapor.com</A>) umgestaltet.
<P>
  Vor kurzem ist &uuml;brigens die Version 1.1 der Mail- und News-Software
  Microdot 2 erschienen.
</P>
</LI>
<LI> Detlef Baranski informiert &uuml;ber einige Links f&uuml;r DraCo-Nutzer: &raquo;Dany
  Thinnes und sein Brett f&uuml;r Informationsaustausch &uuml;ber Computer
  B.I.C., alles ueber Amiga und DraCo, insbesondere das DraCo-Forum AVIE
  und die AVIE-Mailingliste, auf Deutsch, sind f&uuml;r DraCo-User und
  Movieshop-Anwender sehr interessant. Hervorzuheben ist die NetBSD-Hilfe
  auf Deutsch und ein Workshop zur Vernetzung von PC-Amiga. Seine Homepage:
  <A HREF="http://home.t-online.de/home/dany.thinnes" TARGET="_TOP">http://home.t-online.de/home/dany.thinnes</A>
  Ingo Sedding macht dir ein wenig Konkurrenz (belebt das Gesch&auml;ft;
  Anm.d.Red.) mit dem DraCo-Online-Magazin Draconer, zu finden im Aminet
  unter Mags oder auf seiner Homepage unter: <A HREF="http://home.t-" TARGET="_TOP">http://home.t-</A>
  online.de/home/ing.sed/index.htm&laquo; (Detlef Baranski, <A HREF="mailto:dBTV@gmx.de">dBTV@gmx.de</A>)
</LI>
<LI> Von Andreas Etzrodt bekamen wir folgende Mail: &raquo;Ein Bekannter von mir
  hatte vor kurzem eine Idee mit der er zu Amiga International gegangen
  ist. Er k&ouml;nnte ein Kartenspiel mit Motiven von Amiga (alle Amiga
  Computer) in Lizenz als Werbeartikel herstellen. Bevor er die
  Investitionen t&auml;tigt, w&uuml;rde es ihn interessieren ob so ein Kartenspiel
  anklang in der Amiga Gemeinde finden w&uuml;rde. Das Kartenspiel w&uuml;rde aus 35
  Karten bestehen. Das Spielprinzip ist an Schwarzer Peter angelehnt, nur
  das die Schwarze Peter Karte ein PC ist. H&ouml;rt euch doch mal um, ob sich
  daf&uuml;r jemand interessiert, ein St&uuml;ck w&uuml;rde ca. 10-12.- DM kosten, je nach
  Abnahmemenge.&laquo;
  Bei Interesse wendet euch bitte an Andreas Etzrodt &lt;<A HREF="mailto:the_shark@gmx.de">the_shark@gmx.de</A>&gt;.
</LI>
<LI> &raquo;In der Bravo Screenfun 2/99 ist ein recht interessanter Bericht &uuml;ber die
  gr&ouml;&szlig;te Szeneparty der Welt, &quot;The Party 98&quot;, die vom 27.-29. Dezember 98
  in D&auml;nemark stattfand. Darin findet auch der Amiga Erw&auml;hnung.&laquo;
  Berichtet wird u.a. von jemandem, der seit drei Jahren in einem Auto lebt
  und quer durch Europa von Party zu Party f&auml;hrt. Als Bett diene ihm eine
  Matratze, die er anstatt des Beifahrersitzes eingebaut habe. Seinen Amiga
  betreibe er an der Autobatterie. (Thomas Szedlak, <A HREF="mailto:TSzedlak@gmx.de">TSzedlak@gmx.de</A>)
</LI>
<LI> Die beiden nordamerikanischen Print-Magazine Amiga Informer und Amazing
  Computing/Amiga haben fusioniert. Die neue Zeitschrift wird unter dem
  letztgenannten Titel erscheinen und durch PiM Publications vertrieben.
</LI>
</UL>
<H2>Von DOSen und &Auml;pfeln (sowie weitere Nicht-AMIGA-Meldungen)</H2>
<UL>
<LI> Andreas Schauml&ouml;ffel hat uns die folgende Information von Heiner de Wendt
  zugeleitet:
<P>
  &raquo;Geld zur&uuml;ck f&uuml;r ungewolltes Windows 98
</P>
<P>
  Wer mit seinem neuen Rechner im Komplettpaket auch ein vorinstalliertes
  Windows kauft, das Microsoft-Betriebssystem aber nicht benutzen will,
  kann das Geld f&uuml;r die ungewollte Software m&ouml;glicherweise erstattet
  bekommen. Wie der Informationsdienst Register berichtet, hat der
  Australier Geoffrey Bennett in einem solchen Fall erstmals 110
  australische Dollar (ca. 119 DM) R&uuml;ckzahlung erstritten.
</P>
<P>
  Bennett hatte sich dabei auf den Windows-Lizenzvertrag bezogen, in dem es
  hei&szlig;t: &quot;Falls Sie den Bestimmungen dieses Lizenzvertrages nicht
  zustimmen, geben Sie bitte das unbenutzte Produkt unverz&uuml;glich gegen
  R&uuml;ckerstattung des Kaufpreises zur&uuml;ck&quot;. Ein Sprecher vom Microsoft
  best&auml;tigte, da&szlig; diese Formulierung m&ouml;glicherweise Bestandteil jedes
  Lizenzvertrages sei. Zu m&ouml;glichen Konsequenzen wollte Microsoft aber noch
  keine Stellungnahme abgeben. Auch die gro&szlig;en Computer-Hersteller Compaq,
  Vobis und Dell wollten sich bisher nicht zu dem Problem &auml;u&szlig;ern.&laquo;
</P>
</LI>
</UL>
<P ALIGN="RIGHT">
<A HREF="Diverses8.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Geruechte.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
