<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Letzte Meldung: Zwei Hexen Ports ver&ouml;ffentlicht
</LI>
</UL>
<P>
Es sind tats&auml;chlich jetzt auch schon zwei Hexen Ports ver&ouml;ffentlicht
worden. Einer f&uuml;r WarpUP von Steffen H&auml;user und einer f&uuml;r 68k von
dem Autor des Amiga Ports Descent, Christian Sauer. Die WarpUP Version
soll mit 35fps laufen. Erfahrungsberichte folgen in der n&auml;chsten
Ausgabe!
</P>
<UL>
<LI> WildTracks kommt
</LI>
</UL>
<P>
Deepcore Entertainment hat einen verdammt gut aussehenden
Screenshot von ihrem neuen Referenzautorennen WildTracks
ver&ouml;ffentlicht. Wer den Screenshot sieht, mag vielleicht
denken, dass er einfach nur mit einem Raytracer gerendert
wurde, doch Deepcore k&uuml;ndigte prompt an, eine Demoversion
schon Ende Januar zu ver&ouml;ffentlichen. Also kann man davon
ausgehen, es sich hier um einen richtigen Screenshot handelt.
</P>
<UL>
<LI> Zwei Heretic Ports im Aminet erschienen
</LI>
</UL>
<P>
Im Aminet gibt es schon die ersten zwei Ports des PC-3D Shooter
Heretic zum Runterladen. Ein Port (AHeretic) ist wie angek&uuml;ndigt
von Jesper Svennevid und unterst&uuml;tzt momentan nur 68k Rechner.
Eine PPC Version soll aber die Tage folgen, da Jesper nur noch
einige Fehler beseitigen muss. Der andere Port (Heretic) stammt
von Sebastian Jedruszkiewicz und liegt in zwei Versionen, PPC
und 68k, vor. F&uuml;r beide Versionen ben&ouml;tigt man die Original PC
WAD Dateien, entweder in der Shareware- oder Vollversion. Die
Shareware Dateien kann man von ftp.idsoft.com/pub/idgames/idstuff/
herunterladen. Ein Erfahrungsbericht folgt in der n&auml;chsten
Ausgabe. &Uuml;brigens: Der Doom Nachfolger war Heretic - nicht Quake!
</P>
<UL>
<LI> Steffen H&auml;user k&uuml;ndigt Heretic Port an
</LI>
</UL>
<P>
Auch Steffen H&auml;user hat einen Heretic Port angek&uuml;ndigt. Sein
AmiHeretic unterst&uuml;tzt 68k und WarpOS und soll noch im Januar
erscheinen. Zufinden sein wird es auf jeden Fall im Aminet unter
game/shoot/AmiHeretic.lha. Letzte Meldung: Der Port wurde soeben
ver&ouml;ffentlicht. Hier einige Features: AGA und Grafikkarte
werden unterst&uuml;tzt, Anzeige auf eigenem Bildschirm oder im
Workbench Fenster, Tastatur konfigurierbar, Joystick/Joypad/Mouse,
Musik und Netzwerk sind in Vorbereitung.
</P>
<UL>
<LI> 2260 Designs ben&ouml;tigt Hilfe mit Space Tribulations
</LI>
</UL>
<P>
Obwohl sehr viel Interesse an Space Tribulations bestand, nachdem
eine Demo auf der Amiga Format CD ver&ouml;ffentlicht wurde, gab der
Entwickler das Projekt auf. 2260 Designs will die Arbeit jedoch
fortf&uuml;hren und sucht deshalb C Programmierer und 3D Grafiker.
Interessierte k&ouml;nnen sich bei <A HREF="mailto:2260Designs@zetnet.co.uk">2260Designs@zetnet.co.uk</A> melden.
</P>
<UL>
<LI> Abducted von Aftertaste Productions
</LI>
</UL>
<P>
Ein neues Grafikadventure hat Aftertaste Productions in der
Mache. Hier arbeitet an Abducted, einem 256 Farb Adventure im
Stile von Simon the Sorcerer und nat&uuml;rlich Monkey Island. Die
Vollversion, die haupts&auml;chlich auf CD-ROM erscheinen soll, wird
HAM8 3D Sequenzen, sowie 16/8bit Sound und Sprachausgabe beinhalten.
Ein Ver&ouml;ffentlichungstermin wurde noch nicht bekanntgegeben.
</P>
<P>
<A HREF="img/abduction1.png"><IMG SRC="thumb/abduction1.jpg" WIDTH="120" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/abduction2.png"><IMG SRC="thumb/abduction2.jpg" WIDTH="120" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> Alive Mediasoft News
</LI>
</UL>
<P>
Alive Mediasoft hat zwei neue Spiele angek&uuml;ndigt, an denen sie
arbeiten: Goal 98-99 und Phoenix Fighter. Bei Goal 98-99 handelt
es sich um die Fortsetzung des Fussball Klassikers Goal. Phoenix
Fighters ist ein klassisches Shoot-em-up mit einigen Extras. So
gibt es z.B. verschiedene Modi, wie den Race Modus, in dem man
versuchen muss, schneller als der Computer ans Ziel zu gelangen.
Demoversionen beider Spiele sollen bald erscheinen.
</P>
<UL>
<LI> Digital Dreams Entertainment News
</LI>
</UL>
<P>
F&uuml;r April `99 wurde Diablo`s Land angek&uuml;ndigt, ein Arcade Adventure
mit vielen 3D Grafiken und stimmungsvoller Musik, die die Dungeon
Atmosp&auml;hre sehr realistisch machen. Die Mindestanforderungen belaufen
sich auf 4MB Fast Ram, AGA oder Grafikkarte und CD-ROM. Ein weiteres
Spiel ist MegaPolice, einem Echtzeit Strategie Spiel als Polzeihauptmann.
Um daf&uuml;r zu sorgen, dass nachts die Stra&szlig;en sicher sind, muss man
mit allen m&ouml;glichen Typen (Dieben, Dealern...) verhandeln und sein
Geschick behaupten. Ver&ouml;ffentlicht werden soll MegaPolice im Sommer,
wobei man mindestens AGA oder Grafikkarte sowie 6MB Ram und ein
CD-ROM Laufwerk ben&ouml;tigt.
</P>
<UL>
<LI> Wasted Dreams jetzt Distant Dreams
</LI>
</UL>
<P>
Wegen finanzieller Schwierigkeiten &uuml;bernahm Digital Dreams Entertainment
die Wasted Dreams Entwickler Digital FX. Au&szlig;erdem &auml;nderte man
den Namen in Distant Dreams. Man ben&ouml;tigt mindestens AGA oder eine
Grafikkarte, 3MB Ram und CD-ROM Laufwerk f&uuml;r Distant Dreams. Ver&ouml;ffentlicht
soll Distant Dreams Ende Januar werden. Es wurden noch viele Verbesserungen
gemacht, die den Ver&ouml;ffentlichungstermin herausz&ouml;gerten. So gibt es
jetzt zum Beispiel RTGmaster Unterst&uuml;tzung.
</P>
<P>
<A HREF="img/distantdreams1.png"><IMG SRC="thumb/distantdreams1.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/distantdreams2.png"><IMG SRC="thumb/distantdreams2.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> Kinetic Creationz ben&ouml;tigt Hilfe f&uuml;r Dark Soul
</LI>
</UL>
<P>
Und wieder ein neues Entwicklungsteam, welches Hilfe ben&ouml;tigt. Kinetic
Creationz plant die Amiga Antwort auf Diablo 2 zu kreieren und sucht
nach Storm C Programmierern, 3D Grafikern (Lightwave) und professionellen
Musikern. Das Spiel soll nur auf PowerPC &amp; Grafikkarten laufen. Wenn
man das Team komplett zusammenh&auml;tte, k&ouml;nnte eine Demoversion schon
auf der Amiga 99 Show ver&ouml;ffentlicht werden. Wer bei dem Projekt
Dark Soul mithelfen m&ouml;chte, wende sich bitte schnellstm&ouml;glichst an Steven
Bruces &lt;<A HREF="mailto:kinetic_creationz@yahoo.co.uk">kinetic_creationz@yahoo.co.uk</A>&gt;.
</P>
<UL>
<LI> Crystal Software mit zwei neuen Entwicklerteams
</LI>
</UL>
<P>
Zwei neue Entwicklerteams arbeiten jetzt f&uuml;r Crystal Software: Sanios
Software, die an RockDog und MageWars arbeiten, und Digital Visionarries
mit ihrem Deb&uuml;tspiel The Holy Trinity.
</P>
<UL>
<LI> The Last Seal von ANCOR
</LI>
</UL>
<P>
Die The Last Seal Entwicklung geht weiter, leider gibt es noch
immer keine Unterst&uuml;tzung f&uuml;r Grafikkarten. Die Features des
Adventures im Stil von Monkey Island scheinen genial: Man kann
5 verschiedene Perspektiven benutzen, die Hauptfigur besteht
aus &uuml;ber 300 Einzelbildern, es gibt nur ge-Raytrace-te
Hintergr&uuml;nde und viele Videosequenzen sowie Sprachausgabe. Kein
Wunder, dass man daf&uuml;r mindestens 16MB Ram ben&ouml;tigt. Ein
Ver&ouml;ffentlichungstermin wurde noch nicht bekanntgegeben.
</P>
<UL>
<LI> Napalm News
</LI>
</UL>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">clickBOOM hat angek&uuml;ndigt, Napalm Netzwerk sowie TCP/IP Unterst&uuml;tzung&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">zu verleihen. Und wer die Demoversion kennt, weiss wieviel Spass&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Napalm &uuml;ber das Internet machen k&ouml;nnte. Die Ver&ouml;ffentlichung von&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Napalm steht kurz bevor, ihr werdet also h&ouml;chstwahrscheinlich&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">in der n&auml;chsten Ausgabe ein ausf&uuml;hrliches Review lesen k&ouml;nnen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> Epic Marketing News
</LI>
</UL>
<P>
Entgegen Ger&uuml;chten wird Starfighter bei Epic Marketing die Tage
erscheinen. Man solle die n&auml;chsten Tage mal ein Auge auf die Epic
Marketing Homepage werfen, da man dort bald mit einem Demo des
Spieles rechnen k&ouml;nnte.
</P>
<UL>
<LI> Bricht Titan Computer viele Amiga Spiele ab?
</LI>
</UL>
<P>
Unbest&auml;tigten Berichten zufolge soll Titan Computer folgende
Spiele eingestellt haben: Sword 2, Total Combustion, Lost
Days in Paradise, Evils Doom Special Edition und leider auch
Shadow of the third Moon 2. Da mich diese Nachricht zu sp&auml;t
erreichte, konnte ich bei Titan Computer nicht nachfragen, ob
an den Ger&uuml;chten etwas dran ist.
</P>
<UL>
<LI> Digital Images versucht Lizenz f&uuml;r Halflife zu erwerben
</LI>
</UL>
<P>
Nachdem man mit Quake 2 anscheinend nicht viel Gl&uuml;ck hatte,
versucht man bei Digital Images jetzt eine Lizenz f&uuml;r den
aktuellen PC Kracher Halflife zu erwerben. Sollte dies gelingen,
erwartet uns ein Spiel, gegen das selbst Quake 2 alt aussieht.
</P>
<UL>
<LI> NtT Software ben&ouml;tigt Hilfe f&uuml;r das Adventure GORD
</LI>
</UL>
<P>
Nachdem ein Programmierer das Entwicklerteam zwecks Absolvierung
des Wehrdienstes verliess, sucht NtT nach Ersatz sowie Grafiker
und sonstige Personen, die Interesse haben an einem Adventure
Projekt mitzuarbeiten. Interessierte sollen sich bitte an
<A HREF="mailto:jono@enti.demon.co.uk">jono@enti.demon.co.uk</A> wenden.
</P>
<UL>
<LI> Neue Screenshots von Phoenix ver&ouml;ffentlicht
</LI>
</UL>
<P>
Neue, gut aussehende, Screenshots von Phoenix wurden
vor kurzem ver&ouml;ffentlicht. Den Screenshots nach k&ouml;nnte uns da
ein Hit ins Haus stehen.
</P>
<UL>
<LI> Delsyd Software
</LI>
</UL>
<P>
Delsyd Software ist ein neues Amiga Entwickler Team, welches
6 Spiele in Planung hat. Delsyd setzt seine Hoffnung in den
PowerPC Prozessor. Dazu haben sie eine Umfrage auf ihrer
Homepage gestartet, an der auch Nicht-PPC Besitzer teilnehmen
sollen/k&ouml;nnen. Also schaut' gleich mal auf der Homepage
vorbei: <A HREF="http://www.geocities.com/siliconvalley/foothills/2705" TARGET="_TOP">http://www.geocities.com/siliconvalley/foothills/2705</A>.
Momentan arbeitet Delsyd Software an folgenden Spielen:
The Adventures Of DP Dog, DP Tennis, DP Cart, Cross Country
Ralley und Destitution. Die Release Termine wurden auch
schon bekanntgegeben. Siehe Release Liste. Das Spiel welches
als erstes ver&ouml;ffentlicht werden soll, n&auml;mlich im Novemer
1999, hei&szlig;t The Last Patriot und ist ein 3D Spiel aus der
Personenperspektive. Alle Spiele von Delsyd Software sollen
ausschlie&szlig;lich auf PPC und Super Amigas laufen.
</P>
<UL>
<LI> Marbleous 2 Demoversion ver&ouml;ffentlicht
</LI>
</UL>
<P>
Eine Demoversion von Marbelous 2 wurde im Aminet ver&ouml;ffentlicht.
Die Demo liegt in zwei Versionen vor: Eine AGA Version und eine
RTG Version. In dieser Ausgabe k&ouml;nnt ihr au&szlig;erdem ein Preview
zu Marbleous 2 lesen. Sollte ich noch eine Vollversion bekommen,
gibt`s nat&uuml;rlich ein ausf&uuml;hrliches Review.
</P>
<UL>
<LI> Zambrosia von Crossbow
</LI>
</UL>
<P>
Ein Quake Clone hat Crossbow aus Belgien in der Mache. Die
Features h&ouml;ren sich ziemlich vielversprechend an: fl&uuml;ssiges
3D Scrolling, FMV Sequenzen, atemberaubende Licheffekte und
Grafiken sogut wie Quake. Das Spiel wird f&uuml;r 68k sowie f&uuml;r
PPC entwickelt. Zu den Minimalanforderungen geh&ouml;ren ein
68040, 16MB Ram, AGA und 6x CD-ROM. Optimal w&auml;ren ein PPC,
32MB Ram und Grafikkarte. Man darf gespannt sein.
</P>
<UL>
<LI> Hexen und Heretic Quelltexte ver&ouml;ffentlicht
</LI>
</UL>
<P>
Die Quelltexte von Hexen und Heretic wurden vor Kurzem ver&ouml;ffentlicht.
Prompt k&uuml;ndigte Jesper Svennevid, der auch schon SNES9x auf den
Amiga umsetzte, eine Umsetzung beider Spiele an. Angeblich sei
Heretic schon fast fertig, und er k&ouml;nne bald mit dem Umsetzen
von Hexen anfangen. Er wird &uuml;brigens zwei Umsetzungen machen: Eine
f&uuml;r 68k und eine f&uuml;r PPC. F&uuml;r mehr Informationen einfach bei
Jesper (<A HREF="mailto:chip@ramses.ml.org">chip@ramses.ml.org</A>) nachfragen.
</P>
<UL>
<LI> Weitere Foundation Updates in Arbeit
</LI>
</UL>
<P>
Paul Burkey arbeitet fleissig an weiteren Updates f&uuml;r Foundation.
Noch diesen Monat soll eine Version mit wesentlich beschleunigter
Grafik durch bessere Grafikkartenunterst&uuml;tzung erscheinen. Danach
will Paul mit der Arbeit an der Netzwerkunterst&uuml;tzung beginnen.
</P>
<UL>
<LI> AHI kommt f&uuml;r PPC
</LI>
</UL>
<P>
Okay, diese Meldung hat nicht direkt mit Spielenews zu tun, aber
da AHI in den meisten Spielen verwendet wird, ist sie bestimmt f&uuml;r
viele interessant: Der Autor von AHI, Martin Blom, setzt AHI nun
endlich f&uuml;r PPC um, da er sich dank einer Spendenaktion eine PPC
Karte gekauft hat.
</P>
<UL>
<LI> NEX von Deflection
</LI>
</UL>
<P>
Das Team um Marco Siegel arbeitet momentan an NEX - The Dark Age.
Das Spiel soll wie Bladerunner nur in 3D werden. Klingt also durchaus
interessant. Die 3D Engine von NEX soll revolution&auml;r sein, so gibt
es MIP Mapping, Texture Filtering, Coloured lights, Lambert shading,
Polygon Feinde und Waffen. Das Spiel unters&uuml;tzt durch die Verwendung
von Warp3D auch Virge sowie Permedia2. Man soll mindestens einen
68040 besitzen und m&ouml;glichst auch eine Grafikkarte. Klar das auch
PowerPC unterst&uuml;tzt wird. Zur Fertigstellung des Projekts werden
allerdings noch C Programmierer gesucht, also wendet euch schnell
an Marco Siegel &lt;<A HREF="mailto:marco.siegel@hal.regiocom.net">marco.siegel@hal.regiocom.net</A>&gt; und lasst dieses
Spiel Wirklichkeit werden!
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
