<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Vorwort</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Main.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Intern.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Vorwort
</font>
</TD></tr>
</TABLE>
<BR>
<H2>Vorwort</H2>
<P>
Willkommen zur neuen Ausgabe von AMIGA aktuell.
</P>
<P>
Ein eher ruhiger Monat Januar ohne gro&szlig;artige Highlights ist zu Ende
gegangen. Vielleicht am interessantesten ist da noch die Ank&uuml;ndigung einer
Amiga-Version des Internet-Pakets Netscape Communicator.
</P>
<P>
Dies gilt jedoch nicht f&uuml;r den Spielebereich: Hier gab es viele
interessante Neuigkeiten.
</P>
<P>
Die Interna der heutigen Ausgabe:
</P>
<UL>
<LI> Einige von euch werden es vielleicht schon wissen: AMIGA aktuell
  erscheint ab sofort auch in englischer Sprache. &quot;AMIGA aktuell
  International&quot; ist in erster Linie Martin Henke zu verdanken, der die
  &Uuml;bersetzung aus dem Deutschen vornimmt. Der Inhalt ist gr&ouml;&szlig;tenteils mit
  dem von AMIGA aktuell identisch.
</LI>
<LI> In den letzten Monaten etwas untergegangen ist die Neuigkeit, dass es
  eine zweite AMIGA-aktuell-Homepage gibt. Sie ist unter
  <A HREF="http://www.vmc.de/aakt" TARGET="_TOP">http://www.vmc.de/aakt</A> zu finden. Unser Dank gilt Harald Frank von VMC
  f&uuml;r die Bereitstellung der ben&ouml;tigten Speicherkapazit&auml;t auf seinem
  Server.
</LI>
<LI> Andreas Schauml&ouml;ffel schl&auml;gt einen Workshop zur Erstellung von
  AmigaGuide-Dokumenten vor. Wer k&ouml;nnte das &uuml;bernehmen?
</LI>
</UL>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Zu den regelm&auml;&szlig;igen Aufrufen:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> Wir suchen jemanden, der eine eigenst&auml;ndige AMIGA-aktuell-Rubrik f&uuml;hren
  will, in der &uuml;ber Software-Updates informiert wird. Monat f&uuml;r Monat
  erscheinen bekanntlich unz&auml;hlige FD- und kommerzielle AMIGA-Programme in
  neuen Versionen. Ziel dieser neuen Rubrik ist es, die wichtigsten
  Verbesserungen von neuen Software-Updates aufzulisten.
  Wer hat Interesse, sich darum zu k&uuml;mmern?
</LI>
<LI> Weiterhin gesucht werden Tester von frei kopierbarer Software. Jeder, der
  sich f&uuml;r diese Aufgabe bereit erkl&auml;rt, wird in eine spezielle
  Verteilerliste eingetragen und erh&auml;lt dann in unregelm&auml;&szlig;igen Abst&auml;nden
  Test-Vorschl&auml;ge, ist aber zu nichts verpflichtet.
<P>
  Nat&uuml;rlich freuen wir uns aber genauso &uuml;ber Tests kommerzieller
  Produkte und nicht &uuml;ber die Verteilerliste vorgeschlagener FD-Software.
  Schreibt an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A> .
</P>
</LI>
</UL>
<P>
Viel Spa&szlig; jetzt bei dieser Ausgabe,
</P>
<P>
euer
</P>
<P>
Carsten Schr&ouml;der
</P>
<P ALIGN="RIGHT">
<A HREF="Main.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Intern.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
