<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Tests.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H3>4. Update: So senkt ihr eure Telekom-Rechnung!</H3>
<P>
In den letzten Wochen haben verschiedenste Medien Tariftabellen der
g&uuml;nstigsten Telefongesellschaften ver&ouml;ffentlicht. Die positive Folge f&uuml;r
Viatel und TelDaFax: Steigende Nutzerzahlen und Einnahmen. Die Kunden haben
derzeit dagegen mit einer negativen Begleiterscheinung zu k&auml;mpfen: Die
Netze sind, besonders am Abend, oft &uuml;berlastet, was sich in dem bekannten
Besetztzeichen ausdr&uuml;ckt.
</P>
<P>
Da zumindest TelDaFax Abhilfe versprochen hat, und ab April sowieso mit
einer Verbesserung der Lage zu rechnen ist (siehe weiter unten), habe ich
mich entschlossen, die Liste zun&auml;chst nicht um Alternativanbieter zu
erg&auml;nzen. Sollte jedoch mittelfristig keine Besserung eintreten, wird sich
das &auml;ndern.
</P>
<P>
Auch im letzten Monat war die Telefongesellschaft Mobilcom in den
Schlagzeilen - allerdings im Gegensatz zum Dezember eher im negativen Sinn:
</P>
<UL>
<LI> Der Internet-Pauschaltarif von 77 Mark pro Monat (Amiga aktuell
  berichtete) beinhaltete leider auch eine Reihe von Pannen: So klagten
  nicht wenige Amiga-Anwender &uuml;ber Schwierigkeiten bei der Konfiguration
  des TCP/IP-Stacks (eine entsprechende Anleitung ist in dieser Ausgabe von
  AMIGA aktuell enthalten). Auch die durchschnittliche
  Daten&uuml;bertragungsrate sank im Laufe der Zeit immer mehr ab.
<P>
  Desweiteren gab es mehrere Wochen lang eine gef&auml;hrliche Sicherheitsl&uuml;cke:
  Ohne gro&szlig;en Aufwand war es selbst f&uuml;r durchschnittlich erfahrene Anwender
  m&ouml;glich, die Daten aller eingew&auml;hlten Nutzer herauszufinden.
</P>
<P>
  Daraufhin entschloss sich Mobilcom am 22. Januar, das Angebot bis zum 1.
  Februar auszusetzen. Alle Anmeldungen seien gel&ouml;scht worden, den
  bisherigen Nutzern entst&uuml;nden keine Kosten.
</P>
<P>
  Am 1. Februar will Mobilcom das Projekt wieder neu starten - dann
  hoffentlich ohne gr&ouml;&szlig;ere Probleme und mit h&ouml;herer Datentransferrate.
  Bisherige Teilnehmer m&uuml;ssen sich bei Interesse erneut anmelden.
</P>
</LI>
<LI> Nach der Ank&uuml;ndigung kostenloser Ortsgespr&auml;che hat Mobilcom nun einen
  R&uuml;ckzieher gemacht: Das Angebot soll nur f&uuml;r Mobilcom-Festnetzkunden
  gelten, wenn sie andere Festnetzkunden des Unternehmens anrufen.
</LI>
<LI> Aber es gibt auch Positives zu vermelden: Um die 'kostenlose Minute'
  zwischen 19.00 und 24.00 Uhr nutzen zu k&ouml;nnen (AMIGA aktuell berichtete),
  ist ab sofort keine Anmeldung mehr erforderlich.
<P>
  Des Weiteren hat Mobilcom die Tarife f&uuml;r Kunden, die sich entweder f&uuml;r
  Call-by-Call oder PreSelection _anmelden_, drastisch gesenkt: Zwischen 19.00
  und 22.00 Uhr sind nur noch 8 Pfennig pro Minute f&auml;llig, zwischen 22.00
  und 07.00 Uhr sogar nur 4(!!!) Pfennig - und das deutschlandweit.
</P>
</LI>
</UL>
<P>
F&uuml;r noch gr&ouml;&szlig;eres Aufsehen als Mobilcom sorgte jedoch die Deutsche Telekom:
</P>
<UL>
<LI> Ab April sollen, die Erteilung der entsprechenden Genehmigung durch die
  Regulierungsbeh&ouml;rde vorausgesetzt, Ferngespr&auml;che innerhalb Deutschlands
  zwischen 21.00 und 06.00 Uhr nur noch 6(!) Pfennig pro Minute kosten.
  Damit reagiert die Deutsche Telekom erneut auf die seit Monaten stark
  schwindenden Marktanteile im Ferngespr&auml;chsbereich.
</LI>
<LI> Ortsgespr&auml;che sollen zwischen 21.00 und 06.00 Uhr 3 Pfennig pro Minute
  kosten, was vor allem eine Verbesserung f&uuml;r denjenigen darstellt, der
  &uuml;berwiegend kurze Gespr&auml;che f&uuml;hrt. Bislang galt zwischen 21.00 und 05.00
  Uhr ein Vierminutentarif von 12 Pfennig.
</LI>
<LI> Auch die Kosten f&uuml;r den Dienst T-Online werden gesenkt: Pro Minute sollen
  dann nur noch 6 Pfennig f&auml;llig werden.
</LI>
</UL>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Da das oben genannte jedoch noch Zukunftsmusik ist, gilt zun&auml;chst die alte&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Tabelle weiter:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
G&uuml;nstigster Call-by-Call-Anbieter (ohne Anmeldung, Mindestumsatz, etc.):
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Netz&nbsp;</TD><TD VALIGN="TOP">werktags 9-18 Uhr&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">werktags 18-9 Uhr, ansonsten ganzt&auml;gig&nbsp;</TD></TR>
<TR><TD COLSPAN="4"><HR></TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Fest-&gt;Fest&nbsp;</TD><TD VALIGN="TOP">Viatel (01079), 16 Pfg.&sup1;&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">TelDaFax (01030), 9 Pfg.&sup2;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Fest-&gt;Mobil&nbsp;</TD><TD VALIGN="TOP">Viatel (01079), 73 Pfg.&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Viatel (01079), 36 Pfg.&sup3;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&sup1;:&nbsp;</TD><TD VALIGN="TOP">Bei Verbindungen von bis zu etwa 1 Minute Dauer ist TelDaFax (01030) mit&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">17 Pfg. g&uuml;nstiger (s.u., Geb&uuml;hrenberechnung).&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&sup2;:&nbsp;</TD><TD VALIGN="TOP">Werktags zwischen 2 und 5 Uhr nachts ist die Deutsche Telekom mit 6 Pfg.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">der g&uuml;nstigste Anbieter&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&sup3;:&nbsp;</TD><TD VALIGN="TOP">An Feiertagen, die nicht aufs Wochenende fallen, ist zwischen 9 und 18&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Uhr TelDaFax (01030) mit 48 Pfg. g&uuml;nstiger (s.u., Geb&uuml;hrenberechnung).&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
(Zum Vergleich: Die Deutsche Telekom berechnet bis zu 136 Pfg.!)
</P>
<P>
Die Tabelle sollte im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige
Anmerkungen:
</P>
<UL>
<LI> Angegeben ist jeweils der f&uuml;r 1 Verbindungsminute f&auml;llig werdende Betrag.
</LI>
<LI> 'werktags' bedeutet montags bis freitags mit Ausnahme von Feiertagen.
</LI>
<LI> Bei Ortsgespr&auml;chen hat die Telekom in weiten Teilen Deutschlands noch ein
  Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften
  g&uuml;nstige City-Tarife an. In der Regel hei&szlig;t es also bei
  Ortsgespr&auml;chen: Weiterhin die Deutsche Telekom benutzen.
<P>
  Auf <A HREF="http://www.muc.de/~hm/telefon-tarife/tarifzonen.html" TARGET="_TOP">http://www.muc.de/~hm/telefon-tarife/tarifzonen.html</A> k&ouml;nnt ihr
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte
  es mal passieren, dass ihr &quot;f&auml;lschlicherweise&quot; einen der alternativen
  Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom -
  und damit wom&ouml;glich billiger - zustande kommen k&ouml;nnte.
</P>
</LI>
<LI> Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen
  l&auml;sst. Mein Favorit: <A HREF="http://www.teltarif.de/db/index.html" TARGET="_TOP">http://www.teltarif.de/db/index.html</A>
</LI>
</UL>
<P>
Die Anbieter verfahren bei der Geb&uuml;hrenberechnung teilweise
unterschiedlich:
</P>
<UL>
<LI> TelDafax rechnet sekundengenau ab, d.h. ihr zahlt hier
  wirklich nur f&uuml;r die Zeit, die die Verbindung dauert.
</LI>
<LI> Viatel berechnet bei Verbindungen bis 30 Sekunden Dauer die gesamten 30
  Sekunden, danach wird exakt abgerechnet. ACHTUNG: An Feiertagen, die
  nicht aufs Wochenende fallen, rechnet Viatel nach dem Werktags-Tarif ab.
</LI>
</UL>
<P>
F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.
</P>
<P ALIGN="RIGHT">
<A HREF="Workshops3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Tests.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
