<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Simon the Sorcerer 2</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Ville Sarell &lt;<a href="mailto:tripper@mbnet.fi">tripper@mbnet.fi</a>&gt;</font></td>
				</tr>
			</table>
			<br>
			<font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Simon on taas t&auml;&auml;ll&auml;! Todella pitk&auml;n odotuksen j&auml;lkeen Peter Mulholland ja Paul Burkey k&auml;&auml;nsiv&auml;t pelin vihdoin niin Amigalle kuin Macillekin. Paul Burkeyhan tunnetaan mm. strategiapeli Foundationin luojana. Simon 2:n piti alun perin ilmesty&auml; Amigalle, mutta jostain syyst&auml; peli ilmestyikin vain PC:lle. Vanhan ajan point'n'click-seikkailut ovat kuitenkin nyky&auml;&auml;n sen verran harvinaista herkkua, etteiv&auml;t t&auml;m&auml;ntyyppiset pelit koskaan vanhene.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Peli saapui suhteellisen tyylikk&auml;&auml;ss&auml; DVD-kotelossa, joka sis&auml;lsi CD:n ja pienen ohjekirjasen. Ohjeista riitt&auml;&auml; kun tarkastaa eri ikonien merkitykset. Sen ehtii tehd&auml; sopivasti asennuksen lomassa. CD:n sis&auml;lt&ouml; kopioidaan kokonaisuudessaan kovalevylle, joten sit&auml; ei tarvitse peli&auml; pelatessa en&auml;&auml; lainkaan. Toki pelata voi my&ouml;s suoraan CD:lt&auml;. Alkuanimaatio on hauska, ja se kannattaa katsoa ainakin kerran.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ykk&ouml;sosassa Simon seikkaili toisessa ulottuvuudessa pelastaakseen Calypso-nimisen velhon ilke&auml;n Sordidin hallusta. N&auml;in k&auml;vikin (Calypso pelastui, Sordid kuoli ja Simon palasi omaan ulottuvuuteensa), mutta t&auml;ss&auml; osassa Simonin arkiel&auml;m&auml;&auml; taas koetellaan. H&auml;nen huoneeseensa nimitt&auml;in ilmestyy taikavaatekaappi, jonka on sinne l&auml;hett&auml;nyt haudasta nousseen Sordidin apuri. Totta kai Simon uteliaana nuorena miehen&auml; kaappiin astuu, ja matka ulottuvuuksien l&auml;pi p&auml;&auml;see j&auml;lleen alkamaan. Taikakaapista kuitenkin loppuu polttoaine(!) kesken matkan, ja Simon p&auml;&auml;tyy eri ulottuvuudessa sijaitsevaan keskiaikaiseen kaupunkiin. Sielt&auml; peli p&auml;&auml;seekin alkamaan.</font></p>
							<div align="center">
								<p><img src="kuvat/simon1.jpg" width="320" height="200" border="0" alt=" "></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Simon 2:ssa ovat ikoneina ovat tyypillisten &quot;look&quot;, &quot;pick up&quot; yms. lis&auml;ksi &quot;give to&quot; sek&auml; &quot;wear&quot;-toiminnot. F10-n&auml;pp&auml;imest&auml; l&ouml;ytyy apu niille, jotka ovat kyll&auml;styneet pikselintarkkaan tavaran etsimiseen ruudulla; se nimitt&auml;in se paljastaa kaikki objektit, joiden kanssa voi olla jollain tavalla tekemisiss&auml;. Harmi vain, ett&auml; kiusaus painaa sit&auml; on suuri aina uuteen paikkaan saapuessa. </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Pelin vaikeustaso tuntuu olevan kohdallaan, eli eteneminen takkuilee vain muutamien kinkkisten ongelmien kohdalla, ja niiden parissa helposti vier&auml;ht&auml;&auml;kin puolet koko pelin kokonaiskestosta. ;)</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Grafiikka on matalassa resoluutiossa, joskin varsin tunnelmallista ja t&auml;m&auml;n tyyppiseen peliin hyvin sopivaa. &Auml;&auml;niefektit ovat sit&auml; peruskamaa, mutta puhe on monivivahteista ja hauskaa. Onneksi &auml;&auml;nin&auml;yttelij&ouml;ihin on satsattu, tunnelman luomisessa t&auml;m&auml; on nimitt&auml;in enemm&auml;n kuin t&auml;rke&auml;&auml;. Esimerkkin&auml; mainittakoon er&auml;s puisto, jossa kolme naista pesee pyykki&auml; ja juoruilee toisilleen. Aluksi pel&auml;styin ja k&auml;&auml;nsin &auml;&auml;nenvoimakkuutta pienemm&auml;lle, kun yhdell&auml; naisella oli ihan tajuton &auml;&auml;ni, mutta sitten innostuinkin kuuntelemaan niit&auml; monia juoruja, joita heill&auml; tuntui loputtomiin olevan. Simonille vain kehittyi er&auml;&auml;nlainen &quot;suodatin&quot; korviin pitk&auml;n kuuntelemisen seurauksena, ja pitikin jatkaa itse pelin pelaamista ;). Huumori on siis monipuolista (hieman Monty Python -tyylist&auml;), vaikka Monkey Island -seikkailusarjan tasoon ei yllet&auml;k&auml;&auml;n. Ainoa huonompi puoli Simonin dialogeissa oli itse Simonin ylimielinen ja sovinistinenkin luonne. T&auml;m&auml; on tietenkin ihan makuasia, ja olen muutenkin vasta niin alussa, ett&auml; paha menn&auml; sanomaan sen enemp&auml;&auml;.</font></p>
							<div align="center">
								<p><img src="kuvat/simon2.jpg" width="320" height="200" border="0" alt=" "></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&Auml;&auml;net ja teksti eiv&auml;t aina synkkaa t&auml;ysin kesken&auml;&auml;n. Yleens&auml; teksti laahaa jonkin verran per&auml;ss&auml;, joten paras tapa on vain kuunnella puhetta ja lukea teksti&auml; sen mukaan kun jokin j&auml;i ep&auml;selv&auml;ksi. Musiikkia ei &quot;teknisten hankaluuksien&quot; takia viel&auml; ole, toivon mukaan korjaantuu jollain seuraavista p&auml;ivityksist&auml; (niit&auml; on ilmestynyt t&auml;t&auml; kirjoittaessani jo viisi, linkki arvostelun lopussa). &Auml;&auml;net ja tekstin saa my&ouml;s k&auml;ytt&ouml;&ouml;n niin yhdess&auml; kuin erikseen. T&auml;m&auml; viimeisin piirre puuttui alkuper&auml;isest&auml; PC-versiosta.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kaiken kaikkiaan Simon 2 on hyvin Amigalle k&auml;&auml;nnetty seikkailupeli, jonka parissa vier&auml;ht&auml;&auml; aikaa enemm&auml;n kuin huomaakaan. K&auml;&auml;nn&ouml;s on my&ouml;s sik&auml;li hyvin tehty, ettei peli ole kertaakaan minulla kaatunut eik&auml; muutenkaan toiminut ennalta-arvaamattomasti (nykyiset ongelmat kun ovat tiedossa pelin k&auml;&auml;nt&auml;jill&auml;kin). Yleens&auml;kin seikkailupelit ovat hyvin subjektiivisia kokemuksia, mutta itse suuren osan kolunneena voin kyll&auml; suositella Simon 2:ta varmana valintana. Paras tapa pelata ohjekirjan mukaan on ottaa viikko lomaa t&ouml;ist&auml; ja linnoittautua kotiinsa peli&auml; pelaten. :)</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Loppuhuomautus: Jos puheet eiv&auml;t kuulu, niin kopioi &auml;&auml;net CD:n data/voice/ -hakemistosta manuaalisesti uudelleen kovalevylle edellisten p&auml;&auml;lle ja asenna uusin p&auml;ivitys.</font></p>
						</td>
				</tr>
			</table>
				<br>
			</font><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tekij&auml;:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Adventure Soft Publishing (PC)<br>
								Peter Mulholland &amp; Paul Burkey (Amiga/Mac)</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Julkaisija:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://www.epic-interactive.com" target="_blank">e.p.i.c. interactive&nbsp;entertainment</a></font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Edustaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://www.ge.vip.fi" target="_blank">Gentle Eye Ky</a>, puh. (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a></font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">295 mk</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tiedostot:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://www.shoecake.com/files/Simon2Upd5.lha">Update 5</a> </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">(525 kt)<br>
								<a href="http://www.shoecake.com/simon2.html" target="_blank">Tukisivu</a> (tulevat p&auml;ivitykset t&auml;&auml;lt&auml;)</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Vaatii:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">68030, 16Mt, AGA tai RTG-grafiikkakortti, CD-ROM, n. 175 Mt kovalevytilaa (jos asennetaan HD:lle)</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Testattu:</font></td>
					<td width="50%" bgcolor="#d8ecfd">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">1. A1200 (PPC240/060), OS 3.9, BVisionPPC, 64 Mt, Delfina Lite, Ariadne2, HyperCom3Z, 36x CD, 2x CD-R, 20 Gt HD<br>
									2. A1200 AGA (040/40 MHz) OS 3.9 , 32 Mt, 8x CD, 4.3 Gt HD</font></p>
						</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Grafiikka:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">86%</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&Auml;&auml;net:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">70%</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Puhe:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">88%</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Musiikki:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">ei ole</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Pelattavuus:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">83%</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Yleisarvosana:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">85%</font></td>
				</tr>
			</table>
			</font>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>