<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Starfighter - D'Yammen's Reign</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Jarmo Piippo</font></td>
				</tr>
			</table>
			<br>
			<font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kun t&auml;m&auml; kohtalaisen tuoreelta vaikuttanut avaruusr&auml;iskint&auml; n&auml;kyi olevan myyt&auml;v&auml;n&auml; halpapelin&auml;, niin mitenp&auml; olisinkaan voinut vastustaa kiusausta. CD-R-kiekon heitt&auml;minen romppuasemaan sai kuitenkin aikaan varsin kirjavan sarjan ilmeit&auml; pelaajan kasvoille.</font></p></td>
				</tr>
			</table>
				<br>
			</font>
			<font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>N&ouml;rttisuojausta murtamaan</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Heti alussa k&auml;vi selv&auml;ksi, ett&auml; pelin kimppuun p&auml;&auml;see vasta keksitty&auml;&auml;n, miten sen saa k&auml;ynnistym&auml;&auml;n ilman rompulla olevaa, hiukan lyhytn&auml;k&ouml;isesti suunniteltua k&auml;ynnistysohjelmaa. Peli nimitt&auml;in haluaa ehdottoman v&auml;ltt&auml;m&auml;tt&auml; tehd&auml; koneesi muistiin oman pienen RAD-levykkeens&auml; ja sitten resetoida koneen, jotta se boottaa RAD:lt&auml;. Moinen temppu vain ei toimi lainkaan turbokorteilla, joiden Fast-muistiin ei voi tehd&auml; resetin kest&auml;v&auml;&auml; ja boottikelpoista RAD-asemaa. Auts!</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kaiken huipuksi peli tekee RAD-asemalle Startup-Sequenceen k&auml;skyrivin &quot;mount cd0:&quot;. Se ei tietenk&auml;&auml;n toimi, jos koneen CD-asema on kytketty ohjaimeen, joka ei asennu Autoconfigin avulla systeemiin, vaan vaatii oman ajuriohjelmansa ajamisen ensin. Hetken aikaa pelin tiedostoja p&auml;hk&auml;ilty&auml;ni sain kuitenkin selville, ett&auml; koko ongelman voi kiert&auml;&auml; tekem&auml;ll&auml; pelille itse oman pienen skriptin, jolla se k&auml;ynnistyy ilman resetointia tai muita temppuja:</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">cpu nocache   ;(tarvitaan 060:lle)<br>
									assign Starfighter: hd3:Star<br>
									cd Starfighter:starfighter/<br>
									executeable</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Skripti olettaa, ett&auml; peli on asennettu kiintolevylle osiolle hd3:, hakemistoon Star. Vaihda niiden tilalle hakemiston oikea nimi ja sijainti omalla koneellasi. Huomaa, ett&auml; pelin sis&auml;lt&auml;v&auml;n hakemiston on jostain kumman syyst&auml; oltava levyn juuressa, tai k&auml;ynnistys p&auml;&auml;ttyy virheilmoitukseen &quot;executeable failed: 'file not found'&quot;. Lis&auml;vaatimus pelin toimimiselle on, ettei koneen k&auml;ynnistysosio saa olla kirjoitussuojattuna. Pelin saa toki halutessaan toimimaan my&ouml;s suoraan rompultakin, silloin pit&auml;&auml; vain yo. skriptist&auml; j&auml;tt&auml;&auml; assign-k&auml;skyrivi pois.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ainakin omassa koneessani kokeiltaessa 1,7 megaa vapaata Chip-muistia riitt&auml;&auml; pelille mainiosti, vaikka RAD-k&auml;ynnistys on laitettu peliin vain jotta se saisi koko 2 megan Chipin k&auml;ytt&ouml;&ouml;ns&auml;. Kuten Chip-vaatimuksesta jo voikin arvata, peli toimii ainoastaan PAL/NTSC-n&auml;ytt&ouml;tilassa, eik&auml; ModePro tehoa siihen.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Asennus tapahtuu guide-ohjetiedoston mukaan k&auml;ynnist&auml;m&auml;ll&auml; rompulta ohjelma &quot;Install to HDD&quot;, mutta oikeasti sen nimi onkin &quot;full_install&quot;. Lis&auml;yll&auml;tyksen&auml; se ei teek&auml;&auml;n pelille omaa alihakemistoa kuten luvataan, vaan kopioi vain rompun sis&auml;ll&ouml;n sellaisenaan suoraan valittuun kohdehakemistoon. Pelin mukana toimitettavalla patch-levykkeell&auml; on kyll&auml; korjattu guide, mutta asennus on jo tehtyn&auml; siin&auml; vaiheessa kun patch-levykkeen sis&auml;lt&ouml;&auml; ollaan kopioimassa pelihakemistoon vanhojen tiedostojen p&auml;&auml;lle.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Peli vaatii takakannen mukaan v&auml;hint&auml;&auml;n 20 megaa kiintolevytilaa, mutta se lienee k&auml;yt&auml;nn&ouml;ss&auml; varattu tilannetallennuksia varten. Ilman tilannetallennuksia rompulta pelattaessa peli sijoittaa alle kilotavun verran tavaraa s-hakemistoon. T&auml;ysasennus puolestaan verottaa kiintolevy&auml; noin 150 megaa. Periaatteessa pelin voisi siis ehk&auml; saada toimimaan rompulta vaikka jopa kiintolevytt&ouml;m&auml;ll&auml; koneella, kunhan muistia on riitt&auml;v&auml;sti, k&auml;ynnistyskorpulla on CD-ajurit ja muutama kilo vapaata tilaa, eik&auml; pelitilannetta yritet&auml; tallentaa.</font></p>
						</td>
				</tr>
			</table>
				<br>
			</font><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Avaruudessa kukaan ei kuule voihkettasi</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vaikkei t&auml;m&auml;n 1998 valmistuneen eepoksen avulla odottanutkaan p&auml;&auml;sev&auml;ns&auml; vastaavan ajankohdan yleisen laatutason mukaiseen pelimaailmaan, ei liev&auml;lt&auml; pettymyksen tunteelta voi silti v&auml;ltty&auml;. Onneksi sit&auml; ei ole yritettyk&auml;&auml;n tuoda vaativille pelimarkkinoille t&auml;ysihintaisena tuotteena, vaan ostaja saa suurin piirtein shareware-laatua shareware-hinnalla.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Aluksensa ohjaamoon istahtavaa pilottia odottaa C64-tasoiselta n&auml;ytt&auml;v&auml; pinnoittamaton polygonigrafiikka muutamalla v&auml;rill&auml;. Piiloviivojen/polygonien poisto ei oikein aina toimi kunnolla, ja joissakin tilanteissa alusten l&auml;pikin voi lent&auml;&auml;. Aluksen laseraseiden s&auml;teet ovat vain punaiset, ruman sahalaitaiset viivat, joista j&auml;&auml; p&auml;tki&auml; hetkeksi n&auml;kyviin ruudulle aluksen k&auml;&auml;ntyess&auml;. Ilmeisesti piirtorutiinien suunnittelu on j&auml;&auml;nyt silt&auml;kin osin puolitiehen. Sekoilut saattoivat tietysti osittain johtua my&ouml;s koneeni &quot;liian modernista&quot; (hih) prosessorista.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Peli latailee lis&auml;&auml; dataa levylt&auml; pelaamisen aikanakin, joten asemasta ja ohjaimesta riippuen saattaa toiminnassa esiinty&auml; nykimisi&auml; tai jopa suoranaisia sekunnin tai parin pys&auml;htelyj&auml;, ja viel&auml;p&auml; melko yhten&auml;&auml;n. N&auml;in tapahtuu siit&auml;kin huolimatta, ett&auml; muistia oli k&auml;ytett&auml;viss&auml; 32 megaa, jonka luulisi riitt&auml;v&auml;n moiselle tekeleelle ilman v&auml;lilatailujen tarvetta. Pikavilkaisu pelimoottorin &quot;executeable&quot;-tiedostoon paljastaa Amosin palvelleen pelin kehitysymp&auml;rist&ouml;n&auml;. (Onkos jopa tuohon tiedostonimeenkin saatu mahtumaan kirjoitusvirhe, vai kuvittelenko vain? :-)</font></p>
							<div align="center">
								<p><img src="kuvat/starfighter.jpg" width="320" height="200" border="0"><br>
									<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><i>Suuria avaruusaluksia. Luulisin.</i></font></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Pelin 3D-rendatut v&auml;lianimaatiot ovat erillisin&auml; iff-kuvasarjoina omissa alihakemistoissaan. Kuvissa on 64 v&auml;ri&auml; (extra halfbrite -tila) tarkkuudella 320 x 224 pistett&auml;, joten niit&auml; on helppo katsella esim. Deluxe Paintilla. Sen avulla ne muuten on levyll&auml; olevaan muotoon tallennettukin, ainakin p&auml;&auml;tellen yhden kuvan mukaan eksyneest&auml; ikonitiedostosta, jossa kuvan oletusty&ouml;kaluna on DpaintIV. Animaatioiden v&auml;rien k&auml;ytt&ouml; ja 3D-objektien muotoilu voisivat olla parempiakin, mutta ik&auml;vin kokonaisuutta pilaava asia on, ett&auml; isojen alusten pinnoitteeksi on valittu suorastaan koomiset tekstuurit. Alukset n&auml;ytt&auml;v&auml;t l&auml;hinn&auml; ruskeilta pahvilaatikoilta, joihin on piirretty mustalla tussilla verkkomaisia pintakuvioita. A500:n ECS-grafiikka pystyisi kyll&auml; parempaankin, kuten joidenkin muiden pelien introanimaatiot todistavat.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&Auml;&auml;nimaailmaa koristamaan on valittu sin&auml;ns&auml; ihan siedett&auml;v&auml;t musiikit, mutta ne k&auml;ytt&auml;v&auml;t heikkolaatuisia sampleja, jotka ovat jotenkin ohuita, melkein kuin ne olisi &auml;&auml;nitetty puhelimen luurista. Sama linja jatkuu itse pelin &auml;&auml;nisampleissa, jotka eiv&auml;t oikein vakuuta, vaikka asiansa ajavatkin.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Peli&auml; ohjataan joystickilla tai nuolin&auml;pp&auml;imill&auml;, tosin alkuvalikoissa jostain ihmeen syyst&auml; vain joystickilla. Alussa vastaan tulevassa aluksen valinta- ja varusteluruudussa ei pahemmin ole toimintojen ohjeita n&auml;kyvill&auml;. Ensin valitaan alus ohjainta sivusuunnassa k&auml;&auml;ntelem&auml;ll&auml;, sitten ostetaan alukseen aseistusta ja tehoa, ja lopuksi yritet&auml;&auml;n naputella ep&auml;toivoisesti alasp&auml;in, jotta saataisiin sattumanvaraisesti ilmestyv&auml; &quot;fly&quot; -mahdollisuus tulemaan ruutuun ja p&auml;&auml;st&auml;isiin jatkamaan itse peliin. Seuraavaksi p&auml;&auml;st&auml;&auml;n huonosti piirrettyyn &quot;briefing&quot;-k&auml;skynjakoon, jota ei voi nopeuttaa tai keskeytt&auml;&auml;, vaan sama animaatio on katseltava joka kerta uudestaan l&auml;pi. Teht&auml;v&auml;n ohjeet my&ouml;s puhutaan, jos nyt &auml;&auml;nest&auml; sattuu saamaan selv&auml;n (ja osaa englantia). Lis&auml;puhetta peliin tuovat vihollisten insult-huhuilut radiolla.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Pelimoottori py&ouml;riskelee aivan liian nopeasti testikoneen 68060:lla. Oma alus saa jatkuvia osumia ja vihollinen p&ouml;rr&auml;&auml; ymp&auml;rill&auml; kuin ampiainen tutkassa, joten siihen on mahdoton t&auml;hd&auml;t&auml;, saati sitten osua edes vahingossa. Pelin testaaminen ja harjoittelu olivat mahdollisia vain huiputuksen (God-moodin) avulla. Isoihin aluksiin toki osuu helpommin, ne eiv&auml;t juuri liiku. Peli&auml; voi helpottaa lis&auml;&auml;m&auml;ll&auml; k&auml;ynnistysskriptiin rivin &quot;cpu nocache&quot;, mutta oikeastaan toimintanopeuden kalibrointi kuuluisi pelimoottorin teht&auml;viin eik&auml; k&auml;ytt&auml;j&auml;n huoleksi.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tutkasta puheenollen, se on pelkk&auml; ruudun laitaan grafiikan p&auml;&auml;lle sijoitettu ympyr&auml;n muotoinen alue, jossa oma alus ja vihollinen n&auml;kyv&auml;t pistein&auml;. Jep... Kaksiulotteinen tutka, kolmiulotteista avaruustaistelua varten! Olisivat nyt edes vaivautuneet tekem&auml;&auml;n Elite-tyylisen tutkan, jossa viistoasentoon piirretyll&auml; 2D-pinnalla pistein&auml; n&auml;kyvien alusten paikat yl&auml;/alasuunnassa esitet&auml;&auml;n k&auml;ytt&auml;m&auml;ll&auml; pystyviivoja, joiden pituus kertoo kohteiden poikkeaman kyseisest&auml; tasosta.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kokonaisuutena Starfighterin keskener&auml;inen toteutus laimentaa peli-iloa siin&auml; m&auml;&auml;rin, ettei sit&auml; taida tulla kovinkaan usein maaniteltua k&auml;ynnistym&auml;&auml;n. Ei sill&auml;, etteik&ouml; A500-tasoisille peleille voisi yh&auml; olla kysynt&auml;&auml; tai etteik&ouml; t&auml;st&auml; jonkin verran hupiakin voisi saada, sill&auml; ainakin periaatteessa pelin pit&auml;isi olla laaja ja sis&auml;lt&auml;&auml; paljon puuhastelua. Jos mielenkiinto olisi riitt&auml;nyt tarkempaan tutustumiseen pelin sis&auml;lt&ouml;&ouml;n, olisi juonesta ja lukuisista teht&auml;vist&auml; voinut ehk&auml; l&ouml;yty&auml; jonkin verran imua. Starfighterin tekemiseen on selv&auml;stikin k&auml;ytetty runsaasti aikaa ja vaivaa, joten harmittaa ettei ty&ouml;t&auml; jaksettu vied&auml; ihan loppuun asti. Tasokkaammalla loppuhionnalla kuorrutettuna peli olisi voinut olla melko hyv&auml;kin.</font></p>
						</td>
				</tr>
			</table>
				<br>
			</font><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tekij&auml;:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.users.space.net.au/~geosync/" target="_blank"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Geosync Media</font></a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Julkaisija:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Islona Entertainment Ltd. / <a href="http://www.epic-marketing.de/" target="_blank">Epic Marketing</a></font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Edustaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://www.ge.vip.fi" target="_blank">Gentle Eye Ky</a>, puh. (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a></font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">120 markkaa</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Pelityyppi:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">3D-avaruusr&auml;iskint&auml;</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kieli:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Englanti</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tiedostot:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Demo: <a href="http://ftp.space.net.au/~geosync/sf1f_m98.zip">1</a> <a href="http://ftp.space.net.au/~geosync/sf1f_n98.zip">2</a> <a href="http://ftp.space.net.au/~geosync/sf1f_o98.zip">3</a> <a href="http://ftp.space.net.au/~geosync/sf1f_p98.zip">4</a> <a href="http://ftp.space.net.au/~geosync/sf1f_q98.zip">5</a> <a href="http://ftp.space.net.au/~geosync/sf1f_r98.zip">6</a> <a href="http://ftp.space.net.au/~geosync/sf1f_s98.zip">7</a> <a href="http://ftp.space.net.au/~geosync/sf1f_t98.zip">8</a> <a href="http://ftp.space.net.au/~geosync/sf1f_u98.zip">9</a> <a href="http://ftp.space.net.au/~geosync/sf1f_v98.zip">10</a> (720 kt osissa)<br>
								<a href="http://www.space.net.au/~geosync/tainment/sfp10991.lha">Patch</a> (1 kt, bugikorjauksia)</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Vaatii:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amiga ECS tai AGA, OS 2.0, 2 Mt Chip, 4 Mt Fast, 20 Mt kiintolevytilaa, CD-ROM</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Testattu:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amiga 1200, 68060/50 MHz, 32 Mt, kiintolevy, CD-ROM</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Grafiikka:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">20%</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&Auml;&auml;net:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">50%</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Musiikki:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">50%</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Pelattavuus:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">50%</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Yleisarvosana:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">40%</font></td>
				</tr>
			</table>
			</font>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>