<HTML>
<HEAD>
<TITLE> </TITLE>
</HEAD>
<BODY BACKGROUND="blue.jpg">
<BR>
<CENTER>
<H1>Hey SAX!</H1>
</CENTER>
Da du ja in der letzten NoCover so um unsere Meinung gefleht hast, gebe
auch ich mal meinen Senf dazu - in der Hoffnung das es au&szlig;er uns beiden
evtl. noch jemand interessiert! ;-) Allerdings hoffe ich mal, da&szlig; dein Wunsch nicht ganz erf&uuml;llt wird (auch wenn
es mich auch interessiert) - wenn wirklich alle dazu schreiben, dann ist in
der n&auml;chsten NC kein Platz mehr f&uuml;r andere Texte...<P>

Um es schon mal voraus zu sagen: Meine Meinung ist eindeutig PRO HTML!!
Daf&uuml;r sprechen meiner Meinung nach die folgenden Punkte:<P>
<HR>
<UL>
<LI>Mir ist es nie gelungen, die alte Version auf einem CyberGFX-Screen
darzustellen. Klar, ich kann auch einfache AGA-Screens benutzen, aber
bei den sagenhaften 50 Hz (!) des Highres-Modus vergeht mir immer schnell
der Spa&szlig; am Lesen!

<LI>Die HTML-NC sieht eindeutig besser aus! Zumindest, wenn man einen
entsprechenden Amiga zum anzeigen verwendet... Da IBrowse bei mir in
hochaufl&ouml;senden 24 Bit l&auml;uft, ist der Unterschied zu vorher wirklich extrem.
Und bevor sich jetzt die ECS-User beschweren: Die sollten immer noch
die selbe Qualit&auml;t wie vorher haben, oder?

<LI>Ich habe mir eigentlich nie angeschaut, wie man eigentlich einen
MP-Artikel layoutet - f&uuml;r was anderes als die NC-Texte h&auml;tte ich den doch
nie gebraucht! HTML ist sehr einfach zu lernen und man kann es vermutlich
h&auml;ufiger einsetzen (eigene Website, Hypertext-Dokumente etc.).

<LI>Hab ich da was falsch verstanden oder meinst du, man kann mit MP
mehr layouten als mit HTML? Falls das der Fall ist mu&szlig; ich hier aber
deutlich wiedersprechen - einigen Texten sieht man zwar an, da&szlig; der Autor
noch wenig Erfahrung mit HTML hat, aber das wird sich garantiert &auml;ndern.
&Uuml;brigens, nat&uuml;rlich kann man in HTML auch <FONT COLOR=#FF0000>b</FONT><FONT COLOR=#FFFF00>u</FONT><FONT COLOR=#00FF00>n</FONT><FONT COLOR=#00FFFF>t</FONT><FONT COLOR=#0000FF>e</FONT><FONT COLOR=#FFFFFF>n</FONT>
Text schreiben! ;-)

<LI>Ich wei&szlig; da&szlig; es sich jetzt nicht besonderes tolerant klingt, aber
ich denke nicht da&szlig; es besonders sinnvoll ist, die handvoll Original-500er
noch zu unterst&uuml;tzen. Stimmt, der A500 war mal ein tolles Ger&auml;t - mit der
Betonung auf war! Hey Leutz, wir haben jetzt 1998 - meint ihr nicht,
da&szlig; es langsam Zeit ist, einen etwas "zeitgem&auml;&szlig;eren" Rechner zu benutzen?
Ich konnte mich ja auch nicht von meinem alten Amiga 500 trennen, aber um
auch mal anspruchsvollere Software benutzen zu k&ouml;nnen verwende ich eben
sonst einen aufger&uuml;steten 1200er (<A HREF="http://privat.schlund.de/bali/amiga/amiga.htm">wen's interessiert - nachschauen ;-)</A>). Aber bevor ich
ganz vom Thema abkomme... ;-)

<LI>Vielleicht (vermutlich, sonst h&ouml;rt es sich noch arrogant an ;-) hast du
Recht und es gibt Leute im Club, die nicht die Erfahrung haben, einen
Browser zu installieren und konfigurieren. Allerdings ist das hier ein
Computerclub, d.h. es sollte doch eigentlich selbstverst&auml;ndlich sein,
da&szlig; diese Leute von erfahreren User eben Hilfe bekommen... Oder bist du da
anderer Auffassung?
</UL>
<HR><BR>
Du hast schon Recht wenn du sagst da&szlig; eigentlich alle da mit entscheiden
h&auml;tten sollen, aber es h&auml;tte garantiert eine Ewigkeit gedauert, darauf zu
warten, da&szlig; sich alle dazu &auml;u&szlig;ern... Vielleicht ist die "kurz und schmerzlos"-Methode
dann doch besser.<P>

Ich hoffe du f&uuml;hlst dich nicht angegriffen, wenn ich nicht ganz deiner
Meinung bin, aber fang jetzt bloss nicht an mit "der Bali hat was gegen
die A500-User" oder so - du wolltest unsere Meinung! ;-)<P>

Ach ja, wegen dem Browser: Der Andreas hat recht, AWeb 1.1 ist wirklich
uralt! Au&szlig;erdem habe ich die Erfahrung gemacht, das IBrowse die meisten
Seiten besser anzeigt. Hat vielleicht aber auch damit zu tun, da&szlig; ich
nur kurz die AWeb-Demo (die neue :) installiert habe und nicht viel an der
Konfiguration ge&auml;ndert...
<P>
cU, Bali =&szlig;-)<BR>
(Georg Breitsprecher)

<CENTER>
<TABLE BORDER=0>
<TR>
<TD BGCOLOR=#AAAAAA>EMail:</TD>
<TD BGCOLOR=#DDDDDD><A HREF="mailto:bali@gmx.net">bali@gmx.net</A></TD>
<TR>
<TD BGCOLOR=#AAAAAA>URL:</TD>
<TD BGCOLOR=#DDDDDD><A HREF="http://privat.schlund.de/bali">http://privat.schlund.de/bali</A></TD>
</TABLE>
<BR>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
