<HTML>
<HEAD>
<TITLE>APC & TCP</TITLE>
</HEAD>
<BODY TEXT=black link=blue alink=red bgcolor=white>
<CENTER>
</CENTER>

<P><H1><FONT COLOR ="#FF0000">Damals - vor 13 Jahren</FONT></H1><P>

<IMG SRC="hpycom585.jpg" WIDTH=240 HEIGHT=326 ALIGN=left HSPACE=15 VSPACE=15>
Diesen Monat stelle ich die Happy Computer Ausgabe 5 aus dem
Jahre 1985 vor. Sie umfa&#223;te 168 Seiten, wovon nur 32 Seiten
aus Werbung bestanden - heutzutage kaum vorstellbar, wo die
aktuelle Ausgabe der Amiga Plus doch schon fast 40 Seiten
Werbung bei nur 100 Seiten Umfang hat!<P>

Diesen Monat habe ich das Titelbild auch etwas gr&ouml;&szlig;er gescannt als
beim letzen mal. Diesmal sollte man auch etwas erkennen k&ouml;nnen...<P>

<HR><BR>

<FONT COLOR ="#FF0000" SIZE=+1>Happy Computer von Mai 1985</FONT><P>

Auf Seite 17 kommt (nach den &quot;News&quot;) der erste interessante Artikel:
ein Interview mit David Crane, seines Zeichens Mitbegr&#252;nder
von Activision und Programmierer von z.B. &quot;Pitfall 1+2&quot;, &quot;Decathlon&quot;
und &quot;Ghostbusters&quot;. Letzteres stand zu der Zeit des Interviews an
der Spitze aller wichtigen Charts. Weltweit wurden zirka sechs Millionen
Spiele von David Crane verkauft. Man sollte dazusagen, da&#223; damals (heute
wohl nur noch bei <FONT COLOR ="#0000FF">Amiga</FONT>-Projekten) fast alle Spiele Ein-Mann-Projekte
waren.<P>

<FONT COLOR ="#FF0000" SIZE=+1>Ein paar Fragen und Antworten aus dem Interview:</FONT><P>

<FONT COLOR ="#008000">HC (Happy Computer): Glaubst Du, da&#223; Computerspiele in Zukunft an Bedeutung
verlieren werden?</FONT><P>

DC (David Crane): Nein, drei Viertel der Leute benutzen den Computer, um
sich zu unterhalten. Der Rest nutzt ihn zweitrangig zur Unterhaltung. Ich
mache mir keine Sorgen um die Zukunft der Unterhaltungs-Software.<P>

(Anmerkung: womit er ja (zumindest im PC/PSX-Bereich eindeutig recht
behalten sollte!)<P>

<FONT COLOR ="#008000">HC: Welchen Computer hast Du zu Hause stehen?</FONT><P>

DC: Einen <FONT COLOR ="#0000FF">Commodore 64</FONT>. Die Grafik ist mindestens so gut wie bei anderen
Computern und der Sound ist am besten.<P>

(Anmerkung: bis der <FONT COLOR ="#0000FF">Amiga</FONT> erschien...)<P>

<FONT COLOR ="#008000">HC: Ist der <FONT COLOR ="#0000FF">C64</FONT> Dein Lieblings-Computer?</FONT><P>

DC: Ja, ... Es ist der einzige Computer, den ich zu Hause habe.<P>

<FONT COLOR ="#008000">HC: Mittlerweile werden die ersten Spiele ver&#246;ffentlicht, die 128kb
Arbeitsspeicher brauchen. Wird Activision sich diesem Trend anschlie&#223;en?</FONT><P>

DC: Bevor wir ein Spiel machen, das einige nicht haben k&#246;nnen, weil ihr
Computer nicht genug Speicher hat, trennen wir es in Teile und lassen
es nachladen.<P>

<FONT COLOR ="#008000">HC: Die Diskette l&#228;uft der Kassette also den Rang ab?</FONT><P>

DC: In den USA hat so gut wie niemand Kassetten. Wir sind sehr ungeduldige
Leute. Bei uns benutzen 19 von 20 <FONT COLOR ="#0000FF">C64</FONT>-Besitzern ein Diskettenlaufwerk.<P>

<FONT COLOR ="#008000">HC: Du hattes einige gro&#223;e Erfolge in den letzen Jahren wie &quot;Decathlon&quot;,
&quot;Pitfall&quot; und nat&#252;rlich &quot;Ghostbusters&quot;. Wie lange arbeitest Du eigentlich
an einem kompletten Spiel?</FONT><P>

DC: In der Vergangenheit habe ich zehn bis zw&#246;lf Monate an einem Spiel
gearbeitet. Manchmal habe ich eines der kleineren Projekte auch in sechs Monaten
geschafft. Die Projekte sind jetzt gr&#246;&#223;er als sie einmal waren und werden deshalb
zeitaufwendiger.<P>

<HR><BR>

Im Test in dieser Ausgabe ist der <FONT COLOR ="#0000FF">Commodore 128</FONT>, der als <FONT COLOR ="#0000FF">C64</FONT>-Nachfolger
allerdings kaum Erfolge feiern konnte. Die Ausstattung des Computers war
wie folgt:<P>

 <UL>

<LI>eine 8502 CPU, welche wohl ein Nachfolger des 6502 des <FONT COLOR ="#0000FF">C64</FONT> sein m&#252;&#223;te und mit wahlweise
1 MHz oder 2 MHz getaktet wurde<P>

<LI>eine Z80 CPU, die mit satten 4 MHz getaktet und f&#252;r die <FONT COLOR ="#0000FF">CP/M</FONT>-Emulation
ben&#246;tigt wurde<P>

<LI>ein 64 kb &quot;gro&#223;es&quot; ROM<P>

<LI>128 kb RAM, die bis auf 512 kb (!) aufr&#252;stbar waren<P>

<LI>16 Farben<P>

<LI>eine Aufl&#246;sung von bis zu 640 X 200 Pixeln<P>

<LI>Preis etwa 1.500,- DM<P>

</UL>

Das Diskettenlaufwerk (1571) konnte im <FONT COLOR ="#0000FF">64er</FONT>-Modus 170kb speichern, im <FONT COLOR ="#0000FF">128er</FONT>-Modus
340kb und im <FONT COLOR ="#0000FF">CP/M</FONT>-Modus sogar 450kb. Das schaffte es durch doppelte Dichte und
Aufzeichnung auf beiden Diskettenseiten.<P>


Die Neuheiten gegen&#252;ber dem <FONT COLOR ="#0000FF">C64</FONT> waren:<P>

<UL>

<LI>128 (statt 64) kb RAM<P>

<LI>eine bessere Diskettenstation<P>

<LI>ein ausgereifteres und viel leistungsst&#228;rkeres Basic V7.0 (<FONT COLOR ="#0000FF">C64</FONT> hatte V2.0)<P>

<LI>eine bessere Tastatur abgesetztem 10er-Tastenfeld<P>

<LI>mehr Tasten: Alt, NoScroll, Help, Linefeed, 40/80<P>

<LI>CP/M-Unterst&#252;tzung (beim <FONT COLOR ="#0000FF">C64</FONT> nur durch ein Modul m&#246;glich, soviel ich wei&#223;)<P>

<LI>Anzeige von 80 Zeichen pro Zeile (<FONT COLOR ="#0000FF">C64</FONT> nur 40)<P>

<LI>Resettaster<P>

<LI>eingebauter Maschinensprache-Monitor (bzw. Dis/Assembler)<P>

<LI>zwei Videochips<P>

</UL>

Schnelles Fazit: &quot;Kompatibel zum <FONT COLOR ="#0000FF">64er</FONT> und f&#228;hig unter <FONT COLOR ="#0000FF">CP/M</FONT> zu arbeiten -
damit er&#246;ffnet Commodore seinem neuesten Produkt zwei Welten von Software.
Der <FONT COLOR ="#0000FF">PC 128</FONT> geh&#246;rt zu einer neuen Klasse, die zwischen den reinen Heimcomputern
und den Personal Computern angesiedelt ist. Die Software, die es f&#252;r den <FONT COLOR ="#0000FF">64er</FONT>
gibt und die, die unter <FONT COLOR ="#0000FF">CP/M</FONT> l&#228;uft, machen den <FONT COLOR ="#0000FF">PC 128</FONT> zu einem Computer,
dem eine gro&#223;e Zukunft bevorsteht.&quot;<P>

(Anmerkung: dem war ja nicht so, leider. Denn, f&#252;r damalige Zeiten war dieser
Computer zwar keine Sensation, aber dennoch nicht zu verachten. Im Gegensatz zum
<FONT COLOR ="#0000FF">C16, C116, C264</FONT> und wie sie alle hie&#223;en, war der <FONT COLOR ="#0000FF">C128</FONT> durchaus ein leistungsf&#228;higes
Ger&#228;t. Ich pers&#246;nlich kenne ihn nur von Freunden, wei&#223; also nicht, woran er denn
nun wirklich gescheitert ist. Vielleicht war es der Preis von 1500,- DM. Oder die kurz
bevorstehenden Premieren des <FONT COLOR ="#0000FF">Atari ST</FONT> und des <FONT COLOR ="#0000FF">Amiga</FONT>. Vielleicht war es aber
schlicht und ergreifend SCHLECHTES MARKETING seitens Commodore! Ich denke, das wird
es gewesen sein...)<P>

<HR><BR>

<FONT COLOR ="#FF0000" SIZE=+1>Spiele</FONT><P>

Die Spiele-Rubrik in dieser Ausgabe war insgesamt 8 Seiten lang. Hier wurden
einige Klassiker (Spiele, die HEUTE Klassiker sind) getestet:<P>

<FONT COLOR ="#008000">Pitstop II</FONT> - &quot;Bei Grafik und Spielwitz stellt Pitstop II alles in den Schatten, was an
Autorennen-Simulationen f&#252;r Heimcomputer derzeit auf dem Markt ist. Gegen die von uns
getestete <FONT COLOR ="#0000FF">C64</FONT>-Version wirkt selbst &quot;Pole Position&quot; wie ein m&#252;der Kolbenfresser.&quot;<P>

(Anmerkung: und tats&#228;chlich ist Pitstop II eines meiner Lieblingsspiele auf dem
<FONT COLOR ="#0000FF">C64</FONT> gewesen und auch heute spiele ich es noch gerne, auch wenn - oder gerade weil -
es f&#252;r die <FONT COLOR ="#0000FF">Playstation</FONT> mit Gran Turismo, Rage Racer, Porsche Challenge, Formel 1 '97
und TOCA Touring Car zum Beispiel sehr realistische Autorennen gibt, die ein viel
authentischeres Fahrgef&#252;hl aufweisen k&#246;nnen als die damaligen &quot;Spitzentitel&quot;.)<P>

<FONT COLOR ="#008000">H.E.R.O.</FONT> - &quot;Bei der von uns getesteten <FONT COLOR ="#0000FF">MSX</FONT>-Version &#252;berzeugen die farbenfrohe Grafik
und das hohe Tempo. Dank der zahlreichen Spielstufen wird das Programm auch nicht so
schnell langweilig. Ein flottes Spiel, das sein Geld (79,- DM auf Diskette) wert ist.&quot;<P>

(Anmerkung: HERO ist schon eine Herausforderung... Der &quot;Held&quot; mu&#223; mit seinem Rucksack-
Hubschrauber durch enge Schluchten fliegen, mit einem kleinen Laser-Strahler Spinnen,
Flederm&#228;use und dergleichen verjagen, mit Dynamit W&#228;nde wegsprengen, Lichtschalter
bet&#228;tigen usw. Ich pers&#246;nlich fand es eigentlich zu schwer - ich stand eigentlich
sowieso mehr auf Fu&#223;ball- und Autorenn-Spiele - und auch heute spiele ich auf der
<FONT COLOR ="#0000FF">Playstation</FONT> am liebsten FIFA 98.)<P>

<HR><BR>

<FONT COLOR ="#FF0000" SIZE=+1>Beispiel-Preisliste:</FONT><P>

<TABLE BORDER=10  BORDERCOLORDARK=black BORDERCOLORLIGHT=grey ALIGN=CENTER HEIGHT="100%"
<TR ALIGN=CENTER><TD ALIGN=CENTER Colspan=2 >Preisliste Mai 1985</TH></TR>
<TR><TH ALIGN=LEFT>5,24&quot; Disketten 2seitig, doppelte Dichte </TH><TH ALIGN=RIGHT>59,- DM </TH></TR>
<TR><TH ALIGN=LEFT>Akkustik-Koppler dataphon s21d 300baud </TH><TH ALIGN=RIGHT>289,- DM </TH></TR>
<TR><TH ALIGN=LEFT>Commodore MPS 801 Drucker </TH><TH ALIGN=RIGHT>499,- DM </TH></TR>
<TR><TH ALIGN=LEFT>Commodore MPS 802 Drucker </TH><TH ALIGN=RIGHT>799,- DM </TH></TR>
<TR><TH ALIGN=LEFT>Commodore SX64 </TH><TH ALIGN=RIGHT>1890,- DM </TH></TR>
<TR><TH ALIGN=LEFT>Sanyo PC 8088 CPU mit MS-DOS </TH><TH ALIGN=RIGHT>2999,- DM </TH></TR>
</TABLE>
<P>


<HR><BR>

So, dies war nun die zweite Ausgabe meines R&#252;ckblickes in die gute alte Zeit
der Heimcomputer. Ich hoffe, es hat Euch auch dieses Mal gefallen. Bis zur
n&#228;chsten Ausgabe.<P>

Ciao,<P>

 <HR><BR>
 <a href="mitglieder/etzrodt.html">Andreas Etzrodt </a> <BR>
 <a href="mailto:shark@nwn.de">  E-Mail: shark@nwn.de</a><P>


</P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>

