<HTML>
<HEAD>
<TITLE>Roadrunners Story-Gamestunde Teil 2</TITLE>
</HEAD>
<BODY background="l_bg.gif" TEXT=black link=blue alink=red bgcolor="#dddddd">
<a href="#mehr">Was noch auﬂer diesem Text in dieser NoCover von mir steht</a>
<HR>
<BR>
Tja, nun habe ich mich doch noch entschliessen k&ouml;nnen, einen weiteren Teil zum Storygame beizutragen :).<BR>
Dieser Teil wird auch den letzten Teil von <a href="mitglieder/kruse.html" target="mainFrame">dR.</a> fortf&uuml;hren, welcher
in der NoCover51 unter dem Titel &quot;<B><U>Black Hole</B></U>&quot; erschienen ist :).<BR>
<BR>
Dieser Teil tr&auml;gt den Titel:<BR>
<H1 align=center><U>Wissen schafft Macht, aber was schafft Macht?</U></H1><BR>
<HR>
<BR>
<Q>Wie wir wissen wurde unsere Manschafft ja im letzten Teil in ein schwarzes Loch gesogen. Nachdem ja schon der Sender
es geschafft hat mit unglaublicher Pr&auml;zission genau im spannensten Moment die Werbung einzuschieben,
wodurch jedes noch so kleine bisschen Spannung in grenzenlose Langweile zu verwandeln, welche sich jetzt mit unglaublicher
geschwindigkeit ausbreitet ist es jetzt Zeit zu unserem neuen Heldenteam umzublenden, welches es sich zum Ziel gesetzt
hat den fanatischen B&ouml;sewicht, Bill G&auml;hnts aufzuhalten, der durch Megalangweilige Computerspiele,
welche sich hinter Pseudorealistischen 3D-Grafiken verstecken, die Welt in einen 200 Jahres-Schlaf zu versenken, in der
er in ruhe s&auml;mtliche Sch&auml;tze der Erde einsammeln kann.</Q><BR>
<BR>
<HR>
<BR>
<I>(Ein ca. 1meter 30 kleines m&auml;nnchen in einem total geschmacklosem Fummel, welches entfernt an ein lila Sofa mit schwarzen Punkten und lila Streifen erinnert, taucht Pl&ouml;tzlich auf der Bildfl&auml;che auf.)</I>
<H3>
Zitroman: Tataaaaaaa<BR>
<BR>
Passanten: Huch<BR>
<BR>
Zitroman: Ja, da staunt ihr, was? Ich bin der Held der dein Geld h&auml;lt! Ich bin die Motte die deinen besten Mantel genau dann
zerknabbert, wenn du ein Date mit Claudia Schiffer hast! Ich bin <B><U>ZITROMAN</B></U>!!!!!<BR>
<BR>
Passanten: <small>(sich abwendend und so leise, das es kaum jemand mitkriegt.)</small>Schon wieder so ein Spinner der sich f&uuml;r nen Helden h&auml;lt. Wahrscheinlich heisst es deswegen auch Held. Weil sich jeder Held f&uuml;r nen Held h&auml;lt...<BR>
<BR>
Zitroman: Achja, und beinahe h&auml;tte ich es vergessen: Dies sind meine Helfer, Roadrunner, der verr&uuml;ckte Vogel und
Snoopy, der hechelnde Hund.<BR>
<BR>
Passanten: Sachmal, ists jezz lamsam mal jut?<BR>
<BR>
Zitroman: <small>(in die Kamera gewandt)</small> Ich hasse sowas, heutzutage halten die Leute jeden Helden f&uuml;r nen
Spinner. Dabei w&auml;re die Menschheit ohne uns Helden schon mindestens 333 mal vernichtet worden.<BR>
<BR>
Zitroman: Ist ja schon Gut, ich geh ja schon.<BR>
<BR></H3>
<I>So begeben sich unsere Helden in ihr Heldenb&uuml;ro, in der Heldenstrasse 4, in, na? Nein, falsch. Heldenstadt w&auml;re
doch wirklich zu Platt gewesen. Metropolis meinte ich eigentlich. ;-)</I><BR>
<HR>
<Q>Was sie da erleben? Ich weiss es nicht, da just zu diesem Zeitpunkt mir mein Hund mein Drehbuch zerfleddert hat, und ich so
auf Eure Hilfe angewiesen bin. Also los, ich bin mal gespannt wie es weitergeht. :)</Q><BR
<BR>
<a href="mitglieder/kalus.html" target="mainFrame"><S><CENTER><I>Sven, the unbelivable Roadrunner, Kalus</I></CENTER></S></a>
<HR>
<a name="mehr">Weitere Texte in dieser NoCover von mir:</a><BR>
<CENTER><a href="st_gedicht.html">Ein kleines Gedichtchen, welches ich profan "Die Liebe" genannt habe :)</a></Center><BR>
<CENTER><a href="st_mpvshtml.html">Meine Meinung zum Thema MP vs. HTML</a></CENTER>
<CENTER><a href="disku_hass.html">Diskussionsbeitrag zum Thema Hass</a></CENTER>
<CENTER><a href="st_storygame.html">Ein &uuml;beraus geistreicher Beitrag zum Storygame :)</a></CENTER>
<CENTER><a href="st_storygame2.html">Ein dritter, nicht komisch gemeinter, Beitrag zum Storygame</a></CENTER>
<CENTER><a href="help_html.html">Bist Du Meister in HTML? Dann ist dies hier ein klacks f&uuml; Dich :)</a></CENTER>
<CENTER><a href="tips_dopus5.html">Eine kleine Anleitung um in Dopus5 HTML-Seiten per doppelklick in den Browser zu holen.</a></CENTER>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</BODY>
</HTML>
