<HTML>
<HEAD>
<TITLE>Roadrunners Story-Gamestunde Teil 3</TITLE>
</HEAD>
<BODY background="l_bg.gif" TEXT=black link=blue alink=red bgcolor="#dddddd">
<a href="#mehr">Was noch auﬂer diesem Text in dieser NoCover von mir steht</a>
<HR>
<BR>
Und noch einen weiteren Teil f&uuml;r das Storygame habe ich bereit, welcher einen eigenen Start bildet, also ohne Vorbelastung ins rennen geht. :)<BR>
Zur abwechslung werde ich mal versuchen etwas ernster zu bleiben, auch wenn ich mich wieder an die SciFi machen werde,
weil dies einfach mein Lieblingsthema ist. :)<BR>
Ich habe vor genau da zu starten, wo vor nunmer etwas mehr als 35 Jahren auch meine absolute Lieblingsserie Perry Rhodan
gestartet ist. N&auml;mlich bei der ersten bemannten Mondlandung. Dennoch werde ich mir bei den Namen der Akteure einige kleinere
Anspielungen nicht verkneifen k&ouml;nnen, was wahrscheinlich denen, die sich etwas mit Sci-Fi (nicht nur aus dem Fernsehen) auskennen am ehesten auffallen wird. :)<BR>
Der Titel lautet: <B>Operation Future</B><BR>
<BR>
Viel Spass bei der nun folgenden Story w&uuml;nscht Euch,<BR>
<a href="mitglieder/kalus.html" target="mainFrame"><Center>Sven Kalus</Center></a><BR>
<BR>
<HR width=80% size=3 color=red>
<BR>
<TABLE BORDER=2 bgcolor=silver bordercolor=teal>
<TR>
<TH COLSPAN=2><FONT color=red>Die Manschafft der Rakete:</font>
</TR>
<TR>
<TD bgcolor=aqua><FONT color=fuchsia>Clark Ernsting</font></TD>
<TD bgcolor=purple><FONT color=yellow>Der Missioncommander und Hauptakeur</font></TD>
</TR>
<TR>
<TD bgcolor=aqua><FONT color=fuchsia>Reginald B. Guck</font></TD>
<TD bgcolor=purple><FONT color=yellow>1. Offizier und Pilot</font></TD>
</TR>
<TR>
<TD bgcolor=aqua><FONT color=fuchsia>Lt. Com. Geoffry Darlton</font></TD>
<TD bgcolor=purple><FONT color=yellow>Der Navigator</font></TD>
</TR>
<TR>
<TD bgcolor=aqua><FONT color=fuchsia>Lt. Paul Jones</font></TD>
<TD bgcolor=purple><FONT color=yellow>Der Funker</font></TD>
</TR>
<TR>
<TD bgcolor=aqua><FONT color=fuchsia>Dr. Zefram D. Kahn</font></TD>
<TD bgcolor=purple><FONT color=yellow>Der Doktor</font></TD>
</TR>
</TABLE>
<BR>
<HR size=4 width=70% color=silver>
<BR>
<font color=tomato>Clark Ernsting konnte es immer noch nicht fassen. Sie waren tats&auml;chlich auf dem Weg zum Mond. Fast w&auml;re das Unternehmen noch im letzten Moment gescheitert, als sich kurz vor dem Start ergab, das eine der Treibstoffleitungen nicht richtig befestigt war. Gottseidank konnte der Fehler, dank der &uuml;beraus f&auml;higen Ingenieure des Kennedy Space Ports schnell behoben werden, aber trotzdem blieb noch ein kleines bisschen Unruhe in Ihm. Was sollte schliesslich passieren, wenn sich diese Leitung, oder auch eine andere, wieder l&ouml;sen sollte? Sicher, bis zu einem gewissen Zeitpunkt, k&ouml;nnte man auch mit den &uuml;brigen Triebwerken sicher zur&uuml;ckkehren, aber wenn man erstmal einen grossteil des weges zur&uuml;ckgelegt hat, ist diese R&uuml;ckkehr nicht mehr m&ouml;glich, da aus Bautechnischen Gr&uuml;nden jede D&uuml;se einen eigenen Tank hatte.
Die bessere M&ouml;glichkeit, n&auml;mlich einen gemeinsamen Tank f&uuml;r alle sieben Triebwerke, war in der k&uuml;rze der Zeit nicht zu schaffen gewesen, da die amerikanische Regierung, und auch er selber, den Russen zuvorkommen wollte. Und da musste man halt Kompromisse schliessen. Und vor 4 einhalb Tagen war es dann so weit. Der Start hatte endlich stattgefunden. Und in ein paar Stundenw&uuml;rden sie auf dem Mond landen. Clark schaute noch einmal in sein Weltraumerprobtes Team. Sein 1. Offizier, und Stellvertreter, Commander Reginald B. Guck sass wie schon die ganze Zeit im Pilotensitz und &uuml;berpr&uuml;fte mal wieder seine Instrumente, was eigentlich eine sinnlose Aufgabe war, da diese auf extremste Bedingungen konstruiert wurden, und wenn sie kaputtgehen w&uuml;rden sowieso nur nach der Landung ersetzt werden k&ouml;nten, weil sich die Erstatzinstrumente im Lagerraum befanden, welcher nicht aus dem Wohnraum zug&auml;nglich ist. Eigentlich sollte sich zwar eine Kiste mit den wichtigsten Instrumenten und Werkzeugen in einem Schrank in der Kabine befinden, diese befand sich aber seltsamerweise nicht dort. Warum das bei den zahlreichen Kontrollen nicht aufgefallen war, ist eigentlich unverst&auml;ndlich, aber nicht zu &auml;ndern. Sein Navigator, Lt. Com. Geoffry Darlton sowie der Funker Lt. Paul Jones hatten zur Zeit noch Dienstfrei, und waren noch am schlafen. Der Bordarzt Dr. Zefram D. Kahn befand sich in seiner kleinen Krankenstation und bereitete sie auf die Landung vor. Der Captain schaute noch mal auf die Uhr, und als er feststellte, das sie noch ca 4,5 Stunden Zeit hatten, &uuml;bergab er Commander Guck das Kommando. Er selbst lehnte sich in seinen Sitz zur&uuml;ck und d&ouml;ste noch ein bisschen. Als es nur noch zwei Stunden bis zur Landung waren kamen der rest der Crew ins Cockpit und setzten sich auf ihre Pl&auml;tze. die letzten Checks sowie Landevorbereitungen hatten begonnen, und alles musste jetzt perfekt laufen, wenn sie heil landen wollten. Der Countdown lief, und als er bei 10 Minuten vor Landung angekommen war, riss sie pl&ouml;tzlich eine unbekannte Kraft aus der Bahn. &quot;Captain, haben sie in die Steuerung eingegriffen&quot;, fragte Commander Guck. Der Captain Zerbiss einen Fluch zwischen den Z&auml;hnen, und wollte gerade Antworten, als in der Zentrale eine fremde Stimme ert&ouml;nte...<BR>
</font><BR>
<HR  size=3 width=80% color=red>
<BR>
Tja, und nun seid Ihr dran. Ich h&auml;nge n&auml;mlich an genau dieser Stelle, und weiss im Mom nicht weiter. Aber ich weiss, dass bestimmt einer von Euch weiter weiss. :)<BR>
Also keine falsche Scham, schlechter als mein Geschreibsel kanns nicht werden. :)<BR>
<BR>
Und: Beschwerden bitte an: Mr. Roadrunner, Grand Cannion 1, Cartoonland. :)<BR>
<BR>
<a href="mitglieder/kalus.html" target="mainFrame"><S><CENTER><I>Sven, the unbelivable Roadrunner, Kalus</I></CENTER></S></a>
<HR>
<a name="mehr">Weitere Texte in dieser NoCover von mir:</a><BR>
<CENTER><a href="st_gedicht.html">Ein kleines Gedichtchen, welches ich profan "Die Liebe" genannt habe :)</a></Center><BR>
<CENTER><a href="disku_hass.html">Diskussionsbeitrag zum Thema Hass</a></CENTER>
<CENTER><a href="st_mpvshtml.html">Meine Meinung zum Thema MP vs. HTML</a></CENTER>
<CENTER><a href="st_storygame.html">Ein &uuml;beraus geistreicher Beitrag zum Storygame :)</a></CENTER>
<CENTER><a href="st_storygame1.html">Ein weiterer &uuml;beraus geistreicher Beitrag zum Storygame :)</a></CENTER>
<CENTER><a href="help_html.html">Bist Du Meister in HTML? Dann ist dies hier ein klacks f&uuml; Dich :)</a></CENTER>
<CENTER><a href="tips_dopus5.html">Eine kleine Anleitung um in Dopus5 HTML-Seiten per doppelklick in den Browser zu holen.</a></CENTER>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</BODY>
</HTML>
