<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<HTML>
<HEAD>
  <META HTTP-EQUIV="Content-Language"     CONTENT="de">
  <META HTTP-EQUIV="Content-Type"         CONTENT="text/html;CHARSET=iso-8859-1">
  <META HTTP-EQUIV="Expires"              CONTENT="86400">
  <META HTTP-EQUIV="Refresh"              CONTENT="86400">
  <META HTTP-EQUIV="Pragma"               CONTENT="no-cache">
  <META NAME="Author"                     CONTENT="Carsten Marmulla, HousePool.com/HousePool Media GbR">
  <META NAME="Date"                       CONTENT="1998-09-30">
  <META NAME="Reply-To"                   CONTENT="redaktion@HousePool.com">
  <META NAME="Revisit-After"              CONTENT="14 days">
  <META NAME="Robots"                     CONTENT="index">
  <META NAME="Robots"                     CONTENT="follow">
  <TITLE>HousePool.com - Magazine #21 (Oktober/November 1998) - Test: HyperEngine/Hyperprism</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#000066" ALINK="#0000FF" VLINK="#000033">
  <CENTER>
  <P ALIGN="CENTER">
  <TABLE ALIGN="CENTER" BGCOLOR="#FFFFFF" BORDER="0" CELLPADDING="2" CELLSPACING="0">
    <TR ALIGN="CENTER">
      <TD ROWSPAN="1" VALIGN="MIDDLE">
	<IMG ALT="HP LOGO oder CUBE-AD" BORDER="0" SRC="gfx/hplogo03.gif" HEIGHT="80" WIDTH="80"></A>
      </TD>
      <TD VALIGN="TOP">
	<FONT COLOR="#000000" SIZE="2"><BR><A HREF="http://HousePool.com/cgi-bin/ads_nonssi.pl?advert=NonSSI&page=00">Besuchen Sie unseren Sponsor - Visit our sponsor:</A><BR></FONT>
        <A HREF="http://HousePool.com/cgi-bin/ads_nonssi.pl?advert=NonSSI&page=00"><IMG ALT="Sponsor" BORDER="0" SRC="http://HousePool.com/cgi-bin/ads_nonssi.pl?page=00"></A>       
      </TD>
      <TD ROWSPAN="1" VALIGN="MIDDLE">
	<IMG ALT="HP LOGO oder CUBE-AD" BORDER="0" SRC="gfx/hplogo03.gif" HEIGHT="80" WIDTH="80"></A>
      </TD>
    </TR>
  </TABLE>
  </P>




<BR>
<!-- HousePool Titel -->
<B><FONT SIZE="7">H</FONT><FONT SIZE="5">OUSE</FONT><FONT SIZE="7">P</FONT><FONT SIZE="5">OOL</FONT></B>&nbsp;&nbsp;<FONT SIZE="4"><I>Magazine</I></FONT><BR>
<!-- Beginn -->
<FONT ALIGN="CENTER" COLOR="#000000" SIZE="3">Ausgabe 21 (Oktober/November 1998)</FONT><BR>
<BR>
<CENTER>
<FONT ALIGN="CENTER" COLOR="#000066" SIZE="5">Arboretum Systems HyperEngine:</FONT>
</CENTER>
<BR>
<HR WIDTH="25%">
<FONT ALIGN="CENTER" COLOR="#000000" SIZE="2"><B>Von Carsten Wiehle</B></FONT>
<HR WIDTH="25%">
<BR>
<P ALIGN="JUSTIFY">
<B>Was ist &quot;HyperEngine&quot; &uuml;berhaupt ?</B><BR>
HyperEngine ist eine Art Enviroment f&uuml;r die Arboretum
Software-Effekte Hyperprism, Ionizer, RayGun und viele andere Standart-Effekte.
HyperEngine PowerMac basierte Shareware, die eigenst&auml;ndig auf dem
PowerMac laufen kann und mehrere Effekte zur Soundbearbeitung bereitstellt.
Die grundlegende Aufgabe von HyperEngine ist es, als eine Art I/O-Manager
f&uuml;r DSP-Plug-Ins zu arbeiten. Die Features, die dieses Programm bieten
brauchen sich nicht zu verstecken: Harddisk-Recording inklusive Previews
in jeder L&auml;nge, nicht-destruktive Soundbearbeitung, Play-Through in
Echtzeit und bietet zudem eine lange Liste an Effekten, wie z.B. Auto Pan,
Chorus, Kompressor, Echo, Flanger, Frequency Shifter, Limiter, Noise Gate,
Multidelay, Quasi Stereo, Vocoder, Reverb und viele wirklich viele mehr.
Zudem unterst&uuml;tzt &quot;HyperEngine&quot; direkt die Treiber f&uuml;r
die Soundkarten Audiomedia II und III, sowie die Korg 1212 IO.<BR>
</P>
<BR>
<CENTER>
<IMG ALIGN="CENTER" ALT="Hyperprism" SRC="gfx/hyperprism.jpg" WIDTH="150" HEIGHT="148"><BR>
</CENTER>
<BR>
<P ALIGN="JUSTIFY">
<B>Was ist &quot;Hyperprism&quot; ?</B><BR>
&quot;Hyperprsim&quot; besteht aus zwei Duzent Software-DSP-Audio-Effekten
f&uuml;r Macs und Win-PCs. Mit &quot;Hyperprism&quot; kann man in vielen
Bereichen arbeiten, wie z.B: Audio-Posp-Production, Filmvertonung oder
eben im Recording-Bereich. Die enthaltenen Effekte sind z.B. Filter, Reverbs,
Delays, Phaser, Chorus, Flanger udn viele mehr. Das Au&szlig;ergew&ouml;hnlich
an &quot;Hyperprism&quot; ist neben der internen 32 Bit-Soundbearbeitung
sicherlich das &quot;Blue window&quot;-Grafik-Interface. Dort kann man
in Echtzeit und vor allen Dingen direkt auf die Parameter zur Sound-(Nach-)Bearbeitung
zugreifen und einstellen. Das bedeutet, da&szlig; der Euer Sound grafisch
dargestellt wird und Ihr in ihm per Drag-And-Drop in Realtime rumbasteln
k&ouml;nnt wie Ihr wollt ! Faszinierend !<BR>
<BR>
<B>Der Ionizer:</B><BR>
&quot;Ionizer&quot; ist Soundbearbeitungs- und Mastering-Tool
f&uuml;r den Mac. Es ist eine Breitband-Noise-Reduction-Software, die per
Kompression, Limiter, Expander und Equalizer Euren Sound verbessert. &quot;Ionizer&quot;
kann sogar automatisch Rauschen und &auml;hnlich unerw&uuml;nschte Sounds
aufsp&uuml;ren und unterdr&uuml;cken. Das bedeutet nat&uuml;rlich mehr
Arbeit f&uuml;r die CPU Eures Rechners, aber schlie&szlig;lich weniger
Arbeit f&uuml;r Euch !<BR>
<BR>
<B>RayGun - Die Superwaffe:</B><BR>
&quot;Ray Gun&quot; wiederum gibt es nicht nur f&uuml;r
Macs, sondern auch f&uuml;r PCs. Auch &quot;Ray Gun&quot; ist ein Programm
zur Noise-Reduction. Es k&uuml;mmert sich um unerw&uuml;nschte Pops und
Ploks, Rausche, Fiepen und sonstige unerw&uuml;nschte St&ouml;rger&auml;usche.
Mit &quot;Ray Gun&quot; k&ouml;nnt Ihr sogar Pappis alte Vinyl-Sammlung
soundtechnisch auf den neusten Stand bringen. Nat&uuml;rlich auch hier
alles nicht-Destruktiv, d.h. der Original-Sound bleibt erhalten.<BR>
<BR>
<B>Welche Audio-File-Formate werden unterst&uuml;tzt ?</B><BR>
PC: Wave-Files, MAC: Sound Designer II und AIFF-Files.<BR>
<BR>
<B>Praxis:</B><BR>
Nach einer kurzen Eingew&ouml;hnungsphase und st&auml;ndiger
Experimentiererei hat man den Dreh ziemlich schnell raus. Auch wenn man
auf den ersten Blick die vielen Parameter-M&ouml;glichkeiten verwirrend
finden mag, gew&ouml;hnt man sich ziemlich schnell daran. Gerade im Play-Through-Modus
kann man HyperEngine &amp; Co. neben den Sequencer laufen lassen ohne vorher
die Endversion eines Tracks auf DAT oder &auml;hnliches aufnehmen zu m&uuml;ssen.
Das klappt besonders bei Logic gut (zumindest bei mir). Cubase VST verweigerte
sich da leider (Vielleicht reichte auch einfach der Speicher nicht). Im
Gro&szlig;en und Ganzen ist die Anschaffung von HyperEngine, Hyperprism,
Ionizer und RayGun (die es ja alle auch als Stand-Alone-Programme gibt)
auf jeden Fall lohnend.<BR>
<BR>
<B>Fazit:</B><BR>
Wie bei jeder Software gilt gerade auch hier: Jeder schneller
der Rechner, je Gr&ouml;&szlig;er die Speicherkapazit&auml;ten, desto besser
l&auml;uft&acute;s. Aber im Grunde reichen ja auch wenig Effekte, um den
eigenen Sound zu verbessern. Toll ist auf jeden Fall, da&szlig; man alles
in Real-Time ablaufen lassen kann und per Play-Through und nicht alles
erst auf die Festplatte samplen mu&szlig;. Fazit: Klasse Software !<BR>
</P>
<BR>
<BR>
  <CENTER>
  <TABLE BGCOLOR="#CCCCCC" BORDER="0" CELLPADDING="10" CELLSPACING="0" WIDTH="70%">
    <TR BGCOLOR="#000066">
      <TH ALIGN="CENTER"><FONT COLOR="#FFFFFF" SIZE="5">HyperEngine - Info:</TH>
    </TR>
    <TR>
      <TD ALIGN="LEFT">
        <B><U>System-Vorau&szlig;etzungen</U>:</B><BR>
        <P ALIGN="JUSTIFY">
          <UL>
	    <LI><B>MAC</B>: PowerMac, 8 MB RAM, Festplattem keine zusätzliche
	        Audio-Hardware nötig, Sound Manager 3.2.1 oder höher.<BR>
		Folgende zusätzliche Audiohardware wird unterstützt: 
		Digidesign Audiomedia I bis III, Sound Tools I und II, Pro Tools 442, 
		882 und 888, Korg 1212 IO, Lucid-Karten, Audiowerk 8
                und Darla/Layla/Gina-Karten (alle nur mit entsprechenden Treibern).
	    <LI><B>IBM-PC</B>: Intel Pentium, 166 MHz, Windows 95, alle gängigen
	        Soundkarten werden unterstützt.<BR>
          </UL>
        </P>
        <BR>
        <B><U>Hersteller</U>:</B><BR>
        <DL><DT>Arboretum Systems<BR>
                <BR>
                <A HREF="http://www.arboretum.com/" TARGET="_ext">www.arboretum.com</A><BR>
        </DL>
        <BR>
        <B><U>Vertrieb</U>:</B><BR>
        <DL><DT>Trust Group<BR>
                <BR>
                <A HREF="http://www.trust-group.com/" TARGET="_ext">www.trust-group.com</A><BR>
        </DL>
        <BR>
        <B><U>Preis</U>:</B><BR>
        <BR>
        Ionizer 1.0: 990,- DM<BR>
	RayGun 1.0: 219,- DM<BR>
	Hyperprism Plug-In-Pack 2.0: 690,- DM<BR>
	Hyperprism 2.0 Stand-Alone: 599,- DM<BR>
	Hyperprism DAS: 350,- DM<BR>
	Hyperprism TDM: 990,- DM<BR>
        <BR>
      </TD>
    </TR>
  </TABLE>
  </CENTER>

</P>
<BR>
<P ALIGN="RIGHT">
<B><I>(<A HREF="impress.htm">cawi</A>)</I></B><BR>
</P>
<BR>
<CENTER>
<FONT SIZE="2">
<NOBR>
&nbsp;&middot;&nbsp;
<A HREF="http://HousePool.com/" TARGET="_top">[Home]</A>&nbsp;&middot;&nbsp;
<A HREF="index.htm">[Inhaltsverzeichnis]</A>&nbsp;&middot;&nbsp;
<A HREF="editor.htm">[Editorial]</A>&nbsp;&middot;&nbsp;
<A HREF="vinyltip.htm">[RecordBag]</A>&nbsp;&middot;&nbsp;
<A HREF="news.htm">[News]</A>&nbsp;&middot;&nbsp;
<A HREF="clubbing.htm">[Clubbing]</A>&nbsp;&middot;&nbsp;
<A HREF="impress.htm">[Impressum]</A>&nbsp;&middot;&nbsp;
<A HREF="mailto:redaktion@HousePool.com">[EMail]</A>&nbsp;&middot;&nbsp;
</NOBR>
<BR>
<HR>
&copy;1995-1998 HousePool&reg; Media International Carsten Marmulla &amp; Carsten Wiehle GbR. Alle Rechte vorbehalten und geschützt.
</BODY>
</HTML>        
