<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<HTML>
<HEAD>
  <META HTTP-EQUIV="Content-Language"     CONTENT="de">
  <META HTTP-EQUIV="Content-Type"         CONTENT="text/html;CHARSET=iso-8859-1">
  <META HTTP-EQUIV="Expires"              CONTENT="86400">
  <META HTTP-EQUIV="Refresh"              CONTENT="86400">
  <META HTTP-EQUIV="Pragma"               CONTENT="no-cache">
  <META NAME="Author"                     CONTENT="Carsten Marmulla, HousePool.com/HousePool Media GbR">
  <META NAME="Date"                       CONTENT="1998-10-13">
  <META NAME="Reply-To"                   CONTENT="redaktion@HousePool.com">
  <META NAME="Revisit-After"              CONTENT="14 days">
  <META NAME="Robots"                     CONTENT="index">
  <META NAME="Robots"                     CONTENT="follow">
  <TITLE>HousePool.com - Magazine #21 (Oktober/November 1998) - Test: Cubase 4.0 VST</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#000066" ALINK="#0000FF" VLINK="#000033">
  <CENTER>
  <P ALIGN="CENTER">
  <TABLE ALIGN="CENTER" BGCOLOR="#FFFFFF" BORDER="0" CELLPADDING="2" CELLSPACING="0">
    <TR ALIGN="CENTER">
      <TD ROWSPAN="1" VALIGN="MIDDLE">
	<IMG ALT="HP LOGO oder CUBE-AD" BORDER="0" SRC="gfx/hplogo03.gif" HEIGHT="80" WIDTH="80"></A>
      </TD>
      <TD VALIGN="TOP">
	<FONT COLOR="#000000" SIZE="2"><BR><A HREF="http://HousePool.com/cgi-bin/ads_nonssi.pl?advert=NonSSI&page=00">Besuchen Sie unseren Sponsor - Visit our sponsor:</A><BR></FONT>
        <A HREF="http://HousePool.com/cgi-bin/ads_nonssi.pl?advert=NonSSI&page=00"><IMG ALT="Sponsor" BORDER="0" SRC="http://HousePool.com/cgi-bin/ads_nonssi.pl?page=00"></A>       
      </TD>
      <TD ROWSPAN="1" VALIGN="MIDDLE">
	<IMG ALT="HP LOGO oder CUBE-AD" BORDER="0" SRC="gfx/hplogo03.gif" HEIGHT="80" WIDTH="80"></A>
      </TD>
    </TR>
  </TABLE>
  </P>




<BR>
<!-- HousePool Titel -->
<B><FONT SIZE="7">H</FONT><FONT SIZE="5">OUSE</FONT><FONT SIZE="7">P</FONT><FONT SIZE="5">OOL</FONT></B>&nbsp;&nbsp;<FONT SIZE="4"><I>Magazine</I></FONT><BR>
<!-- Beginn -->
<FONT ALIGN="CENTER" COLOR="#000000" SIZE="3">Ausgabe 21 (Oktober/November 1998)</FONT><BR>
<BR>
<CENTER>
<FONT ALIGN="CENTER" COLOR="#000066" SIZE="5">Cubase 4.0 VST - A higher state of consciousness:</FONT>
</CENTER>
<BR>
<HR WIDTH="25%">
<FONT ALIGN="CENTER" COLOR="#000000" SIZE="2"><B>Von Carsten Wiehle</B></FONT>
<HR WIDTH="25%">
<BR>
<P ALIGN="JUSTIFY">
Cubase ist mit Sicherheit eines der bekanntesten Musikprogramme der
Welt. Desto gr&ouml;&szlig;er ist immer dann die weltweite Aufmerksamkeit,
wenn Cubase-Hersteller Steinberg mit seiner Software zu einem Versionssprung
ansetzt. Cubase VST (Virtual Studio Technology) brachte bei seiner Markt-Einf&uuml;hrung
frischen Wind in den Musik-Software-Markt. Nun bringt die Version 4.0 keine
bahnbrechenden Neuerungen, sondern die Programmierer betrieben vielmehr
Systempflege und reorganisierten Cubase VST ein wenig um und verbesserten
Feinheiten, die die Arbeit mit Cubase VST erleichtern. Da Cubase VST ein
sehr umfangreiches Programm ist und somit die Neuerungen dies auch sind,
werden wir Euch lediglic einen Einblick in die Verbesserungen bieten, die
f&uuml;r den Gro&szlig;teil von euch von Interesse sein werden. Spezielle
Features k&ouml;nnt ihr zudem auf der Steinberg-Web-Site nachsehen.<BR>
</P>
<BR>
<CENTER>
<IMG ALIGN="CENTER" ALT="Cubase 4.0 VST Screenshot" SRC="gfx/cubase4a.jpg" WIDTH="350" HEIGHT="219"><BR>
</CENTER>
<BR>
<P ALIGN="JUSTIFY">
<B>Was ist Cubase VST ?</B><BR>
Falls jemand unter euch die VST-Technology noch nicht kenne sollte,
hier ein kleiner Einblick: Cubase VST ist ein MIDI-/Audio-Sequencer mit
dem ihr eure Daten wie in einem richtigen Studio mit Real-Time-Effektger&auml;ten
bearbeiten und arrangieren k&ouml;nnt. Durch die umfangreiche PlugIn-Unterst&uuml;tzung
k&ouml;nnt ihr euch euer eigenes virtuelles Studio zusammenstellen. F&uuml;r
die Arbeit mit Cubase VST braucht ihr keine zus&auml;tzliche Hardware.<BR>
<BR>
<B>Was gibt es Neues ?</B><BR>
Bisher bot der Audio-Bereich von Cubase VST &quot;nur&quot; 16 Bit-Soundqualit&auml;t,
doch mit Version 4.0 k&ouml;nnt ihr sie auf 24 Bit bei 96 kHz hochschrauben.
zudem stehen jetzt maximal 64 Audio-Spuren zur Verf&uuml;gung (vorausgesetzt,
euer Rechner ist schnell genug). Auch die Effekt-Aektion wurde verbessert:
Jeder Kanals eures virtuellen Mixers verf&uuml;gt nun &uuml;ber maximal
vier Insert-Effects ! Ihr k&ouml;nnt eure Spuren auch zu Subgruppen zusammenfassen
und auch diese wieder durch Effekte bearbeiten. Zus&auml;tzlich gibt es
nun die M&ouml;glichkeit, bis zu acht PlugIn-Effekte zu benutzen. All dies
wird gesteuert von einem voll automatisierten Mischpult. Luxus pur !<BR>
<BR>
Auch im MIDI-Bereich hat sich was getan: Der MIDI-Mixer wurde neu gestaltet,
es gibt eine &quot;Groove Box&quot;, die es erlaubt die MIDI-Controller-Daten
zu editieren. Wo soviel ver&auml;ndert wurde, darf auch der Haus-eigene
Cubase-&quot;Inspector&quot; nicht fehlen. Auch er wurde weitergebildet
und kann Random-Werte verarbeiten. Einen Arpeggiator gibt es auch und noch
einige andere Dinge wie z.B. die Timecorrection, die es erlaubt Audio-Samples
der Geschwindigkeit anzupassen ohne sie in der Tonh&ouml;he zu ver&auml;ndern.<BR>
</P>
<BR>
<CENTER>
<IMG ALIGN="CENTER" ALT="Cubase 4.0 VST Screenshot" SRC="gfx/cubase4b.jpg" WIDTH="350" HEIGHT="219"><BR>
</CENTER>
<BR>
<P ALIGN="JUSTIFY">
Wichtig ist auf jeden Fall die neue &quot;ReWire&quot;-Funktion. Sie
erlaubt die Zusammenarbeit von Cubase VST 4.0 und Propellerhead&acute;s
&quot;ReBirth 2.0&quot; ! Genial, denn ihr k&ouml;nnt von Cubase VST aus
die einzelnen Drum-Sounds und die beiden 303s, die 808 und die 909 ansteuern
und zu eurem Cubase-Song synchronisieren. Dazu gibt es beim Mixer einiger
wietere Fader und die ReBirth-Sounds k&ouml;nne sogar zu Audio-Spuren umgewandelt
werden. Wichtig ist f&uuml;r manche sicher auch, dass nun die Events zwischen
verschiedenen Cubase-Songs hin und her kopiert werden k&ouml;nnen.<BR>
<BR>
<B>Fazit:</B><BR>
Cubase VST 4.0 ist bunt, modern und super designt. Die Arbeit mit Cubase
VST ist relativ unkompliziert und macht Spass ohne Ende. Nat&uuml;rlich
ist gerade bei Cubase VST 4.0 die Rechenpower eures Computers wichtig.
Wie immer: Jede schneller und gr&ouml;&szlig;er, desto besser. Version
4.0 war vor allem wichtig f&uuml;r ein besseres Arbeiten mit der Software.
Wahrscheinlich wird der Preis einige abschrecken, aber man bekommt ja auch
eine Menge geboten.<BR>
<BR>
<BR>
  <CENTER>
  <TABLE BGCOLOR="#CCCCCC" BORDER="0" CELLPADDING="10" CELLSPACING="0" WIDTH="70%">
    <TR BGCOLOR="#000066">
      <TH ALIGN="CENTER"><FONT COLOR="#FFFFFF" SIZE="5">Cubase 4.0 VST - Info:</TH>
    </TR>
    <TR>
      <TD ALIGN="LEFT">
        <B><U>System-Vorau&szlig;etzungen</U>:</B><BR>
        <P ALIGN="JUSTIFY">
        PowerMac, PowerPC 601, 120 MHz, 32 MB RAM, 256 kB L2-Cache, MacOS 7.6.1
        </P>
        <BR>
        <B><U>Hersteller</U>:</B><BR>
        <DL><DT>Steinberg<BR>
                <BR>
                <A HREF="http://www.steinberg.de/" TARGET="_ext">www.steinberg.de</A><BR>
        </DL>
        <BR>
        <B><U>Vertrieb</U>:</B><BR>
        <DL><DT>Steinberg<BR>
                <BR>
                <A HREF="http://www.steinberg.de/" TARGET="_ext">www.steinberg.de</A><BR>
        </DL>
        <BR>
        <B><U>Preis</U>:</B><BR>
        <BR>
        ca. 1.500,- DM<BR>
        <BR>
      </TD>
    </TR>
  </TABLE>
  </CENTER>


</P>
<P ALIGN="RIGHT">
<B><I>(<A HREF="impress.htm">cawi</A>)</I></B><BR>
</P>
<BR>
<CENTER>
<FONT SIZE="2">
<NOBR>
&nbsp;&middot;&nbsp;
<A HREF="http://HousePool.com/" TARGET="_top">[Home]</A>&nbsp;&middot;&nbsp;
<A HREF="index.htm">[Inhaltsverzeichnis]</A>&nbsp;&middot;&nbsp;
<A HREF="editor.htm">[Editorial]</A>&nbsp;&middot;&nbsp;
<A HREF="vinyltip.htm">[RecordBag]</A>&nbsp;&middot;&nbsp;
<A HREF="news.htm">[News]</A>&nbsp;&middot;&nbsp;
<A HREF="clubbing.htm">[Clubbing]</A>&nbsp;&middot;&nbsp;
<A HREF="impress.htm">[Impressum]</A>&nbsp;&middot;&nbsp;
<A HREF="mailto:redaktion@HousePool.com">[EMail]</A>&nbsp;&middot;&nbsp;
</NOBR>
<BR>
<HR>
&copy;1995-1998 HousePool&reg; Media International Carsten Marmulla &amp; Carsten Wiehle GbR. Alle Rechte vorbehalten und geschützt.
</BODY>
</HTML>        
