<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - Canon BJC 4300</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Canon BJC 4300</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A><BR>
</DIV>
<P>Der <B>Canon BJC 4300</B> ist ein Farbtintenstrahldrucker, der nach dem
sogenannten Bubble Jet-Prinzip arbeitet. Da er in diesem Moment
in Folge der allj&auml;hrlichen Angebotsrenovierung gegen seinen
Nachfolger BJC 4400 ausgetauscht wird, kann man ihn bei manchem H&auml;ndler
und in manchem Groﬂmarkt oder auch gebraucht zu einem g&uuml;nstigen Preis
ergattern.</P>

<P><H3><B>Wo ist er einzuordnen?</B></H3></P>

<P>Bevor ich n&auml;her auf ihn eingehe, will ich erst versuchen seine
Position im Canon-Produktprogramm zu verdeutlichen. Er bedient
unterhalb des Top- und der DIN-A3-Modelle und oberhalb einiger
kleinerer Drucker das mittlere Segment als Allround-Drucker.</P>

<P>Bei den <B>Vorg&auml;ngern</B> fiel auf, daﬂ die ab dem BJC 4000 vorgenommenen
&Auml;nderungen an den Nachfolgemodellen schwer zu erkennen waren und sind.
Zuerst fielen zwar ein paar Kn&ouml;pfe weg, die letzten Modelle kommen mit
nur zwei St&uuml;ck aus, aber die Form blieb gleich und im allgemeinen konnten
die gleichen Tintenpatronen oder Druckk&ouml;pfe weiterverwendet werden. (Die
offizielle Canonbezeichnung f&uuml;r die Patrone lautet &uuml;brigens &quot;Kartusche&quot;
und f&uuml;r den Kopf in Kombination mit Kartuschen &quot;Patrone&quot;. Ich werde
bei diesen Termini bleiben, um Miﬂverst&auml;ndnissen vorzubeugen.)</P>

<P>Auch beim direkten Vorg&auml;nger, dem <B>BJC 4200</B>, muﬂ man etwas detektivische
Arbeit leisten, um Unterschieden auf die Spur zu kommen. Einmal w&auml;re da
die ver&auml;nderte Farb-Patrone mit einem neuen Druckkopf, die mitgeliefert
wird, sowie die ebenfalls ver&auml;nderte optionale Fotopatrone. Ansonsten
k&ouml;nnen zur Bef&uuml;llung dieser Patronen (die also Druckkopf und
Tintenkartuschenbeh&auml;lter in einem darstellen) die gleichen Kartuschen,
wie bei den Vorg&auml;ngern (ab BJC 4000) verwendet werden, was durch die
langj&auml;hrige Serienproduktion ein groﬂer Vorteil ist, durch weite
Verbreitung und geringere Preise. </P>
<P>
Der zweite Unterschied, den ich herausgefunden habe, ist, daﬂ man zwei
kleine Klappen an dem Papierausgabefach hochklappen kann, was den Druck
von Endlospapier f&uuml;r Banner (bis zu 6 Seiten) unterst&uuml;tzt, was beim
Vorg&auml;ngermodell nicht m&ouml;glich war, soweit ich informiert bin.</P>

<P>Auﬂerdem ist <B>ab dem BJC 4300</B> der Einsatz eines Scannerkopfes, statt
der normalen Druckk&ouml;pfe - ich meine nat&uuml;rlich Patronen - m&ouml;glich. Er
erreicht zwar eine Aufl&ouml;sung von 360 DPI, ist aber durch einen hohen
Preis (der h&ouml;herwertigere Flachbettscanner um einiges &uuml;bertrifft), seine
naturgem&auml;ﬂ unflexible Beschr&auml;nkung auf sehr d&uuml;nne Scanvorlagen und seine
Nichtunterst&uuml;tzung durch Treiber beim Amiga nur f&uuml;r sehr wenige PC-
Besitzer mit noch weniger Platz interessant.</P>

<P>Der Nachfolger <B>BJC 4400</B>, gerade erst erschienen, ist optisch (wie
eigentlich auch der BJC 4200) identisch mit dem BJC 4300. Neue Patronen
oder Kartuschen sind hier nicht erforderlich, auch der Scankopf wird
unterst&uuml;tzt - neue, ver&auml;nderte Leistungsdaten konnte ich nicht entdecken,
ja selbst die Packung ist gleich, so daﬂ sich der Verdacht aufdr&auml;ngt, das
sich der gr&ouml;ﬂte Unterschied m&ouml;glicherweise in einer erh&ouml;hten Ziffer auf
dem Geh&auml;use niederschl&auml;gt. Somit d&uuml;rfte dieser Test auch einen Groﬂteil
dieses Druckers abdecken. </P>

<P><H3><B>Beschreibung des Aufbaus</B></H3></P>

<P>Aber uns geht es ja um den BJC 4300:</P>

<P>Dieser pr&auml;sentiert sich recht formsch&ouml;n mit einer geringen Standfl&auml;che,
die durch das vorn unten befindliche Papierausgabefach etwas vergr&ouml;ﬂert
wird. Diesea kann aber sehr einfach und schnell wieder hineingeschoben
werden. Hinten schr&auml;g nach oben ragt die Papierst&uuml;tze mit dem Blatteinzug,
auf dem dann das Papier lagert. Nachteil: Bei langen Pausen zwischen den
Drucken stauben die Bl&auml;tter schnell ein. Der Einzug faﬂt maximal 100
Seiten.</P>

<P>Hinten muﬂ einmalig das AC-Adaptermodul eingeschoben werden, das sich
nahtlos in das Geh&auml;use einf&uuml;gt. Vorteil: Keine externe Stromversorgung
trotz geringer Abmessungen. F&uuml;r den Hersteller gibt es sicher
Einsparungen durch die Herstellung eines Modells f&uuml;r alle M&auml;rkte
und einfaches &quot;Hinzupacken&quot; des jeweiligen Stromadapters und, wie
ich geh&ouml;rt habe, auch Vorteile bei der CE-Pr&uuml;fung.</P>

<P>Das Papier wird also beim Drucken im Normalfall von schr&auml;g oben nach
gerade unten durchgezogen. Warum im Normalfall? Weil es hinten, &uuml;ber
dem Adaptermodul, einen weiteren Einzug gibt, der f&uuml;r andere Medien
(zu denen ich sp&auml;ter noch komme) und Briefumschl&auml;ge zu verwenden ist
und der das Papier gerade durchzieht.</P>

<P>Auf der Oberseite des Druckers befinden sich die (wie erw&auml;hnt) zwei
Tasten und eine Statusleuchte. Die POWER-Taste dient nat&uuml;rlich zum
Ein- und Ausschalten, und bewirkt bei l&auml;ngerem Dr&uuml;cken beim Einschalten
des Druckers je nach Anzahl der erfolgenden Pipt&ouml;ne unterschiedliche
Selbsttest-Drucke.</P>

<P>Die RESUME-Taste dient dem Zur&uuml;cksetzen bei Fehlern, zum Einziehen
eines Blattes, zum Auswerfen eines Blattes oder (bei l&auml;ngerem Dr&uuml;cken)
zur Druckkopf-Reinigung.</P>

<P>Hinter der Frontklappe befindet sich eine Cartridge-Taste, die das
Her&uuml;berfahren des Druckkopfes aus der Parkposition rechts in die Mitte
bewirkt, um Wechsel durchzuf&uuml;hren. In jedem Fall sollte man vermeiden
die Patrone manuell auf der Schiene zu bewegen! &Uuml;ber der Parkposition
(in der die Tinte nicht austrocknet) befindet sich ein Druckkopfhebel,
der, je nach Dicke des zu bedruckenden Materials, gegebenenfalls in
eine andere Position gebracht werden muﬂ.</P>

<P>Dieses also erst einmal zum Aufbau.</P>

<P><H3><B>Bestandsaufnahme</B></H3></P>

<P>Nach dem ersten Auspacken findet man neben dem Drucker auch einen
Standarddruckkopf vor, der eine kleine Farb- und eine kleine Schwarz-
Kartusche aufnehmen kann, die ebenfalls mitgeliefert werden. Dazu
gibt es einen Patronenbeh&auml;lter, der die Austrocknung verhindern
soll wenn man Patronen zeitweise komplett austauscht, z.B. wenn
man die Foto-Patrone einsetzen will, deren Einsatz ja nur in
speziellen F&auml;llen lohnt.</P>

<P>Es gibt eine groﬂformatige, bunte Kurzanleitung, die in kompakter
&quot;idiotensicherer&quot; Form den ersten Aufbau und Anschluﬂ erl&auml;utert und
diese Aktion zum Kinderspiel macht. Daf&uuml;r ein groﬂes Kompliment an
Canon!</P>

<P>Neben der, ebenfalls sehr guten, ausf&uuml;hrlichen und nat&uuml;rlich ebenso
deutschsprachigen Bedienungsanleitung, gibt es noch ein Heft, das
die Windowsinstallation erl&auml;utert, sowie die dazugeh&ouml;rigen Windows-
Treiberdisketten und eine Disk mit Fonts.</P>

<P>Ein Parallelkabel, zum Anschluﬂ notwendig, ist nicht im Lieferumfang
enthalten und nat&uuml;rlich auch keine Amiga-Treiber, aber das ist ja
bei keinem Drucker der Fall.</P>

<P>Hier h&auml;lt aber Canon doch eine kleine &Uuml;berraschung f&uuml;r viele Amiga-
User bereit, denn sie unterst&uuml;tzen doch tats&auml;chlich den Amiga! Auf der
Support-Homepage (www.canon.de), ebenso wie im Aminet, ist CanonStudio
erh&auml;ltlich, eine abgespeckte Version des Studio-Programms, einem
Treiberpaket f&uuml;r viele Drucker von Wolf Faust, das bis zum BJC 4300
namentlich alle Canon-Tintenstrahler unterst&uuml;tzt.</P>

<P><H3><B>Daten, Zahlen, Fakten</B></H3></P>

<P>Bevor ich mich der Zusammenarbeit der Software mit dem Drucker und dem
eigentlichen Drucken zuwende, erst noch einiges &uuml;ber die allgemeinen
M&ouml;glichkeiten des BJC 4300:</P>

<P>Er kann maximal 720x360 DPI Aufl&ouml;sung erreichen, viele Materialien
bedrucken, inklusive Normalpapier, beschichtetem Papier, Briefumschl&auml;ge,
Folien, Endlospapier und Druckstoff (!).</P>

<P>Die Tinte ist weitgehend lichtunempfindlich, trocknet schnell, ist
wischfest und eignet sich auch f&uuml;r Normalpapier (nicht bei allen
Tintenstrahlern selbstverst&auml;ndlich!).</P>

<P>Mit der Fotopatrone (um die 80 DM zus&auml;tzlich), kann man auf
entsprechendem Spezialpapier nahezu Photoqualit&auml;t erreichen. Dies habe
ich nicht selbst getestet aber dementsprechende Ausdrucke gesehen.</P>

<P>Die Handhabung ist sehr einfach und auch das Wechseln der Kartuschen
und/oder des Druckkopfes f&auml;llt sehr leicht. F&uuml;r die Standardpatrone
sind auch Nachf&uuml;llkartuschen von anderen Herstellern erh&auml;ltlich. Die
kleine Farbkartusche enth&auml;lt in drei Kammern die Farben Cyan, Magenta
und Gelb, aus der die anderen ben&ouml;tigten Farben zusammengemischt
werden. S/W-Bilder und Texte werden mit der Schwarz-Kartusche gedruckt,
da ein, aus den anderen Farben gemischtes Schwarz meist etwas merkw&uuml;rdig
aussehen w&uuml;rde und auch die anderen Farben unn&ouml;tig verbraucht, dabei die
Kosten erh&ouml;ht. Auch ist so kein Wechsel der Patronen bei Farb- oder Text-
Druck n&ouml;tig.</P>

<P>Allerdings ist die Lebensdauer dieser kleinen Kartuschen bei vielem
Drucken nat&uuml;rlich sehr begrenzt. Man sollte Farbdrucke auf das n&ouml;tige
begrenzen. Die schwarze Kartusche hat bei mir ziemlich genau f&uuml;r 50
dichtbedruckte Textseiten gereicht.</P>

<P>Neben der erw&auml;hnten Fotopatrone und einer speziellen Fluoreszenz-Patrone
f&uuml;r sehr spezielle Zwecke, gibt es auch eine Spezial- Schwarzpatrone, die
den Tank direkt mit dem Druckkopf vereint, was bedeutet, daﬂ beide nach
Tintenende entsorgt werden m&uuml;ssen. Trotzdem lohnt sich bei Drucken von
vielen Texten oder Schwarz-Weiﬂ-Grafiken die Investition von etwa 70 DM,
da der ziemlich groﬂe Tank lange vorh&auml;lt. Eine der kleinen
Schwarzkartuschen kostet etwa 15 DM, andere Herstellern, wie
Pelikan, liegen ein paar Mark darunter.</P>

<P><H3><B>Nun also zu der Software:</B></H3></P>

<P>CanonStudio bietet die <B>Installation</B> in drei verschiedenen Sprachen an,
darunter Deutsch. Der Installer steht eigentlich f&uuml;r Problemlosigkeit,
da allerdings eine &auml;ltere Version mitgeliefert und verwendet wird,
kann es, je nach Fonteinstellung des Systems, dazu kommen, daﬂ die
Optionskn&ouml;pfe im Fenster nicht anw&auml;hlbar sind. Schnelle <B>Probleml&ouml;sung</B>:
&Auml;ndern der Standardwerkzeug-Zeile der Installationsicon-Info auf z.B.
&quot;C:Installer&quot;, so daﬂ der eigene, hoffentlich neuere verwendet wird
(erh&auml;ltlich im Aminet).</P>

<P>Danach geht alles glatt. Neben <B>neuen WB-Treibern</B>, wird ein spezielles
Prefsprogramm mitgeliefert, sowie f&uuml;r den Druck von Grafiken das relativ
stark eingeschr&auml;nkte <B>CanonStudio</B>. Die WB-Treiber sind allerdings &uuml;berhaupt
nicht eingeschr&auml;nkt!</P>

<P>Am Ende der Installation startet automatisch der WB-Printer-Einsteller,
in dem man, wie eben vom Installer aufgefordert, den speziellen Canon-
Treiber ausw&auml;hlt. Danach kann man im ebenfalls automatisch startenden
CanonBJEC-Prefsprogramm seine bevorzugten Einstellungen w&auml;hlen.</P>

<P><H3><B>Das CanonBJEC-Prefs-Programm</B></H3></P>

<P>Hier gibt es den Button &quot;<B>Emul</B>&quot; in dem man aus zahlreichen Drucker-
Emulationen im Normalfall den BJC 4300 ausw&auml;hlen wird. Der Knopf
&quot;<B>Mode</B>&quot; l&auml;ﬂt eine groﬂe Liste mit m&ouml;glichen Medien erscheinen, die
man vor dem Bedrucken jeweils hier einstellen sollte.</P>

<P>Es f&auml;llt &uuml;brigens auf, daﬂ die Programme alle in Englisch gehalten sind.
Die Dokumentation der Software besteht aus ellenlangen Readme`s, ist
aber deutsch und verst&auml;ndlich geschrieben. </P>

<P>Weiter geht es mit der Wahlm&ouml;glichkeit zwischen Color und SuperGray,
und vielen weiteren speziellen Einstellungen, wie z.B. der automatischen
Abschaltung des Ger&auml;tes. Erw&auml;hnenswert neben den <B>Color-Adjustments</B>, in
denen man neben den Farbeinstellunegn auch den Gammawert, Helligkeit und
Kontrast regeln kann, ist die Auswahl der <B>Dithermethoden</B>, die sehr
zahlreich vorhanden sind und bei denen man auch eine seinen eigenen
Bed&uuml;rfnissen entsprechend anpassen kann. </P>

<P>Positiv an dem <B>Programmkonzept</B> ist, daﬂ alle Programme die die WB-Treiber
zum Drucken verwenden, also die Mehrzahl, nun von den M&ouml;glichkeiten der
neuen Treiber und des Canon-Druckers profitieren k&ouml;nnen. F&uuml;r das
Programm PageStream 2.2 sind spezielle Treiber mitgeliefert, die von
PageStream 3.0, sowie ImageFX sind nur in der Vollversion enthalten.</P>

<P><H3><B>Grafiken drucken mit CanonStudio</B></H3> </P>

<P>Das Programm CanonStudio dient dem Drucken von Bildern in bis zu 24 Bit
Farbtiefe. Allerdings ist es <B>stark eingeschr&auml;nkt</B>. So k&ouml;nnen in dieser
Version lediglich IFF-Bilder gedruckt werden, die Dichte, Gr&ouml;ﬂe, Aspekt
und die Dithermethode ausgew&auml;hlt werden.</P>

<P>Das CMS, das <B>Color Management System</B>, welches den Farben des Bildschirms
nahezu entsprechende Ausdrucke erzeugen soll, sowie andere interne
Grafikformate, Datatype-Unterst&uuml;tzung, ARexx-Schnittstelle, Effekte usw.
usw. sind gesperrt und nur in der, f&uuml;r 40 DM Bar oder sonst 45 DM teuren
Vollversion erh&auml;ltlich.</P>

<P>Nun muﬂ man also entweder alles m&uuml;hevoll in IFF konvertieren, (denn
so viel 24 Bit-IFFs gibt es ja im allgemeinen nicht), ein Tricktool
verwenden, daﬂ Amiga-Programmen, die nur IFF`s laden k&ouml;nnen, Datatype-
Support beibringt oder l&ouml;hnen. Ansonsten ist das Programm vielleicht
doch ein biﬂchen arg eingeschr&auml;nkt.</P>

<P>Trotzdem ergaben sich recht ansehnliche Druckergebnisse im Grafikdruck.
Mit Augenmerk auf den Farbdruck sind auch gute Ergebnisse m&ouml;glich, jedoch
sollte klar sein, daﬂ man f&uuml;r Photoqualit&auml;t die Spezialpatrone ben&ouml;tigt.
Gerade dann braucht man aber f&uuml;r optimale Ergebnisse auch die Vollversion,
die einiges an Leistungsreserven freisetzen soll.</P>

<P><H3><B>Texte drucken</B></H3></P>

<P>Demgegen&uuml;ber sind ja erfreulicherweise die Standardtreiber nicht
eingeschr&auml;nkt. Probeausdrucke unter Finalwriter mit seiner Truetype-
Fonts-Unterst&uuml;tzung, sowie unter GoldED, welches &quot;Schreibmaschinen-
Fonts&quot; verwendet, ergaben jeweils eine sehr gute Textdruckqualit&auml;t,
selbst auf &quot;Billig-Papier&quot;.</P>

<P><B>Bemerkung zur Bewertung</B></P>

<P>Ich werde in diesem Fall Treiber und Hardware nicht einzeln bewerten,
da die Treiber, wie beim PC (wo es selbstverst&auml;ndlich ist), kostenlos
mitgeliefert werden und die Benutzung erst richtig m&ouml;glich machen.
Druckerfirma und Wolf Faust geb&uuml;hren Dank f&uuml;r das Engagement und
dieses, dem User zugute kommende Arrangement!</P>

<P><H3><B>Fazit:</B></H3></P>

<P>Der Canon BJC 4300 h&auml;lt, was er verspricht. Zu einem konkurrenzlos
g&uuml;nstigen Preis gibt es einen vollwertigen Mittelklassedrucker, der
in Bezug auf Druckmedien und Patronen sehr flexibel ist und mit einer
sehr guten Druckqualit&auml;t gl&auml;nzt. Zusammen mit den Treibern l&auml;ﬂt es
sich so auf dem Amiga komfortabel arbeiten.</P>
<P>
<TABLE ALIGN="CENTER" BORDER=1>
<TR>
    <TH>Produkt:</TH><TD>Canon BJC 4300</TD><TH>Hersteller:</TH><TD><A HREF="http://www.canon.de">Canon</A></TD>
</TR>
<TR>
    <TH>Art:</TH><TD>Bubble-Jet-Drucker</TD><TH>Version:</TH><TD>-</TD>
</TR>
<TR>
    <TH>Preis:</TH><TD>249 DM(neu)soweit erh.</TD><TH>Bez.Quelle:</TH><TD>Fachhandel</TD>
</TR>
<TR>
    <TD COLSPAN="4"></TD>
</TR>
<TR>
    <TH>Leistungsf&auml;higkeit:</TH><TD ALIGN="CENTER">1</TD><TD ALIGN=CENTER ROWSPAN=4 COLSPAN=2><IMG SRC="../images/note1.gif" WIDTH="32" HEIGHT="52"></TD>
</TR>
<TR>
    <TH>Benutzerfreundlich:</TH><TD ALIGN=CENTER>1</TD>
</TR>
<TR>
    <TH>Dokumentation:</TH><TD ALIGN=CENTER>1</TD>
</TR>
<TR>
    <TH>Preis-/Leistung:</TH><TD ALIGN=CENTER>1</TD>
</TR>
<TR>
    <TD COLSPAN="4"></TD>
</TR>
<TR>
    <TH COLSPAN="2">Gesamt:</TH><TD COLSPAN=2 ALIGN=CENTER>1</TD>
</TR>
</TABLE>

<P>Die Vollversion des Treiberpakets <B>`CanonStudio`</B> ist f&uuml;r 40 DM (bar)
oder 45 (Versand Europa) erh&auml;ltlich bei:</P>
<p>
Wolf Faust, Am Dorfgarten 10, 60435 Frankfurt<BR>
eMail: <A HREF="mailto:100116.1070@compuserve.com">100116.1070@compuserve.com</A></P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812ill.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812a2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
