<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - Ariadne II</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Ariadne II</H1>von<BR><A HREF="mailto:T.Heinrich@t-online.de">Thomas Heinrich</A></DIV>


                       <H2 ALIGN="CENTER">Netzwerk oder Labyrinth?</H2>

<B>Leichtgewicht</B>

<P>Die Ariadne ist eine der wenigen Netzwerkkarten f&uuml;r den Amiga. P&uuml;nktlich
zur Computer 98 hat VillageTronic die Nachfolgerin zur Ariadne vorgestellt,
die Ariadne II. Der wesentliche Unterschied zur ersten Version liegt im
Preis: Statt knapp 350 DM hinzubl&auml;ttern, kann man die zweite Version schon
f&uuml;r 200 DM kaufen. Klar, daﬂ da was fehlt - die zwei Parallelports, und
damit auch der PLIP-Treiber, wurden wegrationalisiert. &Uuml;brig bleibt eine
10 Mbit-Netzwerkkarte, nicht sonderlich modern f&uuml;r die heutige Zeit,
jedoch ausreichend f&uuml;r kleine Netzwerke und Amigas mit Zorro-2 Slots.
Eine moderne 100 Mbit-Karte m&uuml;ﬂte ausschlieﬂlich f&uuml;r Zorro-3 realisiert
werden, da die damit theoretisch m&ouml;glichen 10 MByte pro Sekunde vom
Zorro-2 Slot nicht geliefert werden k&ouml;nnten und die Karte somit gebremst
w&uuml;rde. </P>

<P>Trotzdem bl&auml;ttert man die 200 DM mit zwei weinenden Augen hin. Auf der
Computer 98 gab es PC-Karten mit derselben Funktionalit&auml;t f&uuml;r unter
30 DM...</P>

<P><B>St&ouml;psel</B></P>

<P>Trotz der Einsparungen ist die <B>Anschluﬂfreudigkeit</B> der Ariadne II immer
noch sehr gut. Man hat die Wahl zwischen 10BaseT (&quot;Telefonkabel&quot; = vier
Leitungen, paarweise verdrillt und idealerweise abgeschirmt) und 10Base2,
(Cheapernet, &quot;Antennenkabel&quot;, BNC-Kabel = eine Leitung, abgeschirmt).
Achtung, echtes Antennenkabel sollte man nicht verwenden, da der
Leitungswiderstand bei Ethernet 50 Ohm, bei Antennenkabel aber 75 Ohm
sein muﬂ!</P>

<P>Auﬂerdem kann man LEDs zur Statusanzeige anschlieﬂen, ein Feature, das
man bei PC-Karten normalerweise nicht findet. Weiterhin sind drei
beschriftete, aber nirgends n&auml;her erkl&auml;rte Steckerleisten vorhanden,
die einem &quot;Ext.IO&quot; dienen. Zu guter letzt kann man noch ein Boot-EPROM
einstecken, das einen Start des Rechners ohne eigene Startdisk &uuml;ber ein
Netzwerk erm&ouml;glicht. Der einzige Jumper auf der Karte dient dann auch
dazu, dieses Boot-Eprom zu aktivieren. Wenn Ihr Rechner sich nach dem
Einbau der Ariadne &uuml;brigens seltsam benehmen sollte, liegt das wohl an
diesem Jumper. Standardm&auml;ﬂig war er auf meinem Exemplar n&auml;mlich auf den
Start mittels EPROM voreingestellt, obwohl keines im Sockel sitzt.</P>

<P><B>Zubeh&ouml;r</B></P>

<P>Eine Netzwerkkarte alleine bringt keinen Spaﬂ, man sollte schon noch einen
zweiten Rechner haben, egal was f&uuml;r einen, solange er eine Netzwerkkarte
besitzt, die 10 Mbit-Ethernet unterst&uuml;tzt. An meinem Netzwerk h&auml;ngen auﬂer
dem Amiga noch ein Pentium und ein 486er, jeweils unter Linux, mit 10 MBit
PCI-Ethernetkarten (29 DM das St&uuml;ck...).</P>

<P>Zum Betrieb muﬂ man noch Spezialkabel und anderes Zubeh&ouml;r kaufen. Der
Ariadne II liegt freundlicherweise ein T-St&uuml;ck und ein Abschluﬂwiderstand
bei, so daﬂ man beim Kauf zweier Ariadnes nur noch ein Kabel ben&ouml;tigt.
Benutzen kann man die Teile nur beim Cheapernet-Anschluﬂ, aber da sind
sie zwingend notwendig. Beide Enden des Kabels m&uuml;ssen mit Terminatoren
abgeschlossen werden, um Reflexionen auf dem Kabel zu b&auml;ndigen. Ist die
&Uuml;bertragungsrate sehr niedrig, sollten Sie zuerst auf richtige
Terminierung &uuml;berpr&uuml;fen. Die T-St&uuml;cke ben&ouml;tigt man, um aus der
strangf&ouml;rmigen Verkabelung bei Cheapernet eine Abzweigung zum
Rechner zu schaffen.</P>

<P>Ganz anders sieht es aus, wenn Sie 10BaseT verwenden wollen. Diese
Variante ist zwar etwas schneller, aber sie kann nur als Stern verkabelt
werden. Kein Problem, solange nur zwei Rechner beteiligt sind, die
st&ouml;pselt man einfach zusammen, aber sp&auml;testens beim dritten Computer
sind teure Zusatzanschaffungen n&ouml;tig. Dann ben&ouml;tigt man einen Repeater,
auch &quot;Hub&quot; genannt, der als Verteiler fungiert. Billige Hubs mit f&uuml;nf
Anschl&uuml;ssen gibt es ab ca. 70 DM. </P>

<P><B>Installation</B></P>

<P>Die Karte einzubauen ist problemlos: Freien Slot suchen, einstecken,
fertig. Dann die erste der zwei Disketten einlegen, und ... sich wundern,
denn was zu H&ouml;lle soll &quot;Install_<B>GENESiS</B>&quot; bedeuten? Hieﬂ das Teil nicht
Ariadne? Hier macht sich auch der <B>Installations-Guerilla</B> auf die Suche
nach dem Handbuch. Im Karton liegt noch ein unbeschriftetes Ringb&uuml;chlein,
das scheint es zu sein. Etwas irritierend ist es schon, vorne weiﬂ, hinten
weiﬂ, keine Aufschrift drauf. Prompt steht die Schrift beim aufschlagen
auf dem Kopf. Wenn man dann richtig herum immer noch nichts lesen kann,
liegt es vielleicht daran, daﬂ alles auf Englisch ist.</P>

<P>Also kramt man die Englischkenntnisse hervor und liest erst mal das
B&uuml;chlein (36 Seiten). Schnelleinstieg, Einbau in den A2/3/4000,
Netzwerkinstallation, endlich die Software. Da heiﬂt es, erstmal die
Datei &quot;README&quot; lesen (ist nicht vorhanden), dann auf &quot;Install-English&quot;
doppelklicken (gibt's auch nicht). In meiner Not habe ich dann auf
&quot;Install_GENESiS&quot; geklickt, und es tat sich was. Tats&auml;chlich wurde der
SANA-2 Treiber f&uuml;r die Ariadne nach Devs:Networks kopiert und GENESiS,
alias AmiTCP, auf der Platte installiert.</P>

<P>Leider nicht problemlos. Zwar benutzt VillageTronic den Installer, aber
nicht, wie &uuml;blich &quot;Lhex&quot; als Entpacker, sondern &quot;Untgz&quot;, einen Unix-
Dateientkomprimierer. Der Grund mag sein, daﬂ tgz-gepackte Archive die
Zugriffsrechte und Besitzer der Dateien mitsichern, aber beim Amiga
gibt's die sowieso nicht standardm&auml;ﬂig. Genau dieses &quot;Untgz&quot; st&uuml;rzte
bei der Installation ab. Ich habe daraufhin neu gebootet, wieder ein
Absturz (Guru 8000 000B). Bei einer Neuinstallation Tage sp&auml;ter hat
es dagegen funktioniert.</P>

<P>Weiter im Handbuch. Nach der Software kommt eine recht interessante
Ausf&uuml;hrung &uuml;ber Ethernet und die Beschreibung zweier &quot;Monitoring Tools&quot;.
Ich habe gr&uuml;ndlich alles abgesucht, aber die Tools wurden weder
installiert, noch sind sie irgendwo auf den Disketten versteckt. Selbst
die Suche in den tgz-Archiven blieb erfolglos: Sie sind einfach nicht
da. Nicht einmal auf den Support-Seiten von VillageTronic. Vaporware
at it's best !</P>

<P>Es w&auml;ren &uuml;brigens die Programme &quot;SanaIIDevStat&quot; und &quot;SanaIITrackType&quot;
gewesen. Falls sie irgend jemand noch finden sollte, er m&ouml;ge mich bitte
verst&auml;ndigen.</P>

<P>Dann gibt es noch das Kapitel zur Konfiguration des SANA-2-Devices,
ein Kapitel zur Probleml&ouml;sung, die Jumper und LEDs, technische
Spezifikationen und ein gutes Glossar.</P>

<P>Die Anleitung zu GENESiS liegt dann als HTML auf der Platte. Nur leider
auch hier einige Unstimmigkeiten. Das installierte GENESiS ist eine OEM-
Version von VillageTronic, die Anleitung eine Beschreibung von NetConnect,
mit nur teilweise auf die Ariadne angepaﬂten Texten (englisch nat&uuml;rlich).
Manche Seiten fehlen ganz.</P>

<P>Alles in allem macht es den Eindruck, als h&auml;tte man ein NoName-Produkt
oder etwas ziemlich unfertiges erworben.</P>

<P><B>Entr&uuml;stung</B></P>

<P>Wer mit der Installation der Ariadne nicht zurechtkommt, kann den Leuten
von VillageTronic kr&auml;ftig auf die F&uuml;ﬂe treten, denn eine brauchbare
Produktbeschreibung und Gebrauchsanweisung ist in Deutschland eigentlich
Pflicht. Wer seine Ariadne besch&auml;digt oder nicht einsetzen kann, weil die
Gebrauchsanweisung nicht verst&auml;ndlich ist, kann auf kostenlosen Ersatz
bzw. Nachbesserung bestehen!</P>

<P><B>Besonders lecker</B> ist dabei auch der Hinweis, daﬂ die Ariadne vor
statischen Entladungen gesch&uuml;tzt werden muﬂ, ansonsten erlischt die
Garantie. Leider hat der Hersteller es vers&auml;umt, die Karte in eine
antistatische Verpackung zu legen, so daﬂ jede Ber&uuml;hrung der Karte und
sogar der bloﬂe Transport mit der Post potentiell gef&auml;hrlich ist. Die
einzig richtige Vorgehensweise w&auml;re, den Karton vor Zeugen zu &ouml;ffnen,
nichts ber&uuml;hren, feststellen, daﬂ die Ware mangelhaft ist, und
zur&uuml;cksenden.</P>

<P>Ich m&ouml;chte damit nicht die Firma VillageTronic angreifen, denn solche
fahrl&auml;ssigen Dummheiten findet man h&auml;ufig. Nur sind sich viele User gar
nicht bewuﬂt, welche Rechte sie haben, deswegen erw&auml;hne ich hier einmal
einige.</P>

<P><B>Vernunft</B></P>

<P>Wer sich schon mit Netzwerken besch&auml;ftigt hat, weiﬂ, daﬂ 10 Mbit/s keine
1,2 MByte pro Sekunde sind. Zum einen l&auml;uft bei der Daten&uuml;bertragung ein
Protokoll mit, das der &Uuml;bertragungssicherheit dient, also nicht jedes Bit
&uuml;bertr&auml;gt Nutzdaten. Zum anderen hat Ethernet einige spezielle Probleme
mit der Kollisionserkennung (= gleichzeitiger Zugriff zweier Ger&auml;te auf
die Leitung), die manchmal die Netzkarten regelrecht l&auml;hmen, weil sie
sich aufschaukeln. Das sind jedoch alles systematische Probleme, keine
Amiga- oder Ariadne-spezifischen.</P>

<P>Die <B>&Uuml;bertragungsrate</B> &uuml;ber FTP schwankt dann auch zwischen 200 und 700
KByte pro Sekunde, je nach &Uuml;bertragungsrichtung und Tageszeit :). Vom
Amiga zum PC ist die Verbindung meistens schneller. Interessant auch,
daﬂ Miami l&auml;nger zum Zur&uuml;cksenden einer Ping-Anfrage braucht, als
GENESiS, mit demselben Device. Seit kurzem gibt es f&uuml;r Miami 3.x auch
einen MNI-Treiber f&uuml;r die Ariadne II, der aufgrund fehlender objektiver
Meﬂmethoden leider nicht bewertet werden kann. Er ist auf jeden Fall
nicht langsamer.</P>

<P><B>Fazit</B></P>

<P>Der Ariadne II kann man, was die Hardware angeht, eine gute Verarbeitung
und angemessene Geschwindigkeit attestieren. Die Software an sich ist
auch recht leistungsf&auml;hig, aber dabei macht sich schon die v&ouml;llig
verkorkste Dokumentation bemerkbar. AmiTCP war noch nie einfach zu
konfigurieren, und der neue Installationsassistent hilft auch nur, wenn
man sich mit Netzwerken zumindest oberfl&auml;chlich auskennt. Vor allem
deshalb w&auml;re eine sorgf&auml;ltig gepflegte, detaillierte Dokumentation sehr
wichtig. Die Meldungen der MUI-Bubblehelp helfen oft nicht weiter,
geschweige denn die Anleitung, in der genau dasselbe steht; ausprobieren
ist im Netzwerk hoffnungslos, wenn man nicht weiﬂ, was man tut.</P>

<TABLE ALIGN="CENTER" BORDER=1>
<TR>
    <TH>Produkt:</TH><TD>Ariadne II</TD><TH>Hersteller:</TH><TD><A HREF="http://www.villagetronic.de">VillageTronic</A></TD>
</TR>
<TR>
    <TH>Art:</TH><TD>Ethernet-Netzwerkkarte</TD><TH>Version:</TH><TD>-</TD>
</TR>
<TR>
    <TH>Preis:</TH><TD>199 DM</TD><TH>Bez.Quelle:</TH><TD><A HREF="http://www.oberland.com">Oberland Computer</A></TD>
</TR>
<TR>
    <TD COLSPAN="4"></TD>
</TR>
<TR>
    <TH>Leistungsf&auml;higkeit:</TH><TD ALIGN="CENTER">2</TD><TD ALIGN=CENTER ROWSPAN=4 COLSPAN=2><IMG SRC="../images/note4.gif" WIDTH="32" HEIGHT="52"></TD>
</TR>
<TR>
    <TH>Benutzerfreundlich:</TH><TD ALIGN=CENTER>4</TD>
</TR>
<TR>
    <TH>Dokumentation:</TH><TD ALIGN=CENTER>5</TD>
</TR>
<TR>
    <TH>Preis-/Leistung:</TH><TD ALIGN=CENTER>3</TD>
</TR>
<TR>
    <TD COLSPAN="4"></TD>
</TR>
<TR>
    <TH COLSPAN="2">Gesamt:</TH><TD COLSPAN=2 ALIGN=CENTER>4</TD>
</TR>
<TR>
    <TD COLSPAN="4"></TD>
</TR>
<TR>
    <TD COLSPAN="4">Village Tronic Marketing GmbH, M&uuml;hlenstr. 2, 31157 Sarstedt, Tel.:  05066 701318, EMail: <A HREF="mailto:support@village.de">support@village.de</A></TD>
</TR>
</TABLE>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812bjc.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../cc/9812bas.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


