<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - Gesund am Computer</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Gesund am Computer</H1>von<BR><A HREF="mailto:T.Heinrich@t-online.de">Thomas Heinrich</A></DIV>


                       <H2 ALIGN="CENTER">...oder doch krank am Computer ?</H2>

<P>Wenn der geliebte Rechner Zuhause auf dem Schreibtisch vor sich hinsummt,
glaubt man kaum, daﬂ ein groﬂes Gef&auml;hrdungspotential f&uuml;r die Gesundheit
darinsteckt. Solange man eine akute Erkrankung nicht direkt auf den
Computer zur&uuml;ckf&uuml;hren kann, entwickelt sich kein Bewuﬂtsein f&uuml;r die
Gefahren. Dabei sind viele Effekte schon lange erforscht und nachgewiesen.</P>

<P>Ein jeder hat schon einmal nach einer l&auml;ngeren intensiven Computersitzung
&quot;angestrengte Augen&quot; oder sogar Schmerzen in Schultern oder R&uuml;cken gehabt.
Vielleicht sogar Kopfschmerzen. Aber diese Symptome treten auch bei zu
viel Fernsehgenuﬂ auf, also kein Grund zur Sorge. Oder doch?</P>

<P><B>Dauerbelastungen</B></P>

<P>Diese Ph&auml;nomene w&auml;ren harmlos, wenn sie nur ab und zu auftreten w&uuml;rden.
Aber der Computer fesselt uns regelm&auml;ﬂig mehrere Tage in der Woche, f&uuml;r
mehrere Stunden, in einer relativ starren Haltung auf den Stuhl. Er
fordert uns h&ouml;chste Aufmerksamkeit ab, &uuml;bersch&uuml;ttet uns mit Bildern und
T&ouml;nen, und beeinfluﬂt so unsere Wahrnehmung. Er hat Auswirkungen auf
unsere Psyche und Physis, also den Geist und den K&ouml;rper.</P>

<P><B>Die psychischen Belastungen</B></P>

<P>Im Dezember 1997 konnten die Japaner und die ganze Welt einen
interessanten Effekt unserer Medienwelt erleben. Hunderte von Kindern
muﬂten in den Krankenh&auml;usern wegen Epilepsie-&auml;hnlichen Symptomen behandelt
werden. Die Fernsehserie &quot;Pocket Monsters&quot; hatte bei einigen der
zuschauenden Kinder durch eine schnelle Folge vom Farbwechseln die
Wahrnehmung &uuml;berreizt. F&uuml;r das Gehirn gibt es dann zwei Arten zu
reagieren: Entweder es schaltet ab, man wird ohnm&auml;chtig, oder, wie hier
geschehen, es verliert die Kontrolle und die Nervenzentren werden
unkontrolliert stimuliert: Epilepsie.</P>

<P>Dies war nat&uuml;rlich, trotz der hohen Medienwirksamkeit, kein groﬂer
Vorfall, denn um diese Symptome auszul&ouml;sen, m&uuml;ssen einige Faktoren
zusammenkommen. Zum einen muﬂ das Gehirn schon stark stimuliert sein,
zum Beispiel durch koffeinhaltige Getr&auml;nke, und die Aufmerksamkeit muﬂ
v&ouml;llig auf den Schirm gerichtet sein.</P>

<P>Jetzt vergleichen Sie dies mit Ihrer t&auml;glichen Computerarbeit. Haben Sie
nicht auch eine Tasse Kaffee oder Tee neben sich stehen? Konzentrieren
Sie sich nicht auch so auf die Bildschirmarbeit, daﬂ Sie die Welt um sich
herum vergessen? Sind die Farb- und Helligkeitswechsel bei Ihrem neuen
Ballerspiel extrem schnell und schmerzen in den Augen, wenn Sie l&auml;nger
hinsehen?</P>

<P>Auch wenn Sie eine stabile Psyche haben und dies verkraften, einen
sozialen Effekt hat das trotzdem. Wenn Sie vor dem Rechner sitzen, sind
Sie meistens allein. Ihre Freunde sitzen vielleicht ebenfalls vor den
eigenen Computern und man trifft sich im Internet auf einen Chat. Aber
ist das wirklich Ihr Freund, mit dem Sie sich unterhalten? Chatpartner
sind trotz Nicknames und eMail-Adresse anonym.</P>

<P>Als weitere Folge vernachl&auml;ssigen Sie Ihre Umgebung: Sie r&auml;umen weniger
oft auf, putzen weniger oft, reden weniger oft mit Ihrer Familie.
Vielleicht werden Sie zum &quot;Couchpotato&quot;, einer unf&ouml;rmig aufgequollenen
Figur von zu viel fettem Essen und zu wenig Bewegung. Damit sind schon
einige Grundlagen gegeben f&uuml;r die physischen Belastungen.</P>

<P><B>Die physischen Belastungen</B></P>

<P>Leiden Sie sowieso schon an &Uuml;bergewicht, das nicht erblich bedingt ist,
auch wenn Sie es sich noch so oft einreden, dann hilft Bewegung. Glauben
Sie mir, ich weiﬂ, wovon ich rede. &Uuml;berwindet man den inneren Schweinehund,
was zugegeben sehr schwer ist, kann man alleine mit Bewegung und bewuﬂtem
(nicht &quot;weniger&quot;!) Essen sehr viel erreichen. Lassen Sie sich dagegen vom
Computer an Ihren Sessel fesseln, haben Sie schlechte Karten. Oder besser
gesagt, Ihr R&uuml;cken. </P>

<P>Am Computer geht heute nichts mehr ohne Augen. Sie sind das oberste
Kontroll- und Informationsorgan, wenn man am Computer sitzt. Flimmernde
Monitore und schlechte, unergonomische Grafikeigenschaften (wie definitiv
die eingebaute Amigagrafik) setzen uns sehr zu, ohne daﬂ wir es gleich
merken. Typisch sind Kopfschmerzen, ein verspannter Nacken infolge
verkrampfter Haltung, die immer dann auftritt, wenn man sich beim Lesen
anspannen muﬂ, und allgemeine R&uuml;ckenschmerzen, die aus der Verkrampfung
resultieren. Auf Dauer entwickeln sich sogar schwere Haltungssch&auml;den, wie
z.B. ein Hohlkreuz.</P>

<P>Damit sind die Belastungen auf die Wirbels&auml;ule &uuml;bergegangen und der Spaﬂ
h&ouml;rt auf. Eine Verformung der Wirbels&auml;ule tritt bei Erwachsenen erst im
fortgeschrittenen Alter auf, wenn die Bandscheiben schrumpfen und alles ein
wenig zusammensackt. Durch Fehlbelastungen, wie sie beim verkrampften
Sitzen vor dem Computer auftreten, haben Sie sich bald die Voraussetzungen
f&uuml;r einen Bandscheibenvorfall aufgebaut. Typischerweise tritt der
allerdings nicht vor dem Computer ein, sondern erst, wenn Sie sich mal
wieder bewegen und das auf eine ungesunde Art, z.B. beim Einsteigen ins
Auto, oder wenn Sie sich b&uuml;cken. </P>

<P>&Uuml;berhaupt ist das falsche Sitzen verantwortlich f&uuml;r die meisten Sch&auml;den,
die den R&uuml;cken, Gelenke oder Muskeln betreffen. Wenn Sie total unbeweglich
und starr, oder v&ouml;llig verrenkt und zappelig sitzen, dann machen Sie etwas
falsch.</P>

<P>Eine weitere typische Computerkrankheit, um die es etwas still geworden
ist, ist &quot;RSI&quot;. Diese &quot;Repetetive Strain Injury&quot; (Verletzung durch
wiederholte [und ungewohnte] Anspannung) hat mehrere Symptome. Es ist im
wesentlichen eine Mischung aus Gelenkschmerzen, Sehnenscheidenentz&uuml;ndung
und Nackenverspannung. Durch schnelles, langanhaltendes Tippen am Computer
ohne Pause k&ouml;nnen Nerven im ganzen Oberk&ouml;rperbereich &uuml;berreizt werden und
sich entz&uuml;nden. Kuriert man dies nicht aus, wird es chronisch und man hat
das Krankheitsbild RSI.</P>

<P>Zu guter letzt ist der Computer ganz einfach auch giftig. Viele Teile des
Rechners und des Zubeh&ouml;rs sind aus Kunststoff, die mit Weichmachern und
Flammschutzmitteln versetzt sind. Diese gasen im Laufe der Zeit aus und
wirken auf den Organismus ein. Allein sind sie nicht allzu gef&auml;hrlich,
auﬂer f&uuml;r Allergiker, aber im Haushalt sammeln sich diese Stoffe an, durch
M&ouml;bel, andere Elektroger&auml;te und sogar durch die Baumaterialien des Hauses
selbst.</P>

<P><B>Was kann man tun?</B></P>

<P>WICHTIG: Wenn Sie meinen, eine Gesundheitsbeeintr&auml;chtigung durch den
Computer erlitten zu haben, suchen sie zuerst und m&ouml;glichst bald Ihren
Arzt auf. Nehmen Sie nichts auf die leichte Schulter, ganz besonders dann
nicht, wenn Sie irgendeine Art von Schmerzen haben. Wenn Ihr Arzt nichts
Ernstes feststellt, fragen Sie ihn oder Ihre Krankenkasse nach
Vorbeugungsmaﬂnahmen, z.B. einem Kursbesuch in der R&uuml;ckenschule.
Scheuen Sie sich nicht, auch ohne Beschwerden einmal daran teilzunehmen.</P>

<P>Sitzen Sie richtig. Auch das k&ouml;nnen Sie bei einem Therapeuten lernen,
meistens bei der R&uuml;ckenschule. Wichtig ist aktives Sitzen, das ein &quot;sich
durchh&auml;ngen lassen&quot; verhindert. Am besten, Sie benutzen nur einen
gepolsterten Hocker zum Sitzen, ohne Lehnen. Da m&uuml;ssen Sie dann fast
zwangsl&auml;ufig richtig sitzen. </P>

<P>Sorgen Sie f&uuml;r viel Bewegung. Entspannend und trainierend sind vor allem
Wanderungen und Schwimmen. Vergessen Sie Radfahren, dies bringt nur f&uuml;r
die Kondition etwas. Erg&auml;nzend zum Wandern und Schwimmen ist es ok.
Zwingen Sie sich dazu, regelm&auml;ﬂig Sport zu treiben, mindestens einmal
die Woche f&uuml;r eine Stunde, besser &ouml;fter. Ein Fitneﬂstudio ist genau das,
was der Name sagt - es trainiert die Fitneﬂ. Von Gesundheit ist da keine
Rede. Erstellen Sie sich Ihren Trainingsplan lieber mit der Krankenkasse,
einem Therapeuten oder Ihrem Arzt. </P>

<P>Wenn Sie so viel an der frischen Luft und unter Leuten sind, l&ouml;sen sich
auch die psychischen Probleme ganz leicht. Unter Umst&auml;nden werden Sie
sogar Ihre Dauerkopfschmerzen auf diese Art los. Ganz bestimmt besser
wird es Ihnen aber gehen, wenn sie sich eine Grafikkarte und einen guten
Monitor g&ouml;nnen. Ab einer Bildwiederholfrequenz von 75 Bildern pro Sekunde
ist die Darstellung nicht mehr gesundheitsgef&auml;hrdend. Vermeiden Sie
unbedingt Leuchtstoffr&ouml;hren oder Energiesparlampen in Ihrem Computerzimmer.
Auch wenn Gl&uuml;hlampen mehr Energie verbrauchen, das Flackern der
elektronischen Leuchten macht den Nutzeffekt des besseren Monitors wieder
zunichte. Siehe auch AmZeiger Ausgabe 6 - 09/98, Hardware/Harte Fakten.</P>

<P>Gegen RSI gibt es sogar ein Amigaprogramm: &quot;RSIBreak1_4&quot; im Aminet unter
&quot;util/misc&quot; und auf der Aminet CD 23. Das Programm tut nichts anderes,
als den Amiga nach einer bestimmten Zeit f&uuml;r einige Minuten zu blockieren,
um eine Schreibpause zu erzwingen. Mit viel Disziplin kann man es auch
ohne Programm versuchen, erfahrungsgem&auml;ﬂ ist die Droge Computer aber
st&auml;rker.</P>

<P>Gegen die Gifte in der Luft hilft ganz einfach regelm&auml;ﬂiges L&uuml;ften, und
nat&uuml;rlich auch ein regelm&auml;ﬂiger Spaziergang. Die teure L&ouml;sung w&auml;re, ohne
Gift zu bauen, aber das k&ouml;nnen sich die wenigsten selbst aussuchen.
Meistens sitzt man irgendwo in einer Mietwohnung oder einer Firma und hat
keinen Einfuﬂ darauf.</P>

<P><B>Unterst&uuml;tzung</B></P>

<P>Viele Krankenkassen haben gute Online-Angebote, mit aktuellen Themen,
wie Zeckenbisse im Fr&uuml;hling, Sonnenschutz im Sommer, oder die richtige
Ern&auml;hrung. Schauen Sie dort unbedingt vorbei, die AOK hat z.B. einen
Medienshop, in dem Sie, f&uuml;r Mitglieder kostenlos, Ratgeberbrosch&uuml;ren
bestellen k&ouml;nnen.</P>

<P><B>Adressen zum Thema</B></P>

<UL>
<LI><A HREF="http://www.aok.de">AOK</A></LI>
<LI><A HREF="http://www.tk-online.de">Techniker Krankenkasse</A></LI>
<LI><A HREF="http://www.barmes.de">Barmer Ersatzkasse</a></LI>
</ul>

<P><B>Fazit</B></P>

<P>Wie Sie sehen, k&ouml;nnen Sie schon mit einfachen Maﬂnahmen, wie regelm&auml;ﬂigen
Spazierg&auml;ngen, einen Groﬂteil der Gefahren, die am Computer lauern,
ausschalten. Wenn Sie Ihren gesunden Menschenverstand einschalten, und
sich selbst kritisch bewerten, sollten Ihnen die n&ouml;tigen Maﬂnahmen nicht
schwerfallen. Nehmen Sie auf jeden Fall die Unterst&uuml;tzung durch Ihre
Krankenkasse an, viele Dinge k&ouml;nnen durch unbefangene Beobachter von
auﬂen besser gel&ouml;st werden. Vermeiden Sie Hausmittel und Selbstmedikation,
sprechen Sie unbedingt zuerst mit dem Arzt. </P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../sw/9812olo.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812bjc.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


