<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. AMIGA gibt Spezifikationen des Amiga One bekannt

»Es erf&uuml;llt uns mit gr&ouml;&szlig;ter Freude, die erste Amiga-Hardware in sechs
Jahren ank&uuml;ndigen zu k&ouml;nnen. Der AmigaOne, unser erstes Consumer-Produkt,
zielt auf den Desktop- und Workstation-Markt. Weitere Produkte werden
folgen, die die M&auml;rkte von Personal Digital Assistants und aufw&auml;rts
abdecken. All diese Produkte werden mit einer einzigen Software laufen,
dem revolution&auml;ren Amiga Digital Environment (DE).

Wir haben die AmigaOne-Spezifikation vor drei Monaten abgeschlossen und mit
dem Namen "Zico" belegt. Es ist eine Spezifikation und nicht ein Produkt,
weil Amiga eine Softwarefirma ist, und nicht ein Hardware-Hersteller. Die
M&ouml;glichkeit des Amiga DE, auf unterschiedlichen Hardware- und
Betriebssystemen-Plattformen zu laufen, befreit uns von
Hardware-Abh&auml;ngigkeit und gibt unseren Partnern und Kunden die Freiheit,
die Hardware auszusuchen, die ihrem Bedarf und Geschmack am Besten
entspricht.

Die Zico-Spezifikation sieht folgenderma&szlig;en aus:

- Ein Amiga DE-freundlicher Host-Processor (PPC, x86, Arm, SH4, MIPS)
- 64MB+ RAM
- Matrox-Grafikkarte der n&auml;chsten Generation
- Creative EMU10K1-basierte Soundkarte
- 10 GB+ Festplatte
- CD/DVD
- USB 1.0
- Firewire
- 10/100 Mbps Ethernet
- 56k-Modem
- Zus&auml;tzliche PCI-Slots f&uuml;r Erweiterbarkeit

Zur Fertigstellung der Spezifikationsphase des AmigaOne kontaktierten wir
mehrere angesehene Hardwarefirmen, um interessierte Partner zur
Herstellung von AmigaOne-Produkten auszuw&auml;hlen.

Das AmigaOne-Verfahren beinhaltet enge Zusammenarbeit zwischen Amiga und
den Hardware-Abteilungen unserer Partner, die Lauff&auml;higkeit von Amiga DE
auf der Hardware, und schie&szlig;lich eine strenge Qualit&auml;ts-Zertifizierung des
fertigen Produkts. Nur dann darf ein Produkt den Namen AmigaOne tragen.

W&auml;hrend wir uns noch in Detailverhandlungen mit mehreren Unternehmen
befinden, sind wir erfreut, die erste Partnerfirma und ihre erste Reihe von
AmigaOne-Produkten anzuk&uuml;ndigen.

Eyetech Group Ltd, aus Stokesley, UK, hat bereits einen hervorragenden Ruf
in der Amiga Community. Sie haben viel geleistet, um den Amiga durch die
vergangenen f&uuml;nf Jahre am Leben zu erhalten, und wir sind &Uuml;berzeugt, da&szlig;
diese Erfahrung unsch&auml;tzbar sein wird in der Erschaffung der der ersten
neuen Amigas und dem &Uuml;bergang vom Classic zur naechsten Generation.

Amigas Pr&auml;sident Bill McEwen kommentierte: "Diese Vereinbarung basiert auf
und erweitert unsere bestehende Partnerschaft mit Eyetech, die wir zuerst
im April dieses Jahres ank&uuml;ndigten. Unsere Erfahrung w&auml;hrend dieser Zeit
zeigte, da&szlig; Eyetech eine ernstzunehmende Firma und in der Lage ist,
rechtzeitig zu liefern was sie verspricht, und diese Einsch&auml;tzung wog
schwer in unserer Wahl eines Hardware-Partners f&uuml;r den PowerPC-basierten
AmigaOne."

Alan Redhouse, Managing Director von Eyetech (UK), sagte: "Ich bin
hocherfreut dar&uuml;ber, da&szlig; wir auf unsere bestehende Partnerschaft mit Amiga
aufbauen und unsere enge Arbeitsgemeinschaft sowohl in Entwicklung als auch
Produktion vertiefen k&ouml;nnen. Unser Jahrzehnt Amiga-Erfahrung und unsere
Anstrengungen sowohl in Hardware als auch Software bedeuten, da&szlig; wir in der
Lage sind, mit Amiga zusammenzuarbeiten, um Amiga-Anwendern eine erprobte
Upgrade-L&ouml;sung zu liefern, welche ihren bestehenden 'Classic'-Anwendungen
einen unmittelbaren und substantiellen Leistungsvorteil verschafft, und
dabei gleichzeitig vollst&auml;ndige Vorw&auml;rtskompatibilit&auml;t mit dem neuen Amiga
DE gew&auml;hrleistet. Unsere Arbeit an der Predator-Produktreihe bedeutet, da&szlig;
wir Amiga helfen k&ouml;nnen, die Notwendigkeit der Maximierung des Nutzens der
bestehenden Community zu erf&uuml;llen, w&auml;hrend diese voranschreitet."

Fleecy Moss, Entwicklungschef von Amiga Inc, sagt: "Nach Gespr&auml;chen mit den
Entwicklern mehrerer Hardware-Hersteller bin ich &uuml;berzeugt, da&szlig; die
Zusammenarbeit mit Eyetech uns erlaubt, eine elegante L&ouml;sung anzubieten,
die gleichzeitig eine exzellente R&uuml;ckw&auml;rtskompatibilit&auml;t und eine
machtvolle Basis f&uuml;r das neue Amiga Digital Environment darstellt. Unsere
wichtigste Forderung war, dass jene Amiga-Anwender, die bedeutende Mengen
Geld investiert haben, um beim Amiga zu bleiben, nicht im Stich gelassen
w&uuml;rden. Man kann es nicht immer allen recht machen, aber wir denken, da&szlig;
wir zu einer Gruppe von Produkten und L&ouml;sungen gefunden haben, die ein
L&auml;cheln auf so viele Gesichter wie m&ouml;glich zaubern werden."

Eyetech konzentriert sich auf einen unmittelbaren Bedarf im Amiga-Markt.
Viele haben bedeutende Summen in ihre Classic Amigas investiert, sowohl was
Hardware als auch Software betrifft. W&auml;hrend sie mit dem AmigaOne
voranschreiten m&ouml;chten, wollen sie auch optimalen Nutzen aus ihren
Investitionen in die Classic-Plattform ziehen.

Der AmigaOne PPC 1200 ist ein Custom-Board basierend auf Eyetech
Predator-Technologie und der Zico-Spezifikation, um eine perfektes
Zusammenspiel von Classic und n&auml;chster Generation zu schaffen. Es verf&uuml;gt
&uuml;ber jegliche Funktionalit&auml;t des Standalone-AmigaOne PPC, wurde jedoch
erweitert, um sich mit dem Classic Amiga A1200 zu vereinigen. Das erlaubt
Kunden, die viel in ihren Classic Amiga investiert haben, diesen weiterhin
zu nutzen, w&auml;hrend ihnen gleichzeitig ein brandneuer Amiga zur Verf&uuml;gung
steht. Der 68k-Prozessor im A1200 wird auf deutlich h&ouml;herem Niveau vom PPC
des AmigaOne emuliert werden, w&auml;hrend das Classic-Betriebssystem von den
Vorteilen der Hardware-Resourcen der n&auml;chsten Generation im AmigaOne
Gebrauch machen kann.

Der AmigaOne PPC A4000 ist &auml;hnlich ausgelegt, so da&szlig; auch Kunden, die hohe
Werte in einen A4000 gesteckt haben, f&auml;hig sind, diese Investition
weiterzuf&uuml;hren und gleichzeitig von den neuen M&ouml;glichkeiten des AmigaOne zu
profitieren.

Der Eyetech AmigaOne PPC 1200 wird Besitzern von A1200-Computern im
Towergeh&auml;use als Upgrade zur Verf&uuml;gung stehen, der Eyetech AmigaOne PPC
A4000 als Upgrade f&uuml;r Amiga 4000 Desktop-Computer im Umbau-Towergeh&auml;use.
M&ouml;glichkeiten zur Produktion von AmigaOne Upgrade-Kits f&uuml;r andere Classic
Amiga-Varianten (etwa den A3000 oder den Amiga International A4000T) werden
wir bei entsprechender Nachfrage nach Verf&uuml;gbarkeit der A1200- und
A4000-Produkte in Erw&auml;gung ziehen.

Um alle Eigenschaften der AmigaOne-Spezifikation zu implementieren, werden
die A1200- und A4000-Upgrade-Versionen mit einem AGP- und sechs PCI-Slots
ausgestattet werden, ebenso mit einem durch einen G3/G4-CPU-Slot (wie beim
Macintosh) f&uuml;r vom Anwender durchf&uuml;hrbare CPU-Upgrades, bis zu 512 MByte
SDRAM und eine schnelle IDE/ATAPI-Schnittstelle. Diese Systeme verf&uuml;gen
&uuml;ber eine Dual-Boot-Eigenschaft, die sowohl den Betrieb unter Amiga DE als
auch die Classic Amiga Workbench erm&ouml;glicht. Diese letzte Eigenschaft
erlaubt dem K&auml;ufer dabei die Nutzung der vollen Geschwindigkeit des
G3/G4-Prozessors und von bis zu 512 MByte RAM zum Betrieb von Classic
Amiga-Software. Beide Boards sind als lieferbar ab 1Q2001 vorgesehen, wobei
Entwicklerversionen schon ab Dezember 2000 zur Verf&uuml;gung stehen sollten.

Der Entwurf sowohl des Eyetech AmigaOne PPC A1200 als auch des
A4000-Produkts geschah mit gro&szlig;er Sensibilit&auml;t f&uuml;r die bestehende Anwender-
und Entwickler-Community.

"Dadurch, da&szlig; wir die Classic-kompatiblen AmigaOne-Produkte zuerst auf den
Markt bringen", sagte Alan Redhouse, "schaffen wir einen Weg des &Uuml;bergangs
f&uuml;r die existierende Community, erm&ouml;glichen ihnen, ihre Investitionen zu
erhalten, w&auml;hrend sie gleichzeitig den Sprung nach vorn machen mit dem
neuen Amiga DE."

Um diesen &Uuml;bergang zu erleichtern, wird au&szlig;erdem die Lebenserwartung des
Classic Amiga-Betriebssystems verl&auml;ngert. OS3.9, voraussichtlich noch vor
Weihnachten erh&auml;ltlich, wird eine F&uuml;lle neuer Funktionen und Eigenschaften
mit sich bringen und auf Eyetech AmigaOne PPC-Classic-Produkten laufen.

Eyetech ist ebenfalls interessiert, sich mit anderen Hardware-Herstellern
&uuml;ber M&ouml;glichkeiten der Lizenzierung, Produktion und andere Arten der
Zusammenarbeit zu unterhalten, um so einen gl&uuml;cklichen &Uuml;bergang der
bestehenden Amiga Community von der Gegenwart in die Zukunft
sicherzustellen.

Amiga steht au&szlig;erdem kurz vor Abschlu&szlig; von Vertr&auml;gen mit Partnern f&uuml;r einen
eigenst&auml;ndigen AmigaOne. Dieser AmigaOne im ATX-Format wurde zum Betrieb
der Consumer-Vollversion des Amiga Digital Environment (DE) entworfen und
erlaubt sowohl den Betrieb der besten Classic Amiga-Software, die zur
Nutzung unter dem Amiga DE portiert wurde, wie auch einer gro&szlig;en Auswahl
Amiga DE-basierter digitaler Inhalte - wie etwa B&uuml;ro-Anwendungen,
Multimedia-Werkzeugen, Entwicklungsumgebungen und 3D-Spielen - 'out of the
box'.

All diese Arbeit - einschlie&szlig;lich intensiver Pr&uuml;fung der Hardware- und
Software-Komponenten - planen wir rechtzeitig fertigzustellen f&uuml;r die
Auslieferung von Endkunden-Produkten im 3. Quartal 2001. Amiga Inc steht
zur Zeit in Verhandlung mit weiteren m&ouml;glichen Partnern zur Entwicklung und
Herstellung des Standalone-AmigaOne und der zugeh&ouml;rigen Software. An der
Produktion dieser ebenfalls auf der PPC-Prozessorfamilie aufbauenden
Version interessierte Firmen sind unter anderen Eyetech und bplan GmbH aus
Deutschland. Wir hoffen, weitere Einzelheiten dazu in den n&auml;chsten Wochen
bekanntgeben zu k&ouml;nnen. Andere Firmen und Prozessoren sind ebenfalls im
Gespr&auml;ch.

Eine neue WebSite ist in Vorbereitung, insbesondere um eine zentrale
Anlaufstelle f&uuml;r News, Fragen, Kommentare und Diskussionen um den AmigaOne
zu bieten, und wir laden jeden ein, diese zu besuchen und teilzunehmen.«

(Quelle: AMIGA, Inc.)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
