<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Neuigkeiten von Haage & Partner

Haage & Partner (http://www.haage-partner.com) informiert:

»29. September 2000: H&P erwirbt die Rechte an STFax und Genesis

Active Technologies und H&P haben die Vereinbarung getroffen, da&szlig; die 
Vertriebsrechte der Faxsoftware STFax Professional und der Internetsoftware 
Genesis von H&P &uuml;bernommen werden. STFax und Genesis sind strategisch 
wichtige Produkte f&uuml;r H&P und bereits n&auml;chste Woche wird es das n&auml;chste 
Update von STFax geben.
http://haage-partner.com/news/news_20000928_d.htm


10. Oktober 2000: PageStream 4.08c verf&uuml;gbar

Registrierte Kunden k&ouml;nnen jetzt das neue Update downloaden.
http://haage-partner.com/pgs/pgs-index-d.htm


10. Oktober 2000: Neue Hypercom-Treiber

VMC hat neue Hypercom-Treiber online gestellt, die viele Verbesserungen 
bieten sollen, wie z.B. die IOBlix Software-Emulation. Dieses bietet neue 
M&ouml;glichkeiten bei der Nutzung des paralellen Ports der Hypercom, wie z.B. 
Scanner- und Zip-Support &uuml;ber Scanquix bzw. &uuml;ber das ioblixzip.device. Die 
Treiber gibt auf der VMC Webseite http://www.vmc.de


13. Oktober 2000: Neue ImageFX-Angebote

In einer zeitlich begrenzten Aktion bieten wir alle ImageFX-Pakete (auch 
alle Updates) inklusive der PPC-Erweiterung PowerStation an. Einen 
&Uuml;berblick &uuml;ber alle Angebote finden Sie in der Pressemeldung:
http://haage-partner.com/news/news_20001014_d.htm


13. Oktober 2000: STFax 4.5 verf&uuml;gbar

Nachdem wir den Vertrieb f&uuml;r STFax &uuml;bernommen haben ist auch gleich eine 
neue Version erschienen. Diese unterst&uuml;tzt nun die ELSA Office-Modems. 
N&auml;heres dazu finden Sie in der Pressemeldung:
http://haage-partner.com/news/news_20001013_d.htm


18. Oktober 2000: ImageFX-Handbuch

Endlich ist es soweit: Der Poweruser Gunnar Gertzen hat das 
ImageFX-Handbuch vollst&auml;ndig ins Deutsche &uuml;bersetzt. Das Buch umfa&szlig;t sowohl 
das schwarze Originalhandbuch, als auch alle Erg&auml;nzungen bis zur Version 
4.1. Es ist ein richtig dicker W&auml;lzer mit insgesamt &uuml;ber 400 Seiten 
geworden. Das Buch wird Ende Oktober erscheinen und kann schon jetzt zum 
Sonderpreis vorbestellt werden.
http://haage-partner.com/news/news_20001014_d.htm


25. Oktober 2000: AmigaOS 3.9 angek&uuml;ndigt

Sicherlich f&uuml;r viele &uuml;berraschend hat Amiga Inc. auf der diesj&auml;hrigen ACE 
2000 in Australien nicht nur weitere Details zum AmigaONE ver&ouml;ffentlicht, 
sondern auch ein neues AmigaOS f&uuml;r die jetzigen Amigas angek&uuml;ndigt. Wie 
schon bei OS 3.5 wird auch das AmigaOS 3.9 von H&P entwickelt. Weitere 
Details gibt es in K&uuml;rze.
http://www.amiga.com/corporate/102100-mcewen.shtml


25. Oktober 2000: Wir sind schon 5

Nein - nicht 5 Leute, sondern 5 Jahre ist unsere Firma H&P schon alt. Ja, 
wir k&ouml;nnen es manchmal selbst nicht glauben, dass es schon so lange her ist 
als sich Jochen Becher, J&uuml;rgen Haage und Markus Nerding beim Notar das 
"Ja"-Wort gaben ;-) Wir wollen uns bei allen Amiga-Usern bedanken, die uns 
w&auml;hrend dieser Zeit unterst&uuml;tzt haben. Es war uns immer eine gro&szlig;e Freude 
gewesen :)


25. Oktober 2000: Weitere Mitarbeiter gesucht

F&uuml;r bestimmte Supportaufgaben und verschiedene kleinere bis mittlere 
Projekte suchen wir noch erfahrene Mitarbeiter f&uuml;r die Bereiche 
Genesis-Support, Webprogrammierung, AmigaWriter-Support, PageStream-Support 
und allgemeine Programmierer.
http://haage-partner.com/misc/wanted_d.htm


25. Oktober 2000: ArtEffect Workshop jetzt zum Downloaden

Der beliebte Workshop, der in 12 Kapiteln die interessantesten Funktionen 
und Effekte von ArtEffect vorgestellt, ist jetzt auch als Archiv zum 
Downloaden verf&uuml;gbar.
http://haage-partner.com/download-d.htm


25. Oktober 2000: VMC wieder unter www.vmc.de erreichbar

Die Firma VMC ist ab sofort wieder unter der bekannten Adresse www.vmc.de 
erreichbar.


26. Oktober 2000: Update der PowerPC World

Nach einer l&auml;ngeren Pause hat Stefan Funke wieder ein Update der PPC 
World-Seiten erstellt.
http://haage-partner.com/ppcworld/index-d.htm«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
