<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Abschlie&szlig;end
------------

Noch ein Jahr Warten?

Diesen Eindruck k&ouml;nnten die in den letzten Wochen von AMIGA gemachten 
Ank&uuml;ndigungen vermitteln, ist darin doch von einer "Auslieferung von 
Endkunden-Produkten im 3. Quartal 2001" die Rede. Was vielleicht nicht 
jedem klar ist: Dies bezieht sich auf die AmigaOne-Produkte, also die 
Erweiterungskarten von Eyetech sowie den Stand-Alone-PowerPC-Rechner, 
jedoch nicht auf das AmigaDE. Was ich damit sagen will: Es ist keineswegs 
ausgemachte Sache, dass das neue Amiga-Betriebssystem erst Mitte/Ende 2001 
in einer Endkundenversion erh&auml;ltlich sein wird. Wer plant, sich einen x86-
Computer oder gar eine Internet-Set-Top-Box zu kaufen, wird das AmigaDE 
meiner Einsch&auml;tzung nach bereits in der ersten Jahresh&auml;lfte verwenden 
k&ouml;nnen.
Denn es ist etwas v&ouml;llig anderes, Erweiterungskarten beziehungsweise einen  
Computer auf PowerPC-Basis oder aber einen x86-Rechner zu produzieren. F&uuml;r 
letzteren existieren Unmengen an fertigen Hardwarekomponenten, die sich 
i.d.R. beliebig kombinieren lassen. Ein PowerPC-Computer jedoch muss erst 
noch entwickelt werden, will man nicht auf die kaum als preisg&uuml;nstig zu 
bezeichnenden Apple-Computer angewiesen sein. Da jedoch die auf dem Markt 
befindlichen Komponenten auf die x86-Architektur ausgerichtet sind, k&ouml;nnte 
es hierbei zu gr&ouml;&szlig;eren Problemen bei der Anpassung und damit zu 
Auslieferungs-Verz&ouml;gerungen kommen, als es PowerPC-Fans recht sein kann.
Dies ist auch ein m&ouml;glicher Grund, warum von den IBM-PowerPC-Boards, die 
vor einiger Zeit h&auml;ufiger als Gespr&auml;chsthema in den Computer-Medien 
auftauchten, mittlerweile praktisch nichts mehr zu h&ouml;ren ist. Aber auch die 
»Amiga-PowerPC-Bilanz« spricht B&auml;nde: In den letzten Jahren wurden von 
verschiedenen Herstellern mindestens sechs PowerPC-Erweiterungen f&uuml;r die 
heutigen Amiga-Modelle angek&uuml;ndigt, aber gerade mal eine hat es auf den 
Markt geschafft: PowerUp von Phase 5. Deshalb betrachte ich es auch 
keineswegs als sicher, dass die von Eyetech geplanten Produkte tats&auml;chlich 
erscheinen werden. Selbst wenn, stellt sich eine wichtige Frage: K&ouml;nnen sie 
das AmigaDE besser ausnutzen als ein »richtiger« neuer Rechner, egal ob auf 
PowerPC- oder x86-Basis? Ich glaube nicht - eher im Gegenteil.
Aber warten wir ab und lassen wir uns &uuml;berraschen. Denn vor dem AmigaDE 
soll noch ein - sicherlich allerletztes - Update des Classic-Amiga-
Betriebssystems erscheinen. Nach Angaben der Amiga Future soll das AmigaOS 
3.9 auf jeden Fall auf der Mitte Dezember von Haage & Partner geplanten 
K&ouml;lner Amiga-Messe zu erwerben sein. Ich frage mich nur, woher man diese 
Gewissheit nimmt. Schlie&szlig;lich kennen wir doch alle die m&ouml;glichen 
Verz&ouml;gerungen im Bereich der Softwareentwicklung, und zudem war bis vor 
Kurzem nur von einem kostenlosen (in erster Linie Bugfix-) Update 
(»BoingBag 2«) die Rede. Deshalb bleibt abzuwarten, ob die Features des OS 
3.9 seinen Preis tats&auml;chlich rechtfertigen.

Aber nichtsdestotrotz, die letzten Wochen haben uns gezeigt: Und es bewegt 
sich doch etwas...


Bis n&auml;chsten Monat,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
