<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. Review: Bubble Heroes
------------------------

Vor etwa zwei Jahren wurde von Bubble Heroes das erste Mal
berichtet. Anf&auml;nglich war jeder begeistert vom kommenden
Spiel, doch dann wurde es relativ still um den Titel und auch
ich glaubte eigentlich nicht mehr, dass er noch erscheint. Dann
ergriff Crystal Interactive Software die Initiative und bot
den Entwicklern von Arcadia Software die Ver&ouml;ffentlichung des
Spiels an. Und nun lag es also diesen Monat in meinem Briefkasten,
und hier folgt auch zugleich der Testbericht.

Bubble Heroes kommt in der bekannten CD-H&uuml;lle mit sp&auml;rlicher
Anleitung daher. Dies muss aber nicht in der Endversion so
sein, da ich ein Testexemplar bekommen habe, welches exklusiv
f&uuml;r die SEAL Amiga Messe hergestellt wurde. Es kann sich also
hier um einen Einzelfall handeln. 

Bevor man das Spiel starten kann, muss man erst eine Installation
durchf&uuml;hren. Diese geht allerdings recht schnell von der Hand,
es sei denn, man f&uuml;hrt eine komplette Installation durch. Dies
ist aber bei Bubble Heroes eigentlich nicht von N&ouml;ten. Die
Installation geht mit dem Commodore Installer recht problemlos
von statten und nach ihr findet man auf seiner Festplatte eine
sauber angelegte 'Bubble Heroes'-Schublade mit Piktogrammen
und allem anderen. Es kann also losgehen.

Nach dem Doppelklick auf das 'Bubble Heroes'-Piktogramm muss
man noch ausw&auml;hlen, welches Ger&auml;t zur Ausgabe des CD-Sounds
verwendet werden soll. Dies sollte bei den meisten Benutzern
das atapi.device sein mit der entsprechenden Einheit (Unit).
Danach startet das Spiel mit einigen sch&ouml;nen Introsequenzen,
die erstaunlich fl&uuml;ssig und farbenfroh erscheinen. Danach
findet man sich im Hauptmen&uuml; wieder.

Hier kann man zwischen verschiedenen Optionen w&auml;hlen, wie
z.B. Zwei-Spieler-Modus oder die Konfiguration des Joysticks/
Joypads. Auch kann man einige Musikeinstellungen vornehmen.
W&auml;hlt man dann den Punkt 'Start' aus, muss man sich noch
zwischen verschiedenen Modi, wie dem Story Modus oder dem
Championship Modus entscheiden. Im Test entscheide ich mich
f&uuml;r den Story Modus.

Nun wird in einigen sch&ouml;nen Bildern mit Animationen einem
die Geschichte des Spieles erz&auml;hlt, welche wie folgt lautet:
Vor langer Zeit gab es mal einen Planeten namens Radya, der
von der K&ouml;nigin Adora und ihren drei Schwestern regiert
wurde. Doch pl&ouml;tzlich tauchten vier vom b&ouml;sen Gonzul
verwaltete Inseln im Himmel auf, mit denen er die Herrschaft
&uuml;ber Radya &uuml;bernehmen m&ouml;chte. Die Geschwister von Adora
wurden von Gonzul auf diesen Inseln eingesperrt. Jetzt
liegt es an dem Spieler sie zu retten. Danach geht es direkt
zum Spiel.

Das Spiel an sich l&auml;sst sich gut mit dem alten BreakOut
vergleichen, nur das Bubble Heroes grafisch viel mehr
her gibt und auch die Umgebung v&ouml;llig anders ist. In
Bubble Heroes schie&szlig;t man also mit verschieden farbigen
runden K&ouml;rpern auf solche im Spielfeld. Immer wenn drei
der selben Farbe aufeinander treffen, zerplatzen sie.
Nun muss man sich beeilen, alle K&ouml;rper im Spielfeld zu
zerst&ouml;ren, da sie nach unten gepresst werden und nicht den
Boden ber&uuml;hren d&uuml;rfen. Hat man alle K&ouml;rper zerst&ouml;rt, 
gelangt man automatisch in die n&auml;chste Runde.

Fazit: Trotz des eher alten Spielprinzips ist Bubble
Heroes ein voller Erfolg. Das Spiel wurde grafisch sehr
liebevoll gestaltet und ist auch technisch kaum zu
&uuml;berbieten. Und in so einer Umgebung, die auch noch
mit CD-Sound und animierten Zwischensequenzen aufwarten
kann, macht einfach jedes Spiel Spa&szlig;. Bubble Heroes ist
also wirklich zu empfehlen und es hat sogar mich mal 
wieder f&uuml;r einige Stunden vor dem Bildschirm gefesselt.
Zu bem&auml;ngeln w&auml;re h&ouml;chstens der mit 89 DM etwas hoch
angesetzte Preis.

Screenshot:
<IMG SRC="../extra/BubbleHeroes1.jpg" ALT="Screenshot">
Screenshot:
<IMG SRC="../extra/BubbleHeroes2.jpg" ALT="Screenshot">

+-------------------------------------------------------------------------+
|  Name:          Bubble Heroes                                           |
|  Hersteller:    ArcadiA, ver&ouml;ffentlicht von Crystal Interactive Software|
|                 http://www.crystal-software.com/, erh&auml;ltlich im Handel  |
|  Preis:         89 DM                                                   |
|  Datentr&auml;ger:   1 CD                                                    |
|  Genre:         Geschicklichkeit       | Spieler: 1 oder 2              |
|  Sprache:       englisch               | Anleitung: englisch            |
|  System:        AGA, 68030, 4MB Fast   | CD-ROM                         |
|                                                                         |
|  Fazit:         Mit Liebe erstelltes Spiel, welches eigentlich jeden    |
|                 begeistern sollte.                                      |
|                                                                         |
|  Wertung:                                                               |
|                             Grafik:     8/10                            |
|                             Sound:      7/10                            |
|                             Handhabung: 8/10                            |
|                             Spielspa&szlig;:  9/10                            |
|                             GESAMT:      80%                            |
+-------------------------------------------------------------------------+

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
