<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Workshops / Hintergrundberichte / Buchvorstellungen
---------------------------------------------------

1. Erfahrungsbericht: Amiga-Einbau in PC-Tower (von Klaus Moddemann)

Wer von uns, der einen A4000 im Desktop-Geh&auml;use hat, w&uuml;nscht sich nicht 
einen gro&szlig;en Tower?
Ich hatte schon mit dem Gedanken gespielt, mir einen Tower von Mikronik 
oder RBM zu kaufen, aber 600 DM nur f&uuml;r ein gr&ouml;&szlig;eres Geh&auml;use und ein paar 
Steckpl&auml;tze mehr, die ich sowieso nicht brauche?? Nein, das konnte es wohl 
nicht sein. Als ich dann im letzten Sommer in einer Maschinenbaufirma meine 
Ausbildung begann, kam mir die Idee, selbst einen Tower zu bauen, bzw. 
einen PC-Tower an meine Freundin anzupassen. Also besorgte ich mir einen 
AT-Bigtower und ging es an.

Noch eines vorweg, bevor man sich f&uuml;r diesen Zweck irgendeinen Tower 
besorgt, sollte man die folgenden Dinge beachten:

1. Ich &uuml;bernehme keine Haftung f&uuml;r irgendwelche Sch&auml;den, die durch diese
   Umbaueinleitung entstehen k&ouml;nnten.
2. Der Umbau basiert auf der Tatsache, dass ein Teil des alten Geh&auml;uses 
   weiterverwendet wird. 
3. Der Tower sollte soviel Platz bieten, dass man das Mainboard
   ca. 4-5cm &uuml;ber dem Bodenblech einbauen kann, damit man zum einen noch    
   die Steckkarten anschrauben und zum anderen den Mouseport noch benutzen  
   kann, 
4. Der Schalter f&uuml;r das Netzteil liegt in der Mitte, neben den 3.5"-        
   Sch&auml;chten, da sonst der oberste 5.25"-Schacht kaum zu benutzen ist.
5. Der Tower sollte bereits eine passende R&uuml;ckwand f&uuml;r ein Standard-PC-     
   Netzteil haben, es sei denn, man hat wie ich Zugang zu CNC-Fr&auml;sen.

Doch nun schreiten wir zur Tat:
Als erstes habe ich alle &uuml;berfl&uuml;ssigen Teile mit einer Flex (oder in 
Fachkreisen auch Schleifhexe oder Trennj&auml;ger genannt ;) ) aus dem Tower 
geschnitten, wie z.B. die alten Halterungen f&uuml;r Steckkarten und eine 
Strebe, die den Einbau behinderte. Dann spannte ich in einen Schraubstock 
ein St&uuml;ck U-Stahl und spannte darauf dann mit einer Schraubzwinge das alte 
Desktop-Geh&auml;use und trennte den Teil f&uuml;r das Netzteil und den LW-Tr&auml;ger ab. 
Was ich nicht getan habe, aber unbedingt zu empfehlen ist, ist auch 
noch ein St&uuml;ck vom senkrechten Teil der Front abzuschneiden, so ungef&auml;hr 
bis dorthin, wo die Halterung f&uuml;r das Daughterboard angeschraubt wird. Dies 
ist n&ouml;tig, da sonst der 3.5"-K&auml;fig nicht eingebaut werden kann, weil eben 
dieses Blech im Weg ist.

Nun kommt die erste "Anprobe", ich habe das alte Geh&auml;use in den Tower 
gelegt, um zu sehen, wie es pa&szlig;t, und um anzuzeichnen, wo ich am Tower 
Teile der R&uuml;ckwand entfernen mu&szlig;. Diese Bereiche habe ich dann angezeichnet 
und dann mit der Flex herausgeschnitten. In meinem Fall mu&szlig;te ich ein St&uuml;ck 
f&uuml;r das alte Geh&auml;use und das neue Netzteil enfernen, da die Bohrungen am 
Tower nicht mit denen des Netzteils ubereinstimmten. Hat man alle nicht 
ben&ouml;tigten Teile herausgetrennt, m&uuml;ssen als n&auml;chstes die Kanten entgratet 
werden, da man sich sonst sehr schlimme Schnittwunden zuziehen kann, dazu 
benutzt man am besten eine kleine 3er-Feile.

Nun pa&szlig;t man das alte Geh&auml;use optimal in den Tower ein und fixiert es mit 
ein oder zwei Schraubzwingen, damit es nicht verrutscht, wenn man es 
befestigt. Man kann es entweder festschrauben, dann mu&szlig; man sich jedoch 
damit abfinden, dass die Schrauben entweder im Innern beim Einbau etwas 
st&ouml;ren oder au&szlig;en eine kleine Verletzungsgefahr darstellen. Die andere 
M&ouml;glichkeit ist, das Geh&auml;use durch Schwei&szlig;en endg&uuml;ltig zu fixieren, was mir 
pers&ouml;nlich am besten gefiel.
Wichtig beim Schwei&szlig;en ist, dass man auf sehr kleinen Stromstufen und auch 
nur sehr kurze N&auml;hte zieht, da sich sonst das ganze Blech verzieht, was 
dann zum einen sehr unsch&ouml;n aussieht und zum anderen die Gefahr besteht, 
dass der Rechner sich nicht mehr einbauen l&auml;sst oder dass man gro&szlig;e L&ouml;cher 
ins Blech brennt. Au&szlig;erdem sollte man das Blech vorher noch etwas mit 
Wasser einspr&uuml;hen, damit sich beim Schwei&szlig;en keine Spritzer auf dem Blech 
festbrennen.

So, wer die R&uuml;ckwand des Towers auch an ein neues Netzteil anpassen muss, 
der schaue sich die Zeichnung an, dort habe ich die Ma&szlig;e f&uuml;r die Bohrungen 
eingetragen. Die eingetragenen Ma&szlig;e beziehen sich nicht auf die 
Bezugskanten des Netzeils, es handelt sich dabei um absolute Ma&szlig;e, die auf 
das Blech zutreffen, wie es f&uuml;r meine Anforderungen passend war. Von den x-
Werten mu&szlig; man 410mm und von den y-Werten 60mm abziehen, dann hat man die 
Ma&szlig;e zu den Bezugskanten des Netzteils. Wenn die Position im Tower 
ermittelt ist, m&uuml;ssen die entsprechenden Werte in X und Y (gemessene Werte 
vom Boden des Geh&auml;uses zu den Bezugskanten des Netzteils) zu den 
Koordinaten addiert werden. Ein Beispiel ist in der Zeichnung leider nicht 
enthalten.

Zeichnung:
<IMG SRC="../extra/Tower.png" ALT="Zeichnung">

Jetzt schneide man ein Blech (ist nur f&uuml;r die, die die R&uuml;ckwand ans 
Netzteil anpassen m&uuml;ssen), das so gro&szlig; ist, dass es die ganze R&uuml;ckwand 
bedeckt, au&szlig;er die Bereiche, wo der Deckel angeschraubt wird, zurecht und 
zeichnet darauf die Positionen f&uuml;r Bohrungen und Ausnehmungen an. Bei den 
rechteckigen Ausnehmungen sollte man am besten auf den Ecken 8mm-L&ouml;cher 
bohren und dann mit einer Stichs&auml;ge das Rechteck ausschneiden. Wer Zugang 
zu einer CNC-Fr&auml;se hat, macht es am besten damit. Ein 3mm starkes Blech 
zurechtschneiden, waagerecht in den Schraubstock spannen, selbst ein 
Programm schreiben oder von einem Kollegen/Bekannten schreiben lassen und 
ausfr&auml;sen. Dabei sollte man dann allerdings einen HSS und keinen HM-Fr&auml;ser 
verwenden, denn die HM's brechen bei Vibrationen ziemlich schnell ab...
;-)) Wichtig bei der Bearbeitung mit einer CNC-Fr&auml;se ist, da&szlig; man das Blech 
100prozentig winklig schneidet, da es sonst im Schraubstock "flattert", 
dadurch brechen die d&uuml;nnen (4mm-) Fr&auml;ser sehr schnell ab.
Wer das alte Netzteil weiterbenutzt, kann einfach das entsprechende St&uuml;ck 
von dem Desktopgeh&auml;use abschneiden und auf die R&uuml;ckseite des Towers 
schrauben/schwei&szlig;en.

Das Blech nach dem S&auml;gen noch schnell entgraten und dann schwei&szlig;t oder 
schraubt man dieses Blech auf die R&uuml;ckwand des Towers.

Jetzt sollte man den Tower gr&uuml;ndlich reinigen und dann lackieren, da er 
sonst rosten w&uuml;rde. Ich habe ihn mit ganz normalem Spr&uuml;hlack aus der Dose 
lackiert.
Jetzt ist der Tower eigentlich auch schon bezugsfertig.


So, wer ein PC-AT-Netzteil verwenden will, so wie ich, der sollte jetzt 
ganz genau aufpassen!!! Wer glaubt, die Pinbelegung durch Messen der 
einzelnen Adern herauszufinden, liegt falsch!! Denn 5V sind nicht gleich 
5V!! Ich habe diesen Fehler gemacht und dabei fast meinen Amiga 4000 
ger&auml;uchert. Das Beste ist, wenn man das neue Netzteil &ouml;ffnet und 
nachschaut, was bei den einzelnen Adern auf der Platine steht, wo sie 
aufgel&ouml;tet wurden. Die Belegung des alten Netzteils ist:

blau (2x) -----&gt;  Masse
gelb      -----&gt;  +5V
rot      -----&gt;  -12V
orange    -----&gt;  +12V
braun     -----&gt;  PowerGood

Was genau es mit dem PowerGood auf sich hat, kann ich nicht sagen, 
allerdings gab es eine entsprechende Leitung auch beim PC-Netzteil, also 
nehme ich an, da&szlig; alle Rechner erst ihre Stromversorgung &uuml;berpr&uuml;fen, denn 
als ich erst eine -5V-Leitung an die PG-Leitung gel&ouml;tet habe, hat der 
Rechner nicht funktioniert.
Hat man dann alle Kabel richtig zusammengel&ouml;tet, kann der erste Testlauf 
starten.

Worte des Danks:

Dank an Christian Becker, Du hast mir Beine gemacht die Sache selbst zu 
erledigen...
Dank an Hans-J&ouml;rg K&uuml;per f&uuml;r das CNC-Programm, es hat genau gepasst...
Dank an Oskar Sterzenbach f&uuml;r Ihre Nachsicht...

Und Dank an alle, die ich hier nicht aufgez&auml;hlt habe, die mir geholfen 
haben, das Projekt zu verwirklichen (ich wei&szlig;, klingt bescheuert).

Wer Fragen hat, wende sich bitte an folgende Adresse:

Klaus Moddemann
Samberg 3
48629 Metelen

klaus@mlnet.de
ICQ #25089397

Klaus Moddemann &lt;Elfmagier@gmx.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
