<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>At Vance: Heart Of Steel</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">At Vance: Heart Of Steel</font></center></h1></P>

<p>1999 geh&#246;rten At Vance zu den Newcomern des Jahres und konnten von ihrem
gutklassigen Debutalbum &quot;No Escape&quot; weltweit immerhin knapp 15.000 Einheiten
absetzen. Sicherlich war der gebotene Melodic Metal aus der Schnittmenge
Silver Mountain, Malmsteen sowie den alten Stratovarius
zu keinem Zeitpunkt
besonders innovativ und auch nicht jeder Song war ein Volltreffer, aber die
musikalische Richtung stimmte schonmal und man war sich einig, da&#223; die Band
noch zu mehr f&#228;hig ist. Das diese These stimmte, beweist der Nachfolger
&quot;Heart Of Steel&quot;, in dem sich die Band gereifter, kompakter und erfahrener
zeigt und ein durchweg qualitativ hochwertiges Melodic Metal Album abliefert,
bei dem man Aussetzer vergeblich sucht, eindrucksvoll. Insbesondere S&#228;nger Oliver Hartmann zeigt sich deutlich variabler als auf dem Debut und mausert sich zu einem wirklich guten S&#228;nger und vermag durch die Bank zu &#252;berzeugen.
Wie nicht anders zu erwarten war, tritt die Band bei &quot;Soldiers Of Time&quot; und
&quot;King Of Your Dreams&quot; ordentlich auf`s Gaspedal, wohingegen St&#252;cke wie der
Titeltrack oder die &#228;u&#223;erst eing&#228;ngigen Nummern &quot;The Brave And The Strong&quot;
und &quot;Good Bye&quot;
einen kleinen Tick gem&#228;&#223;igter, aber dennoch sehr dr&#252;ckend aus den Boxen
dr&#246;hnen. Und dann w&#228;re da noch der rasante Rausschmei&#223;er &quot;Don`t You Believe A Stranger&quot;, die
G&#228;nsehautballade &quot;Princess Of The Night&quot; sowie die obligatorische, sehr
ungew&#246;hnliche Coverversion: Hatten es At Vance schon auf dem Debutalbum
&quot;gewagt&quot;, &quot;Money, Money&quot; der Pop Sternchen ABBA zu covern, so hat man
sich auf &quot;Heart Of Steel&quot; &quot;S.O.S.&quot; eben dieser Formation angenommen und in
ein metallernes Gewand gepresst. Die Meinungen werden hierbei
wahrscheinlich stark auseinandergehen, aber zumindest ich finde, da&#223; die Nummer recht witzig umgesetzt wurde
und f&#252;r den einen oder anderen Partygag d&#252;rfte die Metalversion von &quot;S.O.S.&quot;
auch taugen. Aber selbst wenn man &quot;S.O.S.&quot; nicht mag, so kann man immer noch
auf das bereits erw&#228;hnte weitere erstklassige Material auf diesem Silberling
zur&#252;ckgreifen und sich daran erfreuen. Somit ergibt sich insgesamt ein sehr
positives Bild und macht &quot;Heart Of Steel&quot; zu einem empfehlenswerten Album im
Bereich des Melodic Power Metal, wobei noch zu erw&#228;hnen ist, da&#223;
Ausnahmegitarrist Olaf Lenk diesesmal sogar auf alzu verspielte Soloeinlagen
verzichtet hat, was der allgemeinen Qualit&#228;t sicherlich gut getan hat -
lediglich im instrumentalen Outro zeigt er, was er so auf dem Kasten hat und
das ist wirklich Spitzenklasse. Fans des Debutalbums m&#252;ssen hier einfach
blind zugreifen und alle anderen sollten die CD zumindest mal antesten. Good
Job!</P>

<p>Fazit: 8.5 von 10 Punkten</P><center>
<p><img src="kit.gif"></P>
<p><img src="cd1.jpg"></P>
<p><img src="kit.gif"></P></Center>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
