<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, Axel Rudi Pell, Masquerade, Ball">
<title>Axel Rudi Pell: The Masquerade Ball</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">Axel Rudi Pell: The Masquerade Ball</Font></center></h1></P>

<p>Nachdem der gute Axel Rudi Pell 1998 das hervorragende &quot;Oceans Of Time&quot; auf
die Menschheit losgelassen hatte und damit ausschlie&#223;lich gute Resonanzen
einfuhr, war es nicht weiter verwunderlich, da&#223; der eingeschlagene musikalische Weg
auch auf dem neuen Album &quot;The Masquerade Ball&quot; weiter verfolgt werden w&#252;rde. &#220;berraschungen konnte man also
von vornherein ausschlie&#223;en, aber dennoch bietet &quot;The Masquerade Ball&quot; mit
der Uriah Heep (!) Coverversion &quot;July Morning&quot;, die hervorragend umgesetzt
wurde, derrer einer - ich denke, nicht viele h&#228;tten mit einer Coverversion
auf diesem neuen Album gerechnet (und dann noch Uriah Heep...). 
Die anderen 9 Tracks bewegen sich dagegen aber auf bekanntem
Terrain - sprich: melodi&#246;ser Metal- und sind allesamt Highlights. Neben den
beiden Power Kompositionen &quot;Earls Of Black&quot; und &quot;Tear Down The Walls&quot; ist
vor allem noch der mit einer Hard Rock Schlagseite ausgestattet Stampfer
&quot;Voodoo Nights&quot; sowie die Halbballade &quot;The Temple Of The Holy&quot;
hervorhebenswert. Auch das fetzige &quot;Hot Wheels&quot; kann auf Anhieb begeistern
und ist nur einer der Ohrw&#252;rmer auf &quot;The Masquerade Ball&quot;. Beim
spielerischen stimmt beim bekennenden Blackmore J&#252;nger nat&#252;rlich auch alles
und g&#252;tigerweise erspaarte uns Axel Rudi Pell, im Gegensatz zu seinem
Kollegen Malmsteen, alzu ausufernde Solospielereien, die dem Songmaterial
bestimmt nicht dienlich gewesen w&#228;ren. So ist alles &#228;u&#223;erst eing&#228;ngig und setzt sich schon zum gro&#223;en Teil beim ersten Durchlauf fest.
Was den Rest der Band angeht: Wie man
unschwer auf &quot;Oceans Of Time&quot; erkennen konnte, geh&#246;ren diese ebenfalls zur
europ&#228;ischen Spitzenklasse, wobei besonders Goldkehlchen Johnny Gioeli den
Songs mit seiner aussergew&#246;hnlichen Stimme noch das I-T&#252;pfelchen aufsetzt
und sowohl h&#228;rte Passagen wie auch ruhigere St&#252;cke einwandfrei und
begeisternd intoniert. 
Der Wechsel hinter den Drums - f&#252;r J&#246;rg Michael (Stratovarius) kam Mike
Terrana (u.a. Rage, Squealer, Roland Grapow) - ist dabei nur noch eine
Formsache gewesen, da sich wohl mitlerweile herumgesprochen haben d&#252;rfte,
was f&#252;r ein Meisterdrummer Mike Terrana ist. Bleibt also ein insgesamt
wieder einmal hervorragendes Album &#252;brig, das ein w&#252;rdiger Nachfolger zu
&quot;Oceans Of Time&quot; ist und Fans des ehemaligen Steeler Gitarristen unter
Garantie nicht entt&#228;uschen wird. Und wer sich beeilt, kann noch die
limitierte Version im Pappschuber, der ein Poster beiliegt (no comment!), ergattern. Top!</P>

<p>Fazit: 9.5 von 10 Punkten</P><center>
<p><img src="kit.gif"></P>
<p><img src="cd2.jpg"></P>
<p><img src="kit.gif"></P></Center>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
