<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, Brainstorm, Ambiguity">
<title>Brainstorm: Ambiguity</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">Brainstorm: Ambiguity</font></h1></center></P>

<p>Das nunmehr dritte Album von Brainstorm, &quot;Ambiguity&quot;, f&#228;ngt da an, wo man seinerzeit mit dem genialen &quot;Unholy&quot; (1998) aufgeh&#246;rt hatte - allerdings mit dem Unterschied, da&#223; man mit Andy B. Franck von Symphorce einen neuen S&#228;nger gefunden hat, der den zu Metalium abgewanderten Henne Basse fabelhaft ersetzt. Zwar ist nicht ganz klar, ob dieses Line-up konstant bleiben wird, aber das ist ja jetzt, wo die neue Scheibe endlich da ist, auch ziemlich nebens&#228;chlich. Wie oben schon erw&#228;hnt, hat sich musikalisch nicht viel bei Brainstorm ge&#228;ndet, auch wenn man auf  &quot;Ambiguity&quot; deutlich eigenst&#228;ndiger klingt als noch auf &quot;Unholy&quot;: So liefert man mit &quot;Crush Depth&quot; z.B. einen etwas ungew&#246;hnlichen Opener ab, der gut und gerne auch auf Priest`s &quot;Jugulator&quot; Album h&#228;tte stehen k&#246;nnen und zumindest mir nicht so 100%ig gef&#228;llt. Sei es drum, denn das restliche Material h&#228;lt noch zahlreiche Highlights 
bereit: Neben dem schnellen &quot;Tear Down The Walls&quot; k&#246;nnen vor allem noch das eing&#228;ngige &quot;Lost Unseen&quot; sowie das un&#252;berh&#246;rbar an Helloween angelehnte &quot;Perception Of Life&quot; (diese Nummer k&#246;nnte auch auf &quot;Unholy&quot; stehen!) &#252;berzeugen. Dazu gibt`s auch eine superbe Ballade mit dem Titel &quot;Far Away&quot; und zumindest ich h&#228;tte der Band ein solches, unter die Haut gehende St&#252;ck Musik nicht unbedingt zugetraut. Der Bonustrack &quot;Revenant&quot;, der nur der limitierten Erstauflage beiliegt, haut mich zwar ebenfalls nicht um, wartet aber zu Beginn mit Trash Metal (!) Einfl&#252;ssen auf und wirkt daher mehr als untypisch f&#252;r Brainstorm und d&#252;rfte Fans der Band nicht derma&#223;en vom Hocker hauen. Entsch&#228;digt wird man daf&#252;r aber mit den beiden Oberh&#228;mmern &quot;Arena&quot; und &quot;Beyond My Destiny&quot;, die die Band in H&#246;chstform pr&#228;sentieren. Wenn man also mal von den zwei schachen Nummern auf 
&quot;Ambiguity&quot; absieht, so ist Brainstorm mit diesem Album wieder einmal ein absoluter Volltreffer gelungen, der sicherlich zu den besten bisher ver&#246;ffentlichten (melodischen) Power Metal Alben des Jahres geh&#246;rt und Fans dieses Genres blind empfohlen werden kann. F&#252;r die tontechnische Veredelung zeichnete sich &#252;brigens mal wieder das Duo Dirk Schl&#228;chter (Gamma Ray) &amp; Sascha Paeth (Heavens Gate) verantwortlich, die ihren Job erwartunsgem&#228;&#223; hervorragend erf&#252;llten. Bleibt nur zu hoffen, da&#223; Brainstorm damit endlich den l&#228;ngst verdienten Durchbruch auf breiter Basis schaffen und nicht alzu schnell wieder mit Problemen bez&#252;glich des Line-up`s konfrontiert werden. Verdient h&#228;tten sie es allemal...</P>

<p>Fazit: 9 von 10 Punkten</P><center>
<p><img src="kit.gif"></P>
<p><img src="cd3.jpg"></P>
<p><img src="kit.gif"></P></Center>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
