<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, Heavenly, Kai Hansen, Coming From The Sky">
<title>Heavenly: Coming From The Sky</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><font color="green"><h1>Heavenly: Coming From The Sky</Font></h1></center></P>

<p>Die Entstehungsgeschichte dieses Debuts ist etwas merkw&#252;rdig: So hat der
bekannte deutsche Label Noise Records vor einiger Zeit einige Soundfiles von
anonymen Bands auf ihrer Homepage zum Anh&#246;ren angeboten und damit
gleichzeitig eine Umfrage &#252;ber die beste dieser unbekannten Band gestartet. Die blutjungen
Newcomer von Heavenly standen bald mit einem riesigen Abstand auf Platz 1
und begeisterten die freiwilligen Tester mit Helloween &#228;hnlicher Musik auf breiter Basis - ein Deal war die Folge und
in kurzer Zeit war &quot;Coming To The Sky&quot; eingeh&#228;mmert, wobei den Newcomern
noch tatkr&#228;ftige Unterst&#252;tzung von Kai Hansen (Gamma Ray), Thomas Nack (Iron
Savior; ex-Gamma Ray) und Piet Sielck (Iron Savior) zuteil wurde - letzterer
zeichnet sich u.a. auch f&#252;r die Produktion verantwortlich. Wenn man sich das so
anh&#246;rt kann ja eigentlich nix mehr schiefgehen, aber leider ist &quot;Coming From
The Sky&quot; nicht ganz so der erwartete Kn&#252;ller geworden. Spielerisch haben die
Jungs sicherlich einiges auf dem Kasten und auch S&#228;nger Bon Sotto ist
sicherlich alles andere als ein Anf&#228;nger, aber der vorgetragene melodi&#246;se
Power Metal der Marke Gamma Ray, (&#228;ltere) Helloween oder HammerFall wirkt
selbst nach dem x-ten Durchlauf zu unspektakul&#228;r um Begeisterungsst&#252;rme
hervorzurufen. Viel zu offensichtlich hat man bei den gro&#223;en Vorbildern
geklaut und sich nur selten eigenst&#228;ndig gezeigt. Mit &quot;Time Machine&quot;, auf
dem sich Piet Sielck und Kai Hansen am Mikro die Ehre geben, und dem
eing&#228;ngigen &quot;Million Ways&quot; sind zwar zwei Songs vorhanden, die man
lobenswert hervorheben kann, aber f&#252;r ein regul&#228;res Album ist das einfach
zu wenig. Das restliche Material ist zwar ebenfalls nett mit anzuh&#246;ren und Langeweile macht sich auch nicht breit, aber
der wirkliche &quot;Aha&quot; Effekt bleibt aus und h&#228;ngen bleibt im Grunde auch nicht
viel. Das tut mir zwar einerseits f&#252;r die Jungs leid, aber wenn wir ehrlich
sind, m&#252;ssen wir zugeben, da&#223; eine Band wie Heavenly vor dem gro&#223;en Revival
des True / Power Metals niemals gesignt worden w&#228;ren - positive Ans&#228;tze sind zwar
vorhanden, aber noch ausbauf&#228;hig. Das richt also alles nach einem
Schnellschuss, den man durchaus h&#228;tte vermeiden k&#246;nne, wenn man Heavenly
noch etwas mehr Zeit f&#252;r das Songwriting gelassen h&#228;tte - die in der vorletzten
Ausgabe vorgestellten Iron Fire zeigen, wie man es h&#228;tte besser machen
k&#246;nnen. 
Die Hard Fans von Gamma Ray &amp; Co. k&#246;nnen
hier zwar aufgrund der Mitwirkung von Kai Hansen zugreifen, wirklich empfehlen kann ich Euch dieses Opus aber
nicht. Fader Durchschnitt!</P>

<p>Fazit: 5.5 von 10 Punkten<Center></P>

<p><img src="kit.gif"></P>
<p><img src="cd4.jpg"></P>
<p><img src="kit.gif"></P></Center>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
