<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, Savatage, TSO, trans, siberian, orchestra">
<title>Trans-Siberian Orchestra</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">Trans-Siberian Orchestra: Beethoven`s Last Night</font></center></h1></P>

<p>In Amerika ist dieses Sideprojekt der beiden Savatage Chefdenker Jon Olivia
und Paul O`Neil mehr als nur erfolgreich und die beiden Vorg&#228;nger &quot;The
Christmas Eve&quot; und &quot;The Christams Atic&quot;, die beide eine Weihnachtsgeschichte
zur Grundlage hatten, verkauften sich dort hervorragend. Umso
verwunderlicher, da&#223; alle CD`s dieses Projektes in Europa nur als teurer Import
erh&#228;ltlich sind. Nicht anders verh&#228;lt es sich auch mit &quot;Beethoven`s Last
Night&quot;, dem nunmehr dritten Opus, der zudem zum ersten mal mit einer
Handlung ausserhalb des Themas &quot;Weihnachten&quot; aufwarten kann. Um genauer zu sein geht es um Beethoven`s 10. Symphonie, die
er bekanntlich niemals geschrieben hat und um die herum das Duo Olivia /
O`Neil eine interessante Geschichte gekreiert haben, die musikalisch
entsprechend umgesetzt wurde. Das ganze ist schlie&#223;lich in eine wahre Rock
Oper ausgeufert, bei der alleine 9 Lead S&#228;nger (!), ein ganzer Kinder Chor,
zahlreiche Klassikmusiker sowie eine weitere Handvoll an Background S&#228;ngern
zum Einsatz kommen. Die h&#228;rtere musikalische Seite wird gr&#246;&#223;tenteils von der Savatage
Crew sowie einigen weiteren Musikern &#252;bernommen, die ihren Job auch
hervorragend gemeistert haben. Die musikalische Seite nun zu beschreiben ist
nicht einfach, denn &quot;Beethoven`s Last Night&quot; will in keine bekannten
Schubladen passen und deckt s&#228;mtliche Rock Bereiche sowie den klassischen
Metal Bereich ab und wartet zudem mit zahlreichen klassischen Themen (u.a.
von Mozart &amp; Beethoven) auf, die sich wie ein roter Faden durch die CD
ziehen. Auch die typischen, von Savatage bekannten, mehrstimmigen Passagen
sind stark auf &quot;Beethoven`s Last Night&quot; vertreten und zeigen eindrucksvoll,
wozu die Musiker f&#228;hig sind. Einen der 22 Tracks hervorzuheben ist praktisch
unm&#246;glich, da man das Werk (ca. 75 Minuten) an einem St&#252;ck h&#246;ren muss um es
nachzuvollziehen. Insbesondere durch die vielen S&#228;nger (u.a. mit Jon Olivia am Mikro)
ergibt sich ein
breites Spektrum an verschiedenem musikalischen Material, welches sich &#252;ber
sanftere Kl&#228;nge (&quot;A Final Dream&quot;), klassisch angehauchte St&#252;cke (&quot;Requiem
(The Fifth)&quot;) bis hin zu h&#228;rteren (Savatge-like) T&#246;nen (&quot;Mephistopheles&quot;,
&quot;Misery&quot;) erstreckt. Abgerundet wird die Rock Oper durch einige
Instrumentalpassagen, die dem ganzen noch den letzten Schliff geben und die d&#252;stere Atmosph&#228;re, die das Album aufbaut, noch verst&#228;rken.
Auch wenn es sich bei &quot;Beethoven`s Last Night&quot; nur noch im weiteren Sinne um
ein Metal Album handelt, so ist es f&#252;r mich schon jetzt ein zuk&#252;nftiger
Klassiker und ein Anw&#228;rter auf das Album des Jahres. Zwar muss man etwas
toleranter eingestellt sein, aber wer die beiden anderen TOS Alben mochte
oder Fan von neueren Werken von Savatage (&quot;Wake Of Magellan&quot;, &quot;Dead Winter
Dead&quot;) ist, der sollte sich &quot;Beethoven`s Last Night&quot; auf keinen Fall
entgehen lassen. Es ist wirklich ein richtig gutes Album geworden, auf das
zudem der vielbenutzte Begriff &quot;Kunst&quot; zutrifft und das, im Gegensatz zu 95
% aller heutigen Ver&#246;ffentlichungen, wirklichen Tiefgang bietet. Nur schade,
da&#223; es als US Import etwas teurer (ab 45 DM; u.a. per Mailorder bei Rising
Sun) ist als gew&#246;nliche CD`s, aber &quot;Beethoven`s Last Night&quot; ist jede Mark
wert. </P>

<p>Fazit: 10 von 10 Punkten</P><Center>
<p><img src="kit.gif"></P>
<p><img src="cd5.jpg"></P>
<p><img src="kit.gif"></P></Center>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
