<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais">
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="red">Newsflash</font></center></h1></P>

<ul><p><li> Mit <b>Sacred Reich</B> hat sich k&#252;rzlich eine der bekannteren Old School Trash
Metal Bands aufgel&#246;st. Bedingt durch einige kreative Durststrecken sowie
anderweitigen Verpflichtungen der Bandmembers, war die Aufl&#246;sung
unumg&#228;nglich.</li></P><br>

<li><P>In Sachen Band Aufl&#246;sungen gibt`s aber auch was positives zu berichten:
So ist mitlerweile in den F&#228;llen von <b>Misfits</B> und <b>Riot</B> Entwarnung gegeben
worden und beide Bands werden, entgegen &#228;lterer Meldungen, nun doch weiter
machen. Die gecancelte Dio Tour erkl&#228;rt <b>Riot</B> Bandchef Mark Reale &#252;brigens
damit, da&#223; die Kosten falsch kalkuliert worden sind. Im Sommer soll es
wieder auf Tour gehen und mit dem Songwriting haben die Jungs auch schon
wieder begonnen.</LI></P><br>

<li><p> Bei <b>Danzig</B> hat`s auch mal wieder gekracht: Bassist Josh Lazie ist nicht
mehr im Line-up und wurde mitlerweile durch Howie Pyro (ex-<b>D Generation</B>)
ersetzt. Genaue Gr&#252;nde wurden nicht angegeben, aber angeblich soll die
Trennung friedlich verlaufen sein, was nur schwer zu glauben ist, wenn man
bedenkt, was f&#252;r &#196;rger es in der Vergangenheit immer wieder bei Split`s rund
um <b>Danzig</B> gegeben hat...</LI></P><br>

<li><p><b> Pegazus</B> haben anscheinend momentan auch recht wenig Gl&#252;ck: Nachdem sich nach
dem Release von &quot;Breaking The Chains&quot; erst Goldkehlchen Danny Cecati
bei den True Metallern verabschiedet hatte,
hat nun auch Bassist Corey Betts seine Koffer gepackt. F&#252;r beide konnte bisher
noch kein Ersatz gefunden werden und wir wollen nicht hoffen, da&#223; die
sympathischen True Metaller jetzt in der Versenkung verschwinden. Beide
ex-Members haben mitlerweile schon wieder neue Band gefunden und man darf
gespannt sein, was da in Zukunft noch so kommt.</LI></P><br>

<li><p> Bei <b>Hades</B> geht`s momentan drunter und dr&#252;ber: Erst kehrte Ex-Basser Jimmy
Schulman vor kurzem wieder zur Band zur&#252;ck und nun ist Drummer Dave
Lescinsky nicht mehr mit von der Partie. Das bisher unbeschriebene Blatt
Adam Kiefer wird seinen Job bei <b>Hades</B> &#252;bernhemen.</LI></P><br>

<li><p><b> Rage</B> wollen uns im September mit einer B-Seiten / Rarit&#228;ten Compilation
erfreuen und auch f&#252;r`s Jahr 2001 haben sich die Jungs einiges vorgenommen:
So will man anfang ds n&#228;chsten Jahres wieder mit den Arbeiten zum n&#228;chsten
Album beginnen und anl&#228;sslich des 15-j&#228;hrigen Bandjubil&#228;ums soll es sowohl
ein Live Album als auch ein Live Video geben.</LI></P><br>

<li><p> Wie auf der Tour mit <b>Stratovarius &amp; Sonata Arctica</B> schon zu bemerken war,
haben sich die Jungs von <b>Rhapsody</B> mit Drummer Alex Holzwarth (ex-<b>Sieges Even</B>)
sowie Gitarrist Dominique Leurquin (ex-<b>Dream Child</B>) Verst&#228;rkung besorgt, die
auf dem f&#252;r Oktober angedachten neuen Album zu h&#246;ren sein sollen.</LI></P><br>

<li><p> Die Prog. Metaller von <b>Rush</B> wollen im Oktober ihr 17. Album aufnehmen,
welches wohl irgendwann im Sommer 2001 erscheinen wird. Nach dreij&#228;hriger
Auszeit aus privaten Gr&#252;nden, d&#252;rfen sich die Fans also wieder auf Material
der G&#246;tter freuen.</LI></P><br>

<li><p> Momentan steckt <b>Bruce Dickinson (Iron Maiden)</B> zwar noch hoffnungslos im
Terminkalender von <b>Iron Maiden</B> fest, aber laut Aussage von seinem
langj&#228;hrigen Weggef&#228;hrten &amp; Producer <b>Roy Z</B> arbeitet der S&#228;nger bereits an
Material f&#252;r den &quot;The Chemical Wedding&quot; Nachfolger, zu dem auch <b>Roy Z</B> wieder
fleissig Material beisteuern wird. Ganze 5 Nummern stehen schon und das
Album soll noch extremer als &quot;The Chemical Wedding&quot; klingen und somit sind
wir mal gespannt, was der Ausnahmes&#228;nger auf seinem sechsten regul&#228;ren
Soloalbum so zu bieten hat. Ein Releasedatum wurde aber noch nicht genannt.</LI></P><br>

<li><p> Der monatliche Reunion Wahn nimmt kein Ende: Dieses mal sind <b>Britny Foxx</B>
dran, die demn&#228;chste eine Live Platte unter das kaufw&#252;tige Volk bringen
wollen. Wer`s braucht...</LI></P><br>

<li><p><b> Primal Fear</B> haben ihren Vertrag bei Nuclear Blast &#252;ber weitere 4 Alben
verl&#228;ngert und wollen im Anschluss an die Sommer Festivals wieder in`s
Studio gehen, um ihre neue Langrille mit dem Arbeitstitel &quot;Nuclear Fire&quot;
aufzunehmen, auf dem zum ersten mal auch der neue Gitarrist Henny Wolter
(<b>Sinner</B>) zu h&#246;ren sein wird, der Tom Naumann ersetzt.</LI></P><br>

<li><p> Das neue Album der Melodic Metaller <b>Narnia</B> ist jetzt endg&#252;ltig im Kasten
und erscheint gegen Ende August. Weitere Info`s sind aber noch nicht
bekannt.</LI></P><br>

<li><p> Nach einer bisher sehr erfolgreichen Tour planen <b>U.D.O.</B> eine Live Album,
welches in Russland mitgeschnitten werden soll. Anschlie&#223;end werden die Jungs
noch einige Festivals besuchen und wer Frontman <b>Udo Dirkschneider
(ex-Accept)</B> kennt, der wei&#223;, da&#223; man sich auf etwas ganz besodneres gefasst
machen kann.</LI></P><br>

<li><p><b> Dismal Euphony</B> haben ihr Line-up mit Keyboarder Axel Henriksen und Bassist
Erlend Caspersen endlich wieder vervollst&#228;ndigt und entern demn&#228;chst das
Studio, um einen neuen Longplayer einzuh&#228;mmern.</LI></P><br>

<li><p><b> Lock Up</B> haben einen neuen S&#228;nger und zwar Thomas, der vorher bei <b>At The
Gates</B> in Lohn und Brot stand. <b>Peter T&#228;gtren</B> (u.a. Hypocrisy &amp; Pain sowie
Producer von unz&#228;hligen Bands, u.a. Destruction), der das Album eingesungen
hatte, konnte aufgrund anderweitiger Verpflichtungen die geplante Tour nicht
in seinen Terminkalender einbauen, so da&#223; Ersatz notwendig war.</LI></P><br>

<li><p><b> The Kovenant</B> wurden mit dem norwegischen Grammy in der Kategorie &quot;Beste
Hard Rock Band&quot; ausgezeichnet. Herzlichen Gl&#252;ckwunsch!</LI></P><br>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
