<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, Guardian, Blind, Tales From The Twilight World">
<title>Oldie Review: Blind Guardian`s Tales From The Twilight World</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="white">Oldie Review: Blind Guardian`s Tales From The Twilight World</font></center></h1></P>

<p>Heutzutage wird es wohl kaum noch Metal Freaks geben, die den Namen Blind
Guardian nicht kennen, da es dieser Band, trotz riesiger Verkausferfoge,
gelungen ist, ihre Roots niemals zu vergessen, sondern ihren Stil immer
weiter zu verfeinern und auszubauen und damit die breite Masse der Metalfans
anzusprechen. Mit dem letzten Konzeptalbum &quot;Nightfall In Middle-Earth&quot;
konnte man zudem auch ausserhalb der Metal Gemeinde den einen oder anderen
Erfolg verbuchen, was wohl f&#252;r sich spricht.</P>

<p>Angefangen haben Blind Guardian aber seinerzeit als reine Speed Metal
Kapelle, die sich stark an die damals aufkommende Welle des deutschen Speed
Metals anlehnte, wobei dabei insbesondere die fr&#252;hen Helloween zu nennen
sind. Die ersten beiden Alben &quot;Battalions Of Fear&quot; und &quot;Follow The Blind&quot;
waren zwar keineswegs &#252;bel, &quot;gl&#228;nzten&quot; aber durch eine sehr schwache
Produktion sowie gr&#246;&#223;tenteils unspektakul&#228;rem Material. Das &#228;nderte sich
schlagartig mit dem dritten Album &quot;Tales From The Twilight World&quot;, mit dem
sich die Band zudem auch auf die Suche nach einer eigenen Identit&#228;t machte.
So wurde der Bombast Faktor im Vergleich zu den Vorg&#228;ngern deutlich
gesteigert und die Songstrukturen wurden insgesamt komplexer, ohne dabei
aber an Eing&#228;ngigkeit zu verlieren. Paradebeispiele f&#252;r ohrwurmverd&#228;chtige
Speed Granaten sind sowohl der Opener &quot;Traveler In Time&quot;, das straighte
&quot;Welcome To Dying&quot; sowie &quot;Goodbye My Friend&quot; - allesamt Highlights in der
Karriere von Blind Guardian, die auch heute noch zeitlos sind und
hervorragend r&#252;berkommen. Dazu gibt`s mit &quot;Lord Of The Rings&quot; auch noch eine
ruhigere Nummer (zum ersten mal in der Geschichte der Band) mit Keyboard
Unterst&#252;tzung sowie die gelungene Instrumental Nummer &quot;Weird Dreams&quot;.
Ein ganz besonderes St&#252;ck ist ebenfalls noch auf dieser CD vertreten: &quot;Lost
In The Twilight Hall&quot; geh&#246;rt zwar ebenfalls in die Kategorie
&quot;ohrwurmverd&#228;chtiger Speed Metal&quot; (f&#252;r mich &#252;brigens einer der besten
Tracks, den die Band bisher komponiert hat), kann aber mit Kai Hansen
(Ex-Helloween, Gamma Ray) einen Special Guest aufbieten, der einen Teil der
Vocals im Duett mit Hansi K&#252;rsch singt, was sich extrem gut anh&#246;rt und zudem
stark an das Helloween Debut &quot;Walls Of Jericho&quot; erinnert. Abgerundet wird
die CD noch von einigen weiteren excellenten Numemrn wie &quot;The Last Candle&quot;
sowie einer Live Aufnahme von &quot;Run For The Night&quot;, dessen Originalversion
auf dem Debutalbum &quot;Battalions Of Fear&quot; zu finden war.</P>

<p>Alles in allem haben Blind Guardian mit &quot;Tales From The Twilight World&quot; ein
hervorragendes St&#252;ck Musik abgeliefert, welches seinesgleichen sucht und
sicherlich mit &quot;Walls Of Jericho&quot; (Helloween), &quot;Death Or Glory&quot; (Running
Wild) oder &quot;Heading For Tomorrow&quot; (Gamma Ray) auf eine Stufe gestellt werden
kann. Die Produktion ist ebenfalls astrein und vermag den Songs noch den
letzten Schliff zu geben. Kurzum: Wer &quot;Tales From The Twilight World&quot; nicht
sein eigen nennt, hat eines der besten Alben der German Speed Metal
Welle verpasst und sollte sich jetzt schnell zum CD H&#228;ndler aufmachen. </P>

<p>Fazit: 10 von 10 Punkten</P><center>
<p><img src="kit.gif"></P>
<p><img src="oldie.jpg"></P>
<p><img src="kit.gif"></P></Center>



</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
