<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,balance of power,perfect balance">
<title>Balance Of Power: Perfect Balance</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Balance Of Power: Perfect Balance</font></h1><BR> (52:47 / Massacre)</center></P>

<p>Mit ihren bisher ver&#246;ffentlichten Alben konnten sich die Melodic Metaller von Balance Of Power schon eine ordentliche Fanschaar erspielen und auch die letztj&#228;hrige Tour zusammen mit zwei &#228;hnlichen Acts wie Pink Cream 69 und Axxis konnte als Erfolg verbucht werden. Hinzu kam im letzten Jahr das gelungene Sideprojekt &quot;USM&quot;, welches die Erwartunsghaltung seitens der Fans auf das neue Album noch zus&#228;tzlich vegr&#246;&#223;erte. Mit &quot;Perfect Balance&quot; ist nun endlich der Nachfolger zum superben Vorg&#228;ngeralbum &quot;Ten More Tales...&quot; erschienen, der stilistisch nat&#252;rlich erneut in den bekannten Bahnen - also melodischer Power Metal trifft auf progressive Elemente - schwelgt, wobei sich Balance Of Power nicht wie so viele andere Bands an Helloween, Stratovarius &amp; Co. orintieren, sondern ihr eigenes S&#252;ppchen kochen und eher Acts wie Dream Theater, Queensryche und Crimson Glory ihren Respekt entgegenbringen. So verzaubern Balance Of Power den geneigten Zuh&#246;rer mit brillianten Vocals Arrangements und bravor&#246;sem Gesang, tollen Gitarrenmelodien und der 
F&#228;higkeit, einfach konstruierte Mainstream St&#252;cke mit technisch aufwendigen Finessen zu unterlegen. Ganz klar, die Jungs von Balance Of Power verstehen ihr Handwerk und eing&#228;ngige Songs wie &quot;Shelter Me&quot;, &quot;One Voice&quot; und &quot;Hard Life&quot; sollten jedem Fan wie &#214;l runtergehen. Leider versauen Balance Of Power den amtlichen Rundling mit einer total unpassenden Produktion, in der insbesondere die Drums viel zu weit in den Vordergrund gemischt wurden, was den gutklassigen Songs nicht wirklich f&#246;rderlich ist und was ohne Frage zu Abz&#252;gen in der B-Note f&#252;hrt. Trotz dieses kleinen, aber wirklich sehr &#228;rgerlichen Sch&#246;nheitsfehlers, der einer Band wie Balance Of Power eigentlich nicht passieren d&#252;rfte, ist &quot;Perfect Balance&quot; ein Album geworden, welches die 
Fans der Combo auf der einen Seite zufrieden stellen d&#252;rfte, auf der anderen Seite aber auch daf&#252;r sorgen sollte, dass auch andere Leute - die z.B. Acts wie Dream Theater, Queensryche, Pink Cream 69, Axxis, Pretty Maids etc. verehren - auf diese Band aufmerksam werden.

<p>Fazit: 8 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd1.jpg"></P>
<p><img src="kit.gif"></P>
</Center>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
