<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,supreme majesty,tales of a tragic kingdom">
<title>Supreme Majesty: Tales Of A Tragic Kingdom</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Supreme Majesty: Tales Of A Tragic Kingdom</font></h1><BR>  (45:21 / Massacre)</center></P>

<p>Supreme Majesty d&#252;rften aufgrund ihrer bereits ver&#246;ffentlichten Mini CD bisher lediglich abolsuten Insidern bekannt sein - dieser Zustand wird sich aber wohl hoffentlich mit dem ersten Longplayer der Schweden &#228;ndern, auch wenn die Mukke der Jungs alles andere als originell ist. So zelebrieren die Jungs eine gelungene Mischung aus Stratovarius und Sonata Arctica mit einer leichten Prise old-Helloween und sorgen damit f&#252;r kurzweilige 45 Minuten. Dabei deckt die Band erwartungsgem&#228;&#223; alle Facetten ab und wechselt zwischen flotten Songs wie dem Opener &quot;Strike Like Thunder&quot; und dem nachfolgenden &quot;Not Of This World&quot;, groovenden Midtemponummern der Marke &quot;Let It Go&quot; und balladesk angehauchten St&#252;cken wie &quot;Forever I`ll Be&quot;. Lediglich das nichtssagende &quot;Eye Of The Storm&quot; h&#228;tten sich die Jungs f&#252;r meinen Geschmack klemmen k&#246;nnen. Die Produktion wurde von niemanden geringerem als Fredrik Nordstr&#246;m &#252;bernommen, der mit seiner ganzen Klasse f&#252;r eine druckvolle und transparente Produktion sorgte. Nat&#252;rlich werden sich auch an &quot;Tales Of A Tragic Kingdom&quot; wieder die Geister scheiden und es wird unter Garantie Leute geben, die die Band als &quot;Kopie einer Kopie einer Kopie&quot; bezeichnen und alleine aus diesem Grund (ungeh&#246;rt) in der Luft zerrei&#223;en werden, aber wer diesem gutklassigen Longplayer eine faire Chance gibt, der wird sofort feststellen, dass Supreme Majesty mit einer Begeisterrung an diesen Longplayer gegangen sind, die sich massiv positiv auf die Qualit&#228;t ausgewirkt hat. Fans der angesprochenen Zielgruppe liegen also - trotz der oben bereits erw&#228;hnten fehlenden Eigenst&#228;ndigkeit - bei &quot;Tales Of A Tragic Kingdom&quot; auf jeden Fall richtig und werden schnell merken, dass Supreme Majesty das Potenzial haben, sich im oberen Drittel dieses Genres zu etablieren. Der Einstand ist mit &quot;Tales Of A Tragic Kingdom&quot; auf jeden Fall gelungen und ich bin schon jetzt m&#228;chtig auf die n&#228;chsten Alben dieser Combo gespannt!</P>

<p>Fazit: 8.5 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd8.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
