<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,shadow gallery,carved in stone">
<title>Oldie Review: Shadow Gallery`s Carved In Stone</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><center><h1><font color="#00ff00">Oldie Review: Shadow Gallery`s Carved In Stone</font></h1><br> (71:15 / Magna Carta)</Center><br>

<p>Alle drei Jahre erscheint p&#252;ntklich wie ein Uhrwerk eine neue Platte von Shadow Gallery und ebenso wie man auf die P&#252;nktlichkeit der Jungs setzen kann, kann man sich auch auf die hohe musikalische Qualit&#228;t verlassen. Zumindest waren alle vier bisher ver&#246;ffentlichten Alben der Progressive Metaller von Shadow Gallery absolute Volltreffer, verkauften sich aber in Deutschland - trotz bester Kritiken in der Fachpresse - aufgrund der anspruchsvolleren Ausrichtung eher d&#252;rftig.</P>

<p>Dem 1995 erschienenen Zweitwerk &quot;Carved In Stone&quot; ging es da nicht anders, obwohl es wenig gibt, was man an dieser Platte noch besser h&#228;tte machen k&#246;nnen. Prinzipiell besteht &quot;Carved In Stone&quot; aus 8 verschiedenen Kompositionen, aber auf der CD befinden sich insgesmat 20 Tracks. Die Erkl&#228;rung ist eigentlich recht einfach, befinden sich zwischen den ersten 7 Nummern diverse instrumentale Zwischenpassagen und wurde das letzte, knap 22-min&#252;tige Epos &quot;Ghostship&quot; in diverse Tracks aufgeteilt, obwohl es sich um eine zusammenh&#228;ngende Nummer handelt. Hat man diese kleine Verwirrung &#252;berstanden, kann man sich an den restlichen 7 Meisterwerken erfreuen, die von verspielten, technisch anspruchsvollen und atmosph&#228;rischen Nummern wie dem Opener &quot;Cliffhanger&quot; bis hin zu sich sofort in dem Geh&#246;rgang festsetzenden Kompositionen wie &quot;Deeper  Than Life&quot; reichen. Jede Nummer auf dieser Platte ist f&#252;r sich genommen ein absolutes Highlight, zumal kein St&#252;ck dem anderen &#228;hnelt - Abwechselung pur halt! Dazu ist das ganze technisch auf einem &#228;hnlichen Niveau 
angesiedelt wie Dream Theater und d&#252;rfte Progressive Metal Fans alleine aus diesem Grunde schon vor Freude im Dreieck h&#252;pfen lassen.</P>

<p>Problem an der ganzen Sache ist nur mal wieder die Tatsache, dass anspruchsvolle Musik heutzutage lieber links gelassen wird und ein Gro&#223;teil der Leute gar nicht erst den Versuch unternimmt, ein Album wie &quot;Carved In Stone&quot; auch nur ansatzweise zu verstehen. Eigentlich schade, denn wenn man erstmal in die Tiefen von &quot;Carved In Stone&quot; abgetaucht ist, wird man die Platte in ihrer ganzen Komplexit&#228;t nicht mehr missen wollen. F&#252;r Progressive Metal Fans ist diese Scheibe - genau wie die drei anderen von Shadow Gallery - absoluter Pflichtstoff! </P>
<p>Fazit: 10 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="oldie.jpg"></P>
<p><img src="kit.gif"></P></center>
</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
