<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Neues von AMIGA
---------------

1. AMIGA-Pr&auml;sident Bill McEwen wendet sich an die User

»EXECUTIVE UPDATE
 ----------------

10. M&auml;rz 2000

Liebe Freunde:

H&ouml;rt man auf all die Ger&uuml;chte da drau&szlig;en, dann k&ouml;nnte man glauben, es gibt
uns nicht mehr, wir verprassen das aufgenommene Geld mit H&auml;usern in Hawaii
oder wir machen einfach gar nichts.

Ich kann Ihnen versichern, dass all das nat&uuml;rlich nicht wahr ist. Wie schon
in den bisherigen Mitteilungen gesagt, glauben Sie nichts, was nicht hier
geschrieben steht!

Der Brief dieses Monats wird wirklich sehr ausf&uuml;hrlich werden und ich
entschuldige mich schon im Voraus f&uuml;r seine L&auml;nge. Er enth&auml;lt eine Menge
Informationen, also haben Sie Geduld.


K&uuml;rzlich erhielt ich eine eMail-Nachricht, die meine Aufmerksamkeit auf
eine traurige Wahrheit lenkte.
 
Als Gateway im Jahr 1997 Amiga gekauft hatte, versprachen sie viel,
tats&auml;chlich gab es 6 verschiedene Produkt-Ank&uuml;ndigungen w&auml;hrend ihrer Zeit
als Besitzer. Ich hatte mit zweien davon zu tun, mit QNX und mit Linux.

Obwohl ich glaubte, dass wir Produkte dieser Versionen, an denen ich
beteiligt war, ausliefern w&uuml;rden, wurde das nicht wahr und viele unter
Ihnen f&uuml;hlten sich dadurch sehr verletzt. Es lag nicht in meiner Macht zu
entscheiden, dass diese Ank&uuml;ndigungen ge&auml;ndert oder widerrufen werden, aber
ich geh&ouml;rte zur Mannschaft, die mit Beidem zu tun hatte. Und das Ganze tut
mir aufrichtig leid.

Genau aus diesen Gr&uuml;nden habe ich versprochen, nichts zu sagen und
anzuk&uuml;ndigen, wenn es nicht fertig auf dem Tisch liegt.

Ich verstehe, dass es besonders f&uuml;r alle die gro&szlig;artigen Amiga-Freunde und
Amiga-Firmen sehr schwer ist, den st&auml;ndigen Stress auszuhalten, aber ich
wollte nicht, dass wir alle noch einmal falsche Eins&auml;tze und unerf&uuml;llte
Tr&auml;ume durchstehen m&uuml;ssen.


Der 1. Aprill 2000 ist der Tag und St. Louis ist der Ort!
Es ist die erste Gelegenheit "Ihrer" Amiga-Gesellschaft, sich vor- und
darzustellen, mit ihr zu reden und das von Amiga erzeugte erste Produkt zu
sehen - das neue Developer System, das Entwickler-System. Und ein
gl&uuml;cklicher Besucher dieser Show wird tats&auml;chlich eines dieser Systeme
gewinnen.

Anders gesagt: Noch einen Monat, und eine Menge Arbeit ist erledigt. Auch
wenn viele unter Ihnen glauben, da passiert doch nichts, kann ich Ihnen
versichern, dass wirklich eine Menge erreicht wurde.

Amiga  "So the World May KnowTM"  -  Amiga  "Die Welt soll es erfahren(TM)"

Es wurden einige gro&szlig;e Namen angeworben, viele Partnerschaften wurden
geschlossen und wir haben Fortschritte gemacht. Im Folgenden erfahren Sie
mehr dar&uuml;ber. 


Partnerschaften
---------------

Tao-Gruppe

Am Anfang stand nat&uuml;rlich die Mitteilung unserer Verbindung mit der Tao-
Gruppe, die sich sehr gut weiterentwickelte. In St. Louis werden wir die
erste Runde des Amiga/Tao-System vorstellen. Es muss noch eine Menge Arbeit
geleistet werden, aber wir sind weit genug gekommen, um dort bei der
Ausstellung das neue Entwickler-System f&uuml;r Tao zu starten.


Haage & Partner

Wir sind eine Langzeit-Verbindung mit H&P eingegangen, die APIs und einen
Weg zum zuk&uuml;nftigen OS zur Verf&uuml;gung stellen werden. Eingeschlossen ist
eine neue aufger&uuml;stete Version von Storm IDE. Sie haben sich auch bereit
erkl&auml;rt, ihre gesamte Software auf die neue Plattform zu portieren.

Wir freuen uns auch auf die Zusammenarbeit mit H&P an einer neuen Version
von WarpOS, das es dem neuen AmigaOS erlauben wird auf PPC-Beschleuniger-
Karten zu laufen. Das bedeutet, dass ein Amiga mit PPC-Karte und WarpOS
das neue AmigaOS auf dieser Karte laufen lassen kann! So ist es. Der neue
Amiga, der auf den derzeitigen A1200ern l&auml;uft!

Weitere Neuigkeiten &uuml;ber H&P werden bekannt gegeben, wenn die Entwicklung
weiter geht und wir uns durch die Testprogramme hindurch arbeiten.

Diese Partnerschaft ist f&uuml;r uns sehr anregend.


Hyperion

Hyperion und Amiga haben sich darauf geeinigt, existierende und neue Spiele
auf den neuen Amiga zu portieren. Damit, wie auch mit ihrer Arbeit an einer
neuen 3D-Engine f&uuml;r das Amiga-System, haben Ben und und seine Mannschaft
Gro&szlig;artiges geleistet. Sie haben eng mit der Amiga-Entwicklung und der
Tao-Gruppe zusammengearbeitet, um die Spieleentwicklung f&uuml;r den Amiga
deutlich &uuml;ber alles andere hinaus zu heben. Wir freuen uns, sie als
Mitglieder der neuen Mannschaft dabei zu haben.


Epic Marketing

Thomas Steiding war von Anfang an eine gro&szlig;e Unterst&uuml;tzung f&uuml;r uns. Epic
k&uuml;ndigte an, nicht nur ihre Spiele auf dem neuen System verf&uuml;gbar zu
machen, sondern sie haben sich auch die Rechte an vielen neuen Spielen
gesichert. Mehr &uuml;ber Epic lesen Sie in einer sp&auml;teren Ver&ouml;ffentlichung.


Es bestehen viele weitere Partnerschaften, die in St. Louis neben weiteren
hoch interessanten Mitteilungen bekannt gegeben werden.


E-Mails
-------

Wo soll ich anfangen? Ich erhalte immer noch jeden Tag Hunderte von eMails,
und ich bin nicht der einzige unserer Gruppe, der von eMails eingedeckt
wird. Keiner von uns konnte soviele beantworten, wie er es sich w&uuml;nschte.

Wir interessieren uns f&uuml;r alles und arbeiten an vielen Ihrer Kommentare.
Hier folgen einige Ihrer Bedenken und was wir zur Abhilfe getan haben:


Phase 5 und die derzeitigen Umgestaltungen.

Wir haben uns mit Herrn Thomas Dellert und Herrn Stefan Domeyer in
Verbindung gesetzt. Wir arbeiten sowohl mit DCE wie auch mit Met@box
zusammen, um L&ouml;sungen f&uuml;r den Amiga-Markt zu finden und wir erwarten bald
gute Nachrichten. Ich kann sagen, dass die Unterhaltungen sehr erfolgreich
verliefen und wir auf eine gute Zukunft mit beide Gesellschaften
hinarbeiten.

Etwas, was uns bei den guten Beziehungen, die wir zu diesen beiden Firmen
begr&uuml;nden konnten, besonders freut, ist ihr langj&auml;hriges Festhalten am
Amiga.

Gem&auml;&szlig; unseren ersten Besprechungen und den Projektpl&auml;nen arbeiten wir
daran, dass das neue OS mit Sicherheit auf den PPC-Boards l&auml;uft, die von
den beiden Gesellschaften geliefert werden.

Wir werden weitere Einzeiheiten in den Produktank&uuml;ndigungen beider Firmen
zur Verf&uuml;gung stellen.


H&auml;ndler und Vertriebsfirmen haben sich wegen ihrer derzeitigen Situation
und ihrer Zukunftspl&auml;ne mit uns in Verbindung gesetzt.

Als Antwort auf die vielen Anfragen haben wir das Amiga Dealer Network
"ADN" gegr&uuml;ndet. Randy Hughes, unser Vize-Pr&auml;sident f&uuml;r den Verkauf (sp&auml;ter
mehr &uuml;ber ihn), sandte eine eMail-Nachricht an &uuml;ber 300 H&auml;ndler und der
Erfolg war fantastisch. Viele H&auml;ndler wollen wieder Amiga in ihr Sortiment
aufnehmen und noch mehr sind begeistert &uuml;ber die Zukunftsaussichten. Das
ADN ist unser Weg, um besser &uuml;ber unsere Pl&auml;ne zu sprechen, Bedenken zu
erfahren und zur Begr&uuml;ndung eines st&auml;rkeren Amiga zusammen zu arbeiten.
Ich bin ganz sicher, dass Sie sehen werden, wie das ADN zu gro&szlig;artigen
Ergebnissen f&uuml;hren wird.

Denken Sie daran, dass wir das neue OS auf PPC-Boards laufen lassen wollen.
Unterst&uuml;tzt Ihre Maschine diese M&ouml;glichkeit?


Entwickler und zuk&uuml;nftige Pl&auml;ne f&uuml;r die Entwicklung
---------------------------------------------------

Die &Uuml;bungs-Veranstaltungen bei der Tao-Gruppe dauern nun schon einige
Monate und wir kennen uns heute viel besser als zu Anfang. Wir sind mehr
denn je &uuml;berzeugt, dass unsere Entscheidung richtig war. In St. Louis
werden auch andere die Gelegenheit haben, das Tao-System bei der Arbeit zu
erleben, aber wir erwarten auch, Sie alle dort zu sehen.

Und dar&uuml;ber hinaus werden wir am 31. M&auml;rz um 19.00 Uhr ein Treffen der 
Entwickler in St. Louis abhalten. Es ist ausschlie&szlig;lich f&uuml;r Entwickler
gedacht und wir wollen sie &uuml;ber Hardware, Software-Werkzeuge und das
Programm zur Unterst&uuml;tzungs f&uuml;r Entwickler unterrichten. Wir wissen, dass
gro&szlig;es Interesse an diesem Seminar besteht, deshalb sollten Sie
vorausplanen und rechtzeitig da sein, da der Platz begrenzt ist. 

Bitte informieren Sie sich weiter auf den Internet Sites der St. Louis Show
und von Amiga.


Kommunikation mit der Amiga-Gemeinschaft
----------------------------------------

Wir haben mit Equinox Design vertraglich vereinbart, den neuen Newsletter
"Amiga World" zu schaffen. Er wird frei f&uuml;r die ganze Amiga-Gemeinschaft
zur Verf&uuml;gung gestellt. Zun&auml;chst wird er &uuml;ber das Internet auf unserer
neuen Web Site erscheinen und danach, wenn der Bedarf es rechtfertigt, auch
im Druckformat. Er soll in keiner Weise mit den bestehenden Presse-
Publikationen f&uuml;r den Amiga konkurrieren. Das Nachrichtenblatt ist vielmehr
als Hilfsmittel f&uuml;r die Gemeinschaft gedacht, um sich besser miteinander zu
verst&auml;ndigen. Der Redakteur der "Amiga World" ist Fletcher Haug, der
fr&uuml;here Redakteur und Herausgeber des Amiga Informer. Die erste Ausgabe
sollte innerhalb der ersten beiden April-Wochen zur Verf&uuml;gung stehen.

"Amiga World" wird keine Anzeigen enthalten, wir verwenden ihn als weitere
M&ouml;glichkeit, um Informationen f&uuml;r Sie alle bereit zu stellen und um den
bestehenden Publikationen zu helfen.


Weitere Verbindungen mit der Amiga-Gemeinschaft
-----------------------------------------------

Wie im vergangenen Bericht angedeutet, habe ich den AAC (Amiga Advisory
Council) wieder eingesetzt. Es gab schon einige eingehende Diskussionen und
gro&szlig;artige Ideen entstanden aus den derzeitigen Unterhaltungen. Sie werden
in Zukunft eine wertvolle Hilfe f&uuml;r unsere Fortschritte sein.

Die Mitglieder des AAC sind:
 
Christoph Dietz
Carsten Schroeder
Conor Kerr
Andrew Elia
Bill Panagouleas
Craig Delahoy
Ben Vost
Wayne Hunt
Don Hicks
Goetz Ohnesorge
Gary Peake
Kermit Woodall
Holger Kruse
Thomas Frieden
Juergen Haage
Thomas Raukamp
Heinz Wrobel
Wayne Martin
Thomas Svenson
Jeffery Rose
Randhir Jesrani
Trish Zlotek
Tom Lively
Cade Hannan
Luca Danelon
Guenter Horbach
Ian Greenaway
David Law
Paul Lesurf
Bill McEwen
Christian Kemp
Basil Flinter

In K&uuml;rze werden wir ihre aac.amiga.com eMail-Konten wieder einrichten.


Neue Gesichter in der Mannschaft
--------------------------------

Es sind eine ganze Anzahl neuer Leute bei Amiga und wir freuen uns sehr
&uuml;ber die Mannschaft, die wir da aufbauen. Weiter unten folgen einige
besondere Hinweise zu bestimmten Mitarbeitern, zun&auml;chst lesen Sie aber
Namen und Beschreibungen der Leute, mit denen ich am engsten zusammen
arbeite.


Randall P. Hughes  VP Sales and Strategic Business Development
(Vize-Pr&auml;sident f&uuml;r Verkauf und Strategie der Gesch&auml;fts-Entwicklung)

Randy kam zu uns, nachdem er VP f&uuml;r den Verkauf bei der sehr interessanten
Gesellschaft f&uuml;r Java-Technologie ThinWeb war. Randy und ich arbeiteten
schon zusammen, er war mein erster Kontaktmann bei QNX. Er ist ein sehr
geschickter Fachmann mit Erfahrungen im Bank- und Technologiegesch&auml;ft.
Randy versteht den Amiga und seine Zukunftsaussichten. Er verhandelte
gesch&auml;ftlich mit einigen der st&auml;rksten Technologie-Gesellschaften der
Welt. Er war der Mann, den QNX ausw&auml;hlte, um ihre erste Niederlassung
in Kalifornien zu er&ouml;ffnen. Ich bin sicher, dass Sie sich freuen werden,
ihn in St. Louis kennen zu lernen.

Hier die offiziellen Bemerkungen, die sp&auml;ter auf der Web Site erscheinen
werden:

Mr. Hughes kam zu Amiga direkt von einem jungen auf Java basierenden
Unternehmen, wo er dem Verkauf und den Kontaktfunktionen von Anfang an bis
zum Antrag f&uuml;r IPO (Initial Public Offer = erster B&ouml;rsengang) bei der
NASDAQ exchange (US-Technologieb&ouml;rse) vorstand.

Randy wurde mit der Amiga-Gemeinschaft bekannt, als er als f&uuml;hrender
Manager w&auml;hrend seiner T&auml;tigkeit bei QNX f&uuml;r die Verbindung zu Amiga
zust&auml;ndig war. Bei QNX war er verantwortlich f&uuml;r die Expansion in das
Silicon Valley und in das s&uuml;dliche Kalifornien.

Randy war und ist ein Finanzfachmann seit seinen Tagen bei bekannten
kanadischen Finanzeinrichtungen, n&auml;mlich der Bank of Montreal und der Royal
Bank.

Randys Ausbildung erfolgte an der Universit&auml;t von Ottawa, Kanada, und am
Marlborough College in England.


Vincent P. Pfeifer  VP of Operations (Vize-Pr&auml;sident f&uuml;r den Betrieb)

Vince und ich arbeiteten mehrere Jahre zusammen bei ConnectSoft. Vince hat
eine unglaubliche F&auml;higkeit, Produkte vorzustellen. Ich habe ihn immer
wieder erlebt, wie er in extrem schweren Situationen mit sturen Ingenieuren
und unwissenden Vermarktungsleuten verhandelte und ihnen seine Produkte
brilliant verkaufte. Ich freue mich sehr, dass er einwilligte, zu uns zu
kommen.

Hier seine offizielle Web-Site-Beschreibung:

Vince Pfeifer hat Erfahrungen in der Computer-Industrie seit 14 Jahren,
wobei er die letzten 12 im Software-Bereich zubrachte. Vince kam zu uns
von der GraphOn Corporation, wo er als Vize-Pr&auml;sident f&uuml;r Produkt-
Entwicklung und Hauptverantwortlicher von GraphOns T&auml;tigkeiten im Bereich
von Seattle die gesamten ingenieurtechnischen Mittel f&uuml;r GraphOns
zahlreiche Entwicklungs-Standorte &uuml;berwachte. W&auml;hrend seiner Zeit bei
GraphOn verdreifachten sich die Verk&auml;ufe, die Produktpalette verdoppelte
sich. Dazu half Vince bei der Aufsicht &uuml;ber die Fusion, die GraphOn zu
einer an der B&ouml;rse gehandelten Gesellschaft machte, deren Wert am
Kapitalmarkt sich in weniger als einem Jahr vervierfachte.

Vince hat direkte Erfahrungen im Aufbau und der Verwaltung sowohl in der
Software-Entwicklung wie auch im Produkt-Management. Vince kennt sich
sowohl in Neugr&uuml;ndungen (Connectsoft, Exodus Technologies, GraphOn) wie
auch in mehr etablierten Firmen (Symantec) aus.


Warum ich zu Amiga kam. Von Vincent P. Pfeifer

Nicht so sehr weil ich glaube, Bill McEwen k&ouml;nnte sogar Eisw&uuml;rfel an
Eskimos verkaufen, ging ich zu Amiga, sondern ich stelle mich der
Forderung, den Namen und die Vorstellung einer Firma, die hier in den
Vereinigten Staaten doch recht unbekannt wurde, wieder an die Spitze zu
setzen und die Gesellschaft auf einen geachteten Platz in der
Computerindustrie zu bringen. Da ich aus einer erfolreichen Position als
Vize-Pr&auml;sident f&uuml;r Produktentwicklung komme, in der ich half, GraphOn in
eine an der B&ouml;rse gehandelte Gesellschaft mit Rekordgewinnen zu machen, war
ich bereit, mich neuen Verantwortungen in einem gr&ouml;&szlig;eren Bereich als nur
Produkt-Managment und Technik zu stellen.

Amiga stellt Anforderungen, auf die ich gewartet habe: Aufbau einer
Gesellschaft von Grund auf mit dem Vorteil, dass der Name bekannt und
einige Technologie bereit vorhanden ist.

Das ist eine Gelegenheit, auf die ich seit den Tagen bei 5th Generation
gewartet habe, als ich am Telefon f&uuml;r technischen Support sa&szlig; und dem
durchschnittlichen Anwender zuh&ouml;rte, wie er versuchte, ziemlich
komplizierte Software in Betrieb zu nehmen. Ich wei&szlig;, es h&ouml;rt sich wie ein
Kreuzzug an, aber ich m&ouml;chte die Computer-Anwendung leichter f&uuml;r die
Allgemeinheit machen, und mit meiner Position bei Amiga habe ich die
Gelegenheit, diese Vision ganz deutlich voran zu treiben.


Gary Peake  Director of Developer Relations and Support (Direktor f&uuml;r
die Verbindung zu den Entwicklern und ihre Unterst&uuml;tzung)

Mein bester Mann aus Texas. Gary hat schon tausende Stunden seines Lebens
in die Unterst&uuml;tzung des Amiga und der weltweiten Gemeinschaft gesteckt.
Nun ist er zu unserer Mannschaft gesto&szlig;en, in die er seine Jahre an
Erfahrung und Zuneigung zum Amiga bei der Unterst&uuml;tzung der Bem&uuml;hungen der
Amiga-Gemeinschaft einbringt.


Tarah Mallo  Reception and Office (Empfang und B&uuml;ro)

Tarah steht in der vordersten Linie unserer Verbindung zur Au&szlig;enwelt. Sie
arbeitet mit der Entwicklungsgruppe und sammelt Informationen und Hilfe.
Und sie hilft mir, mich einzurichten. Ich m&ouml;chte klar darauf hinweisen,
dass die Aufnahmen der Original-B&uuml;ror&auml;ume gemacht wurden, "ehe" sie bei uns
eintrat. Begr&uuml;&szlig;en Sie sie mit einem freundlichen "Hello", wenn Sie das
n&auml;chste Mal anrufen.


Kari Erickson  Executive Administration (Verwaltung der Gesch&auml;ftsf&uuml;hrung)

Kari ist die Person, die mein Leben und meine Reisepl&auml;ne in Ordnung halten
wird. Sie sprechen mit ihr, bevor Sie zu mir oder einem anderen Mitglied
der Gesch&auml;ftsleitung durchgereicht werden. Kari kam zu uns, nachdem sie
eine der sehr angesehenen Anwaltsfirmen hier in Seattle verlie&szlig; und ich
bin sicher, dass Sie mit ihr f&uuml;hlen, weil sie es Tag f&uuml;r Tag mit mir zu
tun hat.


Susan Sutton  Director of Finance and Human Resources (Direktor f&uuml;r
Finanzen und Personalverwaltung)

Susan wird das Geld einkassieren und die Rechnungen bezahlen. Sie hat sich
auch mit all den Beschwerden des Personals &uuml;ber Fleecy herum zu &auml;rgern.
Nur ein Scherz - es gibt mehr Beschwerden &uuml;ber mich als &uuml;ber Fleecy.


Gordon Stone  Director of Information Services and Information Technologies
(Direktor f&uuml;r Informations-Dienste und Informations-Technologie)

Wir sprechen &uuml;ber Gordon als unseren Netzwerk-Mann. Gordons erste Ber&uuml;hrung
mit Computern war, als er den Amiga-Speicher f&uuml;r Aufnahme-Studios in
Oregon erweiterte. Inzwischen kennt er zahlreiche Systeme und ist versiert
in Allem, was mit Verbindungen zu tun hat. Gordon wird erst in zwei Wochen
anfangen, wir m&ouml;chten ihn aber schon jetzt vorstellen.


T&auml;tigkeiten in Deutschland - Neue Mitglieder in unserer Mannschaft
------------------------------------------------------------------

Markus Grohmann - Order processing and EDP (Auftragsbearbeitung und EDP)

F&uuml;r Markus ist der Amiga bereits Familiengeschichte, denn sein Bruder
arbeitete mit uns in Braunschweig. Wir freuen uns auf die Zusammenarbeit
mit Markus.


Barbara Nitzsche - Executive Assistant to Petro (Direktions-Assistentin
bei Petro)

Da nun Barbara bei unserem Team in Deutschland ist, werden wir etwas mehr
von Petro haben. Wenn Sie n&auml;chstes Mal in Langen anrufen, sagen Sie "Hallo"
und begr&uuml;&szlig;en Sie Barbara bei Amiga.


Mitglieder der Entwicklungsmannschaft
-------------------------------------
 
Dean Brown - Dean gr&uuml;ndete DKB nur Wochen, nachdem der erste A1000 heraus
kam und brachte die n&auml;chsten 15 Jahre damit zu, alles M&ouml;gliche an Zusatz-
Ger&auml;ten, Erweiterungskarten und Beschleunigern f&uuml;r den gesamten Bereich
der Amiga-Computer zu entwerfen und zu fertigen. Er bringt ein tiefes
Verst&auml;ndnis f&uuml;r den Geist und die Realit&auml;t der Amiga-Hardware sowie ein
fast enzyklop&auml;disches Wissen &uuml;ber derzeitige und zuk&uuml;nftige Projekte mit.
Damit wird er Amiga und seinen Partnern helfen, vielfache Hardware-
Plattformen f&uuml;r die Zukunft zu entwickeln.


Dave Taylor - Dave ist noch ein "scouser" aus Liverpool, UK, allerdings
unterst&uuml;tzt er die falsche Fu&szlig;ballmannschaft. In den letzten zehn Jahren
war er mit der Entwicklung und der Einrichtung von verteilter Fertigung,
Kontrolle und eCommerce-Systemen f&uuml;r kleinere, mittlere und gro&szlig;e Betriebe
rund um den Globus f&uuml;r Mainframes, Unix- und Windows-Architekturen
besch&auml;ftigt. In den letzten 3 Jahren konzentrierte er sich auf verteilte
Systeme, Datenbanken und besondere kommerzielle Systeme. Er bringt
Erfahrungen aus der kommerziellen Welt, eCommerce-Sachverstand und formale
Methoden mit einer erfrischend neuen Sicht der Architektur in die Firma ein
und er war sogar tapfer genug, mit Wouter und mir das Snowboarden
auszuprobieren.


Wouter van Oortmerssen - Wouter ist gro&szlig;, holl&auml;ndisch, Quake-Meister und
macht zur Zeit seinen Doktor an der Southampton University. Er war Amiga-
Fan seit Beginn der 90er Jahre und er ist bestens bekannt f&uuml;r die
ausgezeichnete Amiga-E-Sprache mit Compiler, die sich aus einem
Entwicklungsprojekt in ein professionelles System auswuchs. Er bringt neue
Ansichten bei Sprache, Unterhaltung und Zusammenarbeit in das neue
Amiversum.


Andreas Kleinert - Andreas produzierte in den letzten Jahren Public Domain,
Shareware und kommerzielle Anwendungsprogramme f&uuml;r den Amiga-, PC- und
Unix-Markt. F&uuml;r Amiga konzentrierte Andreas sich auf verschiedene grafische
und "datatype"-Systeme, ehe er die Forderung annahm und leitender
Entwickler f&uuml;r die SuperBase-Produktlinie zur Datenverwaltung wurde. Seine
intensiven Kenntnisse der Datenspeicherung, Datenwiederherstellung und der
Indizierung bieten das Kernwissen, um ein selbstbeschreibendes und
multidimensionales Amiversum zu erzeugen.


Trond Werner Hansen - Some people are leg men, others are face men. Trond
is most definitely a face man - INTERFACE man 8-)

(Anm.d.&Uuml;.: Dieser Satz stellt leider einen un&uuml;bersetzbaren Scherz dar. Er
wird sicher von allen verstanden werden.)

W&auml;hrend der letzten sieben Jahre steigerte er sich von kleinen Programmen
zur Erweiterung der Workbench &uuml;ber die vollst&auml;ndige Neueinrichtung der
layers.library als Superlayers zur Entwicklung eines NG Amiga Workbench-
Systems. Mit Konfigurationsm&ouml;glichkeit und Einfachheit als zentrale 
Eigenschaften f&uuml;r das Amiversum will Trond mithelfen, die Pr&auml;sentation und
Mitwirkung in digitalen Welten neu zu definieren.


Die Mannschaft des Amiga Developer Support Network
--------------------------------------------------

Gary Peake &lt;gpeake@amiga.com&gt;

Gary hat mit den meisten Commodore/Amiga-Computern vom VIC-20 bis zum A3000
gearbeitet und hat sie Beta-getestet. Sein organisatorisches, Entwurfs- und
Test-Geschick ist ein wertvoller Aktivposten, um ein einmaliges vorw&auml;rts
gerichtetes System zur Online-Unterst&uuml;tzung aufzubauen, das viele
"Marksteine" in der Computerindustrie setzen wird. Und seine Verbindung mit
Team Amiga bietet Amiga Inc. die Gelegenheit, einen multinationalen
Spielraum f&uuml;r die Entwickler-Unterst&uuml;tzung zu schaffen. Gary besitzt eine
jahrelange Erfahrung mit Online-Web-Anwendungen und wird seine Kenntnisse
ben&uuml;tzen, um eine sich ausbreitende Struktur zur Unterst&uuml;tzung der
Entwickler zu schaffen, die mit uns und unseren Amiga-Entwicklern wachsen
wird. Gary ist zur Zeit auch Mitarbeiter in der 3D-Entwicklungsgruppe.

Gary wird unsere erste Amiga DevCon (Developers Conference) in St Louis am
Freitag, dem 31. M&auml;rz, betreuen und wird dort danach bis zum 2. April 
individuelle Fragen beantworten. Alle Einzelheiten des Programms k&ouml;nnen
nicht vorher mitgeteilt werden, aber alle Entwickler, die an weiteren
Informationen interessiert sind, sollten sich an Gary Peake bei
gpeake@amiga.com wenden.

Informationen &uuml;ber die Zeit und den Ort der DevCon erhalten Sie durch
Kontakt mit Bob Sharpe bei bscharp@icon-stl.net


Ray A. Akey &lt;rakey@amiga.com&gt;

Von Ray stammt die CNet BBS f&uuml;r den Amiga Classic und er hat f&uuml;r den Amiga
seit einer Reihe von Jahren programmiert. Rays Verst&auml;ndnis aller Bereiche
der Produktentwicklung vom Entwurf &uuml;ber die Codierung und den Test bis zum
endg&uuml;ltigen Produkt erlaubt uns einen einheitlichen &Uuml;berblick &uuml;ber die
Notwendigkeiten der Amiga-Entwickler-Unterst&uuml;tzung. Rays Erfahrung bei der
Programmierung von Internet-Anwendungen wird sich als &auml;u&szlig;erst hilfreich
erweisen. Ray wir an der Betreuung auch einiger der Online-Systeme
teilnehmen, die wir einrichten werden. Ray lebt zur Zeit in Kanada.


G&ouml;tz Ohnesorge &lt;gotz@amiga.com&gt;

G&ouml;tz ist einer der aufmerksamsten Amiga-Freunde, die ich kenne, wenn es
darum geht, die Ecken und Kanten von Produkten und strittigen Fragen 
abzuschleifen. Er war Amiga-Anwender von Anfang an. Mit G&ouml;tz hat man ganz
schnell Zugang zum Highend-Multimedia und zu neuen Technologien. Seine
F&auml;higkeit, Tatsachen kurz und klar zu erfassen, wird uns in allen Bereichen
der Entwickler-Unterst&uuml;tzung sehr helfen. Seine Aufgabe wird es sein, alle
Informationen auf dem laufenden und zur Verf&uuml;gung f&uuml;r neue Entwickler in
den verschiedenen Online-Systemen zu haben, die wir bereit stellen. Durch
die Kenntnis mehrerer Sprachen wird mit Hilfe von G&ouml;tz das neue System der
Amiga-Entwickler-Unterst&uuml;zung ein wirklich multi-nationales sein. Er ist
zur Zeit auch Mitglied von Amigas 3D-Entwicklungsgruppe. G&ouml;tz lebt jetzt
noch in Deutschland.


Jonas Gustavsson &lt;jonas@amiga.com&gt;

Jonas ist seit langem Amiga-Anwender und hat ausgezeichnete Erfahrungen im
Programmieren, im Testen und in der Anwendung von hochwertigen digitalen/
multimedialen Programmen. Er hat mit 64-Bit Alphas im schweren Multimedia-
Einsatz gearbeitet. Jonas' prim&auml;re Interessenbereiche sind digitale Grafik,
hochwertiges Multimedia, Video-Bearbeitung und Video-Betitelung und er hat
auch bei Arbeiten im kommerziellen Fernsehen und in der Film-Industrie
seine Erfahrungen gesammelt. Jonas spricht auch mehrere Sprachen und wird
eine wertvolle Erg&auml;nzung des Amiga Developer Support Systems bei dem
Streben nach Multinationalit&auml;t sein. Jonas lebt zur Zeit in Schweden.


Weitere Informationen
---------------------

Wir haben viel Zeit f&uuml;r unsere Infrastruktur und f&uuml;r die Vorbereitung auf
den n&auml;chste Ansturm verbracht.


Neues Geb&auml;ude.

Eines der ersten Probleme lag im Immobilienbereich, zur Zeit sind wir auf
600 Fu&szlig;  (60 ... 70 m²) beschr&auml;nkt, wir beulen die W&auml;nde aus, und die Lage
neben einer Auto-Waschanlage mag zwar Vorteile haben, aber es ist doch
recht unangenehm mit all diesen Autoradios, die gleichzeitig vor unserer
T&uuml;r pl&auml;rren.

Wir sind dabei, in unser neues Hauptquartier in Snoqualmie, Washington,
umzuziehen. Die neue Adresse ist 

Amiga Incorporated
34935 SE Douglas Street
Suite 210
Snoqualmie, WA  98065
USA
Telefon  +001 425.396.5660
Fax      +001 425.396.6551

Offiziell &ouml;ffnen wir die T&uuml;ren am 15. M&auml;rz 2000 und sind wieder voll f&uuml;r
Sie da. Wir fangen mit dem Umzug der Ausr&uuml;stung, Telefonen, Servern usw.
jedoch schon am 13. M&auml;rz 2000 an, so dass wir in den n&auml;chsten Tagen wohl
schwer zu erreichen sein werden. Wir bitten im Voraus um Entschuldigung f&uuml;r
Schwierigkeiten, die dadurch verursacht werden sollten.


Neue Web Site!

Sie geh&ouml;rt zu den vordringlichsten Punkten auf unser Liste und die gr&ouml;&szlig;te
Zahl der "Kommentare", die wir von der Gemeinschaft erhalten, bezieht sich
darauf.

Wir sind seit einigen Wochen dabei, eine neue Web Site zu erstellen. Die
Schwierigkeit war der Ort des Servers und die Zeit. Wir haben uns nun diese
beiden Angelegenheiten vorgenommen und erwarten, die Site in den n&auml;chsten
Wochen in Betrieb zu haben.

Eine Web Site bedeutet st&auml;ndige Arbeit, wir erwarten also Ihre Kommentare
und werden weiterhin versuchen, unsere Erfahrung zu vergr&ouml;&szlig;ern.


Gedanken zum Abschluss
----------------------

Dieser Brief zeigt nicht alle unsere Aktivit&auml;ten, die wir im Moment haben
und auch nicht die, die auf uns zu kommen. Es geschieht so viel, dass ich
tagelang schreiben k&ouml;nnte, ohne alles erw&auml;hnen zu k&ouml;nnen.

Wir sind hier sehr besch&auml;ftigt und es k&ouml;nnte uns nichts mehr Freude machen.
Die Gesellschaft und die Leute, die mit uns in Verbindung getreten sind,
um uns bei unseren T&auml;tigkeiten zu helfen, haben uns manchmal &uuml;berw&auml;ltigt.
Wir haben noch mehr Partnerschaften, die wir in St. Louis bekannt geben
werden, und hoffentlich werden wir viele von Ihnen dort begr&uuml;&szlig;en k&ouml;nnen.

Ich habe k&uuml;rzlich einen Amiga-Freund, der schon lange dabei und ein
Mitglied der ausgew&auml;hltemn Gruppe ist, die mit Jay direkt arbeitete,
gefragt, warum Jay dieses Risiko einging. Ich hatte viel &uuml;ber Ideen geh&ouml;rt,
was Jay nun "wirklich" wollte und viele eMails informierten mich, dass sie
w&uuml;ssten, was Jay die ganze Zeit geplant hatte. Da ich nie die Gelegenheit
hatte Jay zu treffen oder mit ihm zu sprechen, dachte ich, dass ich diese
Frage stellen sollte.

Einfach gesagt, Jay wollte die gr&ouml;&szlig;te Heimcomputer-Erfahrung aller Zeiten
machen f&uuml;r einen Preis unter 500.00 Dollar. Ich kann Ihnen versichern, dass
dieser Traum immer noch in jedem Mitarbeiter dieser Gesellschaft lebt und
dass wir weiter an der Verwirklichung seines Traumes arbeiten.

Ich danke jedem Einzelnen von Ihnen f&uuml;r Ihre immerw&auml;hrende Unterst&uuml;tzung
und freue mich auf die Zukunft.


Wir vertrauen auf Euch,


Bill McEwen und die ganze Amiga-Mannschaft«

Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
