<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Interview mit Thomas Dellert, Gesch&auml;ftsf&uuml;hrer von DCE (von Petra Struck)

Das folgende Interview mit Thomas Dellert, dem Gesch&auml;ftsf&uuml;hrer des 
Hardwareherstellers DCE, wurde uns freundlicherweise von 
amiga-news.de zur Verf&uuml;gung gestellt. Es ist auch auf
http://www.amiga-news.de/archiv/0059.shtml zu finden.


»Interview mit Thomas Dellert, DCE - 29.03.2000


Autor: Petra Struck
Interviewpartner: Thomas Dellert
DCE Computer Service GmbH, Oberhausen


amiga-news.de:
Wann ist der geplante/aktuelle Auslieferungstermin f&uuml;r folgende Produkte
mit P5 Lizenz?

Thomas Dellert:
BVision
Bereits &uuml;ber 100 Stk. an Vesalia ausgeliefert. Es werden t&auml;glich fertige
Karten ausgeliefert.

Cybervision PPC
Die Produktion l&auml;uft seit Freitag letzter Woche.

Cybervision64 3D (bereinigte Version)
Die ersten 100 Stk. sind gestern an Vesalia ausgeliefert worden.

Cyberstorm MKIII Boards
Die ersten Karten werden am Freitag ausgeliefert.

Cyberstorm PPC604e Boards
Wir haben gerade 400 Stk. 604-233 erhalten. Ich hoffe, dass wir in den
n&auml;chsten 10 - 14 Tagen die ersten Karten liefern k&ouml;nnen.

Blizzard PPC603e Boards
Die Leiterplatten sind bereits im Lager. Leider verz&ouml;gert sich die
Lieferung der CPU,s und CPLD Bausteine.

amiga-news.de:
Warum kommt/kam es zu so gro&szlig;en Verz&ouml;gerungen? Mit welchen Problemen
hat/hatte DCE zu k&auml;mpfen?

Thomas Dellert:
Die weltweite Verknappung von Bauteilen ist zur Zeit ein grosses Problem.
Hier nur einige Beispiele:

SMD Kondensator 1 NF. Lieferzeit ca. 20 Wochen.
CPLD Logik Chips. Lieferzeit ca. 24 Wochen.
SGRAM f&uuml;r BVision. Lieferzeit ca. 15 Wochen.
Tantal Elkos. Lieferzeit !!!!! Nicht mehr dieses Jahr.....

amiga-news.de:
Besteht ein Plan in die G4 Pl&auml;ne von P5 einzusteigen oder ist dieses Thema
f&uuml;r DCE entg&uuml;ltig abgehakt?

Thomas Dellert:
G4 ist zur Zeit kein Thema. Die CPU,s sind dieses Jahr wohl nicht mehr zu
bekommen.

amiga-news.de:
Besteht ein Plan, neue Grafikkarten zu entwickeln?

Thomas Dellert:
H&auml;tten wir die Permedia II Chipsets nicht mehr bekommen, w&auml;re das
sicherlich ein Thema gewesen.

amiga-news.de:
Besteht Kontakt zwischen DCE und Bill McEwen? Falls ja, kannst du uns
dar&uuml;ber etwas erz&auml;hlen?

Thomas Dellert:
Wir haben Kontakt. Es geht hier um technische Details der PPC-Karten. Mehr
kann ich hier zur Zeit leider nicht sagen.

amiga-news.de:
Die DCE-Website ist zum Teil schon in Deutsch vorhanden, wird der Rest auch
noch &uuml;bersetzt und was mich nat&uuml;rlich besonders interessiert, wird es eine
"Newsseite" geben, auf der jeder auf einen Blick sehen kann, was es Neues
bei DCE gibt?

Thomas Dellert:
Wir sind da am Ball. Ich hoffe die Seite in den n&auml;chsten 14 Tagen fertig zu
haben.

amiga-news.de:
Wird DCE auf der Amiga & Atari-Messe im Juni 2000 in Neuss vertreten sein?

Thomas Dellert:
Alle Produkte werden dort von Vesalia Computer angeboten. Wir hoffen
diesmal endlich alles in ausreichender St&uuml;ckzahl verf&uuml;gbar zu haben.

amiga-news.de:
Werden auch andere H&auml;ndler mit den Produkten versorgt, oder kann man die
Hardware nur noch &uuml;ber Vesalia beziehen?

Thomas Dellert:
Vesalia wird selbstverst&auml;ndlich alle H&auml;ndler beliefern.«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
