<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Das AMIGA-aktuell-Gewinnspiel
-----------------------------

1. Ergebnisse des letzten Gewinnspiels

Die Formulierung der Standardfrage des letzten Gewinnspiels war leider 
etwas ungl&uuml;cklich gew&auml;hlt. Obwohl ich den Sachverhalt in einem AMIGA-
aktuell-Special erkl&auml;rte, ist es wohl dennoch durch dieses Missgeschick 
begr&uuml;ndet, dass die Beteiligung auf ein Rekordniveau von nur 13 Lesern 
sank. 
Hiermit gelobe ich Besserung und bem&uuml;he mich ab sofort um widerspruchsfreie 
Fragestellungen.

Denkt dran: Selbst, wenn ihr die Antwort zur Masterfrage nicht wisst, nehmt 
ihr an der Verlosung teil, wenn ihr die beiden anderen Fragen beantwortet.


Jetzt aber zur Aufl&ouml;sung:


Standard-Frage: Wie hei&szlig;t AMIGAs Vice President of Product Development (in  
                AMIGA aktuell selbst war von "Software Development" die     
                Rede, s.o.)?

Antwort: Die gesuchte Person war Fleecy Moss.


Master-Frage: Nenne die Namen von zwei AMIGA-Mitarbeitern, au&szlig;er Bill       
              McEwen und Fleecy Moss.

Antwort: Hier waren - insbesondere nach Erscheinen des letzten Executive    
         Updates - die unterschiedlichsten Antworten m&ouml;glich,               
         beispielsweise "Petro Tyschtschenko und Randall P. Hughes".


Meinungsfrage: Ab wann wird deiner Einsch&auml;tzung nach das angek&uuml;ndigte       
               Amiga-Entwicklersystem erh&auml;ltlich sein?

Die Auswertung:

Antwort                                                Anzahl der Nennungen
---------------------------------------------------------------------------
1 (Sp&auml;testens im April 2000)                                              4
2 (Zwischen Mai und Dezember 2000)                                        7
3 (Fr&uuml;hestens im Jahr 2001)                                               1

Ein Teilnehmer traute sich keine Prognose zu.


Einige Einsender hatten zu ihrer Beantwortung der Meinungsfrage Stellung 
bezogen (die folgenden Statements sind nat&uuml;rlich noch vor Bekanntwerden der 
j&uuml;ngsten Amiga-Ank&uuml;ndigungen verfasst worden, so dass sie in einigen 
Punkten veraltet sind):


Christian Aichinger meint:

»Alle Amiga-User sind Optimisten (?) deswegen Antwort 2, obwohl ich es 
nicht so richtig glaube...und wenn doch, w&auml;re das ja auch nur ein Intel-
kompatibler mit einer leicht ver&auml;nderten Version von Elate und noch'n paar 
Compiler/Debuger etc.

So wie ich das alles bis jetzt mitbekommen habe, wollen die mit H&P 
(...nicht Hewlett Packard...) zusammenarbeiten wegen des Software-
Emulators, und zus&auml;tzlich wollen die sich mit Herstellern 
auseinandersetzen, die eine Hardware (oder was auch immer) zur Verf&uuml;gung 
stellen wollen (da ist glaub ich auch der Name "BoXer" gefallen), da beide 
Firmen (wann wurde eigentlich der BoXer angek&uuml;ndigt, das war ja noch vor 
den PPC-Karten von P5 oder..???) f&uuml;r ihre "Zuverl&auml;ssigkeit" bekannt sind,  
gehe ich  nicht davon aus, da&szlig; da auch nur ein Part von denen zu den 
Developer-Maschinen beigesteuert wird.  Und eine &Uuml;berraschung von 
irgendeiner anderen Firma... mmmh... wer's glaubt... (ich sag ja nur 
Transmeta und ATI und Corel und...)

Wie man sieht, habe ich momentan &uuml;berhaupt keinen richtigen Durchblick 
mehr...langsam wird mir diese "Soap-Opera" zu kompliziert. ;-) Ich spiel 
jetzt erstmal 'ne Runde Gloom...«


Fritz Trampnau schreibt:

»Je fr&uuml;her das "AMIGA - Entwicklersystem" verf&uuml;gbar ist, um so besser!
Aber was wir AMIGA-Fans wollen, und was dann tats&auml;chlich angeboten wird, 
waren bisher immer 2 Paar Schuhe - mindestens! Also abwarten und Tee 
trinken - wie immer!
Au&szlig;erdem, wer soll denn &uuml;berhaupt in den Genu&szlig; des neuen AMIGA (-
Betriebssystems) kommen, das laut Bill McEwen, nur mit PPC l&auml;uft?
DCE hat gerade `mal die" BVision" herausgebracht - von Blizzard 603(+), 
Cyberstorm PPC, und G3/G4 weit und breit nocht nichts zu sehen!
Da "AMIGA", auch nicht vorhat, Hardware anzubieten - wer soll's also 
machen?!
Sollen die AMIGA-Fans, am Ende noch selbst die Hardware herstellen?
Und wer hat das Geld, sich z.B. eine CyberstormPPC zuzulegen? Die wird 
sicher mindestens 1.500,- DM kosten!
Jetzt gilt es, t&uuml;chtig sparen, und dann den neuen AMIGA kaufen -
wenn er denn kommt!«


Mit den j&uuml;ngsten Amiga-Ank&uuml;ndigungen befasst sich u.a. auch das Schlusswort 
dieser Ausgabe.


Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:

1 x Vollversion von "CDCat": Christian Aichinger
1 x A1200-Turbokarte "Blizzard 1230-IV": André K&ouml;hler
1 x Buch "ARexx - Eine Einf&uuml;hrung und mehr...": Hendrik Stahl


Herzlichen Gl&uuml;ckwunsch!

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
