<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Abschlie&szlig;end
------------

Ab sofort bem&uuml;hen wir uns verst&auml;rkt, engagierte Amiga-Nutzer als
Gastautoren f&uuml;r das AMIGA-aktuell-Schlusswort zu gewinnen. In diesem Monat
&uuml;bernimmt Martin Baute, der Englisch&uuml;bersetzer von amiga-news.de, diese
Aufgabe - und hoffentlich nicht das letzte Mal, da er - wie ich finde -
gro&szlig;artige Arbeit geleistet hat:

»"W&uuml;rdest Du einen Kommentar f&uuml;r die Amiga Aktuell schreiben wollen?" - so 
fragte mich Carsten Schr&ouml;der. Gerne doch, aber wor&uuml;ber? &Uuml;ber die Amiga2K, 
nat&uuml;rlich: Die gr&ouml;&szlig;te Amiga-Show in Nordamerika, und der Ort, an dem die 
f&uuml;r die Zukunft Amigas so entscheidenden Ank&uuml;ndigungen gemacht wurden...

Aber, was wurde denn nun angek&uuml;ndigt?

Bei fr&uuml;heren Messen wurden jene, die gespannt an ihren Rechnern daheim 
sa&szlig;en, durch die eingerichteten Internet-Cafés, durch IRC-Channel und 
Samstag-Abend-E-Mails &uuml;ber die Vorg&auml;nge informiert. Diesmal tr&ouml;pfelten die 
Informationen z&auml;hfl&uuml;ssig und sp&auml;rlich &uuml;ber die Informationskan&auml;le.

Einen Teil zu dieser Misere beigetragen hat vielleicht der "Denkfehler" bei 
der UGN (User Group Network) - an deren Stand sich zwar Rechner mit 
Internet-Zugang befanden, diese aber durch Webcam und Live-Audio voll 
ausgelastet waren. Leider war man nicht bereit, hier f&uuml;r die eine oder 
andere E-Mail eine Sendepause einzulegen.

So gibt es bis zu dem Moment, an dem ich diesen Kommentar schreibe 
(Dienstag Abend, 4. April), nur zwei Informationsquellen: Roger Wyatt bei 
Czech Amiga News, und Corinna Cohn bei MooBunny. Amiga selbst h&uuml;llt sich 
auf der Webseite in Schweigen, alle anderen Nachrichtenseiten (inklusive 
Amiga Aktuell und amiga-news.de) haben von Czech Amiga News abgeschrieben.

Selbst wenn man Amigas Executive Update ("...wenn es nicht auf unserer 
Webseite steht, ist es nicht wahr!") mal au&szlig;er Acht l&auml;&szlig;t, sind zwei Quellen 
nicht besonders viel. Zu schnell kann eine einzelne Quelle durch 
Mi&szlig;verst&auml;ndnisse, Fehlinterpretationen und Wunschdenken beeinflu&szlig;t sein, 
zumal der Inhalt der Ank&uuml;ndigungen den Amigianer weit weg von gewohnten 
Gew&auml;ssern f&uuml;hrt. An einen Aprilscherz mag ich gar nicht denken - selbst 
wenn Bill McEwen zu sehr an seiner Gesundheit interessiert sein d&uuml;rfte, um 
so etwas vor &uuml;ber zweihundert Amiga-Anh&auml;ngern durchzuziehen (immerhin sagt 
man uns ja einen gewissen Hang zum Fanatismus nach), wer wei&szlig;, durch wessen 
Scherzbolds H&auml;nde die Informationen geflossen sind?

Hier mu&szlig; heftige Kritik an Amiga ge&uuml;bt werden - wer das Wahrheitsmonopol 
&uuml;ber die eigene Firmenstrategie beansprucht, sollte zumindest am Tag nach 
einer Messe diese Firmenstrategie auch der Allgemeinheit kundtun.


Vor diesem Hintergrund sollte der geneigte Leser die folgenden 
Informationen als "Beta" betrachten. Alle Angaben ohne Gew&auml;hr, Benutzung 
auf eigene Gefahr. :-)


                             Die Entwicklersysteme

Was dem aufmerksamen Betrachter schon vorher klar gewesen sein d&uuml;rfte, 
wurde in St. Louis ganz offiziell verk&uuml;ndet: Die Entwickler-Systeme 
basieren auf einem x86er-Prozessor (AMD K6, 500 MHz, mit GeForce 256 
Grafikkarte und 64 MB RAM). Auf der Grundlage einer Linux-Installation soll 
das Elate-System der Tao Group laufen, und die Entwicklung erster 
Softwareprodukte erm&ouml;glichen.

Geradezu selbstverst&auml;ndlich empfand so mancher Nutzer von Diskussionsforen 
dies als einen Verrat am Geiste des Amiga. F&uuml;r den technisch orientierten 
Entwickler ist diese Entscheidung jedoch vollkommen nachvollziehbar; ich 
w&uuml;rde sogar so weit gehen, sie als den einzig sinnvollen Weg zu bezeichnen, 
und ich sage auch, warum.

Zum Entwickeln von Software braucht es Software. Das f&auml;ngt bei Texteditor 
und Compiler an, geht bei Debugger und "make" weiter, und h&ouml;rt mit Tools 
zur Projekt- und Ablaufplanung, Dokumentation etc. noch lange nicht auf. 
Bietet ein Betriebssystem alle Tools selbst an, nennt sich das "self-
contained" - so weit ist Elate aber noch nicht. Daher mu&szlig; ein "Basissystem" 
geboten werden, und hier f&auml;llt die Wahl schon aus Kostengr&uuml;nden auf Linux.

Das ist kein Beinbruch: Die Entwicklung des AmigaOS in den achtziger Jahren 
st&uuml;tzte sich auch auf andere Plattformen, und mit dem Ergebnis waren wir 
lange Jahre hochzufrieden. Programmierern ist es in der Regel ziemlich 
egal, auf welcher Plattform sie entwickeln, solange die ben&ouml;tigten Tools 
vorhanden sind.

Die Verwendung der POP-Boards von IBM (auf PPC-Basis) w&uuml;rde von vielen eher 
als "politisch korrekt" empfunden. Jedoch sind diese Boards sehr viel 
schwerer (wenn &uuml;berhaupt) zu bekommen, wahrscheinlich deutlich teurer, und 
inwieweit f&uuml;r diese Boards bereits vergleichbar komfortable Linux-
Installationen (inlusive Treiber) existieren, entzieht sich meiner 
Kenntnis.

Mit fortschreitender Entwicklung wird es mehr und mehr Treiber geben. Die 
restriktiven Anforderungen an ein Entwicklersystem (eine bestimmte Linux-
Installation auf einem bestimmten Prozessor auf einem bestimmten 
Motherboard mit einer bestimmten Grafikkarte) werden gelockert; mit der 
gro&szlig;en Verbreitung von Linux-Systemen gerade unter Hobby-Entwicklern 
er&ouml;ffnet sich hier ein gro&szlig;er Einzugskreis f&uuml;r potentielle Elate-Amiga-
Programmierer.

Und selbst, wenn aus den gro&szlig;artigen Pl&auml;nen von Amiga nichts werden sollte, 
kann man die Hardware des Entwicklersystems immer noch f&uuml;r Linux, BeOS, 
Windows oder was auch immer benutzen - was bei einer "selbstgestrickten" 
Entwicklerbox nicht m&ouml;glich w&auml;re. Kleinstm&ouml;gliches Risiko f&uuml;r den 
interessierten Entwickler - f&uuml;r mich das ausschlaggebende Argument.


                                Die Endsysteme

Eine erstaunliche Anzahl von Amiga-Usern wirft immer noch die 
Entwicklerboxen und die zu erwartenden Endprodukte in einen Topf. Das ist 
schon alleine aus dem Grunde falsch, da Amiga zwar sehr wohl 
Entwicklersysteme vertreiben wird, aber keine eigenen Endprodukte - 
abgesehen vom Betriebssystem selbst.

Hardwareherstellern werden verschiedene M&ouml;glichkeiten offenstehen: Man kann 
Standardsysteme (hei&szlig;t: x86er PCs) zusammenbauen, POP-PPC-Systeme oder 
v&ouml;llig eigene Hardware-Kreationen, und diese mit dem neuen Betriebssystem 
ausstatten.

Das schlie&szlig;t solche Dinge wie PDAs, Organiser, Autonavigationssysteme oder 
den vielzitierten intelligenten Toaster ausdr&uuml;cklich mit ein. Denn neben 
dem klassischen Desktop, dem Werkzeug des "digitalen Abenteurers" (O-Ton 
Fleecy Moss), ist der "Digital Domestic Habitat" erkl&auml;rter Zielmarkt. DDH 
steht somit f&uuml;r all die Bereiche des Lebens, wo ein Computerger&auml;t das Leben 
vereinfachen k&ouml;nnte, der Anwender von Computern aber nichts wissen will.

("Computer, Licht. Radio ein, Sender WDR 2." - Star Trek l&auml;&szlig;t gr&uuml;&szlig;en.)

Wem es beim Studium der verf&uuml;gbaren Informationen &uuml;ber die Elate-
Architektur noch nicht aufgefallen ist, dem d&auml;mmert es jetzt: Die 
Endsysteme K&Ouml;NNEN gar nicht auf x86er-Prozessoren ausgerichtet sein. 
Immerhin zielt man auf M&auml;rkte, in denen selbst ein Transmeta-Crusoe viel zu 
unpraktisch w&auml;re: Embedded Systems werden von CPUs der MIPS- oder 
StrongARM-Familie angetrieben.

Es wird einige Zeit dauern, bis der erste Hersteller es wagen wird, eine 
Desktop-Hardware ausschlie&szlig;lich mit dem Elate-Amiga-OS auszuliefern. Bis 
dahin wird das neue System als "Aufsatz" auf Host-Betriebssystemen laufen, 
quasi als eigene Anwendung z.B. unter Linux. So wird anderen Usern die 
M&ouml;glichkeit gegeben, die neuen F&auml;higkeiten auszuprobieren, ohne sich zuerst 
in Unkosten st&uuml;rzen zu m&uuml;ssen - ein Faktor, den Linux selbst bei seinem 
kometenhaften Aufstieg zu nutzen verstanden hat. Selbst heute d&uuml;rfte auf 
der Mehrzahl aller Linux-Heim-Systeme noch parallel Windows installiert 
sein.

Selbst wenn die ersten Komplettsysteme ausschlie&szlig;lich mit Elate-Amiga-OS 
ausgeliefert werden (und wir sprechen hier von Jahren!), werden diese 
Systeme mit hoher Wahrscheinlichkeit auf x86er-Standardhardware basieren. 
Die Gr&uuml;nde wurden teilweise schon bei den Entwicklersystemen genannt:

- Zukunftssicherheit der Anschaffung selbst bei Untergang der Amiga-        
  Technik;
- daher geringe Hemmschwelle f&uuml;r Neu- und Quereinsteiger;
- hohe St&uuml;ckzahlen der verwendeten Technik, daher niedrige Preise und       
  schnelle Weiterentwicklung.

Dazu kommt: So ziemlich jeder "Alt-Amigianer" (jeder, der dar&uuml;ber 
nachgedacht hat) ruft nach der Verwendung von Standardkomponenten, um 
niedrigen St&uuml;ckpreis und Verf&uuml;gbarkeit sicherzustellen. Standardkomponenten 
erfordern Standardschnittstellen, und diese sind auf Standardboards bereits 
vorhanden. Die Kosten f&uuml;r eine Eigenentwicklung w&uuml;rden sich einfach nicht 
rechnen.

Wer Chancen f&uuml;r eine eigene Hardwarekreation sieht, dem steht es frei, 
diese zu entwickeln. Die Natur der Elate-Technologie macht eine 
hardwareunabh&auml;ngige Unterst&uuml;tzung verschiedener Plattformen m&ouml;glich. Nur, 
weil Amiga selbst keine solchen Systeme herstellen wird, hei&szlig;t das nicht, 
da&szlig; es solche Systeme nicht geben wird.


Man sollte jedoch beachten, da&szlig; ich hier offizielle und inoffizielle 
Statements und eine Menge Spekulation zusammenfasse, und da&szlig; ich ein 
Fernziel beschreibe. Bis dahin ist es ein holpriger Weg, und vielleicht 
wird dieses Ziel nie, oder erst in vielen Jahren, erreicht. Immerhin wurde 
ein erster Schritt gemacht, und das ist mehr, als in vielen Jahren zuvor 
geschehen ist.


                              Die Partnerschaften

&Uuml;bereinstimmend nennen die beiden Quellen (siehe Einleitung) die Namen 
Corel, Red Hat, Sun, und Sony als "strategische Partner" von Amiga. Da 
dr&auml;ngen sich mir zwei Fragen auf:

Wer hat mit wem eine Partnerschaft? Schon in der Vergangenheit schien es 
hier Verwechselungen zwischen der Tao Group und Amiga zu geben. Sony ist 
ein Investor der Tao Group; das hei&szlig;t noch lange nicht, da&szlig; Sony auch die 
Pl&auml;ne von Amiga unterst&uuml;tzt. Dazu ein deutlicher Unterschied der 
Formulierung: Bill McEwen lie&szlig; verlauten, Red Hat und Corel w&uuml;rden mit 
Amiga zusammenarbeiten. Die Projektion an der Wand hinter ihm zitierte 
leitende Pers&ouml;nlichkeiten dieser Unternehmen aber, man freue sich, da&szlig; 
Amiga mit _ihnen_ zusammenarbeiten w&uuml;rde. Es ist ein gewaltiger 
Unterschied, ob Amiga mit (und f&uuml;r!) Red Hat und Corel arbeitet, oder diese 
mit (und f&uuml;r!) Amiga arbeiten!

Und, wie weit gehen diese Partnerschaften? Wenn Amiga f&uuml;r die 
Entwicklerboxen eine Red Hat Linux-Installation verwendet (und Red Hat 
daf&uuml;r bezahlt), macht das Red Hat schon zu einem "strategischen Partner". 
Aber wie sehr ist Red Hat an einem Erfolg von Amiga interessiert? 
Investiert man Geld und/oder Entwicklerarbeit, um Amiga zu unterst&uuml;tzen?

Man sieht also, man mu&szlig; auch weiterhin zwischen den Zeilen lesen. Das eine 
oder andere, was ich zwischen den Zeilen "meiner" beiden Quellen lese, will 
mir gar nicht gefallen. Herbe Kritik am Stil der Amiga-F&uuml;hrungsspitze auf 
der einen Seite, und die simple "Degradierung" zum Linux-Add-On auf der 
anderen... Amiga w&auml;re gut beraten, hier baldigst klare Worte zu sprechen.

Und zwar zur Amiga-Anh&auml;ngerschaft als Ganzes. Nicht nur zu den 200+ 
Anwesenden einer Messe, und nicht nur zu den zahlenden Kunden der Amiga 
Zone. Die IRC-Chats mit Fleecy Moss werden n&auml;mlich ab sofort unter 
Ausschlu&szlig; der Allgemeinheit stattfinden.


                                    Klassik

Auf einen Punkt, der in verschiedenen Diskussionsforen immer wieder 
aufkommt, m&ouml;chte ich zum Schlu&szlig; noch eingehen: Die Abkehr von 68k und 
AmigaOS 3.x.

Schon vor der Messe war klar, und wurde unmi&szlig;verst&auml;ndlich klar gemacht: 
Seitens Amiga Inc. wird es keine Weiterentwicklung des AmigaOS 3.5 als 
unabh&auml;ngiges Betriebssystem mehr geben.

So gro&szlig;artig das AmigaOS einmal war, so sehr hinkt es dem Stand der Technik 
hinterher. Eine "Runderneuerung" des reinen Desktop-OS w&uuml;rde genau das 
ergeben, was so viele kritisieren: Ein weiteres OS f&uuml;r Standard-Hardware. 
BeOS, zweiter Versuch, wenn man so will.

Doch Amiga Inc. l&auml;&szlig;t das alte OS nicht einfach fallen. Fleecy Moss lie&szlig; in 
einem IRC-Chat (hei&szlig;t: inoffiziell!) verlauten, es w&uuml;rde f&uuml;r das neue OS 
eine Emulation des alten OS geben, geschrieben mit Zugriff auf alle 
Original-Quellcodes. Haage & Partner wurde daf&uuml;r gewonnen, einen 
&Uuml;bergangspfad vom alten auf das neue OS zu entwickeln.

Ebenso soll eine neue Version von WarpOS entwickelt werden, mit der das 
neue OS auch auf PPC-Amigas laufen wird.

Bill und Fleecy h&auml;tten eine Menge Geld sparen k&ouml;nnen, indem sie Gateway die 
Rechte an Amiga &uuml;berlassen h&auml;tten. Aber sie haben sie gekauft, und sie 
bieten einen &Uuml;bergang zu neuer Technologie. Das ist eine Menge mehr, als 
Gateway jemals getan h&auml;tte. Und ich denke nicht, da&szlig; wir mehr verlangen 
k&ouml;nnen.

"Wenn sie es nicht weiterentwickeln, sollen sie wenigstens die Quellcodes 
freigeben..."

Tats&auml;chlich l&auml;&szlig;t Amiga pr&uuml;fen, inwieweit das m&ouml;glich ist. Doch ein Blick 
auf die Installationsdisketten des OS 3.1 reicht, um festzustellen: Nicht 
alle Rechte am AmigaOS geh&ouml;ren Amiga. Wishful Thinking, Adobe und noch ein 
paar andere w&auml;ren wahrscheinlich nicht am&uuml;siert, wenn deren geistiges 
Eigentum einfach so zur Open Source erkl&auml;rt w&uuml;rde.

Und, so leid es mir f&uuml;r COSA (Case for Open Source AmigaOS) tut: Was w&uuml;rde 
mit einem Open Source AmigaOS geschehen? Leute k&ouml;nnten sich nicht &uuml;ber die 
Richtung einigen, jeder w&uuml;rde seine eigenen &Auml;nderungen programmieren, das 
OS w&uuml;rde sich in viele unterschiedliche Versionen zerlegen. Und die 
Handvoll Entwickler, die tats&auml;chlich beim alten OS bleiben w&uuml;rden, h&auml;tten 
nicht die Spur einer Chance, das OS irgendwohin zu bringen.

Die Lizensierung der OS-Quellcodes an Organisationen (z.B. AROS, COSA, ...) 
ist da sehr viel wahrscheinlicher. Es ist und bleibt aber eine Tatsache: 
Wollte man das alte AmigaOS auf den Stand der Technik bringen, k&ouml;nnte man 
es genausogut auch gleich neu schreiben. Das ist nicht (nur) meine Meinung, 
sondern die Meinung von Carl Sassenrath, und der sollte es wissen - 
immerhin hat er gro&szlig;e Teile des OS-Kerns selbst entwickelt.

Und genau das tut Amiga Inc. im Moment, mehr als es jede andere mir 
bekannte Firma f&uuml;r sich beanspruchen k&ouml;nnte: Ein Betriebssystem, da&szlig; so 
schlank, effizient, fortschrittlich und vielseitig ist, wie es das AmigaOS 
1985 war.

Und von genausowenig Menschen wirklich verstanden wird. Davon nehme ich 
mich nicht aus.

                                                         Mit vielen Gr&uuml;&szlig;en,

                                                               Martin Baute
                                                          mb@amiga-news.de«


Bleibt mir nur, auch mich zu verabschieden und euch schon einmal ein frohes 
Osterfest zu w&uuml;nschen.

Bis n&auml;chsten Monat,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
