<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Vorwort
----------

Hallo, liebe Leser!

Herzlich willkommen zu einer neuen Ausgabe Eures AMIGA aktuell Spieleteils. 
Diese Ausgabe ist mal - von den Neuigkeiten abgesehen - wieder recht 
d&uuml;rftig ausgefallen. Ich wollte diesen Monat einige neue Spiele vorstellen, 
doch wurden mir bisher - auch auf Anfrage - keine Testexemplare von neuen 
Spielen zugestellt.
Das erspart mir einiges an Arbeit und den Firmen einiges an Publizit&auml;t. 
Eine m&ouml;gliche Ursache, dass kein Interesse mehr an Tests in der AMIGA 
aktuell vorhanden ist, w&uuml;rde ich darauf zur&uuml;ckf&uuml;hren, dass ich immer recht 
'ehrlich' getestet habe, was ja momentan am Amiga nicht unbedingt 
gew&ouml;hnlich ist. Also wenn ein Spiel aussieht und sich spielt wie am A500 in 
1988, dann wird das von mir auch dementsprechend bewertet. Auch wenn
es mir leid tut f&uuml;r die Entwickler, und ich wei&szlig; sehr gut, was f&uuml;r eine 
Arbeit auch hinter einem Spiel steckt, welches nur 40% bekommt, bin ich 
nicht gewillt, die Leserschaft auf eine falsche F&auml;hrte zu f&uuml;hren, wie das 
z.B. eine gewisse Zeitschrift, die (gl&uuml;cklicherweise?) eingestellt wurde,
gern praktizierte. So kann ich grob sagen, dass ca. 80% der Spiele, die 
momentan f&uuml;r den Amiga erscheinen, nicht mehr zeitgem&auml;&szlig; sind. Dies f&uuml;hre 
ich darauf zur&uuml;ck, dass diese meist von Hobbyprogrammierern entwickelt 
wurden, die meistens nicht dieselbe Qualit&auml;t wie Spiele von 
Berufsprogrammierern einer richtigen Firma vorweisen k&ouml;nnen. Viele Spiele, 
die mir zu Augen gekommen sind, scheiterten sogar eher an der Grafik als an 
der Programmierung. So, jetzt bin ich etwas weit vom Thema abgeschweift, 
aber es ist wichtig, dass so etwas auch mal erw&auml;hnt wird, da sich fast 
jedes Amiga Medium um solche Aussagen herumdr&uuml;ckt. Aber leider entspricht 
dies nur zu gut der Realit&auml;t.

In diesem Spieleteil k&ouml;nnt ihr also wieder mal keine Reviews lesen - es 
liegt aber nicht an mir - daf&uuml;r aber ein Preview des neuen Jump'n'Runs Ali 
Baba, welches leider auch unter den schon oben genannten Aspekten leidet. 

Die 'Spiele aus dem Aminet'-Rubrik sowie die 'HD-Installer'-Rubrik fallen 
diesen Monat leider aus. Heiko Garrelts ist noch mit seinem Studium 
besch&auml;ftigt und von Ingo Schmitz habe ich diesen Monat nichts erhalten. Um 
so erfreulicher, dass Andreas Koch mal wieder in der Mac-Ecke aktiv war und 
zwei Spiele getestet hat. Auch gibt es diesen Monat keine Informationen 
&uuml;ber neue Spiele im Aminet, da das Aminet seit ca. 3 Wochen 'down' ist.
  
So, trotz dieser eher negativen Einleitung w&uuml;nsche ich Euch jetzt viel Spa&szlig; 
mit dieser Ausgabe des AMIGA aktuell Spieleteils sowie im Voraus schon mal 
frohe Ostern!

Euer,
 
Andreas
(Andreas.Falkenhahn@gmx.de)

(Andreas Falkenhahn, An der Trift 2, 36132 Eiterfeld-Arzell)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
