<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Update: So senkt ihr eure Telekom-Rechnung!

Bei den Ferngespr&auml;chstarifen hat sich in den letzten Wochen zwar einiges 
getan, allerdings ist die Tariftabelle nur ein einziges Mal von den 
&Auml;nderungen betroffen.

&Uuml;brigens sinken die Geb&uuml;hren f&uuml;r die Nutzung des Internets immer weiter: 
Mit der Mobilcom-Tochter Freenet kann man mittlerweile f&uuml;r 2,5 bzw. gar 1,9 
Pfennig pro Minute surfen - und das ganztags. Allerdings ist hierzu eine 
Anmeldung notwendig.

Und damit zur aktuellen Tarif&uuml;bersicht:

G&uuml;nstigster Call-by-Call-Anbieter (ohne Anmeldung, Mindestumsatz, etc.):

Wann:    |      Wohin:  Festnetz -&gt; Festnetz      Festnetz -&gt; Mobilfunknetz
===========================================================================
werktags 9-18 Uhr      Super24 (01024), 6,6 Pfg.     01051 (01051), 40 Pfg.

sa/so/feiert. 9-18 Uhr Super24 (01024), 4,4 Pfg.     01051 (01051), 40 Pfg.

t&auml;glich 18-21 Uhr      Super24 (01024), 4,4 Pfg.     01051 (01051), 40 Pfg.
t&auml;glich 21-7 Uhr       Super24 (01024), 3,3 Pfg.     01051 (01051), 40 Pfg.
t&auml;glich 7-8 Uhr        Interoute (01066), 3,8 Pfg.   01051 (01051), 40 Pfg.
t&auml;glich 8-9 Uhr        Super24 (01024), 4,4 Pfg.     01051 (01051), 40 Pfg.


Die Tabelle sollte im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige 
Anmerkungen:

* Angegeben ist jeweils der f&uuml;r 1 Verbindungsminute f&auml;llig werdende Betrag.

* 'Werktags' bedeutet montags bis freitags mit Ausnahme von Feiertagen.

* Bei Ortsgespr&auml;chen hat die Telekom in weiten Teilen Deutschlands noch ein  
  Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften      
  g&uuml;nstige City-Tarife an. In der Regel hei&szlig;t es also bei                  
  Ortsgespr&auml;chen: Weiterhin die Deutsche Telekom benutzen.
  Auf http://www.muc.de/~hm/telefon-tarife/tarifzonen.html k&ouml;nnt ihr        
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte  
  es mal passieren, dass ihr "f&auml;lschlicherweise" einen der alternativen     
  Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom    
  - und damit wom&ouml;glich billiger - zustande kommen k&ouml;nnte.

* Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,      
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass    
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im     
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen     
  l&auml;sst. Mein Favorit: http://www.teltarif.de/db/index.html


Die Anbieter verfahren bei der Geb&uuml;hrenberechnung teilweise 
unterschiedlich:

* 3U rechnet sekundengenau ab, d.h. ihr zahlt hier wirklich nur f&uuml;r die     
  Zeit, die die Verbindung andauert.

* Viatel berechnet mo-fr zwischen 9 und 18 Uhr bei Verbindungen bis 30      
  Sekunden Dauer die gesamten 30 Sekunden, danach wird exakt abgerechnet. 
  Zu anderen Zeiten wird minutenweise abgerechnet.
  ACHTUNG: An Feiertagen, die nicht aufs Wochenende fallen, rechnet Viatel  
  nach dem Werktags-Tarif ab.

* Super24, Arcor, o.tel.o, Talkline, 01051, Drillisch und Interoute rechnen  
  minutenweise ab.


F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
