<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Vakiot</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Vakiot</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Posti</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Kirjeit&auml; toimitukselle</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kemppaalan Timon mainioon Paloma-artikkeliin viitaten haluaisin huomauttaa muutamasta mieleeni juolahtaneesta asiasta.
						<p>En tied&auml;, miten Kemppaala on onnistunut mainitsemassaan Picasson firmware-p&auml;ivitysh&auml;ss&auml;k&auml;ss&auml;, mutta ainakin minun molemmissa korteissani homma on toiminut kuten pit&auml;&auml;kin: isket&auml;&auml;n p&auml;ivitys sis&auml;&auml;n ja ollaan onnellisia. Picasso kuitenkin vaatii uudehkon firmwaren, jotta Paloma toimisi, sama koskee Conciertoa. Omissa korteissani on t&auml;ll&auml; hetkell&auml; v7.4, ja se toimii mainiosti niin Paloman kuin Conciertonkin kera.</p>
						<p>Kanavien hausta kommentoin vain sen verran, ettei se minusta kest&auml;nyt sen pidemp&auml;&auml;n kuin muillakaan laitteilla. Kappaleeseen Paloman kuvasta, omalla ruudullaan tai Workbenchin p&auml;&auml;ll&auml;, en voi kommentoida, koska en (useankaan lukukerran j&auml;lkeen) pysty tajuamaan, mit&auml; ihmett&auml; Timo oikein tarkoittaa. :)</p>
						<p>BTW, Pablo &quot;ulostaa&quot; S-VHS/CVBS-signaalia, mutta &quot;kuvan&quot; resoluutio on tiet&auml;&auml;kseni sama kuin Palomallakin (704x548) eli 800x600-resoluutiolla kuvaan j&auml;&auml; ilke&auml;t mustat reunat. Fullscreeni&auml; jos haluaa k&auml;ytt&auml;&auml;, Pablo tukee my&ouml;s 640x480 resoluutiota.</p>
						<p>PalomaWall-ohjelmaa en etsinn&ouml;ist&auml;ni huolimatta mist&auml;&auml;n onnistunut l&ouml;yt&auml;m&auml;&auml;n, joten luulenpa, ett&auml; Laszlo T&ouml;r&ouml;k on julkaissut sen vain Picasson mailing-listan v&auml;lityksell&auml;. Voin kuitenkin toimittaa ohjelman halukkaille vaikkapa s&auml;hk&ouml;postilla.</p>
						<p>Huomauttaisin viel&auml; PalomaTV:st&auml; sen verran, ett&auml; uskoakseni t&auml;m&auml; mainittu kaatuilu johtuu jostakin muusta &quot;systeemist&auml;&quot;, koskapa minulla kyseinen ohjelma on vakaa kuin peruskallio. Ohjelmasta tosin puuttuu muutamia toimintoja, jotka siin&auml; soisin olevan. :-/</p>
						<p>Enivei, Paloma on toiminut minulla vallan mainiosti ilman mit&auml;&auml;n sen kummempaa h&auml;ss&auml;kk&auml;&auml;, niin A4000:ssa kuin A3000:ssa. PalomaTV osaa valita &quot;sopivimman&quot; n&auml;ytt&ouml;tilan, joten loin XXXxXXXX-tilan, johon PalomaTV automaattisesti aukeaa. Hieman v&auml;&auml;nt&auml;m&auml;ll&auml; sain siit&auml; 150 Hz tilan (edellytt&auml;en luonnollisesti, ett&auml; monitori jaksaa). Huomattavaa on my&ouml;s, ett&auml; vaikka televisiokuva on 24-bittinen, ruudun jolle se avataan PiP-ikkunassa ei tarvitse olla kuin 8-bittinen.</p>
						<p>Itse asiassa minulla oli jotain muutakin sanomista, mutta olen onnekseni autuaasti unohtanut mit&auml;. Mutta lukekaa se kirjoittamani Paloma-artikkeli Sakusta #26, se oli paaaaaljon parempi. ;-)</p>
						<p><font size="2">Sami Yl&ouml;nen</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Timo Kemppaalan artikkeli Canal Digitalista Sakussa #33 pisti ihmettelem&auml;&auml;n. En tied&auml;, onko Kemppaala kirjoittanut artikkelinsa kovassa kiireess&auml; vai miten, mutta mukaan on p&auml;&auml;ssyt ep&auml;tarkkuuksia tai virheit&auml;. Koska minulla ei kotiteatteriartikkelin kirjoittamisen j&auml;lkeen ole en&auml;&auml; voimia kirjoittaa omaa n&auml;kemyst&auml;ni laajemmin, p&auml;&auml;tin kirjoitella asiasta vain lyhyesti. Voin yritt&auml;&auml; kirjoitella joskus tulevaisuudessa digi-TV-aiheista artikkelia, sitten kunhan ala hieman kehittyy ja on enemm&auml;n kerrottavaa (eli kuten kotiteatteriaiheesta parhaillaan). Nyt ala on viel&auml; sen verran lapsenkengiss&auml;&auml;n, ettei se eroa analogisesta satelliitti-TV:st&auml; kovin merkitt&auml;v&auml;sti.
						<p>Vanhana Canal Digitalin analogitilaajana sain itsekin joskus alkukes&auml;st&auml; kirjeen, jossa kerrottiin analogisten l&auml;hetysten loppumisesta Suomessa. Kirje sis&auml;lsi tarjouksen: tilaamalla Canal+ ja Entertain-kanavapaketit saisin ilmaiseksi digitaalivirittimen vuodeksi k&auml;ytt&ouml;&ouml;ni sek&auml; satelliittilautasen mikrop&auml;ineen ikiomaksi. Lis&auml;ksi ao. kanavapaketti maksaisi 199 mk/kk normaalin 240 mk/kk sijasta ensimm&auml;isen vuoden aikana, ja saisin viel&auml; kaupan p&auml;&auml;lle kolme ilmaista F1-monikanaval&auml;hetyst&auml;. Kaikki t&auml;m&auml; viel&auml;p&auml; ilman liittymismaksuja.</p>
						<p>No, mik&auml;s siin&auml; - laitoin hakemuksen vet&auml;m&auml;&auml;n, ja parin viikon sis&auml;ll&auml; alkoi Canal Digitalilta tulla postia. Monessa er&auml;ss&auml;... Ensin tuli paksu kirjekuori, joka sis&auml;lsi ohjelmalehdet ja &auml;lykortin. Sitten tuli viritin. Lopuksi tuli lautanen. Kaikki eri p&auml;ivin&auml;... :) Lautanen oli varsin laadukas, metallia ja noin 80 cm kokoinen, mikrop&auml;&auml;n&auml; oli universal-mikrop&auml;&auml; 9.750 ja 10.600 GHz localeilla. Koska minulla oli jo ennest&auml;&auml;n k&auml;&auml;ntyv&auml;, polarmount-jalustalla oleva 1,3-metrinen parvekkeella ja siin&auml; vastaava mikrop&auml;&auml;kin asennettuna, raahasin lautaspaketin varastoon. My&ouml;hemmin lahjoitin lautasen kaverille osakorvauksena auton korjauksesta. Vastaava lautanen mikrop&auml;ineen maksaisi kaupassa noin 500 mk.</p>
						<p>Avatessani digivirittimen pakettia koin posiviitisen yll&auml;tyksen: heti laitteen takapaneeliin vilkaistuani ratkesi ongelma analogiseen satelliittilaitteistooni liittyen. En halunnut luopua analogisista kanavista, ja siksi olin jo aikonut hankkia &quot;kahden talouden&quot; mikrop&auml;&auml;n, johon saa kaksi viritint&auml;. Mutta Philipsin laitteessapa olikin n&auml;pp&auml;r&auml; satelliittisignaalin l&auml;pivienti analogiselle laitteistolle! Nyt tarvitsi viel&auml; keksi&auml;, mist&auml; vapaa AV-sis&auml;&auml;nmeno digivirittimelle, kun AV-laitteiston liit&auml;nn&auml;t ovat jokseenkin k&auml;yt&ouml;ss&auml;...</p>
						<p>Niinp&auml; liitin digivirittimen analogisen virittimeni, Pace MSS500:n taakse yhteen sen nelj&auml;st&auml; scartista (dekooderi 2:n scarttiin) ja muutin siin&auml; aiemmin olleen kytkenn&auml;n VCR-scarttiin. N&auml;in sain k&auml;tev&auml;sti yhden AV-sis&auml;&auml;nmenon lis&auml;&auml;, kuin tyhj&auml;st&auml;. Nyt sek&auml; analoginen ett&auml; digitaalinen satelliitti-TV toimivat sulassa sovussa rinnakkain (molempia ei tietenk&auml;&auml;n voi k&auml;ytt&auml;&auml; yht&auml;aikaa), ja Pacen viritin reititt&auml;&auml; kulloinkin katsottavasta laitteesta AV-signaalit TV:lle ja AV-vahvistimelle, josta ne edelleen jakautuvat nauhureille, ja n&auml;in esim. nauhoitus toimii kaikilla nauhureilla mist&auml; tahansa l&auml;hteest&auml;.</p>
						<p>Kemppaalan artikkelia kommentoidakseni t&auml;ytyy ensinn&auml;kin todeta, ett&auml; edes 1,3-metrisell&auml; lautasella (joka antaa Philipsiss&auml; vihre&auml;n signaalipalkin kelill&auml; kuin kelill&auml;) ei vastaanotto ole virheet&ouml;nt&auml;. Esimerkiksi BBC Prime -kanavalla on todella pahoja h&auml;iri&ouml;it&auml;. Olen valittanut t&auml;st&auml; Canal Digitalille, josta kerrottiin, ett&auml; ongelma on uplink-p&auml;&auml;ss&auml; Norjassa ja siten en voi omin toimenpitein vastaanottoa parantaa, kun vika ei ole siin&auml;.</p>
						<p>Lis&auml;ksi valitettavaa on my&ouml;s siin&auml;, ett&auml; kanavia pakataan samalle transponderille aivan liikaa! Esimerkiksi Nelosen &auml;&auml;ni on surkeaa MP3-laatua, puheessa ja musiikissa S:t kurlaavat - pakkaus on selv&auml;sti kuultavissa. My&ouml;s kuvassa n&auml;kee pakkauksen, kuva on hetkitt&auml;in aivan suttuinen nopeissa liikkeiss&auml; tai kuvan vaihtuessa (huomaa viimeist&auml;&auml;n kun nauhoittaa videolle ja katsoo kuva kuvalta). Eniten h&auml;iritsee kuitenkin &auml;&auml;ni, jossa olisi todella parantamisen varaa. Analoginen, maanp&auml;&auml;llinen Nelonen tarjoaakin paremman kuvan ja &auml;&auml;nen. Onneksi sent&auml;&auml;n t&auml;rkeimm&auml;t kanavat, niist&auml; joista maksetaan eli Canal+-elokuvakanavat tarjoavat jokseenkin moitteettoman kuvan ja &auml;&auml;nen. Monikanava&auml;&auml;nt&auml; tosin j&auml;in kaipaamaan, mutta eip&auml; Philipsiss&auml; ole edes digitaalista &auml;&auml;nil&auml;ht&ouml;&auml;.</p>
						<p>Lautasen suuntaus on ensikertalaiselle varmasti aikaa ja hermoja viev&auml; toimenpide. Vaikeaa se on varsinkin digitaalivirittimen kanssa, jossa on sis&auml;ll&auml; aktivoitumaton &auml;lykortti, eik&auml; siten mit&auml;&auml;n tule n&auml;kyviin useisiin minuutteihin, vaikka lautanen olisi jo suunnattu. &Auml;lykorttihan aktivoidaan satelliittil&auml;hetyksen kautta, eik&auml; kuvaa tule ennen kuin viritin on ollut oikeassa suunnassa, kanavat viritettyn&auml; muutamia minuutteja! Analogisella t&auml;m&auml; on viel&auml; helpompaa, kun voi yritt&auml;&auml; suunnata PAL-kanavan avulla ja tuleehan salatuissa D2MAC-l&auml;hetyksiss&auml;kin salattu kuva sek&auml; tekstitys n&auml;kyviin, yleens&auml; &auml;&auml;nikin. Onneksi digivirittimess&auml; on sent&auml;&auml;n signaalinvoimakkuusmittari.</p>
						<p>Mikrop&auml;&auml;n liit&auml;nt&auml; ja satelliittisignaalin l&auml;pivientiliit&auml;nt&auml; ovat muutekseen kierrett&auml;vill&auml; F-liittimill&auml;, ei suinkaan BNC, kuten Kemppaalan artikkelissa. BNC-liittimi&auml;kin olen tavannut joissakin vanhoissa analogisissa, r&auml;kkimallisissa yhteisantenniasennuksiin tarkoitetuissa satelliittivirittimiss&auml;, mutta en koskaan kotik&auml;yt&ouml;ss&auml;. BNC olisi ep&auml;k&auml;yt&auml;nn&ouml;llinen kotona, koska varman liitoksen tekoon johdon p&auml;&auml;h&auml;n vaaditaan puristuspihdit, ja liittimet ovat kertak&auml;ytt&ouml;isi&auml;.</p>
						<p>Canal Digitalin k&auml;ytt&auml;m&auml; salaus ei suinkaan ole Viaccess, niin kuin Kemppaala kirjoitti. Viaccess-salausta k&auml;ytt&auml;&auml; Viasat, joka l&auml;hett&auml;&auml; mm. TV1000- ja Cinema-elokuvakanavia sek&auml; pohjoismaisia TV3-kanavia digitaalisena satelliittipositiossa 5&deg;East. Samat kanavat l&ouml;ytyv&auml;t my&ouml;s analogisina D2MAC-normilla l&auml;hetettyin&auml;, samasta suunnasta kuin Canal Digitalin digitaalipakettikin (1&deg;West). Canal Digital k&auml;ytt&auml;&auml; Conax-nimist&auml; salausta ja CAM-moduli on valmiina Philips-virittimen sis&auml;ll&auml;. Viaccess-salauksenpurkua Philipsiss&auml; ei tiet&auml;&auml;kseni ole.</p>
						<p>T&auml;ss&auml; asiassa on menty takapakkia, sill&auml; analogiaikana asiakkaan oli mahdollista tilata kumpikin kanavapaketti (Canal Digital ja Viasat) k&auml;ytt&ouml;&ouml;ns&auml;, koska kaikki kanavat tulivat samasta suunnasta ja virittimiss&auml; oli kaksi korttipaikkaa, eik&auml; erillist&auml; CAM-modulia tarvittu. Nyt kanavat tulevat eri suunnista ja vaativat eri CAM-modulit, joten kaikkien kanavien tilaus vaatii joko sivusy&ouml;t&ouml;n tai k&auml;&auml;ntyv&auml;n lautasen sek&auml; kaksi viritint&auml; tai CAM-modulia. Hankalaa!</p>
						<p>Modeemi ei suinkaan ole v&auml;ltt&auml;m&auml;t&ouml;n asia digitaali-tv:ss&auml;, muutenhan j&auml;rjestelm&auml;&auml; ei voisi k&auml;ytt&auml;&auml; ilman lankaliittym&auml;&auml;. Modeemia tarvitaan vain jos haluaa tilata elokuvia PPV-menetelm&auml;ll&auml; (Pay Per View) kioskikanavilta k&auml;ytt&auml;m&auml;ll&auml; automaattista tilauspalvelua. PPV-j&auml;rjestelm&auml;&auml; on k&auml;ytetty kokeellisesti jo analogisissa j&auml;rjestelmiss&auml;, eik&auml; silloinkaan tarvittu modeemia. Ja mik&auml;li ei osaa tilata oikeaa ohjelmaa digitaaliviritint&auml; k&auml;ytt&auml;en, voi aina soittaa asiakaspalveluun ja hoitaa tilauksen suullisesti. Langattomissa perheiss&auml; t&auml;m&auml; onkin ainoa tapa hy&ouml;dynt&auml;&auml; Kiosk-palveluja.</p>
						<p>Lopuksi viel&auml; kommentti Kemppaalan v&auml;itteeseen salaamattomista kanavista. En osaa sanoa, onko meill&auml; sitten erilaiset virittimet, mutta ainakin minun Philipsill&auml;ni aukeavat my&ouml;s salaamattomat kanavat. Suunnista 13&deg;East (Eutelsat) ja 19&deg;East (Astra) l&ouml;ytyy kummastakin noin 500 digitaalikanavaa, joista osa on salaamattomia. Astrasta saa digitaalisena samat kanavat, jotka l&ouml;ytyv&auml;t analogisella virittimell&auml; PAL-l&auml;hetyksin&auml;. Koska kanavat ovat etup&auml;&auml;ss&auml; saksalaisia ja niill&auml; esitett&auml;v&auml;t elokuvat ja sarjat on saksaksi dubattuja, ei kanavilla ole paljoakaan k&auml;yt&auml;nn&ouml;n arvoa. Ainoa poikkeus voisivat olla t&auml;ll&auml; hetkell&auml; viel&auml; analogiset Viva-musiikkikanavat, jotka valitettavasti siirtyv&auml;t l&auml;hiaikoina Astraan, vertikaalipolarisoiduille transpondereile. T&auml;m&auml; tarkoittaa sit&auml;, ett&auml; n&auml;iden seuraaminen Suomessa vaikeutuu, koska Astran vertikaaliset kanavat ovat todella heikkoja. Jos Vivat tulisivat my&ouml;s digitaalisina, olisi niit&auml; mahdollista seurata, sill&auml; Astran digitaalikanavat kyll&auml; n&auml;kyv&auml;t erinomaisesti my&ouml;s Suomessa. T&auml;ll&ouml;in ilmaisille digikanaville tulisi ensi kertaa jotakin j&auml;rkev&auml;&auml; k&auml;ytt&ouml;&auml;.</p>
						<p>Jossain m&auml;&auml;rin k&auml;ytt&ouml;&auml; voisi olla Astrasta l&ouml;ytyv&auml;lle digitaaliselle radiolle (Canalsat Radios). Se pesee pohjoismaisen veljens&auml;, maksullisen Music Choicen mennen tullen. Homma toimii t&auml;ysin graafisesti - kun katsoja menee ao. kanavalle, viritin kehottaa ilmeisesti ranskaksi odottamaan hetkisen. T&auml;m&auml;n j&auml;lkeen ruutuun tulee ilmoitus, jossa kehoitetaan painamaan SERV-n&auml;pp&auml;int&auml;. Kun siit&auml; painaa, latailee viritin hetkisen, mink&auml; j&auml;lkeen ruutu tulee t&auml;yteen pieni&auml; ikoneita, joiden p&auml;&auml;ll&auml; voi liikkua nuolin&auml;pp&auml;imill&auml;. Jokaisen ikonin kohdalta l&ouml;ytyy radiokanava, ja ikoneita on kolme ruudullista. Kanavia on siis monta kymment&auml;! Painamalla OK ikonin p&auml;&auml;ll&auml; saa ao. radiokanavan ohjelmatiedot (tosin ranskaksi), ja er&auml;ill&auml; kanavilla t&auml;m&auml;kin on tehty graafisena, ulkoasu muistuttaa hieman webbisivua eli mukana on mm. kuvia.</p>
						<p>Lis&auml;ksi radiokanavat l&auml;hett&auml;v&auml;t todella hyv&auml;&auml; musiikkia. Monilla kanavilla n&auml;kee parhaillaan soivan kappaleen esitt&auml;j&auml;n sek&auml; kappaleen nimen. Aivan toista kuin maksullinen Music Choice! Joten hienosti aukeavat my&ouml;s maksuttomat kanavat Philipsill&auml;, en tied&auml; tarkoittiko Kemppaala tekstiss&auml;&auml;n kenties sit&auml;, ett&auml; &auml;lykortin on oltava virittimess&auml; paikoillaan, ett&auml; ylip&auml;&auml;ns&auml; mit&auml;&auml;n voi katsoa, sill&auml; ilman korttiahan tuo vuokraviritin kielt&auml;ytyy t&auml;ysin yhteisty&ouml;st&auml;.</p>
						<p>Huonona puolena vuokravirittimess&auml; ilmaisten kanavien suhteen on muistipaikkojen riitt&auml;m&auml;tt&ouml;myys. Laitteessa on 999 muistipaikkaa, josta Canal Digitalin automaattinen kanavahaku varaa itselleen muistipaikat 1-500. N&auml;it&auml; kanavia k&auml;ytt&auml;j&auml; ei voi poistaa, ei lis&auml;t&auml; eik&auml; muuttaa numerointia. Omia kanavia voi viritt&auml;&auml; 500:sta yl&ouml;sp&auml;in, mutta kun jo Eutelsat-suunnasta tulee tuo muistialue t&auml;yteen, niin mihin tallentaa loput? Viritin etsii vain niin monta kanavaa kuin sill&auml; on vapaita muistipaikkoja. Kunnon digitaalivirittimess&auml; tulisikin olla v&auml;hint&auml;&auml;n 2000 muistipaikkaa!</p>
						<p><font size="2">Esa Heikkinen</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Saku pyrkii asiantuntijoiden avulla selvitt&auml;m&auml;&auml;n ongelmasi ja vastaamaan palautteeseesi Posti-palstan kautta. Voit l&auml;hetell&auml; mielipiteit&auml;si, kysymyksi&auml;si ja vastauksiasi seuraavaan osoitteeseen postitse.<br>
						<br>
						Saku<br>
						c/o Anu Seilonen<br>
						Sammaltie 51<br>
						90650 Oulu<br>
						<br>
						Internet: <a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a><br>
						Sakunet: 65:10/6.0 (Anu Seilonen)<br>
						BBS: Amiga Zone, (015) 348 968 (24h)</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Vakiot</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
