<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Andreas Guldner -->

    <TITLE>nach der Wahl</TITLE>
  </HEAD>

  <BODY background="wolf1.gif" text="#000000" link="#000000" vlink="#0000ff" alink="#000055">
    <BR>
    <BR>
     

    <TABLE width="100%" border="0" cellpadding="10" summary="">
      <TR>
        <TD>
          <H1 align="center"><B>&Auml;nderung, wieso?</B></H1>

          <P>In der letzten NC kam als Diskussionsthema die unab&auml;nderliche
          Tatsache des unaufhaltsamen Fortschritts im Computerbereich auf. Leider
          haben wir das wohl alle verpasst, denn komischerweise hat Wolfgang H. mit
          seinem Text vieles angesprochen das im Argen liegt, weil die Masse
          herdenartig irgentwelchen Trends und "musst du haben" Ideen nachrennt.
          Dadurch kam es dazu, dass Firmen sich haupts&auml;chlich auf diese
          steuerbare Masse eingestellt haben, warum also &Auml;nderungen?????</P>

          <H2><B>der Berg</B></H2>

          <P>Trotz ihrer jungen Jahre als Industriezweig hat sich in der Hard-und
          Softwarebranche ein "weiter so" und "es ist halt wie es ist"
          eingeb&uuml;rgert. Ein erkennbares Interesse an Verbesserungen (wenn sie
          nicht gerade den Absatz steigern) ist oft nicht vorhanden. Die wenigen,
          deren Einsatz zum Bereinigen von Fehlern und Erschaffen wirklicher
          Neuerungen nicht in der Selbsthypnose der Begeisterung f&uuml;r das
          firmeneigene Produkt untergeht, sind halt leider nicht das Beispiel, dem
          die anderen folgen. Das Ziel ist doch trotz eines miesen Produktes zu einem
          hohen Preis Gewinn zu machen. Kunden mit Beschwerden st&ouml;ren da nur.
          Statt also zu &uuml;berlegen, wie man etwas einfach und effektiv erreichen
          kann mit einem Computer der auch funktioniert, verbreitet man Halbgares und
          l&auml;sst Fehler einfach drin, um dann wenn man es doch mal hinbekommen
          hat alte Funktionen als Weltneuheit zu verkaufen. Weil Testreihen ja nur
          Kosten verursachen, k&uuml;rzt man einfach ab oder vermutet das wird schon
          gehen, so spart man Geld und als Beruhigungsmittel schreibt man dann auf
          Verpackungen und in Vor- und Abspann (bei Spielen) wieviele Tester da doch
          drangesessen h&auml;tten! Das dies nicht sein kann, wenn man die
          vorhandenen, klar erkennbaren Fehler betrachtet, hilft einem nichts, weil
          bei der Erw&auml;hnung solcher "M&ouml;glichkeiten" jedes Gepr&auml;ch
          sofort beendet ist. Wenn es so schon Jahrzehnte funktioniert hat,d ie
          Fehler zu Ignorieren anstatt sie zu beheben, warum sollte sich dann etwas
          &auml;ndern? Warum sollten gro&szlig;e Firmen und Quasimonopolisten sich um
          den Kunden k&uuml;mmern, wenn der doch keine Wahl hat?</P>

          <H2><B>Sisyphus</B></H2>

          <P>Als Vergleich von Computeranwender und seinem Rechner passt die antike
          Sage vom Mann, der einen Stein auf einen Berg rollen will und bei dem immer
          kurz vor dem Ziel der Stein wieder herunterrollt. So &auml;hnlich rennen
          Millionen ihrem Wunsch nach einem verstehbaren Computer mit guter
          anwenderfreundlicher Software hinterher. Die Freunde von der
          Computerindustrie sorgen dabei mit einer Steigerung der
          Leistungsanforderungen und zahlreichen Fehlern daf&uuml;r, dass der arme
          Computerbesitzer genausowenig Erfolg haben wird wie die Sagengestalt.
          Schuld daran ist aber auch jeder der nicht versucht sich zu informieren und
          st&auml;ndig vermeintlichen "Schn&auml;ppchen" nachrennt. Wenn kein
          Beratungsbedarf entsteht und nicht individuelle Ger&auml;te gefordert
          werden, ist es nur logisch, dass Massenware den Markt dominiert und dann
          Produkte nicht extra ausgesucht sondern im Paket mitgeliefert werden.
          Dieser Pseudomehrwert sorgt dann f&uuml;r hohe St&uuml;ckzahlen und es ist
          kaum anzunehmen, dass "automatisch" vertriebene Produkte besonders gewartet
          oder gepflegt werden, weil der K&auml;ufer mit seiner Entscheidung ja schon
          sein Desinteresse an der Computertechnik gezeigt hat. Solange die Masse den
          Umsatz bestimmt und diese alles so hinnimmt, kann sicher keine Kleinfirma
          selbst mit dem besten (oder gar perfekten) Produkt gegen die Gro&szlig;en
          bestehen. Die Firmen welche allein oder nur mit 1-2 Konkurrenten arbeiten
          m&uuml;ssen doch gar nichts &auml;ndern, da nur Totalverzicht an ihren
          Produkten vorbeif&uuml;hrt. Der Einfluss der Kunden ist meiner Meinung nach
          sehr gering im "Standardmarkt" und eher in Nischen vorhanden (Amiga, Linux,
          Mac).</P>

          <H2><B>der Stein</B></H2>

          <P>Computer und Fortschritt sollten zusammengeh&ouml;ren aber:<BR> die
          Masse der Besitzer solcher Rechenknechte will nicht oder traut sich nicht
          Fehler beim "hochtechnischen perfekten" Computer zu suchen. Die Hard- und
          Softwarefirmen m&uuml;sste, wenn sie ein Anrecht auf fehlerfreie Produkte
          anerkennen w&uuml;rde, Unmengen von Geld investieren anstatt abzuwarten bis
          die st&auml;ndig sich ver&auml;ndernde Austattung den Fehler per Neukauf
          behebt. Ein langfristig einsetzbarer effektiver Computer w&uuml;rde keine
          dauerhafte Orientierung am Umstieg auf "modernere" Rechner zulassen.</P>

          <P>Andreas Guldner</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

