<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Interview Nr 1</TITLE>
  </HEAD>

  <BODY background="nc_bg2.jpg" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <CENTER>
            <P><FONT color="#000080" size="7"><B>Amiga Arena
            Interview</B></FONT></P>

            <TABLE width="60%" cellpadding="0" cellspacing="0"
            summary="">
              <TR>
                <TD valign="top">Entwickler:</TD>
                <TD><B>Stefan Burstroem</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Software:</TD>
                <TD>IBrowse</TD>
              </TR>

              <TR>
                <TD valign="top">Homepage:</TD>
                <TD>www.ibrowse-dev.net</TD>
              </TR>

              <TR>
                <TD valign="top">Email:</TD>
                <TD>-</TD>
              </TR>
            </TABLE>
          </CENTER>

          <P><FONT color="#006000"><B>Hallo Stefan, kannst Du uns
          bitte etwas &uuml;ber Dich und Deinen Amiga-Werdegang
          erz&auml;hlen?</B></FONT><BR>
           Ich bin 28 Jahre alt und bin seit 1994 aktiver
          Amiga-Entwickler. Ich arbeite als Systemarchitekt
          f&uuml;r eine Firma namens Anoto (www.anoto.com), wo ich
          systemintegrierte Software und Elektronikdesigns
          entwerfe. Mein erster Computer war ein C64 den ich in-
          und auswendig lernte :)</P>

          <P><FONT color="#006000"><B>Seit 2001 haben Du und Dein
          Team die Weiterentwicklung von IBrowse &uuml;bernommen,
          wie kam es zu diesem Entschluss und was brachte Euch
          dazu, das zu tun?</B></FONT><BR>
           Das urspr&uuml;ngliche Omnipresence-Team war mit anderen
          Dingen besch&auml;ftigt und da ich der einzige war, der
          noch aktiv an IBrowse arbeitete, beschlossen wir, alle
          Rechte an IBrowse auf mich zu &uuml;bertragen.</P>

          <P><FONT color="#006000"><B>Wer sind die aktuellen
          Team-Mitglieder?</B></FONT><BR>
           Ich, Oliver Roberts, David Burstr&ouml;m und Dave Fisher
          sind die Kernentwickler. Dann haben wir eine Handvoll
          interner Alphatester, die uns mit allem nerven, was nicht
          funktioniert.</P>

          <P><FONT color="#006000"><B>Wie lange hast Du an der
          Entwicklung von IBrowse teilgenommen?</B></FONT><BR>
           Seit dem Beginn des Projekts 1995.</P>

          <P><FONT color="#006000"><B>Welche Software verwendest Du
          zum Entwickeln?</B></FONT><BR>
           Momentan wird f&uuml;r die gesamte 68k-Entwicklung das
          SAS/C-Paket verwendet. F&uuml;r PPC verwenden wir
          gcc.<BR>
           Mein Lieblingseditor ist Ced.</P>

          <P><FONT color="#006000"><B>Welche M&ouml;glichkeiten
          vermisst Du am AmigaOS f&uuml;r das
          Entwickeln?</B></FONT><BR>
           Hm, die kurze oder die lange Liste?<BR>
           Vereinheitlichtes GUI, Multiuser-Unterst&uuml;tzung, 3D-
          und Spiele-API.</P>

          <P><FONT color="#006000"><B>Welche M&ouml;glichkeiten
          w&uuml;nscht Du Dir f&uuml;r das Entwickeln am
          Amiga?</B></FONT><BR>
           Ein grafisches Versionskontrollsystem.<BR>
           Ich verwende Rational ClearCase schon seit einer ganzen
          Weile und ich w&uuml;rde sagen es rockt verglichen mit
          textbasiertem CVS :)<BR>
           Ich habe deswegen begonnen, ein paar grafische Frontends
          f&uuml;r CVS zu schreiben wenn ich es brauche :)</P>

          <P><FONT color="#006000"><B>Lange Zeit was es ziemlich
          still um IBrowse, was waren die Gr&uuml;nde daf&uuml;r
          bzw. was sind die generellen Probleme, so ein Projekt
          kontinuierlich zu f&uuml;hren?</B></FONT><BR>
           Pers&ouml;nliche Gr&uuml;nde.<BR>
           Ich habe einen ziemlich anspruchsvollen Job und bin ein
          ziemlich aktiver Fallschirmspringer, und das verschlingt
          Zeit.<BR>
           Die generellen Probleme w&auml;ren, den Fokus zu
          behalten.<BR>
           Da IBrowse mehr oder weniger ein Hobbyprojekt ist, ist
          es manchmal schwer, die Motivation f&uuml;r langweilige
          Arbeiten aufzubringen :)</P>

          <P><FONT color="#006000"><B>Was motiviert Dich
          pers&ouml;nlich, solch eine Aufgabe mit zu
          &uuml;bernehmen?</B></FONT><BR>
           Ich habe die Aufgabe nicht wirklich &uuml;bernommen.<BR>
           IBrowse war von Anfang an mein Baby. Es ist manchmal
          schwer, die Motivation aufzubringen, bis sp&auml;t in die
          Nacht zu arbeiten, aber am Ende macht es Freude zu sehen,
          das etwas, was Du erschaffen hast, von tausenden anderen
          Leuten verwendet wird. Au&szlig;erdem macht Programmieren
          viel Spa&szlig;, also warum nicht etwas n&uuml;tzliches
          tun :)</P>

          <P><FONT color="#006000"><B>Kommen wir zur neuen Version
          2.3, welche lang ersehnten Features w&uuml;rdest Du
          hervorheben, und welche werden noch stark
          vermisst?</B></FONT><BR>
           Die Javascript-Engine ist stark verbessert worden und
          praktisch alle Absturz-Bugs sollten nun hoffentlich
          verschwunden sein.</P>

          <P><FONT color="#006000"><B>Die User w&uuml;nschen sich
          Features wie CSS noch vor Flash, wird dies m&ouml;glich
          sein und falls ja kannst Du uns jetzt schon sagen in
          welcher Version?</B></FONT><BR>
           Ja, das ist sicherlich m&ouml;glich und wird in IBrowse
          3.0 bzw. 2.4 enthalten sein.</P>

          <P><FONT color="#006000"><B>Was hebt Ibrowse 2.3 von AWeb
          und Voyager ab?</B></FONT><BR>
           Wei&szlig; ich wirklich nicht.<BR>
           Ich mag IBrowse einfach lieber, aber das ist ein
          pers&ouml;nliches Gef&uuml;hl.</P>

          <P><FONT color="#006000"><B>Siehst du nicht die Gefahr,
          dass die User lieber auf die Freeware Variante von AWeb
          zur&uuml;ckgreifen, anstatt einen kommerziellen Browser
          zu kaufen/nutzen?</B></FONT><BR>
           Nicht wirklich. Wenn AWeb ein fortschrittlicherer oder
          auf einem nicht-Amiga-Projekt basierender Browser
          w&auml;re, dann w&uuml;rde ich sagen, es w&auml;re auf
          lange Sicht eine bessere Wahl. Aber wie die Dinge stehen,
          wird AWeb nie ein besserer Browser als IBrowse sein.
          (Besser ist nat&uuml;rlich individuell verschieden, aber
          ich meine so als durchschnittliches Gef&uuml;hl
          genommen).<BR>
           Und ernsthaft, falls AWeb viel besser rauskommen sollte,
          w&uuml;rde ich sagen 'toll'. Vielleicht w&uuml;rde ich
          dann sogar einspringen und ein paar zus&auml;tzliche
          Verbesserungen machen :)</P>

          <P><FONT color="#006000"><B>Was war der Grund, IBrowse
          von IOSPIRIT vertreiben zu lassen und wie kam der Kontakt
          mit Felix Schwarz zustande?</B></FONT><BR>
           Ich hatte erfahren, dass Felix Interesse hatte, IBrowse
          zu vertreiben, und ich suchte einen neuen Vertrieb.</P>

          <P><FONT color="#006000"><B>Bist Du mit den Downloads
          f&uuml;r das Update bzw. den Verk&auml;ufen der neuen
          Version zufrieden?</B></FONT><BR>
           Ich m&ouml;chte keine Zahlen nennen, aber unter den
          gegenw&auml;rtigen Umst&auml;nden sind wir mit dem
          Fortschritt zufrieden.</P>

          <P><FONT color="#006000"><B>Braucht der Amiga-Markt
          wirklich drei verschiedene Browser, oder sollten die
          Kr&auml;fte nicht besser vereint werden?</B></FONT><BR>
           Ich bezweifle, dass es helfen w&uuml;rde, die
          Anstrengungen zu kombinieren. Ich begann mit der
          IBrowse-Entwicklung nicht, weil ich die gro&szlig;e
          Ahnung hatte. Tats&auml;chlich hatte ich gar keine
          Ahnung.<BR>
           Ich begann bei Null.<BR>
           Aber mit meinem Hintergrund war ich in der Lage, eine
          sehr netten Browser zu erschaffen.<BR>
           Und ich bin sicher, die Voyager- oder AWeb-Leute sind
          genauso talentiert, es ist mehr eine Sache des
          W&auml;hlens, mit wem Du an einem Projekt arbeiten
          m&ouml;chtest.</P>

          <P><FONT color="#006000"><B>Was sch&auml;tzt Du an AWeb
          oder Voyager?</B></FONT><BR>
           Hm, schwer zu sagen. Ich verwende sie nicht sehr
          oft.<BR>
           Aber wie mit jeder Software ist es immer gut eine
          Vergleichsm&ouml;glichkeit zu haben. Ich verwende sie oft
          als Benchmarks um zu messen wie schnell IBrowse
          l&auml;uft. Wenn ich IBrowse dazu kriegen kann, etwas
          zweimal so schnell wie sie zu machen, dann wei&szlig;
          ich, dass IBrowse effizient ist.<BR>
           Wenn Du keine Vergleichsm&ouml;glichkeit hast, tendierst
          Du dazu, faul zu werden. Aber wenn jemand etwas besser
          als Du gemacht hat, brauchst den Kerl nur zu schlagen :)
          Damit will ich nicht gesagt haben, dass IBrowse bei allem
          schneller ist als Voyager oder AWeb, ich sage nur, dass
          es gut ist, eine Vergleichsm&ouml;glichkeit zu haben.</P>

          <P><FONT color="#006000"><B>Was denkst du erschwert es,
          die Arbeit an einem Amiga Browser auf das Niveau der
          PC-Browser zu bringen?</B></FONT><BR>
           Geld. Wenn ich die Finanzierung f&uuml;r 2 Jahre eines
          10-Personen-Projekts h&auml;tte, bin ich ziemlich sicher,
          dass wir in der Lage w&auml;ren, einen IE, NSN und Opera
          vergleichbaren Amiga-Browser zu schaffen, aber das ist
          unm&ouml;glich zu finanzieren.</P>

          <P><FONT color="#006000"><B>Wie wird die Zukunft von
          IBrowse aussehen, und welche Features w&uuml;nscht Du
          Dir, die IBrowse bald unterst&uuml;tzen
          soll?</B></FONT><BR>
           Die Zukunft sieht ziemlich rosig aus, w&uuml;rde ich
          sagen. Siehe unten f&uuml;r die Features von
          IBrowse3.0</P>

          <P><FONT color="#006000"><B>In wie weit wird sich die
          Version von IBrowse in AmigaOS 4.0 von 2.3
          unterscheiden?</B></FONT><BR>
           Die AOS4-Version gleicht der Demoversion mit Ausnahme
          von ein paar Dingen, z.B. gibt es dort nat&uuml;rlich
          keine Zeitbeschr&auml;nkung.</P>

          <P><FONT color="#006000"><B>Was k&ouml;nnen wir von
          IBrowse 3.0 erwarten, und wann denkst Du wird es
          ver&ouml;ffentlicht?</B></FONT><BR>
           IBrowse3.0 wird CSS, HTML 1.0-4.0, XHTML 1.0 und
          vielleicht XML/XSL unterst&uuml;tzen. Dann wird die
          Javascript-Engine viel schneller werden.<BR>
           Und wir werden so viele von Benutzern gew&uuml;nschte
          Features wie nur m&ouml;glich hinzuf&uuml;gen
          (Tab-Browsen in 2.x war z.B. so eine Sache)</P>

          <P><FONT color="#006000"><B>Was w&uuml;nscht Du Dir
          f&uuml;r die Zukunft des AmigaOS bzw. des
          Amiga-Sektors/-Markts?</B></FONT><BR>
           Vielleicht, dass Entwickler und User aufh&ouml;ren, auf
          ann.lu st&auml;ndig aufeinander einzupr&uuml;geln?</P>

          <P><FONT color="#006000"><B>Glaubst Du an ein Comeback
          von Amiga?</B></FONT><BR>
           Wenn Du mit Comeback Amiga und AmigaOS als eine
          f&uuml;hrende Plattform f&uuml;r B&uuml;ro- und
          Heimanwendung meinst, muss ich nein sagen.<BR>
           Wenn Du Dir vorstellst, dass Windows Marktanteile
          abgibt, dann gibt es da noch ein paar andere
          Alternativen, bevor AmigaOS wachsen wird. Aber ich
          w&uuml;rde mich wirklich freuen, wenn es als
          Nischen-Betriebssystem Erfolg h&auml;tte.</P>

          <P><FONT color="#006000"><B>Deine letzen Worte an die
          Leser?</B></FONT><BR>
           Blauer Himmel!</P>

          <P align="center">-- &copy; Amiga Arena 03/2003 --<BR>
           (aus dem Englischen &uuml;bersetzt von Christian
          Busse)</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

