<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Leserbrief</TITLE>
  </HEAD>

  <BODY background="wolf1.gif" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>ReadMe an
          Wolf</B></FONT></P>

          <H3>Hallo Wolf</H3>

          <P>Das Remake von NC-01 fand ich sehr gut, es kann ja auch f&uuml;r alle
          Sp&auml;teinsteiger und reine Onlineleser die Orginalfassung zu Beginn
          dieses "Clubmagazins" darstellen. Da ich zu den Leuten geh&ouml;re, die
          zwar die alten"Magnetic Pages" Ausgaben gelesen haben, aber bis zur
          Umstellung auf HTML warteten bis sie selbst etwas Text beitrugen, denke
          ich, dass es heute schon leichter ist aktiv mitzumachen. Leider geht die
          Grundrichtung wohl eher zum Nurkonsumenten und ohne neue Vielschreiber wird
          ein Umfang wie am Anfang heute nicht mehr zu machen sein. Obwohl ich die
          NoCover gerne lese und den R&uuml;ckzug der AmigaAktuell bedauere sollte
          nicht vergessen werden, dass mit AmigaFuture und AmigaPlus zwei Magazine
          ebenfalls Computerthemen behandeln und wenn man dann weiterschaut gibt es
          noch viele andere PC-, Mac-, Konsolen-, Hobby-, Sport- usw Magazine,
          weshalb meiner Meinung nach die Idee einfach alles in die NC einzubauen
          sicher genauso schwer ist wie ein spezifisches AmigaMag plus Extras.
          Vorallem die Idee zum Artikel ist nicht gerade einfach zu haben, wobei ich
          bei mancher der seltenen Neuheiten (zB f&uuml;r Amiga) mich schon frage, ob
          das entweder keiner kauft oder keiner der K&auml;ufer schreibwillig ist.
          Hoffentlich kommt f&uuml;r NC-109 genug zusammen, auch wenn mir zB nur 2
          kleine Beitr&auml;ge einfallen.</P>

          <P>MFG Andreas Guldner</P>

          <P>&nbsp;</P> <HR>

          <H3>Hallo Andreas</H3>

          <P>Du wunderst dich vielleicht etwas, dein LiesMich hier wieder zu finden.
          Ich m&ouml;chte zu den Gr&uuml;nden der Ver&ouml;ffentlichung folgendes
          sagen:</P>

          <UL>
            <LI>Erstens kann es ruhig jeder lesen,</LI>

            <LI>zweitens kann ich dir adhoc antworten und</LI>

            <LI>drittens m&ouml;chte ich den &Uuml;brigen zeigen, dass ich mich auch
            freue, wenn bei den Einsendungen zur Ver&ouml;ffentlichung auch hin und
            wieder pers&ouml;nliche Worte beiliegen.</LI>
          </UL>

          <P>Nun zur Antwort hier an dieser Stelle, da  ich  dich  leider  nicht  per
          EMail  erreichen  kann.  Und die Zeiten, dass ich Briefe in Form von Papier
          und Umschlag schreibe sind f&uuml;r mich  bald  schon  ungewohnt.Aber  ganz
          ehrlich,  das h&auml;ngt auch mit einem sehr gro&szlig;en Teil mit Faulheit
          zusammen. EMail und FAX gehen halt mal  schneller  und  ich  brauche  nicht
          aufzustehen.</P>

          <P>Das Remake war eigentlich schon l&auml;nger eine Idee von mir, nur hatte
          ich mich nie so recht daran gemacht. Dann bekam ich von Rainer Wrieden  aus
          Spanien  sein  Remake zugesandt, er hatte alle Seiten des Magazins als Bild
          auf einer HTMLseite gebracht, sodass die MagneticPage Seiten eins  zu  eins
          dargestellt  sind.  F&uuml;r  einen Amigaanwender ist es aber wirklich viel
          einfacher die Magazine in der Originalfassung zu betrachten und zu steuern,
          als  die in unendlicher M&uuml;he erstellten HTML-seiten. Aus diesem Grunde
          habe ich ein reines HTML-Magazin  daraus  gemacht,  aber  das  Feeling  der
          Magnetic  Page  Zeiten beibehalten. Erstens geht dies so schneller zu lesen
          und zweitens wird so viel weniger Bytes ben&ouml;tigt. Aber es steckt  sehr
          viel  Zeit  in  dieser  Art der Erstellung. F&uuml;r NC-2 habe ich bestimmt
          &uuml;ber einen halben Monat ben&ouml;tigt. Ob ich f&uuml;r  NC-3  f&uuml;r
          die  Ausgabe  NC-110  so  viel  Zeit im April aufwenden kann, kann ich noch
          nicht  absehen.  Schlie&szlig;lich  m&ouml;chte  ich  vorrangig  die   neue
          NC-Homepage ins Laufen bringen.</P>

          <P>Bez&uuml;glich  des  Inhaltes der NoCover habe ich noch nie eine Vorgabe
          gemacht.  Meiner  Meinung  nach  w&auml;re  es  aber  sehr  opportun,  auch
          weiterhin  Amiga spezifische Artikel ebenfalls zu ver&ouml;ffentlichen. Ein
          Kohlenh&auml;ndler verkauft auch  heute  noch  Kohlen,  obwohl  99%  seiner
          Lieferungen  aus  Heiz&ouml;l  bestehen. Warum soll es nicht auch bei einem
          alten Amigamagazin so sein? Die beiden angesprochenen Paper-Magazine werden
          von Redakteuren "mit Gehalt" erstellt. Die NoCover war immer eine Plattform
          von User f&uuml;r User. Und an diesem Modell versuche ich festzuhalten,  da
          es wohl immer noch auf dem Amigasektor einzigartig ist.</P>

          <P>Alle Gute bis zum n&auml;chsten Mal,<BR>
          Wolf.</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

