<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>J&uuml;rgen an Wolf</TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
  </HEAD>

  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink=
  "#ff0000" alink="#ff9900">
    <TABLE summary="" border="0" cellspacing="0" cellpadding="8">
      <TR>
        <TD>
          <H1 align="center">J&uuml;rgen an Wolf</H1>
          <BR>
           

          <H2>Hallo, Wolf</H2>
          <BR>

          <P>Die Tage dachte ich auch dar&uuml;ber nach, wie man
          die NoCover bekannter machen k&ouml;nnte.<BR>
           Eine Sache, die mir in den Sinn kam: Vielleicht gibt es,
          so wie ich, Autoren der NC, die keine Homepage ihr Eigen
          nennen k&ouml;nnen.<BR>
           Mein Gedanke war nun: Die Angabe der Adresse
          <I>http://apc-tcp.de/nocover/mitglieder/name.html</I>
          z.B. in der eigenen E-Mail Adresse.<BR>
           Vielleicht schaut der eine oder andere, der solch eine
          E-Mail bekommen hat, mal unter dieser Adresse nach, wer
          denn der Absender der Mail ist, und ist dann automatisch
          in der NoCover.</P>

          <P>Aber das scheitert wohl an zwei Dingen:<BR>
           1. APC-TCP hat ja nichts mehr mit der NoCover zu tun und
          stellt der NC nur deren Platz zur Verf&uuml;gung.<BR>
           2. Die NC hat ja einen sich monatlich &auml;ndernden
          Namen (NC-XXX).</P>

          <P>Was meinst du Wolf?<BR>
           Lie&szlig;e sich soetwas in der Art realisieren?</P>
          <BR>
           Mach`s gut...<BR>
           
          <HR>

          <CENTER>
            <TABLE border summary="">
              <TR>
                <TH bgcolor="#CCCCCC"><FONT color=
                "#f3300CC">JoJo</FONT> &nbsp; J&uuml;rgen
                Sperling</TH>
              </TR>

              <TR>
                <TH bgcolor="#FFFFCC">
                sperlingbergen@freenet.de</TH>
              </TR>
            </TABLE>
          </CENTER>
          <HR>

          <H1 align="center">Wolf's Antwort an J&uuml;rgen</H1>
          <BR>

          <H2>Hallo J&uuml;rgen</H2>
          <BR>

          <P>Der alte R&ouml;mer Cato war ber&uuml;hmt f&uuml;r
          seine kurzen Briefe - geschrieben auf &auml;gyptischen
          Papyros - und dieser h&auml;tte dir geantwortet: "NIHIL".
          Das bedeutet in diesem Zusammenhang: Damit ist nichts.
          Auf die R&uuml;ckfrage h&auml;tte er dann geschrieben:
          "NE". Und sonst nichts. Sein k&uuml;rzester Brief
          lautete:"I" und das heisst: Gehe oder auch: Hau ab.</P>

          <P>So kurz m&ouml;chte ich es wirklich nicht machen,
          sondern dir auch eine Erl&auml;uterung dazu geben:<BR>
           Die Homepage apc-tcp.de geh&ouml;rt Andreas Magerl, dem
          Gr&uuml;nder von APC&amp;TCP und dem damaligen
          Computerclub mit gleichem Namen. Es waren aber zwei
          verschiedene Instutionen. Heute gibt es nur noch den
          gesch&auml;ftlichen Zweig mit diesem Namen und die
          NoCover - seinerzeit das Clubmagazin des
          nichtgesch&auml;ftlichen Zweiges - wird freundlicherweise
          weiterhin unter dieser Adresse gepostet.</P>

          <P>Nichts gegen Bekanntmachung des Magazins, aber wenn du
          Au&szlig;enstehenden gleich in eine Mitgliederkartei
          hinein leitest, dann gibt es f&uuml;r professionelle
          Mailadressen Sammler doch einen kostenlosen Service, sich
          diesbez&uuml;glich zu bedienen. Und so Mancher, der keine
          T-Online Anschrift hat, wird auch pl&ouml;tzlich mit Sex-
          und sonstigen Angeboten bombardiert und wundert sich.</P>

          <P>Solltest du pers&ouml;nlich den Wunsch haben, dass
          Au&szlig;enstehende dich kennenlernen, dann wirst du
          nicht umhinkommen, eine eigene Website zu erstellen oder
          bei einem Freund eine eigene Unterseite auf dessen
          Website einzurichten.</P>

          <P>Du bist doch Kunde bei "freenet.de", die bieten doch
          auch recht kosteng&uuml;nstig Webspace f&uuml;r eine
          Homepage an.</P>

          <P>Auch wenn es im ersten Augenblick nicht ganz
          einleuchtend klingt, ich bin kein Bef&uuml;rworter deines
          Wunsches, auch wenn nun alle sagen, die NoCover ist doch
          "public", also d&uuml;rfte niemand etwas dagegen haben,
          dass seine Anschrift bekannt wird. Nat&uuml;rlich haben
          wir fremde Leser auf der Online-Version, aber doch nur
          solche, die gezielt &uuml;ber eine Stichwortsuche hierher
          gelangen oder jemand der sich durch Zufall verirrt
          hat.</P>

          <P>Um es den professionellen Sammlern nicht allzu leicht
          zu machen, sende ich euch allen die NoCover-Mitteilungen
          anonym, damit nicht irgendwo die Adressen abgefischt
          werden k&ouml;nnen. Und &uuml;ber 70 weitere Adressen
          freut sich doch so mancher Unternehmer.</P>

          <P>Auch wenn ich den Brief f&uuml;r dich nicht positiv
          beantwortet habe, bitte ich dich meine Stellungsnahme
          nicht zu verteufeln, sondern als meine Marotte anzusehen
          und bitte diese so zu akzeptieren.</P>

          <P>Eine Erh&ouml;hung des Bekanntheitsgrades der NoCover
          w&auml;re bestimmt sehr erw&uuml;nscht, aber mit was soll
          ich werben, wenn nichts da ist, das angeboten werden
          kann. Alle wollen etwas zu lesen bekommen, aber sehr
          wenige schicken etwas zu Lesen. Der Sektor Amiga ist
          zwischenzeitig restlos verarmt und ich habe keine
          Informationen, die ich mitteilen k&ouml;nnte. Und
          diejenigen, die diese haben, schreiben nichts. Du siehst,
          doch recht verteufelt f&uuml;r ein Amiga-Magazin.</P>

          <P>Mach's gut,<BR>
          Wolf.</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

