<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Signale im Leuchtfeuer</TITLE>
  </HEAD>

  <BODY background="wolf1.gif" text="#000000" bgcolor="#b0b0b0">
    <A name="top"></A> 

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="6"><B>Hanno
          Erdwein<BR>
           Signale im Leuchtfeuer</B></FONT></P>

          <P>Nebeldicker Zigarettenrauch f&auml;rbt die Gesichter
          der f&uuml;nf M&auml;nner grau ein. Die Thermoskanne
          zwischen ihnen auf dem nackten Holztisch hat au&szlig;er
          einem Bodensatz brauner Fl&uuml;ssigkeit nichts zu
          bieten, was &uuml;ber den rest der Nacht hinweghilft. Ein
          diffuses Gelb der altersschwachen Neonr&ouml;hre an der
          Decke l&auml;sst die spartanische Einrichtung mehr
          erahnen als klar hervortreten. Niemand investiert einen
          m&uuml;den Dollar in eine so hoffnungslose Sache wie die
          Erforschung des Weltraums. Und auch dieser letzte
          Au&szlig;enposten inmitten des asiatischenn Niemandslands
          steht kurz vor dem Aufgeben. Noch tasten
          routinem&auml;&szlig;ig die drei Teleskopspiegel den
          Himmel ab, sind die Empfangsanlagen auf der Frequenz des
          ESA-Satelliten standby. Nichts wird empfangen, nichts
          seit f&uuml;nfeinhalb Jahren, was die &Ouml;ffentlichkeit
          aus ihrer auf ausschlie&szlig;lichen Konsum
          ausgerichteten Gleichg&uuml;ltigkeit aufr&uuml;tteln
          k&ouml;nnte. Und f&uuml;r Nichts gibt es keine
          F&ouml;rdermittel. Seufzend erhebt sich einer der
          f&uuml;nf, reckt seine langen Glieder, streicht sich
          &uuml;ber das kurzgeschorene Haar und tritt an das
          kreisrunde Fenster. Der Sand der W&uuml;ste schimmert im
          Licht eines fast vollen Mondes. Chemenhaft ragen da und
          dort die langen Finger der Kakteen empor. Ein SChatten
          huscht vor&uuml;ber, ein Schahkal auf Beutefang oder
          eines dieser scheuen W&uuml;stenratten? Das alles wird
          bald Vergangenheit sein, wenn es hei&szlig;t: Die Koffer
          packen. Und auf dem Rollfeld ein letztes Shake-Hands,
          bevor der eine nach Frankreich, ein zweiter und dritter
          nach England und Deutschland, der Vierte nach Russland
          und er selbst in die USA abfliegen wird. Er hebt den
          Blick zum gestirnten Himmel. Trotz des Mondlichts treten
          die vier Ecksterne des Pegasus deutlich hervor und
          dar&uuml;ber die schmale Kette der Andromeda. Ein Traum
          geht zu Ende, eine Hoffnung, mehr &uuml;ber das kosmische
          Geschehen in Erfahrung zu bringen, eine Antwort auf die
          uralte Frage zu finden, ob wir allein im Weltall sind.
          Bei den abermilliarden Sternen, Kugelsternhaufen und
          Galaxien w&auml;re es Wahnsinn anzunehmen, dass dies
          alles nur von einem kleinen unbedeutenden Planeten in
          einem noch unbedeutenderen Milchstra&szlig;enarm aus
          bewusst wahrgenommen wird. Ein so aufwendiges Feuerwerk
          nur f&uuml;r uns allein? Dies anzunehmen w&auml;re
          Vermessenheit. Und dieser Gedanke hat in immerr schon
          bewegt, ihn die Laufbahn eines Astronomen einschlagen
          lassen, ihn hier in die asiatische W&uuml;ste
          gef&uuml;hrt, wo er ganz seiner Arbeit hingegeben das
          Leben eines asketischen M&ouml;nchs f&uuml;hrt. Vorbei.
          In seiner Tasche steckt das Fax, welches ihn, den Leiter
          der Station auffordert, die Aufl&ouml;sung
          einzuleiten.</P>

          <P>Er seufzt abermals und wischt sich mit dem
          Handr&uuml;cken &uuml;ber die Stirn. Sirenengeheul
          l&auml;sst ihn in der Bewegung innehalten und sich
          ruckartig umwenden. Schon sieht er, wie Daniel, der
          Deutsche aufspringt und zur T&uuml;r sprintet. Alle
          M&uuml;digkeit ist von den Gesichtern gewichen. Die
          Augenpaare blicken ihn erwartungsvoll gl&auml;nzend an.
          Zigaretten werden ausgedr&uuml;ckt und die Haltung
          signalisiert Bereitschaft, auf Anordnung sofort zu
          reagieren. Jeder einzelne wei&szlig;, was der Alarm
          bedeutet, ist durch stundenlanges Training auf diesen
          Fall vorbereitet. Es bedarf keiner
          &uuml;berfl&uuml;ssigen Fragen. Seine Hand greift in die
          Jackentasche, zieht einen Streifen Kaugummi heraus, den
          er mit nerv&ouml;sen Bewegungen von einer Backe in die
          andere wandern l&auml;sst. Die T&uuml;r springt auf.
          Daniel schwenkt triumpfierend ein mit Daten dicht
          bedrucktes Blatt, das er zwischen die Kaffeetassen und
          Aschenbecher auf den Tisch gleiten l&auml;sst. F&uuml;nf
          K&ouml;pfe beugen sich dar&uuml;ber, atemlos die Werte
          pr&uuml;fend. "Das ist es", knurrt Yuri, der Russe. "Wir
          haben es geschaft, Old Fellow!" Die derbe Faust Toms, des
          grobschl&auml;chtigen Engl&auml;ndersdrischt auf die
          Schulter des zarter gebauten Antoine aus Frankreich los.
          Der zuckt nicht einmal und sch&uuml;ttelt immerfort
          seinen schwarzen Lockenkopf. Was ist Ihre Meinung, Sir",
          wendet sich Daniel an den Leiter Simon, der mit so
          vorsichtigen Bewegungen an den Tisch herantritt, als
          gelte es, ein vermintes Feld zu durchqueren. Nach einer
          Weile wortloser Kaubewegungen brummt er: "Sieht so aus,
          als h&auml;tten wir einen erwischt." Alle kennen die
          karge Art Ted Simons, nicht viel Wortger&auml;usch zu
          machen, besonders, wenn es um wesentliche Dinge geht. So
          hatte er beispielsweise die Tatsache, dass die Station
          aufgegeben werden soll mit dem Satz kommentiert: "Das
          wars dann wohl, Jungs." Nun pr&uuml;ft er aus schmalen
          Augenschlitzen die Zahlenreihen, streicht nachdenklich
          &uuml;ber sein B&uuml;rstenhaar und blickt Daniel an:
          "woher?" "Aus Andromeda." "Pr&auml;zise?" Daniel
          r&auml;uspert sich verlegen und beeilt sich: "Der Gamma
          Reburst kommt aus der gro&szlig;en Andromeda-Galaxie."
          "Los Jungs, an die Spiegelteleskope!" Seine Hand wischt
          &uuml;ber Tom und Antoine. "Yuri, sie belauschen die
          Radiowellen und Daniel liegt im Gammabereich weiter auf
          der Lauer." Zu sich selbst meint er: "M&ouml;chte wetten,
          dass da noch mehr kommt!"</P>

          <P>Die Einteilung ist &uuml;berfl&uuml;ssig. Seit Jahren
          liegt sie fest. Nach wenigen Stunden h&auml;ufen sich die
          Daten auf Simons Schreibtisch, der sie dem
          Gro&szlig;rechner zu fressen gibt. Dieser Energieausbruch
          aus dem Andromedanebel ist spektakul&auml;r. Und kaum,
          dass etwas davon an die &Ouml;ffentlichkeit gedrungen
          ist, stehen die Telefone der Station nicht mehr still.
          Die Kollegen der rasch wieder ins Leben gerufenen
          &uuml;brigen sTationen fordern Daten an. Presse, Funk und
          Fernsehen erwarten Statements, Regierungsbeamte zeigen
          pl&ouml;tzlich erwachtes Interesse f&uuml;r diesen
          bereits totgesagten zweig der Forschung. Dann noch die
          Flut besorgter B&uuml;rger, die eine Art
          WEltuntergangspanik zeigen und beruhigt werden
          m&uuml;ssen. Aus ist es mit der stillen Forschungsarbeit.
          Er hat nur noch zwischen Faxger&auml;t, Internet und
          Telefon hin und her zu springen.</P>

          <P>"Ted, ich hab was merkw&uuml;rdiges entdeckt." Yuri
          streckt den Kopf zur T&uuml;r herein und zeigt auf eine
          Cassette in seiner Hand. "Komm rein und dr&uuml;ck mal
          auf den Knopf da." Die Hand des Leiters zeigt auf die
          Zentralsperre an der Wand. Mit einem Schlag verstummt das
          Dauergebimmel, h&ouml;ren die Datenger&auml;te auf zu
          rattern. Simon st&ouml;hnt erleichtert auf, schiebt sich
          einen frischen Kaugummi in die Backe und fordert Yuri
          auf: "Schie&szlig; los, Old Fellow!" Der steckt die
          Cassette in einen Recorder, startet und blickt Simon
          gro&szlig;&auml;ugig an. "Was ist das?", fragt der,
          scheinbar wenig beeindruckt. "Wei&szlig; nicht. H&ouml;rt
          sich an, als w&auml;ren es modulierte Signale." "Woher?"
          "Andromedanebel." "Kein Zufallsprodukt?" "Daf&uuml;r sind
          die Sequenzen zu pr&auml;zise." "Lass mal hier. Wollen
          sehen, ob unser Schlaumeier damit was anfangen kann."
          Yuri grinst zweiflerisch und schl&uuml;pft hinaus.</P>

          <P>Bilder und Radiogeknatter des gro&szlig;en Ausbruchs
          im Andromedanebel, der Nachbargalaxie, machen die Runde
          um den Erdball. Die aktuellen Tagesmeldungen jeder
          Sprache berichten ausf&uuml;hrlich dar&uuml;ber.
          Wissenschaftler werden befragt, geben vage bis
          ausweichende Stellungnahmen ab. Man wei&szlig; noch zu
          wenig von diesen kosmischen Ereignissen. So wird die
          Erdbev&ouml;lkerung mit Mutma&szlig;ungen gef&uuml;ttert.
          Man erkl&auml;rt das Spektakel mit dem Kolabs eines
          Riesensterns, der einen Teil seiner Masse in den Raum
          schleudert, um dann zu einem schwarzen Loch
          zusammenzuschrumpfen. Ob das auch in unserer eigenen
          Galaxis passieren k&ouml;nne, will man besorgt wissen.
          Das k&ouml;nne &uuml;berall geschehen, ist die Antwort.
          Aber beruhigend f&uuml;gt man hinzu, es sei allerdings
          sehr unwahrscheinlich. Ob dieser gigantische Ausbruch,
          der ja gar nicht weit vor unserer Haust&uuml;r geschehe,
          nicht negative Folgen f&uuml;r die Erde habe. Auch hier
          beeilt man sich, der aufkommenden Panik den Wind aus den
          Segeln zu nehmen. Das Licht eines Gl&uuml;hw&uuml;rmchens
          sei weitaus gef&auml;hrlicher f&uuml;r unser Leben als
          dieser Reburst, der dazu noch vor millionen Jahren
          passiert sei. Und schon geht man zur Tagesordnung
          &uuml;ber, zeigt Fu&szlig;ballergebnisse und
          Tennis-Match-B&auml;lle.</P>

          <P>"Was haltet ihr davon?" Jeder h&auml;lt einen
          Computer-Ausdruck in der Hand und Simon blickt die vier
          erwartungsvoll an. "Sieht nach einem verschl&uuml;sselten
          Text aus. Wo hast du das her?" "Yuris Cassette. Hab den
          Compy dar&uuml;ber schwitzen lassen." Daniel kraust die
          Stirn: "Hat eine eindeutige Textstruktur, wenn auch total
          chaotisch f&uuml;r unser Empfinden." "K&ouml;nnte nicht
          sagen, dass es irgendeiner irdischen Sprache gleicht",
          brummt tom, der polyglotte Schliemann unter den
          F&uuml;nfen. "Wie w&auml;re es mit einer LogikAnalyse?
          Ich meine, h&auml;ufigkeit sich wiederholender Strukturen
          und so weiter", schl&auml;gt Antoine vor. Simon zieht ein
          weiteres Blatt aus der Mappe: "L&auml;ngst geschehen.
          Aber ... ich wei&szlig; nicht ... h&ouml;rt selbst!" Er
          legt das Blatt vor sich hin, streicht es
          unn&ouml;tigerweise nochmals glatt, blickt starr darauf,
          hebt den Kopf und pr&uuml;ft die Gesichter seiner
          Kameraden, die ihn gespannt anstarren, bevor er
          r&auml;uspernd beginnt: "Es ist ein Fragment. Der Anfang
          fehlt. Und es ist auch nicht alles eindeutig
          verst&auml;ndlich. Doch bei einigem Nachdenken versteht
          man, worum es geht. Der Text beginnt mitten in einem Satz
          - ... morbide Kultur. Uralte Welt in... (Hier folgt eine
          astronomische Angabe, die beim besten Willen nicht
          definiert werden kann.) ... im 135. (Das folgende muss
          eine Datumsangabe sein, wobei wir nicht wissen
          k&ouml;nnen, wie sich ein solcher Kalender
          zusammensetzt.) Mein Name ist Oing Houngan (phonetische
          Wiedergabe) und ich will &uuml;ber die j&uuml;ngsten
          Ereignisse berichten. M&ouml;gen die (nicht
          einzuordnender BEgriff) uns gn&auml;dig sein. Es geht auf
          das Ende zu. Ich wende mich an alle, die dies lesen
          k&ouml;nnen. Es sind die letzten Lebenszeichen einer
          sterbenden Welt. In wenigen Zeitspannen wird das
          Entsetzliche geschehen, wird diese Daseinsform, diese
          wundersch&ouml;ne Welt f&uuml;r immer ausgel&ouml;scht.
          Und wir sind unser Ungl&uuml;ck selber schuld. Wir haben
          durch unsere Ma&szlig;losigkeit die Dinge
          heraufbeschworen, die in den Untergang f&uuml;hren.
          Machtgier und Habsucht sind die Ausl&ouml;ser des
          bevorstehenden Schreckens. Eine dumme Ignoranz der
          m&ouml;glichen Katastrophe gegen&uuml;ber lie&szlig; die
          Hirne blockieren, die herzen verh&auml;rten. Noch jetzt
          glaubt niemand an den Untergang, der sich jedem, der
          nicht blind und taub ist, deutlich ank&uuml;ndigt. Ich
          weine und benetze die Apparatur mit meinen Tr&auml;nen.
          Ich weine &uuml;ber die Unabwendlichkeit, mit der wir aus
          dem All verschwinden werden, ohne eine Spur zu
          hinterlassen. Ich weine und hoffe, dass jemand dies
          empfangen wird und mit mir trauert. Ich ... (Hier bricht
          Yuris Aufzeichnung ab.)" Simon lehnt sich zur&uuml;ck,
          l&auml;sst den unvermeidlichen Kaugummi &uuml;ber die
          Z&auml;hne wandern und verschr&auml;nkt die Arme vor der
          Brust. "Ist sichergestellt, dass der Rechner nicht
          irgendwas daherfaselt?", fragt Tom stirnrunzelnd.
          "Hundertprozentig", nickt Simon. "Klingt mehr nach den
          Problemen unserer eigenen Welt", meldet sich Antoine,
          "wie kommt die Maschine eigentlich zu so einer klaren
          Interpretation?" "Vergleichende Semantik. Frag mich aber
          nicht, wie das im einzelnen funktioniert. Bin kein
          Informatik-Spezi." "Was mag dieser Schreiber mit der
          selbstverschuldeten Katastrophe gemeint haben?",
          gr&uuml;belt Daniel. "Vielleicht haben sie mit der
          Kernfussion herumgespielt", schl&auml;gt Yuri vor. Simon
          sch&uuml;ttelt energisch den Kopf: "Das l&ouml;st kein
          Reburst aus." M&uuml;ssen denn beide Ereignisse
          zeitgleich erfolgt sein?", wirft Tom ein. Daniel legt
          sein Blatt aus der Hand: "Mutma&szlig;ungen f&uuml;hren
          zu nichts. Aus den wenigen Fakten l&auml;sst sich nur
          wild spekulieren. Wir brauchen mehr, vor allem handfeste
          Angaben und keine Literatur. Wie steht es, Yuri? Strahlt
          die Quelle noch? Kommen weitere Cassetten?" "Hab noch
          sieben St&uuml;ck. Gestern Mittag gegen eins kam das
          letzte r&uuml;ber." "Gut", &auml;chzt Simon, sammelt die
          Bl&auml;tter ein, klappt die Mappe zu und brummt:
          "Vertagen wir die Sache, bis der Rechner die weiteren
          Daten ausgespuckt hat. Und ...", er blickt jeden
          einzelnen scharf an, "keinen Kr&uuml;mel davon an die
          &Ouml;ffentlichkeit!" Zustimmendes Nicken. Dann geht
          jeder an seine Arbeit.</P>

          <P>Und doch bleiben die spektakul&auml;ren Geschehnisse
          auf der weltabgeschiedenen W&uuml;stenstation nicht
          verborgen. Zuerst ist es ein privater
          Unterhaltungssender, der &uuml;ber misteri&ouml;se
          Informationen einer au&szlig;erirdischen Zivilisation
          mutma&szlig;t, in Talkshows Politiker, Wissenschaftler
          und Geistliche nach ihrer Meinung befragt. Das ist zwar
          recht unterhaltend, regt aber niemanden sonderlich auf,
          weil es unter Kurioses abgetan wird. Sobald aber auch
          ernstzunehmende Sendeanstalten mit w&ouml;rtlichen
          Zitaten aus dem Text aufwarten, heftige Diskussionen
          &uuml;ber die seri&ouml;sit&auml;t der Quelle entbrennen,
          kann sich Simon vor Anfragen nicht mehr retten.</P>

          <P>"Irgendjemand hat gequatscht!", schnaubt er
          w&uuml;tend und stapft in seinem Arbeitszimmer auf und
          ab. Yuri sitzt am Fenster, eine kalte Zigarette im
          Mundwinkel. Im Allerheiligsten des Chefs darf nicht
          geraucht werden. "Irgendwer hat denen da drau&szlig;en
          was &uuml;ber unsere Arbeiten erz&auml;hlt und sogar
          Teile des Textes zugespielt. Ich begreif es nicht!" Je
          mehr sich Simon aufregt, um so st&auml;rker schl&auml;gt
          seine Wortkargheit ins Gegenteil um. "Einer von uns
          F&uuml;nfen ..." Statt des Kaugummis zerbei&szlig;en
          seine Z&auml;hne das Ende eines Bleistifts. Das Knirschen
          untermalt den Grimm seiner Worte. Die F&auml;uste rumoren
          in den Hosentaschen mit den wenigen Gegenst&auml;nden.
          Ruckartig macht er vor Yuri Halt und sieht ihn
          nachdenklich an: "Sag mal, du bist doch unter uns der
          einzige Funkamateur?" Yuri nickt treuherzig. Doch der
          Bereich um seine Nase wird um eine Spur blasser. Mit
          nerv&ouml;ser Bewegung nimmt er den Glimmstengel von den
          Lippen und schiebt ihn sich hinters Ohr."Du hast den
          engsten Kontakt mit der Au&szlig;enwelt. Mal ehrlich, Old
          Fellow, hat deine Morsetaste nicht ein wenig zuviel
          geklappert?" Yuri senkt den Blick auf die
          Fu&szlig;spitzen. "Motherfucker!" Schnaubend nimmt Simon
          sein hektischees Hin und Her wieder auf. In diesem einen
          Wort entlud sich die ganze Wut. Rasch gl&auml;ttet sich
          seine Stirn. Den angekauten Bleistift wirft er in die
          Schreibtischschale und ersetzt ihn durch einen Kaugummi.
          Dann st&ouml;&szlig;t er mit dem Fu&szlig; einen Stuhl
          zurecht und nimmt rittlings vor Yuri Platz. "Was mach ich
          nur mit dir, du Ungl&uuml;ckswurm?" Der Russe hebt
          versuchsweise den Blick und fl&uuml;stert: "Ich wollte ja
          nichts ..." "Wei&szlig; ich", w&uuml;rgt der Chef seine
          Beichte ab, "ihr Funkheinis seid nun mal ein
          verquatschter Haufen." Seine Kiefern malmen den Gummi
          eine Weile zurecht, bis er den Satz fortsetzt. "Mein
          Fehler. H&auml;tte mich vorher drum k&uuml;mmern sollen
          und keinen Tastenklopfer ins Team nehmen." "Werd ich
          jetzt ...?" "Nichts wirst du", unterbricht ihn Simon ein
          zweites Mal. "Ist vielleicht ganz gut, dass die SAche auf
          diese Weise publik wird." Er kratzt sich nachdenklich am
          Hinterkopf. "Vielleicht ist das sogar ein ganz
          geschickter Schachzug." Beim Aufspringen schl&auml;gt er
          Yuri auf die Schulter: "Kopf hoch, Old Fellow! Hol die
          Jungs zur Generalbesprechung!"</P>

          <P>Simons Andromeda-Mappe ist m&auml;chtig angewachsen.
          Fl&uuml;chtig bl&auml;ttert er darin, liest hier ein paar
          S&auml;tze, macht sich Notizen, bl&auml;ttert weiter, um
          erneut ein paar zeilen zu &uuml;bernehmen. Nun hebt er
          den Kopf, stellt fest, dass alle versammelt sind und
          beginnt: ""Da die &Ouml;ffentlichkeit inzwischen
          &uuml;ber die Botschaft aus dem All Bescheid ..."
          "Verdammt noch mal", poltert Tom los, "wer hat denn da
          nicht dicht gehalten?" "Tut hier nichts zur Sache",
          wischt Simon die Frage vom Tisch. "Da also jetzt bekannt
          ist, dass wir Nachrichten aus dem Andromeda-Nebel
          erhalten haben, sind wir gezwungen, den Inhalt bekannt zu
          geben." "Wir sollen den kompletten Text ...?", wundert
          sich Antoine. Die Mundwinkel des Chefs kr&auml;useln sich
          unter einem ironischen L&auml;cheln. "&Uuml;ber das
          Wieviel und Was werden wir hier gemeinsam entscheiden."
          Ein erleichtertes Aufatmen macht die Runde. Es ist wieder
          jener Aufenthaltsraum, in dem die Besprechung
          stattfindet. Die Thermoskanne ist gut gef&uuml;llt.
          Zigaretten werden angez&uuml;ndet. Vor der runden Scheibe
          zieht ein abnehmender Mond langsam vor&uuml;ber. "Wie
          sollen wir was entscheiden, wenn wir noch nicht einmal
          den vollen Wortlaut kennen?", wundert sich Daniel. "Den
          sollt ihr gleich erfahren." Seine Hand bl&auml;ttert zu
          den ersten Seiten des Ordners zur&uuml;ck. "Immer sollen
          wir uns mit Zuh&ouml;ren zufriedengeben. Warum bekommen
          wir nicht das Original zu lesen?" Simons Hand hebt sich
          leicht von der Tischplatte und schnalzt. "Denkt mal
          dar&uuml;ber nach!" "Ach ja, j'ai compris", murmelt
          Antoine. Und Yuri senkt seine Nase tief in die
          Kaffeetasse.</P>

          <P>In der folgenden halben Stunde, w&auml;hrend vor dem
          Fenster die Mondsichel den Sternen des Pegasus weicht,
          tr&auml;gt Simon mit n&uuml;chterner, fast monotoner
          Stimme die dramatischen Ereignisse jener r&auml;umlich
          und zeitlich fernen Welt vor. Die Worte im Ohr wenden
          sich die Blicke aller fast schon zwanghaft dem dunklen
          Rund zu, suchen oberhalb der vier Ecksterne des
          gefl&uuml;gelten Pferdes den winzigen Nebelfleck, der die
          Andromeda-Galaxie darstellt, vermeinen das Leuchtfeuer
          wahrzunehmen, aus dem das Signal &uuml;ber die unendliche
          Zeitkluft zu ihnen herabkam. Keiner kann sich eines
          leisen Schauders erwehren, w&auml;hrend Simon den
          allm&auml;hlichen Untergang jenes hochtechnisierten und
          geistig hochstehenden Volks vor ihren innerem Auge
          vor&uuml;berziehen l&auml;sst. Erfindungen werden
          genannt, die ihr Vorstellungsverm&ouml;gen
          &uuml;bersteigen, technische Projekte, die derart ins
          Gigantische gehen, dass keine irdischen
          Ma&szlig;st&auml;be als Vergleich herhalten. Letzten
          Endes ist von einer Zeitblase die Rede, mit der die
          interstellare Raumfahrt realisiert werden sollte. An
          diesem Projekt entbrannte eine heftige wissenschaftliche
          Kontroverse zwischen Bef&uuml;rwortern und Skeptikern. Wo
          die Ersteren den dringenden wirtschaftlichen Aufschwung
          und eine neue Basis f&uuml;r Grundlagenforschung sahen,
          malten die Gegner das Vorhaben in schw&auml;rzesten
          Farben. F&uuml;r sie bahnte sich hierdurch eine kosmische
          Katastrophe an, in der alles Leben auf stellarer, wenn
          nicht galaktischer Ebene zerst&ouml;rt werden
          m&uuml;sste. Zur Erzeugung einer leistungsf&auml;higen
          Zeitblase dieses Ausma&szlig;es sei die Energie etlicher
          Sonnen notwendig. Und daf&uuml;r w&auml;r weder das
          n&ouml;tige Wissen ausreichend noch die Technologie
          gen&uuml;gend entwickelt. Allzu rasch k&ouml;nne das
          Experiment sich verselbstst&auml;ndigen und eine
          Kettenreaktion ungeahnten Ausma&szlig;es annehmen. Doch
          die Kassandra-Rufe verhallten ungeh&ouml;rt oder wurden
          verlacht. Zuviele profitierten direkt oder indirekt an
          der Verwirklichung dieses uralten Traums. Es vergingen
          mehrere Generationen, bevor mit der eigentlichen
          energetischen Umsetzung begonnen werden konnte. Bis dahin
          waren die beteiligten Planeten finanziell ausgeblutet.
          Ganze Bev&ouml;lkerungsschichten hungerten.
          Widerstandsgruppen und Aufst&auml;nde schlug man brutal
          nieder. Auf allen Welten erhoben sich Propheten des nahen
          Untergangs. Konnte man sie nicht l&auml;cherlich machen,
          wurden sie eingesperrt und hingerichtet. Dabei arbeitete
          man fieberhaft an dem interstellaren Agregat zur
          Erzeugung der gigantischen Energie f&uuml;r die
          Zeitblase. Es war ein offenes Geheimnis. jeder wusste es,
          doch niemand wagte laut dar&uuml;ber zu sprechen, dass
          mangels ausreichender Geldmittel gest&uuml;mpert und
          geschlampt wurde. Die Zeit des Countdown r&uuml;ckte
          heran, von manchen ersehnt, von den meisten aber
          herbeigef&uuml;rchtet. Und dann geschah das
          Unausbleibliche. Vorzeitige Z&uuml;ndung. Der
          Sternreaktor geriet au&szlig;er Kontrolle, riss wie ein
          stellarer STaubsauger alles an sich. Zun&auml;chst
          fra&szlig; er binnen kurzer Zeit die nahen, zuletzt die
          entfernteren Sonnen mit allen lebentragenden und toten
          Planeten, bevor er kollabierte und mit einem kosmischen
          Feuerwerk zum schwarzen Loch wurde. Niemand entging dem
          Untergang, selbst jene nicht, die sich in Raumschiffen zu
          retten versuchten. Wurden sie nicht in den Strudel
          gerissen, ereilte sie die Schockwelle der Explosion. Der
          Autor jenes denkw&uuml;rdigen Funkspruchs konnte die
          Entwicklung bis zuletzt verfolgen und in allen
          Einzelheiten darstellen. Dann wurde auch seine Welt in
          den Strudel gezogen. Bis zuletzt blieb er auf Sendung und
          lie&szlig; die fernen Beobachter an der Katastrophe
          teilhaben, bis ihm f&ouml;rmlich die Sendetaste unter der
          Hand vergl&uuml;hte.</P>

          <P>"Ich sitze in einem besonders isolierten Schutzraum
          mit Klimaeinrichtung. Die Atmosph&auml;renh&uuml;lle des
          Planeten ist bereits weggerissen. Unser Sonnensystem
          st&uuml;rzt immer rascher auf das Zentrum der Vernichtung
          zu. Die Messinstrumente zeigen unvorstellbare WErte an
          Beschleunigung. Au&szlig;er mir gibt es wenige Lebende,
          mit denen ich komuniziere. Die Verbindung wird bald
          abrei&szlig;en. Kameras zeigen ein infernalisches Bild
          der Au&szlig;enwelt. Man k&ouml;nnte diese Farben und
          bizarren Formen reizvoll finden, wenn nicht der Schrecken
          des Untergangs daran gekn&uuml;pft w&auml;re. Eine Ironie
          liegt in der Tatsache, dass wir nun tats&auml;chlich auf
          eine Zeitreise gehen, in eine unerwartete, ungewollte
          Richtung. Wird jemand aus unserem Schicksal etwas lernen?
          Ich f&uuml;rchte nein. Es gibt alte Geschichten von
          untergegangenen Welten, die in einer entfernten Galaxis
          existierten. Auch dort wurde mit dem "Feuer der
          G&ouml;tter", wie es mythologisch verbr&auml;hmt
          hie&szlig;, gespielt. Niemand zog aus dieser Erfahrung
          f&uuml;r sich eine Lehre. Unser Tod ist in mehrfacher
          Hinsicht sinnlos. ES kann nur noch ..."</P>

          <P>Der Chef klappt den Ordner zu und blickt vor sich hin.
          Das Schweigen lastet schwer. Die Blicke wenden sich
          wieder der runden &Ouml;ffnung des Fensters zu. Simon
          erhebt sich mit krachenden Gelenken und tritt an das
          Glas. Andromeda steht hoch im Norden und bewegt sich
          unmerklich vor&uuml;ber. Die finger der Kakteen recken
          sich ihr entgegen. Ab und an huscht ein Schatten
          vor&uuml;ber. Ein Nachttier, das von keiner kosmischen
          Katastrophe wei&szlig;. Etwas knistert in Simons
          Jackentasche. Es ist ein Fax, das den Erhalt der Station
          garantiert.</P>

          <P>(c) HE Bonn</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

