<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="AUTHOR" content="Thomas Nawroth">
    <META name="DESCRIPTION" content="Ein Computer-Magazin von 1984">

    <TITLE>Happy Computer</TITLE>
  </HEAD>

  <BODY bgcolor="#fffff4" background="mm_hc06b.gif" text="#000033">
    <TABLE border="0" cellpadding="8" summary="">
      <TR>
        <TD width="6">
        </TD>

        <TD>
          <CENTER>
            <IMG src="mm_hc06a.gif" alt=""><BR>
            <I>Folge 6</I>
          </CENTER>
          <HR>

          <P>Das herk&ouml;mmliche Betriebssystem von Atari wird vielen
          Anspr&uuml;chen nicht gerecht. Ein amerikanisches Software-Haus bietet mit
          DOS-XL eine Alternative an.</P>

          <H2 align="CENTER">DOS-XL im Test</H2>

          <P>Um die Eigenschaften des DOS-XL beurteilen zu k&ouml;nnen, m&uuml;ssen
          wir zun&auml;chst einmal die beiden DOS-Varianten von Atari betrachten. DOS
          2.0 besteht aus zwei verschiedenen Dateien: einmal DOS.SYS (ben&ouml;tigt
          39 Sektoren auf Diskette), die alle n&ouml;tigen Informationen
          enth&auml;lt, um den Diskettenbetrieb mit Basic zu erm&ouml;glichen.
          Zus&auml;tzliche direkte Funktionen wie beispielsweise Kopieren,
          Initialisieren und Sch&uuml;tzen erh&auml;lt man durch Einladen der zweiten
          Datei DUP.SYS (Disk Utility Package, Umfang 42 Sektoren auf Diskette).
          M&ouml;chte man nun von Basic aus eine Diskette formatieren,
          m&uuml;&szlig;te man eigentlich zuerst "DOS" eingeben um vom DOS-Men&uuml;
          aus die entsprechende Funktion zu w&auml;hlen. Dann wird das entsprechende
          Utility-Programm aufgerufen und erst dann kann man mit dem eigentlichen
          Formatiervorgang beginnen. Hier gibt es allerdings eine einfacherere
          L&ouml;sung, denn mit dem Befehl XIO 254, #1,0,0,"D:" kann man in Basic das
          gleiche erreichen, ohne erst umst&auml;ndlich das DOS aufzurufen. Hat man
          dann vorher keine MEM.SAV-Datei angelegt, geht das im Arbeitsspeicher
          befindliche Programm unweigerlich verloren. Insgesamt belegt DOS 2.0 etwa
          10 KByte vom Arbeitsspeicher des Atari Computers.</P>

          <P>Atari DOS 3.0 belegt hingegen, ohne den zur Verf&uuml;gung stehenden
          Utilities, etwa 13 KByte RAM. M&ouml;chte man, zum Beispiel, eine Diskette
          formatieren, mu&szlig; auch hier wieder das entsprechende Hilfsprogramm von
          Diskette nachgeladen werden. Mit DOS 3.0 erh&auml;lt endlich die
          "HELP"-Taste eine sinnvolle Funktion. So kann man, vorausgesetzt man
          befindet sich im DOS-Men&uuml;, Informationen und Hilfestellungen auf dem
          Bildschirm anzeigen lassen, ohne umst&auml;ndlich in den Handb&uuml;chern
          nach Erkl&auml;rungen zu den einzelnen Befehlen suchen zu m&uuml;ssen.
          Damit ist DOS 3.0 speziell f&uuml;r diejenigen geeignet, die sich nicht
          besonders gut mit Disketten-Betriebssystemen auskennen.</P>

          <P>Leider wurde bei DOS 3.0 jedoch das Dateiformat ge&auml;ndert. So kann
          man zwar DOS 2.0-Dateien mit dem DOS 3.0beigef&uuml;gtem Hilfsprogramm in
          DOS 3.0 Dateien umwandeln, jedoch gibt es meines Wissens nach keine
          M&ouml;glichkeit f&uuml;r eine umgekehrte Konvertierung. Aber immerhin ist
          DOS 3.0 bisher das einzige Betriebssystem, das die volle verf&uuml;gbare
          Speicherkapazit&auml;t der AtariDiskettenlaufwerke ausnutzt. &Uuml;brigens
          k&ouml;nnen mit DOS 3.0 Disketten in einfacher oder doppelter Dichte
          formatiert werden. Das erh&ouml;ht die Speicherkapazit&auml;t um etwa 50
          Prozent.</P>

          <P>Wenden wir uns aber nun dem DOS-XL zu. Bislang gab es noch kein
          Programm, das die zus&auml;tzlichen 16 KByte RAM des Atari 800-XL Computers
          sinnvoll nutzt. Mit DOS-XL stehen dem Programmierer praktisch die gesamten
          verbleibenden 48 KByte RAM zur Verf&uuml;gung. Die Besitzer der
          &auml;lteren Atari-Modelle brauchen nicht zu verzweifeln, denn wenn man
          eines der OSS-Supermodule besitzt, kann sich DOS-XL in das vom Modul
          blockierte RAM laden. Dann steht wieder mehr Arbeitsspeicher zur
          Verf&uuml;gung. Sollten einem aber weder ein Atari-Computer der XLReihe,
          noch ein Supercartridge zur Verf&uuml;gung stehen, verbraucht DOS-XL
          genauso viel Speicherplatz wie jedes andere Betriebssystem auch.</P>

          <P>DOS-XL wird, genau wie die Vorg&auml;nger (OS/A+), durch
          CP/M-&auml;hnliche Kommandos gesteuert. Dies bietet zwei wichtige Vorteile:
          einerseits wird wesentlich weniger kostbarer Speicherplatz verbraucht und
          andererseits ist es wesentlich einfacher, Kommandos wie RUN, DIR, SAV
          einzutippen, anstatt die entsprechenden Funktionen aus einem Men&uuml;
          herauszusuchen. Der Verzicht auf ein ausgedehntes Men&uuml;, das alle in
          Frage kommenden Funktionen ausf&uuml;hren kann, hat noch weitere
          Vorz&uuml;ge: man kann vom Basic aus ins DOS zur&uuml;ckkehren, ohne lange
          darauf warten zu m&uuml;ssen, bis die Datei DUP.SYS nachgeladen wurde (oder
          gar, bis das im Speicher befindliche Programm als MEM.SAV-Datei auf
          Diskette geschrieben wurde). Kommandosequenzen, die man &ouml;fters
          eintippen mu&szlig;, lassen sich durch Kommandodateien ersetzen (die
          sogenannten Execute-Dateien). Einige Programme verarbeiten sogar die
          Parameter, die man nach dem Programmnamen eingibt. So fordert man mit der
          Anweisung MAC65 NAME.M65 E:NAME.COM P: das DOS dazu auf, zun&auml;chst
          einmal den Assembler MAC 65 zu laden, anschlie&szlig;end zu starten, und
          das Assemblerprogramm NAME.M65 zu compilieren und dabei mit dem Namen
          NAME.COM abzuspeichern. Nebenbei kann noch eine Crossreferenz-Liste der
          benutzten Labels auf dem Drucker ausgegeben werden. Die Arbeit mit einem
          Kommando gesteuertem Betriebssystem bringt also durchaus Vorteile.</P>

          <P>Da es speziell f&uuml;r den Neuling nicht einfach ist, sich viele neue
          Befehle zu merken, und er es nur mit Schwierigkeiten schaffen wird, die
          notwendigen Hilfsprogramme (beispielsweise zum Kopieren von Dateien)
          richtig zu verwenden, gibt es ein zus&auml;tzliches Men&uuml;, &uuml;ber
          das man alle Funktionen optimal einsetzen kann.</P>

          <P>Anschlie&szlig;end noch eine Liste der wichtigsten Befehle:</P>

          <TABLE border="0" width="100%" bgcolor="#009999" cellspacing="0"
          cellpadding="0" summary="">
            <TR>
              <TD width="10"></TD>
              <TD width="20%"></TD>
              <TD width="20">&nbsp;</TD>
              <TD>&nbsp;</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD colspan="3"><B>Feste Kommandos:</B></TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>CARtridge</TD>
              <TD>- &nbsp;</TD>
              <TD>ins eingelegte Modul springen</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>Dn</TD>
              <TD>- &nbsp;</TD>
              <TD>Laufwerk n ansteuern</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>DIRectory</TD>
              <TD>- &nbsp;</TD>
              <TD>Liste der Programme auf der Diskette</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>END</TD>
              <TD>- &nbsp;</TD>
              <TD>Ende der Execute-Datei</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>ERAse</TD>
              <TD>- &nbsp;</TD>
              <TD>Datei l&ouml;schen</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>LOAd</TD>
              <TD>- &nbsp;</TD>
              <TD>Programm laden</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD valign="top">NOScreen</TD>
              <TD valign="top">- &nbsp;</TD>
              <TD>w&auml;hrend der Ausf&uuml;hrung des Executes
              Bildschirmausgabe anhalten</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>PROtect</TD>
              <TD>- &nbsp;</TD>
              <TD>Datei sichern</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>REMark</TD>
              <TD>- &nbsp;</TD>
              <TD>f&uuml;r Bemerkungen innerhalb des Executes</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>REName</TD>
              <TD>- &nbsp;</TD>
              <TD>Datei umbenennen</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>RUN</TD>
              <TD>- &nbsp;</TD>
              <TD>Programm starten</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>SAVe</TD>
              <TD>- &nbsp;</TD>
              <TD>Speicherbereich auf Diskette abspeichern</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>SCReen</TD>
              <TD>- &nbsp;</TD>
              <TD>NOScreen r&uuml;ckg&auml;ngig machen</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD valign="top">TYPe</TD>
              <TD valign="top">- &nbsp;</TD>
              <TD>ASCII-Datei ausgeben (zum Beispiel: "TYP TEXT.AW
              E:" zeigt den Inhalt der Datei TEXT.AW am Bildschirm
              an)</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>UNProtect</TD>
              <TD>- &nbsp;</TD>
              <TD>Sicherung der Datei r&uuml;ckg&auml;ngig
              machen</TD>
            </TR>
          </TABLE>
          <BR>

          <TABLE border="0" width="100%" bgcolor="#ff8800"
          cellspacing="0" cellpadding="0" summary="">
            <TR>
              <TD width="10"></TD>
              <TD width="20%"></TD>
              <TD width="20">&nbsp;</TD>
              <TD>&nbsp;</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD colspan="3"><B>Folgende Befehle in Form von Hilfsprogrammen
              erg&auml;nzen die direkten Kommandos:</B></TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>COPY</TD>
              <TD>- &nbsp;</TD>
              <TD>kopiert einzelne Dateien</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>DO</TD>
              <TD>- &nbsp;</TD>
              <TD>f&uuml;hrt mehrere DOS-Befehle hintereinander
              aus</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>DUPDISK</TD>
              <TD>- &nbsp;</TD>
              <TD>kopiert die gesamte Diskette</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>INIT</TD>
              <TD>- &nbsp;</TD>
              <TD>zum Formatieren und Schreiben der DOS-Datei</TD>
            </TR>

            <TR>
              <TD></TD>
              <TD>MENU</TD>
              <TD>- &nbsp;</TD>
              <TD>l&auml;dt das Funktionsmen&uuml;</TD>
            </TR>
          </TABLE>
          <BR>             

          <P>Jedesmal, wenn man "RETURN" dr&uuml;ckt, versucht das
          Disketten-Betriebssystem die Eingabe als einen der oben aufgef&uuml;hrten
          Befehle zu identifizieren. Falls es sich nicht um einen Befehl gehandelt
          hat, dann wird versucht ein Programm mit dem entsprechenden Namen zu
          laden:. So f&uuml;hrt die Eingabe von COPY zum Beispiel dazu, da&szlig; das
          Programm COPY.COM geladen und gestartet wird. &Uuml;brigens kann die
          Erweiterung, wie unter CP/M, einfach weggelassen werden. Ohne
          gr&ouml;&szlig;ere Probleme kann man sich eigene DOS-Befehle schaffen.</P>

          <P>Zusammen mit DOS-XL erh&auml;lt man eine zirka 150 Seiten umfassende
          Bedienungsanleitung, in der nicht nur auf alle Befehle und Hilfsprogramme,
          sondern auch ausf&uuml;hrlich auf die DOS-Funktionen unter Basic
          eingegangen wird. Alles in allem kann man sagen, da&szlig; DOS-XL als eine
          sehr n&uuml;tzliche Alternative zu den Atari-Disketten-Betriebssystemen
          anzusehen ist (besonders f&uuml;r diejenigen, die sich zu den stolzen
          Besitzern eines Supercartridges oder eines XL-Computers z&auml;hlen
          k&ouml;nnen).</P>
          (Julian/Reschke/wb)

          <HR>
          <BR>
          In der n&auml;chsten NoCover gibt es einen Testberich des Laser 2001.<BR>
          <BR>

          <TABLE align="CENTER" border="3">
            <TR bgcolor="#ffffff">
              <TD><A href="mailto:thomasnawroth@web.de">Thomas Nawroth</A></TD>
            </TR>
          </TABLE>
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

