<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Der Wetterbericht</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color=
          "#ffff00"><B>Wetterbericht</B></FONT></H1>

          <P>"Am Dienstag m&uuml;ssen Sie mit Tiefstwerten um acht
          Grad rechnen. Die gef&uuml;hlte Temperatur liegt bei zwei
          Grad."</P>

          <P>Als die Wetterfr&ouml;sche vor einigen Jahren damit
          begannen, das Wetter mit zweierlei Ma&szlig; zu messen,
          war ich emp&ouml;rt. Was f&auml;llt denen eigentlich ein,
          mir vorzuschreiben, wie kalt oder warm sich acht Grad
          f&uuml;r mich anf&uuml;hlen? Vielleicht bin ich eine
          Frostbeule und friere schon bei acht Grad, als w&auml;ren
          es arktische minus zw&ouml;lf. Oder ich geh&ouml;re zu
          den ganz Abgeh&auml;rteten und denke: "Toll, acht Grad!
          Zeit, die Sandalen aus dem Schrank zu holen!"</P>

          <P>Muss mir aber von den Wetter-Heinis sagen lassen, dass
          so etwas glatter Selbstmord ist, bei Temperaturen knapp
          &uuml;ber dem Gefrierpunkt. Man stelle sich nur mal vor,
          diese Marotte mit den "emotionalisierten Fakten" greift
          um sich. Der Nachrichtensprecher w&uuml;rde dann so
          Sachen sagen wie: "Auf der Autobahn A7 zwischen Hamburg
          und Flensburg staut sich der Verkehr auf einer L&auml;nge
          von 15 Kilometern. Sofern Sie ganz hinten in der Schlange
          stehen, betr&auml;gt die gef&uuml;hlte Staul&auml;nge
          jedoch 20 Kilometer. Sollten Sie obendrein n&ouml;tig zur
          Toilette m&uuml;ssen, wird sich der Stau f&uuml;r Sie
          anf&uuml;hlen, als w&auml;re er 45 Kilometer lang."</P>

          <P>Oder: "In diesem Jahr verbrachten zwei Millionen
          Menschen ihren Urlaub auf Mallorca. Sofern Sie selbst zu
          denen geh&ouml;rten, die vergeblich versuchten, morgens
          eine Liege am Pool zu ergattern, erh&ouml;ht sich die
          gef&uuml;hlte Besucherzahl auf 2,5 Millionen."</P>

          <P>Auch ein ganz normaler Einkaufsbummel w&uuml;rde
          anders verlaufen. Man steigt beispielsweise in eine Hose
          Gr&ouml;&szlig;e 40 und stellt fest, dass sie kneift.
          Liegt's am engen Schnitt oder am Tiramisu vom letzten
          Wochenende? Weder noch! Die gef&uuml;hlte
          Gr&ouml;&szlig;e der Hose betr&auml;gt 38 - also kein
          Wunder, dass sie nicht passt.</P>

          <P>Politikern k&auml;me die landesweite
          Gef&uuml;hlsduselei sicherlich ganz recht. Wenn die
          W&auml;hler angesichts der k&uuml;rzlich beschlossenen
          Steuererh&ouml;hungen entsetzt auf ihren Lohnzettel
          blicken, k&ouml;nnen sie schnell beruhigt werden: "Das
          ist doch nur Ihr gef&uuml;hltes Gehalt! Verdienen tun Sie
          nat&uuml;rlich viel mehr!" Beim Euro hat's ja auch
          geklappt. Alles jammert &uuml;ber den Teuro, und dann
          erz&auml;hlen uns die Statistiker, dass insgesamt gesehen
          aber gar nichts teurer geworden ist. Da sind wir wohl auf
          die "gef&uuml;hlte Preiserh&ouml;hung" reingefallen.</P>

          <P>Aber eine gute Seite kann ich dem Ganzen dann doch
          abgewinnen. Wenn ich das n&auml;chste Mal Geburtstag
          habe, feiere ich ganz offiziell meinen
          f&uuml;nfundzwanzigsten - alles eine Frage des
          gef&uuml;hlten Alters!</P>

          <P>Internetfundst&uuml;ck<BR>
          Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

