<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>
      AIS Reisegesundheit
    </TITLE>
    <META name='description' content=
    'Reise- und Tropenmedizinische Info Seiten der DRTM'>
    <META name='author' content='Volker Weckelmann, DRTM'>
    <META name='keywords' content=
    'HTML, Medizin, Reiseimpfungen, Reisemedizin, Medizin, Impfungen, Malaria 
Suchprogramme, HTTP-Protokoll, Tropenmedizin, Impfberatung, kostenlos, computer'>
    <META name='date' content='25.2.2003'>
    <LINK rel='shortcut icon' href='../favicon.ico'>
    <META http-equiv='Content-Type' content=
    'text/html; charset=iso-8559-1'>
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink= 
  "#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10"
    summary="">
      <TR>
        <TD>
          <BR>
           
          <H2>
            M&uuml;ckenplage - Prophylaxe und Linderung
          </H2>
          Immer in den warmen Sommermonaten macht sich nach lang
          anhaltenden Regenf&auml;llen eine schlagartige Vermehrung
          von Stechm&uuml;cken unangenehm bemerkbar. Aber auch ein
          sowieso schon vorhandenes g&uuml;nstiges
          Oberfl&auml;chenwasserangebot gepaart mit sommerlichen
          Tempe raturen reicht aus, um zu einer l&auml;stigen
          M&uuml;ckenplage zu f&uuml;hren. So gen&uuml;gen den
          M&uuml;cken f&uuml;r ihre Entwicklung und Vermehrung
          schon die kleinsten Wasseransammlungen wie etwa Teiche,
          Wassergr&auml;ben, Regentonnen oder Wasserpf&uuml;tzen.
          Von Atemluft, Schwei&szlig;geruch und
          K&ouml;rperw&auml;rme angelockt, finden die
          Stechm&uuml;cken immer ihr Ziel: Menschen und Tiere.
          Licht spielt hierbei &uuml;brigens keine wesentliche
          Rolle. Sind die M&uuml;cken in unseren Breiten eher
          harmlose aber doch l&auml;stige Plagegeister, so geht in
          tropischen und subtropischen Regionen eine weitaus
          gr&ouml;&szlig;ere Gefahr von ihnen aus. Sie k&ouml;nnen
          dort schwerwiegende Krank heiten wie Malaria,
          Dengue-Fieber, Gelbfieber etc. &uuml;bertragen. Um sich
          in geeigneter Weise vor den M&uuml;cken zu sch&uuml;tzen,
          egal ob zu Hause oder auf Reisen, gilt generell:
          Vorbeugung ist immer noch das Mittel der Wahl. Dies kann
          auf verschiedene Weise unter dem Begriff der <B>
          Expositionsprophylaxe</B> ge schehen. Wird diese in
          angepasster Weise durchgef&uuml;hrt, ist entspanntes
          Erholen zu Hause oder auf Reisen keine Zauberei, auch
          nicht, wenn Stechm&uuml;cken oder andere Krabbeltiere
          wieder mal auf der Suche nach einer geeigneten
          Blutmahlzeit sind.<BR>
          <BR>
          <H3>
           <B> Hautschutz </B>
          </H3>
          Insektenabwehrmittel (Repellents) v erhindern, dass sich
          M&uuml;cken oder andere Insekten und Spinnentiere, wie
          z.B. Bremsen oder Zecken, auf der Haut niederlassen. Die
          Mittel t&ouml;ten die Parasiten nicht, sondern wehren sie
          nur ab. Bei Repellents k&ouml;nnen Sie zwischen rein
          pflanzlichen und chemischen Produkten w&auml;hlen.<BR>
          Die chemischen Mittel e nthalten als Substanz DEET
          (Diethyltoluamid), Dimethylphtalat oder den neuen
          Wirkstoff Bayrepel&reg; (Hydroxyethyl Isobutyl). Manche
          dieser Wirkstoffe k&ouml;nnen in wenigen F&auml;llen
          erhebliche Nebenwirkungen mit sich bringen. Deshalb
          sollten unbedingt die Warnhinweise auf den Verpackungen
          ber&uuml;cksichtigt werden . Sprays sollten nach
          M&ouml;glichkeit nicht benutzt werden, da kein
          fl&auml;chendeckender Schutz gew&auml;hrleistet ist und
          die Wirkzeit nicht so gro&szlig; ist wie die von Cremes
          und Gelen. Auch ein ausreichender Schutz von
          Schleimhautbereichen wie Augen und Nase ist bei Anwendung
          von Sprays nicht unbedingt gew&auml;hrleist et. Im
          Testvergleich zeigen die chemischen Mittel bessere
          Resultate als die Naturstoffe. Unter den Mitteln mit
          synthetischen Wirkstoffen haben sich in verschiedenen
          Tests beispielsweise Autan Family Milch&reg;, Kulan
          Hautschutzcreme&reg; und Anti-Brumm-Forte&reg; besonders
          bew&auml;hrt.<BR>
          Einzige Ausnahme unter den Naturstoffen mit
          vergleichbarere Wirksamkeit ist das Citridiol,
          Inhaltsstoff der bei uns in Apotheken erh&auml;ltlichen
          Mosiguard&reg; - Produkte. Diese sind bereits f&uuml;r
          Kinder ab 3 Monate geeignet. Viele andere &auml;therische
          &Ouml;le und Pflanzenextrakte wie Pfefferminz&ouml;l,
          Apfelessig oder Knoblauchzehen sind wirkung slos oder
          zeigen nur eine unwesentliche Wirkung. Auch durch ein
          Vermischen der verschiedenen Substanzen l&auml;sst sich
          in diesem Fall die Wirkung nicht erh&ouml;hen.
          Lavendel&ouml;l ist auch wirksam, jedoch h&auml;lt die
          Wirkung nur f&uuml;r kurze Zeit an. Das Auftragen von
          Naturstoffprodukten auf die Haut birgt aufgrund de r
          gro&szlig;en Zahl an diversen Inhaltsstoffen in den
          jeweiligen Gemischen ein relativ hohes Allergiepotential.
          Untersuchungen &uuml;ber die Toxikologie von
          nat&uuml;rlichen Repellents liegen nur in begrenztem
          Umfang vor.<BR>
          Repellents sollten l&uuml;ckenlos auf die Haut
          aufgetragen und von Zeit zu Zeit erneuert werden,
          sp&auml;testens sobald die ersten M&uuml;cken auf der
          Haut landen. Bei gleichzeitiger Verwendung von
          Sonnenschutzmittel oder anderen Kosmetika sollte das
          Repellent immer zuletzt aufgetragen werden. Bei starkem
          Schwitzen, hoher Luftfeuchtigkeit, starkem Wind und
          Abrieb bei Bedarf h&auml;ufiger auftragen. Verlassen S ie
          sich deshalb nicht auf einen Schutz von mehr als vier
          Stunden, auch wenn auf der Packung eine Wirkung von acht
          bis zw&ouml;lf Stunden angegeben wird. Anders als bei
          Sonnenschutzmitteln, deren Wirkung nur f&uuml;r die
          angegebene Zeit anh&auml;lt, kann die Wirkung von
          Repellents durch erneutes Auftragen verl&auml;ngert
          werden. Kein Insektenschutzmittel, auch nicht die
          sogenannten "wasserfesten", &uuml;bersteht mehr als ein
          kurzes Bad ohne Seife und Abtrocknen, deshalb muss die
          Anwendung nach dem Baden oder Duschen bei Bedarf
          wiederholt werden. Kinder unter 2 Jahren sollten nicht
          mit Insektenschutzmitteln behandelt werd en. Dies gilt
          sowohl f&uuml;r die synthetisch hergestellten als auch
          f&uuml;r die rein pflanzlichen Mittel.<BR>
          Im Freien sch&uuml;tzt neben einem Repellent
          k&ouml;rperbedeckende, vorzugsweise helle Kleidung gegen
          M&uuml;cken und anderes Getier. Achten Sie auf besonders
          dichte, feste und lang&auml;rmlige Kleidung und ziehen
          Sie So cken an, Fu&szlig;kn&ouml;chel sind bei
          M&uuml;cken sehr beliebt. Zur Verbesserung des Schutzes
          k&ouml;nnen die Textilien zus&auml;tzlich mit
          Insektiziden impr&auml;gniert werden. Die Kleidung
          tr&auml;gt das Insektizid bis zum n&auml;chsten Waschen.
          Sie k&ouml;nnen Kleidung und Schuhe ggf. auch mit einem
          Repellent einspr&uuml;hen. Keine empfehlenswer te
          M&ouml;glichkeit ist das Tragen von impr&auml;gnierten
          Stoffarmb&auml;ndern, da hierbei nur die unmittelbare
          N&auml;he des Armbandes gesch&uuml;tzt ist. &Uuml;ber
          Nacht, also w&auml;hrend des Schlafens sind Anti-
          M&uuml;ckenmittel zum Einreiben ungeeignet, da keines
          eine ganze Nacht lang anh&auml;lt.
          M&uuml;ckenschutzmittel sollten immer in Deutsc hland
          gekauft werden. Im Ausland enthalten die Produkte oft
          andere, manchmal bedenkliche Wirkstoffe. Das gilt
          &uuml;brigens auch f&uuml;r Produkte mit dem gleichen
          Namen. Bei &Uuml;berland-Touren, besonders im tropischen
          Ausland gilt: W&auml;hlen Sie den Schlaf- und Rastplatz
          niemals in der N&auml;he stehender Gew&auml;sser,
          Gr&auml;b en und Wassertonnen.<BR>
          <BR>
          <H3>
          <B>  M&uuml;ckenabwehr in Innenr&auml;umen und auf Terrassen </B>
          </H3>
          Zur Abwehr von Insekten in Innenr&auml;umen und auf
          Terrassen gibt es verschiedene Produkte, die Wirkstoffe
          in den Raum abgeben. Bekannte Beispiele sind
          Moskitospiralen ("mosquito coils") und elektrische
          Pl&auml;ttchenverdampfer. Die Moskitospiralen werden auf
          dem Fu&szlig;boden platziert. Dort wehren sie M&uuml;cken
          in Kn&ouml;chelh&ouml;he ab. Elektroverdampfer sind
          geeignet, um eine gr&ouml;&szlig;ere Anzahl von
          M&uuml;cken m&ouml;glichst schnell aus einem Innenraum zu
          entfernen, anschlie&szlig;end sollte gut gel&uuml;ftet
          werden und z.B. durch eine M&uuml;ckengaze daf&uuml;r
          gesorgt werden, dass keine weiteren M&uuml;cken in den
          Raum gelangen. Relativ gute Ergebnisse in verschiedenen
          Tests haben beispielsweise die Elektroverdampfer Baygon
          Master M&uuml;ckenschutz&reg; und Paral
          M&uuml;cken-Mobil&reg; erzielt, beide mit dem Wirkstoff
          Transfluthrin. Neben Moskitospiralen und
          Elektroverdampfern sind auc h einige Raum Insekten Sprays
          im Handel erh&auml;ltlich. Aufgrund der k&uuml;rzeren
          Einwirkzeit sind diese allerdings nur als Ersatz f&uuml;r
          den Notfall oder zur Nutzung in kleineren R&auml;umen
          geeignet. Sie sollten Insektizide nicht &uuml;ber einen
          l&auml;ngeren Zeitraum und nur bei dringendem Bedarf
          verwenden, denn Nebenwirku ngen, insbesondere f&uuml;r
          S&auml;uglinge und Kleinkinder sind nicht
          ausgeschlossen.<BR>
          Eine Alternative zur chemischen
          Sch&auml;dlingsbek&auml;mpfung in Innenr&auml;umen bieten
          bew&auml;hrte Methoden wie Klebestreifen, Fliegenklatsche
          oder ein M&uuml;ckennetz vor dem Fenster. Schlie&szlig;en
          Sie bei Einbruch der Dunkelheit die Fenster, fa lls dort
          keine Moskitogaze angebracht ist. &Uuml;brigens, auch
          eine eingeschaltete Klimaanlage h&auml;lt M&uuml;cken
          fern! Keine wissenschaftlich nachgewiesene Wirkung haben
          sogenannte "Piepser" (Ultraschall-Repeller) und
          UV-Lichtger&auml;te. Auch M&uuml;ckenkerzen verbreiten in
          erster Linie eine nette Atmosph&auml;re.<BR>
          F&uuml;r all e Anti-M&uuml;ckenmittel gilt: Wegen der
          chemischen Inhaltsstoffe am besten sparsam und nur bei
          Bedarf benutzen. S&auml;uglinge und Kleinkinder sollten
          gar nicht mit M&uuml;ckenschutz behandelt werden. Keines
          der Mittel bietet vollkommenen Schutz vor
          M&uuml;ckenstichen. Daher sollte vor einer Fernreise in
          ein Malaria be troffenes Gebiet nicht auf die
          medizinische Prophylaxe verzichtet werden.<BR>
          <BR>
          <H3>
         <B>   Moskitonetze </B>
          </H3>
          Moskitonetze sind wichtiger Bestandteil der
          Reiseausr&uuml;stung in tropischen und subtropischen
          Regionen. Aber auch bei uns sind sie oft die beste
          Methode z.B. beim Schutz von S&auml;uglingen und
          Kleinkindern . Durch ein Bettnetz k&ouml;nnen die
          Blutsauger nachts, wenn der schlafende Mensch eine
          leichte Beute ist, ferngehalten werden. Eine
          gewissenhafte Auswahl, angepasst an Reisestil und
          Unterkunft, und der ordnungsgem&auml;&szlig;e Gebrauch
          sind besonders wichtig f&uuml;r den bestm&ouml;glichen
          Insektenschutz. Das Netz sollte au f keinen Fall zu klein
          sein, denn wenn es die Haut ber&uuml;hrt, werden
          M&uuml;cken diese Stelle finden und zustechen! Stecken
          Sie das Netz ringsum unter die Matratze, um sich gegen
          kriechende Insekten zu sch&uuml;tzen! Noch besser ist es,
          nur Netze mit einer festen Bodengruppe zu verwenden, da
          hierbei jegliches Ei ndringen krabbelnder Insekten
          verhindert wird.<BR>
          Bei Bedarf k&ouml;nnen Moskitonetze zus&auml;tzlich mit
          Insektiziden impr&auml;gniert werden. Diese Substanzen
          wirken ca. ein halbes Jahr lang, wenn das Netz nicht
          gewaschen wird. Sie t&ouml;ten das Insekt schon nach
          kurzer Kontaminationszeit auf dem Moskitonetz durch de n
          Eintritt des Wirkstoffes &uuml;ber die F&uuml;&szlig;e
          und erh&ouml;hen dadurch die Prophylaxewirkung des
          Netzes. Dabei sind die humanpathogenen Konzentrationen so
          hoch, dass der Wirkstoff beim normalen Gebrauch den
          Benutzer nicht sch&auml;digt. Bei Kindern sollte die
          Impr&auml;gnierung nicht angewandt werden, da sie durch
          eventuelles Lutschen am Netz doch gr&ouml;&szlig;ere
          Dosen oral aufnehmen k&ouml;nnten. Am besten bew&auml;hrt
          haben sich die Insektizide Permethrin (z.B. Peripel&reg;)
          und Deltamethrin (z.B. K- Othrine&reg;). Denken Sie auch
          daran, vor dem Schlafengehen zu kontrollieren, ob sich
          Insekten im Inneren des Netzes befinden.<BR>
          Das Angebot an Moskitonetzen reicht von leichtgewichtigen
          Polyamidnetzen &uuml;ber robuste Polyethylennetze bis hin
          zu Spezialanfertigungen f&uuml;r H&auml;ngematten. Sehr
          feinmaschige Netze dienen zur Abwehr von extrem kleinen
          Insekten, wie z.B. den &Uuml;bertr&auml;gern der
          Leishmaniose. F&uuml;r extreme Situation gibt es selbst
          Netze zum Schutz des Kopfes oder Sonnenh&uuml;te, die mit
          einem Netz kombiniert s ind. Die Maschenweite sollte
          nicht gr&ouml;&szlig;er als 1 mm sein, um auch einen
          Schutz vor sehr kleinen blutsaugenden Insekten wie z.B.
          Kriebelm&uuml;cken (weltweit, 2 bis 3 mm gro&szlig;) und
          Sandfliegen (Phlebotomen, Tropen, Subtropen,
          Mittelmeerraum, 1,5 bis 3 mm gro&szlig;) zu
          gew&auml;hrleisten.<BR>
          <BR>
          <H3>
         <B>   Was hilft nach dem Stich </B>
          </H3>
          Wenn trotz aller Vorsichtsma&szlig;nahmen eine M&uuml;cke
          zugeschlagen hat, merkt man es meist kaum, es kann aber
          auch unter Umst&auml;nden jucken, brennen oder zu einer
          kleinen Hautr&ouml;tung oder sehr selten zu
          Entz&uuml;ndung kommen. In den Tagen nach dem Stich
          sollte das Kratzen an der Stichstelle vermieden wer den,
          um eine Entz&uuml;ndung oder gar Infektion zu verhindern.
          Sollte es doch zu einer Entz&uuml;ndung kommen, zeigt
          sich dies durch eine wieder zunehmende Schwellung oder
          R&ouml;tung mit Schmerzen und sollte
          entz&uuml;ndungshemmend behandelt werden.<BR>
          In den meisten F&auml;llen ist es ausreichend, kleinere
          Schwellungen zu k&uuml;hlen, z.B. mit einer Kompresse
          oder kaltem Wasser. Auch verd&uuml;nnter Alkohol oder
          feuchtes Kochsalz haben - auf die Haut aufgetragen -
          einen K&uuml;hleffekt. Von den althergebrachten
          Hausmitteln hat sich Huflattich als sehr gute Anwendung
          bei leichten Entz&uuml;ndungen erwiesen. Der
          Kamillenwirkstoff Bisabolol wirkt ebenfalls
          entz&uuml;ndungshemmend und ist auch in speziellen Sticks
          zur Behandlung von Insektenstichen enthalten. Wird
          hierdurch keine Linderung erzielt, besteht auch die
          M&ouml;glichkeit, speziell entwickelte Salben, Gels und
          Cremes zum Auftragen auf die Haut zu verwenden. Die
          meisten dieser Pr&auml;parate richten sich gegen den
          Juckreiz. So k&ouml;nnen Salben oder Gels verwendet
          werden, die Antihistaminika (so z.B. Fenistilgel&reg;)
          oder Kortison enthalten. Allerdings ist in diesem
          Zusammenhang ein vorsichtiger Umgang empfehlenswert, da
          Antihistamin-Pr&auml;parate bei empfindlichen Personen
          Hautreizungen und Allerg ien ausl&ouml;sen k&ouml;nnen.
          Kortisonprodukte (z.B. ratioAllerg&reg; Gel oder
          Palacril&reg; Lotio) sollten nicht gro&szlig;fl&auml;chig
          und auch nicht &uuml;ber lange Zeit angewendet werden.
          Auch speziell antiallergische Cremes sind in Apotheken
          erh&auml;ltlich. Die Wirkstoffe sind: Dimetindenmaleat,
          Bamipin, Chlorphenoxamin, Polidocano l, Bufexamac oder
          gegebenenfalls Hydrocortison z.B. Soventol&reg; und
          Panthenol Spray&reg;. In seltenen F&auml;llen kann ebenso
          eine milde Steroidcreme sinnvoll sein. Bei ausgedehnten
          Schwellungen und Entz&uuml;ndungen, besonders an Kopf und
          Hals, sollten Sie einen Arzt aufsuchen. Er wird ein
          geeignetes Mittel empfehl en k&ouml;nnen.<BR>
          <BR>
          <BR>
          <BR>
          <P id='minip' align="right">
            Erstellt am 25.2.2003 17:31:18&nbsp;&copy;2003
            Datenbasis:MTTS/DRTM
          </P>
          <P>AIS (AuslandsInformationsService) Reisegesundheit des ADAC
</P>
        </TD>
      </TR>
    </TABLE>
    <HR>
    <BR>
     
    <CENTER>
      <TABLE border summary="">
        <TR>
          <TH bgcolor="#CCCCCC" align="left">
            <CENTER>
              <FONT color="#f3300CC">JoJo</FONT> &nbsp; J&uuml;rgen
              Sperling
            </CENTER>
          </TH>
        </TR>
        <TR>
          <TH bgcolor="#FFFFCC" align="left">
            sperlingbergen@freenet.de
          </TH>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

