<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Abschlie&szlig;end
------------

Der heilige Gral, oder: 50.000 x OS 3.9 = OS 4.0 (von Martin Baute)

Ich sitze hier vor meinem Notebook und tippe diesen Artikel, den ich 
eigentlich schon letzte Woche fertig haben wollte. Doch von irgendwas mu&szlig; 
man ja leben, und mein Job sorgt f&uuml;r einen prallvollen Zeitplan - mein PDA 
kommt aus dem Terminerinnerungs-Piepen gar nicht mehr heraus.

Ich beschwere mich ja gar nicht, immerhin verdiene ich mit diesem Job 
genug, um mir diese technischen Nettigkeiten auch leisten zu k&ouml;nnen. Noch 
dazu ist es ein sch&ouml;ner Aufh&auml;nger f&uuml;r diesen Artikel.

Da bricht es also an, das digitale Zeitalter. Viele verschiedene Ger&auml;te, 
die sogenannten "Appliances", jedes spezialisiert auf eine bestimmte 
Aufgabe, sollen den "Allesk&ouml;nner" Desktop-PC abl&ouml;sen. Macht irgendwo Sinn: 
Der DVD-Spieler geh&ouml;rt auf den Fernseher, nicht ins Arbeitszimmer. Die 
Terminverwaltung auf dem Desktop zu Hause bringt mir wenig, wenn ich 
unterwegs ein wichtiges Meeting verschwitze. So ein Web Pad zum Surfen auf 
dem Sofa w&auml;re auch was Feines; und f&uuml;r keine dieser Aufgaben will ich mich 
mit Installation, Wartung und Eigenheiten eines Desktop herumschlagen 
m&uuml;ssen. Wenn dann alles auch noch "aus einem Gu&szlig;" ist, um so besser.

Die Zeit ist also reif f&uuml;r eine Technologie à la AmigaDE. Microsoft, Oracle 
und ein paar andere versuchen sich an &auml;hnlichen Ans&auml;tzen; allein deswegen 
die Flagge zu streichen w&auml;re aber vorschnell: 1985 gab es auch namenhafte 
Konkurrenz auf dem Computermarkt, was Amiga nicht daran hinderte, diese 
Konkurenz auszustechen. Die Unabh&auml;ngigkeit von der zugrundeliegenden 
Hardware sowie die F&auml;higkeit, verschiedene existierende Betriebssysteme als 
Host zu nutzen, scheinen das AmigaDE anderen Ans&auml;tzen &uuml;berlegen zu machen.

Genaueres kann man nat&uuml;rlich erst sagen, wenn man die Produkte vergleichen 
kann - denn nicht nur das AmigaDE befindet sich erst im Aufbau, Microsoft 
und Oracle sind auch noch nicht viel weiter. Trotzdem wird es ein Kopf-an-
Kopf-Rennen, in dem Amiga Inc. nur dann Chancen hat, wenn man alles Talent 
und Engagement auf das eine, gemeinsame Ziel konzentrieren kann.

Da ruft es aber aus dem User-Lager nach einer Weiterentwicklung des 
"Classic"-OS. Haage & Partner hat diese in Form des OS 3.5 und OS 3.9 
geliefert, und neben dem Lob auch eine Menge Schelte einstecken m&uuml;ssen - zu 
wenige echte Fortschritte, oberfl&auml;chliche Sch&ouml;nheitskorrekturen, 
&uuml;berteuerte Shareware-Kollektion, so oder &auml;hnlich &auml;u&szlig;erten sich entt&auml;uschte 
User im Internet und auf Messen.

Dann kam Fleecy Moss zur "World of Amiga 2000" (in Vertretung von Bill 
McEwen, der kurzfristig Besuch von japanischen Gentlemen mit 
Aktenk&ouml;fferchen bekommen hatte), und machte eine vieldiskutierte Aussage: 
Amiga Inc. werde ein OS 4.0 PPC entwickeln, wenn vom OS 3.9 mindestens 
50.000 St&uuml;ck verkauft w&uuml;rden. Diese Arbeit w&uuml;rde allerdings im Gegensatz zu 
OS 3.5 und 3.9 von Amiga Inc. geleitet - eben damit aus einem OS 4.0 PPC 
nicht der dritte Aufgu&szlig; einer Shareware-Kollektion wird, um den bissigen 
Tonfall einiger OS3.9-Kritiker aufzunehmen.

Jetzt mu&szlig; ich zur Kl&auml;rung meine eigene Meinung darlegen: Das Engagement 
seitens Amiga Inc. bez&uuml;glich OS 3.9 kann ich ja irgendwie noch 
nachvollziehen, man will halt die Anwenderschaft bei Laune halten. Das 
dabei keine revolution&auml;ren Neuerungen herausgekommen sind, ist angesichts 
der Haage & Partner zur Verf&uuml;gung stehenden Ressourcen verst&auml;ndlich. Ein OS 
4.0 PPC halte ich jedoch, auf gut Deutsch, f&uuml;r eine reichlich bescheuerte 
Idee - ein mir gut befreundeter Rechtsanwalt nennt das etwas geschliffener 
"evidenten Schwachsinn".

Sicherlich w&uuml;rde die Fertigstellung eines OS 4.0 PPC die Wogen gl&auml;tten, am 
Besten mit vielen gro&szlig;artigen Verbesserungen im OS, seinen F&auml;higkeiten, 
Schnittstellen und dem Look & Feel.

Aber kurz darauf w&auml;re das Geschrei sicher gro&szlig;: Wenn die User, die so laut 
das OS 4.0 PPC zus&auml;tzlich zum AmigaDE (oder sogar anstelle desselben) 
gefordert haben, feststellen, das auch das OS 4.0 PPC nicht mehr w&auml;re als 
ein v&ouml;llig neues OS mit einer 68k/OS3.x-Emulation.

Vielen Amiga-Usern ist eines gemeinsam: Je mehr sie sich ein OS 4.0 PPC 
w&uuml;nschen, desto negativer - oder zumindest gleichg&uuml;ltig - stehen sie dem 
AmigaDE und den Pl&auml;nen von Amiga Inc. selbst gegen&uuml;ber. Diese User scheinen 
zu verkennen, dass f&uuml;r sie wahrscheinlich kaum ein Unterschied zwischen dem 
OS 4.0 PPC und dem AmigaDE bestehen w&uuml;rde.

Mal ein kurzer Exkurs ins Technische: Es ist ein Fakt, da&szlig; alle heute 
verf&uuml;gbare Software auf die F&auml;higkeiten, Grenzen und Schw&auml;chen des OS 3.x 
zugeschnitten, und selbst im Fall von Power/WarpUP-Software zumindest zum 
Teil auf einen 68k-Prozessor angewiesen ist. Um diese Software unter einem 
OS 4.0 PPC zu nutzen, m&uuml;&szlig;ten

- eine 68k-CPU emuliert werden,
- die OS3.x-Libraries entweder in dieser Emulation laufen oder als PPC-     
  Library mit abw&auml;rtskompatibler Schnittstelle angeboten werden - mit allen  
  Fehlern und Schw&auml;chen des OS 3.x. 

Alle programmspezifischen Bibliotheken (wie zum Beispiel die MUI-Libs, die 
Superview-Module etc.) sowie die Programme selbst w&uuml;rden immer noch im 68k-
Code vorliegen und m&uuml;&szlig;ten in Emulation laufen. Wer's nicht glauben mag, 
darf sich gern weiter unten selbst &uuml;berzeugen - Fleecy Moss' Antwort auf 
entsprechende Fragen meinerseits.

Dazu kommt, da&szlig; die Fortschritte im OS 4.0 PPC f&uuml;r diese alte Software gar 
nicht zug&auml;nglich w&auml;ren - Speicherschutz, Ressource-Tracking, welche-tolle-
Neuerung-auch-immer k&ouml;nnten nur von auf OS 4.0 PPC angepa&szlig;ter Software 
genutzt werden. Die Situation w&auml;re ganz &auml;hnlich wie beim Erscheinen der 
ersten PPC-Karten - kaum eine Software konnte die schnellen CPUs nutzen, 
und bis heute profitiert nur ein Bruchteil der allt&auml;glich genutzten 
Software von der teuren Anschaffung. Beim OS 4.0 PPC w&auml;re es nicht anders.

Dann w&auml;re da noch das Thema Hardware. F&uuml;r das OS 4.0 PPC br&auml;uchte es einen 
"Classic"-Amiga mit PPC (davon gibt es Sch&auml;tzungen zufolge weniger als 
20.000 St&uuml;ck), oder einen Macintosh. Denn Fakt ist auch, da&szlig; alle 
angek&uuml;ndigten G3/G4-Boards und -Systeme bisher nicht erh&auml;ltlich sind. Da 
mu&szlig; doch die Frage erlaubt sein: Wieviele Firmen w&uuml;rden ihre Software auf 
ein OS 4.0 PPC anpassen, bei einen potentiellen Markt von maximal 
vielleicht 50.000 St&uuml;ck?

Viele User f&uuml;rchten den Umstieg. Dabei wird verkannt, da&szlig; der Bruch 
zwischen OS 3.x und einem gut weiterentwickelten OS 4.0 PPC genauso gro&szlig; 
ausf&auml;llt wie zum AmigaDE.

Das AmigaDE wird eine ganz &auml;hnliche Plattform f&uuml;r alte Software bieten, 
soviel ist angek&uuml;ndigt. Wenn die OS-Bibliotheken dann in portablen VP-Code 
vorliegen, profitieren Bibliotheksaufrufe nicht nur von einem schnellen 
PPC, sondern wahlweise auch von einem schnellen Athlon, schnellen Alpha 
oder billigen MIPS. ;-)

Der Effekt w&auml;re derselbe: Alte Software l&auml;uft weiter, neue Software kann 
die neuen F&auml;higkeiten des OS nutzen. Nur, da&szlig; die Auswahl an kompatibler 
Hardware ungleich gr&ouml;&szlig;er w&auml;re. Auch der potentielle Markt w&auml;re um ein 
Vielfaches gr&ouml;&szlig;er, genau wie die Aussichten auf Neu- und 
Weiterentwicklungen.

Ganz davon abgesehen, wenn man einen "OS 4.0 PPC"-Bef&uuml;rworter fragt, was er 
sich von seinem "neuen" OS so alles erhofft... je anspruchsvoller die 
Wunschliste wird, um so mehr sieht sie aus wie eine Spezifikation des 
AmigaDE.

Oft wird Amiga Inc. ein bestimmtes Zitat vorgehalten: "Wir haben den Amiga 
der User wegen von Gateway gekauft". Damit war nicht unsere Kaufkraft 
gemeint, nicht unser Geschrei und Gejammer in den Foren und den 
Messehallen. Gemeint war unsere Kreativit&auml;t. Gemeint waren die 
Arbeitsstunden, die Amiga-User bereit sind, in neue Anwendungen, Projekte 
und Konzepte zu investieren. Der Amiga-Markt mag in den strategischen 
&Uuml;berlegungen von Amiga Inc. eine Rolle spielen; in der Bilanz ist er neben 
den Aktenk&ouml;fferchen besagter japanischer Gentleman nur ein unbedeutender 
Nebenposten.

Amiga Inc. kann nur vom OS 4.0 PPC nicht leben; abgesehen von den bereits 
erfolgten Investitionen (und Verpflichtungen) zum AmigaDE w&auml;re der Markt 
einfach zu klein. Also m&uuml;&szlig;te ein OS 4.0 PPC parallel zum AmigaDE entwickelt 
werden - weniger Finanzen, weniger Entwickler, weniger Software, weniger 
Chancen f&uuml;r beide Systeme. Ist es das, was wir wollen?

Wenn Amiga nicht der Sprung in die Zukunft gelingt - Zukunft meint hier 
AmigaDE, nicht die Herz-Lungen-Massage am "Classic"-OS -, dann wird der 
Amiga-Markt weiter dahinsiechen, wie er es die letzten Jahre getan hat. 
Langsam aber unausweichlich, Shogo und G3-Boards und OS 4.0 PPC zum Trotz, 
wird sich Vergessen &uuml;ber den ersten Multimedia-Computer der Geschichte 
ausbreiten.

Manch einem mag das sogar egal sein, solange er nur morgen - am besten 
heute noch - endlich sein OS 4.0 PPC in den H&auml;nden h&auml;lt, damit er seinem 
aus einem halben Dutzend Erweiterungsplatinen zusammengestecken Liebling 
noch ein "zeitgem&auml;&szlig;es" OS eintr&auml;ufeln kann. Dass &uuml;bermorgen ein OS 5.0 
notwendig w&auml;re (von wem denn dann?), zusammen mit zwei bis drei weiteren 
Erweiterungsplatinen (von wem denn dann?), um sich nicht v&ouml;llig der 
L&auml;cherlichkeit der &uuml;brigen Computerwelt preiszugeben, dar&uuml;ber wird nicht 
nachgedacht.

Zum ersten Mal seit 1992, als ich mir mit einem A2000 meinen ersten Amiga 
zulegte, werde ich eine Fortentwicklung von Amiga-Technologie nicht 
mitmachen. Ich habe seinerzeit von OS 2.0 auf OS 3.1 aufger&uuml;stet, weil ich 
das neue OS f&uuml;r meine Aufgaben brauchte. (Ich glaube, es war Wordworth, das 
ein OS 3.x voraussetzte...) Ich habe von OS 3.1 auf OS 3.5 aufger&uuml;stet, 
weil ich eine Stimme f&uuml;r die Zukunft von Amiga abgeben wollte. Und aus 
genau demselben Grund werde ich mir OS 3.9 nicht zulegen - weil ich eine 
Stimme f&uuml;r die Zukunft von Amiga abgeben will.

Eine Zukunft, die unausweichlich im Wohl und Wehe des AmigaDE liegt, und 
zwar in den Augen der Computerwelt, nicht in den Augen des Amiga-Marktes. 
Ich wei&szlig;, es f&auml;llt schwer, es einzugestehen - aber als Markt sind wir 
unwichtig geworden. Was bleibt, ist unser Engagement und unser K&ouml;nnen. Das 
k&ouml;nnen wir besser unter Beweis stellen als damit, nach einem "OS 4.0 PPC" 
zu schreien...

(Es folgt ein Ausschnitt aus Fleecys Antwort auf technische Fragen, die ich 
ihm im Zusammenhang mit diesem Artikel gestellt habe. Zum besseren 
Verst&auml;ndnis ist der Text von mir &uuml;bersetzt und teilweise gek&uuml;rzt worden.)

Von:      fleecy [fleecy@amiga.com]
Gesendet: Freitag, 15. Dezember 2000, 19:04 Uhr
An:       Baute, Martin [solar@baud.de]
Betreff:  Re: Presseanfrage - OS 4.0 / PPC

&gt; Gesetzt den Fall, Haage & Partner / Amiga Inc. entscheiden
&gt; sich, ein AmigaOS 4.0 / PPC zu entwickeln.
&gt;
&gt; 1. Ist es nicht wahr, da&szlig; alte Software weiterhin im
&gt; 68k-Modus laufen m&uuml;&szlig;te, sei es in Hardware oder emuliert?

Ja, allerdings k&ouml;nnten die aufgerufenen Bibliotheken nativ
PPC sein, was der Gro&szlig;teil der Arbeit sein kann.

&gt; 2. Ist es nicht wahr, da&szlig; diese 68k-Schicht, unabh&auml;ngig von
&gt; Verbesserungen im &uuml;brigen OS, immer noch von den Einschr&auml;nkungen
&gt; des OS 3.x betroffen w&auml;re (z.B. kein Speicherschutz), weil
&gt; sonst die Kompatibilit&auml;t nicht gew&auml;hrleistet w&auml;re?

Ja - OS 4 w&uuml;rde den klassischen Amiga in einem zusammenh&auml;ngenden
Speicherbereich abbilden, so da&szlig; alle alten Probleme f&uuml;r alte
Software immer noch existieren w&uuml;rden. Allerdings k&ouml;nnte neue
Software, f&uuml;r OS 4 entwickelt, den neuen modernen Kernel nutzen.

&gt; 3. Ist es nicht wahr, da&szlig;, um von Verbesserungen im OS zu
&gt; profitieren, alte Software stark modifiziert, im Idealfall
&gt; zumindest neu kompiliert werden m&uuml;&szlig;te?

Ja, und da die Quellcodes f&uuml;r die meiste alte Software nicht
einmal mehr existieren, denke ich, hast Du Deine eigene Frage
beantwortet. Jedes OS 4 w&uuml;rde einfach einen Weg bieten, altes
Zeug auf der neuen Hardware auszuf&uuml;hren - der wahre Wert eines
OS 4 l&auml;ge in der daf&uuml;r neu geschriebenen Software.

Kein weiterer Kommentar. Ab hier mu&szlig; sich jeder seinen eigenen Teil denken.

---------------------------------------------------------------------------

Zum Abschlu&szlig; ein Wort in Richtung Haage & Partner: Ich will niemandem davon 
abraten, sich das OS 3.9 zu kaufen, wenn er es braucht. Der Zweck dieses 
Artikels war schlicht folgender: Wer sich &uuml;berlegt, den Kauf / Nichtkauf 
von OS 3.9 als "Stimmzettel" f&uuml;r das OS 4.0 PPC zu sehen, sollte beide 
Seiten der Medaille betrachtet haben.

F&uuml;r Kommentare, Feedback und (konstruktive) Kritik bin ich offen.

Martin Baute &lt;solar@baud.de&gt;


Damit sage auch ich tsch&uuml;s und
bis n&auml;chsten Monat,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
