<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Der Zwischenruf (von Ralf Driesner)
-----------------------------------

Ja wo samma' denn?!

Ich sitze relaxt am runden Esstisch meines Geraer Zweit- und 
Urlaubswohnsitzes. Der Techniker einer lokalen Telefongesellschaft hat 
heute f&uuml;r meinen ISDN-Anschlu&szlig; gesorgt, meine "Freundin" h&auml;ngt jetzt an der 
schnellen Strippe. 

Einem Handy habe ich mich bis jetzt standhaft verweigert. Vielleicht auch 
nur deswegen, weil ich nicht zu den "gl&uuml;cklichen" geh&ouml;re, die so was unter 
dem Weihnachtsbaum finden. Ob nun auch ein bi&szlig;chen Neid zu meiner nicht 
besonders positiven Meinung &uuml;ber den Handy-Werberummel in den Medien 
gef&uuml;hrt hat? Na ja, wer wei&szlig;, vielleicht.
 
Wieviele Kommunikationsmittel braucht der Mensch zum gl&uuml;cklich sein? Gute 
Frage... n&auml;chste Frage. Welche Kommunikationsmittel braucht der Mensch, um 
gl&uuml;cklich zu sein? Auch nicht leicht zu beantworten.

Mir f&auml;llt bei diesen Fragen auf, dass ich mir offensichtlich mehr Gedanken 
&uuml;ber die technische Komponente mache als um den Inhalt der Kommunikation.

Also gut... falscher Ansatzpunkt. Probieren wir es mal so: Wann habe ich 
eigentlich das letzte wirklich intensive Gespr&auml;ch gef&uuml;hrt? Und worum ging 
es da? So spontan f&auml;llt mir da gar nichts ein. Was habe ich denn heute 
morgen der h&uuml;bschen Verk&auml;uferin beim B&auml;cker erz&auml;hlt? Hab ich au&szlig;er dem 
morgendlich unausgeschlafenen "Morgen!!" und "Vier Brezn' bitte" &uuml;berhaupt
was gesagt?

O.k., gehen wir weiter zur&uuml;ck in der Zeit. Gestern Abend habe ich fern 
gesehen. Zum Weggehen hatte ich keinen Bock. Der Fernseher f&uuml;hrte einen 
Monolog.

Am Nachmittag war ich in der Innenstadt. Es war ziemlich &uuml;berf&uuml;llt. Ein 
ISDN-taugliches Telefon mu&szlig;te angeschafft werden; schlie&szlig;lich wird's morgen 
ernst. Ich erinnere mich an den ziemlich &uuml;berschwenglich motiviert-
hektischen Verk&auml;ufer. Irgendwie hat der mich an diesen Knilch aus der 
Telekom-Werbung erinnert. Der H&ouml;hepunkt seiner Produkt-Anpreisung war der 
Hinweis "Ja, wissen Sie, ISDN, das braucht man heute schon". Auf meine 
Frage, ob er auch einen entsprechend modernen Telefonanschlu&szlig; hat, mu&szlig;te er 
passen. "Aber ich hab ein Handy... hihihi-gnatz-kicher... vielleicht darf 
ich Ihr Interesse ja auch auf...". Ich winke dankend ab.

Mmmhh, na ja. Ich sehe, dass diese Form der Problemanalyse nicht besonders 
ergiebig ist. Ich greife das gestern neu erworbene Telefon und versuche, 
einen Freund anzurufen. "Hallo Ralf, ist ja sch&ouml;n, dass du anrufst. Wie 
geht's denn? &lt;trilllll&gt; Ach warte mal, mein Handy klingelt. Oder wei&szlig;t du 
was... ich rufe dich dann mal zur&uuml;ck." Er will also "mal" zur&uuml;ckrufen. 

O.k... war wohl auch nix. Ich rufe mal eine Kollegin an, die nicht von 
meinem Privileg profitiert, Urlaub zu haben. Vor einigen Tagen habe ich ihr 
ganz stolz meine drei Telefonnummern (MSN's) per E-Mail mitgeteilt. Auf 
ihre Frage "Und welche Nummer ist jetzt f&uuml;r was?" bin ich verdattert vor 
dem Bildschirm gesessen. Ich versprach, ihr es herauszufinden.

Also zwei Fliegen mit einer Klappe schlagen. Kleiner Ratsch f&uuml;r mich und 
meine Nummer in Ihrem Display f&uuml;r sie. He he, genial. Gedacht, gew&auml;hlt 
und... das einschl&auml;fernde "tuuuuuut  tuuuuuut  tuuuuuut" wirkt irgendwie 
beruhigend auf mich. Nach etwa f&uuml;nf bis sechs Mal Klingeln lege ich auf. 
Zwei weitere Versuche haben auch keinen Erfolg. Absicht? Mmmhh, wohl eher 
viel Arbeit...

Na ja, nicht verzagen. "Probier's bei einer anderen Kollegin. Die eine 
hatte doch Geburtstag, und du hast ihr noch nicht gratuliert". Ich habe 
Erfolg. Sie meldet sich. Kurzer Gl&uuml;ckwunsch durch die Leitung, kleine 
"Statusmeldung" &uuml;ber die ersten Tage meines Urlaubs und noch ein paar liebe 
Gr&uuml;&szlig;e aus Gera; aber sie hat viel zu tun und ich bekomme ein schlechtes 
Gewissen. Also kurzer Abschlu&szlig; des Gespr&auml;chs mit den besten W&uuml;nschen zu 
Weihnachten und einen "Guten Rutsch ins n&auml;chste Jahr".

Mmmh, das war's nun auch nicht. Meinen letzten Versuch starte ich bei einer 
Bekannten, die nicht weit weg von Gera wohnt. Ein herzliches "Hallo... wie 
geht's denn? Das ist ja nett, dass Sie sich wieder melden". Das Telefonat 
dauert etwa fünf Minuten, mit dem Resultat, dass wir uns ein paar Tage 
sp&auml;ter treffen. Es war ein netter Tag, wir hatten uns viel zu erz&auml;hlen, und 
zum Abschied gibt's noch eine beherzte Umarmung.

Mein Fazit: Moderne Kommunikationselektronik verschafft uns eine Vielfalt 
von M&ouml;glichkeiten. Aber Leute... ich w&uuml;nsche uns allen f&uuml;r das Jahr 2001 
und dar&uuml;ber hinaus, dass wir wieder wirklich miteinander reden.
  
Lebt lang und erfolgreich


Euer 

Ralf Driesner &lt;global-dries@gmx.de&gt;


P.S.: Ich bedanke mich ganz herzlich f&uuml;r die netten Reaktionen auf meine 
letzten beiden Zwischenrufe. Besonderer Dank geht an Michael Christoph, der 
sich an eine L&ouml;sungsm&ouml;glichkeit f&uuml;r mein im Zwischenruf 11/00 
angesprochenes Zeitproblem erinnert hat. Zumindest mein Amiga wei&szlig; jetzt 
immer genau, wann Sommer- und Winterfell w&auml;chst. Bestimmt auch eine L&ouml;sung 
f&uuml;r andere Leser!  

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
