<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - CoolNESs</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

</P><DIV ALIGN=CENTER><H1>CoolNESs</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV><P>
<B>Vorgeschichte</B>
</P><P>
Nintendo - einst als Spielkartenhersteller in's Leben gerufen, ist seit
Mitte der achtziger Jahre durch den Bau von Videospielkonsolen ber&uuml;hmt
geworden. 1985 gelang Nintendo der Durchbruch mit dem &quot;Nintendo
Entertainment System&quot;, kurz &quot;NES&quot;. Und auf auf dieser Konsole erschienen
Spiele, die es wirklich zu Weltruhm gebracht haben. Wer kennt nicht
&quot;Zelda&quot;, &quot;Super Mario&quot;, &quot;Castelevania&quot; und, und, und...
</P><P>
Alle diese Klassiker k&ouml;nnen mit Hilfe von Emulatoren auch auf dem Amiga
gespielt werden. Von den drei ernstzunehmenden NES-Emulatoren &quot;darkNES&quot;,
&quot;A/NES&quot; und &quot;CoolNESs&quot; f&uuml;r den Amiga, habe ich mir letztgenannten
einmal n&auml;her angeschaut.
</P><P>
<b>ROM's</b>
</P><P>
Das Internet bietet reichhaltig NES-Spiele als ROM-Files zum Herunterladen
an, aber hier sei einmal mehr angemerkt, da&szlig; die Nutzung dieser ROM-Images
nur erlaubt ist, wenn die Orginal-Spiele besitzt.
</P><P>
Ein Tip an dieser Stelle: Das Spiel &quot;Elite&quot; (das Weltraum-Simulations-
Handelspiel, welches einst auf dem Commodore 64 gro&szlig;e Erfolge feierte)
ist Freeware!
</P><P>
<B>Systemvoraussetzungen</B>
</P><P>
Zum Betrieb wird nur ein Amiga mit 68020-Prozessor, 2 MB RAM und den
AGA-Chips ben&ouml;tigt. Ein 68030-Prozessor ist f&uuml;r den gr&ouml;&szlig;ten Teil der
Spiele hinsichtlich der Emulationsgeschwindigkeit ausreichend, der
wahre Spielspa&szlig; kommt aber erst mit einem 68040 auf.
</P><P>
Die Installation wird einfach und problemlos durch das beigef&uuml;gte
Installationsskript durchgef&uuml;hrt.
</P><P>
Eine ausf&uuml;hrliche englischsprachige Anleitung im Amiga-Guide-Format l&auml;&szlig;t
keinerlei Fragen zur Nutzung des Emulators offen. Selbst die Integration
von veranschaulichenden Grafiken und eines FAQ's wurde nicht vergessen.
</P><P>
Die Demoversion von &quot;CoolNESs&quot; schr&auml;nkt einige Funktionen ein, das
Keyfile f&uuml;r die Vollversion kann beim schwedischen Autor Fredrik Olsson
f&uuml;r 30,- DM abgefordert werden.
</P><P>
<B>Cool?</B>
</P><P>
Nach dem Programmstart durch Doppelklick auf das Workbench-Icon,
erscheint ein kleines GUI, welches die wichtigsten Programmfunktionen
enth&auml;lt.
</P><P>
Neben dem obligatorischen &quot;ROM laden&quot; und &quot;ROM starten&quot;, lassen sich
hier jede Menge Einstellungen vornehmen, die neben den Steuerungsmethoden
(Tastatur, Joystick und Joypad) auch die Grafik- und Soundwiedergabe
optimieren. Sollte ein Spiel nicht einwandfrei laufen, empfehle ich,
hier ein wenig herumzuexperimentieren.
</P><P>
Die Spiele selbst sollten am besten mit einem Joypad gespielt werden,
denn jedes NES-Spiel unterst&uuml;tzt die Nutzung von zwei Kn&ouml;pfen. Bei einem
Ein-Button-Joystick mu&szlig; zus&auml;tzlich die Tastatur zu Hilfe gezogen werden,
was aber bei schnellen Action-Spielen h&auml;ufig zu Problemen oder besser
gesagt zum Verlust eines Lebens f&uuml;hrt.
</P><P>
Zirka 70 Prozent der von mir getesteten ROMs liefen ohne Einschr&auml;nkungen,
20 Prozent hatten mit Grafik- oder Soundproblemen zu k&auml;mpfen, dennoch ist
man in der Lage, auch diese zu spielen. Die restlichen 10 Prozent lie&szlig;en
sich entweder gar nicht laden oder verursachten ein Grafikchaos.
</P><P>
Zur Entschuldigung von &quot;CoolNESs&quot; sei aber angemerkt, da&szlig; dies an dem
&auml;u&szlig;erst komplexen Grafikchip des NES liegt. Zirka 80 verschiedene
Grafikmodi sind mit ihm m&ouml;glich. Hiermit tut sich jede Emulation, auch
plattform&uuml;bergreifend, &auml;u&szlig;erst schwer - als Beispiel sei hier nur
&quot;Nestickle&quot; auf dem PC genannt.
</P><P>
<B>Spielstandssicherung</B>
</P><P>
Ein Spiel wie zum Beispiel &quot;Zelda&quot;, kann man nicht an einem St&uuml;ck
durchspielen. Daher ist die Sicherung von Spielst&auml;nden durch die
Emulation lobenswert. M&ouml;glich ist das bei Spielen, die in der Lage
sind einen Spielstand im ROM (per Batterie!) zu sichern. Bei CoolNESs
werden dieses Spielst&auml;nde dann aber selbstverst&auml;ndlich auf dem
gew&auml;hlten Datentr&auml;ger gesichert.
</P><P>
<B>Cheats</B>
</P><P>
F&uuml;r fast jedes Modul gibt es Cheat-Kombinationen, die sich auf den
Orginalger&auml;ten durch entsprechende Kombinationen und Bewegungen des
Steuerpads aktivieren lassen. Diese Eingabem&ouml;glichkeit ist nat&uuml;rlich
auch mit dem Emulator w&auml;hrend des aktuellen Spiels m&ouml;glich.
</P><P>
<B>Screenshots</B>
</P><P>
Ein weiterer interessanter Punkt ist das Anfertigen von Screenshots via
Tastenkombination, die als IFF-Bild gesichert werden. Diese Funktion ist
durch die Nutzung des Amiga-Multitaskings m&ouml;glich, das auch jederzeit eine
R&uuml;ckkehr zur Workbench oder anderen aktiven Programmen erm&ouml;glicht.
</P><P>
Au&szlig;erdem kann man jederzeit vom aktuellen Spiel in das GUI zur&uuml;ckzukehren,
um dort eventuell Einstellungen zu &auml;ndern, die sich dann beim Fortsetzen
des Spiels sofort auswirken.
</P><P>
<B>Fazit</B>
</P><P>
Die Kompatibilit&auml;t zu vorhandenen NES-ROMs ist im Vergleich zu anderen
Mitbewerbern (auch am PC) h&ouml;her, ebenso beeindrucken die vielen Funktionen
dieses Emulators. Daher kann &quot;CoolNESs&quot;, sowie die Registrierung auf jeden
Fall empfohlen werden.
</P>

<TABLE cellpadding=2 BORDER=0>
<TR>
	<td><b>Programm:</b></td>
    <TD><B>CoolNESS</B> 1.76</TD>
</TR>
<TR>
	<td><b>Status:</b></td>
    <TD>Shareware, Preis der Vollversion: 30,- DM</TD>
</TR>
<TR>
	<td><b>Autor:</b></td>
    <TD><A HREF="mailto:flubba@hem2.passagen.se">Fredrik K. Olsson</A></TD>
</TR>
</TABLE> 

<P>
Bezugsquelle: <A HREF="http://hem2.passagen.se/flubba/">http://hem2.passagen.se/flubba/</A>
</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../pd/9912emu.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../pd/9912htm.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
