<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - PD-Emu-Box</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>PD-Emu-Box</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>

<center><p>
<A NAME="start">Ansprungpunkte:</A> <A HREF="#news">News</A> / <A HREF="liste.htm">Emulatoren-Liste</A>
</p>

<hr>
</P><P>
    <h3>Ein herzliches Willkommen in der neuen Ausgabe der PD-Emu-Box!</h3></center>
</P><P>
Leider mu&szlig; ich mit einer schlechten Nachricht beginnen.
</P><P>
Was sich schon seit l&auml;ngerer Zeit andeutete, hat sich nun leider auch
bewahrheitet: Der spanische Programmierer Juan Antonio Gomez Galvez, der
eine Vielzahl erstklassiger Spielkonsolen-Emulationen programmierte, u.a.
&quot;AmiMasterGear&quot; (Test s. AmZeiger #9), &quot;AmiGameBoy&quot; und &quot;AmiMSX&quot;, stellte
seine Aktivit&auml;ten mangels Zeit ein. Als 'Abschiedsgeschenk' funktionierte
er alle seine Emulatoren durch die Freigabe der Keyfiles zu Freeware um.
Die genauen Bezugsadressen hierf&uuml;r finden Sie in den <A HREF="../pd/9912Emu.htm">Emu-News</A>.
</P><P>
Hinsichtlich der vielen Aktivit&auml;ten als Emulations-Programmierer scheint
aber der Schwede Mathias Roslund sein Nachfolger zu werden. Sein neuestes
Projekt &quot;DarcNES&quot; (ein Multikonsolenemulator) klingt sehr vielversprechend.
Mehr Informationen hier&uuml;ber finden Sie ebenfalls in den News, au&szlig;erdem
gibt es in dieser Ausgabe einen Test des NES-Emulators <A HREF="../pd/9912nes.htm">CollNESs</A> und
erneut die aktuelle <A HREF="../pd/liste.htm">Auflistung</A> der im Moment erh&auml;ltlichen Emulatoren
mit ihren Bezugsquellen im Internet.
</P><P>
Aufgrund der Schnellebigkeit des Internets kann es in vereinzelnten
F&auml;llen vorkommen, da&szlig; es zu dem Zeitpunkt, in dem Sie diese Liste lesen
schon zu einigen &Auml;nderungen der Internet-Adresse gekommen ist. Sollten
Sie Unstimmigkeiten feststellen oder Erg&auml;nzungen zu dieser Liste haben,
w&uuml;rde ich mich sehr freuen, wenn Sie mir diese mitteilen.
</P><P>
Und nun auf in die... Welt der Emulatoren! :-)
</P><P>
<HR>
</P><P>
<A NAME="news"><h3><center>Neuigkeiten aus der Welt der Emulatoren</center></h3>
</P><P>
Der spanische Programmierer Juan Antonio Gomez Galvez hat leider seine
Aktivit&auml;ten am Amiga aufgrund von Zeitmangel eingestellt.
</P><P>
Zu den bekanntesten Emulationen z&auml;hlen sicherlich &quot;<B>AmiMasterGear</B>&quot;,
&quot;<B>AmiGameBoy</B>&quot; und &quot;<B>AmiMSX2</B>&quot;.
</P><P>
Zum Abschied sind seine s&auml;mtlichen Emulationen frei ver&ouml;ffentlicht
worden. Auf seiner Homepage finden sich alle Programme, Keyfiles und
die Quellcodes der Programme zum Herunterladen.
</P><P>
<A HREF="http://www.arrakis.es/~joanant/">http://www.arrakis.es/~joanant/</A>
</P><P>
 <hr width="50%">
</P><P>
An seine Stelle scheint der schwedische Programmierer Mathias Roslund
zu treten. Derweil finden sich folgende f&uuml;nf Konsolen-Emulatoren in
Arbeit:
</P><P>
- <B>AmiGenerator</B> (Sega Megadrive)
</P><P>
- <B>Colem</B>        (ColecoVision)
</P><P>
- <B>DarcNes</B>      (dies ist eine Multikonsolen-Emulation, die das &quot;NES&quot;,
               &quot;Sega Mastersystem&quot; und das &quot;Sega GameGear&quot; unterst&uuml;tzt)
</P><P>
- <B>Handy</B>        (Atary Lynx {Wer kennt dieses System noch? Ein Handheld-
                System, das dem Gameboy technisch weit &uuml;berlegen war,
                aber sich nie durchsetzen konnte.})
</P><P>
- <B>TrueReality</B>  (Nintendo 64)
</P><P>
Alle diese Emulationen setzen einen PowerPC-Amiga mit installiertem
WarpUP-System von Haage &amp; Partner voraus und unterst&uuml;tzen AGA, sowie
Grafikkarten.
</P><P>
<A HREF="http://www.amidog.com/emu/">http://www.amidog.com/emu/</A>
</p>
<hr width="50%">
</P><P>
Microcode-Solutions best&auml;tigte, da&szlig; die PPC-Version des Apple Macintosh-
Emulators &quot;Fusion&quot; Anfang November erh&auml;ltlich sein soll.
</P><P>
[...bzw. nach neuesten Meldungen Ende November; d. Chefred.]
</P><P>
Dagegen ist noch unbekannt, ob es eine PPC-Version von &quot;PCx&quot; geben wird.
Zum jetzigen Zeitpunkt fehlen f&uuml;r eine Fertigstellung dieses Programms
noch ca. 100 Vorbestellungen.
</P><P>
<A HREF="http://www.microcode-solutions.com/amiga/amiga.html">http://www.microcode-solutions.com/amiga/amiga.html</A>
</P><P>
<hr width="50%">
</P><P>
Wer eine Macintosh-Emulation (&quot;Shapeshifter&quot; oder &quot;Fusion&quot;) nutzt, und
eventuell einige Probleme hiermit hat, sollte mal einen Blick auf den
&quot;<B>Macintosh Troubleshooter AmigaGuide</B>&quot; werfen. Hier wird (leider in
Englisch) viel Hilfe geboten und auch auf andere Mac-spezifische Dinge,
wie z.B. den existierenden Mac-Viren, eingegangen.
</P><P>
<A HREF="http://ftp.uni-paderborn.de/pub/aminet/misc/emu/Mac_TroubleIII.lha">http://ftp.uni-paderborn.de/pub/aminet/misc/emu/Mac_TroubleIII.lha</A>
</P><P>
<hr width="50%">
</P><P>
Steffen H&auml;user ver&ouml;ffentlichte die Version 4.0 des Super-Nintendo-
Emulators &quot;<B>WarpSNES</B>&quot;. Diese Version basiert auf dem aktuellen
(plattform&uuml;bergreifenden) SNES9x 1.23 Quellcode.
</P><P>
<A HREF="http://ftp.uni-paderborn.de/pub/aminet/misc/emu/warpsnes.lha">http://ftp.uni-paderborn.de/pub/aminet/misc/emu/warpsnes.lha</A>
</P><P>
<hr width="50%">
</P><P>
Die PPC-Version von &quot;<B>Mame</B>&quot; (Multi Arcarde Emulator) wurde weiter
optimiert und erschien Ende August in der Version &quot;PPC 3.6b2&quot;.
</P><P>
<A HREF="http://www.multimania.com/keylock//archives/mameppc36b2.lha">http://www.multimania.com/keylock//archives/mameppc36b2.lha</A>
</P><P>
<hr width="50%">
</P><P>
&quot;<B>A/NES</B>&quot;, eine Emulation f&uuml;r das &quot;Nintendo Entertainment System&quot;,
unterst&uuml;tzt nun auch Grafikkarten und die Emulationsgeschwindigkeit
hat auch um einiges an Tempo zugelegt.
</P><P>
Die Version &quot;A/NES CGFX Preview 2&quot; ist sich hier zu beziehen:
</P><P>
<A HREF="http://www.emuclassics.com/anes/default2.html">http://www.emuclassics.com/anes/default2.html</A>
</P><P>
<hr width="50%">
</P><P>
Mit &quot;<B>Flamingo</B>&quot; erschien ein weiterer Emulator f&uuml;r den Commodore-Rechner
Plus/4.
</P><P>
<A HREF="http://ftp.uni-paderborn.de/pub/aminet/misc/emu/flamingo.lha">http://ftp.uni-paderborn.de/pub/aminet/misc/emu/flamingo.lha</A>
</P><P>
<hr width="50%">
</P><P>
Ein Programmpaket namens &quot;<B>ElectronicGame</B>&quot; erschien im Aminet und
beinhaltet die Emulation von vier relativ unbekannten Handheld-Spielen,
die Mitte der 80'er Jahre noch weit vertreten waren.
</P><P>
<A HREF="http://ftp.uni-paderborn.de/pub/aminet/misc/emu/ElectronicGame.lha">http://ftp.uni-paderborn.de/pub/aminet/misc/emu/ElectronicGame.lha</A>
</P><P>
<hr width="50%">
</P><P>
Ein Tool mit dem Namen &quot;<B>Electrostatic</B>&quot; erledigt die Konvertierung von
Atari 2600-Spiele zu Amiga-Files, die dann direkt vom Amiga aus spielbar
sein sollen.
</P><P>
<A HREF="http://ftp.uni-paderborn.de/pub/aminet/misc/emu/Electrostatic.lha">http://ftp.uni-paderborn.de/pub/aminet/misc/emu/Electrostatic.lha</A>
</P><P>
<hr width="50%">
</P><P>
Auch der beliebte Gameboy-Emulator &quot;<B>Wzonka-Lad</B>&quot; erhielt mal wieder ein
Update. Er liegt jetzt in der Version v1.01.00e vor.
</P><P>
<A HREF="http://ftp.uni-paderborn.de/pub/aminet/misc/emu/wzonka-lad.lha">http://ftp.uni-paderborn.de/pub/aminet/misc/emu/wzonka-lad.lha</A>
</P><P>
<HR>

<p align=center>
Ansprungpunkte: <A HREF="#start">Einf&uuml;hrung</A> / <A HREF="liste.htm">Emulatoren-Liste</A>
</p>

<HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../pd/9912box.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../pd/9912nes.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
