<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - NewsCoaster</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

</P><DIV ALIGN=CENTER><H1>NewsCoaster</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV><P>
<P>
<B>Vorwort</B>
</P><P>
Bevor ich zu der Vorstellung des Newsreader-Programmes &quot;NewsCoaster&quot;
komme, gehe ich f&uuml;r alle, die mit dem Begriff nichts anfangen k&ouml;nnen,
erst einmal auf 'Newsgruppen' ein.
</P><P>
Das Internet bietet nicht nur die allseits bekannten M&ouml;glichkeiten des
Websurfens und des E-Mailens, sondern auch einen weiteren interessanten
Dienst: 'Newsgruppen' (Newsgroups).
</P><P>
Hier wird in tausenden verschiedener Nachrichtengruppen, wie auf einem
&ouml;ffentlichem schwarzen Brett, &uuml;ber die vielschichtigsten Themen
diskutiert. User aus aller Welt k&ouml;nnen sich zu Themen, wie Computern
(nat&uuml;rlich ;) , aber auch allt&auml;glichen Dingen, wie Sport, Menschen und
Beziehungen, Haustieren usw., auslassen.
</P><P>
Solche Newsgruppen lassen sich auch mit Web-Browsern oder Zusatztools
f&uuml;r E-Mail-Programme lesen. Effizienter hierf&uuml;r sind dennoch speziell
darauf ausgerichtete Newsreader.
</P><P>
<B>Anleitung</B>
</P><P>
Vor dem ersten Programmstart sollte diese unbedingt gelesen werden. Neben
der Beschreibungen zu dem Programm werden hier viele wissenswerte
Informationen rund um die Nachrichtengruppen beschrieben.
</P><P>
Bei dem Einstieg in die Newsgroup-Welt sollten Sie unbedingt vorher die
&uuml;berall geltenden Regeln beachten, ansonsten kann es vorkommen, da&szlig; Sie
dort ein nicht gern gesehener Gast werden.
</P><P>
Leider liegt die Amiga-Guide-Anleitung, wie auch das Programm selbst,
komplett in Englisch vor. Gegenfalls sollten Sie ein Englisch-Deutsch-
W&ouml;rterbuch parat liegen haben.
</P><P>
An dieser Stelle ein Kompliment f&uuml;r eine perfekte Anleitung, die wirklich
keinerlei Fragen zum Programm und den Nachrichtengruppen offenl&auml;&szlig;t.
</P><P>
<B>Systemvoraussetzungen</B>
</P><P>
NewsCoaster setzt voraus:
</P><ul>
<li>mindestens einen 68020-Prozessor mit 4 MB freiem RAM</li>
<li>OS 3.0 oder 3.1</li>
<li>MUI</li>
<li>eine Festplatte</li>
<li>einen TCP/IP-Stack, wie z.B. &quot;Miami&quot; oder &quot;Genesis&quot;</li>
</ul><P>
Die Installation wird durch das beigef&uuml;gte Installerskript erledigt,
bereits vorhandene Versionen werden erkannt und geupdatet.
</P><P>
NewsCoaster ist Shareware, das Keyfile f&uuml;r die Vollversion kostet
31,- DM. In der frei erh&auml;ltlichen Demoversion k&ouml;nnen nur maximal zwei
Newsgruppen abonniert werden und au&szlig;erdem erscheinen ab und an einige
Nervrequester, die daran erinnern sollen, das Programm registrieren zu
lassen.
</P><P>
<B>Das Programm</B>
</P><P>
Nach dem Programmstart erscheint ein rundherum gelungenes MUI-
Programmfenster, das alle Funktionen direkt anbietet. Alternativ steht
per rechtem Mausclick ein Men&uuml; zur Verf&uuml;gung.
</P><P>
Bevor Sie das Programm nutzen k&ouml;nnen, steht erst einmal das Wichtigste
bevor:
</P><P>
<B>Die Konfiguration</B>
</P><P>
Am wichtigsten ist hier der Eintrag der NNTP-Adresse Ihres Servers,
ohne die Sie keinen Zutritt zu den Newsgruppen erhalten.
</P><P>
Nutzer von T-Online m&uuml;ssen 'news.btx.dtag.de' eingeben.
</P><P>
Des weiteren sollten Sie hier Ihre E-Mail-Adresse und deren Serveradresse
angeben, damit Sie selbst in der Lage sind, Nachrichten in die jeweilige
News-Gruppe zu senden.
</P><P>
S&auml;mtliche Einstellungen, die sie vornehmen, k&ouml;nnen Sie nicht selbst
sichern. Das erledigt das Programm f&uuml;r Sie selbst&auml;ndig nach Beendigung.
Hier sollte die M&ouml;glichkeit bestehen, die ver&auml;nderten Preferences
selbst zu sichern, denn wenn es wieder Erwarten zu einen Programmabsturz
kommt, w&auml;re die aktuelle Konfiguration verloren.
</P><P>
Im Laufe ausf&uuml;hrlicher Sitzungen erwies sich &quot;NewsCoaster&quot; allerdings
als sehr stabil, so da&szlig; man keine besonderen Bef&uuml;rchtungen haben mu&szlig;.
</P><P>
Nach dieser ersten Installation sollten Sie online gehen und den Befehl
&quot;Fetch Group List&quot; aktivieren. Damit wird die Liste aller verf&uuml;gbaren
Nachrichtengruppen geladen. Achtung: dies dauert ein Weilchen - bei
T-Online sind zur Zeit ca. 11.000 verschiedene Newsgruppen im Angebot!
</P><P>
Danach sortiert NewsCoaster die Liste alphabetisch und zeigt sie in einem
Fenster an. Damit die Suche nach einen bestimmten Thema einfacher wird,
steht gl&uuml;cklicherweise eine Suchfunktion zur Verf&uuml;gung, die Ihnen z.B.
bei der Eingabe des Wortes &quot;Amiga&quot; alle Gruppen aufzeigt, die sich mit
diesem Thema befassen.
</P><P>
Per Doppelclick auf die angezeigte Gruppe kann man diese 'abonnieren'.
Hier folgt Teil Zwei der Konfiguration, bei der Sie unter anderem w&auml;hlen
k&ouml;nnen, wieviele Nachrichten Sie per Online-Verbindung laden wollen.
</P><P>
Mit der Aussage &quot;unlimited Messages&quot; sollten Sie sehr vorsichtig sein,
denn es gibt Gruppen, die mehrere tausend Eintr&auml;ge beinhalten, die dann
auch alle geladen werden.
</P><P>
Sobald Sie Ihre Entscheidungen getroffen haben, k&ouml;nnen Sie nun die
Nachrichten laden. Hier bleibt bemerkenswerterweise festzustellen, da&szlig;
das Laden der Nachrichten &auml;u&szlig;erst schnell vonstatten geht - kein anderer
mir bekannter Newsreader bietet zur Zeit so ein Tempo!
</P><P>
Danach sollten Sie dann die Online-Verbindung beenden, denn alle
Nachrichten lassen sich selbstverst&auml;ndlich offline lesen.
</P><P>
Im Programmfenster erscheinen links alle abonnierten Nachrichtengruppen
sowie die Verzeichnisse &quot;Outgoing&quot;, &quot;Send&quot; und &quot;Deleted&quot;, die auch aus
&uuml;blichen E-Mail-Clients bekannt sein sollten.
</P><P>
&quot;NewsCoaster&quot; arbeitet an diesem Punkt tats&auml;chlich wie ein E-Mail-Programm.
Wer mit diesen den Umgang gewohnt ist, findet sich auch hier zurecht.
Vom Beantworten und Editieren bis zum L&ouml;schen und Verschieben (in interne
oder externe Verzeichnisse) wurde keine Funktion zum Bearbeiten der
Nachrichten ausgelassen.
</P><P>
Dennoch sollte ein wichtiger Punkt nicht unterschlagen werden:
</P><P>
<B>Das Kill-File</B>
</P><P>
Der dramatisch klingende Befehl, dient der Filterung von Nachrichten
mit speziellen Betreffs oder von bestimmten Usern, die dann beim
n&auml;chsten Online-Gehen nicht mitgeladen werden.
</P><P>
<B>Ups</B>
</P><P>
Ein kleiner Fehler von NewsCoaster fiel mir w&auml;hrend des Testens auf:
L&ouml;scht man Nachrichten aus einem Fach, so wird das entsprechende
Verzeichnisfenster danach auch leer angezeigt. Als ich dann den Punkt
&quot;Index erneuern&quot; anw&auml;hlte, wurden jedoch alle gel&ouml;schten Nachrichten
wieder angezeigt.
</P><P>
Hier bleibt nur die M&ouml;glichkeit, diese Nachrichten extern, via Shell
oder mittels eines Dateimanagers, selbst zu l&ouml;schen.
</P><P>
Eine Nachfrage beim Autor ergab, da&szlig; dieses Problem bekannt ist und nur
bei einigen wenigen Systemen (meines ist eins davon ;) auftritt. An der
Fehlerbeseitung arbeitet der Autor Mark Harmann bereits und sie k&ouml;nnte
zum jetzigen Zeitpunkt, wo Sie diesen Test lesen, bereits erledigt sein.
</P><P>
Dennoch l&auml;&szlig;t sich dieses kleine Manko - so es auftritt - verschmerzen
und schm&auml;lert der sehr positiven Gesamteindruck nur unwesentlich.
</P><P>
<B>Fazit</B>
</P><P>
Im Vergleich zu anderen Newsreadern hat sich &quot;NewsCoaster&quot; als
besonders empfehlenswert erwiesen. Die mannigfaltigen
Konfigurationsm&ouml;glichkeiten bestechen, neben dem &auml;u&szlig;erst schnellen
Ladetempo der Nachrichten und der Stabilit&auml;t des Programms.
</P><P>
Hier lohnt sich die Registrierung, zumal Mark Harman stetig an einer
weiteren Optimierung des Programmes arbeitet.
</P><P>

<p align=center><IMG SRC="../images/tip.gif" width=90 heigth=91></p>


<TABLE cellpadding=2 BORDER=0>
<TR>
	<td><b>Programm:</b></td>
    <TD><B>NewsCoaster</B> 1.16</TD>
</TR>
<TR>
	<td><b>Status:</b></td>
    <TD>Shareware, Preis der Vollversion: 31,- DM</TD>
</TR>
<TR>
	<td><b>Autor:</b></td>
    <TD><A HREF="mailto:mdwh2@hermes.cam.ac.uk">Mark Harmann</A></TD>
</TR>
</TABLE> 

<P>
Bezugsquelle: <A HREF="http://members.tripod.com/newscoaster">http://members.tripod.com/newscoaster</A>
</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../pd/9912htm.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../pd/9912web.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
