<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - HTMless</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>HTMLess</H1>von<BR><A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>

</P><P>
<B>Vorwort</B>
</P><P>
Schaut man sich Dokumente im HTML-Format mit einem Web-Browser an, so
sieht man lediglich den Text. Der Quelltext der die Form der Ausgabe
verursacht, ist wesentlich umfangreicher, da hier s&auml;mtliche Befehle
zum Aufbau des Dokuments integriert sind.
</P><P>
Irgendwann kommt man in die Verlegenheit, einen HTML-Text in das ASCII-
Format zu konvertieren. Selbstverst&auml;ndlich kann man dies per Hand
erledigen, bei gr&ouml;&szlig;eren Texten wird dies aber schnell zu einer Qual.
Und genau dann w&uuml;nscht man sich ein Tool, welches das Entfernen der
HTML-Tags vollkommen automatisch erledigt.
</P><P>
Zwar bieten auch Web-Browser, wie z.B. IBrowse diese M&ouml;glichkeit an,
allerdings war dies f&uuml;r mich nie so recht zufriedenstellend, gerade
auch wenn es darum ging, mehrere Texte zu bearbeiten. Der Aufwand
hierf&uuml;r (HTML-Dokument laden und als ASCII-Text wieder speichern)
ist doch ein wenig zu gro&szlig;.
</P><P>
Auf der Suche nach einem effektiveren Tool hierf&uuml;r, stie&szlig; ich auf
&quot;HTMLess&quot;, das, neben dem reinen Entfernen der HTML-Tags, auch noch
weitere n&uuml;tzliche Zusatzfunktionen aufbieten kann.
</P><P>
<B>Zu Befehl!</B>
</P><P>
HTMLess ist kein Programm mit herk&ouml;mmlicher Benutzeroberfl&auml;che, sondern
eher funktioniert eher wie ein Befehl, der mit &auml;u&szlig;erst vielen Optionen
belegt ist. Aus diesem Grund ist es zwingend erforderlich, sich die
ausf&uuml;hrliche Anleitung (ASCII-Format) durchzulesen, die allerdings
ausschlie&szlig;lich in Englisch gehalten ist.
</P><P>
<B>Was kann HTMLess?</B>
</P><P>
HTMLess l&auml;&szlig;t sich &uuml;ber die Shell, Workbench oder per Dateimanager (z.B.
DirectoryOpus) starten. Letzteres ist empfehlenswert, da dies die
Handhabung sehr vereinfacht.
</P><P>
Die <B>Anleitung</B> erkl&auml;rt alle drei Nutzungsm&ouml;glichkeiten sehr ausf&uuml;hrlich,
selbst f&uuml;r den &quot;Einbau&quot; in DirectoryOpus wird eine genaue Beschreibung
geliefert.
</P><P>
F&uuml;r die Nutzung &uuml;ber die Shell und DOpus ist es von Vorteil, &quot;HTMLess&quot;
im Befehlverzeichnis &quot;C&quot; zu plazieren. Wer mit der Workbench arbeiten
m&ouml;chte, dem bietet &quot;HTMLess&quot; die M&ouml;glichkeit, das Icon mit Tooltypes
zu versehen und es sich seinen eigenen Bed&uuml;rfnissen anzupassen.
</P><P>
Bei dieser Methode wird nach dem Klicken auf das Icon ein
Dateiauswahlfenster ge&ouml;ffnet, welches das gew&uuml;nschte HTML-Dokument
fordert. Danach &ouml;ffnet sich ein neues Fenster, in dem der Pfad f&uuml;r
das ASCII-Textdokument anzugeben ist.
</P><P>
Durch die <B>Konfiguration</B> von &quot;HTMLess&quot; stehen neben dem einfachen
Konvertieren auch weitere n&uuml;tzliche Dinge zur Verf&uuml;gung. HTMLess
kann von vornherein die Zeilenl&auml;nge des zu erzeugenden Dokuments nach
Ihren W&uuml;nschen formatieren, dies erspart Ihnen die zeitaufwendigen
Zeilenumbr&uuml;che.
</P><P>
Beliebig viele HTML-Dateien k&ouml;nnen mit einen Aufruf umgewandelt und, wie
schon erw&auml;hnt, seperat gesichert werden oder auch die orginalen HTML-
Dokumente direkt &uuml;berschreiben. Weiterhin kann man auch steuern, ob die
META-Informationen des HTML-Dokumentes und die eventuelle vorhandenen
Verweise (Links) auf andere Seiten mit ausgegeben werden.
</P><P>
Da &quot;HTMLess&quot; nach dem &quot;WYSIWYG&quot;-Prinzip arbeitet (&quot;WYSIWYG&quot; = What you
see is what you get), erscheint der ausgegebene Text im Aufbau wie das
Orginal. Dies macht sich besonders bei Tabellen bemerkbar, denn sie
erscheinen nach der Konvertierung immer noch als Tabellen! Einige
andere Tools dieser Art bieten dies nicht an. &quot;HTMLess&quot; ist komplett
in Assembler programmiert, daher ist es sehr schnell.
</P><P>
Bevor ich zum Fazit komme, m&ouml;chte ich noch zwei Punkte zu &quot;HTMLess&quot;
ansprechen:
</P><P>
Dieser positive Test bezieht sich ausschlie&szlig;lich auf die Version 3.0,
&auml;ltere 2.x-Versionen kommen an die jetzige nicht heran und sind auch
etwas fehlerbehaftet.
</P><P>
Der zweite Punkt ist, da&szlig; &quot;HTMLess&quot; <B>Orginalware</B> ist. Ich kannte ja schon
viele Registrierungsvarianten, diese war mir bis jetzt aber noch unbekannt.
Unter &quot;Orginalware&quot; versteht der Autor, da&szlig; man Ihm f&uuml;r eine Registrierung
einen Orginal-Gegenstand zusendet. Dabei ist es gleich, ob es sich um Soft-
Hardware, Geld oder Zeitschriften handelt, Hauptsache es ist ein Orginal
und keine Kopie.
</P><P>
<B>Fazit</B>
</P><P>
HTMLess ist ein hervorragendes Tool, das jeder Amiga-User sein eigen
nennen sollte, zumindest, wenn er sich mit Konvertierung von HTML-
Dokumenten besch&auml;ftigt.
</P><P>
Insbesondere das &quot;WYSIWYG&quot;-Konzept ist lobenswert, und die vielen
Sonderfunktionen lassen das Konvertieren auch &uuml;ber die &uuml;blichen W&uuml;nsche
hinaus zu und ersparen dem Nutzer so viel Arbeit in der Nachbearbeitung
der umgewandelten ASCII-Texte.
</P>

<TABLE cellpadding=2 BORDER=0>
<TR>
	<td><b>Programm:</b></td>
    <TD><B>HTMLess</B> 3.0</TD>
</TR>
<TR>
	<td><b>Status:</b></td>
    <TD>Orginalware!</TD>
</TR>
<TR>
	<td><b>Autor:</b></td>
    <TD><A HREF="mailto:manuel@webmedia.es">M. Martin Vivaldi</A></TD>
</TR>
</TABLE> 

<P>
Bezugsquelle: <A HREF="http://ftp.uni-paderborn.de/pub/aminet/text/hyper/HTMLess.lha">http://ftp.uni-paderborn.de/pub/aminet/text/hyper/HTMLess.lha</A>
</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../pd/9912nes.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../pd/9912new.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
