<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - LDDCheck</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>LDDCheck</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>
<P>
<B>Vorwort</B>
</P><P>
Wer von Ihnen kennt nicht diese Situation: Sie installieren eine neue
Software  und nach dem Start erscheint nicht etwa das Programm, sondern
eine kleine Meldung mit dem Vermerk &quot;Sie ben&ouml;tigen die XYZ.library
Version 42.23&quot;. Sie schauen in Ihr Library-Verzeichnis und stellen fest,
da&szlig; Sie &quot;nur&quot; die Version 42.22 besitzen.
</P><P>
Um solche Situationen zu vermeiden und Ihre Systemdateien stets aktuell
zu halten, nutzen Sie LDDCheck. Die mir vorliegende Version ist die
vierte Ver&ouml;ffentlichung (29.08.99) und ist eine Gemeinschaftsproduktion
von Michaela Pr&uuml;&szlig; und Heiko Schr&ouml;der, die Ihre Programme &quot;VersCheck&quot; und
die Datensammlungen &quot;LibGuide&quot;, &quot;DTypesGuide&quot; und &quot;DevsGuide&quot; kombiniert
haben.
</P><P>
Damit &quot;LDDCheck&quot; selbst aktuell bleibt, erscheint monatlich eine neue
Version mit den aktuellen Systemdateien. Das Archiv enth&auml;lt das Programm
&quot;VersCheck&quot;, Skripte f&uuml;r das Auswerten der Librarys, Datatypes und
Devices, sowie ausf&uuml;hrliche deutsch- und englischsprachige Anleitungen.
</P><P>
Eine Installationsskript wurde nicht mitgeliefert, da ein Kopieren des
Verzeichnisses auf die Festplatte vollkommen ausreicht.
</P><P>
<B>Versionscheck</B>
</P><P>
Alle &Uuml;berpr&uuml;fungen basieren auf dem Programm &quot;VersCheck&quot;. Wie der Name
schon andeutet, gibt es die Versionsnummern aus und vergleicht sie mit
den ihm bekannten Versionen, die in den entsprechenden Guides vorhanden
sind.
</P><P>
Die Funktionen von &quot;VersCheck&quot; sind sehr vielf&auml;ltig und zu ihrer
vollst&auml;ndigen Nutzung, sollte man unbedingt vorher die Anleitung
lesen. F&uuml;r den Schnelleinstieg und den sofortigen Versionsvergleich
der eingangs erw&auml;hnten Libraries, Datatypes und Devices, liegen
Skripte vor, die per Icon-Klick aktiviert werden k&ouml;nnen.
</P><P>
Diese Skripte erzeugen nicht nur einfache Vergleichslisten, sie k&ouml;nnen
wesentlich mehr. Nach der Aktivierung erscheint ein Ausgabefenster, in
dem alle Aktivit&auml;ten angezeigt werden. Je nach Umfang der Dateien nimmt
dies mehr oder weniger Zeit in Anspruch, generell ist die Geschwindigkeit
aber hoch.
</P><P>
Hiernach werden folgende drei Dateien im RAM gesichert:
</P><P>
- AllXXX: Hier werden alle Informationen &uuml;ber die gescannten Systemfiles
          ausgewiesen.
</P><P>
- NewXXX: Die Libraries werden ausgewiesen, die den Programmautoren noch
          nicht bekannt sind.
</P><P>
          Man sollte sich kurz die Zeit nehmen, den Autoren unter der
          E-Mail-Adresse <a href="mailto:age@thepentagon.com">age@thepentagon.com</a> diese Libraries
          mitzuteilen, denn das Projekt lebt auch von der Beteiligung
          der Amiga-User.
</P><P>
- OldXXX: Es werden alle Files angezeigt, die auf Ihrem System nicht
          mehr aktuell sind.
</P><P>
Hierzu wird wirklich ein Superservice angeboten, der f&uuml;r alle sehr
ansprechend ist, die &uuml;ber einen Internet-Zugang verf&uuml;gen. Nach Abschlu&szlig;
der Scan-Aktivit&auml;ten fragt das Programm nach, ob Sie die Erstellung
einer HTML-Seite w&uuml;nschen.
</P><P>
Bejahen Sie dies und gehen anschlie&szlig;end mit dieser Seite online, so wird
zun&auml;chst die Homepage der Autoren geladen und dort die Frage nach dem f&uuml;r
Sie g&uuml;nstigsten Aminet-Server gestellt. Wenn Sie einen ausgew&auml;hlt haben,
wird anhand Ihrer veralteten Files eine Liste erstellt, die den direkten
Aminet-Download der aktuellen Versionen m&ouml;glich macht und auch die
Aminet-CDs anzeigt, die die Dateien enthalten.
</P><P>
An dieser Stelle ein ganz gro&szlig;es Lob an die Autorin und den Autor f&uuml;r
dieses hervorragende Angebot! Positive Erw&auml;hnung verdient auch die
Erstellung von Warnlisten, die z.B. Files mit Viren oder 'Fakes'
(F&auml;lschungen) auflisten.
</P><P>
<B>Immer updaten?</B>
</P><P>
Selbstverst&auml;ndlich ist es sch&ouml;n, seine Systemdaten immer auf dem
neuesten Stand zu halten. Dennoch an dieser Stelle ein Hinweis von
mir:
</P><P>
Wenn Sie Updates durchf&uuml;hren, &uuml;berpr&uuml;fen Sie bitte, ob sich die neue
Version schon etabliert hat. Das erkennen Sie z.B. daran, in wievielen
Programmen die neue Version schon genutzt wird. Weiterhin sollten Sie
immer eine Sicherheitskopie der Orginale, insbesondere der orginalen
Amiga-Files, bereithalten oder diese beispielsweise in 'XYZ.library-ORG'
umbenennen.
</P><P>
Denn: alles was neu ist, mu&szlig; nicht unbedingt besser sein. Aus meiner
eigenen Erfahrung als Betatester f&uuml;r &quot;Gunbee F-99&quot; wei&szlig; ich zum Beispiel,
da&szlig; dieses Spiel ausschlie&szlig;lich mit der Orginal-Amiga-'Mathtrans.library'
l&auml;uft. Alle sp&auml;teren (und nicht offiziellen) Libraries, die sicherlich
bei einigen Programmen f&uuml;r schnellere Geschwindigkeit sorgen und
problemlos laufen, bringen &quot;Gunbee F99&quot; zum Absturz.
</P><P>
<B>Fazit</B>
</P><P>
Nochmals ein Kompliment f&uuml;r dieses wirklich rundherum gelungene
Versionsvergleichstool. Man kann die Installation und Nutzung von LDDCheck
jedem Amiga-User nur nahelegen, damit Sie Ihr eigenes System einfach und
bequem aktuell halten.
</P><P>
Sollten Sie LDDCheck nutzen und Files finden, die den beiden Autoren nicht
bekannt sind, melden Sie diese bitte, denn damit tragen auch Sie einen Teil
dazu bei, da&szlig; dieses &auml;u&szlig;erst n&uuml;tzliche Tool stetig weiterentwickelt wird
und auch alle anderen User ein aktuelles System haben.
</P>

<TABLE cellpadding=2 BORDER=0>
<TR>
	<td><b>Programm:</b></td>
    <TD><B>LDDCheck</B></TD>
</TR>
<TR>
	<td><b>Status:</b></rd>
    <TD>Freeware</TD>
</TR>
<TR>
	<td><b>Autoren:</b></td>
    <TD><A HREF="mailto:Gateway5@gmx.net">Michaela Pr&uuml;&szlig;</A></TD>
    <TD><A HREF="mailto:age@thepentagon.com">Heiko Schr&ouml;der</A></TD>
</TR>
</TABLE> 

<P>
Bezugsquelle: <A HREF="http://ftp.uni-paderborn.de/pub/aminet/docs/lists/LDDcheck.lha">http://ftp.uni-paderborn.de/pub/aminet/docs/lists/LDDcheck.lha</A>
</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../pd/9912web.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../pd/9912zahl.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
