<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - WebColour</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

</P><DIV ALIGN=CENTER><H1>WebColour</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV><P><P>

<B>Farbe</B>
</P><P>
Wer selbst Dokumente im HTML-Format erstellt, hat mannigfaltige
M&ouml;glichkeiten, Texte grafisch herauszustellen oder farblich zu
kennzeichnen.
</P><P>
Gerade wenn einzelne Buchstaben, W&ouml;rter oder Textpassagen farblich
hervorgehoben werden sollen, steigt der Aufwand der hierf&uuml;r notwendigen
HTML-Befehle.
</P><P>
Jetzt gibt es ein kleines, aber feines Tool, dessen Idee aus der PC-
Welt entnommen wurde und das die farblichen Zuweisungen selbst&auml;ndig
generiert. Der Name des Programms ist &quot;WebColour&quot;.
</P><P>
<B>Voraussetzungen/Installation</B>
</P><P>
Zur Inbetriebnahme ben&ouml;tigt man lediglich einen Amiga mit installiertem
MUI-System.
</P><P>
Ein Installationsskript ist nicht vorhanden, da das Programm-Verzeichnis
einfach an eine beliebige Stelle kopiert werden kann.
</P><P>
<B>Anleitung</B>
</P><P>
Dier Amiga-Guide ist sehr knapp ausgefallen und englischsprachig. Zur
Anwendung von &quot;WebColour&quot; ben&ouml;tigt man ihn aber ohnehin nicht, da das
Programm selbsterkl&auml;rend ist.
</P><P>
<B>Arbeiten mit WebColour</B>
</P><P>
Nach dem Programmstart erscheint eine MUI-Oberfl&auml;che, in der man oben
den gew&uuml;nschten Text editieren kann. Eine Begrenzung der Anzahl an
Buchstaben oder W&ouml;rtern ist nicht vorgesehen, allerdings sollte man mit
der Textl&auml;nge nicht &uuml;bertreiben, denn dadurch wird sp&auml;ter das HTML-
Dokument durch die generierten HTML-Befehle dementsprechend gr&ouml;&szlig;er und
gegebenenfalls un&uuml;bersichtlich.
</P><P>
Im mittleren Teil der Programmoberfl&auml;che sind jeweils zwei mal drei Slider
(Schieberegler) in den Grundfarben Rot, Gr&uuml;n und Blau enthalten, die f&uuml;r
die Farbzuweisungen des ersten und letzten Buchstabens zust&auml;ndig sind.
Hier gilt es ein wenig herumzuexperimentieren, um einen wirklich sch&ouml;nen
Farbeffekt der Buchstaben zu erhalten.
</P><P>
Nachdem alles eingestellt wurde, dr&uuml;ckt man nun den Button &quot;Go!&quot; und der
kreierte HTML-Tag wird nun in einem Shell-Fenster ausgegeben. Um den Text
in das gew&uuml;nschte Dokument zu kopieren, markiert man die Textausgabe mit
der Maus und sichert diese mit den Tasten 'Rechte Amiga' &amp; 'c' in das
Clipboard. Um das Ergebnis in das Zieldokument einzuf&uuml;gen, ist dann
'Rechte Amiga' &amp; 'v' zu dr&uuml;cken.
</P><P>
Diese Methode ist das einzige Manko an WebColour. Hier h&auml;tte ich mir
eine Speicherm&ouml;glichkeit in eine Datei gew&uuml;nscht.
</P><P>
Jetzt folgt ein Musterbeispiel des Wortes &quot;Amiga&quot;, wobei der Farbverlauf
von rot nach blau wechselt, welches einen netten Effekt bietet:
</P><PRE>
&lt;FONT COLOR=#FF0000&gt;A&lt;/FONT&gt;&lt;FONT COLOR=#C0003F&gt;M&lt;/FONT&gt;
&lt;FONT COLOR=#80007F&gt;I&lt;/FONT&gt;&lt;FONT COLOR=#4000BF&gt;G&lt;/FONT&gt;
&lt;FONT COLOR=#0000FF&gt;A&lt;/FONT&gt;
</PRE>

<p>Ergibt:<br><font size=5><center> 
<FONT COLOR=#FF0000>A</FONT><FONT COLOR=#C0003F>M</FONT><FONT COLOR=#80007F>I</FONT>
<FONT COLOR=#4000BF>G</FONT><FONT COLOR=#0000FF>A</FONT></center></font></p>

<P>
<B>Fazit</B>
</P><P>
Dieses kleine Tool ist f&uuml;r alle, die die Textdarstellung Ihrer
Webseiten ein wenig aufpeppen m&ouml;chten, empfehlenswert, zumal es
Freeware ist. Sicherlich mu&szlig; man zur optimalen Farbgebung etwas
herumexperimentieren, aber auch die unifarbene Darstellung von
einzelnen Buchstaben oder W&ouml;rtern wird schnell und bequem erstellt.
</P>

<TABLE cellpadding=2 BORDER=0>
<TR>
	<td><b>Programm:</b></td>
    <TD><B>WebColour</B> 1.0</TD>
</TR>
<TR>
	<td><b>Status:</b></td>
    <TD>Freeware</TD>
</TR>
<TR>
	<td><b>Autor:</b></td>
    <TD><A HREF="mailto:mdwh2@hermes.cam.ac.uk">Mark Harmann</A></TD>
</TR>
</TABLE> 

<P>
Bezugsquelle: <A HREF="http://members.tripod.com/~Mark_Harman">http://members.tripod.com/~Mark_Harman</A>
</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../pd/9912new.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../pd/9912ldd.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
