<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - PD-Test-Box</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>PD-Test-Box</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>

<center><p>
<A NAME="start">Ansprungpunkte:</A> <A HREF="#allg">Allgemeines zur Rubrik</A> / <A HREF="#kurz">Kurztests</A>
</p></center> 
<hr>
</P><P>
Vielen Dank, da&szlig; Sie in die mittlerweile schon dritte Ausgabe der PD-
Test-Box hineinschauen! :-)
</P><P>
Meine Bef&uuml;rchtungen, da&szlig; aufgrund des tollen Wetters ein Sommerloch in
der PD-Szene entstehen w&uuml;rde, haben sich gl&uuml;cklicherweise nicht
bewahrheitet.
</P><P>
Zwar sank die Anzahl der Uploads in das Aminet um ca. ein Drittel, daf&uuml;r
wurde aber qualitativ sehr hochwertige Software programmiert. Frei nach
dem Motto: &quot;Mehr Klasse statt Masse&quot;.
</P><P>
Auff&auml;llig ist in der letzten Zeit gewesen, da&szlig; kaum noch PD-Spiele f&uuml;r
den Amiga erstellt werden. Der Grund hierf&uuml;r sind mangelnde neue (und
revolution&auml;re) Spielideen - den 6536. Tetris-Klon wird wohl auch niemand
mehr programmieren wollen.
</P><P>
Anstelle der Spiele haben, der heutigen Zeit angepa&szlig;t, daf&uuml;r
Onlineprogramme und Tools Hochkonjunktur, hier gab es in letzter Zeit
sehr interessante und n&uuml;tzliche Neuerscheinungen.
</P>

<hr width="25%">

<P>
Ein paar davon stelle ich Ihnen nun vor:
</P>

<ul><li>

<A HREF="../pd/9912htm.htm">HTMLess</A>: Dieses Tool konvertiert HTML-Dateien in ASCII-Texte.
</li>
<li>
<A HREF="../pd/9912new.htm">NewsCoaster</A>: Ein neuer Newsreader f&uuml;r den Amiga und ein hei&szlig;er Anw&auml;rter
              f&uuml;r den &quot;Tip der Redaktion&quot;! Hat es f&uuml;r NewsCoaster
              gereicht?
</li>
<li>
<A HREF="../pd/9912web.htm">WebColour</A>: Bringen Sie einfach und schnell Farbe in Ihre HTML-Texte!
</li><li>
<A HREF="../pd/9912ldd.htm">LDDCheck</A>: Sind Ihre System-Librarys, Datatypes und Devices noch
              aktuell? Falls nicht, bietet Ihnen LDDCheck vielleicht
              eine bequeme Methode des Updatens an. Mehr im Test.
</li><li>
<A HREF="../pd/9912zahl.htm">ZahlzuWort</A>: Haben Sie vielleicht auch das Problem die Zahl
              32.144.564.434,34 auszusprechen? Dann hilft &quot;ZahlzuWort&quot;.
</li><li>
<A HREF="../pd/9912love.htm">LoveCalc</A>: F&uuml;r alle, die immer noch Ihren Traumpartner suchen.
</li></ul>

<P>
Ich hoffe, da&szlig; f&uuml;r jeden unter Ihnen etwas interessantes dabei ist und
w&uuml;rde mich sehr freuen, wenn Sie auch in der n&auml;chsten PD-Test-Box
wieder dabei sind.
</P><P>
<B>Peter Fischer</B>,<br>
       PD-Redakteur.
</P><P>
<HR>
</P><P>
<a name="kurz"><a name="allg"> <B>Allgemeines zur PD-Rubrik:</B>
</P><P>
Sie enth&auml;lt <B>zwei st&auml;ndige Eintr&auml;ge</B>, einige <B>PD-Tests</B> ohne abschlie&szlig;ende
AmZeiger-Bewertung und <B>Kurztests</B>. Als besonders gut beurteilte Produkte
werden mit einem &quot;Tip der Redaktion&quot; ausgezeichnet!
</P><P>
Gro&szlig;e Software-Pakete, die in Umfang und Zielsetzung auf dem Amiga direkt
in professionelle Gefilde vorsto&szlig;en, werden im Software-Bereich einem
Volltest unterzogen, der mit einem Bewertungskasten schlie&szlig;t.
</P><P>
Der st&auml;ndige Eintrag &quot;<A HREF="../pd/9912box.htm">PD-Test-Box</A>&quot; enth&auml;lt, neben Informationen des
Redakteurs zur Rubrik, auch die Verweise auf Kurztests. Die &quot;<A HREF="../pd/9912Emu.htm">PD-Emu-Box</A>&quot;,
widmet sich ganz den zahlreichen Emulatoren auf dem Amiga.
</P><P>
Weiterf&uuml;hrende Nachrichten finden sie in der &quot;<A HREF="../amz1299/pdnews.htm">PD-News-Box</A>&quot; (Aktuell-
Rubrik).
</P><P>

</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../sw/9912frog.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../pd/9912emu.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
