<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Toimitukselliset</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<table width="100%">
							<tr>
								<td width="300">SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY.</td>
								<td>KOKOUSMUISTIO</td>
							</tr>
							<tr>
								<td width="300">HALLITUS 1999-2000</td>
								<td></td>
							</tr>
							<tr>
								<td width="300"></td>
								<td>9.7.2000</td>
							</tr>
						</table>
						<br>
						HALLITUKSEN KOKOUS 2/2000<br>
						<br>
						<table width="100%">
							<tr>
								<td valign="top" width="100">AIKA</td>
								<td>3. huhtikuuta - 9. hein&auml;kuuta</td>
							</tr>
							<tr>
								<td valign="top" width="100">PAIKKA</td>
								<td>Internet-postituslista</td>
							</tr>
							<tr>
								<td valign="top" width="100">L&Auml;SN&Auml;</td>
								<td>Terho Henriksson<br>
									Tomi Jaskari<br>
									Timo Kemppaala<br>
									Oliver Kruusi<br>
									Valtteri Murto<br>
									Jarmo Piippo<br>
									Janne Pikkarainen<br>
									Anu Seilonen<br>
									Tapani Tanskanen<br>
									Paula-Christiina Wirtanen</td>
							</tr>
						</table>
						<br>
						<b>1</b><br>
						<b>T&auml;st&auml; kokousmuistiosta</b>
						<p>T&auml;h&auml;n muistioon on ker&auml;tty Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n hallituksen Internetiss&auml; postituslistallaan ja IRC-kokouksissaan 3.4.-9.7.2000 k&auml;ym&auml;n keskustelun p&auml;&auml;kohtia. Otteet ovat eritt&auml;in tiiviit&auml; lyhennelmi&auml;, eik&auml; muistion ole edes tarkoitus sis&auml;lt&auml;&auml; selvityst&auml; kaikista k&auml;sitellyist&auml; aiheista, vaan tuoda esille yhdistystoiminnan kannalta merkitt&auml;v&auml;t seikat.</p>
						<p>Hallituksen postituslista tavoittaa kaikki hallituksen j&auml;senet, mutta kaikki eiv&auml;t v&auml;ltt&auml;m&auml;tt&auml; ole ottaneet osaa kaikkiin aiheisiin.</p>
						<p><b>2</b><br>
						<b>K&auml;siteltyj&auml; aiheita</b>
						<p>Yhdistyksen taloudenhoitoj&auml;rjestelm&auml; uudistetaan aiemmin suunniteltua perusteellisemmin, jotta kirjanpito ja tilinp&auml;&auml;t&ouml;sten rakenne saadaan yhten&auml;istetty&auml; yhdistyksen koko historian ajalta ja kaikkien tilikausien osalta. Tavoitteena on my&ouml;s kehitt&auml;&auml; kirjanpidon pohjaksi tilikartta, joka nykyist&auml; paremmin vastaa yhdistykselle valittujen toiminnanalojen luonnetta ja siten helpottaa ja j&auml;rkiper&auml;ist&auml;&auml; tilinhoitoa ja takaa mahdollisuuden tulevaisuudessa laajentaa tai muuttaa toimintoja ilman oleellisia muutoksia perusratkaisuihin.</p>
						<p>Meneill&auml;&auml;n on kirjanpitoj&auml;rjestelm&auml;n ja tilikausien 1994-1999 tilinp&auml;&auml;t&ouml;sten laatiminen, jota hoitaa hallituksen luvalla Janne Sir&eacute;n, soveltamalla asiakirjojen toteutuksessa kunkin tilikauden aikana voimassa ollutta kirjanpitolakia. Korvaamattoman arvokasta asiantuntija-apua ty&ouml;h&ouml;n on Jannelle tarjonnut Anu Seilonen.</p>
						<p>Valtavan paljon toivotun uuden Saku-tapahtuman j&auml;rjest&auml;minen n&auml;ytt&auml;isi nykytilanteen valossa olevan mahdollista toteuttaa loppuvuodesta 2000 tai ensi vuoden alkupuoliskolla. Ensisijaisena tavoitteena on, ett&auml; tapahtuman on pystytt&auml;v&auml; tarjoamaan k&auml;vij&auml;lle korkealaatuisen tapahtumakokemuksen ohessa my&ouml;s mahdollisuus k&auml;yt&auml;nn&ouml;ss&auml; tutustua todella merkitt&auml;viin Amiga-maailman tuoteuutuuksiin. Niiden saaminen mukaan tapahtumarungossa k&auml;ytett&auml;v&auml;ksi ei todenn&auml;k&ouml;isesti kuitenkaan ole mahdollista viel&auml; kes&auml;n aikana, ja ilman niit&auml; tapahtuman tarkoituksenmukaisuus ja merkityksellisyys j&auml;isiv&auml;t kyseenalaisiksi, joten katsoimme j&auml;rkev&auml;mm&auml;ksi siirt&auml;&auml; tapahtuma-aikaa eteenp&auml;in kuin ryhty&auml; j&auml;rjest&auml;m&auml;&auml;n sis&auml;ll&ouml;lt&auml;&auml;n vajavaiseksi j&auml;&auml;v&auml;&auml; pelkk&auml;&auml; aiempien tapahtumien &quot;kertausharjoitusta&quot;.</p>
						<p>Tapahtuman j&auml;rjest&auml;mist&auml; on kuitenkin vuoden alusta l&auml;htien suunniteltu vaivihkaa muun toiminnan ohessa, yhdistyksen tapahtumavastaavan Terho Henrikssonin johdolla. Ty&ouml;nimen&auml; tapahtumalle on ollut ihmisten puheissakin useimmiten k&auml;ytetty Saku 2000.</p>
						<p>Yhdistyksen kotisivujen pitk&auml;hk&ouml;n ja hankalasti muistettavan nykyisen osoitteen korvaajaksi on ehdotettu haettavaksi lyhyemp&auml;&auml; ja helpompaa omaa verkkotunnusta. Yhdistys ei kuitenkaan ole ns. julkisyhteis&ouml;, joten &quot;.fi&quot;-p&auml;&auml;tteisen verkkotunnuksen saaminen edellytt&auml;isi yhdistyksen koko nimen k&auml;ytt&auml;mist&auml; tunnuksen runkona, jolloin osoitteesta tulisi j&auml;lleen aivan liian pitk&auml;. Oma verkkotunnus on kuitenkin ollut yhdistyksen tavoitelistalla jo pitk&auml;&auml;n, joten tutkimme seuraavaksi ulkomaisten verkkotunnuksia tarjoavien yritysten palveluiden laatua, k&auml;ytett&auml;vyytt&auml; ja hinnoittelua. Mahdollisen osoitemuutoksen joskus tullessa on my&ouml;s pystytt&auml;v&auml; varmistamaan, ett&auml; vanhakin osoite toimii yht&auml; aikaa uuden kanssa riitt&auml;v&auml;n pitk&auml;n siirtym&auml;vaiheen ajan.</p>
						<p>Saku-lehden siirtyess&auml; todenn&auml;k&ouml;isesti ensi vuoden alusta vain yhteen julkaisumuotoon, HTML-lehteen, on sen rinnalle toivottu uudeksi vaihtoehdoksi my&ouml;s PDF-muotoista painosta lehdest&auml;. Sellaista ei kuitenkaan voida toteuttaa, sill&auml; ensinn&auml;k&auml;&auml;n PDF ei ole vapaasti k&auml;ytett&auml;viss&auml; oleva formaatti, vaan kaupallinen tuote, jonka luontity&ouml;kalut ja k&auml;ytt&ouml;oikeudet eiv&auml;t hinnoiltaan ole yhdistyksen hankittaviksi sopivia. Toisekseen PDF-painoksen riitt&auml;v&auml;n tasokas toteuttaminen vaatisi saavutettavaan hy&ouml;tyyn n&auml;hden kohtuuttoman suuren ty&ouml;m&auml;&auml;r&auml;n, juuri kun usean lehtiformaatin aiheuttamasta ylim&auml;&auml;r&auml;isest&auml; ty&ouml;st&auml; ollaan p&auml;&auml;sem&auml;ss&auml; eroon.</p>
						<p>Yhdistykselle on my&ouml;nnetty oikeus Amiga Recognized User Organization -merkin k&auml;ytt&ouml;&ouml;n yhdistyksen kotisivuilla. Merkki tarkoittaa, ett&auml; sivujen sis&auml;lt&ouml; on Amigan tarkistama ja hyv&auml;ksym&auml;. Merkin anomisen ja yhteydet Amigaan hoiti Terho Henriksson.</p>
						<p>Vuoden 2000 lukijakysely julkaistaneen vasta Sakun numerossa #34 lokakuun alkupuolella, koska mielekk&auml;&auml;n ja hy&ouml;dyllisen kyselyn laatiminen on ollut toistaiseksi hankalaa Amiga-markkinoiden n&auml;enn&auml;isen ep&auml;m&auml;&auml;r&auml;isen tilan ja uusien tuotteiden jatkuvien viiv&auml;stymisien takia.</p>
						<p>Muistion kokosi ja kirjoitti Jarmo Piippo. Oikoluvusta kiitos Anu Seiloselle.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
