<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Thomas Weber -->

    <TITLE>Comic-Ecke</TITLE>
  </HEAD>

  <BODY background="comic0.gif" text="#000000" link="#0000FF" vlink="#000080"
  alink="#FF0000" bgcolor="#FFFFF4">
    <TABLE border="0" cellpadding="8" summary="" width="100%">
      <TR>
        <TD>
          <H1 align="center">Willkommen!</H1>

          <P>Hallo zusammen,</P>

          <P>na da haben wir ja noch einmal Gl&uuml;ck gehabt und der Hals unserer
          NoCover wurde im letztem Moment aus der Schlinge gezogen, nochmal ein Danke
          an Wolf!</P>

          <P>Nun zu der Comic Ecke. Heute findet ihr neben dem neuen Spacys Teil noch
          den Randa Teil 51! Das hei&szlig;t nun nicht, da&szlig; es nun damit weiter
          geht denn Mein Ziel bleibt weiterhin die Spacys zum Teil 50 zu f&uuml;hren.
          Die Sache ist nur die, da&szlig; ich meine H&auml;nde nun mal nicht still
          halten konnte und umbedingt wissen wollte wie es in der neuen
          Aufl&ouml;sung so aussieht. Wie man sieht ist das Resultat recht brauchbar.
          Nicht alles ist perfekt, aber so sind nat&uuml;rlich weitaus mehr Details
          m&ouml;glich speziell im Gesicht. Das Kopfsteinpflaster ist &uuml;brigens
          ein Pinsel! Im "F&uuml;llmodus" eingesetzt f&uuml;llt er eine beliebig
          gro&szlig;e Fl&auml;che damit aus, toll nicht war? Mit Sicherheit werdet
          ihr es sp&auml;ter in anderen Teilen noch einmal wiederfinden. Eigendlich
          wollte ich auch noch Schatten haben und im Vordergrund sollte Silvinas
          Pferd stehen. Mit den Schatten wird aber nun mal alles so schwarz und
          au&szlig;erdem wirft ja alles Schatten, also nicht nur die Figuren, sondern
          auch die H&auml;user und alles andere. Das ging nicht, genau wie das Pferd.
          Wo h&auml;tte ich es hinstellen sollen? Es w&auml;hre duch die Sprechblasen
          nicht m&ouml;glich gewesen.</P>

          <P>Bei diesem Teil habe ich zum ersten Mal &uuml;brigens zu einem
          Texteditor gegriffen und aufgeschrieben was in den Bildern stehen soll. Das
          habe ich 50 Teile lang noch nie gemacht, es hat aber Zukunft.</P>

          <P>Und nun viel Spa&szlig; damit und nat&uuml;rlich auch mit dem Rest der
          NoCover!</P>

          <P align="center"><FONT size="+1"><A href="randa51.gif"
          target="_blank">Klicke mich an, f&uuml;r Randa Teil 51!</A><BR> <A
          href="spacys29.gif" target="_blank">Klicke mich an, f&uuml;r die Spacys
          29!</A></FONT></P>

          <P>Thomas Weber</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

