<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Andreas Guldner -->
    <TITLE>die Wahlqual</TITLE>
  </HEAD>

  <BODY background="wolf1.gif" text="#000000" link="#000000"
  vlink="#0000ff" alink="#000055">
    <BR>
    <BR>

    <TABLE width="100%" border="0" cellpadding="10" summary="">
      <TR>
        <TD>
          <H1 align="center"><b>die Wahlqual</b></H1>

          <P>Ich w&uuml;rde gerne etwas beitragen zum Thema:
          <EM>Wie wird man Kanzler?</EM>, da ich ebenfalls das "Verg&uuml;gen" hatte,
          recht kreative Ansichten zu den angetretenen Kandidaten in Gespr&auml;chen
          zu erfahren.</P>

          <H3>Zitat 1:</H3>
          <EM>wenn der Stoiber gewinnt gibts in Berlin nur noch Weisswurst statt
          Currywurst</EM>!

          <H3>Zitat 2:</H3>
          <EM>das k&ouml;nnen sie nicht finanzieren!</EM> 

          <H3>Zitat 3:</H3>
          <EM>der "Bayer" darf nicht Kanzler werden!</EM> 

          <H3>Zitat 4:</H3>
          <EM>wenn ich Kanzler werde und es nicht schaffe die Zahl der Arbeitslosen
          unter XXX zu senken, habe(n) ICH/wir es nicht verdient wiedergew&auml;hlt
          zu werden!</EM>

          <P>In all diesen Aussagen zeigt sich die "Kompetenz" im Umgang mit
          politischem Gegner und den W&auml;hlern, denn diese Art der Argumentation
          veranschaulicht doch das "hohe" Niveau der Diskussion in Deutschland. Da
          wird Bl&ouml;dsinn wie in Beispiel 1 zum wahlentscheidenden Grund
          erkl&auml;rt, billige Vorw&uuml;rfe wie in Beispiel 2 zum
          abendf&uuml;llenden Podiumsgespr&auml;ch aufgeblasen und mit sehr
          bedenklichen Aussagen (Beispiel 3) ein Zusammenhalt n&ouml;rdlich des
          "Wei&szlig;wurst&auml;quators" beschworen, nur um die Erinnerung an Dinge
          wie Beispiel 4 zu &uuml;berdecken.</P>

          <P>Besonders die antibayrische Haltung finde ich einer f&ouml;deralen
          Demokratie f&uuml;r unw&uuml;rdig, da sie ein &Uuml;berlegenheitsdenken und
          Neidkampagnen T&uuml;r und Tor &ouml;ffnet anstatt sich klarzumachen, dass
          eine Gemeinschaft immer st&auml;rker ist als ein Haufen von Egomanen. Aber
          leider hoffen hier einige auf ein "zuerst wir und dann die anderen"
          Gef&uuml;hl in ihren Bundesl&auml;ndern um sich ohne Argumente und
          L&ouml;sungen trotzdem positiv darzustellen.</P>

          <P>Sicher ist die Lage in den s&uuml;dlichen Bundesl&auml;ndern nicht nur
          gut, aber da hier die wenigen auch jetzt noch investierenden und personal
          einstellenden Firmen ihren Sitz haben sollte dies doch eher zum nachdenken
          anregen wenn man die st&auml;ndigen Nachteile bei Bundesvorhaben wie zb
          Autobahnbau,Eisenbahnlinienunterhalt, Bundeswehrreduktion usw auch
          wahrnimmt.Besonders beim Thema Hochwasser musste ich wiedereinmal sehen
          dass die Berichte &uuml;ber bayrische Sch&auml;den in "n&ouml;rdlichen"
          Medien kaum erw&auml;hnung finden und die unterst&uuml;tzung anderer
          Bundesl&auml;nder mit freiwilligen Helfern oft abgelehnt wurde.W&uuml;rde
          man dies genauer betreachten dann gibt es leider das traurige Ergebnis das
          im zusammenleben und der gegenseitigen Unterst&uuml;tzung das
          verh&auml;ltnis zwischen den s&uuml;dlichen Bundesl&auml;ndern und ihren
          "ausl&auml;ndischen" Nachbarn oft besser ist als das innerdeutsche.</P>

          <P>Nat&uuml;rlich ist die Wahl eines Kanzlers auch in Bayern nicht
          automatisch pro CDU/CSU, doch einen Heimvorteil hatte ja wohl bisher jeder
          Kandidat in "seinem" Bundesland, weshalb dies sicher kaum Auswirkungen auf
          das Gesamtergebnis hat.</P>

          <P>Nach welchem Kriterium haben also wir alle gew&auml;hlt?<BR> So wie
          immer (festgelegt) oder nach dem Eindruck in den Medien? Vielleicht nur das
          "kleinere &Uuml;bel" oder einfach so wie es die anderen machen?<BR> Ich
          bef&uuml;rchte, dass viele so von dem Eindruck der
          Handlungsunf&auml;higkeit der Politik beeinflusst sind, so dass sie einfach
          irgendwas oder auch &uuml;berhaupt nicht gew&auml;hlt haben. Auch wenn der
          Staat eigentlich pleite ist und es wenig Freir&auml;ume gibt w&uuml;rden
          mich jedenfalls eher Konzepte zum finanziellen Bereich interressieren,
          anstatt dieses Standardsatzes "das k&ouml;nnen sie nicht finanzieren!" in
          jeder Auseinandersetzung. Da es die Damen und Herren Politiker hier also
          wieder einmal geschafft haben, nichts zu sagen au&szlig;er sich gegenseitig
          mit Schmutz zu bewerfen, bleibt uns W&auml;hlern nur die bisherigen
          "Leistungen" als Entscheidungshilfe.</P>

          <P>Was bleibt uns von bisher 4 Jahren <B><FONT color=
          "#ff0000">Rot</FONT>/<FONT color= "#00cc00">Gr&uuml;n</FONT></B>? Eine hohe
          Arbeitslosigkeit, trotz gegenteiliger Versprechungen, eine Pleitewelle in
          den Betrieben, ehemals staatliche Monopolisten ohne Zukunftspl&auml;ne wie
          zB den B&ouml;rsenbruchpilot Telekom und die Bundesbahn mit weniger
          Leistung daf&uuml;r aber h&ouml;heren Preisen, der &uuml;bergang der
          Bundeswehr vom brauchbaren Verteidigungsapparat zum Papiertiger &uuml;ber
          den bald alle lachen und eine ideologisch behinderte Reform der
          Sozialkassen. Statt es besser zu machen wie Kohl hat diese Regierung nur
          "mit ruhiger Hand" den Karren BRD tiefer in den Dreck gefahren.</P>

          <P>Wo langfristige Planung und Zuverl&auml;ssigkeit notwendig sind wird mit
          kurzen Spr&uuml;ngen die Zukunft des Landes ruiniert. H&auml;tte man
          weniger auf werbewirksame "Rettungen" gesetzt, sondern wirkliche Reformen
          angepackt, k&ouml;nnte man den Wahlausgang nachvollziehen. Aber so bleibt
          der Eindruck, dass der Schwanz mit dem Hund wedelt, wenn es schon bald
          <B><FONT color="#00cc00">Gr&uuml;n</FONT>/<FONT color=
          "#ff0000">Rot</FONT></B> heissen muss! Das Patt der grossen hat nun den
          kleinen Partnern eine ihnen niemals zustehende Macht verliehen. So kann
          Demokratie auch kaputt gehen, wenn 8% Parteien (8 von 81% =also 6,5% aller
          Berechtigten) Einfluss auf die gesamte Politik in Deutschland und Europa
          bekommen. Da bestimmen dann zusammen etwas weniger als 40% aller
          Wahlberechtigten den Kanzler, Bundespr&auml;sidenten, Gesetze und EU-Posten
          dank der 19% Nichtw&auml;hler! Ich bin ja gegen eine Wahlpflicht, aber es
          w&auml;re schon sehr hilfreich gewesen, wenn alle das angekreuzt
          h&auml;tten, was sie wirklich wollen, auch wenn es viele gibt die keine
          passende Partei auf dem Wahlzettel gefunden haben. Mit dem was vor der Wahl
          als "kleineres &Uuml;bel" gesehen wurde, werden viele bald merken, dass sie
          nicht das bekommen was versprochen wurde, denn die Realit&auml;t
          k&ouml;nnen auch die Politiker nicht wegschieben und durch Parteibuchdenken
          ersetzen. Trotz der starken Medienengagements mancher Parteien ist die Zeit
          einer SED "und die Partei hat immer Recht" doch endg&uuml;ltig vorbei.
          (hoffe ich zumindest).</P>

          <H2><B>die n&auml;chsten vier Jahre</B></H2>

          <P>Weil die vorhergehende Wahl eine "Kohl muss weg"-Wahl war hoffte ich
          diesmal auf einen Wahlausgang der von einer &uuml;berlegten Entscheidung
          bestimmt ist. Bedauerlicherweise muss ich jetzt aber eine Regierung
          ertragen, die all die Probleme, die in NC103 "der Schwarzseher" so treffend
          beschrieben sind, wahr werden l&auml;sst. Es war f&uuml;r mich eine
          positive Abwechslung auch mal eine fundierte Meinung zu lesen, die ich
          selbst, wenn sie anders w&auml;re als sie ist, immer noch anerkennen kann
          und die auch hoffentlich viele Diskussionsteilnehmer findet. Schwierig ist
          es da schon etwas zu schreiben, wenn der Grossteil der eigenen Sichtweise
          schon dargelegt wurde.</P>

          <P>Deshalb nur mal ein paar Anmerkungen zum Thema:<BR> Nat&uuml;rlich gibt
          es einen Grund f&uuml;r <B><FONT color="#ff0000">Rot</FONT>/<FONT color=
          "#00cc00">Gr&uuml;n</FONT></B> zu sein, denn niemand anders kann sowenig
          Leistung so positiv darstellen! Es ist auch keine Schande, wenn das Ansehen
          des eigenen Landes leidet, Hauptsache man steht vor der Wahl als
          Friedensengel da! Man kann ja mit Isolationismus und dem Verzicht auf
          stilvolle Diplomatie bestimmt verhindern, dass deutsche Soldaten in den
          Irak m&uuml;ssen! (Nur zu dumm, dass niemand deutsche Soldaten angefordert
          hat oder es noch tun wird!) Aber die Vergesslichkeit des W&auml;hlers hilft
          doch sicher wiedereinmal noch weitere Jahre durchzuwursteln! Ist das nicht
          ein Super-Grund <B><FONT color= "#ff0000">Rot</FONT>/<FONT color=
          "#00cc00">Gr&uuml;n</FONT></B> zu w&auml;hlen? Oder kann irgendwer sonst so
          viele Minister und Sekret&auml;re verbrauchen und dabei verhindern, dass
          eine Reform m&ouml;gliche W&auml;hler vergr&auml;zt? Statt teurer
          Staatsfinanzierung der Sozialsysteme komplette Eigenleistung durch den
          Steuerzahler in dem er/sie zuerst Steuern und Abgaben entrichtet, um dann
          anschlie&szlig;end zuzuzahlen und privat vorzusorgen. Wenn da so weiter
          reformiert wird, ist bald die Rente selbst mitzubringen. Das entlastet den
          Staatss&auml;ckel ungemein, wenn man solange kreuz und quer finanziert, bis
          sich keiner mehr auskennt. Dann versucht niemand mehr zu verstehen warum
          und damit nimmt man dem B&uuml;rger die Last des Nachdenkens, so dass sie
          mehr Zeit zum Nachbarnverklagen haben. Anschlie&szlig;end erh&ouml;ht man
          die Gerichtsgeb&uuml;hren so, dass bei jedem Prozess ein Gewinn f&uuml;r
          den Staat herauskommt und schon hat man eine neue Einnahmequelle! Vor allem
          der Umweltschutz liegt doch eindeutig den Gr&uuml;nen am Herzen, haben sie
          doch sich erst k&uuml;rzlich als warnendes Negativbeispiel in der
          Bonusmeilenaff&auml;re geopfert und ist es nicht diese Speerspitze der
          Natur die sinnlose Energieverschwendung dadurch beendet, dass sie diese so
          teuer macht, dass es sich kaum noch jemand leisten kann Energie
          einzusetzen? Haben sie nicht den Atomausstieg beschlossen, mit dem
          gef&auml;hrliche Kernenergie "weltweit" abgeschafft wird (bezogen auf ihren
          Horizont). Ohne diese 33% der Stromerzeugung wird doch der Bestand an
          europ&auml;ischen AKWS viel besser ausgenutzt! Auch traditionsbewusst sind
          sie, erhalten sie doch die Braunkohleverfeuerung und geben dem
          &Ouml;PNV-willigen Bahnfahrer die Chance mit weniger Strecken und
          veralteten Material zu hohen Preisen die Finanzmisere eines ehemaligen
          Staatsbetriebs zu beheben! Alle Vieltelefonierer und Technikfreaks werden
          ebenso gef&ouml;rdert mit UMTS und Telekomaktien, neuem Markt und
          Computerindern. Ist es nicht bewundernswert, wie man Kleinweich und die
          Rechteverwerter noch reicher macht, um endlich Arbeit und Kosten zu
          trennen? (wo kein Personal da keine Kosten). Der Aufschwung kommt sicher,
          wenn diese unkooperativen Firmen endlich aufh&ouml;ren st&auml;ndig
          zehntausende Hightecharbeitspl&auml;tze abzubauen und das Perpetuum mobile
          Internet die strahlende Zukunft der PISA-Kinder ist. Probleme mit Inhalten
          im Netz gibts Dank Ganztagsschulen und politischem Unterricht.... oder
          besser DRM und Antiterrorgesetzen keine mehr, da alle nur noch Hosianna
          singen und dies nat&uuml;rlich alles freiwillig !</P>

          <P><B><FONT color="#ff0000">Rot</FONT>/<FONT color=
          "#00cc00">Gr&uuml;n</FONT></B> erh&auml;lt auch die kreative Auslegung des
          Versammlungsrechts und verhindert damit dieses freudlose friedlich
          "Vorsichhindemonstrieren", wie es ein anderer Innenminister vielleicht
          bundesweit eingef&uuml;hrt h&auml;tte. Solche bedenklichen Organisationen
          wie den Verfassungsschutz l&ouml;sen wir nat&uuml;rlich auf, denn wo
          k&auml;men wir da hin, wenn so ein armer Terrorist und Fanatiker seine
          Ansichten nicht mehr unbeobachtet &auml;u&szlig;ern kann? Was w&auml;re das
          f&uuml;r ein Fernsehprogramm ohne neue Schreckensmeldungen von Attentaten
          (mit dem neuen Markenzeichen "planned in Germany")! Ganz klar wird die
          Gewalt &uuml;berall bek&auml;mpft; mit Soldaten in Afgahnistan, Kosovo, und
          Irak (ups, Fehler darf ja keiner wissen) usw.</P>

          <P>Damit die Bundeswehr es nicht zu leicht hat, kann man ja mal testen, ob
          sich kostspielige Ausr&uuml;stung nicht einsparen l&auml;sst, zB statt
          Airbus-Transporter Linienflug (vom Soldaten bezahlt) oder nur ein paar NH90
          und Tiger und die Strafe f&uuml;r die Vertragsbr&uuml;che zahlt dann die
          n&auml;chste Regierung (kriegt aber weder Hubschrauber noch Flugzeuge). Die
          Bekleidung wird privatisiert (und kommt dann aus USA), nur bl&ouml;d, wenn
          MR Bush dann ein Handelsembargo losl&auml;sst (nachdem auch die Rechte am
          Leopard-Kpz teilweise outgesourct wurden, ebenfalls USA). Dieser
          Technologietransfer schafft bestimmt Vertrauen und erspart den "Freunden"
          die teure Spionage. Dass <B><FONT color= "#ff0000">Rot</FONT>/<FONT color=
          "#00cc00">Gr&uuml;n</FONT></B> auch uneingeschr&auml;nkt solidarisch die
          Informationsbeschaffung (zB Echelon) der USA unterst&uuml;tzt und trotzdem
          noch die Zeit findet neue informationen zu produzieren (wie Fr H.D-G), ist
          doch erstaunlich und man kann nur stolz sein wie die Regierung
          Verb&uuml;ndete mit verbalen "Geschenken" &uuml;berrascht.</P>

          <P>Keine andere Koalition k&ouml;nnte die wirtschaftliche Talfahrt so
          beschleunigen wie diese, wenn "ich-AGs" und die Aufhebung des Meisterbriefs
          im Handwerk kommen, ist das sozusagen nur die Schwungholphase f&uuml;r den
          glorreichen Aufstieg der Arbeitslosen &uuml;ber die 7 Mio H&uuml;rde, womit
          die geplante "spezialberechnete" Arbeitslosenstatistik den B&uuml;rger
          &uuml;berzeugt, dass <B><FONT color= "#ff0000">Rot</FONT>/<FONT color=
          "#00cc00">Gr&uuml;n</FONT></B> es doch geschafft hat unter 3,5 Mio
          abzusenken und dies nur das Beste f&uuml;r alle ist. Wer bezweifelt da die
          Auffangwirkung von ein paar "ich-AGs" gegen&uuml;ber hunderttausender
          Freigestellter? Sollte dies nicht als Chance zur Selbstst&auml;ndigkeit in
          Erinnerung bleiben? Vor allem die teuren Handwerker arbeiten billiger, wenn
          Gesellen eigene Betriebe haben (bilden zwar nicht aus, aber wer braucht
          schon teure Facharbeiter, wenn andere billiger sind?) und der
          Regierungsapparat, welcher so gut wie 80% der Arbeitskosten verursacht, ist
          sowieso vollkommmen unschuldig!</P>

          <H2><B>Ergebnis:</B></H2>

          <P>Die W&auml;hler mussten einfach so w&auml;hlen, da sonst die
          M&ouml;glichkeiten herumzujammern vielleicht verschwunden w&auml;ren und
          ein sicheres und international angesehenes Deutschland w&auml;re ja auch
          langweilig! Zuviel Geld und Arbeit behindert nur die armen Unternehmer, die
          dann vielen Menschen den Tagesablauf mit Arbeit versauen w&uuml;rden.
          Gestresste Soldaten st&auml;nden vor dem Problem neue Ausr&uuml;stung zu
          bedienen und der US-Pr&auml;sident w&uuml;rde vor Langeweile umkommen, wenn
          keiner mehr auf ihm herumhackt, sondern l&auml;stigerweise seine Meinung im
          direkten Gespr&auml;ch vorbringt.</P>

          <P>Ich habe es hier wirklich versucht "paroli" zu bieten, scheinbar
          l&auml;sst mich <B><FONT color= "#ff0000">Rot</FONT>/<FONT color=
          "#00cc00">Gr&uuml;n</FONT></B> aber argumenttechnisch h&auml;ngen und da
          ich die auch NICHT gew&auml;hlt habe und zudem aus Bayern komme, konnte
          dies nur in dieser Textkatastrophe enden.</P>

          <P>Andreas Guldner</P>
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

