<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Daniel (Antidote) -->

    <TITLE>Nachwahl</TITLE>
  </HEAD>

  <BODY background="nc_bg3.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Wahlnachlese</B></FONT></P>

          <P>Hi Higgins!<BR>
          Also, ich werde mal Punkt f&uuml;r Punkt auf Deine Standpunkte eingehen
          (die ja recht ausf&uuml;hrlich von Dir behandelt wurden!):</P>

          <P><B>1.</B> Also dass es schon ein bisschen komisch ist, eine Partei nach
          einem Bundeskanzlerkandidaten und dessen Anti-/sympathie Tv-Showtalent zu
          beurteilen und dann auch aus diesem Grund zu w&auml;hlen ist nat&uuml;rlich
          komisch, aber auch nachvollziehbar, wie ich finde!!</P>

          <P>Ein Kandidat wird ja aus bestimmten Gr&uuml;nden von der Partei
          vorgeschlagen und gew&auml;hlt und zwar alleine (naja, vielleicht nicht
          immer?!) aus dem Grund, dass diese/dieser die Partei entsprechend
          repr&auml;sentiert. Und nun sind Stoiber, Schr&ouml;der und Westerwelle
          total unterschiedliche Charaktere.</P>

          <P>Stoiber: "Wir st&uuml;rmen Berlin"<BR>
          Schr&ouml;der: "W&auml;hlt Doris ihrem Mann seine Partei" (Haha...G&auml;hhhn)<BR>
          oder Westerwelle: I love Big Brother und mein dolles gelbes Auto (hohohoho...hui!)</P>

          <P>Hinzu kommt dieses Jahr noch, dass wir einen sehr personenfixierten
          Wahlkampf erleben durften. Man merkt, dass wir uns immer mehr dem
          amerikanischen "Vorbild" n&auml;hern.<BR>

          Das Parteiprogramm kam meiner Meinung nach bei allen Parteien zu kurz!!<BR>

          -Allerdings ist das nicht unbedingt so ganz neu.-<BR>

          Was hat man als W&auml;hler also f&uuml;r Informationen???<BR>

          Alle Parteien (gerade aber auch die Opposition) will dieses und jenes dem
          Volk bieten, aber auch die Bev&ouml;lkerung wei&szlig;, dass das nicht
          wirklich finanzierbar ist.</P>

          <P>So, wie ich es erlebt habe, wurde dieses Jahr teilweise (gerade im
          Norden) nach dem kleineren &Uuml;bel Ausschau gehalten und dann
          gew&auml;hlt. Ich f&uuml;r meinen Teil wu&szlig;te zwar ganz genau das ich
          nicht mein Kreuz bei CDU/CSU oder FDP mache, aber auch sonst habe ich
          dieses Jahr eher z&auml;hneknirschend gew&auml;hlt. Achja, SPD auch nicht
          ;-) Ich denke das ist aber auch ein allgemeines Problem der Parteien und
          sich auf einmal alle in der "Mitte" treffen. Aber dem anderen niemals
          zustimmen w&uuml;rden. .....<BR>

          Okay, weiter im Text</P>

          <P><B>2.</B> Mit der &Ouml;kosteuer ist das so eine Sache. An sich finde
          ich die garnicht schlecht, allerdings wei&szlig; man nie als B&uuml;rger,
          ob das Geld dieser Steuer wirklich in die &Ouml;kologie investiert wird,
          oder eher doch Haushaltsl&ouml;cher gestopft werden sollen. Normalerweise
          wollen sie damit ja zukunftstr&auml;chtige Jobs im Bereich der
          Umwelttechnologie und Forschung bezuschussen / f&ouml;rdern. Das ist gut
          und auch ein unbedingtes Muss.</P>

          <P>Und mal ehrlich, die Opposition h&auml;tte es auch nicht wirklich anders
          gemacht. Vielleicht h&auml;tten sie andere Steuern erh&ouml;ht, aber wo
          kein Geld ist, kann man nur umherschieben!!</P>

          <P>Allerdings ist Dein Argument in Bezug auf Transport von Waren mit den
          Lkws etc. der Firmen schon richtig. Da m&uuml;sste es dann Sonderregelungen
          geben!! Allerdings sollte man auch &uuml;berlegen, dass viele Firmen
          aufgrund von Spekulationen an der B&ouml;rse kaputt gegangen sind und auch
          weiter kaputt gehen werden. Nat&uuml;rlich werden auch nur wenige
          Privatauktion&auml;re Kohle scheffeln. Die B&ouml;rse wird halt
          &uuml;bersch&auml;tzt!!</P>

          <P>Okay es gibt ungef&auml;hr noch tausend andere Gr&uuml;nde. Vorallem
          f&uuml;r Neueinsteiger, die einen kleinen Betrieb er&ouml;ffnen wollen,
          haben erstmal eine B&uuml;rokratieh&uuml;rde zu nehmen, die nicht von
          schlechten Eltern ist. Weiter stecken die Banken lieber in einen
          Gro&szlig;en, aber maroden Betrieb Millionen hinein, als 50.000 in einen
          kleinen, aber vielleicht zukunftsorientierten!! Naja, will ich jetzt auch
          nicht weiter ausf&uuml;hren.</P>

          <P><B>3.</B> Wow, also die Deutschen kommen ja jetzt doch wieder mit den
          Amis klar (Brief von Bush). Allerdings finde ich Deine Argumente bzw.
          Beispiele in Bezug auf einen m&ouml;glichen Angriffskrieg der Deutschen und
          der achso "herzlichen" Solidarit&auml;t der Amerikaner etwas gewagt. Wobei
          Du ja herzlich nicht geschrieben hast ;-)</P>

          <P>Es gibt da einen einfachen entscheidenen Unterschied: Die Amis
          f&uuml;hren "gerne" Krieg, gerade in Zeiten wo die Wirtschaft auch nicht
          gerade am Bl&uuml;hen ist!! Das ist nun eigentlich nichts neues. Und bis
          auf GB, f&uuml;hren die anderen Europ&auml;ischen Staaten nicht "so gerne"
          Angriffskriege. Mit dem Terrorismus ist das nat&uuml;rlich schwierig zu
          beschreiben. Nur soviel von mir. Ich denke nicht, das man einen Terrorismus
          bzw. m&ouml;gliche Terroristen damit klein bekommt, indem man ein Land
          angreift und ua. die dortige Bev&ouml;lkerung umbringt. Die meisten
          Terroristen wird man so bestimmt nicht erwischen, die Leben n&auml;mlich
          wahrscheinlich garnicht in den sogenannten "Schurkenstaaten"
          (grrr.bl&ouml;der Ausdruck daf&uuml;r!!!), sondern in anderen L&auml;ndern.
          Das man nat&uuml;rlich etwas gegen gewisse Bedrohungen unternehmen muss,
          ist klar. Aber Krieg wird einen Menschen wie Saddam H.
          h&ouml;chstwahrscheinlich garnicht treffen (siehe Osama BinLaden). Und hey,
          stell Dir mal vor, die Iraker stellen die &Ouml;l-Piplines ab!!!! Dann wird
          das hier auch nicht gerade besser (D&uuml;rfte Schr&ouml;der vielleicht
          daran gedacht haben???) ;-)</P>

          <P>Naja, ist auch ein riesen Thema und m&uuml;sste eigentlich noch weiter
          &uuml;berdenkt werden, aber vielleicht entwickelt sich das ja die
          n&auml;chsten Ausgaben noch :-)</P>

          <P><B>4.</B> Ich muss Dir zu Deiner Meinug in Bezug auf Arbeitspl&auml;tze,
          Arbeitsamt und das die meisten Stellen von den Kleinst- und Mittelbetrieben
          gestellt werden, Recht geben.</P>

          <P>Allerdings hat Kohl zwar gute Beziehungen zu anderen L&auml;ndern
          gef&uuml;hrt und einiges aufgebaut, aber Du kannst nicht behaupten,
          Rot/Gr&uuml;n h&auml;tte das jetzt wieder alles "niedergetrampelt".
          Schr&ouml;der pflegt zB. sehr gute Kontakte zu Putin (Russland) und Toni
          Blair (GB). Sehr wichtig &uuml;brigens und auch schon recht erfolgreich. J.
          Fischer macht seine Sache auch sehr Gut. Amerika, mit einem wie ich finde
          sehr unf&auml;higen Pr&auml;sidenten (G.W.Bush), ist halt nicht alles und
          auch das Verh&auml;ltnis wird wieder besser.</P>

          <P><B>5.</B>Zitat:</P>

          <BLOCKQUOTE>
            "Eine ganze Stadt wird daf&uuml;r dort dem Erdboden gleich gemacht und
            deren Bewohner marschieren mit Transparenten gegen Deutschland durch ihre
            Strassen, weil sie ihre Heimat ersatzlos verlieren."
          </BLOCKQUOTE>

          Naja, aber viele L&auml;nder haben schon zu Recht auch in Kohls Zeiten
          gegen Deutschland demonstriert. Immerhin hat man ja finanziell schon sehr
          lange sehr fragw&uuml;rdige Projekte unterst&uuml;tzt.... <BR> <BR>
                     

          <P><B>6.</B> Zum Schluss kann ich nur noch schreiben, das dies alles auch
          nur einen kleinen Teil meiner pers&ouml;nlichen Meinung widerspiegelt und
          ich auch teilweise provokativ gekontert habe, um Dich aber auch die anderen
          aus ihrer Reserve zu locken. Einige Teile meines Schreibens m&uuml;ssten
          nat&uuml;rlich auch noch ausf&uuml;hrlich bzw. besser begr&uuml;ndet
          werden, aber ich will auch erstmal auf eine Reaktion warten.</P>

          <P>Achja, mit dem Schluss von Dir bin ich auch &uuml;bereins (naja, mit dem
          Meisten davon), obwohl ich allerdings f&uuml;r die CDU/CSU nicht viel
          &uuml;brig habe. Okay, eigentlich habe eh nicht viel f&uuml;r Parteien
          &uuml;ber. Ich finde halt das Rot/Gr&uuml;n noch weitere 4 Jahre verdient
          haben, Kohl hat ja auch ne menge Zeit. ;-)</P>

          <P>F&uuml;r mich ist die CDU/CSU zu "national"politisch, die fast keinen
          vern&uuml;nftigen Punkt in Bezug auf Au&szlig;enpolitik und doppelte
          Staatsb&uuml;rgerschaft haben. Bei solchen Themen wird dann immer gerne
          "Nein und N&ouml;" gesagt. Achja und dem Thema &Uuml;berwachung des
          B&uuml;rgers wird von der Opposition noch viel extremer "angepackt", als es
          Mr. "Law &amp; Order" Schily macht und das kann ich nun &uuml;berhaupt
          nicht gutheissen!!!!</P>

          <P>Juuup bis denne + freue mich auf Deine Reaktion<BR>
          Antidote (1xklein@web.de)</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

