<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Der Schwarzseher Teil 2</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>"Der Schwarzseher Teil 2"<BR>
          - Politische Runde in der NoCover</B></FONT></H1>

          <P>Hallo, ich bin&acute;s wieder. Da ich einige positive EMails bekommen
          habe zu meiner politischen Runde in der letzten NC, m&ouml;chte ich heute
          ein weiteres mal n&ouml;rgeln in der Hoffnung, von Euch Eure gegenteilige
          &Uuml;berzeugungen hervorzulocken.</P>

          <P>Deutschland st&ouml;hnt und &auml;chzt - ja und?</P>

          <P>Die Deutschen wundern sich jetzt allen Ernstes? Ist doch wirklich nicht
          zu fassen. Sind nach solch kurzer Zeit die Wahleuphorien schon beerdigt?
          Unser Land wollte den vermeindlich symphatischeren Bundeskanzler - da ist
          er nun!</P>

          <P>Wieder gibt es Gejammere - alles wird teurer. Ja aber
          selbstverst&auml;ndlich wird alles teurer. Das lernen bereits kleine
          kaufm&auml;nnisch Angestellte in der Berufsschule. Wenn man Energie teurer
          macht, wird ALLES teurer und eine wirklich gewaltige Lawine wird
          ausgel&ouml;st. In K&uuml;rze kommt wieder eins mit der &Ouml;kosteuer oben
          drauf. Da wirds beim tanken wieder teurer...</P>

          <P>Beim tanken? - Das ist der kleinste Anteil, - der kleinste Kr&uuml;mel,
          der mit gro&szlig;er Lawine in unsere Geldb&ouml;rsen rollt. Was glauben
          denn Viele, wie die vielen Produkte, die ohnehin schon teurer geworden
          sind, es bis ins Regal schaffen? Rechnen wir mal nach.</P>

          <P>Ein Hersteller braucht diverse Teile. Diese Teile muss er bei den
          verschiedenen Zulieferern bestellen. Jedes Einzelteil rollt nun zum
          Hersteller, wo dann das eigentliche Produkt daraus hergestellt wird. Die
          Wege der Einzelteile werden teurer, da die Treibstoffkosten angestiegen
          sind. Diese Kosten m&uuml;ssen selbstverst&auml;ndlich in alle Einzelpreise
          der Einzelteile eingerechnet werden. Um kein Risiko einzugehen, rechnet man
          noch einen kleinen Sicherheitsabstand ein, damit keine Verluste eingefahren
          werden, wenn vom Angebot bis zur Anlieferung die Transportkosten erneut
          sich erh&ouml;hen. Nun stellt unser Hersteller sein Produkt her. Unter
          ungl&uuml;cklichen Umst&auml;nden hat er zus&auml;tzlich viele weitere
          Nachteile der neuen Steuerkonzepte und der hohen Nebenkosten. Nun muss
          unser Hersteller seine Produkte noch zu den Gro&szlig;h&auml;ndlern
          liefern. Auch hier haben sich wie f&uuml;r Alle die Transportkosten
          erh&ouml;ht, die in die Preise eingerechnet werden m&uuml;ssen. Unser
          Produkt wird also ein weiteres mal teurer. Vom Gro&szlig;handel geht es
          dann zum Einzelhandel und unser Verteuerungsspiel wiederholt sich abermals.
          Am Schluss &auml;rgern wir uns nicht nur &uuml;ber die paar Cent, die wir
          beim tanken mehr bezahlen, um zum Einkaufen zu fahren, wo wir unser wieder
          teurer gewordenes Produkt dann in den Regalen finden. Die hohen
          Treibstoffkosten wirken sich dadurch auf so ziemlich alles um uns herum
          aus. Denn gibt es etwas, was nicht in unserem Land transportiert werden
          muss, um vom Verbraucher verbraucht zu werden? Die Summe aller Teuerungen
          ergibt dann das immer wieder ungern geh&ouml;rte Gest&ouml;hne, dass mal
          wieder alles teurer geworden ist. Durch die teureren deutschen Produkte
          weichen die Verbrauche auf ausl&auml;ndische Produkte aus. Unternehmen, die
          nicht in&acute;s Ausland abwandern wollen, oder k&ouml;nnen, werden weniger
          Umsatz machen und statt zu expandieren, werden Arbeitspl&auml;tze wieder
          abgebaut. Mehr Arbeitslose verursachen wieder h&ouml;here Ausgaben des
          Staates, die dann immer weniger werdende Arbeitnehmer zahlen sollen, denn
          das ist das ab solut einzige Patent, das Rot/Gr&uuml;n zu kennen scheint.
          Wo kann man einsparen? Wo kann man mehr abkassieren?</P>

          <P>Kassensturz in der eigenen Hosentasche?</P>

          <P>Kaum zu glauben, das hat es auch noch nie gegeben. Bei
          Regierungswechseln ist es ja ein v&ouml;llig normaler Vorgang, dass man in
          die Kassen sehen muss, um zu &uuml;berpr&uuml;fen, wieviel die
          Vorg&auml;nger-Regierung noch darin gelassen hat. Eichel hingegen scheint
          sich in seiner eigenen Kasse nicht ann&auml;hernd auszukennen. Vor den
          Wahlen ist alles prima, realisierbar5, machbar! Kaum ist die Wahl rum, mus
          man erst noch einmal nachsehen und oh Schreck, da fehlen ja soviele Euros,
          dass man seine Wahlversprechen wohl doch nicht so umfangreich halten kann.
          Was ist denn das bitte sch&ouml;n f&uuml;r eine Politik? Gestern hatte ich
          noch einen Zwanziger und lade alle Freunde zu morgen lauthals auf ein Bier
          ein, heute gucke ich nach und irgendwie sind es jetzt nur noch zehn Euro?
          Also lassen wir das mit dem Bier - ein Glas Leitungswasser muss es dann
          eben auch mal tun. Ist es ungerechtfertigt, - nicht nur deswegen - von
          Wahlbetrug zu sprechen? Macht ja nichts - in nicht ganz vier Jahren gibt es
          ja neue Versprechungen und die Alten nicht Eingehaltenen sind l&auml;ngst
          wieder vergessen. Des B&uuml;rgers Gehirn ist klein und speichert nur
          kurz.</P>

          <P>Im Berlin sammeln Unternehmer Unterschriften und protestieren gegen
          diese absolut katastrophale Politik. Das tun sie nicht, weil nur der
          Mercedes sonst eine Nummer kleiner ausf&auml;llt, sondern weil sie die
          Existenz ihres Unternehmens bedrohlich gef&auml;hrdet sehen. Aber das sind
          ja nur Unternehmer - die kommen schon woanders unter. Das heisst Moment
          mal... war mein Chef nicht auch einer von diesen Unternehmern?</P>

          <P>Wenn der Chef sein unrentables Unternehmen schliessen muss, rollen
          K&ouml;pfe - meistens nicht der Kopf des Unternehmers, denn der ist so
          clever und wird sich zu helfen wissen. Der Arbeitnehmer ist derjenige, der
          lediglich zum Arbeitsamt rennen darf. Nicht alle davon finden gleich wieder
          Arbeit - der Rest l&auml;uft dann unter "menschliche Trag&ouml;dien".</P>

          <P>Herrlich ist ja auch die Gesundheitsreform. Mal jetzt von den
          &uuml;blichen schon gewussten Sparma&szlig;nahmen abgesehen. Das kann
          soweit kommen, dass Euer Hausarzt, der Euch kennt und Euch bei bestimmten
          Dingen schon immer wirkungsvoll behandelt hat, das bald nicht mehr tun
          darf. Er wird verpflichtet, Euch dann an einen meist entfernteren Facharzt
          zu &uuml;berweisen. Ein &auml;lterer wenig mobiler Mensch wird vom
          Hausarzt, dem er vertraut, der ihn und sein Leben kennt und ihn schon immer
          behandelt hat - auf dem Lande doch tats&auml;chlich nun pl&ouml;tzlich in
          die Gro&szlig;stadt in ein f&uuml;r ihn anonymes Krankenhaus geschickt.
          Spezielle medizinische Ger&auml;te, die von den kleinen Hausarztpraxen oft
          noch nicht einmal abbezahlt sind, stehen pl&ouml;tzlich nutzlos in der Ecke
          herum und k&ouml;nnen verschrottet werden, da Untersuchungen statt damit,
          mit dem gleichen Ger&auml;t von einer Schwester im Krankenhaus gemacht
          werden sollen. Krankenh&auml;user sind ohnehin schon total &uuml;berlaufen,
          - f&uuml;r unseren alten Patienten wird es zu einem ganzen Tage sausflug in
          die Gro&szlig;stadt, wo er im Krankenhaus sich in einer langen
          Warteschlange anstellen darf, w&auml;hrend unser Landarzt heute etwas
          fr&uuml;her Feierabend macht, weil das Wartezimmer bereits leer ist.</P>

          <P>"Es wird keine Steuererh&ouml;hungen geben."<BR> (Bundeskanzler Gerhard
          Schr&ouml;der, in: Bild vom 01.10.2002)<BR> Tatsachen sehen jedoch schnell
          ganz anders aus....</P>

          <P>Die vor der Wahl noch lauthals angek&uuml;ndigte Kindergelderh&ouml;hung
          ist pl&ouml;tzlich vom Tisch. Stattdessen sorgen steigende
          Rentenbeitr&auml;ge - von 19,1 auf 19,3 Prozent - sowie die Anhebung der
          Beitragsbemessungsgrenze und die ebenfalls steigenden Beitr&auml;ge der
          Arbeitslosenversicherung daf&uuml;r, dass jedem wieder weniger Geld zur
          Verf&uuml;gung steht.</P>

          <P>Die Eigenheimzulage ist abgeschafft worden. Es sollen nur Familien mit
          Kindern gef&ouml;rdert werden. Das ist zwar "nett", wird der Realit&auml;t
          aber gar nicht gerecht. Viele junge Paare bauen schlie&szlig;lich ihr
          Eigenheim bevor die Kinder kommen.</P>

          <P>Die Erh&ouml;hung der &Ouml;kosteuer trifft insbesondere Familien,
          genauso wie die Steuererh&ouml;hung beim Gas oder die geplante Anhebung der
          erm&auml;&szlig;igten Umsatzsteuer auf Lebensmittel und ist ein weiterer
          Beleg der Familienfeindlichkeit der rot-gr&uuml;nen Regierung. Auch die
          allein Erziehenden warten bislang vergeblich auf eine Kompensation des bis
          zum Jahr 2005 wegfallenden Haushaltsfreibetrags.</P>

          <P>Aber was regen wir uns auf? Ist doch alles bestens. In den letzten
          Jahren scheint sich in Deutschland aber auch wirklich alles verschlimmert
          zu haben. Das Volk meint, DAS ist der richtige Weg in die richtige Richtung
          und hat beschlossen, dass es auch die n&auml;chsten vier Jahre in diese
          Richtung weiter gehen soll.</P>

          <P>Ein Gutes hat das Ganze ja - Schwarzsehern wird der Stoff zum
          N&ouml;rgeln sicherlich nicht ausgehen. Alles wird besser, doch nie wieder
          gut.</P>

          <P>Euer Schwarzseher<BR>
          Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

