<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Editorial der NoCover</TITLE>
  </HEAD>

  <BODY background="wolf2.gif" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD width="70">&nbsp;</TD>

        <TD>
          <BR> 
          <CENTER>
            <IMG src="edito.gif" width="275" height="85" alt=""><BR>
            <H2><B>zur NoCover #104 (01.11.2002)</B></H2>
          </CENTER>

          <P>Liebe Leser(Innen) !</P>

          <P>Die NoCover ist tot - es lebe die NoCover ! Das war meine
          Einf&uuml;hrung zur NC-103.</P>

          <P>Mit meiner Rund-Mail vom 05.10. hatte ich wohl regelrecht eine Lawine
          losgetreten. Zuerst die Antwort, die ihr Mail-Empf&auml;nger alle von
          extremfrank bekommen habt:

          <BLOCKQUOTE>
            <FONT color="#006000"><I>
            <B>lol</B> leben wir denn immer noch im mittelalter?<BR>
            die mail werde ich speichern :) 16 farben <B>fettgrins</B>
            </I></FONT>
          </BLOCKQUOTE>
          Diese Mail m&ouml;chte ich gerne nicht tiefer betrachten, denn ich hatte
          den Eindruck, dass meine Zeilen leider etwas fl&uuml;chtig und zu schnell
          gelesen wurden. Ich hatte doch mit keiner Silbe aufgefordert, ein Logo in
          16 Farben zu erstellen, sondern bei der Erstellung bitte R&uuml;cksicht auf
          die Amigafans zu nehmen, die stolz auf ihren A500 sind. Die k&ouml;nnen
          halt leider mit der Farbenpracht von 24bit nicht mithalten. Auch OS3.9 ist
          ihnen leider mit ihren 2+1 MB RAM on Bord leider verwehrt. Frank, wenn du
          auf der Stra&szlig;e einem sch&ouml;n gewienerten Oldtimer begegnest,
          schaust du auch mit gro&szlig;en runden Augen hinterher und sagst nicht
          "wie im Mittelalter", drehst dich um und gibst Gas mit deinem Opel Corsa
          mit Heckspoiler und tiefergelegtem Fahrwerk. </P>
                    
          <P>Auch die erste Reaktion von Wolfgang Haas m&ouml;chte ich nicht
          vorenthalten:

          <BLOCKQUOTE>
            <FONT color="#006000"><I>wei&szlig; ja nicht, wen was am jetzigen logo
            st&ouml;rt. ich find&acute;s grad recht. nicht zu bullig, nicht zu bunt,
            auff&auml;llig aber nicht aufdringlich, bunt aber nicht knallig. ich
            w&uuml;rde es so lassen.</I></FONT>
          </BLOCKQUOTE>
          Sie ist fast gleichlautend mit vier weiteren &Auml;u&szlig;erungen, nur
          Wolfgang war der Erste und ist deshalb hier stellvertretend erw&auml;hnt. </P>

          <P>Weitere Meinungen &uuml;ber die Tatsache, dass die NoCover weiterhin als
          NoCover lebt, gab es mehrere (eine Gegenmeinung <B>keine</B>). Einer hatte
          in seiner Mail sogar eine Wortsch&ouml;pfung ("<B>Mutivation"</B>)
          einflie&szlig;en lassen, um mir mit dieser Aufgabe auch Mut zuzusprechen.
          Fand ich sehr aufmerksam. In allen Mails klang aber die Hoffnung durch,
          dass die NoCover wirklich weiterhin im Charakter der bisherigen NoCover
          erhalten bleiben m&ouml;ge und dass sie auch noch lange auf dem Markt
          verbleiben solle. </P>

          <P>In diesem Zusammenhang k&ouml;nnte ich nat&uuml;rlich auch &uuml;ber die
          Beteiligungsbereitschaft entsprechende Worte verlieren. Aber wie ihr gerade
          lesen k&ouml;nnt, tue ich dies ja nicht. So nach dem Motto: Wenn ich
          gefragt worden w&auml;re, ob ich mehr Artikel verarbeiten m&ouml;chte,
          h&auml;tte ich gesagt: "Aber gerne". Aber ich bin nicht gefragt worden und
          so sage ich auch nicht, dass die Bereitschaft etwas Geschriebenes
          abzuliefern leider in den letzten NC's etwas schwach ausgepr&auml;gt war.
          Und da ich ja nicht gefragt worden bin, kann ich auch nicht die
          verschiedentlich erhaltenen Ausreden wiedergeben. Aber diesen Monat hat
          sich etwas getan und es haben mich mehr Artikel erreicht, als ich im
          Vorfeld bef&uuml;rchtet hatte. Ist doch ein sehr toller Aufw&auml;rtstrend.
          ;-)</P>

          <P>In Erg&auml;nzung zu meinen niedergeschriebenen Gedanken m&ouml;chte ich
          aber an dieser Stelle allen, die mit ihren Artikeln zur Erhaltung der
          NoCover beigetragen haben und auch weiterhin beitragen wollen herzlich
          danken. Irgendwie habe ich den Verdacht, dass vielen anderen gar nicht mehr
          bewusst ist, was der origin&auml;re Gedanke der NoCover war und ist,
          n&auml;mlich: "Ein Magazin (vormals als DiskMag)<i><b> von Amiga-User
          f&uuml;r Amiga-User.</b></i>" Es war und soll auch weiterhin ein
          entscheidender Unterschied zu allen anderen Mags existent bleiben. Es ist
          kein Problem, ein Magazin mit Hilfe eines festen Redaktionsstammes zu
          erstellen. Aber komischerweise verschwindet eines nach dem anderen und
          manchmal sogar ganz ganz leise (damit es ja nicht so auff&auml;llt). </P>

          <P>Einen weiteren Punkt m&ouml;chte ich ganz klar herausstellen: Ich bin nicht
          gewillt, der NoCover ein "moderneres" Outfit zu verpassen, wie in zwei
          Mails vorgeschlagen wurde, so in die Richtung AmigaGuide, - klar,
          &uuml;bersichtlich, einheitlich. Ob dieser Vorschl&auml;ge war ich doch
          sehr &uuml;berrascht. Denn ich fand gerade die Verschiedenartigkeit der
          Gestaltung der Beitr&auml;ge auflockernd und ansprechend. Dann k&ouml;nnte
          ich auch hergehen, alle Beitr&auml;ge auf den Hintergrund wie gerade hier
          verwendet transferieren und alles sieht dann wie ein Buch aus. Wollt ihr
          wirklich solch eine NoCover???? </P>

          <P>Nat&uuml;rlich wird sich das jetzige Aussehen der NoCover so peu
          &agrave; peu &auml;ndern, wir werden ja auch &auml;lter. Diesmal sind an
          Neuerungen:

          <DL>
          <DT>- Schaltfl&auml;chen, die leer sind, </DT>
          <DD>sind hellgrau und nicht anklickbar. </DD>
          <DT>- Schaltfl&auml;chen mit Inhalt, aber ohne &Auml;nderung zum Vormonat,</DT>
          <DD> sind dunkelgau und anklickbar.</DD>
          <DT>- Schaltfl&auml;chen, die neu oder reaktiviert sind,</DT>
          <DD> sind gr&uuml;n und anklickbar.</DD></DL>
          Jetzt stellt sich die Frage: Sollen leere Rubriken einfach <b>nicht</b> angezeigt
          werden und alte, gel&ouml;schte Rubriken einfach wieder aktiviert werden
          ohne dass dies sichtbar ist? Ich glaube, dies gäbe ein heilloses Durcheinander.
          Wobei ich mir diesmal nicht schl&uuml;ssig war, die ehemalige Rubrik
          "Storygame" zu aktivieren. Der Ansto&szlig; der Reaktivierung, der von
          Rainer (Machine) unternommen wird, habe ich profilaktisch erst einmal
          unter "Games" platziert. Sagt, was ihr wünscht und wie ihr es am liebsten
          haben wollt. </P>

          <P>Hier noch einen Zusatz f&uuml;r die CD-Abonnenten: <BR>
          Wolfgang hat Bonus alle Treiber, die sich bei ihm in den Jahren angesammelt
          haben als DMS-Datei mit beigegeben. Er wei&szlig; leider nicht, ob eventuell
          noch Copyrightsbestimmungen darauf liegen, obwohl die meisten Firmen nicht
          mehr existent sind. Treiber sind aber immer eine gute Sache und so ist jeder
          bei der Weiterverwendung selbst verantwortlich. Die Weitergabe durch Wolfgang
          ist also vorbehaltlich und jeder sollte prüfen, ob Rechte verletzt werden. </P>
           
          <P>Und nun w&uuml;nsche ich viel Spa&szlig; beim Lesen der eingesandten
          Beitr&auml;ge !<BR>
          Wolf.</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

