<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Rainer Thieke -->
    <TITLE>PuzzleBobs</TITLE>
  </HEAD>

  <BODY text="#87CEFA" bgcolor="black" link="green" vlink="green">

    <TABLE border="0" cellpadding="8" width="100%" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#FF0000"><B>Review: PuzzleBobs</B></FONT></H1>
          <HR>

          <CENTER>
            <FONT size="+1"><IMG src="rotmachine.gif" width="27" height="27" alt=""></FONT>
          </CENTER>

          <UL>
            <LI><FONT size="+1"><FONT color="#FF0000"><B>Genre:</B>
            Knobel/Geschicklichkeitsspiel</FONT></FONT></LI>

            <LI><FONT size="+1"><FONT color="#FF0000"><B>Mindestanforderung:</B>
            OS 3.0, 68020 Prozessor, 2 MB Ram</FONT></FONT></LI>

            <LI><FONT size="+1"><FONT color="#FF0000"><B>Hersteller:</B>
            Funtime World / Amiga Arena</FONT></FONT></LI>

            <LI><FONT size="+1"><FONT color="#FF0000"><B>Preis:</B>
            ca. 25 Euro</FONT></FONT></LI>
          </UL>

          <CENTER>
            <FONT size="+1"><IMG src="rotmachine.gif" width="27" height="27" alt=""></FONT>
          </CENTER>

          <P><FONT size="+1">Okay - seien wir einmal ehrlich. Das Tetris-Konzept ist
          mittlerweile so ausgelutscht, das einige schon heftige
          M&uuml;digkeitsattacken bekommen, wenn sie nur den Namen h&ouml;ren. Zwar
          gibt es viele (und zudem auch sehr gute) Vertreter auf kostenloser Basis in
          unserem Aminettle, aber sp&auml;testens dann wenn 30 Tetris-Clone den Platz
          auf der heimischen Festplatte gefunden haben, m&uuml;sste auch der letzte
          Tetris-Junkie so etwas wie Befriedigung f&uuml;hlen. Der indirekte
          Nachfolger "Columns" tummelt sich ebenfalls in vielen Variationen in dem
          PD-Pool herum. Auch hier kann der User auf eine ganze Palette von
          modifizierten Columns-Games zur&uuml;ckgreifen. Auch hier die wichtige
          Erw&auml;hnung: kostenlos ! Dann gibt es noch ein drittes Spielkonzept, das
          &auml;hnlichkeiten zum Urgrossvater Tetris besitzt, aber dennoch mit einer
          eigenst&auml;ndigen, und absolut s&uuml;chtig machenden Spielidee daher
          kommt. "Bust `n Move", ein kleiner Verkaufsschlager auf g&auml;ngigen
          japanischen Spielekonsolen ! Auch hier waren die Freeware-Autoren nicht
          unt&auml;tig und haben dem Amiga einige Versionen beschert, die wahnwitzig
          viel Fun bereiten ! Und das ganze ist folgerndermassen zu ergattern:
          Kostenlos !</FONT></P>

          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27" alt=""> 
            <H2><FONT color="#FF0000"><B>Was kostet die Welt? </B></FONT></H2>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
          </CENTER>

          <FONT size="+1">Das erste Produkt aus dem Hause Funtime World/Amiga Arena
          jedoch schl&auml;gt mit knapp 25 Euro zu Buche. F&uuml;r einen "Bust and
          Move"-Clone doch eine beachtliche Summe, wenn man bedenkt das es bereits
          gutklassige Freeware-Vertreter gibt. Schauen wir also mal, ob das Spiel
          auch wirklich sein Geld wert ist.</FONT>
          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
            <H2><FONT color="#FF0000"><B>Worum geht es? </B></FONT></H2>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
          </CENTER>
          
          <FONT size="+1">Das Ziel dieses Spiels ist eigentlich schnell erkl&auml;rt.
          Alle bunten Blasen, die sich auf dem Bildschirm befinden, m&uuml;ssen von
          selbigen wieder entfernt werden. Das bew&auml;ltigt man, indem man von
          unten ein paar gleichfarbige Blasen nach oben schiesst, so das mehrere
          gleichfarbige dann ("Plopp") verschwinden. Das beschiessen geschieht dabei
          Stufenlos mit einer kleinen Abschussrampe, die wir steuern. Erschwert wird
          das ganze durch ein Zeitlimit, denn die Armarda der grinsenden Killerblasen
          bewegt sich langsam nach unten und hat es, mit triefendem Speichel, auf die
          wohlschmeckende Abschussrampe abgesehen ! Also seht euch vor ! ;-) Haben
          die bunten Ferrero Rochers die Markierung erreicht ist das Spiel
          beendet.</FONT>

          <CENTER>
            <IMG src="gt_puzzlebobs.jpg" alt="">
          </CENTER>

          <FONT size="+1">Zus&auml;tzlich neben dem 1-Spieler-Modus gibt es bei
          PuzzleBobs noch die M&ouml;glichkeit sich mit einem Freund eine Schlacht zu
          liefern. Die entfernten Blasen erscheinen dann auf dem Screen der
          Gegenseite. Diese Spielvariante ist nat&uuml;rlich noch um einiges
          interessanter als wenn man alleine vor dem Computer hockt.</FONT>

          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
            <H2><FONT color="#FF0000"><B>Das Drumherum und das Fazit! </B></FONT></H2>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
          </CENTER>

          <FONT size="+1">Die Grafik ist gehobener Durchschnitt. Zu gefallen wissen
          hier einige der Hintergrundgrafiken -w&auml;hrend die eigentlich
          Spielgrafik jedoch eher zweckm&auml;ssig, aber vollkommen ausreichend, ist.
          &Auml;hnliches gilt auch f&uuml;r die Sounduntermalung -man begn&uuml;gt
          sich mit dem n&ouml;tigsten. Viel interessanter ist dagegen, dass sich
          Puzzlebobs auf wunderbare Art und Weise frei konfigurieren l&auml;sst.
          Eigene Grafiken einbinden ? Die Musik auf Vordermann bringen ? Kein problem
          ! Die Optionen sind hier gewaltig und lassen nicht nur das eigentliche Game
          frei nach Schnauze gestalten, sondern halt auch das drumherum. Aber mal von
          diesen netten Schmankerln abgesehen liegt das Hauptaugenmerk nat&uuml;rlich
          beim Gameplay selber. Und das macht absolut s&uuml;chtig - und ist eine
          Gefahr f&uuml;r jede bestehende Beziehung zu einer "echten Freundin". ;-)
          Trotz, oder gerade wegen, des einfachen Gameplays kann es passieren das man
          Stundenlang nicht mehr von der Strahlenkanone wegkommt - nichts mehr Isst
          -nur noch wiederwillig den Klogang bestreitet - die Freundin ignoriert -
          die Arbeit k&uuml;ndigt - ...okay, ich &uuml;bertreibe ! (grins) Fakt ist,
          Puzzlebobs macht genau wie seine Freeware-Br&uuml;der tierischen Spass !
          Und <B>das</B> ist genau der Haken an der Sache, denn der Vorwurf mit dem
          sich die Entwickler konfrontiert sehen m&uuml;ssen liegt auf der Hand: Hier
          wurde lediglich ein bereits vorhandes Gameplay kopiert ! Das gleiche
          s&uuml;chtig machende Spielprinzip gibt es ebenfalls in einigen netten
          Versionen im Aminet... kostenlos ! Und diese Versionen sind keinen deut
          schlechter gemacht. Warum also sollte man satte 25 Euro f&uuml;r Puzzlebobs
          ausgeben ? Nun, es passt sich allen vorhandenen Systemen an (Grafikkarten
          werden ebenfalls unterst&uuml;tzt), hat diese netten Optionen und einen
          Mehrspielermodus. Wem das nicht Grund genug ist, das Geld zu investieren:
          Finger weg von PuzzleBobs !!! Alle anderen sollten ruhigen Gewissens die
          Demoversion anschnuppern und dann bei gefallen die Vollversion
          kaufen.</FONT>

          <TABLE border="0" align="center" summary="">
            <TR>
              <TD>
                <UL>
                  <LI><FONT color="#FF0000" size="+1"><B><U>PuzzleBobs:</U></B></FONT></LI>
                  <LI><FONT color="#FF0000" size="+1"><B>Grafik:</B> Befriedigend</FONT></LI>
                  <LI><FONT color="#FF0000" size="+1"><B>Musik/Sound:</B> Ausreichend</FONT></LI>
                  <LI><FONT color="#FF0000" size="+1"><B>Langzeitmotivation:</B> Gut</FONT></LI>
                </UL>
              </TD>
            </TR>
          </TABLE>

          <H3 align="center"><A href="mailto:rainermachine@yahoo.de">Rainer "The Machine"
          Thieke</A></H3>

          <CENTER>
            <IMG src="machine.gif" width="400" height="220">
          </CENTER>
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

