<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Raine Thieke -->
    <TITLE>Vulcan Games</TITLE>
  </HEAD>

  <BODY text="#87CEFA" bgcolor="black" link="green" alink="blue" vlink="green">
    <TABLE border="0" width="100%" cellpadding="8" summary="">
      <TR>
        <TD>
          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
            <H1><FONT color="#FF0000">Vulcan Games</FONT></H1>
          </CENTER>
          
          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
          </CENTER>

          <P><FONT size="4">Kennt irgendwer von Euch noch Vulcan Software ? Hebt doch
          mal alle die Hand ! Huch, doch so wenige ? ;-) Allright, ihr k&ouml;nnt die
          Flossen wieder runter nehmen (grins) - Setzen, Eins ! Alle anderen
          m&uuml;ssen nun nachsitzen und ihren Spiele-Horizont durch strenges
          durchlesen dieses kleinen Artikels erweitern ! 8-)</FONT></P>

          <P><FONT size="4">Werfen wir mal einen kleinen Blick zur&uuml;ck in die
          Spiele-Geschichte des Amiga, beginnend mit dem Untergang der einstigen
          Gr&ouml;sse Commodore. Die Jahre 1994/95 waren meines erachtens nicht die
          schlechtesten - und ich konnte zu diesem Zeitpunkt viele nicht verstehen,
          die dem Schlachtruf "Commodore ist tod -schnell `nen PC kaufen" folge
          leisteten. Es erschienen REICHLICH Spiele f&uuml;r den Amiga (verglichen
          mit Heute w&uuml;rde wohl eher der Ausdruck TONNENWEISE passen :-() und
          f&uuml;r mich bestand &uuml;berhaupt kein Anlass zur Verzweiflung. Auch
          wenn der Amiga zu der Zeit "in der Schwebe" stand (ohne Firma) gab es Monat
          f&uuml;r Monat reichlich Software um die Ohren ! Well - bekanntermassen
          &auml;nderte sich das ja im Jahre des Herrn 1997 ... meines Erachtens DAS
          Jahr der harten Geduldsprobe, aufgrund nur weniger, und dazu auch noch
          teils miserabeler, Spieletitel (ausnahmen best&auml;tigen lediglich die
          Regel). Denn bis zum besagtem Jahr waren nahezu alle gr&ouml;sseren
          Softwarepublisher abger&uuml;ckt richtung PC. Die Zukunft des Amiga lag
          halt im argen ungewissen - und keiner der "Grossen" wollte f&uuml;r ein
          System produzieren das nur noch sein dasein in einer kleinen Nische
          fristete. Die Zeit f&uuml;r die "Newcomer" begann zeitgleich mit dem Abgang
          der namenhaften Hersteller. Ein Ph&auml;nomen das man &uuml;brigens schon
          in der Vergangenheit auf dem C64 "bewundern" konnte. Usergroups schlossen
          sich zusammen um den Amiga weiterhin mit Games zu versorgen, ja, sogar
          Familienbetriebe waren darunter (und leider auch Abzocker und Piraten -
          Stichwort: Alive Mediasoft !). Eine dieser Firmen war Vulcan Software. Nun
          t&auml;te man diesen Firmen sicherlich unrecht sie als "KleinBetriebe"
          abzustempeln - als Nutzniesser, die ihre Chance f&uuml;r das schnelle Geld
          wittern. Nein, vielmehr trat das ein, was bereits auf dem Brotkasten
          geschehen war: Die Community r&uuml;ckte n&auml;her zusammen - die
          Spielefirmen waren nicht l&auml;nger unantastbar, sondern bestanden zum
          allergr&ouml;ssten Teil selbst aus eingefleischten Amiganern (z.B. der
          APC+TCP Vertrieb).</FONT></P>

          <P><FONT size="4">Womit ich nun auch (endlich) zu Vulcan Software
          zur&uuml;ck komme. :-) Diese, durchaus sympathische, kleine Firma bescherte
          dem Amiga von mitte bis ende der Neunziger Jahre so einige Softwaretitel,
          bis sie dann wegen mangelndem Absatz doch das Handtuch werfen musste. Aber
          in ihrer Zeit haben Vulcan, und das meine ich vollen ernstes,
          Richtungsweisende Spiele produziert ! Retro-Games k&ouml;nnte man sie
          schimpfen - aber es w&uuml;rde der Wahrheit wohl nicht sehr nahe kommen.
          Alle Vulcan Spiele waren optisch sicherlich nett, aber keinsefalls
          bahnbrechend - geschweige denn revolution&auml;r. Vielmehr besann man sich
          auf das wirklich wichtige: die Spieltiefe - das Gameplay ! Es ist zwar nur
          meine bescheidene Meinung, aber kein einziges Spiel von Vulcan ist schlecht
          (selbst das schlechteste Spiel aus ihrem Hause, "Strangers", macht im
          Zwei-Spieler Modus freude) und viele k&ouml;nnen auch Heute noch fesseln.
          Der Spieletrend 2002 geht eindeutig in Richtung "3D bis zum &Uuml;bergeben"
          und "Leistung, Leistung, Rechnpooooooowwwwweeeerr" - und ist, wie ja einige
          hier wissen, NICHT nach meinem Geschmack. Descent, Heretic, Quake I+II,
          Shogo...Himmel, ich kenne PCler die sind durch diese Spiele richtig
          verbl&ouml;det (und das zu Recht - nach einer halben Stunde Quake wird das
          Oberst&uuml;bchen mindestens so leer wie die Brieftasche :-)). Wer an
          diesen besagten Titeln seine Freude hat -Bitte - ich g&ouml;nne es jedem.
          Ich jedoch vermisse Firmen wie Vulcan, die noch in Eigeniniative eine
          Spielidee ausbr&uuml;teten und sich nicht auf schn&ouml;des
          konvertieren/lizensieren beschr&auml;nkten. Auch im nachhinein kann ich
          hier sagen: das viele Geld (habe nahezu alle Vulcan-Titel im Schrank
          stehen) war prima investiert.</FONT></P>

          <P><FONT size="4">Genug vom Thema abgeschweift. :-) Hier einige Vulcan
          Games, die im &uuml;brigen auch im Internet kostenlos zu ergattern sind,
          mit mehr oder weniger kurzen Spielbeschreibungen.</FONT></P>

          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
            <H2><FONT color="#FF0000"><B>Valhalla I - III</B></FONT></H2>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
          </CENTER>

          <FONT size="4">Gleich zu anfang die wohl umstrittenste Adventure-Reihe auf
          dem Amiga. Im Grunde genommen gibt es nur zwei alternativen bei dieser
          Trilogie: Entweder man liebt Valhalla oder man hasst es abgrundtief ! ;-)
          Die ersten beiden Teile wurden noch kurioserweise via Joystick gespielt -
          und das klappt sogar entgegen der Vermutung wunderbar, da das Szenario in
          der Vogelperpektive dargestellt wird. Per Knopfdruck gelangt man in das
          untere Men&uuml; und kann dort die Interaktionen (anschauen, benutzen,
          sprechen...etc) ausw&auml;hlen und - wenn m&ouml;glich - mit eingesammelten
          Gegenst&auml;nden kombinieren. Leider sind die R&auml;tsel nicht alle sehr
          logisch aufgebaut und erfordern ein wenig "herum probieren". Die Grafik der
          ersten beiden Valhalla Spiele ist zweckm&auml;ssig, die Animationen der
          Charaktere sogar sehr gut, mit viel Liebe zum Detail. Teil III l&auml;uft
          in einer leicht isometrischen Sichtweise ab, ist vom Spielablauf, abgesehen
          von der nun integrierten Maus-Steuerung, jedoch nahezu identisch mit den
          Vorg&auml;ngern. Allerdings ist Valhalla III nach Meinungen vieler der
          schlechteste Teil der Trilogie...und dieser Meinung kann ich mich nur
          anschliessen. Es ist l&auml;ngst nicht mehr so "kultig"...! Richtig komisch
          ist die Sprachausgabe der Hauptakteure, die ihre passenden Kommentare immer
          erst dann abgeben wenn sie richtung Monitor schauen. :-) Sehr witzig
          gemacht, das ganze. Nun, die Valhalla Spiele machen einen Mordsspass - sind
          sehr kurzweilig - und sicherlich prima geeignet f&uuml;r`s "Adventureing"
          zwischendurch.</FONT>
          
          <CENTER>
            <IMG src="vulcan1.gif" width="320" height="256" alt="">
          </CENTER>

          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
            <H2><FONT color="#FF0000"><B>Timekeepers</B></FONT></H2>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
          </CENTER>

          <FONT size="4">Wer der Meinung ist, nach Lemmings gab es einfach kein
          s&uuml;chtig machendes Spielprinzip mehr, der hat wohl Timekeepers verpasst
          ! Dieses Spiel hat mich damals fast `ne Beziehung gekostet, weil ich
          N&auml;chtelang nur noch vor dem Amiga sass und meine damalige Freundin von
          dem "Platoooons Ready ?" schon recht abgenervt war. ;-) Nun, Timekeepers
          ist schnell erlernbar und trotzdem herausfordernd. Es gilt die
          n&uuml;&uuml;dlichen Timekeepers (&auml;hnlichkeiten zu den Lemmingen ist
          rein zuf&auml;llig, nicht wahr !?) zum Ausgang zu bugsieren. Das erreicht
          man in dem man auf dem Terrain, das in der Vogelperspektive dargestellt
          wird, Befehle hinterl&auml;sst. Unsere Timekeepers sind n&auml;mlich, so
          Gott wollte, ziemlich dumm, und fangen schon nach kurzer Zeit an
          orientierungslos geradeaus zu latschen. Also geben wir (als Gott der
          Timekeepers degradiert) Befehle in bestimmte Richtungen zu laufen, zu
          warten, zu springen oder auch mal die Klauen zu wetzen wenn ein Gegner im
          Weg stehen sollte. Oftmals m&uuml;ssen Schalter bet&auml;tigt werden, um
          bestimmte Vorg&auml;nge auf der Karte in Gang zu setzen (Transporter,
          Fallt&uuml;ren, Br&uuml;cken...). Ebenfalls m&uuml;ssen einige Hindernisse
          und Abgr&uuml;nde kollektiv &uuml;bersprungen werden. Die Frage lautet also
          vor jeder Mission: Wo setzen wir welche Befehle - und was f&uuml;r
          auswirkungen hat es dann auf den daherkommenden Timekeeper ? Wehe dem, der
          da nicht mit ausreichend Gehirnschmalz ausgestattet ist...! (grins) Grafik
          und Sound sind im gr&uuml;nen Bereich, wobei es insgesamt 4 unterschiedlich
          dargestellte Zeitzonen gibt die die Keepers bereisen. Wie viele
          Vulcan-Titel kommt auch dieses Game mit einem gewissen Charme daher, was
          die schlichte aber putzige Aufmachung betrifft. Fazit: Leute, dieses Spiel
          MUSS man wenigstens mal probegespielt haben !</FONT>

          <CENTER>
            <IMG src="vulcan2.gif" width="320" height="256" alt="">
          </CENTER>

          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
            <H2><FONT color="#FF0000"><B>The Strangers</B></FONT></H2>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
          </CENTER>

          <FONT size="4">Vulcan`s erstes CD-only Game ! Diese Beat em up-Variante
          kann man am ehesten mit dem C64 Klassiker "Double Dragon" vergleichen. Ist
          es in Spielen wie "Street Fighter II", "Capital Punishment" oder "Mortal
          Kombat" noch &uuml;blich sich gegen einen einzigen Kontrahenten zu
          behaupten, so hat man es bei "The Strangers" gleich mit einer ganzen Gang
          von Schl&auml;gertypen zu tun, die einen den Stiefel in die Allerwertesten
          treten wollen. Der ganze Bildschirm ist eine einzige Gewaltorgie und man
          pr&uuml;gelt sich durch die (ach so b&ouml;sen) Pixelm&auml;nnchen und
          Weibchen ! Dabei kann man nat&uuml;rlich verschiedene Schlag und
          Trittvarianten anwenden oder auch gleich zu Hilfsmitteln greifen, die
          manchmal zu finden sind (Eisenstangen, F&auml;sser...). In jedem Level gibt
          es noch einen Endgegner, der jedoch erst dann auftaucht wenn nahezu alle
          seine Kumpels am Boden liegen und sich nicht mehr r&uuml;hren. Sollte man
          diesen Endkampf verlieren gipfelt die Blutextase in einer brutalen
          Endanimation...! Nunja, viel konnte ich dem Spiel nicht abgewinnen. Die
          Steuerung ist nicht gerade das gelbe vom Ei und der Schwierigkeitsgrad viel
          zu hoch. Erst zu Zweit hat man auch mal die Chance die h&ouml;heren Ebenen
          zu begutachten - und wenigstens auf diese Weise kommt ein wenig Freude auf.
          Die Grafik ist prima und die Figuren excellent animiert... da gibt es gar
          nichts zu beanstanden. Auch die Musik ist klasse ! Die Sfx reichen von den
          &uuml;blichen Kampfger&auml;uschen bis hin zu derben Spr&uuml;chen der
          Endgegner. Das drumherum stimmt - nur am Inhalt h&auml;tte man noch etwas
          arbeiten sollen. Defintitiv das schlechteste Release aus dem Hause
          Vulcan.</FONT>

          <CENTER>
            <IMG src="vulcan3.gif" width="320" height="256" alt="">
          </CENTER>

          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
            <H2><FONT color="#FF0000"><B>Final Odyssey</B></FONT></H2>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
          </CENTER>

          <FONT size="4">The Final Odyssey wirkt wie ein Bastard aus "Chaos Engine"
          und diversen Puzzle-Games, die anfang der Neunziger erschienen sind - aber
          das im positiven Sinne. :-) In einer leicht isometrischen Sicht k&auml;mpft
          man sich durch ein mittelalterliches Szenario, bet&auml;tigt Schalter,
          l&ouml;st Teleporter und (versehentlich nat&uuml;rlich) Fallen aus, findet
          versteckte G&auml;nge und muss des &ouml;fteren diverse Puzzles l&ouml;sen
          um &uuml;berhaupt vorran zu kommen. Das Game hat wirklich alles was Action
          Spiele der Marke "Bitmap Brothers" und "Team 17" immer ausgezeichnet hat
          und kommt auch (wen wundert`s) optisch den Vorbildern "Chaos Engine",
          "Magic Pockets" und "Gods" sehr nahe. Sprich: Gute, alte (nicht zu
          verwechseln mit altmodische) Gfx im 2D-Kunterbunt-alles-geht-Amiga-Rulez-
          Stil. :-) Gute Musikuntermalung und Soundeffekte schmeicheln ebenfalls
          unser Sinnesorgan. Was will man mehr !? Eine Fortsetzung ? Gibbet nich !
          (heul)</FONT>  
        </TD>
      </TR>
    </TABLE>

    <TABLE border="0" width="100%" summary="">
      <TR>
        <TD>
          <CENTER>
            <IMG src="vulcan4.gif" width="640" height="256" alt="">
          </CENTER>
        </TD>
      </TR>
    </TABLE>

    <TABLE border="0" width="100%" cellpadding="8" summary="">
      <TR>
        <TD>
          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
            <H2><FONT color="#FF0000"><B>Hillsea Lido</B></FONT></H2>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
          </CENTER>

          <FONT size="4">Diese Wirtschaftssimulation mit Echtzeit-Ambiente (a la
          Theme Park) ist, genau so wie die Valhalla-Trilogie, eine reine Frage des
          Geschmacks. Ziel ist der Aufbau eines Strandes und der dazugeh&ouml;rigen
          Promenade. Um nun aus dem Startkapital schnellstm&ouml;glich ein
          stattliches Verm&ouml;gen zu machen, investieren angehende Strand-Manager
          (urgs ;-)) in Gesch&auml;ften auf der Promenade ! Wir bauen uns diverse
          Fress- Trink- S&uuml;ssigkeiten- und Gimmickbuden auf, bestimmen die Preise
          und hoffen auf zahlreiche Kundschaft...die nat&uuml;rlich nur kommt, wenn
          auch der Strand einiges zu bieten hat. Diesen kann man ebenfalls aufbessern
          (Liegest&uuml;hle, Toiletten, Umkleidekabinen, diverse Leihgesch&auml;fte
          f&uuml;r Gummiboote, Taucheranz&uuml;ge usw...). Lagerbest&auml;nde
          m&uuml;ssen regelm&auml;ssig aufgef&uuml;llt werden, die Buden sollten
          gepflegt werden, Sonntag-Abend Shows k&ouml;nnen gebucht werden - dazu
          kommt noch die M&ouml;glichkeit w&ouml;chentliche Preisgelder zu gewinnen
          (u.a auch dann wenn die Promenade h&uuml;bsch mit Str&auml;uchern,
          Sitzgelegenheiten und &auml;hnlichem verziert wurde)...das Spektrum von
          Hillsea Lido ist somit schon recht ausgewogen, wenn auch l&auml;ngst nicht
          so gewaltig wie z.B in Theme Park. Diese "Seebad-Strandmanager-Simulation"
          macht sehr viel Spass. Langsam aber sicher baut man sich St&uuml;ck
          f&uuml;r St&uuml;ck eine Promenade auf, wie sie selbst die beste Gegend
          Spanien`s nicht zu bieten hat ;-)...und &uuml;bersch&uuml;ssiges Geld
          stecken wir (zum wohle der Besucher) in den Strand. Nur leider haben es die
          Programmierer verpennt dem Spiel einen durchwachsenen Schwierigkeitsgrad zu
          verpassen - dieses Game sollte selbst dem gr&ouml;ssten Vollidioten noch zu
          einfach sein. ;-) Wenn man in Hillsea Lido regelm&auml;ssig Shows bucht
          (und warum sollte man das nicht tun ?) ist eines gewiss: Profit ! Man wirbt
          ausreichend f&uuml;r eine Show die Sonntag Abends l&auml;uft - und kassiert
          massig imagin&auml;res Geld ab - das man dann die Woche darauf in die
          Gesch&auml;fte investiert...und so geht`s dann halt immer weiter.
          V&ouml;llig irrelevant ob nun die einzelnen Gesch&auml;fte viel einbringen
          oder nicht...! Das dabei nicht gerade der Manager in einem gefragt ist,
          d&uuml;rfte klar sein - und so hat man Hillsea Lido sp&auml;testens an
          einem Wochende durchgespielt (sprich: alles aufgebaut, was es aufzubauen
          gilt - und somit d&uuml;rfte der Reiz verflogen sein). Die Grafik ist hier
          einmal mehr "knuffig" (Vulcan-like), und stellenweise auch lustig
          anzusehen. Die Soundeffekte wirken dagegen nur herzlos zusammengestellt und
          k&ouml;nnen noch nicht einmal die Katze hinter dem Ofen hervor locken.
          Kurzweilig ist dieses Game, keine Frage ! So etwas wie Langzeitmotivation
          wird man aber niemals mit Hillsea Lido in Verbindung bringen k&ouml;nnen.
          It`s nice - but nothing more !</FONT>

          <CENTER>
            <IMG src="vulcan5.gif" width="320" height="256" alt="">
          </CENTER>

          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
            <H2><FONT color="#FF0000"><B>Burnout</B></FONT></H2>
            <IMG src="rotmachine.gif" width="27" height="27" alt=""></FONT>
          </CENTER>

          <FONT size="4">Au Weia ! Eigentlich kann ich Burnout im Single-Player Modus
          &uuml;berhaupt nichts abgewinnen ! Es ist eines der wenigen Spiele, das
          alleine das reinste intravin&ouml;s eingef&uuml;hrte Valium ist - zu zweit
          oder dritt jedoch das Fazit "Mords-Gaudi" verdient ! Worum geht es ? Nun,
          das ist recht schnell erkl&auml;rt: Auf einer Plattform bek&auml;mpfen sich
          die verschiedensten Fahrzeuge. Bek&auml;mpfen bedeuten bei diesem Spiel
          dann der Versuch die Gegner von dieser Plattform herunter zu stossen. Dabei
          besitzen die 4 verschiedenen Fahrzeuge alle eine unterschiedliche Steuerung
          und Panzerung - und auch die Wucht beim "rammen" ist unterschiedlich. In
          einem Tunier mit wahlweise Computeroder menschlichen Mitstreitern kann man
          zudem Geld verdienen, das man dann in zus&auml;tzliches Tuning respektive
          in zus&auml;tzlich am Wagen angebrachte Metallplatten oder "Spikes" stecken
          kann. Nat&uuml;rlich hat man auch hier die M&ouml;glichkeit einige nette
          Extras einzukaufen (einen Turboboost, der den Wagen f&uuml;r kurze Zeit zu
          einem Ramm-Geschoss in Lichtgeschwindigkeit macht - einen "Nebelerzeuger",
          um die Gegner orientierungslos zu machen -ein Tool, um den Wagen f&uuml;r
          einen Zeitraum unber&uuml;hrbar zu machen...). Dieses Tunier-Spiel ist auch
          gleichzeitig die interessanteste Variante bei Burnout, da man sich so
          langsam hocharbeitet und am Ende einen (hoffentlich) unschlagbaren Wagen
          unter dem Ges&auml;ss hat ! :-) Die Grafik ist h&uuml;bsch - nichts
          spektakul&auml;res, aber dennoch hochaufl&ouml;send -und auch der Sound
          (goile Titelmusik) ist okay. Im Aminet gibt es im &uuml;brigen
          zus&auml;tzliche Arenen und Fahrzeuge...ein Download lohnt sich ! Und, wie
          bereits gesagt, man sollte dieses Game nur mit einem Kumpel geniessen -
          zumal auch die Computer keine grosse KI mit auf dem Weg bekommen haben
          (Dumm wie Brot :-)). Also, ich kann mich noch gut an ein laaanges
          Wochenende erinnern wo ein Freund und ich n&auml;chtelang Burnout gezockt
          haben - und nachher so &uuml;berm&uuml;det waren, das wir selbst &uuml;ber
          die d&uuml;mmsten Bemerkungen heulend am Boden lagen vor lachen. Soll
          vorkommen... :-). Test It !</FONT>

          
          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
            <H2><FONT color="#FF0000"><B>Tiny Troops</B></FONT></H2>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
          </CENTER>

          <FONT size="4">Aaaarrmmaaagedddooonnn ! :-) Die "niedlichen Truppen" sind
          die wohl harmloseste, und demzufolge auch Kinderfreundlichste, Variante
          eines Dune II-Verschnitts. Wobei es im Gegensatz zu dem Echtzeit-Strategie
          Klassiker nicht um den Aufbau einer Kriegsflotte geht, sondern schlicht und
          einfach um die Zerst&ouml;rung der Gegner. Bei diesem Spiel befinden sich
          zwei Ausserirdische Rassen im erbarmungslosen Krieg - da jedoch ihr
          Heimatplanet keine weiteren Ersch&uuml;tterungen ertragen k&ouml;nnte,
          setzt man den Zerst&ouml;rungswahn einfach mal eben auf der Erde fort. Und
          weil die "Tiny Troops" nunmal im Vergleich zum Menschen...uhmm...eher
          Insektenartige Gr&ouml;sse erreichen, bombardiert man sich in den
          Vorg&auml;rten der H&auml;user, im Sandkasten oder auch mal im Kinderzimmer
          (?). Dies sind dann auch einige der Szenarien, in denen man agieren darf.
          Vergleiche zwischen "Dune II" und "Cannon Fodder" sind hier durchaus
          angebracht. Es ist wichtig jedem einzelnem Level mit einer bestimmten
          Taktik entgegenzutreten, anstatt einfach wild drauflos anzugreifen - alle
          Level sind mehrere Bildschirme gross, besitzen zus&auml;tzliche Hindernisse
          die man &uuml;berwinden muss und Fallen/T&uuml;cken der Gegner, weswegen
          der Stratege in einem gefragt ist. Warum dieses Spiel keinen grossen
          Anklang bei der Userschaft gefunden hat, bleibt mir ein R&auml;tsel. Es
          macht tierischen Spass und kann tagelang vor den Monitor bannen - obwohl
          das Spielprinzip so "einfach" ist. Vielleicht lag es an der Steuerung, die
          doch schon einiges an einarbeitungszeit ben&ouml;tigt und stellenweise
          recht wiederspenstig ist (und manchmal einfach nicht reagiert). Kann man
          sich mit diesem Manko jedoch abfinden, dann bekommt man einiges geboten.
          Die Grafik ist f&uuml;r ECS-Verh&auml;ltnisse richtig gut (wieder einmal
          mit Niedlichkeitsfaktor 10 :-)), und mit Hang zu kleinen Details umgesetzt
          worden - auch der Sound ist okay. Falls jemand "Tiny Troops" noch nicht
          kennen sollte: Unbedingt mal eine Probeschlacht wagen !</FONT>

          <CENTER>
            <IMG src="vulcan6.gif" width="320" height="256" alt="">
          </CENTER>

          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
            <H2><FONT color="#FF0000"><B>Uropa 2</B></FONT></H2>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
          </CENTER>

          <FONT size="4">Nun, auch auf die Gefahr hin das es langweilig wird: Hier
          noch ein weiteres starkes Spiel aus der Vulcan-Reihe :-). Bei Uropa 2
          verschl&auml;gt es uns in eine Zukunft, die die Menschen mit Hilfe von
          Droiden in scheinbar sicheren H&auml;nden hat. Als jedoch eine bestimmte
          Rasse dieser Roboter (die Kapones), scheinbar wegen durchgeknallter
          Schaltkreise, verr&uuml;ckt spielen und sowohl Menschen als auch ganze
          Basen unter ihre Kontrolle bringen, ist es Zeit f&uuml;r den Arnold
          Schwarzenegger der Droiden. Hmpf - so oder so &auml;hnlich jedenfalls. :-)
          In der Rolle dieses Blechheinis ist es nun also die Aufgabe des Spielers 10
          Missionen (plus eine zus&auml;tzliche bei erfolgreicher Abschliessung) zu
          bew&auml;ltigen. Das Spiel wechselt von einer 3D-Iso Sichtweise
          (Action-Adventure) hin zu einer auf Vektorgrafik basierenden 3D-Schlacht
          auf der Oberfl&auml;che des Planeten - und je nach Aufgabenfeld heisst es
          dann etwas auf dieser Oberfl&auml;che zerst&ouml;ren, oder im
          Adventure-Teil Aufgaben zu l&ouml;sen und Kapones zu eleminieren. Wobei die
          Missionen auf der Oberfl&auml;che nicht wirklich spass machen und es
          (zumindest auf meinem Rechner) des &ouml;fteren mal zu einem Totalabsturz
          kam, wenn sich die Polygenen auf dem Bildschirm h&auml;uften. :-( Nein,
          richtig interessant sind die eigentlichen Adventure-Missionen, bei denen
          man seinen Droiden durch die R&auml;ume f&uuml;hrt. Geiseln m&uuml;ssen
          befreit und via Teleporter in Sicherheit gebracht werden, Generatoren
          repariert und Geheimverstecke der Kapones-H&auml;uptlinge gefunden werden.
          Das ganze wird Story-m&auml;ssig innerhalb der einzelnen Missionen voran
          getrieben und man kann sich z.B. interessante Aufzeichnungen aus den
          Computern runterladen. Forschungen werden ab einem sp&auml;teren Zeitaum
          ebenfalls gef&uuml;hrt - so muss man z.B K&uuml;hlmittel herstellen um
          damit den angeschlagenen Generator in Gang setzen zu k&ouml;nnen. Dabei
          bleibt es aber selbst f&uuml;r Laien immer nachvollziehbar, welcher Schritt
          nun als n&auml;chstes get&auml;tigt werden muss. Innerhalb der Basen findet
          man noch Terminals, wo man sein Arsenal an Extras und Hilfsmitteln
          aufstocken kann und auch (und hier bekommt das Spiel einen Hauch von
          Rollenspiel) die Waffen ergattern und individuell aufr&uuml;sten kann. Das
          ben&ouml;tigte Kleingeld bekommt man durch abschliessen der Missionen oder
          durch Datentransfer mit den Kapones (zwei bestimmte Waffen erlauben das
          deaktivieren der Gegner, ohne das sie vollkommen zerst&ouml;rt werden -und
          dadurch kann man ein paar Megabytes an Daten von ihnen stehlen, die sich
          wiederrum zu reinem Geld machen lassen). Uropa 2 ist vielf&auml;ltig,
          spannend inszeniert und das Game vermag es den User in eine kalte,
          bedrohliche, computerisierte Atmosph&ouml;re hineinzutauchen. Der
          Schwierigkeitsgrad ist ausgewogen -wobei die erste Mission schon recht
          kniffelig, die darauffolgenden jedoch mit einem von leicht bis heftig
          ansteigendem Grad zu fesseln wissen. Der Action-Part, der Kampf mit
          gegnerischen Droiden, ist ebenfalls gelungen. Einzig die Flugmissionen
          h&auml;tte man doch lieber ad Acta legen sollen und das komplette Spiel
          stattdessen auf ein pures Action-Adventure ausbauen sollen. Die Grafik ist
          eher durchschnittlich - ein wenig farbarm - und hin und wieder vermisst man
          doch ein wenig Abwechslung in den meist grafisch gleich aufgebauten
          R&auml;umen. Die auf Vektorgrafik basierenden Flugmissionen sind ebenfalls
          nicht das Gelbe vom AGA-Amiga. ;-) Die Sprachausgabe, die einem
          fortw&auml;hrend des Spieles begleitet, und die Sfx tun ihr bestes zur
          Atmosph&ouml;re bei. Daumen Hoch ! Ein faszinierendes Spiel !</FONT>

          <CENTER>
            <IMG src="vulcan7.gif" width="320" height="256" alt="">
          </CENTER>

          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
            <H2><FONT color="#FF0000"><B>Bograts &amp; Jet Pilot</B></FONT></H2>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
          </CENTER>

          <FONT size="4">Tja, &uuml;ber diese beiden Games kann ich leider nichts
          schreiben, da ich sie mir nie gekauft habe. Bograts ist ein Jump `n run mit
          leichtem Strategietouch -und Jet Pilot eine Flugsimulation. Auf diese
          beiden Games werde ich sicherlich noch sp&auml;ter einmal zur&uuml;ck
          kommen, da sie, soweit ich informiert bin, mittlerweile frei
          erh&auml;ltlich sind.</FONT>

          
          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27" alt="">
            <H2><FONT color="#FF0000"><B>Der  Schwanengesang...!?</B></FONT></H2>
            <IMG src="rotmachine.gif" width="27" height="27" alt=""></FONT>
          </CENTER>

          <FONT size="4">Wie wichtig eine Firma f&uuml;r das jeweilige Computersystem
          ist, wird meist erst dann klar, wenn diese Firma nichts mehr f&uuml;r den
          Lieblingscompi produziert. :-( Wie heisst es so sch&ouml;n-schrecklich ?
          You`ll Never Miss It, `til It`s Gone Away ! Vulcan Software haben
          unheimlich VIELE Spiele in ihrer doch relativ kurzen Schaffenszeit
          herausgebracht (und gr&ouml;sstenteils sogar selbst programmiert - Paul
          Carrington war ein absoluter Crack in Sachen Amiga) ! Und das waren
          keinesfalls irgendwelche Billigproduktionen, sondern auf Qualit&auml;t und
          Spielfreude setzende Games wie ich sie mir Heute mehr denn je w&uuml;nschen
          w&uuml;rde bei dem Boom an Sachen, die schon nach einer halben Stunde
          anfangen langweilig zu werden. Nicht vergessen sollte man auch das Vulcan
          den Weg f&uuml;r "Genetic Species" und "Wasted Dreams" ebneten - wer weiss
          ob diese Spiele ohne den anf&auml;nglichen Support von Vulcan jemals das
          Licht der Amigawelt erblickt h&auml;tten. Und wer weiss schon was uns
          Vulcan noch f&uuml;r zahlreiche Softwareperlen beschert h&auml;tten, wenn
          sie dem Amigamarkt erhalten geblieben w&auml;ren.</FONT>

          <P><FONT size="4"><B>In diesem Sinne:</B> ThanX Paul &amp; Lisa Carrington !
          a.k.a Vulcan Software ! (Familienbetriebe rulen ;-))</FONT></P>

          <CENTER>
            <H3><A href="mailto:rainermachine@yahoo.de">Rainer "The Machine" Thieke</A></H3>
          </CENTER>

          <CENTER>
            <IMG src="machine.gif" width="400" height="220" alt="">
          </CENTER>

          <H2 align="center"><A href="javascript:history.back()"><B>zur&uuml;ck</B></A></H2>
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

