<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Daniel (Antodote) -->

    <TITLE>Interview mit Stephen Fellner</TITLE>
  </HEAD>

  <BODY background="wolf1.gif" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE border="0" cellpadding="8" width="100%" summary="">
      <TR>
        <TD>
          <CENTER>
            <H1><B>Interview mit Stephen Fellner (RiVA)</B></H1>
            gef&uuml;hrt von Antidote via email
          </CENTER>

          <P><B><I>Hier nun mein erstes Interview f&uuml;r die NoCover. Geschrieben
          habe ich mit Stephen Fellner, dem Entwickler von RiVA. Da RiVA gerade im
          Aminet in der Version 0.47 erschienen ist und es verdammt gut auf meinem
          68k l&auml;uft, kam mir die Idee dem Programmierer mal zu schreiben. Da er
          prompt geantwortet hat, wollte ich es mal mit einem kleinen Interview
          probieren.<BR> Okay, lets go:</I></B></P>

          <P><B><FONT color="#006000">NC: Bitte stell Dich erstmal unseren Lesern vor
          (Alter, Hobbys, wo Du wohnst und erz&auml;hle uns alles &uuml;ber Dein
          Privatleben ;-)</FONT></B><BR> SF: Ich bin 25 und bin letztes Jahr wieder
          in mein Heimatland nach Budapest (Ungarn) zur&uuml;ckgezogen, wo ich auch
          zur Zeit lebe. Ich arbeite bei Siemens. Meine Hobbys sind Computer,
          Elektronik und Musik. W&uuml;rde ich &uuml;ber mein Privatleben
          erz&auml;hlen, w&uuml;rde es nicht l&auml;nger Privat sein, oder? :)</P>

          <P><B><FONT color="#006000">NC: Seit wann hast Du Kontakt mit Computern und
          welcher ist f&uuml;r dich der Favorit darunter??</FONT></B><BR> SF: Ich
          habe meinen ersten Computer so 1986 bekommen, welches ein Commodore 16 war.
          Sp&auml;ter gefolgt von einem C=64, dann ein A500Plus, A1200, usw... Heute
          habe ich nahezu jedes Amigamodell. Ich habe keinen speziellen Favoriten.
          Alle haben f&uuml;r sich etwas Besonderes.</P>

          <P><B><FONT color="#006000">NC: Wie sieht Deine Computerkonfiguration aus??
          Welche Software benutzt Du am Meisten?</FONT></B><BR> SF: Mein Hauptrecher
          ist ein A4000 mit einer CSPPC604/180+060/50, PicassoIV und CVPPC (meistens
          benutze ich die PIV) und AmigaOS 3.9. Haupts&auml;chlich benutze ich
          Internet-Anwendungen und Software-Entwicklertools (MiamiDX, IBrowse2.2,
          YAM, Devpac,AsmPro, GCC, Stormc4, etc...)</P>

          <P><B><FONT color="#006000">NC: Okay, lass uns &uuml;ber Dein Amigaprogramm
          RiVA schreiben!! Was ist RiVA f&uuml;r ein Programm und wer sollte es
          benutzen bzw. braucht es ??</FONT></B><BR> SF: Es ist ein schneller 68k
          MPEG Video Player, sonst nichts. Wer sollte es benutzen?? Leute, die keinen
          PPC Prozessor haben, aber trotzdem MPEG Videos in einer annehmbaren
          Geschwindigkeit schauen wollen.</P>

          <P><B><FONT color="#006000">NC: Wie lange arbeitest Du schon an dem
          Programm und seit wann??</FONT></B><BR> SF: Die Entwicklung von RiVA hat
          1997 begonnen. Es musste von Anfang an entwickelt werden und lange Zeit
          gedauert bis es ein voll-funktionsf&auml;higer Player wurde!! <I>(Anm.: Der
          Player wurde komplett in Assembler programmiert)</I></P>

          <P><B><FONT color="#006000">NC: Was gedenkst Du noch an RiVA zu verbessern
          (gibt es da &uuml;berhaupt noch was zu verbessern??)??</FONT></B><BR> SF:
          Es gibt immer noch Platz f&uuml;r Verbesserungen. Zur Zeit suche ich nach
          einer M&ouml;glichkeit die Wiedergabe-Geschwindigkeit zu verbessern. Obwohl
          ich dachte das es nicht schneller laufen w&uuml;rde, glaube ich, dass es
          das doch kann. Auch m&ouml;chte ich noch das Seek-Feature mit einbauen. Es
          ist allerdings etwas schwierig wegen der Architektur (hook-based) von
          mpega.</P>

          <P><B><FONT color="#006000">NC: Was ist das Besondere an
          RiVA??</FONT></B><BR> SF: Es ist haupts&auml;chlich die Geschwindigkeit auf
          68k Rechnern, die ihm einen Vorteil gegen&uuml;ber anderen Abspielern
          verschafft.</P>

          <P><B><FONT color="#006000">NC: Wie sieht es mit der Resonanz in Bezug auf
          RiVA aus??</FONT></B><BR> SF: Resonanz??</P>

          <P><B><FONT color="#006000">NC: Hast Du zuvor schon andere Programme
          f&uuml;r den Amiga geschrieben?? Hast Du schon Pl&auml;ne f&uuml;r andere
          Amigaprojekte??</FONT></B><BR> SF: Ich habe schon eine Menge kleinerer
          Programme auf dem Amiga gemacht, die aber nie ver&ouml;ffentlicht wurden.
          Ich habe mich entschlossen eine Webseite zu machen, wo ich dann einige der
          Programme &ouml;ffentlich anbieten will. Ebenso habe ich bei einigen
          anderen Amiga-Projekten mitgearbeitet. Einen Teil meiner Arbeit k&ouml;nnt
          Ihr im MooVID Video-Player finden (Fast Render Algorithmen, wie dem STORM
          Dither f&uuml;r AGA und die Fast Hicolor Routinen). Ich habe auch den 3ivx
          Video Codec auf den Amiga portiert (68k und WOS Versionen). Weiterhin habe
          ich noch bei der PPC Version der avcodec.library f&uuml;r MooVID
          geholfen.</P>

          <P>Ich plane einige neue Software-Projekte, haupts&auml;chlich f&uuml;r PPC
          und AmigaOS4.</P>

          <P><B><FONT color="#006000">NC: K&ouml;nntest Du Dir vorstellen den
          AmigaOne oder Pegasos in Zukunft zu unterst&uuml;tzen?? Spielst Du
          vielleicht auch mit dem Gedanken Dir einen dieser Rechner zu
          kaufen??</FONT></B><BR> SF: Ich werde AmigaOS4 unterst&uuml;tzen, genauso,
          wie jede Hardware, wo es drauf l&auml;uft.</P>

          <P><B><FONT color="#006000">NC: Was denkst Du &uuml;ber die "Entwicklung"
          der letzten (50 ;-) Jahre von Amiga Inc. &amp; Co??</FONT></B><BR> SF:Die
          letzten paar Jahre waren ermutigener als jede Entwicklung nach Commodores
          Bankrott 94. Wenn sie es hinbekommen ihre Pl&auml;ne zu erreichen, steht
          uns eine sehr interessante Zeit bevor. :-)</P>

          <P><B><FONT color="#006000">NC: Ok, was l&auml;uft so mit der Amiga-Szene
          in Neuseeland (!!)?? Um Dir die Wahrheit zu sagen ... habe ich bis jetzt
          nichts &uuml;ber eine Amigaszene in Neuseeland geh&ouml;rt!!
          :(</FONT></B><BR> SF: Wenn Ihr an der Amiga-Pr&auml;senz in Neuseeland
          interessiert seit, werft mal einen Blick auf <A href=
          "http://www.titan.co.nz/amigaak" target=
          "_NEW">www.titan.co.nz/amigaak</A></P>

          <P><B><FONT color="#006000">NC: Die letzten Worte geh&ouml;ren Dir!! Nimm
          Deine Chance wahr und erz&auml;hle uns Deine W&uuml;nsche, Gr&uuml;sse oder
          sonstwas (Es lesen mindestens 2 Leute oder mehr ;-):</FONT></B><BR> SF: Ich
          m&ouml;chte der ganzen Amiga Community danken, inklusive den Usern und
          Entwicklern, die diese Plattform am Leben erhalten!</P>
          <HR>

          <DIV left="">
            <B>Download und Kontakt:</B>
          </DIV>

          <P><B>Aminet:</B>
          <A href="ftp://de.aminet.net/pub/aminet/gfx/show/RiVA.lha">RiVA.lha</A><BR>

           <B>Email Stephen Fellner:</B>
           <A href="mailto:riva@aioworld.com">riva@aioworld.com</A></P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

