<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Kilian Servais -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="nc_bg3.gif" text="#000000" link="#0000ff"
  alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P><FONT color="#000080" size="7"><B>Hi zusammen!</B></FONT></P>

          <P>Die letzte Ausgabe der NoCover entstand aus einer komischen Situation
          heraus, die f&uuml;r viel Verwirrung sorgte. Alleine das Stichwort
          GetBoinged sollte an dieser Stelle reichen. Trotzdem ist es ziemlich
          beachtlich, was Wolf Zimmer da erreicht hat und ich bin mir sicher, dass
          sich die NC hier in guten H&auml;nden befindet.</P>

          <P>Allerdings m&ouml;chte ich noch ein wenig auf den quasi Leserbrief von
          Cord Hagen aus der letzten Ausgabe eingehen und einige Dinge kommentieren
          bzw. aus meiner Sicht darstellen:</P>

          <BLOCKQUOTE>
          Es kommt dann darauf an, ob man zu den Menschen geh&ouml;rt, die dann
          ihre Pl&auml;ne trotzdem weiter konsequent verfolgen oder ob man sich sagt
          - "wenn es scheinbar niemanden interessiert, warum sich dann noch weiter
          Arbeit machen?". Andreas ist so ein Mensch. F&uuml;r ihn ist nicht
          abh&auml;ngig, wieviele Menschen sich f&uuml;r etwas interessieren, er
          zieht etwas Angefangenes konsequent durch, auch wenn es schwer f&auml;llt.
          Bei Kilian war ich mir schon nicht mehr ganz so sicher. Er hat viel
          M&uuml;he und Arbeit in das Magazin gesteckt, aber wird er auch damit
          zurecht kommen, wenn kaum Beitr&auml;ge kommen, wenn niemand schreibt, dass
          er gerne die NC liest und froh ist, dass sich jemand darum
          k&uuml;mmert?
          </BLOCKQUOTE>

          <P>Klar, Andreas hat das Magazin aufgebaut und viel Energie da
          hineingesteckt. Auch zieht er seiner Dinge konsequent durch - gar kein
          Thema. Ob das nun sinnvoll ist, steht auf einem anderen Blatt. Allerdings
          lag es in meinem Fall nicht etwa an den wenigen Beitr&auml;gen, die
          eingetrudelt sind, sondern schlicht und ergreifend an Zeitproblemen. Ich
          hatte versucht, die NC zu erneuern und einen neuen Leserkreis zu
          erschlie&szlig;en, was nicht gelungen ist. Lediglich die Umwanldung in ein
          Freeware Mag ist mir gelungen, aber zahlreiche andere Ans&auml;tze konnten
          nur bedingt durchgsetzt werden, wo das oben erw&auml;hnte Zeitproblem in`s
          Spiel kommt. Als ich die NC &uuml;bernahm war ich Zivi und hatte
          gen&uuml;gend Zeit zur Verf&uuml;gung - inzwischen hat man Studium begonnen
          und danebene arbeite ich noch an der AmigaPlus sowie einem
          gr&ouml;&szlig;eren Musik Magazin mit, was weitaus zeitintensiver ist, als
          sich manche Leute vorstellen. Hinzu kommen drei Radiosendungen, die
          zeitlich ebenfalls stark in`s Gewicht fallen und da blieb f&uuml;r die NC
          zum Schluss nur noch wenig Zeit. Klar h&auml;tte ich weiter machen
          k&ouml;nnen, aber wozu ein halbherzig gef&uuml;hrtes Magazin herausbringen,
          was selbst der Chefredakteur als Klotz am Bein empfindet? Darin sehe ich
          echt keinen Sinn - und hielt es folgerichtig f&uuml;r sinnvoll, hier einen
          Schlusstrich zu ziehen!</P>

          <P>Als ich dann noch erfuhr, dass Andreas Magerl nicht einmal ansatzweise
          zuvor darauf angesprochen wurde, fand ich das dann auch alles schon gar
          nicht mehr so nett. Er hatte seinerzeit die NoCover in "gute H&auml;nde"
          abgeben wollen, damit sie noch lange Zeit weiter existiert. Und
          pl&ouml;tzlich erf&auml;hrt er davon in den Amiga-News, dass es zwar die
          NoCover nicht mehr gibt, aber die GetBoinged mit ganz anderem Ziel und
          Konzept erscheint. Jungs, das ist aber auch nicht die feine Art!</P>

          <P>Da ist in der Tat einiges schief gelaufen, aber auch ich erfuhr nur
          durch Amiga-News.de, dass die NC unter Thorsten Schl&ouml;zel
          umstrukturiert werden sollte. Vorher war lediglich abgesprochen, dass er
          die NoCover &uuml;bernimmt - und zwar so, wie sie ist. Insofern konnte ich
          Andreas gar nicht darauf hinweisen. Und Andreas hat dann gleich den Fehler
          gemacht, eine absolut &uuml;berzogene Newsmeldung zu posten, anstatt alles
          per E-Mail zu kl&auml;ren, was wesentlich einfacher gewesen w&auml;re. So
          erschien die NC in keinem guten Licht und solche kindlichen Streiterein
          geh&ouml;ren auch nicht auf Amiga-News.de, wo schon viel zu viele dieser
          Streitereien von statten gehen - da m&ouml;chte ich mich nicht auch noch in
          die lange Liste an Egomanen im Amiga Bereich einreihen.</P>

          <P>Das ist zumindest meine Sicht der Ding - und damit, so denke ich, kann
          das Kapitel NoCover f&uuml;r mich als Chefredakteur geschlossen werden. Ich
          werde versuchen, von Zeit zu Zeit Artikel einzureichen und damit meinen
          Beitrag zum Erhalt der NC beitragen. Die Zeiten, in denen ich monatlich
          aber 10 Artikel geschrieben habe, sind defintiv vorbei.</P>

          <P>See ya,<BR>
           Kilian</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

