<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf an J&uuml;rgen</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink=
  "#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="6"><B>Wolf an
          J&uuml;rgen</B></FONT></P>

          <P><FONT size="+1"><B>Hallo J&uuml;rgen!</B></FONT></P>

          <P><FONT color="#008000"><I><b>ich habe deinen Rat aus der NC 102 befolgt und
          die Autofahrerpartei auf ihrer Homepage www.autofahrerpartei.de
          "besucht".</b></I></FONT></P>

          <P>Wie du in der Vergangenheit wohl schon festgestellt hattest, versuche
          ich je Monat einen anderen Schwerpunkt meiner Beitr&auml;ge zu setzen. So
          war es diesmal die bevorstehende Wahl. In den TV-Sendungen waren alle
          Aspekte zum x-ten Male durchgekaut und jeder hat alles schon zig-fach
          geh&ouml;rt, also nichts f&uuml;r ein Monatsmagazin. Aber wenn eine Partei
          behauptet, gem&auml;&szlig; Umfrage als drittst&auml;rkste Partei in der
          Parteienlandschaft zu rangieren und keiner spricht dar&uuml;ber, da wird es
          doch Zeit mal nachzuhaken. Das Ergebnis hast du ja hautnah auf deren
          Homepage gesehen.</P>

          <P><FONT color="#008000"><I><b>Danke auch f&uuml;r deine Beitr&auml;ge in der
          NC, ohne die w&auml;re die NC wohl ziemlich d&uuml;nn
          ausgefallen.</b></I></FONT></P>

          <P>Ich wei&szlig;, dass Eigenlob stinkt. Aber ich habe in letzter Zeit
          durch vermehrte Pr&auml;senz das sich scheinbar absehende Ende der NoCover
          versucht zu verhindern, denn ich bin &uuml;berzeugt, dass ausreichend
          Bedarf besteht. Nur die meisten glauben halt leider, dass nur
          amigaspezifische Artikel erw&uuml;nscht seien. Das ist falsch, denn die
          NoCover will doch keinesfalls als Konkurrent zu AmigaAktuell antreten.
          Carsten Schr&ouml;der macht einen hervorragenden Job, aber auch er wartet
          auf Artikel. Diesmal aber amigaspezifische, wie Workshops,
          Toolsbeschreibungen und und und. Alles andere, aber auch diese k&ouml;nnen
          in der NoCover eingebracht werden. Warum immer in die Gegenwart schauen
          oder auf die Zukunft hoffen, auch Nostalgie ist gefragt und jeder liest
          dies dann sehr gerne und erinnert sich an die ach so sch&ouml;nen Tage. Nur
          ein bisschen Zeit sollte man auch f&uuml;r das Schreiben opfern.</P>

          <P><FONT color="#008000"><I><b>Die Farbtafeln werde ich mir nat&uuml;rlich gut
          aufheben, denn dann brauche ich nicht so viel
          herumprobieren.</b></I></FONT></P>

          <P>Das war mal wieder ein Beitrag meinerseits, den nicht alle verstanden
          haben und dies mir gegen&uuml;ber auch unmissverst&auml;ndig zum Ausdruck
          gebracht haben. Ich wollte damit wirklich nur aufzeigen, dass der eigene
          Bildschirm anders reagieren kann, wie die Allgemeinheit die Farben sieht.
          Deshalb in Gro&szlig;, wie die Farben auf dem eigenen Monitor dargestellt
          werden und zum Vergleich kann man sich die Standardtabelle anschauen. So
          kommt man bestimmt auf die richtige Farbnuancierung, die alle auch
          einigerma&szlig;en so sehen werden. In der Amiga-Szene muss man nicht alle
          zwei Jahre neue Hardware kaufen, damit man auch alles noch mitbekommt. Denn
          bei der laufenden Hard- und Software Erneuerung ist dann der Standard auch
          &uuml;berall fast gleich und man muss nicht lange nachdenken. Die NoCover
          wird noch mit A500 (1989) gelesen, als auch mit mordsm&auml;&szlig;ig
          aufger&uuml;steten PPC-Maschinen. Und das sollte man bei der Erstellung
          seiner farbenpr&auml;chtigen HTML-Seiten ber&uuml;cksichtigen. Das war mein
          Anliegen und sonst nichts.</P>

          <P>In unserer schnelllebigen Zeit wird Vieles nicht mehr
          ber&uuml;cksichtigt und von jungen Leuten schlichtweg &uuml;bersehen. Nimm
          doch als gegenw&auml;rtiges Beispiel das volle Unverst&auml;ndnis des
          Chefredakteurs des neu entstehenden Magazins GetBoinged, dass es noch
          NoCover-Leser gibt, die keinen Anschluss ins Netz haben und deswegen jetzt
          mit CD gegen Erstattung von Porto- und Materialkosten beliefert werden.
          Gem&auml;&szlig; seiner Aussage sollte dieser Personenkreis gef&auml;lligst
          mit der Zeit gehen und sich ans Netz anschlie&szlig;en, auch wenn es mit
          einer UAE-Maschine ist, was sowieso die Zukunft darstellen w&uuml;rde. Wenn
          du die HP www.getboinged.de besucht, glaubst du im ersten Moment in der
          Zeit von OS 1.3 zu sein und dann schaue dir mal die Seite
          www.getboinged.com an, eine Seite, die schon l&auml;nger besteht und ich
          will nicht &uuml;bertreiben, aber tausendmal besser ausschaut, daf&uuml;r
          aber auch eine ganz andere Zielgruppe anspricht.</P>

          <P>Mit freundlichem Gru&szlig;</P>

          <P>Wolf</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

