<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Wolf an alle</B></FONT></P>

          <P>F&uuml;r mein Statement zur Fortf&uuml;hrung der NoCover nutze ich diese
          Form der Information und nicht das Editorial. Was war eigentlich passiert?</P>

          <TABLE width="100%" summary="">
            <TR>
              <TD valign="top">- &nbsp;</TD>
              <TD valign="top">??.09.2002: &nbsp;</TD> 
              <TD valign="top">Kilian Servais teilt sporadisch mit, dass er leider aus
              terminlichen Gr&uuml;nden ab Oktober nicht mehr in der Lage sein wird,
              die NoCover weiterhin zu betreuen.</TD>
            </TR>

            <TR>
              <TD valign="top">- &nbsp;</TD>
              <TD valign="top">23.09.2002: &nbsp;</TD>
              <TD valign="top">Kilian Servais teilt in einer Rund-Mail mit, dass er
              ab sofort die Fortf&uuml;hrung der NoCover stillschweigend an Thorsten
              Sch&ouml;lzel abgegeben hat und hofft, dass alles etwas in ruhigere
              Gew&auml;sser gelangt. Er sei aus terminlichen Gr&uuml;nden nicht mehr
              in der Lage, die Zusammenstellung der NoCover zu gew&auml;hrleisten.</TD>
            </TR>

            <TR>
              <TD valign="top">- &nbsp;</TD>
              <TD valign="top">27.09.2002: &nbsp;</TD> 
              <TD valign="top">Thorsten Sch&ouml;lzel teilt im gleichen Mailverteiler
              mit, dass er die NoCover als Chefredakteur &uuml;bernommen hat und sie
              unter Verwendung des bisherigen "know-how" und vor allem der vorhandenen
              Struktur zur Aachener Messe als Getboinged wieder auferstehen lassen wird,
              denn als NoCover f&uuml;r nur 10 Leser lohnt sich der ganze Aufwand ja
              nicht. Und das schreibt er an 37 Empf&auml;nger dieser Mail.</TD>
            </TR>

            <TR>
              <TD valign="top">- &nbsp;</TD>
              <TD valign="top">29.09.2002: &nbsp;</TD> 
              <TD valign="top">Ich (Wolf Zimmer) teilte nun der Getboinged-Redaktion mit,
              dass ich nach R&uuml;cksprache mit Kilian Servais die NoCover
              weiterf&uuml;hren werde und sie auch in Zukunft im monatlichen Rhythmus
              unter angestammtem Namen erscheinen lassen werde.</TD>
            </TR>

            <TR>
              <TD valign="top">- &nbsp;</TD>
              <TD valign="top">29.09.2002: &nbsp;</TD>
              <TD valign="top">10 Minuten sp&auml;ter teilte nun die Getboinged Redaktion
              mit, dass der Verteiler (von Kilian erhalten) hiermit geschlossen ist.<BR>
              Zusatz: Wer dennoch &uuml;ber das Getboinged-Magazin informiert werden
              m&ouml;chte, dem steht auch weiterhin die Homepage zur Verf&uuml;gung.</TD>
            </TR>

            <TR>
              <TD valign="top">- &nbsp;</TD>
              <TD valign="top">29.09.2002: &nbsp;</TD>
              <TD valign="top">Weitere 10 Minuten sp&auml;ter teilte ich allen
              gem&auml;&szlig; Verteiler mit, dass die NoCover zuk&uuml;nftig unter
              meiner Zusammenstellung weiterhin monatlich erscheinen wird.</TD>
            </TR>

            <TR>
              <TD valign="top">- &nbsp;</TD>
              <TD valign="top">03.10.2002: &nbsp;</TD>
              <TD valign="top">NoCover-103 ist erschienen und wurde
              verteilt.</TD>
            </TR>
          </TABLE>

          <P>Das war bisher der zeitliche Ablauf. Und nun zur Erl&auml;uterung, warum
          ich diesen Schritt unternommen hatte. Thorsten Sch&ouml;lzel hatte
          gl&uuml;cklicherweise den Fehler begangen und hatte geschrieben, dass er
          die NoCover gerne wegen seiner Struktur &uuml;bernehmen wird. Auf
          Klar-Deutsch hei&szlig;t das (auf einen Nenner gebracht): Er m&ouml;chte
          nur die vorhandenen Adressen auswerten und verwenden. Und die NoCover als
          solche interessiert ihn &uuml;berhaupt nicht.</P>

          <P>So wie ich dies heute sehe, war dies der einzig m&ouml;gliche Schritt,
          die NoCover zu erhalten. Es w&auml;re jammerschade, wenn das einzige
          Magazin von User f&uuml;r User eliminiert w&uuml;rde. W&uuml;rde Thorsten
          Sch&ouml;lzel nur einen ganz kleinen Deut an unserem Mag liegen oder
          h&auml;tte er nur einen Funken Interesse, h&auml;tte er bestimmt Kontakt
          aufgenommen, um mindestens in Artikeln versteckt f&uuml;r sein Vorhaben zu
          werben. Es kam aber bisher keine Mail und er ist auch bisher nicht im
          Verteiler mit aufgenommen. Wenn schon jemand sich anma&szlig;t, als
          Schirmherr aller Amiga-User auftreten zu wollen, dann geh&ouml;rt auch der
          Respekt f&uuml;r Eigeninitiativen anderer hinzu. Was gedenkt denn der
          Chefredakteur des GetBoinged-Mags mit dem gro&szlig;en Kontigent der
          Demo-Szene anzufangen? Oder ist dies auch eine Au&szlig;enseitergruppe, die
          bei dem neuen Amiga-Magazin nichts zu suchen hat? Denn NoCover-Leser sind
          als Mitwirkende bei dem noch zu entstehenden Produkt nicht erw&uuml;nscht
          und werden einfach kathegorisch ausgeladen.</P>

          <P>Um nochmals ganz klar herauszuheben: Die NoCover hat keinen
          Chefredakteur, keinen verantwortlichen Redakteur einer bestimmten Rubrik,
          keinen Leiter, keinen Chef, keinen Nichts. Aber einen Verantwortlichen
          f&uuml;r die Zusammenstellung, die Verteilung auf elektronischem Wege,
          f&uuml;r die Inhaltspr&uuml;fung nach den allgemeinen Richtlinien der Sitte
          und des Anstandes und zur Einhaltung der Netiquette: das bin ich (Wolf
          Zimmer). Weiterhin gibt es auch Wolfgang Haas, der die
          hardwarem&auml;&szlig;ige Verteilung gegen Unkostenerstattung auf sich
          genommen hat. Hier kann ich nur sagen, wer eine Disk oder CD umsonst haben
          m&ouml;chte, ist hier an der falschen Adresse. Datentr&auml;ger und Porto
          gibt es bei uns nicht geschenkt. Den Dateninhalt gibt es aber weiterhin
          umsonst dazu.</P>

          <P>Zum Abschluss der "Klarstellung": Die Rechte des Namens "NoCover" waren
          von APC&amp;TCP in Person Andreas Magerl an Kilian Servais &uuml;bergeben
          worden und er hat diese Rechte alleinig an meinen Namen weitergereicht. Wer
          diese nun haben m&ouml;chte, muss sich zuk&uuml;nftig mit mir
          auseinandersetzen.</P>

          <P>Und nun noch etwas in eigener Sache: Seit einiger Zeit geht der Wunsch
          durchs Lande, es m&ouml;ge doch irgendwer alle NC's doch auf eine CD
          brennen und diese verteilen. Es gibt eine solche CD: APC&amp;TCP
          Info/Einsteiger CD-ROM. Auf der letzten Ausfertigung sind alle NoCover
          Ausgaben von der Nummer 1 bis zur Nummer 102 enthalten. Nun kann und darf
          keiner von mir verlangen, dass ich dieses NoCover-Paket aus der gekauften
          CD auskopple und weitergebe. Erstens wei&szlig; ich nicht, ob dies
          &uuml;berhaupt erlaubt w&auml;re, was ich nicht glaube, und wenn es
          trotzdem erlaubt w&auml;re, w&uuml;rde ich dies nie aus
          Solidarit&auml;tsgr&uuml;nden zu Andreas Magerl tun. Und im &Uuml;brigen
          muss ich darauf hinweisen, dass die NoCover erst mit Ausgabe Nummer 91
          Freeware wurde. Bis zur Nr 90 steht im Impressum unter Copyright, dass alle
          Rechte bei APC&amp;TCP liegen. Also warum denn eine eigenst&auml;ndige CD,
          wenn es f&uuml;r das gleiche Geld plus einige Cents drauf, eine ziemlich
          volle CD mit Software, Demos und und und gibt. Weit &uuml;ber 600 MB und
          das f&uuml;r 10 Euro inklusive Verpackung und Porto. Was wollt ihr noch
          mehr? Und zur Messe wird eine general&uuml;berholte CD angeboten. </P>

          <P>Wo es ein Punkt gibt, gibt es meist auch einen zweiten: Ich habe einige
          Mails erhalten, in denen das Remake alter NoCover-Ausgaben bef&uuml;rwortet
          wird. Mein anf&auml;nglicher Enthusiasmus war aber schnell verflogen, als
          ich mit der Detailarbeit beginnen wollte. Also beim besten Willen, das
          w&auml;re ein Fulltime-Job und die Zeit habe ich beim besten Willen auch
          als Pension&auml;r nicht. Damit ihr nicht zu kurz kommt, biete ich hier aus
          der NC-43 meinen umgesetzten CD-Test <a href="tx13.html" target="_top">
          <b>"Streckenplaner-97" </b></a> an. </P>

          <P>Ein dritter Punkt = Disketten-Porto: Bitte verwendet folgende Frankatur
          f&uuml;r Briefe mit Diskette(n): <DL>
          <DT> <b>0,66 Euro</b><DT>
          <DD> f&uuml;r offenen Umschlag mit h&ouml;chstens zwei Disketten und verschlossen
          mit einer Musterbeutelklammer ohne Schriftst&uuml;ck und dem Vermerk:
          Warensendung <DD>
          <DT> <b>1,12 Euro</b></DT>
          <DD> Brief mit bis zu zwei Disketten, aber zugeklebt. Kann auch ein
          Schriftst&uuml;ck enthalten. </DD>
          <DT> <b>1,53 Euro</b></DT>
          <DD> gleicher Preis f&uuml;r Gro&szlig;brief (zugeklebt) und Warensendung Maxi 
          (offen), Gewicht bis 500 Gramm. </DD></DL>
          Also f&uuml;r drei Disketten und mehr werden immer 1,53 Euro f&auml;llig. Falsch
          frankierte Postsendungen werden <b>nicht</b> mehr angenommen. </P>

          <P>Zum Schluss Punkt 4:
          H&auml;ufig bekomme ich die Auskunft: ich wei&szlig; nicht, was und
          wor&uuml;ber ich schreiben soll. Momentan lautet doch das Schlagwort:
          Internet per Satellit. Das w&auml;re doch etwas, eine Kostenanalyse,
          f&uuml;r wen es sich &uuml;berhaupt lohnt, welche technischen
          Voraussetzungen gegeben sein m&uuml;ssen, was beachtet werden muss und und
          und. Und vor allem: Kann die DVB-S Karte &uuml;berhaupt mit dem Amiga
          verwendet werden? Wenn einer eine Quelle ben&ouml;tigt: TOMORROW 11/2002.
          </P>

          <P>Das war es f&uuml;r heute -<BR>
          Wolf. </P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

