<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="author" content="Thomas Nawroth">
    <META name="description" content="Ein Computer-Magazin von 1984">

    <TITLE>Happy Computer</TITLE>
  </HEAD>

  <BODY background="wolf1.gif" text="#000000" bgcolor="#fffff6">
    <TABLE border="0" summary="" width="100%" cellpadding="8">
      <TR>
        <TD>
          <H1 align="CENTER">Happy Computer</H1>

          <P><IMG src="mm_hc01.gif" alt="Cover" width="302" height="435"
          align="left" hspace="6">In dieser Reihe m&ouml;chte ich Euch in die Gute
          Alte Zeit entf&uuml;hren. Dem aktuellen Trend folgend, geht es auch hier
          zur&uuml;ck in die 80`er. Dies mit Hilfe eines Computer-Magazins, mit dem
          Titel "Happy Computer". Ich besitze die Oktober-Ausgabe aus dem Jahre 1984.
          F&uuml;r mich ist es immer wieder faszinierend, darin zu schm&ouml;kern,
          und auch viele von Euch werden sicher an die eigenen Anf&auml;nge mit dem
          Home-Computer erinnert. Dieses Magazin war nicht auf einen bestimmtem
          Computer festgelegt, sondern informierte &uuml;ber alle aktuellen Typen.
          Also von Atari bis ZX81. Und wer hat nicht auch seitenweise Listings
          abgetippt? Und nicht einmal lief das Programm beim Ersten Mal - stimmt`s?
          Doch dann kam endlich MSE f&uuml;r den C=64. - Na, erwischt? Aber war doch
          auch sch&ouml;n - oder?</P>
                    
          <P>Wenn man die knalligen Farben des Covers und die 5,25 Zoll Disketten
          sieht, ist man eigentlich schon mitten drin, in der Vergangenheit.<BR
          clear="all"></P>

          <HR>

          <P>Und wie auch heute noch &uuml;blich, beginnt dieses Heft mit aktuellen
          Meldungen. Eine davon folgt nun: </P>

          <H2 align="center"><B>NEUES VON IBM</B></H2>

          <P>Der Branchenriese hatte mit seinem PC Junior von Beginn an auf dem
          amerikanischen Markt nur Sorgen. Jetzt mu&szlig;te die st&auml;ndig
          kritisierte Tastatur einer PC-&auml;hnlichen weichen, und der RAM-Bereich
          kann nun mit 128 KByte-Bausteinen auf 512 KByte erweitert werden. Das mit
          33 Watt zu schwache Netzteil wurde durch ein st&auml;rkeres ersetzt.</P>

          <P>Ein Handycap bleibt: Der PC Junior wird weiterhin nur mit einem
          Diskettenlaufwerk angeboten. Doch in der Version mit 512 KByte
          Arbeitsspeicher kann eine 360 KByte RAM-Disk eingerichtet werden.
          Vers&ouml;hnlich stimmt IBMs Angebot, bei schon ausgelieferten Ger&auml;ten
          die kritisierte Tastatur kostenlos gegen die Neue auszutauschen.<BR> Der
          Preis des neuen PC Junior liegt mit 600 Dollar deutlich unter dem eines
          vergleichbaren PC, der zirka 2000 Dollar kostet. Auf die Frage, ob dies
          nicht die Verkaufszahlen des PCs dr&uuml;cke, antwortete IBM sehr
          selbstsicher: "Damit sind wir einverstanden".</P> <HR>

          <H2 align="CENTER"><B><I>Und &uuml;ber die Firma Commodore ist folgendes zu
          lesen:</I></B></H2>

          <P><B>Commodore im Aufwind</B></P>

          <P>F&uuml;r das abgelaufene Gesch&auml;ftsjahr 1983/84 verzeichnet
          Commodore einen gegen&uuml;ber dem Vorjahr um 50 Prozent h&ouml;heren
          Gewinn. Der Umsatz stieg sogar um &uuml;ber 83 Prozent und liegt damit bei
          etwa 1,27 Milliarden Dollar. Behauptungen, da&szlig; das neue Management
          teurere Produkte auf den Markt bringen will, trat Commodore Pr&auml;sident
          Marshall F. Smith entgegen. "Wir werden an der Politik unseres ehemaligen
          Pr&auml;sidenten Jack Tramiel festhalten, Wachstum durch
          kosteng&uuml;nstige Produkte zu erhalten." So soll auch der Preis des neuen
          Plus 4 weit unter 1000 Dollar liegen. Bei Commodore Deutschland spricht man
          sogar von nur Zirka 300 Dollar. In den Aufsichtsrat der amerikanischen
          Gesellschaft wurden der Ex-General und fr&uuml;here Au&szlig;enminister
          Alexander Haig und der Finanzexperte Robert A. Utting berufen. Besonders
          Utting soll aufgrund seiner weltweiten Erfahrung ein guter Berater f&uuml;r
          den internationalen Markt sein.</P> <HR>

          <P>Das soll`s dann erstmal als kleine Einstimmung auf Damals gewesen sein.
          In der n&auml;chsten NoCover gibt es einen Testberich der "Super Disk II",
          einem Doppellaufwerk f&uuml;r den C64.</P>

          <TABLE align="CENTER" border="3" summary="">
            <TR bgcolor="#c0c0c0">
              <TD>Thomas Nawroth</TD>
            </TR>
          </TABLE>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

