<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->
    <TITLE>F&uuml;rstengrab und Keltendorf</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000">
    <TABLE cellpadding="8" cellspacing="0" border="0" width="100%"
    summary="">
      <TR>
        <TD colspan="2">Auszug aus
        <B>www.wissenschaft-online.de</B> <BR>
        Arch&auml;ologie, Geschichte<BR>
        F&uuml;rstengrab und Keltendorf [15.10.2002]</TD>
      </TR>

      <TR>
        <TD width="240">&nbsp;</TD>
        <TD>&nbsp;</TD>
      </TR>

      <TR>
        <TD align="center" valign="top">
          <IMG src="mm_kelten1.jpg" width="235" height="191" alt="Grabh&uuml;gel"><BR>
          Grabh&uuml;gel 
          <HR>
          <BR>
          <IMG src="mm_kelten2.jpg" width="235" height="109" alt="Liege"><BR>
          Liege 
          <HR>
          <BR>
          <IMG src="mm_kelten3.jpg" width="235" height="313" alt="Statue"><BR>
          Statue 
          <HR>
          <BR>
          <IMG src="mm_kelten4.jpg" width="235" height="141" alt="Halsring"><BR>
          Halsring 
          <HR>
          <BR>
          <IMG src="mm_kelten5.jpg" width="235" height="153" alt="L&ouml;we"><BR>
          L&ouml;we 
          <HR>
          <BR>
          <IMG src="mm_kelten6.jpg" width="235" height="157" alt="Dorf"><BR>
          Dorf
          <HR>
        </TD>

        <TD valign="top">
          <B>Ein Rundgang durch das Museum Hochdorf</B> 

          <P>Im Keltenmuseum der kleinen Gemeinde westlich von Ludwigsburg wird
          zun&auml;chst alles von der Ausstattung und W&uuml;rde eines keltischen
          Prunkgrabes &uuml;berstrahlt. Ein gelungenes Ausstellungskonzept macht aber
          auch zeitliche Folgen sowie Zusammenh&auml;nge deutlich und zeigt mit
          Originalexponaten und Rekonstruktionen, wie es einst war.</P>

          <P>Was im 6.&nbsp;Jahrhundert vor Christus dem Boden anvertraut wurde, kam
          fast 2500&nbsp;Jahre sp&auml;ter wieder zutage: Nachdem eine Hochdorfer
          B&uuml;rgerin das Bodendenkmal erkannt hatte, konnte 1978 das v&ouml;llig
          verflachte Grab eines Keltenf&uuml;rsten ausgegraben und vor der
          Zerst&ouml;rung durch Erosion und Pflug bewahrt werden. Heute w&ouml;lbt
          sich der neu aufgesch&uuml;ttete, mit einer Stele bekr&ouml;nte H&uuml;gel
          wieder sechs Meter hoch an seiner urspr&uuml;nglichen St&auml;tte. Von oben
          blickt man direkt zum ehemaligen F&uuml;rstensitz Hohenasperg, wie es die
          Erbauer des m&auml;chtigen Grabes wohl beabsichtigt haben.</P>

          <P>Das 1991 in unmittelbarer N&auml;he zum H&uuml;gel errichtete Museum
          verdeutlicht schon durch seine Architektur den Bezug zum Grabmonument. Vom
          Foyer aus gelangt der Besucher zun&auml;chst zu einer anhand von Befunden
          aus der keltischen Siedlung Hochdorf rekonstruierten arch&auml;ologischen
          Fl&auml;chengrabung. Hierauf folgt eine didaktische Einheit mit
          Informationen zur Geschichte der fr&uuml;hen Kelten, zu F&uuml;rstensitzen
          und F&uuml;rstengr&auml;bern, Tracht und Sozialstruktur. Zum unmittelbaren
          Erlebnis wird die Begegnung mit dem Keltenf&uuml;rsten, dessen
          Originalskelett in einem kleinen Zwischenraum dezent hingebettet wurde.</P>

          <P><B>Standesgem&auml;&szlig; gebettet</B></P>

          <P>Der zweite Bereich des Museums ist dem Grab von Hochdorf gewidmet und
          erl&auml;utert Geschichte, Untersuchung und Bergung dieses
          au&szlig;ergew&ouml;hnlichen Fundkomplexes: Unter der
          H&uuml;gelsch&uuml;ttung lag, sorgf&auml;ltig durch Eichenbalken und
          50&nbsp;Tonnen Steine gesch&uuml;tzt, eine doppelte Grabkammer. Sie barg
          die &Uuml;berreste des mit allen Zeichen seiner W&uuml;rde,
          allt&auml;glichen Ger&auml;tschaften und pers&ouml;nlichen Dingen
          beigesetzten Keltenf&uuml;rsten. Besonders au&szlig;ergew&ouml;hnlich ist
          die Bronzeliege, wo man ihn aufgebahrt hatte. Die R&uuml;ckenlehne dieser
          "Kline" zeigt Darstellungen von Wagenfahrten und Schwertt&auml;nzen. Acht
          auf R&auml;dchen montierte Frauenfiguren tragen mit erhobenen Armen die
          leicht geneigte und bequem gepolsterte Sitzfl&auml;che.</P>

          <P><B>W&uuml;rde und Lebenslust am F&uuml;rstenhof</B></P>

          <P>Der Tote trug einen Halsreif, zwei Schlangenfibeln und einen breiten
          Armreif, alles aus Gold. Auch auf G&uuml;rtel und Dolch, sogar auf seine
          Schuhe hatte man verziertes Goldblech aufgebracht. Dazu kam
          Pers&ouml;nliches: Bernsteinperlen als Amulette, Angelhaken, Messer,
          Nagelschneider, Rasiermesser und Holzk&auml;mme. Des F&uuml;rsten Vorliebe
          f&uuml;r die Jagd bezeugt ein fellbezogener K&ouml;cher mit
          14&nbsp;Pfeilspitzen. Bis auf den Halsring, das Zeichen seiner W&uuml;rde,
          ist die goldene Totenausstattung erst am Grab selbst angefertigt
          worden.</P>

          <P>Zu F&uuml;&szlig;en der Kline stand ein 500&nbsp;Liter fassender
          Bronzekessel, zu drei Vierteln mit Honigmet gef&uuml;llt und mit
          T&uuml;chern bedeckt. Am Kopfende der Kline hingen neun goldbeschlagenen
          Trinkh&ouml;rner an der Wand - das gr&ouml;&szlig;te war aus Eisen und
          sicher dem F&uuml;rsten vorbehalten.</P>

          <P>Auf dem Kasten eines 4,5&nbsp;Meter langen, kunstvoll mit Eisenblech
          verzierten vierr&auml;drigen Holzwagens lagen neun Teller und Henkelbecken
          aus Bronze, das Zaumzeug f&uuml;r zwei Pferde, ein verziertes
          h&ouml;lzernes Doppeljoch sowie Ger&auml;te zum Schlachten, H&auml;uten und
          Transchieren.</P>

          <P><B>Kunstvolles Handwerk und importierter Luxus</B></P>

          <P>Der n&auml;chste Museumsabschnitt stellt die Ergebnisse
          naturwissenschaftlicher Analysen des organischen Grabinventars vor.
          Beachtung verdienen vor allem die Nachsch&ouml;pfungen der pr&auml;chtigen
          Textilien. Ein eigener Raum ist den Funden und Befunden der beim Museumsbau
          entdeckten keltischen Siedlung Hochdorf gewidmet, die sich deutlich von
          vergleichbaren Niederlassungen jener Zeit unterscheidet. Dies belegt neben
          der planm&auml;&szlig;ig angeordneten Struktur auch das Fundspektrum:
          Luxusg&uuml;ter aus dem S&uuml;den zeigen, dass der Kontakt zum
          Mittelmeerraum nicht nur an F&uuml;rstensitzen seinen Niederschlag fand.
          Allerdings ist diese Ansiedlung etwa 150&nbsp;Jahre j&uuml;nger als das
          F&uuml;rstengrab!</P>

          <P>Eine Ebene tiefer scheint es, als habe ein keltischer Schmied soeben
          seine Werkstatt verlassen. Mit Ausnahme des Bronzekessels ist es
          n&auml;mlich gelungen, die metallene Ausstattung des F&uuml;rsten
          nachzubauen. Alle St&uuml;cke zeigen, dass den damaligen Handwerkern die
          Verbindung von Funktionalit&auml;t, Qualit&auml;t und Sch&ouml;nheit ein
          gro&szlig;es Anliegen war.</P>

          <P>Wie am Fundort, so ist auch im Museum die Grabkammer in den Untergrund
          eingetieft. Der Nachbau mit der prunkvollen Ausstattung wirkt einzigartig
          authentisch: Dieses Bild hatten die Teilnehmer der Bestattungsfeier vor
          Augen, bevor das Grab mit wei&szlig;en T&uuml;chern bedeckt und die Kammer
          verschlossen wurde.</P>

          <P>Zum Freilichtbereich neben dem Museum geh&ouml;ren nach Grabungsbefunden
          der keltischen Siedlung erstellte Rekonstruktionen: Ein ger&auml;umiges
          Wohnhaus, ein Pfostenspeicherbau, Grubenh&auml;user, eine typische
          Webh&uuml;tte, kleine G&auml;rten mit bereits vor 2500&nbsp;Jahren
          bekannten Pflanzen sowie rekonstruierte Palisaden- und
          Flechtwerkz&auml;une.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <H2><A href=
      "javascript:history.back()"><B>zur&uuml;ck</B></A></H2>

      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf
          Zimmer</B></FONT> </TD>

          <TD>E-Mail: <FONT color=
          "#0000ff"><B>wolf@wozim.de</B></FONT> </TD>

          <TD>Homepage: <FONT color=
          "#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

