<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Rainer Thieke -->
    <TITLE>Ist der Amiga-Spirit verflogen ?</TITLE>
  </HEAD>

  <BODY text="#87CEFA" bgcolor="black" link="green" vlink="green">
    <TABLE border="0" width="100%" cellpadding="8" summary="">
      <TR>
        <TD>
          <CENTER>
            <IMG src="rotmachine.gif" width="27" height="27"> 

            <H2><B><FONT color="#FF0000">Ist der Amiga-Spirit verflogen ?</FONT></B></H2>
            <IMG src="rotmachine.gif" width="27" height="27"><BR>
          </CENTER>

          <P><FONT size="+1">Was ist eigentlich bloss los ? </FONT></P>

          <P><FONT size="+1">Die momentane Situation beim Amiga ist ja schon nicht
          mehr mit "Stagnieren" zu beschreiben - mir kommt es eher so vor als
          w&uuml;rde diese ganze Community in ihren letzten Atemz&uuml;gen liegen.
          Und zwar in ihren allerletzten...! :-( Ich habe mir jetzt seit
          l&auml;ngerer Zeit mal wieder die neuesten Aminet CD`s der letzten Monate
          besorgt. Himmel, ich war richtig geschockt wie wenig neue Software es
          f&uuml;r den Amiga gibt ! Vorher war wenigstens der PD-Markt immer ein
          Garant, ein Fels in der Brandung. Jetzt scheinen aber auch die letzten
          Freeware-Autoren abzuhauen...! Anscheinend gibt es jetzt im Jahre 2002
          nicht nur einen akuten Mangel an Amiganern, n&ouml;&ouml;, der letzte Rest
          scheint auch noch total in Resignation zu verfallen. Und wisst Ihr was ?
          Das ist total ansteckend !</FONT></P>

          <P><FONT size="+1">Ich bin jetzt seit 11 Jahren dabei und der Amiga kam
          anfangs einer Offenbarung gleich. Mein Gott, 1991 - alles in H&uuml;lle und
          F&uuml;lle vorhanden - Software bis zum abwinken, Zeitschriften an jedem
          Kiosk - User an jeder Strassenecke, in jedem Wohnbezirk, in jeder
          Schulklasse - die PCler waren zu diesen Zeiten ein "Gegner" mit dem es der
          damalige Amiga locker aufnehmen konnte...naja, man kennt das ja. Die gute
          alte Zeit ! Futter f&uuml;r Nostalgiker ! :-( Aber selbst in den Jahren
          93-95, Commoders "Pleitejahre", war man mit stolzgeschwellter Brust
          Amiganer - und die Community war trotz herber R&uuml;ckschl&auml;ge und
          Abg&auml;nge immer noch gewaltig ! Man musste zwar in vielen Dingen leicht
          abspecken, aber trotzdem war dies, verglichen mit Heute, eine geradezu
          rosige Zeit.</FONT></P>

          <P><FONT size="+1">97 dann die zweite Offenbarung als ich endlich mal aktiv
          wurde - und nicht l&auml;nger nur ein passiver User war. Man lernte Leute
          ohne Ende kennen -man vertraute einander - hatte Visionen und setzte die
          dann einfach um. Selbst da ging es den Amiga, verglichen mit Heute, gut.
          F&uuml;nf Jahre ist das her, und es kommt mir vor als w&auml;re es erst
          Gestern gewesen. Aber dennoch haben diese F&uuml;nf Jahre ihre Spuren
          hinterlassen. Alles br&ouml;ckelt auseinander ! Von Jahr zu Jahr wird es
          schlimmer - immer mehr User hauen ab, wechseln das System - und ich
          erwische mich immer &ouml;fters dabei das ich es ihnen in KEINSTER WEISE
          &uuml;bel nehme. Vorher war ich immer einer dieser Amiganoiden, der jeden
          als Verr&auml;ter schimpfte, der sich `nen PC zulegte (Naja, etwas krass
          ausgedr&uuml;ckt ;-)). Aber Heute kann ich es absolut
          nachvollziehen.</FONT></P>

          <P><FONT size="+1">Soweit ist`s dann gekommen. :-( The Machine wird weich,
          mutiert zum Weichsp&uuml;ler einer ehemals harten und toughen Amigagemeinde
          (grins). Sollen doch alle abhauen - Yep, ich verstehe das - ich nicke mit
          dem Kopf, sage "Mach das!", klopfe meinem Gegen&uuml;ber auf die Schulter
          und w&uuml;nsche ihm alles gute. (Argh!) S&auml;tze wie "Du wechselst
          r&uuml;ber zum PC ? Okay, erz&auml;hl mir was dr&uuml;ben so abgeht."
          werden ein Standart-Geschoss aus meinem Mund, wenn ein weiterer
          Amiga-Kumpel sich einen PC zulegt. Ich VERSUCHE schon gar nicht mehr diese
          Kumpels davon abzuraten. Ich meine...man kennt das ja, nicht wahr ? Ein
          guter Freund, Amiga-User, will sich eine Dose zulegen weil`s der Amiga in
          seinen Augen einfach nicht mehr bringt. Fr&uuml;her hat man da seine
          Amiga-Predigt gehalten, die dann in so fern ausf&auml;llt, als das man alle
          m&ouml;glichen Vorteile runtereiert, die der Amiga gegen&uuml;ber dem PC
          hat. Echtes Multitasking, geile Community, fetter PD-Pool usw.! Jede
          Kleinigkeit wird hervorgehoben um diesen Freund ja beim Amiga halten zu
          k&ouml;nnen. Man hat f&uuml;r diese Maschine gefightet - ihr wisst was ich
          meine - sprang in die Bresche f&uuml;r den Amiga, wenn er schlecht-geredet
          wurde, wenn ein jemand da war der die Vorteile nicht erkannte, der das
          System und die dazugeh&ouml;rige Gemeinde einfach nicht verstand oder
          rigoros ignorierte. Aber das nat&uuml;rlich nicht auf militante Weise. :-)
          Es gab / oder gibt Zeiten, da hatte ein jeder Amiganer von uns diese hell
          strahlende Ritterr&uuml;stung an und hat f&uuml;r sein System das Schwert
          gezogen um es zu verteidigen.</FONT></P>

          <P><FONT size="+1">Wer das jetzt nicht versteht, der hat wohl auch nie die
          Intensit&auml;t in dieser Community miterlebt. Klar gibt es auch hier User
          die den Amiga nur oberfl&auml;chlich sehen (und ihn nat&uuml;rlich trotzdem
          zu sch&auml;tzen wissen) - und genau diese User werden sich jetzt fragen
          "Au Weia, was redet dieser Spinner eigentlich f&uuml;r bl&ouml;des Zeug ?".
          Alle anderen aber werden mich verstehen, denn sie haben den Amiga-Spirit
          genau so in sich drinne wie ich ihn habe. Und wirklich - man muss diese
          Liebe zum Amiga und zur Community in sich haben um meine Worte
          nachvollziehen zu k&ouml;nnen.</FONT></P>

          <P><FONT size="+1">Also...hat man den Amiga fr&uuml;her noch auf biegen und
          brechen verteidigt, so erwischt man sich Heutzutage immer &ouml;fter dabei,
          in gleichg&uuml;ltigkeit zu verfallen. Als Beispiel hier mein engster
          Freundeskreis: alle, bis auf zwei, hatten einen Amiga. Mittlerweile bin ich
          der letzte ! Traurig, traurig.</FONT></P>

          <P><FONT size="+1">Na gut, einer meiner Kumpels hat noch einen alten A500
          im Keller - und ab und an holt er ihn hervor um ein paar alte Games darauf
          zu daddeln. Aber mehr auch nicht. Das da kein Bezug zu dieser Maschine
          besteht d&uuml;rfte wohl klar sein. Wenn sein Amiga im Arsch gehen sollte,
          wird er kurz mit den Schultern zucken und sich dann wieder an seinen PC
          setzen. Amiga abgehakt. So einfach verschwindet etwas in`s endlose Nichts !
          Und in diesem Falle merke ich dann wie GLEICH mir das eigentlich ist - und
          ich die Beweggr&uuml;nde seines Computerwechsels mehr und mehr verstehe und
          nachvollziehen kann.</FONT></P>

          <P><FONT size="+1">Und anscheinend k&ouml;nnen das auch viele andere.
          Himmel, ich kenne User f&uuml;r die kam vorher ein Systemwechsel auf
          "Teufel nochmal" nicht in Frage. Und es war nicht nur so etwas wie
          loyalit&auml;t dem Amiga gegen&uuml;ber, sondern eben die tiefe
          Verbundenheit zum System die einen zur Aussage "Never Buy a Windoof-Peecee"
          veranlasste.</FONT></P>

          <P><FONT size="+1">Zwar gab es immer Leute die auch nebenher einen PC
          besassen, den Unterschied zwischen der Dose und DEM Amiga aber doch sehr
          wohl kannten.</FONT></P>

          <P><FONT size="+1">Aber Zeiten &auml;ndern sich -Menschen &auml;ndern sich
          - Einstellungen &auml;ndern sich - und demnach auch die emotionalen
          Bindungen. Und so kommt man auf ein trauriges Fazit, dass ich hier mal
          meinen Kumpels Murmel, Poldi und Kilian entgegen werfe: Ich stehe ja noch
          in Kontakt mit einigen 4ever- und Fireball Usern - aber viele von denen
          besitzen &uuml;berhaupt keinen Amiga mehr. Ist das zu fassen ? Nun, ich
          weiss von Sven "Solid Snake" Voss, Melanie "Witchcraft" Preus, Stefan
          "Crazy Kilrathi" Walter (Mein Cousin und Poldis bester Freund ;-)) und
          Roman "Exorzist" Bujna, das sie l&auml;ngst gewechselt sind. Wenn man
          bedenkt, das diese Leute noch vor kurzem in der Fireball kr&auml;ftig
          mitgemischt haben und jetzt (einige jedenfalls) auf dem PC und Mac aktiv
          (!) mitmischen... ...was soll man dazu sagen ?</FONT></P>

          <P><FONT size="+1">Ich dachte diese Info interessiert euch
          vielleicht...denn sie beweist doch nur die Tatsache, dass in den letzten
          Monaten soviele User abger&uuml;ckt sind wie nie zuvor. Was auch an der
          erneuten Zersplitterung des Amiga Marktes liegt:</FONT></P>

          <P><FONT size="+1">(Amiga One Versus Pegasos = Amiganer Versus Amiganer =
          Die Randgruppe spaltet sich erneut in mehrere Randgruppen = Rest In
          Peace).</FONT></P>

          <P><FONT size="+1">Au Mann, ich k&ouml;nnte noch `nen dutzend weitere Namen
          nennen, die vorher an Projekten mitgewirkt haben - und wegen AMIGA INC
          Versus BPlan`s PEGASOS abgesprungen sind, und bei dieser
          WischiWaschi-Politik einfach nicht mehr mitspielen wollten. Wir hatten z.B.
          f&uuml;r unser Rollenspiel "Brimstone Saga" so einige Testspieler (musste
          ja auch sein, war ziemlich Fehlerbehaftet das Spiel) - und wir haben
          nachher fast die Krise gekriegt als 4 Leute fast Zeitgleich abgesprungen
          sind. Und das mitten in der Testphase ! :-(</FONT></P>

          <P><FONT size="+1">Auch hier kann ich nur noch mal sagen: Ich kann es ihnen
          einfach nicht &uuml;bel nehmen. Mich hat dieses arrogante auftreten seitens
          BPlan ja genauso angewiedert (Ohne R&uuml;cksicht eine Spaltung in der
          Gemeinde riskieren) - ich bin aber trotz dieser horrenden Nachrichten beim
          Amiga geblieben. Aber viele halt nicht ! Und glaubt mir eines, Freunde: die
          Sache damals mit Pegasos hat den Amiga UNHEIMLICH viele User gekostet, die
          jetzt im h&ouml;chstfalle mal via PC-UAE schauen, was der Amiga so
          treibt.</FONT></P>

          <P><FONT size="+1">Nun, die Namen die ich gerade nannte sind da garantiert
          nur ein Bruchteil der User, f&uuml;r denen BPlan`s Eigenregie der Tod des
          herk&ouml;mmlichen Amigas war. Und...Naja...was soll man dazu noch gross
          sagen !?</FONT></P>

          <P><FONT size="+1">"Danke, BPlan" vielleicht !? :-(</FONT></P>

          <P><FONT size="+1">Nun, ich werde jetzt garantiert nicht zu sehr in die
          Diskussion abdriften was denn nun "Amiga" sei oder nicht. ;-) Da ich aber
          schon mal beim "staten" (Dummes Wort...) bin:</FONT></P>

          <P><FONT size="+1">Ich kann auf der einen Seite DIE User mittlerweile
          verstehen, die an das alte 68k festhalten, als w&auml;re es das
          allm&auml;chtige Excalibur. Nat&uuml;rlich ist diese Schiene restlos
          abgefahren und wird auch nicht mehr saniert werden k&ouml;nnen - die 68k
          Systeme k&ouml;nnen es, selbst mit PPC Board, in keinster weise mit anderen
          Systemem aufnehmen. Rein von der Hardware, also vom technischen Aspekt her,
          gesehen. Aber - um jetzt mal `ne bl&ouml;de Metapher zu benutzen: Eure
          geliebten Grosseltern schmeisst ihr doch auch nicht einfach weg, nur weil
          sie immer &auml;lter werden. (grins) Auf der anderen Seite ist aber der
          AOne der wichtige Schritt Richtung Zukunft. No Doubt About It ! Und auch
          hier kann ich die User verstehen, die endlich den alten Mantel (68k)
          abstreifen wollen, weil er schon viel l&auml;nger als letzlich beabsichtigt
          getragen wurde. ABER (und jetzt kommt ein grosses Aber, das ich garnicht so
          gewaltig mit meiner Tastatur niederschreiben kann, wie ich`s gerne
          m&ouml;chte): BPlan`s Pegaosos hat dann doch meiner Meinung nach soviel mit
          dem AMIGA zu tun, wie der Osterhase mit Weihnachten, wie Bill Gates mit
          Petro Tyschtschenko, wie die NoCover mit der FHM. (grins) Diese Hardware
          war / ist ein BPLAN, kein AMIGA -und war, und ist aus meiner subjektiven
          Sicht total irrelevant. Aber gleiches gilt auch f&uuml;r mich, wenn ich
          `nen PC mit Amiga-Emulator in Betracht ziehen w&uuml;rde. Zum einen sind
          diese Emu`s NIE dermassen gut, wie sie immer seitens einiger PCler
          hochgejubelt werden (von wegen...ich durfte Amiga Forever mal in Aktion
          erleben - das ist der reinste Witz - vieles l&auml;uft doch gar nicht, oder
          nur Fehlerbehaftet)... und zum anderen komme ich somit wieder auf mein
          anf&auml;ngliches Thema zur&uuml;ck. Der Amiga ist etwas besonderes, und es
          ist ein riesengrosser Unterschied ob man das St&uuml;ckchen Hardware zu
          Hause auf seinem Schreibtisch stehen hat, oder lediglich eine
          Emulationssoftware laufen l&auml;sst !!! Und hier spreche ich ja ein wenig
          aus Erfahrung. Immerhin war ich vor meiner Amiga-Zeit ein Brotkasten-User
          (auch mit Leib und Seele ;-)) und benutze mittlerweile den C64 Emulator
          "Magic 64". Das ist auch NICHT das gleiche als wenn man einen 64er zu Hause
          stehen h&auml;tte - obwohl es nat&uuml;rlich nett ist, so einige
          Spielehighlights aus vergangener Zeit auf diesem Emulator zu geniessen. Das
          einstige Flair ist jedoch nicht zu emulieren...! (P.S: Suche immer noch
          einen C64er inkl. 1541- und Datasetten Laufwerk und massig Soft: bitte
          melden :-))</FONT></P>

          <P><FONT size="+1">So, genug geschwafelt. Wir haben jetzt 1 Uhr Nachts
          durch - und so langsam aber sicher sollte ich noch ein wenig an meiner
          Matratze horchen. :-) Momentan sehe ich alles ein wenig (ein wenig ist
          gut...) Pessimistisch - und auch der Spirit der alten Tage scheint
          verflogen. F&uuml;hlt Ihr das genauso ? Seid Ihr der Meinung Eure
          Einstellung ist noch genauso wie fr&uuml;her ? Hey, ihr "Amiga-Brothers":
          Schreibt doch mal Eure Meinung hier nieder ! Mich w&uuml;rde das ungemein
          interessieren ! ( An Murmel, Kilian und Poldi: Ich hoffe auf eurer
          Statement, Jungs ! :-))</FONT></P>

          <P><FONT size="+1">Nunja, Ich kann auch nicht genau sagen worauf ich
          eigentlich warte. Mann harrt einfach der Dinge, die da kommen m&ouml;gen -
          und hofft das alles noch einmal besser wird. Die beste Methode ist da immer
          noch sich zu besch&auml;ftigen. Solange man etwas zu tun hat und an etwas
          werkelt, ist alles in Ordnung. Man komponiert ein paar Mods, schreibt ein
          paar Artikel, programmiert ein wenig...und wenigstens dann scheint alles in
          Ordnung zu sein - soetwas nennt man auch Besch&auml;ftigungsthearphie.
          :-)</FONT></P>

          <P><FONT size="+1">Aber wehe man wird dann wieder etwas passiver, schaut
          sich den schrumpfenden PD-Markt an, die immer unspektakul&auml;rer werdende
          Software, den immer kleineren Amiga-Markt... ... ... ...Hui...gibt es
          eigentlich noch einen gr&uuml;nen Zweig, auf denen wir springen d&uuml;rfen
          ?</FONT></P>

          <P><FONT size="+1">Is That All That Is - Is That It Now ?</FONT></P>

          <CENTER>
            <H5><FONT color="#FF0000">...Und am siebten Tage setzte
            sich Gott an seinen Amiga...</FONT></H5>
          </CENTER>

          <CENTER>
            <H3><A href="mailto:rainermachine@yahoo.de">Rainer "The Machine" Thieke</A></H3>
          </CENTER>

          <CENTER>
            <IMG src="machine.gif" width="400" height="220">
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

