<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="author" content="Wolf Zimmer">

    <TITLE>Abakus</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="black" link="blue" alink="red"
  bgcolor="#FFFFF6">
    <A name="top"></A><BR>

    <TABLE border="0" summary="" cellpadding="8">
      <TR>
        <TD>
          <H1><FONT color="#000080"><B>Ein seltsames Rechenger&auml;t:</B></FONT></H1>

          <H1><FONT color="#000080"><B>der Abakus</B></FONT></H1>

          <P>Der Mensch war immer bem&uuml;ht, seine Berechnungen zu beschleunigen.
          Die Babylonier waren die ersten, die mit Markierungen in Tont&auml;felchen
          ihre Rechenoperationen beschleunigten und pr&auml;zisierten. Der Abakus
          wurde erst sp&auml;ter erfunden, vielleicht im alten &Auml;gypten, doch das
          wei&szlig; man nicht genau. Der Abakus war die erste Rechenmaschine des
          Menschen; die Zahlen wurden von kleinen Gegenst&auml;nden (Kieselsteinen,
          Fruchtkernen oder durchbohrten Muscheln) dargestellt, die auf d&uuml;nnen
          St&ouml;ckchen aufgereiht waren. Sein Name stammt wahrscheinlich von dem
          griechischen Ausdruck <I>abax,&nbsp; abakos</I>, &nbsp; womit eine
          "staubbedeckte Tafel" gemeint war, auf der man Berechnungen und
          geometrische Figuren zeichnen konnte. Das griechische Wort l&auml;&szlig;t
          sich m&ouml;glicherweise vom hebr&auml;ischen <I>abaq</I>, &nbsp; das
          hei&szlig;t "Staub", ableiten. Der Ausdruck verweist also auf eine
          Entstehung im Nahen Osten.</P>

          <P>Obwohl die Mathematiker des antiken Griechenland mit den Entdeckungen
          der meriterranen V&ouml;lker vertraut waren und sie mit eigenen
          Beitr&auml;gen fortzuentwickeln wu&szlig;ten, fanden ihre Erkenntnisse
          keinerlei praktische Auswirkungen auf das soziale und wirtschaftliche Leben
          der griechischen Gesellschaft. Vielmehr hielt man solche Gedankeng&auml;nge
          f&uuml;r wenig mehr als intellektuelle Spielereien. Selbst
          naturwissenschaftliche und technische Fortschritte orientierten sich kaum
          an praktischen Anwendungen, an einer Steigerung der
          Arbeitsproduktivit&auml;t oder einer Befreiung von k&ouml;rperlichen
          Belastungen, sondern wurden vor allem als Ausdruck der Erfindungsgabe der
          Intelligenz verstanden. Das selbe Vorurteil behinderte auch die Entwicklung
          der griechischen Mathematik, so dass wir die wichtigsten algebraischen und
          arithmetischen Entdeckungen den indischen und arabischen Mathematikern der
          Zeit zwischen 400 und 1200 n.Chr. verdanken. In unsere Gefilde gelangte
          dieses Wissen durch die Kaufleute der Seerepubliken.</P>

          <P>Ihre st&auml;rkste Verbreitung erfuhr die Mathematik nach der
          protestantischen Reformation und die Erfindung von Papier und Buchdruck. Es
          war Martin Luther, der neben der Vervielf&auml;ltigung der Bibel die
          Drucklegung arithmetischer Textb&uuml;cher verlangte. Die Inder und nach
          ihnen die Araber hatten die Vorteile des positionellen Zahlensystems
          erkannt. H&auml;ndler und Kaufleute zogen aus dieser Vereinfachung
          besonderen Nutzen, und sie brachten auch den Abakus in die L&auml;nder des
          Westens. In manchen Restaurants und Gesch&auml;ften Ru&szlig;lands, Chinas
          und Japans wird er noch heute benutzt, und auch die bunten K&uuml;gelchen
          best&uuml;ckten Rechenhilfen der Erstkl&auml;&szlig;ler stammen davon
          ab.</P>

          <P><IMG src="st_abakus1.jpg" width="325" height="150" align="right"> Die
          Form des Abakus variiert je nach Volk und Zeitstufe. Die Version mit
          Holzperlen auf d&uuml;nnen St&auml;bchen stellt einen Typ dar, den
          wahrscheinlich die Chinesen erfunden haben. Die Araber entwickelten andere
          Konstruktionen, beispielsweise in der Form eines schr&auml;g angeordneten
          Gitters. Wir wollen es mit der Multiplikation etwa der Zahlen 3283 und 215
          erkl&auml;ren. Das rechteckige Gitter enth&auml;lt so viele K&auml;stchen,
          wie die zu multiplizierenden Zahlen Ziffern haben, in unserem Fall also
          4x3. Die Quadrate werden durch senkrechte Diagonale geteilt, die nach unten
          auf eine Basislinie gef&uuml;hrt werden. Die beiden Zahlen schreibt man an
          den Rand und multipliziert sie dann Ziffer f&uuml;r Ziffer. Das
          K&auml;stchen rechts au&szlig;en z.B. enth&auml;lt das Ergebnis der
          Operation 5x3=15, das K&auml;stchen ganz links die Operation 2x3=6. Einer
          stehen rechts der senkrechten Teilungslinien, Zehner links davon. Wenn das
          Gitter voll ist, werden die Zwischenergebnisse auf der Basislinie addiert.
          Die Richtigkeit des Ergebnisses 705.845 kann jeder mit dem Calculator in
          Tools sofort &uuml;berpr&uuml;fen.</P>

          <P>Die zweite Abbildung zeigt eine Variation eines Abakus mit
          &auml;hnlichem Aufbau. Auch hier wird diagonal addiert, um das Ergebnis zu
          erhalten. Ein Schema dieser Art schwebte 400 Jahre sp&auml;ter Pascal und
          Leibnitz vor, als sie an die Entwicklung der ersten Rechenmaschine
          dachten.</P>

          <P><IMG src="st_abakus.jpg" width="206" height="218" align="left"> Das
          Schlu&szlig;bild zeigt einen Abakus, wie er heute noch in China in Gebrauch
          ist. Dieser eignet sich nur f&uuml;r Addition und Subtraktion. Jede
          senkrechte Perlenreihe repr&auml;sentiert eine bestimmte Position des
          Dezimalsystems, das hei&szlig;t von rechts nach links die Einer, Zehner,
          Hunderter usw. Jede Perle unter dem Querbalken gilt entsprechend als 1, 10,
          100 usw. Eine Perle &uuml;ber dem Balken repr&auml;sentiert 5 Einheiten,
          also 5 Einer, 5 Zehner usw. Auf dem Bild wird die Zahl 173 dargestellt.</P>

          <P>Bei der Addition beginnt man ganz rechts und schiebt die ben&ouml;tigten
          Perlen zum Querbalken zu dem eingestellten Ausgangswert hinzu. Reichen die
          Perlen im Depot nicht mehr aus, dann mu&szlig; gegen einen 5er Wert
          getauscht werden. Bei der Subtraktion arbeiten wir von links nach rechts.
          Das Rechensystem bleibt auch hier das gleiche. Nur hier mu&szlig; vom
          Mittelbalken weggezogen werden. Detailliertere Beschreibung ist an dieser
          Stelle wohl nicht vonn&ouml;ten, da in heutiger Zeit alles elektronisch
          gerechnet wird und Kopfarbeit nicht mehr gefragt ist. Mit diesem kleinen
          Ausflug wissen wir aber etwas eingehender und ausf&uuml;hrlicher, was
          eigentlich ein Abakus ist, n&auml;mlich der Ur- Ur- Urvorg&auml;nger
          unserer Freundin.</P>

          <P align="right"><A href=
          "Mitglieder/zimmer.html"><B>[Wolf Zimmer]</B></A></P>
          <HR color="#FF00FF" size="3">
          <B>Gehe&nbsp;<A href="#top">zum Anfang</A>.<BR>
          <A href="javascript:history.back()"><FONT size=
          "+1"><B>zur&uuml;ck</B></FONT></A></B>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

