<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"> <B>Deutschland einig
          Einwanderungsland</B></FONT></P>

          <P>"Wir riefen Arbeiter, aber es kamen Menschen", sagte Max Frisch
          &uuml;ber die Gastarbeiter der 1960er Jahre.</P>

          <P><IMG src="st_auslaender.gif" width="350" height="289" alt="" hspace="8"
          align="left"> Die Ausl&auml;nder in Deutschland sind Arbeitsmigranten,
          Asylanten, Aussiedler und Fl&uuml;chtlinge. Die meisten kommen auf der
          Suche nach Arbeit, sp&auml;ter holen sie ihre Familien. Besonders aus der
          T&uuml;rkei kamen viele Menschen.</P>

          <P>Jeden Tag kamen mehrere Z&uuml;ge mit hunderten von Italienern am
          M&uuml;nchner Hauptbahnhof an. Sie waren die ersten. Seit 1954 zogen
          insgesamt rund 31 Millionen Menschen - Ausl&auml;nder und
          Deutschst&auml;mmige - in die Bundesrepublik. Zur Zeit leben hier 7,4
          Millionejn Ausl&auml;nder, das sind etwa 9 Prozent der Bev&ouml;lkerung.
          Diejenigen, die mittlerweile einen deutschen Pass besitzen, werden nicht
          mitgez&auml;hlt.</P>

          <P>Die Zuwanderer kommen aus den unterschiedlichsten Gr&uuml;nden, aber
          generell unterscheidet man zwischen Arbeitsmigranten, Aussiedlern,
          Asylanten und Fl&uuml;chtlingen. Mit 6,1 Millionen bilden die sogenannten
          "Gastarbeiter" die gr&ouml;&szlig;te Gruppe. Durch das Wirtschaftswunder in
          den 1950er und 60er Jahren ben&ouml;tigten westdeutsche Betriebe dringend
          mehr Arbeitskr&auml;fte, daher warb die Regierung in anderen L&auml;ndern.
          Freudig wurden die Ausl&auml;nder begr&uuml;&szlig;t und eingestellt. Der
          millionste Gastarbeiter bekam sogar direkt nach seiner Ankunft am Bahnhof
          ein Moped und Blumen geschenkt.</P>

          <P><B>Probleme</B><BR> Aber schon Ende der 1960er Jahre ging es der
          deutschen Wirtschaft nicht mehr sio gut, eine Menge Stellen fielen weg.
          Einige Gastarbeiter kehrten nach Hause zur&uuml;ck. Mit dem neuen
          wirtschaftlichen Aufschwung kamen sie wieder. Doch dann setzte die
          "&Ouml;lkrise" ein, Stimmen gegen die Ausl&auml;nder meldeten sich: "Sie
          nehmen uns die Arbeit weg und nutzen unsere Sozialleistungen aus!". Die
          Regierung verh&auml;ngte 1973 einen "Anwerbestop": Niemand durfte mehr
          kommen, und wer zur&uuml;ckfuhr, musste dort bleiben. Dadurch sank die Zahl
          der Ausl&auml;nder in den Jahren 1974 - 78. Langfristig gesehen zogen
          jedoch mehr Menschen in die BRD. Die jungen M&auml;nner, die nicht
          zur&uuml;ck wollten, holten ihre Frauen und Kinder nach. Viele wollten in
          Deutschland bleiben. Aber es gab bisher keine &Uuml;berlegungen und
          Pl&auml;ne f&uuml;r eine Eingliederung. Eine Auseinandersetzung mit ihrer
          Lebensweise oder der Religion hielt bis dahin niemand in Deutschland
          f&uuml;r n&ouml;tig. Zaghaft entwickelten sich erstmals in der zweiten
          H&auml;lfte der 1970er eine Politik der Konsolidierung und Versuche der
          Integration.</P>

          <P><B>Die 1980er und 90er Jahre</B><BR> Seit Ende der 70er Jahre kamen -
          vertrieben durch Krieg, Elend und Unterdr&uuml;ckung - immer mehr
          Asylsuchende in die BRD. Durch die wachsende Anzahl der Ausl&auml;nder und
          geringeres wirtschaftliches Wachstum &auml;u&szlig;erten viele Deutsche
          Vorbehalte gegen Zuwanderer. Die Politiker reagierten darauf mit einer
          Wende in der Ausl&auml;nderpolitik: Anstatt Eingliederung galt jetzt
          Abschiebung. Eine Folge davon war das R&uuml;ckkehrf&ouml;rderungsgesetz
          von 1983: Gastarbeiterfamilien sollten etwa 10.000 Mark erhalten, in ihre
          Heimat ziehen und nie wiederkommen. Das war aber nicht so einfach. In den
          meisten Heimatl&auml;ndern gab es keine Hilfen f&uuml;r Menschen, die sich
          dort wieder niederlassen wollten. Und das Geld vom deutschen Staat reichte
          meist nur f&uuml;r den Umzug und den Zoll. Obwohl die meisten Familien
          daher hier blieben, bewirkte das Angebot einen R&uuml;ckgang der
          Ausl&auml;nderanzahl.</P>

          <P><B>Menschen aus Ostmitteleuropa</B><BR> Zwischen 1988 und 1993
          &uuml;berschritten die Zuwanderungen die Spitzenwerte der Jahre 1969 und
          1970. Wegen der unruhigen Lage in Ostmitteleuropa kamen 7,3 Millionen
          Aussiedler, Asylbewerber, B&uuml;rgerkriegsfl&uuml;chtlinge und neue
          Arbeitsmigranten. Zuz&uuml;ge dieses Ausma&szlig;es meldeten im gleichen
          Zeitraum nur die USA. Viele interpretierten die Entwicklung als den Beginn
          einer neuen V&ouml;lkerwanderung. Der Strom geriet jedoch 1993 ins Stocken,
          denn ab Mitte des Jahres trat ein restriktives Asylrecht in Kraft.
          Au&szlig;erdem bewarben sich generell nicht mehr so viele Menschen um die
          Einwanderung.</P>

          <P>Nach dem Ende des Kriegs im ehemaligen Jugoslawien bem&uuml;hten sich
          viele Deutsche, den B&uuml;rgerkriegsfl&uuml;chtlingen zu helfen, eine neue
          Existenz in der alten Heimat zu gr&uuml;nden. Man sorgte sich um den
          Hausbau, Strom und Wasser, so dass 1997 und 1998 ein Gro&szlig;teil von
          ihnen zur&uuml;ckzog.</P>

          <P>Mit der im Jahre 2000 eingef&uuml;hrten "Green Card" f&uuml;r
          Arbeitskr&auml;fte im Bereich der Informationstechnologie k&uuml;ndigt sich
          ein grundlegender Wandel im politischen Umgang mit Arbeitsmigranten an:
          Einerseits wird so der seit 1973 geltende Anwerbestopp deutlich
          relativiert, andererseits bekennt die Bundesregierung zum ersten Mal, dass
          Deutschland ein Einwanderungsland ist.</P>

          <P><B>Die Arbeitsmigranten</B><BR> Die Arbeitsmigranten und ihre Familien
          stellen mit 6,1 Millionen bei weitem die gr&ouml;&szlig;te Gruppe der
          Ausl&auml;nder in Deutschland. In den Jahren 1955 - 73 schloss die
          Bundesregierung als "Anwerbevertr&auml;ge" bezeichnete Abkommen mit einigen
          Mittelmeerstaaten wie Italien, der T&uuml;rkei oder Spanien. Besonders
          viele Zuwanderer kamen aus der T&uuml;rkei, auch viele Asylbewerber, so
          z.B. durch den Milit&auml;rputsch 1980.</P>

          <P>Urspr&uuml;nglich sollten die ausl&auml;ndischen Arbeitnehmer nur ein
          paar Jahre in Deutschland bleiben und dann in ihre Heimat
          zur&uuml;ckkehren. Es kam jedoch ganz anders. F&uuml;r die Mehrzahl dieser
          Familien ist Deutschland und nicht ihr Herkunftsland der Lebensmittelpunkt.
          Das zeigt sich beispielsweise durch die lange Aufenthaltsdauer der meisten
          Familien (rund 49 Prozent leben seit &uuml;ber 10 Jahren hier). Die Kinder
          sind in der BRD geboren. Viele haben kleinere selbst&auml;ndige Unternehmen
          gegr&uuml;ndet oder andersweitig finanziell in der BRD investiert, z.B.
          durch Immobilienk&auml;ufe. Au&szlig;erdem planen sie ihre Zunkunft
          hier.</P>

          <P><B>Literatur:</B><BR> Statistisches Bundesamt: Datenreport 1999. Zahlen
          und Fakten &uuml;ber die Bundesrepublik Deutschland,<BR> Aktualisierte
          Ausgabe, Bonn: Bundeszentrale f&uuml;r politische Bildung 2001.</P>

          <P><B>Begriffserl&auml;uterungen:</B><BR> <B>Gastarbeiter-Begriff</B><BR>
          In den sechziger Jahren hat sich in der Umgangssprache der Begriff
          "Gastarbeiter" eingeb&uuml;rgert. Er geht davon aus, dass angeworbene
          Arbeitskr&auml;fte wieder in ihr Herkunftsland zur&uuml;ckkehren. Die
          Amtssprache verwendete von Anbeginn "ausl&auml;ndische Arbeitnehmer" bzw.
          "Ausl&auml;nder". Als in den siebziger Jahren zunehmend deutlich wurde,
          dass immer mehr Arbeitskr&auml;fte langfristig bleiben, setzte sich
          &uuml;berwiegend die Bezeichnung "Ausl&auml;nder" durch.</P>

          <P>Viele Sozialwissenschaftler finden den Begriff "Ausl&auml;nder" nicht
          ad&auml;quat und nutzen die Bezeichnung "ethnische Minderheiten". Sie
          verdeutlicht, dass es sich um Bev&ouml;lkerungsgruppen handelt, die
          zahlenm&auml;&szlig;ig in der Minderheit und in sich vielf&auml;ltig
          differenziert sind. Au&szlig;erdem haben sie keine deutsche Abstammung und
          Herkunft.</P>

          <P><B>Anwerbevertr&auml;ge</B><BR> Um ihren Arbeitskr&auml;ftebedarf zu
          decken, warb die Wirtschaft Menschen aus den Mittelmeerl&auml;ndern an und
          schloss entsprechednde Abkommen mit Italien (1955), Spanien und
          Griechenland (1960), der T&uuml;rkei (1961), Marokko (1963), Portugal
          (1964), Tunesien (1965) und Jugoslawien (1968). Zu den Hintergr&uuml;nden
          der Anwerbema&szlig;nahmen geh&ouml;rt auch der "Mauerbau" im Jahre 1961,
          der den Zuzug von Arbeitskr&auml;ften aus der DDR stoppte. Deutschland, die
          Entsendel&auml;nder und nicht zuletzt die Betroffenen selbst gingen
          anfangs vom Rotationsprinzip aus: Die angeworbenen Arbeitnehmer(innen)
          sollten nach einigen Jahren in ihre Heimatl&auml;nder zur&uuml;ckkehren und
          - bei Bedarf der deutschen Wirtschaft - durch neue "Gastarbeiter" ersetzt
          werden.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8" summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

