<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = J&ouml;rg Rudlaff -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="nc_bg2.jpg" text="#000000" link="#0000ff"
  alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Frauen</B></FONT></P>

          <P>Die wissenschaftliche Erkenntnis: "Wer abends gesoffen hat kann morgens
          auch arbeiten" ist falsch ! Man kann morgens auch nicht fliegen, wenn man
          abends gev&ouml;gelt hat.</P>

          <HR width="60%">

          <P>Was ist der Unterschied zwischen einer Frau und einem Frosch?<BR>
          Gar keiner ! Quacken nur dumm rum, haben st&auml;ndig kalte Flossen und
          Angst vor dem Klapperstorch...</P>

          <HR width="60%">

          <P>Der liebe Gott erschuf den Mann. Dann erschuf er die Frau.<BR>
          Als er dann sah was er angerichtet hatte, sorgte er f&uuml;r den Tabak und
          den Alkohol.</P>

          <HR width="60%">

          <P>Was ist der Unterschied zwischen einem langen Rock und einem kurzen?<BR>
          Die Zugriffszeit !</P>

          <HR width="60%">

          <P>Frauen sollten wie Polizeihunde sein ! ! !<BR>
          N&auml;mlich : folgsam, willig , dem&uuml;tig und scharf !</P>

          <HR width="60%">

          <P>Frauen sind wie Krawatten :<BR>
          Man w&auml;hlt sie meistens bei schlechter Beleuchtung, und dann hat man
          sie am Hals !</P>

          <HR width="60%">

          <P>Was ist der Unterschied zwischen einer Frau und einem Nashorn?<BR>
          Eines hat einen fetten Arsch und ein gro&szlig;es Maul, und das andere lebt
          in Afrika.</P>

          <HR width="60%">

          <P>Warum k&ouml;nnen Frauen nur beim Sex denken?<BR>
          Na, nur da sind sie mit dem Hauptrechner verbunden.</P>

          <HR width="60%">

          <P>Ein Mann kommt sp&auml;t in der Nacht nach Hause.<BR>
          Seine Frau fragt ihn: "Was machst Du denn f&uuml;r ein Gesicht?"<BR>
          Ihr Mann antwortet: "Wenn ich Gesichter machen k&ouml;nnte, h&auml;ttest Du
          schon lange ein Neues !"</P>

          <HR width="60%">

          <P>Sohn: "Stimmt es, Vater, da&szlig; in einigen Teilen Afrikas die
          M&auml;nner ihre Frauen bis zum Tag ihrer Hochzeit nicht kennen?"<BR>
          Vater: "Das Stimmt in allen L&auml;ndern, mein Sohn."</P>

          <HR width="60%">

          <P>Traue nie einer Frau mit leuchtenden Augen. Es k&ouml;nnte die Sonne
          sein. die durch ihren hohlen Sch&auml;del leuchtet !</P>

          <HR width="60%">

          <P>Warum werden die Frauen seit Jahrhunderten unterdr&uuml;ckt?<BR>
          Weil es sich bew&auml;hrt hat !</P>

          <HR width="60%">

          <P>Neueste Untersuchungen haben ergeben, da&szlig; Bier weibliche Hormone
          enth&auml;lt, die bewirken. da&szlig; M&auml;nner zu Frauen werden.<BR>
          Den (m&auml;nnlichen) Testpersonen wurden 5 Liter Bier zugef&uuml;hrt.
          Danach begannen 100 % der Kandidaten unsinniges Zeug zu reden, konnten
          nicht mehr Vern&uuml;nftig Autofahren, argumentierten irrational, weigerten
          sich Fehler einzugestehen, wurden &uuml;bertrieben emotional und
          mu&szlig;ten sich zum Pinkeln hinsetzen.</P>

          <HR width="60%">

          <P>Eine junge Frau geht im Supermarkt einkaufen und hat an der Kasse
          Folgende Artikel im Korb:<BR>
          1 St&uuml;ck Seife, 1 Zahnb&uuml;rste, 1 Tube Zahnpasta, 1 Pfund Brot, 1
          Liter Milch, 1 Backofenpizza und 1 Joghurt.<BR>

          Der Kassierer sieht die Frau an, l&auml;chelt und sagt: "Single, h&auml;?"
          Die Frau l&auml;chelt sch&uuml;chtern zur&uuml;ck und fragt: "Wie haben Sie
          das blo&szlig; rausgefunden?"<BR>
          Er antwortet: "Weil Sie so potth&auml;&szlig;lich sind..."</P>

          <HR width="60%">

          <P>Was kommt heraus , wenn man eine Frau mit einer Krake kreuzt?<BR>
          Ein Oktoputz !</P>

          <HR width="60%">

          <P>Was ist das : Hat zwei Fl&uuml;gel , h&auml;lt sich im Dunklen auf und
          saugt Blut?<BR>
          Eine "always ultra". </P>
                       
          <HR width="60%">

          <P>Ein Mann fragt ein h&uuml;bsches M&auml;dchen: "W&uuml;rden Sie f&uuml;r eine
          Million mit einem wildfremden Mann schlafen?"<BR>
          "Aber sicher, sofort !"<BR>
          "W&uuml;rden Sie f&uuml;r 25 DM mit mir schlafen?"<BR>
          "Wof&uuml;r halten Sie mich denn?"<BR>
          "Das haben wir ja schon gekl&auml;rt (jetzt verhandeln wir nur noch &uuml;ber den
          Preis... "</P>

          <HR width="60%">

          <P>Meine Frau hat die Alzheimer-Bulimie: Sie i&szlig;t mit Hei&szlig;hunger,
          vergi&szlig;t aber das Brechen...</P>

          <HR width="60%">

          <P>Was macht eine Frau, wenn sie auf ein leeres Blatt Papier schaut? Sie
          liest sich ihre Rechte durch.</P>

          <HR width="60%">

          <P>Drei Frauen stehen an einem Flu&szlig;. Da kommt eine Fee und schenkt
          jeder Frau einen Wunsch.</P>

          <P>Die erste Frau: Ich m&ouml;chte eine Eigenschaft, um diesen Flu&szlig;
          &uuml;berqueren zu k&ouml;nnen.<BR>

          <B>Blink</B> und sie kann schwimmen.</P>

          <P>Die zweite Frau: Ich m&ouml;chte einen Gegenstand haben, um diesen
          Flu&szlig; zu &uuml;berqueren.<BR>

          <B>Blink</B> und sie bekommt ein Ruderboot.</P>

          <P>Die dritte Frau: Ich m&ouml;chte, ohne mich gro&szlig; anstrengen zu
          m&uuml;ssen, &uuml;ber diesen Flu&szlig; kommen.<BR>

          <B>Blink</B> sie wird zu einem Mann und geht &uuml;ber die Br&uuml;cke !</P>

          <HR width="60%">

          <P>Warum sagte man nicht "dumme Frau" ?<BR>

          Man sagt ja auch nicht "Tote Leiche" !</P>

          <HR width="60%">

          <P>Adam sitzt im Paradies und langweilt sich. Da fragt er Gott: "Kannst du
          mir jemanden machen, der sch&ouml;n, intelligent und zum lieb haben
          ist?"<BR>

          Darauf antwortet Gott: " Ja klar ! Daf&uuml;r brauch ich aber Deinen linken
          Arm und dein linkes Bein.<BR>

          Adam &uuml;berlegt und fragt: "Und was krieg ich f&uuml;r eine Rippe?"</P>

          <HR width="60%">

          <P>Ein Ehepaar sitzt abends vor dem Fernseher und schaut sich eine
          Tiersendung an.<BR>

          Sie zu ihm: "Du Schatz, findest du auch, da&szlig; Nagetiere dumm und
          gefr&auml;&szlig;ig sind?"<BR>
          Er: "Ja, mein M&auml;uschen ! "</P>

          <HR width="60%">

          <P>Was sind die vier Wunder der Frau?<BR>
          - Sie geben Milch, ohne Gras zu fressen.<BR>
          - Sie bluten, ohne sich zu schneiden.<BR>
          - Sie werden feucht, ohne da&szlig; es regnet.<BR>
          - Sie reden dummes Zeug, ohne gefragt zu werden.</P>
          <HR width="60%">

          <P>Warum t&auml;uschen so viele Frauen einen Orgasmus vor?<BR>
          Weil sie glauben, da&szlig; es uns interessiert.</P>

          <HR width="60%">

          <P>Warum k&ouml;nnen Frauen so schlecht furzen ?<BR>
          Weil sie den Mund nicht lange genug halten k&ouml;nnen, um den n&ouml;tigen
          Druck aufzubauen !</P>

          <HR width="60%">

          <P>Warum k&ouml;nnen &auml;ltere Frauen schlechter einparken als j&uuml;ngere?<BR>
          Im Alter l&auml;&szlig;t das Geh&ouml;r nach...</P>

          <HR width="60%">

          <P>Warum sind Junggesellen schlanker als Ehem&auml;nner?<BR>
          Der Junggeselle kommt abends nach Hause, schaut in den K&uuml;hlschrank, da
          ist nichts Ordentliches drin und geht ins Bett.<BR>
          Der Ehemann kommt abends nach Hause, schaut ins Bett, da ist nichts
          Ordentlichen drin und geht an den K&uuml;hlschrank.</P>
          <HR>

          <P>J&ouml;rg Rudlaff</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

