<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Interview Nr 1</TITLE>
  </HEAD>

  <BODY background="nc_bg2.jpg" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <CENTER>
            <P><FONT color="#000080" size="7"><B>Amiga Arena Interview</B></FONT></P>

            <TABLE width="60%" cellpadding="0" cellspacing="0" summary="">
              <TR>
                <TD valign="top">Entwickler:</TD>
                <TD><B>Chris Hodges</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Software:</TD>
                <TD>Poseidon etc.</TD>
              </TR>

              <TR>
                <TD valign="top">Homepage:</TD>
                <TD>http://www.platon42.de</TD>
              </TR>

              <TR>
                <TD valign="top">Email:</TD>
                <TD>chrisly@platon42.de</TD>
              </TR>
            </TABLE>
          </CENTER>

          <P><FONT color="#006000"><B>Hallo Chris, kannst Du bitte etwas &uuml;ber
          Dich und Deinem Amiga Werdegang erz&auml;hlen?</B></FONT><BR>

          Aufgewachsen in einem Vorort von M&uuml;nchen mit allerlei Rechnern und
          verr&uuml;ckten Leuten, mit diversen Hochs und Tiefs, gab mir der Amiga
          relativ konstant eine sch&ouml;ne Zeit (4844 von bisher etwa 9418 Tagen).
          Offensichtlich deterministisch studiere ich noch Informatik an der TU
          M&uuml;nchen. Ich mag Pommes mit Vanilleeis. Ich kann mit einer Hand
          klatschen. Und mit dem Amiga mache ich alles, was ich will: Die Freiheit
          nehm ich mir.</P>

          <P><FONT color="#006000"><B>Wer Deine Homepage besucht, wird feststellen,
          dass Du schon etliche Programme f&uuml;r den Amiga geschrieben hast.
          Darunter auch viele PD Spiele. Kann man in Zukunft vielleicht mit einem
          neuen Spiel rechnen oder einer &uuml;berarbeiteten Version einiger
          Klassiker wie "Tubes" oder "F.T.C"?</B></FONT><BR>

          Ich hab hier seit einigen Jahren noch die Grafiken und Daten zu einem Spiel
          herumliegen (knapp 20MB), dass ich zusammen mit Andreas Lindinger mal im
          Zuge dunkler Jugends&uuml;nden f&uuml;r Wintelkisten geschrieben habe,
          leider aber nie fertig wurde. Mich reizt es schon seit langem, eine
          Umsetzung f&uuml;r eine Amiga Plattform zu schreiben. Und dann gibt es da
          noch Ideen f&uuml;r Tubes II. Aber je &auml;lter man wird, desto weniger
          Zeit hat man f&uuml;r derartige Projekte. Trotzdem hat das Spieleschreiben
          wahnsinnig viel Spass gemacht.</P>

          <P><FONT color="#006000"><B>Kommen Wir zur Deiner aktuellen
          Softwareentwicklung "Poseidon USB", die ja bekanntlich f&uuml;r die USB
          Karten "Highway" und "Subway" entwickelt wurde. Welche Aufgabe
          &uuml;bernimmt "Poseidon" f&uuml;r diese und andere Karten?</B></FONT><BR>

          Nunja, Poseidon ist ein sog. USB Stack. Die Software besteht aus grob drei
          Teilen: Den Hardwaretreibern, die den eigentlichen USB Controller auf die
          Amiga-Seite abbilden (low-level), der Hauptlibrary, die die Verwaltung der
          Ger&auml;te am Bus betreibt (und diverse andere Dienste beinhaltet) und
          schliesslich den Klassentreibern, die die Funktionalit&auml;t der
          Ger&auml;te bereitstellen -- sprich, die USB Maus abfragen, oder das
          Keyboard einbinden oder eben Flashkartenleser usw. ins System zu
          integrieren.</P>

          <P><FONT color="#006000"><B>Wie bist Du dazu gekommen "Poseidon USB" zu
          entwickeln?</B></FONT><BR>

          Michael B&ouml;hmer wollte seine seit langer Zeit entwickelten Karten
          (Highway/Subway) verkaufen.Leider liess die Software auf sich warten. Als
          im M&auml;rz immer noch nichts Lauff&auml;higes vorhanden war, sprang ich
          kurzer Hand ein -- ich wollte sowieso einen Stack schreiben, da ich annahm,
          dass der AmigaOS4 Stack (und die urspr&uuml;nglich geplante Stack) wohl
          kaum f&uuml;r MorphOS verf&uuml;gbar sein w&uuml;rde. Ich hatte (blaue)
          Schmetterlinge im Bauch und wollte ein Produkt f&uuml;r alle User haben.Tja
          nach drei Wochen hatte ich ein grundliegendes Design und eine
          funktionierende USB Maus.</P>

          <P><FONT color="#006000"><B>Wie oder was ist entscheidend, dass ein Treiber
          f&uuml;r Hardware XY geschrieben wird bzw. umgesetzt wird?</B></FONT><BR>

          Es muss sich um Hardware handeln, die sich an einen USB Standard h&auml;lt
          oder die Userbasis muss gross genug sein. Nat&uuml;rlich muss ich auch
          Zugriff auf die Hardware haben und der Aufwand sich in einem sinnvollen
          Rahmen bewegen. So macht es z.B. keinen Sinn, Treiber f&uuml;r Winmodems zu
          entwickeln.</P>

          <P><FONT color="#006000"><B>Wird "Poseidon USB" in Zukunft auch andere
          Karten unterst&uuml;tzen bzw. welche Karten werden zur Zeit
          unterst&uuml;tzt?</B></FONT><BR>

          Es steht grunds&auml;tzlich jedem frei, einen Hardwaretreiber f&uuml;r USB
          Kontroller zu schreiben --sei es nun f&uuml;r Zorrokarten, PCMCIA oder
          PCI-Chips&auml;tze. Nat&uuml;rlich kann ich mich selbst nicht um die ganzen
          Hardwarekonstellationen k&uuml;mmern -- dazu habe ich weder die Zeit, noch
          die n&ouml;tige Hardware.</P>

          <P>Es gibt bereits Treiber f&uuml;r Highway/Subway,Thylacine (beta), GRex
          &amp; Pegasos, Spider USB (PCI/Mediator). Ein Treiber f&uuml;r OpenPCI
          (Prometheus, GRex, MorphOS, Berniethlon) befindet auch in Entwicklung,ist
          aber noch nicht ganz lauff&auml;hig.</P>

          <P><FONT color="#006000"><B>Wie lange hat die Entwicklung bisher
          gedauert?</B></FONT><BR>

          Seit M&auml;rz diesen Jahres mit einigen Unterbrechungen aufgrund meines
          Studiums. Genaue Angaben in Mannjahren kann ich Dir jetzt nicht nennen
          :)</P>

          <P><FONT color="#006000"><B>Welche Software verwendest Du zum
          Entwickeln?</B></FONT><BR>

          GoldED als Editor, SAS/C f&uuml;r die 68k-Version, GCC f&uuml;r die
          MorphOS-Version, CyberGuard, BDebug, SmartCrash, MungWall, MuForce,
          PatchWork, Sashimi.</P> Und vieeeel Musik von Aimee Mann.

          <P><FONT color="#006000"><B>Was denkst Du, wie lange wirst Du noch damit
          verbringen, neue Treiber zu erm&ouml;glichen?</B></FONT><BR>

          Programmieren ist wie Sex: Ein Fehler, und Du musst ihn Dein Leben lang
          ausbaden.Mindestens so lange, bis Poseidon vollj&auml;hrig ist (was auch
          immer das bedeuten mag).</P>

          <P><FONT color="#006000"><B>Welche Features w&uuml;rdest Du besonders
          hervorheben, die "Poseidon USB" bietet?</B></FONT><BR>

          Es ist stabil, sauber designed, einfach f&uuml;r Anwender als auch
          Entwickler. Und dessen Programmierer hat einen subtilen Sinn f&uuml;r
          Humor. Es gibt eine lange Anleitung, in die keiner schaut.Und die Leute
          haben unglaublich viele M&ouml;glichkeiten gefunden, "Poseidon" oder
          "Trident" falsch zu schreiben (vielleicht sollte ich einen Contest
          machen?).Uhm, es l&auml;sst sich resetfest einbinden.</P>

          <P><FONT color="#006000"><B>Was k&ouml;nnen wir von zuk&uuml;nftigen
          Versionen erwarten?</B></FONT><BR>

          Die HID-Klasse f&uuml;r fliegende Teppiche,Alarmanlagen und
          K&uuml;hlschr&auml;nke. Ethernet-Treiber (wobei ich immer noch
          empfehle,lieber die Norway zu kaufen). Scannertreiber (wenn ich denn mal
          einen habe). Und nat&uuml;rlich die Erf&uuml;llung der nie endenwollenden
          W&uuml;nsche der User.</P>

          <P><FONT color="#006000"><B>"Poseidon USB" kann ja auch von anderen
          Herstellern in Anspruch genommen werden, da sich die User der jeweiligen
          USB Karte (ausgenommen "Highway"/ "Subway" Kunden) registrieren lassen
          m&uuml;ssen.An sich eine gute Idee, um "Poseidon USB" so vielen wie
          m&ouml;glich zug&auml;nglich zu machen (Entwicklern/Anwendern). Allerdings
          bef&uuml;rchtest Du nicht, dass mit gecrackten Keyfiles der Anteil derer
          steigt, die "Poseidon USB" illegal nutzen und somit Deine Arbeit
          gef&auml;hrden?</B></FONT><BR>

          Ich w&uuml;nsche allen Crackern viel Spass mit gecrackten Keyfiles. Ich
          habe einige Wochen damit verbracht, mich in entsprechend neue
          kryptographische Verfahren einzuarbeiten,die entsprechend sicher sind --das
          hilft nat&uuml;rlich nichts gegen Cracker die das Softwarepaket
          manipulieren. Darum wird es entsprechend h&auml;ufig Updates geben. Und
          legal registrierte Keyfiles weiterzugeben ist keine gute Idee,da die
          kompletten Daten der User im Keyfile gespeichert sind und in Trident
          angezeigt werden.</P> Grunds&auml;tzlich habe ich Poseidon nicht
          geschrieben,um damit das grosse Geld zu machen.Aber wenn man
          erf&auml;hrt,dass von seiner uneingeschr&auml;nkten Postcard-Version
          Raubkopien kursieren (Deli14BitGenie),dann ist das ungeheuer demotivierend
          (was auch zum Entwicklungsstopp damals gef&uuml;hrt hatte). Es ist
          deprimierend, wieviel Geld die Leute f&uuml;r Hardware ausgeben, nicht
          jedoch bereit sind, die wirklich l&auml;cherlichen Geb&uuml;hren f&uuml;r
          Software zu zahlen.

          <P><FONT color="#006000"><B>Lohnt sich die Arbeit und der Aufwand
          &uuml;berhaupt noch f&uuml;r den eigentlich nicht mehr vorhandenen Amiga
          Markt?</B></FONT><BR>

          Lohnt es sich, ein Bild zu malen? Ein Gedicht zu schreiben? Der Amiga macht
          mir Spass und erm&ouml;glicht es mir, mich selbst zu verwirklichen. Und
          wenn man wieder eine Mail von einem zufriedenen User bekommt oder Menschen
          kennenlernt,wie die auf der O.A.S.E. in Graz, dann definitiv: Ja, es lohnt
          sich.</P>

          <P><FONT color="#006000"><B>"Poseidon USB" ist ab sofort &uuml;ber
          "IOSpirit" von Felix Schwarz erh&auml;ltlich, was versprichst oder
          erwartest Du von dieser Kooperation?</B></FONT><BR>

          Ganz einfach:Dass die User, die sich registrieren <B>wollen</B>, dies auch
          ganz einfach tun <B>k&ouml;nnen</B>.Vorher war das ja mit dem Postweg doch
          etwas umst&auml;ndlich und langsam.</P>

          <P><FONT color="#006000"><B>Angesichts der zu erwartenden neuen
          Rechnergeneration d&uuml;rfte USB f&uuml;r Classic Amiga Computer doch
          eigentlich ein totes Gesch&auml;ft sein, was die Entwicklung und Kosten
          betrifft, oder?</B></FONT><BR>

          Ersteinmal ist Poseidon nicht auf die 'Classics' beschr&auml;nkt. Doch Du
          hast Recht: Durch diese ganzen Ank&uuml;ndigungen (die dann aber immer und
          immer wieder um Monate verschoben werden) sparen sich die User
          Investitionen in verf&uuml;gbare Hardware f&uuml;r die alten Amigas. Das
          ist dem Markt sehr abtr&auml;glich und auch die H&auml;ndler leiden
          darunter. Aber wer heute noch denkt, man k&ouml;nnte mehr als
          Entwicklungskosten f&uuml;r ein Amigaprodukt wieder hereinholen, vielleicht
          sogar davon leben, tja, der hat wohl zu viel Platon "Der ideale Staat"
          gelesen :)</P>

          <P><FONT color="#006000"><B>Lohnt es sich Deiner Meinung nach, heute noch
          in neue Hardware f&uuml;r den Amiga zu investieren als User?</B></FONT><BR>

          Gerade bei USB kann man ja seine Hardware (bis auf den Controller) dann
          problemlos von einem Rechner zum n&auml;chsten schleppen -- auch wenn es
          vielleicht nicht einmal mehr ein Amiga ist. Selbst Michael B&ouml;hmer
          verwendet keine Disketten mehr, sondern kopiert seine Daten nur noch auf
          ein Flash-Medium, wenn er diese schnell mal von einem Rechner zum anderen
          transportieren will. Nur weil man sich einen Pegasos kauft, l&auml;st sich
          der alte Rechner doch nicht pl&ouml;tzlich in Luft auf?</P>

          <P><FONT color="#006000"><B>F&uuml;r welches System (AmigaOS, AmigaDE,
          MorphOS) entwickelst Du?</B></FONT><BR>

          An AmigaDE habe ich einfach keinerlei Interesse,auch wenn die Idee dahinter
          ganz nett ist.Ebenso wird es von mir nichts in Richtung x86 geben, da ich
          das einfach f&uuml;r eine Sackgasse halte. Poseidon ist f&uuml;r das 68K
          AmigaOS und MorphOS PPC native entwickelt.</P>

          <P><FONT color="#006000"><B>Welches Betriebssystem wirst Du zuk&uuml;nftig
          unterst&uuml;tzen? Was sind die Gr&uuml;nde, um dieses OS zu
          unterst&uuml;tzen?</B></FONT><BR>

          Nat&uuml;rlich wird mein alter Amiga noch so lange unterst&uuml;tzt, bis er
          in seine Einzelteile zerf&auml;llt. Mein zuk&uuml;nftiger Weg wird aber
          MorphOS sein, da dort einfach die Atmosph&auml;re stimmt. Dort steckt das
          Potential f&uuml;r ein neues Betriebssystem.Vielen ist einfach nicht klar,
          wieviel tolle Ans&auml;tze das AmigaOS hat, die man nirgendwo anders
          findet. Andererseits ist das AmigaOS in einigen Teilen einfach so
          &uuml;berholt, dass es ohne ein komplett neues Design nicht mehr geht. Im
          MorphOS-Team sind meines Erachtens die Leute, die den Geist des Amigas
          weitertragen k&ouml;nnen (was nicht heissen soll, dass beim AmigaOS4-Team
          nicht auch sehr f&auml;hige Entwickler dabei sind). Es basiert mehr auf
          einem guten menschlichen Kontakt als auf exklusiven, kommerziellen
          Vertr&auml;gen.Mir ist nicht so wichtig, was auf der Schachtel steht. Und
          die A-Box ist ja nur der Anfang.</P>

          <P><FONT color="#006000"><B>Welche M&ouml;glichkeiten vermisst Du am
          AmigaOS f&uuml;&frac14;r die Entwicklung?</B></FONT><BR>

          Hm. Gute Frage. Bis auf Speicherschutz, der ja teilweise auch durch
          Guardian Angel aktiviert werden kann und einem "make what-I-have-in-mind"
          Target eigentlich nichts.</P>

          <P><FONT color="#006000"><B>Welche M&ouml;glichkeiten w&uuml;nschst Du Dir
          f&uuml;r die Entwicklung am Amiga?</B></FONT><BR>

          zweiten Monitor und einen sich automatisch aufr&auml;umenden
          Schreibtisch.</P>

          <P><FONT color="#006000"><B>Welche Hard-/Software hast Du vor zu
          kaufen?</B></FONT><BR>

          Wenn ich mal wieder viel Zeit haben sollte, w&uuml;rde ich mir gerne mal
          ein paar Spiele kaufen.Die Demoversion von Payback hat mir gut gefallen und
          Simon I &amp; II w&uuml;rde auch gerne mal sehen. Hardware? Etwas USB
          Hardware (f&uuml;r die ich dann die Treiber schreiben darf ;) ) und
          nat&uuml;rlich einen Pegasos.</P>

          <P><FONT color="#006000"><B>Glaubst Du an ein Comeback von
          Amiga?</B></FONT><BR>

          Spielt das wirklich eine Rolle? Die Frage ist: Bin ich selbst mit meinem
          Rechnersystem gl&uuml;cklich? Kann ich stolz darauf sein? Ist es mir lieber
          als die anonymen Wintel-Maschinen oder DAU-Macs? Was will ich wirklich?
          Darauf kommt es an und nichts anderes. Ich bin ein Amiga User, weil ich
          Spass daran habe (und mich gerne vor meinen Kommilitionen aufziehen lasse),
          und weil ich ganz genau wei&szlig;, warum ich diese Maschine so gerne hab.</P>

          <P><FONT color="#006000"><B>Deine letzten Worte an die
          Leser?</B></FONT><BR>

          Esst mal wieder einen Apfel.</P>

          <P align="center">-- &copy; Amiga Arena 10/2002 --</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

