<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Interview Nr 1</TITLE>
  </HEAD>

  <BODY background="nc_bg2.jpg" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <CENTER>
            <P><FONT color="#000080" size="7"><B>Amiga Arena
            Interview</B></FONT></P>

            <TABLE width="60%" cellpadding="0" cellspacing="0" summary="">
              <TR>
                <TD valign="top">Entwickler:</TD>             
                <TD><B>Lars "Ghandy" Sobiraj<BR>
                 Marc "Zito" Oberst</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Software:</TD>
                <TD>Diskmags, Websites, Asciis..</TD>
              </TR>

              <TR>
                <TD valign="top">Homepage:</TD>       
                <TD>www.Diskmag.de<BR>
                 www.JurassicPack.de.vu<BR>
                 www.SINNsitiv.de.vu</TD>
              </TR>

              <TR>
                <TD valign="top">Email:</TD>          
                <TD>ghandy@vantage.ch<BR>
                 zito@uni.de</TD>
              </TR>
            </TABLE>
          </CENTER>

          <H3><B><U>&uuml;ber euch:</U></B></H3>

          <P><FONT color="#006000"><B>Bitte stellt Euch den Lesern vor!</B></FONT><BR>
          <B>Ghandy:</B><BR> 
          Mein Name ist Lars Sobiraj, ich bin 36 Jahre alt und arbeite hauptberuflich
          in der ambulanten Krankenpflege. Nebenberuflich mache ich ab und zu den
          Szenereport f&uuml;r die Zeitschrift MacLife, das ist aber mehr ein Hobby
          als alles andere... ;-)</P>

          <P><B>Zito:</B><BR> Also mein Name ist Marc Oberst, bin geb&uuml;rtiger
          Leipziger und Philosophiestudent. 22 Jahre verweile ich nun schon als
          solcher auf diesem Planeten, aber ich denke du willst noch etwas anderes
          wissen, Olaf... Ich nutze den Amiga - neben allem m&ouml;glichen, was man
          eben mit einem Computer macht (will sagen, dies ist mein einziger Computer,
          habe keinen PC nebenher) - haupts&auml;chlich um meiner Kreativit&auml;t
          Ausdruck zu verleihen. Ich schreibe darauf nicht nur Kurzgeschichten usw.
          sondern bin auch in der legalen Amiga Demo Szene t&auml;tig als
          Ascii-K&uuml;nstler und als Artikelschreiber, einem Freund Lars "Ghandy"
          Sobiraj.</P>

          <P><FONT color="#006000"><B>Wann habt Ihr begonnen, mit dem Amiga zu
          arbeiten?</B></FONT><BR>
          <B>Ghandy:</B><BR> Oha, gute Frage, ist schon lange her. Ich habe vor
          vielen Jahren mit dem C=128 angefangen und mir dann nach einem halben Jahr
          den Amiga 500 gekauft. Zun&auml;chst habe ich, wie vermutlich jeder andere
          Anf&auml;nger damals auch, meine Zeit nur mit Zocken verbracht. Wenn ich
          mir im Vergleich die heutigen Spiele betrachte, egal auf welchem
          Computersystem, oder Spieleconsole, kommt h&auml;ufiger Wehmut auf. Die
          damaligen Softwareh&auml;user waren unglaublich innovativ, sie hatten tolle
          Ideen. Viele Games spr&uuml;hten auch vor Selbstironie, war eine tolle Zeit
          mit klasse Spielen damals.</P>

          <P><B>Zito:</B><BR> 
          Hmh, bei mir war das auch 1991 (ein Weihnachtsgeschenk f&uuml;r mich und
          meine Schwester), allerdings war es damals weniger Arbeiten und mehr
          Spielen wie auch bei Ghandy. Ich bin dann 1992 in die lokale Demoszene
          reingerutscht und noch immer begeistert dabei. Um diese Zeit habe ich
          nat&uuml;rlich auch alle meine Hausaufs&auml;tze mit dem Amiga geschrieben,
          aber richtig arbeite ich sowieso nicht (bin ja Student, hehe),
          insofern...</P>

          <P><FONT color="#006000"><B>Welches Amiga-Modell besitzt
          Ihr?</B></FONT><BR> 
          <B>Zito:</B><BR>    
          Mein HauptAmiga ist mein A1200 (Elbox) mit Blizzard060/50mhz und 2/64mb
          Ram, 2 Festplatten (40gb, 5gb), HD-Floppy, CD-Brenner, CDRom-Laufwerk,
          Flickerfixer, IDE-FixEXPRESS und solchem Schnickschnack, Hardwarepatching
          eben. Daneben steht ein A4000 mit 030/40mhz ohne grosse Extras. Meinen
          alten A1200 habe ich an meine Schwester verliehen, die ebenfalls noch
          unseren ersten A500 von 1991 benutzt, weshalb ich mir einen neueren 500er
          zugelegt habe.</P>

          <P><B>Ghandy:</B><BR>
          Amiga 4000/060 inklusive Cybervision64, CD-Rom etc., ich arbeite noch immer
          sehr gerne damit. Daneben fristet ein PC sein Dasein, mit ihm, bzw. mit
          dessen Betriebssystem zu arbeiten, ist aber alles andere als ein
          Vergn&uuml;gen. Beide Rechner sind per Router mit der DSL-Flatline
          verbunden, aber in der heutigen Zeit macht es extrem viel Sinn mit Yam
          weiter als Mailer zu arbeiten. In den letzten Monaten habe ich alleine
          40-50 Viren erhalten, einige davon h&auml;tten sich sicher
          selbstst&auml;ndig gemacht, wenn ich Outlook benutzt h&auml;tte.</P>

          <P><FONT color="#006000"><B>Welche Version des Betriebssystems l&auml;uft
          auf Eurem Computer?</B></FONT><BR>  
          <B>Ghandy:</B><BR>                  
          Um ehrlich zu sein, noch immer mit OS 3.5. Ich bin irgendwie zu bl&ouml;d
          Picasso96 davon zu &Uuml;berzeugen zu funktionieren, wenn ich OS 3.9
          installiert habe. Nach diversen Versuchen habe ich es dann gelassen und
          wieder mein altes Backup aufgespielt. Weltbewegende Ver&auml;nderungen
          konnte ich im 3.9er sowieso nicht entdecken, es sah f&uuml;r mich eher wie
          eine Toolsammlung aus dem Aminet aus, die man mal eben auf einer CD
          zusammengestellt hat (und die daf&uuml;r sehr viel Geld kostet, auch heute
          noch)!</P>

          <P><B>Zito:</B><BR>           
          Das stimmt, so viele Unterschiede sind oberfl&auml;chlich nicht
          festzustellen. Trotzdem l&auml;uft auf meinem 1200er OS3.9, auf dem A4000
          OS3.0 und auf dem A1200 den meine Schwester ein nacktes OS3.1.</P>

          <P><FONT color="#006000"><B>Welche Software habt Ihr zuletzt f&uuml;r Den
          Amiga gekauft?</B></FONT><BR>
          <B>Ghandy:</B><BR>            
          Amiga OS 3.9 ;-))) Die meisten Programme, die ich benutze, sind
          Freeware.</P>

          <P><B>Zito:</B><BR>
          ...oder total veraltet, aber gut! :-) Bei mir war das OS3.9 mit einem
          Freund zusammen.</P>

          <P><FONT color="#006000"><B>Welche Software verwendet Ihr
          noch?</B></FONT><BR>
          <B>Ghandy:</B><BR>            
          Ich liebe Yam! Verglichen mit mail clients auf Wintel Maschinen ist es
          einfach fantastisch. Bei Yam muss man keine Anleitung lesen, alles geht
          v&ouml;llig intuitiv und automatisch, quasi learning by doing. Keine
          &Uuml;berzogene graphische Oberfl&auml;che, kein Schnickschnack, keine
          Sicherheitsprobleme, wie die von Outlook Express etc. Ich brauchte mich nie
          in eine neue Version einzuarbeiten, das ging ganz von alleine. Directory
          Opus ist auch absolut genial, ich bevorzuge allerdings eine &auml;ltere
          Version. Ansonsten habe ich mir damals den Cygnus Editor gekauft und egal
          auf welchem System ich danach suchte, ich habe nie etwas Vergleichbares
          gefunden.</P>

          <P><B>Zito:</B><BR>
          Ich benutze auch haupts&auml;chlich den CygnusEd, Yam, Eagleplayer und
          nat&uuml;rlich DOpus Magellan. Ohne letzteres w&auml;re die Bedienung des
          Amiga nicht halb so komfortabel! (Ich kann nicht verstehen wie einige
          Amiganer immer noch auf die nackte Workbench schw&ouml;ren!)</P>

          <P><FONT color="#006000"><B>Welche Hard-/Software hab Ihr vor zu
          kaufen?</B></FONT><BR>
          <B>Zito:</B><BR>              
          Unbedingt ein GFX-Card und einen neuen Monitor. Auch eine neue Version von
          MakeCD w&uuml;rde ich kaufen (ich habe nur 3.2c gebraucht erworben) wenn
          sie die ganzen neuen handels&uuml;blich Brenner direkt unterst&uuml;tzen
          w&uuml;rden wie Acer oder Creative, das neue OS wenn es sich lohnt und
          demn&auml;chst vielleicht WHDLoad, weil die Jungs sich ehrlich viel
          M&uuml;he geben und gute Arbeit leisten.</P>

          <P><B>Ghandy:</B><BR>
          Im Moment keine, wenn ich ehrlich bin. Ein Freund hat mir vor ein paar
          Monaten eine PPC Karte zum Kauf angeboten, bei den &uuml;blichen Preisen
          f&uuml;r dieses "Teil" ist mir echt schlecht geworden. Warum soll ich in
          tote Hardware investieren? Wenn ich Raytracing Fan w&auml;re oder
          aufwendige Bildbearbeitung auf dem Amiga machen w&uuml;rde, w&auml;re das
          vielleicht etwas anderes.</P>

          <P>Und die Demoszene benutzt diese Prozessoren gl&uuml;cklicherweise bisher
          nicht so viel. Auf der Mekka&amp;Symposium Party vor ein paar Wochen sind
          aber ein paar echt geniale Sachen f&uuml;r PPC rausgekommen. Speziell die
          polnischen Programmierer beginnen sich darauf "einzuschie&szlig;en".</P>

          <P><FONT color="#006000"><B>Glaubst Ihr an ein Comeback von
          Amiga?</B></FONT><BR>
          <B>Zito:</B><BR> Naa, nicht wirklich! Die haben uns 5 Jahre hingehalten und
          mit ihrer MS Unterst&uuml;rtzung wird der neue Amiga einfach nicht mehr das
          sein, was der Classic war. Ich werde auf dem A1200/A4000 bleiben und weiter
          aufr&uuml;sten bis die Machinchen ihren Geist aufgeben. Was dann kommt
          weiss ich nicht, aber Amiga Inc. will sich meiner Meinung nach nur an uns
          Fans bereichern (siehe meine Artikel in Jurassic Pack #8 und #9 und
          NoCover97 und 96).</P>

          <P><B>Ghandy:</B><BR>         
          Genau! Wenn ich sehe was die Herren jenseits des grossen Teiches machen,
          nein! Nat&uuml;rlich w&auml;re es mein Traum wenn es doch dazu kommen
          w&uuml;rde. Irgendwann vor ein paar Jahren habe ich aufgeh&ouml;rt zu
          hoffen, es hatte ja doch keinen Zweck.</P>

          <P>Aber: Amiga Besitzer sind stur, sie wissen was ihnen ihr System wert
          ist, auch wenn die ganze Welt etwas anderes tut. Lasst den anderen ihre
          Gigaherz, wir sind mit dem gl&uuml;cklich, was wir haben. Uns bietet unser
          Rechner auch mit 50mhz mehr als genug. Ich mag diese Klarheit und
          Geradlinigkeit.</P>

          <P>Seit ca. drei Monaten arbeite ich auch mit einem PC. Es ist nicht alles
          so schlecht, wie man es sich in Amiga Kreisen erz&auml;hlt. In Windows
          wurden auch echt gute Ideen verwirklicht, allerdings habe ich das
          Gef&uuml;hl die Kontrolle &uuml;ber die Maschine verloren zu haben. Win
          macht was es will, schwer nachzuvollziehen, womit die Kiste gerade wirklich
          bech&auml;ftigt ist. Auch kann ich nicht mehr von Hand in Systemdateien
          "rumfummeln", das w&uuml;rde mir Bill sp&auml;testens beim
          n&auml;&curren;chsten Bootvorgang nicht verzeihen.</P>

          <H3><B><U>Der Einstieg:</U></B></H3>

          <P><FONT color="#006000"><B>Wie seid Ihr selber in die "Szene"
          gelangt?</B></FONT><BR>       
          <B>Ghandy:</B><BR> Mich hat im Jahr 1991 ein Typ mit dem Pseudonym Brainy
          in die damalige illegale Crackerszene eingef&uuml;hrt. Ich habe dann im
          D&uuml;sseldorfer Umkreis die lokalen Boards gecalled und Warez getraded,
          wie jeder andere Depp auch. Kurz nach Weihnachten '93 war ich in Herning in
          D&auml;nemark auf "The Party", das hat alles f&uuml;r mich ver&auml;ndert.
          Ich war total von der Kreativit&auml;t und Power der Demoszene begeistert,
          irgendwie habe ich dann zwar die Crackerszene am Rande mitverfolgt, aber
          mein Herz hatte ich schon an die Demoszene verloren. Demos wie "Arte" von
          Sanity oder "Motion" von Bomb auf der grossen Leinwand der Party zu sehen,
          zu verfolgen wie viel die Programmierer aus dieser kleinen Kiste, damals
          einem A1200/020 rausgeholt haben, das hat mich total gefesselt. Bei dieser
          Faszination ist es bis heute geblieben...</P>

          <P><B>Zito:</B><BR>           
          Bei mir war das 1992 &uuml;ber einen Schulfreund. Ich hatte schon einen
          A500 zu Weihnachten bekommen, aber nachdem ich 1992 die Schule gewechselt
          hatte, habe ich Friedhelm (aka The Edicather) kennengelernt, der mich in
          die legale Szene einf&uuml;hrte. Wir haben damals n&auml;chtelang
          zugebracht Disks zu kopieren und uns alle Demos und Intros, die wir
          bekommen konnten, immer wieder reinzuziehen. Das war eine tolle Jugend! Wir
          haben auch versucht (im Tracken waren wir beide ganz gut f&uuml;r damalige
          Verh&auml;ltnisse und er konnte auch ganz gut Pixeln) eigene Demos mit dem
          Demomaker von Red Sector zu machen und haben es geschaft 8 Intros und eine
          Musikdisk zu herauszubringen!</P>

          <P>Trotzdem hat uns das nicht sonderlich zu Ruhm verholfen, weil Demomaker
          damals als &auml;u&szlig;erst "Lame" galten.</P>

          <P>International aktiv geworden bin ich nach einer kurzen Computerpause
          erst 1997. Da habe ich angefangen zu swappen, d.h. auf Disketten und
          postalischem Weg Demos, Intros und Dergleichen an andere Szener zu
          verschicken und so viele gute Freunde zu finden und auch anders kreativ zu
          werden. So habe ich auch sofort angefangen Asciis zu machen und sp&auml;ter
          (ab 1998) zu schreiben, da ich zwischen 1991 und 1996 feststellen musste,
          dass mir Coden zu hoch und Pixeln zu schwierig war. Das Tracken habe ich
          inzwischen aufgegeben, da ich was Musikmachen betrifft auf dem Stand von
          1990 h&auml;ngengeblieben bin! :-)</P>

          <P><FONT color="#006000"><B>Was unterscheidet einen "Szener" von einem
          nicht "Szener"?</B></FONT><BR>
          <B>Zito:</B><BR>              
          Ich w&uuml;rde sagen, dass er aktiv an der Szene teilnimmt. Ist dasselbe
          wie ein Arbeitnehmer und ein Arbeitsloser! ;)</P>

          <P><B>Ghandy:</B><BR>         
          Es gibt viele Leute, die sich ab und zu mal ein Demo anschauen ohne selber
          am Geschehen teilzunehmen. Wenn einer dieser Betrachter dann anf&auml;ngt
          selber kreativ zu werden und sich an der Szene zu beteiligen, wird er
          automatisch zum Mitglied. Tja, davon abgesehen kann ich keine Unterschiede
          zwischen "normalen Menschen" und Szenern erkennen.</P>

          <P><FONT color="#006000"><B>Wie kam es dazu JP ins Leben zu
          rufen?</B></FONT><BR>
          <B>Zito:</B><BR>              
          Oh, da musst du Ghandy fragen! Der hat damals mit Sixpack das Ding ins
          Leben gerufen. Ich mache es als sein Nachfolger seitdem wir beide es
          letztes Jahr wieder aus der Mottenkiste geholt haben! (Es gibt in der
          aktuellen Ausgabe &uuml;brigens einen ellenlangen Artikel von Ghandy
          dar&uuml;ber. Sehr interessant!)</P>

          <P><B>Ghandy:</B><BR>
          Ja... Jurassic Pack war damals tats&auml;chlich als Pack gedacht. Pal Inge
          Johannson aka Sixpack of Gods hatte vor vielen Jahren den Auftrag im Namen
          seiner Gruppe ein Pack zu machen. Ein Pack ist nichts anderes als eine
          Sammlung von Intros auf Diskette, plus ein ausf&uuml;hrbares Men&uuml;,
          welches die Intros automatisch startet. Anfang der 90er spielte der
          Austausch von Software per Post noch eine grosse Rolle. Pal-Inge war einer
          dieser Mailswapper, der die Produktionen seiner Gruppe per Post in die
          ganze Welt versendet hat. Unser damaliger Programmierer hat ihm, und
          sp&auml;ter mir aber noch viel mehr angeboten, n&auml;mlich eine f&uuml;r
          damalige Verh&auml;ltnisse gute Diskmag-Engine f&uuml;r ein komplettes
          Magazin. Jurassic Pack war nie ein Pack, es wurde vor einigen Jahren zu
          einem guten, aber eher am Rande stehenden Diskettenmagazin. Die
          f&uuml;hrende Rolle haben damals andere Magazine inne gehabt, wie z.B. ROM,
          RAW, Generation, Seenpoint etc.</P>

          <P>Heutzutage benutzen wir eine andere Engine, und wir haben diese
          F&uuml;hrungsposition inne, wir sind inhaltlich sehr viel besser geworden
          und, ehrlich gesagt, die Konkurrenz hat insgesamt sehr, sehr abgenommen.
          Trotzdem k&ouml;nnen sich die szenebezogenen Mags auf dem Amiga im
          Vergleich zu den Publikationen auf dem PC noch immer gut sehen lassen.</P>

          <P>Im Gegenteil: PC Mags wie Hugi oder PAiN beinhalten sehr viel weniger
          Artikel, ihre Engines bieten trotz des hardwarem&auml;ssig bedingten
          Unterschiedes nicht mehr als die unsrigen. Die Hauptverantwortlichen der
          Mags in der Welt der Wintels haben grosse Probleme ihre Magazine mit Inhalt
          gef&uuml;llt zu bekommen, wollen sie nicht alles selber schreiben. Der
          Zusammenhalt ist dort einfach viel weniger gegeben, auch gibt es verglichen
          mit unserer Szene, sehr viel weniger Leute, die Lust haben Artikel zu
          schreiben.</P>

          <P><B>Zito:</B><BR>           
          Obwohl uns die Schreiber auch nicht unbedingt die T&uuml;ren
          einrennen...</P>

          <P><B>Ghandy:</B><BR>         
          Stimmt auch, okay!</P>

          <P><FONT color="#006000"><B>K&ouml;nnt Ihr mir sagen, worum es sich bei JP
          handelt?</B></FONT><BR>
          <B>Zito:</B><BR> Um ein Diskmag! Also um ein Magazin mit Artikel &uuml;ber
          alles was die Zielgruppe interessiert (wie jedes andere in der realen Welt
          auch), aber eben f&uuml;r Szener. Und es ist ausf&uuml;hrbar und hat
          deshalb ein paar Features, die gedruckte Magazine nicht bieten k&ouml;nnen,
          wie z.B. Lesebegleitende Musik, besondere Titelbilder.</P>

          <P><FONT color="#006000"><B>Wie lange gibt es JP schon?</B></FONT><BR>

          <B>Ghandy:</B><BR>            
          Seit 1995, also 7 Jahre. Am besten wirklich mal den von Zito oben
          erw&auml;hnten Artikel lesen!</P>

          <P><FONT color="#006000"><B>Welche Software verwendet Ihr zum Entwickeln
          von JP?</B></FONT><BR>
          <B>Zito:</B><BR> Haupts&auml;chlich den CygnusEditor, denn Artikel sind der
          Dreh- und Angelpunkt eines jeden Magazins, und nat&uuml;rlich die
          Diskmagengine selbst. Aber die hat uns ein britischer Freund und
          Programmierer zur Verf&uuml;gung gestellt, da das wirklich nicht unser
          Fachgebiet ist. Ausserdem muss ich die Cliparts und Titelbilder
          konvertieren und male selbst die Hintergr&uuml;nde. Dazu benutze ich
          PPaint6.4.</P>

          <P><FONT color="#006000"><B>Wie ensteht JP im einzelnen?</B></FONT><BR>
          <B>Zito:</B><BR> Also einen richtigen Anfang gibt es eigentlich nicht...
          Aber man kann sagen, dass es damit losgeht, dass wir uns um die Titelbilder
          und die Musiken k&uuml;mmern, d.h. wir machen e-Klingelputzen z.B. bei
          befreundeten Musikern und fragen nach ob sie nicht Lust haben, ein 3-7
          Minuten langes Protracker Lied zu schreiben. Am Ende sollten es immer 6
          St&uuml;ck sein (5 f&uuml;r das Magazin, damit dem Leser nicht langweilig
          wird, und eines f&uuml;r die Gallery). Titelbilder brauche wir pro Ausgabe
          3 St&uuml;ck und wenn eine Gruppe Zeit und Lust hat bekommen wir auch noch
          ein Intro dazu. Nebenbei schreiben wir Artikel, machen Interviews und
          betreiben Recherche im Internet zu verschiedenen Themen. Am Ende muss das
          ganze gelayoutet und korrigiert werden. Dann wird es in die Engine
          eingebaut und die Graphiken und Musiken d&uuml;rfen auch nicht vergessen
          werden.</P>

          <P><FONT color="#006000"><B>F&uuml;r welches System (AmigaOS, AmigaDE,
          MorphOS) erscheint JP?</B></FONT><BR>
          <B>Zito:</B><BR>              
          F&uuml;r jeden Classic Amiga ab OS3.0 mit 4mb Ram. That's all you need! :)
          (L&auml;uft sogar superstabil auf WinUAE.)</P>

          <P><B>Ghandy:</B><BR> Und nur f&uuml;r AmigaOS, alles andere h&auml;tte
          keinen Zweck, da die Zahl der Benutzer anderer Betriebssysteme, oder
          anderer Hardwareerweiterungen viel zu gering ist, geschweige denn die Zahl
          der an einer Szene interessierten User.</P>

          <P><B>Zito:</B><BR>
          Das schlechteste Beispiel daf&uuml;r ist der Mac.</P>

          <P><B>Ghandy:</B><BR>
          Genau, der hat ja leider auch eine minimale Szene, die sich bei weitem noch
          lange nicht zu ihren Grenzen hin entwickelt hat, leider. Viele aktuelle Mac
          Produktionen erinnern an ur-uralte Demos auf dem Amiga vor 8-10 Jahren, so
          hat die PC Szene auch mal angefangen...</P>

          <P><B>Zito:</B><BR>
          Aber f&uuml;r ein Diskmag braucht man auch nicht 1,5ghz oder Unmengen an
          Ram!</P>

          <P><FONT color="#006000"><B>Verliert Ihr nicht den Spass und das Interesse
          am herrausgeben von JP wenn Ihr die geringe Resonanz seht, die Ihr aus dem
          kleinen Amiga-Markt erhaltet?</B></FONT><BR>
          <B>Zito:</B><BR>              
          Manchmal zweifelt man schon, aber es macht einfach Spass. Dann schreibt man
          lieber f&uuml;r 500 wirklich interessiert, die eine besondere Leidenschaft
          mit einem selbst teilen, anstatt f&uuml;r 10.000, die das eh nur mal
          &uuml;berfliegen und sich nicht wirklich interessieren.</P>

          <P><B>Ghandy:</B><BR>         
          Und aussdem lebt die Amigaszene auch auf dem PC. Man mag es kaum glauben,
          aber eine Vielzahl unserer Leser haben NUR einen PC und schauen sich
          aktuelle und alte Amigademos usw. auf WinUAE an. Der Spirit ist einfach
          nicht zu toppen, und das h&auml;lt auch uns motiviert. Viele ziehen sich
          auch mpegs oder divx Versionen von aktuellen Demos, um sich diese zumindest
          als Video auf dem PC anschauen zu k&ouml;nnen.</P>

          <P>Was die Resonanz angeht, ich habe so manche Freunde, die mir ganz
          ausf&uuml;hrlich und konkret mitteilen, was ihnen gefallen oder auch nicht
          so gefallen hat. Das bringt mir schon einiges...</P>

          <P><FONT color="#006000"><B>Gibt die "Szene" noch gen&uuml;gent "Input" um
          ein Mag wie JP mit Artikeln zu f&uuml;llen?</B></FONT><BR>
          <B>Zito:</B><BR>              
          Auf jeden Fall, keine Frage. Sicher w&auml;re es sch&ouml;n wenn wir
          dreimal so viele Leser h&auml;tten, aber mit 400 Downloads der letzten
          Ausgabe von unserer Website www.JurassicPack.de.vu sind wir sehr
          zufrieden!</P>

          <P><B>Ghandy:</B><BR>         
          Ich habe noch immer viele Ideen f&uuml;r Artikel, selbst wenn die Szene an
          sich weniger an Themen anbietet als noch vor einigen Jahren. Naja, was
          solls...</P>

          <P><FONT color="#006000"><B>Seid Ihr dem Druck unterlegt nicht "Lame" zu
          sein d.h. m&uuml;st Ihr hochwertige Artikel von Szenern haben um angenommen
          zu werden?</B></FONT><BR>
          <B>Zito:</B><BR>              
          Also angenommen sind wir schon, liegt am Namen und Ghandy, hehe... ;) Aber
          gut sollten die Artikel schon sein, sonst liest uns ja keiner mehr. Ein
          bischen Konkurenz herrscht auch noch in der Amiga Diskmag Szene, da ja die
          EuroChart noch immer rauskommen und D.I.S.C. (D.igital I.nformation
          S.ervice for C.omputerfreaks) mit Ausgabe #11 letztes Jahr ebenso sein
          Revival feiern konnte! (Ausserdem hallt noch immer der gute Ruf von
          Devotion #2 nach, das leider das letzte Mal im Sommer 2001 erschienen ist.)
          Aber um als Szener generell "lame" zu sein, muss man heute schon sehr
          "lame" sein, denn die Szene ist - bedingt durch den R&uuml;ckgang ihrer
          Mitglieder - nicht mehr so elit&auml;r wie fr&uuml;her und viel
          freundlicher, besonders Neulingen gegen&uuml;ber! Trotzdem geben wir
          nat&uuml;rlich unser Bestes!</P>

          <P><FONT color="#006000"><B>K&ouml;nnen auch nicht "Szener" Artikel
          f&uuml;r Euch schreiben?</B></FONT><BR>
          <B>Zito:</B><BR>              
          Ja! Wir haben in "Jurassic Pack" eine Science Fiction Ecke (mit
          Kurzgeschichten und Essays), eine poetische Ecke und Vermischtes, wo ich
          mich ab und an z.B. &uuml;ber Amiga Inc. auslasse und wo man
          Allerweltsthemen finden kann. Aber generell sollte man schon irgenwie in
          der Szene aktiv sein oder sie zumindest l&auml;nger als Zuschauer kennen,
          sonst kann so ein Artikel ins Auge gehen. Englisch muss man auf jedenfall
          k&ouml;nnen!</P>

          <P><B>Ghandy:</B><BR> Trotzdem wollen wir betonen, dass uns jeder Schreiber
          willkommen ist und sich nicht scheuen sollte uns Artikel anzubieten! Wir
          beantworten auch gerne Fragen von NichtSzenern, kein Problem!</P>

          <H3><B><U>&Uuml;ber die "Szene"</U></B></H3>

          <P><FONT color="#006000"><B>Wie hat sich die Amiga "Szene"
          ge&auml;ndert?</B></FONT><BR>
          <B>Zito:</B><BR>              
          Sie ist viel kleiner geworden. Aber auch sehr viel freundlicher.
          Fr&uuml;her waren Newcommer wie vor den Kopf gestossen bei dem ganzen
          elit&auml;ren Gehabe einiger Szener. Heute gilt das Motto "Friendship
          rules!" und nur wenige Idioten halten sich f&uuml;r unersetzbar und total
          Elite. Naja, lustigerweise machen diese am wenigsten f&uuml;r die Szene
          oder sogar gar nichts. (Dar&uuml;ber habe ich mit meinem d&auml;nischen
          Freund Adonis einen Artikel geschrieben, der in Jurassic Pack #10
          erschienen ist. Also rundum eine recht interessante Ausgabe um dieses
          Interview zu erweitern...) :-)</P>

          <P><B>Ghandy:</B><BR>         
          Mach mal hier nicht soviel Eigenwerbung. Aber es stimmt, dass Diskmags
          generell ein guter Einstieg in die Szene sind. Kann ich also wirklich jedem
          Interessierten nur w&auml;rmstens empfehlen!</P>

          <P><FONT color="#006000"><B>Gibt es immer noch das "Elite" denken unter
          "Szene" Members?</B></FONT><BR>
          <B>Zito:</B><BR>              
          Ja, wie erw&auml;hnt gibt es da ein paar, aber die h&auml;ngen
          haupts&auml;chlich im IRC (#amigascne) rum und machen nix, haben also
          keinen wirklichen Grund mehr sich Elite zu nennen. Und die "neue Elite",
          also die, die wirklich was f&uuml;r die Szene tun, die sind eigentlich
          alles recht freundlich und nicht eingebildet.</P>

          <P><B>Ghandy:</B><BR>
          Also, ich sehe von dem fr&uuml;heren Elitedenken nichts mehr, wir sind
          vielmehr heute eine kleine Familie von Leuten, die ein gemeinsames Hobby
          teilen, da bleibt f&uuml;r solche Dinge kein Raum, ist auch besser so!</P>

          <P><FONT color="#006000"><B>F&uuml;r wie "aktiv" haltet Ihr die
          "Szene"?</B></FONT><BR>
          <B>Zito:</B><BR>              
          Also im Vergleich zu fr&uuml;her ist sie nat&uuml;rlich gesunken, die
          Aktivit&auml;t. Aber wie man z.B. an den Releases auf der Mekka, der
          gr&ouml;ssten deutschen Szeneparty, dieses Jahr erkennen kann, ist
          immernoch ordentlich was los. Muss ja auch sein, sonst h&auml;tten wir ja
          nichts weiter wor&uuml;ber wir in JP schreiben k&ouml;nnten.</P>

          <P><B>Ghandy:</B> <BR>
          Die Amiga DemoSzene lebt, nat&uuml;rlich muss man heutzutage in anderen
          Dimensionen denken, es kommt nicht wie fr&uuml;her t&auml;glich etwas Neues
          raus. Trotzdem kann sich die Szene was die Qualit&auml;t und Quantit&auml;t
          ihrer Produktionen angeht, noch heute sehen lassen. </P>

          <P><FONT color="#006000"><B>Lebt die Amiga "Szene" nur noch aus Ihrer
          Vergangenheit oder enstehen neue Gruppen mit Nachwuchs
          K&uuml;nstlern?</B></FONT><BR>
          <B>Zito:</B><BR>              
          Nein, denn dann w&auml;re sie nicht mehr so gut (qualitativ) und so aktiv
          (was man z.B. an den Demoparties wie der MekkaSymposium sehen kann) und
          auch wenn es weniger neue Namen sind die auftauchen, so kann man doch
          behaupten, dass es Nachwuchs gibt und auch weiterhin geben wird. Selbst
          einer veralteten Technologie kann man die Kreativit&auml;t nicht mit
          schnelleren CPUs und 3D-Graphikkarten wegnehmen. Das ist es auch, was die
          C64- und die Atari-Szene am Leben erh&auml;lt, so viele Jahre nachdem man
          sie definitiv f&uuml;r tot erkl&auml;rt hat.</P>

          <P><B>Ghandy:</B><BR>         
          Interessierte sollten mal die Homepage der Mekka unter http://ms.demo.org
          anschauen oder sich eine Auswahl der besten mehr oder weniger aktuellen
          Releases in der "Download Area" von http://diskmag.de ziehen.</P>

          <P><FONT color="#006000"><B>Ist es f&uuml;r nicht "Szener" &uuml;berhaupt
          m&ouml;glich sich in diesem Teil der Amiga Kultur
          zurechtzufinden?</B></FONT><BR>
          <B>Zito:</B><BR>              
          Ich denke schon. Die Szene hat zwar ihre eigene Regeln, aber sie ist kein
          Buch mit 7 Siegeln. Jeder kann ins Aminet gehen und sich die neuesten
          Produktionen ziehen und geniessen oder sich auf unserer eigens daf&uuml;r
          eingerichteten Website www.diskmag.de dar&uuml;ber informieren was gerade
          abgeht. Wenn jemand genaueres wissen will, was gerade passiert oder wie man
          selbst in der Szene aktiv werden kann, dann sollte er eines der aktuellen
          Diskmags (Showtime, D.I.S.C., EuroChart oder Jurassic Pack) lesen.</P>

          <P><B>Ghandy:</B><BR>         
          Wir werden auch eine Schritt-f&uuml;r-Schritt Anleitung f&uuml;r die
          Erstinstallation von WinUae einbauen damit auch ehemalige Amiga Besitzer
          nachvollziehen k&ouml;nnen was so passiert.</P>

          <P><FONT color="#006000"><B>Gelten noch parolen wie "Friendship rules"?
          Sprich h&auml;lt man noch Kontakt per Post (Swappen)
          miteinander?</B></FONT><BR>
          <B>Ghandy:</B><BR>            
          Gerade der freundschaftliche Kontakt untereinander macht die spezielle
          Atmosph&auml;re der Szene aus, bei Problemen kann man sich auf die
          Unterst&uuml;tzung anderer Szener verlassen. Swappen hat nicht mehr die
          Bedeutung wie noch vor 3-4 Jahren, Hauptkommunikationsmedium ist und bleibt
          das Internet -dies ist wegen seiner Geschwindigkeit und dem niedrigen
          Preis.</P>

          <P><B>Zito:</B><BR>
          Aber es gibt noch eine sehr kleine Sub-Szene, die mit Disketten swappt und
          sich ellenlange Briefe schreibt. Aber diese stirbt langsam wirklich aus!
          Einige ehemalige Disk-Swapper wollen aber genau diese Brieffreundschaften
          nicht aufgeben und setzten sie "in aller Freundschaft" &uuml;ber e-Mail
          fort oder swappen mit CDs stattdessen, wie ich.</P>

          <P><FONT color="#006000"><B>Was glaubt Ihr wie wird sich die Amiga "Szene"
          in Zukunft entwickeln?</B></FONT><BR>
          <B>Zito:</B><BR>              
          Also ich denke es wird sich ein fester Kern aktiver und passiver Szener
          bilden, die noch einige Jahre am Ball bleiben werden. Dazu werden sicher
          mehr neue Leute kommen. Unabh&auml;ngig ob der AmigaOne kommt oder nicht
          wird die Classic Amiga Szene weiter bestehen und ich glaube, dass selbst
          wenn jegliche kompatible Hardware einst den Geist aufgegeben haben wird,
          selbst dann wird es zumindest eine passive Szene geben die mindestens
          einmal am Tag einen Amigaemulator auf einem Mac oder PC oder ganz anderen
          System anwirft um sich Demos und Intros anzusehen, denn was die AmigaSzene
          (zusammen mit der C64 Szene) geschaffen hat ist besonders aus
          k&uuml;nstlerischer Sicht einzigartig und wird deshalb nicht in
          Vergessenheit geraten!</P>

          <P><B>Ghandy:</B><BR>
          Die heutige Szene besteht zumeist aus alten Hasen, die sind verr&uuml;ckt
          genug, dieses Spiel noch eine lange Zeit weiter zu spielen. Ich sehe keine
          Gefahr, dass unsere Szene untergehen k&ouml;nnte, noch vor ein bis zwei
          Jahren sah die Situation weitaus kritischer aus als heute.</P>

          <P><FONT color="#006000"><B>Eure letzten Worte an die Leser?</B></FONT><BR>
          <B>Zito:</B><BR>              
          Hmh, bitte mal auf www.jurassicpack.de.vu gehen (wen es interessiert) und
          sich die letzte Ausgabe ziehen. Und wer gerne mitmachen m&ouml;chte (in
          welcher Form auch immer) sollte keine Angst haben mit uns Kontakt
          aufzunehmen! Wer sich noch nicht in der Szene auskennt und mal schnuppern
          m&ouml;chte, der ist herzlich eingeladen von www.diskmag.de seine
          Erkundungen zu starten!</P>

          <P><B>Ghandy:</B><BR>
          So, das war aber jetzt genug Eigenwerbung! Schreibt uns einfach mal unter
          Ghandy@vantage.ch an, wir antworten 100%ig! Herzliche Gr&uuml;sse an alle
          Amigafreaks!!</P>

          <P align="center">-- &copy; Amiga Arena 09/2002 --</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

