<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Andy Kiefl -->

    <TITLE>Internet verlassen</TITLE>
  </HEAD>

  <BODY background="nc_bg2.jpg" text="#000000" link="#0000ff"
  alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD colspan="2" align="center"><FONT color="#000080" size=
        "7"><B>Sie wollen das Internet verlassen?</B></FONT></TD>
      </TR>

      <TR>
        <TD colspan="2">Dann f&uuml;hren Sie nun bitte
        sorgf&auml;ltig folgende Schritte durch !</TD>
      </TR>

      <TR>
        <TD valign="top">1.</TD>

        <TD>Schlie&szlig;en Sie alle offenen Seiten und beenden Sie
        Ihr Internetprogramm !</TD>
      </TR>

      <TR>
        <TD valign="top">2.</TD>

        <TD>Fahren Sie das Betriebssystem ihres Rechners
        ordnungsgem&auml;&szlig; herunter !</TD>
      </TR>

      <TR>
        <TD valign="top">3.</TD>

        <TD>Schalten Sie Ihren Computer, Monitor, Drucker und Ihr
        Modem aus !</TD>
      </TR>

      <TR>
        <TD valign="top">4.</TD>

        <TD>Nehmen sie in mehreren Stufen Kontakt mit ihrer
        Au&szlig;enwelt auf !</TD>
      </TR>

      <TR>
        <TD valign="top">Stufe&nbsp;1</TD>

        <TD>&Ouml;ffnen sie ein Fenster und atmen Sie die frische
        Luft. Achtung, der Kontrast und die Helligkeit lassen sich
        nicht einstellen, auch auf die Lautst&auml;rke k&ouml;nnen
        sie kleinen Einfluss nehmen ! Nehmen Sie alles so wie es
        ist. Die Ger&auml;usche sind keine Simulation, sondern
        alles ist Live !</TD>
      </TR>

      <TR>
        <TD valign="top">Stufe&nbsp;2</TD>

        <TD>Gehen sie einige Schritte durch das Zimmer, was sich
        unter Ihnen bewegt, sind nur Ihre Beine, keine Angst,
        bisher l&auml;uft alles Normal!</TD>
      </TR>

      <TR>
        <TD valign="top">Stufe&nbsp;3</TD>

        <TD>Schauen Sie sich um, ob noch jemand in ihrer N&auml;he
        ist, der sich bewegt. Gehen sie auf Ihn zu und sprechen Sie
        Ihn einfach an, eine Tastatur ist hierf&uuml;r nicht
        erforderlich! Antwortet ihr Gespr&auml;chspartner ? Wenn
        ja, dann sind sie jetzt bitte &auml;u&szlig;erst
        vorsichtig, das ist kein Forum und auch kein Chatroom.
        &Uuml;berlegen Sie vorher genau was Sie sagen.
        Beleidigungen k&ouml;nnen jetzt f&uuml;r Sie zu
        k&ouml;rperlichen Sch&auml;den f&uuml;hren !</TD>
      </TR>

      <TR>
        <TD valign="top">Stufe&nbsp;4</TD>

        <TD>Versuchen Sie Nahrung zu sich zu nehmen, dazu
        &ouml;ffnen sie bitte alle Schrankt&uuml;ren. Sollte in
        einem Schrank ein Licht angehen, dann haben Sie den
        K&uuml;hlschrank gefunden. Schauen Sie hinein, Ist etwas
        Essbares vorhanden? Bevor Sie etwas verzehren, achten Sie
        bitte auf das Verfallsdatum des Produktes.</TD>
      </TR>

      <TR>
        <TD valign="top">Stufe&nbsp;5</TD>

        <TD>Verlassen des Hauses, um den Schrank mit dem Licht zu
        f&uuml;llen! Achtung, wenn Ihnen alles Fremd vor kommt,
        bitten Sie jemanden Sie zum Lebensmittelgesch&auml;ft zu
        begleiten ! Schauen sie sich um, die Autos sind alle echt,
        &uuml;berqueren Sie die Stra&szlig;e erst, wenn diese
        wirklich frei ist. So unwahrscheinlich es klingt, hier und
        jetzt haben Sie nur ein Leben. Ein Neustart des Spieles ist
        nicht m&ouml;glich und Sie werden auch keinen Kr&auml;mer
        finden, der Ihnen Heiltr&auml;nke verkauft!</TD>
      </TR>

      <TR>
        <TD valign="top">Stufe&nbsp;6</TD>

        <TD>Sollten Ihnen auf dem R&uuml;ckweg kleine Kinder
        entgegen laufen und immer wieder Papa, Papa oder Mama, Mama
        rufen, kann es sich nur um Ihre eigenen Kinder handeln.
        Tja, die kleinen Racker haben Sie wirklich nicht mehr so
        gro&szlig; in Erinnerung, aber macht nichts, wenn ihnen
        erstmal die Namen wieder eingefallen sind, dann werden Sie
        sich schnell wieder an sie gew&ouml;hnen</TD>
      </TR>

      <TR>
        <TD valign="top">Stufe&nbsp;7</TD>

        <TD>Wieder zu Hause angekommen, setzen Sie sich mal
        gem&uuml;tlich in einen Sessel, aber nicht unbedingt in den
        Sessel vor Ihrem Computer !!! Klasse, bald haben Sie es
        geschafft. Nun lesen Sie mal einige Seiten in einem Buch.
        B&uuml;cher sind die dicken schweren Dinger, die man
        aufklappen kann, manche haben sogar sch&ouml;ne bunte
        Bilder. Na, merken Sie wie es beim Lesen oben in Ihrer
        Birne arbeitet? Das sind die Gedanken, die Sie sich beim
        Lesen machen. Es n&uuml;tzt allerdings nichts, wenn sie mit
        dem Finger auf die Seite klicken, wenn Sie alles gelesen
        haben, Multimedia war gestern, nun wird von Hand
        umgebl&auml;ttert</TD>
      </TR>

      <TR>
        <TD valign="top">Stufe&nbsp;8</TD>

        <TD>Mehr als zehn Seiten sollten Sie am Anfang nicht lesen!
        Legen Sie das Buch wieder weg, aber nicht zu weit. Nun
        rufen Sie mal nach Ihrem Ehepartner, das ist die Person die
        sich kopfsch&uuml;ttelnd in eine Ecke dr&uuml;ckt.
        Versichern sie Ihr, dass alles Normal ist und Sie sich
        einfach nur &auml;ndern wollen. In den ersten Tagen wird
        das noch niemand glauben, aber halten Sie durch. Verkaufen
        morgen sofort ihr Modem und schaffen Sie sich vielleicht
        ein Aquarium an, es funktioniert so &auml;hnlich wie ein
        Bildschirmschoner aber es ist das erste Anzeichen von
        Besserung</TD>
      </TR>

      <TR>
        <TD colspan="2">Sie haben es geschafft</TD>
      </TR>

      <TR>
        <TD colspan="2">Herzlich Willkommen im realen Leben!</TD>
      </TR>

      <TR>
        <TD colspan="2">Gru&szlig; Andy (Bruder von Josef
        Kiefl)</TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

