<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="author" content="Wolf Zimmer">

    <TITLE>Magische Quadrate</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="black" link="blue" alink="red"
  bgcolor="#FFFFF6">
    <A name="top"></A><BR>

    <TABLE border="0" summary="" cellpadding="8">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="5"><B>Magische Quadrate -<BR>
          Geschichte und mathematische Eigenschaften</B></FONT></P>

          <P>Ein magisches Quadrat ist eine wiederholungsfreie Anordnung positiver
          ganzer Zahlen von 1 bis n&sup2;, bei der jede Reihe, Spalte, sowie die
          beiden Diagonalen diesselbe Summe bilden. Die Zahl n nennt man Ordnung,
          Basis, Modul oder Wurzel des Quadrats.</P>

          <P>Die kleinste M&ouml;glichkeit ist ein Quadrat aus neun K&auml;stchen mit
          den Zahlen Eins bis Neun, die so aufgeteilt sind, dass jede Reihe, Spalte
          und Diagonale die Summe 15 ergibt. Die Chinesen, die es <I>Lo Shu</I>
          nannten, haben zuerst seine faszinierenden Eigenschaften entdeckt. <IMG
          src="st_magisch1.jpg" width="200" height= "200" align="right"> Eine Legende
          berichtet, diese Figur sei den Menschen zum ersten Mal auf dem Panzer einer
          Schildkr&ouml;te begegnet, die viele Jahrhunderte vor unserer Zeitrechnung
          aus dem Flusse Lo gekrochen kam. Historisch ist <I>Lo Shu</I> &nbsp; nicht
          fr&uuml;her als im 4. Jahrhundert v.Chr. entdeckt worden. Die Chinesen
          gaben den mathematischen Eigenschaften des magischen Quadrats eine
          mystische Bedeutung und hielten es f&uuml;r ein Symbol, das die Urelemente
          der Dinge, des Menschen und des Universums vereinte. Gerade Zahlen
          repr&auml;sentieren das weibliche Prinzip Yin, ungerade das m&auml;nnliche
          Yang. In der Mitte der Reihen, Spalten und Diagonalen liegt die F&uuml;nf,
          die die Erde symbolisiert. Um sie herum verteilen sich die vier Urelemente:
          das Metall, dargestellt durch die Vier und Neun, das Feuer,
          repr&auml;sentiert von Zwei und Sieben, das Wasser mit Eins und Sechs sowie
          das Holz mit Drei und Acht. Wie man leicht erkennen kann, sind in jedem
          Element die beiden gegens&auml;tzlichen Prinzipien Yin und Yang
          vertreten.</P>

          <P>Die Renaissance bescherte dem Europa des 15. und 16.Jahrhunderts eine
          kulturelle und k&uuml;nstlerische Erneuerung, die alle Zweige des Wissens
          ber&uuml;hrte. Auch Mathematik und Geometrie erfuhren einen
          gl&uuml;cklichen Aufschwung und wurden zum fruchtbaren Bezugspunkt f&uuml;r
          die bildenden K&uuml;nste und die Architektur. Einer, der die
          vielf&auml;ltigen Tendenzen in seiner Person zur Synthese brachte, war der
          Wissenschaftler, Schriftsteller, Gelehrte, Ingenieur, Mathematiker und
          K&uuml;nstler Leonardo da Vinci (1452-1519). F&uuml;r ihn waren Mathematik
          und Geometrie aufs Innigste verkn&uuml;pft mit den anderen
          k&uuml;nstlerischen und kulturellen &Auml;u&szlig;erungen des Menschen. In
          seiner - leider verlorengegangenen -Abhandlung &uuml;ber die Malerei <I>De
          pictura</I> mahnt er den Leser schon in der Einleitung: "Mich lese niemand,
          der kein Mathematiker ist." Lange vor Leonardo hatte schon der antike
          Philosoph Platon (428-348 v.Chr.) diesen Zusammenhang erkannt und eine
          entsprechende Warnung sogar &uuml;ber dem Eingang seine Philosophenschule
          anbringen lassen: "Niemand soll eintreten, der die Geometrie nicht
          beherrscht!"</P>

          <P><IMG src="st_magisch3.jpg" width="174" height="199" align="left"> Die
          enge Verbindung von Mathematik, Geometrie und Kunst pr&auml;gt auch das
          Werk des aus N&uuml;rnberg stammenden Malers Albrecht D&uuml;rer, eines
          Zeitgenossen von Leonardo. In seinem ber&uuml;hmten Kupferstich
          <I>Melancholie</I>&nbsp; hat er an markanter Stelle ein magisches Quadrat
          verewigt, das &uuml;brigens viele f&uuml;r das erste Beispiel eines solchen
          Quadrats im Abendland halten. Es ist so konstruiert, dass jede Reihe,
          Spalte oder Diagonale die Summe 34 ergibt. <IMG src="st_magisch2.jpg"
          width="100" height="100" align= "right"> Selbst die vier K&auml;stchen in
          der Mitte summieren sich zu 34 und die vier &auml;u&szlig;eren ebenfalls.
          Dar&uuml;ber hinaus enthalten die beiden mittleren K&auml;stchen der
          untersten Reihe die Jahreszahl der mutma&szlig;lichen Enstehung des Werkes:
          <B>1514!</B> Neben der engen Beziehung zwischen Mathematik und bildender
          Kunst hatte D&uuml;rer vielleicht noch ein anderes Motiv, dieses Quadrat in
          eine Darstellung mit dem Thema "Melancholie" einzuf&uuml;gen. Den magischen
          Quadraten vierter Ordnung wurde damals eine besondere therapeutische
          Wirkung zugeschrieben, und Astrologen hielten sie f&uuml;r ein
          n&uuml;tzliches Amulett gegen die Melancholie.</P>

          <P>Wenn man bei einem Quadrat dritter Ordnung Rotation und Spiegelung
          ausschlie&szlig;t, gibt es nur eine einzige L&ouml;sung. Bei Quadraten
          h&ouml;herer Ordnung w&auml;chst auch die Zahl m&ouml;glicher Anordnungen.
          Unter Ausschluss von Rotation und Spiegelung lassen sich die 16 Zahlen
          eines Quadrats vierter Ordnung bereits auf stattliche 880 Weisen anordnen,
          wie als erster der Mathematiker Bernard Fr&eacute;nicle de Bessy im Jahre
          1693 entdeckte.</P>

          <P>Es konnte bisher noch nicht gekl&auml;rt werden, nach welchen
          mathematischen Gesetzen sich die Zahlen der magischen Quadrate verteilen.
          Die L&ouml;sungen entstanden immer durch Versuch und Irrtum. Wie viele
          magische Quadrate f&uuml;nfter Ordnung gibt es? Lange Zeit sch&auml;tzte
          man die Zahl auf 13.000.000, doch erst 1973 konnte der Amerikaner Richard
          Schroeppel (ein Programmierer) mit dem exakten Ergebnis aufwarten. Ohne
          Rotation und Spiegelung gibt es f&uuml;r das Quadrat f&uuml;nfter Ordnung
          genau 275.305.224 L&ouml;sungen.</P>

          <P>Im Mittelalter gaben die Mohammedaner magischen Quadraten der
          f&uuml;nften Ordnung mit der Zahl 1 im Zentrum eine besondere mystische
          Bedeutung. Denn die Zahl 1 repr&auml;sentierte Allah, das einzigartige und
          h&ouml;chste Wesen. Das Problem des Begriffs und der Darstellung Gottes
          erscheint in allen Religionen und Theologien. Die Zahl 1 scheint die
          Einheit des Seins symbolisch am reinsten auszudr&uuml;cken. Um die
          Unaussprechlichkeit des h&ouml;chsten Wesens anzudeuten, zog man es darum
          oft vor, das f&uuml;r die 1 bestimmte Zentralfeld des magischen Quadrats
          leer zu lassen.</P>

          <P align="right"><A href="Mitglieder/zimmer.html"><B>[Wolf Zimmer]</B></A></P>
          <HR color="#FF00FF" size="3">
          <B>Gehe&nbsp;<A href="#top">zum Anfang</A>.<BR>
          <A href="javascript:history.back()"><FONT size="+1"><B>zur&uuml;ck</B></FONT></A></B>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

