<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Zwei Juister</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>Zwei Juister kommen in den
          Himmel</B></FONT></H1>

          <P>Beim heiligen Petrus sind die Leute von Norderney wohl gut
          angeschrieben, weil sie den Fischfang, St. Peters Beruf, so rechtschaffen
          und ehrlich aus&uuml;ben. Auch die Borkumer haben im Himmel ihre
          F&uuml;rsprecher und Freunde, denn sie sind flei&szlig;ige Landbauern. Die
          Juister dagegen stehen im Himmel und auf Erden in b&ouml;sem Ruf; sie
          betrieben den Strandraub gar zu schlimm und konnten darum nicht in den
          Himmel kommen.</P>

          <P>An einem schw&uuml;len Sommertag war Petrus an der Himmelst&uuml;r
          eingenickt. Da schlichen sich zwei Juister an ihm vorbei und dr&uuml;ckten
          sich still in eine Himmelsecke. Aber St. Paulus erkannte sie gleich und
          z&uuml;rnte dem heiligen Petrus, weil er die frechen Strandr&auml;uber
          eingelassen habe. Petrus &ouml;ffnete die Himmelst&uuml;r und wartete, ob
          die beiden nicht freiwillig wieder abziehen w&uuml;rden, denn hinausjagen
          darf der Himmelspf&ouml;rtner niemand, der einmal im himmlischen Paradies
          ist.</P>

          <P>Die Juister aber blieben, und Petrus war sehr bedr&uuml;ckt, weil er so
          nachl&auml;ssig aufgemerkt hatte. Schlie&szlig;lich fiel Petrus eine List
          ein. Als die beiden Juister Strandr&auml;uber einmal in seine N&auml;he
          kamen, lugte er durch ein Himmelsfenster und tat, als ob er drau&szlig;en
          etwas Besonderes s&auml;he. Dann rief er pl&ouml;tzlich mit lauter Stimme:
          "Schipp an Strand! Schipp an Strand!"</P>

          <P>"Wo is dat Schipp?" fragten die beiden Juister hocherfreut.
          Spornstreichs rannten sie zur Himmelst&uuml;r hinaus, und Petrus
          schlo&szlig; vergn&uuml;gt das Tor hinter ihnen ab. Die Juister aber
          konnten nicht mehr damit rechnen, nochmals durch eine Unachtsamkeit St.
          Petris in den Himmel zu kommen.</P>

          <P>Aus dem Projekt Gutenberg<BR>
          Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

