<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Spiele</TITLE>
    <META name="author" content="Gerd Schoettler">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
  </HEAD>

  <BODY background="bg2.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" cellpadding="10" summary="">
      <TR>
        <TD>
          <H2 align="center"><FONT color="green">Spiele</FONT></H2>

          <P title="" align="JUSTIFY">Hallo Leute!</P>

          <P>Heute m&ouml;chte ich mal &uuml;ber meine Erfahrungen mit dem Amiga 500
          berichten. Seit einem halben Jahr arbeite ich nun schon erfolgreich mit
          diesem Computer und es macht mir zunehmend Spa&szlig;. Nat&uuml;rlich
          spiele ich auch mit dem Amiga und mein absolutes Lieblingsspiel hei&szlig;t
          Shanghai. Mit diesem Spiel kann ich jederzeit eine Runde spielen ohne
          Zeitdruck. Da es keine verschiedenen Schwierigkeitsgrade gibt, entsteht
          wenig Stress beim Spielen. Mir tut das jedesmal gut und manchmal passiert
          es, dass ich die Zeit total vergesse und erst nach einer oder gar zwei
          Stunden wieder aufh&ouml;re. Ich habe auch schon mit einem Partner
          zusammengespielt.</P>

          <P>Ein weiteres Spiel,welches mir viel Freude bereitet, ist das Tangram.
          Hier m&uuml;ssen geometrische Figuren in ein vorgegebenes Symbol so
          eingebaut werden, dass das Symbol vollst&auml;ndig ausgef&uuml;llt ist. Das
          kann schon mal recht kniffelig werden, zumal hier die Symbole auf jedem
          Level immer schwieriger werden. Dazu l&auml;uft eine Uhr, sodass man nur
          einen begrenzten Zeitraum zum Probieren hat. In der Regel spiele ich etwa
          20 Level durch, um dann Pause zu machen. Bisher gibt es nur wenige Symbole,
          die ich beim ersten Anlauf nicht schaffe. Bei einigen aber bin ich mir
          nicht sicher, ob ich sie jemals bew&auml;ltigen werde. Ich werde also
          einfach weitermachen, vielleicht wird mir das Spiel ja eines Tages
          langweilig.</P>

          <P>Da ich hier in Menorca einen hilfreichen Freund zur Seite habe, den Ihr
          ja alles kennt, verf&uuml;ge ich nun &uuml;ber eine Speichererweiterung auf
          1 MB. Wir haben das Ding &uuml;ber Internet ersteigert. Es war noch
          originalverpackt und jetzt kann ich auch Spiele spielen, die ich vorher gar
          nicht &ouml;ffnen konnte. So kam ich also auf die Lemmings. Wahrscheinlich
          werden jetzt viele von Euch sagen, das sei ja ein alter Schuh und das ist
          wohl auch richtig, aber mir machen diese k&ouml;stlich doofen Kerle
          ungeheuren Spa&szlig;. Allein das Zuschauen erheitert schon. Nun habe ich
          mit Hilfe der Beschreibung die ersten 10 Level spielend geschafft, aber
          dann wurde es spannend. Nachts habe ich mich am 11. Level versucht ohne
          jeden Erfolg und dann folgte eine schreckliche Nacht. Da hatten es doch
          tats&auml;chlich diesen doofen Kerle geschafft, mich als Verlierer stehen
          zu lassen. Das war wirklich nervig. Ich habe mich dann mit Rainer
          besprochen und er hat mir ein paar grundlegende Regeln mit auf den Weg
          gegeben. Jetzt gelang es mir im ersten Anlauf vom ersten bis zum 20. Level
          zu marschieren und ich warte schon darauf, die n&auml;chsten Arbenteuer zu
          bestehen. Manchmal w&uuml;nscht man sich bei diesem Spiel vier Augen und
          vier H&auml;nde zu haben, weil man ja h&auml;ufig an verschiedenen Ecken
          zugleich agieren muss, sonst fallen einem wom&ouml;glich diese
          tolpatschigen Kerle ins Wasser oder gar ins Feuer und das w&auml;re doch
          wirklich schade. Ich bin also ganz sicher, dass ich noch sehr viel Freude
          und auch viel Spannung mit den liebenswerten Lemmings haben werde. Das wird
          mich sicher noch eine ganze Zeit besch&auml;ftigen.</P>

          <P>Das wars f&uuml;r heute liebe Gr&uuml;&szlig;e Gerd.</P>
        </TD>
      </TR>
    </TABLE>
    <BR>

    <TABLE border="5" cellspacing="1" cellpadding="5" align=
    "CENTER" summary="">
      <TR>
        <TD>Gerd Sch&ouml;ttler</TD>

        <TD>E-Mail: <A href=
        "mailto:goischoetttler@terra.es">goischoettler@terra.es</A></TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

