<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Der Schatzh&uuml;ter</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>

          <H1 align="center"><FONT color="#ffff00"><B>Der Teufel als Schatzh&uuml;ter
          bei Bremen</B></FONT></H1>

          <P>Im Niedervierlande bei Bremen wohnte einstmals ein Bauer, der sehr reich
          war. Der &Uuml;berfluss aber machte ihm gro&szlig;e Sorgen, denn ringsum
          loderte die Fackel des Krieges, und jeden Tag konnten r&auml;uberische
          Horden auch auf seinem Hof eindringen. Da dachte er ernstlich daran, wie er
          sein Geld und Gut vor den R&auml;ubern in Sicherheit bringen k&ouml;nne,
          und beschloss, seine Sch&auml;tze in die Erde zu vergraben.</P>

          <P>Auf dem Hofe diente ein junger Knecht, den der Bauer aus Mitleid
          aufgenommen hatte, da er arm und elternlos war. Als nun der Bauer an einem
          Sonntag das ganze Gesinde in die Kirche geschickt hatte, um unbeobachtet
          seine Absicht ausf&uuml;hren zu k&ouml;nnen, versteckte sich der Knecht in
          der Scheune, weil er sich sch&auml;mte, in seinen abgetragenen Kleidern den
          Gottesdienst zu besuchen. Aber gerade die Scheune hatte der Bauer zum
          Versteck seiner Habe ausersehen, und so konnte der Knecht, der im Heu
          verborgen lag, genau beobachten, wie sein Herr zuerst ein gro&szlig;es Loch
          grub, bis es mannstief war, wie er dann in einen weiten kupfernen Kessel
          Gold, Silber, M&uuml;nzen und Gef&auml;&szlig;e in gewaltigen Mengen
          hinabsenkte, die Grube wieder zuschaufelte und schlie&szlig;lich den Boden
          einebnete. Er h&ouml;rte auch, wie sein Herr den Teufel zum H&uuml;ter des
          Ortes bestellte und beschw&ouml;rend ausrief, niemand d&uuml;rfe im Verlauf
          von sieben Jahren den Schatz heben, und wer dann komme, ihn zu holen, solle
          kein anderer sein als seiner Tochter Br&auml;utigam; der d&uuml;rfe aber
          nicht mit Spaten oder Schaufel graben, sondern m&uuml;sse den Kessel mit
          einem silbernen Fuhrwerk, vor welches das lebendige, befl&uuml;gelte Feuer
          gespannt sei, zutage f&ouml;rdern. Jedem Unbefugten, der sich an den Schatz
          wage, m&ouml;ge der Teufel den Hals brechen.</P>

          <P>Als der Bauer seinen Spruch getan hatte, schwirrte eine gro&szlig;e
          Fledermaus durch die Scheune, umkreiste dreimal in schnellem Flug den Mann
          und den Schatz und verschwand wieder. Der Bauer nickte befriedigt und ging
          seiner Wege.</P>

          <P>Der Bursche konnte dieses Erlebnis nicht vergessen; wo er ging und
          stand, lag ihm der Schatz im Sinn, und der Gedanke, wie er seiner habhaft
          werden k&ouml;nnte, lie&szlig; ihn nimmer los. Schlie&szlig;lich nahm er
          seinen Abschied von dem Bauern, ging zur See und wurde ein schmucker,
          t&uuml;chtiger Matrose. Doch als die sieben Jahre um waren, hielt es ihn
          nicht l&auml;nger auf dem Schiffe; er machte sich auf und wanderte seinem
          Heimatort zu. Dort kannte ihn l&auml;ngst niemand mehr, aber er erfuhr bald
          im Wirtshaus, da&szlig; sein fr&uuml;herer Herr vor kurzer Zeit gestorben
          sei; nun lebe die Familie in gro&szlig;er Not, denn mit dem Reichtum des
          Alten scheine es nicht weit her gewesen zu sein; in seinem Nachlass habe
          sich weder Gold noch Silber gefunden.</P>

          <P>Der Bursche sprach bald auf dem Hofe vor, fand alles, wie man es ihm
          geschildert hatte, und wurde, da die verwaiste Tochter sich seiner noch
          gern erinnerte, dort ein h&auml;ufiger Gast. Schlie&szlig;lich fand er den
          Mut, um das h&uuml;bsche M&auml;dchen zu freien. Dieses wies ihn nicht ab.
          Nun h&auml;tte der junge Mann mit seinem zur See erworbenen Gut in aller
          Ruhe seinen Haushalt als ein verm&ouml;gender Mann beginnen k&ouml;nnen.
          Doch der Schatz lag ihm im Sinne, und er sann unabl&auml;ssig dar&uuml;ber
          nach, wie er ihn heben k&ouml;nne.</P>

          <P>Da tr&auml;umte er einmal, die Scheune stehe in Flammen, aber als er
          genauer hinsah, war es ein gro&szlig;er Hahn, der auf dem Strohdach stand
          und mit den Fl&uuml;geln schlug. Im n&auml;chsten Augenblick schwang dieser
          sich von seinem hohen Standort herab, setzte sich auf eine umgest&uuml;rzte
          Pflugschar, pickte mit dem Schnabel und scharrte mit den F&uuml;&szlig;en
          daran, kurz, benahm sich ganz so, als wolle er den Pflug in die H&ouml;he
          richten und mit sich f&uuml;hren.</P>

          <P>Lange Zeit verstand der Mann diesen Traum nicht, doch pl&ouml;tzlich kam
          ihm ein guter Gedanke. Er fuhr sogleich zu einem Goldschmied in die Stadt
          und bestellte einen silbernen Pflug, den er sofort mit blanken Talern
          bezahlte. Nach acht Tagen schon konnte er ihn holen, und nun ging er
          sogleich ans Werk. In der n&auml;chsten Nacht, sobald die Glocke zw&ouml;lf
          schlug, machte er sich auf, unter dem rechten Arm den Silberpflug, unter
          dem linken einen pr&auml;chtigen roten Hahn. Vor der Scheune spannte er den
          Hahn vor den silbernen Pflug, &ouml;ffnete das Tor und fuhr nach der
          Stelle, wo der Schatz verborgen lag. Obgleich kein Mondschein in die
          Scheune fiel, war es doch fast taghell darin, denn der Pflug leuchtete und
          der Hahn gl&auml;nzte wie helloderndes Feuer.</P>

          <P>Schweigend begann der Mann im Kreise zu ackern und die Erdschollen zur
          Seite zu pfl&uuml;gen. Obwohl ein Gebrause und ein schreckliches
          Stimmengewirr anhob, verrichtete er in tiefster Ruhe seine Arbeit, bis er
          an den Deckel des Kessels stie&szlig; und den Schatz in all seiner
          Herrlichkeit gehoben hatte. Dann packte er alles in K&ouml;rbe und eilte
          damit in den Hof, um es zu bergen. Nun machten die Leute freilich
          gro&szlig;e Augen und freuten sich des wiedergewonnenen Gutes, und im
          Herbst gab es eine lustige Hochzeit.</P>

          <P>Der Silberpflug blieb lange Zeit ein Wahrzeichen der Familie, bis er im
          Schwedenkrieg verlorenging.</P>

          <P>Aus dem Projekt Gutenberg<BR>
          Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

