<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Versteigerungen</TITLE>
    <META name="author" content="Gerd Schoettler">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
  </HEAD>

  <BODY background="bg2.jpg" text="#000000" link="#0000ff" vlink=
  "#ff0000" alink="#ff9900">
    <TABLE width="100%" cellpadding="10" summary="">
      <TR>
        <TD>
          <H2 align="center"><FONT color="green">Versteigerungen</FONT></H2>

          <P title="" align="JUSTIFY">Hallo Leute!</P>

          <P>Ich war im Sommer in Deutschlamd und da ich ja nun Computerbesitzer bin,
          bekommt man auch entsprechende Kontakte. So erfuhr ich von einer sehr
          unsch&ouml;nen Geschichte, die ich Euch kurz berichten m&ouml;chte. Ich
          habe inzwischen eine Speichererweiterung und eine Festplatte im Internet
          ersteigert. Auf die Festplatte warte ich noch. Auch meinen Amiga 500 habe
          ich auf diesem Weg bekommen. Bisher ist auch alles gutgegangen, aber da war
          ein Mensch, der eine Digitalcamera ersteigerte. Das stolze Ding sollte DM
          4.000,- kosten. Auf seine Nachfrage, ob die Camera auch per Nachnahme
          versandt werden k&ouml;nnte, bekam er eine ablehnende Antwort. Also
          &uuml;berwies er das Geld. Dann wurde es ganz still.</P>

          <P>Nach Wochen das Wartens meldete er sich pers&ouml;nlich bei dem
          Anbieter, der jedoch vorgab nichts von einer Versteigerung zu wissen.
          Schlie&szlig;lich erkl&auml;rte er, er habe aber seine Bankcard verloren
          und vielleicht arbeite ja jemand damit. So ging man zur Bank und erfuhr
          dort, dass jemand st&auml;ndig gr&ouml;&szlig;ere Betr&auml;ge &uuml;ber
          das Konto erhielt und diese sofort abbuchte. Ob nun Anzeige erstattet
          wurde, wei&szlig; ich nicht, aber eines ist wohl klar: Der Angesprochene
          muss wohl mit dem Betr&uuml;ger zusammengearbeitet haben, denn jeder
          normale Mensch l&auml;&szlig;t sein Konto sperren, wenn er seine Bankcard
          verliert. Es scheint mir also angeraten, zumindest bei gr&ouml;&szlig;eren
          Betr&auml;gen gewisse Vorsichtsma&szlig;nahmen zu ergreifen. Man kann sich
          damit unn&ouml;tigen &Auml;rger ersparen.</P>

          <P>Ich hoffe auch weiterhin alles N&ouml;tige &uuml;ber diese
          Versteigerungen erhalten zu k&ouml;nnen und vertraue darauf, dass ich die
          ersteigerten Waren auch wirklich erhalte.</P>

          <P>Gr&uuml;&szlig;e Gerd.</P>
        </TD>
      </TR>
    </TABLE>
    <BR>

    <TABLE border="5" cellspacing="1" cellpadding="5" align="CENTER" summary="">
      <TR>
        <TD>Gerd Sch&ouml;ttler</TD>

        <TD>E-Mail: <A href=
        "mailto:goischoetttler@terra.es">goischoettler@terra.es</A></TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

