<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Der Schwarzseher Teil 2</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>Die Witzseite
          in unserer NoCover....</B></FONT></H1>

          <P><FONT color=
          "#ffff00"><B>Alkoholproblem?</B></FONT></P>

          <P>Eine junge Dame betritt das Restaurant - alle
          Pl&auml;tze sind besetzt.</P>

          <P>Lediglich an einem gro&szlig;en runden Tisch sitzt
          ganz alleine ein junger Herr.</P>

          <P>Sie geht zu ihm hin und fragt:<BR>
          "Gestatten Sie, dass ich mich zu Ihnen an diesen Tisch
          setze?"</P>

          <P>Er:<BR>
          "Liebend gerne, gn&auml;dige Frau; ich m&ouml;chte Sie
          jedoch darauf hinweisen, dass ich, wenn ich Alkohol
          getrunken habe, sehr schnell ausfallend und ordin&auml;r
          werden kann."</P>

          <P>Sie (setzt sich):<BR>
          "Ja um Himmels Willen; wieviel haben Sie denn heute schon
          getrunken?"</P>

          <P>Er:<BR>
          "Ein kleines Bier - du geile Sau..."</P>
          <HR>

          <P><FONT color="#ffff00"><B>Wer ist eigentlich
          Pawlow?</B></FONT></P>

          <P>Russland vor Perestroika. Drei russische
          Strafgefangene in Handschellen sitzen im Zug, der sie in
          die Verbannung nach Sibirien bringt.</P>

          <P>Fragt einer sein Gegen&uuml;ber:<BR>
           "Was hast du bekommen, Br&uuml;derchen, was hast du gemacht?"<BR>
           "Zehn Jahre", sagt der, "ich war f&uuml;r Pawlow."<BR>
           "Und du?", fragt der Erste seinen Nachbarn.<BR>
           "Zehn Jahre", antwortet der, "ich war gegen Pawlow. Aber
          du ... was ist mit dir?"<BR>
           "Auch ich hab zehn Jahre bekommen", sagt der Erste, "ich
          bin Pawlow."</P>
          <HR>

          <P><FONT color="#ffff00"><B>Aufsteigende
          Hitze</B></FONT></P>

          <P>Zwei Kamelreiter reiten durch die W&uuml;ste. Es sind
          50 Grad Celsius, die Sonne brennt.</P>

          <P>Die zwei sind schon total am Ende, k&ouml;nnen sich
          kaum noch auf den Beinen halten. Auf einmal kommt ein
          Fahrradfahrer mit einem irren Tempo vorbeigefahren.</P>

          <P>Die zwei Kamelreiter rufen ihm hinterher:<BR>
           "Warum f&auml;hrst Du denn mit dieser irren
          Geschwindigkeit durch die W&uuml;ste, bei dieser
          Hitze?"</P>

          <P>Darauhin antwortet der Radfahrer:<BR>
           "Durch den Fahrtwind verdunstet mein Schwei&szlig; und
          der k&uuml;hlt und erfrischt mich angenehm."</P>

          <P>Nat&uuml;rlich denken sich die beiden Kamelreiter,
          dass sie das auch machen m&uuml;ssen und geben den
          Kamelen die Sporen. Sie rasen mit wahnsinniger
          Geschwindigkeit durch die W&uuml;ste. Nach einer halben
          Stunde fallen die Kamele um - tot.</P>

          <P>Da geht der eine Kamelreiter um die Tiere und sagt zu
          seinem Kumpel:<BR>
           "Klare Sache - erfroren!"</P>
          <HR>

          <P><FONT color="#ffff00"><B>Juweliersbesuch</B></FONT></P>

          <P>Eine junge Dame l&auml;sst sich im Juwelierladen
          mehrere wertvolle Schmuckst&uuml;cke zeigen, w&auml;hrend
          ihr Begleiter aufgeregt in seiner Tasche w&uuml;hlt.</P>

          <P>Schlie&szlig;lich meint die Frau:<BR>
           "Wir kommen ein anderes Mal wieder. Mein Mann kann
          seinen Revolver nicht finden..." </P>
           
          <HR>

          <P><FONT color="#ffff00"><B>Volksnah</B></FONT></P>

          <P>Jaque Chirac, Helmut Kohl und Bill Clinton sind zu
          einer Quizshow eingeladen.</P>

          <P>Sie bekommen jeder zun&auml;chst eine Frage um Ihre
          N&auml;he zum Volk unter Beweis zu stellen.</P>

          <P>Die erste geht an Chirac:<BR>
           "Wohin greifen die Frauen den M&auml;nnern am
          liebsten?"</P>

          <P>Sofort die Antwort:<BR>
          "Ins Portemonaie!"</P>

          <P>"Richtig!"</P>

          <P>Die zweite geht an Kohl:<BR>
          "Wo haben die Frauen krause Haare?"</P>

          <P>Auch sofort:<BR>
          "In Afrika."</P>

          <P>"Richtig!"</P>

          <P>Der Quizmaster will gerade Clinton die 3. Frage
          stellen, als dieser sich kopfsch&uuml;ttelnd
          abwendet.</P>

          <P>"Aber Mr. President, bitte warten Sie doch!"</P>

          <P>"Lieber nicht - ich h&auml;tte auch schon die beiden
          ersten Fragen falsch beantwortet!"</P>
          <HR>

          <P><FONT color="#ffff00"><B>Probenarbeit</B></FONT></P>

          <P>Ein alter Mann geht zum Arzt wegen Schmerzen beim
          Wasserlassen.</P>

          <P>Seine Frau begleitet ihn, da der arme alte Kerl nicht
          mehr so gut h&ouml;rt.</P>

          <P>Nach der Untersuchung sagt der Arzt zum alten
          Mann:<BR>
           "Gut, ich m&ouml;chte, dass Sie, bevor Sie gehen, Proben
          von Urin, Samen, Stuhl zur Analyse hierlassen."</P>

          <P>Der Alte hat den Arzt nicht richtig verstehen
          k&ouml;nnen und fragt seine Frau:<BR>
          "Was hat der Arzt gesagt?"</P>

          <P>Die Frau antwortet:<BR>
          "Er m&ouml;chte, dass Du Deine Unterhose hierl&auml;sst,
          Schatz..."</P>
          <HR>

          <P><FONT color="#ffff00"><B>Mundraub</B></FONT></P>

          <P>Ein Deutscher, ein Franzose und ein Italiener sitzen
          in einer Kneipe.</P>

          <P>Alle drei haben sich ein Bier bestellt.</P>

          <P>Der Kellner bringt das Bier und stellt es den
          M&auml;nnern auf den Tisch. In allen drei Bieren schwimmt
          eine Fliege.</P>

          <P>Der Franzose erkennt es sofort, geht mit dem Finger in
          das Glas, fischt die Fliege raus und schnippt die sie
          hinter sich auf den Boden.</P>

          <P>Der Italiener erkennt es auch, geht mit dem Finger
          ebenfalls in das Glas, fischt die Fliege heraus und
          schnippt sie elegant &uuml;ber die Schulter.</P>

          <P>Der Deutsche geht mit dem Finger in das Glas, fischt
          die Fliege heraus, setzt sie aber am Glasrand ab und
          br&uuml;llt die Fliege an:<BR>
           "Los! Spuck aus - aber alles, klar?"</P>
          <HR>

          <P><FONT color="#ffff00"><B>Die Besten</B></FONT></P>

          <P>Drei Astronauten, ein Russe, ein Amerikaner und ein
          Deutscher streiten, welches die gr&ouml;&szlig;te
          Weltraumnation sei.</P>

          <P>Der Russe:<BR>
           "Wir sind die Besten! Wir waren die Ersten im Weltall
          &uuml;berhaupt!"</P>

          <P>Der Amerikaner:<BR>
           "Nein! Wir sind die Besten. Wir waren die Ersten, die
          Menschen zum Mond brachten!"</P>

          <P>Der Deutsche:<BR>
           "Nein, meine Herren! Wir sind die Besten. Wir werden die
          Ersten sein, die zur Sonne fliegen!"</P>

          <P>Die Anderen:<BR>
           "Aber ... Aber.... das geht nicht! Die Sonne ist zu
          hei&szlig;!"</P>

          <P>Der Deutsche:<BR>
           "Das haben wir ber&uuml;cksichtigt. Wir werden nachts
          fliegen..."</P>
          <HR>

          <P><FONT color="#ffff00"><B>Die
          Bibelverk&auml;ufer</B></FONT></P>

          <P>Zwei Stotterer bewerben sich bei einer Vertreterfirma,
          die die Bibel direkt an der Haust&uuml;re verkauft.</P>

          <P>Sie bekommen den Job sofort, wer sonst soll sowas auch
          schon machen?</P>

          <P>Der Chef gibt jedem 100 Bibeln mit und sagt:<BR>
          "Die m&uuml;ssen innerhalb von zwei Wochen verkauft sein,
          strengt Euch an!"</P>

          <P>Die Beiden ziehen los und treffen sich zwei Wochen
          sp&auml;ter in der Firma wieder.</P>

          <P>Der Eine hat alle seine Bibeln verkauft, der andere
          nicht eine einzige.</P>

          <P>Da fragt der ohne verkaufte Bibel den Anderen
          stotternd:<BR>
          "Ssss sag mir mal, w... w... wie Du die alle ver.. ver...
          verkauft hast?"</P>

          <P>Da sagt der Andere, ebenfalls stotternd:<BR>
           "I... I...Ich hhh...habe bei den Leu...Leu...Leuten
          geklingelt und sie ge...ge...gefragt, ob sie die B...,
          die B...., die Bibel kaufen wollen, oder ob ich&acute;s
          ih...ih....ihnen vorlesen soll..."</P>
          <HR>

          <P><FONT color="#ffff00"><B>Schotten und
          Reisen</B></FONT></P>

          <P>Im Schnellzug von Glasgow nach Edinburgh ertappt der
          Schaffner einen Schotten ohne Fahrkarte.</P>

          <P>Nach einem erregtem Wortwechsel wirft der Beamte den
          Koffer des Reisenden aus dem Fenster.</P>

          <P>Der Schotte ist au&szlig;er sich:</P>

          <P>"Reicht es Ihnen nicht, aus mir einen armen Mann zu
          machen?<BR>
           Jetzt haben Sie auch noch meinen Sohn umgebracht..."
          </P>
           
          <HR>

          <P><FONT color="#ffff00"><B>Golfer</B></FONT></P>

          <P>Ein Pfarrer, ein Facharzt und ein Diplom-Ingenieur
          spielen zusammen Golf.</P>

          <P>Sie regen sich &uuml;ber eine Gruppe auf, die ein Loch
          vor Ihnen spielt und einfach nicht vorw&auml;rts kommt.
          Diese schlagen die B&auml;lle kreuz und quer durch die
          Gegend und verschandeln den Rasen.</P>

          <P>Langsam werden die drei Freunde immer zorniger, die
          Fl&uuml;che werden immer lauter; selbst dem Pfaffen
          entweichen dabei einige unz&uuml;gliche Bemerkungen.</P>

          <P>Zuf&auml;llig kommt der G&auml;rtner des Golfplatzes
          vorbei; der wird gleich um Rat gefragt.</P>

          <P>"Nun", sagt dieser, "das ist eine sehr, sehr traurige
          Angelegenheit. Das da vorne sind drei
          Feuerwehrm&auml;nner. Als unser Clubhaus brannte, haben
          diese drei verhindert, dass es v&ouml;llig niederbrannte.
          Leider verloren sie bei diesem Einsatz Ihr Augenlicht.
          Zum Dank d&uuml;rfen sie jetzt hier jederzeit frei
          spielen."</P>

          <P>Die drei verstummten angesichts dieser
          Trag&ouml;die.</P>

          <P>"Ich werde sie in meine Gebete einschlie&szlig;en",
          murmelte der Pfaffe.</P>

          <P>"Ich werde sofort einen Studienfreund aufsuchen, der
          ist Augenarzt, vielleicht kann der helfen" pflichtete der
          Facharzt bei.</P>

          <P>Der Dipl.Ing. &uuml;berlegte kurz und fragte:<BR>
          "K&ouml;nnten die nicht nachts spielen?"</P>
          <HR>

          <P><FONT color="#ffff00"><B>Gnadenschuss</B></FONT></P>

          <P>Gerichtsverhandlung nach einem Autounfall.</P>

          <P>Der Anwalt des schuldigen Fahrers fragt den
          Kl&auml;ger:<BR>
           "Ist es richtig, dass Sie nach dem Unfall meinem
          Mandanten gesagt haben, sie seien nicht verletzt?"</P>

          <P>"Nat&uuml;rlich habe ich das gesagt, aber dazu
          m&uuml;ssen Sie wissen, wie sich die Sache abgespielt
          hat:</P>

          <P>Also, ich fahre mit meinem Gaul ruhig die Stra&szlig;e
          entlang. Da kommt das Auto angerast und wirft uns in den
          Graben. Das war vielleicht ein Durcheinander, das
          k&ouml;nnen sie sich nicht vorstellen. Ich lag auf dem
          R&uuml;cken, die Beine in die Luft - und mein braves
          altes Pferd auch.</P>

          <P>Da steigt der Fahrer aus, kommt auf uns zu und sieht,
          dass mein Pferd sich ein Bein gebrochen hat. Darauf zieht
          er wortlos eine Pistole und erschie&szlig;t es.</P>

          <P>Danach sieht er mich an und fragt: 'Sind sie auch
          verletzt?' - Nun frage ich Sie, Herr Rechtsanwalt, was
          h&auml;tten sie geantwortet?"</P>
          <HR>

          <P><FONT color="#ffff00"><B>Microsofties</B></FONT></P>

          <P>Ein Helikopter-Pilot hat &uuml;ber Seattle durch
          schlechtes Wetter und den Ausfall seiner
          Navigationsger&auml;te die Orientierung verloren.</P>

          <P>Er fliegt zu einem Hochhaus und zeigt ein Schild mit
          der Aufschrift:<BR>
          'WO BIN ICH?'</P>

          <P>Kurz danach wird im Hochhaus ein gro&szlig;es Schild
          gezeigt:<BR>
          'IN EINEM HELIKOPTER.'</P>

          <P>Ein Blick auf die Karte, der Pilot grinst, winkt und
          fliegt auf direktem Weg zum Flugplatz.</P>

          <P>Nach der Landung fragt der Copilot, wie er aus dieser
          Information seine Position erarbeitet habe.</P>

          <P>Antwort:<BR>
           "Ich wusste, das kann nur das Microsoft-Haus sein. Die
          Art der Antwort war wie bei der MS-Hilfe:<BR>
           Technisch korrekt, aber v&ouml;llig unbrauchbar..."</P>
          <HR>

          <P><FONT color="#ffff00"><B>Der
          Mann-O-Mann</B></FONT></P>

          <P>30 Gr&uuml;nde, warum es wunderbar ist, ein Mann zu
          sein...</P>

          <P>1. Telefongespr&auml;che dauern nur 30 Sekunden.</P>

          <P>2. F&uuml;r 5-Tages-Urlaube ben&ouml;tigt Du nur EINEN
          Koffer.</P>

          <P>3. Du musst nicht das Sexualleben Deiner Freunde
          therapieren.</P>

          <P>4. Die Schlangen vor dem Klo sind 80 %
          k&uuml;rzer.</P>

          <P>5. Alten Freunden ist es egal, ob Du zu- oder
          abgenommen hast.</P>

          <P>6. Wenn Du durch TV-Programme zappst, brauchst Du
          nicht anhalten, wenn Du jemanden weinen siehst.</P>

          <P>7. Deine Orgasmen sind nicht vorget&auml;uscht.</P>

          <P>8. Du brauchst Dir nicht den Rock festzuhalten, wenn
          Du eine Treppe hinaufgehst.</P>

          <P>9. Du musst nicht in Gr&uuml;ppchen auf's Klo
          gehen.</P>

          <P>10. Du kannst morgens in 10 Minuten geduscht und
          fertig sein.</P>

          <P>11. Beim Sex musst Du nicht um Deinen Ruf besorgt
          sein.</P>

          <P>12. Deine Unterw&auml;sche kostet 5 Euro im
          Dreierpack.</P>

          <P>13. Es macht niemandem etwas aus, wenn Du 34 und noch
          nicht verheiratet bist.</P>

          <P>14. Du kannst 90 % Deiner Zeit nach dem Aufstehen an
          Sex denken.</P>

          <P>15. Dir sind drei Paar Schuhe mehr als genug.</P>

          <P>16. Du kannst Dein T-Shirt einfach ausziehen, wenn Dir
          zu hei&szlig; ist.</P>

          <P>17. Du brauchst Deine Wohnung nicht jedesmal putzen,
          wenn Besuch kommt.</P>

          <P>18. Auto-Mechaniker bel&uuml;gen Dich nicht.</P>

          <P>19. Du kannst mit einem Freund stundenlang ohne ein
          Wort zu sagen fernsehen, ohne zu denken "er ist sauer auf
          mich".</P>

          <P>20. Du kannst mit gespreizten Beinen sitzen, ohne
          dar&uuml;ber nachdenken zu m&uuml;ssen, was Du gerade
          anhast.</P>

          <P>21. Du bekommst f&uuml;r die gleiche Arbeit mehr
          Geld.</P>

          <P>22. Die Leute schauen Dir nicht in den Ausschnitt,
          wenn Du mit ihnen redest.</P>

          <P>23. Du kannst einen Freund besuchen, ohne ihm ein
          Geschenk mitzubringen.</P>

          <P>24. Du kannst Kondome kaufen, ohne dass sich der
          Verk&auml;ufer vorstellt, wie Du wohl nackt
          aussiehst.</P>

          <P>25. Pornofilme sind f&uuml;r DICH gemacht.</P>

          <P>26. Dass Dir eine Person nicht sympathisch ist,
          hei&szlig;t noch lange nicht, dass Du Dir keinen Sex mit
          ihr vorstellen kannst.</P>

          <P>27. Die Fernbedienung geh&ouml;rt Dir allein.</P>

          <P>28. Es gibt immer einen TV-Kanal, auf dem gerade Sport
          l&auml;uft.</P>

          <P>29. Du kennst nur einen Gem&uuml;tszustand.</P>

          <P>30. Du brauchst Dir nicht die Beine zu rasieren...</P>
          <HR>

          <P><FONT color="#ffff00"><B>Krankgeschrieben</B></FONT></P>

          <P>Ein Amerikaner, ein Engl&auml;nder und ein Deutscher
          gehen in eine Kneipe. Der Amerikaner ist blind, der
          Engl&auml;nder gel&auml;hmt und der Deutsche hat einen
          gebrochenen Arm.</P>

          <P>Da kommt pl&ouml;tzlich Jesus vorbei und fragt, ob er
          etwas f&uuml;r sie tun k&ouml;nne.</P>

          <P>Der Amerikaner sagt: "Ich w&uuml;rde gerne wieder
          sehen k&ouml;nnen."</P>

          <P>Jesus streicht ihm &uuml;ber die Augen und der
          Amerikaner kann wieder sehen.</P>

          <P>Sagt der Engl&auml;nder: "Jesus, ich w&uuml;rde gerne
          wieder laufen k&ouml;nnen."</P>

          <P>Jesus streicht ihm &uuml;ber die Beine und der
          Engl&auml;nder erhebt sich aus dem Rollstuhl.</P>

          <P>Als sich Jesus schlie&szlig;lich dem Deutschen
          zuwendet sagt dieser: "Hey, bevor du irgendwelchen
          Schei&szlig; machst, denk dran, ich bin noch drei Wochen
          krankgeschrieben!"</P>
          <HR>

          <P><FONT color="#ffff00"><B>Abendessen</B></FONT></P>

          <P>Karl l&auml;dt seine Frau in das teuerste Restaurant
          der Stadt ein.</P>

          <P>Als sie gerade beim Bestellen sind, kommt eine
          h&uuml;bsche junge Frau auf Karl zu, umarmt und
          k&uuml;sst ihn, wirft dessen Frau einen k&uuml;hlen Blick
          zu und verschwindet wieder.</P>

          <P>Karls Frau darauf verdattert:<BR>
          "Wer war, in Gottes Namen, denn die eben?"</P>

          <P>Karl bleibt cool:<BR>
          "Die? Meine Freundin!"</P>

          <P>Schockiert fordert seine Frau die Scheidung.</P>

          <P>Karl meint daraufhin ruhig:<BR>
           "Wenn Du auf mein Geld, meine Yacht, das Ferienhaus und
          den Porsche verzichten willst - O.K."</P>

          <P>Die Frau wird nachdenklich und endeckt ein paar Tische
          weiter Otto, einen gemeinsamen Freund.</P>

          <P>"Karl, ist das nicht Otto?"</P>

          <P>"Ja!"</P>

          <P>"Das ist aber nicht seine Frau..."</P>

          <P>Darauf Karl gen&uuml;sslich:<BR>
          "Nein, seine Freundin!"</P>

          <P>Karls Frau &uuml;berlegt kurz und sagt
          ver&auml;chtlich:<BR>
          "Aber unsere Freundin ist h&uuml;bscher, gell?"</P>
          <HR>

          <P><FONT color="#ffff00"><B>G&ouml;ttliche
          Strafe</B></FONT></P>

          <P>Ein T&uuml;rke, ein Wessi und ein Ossi treffen sich an
          der Himmelspforte.</P>

          <P>Sagt Gott zu dem T&uuml;rken:<BR>
           "Du hast viel gelogen in Deinem Leben. Du sollst mit 100
          Peitschenschl&auml;gen bestraft werden und hast einen
          Wunsch frei."</P>

          <P>Der T&uuml;rke w&uuml;nscht sich ein Kissen auf den
          R&uuml;cken. Die Strafe wird vollzogen.</P>

          <P>Dann widmet sich Gott dem Wessi:<BR>
           "Du hast viel gelogen in Deinem Leben. Du sollst
          ebenfalls mit 100 Peitschenschl&auml;gen bestraft werden.
          Auch Du hast einen Wunsch frei."</P>

          <P>Der Wessi - genauso gewitzt wie der T&uuml;rke -
          w&uuml;nscht sich wie dieser ein Kissen auf dem
          R&uuml;cken. Wuutsch... die Peitsche knallt nieder.</P>

          <P>Nun spricht Gott zu dem Ossi:<BR>
           "Du hast noch viel mehr gelogen in Deinem Leben. Mehr
          als die anderen beiden zusammen. Ich bestrafe Dich mit
          200 Peitschenschl&auml;gen. Daf&uuml;r hast Du auch zwei
          W&uuml;nsche frei."</P>

          <P>Darauf der Ossi:<BR>
           "Als ersten Wunsch h&auml;tte ich gerne 300
          Peitschenschl&auml;ge und als zweiten... dem Wessi auf
          den R&uuml;cken."</P>
          <HR>

          <P><FONT color="#ffff00"><B>Angeberei</B></FONT></P>

          <P>Beim Verlassen eines Damen-Modegesch&auml;ftes sagt
          die Frau zum Mann:<BR>
           "Ich habe wieder nichts passendes f&uuml;r meine Figur
          gefunden. Es ist einfach schwierig,
          &Uuml;bergr&ouml;&szlig;en zu finden!"</P>

          <P>Daneben steht ein junger Mann und h&ouml;rt dieses
          Gespr&auml;ch.</P>

          <P>Hierauf sagt er zu der Frau: "Ich habe das gleiche
          Problem, wenn ich Kondome kaufe..."</P>
          <HR>

          <P><FONT color="#ffff00"><B>Im
          Kindergarten</B></FONT></P>

          <P>Christian im Kindergarten weint erbitterlich.</P>

          <P>Die Kinderg&auml;rtnerin fragt ihn:<BR>
          "Wieso weinst du denn so?"</P>

          <P>Christian:<BR>
          "Meine Gummistiefel sind weg!"</P>

          <P>Die Kinderg&auml;rtnerin schaut nach und findet im
          Flur noch ein Paar Gummistiefel.</P>

          <P>Darauf Christian:<BR>
          "Tante Monika, das sind nicht meine, auf meinen war heute
          morgen noch Schnee drauf..."</P>
          <HR>

          <P>zusammengetragen von<BR>
          Cord Hagen</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

