<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Jugend und Wirtschaft</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Jugend und
          Wirtschaft</B></FONT></P>

          <P>Anl&auml;sslich der Preisverleihung "Jugend und Wirtschaft 2001/2002" am
          18. September&nbsp;2002 -gelesen in der FAZ (Frankfurter Allgemeine
          Zeitung) - kam mir in den Sinn, dass auch junge Amiga-User sich f&uuml;r
          dieses Thema interessieren k&ouml;nnten.</P>

          <P>Dr. Manfred Weber - Hauptgesch&auml;ftsf&uuml;hrer und Mitglied des
          Vorstandes des Bundesverbandes deutscher Banken - stellte in seiner
          Laudatio in den Vordergrund, dass mit der Auszeichnung der besten Artikel
          und der besonders engagierten Schulen das nun zum zweiten Male
          durchgef&uuml;hrte Projekt "Jugend und Wirtschaft", das zu Beginn f&uuml;r
          alle Neuland und durchaus auch ein kleines Wagnis war, inzwischen seine
          Feuertaufe &uuml;berzeugend bestanden hat. Und auch in den Schulen
          st&ouml;&szlig;t das Projekt auf gro&szlig;e Resonanz: Seit seinem Start
          vor zwei Jahren haben sich insgesamt mehr als 400 Schulen mit &uuml;ber
          10.000 Sch&uuml;lerinnen und Sch&uuml;lern um eine Teilnahme beworben.</P>

          <P>Besonders wichtig ist dabei meines Erachtens jedoch Folgendes: Die
          Bereitschaft, sich an einem Projekt zu beteiligen, das &uuml;ber ein ganzes
          Schuljahr einen so hohen Einsatz verlangt, zeigt mehr als deutlich, wie
          gro&szlig; bei Lehrern und Sch&uuml;lern das Interesse an Wirtschaftsfragen
          ist. Und diese Bereitschaft zeigt auch, dass Wirtschaft als wichtiges
          Unterrichtsthema zunehmend an Bedeutung gewinnt.</P>

          <P>Monat f&uuml;r Monat liest man nun im Wirtschaftsteil der Frankfurter
          Allgemeinen Zeitung die Beitr&auml;ge. Da geht es um neue Technologien wie
          UMTS, um &Ouml;kostrom und Landwirtschaft, um Luftfahrt, Weltraumtourismus,
          Teilzeitarbeit und die Greencard. Unternehmensideen wie die ja &uuml;berall
          aus dem Boden sprie&szlig;enden Kaffeebars werden analysiert, Franchising
          als Form der Selbstst&auml;ndigkeit wird untersucht und eine "Dorf-Bank" in
          Bangladesh vorgestellt. Betrachtungen zur Konjunkturentwicklung fehlen
          ebensowenig wie die Untersuchung des Verh&auml;ltnisses von Kultur und
          Wirtschaft. Und last but not least werden auch Sportereignisse wie die
          Formel 1 oder die letzte Fussballweltmeisterschaft unter die
          &ouml;konomische Lupe genommen.</P>

          <P>Bedingt durch das hochgestecktes Ziel, Sch&uuml;lerinnen und
          Sch&uuml;ler so f&uuml;r Wirtschaftsthemen zu interessieren, ja sie zu
          begeistern, dass sie die M&uuml;hen umfangreicher Recherchen und die
          Anstrengung des Schreibens auf sich nehmen, haben sie Auf diese Weise
          erfahren, dass Wirtschaft nicht gleichbedeutend ist mit
          Gro&szlig;unternehmen und internationalen Konzernen. Dass vielmehr auch die
          kleinen und mittleren Unternehmen vor Ort eine bedeutende Rolle spielen.
          Und sie haben auch erfahren, dass Wirtschaft alles andere ist als eine
          theoretische, trockene Veranstaltung aus dem Lehrbuch.</P>

          <P>Dr. Weber:</P>

          <BLOCKQUOTE>
            Bei einem so praxisnahen Projekt setzen sich die Sch&uuml;ler intensiv mit
            aktuellen Wirtschaftsthemen auseinander, und sie erfahren unmittelbar,
            welch gro&szlig;e Bedeutung die Wirtschaft f&uuml;r nahezu alle unsere
            Lebensbereiche hat. Und au&szlig;erdem: Was sie hier durch "learning by
            doing" an Wissen erwerben, ist heute mehr denn je wichtige Voraussetzung
            f&uuml;r ihre beruflichen Chancen und Perspektiven.<BR> <BR>

            Dar&uuml;ber hinaus wird durch die Besch&auml;ftigung mit Wirtschaftsfragen
            auch - ja, vielleicht gerade -die Wertehaltung zu unserer
            Gesellschaftsordnung ma&szlig;geblich gepr&auml;gt. Schon in der Schule
            m&uuml;ssen wir den Jugendlichen die zentralen Grundwerte von Demokratie
            und Marktwirtschaft vermitteln.<BR> <BR>

            Dazu z&auml;hlen auch f&uuml;r unsere Gesellschaft so wesentliche
            Eigenschaften wie Eigenverantwortung und Selbstst&auml;ndigkeit.
            Schlie&szlig;lich geht es um die Grundlage allen - nicht nur
            &ouml;konomischen -Handelns. Insofern ist die Besch&auml;ftigung mit
            Wirtschaftsfragen auch Erziehung zum verantwortlichen Gebrauch von Freiheit
            und damit Erziehung zur Demokratie.
          </BLOCKQUOTE>

          <P>Quintesenz:<BR>
          Die Welt von heute ist ohne Wirtschaftskenntnisse nicht mehr zu verstehen.
          Es zweifelt inzwischen niemand mehr daran, dass wirtschaftliches
          Grundwissen zur Allgemeinbildung geh&ouml;rt. Politiker und Eltern,
          Schulleiter und Lehrer, aber auch die breite &Ouml;ffentlichkeit sehen das
          so. Alle sind sich einig, dass wirtschaftliche Grundbildung
          unerl&auml;sslich ist, um verantwortlich und sachgerecht handeln zu
          k&ouml;nnen.</P>

          <P>Und auch die Sch&uuml;ler haben nichts gegen Wirtschaft im Unterricht -
          im Gegenteil. Das ausgepr&auml;gte Interesse und die gro&szlig;e
          Bereitschaft sich bei Projekten wie "Jugend und Wirtschaft" zu engagieren,
          liefern hierf&uuml;r den besten Beweis. Damit stellt sich nicht mehr die
          Frage, ob Wirtschaft in die Schule geh&ouml;rt, sondern wie das Thema dort
          integriert werden soll. Dabei gen&uuml;gt es nicht, wirtschaftliche Inhalte
          nur als Bestandteile anderer F&auml;cher zu unterrichten. Denn diese
          F&auml;cher sind weder dazu bestimmt noch geeignet, Wirtschaftskenntnisse
          systematisch zu vermitteln. Die Grundlagen &ouml;konomischen Wissens, kann
          wesentlich nur in einem eigenen Unterrichtsfach gelehrt werden. Die
          gro&szlig;e Bedeutung des Themas und seine Komplexit&auml;t machen ein
          Schulfach Wirtschaft erforderlich.</P>

          <P>Die Politik ist an dieser Stelle gefordert. Sie muss die Voraussetzungen
          daf&uuml;r schaffen, dass es in den Schulen mehr Raum f&uuml;r
          Wirtschaftsthemen gibt. Eine aktuelle Umfrage des ipos-Instituts
          unterst&uuml;tzt diese Forderung. Danach sind 80 % der Deutschen
          daf&uuml;r, dass Wirtschaftsthemen im Schulunterricht eine wesentlich
          gr&ouml;&szlig;ere Rolle spielen sollten als bisher. F&uuml;r die
          Einf&uuml;hrung eines eigenen Schulfaches Wirtschaft pl&auml;dieren
          bundesweit sogar 69 % der Bev&ouml;lkerung.</P>

          <P>Wie oben schon angef&uuml;hrt, haben sich seit dem Start des Projektes
          insgesamt &uuml;ber 400 Schulen mit mehr als 10.000 Sch&uuml;lerinnen und
          Sch&uuml;lern beworben. Die Teilnehmer hatten dabei Gelegenheit, jeden
          Monat im Wirtschaftsteil der Frankfurter Allgemeinen Zeitung Beitr&auml;ge
          zu ver&ouml;ffentlichen, die sie selbst recherchiert und geschrieben haben.
          Die Autoren der besten Artikel werden mit einem Multimedia-Notebook
          belohnt. Die jeweils drei besten Schulen erhalten dar&uuml;ber hinaus eine
          Geldpr&auml;mie in H&ouml;he von 5.000 Euro. Die Pr&auml;sidentin der
          Kultusministerkonferenz, Prof. Dr.-Ing. habil. Dagmar Schipanski,
          w&uuml;rdigte anl&auml;sslich der Preisverleihung das Projekt als
          vorbildhaft, zukunftsweisend und nachahmenswert. Es fordere Sch&uuml;ler
          und Lehrer gleicherma&szlig;en und verlange einen hohen Einsatz ab.
          Bildung, so Frau Schipanski weiter, sei eine wichtige Investition in die
          Zukunft -f&uuml;r jeden einzelnen, f&uuml;r jedes Unternehmen und f&uuml;r
          die Gesellschaft. Dass nun auch die Politik gefordert ist, hat sie
          wahrscheinlich wohlweislich vergessen zu erw&auml;hnen.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8" summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

