<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Rainer Thieke -->
    <TITLE>Da Return Of Da Storygame</TITLE>
  </HEAD>

  <BODY text="#87CEFA" bgcolor="black" link="green" alink="blue" vlink="green">
    <TABLE border="0" cellpadding="8" summary="" width="100%">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ff0000"><B><U>The Return Of The
          Storygame</U></B></FONT></H1>

          <P><FONT size="+1"><B>Ja, ja...ich wei&szlig;. Ma&szlig;nahmen zur
          Wiederbelebung einer Rubrik machen hier bei der NoCover soviel Sinn wie
          Essig in Cola zu giessen. Das hat ja schon mein damaliger Versuch mit dem
          Feedbackcorner gezeigt. :-(</B></FONT></P>

          <P><FONT size="+1">Und auch wenn ich in dieser Hinsicht eigentlich keine
          gro&szlig;en Hoffnungen habe, hab` ich trotzdem mal `ne kleine Story
          geschrieben, um das Storygame mal wieder in Gang zu setzen. Vielleicht hat
          ja der eine oder andere Interesse daran...!? Sinn des ganzen ist es, diese
          Story hier weiterzuschreiben. Dabei muss man sich nat&uuml;rlich nicht an
          meine Schreibweise halten, noch muss man den Rahmen der Science Fiction
          aufrecht halten. Es liegt ganz an Euch wie`s weitergeht -ob das Ganze in
          eine Fantasy-Story in einen Horror-Schocker oder in was Lustiges abdriftet
          - ob die Charaktere alle abkacken, absurde Sachen machen, Besuch bekommen,
          die Rocky Horror Picture-Show auf dem Mars veranstalten... oder
          sonstwas...! Lasst eurer Fantasie freien Lauf ! Es gibt keinerlei Grenzen.
          Ihr solltet aber euer Ende offen lassen, so dass dann in der n&auml;chsten
          Ausgabe ein anderer eure Geschichte weiterschreiben kann. Dadurch wird das
          Ganze eine Art "kollektiver Fortsetzungsroman", der nat&uuml;rlich tierisch
          genial werden kann. :-) Je mehr sich hier beteiligen, desto interessanter
          wird es nat&uuml;rlich. Also: lasset uns schreiben und der NoCover mal
          wieder ein paar Storys bescheren ! ;-) Es muss ja auch nicht ellenlang
          sein, 1-2 Seiten reichen vollkommen aus. It`s Just For Fun, Guys
          !</FONT></P>

          <H2 align="center"><FONT size="+1"><FONT color= "#ff0000"><B><U>Storygame -
          Die Vorgeschichte</U></B></FONT></FONT></H2>

          <P><FONT size="+1">Musik. Leise, klirrend - als w&uuml;rde sie aus einem
          weitr&auml;umigen Tunnel aus Glas mir entgegen schweben. Die leicht
          schr&auml;gen T&ouml;ne verursachten einen leichten schmerzhaften Stich in
          meinem Sch&auml;del. Im ersten Moment glaubte ich zu fantasieren. Eine
          Halluzination...ja, das musste es sein ! Dann jedoch wurde der Schmerz
          intensiver. Er kam auf mich zugerauscht und goss sich schlie&szlig;lich
          &uuml;ber mein Innerstes nieder wie eine gro&szlig;e Welle. Ich wurde unter
          seiner alles erdr&uuml;ckenden Macht erschlagen und &ouml;ffnete laut
          st&ouml;hnend meine Augen...</FONT></P> <HR>

          <P><FONT size="+1">23.12.2043 - mail to edward shou and friends</FONT></P>

          <P><FONT size="+1">Hi Leute !</FONT></P>

          <P><FONT size="+1">Dies ist meine letzte interstellare Nachricht vor dem
          heil`gen Feste. Ich hoffe ihr befindet Euch schon in weihnachtlicher
          Vorfreude und habt noch einen <B>ECHTEN</B> Weihnachtsbaum ergattern
          k&ouml;nnen. Mann, lasst die Finger von diesen k&uuml;nstlichen
          Tannenb&auml;umen - es geht doch echt nichts &uuml;ber das Aroma frischer
          Tannen innerhalb der eigenen vier W&auml;nde !</FONT></P>

          <P><FONT size="+1">Ich muss mich leider diesmal kurz fassen, da Cpt.Wesker
          mich heute f&uuml;r die Nachtschicht eingeteilt hat. Und die beginnt just
          in einer halben Stunde... Seid also nicht b&ouml;se, wenn es diesmal etwas
          k&uuml;rzer wird als gewohnt.</FONT></P>

          <P><FONT size="+1">Wir befinden uns jetzt drei Tage im Orbit. Bruder Mars
          sieht von hier oben absolut tot aus... ein Foto d&uuml;rfte dieser Datei
          anbei liegen. Wahnsinn, nicht wahr !?</FONT></P>

          <P><FONT size="+1">Unsere Untersuchungen sind fast abgeschlossen. Ich
          denke, dass wir schon in den n&auml;chsten Tagen zur Landung ansetzen
          k&ouml;nnen. Dann beginnt der Spa&szlig; erst richtig und wir werden neben
          den Proben auch den Landeradius von drei&szlig;ig Kilometern protokolieren.
          Alle weiteren Anweisungen werden dann wohl folgen. Ich halte Euch auf dem
          Laufenden.</FONT></P>

          <P><FONT size="+1">Wie ich h&ouml;rte, schneit es in Houston. Seid
          &uuml;ber zehn Jahren endlich mal wieder eine wei&szlig;e Weihnacht... und
          ausgerechnet dann bin ich nicht bei Euch. Aber sei es drum.</FONT></P>

          <P><FONT size="+1">Ich w&uuml;nsche Euch allen ein frohes Fest und viel
          Spa&szlig; beim ansammeln von Winterspeck !</FONT></P>

          <P><FONT size="+1">Haut rein !<BR> Jesus rules !<BR> Ben</FONT></P> <HR>

          <P><FONT size="+1">Ich war nicht vollkommen von der Dunkelheit umgeben, als
          ich die Augen langsam &ouml;ffnete. Etwas flackterte in einem
          unregelm&auml;&szlig;igen Rhythmus hoch &uuml;ber mir und spendete einen
          Hauch von Licht durch diesen Raum. Ich befand mich... auf der Trooper...
          oh, Gott... nein... die Trooper... Houston... Houston... Hou...</FONT></P>

          <BLOCKQUOTE>
            <FONT size="+1"><I>"HOUSTON !!!", br&uuml;llte Bill so laut er konnte in
            seine Interkomm-Einheit hinein. "WIR WURDEN BESCHOSSEN, HOUSTON !!!"<BR>

            Dicker Rauch quoll aus den umliegenden Terminals. Einige hatten begonnen
            unkontrolliert zu flackern und zahlreiche Fehlermeldungen rasten die
            Bildschirme hinauf. Urpl&ouml;tzlich fielen die Neonlichter aus. Die
            gesamte Crew, bestehend aus insgesamt vier Mann, schrie in Panik laut auf.
            Nur mehr die Bildschirme der Bord-Computer spendeten ein bescheidenes
            Licht.<BR> "DIE NOTSTROM-AGGREGATE EINSCHALTEN !", schrie Captain Wesker,
            w&auml;hrend er krampfhaft versuchte in der engen Kommandozentrale halt zu
            finden.<BR> "BIN UNTERWEGS, SIR !", antwortete Ben Griffith und verlies das
            schmale Cockpit, um im hintersten Teil der kleinen Trooper die
            sekund&auml;ren Systeme einzuschalten.<BR> 
            "HOUSTON !! BITTE KOMMEN !"<BR>            
            "HOUSTON, BEI GOTT, WIR ST&Uuml;RZEN AB !", keifte Frederic und sah durch
            die Frontansicht die h&auml;ssliche Oberfl&auml;che des Planeten Mars auf
            sich zu kommen.<BR>                        
            "...Houston...Cap...was...", knirschte es aus den Lautsprechern. Der Rest
            ging in eins statisches Rauschen &uuml;ber.<BR>    
            "VERGESST HOUSTON, WIR M&Uuml;SSEN UNS JETZT SELBST HELFEN! FRED! BEREITE
            ALLES F&Uuml;R EINE NOTLANDUNG VOR!"<BR>
            "Ja, Sir...", zischte der st&auml;mmige Pilot durch die Z&auml;hne.<BR>
            "BEN! WO BLEIBT DER NOTSTROM? ICH BRAUCHE HIER LICHT, VERFLUCHT NOCHMAL!"<BR>
            Keine antwort.<BR>    
            "BEN ?"<BR>         
            "ICH GEHE NACHSEHEN, SIR.", schrie Bill &uuml;ber den Krach hinweg, den das
            Schiff mittlerweile machte. Die Trooper trat durch die Atmosph&auml;re und
            war den immensen Belastungen anscheinend nicht gewachsen. Das Schiff
            erzitterte als w&uuml;rde es etwas geb&auml;ren. Ganze Innenteile
            l&ouml;sten sich knirschend und landeten krachend entweder auf den
            Bordcomputern oder dem schmalen Flur.<BR>  
            "NEIN, BEN! ICH WERDE GEHEN! BLEIBEN SIE AUF IHREN POSTEN, LEUTNANT!"<BR>
            "JA, SIR!"<BR>
            Captain Wesker schnappte sich seine Taschenlampe und hetzte durch den
            schmalen Flur an Bill vorbei, der gerade dabei war sich in das Cockpit zu
            zw&auml;ngen um Frederic bei der Landung behilflich zu sein. Er fand Ben
            Griffith im Maschinenraum, dem hintersten Teil der Trooper, in der
            n&auml;he der sekund&auml;ren Computerterminals. Er lag seitlich auf den
            Boden. Der Lichtkegel der Taschenlampe glitt &uuml;ber die Wunde an seinem
            Kopf. Das dicke Rohr lag etwas abseits neben ihm.<BR>  
            "Verdammte Scheisse...", grunzte der Captain.<BR>      
            "CAPTAIN, BEN ! ALLES BEREITHALTEN ! WIR LANDEN IN 10, 9, 8, 7..."<BR>
            "Kommen, Sie. Wachen Sie auf, Herrgott...", zischte Wesker und schlug
            Benjamin abwechselnd von einer auf die andere Wange.<BR>
            Aber er war der alles verschlingenden Ohnmacht zum Opfer gefallen. Wesker
            nahm ihn auf.<BR> "4, 3..."<BR>                        
            Er schlang seine Arme um Griffith`s H&uuml;fte und um eines der noch
            intakten Verbindungsrohre im Maschinenraum. Seine Muskeln spannten sich bis
            in das unermessliche, w&auml;hrend sein blick starr durch sein
            Crew-Mitglied hindurch glitt, den er wie ein Sandwich zwischen sich und dem
            Rohr gequetscht hatte.<BR> "AUF DEN AUFPRALL VORBEREITEN !", h&ouml;rte er
            das br&uuml;llen zwei R&auml;ume weiter vorne aus dem Cockpit.<BR>
            "Verlfluchter-Teufel-heilige-Maria-Mutter-Gottes-Jesus-und-Konsorten..."
            </I></FONT>
          </BLOCKQUOTE>

          <P><FONT size="+1">Die Erinnerung an das Geschehene kam schlagartig. Sie
          kam nicht intervallweise, wie man es meistens gewohnt ist, sondern brannte
          sich von jetzt auf gleich in mein Ged&auml;chtnis hinein. Wir waren nichts
          weiter als auf einer Forschungsmission gewesen - im auftrag der Vereinigten
          Staaten. Der Mars war unser Ziel ! Die Scanns von der Oberfl&auml;che
          hatten wir noch nicht ganz abgeschlossen als wir urpl&ouml;tzlich von etwas
          getroffen wurden. Irgend etwas hatte auf uns geschossen ! Und dieses etwas
          konnte nicht im Raum gewesen sein, denn sonst h&auml;tten uns unsere
          Sensoren dar&uuml;ber aufschluss gegeben - Nein, wir wurden von der
          Oberfl&auml;che des Planeten aus beschossen ! Aber...wie konnte das sein ?
          Wer oder was befand sich auf diesen Planeten ?</FONT></P>

          <P><FONT size="+1">Der Schmerz setzte wieder ein und erinnerte mich daran,
          dass ich noch lebte. Gott hatte seine sch&uuml;tzende Hand &uuml;ber mich
          gehalten ! Aber es war jetzt nicht die Zeit f&uuml;r irgendwelche
          Stossgebete gen Himmel, denn ich musste wissen wie es um meine drei
          Kameraden stand.<BR>
          Frederic...Bill...und Captain Wesker !<BR>
          "HALLO ?", kr&auml;chzte ich kaum h&ouml;rbar, immer noch auf dem Bauch liegend.
          Ich r&auml;usperte mich kr&auml;ftig und versuchte es ein weiteres mal.<BR>
          "KANN MICH JEMAND H&Ouml;REN ?"<BR>
          Nichts.<BR>
          Rein gar nichts.<BR>
          Daf&uuml;r begann das flackern hoch &uuml;ber mir wieder. Ich riss mich
          zusammen und versuchte aufzustehen. Die Schmerzen in meinem Sch&auml;del
          waren unbeschreiblich, und nur mit der gewaltigen Wucht eines
          Vorschlaghammers zu beschreiben. Nachdem ich mich auf den R&uuml;cken
          gew&auml;lzt hatte konnte ich den ursprung des Lichtes ausmachen. Eine
          kleine Neonr&ouml;hre flackerte einsam und verlassen.</FONT></P>

          <P><FONT size="+1">Ich stemmte mich unter schmerzen auf. Ich musste mir
          mehrere Prellungen zugezogen haben - aber weitaus ernster war die
          Fleischwunde an meinem Hinterkopf. Zum Gl&uuml;ck war die Wunde so weit
          verkrustet, dass die Blutung nicht l&auml;nger im Gange war. M&uuml;de und
          ausgelaugt betrachtete ich meine Umgebung.</FONT></P>

          <P><FONT size="+1">Der Maschineraum war ein einziges Chaos. Das konnte ich
          trotz des schwachen Lichts erkennen. Ebenfalls schwach erkennen konnte ich
          den menschlichen K&ouml;rper, der nicht unweit von meiner alten Position
          auf der Seite lag. Ich kniete mich neben ihm hin, griff an seine Schulter
          und drehte ihn auf den R&uuml;cken, Es war Captain Wesker. Er hatte es
          nicht geschafft. Ein riesiger Metallfetzen hatte sich durch seinen Hals
          gebohrt. Auch sein Blut war bereits verkrustet, weswegen ich mich zu fragen
          begann wieviel Zeit seid unseren beschuss vergangen war. Ich entdeckte die
          Taschenlampe neben ihm und nahm sie auf. Nach einigem herum probieren
          atmete ich erleichtert auf als der kleine, geb&uuml;ndelte Lichtstrahl
          aufflammte.</FONT></P>

          <P><FONT size="+1">Die Trooper stand still. Waren wir notgelandet ? Das
          musste des R&auml;tsels l&ouml;sung sein ! Ich k&auml;mpfte mich durch
          R&ouml;hren und Metallteile nach vorne zur Durchgangsluke um in das
          Schlafquartier zu kommen. Auch hier lag nichts mehr an seinem
          Bestimmungsort, und der Aufprall hatte sogar zwei der insgesamt vier Betten
          vollkommen in seine Bestandteile zerlegt. Langsam schritt ich durch die
          Luke in die enge Kommandozentrale, die direkt mit dem Cockpit verbunden
          war.</FONT></P>

          <P><FONT size="+1">Dort entdeckte ich meine beiden anderen
          Kameraden...</FONT></P>

          <P align="center"><FONT size="+1">(Wie geht`s weiter ??????)</FONT></P>

          <H3 align="center"><A href= "mailto:rainermachine@yahoo.de"><FONT
          size="+1">Rainer "The Machine" Thieke</FONT></A></H3>

          <CENTER>
            <FONT size="+1"><IMG src="machine.gif" width="400" height="220"></FONT>
          </CENTER>
          <BR>
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

