<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Wintersevice</TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
  </HEAD>

  <BODY background="bg3.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellpadding="10" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#FFFF99"><B>Winterservice</B></FONT></H1>

          <P>Die meisten werden es ja schon bemerkt haben, aber man glaubt kaum dass
          bald wieder Winter ist.<BR>

          Wir ziehen uns w&auml;rmer an, feste Schuhe, einen Hut und beim Einkaufen
          vielleicht mal einen G&uuml;hwein.<BR>
          Soweit sogut.<BR>                     
          Langsam aber sicher wird es auch Zeit, uns um unserern fahrbaren Untersatz
          zu k&uuml;mmern und ihn winterfest zu machen.</P>

          <DIV align="center">
            <IMG src="tt_flake.jpg" border="3" width="188" height="185" alt="flake">
          </DIV>
          
          <P>Fangen wir im Motorraum an:<BR>
          Dort gibt es gleich drei Dinge um die wir uns k&uuml;mmer sollten.<UL>
          <LI> <B>K&uuml;hlwasser</B></LI>
          <LI> <B>Scheibenwaschwasser</B> (falls vorhanden
          <B>Scheinwerferreinigungsanlage</B>)</LI>
          <LI> <B>Starterbatterie </B> </UL></P>


          <P><B>K&uuml;hlwasser:</B> <BR>

          Um auf den in unseren Breiten g&auml;ngigen -25&deg; C Frostschutz zu
          kommen ist ein Mischungsverh&auml;ltnis von 40% Frostschutz und 60% Wasser
          erforderlich. Wird mehr Frostschutz verlangt, z.B. -35&deg; C, ist das
          Mischungsverh&auml;ltnis 1:1. Das geht nat&uuml;rlich nur richtig bei einer
          Neubef&uuml;llung des K&uuml;hlsystems.</P>

          <P>Im Zubeh&ouml;rhandel gibt es preiswerte Frostschutzspindeln zum Messen
          des Frostschutzmittels.</P>

          <P>Falls nachgef&uuml;llt werden muss: Es gibt zwei verschiedene Arten von
          Frostschutzmittel: Rot und Gr&uuml;n. Die d&uuml;rfen nicht gemischt werden
          und haben etwas mit den im Motor verwendeten Metallen zu tun (Alu und
          Grauguss). </P>

          <P><B>Scheibenwaschanlage (Scheinwerferreinigungsanlage):</B><BR>

          Auch hierf&uuml;r ben&ouml;tigen wir einen Frostschutz, aber dieses mal in
          Form von Alkohol. Der soll nicht nur das einfrieren der Scheibenwaschanlage
          verhindern, sondern auch daf&uuml;r sorgen, das das Waschwasser nicht auf
          der Scheibe gefriert. Frostschutz f&uuml;r die Scheibenwaschanlage gibts an
          jeder Tankstellen oder im Supermarkt. Mischungsverh&auml;ltnis nach
          Anleitung der Verpackung.</P>

          <P>Bekannt ist ja auch diese Methode: Brennspiritus in den Beh&auml;lter
          geben. Aber das ist nicht zu empfehlen. erstens riecht Spiritus nicht sehr
          angenehm und zweitens ist selbiger nicht f&uuml;r den Gebrauch im Kfz
          geeignet, weil der Spiritus die Schl&auml;uche der Scheibenwaschanlage
          aush&auml;rtet und br&uuml;chig macht.</P>

          <P><B>Starterbatterie:</B> <BR>

          Erst einmal <FONT color="#FF3333"><B>eine Warnung:</B></FONT> Hier haben
          wir es mit Strom und S&auml;ure zu tun. Das hei&szlig;t kein Werkzeug oder
          Metall auf der Batterie ablegen und am Batteriegeh&auml;use kann S&auml;ure
          vorhanden sein. </P>

          <P>Ist das Batteriegeh&auml;use durchsichtig, kann der S&auml;urestand von
          aussen gepr&uuml;ft werden. Der S&auml;urestand sollte zwischen der Min.-
          und Max.-Markierung liegen.</P>

          <P>Ist das Geh&auml;use undurchsichtig, dann werden die Verschlussstopfen
          entfernt. Durch das Loch gesp&auml;ht sollte der S&auml;urestand ca. 5mm
          &uuml;ber den Bleiplatten liegen. Ist der S&auml;urestand zuniedrig, wird
          mit Batteriewasser (destilliertemWasser) bis zum Sollwert aufgef&uuml;llt.
          </P>

          <P>Auf <B>keinen Fall</B> darf mit Batteries&auml;ure aufgef&uuml;llt
          werden! Die wird nur zur neubef&uuml;llung von Batterien ben&ouml;tigt.</P>

          <P>Ein anderer Fall sind Batterien ohne Verschlussstopfen: Das sind
          meistens <B>Blei-Gel Akkus</B>. Um diese braucht sich niemand
          zuk&uuml;mmern, dort kann und darf kein Batteriewasser nachgef&uuml;llt
          werden.</P>

          <P>Nun gehen wir um unser Fahrzeug herum. <BR>

          Begutachten wir die Scheibenwischerbl&auml;tter (Scheibenwischergummi).
          Eigentlich sieht jeder selbst, ob die Wischergummi verschlissen sind oder
          nicht an deren Reinigung der Scheibe. Schmiert es, rubbelt oder quietscht
          es, hilft es oft die Scheibe mit einen Haushaltsreiniger zus&auml;ubern.
          &Auml;ndert sich dadurch nichts, sind neue Wischerbl&auml;tter f&auml;llig.
          Sind die Wischerbl&auml;tter beim genauen anschauen rissig, die Wischlippe
          ausgefranst oder an den Enden eingerissen gilt auch hier: um Ersatz
          k&uuml;mmern.</P>
          
          <DIV align="center">
            <IMG src="tt_key.jpg" border="3" width="200" height="237" alt="key">
          </DIV>

          <P><B>T&uuml;ren und Schl&ouml;sser:</B> <BR>

          Damit uns die Sch&ouml;sser im Winter nicht so schnell einfrieren sind
          dort, wo der Schl&uuml;ssel eingef&uuml;hrt wird, sogenannte Schliessfallen
          vorhanden. Das sind kleine Klappen die den Schliesszylinder vor Staub und
          Feuchtigkeit sch&uuml;tzen sollen.</P>

          <P>Diese Klappen und die Schliesszylinder frieren gerne ein. Dagegen muss
          etwas getan werden. Die Feuchtigkeit muss zuerst einmal raus. Das geht mit
          etwas Pressluft (aber wer hat die schon) oder Kontaktspray. Etwas
          reingespr&uuml;ht in den Schliesszylinder und wirken lassen. Jetzt heisst
          es den Zylinder wieder zuschmieren, denn das Kontaktspray entfettet den
          Schliesszylinder. Dazu aber bitte kein &Ouml;l nehmen, denn das kann harzen
          und dann geht das Schloss vielleicht auch nicht auf. Daf&uuml;r gibt es
          Spezielle Spray`s oder Graphitpuder. Bei Graphitpuder bitte etwas
          vorsichtig sein, denn das schmiert auch gerne auf den Klamotten.</P>

          <P>Bei den T&uuml;ren k&uuml;mmern wir uns jetzt um die
          T&uuml;rdichtungen.<BR>

          Auch die frieren sehr gerne am T&uuml;rholm fest, wenn dort zuviel
          Feuchtigkeit von z. B. einer Wagenw&auml;sche vorhanden ist. Daf&uuml;r
          gibt es besondere Stifte, die wie Klebestifte funktionieren. Aber auch
          Vaseline ist sehr gut daf&uuml;r geeignet. Die Dichtungen der T&uuml;ren
          nur leicht einstreichen, damit nicht wieder unsere Kleidung beim Einsteigen
          leidet. </P>

          <P>Und nicht die Heckklappe vergessen, denn wer ein Kombioder
          Kompakt-Fahrzeug besitzt kann zur Not auch mal durch den Kofferraum sein
          Fahrzeug besteigen.</P>

          <P>Zuletzt bekommt der Schliesszapfen am T&uuml;rholm (dort wo sich die
          T&uuml;r festh&auml;lt) noch ein klein bisschen Fett ab.</P>

          <DIV align="center">
            <IMG src="tt_car.jpg" border="3" width="254" height="83" alt="kaefer">
          </DIV>

          <P>Nun zu den <B>Reifen:</B> <BR>

          Reifen brauchen etwas Pflege. Nicht viel. Wichtig ist nat&uuml;rlich die
          Kontrolle des Luftdrucks. Der steht meist in der Tankklappe oder im
          Handschuhfach, auf jedenfall in der Bedienungsanleitung. Und beim
          Luftpr&uuml;fen den Reifen nach Besch&auml;digungen absuchen
          (Fremdk&ouml;rper in der Lauffl&auml;che, Risse und Beulen an der
          Seitenwand). Aber das macht man auch alles in der &uuml;brigen
          Jahreszeit.</P>

          <P>Im Winter brauchen wir im allgemeinen <B>Winterreifen</B>. Nicht nur um
          besser &uuml;ber die verschneiten Stra&szlig;en zukommen, nein, um besser
          mit unserem Fahrzeug durch den Winter zukommen. Da hei&szlig;t ja nicht nur
          Schnee und Eis, sondern auch N&auml;sse und Frost. Daf&uuml;r sind die
          Winterreifen gebaut: f&uuml;r die "tiefen Temperaturen". Damit k&ouml;nnen
          Winterreifen wesentlich besser umgehen als Sommerreifen, denn die bleiben
          auch bei niedrigen Temperaturen elastisch. Die sogenanntem M+S (Matsch +
          Schnee) greifen noch bei Temperaturen wo Sommerreifen schon hilflos
          rutschen.</P>

          <P>Noch einmal zum Luftdruck: den Winterreifen 0,2 bar mehr Luftdruck
          geben.<BR>

          Ob Sommer- oder Winterreifen: Nicht unter 4mm Restprofil in der
          Winterzeit.</P>

          <DIV align="center">
            <IMG src="tt_light.jpg" border="3" width="110" height="95" alt="licht">
          </DIV>

          <P><B>Beleuchtungsanlage:</B> <BR>

          Nat&uuml;rlich die Aussenbeleuchtung auf Funktion pr&uuml;fen. Ist man
          allein, geht das nat&uuml;rlich schlecht beim Bremslicht. Hierf&uuml;r
          eignet sich die Garage, eine Hauswand oder beim Laternenparken das folge
          Fahrzeug. In den R&uuml;ckspiegel sehen, Bremse treten und auf das
          angehende (Rot)Licht achten.</P>

          <P>Noch ein kleiner Tipp mit auf den Weg: In den Kofferraum eine Decke, ein
          Starthilfekabel, Enteiserspray und Eiskratzer. F&uuml;r die Jackentasche
          eine kleine Spraydose T&uuml;rschlossenteiser f&uuml;r diejenigen, deren
          Auto immer noch an eingefrorenen Schliesszylindern leiden.</P>
          
          <CENTER>
            <FONT color="#CC33CC">Gute Fahrt nicht nur im Winter w&uuml;nscht</FONT>
          </CENTER>
          <BR>
          <HR>
          <BR>

          <CENTER>
            <TABLE border summary="">
              <TR>
                <TH bgcolor="#CCCCCC">
                  <CENTER>
                    J&uuml;rgen Sperling
                  </CENTER>
                </TH>
              </TR>

              <TR>
                <TH bgcolor="#FFFFCC">
                sperlingbergen@freenet.de</TH>
              </TR>
            </TABLE>
          </CENTER>
          <BR>
          <BR>
           
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

