<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="author" content="Wolf Zimmer">

    <TITLE>Streckenplaner 97</TITLE>
  </HEAD>

  <BODY background="wolf1.gif" text="black" link="blue" alink="red" bgcolor="#ffffcc">
  <TABLE border=0 width=100% cellpadding=8 summary=""><TR><TD>

    <H1 align=center><FONT color="#000080"><B>Streckenplaner 97</B></FONT></H1>

    <P>Hinweis: Diese Besprechung wurde in der NoCover-43 ver&ouml;ffentlicht. </P>

    <P>Wer den urspr&uuml;nglichen Streckenplaner von 1993 noch kennt und sich
    nun die heutige Version anschaut, wird erstaunt sein, was Ludger Solbach
    zwischenzeitlich vollbracht hat. Damals hie&szlig; er noch ARoute und war
    PD (Sharegeb&uuml;hr 40.-DM). Bei der Routenberechnung konnte man getrost
    sich einen Kaffee holen gehen, eine Zigarette anz&uuml;nden und schon mal
    den Atlas aufschlagen. Wenn dann das Ergebnis kam, war eine Nachbesserung
    bei der Steckenf&uuml;hrung meist unumg&auml;nglich. Wenn mit der Zeit die
    Datenbank der Orte und Stra&szlig;en weitestgehend berichtigt und
    erg&auml;nzt worden war und nun das Programm eine Route errechnen durfte,
    blieb bis zum Erscheinen des Ergebnisses nun so viel Zeit, dass man den
    geholten Kaffee auch austrinken konnte. Diese Zeiten haben sich
    ge&auml;ndert. Und zwar gewaltig.</P>

    <P><IMG src="xt13t.jpg" width="161" height="160" align="left" hspace="6"
    vspace="3" alt="CD-Cover"> Heute ist der Streckenplaner kein
    Sharewareprogramm mehr, sondern wird konventionell auf einer CD vertrieben.
    Diese ist mit beinahe 61 MB an Daten bef&uuml;llt. Mittels des
    mitgelieferten HD-Installers wird auf der Festplatte ein eigenes
    Verzeichnis angelegt und 2,7 MB Daten hineinkopiert. Die Differenz ergibt
    sich aus 7,8 MB weiteren Bilder und 50,2 MB Geo-Daten (alle einzelnenen
    Erdteile, wobei Amerika nochmals nach Nord- und S&uuml;damerika geteilt
    ist), die nicht mit &uuml;bernommen werden. Beim Kopieren werden keine
    weiteren Verzeichnisse angefasst, bef&uuml;llt bzw. ge&auml;ndert.
    Vorausgesetzt wird aber ein 020-Prozessor und 2, besser 3 MB
    Hauptspeicher.</P>

    <P>Der Streckenplaner ist ein Routenerrechnungs- und Darstellungsprogramm
    f&uuml;r unsere liebsten Blechkinder (Auto und Motorrad), damit ungewollte
    Abstecher ins Gr&uuml;ne und sonstige Umwege in der Landschaft nicht zu
    &auml;rgerlichen Reiseerlebnissen werden. Ausgiebiges Bl&auml;ttern im
    Stra&szlig;enatlas nach der schnellsten, billigsten, k&uuml;rzesten oder
    angenehmsten Streckenf&uuml;hrung geh&ouml;rt der Vergangenheit an. Das
    Ergebnis der noch so komplexesten Strecke liegt innerhalb von keinen 2
    Sekunden sichtbar auf dem Bildschirm vor. Das sind Welten gegen&uuml;ber
    1993. Was hei&szlig;t hier Welten, Galaxien sind es.</P>

    <TABLE border="0" summary="" width="100%">
      <TR>
        <TD><A href="xt13b.jpg" target="_top"><IMG src="xt13bk.jpg" width="320"
        height="256" border="3" align="left" hspace="10" vspace="0" alt=""></A>
        <A href="xt13a.jpg" target="_top"><IMG src="xt13ak.jpg" width="320"
        height="256" border="3" hspace="10" vspace="0" alt=""></A> </TD>
      </TR>
    </TABLE>

    <P>Der Streckenplaner ist aber kein simples
    Stra&szlig;enkartendarstellungsprogramm, es gibt auch Informationstexte und
    Bilder zu "zahlreichen" St&auml;dten. Weiterhin lassen sich bequem
    Rundreisen konzipieren. Die Darstellung der einzelnen Teilst&uuml;cke
    geh&ouml;rt der Vergangenheit an. Es darf aber nicht verhohlen werden, dass
    der Streckenplaner kein Autoatlas in Vektorgrafik ist, sondern wie der Name
    sagt, ein Streckenplaner. Demgem&auml;&szlig; fallen die wenigen Bilder und
    Texte zu Orten sehr sp&auml;rlich aus. Der eigenen Kreativit&auml;t sind
    aber keine Grenzen gesetzt. Die Stra&szlig;enf&uuml;hrungen enden immer an
    der deutschen Grenze, wenn man nicht auch die Daten von D&auml;nemark, der
    Schweiz und &Ouml;sterreich geladen hat. Ortsnamen werden in der jeweiligen
    Landessprache geschrieben. Weitere Staaten sind bisher nicht
    erfa&szlig;t.</P>

    <P>Da man laut Murphi gerade in dem Ort wohnt, der hier fehlt, kann dies
    problemlos behoben werden. Man mu&szlig; nur die geografischen Koordinaten
    kennen, bzw. diese bei der Gemeindeverwaltung erfragen. Es k&ouml;nnen aber
    auch die Koordinaten nach Gauss-Krueger (deutsches Vermessungswesen) oder
    nach UTM (NATO/Bundeswehr/Katastrophenschutz) verwendet werden. Bei der
    Abspeicherung wird nach geografischen Koordinaten umgerechnet. Nun
    m&uuml;ssen noch die Stra&szlig;en nachgetragen werden. Jetzt kann immer
    von der eigenen Haust&uuml;re aus geplant werden. Wer nichts nachtragen
    will oder braucht, kann das Programm von CD aus nutzen. Es gibt kein
    Zeitverlust, nur Platzersparnis auf der Festplatte und man kann sich die
    ganze Welt in Vektorgrafik anschauen.</P>

    <CENTER>
<PRE>
<B>   ************************************************************
   * Titel           : Streckenplaner 97                      *
   * Autor           : Ludger Solbach                         *
   * Vertrieb        : Schatztruhe und andere                 *
   * Preis           : jetzt 39,- DM (vormals 59.- DM)        *
   ************************************************************
   * Interface       : 2                                      *
   * F&uuml;lle           : keine Wertung                          *
   * Preis/Leistung  : 1                                      *
   *                                                          *
   * Gesamtnote      : 1-2                                    *
   *                                                          *
   * Positiv         : sehr schnelle Darstellung der errech-  *
   *                   neten Route mit Zeit- u. Spritbedarf.  *
   * Negativ         : Nur wenige touristische Informationen  *
   *                   und Bilder.                            *
   ************************************************************
   * FAZIT           : Wer w&auml;hrend der Fahrt nur einen roten  *
   *                   Faden &uuml;ber die Wegef&uuml;hrung mit Hinweis *
   *                   von Abzweigungen ben&ouml;tigt, ist mit die-*
   *                   sem Programm sehr gut bedient.         *
   ************************************************************
</B>
</PRE>
    </CENTER>
    <HR>

    <H2 align="center"><A href="javascript:history.back()"><B>zur&uuml;ck</B></A></H2>
    <BR>
  </BODY>
</HTML>

