<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Drucker-Workshop</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align=center><FONT color="#ffff00"><B>"Tintenstrahler II"</B></FONT></H1>

          <P>Hallihallo und da sind wir beim zweiten Teil unseres Drucker-Workshops.
          Heute werden wir uns weitere wichtige Faktoren beim Tintenstrahldruck
          ansehen. Auf die verschiedenen Tinten und Papiere gehen wir ebenso ein.</P>

          <P><FONT color="#ffff00"><B>5. Die Aufl&ouml;sung -Ma&szlig;stab aller
          Drucker</B></FONT></P>

          <P>Worauf der K&auml;ufer eines neuen Druckers besonders achtet, ist an
          oberster Stelle die druckbare Aufl&ouml;sung gemessen in dpi. Dieser Wert
          gibt an, wieviele Tintentr&ouml;pfchen (Dots) der Druckkopf des Modells pro
          Fl&auml;cheneinheit auf das Papier bringen kann. Je h&ouml;her dieser Wert
          ist, desto detalierter k&ouml;nnen Text und Bilder gedruckt werden. Bei
          beispielsweise 1200x600 dpi sind das siebenhundertzwanzig Tausend Tropfen,
          die auf einen quadratischen Zoll, also eine Fl&auml;che von exakt 2,54
          Zentimeter mal 2,54 Zentimeter geschossen werden. Umgerechnet haben wir
          daher &uuml;ber einhundertelftausend Tintentropfen auf einem
          Quadratzentimeter zur Verf&uuml;gung. Und die Aufl&ouml;sungen sind in
          letzter Zeit noch deutlich gestiegen, so dass diese Werte eher schon zum
          unteren Standard geh&ouml;ren.</P>

          <P><B>Warum werden oft zwei verschiedene Aufl&ouml;sungen genannt?</B></P>

          <P>Der eine Wert bezeichnet die horizontale Aufl&ouml;sung, die in
          Bewegungsrichtung des Druckkopfes von der Schussfrequenz und der
          Bewegungsgeschwindigkeit des Druckkopfes abh&auml;ngig ist. Der zweite Wert
          ist die vertikale Aufl&ouml;sung - sie ergibt sich aus der
          Positioniergenauigkeit des Papiervorschubs. Sind diese beiden Werte in den
          Druckerangaben unterschiedlich hoch, so bezeichnet der h&ouml;here Wert die
          horizontale Aufl&ouml;sung. Der niedrigere Wert steht f&uuml;r die
          vertikale Aufl&ouml;sung. Die Schussfrequenz der Druckk&ouml;pfe ist bei
          weitem einfacher zu handhaben, als der mikrometer genaue Papiervorschub.
          Daher kommen bei vielen Modellen diese unterschiedlichen
          Aufl&ouml;sungswerte zustande. Allerdings sollte fairerhalber bemerkt
          werden, dass nicht alles allein von der Aufl&ouml;sung abh&auml;ngig ist.
          Wie so oft ist das Zusammenspiel aller Komponenten ebenfalls
          entscheidend.</P>

          <P>Wie oft nun ein Druckkopf &uuml;ber das Papier geschickt werden muss, um
          eine bestimmte Fl&auml;che mit der jeweiligen Aufl&ouml;sung zu
          f&uuml;llen, wird durch die Anzahl der Druckd&uuml;sen und deren Abstand
          zueinander bestimmt. Hier spielt dann auch die Geschwindigkeit selbst eine
          gro&szlig;e Rolle.</P>

          <P><FONT color="#ffff00"><B>6. Scharfer Text und echte Fotos - mittlerweile
          kein Problem mehr</B></FONT></P>

          <P>Wie erw&auml;hnt ist die Aufl&ouml;sung nicht allein ma&szlig;geblich
          f&uuml;r die Qualit&auml;t des Ausdruckes verantwortlich. Oft gibt es
          Druckermodelle, die auf den Officebereich zielen und superscharfen
          Textdruck mit dennoch hoher Druckgeschwindigkeit kombinieren. Andere
          Druckermodelle bieten erstklassigen Fotodruck und lassen sich hierf&uuml;r
          dann etwas mehr Zeit, um den Druckkopf m&ouml;glichst genau zu plazieren
          und dadurch h&ouml;chstm&ouml;gliche Aufl&ouml;sungen zu erzielen. Hier
          kommt dann auch noch der interne Speicher des Druckers sehr zum Tragen, der
          viel dazu beitr&auml;gt, den Rechner bei hohem Druckdatenaufkommen zu
          entlasten und den Druck zudem beschleunigen will. Weiterhin wichtig ist
          selbstverst&auml;ndlich die Gr&ouml;&szlig;e der Tropfen. Aktuellere
          Druckermodelle setzen hier auf neue Techniken, die unterschiedlich
          gro&szlig;e Tr&ouml;pfchengr&ouml;&szlig;en erm&ouml;glichen. So
          k&ouml;nnen gro&szlig;e Farbfl&auml;chen mit gro&szlig;en
          Tintentr&ouml;pfchen schnell und gut abdeckend bedruckt werden,
          w&auml;hrend kleine Tr&ouml;pfchen scharfe Konturen und pixelfreie Details
          auf das Papier zaubern k&ouml;nnen. Bei den Tinten ist ein pigmentiertes
          Schwarz am besten f&uuml;r scharfen Textdruck geeignet. Pigmentierte Tinte
          verhindert den sogenannten Blooming-Effekt. Drucker, die mit variablen
          Tr&ouml;pfchengr&ouml;&szlig;en arbeiten, setzen beispielsweise beim
          Textdruck auf kleine Tr&ouml;pfchen und erreichen zusammen mit der
          pigmentierten Farbe dadurch das bestm&ouml;gliche Schriftbild.</P>

          <P>F&uuml;r den farbigen Druck verwenden die meisten Ger&auml;te Tinten
          ohne Pigmente in den Farben Zyan (T&uuml;rkis), Magenta (Rosa) und Gelb.
          F&uuml;r hellere Farben werden zwischen den Farbpunkten ganz einfach
          wei&szlig;e Fl&auml;chen freigelassen. Bei besonders hellen Farbt&ouml;nen
          fallen aber die wenigen, dann noch verbleibenden Farbpunkte unangenehm auf
          und stechen dem Betrachter f&ouml;rmlich ins Auge. Deshalb verf&uuml;gen
          vern&uuml;nftige Fotodrucker zu den &uuml;blichen vier Druckfarben zwei
          weitere, ein helles Zyan und ein helles Magenta. So k&ouml;nnen helle
          Fl&auml;chen mit vielen optisch unauff&auml;lligen Punkten bedruckt werden.
          F&uuml;r m&ouml;glichst gute Druckergebnisse ist es wichtig, dass die Tinte
          in mehreren Durchg&auml;ngen aufgetragen wird. So wird verhindert, dass die
          Tropfen ineinander verlaufen. Die aufgetragene Tinte kann ins Papier
          einsinken und die n&auml;chsten Tropfen landen wieder auf trockenem und
          aufnahmef&auml;higem Untergrund. Einige Druckermodelle verf&uuml;gen sogar
          &uuml;ber eine gesonderte Fixierfl&uuml;ssigkeit, die oft im schwarzen
          Tintentank mitgef&uuml;hrt wird. Sie wird vor der Tinte auf das Papier
          aufgetragen. Das dadurch behandelte Papier nimmt die Tinte schnell auf. Die
          Tropfen trocknen sofort, verlaufen nicht und zudem wird der Ausdruck gegen
          UV-Licht und zum Teil sogar gegen Feuchtigkeit gesch&uuml;tzt. So
          l&auml;sst sich auch auf minderwertigem Papier, das f&uuml;r den
          Tintenstrahldruck nicht vorgesehen war, ein gut brauchbares Druckergebnis
          erzielen.</P>

          <P><FONT color="#ffff00"><B>7. Genauso wichtig - Tinte und
          Papier</B></FONT></P>

          <P>Ein Bild auf unterschiedlichen Papiersorten ist einmal leuchtend bunt
          und ein anderes mal farbschwach und matt. Text ist mitunter grau und
          verschwommen, anstatt gestochen scharf. Die Ursache ist schnell gefunden,
          -manches Papier saugt bis zu achtzig Prozent der aufgetragenen Tinte in die
          Tiefe des Blattes. Die Farbe wirkt f&uuml;r den Betrachter umso matter, je
          tiefer die Tinte in das Blatt eindringt. Wir haben bereits pigmentierte
          Tinte kennen gelernt. Die Farbpigmente solcher Tinten bleiben auf der
          Oberfl&auml;che des Blattes h&auml;ngen. Die erw&auml;hnte zus&auml;tzliche
          Fixierung ist dann noch eine weitere Ma&szlig;nahme, um die Farbstoffe an
          der Oberfl&auml;che zu halten. Man sollte je nach Druckermodell ruhig
          mehrere Papiersorten f&uuml;r den allgemeinen t&auml;glichen Ausdruck
          probieren, um das richtige Druckpapier zu finden. F&uuml;r echte und
          brillante Fotoausdrucke eignen sich hingegen gesonderte Fotopapiere und
          Glossyfolien. Um die Fotoausdrucke gegen das Ausbleichen durch UV-Licht und
          andere Einfl&uuml;sse zu sch&uuml;tzen, werden besondere Fixiersprays im
          Fachhandel angeboten. Solche Sprays verteuern die ohnehin schon hohen
          Druckkosten abermals. Ein kleiner Tipp - versucht es einfach einmal mit
          Haarspray, welches gleiche Wirkungen erzielt, aber selbstverst&auml;ndlich
          bei weitem g&uuml;nstiger zu bekommen ist.</P>

          <P>Problematisch ist Papier aber auch, wenn es nur begrenzt
          Fl&uuml;ssigkeit aufnehmen kann. Die Tropfen breiten sich entlang der
          Papierfasern aus, nebeneinander liegende Tropfen verlaufen.
          Schlie&szlig;lich wellt sich das Papier durch zu viel aufgetragene Tinte
          und wird auch nach der Trocknung nicht mehr v&ouml;llig glatt. Hier haben
          die Tintenhersteller in den letzten Jahren viel an ihren Produkten
          gearbeitet. Besonders schnell trocknende Tinten kommen zum Einsatz. Bei
          einer guten Tinte kommt der Ausdruck bereits v&ouml;llig trocken aus dem
          Drucker. Spezielle und besonders glatte Druckpapiersorten verbessern die
          Druckqualit&auml;t ein weiteres mal. Es wird genug Farbe an der
          Oberfl&auml;che gehalten, um ein satt-leuchtendes Druckbild zu geben,
          w&auml;hrend &uuml;bersch&uuml;ssige Tinte schnell aufgesaugt wird, damit
          nichts mehr verl&auml;uft und der Druck schnellstm&ouml;glich trocken ist.
          Dann ist der optimale Ausdruck erreicht. Es muss also alles stimmen - der
          Drucker, die verwendete Tinte und die eingelegte Papiersorte.</P>

          <P><FONT color="#ffff00"><B>8. Der Kapmf um die
          Langlebigkeit</B></FONT></P>

          <P>Nicht zuletzt ist auch die Best&auml;ndigkeit der Farben ein Kriterium
          f&uuml;r die Druckqualit&auml;t. Die einzelnen Farben ver&auml;ndern sich
          abh&auml;ngig von einwirkendem UV-Licht, Lagerungs-Temperatur,
          Feuchtigkeit, Ozongehalt und Sauerstoffgehalt. Der Ausdruck verblasst je
          nach Intensit&auml;t dieser Faktoren schnell oder sehr langsam. Lange Zeit
          wurde das Thema Best&auml;ndigkeit von den Druckerherstellern
          stiefm&uuml;tterlich behandelt. In j&uuml;ngster Zeit setzen die Hersteller
          jedoch vermehrt auf Tintenrezepturen, die eine l&auml;ngere
          Best&auml;ndigkeit garantieren sollen.</P>

          <P><FONT color="#ffff00"><B>9. Kompatibel oder nicht?</B></FONT></P>

          <P>Ganz allgemein ging lange Zeit das Ger&uuml;cht umher, das kompatible
          Tintenpatronen anderer Hersteller eine schlechtere Druckqualit&auml;t
          erzeugen oder sogar die Druckk&ouml;pfe des Druckers zerst&ouml;ren.
          Besonders beim Druckerhersteller Epson gab es hier vor einigen Jahren
          gravierende Probleme, da Epson aufgrund seiner verwendeten
          Piezo-Drucktechnologie kleinste Ferrorpartikel seinen Tinten beimischt. Von
          einigen schwarzen Schafen unter den Tintenherstellern wurden diese Tinten
          nur mit minderer Qualit&auml;t hergestellt. Die kleinen Eisenpartikel waren
          unterschiedlich gro&szlig; und verstopften so manches mal die
          Druckd&uuml;sen. Da Epson jedoch seine Druckk&ouml;pfe f&uuml;r die
          Ewigkeit mit dem Drucker fest verbaut hat, blieb dem Anwender nichts
          anderes &uuml;brig, als den Drucker komplett zu entsorgen. In vielen
          F&auml;llen erlosch durch die Sparma&szlig;nahme bei der verwendeten Tinte
          die Garantie. Die gut gemeinte Sparsamkeit kam den Anwender teuer zu
          stehen. Mittlerweile hat sich der Markt recht gut entwickelt und
          minderwertige Tinten werden nur noch sehr selten bis gar nicht mehr
          entdeckt. Mittlerweile kann man relativ beruhigt zu anderen
          Tintenherstellern greifen und oftmals viel Geld sparen. &Uuml;brigens -
          allein aus diesem Grund sind einige Druckermodelle derart g&uuml;nstig im
          Handel zu bekommen. Der Druckerhersteller hofft auf den anschliessenden
          Absatz der teureren Tintenpatronen und den dadurch eintretenden Gewinn.
          Manche Extremf&auml;lle, wie beispielsweise bei den preisg&uuml;nstigsten
          Druckermodellen des Herstellers "Lexmark" fallen dem Anwender erst beim
          Kauf der ersten separaten Druckpatrone die Pl&auml;ne der Hersteller auf,
          wo dann der Preis einer Tintenpatrone sehr nahe am Neupreis des kompletten
          Druckers liegt.</P>

          <P>Es gibt aber auch zwei sehr gro&szlig;e europ&auml;ische Hersteller, die
          zum Teil Tinten f&uuml;r die verschiedenen Druckerhersteller produzieren
          und gleichfalls dieselbe Tinte unter eigenem Logo anbieten. Hier kann man
          also durchaus bei gleicher Qualit&auml;t eine Menge Geld sparen - bis zu
          75% niedrigere Preise f&uuml;r dieselbe Patrone in anderer Verpackung sind
          m&ouml;glich.</P>

          <P>Und das soll es auch schon f&uuml;r unseren zweiten Teil des
          Drucker-Workshops gewesen sein. Im dritten und letzten Teil, den Ihr hier
          in der n&auml;chsten NoCover finden k&ouml;nnt, werden wir uns die
          unterschiedlichen Drucktechniken der f&uuml;hrenden Druckerhersteller
          ansehen und auf Vor- und Nachteile eingehen. Also bis zum n&auml;chsten mal
          und stets einen guten Ausdruck w&uuml;nscht Euch</P>

          <P>HIGGINS<BR>
          
          Cord Hagen </P>
           
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

