<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Rugmark-Sozial  </title>
</head>
<body background="wolf1.gif" text=black link=blue alink="red" vlink="blue"
bgcolor=gray>

<table width=100% border=0 cellpadding=8><tr><td>
<div align="center"><center>

<table border="0" cellspacing="0" width="580" background="onl_rugmark0.jpg"
bgcolor="#d04040" height="120">
<tr>
<td align="center" width="100%" valign="middle"><img src="onl_rugmarka.gif"
alt="logo.gif (3670 byte)" height="101" width="100" align="middle"><img
src="onl_rugmarkc.gif" width="58" height="51" align="middle"><img
src="onl_rugmarkb.gif" alt="dslogan.gif (6027 byte)" height="95" width="260"
align="middle"></td>
</tr>
</table>
</center></div>
<p>&nbsp;</p>
<div align="center"><center>

<table border="0" cellspacing="1" width="580">
<tr>
<td><h2></a><font face="Courier">Was geschieht mit dem Geld?</font></h2>
<p><br> RUGMARK ist kein Selbstzweck: Die Kontrollen allein w&auml;ren
deshalb wenig sinnvoll, wenn f&uuml;r die betroffenen Kinder keine
Alternativen zur Arbeit an den Kn&uuml;pfst&uuml;hlen geschaffen
w&uuml;rden. Die einzig wirksame Hilfe f&uuml;r ehemalige Kinderarbeiter
sowie Kinder aus Kn&uuml;pferfamilien besteht in Schulbesuch und
beruflicher Ausbildung. Denn eine gute Grundbildung und berufliche
(Vor-)Kenntnisse verbessern die Zukunftsaussichten der Kinder und ihrer
Familien.</p>

<p><img src="onl_rugmark4.jpg" width="260" height="173" alt="Foto4.jpg
(6655 Byte)" align="right" hspace="8" vspace="4">Aus der Importabgabe auf
RUGMARK- Teppiche werden deshalb in erster Linie Schulen und
Ausbildungsst&auml;tten sowie Rehabilitationszentren und Übergangsheime in
den Kn&uuml;pfregionen finanziert. Dort lernen die Kinder lesen, schreiben
und rechnen und verbessern damit ihre Chancen auf eine Berufsausbildung.
Viele von ihnen k&ouml;nnen au&szlig;erdem zum ersten Mal in ihrem Leben
spielen und Sport treiben. Die RUGMARK-Einrichtungen vermitteln zudem
Grundkenntnisse in der Gesundheitsvorsorge.</p>

<p>Von RUGMARK oder in Zusammenarbeit mit RUGMARK betriebene Schulen und
Programme: </p>

<p><b>in Indien</b>: </p>

<p>insgesamt vier RUGMARK Primary Schools in Jagapur, Barhi Newada, Handia
und Baribisa f&uuml;r &uuml;ber 1.000 Kinder aus Kn&uuml;pferfamilien und
das RUGMARK Rehabilitationszentrum Balashrya in Gopiganj f&uuml;r bis zu
100 befreite Kinderarbeiter.</p>

<p>Die Jagapur Primary School beispielsweise wurde am 23. August 1996 als
erste RUGMARK-Schule er&ouml;ffnet. Sie bietet 250 Kindern im Alter von
sechs bis zehn Jahren Platz. Sechs Lehrerinnen und Lehrer erteilen
Basisunterricht und f&uuml;hren die Kinder an praktische T&auml;tigkeiten
wie Zeichnen und N&auml;hen sowie Sport und Spiel heran. An der Newada
Primary School k&ouml;nnen abends auch Eltern lesen und schreiben
lernen.</p>

<p>Im RUGMARK Rehabilitationszentrum Balashrya erhalten ehemalige
Kinderarbeiter zun&auml;chst eine spezielle Betreuung, um ihre Erlebnisse
zu verarbeiten. Denn die Entfernung von den Eltern, der Mangel an Zuwendung
und F&uuml;rsorge und auch der lange Arbeitsalltag haben die Kinder
psychisch und physisch schwer belastet. Durch medizinische Betreuung,
Spiel, Sport, Schulunterricht und berufliche Ausbildung erhalten sie
Perspektiven f&uuml;r ein anderes, besseres Leben. </p>

<p><img src="onl_rugmark5.jpg" width="180" height="212" alt="Foto12.jpg
(14578 Byte)" align="left" hspace="8" vspace="4"><strong>in Nepal:
</strong></p>

<p>insgesamt vier Rehabilitationszentren f&uuml;r 200 Kinder und ein
Übergangswohnheim (ein sog. &quot;Transit-Home&quot;).</p>

<p>Alle Rehabilitationszentren in Nepal (sie liegen s&auml;mtlich im
Kathmandu-Tal) betreibt RUGMARK in Zusammenarbeit mit anderen
Nichtregierungs- Organisationen. Im Transit-Home k&ouml;nnen aufgefundene
Kinderarbeiter zun&auml;chst &uuml;bergangsweise bleiben. W&auml;hrend
dieses Aufenthaltes wird auch die M&ouml;glichkeit gepr&uuml;ft, ob die
Kinder wieder in ihre Familien zur&uuml;ckkehren k&ouml;nnen. F&uuml;r
bislang &uuml;ber 150 Jungen und M&auml;dchen ergab sich diese Chance. </p>

<p>In Indien wie in Nepal f&uuml;hren die &ouml;rtlichen Partner der
Tr&auml;gerorganisationen von RUGMARK Deutschland weitere Projekte durch,
die auf &auml;hnliche Weise dazu beitragen, Kinderarbeit zu
&uuml;berwinden. </p></td>
</tr>
<tr>
<td align=center><a href="onl_rugmark5.html">
<img src="onl_rugmark1.gif" width="41" height="28" border=0></a>
<a href="onl_rugmark7.html">
<img src="onl_rugmark3.gif" width="41" height="28" border=0></a>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
<a href="onl_rugmark.html"><img src="onl_rugmark0.gif" width="60" height="63" border=0></a>
<font face="Courier"><strong><a href="onl_rugmark.html">Startseite</strong></font></a></td>
</tr>
</table>
</center></div>
</tr></table>
</center></div>
</body>
</html>
