<HTML>
<HEAD>
<TITLE>Alien Breed 3D II - low-end n&auml;k&ouml;kulma</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Alien Breed 3D II - low-end n&auml;k&ouml;kulma</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR><BR>
  <FONT SIZE=3><B>Timo Siev&auml;nen</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>T</FONT><FONT SIZE=3>
&auml;m&auml;n vuoden kohutuimmaksi (Amiga-)peliksi j&auml;&auml;nee Alien Breed 3D II eli The Killing Grounds. Se on my&ouml;s mielest&auml;ni ensimm&auml;inen peli, joka todella vaatii poikkeuksellista tehoa koneelta ollakseen nautittavimmillaan. Esim. Xtreme Racing kyll&auml; hy&ouml;tyy 68040- tai 68060-prosessorista, mutta pelih&auml;n on melkein samann&auml;k&ouml;inen (maallikosta) puolet heikommalla tarkkuudella! TKG:n gouraud-valoefektit taas suorastaan vaativat 1x1-tarkkuuden, jonka toki saaneekin jo yleistyneell&auml; Blizzardin 1230-kortilla tai vastaavalla pelattavaksi - nelj&auml;nnesruudulla. Linkkipeli on viel&auml; hitaampi, varsinkin jos molemmat pelaajat p&auml;&auml;tt&auml;v&auml;t kymmenest&auml; aseesta valita juuri raketinheittimen...<BR><BR>
Omalla koneellani k&auml;yt&auml;n mieluiten puolet heikompaa pystytarkkuutta (1x2-tila), ja efektit k&auml;rsiv&auml;t selv&auml;sti, vaikkakaan eiv&auml;t TV:n ruudulla varmaankaan samalla tavalla kuin multisync-monitorilla. Silti peli on upea, en koskaan kadu ostostani. Mutta perus-A1200:lla tai pelk&auml;n lis&auml;muistin avulla peli ei tarjoa k&auml;yt&auml;nn&ouml;ss&auml; kuin 16 uutta tasoa verrattuna ensimm&auml;iseen 3D:hen. Pelk&auml;ll&auml; CHIP-muistilla tasoeditorikaan ei toimi. P&auml;ivitys on tulossa, jotta tasoeditorin kaikki osat toimisivat edes niiss&auml; koneissa, joissa muistia on. Itsell&auml;ni on mielest&auml;ni kone, jolla voi juuri ja juuri ajatella pelaavansa TKG:t&auml; (4 Mt:n versio). Jonkun mielest&auml; varmasti 14 MHz:n koneellakin voi, jos on muistia ja sama resoluutio kuin edellisess&auml; Breediss&auml;. 2 Mt:n versiossa ei ole mm. lattiassa ja katossa tekstuuria, eik&auml; aseita n&auml;e edess&auml;&auml;n niit&auml; k&auml;ytett&auml;ess&auml;. Silti sekin on suhteellisen hidas.<BR><BR>
TKG vaatii my&ouml;s pelaajalta enemm&auml;n. Uusia liikkeit&auml;kin on, kuten hyppy sek&auml; yl&ouml;s- ja alasp&auml;in katselu. N&auml;m&auml; ovat vaikeutuksista pienimm&auml;t, sill&auml; teko&auml;ly on jo sill&auml; asteella, ett&auml; sit&auml; kehtaa koska vain teko&auml;lyksi nimitt&auml;&auml;. Yksinkertaisimmillaan viholliset seuraavat pelaajaa, joten tykinruokaa ei voi yleens&auml; en&auml;&auml; k&auml;rsiv&auml;llisesti odottaa kulman takaa. Vihollisia ei ole ainakaan harvemmassa kuin ennen, joten jo toinen taso on paljon hankalampi kuin useimmat AB3D-tasot. Koska hyppy&auml; k&auml;ytet&auml;&auml;n pitkien loikkien tekemiseen kesken juoksun, on peliss&auml; inertia, joka k&auml;yt&auml;nn&ouml;ss&auml; est&auml;&auml; ripe&auml;t suunnanvaihdokset AB3D:n tapaan; kaikki t&auml;m&auml; vaatinee hieman totuttelua, vaikka pelin idea muuten olisikin tuttu viimevuotisesta hitist&auml;. Onneksi t&auml;ss&auml;kin Breediss&auml; saa itse valita kaikki toiminton&auml;pp&auml;imet (ehk&auml; pelin keskeytyst&auml;/pausea lukuunottamatta), joten Gloom- tai Fears-pelaaja saa tutut n&auml;pp&auml;imet lohduttamaan saadessaan turpaan...<BR><BR>
Karttakin l&ouml;ytyy, ja sen saa HUD:n tapaan keskelle ruutua vaikka kutistettuna, jolloin se peitt&auml;&auml; kuitenkin melkein yht&auml; suuren kuva-alan kuin normaalisti, koska viivat paksunevat. Kartta on siis er&auml;&auml;nlainen vektorigrafiikkaesitys, paitsi 2 Mt:n versiossa (joka siis tulee samassa paketissa eri disketill&auml;), jossa se on aivan oma ruutunsa. Odotettavissa karmeita sokkeloita? Mutta yksi odotetuista ominaisuuksista onkin tasoeditori, jolla jokainen voi tehd&auml; oman painajaisensa, jos intoa riitt&auml;&auml;. Tasoeditoriin en ole kummemmin perehtynyt, mutta luin dokumentit l&auml;pi, ja jokainen voi melko selkeill&auml; AMOS-ohjelmilla m&auml;&auml;ritell&auml; k&auml;yt&auml;nn&ouml;llisesti katsoen kaikki ne muuttujat, joita Team 17:kin k&auml;ytti, jopa enemm&auml;n!<BR><BR>
&Auml;&auml;nimaailma on hyv&auml;, ykk&ouml;sess&auml; oli 28 samplea, t&auml;ss&auml; 51. Osa &auml;&auml;nist&auml; on vanhoja, kuten karkea 'scream'. 8 kHz:n taajuus, jolla jo edellisen Breedin p&auml;ivitysversioon saatiin 8-kanavainen &auml;&auml;ni, ei aina riit&auml;. Suuri osa &auml;&auml;nist&auml; on kuitenkin matalia kolahduksia ja j&auml;nnityst&auml; luovia mit&auml; kummallisimpia rutinoita. Kaikki samat &auml;&auml;net ovat tosin kaksinpeliss&auml;kin mukana, mik&auml; on joskus v&auml;h&auml;n h&auml;mment&auml;v&auml;&auml;. Kaikesta huolimatta yksi onnistuneimmista &auml;&auml;nimaailmoista, mihin olen peleiss&auml; t&ouml;rm&auml;nnyt. Musiikkiakin on, esim. remix AB3D:n tappiomusiikista.<BR><BR>
TKG:ssa on linkkipeli (mik&auml; jo selvisikin), ja muutenkin se on aika paljon samantapainen kuin Alien Breed 3D teknisesti, mutta peliss&auml; on esim. alkuintro (outrokin?), ja pelitilanteen voi tallentaa, tietysti vasta tason l&auml;p&auml;isyn j&auml;lkeen. Pelin ensimm&auml;isiss&auml; tasoissa ei ainakaan ollut en&auml;&auml; teleportteja, taso voi p&auml;&auml;tty&auml; melkeinp&auml; &auml;kkiarvaamatta. Mutta vihjeit&auml; kyll&auml; jaellaan... Vektoriobjektejakin l&ouml;ytyy yh&auml; - vain huimasti hienompia. Demoversioissa esiintynyt huono "saumoitus" eli seinien ajoittainen vilkkuminen on ilmeisesti korjattu. Kuten arvelin, lopetustakaan ei ole, eik&auml; mit&auml;&auml;n takeita pelin toimivuudesta viel&auml; ilmestym&auml;tt&ouml;miss&auml; tai edes ECS-Amigoissa ole.<BR><BR>
Pelipaketin tunnistaa kaupassa jo kaukaa, kun tiet&auml;&auml;, ett&auml; sit&auml; k&auml;ytettiin ainakin j&auml;lkimm&auml;isess&auml; demossa valikkoruudussa (my&ouml;s pelin 2 Mt:n versiossa). Hm, Death Maskissa on ELSPA-tarra 18 v. yl&ouml;sp&auml;in, TKG:ss&auml; 11 v. Kyll&auml; hurme silti roiskuu, mutta taistelusta ei j&auml;&auml; mit&auml;&auml;n j&auml;lki&auml; ymp&auml;rist&ouml;&ouml;n, ei ruumiita eik&auml; tahroja. Tosin j&auml;ttim&auml;isess&auml; avaruusaluksessa, jonne ainakin pelin alku sijoittuu, on kovin h&auml;m&auml;r&auml;&auml;, joten j&auml;lkimm&auml;isi&auml; ei kuitenkaan yleens&auml; huomaisi.<BR><BR>
Selke&auml;sti vuoden 1996 3D-r&auml;iskint&auml;-kauhu-seikkailupeli (mukaanlukien ja samalla unohtaen muut, v&auml;h&auml;p&auml;t&ouml;iset konemerkit). Jos CPU kest&auml;&auml;.<BR><BR>

<TABLE WIDTH=100% BORDER=0>
<TR>
    <TD WIDTH=25%><CODE><B>Saatavissa:</B></CODE></TD>
    <TD WIDTH=75%><CODE>Amiga AGA, esim. Triosoftista, (03) 2130292</CODE></TD>
</TR>
<TR>
    <TD><B><CODE>Tekij&auml;:</CODE></B></TD>
    <TD><CODE>Team 17</CODE></TD>
<TR>
    <TD><B><CODE>Julkaisija:</CODE></B></TD>
    <TD><CODE>Ocean</CODE></TD>
</TR>
<TR>
    <TD><B><CODE>Pelaajia:</CODE></B></TD>
    <TD><CODE>1 tai 2</CODE></TD>
</TR>
<TR>
    <TD><B><CODE>Suositusik&auml;raja:</CODE></B></TD>
    <TD><CODE>11 v. (ELSPA)</CODE></TD>
</TR>
<TR>
    <TD><B><CODE>Grafiikka:</CODE></B></TD>
    <TD><CODE>93%</CODE></TD>
</TR>
<TR>
    <TD><B><CODE>&Auml;&auml;net:</CODE></B></TD>
    <TD><CODE>88%</CODE></TD>
</TR>
<TR>
    <TD><B><CODE>Pelattavuus:</CODE></B></TD>
    <TD><CODE>92%</CODE></TD>
</TR>
<TR>
    <TD><B><CODE>Yleisarvosana:</CODE></B></TD>
    <TD><CODE>90%</CODE></TD>
</TR>
<TR>
    <TD><B><CODE>Testikone:</CODE></B></TD>
    <TD><CODE>Amiga 1200, kiintolevy ja Blizzard 1220/28 Mhz</CODE></TD>
</TR>
</TABLE>
</FONT>
<BR>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
