<HTML>
<HEAD>
<TITLE>Elina</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Elina</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Sami Klemola</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>M</FONT><FONT SIZE=3>
in&auml; olen tehnyt periaatep&auml;&auml;t&ouml;ksen, etten kirjoita omista ohjelmistani, koska olen mielest&auml;ni j&auml;&auml;vi tekem&auml;&auml;n niin. Nyt tilanne kuitenkin on sellainen, ett&auml; koska p&auml;&auml;toimittaja laittoi Sakuun #19 ep&auml;m&auml;&auml;r&auml;isen mainokseni Elinasta, olen pakotettu kirjoittamaan siit&auml;, koska tuo mainos, jota en koskaan lehteen tarkoittanut, todenn&auml;k&ouml;isesti kehitti enemm&auml;n uusia kysymyksi&auml; kuin joihin se vastasi. Niinp&auml; teen nyt sitten poikkeuksen ja esittelen oman Elina-ohjelmani t&auml;ss&auml; artikkelissa.<BR><BR>

</FONT><FONT SIZE=4><B>Viestien et&auml;luku</B></FONT><BR><BR>
<FONT SIZE=5>B</FONT><FONT SIZE=3>
oksisoftien perustoimintoihin kuuluu viestij&auml;rjestelm&auml;. Voit kirjoittaa julkisia tai yksityisi&auml; viestej&auml; toisille BBS:n k&auml;ytt&auml;jille tai muiden BBS:ien k&auml;ytt&auml;jille, jos BBS:t ovat kesken&auml;&auml;n verkossa. Voit lukea viestej&auml; linjalla, ts. k&auml;yt&auml;t boksisoftan lukutoimintoja p&auml;&auml;teohjelman avulla. Se kuitenkin maksaa paljon, koska yhteyden pit&auml;&auml; olla koko ajan p&auml;&auml;ll&auml;. Nyky&auml;&auml;n kaikki varteen otettavat boksisoftat tarjoavatkin mahdollisuuden viestien et&auml;lukuun.<BR><BR>
Et&auml;luku tarkoittaa sit&auml;, ett&auml; valitset ensin boksissa, mit&auml; viestialueita haluat seurata, ja sen j&auml;lkeen voit aina pakata niille tulleet uudet viestit imaistavaksi kerralla kompressoidussa paketissa. Voit sitten lukea viestej&auml; kaikessa rauhassa omalla koneellasi et&auml;lukuohjelmalla ilman, ett&auml; yhteyden tarvitsee olla p&auml;&auml;ll&auml;. Voit my&ouml;s kirjoittaa omia viestej&auml; ja vastailla muiden kirjoittamiin viesteihin. Vastaukset pakataan vastaavasti, ja voit l&auml;hett&auml;&auml; ne, kun seuraavalla kerralla otat yhteyden boksiin.<BR><BR>
Lis&auml;&auml; tietoa kunkin boksin et&auml;lukuj&auml;rjestelm&auml;n k&auml;ytt&auml;misest&auml; saat boksin k&auml;ytt&ouml;ohjeista (esim. <CODE><B>SFL.guide</B></CODE>) tai boksin sysopilta (joissakin bokseissa). Perinteisesti viestit luetaan pakettiperustaisesti, eli voit lukea kerralla yhden paketin viestej&auml;. Elina l&auml;hestyy asiaa uudella tavalla. Sen sijaan, ett&auml; viestit n&auml;ytett&auml;isiin paketista, Elina siirt&auml;&auml; ne ensin paketista omaan viestikantaansa, josta voit ne sitten lukea.<BR><BR>
Viestit s&auml;ilyv&auml;t Elinan viestikannassa niin kauan kuin haluat, etk&auml; ole sidottu pakettirajoihin. Voit j&auml;tt&auml;&auml; vaikkapa lukematta jonkin alueen ja lukea sitten kerralla sen viestit useasta paketista ilman paketinvaihtoja. Voit my&ouml;s etsi&auml; helposti viesti&auml;. Se l&ouml;ytyy kerralla, eik&auml; tarvitse mietti&auml;, ett&auml; miss&auml;h&auml;n paketissa se mahtaa olla, puhumattakaan hirvitt&auml;v&auml;st&auml; pakettienavailurumbasta ennen kuin viesti l&ouml;ytyy.<BR><BR>

</FONT><FONT SIZE=4><B>Esittely</B></FONT><BR><BR>
<FONT SIZE=5>E</FONT><FONT SIZE=3>
lina on toiminnaltaan enemm&auml;n nk. pointtisoftan kuin perinteisen et&auml;lukijan tapainen. Pointtisoftana sit&auml; ei kuitenkaan voi viel&auml; k&auml;ytt&auml;&auml;, koska se ei ota vastaan viestej&auml; suoraan Fidonet-verkkoformaatissa. Mik&auml;&auml;n asiahan ei tietokonemaailmassa ole yksinkertainen. Niinp&auml; viestej&auml;kin saa et&auml;lukua varten monenlaisessa muodossa, eiv&auml;tk&auml; mitk&auml;&auml;n tavat tietenk&auml;&auml;n ole kesken&auml;&auml;n alkuunkaan yhteensopivia. Elina tukee kahta muotoa, WWF:&auml; ja OMENia.<BR><BR>
Useimmat Amigan boksisoftat osaavat tuottaa WWF-paketteja, useimmat PC:n boksisoftat taas OMEN-paketteja. N&auml;iden kahden formaatin tuella pystyt&auml;&auml;n lukemaan paketteja yli 90 prosentista bokseja. Vain todella harvat softat tekev&auml;t vain esimerkiksi nk. BlueWave-paketteja. T&auml;m&auml; tosin koskee Suomessa k&auml;ytett&auml;vi&auml; boksisoftia. Ulkomailla sek&auml; WWF ett&auml; OMEN ovat melko harvinaisia, kummatkin n&auml;et ovat suomalaista alkuper&auml;&auml;.<BR><BR>
Elina tukee nelj&auml;&auml; pakkeria. Viestipaketti voi olla pakattu LhA:lla, LZX:ll&auml;, ZIP:ll&auml; tai ARC:lla. My&ouml;s vastaukset voidaan pakata mill&auml; tahansa n&auml;ist&auml;, eik&auml; sen tarvitse olla sama. Pakkausta voi my&ouml;s vaihtaa milloin vain. Lis&auml;ksi on k&auml;ytett&auml;viss&auml; automaatti, jolloin Elina tunnistaa, mit&auml; pakkausta on k&auml;ytetty ja purkaa paketin oikealla ohjelmalla. Lis&auml;ksi se laittaa tiedon muistiin ja pakkaa lopuksi vastauksesi samalla pakkerilla!<BR><BR>
Elina tukee my&ouml;s nelj&auml;&auml; merkist&ouml;&auml;. Amigan ISO-merkist&ouml;n lis&auml;ksi on tuki IBM-yhteensopivien PC8-merkist&ouml;lle, vanhalle skandinaaviselle 7-bittiselle SF7-merkist&ouml;lle sek&auml; Apple MacIntoshin erikoiselle merkist&ouml;lle. Viestit konvertoidaan niit&auml; siirrett&auml;ess&auml; boksin ja Elinan v&auml;lill&auml;, mutta voit konvertoida my&ouml;s yksitt&auml;isi&auml; v&auml;&auml;r&auml;ll&auml; merkist&ouml;ll&auml; tulleita viestej&auml;, kun ne ovat jo viestikannassa!<BR><BR>
PC8-merkist&ouml;ll&auml; tulee silloin t&auml;ll&ouml;in viestej&auml;, eik&auml; niihin voi oikein vastata, kun skandinaavisten merkkien tilalla on mm. ohjauskoodeja. Konvertointi on kuitenkin helppoa, mutta vain Elina osaa sen. Lis&auml;ksi viestin voi tallentaa viestikantaan v&auml;&auml;r&auml;ll&auml; merkist&ouml;ll&auml; olevan kappaleen p&auml;&auml;lle. Viestikantahan on eritt&auml;in k&auml;tev&auml; niille, jotka s&auml;ilytt&auml;v&auml;t viestit. Monet ihmiset taltioivat viestipakettinsa, mutta se on v&auml;h&auml;n ep&auml;k&auml;yt&auml;nn&ouml;llist&auml;. Elina pit&auml;&auml; vanhat viestit siististi j&auml;rjestyksess&auml; ja voit lukea niit&auml; helposti koska vain.<BR><BR>

</FONT><FONT SIZE=4><B>Elinan k&auml;ytt&ouml; ja toiminnot</B></FONT><BR><BR>
<FONT SIZE=5>K</FONT><FONT SIZE=3>
un olet importoinut ensimm&auml;isen viestipaketin eli siirt&auml;nyt sen viestit Elinan viestikantaan, voit aloittaa niiden lukemisen. Ensimm&auml;iseksi Elina tarjoaa sinulle mahdollisuutta lukea eri alueilta kaikki sinulle osoitetut viestit. Sitten n&auml;et luettelon kaikista alueista ja tiedot niille tulleista uusista viesteist&auml;. T&auml;m&auml;n j&auml;lkeen voit aloittaa kaikkien viestien lukemisen joko ensimm&auml;isest&auml; alueesta tai valintasi mukaisesta alueesta.<BR><BR>
Lukuohjelma on t&auml;ysin tekstiperustainen. Sit&auml; asiaa olen joutunut jo lukuisasti puolustelemaan. Olen sit&auml; mielt&auml;, ett&auml; kun k&auml;sitell&auml;&auml;n teksti&auml;, ei ole v&auml;ltt&auml;m&auml;tt&auml; perusteltua tehd&auml; graafista k&auml;ytt&ouml;liittym&auml;&auml;. Kuitenkin suurin osa n&auml;yt&ouml;st&auml; koostuu tekstist&auml;. Itse pid&auml;n juuri viestej&auml; lukiessa enemm&auml;n n&auml;pp&auml;imist&ouml;lt&auml; annettavista komennoista. Joka tapauksessa joutuu k&auml;ytt&auml;m&auml;&auml;n n&auml;pp&auml;imist&ouml;&auml; kirjoitellessaan viestej&auml;.<BR><BR>
Graafinen k&auml;ytt&ouml;liittym&auml; sopii moniin ohjelmiin, mutta aivan joka paikkaan sit&auml;k&auml;&auml;n ei pid&auml; laittaa. Tekstiperustaisia ne ovat BBS:tkin. Elina toimii siis n&auml;pp&auml;imist&ouml;lt&auml; annettavilla komennoilla. Toiminta jakautuu kierroksiin. Kierros alkaa viestin n&auml;ytt&auml;misell&auml; ja p&auml;&auml;ttyy komennon antamiseen. Komento on tavallisimmin tyhj&auml; rivi eli pelkk&auml; return, jolloin siirryt&auml;&auml;n yksi viesti eteenp&auml;in ja seuraavalla kierroksella n&auml;ytet&auml;&auml;n seuraava viesti.<BR><BR>

</FONT><FONT SIZE=4><B>Peruskomennot ja perusnavigointi</B></FONT><BR><BR>
<FONT SIZE=5>J</FONT><FONT SIZE=3>
okaisen viestin n&auml;ytt&auml;misen j&auml;lkeen voi siis antaa komennon. Varsinaisista komennoista yksinkertaisimpia ovat navigointikomennot, jotka n&auml;ytt&auml;v&auml;t saman tai edellisen viestin uudelleen, alkuper&auml;isen viestin tai ensimm&auml;isen tai seuraavan vastauksen. Alkuper&auml;inen viesti on se, johon sill&auml; hetkell&auml; n&auml;ytett&auml;v&auml; viesti on vastaus. Voit katsoa siit&auml; paremmin, mist&auml; on kysymys, jos se ei kunnolla k&auml;y viestist&auml; ilmi.<BR><BR>
Alkuper&auml;inen viestih&auml;n on luettavissa viestikannassa, vaikka se olisi kirjoitettu pari viikkoa aiemmin. Perinteist&auml; et&auml;lukijaa k&auml;ytett&auml;ess&auml; alkuper&auml;isen viestin katsominen on yleens&auml; mahdotonta, koska se ei ole samassa paketissa. Todella harvassa perinteisess&auml; et&auml;lukijassa edes on t&auml;t&auml; toimintoa. Lis&auml;ksi on mahdollista katsoa suoraan vastaus nykyiseen viestiin, jos sellainen on olemassa.<BR><BR>
Edelleen, jos sill&auml; hetkell&auml; n&auml;ytett&auml;v&auml; viesti on vastaus aiempaan viestiin, voit katsoa suoraan seuraavan vastauksen samaan viestiin. Voit my&ouml;s menn&auml; taaksep&auml;in ja katsoa edellisen vastauksen siihen. Voit siis liikkua nk. viestiketjuissa niin sivuille kuin yl&ouml;s ja alaskin. T&auml;h&auml;n eiv&auml;t muut et&auml;lukijat pysty. Elinassa on viestiketjujen yll&auml;pidon ohella nk. dupecheck. Joskus verkoista tulee samoja viestej&auml; moneen kertaan. Boksien pit&auml;isi huolehtia siit&auml;, etteiv&auml;t ne p&auml;&auml;se loppuk&auml;ytt&auml;j&auml;lle saakka, mutta aina se ei ole mahdollista ja joskus se ei toimi, eik&auml; sysop siit&auml; edes v&auml;lit&auml;.<BR><BR>
Elina laskee jokaisesta viestist&auml; CRC:n eli tarkistusluvun ja tallentaa sen viestikantaan viestin mukana. Mik&auml;li dupecheck on sallittu, Elina vertaa jokaisen tulevan viestin CRC:t&auml; kaikkien samalla alueella jo olevien viestien vastaavaan. Mik&auml;li se on sama, viesti&auml; ei oteta sis&auml;&auml;n, koska se on kaksoiskappale. Varmuuden vuoksi Elina katsoo viel&auml; viestien pituuden, koska joskus kahden eri viestin CRC voi olla sama. Se on harvinainen mutta mahdollinen tilanne, jonka olen kerran kohdannutkin.<BR><BR>
Er&auml;&auml;n boksisoftan kanssa on ollut sellainen h&auml;ikk&auml;, ett&auml; se liitt&auml;&auml; kerralla l&auml;hetettyihin viesteihin saman MSGID-luvun. T&auml;m&auml; on ongelma. Boksisoftat k&auml;ytt&auml;v&auml;t viestien MSGID-lukua kaksoiskappaleiden tarkistamiseen. Koska eri viesteill&auml; on bugin seurauksena sama MSGID, boksisoftien dupechecki&auml; ei voi k&auml;ytt&auml;&auml; sen poistellessa aitoja viestej&auml;!<BR><BR>
T&auml;st&auml; seuraa se, ett&auml; my&ouml;s oikeat kaksoiskappaleet p&auml;&auml;sev&auml;t l&auml;pi. Siin&auml; auttaa Elinan dupecheck, koska se ei k&auml;yt&auml; MSGID-lukuja, vaan omaa CRC-tarkistustaan. Se on eritt&auml;in luotettava ja se auttaa my&ouml;s toisessa tilanteessa. Joillakin ihmisill&auml; kun on tapana laittaa samat viestit monta kertaa ep&auml;huomiossa tai tahallaan. Elinan dupecheck karsii my&ouml;s toiseen kertaan l&auml;hetetyt viestit, jotka eiv&auml;t MSGID-tarkistuksessa ilmene.<BR><BR>
Viesti n&auml;ytet&auml;&auml;n ruudulla kahdessa osassa. Ikkunan yl&auml;osassa n&auml;kyy viestin headeri ja p&auml;&auml;osan ruudusta t&auml;ytt&auml;&auml; viestin tekstiosa. Headerissa n&auml;kyv&auml;t viestin tiedot kuten sen l&auml;hett&auml;j&auml;, vastaanottaja, aihe ja kirjoitusaika. Elina n&auml;ytt&auml;&auml; kirjoitusp&auml;iv&auml;n, kellonajan sek&auml; viikonp&auml;iv&auml;n. Sit&auml; eiv&auml;t muut et&auml;lukijat n&auml;yt&auml;. Minulla on usein ollut tilanne, jossa on ollut avuksi, kiva tiet&auml;&auml; tai v&auml;ltt&auml;m&auml;t&ouml;nt&auml;, ett&auml; saan selville, min&auml; viikonp&auml;iv&auml;n&auml; viesti on kirjoitettu. Elinan kanssa sit&auml; ei tarvitse mietti&auml; ja laskea, vaan sen n&auml;kee aina viestin headerista.<BR><BR>

</FONT><FONT SIZE=4><B>Nodelistat ja viestiprosessori</B></FONT><BR><BR>
<FONT SIZE=5>E</FONT><FONT SIZE=3>
lina tukee Fidonet-nodelistoja ja osaa hy&ouml;dynt&auml;&auml; niit&auml; monella tavalla. Elina n&auml;ytt&auml;&auml; viestin headerissa my&ouml;s Origin-BBS:n, eli jos viesti on verkosta, headerissa n&auml;kyy sen boksin nimi ja paikkakunta, josta viesti on l&auml;hetetty, mik&auml;li k&auml;ytett&auml;viss&auml; on verkon nodelista eli luettelo verkon bokseista. Elina ottaa tiedon Origin-rivilt&auml;, mink&auml; j&auml;lkeen se poistaa sen. Viesteiss&auml; ei siis n&auml;ytet&auml; Origin-rivej&auml; eik&auml; mit&auml;&auml;n muitakaan boksisoftien lis&auml;yksi&auml;.<BR><BR>
Origin-rivi&auml; ei tarvita, koska Elina s&auml;ilytt&auml;&auml; viestien Origin-osoitteet headereissa. Kaikki nk. tearlinen (rivi joka alkaa "<CODE><B>---</B></CODE>") alapuolelta se mukaanluettuna poistetaan kaikista viesteist&auml;. Se selkeytt&auml;&auml; verkkoviestej&auml; huomattavasti, eik&auml; huomio kiinnity ep&auml;olennaiseen. Toiminnon saa kytketty&auml; pois, jos tarvitsee tai v&auml;ltt&auml;m&auml;tt&auml; haluaa n&auml;hd&auml; Origin-rivit. Elina poistaa viesteist&auml; my&ouml;s WWF-formaatissa alkuun tulevan turhan AREA-rivin, kaikki muut kontrollirivit sek&auml; tyhj&auml;t rivit alusta ja lopusta.<BR><BR>
Lis&auml;ksi importtereihin integroitu viestiprosessori lyhent&auml;&auml; rivej&auml; niin, ett&auml; ne eiv&auml;t mene sekaisin viesti&auml; lainattaessa omaan vastaukseen. Kehitt&auml;m&auml;ni viestiprosessori on ennenn&auml;kem&auml;tt&ouml;m&auml;n taitava. Se osaa "flowata" eli jatkaa kaikki rivit, my&ouml;s lainaukset. Muut et&auml;lukijat p&auml;tkiv&auml;t rivej&auml; ja tuloksena on katkenneita rivej&auml; tai lainauksia, joiden jokaisen rivin lopusta yksi sana pomppaa seuraavalle riville.<BR><BR>
Elinan kanssa niin ei k&auml;y. Sen viestiprosessori osaa ottaa lainattujen rivien alusta lainausmerkinn&auml;n ja luoda sen avulla tarpeen vaatiessa uuden lainausrivin, jonka alussa on t&auml;sm&auml;lleen oikea lainausmerkint&auml;. Eik&auml; t&auml;ss&auml; viel&auml; kaikki. Viestiprosessori vertaa edellisen rivin lainausmerkint&auml;&auml; seuraavan rivin lainausmerkint&auml;&auml;n ja jos se on sama, se yhdist&auml;&auml; rivit, eik&auml; yhden sanan lainausrivej&auml; synny!<BR><BR>
Nodelistaa voi hy&ouml;dynt&auml;&auml; muutenkin. Jos haluaa lis&auml;&auml; tietoa boksista, josta nykyinen viesti on l&auml;hetetty, saa n&auml;ht&auml;v&auml;kseen kaikki nodelistan tiedot siit&auml; eli nimen, paikkakunnan, sysopin, puhelinnumeron jne. N&auml;m&auml; tiedot saa my&ouml;s mist&auml; tahansa boksista sen verkko-osoitteella. Lis&auml;ksi, kun olet kirjoittamassa netmailia, Elina varmistaa kohdeosoitteen kertomalla sinulle kohdeboksin nimen ja paikkakunnan. N&auml;in saat varmuuden siit&auml;, ett&auml; netmailisi menee oikeaan paikkaan.<BR><BR>
Eik&auml; t&auml;ss&auml;k&auml;&auml;n viel&auml; kaikki. Elina pit&auml;&auml; kaikista viestien kirjoittajista ja saajista k&auml;ytt&auml;j&auml;tiedostoa. Siit&auml; saat statistiikkaa eli luettelon k&auml;ytt&auml;jist&auml; ja jokaisen k&auml;ytt&auml;j&auml;n kirjoittamien ja saamien viestien m&auml;&auml;r&auml;n. Lis&auml;ksi Elina pit&auml;&auml; k&auml;ytt&auml;j&auml;tiedostossa kaikkien osoitteet. Mik&auml;li kirjoitat netmailia jollekulle, jonka osoitetta et tied&auml;, paina vain returnia, niin Elina kertoo osoitteen sinulle. Edellytys on, ett&auml; vastaanottaja on joskus kirjoittanut viestin verkossa, ett&auml; Elina on saanut siit&auml; h&auml;nen osoitteensa.<BR><BR>
Voit my&ouml;s vastata julkiseen echomailiin eli verkosta tulleeseen viestiin helposti netmailina. Osoite menee aina automaattisesti oikein. Mik&auml;li se viestist&auml; jostakin syyst&auml; puuttuu, Elina ottaa sen k&auml;ytt&auml;j&auml;tiedostosta. Vaihdat vain viestin Netmail-alueelle. Aina kun kirjoitat viestin, voit j&auml;lkeenp&auml;in siirt&auml;&auml; sen toiselle alueelle ja vaihtaa vastaanottajaa tai aihetta. Uusin Elinan testiversio tukee Philip R. Zimmermanin maailmankuulua PGP-salausohjelmaa. Sit&auml; k&auml;ytt&auml;m&auml;ll&auml; voit my&ouml;s salata viestisi, sis&auml;llytt&auml;&auml; siihen bin&auml;&auml;risen tiedoston Radix-koodattuna sek&auml; pakata sen!<BR><BR>
Vastaanottopuolella Elina tunnistaa automaattisesti, jos viestiss&auml; on PGP-materiaalia eli siin&auml; on PGP-avain, PGP:ll&auml; koodattu tai pakattu tiedosto, tai se on salattu, ja antaa sen PGP-ohjelman k&auml;sitelt&auml;v&auml;ksi. Elina tukee my&ouml;s muutamaa ulkoista ohjelmaa. Voit sen kautta katsoa kellonajan, vapaan muistin ja levytilan m&auml;&auml;r&auml;n.<BR><BR>

</FONT><FONT SIZE=4><B>Viestien lukeminen ja erityistoiminnot</B></FONT><BR><BR>
<FONT SIZE=5>E</FONT><FONT SIZE=3>
lina k&auml;ytt&auml;&auml; luettujen viestien seuraamiseen nk. Highread-menetelm&auml;&auml;. Boksien viestij&auml;rjestelm&auml;t k&auml;ytt&auml;v&auml;t samaa menetelm&auml;&auml;. Elina siis muistaa viimeisen lukemasi viestin numeron kullakin viestialueella ja pit&auml;&auml; suurempinumeroisia viestej&auml; uusina viestein&auml;. Kun siirryt pois alueelta tai lopetat ohjelman ja palaat alueelle my&ouml;hemmin, lukeminen jatkuu siit&auml;, mihin se j&auml;i eli viimeksi luettua viesti&auml; seuraavasta viestist&auml;.<BR><BR>
Voit siis keskeytt&auml;&auml; lukemisen milloin tahansa ja jatkaa siit&auml; my&ouml;hemmin. Sinun ei tarvitse edes tallentaa vastauksiasi tms., vaan ne s&auml;ilyv&auml;t tallessa viestikannan yhteydess&auml;. Voit kirjoittaa vastauksia monessa otteessa ja tehd&auml; niist&auml; kerralla vastauspaketin. Lis&auml;ksi voit lis&auml;t&auml; vastauksia jo tehtyyn pakettiin. Eik&auml; t&auml;ss&auml; kaikki. Voit my&ouml;s muokata aiemmin kirjoittamiasi vastauksia. T&auml;h&auml;nk&auml;&auml;n eiv&auml;t muut et&auml;lukijat pysty.<BR><BR>
Milloin tahansa voit skannata alueet l&auml;pi eli katsoa luettelon alueista ja niiden viestim&auml;&auml;rist&auml;. Uusien viestien m&auml;&auml;r&auml;t k&auml;yv&auml;t my&ouml;s ilmi luettelosta. Voit milloin tahansa siirty&auml; mille tahansa muulle alueelle. Kun viestit loppuvat alueelta, jota luet, Elina kysyy sinulta seuraavaa aluetta. Jos painat vain returnia, Elina vie sinut seuraavalle alueelle, jolla on uusia viestej&auml;. Mik&auml;li olet viimeisell&auml; alueella, siirryt alkuun ensimm&auml;iselle alueelle, jolla on uusia viestej&auml;, jos niit&auml; en&auml;&auml; on.<BR><BR>
Voit milloin tahansa listata viestej&auml; nykyiselt&auml; alueelta. Listaus alkaa ensimm&auml;isest&auml; lukemattomasta viestist&auml; tai ensimm&auml;isest&auml; viestikannassa olevasta viestist&auml;, jos uusia ei alueella ole, ja p&auml;&auml;ttyy alueen viimeiseen viestiin, mik&auml;li et m&auml;&auml;rittele alkua ja loppua. Voit antaa vapaasti ensimm&auml;isen ja viimeisen viestin numeron. Listauksessa n&auml;et jokaisen viestin numeron, l&auml;hett&auml;j&auml;n, vastaanottajan ja aiheen.<BR><BR>
Voit listata kaikki viestit ja sen lis&auml;ksi my&ouml;s valikoiden. Valikoivalla listauksella voit listata esimerkiksi tietyn henkil&ouml;n l&auml;hett&auml;m&auml;t tai vastaanottamat viestit tai tietyn henkil&ouml;n tietylle henkil&ouml;lle l&auml;hett&auml;m&auml;t viestit. Lis&auml;ksi voit merkit&auml; ehdot t&auml;ytt&auml;v&auml;t viestit. Elinassa on hyv&auml;t merkint&auml;toiminnot. Voit merkit&auml; viestej&auml; l&auml;hett&auml;j&auml;n ja vastaanottajan mukaan sek&auml; my&ouml;s k&auml;sin.<BR><BR>
Lis&auml;ksi voit etsi&auml; viesteist&auml; asioita hakusanalla tai lauseenp&auml;tk&auml;ll&auml;. Elina merkitsee viestit, joista sana tai lauseen osa l&ouml;ytyy ja voit lukea ne kerralla milloin tahansa. Voit k&auml;ytt&auml;&auml; useita merkint&auml;tapoja samalla kertaa ja katsoa tulokset yhdess&auml;. Jos viesteiss&auml; on jotakin, jonka haluat s&auml;ilyv&auml;n viel&auml; sen j&auml;lkeen, kun poistat viestin viestikannasta, voit tallentaa tai tulostaa sen.<BR><BR>
Elinassa on runsaasti kaikenlaisia toimintoja, joista osa on automaattisia ja osa sinun toteutettavissasi. K&auml;ytett&auml;viss&auml;si on 44 komentoa, jotka suorittavat toinen toistaan k&auml;tev&auml;mpi&auml; ja hy&ouml;dyllisempi&auml; toimintoja. Niiden lis&auml;ksi ovat viel&auml; viestinkirjoitustoiminnot ja importterien ja exportterien toiminnot. Viestien lukeminen ei ole ollut n&auml;in helppoa ja k&auml;tev&auml;&auml; koskaan ennen!<BR><BR>

</FONT><FONT SIZE=4><B>Loppusanat</B></FONT><BR><BR>
<FONT SIZE=5>J</FONT><FONT SIZE=3>
ollen viel&auml;k&auml;&auml;n saanut sinua vakuuttuneeksi, ett&auml; Elina on maailman kaikkien aikojen paras et&auml;lukuohjelmisto, kerron viel&auml;, ett&auml; se on freewarea eli sen k&auml;ytt&auml;minen on ilmaista. Olen my&ouml;s luvannut, ettei se tule koskaan mit&auml;&auml;n maksamaankaan. Ohjelmisto kehittyy koko ajan, joten yh&auml; lis&auml;&auml; huipputoimintoja on luvassa.<BR><BR>
Seuraavaan julkaisuversioon on mm. suunnitteilla suora Fidonet-tuki, joten Elinaa voi k&auml;ytt&auml;&auml; my&ouml;s pointtisoftana, ja viestialueiden ryhmittely omien toiveiden mukaisesti sek&auml; viestikannan yll&auml;pito-ohjelma. Uusin t&auml;ll&auml; hetkell&auml; saatavilla oleva virallinen julkaisu on 2a. Sen saa tietysti omasta boksistani. Imaisu onnistuu heti Login-promptissa komennolla Elina. Uusi suuntanumero on 05. Vanhakin tosin toimii viel&auml; lokakuun alkuun asti.<BR><BR>
Toinen paikka, josta Elinan uusimman virallisen version saa, on Funet. FTP-palvelimen nimi siis on <B>ftp.funet.fi</B> ja hakemisto <A HREF="ftp://ftp.funet.fi/pub/amiga/datacomm/bbs/misc/ElinaP2a.lha">pub/amiga/datacomm/bbs/misc</A>. Levityspaketin nimi on <CODE><B>ElinaP2a.lha</B></CODE>. Webin kautta pakettiin p&auml;&auml;see k&auml;siksi naputtelemalla osoitteeksi <A HREF="http://www.funet.fi/pub/amiga/datacomm/bbs/misc/">http://www.funet.fi/pub/amiga/datacomm/bbs/misc/</A>.<BR><BR>
Seuraava virallinen versio ilmestyy vasta aikojen p&auml;&auml;st&auml;, mutta ep&auml;virallisia testiversioita on saatavilla halukkaille. Jos haluat p&auml;&auml;st&auml; Elinan testaajaksi, ota yhteytt&auml; minuun, niin sovitaan asiasta. Ohjelmiston nimi, Elina, on hieman erikoinen. On helppo arvata, ett&auml; se on nimetty er&auml;&auml;n tyt&ouml;n mukaan...<BR><BR>

<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
