<HTML>
<HEAD>
<TITLE>Final Writer 5</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Final Writer 5</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Erkki Grenman</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>L</FONT><FONT SIZE=3>
&auml;hes vuoden kehitysty&ouml;n j&auml;lkeen Softwoodilta ilmestyi uusi versio Final Writerist&auml;. T&auml;h&auml;n versioon on lis&auml;tty enemm&auml;n uusia ominaisuuksia kuin mihink&auml;&auml;n aikaisempaan p&auml;ivitykseen. Jokainen lis&auml;ys on tehty k&auml;ytt&auml;jien tahdosta. Uusia ominaisuuksia ovat mm. taulukot, RTF (Rich Text Format), tiedostojen tuonti ja vienti, automaattikorjaus, datatyyppien hyv&auml;ksik&auml;ytt&ouml;, muokattavat kirjasinasetukset, HTML-dokumenttien luonti sek&auml; t&auml;ysi yhteensopivuus uuden Final Writer for Windows 95:n kanssa. Lopputuloksena on todella monipuolinen tekstink&auml;sittelyohjelma Amigalle. My&ouml;s Windows 95:lle on oma versio.<BR><BR>
Automaattikorjaus sis&auml;lt&auml;&auml; monta k&auml;tev&auml;&auml; ominaisuutta. Voit halutessasi valita virkkeet aloitettavaksi automaattisesti isolla kirjaimella. Voit valita my&ouml;s lauseen alusta toisen ison kirjaimen poistettavaksi. "KIva juttu" on korjattuna "Kiva juttu". Lis&auml;ksi voit sy&ouml;tt&auml;&auml; ohjelmalle sanoja, jotka usein kirjoitat v&auml;&auml;rin tai jotka muuten vain esiintyv&auml;t tekstiss&auml;si usein. K&auml;tev&auml; ominaisuus, jolla on mahdollisuus helpottaa huomattavasti ty&ouml;skentely&auml;. Jos vaikkapa haluat kehua kaverillesi, kuinka k&auml;tev&auml; t&auml;m&auml; "Final Writer Release 5" on ja sama teksti esiintyy monta kertaa, niin sy&ouml;t&auml;t automaattikorjaajalle esim. FW5 ja joka kerta, kun tekstiss&auml; esiintyy tuo lyhyt "koodi", se korvataan tuolla pidemm&auml;ll&auml; tekstill&auml;. K&auml;tev&auml;&auml;, min&auml; jo suunnittelin k&auml;ytt&auml;v&auml;ni tuota ensi talvena j&auml;&auml;kiekkojoukkueiden nimiss&auml;.<BR><BR>
Datatyyppituki on hyv&auml; uusi ominaisuus. Kun t&auml;h&auml;n asti ohjelma on hyv&auml;ksynyt vain IFF- ja EPS-formaatin, niin nyt uudet Amigat (OS 3.0+) voivat k&auml;ytt&auml;&auml; hyv&auml;kseen niit&auml; datatyyppej&auml;, jotka ovat koneeseen asennettuina (GIF, JPEG, BMP, TIFF ym.).<BR><BR>
Uudessa versiossa on nyt mahdollisuus k&auml;ytt&auml;&auml; ASL-valitsimia (ASL = Amiga Standard Library) Final Writerin omien sijaan. ASL-valitsimien hyvist&auml; ominaisuuksista voi mainita mm. liikkumisen kursorinuolilla tiedostonvalitsimessa. Voit my&ouml;s kirjoittaa alkukirjaimet haluamastasi tiedostosta, ja valitsin menee automaattisesti ensimm&auml;iseen sopivaan tiedostoon. Kun t&auml;h&auml;n on tottunut jo monissa muissa ohjelmissa, niin ominaisuutta on ehtinyt Final Writeriinkin jo kaivata.<BR><BR>
Ehk&auml; kaikkein kysytyin ominaisuus viimeisten kahden vuoden aikana on ollut taulukot. Taulukkojen luonti on nyt helppoa. Kerrot vain mit&auml; haluat, montako rivi&auml; ja saraketta. Tekstin lis&auml;&auml;minen taulukon soluun on yht&auml; helppoa kuin muunkin tekstin kirjoittaminen. Voit halutessasi k&auml;ytt&auml;&auml; vaikka joka solussa erilaista, eriv&auml;rist&auml; ja erikokoista kirjasinta. FW5 k&auml;sittelee taulukkoa itsen&auml;isen&auml; objektina, jonka voi asettaa mihin tahansa dokumentissa ja teksti virtaa (flow) automaattisesti sen ymp&auml;rill&auml;.<BR><BR>
Yksi mielenkiintoinen uutuus on RTF-vienti- ja tuontimahdollisuus. RTF on useissa PC- ja Mac-ohjelmissa yleinen tallennusmuoto. Nyt sit&auml; voi tuoda t&ouml;it&auml; kotiin... Ohjelmalla on nyt mahdollista tehd&auml; my&ouml;s WWW-sivuja uuden HTML-export-ominaisuuden ansiosta. Taidankin tehd&auml; omaksi ja sukulaisten riemuksi pienen sukuhistorian kuvineen omalle koneelleni.<BR><BR>
Ohjelman mukana tulee muutama valmis lomakepohja, joita voit muokata mieleisiksesi tai voit tehd&auml; omia tarpeitasi vastaavat pohjat valmiiksi. Nyt on mahdollista tallentaa useita ohjelma-asetuksia ja valita niist&auml; tarpeiden mukaan sopiva. Paljon on tahdottu my&ouml;s kirjasinten esilatausta. M&auml;&auml;rittelet vain haluamasi kirjasimet uudella kirjasinasetusvalitsimella, ja ne ovat heti alussa k&auml;yt&ouml;ss&auml;si ja hankala latausrutiini on historiaa.<BR><BR>
Ominaisuudet vaativat lis&auml;&auml; muistikapasiteettia koneelta, mik&auml; ei n&auml;in&auml; halpojen muistipiirien aikoina haittaa. On vain hyv&auml;, ett&auml; tehd&auml;&auml;n uusia tehokkaita ja ajan tasalla pysyvi&auml; ohjelmia. Laitteistovaatimukset FW5:lla ovat kiintolevy (eih&auml;n t&auml;n&auml; p&auml;iv&auml;n&auml; kenellek&auml;&auml;n riit&auml; pelkk&auml; korppukone) ja WB 2.04 tai uudempi. Datatyyppien hyv&auml;ksik&auml;ytt&ouml; vaatii v&auml;hint&auml;&auml;n WB 3.0:n. Muistia tarvitaan v&auml;hint&auml;&auml;n 2,5 megaa, suositeltavaa olisi suurempi m&auml;&auml;r&auml;.<BR><BR>
Lis&auml;ksi on monenlaista pient&auml; lisuketta, ja n&auml;in on saatu hyv&auml;st&auml; ohjelmasta entist&auml; parempi. Kun saat lis&auml;ksi 120 outline-kirjasinta, 100 EPS-clipart-kuvaa ja hyv&auml;n k&auml;sikirjan, niin ei voi muuta kuin suositella ohjelman hankkimista. Vanhoille k&auml;ytt&auml;jille tarjotaan edullista p&auml;ivityst&auml;. Minullakin on Amiga Formatin mukana tullut FW4 Lite rekister&ouml;ityn&auml;, eik&auml; sen p&auml;ivitys maksa kuin 29,95 puntaa + postitus ja pakkaus 5 puntaa, eli suomeksi sanottuna noin 250 markkaa.<BR><BR>
<I>(Artikkeli on laadittu p&auml;ivitystarjouksen mukana tulleen esitteen pohjalta. Ohjelmaa ei ole viel&auml; toimitettu, joten en ole viel&auml; k&auml;yt&auml;nn&ouml;ss&auml; p&auml;&auml;ssyt sit&auml; kokeilemaan.)</I><BR><BR>
<A NAME=Kuvat></A>
<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=40% ALIGN=CENTER><B>Kuva 1</B><BR><A HREF="FWKuva1.html"><IMG SRC="Kuvat/FW5_3_S.GIF" Alt="Kuva 1" BORDER=0></TD>
  <TD WIDTH=20% ALIGN=CENTER><B>Kuva 2</B><BR><A HREF="FWKuva2.html"><IMG SRC="Kuvat/FW5_1_S.GIF" Alt="Kuva 2" BORDER=0></TD>
  <TD WIDTH=40% ALIGN=CENTER><B>Kuva 3</B><BR><A HREF="FWKuva3.html"><IMG SRC="Kuvat/FW5_4_S.GIF" Alt="Kuva 3" BORDER=0></TD>
</TR>
</TABLE><BR>
</FONT><FONT SIZE=4><B>Lopuksi valmistajan yhteystiedot:</B></FONT><BR><BR>
<FONT SIZE=3>
<BLOCKQUOTE>
<PRE><B>Softwood Products Europe
New Street               Englannin puh.  01 773 836 781
Alfreton                            fax  01 773 831 040
Derbyshire                       EMail:  <A HREF="mailto:100271.3557@compuserve.com"><I>100271.3557@compuserve.com</I></A>
DE55 7BP
England</B></PRE>
</BLOCKQUOTE>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>