<HTML>
<HEAD>
<TITLE>Miami</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Miami</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR><BR>
  <FONT SIZE=3><B>Sami Klemola</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>A</FONT><FONT SIZE=3>
migalla p&auml;&auml;see Internetiin siin&auml; miss&auml; mill&auml; tahansa muullakin koneella. Helppoa se ei kuitenkaan v&auml;ltt&auml;m&auml;tt&auml; ole, paitsi kun tiet&auml;&auml; tarkalleen, mit&auml; haluaa tehd&auml;, mit&auml; siihen tarvitsee ja miten ty&ouml;kaluja k&auml;ytet&auml;&auml;n. On kaksi tapaa k&auml;ytt&auml;&auml; Interneti&auml;. Oman koneen n&auml;k&ouml;kulmasta helpompi niist&auml; on k&auml;ytt&auml;&auml; palveluntarjoajan tietokonetta ja sen olemassa olevia ohjelmia p&auml;&auml;teohjelman kautta - v&auml;h&auml;n kuin boksia. Tehokkaampi tapa, joka avaa sinulle uusia ovia, on liitt&auml;&auml; oma tietokone osaksi kaikkien verkkojen &auml;iti&auml; ja tehd&auml; sill&auml; ihan mit&auml; haluaa! Jos olet ollut Internetiss&auml; aiemmin omaa tietokonettasi p&auml;&auml;tteen&auml; k&auml;ytt&auml;en, sinun kannattaa ehdottomasti kokeilla j&auml;ljimm&auml;ist&auml; tapaa. Jos olet aivan uusi tuttavuus Internetin kanssa, sinun kannattaa ohittaa Unix ja k&auml;ytt&auml;&auml; heti alusta netti&auml; parhaalla mahdollisella tavalla. Se on ihan helppoa. T&auml;m&auml;n artikkelin luettuasi osaat varmasti tehd&auml; sen itse.<BR><BR>
</FONT><FONT SIZE=4><B>Verkkoon!</B></FONT><BR><BR>
<FONT SIZE=5>O</FONT><FONT SIZE=3>
ma kone liitet&auml;&auml;n osaksi verkkoa k&auml;ynnist&auml;m&auml;ll&auml; omalla koneella sek&auml; jo verkossa kiinni olevalla koneella yhteysohjelma. Toinen kone on tyypillisesti palveluntarjoajan Unix-tietokone, jolla sinulla on k&auml;ytt&ouml;oikeus. Perinteisesti k&auml;ytetty liitynt&auml;muoto SLIP (Serial Line Internet Protocol) on v&auml;istynyt, ja nyky&auml;&auml;n kaikki k&auml;ytt&auml;v&auml;t PPP-yhteyksi&auml; eli Point-to-Point-protokollaa.<BR><BR>
PPP on dynaamisempi ja helppok&auml;ytt&ouml;isempi kuin SLIP. Sen kanssa ei juuri tarvitse itse tehd&auml; etuk&auml;teisasetuksia, vaan oma yhteysohjelma hakee tarvitsemansa tiedot palveluntarjoajan koneelta ja verkosta. N&auml;in asia k&auml;y, kun valitset yhteysohjelmaksesi Miamin. Miami on lyhenne sanoista Modem-based Internet for Amiga eli Amiga Internetiin modeemin kautta.<BR><BR>
Muitakin liitynt&auml;ohjelmia on kuten AmiTCP/IP, mutta sit&auml; en miss&auml;&auml;n nimess&auml; suosittele, koska se on aivan k&auml;sitt&auml;m&auml;tt&ouml;m&auml;n hirvitt&auml;v&auml; konfiguroitava. Tarvitaan suunnaton m&auml;&auml;r&auml; teknist&auml; tiet&auml;myst&auml; ja gurun taidot, ett&auml; sen saa toimimaan edes SLIP-yhteydell&auml;. PPP:t&auml; varten tarvitaan viel&auml; erillinen ohjelma ja yli-ihmisen olemus. L&auml;hes poikkeuksetta kokeneillakin harrastajilla on mennyt AmiTCP/IP:n asentamiseen tuntikausia ja monet ovat ep&auml;onnistuneetkin siin&auml;. &Auml;l&auml; siis usko, jos joku v&auml;itt&auml;&auml; sinulle, ett&auml; se ei muka ole vaikeasti konfiguroitava. Hanki Miami.<BR><BR>
Miami maksaa noin 150 markkaa ja AmiTCP/IP melkein puoli tuhatta! Ero on huikea, ja kun otetaan huomioon, ett&auml; Miami pystytt&auml;&auml; itsens&auml; ja AmiTCP/IP ei nouse pystyyn ollenkaan, ei ole mit&auml;&auml;n ep&auml;selvyytt&auml;, kumpi valitaan. Miami emuloi t&auml;ysin AmiTCP/IP:n liitynt&auml;kirjastoa, eik&auml; mit&auml;&auml;n ongelmia ole. Se emuloi my&ouml;s toista AS225-liitynt&auml;tapaa, joten kaikkia Amigan Internet-asiakasohjelmia voi k&auml;ytt&auml;&auml; sen kanssa. Miamista on saatavilla t&auml;ysin toimiva demoversio, jossa on tunnin aikarajoitus.<BR><BR>
Toinen vaihtoehto on MultiLink. Se ei ole varsinainen TCP/IP-protokollapino, vaan se k&auml;ytt&auml;&auml; omaa tapaansa tiedon siirt&auml;miseen. Siit&auml; syyst&auml; my&ouml;s palveluntarjoajan koneella pit&auml;&auml; olla sama ohjelma k&auml;ynniss&auml;. Sen voit kyll&auml; itse k&auml;&auml;nt&auml;&auml; sinne ja esimerkiksi Kymen Internet-K&auml;ytt&auml;j&auml;t ry:n koneella se on jo valmiina. MultiLinkin k&auml;ytt&auml;minen on my&ouml;s helppoa, eik&auml; sek&auml;&auml;n edellyt&auml; ennakkokonfigurointia. MultiLink on my&ouml;s sharewarea ja maksaa reilun satasen.<BR><BR>
Suosittelen Miamia. Se on oikea TCP/IP-nippu ja viel&auml;p&auml; Unixista portattu, joten sen toimivuus on taattu. Ennen Miamin k&auml;ytt&ouml;&auml; ajetaan MiamiInit. Se kysyy muutaman helpon kysymyksen, jotka ovat ihan toista luokkaa kuin AmiTCP/IP:n tiedustelemat destination IP-addressit ja default gatewayt. Kaiken teknisen tiedon MiamiInit hakee palveluntarjoajalta itse, kun lopuksi soitetaan sinne. Nameserveri&auml; se saattaa kysy&auml;, mutta sen osoitteen saat palveluntarjoajalta kysym&auml;ll&auml;.<BR><BR>
MiamiInit sis&auml;lt&auml;&auml; pikkuisen p&auml;&auml;teohjelman, jonka avulla voit kirjoittautua sis&auml;&auml;n palveluntarjoajan koneelle ja k&auml;ynnist&auml;&auml; PPP-yhteyden. Se tapahtuu esimerkiksi antamalla komento pppd. T&auml;m&auml;n j&auml;lkeen loppu tapahtuu automaattisesti ja hetken kuluttua yhteys katkeaa. Tallenna tiedot ja k&auml;ynnist&auml; Miami. Lataa asetukset ja voit painaa Online-nappia. Yhteys muodostuu, Miami kirjoittautuu puolestasi sis&auml;&auml;n ja k&auml;ynnist&auml;&auml; yhteyden. Siin&auml; kaikki. Olet verkossa!<BR><BR>

</FONT><FONT SIZE=4><B>Asiakasohjelmat</B></FONT><BR><BR>
<FONT SIZE=5>I</FONT><FONT SIZE=3>
tse yhteys ei viel&auml; anna sinun tehd&auml; mit&auml;&auml;n. Miami tarjoaa nk. clienteille eli asiakasohjelmille liitynn&auml;n verkkoon nk. socketien kautta. Amigalle on paljon asiakasohjelmia, ja niit&auml; l&ouml;ytyy jokaista Internet-palvelua varten. Internet on muutakin kuin webbi, vaikka sen kautta miltei kaiken jo nyky&auml;&auml;n saakin tehty&auml;.<BR><BR>
Ensiksi otetaan siis yhteys Miamilla. Kun yhteys on muodostunut, voit k&auml;ynnist&auml;&auml; asiakasohjelmia Workbenchista tai shellist&auml;. Ne saavat yhteyden verkkoon Miamin kautta. Yhteys toimii niin kauan kuin Miami on k&auml;ynniss&auml;. T&auml;ss&auml; viel&auml; lyhyt katsaus eri palveluihin ja hieman tietoa niihin liittyvist&auml; asiakasohjelmista. Niit&auml; saa bokseista ja FTP-palvelimista.<BR><BR>

</FONT><FONT SIZE=4><B>WWW</B></FONT><BR><BR>
<FONT SIZE=5>N</FONT><FONT SIZE=3>
yky&auml;&auml;n ylivoimaisesti k&auml;ytetyin ja tunnetuin Internetin palveluista on <B>W</B>orld <B>W</B>ide <B>W</B>eb, graafinen hypertekstitietopalvelu. Kaikilla suurilla yrityksill&auml; on omat sivunsa WWW:ss&auml; ja harrastelijat tekev&auml;t omiaan omaksi ilokseen ja muiden hy&ouml;dyksi. K&auml;ytett&auml;v&auml; ja toimiva WWW-asiakasohjelma eli nk. selain on AWeb. Toinen, jota ihmiset ovat kehuneet, on IBrowser. AMosaic on kankea ja hidas, ainakin MUI 2.x:n kanssa. Lis&auml;ksi se on buginen.<BR><BR>

</FONT><FONT SIZE=4><B>FTP</B></FONT><BR><BR>
<FONT SIZE=5>F</FONT><FONT SIZE=3>
ile <B>T</B>ransfer <B>P</B>rotocol on tapa siirt&auml;&auml; tiedostoja Internetin v&auml;lityksell&auml;. FTP-palvelimia on lukuisasti, ja niill&auml; on usein jopa kymmeni&auml; gigatavuja tiedostoja, joita voi vapaasti hakea itselleen. Omia tiedostojakin voi useimpiin laittaa muiden saatavaksi. Amigalle on portattu Unixin NcFTP-ohjelma, joka on tietysti tekstiperustainen. Siin&auml; on my&ouml;s kuulemani mukaan bugeja, mutta minun k&auml;yt&ouml;ss&auml;ni se toimi hyvin.<BR><BR>
Lis&auml;ksi on graafisella k&auml;ytt&ouml;liittym&auml;ll&auml; varustettu AmiFTP. Voit klikkailla itsellesi tiedostoja. Kolmas mainittava on FTPMount, jonka avulla voit mountata FTP-palvelimia oman koneesi asemiksi. Funetiin avautuu yhteys komennolla "<CODE><B>Mount FTP:ftp.funet.fi</B></CODE>". Voit menn&auml; ko. hakemistoon ja listata Funetin tiedostoja Dir- ja List-komennoilla.<BR><BR>
Tiedostojen siirt&auml;minen omalle koneelle k&auml;y Copy-komennolla, ihan kuin kopioisit levylt&auml; toiselle. Esimerkiksi Elinan (katso esittelyjuttu t&auml;st&auml; lehdest&auml;) saat kopioitua itsellesi n&auml;in:<BR><BR>
<CODE><B>Copy pub/amiga/datacomm/bbs/misc/ElinaP2.lha DL:</B></CODE><BR><BR>
Muuta tietysti <CODE><B>DL:</B></CODE>-kohteen tilalle oma download-hakemistosi.<BR><BR>

</FONT><FONT SIZE=4><B>IRC</B></FONT><BR><BR>
<FONT SIZE=5>I</FONT><FONT SIZE=3>
nternet <B>R</B>elay <B>C</B>hat mahdollistaa reaaliaikaisen "juttelun" muiden Internetin k&auml;ytt&auml;jien kanssa. IRC:ss&auml; on kanavia, joilla olijat n&auml;kev&auml;t, mit&auml; toiset kirjoittavat. Voit perustaa oman kanavan ja kutsua sinne haluamasi ihmiset, tai jutella muiden kanssa jollakin yleisell&auml; kanavalla. Unixin IRC-ohjelmaa ei Amigalle liene portattu, joten "<I>irkkiminen</I>" Amigalla on onnenkauppaa.<BR><BR>
Sellainen IRC-asiakasohjelma on kuin Grapevine, mutta minulla se ei toimi oikeastaan yht&auml;&auml;n. 32 yrityskerrasta se kaatui 29 kertaa heti. Yhdell&auml; kerralla se toimi muutaman sekunnin. Vain kaksi kertaa se pysyi v&auml;h&auml;n kauemmin pystyss&auml;. Toisaalla Grapevine kuulemani mukaan toimii ihan hyvin. Ilmeisesti se on ohjelmoitu todella huonosti, ja se toimii jossakin systeemiss&auml; ja toisessa ei.<BR><BR>
Kokeile, toimiiko se sinulla. Jos toimii, olet onnekas. K&auml;yntiin l&auml;htiess&auml;&auml;n Grapevine on hienon n&auml;k&ouml;inen ja helppok&auml;ytt&ouml;inen ohjelma. Harmi, ettei se toimi kunnolla. Huhut kertovat sellaisesta ohjelmasta kuin AmIRC, mutta sit&auml; en ole onnistunut k&auml;siini saamaan. Jos sen l&ouml;yd&auml;t, kokeile ja kerro minullekin, millainen se on...<BR><BR>

</FONT><FONT SIZE=4><B>NNTP, SMTP ja POP</B></FONT><BR><BR>
<FONT SIZE=5>U</FONT><FONT SIZE=3>
senet on joukko uutisryhmi&auml;, ja se vastaa Fidonet-teknologian viestiverkkoa. Sinne voivat kaikki kirjoittaa viestej&auml; samaan tapaan kuin bokseihin. Niit&auml; tosin kutsutaan uutisartikkeleiksi. Voit hakea ja l&auml;hett&auml;&auml; artikkeleita NNTP-ohjelmien avulla. Itse k&auml;yt&auml;n hakemiseen NNTPxfer:i&auml; ja l&auml;hett&auml;miseen NNTPpost-ohjelmaa. Niiden kanssa on k&auml;yt&ouml;ss&auml; osittain asennettu AmigaUUCP ja muutama oma ohjelma.<BR><BR>
Helpomminkin selvi&auml;&auml;. K&auml;ytt&auml;m&auml;ni GRn-uutistenlukijaohjelma osaa lukea artikkeleita my&ouml;s suoraan NNTP-palvelimelta. Min&auml; vain tykk&auml;&auml;n hakea ne omalle koneelleni ja lukea ne "offline". Tutustu Thor-nimiseen ohjelmaan, jos olet kiinnostunut. Sill&auml; pit&auml;isi onnistua sekin.<BR><BR>
E-mail lienee tuttu kaikille. Se tarkoittaa Internetin kautta l&auml;hetetty&auml; yksityisviesti&auml;, nk. s&auml;hk&ouml;postia. Sen l&auml;hett&auml;miseen k&auml;yt&auml;n SMTPpost-ohjelmaa. Thor varmasti osaa senkin. Vastaanottaminen on hieman hankalampaa. E-mailit saapuvat aina palveluntarjoajan koneelle, joten ne pit&auml;&auml; hakea sielt&auml;.<BR><BR>
Sit&auml; varten tarvitaan POP-asiakasohjelma. Sellainen on AmiPOP. En ole sit&auml; k&auml;ytt&auml;nyt, mutta eik&ouml;h&auml;n sen avulla E-mailien hakeminen onnistu. Thor kai osaa t&auml;m&auml;nkin. Kuten voit p&auml;&auml;tell&auml;, en ole sit&auml;k&auml;&auml;n k&auml;ytt&auml;nyt. Olen viritellyt itselleni sekavan kokoelman kaikenlaisia ohjelmia, joiden avulla messuilen Internetiss&auml;...<BR><BR>

</FONT><FONT SIZE=4><B>Loppusanat</B></FONT><BR><BR>
<FONT SIZE=5>M</FONT><FONT SIZE=3>
uitakin Internet-palveluita tietysti on, mutta t&auml;ss&auml; olivat keskeisimm&auml;t. Amigallakin Interneti&auml; k&auml;ytt&auml;&auml;, vaikka paras yhdistelm&auml; tietysti on PC ja Netscape Navigator. Amigan asiakasohjelmat ovat v&auml;h&auml;n mit&auml; ovat. Yleens&auml; ne kyll&auml; toimivat, mutta l&auml;hes poikkeuksetta kaikki osaavat kaatua. AWeb on muutaman kerran jumiutunut, AMosaic monta kertaa, samoin FTPMount. IBrowseria en ole k&auml;ytt&auml;nyt, mutta eik&ouml;h&auml;n sekin sen taidon omaa.<BR><BR>
AmiFTP on kaatunut monta kertaa, Grapevinest&auml; jo kerroinkin, eli se ei muuta teek&auml;&auml;n koneessani kuin kaatuilee. Se on s&auml;&auml;li, ett&auml; Amigan ohjelmat ovat n&auml;in huonoja. En tied&auml;, mist&auml; se johtuu. Ehk&auml; Amigan ohjelmoijat ovat niin huolimattomia tai v&auml;linpit&auml;m&auml;tt&ouml;mi&auml;, etteiv&auml;t v&auml;lit&auml; ohjelmiensa kaatuiluista.<BR><BR>
Amigistien keskuudessa paljon parjattu Microsoft(tm) Windows(tm) toimii selv&auml;sti luotettavammin kuin Amigan ohjelmat. T&auml;m&auml; ei koske pelk&auml;st&auml;&auml;n Internet-asiakasohjelmia vaan Amigan ohjelmia yleens&auml;. Ne ovat paljon huonompia kuin PC:n ohjelmat. Tarkoitan sit&auml; siis siin&auml; mieless&auml;, ett&auml; ne kaatuilevat paljon enemm&auml;n.<BR><BR>
Amigan ohjelmat ovat usein helppok&auml;ytt&ouml;isempi&auml;, nerokkaampia ja tehokkaampia kuin PC:n, mutta ep&auml;varmuus on todella suuri miinus. Ei ole varmasti kenest&auml;k&auml;&auml;n kivaa, ett&auml; kone resetoituu itsekseen v&auml;h&auml;n v&auml;li&auml;. Mieluiten k&auml;ytt&auml;isi sen ajan yhten&auml;iseen ty&ouml;skentelyyn.<BR><BR>
Mit&auml; tulee Amigan Internet-k&auml;ytt&ouml;&ouml;n, se on melko tuskaa. Jos j&auml;tt&auml;&auml; viel&auml; huomiotta sen, ett&auml; peruskoneella on k&auml;ytett&auml;viss&auml; enint&auml;&auml;n 16 v&auml;ri&auml;, on Internetiss&auml; surffailu muutenkin ankeaa ja kankeaa. Esimerkiksi kun k&auml;ynniss&auml; on FTP-siirto ja laittaa selaimen hakemaan webbisivua, FTP-siirto katkeaa kuin sein&auml;&auml;n.<BR><BR>
Se pysyy j&auml;iss&auml; niin kauan, kunnes selain ei ole en&auml;&auml; k&auml;ytt&auml;nyt yhteytt&auml; ja minuutti siihen p&auml;&auml;lle. Sama koskee NNTP-siirtoa. T&auml;ysin poikki. Ei ole kovin hyv&auml;&auml; mainosta moniajokoneelle. Ensin ajattelin vian olevan MultiLinkiss&auml;, mutta kun sama tapahtuu Miaminkin kanssa, t&auml;ytyy vian olla asiakasohjelmissa tai itse koneessa. Ehk&auml; se on vain minun koneessani. T&auml;ss&auml; ei mik&auml;&auml;n muukaan tunnu toimivan koskaan kunnolla. Joka tapauksessa kyll&auml; Amiga v&auml;ltt&auml;&auml;, mutta jos PC:n nettik&auml;ytt&ouml;&ouml;n saat niin hanki ihmeess&auml;.<BR><BR>

<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>