<HTML>
<HEAD>
<TITLE>Entisen avustajan mietteit&auml;</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Entisen avustajan mietteit&auml;</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Sami Klemola</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>T</FONT><FONT SIZE=3>
&auml;m&auml; kirjoitus on ep&auml;m&auml;&auml;r&auml;inen kokoelma toisiinsa mill&auml;&auml;n tavalla liitoksissa olemattomia p&auml;tki&auml;. &Auml;l&auml; siis etsi turhaan (aasin)siltoja.<BR><BR>

</FONT><FONT SIZE=4><B>Johdanto</B></FONT><BR><BR>
<FONT SIZE=5>S</FONT><FONT SIZE=3>
akun #20 ilmestytty&auml; on syyskuu ja ilmat ovat menossa viile&auml;mp&auml;&auml;n suuntaan. Nyt on vasta hein&auml;kuun alku, mutta ilma on syksyinen. Sit&auml; se on ollut koko alkukes&auml;n, joka on j&auml;&auml;nyt viile&auml;ksi ja sateiseksi. T&auml;n&auml;&auml;n tiistaina, hein&auml;kuun yhdeks&auml;nten&auml; p&auml;iv&auml;n&auml;, olemme saaneet t&auml;&auml;ll&auml; Etel&auml;-Suomessa ihastella voimakkaita ukkosia. Ensimm&auml;inen ukkospilvi pyyhk&auml;isi Anjalankosken yli iltap&auml;iv&auml;ll&auml; puoli kolmelta. Seuraava antoi odottaa itse&auml;&auml;n puoli yhdeks&auml;&auml;n illalla, mutta kolmas tuli jo 15 minuutin p&auml;&auml;st&auml; siit&auml;. Nyt on keskiy&ouml; l&auml;hestym&auml;ss&auml; ja mielenkiinto on kohdistunut siihen, tuleeko nelj&auml;tt&auml; ukkospilve&auml; ja jos tulee, mihin aikaan.<BR><BR>
N&auml;m&auml; ukkoset eiv&auml;t olleet mit&auml;&auml;n pieni&auml;, vaan jokainen ilmoitti olemassaolostaan v&auml;hint&auml;&auml;n puolen tunnin ajan. Ensimm&auml;inen ukkonen iltap&auml;iv&auml;ll&auml; mellasti koko tunnin. Katsoin ensin l&auml;nnest&auml; l&auml;hestyv&auml;n ukkospilven menev&auml;n etel&auml;n kautta ohi, mutta sielt&auml; tulikin toinen pilvi, ja kummatkin tulivat t&auml;nne! Yleens&auml;h&auml;n ukkosissa salamaniskuja on aika harvassa, eiv&auml;tk&auml; ne usein osu kovinkaan l&auml;helle, vaikka pilvi menisikin yli. T&auml;n&auml;&auml;n ukkoset kuitenkin ovat olleet eritt&auml;in voimakkaita. Sit&auml; voi pit&auml;&auml; yll&auml;tt&auml;v&auml;n&auml;, koska l&auml;mp&ouml;tila oli t&auml;n&auml;&auml;n enimmill&auml;&auml;nkin selv&auml;sti alle 20 astetta. Ehk&auml; kuitenkin juuri siit&auml; syyst&auml; ukkoset muodostuivat niin voimakkaiksi. Etel&auml;st&auml; noussut l&auml;mmin ilma kohtasi poikkeuksellisen kylm&auml;&auml; ilmaa, jolloin muodostui eritt&auml;in voimakkaita rintamaukkosia.<BR><BR>
Edellisen kerran kun ukkosti lauantai-iltana, en n&auml;hnyt yht&auml;&auml;n iskua maahan, mutta vaikka ilmasalamia oli nytkin paljon, n&auml;in t&auml;ll&auml; kertaa monta upeaa maasalamaa. Ensimm&auml;isen ukkosen (silloin iltap&auml;iv&auml;ll&auml;) toinen pilvi, se etel&auml;st&auml; tullut, purki varauksensa t&auml;ss&auml; ihan kohdalla. Kuutisen kertaa isku osui alle puolen kilometrin p&auml;&auml;h&auml;n. L&auml;himm&auml;ksi osunut salama eteni vinosti luoteesta rakennusten yli ja iski pellolle heti niiden taakse. Siin&auml; vaiheessa hieman hirvitti, ett&auml; seuraavako osuu, mutta hengiss&auml; selvittiin. &Auml;&auml;net olivat sit&auml; luokkaa, ett&auml; paraskin THX-luokitettu elokuvateatteri j&auml;&auml; kauas. Kaikki elektroniikkakin s&auml;ilyi ehj&auml;n&auml;, joten p&auml;iv&auml;n tapahtumia voi muistella kevein syd&auml;min. Ukkosella on valtaisa voima, jonka purkautuminen on hieno luonnon valoshow unohtamatta mahtavia &auml;&auml;ni&auml;. Jos et ole kokenut salamaniskua sadan metrin p&auml;&auml;h&auml;n itsest&auml;si, kokeile ihmeess&auml;. Suosittelen sit&auml; kaikille.<BR><BR>

</FONT><FONT SIZE=4><B>Aikahyppy</B></FONT><BR><BR>
<FONT SIZE=5>N</FONT><FONT SIZE=3>
yt onkin jo elokuun viimeinen viikko ja kes&auml;h&auml;n muuttuikin todella hienoksi. Saimme nauttia todella l&auml;mpim&auml;st&auml; elokuusta, eik&auml; hirve&auml;sti harmita, ett&auml; loppuviikosta ennustettiin viilenev&auml;&auml; ja sateita. Kes&auml;st&auml; tuli sittenkin hieno. Edell&auml; kertomani ukkonen muuten s&auml;rki puolen kilometrin p&auml;&auml;st&auml; pylv&auml;smuuntajan ja sytytti l&auml;heisen omakotitalon. Asukas sattui olemaan paikalla ja sammutti leimahtaneet verhot. Suurta vahinkoa ei ehtinyt synty&auml;.<BR><BR>
Sitten asiaan. Otsikon selitys. Olen kirjoittanut Sakuun juttuja kahden vuoden ajan. Nyt olen tieni p&auml;&auml;ss&auml;. T&auml;ss&auml; lehdess&auml; julkaistaan viimeiset kirjoittamani artikkelit. En usko en&auml;&auml; olevani hy&ouml;dyksi lehdelle tai sen lukijoille, joten katsoin parhaaksi lopettaa kirjoittamisen. Artikkeleitani kohtaan ei ole koskaan osoitettu mink&auml;&auml;nlaista kiinnostusta, joten k&auml;yt&auml;n vastaisuudessa aikani johonkin muuhun.<BR><BR>
P&auml;&auml;t&ouml;ksell&auml;ni ei ole mit&auml;&auml;n tekemist&auml; mink&auml;&auml;n muun asian kanssa. En ole siirtym&auml;ss&auml; MikroBittiin (kysyin kyll&auml; mutteiv&auml;t edes vastanneet minulle) enk&auml; alkamassa kokop&auml;iv&auml;iseksi PC-k&auml;ytt&auml;j&auml;ksi. Aion vain tehd&auml; ajallani vastaisuudessa jotakin hy&ouml;dyllisemp&auml;&auml;, esim. katsoa televisiota, pelata Duke Nukemia ja irkkailla tuntikausia kerrallaan.<BR><BR>

</FONT><FONT SIZE=4><B>N&auml;kemys</B></FONT><BR><BR>
<FONT SIZE=5>Y</FONT><FONT SIZE=3>
hdistyksen nimi muutettiin aikaisemmasta SAKU:sta eli Suomen Amiga-K&auml;ytt&auml;jien Unionista nykyiseksi perusteluina, ett&auml; se toi mieleen ammattiyhdistysliikkeen. Nykyisest&auml; nimest&auml; kuitenkin tulee lyhenne SAK, joten jokainen voi mietti&auml; itse, onnistuiko nimenvaihdos teht&auml;v&auml;ss&auml;&auml;n...<BR><BR>

</FONT><FONT SIZE=4><B>Paskapuljut</B></FONT><BR><BR>
<FONT SIZE=5>L</FONT><FONT SIZE=3>
opuksi viel&auml; varoitus yrityksist&auml;, joiden kanssa ei kannata olla miss&auml;&auml;n tekemisiss&auml;. Kierr&auml; kaukaa sellaiset postimyyntiyritykset kuin Man & Man Co ja Com 2001 Oy. M&M on sellainen huijariliike, ettei sen kanssa pid&auml; tehd&auml; mit&auml;&auml;n kauppaa. Siell&auml; valehdellaan ja kusetetaan mink&auml; ehdit&auml;&auml;n. Com 2001:ll&auml; on asiakaspalvelulinjana 7 markkaa minuutissa maksava palvelupuhelin. K&auml;sitt&auml;m&auml;t&ouml;nt&auml; rahastusta, kun suuntaus on yleisesti ollut t&auml;ysin ilmaisiin asiakaspalvelunumeroihin.<BR><BR>
Lis&auml;ksi Com 2001 l&auml;hett&auml;&auml; tavaraa miten sattuu. Min&auml; sain vain yhden tilaamistani tuotteista, eik&auml; mukana ollut mink&auml;&auml;nlaista l&auml;hetyslistaa eik&auml; selvityst&auml; siit&auml;, miksei muita tuotteita tullut ja l&auml;hetet&auml;&auml;nk&ouml; ne mahdollisesti my&ouml;hemmin. Loput kaksi tavaraa sitten tulivat, yksi kerrallaan tietenkin ja joka ikinen l&auml;hetys erikseen postiennakolla ja t&auml;ysien toimituskulujen veloitus kaikista! K&auml;sitt&auml;m&auml;t&ouml;nt&auml;.<BR><BR>
Suositushan on, ett&auml; jos liike ei pysty toimittamaan tavaraa, j&auml;lkitoimituksista ei laskuteta erikseen. Com 2001 kuitenkin kintaalla viittaa hyv&auml;lle kaupantekotavalle ja asiakassuhteiden yll&auml;pidolle ja laittaa viel&auml; postiennakkomaksut kolmeen kertaan. Eik&auml; yhdess&auml;k&auml;&auml;n mit&auml;&auml;n ilmoitusta. No, viimeist&auml; en edes viitsinyt lunastaa, mutta tuskin siin&auml;k&auml;&auml;n olisi mit&auml;&auml;n paperia ollut.<BR><BR>
Lopuksi viel&auml; varoitus sellaisesta puljusta kuin Lincware. Se ei toimita mit&auml;&auml;n asiakkailleen. Viestiverkot ovat t&auml;ynn&auml; ihmisi&auml;, jotka valittavat, ett&auml; ovat joutuneet odottamaan tilaamiaan tuotteita kuukausia. Min&auml; tilasin sielt&auml; Aminet-CD:n reilu kuukausi sitten, eik&auml; sit&auml;k&auml;&auml;n ole toimitettu! Kaksi kertaa olen kysynyt ja kummallakin kerralla on kuulemma ollut, mutta ei ole kuitenkaan toimitettu! Uskomatonta.<BR><BR>
Miten voi ymm&auml;rt&auml;&auml; yrityst&auml;, jolla muka on tavaraa, jonka asiakas on tilannut, mutta joka ei sit&auml; h&auml;nelle toimita??? K&auml;sitt&auml;m&auml;t&ouml;nt&auml;. Lincware ei ole tiet&auml;&auml;kseni toimittanut koskaan kenellek&auml;&auml;n oikeastaan yht&auml;&auml;n mit&auml;&auml;n. Seh&auml;n uskoakseni onkin yhden miehen yritys, jolla ei ole mink&auml;&auml;nlaista varastoa ja joka hankkii sitten asiakkaiden tilaamat tuotteet muualta! Halvemmalla p&auml;&auml;see kun tilaa suoraan muualta... Ja saa tavaran - viel&auml; sellainen pieni juttu.<BR><BR>
Saku - yhdistys eik&auml; lehti - ei vastaa n&auml;ist&auml; asioista, vaikka ne ovat tosiasioita. Julkaisen ne t&auml;ss&auml; omana henkil&ouml;n&auml; itsen&auml;isesti. Valitukset saa osoittaa henkil&ouml;kohtaisesti minulle. Pystyn kuitenkin perustelemaan jokaisen kohdan yll&auml; olevasta jutusta. P&auml;&auml;t&auml;n aiheen positiiviseen kokemukseen. Paras postimyyntiyritys, jonka kanssa olen tehnyt kauppaa, on Bebek Electronic. Sielt&auml; toimitetaan tavarat 2-3 p&auml;iv&auml;ss&auml;, aina. Suosittelen kaikille...<BR><BR>

</FONT><FONT SIZE=4><B>Loppusanat</B></FONT><BR><BR>
<FONT SIZE=5>T</FONT><FONT SIZE=3>
&auml;m&auml; juttu p&auml;&auml;ttyy t&auml;h&auml;n.<BR><BR>
</FONT>

<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>