<HTML>
<HEAD>
<TITLE>Taustamusiikin tekij&auml; esitt&auml;ytyy</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Taustamusiikin tekij&auml; esitt&auml;ytyy</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Tuomas Sandroos</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>K</FONT><FONT SIZE=3>
ilpailuun l&auml;hetetty kolme kappaletta, joista valittiin varsinaiseksi kilpailukappaleeksi <I>"Wanna Continue?"</I>. Muut Sandroosin kilpailukappaleet l&ouml;yd&auml;t <CODE><B>Sakuviisut.LHA</B></CODE> paketista, jossa on julkaistu kaikki saapuneet kilpailukappaleet osallistujittain. Paketti l&ouml;ytyy Saku-tukipurkeista, ainakin Amiga Zonelta.<BR><BR>
</FONT><FONT SIZE=4><B><I>Sijoitus: Nelj&auml;s sija, 103 pistett&auml;.</I></B></FONT><BR><BR><FONT SIZE=3>
Seuraavassa Tuomas kertoo itse eri kappaleiden valmistumisesta:<BR><BR>
</FONT><FONT SIZE=4><B>Intro</B></FONT><BR><BR>
<FONT SIZE=5>K</FONT><FONT SIZE=3>
&auml;ytetyt soft- ja hardwaret: Amiga 500 1 Mt:n kokoonpanolla (OS 1.3), Protracker 1.1b, Avesampler (mono), GEM PX7 -syntetisaattori, PD-soitinlevykkeit&auml;.<BR><BR>
T&auml;m&auml; 16-beatia ja sambaa k&auml;ytt&auml;v&auml; kappale sai alkunsa GEM PX7 -syntikoistani pienen r&auml;mpl&auml;yksen j&auml;lkeen. Tarkoitus oli k&auml;ytt&auml;&auml; sit&auml; jonkin animaation credits-listan taustalla. S&auml;estyssoittimet on samplattu PX7:sta ja loput hankittu PD-soitinlevyilt&auml;.<BR><BR>
Kappaleen teossa ei oikeastaan tullut mit&auml;&auml;n vaikeuksia eteen, paitsi alle sadan kilotavun rajoituksen pit&auml;minen ja &auml;&auml;nikanavien rajat.<BR><BR>

</FONT><FONT SIZE=4><B>Little Hero</B></FONT><BR><BR>
<FONT SIZE=5>K</FONT><FONT SIZE=3>
&auml;ytetyt soft- ja hardwaret: Amiga 500 1 Mt:n kokoonpanolla (OS 1.3), Protracker 1.1b, PD-soitinlevykkeit&auml;.<BR><BR>
Little Heron teossa en k&auml;ytt&auml;nyt lainkaan syntikoita, joten kaikki hoitui suoraan n&auml;pp&auml;imist&ouml;lt&auml;. Kappaleen innoitti tekem&auml;&auml;n er&auml;s arvostelu Brian the Lion -pelist&auml;, jonka kuva sai sormeni syyhy&auml;m&auml;&auml;n. Soittimet on kasattu eri PD-soitinlevyist&auml;.<BR><BR>
Vaikeuksia t&auml;ss&auml; kappaleessa oli vaikka kuinka. En ollut l&ouml;yt&auml;&auml; sopivia lead-soittimia, ja viel&auml;kin tuntuu silt&auml;, etteiv&auml;t ne ole sopivat. Lis&auml;ksi piti v&auml;kisin jatkaa melodiaa pitemm&auml;lle, sill&auml; muuten koko kappale olisi ollut liian lyhyt. Muistin kanssa ei tullut ongelmia, mutta sen sijaan viimeistely vei mehut.<BR><BR>

</FONT><FONT SIZE=4><B>Wanna continue?</B></FONT><BR><BR>
<FONT SIZE=5>K</FONT><FONT SIZE=3>
&auml;ytetyt soft- ja hardwaret: Amiga 500 1 Mt:n kokoonpanolla (OS 1.3), Protracker 1.1b, Avesampler (mono), GEM PX7 -syntetisaattori, PD-soitinlevykkeit&auml;.<BR><BR>
T&auml;m&auml; lyhyt kipale sai alkunsa syntikoistani. Taustalla hakkaa hard rock -komppi tavallista nopeammalla tempolla, mik&auml; teki kappaleesta huomattavasti pirte&auml;mm&auml;n. Kuten nimi vihjaileekin, t&auml;m&auml;n kohde oli "continue?"-ajastimen taustalla soiminen jossain peliss&auml;. Se oli aluksi vain kaksi patternia pitk&auml; ja kesti tietysti vain 10 sekuntia (p&auml;&auml;ttyi ensimm&auml;iseen tom-filliin). Oletin sill&auml; olevan potentiaalia kilpailuun, joten jatkoin sit&auml; muutamalla patternilla. S&auml;estyssoittimet on samplattu PX7:sta ja loput hankittu PD-soitinlevyilt&auml;. Hankaluuksia esiintyi vain muisti- ja &auml;&auml;nikanavarajoissa sek&auml; soittimien valinnassa.<BR><BR>

</FONT><FONT SIZE=4><B>Tarina itsest&auml;ni:</B></FONT><BR>
<FONT SIZE=5>S</FONT><FONT SIZE=3>
&auml;vellysharrastukseni sai alkunsa joskus hein&auml;kuussa 1990, kun olin juuri ja juuri 13-kes&auml;inen. Tilasin niihin aikoihin C=-lehdess&auml; mainostetun Amigan musiikkikurssioppaan, joka osoittautui eritt&auml;in hyv&auml;ksi kaupaksi. Sen avulla opin k&auml;ytt&auml;m&auml;&auml;n CLI:t&auml; ja eri hy&ouml;tyohjelmia, sek&auml; tietysti opasta seurannutta Soundtracker v2.5:tt&auml;.<BR><BR>
Omistin silloin vain yhden soitinlevyn, jolla tein ensimm&auml;iset "kappaleeni". Voin sanoa, ettei niit&auml; "kappaleita" kyll&auml; kuunnellut kukaan muu kuin min&auml;. Sellaisia riipinraapin-sointuja ne olivat! No, jatkoin tietysti harrastusta, ja ohjelmat vaihtuivat sek&auml; soitindiskettej&auml; kertyi. Nyky&auml;&auml;n omistan reilusti yli 3 000 samplea, sek&auml; yhden parhaimmista musiikkieditoreista, Protracker 1.1b:n (my&ouml;s 3.10). Minulta l&ouml;ytyy lis&auml;ksi vanha Soundtracker v2.5, Startrekker, Noisetracker (en muista versioita), Octamed Pro v3, Octamed v4 ja joitain MIDI-s&auml;vellysohjelmia. En koskaan opetellut k&auml;ytt&auml;m&auml;&auml;n Octamedi&auml;, koska se tuntui niin erilaiselta Protrackeriin verrattuna esim. n&auml;pp&auml;inkomentojen kannalta.<BR><BR>
Nyt on kulunut l&auml;hes kuusi vuotta harrastuksen parissa, ja ik&auml;v&auml;kseni s&auml;veltely on j&auml;&auml;nyt aika v&auml;h&auml;iseksi. Kiitokset kuitenkin Sakulle, ett&auml; j&auml;rjestiv&auml;t ehdottamani kilpailun. Sen ansiosta olen s&auml;velt&auml;nyt alle kuukaudessa suunnilleen kahdeksan kappaletta, joista jotkut valitsin kilpailuun (saa n&auml;hd&auml;, p&auml;&auml;sev&auml;tk&ouml; ne edes listoille :-).<BR><BR>
Kerron viel&auml; muutamalla virkkeell&auml; ty&ouml;skentelytavastani: <BR><BR>
Kun alan s&auml;vellell&auml; jotain, minun t&auml;ytyy yleens&auml; keksi&auml; jokin kohde sille, esimerkiksi vaikka jokin peli. Inspiraation saan yleens&auml; v&auml;rikk&auml;ist&auml; kuvista taikka hyvist&auml; soittimista. My&ouml;s motivaatio k&auml;y (kuten em. kilpailu).<BR><BR>
</FONT>

<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
