<HTML>
<HEAD>
<TITLE>P&auml;&auml;toimittajan p&auml;&auml;kirjoitus</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR><BR>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>S</FONT><FONT SIZE=3>
uomen Amiga-k&auml;ytt&auml;j&auml;t ry:n perustamiskirja allekirjoitettiin syyskuussa 1994 ja toimitettiin oikeusministeri&ouml;&ouml;n. Rekister&ouml;inti&auml; odoteltaessa yhdistys aloittaa toimintansa mm. ker&auml;&auml;m&auml;ll&auml; j&auml;senmaksuja. J&auml;senmaksun (60 markkaa vuodeksi 1996) voi maksaa yhdistyksen tilille (muista liitt&auml;&auml; mukaan nimesi ja yhteystietosi) ja se sis&auml;lt&auml;&auml; &auml;&auml;nioikeuden yhdistyksen kokouksissa. Saku-lehden toimitus postitse kotiin j&auml;senvuoden ajan maksaa toiset 60 markkaa yhdistyksen vuoden 1995 vuosikokouksen p&auml;&auml;t&ouml;ksell&auml;.<BR><BR>
<CODE><B>Pankkitili: Merita Vantaa-Koivukyl&auml; 150630-100355</B></CODE><BR><BR>

</FONT><FONT SIZE=4><B>Suomen Amiga-k&auml;ytt&auml;j&auml;t Internetiss&auml;</B></FONT><BR><BR>
<FONT SIZE=5>S</FONT><FONT SIZE=3>
uomen Amiga-k&auml;ytt&auml;j&auml;t ry:n toimintaan p&auml;&auml;see tutustumaan my&ouml;s Internetin v&auml;lityksell&auml;. Suurimmalla osalla Sakun aktiivij&auml;senist&auml; on Internet-osoite, jonne heille voi l&auml;hett&auml;&auml; postia. N&auml;m&auml; osoitteet l&ouml;ytyv&auml;t henkil&ouml;tietosivuilta Vy&ouml;hykejaosta. Yhdistyksell&auml; on my&ouml;s kotisivuja Internetiss&auml;:<BR>
<A HREF="http://www.helsinki.fi/~jaskari/ak.html"><I>http://www.helsinki.fi/~jaskari/ak.html</I></A> ja
<A HREF="http://www.helsinki.fi/~hklaukka/saku.html"><I>http://www.helsinki.fi/~hklaukka/saku.html</I></A>.<BR><BR>

</FONT><FONT SIZE=4><B>Vy&ouml;hykejako</B></FONT><BR><BR>
<FONT SIZE=5>S</FONT><FONT SIZE=3>
uomen Amiga-k&auml;ytt&auml;j&auml;t ry:n tukipalvelu on jaettu nelj&auml;&auml;n vy&ouml;hykkeeseen. Kullakin vy&ouml;hykkeell&auml; on oma koordinaattorinsa, useita vastuuhenkil&ouml;it&auml; sek&auml; yksi tai useampi tukipurkki palvelemassa alueen Amiga-k&auml;ytt&auml;ji&auml;. L&auml;hett&auml;k&auml;&auml; Saku-tilaukset (tilauksiin aina mukaan tiedot siit&auml; mit&auml; haluat, sopiva m&auml;&auml;r&auml; levykkeit&auml; ja palautuskuori riitt&auml;v&auml;ll&auml; postimerkill&auml; varustettuna) ja muu posti koordinaattoreille, ellei lehdess&auml; toisin mainita. Ellet toisin erikseen pyyd&auml;, koordinaattoreille tai toimitukseen l&auml;hett&auml;m&auml;si kirje voidaan julkaista lehdess&auml;.<BR><BR>

<A HREF="Etela.html">    <I>Etel&auml;: Ahvenanmaan maakunta, Uudenmaan ja Kymen l&auml;&auml;nit</I></A><BR>
<A HREF="Ita.html">      <I>It&auml;: Keski-Suomen, Kuopion ja Mikkelin l&auml;&auml;nit</I></A><BR>
<A HREF="Pohjoinen.html"><I>Pohjoinen: Lapin, Oulun ja Pohjois-Karjalan l&auml;&auml;nit</I></A><BR>
<A HREF="Lansi.html">    <I>L&auml;nsi: H&auml;meen, Vaasan sek&auml; Turun ja Porin l&auml;&auml;nit</I></A><BR><BR>

</FONT><FONT SIZE=4><B>Koordinaattorit</B></FONT><BR><BR>
<FONT SIZE=5>V</FONT><FONT SIZE=3>
eli-Matti Vuorensyrj&auml;, Esa Heikkinen,  Janne  Kiiskil&auml;,  Joose Vettenranta.
</FONT>

<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>