<HTML>
<HEAD>
<TITLE>HtmlSaku-toimittajan p&auml;&auml;kirjoitus</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Uudistettu HtmlSaku on t&auml;&auml;ll&auml;!</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Jouni Airaksinen</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>M</FONT><FONT SIZE=3>
onta kertaa olen harmistellut ettei Sakua voi lukea PC-koneella miss&auml;&auml;n j&auml;rkev&auml;ss&auml; muodossa. AmigaGuide-Sakua voi lukea v&auml;ltt&auml;v&auml;sti ja HtmlSaku on ollut eritt&auml;in simppeli. Sakunetiss&auml; oli joskus hieman keskusteluakin t&auml;st&auml; simppelista HtmlSakusta ja siit&auml; sain p&auml;&auml;h&auml;ni yritt&auml;&auml; rakentaa uutta ilmiasua HtmlSakulle. Nyt kun olen saanut ty&ouml;ni p&auml;&auml;t&ouml;kseen, voin vain todeta ett&auml; olen saanut HtmlSakun aivan luettavaan muotoon. Uusi HtmlSaku on suunniteltu l&auml;hinn&auml; Netscape selaimelle ja on testattu Netscape 2.02 for OS/2 ja Netscape 3.0 for Win3.1 selaimilla. Valitettavasti en ole voinut testata t&auml;t&auml; Amigan selaimilla, sill&auml; en omista Amigaa.<BR><BR>
T&auml;ll&auml; hetkell&auml; minua ei ole viel&auml; virallisesti nimitetty vakituiseksi HtmlSaku-toimittajaksi, ja siit&auml; syyst&auml; toivon my&ouml;nteist&auml; palautetta t&auml;st&auml; uudesta HtmlSaku-projektista. Jos palaute on my&ouml;nteist&auml;, saatte hyvin mahdollisesti tulevaisuudessakin nauttia t&auml;st&auml; uudesta HtmlSaku-formaatista. Kaikki parannukset ilmiasuun ja toimintaan otetaan mielihyvin vastaan. Tausta- ja sis&auml;lt&ouml;nappulagrafiikka on itse tehty vain HtmlSakua varten.<BR><BR>
T&auml;ydelliseen lukunautintoon vaaditaan html-selain mik&auml; osaa html-kieless&auml; olevan Frame-toiminnon. Jos lukijasi ei tue t&auml;t&auml; toimintoa niin valitse vain Sakun kansisivulta linkki "<I>Selaimeni ei osaa Frame-ruudunjakotoimintoa</I>" ja Saku siirtyy yksiruutuiseen tilaan. T&auml;ll&ouml;in kuitenkin vaaditaan selaimesta Foward ja Back toiminnot.<BR><BR>
Hyvi&auml; lukuhetki&auml; uuden HtmlSakun parissa!<BR><BR>

<BLOCKQUOTE><I>Jouni Airaksinen</I><BR>
<CODE><B>Kentt&auml;katu 5-7 B 27<BR>
76100 Pieks&auml;m&auml;ki<BR>
Puh. 015 - 488 050<BR>
email: <A HREF="mailto:jouni.airaksinen@mbnet.fi"><I>jouni.airaksinen@mbnet.fi</I></A>
</B></CODE></BLOCKQUOTE>
</FONT>

<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
