<HTML>
<HEAD>
<TITLE>AmigaGuide-toimittajan p&auml;&auml;kirjoitus</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>AmigaGuide-toimittajan p&auml;&auml;kirjoitus</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Jari Ristiranta</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>T</FONT><FONT SIZE=3>
ervetuloa uuden Sakun pariin! Edellisen ilmestymisest&auml; onkin vier&auml;ht&auml;nyt jo tovi, itseasiassa yli puoli vuotta. Amphibia-projekti venyi venymist&auml;&auml;n kunnes lopulta se j&auml;tettiin sivuun ja p&auml;&auml;tettiin jatkaa Sakun julkaisua vanhoissa tutuissa muodoissa. Ainoana suurempana muutoksena on t&auml;m&auml;n AmigaGuide-version toimittajan muutos. Uutena toimittajana toimin min&auml;, Jari Ristiranta.<BR><BR>
Parisen viikkoa sitten p&auml;&auml;toimittaja tarjosi t&auml;t&auml; toimea SakuNetiss&auml; ja min&auml; tartuin heti sarvesta h&auml;rk&auml;&auml; sek&auml; n&auml;pp&auml;imist&ouml;st&auml; Amigaa ja homma oli minun. Olen aina kasaillut innokkaasti AmigaGuide-tiedostoja ja muita vastaavia. Tulevaisuudessa kirjoittelen luultavasti my&ouml;s artikkeleja lehteen.<BR><BR>
Hommaan ei siis ollut paljoa aikaa valmistautua. Siksip&auml; t&auml;m&auml; numero ei v&auml;ltt&auml;m&auml;tt&auml; ole ulkoasultaan niin toimiva ja hieno kuin mahdollista. P&auml;&auml;tin heti edellisist&auml; numeroista poiketen k&auml;ytt&auml;&auml; wordwrap -toimintoa jonka avulla artikkeleiden teksti ylettyy aina molemmille reunoille eri kokoisilla n&auml;yt&ouml;ill&auml;. Otan eritt&auml;in mielell&auml;ni vastaan palautetta - sek&auml; positiivista ett&auml; negatiivista. Tied&auml;n ettei mik&auml;&auml;n kompromissi voi tyydytt&auml;&auml; kaikkia mutta teen parhaani.<BR><BR>
En aio t&auml;ll&auml; kertaa pid&auml;tell&auml; teit&auml; kauempaa. Muistakaa  ett&auml; Saku tarvii juuri teid&auml;n panosta. Saku ei olisi Saku ilman lukijoiden artikkeleita!<BR><BR>
<BLOCKQUOTE><I>Jari Ristiranta</I><BR><BR></BLOCKQUOTE>
<CODE><B>
e-mail: <A HREF="mailto:jari.ristiranta@kareltek.fi"><I>jari.ristiranta@kareltek.fi</I></A><BR>
Puh: (05) 3724 145<BR>
BBS: (05) 3724 145 - 22.30-07<BR><BR>
</B></CODE>
</FONT>

<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
