<HTML>
<HEAD>
<TITLE>P&auml;&auml;toimittajan p&auml;&auml;kirjoitus</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>P&auml;&auml;toimittajan p&auml;&auml;kirjoitus</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Esa Heikkinen</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>V</FONT><FONT SIZE=3>
iime kuukaudet ovat olleet odotuksen ja ep&auml;tietoisuuden aikaa Sakun lukijoille. Uutta levyke-Sakua ei ole kuulunut mihink&auml;&auml;n m&auml;&auml;r&auml;aikoihin menness&auml;. Monella on varmasti mennyt luottamus koko hanketta kohtaan.<BR><BR>
Saku #20 piti alunperin julkaista uudessa Amphibia-muodossa. Niinp&auml; levyke-Sakua #20 ei kasattu en&auml;&auml; lainkaan, ja siirtym&auml;vaiheen aiheuttama viive piti alunperin olla parin viikon luokkaa. Viive kuitenkin venyi venymist&auml;&auml;n, vaikka Amphibian kehitys eteni huhujen mukaan koko ajan. Viimein oli kulunut niin kauan aikaa, ett&auml; Sakunetiss&auml; k&auml;ytyjen keskustelujen pohjalta p&auml;&auml;timme siirty&auml; takaisin vanhaan lehtikoodiin - ainakin siksi aikaa, kunnes Amphibia-projektista valmistuu jotakin n&auml;kyv&auml;&auml;. Ainoa julkaistu muoto Sakun numerosta 20 on ollut t&auml;h&auml;n menness&auml; WWW-sivuilla luettavissa ollut HTML-lehti. Varmaankaan kovin moni lukija ei Internetiin p&auml;&auml;se, joten t&auml;m&auml; levykeversio on varmasti odotettu.<BR><BR>
Syksy toi muutoksia my&ouml;s t&auml;nne p&auml;&auml;toimittajan kotipuoleen, sill&auml; 25. elokuuta kello 18.03 syntyi perheeseemme pienokainen, 3,375 kg painava ja 49,5 cm pituinen poikavauva, joka kastettiin 27.10.96 Niko Juhani Kristian Heikkiseksi. Is&auml;ksi muuttuminen kaiken kiireen keskell&auml; panee v&auml;lill&auml; miettim&auml;&auml;n tulevaa vastuuta ja sit&auml;, miten kaikesta oikein selvi&auml;&auml; tulevaisuudessa. Kokemusta lastenhoidosta ei pahemmin ole, joten n&auml;m&auml; asiat joutuu kaikki opettelemaan v&auml;hitellen. Onneksi puoliso on kokenut lastenhoitaja ja kasvattaja ammattinsa puolesta, joten ei t&auml;ss&auml; tarvitse h&auml;t&auml;&auml; k&auml;rsi&auml;, vaikka itse on t&auml;ll&auml; alalla viel&auml; ihan tumpelo. Ja v&auml;hitellen sit&auml; oppii kaikenlaista... &Auml;&auml;nt&auml; t&auml;m&auml;n ik&auml;isist&auml; vauvoista tosin l&auml;htee enemm&auml;n kuin tarpeeksi, v&auml;lill&auml; tuntuu ett&auml; kohta lent&auml;&auml; veret korvista, kun desibelit nousevat lentoaseman tasolle.. :)<BR><BR>
Nyky&auml;&auml;n is&auml;n on mahdollista p&auml;&auml;st&auml; synnytykseen mukaan, ja suosittelenkin t&auml;t&auml; l&auml;mpim&auml;sti, mik&auml;li jollakulla on perheenlis&auml;yst&auml; tulossa. Synnytyksess&auml; mukanaolosta puhutaan kyll&auml; kaikenlaista, "se on niin hirve&auml;&auml;, ettei sit&auml; kest&auml; tajuissaan katsella" jne., mutta k&auml;yt&auml;nn&ouml;ss&auml; is&auml;n teht&auml;v&auml;n&auml; on tukea &auml;iti&auml; kovien ponnistelujen aikana ja auttaa jaksamaan loppuun. Tukea todella tarvittiinkin Nikon tapauksessa, sill&auml; synnytys ei ollut niit&auml; helpoimpia. Koko viikonloppu meni salilla, eik&auml; synnytys meinannut l&auml;hte&auml; alkuun sitten mill&auml;&auml;n. Viimein synnytys k&auml;ynnistettiin, mink&auml; j&auml;lkeen kului 12 pitk&auml;&auml; tuntia itse syntym&auml;&auml;n. Uusi el&auml;m&auml; on aina kuin ihme ja mielenkiintoinen seurata sivusta - varsinkin, kun huomaa vauvassa samoja piirteit&auml; kuin vanhoissa, omissa mustavalkoisissa vauvakuvissaan reilun 26 vuoden takaa.<BR><BR>
T&auml;ll&auml; hetkell&auml; Niko on kohta 5 kuukautta vanha ja opettelee parhaillaan kovasti konttaamista. Homman idea n&auml;ytt&auml;isi olevan p&auml;&auml;ss&auml; selv&auml; ja asentokin on ok, mutta kun voimat eiv&auml;t viel&auml; riit&auml; eteenp&auml;in pyrkimiseen. Sek&ouml;s kiukuttaa monesti, kun haluttaisi niin kovasti p&auml;&auml;st&auml; liikkeelle. Ehk&auml;p&auml; seuraavan Sakun p&auml;&auml;kirjoituksta kirjoittaessani t&auml;&auml;ll&auml; on kissan lis&auml;ksi yksi uusi nelivetoperiaattella liikkuva, ja pit&auml;&auml; alkaa hiljalleen evakuoida videot ja muut alhaalla olevat laitteet jonnekin turvaan...<BR><BR>
<BLOCKQUOTE><I>Esa Heikkinen</I></BLOCKQUOTE>
</FONT>

<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
