<HTML>
<HEAD>
<TITLE>Posti: Janne Sirenist&auml;</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Posti: Janne Sirenist&auml;</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Sami Klemola</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>S</FONT><FONT SIZE=3>
akussa #18 entinen p&auml;&auml;toimittaja Janne Siren julkaisi mietteit&auml;&auml;n, joista suurin osa oli minun solvaustani. Kirjoitusta, joka eteni tyyliin "Klemola ei suostu maksamaan j&auml;senmaksua, Sami kielt&auml;ytyy lukemasta aputekstej&auml;" jne, ei olisi miss&auml;&auml;n nimess&auml; pit&auml;nyt julkaista artikkelina. Mik&auml;&auml;n itse&auml;&auml;n kunnioittava lehti ei tuollaista kirjoitusta julkaisisi. Osoitti Jannelta huonoa makua ensiksi kirjoittaa tuollainen juttu ja toiseksi k&auml;ske&auml; julkaisemaan se artikkelina. Nykyiselt&auml; p&auml;&auml;toimittajalta osoitti huonoa makua, ett&auml; h&auml;n julkaisi kirjoituksen, ollenkaan, ja etenkin artikkelina.<BR><BR>
Vastaan nyt tuohon kirjoitukseen yleis&ouml;nosastolla, koska en halua alentua tasolle ja osallistua lehden pilaamiseen. Asia olisi pit&auml;nyt keskustella yksityisesti eik&auml; l&auml;hte&auml; suin p&auml;in toitottamaan julkisessa jutussa kaikkea, mik&auml; ei pid&auml; alkuunkaan paikkaansa. Olisi pit&auml;nyt tietysti mainita erikseen, ett&auml; kirjoitin sen alkuper&auml;isen kirjoitukseni (senkin Postissa) pilke silm&auml;kulmassa, enk&auml; miss&auml;&auml;n nimess&auml; vakavissani. En niin kuitenkaan tehnyt, koska odotin, ett&auml; Jannekin ymm&auml;rt&auml;isi sen huumoriksi.<BR><BR>
Ettenk&ouml; muka pysty n&auml;kem&auml;&auml;n muutoksia positiivisina? Ehei, min&auml;h&auml;n nimenomaan kerroin, kuinka hyv&auml; asia mielest&auml;ni p&auml;&auml;toimittajan vaihtuminen oli! Harmi, ett&auml; silti lehdest&auml; joutui lukemaan tuollaista teksti&auml;, jossa saivarreltiin kaikkea mahdollista ja k&auml;&auml;nneltiin asioita mielivaltaisesti. Tarttuminen huomautukseeni tulostuspalveluvastauksesta oli l&auml;hinn&auml; surkuhupaisaa. Janne olisi voinut kysell&auml;, voiko kukaan j&auml;rjest&auml;&auml; asiaa. Min&auml; ostin mainitsemani tulostimen, joten voin kyll&auml; tulostella halukkaille.<BR><BR>
Grafiikka saisi kyll&auml; olla GIF:n&auml; tai BMP:n&auml;. Windows 95 ei oikein tykk&auml;&auml; hyv&auml;ksy&auml; ILBM-kuvia. On minulla uudesta p&auml;&auml;toimittajastakin moite. H&auml;n julkaisi edellisess&auml; numerossa minun tiet&auml;m&auml;tt&auml;ni ja ilman lupaani Sakunetiin l&auml;hett&auml;m&auml;ni hassun mainoksen Elinasta, jota en miss&auml;&auml;n tapauksessa lehteen tarkoittanut, eik&auml; sit&auml; olisi miss&auml;&auml;n nimess&auml; pit&auml;nyt siihen laittaa, etenk&auml;&auml;n Artikkelit-otsikon alle.<BR><BR>
Takaisin Janneen. Toinen esimerkki seuraa. Sen sijaan, ett&auml; Janne ihmetteli kirjoituksessa haluani saada kirjoittajien nimet n&auml;kyviin sis&auml;llysluetteloon: "Miksi?", h&auml;n olisi voinut tiedustella asiaa minulta, ettei olisi tarvinnut aprikoida sit&auml; jutussa. Mielest&auml;ni kyll&auml; perustelin jo riitt&auml;v&auml;sti kantani. Minusta on mielek&auml;st&auml; n&auml;hd&auml;, kuka on jutut kirjoittanut. Sakuun voisi mielest&auml;ni soveltaa tekniikkaa, joka on k&auml;yt&ouml;ss&auml; Tiede 2000 -lehdess&auml;kin.<BR><BR>
Jannen syyt&ouml;s siit&auml;, etten muka suostu maksamaan j&auml;senmaksua on aivan hullunkurinen. Janne toi asian esille aivan kuin minua olisi vaadittu maksamaan se ja olisin kielt&auml;ytynyt! N&auml;in asia ei tietenk&auml;&auml;n ole. Kukaan ei ole sit&auml; minulta edes pyyt&auml;nyt. Minulla on my&ouml;s peruste sille, etten ole j&auml;senmaksua maksanut. En ole katsonut siit&auml; olevan minulle mit&auml;&auml;n hy&ouml;ty&auml;. Broadlinelta en mit&auml;&auml;n tilaa, eik&auml; muuta etua tainnut ollakaan.<BR><BR>
Kun lis&auml;ksi yhdistyksen varoja haaskataan j&auml;rjett&ouml;m&auml;sti, katson velvollisuudekseni olla ottamatta siihen osaa. Janne tiedusteli minulta "artikkelin" v&auml;lityksell&auml; (hankalampaa tapaa on vaikea kuvitella), mist&auml; luulen musiikkikilpailun palkintorahojen tulleen. Seh&auml;n on juuri se mit&auml; tarkoitan! Tied&auml;n rahojen tulleen j&auml;senmaksuista - j&auml;senmaksuista, joilla on ker&auml;tty pienenpienet rahavarat yhdistykselle yhteisen hyv&auml;n tuottamiseksi.<BR><BR>
Sittenp&auml; ne p&auml;&auml;tet&auml;&auml;nkin haaskata johonkin kilpailuun. 500 markkaa! J&auml;rjet&ouml;nt&auml;. On aivan mielet&ouml;nt&auml;, ett&auml; yhdistys, jonka koko varallisuus on vain muutaman kerran tuon verran, tekee noin suuren hyv&auml;ntekev&auml;isyyslahjoituksen. Kun viel&auml; otetaan huomioon kaksi asiaa: todellista ty&ouml;t&auml; tekev&auml;t artikkeleiden kirjoittajat eiv&auml;t saa ty&ouml;st&auml;&auml;n penni&auml;k&auml;&auml;n ja musiikkikilpailu oli aivan hirvitt&auml;v&auml;n huonotasoinen, on haaskaus aivan k&auml;sitt&auml;m&auml;t&ouml;nt&auml;.<BR><BR>
Min&auml; en halua maksaa j&auml;senmaksuja, kun ne tuolla tavalla tuhlataan. Sopiva palkinto mielest&auml;ni olisi ollut 100 markkaa, korkeintaan 200. Sitten voin taas suunnitella yhdistyksen tukemista, kun rahank&auml;ytt&ouml;&ouml;n saadaan j&auml;rke&auml;, edes v&auml;h&auml;n. Korjaamista vaatii yhdistyksen mentaliteetti. Toimintamahdollisuudet ovat yht&auml; v&auml;h&auml;iset, tulee rahaa sitten paljon tai v&auml;h&auml;n, jos ensimm&auml;isess&auml; tapauksessakin ne haaskataan j&auml;rjett&ouml;myyksiin.<BR><BR>
Ja sitten, "artikkeliaiheiden kierr&auml;tys", joka oli seuraava maininta, johon Janne tarttui. Ei se minustakaan vaarallista ole. Ei se r&auml;j&auml;hd&auml; eik&auml; muutoinkaan vammoja aiheuta. Hassu sanavalinta entiselt&auml; p&auml;&auml;toimittajalta. Saahan samasta asiasta kirjoittaa. Uusitaanhan televisiossakin samoja ohjelmia kuukauden v&auml;lein. Hy&ouml;ty ei v&auml;ltt&auml;m&auml;tt&auml; ole huipussaan, mutta jos uutta asiaa on, kannattaa siit&auml; kertoa. Maininta edellisest&auml; jutusta on kuitenkin paikallaan. Sit&auml; painotin, mutta Janne taas j&auml;tti olennaisen huomiotta ja saivarteli sen sivusta.<BR><BR>
Lopuksi, heittoni MikroBitist&auml; ja PC-k&auml;ytt&auml;jyydest&auml; eiv&auml;t olleet henkil&ouml;kohtaisia loukkauksia eiv&auml;tk&auml; haukkuja liioin vaan huumoria. Tarkoitukseni ei ollut loukata ket&auml;&auml;n, ei edes Jannea... PC:h&auml;n on hieno laite. Suosittelen sit&auml; l&auml;mpim&auml;sti kaikille. Duke Nukem 3D ja Netscape Navigator kun eiv&auml;t Amigassa toimi. MikroBitist&auml; voit lukea, kuinka saat rakennettua itsellesi PC:n!<BR><BR>
Min&auml;kin haluan saivarrella! Se, ett&auml; levyke-Sakun ja AmigaGuide(tm)-Sakun toimituksen hoitavat nyt eri ihmiset, ei v&auml;ltt&auml;m&auml;tt&auml; tarkoita, ett&auml; Janne olisi tehnyt kahden ihmisen ty&ouml;t aiemmin. Se voi tarkoittaa my&ouml;s, ett&auml; yhden ihmisen ty&ouml; on jaettu kahdelle, jotka tekev&auml;t puolen ihmisen ty&ouml;n. Nih.<BR><BR>
Periaatteet? Totta, niille ei ole sijaa en&auml;&auml; t&auml;ss&auml; maailmassa. Ei, Sami ei ole tavannut MikroBitin toimitusta. Sami on kyll&auml; l&auml;hett&auml;nyt heille e-mailia. MikroBitin mukava toimitus(tm) ei Samille kuitenkaan vastannut, ei ensimm&auml;iseen eik&auml; toiseen mailiin. Ilmeisesti avustajia on jo tarpeeksi, mutta mukava toimitus olisi kuitenkin voinut jotakin vastata.<BR><BR>
Janne, olet ihan oikeassa, ettei mik&auml;&auml;n koskaan riit&auml;, ja kiitt&auml;m&auml;tt&ouml;myys todella on maailman palkka. Itse olen huomannut aivan saman asian. Paitsi ett&auml; min&auml; en ole saanut edes sit&auml; mainitsemaasi positiivista palautetta kenelt&auml;k&auml;&auml;n milloinkaan. Kiitos ei mielest&auml;ni ole liikaa pyydetty. Kiitos.<BR><BR>

<BLOCKQUOTE><I>Sami Klemola, Ummeljoki</I></BLOCKQUOTE>

<TABLE WIDTH=100%>
<TR><TD ALIGN=RIGHT><A HREF="Postit.html"><I>Paluu takaisin postipalstalle</I></A></TD></TR>
</TABLE>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
