<HTML>
<HEAD>
<TITLE>Posti: Lukijapostia</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Posti: Lukijapostia</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Petri Keckman</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>E</FONT><FONT SIZE=3>
n halua mitenk&auml;&auml;n poistaa p&auml;&auml;toimittajamme Esa Heikkisen - enk&auml; kenenk&auml;&auml;n muunkaan - oikeutta hehkuttaa p&auml;&auml;kirjoituksessaan Sakun uudesta Amphibia-projektin valmistumisesta, mutta haluan ehdottomasti osallistua siihen lukijana Posti-palstalla.<BR><BR>
Mik&auml;li meill&auml; Sakulaisilla on ollut hyv&auml; tuuri, luemme t&auml;t&auml; teksti&auml; nyt siis Amphibia HTML-selaimella. Jos yh&auml; luemme t&auml;t&auml; levyke- tai guide-muotoisena, niin Buu! Buu! Saku-raukka on auttamattomasti my&ouml;h&auml;stym&auml;ss&auml; junasta ja j&auml;&auml;m&auml;ss&auml; asemalle. Uskon, ettei n&auml;in ole k&auml;ynnyt. (Niinp&auml; - toim.huom.)<BR><BR>

</FONT><FONT SIZE=4><B>Turhaa my&ouml;h&auml;stynytt&auml; valitusta</B></FONT><BR><BR>
<FONT SIZE=5>S</FONT><FONT SIZE=3>
akun lukijaohjelma alkoi tuntua tyls&auml;lt&auml; (kaikkeen kyll&auml;styy ja vaihtelu virkist&auml;&auml; - totes yks flikka, kun...), eik&auml; se ole kovin k&auml;tev&auml;k&auml;&auml;n. Pahana puutteena oli mielest&auml;ni se, ettei sivuja voinut vieritt&auml;&auml; portaattomasti. Itse asiassa latasin joskus tekstit suosikkitekstink&auml;sittelij&auml;&auml;ni GoldEDiin ja luin ne sielt&auml;. Ja kuten peleist&auml; tied&auml;mme, voi Amigan ruudulla sotkea kuvia, &auml;&auml;ni&auml;, spritej&auml; ja bobeja mielin m&auml;&auml;rin. Siin&auml; voisi tapahtua vaikka mit&auml;. Miss&auml; oli v&auml;rikkyyys ja r&auml;iskivyys? Amiga olisi ansainnut ulkon&auml;&ouml;lt&auml;&auml;n viel&auml;kin kivemman lehden.<BR><BR>

</FONT><FONT SIZE=4><B>Turhaako toiveikkuutta</B></FONT><BR><BR>
<FONT SIZE=5>M</FONT><FONT SIZE=3>
utta jos n&auml;ytt&ouml;p&auml;&auml;tteiss&auml;mme loistaa painotuore Saku #20 uudessa uljaassa lukijaohjelmassaan, niin bravo! Bravo! Taputuksia! Kohinaa! Suosionosituksia! Nouskaamme hetkeksi seisomaan ja kunnioittakaamme t&auml;t&auml; pient&auml; uudistusta, jonka koko Sakun alullepannut puheenjohtajamme Tomi Jaskari on enimm&auml;kseen saanut aikaiseksi.<BR><BR>
Ulkoasu vaikuttaa automaattisesti koko lehden juttujen kiinnostavuuteen. Hyv&auml;n&auml; esimerkkin&auml; t&auml;st&auml; on Suomessa ilmestyv&auml; toinen tuore Amiga-levykejulkaisu: Finami, jonka toista numeroa katselin. Vaikka jutut olivat lyhyk&auml;isi&auml; ja v&auml;h&auml;n vaatimattomia, niin sit&auml; oli silti kivaa lukea. V&auml;rej&auml; ja taustoja riitti. Sin&auml;ns&auml; sekin kyll&auml; vaikutti olleen "Saku-kulttuurin" perillinen, ja sen tekij&auml;t olivat omaksuneet paljon Sakusta.<BR><BR>

</FONT><FONT SIZE=4><B>Hengen luontia</B></FONT><BR><BR>
<FONT SIZE=5>P</FONT><FONT SIZE=3>
C-koneitten maailmassa ja maassa, jossa Amigan edustus ja tuki on heikohkoa, on t&auml;llaisten harrastelijalehtien asema t&auml;rke&auml;. Toivottavasti uudistus pirist&auml;&auml; meid&auml;n pikkuisen laantunutta innostustamme, joka n&auml;kyi edellisen numeron juttujen v&auml;hyyten&auml;.<BR><BR>
Lienee meill&auml; muutakin kitkaa ollut rattaissa. Laajojen ohjelmointiartikkeleiden kirjoittajana kunnostautunut Sami Klemola tuntui saanneen "burn outin" ja poti er&auml;ist&auml; Sakunetiss&auml; olleista viesteist&auml; p&auml;&auml;tellen pahanlaatuista motivaatiopulaa ja ty&ouml;ns&auml; merkityksett&ouml;myyden tunnetta. Toivottavasti uusi uljas ulkoasumme innostaa Samia ja muitakin jatkamaan.<BR><BR>
T&auml;m&auml;h&auml;n on "ty&ouml;t&auml;" josta ei saa (edes) rahallista palkkaa. Harvoin muutakaan positiivista palautetta - kyll&auml;h&auml;n me ihmiset t&auml;m&auml;n tied&auml;mme - vaikka me sit&auml; haluaisimmekin (saada - vaiko antaa?). T&auml;m&auml;nkin harrastuksen kipin&auml;n on l&ouml;ydytt&auml;v&auml; meist&auml; itsest&auml;mme: siit&auml; hetkitt&auml;isest&auml; pienest&auml; hyv&auml;n olon tunteesta, joka syntyy kun on saannut jotain aikaiseksi ja jolla on edes itselle jotain merkityst&auml;.<BR><BR>
Lis&auml;ksi edellisess&auml; Saku #19:ss&auml; vaikutti silt&auml;, ett&auml; mukavasti aiemmin juttujaan kirjoittanut Heimo Laukkanen oli p&auml;&auml;tynyt k&auml;ytt&auml;m&auml;&auml;n enemm&auml;n PC:t&auml;. Toivottavasti h&auml;n voisi jossain vaiheessa palata astialle ja todeta, ett&auml; molempi parempi.<BR><BR>

</FONT><FONT SIZE=4><B>Ihmisl&auml;heisyytt&auml;</B></FONT><BR><BR>
<FONT SIZE=5>A</FONT><FONT SIZE=3>
migaa k&auml;sittelevien teknisten artikkeleiden lis&auml;ksi ihmisten l&auml;hett&auml;mi&auml; kirjeit&auml; postiosastolle on mielest&auml;ni hauska lueskella. Ne saavat meid&auml;t tuntemaan, ett&auml; teemme t&auml;t&auml; lehte&auml; ihmisilt&auml; ihmisille. Me ihmiseth&auml;n sit&auml; olemme koneittenkin tulevaisuutta tekem&auml;ss&auml;, eiv&auml;tk&auml; koneet meid&auml;n. Janne mainitsi jossain verkkoviestiss&auml;&auml;n ohimennen, ett&auml; Sakun toimitus saa ennemm&auml;nkin kaikenlaista palautetta ja mietiskeli, kannattaisiko niit&auml; laittaa lehteen. Jos lukijoiden mielipidett&auml; kysyt&auml;&auml;n, niin kyll&auml;. Aikoinaan lukijakyselyss&auml; saitte varmasti monenlaista palautetta.<BR><BR>
Saku-lehdiss&auml; oli/on - en tied&auml; t&auml;t&auml; nykyist&auml; muotoa - melko asiallisen ja virallisen tuntuinen "eteinen", joka toivotti uudet lukijansa tervetulleeksi: joka Sakusta saimme/saamme lukea samat virallisen yhdistyksen s&auml;&auml;nn&ouml;t ja pyk&auml;l&auml;t (ei tarvi huomauttaa, ettei niit&auml; tarvitse joka kerta lukea). K&auml;sitt&auml;&auml;kseni joukossamme on paljon hyvin nuoria ihmisi&auml;. Heid&auml;n panoksensa olisi tietysti viel&auml;kin tervetulleempi kuin meid&auml;n vanhojen tylsien setien (33 v.). Joten lapsukaiset: kirjoitelkaa raikkaita juttujanne &auml;lk&auml;&auml;k&auml; j&auml;tt&auml;k&ouml; niit&auml; "p&ouml;yt&auml;laatikoihinne". Kyll&auml; ne hyvi&auml; ovat. Nuorella i&auml;ll&auml; voivat jotkut olla turhan arkoja l&auml;hett&auml;m&auml;&auml;n omia hengentuotteitaan "virallisen yhdistyksen" lehteen.<BR><BR>
Kaikilla ihmisill&auml; on samanaikaisesti ristiriitainen sek&auml; tarve et&auml;&auml;nty&auml; toisistaan, tuntea olevansa persoonia ett&auml; luoda yhteyksi&auml; toisiin ihmisiin. Jos olisin aikoinani ostanut PC:n, olisin saattanut ostaa sen pitk&auml;lti sen psykologisen pelontunteen vuoksi, ett&auml; "Amiga ei kelpaa" so. ett&auml; olisin j&auml;&auml;nyt jotenkin "yksin", ett&auml; en olisi ollut muiden mukana atk-alan kehityksess&auml;. Hinnan lis&auml;ksi ostop&auml;&auml;t&ouml;kseen vaikuttaa ennen kaikkea tunne.<BR><BR>

</FONT><FONT SIZE=4><B>Min&auml; Amigisti Min&auml;</B></FONT><BR><BR>
<FONT SIZE=5>O</FONT><FONT SIZE=3>
nneksi minulla ei ollut varaa ostaa uusinta PC:t&auml;. Saahan PC:t&auml;kin halvalla, mutta ei uusina. Ja jos olisin ostanut vanhan PC:n, olisin tuntenut itseni ajasta j&auml;lkeenj&auml;&auml;neeksi surkimukseksi. Amiga oli se kotitietokone, johon minulla - pienell&auml; ty&ouml;tt&ouml;m&auml;ll&auml; - oli varaa uutenakin. Ja jos olisin tavallinen PC-pulliainen, en ehk&auml; olisi koskaan t&ouml;rm&auml;nnyt Sakuun. Kuinka monta verkoissa v&auml;littyv&auml;&auml; PC-harrastelijalehte&auml; Suomessa on? Varmasti niit&auml;kin on. Vai onko? Min&auml; en vain tied&auml; yht&auml;&auml;n.<BR><BR>
Amigalla on oma henkens&auml; ja psyykeens&auml;. Mielest&auml;ni se on jotenkin nuorekkaampi ja hip hop -trendikk&auml;&auml;mpi. V&auml;h&auml;n niinkuin Pepsi verrattuna Coca Colaan. ("Jollei Pepsi kelpaa, niin pyyd&auml; mummilta limsaa!") Min&auml; en halua olla yksi tavallinen tyls&auml;n PC:n omistaja. Min&auml; haluan olla Min&auml;. Minulla on Amiga. Ei sill&auml; ole minun kannaltani paljon v&auml;li&auml;, paljonko ne MIPSit ja CPU Hz:t sattuvat olemaan. Sill&auml; nyt on tietty v&auml;h&auml;n v&auml;li&auml;, ettei ole niin yhdenmukainen muiden laitteiden kanssa, mutta kivempi olla Persoona.<BR><BR>

</FONT><FONT SIZE=4><B>Onnea ja pitk&auml;&auml; ik&auml;&auml; Sakulle</B></FONT><BR><BR>
<FONT SIZE=5>S</FONT><FONT SIZE=3>
aku on nyt pysynyt hengiss&auml; kauemmin kuin mit&auml; erilaisilla pienlehdill&auml; on yleens&auml; k&auml;sitt&auml;&auml;kseni tapana. Alkuinnostus tahtoo joskus nopeasti laantua. Eri alojen pienlehti&auml; putoaa puista kuin sieni&auml; sateella. Mutta Saku on jaksanut. Ja toivottavasti jaksaa. Vaikka olisi ihme, ellei sit&auml; v&auml;lill&auml; v&auml;h&auml;n v&auml;sytt&auml;isi, kun sen on joka toinen kuukausi saatava jotain aikaiseksi - kokonaan ilman sit&auml; palkkaa, mink&auml; herra PC-atk-suunnittelija lompakkoonsa saa.<BR><BR>

<BLOCKQUOTE><I>Toteaapi Petri Keckman.</I></BLOCKQUOTE>

</FONT><FONT SIZE=4><B>Johon p&auml;&auml;toimittaja kommentoi:</B></FONT><BR><BR>
<FONT SIZE=5>A</FONT><FONT SIZE=3>
mphibia, niinp&auml; niin, miss&auml; Amphibia? Itse olin todellakin aatteen kovimpia kannattajia, mist&auml; johtuen Sakunetiss&auml; joskus sanoinkin, ettei Sakua en&auml;&auml; tule vanhassa muodossa, vaan nyt on aika siirty&auml; eteenp&auml;in, uuteen lukijaan.<BR><BR>
Niinp&auml; vain sitten k&auml;vi, ettei moinen painostus auttanut, vaan olemme taas t&auml;ss&auml; miss&auml; ennenkin, luemme lehte&auml; vanhalla lehtikoodilla. N&auml;ytti kuitenkin silt&auml;, ett&auml; parempi ett&auml; edes luemme lehte&auml; kuin ett&auml; olemme kokonaan ilman. Niinp&auml; sitten etsiskelin artikkelit k&auml;siini ja aloin v&auml;s&auml;t&auml; lehte&auml; vanhalla lehtikoodilla. Onhan t&auml;m&auml; nyt tyhj&auml;&auml; parempi - paljonkin.<BR><BR>
Mutta mit&auml; jatkossa? Ei n&auml;in voi loputtomiin jatkua, ja Jaskari on ilmoittanutkin, ettei aio luopua Amphibian kehitysty&ouml;st&auml;. Eik&auml; niin ole miss&auml;&auml;n nimess&auml; tarkoituskaan. Sen sijaan aiomme julkaista lehte&auml; vanhassa muodossa niin kauan, kun Amphibia on konkreettisesti n&auml;ht&auml;vill&auml;mme ja k&auml;ytett&auml;viss&auml;mme. Ehk&auml; yksi tai kaksi numeroa voisi menn&auml; Amphibian kanssa rinnakkainkin, jotta lukijat voisivat vaikkapa verrata vanhaa ja uutta kesken&auml;&auml;n. Toivottavasti Jaskari saa nyt ajan kanssa lehtikoodia eteenp&auml;in, sill&auml; uusi koodi on todellakin enemm&auml;n kuin tervetullut.<BR><BR>
Esimerkiksi t&auml;ss&auml; lehdess&auml; olevasta Final Writeria k&auml;sittelev&auml;st&auml; artikkelista jouduin j&auml;tt&auml;m&auml;&auml;n yhden kuvan pois, sill&auml; 640x512-resoluutioista Final Writerin n&auml;ytt&ouml;&auml; esitt&auml;v&auml;&auml; kuvaa ei saanut mill&auml;&auml;n muutettua nykyisen Sakun lehtikoodin kelpuuttamaksi kuvaksi ilman, ett&auml; kuvassa olleet tekstit menisiv&auml;t lukukelvottomiksi. Ainoa mahdollisuus olisi pilkkoa kuva kahdeksi eri kuvaksi ja julkaista kahdella eri sivulla. Eri juttu sitten onkin, onko sellaisessa mit&auml;&auml;n j&auml;rke&auml; - eip&auml; oikein. AmigaGuide-versiossa t&auml;m&auml;kin kuva on mukana - ehk&auml; AmigaGuide-versio korvaa edes osittain Amphibian puutetta, uusi AmigaGuide-toimittajamme Jari Ristiranta tekee varmasti parhaansa lehden ulkoasun eteen.<BR><BR>
Jari lupautui my&ouml;s toimittamaan uutisia Sakuun. Toivottavasti saamme jo t&auml;h&auml;n numeroon mukaan hieman infoa Amigan nykyisest&auml; tilanteesta. Itse olen kuullut vain sen verran, ett&auml; my&ouml;s VIScorp oli floppi, ja nykyinen Amigan tilanne on taas tyhj&auml;n p&auml;&auml;ll&auml;. Amigan patentti on onneksi julkistettu, joten useampi valmistaja on jo alkanut valmistaa Amiga-kloonejaan - ainakaan Amigan tekniikka ei ole viel&auml; katoamassa vanhuuttaan. Amiga kuitenkin kaipaa kovasti uudistuksia hardwareensa, joten jonkun olisi konetta kehitelt&auml;v&auml;kin tulevaisuutta ajatellen, muuten k&auml;ytt&auml;j&auml; toisensa j&auml;lkeen ryhtyy laumasieluksi ja ostaa PC:n.<BR><BR>
Monille PC on alussa kuten huumetta - hieman t&auml;m&auml;nkaltaisen johtop&auml;&auml;t&ouml;ksen voi tehd&auml; lukiessaan Heimon nykyisi&auml; mielipiteit&auml;. Itsell&auml;ni on PC ollut jo melko pitk&auml;&auml;n, kokoonpanona on t&auml;ll&auml; hetkell&auml; 100 MHz Pentium, 32 megaa muistia, AWE32-&auml;&auml;nikortti 8 Mt:n muistilla, PCI-n&auml;yt&ouml;nohjain (S3 Trio64), gigatavun verran kiintolevy&auml; ja CD-ROM-asema. Ei varmasti puutu mit&auml;&auml;n, mit&auml; kunnon PC:st&auml; puuttuisi. Modeemina voin halutessani k&auml;ytt&auml;&auml; ulkoista 33600 bps motukkaani, joka on Amigassa kiinni. Kuitenkaan tuo PC ei korvaa Amigaa oikein miss&auml;&auml;n m&auml;&auml;rin ja on j&auml;&auml;nyt l&auml;hinn&auml; pelik&auml;ytt&ouml;&ouml;n. K&auml;ytt&ouml;j&auml;rjestelmi&auml;kin siin&auml; on DOS, Windows ja OS/2. Ajoipa sitten mit&auml; tahansa k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml;, niin koneesta puuttuu sit&auml; jotain, ja se on Amigan tyylinen k&auml;ytt&ouml;liittym&auml; ja er&auml;&auml;nlainen mutkattomuus ja nopeus, vaikka Penassa v&auml;&auml;nt&ouml;&auml; onkin monta kertaa A3000:n verran. Tehosta tuntuu katoavan jonnekin suurin osa.<BR><BR>
Lis&auml;ksi PC:n ohjelmat maksavat suhteettoman paljon. PC:ss&auml; sovelletaan er&auml;&auml;nlaista Nintendo-politiikkaa, eli koneen saat halvalla, mutta softa maksaa. Mit&auml; yksinkertaisimmassakin shareware-ohjelmassa voi olla useiden satasien rekister&ouml;intimaksu, ja rekister&ouml;im&auml;t&ouml;n versio on monesti l&auml;hes k&auml;ytt&ouml;kelvoton. Puhtaasti kaupalliset ohjelmat voivat helposti maksaa useita tuhansia. Amigalle saa suuren osan ohjelmista PD:n&auml; tai sharewarena kohtuullisilla esim. muutaman kympin rekister&ouml;intimaksuilla. Esimerkiksi aikoinaan 50 markalla rekister&ouml;im&auml;ni FileMaster on niin hyv&auml;, ett&auml; se on aktiivik&auml;yt&ouml;ss&auml; edelleen, ja suunnittelen t&auml;ss&auml; l&auml;hiaikoina kaapelin rakentamista Amigan ja PC:n v&auml;lille ja er&auml;&auml;n PD-verkkosoftan asennusta, jolloin p&auml;&auml;sisin j&auml;rjestelem&auml;&auml;n FileMasterilla my&ouml;s PC:n kiintolevy&auml;, PC:ll&auml; kun ei ole yht&auml;k&auml;&auml;n l&auml;hesk&auml;&auml;n yht&auml; k&auml;yt&auml;nn&ouml;llist&auml; ohjelmaa siihen ty&ouml;h&ouml;n.<BR><BR>
Toinen todella hyv&auml; esimerkki ilmaisesta ohjelmasta Amigalle on "The Internet Movie Database". T&auml;m&auml; nyky&auml;&auml;n jo yli 200 megaa t&auml;ydellisesti asennettuna viev&auml; tietokanta k&auml;sitt&auml;&auml; laajasti tietoa elokuvista, ja siihen saa p&auml;ivityksi&auml; Internetist&auml; kerran viikossa, tiedot ovat aina ajan tasalla! Kirjoittelin t&auml;st&auml; mainiosta tietokannasta Sakussa #12 alustavasti, ja aiheesta on jossain v&auml;liss&auml; kirjoitettava lis&auml;&auml;kin. Vaikka ohjelma on ilmainen, tuki pelaa silti t&auml;ysin - pari kertaa on ollut ongelmia ohjelman kanssa, kummallakin kerralla olen saanut henkil&ouml;kohtaisen vastauksen e-maileihini ja mahdolliset bugikorjaukset ovat tulleet viivytyksett&auml;. L&ouml;ytyyk&ouml; vastaavaa palvelua yhdellek&auml;&auml;n PC:n ilmaisohjelmalle?<BR><BR>
Mit&auml; ryhm&auml;henkeen tulee, niin jotenkin tuntuu silt&auml;, ett&auml; Amiga-k&auml;ytt&auml;j&auml;t ovat todella erilaisia persoonia, sill&auml; vaatiihan omaa tahtoa omistaa ja k&auml;ytt&auml;&auml; sellaista konetta joka ei ole se "tavallinen" kaikelle kansalle tuttu - olla siis hieman erossa muusta joukosta. Kun n&auml;m&auml; persoonat ly&ouml;tt&auml;ytyv&auml;t yhteen, niin on varmaa, ett&auml; siin&auml; syntyy monenlaista uutta asiaa, ja t&auml;lt&auml; kantiltahan Saku-lehtikin on saanut alkunsa. Kaksi vuotta sitten perustettu Sakunet on my&ouml;s viime aikoina vilkastunut todella, ja nyky&auml;&auml;n viestiliikenne alkaa korvata jo n&auml;ivettyneen Suomen Fidonetin. Fidonet Suomessa on t&auml;t&auml; nyky&auml; kuolemassa byrokratiaansa, ja kuulinpa nykyiselt&auml; RECilt&auml; sellaistakin, ett&auml; joku on kavaltanut noin kymppitonnin sysopeilta ker&auml;ttyj&auml; varoja, jotka oli tarkoitettu backbone-systeemin yll&auml;pitoon. Backbonella olivat puhelinlaskut maksamatta eiv&auml;tk&auml; viestit kulkeneet. Onneksi Sakunetiss&auml; ei sohlata rahojen kanssa, niin ettei kukaan voi kavaltaa ket&auml;&auml;n, ja verkosta voisi t&auml;ll&auml; tavoin tulla pitk&auml;ik&auml;isempi.<BR><BR>
<BLOCKQUOTE><I>Esa Heikkinen</I></BLOCKQUOTE>

<TABLE WIDTH=100%>
<TR><TD ALIGN=RIGHT><A HREF="Postit.html"><I>Paluu takaisin postipalstalle</I></A></TD></TR>
</TABLE>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>