<HTML>
<HEAD>
<TITLE>Posti: Com 2001</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Posti: Com 2001</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Anu Seilonen</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>T</FONT><FONT SIZE=3>
&auml;ss&auml; Sakussa Sami Klemola kirjoittaa Mietteit&auml;-artikkelissaan yrityksist&auml;, joita kannattaa varoa. Artikkelissa on mainittu my&ouml;s Oulussa myym&auml;l&auml;&auml; pit&auml;nyt postimyyntiyritys, Com 2001. Kohtalaisen l&auml;helt&auml; yrityksen toimintaa seuranneena haluaisin hieman tarkentaa ja lis&auml;t&auml; muutamia asioita.<BR><BR>
Com 2001 Oy on tuolla nimell&auml; lopettanut toimintansa jo vuonna 1995 er&auml;iden tietojen mukaan "kirjanpitoep&auml;selvyyksien" takia. Kaipaamaan j&auml;iv&auml;t mm. lukuisat oululaiset paikallisasiakkaat, joille lopun edell&auml; myytiin kaikki myym&auml;l&auml;n nurkkiin kertynyt toimimatonkin roina aina peleist&auml; oheistarvikkeisiin. My&ouml;s postimyynniss&auml; oli myyty toimimatonta tavaraa yht&auml; suruttomasti. Mit&auml;&auml;n oikeuksia huijatuksi tulleelle asiakkaalle ei j&auml;&auml;nyt, sill&auml; yrityst&auml; ei ollut en&auml;&auml; olemassakaan kantamaan vastuuta tekosistaan.<BR><BR>
Liikkeen lehtimainoksissa ollut "Reilun Pelin J&auml;sen" -merkki oli siis l&auml;hinn&auml; huono vitsi. Olisi mielenkiintoista tiet&auml;&auml;, miten Suomen Suoramarkkinointiliitto valvoo yrityksi&auml;, joille se on merkin my&ouml;nt&auml;nyt. Merkin saadakseen yrityksen t&auml;ytyy osoittaa markkinoinnillaan "lain ja hyvien tapojen noudattamista" sek&auml; "rehellisyytt&auml; ja totuudenmukaisuutta". Kumpaakaan vaatimusta yrityksen toiminta ei t&auml;ytt&auml;nyt, vaikka markkinointi ehk&auml; antoikin muuta ymm&auml;rt&auml;&auml;. V&auml;rikk&auml;&auml;t aukeman kokoiset mainokset kyll&auml; her&auml;tt&auml;v&auml;t huomiota.<BR><BR>
Samin mainitsemat maksulliset palvelunumerot olivat minunkin mielest&auml;ni selv&auml;&auml; asiakkaiden rahastusta. Mit&auml; muutakaan ne voisivat olla, kun sek&auml; tilauspuhelin ett&auml; jopa faksilinja maksoivat asiakkaalle 5,30 mk/min + ppm! Myymist&auml;&auml;n tuotteista yritys tiesi harvoin enemp&auml;&auml; kuin nimen, hinnan ja mahdollisen saatavuuden. "Sivutuotteena" mainostettu, maksullinen (249 mk/12 numeroa) Gamer-"pelilehti" oli sekin kovin heppoinen asiapitoisuudeltaan.<BR><BR>
Com 2001 h&auml;ipyi markkinoilta kaikessa hiljaisuudessa, mutta ehti ennen katoamistaan saada paljon pahaa aikaan sek&auml; tietokonealan postimyyntiyritysten maineelle ett&auml; muille pelikauppiaille. Paha ei siis aivan saanut palkkaansa, mutta j&auml;ttik&ouml; edes markkinat rauhaan?<BR><BR>
Sit&auml; siet&auml;&auml; mietti&auml;. Viime vuonna v&auml;rikk&auml;ill&auml; aukeaman kokoisilla lehti-ilmoituksillaan her&auml;tti huomioni "uusi" alan yritys. Alkuvuonna 1996 se kulki viel&auml; nimell&auml; Hit Games Power Oy, mutta on nyttemmin n&auml;k&ouml;j&auml;&auml;n muuttanut nimens&auml; Web Direct Oy:ksi, ilmoitus on pysynyt muuten samana. Ja yll&auml;tys yll&auml;tys, yrityksen (maksulliset, totta kai) puhelinnumerot ovat nimenmuutoksen j&auml;lkeen t&auml;sm&auml;lleen samat kuin edesmenneell&auml; Com 2001:ll&auml;. Aiemmin mainittujen maksullisten tilaus- ja faksinumeroiden lis&auml;ksi yrityksell&auml; on my&ouml;s tekninen tukipuhelin, joka maksaa sekin - 5,30 mk/min + ppm...<BR><BR>
Verratkaapa joskus huviksenne yritysten mainoksia. Com 2001:n viimeiset lehtimainokset n&auml;htiin esim. Pelit-lehden ja MikroBitin ensimm&auml;isiss&auml; numeroissa vuonna 1995. Hit Games Power Oy "ilmestyi kuvioihin" maaliskuun tienoilla 1996, ja ilmoituksissa nimi muuttui Web Direct Oy:ksi kes&auml;ll&auml; 1996. Mik&auml;li mit&auml;&auml;n samankaltaisuutta ette l&ouml;yd&auml;, vikaa t&auml;ytyy olla katsojan silmiss&auml;. Erojakin on, ainakin muutama oleellinen: uudella yrityksell&auml; ei ole suoramyym&auml;l&auml;&auml; eik&auml; Reilun Pelin J&auml;sen -merkki&auml;... Pid&auml;n kaikin puolin muutenkin ep&auml;ilytt&auml;v&auml;n&auml; ja ep&auml;miellytt&auml;v&auml;n&auml; l&auml;hesty&auml; yrityst&auml;, jonka ainoat yhteystiedot ovat maksulliset palvelupuhelinnumerot ja postilokero-osoite.<BR><BR>
Mit&auml; t&auml;st&auml; opimme? Atk-alan postimyyntiyrityksi&auml; on Suomessa useita, ja omien kokemuksieni mukaan l&auml;hes kaikkialla palvelu on ollut moitteetonta ja toiminta asiakkaan kannalta turvallista. Vastuu on kannettu silloin kun siihen on ollut aihetta. On kuitenkin yksi yritys, jonka tarjouksiin min&auml; en tartu t&auml;n&auml; p&auml;iv&auml;n&auml; pitk&auml;ll&auml; tikullakaan. Mik&auml;, sen p&auml;&auml;telk&ouml;&ouml;n kukin itse.<BR><BR>
Joka tapauksessa miettik&auml;&auml;, mist&auml; tarvikkeenne tilaatte. Kokemus voi olla tyrmistytt&auml;v&auml; kantap&auml;&auml;n kautta hankittuna.<BR><BR>

<BLOCKQUOTE><I>Anu Seilonen</I></BLOCKQUOTE>
<TABLE WIDTH=100%>
<TR><TD ALIGN=RIGHT><A HREF="Postit.html"><I>Paluu takaisin postipalstalle</I></A></TD></TR>
</TABLE>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>

