<HTML>
<HEAD>
<TITLE>Posti: Tuomas Sandroosille</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Posti: Tuomas Sandroosille</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Sami Klemola</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>S</FONT><FONT SIZE=3>
akussa #18 Tuomas Sandroos ihmetteli PC:n yleisyytt&auml; ja kauhisteli PC-laitteiden hintoja. Ilmeisesti tiedossasi, Tuomas, ei ole, mit&auml; rahalla saa. Kautta aikainhan tilanne on ollut se, ett&auml; Amiga ja muut merkkikoneet ovat maksaneet enemm&auml;n kuin kloonatut IBM:t. Nyky&auml;&auml;n hintaero on vain kasvanut. PC:t ovat entist&auml; halvempia.<BR><BR>
Rahaa tarvitsee latoa p&ouml;yt&auml;&auml;n kuutisen tuhatta markkaa, niin saa jo tehokkaan Pentium-koneen, jossa on kaikki valmiina. Vastaava A4000 maksaa varmaan tuplasti, ja sekin pit&auml;&auml; tilata postimyynnist&auml; ja odottaa ennen kuin sen saa. Se, ett&auml; PC:hen pit&auml;&auml; hankkia erikseen kaikki, ei muuta asiaa. Silti Amiga on selv&auml;sti kalliimpi. Kaupoista sit&auml; paitsi saa valmiita PC-koneita, eik&auml; niit&auml; tarvitse itse kasata eri paikoista haalituista osista.<BR><BR>
Edelleen, nyky&auml;&auml;n kaikki ohjelmat ovat PC:lle (tai Macille). Aivan poikkeuksetta mit&auml;&auml;n nk. tietosanakirjaromppua tai yht&auml;&auml;n mit&auml;&auml;n ei saa Amigan ohjelmilla varustettuna. Amigan tuki on olematon. Sit&auml; ei saa mist&auml;&auml;n, sille ei saa ohjelmia eik&auml; laajennuksia, eik&auml; sit&auml; huolleta miss&auml;&auml;n. Postille kun tekee lahjoituksia, saa jotain, mutta kun tilanne PC:ll&auml; on hiukan toinen, ei rivik&auml;ytt&auml;j&auml;n ole j&auml;rkev&auml;&auml; pysy&auml; Amigassa.<BR><BR>
Viimeist&auml;&auml;n t&auml;ss&auml; vaiheessa jokaisen on syyt&auml; hankkia PC. Sille saa kunnon nettisoftat, jotka toimivat, ja ainoan oikean browserin, Netscape Navigatorin. Her&auml;t&auml;&auml;nh&auml;n unesta. Aika on ajanut Amigan ohi. Amigasta ei tule en&auml;&auml; koskaan yht&auml;&auml;n mit&auml;&auml;n. Inhottaa k&auml;ytt&auml;&auml; huonompia PC-koneita, mutta kun ne kehittyv&auml;t ja Amiga ei ja niille saa kaikki uudet pelit ja muut softat, ei ole en&auml;&auml; vaihtoehtoa.<BR><BR>

<BLOCKQUOTE><I>Sami Klemola, Ummeljoki</I></BLOCKQUOTE>

<TABLE WIDTH=100%>
<TR><TD ALIGN=RIGHT><A HREF="Postit.html"><I>Paluu takaisin postipalstalle</I></A></TD></TR>
</TABLE>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
