<HTML>
<HEAD>
<TITLE>Posti: Amigalla Nettiin</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Posti: Amigalla Nettiin</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Ormod</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<BLOCKQUOTE><I>"Ja mit&auml; siihen Internet-k&auml;ytt&ouml;&ouml;n tulee, niin mit&auml; webbailua se on ilman Netscape-plugineja? Sanokoot ihmiset mit&auml; tahansa Lynxist&auml; ja Mosaicista, mutta verkossa on kohtapuoliin suhteellisen tyls&auml;&auml; ilman java-tulkkia, Shockwave-laajennusta, Reel-audio-laajennusta, blokittaisten giffien tukea tai Microsoft-Exploreriin tulevaa Active-X-tukea. Kyll&auml;h&auml;n tietoa ja tavaraa l&ouml;ytyy perinteisestikin toteutetuilla WWW-sivuilla, mutta viihde ja ne todelliset killer-sovellukset tehd&auml;&auml;n jollain muulla kuin perus-HTML-kielell&auml;. Ja miss&auml; silloin on Amiga?"</I><BR><BR>
N&auml;in kirjoitti Heimo Laukkanen Posti-palstalle Sakuun #19.</BLOCKQUOTE>
<HR width=40% size=1 align=CENTER>
</FONT><FONT SIZE=5>N</FONT><FONT SIZE=3>
o enp&auml; tied&auml;, tuleeko verkossa olemaan tyls&auml;&auml; ilman Java-tulkkia, mutta vaikka tulisikin, niin mit&auml; sill&auml; on Amigistinkin kannalta v&auml;li&auml;? Amigallekin on tulossa Javaan pystyv&auml; WWW-selain nimelta p'jami. Lis&auml;tietoja siit&auml; saat seuraavalta sivulta: <A HREF="http://www.sss.co.uk/~nt/hotjava.html"><I>http://www.sss.co.uk/~nt/hotjava.html</I></A><BR><BR>
Tietenkin my&ouml;s muut selaimet ryhtyv&auml;t varmaan kohtapuoliin tukemaan Javaa. Amigalla tuskin kukaan en&auml;&auml; surffaa Amosaicilla tai Lynxilla. A500-k&auml;ytt&auml;j&auml;tkin ovat jo varmaan siirtyneet AWebiin, jossa ainakin mainittiin tuleviin parannuksiin Java-tulkki. Voi kyll&auml; olla, ettei Amigalle saa t&auml;t&auml; Active-X-tukea, mutta luulisin kyll&auml;, ett&auml; nuo blokittaiset giffit joku koodaaja r&auml;velt&auml;&auml; Amigallekin. Muutenkin Amiga on mielest&auml;ni suhteellisen hyv&auml; kone Internet-k&auml;ytt&ouml;&ouml;n.<BR><BR>
<BLOCKQUOTE><I>Ormod</I><BR>
<CODE><B>email:</B> <A HREF="mailto:ormod@sci.fi"><I>ormod@sci.fi</I></A></CODE>
</BLOCKQUOTE>
<TABLE WIDTH=100%>
<TR><TD ALIGN=RIGHT><A HREF="Postit.html"><I>Paluu takaisin postipalstalle</I></A></TD></TR>
</TABLE>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>