<HTML>
<HEAD>
<TITLE>Amiga Q-Drive 1241 - Nelinopeuksinen CD-ROM Amiga 1200:aan</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=4 FACE="Arial" color="#109f00"><B><I>Amiga Q-Drive 1241 - Nelinopeuksinen CD-ROM Amiga 1200:aan</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR><BR>
  <FONT SIZE=3><B>Janne Siren</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>C</FONT><FONT SIZE=3>
D-ROM on yleistym&auml;ss&auml; Amigalla kiitett&auml;v&auml;&auml; vauhtia. Vaikka levykkeet ovatkin viel&auml; yleisin levitysmedia, osa ohjelmista ilmestyy vain rompulla ja useista on vaihtoehtoinen, usein laajennettu CD-versio. Q-Drive on Amiga Technologiesin julkaisema nelinopeuksinen CD-ROM-asema A1200:aan. Mallinumero 1241 on kunnianosoitus C64:n legendaariselle lerppuasemalle, 1541:lle. Periaatteessa aseman pit&auml;isi sopia my&ouml;s A600:aan, mutta tiedustellessani asiaa Amiga Technologiesilta he eiv&auml;t osanneet sanoa varmaksi - ep&auml;iliv&auml;t, riitt&auml;&auml;k&ouml; koneen teho.<BR><BR>
Q-Drive on helppo asentaa. Se liitet&auml;&auml;n v&auml;lijohdolla koneen vasemmassa reunassa olevaan PCMCIA-paikkaan ja ulkoisella virtal&auml;hteell&auml; s&auml;hk&ouml;verkkoon. Lis&auml;ksi CD-musiikkeja varten Amigan &auml;&auml;niulostulot kierr&auml;tet&auml;&auml;n Q-Driven kautta. Asennus on t&auml;ysin plug and play: mit&auml;&auml;n jumppereita ei ole, eik&auml; ajurien siirt&auml;minen kiintolevylle vaadi kuin muutaman hiirennapin painalluksen. Ajurilevykkeen lis&auml;ksi aseman mukana tulee kiintolevytt&ouml;mille k&auml;ynnistyslevyke, jonka avulla Q-Drive&auml; voi k&auml;ytt&auml;&auml; suoraan ilman mit&auml;&auml;n ohjelmistoasennuksia.<BR><BR>
Itse CD-ROM-asema on tavanomainen. Etupaneelista l&ouml;ytyy kuulokeliit&auml;nt&auml;, &auml;&auml;nenvoimakkuuden s&auml;&auml;din ja eject-nappi. Levyt sy&ouml;tet&auml;&auml;n motorisoidun kelkan avulla ja asema toimii my&ouml;s kyljelleen asetettuna, kiitos levy&auml; putoamasta est&auml;vien pidikkeiden. Q-Drive osaa tavallisten romppujen lis&auml;ksi soittaa CD-&auml;&auml;nilevyj&auml;, ja valmistajan mukaan my&ouml;s PhotoCD- ja multisession-levyt kelpaavat - mukana tullut PhotoCD-katseluohjelma tosin kaatuili jatkuvasti. Testikappaleen IDE-liit&auml;nt&auml;inen CD-ROM-mekanismi oli Matsushitan valmistama (CR-581-M) ja saavutti parhaimmillaan siirtonopeuden 600 kt/s.<BR><BR>
CD-&auml;&auml;nilevyjen soittoon ja PhotoCD-kiekkojen katseluun tarkoitettujen ohjelmien lis&auml;ksi aseman mukana tulee CD32-emulaattori, joka mahdollistaa joidenkin muuten ep&auml;yhteensopivien CD32-pelien toimimisen. Lis&auml;ksi CD-n&auml;lk&auml;&auml; lievitt&auml;v&auml;t kaksi oheisromppua: Meeting Pearls III ja Amiga Plus 1/96 -kokoelmat sis&auml;lt&auml;v&auml;t yhteens&auml; toista gigatavua julkisohjelmia, kuvia, animaatioita ja musiikkimoduuleita.<BR><BR>
Hintatietoiset varmasti kauhistelevat Q-Driven 1290 markan hintalappua, sill&auml; liitt&auml;m&auml;ll&auml; itse koneeseen tavallisen ATAPI-aseman voi p&auml;&auml;st&auml; paljonkin halvemmalla. J&auml;lkimm&auml;inen ratkaisu vaatii kuitenkin siin&auml; m&auml;&auml;rin viritt&auml;mist&auml;, ett&auml; Q-Drive korkeahkosta hinnastaan huolimatta puolustaa varsin hyvin paikkaansa helppona ja tyylikk&auml;&auml;n&auml; pakettiratkaisuna.<BR><BR>

<TABLE WIDTH=100% COLS=2 BORDER=0>
<TR>
    <TD WIDTH=100% COLSPAN=2><CODE><B>Amiga Q-Drive 1241</B></CODE></TD>
</TR>
<TR>
    <TD WIDTH=25%><B><CODE>Lyhyesti:</CODE></B></TD>
    <TD WIDTH=75%><CODE>Ulkoinen nelinopeus-CD-ROM Amiga 1200:aan.</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Hinta:</CODE></B></TD>
    <TD><CODE>1290 mk</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Edustaja:</CODE></B></TD>
    <TD><CODE>AIC Systems Oy</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Puhelin:</CODE></B></TD>
    <TD><CODE>(09) 8817 0004</CODE></TD>
<TR>
</TABLE>
</FONT>

<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>

