<HTML>
<HEAD>
<TITLE>Isojalan j&auml;ljill&auml;</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=4 FACE="Arial" color="#109f00"><B><I>Isojalan j&auml;ljill&auml; - Quantum Bigfoot 2550A 5,25" kiintolevy</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR><BR>
  <FONT SIZE=3><B>Jaakko Suvanto</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>K</FONT><FONT SIZE=3>
iintolevytilaa ei ikin&auml; ole liikaa. Joskus se aina loppuu, useimmiten liian nopeasti. Kiintolevyvalmistajatkin ovat olleet asiasta tietoisia, ja kilpajuoksu aina vain suurempaan tallennuskapasiteettiin k&auml;y hurjana.  Viimeisimp&auml;n&auml; ilmi&ouml;n&auml; on paluu halkaisijaltaan 5,25" levyihin. Quantum v&auml;itt&auml;&auml; suuremman halkaisijan alentavan tuotantokustannuksia, sallivan entist&auml; suuremman tallennuskapasiteetin ja eritt&auml;in nopean suurikokoisten tiedostojen k&auml;sittelyn.<BR><BR>
Bigfoot 2550 oli ostohetkell&auml; hein&auml;kuun alussa megatavuissa mitattuna markkinoiden suurin IDE-levy, jonka onnistuin l&ouml;yt&auml;m&auml;&auml;n. Toinen vaihtoehto olisi ollut Seagaten 2,1-gigainen 3,5" levy, mutta huonot kokemukset Amiga-boksik&auml;yt&ouml;ss&auml; sek&auml; A1200:ani 2,5" 170 Mt Seagaten lompakkoa riipiv&auml; resetointi&auml;&auml;ni eiv&auml;t puoltaneet Seagaten valintaa.  Lis&auml;ksi hintakin oli sama ja Quantum edusti uutta tekniikkaa, jota oli kokeiltava, joten p&auml;&auml;dyin Bigfootiin.<BR><BR>
Levy vastaa pohjapinta-alaltaan CD-ROM-asemaa, mutta on vain 18 mm korkea, joten asennus onnistuu aika helposti A4000:n 5,25" laajennuspaikkaan, johon levyj&auml; mahtuisi vaikka kaksi p&auml;&auml;llekk&auml;in. Jos taas paikan varaa CD-ROM, asia mutkistuu. Sek&auml; koneen peltikoteloa ett&auml; kiintolevykehikkoa on sahailtava, muttei paljon. Levy tulee CD-ROM:in alle, ja levyn ja prosessorikortin v&auml;liin j&auml;&auml; n. 1,5 cm tyhj&auml;&auml; tilaa.<BR><BR>
Kiihdytys k&auml;ytt&ouml;nopeuteen kest&auml;&auml; kauan, eik&auml; kone ehdi l&ouml;yt&auml;&auml; asemaa ennen koneen k&auml;ynnistymist&auml;. Ongelmasta selvi&auml;&auml; resetill&auml;, ja se ilmenee vain virtaa kytkiess&auml; eik&auml; haittaa yht&auml;&auml;n ainakaan minua. Osioin levyn nelj&auml;&auml;n osaan, ja alustettuna levytilaa l&ouml;ytyy massiiviset 2456 megatavua. Levy toimii oikein n&auml;tisti, on hiljainen ja k&auml;yt&auml;nn&ouml;ss&auml; aika nopeakin, jos ei nyt ihan nopean SCSI-levyn veroinen. Alustus sujui todella nopeasti, koko levy oli alustettu alle 15 minuutissa. Vertailuksi vanhemman 130-megaisen Quantumin alustaminen kesti saman verran.<BR><BR>
Nopeudet on mitattu Sysinfolla, jonka lukemiin on joskus syyt&auml; suhtautua varauksella. Seagaten 2,5" levy liitettyn&auml; A1200 + 030-turboyhdistelm&auml;&auml;n antaa lukunopeudeksi 1 185 000 bytes/sec. Quantum liitettyn&auml; A4000 EC030-koneeseen potkaisee 2 829 000 bytes/sec. Kummassakin koneessa on IDEFix, joka hiukan nostaa lukunopeuksia. Vertailun vuoksi kytkin Quantumin A1200:n IDEFixin kakkosliittimeen, mutta nyt nopeutta oli vain n. 1 800 000 bytes/sec. Vika voi olla A4000:n ja A1200:n eroissa tai IDEFixiss&auml;, joten tutki asia ennen kuin liit&auml;t levyj&auml; IDEFixin kakkosliittimeen.<BR><BR>
Bigfoot 2550A edustaa ensimm&auml;ist&auml; sukupolvea uusissa 5,25" levyiss&auml;, ja my&ouml;s muilta valmistajilta on tulossa omat mallinsa. N&auml;ille levyille povataankin entist&auml; huomattavasti suurempia kapasiteetteja ja suorastaan naurettavan edullista hinta/megatavu-suhdetta. Joten nyt kannattaakin aloittaa p&auml;hk&auml;ily suuren levyn sijoittamiseksi muutenkin ahtaaseen koneeseen, sill&auml; se kannattaa. A1200:n omistajat tarvitsevat my&ouml;s tehokkaamman virtal&auml;hteen, sill&auml; levy vie startissa niin paljon virtaa, ett&auml; emolevy j&auml;&auml; ilman. Paljon levytilaa tarvitsevat tornimallin omistajat taitavatkin jo hykerrell&auml; ja hieroa k&auml;si&auml;&auml;n yhteen...<BR><BR>

</FONT><FONT SIZE=4><B>Teknist&auml; tietoa:</B></FONT><BR><BR>
<FONT SIZE=3>
<TABLE WIDTH=100% BORDER=0>
<TR>
    <TD WIDTH=25%><CODE><B>Pituus:</B></CODE></TD>
    <TD WIDTH=75%><CODE>n. 200mm</CODE></TD>
</TR>
<TR>
    <TD><B><CODE>Leveys:</CODE></B></TD>
    <TD><CODE>n. 143 mm</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Korkeus:</CODE></B></TD>
    <TD><CODE>n. 18 mm</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Liit&auml;nt&auml;:</CODE></B></TD>
    <TD><CODE>Fast-ATA2</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Keskim. hakuaika:</CODE></B></TD>
    <TD><CODE>15 ms</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Keskim. virrankulutus:</CODE></B></TD>
    <TD><CODE>n. 0,5A (sek&auml; 5V ett&auml; 12V)</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Py&ouml;rint&auml;nopeus:</CODE></B></TD>
    <TD><CODE>Lujaa py&ouml;rii...  =)</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Hinta:</CODE></B></TD>
    <TD><CODE>ovh. 1995,- (7/96)</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Mist&auml; saa:</CODE></B></TD>
    <TD><CODE>Itse ostin PT-Datasta Piikki&ouml;st&auml;, puh. (02) 4796013</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Takuu:</CODE></B></TD>
    <TD><CODE>3 vuotta (Laitteen rev. on A01, saa n&auml;hd&auml; onko lastentauteja...)</CODE></TD>
<TR>
</TABLE></FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>