<HTML>
<HEAD>
<TITLE>Saku Trek</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Saku Trek</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Anu Seilonen</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>

<FONT SIZE=4><B>30 vuotta Star Treki&auml;</B></FONT><BR><BR>

<FONT SIZE=5>S</FONT><FONT SIZE=3>
tar Trekin ensimm&auml;inen jakso l&auml;hetettiin Yhdysvalloissa 8.9.1996. T&auml;n&auml;&auml;n, yli 30 vuotta my&ouml;hemmin, Star Trek el&auml;&auml; ja voi hyvin. "<I>Klassisen</I>" Star Trekin ja animoidun Star Trekin lis&auml;ksi my&ouml;s The Next Generation (Uusi sukupolvi) on saatu p&auml;&auml;t&ouml;kseen. Kaksi sarjaa, Deep Space Nine ja Voyager, jatkuu edelleen. Syntym&auml;p&auml;ivi&auml; juhlistamaan valmistui viime vuonna my&ouml;s kahdeksas Star Trek -elokuva.<BR><BR>
Suomalaiset Star Trekin kannattajat ovat aina olleet ja ovat edelleenkin lapsipuolen asemassa. Sarjan historia Suomessa on kovin lyhyt. TV2 esitti alkuper&auml;issarjaa nimell&auml; "<I>Avaruusmatka</I>" vuodesta 1974, entinen Kolmostelevisio uusi sarjan vuosina 1987-89 ja esitti lis&auml;ksi The Next Generationia kolmannen kauden loppuun asti vuosina 1990-92. Nykyinen PTV4 nappasi vuonna 1993 Star Trekin esitysoikeudet Suomessa ja esitti loput TNG:n jaksot, viimeisen syyskuussa 1996.<BR><BR>
Puolen vuoden vetkuttelun j&auml;lkeen Deep Space Nine alkanee PTV4:ll&auml; maaliskuun 3. p&auml;iv&auml;n&auml;. (Sarjaa on p&auml;&auml;ssyt katsomaan my&ouml;s maksullisella TV1000-kaapelikanavalla.) Valitettavasti vain kaapelin omistavat p&auml;&auml;sev&auml;t ilosta osalliseksi, PTV4 kun on toistaiseksi vain kaapelikanava. Olettaisin kuitenkin sarjan jatkuvan uudella neloskanavalla, joksi PTV4 "<I>sulautuu</I>" t&auml;m&auml;n vuoden lopussa. (Deep Space Ninesta voit lukea lis&auml;&auml; Sakusta #15.)<BR><BR>

</FONT><FONT SIZE=4><B>Star Trek: First Contact</B></FONT><BR><BR>
<FONT SIZE=3>
<IMG SRC="Kuvat/Borg.JPG" ALT="Borg" ALIGN=LEFT HSPACE=10 BORDER=3>
<I>"The Borg are back and there's gonna be trouble, hey na hey na..."</I><BR><BR>
</FONT><FONT SIZE=5>V</FONT><FONT SIZE=3>
iime vuonna valmistuneessa ja Yhdysvalloissa 22. marraskuuta 1996 ensi-iltansa saaneessa kahdeksannessa Star Trek -elokuvassa, Star Trek: First Contactissa, ei ole mukana yht&auml;&auml;n alkuper&auml;ismiehist&ouml;n j&auml;sent&auml;, joten se on ensimm&auml;inen pelk&auml;st&auml;&auml;n Uuden sukupolven voimin tehty elokuva. Soihtuhan tavallaan siirrettiin uudelle sukupolvelle kuljetettavaksi edellisess&auml; elokuvassa (Generations, 1994).<BR><BR>
Mukana ovat kaikki tutut (Picard, Riker, Data, Troi, LaForge, Worf, Dr. Crusher, Barclay) ja muutamia muita nimekk&auml;it&auml; ja tuttujakin n&auml;yttelij&ouml;it&auml; on remmiss&auml;: Alice Krige, Ethan Phillips (Voyagerin Neelix), Robert Picardo (Voyagerin holotohtori "<I>Doc Zimmerman</I>"), James Cromwell (Oscar-ehdokas elokuvasta "<I>Babe</I>"), Jack Shearer, Neal McDonough, Alfre Woodard ja Patti Yasutake (sairaanhoitaja Ogawa TNG:sta ja Generationsista). Elokuvan on ohjannut komentaja Rikerina paremmin tunnettu Jonathan Frakes. First Contactin Star Trek -elokuville kohtalaisen mojova 45 miljoonan dollarin budjetti n&auml;kyy my&ouml;s teknisess&auml; laadussa ja tasokkaissa erikoistehosteissa. Borgeista on tehty entist&auml;kin enemm&auml;n Alienin kaltaisia.<BR><BR>
<I><B>(VAROITUS! Mik&auml;li et halua tiet&auml;&auml; elokuvan juonta etuk&auml;teen, j&auml;t&auml; kaksi seuraavaa kappaletta lukematta!)</B></I><BR><BR>
<HR width=20% size=2 align=CENTER>
</FONT><FONT SIZE=5>B</FONT><FONT SIZE=3>
orgit ovat palanneet. N&auml;m&auml; kyberorganismit ovat j&auml;lleen p&auml;&auml;tt&auml;neet valloittaa Maan ja sulauttaa ihmiset kollektiiviinsa. Puolueettomalle alueelle partioimaan l&auml;hetetty Enterprise-E rikkoo Picardin k&auml;skyst&auml; m&auml;&auml;r&auml;yksi&auml; tilanteen n&auml;ytt&auml;ess&auml; Federaation kannalta toivottomalta ja yritt&auml;&auml; est&auml;&auml; borgien aikeet. T&auml;m&auml; onnistuukin osittain, mutta Enterprise matkaa borgien per&auml;ss&auml; ajassa taaksep&auml;in kolmannen maailmansodan j&auml;lkeisiin p&auml;iviin vuoteen 2063 (sarjan "<I>Space: Above and Beyond</I>" katsojat l&ouml;yt&auml;nev&auml;t vuosiluvusta jotain tuttua), ennen kuin tiedemies Zefram Cochranen (James Cromwell), tulevaisuudessa poimuajon keksij&auml;n, ratkaisevan lennon pit&auml;isi onnistua ja ihmiskunnan saada ensikontakti ja alustaa rauhanomaiset suhteet avaruuden muukalaisiin.<BR><BR>
Mik&auml;li borgit onnistuvat est&auml;m&auml;&auml;n lennon, ihmiskunta ei koskaan p&auml;&auml;se luomaan tuota ensikontaktia (t&auml;st&auml; tulee my&ouml;s elokuvan nimi: First Contact) ja borgeilla on helppo teht&auml;v&auml; valloittaa tulevaisuuden Maa. Ihmiskunnan 400 vuoden historian lis&auml;ksi vaa'assa painavat my&ouml;s kapteeni Picardin henkil&ouml;kohtaiset tunteet borgeja kohtaan (ks. TNG:n jaksot "<I>The Best of Both Worlds</I>" I + II). Tarkemmat juonenk&auml;&auml;nteet j&auml;tett&auml;k&ouml;&ouml;n kertomatta mahdollisten katsojien iloksi.<BR>
<HR width=20% size=2 align=CENTER><BR>
Elokuvan Suomen ensi-ilta on ollut tammikuun alussa. Trekkereille elokuva on todella v&auml;ltt&auml;m&auml;t&ouml;n katsomiskokemus, sill&auml; kyseess&auml; on kenties paras Star Trek -elokuva. Lipputuloinakin elokuva ker&auml;si Yhdysvalloissa vuoden 1996 loppuun menness&auml; liki 90 miljoonaa dollaria, mik&auml; on todella hyvin Trek-elokuvalle. Mainittakoon, ett&auml; ainoastaan The Voyage Home (Star Trek IV) on tienannut enemm&auml;n; se ker&auml;si teattereissa kokonaisuudessaan n. 110 miljoonaa dollaria. First Contact tosin py&ouml;rii teattereissa viel&auml;kin, joten todenn&auml;k&ouml;isesti se ohittaa TVH:n lipputulot jossain vaiheessa.<BR><BR>
Joka tapauksessa elokuva kannattaa ehdottomasti k&auml;yd&auml; katsomassa, olit sitten trekkeri tai muuten vain scifin yst&auml;v&auml;. Elokuva toimii sellaisenaankin, joten v&auml;ltt&auml;m&auml;t&ouml;nt&auml; ei Star Trekin maailman tai TNG:n tunteminen ole, joskin se tuo lis&auml;ulottuvuuksia elokuvaan.<BR><BR>
<CENTER><B>Menk&auml;&auml; ihmeess&auml; katsomaan.</B></CENTER><BR>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>