<HTML>
<HEAD>
<TITLE>N&auml;inkin voi k&auml;yd&auml;</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>N&auml;inkin voi k&auml;yd&auml;</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Samppa R&ouml;nk&auml;</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<BLOCKQUOTE><I>
'Hajotettuani kiintolevyni ja painettuani levyaseman
 dippikytkimen sis&auml;&auml;n aloin jo hermostua.'
</I></BLOCKQUOTE>

<FONT SIZE=5>O</FONT><FONT SIZE=3>
li kaunis p&auml;iv&auml;. K&auml;velin ulkona er&auml;&auml;n kaverini kanssa. H&auml;n oli kuullut jostain, ett&auml; Amiga Technologiesin Amiga 1200:n levyasema onkin HD-asema, joka on jumpperoitu DD-asemaksi. H&auml;n kertoi, ett&auml; levyaseman sis&auml;ll&auml; v&auml;lkkyv&auml; vihre&auml; ledi todistaa asian: se oli tarkoitettu v&auml;lkkym&auml;&auml;n PC:n kotelossa. My&ouml;s se, ett&auml; HD-levykkeet piti teipata vasemmasta yl&auml;kulmasta jos niit&auml; aikoi A1200:ssa k&auml;ytt&auml;&auml;, oli hyv&auml; todiste. Mietimme, mahtaisimmeko osata tehd&auml; DD-asemasta HD-aseman. Kun seuraavana p&auml;iv&auml;n&auml; mietiskelin asiaa uudemman kerran, p&auml;&auml;tin katsoa, onko se mahdollista.<BR><BR>
Ruuvailin koneeni ruuveja iloisesti vihellellen auki. Se ei ollut ensimm&auml;inen kerta, ja luulin ettei mit&auml;&auml;n voisi k&auml;yd&auml;. Avattuani koneen huomasin heti, ett&auml; kiintolevyni lattakaapeli voisi olla viel&auml;kin tiiviimmin koneen sis&auml;ss&auml;. Painoin sit&auml; varovaisesti koneen emolevy&auml; vasten. Kuulin pient&auml; rusahtelua, mutta en v&auml;litt&auml;nyt siit&auml;. Seuraavaksi ruuvailinkin jo levyasemaa irti. Kun sain sen k&auml;teeni, aloin heti etsi&auml; mahdollisia jumppereita tai muita vastaavia, joilla voisi olla jotakin tekemist&auml; asian kanssa.<BR><BR>
V&auml;h&auml;n aikaa etsiskelty&auml;ni l&ouml;ysin levyaseman alta kytkimen. Se oli DD-asennossa. Toinen mahdollisuus oli D1-asento. Tietty k&auml;&auml;nsin heti sit&auml; pient&auml; kytkint&auml; ruuvimeisselin k&auml;rjell&auml;. Sitten vain kaapelit kiinni ja kokeilemaan. Laitoin virran p&auml;&auml;lle. Kiintolevyni moottori aloitti toimintansa, mutta sitten tapahtui jotakin outoa. Ruutuun ilmestyi Amigan kehotus sy&ouml;tt&auml;&auml; k&auml;ynnistyslevyke asemaan. Ajattelin, ett&auml; se johtui siit&auml; kytkimest&auml;, joten ty&ouml;nsin WorkBench-levykkeen asemaan. Levyasema ei inahtanutkaan. Siit&auml; innostuneena k&auml;vin etsiskelem&auml;&auml;n muita kytkimi&auml;, mutta en l&ouml;yt&auml;nyt yht&auml;&auml;n.<BR><BR>
Pettyneen&auml; irrotin levyaseman lattakaapelin ja ajattelin k&auml;&auml;nt&auml;&auml; kytkimen takaisin DD-asentoon, mutta se ei onnistunutkaan. Sen sijaan kytkin l&auml;hti melkein irti, kun se painui levyaseman sis&auml;&auml;n. En onnistunut k&auml;&auml;nt&auml;m&auml;&auml;n sit&auml; mill&auml;&auml;n. Olin jo v&auml;h&auml;ll&auml; heitt&auml;&auml; koko paskan roskiin, kunnes tajusin, ett&auml; voisin yritt&auml;&auml; k&auml;&auml;nt&auml;&auml; sit&auml; ty&ouml;nt&auml;m&auml;ll&auml; ohuen piikin levyaseman sivusta sis&auml;&auml;n. Onnistuin k&auml;&auml;nt&auml;m&auml;&auml;n kytkimest&auml;. Huokasin jo helpotuksesta laittaessani lattakaapelin takaisin paikoilleen. K&auml;&auml;nsin taas virran p&auml;&auml;lle. Nyt Amiga kysyi taas levykett&auml; ja s&auml;ik&auml;hdin oikein kunnolla. Mit&auml; tapahtui kiintolevylleni?! Hetken pohdinnan j&auml;lkeen olin ty&ouml;nt&auml;m&auml;ss&auml; Workbench-levykett&auml; asemaan kun huomasin, ett&auml; levyasema py&ouml;ritti koko ajan moottoriaan ja latausvalo paloi. Siit&auml; v&auml;litt&auml;m&auml;tt&auml; ty&ouml;nsin levykkeen asemaan. Mit&auml;&auml;n ei tapahtunut. Kutsuin jo kaverini h&auml;tiin.<BR><BR>
V&auml;h&auml;n aikaa asiaa pohdittuamme l&ouml;ysimme vian: levyaseman lattakaapeli oli v&auml;&auml;rin p&auml;in. K&auml;&auml;nsin sen oikein p&auml;in, ja taas kokeilemaan. Levyasema toimi, mutta kiintolevy&auml; ei l&ouml;yt&auml;nyt edes HDToolBox, vaikka se kymmenisen sekuntia sit&auml; etsikin. Aloin ep&auml;ill&auml; kiintolevyn kaapelia, jolloin revin sen irti ja ty&ouml;nsin kaverini kaapelin tilalle. Nyt kiintolevy lopetti moottorinkin py&ouml;ritt&auml;misen. Revin kaverini kaapelin irti ja huomasin, ett&auml; kaksi kiintolevyn IDE-liittimen pinni&auml; oli painunut sis&auml;&auml;n. Tutkailin kaverini IDE-kaapelia ja huomasin, ett&auml; olin laittanut sen v&auml;&auml;rin p&auml;in. Totta kai v&auml;&auml;rin p&auml;in liitt&auml;misen est&auml;miseksi siit&auml; oli peitetty yksi reik&auml; kokonaan, jolloin yksi kiintolevyni pinni oli painunut sis&auml;&auml;n. Toinen pinni oli painunut sis&auml;&auml;n ilmeisesti siksi, ett&auml; se oli ollut v&auml;h&auml;n v&auml;&auml;ntynyt ennen liitt&auml;mist&auml;.<BR><BR>
V&auml;h&auml;n aikaa kiroiltuani purkin menett&auml;mist&auml; l&auml;hdin kaverini kanssa k&auml;ym&auml;&auml;n tietokoneliikkeiss&auml;. Ensimm&auml;isess&auml; liikkeess&auml; vedettiin pinnit yl&ouml;s ja kehotettiin kokeilemaan uudestaan. Koska min&auml; olin sit&auml; mielt&auml;, ett&auml; pinnit olivat katkenneet my&ouml;s sis&auml;lt&auml;, jatkoimme matkaamme toiseen liikkeeseen. Siell&auml; selitettiin, ettei heill&auml; ole edes kiintolevyn avaamiseen tarkoitettuja vehkeit&auml;. Myyj&auml; viel&auml; selitti, ett&auml; kiintolevyj&auml; korjaavat vain ehk&auml; jotkut englantilaiset liikkeet. L&auml;hdimme kokeilemaan, josko kiintolevy sattuisikin toimimaan. Mutta ei! Minua alkoi todella jo harmittaa. Emme keksineet en&auml;&auml; mit&auml;&auml;n, joten laitoin kiintikseni hyllylle ja kaverini l&auml;hti. Minulla oli tuskin mit&auml;&auml;n levykkeill&auml;, paitsi pari peli&auml; ja Magic Bundle-softapaketin mukana tulleet ohjelmat.<BR><BR>
Seuraavana p&auml;iv&auml;n&auml; tajusin soittaa liikkeeseen, jolta oli kiintolevyni tilannut. Heti tuli selv&auml;ksi, ettei takuu korvaa kiintist&auml;ni. Korjauksen hinta olisi 250 mk/h, ja sen joutuisi maksamaan, vaikka he eiv&auml;t levy&auml; saisikaan korjattua. Parin viikon levykerumbauksen kuluttua kuulin er&auml;&auml;lt&auml; kaveriltani tyypist&auml;, joka osaa korjata melkein mit&auml; vain. Soitin siis h&auml;nen purkkiinsa ja h&auml;n sanoi, ett&auml; voisi yritt&auml;&auml;.. Hinnaksi sovimme 50 mk, mutta lopulta se oli en&auml;&auml; 30 mk + CD-ROM-asema (halpa).<BR><BR>
Parin p&auml;iv&auml;n kuluttua h&auml;n oli korjannut kiintikseni, josta oli katkennut puolet IDE-liittimen pinneist&auml;. Ja vain 30 mk! Eip&auml; tullut kalliiksi, ja nyt koko koneenromu pelaa taas loistavasti, joten <B>&Auml;LK&Auml;&Auml; AVATKO KONETTANNE ELLETTE TIED&Auml; MIT&Auml; OLETTE TEKEM&Auml;SS&Auml;</B>. :)<BR><BR>

<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
