<HTML>
<HEAD>
<TITLE>J&auml;rjestelm&auml;ohjelmoinnin alkeiskurssi - Osa 6: Loppuyhteenveto</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=4 FACE="Arial" color="#109f00"><B><I>J&auml;rjestelm&auml;ohjelmoinnin alkeiskurssi - Osa 6: Loppuyhteenveto</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR><BR>
  <FONT SIZE=3><B>Sami Klemola</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>O</FONT><FONT SIZE=3>
hjelmointikurssimme on saapunut tiens&auml; p&auml;&auml;h&auml;n. T&auml;m&auml; on viimeinen osa. Otan k&auml;sittelyyn asiat, jotka olen aikaisemmissa osissa lyk&auml;nnyt, ja p&auml;&auml;t&auml;n kaikki p&auml;&auml;t. Artikkelini ovat aina olleet yli 10 kilotavun mittaisia, mutta t&auml;m&auml; viimeinen juttuni tekee poikkeuksen. K&auml;yn vain l&auml;pi nopeasti asiat, jotka ovat j&auml;&auml;neet roikkumaan. Aiemmin mainitsemani laiteohjaimen tekeminen ei kuulu alkeiskurssin piiriin, vaan se j&auml;&auml; edistyneen j&auml;rjestelm&auml;ohjelmoinnin kurssin asiaksi. Sellaista tosin ei n&auml;ill&auml; n&auml;kymill&auml; ole tulossa.<BR><BR>

</FONT><FONT SIZE=4><B>Kirjaisimet</B></FONT><BR><BR>
<FONT SIZE=5>K</FONT><FONT SIZE=3>
urssin kolmososassa sivusin ikkunoita k&auml;sitelless&auml;ni kirjasimia. Nyt on vuorossa hieman l&auml;hempi tutustuminen aiheeseen. Kirjasindatahan s&auml;ilytet&auml;&auml;n <B><CODE>Fonts:</B></CODE>-hakemistossa, joka tavallisesti on <B><CODE>SYS:Fonts</B></CODE>. Hakemistossa on jokaista kirjasinta varten alihakemisto, jossa omissa tiedostoissaan sijaitsee raaka kirjasindata. P&auml;&auml;hakemistossa on jokaista kirjasinta varten tiedosto, jossa se kuvaillaan.<BR><BR>
Kirjasimia on kahdentyyppisi&auml;, kiinte&auml;levyisi&auml; ja proportionaalisia. J&auml;rjestelm&auml; k&auml;ytt&auml;&auml; useimpiin tarkoituksiin kiinte&auml;levyisi&auml; kirjasimia, mutta omat ohjelmat voivat hy&ouml;dynt&auml;&auml; kirjasimia, joissa kirjaimet ovat erilevyisi&auml;. Levylt&auml; kirjasimia voi ladata </B>diskfont.libraryn</B> funktioilla sek&auml; tiedustella, millaisia kirjasimia on saatavilla.<BR><BR>
Muistissa olevan kirjasimen voi avata </B>graphics.libraryn</B> <B><CODE>OpenFont()</B></CODE>-funktiolla. Se asetetaan k&auml;ytt&ouml;&ouml;n funktiolla <B><CODE>SetFont()</B></CODE> ja suljetaan lopuksi funktiolla <B><CODE>CloseFont()</B></CODE>. Jos k&auml;yt&auml;t levyll&auml; olevaa kirjasinta esimerkiksi ikkunassa, se pit&auml;&auml; avata ensin <B><CODE>OpenDiskFont()</B></CODE>:lla ennen kuin ikkuna voidaan avata.<BR><BR>

</FONT><FONT SIZE=4><B>Hakemistot</B></FONT><BR><BR>
<FONT SIZE=5>E</FONT><FONT SIZE=3>
dellisest&auml; osasta j&auml;iv&auml;t yli hakemistot. Niiden k&auml;sittely on tehokasta ja helppoa. T&auml;ss&auml; yhteenveto <B>dos.libraryn</B> hakemistofunktioista:<BR><BR><BR>
<BLOCKQUOTE><CODE><B>lock = CreateDir("&lt;nimi&gt;")</B></CODE></BLOCKQUOTE>
Luo nykyiseen hakemistoon alihakemiston, jonka nimi annetaan parametrin&auml;. Palauttaa lukon uuteen hakemistoon.<BR><BR><BR>
<BLOCKQUOTE><CODE><B>old = CurrentDir(lock)</B></CODE></BLOCKQUOTE>
Asettaa parametrin&auml; annettuun lukkoon liittyv&auml;n hakemiston nykyiseksi hakemistoksi (CD). Palauttaa edellisen nykyisen hakemiston lukon. Jos se on systeemin CD, pist&auml; lukko talteen ja palauta se CD:ksi ennen poistumista ohjelmasta. Muuten tulee outoja ilmi&ouml;it&auml;, kun ruudulla lukee muuta ja CD onkin ihan toisaalla. Kutsu vain lopuksi <B><CODE>CurrentDir()</B></CODE>:i&auml; sen ensimm&auml;isell&auml; kerralla palauttama osoite.<BR><BR><BR>
<BLOCKQUOTE><CODE><B>plock = ParentDir(lock)</B></CODE></BLOCKQUOTE>
Parametrin&auml; annetaan tiedoston tai hakemiston lukko ja takaisin saadaan lukko sen &auml;itihakemistoon (parent). Jos t&auml;t&auml; funktiota kutsuu juurella, saa nollan. Nollalukko tarkoittaa k&auml;yt&auml;nn&ouml;ss&auml; kaikkien asemien &auml;iti&auml;, sit&auml; asemaa, jolta kone on bootattu. Nolla on siis - toisin kuin monessa muussa - hyv&auml;ksytt&auml;v&auml; arvo lukolle.<BR><BR><BR>
<BLOCKQUOTE><CODE><B>GetCurrentDirName(buffer,length)</B></CODE></BLOCKQUOTE>
Varaa puskuri ja anna sen osoite ja pituus parametrein&auml;. Kutsun j&auml;lkeen puskurista l&ouml;ytyy nykyisen hakemiston nimi. Lukkoa ei siis tarvita t&auml;t&auml; kutsua k&auml;ytett&auml;ess&auml;. Hakemiston nimi kopioidaan prosessin CLI-struktuurista. Jos sit&auml; ei ole, kutsu ei toimi.<BR><BR><BR>
<BLOCKQUOTE><CODE><B>lock = GetProgramDir()</B></CODE></BLOCKQUOTE>
Palauttaa lukon hakemistoon, josta ohjelmakoodi ladattiin. T&auml;m&auml;n funktion avulla voit l&ouml;yt&auml;&auml; ohjelman yhteydess&auml; sijaitsevan asetustiedoston tai vastaavan. Anna lukko <B><CODE>CurrentDir()</B></CODE>:lle, niin voit avata tiedostoja ohjelmahakemistosta. <B><CODE>GetProgramDir()</B></CODE>:n palauttamaa lukkoa ei tule avata. Vastaava <B><CODE>SetProgramDir()</B></CODE>-funktio on olemassa. Se asettaa ohjelman lukon.<BR><BR><BR>
<BLOCKQUOTE><CODE><B>lock = Lock(name,mode)</B></CODE></BLOCKQUOTE>
Lukitsee tiedoston tai hakemiston. Anna parametrin&auml; kohteen nimi ja halutun lukon moodi. Moodeja on kaksi, jaettu ja poissulkeva.<BR><BR><BR>
<BLOCKQUOTE><CODE><B>dlock = DupLock(lock)</B></CODE></BLOCKQUOTE>
Kahdentaa annetun lukon. Saat siis toisen lukon samaan kohteeseen. Kumpikin pit&auml;&auml; lopuksi vapauttaa. Alkuper&auml;isen lukon t&auml;ytyy olla jaettu (shared). <CODE><B>DupLockFromFH()</B></CODE> antaa jaetun lukon tiedoston kahvasta.<BR><BR><BR>
<BLOCKQUOTE><CODE><B>UnLock(lock)</B></CODE></BLOCKQUOTE>
Avaa lukon. Vapauttaa lukitun tiedoston tai hakemiston.<BR><BR>

</FONT><FONT SIZE=4><B>Loppusanat</B></FONT><BR><BR>
<FONT SIZE=5>K</FONT><FONT SIZE=3>
as niin. Siin&auml; se. Kurssi p&auml;&auml;ttyy t&auml;h&auml;n. Lis&auml;tietoa ja lis&auml;&auml; ohjelmointioppia saat autodocs-tiedostoista ja ROM Kernel Reference -kirjoista. Bokseista saat paljon l&auml;hdekoodia opiskeltavaksi. Min&auml; kiit&auml;n seurasta ja toivotan kaikille n&auml;kemiin.<BR><BR>
</FONT>

<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>