<HTML>
<HEAD>
<TITLE>Puolen vuoden tapahtumat Amiga-maailmassa</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Puolen vuoden tapahtumat Amiga-maailmassa</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR><BR>
  <FONT SIZE=3><B>Jari Ristiranta</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>K</FONT><FONT SIZE=3>
aikkia h&auml;mm&auml;stytt&auml;neest&auml; VIScorpin ja Escomin sopimuksesta ei kulunut kauaakaan, kun Escom yll&auml;tt&auml;en meni konkurssiin. Suuret investoinnit PC-puolella eiv&auml;t tuottaneetkaan toivottua tulosta. AT:n siirto VIScorpille tietysti viiv&auml;styi. Viivytyksi&auml; tuli toinen toisensa j&auml;lkeen.<BR><BR>
Lokakuun lopulla Phase 5 siirtyi huomion keskipisteeksi julkaisemalla tiedot aivan uudesta tietokoneesta, jonka se aikoo julkaista t&auml;m&auml;n vuoden 1997 aikana. Kone perustuu PowerPC-prosessoriin, Phase 5:n uskomattomalta vaikuttavaan piirisarjaan sek&auml; AmigaOS-yhteensopivaan k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml;n.<BR><BR>
AT:n siirto VIScorpille viiv&auml;styi yh&auml; edelleen. Marraskuussa Carl Sassenrath, yksi Amigan alkuper&auml;isist&auml; kehitt&auml;jist&auml;, otti lopputilin VIScorpilta ja samalla lehdist&ouml;tiedotteessa haukkui yhti&ouml;n maan tasalle. Viimeist&auml;&auml;n tuossa vaiheessa usko VIScorpiin alkoi hiipua.<BR><BR>
Noin kaksi viikkoa my&ouml;hemmin VIScorpin sopimus ostaa AT peruutettiin. Joulukuun viimeisin&auml; p&auml;ivin&auml; kilpaan astui mukaan pohjoisamerikkalainen Quikpak, joka on t&auml;t&auml; ennen myynyt Amiga-tuotteita paikallisille markkinoille. Tilanne on yh&auml; ep&auml;selv&auml;.<BR><BR>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>

