<HTML>
<HEAD>
<TITLE>Wizard-hiiri</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Wizard-hiiri</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Timo Siev&auml;nen</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>P</FONT><FONT SIZE=3>
akon edess&auml;, oikeastaan hieman liiankin my&ouml;h&auml;&auml;n, hankin l&auml;hes kaikille niin tutun Commodore/AT-hiiren tilalle uuden. Kovin paljon vaihtoehtoja ei ollut PC-landiassamme, ja kerron t&auml;ss&auml; yhdest&auml; varteen otettavasta vaihtoehdosta.<BR><BR>
Wizard on optis-mekaaninen, kolminappinen hiiri, joka sopii kaikkiin Amiga/Atari-tietokoneisiin; pohjassa on kytkin, koska Atari-hiiret eiv&auml;t ole t&auml;ysin samanlaisia. Ero vanhaan hiireen ja my&ouml;s muistikuviini alkuper&auml;isen hiiren toiminnasta uutena oli suunnaton. T&auml;m&auml; johtuu mm. 560 dpi:n tarkkuudesta. Napeissa on mikrokytkimet, ne ovat kaikki suunnilleen sormen levyisi&auml;, ja hiiri on muutenkin isompi ja kulmikkaampi. Mikrokytkimet toimivat, painaa pitkulaisia nappeja sitten mist&auml; kohtaa tahansa; erikokoiset k&auml;det l&ouml;yt&auml;v&auml;t paikkansa hiiren pitkitt&auml;is-koveralla pinnalla. Wizard on my&ouml;s symmetrinen, joten yhdess&auml; MCP-ohjelman "<I>Leftymouse</I>"-option kanssa vasenk&auml;tiset voivat k&auml;ytt&auml;&auml; hiirt&auml; luontevasti (ainakin moniajon aikana).<BR><BR>
Kun sain hiiren postissa, ensimm&auml;iseksi ihmettelin, ettei mukana seurannut yht&auml;&auml;n paperia, kaikki tiedot olivat pahvilaatikossa. Sitten avasin hiiren em. laatikon tekstien takia. Pallon keveys tarkoittikin vain pienemp&auml;&auml; palloa, mutta siksi se ei oikeastaan tuntuisi tarvitsevan hiirimattoa mihink&auml;&auml;n. Pohjan laatat saavat Wizardin liukumaan jo hiirimatolla kevyesti, vaikka mm. mikrokytkimet tuntuisivat tekev&auml;n hiirest&auml; suhteellisen raskaan.<BR><BR>
Muutaman viikon k&auml;yt&ouml;n aikana hiiri on toiminut moitteetta ainakin Amigassa. Kolmatta nappia voi k&auml;ytt&auml;&auml; esim. ruutujen selaamiseen, valitsimien monivalintaan (shiftin korvike), tai mihin milloinkin. Liitin (saman mallinen kuin peliohjaimissa) on hyvin tiukka ainakin A1200:ssa. Omituisinta oli Simlife-pelin toimiminen vasta kolminappisella hiirell&auml;..<BR><BR>
Jos viel&auml; k&auml;yt&auml;t toista Amigan vakiohiirist&auml;, suosittelen sen vaihtamista kun viel&auml; ehdit. Velhot saattavat hyvinkin loppua!<BR><BR>

<TABLE WIDTH=100% BORDER=0>
<TR>
    <TD WIDTH=25%><CODE><B>Valmistaja:</B></CODE></TD>
    <TD WIDTH=75%><CODE>Wizard Developments</CODE></TD>
</TR>
<TR>
    <TD><B><CODE>Valmistusmaa:</CODE></B></TD>
    <TD><CODE>Taiwan</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Maahantuoja:</CODE></B></TD>
    <TD><CODE>Broadline Oy, puh. (09) 847900</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Hinta:</CODE></B></TD>
    <TD><CODE>175,-</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Mitat<BR>(p,l,k, johto mm):</CODE></B></TD>
    <TD><CODE>160, 62, 30, n. 1700</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Testattu:</CODE></B></TD>
    <TD><CODE>Amiga (A1200 B1220/28 MHz, kiintolevy)</CODE></TD>
<TR>
</TABLE>
           
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>