<HTML>
<HEAD>
<TITLE>X-Files File 1: The unopened file</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>X-Files File 1: The unopened file</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #20, 18.1.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Valtteri Murto</B></FONT></TD></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>E</FONT><FONT SIZE=3>
r&auml;&auml;n&auml; p&auml;iv&auml;n&auml; Stockmannilla k&auml;ydess&auml;ni osui videohyllyss&auml; silm&auml;&auml;n video, jonka kannessa komeili iso X-kirjain sek&auml; teksti: "The X-Files Kansio 1: The unopened file". Olin kuullut, ett&auml; videolla olevaa elokuvaa ei ole aiemmin Suomessa esitetty, joten vannoutuneena X-Files-fanina p&auml;&auml;tin tuon videon kokoelmiini hankkia, kun ei hintakaan p&auml;&auml;t&auml; huimannut. (69,-)<BR><BR>
Kotiin p&auml;&auml;sty&auml;ni en heti voinut katsoa filmi&auml;, joten j&auml;tin sen sohvalleni, josta velipaha oli sen kuitenkin pihist&auml;nyt ja l&auml;htenyt katsomaan sit&auml; kaverinsa kanssa huomaamattani. Huomattuani t&auml;m&auml;n sek&auml; l&ouml;ydetty&auml;ni videon nauhurista alkoi perherauhamme j&auml;rkky&auml;, mutta eip&auml; eksyt&auml; aiheesta... :-) Joka tapauksessa video oli sitten pakko katsoa, kun se kerran oli k&auml;&auml;r&ouml;st&auml; pois otettu, vaikka olin ajatellut katsoa sit&auml; hieman paremmalla ajalla.<BR><BR>
Alkutekstien aikana ("T&auml;m&auml;n videokasetin julkinen...") ehdin hieman tutustua kotelon takakannessa olevaan pienoiseen esittelyyn, jossa kerrottiin juoni lyhyesti: Hakkeri on murtautunut Yhdysvaltojen ulkoministeri&ouml;n UFO-tiedostoihin, ja hallitus alkaa ajaa h&auml;nt&auml; takaa. H&auml;n saa kuitenkin ennen kiinnij&auml;&auml;mist&auml;&auml;n toimitettua tiedostot ja varmuuskopionauhan Mulderille, joka alkaa etsi&auml; totuutta tuodakseen sen esille ja saattaakseen valtion vastuuseen asioiden peittelyst&auml;. Tiedostojen tulkitseminen ei ole kuitenkaan niin helppoa, sill&auml; ne on salattu toisen maailmansodan aikaisella navajo-salakielell&auml;, jota osaa tulkita vain kourallinen ihmisi&auml; maailmassa. Scullyn yst&auml;v&auml; neuvoo t&auml;t&auml; ottamaan yhteytt&auml; Albertiin, vanhaan navajo-intiaaniin, joka osaa tulkita kielt&auml;. J&auml;ljet johtavat er&auml;maahan, jonne on haudattu vanhaan junavaunuun salaisuuksia, joita hallitus on piilotellut jo vuosia. (S&auml;&auml;st&auml;n teid&auml;t juonen yksityiskohtaisemmilta piirteilt&auml;, jotta j&auml;isi jotain iloa katsoakin elokuva. -kirj. huom.)<BR><BR>
Elokuvan edetess&auml; juoneen sotkeutuvat mm. Mulderin is&auml;, joka on Foxin tiet&auml;m&auml;tt&auml; tiennyt UFO-kansioista jo pitk&auml;&auml;n, eik&auml; Scullynk&auml;&auml;n perhett&auml; voida olla sotkematta mukaan. Moni X-Filesi&auml; aktiivisesti seurannut l&ouml;yt&auml;&auml; my&ouml;s yhteyksi&auml; aiemmin esitettyihin X-Files-jaksoihin (mm. Mulderin siskon Samanthan katoaminen).<BR><BR>
Kaiken kaikkiaan video on kaikille X-Files-fanaatikoille kannattava ostos, ja voin sit&auml; varauksetta suositella my&ouml;s muille scifist&auml; kiinnostuneille. Videosta on tiet&auml;&auml;kseni liikkeell&auml; my&ouml;s vuokraversio, jonka saattaa hyv&auml;ll&auml; onnella l&ouml;yt&auml;&auml; l&auml;himm&auml;st&auml; videovuokraamosta.<BR><BR>
Elokuva on siis koostettu Suomen TV:ss&auml; n&auml;kem&auml;tt&ouml;mist&auml; jaksoista, mutta on kuitenkin t&auml;ysiverinen elokuva. Jokaisen videon mukana tulee pahvinen "Agenttikortti", joita nelj&auml; ker&auml;tty&auml;&auml;n ne voi l&auml;hett&auml;&auml; Finnkinolle, joka l&auml;hett&auml;&auml; vastineeksi "Secrets of The X-Files" -videon sek&auml; yll&auml;tyspalkinnon.<BR><BR>

<TABLE WIDTH=100% BORDER=0>
<TR>
    <TD WIDTH=25%><CODE><B>Elokuvan nimi:</B></CODE></TD>
    <TD WIDTH=75%><CODE>X-Files - Salaiset kansiot - Kansio 1: The unopened file</CODE></TD>
</TR>
<TR>
    <TD><B><CODE>Kesto:</CODE></B></TD>
    <TD><CODE>2 h 08 min</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Suos. ik&auml;raja:</CODE></B></TD>
    <TD><CODE>K-12</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Valmistusvuosi:</CODE></B></TD>
    <TD><CODE>1995</CODE></TD>
<TR>
<TR>
    <TD><B><CODE>Sarjan muut videot:</CODE></B></TD>
    <TD><CODE>
        Kansio 2: Tooms (ilmestynyt)<BR>
        Kansio 3: Abduction (ilmestyy syyskuussa)<BR>
        Kansio 4: Colony (ilm. syyskuussa)<BR>
        Kansio 5 (ilm. lokakuussa)<BR>
        Kansio 6 (ilm. marraskuussa)<BR>
</CODE></TD>
<TR>
</TABLE>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 20, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
