<HTML>
<HEAD><TITLE>
Workshops / Hintergrundberichte
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0500.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0502.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Workshops / Hintergrundberichte
</font>
</TD></tr>
</TABLE>


<P>

<H2>1. Telefonliberalisierung - so senkt ihr eure Telekom-Rechnung!</H2>

<P>
"Was hat die Telefonliberalisierung mit unserem Computersystem zu tun?"
werden sich einige von euch jetzt vielleicht fragen.
Oh, einiges, zumindest f&#252;r diejenigen, die keine Mailbox oder g&#252;nstigen
Internet-Provider zum City-Tarif nutzen k&#246;nnen. Denn wenn man nicht gerade
auf T-Online oder AOL setzen will, kommt man insbesondere in l&#228;ndlichen
Regionen um den RegioCall- oder gar GermanCall-Tarif der Deutschen Telekom
oft nicht herum - glauben immer noch viel zu viele User.
Leider hat es sich bei den meisten noch nicht herumgesprochen, und
zugegeben, bis vor einigen Wochen auch nicht bei mir, dass eine Reihe von
Telefongesellschaften bei einem bestimmten Verfahren komplett auf
Anmeldung, Mindestumsatz, Grundgeb&#252;hr oder andere verbraucherabschreckende
Dinge verzichten. Dieses Verfahren nennt sich Call-by-Call.
Das Ganze ist schnell erkl&#228;rt: Vor der eigentlichen (St&#228;dte-) Vorwahl (z.B.
089 f&#252;r M&#252;nchen), w&#228;hlt ihr einfach die Netzkennzahl der jeweiligen
Telefongesellschaft. Ein Beispiel: Aus 089 123456 w&#252;rde 01019 089 123456,
wenn ihr &#252;ber Mobilcom telefonieren/surfen wolltet, oder aber 01070 089
123456 wenn doch lieber Mannesmann Arcor verwendet werden soll. Andere
Anbieter von Call-by-Call sind z.B. TelDaFax (01030), Viatel (01079) und
Otelo (01011). Letzterer kann jedoch bei Inlandsgespr&#228;chen preislich nicht
mit den Konkurrenten mithalten - womit wir schon beim Sinn von Call-by-Call
w&#228;ren: der Kostensenkung. Verglichen mit der Deutschen Telekom sind die
genannten Gesellschaften teilweise deutlich billiger. Wie schon erw&#228;hnt,
lassen sich die Anbieter von Call-by-Call ohne Anmeldung nutzen - ihr k&#246;nnt
es sofort ausprobieren. Ob ihr DF&#220; betreibt oder normale Telefongespr&#228;che
f&#252;hrt, ist nat&#252;rlich egal. Die f&#228;llig werdenden Betr&#228;ge erscheinen ganz
normal auf eurer Telekom-Telefonrechnung, ohne dass von dem ehemaligen
Monopolisten irgendwelche Extrageb&#252;hren o.&#196;. berechnet werden d&#252;rfen.
<P>
Wer aber ist der g&#252;nstigste Anbieter? Darauf l&#228;sst sich nicht pauschal
antworten, vielmehr ist das je nach Tag, Uhrzeit und Entfernungszone
unterschiedlich. Die folgenden Tabellen sollen euch bei der richtigen Wahl
helfen (alle Angaben ohne Gew&#228;hr):
<P>
F&#252;r Verbindungen innerhalb des Festnetzes:
<P>
<PRE>Tag, Uhrzeit      | Bis 50 km Entfernung      |         Ab 50 km Entfernung
===========================================================================

Mo-Fr, 05.00-09.00  Arcor (01070), 11 Pfg.        Mobilcom (01019), 19 Pfg.
Mo-Fr, 09.00-18.00  Arcor (01070), 15 Pfg.        Mobilcom (01019), 19 Pfg.
Mo-Fr, 18.00-21.00  Arcor (01070), 11 Pfg.        Mobilcom (01019), 19 Pfg.
Mo-Fr, 21.00-02.00  Arcor (01070), 7,5 Pfg.     TelDaFax (01030), 13,9 Pfg.
Mo-Fr, 02.00-05.00  Deutsche Telekom, 6 Pfg.       Deutsche Telekom, 6 Pfg.

Sa/So, 05.00-21.00  Arcor (01070), 11 Pfg.        Viatel (01079), 18,6 Pfg.
Sa/So, 21.00-05.00  Arcor (01070), 7,5 Pfg.     TelDaFax (01030), 13,9 Pfg.

(Zum Vergleich: Die Deutsche Telekom berechnet bis zu 55,9 Pfg.!)</PRE>
<P>
F&#252;r Verbindungen vom Festnetz in ein Mobilfunknetz:
<P>
<PRE>Tag, Uhrzeit      | D1 (0170/0171), E+ (0177) |             D2 (0172, 0173)
===========================================================================

Mo-Fr, 09.00-18.00  Viatel (01079), 73,1 Pfg.     Viatel (01079), 73,1 Pfg.
Mo-Fr, 18.00-09.00  TelDaFax (01030), 47,4 Pfg.      Arcor (01070), 46 Pfg.

Sa/So, 00.00-24.00  TelDaFax (01030), 47,4 Pfg.      Arcor (01070), 46 Pfg.

(Zum Vergleich: Die Deutsche Telekom berechnet bis zu 137 Pfg.!)</PRE>
<P>
Die Tabellen sollten im Wesentlichen selbsterkl&#228;rend sein, trotzdem einige
Anmerkungen:
<P>
<UL><LI>
   Angegeben ist jeweils der f&#252;r 1 Gespr&#228;chs- / Onlineminute f&#228;llig
werdende Betrag.
<P>
</LI><LI>
   An Feiertagen gilt der Samstag/Sonntag-Tarif.
<P>
</LI><LI>
   Bei Verbindungen in ein Mobilfunknetz h&#228;ngt der g&#252;nstigste Tarif davon
ab, in welches Netz man sich einw&#228;hlt. Dies l&#228;sst sich an Hand der
Telefonnummer (siehe erste Zeile der Mobilfunk-Tabelle) erkennen.
<P>
</LI><LI>
   Bei Ortsgespr&#228;chen hat die Telekom in weiten Teilen Deutschlands noch ein
Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften
spezielle City-Tarife an. In der Regel hei&#223;t es also bei
Ortsgespr&#228;chen: Weiterhin die Deutsche Telekom benutzen.
Auf <A HREF="http://www.muc.de/~hm/telefon-tarife/tarifzonen.html">http://www.muc.de/~hm/telefon-tarife/tarifzonen.html</A> k&#246;nnt ihr
&#252;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&#246;nnte
es mal passieren, dass ihr "f&#228;lschlicherweise" einen der alternativen
Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom
</LI><LI>
   und damit wom&#246;glich billiger - zustande kommen k&#246;nnte.
<P>
</LI><LI>
   Bei Auslandsgespr&#228;chen l&#228;&#223;t sich dagegen teilweise drastisch sparen,
jedoch hat fast jedes Land einen anderen g&#252;nstigsten Anbieter, so dass
sich hier keine pauschale Aussage machen l&#228;sst. Allerdings gibt es im
Internet Sites, auf denen sich der jeweils g&#252;nstigste Tarif berechnen
l&#228;sst. Mein Favorit: <A HREF="http://www.teltarif.de/db/index.html">http://www.teltarif.de/db/index.html</A>
<P>
</LI></UL>
Die Anbieter verfahren bei der Geb&#252;hrenberechnung teilweise
unterschiedlich:
<P>
<UL><LI>
   TelDafax rechnet sekundengenau ab, d.h. ihr zahlt hier wirklich nur f&#252;r
die Zeit, die das Gespr&#228;ch / die Online-Sitzung dauert.
<P>
</LI><LI>
   Dasselbe gilt im Prinzip auch f&#252;r Arcor, blo&#223; berechnet das Unternehmen
pro Gespr&#228;ch zus&#228;tzlich eine Verbindungsgeb&#252;hr von 6 Pfg.
<P>
</LI><LI>
   Viatel berechnet bei Gespr&#228;chen bis 30 Sekunden Dauer die gesamten 30
Sekunden, danach wird exakt abgerechnet.
<P>
</LI><LI>
   Mobilcom rechnet minuten(un)genau ab, d.h. auch wenn das Gespr&#228;ch nur 5
Sekunden dauert, zahlt ihr 19 Pfg.
<P>
</LI></UL>
Und noch ein Tip zum Schluss: Sollte mal besetzt sein - nicht aufgeben!
Einige der Gesellschaften werden im Moment n&#228;mlich geradezu &#252;berrannt,
wobei jedoch das Schlimmste &#252;berstanden sein sollte.
<P>
So, jetzt m&#246;chte ich aber von euch wissen, ob dieses Thema &#252;berhaupt euer
Interesse gefunden hat. Schlie&#223;lich kann ich nicht wissen, wie ein
Telekommunikationsthema in einem eigentlich reinrassigen AMIGA-Magazin
ankommt. Sollte euch dieser Exkurs jedoch gefallen haben, erlaube ich mir,
von Zeit zu Zeit auf &#196;nderungen der Tarife aufmerksam zu machen und
thematische Erg&#228;nzungen zu liefern. Schreibt mir also bitte, was ihr davon
haltet. Meine E-Mail-Adresse: <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>
<P>


<P ALIGN=RIGHT>
<A HREF="0500.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0502.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
