<HTML>
<HEAD><TITLE>
Workshops / Hintergrundberichte
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0501.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0600.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Workshops / Hintergrundberichte
</font>
</TD></tr>
</TABLE>


<P>

<H2>2. Erfahrungsbericht: Übertaktung der CyberstormPPC (von Jörg Handwerg)</H2>

<P>
&#187;<B>Overclock PPC!</B>
<P>
Als ich k&#252;rzlich wieder einmal auf der ClickBoom-Page auf das Thema
overclocking, sprich &#220;bertakten des Prozessors stie&#223;, beschloss ich nach
dem Studieren der Homepage von David Myers, auch meine Karte mal ein wenig
zu &#252;bertakten, denn warum nicht mehr Performance bei gleichem Board? Ich
besitze ein PPC604e-200/060-50-Board, und sicherlich ist es schon recht
flott, aber eigentlich kann es ja nie schnell genug sein, besonders weil
der 060 ja die Hauptarbeit erledigt und schon noch ein wenig schneller sein
k&#246;nnte. David schreibt auf seiner Page, dass sein Board bereits seit einem
halben Jahr mit 64 MHz auf dem 060 und 225 MHz auf dem PPC ohne Probleme
l&#228;uft, und auf dem PPC sogar 240 MHz liefen. Ich baute also daraufhin mein
PPC-Board aus und nahm es mit auf den Weg zum n&#228;chsten Elektronikladen.
Leider waren in beiden L&#228;den, die hier in der N&#228;he anzufinden sind, die
nicht ganz &#252;blichen quadratischen Quarz-Oszillatoren nicht vorr&#228;tig, so
dass ich sie bestellen musste. Bei Conrad Elektronik oder V&#246;lkner sind
diese nicht zu erstehen. Ich bestellte also nun einen 65 MHz-, einen 75
MHz- und einen 80 MHz-Quarz, mit der Bitte, falls es diese nicht geben
sollte, m&#246;glichst naheliegende Frequenzen zu nehmen.
Geliefert bekam ich 60, 66 und 80 MHz. Andere Varianten gibt es nicht im
Handel. Auf meine Nachfrage bei David Myers erhielt ich dann auch die
Aussage, dass er sich diese Varianten selber bei einer Quarz-Firma in
Australien hat herstellen lassen. Diese Information w&#228;re nat&#252;rlich auch auf
der Homepage recht angebracht gewesen!
<P>
Zuerst probierte ich den 80 MHz-Quarz aus, der den PPC auf 80 x 3, sprich
240 MHz beschleunigt! Nach dem Austausch des 66er-Quarzes nahm ich dann ein
SIMM (wie empfohlen) raus, da es ein wenig beim L&#246;ten st&#246;rt. Leider verga&#223;
ich, dieses wieder einzusetzen, und auch, dass die SIMMs unbedingt
paarweise in den B&#228;nken installiert sein m&#252;ssen. Es lief nat&#252;rlich nicht.
Sp&#228;ter, als mir mein Fehler auffiel, wiederholte ich das ganze, und siehe
da, der Rechner bootete, allerdings um dann bei Erscheinen der WB mit einem
Ramlib Error abzust&#252;rzen.
<P>
Da war nix zu machen! Ich baute also den original 66er-Quarz wieder ein und
probierte nun mit dem 060 mein Gl&#252;ck, indem ich versuchte, ihn ebenfalls
mit einem 66 MHz-Quarz auf Trab zu bringen. Nichts! Kein Mucksen mehr. Auch
der 60er-Quarz f&#252;hrte zu keinerlei Reaktion meines Rechners mehr. Zur&#252;ck
auf 50 MHz lief er dann wieder.
<P>
Der ganze Ablauf ist jetzt stark gek&#252;rzt dargestellt, denn zwischendrin
kamen die unterschiedlichsten und fiesesten Probleme auf, wie z.B.
Netzteilschw&#228;che, Kontaktprobleme des 200 pol. Turboboardsockels auf dem
Mainboard, Simm-Probleme, und mehrfache quittierte der Rechner die Versuche
mit mehrst&#252;ndigem "Schmollen", sprich es tat sich nichts mehr, bis sich
nach einigen Stunden der Rechner nach dem Einschalten wieder entschloss,
die Arbeit aufzunehmen.
<P>
<B>Fazit:</B> Wer sich nicht SEHR gut mit seinem Rechner auskennt, sollte die
Finger davon lassen. Auch mit ein bisschen L&#246;tkenntnissen ist es noch lange
nicht getan! Die Karte ist sehr empfindlich, und schon ein wenig
Flussmittel an der falschen Stelle kann f&#252;r ein nicht mehr ordnungsgem&#228;&#223;es
Arbeiten sorgen. Auch die Simms machen leicht Probleme, ebenso wie der
Mainboard-Sockel, was leicht dazu f&#252;hren kann, dass man den &#220;berblick
verliert, warum eigentlich nichts mehr l&#228;uft. Auf jeden Fall werde ich mit
David Myers in Kontakt bleiben, und wenn ich es eines Tages doch noch mal
schaffen werde, das Board zu &#252;bertakten, werde ich sicherlich ebenfalls
einen Bericht abgeben, und dann eben, wie es doch funktioniert.
<P>
J&#246;rg Handwerg<BR>
E-Mail: <A HREF="mailto:J.Handwerg@t-online.de">J.Handwerg@t-online.de</A>&#171;
<P>


<P ALIGN=RIGHT>
<A HREF="0501.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0600.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
