<HTML>
<HEAD><TITLE>
Testberichte
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0600.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0602.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Testberichte
</font>
</TD></tr>
</TABLE>


<P>

<H2>1. Hardwaretest: Grafikkarte »CybervisionPPC« (von Jörg Handwerg)</H2>

<P>
&#187;Nachdem ich vor nur 15 Monaten meine Karte bestellt habe, erreichte mich
doch tats&#228;chlich unerwartet Mitte Juni ein Fax mit einer
Auftragsbest&#228;tigung. Lieferdatum 06.07.98. P&#252;nktlich drei Tage sp&#228;ter lag
sie dann auch auf meinem Tisch, nur hatte ich leider keine Zeit sie
einzubauen.
<P>
Ein paar Neuigkeiten haben sich mit der Auslieferung auch ergeben: Es gibt
nur eine 8 MB-Version der CybervisionPPC und nur eine 4 MB-Version der
BVisionPPC. (Die anderen beiden Varianten fallen wohl mangels Nachfrage
weg.) Der Preis f&#252;r die Karten wurde etwas abgesenkt, daf&#252;r entfallen die
PowerUp-M&#246;glichkeiten.
<P>
Der Karton in schlichtem Pappbraun gehalten (sinnvoll statt teurer
Aufdrucke) wirkt sehr stabil und schon etwas &#252;berdimensioniert f&#252;r die sehr
kleine Karte.
<P>
Als ich dann die Zeit fand, packte ich die Karte schlie&#223;lich aus und
entdeckte die gewohnte P5-Qualit&#228;t in der Verarbeitung, die sich sogar,
m&#246;chte ich behaupten, noch verbessert hat. Das Paket enthielt au&#223;er der
Karte zwei Disketten, einmal eine Disk mit der aktuellen Version des PPC-
FlashROMs 44.57 bzw. des 68k-Flashs f&#252;r die MK III sowie ein Zettel mit
einer Anleitung zum updaten, ein Anwenderb&#252;chlein und ein Slotblech mit
einem geschirmten Kabel, um den VGA-Ausgang nach drau&#223;en zu bekommen. Das
Slotblech enth&#228;lt &#252;brigens auch noch einen weiteren Ausgang f&#252;r eine 3D-
Shutter-Brille, die vom Permedia 2 direkt unterst&#252;tzt wird!
<P>
Zuerst muss das FlashROM upgedatet werden, wozu der Rechner ausgeschaltet
werden muss, um resetfeste Programm zu entfernen. Wie das genaue (sehr
einfache) Procedere vor sich geht, ist noch mal auf dem Beipackzettel
beschrieben. Gesagt - getan. Nun wird noch ein Update der Libraries f&#252;r den
68060 bzw. 68040 und den PPC vorgenommen, und dann ist die erste Disk auch
schon erledigt.
<P>
Die zweite Disk enth&#228;lt die neuste (schon nicht mehr so neue) Version 70a
der CyberGFX-Software und eben den wichtigen CybervisionPPC-Monitortreiber.
Hat man die Version 70a sowieso schon installiert, gen&#252;gt, trotz des
Hinweis, s&#228;mtliche &#228;ltere Installationen von CGFX zu deinstallieren und
dann die Disk zu installieren, ein einfaches Kopieren des Monitorfiles in
Devs:Monitors. Da ich schon eine CV64/3D im System hatte, habe ich diesen
Weg gew&#228;hlt, um erst einmal die beiden Karten parallel zu betreiben, da es
die Umstellung der Einstellungen (Screenmode etc.) erleichtert, was auch
problemlos funktioniert.
<P>
Also alle, die mehr als eine Grafikkarte im Rechner ben&#246;tigen: So geht's!
Das war's mit der Installation. Nach dem Flashupdate nicht vergessen,
wieder die Settings (&#180;ESC&#180; beim Booten) neu einzustellen, da diese
logischerweise verlorengehen.
<P>
Nun kam der gro&#223;e Augenblick: RESET und ..... ganz normal, da ich den
Screenmode erst umstellen muss. Dies tat ich dann auch und durfte
feststellen, dass der von mir gew&#228;hlte Mode 1024x768x8 Bit nur eine
&#228;usserst schwarze WB bewirkte. Da ich aber nicht zum ersten mal eine P5-
Grafikkarte installiert habe, dachte ich mir schon, dass das Problem wieder
mal in den Einstellungen liegt. Also RESET, neu booten und in die CGFXMode-
Einstellungen in Prefs. Hier kann man nun mehr oder weniger komfortabel die
Einstellungen des Monitorfiles korrigieren. Da ich eigentlich schon recht
m&#252;hsam f&#252;r meine CV64/3D meine Einstellungen zusammengestellt hatte, wollte
ich diese &#252;bernehmen. Dazu kopierte ich einfach das File CVision3DMonitor
in Prefs/Env-Archive/CyberGraphX und benannte es in CVisionPPCMonitor um.
RESET, und schon waren die neuen (alten) Modi auch in CGFXMode verf&#252;gbar.
Jemandem, der diese Einstellungen mangels CGFX vorher nicht hatte, bleibt
nur, die Einstellungen an seinen Monitor manuell anzupassen und mit TEST
auszuprobieren. Das sollte aber au&#223;er etwas Arbeit weiter kein Problem
darstellen.
<P>
Nun noch in Screenmode die WB auf CybervisionPPC umgestellt, und schon lief
die Karte, und zwar in einer bestechenden Brillanz und einer ordentlichen
Geschwindigkeit. Man kann erheblich h&#246;here Bildraten und Aufl&#246;sungen bei
h&#246;herer Tiefe einstellen. Jetzt l&#228;uft IBrowse auch bei 1024x768 in 24 Bit,
und das bei 80 Hz in sensationeller Geschwindigkeit!
Lediglich ein Problem habe ich noch mit der Karte: Bei Pixeltaktraten von
&#252;ber 80 MHz bekomme ich Pixelfehler. Woran das liegt, kann ich zur Zeit
leider noch nicht sagen, aber von anderen wurde mir schon berichtet, dass
diese Probleme bei ihnen nicht auftauchen.
<P>
<I>[Anm. d. Red.: Kurz vor Redaktionsschluss hat J&#246;rg Handwerg uns mitgeteilt,
dass die Probleme nach einem Update des CybervisionPPC-Monitortreibers auf
v2.6 nicht mehr vorhanden sind.]</I>
<P>
Ein Nachteil der Karte sollte aber auch nicht verschwiegen werden: Sie
enth&#228;lt keinen Scandoubler-Ausgang oder Monitorumschalter. Der Scandoubler-
Ausgang ist technisch nicht m&#246;glich, da die Karte ja nicht mehr im
Videoslot sitzt und somit keinerlei Videosignal des Amigas bekommt, und der
Monitorumschalter wurde wohl einfach eingespart. :-( ...Also entweder
braucht man nun einen zweiten Monitor, einen Monitor mit zwei Eing&#228;ngen,
einen Umschalter, oder man muss ab und zu umstecken. Da es aber in der
Regel kaum notwendig ist, noch AMIGA-Modi zu nutzen (sind eh zu langsam),
ist dieser Nachteil zu verschmerzen.
<P>
Insgesamt kann man eine deutliche Geschwindigkeitssteigerung gegen&#252;ber der
CV64/3D feststellen, wenngleich diese durch Sysspeed nur in 16 und 24 Bit
auch mit Zahlen untermauert wurde. Hieran sind wohl auch etwas die sehr
beschr&#228;nkten Testvarianten schuld. Subjektiv ist der Aufbau des Bildes
jedenfalls auch in 8 Bit schneller als mit der CV64/3D. In 16 und 24 Bit
merkt man nun keine Verz&#246;gerung gegen&#252;ber den 8-Bit-Modi wie auf der
CV64/3D, und mit Sysspeed wurde von mir ein Wert im Bereich des vier- bis
f&#252;nffachen der Geschwindigkeit einer CV64/3D ermittelt.
<P>
Was jetzt noch fehlt, sind die 3D-Funktionen des Permedia 2, da weder eine
Library zur Ansteuerung beiliegt (soll erst im August fertig werden), noch
eine Demo.
<P>
Abschlie&#223;end m&#246;chte ich noch anmerken, dass ich den Kauf der Karte
keinesfalls bereue, da sowohl die Bildqualit&#228;t wie die Geschwindigkeit
erheblich gesteigert wurde, und die Karte mit ihren Features auch f&#252;r die
Zukunft vielversprechendes zu bieten hat, wie man im PC-Bereich ja an
einigen Spielen bestaunen kann. Die unverbindliche Preisempfehlung liegt
aktuell bei rund 499,- DM (aktueller Preis bei mir 489,- DM, wenn ich mir
diese Schleichwerbung erlauben darf :-))) ).
<P>
J&#246;rg Handwerg<BR>
E-Mail: <A HREF="mailto:J.Handwerg@t-online.de">J.Handwerg@t-online.de</A>&#171;
<P>


<P ALIGN=RIGHT>
<A HREF="0600.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0602.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
