<HTML>
<HEAD><TITLE>
Testberichte
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0601.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0603.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Testberichte
</font>
</TD></tr>
</TABLE>


<P>

<H2>2. Hardwaretest: Scandoubler »AmiScan« (von Christian Hoklas)</H2>

<P>
&#187;<B>Einleitung</B>
<P>
Der AmiScan ist ein Scandoubler f&#252;r alle Amigas. Er wird am RGB-Port
angeschlossen und verdoppelt die 15kHz-Modi auf 31.5kHz. Damit wird es
m&#246;glich, (fast) alle Standard-VGA- oder Multiscan-Monitor an den Amiga
anzuschlie&#223;en. Man ben&#246;tigt den Scandoubler z.B., wenn man nicht
systemkonforme Programme wie Spiele oder Demos auf seinem Rechner starten
will, die auf PAL oder NTSC bestehen. Auch das Bootmen&#252; und die Guru-
Meldungen werden mit 15kHz angezeigt und w&#228;ren ohne Scandoubler nicht
darstellbar.
<P>
<B>Technische Daten</B>
<P>
<UL><LI>
   externer Scandoubler/Flickerfixer f&#252;r alle Amigas
</LI><LI>
   15kHz-Modi werden auf 31.5kHz verdoppelt
</LI><LI>
   Unterst&#252;tzung der vollen 24-Bit-Palette
</LI><LI>
   Genlock-Betrieb m&#246;glich
</LI><LI>
   RGB-Port f&#252;r Amiga-Anschluss, 15-poliger D-SUB-Stecker f&#252;r VGA-Monitor
<P>
</LI></UL>
<B>Installation</B>
<P>
Die Installation ist sehr einfach. Eigentlich reicht simples Einstecken des
Scandoublers an den RGB-Port des Amiga und Anschlie&#223;en des Monitors am
anderen Ende und schon kann's losgehen. Es kann aber sein, dass man an
einem Trimmer an der Ger&#228;tr&#252;ckseite noch Anpassungen machen muss. Dies ist
aber nur bei einigen Amiga-Modellen zu tun und sehr einfach. Man ben&#246;tigt
einen normalen Minischraubenzieher und ein ruhiges H&#228;ndchen. Mit ein paar
Umdrehungen am Trimmer ist man auch damit fertig und das Bild steht ruhig
auf dem Monitor. Mit Hilfe eines Jumpers, der auch von au&#223;en zug&#228;nglich
ist, kann man den Scandoubler auch einen invertierten Takt erzeugen lassen.
Dies kann auf einigen Monitoren zu einer besseren Bildqualit&#228;t f&#252;hren.
<P>
Ein Problem mit der Installation haben nur die Amiga-User, die ihr Netzteil
schon ohne AmiScan an der Leistungsgrenze fuhren. Da n&#228;mlich AmiScan seine
Stromversorgung vom Amiga-Netzteil bezieht, kann das Originalnetzteil
&#252;berlastet werden. Hier wird dann eine Anschaffung eines "Power-Netzteils"
n&#246;tig.
<P>
Die Anleitung, die einem bei der ohnehin sehr einfachen Installation
behilflich ist, besteht aus einem A4-Blatt, welches beidseitig bedruckt
ist. Sie ist in verst&#228;ndlichem Deutsch geschrieben und man hat keine
Probleme beim Lesen, wie z.B. bei Produkten aus Fernost.
<P>
<B>Betrieb</B>
<P>
Wichtig ist bei einem Scandoubler auch, wie es mit der Bildqualit&#228;t
aussieht. Diese ist annehmbar. Leider kann man einige senkrechte Streifen
auf dem Bildschirm erkennen. Diese lassen sich zwar durch Drehen am oben
beschriebenen Trimmer reduzieren, mir ist es aber nie gelungen, sie ganz
"wegzudrehen". Es kann sein, dass man die Streifen auf anderen Amigas
"wegdrehen" kann und dieses Problem nur bei mir auftritt. Ich kann also
nichts Allgemeing&#252;ltiges dazu sagen.
Sonst kann man an der Bildqualit&#228;t nichts aussetzen. Auch im Langzeittest
l&#228;sst die Bildqualit&#228;t nicht nach.
<P>
Die Verdopplung der Zeilenfrequenz wird nat&#252;rlich nur bei 15kHz-Modi wie
PAL, NTSC oder Euro36 aktiv. Die anderen Modi mit h&#246;herer Frequenz werden
durchgef&#252;hrt. Der Super72-Modus wird z.B. auch durchgef&#252;hrt, ist aber auf
Standard-VGA-Monitoren nicht darstellbar, da er eine 24kHz-Zeilenfrequenz
hat. Eine rote LED auf dem Geh&#228;use des Scandoublers zeigt, ob ein
Screenmode durchgef&#252;hrt oder verdoppelt wird.
<P>
Ein Manko, das aber sehr stark auff&#228;llt, ist eine gewisse Vorw&#228;rmzeit des
Scandoublers. Kurz nach dem Einschalten ist das erzeugte Bild des
Scandoublers sehr unruhig. Erst nach ca. 3-5 Minuten "Vorgl&#252;hzeit" steht
das Bild. Das Wort "vorgl&#252;hen" kann man fast w&#246;rtlich nehmen, da der
Scandoubler bei Betrieb ziemlich hei&#223; wird. Einige Millimeter &#252;ber dem
Scandoubler konnte ich mit einem Thermometer eine Temperatur von &#252;ber 45&#176;C
messen. Damit macht er fast der CPU Konkurrenz. Die hohe Temperatur wird
wahrscheinlich dadurch verursacht, dass es in der ca. 5.5x10x2 (BxTxH in
cm) gro&#223;en Box keine L&#252;ftungsschlitze gibt.
<P>
Eine weitere Einschr&#228;nkung gibt es bei der Darstellung des SuperHires-
Modus. Hier wird nur jedes zweite Pixel verdoppelt. Die Darstellung wird
dadurch extrem in der Qualit&#228;t gemindert. Ich w&#252;rde aber sagen, dass dies
kein sehr gro&#223;er Verlust ist, da dieser Modus wohl von nur sehr wenigen
benutzt wurde.
<P>
<B>Flickerfixer</B>
<P>
Ich habe nur die Scandoubler-Version vom AmiScan getestet, und kann deshalb
keine Aussagen zur Bildqualit&#228;t bei den entflickerten Modi machen. Deshalb
hier nur nochmal kurz die Funktionen des Flickerfixers. Der AmiScan wird
auch in der Scandoubler-Version schon mit aller Hardware f&#252;r einen
Flickerfixer ausgeliefert.
Das Einzige was fehlt sind zwei FRAM-Module f&#252;r den Vollbildspeicher, die
man auch nachtr&#228;glich kaufen und nachstecken kann.
<P>
Zum &#214;ffnen des Scandoublers/Flickerfixers wird ein
Kreuzschlitzschraubenzieher ben&#246;tigt. Es sind zwei Schrauben zu l&#246;sen und
schon kommt man an den wertvollen Inhalt.
Nach dem Nachr&#252;sten verdoppelt der Flickerfixer alle 15kHz-Modi. Also wird
nur das Interlaced-Flimmern bei PAL, NTSC und Euro36 eliminiert. Alle
anderen Modi flimmern auch weiterhin.
Trotzdem ist der Flickerfixer n&#252;tzlich, da man den PAL-Interlaced-Modus
benutzen kann, ohne auf den deutlich langsameren DblPal-Modus zur&#252;ckgreifen
zu m&#252;ssen.
<P>
<B>Bewertung</B>
<P>
Die Bildqualit&#228;t ist annehmbar, die Installation einfach und die
Aufr&#252;stbarkeit zum Flickerfixer einmalig. Eigentlich gibt es keine
Alternative (bis auf Konkurrenzprodukte), wenn man einen qualitativ
hochwertigen Monitor an seinen Amiga anschlie&#223;en will.
<P>
<B>Anbieter</B>
<P>
Vesalia Computer<BR>
Industriestra&#223;e 25<BR>
D-46499 Hamminkeln<BR>
<P>
Tel.: (02852) 914010-14  Fax.: (02852) 1802<BR>
<A HREF="http://www.vesalia.de">http://www.vesalia.de</A>
<P>
Preis: 179,- DM
<P>
<B>Testger&#228;t</B>
<P>
Amiga1200 von AT<BR>
Belinea 10-50-76<BR>
AmiScan-Scandoubler ohne Flickerfixer
<P>
F&#252;r Fragen bin ich immer offen, schreibe an meine E-Mail-Adresse:
<P>
<A HREF="mailto:CHoklas@T-Online.de">CHoklas@T-Online.de</A><BR>
<A HREF="http://home.t-online.de/home/CHoklas">http://home.t-online.de/home/CHoklas</A>&#171;
<P>


<P ALIGN=RIGHT>
<A HREF="0601.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0603.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
