<HTML>
<HEAD><TITLE>
Testberichte
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0603.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0605.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Testberichte
</font>
</TD></tr>
</TABLE>


<P>

<H2>4. Softwaretest: Katalogisier-Programm »CDCat 2.2« (von Fabian Kruse)</H2>

<P>
&#187;Viele von Euch sind sicherlich schon auf das Programm "CDCat" aufmerksam
geworden, das Frank Weber regelm&#228;&#223;ig dem AMIGA-aktuell-Gewinnspiel zur
Verf&#252;gung stellt.
Nun liegt es in der Version 2.2 vor und sollte endlich mal genauer
vorgestellt werden.
<P>
<B>Doch worum handelt es sich genau?</B>
<P>
"CDCat" erm&#246;glicht es dem User, seine gesamte CD-ROM-Sammlung zu
katalogisieren (dies ist aber nat&#252;rlich auch mit Disketten oder Festplatten
m&#246;glich, worauf jetzt aber nicht n&#228;her eingegeangen werden soll).
Fortan kann er dann sein gesamtes Archiv oder wahlweise nur bestimmte
Schillerscheiben nach bis zu vier Suchbegriffen durchforsten.
Weiterhin bekommt er die M&#246;glichkeit, in den CDs zu "browsen", sie also zu
durchsuchen, ohne dass die jeweilige CD eingelegt ist.
Hier kann er sich gem&#252;tlich durch die Verzeichnisse klicken und auf Wunsch
bestimmte Dateien anzeigen oder ins RAM kopieren lassen (was nat&#252;rlich das
Einlegen der Scheibe erfordert...).
Das Ganze funktioniert mit Hilfe von Scankatalogen, die "CDCat" auf der
Platte anlegt, und die alle Dateinamen und -pl&#228;tze enthalten.
<P>
Auch ich z&#228;hlte zu den gl&#252;cklichen Gewinnern des Programms und kann es
allen, die MUI installiert haben, nur empfehlen.
Der Suchvorgang geht auf dem Testrechner (040/40, 18 MB RAM, IBM SCSI-2-
Platte) angenehm flink vonstatten und ist auch um einiges komfortabler als
beispielsweise das Aminet-Suchtool.
Diese Scheiben lassen sich &#252;brigens besonders schnell durchsuchen, da ein
spezieller Aminet-Modus eingebaut ist.
Weiterhin kann man auch die Beschreibungen der verschiedenen Dateien
mitdurchsuchen - und das alles in wenigen Sekunden!!
<P>
Den Browser benutze ich hingegen eher selten. Ich bevorzuge in diesem Fall
das Durchw&#252;hlen der CD selbst.
N&#252;tzlich wird er f&#252;r mich erst, wenn ich ein File suche, von dem ich weder
den genauen Namen noch den genauen Platz wei&#223;.
Mit "CDCat" kann ich schnell verschiedene CD-ROMs durchgucken, ohne
jedesmal die CD zu wechseln.
<P>
Auch &#252;ber die Konfigurationsm&#246;glichkeiten von "CDCat" kann man nicht
meckern. Ist das Prog nach der simplen Installation schon sofort 100%ig
einsatzbereit, kann man nach und nach noch verschiedene Kn&#246;pfe zum
Anschauen von Bildern, Anh&#246;ren von Mods oder &#196;hnlichem erg&#228;nzen - sofern
dies nicht sowieso schon &#252;ber den vorhandenen Knopf "Multiview" m&#246;glich
ist.
<P>
Alles in allem ist das Programm von Frank Weber auf jeden Fall
empfehlenswert - wer es einmal hat, wird es nicht mehr missen wollen.
Die M&#246;glichkeit des Konvertierens von DArc-Katalogen sollte auch
Umstiegsmuffeln den rechten Schwung geben - und den auf jeden Fall
gerechtfertigten Preis von DM 30,- f&#252;r die registrierte Version sollte
jeder bezahlen k&#246;nnen, so dass er nicht auf einen Gewinn beim Gewinnspiel
warten muss...
<P>
Hier nochmal die &#220;bersicht &#252;ber die Features (aus dem Guide
&#252;bernommen):
<P>
&#183; geeignet zum Katalogisieren s&#228;mtlicher CDs, Festplatten und PD-Disketten
<P>
&#183; superschneller Aminet-Modus, der Aminet-CDs in wenigen Sekunden scannt
und dabei Alter, Gr&#246;&#223;e und Beschreibung ber&#252;cksichtigt.
<P>
&#183; schnelle und flexible Suchfunktion (85% Inline-Assembler!!)
<P>
&#183; Direktes Durchsuchen (ohne Scankatalog) von Datentr&#228;gern oder
Verzeichnissen m&#246;glich
<P>
&#183; Browser-Funktion, &#252;ber die der Inhalt einzelner CDs verzeichnisweise wie
in einem DirUtil angezeigt werden kann, wobei auch die oben genannten
Aminet-Erweiterungen angezeigt werden, so dass man sich nun nicht mehr
durch die Index-Guides auf den Aminet-CDs qu&#228;len muss.
<P>
=&#62; Durchst&#246;bern der CDs m&#246;glich, ohne dass diese eingelegt sind !!!
<P>
&#183; 15 frei konfigurierbare User-Kn&#246;pfe, &#252;ber die direkt aus "CDCat" heraus
Archive entpackt, Bilder angezeigt, Musikmodule abgespielt etc. werden
k&#246;nnen.
<P>
&#183; Aminet-Beschreibungen k&#246;nnen auf Wunsch mitdurchsucht werden
<P>
&#183; Merkbrett: Hier k&#246;nnen Sie beliebig viele Dateinamen (auch dauerhaft)
zwischenspeichern, wenn Sie die Datei nicht gleich bearbeiten m&#246;chten.
<P>
&#183; Angabe der Verzeichnisse m&#246;glich, in denen gesucht werden soll.
<P>
&#183; Allen Datentr&#228;gern k&#246;nnen "DiskIDs" (Erkennungsnummern) zugeordnet
werden.
<P>
&#183; MUI-Oberfl&#228;che
<P>
Seit der Version 2.0 gibt es &#252;brigens noch ein Feature, das
besonders ausl&#228;ndische AMIGA-User erfreuen d&#252;rfte: Locale-Support!
Jede Menge Catalogs (z.B. Englisch, Franz&#246;sich oder Italienisch) sind
bereits vorhanden.
<P>
Info bei: Frank Weber<BR>
Schlizstra&#223;e 53<BR>
74076 Heilbronn<BR>
Germany<BR>
<P>
<A HREF="mailto:fweber@amigaworld.com">fweber@amigaworld.com</A>
<P>
Tel.: 07131/175749<BR>
<P>
<A HREF="http://www.amigaworld.com/support/cdcat/cdcat.html">http://www.amigaworld.com/support/cdcat/cdcat.html</A>&#171;
<P>


<P ALIGN=RIGHT>
<A HREF="0603.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0605.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
