<HTML>
<HEAD><TITLE>
Testberichte
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0604.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0606.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Testberichte
</font>
</TD></tr>
</TABLE>


<P>

<H2>5. Softwaretest: Acrobat-Reader »xpdf« (von Uwe Pannecke)</H2>

<P>
&#187;PDF-Dokumente auf dem AMIGA? Kein Problem!
<P>
Als system&#252;bergreifendes Dokumentformat hat sich (neben HTML im WWW des
Internets) in den letzten Jahren das von der Firma Adobe Systems Inc.
entwickelte Portable Document Format (PDF) durchgesetzt.
Ein Format, das neben Text auch eingebettete Bilder, Grafiken und Links
enthalten kann. Unmengen an CD-ROMs legen davon Zeugnis ab.
J&#252;ngstes (AMIGA-) Beispiel: die AmigaPlus-CD von Heft 08/98.
Dort finden sich f&#252;r alle Raytracer neben der Vollversion(!) von Maxon
Cinema 4D V4 einige interessante Tutorials / Handb&#252;cher zu Maxon Cinema 4D
im PDF-Format.
<P>
<A HREF="img/xpdf1.png">Screenshot</A>
<P>
Der Adobe-eigene Acrobat-Reader f&#252;r die Anzeige der PDF-Dateien existiert
leider nur f&#252;r einige Rechnerplattformen. Und wieder einmal ist der AMIGA
nicht darunter. Doch keine Panik - es gibt schon lange Abhilfe.
Mindestens zwei Programme &#246;ffnen auch dem Amiganer das Tor zur PDF-Welt:
"xpdf" und "Ghostscript".
Das au&#223;erordentlich umfangreiche, leistungsf&#228;hige und interessante
"Ghostscript" soll hier nicht weiter besprochen werden.
Ich habe "xpdf", einen kleinen und feinen PDF-Anzeiger, der unter X-
Windows-Systemen bei Un*x und Co, VMS, OS/2 und AMIGA l&#228;uft, unter die Lupe
genommen.
"xpdf" wurde von Derek B. Noonburg entwickelt, der AMIGA-Port und libx11
stammen von Terje Pedersen.
Das Programmpaket liegt jeweils f&#252;r 68020 und  68040-Prozessoren vor.
<P>
"xpdf" musste sich auf meinem A3k mit 12 MB RAM und einem 040/40-Prozessor
unter CyberGfx 3.x in einem mehrmonatigen Dauertest beweisen.
<P>
<B>Installation</B>
<P>
Das Programmpaket kommt ohne Installer.
Dennoch ist die Installation recht einfach:
1.   Die komplette Schublade "xpdf5" an den gew&#252;nschten Ort auf die
Festplatte kopieren.<BR>
2.   Ein Assign libx11: auf das Verzeichnis "libx11" in der "xpdf5"-
Schublade mittels Texteditor in der user-startup setzen.<BR>
3.1. Rechner neu starten (damit das Assign abgearbeitet wird) oder<BR>
3.2. das Assign nochmals per Hand in die Shell eingeben.<BR>
Fertig.
<P>
<B>Programmnutzung</B>
<P>
"xpdf" kann entweder über die Shell oder von Programmen wie DOpus
aufgerufen werden. Dabei solltet ihr unbedingt beachten, dem Programm einen
Stack von 20000 zuzuweisen, und schon kann das erste PDF-Dokument geladen
werden.
<P>
Startet ihr "xpdf" ohne Angabe eines zu ladenden Dokuments, &#246;ffnet das
Programm ein Fenster auf der Workbench und wartet auf Eure Befehle.
Dieses Fenster kann auch auf Public-Screens erscheinen - dann muss aber
in libx11-Verzeichnis die Datei AmigaDefaults angepasst und der Public-
Screen vor dem "xpdf"-Start ge&#246;ffnet werden.
Das "xpdf"-Fenster kommt jedem X11-User unter Un*x vertraut vor - kein
Wunder, denn "xpdf" ist eine X11-Portierung (deshalb wird auch das libx11-
Verzeichnis ben&#246;tigt).
Ein Klick mit der rechten Maustaste l&#228;sst ein Popup-Menu erscheinen, in dem
ihr bestimmte Aktionen ausl&#246;sen k&#246;nnt:
<P>
<A HREF="img/xpdf2.png">Screenshot</A>
<P>
Ein Mausklick auf "Open" &#246;ffnet einen Dateirequester (wer h&#228;tte das
gedacht...) und erlaubt die Auswahl eines zu ladenden Dokuments.
<P>
<A HREF="img/xpdf3.png">Screenshot</A>
<P>
Ist das Dokument geladen, kann &#252;ber eine Gadget-Leiste bequem im Dokument
<UL><LI>
   gebl&#228;ttert,
</LI><LI>
   gezielt Seiten angesprungen,
</LI><LI>
   nach Textstellen gesucht und
</LI><LI>
   die Seite vergr&#246;&#223;ert und verkleinert werden.
</LI><LI>
   Dar&#252;ber hinaus kann &#252;ber ein weiteres Gadget das Dokument "gedruckt"
werden.
<P>
</LI></UL>
Dabei bewirkt ein Mausklick auf das Druckergadget eine Ausgabe des
Dokuments im Postscript-Format. Dies l&#228;sst sich dann auch mit dem AMIGA bei
Bedarf ausdrucken - vorausgesetzt, ihr habt ein Programm zur Hand, das mit
Postscript klarkommt, wie z.B. FinalWriter mit Hilfe der post.library (bzw.
HWGpost) oder Ghostscript.
<P>
Scrollbalken erlauben eine freie Bewegung auch bei gro&#223;en Seiten und
geringer Bildschirmaufl&#246;sung.
<P>
<A HREF="img/xpdf4.png">Screenshot</A>
<P>
Mir sind w&#228;hrend der gesamten Testzeit nur wenige Minuspunkte aufgefallen:
"xpdf" hat hin und wieder leichte Probleme mit in den Dokumenten
eingebetteten Font-Formaten. Dies st&#246;rt aber nicht &#252;berm&#228;&#223;ig, da der Text
dennoch lesbar bleibt.
&#196;hnlich wie "Ghostscript" legt "xpdf" auch auf einem 68040/40-Prozessor
eine gem&#228;chliche Arbeitsgeschwindigkeit an den Tag.
<P>
<B>Fazit</B>
<P>
"xpdf" ist ein sehr nützliches Programm, das zuverlässig seinen Dienst
versieht und dem Amiganer das Tor zu plattform&#252;bergreifenden PDF-Dokumenten
&#246;ffnet.<BR>
Gegen&#252;ber Ghostscript bietet "xpdf" eine (intuitiv bedienbare)
Benutzeroberfl&#228;che und verbraucht, wenn nur PDF-Dateien zur Diskussion
stehen, deutlich weniger Platz auf der Festplatte und im RAM.
W&#228;hrend einer mehrmonatigen Nutzungszeit ist "xpdf" kein einziges Mal
abgest&#252;rzt.<BR>
"xpdf" ist f&#252;r jeden, der PDF-Dokumente lesen m&#246;chte, sehr empfehlenswert.
<P>
Zu finden ist das Programm im Aminet und auf den Aminet-CDs unter
<P>
gfx/show/xpdfxx_xxx.lha (aktuell ist die Version xpdf5e_xxx.lha).
<P>
Auf der Homepage des Programmautors Derek B. Noonburg
<P>
<A HREF="http://www.aimnet.com/~derekn/xpdf">http://www.aimnet.com/~derekn/xpdf</A>
<P>
k&#246;nnt ihr weitere Informationen zu "xpdf" und dem PDF-Format finden.
<P>
Uwe Pannecke<BR>
<A HREF="mailto:Uwe.Pannecke@t-online.de">Uwe.Pannecke@t-online.de</A>&#171;
<P>


<P ALIGN=RIGHT>
<A HREF="0604.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0606.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
