<HTML>
<HEAD><TITLE>
AMIGA International, Inc. / AMIGA, Inc.
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0800.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0802.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA International, Inc. / AMIGA, Inc.
</font>
</TD></tr>
</TABLE>


<P>

<H2>1. Kaum Neues von AMIGA, Inc. auf der Amiwest-Messe</H2>

<P>
Wer weitere Informationen zu den von der AMIGA-Entwicklungsabteilung
angek&#252;ndigten neuen AMIGA-Rechnern erwartet hatte, wurde (wieder einmal)
entt&#228;uscht. Insbesondere verl&#228;ssliche Details zu dem f&#252;r die 99'er-
Generation geplanten Multimedia-Chipsatz sind immer noch nicht erh&#228;ltlich,
vom Herstellernamen dieser Hardware ganz zu schweigen.
<P>
Jedoch spezifizierte Bill McEwen, der Marketingchef von AMIGA, Inc., auf
der Veranstaltung wenigstens, was der neue AMIGA auf jeden Fall k&#246;nnen
m&#252;sse:
<P>
&#187;<B>Video und Ton:</B>
<P>
<UL><LI>
   Echtzeit 3D-Rendering-Engine mit 2D-Grundformen
</LI><LI>
   HDTV mit bis zu 1920x1080
</LI><LI>
   RGB, PAL &#38; NTSC Bildformate
</LI><LI>
   Mehrfaches und gleichzeitiges Dekodieren von MPEG-II
</LI><LI>
   In Hardware integriertes Filtern und Skalieren, Farbraumkonvertierungen,
Flickerfixer
</LI><LI>
   Dolby AC-3
<P>
</LI></UL>
<B>Multimedia / RISC-System</B>
<P>
<UL><LI>
   erweiterbar durch mehrere Multimediaprozessoren (wie der jetzige Amiga)
</LI><LI>
   56k Modem (minimal)
</LI><LI>
   PCI-Bus-Controller
</LI><LI>
   umfangreiche Entwicklungsumgebung - C++, Assembler, Debugger, Linker etc.
</LI><LI>
   Native Java-VM
<P>
</LI></UL>
Chip-Spezifikationen
<P>
<UL><LI>
   400 Millionen texturierte, mit Bitmaps belegte Pixel pro Sekunde. Bei 24
Bit pro Pixel entspricht das einem Durchsatz von 1,2 GB/s durch die 3D-
Engine.
</LI><LI>
   Zum Vergleich: ECS-Amigas haben ungef&#228;hr 8 MB maximalen Durchsatz zum
Chip-RAM
</LI><LI>
   A4000/1200-Systeme haben maximal ca. 32MB/sec. Zugriff auf das Chip-RAM
(im Chip-RAM liegen die Video- und Audiodaten)
</LI><LI>
   4 gleichzeitig lauff&#228;hige MPEG-II-Abspieler.
<P>
</LI></UL>
Der Weg, den Amiga Inc. gehen m&#246;chte, ist folgender:
[...direkt den Pr&#228;sentations-Dias entnommen]
<P>
<B>Spiele</B>
<UL><LI>
   Die Vorstellungskraft ist die einzige Grenze dieses Rechners
</LI></UL>
[Hier ist das Geld und das, was die Masse der Computeranwender wirklich von
ihren Computern wollen]
<P>
<B>Internet</B>
<UL><LI>
   Verbindungen zu Leuten, Unterhaltung &#38; Information
</LI></UL>
[einfache Anbindung ans Internet. Vollst&#228;ndige Integration]
<P>
<B>Digitale Medien und deren Verbreitung</B>
<UL><LI>
   Digitalisierter Realismus
</LI><LI>
   Ausdruck der Vorstellungskraft
<P>
</LI></UL>
Electronic Paradigm shift - Digital appliances prolific
{Anm.: nicht &#252;bersetzt}
<P>
<UL><LI>
   Heimelektronik und Computer verschmelzen
</LI></UL>
[andere Firmen versuchen das gerade, gehen aber alle ihre eigenen Wege.
Amiga kann diese L&#252;cke schlie&#223;en.]
<P>
<B>Amiga-Tugenden:</B>
<P>
<UL><LI>
   Exec - der beste Micro-Kernel 1985
</LI><LI>
   auch jetzt IMMER NOCH der beste
</LI><LI>
   vollkommen Pr&#228;emptiv
<P>
</LI></UL>
<B>F&#252;r die neuen Systeme brauchen wir:</B>
<P>
<UL><LI>
   Speicherschutz
</LI><LI>
   Virtuellen Speicher
</LI><LI>
   Multi-Prozessorf&#228;higkeit
</LI><LI>
   Echtzeit
<P>
</LI></UL>
[Bill unterstreicht, dass dies die Ziele f&#252;r das neue System sind.]
<P>
<B>Zus&#228;tzliche APIs machten den Amiga klein, schnell und effizient.</B>
<P>
<UL><LI>
   brauchen OpenGL
</LI><LI>
   brauchen Java
</LI><LI>
   brauchen Internet
</LI><LI>
   brauchen APIs, die das Zusammenf&#252;hren
<P>
</LI></UL>
<B>Ein-/Ausgabe Zusatzchips</B>
<P>
<UL><LI>
   brauchen 1394 und USB
</LI><LI>
   brauchen ADSL oder &#228;hnliche Hochgeschwindigkeitsnetzwerkanbindungen
<P>
</LI></UL>
<B>AutoConfig</B>
<P>
<UL><LI>
   PCs haben "plug and pray"
<P>
</LI></UL>
[obwohl es wie ein Witz klingt, hat der Amiga trotz seines Mangels an
Treibern eher ein plug and PLAY]
<P>
<B>Dynamisch konfigurierbare Lokalisation</B>
<P>
<UL><LI>
   IMMER NOCH der einzige Spieler auf dem Feld
<P>
</LI></UL>
[Bill f&#252;gte hinzu, dass dies ein sehr wichtiger Punkt f&#252;r Dr. Havemose sei]
<P>
<B>Andere interessante Punkte:</B>
<P>
McEwen betont, dass der neue Amiga aus der Masse hervorstechen muss. Er
unterstrich, dass die momentanen PC-Alternativen einsch&#252;chternd, schwierig
zu bedienen, teuer und oftmals schon kurz nach ihrem Erscheinen &#252;berfl&#252;ssig
seien. Das f&#252;hrt zu einer gro&#223;en Belastung f&#252;r die bereits tr&#228;ge gewordene
PC-kaufende &#214;ffentlichkeit. Die Ziele, die sie gesteckt haben, werden zu
einenm pers&#246;nlichen Computer f&#252;hren, wo das Wort "pers&#246;nlich" wieder eine
Bedeutung hat.
<P>
Das war schon immer ein starker Punkt des Amiga. McEwen erw&#228;hnte, dass er
nicht aus diesem Lager k&#228;me [Amiga], aber dass er eine Gemeinde s&#228;he.
W&#228;hrend dieser Pr&#228;sentation sagte er, "dass Gateway nicht diese gro&#223;en
Pl&#228;ne f&#252;r den Amiga hatte. Sie dachten, sie h&#228;tten Patente und
Warenzeichen, sie wussten nicht, dass sie alle [die Amiga-Gemeinde] mit
dazugeh&#246;ren." Der ganze Raum brach in Lachen aus. In der Tat konnte Gateway
nicht so eine widerhallende Resonanz von etwas erwarten, das sie f&#252;r eine
tote Plattform hielten.
<P>
Ich glaube, sie sehen uns jetzt; nicht als Belastung sondern als Wert. An
alle, die Zweifel an ihrer Ehrlichkeit haben: Gebt ihnen eine Chance. H&#246;rt
sie an. Ich wei&#223;, dass ihr genauso &#252;berrascht von ihrem Einsatz sein
werdet, wie ich es war.&#171;
<P>
[Diese Details der Amiwest-Pr&#228;sentation von Bill McEwen wurden von Jeffrey
D. Webster festgehalten, von R&#252;diger Engel f&#252;r das AMIGA-Club-Projekt AIDA
(<A HREF="http://www.amiga-club.de/aida/index.html">http://www.amiga-club.de/aida/index.html</A>) ins Deutsche &#252;bersetzt und AMIGA
aktuell freundlicherweise zur Verf&#252;gung gestellt.]
<P>
&#220;brigens: Auf die Frage, warum weder Jeff Schindler, Chef von AMIGA, Inc.,
noch Dr. Allan Havemose, Leiter der Software-Entwicklung, zur Amiwest-Messe
erschienen waren, antwortete McEwen, dass sie AMIGA-gesch&#228;ftlich zu tun
h&#228;tten und Vertragsverhandlungen ihre gesamte Aufmerksamkeit ben&#246;tigten.
Vielleicht ist das ja ein gutes Zeichen...
<P>


<P ALIGN=RIGHT>
<A HREF="0800.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0802.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
