<HTML>
<HEAD><TITLE>
Diverse Neuigkeiten
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="1007.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="1009.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Diverse Neuigkeiten
</font>
</TD></tr>
</TABLE>


<P>

<H2>8. Shareware-Discount-Angebote von PerSuaSiVe SoftWorX</H2>

<P>
&#187;Shareware Discount-Angebote   (2.7.98)
<P>
PerSuaSiVe SoftWorX bietet nun konstante Discount-Raten f&#252;r Anwender,
die mehr als ein Programm auf einmal registrieren m&#246;chten.
<P>
Falls Sie eines der Programme, die mit 1 bis 6 bezeichnet sind
registrieren m&#246;chten, erhalten Sie - nur zeitgleich - einen Nachlass
auf alle Produkte, die mit A bis H bezeichnet sind.
<P>
Dies bedeutet: sie k&#246;nnen - m&#252;ssen aber nicht - eines der anderen
Programme ebenfalls zur Registrierung ausw&#228;hlen und dabei ein
wenig Geld f&#252;r die Registrierung sparen.
<P>
BITTE F&#220;LLEN SIE HIERZU IMMER DIE REGISTRIERFORMULARE DER JEWEILIGEN
PROGRAMME, DIE SIE REGISTRIEREN M&#214;CHTEN, AUS. DANN F&#220;GEN SIE EINFACH
dieses FORMULAR BEI - F&#220;LLEN SIE JEDOCH ZUMINDEST DAS REGISTRIERFORMULAR
DES PROGRAMMES AUS, DAS SIE ANHAND DER UNTENSTEHENDEN NUMMER GEW&#196;HLT
HABEN (falls vorhanden).
<P>
Eine Ausnahme sind die SuperView-Library PPC-Module, die nur einzeln
(Nr. 7) bestellt oder den anderen Paketen hinzugef&#252;gt (Buchstabe H)
werden k&#246;nnen.
<P>
Neu ist au&#223;erdem die M&#246;glichkeit zum ausdr&#252;cklich gew&#252;nschten eMail-
Versand, der die Gesamt-Registriergeb&#252;hr nochmals um 5 DM reduziert
(insofern der Gesamtbetrag &#252;ber 25 DM liegt).
<P>
<PRE>Programm                A        B       C       D         E       F
                        akJFIF   akPNG   SView   PNG-Box   DRAFU   TwinIFF
-------------------------------------------------------------------------
1. akJFIF  (3)  15 DM   ***      10 DM   25 DM   25 DM     25 DM   20 DM
2. akPNG   (3)  15 DM   10 DM    ***     25 DM   25 DM     25 DM   20 DM
3. SView   (2)  30 DM   10 DM    10 DM   ***     25 DM     25 DM   20 DM
4. PNG-Box (2)  30 DM   10 DM    10 DM   25 DM   ***       25 DM   20 DM
5. DRAFU   (1)  30 DM   10 DM    10 DM   25 DM   25 DM     ***     20 DM
6. TWinIFF (*)  25 DM   10 DM    10 DM   25 DM   25 DM     25 DM   ***
-------------------------------------------------------------------------

7. SV-PPC  (5)  einzeln:                  30 DM
                als Zusatz (Buchstabe H): 20 DM</PRE>
<P>
Ihre Auswahl:
<P>
<PRE>Programm Nt.  [  ]  plus  O A  O B  O C  O D  O E  O F  O G  O H</PRE>
<P>
<PRE>Gesamtsumme:   ______ DM/U$/UKP</PRE>
<P>
O Ich m&#246;chte eMail-Versand an die untenstehende eMail-Adresse
w&#228;hlen; falls die Gesamtsumme gr&#246;&#223;er als 25 DM ist, kann
ich die Versandkosten von 5 DM abziehen, was in der folgenden
Summe resultiert
<P>
<PRE>Zwischensumme: ______ DM/U$/UKP</PRE>
<P>
F&#252;r Datatypes erfolgt der Versand von Keyfiles AUSSCHLIESSLICH
per eMail, solange die Gesamtsumme (wie oben) 25 DM nicht &#252;berstiegen
hat (siehe auch die Dokumentation der Datatypes). Falls dennoch
Postversand gew&#252;nscht ist, bitte hier ankreuzen und 5 DM hinzuaddieren.
Postversand nach &#220;bersee kostet ansonsten ebenfalls zus&#228;tzlich WEITERE
5 DM, also bitte auch hier eintragen:
<P>
<PRE>O Postversand     DATATYPES            (5 DM)
O Postversand     &#220;BERSEE  (alles)     (5 DM)   (**)</PRE>
<P>
<PRE>ENDSUMME:      ______ DM/U$/UKP</PRE>
<P>
<PRE>
eMail  __________________________________________________________

Post   __________________________________________________________
Adresse
       __________________________________________________________

       __________________________________________________________

       __________________________________________________________

       __________________________________________________________</PRE>

<HR>
Tabelle f&#252;r W&#228;hrungsumrechnung:
<P>
<PRE> 5 DM  =  3 U$   = 2  UKP
10 DM  =  7 U$   = 4  UKP
15 DM  = 10 U$   = 6  UKP
20 DM  = 13 U$   = 7  UKP     Sicherlich nicht sehr genau, aber
25 DM  = 15 U$   = 9  UKP     einfacher als ungerade Werte zu
30 DM  = 20 U$   = 11 UKP     verwenden. Bald dann in "Euro"...</PRE>
<HR>
Hinweis: dies ist lediglich eine Tabelle um die Berechnung der Discounts
zu vereinfachen. F&#252;r die konkreten Copyright-, anderen legalen und
rechtlichen Informationen schauen Sie bitte in die eigentlichen Programm-
dokumentationen und Registrierformulare.
<P>
Die Preise k&#246;nnen sich gelegentlich den Gegebenheiten anpassen,
d.h. &#228;ndern. Sollte sich der Preis irgendeines Programmes ge&#228;ndert
haben, ignorieren Sie einfach diesen innerhalb der Tabelle und
warten Sie eine aktualisierte Liste ab.
<P>
<PRE>(1) f&#252;r Amiga 68k
(2) f&#252;r Amiga 68k, jedoch vorbereitet f&#252;r SuperView PPC-Modules
(3) mit PPC-Support (in registrierter Version)
(4) SV-PPC-Modules zur Verwendung mit SView, PNG-Box, ImageEngineer,
PMPro und (teilweise) DRAFU - sowie auch einigen anderen Programmen
(*) Keyfile arbeitet mit Amiga und PC-Version
(**) nein, Gro&#223;brittanien ist nicht &#220;bersee
</PRE>
Besuchen Sie <A HREF="http://wdo.de/ark/">http://wdo.de/ark/</A>&#171;
<P>


<P ALIGN=RIGHT>
<A HREF="1007.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="1009.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
