<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - ADescent PPC</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>ADescent PPC</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>

<P><B>Vorwort</B></P>

<P>1995 erschien f&uuml;r den PC ein Spiel namens &quot;<B>Descent</B>&quot;, welches damals (zu
Recht) f&uuml;r sehr viel Aufsehen sorgte. 1998 wurde der Sourcecode von den
Herstellern &quot;Parallax Software&quot; und &quot;Interplay&quot; freigegeben und seitdem
erschienen eine Reihe von Portierungen f&uuml;r die 68K- und PPC-Amigas.</P>

<P>Eine Portierung hiervon habe ich mir mal n&auml;her angeschaut: &quot;ADescent&quot;
von Holger Jakob. Sie ist ausschlie&szlig;lich auf PowerPC-Amigas lauff&auml;hig,
die den PowerUp-Kernel von Phase5 nutzen. </P>

<P>Bevor ich auf diesen Port eingehe, stelle ich Ihnen erstmal das Spiel
&quot;Descent&quot; in seinen grundlegenden Eigenschaften vor. </P>

<P><B>Descent</B> </P>

<P>Descent ist ein Spiel, welches total dreidimensional ist - im Gegensatz
zum Beispiel zu &quot;Doom&quot; - und es verdient auch wirklich die auf der
Verpackung angegebene Bezeichnung `360&#176;-Spiel`. Das bedeutet, da&szlig; man
sich aus dem Cockpit eines Raumschiffes blickend in den 30 Spielleveln
komplett frei bewegen kann, was ein wirklich beeindruckender Effekt ist. </P>

<P>Diese Levels befinden sich in einem Bergwerk und werden von Robotern
bewacht, denen eine sehr hohe k&uuml;nstliche Intelligenz programmiert worden
ist. Das Spielziel ist dem oben genannten Spiel von ID-Software identisch:
Durchqueren Sie alle Levels, bek&auml;mpfen und vernichten Sie die Gegner,
finden Sie Schalter, die T&uuml;ren zum Weiterkommen &ouml;ffnen und sammeln Sie
Extras, wie zum Beispiel Waffen, Schutzschilde und andere n&uuml;tzliche
Sachen ein. </P>

<P><B>Hardwarevoraussetzungen:</B></P>

<P>Wie schon erw&auml;hnt, wird ein PowerPC-Amiga mit dem PowerUP-Kernel von
Phase5 ben&ouml;tigt, AGA-Grafikchips oder eine Grafikkarte, ca. 13 MB freier
Festplattenspeicher und mindestens 16 MB FastRam.</P>

<P><B>Softwarevoraussetzungen:</B>  </P>

<P>Folgende Software ben&ouml;tigt man, um ADescent auf seinen Amiga lauff&auml;hig zu
machen:  </P>

<P>Zum einen die Portierung &quot;ADescent&quot; und eine aktuelle Version der
&quot;<B>ixemulbridge</B>&quot;, die das Spiel lauff&auml;hig macht. Beide Files erh&auml;lt
man auf der Homepage von Holger Jakob, unter folgender Adresse:    <br>
<A HREF="http://www.ph-cip.uni-koeln.de/~jakob/">http://www.ph-cip.uni-koeln.de/~jakob/</A> </P>

<P>Um eine Soundausgabe zu erhalten, mu&szlig; auf dem Rechner des weiteren das
<B>AHI-System</B> von Martin Blom installiert sein. </P>

<P>Und nun ben&ouml;tigt man noch zwei Files aus dem Orginal-Descent Programm:</P>

<P>&quot;Descent.hog&quot; und &quot;Descent.pig&quot; - beide Files besitzen zusammen eine
Gr&ouml;&szlig;e von ca. 12 MB! Diese Files m&uuml;ssen in der Version 1.5 vorliegen,
fr&uuml;here Descent-Versionen werden von ADescent nicht unterst&uuml;tzt.</P>

<P>Hierzu gilt es zu beachten, da&szlig; das Orginal-Descent-Spiel sehr g&uuml;nstig zu
erwerben ist (auf Diskette oder CD, der Preis betr&auml;gt ca. 15,- DM), die
Version ist aber leider immer kleiner als 1.5. </P>

<P>Hat man eine solche Version erworben, so kann diese durch einen Patch von
<A HREF="http://www.interplay.com">Interplay</A> auf die Version 1.5 geupdatet werden.
Aber: Das Updateprogramm ist nur auf einem PC lauff&auml;hig!</P>

<P>Die einzige mir bekannte k&auml;uflich erwerbare Version 1.5 befindet sich auf
einer Softwaresammlung aus dem Hause Interplay die den Namen &quot;Descent I
and II - The Definitive Collection&quot; tr&auml;gt. Dieses Softwarebundle enth&auml;lt
3 CD's, auf denen sich neben &quot;Descent&quot; auch &quot;Descent 2&quot;, weitere Levels
und ein Mission-Builder befinden. Die &quot;Definitive Collection&quot; habe ich
f&uuml;r 39,- DM erhalten und sie sollte noch in vielen Kaufh&auml;usern oder im
Versandhandel leicht erh&auml;ltlich sein. </P>

<P>Und wer wei&szlig; - vielleicht ist dies eine zukunftstr&auml;chtige Investition,
sollten sich &quot;Interplay/Parallax Software&quot; eines Tages dazu entscheiden
auch den Quellcode von &quot;Descent 2&quot; freizugeben.        </P>

<P><B>Die &quot;Amiga-Version&quot;</B></P>

<P>Nach dem <B>Start</B>, der nur &uuml;ber das Amiga-CLI m&ouml;glich ist, erwartet einen
ein Konfigurationsbildschirm. Nebst den obligatorischen Men&uuml;punkten, wie
&quot;Neues Spiel&quot;, &quot;Laden&quot; und &quot;Speichern&quot;, kann man die Bildschirmaufl&ouml;sung,
die Soundlautst&auml;rke und die Art der Steuerung w&auml;hlen.    </P>

<P>Bei der Amiga-Portierung werden leider nicht alle verf&uuml;gbaren
M&ouml;glichkeiten unterst&uuml;tzt. Zum gegenw&auml;rtigen Zeitpunkt ist eine
Musikwiedergabe und eine Joysticksteuerung <B>nicht m&ouml;glich</B>.     </P>

<P>Dies tut dem gesamten Spielvergn&uuml;gen aber keinen Abbruch, allerdings
ben&ouml;tigt man eine gewisse Zeit, um mit der <B>Steuerung</B> (Tastatur oder Maus)
zurechtzukommen, da durch die neue Bewegungsfreiheit die Steuerung des
eigenen Raumschiffes anf&auml;nglich ein wenig komplexer ist, als bei den
bekannten 'Pseudo-3D-Spielen'. </P>

<P>Hat man sich aber daran gew&ouml;hnt, steht einem ein sehr gro&szlig;es
<B>Spielvergn&uuml;gen</B> bevor, da Descent grafisch, wie erw&auml;hnt, sehr effektvoll
in Szene gesetzt worden ist. Der 3D-Effekt ist wirklich &auml;u&szlig;erst
beindruckend und stellt mit Abstand eine neue Referenz auf dem Amiga
dar! </P>

<P>Selbst die <B>Automap</B> (welche man bei diesem Spiel wirklich ben&ouml;tigt)
wird komplett in der dritten Dimension dargestellt! Auch die Licht- und
Schatteneffekte (z.B. Explosionen) sind ebenso sehenswert und lassen
ebenfalls vergleichbare Spiele auf dem Amiga hinter sich.  </P>

<P>Das Ganze wird auf meinem AGA-Amiga (603/200 MHz) durchschnittlich mit ca.
18 fps (Frames pro Sekunde) dargestellt. Diese <B>Geschwindigkeit</B> bietet
schon einen &auml;u&szlig;erst fl&uuml;ssigen Spielablauf. Auf Grafikkarten wird sogar
eine Anzahl von ca. 40 fps erreicht! </P>

<P>Die <B>Soundausgabe</B> bewegt sich zwar nicht ganz auf diesem hohen Niveau,
ist aber v&ouml;llig ausreichend.  </P>

<P>Descent besitzt eine sehr hohe <B>Spieltiefe</B> und fordert den Spieler.
Simples 'Ballern' f&uuml;hrt oft nicht weit, man mu&szlig; schon sehr strategisch
handeln, um die sehr komplexen Level und die intelligenten Gegner zu
bew&auml;ltigen.</P>

<P>W&auml;hrend meines ausf&uuml;hrlichen Testens kam es zu keinerlei Fehlern, was
diese Portierung absolut empfehlenswert macht.   </P>

<P><B>Cheat:</B></P>

<P>Da dieses Spiel wirklich nicht eines der leichtesten ist, gebe ich hierzu
mal eine kleine Hilfestellung:  </P>

<P>Im Spiel tippt man &quot;GABBAGABBAHEY&quot; ein, und folgende weitere Eingaben
ergeben zus&auml;tzliche M&ouml;glichkeiten:  </P>

<P>MITZIALL = Alle Keycards   <BR>
RACERX   = God-Mode           <BR>
SCOURGE  = Alle Waffen, 100% Munition<BR>
TWILIGHT = Schutzschilde 100% </P>

<P><B>Und sonst noch?</B></P>

<P>Der Programmierer Holger Jakob sieht seine Descent-Portierung als Demo
zu seiner ixemul-bridge an, die incl. Source-Code vorliegt.</P>

<P>Eine Warp3D-Version von Descent wird von Holger Jakob selber nicht kommen,
da er keine 3D-Grafikkarte besitzt. Sollte sich aber jemand dazu berufen
f&uuml;hlen das zu Programmieren, kann er sich gerne auf dieser Grundlage daran
versuchen. </P>

<P><B>Fazit</B></P>

<P>Das Spiel &quot;Descent&quot; ist wirklich ein nahezu perfektes und sehr spannendes
Actionspiel, welches nun durch diese hervorragende PPC-Portierung auch
seinen Weg zu den AmigaPPC-Besitzern gefunden hat, die (noch) nicht den
WarpUP-Kernel installiert haben, f&uuml;r den es ebenfalls gute Portierungen
gibt.  </P>
 <P>
Sollte es Holger Jakob noch gelingen, die vorhandenen Musikst&uuml;cke (welche
laut `Ohrenzeugen` hervorragend sein sollen) mit in die Portierung zu
integrieren, ist diese Portierung dann wirklich perfekt ausgefallen.  </P>

<P>Abschlie&szlig;end der Status der Portierung und die Bezugsquellen:</P>
<P>

<table border=0>
<tr>
<td><b>Programm:</b></td><td><B>ADescent PPC</B></td>
</tr><tr>
<td><b>Status:</b></td><td>Freeware</td></tr><tr>
<td><b>Autor:</b></td><td>Holger Jakob (EMail: <A HREF="mailto:jakob@ph-cip.uni-koeln.de">jakob@ph-cip.uni-koeln.de</A>)
</td></tr>
</table>

<P>Quellen der ben&ouml;tigten Files:</P>

<table border=0>
<tr>
<td>ADescent:</td><td><A HREF="http://www.ph-cip.uni-koeln.de/~jakob">http://www.ph-cip.uni-koeln.de/~jakob</A></td>
</tr><tr>
<td>ixeemulbridge:</td><td><A HREF="http://www.ph-cip.uni-koeln.de/~jakob">http://www.ph-cip.uni-koeln.de/~jakob</A></td>                   
</tr><tr>
<td>AHI-Soundsystem:</td><td><A HREF="http://ftp.uni-paderborn.de/pub/aminet/mus/misc/ahiusr.lha">http://ftp.uni-paderborn.de/pub/aminet/mus/misc/ahiusr.lha</A></td>
</tr>
</table>

<P>Das Descent-Spiel ist im Handel erh&auml;ltlich, n&auml;here Informationen entnehmen
Sie bitte dem obigen Text.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906amg.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906cdc.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

