<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - CDCat</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>CDCat</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>

<P>Wer eine Menge an PD-CD's oder Disketten hat, stellt sich irgendwann
einmal die Frage: &quot;Wo ist eigentlich nochmal Programm XYZ gewesen? War
es auf dieser oder jener CD?&quot;. </P>

<P>Und f&uuml;r die hilfesuchenden Menschen (wie ich es an und wann auch mal
bin ;) m&ouml;chte das Katalogisierungsprogramm &quot;CDCat&quot; die L&ouml;sung bieten.
Ob es das auch tut, verr&auml;t nun der folgende Test. </P>

<P><B>Systemvoraussetzungen und Installation:</B></P>

<P>Um &quot;CDCat&quot; auch nutzen zu k&ouml;nnen, ben&ouml;tigt man mindestens einen Amiga
mit 68020-Prozessor, Festplatte, OS 2.0, MUI 3.3. und das XPK-
Programmpaket, um die Kataloge platzsparend packen zu k&ouml;nnen.</P>

<P>Das Programm bietet per Plugin eine PowerPC-Unterst&uuml;tzung, f&uuml;r die der
PowerUP-Kernel von Phase5 genutzt wird. </P>

<P>Die Installation auf der Festplatte erfolgt mit dem Standard-Installer
von Commodore und bereitet keinerlei Probleme. </P>

<P><B>Anleitung:</B></P>

<P>Mein Kompliment an den Autor Frank Weber! Denn diese Anleitung ist
definitiv die beste im AmigaGuide-Format, die mir bisher je unter die
Augen gekommen ist. Dieser 67 KB gro&szlig;e Guide beschreibt jeden einzelnen
Punkt zur Programmbedienung sehr ausf&uuml;hrlich und leicht verst&auml;ndlich und
bietet zus&auml;tzlich noch 11 Bilder im IFF-Format, die zur Veranschaulichung
der erkl&auml;renden Worte aufgerufen werden k&ouml;nnen.</P>

<P>Zus&auml;tzlich findet man innerhalb des Guide noch einen alphabetischen Index,
in dem die wichtigsten Schlagw&ouml;rter aufgef&uuml;hrt sind und von denen aus man
per Mausklick direkt an die erl&auml;uternde Stelle in der Anleitung gebracht
wird.</P>

<P><B>Das Programm:</B></P>

<P>Nachdem man das Programm gestartet hat, erwartet einen eine MUI-basierende
Benutzeroberfl&auml;che, in der man innerhalb von vier Fenstern (&quot;Scannen&quot;,
&quot;Suchen&quot;, &quot;Browser&quot; und &quot;Manager&quot;) w&auml;hlen kann. Hieran kann man schon
erkennen, da&szlig; &quot;CDCat&quot; weit mehr M&ouml;glichkeiten bietet, als nur das
Durchsuchen und Katalogisieren von Datentr&auml;gern. </P>

<P>Per rechtem Mausklick gelangt man ins Men&uuml;, in dem man alle &uuml;blichen
Programminformationen findet und das Programm nach seinen eigenen W&uuml;nschen
vollst&auml;ndig konfigurieren kann; z.B., ob die gescannten Daten, aus denen
&quot;Kataloge&quot; erstellt werden, durch das XPK-System platzsparend gesichert
werden sollen. </P>

<P>Zur&uuml;ck zu der Programmoberfl&auml;che: </P>

<P><B>Scannen</B></P>

<P>Im Fenster &quot;Scannen&quot; k&ouml;nnen alle vorhandenen Datentr&auml;ger, wie z.B. CD's,
Festplatten oder Disketten durchsucht und als Katalog gesichert werden.
Aminet-CD's werden durch einen optimierten Modus noch schneller als
andere Datentr&auml;ger gescannt und die Beschreibungen der Programme werden
dabei ebenfalls mit ber&uuml;cksichtigt.</P>

<P><B>Suchen</B> </P>

<P>Im &quot;Suchen&quot;-Fenster lassen sich die gescannten Kataloge einzeln oder in
der Gesamtheit mit maximal vier verschiedenen Suchmustern durchsuchen.
Es werden maximal 8.000 gefundene Daten ausgegeben. </P>

<P>Und hier kommen die Besitzer eines PPC-Prozessors wirklich auf Ihre Kosten.
Folgender Vergleich veranschaulicht den Geschwindigkeitsunterschied eines
PPC603e-Prozessors gegen&uuml;ber einem 68040-Prozessor:</P>

<P>Ich durchsuchte die Kataloge von 66 CD's verschiedenster Art (Aminet, PD-
Sammlungen und andere Daten-CD's) nach dem Stichwort &quot;Amiga&quot;. W&auml;hrend die
6804o-CPU daf&uuml;r 160 Sekunden ben&ouml;tigte, war der PPC-Rechner bereits nach
54 Sekunden mit dem Suchen fertig!</P>

<P>Neben dem Durchsuchen der gespeicherten Scankataloge ist auch ein direktes
Scannen der aktuellen Datentr&auml;ger m&ouml;glich. </P>

<P>Nachdem die gefundenen Dateien ausgegeben wurden, lassen sich auf diese
mittels 15 frei konfigurierbarer User-Kn&ouml;pfe (k&ouml;nnen mit Amiga-DOS-
Befehlen belegt werden) direkt von &quot;CDCat&quot; aus weitere Aktionen anwenden,
wie z.B. Programme starten, Achive entpacken, Bilder anzeigen und vieles
mehr. Hierbei kann man &quot;CDCat&quot; schon fast mit einem Dateimanager, wie
z.B. DirectoryOpus vergleichen.</P>

<P><B>Browser</B></P>

<P>Dieses Fenster bietet die M&ouml;glichkeit, sich den Datentr&auml;gerinhalt
verzeichnisweise anzuschauen und durch das Erscheinen der oben genannten
User-Kn&ouml;pfe, kann man auch von diesem Fenster die Files direkt bearbeiten.</P>

<P><B>Manager</B></P>

<P>Innerhalb des &quot;Manager&quot;-Fensters k&ouml;nnen die Kataloge reorganisiert werden.
Der Katalogmanager ist eigentlich recht gelungen, es lassen sich alle
n&ouml;tigen Operationen innerhalb eines Kataloges ausf&uuml;hren. Leider vermisse
ich pers&ouml;nlich die M&ouml;glichkeit neue Kataloge direkt im Programm zu
erstellen. Dies ist leider nur &uuml;ber ein externes Programm, z.B. einen
Dateimanager, m&ouml;glich.</P>

<P><B>M&auml;ngel von &quot;CDCat&quot;:</B></P>

<P>Neben dem eben genannten Punkt im Katalogmanager, trat w&auml;hrend des Testens
ein folgenschwerer Bug zu Tage, der aber wohl jetzt, zum Erscheinen dieses
Artikels, wohl korrigiert sein d&uuml;rfte:</P>

<P>Zum Zeitpunkt, an dem ich diesen Artikel schreibe, war noch die Version
3.0 aktuell, die einen sehr gravierenden Fehler bei der Suchfunktion, in
Kombination von XPK-gepackten Katalogen und Nutzung des PPC-Plugins
aufwies:</P>

<P>Dadurch, da&szlig; eine fehlerhafte Routine den Katalog-Index falsch schrieb,
gingen leider einige Daten 'verloren' (das ist jetzt vereinfacht
ausgedr&uuml;ckt), so da&szlig; man sich nicht auf diese Suchkombination (PPC und
XPK) verlassen konnte.</P>

<P>Mir liegt derweil ein korrigiertes PPC-Plugin vor, welches diesen Fehler
behebt und zum gegenw&auml;rtigen Zeitpunkt wohl auch bereits auf der CDCat-
Support-Seite im Internet ver&ouml;ffentlicht sein sollte.</P>

<P><B>Fazit:</B></P>

<P>&quot;CDCat&quot; ist ein fast perfektes Programm, wenn es um das Verwalten
und Durchsuchen von Datentr&auml;gern geht. Und da es weit mehr als diese
Funktionen bietet und zus&auml;tzlich auch noch durch vielf&auml;ltige
Konfigurationsm&ouml;glichkeiten, die PPC-Unterst&uuml;tzung und eine
hervorragende Anleitung besticht, kann man &quot;CDCat&quot; bedenkenlos
empfehlen! </P>

<P>Der f&uuml;r ein Shareware-Programm recht hohe Preis von 40,- DM f&uuml;r bisher
nicht registrierte User ist allemal gerechtfertigt und auch bereis
registrierte Nutzer fr&uuml;herer Programmversionen kann man die Update-
Investition von 20,- DM ruhigen Gewissens nahelegen.</P>

<P>Im Aminet steht eine eingeschr&auml;nkte Demoversion von &quot;CDCat&quot; zur
Verf&uuml;gung, welche dann nach Erhalt des Keyfiles zur Vollversion wird.</P>

<TABLE BORDER=0>
<TR>
	<TD><b>Programm:</b></TD>
    <TD><B>CDCat 3.01</B></TD>
</TR>
<TR>
	<TD><b>Status:</b></TD>
    <TD>Shareware, Preis der Vollversion: 40,- DM f&uuml;r nicht registierte User; 20,- DM f&uuml;r registierte User fr&uuml;herer Versionen.</TD>
</TR>
<TR>
	<TD><b>Autor:</b></TD>
    <TD><A HREF="mailto:frank@weber.org">Frank Weber</A></TD>
</TR>
</TABLE>

<p>
Bezugsquelle: <A HREF="http://www.amigaworld.com/support/cdcat">http://www.amigaworld.com/support/cdcat</A>
</p>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906ad.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906ppt.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

