<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Peperoni</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Peperoni</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>

<P><B>Peperoni?</B></P>

<P>...was ist denn das f&uuml;r ein `versch&auml;rfter` Programmname, dachte ich, als
ich ihn das erste Mal las! ;-) </P>

<P>Und siehe da: &quot;Peperoni&quot; ist wirklich ein sehr n&uuml;tzliches und
zuverl&auml;ssiges Programm, wenn es darum geht, schnell und bequem Programme
zu packen bzw. zu entpacken. Dies wird durch AppIcons erledigt, welche
sich als &quot;Packen&quot;- und &quot;Entpacken&quot;-AppIcons auf der Workbench plazieren.</P>

<P><B>Systemvoraussetzungen?</B> </P>

<P>Grundvoraussetzung f&uuml;r die Nutzung des Programms ist mindestens ein
68020 Prozessor, OS 3.0, MUI in der Version 3 und freier Speicherplatz
von ca. 400 KB. </P>

<P>Des weiteren werden die Pack- bzw. Entpackprogramme &quot;LHA&quot;, &quot;LZX&quot;, &quot;ZIP&quot;
und &quot;UNZIP&quot; ben&ouml;tigt, welche sich am besten im Befehlverzeichnis &quot;c:&quot;
der Workbench befinden sollten. </P>

<P>Das &quot;DMS&quot;-Format wird leider nicht unterst&uuml;tzt, ebensowenig wie die
exotischeren Formate &quot;ARJ&quot; oder &quot;RAR&quot;. </P>

<P>Aber das l&auml;&szlig;t sich wohl verkraften, da die genutzen Formate ja den
Standard auf dem Amiga darstellen.</P>

<P><B>Anleitung?</B></P>

<P>Diese ist in 3 Sprachen (Deutsch, Englisch und Norwegisch) als Amiga-
Guide vorhanden und sehr ausf&uuml;hrlich und leicht verst&auml;ndlich ausgefallen.</P>

<P>Das Vorwort zu dem Programm ist &uuml;brigens &auml;u&szlig;erst interessant und
humorvoll, daher empfehle ich dieses unbedingt zu lesen!</P>

<P><B>Installation?</B></P>

<P>Diese l&auml;&szlig;t sich nur &quot;per Hand&quot; durchf&uuml;hren, ein Installationsskript
existiert nicht. Allerdings ist dies auch nicht unbedingt vonn&ouml;ten, denn
man braucht nur einfach das Verzeichnis an den gew&uuml;nschten Platz der
Festplatte zu kopieren.</P>

<P>Nebst zwei Programmversionen (1x f&uuml;r 68020- und 1x f&uuml;r 68040/060-
Prozessoren), liegen dem Programm noch zwei vorgefertigte AppIcons bei.</P>

<P><B>Programmstart?</B></P>

<P>Nachdem man &quot;Peperoni&quot; &uuml;ber die Workbench oder die Shell gestartet hat,
erscheinen die beiden AppIcons &quot;Packen&quot; und &quot;Entpacken&quot; auf der WB-
Oberfl&auml;che. </P>

<P>Wenn man nun eins dieser AppIcons anklickt, kann man sich die
verschiedensten Programmvoreinstellungen (z.B. das Packformat, das
Zielverzeichnis, die Kompressionsrate und vieles mehr) nach seinen
eigenen W&uuml;nschen konfigurieren und speichern. Die Vielzahl dieser
Konfigurationsm&ouml;glichkeiten ist wirklich beeindruckend und bleibt
aufgrund einer sch&ouml;n gestalteten MUI-Oberfl&auml;che dennoch sehr
&uuml;bersichtlich.
                   </P> <P>
W&auml;hrend meiner Testphase ist kein einziger Bug aufgetreten und auch
mehrere Files mit verschiedenen Packformaten (z.B. Lha und Zip) lie&szlig;en
sich in einem Durchgang schnell bearbeiten. </P>

<P><B>Fazit?</B> </P>

<P>Dieses Tool (Achtung: Freeware!) ist absolut empfehlenswert f&uuml;r alle,
die &ouml;fter mit gepackten Programmen zu tun haben.</P>


<TABLE BORDER=0>
<TR>
	<TD><b>Programm:</b></TD>
    <TD><B>Peperoni V1.5e</B></TD>
</TR>
<TR>
	<TD><b>Status:</b></TD>
    <TD>Freeware </TD>
</TR>
<TR>
	<TD><b>Autor:</b></TD>
    <TD><A HREF="mailto:udo.kastilan@tr.fh-hannover.de">Udo Kastilan</A></TD>
</TR>
</TABLE>

<p>
Bezugsquelle: <A HREF="http://ftp.uni-paderborn.de/pub/aminet/util/app/Peperoni.lha">http://ftp.uni-paderborn.de/pub/aminet/util/app/Peperoni.lha</A>
</p>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906mp.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../hw/9906scan.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

