<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - PD-Emu-Box</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>PD-Emu-Box</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>

<center><p>
<A NAME="start">Ansprungpunkte:</A> <A HREF="#news">News</A> / <A HREF="liste.htm">Emulatoren-Liste</A>
</p>

<hr>

<h3>Ein herzliches Hallo zu der zweiten PD-Emu-Box im AmZeiger!</h3>
</center>

<P>Nachdem in der Vorbereitungszeit f&uuml;r die erste PD-Emu-Box in der letzten
Ausgabe die Freeware-Ver&ouml;ffentlichung und gleichzeitige Einstellung des
Apple-Macintosh-Emulators &quot;<B>Shapeshifter</B>&quot; f&uuml;r einiges Aufsehen sorgte, war
es diesmal merklich ruhiger in der Emulations-Szene. Nichtsdestotrotz gab
es wieder einige interessante Neuigkeiten, die ich Ihnen wieder
zusammengetragen habe. </P>

<P>Des weiteren stelle ich Ihnen in einem Test den Sega-Mastersystem- und
GameGear-Emulator &quot;<A HREF="9906amg.htm">AmiMasterGear</A>&quot; in seiner neuesten Version 0.6 vor, der
trotz der niedrigen Versionsnummer sehr ausgereift ist und dadurch
gleichzeitig zum &quot;Tip der Redaktion&quot; gek&uuml;rt wurde.   </P>

<P>Auch in dieser Ausgabe ist wieder eine aktuelle  <A HREF="liste.htm">Auflistung</A> der derzeit
erh&auml;ltlichen Emulatoren mit Angabe der Bezugsquellen im Internet
enthalten. </P>

<P>Aufgrund der Schnellebigkeit des Internets kann es in vereinzelnten F&auml;llen
vorkommen, da&szlig; es zu dem Zeitpunkt, an dem Sie diese Liste lesen, schon zu
einigen Adress&auml;nderungen gekommen ist.    </P>

<P>Sollten Sie Unstimmigkeiten feststellen oder Erg&auml;nzungen zu dieser Liste
haben, w&uuml;rde ich mich sehr freuen, wenn Sie mir diese mitteilen.</P>

<P>Und nun viel Spa&szlig; beim Lesen! :-) </P>

<hr>

<h3 align=center><A NAME="news">Neuigkeiten</A> aus der Welt der Emulatoren</h3>

<P>Der Softwarehersteller Blittersoft plant nun doch, entgegen fr&uuml;heren
Ank&uuml;ndigungen, f&uuml;r die beiden kommerziellen Emulatoren &quot;<B>Fusion</B>&quot; (Apple
Macintosh) und &quot;<B>PCX</B>&quot; (PC) Versionen f&uuml;r die PowerPC-Amigas
herauszubringen.</P>

<P>Allerdings werden hierf&uuml;r jeweils 500 Vorbestellungen ben&ouml;tigt und der
Preis hierf&uuml;r ist doch recht happig: 149 US-Dollar! </P>

<P>N&auml;here Informationen hierzu findet man direkt auf der Homepage von
Blittersoft.</P>

<P>[Kurz nach Redaktionsschlu&szlig; wurde bekannt, da&szlig; die Entwickler von Microcode
Solutions die 500 Vorbestellungen zusammen haben und an FusionPPC arbeiten.
Innerhalb von zwei Monaten sollen Ergebnisse zu sehen sein; d. Chefred.] </P>

<p><A HREF="http://www.Blittersoft.com">http://www.Blittersoft.com</A></p>

<hr width="50%">

<P>Der Autor des ZX-Spectrum128-Emulators &quot;<B>CBSpeccy</B>&quot; ist in letzter Zeit
&auml;u&szlig;erst aktiv gewesen und bringt fast w&ouml;chenlich neue Versionen heraus.
 </P><P>
Die derweil aktuelle Version 0.25b ist unter folgender Adresse zu
bekommen: </P>

<p><A HREF="http://www.emuclassics.com/aer/bin0/cbspeccy.lha">http://www.emuclassics.com/aer/bin0/cbspeccy.lha</A></p>

<hr width="50%">

<P>&quot;<B>CoolNESs</B>&quot;, der Nintendo NES-Emulator, ist jetzt in der Version 0.76
erschienen und stellt damit den ausgereiftesten Emulator f&uuml;r diese
Konsole dar. Fr&uuml;here Bugs wurden behoben und auch die Soundwiedergabe
wurde verbessert.</P>

<P>Es ist zwar noch ein l&auml;ngerer Weg zur 100%igen NES-Emulation, aber der
Autor Fredrik Olsson befindet sich auf dem besten Weg dorthin. In der
n&auml;chsten Ausgabe des AmZeigers werde ich Ihnen diesen Emulator in einem
Test n&auml;her vorstellen.</P>

<p><A HREF="http://hem2.passagen.se/flubba/coolness.html">http://hem2.passagen.se/flubba/coolness.html</A>
</p>

<hr width="50%">

<P>Bleiben wir bei Nintendo-Emulatoren: </P>

<P>Der bekannte und empfehlenswerte Gameboy-Emulator &quot;<B>Wzonka-Land</B>&quot; ist jetzt
in der Version 1.00.00 (was f&uuml;r eine interessante Versionsnummer!)
erschienen.
            </P>
<P>Interessierte Gameboy-Fans k&ouml;nnen diesen Emulator unter folgender Adresse
downloaden:</P>

<p><A HREF="http://www.emuclassics.com/aer/bin1/wzonka-lad-fan.lha">http://www.emuclassics.com/aer/bin1/wzonka-lad-fan.lha</A>
</p>

<HR WIDTH="50%">

<P>Ein weiterer Gameboy-Emulator &quot;<B>AmigaVGB</B>&quot;  steht in zwei Versionen (68k
und PPC (PowerUP)) mit einem neuen Update zu Rev.7 im Aminet bereit:</P>

<P>
<A HREF="http://ftp.uni-paderborn.de/pub/aminet/misc/emu/AmigaVGB.lha">http://ftp.uni-paderborn.de/pub/aminet/misc/emu/AmigaVGB.lha</A>         <br>
<A HREF="http://ftp.uni-paderborn.de/pub/aminet/misc/emu/AmigaVGB.lha">http://ftp.uni-paderborn.de/pub/aminet/misc/emu/AmigaVGBPPC.lha</A></P>      

<HR WIDTH="50%">

<P>Am WarpUp vorausetzenden Super-Nintendo-Emulator &quot;<B>Warpsnes</B>&quot; ist ebenfalls
gearbeitet worden. Er erschien jetzt in der Version 3.5.</P>

<P><A HREF="http://ftp.uni-paderborn.de/pub/aminet/misc/emu/warpsnes.lha">http://ftp.uni-paderborn.de/pub/aminet/misc/emu/warpsnes.lha</A></P>

<HR WIDTH="50%">

<P>Und nun kommen wir noch zur Emulation der Nintendo-Konsole &quot;<B>Nintendo64</B>&quot;.</P>

<P>Obwohl diese Konsole wohl nie zufriedenstellend auf einen Amiga emuliert
werden kann, probiert sich Mathias Roslund dennoch daran und ver&ouml;ffentlicht
regelm&auml;&szlig;ig neue Versionen, wobei jetzt ausschlie&szlig;lich der WarpUP-PPC-Kernel
unterst&uuml;tzt wird.</P>

<p><A HREF="ftp://ftp.amidog.com/pub/n64/TrueReality.lha">ftp://ftp.amidog.com/pub/n64/TrueReality.lha</A>
</p>

<HR WIDTH="50%">

<P>Wer ein wenig &uuml;ber den Amiga-Tellerrand schaut und eventuell eine
Nintendo 64-Spielkonsole oder einen Gameboy besitzt, sollte mal einen
Blick auf den sehr gut recherierten und monatlich erscheinenden
&quot;<B>Nintendo Guide</B>&quot; werfen, der in deutscher Sprache herauskommt.</P>

<P>Des weiteren bietet der Autor Jens Jahnke einen kostenlosen EMail-Versand
der aktuellen Neuigkeiten an, die so ca. zwei- bis dreimal mal die Woche
erscheinen. </P>

<p><A HREF="http://ftp.uni-paderborn.de/pub/aminet/docs/mags/Nintendo01_06.lha">http://ftp.uni-paderborn.de/pub/aminet/docs/mags/Nintendo01_06.lha</A>
</p>

<HR WIDTH="50%">

<P>Nach so vielen Nintendo-Emulatoren und Informationen geht jetzt von
meiner Seite aus ein Dank an Frank Paries, der mich darauf aufmerksam
machte, da&szlig; ich seinen Commodore 16-Emulator &quot;<B>C16 V0.3.37</B>&quot; nicht in der
Internet-Link-Liste auff&uuml;hrte. Dies ist nun nachgeholt! :-)</P>

<P>Wer sich ein Bild von diesem Emulator machen m&ouml;chte, kann diesen hier
downloaden:</P>

<p><A HREF="http://members.xoom.com/frank_paries/c16.lha">http://members.xoom.com/frank_paries/c16.lha</A>
</p>

<HR WIDTH="50%">

<P>Mathias Roslund &uuml;berarbeite seinen Sega Megadrive-Emulator &quot;<B>Amigenerator</B>&quot;
komplett neu, so da&szlig; er jetzt bereits in der Version 1.6 vorliegt.</P>

<P>Leider hat dadurch die in der Version 1.0 einfach fantastische
Geschwindigkeit herbe Einbu&szlig;en hinnehmen m&uuml;ssen und ist jetzt auf einem
PPC-Amiga unter AGA zu langsam geworden. Wie es auf Rechnern mit einer
Grafikkarte ausschaut, vermag ich leider nicht zu sagen.</P>

<P>Immerhin ist nun eine grafische Benutzeroberfl&auml;che hinzugekommen, die das
Handling wesentlich vereinfacht. Ich bin gespannt, wie der weitere Verlauf
bei diesem Emulator sein wird und werde Sie hier mit den neuesten
Informationen weiterversorgen.</P>

<p><A HREF="http://ftp.uni-paderborn.de/pub/aminet/misc/emu/AmiGenerator.lha">http://ftp.uni-paderborn.de/pub/aminet/misc/emu/AmiGenerator.lha</A>
</p>

<HR WIDTH="50%">

<P>&quot;<B>Mame</B>&quot;, der bekannte Multi Arcarde Emulator, ist nach l&auml;ngerer Pause jetzt
in einer neuen Version (0.35.12) f&uuml;r 68060-CPU's und PPC erschienen und
unterst&uuml;tzt weitere Arcarde-Roms.</P>

<P>Tip: Man sollte (noch) nicht die vorherige Version (0.34.3) l&ouml;schen, denn
durch eine &Auml;nderung des ROM-Systems kann es dazu kommen, da&szlig; einige Spiele
mit der neuen Version nicht mehr laufen.</P>

<p><A HREF="http://www.stud.ntnu.no/~matsha/mame060.lha">http://www.stud.ntnu.no/~matsha/mame060.lha</A><br>
<A HREF="http://www.stud.ntnu.no/~matsha/mameppc.lha">http://www.stud.ntnu.no/~matsha/mameppc.lha</A>
</p>

<HR WIDTH="50%">

<P>Der MSX-Emulator &quot;<B>fMSX</B>&quot; ist in der Beta-Version 2.2 public Beta 3
erschienen, setzt aber die Installation der offiziellen Ver&ouml;ffentlichung
voraus.</P>

<p><A HREF="http://www.xs4all.nl/~roderick/fmsx/bin/fMSX_2_2b3.lha">http://www.xs4all.nl/~roderick/fmsx/bin/fMSX_2_2b3.lha</A>
</p>

<HR>

<p align=center>
Ansprungpunkte: <A HREF="#start">Einf&uuml;hrung</A> / <A HREF="liste.htm">Emulatoren-Liste</A>
</p>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906tbox.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906amg.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

