<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - AmiMasterGear</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>AmiMasterGear</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>

<P><B>Die Historie:</B></P>

<P>Im Jahre 1987 erschien eine Spielkonsole mit dem Namen &quot;Mastersystem&quot;
der Firma &quot;SEGA&quot;, die sich ja auch vor allem durch die Herstellung von
eindrucksvollen Spielhallenautomaten einen Namen gemacht hatte. </P>

<P>Diese Konsole wartete mit einem Z80-Prozessor, einer Taktrate von 3,6
Mhz und einem RAM von 8 KB auf. 1990 erschien dieses System dann als
Handheldkonsole mit dem Namen &quot;GameGear&quot;, konnte sich aber, trotz
eindeutiger technischer &Uuml;berlegenheit, nicht gegen den Konkurrenten
&quot;Gameboy&quot; von Nintendo durchsetzen.   </P>

<P>F&uuml;r das &quot;Mastersystem&quot; und das &quot;Gamegear&quot; (die beide die gleichen ROM-
Module nutzen k&ouml;nnen!) erschienen bis zum Jahr 1994 einige Klassiker
der Videospielgeschichte, wovon &quot;Sonic&quot; wohl der bekannteste wurde.</P>

<P>Nun k&ouml;nnen Sie diese Hits endlich auch auf Ihrem Amiga spielen! </P>

<P><B>Die Roms</B>: </P>

<P>Tja, es ist wohl hinl&auml;nglich bekannt, dennoch m&ouml;chte ich hier nochmal
darauf hinweisen: Die Nutzung der Spiele als ROM-Images ist untersagt,
sofern man nicht im Besitz der Orginal-Spiele ist. Und dem gro&szlig;en Sega-
Konkurrenten &quot;Nintendo&quot; pa&szlig;t das selbst in dieser Form nicht, wie die
Firma gerade in einem Interview verlauten lie&szlig;. Doch das braucht uns
hier ja nicht zu interessieren.  </P>

<P><B>Der Autor:</B> </P>

<P>Der spanische Programmierer Juan Antonio Gomez Galvez begann 1997 mit der
Programmierung des Mastersystem- und GameGear-Emulators &quot;AmiMasterGear&quot;,
die sich zwar immer noch im Betastadium befindet, aber schon soweit
ausgereift ist, da&szlig; &uuml;ber 80% der verf&uuml;gbaren Roms ohne Einschr&auml;nkungen
lauff&auml;hig sind. </P>

<P>Da der Programmierer sehr wenig Zeit f&uuml;r das Programmieren &uuml;ber hat, denke
ich, da&szlig; er diesen Emulator bald zur finalen Version erkl&auml;ren wird, zumal
er schon auf seiner Internet-Homepage Aussagen dieser Art machte und
versprach, alle seine Emulatoren (u.a. ein Gameboy-Emulator namens
&quot;AmiGameboy&quot;) in naher Zukunft frei zu ver&ouml;ffentlichen.</P>

<P>Trotz dieser Aussage sollten Interessierte sich dennoch registrieren
lassen, denn dieser Emulator ist es wirklich wert!</P>

<P><B>Technische Voraussetzungen:</B></P>

<P>Es gen&uuml;gt bereits ein Amiga mit einem 68020-Prozessor, AGA-Grafikchip und
nur 1 MB FastRam. Auf dieser Konfiguration ist die Emulation ein wenig zu
langsam, eine wirklich optimale 1:1 Geschwindigkeit erh&auml;lt man, wenn eine
68030/50 Mhz-Turbokarte in den Amiga eingebaut ist.</P>

<P>Ich habe &quot;AmiMasterGear&quot; auch auf einem 68040-Rechner installiert.
Allerdings ist die Emulation hier ein wenig zu schnell geraten! Der
Geschwindigkeitszuwachs befindet sich aber gerade noch im &quot;gr&uuml;nen
Bereich&quot;, so da&szlig; man &quot;AMG&quot; auch f&uuml;r diesen Prozessor empfehlen kann. </P>

<P><B>Die Installation:</B></P>
<P>
Das Programmpaket, mit dem Emulationsprogramm und einer englisch
gehaltenen Anleitung im AmigaGuide-Format, kommt in einem Verzeichnis
daher und besitzt kein Installationsskript, auf das aber auch verzichtet
werden kann, da das Verzeichnis kein &quot;Assign&quot; oder sonstiges ben&ouml;tigt
und daher einfach auf die Festplatte der Wahl gezogen werden kann.  </P>

<P>Etwas komplexer ist - wenn man registrierter User geworden ist - die
Installation des personalisierten Keyfiles. Diese Installation wird aber
sehr ausf&uuml;hrlich in einer gesonderten Anleitung bei Erhalt des Keyfiles
beschrieben.    </P>

<P><B>Das Programm:</B>
                     </P>
<P>Nach dem Programmstart durch Doppelklick auf das Workbench-Icon, erscheint
ein &uuml;bersichtliches GUI, welches die wichtigsten Programmfunktionen
beinhaltet. Alle Funktionen lassen sich auch per rechtem Mausklick durch
ein Men&uuml; aufrufen. Mit ihrer hohen Anzahl l&auml;&szlig;t 'AmiMasterGear' alle mir
bekannten Videogame-Emulatoren weit hinter sich.   </P>

<P>Hier ist ein kleiner &Uuml;berblick &uuml;ber die wichtigsten und interessantesten
<B>Funktionen</B>: </P>

<UL>
<LI>Laden und Entfernen (Eject) der Roms
</LI><LI>Erstellen und Laden von &quot;Snapshots&quot;; d.h., wie bei einem Freezer-Modul
  k&ouml;nnen die Roms bzw. das aktuelle Spiel an einer beliebigen Stelle
  gesichert werden
</LI><LI>ebenfalls wie bei einem Freezer-Module k&ouml;nnen Speicheradressen zur
  Spielver&auml;nderung manipuliert werden (&quot;Cheat Mode&quot;)
</LI><LI>die Steuerung per Tastatur, Joystick, Joypad oder CD32-Joypad ist frei
  w&auml;hlbar
</LI><LI>eine 4-fache &Auml;nderung des &quot;Frame Skip&quot; ist m&ouml;glich, allerdings:
  weniger Frames pro Sekunde f&uuml;hren zwar zu schnellerem Spielablauf, dabei
  aber auch zu geringerer grafischer Qualit&auml;t, da ein &quot;Bildschirmruckeln&quot;
  auftritt. Diese Option sollte nur auf einem 020er Amiga angewandt werden.
</LI><LI>mit der Escape-Taste kann das Spiel jederzeit unterbrochen werden und
  Ver&auml;nderungen (wie z.B. die &Auml;nderung der Steuermethode oder das
  Erstellen eines 'Snapshots') k&ouml;nnen vorgenommen werden. Ein
  Weiterspielen unter neuen Bedingungen ist dann mit dem `Continue`-
  Button m&ouml;glich.
</LI></UL>

<P>Diese Vielzahl von M&ouml;glichkeiten, basierend auf einer gelungenen
Oberfl&auml;che, sind wirklich vorbildlich und es w&auml;re w&uuml;nschenswert, da&szlig;
sich auch andere Emulatoren ein Beispiel daran nehmen w&uuml;rden.</P>

<P>In der <B>Praxis</B> konnten &uuml;ber 80% der geladenen Roms auch problemlos
gespielt werden. Nur ein paar lie&szlig;en sich gar nicht laden oder erzeugten
Grafikfehler nach dem Start. Nach der Nutzung von einigen wenigen Roms
bzw. beim Laden von einigen &quot;Snapshots&quot; kam es an und wann mal zu
Abst&uuml;rzen mit einem Guru bzw. zeigte &quot;AmiMasterGear&quot; keine Reaktion
mehr auf die eingegebenen Befehle. </P>

<P>Hier half dann nur ein Neustart bzw. ein neuer Bootvorgang. Allerdings
f&uuml;hre ich diese Symptome ein wenig auf die Speicheradressen einiger Roms
zur&uuml;ck, die offensichtlich mit dem Amiga-Speicher kollidieren.</P>

<P>Wie schon Eingangs erw&auml;hnt, ist die <B>Geschwindigkeit</B> auf einem 030/50-Amiga
optimal, w&auml;hrend mir ein 040-Amiga ein ganz klein wenig zu schnell f&uuml;r
AmiMasterGear erschien. Eine 060-CPU stand mir leider nicht zur Verf&uuml;gung.</P>

<P>Die Sound- und Musikwiedergabe ist ebenfalls gelungen, allerdings darf
man sich wohl von den SEGA-Modulen auch keine Wunderdinge in Sachen
`Ohrenschmaus` erwarten.</P>

<P><B>Lobenswert</B> ist &uuml;brigens auch, da&szlig; dieser Emulator automatisch zwischen den
Modulen des &quot;Sega Mastersystems&quot; und des &quot;GameGear&quot; unterscheidet, und den
jeweiligen Bildschirmmodus anpa&szlig;t (die Bildschirmdarstellung der GameGear-
Module ist, wie im Orginal, etwas kleiner). Au&szlig;erdem l&auml;uft er immer im
Multitasking.
              </P>
<P>Nochmal ein Einwurf <B>zu den Cheats</B>:
                                          </P>
<P>F&uuml;r fast jedes Modul gibt es Cheat-Kombinationen, die sich auf den
Orginalger&auml;ten durch entsprechende Kombinationen und Bewegungen des
Steuerpads aktivieren lassen. Diese Eingabem&ouml;glichkeit ist nat&uuml;rlich
auch mit dem Emulator, w&auml;hrend des aktuellen Spiels, m&ouml;glich. </P>

<P><B>Fazit:</B> </P>

<P>Wie unschwer zu erkennen ist, halte ich diesen Emulator f&uuml;r absolut
empfehlenswert und die vorhandenen M&auml;ngel sind wirklich marginal.</P>

<P>F&uuml;r die folgende (und wohl auch letzte) Version, plant der Autor noch
eine 100-prozentige Z80-CPU-Emulation (die einen schnellen Amiga
voraussetzt) und die Nutzung der &quot;xpk&quot;-Packm&ouml;glichkeit.</P>

<P>Selbst wenn die hier vorgestellte Version in naher Zukunft Freeware
werden wird, so ist dennoch auch heute eine Registration empfehlenswert,
weil man zum einen diese hervorragende Arbeit wirklich honorieren sollte
und man sich zum anderen erhoffen kann, da&szlig; der Autor vielleicht dadurch
motiviert doch noch andere Amiga-Projekte in Angriff zu nehmen. </P>

<P>Und zu guter Letzt ein <B>Hinweis</B>: Die von mir vorgestellte Version 0.6 ist
nur von bereits registrierten Usern nutzbar, alle anderen k&ouml;nnen sich
einen Eindruck von AmiMasterGear durch die eingeschr&auml;nkte Demoversion
0.51 verschaffen. </P>

<p align=center><IMG SRC="../images/tip.gif" width=90 heigth=91></p>

<TABLE BORDER=0>
<TR>
	<TD><b>Programm:<b></TD>
    <TD><B>AmiMasterGear V0.6</B></TD>
</TR>
<TR>
	<TD><b>Status:</b></TD>
    <TD>Shareware, Preis der Vollversion: 15 US-Dollar </TD>
</TR>
<TR>
	<TD><b>Autor:</b></TD>
    <TD><A HREF="mailto:joanant@arrakis.es">Juan Antonio Gomez Galvez</A></TD>
</TR>
</TABLE>

<p>
Bezugsquelle: <A HREF="http://www.arrakis.es/~joanant/amg.htm">http://www.arrakis.es/~joanant/amg.htm</A>
</p>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906ebox.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906ad.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

