<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - PD-Test-Box</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>PD-Test-Box</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>

<center><p>
<A NAME="start">Ansprungpunkte:</A> <A HREF="#allg">Allgemeines zur Rubrik</A> / <A HREF="#kurz">Kurztests</A>
</p> 

<hr>

<h3>Herzlich Willkommen zur zweiten Ausgabe der PD-Test-Box!</h3></center>

<P>Bevor ich Ihnen verrate, welche Programme ich mir mal genauer unter die
Lupe genommen habe, m&ouml;chte ich noch was loswerden, was mir in den letzten
Monaten die Public-Domain und Shareware betreffend leider negativ
aufgefallen ist. </P>

<P><B>In einer Zeit</B>, wo kommerzielle Programme immer seltener werden, freut man
sich dar&uuml;ber, da&szlig; es gl&uuml;cklicherweise sehr viele emsige Programmierer gibt,
die Programme als Free- oder Shareware programmieren, so da&szlig; man noch
keine absolute Softwareflaute f&uuml;r seinen Rechner erlebt.</P>
<P>
Leider hat in letzter Zeit die gro&szlig;e Unart des Raubkopierens, welche es
ja schon seit Bestehen des Computers gibt und wohl auch immer geben wird,
auch im PD-Markt Einzug gehalten. Als Beispiel ist da das gelungene
Jump'n'Run-Spiel <a href="../pd/9903fa.htm">&quot;FaYoh 2&quot;</a> zu nennen (einen Test finden Sie in der
letzten Ausgabe des AmZeiger) welches f&uuml;r nur 5,- DM verkauft wurde.
Leider ist das Spiel nur wenige Tage nach der Ver&ouml;ffentlichung von
'schwarzen Schafen' in Mailboxen und im Internet zum Download angeboten
worden, so da&szlig; der Programmierer, als Konsequenz und Entt&auml;uschung daraus,
das Spiel frei- und das Programmieren auf dem Amiga aufgab!  </P>

<P>Ein weiterer Grund daf&uuml;r, da&szlig; einige Programmierer den Amiga aufgeben und
zu einer anderen Plattform (PC) wechseln, um dort Ihr K&ouml;nnen weiter
auszu&uuml;ben, ist, da&szlig; Sie fast keine Resonanz - gerade bei Free- oder
Mailware - erhalten. Obwohl fast jeder User Ihr Programm zu sch&auml;tzen
wei&szlig; und es auch nutzt. [Von Resonanz zu Online-Magazinen mal ganz zu
schweigen. ;) d. Chefred.]  </P>

<P><B>Bitte</B> benutzen Sie keine kopierte Software und honorieren Sie auch
gelungene Freeware, zum Beispiel mit einer kleinen Mail an den Autor,
denn dann wird es auch in Zukunft anspruchsvolle PD-Software und
basierend darauf kommerzielle Programme geben. </P>

<P>Denn die PD-Szene bietet immer wieder die Chance, da&szlig; wir aus diesem
Pool weiterhin professionelle Software erhalten, als Beispiel sei hier
nur &quot;Candy Factory Pro&quot; genannt, welches vor einem Jahr noch Shareware
war.  </P>

<hr width="25%">

<P><B>Nun aber</B> zu den Themen, welche Sie in dieser Ausgabe der &quot;PD-Test-Box&quot;
erwarten. Aus der Riesenanzahl an erh&auml;ltlicher PD-Software habe ich mir
f&uuml;r Sie folgende Programme herausgesucht:  </P>

<ul>
<li>
<A HREF="9906ad.htm">ADescentPPC</A>: F&uuml;r die Spielernatur unter Ihnen habe ich diese PPC-
              Konvertierung (f&uuml;r die PowerUp-Kernel) des PC-Hits &quot;Descent&quot;
              angespielt. </li>

<li><A HREF="9906cdc.htm">CDCat</A>: Ob sich ein Update dieses Such- und Katalogisierungstools
              von Version 2.x auf 3.0 lohnt, erl&auml;utert dieser Test. </li>

<li><A HREF="9906mp.htm">MiamiPhone</A>: Vielleicht verr&auml;t dieses Programm auch Ihnen bald Ihre
              Internetaktivit&auml;ten in Heller und Pfennig?   </li>

<li><A HREF="9906pep.htm">Peperoni</A>: Um was es sich hierbei handelt, verr&auml;t der Test.</li>

<li><A HREF="9906ppt.htm">PPT</A>: Vielen Dank an Lukas Fichinger, der sich dieses
              Bildkonvertierungsprogramm anschaute und f&uuml;r uns seine
              Eindr&uuml;cke dar&uuml;ber niederschrieb.</li>
</ul>

<P>Ich hoffe, da&szlig; f&uuml;r jeden unter Ihnen etwas Interessantes dabei ist und
w&uuml;rde mich erneut sehr freuen, Sie auch in der n&auml;chsten &quot;PD-Test-Box&quot;
wieder begr&uuml;&szlig;en zu d&uuml;rfen! :-) </P>

<P><B>Peter Fischer</B>,     <br>
       PD-Redakteur. </P>

<hr>

<a name="kurz"><h2 align=center>Kurztests</h2></a>

<div align=center><P><A HREF="9906add.htm">AddBuffers</A> - Was bringt das Update des DOS-Kommandos?</P></div>

   <br>
<hr>

<a name="allg"><h2 align=center>Allgemeines zur PD-Rubrik:</h2></a>

<P>Sie enth&auml;lt <B>zwei st&auml;ndige Eintr&auml;ge</B>, einige <B>PD-Tests</B> ohne abschlie&szlig;ende
AmZeiger-Bewertung und <B>Kurztests</B>. Als besonders gut beurteilte Produkte
werden mit einem &quot;Tip der Redaktion&quot; ausgezeichnet!  </P>

<P>Gro&szlig;e Software-Pakete, die in Umfang und Zielsetzung auf dem Amiga direkt
in professionelle Gefilde vorsto&szlig;en, werden im Software-Bereich einem
Volltest unterzogen, der mit einem Bewertungskasten schlie&szlig;t. </P>

<P>Der st&auml;ndige Eintrag &quot;<A HREF="9906tbox.htm">PD-Test-Box</A>&quot; enth&auml;lt, neben Informationen des
Redakteurs zur Rubrik, auch die Verweise auf Kurztests. Die <A HREF="9906ebox.htm">PD-Emu-Box</A>,
widmet sich ganz den zahlreichen Emulatoren auf dem Amiga. </P>

<P>Weiterf&uuml;hrende Nachrichten finden sie in der &quot;<A HREF="../amz0699/pdnews.htm">PD-News-Box</A>&quot; (Aktuell-
Rubrik).</P>

<HR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../sw/9906foun.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906ebox.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

