<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - PPT</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>PPT&quot;Cauchy 6&quot;</H1>von<BR>
<A HREF="mailto:liderc@gmx.at">Lukas Fichtinger</A></DIV>


<P>PPT ist ein <B>Freeware-Bildbearbeitungsprogramm</B>, dessen Ziel es ist, in die
Fu&szlig;stapfen von solchen Programmen wie Adobe Photoshop oder Paint Shop Pro
am PC zu treten. Der Autor hat &uuml;brigens ein Faible f&uuml;r ber&uuml;hmte
Mathematiker und nennt jede seiner Revisionen nach einem anderen...</P>

<P>Zuerst mal <B>zum Negativen</B>: PPT ist noch lange nicht bugfrei, das behauptet
nicht mal der Programmierer. Sicher gibt es auch noch einige Features, die
einzubauen w&auml;ren. Der Autor der Software ist deshalb f&uuml;r jeden Bugreport
und Vorschlag dankbar. Hinzu kommen auch noch die Bugs von BGUI, welches
er verwendet.</P>

<P>Doch jetzt <B>zum Positiven</B>, oder besser gesagt, was kann denn PPT nun
eigentlich?  </P>

<P>Fangen wir mit den <B>Dateiformaten</B> an. PPT erkennt JPEG, PNG, ILBM, TIFF und
sonst noch einige exotische Formate. Der GIF-Loader wurde von ihm wegen
des UNISYS-Patents nicht aufs Aminet upgeloadet, kann aber von seiner
Homepage bezogen werden. Selbstverst&auml;ndlich werden auch Datatypes
unterst&uuml;tzt. Der JPEG-Loader erweist sich bei intensivem Testen als etwas
langsam, genauso wie der PNG-Saver. Wenn ich auf meinem 040er ein gr&ouml;&szlig;eres
Bild speichere, kann ich mal inzwischen auf einen Kaffee gehen, aber naja. </P>

<P>Ein weiteres hervorragendes Feature ist <B>das interne Multitasking</B> des
Programms: w&auml;hrend man ein Bild speichert/l&auml;dt, kann man bei einem anderen
inzwischen flei&szlig;ig herummanipulieren. Praktisch! Zum Beispiel wenn im
Hintergrund der PNG-Saver m&uuml;&szlig;ig vor sich hin werkt... </P>

<P>Hat man nun mal ein Bild im Speicher, l&auml;&szlig;t sich mit diesem einiges
anstellen (&uuml;brigens finden alle Berechnungen in 24 Bit statt): </P>

<P>Vom einfachen <B>Manipulieren</B> des Bildes (Cut, Paste, Kontrast, Helligkeit,
Gr&ouml;&szlig;e &auml;ndern, Rahmengr&ouml;&szlig;e &auml;ndern, und noch vieles mehr) zu komplexen
Effekten, wie Verformen, Histogramm-Manipulation, selbstdefinierte Effekte,
Bilder zusammenmischen, Steganographie (also Informationen in einem Bild
verstecken), Transparenz, etc. etc.. Da der Autor ein modulares
Effektsystem verwendet, ist es auch m&ouml;glich, f&uuml;r PPT geschriebene
Effekte Dritter zu nutzen.   </P>

<P>Auf dem Arbeitsbildschirm werden die Bilder immer nur auf die jeweilige
<B>Farbenanzahl</B> in Graustufen heruntergedithert angezeigt, ebenso die
Previews der Effekte. Um das Bild im fertigen Zustand zu sehen, mu&szlig; man
es zuerst rendern.       </P>

<P>Hierzu kann der <B>Screenmode</B>, die Farbenanzahl (1-256, EHB, HAM6, HAM8) und
gegebenenfalls die Ditheringmethode festgelegt werden. </P>

<P>Eins vorweg: in HAM produziert PPT sagenhafte Bilder, die man mit dem HAM
von solchen Programmen wie DPaint vergleichen kann.  Die Ditheringmethoden
produzieren im Vergleich zu PPaint zu k&ouml;rnige Bilder, aber bei HAM sind
sowieso keine erforderlich.  </P>

<P>Was hat das Programm sonst noch f&uuml;r <B>Features?</B> </P>

<UL>
<LI>Buffergr&ouml;&szlig;e nur vom RAM beschr&auml;nkt
</LI><LI>Ein eigenes VM-System, welches keine MMU erfordert
</LI><LI>Nur vom RAM beschr&auml;nktes Undo
</LI><LI>Guter AREXX Port
</LI><LI>Unterst&uuml;tzt CyberGraphX
</UL>

<P><B>Alles in allem</B> finde ich PPT sehr gelungen, besonders da der Autor
best&auml;ndig daran interessiert ist, es weiterzuentwickeln. In den ersten
Versionen noch ziemlich bugbehaftet, l&auml;uft es jetzt schon recht stabil. </P>

<P>Eine PPC-Unterst&uuml;tzung w&uuml;rde den meisten Effekten und dem Rendering nicht
schaden, der Autor scheitert aber zur Zeit noch daran, mit EGCS Libraries
f&uuml;r WarpOS zu schreiben und bittet um Unterst&uuml;tzung. </P>

<P><B>Apropos</B>: wenn die ppc.library von Phase5 noch im Speicher ist, verh&auml;lt
sich das Programm ziemlich instabil, deshalb sollte man sie vorher
entfernen. </P>

<P>Die jeweils brandneueste Version und diverse Zusatzmodule sind auf seiner
Homepage erh&auml;ltlich, im Aminet gibt es unter gfx/conv dann immer die
stabile Version.  </P>

<TABLE BORDER=0>
<TR>
	<TD><b>Programm:</b></TD>
    <TD><B>PPT V 5.20 &quot;Cauchy 6&quot;</B></TD>
</TR>
<TR>
	<TD><b>Status:</b></TD>
    <TD>Freeware </TD>
</TR>
<TR>
	<TD><b>Autor:</b></TD>
    <TD><A HREF="mailto:Janne.Jalkanen@iki.fi">Janne Jalkanan</A></TD>
</TR>
</TABLE>

<p>
Bezugsquelle: <A HREF="http://www.iki.fi/~jalkanen/PPT.html">http://www.iki.fi/~jalkanen/PPT.html</A>
</p>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906cdc.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906mp.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

