<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - MiamiPhone</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>MiamiPhone</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>


<P>Einmal im Monat werde ich immmer ganz bla&szlig; im Gesicht: es ist der Moment
wenn ich meine Telefonrechnung erhalte und meine &quot;Online-S&uuml;nden&quot; (zur
Freude der Telekom) sehe. ;-(  </P>

<P>Wenn man &uuml;bersichtlich erkennen m&ouml;chte, wann man etwas zuviel gesurft hat
oder wenn man sich schon mal anhand einer zwischenzeitlichen Berechnung
innerlich auf die n&auml;chste Rechnung einstellen m&ouml;chte, so ist &quot;MiamiPhone&quot;
genau das richtige. F&uuml;r mich auf jeden Fall und vielleicht auch f&uuml;r Sie?    </P>

<P><B>Was wird ben&ouml;tigt?</B></P>

<P>Wie es der Name schon andeutet, ben&ouml;tigt man &quot;Miami&quot; zur Nutzung von
&quot;MiamiPhone&quot;. In &quot;Miami&quot; aktiviert man ein LogFile, welches alle Online-
Aktivit&auml;ten hinsichtlich Ihrer Dauer protokolliert.     </P>

<P>An weiterer Hard- und Software wird mindestens ein Amiga mit OS 2.1,
MUI 3.1 und eine Festplatte ben&ouml;tigt, welche ja vorhanden sein wird,
wenn man ohnehin online geht. Ein Installationsskript ist nicht
vorhanden, es gen&uuml;gt das ganze Verzeichnis auf die Festplatte seiner
Wahl zu kopieren.  </P>

<P><B>Was kann &quot;MiamiPhone&quot;?</B>  </P>

<P>Das aus Frankreich stammende Freeware-Programm &uuml;berrascht gleich angenehm
mit einer deutschsprachigen MUI-Oberfl&auml;che. Die Anleitung dazu ist jedoch
nur in Englisch verf&uuml;gbar. Auf der Oberfl&auml;che lassen sich nun die
mannigfaltigsten Aktivit&auml;ten ausf&uuml;hren, zu den wichtigsten geh&ouml;ren:</P>

<UL>
<LI>Miami-Logfiles &ouml;ffnen und auswerten (als Liste oder in Balkengrafik)
</LI><LI>die Auswertung kann f&uuml;r dem gesamten Zeitraum (seit Erstellung des
  Logfiles), monatlich oder j&auml;hrlich erfolgen
</LI><LI>die Entgelte werden errechnet (es wird sogar die Mehrwertsteuer
  beachtet!) und k&ouml;nnen in DM oder EURO ausgegeben werden
</LI></UL>

<P>Um diese Berechnungen auch seinen eigenen Providern und den Telefonkosten
anzupassen, mu&szlig; allerdings etwas umst&auml;ndlich selbst 'Hand angelegt' werden.
Das bedeutet, da&szlig; man mittels eines Editor die vorgegebenen &quot;Price-Files&quot;
den lokalen Gegebenheiten anpassen mu&szlig;. Dieses Unterfangen ist etwas
komplizierter, aber da bereits zwei deutsche Price-Files vorliegen,
sollte man diese als Grundlage nehmen, die Anleitung konsultieren und
so auch diese kleine H&uuml;rde &uuml;berspringen.</P>

<P>Danach besitzt man mit &quot;MiamiPhone&quot; ein wirklich gutes Tool, um seine
eigenen Aktivit&auml;ten (oder Schw&auml;chen ;) auszuwerten. Das Programm bietet
aufgrund seiner MUI-Oberf&auml;che eine einfache Bedienung und vielf&auml;ltige
Funktionen, so da&szlig; es Online-Nutzern mit &quot;Miami&quot; zu empfehlen ist.</P>

<TABLE BORDER=0>
<TR>
	<TD><b>Programm:</b></TD>
    <TD><B>MiamiPhone V1.51</B></TD>
</TR>
<TR>
	<TD><b>Status:</b></TD>
    <TD>Freeware </TD>
</TR>
<TR>
	<TD><b>Autor:</b></TD>
    <TD><A HREF="mailto:mdoyen@nordnet.fr">Maxime Doyen</A></TD>
</TR>
</TABLE>

<p>
Bezugsquelle: <A HREF="http://ftp.uni-paderborn.de/pub/aminet/comm/tcp/MiamiPhone.lha">http://ftp.uni-paderborn.de/pub/aminet/comm/tcp/MiamiPhone.lha</A>
</p>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906ppt.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906pep.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

