<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - ALF: 19.06.99 - Sch&ouml;n billig?</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Sch&ouml;n billig?</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>


<P>Ein pers&ouml;nlicher Kommentar zu den letzten Pressemitteilungen von Phase 5,
der aber auch auf Ver&ouml;ffentlichungen diverser anderer Firmen anwendbar
ist:  </P>

<P>Preise werden dort lediglich in Euro angegeben, obwohl die im Moment in
deutschen Landen immer noch prim&auml;r g&uuml;ltige W&auml;hrung die D-Mark ist, so da&szlig;
es in der allgemeinen Praxis der Euro ist, der zur Information ZUS&Auml;TZLICH
mit angegeben wird. So, wie nun u.a. von Phase 5 gehandhabt, sehen die
Preise nat&uuml;rlich auf den ersten Blick etwas besser, weil geringer, aus
oder ist`s etwa, weil wir mit der Verf&uuml;gbarkeit der Produkte erst ab 2002
rechnen d&uuml;rfen?  </P>

<P>Au&szlig;erdem ist es eine absolute Unart, mit dem Herausrechnen der Umsatzsteuer
die Preise zu sch&ouml;nen. Selbst wenn man zugute h&auml;lt, da&szlig; es noch eine Weile
bis zum Verkaufsstart dauern kann, ist das eventuell vorgeschobene
Argument, die Umsatzsteuer k&ouml;nne sich bis dahin ver&auml;ndern (wenn,
dann nat&uuml;rlich nach oben) lediglich ein vorgeschobenes. </P>

<P>Wir leben im hier und heute, so wie die Vorauszahlungen ja auch heute und
nicht morgen geleistet werden sollen. Eine Erh&ouml;hung der Umsatzsteuer w&uuml;rde
(fast) alle Waren betreffen, so da&szlig; man dies, wenn es eintr&auml;te, auch
automatisch beachten w&uuml;rde. Das im deutschen Handel Waren generell mit
eingerechneter Umsatzsteuer ausgepreist werden m&uuml;ssen, hat &uuml;brigens
seinen Grund: es ist n&auml;mlich vorgeschrieben!  </P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906os35.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906mono.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


