<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - 23.05.99 Hacker, Cracker, Vollidioten?</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Hacker, Cracker, Vollidioten?</H1>von<BR>
<A HREF="mailto:T.Heinrich@amzeiger.de">Thomas Heinrich</A></DIV>

<P>Angeblich gibt es ja einen feinen Unterschied zwischen Hackern und
Crackern. Letztere brechen mit b&ouml;sen Absichten in fremde Rechner ein,
erstere nur zum &quot;Spa&szlig;&quot; und zu &quot;Lehrzwecken&quot;, um Schwachstellen in
Computersystemen aufzuzeigen. Obwohl die schon hinreichend von anderen,
professionellen Quellen aufgezeigt wurden...</P>

<P>Wieder einmal hat ein geltungss&uuml;chtiges Subjekt (oder mehrere?) einen
Server angegriffen, diesmal amiga.org, und dort gef&auml;lschte Artikel gegen
Nordic Global (Miami) gepostet. Abgesehen davon, da&szlig; hier einer der
letzten, gro&szlig;en Unterst&uuml;tzer des Amiga mit System schlecht gemacht wird
(die gef&auml;lschte datatypes.library, die Pa&szlig;w&ouml;rter klaut, wurde auch Nordic
Global angeh&auml;ngt), ist jegliches Eindringen in die Privatsph&auml;re anderer
User schon vom Gesetz her verboten und steht in einer Reihe mit N&ouml;tigung
und Hausfriedensbruch. </P>

<P>Stellen Sie sich vor, jemand bricht in Ihre Wohnung ein. Auch wenn nichts
fehlt, werden Sie in Zukunft das Gef&uuml;hl nicht mehr los, jemand schaut
Ihnen st&auml;ndig &uuml;ber die Schulter. Sie f&uuml;hlen sich nicht mehr wohl, Ihr
Zuhause ist nicht mehr das sichere Heim, in das Sie Ihr Vertrauen setzen
k&ouml;nnen. Vielleicht werden Sie Ihre Sicherheitsma&szlig;nahmen drastisch
verst&auml;rken, aber dann werden Sie sich bestimmt ziemlich eingesperrt
f&uuml;hlen. </P>

<P>Es geht bei allen Hackern und Crackern nicht um den Schaden, sondern
einzig und allein um die Tat, die ein gewisses Grundvertrauen mi&szlig;braucht,
das jeder dem (auch unbekannten) Anderen entgegenbringt. Jeder
Vertrauensbruch vergiftet das Klima nicht nur zwischen den Beteiligten,
sondern auch bei allen anderen, die genauso Opfer sein k&ouml;nnen. Oder mit
anderen Worten: Es ist asozial, im urspr&uuml;nglichen Sinn. Gegen die
Gemeinschaft gerichtet, nur mit dem Ziel, die Gemeinschaft zu zerst&ouml;ren. </P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906alf.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906easy.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


