<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - ALF: 30.05.99 - Monopol oder Standard?</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Monopol oder Standard?</H1>von<BR>
<A HREF="mailto:T.Heinrich@amzeiger.de">Thomas Heinrich</A></DIV>

<P>Eine Teilschuld an der Misere des Amiga tr&auml;gt sicherlich der monopolartige
Aufbau der Hardware. W&auml;hrend der PC die Weiterentwicklung eines uralten
IBM-Standards ist, der von sehr vielen Firmen getragen wird, hat Commodore
nie Lizenzen vergeben, die Klone des Amiga zulassen. Der Vorteil war
sicher, da&szlig; die Weiterentwicklung aus einer Hand keinen Wildwuchs zulie&szlig;,
andererseits waren Neuerungen sehr von der Politik der Mutterfirma
abh&auml;ngig. Und das ging letztlich aufgrund von Mi&szlig;management in die Hose,
wie wir alle wissen. </P>

<P>Trotzdem ist auch der einheitliche Standard nicht der Weisheit letzter
Schlu&szlig;. Der PC ist zwar im Augenblick der am weitesten entwickelte Rechner,
aber je fortschrittlicher die Anwendungen werden, umso gr&ouml;&szlig;er m&uuml;ssen die
Anstrengungen sein, eine gewisse Kompatibilit&auml;t zu wahren. Aufgrund des
weitverbreiteten Standards traut sich niemand, ein revolution&auml;res,
besseres Konzept zu entwickeln, da daran ein zu hohes Risiko h&auml;ngt. </P>

<P>Hier pa&szlig;t der Amiga der Firma Gateway nat&uuml;rlich sch&ouml;n ins Konzept: Ein
Rechner, v&ouml;llig anders aufgebaut, mit einer kleinen, treuen Anh&auml;ngerschar,
mit der sich prima neue Konzepte testen lassen. Wenn der neue NG-Amiga
wirklich das h&auml;lt, was man sich davon verspricht, stehen wir vielleicht
vor einer neuen &Auml;ra, die den PC endlich in den verdienten Ruhestand
schickt und einem neuen Konzept eine Chance gibt. Mit einer breiten
Unterst&uuml;tzung w&auml;re auch der Preis kein Thema mehr. Aber irgendwie glaube
ich nicht so richtig daran...  </P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906bill.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906apr.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


