<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - ALF: 19.06.99 - April, April?</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>April, April?</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Tats&auml;chlich hatte sich nun also vor kurzem herausgestellt, da&szlig; das
BlueByte-Spiel `Siedler 2` nicht auf den Amiga umgesetzt werden wird.
Zahllose Ger&uuml;chte und widerspr&uuml;chliche Meldungen zu diesem Thema waren
aufgetaucht und haben unn&ouml;tigerweise Aufregung verursacht.</P>

<P>Die Firma Titan Computer hatte sich um die Rechte zur Umsetzung auf den
Amiga bem&uuml;ht. So l&ouml;blich diese Bem&uuml;hungen waren, so hat Titan aber selbst
zu den Konfusionen beigetragen, die dem Amiga-Markt Schaden zuf&uuml;gen.</P>

<P>Titan Computer hatte zwischenzeitlich gemeldet, da&szlig; sie die Rechte nun
h&auml;tten und mit der Umsetzung sofort beginnen w&uuml;rden. Sp&auml;ter verlautete
zus&auml;tzlich, da&szlig; der Support von BlueByte schleppend verlaufe, da man dem
Amiga nicht gerade hohe Priorit&auml;t einr&auml;ume.</P>

<P>Das ist ja allseits bekannt und hat auch nicht zu Letzt dazu gef&uuml;hrt, da&szlig;
es keine Konvertierung geben wird. Warum kann man aber mit Erfolgsmeldungen
nicht etwas vorsichtiger sein, gerade einer im gesch&auml;ftlichen Umfeld
t&auml;tigen Firma sollte doch bekannt sein, da&szlig; m&uuml;ndliche Zusagen zwar
theoretisch verbindlich, aber praktisch in den meisten F&auml;llen wenig
wert sind? Ein schriftlicher Vertrag, unterschrieben von den
verantwortlichen Personen, ist das, was z&auml;hlt.</P>

<P>So gab es wieder viel L&auml;rm um Nichts, der im Endeffekt nur Erwartungen
geweckt und dann wieder einmal entt&auml;uscht hat. Wenn das symptomatisch f&uuml;r
den Amiga-Markt wird (falls es das nicht schon ist), k&ouml;nnte es zu einem
beschleunigten Exodus f&uuml;hren, da die User durch solche Meldungen nicht
`bei der Stange gehalten` werden, sondern sich einfach nur verschaukelt
vorkommen, da ihre gen&auml;hrten Hoffnungen nach und nach wie Seifenblasen
platzen.</P>

<P>Zahlreiche neue Ank&uuml;ndigungen f&uuml;r anspruchsvolle Umsetzungen lassen in
dieser Hinsicht Besorgnis aufkommen, auch, wenn sie sich z.B. schlie&szlig;lich
als technisch nicht realisierbar herausstellen sollten.</P>
<P>
Selbst mit Ank&uuml;ndigungen sollte also verantwortungsvoller umgegangen
werden.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906mono.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../amz0699/zensur.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


