<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - 08.06.99 Alles easy... </TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Alles easy...</H1>von<BR>
<A HREF="mailto:T.Heinrich@amzeiger.de">Thomas Heinrich</A></DIV>

<P>Seit Jahren, ja sogar seit Jahrzehnten, versprechen uns die
Computerhersteller, egal welcher Couleur, da&szlig; der Computer einfacher
zu bedienen sein wird, als das bis jetzt noch der Fall ist.</P>

<P>Verlockungen gibt es ja genug, in den letzten Jahren zieht vor allem das
Internet computertechnische Laien an, wie das Licht die Motten. Allein,
was immer noch fehlt, ist der leicht von jedermann und -frau bedienbare
Computer.</P>

<P>Als langj&auml;hriger Amiga-User und dann zwangsweise auch Wintel-Kundiger,
sehe ich aber sogar den Vorteil in dieser unbefriedigenden Situation:
Man lernt n&auml;mlich eine Menge Leute kennen. </P>

<P>Ich konnte mir neulich das Grinsen nicht verkneifen, als ich die Frage zu
h&ouml;ren bekam, ob man das, was man im Internet findet, auch ausdrucken kann.
Zum Gl&uuml;ck war es ein Telefonanruf, so da&szlig; die Anruferin (*) das nicht
sehen konnte. Die n&auml;chste Frage hat mich auch erst am&uuml;siert und dann
verbl&uuml;fft: &quot;Wie funktioniert das mit dem Internet eigentlich?&quot;</P>

<P>Da stellt man dann zum erstenmal fest, da&szlig; hier Abgr&uuml;nde zwischen dem
liegen, was ein unbedarfter User am Computer sieht, n&auml;mlich das einfache
&quot;Wohin mu&szlig; ich klicken...?&quot;, und dem, was ein Computerfreak wei&szlig;, n&auml;mlich
wie die Technik dahinter funktioniert. Es wurde mir bewu&szlig;t, da&szlig; f&uuml;r mich
die technische Seite so im Vordergrund steht, da&szlig; ich auf Anhieb einem
absoluten Laien gar nicht erkl&auml;ren kann, mit was ich mich tagt&auml;glich
befasse.</P>

<P>So geht einem mit dem wachsenden Wissen der Blick auf's Wesentliche immer
mehr verloren. Ist das die Aussage, da&szlig; es den einfach zu bedienenden PC
schon lange gibt: Denn hinter jedem Rechner sitzt bereits ein Idiot - ein
Fachidiot? </P>

<P>Der Horror f&uuml;r mich w&auml;re, wenn der Allerwelts-PC tats&auml;chlich einmal
erscheint. Keine Probleme, keine Spezialisten mehr, keine M&ouml;glichkeit,
sich zu profilieren und sich unentbehrlich zu machen. Aber irgendwie habe
ich das Gef&uuml;hl, ich brauche mir keine Sorgen zu machen. Wenn nach so
vielen Jahren mit Computerservice immer noch so viel verdient wird, wird
sich die Wirtschaft das nicht durch einen Easy-PC kaputtmachen lassen.</P>

<hr width="25%">

<P>(*) Einen herzlichen Dank an Uta G., f&uuml;r die vielen genial naiven und
unbefangenen Fragen.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906crac.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906fr.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


