<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Kundenfreundlich?</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Kundenfreundlich?</H1>von<BR>
<A HREF="mailto:T.Heinrich@amzeiger.de">Thomas Heinrich</A></DIV>


<P>Noch nie war es so deutlich, da&szlig; Verbraucherschutz und Kundenfreundlichkeit
so weit auseinanderliegen, wie zur Zeit. Zuerst wurde der &quot;Tomorrow&quot;-
Pauschaltarif f&uuml;r Surfer (77 DM/Monat) durch die Verbrauchersch&uuml;tzer
gekippt. Zwar mit der durchaus richtigen Begr&uuml;ndung, durch die
Unterkapazit&auml;ten kann nicht jedem Surfer der Zugang auch gew&auml;hrt werden,
aber schlie&szlig;lich regelt sich der Markt doch selbst. Schlechte Verbindungen
f&uuml;hren dazu, da&szlig; weniger Leute an dem Angebot interessiert sind, also wird
der Andrang geringer, die Verbindungen wieder besser.  </P>

<P>Dann bremst AOL die Telekom aus, die Ortstarife endlich, zum ersten Mal in
der Geschichte der Deutschen Telekommunikation, billiger machen will. Der
anvisierte Preis von 3 Pf/Minute sei nicht kostendeckend und somit Dumping,
meint AOL. Die restlichen Telefongesellschaften sehen das Abw&uuml;rgen des
verbraucherfreundlichen Tarifs als positive Entscheidung, obwohl sie doch
fast alle die Ortsleitungen von der Telekom leasen m&uuml;ssen! Damit geben sie
leichtfertig ein Druckmittel auf die Telekom aus der Hand, das ihnen
g&uuml;nstigere Leasinggeb&uuml;hren bescheren k&ouml;nnte.   </P>

<P>Auf jeden Fall wird wieder einmal deutlich, da&szlig; der Kunde keinerlei
M&ouml;glichkeiten hat, die Wirtschaft zu beeinflussen. Wenn es um den Gewinn
geht, ist die Freundlichkeit wie weggeblasen, dann z&auml;hlt nicht mehr der
Kunde, sondern nur noch die Gesch&auml;ftsbilanz.  </P>

<hr width=50%>

<DIV ALIGN=CENTER>von<br><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></div>


<P>Tats&auml;chlich ist es schon seltsam. Eigentlich dachte man, die Sache sei
klar: Buhmann ist immer der Monopolist Telekom! Durch die
marktbeherrschende Stellung des Unternehmens und dem daraus resultierend
m&ouml;glichwerdenden Diktat der Preise, w&uuml;rden sich selbige kaum schnell
verringern, bevor nicht irgendwann langsam (im Ortsbereich noch viel
langsamer) erwachsende Konkurrenz gen&uuml;genden Druck in diese Richtung
aufbauen w&uuml;rde.
                     </P>
<P>Jetzt, wo erstmals nach der grauenhaften 'Tarifreform' die nach der
Telekom-Privatisierung die Preise erh&ouml;hte, eine Preissenkung im Ortsnetz
durchgesetzt werden sollte, machen die hierzulande &uuml;bliche B&uuml;rokratie und
die Konkurrenz selbst dies unm&ouml;glich - Marktwirtschaft? </P>

<P>Davon abgesehen ist die, f&uuml;r diese Entscheidung haupts&auml;chlich
verantwortliche 'Regulierungsbeh&ouml;rde', die ja schon einige Beschl&uuml;sse
gefa&szlig;t hat, die die Konkurrenz tats&auml;chlich benachteiligen, offenbar nicht
schlagkr&auml;ftig.      </P>
<P>
Dies verwundert auch kaum, wenn man wei&szlig;, da&szlig; es sich dabei nur um den
Telekommunikationszweig des ehemaligen Postministeriums handelt, das,
nach einer reinen Umetikettierung, den vorherigen wohlkannten Kollegen
den Arbeitsplatz erh&auml;lt, der durch die Privatisierung von Post und Telekom
wegzufallen drohte. Nicht umsonst gab es bereits seit der 'Gr&uuml;ndung'
dieser Beh&ouml;rde heftige Differenzen mit dem Bundeskartellamt.    </P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906easy.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906os35.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


