<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Der Schwarzseher Teil 3</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>"Der Schwarzseher Teil 3"</B>
          </FONT></H1>

          <H2 align="center"><FONT color="#ffff00"><B>- Politische Runde in der NoCover
          </B></FONT></H2>

          <P>Ich wei&szlig; nicht Recht, was ich davon nun halten soll. Erst sehe ich
          mich so ein bisschen als Revolution&auml;r, der gegen den Strom schwimmt
          und nicht ann&auml;hernd nachvollziehen kann, warum politisch die Dinge so
          gelaufen sind, wie sie nunmal gelaufen sind und pl&ouml;tzlich dieses
          Gef&uuml;hl, dass der Schwarm die Richtung gewechselt hat und wir nun alle
          dieselbe Richtung entlang schl&auml;ngeln. Das macht mir ja nun auch keinen
          Spa&szlig;. Pl&ouml;tzlich hackt alles auf der Regierung herum - ja Ihr
          habt sie doch alle so gew&auml;hlt, oder? Die letzten vier Jahre waren eine
          wirtschaftliche Katastrophe f&uuml;r dieses Land und wenn man sagt "alles
          okay - weiter so", muss man doch auch damit rechnen, dass es eben weiter
          Richtung bergab geht. In den ersten vier Jahren sind Arbeitslosenzahlen
          gestiegen, der Arbeitsmarkt wurde veriegelt und verrammelt mit weiteren
          Gesetzen, Steuern kamen neu hinzu und wurden erh&ouml;ht,
          au&szlig;enpolitisch wurde sich unbeliebt gemacht, indem man alten Freunden
          deftig auf die F&uuml;&szlig;e tritt, Renten werden etwas gek&uuml;rzt
          -daf&uuml;r stiegen die Beitr&auml;ge insgesammt (nein nat&uuml;rlich nicht
          &uuml;ber die reine Rentenversicherung - diese Zahl l&auml;sst sich mit
          Geldern aus zweckfremden Erh&ouml;hungen ja prima versch&ouml;nern),
          Minister werden ernannt, bauen Mist und werden wieder ausgetauscht,
          Versprechungen werden &uuml;berall nicht gehalten, was nicht daran hindert,
          Neue zu kreieren. Und hier rede ich vom Ablauf der ersten vier Jahre
          Rot-Gr&uuml;n, falls jemand diese Zeit schon vergessen oder verdr&auml;ngt
          haben sollte. Nun sagt Deutschland "genau richtig - weiter so!". Und es
          geht so weiter, - Rot-Gr&uuml;n: Erfolg ist, wenn man trotzdem gew&auml;hlt
          wird - Schwarz/Gelb: Humor ist, wenn man trotzdem lacht. Und jetzt
          pl&ouml;tzlich jammern Alle? Was soll das denn? Heute mache ich mal mein
          Kreuzchen hier, weil der Mann da immer so nett l&auml;chelt und ich ja
          eigentlich generell Bayern nicht so gerne mag. Morgen will mir dann
          pl&ouml;tzlich jemand ans Portemonaie, -nanu, wie kommt denn sowas?</P>

          <P>Wahlbetrug? Daf&uuml;r braucht es keine Komission! Wenn jemand etwas in
          aller &Ouml;ffentlichkeit sagt, um gew&auml;hlt zu werden und hinterher
          alles dementiert, ist das offensichtlich ein nicht eingehaltenes
          Versprechen. Da kann man noch Erkl&auml;rungsversuche machen und weiter von
          den achso schlimmen sechzehn Jahren Kohl reden oder der am Boden
          zerst&ouml;rten Weltwirtschaft, von der nur Deutschland betroffen scheint,
          weil wir soviel exportieren oder aber vielleicht ist dem Finanzminister
          auch nur die schwarze Katze morgens &uuml;ber den Weg gelaufen und deswegen
          l&auml;uft irgendwie alles quer. Auch partei-intern in der SPD und bei den
          Gr&uuml;nen ist wirklich jedem ehrlich denkendem Politiker v&ouml;llig
          klar, dass ein wirtschaftlicher Defizit in den Kassen dieser
          Gr&ouml;&szlig;enordnung jedem Verantwortlichem auch vor der Wahl bekannt
          war. Aber egal, erstmal unter allen Umst&auml;nden die Wahl gewinnen,
          danach sieht man weiter und in vier Jahren ist ja ohnehin alles vergessen.
          Wenn das keine Machtgier unabh&auml;ngig von den Mitteln ist -ich
          wei&szlig; es nicht. &Uuml;brigens - die Komission finde ich wirklich affig
          und es kostet mal wieder unn&uuml;tzes Geld um offensichtliche Dinge
          best&auml;tigen zu lassen. Dass sie ausgerechnet von Roland Koch gefordert
          wurde, ist zudem nur peinlich f&uuml;r die CDU. Frei von Fehlern ist ja
          niemand.</P>

          <P>Mir ist auch unklar, was an den sechzehn Jahren Kohlregierung nun
          f&uuml;r Deutschland immer so schlecht war. Vergleichen kann man diese Zeit
          nur mit der Alternative, - also den Jahren, in denen die SPD das Ruder
          hatte. Eigenartig finde ich da doch, dass die SPD in der gesamten Chronik
          deutscher Politik immer nur einen kleinen Gastauftritt zwischendurch mal
          hatte. Mehrere Vierjahrespakete hintereinander hat Rot+X nie durchgehalten
          - eben weil es dann immer gleich merklich bergab ging im Land.
          Regierungsunf&auml;higkeit w&uuml;rde ich das nennen, das ist aber nur eine
          pers&ouml;nliche Meinung und geh&ouml;rt hier im Prinzip gar nicht hin.
          Dass CDU immer nur Schuldenberge anh&auml;ufte, wird vorgeworfen. Die
          deutsche Verschuldung war im Jahr vor der Wende quasi abgebaut! Der Fehler
          an der Sache - die deutsche Einheit wurde mit Schulden finanziert, an denen
          Deutschland auch heute noch knabbern muss. Aber so richtig wei&szlig;
          niemand, wie man das anders h&auml;tte bew&auml;ltigen k&ouml;nnen, einen
          Staat der sozusagen wirtschaftlich bankrott ¸war, dem wirtschaftlich
          gesundem Westdeutschland schnellstm&ouml;glich anzupassen. Eine bessere
          L&ouml;sung kannte auch die damalige Opposition nicht und heute wird der
          CDU exakt dieser Schuldenberg zugeschrieben. Mag sein, dass es ein
          gro&szlig;er Fehler war, die Einheit durch Schulden zu subventionieren,
          -aber wie w&auml;re die Alternative gewesen, wenn wir nicht noch ein ganzes
          &acute;Jahrhundert Ossis und Wessis sein wollen - die einen reich, die
          anderen arbeitslos, die einen mit heilen Stra&szlig;en, die anderen mit
          kaputten, die einen mit modernen Unternehmen und die anderen mit
          zerfallenen Fabrikruinen? Zu Kohls Zeit hatten wir ein weit besseres
          Wirtschaftswachstum, war die au&szlig;enpolitische Situation weitaus
          besser, waren die Sch&uuml;ler noch in der Lage zu lernen und und und....
          War es also wirklich so viel schlechter, als die CDU regierte? Dann
          tr&uuml;gt mich wohl mein Ged&auml;chtnis.</P>

          <P>Jaja, aber die Renten waren doch zu Kohls Regierung sogar noch
          h&ouml;her! Das wollen wir aber jetzt nicht vergessen! Dann wollen wir auch
          nicht vergessen, das zus&auml;tzlich zu den geringf&uuml;gig niedrigeren
          Rentenabz&uuml;gen nun die zus&auml;tzliche Riesters&auml;ule n&ouml;tig
          ist, die sich manch Niedriglohnverdiener noch gar nicht leisten kann um das
          Rentenniveau zu halten! Und dazu kommt noch der Faktor, dass wir in der
          CDU-Regierung ein weitaus besseres Wirtschaftswachstum hatten. Wenn der
          Mensch gut verdient, die Preise nicht zu hoch sind und er mit seinem Geld
          mehr bekommt, kann er auch mehr f&uuml;r seine Rente zur&uuml;cklegen. In
          guten Zeiten kann man sparen - in sparsamen Zeiten kann man nur noch
          verzichten! So sieht es n&auml;mlich korrekt aus. Somit zieht der Spruch
          der SPD kein St&uuml;ck vom Teller, denn jetzt wird in leere Hosentaschen
          gelangt und nicht in Halbvolle!</P>

          <P>Wer gar nicht mehr mit seinem Gehalt klarkommt, dem sind dennoch die
          H&auml;nde gebunden, sich und seine Familie trotzdem &uuml;ber die Runden
          zu bringen. Zus&auml;tzlicher Nebenverdienst? Na da will wohl jemand
          scheinselbst&auml;ndig sein, was? Und nebenbei wenig dazu verdienen? Nicht
          mit der SPD! Die alten 630Mark-Jobs sind der dringenste Schritt, damit sich
          Menschen, denen es wirklich nicht mehr gut geht zumindest noch selbst
          helfen k&ouml;nnen. Einige tendieren zur Schwarzarbeit, aber ehrlich
          arbeitenden Menschen ist jedes Werkzeug zur Selbsthilfe von dieser
          Regierung genommen worden.</P>

          <P>Und kurz mal zu dem Diskussionsbeitrag von Antidote aus der letzten
          NC....<BR>

          Ich finde in der politischen Richtung die wirkliche Richtung der
          n&auml;chsten vier Jahre weit weit weit wichtiger, als das tolle Grinsen
          des k&uuml;nftigen Kanzlers. Sei er nun gut vorzeigbar und von der Partei
          gew&auml;hlt oder nicht. Bei einer wirtschaftlich denkenden Firma
          n&uuml;tzt mir der stets grinsende Gesch&auml;ftsf&uuml;hrer nicht das
          Geringste, wenn die Firma einen Flopp nach dem Anderen bringt und in
          Richtung Konkurs steuert. Schlimmer noch, die Firma w&auml;re dann weg vom
          Fenster - traurig genug, aber hier geht es um ein ganzes Land, dem es bis
          vor kurzem noch gar nicht so schlecht ging. W&auml;re Deutschland eine AG
          w&auml;re die Gesch&auml;ftsleitung l&auml;ngst hochkantig gefeuert worden.
          Wer nicht wirtschaftlich denkt und arbeitet, arbeitet gegen das
          Fortbestehen der Firma und in diesem Fall gegen die Zukunft des Landes und
          seiner Einwohner.</P>

          <P>Wie, - Du wei&szlig;t als B&uuml;rger nie, ob die &Ouml;kosteuer in die
          &Ouml;kologie gesteckt wird? Das hat Deine Regierung Dir doch sogar gesagt,
          dass dem nicht so ist! Sie wird verwendet, um die Lohnnebenkosten auf
          stabilem Level zu halten. Leider hat sie nicht gereicht -jetzt dient sie
          nur noch dazu, einen j&auml;mmerlichen Teil des gro&szlig;en Loches zu
          stopfen. -&Ouml;kologische Wirkung - von Beginn an NULL! Oder f&auml;hrst
          Du jetzt seltener zur Arbeit? Oder seltener zum Einkaufen, zum Arzt usw.?
          Oder hast Du Dir sogar ein neues Supersparauto geg&ouml;nnt? Es werden
          n&auml;mlich auch nicht millionenfach tolle 3-Literautos verkauft, sondern
          nach wie vor KW-starke Mittelklasse- und Oberklasseschlitten. Die
          &Ouml;kosteuer bestraft sogar &ouml;kologisch Denkende! Es ist kaum Zeit
          vergangen, als allen Hausbesitzern gepr&auml;digt wurde, &ouml;kologisch zu
          denken und ihre Heizanlagen auf Erdgas umzustellen. Kaum ist die Umstellung
          reichhaltig gelungen, wird auch das Erdgas ordentlich ver&ouml;kosteuert,
          damit jeder &ouml;konomische Vorteil futsch ist. Da k&ouml;nnte man auch
          mal wieder was neues basteln, - wie w&auml;re es, den Leuten zu sagen, sie
          sollen alle PKWs auf Diesel umstellen, - den Diesel machen wir solange noch
          etwas billiger. Und wenn dann genug Menschen Dieselautos haben, klatschen
          wir in die H&auml;nde und ballern auf die Dieselpreise eine h&ouml;here
          Umsatzsteuer, die &Ouml;kosteuer, eine neue &Ouml;konomiesteuer, weils ja
          billiger ist, und dann darauf noch eine Extra-Dieselsteuer. Das bringt doch
          wieder mehr Geld in die Kassen. Als Regierung darf man das n&auml;mlich,
          man muss es der dummen Bev&ouml;lkerung nur noch vor den Wahlen als
          Superschn&auml;ppchen versprechen und in vier Jahren das Ged&auml;chtnis
          mit anderen Dingen besch&auml;ftigen, damit sich niemand mehr daran
          erinnert.</P>

          <P>Entschuldige - Schwarzseher haben zur Zeit nunmal besonders schwarzen
          Humor!</P>

          <P>Aber Du glaubst doch nicht wirklich, dass von Deiner an der Tankstelle
          gezahlten &Ouml;kosteuer auch nur ein einziger Cent in Richtung Umwelt
          geht, oder? Dann h&ouml;r unserer Regierung nochmal genau zu, was mit
          diesem Geld gemacht wird. Es wird n&auml;mlich kein Geheimnis daraus
          gemacht! - Ausnahmsweise!</P>

          <P>Die Banken stecken Geld in marode Betriebe? Marode? Ich erinnere mich
          noch, wie Volkswagen vor wenigen Jahren androhte, Arbeiter entlassen zu
          m&uuml;ssen. Dann wurde von der Regierung subventioniert. Aber schon zwei
          Jahre sp&auml;ter ging es dem Autobauer wunderbar. Da hat man sich aber
          schnell erholt. Und was ist mit den Subventionen? Kommt da etwas
          zur&uuml;ck, damit andere Firmen vielleicht auch etwas Hilfe erwarten
          k&ouml;nnen? Iwo, auf ein-zwei... Hundert kleinere Firmen, die nur ein paar
          zig Angestellte haben, kommt es doch nun wirklich nicht an. Hauptsache dem
          Autobauer mit dem gr&ouml;&szlig;ten PKW-Absatz Deutschlands geht es
          bestens - er soll sich hier ja auch wohlf&uuml;hlen, da hat man gern mal
          die Spendierhosen an. Den Hilferuf der Konkurrenz &uuml;berh&ouml;rt man
          dagegen lieber mal dezent, - selber Schuld, wenn sie keine typischen
          Regierungsautos bauen.</P>

          <P>Oh, es gibt NIEMANDEN in Europa, der Krieg m&ouml;chte oder meint, damit
          seien die Probleme gel&ouml;st. Aber verkleinern wir auch hier die
          Situation drastisch zum besseren Vest&auml;ndnis.... Ein Freund bittet Dich
          um Deine Hilfe, - Du bist aber nicht seiner Meinung. Nun nimmst Du einen
          Zettel und schreibst schlicht und einfach drauf: "lass mich in Ruhe, geht
          mich nix an!" am besten noch ein zweiter Zettel mit: "Du bist doch doof!",
          denn kleine Beleidigungen beleben jede zwischenmenschliche Beziehung. Das
          l&auml;sst Du dann bei ihm in den Briefkasten werfen, - blo&szlig; nicht
          pers&ouml;nlich machen, das k&ouml;nnte als Schw&auml;che missverstanden
          werden. Es ist wohlgemerkt ein sehr guter alter Freund von Dir! Mal
          ehrlich, gehst Du SO mit Deinen besten Freunden um? Ja? &Auml;hm, Du hast
          aber noch Freunde, oder? Ich w&auml;re vermutlich hingegangen und
          h&auml;tte ihn pers&ouml;nlich sprechen wollen, um ihm meine Argumente
          verst&auml;ndlich zu machen, warum ich nicht seiner Meinung bin. Vielleicht
          h&auml;tte er mich somit verstanden und es mir nicht &uuml;bel genommen,
          anderer Meinung zu sein, denn eine gute Freundschaft h&auml;lt
          unterschiedliche Meinungen aus! Mal davon abgesehen war von Anfang an klar,
          dass Schr&ouml;der auch dieses Versprechen in dieser konkreten abwehrenden
          Form gar nicht halten kann. Genau das wurde ihm von Stoiber vorgeworfen. Es
          gibt klare geregelte Vertr&auml;ge, die Deutschland einzuhalten hat. Das
          Ergebnis siehst Du jetzt im Beginn mit der Verweichlichung der
          anf&auml;nglichen Abwehrhaltung Schr&ouml;ders zu diesem Thema. Jetzt muss
          schon gesagt werden "wir sagen immer noch ganz klar NEIN, aber...." - Du
          wirst dazu je nach Lage der Thematik von Deiner Regierung noch weitere
          "Abers" h&ouml;ren -versprochen! Zumindest die Abers, die schon vorher
          scharz auf wei&szlig; fest standen werden noch kommen.... Hier war Stoiber
          von Anfang an ehrlich, - h&auml;tte die CDU/CSU man lieber gelogen, dass
          sich die Balken biegen, - wir w&auml;ren heute in einer besseren Situation.
          Wer wirklich glaubt mit dem altbew&auml;hrtem Grinsen und einem schwitzigen
          H&auml;ndedruck sei nun alles wieder gekittet, sollte das einfach mal mit
          seinem besten Freund versuchen. Ein &uuml;bler Nachgeschmack wird immer
          bleiben. Man kann sich akzeptieren - eine Freundschaft ist das aber
          l&auml;ngst nicht mehr.</P>

          <P>Die von Dir genannten gut gepflegten Beziehungen zu Putin und Blair sind
          ja ganz nett. Auf die wirklich umarmend freundschaftlichen Beziehungen von
          Kohl und Russland weise ich jetzt gar nicht mal hin, sie waren in jeder
          Presse pr&auml;sent, - wirtschaftlich wichtiger ist f&uuml;r uns jedoch
          Amerika, da mag man "leider" oder "gl&uuml;cklicherweise" sagen. Wir
          exportieren und importieren nunmal mit Amerika mehr, als GB und Russland
          und etc. zusammen. Hinter freundschaftlichen Beziehungen von Regierungen
          stehen nun mal leider viele wirtschaftliche Interessen der gewerblichen
          Bev&ouml;lkerungen der L&auml;nder. Ich mag falsch liegen, aber Russland
          kostet uns bislang Geld und von GB haben wir auch kaum etwas.
          Wirtschaftlich gesehen kann Schr&ouml;der mit Blair und Putin in die
          Dampfsaune gehen, Auswirkungen f&uuml;r unser Land hat das kaum. Nein, -
          kein falscher Verdacht, f&uuml;r mich pers&ouml;nlich ist Freundschaft
          v&ouml;llig unabh&auml;ngig von deren Vor- oder Nachteilen. Aber ich
          k&ouml;nnte mir vorstellen, dass eine Regierung da etwas wirthaftlicher
          denken muss.</P>

          <P>Aber vielen Dank f&uuml;r Dein Contra... wenigsten Einer :-)</P>

          <P>Tja, h&ouml;rt man jetzt in die Allgemeinheit und den entt&auml;uschten
          SPD-W&auml;hlern zu, fragen sich Alle, ob die CDU/CSU es denn h&auml;tte
          besser machen k&ouml;nnen. Wo kein Geld, da keine M&ouml;glichkeiten.</P>

          <P>Ob sie was besser h&auml;tten machen k&ouml;nnen? Hallooooo, wie
          h&auml;tten sie es denn SCHLECHTER machen k&ouml;nnen? W&auml;re das
          m&ouml;glich gewesen? Rot-Gr&uuml;n hatte vor der Wahl eine grauenvoll
          schlechte Bilanz ihrer vierj&auml;hrigen Regierung. Zu dieser Bilanz
          konnten sie nur herumstammeln und allen anderen Faktoren die Schuld daran
          geben. Nun nach der Wahl liegt uns das tats&auml;chliche und weit
          katastrophalere Ergebnis der Bilanz vor. Ein Ergebnis, das man lieber bis
          nach der Wahl verschieben wollte, -dumm w&auml;ren sie gewesen mit dem
          "echten" Zukunftsplan aufzutreten, - n&auml;mlich ein Loch aus allen
          Mitteln zu stopfen und seine Politik auf Schadensbegrenzung zu limitieren.
          Regieren um jeden Preis.</P>

          <TABLE border="0" summary="0" width="100%">
            <TR>
              <TD colspan="2">Ja nat&uuml;rlich h&auml;tte es etwas gebracht, wenn
              Rot-Gr&uuml;n abgew&auml;hlt worden w&auml;re.</TD>
            </TR>

            <TR>
              <TD valign="top">1. &nbsp;</TD>

              <TD>Jeder Nachfolger h&auml;tte gesehen, was ihm bl&uuml;ht, wenn er in
              diese Negativrichtung weiter regiert und den Karren nicht wenigstens ein
              St&uuml;ck aus dem Dreck ziehen kann.</TD>
            </TR>

            <TR>
              <TD valign="top">2. &nbsp;</TD>

              <TD>Rot-Gr&uuml;n w&auml;re sich nicht so absolut sicher, alles richtig
              getan zu haben und diesen Weg beizubehalten. Mit dieser Wahl wurde
              schlechte Politik best&auml;tigt!</TD>
            </TR>

            <TR>
              <TD valign="top">3. &nbsp;</TD>

              <TD>Die Wirtschaft h&auml;tte endlich aufatmen k&ouml;nnen!
              Gewerbetreibende k&ouml;nnen kaum noch atmen, so stickig ist die Luft in
              Deutschland. Wer kann, h&auml;lt sein Geld zur&uuml;ck und sieht sich die
              Lage erstmal an, um zu entscheiden, ob das Geld nicht im Ausland besser
              angelegt ist. Viele viele viele wandern ab. Siehe auch die Foren von
              <b>http://www.wahl-betrug.de</b> - dort stehen diverse Texte der
              Fl&uuml;chtigen, warum das so ist....</TD>
            </TR>

            <TR>
              <TD valign="top">4. &nbsp;</TD>

              <TD>Es w&auml;ren nicht so radikal alle Steuern angehoben worden, denn im
              Gegensatz zur Regierung erkennt die Opposition lange, dass zuerst die
              Wirtschaft belebt werden muss und was jetzt abl&auml;uft, schiesst direkt
              ins eigene Knie.</TD> </TR>

            <TR>
              <TD valign="top">5. &nbsp;</TD>

              <TD>Offensichtlicher Schwachsinn w&auml;re sofort abgeschaltet worden, -
              dazu z&auml;hlen die ver&auml;nderten K&ouml;rperschaftssteuern, die
              Eigenheimzulagen, wo kinderplanende Paare bestraft werden, weil sie das
              Haus doch tats&auml;chlich f&uuml;r die Familie bauen m&ouml;chten und
              nicht nach der Familiengr&uuml;ndung. Dazu die 400-Eurojobs, damit
              Arbeitnehmer, die monatlich nicht mehr mit ihrer finanziellen Lage
              klarkommen, sich schnell, einfach und ohne viel Abz&uuml;ge ein bisschen
              was dazu verdienen k&ouml;nnen und zudem Kleinstunternehmen solche Hilfen
              annehmen k&ouml;nnen, um bestehen zu k&ouml;nnen oder um zu wachsen und
              dann wieder komplette Arbeitspl&auml;tze schaffen zu k&ouml;nnen. Und um
              Gr&uuml;nde wegzunehmen, alles &uuml;ber Schwarzarbeit machen zu
              m&uuml;ssen. Und und und.....</TD>
            </TR>

            <TR>
              <TD valign="top">6. &nbsp;</TD>

              <TD>Menschen, die in Eigenregie &uuml;berwiegend im Auftrag anderer Firmen
              arbeiten, - zB. freie Dozenten, freie Redakteure etc. w&uuml;rden nicht
              l&auml;nger "scheinselbstst&auml;ndig sein" und daher mit zus&auml;tzlichen
              Abgaben bestraft werden, die dieses Arbeitsverh&auml;ltnis unm&ouml;glich
              machen, damit dieser Dozent doch wieder beim Arbeitsamt landet und der
              Bildungstr&auml;ger Konkurs anmelden muss, weil er ganztags keine Dozenten
              braucht und sich auch nicht leisten kann.</TD>
            </TR>

            <TR>
              <TD valign="top">7. &nbsp;</TD>

              <TD>Weil die anderen L&auml;nder einen Wechsel erkennen und wieder mehr
              Vertrauen haben k&ouml;nnen.</TD>
            </TR>

            <TR>
              <TD valign="top">8. &nbsp;</TD>

              <TD>Weil statt des Herumsortierens der wenigen Arbeitspl&auml;tze auf viele
              Arbeitslose sich mehr auf Schaffung neuer Arbeitspl&auml;tze konzentriert
              w&uuml;rde.</TD>
            </TR>

            <TR>
              <TD valign="top">9. &nbsp;</TD>

              <TD>Weil sich vermutlich in der Innensicherheit einiges &auml;ndern
              w&uuml;rde, denn in allen SPD-regierten L&auml;ndern gibt es die
              h&ouml;chsten Kriminalraten und das lausigste Wirtschaftswachstum. Wird
              wohl seine Gr&uuml;nde haben, oder?</TD>
            </TR>

            <TR>
              <TD valign="top">10. &nbsp;</TD>

              <TD>(f&uuml;r mich pes&ouml;nlich:) ich mir nicht dieses d&auml;mliche
              Grinsen von Schr&ouml;der mehr ansehen m&uuml;sste! :-)</TD>
            </TR>
          </TABLE>

          <P>Mit etwas mehr Nachdenken w&uuml;rde sich diese Liste gen Ultimo
          weiterf&uuml;hren lassen, - also nochmals die Frage - w&auml;re es anders
          gelaufen, wenn jetzt die CDU/CSU regieren w&uuml;rde? Meine Antwort - Es
          w&auml;re kein Wunder zu erwarten gewesen, aber sie h&auml;tten es ganz
          sicher nicht schlechter tun k&ouml;nnen, aber ziemlich sicher etwas besser!
          Aber vor allem das Denken der Menschen w&auml;re auf "andere Richtung"
          eingestellt worden und nicht auf weiterhin bergab. So demotiviert waren die
          Deutschen noch nie!</P>

          <P>An dieser Stelle meinen herzlichen Dank an Andreas f&uuml;r seinen
          Diskussionsbeitrag. Hm, eigentlich solltest Du mir ja widersprechen, aber
          hier mache ich mal eine Ausnahme, - vielleicht hattest Du nicht gerade
          vorteilhafte Argumente auf Deiner Seite, stimmts? :-)</P>

          <P>Wie man vielleicht merkt, habe ich diesen Artikel sehr emotional
          geschrieben. Eigentlich h&auml;tte es mir etwas "seri&ouml;ser" gelingen
          sollen, aber je mehr man sich mit unserer momentanen politischen Situation
          befasst, desto mehr steigert man sich hinein. W&auml;re sch&ouml;n, wenn
          Ihr das auch k&ouml;nntet und ich hier von Euch beim n&auml;chsten Mal auch
          durch rot-gr&uuml;ne Brillen sehen d&uuml;rfte.</P>

          <P>Seit bis dahin gegr&uuml;&szlig;t,<BR>
          Euer Schwarzseher.<BR>
          Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

