<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink=
  "#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>PBC</B></FONT></P>

          <P align="center"><IMG src="dk_pbc1.gif" alt=""></P>

          <P><B>Nach der Wahl ist vor der Wahl. Besser ist: Nach der Wahl bleibt die
          Qual.</B></P>

          <P>Die Bundestagswahl ist nun schon "lange" vorbei und auch die vielen
          Wahlplakate sind l&auml;ngst abger&auml;umt. Schade ist nur, dass die
          Webpr&auml;senz manch d&uuml;sterer Kleinstpartei nicht auch abgebaut
          werden muss. Verzichtbar w&auml;re hier bestimmt auch die Site der Partei
          Bibeltreuer Christen. Wer gegen andere Religionen (etwa den Islam) hetzt,
          hat im WWW absolut nichts zu suchen. Zu den sozialen Ansichten komme ich
          noch im Detail.</P>

          <BLOCKQUOTE>
            <P><FONT color="#006000"><B>Die Partei Bibeltreuer Christen - <I>PBC</I>
            versteht sich als eine Partei f&uuml;r</B></FONT> <FONT color=
            "#FF0000"><B>ALLE</B></FONT><FONT color="#006000"><B>gleich welcher
            Konfession oder Denomination - die &uuml;berzeugt sind, da&szlig; ein
            aktives Engagement der Christen f&uuml;r unsere Gesellschaft dringend
            notwendig ist und da&szlig; die Weisheit der Bibel besser ist als vom
            Zeitgeist bestimmte Meinungen.</B></FONT></P>

            <P><FONT color="#006000"><B>Die Partei Bibeltreuer Christen - <I>PBC</I>
            -ist das politische Sprachrohr der Christen aus allen Kirchen, die f&uuml;r
            eine gesellschaftliche Wende durch Besinnung auf bew&auml;hrte biblische
            Grunds&auml;tze eintreten.</B></FONT></P>

            <P><FONT color="#006000"><B>In der Stimmenvielfalt einer Gro&szlig;partei
            werden Christen weitgehend "untergebuttert". Deshalb brauchen sie eine
            eigene Partei - die <I>PBC</I>. Als Christen in der <I>PBC</I> sehen wir
            unsere Verantwortung f&uuml;r das Gemeinwohl, schlagen politische
            Alternativen vor und handeln - ganz im Auftrag Jesu, der alle Menschen
            liebt. Seine Liebe sollte eine Leitlinie in der Politik sein. Daf&uuml;r
            treten wir ein!</B></FONT></P>
          </BLOCKQUOTE>

          <P>Seid mir bitte nicht b&ouml;se, aber <B>PBC</B> klingt verflixt nach
          &auml;tzender Chemie. Obwohl die einleitenden Worte grob gelesen doch
          vern&uuml;nftig zu sein scheinen. Aber schon die n&auml;chsten Zeilen
          lassen doch manchen Zweifel aufkommen, was zum Wahlkampf gesagt und bis
          heute stehen gelassen wurde.</P>

          <BLOCKQUOTE>
            <FONT color="#006000"><B>Jede Stimme f&uuml;r die <I>PBC</I> ist...</B></FONT>

            <UL>
              <LI><FONT color="#006000"><B>... eine Stimme f&uuml;r ehrliche
              Politik,</B></FONT></LI>

              <LI><FONT color="#006000"><B>... eine Stimme f&uuml;r die Ehe von Mann und
              Frau,</B></FONT></LI>

              <LI><FONT color="#006000"><B>... eine Stimme gegen die
              "Homo-Ehe",</B></FONT></LI>

              <LI><FONT color="#006000"><B>... eine Stimme f&uuml;r das
              Leben,</B></FONT></LI>

              <LI><FONT color="#006000"><B>... eine Stimme gegen die T&ouml;tung von
              Kindern im Mutterleib,</B></FONT></LI>

              <LI><FONT color="#006000"><B>... eine Stimme f&uuml;r die Aufwertung des
              "Berufs-Mutter",</B></FONT></LI>

              <LI><FONT color="#006000"><B>... eine Stimme f&uuml;r die Einf&uuml;hrung
              eines Erziehungsgehalts,</B></FONT></LI>

              <LI><FONT color="#006000"><B>... eine Stimme f&uuml;r V&auml;ter und
              M&uuml;tter, die sich der Erziehung ihrer Kinder widmen wollen, statt
              Ausweitung der Betreuung in Kindertagesst&auml;tten und
              Ganztagsschulen</B></FONT></LI>

              <LI><FONT color="#006000"><B>... eine Stimme f&uuml;r eine
              Zukunftsperspektive unserer Jugend durch die Einf&uuml;hrung von
              Bibelunterricht und Gebet an deutschen Schulen,</B></FONT></LI>

              <LI><FONT color="#006000"><B>... eine Stimme f&uuml;r die Beseitigung der
              Arbeitslosigkeit,</B></FONT></LI>

              <LI><FONT color="#006000"><B>... eine Stimme f&uuml;r die F&ouml;rderung
              des Handwerks, der Landwirtschaft und des Mittelstands,</B></FONT></LI>

              <LI><FONT color="#006000"><B>... eine Stimme f&uuml;r das Existenzrecht
              Israels in dem dem j&uuml;dischen Volk von GOTT zum ewigen Besitz gegebenen
              Land, einschlie&szlig;lich dem biblischen Jud&auml;a und Samaria, der
              sogenannten "Westbank".</B></FONT></LI>
            </UL>
          </BLOCKQUOTE>

          <P>Das Magazin "Salz und Licht" (das viermal im Jahr erscheint) ist so
          etwas wie die "Hauspostille" und bietet "PBC - intern" aktuelle Meldungen
          und auch "Erl&auml;uterungen" &uuml;ber die Streitfrage, was denn das
          Christentum mit Politik zu tun hat.</P> <HR>

          <P>Hier nun ungek&uuml;rzt ein Auszug, damit sich jeder selbst ein Bild
          machen kann:</P>
          <FONT size="4" color="#000080"><B>&nbsp;Kinder sind Geschenke Gottes</B></FONT>

          <H1 align="center"><FONT color="#3333CC"><B>Die PBC hat Antworten!</B></FONT></H1>
                     

          <P><I><FONT size="+1"><B>Folge 2: Wiederherstellung gesunder Familien in
          Deutschland</B></FONT></I></P>

          <H4><FONT color="#000080"><IMG border="0" src= "dk_pbc3.gif" align="right"
          hspace="10" width="212" height="304" alt=""><B>Gesunde Familien - Gesunder
          Staat</B></FONT></H4>

          <P>Das war unser Wahlslogan zur Bundestagswahl 1998.<BR> Auf dem
          nebenstehenden neu gestalteten Plakat war er landauf, landab zu lesen.
          Sicher ist dieses Plakat, das wir auch in der Zwischenzeit immer wieder
          gezeigt haben, in der Bev&ouml;lkerung wahrgenommen worden. Auf dem dazu
          geh&ouml;rigen Flyer hei&szlig;t es weiter:</P>

          <P><B>Erziehungsgehalt schafft Arbeitspl&auml;tze.</B></P>

          <P>Zwei wissenschaftliche Gutachten waren zu einem wesentlichen Baustein
          unseres bibelorientierten Konzeptes geworden.<SUP>1</SUP></P>

          <H4><FONT color="#000080"><B>Die etablierten Parteien und der
          Zeitgeist</B></FONT></H4>

          <P>F&uuml;r die etablierten Parteien stand das Thema Familie damals noch
          nicht zur Diskussion. Jetzt, vier Jahre sp&auml;ter, sieht das ganz anders
          aus. Da ist pl&ouml;tzlich so etwas wie ein Wettlauf um die Gunst der
          jungen W&auml;hler und potenziellen M&uuml;tter und V&auml;ter in Gang
          gekommen. Edmund Stoiber entdeckte im R&uuml;ckgang der Geburten schon ein
          Jahr, bevor er zum Kanzlerkandidaten der Union gek&uuml;rt wurde, "eine
          tickende Zeitbombe" und forderte monatlich 1.000 DM f&uuml;r jedes Kind,
          allerdings nur drei Jahre lang.<SUP>2</SUP> W&auml;hrend die Union der
          Familie mit finanziellen Hilfen unter die Arme greifen will, setzt die SPD
          eher auf die F&ouml;rderung au&szlig;erfamili&auml;rer Einrichtungen zur
          Unterbringung und Erziehung der Kinder, damit die Mutter so schnell wie
          m&ouml;glich wieder in ihren Beruf zur&uuml;ck kann. In dieser Zielsetzung
          liegen die Vorstellungen beider gro&szlig;en Parteien gar nicht so weit
          auseinander, wie es auf den ersten Blick erscheinen mag. Auch CDU/CSU
          zielen mit ihrem Familienkonzept nicht darauf ab, junge Frauen f&uuml;r den
          "Beruf" Mutter zu gewinnen, sondern darauf, das - vor&uuml;bergehende!
          -Nebeneinander von Beruf und Familie zu erleichtern. Nach den Freiburger
          Gutachten <SUP>1</SUP> ist zwar eine weit l&auml;ngere Zahlung von
          Erziehungsgehalt vorgesehen, im 98er-Gutachten bis zur Vollendung des 18.
          Lebensjahrs.</P>

          <P>Zugleich wird in diesem Gutachten (gegen&uuml;ber dem 96er) die Tendenz
          verst&auml;rkt, der jungen Mutter den Weg zur&uuml;ck in die Berufsarbeit
          zu ebnen. Die Entscheidung f&uuml;r einen Beruf Erzieherin der eigenen
          Kinder mit F&uuml;hrung eines - gro&szlig;en - Haushalts ist f&uuml;r die
          (98er-) Gutachter nicht f&ouml;rderungsw&uuml;rdig, ja wird von ihnen sogar
          als "Passivierung", als "R&uuml;ckzug auf eine allein sozialpolitisch
          finanzierte Biographie" diskreditiert.<SUP>3</SUP> Sie tragen damit dem
          Zeitgeist Rechnung, der unsere Gesellschaft seit Jahrzehnten geformt und
          jungen Frauen vermittelt hat, das Leben als Hausfrau und Mutter sei kein
          Beruf und bringe dauerhaft keine Erf&uuml;llung.</P>

          <H4><FONT color="#000080"><B>Familienfeindliche Gesetze</B></FONT></H4>

          <P>Dieser Trend ist durch die renten- und steuerrechtliche Gesetzgebung der
          letzten 45 Jahre ganz wesentlich verst&auml;rkt worden.<BR> Der Gesetzgeber
          bestraft Familien mit mehreren Kindern, treibt sie h&auml;ufig in die
          Armut. Besonders hart bestraft werden M&uuml;tter einer gr&ouml;&szlig;eren
          Zahl von Kindern, die im Alter keine ausreichende Hinterbliebenenrente zur
          Verf&uuml;gung haben, sei es, dass der Ehemann und Vater nichts oder nicht
          viel verdient hat, sei es, dass die Ehe geschieden ist.<BR> Solche Frauen,
          solche kinderreichen Familien empfinden die finanzielle Benachteiligung
          gegen&uuml;ber kinderlosen als ungerecht, wenn nicht diskriminierend. An
          dieser Benachteiligung hat auch das neuere Rentenrecht nichts Wesentliches
          ge&auml;ndert.</P>

          <P>Zwar werden nun immerhin drei Erziehungsjahre je Kind rentenrechtlich
          wie Arbeitszeit gewertet. Das ist eine Hilfe f&uuml;r eine kurze
          Unterbrechung der Erwerbsarbeit, aber nicht f&uuml;r ein dauerhaftes
          Engagement in Familie und Haushalt. So ist es nicht verwunderlich, dass
          dadurch der Trend zu immer weniger Kindern nicht gestoppt werden konnte.
          Wer das erreichen will, muss tiefer ansetzen, muss dem &Uuml;bel an die
          Wurzel kommen.</P>

          <H4><FONT color="#000080"><B>Der Ansatz der PBC</B></FONT></H4>

          <P>Darauf zielt die PBC mit ihrer Familienpolitik ab. Sie hat dem Zeitgeist
          schon 1998 den Kampf angesagt, weil dieser mit dem Geist Gottes nicht im
          Einklang steht. Der allm&auml;chtige Gott, der sich in der Bibel offenbart,
          hat sich dem Zeitgeist nicht angepasst. Er wird &uuml;ber den Zeitgeist
          triumphieren.</P>

          <P>Als Partei, die diesem Gott verpflichtet ist, braucht die PBC sich nicht
          zu scheuen, biblische Ma&szlig;st&auml;be anzulegen und Familienstrukturen
          ins Visier zu nehmen, die dem Zeitgeist zuwider laufen, die aber f&uuml;r
          die meisten L&auml;nder der Erde bis heute selbstverst&auml;ndlich sind und
          bis vor verh&auml;ltnism&auml;&szlig;ig kurzer Zeit auch bei uns noch
          selbstverst&auml;ndlich waren. Unsere Familienpolitik darf und muss auf die
          Wiederherstellung gesunder Familienstrukturen zielen.</P>

          <H4><FONT color="#000080"><B>Wiederherstellung gesunder Familien</B></FONT></H4>

          <P>Gesunde Familien leben davon, dass ein Elternteil vollzeitlich f&uuml;r
          die Erziehung der Kinder und die Versorgung aller &uuml;brigen
          Familienangeh&ouml;rigen, auch der &auml;lteren Generationen, da ist, in
          der Regel die Ehefrau und Mutter. Das entspricht Gottes
          Sch&ouml;pfungsordnung, und dem ist auch unser geltendes Grundgesetz noch
          verpflichtet, wenn in Artikel 6 bestimmt wird:</P>

          <P><I>Ehe und Familie stehen unter dem besonderen Schutz der staatlichen
          Ordnung. Pflege und Erziehung der Kinder sind das nat&uuml;rliche Recht der
          Eltern und die zuv&ouml;rderst ihnen obliegende Pflicht. &Uuml;ber ihre
          Bet&auml;tigung wacht die staatliche Gewalt.</I></P>

          <P>Dieses Modell von Familie ist auch f&uuml;r unsere bundesdeutsche
          Situation hilfreich. Dass die Fehlentwicklung der letzten vier bis
          f&uuml;nf Jahrzehnte unsere Gesellschaft in eine Lage gebracht hat, die
          dringenden Handlungsbedarf schafft, wird jetzt von nahezu allen
          verantwortlichen Politikern erkannt.</P>

          <H4><FONT color="#000080"><B>Der "Erfurt-Schock"</B></FONT></H4>

          <P>Der "Erfurt-Schock" hat auf dramatische Weise deutlich gemacht, in
          welche Welten unsere Kinder und Jugendlichen abdriften, wenn niemand da
          ist, der sich um sie k&uuml;mmert. "Nach dem, was jeder Lehrer,
          Sozialp&auml;dagoge, Polizist und hinreichend aufmerksame Elternteil
          &uuml;ber die seelische Verwahrlosung vieler junger Menschen in diesem Land
          wei&szlig;, muss es eher verwundern, dass derartiges Unheil nicht
          h&auml;ufiger geschieht.</P>

          <P>Die Familien zerfallen, manche sichtbar, manche nur innerlich.
          Erwachsene haben immer weniger Zeit f&uuml;r Kinder. Deren Mediennutzung
          nimmt mit elterlicher Duldung gef&auml;hrliche Formen an", schreibt Susanne
          Gaschke in der ZEIT.<SUP>7</SUP></P>

          <P>Was der Mensch s&auml;t, wird er ernten", sagt uns Gottes Wort (Galater
          6, 7). Was f&uuml;r eine Generation heranw&auml;chst und wie sich die
          Gesellschaft entwickelt, in der wir und unsere Nachkommen leben werden,
          entscheidet sich nicht in der Schule, schon gar nicht bei der Gestaltung
          des Waffengesetzes, sondern in der Familie. Das h&auml;ngt davon ab, ob wir
          Eltern freisetzen, Zeit in ihre Kinder zu investieren, viel Zeit. Krippe,
          Kindergarten, Ganztagsschule k&ouml;nnen "den Blick der Eltern in die Augen
          ihrer Kinder" nicht ersetzen.<SUP>7</SUP></P>

          <P>Damit kn&uuml;pft die Verfasserin des ZEIT - Artikels an die Tat des
          Lehrers an, der den Amoklauf des Todessch&uuml;tzen dadurch stoppte, dass
          er ihn aufforderte, ihm in die Augen zu sehen. "Berufsp&auml;dagogen haben
          weder die Zeit, noch die Aufgabe, allzusehr in ihre Sch&uuml;tzlinge zu
          dringen. Wie es in deren Seelenlandschaft aussieht, k&ouml;nnen,
          m&uuml;ssen zuerst die Eltern wissen. Die reflexhafte Forderung nach mehr
          Nachmittagsbetreuung geht darum als Reaktion auf das Erfurter Massaker
          ebenso in die Irre wie die Sehnsucht nach technischen L&ouml;sungen
          f&uuml;r menschliche Katastrophen.</P>

          <P>Nat&uuml;rlich kann man versuchen, un&uuml;bersichtliche Schulh&ouml;fe
          besser zu sichern, mit Z&auml;unen - Solche Vorschl&auml;ge sind, wie die
          Einf&uuml;hrung einer altersgebundenen Chipkarte f&uuml;r
          Zigarettenautomaten, Zeichen der Kapitulation. Wir glauben einfach nicht
          mehr daran, dass in unserer Gesellschaft f&uuml;r jedes Kind wenigstens ein
          Erwachsener da ist, der die Verantwortung tr&auml;gt, dem das Kind vertraut
          - und sich verpflichtet f&uuml;hlt. Der merkt, dass ein
          Zw&ouml;lfj&auml;hriger raucht oder dass in einem Neunzehnj&auml;hrigen
          t&ouml;dlicher Hass und unvorstellbare Gef&uuml;hllosigkeit wachsen. Und
          der die Unbequemlichkeit auf sich nimmt, dar&uuml;ber zu sprechen, zu
          streiten, f&uuml;r das Richtige zu k&auml;mpfen - nicht einmal, sondern
          drei&szlig;igmal, hundertmal."<SUP>&nbsp; 7,8<BR> </SUP> Mit erfreulicher
          Klarheit hat die Journalistin der ZEIT als Ursache immerhin f&uuml;r das
          Massaker in Erfurt die Mangelsituation in der Familie erkannt. Es ist eine
          qualitative wie quantitative Mangelsituation &ndash; qualitativ, soweit
          Kinder da sind, quantitativ, soweit Kinder gar nicht erst geboren
          werden.</P>

          <P>Wie radikal hier umgedacht werden muss, ist nur wenigen klar. Hier liegt
          der Auftrag der Partei Bibeltreuer Christen. Es gilt, die biblischen
          Ma&szlig;st&auml;be in konkrete politische Ziele umzusetzen. Wir
          m&uuml;ssen bei zwei Fragen ansetzen:</P>

          <BLOCKQUOTE>
            <P><B>Wie k&ouml;nnen junge Frauen f&uuml;r den
            BERUF HAUSFRAU UND MUTTER gewonnen werden?</B></P>

            <P><B>Wie k&ouml;nnen junge Ehepaare f&uuml;r
            die Gr&uuml;ndung einer Familie gewonnen werden, in der
            mehrere Kinder und auch die &auml;lteren
            Familienangeh&ouml;rigen erw&uuml;nscht sind?</B></P>
          </BLOCKQUOTE>

          <P>Dazu wird ein attraktives Berufsbild f&uuml;r den "Arbeitsplatz"
          Hausfrau und Mutter zu entwickeln sein. Schon die Gutachter des 98er
          Freiburger Gutachtens konnten auf ein Forschungsprojekt von 1997 hinweisen,
          das zu dem Ergebnis gef&uuml;hrt hat, dass die Versorgung des Haushalts und
          die Betreuung von Kindern eine Aufgabe ist, bei der "zahlreiche Kompetenzen
          (hier:</P>

          <P>Familienkompetenzen) entwickelt werden k&ouml;nnen -wie komplexes
          Probleml&ouml;sungsverhalten, Kommunikation und Konfliktf&auml;higkeit,
          p&auml;dagogische Kompetenz, Planung, Koordination und Belastbarkeit".
          <SUP>6</SUP> Diese Kompetenzen kommen &uuml;brigens nicht nur den Kindern,
          sondern auch "der Entwicklung berufsrelevanter F&auml;higkeiten
          zugute".<SUP>6</SUP> Alles das gilt verst&auml;rkt f&uuml;r die hier
          konzipierte Gro&szlig;familie.</P>

          <P>Weiter wird zu vermitteln sein, welch hohen gesellschaftlichen Rang die
          Wiederherstellung gesunder Familien hat, ja: dass unsere Gesellschaft
          anders gar nicht zu retten ist. Aufkl&auml;rungsarbeit ist dringend
          geboten. Das soll hier aber nicht n&auml;her ausgef&uuml;hrt werden. Statt
          dessen will ich mich auf die materiellen Bedingungen konzentrieren, die
          heute die Wiederherstellung gesunder Familienstrukturen verhindern. So viel
          sei aber hier noch einmal herausgestellt:</P>

          <BLOCKQUOTE>
          <P><B>Die Ver&auml;nderung der materiellen Bedingungen allein macht es
          nicht, auch nicht die Einf&uuml;hrung eines Erziehungsgehalts.</B></P>

          <P><B>Es muss an einer Bewusstseins&auml;nderung gearbeitet werden, an
          einer R&uuml;ckbesinnung auf Gottes gute Sch&ouml;pfung.</B></P>
          </BLOCKQUOTE>

          <P>Zu den notwendigen materiellen &Auml;nderungen geh&ouml;rt
          selbstverst&auml;ndlich eine ver&auml;nderte Wohnungsbaupolitik. Das soll
          hier jedoch nicht n&auml;her ausgef&uuml;hrt werden, nur so viel: Das
          Zusammenr&uuml;cken zu gr&ouml;&szlig;eren Familienverb&auml;nden
          w&uuml;rde den Wohnraumbedarf nicht erh&ouml;hen, sondern auf Dauer
          erheblich reduzieren. Man denke nur an die vielen Ein-Personen-Haushalte
          ganz junger und ganz alter Menschen!</P>

          <H4><FONT color="#000080"><B>Erziehungsgehalt (EG)</B></FONT></H4>

          <P>Das Erziehungsgehalt spielt eine zentrale Rolle, wenn es darum geht,
          Benachteiligungen von Familien mit mehreren oder gar vielen Kindern zu
          beseitigen. In Ankn&uuml;pfung an das Freiburger Gutachten von 1998 hat der
          Bundesparteitag im selben Jahr beschlossen, f&uuml;r ein EG einzutreten,
          das f&uuml;r das erste Kind 2.000 DM und f&uuml;r das zweite und jedes
          weitere Kind 800 DM betragen soll. Entsprechend den Gutachter-Empfehlungen
          soll es wie steuerpflichtiges Einkommen behandelt und neben dem Kindergeld
          bezahlt werden. Kindergeld ist eine Beihilfe zu den Kosten, das EG dagegen,
          wie es der Name zum Ausdruck bringt, Honorar f&uuml;r die Leistung des
          Erziehers. Gezahlt werden soll bis zur Vollendung des 16. Lebensjahres
          jedes Kindes.</P>

          <P>Anders als die Gutachter (98) tritt die PBC f&uuml;r eine
          einkommensabh&auml;ngige Zahlung des Erziehungsgehalts ein, d.h. gezahlt
          wird nur, wenn und solange ein Elternteil vollzeitlich f&uuml;r die
          Erziehung zur Verf&uuml;gung steht. Das EG kann nach unserem Konzept also
          nicht neben einer Erwerbsarbeit und auch nicht neben einem Studium oder
          einer sonstigen Ausbildung bezogen werden. Auch ein Nebeneinander von
          Teilzeitarbeit und Kindererziehung, etwa mit einem verminderten EG, ist mit
          unserem Familienkonzept nicht vereinbar. Das schlie&szlig;t allerdings
          Fortbildungsma&szlig;nahmen im erlernten Beruf nicht aus, wovon noch die
          Rede sein wird.</P>

          <P>Die wesentlichen Aussagen zum EG sind durch Beschluss des
          Bundesparteitages im Jahr 2000 in das Grundsatzprogramm aufgenommen worden
          und unten abgedruckt.</P>

          <P>Ein Gehalt f&uuml;r die Erziehung der eigenen Kinder -das
          st&ouml;&szlig;t bei manchen auf Befremden, auch bei M&uuml;ttern.
          Tats&auml;chlich soll das EG aber eine Rechtsentwicklung korrigieren, die
          mit Recht als "Enteignung" bezeichnet worden ist. Um das zu verstehen,
          m&uuml;ssen wir ein wenig zur&uuml;ckblenden - in die Zeiten n&auml;mlich,
          als M&uuml;tter noch wie selbstverst&auml;ndlich die Fr&uuml;chte ihrer
          Arbeit genie&szlig;en konnten.</P>

          <H4><FONT color="#000080"><B>R&uuml;ckblick</B></FONT></H4>

          <P align="left">Bis zum Beginn der Industrialisierung im 19. Jahrhundert
          lebten in den Familien Eltern, Kinder, Gro&szlig;eltern und evtl. weitere
          Verwandte zusammen. Im b&auml;uerlichen oder im Handwerksbetrieb war die
          Familie gleichzeitig die Arbeitsst&auml;tte, in der nicht nur der Vater als
          Hauptern&auml;hrer, sondern auch die Mutter und in gewissem Grad und je
          nach Alter auch schon die Kinder ihren Platz hatten. Je mehr Kinder da
          waren, desto mehr Arbeitskr&auml;fte wuchsen heran, die eines Tages den
          Unterhalt der Eltern &uuml;bernahmen. In diesem Familienbetrieb hatte die
          Ehefrau und Mutter eine bedeutende Stellung. Sie leitete den Haushalt und
          hatte wesentlichen Anteil an der Erziehung der Kinder. Je mehr Kinder,
          desto st&auml;rker ihre soziale Absicherung, auch f&uuml;r den Fall, dass
          der Mann und Hauptern&auml;hrer wegfiel, z.B. durch Krieg.</P>

          <P>Durch die Industrialisierung &auml;nderte sich die Arbeitswelt
          nachhaltig. In den meisten Familien leistete der Hauptern&auml;hrer seine
          Arbeit nun nicht mehr im Umfeld der Familie, sondern au&szlig;erhalb. Die
          Kinder waren nicht mehr wie bisher an der Familienarbeit beteiligt.
          F&uuml;r das Alter begann die Versorgung durch die Rentenversicherung.
          Daf&uuml;r musste die Erwerbsgeneration Beitr&auml;ge bezahlen. Hier liegen
          die Anf&auml;nge f&uuml;r einen grundlegenden Wandel: Die
          Rentenversicherungsbeitr&auml;ge fingen an, die Erwerbseinkommen zu
          belasten und den Spielraum f&uuml;r Unterhaltszahlungen an die Alten zu
          vermindern. Aber noch waren diese Beitr&auml;ge gering, entsprechend die
          Renten. Die Eltern konnten damit allein noch nicht auskommen, und die
          Jungen hatten zumindest noch Teile des Unterhalts zu &uuml;bernehmen. Noch
          blieb es, wenn auch in abgeschw&auml;chtem Ma&szlig;, dabei: Je mehr
          Kinder, desto solider die Alterssicherung f&uuml;r die Eltern dieser
          Kinder.</P>

          <P>Das fand ein j&auml;hes und abruptes Ende mit der Rentenreform von 1957.
          Mit dieser Reform wurden die Renten so angehoben, dass sie
          Lohnersatzfunktion erhielten, d.h. sie traten erkl&auml;rterma&szlig;en an
          die Stelle des Arbeitslohnes. Die Versichertengemeinschaft &uuml;bernahm
          den Unterhalt im Alter.</P>

          <P>Entsprechend drastisch war der Anstieg der
          Rentenversicherungsbeitr&auml;ge. Damit endete in Deutschland eine
          jahrtausendealte Lebensgewohnheit, nach der nicht nur die Eltern f&uuml;r
          die Kinder, sondern sp&auml;ter die Kinder f&uuml;r ihre Eltern sorgten.
          Welche Kluft sich da zwischen den Generationen anbahnte, ahnten die
          V&auml;ter der Rentenreform vermutlich gar nicht, eine Kluft, die heute
          durch die vielen Ein-Personen-Haushalte und die Altenheime anschaulich
          wird, in denen auch r&uuml;stige und geistig frische Angeh&ouml;rige der
          Gro&szlig;elterngeneration leben. Wie gern w&auml;ren sie in den Familien
          ihrer Kinder und Enkel! Wie gute Beitr&auml;ge k&ouml;nnten sie zur
          Entlastung des Haushaltes leisten, auch bei der Erziehung!</P>

          <P>Das Schlimmste an der Rentenreform von 1957 ist die Ungerechtigkeit, die
          den Familien mit Kindern und besonders den M&uuml;ttern dadurch widerfuhr.
          Die Erziehungsleistung wurde nicht als Arbeitsleistung gewertet und fand
          keine Ber&uuml;cksichtigung bei der H&ouml;he der Rente.</P>

          <P><B>W&auml;hrend kinderlose Rentner &uuml;ber Nacht pl&ouml;tzlich
          lebensstandardsichernde Renten von den Kindern anderer Leute erhielten,
          wurden die M&uuml;tter dieser Kinder durch das neue Recht um ihre
          origin&auml;r und genuin erworbenen Unterhaltsanspr&uuml;che geprellt.
          Faktisch war dies eine Enteignung mit b&ouml;sen Folgen: Schlagartig wurde
          die massenhafte Armut alter Frauen zum kardinalen Problem der
          Sozialpolitik. Dabei hatten sie mit der Erziehung ihrer Kinder den
          L&ouml;wenanteil der Altersvorsorge f&uuml;r ihre Generation geleistet.
          Seit der Rentenreform 1957 war die Familie also nicht mehr l&auml;nger
          Schutzraum, sondern ein Armutsrisiko erster Ordnung geworden."</B></P>

          <P>Das schreibt J&uuml;rgen Borchert, Richter am Hessischen
          Landessozialgericht und Berater des hessischen Ministerpr&auml;sidenten
          Roland Koch in familienpolitischen Fragen, Anfang diesen Jahres in der
          ZEIT.<SUP>4</SUP></P>

          <P>J&uuml;rgen Borchert hat 1992 das sog. "Tr&uuml;mmerfrauen- Urteil" beim
          Bundesverfassungsgericht erwirkt, mit dem immerhin ein Anfang mit der
          Ber&uuml;cksichtigung von Erziehungszeiten bei der Rente gemacht wurde.</P>

          <P>Die Folgen der gesetzgeberischen Fehlleistung von 1957 kennen
          wir.&bdquo;Immer mehr Frauen und M&auml;nner bekommen einfach keine Kinder
          mehr." <SUP>5</SUP> "Keine Rechtsordnung hat es je fertig gebracht, die
          Notwendigkeit von Geburt und Kindererziehung so zu negieren, wie es die
          unsrige mit ihrer sozusagen jungfr&auml;ulich erzeugten Rente
          tut".<SUP>4</SUP></P>

          <H4><FONT color="#000080"><B>Gibt es Alternativen zum Erziehungsgehalt?
          </B></FONT></H4>

          <P>Wie kann das Unrecht des Gesetzgebers am schnellsten und wirksamsten
          korrigiert werden? Ich sehe letztlich keine Alternative zum EG. Das ist
          nicht unumstritten, auch nicht bei den K&auml;mpfern f&uuml;r eine gerechte
          L&ouml;sung. J&uuml;rgen Borchert will sich offenbar mit der vollen
          Ber&uuml;cksichtigung der Erziehungszeiten im Rentenrecht (nicht nur
          f&uuml;r drei Jahre) und im Steuerrecht begn&uuml;gen: Ausdehnung des
          Ehegattensplittings auf ein Familiensplitting.</P>

          <P>Das hie&szlig;e, auch die Kinder w&uuml;rden bei der Aufteilung des
          steuerpflichtigen Familieneinkommens mitgez&auml;hlt werden und zur
          Steuersenkung beitragen.4 Was aber, wenn es der Familie an ausreichendem
          Einkommen fehlt oder wenn die Mutter ihren Lebensabend getrennt vom Ehemann
          verbringt?</P>

          <P>Ein wesentlicher Gesichtspunkt spricht f&uuml;r die Zahlung von Gehalt:
          Wir haben keine Zeit zu verlieren! Wenn wir jetzt oder doch so schnell wie
          m&ouml;glich eine nennenswerte Zahl junger Menschen f&uuml;r die
          Gr&uuml;ndung von Familien nach unserem Konzept gewinnen wollen,
          m&uuml;ssen wir ihnen etwas anbieten, worauf sie sogleich ihre
          Zukunftsplanung aufbauen k&ouml;nnen.</P>

          <H4><FONT color="#000080"><B>Kindererziehung und externer Beruf</B></FONT></H4>

          <P>Die bisherigen Darlegungen sind ein Pl&auml;doyer f&uuml;r den
          lebenslang ausge&uuml;bten Beruf der Hausfrau und Mutter. Wie schon gesagt,
          k&ouml;nnen dabei hohe soziale Kompetenzen entwickelt werden, die auch auf
          dem Arbeitsmarkt gefragt sind. Der Hinweis darauf mag es uns erleichtern,
          junge Frauen f&uuml;r die Erziehung eigener Kinder zu gewinnen. Nicht alle
          werden sich darauf gleich lebenslang einlassen wollen, vielleicht
          zun&auml;chst nur sehr wenige Frauen. Da ist ein langer Atem gefragt. Wir
          sollten ohne weiteres auch solche jungen Frauen ansprechen, die erst einen
          Beruf erlernen wollen oder schon erlernt haben und in diesen Beruf
          zur&uuml;ckkehren wollen, wenn die Kinder ein gewisses Alter erreicht
          haben. Ausdr&uuml;cklich ist im Grundsatzprogramm der Partei bestimmt:
          W&uuml;nscht der erziehende Elternteil, nachdem das j&uuml;ngste Kind das
          16. Lebensjahr vollendet hat, in die Erwerbsarbeit zur&uuml;ckzukehren,
          soll ihm das erm&ouml;glicht werden. Ist eine Weiterbildung angezeigt, ist
          sie von der &ouml;ffentlichen Hand zu f&ouml;rdern." (Nr.2.3 Abs.4) Dass
          das j&uuml;ngste Kind 16 Jahre alt sein muss, ist dabei nicht als Bedingung
          f&uuml;r die F&ouml;rderung aufzufassen. Auch die Mutter, die sich schon
          fr&uuml;her entschlie&szlig;t, in den (externen) Beruf zur&uuml;ckzukehren,
          sollte diese F&ouml;rderung erhalten. Mehr noch: Die bisherigen
          Vorstellungen des PBC-Familienkonzeptes haben gezeigt, dass nicht selten
          ein Bed&uuml;rfnis nach Fort- und Weiterbildung im erlernten Beruf schon
          w&auml;hrend der Erziehungszeit gesehen wird. Wie dem Rechnung getragen
          werden kann, wird Teil eines Fort- und Weiterbildungskonzepts sein, das bei
          Einf&uuml;hrung des EG zu erarbeiten ist. Dabei wird sorgf&auml;ltig darauf
          zu achten sein, dass die Erziehungsarbeit den absoluten Vorrang
          beh&auml;lt.</P>

          <H4><FONT color="#000080"><B>Elternschulung</B></FONT></H4>

          <P>Dar&uuml;ber hinaus sind Schulungsangebote f&uuml;r Kindererziehung und
          Haushaltsf&uuml;hrung ein weiteres Ziel. Mit R&uuml;cksicht auf die
          H&ouml;he des Erziehungsgehalts sollte erwogen werden, solche Schulungen
          obligatorisch zu machen, evtl. sogar die Zahlung des EG vom Nachweis der
          Teilnahme abh&auml;ngig zu machen. Sicher gen&uuml;gt es nicht, ein
          Elternteil freizustellen, ohne Einfluss darauf zu nehmen, dass die
          "bezahlte Zeit" tats&auml;chlich den Kindern zugute kommt - in einer
          bestm&ouml;glichen Erziehung.</P>

                    
          <P><I><FONT size="+1"><B>Folge 3: Gesunde Familien - Gesunder
          Staat</B></FONT></I></P>

          <P>In dieser letzten Folge geht es um die Finanzierung des
          Erziehungsgehalts (EG). Untrennbar damit verbunden ist eine
          gro&szlig;artige Entdeckung:</P> <B></B>

          <P><B>Es gibt kaum eine Krankheit, an der unsere hoch industrialisierte
          Gesellschaft mit stark zunehmender Tendenz leidet und f&uuml;r die enorme
          Kosten aufgewendet werden m&uuml;ssen, die nicht durch eine
          Wiederherstellung gesunder Familienstrukturen, wie sie Gottes Ordnung
          entsprechen, weitgehend &uuml;berwunden w&uuml;rde"</B> (2.6 Abs.2
          Grundsatzprogramm).</P>

          <P>Wir haben einen Katalog dieser "Krankheiten" zu Beginn der 1. Folge
          aufgelistet: Arbeitslosigkeit, Staatsverschuldung (durch die wir in
          unverantwortlicher Weise auf Kosten k&uuml;nftiger Generationen leben!),
          unl&ouml;sbare Probleme bei der Alterssicherung, ausufernde Kosten des
          Gesundheitssystems, Sucht, Kriminalit&auml;t, an der zunehmend Jugendliche
          und sogar Kinder beteiligt sind. Dieser Katalog ist - leider! -durchaus
          nicht vollst&auml;ndig. Die j&auml;hrliche T&ouml;tung Hunderttausender von
          Ungeborenen ist als die wohl schwerste und folgenreichste Erkrankung
          unserer Gesellschaft zus&auml;tzlich herauszustellen.<BR> Positiv gewendet,
          wagen wir die Aussage: Wiederherstellung gesunder Familien ist beinahe ein
          Allheilmittel - nat&uuml;rlich, so weit Heilung in einer gefallenen
          Sch&ouml;pfung &uuml;berhaupt erreichbar ist!</P>

          <H4><FONT color="#000080"><B>Finanzierung</B></FONT></H4>

          <P>Unser Finanzierungskonzept ist im Anhang zu 2.6 des Grundsatzprogramms
          der Partei niedergelegt. Dabei unterscheiden wir zwischen finanziellen
          Entlastungen, die mit der Zahlung von EG sozusagen automatisch eintreten
          (Folgeentlastungen), und Umverteilungen. Sofort wirksame Folgeentlastungen
          sind der Wegfall des bisherigen Erziehungsgeldes (nicht: des Kindergeldes
          &ndash; siehe oben!), der Arbeitslosenhilfe und Sozialhilfeleistungen an
          Familien und der Steuern und Sozialversicherungsbeitr&auml;ge aus dem EG.
          Kurzfristige Folgeentlastungen sind dadurch zu erwarten, dass mit dem EG
          Gelder in die H&auml;nde von Menschen kommen, die einen
          &uuml;berdurchschnittlichen Bedarf an sog. Konsumg&uuml;tern haben wie
          Lebensmittel, Kleidung u.&auml;., w&auml;hrend Besserverdienende eher Geld
          sparen oder z.B. f&uuml;r Reisen ins Ausland ausgeben. Die verst&auml;rkte
          Konsumg&uuml;ternachfrage ist geeignet, unsere Wirtschaft zu beleben.</P>

          <H4><FONT color="#000080"><B>Heilungserfolge</B></FONT></H4>

          <P>Hauptfinanzierungsquelle f&uuml;r das EG sind die Dinge, die im Anhang
          zu 2.6 als l&auml;ngerfristige Folgeentlastungen aufgef&uuml;hrt sind. Man
          k&ouml;nnte sie auch als die <B>Heilungserfolge</B> der von uns
          konzipierten Familienpolitik bezeichnen. In dem Ma&szlig;, in dem wieder
          mehr Kinder geboren werden, erledigen sich die zur Zeit unl&ouml;sbaren
          Probleme der Alterssicherung. Das brauche ich nicht weiter zu
          begr&uuml;nden. Die Krankenversicherung wendet j&auml;hrlich rund 300
          Milliarden DM auf. Durch Wiederherstellung gesunder Familienstrukturen kann
          ohne weiteres ein Teil der Ausgaben der Krankenversicherung eingespart
          werden.</P>

          <P>In gesunden Familien werden zahlreiche Leistungen, die heute ohne
          eigentliche medizinische Notwendigkeit von &Auml;rzten und anderen
          Angeh&ouml;rigen der Gesundheitsberufe erwartet werden, selbst erbracht.
          Das reicht von der Pille gegen die kleinste Unp&auml;sslichkeit bis zur
          station&auml;ren Behandlung. Einsame Menschen, oft, aber nicht nur alte,
          suchen den Arzt auf, um ein wenig Zuwendung zu erhalten.<BR> Einer der
          gr&ouml;&szlig;ten Ausgabenposten der Krankenkassen ist die Behandlung im
          Krankenhaus. Die &Auml;rzte im Krankenhaus machen ihre Entscheidung, wie
          fr&uuml;h der Patient entlassen werden kann, nicht selten davon
          abh&auml;ngig, ob er ein Zuhause hat, wo er weiter betreut werden kann. Die
          Pflegeversicherung wendet j&auml;hrlich mehr als 10 Milliarden Euro auf.
          Diese Ausgaben entfallen &uuml;berwiegend, soweit die alten Menschen in die
          Familien wieder eingegliedert werden.</P>

          <P>In dem Umfang, wie junge Frauen sich daf&uuml;r entscheiden,
          vollzeitlich eigene Kinder zu erziehen, wird der bisherige Arbeitsmarkt
          entlastet &ndash; zugunsten sonst Arbeitsloser.</P>

          <P>Auch gegen Sucht und Kriminalit&auml;t gibt es wohl kaum eine bessere
          Prophylaxe, als dass Menschen in gesunden Familien aufwachsen. Zahlen
          dar&uuml;ber, welche Kosten der Staat hier zur Zeit aufwenden muss und
          einsparen k&ouml;nnte, liegen mir nicht vor.</P>

          <P>Die Zahl der T&ouml;tungen Ungeborener wird bei einer &Auml;nderung der
          Einstellung zu Kindern und Familie drastisch zur&uuml;ckgehen. Das
          w&uuml;rde auch finanzielle Folgen haben. Als geistlich orientierte Partei
          d&uuml;rfen wir davon ausgehen, dass der Herr unser Land in einem
          unerwarteten Ma&szlig; segnen w&uuml;rde, wenn dieses f&uuml;r ihn wohl
          gr&ouml;&szlig;te &Auml;rgernis ausger&auml;umt oder doch wenigstens
          deutlich verringert w&uuml;rde.</P>

          <P>Schlie&szlig;lich kann erwartet werden, dass ein Staat, der die Probleme
          der Arbeitslosigkeit, der Renten-, Kranken- und Pflegeversicherung, der
          Sucht und Kriminalit&auml;t in den Griff bek&auml;me, auch bessere
          Ans&auml;tze zur R&uuml;ckf&uuml;hrung und schlie&szlig;lich Beendigung der
          Staatsverschuldung h&auml;tte.</P>

          <P>Zus&auml;tzlich g&auml;be es durchaus noch ergiebige
          Umverteilungsm&ouml;glichkeiten zu Lasten von Einkommensbeziehern, die
          keinen Beitrag zum Nachwuchs, zur Reproduktion, leisten.</P>

          <P>Selbstverst&auml;ndlich werden sich finanzielle
          &Uuml;berbr&uuml;ckungsma&szlig;nahmen zwischen Beginn der EG-Zahlungen und
          Wirksamwerden der l&auml;ngerfristigen Folgeentlastungen nicht vermeiden
          lassen. Aber das sollte angesichts der angestrebten Ziele niemanden
          beirren.</P>

          <H4><FONT color="#000080"><B>Schlussbemerkung f&uuml;r die Leser und alle, die
          sich mit dem Familienkonzept der PBC befassen:</B></FONT></H4>

          <P>Bei der Abw&auml;gung der Chancen, dieses Konzept zu realisieren, sollte
          das Hauptaugenmerk der Frage gelten, ob und welche Alternativen es gibt,
          Schritte zur Wiederherstellung gesunder Familien zu gehen und weniger oder
          gar nicht der Frage, ob Familienstrukturen nach biblischem Ma&szlig;stab im
          Deutschland des 21. Jahrhunderts nicht eine Utopie sind. Das k&ouml;nnen
          und wollen wir gern unserem Herrn &uuml;berlassen. Unsere Aufgabe ist nur,
          das f&uuml;r uns M&ouml;gliche zu tun. Wenn der Herr handeln will, kann er
          es auch durch eine so kleine Partei wie die PBC tun.</P>

          <P><B>Wer dieses Kind aufnimmt in meinem Namen, der nimmt mich auf</B> -
          das ruft unser Herr Jesus Christus einer Gruppe Erwachsener zu (Lukas 9,
          48). Er weist dabei auf ein lebendes Kind hin. Sollte sein Ruf nicht erst
          recht einer Gesellschaft gelten, die Kindern keinen Raum gibt oder die
          Kinder im Mutterleib zur T&ouml;tung freigibt? Sein Ruf gilt uns: Nehmt
          mich auf!<BR> <B>Deutschland braucht Jesus!</B></P>

          <H2 align="center"><FONT color="#0000FF"><B>Aus dem Grundsatzprogramm der
          PBC</B></FONT></H2>
                     

          <P><B>2.3 Mutter - ein vollwertiger Beruf mit Gehaltszahlung<BR> </B> Die
          PBC will das Ansehen der Mutter wieder st&auml;rken. Alle bisherigen
          Nachteile einer "Nur-Mutter" und "Nur-Hausfrau" m&uuml;ssen beseitigt
          werden. Mehrere seri&ouml;se Wirtschaftsinstitute und Demoskopen haben
          verschiedene Studien vorgelegt, die bei einer entsprechenden Umsetzung
          unseren Sozialstaat wesentlich ver&auml;ndern k&ouml;nnten. Kernst&uuml;ck
          dieser Studien ist die Einf&uuml;hrung eines Erziehungsgehaltes. Damit
          w&uuml;rde endlich die wichtigste Arbeit f&uuml;r unsere Gesellschaft, die
          Erziehung der nachwachsenden Generation, honoriert und die Anerkennung und
          Aufwertung des Berufs Mutter erreicht. Alle M&uuml;tter oder V&auml;ter,
          auch die alleinerziehenden, m&uuml;ssen in der Lage sein, ohne finanzielle
          Not ihre ganze Liebe und Kraft in die Erziehung ihrer Kinder zu
          investieren. M&uuml;tter erhalten bis zur Vollendung des 16. Lebensjahres
          jedes Kindes ein Erziehungsgehalt.</P>

          <P>Das Erziehungsgehalt ist so zu bemessen, dass es zusammen mit dem
          Kindergeld zur Versorgung der Familie ausreicht. F&uuml;r das
          Erziehungsgehalt sind Steuern und Sozialversicherungsbeitr&auml;ge
          abzuf&uuml;hren. Es kann statt M&uuml;ttern auch V&auml;tern gezahlt
          werden, soweit sie die Erziehung &uuml;bernehmen. Das Erziehungsgehalt wird
          nur f&uuml;r Zeiten gezahlt, in denen ein Elternteil sich vollzeitlich der
          Kindererziehung widmet.</P>

          <P>Erwerbseinkommen des Ehegatten wird nicht auf das Erziehungsgehalt
          angerechnet, f&uuml;hrt aber &uuml;ber die Besteuerung des
          Erziehungsgehalts zur Reduzierung des Nettoeinkommens.</P>

          <P>W&uuml;nscht der erziehende Elternteil, nachdem das j&uuml;ngste Kind
          das 16. Lebensjahr vollendet hat, in die Erwerbsarbeit zur&uuml;ckzukehren,
          soll ihm das erm&ouml;glicht werden. Ist eine Weiterbildung angezeigt, ist
          sie von der &ouml;ffentlichen Hand zu f&ouml;rdern.</P>

          <P><B>2.4 Adoptiveltern<BR> </B> Das in 2.3 Gesagte gilt f&uuml;r
          Adoptiveltern entsprechend. Ob das Erziehungsgehalt auch an andere
          Personen, insbesondere Verwandte des Kindes, gezahlt werden kann, wenn die
          Eltern des Kindes nicht mehr leben oder nicht in der Lage sind, die
          Erziehung zu &uuml;bernehmen, wird bei Einf&uuml;hrung des
          Erziehungsgehalts zu pr&uuml;fen sein.</P>

          <P><B>2.5 Begleitende Hilfen<BR> </B> F&uuml;r kinderreiche Familien sind
          ausreichend kindgerechte Wohnungen zu sozial ad&auml;quaten Preisen zur
          Verf&uuml;gung zu stellen.<BR> Zur Festigung des Familienzusammenhalts
          sollte ein gemeinsamer Familienurlaub pro Jahr bezuschusst werden.</P>

          <P><B>2.6 Finanzierung<BR> </B> Das Erziehungsgehalt und die weiteren in
          diesem Teil vorgesehenen Hilfen f&uuml;r Familien werden durch sofort
          wirksame, kurzfristig wirksame und l&auml;ngerfristig wirksame
          Folgeentlastungen sowie durch Umverteilung finanziert. N&auml;heres siehe
          Anhang zu Nr. 2.6, Seite 26 Es gibt kaum eine Krankheit, an der unsere
          hochindustrialisierte Gesellschaft mit stark zunehmender Tendenz leidet und
          f&uuml;r die enorme Kosten aufgewendet werden m&uuml;ssen, die nicht durch
          eine Wiederherstellung gesunder Familienstrukturen, wie sie Gottes Ordnung
          entsprechen, weitgehend &uuml;berwunden w&uuml;rde.</P>

          <P><B>2.7 Soziales Jahr<BR> </B> Junge, unverheiratete und kinderlose
          Frauen sollten nach M&ouml;glichkeit f&uuml;r ein freiwilliges soziales
          Jahr mit staatlicher finanzieller F&ouml;rderung gewonnen werden. Sie
          k&ouml;nnen Familien bei der Betreuung von Kindern sowie behinderten,
          alten, hilfs- oder pflegebed&uuml;rftigen Familiengliedern entlasten.</P>

          <P><B>Anhang zu 2.6<BR> (Finanzierung der Familienpolitik)<BR> </B> Sofort
          wirksame Folgeentlastungen sind Einsparungen, die gleich mit der
          Einf&uuml;hrung des Erziehungsgehalts eintreten wie Wegfall des bisherigen
          Erziehungsgeldes, der Arbeitslosenhilfe und Sozialhilfeleistungen sowie die
          Mehreinnahmen an Steuern und Sozialversicherungsbeitr&auml;ge aus dem
          Erziehungsgehalt. Kurzfristige Folgeentlastungen ergeben sich aus einer
          Belebung der Konsumg&uuml;ternachfrage, weil Familien mit Kindern noch
          &uuml;berdurchschnittlichen Bedarf an Konsumg&uuml;tern haben.
          L&auml;ngerfristige Folgeentlastungen erwartet die PBC als Ergebnis einer
          Familienpolitik nach ihrem Konzept. In dem Ma&szlig;, in dem es gelingt,
          gesunde Familienstrukturen wiederherzustellen, werden Krankenund
          Rentenversicherung entlastet. &Uuml;bernimmt die Familie auch die Pflege
          ihrer &auml;lteren oder behinderten Glieder, k&ouml;nnen sich die Ausgaben
          f&uuml;r die Pflegeversicherung stark reduzieren.</P>

          <P>Die Drogen- und Alkoholsucht bei Jugendlichen und gar Kindern wird bei
          Wiederherstellung gesunder Familien nicht weiter bedrohlich zunehmen wie
          bisher, sondern sp&uuml;rbar abnehmen. Dasselbe gilt f&uuml;r die Jugendund
          Kinderkriminalit&auml;t. Die Zahl der Abtreibungen wird drastisch
          zur&uuml;ckgehen und die Bev&ouml;lkerungspyramide wieder die f&uuml;r die
          Alterssicherung unerl&auml;ssliche Form erhalten. Schlie&szlig;lich ist
          eine Familienpolitik nach biblischen Ma&szlig;st&auml;ben der wirksamste
          Ansatz zur L&ouml;sung eines weiteren existentiellen Problems unserer
          Gesellschaft, der Arbeitslosigkeit. Soweit sich bisher erwerbst&auml;tige
          Elternteile der Kindererziehung widmen, werden Arbeitspl&auml;tze
          verf&uuml;gbar.</P>

          <P>Umverteilungen: Wesentliche Finanzbeitr&auml;ge k&ouml;nnen aus dem
          Wegfall ungerechtfertigter Beg&uuml;nstigungen anderer
          Bev&ouml;lkerungsgruppen gewonnen werden, vor allem, wenn diese keinen
          Beitrag zur Erziehung des Nachwuchses leisten. Der Wegfall des
          Ehegattensplittings f&uuml;r kinderlose Ehepaare und der Steuerfreiheit
          f&uuml;r Rentenbezieher seien hier nur als Beispiele genannt.</P>
          <P align="center"><IMG src="dk_pbc2.gif" alt=""></P>
          <HR>
        </TD>
      </TR>
      <TR>
        <TD>So - und nun lasst mich nie wieder eine Bemerkung zu dieser Partei machen !!!!!
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8" summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

