<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <BR> 
          <CENTER>
            <B><FONT color="#000099" size="+2">Alternative spirituelle Politik im neuen
            Zeitalter - Die Violetten</FONT></B>
          </CENTER>
          &nbsp;<BR>
          &nbsp; 

          <P><FONT color="#000099">Die Partei <B>Alternative spirituelle Politik im
          neuen Zeitalter - Die Violetten</B> arbeitet an einer Gesellschaftsordnung
          des neuen Zeitalters und strebt die Teilnahme an Landtags-, Bundestags- und
          Europawahlen an.</FONT></P>

          <P><B><FONT color="#000099">Die Violetten - die Partei des neuen
          Zeitalters</FONT></B></P>

          <P><FONT color="#000099">Die Partei <B>Alternative spirituelle Politik im
          neuen Zeitalter - Die Violetten</B> konnten nur in NRW an der
          Bundestagswahl 2002 teilnehmen; in diesem Bundesland konnten die
          Bedingungen f&uuml;r die Teilnahme an der Bundestagswahl erf&uuml;llt
          werden. Die im Bundestag vertretenen materialistischen und
          religi&ouml;s-materialistischen Parteien betreiben eine Politik, der noch
          keine spirituellen Erkenntnisse zugrunde liegen, die f&uuml;r die
          Verwirklichung des spirituellen freiheitlichen Zeitalters jedoch
          erforderlich sind. Auch die Programme der nationalistischen Parteien und
          der religi&ouml;sen Kleinparteien sind nicht aus spirituellen Erkenntnissen
          entstanden.</FONT><BR>

          <FONT color="#000099">Wer nicht zur Wahl geht, dem wird unterstellt, dass
          ihm/ihr alles egal sei. Dem spirituellen Menschen ist jedoch keineswegs
          alles egal. Gerade spirituelle Menschen sehen die Ganzheit in allem und
          sich selbst als Teil davon, der Mitverantwortung tr&auml;gt. Auch und
          gerade spirituelle Menschen wollen -und sollten! - gleichgesinnte
          politische Vertreter haben.</FONT><BR>

          <FONT color="#000099">Zirka 10 Millionen Menschen in Deutschland sind von
          Karma und Reinkarnation &uuml;berzeugt. Diese 10 Millionen k&ouml;nnten das
          W&auml;hlerpotential sein und damit die <B>Violetten</B> auf 20% aller
          W&auml;hlerstimmen bringen. Aber diese 10 Millionen sind nur zu einem
          kleinen Teil spirituell, die meisten sind religi&ouml;s und w&auml;hlen
          dementsprechend eine religi&ouml;se Partei oder gehen nicht zur Wahl. Nicht
          wenige sind der Meinung, dass der "liebe Gott" bzw. die geistige Welt das
          spirituelle freiheitliche Zeitalter schon schaffen werde, sie
          br&auml;uchten sich darum nicht zu k&uuml;mmern, es reiche, zu beten und zu
          meditieren. Nur durch spirituelle Menschen, die sich politisch engagieren,
          kann das spirituelle freiheitliche Zeitalter auf Erden verwirklicht werden.
          Mit materialistischen und religi&ouml;s-materialistischen oder
          religi&ouml;sen Parteien ist dies nicht m&ouml;glich. Die <B>Violetten</B>
          rufen daher alle spirituellen Menschen auf, sich dieser Partei
          anzuschlie&szlig;en. Je mehr Mitglieder und W&auml;hler diese Partei hat,
          desto n&auml;her r&uuml;ckt der Tag, an dem die <B>Violetten</B> in den
          Bundestag einziehen und ihre Vorschl&auml;ge f&uuml;r ein spirituelles
          freiheitliches Zeitalter &uuml;ber die Medien (Radio, Fernsehen, Presse und
          Zeitschriften) bekannt machen und schlie&szlig;lich verwirklichen
          k&ouml;nnen.</FONT></P>

          <P>Habt ihr schon mal geschwollene Nackenhaare gesehen? Meine hatten sich
          nicht nur gestr&auml;ubt, sie wurden auch dick, als ich die ersten Worte
          die Website gelesen hatte. Um an der Bundestagswahl teilnehmen zu
          k&ouml;nnen, m&uuml;ssen zwei Bedingungen des Gesetzgebers erf&uuml;llt
          werden: Eine gewisse Mitgliederzahl (nach einem Urteil des
          Bundesverfassungsgerichts sollten es mindestens 400 Mitglieder sein) und
          f&uuml;r fast jedes Bundesland mindestens 2000
          Unterst&uuml;tzungsunterschriften f&uuml;r die sogenannte Landesliste (die
          Landesverb&auml;nde stellen dann die Kandidaten auf).</P>

          <P>Und siehe da, was steht hier weiter unten?<BR>

          <FONT color="#000099">Die erforderlichen 2000
          Unterst&uuml;tzungsunterschriften sind in NRW zusammengekommen. Damit
          standen Die <B>Violetten</B> jedoch nur in NRW auf dem Wahlzettel.
          <B>Sp&auml;testens zur Europawahl im Mai 2004 werden <I>Die Violetten</I>
          im gesamten Bundesgebiet auf dem Wahlzettel stehen</B>.</FONT></P>

          <P>Auf dieser Website wird auch ganz gro&szlig; hervorgehoben, wie man in
          den einzelnen Wahlbezirken abgeschnitten hat, in der Summe sieht es dann so
          aus: Zweitstimmen in ganz NRW: 2440 von 10.469.815 g&uuml;ltigen Stimmen.
          Die Prozentzahl wurde aber nicht dazu geschrieben (= 0,023%). Dann wird
          aber noch hervorgehoben, dass in NRW die Violetten immerhin die
          B&uuml;So-Partei und die Humanistische Partei &uuml;berrundet hatten.</P>

          <P>Und wie kommt man auf den Namen <B>Die Violetten</B> ?<BR>

          <FONT color="#000099">Violett ist die Farbe mit der h&ouml;chsten
          Schwingungszahl, sie ist die Mischfarbe aus Rosa (weiblich) und Blau
          (m&auml;nnlich) und symbolisiert damit die ausgewogene Einheit der
          m&auml;nnlichen und weiblichen Elemente im einzelnen Menschen, aber auch
          die Zusammenarbeit von Frau und Mann, und der violette Strahl (der
          siebente) ist f&uuml;r den Aufbau des neuen Zeitalters von gro&szlig;er
          Wichtigkeit.</FONT></P>

          <P>Da man auch Ziele darstellen sollte und zwar so, dass sie auch
          &uuml;berzeugen, steht in der Pr&auml;ambel: </P>

          <P><FONT color="#000099">Da die etablierten Parteien nicht aus spiritueller
          Erkenntnis handeln, haben mit Beginn des 3. Jahrtausends Geistesfreunde aus
          mehreren Bundesl&auml;ndern die <I>Alternative spirituelle Politik&nbsp; im
          neuen Zeitalter - Die Violetten -</I> gegr&uuml;ndet. Alle Geistesfreunde
          in der Bundesrepublik Deutschland sind hiermit aufgerufen, sich dieser
          Partei anzuschlie&szlig;en. Wir streben eine Gesellschaftsordnung an, in
          der Selbsterkenntnis durch die individuelle spirituelle Entwicklung,
          Mitgef&uuml;hl, Hilfsbereitschaft, Kreativit&auml;t, offene Kommunikation,
          &ouml;kologisches Denken, Gewaltfreiheit, Freiheit im Geistesleben,
          Menschlichkeit im Wirtschaftsleben, Gleichberechtigung und Gleichwertigkeit
          von Frau und Mann und Toleranz obenan stehen. Wir wissen, dass jeder Mensch
          nur von seinem Bewusstseinsstand aus denken, f&uuml;hlen und handeln kann;
          daher bringen wir allen Verst&auml;ndnis entgegen, wobei jedoch Gewalt und
          Ausl&auml;nderfeindlichkeit nicht hingenommen werden k&ouml;nnen. Da die
          Erde f&uuml;r alle Menschen die St&auml;tte der Entwicklung zu h&ouml;herem
          Bewusstsein ist, setzen wir uns ganz beonders f&uuml;r den Schutz der Natur
          auf allen Ebenen und den verantwortlichen Umgang mit der Erde
          ein.</FONT></P>

          <P>Alles klingt doch sch&ouml;n und gut, ausschlaggebend ist aber der
          Einstiegssatz: <B>Da die etablierten Parteien nicht aus spiritueller
          Erkenntnis handeln,</B> und den sollte man sich erst einmal gen&uuml;sslich
          auf der Zunge zergehen lassen. Spirituell = geistig, geistlich,
          &uuml;bersinnlich. Ja was denn nun? Eins, zwei oder drei? Ein Wort aber
          drei ganz verschiedene Richtungen. Von welchem Substantiv leiten wir es nun
          ab?

          <UL>
            <LI>Spiritualen: eine Richtung bei den Franziskanern im 13./14. Jh., die
            alle Zugest&auml;ndnisse an weltliche Notwendigkeiten bek&auml;mpfte</LI>

            <LI>Spiritualismus: Lehre, dass das Physische seiner wahren Beschaffenheit
            nach Geist sei (Philosophie des Geistes).</LI>

            <LI>Spiritus [lat.]: Luft, Atem, Lebenshauch, Geist, Seele, Hausgeist.</LI>
          </UL>

          Die Auswahl ist gro&szlig; und f&uuml;r jeden ist die richtige
          Erkl&auml;rung mit dabei. Aber ich sehe es nicht als meine Aufgabe an, hier
          eine treffende Charakterisierung heraus zu filtern. Das ganze
          Parteiprogramm stellt mehr oder weniger eine Luftblase dar, denn als erstes
          soll der Bundestag auf 200 Personen reduziert werden und alle Parteien sind
          zugelassen. Und und und. Und nun den letzten Punkt, den gebe ich voll
          wieder:</P>

          <P><B><FONT color="#000099">Sicherheit und Frieden</FONT></B> <BR>

          <FONT color="#000099">Ein h&ouml;her entwickeltes Bewusstsein, das viele
          Konflikte vermeiden oder l&ouml;sen kann, stellt einen gro&szlig;en Faktor
          der Friedenssicherung dar. Aus diesem Grunde und weil spirituelle Menschen
          die Gewalt als Mittel zur L&ouml;sung von Problemen ablehnen, wird die
          Bundeswehr in eine Friedens- und Katastrophenschutztruppe im Dienste der
          V&ouml;lkergemeinschaft umgewandelt, und zwar mit einer St&auml;rke von 100
          000, wodurch mehr als 10 Milliarden Euro eingespart werden. Die Wehrpflicht
          wird abgeschafft. Das Verteidigungsministerium wird damit ein Friedens- und
          Katastrophenschutz-Ministerium.</FONT> </P>
                    
          <P>Da hat sich wirklich keiner nur einen Gedanken &uuml;ber die immensen
          Folgen gemacht, und ich verkneife es mir hier auch nur noch einen einzigen
          zus&auml;tzlichen Gedanken zu verschwenden. Doch, hier m&ouml;chte ich noch
          die Seite der Dienstleistungen aufzeigen: </P>

          <H2><FONT color="#000099"><B>Dienstleistungen des Zentrums f&uuml;r
          spirituelle Entwicklung</B></FONT></H2>

          <CENTER> <B><FONT color="#400080"><FONT size="+2">Das Zentrum f&uuml;r
          spirituelle Entwicklung&nbsp;</FONT></FONT></B> </CENTER>

          <CENTER> <B><FONT color="#3333FF"><FONT size= "+2">Dienstleistungs- und
          Fernsehfilm-GmbH BEWUSSTSEIN</FONT></FONT></B> </CENTER>

          <P><FONT color="#400080">Die Dienstleistunges-Angebote der Dienstleistungs-
          und Fensehfilm-GmbH BEWUSSTSEIN konzentrieren sich vor allem auf
          spirituelle Lebensberatung und Partnerschaftsvermittlung. Die
          Lebensberatung umfa&szlig;t unter anderem auch Partnerschafts-, Familien-,
          Erziehungs-, Gesundheits- und Schwangerschaftsberatung, in der - aber auch
          unabh&auml;ngig davon - Interessenten eine nat&uuml;rliche
          Empf&auml;ngnisregelung (ohne Pille und mechanische Verh&uuml;tungsmittel)
          kennen- und anzuwenden lernen.</FONT></P>

          <P><FONT color="#400080">Die Abteilung Video-Produktion, die schon mehr als
          30 bewu&szlig;tseinsanregende Filme hergestellt hat; eine Videoliste kann
          gegen R&uuml;ckporto beim Zentrum angefordert werden. Auf Wunsch werden
          auch Filme &uuml;ber bewusstseinsf&ouml;rdernde Firmen, Vereine,
          Gesellschaften, Gruppen und Einzelaktivit&auml;ten preisg&uuml;nstig
          hergestellt.</FONT></P>

          <P><FONT color="#400080">So manches, was in esoterischen Zeitschriften und
          auch anderswo angeboten wird, ist unseri&ouml;s oder behindert die
          Bewu&szlig;tseinsentwicklung/spirituelle Entwicklung bzw. macht psychisch
          krank. Auch diesbez&uuml;glich kann im Zentrum Rat eingeholt
          werden.</FONT></P>

          <P><FONT color="#400080">Die Partnerschaftsvermittlung verl&auml;uft so,
          da&szlig; die Interessierten eventuelle Partner/innen zun&auml;chst
          schriftlich &uuml;ber einen kurzen Lebenslauf mit Foto und
          Wunschvorstellungen kennenlernen, dem dann der Eigeninitiative N&auml;heres
          vorbehalten bleibt. Wer die Partnerschaftsvermittlung in Anspruch nehmen
          m&ouml;chte, schickt dem Zentrum einen kurzen Lebenslauf (nicht l&auml;nger
          als eine halbe DIN-A4-Seite) mit 10 Fotos von sich und maximal eine halbe
          DIN-A4-Seite &uuml;ber seine Wunschvorstellungen betreffs Partner/in (alles
          geschrieben mit Schreibmaschine oder Computer).</FONT></P>

          <P>Und wer hat heute noch eine Schreibmaschine? Doch nur die ewig
          Gestrigen. </P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

