<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Editorial der NoCover</TITLE>
  </HEAD>

  <BODY background="int_bg.gif" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#000080" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD width="70">&nbsp;</TD>
        <TD>
          <BR>                               

          <CENTER>
            <IMG src="edito.gif" width="275" height="85" alt=""><BR>
            <H2><B>zur NoCover #105 (01.12.2002)</B></H2>
          </CENTER>

          <P>Liebe Leser(Innen) !</P>

          <P>Mein heutiges Vorwort beginne ich mit einem Nachwort:<BR>
          Es betrifft den Artikel "Puzzlebobs Review" von Rainer (Machine) Thielke in
          der NoCover-104/Games.</P>

          <P>Olaf K&ouml;bnik ("Amiga-Arena") beschwert sich mit Recht, dass es
          ziemlich unprofessionell ist, einen Sachstandsbericht &uuml;ber ein Spiel
          abzugeben, der den Stand vor &uuml;ber einem halben Jahr darstellt und noch
          nicht einmal richtig .... - nein lassen wir die Fortsetzung, denn dies
          w&auml;re meine Meinung gewesen und ich k&ouml;nnte vielleicht leicht
          schief liegen und dann habe ich es wieder auszubaden.</P>

          <P>Also an alle diejenigen, die keinen Internetzugriff haben: PuzzleBobs
          kostet als Verkaufsversion 20 Euro, die gelesene Darstellung in der NC-104
          ist &uuml;ber &frac12; Jahr alt und wird dem Spiel keineswegs mehr gerecht.
          Diejenigen, die &uuml;ber einen Internetzugang verf&uuml;gen, k&ouml;nnen
          auf <B>&lt;www.online-club.de/~ARENA/&gt;</B> die g&uuml;ltigen Details in
          der entsprechenden Rubrik nachlesen. Wer das Demo spielen m&ouml;chte und
          Abonnent der AmigaFuture ist, kann ja mal wieder die Scheibe CD-38
          auflegen. Aber auch auf der Leser-CD der AmigaPlus ist das Demo enthalten,
          nur die Nummer der CD ist mir gegenw&auml;rtig nicht gel&auml;ufig.</P>

          <P>Quintesenz meines Nachwortes: Jeder Autor, der einen Sachstandsbericht,
          eine Tools- oder Spielebeschreibung, einen Workshop oder Tipps
          ver&ouml;ffentlicht, sollte auf Authentizit&auml;t, fachliche und sachliche
          Richtigkeit und wenn m&ouml;glich auf Vollst&auml;ndigkeit achten. Jeder
          ist f&uuml;r seinen Artikel selbst verantwortlich. Ich pers&ouml;nlich
          schreite erst ein, wenn ich offentsichtliche Copyrightsverletzungen erkenne
          und wenn mit Absicht die g&uuml;ltigen Netiquette verletzt werden.</P>

          <P>Jetzt zur Gegenwart: Wenn keine Einw&auml;nde bestehen, lasse ich
          Anzeigen in der Rubrik "Kleinanzeigen" einen zus&auml;tzlichen Monat
          stehen. Wenn eine Anzeige weitere Ausgaben bestehen bleiben soll, ist diese
          monatlich neu zu beantragen, damit keine "Karteileichen" entstehen.</P>

          <P>Jetzt am Wochenende ist in Aachen eine "Amiga-Messe". Erst wollte ich
          schreiben <B>die Amiga-Messe</B>, aber das war wohl einmal und kommt
          h&ouml;chstwahrscheinlich auch nicht wieder. Was mich sehr erstaunte, in
          der AmigaPlus 10/2002 wurde nur in einem Nebensatz auf die Retro-Messe in
          Aachen verwiesen und das, obwohl A+ in den letzten Jahren mit als
          Ausrichter auftrat. Den Artikel in der 09/2002 hat man doch zwischenzeitig
          schon wieder vergessen. Daf&uuml;r wird aber in der 11/2002 die Messe nicht
          vergessen, sogar mit ganzseitiger Anzeige auf der r&uuml;ckw&auml;rtigen
          Einschlagseite des Heftes und einem doppelseitigen Artikel gew&uuml;rdigt.
          Und nun wollen wir uns &uuml;berraschen lassen und in der NoCover-106
          hoffentlich ausgiebig dar&uuml;ber berichten - mit m&ouml;glichst vielen
          Stimmen.</P>

          <P>Gespannt bin ich schon einmal auf den Auftritt des neuen Magazins
          "GetBoinged", in das die NoCover ja aufgehen sollte. Im Netz ist der Name
          aber schon verschwunden und zwar mit dem Hinweis: <A href= "edito1.html"
          target="_top"><B>"Verboten"</B></A>. Was wird dann wohl aus dem
          "Nonplusultra"-Magazin werden? Ob es doch eine Interessenkollision mit dem
          Namen gab? Schaut euch die Website <B>"www.getboinged.org"</B> an, die
          lohnt sich wirklich.</P>

          <P>Aber genauso gut muss ich fragen, was wird aus <B>unserem</B> Magazin
          werden? Manchmal kann ich mich sehr gut in die Lage eines Firmenchefs
          versetzen, der auf der Jahresabschlussfeier folgendes von sich gab:<BR>
          "Liebe Mitarbeiterinnen, liebe Mitarbeiter. Das zur&uuml;ckliegende Jahr
          war in jeglicher Hinsicht eine Katastrophe, wir standen direkt vor dem
          Abgrund. Aber im kommenden Jahr machen wir einen gro&szlig;en Schritt nach
          Vorn!"<BR>
          Und den Schritt g&ouml;nne ich der NoCover nicht, aber als
          Alleinunterhalter m&ouml;chte ich auch nicht fungieren.</P>

          <P>Mein Tagesschmunzler:<BR>
          Es gie&szlig;t in Str&ouml;men. Ein Herr kommt ins Fundb&uuml;ro und fragt:
          "Hat hier jemand einen Schirm abgegeben?" -"Nun, wie soll ihr Schirm denn
          aussehen?" -"Och, das spielt keine Rolle, nur dicht muss er sein."</P>
          <HR width="60%">

          <P>Nachdem nun das erste Kerzlein auf dem Adventskranz schon gebrannt
          hatte, ging auch mir ein Licht auf, das n&auml;chste Editorial schreibe ich
          erst im neuen Jahr und so m&ouml;chte ich anstelle der pauschalen
          Weihnachts- und Neujahrw&uuml;nsche und des obligatorischen
          Jahresr&uuml;ckblicks (den ich mir wirklich verkneife) eine kleine
          Geschichte hier wiedergeben.</P>

          <TABLE border="2" align="center" summary="" cellpadding=
          "10">
            <TR>
              <TD>
                <CENTER>
                  <H2><B>Friede auf Erden</B></H2>

                  <P>Sie haben vom Frieden auf Erden gesungen,<BR>
                  damals, in der heiligen Nacht.<BR>
                  Ihre Lieder sind schon lange verklungen,<BR>
                  - und was haben wir mit dem Frieden gemacht?</P>

                  <P>Wir fordern Frieden und sagen: ICH!<BR>
                  Wir erwarten den Frieden und denken: ICH
                  NICHT!</P>

                  <P>Wir hoffen auf Frieden und Ungeduld -<BR>
                  und sagen doch: Der andere hat Schuld.</P>

                  <P>Wir rufen: Frieden soll &uuml;berall sein -<BR>
                  und fragen gleichzeitig: Wer warf den ersten Stein?</P>

                  <P>Wir sagen: Frieden ist nicht nur ein Wort-<BR>
                  und wollen alles f&uuml;r uns - und zwar sofort.</P>

                  <P>Wir sehen den Frieden als h&ouml;chstes Gebot.<BR>
                  Millionen Menschen leben in Not.</P>

                  <P>Sie haben vom Frieden auf Erden gesungen,<BR>
                  damals, als Gott mit uns neu begann.<BR>
                  Ihre Lieder sind schon lange verklungen -<BR>
                  und der Friede - f&auml;ngt zuerst bei mir selber an.</P>
                  <FONT size="-1">Beate Schaller</FONT>
                </CENTER>
              </TD>
            </TR>
          </TABLE>

          <P>Und nun w&uuml;nsche ich viel Spa&szlig; beim Lesen der eingesandten
          Beitr&auml;ge und w&uuml;nsche doch ein Frohes Fest und einen guten Rutsch
          ins Neue Jahr !<BR>
          Wolf.</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

