<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Interview Nr 1</TITLE>
  </HEAD>

  <BODY background="nc_bg2.jpg" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <CENTER>
            <P><FONT color="#000080" size="7"><B>Amiga Arena Interview</B></FONT></P>

            <TABLE width="60%" cellpadding="0" cellspacing="0" summary="">
              <TR>
                <TD valign="top">Entwickler:</TD>
                <TD><B>Telemar Rosenberger</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Software:</TD>
                <TD>AmHuhn</TD>
              </TR>

              <TR>
                <TD valign="top">Homepage:</TD>
                <TD> </TD>
              </TR>

              <TR>
                <TD valign="top">Email:</TD>
                <TD> </TD>
              </TR>
            </TABLE>
          </CENTER>
          
          <P><FONT color="#006000"><B>Hallo Telemar, kannst Du bitte etwas &uuml;ber
          Dich und Deinem Amiga Werdegang erz&auml;hlen?</B></FONT><BR>

          Da m&uuml;sste ich beim C64 anfangen und dann &uuml;ber den C128, Amiga
          2000d bis hin zum Amiga 4000T PPC.</P>

          <P>Das w&auml;re wohl zuviel! Oder kennt ihr noch den Poke 1024,1? Sie
          waren schon von Anfang an andere Computer oder auch Nischenrechner, die
          mich fasziniert haben. Sie haben meiner Meinung nach alle den heutigen
          "vielf&auml;tigen Dosen" etwas voraus, von der Software bis zur
          Hardware.</P>

          <P>Ich sehe das wohl mehr als Programmierer, weniger als Anwender. Aber
          wenn ich an einer "PCDose" arbeite, sehe ich immer noch die gleichen
          Unzul&auml;nglichkeiten der damaligen PCs.</P>

          <P>Die haben sich - bis auf mehr bunte Bildchen - nicht ver&auml;ndert. Der
          Anwender wird immer noch im Chaos zur&uuml;ckgelassen, wenn da was nicht
          l&auml;uft. Daher arbeite ich immer noch am AMIGA und hoffe auf einen Neuen
          AMIGA ONE.</P>

          <P><FONT color="#006000"><B>Dank Dir und Franz Schlick (AmiForce) habt Ihr
          mit "AmHuhn" nun auch der Amiga Gemeinde ein "Moorhuhn" Spiel
          erm&ouml;glicht. Was hat Dich (Euch) auf die Idee gebracht dieses Spiel
          umzusetzten?</B></FONT><BR>

          Oh ja, es ist schon etwas l&auml;nger her, damals traf ich Petra Struck und
          Torsten Dudai auf einer Amigamesse in Neukirchen-Vluyn. Er hat dort eine
          Grafik von Amiga und Moorhuhn gezeichnet, und ich dachte das sollte man mal
          f&uuml;r den Amiga umsetzen.</P>

          <P>Leider hatte er keine Zeit mehr (beruflich Gr&uuml;nde) an der Grafik zu
          arbeiten und so dauerte es bis ich einen Grafiker &uuml;bers Internet
          kennengelernt habe, der auch einige Moorh&uuml;hner als Icon erstellte.</P>

          <P>So machten wir uns daran, das Moorhuhn f&uuml;r Amiga umzuschreiben,
          erst mal mit der Orginalgrafik. Durch den Grafiker lernte ich auch einen
          Sounder kennen und das war Franz Schlick, wir machten uns an die Arbeit und
          waren auch schon zu ca. 80% fertig. Doch dann bekamen wir weder eine
          Antwort von Phenomedia, noch von dem Grafiker von Mohrhun. Das war auch
          gerade die Zeit wo Phenomedia Insolvenz anmeldete und der Grafiker sich von
          Phenomedia verabschiedete und die wohl heute noch um die Rechte von MHuhn
          streiten. Nach einigen Wortgefechten, warum wir jetzt nicht ein anderes
          Huhn usw. machen, stieg der Grafiker aus dem Team aus.</P>

          <P>So machten Franz und ich alleine weiter. Neue Grafik, neues Game. Das
          war vor 3 Monaten.</P>

          <P><FONT color="#006000"><B>Wann hast Du mit der Entwicklung angefangen und
          woran ist es letztendlich Gescheitert das Ihr "Moorhuhn" nicht f&uuml;r den
          Amiga umsetzten konntet?</B></FONT><BR>

          siehe oben.</P>

          <P><FONT color="#006000"><B>Das Spielprinzip hinter "Moorhuhn" ist ja nicht
          neu, warum wolltet Ihr anfangs nicht direkt ein eigenst&auml;ndiges Spiel
          dieser Art entwickeln?</B></FONT><BR>

          Es war einfacher und schneller mit einer vorhandenen Grafik anzufangen,
          damit konnte ich erstmal meine Programmierkenntnisse wieder
          auffrischen.</P>

          <P><FONT color="#006000"><B>Worin unterscheidet sich "AmHuhn" von seinem
          Vorbild "Moorhuhn" im einzelnen?</B></FONT><BR>

          1. Andere und mehr Objekte zum abschiessen<BR>

          2. Um an die Sch&auml;tze zu kommen, muss etwas mehr getan werden.<BR>

          3. Man bekommt Punktabzug, wenn die H&uuml;hner &uuml;berleben.<BR>

          4. Und das ist wohl das Wichtigste. Jeder kann die Grafik ab&auml;ndern,
          wenn alle die gleiche Farbpalette haben, und so sein eigenes xxHuhn
          kreieren, und seinen Bekannten weitergeben.</P>

          <P><FONT color="#006000"><B>Welche Features k&ouml;nnen wir noch erwarten,
          bez. habt Ihr vor umzusetzen oder wird "AmHuhn" weiterhin "nur" von
          "Moorhuhn" kopiert?</B></FONT><BR>

          Nein, ich versuche da noch was zu &auml;ndern, so dass es auch auf anderen
          Rechnerkonfigurationen l&auml;uft. Wir kopieren das Moorhuhn nicht weiter,
          wir machen es besser oder anders. Wir wollen auch bei AMHuhn nicht
          stehenbleiben, denn "wir haben da noch was besseres in der Mache" :-)</P>

          <P><FONT color="#006000"><B>Welche Software verwendest Du zum
          Entwickeln?</B></FONT><BR>

          Leider noch immer den Lattice Assembler und C Compiler "Hallo Haage &amp;
          Partner" ;-) Moonzoom PPC, FxPaint, UlraConvert, MainactorPro,
          PerfectPaint.</P>

          <P><FONT color="#006000"><B>Die Hardware Vorrausetzungen sind f&uuml;r ein
          Freeware Spiel ungew&ouml;hnlich hoch, was ich pers&ouml;nlich erfreulich
          finde, da ich denke, dass die meisten User heute &uuml;ber eine GFX Karte
          verf&uuml;gen (sollten). Was war Euer Entschluss es f&uuml;r GFX Karten
          umzusetzen?</B></FONT><BR>

          Alles, es ist nun mal so, der AGA Chip ist gut und daf&uuml;r gibt es ja
          genug Games usw. Mich st&ouml;rte das, weil ich eh auf einer Grafikkarte
          arbeite und die Leistung sehr gut ist. Man kommt halt ohne Grafikkarte
          nicht aus und sie ist auch zeitgem&auml;ss, sollte sich jeder zulegen.</P>

          <P><FONT color="#006000"><B>K&ouml;nnen AGA User dennoch mit einer
          Umsetzung rechnen?</B></FONT><BR>

          Ich habe nebenbei auch noch andere Hobbys: Arbeiten, Frau, Kind und Hund
          ;-)<BR>

          AGA h&auml;ngt von der Nachfrage ab. Die ist bis jetzt noch nicht so
          gross.</P>

          <P><FONT color="#006000"><B>Sollten andere Entwickler nicht auch dazu
          &uuml;bergehen in Zukunft verst&auml;rkt GFX Karten zu
          unterst&uuml;zen?</B></FONT><BR>

          Zwangsl&auml;ufig wird es wohl auch so kommen, es geht nicht anders.</P>

          <P><FONT color="#006000"><B>Glaubst Du das es noch aussreichend "Spieler"
          am Amiga gibt?</B></FONT><BR>

          Ja, da bin ich mir ganz sicher,wenn ich die Downloads von AMHuhn ansehe ist
          das eindeutig.</P>

          <P><FONT color="#006000"><B>Was glaubst Du ist der Grund,das es immer
          weniger Entwickler gibt die Interesse haben Freeware Spiele zu
          entwickeln?</B></FONT><BR>

          Heutzutage m&ouml;&para;chte sich fast jeder eine Goldene Nase verdienen
          und wenn er sie dann hat eben Goldene Schuhe usw. Der Nutzer hat da nur
          noch einen riesigen Karton, mit ganz wenig drin. Das macht eben doch den
          Amigafreund aus, helfen ohne 0190 Nummer, und das bei Anwendersoftware,
          sowie bei einigen Freewaregames.</P>

          <P><FONT color="#006000"><B>Welche Spiele bevorzugst Du noch heute am
          Amiga?</B></FONT><BR>

          Noch ist gut :-) AMHuhn;-)<BR>

          Heratic, Q*** , Nightlong, Myst, Shogo, Wipeout, Freespace, und am liebsten
          Atlantis und MonkeyIsland immernoch genial.</P>

          <P>Komisch, da sagt man, es gibt keine Games f&uuml;r den AMIGA.</P>

          <P><FONT color="#006000"><B>F&uuml;r welches System (AmigaOS, AmigaDE,
          MorphOS) entwickelst Du?</B></FONT><BR>

          F&uuml;r meins ;-)<BR>

          AmigaOS.</P>

          <P><FONT color="#006000"><B>Welches Betriebssystem wirst Du zuk&uuml;nftig
          unterst&uuml;tzen?</B></FONT><BR>

          Das was bald da ist AmigaOne OS4.0</P>

          <P><FONT color="#006000"><B>Was sind die Gr&uuml;nde um dieses OS zu
          unterst&uuml;zen?</B></FONT><BR>

          Das das, was jetzt l&auml;uft, auch weiterhin l&auml;uft. Denn keiner will
          seine ganze Software mit auf den M&uuml;ll schmeissen.</P>

          <P><FONT color="#006000"><B>Welche M&ouml;glichkeiten vermisst Du am
          AmigaOS f&uuml;r die Entwicklung?</B></FONT><BR>

          Es sollte ein Entwicklungspaket f&uuml;r Programmierer dabei sein. Das ist
          das A und O f&uuml;r solche neuen Maschinen. Kaum ein Programmierer hat das
          Geld, um sich beim Kauf noch einen Compiler von 280 Euro dazuzulegen und
          zus&auml;tzlich seine Zeit daf&uuml;r zu opfern, eine Anwendung oder ein
          Game zu schreiben. Alle wollen Superprogramme f&uuml;r eine Supermaschine,
          nur wer schreibt solche PD? Das machts eben auch bei anderen Systemen wie
          Linux aus.</P>

          <P><FONT color="#006000"><B>Welche m&ouml;glichkeiten w&uuml;nschst Du Dir
          f&uuml;r die entwicklung am Amiga?</B></FONT><BR>

          - Plug and play wie bei dem Amiga.<BR>

          - Beispiel Highway. USB<BR>

          - Karte rein. USB dran. Loslegen!</P>

          <P><FONT color="#006000"><B>Welche Hard-/Software hast Du vor zu
          kaufen?</B></FONT><BR>

          AMIGAOne</P>

          <P><FONT color="#006000"><B>Glaubst Du an ein Comeback von
          Amiga?</B></FONT><BR>

          Ja aber nicht mehr in der alten Version, sondern als offenes System. Jeder
          der eine PPC Bord mit den amigaspezifischen Vorgaben bauen kann, wird Amiga
          verkaufen. Nur das Problem liegt - wie immer - bei Amiga selbst. Bis die in
          die Puschen kommen dauert es einfach zu lang. Und mit professioneller
          Promotion hapert es immernoch. Wie gewohnt - abwarten.</P>

          <P><FONT color="#006000"><B>Deine letzten Worte an die
          Leser?</B></FONT><BR>

          Kauft das, was ihr f&uuml;r den Amiga braucht, auch wenn es paar Euro mehr
          kostet, denn nur solang lebt der AMIGA.</P>
          
          <P align="center">-- &copy; Amiga Arena 10/2002 --</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

