<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Interview Nr 2</TITLE>
  </HEAD>

  <BODY background="nc_bg2.jpg" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <CENTER>
            <P><FONT color="#000080" size="7"><B>Amiga Arena Interview</B></FONT></P>

            <TABLE width="60%" cellpadding="0" cellspacing="0" summary="">
              <TR>
                <TD valign="top">Entwickler:</TD> 
                <TD><B>Torsten Giebl</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Software:</TD>   
                <TD>Turricane 4 Ever</TD>
              </TR>

              <TR>
                <TD valign="top">Homepage:</TD>   
                <TD>http://www.turricane.org</TD>
              </TR>

              <TR>
                <TD valign="top">Email:</TD>      
                <TD>wizard@turricane.org</TD>
              </TR>
            </TABLE>
          </CENTER>

          <P><FONT color="#006000"><B>Hallo Torsten, kannst Du bitte etwas &uuml;ber
          Dich und Deinem Amiga Werdegang erz&auml;hlen?</B></FONT><BR>

          Hmm, okay wo f&auml;ngt man da am Besten an ?!?! Meine erste Konsole war,
          wenn man das heute noch sagen darf, das Atari VCS 2600. Nicht die
          Edelausf&uuml;hrung mit Holz, sondern die sp&auml;tere aus schwarzem
          Plastik. Mein Bruder und ich hatten es zu Weihnachten bekommen. Wir waren
          hin und weg und konnten gar nicht mehr aufh&ouml;ren zu zocken. Auch wenn
          dies heute vielleicht l&auml;cherlich klingt, aber damals war es f&uuml;r
          uns beide die erste Art von digitaler Unterhaltung und wir waren fasziniert
          davon. Mein absolutes Lieblingsgame, auch heute auf dem Emu noch, ist
          Chopper Commander. Simpel, aber cool. Irgendwann hat dann leider jemand den
          Fernsehanschlu&szlig; mit dem Stromanschlu&szlig; verwechselt und dann war
          das Ding kaputt.</P>

          <P>Wir wollten mehr und zu dieser Zeit hatten die meisten die ich kannte,
          einen C64. Ein Bekannter empfahl uns einen A500 zu kaufen, der h&auml;tte
          mehr Speicher, bessere Grafik usw. Aber auch der erschien ihm dann nicht
          mehr gut genug und wir sollten uns einen A2000 kaufen. Der h&auml;tte OSA
          und w&auml;re erweiterbar. Traurig aber wahr es kam nie eine neue Karte
          oder eine Festplatte rein. Die Sachen waren damals f&uuml;r mich als
          Sch&uuml;ler einfach zu teuer. Eine Karte die aber beim Kauf des A2000
          schon eingebaut war - die Bridgeboard Karte (JANUS) mit einem 8088 drauf.
          Also lernte ich auch die PC Welt. Am Anfang hab ich immer noch versucht C64
          Games mit LOAD "*",8,1 zu laden ;-) Ab dann hab ich BASIC gelernt. Ohne
          Kurs nur mit den Beispielprogrammen auf der Extras Disk und dem AMIGA BASIC
          Handbuch. Meinem Bruder hab ich nachher dann den AMIGA &uuml;berlassen und
          ich bekam einen 486 DX4 / 100 + Nadeldrucker geschenkt.</P>

          <P>Dank JANUS Karte durfte ich mich dann schon DOS Xpert nennen und musste
          oft genug Kumpels bei ihren PC Problemen helfen. Daher stammt auch mein
          Pseudo -The WIZARD-. Den PC hab ich dann nach und nach aufger&uuml;stet.
          Heute vor etwa einem Jahr hab ich mir dann einen gebrauchten A1200 im Netz
          ersteigert. Und da war es wieder das AMIGA Feeling.</P>

          <P>Was die meisten zuerst schreiben, schreibe ich zuletzt, meine aktuelle
          Situation ;-)</P>

          <P>Mein Name ist Torsten Giebl, bin 24 Jahre alt und studiere im
          f&uuml;nften Semester Angewandte Informatik mit Anwendungsfach
          Elektrotechnik an der Universtit&auml;t Siegen. ( http://www.uni-siegen.de
          )</P>

          <P><FONT color="#006000"><B>Mit Eurem Projekt "Turrican 4 Ever" wollt Ihr
          einen inoffiziellen Nachfolger der beliebten "Turrican" Serie von Rainbow
          Arts/Factor 5 umsetzten, wie und wann seid Ihr auf die Idee gekommen, solch
          ein Projekt zu starten?</B></FONT><BR>

          Es hei&szlig;t Turricane 4 Ever. Soviel Zeit muss sein :-) Wieso das "e" ?
          Dazu komme ich sp&auml;ter noch. Bei mir kam diese Idee zum ersten Mal auf
          als ich mich an meinen Computer setzte und mit FreePascal und Graphix eine
          Art Gameloop codete. Es war einfach ein Experiment was f&uuml;r Routinen
          und Abfragen n&ouml;tig waren, um mit der Turrican Figur rumzulaufen, zu
          kreiseln oder zu springen. Alles war auf meinem Mist gewachsen. Zu dieser
          Zeit hatte ich von Gameloop oder derartigen Dingen &uuml;berhaupt noch
          nichts geh&ouml;rt. Ich dachte einfach das m&uuml;sste so sein und dann hab
          ich mich halt hingesetzt und es funktionierte.</P>

          <P>Als ich Internet hatte, kam ich mit Martin Konrad ins Gespr&auml;ch und
          er wollte auch einen Turrican Nachfolger machen. Das Problem Numero Uno
          schon damals, wir hatten keinen Grafiker. Glaube es war meine Idee, dass
          wir doch die Grafiken aus MegaTurrican nehmen k&ouml;nnten. Bei Konsolen
          ist es meistens durch die Spriteengine relativ einfach m&ouml;glich Sprites
          zu rippen. Martin schrieb, dass er auf dem Gamegear fit w&auml;re und dort
          schon so einen Spriteripper geschrieben h&auml;tte. Er setzte sich hin und
          tat dies auch f&uuml;r den Megadrive. Er rippte die Anims vom Turrican und
          die Tiles der ersten Welt. Voila wir hatten die Grafiken, blieb nur noch
          wie wir an die Musik kommen sollten.</P>

          <P>Dann fand ich im Netz die Original AMIGA Musiken von T3. Und auch den
          Linux-Source zum Abspielen der TFMX Modules coded by Marx Marvelous und Per
          Linden.</P>

          <P>Dies war auch die urspr&uuml;ngliche Idee von "Turrican Forever". Das
          Beste vom AMIGA und MEGADRIVE kombinieren. Die besseren, farbigeren
          Grafiken vom Megadrive und die bessere Musik vom AMIGA. Das Spiel sollte so
          hei&szlig;en wie Martin Konrads Seite.</P>

          <P>Kurze Zeit sp&auml;ter lernten Domy und ich im Netz Alexander Scholz
          (Albolone) kennen. Er ist unser Hauptgrafiker und f&uuml;r die tollen
          Artworks verantwortlich. Als er uns dann seinen gepixelten Turrican
          zukommen lie&szlig;, waren wir hin und weg und wollten unbedingt ein neues
          Game machen.</P>

          <P>Wieso hei&szlig;t das Spiel jetzt Turricane 4 Ever oder Turricane
          Forever ?</P>

          <P>1. Um m&ouml;glichen Copyright Problemen aus dem Weg zu gehen.<BR>

          2. Die Domain http://www.turricane.org war noch frei, die ganzen
          www.turrican.xyx, waren schon weg.<BR>

          3. Wir wollten uns von dem Namen der Seite von Martin Konrad
          unterscheiden.</P>

          <P><FONT color="#006000"><B>Wann und auf welchem System hast Du das
          erstemal Turrican gesehen/gespielt?</B></FONT><BR>

          Wann kann ich leider nicht mehr sagen. Es war Turrican 1 auf dem AMIGA
          2000. Das war die Version von der AMIGA FUN Zeitung f&uuml;r 20,-- DM
          :-)</P>

          <P><FONT color="#006000"><B>Was ist f&uuml;r Dich das besondere an
          Turrican?</B></FONT><BR>

          Eigentlich das Ganze Spiel. Viele Turricanlevels sind riesengro&szlig;, es
          gibt &uuml;berall Extraboni und mir gef&auml;llt einfach die Idee mit einem
          Lonewarrior rumzulaufen. Das Leveldesign ist klasse und die Musiken von
          Chris "Turrican" H&uuml;lsbeck sind einfach unerreicht.</P>

          <P><FONT color="#006000"><B>Welches ist f&uuml;r Dich der beste Turrican
          Teil und auf welchem System?</B></FONT><BR>

          Wenn ich mich festlegen soll auf mein absolutes Lieblingsturrican, dann ist
          es wohl Turrican 2 auf dem AMIGA. Bessere Grafik als T1 und besserer Sound.
          Wohl der H&ouml;hepunkt der Turrican Triologie. Aber eigentlich mag ich
          alle Turricans auf allen Systemen.</P>

          <P><FONT color="#006000"><B>Jeder der damals auf seinem Amiga 500 Turrican
          zum erstenmal gesehen hat, d&uuml;rfte wohl genau so gestaunt haben wie ich
          damals, der Sound, die Grafik einfach alles zog einen sofort in den Bann,
          glaubst Du das die Spieler Generation von heute &uuml;berhaupt noch
          Interesse an Spiele wie Turrican haben?</B></FONT><BR>

          Das glaube ich fest. Ich hoffe auch, dass Turricane 4 Ever ihnen das wieder
          ein bisschen n&auml;her bringen wird :-)</P>

          <P><FONT color="#006000"><B>Positiv finde ich, dass Ihr Turrican 4Ever in
          2D halten wollt und nicht wie es heute leider &uuml;blich ist alles in 3D,
          erschwert dies aber nicht auch die Umsetzung?</B></FONT><BR>

          Unserer Meinung nach w&auml;re ein 3D Turrican kein Turrican mehr. Wir
          wollten gerade ein Oldskool Game machen. Und die Entscheidung 2D - 3D
          stellte sich auch gar nicht, da ich erst gerade anfange 3D Coding zu
          lernen.</P>

          <P><FONT color="#006000"><B>Ihr seid auf der Suche nach Pixelartisten
          f&uuml;r die Amiga Plattform, habt Ihr schon Interressenten
          gefunden?</B></FONT><BR>

          Leider noch keinen einzigen :-(</P>

          <P><FONT color="#006000"><B>Was denkst Du erschwert die Suche so, gibt es
          heute keine wirklichen Pixelk&uuml;nstler mehr?</B></FONT><BR>

          Das trifft genau den Punkt. Heute k&ouml;nnen mehr Leute Meshes
          zusammenbasteln, als Pixeln. Mich wunderts auch nicht, auch ich k&ouml;nnte
          mich eher mit einem Modeller hinsetzen und ein paar einfache Modelle
          fertigen, als auch nur eine Grafik zu pixeln.</P>

          <P>Vielleicht liegts auch ein bisschen daran, dass die Leute vielleicht
          denken, wer wei&szlig; ob das kein Lamerprojekt ist. Auf diese Frage kann
          ich nur antworten, selbst wenn nachher die fertigen Grafiken zur
          Verf&uuml;gung st&auml;nden und es kein Spiel dazu g&auml;be, w&uuml;rden
          sich andere Leute finden die sie benutzen w&uuml;rden.</P>

          <P><FONT color="#006000"><B>Die Erfolgsgeschichte von Turrican begann vor
          12 Jahren, welche Systeme werden denn heute oder in Zukunft
          unterst&uuml;zt?</B></FONT><BR>

          In der Hinsicht kann man sich heute wie im Paradies f&uuml;hlen. Da die
          Rechner immer schneller wurden/werden war es irgendwann egal, ob man ein
          Game in z.B. C/C++ codete oder in reinem ASM. Auf dem A500 z.B. hatte man
          keine Wahl sollte das Spiel schnell sein, war Assembler die einzige Wahl.
          Heute kann ich hingehen und die Main Gameloop, die Steuerroutinen usw. in
          C/C++ zu coden und falls es wirklich sein muss die zeitkritischen Routinen
          in Assembler. Die Portierung eines AMIGA Spieles war damals eine
          aufw&auml;ndige Sache, der gesamte Quellcode musste f&uuml;r eine andere
          Plattform neu geschrieben werden. Dies war teuer und zeitintensiv. Es sei
          denn die Zielplattform hatte auch einen 68xxx Prozessor.</P>

          <P>Heute gehe ich hin, schreibe ein paar Funktionen oder Klassen die z.B.
          Sprites auf den Bildschirm blitten oder die Tastatur abfragen und wenn ich
          dann das Game auf ein anderes System portieren will, ersetze ich einfach
          diese Funktionen / Klassen, compiliere das Ganze neu und voila es
          l&auml;uft. Okay, ganz so reibungslos klappt es meistens nicht, es ist
          immer noch Bugfixing n&ouml;tig. Aber man muss seinen Source schon sehr
          strukturiert und sehr nach Standard coden, weil manche Bugs auf strikteren
          OSes wie LINUX doch schneller einen Fehler hervorrufen als z.B. auf
          Windows.</P>

          <P><FONT color="#006000"><B>Wie wird im einzelnen die Umsetzung f&uuml;r
          den Amiga ablaufen?</B></FONT><BR>

          Das kommt darauf auf an, f&uuml;r was f&uuml;r einen AMIGA.</P>

          <P>Wir haben zwei Systeme im Blick. Einmal den Standard A1200 und den
          Highend PPC Amiga.</P>

          <P>F&uuml;r den Highend PPC Amiga d&uuml;rfte das kein Thema sein. Dort
          gibts auch SDL und er ist schnell genug. Will hei&szlig;en nur ne
          Neucompilierung ist n&ouml;tig und fertig.</P>

          <P>Wenn T4E irgendwann fertig ist, vielleicht findet sich ja auch noch ein
          braver Coder der es dann f&uuml;r den A1200 codet. Ist klar, dass dann
          Abstriche bei Farbenvielfalt usw. gemacht werden m&uuml;ssen.</P>

          <P>Wir wollen eigentlich auf unserer Seite nicht um Spenden bitten, aber
          falls wirklich jemand zuviel Geld &uuml;brig hat, k&ouml;nnte er uns
          AMITHLON zukommen lassen. Wie geschrieben, habe ich im Moment nur einen
          A1200 mit 4 MB Speicher und einer Festplatte zu Hause. Also zu langsam und
          zuwenig Speicher f&uuml;r SDL auf dem AMIGA.</P>

          <P><FONT color="#006000"><B>Welche Systemanforderungen braucht der Amiga
          f&uuml;r Turrican 4Ever</B></FONT><BR>

          ? Da wir erst am Anfang stehen, kann ich das jetzt noch nicht sagen, noch
          nicht einmal f&uuml;r den PC. Ich bin aber Minimalist, nicht beim Gameplay,
          nur bei den Systemanforderungen.</P>

          <P><FONT color="#006000"><B>Auf welchem System gibt es schon die meisten
          Fortschritte?</B></FONT><BR>

          Da wir SDL benutzen ist er auf allen gleich.</P>

          <P><FONT color="#006000"><B>Habt Ihr Kontakt aufgenommen zu den damaligen
          Entwicklern?</B></FONT><BR>

          Wir haben Peter Thierolf, den Coder von Turrican 3 AMIGA, an seinem Wohnort
          besucht. Und uns Tipps vom professionellen Entwickler geben lassen. Er
          arbeitet auch jetzt noch bei NEON.</P>

          <P><FONT color="#006000"><B>Besteht seitens der damaligen Entwicklern kein
          Interesse Turrican 4Ever offiziell umsetzten zu lassen von
          Euch?</B></FONT><BR>

          Peter Thierolf hilft uns bei Fragen wo er kann, leider kann er, aus
          Zeitmangel, keinen Code beitragen. Er arbeitet ja Fulltime als
          Programmierer bei NEON. Factor 5 hatte ich damals &ouml;fters wegen
          Erlaubnis zum Umsetzen von T3 auf den PC gefragt und bekam nie eine Antwort
          zur&uuml;ck.</P>

          <P><FONT color="#006000"><B>Turrican 4Ever soll Freeware werden angesichts
          der Arbeit die Euch erwartet ist dies nicht auch ein Grund, dass die
          Entwicklung so lange schon andauert, sprich geht da nicht die Motivation
          verloren? Ich denke man muss schon Turrican Freak sein, damit dieses
          Projekt auch wirklich eine Chance hat umgesetzt zu werden?</B></FONT><BR>

          Klar knickt meistens die Motivation irgendwann w&auml;hrend der Entwicklung
          ein, aber dann spielt man ein paar Levels Turrican und ist wieder hellauf
          begeistert. Eine &Uuml;berlebenschance hat das Projekt aber nur, wenn wir
          noch mehr Manpower bekommen, vor allem Pixelartisten. Die brauchen wir im
          Moment so dringend wie die Luft zum Atmen. Und uns geht im Moment die Luft
          aus. Will hei&szlig;en, meldet euch mit Arbeitsprobe unter
          wizard@turricane.org oder unter albolone@turricane.org !!!</P>

          <P>Die Entwicklung dauert auch deshalb lange, weil wir alle noch ein Real
          Life haben. Wasn das :-) Ich bin z.B. im Moment am Studieren. Andere wie
          z.B. Alex arbeiten Fulltime und betreuen ehrenamtlich nebenbei noch mehrere
          Magazine wie AmigaPlus usw.</P>

          <P><FONT color="#006000"><B>Wie siehst Du wirklich die realle Chance, dass
          Ihr Turrican 4Ever fertigstellen k&ouml;nnt, bez. das es wirklich eine
          Amiga Version zu sehen gibt?</B></FONT><BR>

          Das kommt ganz darauf an, finden wir noch Grafiker, gut, sonst eher
          d&uuml;ster. Wenn das Game fertig ist, wird es auf jeden Fall eine AMIGA
          PPC Version geben und falls sich ein AMIGA Coder findet, auch noch eine
          A1200 Version.</P>

          <P><FONT color="#006000"><B>Deine letzten Worte an die
          Leser?</B></FONT><BR>

          Erstmal danke f&uuml;r dieses Interview und AN ALLE PIXELMEISTER DA
          DRAU&szlig;EN MELDET EUCH UNTER wizard@turricane.org ODER UNTER
          albolone@turricane.org MIT ARBEITSPROBE. -! LET THE AMIGA NEVER DIE !-</P>

          <P align="center">-- &copy; Amiga Arena 11/2002 --</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

