<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Interview Nr 3</TITLE>
  </HEAD>

  <BODY background="nc_bg2.jpg" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <CENTER>
            <P><FONT color="#000080" size="7"><B>Amiga Arena Interview</B></FONT></P>

            <TABLE width="60%" cellpadding="0" cellspacing="0" summary="">
              <TR>
                <TD valign="top">Entwickler:</TD>   
                <TD><B>Andreas Falkenhahn</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Software:</TD>     
                <TD>Hollywood</TD>
              </TR>

              <TR>
                <TD valign="top">Homepage:</TD>     
                <TD>www.airsoftsoftwair.de/</TD>
              </TR>

              <TR>
                <TD valign="top">Email:</TD>        
                <TD>-</TD>
              </TR>
            </TABLE>
          </CENTER>

          <P><FONT color="#006000"><B>Hallo Andreas, kannst Du bitte etwas &uuml;ber
          Dich und Deinem Amiga Werdegang erz&auml;hlen?</B></FONT><BR>

          Ich bin eigentlich ein Amiga-User der letzten Stunde; soll hei&szlig;en:
          Meinen A500 habe ich erst 1993 bekommen als eigentlich Commodore schon
          erledigt war. Ich hatte zwar davor schon t&auml;glichen Umgang mit Amigas
          (bei Freunden), aber meinen eigenen habe ich erst 1993 geholt und aus
          finanziellen Gr&uuml;nden war damals auch nur ein A500 drin, der mich
          immerhin noch 570 DM gekostet hat. Am Anfang wurde nat&uuml;rlich nur
          gespielt, doch dann gingen die Spiele aus und ich habe angefangen zu
          programmieren. Das ging dann &uuml;ber Amiga Basic, AMOS, Blitz Basic,
          Assembler, AmigaE bis hinauf zu C.</P>

          <P><FONT color="#006000"><B>Vielen bist Du bekannt durch Deine
          Entwicklungen von Programmen wie das "CD32 Games Install Kit" oder
          "Rainboot" auf dem Amiga, mit "Akiko" dem CD 32 Emulator f&uuml;r Windows
          sah es in der Vergangenheit so aus als h&auml;ttest Du Deine Amiga
          Entwicklungen eingestellt. Werden diese Programme noch weiterhin gepflegt
          oder weiter entwickelt?</B></FONT><BR>

          Das mag so ausgesehen haben, aber ich habe sicherlich keines meiner
          gr&ouml;&szlig;eren Programme eingestellt. Auch wenn viele Programme in
          einem recht finalen Zustand sind, gibt es doch immer wieder Sachen, die
          noch ge&auml;ndert oder eingebaut werden m&uuml;ssen. Die Sache mit
          Hollywood habe ich extra streng geheim gehalten, da ich die Amiga-Community
          nicht mit gro&szlig;en Ank&uuml;ndigungen nerven wollte. Es wurde &uuml;ber
          die Jahre so viel angek&uuml;ndigt und nur ein Bruchteil davon ist
          &uuml;berhaupt erschienen. Ich habe mir mit Hollywood viel Zeit gelassen,
          um es stabil und systemfreundlich hinzubekommen und dann habe ich halt die
          Bombe platzen lassen ;-) Das hat doch auch mal was...so aus heiterem Himmel
          ein neues Hammer-Programm anzuk&uuml;ndigen :)</P>

          <P><FONT color="#006000"><B>Dass Du weiterhin den Amiga unterst&uuml;tzt
          beweist Dein neues Programm "Hollywood", das den Amiga wieder zur&uuml;ck
          an die Multimedia Spitze bringen soll. Kannst Du uns einige
          Anwendungsbeispiele nennen, wie und wozu man "Hollywood" verwenden
          kann?</B></FONT><BR>

          Hollywood ist extrem flexibel, da es durch eine Skriptsprache gesteuert
          wird. Dadurch sind die Anwendungsgebiete quasi unbegrenzt. Man kann eine
          einfache Pr&auml;sentation damit erstellen, aber auch ein vollwertiges
          Anwendungsprogramm.</P>

          <P><FONT color="#006000"><B>Braucht man bestimmte Vorkenntnisse um eigene
          Pr&auml;sentationen erstellen zu k&ouml;nnen oder sogar Programme damit zu
          entwickeln?</B></FONT><BR>

          Generell braucht man keine Vorkenntnisse, da alles in der Dokumentation
          ausf&uuml;hrlich erkl&auml;rt wird. H&ouml;chstens f&uuml;r komplexe
          Programme k&ouml;nnen Programmierkenntnisse von Nutzem sein. Wer aber
          haupts&auml;chlich Pr&auml;sentationen erstellen will, kommt ohne
          Vorkenntnisse gut zurecht.</P>

          <P><FONT color="#006000"><B>Wie bedienerfreundlich ist "Hollywood"? Um
          erste Ergebnisse zu sehen ist es notwendig sich duch die komplette
          Anleitung zu lesen oder ist das Programm so aufgebaut, dass vieles selbst
          erkl&auml;rend ist?</B></FONT><BR>

          Es gibt in der Dokumentation eine kleine Einf&uuml;hrung. Wenn man die
          gelesen hat, kann es eigentlich schon losgehen. Man kann ja zwischendurch
          immer die Referenz der Dokumentation bereit halten, falls eine Frage
          auftaucht. Diese gibt garantiert immer Auskunft und man findet sich schnell
          in dem riesigen Dokument zurecht.</P>

          <P><FONT color="#006000"><B>Gibt es schon Beispiel Programme die mit
          "Hollywood" erstellt wurden, wenn ja wann kann man sich ein "Bild"
          &uuml;ber die M&ouml;glichkeiten von "Hollywood" machen?</B></FONT><BR>

          Auf der Hollywood CD gibt es &uuml;ber 20 Beispiel-Programme, die
          eigentlich alle Funktionen von Hollywood demonstrieren. Diese Beispiele
          reichen von Slideshows, Pr&auml;sentationen, Spielen bis hin zu
          Programmen.</P>

          <P><FONT color="#006000"><B>Du ziehst mit "Hollywood" einen direkten
          Vergleich zu dem wohl bekanntesten Multimedia Programm auf dem Amiga
          "Scala". Worin unterscheidet sich oder hebt sich "Hollywood" von diesem
          Klassiker ab?</B></FONT><BR>

          Hollywood ist ein modernes Multimedia-Autorensystem. Im Gegensatz zu Scala
          l&auml;uft Hollywood komplett im 24bit Modus und vor allem Betriebssystem
          kompatibel. Daher ist es kein Problem, Hollywood z.B. f&uuml;r MorphOS,
          AmigaOS4 oder auch AROS zu kompilieren solange diese Betriebssysteme
          API-kompatibel zum AmigaOS3.x sind. Scala dagegen ist voll auf die
          Customchips des Amigas programmiert, was heutzutage weder
          zeitgem&auml;&szlig; noch sinnvoll ist. Hollywood l&auml;uft im Fenster auf
          der Workbench, auf einem eigenen Bildschirm und immer systemkompatibel.
          Au&szlig;erdem ist Hollywood vom Funktionsumfang um Welten m&auml;chtiger
          als Scala und kann durch Plugins noch extrem erweitert werden.</P>

          <P><FONT color="#006000"><B>Die feature Liste ist beeindruckend und
          f&uuml;r alle Leser die diese noch nicht kennen. Welche w&uuml;rdest Du
          besonders hervor heben?</B></FONT><BR>

          &Uuml;ber 50 &Uuml;berblendeffekte (darunter auch anspruchsvolle Crossfades
          &amp; Blends), transparente Workbenchfenster, Unterst&uuml;tzung f&uuml;r
          True Type, Color und Bitmap Schriften, Datatypes-Unterst&uuml;tzung und
          viel viel mehr, um es hier zu nennen. Die Feature Liste auf meiner Homepage
          gibt da deutlich mehr Aufschluss, was Hollywood alles kann.</P>

          <P><FONT color="#006000"><B>Kommen wir zur Entwicklungsgeschichte von
          "Hollywood". Wann kam Dir der Gedanke ein Programm zu entwickeln, das dem
          Altmeister "Scala" gleichkommt?</B></FONT><BR>

          Der kam mir schon fr&uuml;h. W&auml;hrend der Rainboot-Entwicklung dachte
          ich mir immer, dass es sch&ouml;n w&auml;re, mal ein modernes Scala zu
          haben. Irgendwann habe ich dann angefangen gezielt in diese Richtung zu
          entwickeln und die Features wurden immer besser und vielf&auml;ltiger. Dann
          habe ich das Ganze in eine Skriptsprache gepackt und Hollywood war
          geboren.</P>

          <P><FONT color="#006000"><B>Ist der Name "Hollywood" nicht rechtlich
          gesch&uuml;tzt oder musst Du damit rechnen, dass Du das Programm nicht
          unter diesen Namen vertreiben darfst?</B></FONT><BR>

          Nach meinen Recherchen ist der Name Hollywood f&uuml;r sich nicht
          gesch&uuml;tzt. Es handelt sich dabei ja auch lediglich um einen Stadtteil
          von Los Angeles.</P>

          <P><FONT color="#006000"><B>W&auml;re ein andere Name nicht vorteilhafter
          gewesen</B></FONT><BR>

          ? Ich denke Hollywood trifft den Kern des Programmes sehr gut. Es geht hier
          schlie&szlig;lich um "Show". Ist sicherlich besser als irgendetwas mit
          einem"Ami"-Pr&auml;fix.</P>

          <P><FONT color="#006000"><B>Wie lange hat die Entwicklung bisher gedauert
          und wie schafft man es, solch ein umfangreiches Programm alleine zu
          entwickeln?</B></FONT><BR>

          Grundbausteine von Hollywood gehen auf Rainboot zur&uuml;ck, welches ich
          seit 1998 entwickle. Die Programmierung hin zum Multimediaautorensystem hat
          ungef&auml;hr 9 Monate in Anspruch genommen, aber die Vorarbeit und die
          Kenntnisse, die man daf&uuml;r erstmal braucht, sind nat&uuml;rlich
          wesentlich zeitaufwendiger gewesen.</P>

          <P><FONT color="#006000"><B>Welche Software verwendest Du zum
          Entwickeln?</B></FONT><BR>

          Erste Beta-Versionen von Hollywood waren noch in AmigaE, aber mittlerweile
          bin ich v&ouml;llig bei C gelandet, da die Portabilit&auml;t f&uuml;r mich
          sehr wichtig ist.</P>

          <P><FONT color="#006000"><B>F&uuml;r welches Betriebssystem entwickelst Du
          in Zukunft?</B></FONT><BR> Ich lege mich da ungern fest, da ich f&uuml;r
          fast jedes Betriebssystem schon das eine oder andere Programm geschrieben
          habe. Den Amiga werde ich auf jeden Fall so schnell nicht verlassen. Wie
          auch, man kommt ja einfach nicht davon los :)</P>

          <P><FONT color="#006000"><B>Was sind die Gr&uuml;nde um das AmigaOS zu
          unterst&uuml;zen?</B></FONT><BR>

          Bei Hollywood muss ich dazu sagen, dass ich es aus reiner Neugier begonnen
          habe. Mich hat einfach brennend interessiert, wie es wohl auss&auml;he,
          wenn man im Workbench-Fenster grafische Pr&auml;sentationen und Programme
          laufen lassen k&ouml;nnte, die einfach erstellt werden k&ouml;nnen, wie
          z.B. mit Flash unter Windows. Au&szlig;erdem war ich neugierig, wie
          Crossfades und alle m&ouml;glichen &Uuml;berblendeffekte im
          Workbenchfenster oder auf Intuition Screens aussehen w&uuml;rden. Diese
          Neugierde hat mich ehrgeizig gemacht und ich habe die Sache durchgezogen
          und ich muss sagen, dass ich sehr zufrieden bin mit dem Programm.</P>

          <P><FONT color="#006000"><B>Welche M&ouml;glichkeiten vermisst Du am
          AmigaOS f&uuml;r die Entwicklung?</B></FONT><BR>

          Eine modernere API w&auml;re sch&ouml;n, auch wenn ich daran nicht so recht
          glaube. Gerade jetzt, wo verschiedene Wege eingeschlagen werden (AmigaOS4,
          MorphOS ...). Es ist vieles noch sehr sehr kompliziert und umst&auml;ndlich
          am Amiga (besonders in Sachen Multimedia). Aber was soll's, man kommt schon
          irgendwie zurecht :-)</P>

          <P><FONT color="#006000"><B>Welche M&ouml;glichkeiten w&uuml;nschst Du Dir
          f&uuml;r die Entwicklung am Amiga?</B></FONT><BR>

          siehe oben ;-)</P>

          <P><FONT color="#006000"><B>"Hollywood" wird als "Shareware" vertrieben.
          Was ist der Grund es nicht Kommerziell vertreiben zu lasen?</B></FONT><BR>

          Mir ist es wichtig, dass jede CD &uuml;ber mich den K&auml;ufer erreicht.
          Somit kann ich die CD-ROM n&auml;mlich auf den K&auml;ufer personalisieren
          und so Raubkopien verhindern.</P>

          <P><FONT color="#006000"><B>Glaubst Du, dass Du mit "Hollywood" den Amiga
          wieder einwenig als Multimedia und Pr&auml;sentations Computer zur&uuml;ck
          bringen kannst?</B></FONT><BR>

          Auf jeden Fall.</P>

          <P><FONT color="#006000"><B>W&auml;re es nicht von Vorteil gewesen
          "Hollywood" zeitgleich auch f&uuml;r AmigaOS 4.x zu ver&ouml;ffentlichen
          oder als Bundle f&uuml;r den AmigaOne/AmigaOS 4.x ?</B></FONT><BR>

          Dazu m&uuml;sste AmigaOS 4.x erstmal erscheinen ;-) Wenn es da ist, sollte
          eine Hollywood-Portierung keine gro&szlig;e Arbeit sein.</P>

          <P><FONT color="#006000"><B>Sollte "Hollywood" wirklich solch ein
          m&auml;chtiges Programm sein, m&uuml;sste es doch Interesse seitens Amiga
          Inc. oder eventuell Thendic sein dies f&uuml;r Ihre Betriebssysteme
          umzusetzten oder?</B></FONT><BR>

          Da will ich mal lieber nicht zu viel verraten, au&szlig;er dass beide
          Seiten schon ihr Interesse bekundet haben ;-)</P>

          <P><FONT color="#006000"><B>Hast Du im Vorfeld versucht einmal Kontakt mit
          den jeweiligen Firmen aufzunehmen, wenn nicht, was sind die
          Gr&uuml;nde?</B></FONT><BR>

          Ich hatte vorher keinen Kontakt mit irgendwelchen Firmen aufgenommen, da
          ich nicht so richtig an den Erfolg von Hollywood glauben wollte. Ich war
          mir zwar sicher, dass ich ein tolles Programm geschaffen hatte, aber ich
          habe noch daran gezweifelt, ob es gen&uuml;gend Leute gibt, die solch ein
          professionelles Programm gebrauchen k&ouml;nnen. Ich h&auml;tte eher
          gedacht, dass jeder der in Sachen Pr&auml;sentation Power braucht schon
          l&auml;ngst einen PC hat. Da wurde ich aber eines besseren belehrt!</P>

          <P><FONT color="#006000"><B>Glaubst Du, dass es noch ausreichend Amiga
          Anwender gibt die Interesse an solch einem Programm wie "Hollywood" haben,
          zumal ja bekannt ist, dass der Amiga Markt wirtschaftlich am Ende
          ist?</B></FONT><BR>

          H&auml;ttest du mich vor das vor einigen Wochen gefragt, w&auml;re ich hier
          auch ins Zweifeln gekommen, aber jetzt sehe ich das anders. Das Interesse
          an Hollywood hat mich positiv &uuml;berrascht und der Amiga-Markt scheint
          mir l&auml;ngst nicht so tot wie er von manchen geredet wird.</P>

          <P><FONT color="#006000"><B>Eine Demoversion wird es zur Zeit nicht geben.
          Glaubst Du, dass Screenshots alleine ausreichen, um ein Produkt wie
          "Hollywood" zu verkaufen? Wie soll man sich ein Bild &uuml;ber die
          Bedienung machen?</B></FONT><BR>

          Ich finde die Screenshots schon ziemlich aussagekr&auml;ftig, denn man
          sieht, was man kriegt. Ansonsten kann man ja auch Testberichte lesen.
          M&ouml;glicherweise ver&ouml;ffentliche ich in Zukunft auch noch ein
          kleines Video von Hollywood in Action.</P>

          <P><FONT color="#006000"><B>Vor Raupkopien wirst Du Dich nicht sch&uuml;tz
          en k&ouml;nnen, sollte man nicht lieber auf das Vertrauen der Amiga User
          bauen und eine eingeschr&auml;nkte Demo ver&ouml;ffentlchen anstatt das
          Programm aufgrund mangelnder M&ouml;glichkeiten zum Testen nicht zum Kauf
          &uuml;berzeugen kann?</B></FONT><BR>

          Ich denke es ist im Interesse der ehrlichen Amiga-User, wenn ich versuche,
          Raubkopien zu unterbinden und durch die Personalisierung von Hollywood wird
          es Raubkopierern schon mal richtig schwer gemacht. Ich glaube nicht, dass
          es in naher Zukunft Raubkopien von Hollywood geben wird. Eine
          eingeschr&auml;nkte Demo mag ich auch nicht ver&ouml;ffentlichen, da ich
          dann ja die Features beschneiden m&uuml;sste.</P>

          <P><FONT color="#006000"><B>Welche Hard-/Software hast Du vor zu
          kaufen?</B></FONT><BR>

          AmigaOS 4.0 und MorphOS stehen bei mir als n&auml;chstes an, wenn sie denn
          auf meinem A1200 mit Blizzard PPC laufen.</P>

          <P><FONT color="#006000"><B>Glaubst Du an ein Comeback von
          Amiga?</B></FONT><BR>

          Keine Ahnung. Wer will schon wissen was die Zukunft bringt? Der Amiga lebt
          solange seine User leben.</P>

          <P><FONT color="#006000"><B>Deine letzten Worte an die
          Leser?</B></FONT><BR>

          Kopf hoch, immerhin haben wir bald PPC-native Betriebssysteme, die
          API-kompatibel zum AmigaOS 3.x sind. Das gibt dann mal richtig Speed! Also,
          ich freu mich drauf. Ganz ehrlich. Und wenn ihr noch ein Weihnachtsgeschenk
          braucht, ich kenn da so ein Multimedia-Autorensystem namens Hollywood....
          ;-)</P>

          <P align="center">-- &copy; Amiga Arena 11/2002 --</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

