<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>J&uuml;rgen an Wolf</TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>

  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="98%" align="center" border="0" cellspacing="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center">J&uuml;rgen an Wolf</H1>
          <BR>

          <H2>Hallo Wolf,</H2>

          <P>erst einmal Herzlichen Gl&uuml;ckwunsch zur gelungenen Ausgabe  104  der
          NoCover.  Und  dieser  Gl&uuml;ckwunsch  gilt  nicht nur dir, Wolf, sondern
          allen Beteiligten.<BR>
          So umfangreich kenne ich die NoCover gar nicht und es hat Spa&szlig;
          gemacht abends den Amiga auszumachen mit dem Wissen, morgen gibt es noch
          viel zu Lesen in der NC 104.<BR>
          Ich hoffe, das waren jetzt nicht alles "Notabw&uuml;rfe" der
          Artikelschreiber, in der Hoffnung, das Mag damit eine Nummer weiter retten
          zuk&ouml;nnen. (Nicht b&ouml;se gemeint.)</P>
          <HR width="80%" size="4" noshade>

          <P>Zu deinen &Auml;nderungen an der NoCover:</P>
           
          <DL>
            <DT><FONT color="#FF9933">- Schaltfl&auml;chen, die leer sind,</FONT></DT>

            <DD><FONT color="#FF9933">sind hellgrau und nicht anklickbar.</FONT></DD>

            <DT><FONT color="#FF9933">- Schaltfl&auml;chen mit Inhalt, aber ohne
            &Auml;nderung zum Vormonat,</FONT></DT>

            <DD><FONT color="#FF9933">sind dunkelgau und anklickbar.</FONT></DD>

            <DT><FONT color="#FF9933">- Schaltfl&auml;chen, die neu oder reaktiviert sind,</FONT></DT>

            <DD><FONT color="#FF9933">sind gr&uuml;n und anklickbar.</FONT></DD>
          </DL>

          <P>Diese &Auml;nderungen halte ich f&uuml;r sehr sinnvoll, denn ich hatte
          mich schon des&ouml;fteren dar&uuml;ber ge&auml;rgert, dass beim Anklicken
          einer Rubrik nur " <B>Name --&gt;</B> " erschien und ich zur Sicherheit
          erst einmal nachsah, ob es nicht doch einen Artikel zu jenem Thema gab.</P>

          <P>Leere Rubriken bitte nicht anzeigen und das Storygame, (auch wenn es
          eine Geschichte ist), in <B>Games</B> belassen, denn das sagt ja auch der
          Name.</P>

          <P>Die neue Rubrik <B>Autoren</B> finde ich gut, kommt sie doch einem
          Inhaltsverzeichnis gleich.</P>

          <P>Zum Thema <B>neues / moderneres Outfit der NoCover</B> : Das Outfit
          (bl&ouml;des Wort) der NC ist modern und was wichtiger ist: es ist jedes
          mal <B>Neu</B>.<BR>
          Die Basis des Magazin`s ist immer gleich, von jedem, der die NoCover kennt,
          wieder erkennbar.<BR>

          Das "Neue" aber sind die Autoren, die ihren Artikeln und sich eine
          wiedererkennbarkeit verschaffen und somit der NoCover f&uuml;r ein immer
          anderes und nicht langweiliges Inneres verschaffen.</P>

          <P>Auch finde ich es gut, das in der NC so viele unterschiedliche Themen
          zu finden sind.<BR>
          Warum sollten wir mit der NC in Konkurenz mit der <B>Amiga aktuell</B>
          treten. Dadurch entstehen auch nicht mehr Neuigkeiten in der
          Amiga-Landschaft. Wer soll sich denn all die Workshops und News rund um den
          Amiga noch aus den Finger saugen.<BR>
          F&uuml;r reine Amiga-Themen ist die <B>Amiga aktuell</B> besten geeignet.<BR>
          Das ist Amiga pur und konzentriert.</P>

          <P>In der NoCover finden wir Amigaabh&auml;ngigen das Leben rund um und mit
          dem Amiga.<BR>
          Und das finde ich gut so. Zwei unterschiedliche Magazine f&uuml;r uns
          Amiga-Begeisterte.</P>

          <P>In diesem Sinne hoffe ich weiter auf so eine rege
          Beteitigung und viele weitere <FONT size="+2"><B><FONT
          color="#FF3333">b</FONT><FONT color=
          "#3333CC">u</FONT><FONT color="#009933">n</FONT> <FONT
          color="#66CCFF">t</FONT><FONT color=
          "#FFCC00">e</FONT></B></FONT> NoCover-Ausgaben.</P>
          <HR>
          <BR>
           

          <CENTER>
            <TABLE border>
              <TR>
                <TH bgcolor="#CCCCCC" align="left">
                  <CENTER>
                    J&uuml;rgen Sperling
                  </CENTER>
                </TH>
              </TR>

              <TR>
                <TH bgcolor="#FFFFCC" align="left">
                sperlingbergen@freenet.de</TH>
              </TR>
            </TABLE>
          </CENTER>
          <HR size="3" color="red">

          <P>Hier gleich meine Antwort:<BR>
          Es ist beinahe schon etwas ungewohnt gelobt zu werden. Aber auch ich bin
          nur ein Mensch und freue mich nat&uuml;rlich sehr dar&uuml;ber.</P>

          <P>Eines was ich leider nicht ganz nachvollziehen kann, ist deine Aussage,
          dass du Schaltfl&auml;chen
          <BR>
          &nbsp; &nbsp; <FONT color="#800000"><B>Name &nbsp; --&gt;</B></FONT>
          <BR>
          zu sehen bekommst. Das sollte nicht der Fall sein. Denn nichtsichtbare
          Textzeilen im HTML-Dokument werden mit <FONT color="#ff0000"><B>&lt;!--</B>
          </FONT>als Startzeichen und mit <FONT color="#ff0000"><B>--&gt;</B></FONT>
          beendet. Es k&ouml;nnen auch mehrere Zeilen ausgeblendet werden, nur dann
          ist das Endzeichen <FONT color="#ff0000"><B>//--&gt;</B></FONT><BR>
          Kann es sein, dass du einen Uraltbrowser und dazu noch in der Demoversion
          im Einsatz hast? Das hat wirklich keiner mehr n&ouml;tig, seit AWeb freigegeben
          wurde. </P>

          <P>Das Einrichten der Autoren&uuml;bersicht ist ehrlich gesagt ein Versuch
          und nicht ganz uneigenn&uuml;tzig. Vor Jahren (im MagneticPage Zeitalter)
          wurden im Editorial die Autoren namentlich erw&auml;hnt, und diejenigen,
          die dabei versehentlich vergessen wurden, waren dann teilweise
          eingeschnappt. Warum diese Sitte eingestellt wurde, ist wohl nicht mehr
          100%ig nachvollziehbar. Nun habe ich die Autorenerw&auml;hnung als
          eigenst&auml;ndige Rubrik eingerichtet, um einerseits aufzuzeigen, wer was
          ver&ouml;ffentlicht hat und andererseits f&uuml;r die etwas "fauleren"
          Schreiber als Ansporn zu dienen, um wieder im Rampenlicht zu erscheinen.
          Das ist nat&uuml;rlich nur sekund&auml;r, denn das haben wir doch alle gar
          nicht n&ouml;tig. Eine Wertigkeit wie weiland in den Top5 soll es nicht
          geben. Nichtsdestotrotz ist nichts dagegen einzuwenden, wenn die Sitte
          einer Feedbackquotierung sich wieder aktivieren w&uuml;rde.</P>

          <P>&Uuml;ber den Inhalt bin ich nicht verantwortlich, das ist Aufgabe eines
          jeden Einsenders. Worauf ich dabei achte, habe ich schon erl&auml;utert.
          Und wenn ich hie und da einen Fehler sehe, korrigiere ich diesen. Was ich
          jedoch zus&auml;tzlich mache, ist die HTML-Fehlerbereinigung mittels TIDY,
          damit auch andere Browser die Ver&ouml;ffentlichungen lesen und anschauen
          k&ouml;nnen. Denn die NoCover wird nicht nur auf einem Amiga 2000 mit OS
          2.04 gelesen, auf dem die eigenen Werke mit IBrowse 1.12 doch hervorragend
          ausschauen. Das war nat&uuml;rlich eine &uuml;berzeichnete Darstellung,
          aber ein Funken Wahrheit ist dennoch dabei. Bisher hat sich aber noch
          keiner dar&uuml;ber beschwert, dass ich manchmal in die "Output"-gestaltung
          eingreife.</P>

          <P>Wolf</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

