<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Indien - Heilige dreckige Mutter Ganga</TITLE>
  </HEAD>

  <BODY bgcolor="#CCCCCC" text="#000000" link="#009933" vlink="#CC9900" alink="#CC3300">
    <TABLE width="100%" border="0" summary="" cellpadding="10">
      <TR>
        <TD>
          <IMG src="mm_ga01.jpg" width="180" height="120"> 

          <P><B>Indien</B> <IMG src="mm_ga10.jpg" width="229" height="350" align="right"><BR>
           Juli 2002</P>

          <P><B><FONT size="5">Heilige dreckige Mutter Ganga</FONT></B></P>

          <P>Von Varanasi aus streitet ein Hindu-Tempelvorsteher f&uuml;r die
          Reinhaltung des gr&ouml;&szlig;ten indischen Flusses und d&uuml;piert mit
          einfachen Konzepten die indische Regierung</P>

          <P><B>Von Michael Netzhammer</B></P>

          <P><B>Die B&uuml;rde, die mit seinem Kampf f&uuml;r die Reinhaltung des
          Ganges verbunden ist, sp&uuml;rt Veer Bhadra Mishra jeden Tag. Sie lastet
          bereits auf ihm, wenn er nach dem Aufstehen von seinem hoch &uuml;ber dem
          Fluss stehenden Haus auf den Strom blickt, der sich an den Badestufen von
          Varanasi vorbeischiebt, dieser vielleicht heiligsten, im n&ouml;rdlichen
          Bundesstaat Uttar Pradesh liegenden Stadt Indiens.</B></P>

          <P>Schon vor dem Sonnenaufgang herrscht am Ufer dichtes Gedr&auml;nge.
          Frauen in nassen Saris beten im Wasser. Hagere Sadhus strecken ihre
          H&auml;nde gen Himmel. Daneben baden Asketen, Teenager, Pilger.</P>

          <P>F&uuml;r all diese Menschen empfindet der Leiter des Sankat Mochan
          Tempels eine schmerzliche Zuneigung. Weil sie wie er "Mutter Ganga" als
          Quelle des Lebens verehren. Weil die Hindus mit ihren Gebeten eine
          Tradition bewahren, die viele Jahrtausende zur&uuml;ckreicht. Und weil sie
          mit diesem Ritual leichtsinnig ihre Gesundheit aufs Spiel setzen.</P>

          <P>Mythologisch betrachtet gilt der Ganges als rein. Faktisch ist er eine
          dreckige Kloake. Unterhalb seines Fensters schwimmen &uuml;ber 50.000
          Kolibak&shy;terien in 100 Milliliter Wasser. Schuld daran ist ein riesiger
          Sturzbach aus Schei&szlig;e, M&uuml;ll, Plastik und verrottetem
          Gem&uuml;se, der sich aus der wachsenden Vorstadt ein Kilometer
          flussaufw&auml;rts in den Ganges ergie&szlig;t.</P>

          <P>Der 63-J&auml;hrige kennt die Gefahren dieser Fracht. Schlie&szlig;lich
          ist der wei&szlig;haarige Mann nicht nur Tempelvorsteher, sondern auch
          Professor f&uuml;r Wasserwirtschaft an der "Banaras Hindu
          Universit&auml;t". Zwei &Auml;mter, die nicht unterschiedlicher sein
          k&ouml;nnten und ihn jeden Tag aufs Neue in ein Dilemma st&uuml;rzen.</P>

          <P>F&uuml;r den Ingenieur Mishra sind die Kolibakterien Indikatoren
          f&uuml;r Wasserverschmutzung. Der Gl&auml;ubige Mishra will&nbsp; davon
          jedoch nichts wissen. Die Vorstellung die heilige "Mutter Ganga"
          k&ouml;nnte verunreinigt sein oder krank <IMG src= "mm_ga11.jpg"
          width="300" height="195" align= "left">machen, kommt einem Sakrileg gleich.
          Und so pilgert der Mensch Mishra jeden Morgen an den Fluss. Dort setzt er
          sich, h&auml;lt betend inne, l&auml;sst sich in das braune Wasser gleiten
          und taucht unter, weil "mein Tag ohne ein heiliges Bad unvollst&auml;ndig
          w&auml;re".</P>

          <P>Es ist dieser Widerspruch, der Veer Bhadra Mishra zu einem
          ungew&ouml;hnlichen Engagement bewog. 1982 gr&uuml;ndete er die "Sankat
          Mochan Foundation" - eine der wenigen Umweltorganisationen, die f&uuml;r
          die Reinhaltung des Ganges k&auml;mpft. Das hat ihm die Sympathien der
          Bev&ouml;lkerung eingebracht sowie den Titel "Heroe des Planeten"
          (Time-Magazin). Und es hat ihn - notgedrungen - zum Gegenspieler der
          indischen B&uuml;rokratie gemacht.</P>

          <P>"Sie behandeln uns schlimmer als Tiere", sagt Veer Bhadra Mishra
          &uuml;ber jene, die er f&uuml;r die Verschmutzung des Ganges verantwortlich
          macht: die Zentralregierung in Neu Delhi, das Umweltministerium des
          Bundesstaates Uttar Pradesh und dessen Wasserbeh&ouml;rde "Jal Nigam".</P>

          <P>Noch 1984 hatte Rahjiv Gandhi als Ministerpr&auml;sident die
          S&auml;uberung des 2.525 Kilometer langen Stromes zur nationalen Aufgabe
          erkl&auml;rt. In einem gro&szlig; angelegten "Ganges Aktionsplan" sollten
          die Abw&auml;sser gekl&auml;rt werden. In 25 St&auml;dten wurden in einer
          ersten Phase f&uuml;r 1,2 Milliarden Mark Kl&auml;rwerke, Kan&auml;le und
          Pumpanlagen gebaut; allein in Varanasi mit seinen 1,2 Millionen Einwohnern
          40 Millionen US-Dollar investiert. Der Ganges jedoch ist nicht sauberer
          geworden.</P>

          <P>"Dem Fluss wurde eine Medizin verordnet ohne vorher eine Diagnose zu
          stellen", kritisiert Veer Bhadra Mishra. Jetzt plant das von der Regierung
          ins Leben gerufene National River Conservation Directorate (NRCD) in einer
          zweiten Phase mit noch mehr Geld "die gleichen Fehler zu wiederholen". Das
          will der Wasserbauingenieur verhindern.</P>

          <P>Um seine Vorw&uuml;rfe zu untermauern, ruft der hochgewachsene Mann
          einen F&auml;hrmann heran. Auf dem Weg zum Ufer eilen ihm Menschen
          entgegen, beugen sich hinab, ber&uuml;hren seine F&uuml;&szlig;e. Als
          Zeichen des Respekts.</P>

          <P>Der Mahantji, wie die Inder den Tempelvorsteher ehrf&uuml;rchtig nennen,
          ist eine der wichtigsten religi&ouml;sen F&uuml;hrer in Varanasi. Seit
          &uuml;ber 400 Jahren leitet seine Familie den Sankat Mochan Tempel. Zu
          Ehren des Poeten Tulsi Das gebaut, gilt Veer Bhadra Mishra als dessen
          spiritueller Erbe.</P>

          <P>Langsam gleitet das Boot an den Badestufen entlang; vorbei an Frauen in
          bunten Saris, badenden M&auml;nnern, plantschenden Kindern, im Gebet
          versunkenen Menschen.</P>

          <P>Im Hintergrund erhebt sich Varanasi. Dieses gebrechliche Durcheinander
          aus Pal&auml;sten, H&uuml;tten, Kuppeln und Tempeln. Ein dichtes
          Steingemisch fast ohne Gr&uuml;n. Ununterbrochen ergie&szlig;en sich neue
          Menschenmassen die engen Stufen zum Fluss hinab. Jeden Tag baden hier
          &uuml;ber 60.000 Menschen. "Nirgendwo auf der Welt wird ein Fluss mehr
          verehrt als in Varanasi", wei&szlig; Veer Bhadra Mishra.</P>

          <P>Das liegt an der besonderen Bedeutung der 3.500 Jahre alten "Stadt des
          Lichts". Diesen Ort besuchten mit <IMG src="mm_ga12.jpg" width="300"
          height="195" align= "right">Brahma, Vishnu und Shiva drei der wichtigsten
          Hindugottheiten. Einmal in seinem Leben sollte deshalb jeder Hindu nach
          Banaras oder Kashi pilgern, wie die Stadt auch hei&szlig;t. Um sich die
          S&uuml;nden abzuwaschen, um zu sterben.</P>

          <P>In Varanasi betrachten Hindus den Tod als Geschenk. Weil jeder Sterbende
          hier dem ewigen Zyklus aus Tod und Wiedergeburt entkommen kann. Weshalb
          viele alte Menschen ihre letzten Tage in der heiligen Stadt verbringen.
          Entsprechend gro&szlig; ist das Gedr&auml;nge am "Manikarnika Ghat". Rund
          um die Uhr lodern die Feuer. Tr&auml;ger entladen mit Holz beladene
          Barkassen. Immer neue Toten werden aufgebahrt, die langsam in Rauch
          aufgehen. Am Ende &uuml;bergeben die Angeh&ouml;rige seine &Uuml;berreste
          dem Fluss.</P>

          <P>"Mutter Ganga tr&auml;gt schwer an dieser Tradition", sagt Veer Bhadra
          Mishra. Viele Leichen verkohlen unvollst&auml;ndig, andere werden
          unverbrannt versenkt. Der Fluss muss auch andere "Gaben" verkraften. Der
          Tempelvorsteher deutet auf Gl&auml;ubige, die den Ganges mit Tonnen von
          Blumen beschenken. Gleich daneben reiben W&auml;scher Kleidungsst&uuml;cke
          mit Seifenlauge ein.</P>

          <P>80 Prozent der Wasserverschmutzung hat jedoch die Wasserbeh&ouml;rde zu
          verantworten, erkl&auml;rt Veer Bhadra Mishra. Vom Boot aus sind die dicken
          Rohre gut zu erkennen. Eine dunkle Br&uuml;he aus Exkrementen und M&uuml;ll
          str&ouml;mt in den Fluss. Dass es nicht wie in einer Kl&auml;ranlage
          stinkt, ist wohl nur der ungeheuren Selbstreinigungskraft des Ganges zu
          verdanken. Trotzdem: Die Einleitungen d&uuml;rfte es nach dem&nbsp; "Ganges
          Aktionsplan" nicht mehr geben. Vier Pumpstationen waren zwischen 1986 und
          1993 mit kr&auml;ftigeren Motoren ausgestattet worden, um das aus der
          h&ouml;her gelegenen Altstadt in Richtung Ufer flie&szlig;ende Abwasser
          aufzufangen und in den hinter der Wasserscheide liegenden Hauptsiel zu
          pumpen.</P>

          <P>Die Elektromotoren jedoch stehen still. Wie so oft. T&auml;glich bricht
          in Varanasi das Stromnetz zusammen. Dann flie&szlig;en die
          Ausd&uuml;nstungen der Stadt wie fr&uuml;her in den Fluss. Von der
          Energieknappheit sind auch die zwei alten<IMG src="mm_ga13.jpg" width="300"
          height="196" align="right"> Kl&auml;rwerke und die neu errichtete
          hochmechanisierte Anlage betroffen. Ohne Elektrizit&auml;t funktioniert
          keine der drei. Schlimmer. Durch den ausbleibenden Abwasserzufluss sterben
          die Bakterienkulturen in den Kl&auml;rwerken ab. Die F&auml;kalien
          flie&szlig;en nahezu ungekl&auml;rt durch die Anlage und dann
          flussabw&auml;rts in den Ganges. Dort enth&auml;lt das Wasser 15.000 Mal
          mehr Kolibakterien als erlaubt. Die Anwohner, die auf das Ganges-Wasser
          angewiesen sind, leiden unter Hautausschl&auml;gen, Cholera, Hepatitis und
          Durchfall. Auf ihren mit dem "gekl&auml;rten" Wasser bew&auml;sserten
          Felder wachsen riesige Kartoffeln, die kurz nach der Ernte verfaulen.</P>

          <P>Das interessiert die Wasserbeh&ouml;rde Jal Nigam kaum. Lange Jahre
          verkauften sie ihre Investitionen als gro&szlig;en Erfolg. Bis Veer Bhadra
          Mishra ein eigenes Labor einrichtete, Messreihen startete, dem Ganges
          zahlreiche Proben entnahm und analysierte. Nach drei Jahren konnte er
          l&uuml;ckenlos nachweisen, dass der Ganges Aktionsplan in Varanasi ein
          wirkungsloser Schlag ins Wasser gewesen ist.</P>

          <P>Inzwischen werden seine Ergebnisse von unabh&auml;ngigen Studien
          best&auml;tigt. Der Rechnungspr&uuml;fer der indischen Regierung
          f&auml;llte ein verheerendes Urteil &uuml;ber den Ganges Aktionplan. Dieser
          "hat nur 39 Prozent seines eigentlichen Zieles erreicht", schreibt P.
          Narayana Murty, der Direktor der Studie, im Dezember 2000. Als Gr&uuml;nde
          daf&uuml;r nennt er Konstruktionsfehler, falsches Management, mangelnde
          Wartung und eine h&auml;ufig fragliche Technologie, "die der Einleitung von
          Bakterien nicht in ausreichendem Ma&szlig;e Einhalt gebieten konnte".</P>

          <P>Diese Best&auml;tigung erf&uuml;llt Veer Bhadra Mishra&nbsp; mit
          Genugtuung, reicht ihm aber nicht. "Wir brauchen eine radikale Abkehr vom
          bisherigen Konzept". Wie das gehen kann, hat er mit dem US-Amerikaner
          Oswald Green f&uuml;r Varanasi entwickelt. Der Wissenschaftler aus
          Kalifornien gilt als Pionier der stromlosen Kl&auml;rtechnik. Seine in den
          USA gebauten Kl&auml;rwerke s&auml;ubern das Abwasser mit der Hilfe von
          Algen, Sauerstoff und Licht.</P>

          <P>Das Konzept soll auch in Varanasi eingesetzt werden. Um ihre Idee zu
          skizzieren, zieht Veer Bhadra Mishra einen Stadtplan aus der Schublade. Mit
          dem Bleistift jagt er dar&uuml;ber hinweg, markiert die nur sporadisch
          funktionierenden <IMG src="mm_ga14.jpg" width="300" height="196"
          align="left">Pumpstatio&shy;nen und die Standorte der alten Kl&auml;rwerke.
          Dann zeigt sein Bleistift auf einen toten Seitenarm des Ganges. 20
          Kilometer s&uuml;d&ouml;stlich von Varanasi soll ihre Anlage entstehen.
          "Kein Mensch m&uuml;sste enteignet, keiner vertrieben werden", erkl&auml;rt
          Mishra ein Detail, das ihm besonders wichtig ist.</P>

          <P>In der Stadt selbst will er das von den Briten Anfang des 20.
          Jahrhunderts erbaute Kanalsystem erweitern. Das wichtigste Siel soll an den
          Badestufen entlang gef&uuml;hrt werden. Es w&uuml;rde alle Richtung Fluss
          flie&szlig;enden Abw&auml;sser auffangen und die energiefressenden
          Pumpstationen fortan unn&ouml;tig machen.</P>

          <P>Unabh&auml;ngige Experten waren von dem radikalen, aber einfachen
          Konzept begeistert. Die Stadtv&auml;ter von Varanasi votierten geschlossen
          f&uuml;r die Verwirklichung dieses Planes und selbst einige Tausend
          B&uuml;rger - in Indien durchaus ungew&ouml;hnlich -pl&auml;dierten per
          Unterschrift f&uuml;r das Konzept. Nur die f&uuml;r den Ganges Aktionsplan
          zust&auml;ndigen Beh&ouml;rden reagierten wie empfindliche Haut auf ein Bad
          im Ganges.</P>

          <P>Zuerst versuchten das Umweltministerium des Bundesstaates und ihre
          Wasserbeh&ouml;rde Jal Nigam das alternative Konzept totzuschweigen. Veer
          Bhadra Mishra musste 1998 das h&ouml;chste Gericht des Bundesstaates in
          Allahabad anrufen, damit der Plan offiziell zur Kenntnis genommen wurde.
          Eine Kommission m&uuml;sse entscheiden, urteilten die Richter, ob das
          Abwasser in Varanasi k&uuml;nftig nach Mishras Pl&auml;nen oder denen der
          bundesstaatlichen Wasserbeh&ouml;rde Jal Nigam gekl&auml;rt werden
          solle.</P>

          <P>Seit diesem Urteil tobt zwischen dem National River Conservation
          Directorate (NRCD), dem Umweltministerium von Uttar Pradesh und der
          Wasserbeh&ouml;rde Jal Nigam einerseits sowie Mishra und der
          Stadtverwaltung von Varanasi andererseits eine Art Kleinkrieg.
          Austragungsort des Streits: Medien und Gerichte.</P>

          <P>Weil sie nach dem Gerichtsurteil den alternativen Plan zur Kenntnis
          nehmen mussten, lud das NRCD Veer Bhadra Mishra vor immer neue
          Kommissionen, damit er dort seine Pl&auml;ne erl&auml;utere. Im August 2001
          lie&szlig; man ihn von dort jedoch wissen, dass man die Pl&auml;ne der
          Wasserbeh&ouml;rde Jal Nigam f&uuml;r "mehr praktikabel" als die seinen
          halte.</P>

          <P>Verwundert war Mishra dar&uuml;ber nicht. Schlie&szlig;lich geht der
          Streit l&auml;ngst nicht mehr um ein Abwasserkonzept allein, sondern vor
          allem um die grunds&auml;tzliche Frage, wer dar&uuml;ber zu entscheiden
          hat.</P>

          <P>Theoretisch erlaubt ein 1996 beschlossener Verfassungszusatz den
          Gemeinden und St&auml;dten, ihr Abwasser eigenst&auml;ndig zu verwalten. In
          der Praxis aber wollen weder Bundesstaaten noch Zentralregierung die
          "Wasserhoheit" und die damit verbundenen Pfr&uuml;nde abgeben. Ein Votum
          f&uuml;r Mishras Pl&auml;ne w&uuml;rde der lokalen Eigenst&auml;ndigkeit in
          der Praxis eine Presche schlagen. Entsprechend z&auml;hen Widerstand
          leisten seine Gegner.</P>

          <P>Mishra wei&szlig; das. Doch das st&auml;ndige Anrennen gegen die Mauern
          der Macht macht m&uuml;rbe. W&auml;hrend die Staatsb&uuml;rokratie auf
          zahlreiche Mitarbeiter, Anw&auml;lte und Parteimitglieder
          zur&uuml;ckgreifen kann, verf&uuml;gt der Mahantji nur &uuml;ber wenige
          Unterst&uuml;tzer und noch weniger Kapital. Neben seinen zahlreichen
          Verpflichtungen als Tempelleiter, schreibt er Eingaben, beantwortet
          Anfragen, telefoniert mit Journalisten und Politikern.</P>

          <P>Das geht zuweilen &uuml;ber seine Kraft. Manchmal, gesteht er mit
          m&uuml;der Stimme, m&ouml;chte er einfach aufh&ouml;ren. Sich wieder seinen
          Hobbys, der Musik und seiner religi&ouml;sen Aufgabe zuwenden.</P>

          <P>Doch hinschmei&szlig;en kann er nicht, auch wenn er manchmal damit
          kokettieren muss. Der Kampf f&uuml;r einen sauberen Ganges begreift er als
          heilige Pflicht. "Wenn wir unser Wasser nicht mehr trinken, unsere
          rituellen B&auml;der nicht mehr nehmen k&ouml;nnen, werden wir unsere
          Identit&auml;t verlieren", sagt er und offenbart damit den eigentlichen
          Beweggrund f&uuml;r sein Engagement. <IMG src="mm_ga15.jpg" width="300"
          height= "194" align="right"></P>

          <P>Der Ganges ist ihm Wurzel hinduistischen Glaubens, Begegnungsst&auml;tte
          mit Gott und Ort religi&ouml;ser Traditionen. Dieses uralte Erbe sieht er
          durch die Verschmutzung gef&auml;hrdet. Nur deshalb interessiert er sich
          f&uuml;r den Umweltschutz. Der Mahantji ist kein gr&uuml;ner
          Revolution&auml;r, sondern ein konservativer, religi&ouml;ser Mensch.
          Demonstrationen oder Protestaktionen sind ihm so fremd wie Indiens
          Umweltorganisationen, mit denen er nicht verglichen werden will.<BR> </P>

          <P>Doch gleichzeitig ist er einer, der sich Widerst&auml;nden nicht einfach
          beugt. Schon als junger Mann hat er Tradition und mahnende Stimmen
          ignoriert, um als erster in seiner Familie Naturwissenschaften studieren zu
          k&ouml;nnen. Heute legt er sich mit der Staatsb&uuml;rokratie an. "Sie
          erz&auml;hlen uns L&uuml;gen und wir sind gl&uuml;cklich. Sie betr&uuml;gen
          das Gesetz und wir lassen sie damit durchkommen", sagt Veer Bhadra Mishra
          &uuml;ber deren arrogante Selbstbedienungsmentalit&auml;t. Er will sie
          nicht mehr gew&auml;hren lassen.</P>

          <P>Nun geht der Streit in eine neue Runde. Gegen die Entscheidung des
          National River Conservation Directorate (NRCD) hat die Stadtverwaltung vor
          dem Obersten Gerichtshof in Neu Delhi Widerspruch eingelegt. Die Richter
          haben der Klage statt gegeben und die Entscheidung des NRCD bis zur
          endg&uuml;ltigen Entscheidung auf Eis gelegt.</P>

          <P>"Vielleicht werde ich zu Lebzeiten noch in einem sauberen Ganges baden
          ", sagt der 63-J&auml;hrige. Das w&auml;re ein Wunder. Doch der Mahantji
          glaubt daran wie an die Kraft der Wunder selbst. Die Geschichte wei&szlig;
          er auf seiner Seite. "Wer hat noch vor einigen Jahren gedacht, dass Nelson
          Mandela einmal s&uuml;dafrikanischer Pr&auml;sident werden w&uuml;rde",
          sagt er zum Abschied "und wer, dass die Berliner Mauer einmal st&uuml;rzen
          w&uuml;rde?" Eben.</P>

          <P><FONT color="#000000" size="3">&copy; Mike Netzhammer und die Global
          Aware Cooperative.</FONT></P>

          <P><FONT color="#000000" size="3">Der Agenda-Fotograf <A
          href="mailto:boethling@agenda-fototext.de">J&ouml;rg B&ouml;thling</A> ist
          ein Indienkenner. Seit vielen Jahren bereist er regelm&auml;&szlig;ig den
          indischen Kontinent und st&ouml;bert dort immer neue Reportagen auf, die
          von Baumwolle, Pfeffer und Staud&auml;mmen, von Bollywood-Schauspielern und
          Computerfreaks und versklavten Kindern handeln. Weitere Informationen
          erhalten Sie unter <A href=
          "http://www-agenda-fototext.de">www-agenda-fototext.de</A> oder Sie
          schreiben ihm eine Email. Copyright f&uuml;r alle Bilder <A href=
          "mailto:boethling@agenda-fototext.de">J&ouml;rg
          B&ouml;thling/agenda</A><BR>
          </FONT></P>
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

