<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Ecuador - Weisses Gold</TITLE>
  </HEAD>

  <BODY bgcolor="#CCCCCC" text="#000000">
    <TABLE width="100%" border="0" cellpadding="10" summary="">
      <TR>
        <TD>
          <P align="left"><B>Abya Yala, Ecuador</B><IMG src= "mm_ga20.jpg"
          width="153" height="230" align="right" alt=""></P>

          <P>Juli 1999</P>

          <H2><B>Weisses Gold</B></H2>

          <H2>Die sozialen und &ouml;kologischen Folgen des weltweiten
          Shrimpsboom</H2>

          <P>Von Michael Netzhammer</P>

          <P><B>L&iacute;der G&oacute;ngora kennt die Launen des Pazifiks. Stoisch
          steht der Chef der Umweltorganisation "Fundaci&oacute;n de Defensa
          Ecol&oacute;gica" (Fundecol) am Bootsende, den Griff des 75
          PS-Yamaha-Aussen&shy;borders in der Hand und wischt sich das salzige
          Meerwasser aus dem Gesicht. Zwischen der Flu&szlig;m&uuml;ndung des
          Bolivars und dem kleinen Boot liegen 500 Meter gef&auml;hrliche
          Brandung.</B></P>

          <P>L&iacute;der G&oacute;ngora studiert die Wellen und wartet darauf, dass
          die Wellenberge zusammen&shy;st&uuml;rzen, sich milchiger Schaum &uuml;ber
          das Wasser legt und der Ozean f&uuml;r einen Atemzug wehrlos
          darniederliegt. Dann jagt er &uuml;ber die brodelnde Ebene hinweg auf die
          n&auml;chste Welle zu und l&auml;sst sich von ihr wie ein Surfer in den
          Bol&iacute;var gleiten.</P>

          <P>An den Ufern des Flusses staksen Reiher, in den gr&uuml;nen Baumwipfeln
          sitzen Pelikane, ab und zu kreischt eine M&ouml;we, w&auml;hrend
          unz&auml;hlige rote Krebse &uuml;ber das sumpfige Ufer stieben. Doch die
          friedliche Stimmung ist nichts weiter als eine romantische Fata Morgana, so
          wie die Mangroven entlang des Stromes. Gerade mal zwei bis drei Meter breit
          stehen die B&auml;ume noch. Dahinter ist der urw&uuml;chsige Wald gerodet,
          wurden Becken ausgehoben, um darin Krabben zu z&uuml;chten - &laquo;weisses
          Gold&raquo;, wie die Farmer die &laquo;Shrimps&raquo; wegen ihrer Farbe
          nennen und weil der Handel damit kaum weniger lukrativ ist als einst das
          Gesch&auml;ft mit dem Edelmetall.</P>

          <P>In nur zwanzig Jahren hat sich in Ecuador ein riesiger Industriezweig
          entwickelt. Heute ist das s&uuml;damerikanische Land der zweitgr&ouml;sste
          Shrimpsproduzent der Welt. Von der Zucht lebt fast jeder f&uuml;nfte
          Bewohner der K&uuml;stenprovinzen.</P>

          <P>Der Krabbenboom ist kein ecuadorianisches Ph&auml;nomen. Er findet an
          vielen tropischen und subtropischen K&uuml;sten statt: in China, Thailand,
          Indien oder Bangladesh, in Honduras oder Mexiko. Inzwischen werden
          j&auml;hrlich &uuml;ber 930.000 Tonnen Crevetten im Wert von zehn
          Milliarden Mark gez&uuml;chtet.</P>

          <P>Die positiven Auswirkungen des Shrimpsbooms registrieren zuallerst die
          Konsumenten. Die einstige Luxusware hat sich in der Schweiz zu einem
          Grundnahrungsmittel gewandelt. Wurden Cretten fr&uuml;her nur in
          Feinkostgesch&auml;ften vertrieben, gibt es sie heute bereits in kleinen
          Superm&auml;rkten. Die Regale sind voll mit Eismeershrimps, Nordseekrabben,
          Jumbo-Crevetten, Gambaschw&auml;nzen. Selbst Fast-Food-Ketten werben
          inzwischen mit Shrimpswochen.</P>

          <P>Die Kehrseite des Booms ist dagegen unbekannt. Die massiven
          Investitionen ver&auml;ndern die K&uuml;stenregionen - mit weitreichenden
          &ouml;kologischen und &ouml;konomischen Folgen.</P>

          <P>Galten diese Landstriche noch vor wenigen Jahren als wirtschaftlich
          wertlos, weshalb sie der &auml;rmeren Bev&ouml;lkerung vorbehalten blieben,
          reissen sich die Interessenten heute darum. Inzwischen tobt ein
          Landkonflikt, der Gerichte und Parlamente besch&auml;ftigt, der aber auch
          mit F&auml;usten und Pistolen gef&uuml;hrt wird und bereits viele Tote
          gekostet hat. Aus ehemals naturbelassenen Gebieten sind Krisenregionen
          geworden.</P>

          <P>Das gilt auch f&uuml;r den Norden von Ecuador, die Region Muisne, deren
          Entwicklung als Beispiel f&uuml;r die weltweite Auseinandersetzung gesehen
          werden kann. Hier hat Lider Gongora die Umweltorganisation Fundecol
          gegr&uuml;ndet, deren Aktivisten sich gegen die Expansion der Shrimpsfarmer
          engagieren. Regelm&auml;ssig f&auml;hrt der Chef der Umweltorganisation
          Patrouille, um die illegale Abholzung der Mangroven zu dokumentieren.</P>

          <P>Immer wieder f&uuml;hrt ihn sein Weg zu den Muschelsammlern nach
          Bolivar, auf die Insel zwischen <IMG src="mm_ga21.jpg" width="130"
          height="195" alt="" align= "left">S&uuml;sswasser und Meer, ans Ende der
          Welt, das man nur mit einem Ritt durch die Wellen erreicht und dessen
          Bewohner um ihre Existenz bangen, seit die Zuchtfarmen den Ort wie einen
          Belagerungsg&uuml;rtel umschliessen.</P>

          <P>Der Scheinwerfer lockt die Krabben an. Sie springen der Lichtquelle
          entgegen, bis der Sog des abfliessenden Wassers ihre kleinen K&ouml;rper
          erfasst, sie fortreisst und durch das ge&ouml;ffnete Wehr sp&uuml;lt. Ein
          Meer aus weissen Leibern wimmelt in den Maschen, deren rote Augen in der
          Dunkelheit wie eine endlose Lichterkette leuchten. Dann aber f&auml;hrt
          eine Kelle zwischen das Wuseln, wirft die Krustentiere in ein Gemisch aus
          Wasser, Eis und Sodium Metabisulfat, indem sie ihr Leben aushauchen, bevor
          sie in einem Plastiksarg aus Eis landen.</P>

          <P>Wenn Eric Notarianni &uuml;ber die Ernte erz&auml;hlt, dann klingt das
          wie eine, wenn auch brutale, Liebeserkl&auml;rung an die zehnf&uuml;ssigen
          Meerestiere mit dem langgezogenen Kopf, den zwei F&uuml;hlern und dem
          k&ouml;stlichen Fleisch. Verst&auml;ndlich. Das Leben des 55j&auml;hrigen
          Schotten ist untrennbar mit den Krabben verbunden. Er begann in der
          ecuadorianischen Shrimpsindustrie zu arbeiten als diese den Namen noch
          nicht verdiente. Die Boomjahre in den 80er und 90er Jahren erlebte er
          zeitweise als Vizepr&auml;sident der &laquo;Nationalen Kammer der
          Aquakultur&raquo;. Heute leitet er die Sociedad Nacional de Galapagos
          (SONGA), eines der grossen Unternehmen im Crevettenbusiness.</P>

          <P>Eine Bilanz zieht er mit britischem Unterstatement. Ecuador z&auml;hlt
          inzwischen 2.000 Shrimpsfarmer, die etwa 200.000 Hektar, eine Fl&auml;che,
          so gross wie der Kanton St.Gallen bewirtschaften. Im vergangenen Jahr
          wurden 150.000 Tonnen Krabben produziert, 80 Prozent davon exportiert,
          &uuml;ber die H&auml;lfte in die Vereinigten Staaten, der Rest nach Asien
          und Europa. Fast 900 Millionen Dollar hat der Handel mit dem weissen Gold
          eingebracht, mehr Devisen erwirtschaften nur &Ouml;l und Bananen.</P>

          <P>Die Ausichten scheinen gut. Die Nachfrage nach Crevetten steigt.
          Nordamerikaner und Japaner verspeisen bereits zwei bis vier Kilo im Jahr.
          Die Deutschen bringen es immerhin auf ein Kilogramm, allerdings oft nur die
          billigeren Nord- und Eismeerkrabben.</P>

          <P>Von seinem Schreibtisch aus sieht Eric Notarianni, wie seine Mitarbeiter
          durch die gekachelte Produktionshalle eilen, an langen Tischen stehend
          Shrimpsk&ouml;pfe abtrennen, Sortiermaschinen bedienen oder Garnelen
          wiegen, mit Wasser begiessen und in Pappkartons abpacken.</P>

          <P>Aus dem Fenster zur Linken blickt er &uuml;ber eine k&uuml;nstliche
          Seenplatte aus Kan&auml;len, Abfl&uuml;ssen und Becken, die alle rund 300
          Meter auf 120 Meter messen. Die Fl&auml;che glitzert im Sonnenlicht und
          endet erst am Horizont. 5000 Hektaren sind&nbsp; keine Kleinigkeit.</P>

          <P>Doch erst die Fahrt im Gel&auml;ndewagen l&auml;sst die Dimension
          wirklich begreifen. Teich reiht sich an Teich, eine Ein&ouml;de aus Becken,
          Gr&auml;ben, Wegen, in der sich keine Menschenseele zeigt, weil Shrimps
          nicht die Hege von Ackerpflanzen ben&ouml;tigen.</P>

          <P>Hier in der Region um Guayaquil werden &uuml;ber 2/3 aller Garnelen
          gez&uuml;chtet, weil die Natur den Standort beg&uuml;nstigt. Auf der einen
          Seite transportiert der Guayas S&uuml;sswasser in das Delta s&uuml;dlich
          von Guayaquil, auf der anderen Seite dr&uuml;ckt der Pazifik Meerwasser in
          das sumpfige Land. In dieser salzhaltigen und n&auml;hrstoffreichen
          Mischung gedeihen die Crevetten am besten.</P>

          <P><IMG src="mm_ga22.jpg" width="195" height="130" align= "left"
          alt="">Eric Notarianni unterscheidet neben der seit Jahrhunderten
          praktizierten extensiven noch die semi-intensive und die intensive Zucht.
          Als Gradmesser dient die Zahl der Larven, die pro Hektar ausgesetzt werden.
          In traditionell bewirtschafteten Becken sind es 25.000 Larven pro Hektar,
          in modernen Farmen zwischen 100.000 und 600.000 Larven. Entsprechend mehr
          wird geerntet. Statt 500 Kilogramm k&ouml;nnen es bis zu 20.000 Kilogramm
          sein.</P>

          <P>Je mehr Larven aber in den Becken schwimmen, desto h&ouml;her ist der
          Kapitaleinsatz: f&uuml;r Zusatzfutter, f&uuml;r D&uuml;nger zur Bildung von
          Plankton, f&uuml;r Bel&uuml;fter, Dieselpumpen und Treibstoff, um
          Sauerstoff und das Wasser in den Becken auszutauschen.</P>

          <P>W&auml;hrend viele asiatischen Farmen intensiv z&uuml;chten, werden die
          ecuadorianischen Anlagen semi-intensiv betrieben. &laquo;Es gibt kaum
          Produzenten auf der Welt, die weniger Larven pro Hektar aussetzen als
          wir&raquo;, erkl&auml;rt Eric Notarianni. Das hat Vorteile.</P>

          <P>Zum einen k&ouml;nnen die Becken l&auml;nger genutzt werden. Denn
          intensiv arbeitende Farmen sind nach zehn Jahren so verschmutzt, dass sie
          aufgegeben werden m&uuml;ssen. In Ecuador hingegen existieren noch Becken,
          die dreissig Jahre alt sind, wei&szlig; der Schotte.</P>

          <P>Das gr&ouml;sste Problem einer dichten Population liegt freilich in
          ihrer Anf&auml;lligkeit gegen&uuml;ber Bakterien, Pilzbefall und Viren.
          Immer wieder brechen Epidemien aus. 1988 zerst&ouml;rte ein Virus Taiwans
          Shrimpszucht, 1992 und 1993 f&uuml;hrte der White spot Virus zu
          Ernteausf&auml;llen in Thailand und China. Die Regierung in Peking
          bezifferte den Verlust allein 1993 auf eine Milliarde US-Dollar.</P>

          <P>Auch Ecuadors Garnelenindustrie blieb nicht verschont. Das Taura Syndrom
          Virus kostete die Farmer 200 Millionen US-Dollar. Rund 17.000 Hektar
          Anbaufl&auml;che mussten aufgegeben werden. Die Konsequenz war ein Exodus
          von Farmern in den Norden, in die letzte zuchtfreie Region Ecuadors.</P>

          <P>Entsprechend gross ist die Furcht vor weiteren Epidemien. Bei geringsten
          Anzeichen einer Erkrankung greifen deshalb viele Z&uuml;chter zu
          Antibiotika oder anderen Medikamenten. Doch w&auml;hrend Eric Notarianni
          &laquo;keine Gefahr f&uuml;r Konsumenten und Umwelt sieht&raquo;, warnt die
          Weltern&auml;hrungsorganisation FAO vor einem inflation&auml;ren
          Gebrauch.</P>

          <P>&laquo;Fr&uuml;her habe ich an einem Tag 350 Muscheln gefunden, heute
          bin ich froh, wenn es 100 sind&raquo;, sagt Gladys Cort&eacute;z Castillo.
          Die Falten auf ihrer Stirn verraten ihre Wut. Die Pr&auml;sidentin der
          Muschelsammler von Bolivar steht wie die anderen Frauen im Dreck. Den
          K&ouml;rper nach vorn gebeugt, durchw&uuml;hlt die 34j&auml;hrige den
          Schlamm, aber die Muscheln sind seltener geworden, seit sich Shrimpsfarmer
          zu beiden Seiten des Bolivars angesiedelt haben und das Gros der
          Fl&auml;che inzwischen aus Zuchtbecken besteht.</P>

          <P>T-Shirt und Hose sind schlammbeschmiert. Bei jedem Schritt versinken
          ihre Beine knietief im Untergrund. Gummihandschuhe sch&uuml;tzen die
          rotlackierten Fingern&auml;gel und beugen einer unliebsamen Begegnung mit
          dem Froschfisch vor, der mit seinen Giftdr&uuml;sen die Haut ver&auml;tzen
          kann, gottlob aber seltener vorkommt als die herumschwirrenden
          Moskitos.</P>

          <P>Manchmal hasst Gladys Castillo ihre Arbeit. F&uuml;r die 150 Muscheln in
          ihrem Korb wird sie 15.000 Sucres erhalten - f&uuml;nf Mark f&uuml;r vier
          Stunden Arbeit, der Gegenwert von drei Kilo Reis.</P>

          <P>Mit Wehmut denkt sie an die Zeit zur&uuml;ck, als sie in Esmeraldas, der
          gr&ouml;&szlig;ten Stadt im Norden, als Kellnerin arbeitete. Bis ihr
          gek&uuml;ndigt wurde und sie zur&uuml;ck musste.</P>

          <P>Nach Bolivar, wo die roten Bl&uuml;ten der Jacaranda&shy;b&auml;ume den
          Behausungen einen paradiesischen Anstrich verleihen und die Salsamusik die
          Ohren in s&uuml;sse Watte packt. Die Holzh&uuml;tten aber sind ohne Wasser,
          die Pforten der Kirche verschlossen, weil der Pfarrer nur einmal im Jahr
          den Weg nach Boli&shy;var findet. Selbst die Staats&shy;macht hat diesen
          Ort und seine 2.000 Einwohner vergessen. Der letzte Polizist ertr&auml;nkte
          die Langeweile im Alkohol. Eines Tages verschwand er f&uuml;r immer. Viele
          der Einwohner sind ihm gefolgt, weil die Muscheln nicht zum &uuml;berleben
          reichen, der Fisch im Fluss schwindet und es keine Arbeit gibt.</P>

          <P>Das Dorf Bolivar stirbt. Langsam. Seine Bewohner ergeben sich der
          Lethargie. Oder dem Alkohol. Gladys Castillo nicht. Mit drei Dutzend Frauen
          hat sie die &laquo;Virgen de la lajas&raquo; gegr&uuml;ndet. Wie Fundecol
          k&auml;mpfen sie gegen die Abholzung der Mangroven. Sie fordern, dass
          illegal errichtete Farmen geschlossen und aufgeforstet werden. Ihr Protest
          richtet sich auch gegen die schleichende Vergiftung ihrer Umwelt. Aus ihrer
          Holzh&uuml;tte blickt die 34j&auml;hrige auf die Abflussrohre der
          benachbarten Shrimpsfarm. Ihr Besitzer verklappt dort einen Cocktail aus
          Wasser, Chemikalien, Antibiotika, Fischmehl und Krabbenkot. Alle Farmen
          entlang des Flusses entledigen sich ihrer Abw&auml;sser nach dieser
          Methode.</P>

          <P>Ob der Bolivar das Gemisch verkraften wird? Belasten die Chemikalien das
          Trinkwasser? Wie reagieren die Muscheln darauf? Alles Fragen, auf die
          Gladys Castillo keine Antwort weiss und die bei der 34j&auml;hrigen Angst
          ausl&ouml;sen, weil manchmal tote Fische und Krabben auf dem Wasser
          treiben.</P>

          <P>Ihrem Engagement liegt keine romantische Verkl&auml;rung ihrer Umwelt
          zugrunde, wie sie so manch &Ouml;kologen zu eigen ist. Auch kennt sie die
          Zusammenh&auml;nge nicht zwischen globaler Abholzung und den Sch&auml;den
          f&uuml;r das Weltklima.</P>

          <P>Aber Gladys Castillo sp&uuml;rt die Folgen. T&auml;glich. Hautnah und
          schmerzhaft. Ohne dass ein soziales Netz sie auffangen w&uuml;rde. Weniger
          Mangroven bedeuten weniger Muscheln, folglich weniger Einnahmen, also
          Hunger und Not.</P>

          <P>Die Shrimpsfarmer investieren auch in Gebieten, wo seit Jahrhunderten
          Reis angebaut wird. In der Region um Guayaquil etwa oder in Bangladesh oder
          in Indien. Mit jedem f&uuml;r den Export gebauten Shrimpsbecken geht
          Anbaufl&auml;che f&uuml;r die heimische Bev&ouml;lkerung verloren. Im
          Krishna-Godavari-Delta, der Reiskammer der indischen Provinz Andhra
          Pradesh, wurden bereits 15 Prozent aller Reisfelder f&uuml;r die Zucht
          umgewandelt.</P>

          <P>Das kostet auch Arbeitspl&auml;tze. Denn Reisbauern besch&auml;ftigen
          pro Hektar 50 Arbeiter, die Z&uuml;chter kommen mit f&uuml;nf
          Hilfskr&auml;ften aus. Beides f&uuml;hrt zu einem Exodus der
          K&uuml;stenbewohner, warnt Greenpeace. In der Stakhira-Region in Bangladesh
          wurden nach Angaben der Umwelt&shy;organi&shy;sation inzwischen 120.000
          Menschen, 40 Prozent der Bev&ouml;lkerung, vertrieben.</P>

          <P>Hinzu kommt, dass gr&ouml;sser werdende Zuchtbest&auml;nde mehr Futter
          verbrauchen. F&uuml;r ein Kilo Shrimps <IMG src="mm_ga23.jpg" width="195"
          height= "130" align="right" alt="">ben&ouml;tigen Z&uuml;chter in Ecuador
          etwa zwei Kilo Zusatzfutter, in n&auml;hrstoff&auml;rmeren Gebieten
          entsprechend mehr. Wichtigster Bestandteil ist Fischmehl. Greenpeace
          rechnet damit, dass zur Jahrtausendwende allein die asiatische Aquakultur
          ein F&uuml;nftel der j&auml;hrlichen Fischmehlproduktion verbrauchen
          wird.</P>

          <P>Bereits heute konkurrieren Kleinfischer in vielen L&auml;ndern mit den
          international operierenden Fangflotten. In Peru zum Beispiel, vor dessen
          K&uuml;ste ein Grossteil des Bedarfs der Fischmehlindustrie gefangen wird,
          klagen Fischer &uuml;ber zur&uuml;ckgehende Fischbest&auml;nde.</P>

          <P>Ihre Existenz steht genauso auf dem Spiel, wie die von Gladys Castillo,
          der Muschelsammlerin aus dem 500 Kilometer n&ouml;rdlich gelegenen Bolivar.
          Die Mutter von drei Kinder aber will sich ihre Lebensgrundlage nicht
          zerst&ouml;ren lassen, zumindest nicht kampflos. Deshalb engagiert sie
          sich, wenn Fundecol mit der finanziellen Unterst&uuml;tzung der Schweizer
          Entwicklungsorganisation &laquo;Swissaid&raquo; Kahlschlagfl&auml;chen
          aufforstet. Oder sie f&auml;hrt in die Hauptstadt Quito, um mit anderen vor
          dem Pr&auml;sidentenpalast zu demonstrieren, auch wenn sie dort
          Tr&auml;nengaswolken und Schl&auml;ge von Polizisten riskiert.</P>

          <P>Ihr Engagement provoziert immer wieder Streit. Zuhause. Manchmal
          w&uuml;rde Glady Castillos Lebensgef&auml;hrte ihr am liebsten den Mund
          verbieten, wenn sie mal wieder den Zorn der Farmer erregt. Er kennt die
          Argumente seiner Frau. &laquo;Aber sie vergisst, dass wir M&auml;nner
          fr&uuml;her nur als Fischer arbeiten konnten, aber keine Alternativen
          hatten.&raquo; Pablo Garcia Allosa arbeitet heute als Verwalter auf einer
          Garnelenfarm und verdient doppelt so viel Sucres wie seine Frau, etwa 140
          Mark im Monat. Erst beide Einkommen zusammen erm&ouml;glichen dem Paar,
          Andrea,&nbsp; die &auml;lteste der drei Kinder, auf die Oberschule nach
          Esmeraldas zu schicken, um der 14j&auml;hrigen eine bessere Zukunft zu
          er&ouml;ffnen.</P>

          <P>Die Strasse entlang der K&uuml;ste ist h&auml;ufig nicht mehr als eine
          Aneinanderreihung von Schlagl&ouml;chern. Gel&auml;ndewagen rumpeln nord-
          und s&uuml;dw&auml;rts, Busse ziehen Russwolken in ihrem Schlepptau.
          Abgetakelte US-Trucks transportieren Dieselaggregate und Caterpillarraupen,
          Bauholz und Benzin, Boote, Fischmehl, Lebensmittel. Achsen und Karosserien
          &auml;chzen unter den Lasten.</P>

          <P>Wenn der Chef der Umweltorganisation Fundecol L&iacute;der
          G&oacute;ngora die K&uuml;stenstrasse nimmt, schiebt sich mit jedem
          vorbei&shy;fahrenden K&uuml;hltransporter die Realit&auml;t brutal in sein
          Bewusstsein. Die Krevetten&shy;industrie ist auf dem Vormarsch -
          ungeach&shy;tet aller Widerst&auml;nde von Seiten der
          Umwelt&shy;sch&uuml;tzer.</P>

          <P>&laquo;In der Region Muisne haben Shrimpsfarmer bereits 90 Prozent der
          Mangroven gef&auml;llt&raquo;, erz&auml;hlt Fundecol-Chef Lider Gongora.
          F&uuml;r die gesamte K&uuml;stenregion von Ecuador sch&auml;tzt er, dass
          von ehemals 360.000 Hektaren zwei Drittel verschwunden sind. Bewiesen ist
          diese Zahl nicht. Nur die Marine verf&uuml;gt &uuml;ber Satellitenfotos,
          deren Aufnahmen von 1995 lediglich den Einschlag von 54.000 Hektar
          belegen.</P>

          <P>Weltweit aber wurden in nur einem Jahrzehnt f&uuml;nf Prozent der
          Mangroven zerst&ouml;rt. Der Bestand ist auf insgesamt 20 Millionen Hektar
          gesunken und wird weiter sinken. Schliesslich wollen viele L&auml;ndern am
          &laquo;weissen Gold&raquo; verdienen. Indonesien will eine Million Hektar
          f&uuml;r Garnelenbecken roden, L&auml;nder wie Ghana, Tansania oder
          Nicaragua planen &auml;hnliches.</P>

          <P>In Ecuador hat sich die Einschlagsquote sogar noch erh&ouml;ht, nachdem
          die Regierung 1985 erste Schritte f&uuml;r den Schutz der Mangroven
          beschloss. Damals hatte Lider Gongora noch gehofft, die Industrie mit
          juristischen Mitteln stoppen zu k&ouml;nnen.</P>

          <P>Seine Augen blicken melancholisch auf ein Werbeplakat der
          Shrimpsindustrie, w&auml;hrend er m&uuml;de einige Gesetze aufz&auml;hlt,
          die zum Schutz der Mangroven erlassen wurden. Das Decreto Ejecutivo von
          1985 setzte eine Strafe von 30 Gef&auml;ngnistagen fest f&uuml;r jeden ohne
          Genehmigung gef&auml;llten Baum. Ein Jahr sp&auml;ter erkl&auml;rte die
          Regierung 360.000 Hektar Land entlang der K&uuml;ste zur gesch&uuml;tzten
          Waldfl&auml;che. Schlie&szlig;&shy;lich wurde 1994 mit dem Decreto
          Ejecutivo 1907 der Einschlag von Mangroven f&uuml;r einen Zeitraum von
          f&uuml;nf Jahren vollkommen verboten.</P>

          <P>Faktisch aber, sagt Lider Gongora bitter, hat sich nichts
          ver&auml;ndert. Selbst die Grenzen von Schutzzonen schrecken Shrimpsfarmer
          nicht. Im Norden von Ecuador errichteten Z&uuml;chter ihre Becken sogar in
          den Grenzen eines Nationalparks, ohne dass Polizei oder Justiz eingegriffen
          h&auml;tten.</P>

          <P>Hinter dieser Duldung vermutet Lider Gongora System. &laquo;Politik und
          Shrimpsindustrie stecken unter einer Decke&raquo;,</P>

          <P>erkl&auml;rt er. Der ehemalige Botschafter Ecuadors in den USA, Alberto
          Maspons, ist Pr&auml;sident von El Rosario und steht damit dem
          zweitgr&ouml;&szlig;ten Unternehmen im Shrimpsgesch&auml;ft vor. Auch die
          langj&auml;hrige Direktorin der Fischereiabteilung Nancy Cely Icaza -
          zust&auml;ndig f&uuml;r die Vergabe von Konzessionen und die
          strafrechtliche Verfolgung etwaiger Straftaten durch Z&uuml;chter - sitzt
          heute im Leitungsgremium der &laquo;Kammer der Aquakultur&raquo;.
          &laquo;Bei uns sollen sich die Shrimpsfarmer selbst verfolgen, da wundert
          es niemand, dass kein Mensch im Gef&auml;ngnis landet&raquo;, klagt der
          Umweltsch&uuml;tzer.</P>

          <P>Bis 1992 wurden nach Angaben der Regierung allein 14.000 Hektar illegal
          errichtet. Andere Farmer weisen Papiere und Urkunden vor, doch an ihrer
          Legitimit&auml;t zweifelt Lider Gongora: &laquo;Es gibt viele illegalen
          Wege der Legalisierung.&raquo; Mit einem Handstrich werden aus
          Mangrovenw&auml;lder &laquo;Buchten und Str&auml;nde&raquo;,
          &laquo;Salzfl&auml;chen&raquo; oder &laquo;h&ouml;her gelegenes
          Land&raquo;. Diese Fl&auml;chen fallen nicht unter das Gesetz von 1985 und
          d&uuml;rfen genutzt werden.</P>

          <P>Oder den Mangroven wird klammheimlich das Wasser abgegraben. Oder die
          Grenzen von Nationalparks werden solange verschoben, bis sie unn&ouml;tig
          geworden sind. Alles ist eine Frage des Preises. Oder der von Beziehungen
          oder Einfluss. In Ecuador herrscht ein sorgf&auml;ltig austariertes System
          des Gebens und Nehmens.</P>

          <P>&laquo;Unsere Gesetze sind erstklassig, aber es hapert an der
          Umsetzung&raquo;, sagt die neue Umweltministerin Yolanda Kakabadse zum
          Vorwurf der Korruption. Sie will die Kontrollen entlang der K&uuml;sten
          versch&auml;rfen, den Einfluss der Gemeinden st&auml;rken. Wie das
          geschehen soll, sagt sie nicht, aber sie gibt zu, &laquo;dass die
          Beh&ouml;rde &uuml;ber keinerlei Ressourcen verf&uuml;gt&raquo;. Wohl auch
          deshalb will Yolanda Kakabadse bei der Einf&uuml;hrung strengerer
          Umweltrichtlinien mit der Shrimpsindustrie zusammenarbeiten. Gegen sie, das
          weiss die Umweltministerin nur zu genau, wird sie kaum etwas erreichen
          k&ouml;nnen. Zu stark ist deren Lobby, zu schlagkr&auml;ftig das Argument
          der Deviseneink&uuml;nfte von 900 Millionen US-Dollar und 250.000
          besch&auml;ftigten Mitarbeiter, die so manch unangenehme Gesetzesvorlage
          zum Scheitern bringen k&ouml;nnen.</P>

          <P>Diese Konstellation ist f&uuml;r den Umweltsch&uuml;tzer Lider Gongora
          eine der Gr&uuml;nde, warum er wirklichen Zugest&auml;ndnissen der
          Z&uuml;chter nur mithilfe eines Kaufboykotts eine Chance gibt. Mit dieser
          &Uuml;berlegung steht<IMG src="mm_ga24.jpg" width= "195" height="130"
          align="right" alt=""> er nicht allein. Organisationen in Indien,
          Bangladesh, Thailand, Mexiko oder Tansania fordern westliche Konsumenten
          auf, Garnelen aus ihren L&auml;ndern nicht zu kaufen. &laquo;Ein
          Boykott&raquo;, das weiss Lider Gongora, &laquo;ist keine L&ouml;sung, aber
          das einzige Mittel, mit dem wir Druck aus&uuml;ben k&ouml;nnen&raquo;.</P>

          <P>&laquo;Ich bin es leid&raquo;, sagt Nancy Cely Icaza und knallt ihre
          flache Hand auf den Tisch. Laufend muss die Direktorin der ecuadorianischen
          Kammer der Aquakultur Fragen &uuml;ber die illegale Abholzung von
          Mangroven, &uuml;ber verwendete Chemikalien, vertriebene
          K&uuml;stenbewohner und Epidemien beantworten. &laquo;Umweltsch&uuml;tzer
          werfen uns sogar vor, wir w&uuml;rden unsere Mitarbeiterinnen von Kopf bis
          Fuss mit Chemikalien einspr&uuml;hen&raquo;, sagt sie mit einem Hauch von
          Bitterkeit und sieht sich einer Kampagne ausgesetzt.</P>

          <P>Dass viele Farmen in der n&ouml;rdlichen Provinz illegal errichtet
          wurden, bestreitet sie keineswegs. &laquo;Von der dortigen Situation darf
          man aber nicht auf die gesamte Zunft schliessen&raquo;, sagt sie. Rund um
          Quayaquil, dem Zentrum der Garnelenzucht, werden kaum Mangroven
          gef&auml;llt und die Gesetze eingehalten sagt sie in einem Ton, der keine
          Zweifel erlaubt.</P>

          <P>Nancy Cely Icaza kennt die Argumente ihrer Gegner und so wartet sie
          deren Vorw&uuml;rfe erst gar nicht ab, sondern geht in die Offensive.
          Nat&uuml;rlich wurden Mangroven um Guayaquil eingeschlagen. Das aber ist
          lange her; vor 1994 jedenfalls, dem Jahr als die Regierung den Einschlag
          verboten hat. &laquo;Ausserdem dachte doch fr&uuml;her niemand an die
          &ouml;kologischen Auswirkungen.&raquo;</P>

          <P>Heute schon. &laquo;Wir haben aus unseren Fehlern Lehren gezogen&raquo;,
          sagt sie, um sich dann einen Seitenhieb gegen die Umweltsch&uuml;tzer zu
          erlauben: &laquo;Wir reden nicht, sondern handeln&raquo;.</P>

          <P>Statt wie fr&uuml;her Wildlarven verwenden viele Z&uuml;chter heute in
          Brut&shy;anstalten gez&uuml;chtete Tiere. Damit l&auml;sst der Druck auf
          den nat&uuml;rlichen Bestand nach und mit jeder Larve die nicht mehr
          gefangen werden muss, reduzieren sich auch die dabei entstehenden extrem
          hohen und sch&auml;dlichen Beifang&shy;raten.</P>

          <P>Das Fl&uuml;ssen entnommene Wasser wird in den Produktionsanlagen
          aufbereitet. Es fliesst sauberer zur&uuml;ck als vorher. &laquo;Ausserdem
          ist die Qualit&auml;t des Quayas heute nicht schlechter als vor 30
          Jahren&raquo;, behauptet Nancy Cely Icazas - f&uuml;r sie ein weiteres
          Zeichen f&uuml;r die unn&ouml;tige Aufgeregtheit von Kritikern.</P>

          <P>Inzwischen finanzieren Shrimpsfarmer sogar ein Projekt von
          &laquo;Fundacion Natura&raquo; zum Schutz der Mangroven. Die gr&ouml;sste
          Umweltorganisation des Landes &uuml;berwacht mit regelm&auml;ssigen
          Fl&uuml;gen die Mangrovenw&auml;lder in der Provinz Guayas. Farmer, die
          Mangroven einschlagen werden angezeigt und im Bulletin der Kammer geoutet.
          Stolz zeigt sie auf die kleine Notiz in der neuesten Ausgabe, die einen der
          grossen Z&uuml;chter blossstellt.</P>

          <P>F&uuml;r einen Boykott ecuadorianischer Garnelen jedenfalls sieht sie
          deshalb auch keinen Grund. &laquo;Das w&uuml;rde unser Land und die
          Menschen in eine verheerende Krise st&uuml;rzen&raquo;, warnt sie.</P>

          <P>&laquo;Wir ben&ouml;tigen eine starke Lobby, wenn wir geh&ouml;rt werden
          wollen&raquo;, sagt Nancy Cely Icaza. Die Kammer ist daf&uuml;r gewappnet.
          Seit f&uuml;nf Jahren vereinigt sie 700 Farmer, Exporteure und Produzenten
          unter ihrem Dach, darunter alle Exporteure und immerhin 70 Prozent der
          Produzenten. Mit vereinten Kr&auml;ften hofft die ecuadorianische
          Shrimpslobby die Boykottforderungen in ihrem wichtigsten Abnehmerland, den
          USA, abzuwenden. Inzwischen haben die Shrimpsproduzenten die &laquo;US
          Global Aquacultural Alliance&raquo; gegr&uuml;ndet. Mit Anw&auml;lten und
          Wirtschaftsexperten soll das B&uuml;ro &laquo;die unfairen Attacken der
          Gr&uuml;nen vereiteln&raquo;.</P>

          <P>Abends, wenn der Himmel und das Wasser des Bol&iacute;vars den
          r&ouml;tlich-warmen Glanz der untergehenden Sonne annehmen, erscheint das
          Ende der Welt in einem warmen bezaubernden Licht.</P>

          <P>Aber auch hier zwischen Pazifik und vereinzelten Mangrovenresten, ruht
          die Zeit nicht. Heute ist das Dorf Bolivar Beispiel f&uuml;r eine
          zweifelhafte Moderne, die mit ihren Investitionen die existierende
          Subistenzwirtschaft verdr&auml;ngt und mit ihr gleich einige der
          alteingesessenen Muschelsammler und Fischer. In Muisne blickt Pater Joseph
          mit Sorge auf den Riss, der sich zwischen Farmern und Gegnern auftut.
          &laquo;Fr&uuml;her wurde der Reichtum der Natur gleichm&auml;ssig unter den
          Einwohnern verteilt, seit die Shrimpsindustrie an der K&uuml;ste Fuss
          fasst, konzentriert sich der Gewinn in den H&auml;nden weniger&raquo;,
          erkl&auml;rt er.</P>

          <P>Aber da sind auch andere Wahrheiten. Die der Gewinner zum Beispiel. In
          Muisne sind es Bootsfahrer, Hotels, Restaurants,
          Lebensmittelgesch&auml;fte, die zwei Tankstellen und rund 300
          Arbeiterinnen, die den geernteten Shrimps in der Produktionsanlage
          weiterverarbeiten. Einige wie Gladys Castillos Mann verdienen
          &uuml;berdurchschnittlich. Andere m&uuml;ssen f&uuml;r zehn Mark 15 Stunden
          arbeiten.</P>

          <P>Ob sich die ecuadorianische Shrimpsindustrie positiv oder eher negativ
          auf die ecuadorianische Volkswirtschaft auswirkt, dar&uuml;ber kann heute
          noch niemand eine eindeutige Bilanz ziehen. Dass der Boom sich ungebrochen
          fortsetzt, ist offensichtlich. Der Dynamik aus Kapital und Gewinnaussichten
          haben die Gegner wenig entgegenzusetzen. Zumal die Regierung nicht willens
          scheint, die &laquo;Goldsucher&raquo; in ein juristisches Korsett zu
          zwingen.</P>

          <P>Selbst wenn die Geschichte der ecuadorianischen Shrimpsindustrie neben
          allen Erfolgen auch immer mit Umweltzerst&ouml;rung und Vertreibung
          verbunden ist, wird es ein Zur&uuml;ck zum Status Quo vor 1968 nicht geben.
          200.000 Hektar wieder aufzuforsten erscheint weder politisch durchsetzbar
          noch sozial sinnvoll.</P>

          <P>Sinn hingegen - da sind sich die Umweltorganisationen einig - w&uuml;rde
          eine Krabbenzucht machen, die sich auf ausgewiesene Gebiete
          beschr&auml;nkt, die den K&uuml;stenbewohner Raum zum &uuml;berleben
          l&auml;sst und die als Ziel nicht kurzfristige Gewinne formuliert, sondern
          &ouml;kologische Standards einzuhalten bereit ist.</P>

          <P>F&uuml;r eine derartige Selbstbeschr&auml;nkung sieht Lider Gongora
          allerdings keine Anzeichen. So gibt es f&uuml;r Umweltsch&uuml;tzer nur
          zwei Optionen: Dialog oder Boykott. Mit welcher Strategie die &Ouml;kologen
          eher ans Ziel kommen, dar&uuml;ber befinden auch die Shrimpskonsumenten in
          den Verbraucherl&auml;ndern.</P>

          <P>Machen diese ihre Kaufentscheidung vom Preis abh&auml;ngig,
          unterst&uuml;tzen sie damit automatisch jene, die sich zugunsten einer
          kosteng&uuml;nstigen Produktion &uuml;ber soziale und &ouml;kologische
          Bedenken hinwegsetzen.</P>

          <P>Ein Verzicht auf die Delikatessen hingegen verringert den
          Investitionsdruck auf die K&uuml;sten, zerst&ouml;rt aber auch
          Arbeitspl&auml;tze.</P>

          <P>Oder es werden nur Shrimps aus einer &ouml;kologisch wenig bedenklichen
          Produktion konsumiert. Noch gibt es daf&uuml;r kein Zertifikat, aber in
          Ecuador diskutieren Shrimpsproduzenten und westliche Eink&auml;ufer bereits
          &uuml;ber die Voraussetzungen eines Labels. Aber auch dann bleiben Fragen:
          Kann auf illegal besetztem Gel&auml;nde &uuml;berhaupt &ouml;kologisch
          produziert werden? Wer kontrolliert, ob sich die Farmer an die Richtlinien
          halten? Wer stellt die lukrativen Zertifikate aus, und wer kontrolliert die
          Mitarbeiter dieser korruptionsanf&auml;lligen Beh&ouml;rde?</P>

          <P>Fragen wie diese besch&auml;ftigen inzwischen auch die Eink&auml;ufer
          der Lebensmittelketten. Im Segment der kleinen Shrimps will Coop,
          &laquo;solange es unsere Kunden mitmachen&raquo;, den etwas teuren und
          &ouml;kologisch unbedenklicheren Shrimps aus Gr&ouml;nland den Vorzug vor
          der s&uuml;dlichen Aquakonkurrenz geben, sagt Pressesprecher Karl
          Weisskopf. Migros hingegen m&ouml;chte angesichts der kontroversen
          Diskussion um die ZuchtKrabben lieber gar keine Stellung abgeben. Das aber
          bedeutet wohl, dass hinter verschlossenen T&uuml;ren eifrig dar&uuml;ber
          diskutiert wird, ob der Import von Shrimps aus L&auml;ndern wie Ecuador
          noch opportun erscheint.</P>

          <P>&copy; Michael Netzhammer und die Global Aware Cooperative.</P>

          <P align="center"><A href=
          "mailto:mike@globalaware.org">mike@globalaware.org</A> &nbsp;&nbsp;<A href=
          "mailto:info@globalaware.org">info@globalaware.org</A></P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

