<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="AUTHOR" content="Thomas Nawroth">

    <TITLE>Happy Computer</TITLE>
  </HEAD>

  <BODY background="wolf1.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE border="0" width="100%" cellpadding="10" summary="">
      <TR>
        <TD>
          <BR> 
          <CENTER>
            <IMG src="mm_hc02a.gif" width="199" height="55" alt="Logo">
          </CENTER>

          <P>In dieser Reihe m&ouml;chte ich Euch in die Gute Alte Zeit
          entf&uuml;hren. Dem aktuellen Trend folgend, geht es auch hier zur&uuml;ck
          in die 80er. Dies mit Hilfe eines Computer-Magazins, mit dem Titel "Happy
          Computer". Ich besitze die Oktober-Ausgabe aus dem Jahre 1984. F&uuml;r
          mich ist es immer wieder faszinierend, darin zu schm&ouml;kern, und auch
          viele von Euch werden sicher an die eigenen Anf&auml;nge mit dem
          Home-Computer erinnert. Dieses Magazin war nicht auf einen bestimmtem
          Computer festgelegt, sondern informierte &uuml;ber alle aktuellen Typen.
          Also von Atari bis ZX81.</P>

          <P>Wie angek&uuml;ndigt diesmal ein Test der "Super Disk II", einem
          Doppel-Laufwerk f&uuml;r den Commodore 64 und VC20. Er ist in der
          Gegenwartsform gehalten, da er meinerseits aus dem Heft abgeschrieben
          wurde. Die Autoren sind am Schluss angef&uuml;hrt.</P> <HR>

          <P><IMG src="mm_hc02b.gif" align="left" width="312" height="191" alt=""
          hspace="6"> Der Markt f&uuml;r Diskettenlaufwerke, die zu Commodore 64 und
          VC 20 passen, ger&auml;t endlich in Bewegung. Als Alternative zur
          1541-Diskettenstation von Commodore wird nun ein Doppel-Laufwerk von MSD
          angeboten, die "Super Disk II" (kurz SD-II). Vorweg ein paar Worte zur
          "Standart-Diskettenstation" f&uuml;r Commodore 64 und VC 20, dem Modell
          1541. Dieses Ger&auml;t besticht vor allem durch seinen g&uuml;nstigen
          Preis und den eingebauten Mikroprozessor. Leider ist die 1541 erschreckend
          langsam und nicht gerade &uuml;bertrieben solide verarbeitet. Der Ruf nach
          Alternativen wurde unter den Commodore-Anwendern immer lauter.</P>

          <P>Die erste Begegnung mit der SD-II unmittelbar nach dem Auspacken erfreut
          das Auge des Betrachters: Das Ger&auml;t sieht n&auml;mlich ausgesprochen
          elegant aus. Die beiden Laufwerke wurden in ein wei&szlig;es Geh&auml;use
          gepackt, das einen unerwartet guten optischen Eindruck
          hinterl&auml;&szlig;t. Im Gegensatz zur 1541 werden die Disketten bei der
          SD-II hochkant eingef&uuml;hrt. F&uuml;r jedes Laufwerk gibt ein
          L&auml;mpchen &uuml;ber den Betriebszustand Auskunft. An der R&uuml;ckseite
          befinden sich neben dem Anschlu&szlig; f&uuml;r das Netzteil der
          Ein/Aus-Schalter, zwei serielle und ein IEEE-488-Bus. Nachdem die SD-II an
          den Computer angeschlossen und angeschaltet ist, kann es mit dem Betrieb
          losgehen - wahlweise &uuml;ber den IEEE- oder den seriellen Bus. Bei
          letzterem ist die SD-II genauso schnell (beziehungsweise langsam) wie die
          1541 von Commodore. Lohnender ist da der Anschlu&szlig; &uuml;ber den
          IEEE-Bus, der allerdings nur zusammen mit einem speziellen Interface
          funktioniert. Es lohnt sich aber, denn die SD-II wird damit n&auml;mlich
          gut doppelt so schnell, wie die 1541. Da&szlig; Geschwindigkeit keine
          Hexerei ist, zeigt sich auch bei diesem Beispiel: Eine Diskette wird in
          knapp zwei Minuten formatiert und vollst&auml;ndig kopiert. Hier deutet
          sich bereits an, da&szlig; die SD-II vor allem f&uuml;r Viel-Kopierer von
          Interesse ist.</P>

          <P><IMG src="mm_hc02c.gif" align="left" width="340" height="214" alt=""
          hspace="6"> Bei einem wichtigen Kriterium, der Kompatibilit&auml;t mit der
          Software, ist nicht alles eitel Sonnenschein. &Uuml;ber den IEEE-Bus kann
          n&auml;mlich keine kopiergesch&uuml;tzte Software zum Laufen gebracht
          werden, was so ziemlich alle Profi-Programme betrifft. &Uuml;ber den
          seriellen Anschlu&szlig; gibt es keine Schwierigkeiten mit dem Laden von
          kommerzieller Software. Der Grund liegt in den Eigenarten des DOS, das mit
          dem der VC 1541 nicht identisch ist und aus urheberrechtlichen Gr&uuml;nden
          auch gar nicht &uuml;bereinstimmen darf. Bei der Verarbeitung sammelt die
          1541 allerdings wieder Pluspunkte. Sie ist bei weitem nicht so
          &uuml;berhitzungsgef&auml;hrdet wie das Commodore-Modell, was angesichts
          der besonderen Kopier-F&auml;higkeiten auch n&ouml;tig ist.</P>

          <P>Die SD-II weist noch einen besonderen Gag auf: Mit dem Doppellaufwerk
          l&auml;&szlig;t sich ein Einzellaufwerk mit doppelter
          Speicherkapazit&auml;t, also satten 340 KByte, simulieren. N&uuml;tzlich
          ist dies insbesondere bei Textverarbeitung oder Dateiverwaltungen. Ist eine
          Daten-Diskette voll, schnurrt die Kollegin drauflos.
          Diskjockey-T&auml;tigkeiten geh&ouml;ren der Vergangenheit an, was eine
          erhebliche Erleichterung bedeutet.</P>

          <P>Alles im Leben hat seinen Preis, auch der Disketten-Komfort mit der
          SD-II. 1998 Mark inklusive Mehrwertsteuer, allerdings ohne das
          IEEE-Bus-Interface. Kein billiges Vergn&uuml;gen, aber das Doppellaufwerk
          bietet auch etwas f&uuml;r das Geld. Zu bem&auml;ngeln w&auml;re, da&szlig;
          das Einladen ruhig noch etwas flotter gehen k&ouml;nnte. Dennoch ein
          Doppellaufwerk, das f&uuml;r die versierten Computer-Fans sicherlich
          lohnend ist. Wer sich aber nur im kleinen Rahmen mit seinem Commodore
          besch&auml;ftigt, wird kaum auf seine Kosten kommen.</P>

          <P>F&uuml;r 1298 Mark gibt es auch ein Einzellaufwerk von MSD, den "Super
          Disk Drive I". Diese Diskettenstation stimmt mit der SD-II fast v&ouml;llig
          &uuml;berein. Der kleine aber bedeutende Unterschied, das fehlende zweite
          Laufwerk, ist die Ursache f&uuml;r den Preisunterschied von 600 Mark. Das
          Einzellaufwerk wird sich aber gegen die Konkurrenz der etablierten VC 1541
          schwer tun, denn f&uuml;r ein paar Hunderter mehr bekommt der Anwender
          "nur" eine &uuml;berhitzsichere, solide Verarbeitung und - bei
          entsprechendem Anschlu&szlig; - mehr Tempo geboten. Zweifelsohne
          l&ouml;bliche Eigenschaften, aber keine ausreichende Entsch&auml;digung
          f&uuml;r den h&ouml;heren Preis. Anders beim Doppellaufwerk SD-II. Es
          bringt viel Floppy-Komfort, der s&auml;mtliche anderen f&uuml;r Commodore
          64 und VC 20 angebotenen Diskettenstationen deutlich in den Schatten
          stellt.<BR> (Arnd W&auml;ngler/Manfred Kohlen/Heinrich Lenhardt)</P> <HR>

          <P>In der n&auml;chsten NoCover gibt es einen Testberich des
          Grafik-Adventures "Mask of the sun", f&uuml;r Commodore 64, Apple II und
          Atari-Computer.</P>

          <TABLE align="CENTER" border="3">
            <TR bgcolor="#ffffff">
              <TD><A href="mailto:">Thomas Nawroth</A></TD>
            </TR>
          </TABLE>
          <BR>
           
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

