<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Surfen via Satellit</B>
          </FONT></P>

          <CENTER>
            <IMG src="mm_internet.gif" width="450" height="295" alt="">
          </CENTER>

          <P>In der NC-104 regte ich an, &uuml;ber dieses Thema einen Artikel zu
          schreiben. Die NC-105 geht jetzt raus und keiner hat sich
          bem&uuml;&szlig;igt gef&uuml;hlt, dieses Thema aufzugreifen. Damit es nun
          nicht sofort in Vergessenheit ger&auml;t, schreibe ich ein paar Zeilen
          gem&auml;&szlig; Papierlage, denn von der praktischen Anwendung habe ich
          keinen blassen Schimmer. Und soviel wie ich verstanden habe, ist der
          Satellitenempfang bisher nur mittels PC m&ouml;glich.</P>

          <P>Vorab ein paar Bemerkungen zum Geschwindigkeitsgewinn. Die Zauberformel
          f&uuml;r den Hochgeschwindigkeits Webzugang hei&szlig;t Digital Subscriber
          Line, kurz DSL. Die in Deutschland am weitesten verbreitete DSL-Variante
          setzt auf die Telefonnetze der Telekom auf und wird entsprechend T-DSL
          genannt. Mit dem Standardanschluss von T-DSL (max. 768 kbit/s schnell)
          sausen Downloads fast 14-mal schneller als per Modem (56 kbit/s) auf den
          Rechner. Der Download eines zehn Megabyte gro&szlig;en Filmtrailers etwa
          dauert mit T-DSL lediglich 1,44 Minuten. Modem-Nutzer m&uuml;ssen hingegen
          fast 24 Minuten warten, bis die Filmvorschau vollst&auml;ndig auf der
          Festplatte liegt. Und wenn ich bei diesen Zahlen meine Telefonleitung
          anschaue, da schaffe ich in der Zeit noch nicht einmal 4 MB Daten. Hier
          nochmals eine kleine Tabelle als &Uuml;bersicht aus der mir vorliegenden
          Brosch&uuml;re:</P>

          <TABLE border="3" cellspacing="1" cellpadding="4" summary="" align="center"
          width="80%">
            <TR>
              <TH colspan="2">
                <H3><B>So schnell geht der Download einer<BR>
                 Musik-CD mit T-DSL via Satellit</B></H3>
              </TH>
            </TR>

            <TR>
              <TD align="right"><B>Internet via Satellit</B> <BR>
              768 kbit/s</TD>                                     
              <TD><B>- &nbsp; 10 Minuten</B> </TD>
            </TR>

            <TR>
              <TD align="right"><B>ISDN/Kanalb&uuml;ndelung</B><BR>
              128 kbit/s</TD>                                      
              <TD><B>--------- &nbsp; 1h 30 Min.</B></TD>
            </TR>

            <TR>
              <TD align="right"><B>ISDN</B><BR>
              64 kbit/s</TD>
              <TD><B>------------ &nbsp; 2h 5 Min.</B></TD>
            </TR>

            <TR>
              <TD align="right"><B>Modem</B><BR>
              56 kbit/s</TD>
              <TD><B>-------------- &nbsp; 2h 23 Min.</B></TD>
            </TR>

            <TR>
              <TD colspan="2"><BR>
              Vergleich der Download-Zeit f&uuml;r eine 60 MegaByte gro&szlig;e Datei,
              60 MB entsprechen etwa einer im MP3-Format komprimierten Musik-CD.</TD>
            </TR>
          </TABLE>

          <P>Doch was tun, wenn man nicht zu den 90% der Telekom-Kunden geh&ouml;rt,
          die die M&ouml;glichkeit zum Nutzen von T-DSL &uuml;ber Telefonkabel haben?
          Die Antwort: Holt euch das Internet aus dem All.</P>

          <P>Seid Anfang Mai betreibt die Telekom ihren Breitband Internetzugang auch
          &uuml;ber die Satelliten des europaweit f&uuml;hrenden Satellitenbetreibers
          ASTRA. Damit kommen nun auch Surfer in l&auml;ndlichen Regionen in den
          Genuss von T-DSL.</P>

          <P>Technische Voraussetzung f&uuml;r den Internetzugang aus dem All sind
          eine handels&uuml;bliche digitaltaugliche Satelliten Empfangsanlage und
          eine Sat-Karte bzw eine USB-Box f&uuml;r den PC.</P>

          <P>Einziges Manko: Nur der Dowmnload wird &uuml;ber Satellit abgewickelt.
          Alle Uploads, also auch der Versand von E-Mails, erfolgen entsprechend
          langsamer &uuml;ber die normale Telefonleitung. Man ben&ouml;tigt also
          f&uuml;r T-DSL via Satellit auch weiterhin zus&auml;tzlich einen ganz
          normalen Webzugang &uuml;ber Modem oder ISDN und einen Provider.</P>

          <P>Die Auswahl des Providers f&uuml;r den R&uuml;ckkanal h&auml;ngt
          zun&auml;chst von den pers&ouml;nlichen Bed&uuml;rfnissen ab. Voraussetzung
          ist aber in jedem Fall, dass der Provider das von T-DSL via Satellit
          verwendete &Uuml;bertragungsprotokoll PPP unterst&uuml;tzt. Denn
          w&auml;hrend der Downloadphase via Satellit muss parallel immer der
          R&uuml;ckkanal online sein. Wer also den volumenunabh&auml;ngigen
          T-DSL-via-Satellit Tarif nutzt und quasi rund um die Uhr gro&szlig;e
          Dateien aus dem Netz herunterl&auml;dt, sollte f&uuml;r den R&uuml;ckkanal
          auch einen Vielsurfer-Tarif oder eine Flatrate abgeschlossen haben.</P>

          <P>Pluspunkt: Wer seinen Highspeed-Webzugang &uuml;ber Satellit einrichtet,
          schl&auml;gt zwei Fliegen mit einer Klappe. Mit der f&uuml;r das
          Sat-Internet erforderlichen digitaltauglichen Satellitenanlage kann
          n&auml;mlich auch das gesamt frei verf&uuml;gbare digitale TV-Angebot mit
          rund 100 Programmen, 120 Radiostationen sowie &uuml;ber 80 speziellen
          Radio-Streams empfangen werden - im Gegensatz zum Kabelanschluss fast
          gratis.</P>

          <P>Viele Infos, etwa &uuml;ber digitalen TV- und Radio-Empfang, Internet
          via Satellit, das ASTRA-Satellitensystem und die Rechtslage beim
          Satellitenempfang hat der Satellitenbetreiber ASTRA auf seiner
          deutschsprachigen Homepage zusammengestellt: <B>www.astra.de</B></P>

          <H3><B>Was ben&ouml;tigt man nun f&uuml;r den Umstieg?</B></H3>

          <P>Am einfachsten ist der Umstieg f&uuml;r Nutzer, die bereits TV und Radio
          &uuml;ber einen ASTRA-Satelliten empfangen. Diejenigen k&ouml;nnen ihre
          alte Sch&uuml;ssel weiterverwenden. Zur Internetnutzung und f&uuml;r den
          Empfang digitaler Programme muss der LNB, das ist der Empf&auml;nger vorn
          an der Sch&uuml;ssel, digitaltauglich sein. Empfehlenswert ist mindestens
          ein Universal Doppel-LNB, damit man gleichzeitig TV oder Radio einschalten
          und surfen kann.</P>

          <P>F&uuml;r den PC ben&ouml;tigt man eine DVB-S PC-Karte oder eine externe
          DVB-S USB-Box. Die Karten, die auch als digitaler Videorecorder fungieren,
          k&ouml;nnen selbst von Laien schnell eingebaut werden. Die mitgelieferte
          Software erm&ouml;glicht die Aufnahme und Wiedergabe von TV-Sendungen. Die
          Brosch&uuml;re spricht hier nur von PC mit mindestens Pentium II (233 MHz)
          und 64 MB RAM. F&uuml;r fl&uuml;ssigeren TV-Empfang wird auf Rechner mit
          700 MHz Taktung verwiesen. Und nat&uuml;rlich auch ausreichenden Speicher
          auf der Festplatte, denn eine Folge "Lindenstra&szlig;e" belegt ca 1,5 GB
          Speicherplatz.</P>

          <P>G&uuml;nstige Hardware f&uuml;r den Satelliten-Empfang am PC vertreibt
          z.B. der M&uuml;nchner Online-Shop Satelco (<B>www.satelco.de</B>).
          F&uuml;r Versand und Verpackung werden pro Lieferung 8,90 Euro berechnet.
          Die Bezahlung erfolgt ausschlie&szlig;lich per Nachnahme.</P>

          <P>Noch etwas zu der DVB-S Karte (Digital Video Broadcasting-Satellite).
          Wer auf Sender des Pay-TVs gehen will, ben&ouml;tigt zus&auml;tzlich
          f&uuml;r die Entschl&uuml;sselung eine Common Interface (CI) Karte.</P>

          <P>&Uuml;brigens, was ich ganz vergessen habe zu erw&auml;hnen: Das sind
          die Preise beim Surfen. W&auml;hrend des Betriebs des Internetzugangs
          &uuml;ber Satellit muss auch der normal Zugang &uuml;ber Telefon geschaltet
          sein (R&uuml;ckkanal), das sind so ca 1 Cent die Minute je Provider
          (f&uuml;r die, die keinen Festtarif wie z.B. Flatrate haben). Die T-DSL
          Pauschale ist auf ein bestimmtes Volumen begrenzt, also f&uuml;r eine
          Download-Menge bis 500 MB zahlt der Kunde im Basic-Tarif 19,90 Euro im
          Monat. Jedes MB dar&uuml;ber kostet zus&auml;tzlich 5 Cent. Der Tarif ohne
          Volumenbegrenzung f&uuml;r 39,90 Euro monatlich rechnet sich erst ab 900 MB
          Downloadmenge. Einmalige Ausgaben sind die Hardware zum Empfang, ca 200
          Euro, wer noch keine Sat-Anlage hat, sonst 60 Euro f&uuml;r die PC-Karte
          und eventuell weiter 65 Euro f&uuml;r den notwendigen digitalen
          Doppel-LNB.</P>

          <P>Weitere Links f&uuml;r Infos:<BR>
          <B>www.telekom.de/tdslsat</B> oder Hotline: 0800/3309000<BR>
          <B>www.hauppauge.de</B> einer der f&uuml;hrenden Anbieter von PC-Karten
          f&uuml;r TV-Empfang<BR>
          <B>www.pinnaclesys.com</B> ein weiterer Anbieter<BR>
          <B>www.pctvsat.com</B> spezielle Homepage f&uuml;r DVB-S PC-Karten.<BR>
          <B>www.tvtv.de</B> Online Programmf&uuml;hrer f&uuml;r analoge und
          digitale TV-Sender.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

