<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Chandra</B></FONT></P>

          <P align="center"><IMG src="st_chandra1.jpg" height="370" width="545"
          border="0" alt=""></P>

          <P>Chandra ist der Name eines Beobachtungssatelliten, der mittels
          R&ouml;ntgenstrahlen den Schleier von explodierende Sternen, Pulsaren,
          Quasaren und Schwarzen L&ouml;chern heben soll. So die freie
          &Uuml;bersetzung der Beschreibung auf der Website
          <B>&lt;www.nationalgeographic.com&gt;</B></P>

          <P><B>Get a taste of what awaits you in print from this compelling
          excerpt.</B><BR> Das ist die &Uuml;berschrift &uuml;ber einen Artikel von
          Barbara W. McConnell und ich werde nun versuchen mit eigenen Worten eine
          "Kostprobe" zu geben. Verborgen vor den Blicken der erdgebundenen
          Sternenbeobachter enth&uuml;llen R&ouml;ntgenstrahlen die meisten
          "st&uuml;rmischen" Ereignisse des Kosmos mittels der scharfen "Augen" von
          Chandra.</P>

          <P>Das Chandra R&ouml;ntgen-Observatorium, benannt nach dem ber&uuml;hmten
          Astrophysiker Subrahmanyan Chandrasekhar, ist das dritte der vier
          gro&szlig;en NASA Observatorien welches das funktionsunf&auml;hige Compton
          Gamma Ray Observatorium seit 23. Juli 1999 ersetzt hat.</P>

          <P><IMG src="st_chandra2.jpg" width="70" height="60" alt= "" align="left"
          hspace="6"> Die hochaufl&ouml;sende Kamera hat ihre ersten Bilder
          geschossen. Zum Zwecke der Fokussierung wurde sie zun&auml;chst auf LMC X-1
          gerichtet, eine punktf&ouml;rmige Quelle von R&ouml;ntgenstrahlen, die etwa
          180&nbsp;000 Lichtjahre von der Erde entfernt ist. Sie geh&ouml;rt zur
          Gro&szlig;en Magellanschen Wolke, einer unserer Milchstra&szlig;e
          benachbarten Galaxie. Nach der &Uuml;berpr&uuml;fung der
          Sch&auml;rfeeinstellungen richteten die Wissenschaftler die Kamera auf
          N132D, einen &Uuml;berrest einer Supernova, der sich ebenfalls in der
          Gro&szlig;en Magellanschen Wolke befindet. Das Aufl&ouml;sungsverm&ouml;gen
          der Kamera betr&auml;gt eine halbe Bogensekunde - damit k&ouml;nnte aus
          knapp zwanzig Kilometern Entfernung ein Stoppschild entziffert werden.</P>

          <P><IMG src="st_chandra4.jpg" width="411" height="126" alt="" align="left"
          hspace="6"> Chandra hat Forschern den bislang detailliertesten Einblick in
          das Zentrum der Milchstra&szlig;e gew&auml;hrt. Auf dem Bild des 400 mal
          900&nbsp;Lichtjahre gro&szlig;en Ausschnitts in
          25&nbsp;000&nbsp;Lichtjahren Entfernung sind hunderte von Wei&szlig;en
          Zwergen, Neutronensternen und Schwarzen L&ouml;chern zu sehen. Sie befinden
          sich in einer nur zehn Millionen Grad hei&szlig;en Gaswolke im Umfeld des
          superschweren Schwarzen Lochs im Zentrum unserer Galaxie, das sich in dem
          hellen Fleck in der Bildmitte befindet. Bislang war man davon ausgegangen,
          dass die Temperaturen hier um die 100&nbsp;Millionen Grad liegen. Die
          hei&szlig;en Gase werden von sterbenden Sternen ausgesto&szlig;en und in
          &auml;u&szlig;ere Regionen der Milchstra&szlig;e geschleudert.</P>

          <P>Es ist ein detaillierter Blick auf zwei Arme hei&szlig;en Gases in der
          Galaxie NGC 4636 gelungen. Vom Zentrum der Galaxie erstrecken sie sich
          symmetrisch 25 000 Lichtjahre hinaus durch eine Wolke aus einem mehrere
          Millionen Grad Celsius hei&szlig;en Gas und k&uuml;nden offenbar von einem
          gewaltigen Ausbruch. Die Arme selbst sind dabei sogar noch 30 Prozent
          hei&szlig;er als das umgebende Gas. Sie scheinen den Rand einer Schockwelle
          zu markieren, die mit 700 Kilometern pro Sekunde durch die Galaxie
          fegt.</P>

          <P>Dieser Ausbruch k&ouml;nnte nach Meinung der Forscher typisch f&uuml;r
          einen immer wieder kehrenden Zyklus sein, der die Galaxie in einem Zustand
          des Aufruhrs beh&auml;lt. Der Zyklus beginnt, wenn die hei&szlig;e
          Gaswolke, die die Sterne der Galaxie einh&uuml;llt, sich abk&uuml;hlt,
          kollabiert und das Gas in Richtung des Schwarzen Lochs im Zentrum
          f&auml;llt. Der Materiestrom f&uuml;hrt schlie&szlig;lich zur Explosion,
          die bewirkt, dass sich die H&uuml;lle wieder stark erhitzt und der ganze
          Zyklus von neuem beginnt.</P>

          <P><IMG src="st_chandra3.jpg" width="70" height="105" alt="" align="left"
          hspace="6"> In zehn Milliarden Lichtjahren Entfernung entdeckte das
          <I>Chandra X-ray Observatory</I> der NASA einen Galaxienhaufen, der sich
          &uuml;ber mindestens 600&nbsp;000&nbsp;Lichtjahre erstreckt. Die Entfernung
          von 3C294 liegt somit um 40&nbsp;Prozent &uuml;ber der des bisherigen
          Rekordhalters. Die Astronomen des <I>Institute of Astronomy</I> im
          englischen Cambridge erkannten das ferne Objekt aufgrund der
          R&ouml;ntgenstrahlung, die aus dem Zentrum einer bereits bekannten
          Radioquelle stammt. Zudem deuten m&auml;chtige Gaswolken auf eine
          Anh&auml;ufung zahlreicher Galaxien. Diese gigantischen Wolken umgeben
          solche Galaxienhaufen und heizen sich infolge der hohen
          Anziehungskr&auml;fte auf. Nun erhoffen sich die Forscher neue
          Aufschl&uuml;sse &uuml;ber die Evolution des seinerzeit erst zwei oder drei
          Milliarden Jahre jungen Universums.</P>

          <P>Die Aufnahmen stellen nach Aussage von Stephen Murray vom
          <I>Harvard-Smithsonian Center for Astrophysics</I> nur vorl&auml;ufige
          Testbeobachtungen dar, aber die Wissenschaftler sind mit der Qualit&auml;t
          der Aufnahmen sehr zufrieden.</P>

          <P>Auf dem Bild ist der im Durchmesser achtzig Lichtjahre gro&szlig;e,
          reich strukturierte &Uuml;berrest - oder die H&uuml;lle - aus Gas mit einer
          Temperatur von zehn Millionen Grad Celsius zu sehen. Eine derartige
          H&uuml;lle in der Nachbarschaft unserer Sonne w&uuml;rde mehr als
          f&uuml;nfzig nahegelegene Sterne umfassen. Die Materiemenge in dem
          hei&szlig;en Gas&uuml;berrest entspricht 600 Sonnen.</P>

          <P>Der &Uuml;berrest des explodierten Sterns scheint mit einer riesigen
          Molek&uuml;lwolke zu kollidieren, wodurch die Aufhellung am unteren Rand
          des Restes entsteht. Die mit einem Radioteleskop sichtbare
          Molek&uuml;lwolke hat eine Masse von 300&nbsp;000 Sonnen. Die relativ
          schwache R&ouml;ntgenstrahlung oben links auf dem Bild zeigt, da&szlig; die
          Schockwelle sich in eine weniger dichte Region am Rand der
          Molek&uuml;lwolke ausdehnt. In der Mitte sind eine Reihe von kleinen,
          kreisf&ouml;rmigen Strukturen zu erkennen, und im oberen Teil des
          &Uuml;berrests deutet sich eine gro&szlig;e Schleife an.</P>

          <P>Die Auswertung der Daten wird noch einige Zeit in Anspruch nehmen. "Das
          Bild ist so strukturreich, dass es eine Weile dauern wird, bis wir
          herausgefunden haben, was wirklich abl&auml;uft", sagt Murray. "Es
          k&ouml;nnten mehrere Supernovae oder absorbierende Wolken in der Umgebung
          der Supernova sein." Die Wissenschaftler hoffen, dass sie dann eine
          Erkl&auml;rung f&uuml;r die besondere Gestalt des &Uuml;berrestes
          entdecken.</P>

          <P>Der Chandra hat erstmalig ein R&ouml;ntgenbild des Planeten Mars
          geliefert. Die R&ouml;ntgenstrahlung des roten Planeten wird durch
          Fluoreszenz in der Hochatmosph&auml;re erzeugt. Hochenergetische
          R&ouml;ntgenstrahlung von der Sonne schl&auml;gt in rund 120 Kilometern
          H&ouml;he Elektronen aus der inneren H&uuml;lle von Sauerstoff-Atomen
          heraus. Wenn die Elektronen wieder auf ihre alten Bahnen zur&uuml;ckkehren,
          senden sie die zuvor aufgenommene Energie als R&ouml;ntgenstrahlung aus.
          Die Gesamtenergie der vom Mars ausgesendeten R&ouml;ntgenstrahlung
          betr&auml;gt lediglich vier Megawatt - dass entspricht zwar etwa der
          Leistung von Zehntausenden von medizinischen R&ouml;ntgenger&auml;ten, ist
          astronomisch gesehen aber sehr wenig. Chandra hat den Nachbarplaneten unter
          optimalen Bedingungen beobachtet: Der Mars befand sich zum Zeitpunkt der
          Messungen mit einem Abstand von 70 Millionen Kilometern relativ nahe bei
          der Erde und war au&szlig;erdem nahe dem sonnenn&auml;chsten Punkt seiner
          Umlaufbahn. W&auml;hrend der R&ouml;ntgenbeobachtungen entwickelte sich auf
          dem Mars ein gewaltiger Staubsturm, der schlie&szlig;lich rund die
          H&auml;lfte des Planeten einh&uuml;llte. Durch den Sturm kam es jedoch
          nicht zu einer Ver&auml;nderung der R&ouml;ntgenintensit&auml;t. Daraus
          konnten die Astronomen den Schluss ziehen, dass der Staub bei derartigen
          St&uuml;rmen offenbar nicht bis in die Hochatmosph&auml;re aufsteigt. 
          Die Planetenforscher stie&szlig;en au&szlig;erdem auf einen schwachen
          R&ouml;ntgen-Halo, der sich bis zu 7000 Kilometer weit um den Mars
          erstreckt. Vermutlich wird er durch die Kollision des Sonnenwinds mit aus
          der Marsatmosph&auml;re entweichenden Atomen verursacht. </P> 

          <P>Einem internationalen Forscherteam gelang es jetzt erstmalig, die
          Existenz von gleich zwei supermassiven Schwarzen L&ouml;chern in einer
          einzigen Galaxie nachzuweisen. Die Astronomen sp&uuml;rten die
          Schwerkraftmonster mit Hilfe des R&ouml;ntgensatelliten Chandra auf. Sie
          befinden sich in der au&szlig;ergew&ouml;hnlich hellen Galaxie NGC 6240 im
          Sternbild Schlangentr&auml;ger, 400 Millionen Lichtjahre von der Erde
          entfernt. In einigen hundert Millionen Jahren kollidieren die beiden
          Schwarzen L&ouml;cher nach Angaben der Astronomen in einer gewaltigen
          Katastrophe miteinander. Fr&uuml;here Beobachtungen im optischen
          Bereich hatten bereits gezeigt, dass NGC 6240 zwei helle Kernregionen
          besitzt. Au&szlig;erdem war bekannt, dass im Zentrum der Galaxie eine
          R&ouml;ntgenquelle sitzt - vermutlich ein gro&szlig;es Schwarzes Loch.
          &quot;Dank Chandras hervorragender F&auml;higkeiten war es uns nun
          erstmalig m&ouml;glich, beide Kerne im R&ouml;ntgenbereich zu erkennen und
          die Eigenschaften der R&ouml;ntgenstrahlung beider Kerne zu
          analysieren&quot;, erl&auml;utert G&uuml;nther Hasinger vom
          Max-Planck-Institut f&uuml;r Extraterrestrische Physik, einer der
          beteiligten Forscher. Zur &Uuml;berraschung der Astronomen zeigte sich
          bei den Chandra-Beobachtungen, dass nicht nur einer der Kerne, sondern
          beide ein supermassives Schwarzes Loch enthalten. Vermutlich ist NGC 6240
          aus der Verschmelzung zweier kleinerer Galaxien entstanden, die beide
          bereits ein gro&szlig;es Schwarzes Loch im Zentrum besa&szlig;en. Die
          beiden Schwarzen L&ouml;cher sind jetzt noch 3000 Lichtjahre voneinander
          entfernt und n&auml;hern sich langsam weiter einander an. Bei der
          Verschmelzung der Schwerkraftmonster in ferner Zukunft kommt es zur
          Aussendung von so genannten Gravitationswellen. Mit Hilfe gigantischer
          Detektoranlagen hoffen die Astronomen in den kommenden Jahren, solche
          Schwingungen des Raumes nachweisen zu k&ouml;nnen. </P>


          <P><IMG src="st_chandra2.gif" width="120" height="90" alt="" align="left"
          hspace="6"> Die NASA feiert in diesen Tagen den zweiten Geburtstag ihres
          R&ouml;ntgenteleskops Chandra. W&auml;hrend der letzten beiden Jahre gelang
          es mit seiner Hilfe unter anderem, den am weitesten entfernten
          Galaxiehaufen und eine neue Klasse Schwarzer L&ouml;cher auszumachen. Laut
          Martin Weisskopf vom <I>Marshall Space Flight Center</I> der NASA in
          Huntsville sowie dem Projektmanager Tony Lavoie h&auml;tte Chandra damit
          alle Hoffnungen erf&uuml;llt. Wegen des Erfolges verl&auml;ngert die NASA
          die urspr&uuml;nglich f&uuml;r f&uuml;nf Jahre geplante Mission auf zehn.
          Lavoie lobte nicht nur die Leistungsf&auml;higkeit des Teleskops, sondern
          auch die Zusammenarbeit der Forscher im Team und freut sich darauf, weitere
          Jahre mit Chandra arbeiten zu k&ouml;nnen.</P>

          <P>Verwendete Quellen: <BR>
          <B>&lt;www.nationalgeographic.com&gt;</B><BR>
          <B>&lt;www.wissenschaft-online.de&gt;</B><BR>
          <B>&lt;www.astrologie.de&gt;</B></P>

        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

