<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Kinder fragen<BR>
           Nobelpreistr&auml;ger antworten</B></FONT><BR>
          von Bettina Stiekel (Hrsg)</P>

          <H2 align="center"><FONT color="#ff0000"><B>Wer nicht fragt, bleibt
          dumm!</B></FONT></H2>

          <P align="center"><B>Warum ist der Pudding weich und der Stein hart?<BR>
          Weshalb gibt es Jungen und M&auml;dchen?<BR> Und wie lange dreht sich die
          Erde noch?</B></P>

          <P><IMG src="st_kinder0.gif" width="199" height="312" alt="Bucheinband"
          align="left" hspace="6"> Es gibt Fragen die so einfach sind, dass jedes
          Kind sie stellen kann. Beantworten hingegen k&ouml;nnen sie nur wenige:
          Nobelpreistr&auml;ger aus allen Kategorien - von Medizin &uuml;ber Physik
          bis hin zur Literatur - erkl&auml;ren in diesem Buch verst&auml;ndlich und
          verbl&uuml;ffend einfach die komplexen Probleme unserer Zeit und behandeln
          in &uuml;ber 20 Beitr&auml;gen fundamentale Fragen, auf die nicht nur
          Eltern neugieriger Kinder immer gefasst sein m&uuml;ssen. Aus einer Serie
          des S&uuml;ddeutsche Zeitung Magazins enstand dieses Lesebuch von
          Wissenschaftlern, Politikern und K&uuml;nstlern f&uuml;r Klein und
          Gro&szlig;, das spielerisch wieder Lust an guter Allgemeinbildung
          vermittelt.</P> Das Vorwort dieses Buches hat Axel Hacke geschrieben und
          dies ist ihm m.E. vortrefflich gelungen.<BR clear="all"> <HR>

          <P>Es gibt so Tage, da &uuml;berrascht mich Luis, mein Sohn, pl&ouml;tzlich
          mit einer Frage, dieser hier zum Beispiel, erst neulich: "Papa, wozu bist
          du eigentlich da?"</P>

          <P>Ich rang kurz um Fassung, dann entschloss ich mich zur Gegenfrage: "Was
          glaubst du denn, wozu ich da bin?"</P>

          <P>Er runzelte seine f&uuml;nfj&auml;hrige Stirn, schloss kurz die Augen,
          gr&uuml;belte hierhin und dorthin, dann sagte er langsam: "Um mich morgens
          in den Kindergarten zu bringen.... Um mir abends vorzulesen .... Um mir das
          Badewasser einzulassen .... Um mit mir zu spielen ...."</P>

          <P>Was f&uuml;r eine wunderbare, zutiefst sinnvolle Existenz, dachte ich
          seufzend. Wenn ich den kleinen Luis nicht h&auml;tte, wenn ich ihn nicht in
          den Kindergarten bringen k&ouml;nnte, ihm abends nicht vorlesen
          d&uuml;rfte, ihm nicht das Badewasser einlie&szlig;e, nicht mit ihm spielte
          - mein Leben w&auml;re nichts.</P>

          <P>"Und wozu bist du da?", fragte ich ihn.</P>

          <P>"Um zu spielen", sagte er.</P>

          <P>"Na dann lass uns spielen", sagte ich.</P>

          <P>Und wir spielten, vielleicht Papa-ist-ein-Pferd oder Fu&szlig;ball im
          Flur oder auch blo&szlig; Mikado - ich wei&szlig; es nicht mehr. Es ist
          jetzt auch nicht so wichtig.</P>

          <P>Was ich sagen wollte, das ist, <B><I>erstens:</I></B> Kinder stellen
          immer die allergr&ouml;&szlig;ten Fragen, ganz en passant. Welcher
          Erwachsene w&uuml;rde eine Frage "Wozu bist du eigentlich da?",
          genaugenommen die Frage schlechthin, an einen anderen Erwachsenen
          richten?</P>

          <P><B><I>Zweitens:</I></B> Sehr oft wissen wir nun mal keine Antwort auf
          die allergr&ouml;&szlig;ten Fragen. Woher soll ich wissen, wozu ich da bin?
          Ich wei&szlig; ja morgens oft nicht mal, ob ich lieber Kaffee oder Tee zum
          Fr&uuml;hst&uuml;ck h&auml;tte.</P>

          <P><B><I>Drittens:</I></B> Obwohl (oder weil?) ich keine Antwort hatte,
          passierte danach etwas. Wir spielten. Wer wei&szlig;, ob wir miteinander
          gespielt h&auml;tten, wenn mir Luis nicht diese (oder eine andere Frage)
          gestellt h&auml;tte. Fragen bringen etwas in Gang. Sie sind der Motor des
          Lebens. Allein die Tatsache, dass eine Frage gestellt wird und man nach
          einer Antwort zu suchen beginnt, bringt die Fantasie auf Trab. Und
          vielleicht ist die Tatsache, dass wir spielten, sogar die richtige Antwort
          auf diese Frage.</P>

          <P>Vielleicht sind wir da, um zu spielen.</P>

          <P>Was war eigentlich die erste Frage &uuml;berhaupt, die auf Erden
          gestellt wurde? Und wer hat sie gestellt?</P>

          <P>Gott? O nein, nicht Gott. Gott hat mit Ausrufezeichen gesprochen. Es
          werde Licht! Es werde eine Feste inmitten der Wasser und sie scheide die
          Wasser voneinander! Das Wasser unter dem Himmel sammle sich an einem Ort,
          dass das Trockene sichtbar werde! Na, und so weiter. Wie Gott eben
          redet.</P>

          <P>Der Mensch? Ach was, der Mensch fragt erst sehr sp&auml;t. Kain stellte
          die erste Menschenfrage, als er seinen Bruder erschlagen hatte und deshalb
          von Gott verh&ouml;rt wurde: Wo denn Abel stecke?! "Bin ich denn meines
          Bruders H&uuml;ter?", fragte Kain, keine richtige, mehr eine rhetorische
          Frage. Sehr trotzig.</P>

          <P>Nein die erste Frage hat die Schlange gestellt, meiner Meinung nach
          jedenfalls.</P>

          <P>"... und sie sprach zum Weibe: Gott hat wohl gar gesagt: 'Ihr d&uuml;rft
          von keinem Baum des Gartens essen!'" Da fehlt zwar in der Bibel das
          Fragezeichen, aber zweifellos handelt es sich um eine Frage: Ob Gott das
          wirklich gesagt habe?</P>

          <P>Die Folgen sind bekannt. Adam und Eva a&szlig;en vom Baum der
          Erkenntnis, erkannten, dass sie nackt waren (das wussten sie ja vorher
          nicht) und mussten das Paradies verlassen. So fing unser ganzes Elend mit
          einer Schlangenfrage an - obwohl, was hei&szlig;t hier Elend? M&ouml;chte
          man wirklich den ganzen Tag im Paradies herumlaufen und nicht mal wissen,
          dass man nackt ist?</P>

          <P>Hmmmmm</P>

          <P>Jedenfalls versteht der Mensch seither die Welt nicht mehr und muss
          Fragen stellen. Woher kommen wir? Wohin gehen wir? Was denkst du gerade,
          Liebling? Ist da drau&szlig;en im Weltall noch jemand? Haben Sie noch ein
          Doppelzimmer frei? Warum ist der Schnee wei&szlig;? Oder, mit Woody Ellen:
          Gibt es ein Leben nach dem Tode? Und wenn ja, werden sie dort in der Lage
          sein, mir einen Zwanziger zu wechseln?</P>

          <P>Gro&szlig;e Fragen, kleine Fragen, dumme Fragen, kluge Fragen,
          bl&ouml;de Fragen, gute Fragen, einfache Fragen, schwere Fragen - das ganze
          Leben ist voller Fragen. Als ich ein kleiner Junge war, gab es f&uuml;r
          mich nichts Sch&ouml;neres, als mit meinem Vater Hauptstadtraten zu
          spielen, also: Mein Vater sagte ein Land und fragte, wie die Hauptstadt
          hei&szlig;e, oder er nannte eine Hauptstadt und fragte nach dem Land dazu.
          F&uuml;r jede richtige Antwort: ein Groschen. Das war wunderbar.</P>

          <P>In sehr erweiterter, ver&auml;nderter Form wird das Spiel (mit
          h&ouml;heren Belohnungen) seit eh und je im Fernsehen gespielt, man nennt
          das Quiz. Fr&uuml;her hie&szlig;en die Frageonkels Maegerlein,
          Helmensdorfer oder Kuhlenkampff, heute hei&szlig;en sie G&uuml;nther Jauch,
          J&ouml;rg Pilawa oder Christian Clerici, die die Fragen stellen. Das
          deutsche Volk will gefragt werden. Und immer ist in diesem Spiel alles
          enthalten, was das Fragen und das Antworten f&uuml;r den Menschen so
          reizvoll macht: die Macht, fragen zu d&uuml;rfen; der Stolz, eine Antwort
          zu wissen; die Lust, den zappeln zu sehen, der um eine Antwort ringt; die
          Neugier; das Wissenwollen.</P>

          <P>Der Mensch ist Mensch, weil er Fragen stellt, erstens. Und zweitens:
          weil er Antworten geben m&ouml;chte.</P>

          <P>Gro&szlig;e Frage, kleine Fragen. Die Fragen in diesem wunderbaren Buch
          sind alle gro&szlig;, Fragen, von der Art, wie Kinder sie stellen und
          Erwachsene sie auch stellen w&uuml;rden, w&auml;re es ihnen nicht einfach
          peinlich, die Kinder k&ouml;nnten denken, sie w&uuml;ssten irgendetwas
          nicht. Wie lange dreht sich die Erde noch? Warum gibt es Krieg? Was ist
          Liebe? Warum kennt ein Indianer keinen Schmerz? Warum kann ich mich nicht
          nur von Pommes frites ern&auml;hren? Warum m&uuml;ssen Papa und Mama
          arbeiten gehen? Was ist Luft?</P>

          <P>Um so gro&szlig;e Fragen zu beantworten, fragt man am besten die
          Gr&ouml;&szlig;ten, jene, die es wirklich wissen m&uuml;ssen, denen keiner
          &uuml;ber ist, wenn es um gro&szlig;e Fragen geht. Das sind nat&uuml;rlich
          die Nobelpreistr&auml;ger, denn wenn sie nicht die Gr&ouml;&szlig;ten ihrer
          F&auml;cher w&auml;ren -h&auml;tten sie dann die Nobelpreise? Und wozu
          haben wir die Nobelpreistr&auml;ger, wenn wir ihnen nicht einmal so 'n paar
          Fragen stellen d&uuml;rfen? In welchem Buch sonst bekommt man sowohl die
          Grundlagen der Festk&ouml;rperphysik auf ein paar Seiten verst&auml;ndlich
          erkl&auml;rt als auch eine klare Antwort auf die Gro&szlig;frage, was Liebe
          sei? Und dann erf&auml;hrt man auch noch in aller K&uuml;rze, warum
          eigentlich die Bl&auml;tter an den B&auml;umen gr&uuml;n sind und nicht
          blau oder schwarz-wei&szlig; kariert?</P>

          <P>Es gibt so Tage, es gibt so Fragen, da ist es mit Ausweichen, mit einer
          Gegenfrage, mit Spielen nicht getan. Da wollen Kinder eine Antwort und sie
          haben das Recht darauf, sonst h&ouml;ren sie irgendwann auf zu fragen und
          das w&auml;re nun wirklich das Schlimmste, was passieren kann: dass Kinder
          keine Fragen mehr stellen.</P>

          <P>In Pu der B&auml;r gibt es eine Stelle, da kommt Pu zur Eule, weil er
          eine Frage hat, und er findet an der T&uuml;r der Eule einen
          T&uuml;rklopfer, an dem ein Zettel h&auml;ngt mit der Aufschrift:</P>

          <P>"BTTE KLNGLN FALS NTWORT RWARTET WIRT."</P>

          <P>Und es gibt einen Klingelzug mit einem Zettel und einer anderen
          Aufschrift:</P>

          <P>"KLOPFEN FALS KAINE NTWORT RWARTET WIRT."</P>

          <P>Pu las die Zettel und dann klopfte und zog er den T&uuml;rklopfer und
          dann zog und beklopfte er den Klingelzug und dann rief er laut:</P>

          <P>"Eule! Ich erwarte eine Antwort! Hier spricht B&auml;r!"</P>

          <P>Na ja, f&uuml;r solche Tage ist dieses Buch gedacht: an denen geklingelt
          und geklopft wird zugleich und an denen jemand auf Antworten besteht und
          sich nicht abspeisen l&auml;sst. Es ist zu lesen von Kindern, zu lesen von
          Erwachsenen - oder von beiden zugleich oder nacheinander, auf jeden Fall
          ist es zu lesen.</P>

          <P>Denn: dazu ist es da.</P>

          <P>Und bessere Antworten auf die gestellten Fragen sind zurzeit
          wahrscheinlich auf der ganzen Welt nicht zu erwarten.<HR></P>
                    
          <P>Dieses Buch stelle ich hier in der NoCover vor, weil in den n&auml;chten
          Tagen viele von euch fragen werden: "Was schenke ich blo&szlig; meinem
          Cousin zu Weihnachten?" Dies ist wirklich eine gute Idee. Allein schon die
          Antwort des Dalai Lama auf die Frage: "Was ist Liebe?" ist wirklich
          lesenswert, gleich welchen Alters.</P>

          <P>Inspiriert durch das WB-Bild von OS-3.9 schreibe ich hier eine
          Geschichte ab. <HR></P>
          
          <P align="center"><FONT color="#000080" size="7"><B>Warum ist der Himmel blau?
          </B></FONT><BR>
          <B>von MARIO J. MOLINA</B></P>

          <P>Schneewei&szlig;, Grasgr&uuml;n, Zitronengelb: Bei manchen Dingen denken
          wir so sehr an eine bestimmte Farbe, dass wir einfach die Farbe nach ihnen
          benennen. Rabenschwarz, Aschgrau, Himmelsrot .... Stop, da stimmt doch was
          nicht. Himmelblau muss es nat&uuml;rlich hei&szlig;en! Denn die Farbe Blau
          geh&ouml;rt f&uuml;r uns so selbstverst&auml;ndlich zum Himmel wie das
          Schwarz zur Kohle und das Rot zum Blut. Warum aber ist der Himmel -
          wenigstens tags&uuml;ber - blau und nicht etwa gr&uuml;n oder rot? Je mehr
          du dar&uuml;ber nachdenkst, umso mehr neue Fragen tauchen auf: Wie kann der
          Himmel &uuml;berhaupt eine Farbe haben, wo er doch nur aus Luft besteht?
          Was ist &uuml;berhaupt Sonnenlicht und was passiert mit ihm auf seinem Weg
          durch die Luft? All das will ich dir erkl&auml;ren, und zwar so, wie wir
          Chemiker und Physiker es uns heute vorstellen.</P>

          <P>Gedanken &uuml;ber den Himmel und seine Farbe haben sich die Menschen
          schon vor langer Zeit gemacht. Manche meinten, der Himmel sei blau, weil
          sich in ihm das Meer spiegele. Andere glaubten, er sei voll winziger blauer
          Teilchen, die in der Luft schwebten. Und vor mehr als 2000 Jahren vermutete
          der griechische Philosoph Aristodeles, dass es nur im Licht Farben gibt,
          w&auml;hrend die Dunkelheit farblos ist. Der weise Grieche hatte Recht: Die
          Dinge um uns herum erscheinen uns nur deshalb farbig, weil Licht auf sie
          f&auml;llt. Obwohl das Sonnenlicht wei&szlig; aussieht, sind darin alle
          Farben enthalten - Rot, Orange, Gelb, Gr&uuml;n, Blau und Violett, manche
          sagen: Lila. Du kannst sie sehen, wenn die Sonne durch den Regen scheint
          und einen Regenbogen an den Himmel zaubert. Denn die vielen kleinen
          Regentropfen unterbrechen den Weg der Lichtstrahlen und zwingen sie, ihre
          Richtung zu &auml;ndern. Dabei dr&auml;ngen sie alle Farben des
          Sonnenlichts mehr oder weniger weit aus ihrer Bahn: Rotes Licht wird am
          wenigsten abgelenkt, orangenfarbenes schon etwas mehr, dann gelbes,
          gr&uuml;nes und blaues und am weitesten kommt violettes Licht von seiner
          urspr&uuml;nglichen Bahn ab. So kommt es, dass die Farben in jedem
          Regenbogen immer dieselbe Reihenfolge haben: Erst kommt Rot, dann Orange,
          Gelb,Gr&uuml;n, Blau und schlie&szlig;lich Violett.</P>

          <P>Warum aber &auml;ndern die Lichtstrahlen ihren Weg, wenn sie auf ein
          Hindernis treffen? Du kommst dem R&auml;tsel auf die Spur, wenn du dir die
          Lichtstrahlen als Wasserwellen vorstellst. Diese Idee hatte schon der
          niederl&auml;ndische Physiker Christiaan Huygens vor 350 Jahren und auch
          heute noch glauben wir Naturwissenschaftler, dass das Licht sich wie eine
          Welle bewegt. Denk dir eine Wasserpf&uuml;tze, auf die ein Regentropfen
          f&auml;llt. Sobald der Tropfen auf das Wasser prallt, entstehen kleine
          Wellen, die sich wie gr&ouml;&szlig;er werdende Ringe in alle Richtungen
          ausbreiten. Wenn nun diese Wellen an einen Kieselstein oder sonst ein
          Hindernis sto&szlig;en, dann prallen sie daran ab und &auml;ndern ihre
          Richtung. &Auml;hnlich ergeht es den Lichtwellen, wenn sie auf ihrem Weg
          durch die Luft auf einen Regentropfen oder ein anderes Hindernis treffen.
          Dabei werden sie von ihrer urspr&uuml;nglichen geraden Bahn abgelenkt.</P>

          <P>So wie es gro&szlig;e und kleine Wasserwellen gibt, im Meer und in der
          Pf&uuml;tze, so sind auch Lichtwellen unterschiedlich. Vor allem auf den
          Abstand zwischen zwei Wellenbergen, wir nennen das die "Wellenl&auml;nge",
          kommt es an. Mit dem blo&szlig;en Auge kannst du die Abst&auml;nde zwischen
          den Wellen des Lichts nicht erkennen, denn sie sind unglaublich klein,
          n&auml;mlich hundert Mal kleiner, als ein Haar d&uuml;nn ist. Doch mit sehr
          empfindlichen Messger&auml;ten lassen sich die Wellenl&auml;ngen des Lichts
          ganz genau bestimmen. Dabei zeigt sich, dass jeder Farbton seine eigene,
          unver&auml;nderliche Wellenl&auml;nge hat: Violettes und blaues Licht haben
          sehr kurze Wellenl&auml;ngen, rotes Licht dagegen hat l&auml;ngere.</P>

          <P>Diese unterschiedlichen Wellenl&auml;ngen sind der Grund daf&uuml;r,
          dass manche Lichtfarben von einem Hindernis st&auml;rker abgelenkt werden
          als andere. Auch das kannst du dir gut vorstellen, wenn du wieder an einen
          Kieselstein in der Wasserpf&uuml;tze denkst: Kleine Kr&auml;uselwellen, die
          von einem Regentropfen stammen, k&ouml;nnen durch ein so gro&szlig;es
          Hindernis wie einen Stein ganz sch&ouml;n durcheinander gebracht werden.
          F&uuml;r eine m&auml;chtige Welle, wie du sie mit deiner Hand am Rand der
          Pf&uuml;tze ausl&ouml;sen kannst, ist der Stein eine kleine H&uuml;rde; sie
          schwappt einfach dar&uuml;ber hinweg und erreicht ohne Probleme den
          gegen&uuml;berliegenden Pf&uuml;tzenrand. &Auml;hnlch ergeht es den Farben
          mit ihren unterschiedlichen Wellenl&auml;ngen: Das kurzwellige Blau des
          Sonnenlichts l&auml;sst sich von Hindernissen in der Luft st&auml;rker
          st&ouml;ren als das langwellige Rot. Jetzt wei&szlig;t du, warum ein
          Wassertopfen das wei&szlig;e Sonnenlicht in seine viele Farben aufspalten
          kann, die wir als Regenbogen sehen. Und gleich wirst du auch verstehen,
          warum der Himmel blau ist.</P>

          <P>Wenn das Sonnenlicht vom Himmel scheint, st&ouml;&szlig;t es dabei
          n&auml;mlich andauernd an irgendwelche Hindernisse - auch wenn es nicht
          regnet. Denn die Luft, durch die das Licht dringen muss, ist nicht leer,
          sonder besteht aus sehr, sehr vielen winzigen Teilchen. Die meisten davon
          (99 von 100) sind entweder Stickstoff oder Sauerstoff, der Rest sind andere
          Gas- und winzige so genannte Schwebeteilchen, die von Autoabgasen,
          Fabrikrauch, Waldbr&auml;nden oder Vulkanausbr&uuml;chen stammen. Obwohl
          die Sauerstoff- und Stickstoffteilchen eine Million Mal kleiner sind als
          Regentropfen, stellen auch sie sich dem Sonnenlicht in den Weg. Die
          Strahlen prallen an diesen vielen kleinen "Stolpersteinen" ab und
          &auml;ndern ihre Richtung: Sie werden gestreut, wie wir Chemiker und
          Physiker sagen. Das kurzwellige blaue und violette Licht wird - du ahnst es
          schon - mehr gestreut als das langwellige orangfarbene und rote. So kommt
          es, dass das Streulicht fast zehn Mal mehr violettes und sechs Mal mehr
          blaues Licht enth&auml;lt als rotes. Gegen diese &Uuml;bermacht kommen die
          gr&uuml;nen, gelben und orangfarbenen Lichtstrahlen nicht an und so
          erscheint uns das Streulicht blau - himmelblau. Herausgefunden hat das
          alles der englische Physiker und Nobelpreistr&auml;ger Lord Rayleigh, und
          zwar schon vor 130 Jahren. Ihm zu Ehren hei&szlig;t der Vorgang, der das
          Licht je nach Wellenl&auml;nge unterschiedlich weit von seinem geraden Weg
          abbringt, Rayleigh-Streuung. Wenn du zum Himmel blickst, siehst du
          haupts&auml;chlich das blaue Streulicht und nicht das ungestreute
          Sonnenlicht. Das w&auml;re wei&szlig;. Um dieses wei&szlig;e, ungestreute
          Licht zu sehen, das auf dem geraden Weg zu dir herabf&auml;llt,
          m&uuml;sstest du ja direkt in die Sonne schauen - und das solltest du auf
          keinem Fall tun! Denn das direkte Sonnenlicht ist so stark und
          gef&auml;hrlich, dass es deine Augen in k&uuml;rzester Zeit schwer
          sch&auml;digt und dich, wenn du l&auml;nger hinschaust, erblinden
          l&auml;sst.</P>

          <P>Du wei&szlig;t jetzt, dass sich das wei&szlig;e Licht in alle Farben des
          Regenbogens aufteilen kann. Umgekehrt geht es aber genauso. Das kannst du
          an einem sonnigen Tag erleben. Manchmal wirkt der Himmel am Horizont, das
          ist die Stelle, wo der Himmel die Erde ber&uuml;hrt, fast wei&szlig;,
          jedenfalls blasser blau, als es zur gleichen Zeit direkt &uuml;ber deinem
          Kopf leuchtet. Das kommt daher, weil das Sonnenlicht vom Hrizont zu dir
          einen sehr viel weiteren Weg durch die Luft zur&uuml;cklegen muss (und
          dabei viel mehr Luftteilchen streift), als wenn es direkt von der Mitte des
          Himmels herabf&auml;llt. Diese Unmengen von Teilchen streuen so das Licht
          mehrfach - und deshalb erscheint es wei&szlig;-bl&auml;ulich. Aus demselben
          Grund ist &uuml;brigens ist &uuml;brigens auch Milch wei&szlig;. Nimm ein
          Glas Wasser, stelle es vor einem dunklen Hintergrund und gib einen Tropfen
          Milch hinein. H&auml;lst du nun auf einer Seite eine Taschenlampe an das
          Glas, erscheint ihr Lichtstrahl im Wasser bl&auml;ulich. Du erkennst die
          Rayleigh-Streuung. Je mehr Milch du aber ins Wasser gibst, umso
          wei&szlig;er wird es. Das Licht wird n&auml;mlich dann von den vielen
          Milchteilchen immer und immer wieder gestreut; das Ergebnis ist wei&szlig;.
          Wie am Horizont.</P>

          <P>Der lange Weg vom Horizont durch die Erdatmosph&auml;re zu dir macht den
          Horizont nicht nur tags&uuml;ber heller als den Himmel direkt &uuml;ber
          deinem Kopf. Er macht auch den Abendhimmel bei untergehender Sonne rot
          statt blau. An den vielen Teilchen, die das Abendlicht auf dem Weg zu dir
          trifft, werden der violette und blaue Anteil des Sonnenlichts in alle
          Richtungen weggestreut - bis nur noch ein bisschen f&uuml;r deine Augen
          &uuml;brigbleibt. Warum sehe ich dann &uuml;berhaupt noch die orangeroten
          Lichtstrahlen des Sonnenuntergangs, m&ouml;chtest du jetzt wohl wissen?
          Weil die kurzwelligen blauen und violetten Lichtstrahlen weggestreut
          werden, erreichen dich nur noch die langwelligen orange-roten Farben.
          Beobachte mal einen Sonnenuntergang. Da kannst du die Lichtstrahlen sehen,
          die auf geradem Weg durch die Luft zu dir gelangen - und sie sind, wie du
          ja inzwischen wei&szlig;t, haupts&auml;chlich gelb, orangefarben und rot.
          Tags&uuml;ber siehst du haupts&auml;chlich gestreutes Licht von der Sonne
          und der Himmel ist blau und bei Sonnenuntergang siehst du das Licht, das
          nicht gestreut ist und der Himmel erscheint rot.</P>

          <P>So l&auml;sst sich also die rote Farbe der untergehenden Sonne ebenso
          wie das Blau des Tageshimmels erkl&auml;ren. Allerdings ist die
          Himmelskuppel auch nach Sonnenuntergang noch einige Zeit tiefblau. Das ist
          seltsam, denn die wenigen Strahlen, die von der versunkenen Sonne an den
          &auml;u&szlig;ersten Rand der Atmosph&auml;re gelangen, sollten nicht nur
          blaues Streulicht enthalten, sondern ebenso einen Teil der anderen Farben.
          Die L&ouml;sung dieses R&auml;tsels fanden einige Physiker erst vor 50
          Jahren: F&uuml;r das Blau der D&auml;mmerung sorgt ein besonderer Stoff,
          der sich zwanzig bis drei&szlig;ig Kilometer hoch &uuml;ber der
          Erdoberfl&auml;che zu einer dicken Schicht angesammelt hat, das Ozon.
          Dieses Gas wirkt wie ein Farbfilterauf das Licht der untergehenden Sonne:
          Es f&auml;ngt seine gelben und orangefarbenen Anteile ab, die blauen
          Anteile aber l&auml;sst es fast ungehindert passieren. Erst wenn das letzte
          bisschen Licht erloschen ist, verschwinden alle Farben im Schwarz der
          Nacht. Nachlesen l&auml;sst sich das alles in dem sch&ouml;nen Buch von
          G&ouml;tz Hoeppe "Blau: Die Farbe des Himmels" (Spektrum Akademischer
          Verlag 1999).</P>

          <P>Ozon sorgt nicht nur f&uuml;r den blauen Himmel der Abendd&auml;mmerung.
          Au&szlig;er den roten und gelben Anteilen des Sonnenlichts schluckt es noch
          eine besondere Art von Strahlen, die du nicht sehen kannst: das
          ultraviolette oder UV-Licht. Sicherlich hast du schon geh&ouml;rt, wie
          gef&auml;hrlich das UV-Licht f&uuml;r alle Lebewesen ist, auch f&uuml;r
          dich. Wenn es zu lange auf deine blo&szlig;e Haut scheint, bekommst du
          einen Sonnenbrand. Es ist f&uuml;r das gesamte Leben auf unserem Planeten
          ungeheuer wichtig, dass die Ozonschicht &uuml;berall dick genug ist und
          m&ouml;glichst viele UV-Strahlen abfangen kann.</P>

          <P>Leider ist diese lebenswichtige Schutzschicht schon an vielen Stellen
          d&uuml;nner geworden und es hat sich ein gro&szlig;es Loch &uuml;ber dem
          S&uuml;dpol gebildet. Schuld am Ozonloch sind bestimmte Stoffe, die das
          Ozon zerst&ouml;ren. Dazu geh&ouml;ren die so genannten Treibgase, die in
          Spraydosen zum Verspr&uuml;hen von Haarspray oder Deo verwendet wurden.
          Eine Sorte von Stoffen. die besonders sch&auml;dlich f&uuml;r die
          Ozonschicht ist, haben meine Kollegen und ich gr&uuml;ndlich untersucht und
          dabei herausgefunden, wie sie Ozon zerst&ouml;ren. Seitdem wird diese Sorte
          "Ozonkiller" in vielen L&auml;ndern nicht mehr verwendet. Das gibt mir
          Hoffnung, dass sich die Ozonschicht wieder erholt und ihre wichtige Aufgabe
          auch in Zukunft erf&uuml;llen kann: Das Leben auf unserer Erde vor den
          t&ouml;dlichen UV-Strahlen zu sch&uuml;tzen. &Uuml;brigens haben die
          Lebewesen selbst die Ozonschicht der Erde geschaffen: Bakterien, Algen und
          andere Pflanzen haben die Photosynthese erfunden, die du noch in dem
          Kapitel "Warum sind die Bl&auml;tter an den B&auml;umen gr&uuml;n?" von
          meinem Kollegen Robert Huber genauer erkl&auml;rt bekommen wirst. Was du
          hier nur wissen musst: Durch die Photosynthese wurde die Atmosph&auml;re
          mit Sauerstoffteilchen angef&uuml;llt. Dabei ist auch Ozon entstanden, denn
          Ozon ist eine Form von Sauerstoff. Stickstoff und der "normale" Sauerstoff
          machen den Himmel tags&uuml;ber blau, Ozon f&auml;rbt die
          Abendd&auml;mmerung blau.</P>

          <P>Blau leuchtet auch das Meerwasser, das zwei Drittel unserer Erde
          bedeckt. Die Kontinente dazwischen sind zwar braun wie die Erde oder
          gr&uuml;n wie der Wald, doch der Himmel dar&uuml;ber ist immer blau - nicht
          nur vom Boden aus betrachtet. Sogar vom Weltall aus gesehen ist die Erde
          von einem zarten blauen Schleier umh&uuml;llt. In der Atmosph&auml;re
          leuchtet das Blau des Himmels. Das haben die Astronauten berichtet, die die
          Erde von oben gesehen haben. Die Erde wird also ganz zu Recht "der Blaue
          Planet" genannt. Sein einzigartiges Blau ist die Farbe des Lebens.</P>

          <TABLE border="0" summary="" cellspacing="0" cellpadding=
          "0" width="60%">
            <TR>
              <TD bgcolor="#ff00ff">&nbsp;</TD>
              <TD bgcolor="#ff00ff" colspan="2"></TD>
            </TR>

            <TR>
              <TD bgcolor="#ff00ff"></TD>
              <TD>&nbsp;</TD>
              <TD><BR>
              <FONT size="-1">MARIO J.MOLINA, geb. 19.3.1943, bekam
              1995 zusammen mit Paul Crutzen und Sherwood Rowland
              den Chemie-Nobelpreis f&uuml;r seine Arbeit an Gasen,
              die die Ozonschicht zerst&ouml;ren. Er lehrt am
              Massachusetts Institute of Technology (MIT) in
              Cambridge, USA.</FONT> </TD>
            </TR>
          </TABLE>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

