<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat etwas gefunden</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#000080"><B>Meteoriten: Die Gefahr aus
          dem All</B></FONT></H1>

          <P>Bisher sind Kollisionen mit Himmelsk&ouml;rpern f&uuml;r die Erdbewohner
          glimpflich abgegangen. Doch jederzeit k&ouml;nnte ein Gescho&szlig; aus dem
          All alles Leben ausl&ouml;schen. Um das zu verhindern, t&uuml;fteln
          Experten an komplizierten Abwehrstrategien</P>

          <P valign=top>
          <TABLE border="0" summary="" align="left">
            <TR>
              <TD><IMG src="st_kosmos01.jpg" width="360" height="302" alt=""><BR>
              <FONT size="-1">Asteroid Gaspra (Aufnahme der
              US-Raumsonde Galileo)</FONT> </TD>
            </TR>
          </TABLE>
          In "Armageddon", einem Leinwandspektakel von 1998, war es ziemlich einfach,
          einen Weltuntergang abzuwenden. Ein "NEA" (von Near-Earth-Asteroid), "so
          gro&szlig; wie Texas", raste mit 35 000 Stundenkilometern auf die Erde zu,
          drohte als riesiger Meteorit auf ihr einzuschlagen. In nur 18 verbleibenden
          Tagen bis zum Crash wurde ein Team von Bohrspezialisten zu Astronauten
          geschult und von Space Shuttles ins All geschossen, wurde ein 255 Meter
          tiefes Loch in den Asteroiden gebohrt und dieser durch eine Atombombe in
          zwei Teile gespalten. Die Bruchst&uuml;cke flogen an der Erde vorbei, die
          Menschheit war gerettet. </P>
                    
          <P>Mit der Wirklichkeit hat ein solches Szenarium nicht im Entferntesten zu
          tun. Die Himmelsk&ouml;rper, mit denen die Erde kollidieren k&ouml;nnte,
          sind viel kleiner als das Schreckgespenst aus "Armageddon" - allerdings
          ungleich schwieriger unsch&auml;dlich zu machen als dort gezeigt. Und:
          Weitaus leichtere Attacken aus dem All gen&uuml;gen, das Leben auf der Erde
          in eine tiefe Krise zu st&uuml;rzen. Nicht mehr als zehn bis 15 Kilometer
          ma&szlig; zum Beispiel jener Asteroid, der vor 65 Millionen Jahren 75 bis
          80 Prozent aller Tier- und Pflanzenarten auf der Erde aussterben
          lie&szlig;, darunter die Dinosaurier. Er schlug einen 200 Kilometer weiten
          Krater, zur einen H&auml;lfte auf der heutigen mexikanischen Halbinsel
          Yucat&aacute;n, zur anderen H&auml;lfte im Golf von Mexiko. Milliarden
          Tonnen Staub und Wasserdampf, verst&auml;rkt durch Ru&szlig; und Asche von
          Feuerst&uuml;rmen, verdunkelten den Himmel f&uuml;r Wochen und Monate und
          lie&szlig;en die Temperaturen an der Erdoberfl&auml;che so rapide sinken,
          dass Pflanzen abstarben und Tiere verhungerten.</P>

          <P valign=top>
          <TABLE border="0" summary="" align="left">
            <TR>
              <TD><IMG src="st_kosmos02.jpg" width="364" height="360" alt=""><BR>
              <FONT size="-1">Asteroid Kleopatra (nach
              Radarbeobachtungen konstruiert)</FONT> </TD>
            </TR>
          </TABLE>
          <B>&Uuml;berall Narben auf der Erde</B><BR> Selbst weit kleinere
          Himmelsk&ouml;rper k&ouml;nnen noch erheblichen Schaden anrichten. So
          explodierte 1908 in der Atmosph&auml;re &uuml;ber Sibirien ein 50 bis 100
          Meter gro&szlig;er Asteroid oder Kometenkern. 2200 Quadratkilometer Wald
          wurden dabei am Oberlauf der Steinigen Tunguska umgeworfen. Nur wenige
          Menschen kamen ums Leben. Doch was h&auml;tte dieses Weltraumgeschoss von
          relativ bescheidenen Ausma&szlig;en angerichtet, w&auml;re es &uuml;ber
          einer dicht besiedelten Region zerplatzt?</P>

          <P>Zahlreiche Krater auf allen Kontinenten zeugen jedenfalls davon, dass
          die Erde im Laufe ihrer Geschichte immer wieder von Bomben aus dem All
          getroffen worden ist. &Uuml;ber 150 solcher Narben wurden inzwischen
          identifiziert. Doch das ist mit Sicherheit nur ein Bruchteil dessen, was
          die Erde an "Impakten" tats&auml;chlich hat einstecken m&uuml;ssen. Weite
          Gebiete sind &uuml;berhaupt noch nicht eingehend auf Impaktkrater
          untersucht worden. Viele Einschl&auml;ge sind schwierig oder gar nicht mehr
          nachzuweisen, weil die deformierte Erdkruste l&auml;ngst von j&uuml;ngeren
          Ablagerungen &uuml;berdeckt oder durch Erosion abgetragen worden ist. Oder
          es ist, wie 1908 in Sibirien, erst gar kein Krater entstanden. </P>
                    
          <P><B>Wie sieht es unter Wasser aus?</B><BR> Vor allem aber: In den
          Ozeanen, die 70 Prozent der Erdoberfl&auml;che einnehmen, wurden bislang
          kaum Impakte aufgesp&uuml;rt. Die riesigen von Meer bedeckten Fl&auml;chen
          der Erde m&uuml;ssen jedoch nach statistischer Wahrscheinlichkeit doppelt
          so viele Treffer aus dem All abbekommen haben wie das Land. Die wenigen
          bislang am Meeresboden entdeckten Einschl&auml;ge liegen &uuml;berwiegend
          auf den flachen Schelfr&auml;ndern der Kontinente. In der Tiefsee konnte
          lediglich ein einziger Impakt mit Sicherheit nachgewiesen werden: im
          Ostpazifik westlich von Kap Hoorn.</P>

          <P valign=top>
          <TABLE border="0" summary="" align="left">
            <TR>
              <TD><IMG src="st_kosmos03.jpg" width="327" height="360" border="0" alt=""><BR>
               <FONT size="-1">Krateroberfl&auml;che des Asteroiden
              Eros (Aufn. der Sonde NEAR)</FONT> </TD>
            </TR>
          </TABLE>
          Wie man durch Untersuchungen wei&szlig;, die 1995 von einer internationalen
          Expedition mit dem deutschen Forschungsschiff Polarstern vorgenommen
          wurden, ist dort vor 2,15 Millionen Jahren ein ein bis vier Kilometer
          gro&szlig;er Brocken herabgesaust. Als die Forscher auf der Polarstern den
          Meeresboden mit Schallwellen "durchleuchteten", fanden sie ihn &uuml;ber
          Hunderte von Kilometern 20 bis 40 Meter tief aufgew&uuml;hlt, doch keinen
          Krater. Die nach dem Impakt abgesetzten und in charakteristischer Abfolge
          abgesunkenen Sedimente enthielten auch St&uuml;cke des Asteroiden. Nach
          Modellrechnungen sind Einschl&auml;ge in der Tiefsee nicht weniger
          verh&auml;ngnisvoll als Impakte an Land. Gewaltige Mengen von hei&szlig;em
          Wasserdampf und Salz, von Gesteinstr&uuml;mmern und geschmolzenem Gestein
          wurden etwa beim Crash im Ostpazifik in die obere Atmosph&auml;re
          geschleudert. Von der Einschlagstelle breiteten sich Monsterwellen aus, die
          &uuml;ber tiefem Wasser 20 bis 40 Meter hoch wogten, sich an den
          K&uuml;sten S&uuml;damerikas und der Antarktis aber zu mehrere hundert
          Meter hohen Brechern auft&uuml;rmten. </P>
                    
          <P>Dass vom Himmel etwas auf die Erde herabst&uuml;rzen k&ouml;nnte,
          vermochten sich abendl&auml;ndische Gelehrte lange Zeit &uuml;berhaupt
          nicht vorzustellen. Bis Ende des 18. Jahrhunderts wurden
          Meteoritenf&auml;lle als Sinnest&auml;uschungen abgetan. Und noch viel
          l&auml;nger, bis in die sechziger Jahre des 20. Jahrhunderts, suchte man
          nach irdischen Erkl&auml;rungen f&uuml;r Krater, die sich schlie&szlig;lich
          eindeutig als Auswirkungen eines kosmischen Bombardements erwiesen. Nach
          der Entdeckung immer neuer Impaktspuren ist heute unumstritten, dass auch
          in Zukunft mit Treffern aus dem All zu rechnen ist. "Die Erde", so
          formulierten drastisch David Morrison und Clark Chapman, zwei amerikanische
          Experten, "schwebt in einer kosmischen Schie&szlig;bude."</P>

          <P>Chapman und Morrison ver&ouml;ffentlichten Anfang 1994 eine Analyse, in
          der sie das Risiko der Menschheit in dieser Schie&szlig;bude
          abzusch&auml;tzen suchten. Ihre Berechnungen st&uuml;tzten sie insbesondere
          auf eine detaillierte Bestandsaufnahme der Krater auf dem Mond, der wie die
          Erde ebenfalls unter Beschuss steht. Doch anders als auf unserem Planeten
          bleiben Einschlagspuren dort &uuml;ber Jahrmilliarden erhalten.</P>

          <P>Einen der h&auml;ufigen leichten Treffer, wie jenen von 1908 in
          Sibirien, erwarten die Forscher auf der Erde etwa alle 250 Jahre. Chapman
          und Morrison rechnen im Durchschnitt mit 5000 Toten bei diesen Ereignissen.
          Etwa alle 500 000 Jahre, nehmen sie an, f&uuml;hre die Kollision mit einem
          1,5 Kilometer gro&szlig;en Koloss zu einem weltweiten &ouml;kologischen
          Desaster, dem - die heutige Bev&ouml;lkerungsdichte angenommen - 1,5
          Milliarden Menschen zum Opfer fallen k&ouml;nnten, vor allem durch
          Hungersn&ouml;te. Die gewaltigsten Brocken von zehn Kilometer
          Gr&ouml;&szlig;e oder mehr, die statistisch etwa alle 100 Millionen Jahre
          f&auml;llig seien, lie&szlig;en wenig &Uuml;berlebenschancen. Chapman und
          Morrison gehen, sollte eine solche Kollision in unserer Zeit passieren, von
          f&uuml;nf Milliarden Toten aus.</P>

          <P>Um die Risiken in Bezug auf die Gr&ouml;&szlig;enklassen miteinander zu
          vergleichen, teilten die Forscher jeweils die angenommene Anzahl der Opfer
          durch die Anzahl der Jahre, die zwischen den Himmelsschl&auml;gen
          durchschnittlich vergehen. Als weitaus gef&auml;hrlichste
          Gr&ouml;&szlig;enordnung erwiesen sich dabei die mittelgro&szlig;en
          Brocken: Bei 1,5 Milliarden Opfern in 500 000 Jahren entfallen statistisch
          3000 auf jedes einzelne Jahr. Die Gefahr, durch einen solchen
          Himmelsk&ouml;rper umzukommen, so berechneten die Forscher, sei damit
          ebenso gro&szlig; wie die Wahrscheinlichkeit, bei einem
          Flugzeugungl&uuml;ck zu sterben - und gr&ouml;&szlig;er als das Risiko
          eines vorzeitigen Todes durch Flutkatastrophen, Tornados und andere
          gef&uuml;rchtete Zwischenf&auml;lle.</P>

          <P><B>St&auml;rker als Millionen Atombomben</B><BR> Als deutlichen
          Fingerzeig f&uuml;r die tats&auml;chliche Bedrohung verstanden Fachleute
          die Kollision des Kometen Shoemaker-Levy 9 mit dem Jupiter noch im selben
          Jahr 1994. Dieser Komet bestand aus 20 bis etwa 1500 Meter gro&szlig;en
          St&uuml;cken, die wie auf einer Perlenschnur aufgereiht mit 200 000
          Stundenkilometern auf den Gasplaneten zurasten. Sechs Tage dauerte das
          kosmische Feuerwerk, bei dem ein Kometenteil nach dem anderen auf den
          Jupiter st&uuml;rzte. Bei den st&auml;rksten Explosionen wurde jeweils eine
          Energie freigesetzt, die der Sprengkraft von Millionen Hiroshima-Bomben
          entsprach.</P>

          <P>Asteroiden wie Kometen sind &Uuml;berbleibsel aus der Zeit vor 4,6
          Milliarden Jahren, als aus einer hei&szlig;en, wirbelnden Wolke von Gas und
          Staub das Sonnensystem entstand. Die Materie ballte sich zu
          "Planetesimalen" zusammen, kleineren Himmelsk&ouml;rpern, aus denen durch
          weitere Zusammenschl&uuml;sse schlie&szlig;lich die Planeten und ihre Monde
          hervorgingen. Doch nicht alle Planetesimalen vereinigten sich zu
          gr&ouml;&szlig;eren Himmelsk&ouml;rpern, und mancher Zusammenschluss ging
          wieder zu Bruch.</P>

          <P><B>Bomben aus Eis und Dreck</B><BR> Haupts&auml;chlich bestehen
          Asteroiden aus Stein und Eisen. Die meisten umkreisen die Sonne im
          gro&szlig;en Treck zwischen den Bahnen von Mars und Jupiter. Die Heimat der
          Kometen hingegen liegt in den &auml;u&szlig;ersten Bereichen des
          Sonnensystems, &uuml;ber 10 000mal weiter von der Sonne entfernt als der
          Asteroiden-G&uuml;rtel, und sie unterscheiden sich auch in der
          Zusammensetzung. Den gr&ouml;&szlig;ten Anteil haben Wassereis und
          gefrorene Gase wie Kohlendioxid und Ammoniak. Das Eis ist mit dunkleren
          Bestandteilen, neben Stein und Eisen viel Kohlenstoff, durchsetzt. Daher
          werden Kometen von Astronomen oft als "schmutzige Schneeb&auml;lle" oder
          "eisige Dreckklumpen" charakterisiert.</P>

          <P>Durch St&ouml;rungen von au&szlig;en k&ouml;nnen sowohl Asteroiden als
          auch Kometen aus ihren regul&auml;ren Bahnen geworfen werden. Ein Asteroid
          kann nach einem Zusammensto&szlig; mit einem anderen und unter dem Einfluss
          des Jupiters in Richtung Sonne und Erde geschleudert werden. Kometen
          brechen aus ihrer Bahn aus, wenn zum Beispiel in der N&auml;he ein Stern
          vor&uuml;berzieht.</P>

          <P>Ein Komet, der ins Sonnensystem verschlagen wurde, bleibt unbemerkt, bis
          er deutlich die Bahn des Jupiters hinter sich gelassen hat. Erst dann ist
          die Sonnenstrahlung stark genug, Kometeneis zu verdampfen. Es bildet sich
          eine Gash&uuml;lle, die im Sonnenlicht leuchtet und durch den Sonnenwind zu
          einem Millionen Kilometer langen Schweif auseinandergetrieben wird - ein im
          Idealfall mit blo&szlig;em Auge sichtbares Naturschauspiel, das Menschen
          seit Jahrtausenden beeindruckt.</P>

          <P>Da auf Asteroiden kein Eis verdampft und sie bei ihrer geringen
          Gr&ouml;&szlig;e nur wenig Sonnenlicht reflektieren, wurde erst im Jahr
          1801 der erste ersp&auml;ht: Ceres, mit &uuml;ber 900 Kilometer Durchmesser
          der gr&ouml;&szlig;te von allen. Es dauerte fast ein weiteres Jahrhundert,
          bevor die ersten erdnahen Asteroiden aufgesp&uuml;rt wurden.</P>

          <P><B>1500 erdnahe Objekte sind registriert</B><BR> Bis 1973 waren
          Asteroiden Zufallsentdeckungen. Berauscht von Einblicken in immer
          entlegenere Fernen des Alls, interessierten sich Astronomen kaum noch
          f&uuml;r das nahe Sonnensystem. Zwei amerikanische Geowissenschaftler, der
          Impakt-Experte Eugene Shoemaker und Eleanor Helin, als Geologin f&uuml;r
          die US-Raumfahrtbeh&ouml;rde Nasa t&auml;tig, begannen damals, mit einem
          altgedienten Teleskop auf dem Mount Palomar in Kalifornien systematisch
          nach erdnahen Asteroiden und Kometen zu fahnden. Bis 1995 wurde diese
          bahnbrechende Suche mit vergleichsweise einfacher Technik
          fortgef&uuml;hrt.</P>

          <P valign=top>
          <TABLE border="0" summary="" align="left">
            <TR>
              <TD><IMG src="st_kosmos04.jpg" width="242" height="360" alt=""><BR>
              <FONT size="-1">Meteoritenkrater Roter Kamm,
              Namibia,<BR>
               3,7 Mio. Jahre alt</FONT> </TD>
            </TR>
          </TABLE>
          Bis September 2001 wurden insgesamt 1505 erdnahe Objekte registriert: 1462
          Asteroiden und 43 Kometen. Unter den Asteroiden haben, nach ihrer
          Helligkeit zu urteilen, 513 einen Durchmesser von mindestens einem
          Kilometer, sodass ein Zusammensto&szlig; mit ihnen weltweite Auswirkungen
          haben w&uuml;rde. </P>
                    
          <P>Doch auch mit ausgefeilter Technik sind die lichtschwachen NEAs meist
          nur f&uuml;r kurze Zeit, bei gr&ouml;&szlig;ter Ann&auml;herung an die
          Erde, im Sternengefunkel auszumachen. Nach ihrer Entdeckung muss also
          m&ouml;glichst schnell und m&ouml;glichst oft ihre Position bestimmt
          werden. Je mehr Beobachtungen vorliegen, desto genauer l&auml;sst sich der
          Kurs ermitteln. Weitere Begegnungen mit der Erde k&ouml;nnen auf Jahre und
          Jahrzehnte im voraus berechnet werden, vorausgesetzt der Asteroid wird
          nicht durch unvorhergesehene Einfl&uuml;sse aus der Bahn gebracht.</P>

          <P>Doch zum Ernstfall soll es nat&uuml;rlich gar nicht erst kommen. Da
          Abwehrma&szlig;nahmen aber Zeit ben&ouml;tigen - Experten sprechen von
          Jahrzehnten -, ist es Ziel von Suchprogrammen, einen immer
          gr&ouml;&szlig;eren Teil der NEOs weit im voraus zu entdecken und deren
          Bahnen zu bestimmen.<BR clear="all"> </P>

          <P><B>Abwehr br&auml;uchte viel Zeit</B><BR> Viel Zeit w&auml;re
          erforderlich, weil eine Abwehraktion sorgf&auml;ltiger Vorbereitung
          bed&uuml;rfte und zur Verteidigung der Erde, wie auch immer sie erfolgte,
          gro&szlig;e Lasten ins All geschafft werden m&uuml;ssten. Die Wege im
          Weltraum w&auml;ren nicht nur deshalb lang, weil die Eingriffe
          m&ouml;glichst weit von der Erde entfernt vorgenommen werden sollten,
          sondern auch, weil Raumschiffe ihr Ziel nach den Gesetzen der Dynamik im
          Sonnensystem meist nur auf Zeit raubenden Umwegen erreichen k&ouml;nnen -
          und selbst das oft nur in bestimmten "Zeitfenstern".</P>

          <P>Zun&auml;chst aber m&uuml;sste ein St&ouml;renfried gr&uuml;ndlich
          untersucht werden. Ein neu entdeckter NEA ist zu Beginn lediglich ein
          Lichtpunkt, der sich am Himmel schnell bewegt. Aus Helligkeit und
          Entfernung l&auml;sst sich grob seine Gr&ouml;&szlig;e ableiten. Mit
          zunehmender Zahl von Beobachtungen kann dann immer genauer die
          k&uuml;nftige Bahn berechnet werden. F&uuml;r weitergehende Aussagen, etwa
          &uuml;ber Form und Rotation, Zusammensetzung, Dichte und Masse, sind
          Untersuchungen mit gro&szlig;en Teleskopen und Radaranlagen erforderlich,
          am besten zudem eine Inspektion vor Ort.</P>

          <P>Vorbild daf&uuml;r k&ouml;nnte die dem Asteroiden Eros gewidmete
          amerikanische Mission NEAR (Near-Earth Asteroid Rendezvous) sein, die
          h&ouml;chst erfolgreich endete. Seit 1996 unterwegs, hatte die Raumsonde
          NEAR Shoemaker die Umlaufbahn um ihren Rendezvous-Partner im Februar 2000
          erreicht. W&auml;hrend sie "Eros" ein Jahr lang in wechselnden H&ouml;hen
          umrundete, sandte sie Str&ouml;me von Messdaten und spektakul&auml;ren
          Bildern der kraterzernarbten Oberfl&auml;che zur Erde. Nach erf&uuml;llter
          Mission landete die Sonde am 12. Februar 2001 weich auf dem Asteroiden.</P>

          <P>Asteroiden sind unregelm&auml;&szlig;ig geformt und vielf&auml;ltig
          verbeult - Resultat unz&auml;hliger Karambolagen. Nur wenige dieser immer
          wieder geknufften Sch&ouml;pfungsreste konnten bislang mit Radar und
          Weltraumsonden untersucht werden, doch gab es dabei allerlei
          &Uuml;berraschungen. Zum Beispiel als NEAR Shoemaker, auf dem Weg zu
          "Eros", "Mathilde" besuchte: einen steinernen Asteroiden, 66 mal 48 mal 46
          Kilometer gro&szlig;, der nur halb so viel wie erwartet wog. In seinem
          Innern muss es reichlich Hohlr&auml;ume geben.</P>

          <P valign=top>
          <TABLE border="0" summary="" align="left">
            <TR>
              <TD><IMG src="st_kosmos05.jpg" width="360" height="314" alt=""><BR>
              <FONT size="-1">Meteoritenkrater Mistastin-See,
              Kanada, 38 Mio. Jahre alt</FONT> </TD>
            </TR>
          </TABLE>
          Andererseits gibt es Asteroiden aus Nickeleisen, sechsmal so dicht wie der
          Tr&uuml;mmerhaufen Mathilde. F&uuml;r den Forscher Yeomans folgt aus dieser
          Spannweite, "dass wir mehr als eine einzige Ablenkungsstrategie brauchen.
          Ein Patentrezept wird es nicht geben." </P>
                    
          <P>Eine simple Spaltung, wie im Film "Armageddon" praktiziert, dar&uuml;ber
          sind sich alle Experten einig, kommt nicht in Frage - zu gro&szlig;
          w&auml;re das Risiko, dass die Teilst&uuml;cke die Erde dennoch
          tr&auml;fen. Man m&uuml;sste einen St&ouml;renfried also entweder in so
          kleine St&uuml;cke zerlegen, dass sie beim Eintritt in die Atmosph&auml;re
          vergl&uuml;hen oder relativ harmlos explodieren w&uuml;rden - oder ihn von
          seinem bedrohlichen Kurs abbringen. Eine kontrollierte Sprengung erscheint
          auch in den Planspielen nur bei kleineren NEOs mit Durchmessern bis 200
          Meter m&ouml;glich. Neben herk&ouml;mmlicher Sprengtechnik haben
          amerikanische Forscher sich eine aparte weitere Methode zur Zerkleinerung
          ausgedacht: Sie stellen sich vor, zahlreiche Projektile aus dem
          Schwermetall Wolfram, eingebunden in ein Netz aus z&auml;hen Fasern, auf
          einen Asteroiden schie&szlig;en zu k&ouml;nnen. Auf diese Weise, so haben
          die Wissenschaftler berechnet, lie&szlig;e sich ein 200-Meter-Objekt in
          etwa einen Meter gro&szlig;e Bruchst&uuml;cke zerlegen, die beim Eintritt
          in die Atmosph&auml;re vergl&uuml;hen w&uuml;rden. Andere Experten
          bezweifeln jedoch, ob diese scherzhaft als "Cookie Cutter" (Keksmesser)
          bezeichnete Abwehrwaffe &uuml;berhaupt funktionieren k&ouml;nnte.</P>

          <P><B>Bald kommt der erste gro&szlig;e Knall</B><BR>
          Dagegen nimmt sich ein erster gezielter Eingriff geradezu bieder aus, den
          die Nasa f&uuml;r den Juli 2005 plant. Dann wird die Raumsonde "Deep
          Impact", deren Start f&uuml;r Januar 2004 geplant ist, nach
          anderthalbj&auml;hrigem Flug einen kleinen Kometen namens P/Tempel 1
          erreicht haben und ein 500 Kilo schweres Geschoss aus Kupfer auf ihn
          abfeuern. Die Wissenschaftler erwarten, dass beim Einschlag mit einer
          Geschwindigkeit von 36 000 Kilometer pro Stunde ein etwa 100 Meter weiter
          und 20 Meter tiefer Krater entsteht.</P>

          <P>Offiziell geht es darum, erstmals das Innere eines Kometen zu erkunden.
          Doch Brian Muirhead, Projekt-Manager f&uuml;r "Deep Impact" am Jet
          Propulsion Laboratory, macht keinen Hehl daraus, dass man sich auch
          Erkenntnisse f&uuml;r den Umgang mit erdbedrohenden Kometen erhofft.</P>

          <P valign=top>
          <TABLE border="0" summary="" align="left">
            <TR>
              <TD><IMG src="st_kosmos06.jpg" width="274" height=
              "360" alt=""><BR>
              <FONT size="-1">Meteoritenkrater Aorounga,
              Tschad,<BR>
               350 Mio. Jahre alt</FONT> </TD>
            </TR>
          </TABLE>
          <B>Asteroiden (Kleinplaneten, Planetoiden):</B><BR>
          kleine Himmelsk&ouml;rper von einigen Metern bis zu mehreren hundert
          Kilometern Durchmesser, die wie Planeten die Sonne umlaufen. Die meisten
          dieser &uuml;berwiegend steinernen Brocken ziehen im Asteroideng&uuml;rtel
          zwischen den Bahnen von Mars und Jupiter dahin. Manche Asteroiden
          sto&szlig;en jedoch &uuml;ber die Bahn des Mars hinaus ins Innere des
          Sonnensystems vor, kreuzen zum Teil sogar die Bahn der Erde. Damit
          k&ouml;nnen sie unmittelbar oder nach einer Kurs-&auml;nderung unter dem
          Einfluss eines Planeten mit der Erde kollidieren. </P>
          
          <P><B>ECOs (Earth-Crossing Objects):</B><BR>
          Asteroiden oder Kometen, welche die Erdbahn kreuzen, so dass es zu
          Zusammenst&ouml;&szlig;en mit der Erde kommen kann.</P>

          <P><B>Kometen (Schweifsterne):</B><BR>
          relativ kleine Himmelsk&ouml;rper - bis etwa 40 Kilometer Durchmesser - mit
          einer riesigen Gash&uuml;lle und einem Millionen Kilometer langen Schweif.
          Aus den &auml;u&szlig;ersten Bereichen des Planetensystems stammend, sind
          Kometen zusammengeklumpte Reste des Urnebels, aus dem vor 4,6 Milliarden
          Jahren unser Planetensystem entstand. Ihr Kern besteht aus einem Gemisch
          aus fes-ten Stoffen, Wasser und Gasen, alles tiefgefroren. Von den
          Milliarden Kometenkernen, die dort drau&szlig;en die Sonne umkreisen,
          gelangen immer wieder einzelne bis ins innere Sonnensystem, nachdem sie aus
          ihrer regul&auml;ren Bahn geworfen worden sind, etwa durch einen
          vorbeiziehenden Stern, und k&ouml;nnen dann zu einer Gefahr f&uuml;r die
          Erde werden. Ihr typisches Aussehen mit Gash&uuml;lle und Schweif gewinnen
          Kometen erst innerhalb der Bahn des Jupiter, wenn das Sonnenlicht
          ausreicht, einen Teil der gefrorenen Partikel zu verdampfen und die
          freigesetzten Teilchen das Licht reflektieren.</P>

          <P><B>Meteore (Sternschnuppen):</B><BR>
          Leuchtspuren am Himmel, die entstehen, wenn kleine Teilchen aus dem All in
          der irdischen Atmosph&auml;re vergl&uuml;hen.</P>

          <P><B>Meteoriten:</B><BR>
          aus dem Weltraum stammende Brocken aus Stein oder Eisen oder beidem, die
          zur Erde gefallen sind; meist Tr&uuml;mmerteile von Asteroiden.</P>

          <P><B>NEAs (Near-Earth Asteroids), "erdnahe Asteroiden":</B><BR>
          Asteroiden, die nicht im gro&szlig;en Treck zwischen den Bahnen von Mars
          und Jupiter ziehen, sondern die Bahn unseres Nachbarplaneten Mars
          &uuml;berschritten haben und sich damit in relativer N&auml;he zur Erde
          befinden.</P>

          <P><B>NECs (Near-Earth Comets), "erdnahe Kometen":</B><BR>
          Kometen innerhalb der Marsbahn.</P>

          <P><B>PHAs (Potentially Hazardous Asteroids), "potenziell gef&auml;hrliche
          Asteroiden":</B><BR>         
          Asteroiden, die bis auf ein Zwanzigstel des Abstandes Erde-Sonne - 7,5
          Millionen Kilometer - oder n&auml;her an die Erde herankommen und
          mindestens 150 Meter gro&szlig; sind. Nach kosmischen Ma&szlig;st&auml;ben
          bedarf es nur einer relativ geringen Bahn-&auml;nderung, die Erde zu
          gef&auml;hrden.</P>

          <HR>

          <P>Text und Bilder aus <B>www.geo.de/kosmos</B></P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

