<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Sonnenfinsternisse 2</TITLE>
  </HEAD>

  <BODY background="st_sonne.jpg" text="#FFFFFF" link="#ffbe42" vlink="#ffbe42"
  bgcolor="#000000">
    <TABLE cellspacing="10" border="0" width="100%" summary="">
      <TR>
        <TD>
          <H2 align="CENTER"><B>Sonnenfinsternis - ein besonderes
          Naturereignis</B></H2>

          <CENTER>
            &copy; <FONT size="-1">Hans E. Gillmann
            (11/2002)</FONT>
          </CENTER>

          <P>Nicht jedem Menschen ist es verg&ouml;nnt, in seinem Leben wenigstens
          einmal eine totale Sonnenfinsternis zu erleben. In dieser kurzen Zeit,
          einige Sekunden oder Minuten, in der die Sonne verfinstert ist, hat man
          eine seltene Erscheinung vor Augen, die fr&uuml;her die Menschen in Angst
          und Schrecken versetzt hatte.</P>

          <P>Der Tag wird in dieser Zeit zur Nacht und Sterne werden sichtbar.
          V&ouml;lker l&auml;ngst vergangener Epochen meinten, das Ende sei gekommen
          und die G&ouml;tter w&auml;ren erz&uuml;rnt wegen ihrer Lebensweise. Sie
          wussten es damals nicht besser. &Uuml;ber die Bahnen der Sonne, Planeten
          und dem Mond hatten sie noch wenig Ahnung.</P>

          <P>Doch gerade der Lauf des Mondes hat mit dieser Erscheinung zu tun. Er
          ist der Grund, dass es entweder eine partielle oder auch eine totale
          Sonnenfinsternis gibt. Es ist ein gl&uuml;cklicher Zufall, dass der Mond
          gerade die Gr&ouml;&szlig;e und Entfernung von der Erde hat, dass er am
          Himmel genau so gro&szlig; erscheint wie die Sonne, und somit durch die
          ganze Mondscheibe verdeckt werden kann.</P>

          <P>Eine seltsame Dunkelheit liegt &uuml;ber der Zone, wo dieses Schauspiel
          zu beobachten ist. Nur noch die Korona, die Sonnenatmosph&auml;re, ist zu
          sehen. Sie erscheint als silbriger Glanz, dessen Helligkeit mit zunehmender
          Entfernung vom Sonnenrand abnimmt.</P>

          <P><B>Wie kommt es nun zu einer Sonnenfinsternis?</B></P>

          <P>Die Sonne ist unser Zentralgestirn, um die sich die Planeten drehen.
          Viele Planeten haben Monde, die sich ebenfalls um die jeweiligen Planeten
          bewegen, so wie unser Mond um unseren Heimatplaneten. Im Verlauf eines
          Monats umkreist der Mond die Erde und einmal im Jahr kreisen sie gemeinsam
          um die Sonne.</P>

          <P>Die Bahn der Erde um die Sonne ist nicht kreisrund sondern elliptisch.
          Die Bahn des Mondes um die Erde ist gegen die Ebene, in der die Erde um die
          Sonne kreist, um 5 Grad geneigt. Die Astronomen nennen diese Ebene auch
          Ekliptik-Ebene. Die Bahnneigung des Mondes bedeutet, dass er sich bis knapp
          40 000 km &uuml;ber oder unter der Ekliptik aufhalten kann. Die Erde hat
          aber einen Radius von nur 6370 km. Der Schatten des Mondes l&auml;uft so
          gut wie parallel zur Ekliptik, deshalb darf der Mond bei Neumond nicht
          wesentlich mehr als etwa der Radius der Erde &uuml;ber oder unter der
          Ekliptik stehen, damit es wenigstens irgendwo zu einer partiellen
          Sonnenfinsternis kommt.</P>

          <P>Anders ausgedr&uuml;ckt, er muss sich nahe den Schnittpunkten seiner
          Bahn mit der Ekliptik, den sogenannten Knoten, befinden, damit der
          Mondschatten die Erde nicht verfehlt und eine Sonnenfinsternis eintreten
          kann. Es gib zwei Knoten: Im aufsteigenden Knoten durchquert der Mond die
          Ekliptik von S&uuml;den nach Norden und im absteigenden Knoten geht er von
          Norden nach S&uuml;den durch die Ekliptik. Die beiden Punkte werden durch
          die sogenannte Knotenlinie verbunden, die auch die Erde
          durchst&ouml;&szlig;t.</P>

          <P>Wir k&ouml;nnen also folgern, dass eine Sonnenfinsternis nur eintreten
          kann, wenn einer der beiden Knoten in etwa zwischen uns und der Sonne zu
          liegen kommt. Da die Knotenlinie ihre Richtung viel langsamer &auml;ndert,
          als die Erde sich um die Sonne bewegt, befindet sich jeder Knoten nur
          einmal j&auml;hrlich zwischen uns und der Sonne. Es gibt zwei Knoten und
          somit sind in der Regel zweimal j&auml;hrlich die Bedingungen besonders
          g&uuml;nstig f&uuml;r eine Sonnenfinsternis gegeben.</P>

          <P>Verdeckt nun der Mond nur teilweise die Sonne, spricht man von einer
          unvollst&auml;ndigen oder partiellen Sonnenfinsternis. Bei einer
          ringf&ouml;rmigen Sonnenfinsternis befinden sich Mond und Erde zwar in
          einer geraden Linie, doch weil sich der Mond auf seiner leicht elliptischen
          Umlaufbahn gerade an einem erdfernen Punkt befindet, erscheint seine
          Scheibe kleiner als die Sonne, und so ist um ihn ein Ring
          photosph&auml;rischen Lichts zu sehen.</P>

          <P>Doch, wie schon gesagt, es ist einem gl&uuml;cklichen Zufall zu
          verdanken, dass die Sonne vom Mond vollst&auml;ndig verdunkelt wird. Der
          Durchmesser der Sonne ist genau 400mal gr&ouml;&szlig;er als der des
          Mondes. Befindet sich nun der Mond an einem relativ erdnahen Punkt seiner
          Umlaufbahn, ist die Sonne genau 400mal so weit entfernt. Ist diese
          Voraussetzung gegeben, haben wir eine totale Sonnenfinsternis.</P>

          <P>Den Mond kann man vor der Totalit&auml;t nat&uuml;rlich nicht sehen,
          dazu ist das Licht der Sonne zu stark, es blendet den Beobachter, und
          au&szlig;erdem ist ja Neumond. Die uns st&auml;ndig abgewandte Seite wird
          von der Sonne beschienen, auf der uns zugewandten Seite ist es Nacht. Erst
          wenn der Mond den Sonnenrand ber&uuml;hrt, wird er vor der Helligkeit
          unseres Tagesgestirns sichtbar.</P>

          <P>Eine totale Sonnenfinsternis beginnt mit der partiellen Phase, wenn der
          Mond einen Teil der Sonne bedeckt. Bei der Ann&auml;herung an die
          Totalit&auml;t wird der sichtbare Teil der Sonne zu einer schmalen Sichel.
          Unmittelbar vor der Totalit&auml;t zerbricht die Sichel durch die
          Unregelm&auml;&szlig;igkeiten der Gebirge am dunklen Rand des Mondes und es
          entsteht das so genannte Perlschnur- Ph&auml;nomen. Der letzte jetzt noch
          sichtbare Teil der Sonne kann das Aussehen eines Diamantrings haben.</P>

          <P>Dann hat der Mond die Sonne "verschluckt". Wir haben eine totale
          Sonnenfinsternis. Die dunkle Mondscheibe wird nun von einem Strahlenkranz
          umgeben. Es ist die Sonnenkorona. Sie ist wohl die beeindruckendste
          Erscheinung einer totalen Sonnenfinsternis. Sie leuchtet rund zehntausend
          mal schw&auml;cher als die Photosph&auml;re. Dieser Anblick ist nur
          w&auml;hrend der totalen Phase zu beobachten, oder aber mit Hilfe moderner
          Methoden an einem Beobachtungsger&auml;t, dem Sonnenkoronographen.</P>

          <P>Die Sonne hat immer diese Korona, doch man sieht sie nat&uuml;rlich
          deshalb nicht, weil das Licht der Sonne sie &uuml;berstrahlt. Die Form der
          Korona ist bei jeder Sichtbarkeit anders. Das h&auml;ngt davon ab, in
          welcher Phase des elfj&auml;hrigen Fleckenzyklus sich die Sonne befindet.
          W&auml;hrend eines Maximums an Sonnenflecken hat die Korona eine weitgehend
          symmetrische Gestalt, w&auml;hrend eines Fleckenminimums dagegen reicht sie
          am &Auml;quator der Sonne deutlich weiter ins All hinaus als an den Polen.
          Ihre Form erinnert in diesem Fall an die Umrisse eines Schmetterlings.</P>

          <P>Die Form der Korona h&auml;ngt auch von der jeweiligen Verteilung der
          Magnetfelder der Sonne ab. Sie sind es, die elektrisch geladene Atome und
          Elektronen - die Bestandteile der Korona - zusammenh&auml;lt und innerhalb
          bestimmter Bereiche "einsperrt". Mit der Zahl der Sonnenflecken &auml;ndert
          sich auch die Verteilung der solaren Magnetfelder im Rhythmus von etwa 11
          Jahren. Die Gase in der Korona sind ausgesprochen d&uuml;nn. Eine Million
          Kubikmeter w&auml;ren davon erforderlich, um lediglich 10 Gramm auf die
          Waage zu bringen. Doch die Temperatur der Korona ist &uuml;berraschend:
          mehr als ein Million Grad!</P>

          <P>Ein weiterer Aspekt bei der Sonnenfinsternis sind die Protuberanzen.
          Diese leuchtenden Plasma-wolken und -str&ouml;me steigen &uuml;ber der
          Chromosph&auml;re in die Korona. Sie geh&ouml;ren ebenfalls zu den
          sch&ouml;nsten und interessantesten kosmischen Erscheinungen. Ihre
          unersch&ouml;pfliche Vielfalt der Formen, ihre harmonischen und
          &uuml;berraschenden Bewegungen und auch ihre M&auml;chtigkeit dieser
          Erscheinung lassen uns die gewaltige Energie erahnen, die in der Sonne
          verborgen sind. Protuberanzen reichen bis einige Millionen Kilometer in den
          Weltraum. Dieses kann durchaus auch auf der Erde zu St&ouml;rungen in
          elektrischen Anlagen f&uuml;hren und Satelliten in ihrer Elektronik
          sch&auml;digen. Doch es bleibt wirklich ein hinrei&szlig;endes Schauspiel
          -eine totale Sonnenfinsternis. Besondere Sonnenfinsternisfreaks sind in der
          ganzen Welt pr&auml;sent, wenn dieses Ereignis stattfindet, egal wann und
          wo.</P>

          <P><B>Wie macht sich dies auf der Erde bemerkbar?</B></P>

          <P>Die scheinbaren Durchmesser von Sonne und Mond sind f&uuml;r einen
          Beobachter auf der Erde nahezu gleich, daher reicht die Spitze des
          Kernschattenkegels des Mondes bei einer Sonnenfinsternis gerade auf die
          Erdoberfl&auml;che und erzeugt dort einen Schattenfleck von h&ouml;chstens
          270 km Durchmesser bei senkrechtem Einfall.</P>

          <P>Der Weg dieses Schattenflecks von Westen nach Osten mit einer mittleren
          Geschwindigkeit von 580 m/s hei&szlig;t Totalit&auml;tszone, die in ihr
          liegenden Orte erleben dann eine totale Sonnenfinsternis, deren Dauer
          h&ouml;chstens 7,6 min betr&auml;gt. In dieser Zone tritt w&auml;hrend der
          totalen Verfinsterung der Sonne ein merkw&uuml;rdiger Temperaturabfall
          ein.</P>

          <P>Kurz vor der Totalit&auml;t machen sich die so genannten "fliegenden
          Schatten" bemerkbar. Diese rasch dahinhuschenden Licht- und Schatteneffekte
          werden durch Turbulenzelemente in der Erdeatmosph&auml;re verursacht, in
          denen der Brechungsindex vom Mittel abweicht. Unterschiedliche Teile des
          nur noch sehr schwachen Strahlungsb&uuml;ndels der Sonnenstrahlung werden
          durch sie in unregelm&auml;&szlig;iger Weise abgelenkt, was zu einem
          schnell ver&auml;nderlichen Helligkeitsmuster f&uuml;hrt.</P>

          <P>Steht nun der Mond in Erdferne und der scheinbarer Monddurchmesser ist
          kleiner als der scheinbare Sonnendurchmesser, so reicht die Schattenspitze
          nicht bis auf die Erde. In diesem Falle haben wir eine ringf&ouml;rmige
          Sonnenfinsternis. F&uuml;r die Orte, die nur vom Halbschatten des Mondes
          getroffen werden, ist die Sonnenfinsternis partiell. Sollten Sie sich
          gerade im betreffenden Gebiet einer totalen Sonnenfinsternis kurz vor der
          Totalit&auml;t auf einem hohen Berg aufhalten, oder in einem Flugzeug diese
          Zone &uuml;berfliegen, dann k&ouml;nnen sie den Schatten des Mondes mit
          gro&szlig;er Geschwindigkeit &uuml;ber die Erde streichen sehen.</P>

          <P>Haben Sie nun einen Eindruck von diesem Naturschauspiel bekommen und
          m&ouml;chten eventuell bei der n&auml;chsten Sonnenfinsternis dabei sein?
          Die n&auml;chste totale Sonnenfinsternis findet am 4. Dezember 2002 statt.
          Allerdings nicht &uuml;ber Europa, sondern &uuml;ber Afrika, Indien und
          Australien.</P>

          <P>Dann rast der Mondschatten vom Atlantik her kommend &uuml;ber Angola,
          Sambia, Namibia, Botswana, Zimbabwe, S&uuml;dafrika bis nach Mosambique. An
          der K&uuml;ste von Mosambique wird eine Dauer von gut 1 Minute 40 Sekunden
          erreicht. Danach &uuml;berquert der Mondschatten die landlosen Weiten des
          s&uuml;dlichen Indischen Ozeans, wo die maximale Dauer bis knapp &uuml;ber
          2 Minuten ansteigt. Kurz bevor der Schatten die Erde wieder verl&auml;sst
          erreicht er gerade noch die Australische S&uuml;dk&uuml;ste, wo aber die
          totale Sonnenfinsternis bei weniger als 10 Grad Sonnenh&ouml;he nur gut
          eine halbe Minute dauern wird.</P>

          <P>Hier noch als Erg&auml;nzung zu diesem Artikel weitere totale
          Sonnenfinsternisse bis 2010 mit einem ungef&auml;hren Verlauf der
          Totalit&auml;tszone:</P>

          <UL>
            <LI>23. 11. 2003 Antarktis</LI>

            <LI>08. 04. 2005 Mittelamerika</LI>

            <LI>29. 03. 2006 Afrika - T&uuml;rkei - Russland</LI>

            <LI>01. 08. 2008 Gr&ouml;nland - Mongolei</LI>

            <LI>22. 06. 2009 Indien - China</LI>

            <LI>11. 07. 2010 Chile - Argentinien</LI>
          </UL>

          <P>Zum Schluss m&ouml;chte ich noch den Eindruck einer totalen
          Sonnenfinsternis von Adalbert Stifter, (1805 -1868) einem
          &ouml;sterreichischen Schriftsteller, erw&auml;hnen:</P>

          <P>"<I>.... wie der letzte Funke eines erl&ouml;schenden Dochtes schmolz
          eben auch der letzte Sonnenfunken weg, wahrscheinlich durch die Schlucht
          zwischen zwei Mondberge zur&uuml;ck - es war ein ordentlich trauriger
          Augenblick -, deckend stand nun Scheibe auf Scheibe - und dieser Moment war
          es eigentlich, der wahrhaft herzzermalmend wirkte, - das hatte keiner
          geahnet -ein einstimmiges "Ah" aus aller Munde, und dann Totenstille. Es
          war der Moment, da Gott redete und die Menschen horchten....</I>".</P> <HR>

          <P>Der Artikel stammt aus <B>www.astronomie.de</B><BR> alle Bilder dazu
          m&uuml;ssen im Original-Beitrag angeschaut werden.</P>  
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

