<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Sonnenfinsternis</TITLE>
    <!--  Wolf Zimmer  -->
  </HEAD>

  <BODY background="st_sonne.jpg" text="#FFFFFF" link="#ffbe42" vlink="#ffbe42"
  bgcolor="#000000">
    <TABLE width="100%" cellpadding="8">
      <TR>
        <TD>
          <H1 align="center"><B>Sonnenfinsternisse</B></H1>

          <CENTER>
            &copy; <FONT size="-1">Doris Unbehaun (12/2002)</FONT>
          </CENTER>

          <P>Sonnenfinsternisse sind keine seltenen Erscheinungen, pro Jahr kann es
          bis zu f&uuml;nf Finsternissen (allerdings partielle und totale) kommen.
          Jedoch geschieht dies &auml;u&szlig;erst selten und ist erst im Jahr 2206
          wieder zu erwarten.</P>

          <P>Im Gegensatz zu Mondfinsternissen, welche auf der gesamten
          n&auml;chtlichen Erdhalbkugel zu beobachten sind, finden totale
          Sonnenfinsternisse nur in einem schmalen Streifen von wenigen hundert
          Kilometer am Tageshimmel statt. Oberhalb und unterhalb dieses
          Finsternis-Streifens ist die Finsternis lediglich partiell.</P>

          <P>dass es sich trotzdem um ein so au&szlig;erordentliches und seltenes
          Ereignis handelt, liegt daran, dass sich totale Sonnenfinsternisse nur in
          einem schmalen Korridor auf der Erdoberfl&auml;che zeigen und es
          Jahrhunderte dauert, bis am gleichen Ort wieder eine totale
          Sonnenfinsternis stattfindet.</P> &lt;
                     

          <P>Deshalb gibt es "au&szlig;er den sonnens&uuml;chtigen
          Eklipse-Globetrottern" kaum einen Menschen auf der Erde, der mehrere
          Sonnenfinsternisse gesehen hat. Totale Sonnenfinsternisse &uuml;ben starke
          Emotionen aus, es ist ein enormes Naturschauspiel, dessen Zauber man sich
          kaum entziehen kann.</P>

          <P>Wenn man dabei bedenkt, welchen - oft gef&auml;hrlichen, bedrohlichen -
          Stellenwert in den alten Kulturen das Geschehen am Himmel hatte, kann man
          in etwa die bedr&uuml;ckenden Gef&uuml;hle und die Best&uuml;rzung bei
          einer Sonnenfinsternis erahnen. Das &Uuml;berleben der Gemeinschaft hing
          davon ab, wie genau Saat- und Erntetermine vorhergesagt werden konnten.
          Jegliche Fehleinsch&auml;tzung bei Ver&auml;nderungen in den Jahreszeiten
          konnte gef&auml;hrliche Auswirkungen auf den Stamm oder die Gemeinde haben.
          Und wenn sich nun unvermutet am hellichten Tag die lebensspendende Sonne
          verabschiedete, sozusagen von der dunklen Masse des Mondes verschluckt
          wurde, kann man sich das ungl&auml;ubige Entsetzung und die tiefe
          Best&uuml;rzung ausmalen, die die Menschen befiel.</P>

          <H3><B>Sonnenfinsternisse in der Geschichte</B></H3>

          <P>Die &auml;ltesten Berichte &uuml;ber Sonnenfinsternisse besitzen wir aus
          den Annalen der chinesischen Astronomen. Aufgrund der Aufzeichnungen des
          chinesischen Astronomen Chu wissen wir von 916 Sonnenfinsternissen, welche
          sich von 2137 bis 1785 v. Chr ereignet haben. Beispiel f&uuml;r eine
          Umschreibung einer Sonnenfinsternis in den chinesischen Annalen: "als Sonne
          und Mond nicht friedlich zusammen wohnen wollten ...", oder f&uuml;r eine
          ringf&ouml;rmige Sonnenfinsternis: "die Sonne sah aus wie ein goldener
          Ring!"</P>

          <P>Die chinesischen Hofastronomen Hsi und Ho sollen aufgrund von
          Trunkenheit eine Sonnenfinsternis nicht rechtzeitig vorhergesagt haben und
          wurden deshalb gek&ouml;pft. Bei dieser Sonnenfinsternis handelt es sich
          vermutlich um die totale Sonnenfinsternis vom 13. Oktober 2128 v. Chr,
          welche gegen 12 Uhr in Tay-kon-kien stattfand. Die Chinesen glaubten, dass
          bei einer Sonnenfinsternis ein riesiger Drache die Sonne verschlinge. Das
          Volk zog zur Rettung der Sonne mit allerlei Ger&auml;tschaften l&auml;rmend
          los und vertrieb mit Geschrei, Trommeln und Krach den Drachen. Bereits zu
          diesem Zeitpunkt konnten die Chinesen also eine Sonnenfinsternis
          vorherberechnen und dies bedarf des Verst&auml;ndnisses der himmlischen
          Bewegungen und mathematischer Kenntnisse.</P>

          <P>Sowohl die Chald&auml;er als auch die Chinesen erkannten quasi zur
          selben Zeit, dass Verfinsterungen von der Stellung des Mondes zur Sonne
          abh&auml;ngt. Sie beobachteten, dass Sonnenfinsternisse nur w&auml;hrend
          der Zeit des Neumondes stattfinden k&ouml;nnen. Aber da nicht immer zum
          Zeitpunkt eines Neumondes eine Verfinsterung der Sonne stattfindet,
          erkannten sie, dass der Mond verschiedene Umlaufbahnen ausf&uuml;hren
          mu&szlig;.</P>

          <P>Den Chinesen und Chald&auml;ern war also bereits vor &uuml;ber 2000
          Jahren die Neigung der Mond- zur Erdbahn (der Ekliptik) bekannt. Sie
          nannten die Schnittpunkte der Mondbahn mit der Ekliptik Knotenpunkte oder
          Drachenpunkte. Eine Keilschrift aus dieser Zeit: "Sonnenfinsternisse finden
          nur statt, wenn zur Zeit des Neumondes die Sonne und die unsichtbare,
          lichtlose Mondscheibe, von der Erde aus gesehen, in Knotenn&auml;he nahe
          genug beieinander stehen, und zwar so, dass eine ganze oder teilweise
          Bedeckung der Sonne durch den Mond m&ouml;glich ist!"</P>

          <P>Die Schlacht zwischen Lydern und Parthern: Herodot berichtet von einer
          Schlacht in Griechenland: "... im sechsten Jahr, als gerade eine Schlacht
          im Gange war, geschah es, dass w&auml;hrend des Kampfget&uuml;mmels
          pl&ouml;tzlich der Tag zur Nacht wurde... Als die Lyder und die Parther
          sahen, dass die Nacht den Tag ersetzte, lie&szlig;en sie vom Kampf ab und
          dr&auml;ngten auf beiden Seiten darauf, dass Frieden geschlossen werde."
          Man vermutet, dass Schlacht und Sonnenfinsternis sich am 28. Mail 584 v.
          Chr. ereigneten.</P>

          <H3><B>Hier finden Sie Reiseberichte der Sonnenfinsternisse</B></H3>

          <UL>
            <LI><A href="http://astronomie.de/sonnensystem/sofi/bolivien/bolivien1.htm">
            1984 - Sonnenfinsternis &uuml;ber dem Reich der Inka</A><BR> </LI>

            <LI><A href="http://astronomie.de/sonnensystem/sofi/malaysia/malaysia1.htm">
            1988 - Malaysia</A><BR> </LI>

            <LI><A href="http://astronomie.de/sonnensystem/sofi/sibirien/sibirien1.htm">
            1997- Sibirien, im Schatten des Mondes</A><BR> </LI>

            <LI><A href="http://astronomie.de/sonnensystem/sofi/deutschland/index.htm">
            1999 - Die Sonnenfinsternis in Deutschland</A><BR> </LI>

            <LI><A href= "http://astronomie.de/reisen/zw-2001/index.htm">2001 - Zimbabwe
            </A></LI>
          </UL>

          <H3><B>Voraussetzungen f&uuml;r eine Sonnenfinsternis</B></H3>

          <UL>
            <LI>Sonne, Mond und Erde m&uuml;ssen auf einer Linie stehen</LI>

            <LI>Sonne und Mond m&uuml;ssen am Tageshimmel stehen, es mu&szlig; also
            Neumond sein</LI>

            <LI>Der Mond mu&szlig; sich in unmittelbarer N&auml;he eines seiner Knoten-
            oder Drachenpunkte befinden</LI>

            <LI>Sonne und Mond m&uuml;ssen optisch den gleichen Durchmesser haben</LI>

          </UL>

          <P>Eine Sonnenfinsternis tritt also ein, wenn sich der Mond zwischen die
          Sonne und die Erde schiebt. Dabei mu&szlig; der Mond sich in unmittelbarer
          N&auml;he eines seiner Knoten- oder Drachenpunkte befinden. Das
          hei&szlig;t, der Mond mu&szlig; in der N&auml;he der Ekliptik stehen, also
          in der Erdbahnebene.</P>

          <P>Da die Mondbahn um 5&deg; zur Erdbahn geneigt ist, bewegt sich der Mond
          in den meisten F&auml;llen oberhalb oder unterhalb der Sonne an dieser
          vorbei, bedeckt sie also nicht. Nur dann, wenn der Mond sich gerade auf
          dieser oben erw&auml;hnten Schnittlinie befindet, ist eine Bedingungen
          f&uuml;r eine Sonnenfinsternis ist erf&uuml;llt.</P>

          <P>Eine Sonnenfinsternis kann nur dann eintreten, wenn Neumond ist, also
          der Mond nicht am n&auml;chtlichen, sondern am Tageshimmel steht. Des
          weiteren mu&szlig; f&uuml;r eine totale Sonnenfinsternis der Mond und die
          Sonne gleichgro&szlig; am Firmament erscheinen. Da der Mond in einer
          geringf&uuml;gigen Ellipse um die Erde kreist, schwankt seine Entfernung zu
          uns zwischen 406.000 bis 356.000 km. Steht der Mond in einer weiten
          Entfernung zur Erde, reicht sein optischer Durchmesser nicht aus, die Sonne
          total zu bedecken, es entsteht eine ringf&ouml;rmige Sonnenfinsternis.</P>

          <P>Eine partielle Sonnenfinsternis entsteht, wenn der Mond nicht nahe genug
          an seinem Knotenpunkt steht, also keine exakte Aufreihung in einer Linie
          stattfindet. Lediglich der Halbschatten f&auml;llt dann auf die Erde. Bei
          einer totalen Sonnenfinsternis erscheint dem Beobachter auf der Erde der
          3.500 km gro&szlig;e Mond gleichgro&szlig; wie die 1,4 Mio. Durchmesser
          gro&szlig;e Sonne. Obwohl die Sonne 400 mal gr&ouml;&szlig;er als der Mond
          ist, erscheint sie durch ihre 400fach gr&ouml;&szlig;ere Entfernung gleich
          gro&szlig;.</P>

          <P>Dabei f&auml;llt der Kernschatten des Mondes als schmaler Streifen auf
          die Erde. In diesem Bereich verschwindet die Sonne. Oberhalb und unterhalb
          dieses Streifens ist die Finsternis lediglich partiell. Diese partielle
          Phase wird immer geringer, je weiter man sich vom Kernschatten entfernt. Da
          es im Jahr zweimal passiert, dass die Sonne in Richtung des Knoten steht,
          k&ouml;nnte es theoretisch zwei mal im Jahr eine Sofi geben.</P>

          <P>Entfernung Mond: mittlere Entfernung: 384.392 km (406.679 km bis 356.410
          km)<BR> Entfernung Sonne: mittlere Entfernung: 1.496.000 km (1.470.000 km -
          1.520.000 km)</P>

          <P>Erscheinen beide Durchmesser gleich gro&szlig;, dauert die Finsternis
          nur einige Sekundenbruchteile. Je gr&ouml;&szlig;er der Monddurchmesser uns
          erscheint, desto l&auml;nger dauert die Finsternis. Erreicht der
          Monddurchmesser nicht den der Sonne, erleben wir eine ringf&ouml;rmige
          Sonnenfinsternis.</P>

          <P>Sonnenfinsternisse k&ouml;nnen auch unterschiedliche Dauer haben: Die
          Totalit&auml;tszone hat eine maximale Breite von 273 km. Da sich aber der
          Mondschatten zeitweise schr&auml;g auf die Erdoberfl&auml;che projiiziert,
          kann sie in solchen F&auml;llen auch breiter sein. Steht zum Beispiel die
          Erde im Aphel (also am sonnenfernsten Punkt ihrer Bahn), erscheint uns die
          Sonne kleiner am Himmel. Steht im Gegensatz dazu der Mond im Perig&auml;um
          (also in Erdn&auml;he), dann erscheint er uns mit maximaler
          Gr&ouml;&szlig;e. Wird nun die Totalit&auml;t vom &Auml;quator in den
          Mittagsstunden beobachtet, dann kann sich eine maximale
          Totalit&auml;tsdauer von 7 min und 29 sec. ereignen.</P>

          <P>Die Erde bewegt sich um die Sonne und hat dabei unterschiedliche
          Entfernungen. Im Winter steht die Erde der Sonne n&auml;her, im Sommer
          ferner. Auch der Mond bewegt sich auf einer elliptischen Bahn um die Erde
          und hat dadurch unterschiedliche Abst&auml;nde. Die Gr&ouml;&szlig;e der
          Finsternis wird in Einheiten des Sonnenscheibendurchmessers angegeben.
          Gr&ouml;&szlig;e 1,00 hei&szlig;t, die gesamte Sonnenscheibe wird vom Mond
          abgedunkelt, also gerade noch eine totale Sofi.</P>

          <H3><B>Welche Arten von Finsternissen gibt es?</B></H3>

          <P><B>Mondfinsternis</B></P>

          <P>Bei einer Mondfinsternis schiebt sich die Erde zwischen die Sonne und
          den von ihr beleuchteten Mond. Der riesige Erdschatten verdunkelt den Mond
          total, jedoch ist dieser immer noch zu sehen. Das liegt daran, dass unsere
          Atmosph&auml;re die Sonnenstrahlen ablenkt und bricht, sie in den
          Kernschatten hineinlenkt und somit den Mond je nach Zusammensetzung unserer
          Atmosph&auml;re "einf&auml;rbt". Deshalb k&ouml;nnen Mondfinsternisse mal
          heller, mal dunkler oder auch in unterschiedlichen Rott&ouml;nen
          eingef&auml;rbt sein.</P>

          <P><B>Partielle Sonnenfinsternis</B></P>

          <P>Prinzipiell unterscheidet man zwischen partieller, ringf&ouml;rmiger und
          totaler Sonnenfinsternis. Bei einer partiellen Sonnenfinsternis bewegt sich
          der Kernschatten des Mondes an der Erde vorbei. Dabei f&auml;llt nur sein
          Halbschatten auf die Erde. Nur dann, wenn die Achse des Mondschattens
          &uuml;ber die Erde huscht, kann es zu einer totalen oder einer
          ringf&ouml;rmigen Sonnenfinsternis kommen. Welche sich nun ereignet,
          h&auml;ngt davon ab, wie der scheinbare Durchmesser der Sonne und des
          Mondes sich abdecken.</P>

          <P><B>Ringf&ouml;rmige Sonnenfinsternis</B></P>

          <P>Steht die Erde nahe zur Sonne, hat also einen gr&ouml;&szlig;eren
          Durchmesser und steht dabei der Mond im Aphel, also seinem weit entfernten
          Punkt, dann erscheint uns der Monddurchmesser am Himmel geringer, und er
          reicht nicht aus, die Sonnenscheibe zu bedecken. Es kommt zu einer
          ringf&ouml;rmigen Sonnenfinsternis.</P>

          <P><B>Totale Sonnenfinsternis</B></P>

          <P>Erde im Aphel (also am sonnenfernsten Punkt ihrer Bahn) erscheint uns
          die Sonne kleiner am Himmel. Steht parallel dazu der Mond im Perig&auml;um
          (also in Erdn&auml;he), dann erscheint er uns mit maximaler
          Gr&ouml;&szlig;e. Es kommt zu einer totalen Bedeckung der Sonne.</P>

          <P><B>Der Saros-Zyklus</B></P>

          <P>Da 223 synodische Monate fast genau gleich 242 drakonitische Monate
          sind, so wiederholen sich in diesem Zeitraum die relativen Positionen der
          Syzygien (Neu- und Vollmondphasen) zu den Mondbahnknoten. Deshalb
          wiederholen sich die Finsternisabl&auml;ufe im Zeitraum von 18 Jahren und
          10 1/3 (11 1/3) Tagen. Diesen Zeitraum nennt man den Saros-Zyklus
          (Himmelsjahr 1999).</P>

          <P><B>Sonnenfinsternisse werden eines Tages nicht mehr stattfinden</B></P>

          <P>Der Mond ist 400 mal kleiner als die Sonnenscheibe und hat einen
          400fachen geringeren Abstand zur Erde als die Sonne. Dadurch erscheinen uns
          beide Himmelsobjekte in gleicher Gr&ouml;&szlig;e. Infolge der
          Gezeitenwirkung entfernt sich der Mond pro Jahr um etwa 4 cm von der Erde.
          Dadurch wird er in etwa 600 Millionen Jahren die Sonnenscheibe nicht mehr
          total bedecken k&ouml;nnen.</P>

          <H3><B>Was geschieht bei einer Sofi</B></H3>

          <P><B>Kurzer Steckbrief: Die Sonne</B></P>

          <P>Der Stern Sonne ist - genau wie alle anderen Sterne -ein gl&uuml;hend
          hei&szlig;er Gasball. Sie ist 150 Mio. km von uns entfernt und garantiert
          mit ihrem Licht und ihrer W&auml;rme das irdische Leben. Das Licht
          ben&ouml;tigt 8 min und 20 sec., um von ihr zu uns zu gelangen. So wie die
          Sonne existieren eine unendliche Zahl von Sternen am Himmel. Ihr Licht ist
          allerdings Jahre oder Jahrmillionen unterwegs, kein Wunder, dass sie
          lediglich als Lichtp&uuml;nktchen erscheinen.</P>

          <P>Die Sonne ist durch ihre N&auml;he zu uns ein ideales Studienobjekt. Wir
          k&ouml;nnen ihre Oberfl&auml;chenstrukturen studieren und
          R&uuml;ckschl&uuml;sse auf die anderen Sterne unseres Universums ziehen.
          Insgesamt 333.000 Erdkugeln ergeben die Masse der Sonne. Die Sonne
          beinhaltet 99,9 % der Masse des gesamten Sonnensystems mit seinen 9
          Planeten und den unz&auml;hligen Monden und Asteroiden. Selbst der
          gr&ouml;&szlig;te Planet unseres Sonnensystems, Jupiter, hat nur 1/1.000
          der Masse der Sonne.</P>

          <P>Die Sonne besteht zu 74% aus Wasserstoff, zu 24% aus Helium und zu einem
          geringen Restanteil aus Kohlenstoff, Sauerstoff, Stickstoff, Titan, Eisen
          und Gold. Im Innern der Sonne herrschen Temperaturen um 15 Mio. Grad, dort
          findet der thermonukleare Prozess statt, der Wasserstoff in Helium
          umwandelt. Vier Wasserstoffprotonen verschmelzen zu einem Heliumatomkern.
          Dabei wird Energie freigesetzt, die als Strahlungsleistung freigesetzt wird
          und uns mit Licht und W&auml;rme f&uuml;ttert. Die sichtbare Schicht der
          Sonne ist die Photosph&auml;re. Sie hat eine Temperaturvon ca 5.500 Grad C.
          Dar&uuml;ber liegt die Chromosph&auml;re und die Korona als die
          &auml;u&szlig;erste Schicht der Sonne.</P>

          <P>Nur bei einer totalen Bedeckung der Photosph&auml;re durch den Mond
          k&ouml;nnen die beiden anderen Schichten beobachtet werden. Ansonsten
          werden sie von der &uuml;beraus hellen Photosph&auml;re &uuml;berstrahlt.
          99% der des sichtbaren Sonnenlichtes stammen von der Photosph&auml;re. Die
          Photosph&auml;re ist 400 km dick. Zu erkennen in ihr sind die Granulen, die
          K&ouml;rnchen, welche eine Ausdehnung von 700 bis 1.400 km haben.</P>

          <P>Die Chromosph&auml;re ist &uuml;ber der Photosph&auml;re angesiedelt.
          Man spricht von zwei Chromosph&auml;ren, eine 8.000 die andere 12.000 km
          dick. Die Temperaturen liegen bei 4.500 bis zu 400.000 K in der
          &auml;u&szlig;ersten Schicht. Die angrenzende Schicht zur Korona erreicht
          bis zu einer Million Kelvin. Die Chromosph&auml;re ist r&ouml;tlich, sie
          besteht fast ausschlie&szlig;lich aus H-Alpha Licht. In ihr sind auch die
          Protuberanzen zu beobachten, diese wiederrum k&ouml;nnen bis tausende von
          Kilometer hoch in die Korona aufsteigen k&ouml;nnen. Bei einer totalen
          Sonnenfinsternis kann man beim 2. und 3. Kontakt die Chromosph&auml;re kurz
          aufleuchten sehen.</P>

          <P>Die Korona ist die &auml;u&szlig;erste Gash&uuml;lle der Sonne, sie
          erstreckt sich weit in den interplanetaren Raum hinaus. Sie erscheint bei
          einer totalen Sofi strahlenf&ouml;rmig, in Zeiten geringer Sonnenflecken
          ist sie fast rund, sonst langgestreckt. Die Helligkeit der Korona
          betr&auml;gt etwa 1 Millionstel der Photosph&auml;re. Die Beobachtung der
          Korona ist nur bei totalen Sonnenfinsternissen m&ouml;glich. Denn der Mond
          liegt au&szlig;erhalb unserer Atmosph&auml;re und bewirkt kein Streulicht.
          Die Temperaturen innerhalb der Korona liegen bei ein bis drei Millionen
          Kelvin, allerdings handelt es sich um ein ganz d&uuml;nn verteiltes
          Gas.</P>

          <P><B>Die vier Kontakte</B></P>

          <UL>
            <LI>Der erste Kontakt: Der Mond ber&uuml;hrt die Sonnenscheibe. Es zeichnet
            sich kurz danach die erste dunkle Einbuchtung im Sonnenball ab. Diese
            Einbuchtung w&auml;chst langsam.<BR> </LI>

            <LI>Vom zweiten Kontakt spricht man, wenn die Mondscheibe den linken
            Sonnenrand erreicht hat, die Totalit&auml;t beginnt. Erst jetzt kann man
            mit blo&szlig;em, ungesch&uuml;tzten Auge beobachten.<BR> </LI>

            <LI>Der dritte Kontakt beendet die Totalit&auml;t, die Sonne blitzt wieder
            hervor.<BR> </LI>

            <LI>Der vierte Kontakt bedeutet das Ende der Sonnenfinsternis, der Mond hat
            die Sonnenscheibe wieder vollkommen freigegeben, sich von ihr
            gel&ouml;st.</LI>
          </UL>

          <P><B>Die Ph&auml;nomene</B></P>

          <UL>
            <LI>Es wird dunkel, die menschliche Pupille registriert dies (noch) nicht,
            der Belichtungsmesser der Kamera jedoch schon</LI>

            <LI>die umliegende Gegend verf&auml;rbt sich, der Himmel erscheint im
            fahlen Licht, die Menschen sehen bleicher aus</LI>

            <LI>die landschaftlichen Kontraste steigen<BR> <BR> </LI>

            <LI><B>nach 10 Minuten</B></LI>

            <LI>die Kontraste steigen weiter, sie werden "knallhart"</LI>

            <LI>die Farbkontraste werden st&auml;rker, brllanter</LI>

            <LI>Reaktionen der Tierwelt k&ouml;nnen beobachtet werden</LI>

            <LI>ebenso, dass sich Bl&uuml;ten schlie&szlig;en</LI>

            <LI>Lochblendeneffekt: Sonnensicheln<BR> <BR> </LI>

            <LI><B>ca. 5 min vor der Totalit&auml;t</B></LI>

            <LI>die Temperatur geht bis 7&deg; runter (in der Sonne bis zu
            20&deg;)</LI>

            <LI>in der Schattenzone weht ein k&uuml;hler Wind, Kamineffekt
            (d&uuml;sterer bedrohlicher Sturm, "schwarze S&auml;ule") n&auml;hert sich
            mit der Geschwindigkeit eines Hurricans<BR> <BR> </LI>

            <LI><B>ca 2-3 min. vor der Totalit&auml;t</B></LI>

            <LI>fliegende Schatten (shadow bands), und/oder</LI>

            <LI>hell-dunkel-Streifen, die miteinander "Fangen" spielen. F&uuml;r sie
            gibt es noch keine richtige Erkl&auml;rung. Am besten ist der Vergleich mit
            dem Boden eines Schwimmbeckens, welches bl&auml;ulich gestrichen ist. Dort
            kann man auch die kribbelnden Schatten am Boden sehen. Man nimmt an, dass
            sie ausgel&ouml;st werden durch Luftschlieren, durch unterschiedliche
            Dichten in der Atmosph&auml;re.<BR> <BR> </LI>

            <LI><B>Totalit&auml;t</B></LI>

            <LI>aus &uuml;berwiegend westlicher Richtung heranrasend: der
            Mondschatten</LI>

            <LI>es wird dunkel, jedoch bedeutend heller als w&auml;hrend einer
            Vollmondnacht</LI>
          </UL>

          <P><B>Was kann beobachtet werden?</B></P>

          <P>Die Sonne ist ein gro&szlig;er thermonuklearer Ofen, in ihrem Innern
          herschen Temperaturen von ca. 15 Millionen Grad. Die Sonne besteht
          &uuml;berwiegend aus Wasserstoff, der in ihrem Kern zu Helium umgewandelt
          wird. Dabei wird Energie erzeugt, der in Form von Strahlung ausgesandt
          wird. Auf der Sonnenoberfl&auml;che kann man w&auml;hrend der Bedeckung
          nat&uuml;rlich nichts beobachten, jedoch zeigen sich durch die Bedeckung am
          Rand der glei&szlig;end hellen Photosph&auml;re schw&auml;chere
          Ph&auml;nomene, die sonst nicht sichtbar sind.</P>

          <P><B>Der Diamantring Effekt</B></P>

          <P>Kurz vor und nach der Totalit&auml;t tritt der Diamantringeffekt auf
          und/oder Baily's Beads erscheinen. Im deutschsprachigen Raum hei&szlig;t
          dieses Ph&auml;nomen "Perlschnureffekt".Die schmale Sichel der noch gerade
          sichtbaren Sonnenscheibe wird in einzelne Punkte oder Kn&ouml;tchen
          zerteilt. Oder es erscheint ein einziger greller Lichtfleck.</P>

          <P>Das sieht aus, als g&auml;be es da oben am Himmel einen grandiosen,
          riesigen Ring mit einem Diamanten. Deshalb nennt man das Ph&auml;nomen auch
          den Diamantringeffekt. Der Mond hat im Gegensatz zur Sonne einen gewellten
          Rand. Es liegen dort T&auml;ler und Berge. Die T&auml;ler lassen noch einen
          d&uuml;nnen Lichtstrahl der Sonne durch, die Berge verh&uuml;llen die Sonne
          vollkommen.</P>

          <P><B>Baily's Beads</B></P>

          <P>Baily`s Beads (Baily's Perlen, engl. Astronomen Francis Baily, der sie
          1836 erstmals erw&auml;hnte) Schrammt die Mondscheibe am Rand der Sonne
          vorbei, z.B. wenn man sich in einer Totalit&auml;tszone nicht auf die
          Zentrallinie stellt, sondern an den Rand, dann kann aus diesem einzigen
          Diamanten eine Kette von "Perlen" (T&auml;lern auf dem Mond) werden.</P>

          <P><B>Die Chromosph&auml;re</B></P>

          <P>Die Chromosph&auml;re (griech: Farbschicht) liegt &uuml;ber der
          Photosph&auml;re und leuchtet rot. Da sie im Vergleich zur Photosph&auml;re
          und der Korona au&szlig;erordentlich d&uuml;nn ist (lediglich einige
          tausend km dick) leuchtet sie nur ganz kurz zu Beginn und zum Ende der
          Totalit&auml;t auf.</P>

          <P><B>Die Protuberanzen</B></P>

          <P>In ihr befinden sich die Protuberanzen, riesige, massive, extrem
          hei&szlig;e Wasserstoffb&uuml;ndel, die in den Weltraum hinausgeschleudert
          werden und sich bis in die Korona erstrecken. Chromosph&auml;re und
          Protuberanzen leuchten im H-Alpha Licht. Deshalb k&ouml;nnen sie auch
          mittels Spezialfilter von der Erde aus sichtbar gemacht werden.</P>

          <P><B>Die Korona</B></P>

          <P>Dies gilt nicht f&uuml;r die Korona. Lediglich im Hochgebirge kann man
          Ans&auml;tze der Korona mittels Spezialger&auml;ten sichtbar machen. Die
          Korona ist die &auml;u&szlig;ere H&uuml;lle der Sonne. Sie erscheint dem
          Beobachter in wei&szlig;lich-bl&auml;ulichen Licht. Ihre Form ist
          l&auml;nglich oder mehr rund, je nachdem ob es sich um eine Sonnenperiode
          mit geringen oder vermehrten Sonnenflecken handelt.</P>

          <P>Bei der Korona handelt es sich um eine sehr hei&szlig;e, aber stark
          verd&uuml;nnte Schicht der Sonne. Ihre Temperatur liegt bei ein bis drei
          Mio. Kelvin. Ihre Energieausstrahlung ist aufgrund ihrer Verd&uuml;nnung
          aber so schwach, dass sie von der Photosph&auml;re &uuml;berstrahlt wird
          und nur zu Zeiten einer totalen Sonnenfinsternis mit blo&szlig;em Auge zu
          sehen ist.</P>

          <P>Die Korona erscheint als geb&uuml;ndelte Lichtstrahlen. Die
          Lichtb&uuml;ndel richten sich nach den Kraftlinien des Magnetfeldes, welche
          von der Sonne ausgehen. Au&szlig;erdem werden sie von der Sonnenrotation
          beeinflu&szlig;t. Elektrisch geladene Partikel (Protonen, Alphateilchen,
          Elektronen) werden von der Korona in den interplanetaren Raum geschossen.
          Dieser Sonnenwind erreicht Geschwindigkeiten von 500 bis 1.000 km/sec.</P>

          <P><B>Die "fliegenden Schatten"</B></P>

          <P>Die "shadow bands" entstehen einige Minuten vor der Totalit&auml;t. Man
          sieht an hellen Fl&auml;chen streifige Muster, &auml;hnlich dem Muster von
          Sandd&uuml;nen. Sie bewegen sich mit m&auml;&szlig;iger Geschwindigkeit,
          verwinden sich, huschen davon. Es handelt sich vermutlich um Szintillation.
          Die Lichtwellen werden in den unterschiedlichen Luftstr&ouml;mungen
          gebrochen und absorbiert.</P>

          <P><B>Der Wind der Finsternis</B></P>

          <P>Der Finsterniswind tritt ganz kurz vor Eintritt der Totalit&auml;t auf.
          Es wehen regelrecht B&ouml;en, bei bedecktem Himmel besteht die Chance,
          dass in letzter Minute der Himmel aufrei&szlig;t. Der Mondschatten
          n&auml;hert sich mit gewaltiger Geschwindigkeit. Ausserdem werden Planeten
          und Sterne sichtbar.</P> <HR>

          <P>Der Artikel stammt aus <B>www.astronomie.de</B><BR> alle Bilder dazu
          m&uuml;ssen im Original-Beitrag angeschaut werden.</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

