<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Tintenstrahler III</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>Tintenstrahler III</B></FONT></H1>

          <P>Und heute kommen wir zum dritten und letzten Teil unseres
          Druckerworkshops, zudem ich Euch wieder mal herzlich begr&uuml;&szlig;e.
          Wir werden uns heute die f&uuml;hrenden Druckerhersteller einmal genauer
          ansehen und deren Technik im Drucker genauer unter die Lupe nehmen.</P>

          <P><B>10. Der Altmeister und Erfinder: Technologie - Canon</B></P>

          <P>Canon erfand das thermische Tintenstrahl-Druckverfahren und setzt auch
          heute noch auf diese von den meisten anderen Herstellern lizensierte
          Technik. Die Druckk&ouml;pfe in Canondruckern sind modular aufgebaut und
          daher k&ouml;nnen die Tintentanks unabh&auml;ngig vom Druckkopf gewechselt
          werden. Einige Modelle haben den Druckkopf jedoch ausnahmsweise am
          Tintentank verschraubt. Tintenhersteller von kompatibler Tinte setzen dann
          auf den Umbau des Druckkopfes vom alten auf den neuen Tintentank, da diese
          Druckk&ouml;pfe nicht kosteng&uuml;nstig und in gleicher Qualit&auml;t
          nachgebaut werden k&ouml;nnen. Auch einige Refilled-Patronen werden
          angeboten. Seit 1999 bietet Canon gl&uuml;cklicherweise auch wieder seine
          Single-Ink-Technology an, was nichts anderes bedeutet, als dass sich die
          Farbpatronen einzeln austauschen lassen. &Ouml;kologisch sinnvoll sind
          teilweise ganze Patronens&auml;tze teurer, als eine Dreikammerpatrone
          anderer Hersteller. Es muss aber bedacht werden, dass man dennoch jede
          einzelne Farbe auch verbrauchen kann und nicht halbvolle Farbkammern im
          Abfall landen m&uuml;ssen.</P>

          <P>Canon setzt seit einiger Zeit auf pure Heizkraft. Pro Druckd&uuml;se
          verf&uuml;gt ein Canondrucker &uuml;ber zwei Heizelemente, was
          unterschiedlich grosse Tr&ouml;pfchengr&ouml;&szlig;en erm&ouml;glicht.
          Zusammen erzeugen die beiden Heizelemente zudem eine gr&ouml;&szlig;ere
          Dampfblase als ein einzelnes Heizelement. Beide Heizelemente erzeugen einen
          gro&szlig;en Tropfen, ein einzelnes Heiselement einen kleines Tropfen. Der
          Druck wird beschleunigt und ist zudem detailreicher.</P>

          <P>Canon verwendet schwarze Tinte mit und farbige ohne Pigmente . Die
          Fotodrucker sind mit einer besonderen Technik ausgestattet, die von Canon
          "P-Pop" genannt wird. Dabei wird vor dem eigentlichen Druck eine farblose
          Fl&uuml;ssigkeit auf das Papier aufgetragen, die verhindert, dass die Tinte
          vom Papier aufgesaugt wird. So lassen sich auch recht gute Ergebnisse auf
          Papieren erreichen, die f&uuml;r den Tintenstrahldrucker urspr&uuml;nglich
          ungeeignet waren und zudem wird der Druck fixiert und die Tinte kann nicht
          mehr verlaufen. Auch UV-gesch&uuml;tzter ist das P-Pop bedruckte
          Papier.</P>

          <P>Meine pers&ouml;nlichen Erfahrungen mit Canon-Tintenstrahldruckern:<BR>
          Vor wenigen Jahren war ein Tintenstrahldrucker von Canon mein klarer
          Favorit, denn zahlreich waren die Argumente daf&uuml;r. Guter Ausdruck,
          geringe Verbrauchskosten, g&uuml;nstige Tintenpatronen sowohl original von
          Canon, als auch vor allem von Fremdherstellern Sogar
          Softwareunterst&uuml;tzung f&uuml;r das AmigaSystem und ein freundlicher
          Kundensupport, der nicht gleich lachte, wenn man Fragen zu Canon + Amiga
          stellte. Hinzu kamen solide Verarbeitung und geringe Stellfl&auml;che durch
          kompakte Geh&auml;use. Leider musste sich auch Canon dem Markt anpassen und
          der verlangte Drucker zu Preisen, zu denen ein Drucker in vern&uuml;nftiger
          Qualit&auml;t nicht mehr herstellbar war. Verarbeitung spielte eine
          untergeordnete Rolle, AmigaSupport wurde eingestellt, Tinten mussten
          verteuert werden, um die schmalen Gewinne beim Drucker selbst zu
          subventionieren. Die kompakten Geh&auml;use wichen zum Teil v&ouml;llig
          unn&ouml;tig klobigen Ger&auml;ten (beispielsweise damals sehr auffallend
          dem BJC7000) und so hat Canon meine pers&ouml;nliche Favoritenliste leider
          mittlerweile verlassen. Auch echte Innovationen fehlen mir, wie
          beispielsweise Duplexdruck und andere Dinge.</P>

          <P><B>11. Der Fotomacher: Technologie - Epson</B></P>

          <P>Epson setzt auf seine elektrischen Impulse und verwendet seit jeher im
          Gegensatz zu anderen Herstellern des Massenmarktes auf die Piezotechnik.
          Die Druckk&ouml;pfe bleiben in einem Epsondrucker ein Druckerleben lang
          verbaut und es m&uuml;ssen lediglich die Tintenpatronen ausgewchselt
          werden. Der Nachteil kommt, wenn die Theorie nicht mehr gen&uuml;gt und
          auch der Piezodruckkopf einmal schlapp macht. Dann muss statt "nur" des
          Druckkopfes leider der komplette Drucker ausgetauscht werden.</P>

          <P>Zu Anfang war die Piezotechnik dem Heizverfahren beim Fotodruck deutlich
          &uuml;berlegen. Durch unterschiedliche Spannungen der Piezoelemente konnten
          in Epsondruckern schon immer unterschiedliche
          Tr&ouml;pfchengr&ouml;&szlig;en auf das Papier geschossen werden. Das
          verschaffte vor Jahren der Firma Epson einen ordentlichen Vorsprung bei den
          Ausdrucken von Fotos. Lange Zeit f&uuml;hrte Epson die m&ouml;gliche
          Druckaufl&ouml;sung und wer seinerzeit im Grafikbereich den
          bestm&ouml;glichen Tintenstrahldruck suchte, musste zwangsl&auml;ufig zu
          einem Epsondrucker greifen.</P>

          <P>Die Drucker von Epson besitzen wirkungsvolle Reinigungsmechanismen, die
          auch langfristig Ablagerungen am Druckkopf verhindern sollen. Auch
          l&ouml;st die Tinte angetrocknete Reste wieder auf. Beim Gelegenheitsdruck
          mit kleinem Auftragsvolumen verbraucht Epson aber
          verh&auml;ltnism&auml;&szlig;ig viel Tinte f&uuml;r Reinigungszwecke und
          die "Warmlaufphase" dauert dadurch oft etwas l&auml;nger, bis alle
          Reinigungsfunktionen durchlaufen wurden.</P>

          <P>Sogenannte Ultra-Micro-Dots sollen zudem die Qualit&auml;t der Ausdrucke
          verbessern. Die Tintentr&ouml;pfchen sind zur Zeit die Kleinsten im
          Tintenstrahlermarkt.</P>

          <P>Meine pers&ouml;nlichen Erfahrungen mit Epson-Tintenstrahldruckern:<BR>
          Epson konnte sich bereits mit seinen nahezu unverw&uuml;stlichen
          Nadeldruckern einen hervorragenden Ruf aufbauen. Als man dann mit den
          ersten Piezo-Tintenstrahlern auch noch die bessere Technik f&uuml;r
          fotorealistische Ausdrucke hatte, wurde der Erfolgskurs von Epson weiter
          fortgesetzt. Dann kamen viele Tintenhersteller auf den Markt, die die
          Epsontinten in schlechter Qualit&auml;t kopierten. Die Ferrorpartikel,
          welche f&uuml;r den Piezodruck in der Tinten n&ouml;tig waren, wurden von
          den Billigherstellern unterschiedlich gro&szlig; und in anderen Dosierungen
          in die Tinten integriert. Kurz nach dem Einsatz einer solchen Patrone waren
          die Druckd&uuml;sen verstopft. Epson wies verst&auml;ndlicherweise alle
          Garantieanspr&uuml;che von sich und so standen viele Kunden mit fast neuen
          aber v&ouml;llig defekten Druckern vor dem Schaden. Mittlerweile sind
          solche unseri&ouml;sen Tintenanbieter vom Markt verschwunden. Auch Epson
          musste bei der Herstellung ihrer Drucker sparen. Heraus kamen billigste
          Plastikdrucker mit schlechter Verarbeitung und teuren Tintenpatronen. Man
          verzichtete zeitweise auf s&auml;mtliche Bedienelemente und der komplette
          Drucker war nur noch per Software zu steuern. Nicht einmal mehr ein
          Patronenwechsel war ohne Software durchf&uuml;hrbar. Zumindest vom Ausdruck
          her bietet Epson noch satte und kr&auml;ftige Farben. Zudem sind Tinten von
          Fremdherstellern g&uuml;nstig zu haben.</P>

          <P><B>12. Alte Technik neu aufgetischt: Technologie
          -Hewlett-Packard</B></P>

          <P>Hewlett Packard wird gern mit der Abk&uuml;rzung HP betitelt. HP-Drucker
          arbeiten auf Canonbasierenden thermischen Verfahren, die HP dann aber in
          Eigenregie weiter evolutioniert hat. In den meisten Druckern stecken zwei
          Tintenkartuschen. Eine schwarze Patrone und eine weitere Patrone, in der
          alle n&ouml;tigen Farben vereint sind. HP verbindet seine Druckk&ouml;pfe
          mit dem Tintentank. Leider ein recht un&ouml;konomisches Prinzip, - man
          wirft nicht nur die komplette Farbpatrone weg, obwohl nur vielleicht eine
          einzige Farbe darin leer ist, sonder zudem wandert auch noch der Druckkopf
          in den Abfall. Kompatible Patronen gibt es daher zumindest von
          seri&ouml;sen Anbietern nicht, da auch der Druckkopf kopiert werden
          m&uuml;sste. Tintenhersteller haben sich daher auf die Wiederbef&uuml;llung
          alter Tintenpatronen spezialisiert. Die aufgebrauchten Tintentanks werden
          gereinigt, die Druckk&ouml;pfe einer Pr&uuml;fung unterzogen und
          schliesslich werden die Patronen wieder mit kompatibler Farbe
          aufgef&uuml;llt und als Refilledoder Reworked-Patronen verkauft. Lediglich
          in den teureren Profiger&auml;ten werden zumindest auch bei HP die Farben
          einzeln eingesetzt.</P>

          <P>Mit Tinte kleckertn HP-Drucker nicht, sonder sie klotzen - HP erreicht
          stufenlose Farb&uuml;berg&auml;nge, indem pro Druckpunkt bis zu 29
          Tintentropfen aufeinandergesetzt werden und so bis zu 3500
          Farbschattierungen m&ouml;glich sind. Es werden keine unterschiedlichen
          Tropfengr&ouml;&szlig;en gedruckt, sondern eine PhotoRET genannte Technik,
          die inzwischen in der dritten Generation zum Einsatz kommt verbessert den
          Ausdruck. Der Grundgedanke bei PhotoRET III ist es, mehrere Tintentropfen
          auf dem selben Punkt aufzubringen, und so eine gr&ouml;&szlig;ere Anzahl
          von Farben darstellen zu k&ouml;nnen, als mit anderen Verfahren.</P>

          <P>Meine pers&ouml;nlichen Erfahrungen mit
          Hewlett-Packard-Tintenstrahldruckern: <BR>

          Anfangs waren HP-Tintenstrahldrucker
          f&uuml;r mich &uuml;berhaupt nicht der Rede wert. Die Ausdrucke waren
          zun&auml;chst lausig und verschmiert. Die Farben trockneten auch nach
          Minuten noch nicht. Die alten Tintenstrahler hatte ich damals gern
          "Russendrucker" genannt, da sie klobig, kantig, h&auml;sslich und laut
          waren und dazu ein schlechtes Druckbild ablieferten. Die Aufl&ouml;sung war
          j&auml;mmerlich und es gab st&auml;ndig irgendwelche Probleme mitden Oldies
          von HP. Wollte man in Farbe drucken, so musste man bei den alten Druckern
          die Farbgegen die Schwarzpatrone erst austauschen. Schwarze Druckstellen
          wurden dann aus den Farben gemischt - heraus kam ein graugr&uuml;nes Etwas,
          was das Bild kaum an das Original auf dem Bildschirm erinnerte. Durch die
          so extrem langsam trocknende Farbe, rannte jeder HP-Druckerbesitzer
          st&auml;ndig mit schwarzen Fingern in der Gegend herum. Zudem waren und
          sind die Patronen immer unversch&auml;mt teuer, da meistens
          unn&ouml;tigerweise der komplette noch v&ouml;llig intakte Druckkopf mit
          weggeworfen und ersetzt werden musste. Zudem dreht HP seinen Kunden immer
          wieder die alten Modelle in einem neuen Geh&auml;use an, was dann der ganze
          Fortschritt sein soll. Seit kurzem scheint sich das Blatt aber zu wenden.
          HP druckt mit der farbsatten PhotoRET-Technologie in erstaunlicher
          Geschwindigkeit. Der beste Grund, einen HP-Tintenstrahler zu kaufen, ist
          aber die mittlerweile gute Verarbeitung und vor allem endlich Duplexdruck
          (beidseitiger Druck ohne selbst das Blatt wenden zu m&uuml;ssen), was unter
          den Tintenstrahlern nahezu einmalig ist.</P>

          <P><B>13. Geiz ist geil: Technologie - Lexmark</B></P>

          <P>Erst seit wenigen Jahren gibt es den j&uuml;ngsten Hersteller von
          Druckern, die Firma Lexmark. Immerhin hat Lexmark den Anschluss an die
          f&uuml;hrenden drei Hersteller geschafft und sich seinen nicht zu kleinen
          Teil vom Markt erk&auml;mpft. Auch Lexmark verwendet den meistgenutzten
          thermischen Druck. Und auch Lexmark setzt auf eine Einheit von Druckkopf
          und Tintentank, die nicht voneinander trennbar sind und beim Tintenkauf oft
          unn&ouml;tig kr&auml;ftig zur Kasse bitten lassen. Einen gro&szlig;en
          Schritt vorw&auml;rts tat der Hersteller vor etwa zwei Jahren mit der
          Einf&uuml;hrung einer eigenen Technologie zur Herstellung der
          Druckd&uuml;sen. Sowohl die &Ouml;ffnungen f&uuml;r den Austritt der Tinte
          als auch die Tintenkan&auml;le wurden erstmals mit Laserstrahlen aus einer
          Kunststoff-Folie geschnitten. Dadurch konnten seinerzeit sehr viele
          D&uuml;sen f&uuml;r sehr hohe Aufl&ouml;sungen sorgen, wobei der Drucker
          dennoch preisg&uuml;nstig in der Herstellung war und Lexmarkdrucker mit
          echten Kampfpreisen an den Markt gingen.</P>

          <P>Mittlerweile ist der Vorsprung etwas verspielt. Lexmark war sicherlich
          nicht ganz unschuldig daran, dass die anderen Druckerhersteller ihre
          Druckerpreise senken mussten und dadurch so knapp kalkuliert wurde, dass
          moderne Drucker in der Verarbeitung "billiger" wirken, als je zuvor. Ob der
          Verbraucher dadurch wirklich einen Vorteil hat, bleibt dahin gestellt, da
          alle Druckerhersteller versuchen, &uuml;ber die Verbrauchskosten das
          Defizit der Druckergewinne wieder aufzufangen. Dadurch ergibt sich die
          heutige Situation, recht billig verarbeitete Einsteigermodelle mit
          unversch&auml;mt teuren Druckerpatronen zu haben. Hier war Lexmark
          sicherlich der Vorreiter.</P>

          <P>Meine pers&ouml;nlichen Erfahrungen mit
          Lexmark-Tintenstrahldruckern:<BR> Ein Drucker unter 100,- DM? Wie geht das
          denn? Als ich den ersten Billigdrucker von Lexmark sah, traute ich meinen
          Augen nicht. Ein weiches wabbeliges St&uuml;ckchen Plastikelend gebaut
          f&uuml;r den Augenblick. Dann fragte der stolze Lexmarkbesitzer nach der
          ersten neuen Patrone, die sehr schnell n&ouml;tig war, da Lexmark die erste
          Druckerpatrone nur halb voll machte. Gerade einmal 10,DM trennten die
          einzelne Druckerpatrone, in der s&auml;mtliche Farben und schwarz inklusive
          des Druckkopfes sich vereinten vom Neukauf des kompletten Druckers. Damals
          absolut unfassbar! Die Situation hat sich nicht wesentlich verbessert -
          billige Druckermodelle und extrem hohe Folgekosten. Die Einstiegsmodelle
          sind nach wie vor nur vom Billigsten, aber zumindest zeigt Lexmark bei den
          teureren Modellen, dass man auch echte Drucker bauen kann, die nicht
          f&uuml;r die M&uuml;lltonne produziert wurden. Lexmarkdrucker wurden immer
          sehr gern Komplettsystem-Angeboten dazugelegt. Auf dem Angebotspapier macht
          sich ein Drucker immer gut, auch wenn er wirtschaftlich v&ouml;lliger
          Unsinn ist. Heute baut Lexmark in der oberen Klasse g&uuml;nstige, sehr
          schnelle Drucker mit brauchbar gutem Druckbild. Vor dem Druckerkauf lohnt
          in jedem Fall ein Blick auf den Tintenpreis. Lexmark ja - aber nicht um
          jeden Preis!</P>

          <P>Und hier schliessen wir nun den dritten und letzten Teil unseres
          Workshops &uuml;ber Tintenstrahldrucker. Sch&ouml;n, wenn er Euch gefallen
          hat und Ihr neues Wissen entdecken konntet.</P>

          <P>Allseits perfekten Druck w&uuml;nscht Euch Euer<BR>
          Higgins<BR>
          Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

