<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Workshop</TITLE>
  </HEAD>

  <BODY background="ws_wb1.jpg" text="#000000" link="#0000FF" vlink="#000080"
  alink="#FF0000" bgcolor="#FFFFF4">
    <TABLE border="0" width="100%" cellpadding="12" summary="">
      <TR>
        <TD>
          <H1 align="center">Workshop rund um die Workbench<BR>
           Teil 1</H1>

          <P><B>Thema: Von OS3.1 bis OS3.9</B></P>

          <P><B>Vorwort</B><BR>
          Sicherlich werdet ihr euch jetzt fragen: "Was soll das denn f&uuml;r ein
          Workshop &uuml;ber die ganzen Sachen der Workbench sein?" Nur um dies mal
          ganz einfach zu sagen, ich m&ouml;chte mit diesem Workshop aufzeigen, was
          alles in unserem Amiga steckt. Von daher wird es hier in den n&auml;chten
          Monaten immer etwas Neues zu erz&auml;hlen geben.</P>

          <P>Also die Sache ist im Grunde genommen ganz einfach. Man stelle sich doch
          nur mal vor, wie es war, als es lange Zeit nur die 6 Disketten f&uuml;r die
          Workbench gab. Heutzutage sieht die Sache doch ganz anders aus.
          Datentr&auml;ger ist eine CD. Updates, reichhaltige Tools und Programme
          gibt es im Internet und Aminet. Dazu kommen auch noch die CDs von Amigaplus
          und AmigaFuture und wie sie alle hei&szlig;en.</P>

          <P>Nun zum <B>Workschop Teil-1</B></P>

          <P>Der erste Schritt hier ist, dass wir uns auf der Festplatte den
          CDROM-treiber installieren und falls notwendig, auch f&uuml;r die
          Grafikkarte.</P>

          <P>Die Software nehmen wir von einer CDROM wie zum Beispiel der Amigaplus
          oder einer anderen CDROM. Dabei ist keinesfall MUI zu vergessen, denn dies
          wird von vielen andren Programmen gebraucht.</P>

          <P align="center"><A href="ws_wb1a.png" target= "_blank">
          <IMG src="ws_wb1a.gif" width="320" height="128" alt="" border></A><BR>
          <A href="ws_wb1a.png" target="_blank"><FONT size="-1">
          vergr&ouml;&szlig;ern?</FONT></A></P>

          <P>So sieht die Workbench nach der Installation der 6 Disketten aus. Weiter
          gehts Jetzt also mit dem Outfit -dem Ausehen der Workbench. Welche
          M&ouml;glichkeiten haben wir denn da zur Auswahl? Das Benutzen von MagicWB
          ist Shareware und der Einsatz von Newicons ist Freeware. NewsIcons
          ben&ouml;tigt aber das Zusatz-Tool names Classact. Was auch wiederum etwas
          beitr&auml;gt f&uuml;r die Workbenchgestaltung.</P>

          <P>Nach dem wir nun den zweiten Schritt in Richtung Outfit gemacht haben,
          sieht die WB schon ganz anders aus. Ich habe hier nur mal Newsicons
          gemommen und m&ouml;chte dazu noch sagen, es ist jedem selbst
          &uuml;berlassen, welche Icons f&uuml;r die Workbench genommen werden. Heute
          sieht es ja ganz anders aus. denn das neue OS3.9 hat schon ein super
          Outfit. Aber bleiben wir erst mal bei OS3.1. Hier nun das Bild von die
          Workbench mit Newicons.</P>

          <P align="center"><A href="ws_wb1b.png" target="_blank">
          <IMG src="ws_wb1b.gif" width="400" height="300" alt="" border></A><BR>
          <A href="ws_wb1b.png" target="_blank"><FONT size="-1">
          vergr&ouml;&szlig;ern?</FONT></A></P>

          <P>Nach dem wir nun zu erst einmal die Oberf&auml;che mit NewIcons
          ge&auml;ndert haben, wollen wir auch etwas an der Menue-Liste &auml;ndern.
          Daf&uuml;r gibt es schon mal Magicmenue. Dieses wird ganz einfach in die
          Wbstartup und die Library in Libs reingepackt. Nur ich selber kenne mich
          hier auf diesen Gebiet nicht allzu gut aus. Wer f&uuml;r diesen Workshop
          eine Ideen hat oder Vorschl&auml;ge machen m&ouml;chte, m&ouml;ge mir bitte
          per Email schreiben.</P>

          <P><B>Autor Horst-Uwe Kroll</B><BR>
          &lt;astrocate@t-online.de&gt;</P>
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

