<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Etusivu</title>
		<meta name="generator" content="Handmade in Finland">
		<meta name="keywords" content="http://saku.amigafin.org">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><i><img src="kuvat/thoriel.jpg" width="187" height="193" alt="Anu" border="1"></i></font></center>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">My&ouml;h&auml;ss&auml; ollaan. Tavanomaiselta lyhyelt&auml; katkokselta vaikuttanut nettiyhteyden tipahdus venyi yli 12 tunnin mykkyydeksi. Aina eiv&auml;t aikataulut natsaa niin kuin pit&auml;isi, mutta Sakun julkaisuviikonloppuihin osuvat yhteensattumat alkavat l&auml;hennell&auml; jo paranormaalin pahempaa puolta. Miss&auml; ovat Juhan af Grann sek&auml; Mulder ja&nbsp;Scully, kun heit&auml; kaivattaisiin? Internet osaa vaivihkaa orjuuttaa: kun siihen tottuu ja pit&auml;&auml; sit&auml; ep&auml;huomiossa itsest&auml;&auml;nselvyyten&auml;, onkin yht&auml;kki&auml; kuin kynsille ly&ouml;ty, kun langat eiv&auml;t laulakaan. Pihahtaisivat edes pikkuisen, mutta eiv&auml;t n&auml;m&auml;k&auml;&auml;n mokomat k&auml;skem&auml;ll&auml; kiekaise. Mr. Murphy on ottanut s&auml;hk&ouml;isen muodon ja nauraa meille verkkop&auml;&auml;tteen sammuneen linkkivalon takaa makoisasti.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kun nyt nettiyhteyteni her&auml;&auml;mist&auml; odotellessa meni &quot;etusivu uusiksi&quot;, oli aikaa v&auml;h&auml;n mietti&auml;, mihin verkottuva maailma on menossa. Perjantaina huippuunsa ylt&auml;nyt Code Red -madon hy&ouml;kk&auml;yssuma, viikonloppuna levinnyt madon II-versio, s&auml;hk&ouml;postiliikenteess&auml; omine nokkineen luikertavat virukset ja Microsoftin kaltaisten suuryritysten suorastaan r&ouml;yhke&auml; v&auml;linpit&auml;m&auml;tt&ouml;myys verkon turvariskeihin (joita ne ovat olleet itse osallisina aiheuttamassa) pist&auml;v&auml;t t&auml;llaisen tavallisenkin sukankuluttajan miettim&auml;&auml;n, millaisessa tilanteessa ollaan vaikkapa kymmenen vuoden kuluttua. Kun oman l&auml;hiverkkonikin palomuuriin takoo asiattomia kurkkijoita ja madonreikien etsij&ouml;it&auml; y&ouml;t&auml; p&auml;iv&auml;&auml;, niin millaisessa asemassa on Tauno Tavallinen, joka ei ymm&auml;rr&auml; porteista muuta kuin ett&auml; sellainen on kotipihan polun p&auml;&auml;ss&auml;? Kiinte&auml;&auml; ja k&ouml;ntt&auml;hintaista nettiletkua markkinoidaan joka sein&auml;nreik&auml;&auml;n, mutta kenelle kuuluu vastuu verkon turvallisuudesta? Vanha reik&auml;, uudet kujeet. Niinp&auml; niin.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Internet-liikenne kasvaa ilman h&auml;irikk&ouml;liikennett&auml;kin sellaista tahtia, ett&auml; palveluntarjoajien kilpajuoksu verkon tukkeutumista vastaan tuntuu toivottomalta. </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Verkossa ei liiku en&auml;&auml; pelkk&auml;&auml; teksti&auml; tai edes kuvia, vaan yh&auml; suurempi osa sis&auml;ll&ouml;st&auml; on kaistaa sy&ouml;v&auml;&auml; bittivirtaa: ohjelmistoja, videota, &auml;&auml;nt&auml;, reaaliaikaisia l&auml;hetyksi&auml; - t&auml;t&auml; paljon parjattua multimediaa. &quot;T&auml;ys &auml;&auml;nt&auml;, vimmaa, tarkoitusta vailla&quot;? Olisi t&auml;ss&auml; Macbethill&auml;kin ihmettelemist&auml;. Ei world wide webi&auml; ollut t&auml;llaiseen suunniteltu, saati sitten HTML:&auml;&auml;. T&auml;m&auml; yksinkertaista ja kevytt&auml; tekstinmuotoilua ja linkitt&auml;mist&auml; varten kehitetty hypertekstin kuvailukieli raahaa nyt sel&auml;ss&auml;&auml;n vilkkuvia, liikkuvia, m&ouml;ykk&auml;&auml;vi&auml; ja paremmuuttaan mouhuavia &quot;gotskaportaaleja&quot;, joita nyky&auml;&auml;n voi rakentaa k&auml;yt&auml;nn&ouml;ss&auml; kuka tahansa. V&auml;hempikin vet&auml;isi kontalleen. Ei siis ihme, ett&auml; yh&auml; useammin tiedon valtatiell&auml; ry&ouml;mit&auml;&auml;n.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ja mit&auml; min&auml; tein loppuviikolla? Imin litrakaupalla imperialistista kolajuomaa kitusiini ja lojuin koneen &auml;&auml;ress&auml; lehte&auml; viimeistellen - ja tuijottaen livestreamia Assembly 2001 -tapahtumasta, mouhuten ja kiroten joka kerta kun kilpailujen aikana l&auml;hetys nyki, nylkytti ja p&auml;tki. Niinp&auml; niin, osa kaksi. Ja onhan se toisaalta hurja ajatus:&nbsp;voin seurata tapahtumaa t&auml;&auml;lt&auml; susirajalta l&auml;hes reaaliajassa. Nettilevitys avaa aivan uusia mahdollisuuksia tapahtumille, jotka eiv&auml;t koskaan ylit&auml; valtakunnallisten medioiden julkaisu- ja levityskynnyst&auml;. Assembly on viime vuosina ollut niill&auml; rajoilla; uutiskynnys on viime vuosina jo ylitetty, sponsorit sen kuin lis&auml;&auml;ntyv&auml;t ja paikallinen kaapeli-tv:kin l&auml;hett&auml;&auml; ohjelmaa tapahtumasta mosaiikkikanavalla, mutta se suuren yleis&ouml;n kiinnostus kuitenkin puuttuu.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Internetin mahdollisuuksia mekin olemme pyrkineet k&auml;ytt&auml;m&auml;&auml;n entist&auml; enemm&auml;n hyv&auml;ksi markkinoidessamme ja tiedottaessamme tulevasta Saku 2001 -tapahtumasta. Aikanaan parin uutissivuston varassa ollut Amiga-uutistarjonta el&auml;&auml; er&auml;&auml;nlaista uutta nousukautta, ja hyvi&auml; sek&auml; seurattuja uutissivustoja on jo kymmeni&auml;, my&ouml;s muilla kielill&auml; kuin englanniksi. Uutiset levi&auml;v&auml;t sivustolta toiselle, ja niinp&auml; Saku 2001:nkin tapahtumasivustolle on tullut osumia ymp&auml;ri maailmaa. Olemme pyrkineet julkaisemaan tapahtumatiedotteita s&auml;&auml;nn&ouml;llisesti ja aina kun jotain uutta varmistuu, niin ett&auml; tapahtuma pysyy ihmisten mieliss&auml; ja uutissivustojen listoilla.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Sivustojen yll&auml;pit&auml;jien ja tapahtumasta kiinnostuneiden, ennest&auml;&auml;n minulle ventovieraiden ihmisten kanssa k&auml;ydyn keskustelun perusteella p&auml;&auml;llimm&auml;iseksi on j&auml;&auml;nyt tunne siit&auml;, ett&auml; se Amigan aikanaan tukehtumiskuolemalta pelastanut k&auml;ytt&auml;j&auml;yhteis&ouml;n voimakas yhteenkuuluvuuden tunne el&auml;&auml; sekin uutta &quot;nuoruuttaan&quot;. En usko, ett&auml; tilanne olisi t&auml;llainen ilman Interneti&auml;. Se yleistyi Amiga-k&auml;ytt&auml;jien kannalta juuri oikeaan aikaan, ja purkeissa ja viestiverkoissa alkanut yhteydenpito on voinut jatkua entist&auml; tehokkaammin ja maailmanlaajuisemmin, vaikka niiss&auml; pieniss&auml; viestiverkoissakin viel&auml; sinnikk&auml;&auml;sti pihisee se tuttu pioneerihenki - n&auml;in my&ouml;s meid&auml;n Sakunetiss&auml;mme, josta Esa Heikkinen kertoo enemm&auml;n t&auml;m&auml;n Sakun Sekalaista-osastossa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ja kuin kaiken t&auml;m&auml;n kruunuksi saapuivat t&auml;m&auml;nvuotiset Assemblyjen kilpailutulokset. Juuri kun oli l&auml;hes alistuttu ajatukseen, ett&auml; Amigan p&auml;iv&auml;t demokilpailuiden huipulla ovat luetut ja siit&auml; tulee j&auml;lleen yksi kone oldskool-kilpailuiden harvenevaan massaan, se pieni sinnik&auml;s henki nosti j&auml;lleen p&auml;&auml;t&auml;&auml;n. Kutina alkoi jo kun RNO:n Amiga-henkinen flash-intro &quot;h&auml;iri&ouml;&quot; otti sarjassa murskavoiton yli kolminkertaisella pistem&auml;&auml;r&auml;ll&auml; toiseksi tulleeseen verrattuna. 4-kiloisissa introissa Amiga on sent&auml;&auml;n hallinnut tapahtumia monena vuonna, ja niin nytkin - kahdeksasta finalistista Amiga-introja oli kaksi, ja ne olivat my&ouml;s ainoat musiikkia sis&auml;lt&auml;v&auml;t tuotokset. Ylivoimainen kaksoisvoittohan siit&auml; tuli, viimevuotisen voittajan Exploderin tekem&auml; &quot;jatko-osa&quot; Humus 2 vei voiton, ja toiseksi tuli Spaceballs vs. Ephidrenan King of Fuck.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kukaan ei kuitenkaan olisi etuk&auml;teen uskonut, ett&auml; yhdistetyn demokilvan voittoon olisi Amiga-demoilla en&auml;&auml; mit&auml;&auml;n asiaa. Muhkeaa 4000 euron (n. 24 000 markkaa) arvoista tapahtuman suurinta ja tavoitelluinta palkintokasaa ykk&ouml;ssijasta p&auml;&auml;si yritt&auml;m&auml;&auml;n viisitoista finalistia, joista vain kaksi oli Amiga-tuotoksia. Ennakkoon niill&auml; ei uskottu olevan mit&auml;&auml;n mahdollisuuksia k&auml;rkeen. Mutta miten k&auml;vi? Tuli p&auml;&auml;tt&auml;v&auml;inen porukka, osa entisi&auml; pitk&auml;n linjan amigisteja, ja n&auml;ytti, mill&auml; voittajademoja tehd&auml;&auml;n - ei rahalla, ei kalliilla laitteistoilla eik&auml; laiskalla suunnittelulla, vaan asenteella ja yhteisty&ouml;ll&auml;.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">MatureFurkin Amiga-demo &quot;Lapsuus&quot; pesi koko porukan yli 3300 pisteen erolla seuraavaan. Ja miksip&auml; ei:&nbsp;&quot;vanhasta rouvasta&quot;, kuten voittajaporukka kunnioittaen konetta kutsui, oli pitk&auml;st&auml; aikaa otettu irti kaikki mahdollinen perinteisin keinoin. Turhaan ei Amigan is&auml; RJ&nbsp;Mical huutanut party-yleis&ouml;lle: &quot;Amiga rules!&quot; Demo ollut pelkk&auml; sarja megac00leja efektej&auml; satunnaisessa j&auml;rjestyksess&auml;, eik&auml; se hy&ouml;dynt&auml;nyt PPC:t&auml;, ei grafiikkakorttia tai muitakaan hienouksia, vaan se oli tiukkaa koodia ja hyv&auml;&auml; suunnittelua. T&auml;st&auml; kannattaa Saku-tapahtuman j&auml;rjestelij&auml;tiiminkin ottaa oppia.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Anu Seilonen</font></p>
					</td>
				</tr>
			</table>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>