<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Etusivu</title>
		<meta name="generator" content="Handmade in Finland">
		<meta name="keywords" content="http://saku.amigafin.org">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><i><img src="kuvat/janne.jpg" width="200" height="186" alt="Anu" border="1"></i></font></center>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Pieni maailma. Osallistuin jo perinteeksi muodostuneeseen tapaani vuotuiseen Assembly-demopartyyn Hartwall Areenalla MBnetin paidassa. Jeesasin j&auml;lleen kerran j&auml;rjestelyiss&auml; ja nautin kavereiden tapaamisesta - ja kuten tavallista, monien sellaistenkin, joita en ollut tavannut aikoihin. T&auml;ll&auml; kertaa yksi tuttavuus nousi kuitenkin ylitse muiden.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Suureksi h&auml;mm&auml;styksekseni Assembly-tapahtumaan osallistui Robert J. &quot;RJ&quot; Mical, joka edusti suomalaista 3D-mobiiliplatformeja kehitt&auml;v&auml;&auml; Fat Hammer -firmaa. Ei t&auml;m&auml; nyt sin&auml;ns&auml; mik&auml;&auml;n ihme ollut, onhan vastaavia yrityksi&auml; sponsoroinut Assemblya aikaisemminkin ja ulkomaisia vieraita on k&auml;ynyt tapahtumaa ihmetteless&auml;...</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Mutta RJ Mical ei ole enemp&auml;&auml; eik&auml; v&auml;hemp&auml;&auml; kuin mister Intuition.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">RJ Mical oli osa alkuper&auml;ist&auml; Amigaa, samassa tiimiss&auml; Jay Minerin, Carl Sassenrathin, Dale Luckin ja muiden Amiga-historian legendaaristen nimien kanssa. H&auml;n oli mukana kuvioissa jo ennen kuin Commodore osti Amigan ja h&auml;n kehitti 80-luvun alussa Intuitionin, Amigan alkuper&auml;isen graafisen k&auml;ytt&ouml;liittym&auml;n. My&ouml;hemmin h&auml;n ty&ouml;skenteli mm. Atari Lynxin ja 3DO:n parissa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AssemblyTV esitti tapahtuman aikana Hartwall Areenalla taltioidun RJ:n haastattelun, jossa MikroBitist&auml;kin tuttu Jukka Kauppinen jutusteli niit&auml; n&auml;it&auml; puheliaan RJ:n kanssa. Itse en ole haastattelua viel&auml; n&auml;hnyt, mutta kuulemani mukaan se on n&auml;kemisen arvoinen. Onneksi Soneran eDome-palvelu tulee lis&auml;&auml;m&auml;&auml;n sen arkistoonsa joskus l&auml;hiaikoina. RJ kertoo haastattelussa mm. Amigan varhaisista vuosista.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">RJ Mical her&auml;tti huomiota tapahtumapaikalla olevien amigistien keskuudessa. Nimmareita pyydettiin ja jakoipa mies jopa tapahtuman demo-kilpailun palkinnot, saaden valtaisat aplodit Assemblyn p&auml;&auml;tteeksi kommentilleen &quot;Amiga rules!&quot;. Kaikki t&auml;m&auml; tuntui jokseenkin ep&auml;todelliselta niin PC-valtaisessa tapahtumassa. Kenties Amiga on viimein saamassa ansaitsemansa kunnian ja paikan jos ei nykyp&auml;iv&auml;ss&auml; niin tietokonehistoriassa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Henkil&ouml;kohtaisesti viel&auml; ep&auml;todellisempaa oli kuitenkin l&ouml;yt&auml;&auml; itseni Hartwall Areenan saunatiloista jutustelemasta RJ Micalin kanssa niit&auml; n&auml;it&auml; Amigasta ja demoscenest&auml;. Ei sill&auml; ettenk&ouml; olisi tottunut puhumaan Amigasta 90-luvun lopun Amiga-pampuille ja muille, mutta RJ Mical ei ollut koskaan saanut mieless&auml;ni kasvoja - asia, joka on omiaan kasvattamaan pelk&auml;n nimen legendaarisuutta.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">On yksi asia puhua vaikkapa jonkun hotellin ravintolassa Petro Tyschtschenkon kanssa VIScorpista tai ESCOMista, mutta RJ Mical oli paikalla Hi-Toron, Lorrainen ja Jay Minerin aikoihin. Itse hyv&auml; jos k&auml;velin viel&auml; silloin. Ja sit&auml; h&ouml;lm&ouml;mm&auml;lt&auml; tuntui, kun lopulta tapasimme ja p&auml;&auml;dyimme juttelemaan saunan j&auml;lkeen Assemblyss&auml; puolituttujen organizereiden keskell&auml;. Skenaarion ihmeellisyys sai minutkin hetkeksi hiljaiseksi - minulla ei ollut edes kenki&auml; tai sukkia jalassa saunan j&auml;ljilt&auml;. Pieni maailma.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Katselimme ja kommentoimme suuren osan illasta ruudulla py&ouml;rineit&auml; demokompoja, joten en ehtinyt kalastella hirve&auml;sti tarinoita miehen Amiga-vuosilta, mutta p&auml;&auml;llimm&auml;isen&auml; j&auml;i mieleen kuinka mukava ja tavallinen kaveri on kyseess&auml;. RJ ei s&auml;&auml;stellyt sanojaan kehuessaan ja ihmetelless&auml;&auml;n Assembly-tapahtumaa ja oli hyvin vastaanottavainen my&ouml;s ihmisten kiinnostukselle h&auml;nen menneisyytt&auml;&auml;n kohtaan.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">RJ viihdytti porukkaa kertomalla niinkin tavallisia juttuja kuin verkkopelikokemuksistaan poikansa kanssa - kuinka he pelaavat eri puolilla taloa ja kommunikoivat radiopuhelimin. Toisaalta amigistia ei voi olla s&auml;v&auml;hdytt&auml;m&auml;tt&auml; kertomus er&auml;&auml;st&auml; RJ:n AmigaOS:n koodiin 80-luvun alussa lis&auml;&auml;m&auml;st&auml; kommentista, jossa h&auml;n valittelee huonoa kiirekoodia ja kehoittaa kommentin lukijaa soittamaan h&auml;nelle ja haukkumaan &auml;&auml;li&ouml;ksi.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kuulemma puhelin on soinut vuosien saatossa useita kertoja. Viimeksi ihan muutamia kuukausia sitten. Soittajana oli ollut ilmeisesti joku Amiga Inc.:lt&auml; tai Haage &amp; Partnerilta.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vaihdoimme illan p&auml;&auml;tteeksi k&auml;yntikortteja ja sovimme olevamme yhteydess&auml; - kenties mies ehtii viihdytt&auml;m&auml;&auml;n suomalaisia amigisteja toistekin, nyt kun ty&ouml; tuo usein Suomeen.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kortissa lukee vaatimattomasti: RJ Mical - inventor, engineer</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Janne Sir&eacute;n </font></p>
					</td>
				</tr>
			</table>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>