<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Etusivu</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Terho Henriksson &lt;<a href="mailto:terho.henriksson@kopteri.net">terho.henriksson@kopteri.net</a>&gt; </font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<div align="center">
							<br>
							<img src="kuvat/saku2001kuva.jpg" width="298" height="198" border="0"><br>
							<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><i>Saku 2001 -tapahtumassa Amiga on p&auml;&auml;osissa</i></font></div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">1. syyskuuta 2001 Tiedekeskus Heurekassa Vantaalla tapahtuu taas Amigan merkeiss&auml;. Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. esitt&auml;&auml; j&auml;lleen kerran tapahtuman, jossa amigisti viihtyy ja voi n&auml;hd&auml; ja kokea Amiga-maailman uutuudet. Saku-tapahtuma on syntynyt edellisten tapahtumiemme aikana ker&auml;tyst&auml; tietotaidosta ja Saku-j&auml;rjestelij&auml;tiimin hellitt&auml;m&auml;tt&ouml;m&auml;st&auml; yhteisty&ouml;st&auml; rakentaa vapaaehtoisvoimin tapahtuma, joka muistetaan. Mukaan on lis&auml;tty uusia kuvioita. Koko tiimill&auml; on ollut j&auml;rjestelyjen ajan sama yhteinen tavoite: Saku-tapahtumasta tulee kaikille vierailijoille ikimuistoinen kokemus.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku-tapahtumassa vieraat voivat tutustua samanhenkisiin ihmisiin ja n&auml;hd&auml; my&ouml;s Amiga-maailmassa vaikuttavia t&auml;rkeit&auml; henkil&ouml;it&auml; ulkomailta. Tapahtumaan saapuva Cloanton johtaja Michael C. Battilana kertoi, h&auml;n haluaisi nimenomaan tutustua tavallisiin Amiga-k&auml;ytt&auml;jiin Suomessa. T&auml;m&auml;n lis&auml;ksi h&auml;n esitt&auml;&auml; tapahtumassa demonstraatioita auditoriossa ja n&auml;yttelytilassa. K&auml;y tervehtim&auml;ss&auml; Cloanton johtajaa Saku-tapahtumassa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku-tapahtuma on t&auml;ll&auml; kertaa my&ouml;s katsaus uuteen teknologiaan, joka muuttaa ajatuksen atk-laitteista aivan uudenlaiseksi. PDA-mikrot (Personal Digital Assistant) tuovat uudet tuulet multimedian hy&ouml;dynt&auml;miseen p&auml;ivitt&auml;in. Enenev&auml;ss&auml; m&auml;&auml;rin multimediaa voidaan n&auml;hd&auml; kaikkialla kahviloista metroihin, kun k&auml;sikokoinen mikro on helppo ottaa mukaan minne vain. Tietysti mik&auml;&auml;n ei toimi ilman kunnon k&auml;ytt&ouml;ymp&auml;rist&ouml;ohjelmistoa. Amigan teknologiaosaaja Fleecy Moss esittelee Amigan PDA-k&auml;ytt&ouml;ymp&auml;rist&ouml;&auml; AmigaDE:t&auml; (Digital Environment) ensimm&auml;isen&auml; Suomessa Saku-tapahtumassa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Edellisiss&auml; kappaleissa mainitsin vain osan Saku-tapahtuman kohokohdista. Viimeiset suunnitelmat ohjelmasta ly&ouml;d&auml;&auml;n lukkoon l&auml;hiviikkojen aikana. J&auml;rjest&auml;j&auml;tiimiss&auml; tunnetaan jo j&auml;nnityst&auml;, koska tied&auml;mme, ett&auml; kun tapahtuman sis&auml;lt&ouml; ja j&auml;rjestelyrutiinit on saatu viimeistelty&auml;, olemme p&auml;&auml;sseet niihin tavoitteisiin, jotka Saku 2001 -tapahtumalle asetettiin. Usko Amiga-merkin tulevaisuuteen on vahva, ja my&ouml;s tapahtuma itsess&auml;&auml;n hoitaa yhdistyksen t&auml;rke&auml;&auml; roolia tiedottaa Amigan uutuuksista sek&auml; vierailijoille ett&auml; medialle Suomessa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Viel&auml; on loppurutistuksen vuoro. Tapahtumaan on vajaa kuukausi aikaa, ja kiirett&auml; riitt&auml;&auml; itse kullakin Saku 2001 -j&auml;rjestelytiimiss&auml;. Mutta olemme varmoja, ett&auml; ty&ouml;mme on sen arvoista. Saavu siis Saku 2001-tapahtumaan ja tule kanssamme todistamaan, ett&auml; Amiga-merkill&auml; on edelleen oma t&auml;rke&auml; osansa Suomessa ja koko atk-maailmassa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tapahtumaterveisin,<br>
								<br>
								Terho Henriksson<br>
								Tapahtumavastaava, Saku 2001</font></p>
					</td>
				</tr>
			</table>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>