<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Toimitukselliset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Toimitukselliset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<font face="Trebuchet MS,Verdana,Arial,Helvetica">
				<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
					<tr>
						<td bgcolor="#d8ecfd" width="50%">
							<table width="100%">
								<tr>
									<td width="300"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY.</font></td>
									<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">KOKOUSMUISTIO</font></td>
								</tr>
								<tr>
									<td width="300"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">HALLITUS 2001-2002</font></td>
									<td></td>
								</tr>
								<tr>
									<td width="300"></td>
									<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">8.9.2002</font></td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
								HALLITUKSEN KOKOUS 1/2002<br>
								<br>
							</font>
							<table width="100%">
								<tr>
									<td valign="top" width="100"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">AIKA</font></td>
									<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">29. syyskuuta 2001 - 8. syyskuuta 2002</font></td>
								</tr>
								<tr>
									<td valign="top" width="100"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">PAIKKA</font></td>
									<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Internet-postituslista</font></td>
								</tr>
								<tr>
									<td valign="top" width="100"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">L&Auml;SN&Auml;</font></td>
									<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Terho Henriksson<br>
											Tomi Jaskari<br>
											Timo Kemppaala<br>
											Valtteri Murto<br>
											Jarmo Piippo<br>
											Ville Sarell<br>
											Anu Seilonen<br>
											Paula-Christiina Wirtanen<br>
											Kimmo V&auml;&auml;riskoski<br>
										</font></td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
								<b>1</b><br>
								<b>T&auml;st&auml; kokousmuistiosta<br>
									<br>
								</b>T&auml;h&auml;n muistioon on ker&auml;tty Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n hallituksen Internetiss&auml; postituslistallaan ja IRC-kokouksissaan 29.9.2001 - 8.9.2002 k&auml;ym&auml;n keskustelun p&auml;&auml;kohtia. Otteet ovat eritt&auml;in tiiviit&auml; lyhennelmi&auml;, eik&auml; muistion ole edes tarkoitus sis&auml;lt&auml;&auml; selvityst&auml; kaikista k&auml;sitellyist&auml; aiheista, vaan tuoda esille yhdistystoiminnan kannalta merkitt&auml;v&auml;t seikat.<br>
								<br>
								Hallituksen postituslista tavoittaa kaikki hallituksen j&auml;senet, mutta kaikki eiv&auml;t v&auml;ltt&auml;m&auml;tt&auml; ole ottaneet osaa kaikkiin aiheisiin.<br>
								<br>
								Hallitus on konsultoinut osassa keskusteluitaan yhdistyksen entist&auml; varapuheenjohtajaa, Janne Sir&eacute;ni&auml;.<br>
								<br>
								<b>2</b><br>
								<b>K&auml;siteltyj&auml; aiheita<br>
									<br>
								</b>P&auml;&auml;tettiin pit&auml;&auml; alkuvuodesta 2002 noin kuuden kuukauden mittainen tauko Saku-lehden julkaisussa tavallisen kolmen kuukauden sijaan. Syyn&auml; p&auml;&auml;t&ouml;kseen oli Amiga-uutuuksien ennustettu ilmestymisaikataulu sek&auml; Saku-lehden toimituksen akkujen lataaminen. Tauko tuli tarpeeseen ja toivotettiin toimituksessa tervetulleeksi. Amiga-uutuudet eiv&auml;t tosin ilmestyneet kev&auml;&auml;ll&auml; kuten piti, joten kes&auml;n kynnyksell&auml; tulleessa lehdess&auml; ei ollut paljoakaan uutisoitavaa. Viiv&auml;stykset eiv&auml;t Amiga-maailmassa ole kovin harvinaisia, joten ne eiv&auml;t hallitusta yll&auml;tt&auml;neet.<br>
								<b><br>
								</b></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">P&auml;&auml;tettiin uudistaa Saku-lehden ilmett&auml; kevyesti numeroon 1/2002. P&auml;&auml;tettiin my&ouml;s jatkaa uudistuksia my&ouml;hemmiss&auml; numeroissa. Uudistuksista on vastannut Terho Henriksson ja p&auml;&auml;toimittaja Anu Seilonen.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hallitus keskusteli Terho Henrikssonin ja Janne Sir&eacute;nin aloitteesta yhdistyksen yhdistysilmeen sek&auml; br&auml;ndin uudistamisesta ja ennen kaikkea yhten&auml;ist&auml;misest&auml;. Uudistus tehd&auml;&auml;n asteittain, alkaen vuosikokouksen, Saku-lehden ja aikanaan kotisivujen uudistamisella. Tavoitteena on yhten&auml;inen, ammattimainen ilme kautta linjan. Yhdistysilme dokumentoidaan ja sit&auml; varten tehd&auml;&auml;n dokumenttipohjia, jotta sit&auml; on mahdollista my&ouml;s muiden kuin ammattigraafikoiden noudattaa. Yhteenvetona t&auml;st&auml; keskustelusta Terho Henriksson valmistelee vuosikokoukseen suunnitelman yhdistyksen ilmeen uudistamiseksi.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tiedusteltiin j&auml;senkunnalta Saku-foorumissa kiinnostusta j&auml;rjest&auml;&auml; yhdistyksen vuosikokous jossain muualla kuin Oulussa. Teht&auml;v&auml; lankesi kuitenkin konkreettisten ideoiden puutteessa t&auml;ll&auml;kin kertaa hallituksen ja siten Oulun iskuryhm&auml;n teht&auml;v&auml;ksi. Oulu on toki otollinen paikka saatavilla olevien edullisten ja edustavien tilojen sek&auml; riitt&auml;v&auml;n yleis&ouml;massan ja hyvien kulkuyhteyksien ansiosta, mutta yhdistyksell&auml; on edelleen kiinnostusta laajentaa tapahtumatoimintaansa paitsi muihin suuriin kaupunkeihin, my&ouml;s pienempiin pit&auml;jiin - olemmehan koko Suomen Amiga-kerho. T&auml;m&auml; laajentuminen vaatii kuitenkin j&auml;seni&auml; auttamaan ja edist&auml;m&auml;&auml;n t&auml;llaista kehityst&auml; omalla kotiseudullaan. Avuksi voi olla esimerkiksi tiedottamalla hallitusta mahdollisista kokoustiloista ja auttamalla kokousj&auml;rjestelyiss&auml;.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Keskusteltiin hallituksen j&auml;senten ja yhdistyksen toimihenkil&ouml;iden esteellisyydest&auml; yhdistyksen kokouksissa. Keskustelun pohjaksi oli konsultoitu yhdistyslain ja yhdistystoiminnan tuntevaa lakimiest&auml;. Yhdistyslain 26 &sect; mukaan j&auml;sen ei saa &auml;&auml;nest&auml;&auml; eik&auml; tehd&auml; p&auml;&auml;t&ouml;sehdotusta p&auml;&auml;tett&auml;ess&auml; h&auml;nen ja yhdistyksen v&auml;lisest&auml; sopimuksesta tai muussa asiassa, jossa h&auml;nen yksityinen etunsa on ristiriidassa yhdistyksen kanssa. Hallituksen j&auml;senten ja yhdistyksen toimihenkil&ouml;iden osalta j&auml;&auml;viysm&auml;&auml;r&auml;ys on viel&auml; tiukempi, sill&auml; yhdistyslain 37 &sect; mukaan j&auml;&auml;viyteen riitt&auml;&auml;, ett&auml; ristiriita saattaa olla olemassa. Lis&auml;ksi laissa on m&auml;&auml;r&auml;tty, ett&auml; hallituksen j&auml;sen tai muu, &quot;jolle on uskottu yhdistyksen hallintoon kuuluvia teht&auml;vi&auml;&quot; ei saa &auml;&auml;nest&auml;&auml; p&auml;&auml;tett&auml;ess&auml; tilintarkastajan valitsemisesta tai erottamisesta, tilinp&auml;&auml;t&ouml;ksen vahvistamisesta tai h&auml;nt&auml; itse&auml;&auml;n koskevasta vastuuvapauden my&ouml;nt&auml;misest&auml;.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Esteellisyysongelma on lakimiehen mukaan usein yleinen j&auml;senm&auml;&auml;r&auml;lt&auml;&auml;n ja hallituksensa kooltaan pieniss&auml; yhdistyksiss&auml;. Ongelmaa ei synny, mik&auml;li yhdistyksen kokouksen toimihenkil&ouml;t j&auml;tt&auml;v&auml;t osallistumatta p&auml;&auml;t&ouml;ksentekoon tarvittaessa (eli mik&auml;li eturistiriita on selke&auml;sti olemassa), ja toimihenkil&ouml;in&auml; ovat hallituksen j&auml;senet eiv&auml;t osallistu p&auml;&auml;t&ouml;ksentekoon lainkaan (jotta ristiriitaa ei edes synny).<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hallituksen puheenjohtajan osalta asia on sen sijaan ongelmallisempi. Vaikka yhdistyslaki ja yhdistyksen s&auml;&auml;nn&ouml;tk&auml;&auml;n eiv&auml;t nosta hallituksen puheenjohtajaa muiden hallituksen j&auml;senten yl&auml;puolelle juuri miss&auml;&auml;n suhteessa, on yhdistyksen kokouksen puheenjohtajalla sellaisia lain m&auml;&auml;r&auml;&auml;vi&auml; teht&auml;vi&auml;, joiden vuoksi hallituksen puheenjohtajan ei ole sopivaa toimia kokouksen puheenjohtajana. Yhdistyslain 27 &sect; mukaan kokouksen p&auml;&auml;t&ouml;kseksi tulee &auml;&auml;nten menness&auml; tasan se mielipide, jota puheenjohtaja ilmoittaa kannattavansa. T&auml;st&auml; kannan ottamisesta puheenjohtaja ei voi kielt&auml;yty&auml;. Oikeudellisessa mieless&auml; puheenjohtaja ei siis &auml;&auml;nest&auml;, vaan ilmoittaa mielipiteens&auml;. Katsotaan kuitenkin olevan eettisesti ja yhdistystoiminnan luotettavuuden kannalta suotavaa, ettei hallituksen (toimeenpaneva elin) puheenjohtaja toimi yhdistyksen kokouksen (p&auml;&auml;tt&auml;v&auml; elin) puheenjohtajana.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tulevissa kokouksissa pyrit&auml;&auml;n toteuttamaan n&auml;it&auml; periaatteita esteellisyysongelmien v&auml;ltt&auml;miseksi. Lis&auml;ksi kannattaa muistaa, ett&auml; p&auml;&auml;t&ouml;ksentekoon voivat osallistua vain t&auml;ysivaltaiset yhdistyksen j&auml;senet. Alle 15-vuotiailla ei ole yhdistyksess&auml; lain mukaan &auml;&auml;nioikeutta. Tarvittaessa p&auml;&auml;t&ouml;ksiin osallistuneiden &auml;&auml;nioikeus on tarkistettava j&auml;senrekisterist&auml;.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Saatettiin lainmukaiseen kuntoon j&auml;senrekisterin rekisteriseloste, joka rekisterinpit&auml;j&auml;n on henkil&ouml;tietolain mukaan laadittava henkil&ouml;rekisterist&auml; ja pidett&auml;v&auml; jokaisen saatavilla. Aiemmin t&auml;m&auml; rekisteriseloste on ep&auml;huomiossa puuttunut kokonaan. P&auml;&auml;tettiin hyv&auml;ksy&auml; rekisteriseloste pienien muutosten j&auml;lkeen ja liitt&auml;&auml; se yhdistyksen kotisivuille, jolloin saatavillapit&auml;misvaatimus t&auml;yttyy.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kiitos Janne Sir&eacute;nille ja Anu Seiloselle avusta t&auml;m&auml;n muistion kokoamisesta.</font></td>
					</tr>
				</table>
			</font>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Toimitukselliset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a></font></td>
				</tr>
			</table>
		</center>
	</body>

</html>