<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. AMIGA-Pr&auml;sident Jim Collas nimmt Stellung zu Waitt-Interview

Vor wenigen Wochen hat Ted Waitt, CEO des AMIGA-Mutterkonzerns Gateway, mit 
einem Interview f&uuml;r Unruhe bei einigen Amiga-Usern gesorgt. Einige Tage 
sp&auml;ter hat AMIGA-Pr&auml;sident Jim Collas zu dem Artikel Stellung genommen:

»Liebe Amiganer,

k&uuml;rzlich gab Ted Waitt dem "Guardian Online" ein Interview &uuml;ber generelle
Vorhaben von Gateway. Es wurde auch die Frage gestellt, welche Pl&auml;ne
Gateway mit Amiga habe. Ted antwortete: "Wir haben eine Gruppe von Leuten
darangesetzt, die Verm&ouml;genswerte von Amiga zu einer Ger&auml;te-Strategie f&uuml;r
uns umzusetzen. Wie gut das laufen wird, wei&szlig; ich nicht, das Ergebnis wird
jedoch interessant sein. Amiga hat einige beachtenswerte Verm&ouml;genswerte. Es
ist definitiv kein Computer Gesch&auml;ft."

Dieser Kommentar hat offensichtlich einige Bedenken in der Amiga-Gemeinde
hervorgerufen. Ich m&ouml;chte allen versichern, da&szlig; dieser Kommentar keineswegs
unsere dargelegten Pl&auml;ne mit Amiga beeintr&auml;chtigt. Wir haben unseren Kurs,
einen Next Generation Multimedia Amiga herauszubringen, nicht ge&auml;ndert. Auf
unserer Website habe ich in meinem Mai-Brief an die Gemeinde den neuen
Multimedia-Computer schon beschrieben und auch, wie er sich in ein
komplettes "Information Appliance" Betriebssystem einf&uuml;gt; bitte lest diese
Erkl&auml;rung, denn sie wird Euch helfen, die Amiga Produkt-Strategie zu
verstehen.

Ted's Kommentare beziehen sich auf die Produktpl&auml;ne von Gateway, die
Amiga-Technologie zu nutzen. Gateway ist haupts&auml;chlich interessiert an der
NG Amiga Technologie aufgrund des aufkommenden "Information Appliance"
Marktes. Da&szlig; Gateway sein Augenmerk auf den Informationscomputer mit
Internet-Zugang richtet, ist zu rechtfertigen mit dem extrem hohen
Potential dieses Marktes und mit seiner Bedrohung der PC-Industrie.
Bekannte Industrie-Analytiker haben Information Appliances als "die n&auml;chste
Internet-Welle" bezeichnet und als "eine der aufregendsten Gelegenheiten
des neuen Jahrtausends". Bis zum Jahre 2002 wird prognostiziert, da&szlig;
Information Appliance die PC-Verk&auml;ufe &uuml;berrunden wird, und da&szlig; mehr
Information Appliances an das Internet angeschlossen werden als PCs. Wenn
ich Pr&auml;sident von Gateway w&auml;re, dann w&auml;re dies auch eines meiner vordersten
Augenmerke. Ich bin aber nicht Pr&auml;sident von Gateway, sondern von Amiga und
ich m&ouml;chte die Pl&auml;ne von Gateway mit Amiga nicht durcheinanderbringen. Es
besteht eine bedeutende &Uuml;bereinstimmung in unseren Pl&auml;nen, aber eben auch
ein Unterschied in manchen Ansichten. Ich wurde von Ted ermutigt, Amiga als
eine unabh&auml;ngige Firma zu f&uuml;hren, mit eigener Strategie und Pl&auml;nen. Dies
l&ouml;scht das Hauptproblem aus, das Amiga schon seit Jahren zur&uuml;ckwirft,
n&auml;mlich das Problem, Aufmerksamkeit und Vorrang von gro&szlig;en Mutterfirmen zu
bekommen, die sich auf ihr Hauptgesch&auml;ft konzentrieren.

Bez&uuml;glich Amiga's Strategie habe ich bereits einige Male erw&auml;hnt, da&szlig; Amiga
in den entstehenden gro&szlig;en Markt des Information Appliance einsteigen wird,
um den Impuls f&uuml;r unsere NG-Architektur zu festigen. Deshalb haben wir eine
Architektur herausgebracht, die die Kraft des Multimedia-Computing in ein
komplettes Homecomputing-Umfeld integriert, das au&szlig;erdem Information
Appliances beinhaltet. Dies ist eine revolution&auml;re Architektur und das
Computer-Medium der Zukunft, das starke Leistung und einfache Handhabung
vereint. Es ist ein enormes Unterfangen, das Amiga die Chance gibt, wieder
als bedeutende Technologie in der Industrie aufzusteigen.

W&auml;hrend meiner Reise nach Deutschland und England im letzten Monat habe ich
einer kleinen Gruppe Prominenter der Amiga-Gemeinde Pl&auml;ne und einige
Details der neuen Architektur pr&auml;sentiert. Ich tat dies vertraulich, um
etwas Feedback und Meinungen zu bekommen. Als genau verstanden war, was wir
vorhaben, war das Feedback sehr positiv und die Leute waren sehr begeistert
&uuml;ber die neue revolution&auml;re Architektur. Ich w&uuml;rde der Gemeinde sehr gern
die Details der neuen Amiga-Architektur mitteilen, aber wir sind noch immer
in einem sehr empfindlichen Stadium, was Konkurrenz und anderen
Technologie-Partnerfirmen anbelangt. Ich wei&szlig;, da&szlig; dies frustrierend f&uuml;r
die Gemeinde da ihr schon so lange auf ein NG Produkt wartet. Dennoch
k&ouml;nnen wir erst so viel wie m&ouml;glich an Informationen weitergeben, wenn der
geeignete Zeitpunkt daf&uuml;r gekommen ist.

Ich hoffe, dieser Brief kl&auml;rt die Aussage von Ted Waitt bez&uuml;glich Gateway's
Nutzung von Amiga-Technologie. Ich werde weiterhin so viele Informationen
wie nur m&ouml;glich an Euch weiterleiten. In ein paar Wochen wird mein
Juni-Brief ver&ouml;ffentlicht. Ich kann Euch versprechen, da&szlig; 1999 ein super
Jahr f&uuml;r Amiga und die Amiga-Gemeinde werden wird.

Keep the Momentum Going as we Come Back for the Future.

Herzlichst,
Jim Collas
President und CEO, Amiga«

(Quelle: AMIGA)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
