<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Interview mit Thomas Richter, Entwickler der mmu.library

Thomas Richter werkelt derzeit an der mmu.library, die f&uuml;r Entwickler 
unentbehrlich werden k&ouml;nnte. Er hat den Sourcecode von Enforcer von Manfred 
Sinz erhalten, die Software als MuForce und den ersehnten und nie 
fertiggestellten GuardianAngel als MuGuardianAngel nachprogrammiert. Da sie 
von der MMU Gebrauch machen (mmu.library), &uuml;bersteigen sie die alten Tools 
in ihrer Effizienz um Gr&ouml;&szlig;enordnungen. Es k&ouml;nnte sogar von Speicherschutz 
gesprochen werden.


Thomas Richter:

Wenn ich hier schon mal dazwischenbrabbeln darf: (-:
Ich w&uuml;rde nicht soweit gehen und von Speicherschutz sprechen. Unter 
Speicherschutz verstehe ich, dass Programm A nicht in den Daten von 
Programm B herumfuhrwerken kann, und umgekehrt. Leider ist das Amiga-
Betriebssystem aber so aufgebaut, dass alle Programme auf einen gemeinsamen 
Speicherbereich zugreifen, man spricht auch von "shared memory". Das 
bedeutet insbesondere, dass ein Task problemlos Speicher allozieren kann, 
diesen an einen zweiten Task weiterreichen kann, und der Speicher dann von 
einem dritten Task freigegeben wird, ohne dass das OS von der Weitergabe 
der Resourcen erfahren muss. Die Effizienz des Amiga-OS begr&uuml;ndet sich 
nicht zuletzt auf diesem Mechanismus - es m&uuml;ssen zur Kommunikation zwischen 
Prozessen, also Tasks, keine gro&szlig;en Datenmengen umgeschaufelt werden. Dies 
war bei der Einf&uuml;hrung von AmigaOS auf einem einfachen 68000 mit 7MHz Takt 
von Bedeutung, an Speicherschutz hatte damals noch niemand denken wollen 
oder k&ouml;nnen - er lag in unnahbarer Ferne. Leider hat sich dieses Konzept 
heutzutage &uuml;berlebt.


AMIGA aktuell:

F&uuml;r den normalen User ist dies zwar keine Alternative, da das System durch 
dieses Tool stark abgebremst wird. F&uuml;r Amiga-Softwareentwickler bedeutet 
dies jedoch ohne Frage eine Revolution. Unterst&uuml;tzt werden alle 68k-MMUs, 
von 68551 (020) bis 68060.

Thomas Richter:

Die Idee von MuGuardianAngel ist nicht neu, sie ist recht alt, und dieses 
Tool ist nicht die erste Implementierung der Idee, wie Sie ja schon oben 
bemerken. Die erste Version eines solchen Tools wurde seinerzeit von CBM 
intern verwendet, ich wei&szlig; aber nicht, wer das Programm geschrieben hat 
(Mike Sinz?). 
Leider hat es nie richtig funktioniert und die Entwicklung wurde 
eingestellt, so dass sonst niemand - und ich schlie&szlig;e mich hier ein - 
dieses Programm jemals zu Gesicht bekommen hat. Im Cyberguard findet sich 
mit der "Guard"-Option ein &auml;hnliches Werkzeug, und auf dem Aminet gibt es 
ebenfalls ein GuardianAngelRemix. Allerdings sind dies alles "stand-alone" 
Tools, die sich nicht in eine Reihe von untereinander kompatiblen Tools 
eingliedern lassen und die zum Teil nicht einmal, wie der Cyberguard, 
kompatibel zur eigenen Firmware sind - ppc.library und Cyberguard GUARD 
laufen nicht zusammen.
Ich denke, dass "Otto Normaluser" ein solches Tool normalerweise nicht 
verwenden wird, genausowenig wie er - oder sie - den Enforcer oder MuForce 
wird laufen lassen. F&uuml;r Software-Entwickler ist es aber dennoch von einigem 
Interesse, so hoffe ich zumindest.


AMIGA aktuell:

F&uuml;r User ist diese Library ebenfalls von gro&szlig;er Bedeutung. Viele 
Anwendungen/Tools werden durch diese Library erst sauber zu realisieren 
bzw. &uuml;berhaupt erst erm&ouml;glicht werden.
Warum haben Sie sich entschieden, an der mmu.library 'rumzuwerkeln'?

Thomas Richter:

Die neueren Amiga-Modelle haben mit der MMU - und was das ist sage ich 
vielleicht unten - ein St&uuml;ck Hardware, das sehr effizient zur 
Speicherverwaltung verwendet werden kann. Diverse Programme verwenden die 
MMU demgem&auml;&szlig; f&uuml;r ihre Zwecke, angefangen mit dem Enforcer zum Aufsp&uuml;ren von 
Fehlern in der Software, weiterhin der OxxyPatcher, Systeme, die 
"virtuellen Speicher" implementieren, diverse Emulatoren und einiges mehr. 
Leider gibt es im gesammten Amiga-Betriebssystem keine dokumentierte 
Schnittstelle f&uuml;r diese Hardware, so dass Tool A nicht mit Tool B 
kompatibel ist und man nur mit etwas Gl&uuml;ck eine hoffentlich einigerma&szlig;en 
stabile Konfiguration hinbekommt. 
Die augenblickliche Situation ist etwa so absurd als w&uuml;rde man den Amiga 
ohne die Graphikbibliothek ausliefern und jedes Programm m&uuml;sste seine 
Fenster selbst mit der Hardware malen. Es ist insofern nur zu leicht 
verst&auml;ndlich, dass das nicht wirklich klappen kann.

Was hat mich nun pers&ouml;nlich dazu bewogen, dies zu &auml;ndern? Nunja, als 
Mathematiker habe ich vielleicht ein berufsbegr&uuml;ndetes Interesse an 
kniffligen Problemen und deren L&ouml;sung, vielleicht kann man es so 
ausdr&uuml;cken. Das Problem ist einerseits schwierig genug, um interessant zu 
sein, und andererseits dringend genug, um gel&ouml;st zu werden. F&uuml;r einen 
Hobbyprogrammierer reicht dies als Motivation aus. W&uuml;rden wirtschaftliche 
Interessen eine Rolle spielen, so d&uuml;rfte man heute auf dem Amiga wohl gar 
nichts mehr schreiben, so bedauerlich das ist.
 

AMIGA aktuell: 

Was erhoffen Sie sich dadurch?

Thomas Richter:

Ein konsistentes Interface zur MMU und damit eine Serie von Tools und 
Applikationen, die f&uuml;r den Benutzer problemlos zusammenarbeiten - und nicht 
zuletzt habe ich wieder etwas zum Herumkniffeln lerne eine ganze Menge 
neues &uuml;ber die Hardware. Letztendlich bekomme ich auch Tools, die mir 
selbst bei der eigenen Entwicklerarbeit helfen.


AMIGA aktuell:

Seit wann entwickeln Sie an dieser Library?

Thomas Richter:

Die Idee zur mmu.library trage ich schon seit mehr als einem Jahr in meinem 
Kopf herum. Ausl&ouml;ser diese Library nun wirklich zu schreiben, war eine 
Diskussion in der News-Group comp.sys.amiga.programmer, insbesondere mit 
Karl Uwe Lockhoff und vielen mehr. Das Design der Library war knifflig 
genug, so dass ich erst nach gr&uuml;ndlichem &Uuml;berlegen im Herbst/Winter letzten 
Jahres damit angefangen habe, sie zu implementieren, und, dank vieler 
hilfsbereiter Leute, zu testen - an dieser Stelle nochmal einen herzlichen 
Dank an die Gemeinde netter Tester, deren Rechner und Festplatten ich in 
Beschlag nehmen durfte. Es w&auml;re wohl weitaus schwieriger geworden!
 

AMIGA aktuell:

Werden alle 68k-MMUs vollst&auml;ndig unterst&uuml;tzt? Gibt es vielleicht kleine 
Einschr&auml;nkungen?
Nicht alle unsere Leser sind mit dem Begriff 'MMU' vertraut. K&ouml;nnten Sie 
bitte kurz die Funktionsweise erl&auml;utern?

Thomas Richter:

Es werden alle verf&uuml;gbaren Mc68Ks unterst&uuml;tzt, angefangen von der 68851, 
die externe MMU des 68020, bis zum 68060 - die Unterst&uuml;tzung der MMUs ist 
so komplett, wie ich sie machen konnte, angefangen von der M&ouml;glichkeit, 
mehrere MMU-Tabellen zu erstellen und damit jedem Task im Prinzip seinen 
eigenen Addressraum zu geben - interessant f&uuml;r Emulatoren z.B. - &uuml;ber die 
Programmierung der Seitengr&ouml;&szlig;e der MMU innerhalb des technisch M&ouml;glichen 
bis zur Verwaltung der MMU-Ausnahmezust&auml;nde wie etwa ausgel&ouml;st durch 
Zugriffe auf gesch&uuml;tzte Speicherbereiche. Z.B. enth&auml;lt der "Enforcer" - 
oder "MuForce", wie das Programm jetzt hei&szlig;t, enth&auml;lt demnach keinerlei 
CPU/MMU spezifischen Code mehr, es verwendet allein ein konsistenten 
Softwarelayer der Library.

Da sich die einzelnen MMUs zum Teil etwas unterscheiden, gibt es nat&uuml;rlich 
ein paar Einschr&auml;nkungen, das ist klar. Das Interface soll - muss - ja 
immer das gleiche bleiben, so dass ich zum Teil gewisse Features einer MMU 
auf einer anderen emulieren muss, sofern dies &uuml;berhaupt m&ouml;glich ist. Ohne 
jetzt wirklich ins Detail gehen zu wollen, sonst werde ich zu technisch, 
unterst&uuml;tzt die Library zum Beispiel keine der exotischeren Features der 
68851-MMU, da diese auf keinem anderen Mitglied der MC68K-Familie auch nur 
ann&auml;hernd vorhanden sind oder durch Trickserei eingebaut werden k&ouml;nnten. 
F&uuml;r die oben genannten Applikationen sind diese Spezialit&auml;ten auch nur von 
geringem Interesse.

Eine weitere gro&szlig;e Einschr&auml;nkung ist die Unterst&uuml;tzung eines PPC mit der 
ppc.library, d.h. durch PowerUp. Da man sich seitens P5 geweigert hat, mir 
die ppc-Library-Internals zu dokumentieren, wird es hierzu entgegen meiner 
urspr&uuml;nglichen Planung keinerlei Support geben. WarpUp wird im Gegensatz 
dazu jedoch unterst&uuml;tzt, einfach weil es sehr viel sorgf&auml;ltiger und mit 
Bedacht implementiert ist, so dass ich mich letztendlich gar nicht um eine 
Sonderbehandlung des PPC habe bem&uuml;hen m&uuml;ssen - es funktioniert "auch so". 
Da jedoch von Frank Wille eine Emulation der ppc.library f&uuml;r WarpUp 
entwickelt wird, stellt dies hoffentlich auch keine wirkliche Einschr&auml;nkung 
dar. 
Eventuell wird es auch Unterst&uuml;tzung f&uuml;r einen von der PPC CPU emulierte 
68040 geben, sollte es &uuml;berhaupt Bedarf f&uuml;r eine solche "Sonderbehandlung" 
geben.

Ein drittes Problem sind Festplattenkontroller mit DMA, die entgegen den 
Richtlinien gewisse Os-Funktionen nicht aufrufen. F&uuml;r den Normalbetrieb der 
Library und der Tools ist dies relativ bedeutungslos, aber z.B. 
Anwendungen, die etwa mit der MMU den Speicher defragmentieren, also eine 
effizientere Speicherverwaltung implementieren, werden dann mit diesen 
Boards nicht funktionieren - etwas dieser Art gibt es im Augenblick sowieso 
noch gar nicht.
Dies betrifft einerseits wieder die Boards von P5, sowie GVP-Adapter. 
Letztere k&ouml;nnen durch Aufr&uuml;sten mit dem Guru-ROM allerdings "MMU-tauglich" 
gemacht werden, nichtzuletzt weil sich Ralph Babel netterweise so 
hilfsbereit zeigte und mir einige Internals dokumentierte. Bekannte PIO-
Adapter wie das bekannte oktagon.device von Oliver Kastl haben hiermit 
&uuml;berhaupt keine Probleme, das Problem entsteht konstruktionsbedingt gar 
nicht.

Vielleicht nun zur letzten Frage, die ich zuerst h&auml;tte beantworten m&uuml;ssen:

MMU bedeutet "memory management unit", etwa "Einheit zur 
Speicherverwaltung". 
Die MMU ist eine der eigentlichen Recheneinheit vorgeschaltete Logik -
heutzutage meist in gleichen Chip untergebracht - die alle Speicherzugriffe 
abf&auml;ngt, ggf. umlenkt, ggf. der CPU das Schreiben auf die Speicherbereiche 
verbietet, die Art, wie die CPU mit dem eingebauten Cache umgeht, 
kontrolliert und einiges mehr. Zugriffe der CPU auf den Speicher werden 
gewisserma&szlig;en durch die MMU "zensiert", so dass eine Speicheraddresse, wie 
sie einem Programm erscheint, nicht mit der physikalischen Speicheraddresse 
&uuml;bereinstimmen muss, die auf dem Bus des Rechners zu sehen ist.
Die MMU kann somit etwa RAM auf die Addressen des Kickstart-ROMS "spiegeln" 
und damit langsamere ROM-Zugriffe durch schnellere RAM-Zugriffe erstetzen. 
Das bekannte "CPU FastROM" in der Startup-Sequence macht genau dies. Beim 
"Enforcer" wird z.B. der Zugriff auf nicht existente Speicherbereiche 
gesperrt, so dass fehlerhafte Software damit einen Ausnahmezustand ausl&ouml;st 
und damit seinerseits den Enforcer zum "Meckern" bringt.


AMIGA aktuell:

Welche Rolle kann diese Library/die MMU f&uuml;r das AmigaOS spielen, da die 
Implementierung von z B. Speicherschutz eh nicht m&ouml;glich ist?

Thomas Richter:

AmigaOS wird meiner Einsch&auml;tzung nach sowieso keine Rolle mehr spielen, 
insofern wird die Library vermutlich auf dem "Hobby"-Niveau verbleiben. Ich 
w&uuml;rde mich nat&uuml;rlich &uuml;ber Interesse seitens kommerzieller 
Softwarehersteller freuen, aber aufgrund der Marktposition des Amigas halte 
ich das f&uuml;r extrem unwahrscheinlich.

Einerseits hilft die Library dem Entwickler durch Bereitstellen von 
entsprechenden Tools, andererseits hilft sie durch Bereitstellen von 
Funktionen, die bislang nur schwierig oder gar nicht, oder nur unter 
Kompatibilit&auml;tseinbu&szlig;en zu erreichen waren. Typische Anwendungen der 
mmu.library - neben den oben genannten Entwicklertools - w&auml;ren etwa 
Emulatoren oder Programme, die in einer "rauhen" Umgebung arbeiten m&uuml;ssen 
und demnach aktiv vor der Modifikation durch fehlerhafte Software - oder 
zum Teil sogar durch sich selbst - gesch&uuml;tzt werden wollen. Debugger oder 
Mailbox-Systeme und Server kommen mir da in den Sinn. Dieser Schutz muss 
aber explizit von der mmu.library angefordert werden, erfolgt also nicht 
automatisch durch das Os, und erfordert ebenso eine geeignete 
Programmgestaltung. Ein gewisser Vorl&auml;ufer zur Nachbearbeitung von 
Programmen liegt dem augenblicklichen Archiv in Form des "MuLink" 
Programmes bereits vor, allerdings erfolgt der Programmschutz nur soweit 
Kompatibilit&auml;tsprobleme dies zulassen und ist damit unvollst&auml;ndig. 
Letztendlich muss der Entwickler einer Software zur Library greifen und 
selbst t&auml;tig werden. AmigaOS l&auml;sst sich nachtr&auml;glich ein *automatischer* 
Schutz nicht aufst&uuml;lpen.
 

AMIGA aktuell:

Was exakt bedeutet die Library f&uuml;r den Entwickler und f&uuml;r den User 
(abgesehen von bugfreier Software)?

Thomas Richter:

F&uuml;r den Entwickler schnelleres Finden von Fehlern, ganz klar. F&uuml;r den User 
ein Bundle von "Power-Software", die garantiert zusammenarbeitet und sich 
nicht untereinander von den Resourcen abschneidet oder sich selbst auf die 
F&uuml;&szlig;e trampelt. 
Erste Schritte dazu gibt es bereits mit den "MuTools", einer der 
Distribution beigelegten Toolsammlung mit "typischen" MMU-Anwendungen vom 
ROM-Remapper bis zum Enforcer-artigen Debugging Tool.

Im Grunde genommen ist dies die Motivation der Library: Eine vern&uuml;nftige 
Plattform schaffen, auf der aufbauend - entsprechend einer 
Graphikbibliothek - Applikationen miteinander die MMU ausnutzen und 
ausreizen k&ouml;nnen.

Letztendlich bedeutet das auch, dass sich Programmideen realisieren lassen, 
die vorher in dem Ma&szlig;e nicht m&ouml;glich waren, oder nur mit einer ungleich 
l&auml;ngeren Entwicklungsarbeit und Spezialversionen f&uuml;r jeden Prozessor und 
jede Konfiguration. Dieser Entwicklungsvorteil ist dann letztendlich auch 
ein Vorteil  f&uuml;r den "Endverbraucher", so hoffe ich zumindest.


AMIGA aktuell:

Wann wird es eine erste &ouml;ffentliche Release geben?

Thomas Richter:

Die Releases sind bereits &ouml;ffentlich auf meiner Homepage 
(http://www.math.tu-berlin.de/~thor/thor/index.html; Anm. d. Red.) 
abzugreifen, und die stabilieren Versionen erscheinen regelm&auml;&szlig;ig auf dem 
Aminet, wobei ich mich allerdings etwas zur&uuml;ckhalte. Ich m&ouml;chte das Aminet 
einfach nicht mit "beta"-Software &uuml;berschwemmen, einfach weil "beta = beta 
than nothing" f&uuml;r 
"Otto Normaluser" Entt&auml;uschungen bedeuten k&ouml;nnen. Es ist einfach noch nicht 
alles in dem Ma&szlig;e getestet, wie es getestet sein sollte.

Vom Umfang der Library ist das augenblickliche Release - die 0.35 - schon 
komplett. Sollten sich nicht irgendwelche neuen Schwierigkeiten einstellen, 
so hoffe ich, dass eine Gamma-Version in einem Monat und die endg&uuml;ltige 
Version im August oder September verf&uuml;gbar sein wird.


AMIGA aktuell: Welche Entwicklung kann man in Verbindung mit der 
mmu.library noch erwarten? Vielleicht eine memory.library, neue 680x0-Libs?

Thomas Richter:

Ich werde vermutlich noch eine "Virtual Memory" Applikation schreiben, die 
wieder auf einer Bibliothek aufbauen wird, dies ist die geplante 
"memory.library", die Sie erw&auml;hnen. Diese Bibliothek wird nat&uuml;rlich wieder 
auf der "mmu.lib" aufbauen. Auf der "memory.library" aufbauend plane ich 
einen VMM-artigen Patch, der "virtual memory" auch f&uuml;r die &uuml;blichen 
Applikationen bereitstellt, allerdings mit den damit verbundenen "Risiken 
und Nebenwirkungen", die ein solcher Patch mit sich bringt.

Ob es eine neue 68040.library geben wird, habe ich noch nicht entschieden. 
Im Prinzip w&auml;re es n&ouml;tig, da die augenblicklichen Versionen Dinge "doppelt" 
machen - eine rudiment&auml;re MMU-Verwaltung n&auml;mlich - die die mmu.library 
besser und komfortabler erledigen kann. Gewisse Programmteile der 
68040.library, wie z.B. die Emulation einiger FPU (Flie&szlig;komma) Befehle 
finden sich auf den Motorola-Seiten und liegen bereits auf meinem System. 
Ob ich mich einmal an die Implementierung wage, steht allerdings noch in 
den Sternen.

Eine 68060.library werde ich leider nicht schreiben k&ouml;nnen, da mir einfach 
ein entsprechendes '060-basiertes System fehlt - es war knifflig genug, den 
MMU-Support f&uuml;r einen Prozessor zu schreiben, den ich nicht habe und auf 
dem ich demnach nicht testen kann, nicht zu reden von dem Aufwand, die 
FPU-Emulation "blind" zu stricken. Das ist mir dann doch ein paar Nummern 
zu gro&szlig;.


AMIGA aktuell:

Wird bzw. k&ouml;nnte es einen PowerPC-Port geben?

Thomas Richter:

Ja und nein. Ich denke, ich werde versuchen, die mmu.library unter einer 
PPC-Emulation zum Laufen zu bekommen. Dazu sollte nicht allzuviel zu tun 
sein, da die von Sam Jordan entwickelte 68040-Emulation sehr vollst&auml;ndig 
ist - vermutlich beschr&auml;nkt es sich auf das Anpassen einiger Details in der 
Verwaltung von MMU-Ausnahmezust&auml;nden, wenn ich &uuml;berhaupt irgendetwas 
anpassen muss.

Es wird aber vermutlich keine mmu.library auf der PPC-Seite geben, einfach 
weil WarpOS schon selbst Funktionen zur Programmierung der MMU bereitstellt 
und die Library damit einfach unn&ouml;tig ist. &Uuml;ber den Umfang der MMU-
Unterst&uuml;tzung seitens WarpOs kann ich allerdings recht wenig sagen, da ich 
mich noch nicht eingehend damit besch&auml;ftigt habe, wie die PPC MMU 
funktioniert. Sie unterscheidet sich von der MC68K MMU konzeptionell doch 
ein wenig, insofern lassen sich die Designgrundlagen der mmu.library nicht 
notwendig vollst&auml;ndig auf den PPC &uuml;bertragen. 


AMIGA aktuell:

Vielen Dank f&uuml;r das Interview. Ich w&uuml;nsche Ihnen alles Gute!

Thomas Richter:

Vielen Dank auch f&uuml;r Ihr Interesse und weiterhin viel Spa&szlig;!


Das Interview wurde gef&uuml;hrt von Sofiane Ben Hassine.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
