<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Vorwort
-------

+++ AMIGA plant Auslieferung des AmigaOS 3.5 am 21. August +++ Entwicklung 
des AmigaNG schreitet voran +++ AMIGA bereitet baldige Ver&ouml;ffentlichung 
eines Produkt-Strategie- und -Technologiepapiers vor +++ AMIGA stellt 
weitere F&uuml;hrungskr&auml;fte ein +++

Soweit die Schlagzeilen des Monats Juni. Willkommen damit zur neuen Ausgabe 
von AMIGA aktuell.

Abgesehen von den Aktivit&auml;ten bei AMIGA verlief der vergangene Monat wieder 
einmal eher ruhig, was angesichts des beginnenden Sommers jedoch zu 
erwarten war. F&uuml;r das gr&ouml;&szlig;te Aufsehen sorgte wohl noch das schnelle 
Zustandekommen der ben&ouml;tigten 500 Vorbestellungen f&uuml;r die von Microcode 
Solutions erwogene PowerPC-Version von Fusion. Damit d&uuml;rfte das Projekt 
tats&auml;chlich Realit&auml;t werden.

In dieser AMIGA-aktuell-Ausgabe hat eine neue Rubrik Premiere: Sofiane Ben 
Hassine k&uuml;mmert sich ab sofort um die Interview-Sektion und will euch jeden 
Monat mit aktuellen und interessanten Gespr&auml;chen versorgen.
Ab der n&auml;chsten Ausgabe wird es &uuml;brigens eine weitere neue Rubrik geben.


Die Interna der heutigen Ausgabe:

* Besucht jemand von euch die 'World of Amiga', die am 24./25. Juli in      
  London stattfindet? Dann bitte Mail an mich (aakt@gmx.de).

* Das Mailboxsterben geht offenbar weiter: Auch die 'Insufficent Memory',   
  in der u.a. AMIGA aktuell abrufbar war, scheint nicht mehr in Betrieb zu  
  sein.
  Sch&ouml;n w&auml;re es jedoch, wenn ich vom Ende einer Mailbox nicht erst durch    
  zur&uuml;ckgehende Mails erfahren w&uuml;rde...


Zu den regelm&auml;&szlig;igen Aufrufen:
    
* Weiterhin gesucht werden Tester von frei kopierbarer Software. Jeder, der  
  sich f&uuml;r diese Aufgabe bereit erkl&auml;rt, wird in eine spezielle             
  Verteilerliste eingetragen und erh&auml;lt dann in unregelm&auml;&szlig;igen Abst&auml;nden    
  Test-Vorschl&auml;ge, ist aber zu nichts verpflichtet.
  Nat&uuml;rlich freuen wir uns aber genauso &uuml;ber Tests kommerzieller            
  Produkte und nicht &uuml;ber die Verteilerliste vorgeschlagener FD-Software.
  Schreibt an aakt@gmx.de .


Viel Spa&szlig; jetzt bei dieser Ausgabe,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
