<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Update: So senkt ihr eure Telekom-Rechnung!

Im vergangenen Monat ist es (leider) zu einer Kuriosit&auml;t gekommen: 
Ausnahmsweise hat eine Telefongesellschaft ihre Geb&uuml;hren nicht gesenkt, 
sondern erh&ouml;ht! Die Rede ist von 3U und seinen Mobilfunktarifen. 
Hoffentlich macht das Beispiel keine Schule...

Negativ verlaufen ist die Internet-Aktion von Point of Presence: Das 
Unternehmen hat am 29. Juni zwischen 21 und 24 Uhr die kostenlose Nutzung 
des Internets angeboten. Bei Einwahl &uuml;ber die Telefongesellschaft Talkline 
h&auml;tte man dank eines Sondertarifs nur 1 Pfennig pro Minute f&uuml;r die 
Internet-Verbindung gezahlt - theoretisch, denn kurz vor 21 Uhr hat 
Talkline alle Leitungen zu Point of Presence gekappt. Das war nicht nur 
eine sehr unfreundliche Geste gegen&uuml;ber den Internet-Nutzern, sondern auch 
rechtswidrig.

Unklar ist, ob die Telefongesellschaft 01051 mittlerweile wieder in ganz 
Deutschland nutzbar ist. Dann w&auml;re sie n&auml;mlich mo-fr von 9-18 Uhr mit 9 
Pfennig pro Minute (Festnetz -&gt; Festnetz) konkurrenzlos g&uuml;nstig. 
Ausprobieren kann sich also lohnen. Die Vorwahl lautet nat&uuml;rlich 01051.
Eine Bitte: Wenn du 01051 nicht nutzen kannst, dann gib mir Bescheid 
(aakt@gmx.de).
 
Ebenfalls zu erw&auml;hnen ist, dass o.tel.o seine "Happy Hour" (ab 21 Uhr f&uuml;r 
vier Pfennig pro Minute telefonieren) bis zum 15. Juli verl&auml;ngert hat. Wenn 
dieser Tarif im Anschluss daran nicht regul&auml;r eingef&uuml;hrt bzw. ein weiteres 
Mal verl&auml;ngert wird, sollte man dann zwischen 21 und 22 Uhr Viag Interkom 
(01090) oder Esprit (01040) verwenden. Ich werde euch aber rechtzeitig in 
einem AMIGA-aktuell-Special &uuml;ber die Gegebenheiten informieren.


Jetzt aber zur aktuellen Tarif&uuml;bersicht:

G&uuml;nstigster Call-by-Call-Anbieter (ohne Anmeldung, Mindestumsatz, etc.):

Wann:    |      Wohin:  Festnetz -&gt; Festnetz      Festnetz -&gt; Mobilfunknetz
===========================================================================
werktags 9-17 Uhr       TelDaFax (01030), 12 Pfg.  Debitel (01015), 45 Pfg.  
werktags 17-18 Uhr      Interoute (01066), 8 Pfg.  Debitel (01015), 45 Pfg.  

sa/so/feiert. 9-17 Uhr  Viatel (01079), 8,5 Pfg.¹  Viatel (01079), 36 Pfg.³
sa/so/feiert. 17-18 Uhr Interoute (01066), 8 Pfg.  Viatel (01079), 36 Pfg.³  

t&auml;glich 18-19 Uhr       Interoute (01066), 8 Pfg.   Viatel (01079), 36 Pfg.
t&auml;glich 19-20 Uhr       Mobilcom (01019), 8 Pfg.²   Viatel (01079), 36 Pfg.
t&auml;glich 20-21 Uhr       3U (01078), 5,9 Pfg.        Viatel (01079), 36 Pfg.
t&auml;glich 21-22 Uhr       o.tel.o (01011), 4 Pfg.     Viatel (01079), 36 Pfg.
t&auml;glich 22-7 Uhr        Talkline (01050), 3,9 Pfg.  Viatel (01079), 36 Pfg.
t&auml;glich 7-8 Uhr         Esprit (01040), 5 Pfg.      Viatel (01079), 36 Pfg.
t&auml;glich 8-9 Uhr         Viatel (01079), 5,5 Pfg.    Viatel (01079), 36 Pfg.

¹: An Feiertagen, die nicht aufs Wochenende fallen, ist TelDaFax (01030)    
   mit 9 Pfg. g&uuml;nstiger (s.u., Geb&uuml;hrenberechnung).
²: Bei Verbindungen von bis zu etwa 7 Minuten Dauer kann TelDaFax (01030)   
   mit 9 Pfg. g&uuml;nstiger sein (s.u., Geb&uuml;hrenberechnung).
³: An Feiertagen, die nicht aufs Wochenende fallen, ist Debitel (01015)      
   mit 45 Pfg. g&uuml;nstiger (s.u., Geb&uuml;hrenberechnung).


Die Tabelle sollte im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige 
Anmerkungen:

* Angegeben ist jeweils der f&uuml;r 1 Verbindungsminute f&auml;llig werdende Betrag.

* 'Werktags' bedeutet montags bis freitags mit Ausnahme von Feiertagen.

* Bei Ortsgespr&auml;chen hat die Telekom in weiten Teilen Deutschlands noch ein  
  Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften      
  g&uuml;nstige City-Tarife an. In der Regel hei&szlig;t es also bei                  
  Ortsgespr&auml;chen: Weiterhin die Deutsche Telekom benutzen.
  Auf http://www.muc.de/~hm/telefon-tarife/tarifzonen.html k&ouml;nnt ihr        
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte  
  es mal passieren, dass ihr "f&auml;lschlicherweise" einen der alternativen     
  Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom    
  - und damit wom&ouml;glich billiger - zustande kommen k&ouml;nnte.

* Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,      
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass    
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im     
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen     
  l&auml;sst. Mein Favorit: http://www.teltarif.de/db/index.html


Die Anbieter verfahren bei der Geb&uuml;hrenberechnung teilweise 
unterschiedlich:

* TelDafax, Debitel und 3U rechnen sekundengenau ab, d.h. ihr zahlt hier  
  wirklich nur f&uuml;r die Zeit, die die Verbindung andauert.

* Viatel berechnet mo-fr zwischen 9 und 18 Uhr bei Verbindungen bis 30      
  Sekunden Dauer die gesamten 30 Sekunden, danach wird exakt abgerechnet. 
  Zu anderen Zeiten wird minutenweise abgerechnet.
  ACHTUNG: An Feiertagen, die nicht aufs Wochenende fallen, rechnet Viatel  
  nach dem Werktags-Tarif ab.

* Mobilcom, o.tel.o, Talkline, Esprit und Interoute rechnen minutenweise    
  ab.


F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
