
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Metal Corner</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">


<h1><CENTER><FONT COLOR="GREEN">Pegazus: Breaking The
Chains</FONT></CENTER></h1></P>

Wie man schon an dem klischeehaften Titel der CD und an dem Marschall Cover
unschwer erkennen kann, spielen Pegazus True Metal. Da diese Richtung in den
letzten Monaten allerdings stark &#252;berstrapaziert wurde (was teilweise in
absolute L&#228;cherlichkeiten ausartete), wei&#223; man nie so genau, ob man solche
CD`s &#252;berhaupt noch mit dem Arsch angucken sollte. Im Falle von &quot;Breaking The
Chains&quot; ist diese Frage allerdings mit einem klaren &quot;Ja&quot; zu beantworten&quot;.
Musikalisch dominieren eing&#228;ngige Riffs, die von einer brillianten Stimme
der Marke Bruce Dickinson getragen werden. Zwar geh&#246;ren die Songs sicherlich
nicht in die Kategorie &quot;kulturell wertvoll&quot;, aber diesen Anspruch stellen
Pegazus an sich auch gar nicht. In erster Linie will die Band Spa&#223; haben und
dr&#252;ckt diesen, &#228;hnlich HammerFall, mit zahlreichen Klischees aus; wer davon
genug hat, sollte lieber einen weiten Bogen um die CD machen, denn schon der
fulminate Opener &quot;Metal Forever&quot; beinhaltet derrer viele. Musikalisch ist
dabei alles im gr&#252;nen Bereich umd Ohrw&#252;rmer wie &quot;The Crusade&quot;, &quot;Breaking The
Chains&quot; oder &quot;Chariots Of The Gods&quot; werdem jedem HammerFall J&#252;nger wie &#214;l
runtergehen. Quasi als Bonus befinden sich auf der CD noch neu eingespielte
Versionen von &quot;Bastards Of War&quot; (Anspieltip!) und &quot;Apache Warrior&quot;, die um
einiges besser r&#252;berkommen, als die produktionstechnisch verkorksten
Originale. Und last but not least w&#228;re da die Helloween Coverversion &quot;A
Little Time&quot;, die zwar nicht zu den kompositorischen Highlights der
K&#252;rbisk&#246;pfe geh&#246;rt, aber in dieser Version dennoch ordentlich rockt. 
Insgesamt also eine musikalisch einwandfreie CD, auf der teilweise lediglich
die Abwechselung fehlt; eine Ballade, wie auf dem Vorg&#228;ngeralbum &quot;Wings Of
Destiny&quot;, h&#228;tte &quot;Breaking The Chains&quot; sicherlich gut getan. Nichtsdestotrotz
eine starke Scheibe, die nicht nur alle True Metal Anh&#228;nger, sondern auch
Iron Maiden (die Australier klingen teilweise verdammt nach den &quot;Eisernen Jungfrauen&quot;)
Fans in ihren Bann ziehen wird. Metal Forever!</P>

Fazit: 8 von 10 Punkten</P>
<CENTER><img src="kit.gif"></P>
<img src="cd1.jpg"></P>
<img src="kit.gif"></P></CENTER>


</body>
</html>
