<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Metal Corner</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<h1><CENTER><FONT COLOR="YELLOW">News</FONT></CENTER></h1></P><ul>

<li> Nach dem absolut mi&#223;gl&#252;ckten &quot;III&quot; Album haben <b>Van Halen</B> ihren bisherigen
S&#228;nger Gary Cherone vor die T&#252;r gesetzt. Einen offiziellen Nachfolger hat
die Band noch nicht gefunden, aber am hei&#223;esten gehandelt werden in der
Ger&#252;chtek&#252;che <B>David Lee Roth</B> (der schonmal bei Van Halen in Lohn und Brot
stand) und ex-Whitesnake / Deep Purple (!) Frontman <b>David Coverdale</B>.</P><BR>

<li> So schnell kann`s gehen: Gerade noch bei <b>Vicious Rumors</B> eingestiegen und
schon wieder gefeuert: Ex-Anthrax S&#228;nger <b>Joey Belladonna</B> kann gleich wieder
seine Sachen packen, da er neben seinem Job bei <b>Vicious Rumors</B> auch noch
eine Reunion Tour f&#252;r <b>Anthrax</B> durchzieht, was wiederrum Vicious Rumors Boss
Geoff Thorpe nicht gefiel. Als neuen Frontman stellte man nun <b>Morgan Thorn</B>
vor, der in der Vergangenheit schonmal kurzzeitig eben diese Position inne
hatte.</P><BR> 

<li> Leider haben wir auch zwei Todesf&#228;lle zu beklagen: Sowohl <b>Christoph
Zimmermann</B> (Bassist der Blind Passengers) als auch <b>Wes Berggren</B> (Gitarrist
bei Tripping Daisy) weilen nicht mehr unter uns...</P><BR>

<li> V&#246;llig &#252;berraschend aufgel&#246;st haben sich die aus England kommenden Melodic
Hardrocker <b>Thunder</B>. Grund waren weder musikalische noch pers&#246;nliche
Differenzen, sonder schlicht und ergreifend Business Probleme.</P><BR>

<li> Bei <b>Krabathor</B> ging`s auch hei&#223; her in den letzten Wochen: Nachdem Basser
Bruno ausgestiegen ist (pers&#246;nliche Probleme mit Bandchef Christopher)
holten sich die Death Metaller <b>Paul Speckmann</B> in`s Line-up. Genau jener
Speckmann, der schon unz&#228;hlige Nebenprojkete in`s Leben gerufen
hat.</P><BR>

<li> Nun ist es offiziell: Neuer Drummer bei <b>Iron Savior</B> ist <b>Thomas Nack</B>, der
bis einschlie&#223;lich der &quot;Insanity &amp; Genius&quot; (1993) Platte noch bei <b>Gamma Ray</B>
hinter der Schie&#223;bude sa&#223;, dann aber Richtung <b>Anesthesia</B> verschwand. Neues
zu <b>Kai Hansens</B> (Gamma Ray) Position innerhalb von Iron Savior ist aber noch
nicht zu h&#246;ren es wird wohl darauf hinauslaufen, da&#223; Kai Hansen soetwas wie
&quot;freier Mitarbeiter&quot; bei Iron Savior werden wird.</P><BR>

<li> Hat der derzeitige Re-Union Wahn mal bald ein Ende? Auch <b>Heir Apparent</B>
haben sich wiedervereinigt und pr&#228;sentieren gleichzeitig einen neuen S&#228;nger
namens Mike Flatters, der wie eine Mischung aus James LaBrie (Dream Theater)
und Dio (u.a. Deep Purple, Black Sabbath) klingen soll. Warten wir es mal in
Ruhe ab; nichts wird so hei&#223; gegessen, wie es gekocht wird...</P><bR>

<li> Was es nicht alles gibt: <b>Flotsam &amp; Jetsam</B> haben einen neuen Gitarristen
f&#252;r den zu Lynch Mob abgewanderten Mark Simpson gefunden - und zwar niemand
geringeren als <b>Mike Gilbert</B>, der sich bis einschlie&#223;lich &quot;High&quot; schon bei den
Ph&#246;nix Trashern im Line-up befand.</P><BR>

<li> Auch <b>...but Alive</B> haben sich, aufgrund pers&#246;nlicher und musikalischer
Differenzen, aufgel&#246;st und sind somit alles ander als &quot;alive&quot;.</P><BR>

<li> Die Power Metaller <b>Brainstorm</B> haben endlich einen Erstaz f&#252;r den zu
<b>Metalium</B> abgewanderten Ausnahmes&#228;nger Henne Basse gefunden: <b>Symphorce</B> S&#228;nger
Andy Franck wird diese Position auf dem &quot;Unholy&quot; Nachfolger inne haben,
welcher im M&#228;rz erscheinen soll. Franck wird aber auch weiterhin f&#252;r
Symphorce singen, derren neues Output f&#252;r den Sommer geplant
ist.</P><BR>

<li> Sichtlich unterbesch&#228;ftig scheint derzeit <b>Mike Terrana</B> zu sein: Neben
seiner Fest Anstellung bei Rage und seinen zahlreichen Side-Projekten (u.a.
Roland Grapow, Malmsteen, Story Teller`s Rain etc.) ist er nun auch bei <b>Squealer</B> als Gast Drummer
eingestiegen. Produziert wird die neue CD, mit &quot;Made For Eternity&quot; betitelt,
von <b>Harris Johns</B> (u.a. Warrior, Paragon).</P><BR>

<li> Und wir gerade bei <b>Mike Terrana</B> sind: Der Kleinkrieg zwischen ihm und
<b>Metalium</B> scheint immer noch nicht vorbei zu sein. Nachdem n&#228;mlich Mike
Terrana, nachdem er mit diversen Vorw&#252;rfen konfrontiert wurde, eine
Richtigstellung formulierte und diese &#246;ffentlich zug&#228;nglich machte, haben jetzt
Metalium zur&#252;ckgekontert und dabei ein glattes Eigentor geschossen
(nachzulesen im Rock Hard auf den Leserbriefseiten). Na ja, <b>Metalium</B> wollen
im Fr&#252;hjahr auf jeden Fall wieder in`s Studio gehen und den Nachfolger zu
&quot;Millenium Metal - Chapter I&quot;, mit dem selben Line-up wie beim Vorg&#228;nger
(bis eben auf Mike Terrana, der ja durch John Osborn ersetzt wurde),
einspielen.</P><BR></UL>







</body>
</html>
