
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Metal Corner</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<h1><CENTER><FONT COLOR="RED">Oldie Review: Iron Maiden`s &quot;Somewhere In Time&quot;</FONT></CENTER></h1></P>

Iron Maiden geh&#246;ren heutzutage sicherlich zu den gr&#246;&#223;ten und bekanntesten
Heavy Metal Bands &#252;berhaupt, was nicht zuletzt daran liegt, da&#223; sie zwischen
1982 und 1988 5 superbe Studioalben und 1 Live Album (&quot;Live After Death&quot;)
herausgebracht haben, die eigentlich alle in diese (neue) Rubrik geh&#246;ren.
Sei es drum; ich musste mich f&#252;r ein Album entscheiden und habe mich f&#252;r das
1986 erschienene Album &quot;Somewhere In Time&quot; entschieden.</P>

Insgesamt sind zwar gerade mal 8 Songs auf dem Album, aber jeder ist ein
wahrer Hammer und &#252;berfl&#252;gelt heutige angebliche &quot;True Metal Sensationen&quot; um
Meilen. Das f&#228;ngt schon beim wuchtigen Opener &quot;Somewhere In Time&quot; an, der
sofort ins Ohr geht, aber dabei kein bi&#223;chen an H&#228;rte verliert. Das
darauffolgende &quot;Wasted Years&quot; ist zwar eine untypische Iron Maiden Nummer
(k&#246;nnte man fast schon als &quot;Rock&quot; einstufen), aber geht noch direkter ins
Ohr - man k&#246;nnte dieser Nummer zwar auch als &quot;kommerziell&quot; bezeichnen, aber
da die Qualit&#228;t derma&#223;en hoch ist, hat dies niemand getan und auf der
letzten Tour wurde &quot;Wasted Years&quot; sogar Live gespielt. Einen weiteren
Meilenstein, den Iron Maiden auf diesem Longpalyer abgeliefert haben, ist
&quot;Heaven Can Wait&quot;, der sich auch heute noch gro&#223;er Beliebtheit erfreut. Auch
die restlichen Songs sind allesamt erste Sahne und geh&#246;ren zu den st&#228;rksten,
die im Zuge der NWOBHM geschrieben wurden. Erw&#228;hnenswert erschient mir noch
der Abschluss der CD in Form des gut 8-min&#252;tigen &quot;Alexander The Great&quot; -
eine kleine geschichtliche Abhandlung &#252;ber &quot;Alexander den Gro&#223;en&quot;. Auch
dieser Song ist einzigartig und geh&#246;rt mit zu meinen Lieblingssong der Band
- auch wenn man ihn niemals auf einer Best Of CD oder einem Live Mitschnit
finden wird. Schade, denn die fast schon progressiven Elemente am Ende
stehen Iron Maiden gut zu Gesicht und bieten obendrei noch Abwechselung.</P> 

Insgesamt ist &quot;Somewhere In Time&quot; also ein hervorragendes Album, welches man
einfach haben muss. Problem an der Sache: Dieser Satz gilt f&#252;r alle Iron
Maiden Albem und insbesondere f&#252;r jene, die zwischen 1982 und 1988
erschienen sind. Trotzdem: Wer ein hervorragendes Metal Album im Stile der
80er Jahre sucht, kommt um &quot;Somewhere In Time&quot; kaum herum. Eine remasterte
Version (u.a. mit &quot;Multimedia Cliups&quot;) bekommt ihr f&#252;r 30 DM beim H&#228;ndler
Eures Vertrauens - ich bleibe da lieber bei der Original CD bzw. Vinyl
Version!</P>

Fazit: 10 von 10 Punkten</P><CENTER>
<img src="kit.gif"></P>
<img src="oldie.jpg"></P>
<img src="kit.gif"></P></CENTER>


</body>
</html>

