<HEAD>
<TITLE>
Grundlagen</TITLE>
</HEAD>

<BODY>
<PRE><a href="WACHSMOTTEN.html"><img src="ArrowLeft.gif"></a> <a href="QUELLEN.html"><img src="ArrowRight.gif"></a> <hr><p>
<img src="il_grund1.gif">
<hr>
<h1>
Das Terrarium : Nachgestellte Natur 

<img src="il_terra.gif">
</h1>

Das Terrarium zeigt den speziell angepassten Lebensraum seiner Bewohner.
Entscheidend sind dabei die artgerechte Umgebung und die notwendigen
klimatischen Bedingungen, in der sich die Tiere wohlf&uuml;hlen. Jedes Terrarium
ist ein St&uuml;ck nachgestellter, speziell abgestimmter Natur.

Tips zur Haltung von Terrarientieren zu geben ist nicht immer leicht, da selbst
Tiere der gleichen Art hinsichtlich ihrer Aktivit&auml;t, ihrer Fre&szlig;lust
und ihrer Scheu vor dem Menschen grundverschieden sein k&ouml;nnen.

Sie sollten sich schon vor dem Kauf von Terrarientieren passende Literatur
besorgt UND gelesen haben, anderenfalls sollten sie das in ihrem und im
Interesse ihrer Tiere nachholen.

Die Kosten des Terrariums, der Einrichtung und des Zubeh&ouml;rs
&uuml;bersteigen die Anschaffungskosten f&uuml;r manche Terrarientiere selbst um
ein Vielfaches, das kann bei einem Anschaffungspreis von z.B. 800,--DM dann ganz
sch&ouml;n ins Geld gehen.

Sie sollten sich dar&uuml;ber im Klaren sein, da&szlig; Sie mit dem Kauf von
Tieren Verantwortung &uuml;bernehemen und ihnen alles bieten sollten, was sie
brauchen, da sonst R&uuml;ckschl&auml;ge unvermeidlich sind.

Terrarientiere sind kein Spielzeug und geh&ouml;ren niemals in die H&auml;nde
von Kindern, auch wenn die Schildkr&ouml;tenbabies noch so niedlich sind.

Schnelle und hastige Bewegungen sind zu vermeiden, unn&ouml;tiges Anfassen
sollte unterbleiben. Nach der F&uuml;tterung brauchen die Tiere
grunds&auml;tzlich Ruhe. Es ist jeden Tag auf sauberes, frisches Wasser zu
achten.

<h3>
 K E N N T N I S S E  
</h3>
Um es gleich vorweg zu sagen, Terrarienliebhaber brauchen entsprechend gute
Kenntnisse &uuml;ber ihre Pfleglinge und deren Lebensart. Wer aber Freude an
Naturbeobachtungen hat, kann sich leicht daf&uuml;r begeistern. Denn Reptilien
und Amphibien sind im Hinblick auf die Entwicklungsgeschichte der Lebewesen
au&szlig;erordentlich interessante Tiergruppen.


<img align=middle src="il_schild.gif"> Schildkr&ouml;ten,  <img align=middle src="il_echse.gif"> Echsen,

<img align=middle src="il_schlange.gif"> Schlangen,     <img align=middle src="il_frosch.gif"> Frosch- und

<img align=middle src="il_schwanz.gif"> Schwanzlurche

sind die klassischen Bewohner, die jedoch aufgrund des Artenschutzes nur sehr
eingeschr&auml;nkt erh&auml;ltlich sind. Aus Gr&uuml;nden des Artenschutzes
sollten sie beim Kauf von Tieren auf Nachzuchten achten, da diese nicht der
Natur entnommen worden sind.

<h3>
 T E R R A R I E N A R T E N 
</h3>
Der erste Schritt ist nicht der Kauf der Tiere, sondern die Einrichtung des
Terrariums. Dazu mu&szlig; man nat&uuml;rlich wissen, welche Bewohner man
ansiedeln m&ouml;chte, denn es gibt unterschiedlich Terrarientypen. Eines haben
aber alle gemeinsam: die darin lebenden Tiere m&uuml;ssen ausreichend mit Licht,
Luft, Wasser und W&auml;rme versorgt werden. Die Wohnstatt mu&szlig; leicht
sauber zu halten sein und nat&uuml;rlich auch das Auge des Betrachters erfreuen.

Das eigentliche Terrarium, so wie man es kaufen kann, ber&uuml;cksichtigt alle
Erfordernisse bereits im Rahmen seiner Konstruktion. Es geht darum, nun mit dem
notwendigen Zubeh&ouml;r die kleine, ma&szlig;geschneiderte Welt zu schaffen.
W&uuml;stenbewohner brauchen viel W&auml;rme, Sumpfbewohner viel Feuchtigkeit.
Im Prinzip unterscheidet man drei Terrarienarten: Das Aquaterrarium, das
Halbtrockene und das W&uuml;stenterrarium. Weiterhin unterteilt man in Freiland-
und Zimmerversion.

<h3>
 Z I M M E R T E R R A R I E N 
</h3>
Das am h&auml;ufigsten eingesetzte Zimmerterrarium sollte ein m&ouml;glichst
gro&szlig;es Platzangebot haben. Dabei ist zu bedenken, da&szlig; viele Bewohner
innerhalb kurzer Zeit eine respektable Gr&ouml;&szlig;e annehmen, denn gekauft
werden sie meist als Jungtiere.

In der Regel ist das Terrarium ein Glasbeh&auml;lter, der hygienisch,
ausbruchsicher, w&auml;rmehaltend, licht- und luftdurchl&auml;ssig sein
mu&szlig;. Ein Seitenteil ist meist aus engmaschigem Material f&uuml;r einen
ungehinderten Luftaustausch im Bodenbereich. Spezielle Lampen und/oder
Leuchtstoffr&ouml;hren versorgen es zus&auml;tzlich mit ultraviolettem Licht,
Infrarotstrahler und Bodenheizung mit der richtigen Temperatur.

<h3>
 G E S T A L T U N G  
</h3>
Tiere, die an feuchtwarmes Klima gewohnt sind, bekommen meist eine kleine
Wasserzone, und ihre Behausung wird regelm&auml;&szlig;ig mit einem
Wasserzerst&auml;uber benetzt. Mit Tillandsien, Begonien, Efeu oder Philodendron
kann man den Wohnbereich in einen kleinen Tropenwald verwandeln.

Als Bodengrund verwendet man, je nach Art, Sand, Steine, Lava, Rindenhumus oder
auch lehmige Gartenerde. Torf oder anderes leicht klebendes, oder faulendes
Material ist nicht zu empfehlen.

F&uuml;r beheizte Trockenterrarien eignen sich auch manche Kakteen zur
Landschaftsgestaltung, es d&uuml;rfen aber nur solche Pflanzen sein, an denen
sich die Insassen nicht verletzen k&ouml;nnen. Sch&ouml;n sind auch
Fettblattgew&auml;chse oder kleine Agaven.

Wie der Name schon sagt, spielt beim Aquaterrarium der Wasserbereich eine
wichtige Rolle. Wassertiefe, Sumpfzone und Uferbereich richten sich nach dem
Bed&uuml;rfnis der Bewohner, sollten aber in aller Regel gro&szlig;z&uuml;gige
Dimensionen haben. Tiere, die gerne schwimmen, brauchen mehr als ein
Planschbecken.

<h3>
 E R N &Auml; H R U N G
</h3>
Die verschiedenen Terrarientiere haben ganz unterschiedliche Bed&uuml;rfnisse.
Im Zoofachhandel gibt es f&uuml;r einige Arten ausgewogenes Fertigfutter. Die
Reptilienb&ouml;rsen haben meist ein umfangreiches Angebot an Lebendfutter
f&uuml;r die Insekten- und Fleischfresser. Hier sollte man sich vorher
allerdings mit einem spezialisierten Terrarianer unterhalten und sich beraten
lassen.

</PRE>

<HR>
<a href="BEGRUESSUNG.html">Begr&uuml;&szlig;ung</a> , <a href="FORUM.html">Forum</a> , <a href="TERMINE.html">Termine</a> , <a href="ANZEIGEN.html">Anzeigen</a> , <a href="IMPRESSUM.html">Impressum</a> , <a href="RAPTORINDEX.html">Index</a>
<hr>
<h5> RAPTOR-MAG Ausgabe 1
</h5>

</BODY>
