<HEAD>
<TITLE>
Halsbandleguane</TITLE>
</HEAD>

<BODY>
<PRE><a href="SIEDLERAGAME.html"><img src="ArrowLeft.gif"></a> <a href="LEOPARDGECKOS.html"><img src="ArrowRight.gif"></a><hr>
<h5>
© 1995  G. und R.Gantschnigg
e-mail G.Gantschnigg@raptor.dontpanic.sub.org
</h5>

<h1>
<p>                      Erfahrungsbericht &uuml;ber

<img align=middle src="il_leg.gif"> Halsbandleguane (crotaphytus collaris)
</h1>
<h4>
Synonyme: crotaphytus insularis <hr>
</h4>



<h3>          Hinweise aus Literaturquellen
</h3>

     Von   Crotaphytus   collaris   sind  mehrere  Unterarten  (c.collaris,
     c.brevis,  c.baileyi,  c.auriceps,  c.bicinctores)  beschrieben, deren
     &auml;u&szlig;erliche  Gemeinsamkeit  das  doppelte, aber unterbrochene, Halsband
     ist.   Im Gegensatz dazu weist Crotaphytus insularis ein durchgehendes
     Halsband auf.  Im Handel sieht man Halsband<a href="leguane.gif">leguane</a> oft als C.insularis
     tituliert.    Wir  konnten  unsere  Exemplare  beim  Wittener  Z&uuml;chter
     Schumacher,  der  seit  Jahren  Unterarten  von C.collaris erfolgreich
     z&uuml;chtet,  erstehen.   Mit  ziemlicher  Sicherheit  handelt es sich bei
     unseren  Tieren  dabei  um  "echte"  Halsbandleguane,  und zwar um die
     Variante C.collaris collaris.



<h3>           Beschreibung
</h3> 

      <a href="leg1.gif">C.collaris collaris</a>:
     Gr&ouml;&szlig;e   30   cm.    Der  zweite  deutsche  Name  des  Halsbandleguans,
     Kugelechse,  deutet  darauf hin, da&szlig; sich dieser Leguan beim Abplatten
     in  eine  sehr ovale Form bringen kann.  Die langen Hinterbeine sollen
     den  Leguan dazu bef&auml;higen, auf der Flucht sehr rasch allein auf ihnen
     zu  laufen,  wobei  der  Schwanz als Balancierstange dienen soll.  Das
     schwarze  doppelte  Halsband  wird  durch  einen  hellgelben  Streifen
     getrennt.   Der  Kopf  ist  br&auml;unlich,  die  Kehle  orange,  der Rumpf
     gelblich  bis  fahlgrau.   Die  Oberseite  ist  mit wei&szlig;lichen Flecken
     besetzt, die an den Seiten in einen r&ouml;tlichbraunen Ton &uuml;bergehen.  Auf
     der   vorderen   Schwanzh&auml;lfte  bilden  die  Flecken  eine  netzartige
     Zeichnung.    In  der  Paarungszeit  ist  der  Grundton  der  M&auml;nnchen
     smaragdgr&uuml;n,   die   Unterseite   wird  gelblich.   Das  <a href="legwei.gif">Weibchen</a>  ist
     anspruchsloser  gef&auml;rbt,  das  Halsband  tritt  auch schw&auml;cher hervor.
     Interessant  ist  das  Farbwechselverm&ouml;gen.   Helligkeit  und niedrige
     Temperaturen lassen die Farben <a href="legmae1.gif">dunkler</a> werden.
     
     

<h3>            <a href="l_karte.gif">Verbreitung</a>
</h3>      

     C.c.collaris  ist die &ouml;stliche Unterart von C.collaris und ist von den
     s&uuml;dlichen  USA  bis  zum &auml;u&szlig;ersten Nordosten von Mexiko zu finden.  Er
     ist  ein  ausgesprochenes Bodentier und lebt in offenen, steinigen und
     hei&szlig;en Felsen- und Trockengebieten.
     

     
<h3>           Haltung
</h3>      

     Luft  25-35°C, Boden lokal 38°C.  Nachts k&uuml;hler.  Trockenes, geheiztes
     Terrarium, l&auml;nger als hoch.  Ausstattung mit Sandstein, einige schwach
     bestachelte  Kakteen.   Sonnenliebend.  Da die Tiere Wasser schl&uuml;rfen,
     ein  kleines  Trinkgef&auml;&szlig;  einbauen.  Als Nahrung werden gro&szlig;e Insekten
     bevorzugt,  auch  kleine  Eidechsen werden gefressen.  In Einzelf&auml;llen
     wird von C.collaris als streits&uuml;chtig und angriffslustig berichtet.
     F&uuml;r die Nachzucht empfiehlt Schumacher eine &Uuml;berwinterung bei ca.10°C.
     Gleichm&auml;ssig warm gehaltene Tiere pflanzen sich wohl nicht fort.
     Zur  Aufzucht empfiehlt er Grillendosen mit Deckel uns Vermicullit als
     Substrat.   Die Temperatur soll 30-31°C betragen, darf aber schwanken.
     Unerl&auml;sslich  sei  eine konstante Luftfeuchte von 90-100%, da die Eier
     bei zu feuchter Haltung unterseits, bei zu trockener Haltung oberseits
     einfallen.   Ein  Bespr&uuml;hen  der  Eier  ist zu unterlassen, sie sollen
     vollst&auml;ndig im Substrat verschwinden.
     Die  Jungen  sollen  so  nach  50-52  Tagen schl&uuml;pfen und m&uuml;ssen ab da
     permanent  mit  Vitamin D versorgt werden.  Er empfiehlt das Bespr&uuml;hen
     eines Grasb&uuml;schels mit vitaminhaltigem Wasser.
     Alles   in   allem   wirkt   seine   Methode   sehr   spartanisch  und
     erfolgsorientiert; entsprechend abgehalftert sahen die Tiere auch aus,
     die wir von ihm erworben haben.
     
     
     
          
<h3>           Haltungsprotokoll 1995
</h3> 
     
     
<h3>           Anschaffung
</h3>      

     a) 3/94 1,0 75,--DM Robert Schumacher, Witten
     b) 6/94 0,1 85,--DM Robert Schumacher, Witten
        a) und b) sind NZ im zweiten Lebensjahr
     
     

<h3>            <a href="leg2.gif">Das Aussehen unserer Tiere</a>
</h3>      

     Die  Grundfarbe  des  M&auml;nnchens  ist  ein  helles  Blaugr&uuml;n,  die  des
     Weibchens  ein  dunkles Braungr&uuml;n.  Die Oberseite wird von sehr vielen
     wei&szlig;en   Punkten   aufgelockert.   Beide  Tiere  tragen  das  doppelte
     Halsband,  beim  M&auml;nnchen  ist es st&auml;rker ausgepr&auml;gt.  Der Schwanz der
     Tiere  wird  durch  ein dunkleres Linien- und Strichmuster gegliedert.
     Insbesondere  die  Hinterbeine  sind  relativ  lang und weisen auf das
     Sprungverm&ouml;gen  der  Tiere  hin.   Der  Kopf des M&auml;nnchens ist relativ
     gr&ouml;&szlig;er  als  der  des  Weibchens  und  verleiht  dem  M&auml;nnchen  so ein
     klobigeres  Aussehen.   Beide  Tiere ligen noch unterhalb 30 cm, wobei
     der  Schwanz  beider  Tiere  ca.   2/3  der Gesamtl&auml;nge einnimmt.  Das
     Weibchen  wies  bei  der  Anschaffung in Ans&auml;tzen noch die orangeroten
     Seitenflecken durch die letzte Tr&auml;chtigkeit auf.
     
     

<h3>           Das Terrarium f&uuml;r die beiden Leguane
</h3>           

     Die Tiere bewohnen seit 6/94 ein <a href="terra.gif">Terrarium</a> mit den Ma&szlig;en 150L*45B*45H.
     Das  M&auml;nnchen  war zuvor vor&uuml;bergehend in einem 80*45*50 Glasterrarium
     untergebracht  und  zog parallel zur Anschaffung des Weibchens mit um.
     Die   Beleuchtung   des   gemeinsamen   Terrariums   besteht   aus   2
     Leuchtstoffr&ouml;hren  36W  120cm  und  2(1)  Strahlern  E14  zu 40W.  Die
     Drosselspulen der Leuchtstoffr&ouml;hren sind unter einer sandbeschichteten
     Alu-Platte  auf  dem  Boden  befestigt.   Boden  und  Decke  sind  mit
     Gipsmilch   gestrichen,   die   R&uuml;ck-   und   Seitenw&auml;nde   sind   mit
     strukturierten  0.5cm  Styroporelementen,  die hellgelb abget&ouml;nt sind,
     verkleidet.    Die   Be-  und  Entl&uuml;ftung  sichern  drahtnetzbespannte
     L&uuml;ftungsschlitze   5*150cm  an  der  oberen  R&uuml;ckwand  und  vier  10cm
     "Bullaugen"  an  den Seitenw&auml;nden.  Die Front wird durch zwei seitlich
     verschiebbare  Glasscheiben  gebildet.   Das  Terrarium ist Teil einer
     Anlage  aus drei Einheiten &auml;hnlicher Gr&ouml;&szlig;e.  Die Tiere gingen 11/94 in
     die Winterstarre.  Das Terrarium wurde umgestaltet und wird seit 12/94
     von  1,2 Agama agama (adult) bewohnt.  Nach der Winterruhe Ende Januar
     1995  bezogen  die  Tiere  das  untere der drei Terrarien.  Es enth&auml;lt
     3*40W  Strahler.   Besondere  Einrichtungsgegenst&auml;nde  sind  eine 80cm
     lange  Korkh&ouml;hle  im  rechten  Teil  und  zwei getopfte Sukkulenten im
     linken Teil.
     
     

<h3>           Die Haltungsbedingungen im Terrarium
</h3>      

     Das  Terrarium  wird  im  Sommer von 9-18 Uhr beleuchtet.  W&auml;hrend der
     Angleichphase  an  die  Winterstarre  wird  die  Dauer der Beleuchtung
     allm&auml;hlich  auf 2 Stunden tgl.  reduziert.  In der letzten Phase wurde
     ca.   5 Tage ohne Beleuchtung verfahren.  Die Aufheizung erfolgt durch
     die   Drosselspulen  und  die  Strahler.   Nach  dem  Ausschalten  der
     Beleuchtung k&uuml;hlt das Terrarium langsam auf die Wohnraumtemperatur ab.
     Die  <a href="temp.gif">Temperaturspitzen</a> liegen bei ca.  30-35°C im oberen Terrarienteil.
     Auf   den   im   Terrarium   plazierten   Drosselspulen  erreicht  die
     Bodentemperatur  weit  &uuml;ber  40°C.  Nachts kann die Temperatur bis auf
     17-18°C  fallen.   Feuchtigkeit  erh&auml;lt  das  Terrarium  nur durch das
     kleine  Trinkgef&auml;&szlig;  und  eine  Kletterfeige, die morgens &ouml;fter, abends
     gelegentlich   mit  dest.   Wasser  bespr&uuml;ht  wird.   Die   <a href="feu.gif">Luftfeuchte</a>
     schwankt  so  zwischen  minimal  30%  relativer  Feuchte  tags&uuml;ber und
     maximal  70-80%  nachts.   F&uuml;r das M&auml;nnchen waren die Umstellungen ´94
     recht  hart.   Nach  dem Umzug aus dem Glasterrarium in das gemeinsame
     Holzterrarium  stellte  es  selbst&auml;ndig  die  Futteraufnahme  ein  und
     bereitete  sich  auf die Ruhezeit vor.  Und das bereits im Juli/August
     des Jahres.  Durch ein Aufheizen des Terrariums mit Punktstrahlern auf
     weit  &uuml;ber  30  Grad  konnte  das  M&auml;nnchen noch einmal zu Aktivit&auml;ten
     &Uuml;berredet  werden.   Insgesamt  ruhte es allerdings lieber unter einer
     Korkrinde.    Aufgrund   der  hohen  Temperaturen  und  der  fehlenden
     Nahrungsaufnahme  magerte es in dieser verfr&uuml;hten Winterruhe stark ab.
     Das  Weibchen,  das  recht ausgehungert zu uns kam, fra&szlig; von Anfang an
     sehr  gut  und  war  l&auml;ngere  Zeit  agil als das M&auml;nnchen.  Im Oktober
     wurden  die  Tagestemperaturen  allm&auml;hlich  auf  Raumtemperatur (17-18
     Grad)  abgesenkt.   Nach  einem  abschlie&szlig;enden  Warmbad,  bei dem das
     Weibchen  sehr  viel, das M&auml;nnchen weniger, trank, gingen beide in die
     Winterstarre  bei  Temperaturen  von  8-15  Grad.   Ort:   Kasten  mit
     angefeuchteter  Blumenerde  unter  Korkrinde in einer Transportbox mit
     Trinkgef&auml;&szlig;,  untergestellt  im  Hausflur.   Nachgespr&uuml;ht  wurde Anfang
     12/94,  das Wasser im Trinkgef&auml;&szlig; wurde erneuert.  Anfang 1/95 dieselbe
     Prozedur.  Die Tiere lagen entspannt unter der Korkrinde.
     

     
<h3>           Die Nahrung f&uuml;r die Leguane
</h3>      

     Am besten gr&ouml;&szlig;ere Mengen gr&ouml;&szlig;erer Insekten!
     
     Grillen
     Heimchen
     Wachsmaden
     Wachsmotten
     Wanderheuschrecken (bis 4.H&auml;utung)
     Zophobas (selten)
     
     

<h3>           Das Verhalten der Halsbandleguane
</h3>      

     Sind die Echsen erst einmal aktiv, bereiten sie sehr viel Freude.  Das
     Terrarium  scheint  jedoch  immer  zu  klein  zu  sein,  so  ist ihrer
     Bewegungs-  und  Springfreude  eine  Grenze  gesetzt.   Unsere  beiden
     Nachzuchttiere  waren  von  Anfang an handzahm und kein bischen scheu.
     Agressives  Verhalten  konnten  wir  nicht  beobachten,  wir haben sie
     allerdings   auch  nur  mit  sich  selbst  vergesellschaftet.   Bisher
     scheinen  M&auml;nnchen und Weibchen sich nicht gegenseitig zu nerven.  Die
     Tiere springen und laufen recht gern.  Gelegentlich h&auml;ngen sie auch an
     den  unm&ouml;glichsten  Stellen,  z.B.   in &Auml;sten, einfach nur herum.  Sie
     sind  sehr  wach  und  aufmerksam.   Das  Weibchen  geht  mit gr&ouml;&szlig;erer
     Entschlossenheit an die Nahrungsaufnahme heran.
     
     

<h3>           Ausf&auml;lle
</h3>      

     keine
     

     
<h3>           Das Tagesprotokoll 
</h3>      

     -nach der ersten &Uuml;berwinterung
     -bis zur Eiablage
     
     Ende Januar werden die Tiere ´aufgeweckt´. 
     
     27.01.:   Ins  Terrarium,  18°C, mittags 1h Licht.  Das M&auml;nnchen zeigt
     den Kopf.
     
     28.01.:   2,5h  Licht.   Die  Temperatur  steigt  auf  &uuml;ber 20°C.  Das
     M&auml;nnchen zeigt sich schon vorher.  Das Weichen ist immer noch nicht zu
     sehen.   Die  Tiere bekommen ein 20min&uuml;tiges Warmbad.  Sie sind danach
     schon  aktiv,  wenn  auch wackelig auf den Beinen.  Sie erforschen das
     Terrarium.   Das  Weibchen  scharrt  schon wieder fleissig und schl&auml;ft
     diese Nacht offen vor der Korkrinde.
     
     29.01.:  2,5h Licht.  Der erste Strahler mit in Betrieb.  Das M&auml;nnchen
     ist schon vorher auf.  Tmax=25°C.  Die Tiere suchen aktiv nach H&ouml;hlen,
     sind  noch  wackelig.   Beide  werden  15  Minuten  warm gebadet.  Sie
     trinken nicht.
     
     30.01.:  wie 29.01.
     
     31.01.:  ab 10Uhr 4,5 h Licht.  Beide Strahler in Betrieb.  Graben und
     Suchen geht weiter, das M&auml;nnchen trinkt.
     
     01.02.:  1,0 frisst eine Wmade.
     
     02.02.:   ab  9Uhr  5,5h  Licht,  das  M&auml;nnchen  frisst  4 Wmaden, das
     Weibchen trinkt viel aus der vorgehaltenen Pipette.
     
     03.02.:  keine Vorkommnisse.
     
     04.02.:  Licht 8-14.30 Uhr.  M.frisst 2 Wmaden.
     
     05.02.:   M.  frisst 2 Wmaden, W.  trinkt viel, frisst 4 Heimchen.  M.
     balzt  W.   mit  Kopfzittern  und  Schl&auml;ngelbewegung an, beisst in den
     Nacken.   Keine  Verfolgung.   Intensives  Licht-  und W&auml;rmebad.  Kein
     Graben,  beide  Tiere  kommen  gerne  heraus  und sind auch nicht mehr
     wackelig auf den Beinen.
     
     11.02.:   Das  M&auml;nnchen balzt, bei&szlig;t das Weibchen in den Nacken, nickt
     zitternd.  Das Weibchen macht sich platt wie eine Flunder, stellt sich
     aufrecht auf alle vier Beine.
     
     12.02.:  wie 11.02.
     
     18.02.:   Das  Nicken des M&auml;nnchens ist immer noch zu beobachten, eine
     Paarung konnte allerdings nie beobachtet werden.
     
     19.02.:   Das Weibchen gibt nach den Fre&szlig;orgien vorher wohl zum ersten
     Mal eine Riesenportion Kot ab.
     
     22.02.:   Das  Weibchen  fri&szlig;t  gern  und regelm&auml;&szlig;ig, das M&auml;nnchen mu&szlig;
     separat gef&uuml;ttert werden und fri&szlig;t wenig, manchmal gar nicht.  M&auml;rz..:
     Das  Weibchen zeigt die orangerote Verf&auml;rbung an Hals und Bauchseiten.
     Es  nimmt auff&auml;llig an Umfang zu und wehrt sich gegen Ann&auml;herungen des
     M&auml;nnchens, wenn auch oft ohne Erfolg:  Es wird durch ungewohnt heftige
     Attacken  gezwungen,  sich  auf  den  R&uuml;cken  zu  drehen.  W&auml;hrend der
     "Wartephase"  zeigte  es seine Nichtbereitschaft zur Paarung durch die
     "Tischposition"  an:   Es  machte sich sehr platt und stellte Kehlsack
     und Schwanz auf.
     
     01.04.:  Das Weibchen legt 8 Eier direkt auf die Heizplatte.  Die Eier
     werden  in  eine  Keramiksch&uuml;ssel mit topffeuchter Blumenerde und Sand
     &uuml;berf&uuml;hrt.   Die  Sch&uuml;ssel wird in das Glasterrarium 80*45*50 gestellt
     und  mit  Folie soweit abgedeckt, da&szlig; ein Thermometer noch herausragen
     kann.    Mit   einem   60W-Heizkabel   und   Kiesaufsch&uuml;ttung,   einem
     Aquarienaustr&ouml;mer  in  einem  Wasserbecken  und  t&auml;glichem  Gie&szlig;en des
     Kiesgrundes mit Wasser wird versucht, eine stabil bleibende Temperatur
     von ca.30°C und 90-100% Luftfeuchte zu halten.  Die Beleuchtung bleibt
     ausgeschaltet.
     
     10.04.:   Die  Temperatur bleibt stabil bei 30°C +-1°C Die Luftfeuchte
     sinkt  gelegentlich  auf ca.  80% im Terrarium.  Wenn uns die Topferde
     im Brutbeh&auml;lter zu trocken erscheint, wird vorsichtig gespr&uuml;ht.
     
     12.04.:  Das Weibchen legt ein ei&auml;hnliches Gebilde auf die Heizplatte.
     
     17.04.:   Die  Tiere  paaren  sich  erneut.   Das  M&auml;nnchen  ist recht
     agressiv  und  bedr&auml;ngt  das Weibchen recht stark.  Das Weibchen wehrt
     sich  kaum.   Wir  trennen  die  Tiere  vor&uuml;bergehend,  indem  wir das
     Terrarium  durch  eine  Pappwand  "zweiteilen".  Das M&auml;nnchen versucht
     st&auml;ndig,  ins  andere  Abteil zu gelangen, was ihm auch IMMER gelingt.
     Wir entfernen die Pappwand wieder.
     
     24.04.:  Das Weibchen setzt ein unbefruchtetes Ei ab.
     
     20.5.:  Das Weibchen setzt vier befruchtete Eier ab, nachdem es vorher
     mehrere  Tage  nicht  gefressen hat.  Jetzt langt es wieder ordentlich
     zu.   Das  M&auml;nnchen  fri&szlig;t  sogar  NOCH  MEHR!  Die Eier werden wieder
     provisorisch  in  einem  Blumenerde/Sand- Gemisch in das Glasterrarium
     gebracht.
     
     27.05.:   Das  Weibchen  fri&szlig;t SEHR gierig und sehr viel, das M&auml;nnchen
     wieder  kaum.   Eine  Paarung  wird  nicht beobachtet, so wie nach der
     letzten Eiablage.
     
     29.05.:    Die  Kontrolle  ergab,  da&szlig;  alle  Eier  vertrocknet  sind.
     Schei&szlig;e.  Alles weggeschmissen.
     
     03.06.:   Das  Weibchen fri&szlig;t noch sehr gierig, es rast von einer Ecke
     in  die  andere, wenn man das Futter an wechselnden Stellen hereingibt
     (falls  es  nicht  schon rausspringt, oder in den Futtertopf mit Maden
     hechtet..).  Er pennt &ouml;fter.
     
     10.06.:   Das  Weibchen  fri&szlig;t  weniger  gierig.  Das M&auml;nnchen sowieso
     weniger;  es verbringt auch fast den ganzen Tag unter einer Korkrinde,
     das  Weibchen  gesellt sich gelegentlich dazu.  Haben die schon wieder
     Winter??
     
     01.07.:    Die  letzte  Eikontrolle  ergab,  da&szlig;  das  gesamte  Gelege
     vertrocknet ist.  Schade, im n&auml;chsten Jahr klappts bestimmt!
     
     15.07.:   Na  endlich  sind  sie wieder aktiv, sie hatten wohl an eine
     Regenzeit  gedacht.  Ordentlich gefressen wird auch wieder, aber immer
     noch mit den H&uuml;hnern ins Bett ;)

</PRE>

<HR>
<a href="BEGRUESSUNG.html">Begr&uuml;&szlig;ung</a> , <a href="FORUM.html">Forum</a> , <a href="TERMINE.html">Termine</a> , <a href="ANZEIGEN.html">Anzeigen</a> , <a href="IMPRESSUM.html">Impressum</a> , <a href="RAPTORINDEX.html">Index</a>
<hr>
<h5> RAPTOR-MAG Ausgabe 1
</h5>

</BODY>
