<HEAD>
<TITLE>
Siedleragame</TITLE>
</HEAD>

<BODY>
<PRE><a href="FORUM.html"><img src="ArrowLeft.gif"></a> <a href="HALSBANDLEGUANE.html"><img src="ArrowRight.gif"></a> <hr><p>
<h5>
© 1995  G. und R.Gantschnigg
e-mail G.Gantschnigg@raptor.dontpanic.sub.org
</h5>

<h1>
                           Erfahrungsbericht &uuml;ber          

<img align=middle src="il_ag.gif"> Siedleragame (agama agama) <hr>

</h1>

<h3>          Hinweise aus Literaturquellen
</h3>

     Von  den  Siedler<a href="agamen.gif">agamen</a>  sind  etliche  Variationen bekannt, was nicht
     verwunderlich  ist,  da  sich  das   <a href="a_karte.gif">Verbreitungsgebiet</a>  fast  auf den
     gesamten  afrikanischen  Kontinent  erstreckt.   Lediglich  in reinen
     W&uuml;stengebieten sowie in tropischer Umgebung treten sie nicht auf.


     
<h3>          Beschreibung
</h3>

     Allen  A.agama-Unterarten  ist  eine typische  <a href="agama1.gif">Grundf&auml;rbung</a> gemeinsam.
     Die   Weibchen   bzw.    die  unterlegenen  M&auml;nnchen  sind  oberseits
     schmutzigbraun,  die  &uuml;berlegenen   <a href="agama2.gif">M&auml;nnchen</a>  recht bunt gef&auml;rbt:  ein
     orangeroter  Kopf  mit  einem  blaugr&uuml;nen  K&ouml;rper.  Auff&auml;llig ist der
     dreieckige Kopf und die sehr gro&szlig;en Ohr&ouml;ffnungen.


     
<h3>            <a href="a_karte.gif">Verbreitung</a>
</h3>      

     Afrika, au&szlig;er Namib- und Saharaw&uuml;ste. Auch auf M&uuml;llhalden ;-))
     Agama-Arten  bewohnen  Savannen,  Trockenw&auml;lder, oder vegetationsarme
     w&uuml;stenartige  Gebiete.  Einige sind zu Kulturfolgern geworden.  Tiere
     aus w&uuml;sten&auml;hnlichen Gebieten leben meist solit&auml;r, w&auml;hrend &uuml;berwiegend
     baumbewohnende  Agamen ein festes soziales Gef&uuml;ge aufweisen.  So kann
     ein M&auml;nnchen &uuml;ber mehr als zwanzig Weibchen und Jungtiere dominieren.
     Die  recht  scheuen  Agamen  fressen au&szlig;er Insekten oft auch kleinere
     Echsen, Bl&uuml;ten und Fr&uuml;chte.



<h3>           Haltung
</h3> 

     F&uuml;r    Baum-    und    Felsbewohner   erh&auml;lt   ein   Trockenterrarium
     (H150*B150*T80)  zus&auml;tzliche Felsimitationen.  Das Bodenteil wird mit
     grobem  Sand  aufgef&uuml;llt  und  mit  einigen  Steinen  dekoriert.  F&uuml;r
     terrestrisch   lebende   Arten   eignet   sich  ein  Trockenterrarium
     (H100*B180*T80) mit gleichem Bodengrund.



<h3>           Fortpflanzung
</h3> 

     Nach   Beginn   der   Regenzeit   legen  die  Weibchen  3-8  Eier  in
     selbstgegrabene  L&ouml;cher  oder  tiefe feuchte Baumspalten.  2-3 Monate
     sp&auml;ter schl&uuml;pfen die Jungtiere.




<h3>             Haltungsprotokoll 1995
</h3> 

     Wir  schafften  uns  drei  Tiere  (1,2)  im  Dezember  1994 aus einer
     Bochumer Zoohandlung als Wildf&auml;nge mit Fundort "Afrika" an.



<h3>           Das Aussehen der Tiere
</h3> 

     Zwei  Tiere  sind  ausgewachsen  (40  bzw.   33 cm), ein Weibchen ist
     offenbar  ein Jahr j&uuml;nger.  Nachts und w&auml;hrend der Aufw&auml;rmphasen sind
     alle  Tiere schmutzig dunkelbraun.  Die Weibchen hellen tags&uuml;ber auf,
     die  Oberseite  ist dann beige mit grober, unregelm&auml;&szlig;ig dunkelbrauner
     Fleckenzeichnung.    Das  M&auml;nnchen  &auml;ndert  seine  F&auml;rbung,  je  nach
     Stimmung, in ein auff&auml;llig buntes Bild.  Kopf, Hals und Nacken werden
     orangerot,  die Kehle schwarz, die Kehlfalte wiederum orangerot.  Der
     R&uuml;cken  wird  schwarzgr&uuml;n,  der  Schwanz  und ein Teil der Gliedma&szlig;en
     malachitgr&uuml;n.  Die Schulterregion, der obere Teil der Vorderbeine und
     der  Bauch  werden violett.  Reine Blaut&ouml;ne sind bei unserem M&auml;nnchen
     nicht  zu  finden.   Die  Farb&uuml;berg&auml;nge  geschehen  &uuml;ber den Grundton
     Schwarz.   Die  Schwanzschuppen  tragen dornige Forts&auml;tze.  Tr&auml;chtige
     Weibchen  zeigen auf der hinteren R&uuml;ckenpartie kupferfarbene Flecken,
     der Kopf bekommt zunehmend einen orangefarbenen Grundton.



<h3>           Das Terrarium f&uuml;r die drei Agamen
</h3> 

     Die Tiere bewohnen seit ihrer Anschaffung ein  <a href="terra.gif">Terrarium</a> mit den Ma&szlig;en
     150L*45B*45H,  was sich im Nachhinein als zu klein herausstellt.  Die
     Beleuchtung  besteht  aus  2  Leuchtstoffr&ouml;hren  36W  120cm  und zwei
     Strahlern  E14  zu 40W.  Die Drosselspulen der Leuchtstoffr&ouml;hren sind
     unter  einer  sandbeschichteten  Alu-Platte  auf dem Boden befestigt.
     Boden  und  Decke  sind  mit  Gipsmilch  gestrichen,  die  R&uuml;ck-  und
     Seitenw&auml;nde  sind  mit  strukturierten  0.5cm  Styroporelementen, die
     hellgelb  abget&ouml;nt  sind, verkleidet.  Die Be- und Entl&uuml;ftung sichern
     drahtnetzbespannte  L&uuml;ftungsschlitze  5*150cm  an der oberen R&uuml;ckwand
     und  vier 10cm "Bullaugen" an den Seitenw&auml;nden.  Die Front wird durch
     2  seitlich  verschiebbare  Glasscheiben gebildet.  Das Terrarium ist
     Teil  einer  Anlage  aus drei Einheiten &auml;hnlicher Gr&ouml;&szlig;e.  Durch gro&szlig;e
     Korkrindenelemente    werden   h&ouml;hlen&auml;hnliche   Versteckm&ouml;glichkeiten
     geschaffen.    Eine   vertikale   Korkrinde   wird   als  Sichtschutz
     eingebracht.
     


<h3>           Die Haltungsbedingungen im Terrarium
</h3> 

     Das  Terrarium  wird von 9-18 Uhr beleuchtet.  Die Aufheizung erfolgt
     durch  die  Drosselspulen und die Strahler.  Nach dem Ausschalten der
     Beleuchtung  k&uuml;hlt  das  Terrarium langsam auf die Wohnraumtemperatur
     ab.    Die   <a href="temp.gif">Temperaturspitzen</a>  liegen  bei  ca.   30-35°C  im  oberen
     Terrarienteil.    Auf   den  im  Terrarium  plazierten  Drosselspulen
     erreicht  die  Bodentemperatur  weit  &uuml;ber  40°C.   Nachts  kann  die
     Temperatur  bis  auf  17-18°C  fallen.  In den hei&szlig;eren Sommermonaten
     wird  z.T.  auf die Strahler verzichtet, damit die Temperaturen nicht
     zu  stark ansteigen.  Feuchtigkeit erh&auml;lt das Terrarium nur durch das
     kleine  Trinkgef&auml;&szlig;  und  eine  bodenwuchernde Kletterfeige im rechten
     Terrarienteil,  die  morgens  &ouml;fter,  abends  gelegentlich  mit dest.
     Wasser  bespr&uuml;ht  wird.   Als  Trinkgef&auml;&szlig;  wird  ein  im Substrat der
     Kletterfeige  eingebrachter  Kunststoffbeh&auml;lter  gut  angenommen, ein
     ausgelagerte  Glasgef&auml;&szlig;  jedoch  nicht.   Die  <a href="feu.gif">Luftfeuchte</a> schwankt so
     zwischen  minimal  30%  relative  Feuchte tags&uuml;ber und maximal 70-80%
     nachts.



<h3>           Die Nahrung f&uuml;r die Agamen
</h3> 

     alphabetisch, nicht nach Vorliebe ;)

     Bananen
     Fisch, gekocht
     Grillen
     Heimchen
     Mandarinen
     Nudeln, gekocht
     Papayas
     Schwarzk&auml;fer(larven), zur Tragzeit eingepudert
     Tomaten
     Wachsmotten
     Wanderheuschrecken

     Alles in unertr&auml;glichen Mengen!
     Nach  ein  bis  zwei  Fastentagen  gehen  die Tiere, insbesondere das
     weniger  scheue  M&auml;nnchen,  mit  Begeisterung an alles, was angeboten
     wird, aus Versehen an den eigenen Kot und an Korkst&uuml;ckchen, weiterhin
     an  Bananen, an Kochfisch, an Nudeln, sobald nur damit herumgewackelt
     wird   oder   man   die  Portionen  in  das  Terrarium  wirft.   Auch
     unbewegliche   Dinge  werden  als  Futter  probiert.   Seien  es  nun
     liegengebliebene   Beine   einer  Grillenmahlzeit  oder  unbewegliche
     Bananen-  und  Fischst&uuml;cke,  gerne  wird  auch  mein Finger probiert.
     Offenbar  h&ouml;ren  diese  Agamen  auch  sehr  gut,  da  sie versteckten
     Heimchen  nachsp&uuml;ren  und  sie  auch  entdecken.   Tritt  man  an das
     Terrarium  heran  und  sagt  irgendetwas,  kommen  auch oft die Tiere
     hervor,  die  sich  vorher  in  einem  Unterschlupf  befunden  haben.
     Tags&uuml;ber  wird immer wieder Bodensubstrat, bestehend aus Kies 2-4 mm,
     Muschelgriet und Vogelsand, aufgenommen.  Die Tiere trinken aktiv aus
     einem  im Pflanzgef&auml;&szlig; der Kletterfeige eingebrachten Trinkgef&auml;&szlig;.  Ein
     offen plaziertes Glasgef&auml;&szlig; wurde nicht angenommen.



<h3>           Das Verhalten der Agamen
</h3> 

     Ca.   1  Stunde nach Beleuchtungsbeginn werden die Tiere aktiv, wobei
     das M&auml;nnchen immer noch eine halbe Stunde l&auml;nger braucht.  Daf&uuml;r legt
     es  sich  auch  eine Stunde fr&uuml;her hin !  Die Tiere hinterlassen ihre
     Exkremente  morgens  alle  !   an  der gleichen Stelle soweit weg wie
     m&ouml;glich  von  ihrem  Schlafplatz.   Der  Schlafplatz  liegt rechts im
     Terrarium, der Donnerbalken - die Tiere krallen sich an der Wand fest
     ;-)  -  links &uuml;ber einer kiesgestreuten Fl&auml;che.  Sp&auml;testens alle zwei
     Tage  wird  mit  einer Kotschaufel die Stelle ges&auml;ubert, anschlie&szlig;end
     noch   mit   Vogelsand  bestreut,  um  die  Geruchsbel&auml;stigung  durch
     unbemerkt  liegen  gebliebenen Kot zu reduzieren.  Einmal aufgew&auml;rmt,
     beansprucht   das   M&auml;nnchen  als  einzig  vertretener  Gockel  seine
     Vormachtstellung  und  jagt  den  Weibchen  nach, die so ihre vormals
     ruhige  Vormittagsphase  abbrechen  m&uuml;ssen  und  sich  in  Sicherheit
     bringen.   Das  M&auml;nnchen  stellt  die Verfolgungsjagden recht schnell
     ein, selten ist die Verfolgungsstrecke l&auml;nger als drei Meter, entlang
     der  oberen  R&uuml;ckwand  und  &uuml;ber die Bodenhindernisse.  Nach der Jagd
     imponiert  das  M&auml;nnchen durch mehrmaliges, sehr heftiges Kopfnicken,
     die Weibchen antworten?  ihrerseits nicht selten mit Kopfnicken, wenn
     auch weniger heftig und weniger h&auml;ufig.  Nat&uuml;rlich nur dann, wenn das
     Verfolgungsspiel  nicht  in  einer  der  Versteckpl&auml;tze aus Korkrinde
     endet.  Zu ernsthaften Verletzungen ist es dabei nicht gekommen; zwar
     erwischte  das  M&auml;nnchen  das  verfolgte  Weibchen  gelegentlich, die
     Weibchen  bei&szlig;en  in  zu  gro&szlig;er  Bedr&auml;ngnis  allerdings  zur&uuml;ck, sie
     fl&uuml;chten  dann  weiter, und es ist Ruhe, das abschlie&szlig;ende Kopfnicken
     nicht  zu  vergessen!   Leider beanspruchen die Kletterjagden entlang
     der  R&uuml;ckwand  die Oberfl&auml;che sehr stark.  Der Styroporuntergrund mit
     der  einfachen  Wandfarbe  als Oberfl&auml;che br&ouml;ckelt durch die scharfen
     und kr&auml;ftigen Krallen ab.
     


<h3>           Paarung
</h3> 

     Am  13.01.95  beobachten wir eine Begattung.  Das betroffene Weibchen
     nimmt  schon innerhalb einer Woche an Umfang zu, gleichzeitig wird es
     noch  verfressener  als  sonst.   Bei  einer F&uuml;tterung springt es mir
     sogar  ins Gesicht und zerkratzt mich mit ihren scharfen Krallen.  In
     einen  hineingehaltenen  Finger  wird  kr&auml;ftig  hineingebissen.   Das
     Weibchen  wird  nun auch in der N&auml;he des M&auml;nnchens geduldet und liegt
     oft  bei  ihm  oder  sogar &uuml;ber ihm.  Bei einer Anmache des M&auml;nnchens
     macht  es eine Art Katzenbuckel und das M&auml;nnchen h&auml;lt inne.  Die Jagd
     nach  dem  zweiten  Weibchen  geht weiter wie gehabt.  Am 03.02.  ist
     auch  das  zweite Weibchen tr&auml;chtig.  Sie werden jetzt beide geduldet
     und das M&auml;nnchen hat eigentlich nichts mehr zu tun :-)

     Am 27.05.95 setzt ein Weibchen vormittags 2 befruchtete Eier ab.  Sie
     werden  in  eine  Plastikdose  mit  feuchtem  Blumenerde/Sand-Gemisch
     &uuml;berf&uuml;hrt.  Ein Ei ist eingefallen.  Seit der Paarung sind jetzt &uuml;ber
     vier  Monate!   vergangen.   Ich  dachte  schon,  die Tiere w&uuml;rden an
     Eierverh&auml;rtung  eingehen.   Hin und wieder taucht morgens noch ein Ei
     auf.   Von  welchem  Weibchen,  ist  unklar.  Leider vertrocknen alle
     abgesetzten  Eier  nach  anfangs  guter  Entwicklung,  das verwendete
     Brutsubstrat  ist  wirklich  sehr  schlecht auf konstanter Feuchte zu
     halten !



<h3>           Ausf&auml;lle
</h3> 

     Das   M&auml;nnchen  stirbt  einige  Wochen  nach  der  Paarung  an  einem
     entz&uuml;ndlichen Hemipenisvorfall.

</PRE>

<HR>
<a href="BEGRUESSUNG.html">Begr&uuml;&szlig;ung</a> , <a href="FORUM.html">Forum</a> , <a href="TERMINE.html">Termine</a> , <a href="ANZEIGEN.html">Anzeigen</a> , <a href="IMPRESSUM.html">Impressum</a> , <a href="RAPTORINDEX.html">Index</a>
<hr>
<h5> RAPTOR-MAG Ausgabe 1
</h5>

</BODY>
