<HEAD>
<TITLE>
Zucht von Wachsmotten</TITLE>
</HEAD>

<BODY>
<PRE><a href="FUTTERLISTEN.html"><img src="ArrowLeft.gif"></a> <a href="GRUNDLAGEN.html"><img src="ArrowRight.gif"></a> <hr>
<img src="il_wachs1.gif">
<hr>


Wachsmotten und insbesondere deren Larven sind ein gutes und weit verbreitetes
Lebendfutter. Die meisten Tiere fressen sie recht gern, manche bevorzugen die
Larven, andere jagen mit Vorliebe den Motten hinterher. Viele Tiere bekommt man
mit den Maden erst ans Fressen, manchen schmecken sie sogut, da&szlig; sie nichts
anderes mehr anr&uuml;hren wollen!

Wachsmotten(maden) sind bei vielen H&auml;ndlern zu erwerben, allerdings  zu einem
recht schmerzhaften Preis, der bis an die 10,--DM heranreichen kann. Dabei wei&szlig;
man beim Kauf noch nicht einmal, wie ergiebig der Ansatz sein wird.

Zwei Tips zum Einkauf: 

 1. Einen ergiebigen Ansatz erkenne ich sicher daran, da&szlig; das Brutgef&auml;&szlig;
    eine hohe Eigentemperatur aufweist. Wachsmaden erzeugen viel Eigen-
    w&auml;rme.
 2. Nach dem Einkauf den Ansatz m&ouml;glichst in ein ausbruchsicheres Gef&auml;&szlig;
    umf&uuml;llen. Nicht, da&szlig; die Maden besonders flink sind ;), aber sie
    finden auch kleinste Schlupfl&ouml;cher und gehen stiften. Irgendwo in
    der Wohnung (unter dem Teppich, in W&auml;schefalten, usw.) verpuppen
    sie sich dann, was nicht jedermanns Geschmack ist...


Es gibt verschiedene Arten von Wachsmotten, beschaffen sollte man sich aber nur
die Gro&szlig;e Wachsmotte Galleria mellonella, da die Tiere eine ausreichende Gr&ouml;&szlig;e
erreichen. Bei unserem Zuchtansatz Maden bis 4cm L&auml;nge und Motten mit
betr&auml;chtlicher Spannweite ;)).



<h2>
 Z U C H T 
</h2>

Als Beh&auml;lter eignen sich gro&szlig;e Gl&auml;ser mit Schraubverschlu&szlig; (&ouml;fter mal Gurken essen
;), deren Deckel mit einer feinen Metallgaze versehen wird. Fliegendraht ist zu
grob, etwa die Weite von Benzinfiltern sollte man nehmen.

Absolut ungeeignet ist Holz oder Kunststoff; das Holz wird von den Maden
durchgefressen, der Kunststoff zwar nicht, daf&uuml;r l&ouml;st er sich auf, wenn die Maden
ihre Puppengespinste daran aufbauen. Offenbar enth&auml;lt der Spinnfaden vor der
Verh&auml;rtung eine kunststoffl&ouml;sende Komponente. Man hat dann L&ouml;cher im Gef&auml;&szlig;, durch
die die Maden entkommen...

Als Futter eignen sich bebr&uuml;tete Bienenwaben, die nicht zuviel Honigreste
enthalten sollten, da das Futter dann bald g&auml;rt und die Maden anges&auml;uselt sind
;).

Bienenwaben sind nicht immer zu beschaffen, dann sollte man auf Ersatzfutter
ausweichen, das die Maden auch fressen. Rezepte gibt es einige, wir setzen mit
Erfolg folgende Mischung ein:

  50 g Honig
  50 g Glycerin
   5 g Korvimin ZVT 
  20 g Kleie
  20 g Magermilchpulver
  20 g Vollmehl
  40 g Hartweizengries

Honig und Glycerin werden getrennt vermischt und zu den anderen, ebenfalls vorher
vermischten Zutaten gegeben und verr&uuml;hrt. Man erh&auml;lt ein kr&uuml;meliges Substrat, in
dem man haupts&auml;chlich den Honig und die Kleie durchschmeckt ;), und das f&uuml;r 5-10
Gl&auml;ser f&uuml;r etliche Tage  ausreicht.

Alternativ f&uuml;r Korvimin ZVT empfehlen manche Z&uuml;chter 10g Trockenhefe, aber dann
ist eine G&auml;rung des Substrates nicht auszuschlie&szlig;en, und die Maden sind schon
wieder betrunken ;).

Der teuerste Bestandteil ist das Glycerin (Apotheke), trotzdem kommt man mit der
o.a. Mischung nur auf ca. 9,--DM pro Kilogramm Ersatzfutter. Fachh&auml;ndler biten
ihre Substrate f&uuml;r mindestens das Doppelte an!

In die vorbereiteten Zuchtgef&auml;&szlig;e gibt man dann Wachsmotten oder eben Puppen, die
Motten legen ihre Eier ins Substrat ab. Je nach Temperatur kann es dann einige
Wochen dauern, bis die ersten Maden sichtbar sind. Bei 30 Grad Celsius oder
unseren Hochsommertemperaturen geht es dann schneller, und man ist bald von
Hunderten von Maden umgeben...

</PRE>

<HR>
<a href="BEGRUESSUNG.html">Begr&uuml;&szlig;ung</a> , <a href="FORUM.html">Forum</a> , <a href="TERMINE.html">Termine</a> , <a href="ANZEIGEN.html">Anzeigen</a> , <a href="IMPRESSUM.html">Impressum</a> , <a href="RAPTORINDEX.html">Index</a>
<hr>
<h5> RAPTOR-MAG Ausgabe 1
</h5>

</BODY>
