<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,balance of power,interview">
<title>Metal Corner</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="blue">Interview mit Balance Of Power</Font></center></h1></P>

<p>Die haben die Jungs um die beiden K&#246;pfe der Band, Lionel Hicks (Drums) und Tony 
Ritchie (Bass), nicht nur hinsichtlich der bisherigen Meinung der Leute zur 
aktuellen Platte Perfect Balance. Wie einige von Euch wissen d&#252;rften, hat 
sich seit der ersten Scheibe der Briten einiges in stilistischer Hinsicht 
getan. Startete man unter der Regie von Tony noch als AOR-Act haben sich immer 
mehr h&#228;rtere und auch progressivere Elemente eingeschlichen, die bei erw&#228;hntem 
vierten Output nun absolut in bester Harmonie nebeneinander stehen.</P>

<p><i>Allein der Titel des Albums war schon ein Ansporn f&#252;r uns, alles so homogen und kompakt 
wie m&#246;glich zu machen,</I> beginnt Tony das Gespr&#228;ch. <i>Das neue Material sollte 
alles, was Balance Of Power ausmacht, unter einen Hut bringen. Die Leuten 
mochten zwar die letzte Scheibe <b>Ten More Tales</B>, aber man sollte nie einfach 
nur immer wie gewohnt weiter machen. Wir vertreten einerseits nach wie vor die 
selbe musikalische Linie, aber gerade an den Steigerungen, den H&#246;hepunkten der 
Songs haben wir viel herumgefeilt. Es hat sich entwickelt. Ganz nach dem Motto `To 
be continued', haha.</I></P>

<p>Mit dem Side-Projekt <b>USM</B> gingen mehrere Mitglieder der 
Band zusammen an eine weitere Sache heran, die in etwa den selben Zielen 
entsprach.</P>

<p><i>Mit USM wollten wir eine Art Mitte schaffen zwischen der ersten Scheibe 
von Balance Of Power und <b>Ten More Tales</B>, die doch sehr proggig angehaucht 
war. Zudem werde ich ehrlich gesagt doof, wenn ich auf Dauer immer nur an der 
selben Sache herumdoktor. Ich war zwar auf den beiden letzten Scheiben in 
erster Linie nur ins Songwriting integriert, nachdem ich bei dem Erstling noch 
mit den Gitarren und dem Gesang herumgeschlagen habe. Nun bin ich eben als 
Basser bei Lionel und den Jungs dabei. Doch  wie gesagt, ich war stets in die 
Sache involviert. Das n&#228;chste war auch immer das ewige CD-aufnehmen - Konzerte 
- CD - Konzerte..... irgendwann hat man einen Knoten im Kopf.</I></p>

<p>Och, den kriegt 
man nicht nur von Musikmachen und auf der B&#252;hne rumhampeln. Auff&#228;llig an der 
neuen Platte ist, da&#223; sich gleich am Anfang absolut klasse Songs befinden. 
Sicher verst&#228;ndlich, denn w&#252;rde man die schw&#228;cheren, wobei man im Fall von 
<b>Perfect Balance</B> davon eigentlich nicht sprechen kann, Tracks zu Beginn 
loslassen... naja, ein Testh&#246;rer h&#228;tte nicht so seinen Spa&#223; daran.</P> 

<p><i>Das ist 
immer eine Wissenschaft f&#252;r sich. Bei einer Konzeptplatte ist die Reihenfolge 
der Songs klar, wenn es sich aber nur um einzelne Songs handelt, tut man sich 
mit dieser Entscheidung schon mal schwer. Aber sicher: Man mu&#223; zum einen sehen, 
da&#223; die Platte ein gutes Auf und Nieder hat und nicht schnelle Songs am St&#252;ck 
und irgendwann alle Balladen kommen zum Beispiel. Zum anderen sollte man auch 
versuchen, den H&#246;rer von Anfang an einzufangen.</I></P> 

<p>Und nun zum anf&#228;nglich leicht 
angedeutet Thema: Bei Ver&#246;ffentlichung der ersten Platte hatte wohl noch 
niemand mit dieser soundtechnischen Entwicklung gerechnet. Au&#223;er Tony.</P> 

<p><i>Ich 
hatte diese Vision von vornherein. F&#252;r mich war klar, da&#223; sich diese Band recht 
schnell weiterentwickeln w&#252;rde und auch der Sound h&#228;rter und 
abwechslungsreicher werden w&#252;rde. Dennoch sind wichtige alte' Elemente, wie 
eben die Keyboards und auch der volle Sound geblieben. Das Debut zeigt auch 
noch einige andere Mitglieder in der Band und es gesellten sich im Laufe der 
Zeit auch immer mehr Einfl&#252;sse zur urspr&#252;nglichen Stilistik. Andererseits 
beh&#228;lt man sicher auch seine Idole bei. Auch wenn man selbst bereits die 
M&#246;glichkeit hat, CDs aufzunehmen, motivieren einen die eigenen Helden immer 
wieder aufs Neue. Das kann einen enorm helfen, sich nicht zu schnell auszuruhen 
und zu bequem zu werden. Sich an diese Motivation zu erinnern und sie sich 
wieder in die H&#252;tte zu holen, versetzt einen nicht selten einen kr&#228;ftigen 
Tritt.</I></P>

<p>W&#228;hrend sich Balance Of Power mit jeder einzelnen Scheibe deutlich und 
auch f&#252;r Nasenb&#228;ren erkennbar weiterentwickelten, brauchen manch andere Combos 
schon allein drei Alben, um auch nur einen kleinen Schritt weiterzukommen. </P>

<p><i>Nun, ich denke, da&#223; es sicher auch von der Pers&#246;nlichkeit eines Musikers und 
der Chemie innerhalb einer Band abh&#228;ngt, wie schnell sich dieser Reifeproze&#223; 
einstellt. Wenn man in dieser Richtung keinen Ehrgeiz hat, sondern mit dem, was 
man tut, zufrieden ist, dauert es eben l&#228;nger, da sich das musikalische Wachsen 
dann auch dem nat&#252;rlichen Reifen der jeweiligen Pers&#246;nlichkeit anpa&#223;t.</I></P>

<p>Jeder 
nach seiner Fasson. Gute Mucke kann so oder so dabei herauskommen. Einen 
kleinen Tipp von Tony gibt es allerdings noch. Oder besser gesagt: Ein 
Beispiel, das vielleicht ab und an mal zu bedenken w&#228;re:</P> 

<p><i>Es bringt absolut 
nichts, einen Song mit auf die Scheibe zu nehmen, wenn man sich nicht so ganz 
sicher ist, da&#223; er was taugt. Nur um einer vollen CD wegen mu&#223; sowas echt nicht 
sein. Niemand schreibt nur Bomber, aber wenn wir Zweifel an einem St&#252;ck haben, 
lassen wir es bleiben.</P></I>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
