<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,jag panzer,mechanized warfare">
<title>Jag Panzer: Mechanized Warfare</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Jag Panzer: Mechanized Warfare</font></h1><BR> (54:24 / Century Media)</center></P>

<p>Man, dass nach dem v&#246;llig zu recht &#252;berall abgefeierten letztj&#228;hrigen Konzeptalbum &quot;Thane To The Throne&quot; (Vorlage: Macbeth) die Jungs von Jag Panzer gut ein Jahr sp&#228;ter bereits mit einem weiteren Longplayer am Start sind, h&#228;tte wohl keiner gedacht. Zwar handelt es sich bei &quot;Mechanized Warfare&quot; um kein Konzeptalbum, aber starke Einzelsongs, die keinem durchlaufendem Konzept unterworfen sind, k&#246;nnen ja auch ganz unterhaltend sein. Und das ist fast eine Untertreibung, haben sich Jag Panzer doch auf ihrem aktuellen Studioalbum mal wieder selbst &#252;bertroffen und ein Album getreu der Devise &quot;Only Killers, No Fillers&quot; abgeliefert, welches sich schon nach dem ersten Durchlauf in den Geh&#246;rgang eines jeden Fans des klassischen (US) Metals einbohrt. Ganz egal ob man nun  den Opener &quot;Take To The Sky&quot; (was ein Chorus!), den flotten Kracher &quot;Frozen In Fear&quot;, das treibende &quot;The Silent&quot;, das von Maiden`s Eingangsriff zu&quot;22 Acacia Avenue&quot; angetriebene &quot;The Scarlet Letter&quot; oder das powernde &quot;Power Surge&quot; anspielt - jeder Song ist ein individuelles Highlight auf &quot;Mechanized Warfare&quot;. Erw&#228;hnenswert ist an dieser Stelle noch der mit orchestralen Elementen versetzte Abschlusstrack &quot;All Things Renewed&quot;, der Fans des epischen Vorg&#228;ngers nochmal nachhaltig vollauf zufrieden stellen d&#252;rfte. Die fetten Gitarren (und damit meine ich fett!) und der mal wieder g&#246;ttergleiche Gesang von Harry &quot;The Tyrant&quot; Conklin tun ihr &#252;briges, um dem Album den letzten Kick zu geben und machen die ganze Angelegenheit zu einem der st&#228;rksten Old School Metal Alben in diesem Jahr - hier k&#246;nnen Fans eigentlich nichts falsch machen und die Platte ohne bedenken blind abgreifen. Stellt sich nur die Frage, wie Jag Panzer immer wieder solche Hammeralben hinkriegen, denn schon seit 1996 (ganz zu schweigen von dem Kultalbum &quot;Ample Destruction&quot;) liefern die Jungs ausschlie&#223;lich solche G&#246;ttergaben ab. Wer &quot;Mechanized Warfare&quot; nicht neben den alten Jag Panzer Alben im Schrank stehen hat, geh&#246;rt sofort dazu verdammt, sich einen Tag lang dieses ganze Nu-Metal Gepl&#228;nkel anzuh&#246;ren - sp&#228;testen dann wei&#223; man solche Killeralben wieder richtig zu w&#252;rdigen!</P>

<p>Fazit: 10 von 10 Punkten </P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd4.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
