<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,pretty maids,red hot and heavy">
<title>Oldie Review: Pretty Maid`s Red, Hot And Heavy</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><center><h1><font color="#00ff00">Oldie Review: Pretty Maid`s Red, Hot And Heavy</font></h1><br> (36:19 / Sony)</Center><br>

<p>Bis auf wenige Ausnahmen war es in Sachen Heavy Metal in D&#228;nemark immer recht ruhig geblieben. Eine dieser Ausnahmen sind die Pretty Maids, die im Laufe ihrer inzwischen 20-j&#228;hrigen Bandgeschichte nicht nur f&#252;r treibende Live Shows stehen, sondern auch jede Menge Klassiker abgeliefert haben, die heute - v&#246;llig zu recht - Kultstatus genie&#223;en.</P>

<p>Ich habe mir f&#252;r die Metal Corner den zweiten Longplayer der Band rausgew&#252;hlt, der f&#252;r mich der st&#228;rkste in der Bandgeschichte ist. So besticht &quot;Red, Hot And Heavy&quot; nicht nur mit b&#228;renstarken Metal Geschossen der Marke &quot;Back To Back&quot; (eine der st&#228;rksten Songs der Combo &#252;berhaupt, der &#252;brigens von HammerFall auf dem `98er Zweitwerk &quot;Legacy Of Kings&quot; in einer v&#246;llig blutleeren Version gecovert wurde), &quot;Red, Hot And Heavy&quot; oder &quot;Cold Killer&quot;, die allesamt von S&#228;nger Ronnie Atkins in bester Metal Manier veredelt werden, sondern auch mit melodischerem Material wie etwa &quot;Waitin` For The Time&quot;, welches einen hervorragenden Kontrast zu den beiden vorher gespielten &quot;Back To Back&quot; und &quot;Red, Hot And Heavy&quot; bietet und ein weiteres Highlight auf dieser Platte ist. Zwar verzichten die Jungs auf diesem Album noch g&#228;nzlich auf Balladen (die sie - wie sich im weiteren Verlauf der Karriere noch herausstellen sollte - ebenfalls hervorragend komponieren), aber die weiteren Kracher wie das erfrischend vorw&#228;rts preschende &quot;Night Danger&quot; oder die etwas gem&#228;&#223;igteren &quot;A Place In The Night&quot; bzw. &quot;Queen Of Dreams&quot; entsch&#228;digen komplett daf&#252;r. Mit &quot;Little Darling&quot; gibt es zum Abschluss sogar noch eine nette Coverversion im Metal Gewand, die den Longplayer w&#252;rdig abrundet.</P> 

<p>Alles in allem ist &quot;Red, Hot And Heavy&quot; ein Album ohne Ausfall und somit v&#246;llig zu Recht ein Klassiker, der in keiner Sammlung fehlen darf - als Vinyl Version macht dieses Album alleine schon aus klanglicher Hinsicht noch wesentlich mehr her, aber auch die normale CD Version, die heutzutage f&#252;r schlappe 20 DM zu haben ist, sollten sich Fans des klassischen Metal`s mit geh&#246;riger Melodic Schlagseite auf jeden Fall nicht entgehen lassen. Schade ist nur, dass dieses musikalische Juwel bereits nach knapp 37 Minuten wieder zu Ende ist....</P>

<p>Fazit: 10 von 10 Punkten</P>

<center>
<p><img src="kit.gif"></P>
<p><img src="oldie.jpg"></P>
<p><img src="kit.gif"></P></center>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
