<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - MMX: &quot;Sieben Jahre in Tibet&quot;</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>&quot;Sieben Jahre in Tibet&quot;</U></H1><P ALIGN="CENTER">von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></P>

<B>Die Illusion des unkomplizierten Lebens.</B>

<P>Einer der gro&szlig;en Vorz&uuml;ge, die sich der Mensch den Tieren gegen&uuml;ber
zuschreibt, ist der, entscheiden zu k&ouml;nnen, wann es sich lohnt, sich
einem Problem zu stellen oder lieber davor davonzulaufen. Nun sind
jedoch die Menschen bekannterma&szlig;en sehr verschieden und so braucht
es nicht viel, sich zu denken, da&szlig; es solche unter ihnen gibt, die
eher geneigt sind zu k&auml;mpfen und solche, die einen Hang zum
Davonlaufen haben.</P>
<P>Brad Pitt ist j&uuml;ngst in die Rolle eines der letzteren geschl&uuml;pft.
Und mit ihm schl&uuml;pfen auch wir in diese Rolle und fl&uuml;chten in die
Abgeschiedenheit eines romantisch-bezaubernden Fleckchens dieser
Erde, ins Tibet der 40er Jahre.</P>
<P>Jean-Jaques Annaud, ein Name, der mir seltsam sympathisch vertraut
klingt, obgleich ich ihn keinem Konkreten Machwerk zuordnen kann,
verf&uuml;hrt uns mit seinem halbdokumentarischen Epos &quot;Sieben Jahre in
Tibet&quot; in die Illusion vom unkomplizierten Leben...und wir folgen
ihm bereitwillig.</P>
<P>Der Film beginnt seine Geschichte zu erz&auml;hlen, als Hendrik, sein Held
und ein in Deutschland lebender &Ouml;sterreicher, Ende der 30er Jahre zum
Himalaya aufbricht, um dort im Zeichen Deutschlands als Erster den Gipfel eines
indischen Berges zu erklimmen. </P>
<P>Der Abschied von seiner schwangeren Frau erfolgt im Streit, wie man
sp&auml;ter erf&auml;hrt, weil Hendrik vor der Verantwortung als Vater fl&uuml;chtet.
Seine Expedition jedoch verl&auml;uft nicht wie geplant, und als der Krieg
zwischen Deutschland und Indien erkl&auml;rt wird, ger&auml;t der schon hier als
etwas eigensinnig charakterisierte Held in Schwierigkeiten. </P>
<P>Hier beginnt die eigentliche Geschichte des Films und deshalb h&ouml;re
ich auf, von ihr zu berichten. &Uuml;ber sie sei nur gesagt, da&szlig; sie die
bezaubernde Geschichte eines fremden Mannes ist, der durch gl&uuml;ckliche
Umst&auml;nde in ein abgeschiedenes Land kommt, in dem den Menschen ihr Gott
noch heilig ist.</P>
<P>Sieben Jahre wird Hendrik in Tibet verbringen, zwei Stunden gibt uns
Jean-Jaques, uns aus der realen Welt entf&uuml;hren zu lassen und an seinen
Bildern zu erfreuen. Und wie wir uns freuen d&uuml;rfen. Bildmaterial, Musik
und das Zusammenspiel dieser sind vergleichbar mit dem in Filmen wie
&quot;1492 - Conquest of Paradise&quot;, &quot;Rapa Nui&quot; oder &quot;Der englische Patient&quot;.</P>
<P>Jede Szene komponiert Annaud zu einem kleinen Kunstwerk aus wunderbaren
Landschaften, harmonierenden ged&auml;mpften Farben und fern&ouml;stlichen Kl&auml;ngen
und gibt diesen Zeit, den Zuschauer an der in ihnen liegenden Ruhe
teilhaben zu lassen. Gro&szlig;en Beitrag liefert dazu freilich auch Brad
Pitt selbst, der ja nichts besser ausstrahlen kann, als Ausgeglichenheit.</P>
<P>Somit l&auml;&szlig;t sich der Zuschauer gern entf&uuml;hren und verzaubern, taucht in
die Illusion ein, es g&auml;be einen Ort auf der Welt, an dem das Leben noch
urspr&uuml;nglich und einfach w&auml;re. Und er hegt tiefes Mitgef&uuml;hl, als ihm
gnadenlos klar gemacht wird, da&szlig; auch diese Geschichte ein Ende hat.</P>
<P>Hendrik kehrt zur&uuml;ck nach Deutschland, Tibet ist ein anderes, als es
noch zwei Stunden zuvor war und der Abspann f&uuml;hrt den romantisch
verkl&auml;rten Blick des Kinog&auml;ngers sanft wieder in die Realit&auml;t zur&uuml;ck.</P>
<P>&quot;Sieben Jahre in Tibet&quot; ist einer von jenen Filmen, die es schaffen, zu
entf&uuml;hren, zu illusionieren, die den Zuschauer aber nicht h&auml;ngenlassen,
sondern ihn sanft wieder zur&uuml;ckholen, die die Desillusionierung nicht
dem Licht der Neonr&ouml;hren vor dem Ausgang des Kinos &uuml;berlassen. Er ist
gro&szlig;es Leinwandkino und sollte deshalb auch dort bewundert werden.
Und obgleich er harmlos ist, verdient er sich viel Lob, weil er der
Beweis ist, da&szlig; ein Film nicht klicheebeladen, oberfl&auml;chlich oder
l&auml;cherlich sein mu&szlig;, um einfach nur zu unterhalten.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9712cfy.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712a4.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
