<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - MMX: &quot;KATARRHUS&quot;</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>&quot;KATARRHUS&quot;</U></H1><P ALIGN="CENTER">von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></P>
<P ALIGN=CENTER> &copy;opyright by Gregor Franz. All rights reserved.</P>
<P> [<B>Kommentar</B>: Urspr&uuml;nglich war diese Geschichte als Titel-Story
  f&uuml;r ein nie zu Ende programmiertes Computer-Spiel gedacht.
  Im Spiel ging es lediglich darum, ein kleines, sich den Weg
  durch seine Feinde freiballerndes Raumschiff durch einen
  Hintergrund von Chips und Leiterbahnen zu steuern.
  Auch unter diesen Bedingungen wollte ich zeigen, da&szlig; die Story
  nicht ganz so platt werden mu&szlig;, wie die meisten von &auml;hnlichen
  Spielen: B&ouml;sen, dummdreisten Au&szlig;erirdischen f&auml;llt es urpl&ouml;tzlich
  ein, in Scharen loszuziehen, um die Erde zu vernichten und
  ein einsamer Held, mit dem einzigem verf&uuml;gbaren Superduper-
  kampfraumer mu&szlig; sich ihnen entgegenstellen (oder so &auml;hnlich) ...]</P>
<P ALIGN=CENTER>(so geschehen 1993)</P>
<HR WIDTH="50%">
<PRE>
 Au&szlig;er Atem stoppte er kurz seinen Lauf und schaute sich um.
  Doch in dem breiten, quadratischen Gang, dessen W&auml;nde mit einer
 Schicht grauen Plastiks &uuml;ber dickem Flexid-Stahl ausgekleidet
 waren, konnte er seine Verfolger noch nicht sehen. Aber er
 sp&uuml;rte, da&szlig; sie nicht mehr weit entfernt waren.
  Mit dem &Auml;rmel seines dunklen Arbeitsoveralls wischte er sich
 Schwei&szlig; von der Stirn, bevor er weiter spurtete. 'Hat sich das
 regelm&auml;&szlig;ige Training im Fitnessraum also doch ausgezahlt',
 dachte er, da er sp&uuml;rte, da&szlig; seine Muskeln noch nicht &uuml;berm&auml;&szlig;ig
 ersch&ouml;pft waren.
  Zielgerichtet rannte er an der n&auml;chsten Kreuzung in den rechten
 Gang hinein, wobei er gleichzeitig auf Fu&szlig;tritte hinter sich
 horchte.
  Trotzdem er sich krampfhaft auf seinen Plan konzentrierte,
 schossen ihm st&auml;ndig Bruchst&uuml;cke seiner T&auml;tigkeit auf diesem
 Planeten durch den Kopf.
  Sein Deckname in dieser Pyramidenstadt, von der sich drei Vier-
 tel unter der Oberfl&auml;che befanden, war `Fei`. `Konter Fei`, um
 genau zu sein.
 Er war Geheimagent des KGA - Jawohl er arbeitete f&uuml;r den Rost-
 block. Aber das hatte er sich nicht ausgesucht.
  Er war mit dem Regime der NASO genausowenig einverstanden, wie
 mit dem des Rostblocks. Aber vielleicht hatte es das Schicksal
 so gewollt, da&szlig; gerade dieser ihn auf seinem Heimatplaneten, der
 eher zuf&auml;llig im Rostblock-Machtbereich lag, zum Spion gepre&szlig;t
 hatte.
  Als einziger Agent war er dann, nach einer mehrmonatigen inten-
 siven Ausbildung, vom KGA in die eine Stadt dieses entlegenen
 Planeten eingeschleust worden, die es auf ihm gab.
  Es galt als &uuml;bliche Praxis der intergalaktischen Geheimdienste.
 Mehr Agenten auf jedem unbedeutenden Planeten einsetzen, w&uuml;rde
 einen riesigen Personalaufwand bedeuten.
  Wenn er seine Spionaget&auml;tigkeit beenden w&uuml;rde, so hatte ihn
 sein F&uuml;hrungsoffizier gewarnt, w&uuml;rde der KGA seine wahre Identi-
 t&auml;t offenlegen, was im NASO-Machtbereich seine sofortige
 Exekution zur Folge haben w&uuml;rde.
  Das war deutlich genug gewesen und so hatte er hier vor einem
 halben Jahr eine Scheinidentit&auml;t als Servicetechniker angenommen,
 der angeblich von einem der kleineren Transportraumer, die
 gelegentlich den Raumhafen auf der oberen Pyramidenplattform
 anliefen, abgemustert hatte.
  Die Stadt 'Pyronha' war gr&ouml;&szlig;tenteils von einem dichten Gangnetz
 durchzogen, um das sich Wohntrakte, Arbeits- und Erholungsbe-
 reiche gruppierten. Nur im Kern war ein gr&ouml;&szlig;erer Freiluftbereich
 einer echten Stadt mit vielen gr&uuml;nen Parks nachempfunden. Die
 inneren Pyramidenw&auml;nde ragten an deren Enden weit in die H&ouml;he,
 mit teilweise verglasten Terrassen, an denen zahlreiche kleine,
 durchsichtige Fahrst&uuml;hle hinauf- und hinabglitten. Viele &uuml;ber-
 arbeitete Angestellte, der dort gelegenen B&uuml;ros, versuchten sich
 gelegentlich mit einem Blick in die Tiefe, auf die friedliche
 Stadt, zu entspannen. Eines der Details, die ihm bei seinen
 Arbeitseins&auml;tzen in diesem Bereich aufgefallen waren, das keinen
 geheimdienstlichen Wert besa&szlig;.
  Au&szlig;erhalb der Pyramide gab es keine menschlichen St&uuml;tzpunkte,
 denn dort war die H&ouml;lle los.
  Tats&auml;chlich konnte er den Raumkundschafter verstehen, der nach
 der ersten Landung dem Planeten den Namen verpa&szlig;t haben sollte.
  'KATARRHUS' pa&szlig;te gut. Die giftige Atmosph&auml;re der rotwallenden
 Nebel, die vom Erdboden zehn Meter hoch reichten und die st&auml;ndi-
 gen eruptiven Ersch&uuml;tterungen lie&szlig;en tats&auml;chlich h&ouml;chstens den
 Vergleich mit einer Schleimhautentz&uuml;ndung aufkommen.
  Was seine Auftraggeber wahrscheinlich nicht geahnt hatten, war,
 da&szlig; dieser Planet, wenn vielleicht auch kein gro&szlig;er Milit&auml;rst&uuml;tz-
 punkt, so doch ein bedeutender Forschungsstandort war.
  Die Firma, bei der er angestellt war, wartete Elektronikanlagen
 aller Art. Unter anderem auch in den Sicherheitsbereichen, in
 denen sich die Forschungslabors befanden.
  Als er vor ein paar Wochen zum ersten Mal einen Routineauftrag
 an der Bel&uuml;ftungselektronik in einem der Labors ausf&uuml;hrte, hatte
 er zuf&auml;llig eine wichtige Entdeckung gemacht.
  Auf einem der Monitore, der die benachbarte Versuchshalle
 zeigte, konnte er in einem unbeobachteten Moment den Test eines
 neuartigen Ger&auml;tes mitverfolgen. Ein schmales und langl&auml;ufiges
 Etwas, da&szlig; auf einem St&auml;nder befestigt und mit einem riesigen
 Energiegenerator verbunden war, wurde auf einen massiven Stahl-
 quader gerichtet, dessen Ausma&szlig;e etwa denen einer kleinen Raum-
 f&auml;hre entsprach.
  Ein d&uuml;nner Strahl l&ouml;ste sich von dem Ger&auml;t und der Quader ver-
 schwand in Sekundenbruchteilen. Ohne den geringsten Laut und ohne
 jeden R&uuml;ckstand. Ungl&auml;ubig hatte er damals auf den Schirm ge-
 starrt, aber als er die direkt neben dem Ding stehenden Wissen-
 schaftler wild gestikulieren sah, wu&szlig;te er, da&szlig; es keine Hallu-
 zination gewesen war.
  Sp&auml;ter, in seiner kleinen, nicht besonders gem&uuml;tlichen Wohnein-
 heit, wurde ihm bewu&szlig;t, da&szlig; er etwas tun m&uuml;sse. Nicht, weil er
 sich dem Rostblock besonders verpflichtet f&uuml;hlte, wollte er
 dieses Ger&auml;t entwenden.
  Nein, seitdem ihn der KGA aus seinem stinknormalen Leben ge-
 rissen hatte und ihn zwang Spion f&uuml;r ihn zu werden, f&uuml;hlte er
 keine Loyalit&auml;t mehr in sich.
  Aber diese Waffe konnte einen zuk&uuml;nftigen Krieg entscheiden,
 der bisher nur durch ein gleiches Kr&auml;fteverh&auml;ltnis verhindert
 wurde. Er mu&szlig;te versuchen dieses Verh&auml;ltnis in der Waage zu
 halten, in dem er die Waffe zum n&auml;chsten St&uuml;tzpunkt des Rost-
 blocks brachte.
  Ihm war klar, da&szlig; selbst, wenn es ihm gel&auml;nge ins Weltall zu
 entfliehen, die gesamte hiesige NASO-Flotte jagt auf ihn machen
 w&uuml;rde. Spione waren vogelfrei.
  W&auml;hrend er sorgf&auml;ltig den Diebstahl und seine Flucht plante,
 &auml;nderte sich sein Verhalten den Arbeitskollegen gegen&uuml;ber nicht.
 Wie bisher hatten sie in ihm einen verschlossenen, aber zuver-
 l&auml;&szlig;igen und flei&szlig;igen Mitarbeiter.
  Nun rannte er hier die G&auml;nge entlang, den 'Defluxstrusator',
 wie er wohl hie&szlig;, zusammengeklappt in einer Innentasche des
 Overalls, beinahe erwartend, von seinen Verfolgern eingeholt zu
 werden.
  Sein Plan war &auml;u&szlig;erst riskant und er war beinahe selbst
 gespannt, ob es klappen w&uuml;rde. Mit einem leistungsstarken St&ouml;r-
 sender im Laborbereich, den er w&auml;hrend seiner Arbeit unauff&auml;llig
 in einzelnen Segmenten, als Ersatzteile getarnt, hineingebracht
 und zusammengesetzt hatte, konnte er eine vorzeitige Alarmmeldung
 in die umliegenden Sektionen verhindern.
  Das hatte ihm einen kleinen Vorsprung verschafft, der aber zu-
 sehends dahinschmolz. Ein paar G&auml;nge hinter der Sicherheitszone
 hatte er unter einer Bodenplatte einen ERGO-Blaster V12 zusammen
 mit zwei 30iger Reservemagazinen versteckt.
  Erst nach langem Z&ouml;gern hatte er sich f&uuml;r diese Waffe entschie-
 den. Eine ERGO-Patrone, die aus dem Magazin im Griffschaft, in
 die Fusionskammer geleitet wurde, lieferte die Energie f&uuml;r einen
 einsek&uuml;ndigen, fingerdicken Laserstrahl ungew&ouml;hnlicher Intensit&auml;t.
 Der Blaster war zusammen mit dem langen Lauf in etwa so lang, wie
 sein Unterarm ohne Hand gerechnet.
  Leider hatte er ihn schon einsetzen m&uuml;ssen. Ein feindlicher CIB-
 Agent, der im Nebenlabor ebenfalls getarnt arbeitete, hatte ihn
 entdeckt und griff ihn an. Konter scho&szlig; ihn nieder und versteckte
 ihn, nachdem er sich vergewissert hatte, da&szlig; er noch lebte, in
 einer Abstellkammer.
  Gl&uuml;cklicherweise traf man in dieser Sektion im Normalfall nur
 selten auf Leute, da sich hier haupts&auml;chlich Lagerhallen befanden
 und die Wohnzonen weit entfernt lagen. Doch auf milit&auml;rische
 Patrouillen mu&szlig;te er gefa&szlig;t sein.
  Konter Fei, dessen richtiger Name eigentlich Misan Teriks
 lautete (seine Freunde nannten ihn lediglich Mis), wu&szlig;te, da&szlig;
 sein St&ouml;rsender jeden Moment entdeckt werden konnte.
  Das dem noch nicht so war, bewies ihm ein kleines Ger&auml;t, dessen
 Ohrh&ouml;rer ihm Aktivit&auml;ten, der in den Decken- und Seitenw&auml;nden
 installierten Kommunikationsleitungen oder von Funkwellen mittels
 Piept&ouml;nen melden w&uuml;rde.
  Doch so lange konnte er nicht mehr warten. Er war nun schon
 mehrere riesige G&auml;nge entlanggelaufen, die sich sehr &auml;hnlich
 sahen und fragte sich, ob er die Orientierung verloren hatte,
 als er hinter sich die hastigen Stiefeltritte der Wachen und
 CIB-Leute h&ouml;rte, die ihn vom Labor aus direkt verfolgt hatten.
  Kurz hielt er in seinem energiesparenden Dauerlauf inne, den er
 sich antrainiert hatte, um den langen Gang, dessen Ende er fast
 erreicht hatte, zur&uuml;ckzuschauen.
  Seine Verfolger waren zwar noch nicht zu sehen, aber es konnte
 nicht mehr lange dauern, bis sie ihn eingeholt hatten. Im Moment
 lief noch alles nach dem enggesteckten Zeitplan.
  Langsam wurde es so weit f&uuml;r seinen vorbereiteten Trick.

                                  ***

 &quot;Sir, wir haben eine Unregelm&auml;&szlig;igkeit im Sicherheitssektor HL2
 zu verzeichnen&quot;, meldete einer der System&uuml;berwacher direkt unter-
 halb des Throns Gro&szlig;f&uuml;rsten Lnolis und lauschte konzentriert in
 seinen Kopfh&ouml;rer.
  Der schreckte unsanft aus dem Halbschlaf und richtete sich
 hastig in seinem Thron auf, in den er etwas unstandesgem&auml;&szlig; hinab-
 gerutscht war. &quot;&Auml;h ja?&quot;, murmelte er und lie&szlig; kurz den Blick
 durch die, im Dunkeln liegende Hauptzentrale Pyronhas schweifen.
  Sein erh&ouml;hter Sitz am Ende der Halle versprach eine gute Sicht.
 Trotzdem konnte er die zahlreichen Reihen mit den emsigen Gestal-
 ten nur durch die vielen leuchtenden Monitore, vor denen sich
 ihre Schatten abhoben, erahnen. Die riesige Stirnseite der
 Zentrale zeigte eine Projektion der Stadt von oben, wobei abwech-
 selnd die Ebenen durchgeschaltet wurden. Erst die Wachposten,
 die gelegentlich an ihrer Unterkante entlangliefen, machten ihm
 die Relationen richtig deutlich.
  &quot;Hier Sir&quot;, winkte einer der System&uuml;berwacher zu seinen F&uuml;&szlig;en,
 um auf sich aufmerksam zu machen.
  &quot;Was ist denn, Nummer...?&quot;, fragte der, in kostbarste, blau-
 gl&auml;nzende Gew&auml;nder gekleidete, breite und mit einem dunklen
 Spitzbart im feingeschnittenen Gesicht bewehrte F&uuml;rst, nach
 unten.
  &quot;212, Sir&quot;, antwortete der &Uuml;berwacher.
 Gro&szlig;f&uuml;rst Lnoli dr&uuml;ckte auf dem breiten, gl&auml;sernen Pult vor sich
 die Taste, auf der matt die Ziffer 212 leuchtete und die, neben
 einigen anderen Tasten von Systembeobachtern, die mit ihm Kontakt
 aufnehmen wollten, blinkte. Doch in einem wesentlich schnelleren
 Rhythmus, als die anderen. Ein Zeichen f&uuml;r Dringlichkeit.
  Er r&uuml;ckte sich die Krone, die mit einer Unmenge, wie er fand
 kitschigen, Verzierungen geschm&uuml;ckt war und in der Kopfh&ouml;rer
 und ein Kehlkopfmikrofon integriert waren, zurecht.
  &quot;Was ist denn Nummer 212?&quot;, brummte er noch einmal m&uuml;rrisch.
 Der Beobachter 212 deutete auf seinen Bildschirm, der aber von
 des F&uuml;rsten Thron beim besten Willen nicht zu erkennen war:
 &quot;Jeglicher audiovisueller Kontakt mit dem Sicherheitssektor HL2,
 also dem Hauptlabor 2 ist unterbrochen, Gro&szlig;f&uuml;rst.&quot;
  &quot;Ich wei&szlig;, was HL2 bedeutet&quot;, unterbrach ihn Lnoli unwirsch und
 lie&szlig; sich auf seinem Pult das Monitorbild des Beobachters anzei-
 gen, auf der die Karte der dritten Ebene Pyronhas zu sehen war.
 Ein rotumrandeter Bereich leuchtete in kurzen Abst&auml;nden auf.
  W&uuml;tend wuchtete der Gro&szlig;f&uuml;rst mit seiner Faust auf eine breite
 Taste unter den anderen, auf der 'Erster' stand und rief: &quot;Sofort
 zu mir, Hammerhart!&quot;
  In den Reihen vor ihm richtete sich eine Gestalt auf, deren Kopf-
 h&ouml;rer gerade angesprochen haben mu&szlig;te, und winkte.
  Hike Hammerhart war der erste Berater des Gro&szlig;f&uuml;rsten und sein
 engster Vertrauter, soweit man bei dem F&uuml;rsten von Vertrauen
 sprechen konnte. Eine imposante Erscheinung: gro&szlig;, kr&auml;ftig gebaut,
 energische Gesichtsz&uuml;ge und ein auff&auml;lliger Blondschopf. Er trug
 eine schlichte, samtschwarze NASO-Uniform, an der nur ein leuch-
 tendgelber Streifen am linken Oberarm, auf seine Stellung hin-
 wies. Das er der h&ouml;chste CIB-Offizier auf dem Planeten war,
 konnte man nicht erkennen.
  Rasch erklomm er die Stufen des Throns.
 &quot;Sie haben gerufen, Gro&szlig;f&uuml;rst?&quot;, fragte er leise.
  F&uuml;r Widerspruch gegen&uuml;ber dem F&uuml;rsten war er nicht bekannt. Auch
 wenn dieser oft unbeherrschte und manchmal sogar irrationale
 Befehle gab. Aber er stand in der Gunst des K&ouml;nigs und da mu&szlig;te
 selbst der erste Berater, auch als hiesiger CIB-Chef, vorsichtig
 sein.
  &quot;Habe ich, Oberst Hammerhart, habe ich&quot;, Gro&szlig;f&uuml;rst Lnoli deutete
 auf den Schirm vor sich, &quot;Was geht da im Sicherheitssektor HL2
 vor sich?&quot;
  Hammerhart beugte sich interessiert vor und betrachte den
 Monitor. &quot;Nun, ich wei&szlig; es ehrlich gesagt nicht&quot;, er richtete
 sich wieder auf, &quot;Sieht so aus, als ob wir mit dem Sektor den
 Kontakt verloren haben.&quot;
  Der Spitzbart des Gro&szlig;f&uuml;rsten zitterte, als er h&auml;misch grinste:
 &quot;Wieder ein Beweis, wie der CIB arbeitet, Oberst!&quot;
  Mit Vergn&uuml;gen sah er seinen Untergebenen vor Wut rot anlaufen.
 Auch wenn Hike Hammerhart am ehesten als sein Vertrauter gelten
 konnte, hie&szlig; das nicht, da&szlig; er ihn auch symphatisch finden mu&szlig;te.
  Die Wut des Oberst verrauchte langsam wieder, als er sah, da&szlig;
 sie Lnoli Freude bereitete. Eigentlich m&uuml;&szlig;te er den F&uuml;rsten doch
 langsam kennen.
  &quot;Vielleicht nur ein technischer Defekt&quot;, wandte er ein.
  &quot;Aller Systeme?&quot;, Gro&szlig;f&uuml;rst Lnoli sch&uuml;ttelte heftig den Kopf.
 Oberst Hammerhart warf noch mal einen Blick auf den Schirm im
 Pult. &quot;Ich werde einen Melder losschicken und ein paar Agenten,
 die herausfinden sollen, was da los ist&quot;, sagte er und aktivierte
 sein Kehlkopfmikrofon.
  Ein paar Minuten sp&auml;ter meldete sich bei ihm einer der Agenten
 des Nebensektors, den er nach HL2 geschickt hatte.
  &quot;Sir&quot;, sprach Hike Hammerhart den Gro&szlig;f&uuml;rsten an, &quot;ich glaube,
 ich wei&szlig; jetzt, worum es sich dreht.&quot;
  F&uuml;rst Lnoli wandte sich ihm zu: &quot;Ich bin ganz Ohr&quot;.
 Anstatt sofort zu antworten, gab Oberst Hammerhart jedoch erst
 kurz etwas auf den Tasten vor dem Pultschirm ein. &Uuml;ber der Glas-
 platte formte sich pl&ouml;tzlich eine etwa 20 Zentimeter gro&szlig;e Holo-
 grammabbildung eines Mannes, die sich um sich selbst drehte.
  &quot;Wer ist das?&quot;, fragte Lnoli erstaunt.
  &quot;Das ist der Mann, der den Defluxstrusator aus unserem Labor
 gestohlen, unser dortiges Kommunikationssystem lahmgelegt und
 mehrere unserer Wachleute und einen CIB-Mann ausgeschaltet hat.&quot;
  Der Gro&szlig;f&uuml;rst nahm sich nun deutlich mehr Zeit, den Mann zu
 mustern. Er sah einen schlanken, mittelgro&szlig;en und dunkelhaarigen,
 jungen Mann, der ziemlich normal, aber auch nicht auff&auml;llig
 unauff&auml;llig aussah.
  &quot;W&uuml;rde man ihm auf den ersten Blick nicht zutrauen, nicht wahr?&quot;,
 Hike Hammerhart hatte ihn beobachtet.
  Doch er erwartete keine Antwort: &quot;Sein Name, oder zumindest den,
 unter dem wir ihn kennen, lautet Konter Fei. Er ist seit etwa
 sechs Monaten auf unserem Planeten und arbeitete als Reparatur-
 techniker bei einer Wartungsfirma f&uuml;r elektronische Anlagen.&quot;
  &quot;Wie konnte es ihm gelingen an den Defluxstrusator heranzukommen
 und wieso hat er ihn &uuml;berhaupt gestohlen?&quot;, unterbrach ihn Lnoli
 aufgebracht.
  &quot;Wahrscheinlich weil sie die obligate Unbedenklichkeitstufe f&uuml;r
 Versorgungspersonal in den Sicherheitssektoren von drei auf zwei
 gesenkt haben, Sir. Sicher ist das ein neugeworbener KGA-Agent,
 da konnten wir ihn gar nicht in unseren Datenb&auml;nken haben&quot;,
 verteidigte Oberst Hammerhart seinen Geheimdienst engagiert.
  &quot;Schon gut&quot;, lenkte der F&uuml;rst ein, &quot;aber wir m&uuml;ssen ihn finden
 und ihm das Ger&auml;t wieder abnehmen. Ist das klar?&quot;, setzte er
 hinzu.
  &quot;Selbstverst&auml;ndlich, Sir&quot;, der Oberst winkte sich ein paar
 Untergebene heran, um ihnen Befehle zu geben.
  Der Systembeobachter, dessen Taste noch gedr&uuml;ckt war, meldete
 sich wieder: &quot;Gro&szlig;f&uuml;rst, der St&ouml;rsender in HL2, der den Kommuni-
 kationsausfall bewirkt hat, ist gefunden und deaktiviert worden.
 Eine der Gangkameras im Nebensektor hat den Agenten in Reich-
 weite. Soll ich sie auf den Schirm schalten ?&quot;
  F&uuml;rst Lnoli fuhr zu seinem Pultschirm herum: &quot;Na worauf warten
 sie noch, Mann&quot;, schrie er ins Mikrofon.
  Oberst Hike Hammerhart, der aufmerksam geworden war, trat neben
 ihn, als die Kamerasicht auf dem Schirm erschien. Der feindliche
 Spion namens Konter Fei rannte den Gang in scheinbar ge&uuml;btem
 Dauerlauf entlang und wirkte kaum ausgelaugt, obwohl er schon
 eine ziemlich gro&szlig;e Strecke hinter sich gebracht haben mu&szlig;te.
  In diesem Moment fa&szlig;te er sich an sein Ohr.
 Ein paar Wachsoldaten w&uuml;rden ihn gleich erreichen, konnte man in
 einem eingeblendeten Bildschirmausschnitt erkennen. Konter Fei
 hatte schon fast eine breite Gangkreuzung erreicht, als sie
 Sichtkontakt zu ihm bekamen und sofort schossen.
  Nach ein paar Antwortsch&uuml;ssen aus einer m&auml;chtigen Handfeuer-
 waffe, machte er eine gewaltige Hechtrolle und verschwand hinter
 dem linken Gangabzweig.
  &quot;Oh, eine ERGO V12&quot;, murmelte der Oberst erstaunt.
 Als der Systembeobachter auf eine andere Kamera wechselte, sah
 man den Agenten noch kurz an einer Wand herumnesteln, dann ver-
 schwand das Bild.
  Noch im letzten Augenblick war zu erkennen gewesen, da&szlig; ihm die
 Soldaten von ihrem Standpunkt aus wohl nicht mehr gef&auml;hrlich
 werden konnten.
  &quot;Wirklich clever&quot;, mu&szlig;te Gro&szlig;f&uuml;rst Lnoli anerkennen.
 Hike Hammerhart wu&szlig;te vorher noch nicht, da&szlig; sein Boss derart
 lautstark mit den Z&auml;hnen knirschen konnte.
<HR WIDTH="50%">
</PRE>
<DIV ALIGN=CENTER>Die Fortsetzung erscheint im n&auml;chsten AmZeiger.</DIV>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9712a4.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../amz1297/uhl.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
