<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - MMX: L.A.Confidential</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>L.A.Confidential</U></H1><P ALIGN="CENTER">von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></P>

<B>Rolo Tomasi und die b&ouml;sen Polizisten</B>

<P>Hollywood hat deshalb seinen Namen, was die Filmindustrie betrifft, weil
es der Ursprung vieler gro&szlig;er Klassiker ist. Man meint immer, nur etwas,
das schon einige Jahre von Mund zu Mund geht, k&ouml;nne den Titel Klassiker
tragen - und tats&auml;chlich ist es wohl so, da&szlig; man dies auch erst dann
wirklich mit Gewi&szlig;heit sagen kann.</P>
<P>Wer aber einmal erleben will, wie ein filmischer Klassiker wirkt, wenn
er das erste mal im Kino zu sehen ist, wenn er doch eigentlich nichts
weiter ist, als einer unter vielen, der ist mit <B>L.A.Confidential</B> sicher
gut beraten.</P>
<P>Curtis Hanson, der vor noch gar nicht langer Zeit mit &quot;Am wilden Flu&szlig;&quot;
ein eher unauff&auml;lliges, wenn auch sehr sch&ouml;nes visuelles Ereignis
fabrizierte, hat nun einen Film hervorgebracht, der Hollywood seinem
alten Image wieder ein St&uuml;ckchen n&auml;her bringt.</P>
<P>L.A.Confidential ist jenes alte Hollywood, sowohl in Inhalt, als auch
in Stil und Wirkung. Desweiteren wird er es um mindestens drei noch
nicht ganz so namhafte Schauspieler bereichern, und stellt das sehr
gelungene Comeback Kim Basingers dar.
</P><P>Wie der Name schon sagte, befinden wir uns in L.A. Danny DeVito - in
der Rolle des Verlegers des unter der Hand verteilten Klatsch-Magzins
&quot;Hush-Hush&quot; - f&uuml;hrt uns in das Geschehen ein, macht uns mit den
wichtigsten Rollen vertraut, zu denen er sich auch selbst z&auml;hlen darf,
denn sein Magazin ist neben dem Geld eines der lenkenden Geschicke der
Stadt.</P>
<P>Diese Umst&auml;nde sind aber nur die Basis des Geschehens, nur das Medium, das
das richtige Klima und den N&auml;hrboden f&uuml;r die eigentliche Story bildet und
das die Akteure glaubhaft macht. Es ist das Bild, das man letztendlich hat,
wenn es gelungen ist, die Puzzlesteinchen zusammenzuf&uuml;gen, von denen man
nicht wei&szlig;, welches zu wem pa&szlig;t, an welchen Stellen sie ineinander greifen.</P>
<P>Zu ihnen geh&ouml;ren die drei m&auml;nnlichen Hauptcharakt&auml;re, Ed Exley - der Held,
Stanley(?) Vincennes - der Mitl&auml;ufer und Bud White - der Schl&auml;ger. Aber
diese Klichees werden - so deutlich sie auch zun&auml;chst herausgestellt
werden - schnell zerschlagen.</P>
<P>Ed Exley, der es sich zur Aufgabe macht, gegen die ihn umgebende Korruption
anzuk&auml;mpfen, entpuppt sich als cleverer Bursche der seine Ideale aber
zugunsten seiner Karriere zu umgehen wei&szlig;, Vincennes, der darauf bedacht
ist, sein Leben in Ordnung zu halten, wird sein erster Freund, und der
harte Bud White, der kein Problem damit hat, gegen die Vorschriften zu
versto&szlig;en, um seine Vorstellung von Gerechtigkeit umzusetzen, zeigt sich
in den Armen der sch&ouml;nen Blonden (Kim Basinger) als hilfloser Junge, der
- zusammen mit seiner Mutter - Opfer der Gewaltt&auml;tigkeit seines Vaters
wurde.</P><P>Sie alle suchen einen Mann: Rolo Tomasi, den der keine Spuren hinterl&auml;&szlig;t,
und das macht sie schlie&szlig;lich zu den Helden der Geschichte, sie sind die
Guten oder vielleicht doch nur die weniger b&ouml;sen? James Ellroy, Autor des
Buches, das hier verfilmt wurde, zerbricht das Gut-B&ouml;se-Schema und verh&uuml;llt
seine Figuren hinter einem Schleier der Ungesagten.</P>
<P>Hanson's Leistung aber besteht darin, die verstrickten Beziehungen f&uuml;r die
Leinwand zu konvertieren, was ihm vortrefflich gelungen ist. Das Resultat
erfordert freilich Mitdenken, schon allein aufgrund der vielen Namen, die
fortw&auml;hrend auftauchen und die es den richtigen Gesichtern zuzuordnen gilt.</P>
<P>L.A.Confidential ist die ausgekl&uuml;gelte Konstruktion einer Krimigeschichte,
in der nichts ist, wie es scheint, voller ausgekl&uuml;gelter Dialoge, die sich
genau da in der Schwebe halten, wo sie weder zuviel, noch zuwenig verraten,
unterst&uuml;tzt durch einen wunderbaren Soundtrack, f&uuml;r den niemand geringeres
verantwortlich ist, als Jerry Goldsmith, und verziert mit weichen, warmen
Bildern, die den Zuschauer in das &quot;schimmernde&quot; Hollywood der 50er
versetzen und von denen viele nur im Kopf des Zuschauers entstehen.</P>
<P>Gewi&szlig; lohnt es sich auch, das Buch zu lesen, denn das Bild, das nach dem
Zusammensetzen dieses filmischen Puzzles entsteht, ist so gro&szlig;, da&szlig; man es
entweder nur als ganzes oder einzelne Details, jedoch nicht beides zugleich
erfassen kann.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9712a4.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712gf.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
