<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - MMX: &quot;Come find yourself&quot; / Fun Lovin` Criminals</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>&quot;Come find yourself&quot; / Fun Lovin` Criminals</U></H1><P ALIGN="CENTER">von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></P>
<P>Morgend&auml;mmerung, Nebel. Du f&auml;hrst die Stra&szlig;e runter durch das Ghetto
und schaust nach oben. Von den Gipfeln der H&auml;user, die sich als schwarze
Schatten vor dem eint&ouml;nigen Grau des Himmels abzeichnen, strecken Antennen
ihre F&uuml;hler in die frische Morgenluft. Eine W&auml;scheleine erstreckt sich
diagonal durch Dein Blickfeld, ihr Ursprung verliert sich im Schatten
des H&auml;userblocks, ihr Ende au&szlig;erhalb Deines Blickfelds. Zwei paar an
den Schn&uuml;rsenkeln zusammengeknotete Turnschuhe, baumeln &uuml;ber die Leine
geworfen in der Brise. Und aus Deinem Radio t&ouml;nt der Sound der Fun Lovin'
Criminals: &quot;...come...find yourself&quot;.</P>
<P>So zeichnet es das Backcover des Debut-Albums der New Yorker Gruppierung,
die Kritikern wie H&ouml;rern einen Strich durch die Rechnung macht, wenn sie
versuchen, sie zu kategorisieren.</P>
<P>Cover-Art und Image der Fun Loving Criminals repr&auml;sentieren Gangster-Rap.
Aber hatten wir davon nicht schon genug? Ist diese Schiene nicht etwas
langweilig, ist es nicht immer wieder dasselbe, sprechen nicht gerade die
vielen Cover-Versionen, die die Charts s&auml;umen f&uuml;r die Ideenlosigkeit
dieses Genres?</P>
<P>Genau, dachten sich wohl auch die drei spa&szlig;igen Ganoven und widerstanden
der Versuchung, krampfhaft das b&ouml;se-Jungs-Image rauszukehren und 0815-Rap
zu bieten. Stattdessen machten sie die gro&szlig;artige Entdeckung, da&szlig; Rock
und Rap nicht so weit auseinanderliegen, wie gemeinhin angenommen wird
und verbanden beides mit viel Humor zu einer Musikrichtung, die bis jetzt
nur einen Namen kennt: The Fun Lovin' Criminals.</P>
<P>Einige Tracks, etwa <B>&quot;The Fun Lovin' Criminal&quot;</B> oder <B>&quot;Scooby Snacks&quot;</B>, der
u.a. Samples aus Pulp Fiction enth&auml;lt und auch wunderbar in dessen
Soundtrack gepa&szlig;t h&auml;tte, sind vielleicht bereits ein Begriff, denn seit
die Scheibe CD der Woche beim Sender Fritz war, wurden diese dort auch
h&auml;ufig gespielt.</P>
<P>Aber kommen wir doch endlich zur Musik an sich. W&auml;hrend sich puritanische
Rapper daran st&ouml;ren werden, da&szlig; sie zu rockig ist und ebensolche Rocker
sie als puren Rap verschm&auml;hen werden, wird der vielseitiger interessierte
und f&uuml;r Neues offene H&ouml;rer nichts als Spa&szlig; an dieser haben, denn die
Symbiose aus Rap-Texten, und -Rhythmen und gitarrenlastigen Rock-Melodien
ist abwechslungsreich und geht einfach ins Ohr. Da&szlig; diese Criminals den
Spa&szlig; lieben, kann man dabei leicht nachvollziehen, da sie sich weder in
ihren Texten, noch der Musik zu ernst nehmen, obgleich man freilich auch
zwei, drei Kuschel-Songs unter den 15 Titeln findet.</P>
<P>Mit <B>&quot;Bombin' the L&quot;</B> findet man eine Cover-Version des Deep
Purple-Klassikers &quot;Smoke on the Water&quot; und mit dem leider nur 1:30 langen
letzten Titel <B>&quot;Coney Island Girl&quot;</B> beweisen die FLCs, da&szlig; sie auch
kompromi&szlig;los rocken k&ouml;nnen.</P>
<P>Richtig &quot;fat&quot; wirkt das ganze nie, richtig rockig auch nicht, es hat eben
einfach seinen eigenen ganz besonderen Charme. Den gibt's &uuml;brigens 57
Minuten und 21 Sekunden lang - leider nur mit einem etwas d&uuml;rftigen
Booklet - f&uuml;r &uuml;bliche ca. 30,-DM oder sogar bereits g&uuml;nstiger, da die
Scheibe schon von Ende '96 ist.</P>
<P>&quot;Come find yourself&quot; / Fun Lovin` Criminals, EMI Records 1997</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9712lbf.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712sjt.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
