<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - MMX: &quot;A Little Bit of Fire&quot; / Tower City</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>&quot;A Little Bit of Fire&quot; / Tower City</U></H1><P ALIGN="CENTER">von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></P>

<P>Mir war diese Gruppe vorher kein Begriff und mein Blick fiel auf der
Suche nach einer anderen Gruppe unter `T - Sonstiges` im CD-Gesch&auml;ft,
nur zuf&auml;llig auf diese Scheibe von Tower City.</P>
<P>Das Cover zeigt, &auml;hnlich einem Breitwandfilm, die Wolkenkratzer-Landschaft
einer amerikanischen Gro&szlig;stadt, die in Abendrot getaucht ist.</P>
<P>Es handelt sich um waschechten kraftvollen Rock und mit den ersten
Titeln, unter anderem dem Titelsong <B>&quot;Little Bit of Fire&quot;</B>, geht es
auch schon richtig zur Sache.</P>
<P>Die Gruppe besteht, wie das Booklet informiert, aus nur drei Mann:
Heath Saltis, Hintergrundstimme, Drums und Keyboard-Programmierung;
Larry Saltis, dem S&auml;nger und Guitarristen, sowie T.P.Werner, dem
Bass-Guitarristen, der ebenfalls im Hintergrund singt.</P>
<P>Das ansprechend gestaltete Booklet enth&auml;lt ansonsten leider nur
den Songtext f&uuml;r das Titellied, was schade f&uuml;r Leute mit nur
durchschnittlicher Englischkenntnis ist.</P>
<P>S&auml;nger Larry Saltis Stimme beweist eine gro&szlig;e Bandbreite und
wirkt klar und eindringlich. Trotz der gro&szlig;teils &quot;schweren&quot;
Hintergrundinstrumentierung wird sie nie &uuml;berlagert oder
beeintr&auml;chtigt. Musik und Gesang erg&auml;nzen sich perfekt.</P>
<P>Insgesamt ist die Musik also eher von schnellerer Gangart und bietet
Raum f&uuml;r h&auml;rtere Kl&auml;nge, denen der Gesang die letzte Sch&auml;rfe nimmt.
Das Ganze ist aber immer melodi&ouml;s, die Mehrzahl der Titel hat auch
langsamere, leisere Sequenzen und sie werden nicht langweilig, da
die Refrains sich nicht nur wiederholen, sondern auch variieren
und gelegentlich ein Instrumentalpart eingeschoben wird.</P>
<P>Die Keyboard-Unterst&uuml;tzung und Hintergrundstimmen wurden gekonnt
in die Songs hineingewoben und auch untereinander gleichen sich die
Titel kaum, au&szlig;er nat&uuml;rlich im unverkennbaren Stil der Gruppe.</P>
<P>Mit <B>&quot;I`ll Sleep Tonight&quot;</B> oder <B>&quot;When It All Falls Down&quot;</B> ist auch f&uuml;r
softe Zwischent&ouml;ne gesorgt, solange man `Soft` nicht generell mit
`Langsam` gleichsetzt. Neben diesen Titeln w&auml;ren auch einige andere
radiotauglich, aber das w&auml;re nat&uuml;rlich zuviel verlangt, einmal eine
unbekannte Gruppe zu spielen, nur weil sie `gut` ist. </P>
<P>56:33 Minuten mit 13 Titeln enth&auml;lt die CD, bei einem Preis von
etwa 30 DM.</P>
<P>Wer auf kraftvollen, eindringlichen, aber melodi&ouml;sen Rock steht,
der sollte hier auf jeden Fall einmal probeh&ouml;ren. Es lohnt sich!</P>
<P>&quot;A Little Bit of Fire&quot; / Tower City, MTM Music 1996.
Vertrieb durch Intercord Record Service.</P>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9712fluk.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712cfy.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
