<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - MMX: Paint the Sky with Stars</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>Paint the Sky with Stars - The Best of Enya</U></H1>
<P ALIGN=CENTER>von<BR><A HREF="mailto:a.wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></P>
<P>Als &quot;New Age&quot; und &quot;Weltmusik&quot; vornehmlich &uuml;ber Fernsehwerbespots ihren
Einzug in die Ohren der breiten &Ouml;ffentlichkeit anzutreten begannen,
hatte auch f&uuml;r Enya eine erfolgreiche Zeit begonnen.</P>
<P>Seitdem findet man in den Pop-Bereichen der CD-Abteilungen einen gro&szlig;en
Bereich, der diesen Namen tr&auml;gt und in dem man eine Unmenge verschiedener
Alben findet.</P>
<P>Zu diesen gesellte sich nun j&uuml;ngst ein weiteres dazu, das einen
<B>Querschnitt</B> der bisherigen Erfolge der S&auml;ngerin bietet. Hierbei wurde
ein mittlerweile vielbew&auml;hrtes Konzept zurate gezogen, n&auml;mlich eine
Symbiose aus einer Best-Of-Sammlung und einigen neuen Titeln, in
diesem Fall zwei.</P>
<P>Unter dieser Auswahl von 16 Tracks, die sich &uuml;ber eine Spielzeit
von 57:56 Minuten erstrecken, findet man denn auch die bekannten
&quot;Orinoco Flow&quot;, &quot;Anywhere is&quot; und &quot;Only if...&quot;.</P>
<P>Ann&auml;hernd soundlastig sind auch die anderen Titel der Scheibe, wobei
freilich auch einige besinnlichere unter ihnen sind, jedoch basieren
sie alle auf denselben typischen Synthi-Kl&auml;ngen, die diese Musik
kennzeichnen und sind alle gleichsam durch Enyas Talent gekennzeichnet,
englische Texte so zu vertonen, da&szlig; sie wie Weltmusik klingen.</P>
<P>Durch das permanent hinterlegte Echo und auch die 'versynthesiserte'
Stimme Enyas selbst, strahlen die Titel alle gleicherma&szlig;en ein Gef&uuml;hl
von Weltverbundenheit und Masse aus, das nat&uuml;rlich eine gewisse Kraft
und Weite in sich birgt.</P>
<P>Dies macht die Musik aber fast etwas zu eint&ouml;nig, jedenfalls mir etwas
zu Mainstream-orientiert. Die Zielgruppe dieser Musik sind sicher Fans
solcher Songs wie &quot;Conquest of Paradise&quot; oder &quot;Time to say goodbye&quot;
und d&uuml;rfte bei solchen auch guten Anklang finden.</P>
<P>Dazu kann ein in pastellenen T&ouml;nen kunstvoll gestaltetes Booklet, das
mit einigen kleinen Bildchen angereichert ist, allerdings keine Songtexte
beinhaltet, einiges beisteuern. Passend zum Titel sind denn auch Farbt&ouml;pfe
mit 'Sternenmalfarbe' und Pinsel integrativer Bestandteil des CoverArts,
etwas platt - aber sicher wirksam. Das Booklet ist auf qualitativ
hochwertigem Papier gedruckt, muffelt ein wenig nach Druckerfarbe
und liegt in einem transparenten Plastcover.</P>
<B>Quintessenz:</B>
<P>Zum Preis von etwa 30,- DM erh&auml;lt man ein nettes Best-Of-Album, das
&quot;Weltmusik&quot; und &quot;New Age&quot; zu &quot;Pop&quot; b&uuml;ndelt und deshalb puritanischen
Fans dieser Richtungen zu aufgebauscht sein k&ouml;nnte, jedoch ein Publikum
seichten entspannten Pops ansprechen d&uuml;rfte. Dar&uuml;ber hinaus stellt diese
CD eine generationen&uuml;bergreifende Alternative zur traditionellen
musikalischen Untermahlung des Weihnachtsabends dar.</P>
<P>&quot;Paint the Sky with Stars - The Best of Enya&quot;, Warner Music UK Ltd. 1997</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT"><A HREF="9712mmx.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712fluk.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
