<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - MMX: &quot;Alien - Die Wiedergeburt&quot;</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>&quot;Alien - Die Wiedergeburt&quot;</U></H1><P ALIGN="CENTER">von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></P>

<B>Der Mythos bekommt Risse.</B>

<P>Bekanntlich ist es ein schweres Unterfangen, einem guten Film eine
Fortsetzung zur Seite zu stellen, die nicht vor dem Original verbla&szlig;t.
Noch schwerer wird es, ein solches Duo zu einer Trilogie zur erg&auml;nzen.</P>
<P>An der Frage, ob diese dritte Fortsetzung bei der Alien-Saga gelungen
ist, scheiden sich bekanntlich die Geister. Mir pers&ouml;nlich gefiel der
dritte sogar am besten.</P>
<P>Und nun ist nach langem Warten mit gemischten Gef&uuml;hlen der vierte Teil
dieser SciFi-Fantasy-Horror-Opera in den Kinos zu bewundern. Ist die
Fortsetzung nun also diesen Titel wert? Oder ereilt die Alien-Story
dasselbe Schicksal wie das StarTrek-Universum?</P>
<P>Zun&auml;chst einmal beginnt <B>Die Wiedergeburt</B> n&uuml;chterner, weniger spacig und
weniger mystisch und das l&auml;&szlig;t bereits erahnen, wohin sich dieser Film
entwickelt hat. W&auml;hrend der dritte Teil sich zwar von den ersten beiden
durch seine Machart klar abhebt, so baut er doch konsequent auf dem
bereits gesehenen auf.</P>
<P>Nummer 4 geht mehr den Weg aller SciFi-Streifen unserer Zeit, zur&uuml;ck zu
einem breiteren Publikum, wieder ein St&uuml;ck heraus aus der dunklen Tiefe
der fiktiven Welten ferner Zeiten. Beim breiten Publikum findet man denn
auch immer mit etwas Humor Anklang und obgleich der Film im Vergleich zu
anderen gegenw&auml;rtigen Produktionen des Genres noch recht ernst ist, ist
er f&uuml;r die Alien-Saga leider viel zu humor&ouml;s.</P>
<P>Vom ersten Teil an ist eine klare Linie in der Serie zu beobachten, die
sich dadurch kennzeichnet, da&szlig; die Figuren, die sich um Lt. Ripley
scharen, von Film zu Film skurriler werden und die Szenen ekliger.</P>
<P>Erst war es die Crew eines Frachters, dann eine S&ouml;ldnertruppe, drittens
ein paar H&auml;ftlinge. Nun handelt es sich um eine H&auml;ndlertruppe, die sich
die Position vor der Kunkurrenz durch illegale Gesch&auml;fte sichert.</P>
<P>Die Gesichter dieser Truppe kommen einem sofort vertraut vor, nicht
nur das Winona Ryders, das einen h&uuml;bschen Gegensatz zu der Auslese an
ber&uuml;hmten H&auml;&szlig;lichen bildet, wie &quot;den Gl&ouml;ckner von Notre Dame&quot; oder
&quot;Vincent&quot;, das bekannte Beast. Den alten bekannten Bischop trifft
man nicht wieder, aber das soll nicht hei&szlig;en, da&szlig; nicht wieder ein
Android von der Partie w&auml;re.</P>
<P>Dieser ist aber nicht Ripley selbst, wie unter anderem gemutma&szlig;t wurde,
viel eher trifft die Spekulation zu, da&szlig; ein Klon das Original ersetzt.
Es ist sogar gelungen, diese Wiedergeburt so in die Story einzubinden,
da&szlig; sie nicht zu hingebogen wirkt, zumal die neue Ripley sich dank einer
netten storytragenden Idee wesentlich von ihrem Vorg&auml;nger unterscheidet.</P>
<P>Wo wir schon bei den Ideen sind, wird es Zeit, etwas darauf einzugehen.
Tats&auml;chlich ist Alien 4 eine Fortsetzung, kein Plagiat. Es wurden viele
neue Gedanken eingebracht, der Faden der Saga wurde weitergef&uuml;hrt und
dank vieler gut umgesetzter Ideen ist es nie langweilig.</P>
<P>Leider jedoch ist der Film gerade zu Beginn mit etwas st&ouml;renden Rollen
gespickt, wie einem etwas bl&ouml;deligen General, der nicht in einen solchen
Film geh&ouml;rt h&auml;tte und somit auch gl&uuml;cklicherweise eines der ersten Opfer
wird. Durch dieses fr&uuml;he Ausscheiden auch der anderen st&ouml;renden Figuren
kann der Streifen nach einigen Minuten endlich ann&auml;hernd das erwartete
Niveau finden und somit den Zuschauer fesseln.</P>
<P>Leider jedoch ist der &uuml;bertriebe Humor nicht das einzige Manko, hinzu
kommt eine unn&ouml;tige Betonung ekliger Aufnahmen ohne Bedeutung, wie das
Zeigen von f&uuml;nf bis sechs &quot;aufgebrauchten&quot; Wirten, wo auch einer gen&uuml;gt
h&auml;tte oder die alberne Todesszene des Generals, in der er sich noch
einen Fetzen seines Gehirns betrachtet, nachdem eines der Beaster ihn
von hinten &quot;angebohrt&quot; hat.</P>
<P>Letzter Kritikpunkt ist die Vergewaltigung der sonst so gutaussehenden
Alien-Queen durch eine biologische &Auml;nderung, auf die ich hier nicht
eingehen m&ouml;chte, weil sonst zuviel verraten w&auml;re, und das etwas
mi&szlig;lungene Design einer neuen Alien-Art, &uuml;ber die ich mich aber
auch nicht n&auml;her &auml;u&szlig;ere.</P>
<P>Technisch ist bei Alien-IV alles in Ordnung, die SpecialEffects sind
von gewohnter G&uuml;te, die Musik ist zwar nicht mehr ganz so d&uuml;ster, aber
immer noch passend und gut und die Regie Jean-Pierre Jeunet's trifft
auch die gew&uuml;nschte Wirkung.</P><P>
Alles in allem ist zu bedauern, da&szlig; die Alien-Saga mit dieser Erweiterung
einen Teil ihrer Mystik verliert, eine weitere Fortsetzung wurde erschwert,
obgleich der Schlu&szlig; kein guter Schlu&szlig; f&uuml;r das Gesamtwerk war und somit
eine solche eher heraufbeschw&ouml;rt.</P><P>
Ansonsten l&auml;&szlig;t der Film aber das Gesamtwerk nicht zusammenbrechen, wenn
er ihm auch einen drastsichen Wandel gibt. Auf alle F&auml;lle ist er einer
der besseren dieser Tage und im Vergleich zu anderen SciFi's liegt er
weit mehr in einer Richtung, durch die dieses Genre einmal seine Fans
gefunden hat.</P><P>Im Vergleich zu den anderen Alien-Teilen ist er sicher der schlechteste,
aber die Kluft ist nicht so gro&szlig;, wie es zu bef&uuml;rchten war.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9712sjt.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712lac.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
