<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - MMX: &quot;Risotto&quot; / Fluke</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>&quot;Risotto&quot; / Fluke</U></H1><P ALIGN="CENTER">von<BR><A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></P>
<BLOCKQUOTE>&quot;Fluke/DR: would like to thank Kitchenaid for kindly letting us borrow
 the beautiful chrome mixer.&quot;</BLOCKQUOTE>

<P>Diesen kleinen Kommentar findet man auf Seite 11 des Booklets zum Album
&quot;Risotto&quot;. Dieser Mixer schm&uuml;ckt mehr als die H&auml;lfte der Seiten der
Cover-Artwork, fotografiert in faszinierenden Detail-Perspektiven, in
denen man ihn kaum als einen solchen auszumachen imstande ist.</P>
<P>Der Rest des Booklets ist wie eine Bedienungsanleitung gehalten, in
die alle Informationen &uuml;ber die CD, sowie die sp&auml;rlichen Songtexte
eingekleidet wurden.</P>
<P>Aber zur&uuml;ck zu unserm Mixer. Passender h&auml;tte man das Cover wohl
nicht verzieren k&ouml;nnen, denn die optische Wirkung dieses Mixers ist
die akustische der Musik. Die zugleich typischen weich ineinander
&uuml;berlaufenden und sich doch klar voneinander abgrenzenden Reflexionen
auf den flie&szlig;end abgerundeten robusten Formen des Mixers wirken ebenso
fl&uuml;ssig und verraten doch so viel von der inneren Kraft des dahinter
verborgenen Materials, wie man sie auch in der Musik wiederfindet,
die sich auf der Scheibe befindet.</P>
<P>Am kennzeichnendsten f&uuml;r diese ist jedoch der Aufdruck auf dem Mixer:
Ultra Power.</P>
<P>Wer die Titel &quot;Absurd&quot; und &quot;Atom Bomb&quot; kennt, die bereits bei dem einen
oder anderen Radiosender zu h&ouml;ren waren und auch in der MTV-Titelrotation
bereits ihren Sitz hatten/haben, wei&szlig;, wovon ich spreche.</P>
<P>Irgendwo zwischen Orbital, Apollo 440, Yello, Underworld und den Chemical
Brothers scheinen Fluke die reine Energie gefunden und auf CD gepre&szlig;t zu
haben.</P>
<P>Dabei handelt es sich freilich keineswegs um fein geordnete Basslinien,
ideenloses Drauflosgedrumme oder monotones Krawalleinerlei. Viel eher
purzeln die Samples aus den Boxen, allerdings in solcher Dichte und
unerfa&szlig;bar &uuml;berlagerter Folge, da&szlig; der Geist g&auml;nzlich &uuml;berfordert ist
und dem K&ouml;rper das Steuer in die Hand dr&uuml;ckt.</P>
<P>Somit bleibt dem H&ouml;rer denn ab einem gewissen Lautst&auml;rkepegel auch nichts
anderes mehr &uuml;brig, als die auf ihn einprasselnde musikalische Energie
in kinetische zu wandeln, um sie als W&auml;rme abzuleiten.</P>
<P>Aber Fluke best&auml;tigen nicht die im CD-Gesch&auml;ft ja doch etwas verbreitete
Regel, da&szlig; Qualit&auml;t Quantit&auml;t ausschlie&szlig;t bzw. umgekehrt. Mit satten
73 Minuten, 28 Sekunden Spielzeit (von max. 74min!!), die sich &uuml;ber zehn
Titel erstrecken, ist der Silberling so vollgepropft, da&szlig; &auml;ltere billige
CD-Player die Annahme g&auml;nzlich verweigern.</P>
<P>Wer noch einen Mixer sucht, sollte beim Haushaltsger&auml;tehandel nachfragen,
wer &uuml;bersch&uuml;ssige Energie verbrennen will: Bittesch&ouml;n, hier ist Fluke,
zu haben seit 23.09.97 f&uuml;r &uuml;bliche 30,-DM &uuml;berall wo's CDs gibt.
</P>&quot;Risotto&quot; / Fluke, Virgin Records Ltd. 1997

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9712pss.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712lbf.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
