<html>
<head>
<!-- "author" content="Wolf Zimmer"     -->
<title>EMail-Knigge</title>
</head>
<body background="wolf1.gif" text=black link=blue vlink=blue bgcolor=gray>
<a href="onl_email00.html#inh"> zum Inhaltsverzeichnis </a>
<br>
<h2>Anreden, Abschl&uuml;sse und Unterschriften</h2>

<hr>

<p>Jedes Medium hat seine eigenen Floskeln zur Anrede und Verabschiedung.
Telefonate beginnen h&auml;ufig mit &quot;Hallo&quot; und enden (zumindest
in Norddeutschland) mit &quot;Tsch&uuml;ss&quot;. &Auml;hnliches gibt es
bei Briefen. Weil Email aber recht neu ist, gibt es solche
&quot;Regeln&quot; noch nicht. Viele unterlassen es daher eine Anrede oder
eine Unterschrift zu schreiben, zumal die Nachricht viele dieser
Informationen (z.B. Absender) enth&auml;lt.</p>

<p>Doch vielleicht reichen diese Informationen nicht aus oder es wird nicht
klar, warum man diese Email &uuml;berhaupt bekommt. Sie sollten also
&uuml;berlegen, was Sie &uuml;bermitteln wollen. Dabei m&uuml;ssen sie
nat&uuml;rlich die Gewohnheiten und die Kultur aller Beteiligten in
Erw&auml;gung ziehen.</p>

<h3>Anreden und Abschl&uuml;&szlig;e</h3>
<h4>Anreden</h4>

<p>Anreden sind besonders schwierig. Oft wei&szlig; man nicht, ob die
Person, der man schreibt, ein Mann oder eine Frau ist und in manchen
Kulturen steht z.b. der Nachname an erster Stelle, in anderen an letzter.
Gewisse Begr&uuml;&szlig;ungsformel (wie z.B. Sehr geehrter ...) sind
abh&auml;ngig vom Alter und Status des Empf&auml;ngers. Es ist also
durchaus schwierig, die richtigen Worte zu finden.</p>

<p>In den Vereinigten Staaten schreibt man z.B. in der Regel nicht Mister
oder Sir, es sei denn, man ist absolut sicher, da&szlig; es sich um einen
Mann handelt. &Auml;hnlich ist es bei der Verwendung von Mrs. (dt.: Frau)
und Mi&szlig; (dt.: Fr&auml;ulein), wobei in Deutschland in der Regel die
Anrede &quot;Frau&quot; verwendet wird. In den USA verwendet man in Emails
&uuml;blicherweise den Vornamen in Kombination mit &quot;dear&quot;
(liebe/r)</p>

<p><tt>Lieber Chris:</tt></p>

<p>Passen Sie aber bei der Verwendung von Kurzformen oder Spitznamen auf
-so gibt es Stefanies, die auf Steffi fa&szlig;t allergisch reagieren. Wenn
Sie eine Gruppe von Leuten ansprechen m&ouml;chten, k&ouml;nnen Sie
&quot;Liebe&quot; und das entsprechende Attribut verwenden. Z.B.:</p>

<p><tt>Liebe ProjektManager:</tt></p>

<p>Wenn die Email eher formlos sein soll und Sie vielleicht sogar einen
h&ouml;heren Status als der Empf&auml;nger<br> haben, reicht oft ein
einfaches &quot;Hallo&quot;:</p>

<p><tt>Hallo - ich habe heute Ihre Web-Seite gesehen und wollte Ihnen nur
kurz mitteilen, da&szlig; ich die kalte Kernfusion am 29. Februar 2403
entdeckt habe, *nicht* am 29. Februar 2402.</tt></p>

<p>F&uuml;r Leute, die ich schon kenne, verwende ich auch oft ein nur ein
einfaches &quot;Hallo&quot;:</p>

<p><tt>Hallo - m&ouml;chtest Du morgen mit mir Essen gehen? Ich k&ouml;nnte
dann meine Urlaubsfotos mitbringen und Dich zu Tode langweilen.</tt></p>

<p>&quot;Guten Morgen&quot; oder &quot;Guten Abend&quot; sind f&uuml;r
Emails nicht geeignet, da es einige Zeit vergehen kann, bis der
Empf&auml;nger seine Emails liest. In Deutschland sollte man mit solchen
Anreden noch wesentlich vorsichtiger sein: bew&auml;hrt hat sich als
Kompromi&szlig; die Anrede &quot;Guten Tag&quot;.</p>

<h3>Informationen</h3>

<p>Wenn ich Emails von Fremden bekomme, interessiere ich mich sehr
daf&uuml;r, in welcher Verbindung ich zu ihnen stehe. Wenn Sie also Emails
versenden, besonders an jemanden, der Sie nicht kennt, ist es besser, wenn
Sie gleich diese Fragen beantworten:
<ul>
<li>Wie erfuhren Sie von ihr/ihm?
<li>Was m&ouml;chten Sie von ihr/ihm?
<li>Wer sind Sie?
<li>Warum sollte Ihr Korrespondent Ihnen antworten? (wenn Sie nicht diese Frage
beantworten k&ouml;nnen, sollten Sie sich fragen, warum Sie diese Email
&uuml;berhaupt absenden) </ul></p>

<p>Es ist besser, diese Informationen ans Ende zu setzen, als sie gar nicht
zu beantworten. Es gibt aber gute Gr&uuml;nde diese Informationen an den Anfang
zu stellen: <ul>
<li>Wenn es ein Problem mit der &Uuml;bertragung gibt, ist es
wahrscheinlicher, da&szlig; das Ende verloren geht.
<li>Viele Leute erhalten mehr als zwanzig Mails pro Tag und lesen sie daher
sehr schnell. Solche Menschen neigen oft dazu Emails zu l&ouml;schen, deren
Bedeutung ihnen nicht klar ist.
<li>Ihre Identit&auml;t ist ein wichtiger Anhaltspunkt zum Kontext der
Meldung.
</ul></p>

<p>Gute Antworten zu den Fragen k&ouml;nnen z.B. so aussehen:</p>

<p><tt>Liebe Ms Sherwood: Ich bin Inhaber eines gro&szlig;en Verlagen. Ihr
Ehemann erz&auml;hlte mir letzte Woche, da&szlig; Sie daran interessiert
sind, ein Buch zu ver&ouml;ffentlichen, das auf Ihrem
&quot;Email-Guide&quot; basiert. Da mir dieser Guide sehr gut gefallen hat,
w&uuml;rde ich mich gern mit Ihnen treffen. </tt></p>

<p>Einige gute Freunde von mir erhielten vor kurzem zum ersten Mal eine
Email von meinem Vetter. Leider gab es Probleme bei der &Uuml;bermittlung
und sie erhielten nur folgende Nachricht:</p>

<p><tt>Liebe Rich und Chris: Ich traf Euch bei Jim und auf Duckys Hochzeit.
</tt></p>

<p>Sie wu&szlig;ten nicht gleich, wer er war, aber da er Ihnen mitteilte,
woher er sie kannte, interessierten sie sich f&uuml;r die Email. Sie
antworteten und seither klappt die Kommunikation tadelos.</p>

<h3>Unterschriften (Signaturen)</h3>

<p>Bei vielen Email-Programmen kann man eine sogenannte Signatur eingeben,
d.h. am Ende jeder Email steht ein bestimmter, vorgegebener Text am Ende.
Viele nutzen diese Signaturen, um auf einfach Art und Weise Adressen u.a.
mitzuteilen, z.B.:</p>

<p><tt>Hallo - wollen wir heute zum Essen gehen?</tt></p>

<p><tt>Rebecca P. Snodwhist</tt></p>

<p><tt>Rebecca P. Snodwhistle<br>
Fraunheimer Maschinenfabriken GmbH<br>
Rothenbaumchaussee 76a<br>
20148 Hamburg<br>
Telefon: O40 - 12 34 56 78<br>
FAX:  O40 - 12 34 56  79 <br>
snodwhistle@fraunheimer.de <br>
Wbecca@arcor.net (privat)</tt></p>

<p>Soviele Informationen zu so einer kurzen Fragen scheinen mir
&uuml;bertrieben. Viele der oben genannten Informationen sind f&uuml;r
diesen Fall einfach &uuml;berfl&uuml;ssig. </p>

<p>Da Sie diese Frage als Email erhielten, k&ouml;nnen Sie auch per Email
antworten - Sie brauchen also die Informationen &uuml;ber FAX oder die
genaue Adresse nicht. Auch eine weitere Email-Adresse brauchen Sie sicher
nicht - Sie haben ja schon eine! In der Regel reicht der Name aus,
insbesondere, wenn: <ul>

<li>Ihre Emails in der &quot;Von:&quot;-Zeile nicht Ihren vollen Namen
enthalten (schicken Sie sich einfach selbst eine Mail, dann werden Sie es
sehen - oder nicht. Anm. d. &Uuml;.: Meine Email-Adresse ist:
fe7y008@public.uni-hamburg.de)

<li>In der &quot;Von:&quot;-Zeile nicht der Name steht, den Sie wirklich
bevorzugen, z.B. weil Ihre Firma auf die Verwendung des vollst&auml;ndigen
Namens besteht - ohne Spitznamen etc.

<li>Sie teilen Ihr Email-Konto mit anderen Leuten (z.B. Familienangeh&ouml;rigen)
</ul></p>

<p>Die Telefonnummer kann dagegen durchaus zu einer Signatur geh&ouml;ren -
wenn Sie tats&auml;chlich wollen, da&szlig; man Sie anruft.</p>

<p>Wenn die Email-Nachricht in einer Verbindung zu Ihrer
Berufst&auml;tigkeit steht, ist es vern&uuml;nftig, den Namen der Firma in
die Signatur zu setzen. Eine Sache, die ich in diesem Zusammenhang gerne
wissen m&ouml;chte (und die oben bei Rebecca fehlt), ist die Position, die
man in der Firma einnimmt. Ist Rebecca nun Raumpflegerin oder Direktorin
der Firma? Dies kann f&uuml;r den Erfolg der Anfrage durchaus wichtig sein.
Aufgrund dieser &Uuml;berlegungen schlage ich Rebecca also folgende
Signatur vor:</p>

<p><tt>Generaldirektor Rebecca P. Snodwhistle, <br>
Fraunheimer Maschinenfabriken GmbH<br>
Telefon: O40 - 12 34 56 78</tt></p>

<p>Sicher ist diese Signatur in diesem Fall (Wollen wir essen?) immer noch
etwas &uuml;bertrieben. Aber in der Regel ist es umst&auml;ndlicher, immer
wieder die Signatur ein-und auszustellen.</p>

<p>Einige setzen Signaturen ein, um kleine Zeichnungen oder witzige
Sinnspr&uuml;che zu vermitteln. Dies ist durchaus angemessen - aber
&uuml;bertreiben Sie es nicht! Eine gute Regel ist es, da&szlig; die
Signatur nicht l&auml;nger als 5 Zeilen sein sollte.</p>

<p>Nachdem man einmal eine Signatur eingerichtet hat, vergi&szlig;t man Sie
h&auml;ufig - manche Emailprogramme zeigen Sie auch nicht explizit an,
sondern setzen sie automatisch an das Ende der Email. Daher sollten Sie die
Signaturen regelm&auml;&szlig;ig auf die Aktualit&auml;t
&uuml;berpr&uuml;fen. Dies gilt auch f&uuml;r kleine Witze etc. - wenn man
sie zum 5. Mal liest, verlieren sie doch gewaltig. </p>

<p>Noch eine Schlu&szlig;bemerkung &uuml;ber Signaturen. Sie dienen auch
dazu, dem Empf&auml;nger mitzuteilen, da&szlig; die Email vollst&auml;ndig
angekommen ist.</p>

<h3>Trennzeichen</h3>

<p>Einige setzen kleine Bindestrich-Zeilen vor und nach die eigentliche
Signatur, z.B. </p>

<p><tt>---------<br>
Generaldirektor Rebecca P. Snodwhistle, <br>
Fraunheimer Maschinenfabriken GmbH<br>
Telefon: O40 - 12 34 56 78<br>
---------</tt></p>

<p>Kaitlin Sherwood schreibt dazu im englischen Original: Dies sieht sicher
sehr sch&ouml;n aus, ist aber nicht n&ouml;tig.</p>

<p>Dies ist so nicht (ganz) korrekt:</p>

<p> Wenn man bei einigen Email-Programmen die Antwort- oder Reply-Taste
benutzt, wird der gesamte Text der eingegangenen Email in die Antwort
kopiert, versehen mit einem Zitatzeichen (siehe Abschnitt <a
href="onl_email01.html">Zusammenhang</a>). Um keinen
&uuml;berfl&uuml;ssigen Text zu kopieren, werden zwei Gedankenstriche und
ein darauf folgendes Leerzeichen (-- ) als "Standard-Signaturkennung"
vereinbart und alles, was danach kommt, nicht mehr kopiert, da die Signatur
in der Regel nicht relevant f&uuml;r den Inhalt ist. (Einen Dank f&uuml;r
entsprechende Hinweise an Klaus Arnhold, Martin Schmitt und Matthias
Firner!)</p>

<hr>

<h3>Zusammenfassung</h3>

<p>Wenn Sie den Empf&auml;nger der Email kennen, werden Sie die hier
geschilderten Probleme wahrscheinlich nicht haben. Wenn Sie aber jemandem
schreiben, den Sie nicht kennen, sollten Sie ihm/ihr m&ouml;glichst viele
Informationen &uuml;ber sich zukommen lassen, insbesondere wer Sie sind,
warum Sie schreiben und warum er/sie Ihnen antworten sollte. Diese
Informationen sollten am Anfang einer Email stehen.</p>

<p>Anreden und Abschl&uuml;&szlig;e sind &auml;u&szlig;erst schwierig -
hier sollten Sie versuchen, auf die Kultur des Empf&auml;ngers einzugehen.
Im Zweifel ist es besser, vorsichtig zu sein.</p>

<hr>

<p>Weiter zum Thema <a href="onl_email09.html">Zusammenfassung</a><br>
zur&uuml;ck zum Thema <a href="onl_email07.html">Konventionen</a><br>
zur&uuml;ck zum <a href="onl_email00.html#inh"> Inhaltsverzeichnis </a></p>

<hr>

<p>Bitte beachten Sie die <a href="onl_email00.html#Copyright">Copyright-Information</a>. </p>

<p>&nbsp;
</body>
</html>
