<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Etusivu</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<img src="kuvat/thoriel.jpg" width="187" height="193" alt="Anu" border="1"></center>
						<div align="left">
							<p>Kahdessa vuorokaudessa pakettiauton matkamittariin 1579 kilometri&auml;, tien p&auml;&auml;ll&auml; 17 tuntia, 17 minuuttia ja 43 sekuntia. Mihin ihmeeseen? Yhdistyksen vuosikokoukseen Espooseen t&auml;&auml;lt&auml; susirajalta, jossa j&auml;&auml;karhut loikkivat pihalla ja poroja pit&auml;&auml; h&auml;tist&auml;&auml; parvekkeelta jatkuvasti. Kannattiko? Kyll&auml;!</p>
							<p>Vapaaehtoinen yhdistystoiminta on siit&auml; j&auml;nn&auml; juttu, ettei t&auml;ss&auml; koskaan saataisi mit&auml;&auml;n aikaan, ellei porukasta l&ouml;ytyisi yhteishenke&auml;. &quot;Etel&auml;n hetelm&auml;t&quot; j&auml;rjestiv&auml;t mm. kokouspaikan ja sen kunnostuksen kokousta varten, demokoneen, Internet-yhteyden, virvokkeet ja pikkunaposteltavat sek&auml; Amiga-aiheista luettavaa. Pohjoisen iskuryhm&auml;mme postitti vuosikokouskutsut, toi SDK-demokoneelle monitorin, n&auml;ppiksen ja hiiren, toimitti web-kameran ja SDK:n hyviss&auml; ajoin testattavaksi ja asennettavaksi, raahasi paikalle valokuvaustarpeet, jatkojohtoja, varakylmi&ouml;n, p&auml;&auml;toimittajan, sihteerin, kaksi &quot;varaorjaa&quot;, esitteit&auml;, AmigActive-vuosikerran, k&auml;nnykk&auml;kuoret, lis&auml;&auml; esitteit&auml;, sinitarraa ynn&auml; muuta, ja matkan varrelta kaapattiin viel&auml; Gentle Eyen Boogie mukaan. Ja hauskaa oli.</p>
							<p>Oma Amigani n&auml;ytt&auml;&auml; selv&auml;sti k&auml;yv&auml;n viimeisi&auml; tahteja yht&auml; matkaa t&auml;h&auml;n numeroon p&auml;&auml;ttyv&auml;n levyke-Sakun kanssa. Mit&auml; l&auml;hemp&auml;n&auml; viimeinen numero on, sit&auml; sekop&auml;isemm&auml;ksi kone on muuttunut. Tied&auml;n, sieluton konehan se on noin raadollisesti ajatellen, mutta ihmeesti sen viime aikojen tempaukset ovat osuneet juuri lehden julkaisup&auml;ivien alle. T&auml;ll&auml; hetkell&auml; tilanne on se, ett&auml; viimeisen levykelehden julkaisu on pakko siirt&auml;&auml; maanantaiksi, sill&auml; haluan viimeistell&auml; viimeisen levykelehden asianmukaisesti. Nyt siihen ei ole ollut kunnollista mahdollisuutta, kun aikaa on tuhlaantunut koneen oireiden paranteluun - levykelehden viimeistely kun on sattuneesta syyst&auml; teht&auml;v&auml; Amigalla... Osittain samasta syyst&auml; t&auml;h&auml;n lehteen tarkoitettu eurooppalaisten amigistien yhteishaastattelu siirtyy julkaistavaksi seuraavassa numerossa.</p>
							<p>Kun viimeinen levykelehti maanantaina valmistuu, siirr&auml;n samalla Amigani telakalle. En el&auml;kkeelle, vaan perusteelliseen remonttiin. Koneessa on ollut sama k&auml;ytt&ouml;j&auml;rjestelm&auml;pohja jo varmaan viiden vuoden ajan, mit&auml; nyt p&auml;ivitys 3.5:een tuli tehty&auml; siin&auml; v&auml;liss&auml;. Laitteistopuolellakin vikaa saattaa olla, onhan kone jo 10 vuotta vanha sotaratsu. N&auml;iden p&auml;ivien aikana olen joutunut istumaan PC:n &auml;&auml;ress&auml; aamusta iltaan, kun Amiga on ollut &quot;sairaslomalla&quot;. Totesin, ett&auml; yh&auml; vain kaipaan Amigan &auml;&auml;reen, ei minusta n&auml;in helpolla viel&auml; amigismi l&auml;hde...</p>
							<p>Voisin remontoida hieman itse&auml;ni samalla, noin henkisesti ainakin. Saku-urani aikana ei el&auml;m&auml; ole siin&auml; sivussa minua mitenk&auml;&auml;n silkkihansikkain pidellyt, vaan kuhmuja ja kuperkeikkoja on riitt&auml;nyt. Nyt voisi olla hyv&auml; nollata tilanne kaikin puolin ja l&auml;hte&auml; sitten uusin voimin jatkamaan urakkaa. Ainakin sit&auml; kannattaa yritt&auml;&auml;.</p>
							<p>&quot;Three years are long, three times too long<br>
							Too lengthy the delay&quot;<br>
							And then I answered in my song<br>
							&quot;Hope wastes them quick away<br>
							Where love is fervent, fain and fast<br>
							And knoweth not decay<br>
							There nimbly fleet the seasons past<br>
							Accounted as one day.&quot;</p>
							<p>- Clannad: By Chance it Was</div>
					</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
