<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Etusivu</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt; </font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<img src="kuvat/janne.jpg" width="150" height="150" alt="Janne" border="1"></center>
						<div align="left">
							<p>Tervehdys, Sakun lukijat!</p>
							<p>Katselin monen muun tavoin olympialaisten aikaan MTV3-kanavalla py&ouml;rinytt&auml; Bond-leffaputkea. Oli sangen ilahduttavaa n&auml;hd&auml; kymmenien vuosien elokuvakehitys kiteytettyn&auml; parin viikon telkkarisarjaksi. Vaikka Bondeista Moore ja Brosnan ovat tyylilt&auml;&auml;n ehk&auml; eniten mieleeni, yksi erityisesti ajatuksia her&auml;tt&auml;nyt yksityiskohta oli Sean Conneryn p&auml;tkitt&auml;inen ura Bondina.</p>
							<p>T&auml;m&auml; legendaarinen alkuper&auml;is-Bondhan kielt&auml;ytyi jatkamasta elokuvan El&auml;t vain kahdesti j&auml;lkeen. V&auml;liss&auml; ristiriitaisia arvioita saanut Lazemby hurjasteli yhden p&auml;tk&auml;n verran, kunnes Connery palasi kuvioihin viel&auml; kerran, takuulla viimeisen kerran elokuvaan Timantit ovat ikuisia. Kun sitten 80-luvun alussa pistettiin varjo-Bondia kasaan, niin kukas muu kuin Sean Connery palasi rooliinsa 13 vuoden tauon j&auml;lkeen elokuvassa, jonka englanninkielinen nimi kuvastaa tilanteen ironiaa suomennostaan paremmin: Never Say Never Again eli suunnilleen &quot;&auml;l&auml; koskaan en&auml;&auml; sano ei koskaan&quot;.</p>
							<p>Maailmasta l&ouml;ytyisi varmasti parempiakin esimerkkej&auml; t&auml;st&auml; omituisesta kiertokulusta, mutta tuo ajankohtaisena kiinnitti j&auml;lleen kerran huomioni my&ouml;s t&auml;h&auml;n eriskummalliseen juoksupy&ouml;r&auml;&auml;n, jota Amigaksi kutsutaan.</p>
							<p>Vuoden 1993 j&auml;lkeen on Amigan pelastajaksi uumoiltu milloin Commodoren AAA:ta, Escomin Walkeria, Power Amigaa, VIScorpin h&auml;rveleit&auml;, BoXeRia, Gatewayn MCC:t&auml; jne. Commodoren konkurssin j&auml;lkeen ostin PC:n ja sanoin itselleni ett&auml; se siit&auml;. Jokin kuitenkin houkutteli mukanaan ja sai uskomaan kun Escom osti Amigan. Laajentelin Amigaa ja pysyin mukana kuvioissa. Kun Escom meni konkurssiin, se oli taas - se siit&auml;. Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:kin otti n&auml;ihin aikoihin pahasti takkiinsa.</p>
							<p>Kun Gateway osti Amigan, n&auml;ytti oikeasti hetken aikaa hyv&auml;lt&auml; ja Jim Collasin my&ouml;t&auml; viel&auml;kin paremmalta. Itse asiassa asiat n&auml;yttiv&auml;t niin hyv&auml;lt&auml; ett&auml; varovaisemmaksi muuttuneesta asenteestani huolimatta taisin jopa uskoa ett&auml; jotain hyv&auml;&auml; t&auml;st&auml;kin seuraa. Kun sitten Collas l&auml;hti ja suunnitelmat Amigan suhteen heitettiin romukoppaan, j&auml;i k&auml;teen OS 3.5 ja viimeinkin olin hiljalleen valmis allekirjoittamaan monelta suunnalta tulleet kommentit: &quot;Amiga on sitten viimeinkin kuollut lopullisesti&quot;.</p>
							<p>Samalla varmistuin p&auml;&auml;t&ouml;ksest&auml;ni vet&auml;yty&auml; Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n toiminnasta. Tuo p&auml;&auml;t&ouml;s oli tehty ennen viime syksyn dramaattisia tapahtumia, mutta tunne &quot;ei en&auml;&auml; koskaan&quot; sai niist&auml; roimasti lis&auml;puhtia.</p>
							<p>Vaan eik&ouml;s se py&ouml;r&auml; l&auml;htenyt py&ouml;rim&auml;&auml;n taas vuosituhannenvaihteen j&auml;lkeen. Joukko entisi&auml; Gatewayn ty&ouml;ntekij&ouml;it&auml; osti Amigan ja alkoivat pystytt&auml;m&auml;&auml;n p&auml;&auml;omasijoittajien rahoilla uutta Amiga-firmaa. Sekavasta alusta huolimatta uusin luku Amigan historiassa on salakavalasti onnistunut j&auml;lleen kerran ujuttautumaan jollain tasolla ihon alle ja alkanut kutittamaan. Seuraavan sukupolven kehitysymp&auml;rist&ouml; Amiga Software Development Kit on jo julkaistu ja uutta konetta lupaillaan alkuvuodeksi... Josko &quot;se&quot; nyt tapahtuisi?</p>
							<p>Ja mit&auml; yhdistystoimintaan tulee, hallituksesta olen onnistunut pysym&auml;&auml;n poissa itselleni tekem&auml;ni lupauksen mukaisesti - eik&auml; v&auml;hiten siksi ett&auml; uudesta hallituksesta l&ouml;ytyy niin osaavia ja ahkeria ihmisi&auml;. Mutta t&auml;ss&auml; sit&auml; kuitenkin sorvataan juttuja Sakuun, avustetaan tapahtumien j&auml;rjest&auml;misess&auml; (puuhastelin mm. pikkujoulujen ja vuosikokouksen eteen melkein yht&auml; paljon kuin aktiiviaikoinanikin) ja tehd&auml;&auml;n kaikkea sit&auml; mist&auml; niin kovasti yritin p&auml;&auml;st&auml; eroon, mielest&auml;ni urakkani tehneen&auml;...</p>
							<p>Never say never again?</p>
						</div>
						<center>
							<p>* * *</p>
						</center>
						<div align="left">
							<p>Nyt kun samalla seisomme yhdistyksemme historiallisen median, levyke-Sakun lopun kynnyksell&auml; (lue muistokirjoitukset toisaalla lehdess&auml;), noin viisi vuotta asiasta tehdyn periaatep&auml;&auml;t&ouml;ksen j&auml;lkeen :-), lienee vain oikein hakea perspektiivi&auml; edell&auml; kuvailemaani kiertokulkuun mm. aikaisempien Saku-numeroiden sivuilta. Mit&auml; kaikkea sit&auml; onkaan tullut sanottua...</p>
							<p>Sakussa #9, marraskuussa 1994, julkaistiin aikaisemmin AmigaGuide-Sakussa julkaistu, orkesteroimani Amiga-k&auml;ytt&auml;jien keskustelu er&auml;&auml;ss&auml; silloisessa monilinjaisessa Amiga-purkissa. K&auml;ytin kes&auml;kuisessa keskustelussa AAA:n puolesta mm. seuraavan puheenvuoron, uskon her&auml;tty&auml; ajatukselle, ett&auml; uusi rahoittaja pelastaa Commodoren.</p>
							<p>&quot;Eik&ouml; kohtuullisen hyv&auml;t &auml;&auml;net ja grafiikat riit&auml; kotikoneelle kun kaiken p&auml;&auml;ll&auml; leijuu erinomainen k&auml;ytt&ouml;j&auml;rjestelm&auml;? AAA voi hyvinkin tarjota grafiikkaominaisuudet ja nopeutta joilla toteuttaa DOOM, uudet &auml;&auml;nipiirit ovat varmasti hyv&auml;t ja k&auml;ytt&ouml;j&auml;rjestelm&auml; entist&auml; parempi. Kyll&auml; n&auml;ill&auml; ev&auml;ill&auml; voidaan viel&auml; kotikoneiden sarallakin rynnist&auml;&auml;. Mutta se suuri mutta onkin, saadaanko AAA-piirisi&auml; Amigoita koskaan julkaistua.&quot;</p>
							<p>Laskettakoon osa nuoren i&auml;n piikkiin, mutta uudelleen her&auml;nnyt usko tuntui siirt&auml;v&auml;n vuoria, kuten viel&auml; voimakkaammin saattoi havaita Commodoren konkurssia k&auml;sitelleess&auml; AmigaGuide-Sakun numerossa nelj&auml;, toukokuussa 1994, kerroin ett&auml; Commodore ei olekaan t&auml;ysin konkurssissa:</p>
							<p>&quot;Filippiineill&auml; sijaitseva tehdas on ollut kohta kuukauden suljettuna, mutta tuotannon lupaillaan jatkuvan pian, kunhan yrityksen uudelleen-organisointi on valmis. Commodore Germany on vahvistanut tiedon Aasialaisen yrityksen tarjoamasta rahoituksesta tai mahdollisesti oikeuksien ostamisesta Amigaan. Kyseisen yrityksen nimi on neuvottelujen ajan salainen, mutta arvauksia on varsin runsaasti esitelty Samsungin suuntaan.&quot;</p>
							<p>Tammikuussa 1995 Saku #10 toi mukanaan huhumyllyst&auml; kantautunutta saalista koskien Commodoren myynti&auml;. &Auml;&auml;nekk&auml;it&auml; pelureita olivat tuolloin CEI ja Commodore UK.</p>
							<p>&quot;Commodoren myynti on edelleen kesken. Viimeisimpien tietojen mukaan Creative Equipment International (CEI) on iskenyt p&ouml;yt&auml;&auml;n suurimman tarjouksen ja muut odottelevat konkurssipes&auml;n vastausta. Tarjous joko hyv&auml;ksyt&auml;&auml;n, jolloin CEI saa t&auml;ydet oikeudet Amigaan ja puoli vuotta kest&auml;nyt kilpajuoksu on ohi, tai muille annetaan viel&auml; kerran mahdollisuus pist&auml;&auml; paremmaksi. Commodore UK v&auml;itt&auml;&auml; tilannetta hieman toiseksi, joten mik&auml;&auml;n ei ole viel&auml; aivan varmaa. Molemmat osapuolet, CEI ja Commodore UK, ovat luvanneet jatkaa Amigan valmistusta ja jatkokehittely&auml; oikeudet saatuaan.&quot;</p>
							<p>Sakussa #11, maaliskuussa 1995, oli tilannetta seurailtu jo vuoden verran ja kirjoittamisen s&auml;vykin alkoi olla hieman piikikk&auml;&auml;mpi. Aloitin uutisointini aiheesta seuraavin sanoin:</p>
							<p>&quot;Commodore, muistatteko? Ehk&auml; joskus hamassa menneisyydess&auml; olet kuullut t&auml;m&auml;n nimen. Niin, seh&auml;n oli myynniss&auml; vajaa vuosi sitten? Kyll&auml;, se oli ja on edelleen.&quot;</p>
							<p>Vain kaksi kuukautta my&ouml;hemmin Amiga-maailma ei ollut en&auml;&auml; entisens&auml;, sill&auml; vuoden kest&auml;nyt jahkailu Commodoren myynnin suhteen oli yll&auml;tt&auml;en p&auml;&auml;ttynyt saksalaisen Escomin ostettua Commodoren. Eih&auml;n kukaan Escomista ollut kuullut t&auml;&auml;ll&auml; p&auml;in, mutta pian t&auml;m&auml; saksalainen PC-valmistaja alkoi tuntua pelastavalta enkelilt&auml;. Sakussa #12 olin viel&auml; suhteellisen varovaisissa tunnelmissa:</p>
							<p>&quot;Escom omistaa nyt l&auml;hes kaiken siit&auml;, mit&auml; Commodoresta on j&auml;ljell&auml;, mutta esimerkiksi Filippiineill&auml; sijaitseva tehdas ei kuulunut kauppaan. Escom kertoi yhteisty&ouml;st&auml;&auml;n kiinalaisten valmistajien kanssa (Tienjin Family-Used Multimedia) saadakseen uusia Amigoita kauppoihin parin kuukauden kuluessa (lehdist&ouml;tiedote kertoi malleista A600, A1200 ja A4000). On odotettavissa, ett&auml; Escom silti ostaa Filippiinien tehtaan varastoineen. Escom on my&ouml;s palkannut useita entisi&auml; Commodoren insin&ouml;&ouml;rej&auml;, ja suunnitelmissa on ensilausuntojen mukaan PowerPC-prosessorilla varustettu Amiga, mutta mit&auml;&auml;n teknisi&auml; yksityiskohtia ei ole viel&auml; ly&ouml;ty lukkoon.&quot;</p>
							<p>Escomin suunnitelmia seurattiin silm&auml; tarkkana seuraavissa Saku-lehden numeroissa ja kehaistiinpa yrityksen poikkeavan aikaisemmista Commodoren myynnin aikaisista suupalteista sill&auml;, ett&auml; he keskittyiv&auml;t tekoihin enemm&auml;n kuin sanoihin. Sakussa #13 k&auml;ytin seuraavanlaisen puheenvuoron ja usko rahan voimaan oli melkoinen:</p>
							<p>&quot;Escom ei ollut tarjonnut edelt&auml;vin&auml; kuukausina suuria lupauksia, mutta kun tosipaikka tuli eteen, vain he tuntuivat olevan tosissaan. Escom oli edustettuna huutokaupassa yhdentoista henkil&ouml;n voimin: mukana olivat yrityksen p&auml;&auml;omistaja, muutama muu t&auml;rke&auml; johtaja, useita lakimiehi&auml; ja Escomin kiinalaisen yhteisty&ouml;kumppanin edustajia. Lienee aivan selv&auml;&auml;, ett&auml; niin Commodore UK:n johto kuin my&ouml;s CEI:n Alex Amor halusivat Amigan itselleen, mutta puheistaan huolimatta heill&auml; ei ollut siihen varaa. Escom k&auml;ytti l&auml;hes yht&auml; paljon rahaa pelk&auml;st&auml;&auml;n alkuvuoden mainoskampanjaansa Englannissa kuin Amigan ostamiseen. Mainoskampanjallaan Escom siivitti tiet&auml; ostamiensa Rumbelows-liikkeiden tilalle avaamilleen tietokoneliikkeille.&quot;</p>
							<p>Saku #15 julkaistiin marraskuussa 1995 muutaman p&auml;iv&auml;n my&ouml;h&auml;ss&auml;, jotta mukaan saataisiin Escomin prosessorijulkistus seuraavan sukupolven Amigalle:</p>
							<p>&quot;Viivytimme t&auml;t&auml; Sakun numeroa muutamalla p&auml;iv&auml;ll&auml; saadaksemme tiedon Amiga Technologiesin Kaliforniassa Video Toaster Expo -tapahtumassa julkistamista tulevaisuudensuunnitelmista Amigalle. T&auml;rkein uutinen on ehdottomasti se, ett&auml; Amiga Technologies valitsi Amigan RISC-prosessoriksi PowerPC:n (PPC 604).&quot;</p>
							<p>My&ouml;s Back for the future -iskulause ilmestyi ensimm&auml;isen kerran n&auml;ihin aikoihin ja mainittiin ko. Sakussa. Luovuin seuraavan numeron my&ouml;t&auml; Sakun p&auml;&auml;toimittajuudesta ja keskityin ylioppilaskirjoituksiin ja kirjoittamaan MikroBittiin, sinnekin p&auml;&auml;asiassa Amigasta. Escom julkisti Amiga Surfer -paketin ja viel&auml; hieman p&ouml;lynimuria muistuttaneen prototyypin Amiga Walkerista, mutta sitten saksalaisfirma alkoikin horjua. Hein&auml;kuussa 1996, kirjoitin Saku-lehden numeroon 19 uudesta ostajakandidaatista VIScorpista sangen optimistiseen s&auml;vyyn:</p>
							<p>&quot;Mik&auml; parasta, Amiga todellakin on Viscorpin markkinat - ei pieni p&auml;&auml;markkinoiden kanssa kilpailuasemassa oleva &quot;hairahdus&quot; kuten Escomin tapauksessa.</p>
							<p>&quot;Me arvostamme Amigaa.&quot; - Viscorp kes&auml;kuussa 1996&quot;</p>
							<p>Mutta sitten Escom meni konkurssiin ja Viscorp-kaupat myttyyn, kun yritykselt&auml; loppuivat rahat. Kev&auml;&auml;ll&auml; 1997 Gateway 2000 kuitenkin tuli ja osti Amigan, ja usko alkoi p&auml;tkitt&auml;in palautua. N&auml;pertelin kasaan yhdistyksen uudet kotisivut kev&auml;&auml;ll&auml; 1997 ja kirjoitin 10.4. ensimm&auml;isess&auml; Viimeinen sana -kolumnissa seuraavaa:</p>
							<p>&quot;Mutta nyt on uusi vuosi ja uudet kujeet. Amiga n&auml;ytt&auml;&auml; saavan pian uuden omistajan, Sakun organisaatioita on uudistettu ja oikeastaan vain lis&auml;&auml; kirjoittajia kaivattaisiin, eik&auml; kiintolevyrikko ole lannistanut toivettamme kunnollisesta WWW-palvelusta. Taas kerran uudessa osoitteessa yrit&auml;mme uudelleen.&quot;</p>
							<p>Onnistuneen ja rohkaisevan Saku 97 -tapahtuman j&auml;lkeen palasin v&auml;liaikaisesti Saku-lehden p&auml;&auml;toimittajan rooliin ja aloitin 26. marraskuuta 1997 julkaistun Saku #23:n pohdiskelemalla p&auml;&auml;kirjoituksessa mik&auml; saa pysym&auml;&auml;n Amigan kelkassa:</p>
							<p>&quot;Loppujen lopuksi kaikkein parasta Amigassa on mielest&auml;ni kuitenkin sen ymp&auml;rill&auml; py&ouml;riv&auml;t ihmiset. Ihminen on sittenkin siin&auml; m&auml;&auml;rin laumael&auml;in, ett&auml; h&auml;n hakeutuu mielell&auml;&auml;n kaltaistensa joukkoon. Mutta eik&ouml; sitten olisi loogisempaa ostaa se yleisin kone ja tuntea kuuluvansa siihen suureen joukkoon? Ehk&auml;, mutta min&auml; en ainakaan viel&auml; yli kolmen vuoden PC:n omistuksen j&auml;lkeen ole tuntenut mink&auml;&auml;nlaista yhteenkuuluvaisuuden tunnetta.&quot;</p>
							<p>My&ouml;s uskoa PC-valmistaja Gatewayn suunnitelmiin tuntui riitt&auml;v&auml;n, vaikka vain v&auml;h&auml;n aikaa sitten oli Viscorpin parhaaksi puoleksi arvioitu yrityksen PC-taustan puute:</p>
							<p>&quot;Gateway 2000 on lupautunut maksamaan Amigan laskuja varsin avok&auml;tisesti. &quot;Gateway on pankkimme&quot;, kuten Amiga Internationalin presidentti Petro Tyschtschenko asian ilmaisi. Rahoitus sis&auml;lt&auml;&auml; my&ouml;s miljoonaluokan mainostusbudjetin. Amigan kehittelyosastolla puolestaan v&auml;&auml;nnet&auml;&auml;n parhaillaan kolmen vuoden kehityssuunnitelmaa, jolla Amigan teknologia saadaan ajan tasalle ja ohi kilpailijoista. Computer '97:ssa tarkkoja tietoja t&auml;m&auml;n suunnitelman sis&auml;ll&ouml;st&auml; ei kuitenkaan herunut, sill&auml; kaikki asiasta tiet&auml;v&auml;t henkil&ouml;t oli vannotettu pit&auml;m&auml;&auml;n suunsa kiinni.&quot;</p>
							<p>Saku-lehti t&auml;ytti kes&auml;ll&auml; 1998 kunnialliset viisi vuotta. Pohdiskelin lehden p&auml;&auml;kirjoituksessa tuon asianhaaran lis&auml;ksi my&ouml;s uskoa Gatewayn tarjoamaan parempaan tulevaisuuteen. S&auml;vy oli varovaisen optimistinen:</p>
							<p>&quot;Gatewayn ansioluettelo on p&auml;tev&auml;, ja sen suunnitelmat Amigalle ovat lupaavia. Commodoren, Escomin ja Viscorpin virheet eiv&auml;t ole Gatewayn virheit&auml;, eik&auml; sit&auml; voi niist&auml; syytt&auml;&auml;. Gateway ei ehk&auml; heti ymm&auml;rt&auml;nyt Amiga-kulttuuria, mutta kukaan tuskin voi kiist&auml;&auml; sen halua oppia ja ottaa oppia. Gateway on varmasti tehnyt omia virheit&auml;&auml;n ja tulee niit&auml; tekem&auml;&auml;n jatkossakin, mutta syd&auml;n n&auml;ytt&auml;isi olevan paikallaan ja p&auml;&auml;ss&auml; j&auml;rke&auml;. Mik&auml;&auml;n t&auml;ss&auml; maailmassa ei ole varmaa; ei suunnitelmien onnistuminen, mutta ei niiden ep&auml;onnistuminenkaan.&quot;</p>
							<p>Kotisivuilla, toistaiseksi viimeisess&auml; Viimeinen sana -kolumnissa, kehotin 2.8.1998 odottamaan viel&auml; kerran:</p>
							<p>&quot;Amiga-maailmassa tapahtuu nyt monessa mieless&auml; enemm&auml;n kuin aikoihin. Amiga on Amiga Inc.:n kunnianhimoisten suunnitelmien valossa saanut paljon aikaisempaa enemm&auml;n mainstream-julkisuutta ja tulevaisuudessa h&auml;&auml;m&ouml;tt&auml;&auml; selv&auml; p&auml;&auml;m&auml;&auml;r&auml;. Samalla kun kehitysosasto keskittyy luomaan seuraavan polven laitteita, markkinointijaos rakentaa uusia levityskanavia ja lisensoi olemassa olevaa teknologiaa kolmansille osapuolille. Puhumattakaan siit&auml; mit&auml; n&auml;m&auml; kolmannet osapuolet tekev&auml;t. Joten, ei t&auml;ss&auml; tarvitse ainakaan valitella mielenkiintoisen jonotusmusiikin puutetta. Kun olemme odottaneet vuoroamme jo n&auml;in kauan, jaksamme kyll&auml; yritt&auml;&auml; viel&auml; kerran.&quot;</p>
							<p>Sakussa #27, tammikuussa 1999, oli Gateway jo p&auml;&auml;ssyt niin pitk&auml;lle, ett&auml; k&auml;ytt&ouml;j&auml;rjestelm&auml;yhteysty&ouml;kumppanin nimi oli julkistettu:</p>
							<p>&quot;K&auml;ytt&ouml;j&auml;rjestelm&auml;n kehittelyst&auml; tulee vastaamaan Amigan kanssa yhteisty&ouml;ss&auml; QNX (ks. www.qnx.com), jonka vastuualueena ovat j&auml;rjestelm&auml;n syd&auml;n, kerneli, ja k&auml;ytt&ouml;liittym&auml;moottorin peruselementit. QNX on 80-luvun alussa perustettu, nimenomaan k&auml;ytt&ouml;j&auml;rjestelm&auml;teknologiaan keskittynyt yritys, jossa ty&ouml;skentelee paljon nykyisi&auml; ja entisi&auml; amigisteja ja jonka molemmat perustajaj&auml;senet hankkivat aikoinaan ensimm&auml;isiksi kotikoneikseen Amigat. QNX:n teknologian luotettavuudesta kertoo jotain se, ett&auml; NASA k&auml;ytt&auml;&auml; sit&auml; avaruussukkuloidensa tietokonej&auml;rjestelmiss&auml;.&quot;</p>
							<p>Eih&auml;n &quot;kukaan&quot; QNX:st&auml;k&auml;&auml;n oikein ollut kuullut, mutta ei ollut vaikea vakuuttua valinnan loistavuudesta. Aivan sokea sit&auml; ei kuitenkaan vuosien odottelun j&auml;lkeen onneksi ollut, vaan samaisen artikkelin lopussa maalailin varjoja seinille:</p>
							<p>&quot;Kun halu uskoa Amigan suunnitelmiin on suuri, on my&ouml;s helppo n&auml;hd&auml; asioita positiivisesti. Tai jos ei ole kiire mihink&auml;&auml;n. Mutta t&auml;ysin sujuvasti eiv&auml;t Amigan askeleet silti ole edenneet, se on kaikkien my&ouml;nnett&auml;v&auml;. Suunnitelmien jatkuva muuttuminen ei ole omiaan luomaan uskottavuutta, vaikka muutokset voivatkin olla ymm&auml;rrett&auml;vi&auml; ja ehk&auml; tulevaisuuden kannalta jopa kannattavia. Amigan tyt&auml;ryhti&ouml;iden yhteisty&ouml;ss&auml; on ollut havaittavissa my&ouml;s liev&auml;&auml; hakuammuntaa, eik&auml; tiedotustoiminta ole aina ollut kovin ammattimaista. Yritysten kotisivutkin tarvitsisivat selv&auml;sti tasokkaampaa ja yhten&auml;isemp&auml;&auml; ilmett&auml;.&quot;</p>
							<p>Kes&auml;kuussa 1999 QNX oli jo vaihtunut Linuxiin ja olin Janne Pikkaraisen kanssa hurraamassa Jim Collasille Lontoon World of Amiga -messuilta. Saku #29:ss&auml; julkaistiin aiheesta artikkeli lokakuussa 1999:</p>
							<p>&quot;Istuimme eturiviin Amiga Formatin p&auml;&auml;toimittajan Ben Vostin seurueen viereen. Tilaisuuden aluksi Petro Tyschtschenko toivotti kaikki tervetulleiksi ja n&auml;ytti aluksi Annexin musiikilla vauhditetun musiikkivideon, jossa alussa Boing-pallo levitoi viheri&ouml;iv&auml;n nurmikon yll&auml; ja Commodoren logo hallitsee kuvaa. Sitten taivas repe&auml;&auml; ja tilalle tulee synkkyys, jossa vuorollaan Escom ja Gateway vilahtelevat ja yritt&auml;v&auml;t v&auml;l&auml;ytell&auml; valoa himmenneeseen palloon. Sitten Gateway siirtyy taustalle, Amiga-logo r&auml;j&auml;ht&auml;&auml; etualalle, nurmikko kasvaa taas ja kirkastunut Boing-pallo alkaa py&ouml;ri&auml;. Symboliikka oli selv&auml;.&quot;</p>
							<p>Valitettavasti samaisessa numerossa kerrottiin my&ouml;s Jim Collasin eronneen ja Amigan tulevaisuus n&auml;ytti j&auml;lleen kerran hieman arveluttavammalta. Petro Tyschtschenkon puhelinpuhe Saku 99:n valoi kuitenkin uskoa, ja kirjoitin samaisessa Saku-lehden numerossa artikkelissa &quot;Amiga kuoli taas, kauan el&auml;k&ouml;&ouml;n Amiga&quot; mm. seuraavaa:</p>
							<p>&quot;N&auml;ht&auml;v&auml;ksi j&auml;&auml;, millainen on tarkalleen Amigan teknologiapanos ja mik&auml; on sen yhteisty&ouml;kumppaneiden kuten Sunin merkitys, mutta Amigaa ei kannata ainakaan tyhmien nettip&auml;&auml;tteiden tai Java-applettien visioimisesta moittia. Suunnitelma on paljon, paljon kiehtovampi, ja juuri siit&auml; syyst&auml; onkin niin s&auml;&auml;li, ett&auml; se on saanut k&auml;rsi&auml; huonosta julkisuusty&ouml;st&auml;, Gatewayn oikuttelusta ja paikoin huonok&auml;yt&ouml;ksisest&auml; ja valikoivasti kuulevasta Amiga-yhteis&ouml;st&auml;. Toivon vain, ettei se ole k&auml;rsinyt liikaa - onneksi Amiga ei ole ainoa yhti&ouml;, jolla on vastaavia suunnitelmia.&quot;</p>
							<p>Pian k&auml;vi kuitenkin ilmeiseksi ettei Gateway en&auml;&auml; ollut kiinnostunut Amigasta. AmigaOS 3.5 toi v&auml;liss&auml; pient&auml; lohtua, mutta tunnelmat olivat aikalailla maissa. Vuosituhannen vaihteessa Amigan tavaramerkit ja muu omaisuus patentteja lukuunottamatta vaihtoivat kuitenkin j&auml;lleen kerran omistajaa, ja Amiga-yhteis&ouml; her&auml;si seuraamaan saippuaoopperan uusinta lukua. Skeptisyydest&auml; yli p&auml;&auml;seminen vaati v&auml;h&auml;n aikaa, mutta Sakussa #33 hein&auml;kuussa 2000 olin taas jo melkein messiss&auml;:</p>
							<p>&quot;Uuden Amiga Inc.:n eduksi t&auml;ytyy kuitenkin todeta, ett&auml; he ovat ehtineet puolivuotisen olemassaolonsa aikana tehd&auml; jotain, josta Gateway ehti vain esitt&auml;&auml; lukuisia lupauksia, nimitt&auml;in julkistaa uuden Amiga OE:n kehitysymp&auml;rist&ouml;n. Toki t&auml;m&auml; Amiga SDK perustuu paljolti Taon Intentiin, mutta se on alku innokkaille koodaajille, jotka haluavat p&auml;&auml;st&auml; kokeilemaan siipi&auml;&auml;n uudessa Amiga-ymp&auml;rist&ouml;ss&auml; (jota kutsutaan my&ouml;s nimell&auml; Amie). SDK:sta puuttuvat viel&auml; esimerkiksi &auml;&auml;ni- ja 3D-kirjastot, mutta niit&auml; lupaillaan syksymm&auml;ll&auml;.&quot;&quot;T&auml;t&auml; j&auml;rjestelm&auml;&auml; voidaan ajaa olemassa olevilla laitteilla, mutta sit&auml; varten tullaan mahdollisesti kehitt&auml;m&auml;&auml;n my&ouml;s uusia tietokoneita, kuten mainittu AmigaOne. Mik&auml;li Tao ja Amiga onnistuvat valloittamaan maailman, ehk&auml;p&auml; katselemme Boing-demoa seuraavan sukupolven k&auml;nnyk&ouml;iss&auml;kin. En pid&auml;ttele hengityst&auml;ni, mutta toivotan heille onnea!&quot;</p>
							<p>Tosin muistelin samaisessa artikkelissa my&ouml;s historian oppeja:</p>
							<p>&quot;Henkil&ouml;kohtaisesti harkitsin hetken aikaa AmigaOnesta kirjoittamatta j&auml;tt&auml;mist&auml;. Olen nimitt&auml;in pienen &quot;journalistiurani&quot; aikana kirjoittanut lukuisia artikkeleita uusista Amigoista ja Amiga-klooneista, mm. Walkerista, Power Amigasta, BoXeRista, A5000/6000:sta (ne saksalaiset kloonimikrot), Phase 5:n A\Boxista ja PreBoxista, VIScorpin set-top-boxista, Gatewayn developer-koneesta, MCC:st&auml;, WonderTV:st&auml;, QuickPakin klooneista jne., eik&auml; n&auml;ist&auml; ainuttakaan ole julkaistu. AmigaOne saa rikkoa melkoisen kirouksen selvit&auml;kseen. :-)&quot;</p>
							<p>Ja mieleeni tuli my&ouml;s taannoinen Viimeinen sana -kolumni yhdistyksen kotisivuilla ja monet muut kirjoitukset, kun tarkastelin seuraavaa kommenttiani. Ihan kuin olisin sanonut t&auml;m&auml;n kaiken joskus aikaisemminkin, toisin hieman eri sanoin ja nimin - itse asiassa olenkin:</p>
							<p>&quot;Kokonaisuutena Amigan esitys on ollut aika sekava, ja sekalaiselta tuntuu sakkikin. Paljon olisi ty&ouml;t&auml; esimerkiksi PR:n ammattimaisuudessa, mutta Bill McEwenill&auml; on kyll&auml; pointtiakin h&auml;nen sanoessaan, ett&auml; t&auml;ll&auml; kertaa he haluavat tehd&auml; ensin fiksun tuotteen ja vasta sitten palkata ihmisi&auml; myym&auml;&auml;n sit&auml;. Toisaalta on ollut rohkaisevaa n&auml;hd&auml; Amigan nime&auml; esimerkiksi useissa Taon Amigaan liittym&auml;tt&ouml;miss&auml; lehdist&ouml;tiedotteissa tai devicetop.comin etusivulla.&quot;</p>
							<p>&Auml;kkiselt&auml;&auml;n on vaikea arvostaa sit&auml; historiallista arkistoa, joka Saku-lehtien kirjastossa on. Pikainenkin l&auml;pileikkaus kuitenkin antaa ainutlaatuisen kuvakulman niin suomalaisen kuin kansainv&auml;lisenkin Amiga-kehityksen (tai sen puutteen) 90-luvun loppupuoliskon historiaan. H&auml;mment&auml;v&auml;&auml; on my&ouml;s huomata, kuinka paljon samoja mantroja on toistettu ja kuinka monta kertaa usko parempaan tulevaisuuteen on uusittu, vaikka oljenkorsiin tarttuen. Nyt osaan asialle jo naureskella, k&auml;vi Amigalle sitten miten tahansa, mutta toisaalta en voi olla harmittelematta sit&auml; miten paljon aikaa, rahaa ja intohimoa on haaskattu niin Amigan parissa ty&ouml;skennelleiden kuin sit&auml; odottaneidenkin osalta. Se on todella s&auml;&auml;li.</p>
							<p>Vastaus kysymykseen, miksi olemme roikkuneet mukana on tietysti hyvin henkil&ouml;kohtainen. Meill&auml; jokaisella on varmasti omat syymme, mutta omani esitin jo vuonna 1997 edell&auml; lainatussa Saku #23:n p&auml;&auml;kirjoituksessa, ja toistin saman mm. 19.10.1999 julkaistussa yhdistyksen &quot;toiminta jatkuu&quot; -tiedotteessa:</p>
							<p>&quot;Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. on ker&auml;nnyt vuosien saatossa yhteisen harrastuksen ymp&auml;rille satoja, kenties tuhansia tietokoneharrastajia. Yhdistys on luonut yhteyksi&auml; ja yst&auml;vyyksi&auml;, jotka loppujen lopuksi painavat toiminnan jatkumisessa paljon enemm&auml;n kuin Amigan tilanne maailmalla.&quot;</p>
							<p>Enemm&auml;n tai v&auml;hemm&auml;n yll&auml;tt&auml;en kirjoitin jotain samanlaista t&auml;ss&auml; lehdess&auml; julkaistun vuosikokousartikkelin loppuun. Kaikesta s&auml;&auml;t&auml;misest&auml; huolimatta t&auml;m&auml; on ollut hauskaa puuhastelua mielenkiintoisten ihmisten seurassa. N&auml;inharrastuspohjalta on helppo hymyill&auml;. Hieman ik&auml;v&auml;mm&auml;lt&auml; tuntuu ajatella kaikkia niit&auml; jotka ovat pist&auml;neet ty&ouml;ns&auml; ja uransa peliin Amigan eteen.</p>
						</div>
						<center>
							<p>* * *</p>
						</center>
						<div align="left">
							<p>Lopuksi on kai pakko palata Saku #25:n p&auml;&auml;kirjoituksessa hein&auml;kuussa 1998 tekem&auml;&auml;ni ehdotukseen:</p>
							<p>&quot;Nykyisell&auml;&auml;n Amiga-markkinat ovat kehnossa jamassa, eik&auml; itse konekaan en&auml;&auml; kulje kehityksen k&auml;rjess&auml;. Menee viel&auml; tovi ja toinenkin, ennen kuin tilanteeseen tulee parannusta - jos tulee. Mik&auml;li koet tarvitsevasi jotain muuta, toivotan onnea valitsemallasi tiell&auml;. Pist&auml;ydy kuitenkin parin vuoden kuluttua katsomassa, mit&auml; Amigalle kuuluu - voit yll&auml;tty&auml;.&quot;</p>
							<p>Pari vuotta on kulunut, enk&auml; nyt varsinaisesti voi sanoa ett&auml; Amiga-maailmaan kahden vuoden tauon j&auml;lkeen palannut pahemmin yll&auml;ttyisi mist&auml;&auml;n muusta kuin siit&auml;, ett&auml; olemme viel&auml;kin t&auml;&auml;ll&auml; sinnittelem&auml;ss&auml; samassa tilanteessa. Itse&auml;nikin jo melkein naurattaa kertoa Amigasta kiinnostuneille ett&auml; koneella on uusi omistaja ja uutta konetta lupaillaan ensi vuoden alkuun. Samat sanat on tullut sanottua sen verran monta kertaa. Itse asiassa t&auml;m&auml;n p&auml;&auml;kirjoituksenkin olen tainnut vuosien varrella kirjoittaa jo monta kertaa.</p>
							<p>Tosin sill&auml;kin uhalla ett&auml; toistan menneisyyden virheit&auml;, ehdotan ett&auml; skeptikotkin pysyv&auml;t kuulolla seuraavan vuoden ajan. Voitte vaikka... &ouml;&ouml;... yll&auml;tty&auml;. ;-)</p>
							<p>Yksi asia ainakin toivottavasti on varmaa. Korvissani vihlaisee seuraavan kerran kun sanon &quot;ei en&auml;&auml; koskaan&quot;. Siperia on opettanut. Toivottavasti.</p>
							<p>Saku - shaken, but not stirred...</p>
							<p>Janne Sir&eacute;n</p>
							<p>PS. Kiitoksia kaikille vuosikokouksessa mukana olleille. Runsas osanotto oli varmasti hyv&auml; rohkaisuryyppy uudelle hallitukselle! Toivotan omasta puolestani samalla my&ouml;s onnea ja menestyst&auml; hallitukselle.</div>
					</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
