<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="author" content="Johannes Weidner">
<title>Erdwein: Gut abgeschmiert - Short Story</title>
</head>
<body bgcolor="#FFFFFF" text="#333333" link="#0033CC" vlink="#333366"
leftmargin="10" topmargin="10" marginwidth="10" marginheight="10">
<table border="0" cellspacing="0" cellpadding="10" width="100%" bgcolor="#99aaaa">
    
<tbody>
<tr>
<td bgcolor="#ffffff">

<h2 align="center"> Hanno Erdwein </h2>

<h1 align="center">Gut abgeschmiert</h1>

<p>Es stank meilenweit gegen den Wind. Ein Pesthauch vergiftete Engstetten.
F&uuml;r derlei hatte ich eine Nase. Und als unterbezahlter Journalist des
Engstetter Tageblatts konnte ich mich auf meinen Riecher verlassen.
Schlie&szlig;lich lebte ich von seiner Witterung. </p>

<p>Seit Wochen tobte im Gemeinderat ein harter Kampf um die Verwendung des
Grundst&uuml;cks am Farnweiher. Das reizvolle Gel&auml;nde geh&ouml;rte zum
Nachla&szlig; der vor gut einem Jahr verstorbenen Emilie Grundmoser. Das
nicht gerade kleine Anwesen oder sein Gegenwert sollte karitativen Zwecken
zugef&uuml;hrt werden. Der Entscheid war an einen eindeutigen Nachweis der
Gemeinn&uuml;tzigkeit gebunden. Den Zuschlag erhielt der katholische
Schutzengel- Hort. Ein Kindergarten, welcher bis dahin noch in einer
Notbbaracke untergebracht war. &quot;Das ist ja wunderbar!&quot;, jubelte
Frau Seltvyl, die junge Leiterin des Horts. Und alles dachte, damit
w&auml;r die Sache vom Tisch. Zu fr&uuml;h gefreut! </p>

<p>Der Umzug an den Weiher zog sich hin. Angeblich waren nicht genug Gelder
fl&uuml;ssig. Kurz darauf ging ein Geraune um, es habe sich ein anderer
Interessent f&uuml;r das Objekt gefunden. Wieso gefunden? Hatte man denn
danach gesucht? Es hie&szlig;, ein Chemiefabrikant sei scharf auf das
gesamte Umland nebst Wassernutzung des Weihers. Das konnte ich denn doch
nicht glauben. Solch eine Behauptung war purer Hirnri&szlig;! Farnweiher
nebst Auen, bestehend aus Wildwiesen und Buchenhainen, standen unter
Naturschutz. Und gegen den kam auch kein noch so dringendes Begehren eines
Industriellen an. Dennoch, es stank f&uuml;rchterlich in Engstetten. </p>

<p>Ungeniert pochte ich bei B&uuml;rgermeister Krummhold an die neu
lackierte T&uuml;r. Hoffentlich, so dachte ich, war sein Gewissen nicht
ebenfalls frisch lackiert. Krummhold lie&szlig; einen undefinierbaren Laut
h&ouml;ren, den ich als ein Herein interpretierte. &quot;Kramer&quot;,
seufzte er, ohne sein Ges&auml;&szlig; vom Sessel zu l&uuml;ften, &quot;Du
hast mir gerade noch gefehlt.&quot; &quot;Na, dann freu Dich, da&szlig; ich
unaufgefordert hier bin.&quot; Der Wink seiner schwammigen Hand wies mir
den Wackelstuhl auf der anderen Tischseite an. Ich zog was Solideres vor
und pflanzte mich &uuml;ber Eck zu ihm auf den zweiten Sessel. Bruno
Krummhold schluckte das. Schlie&szlig;lich waren wir ehedem Kommilitonen
und hatten eine Zeitlang in der Sch&uuml;tzenbruderschaft auf den gleichen
Vogel geschossen. Ich sah mir Bruno an. Etwas stimmte ganz entschieden
nicht mit ihm. Er hockte verkrampft und nerv&ouml;s da. Spielte
beil&auml;ufig mit dem Brief&ouml;ffner. Wich meinem forschenden Blick aus.
Suchte fortw&auml;hrend etwas in allen m&ouml;glichen Winkeln. Was war mit
ihm los? Das galt es, heraus zu finden! </p>

<p>&quot;Sag mal, mein Alter, was ist an der tollen Story mit der
Chemiefabrik dran?&quot; War das ein Zusammenzucken? Krummhold ri&szlig;
die Schublade auf und warf entschlossen den Brief&ouml;ffner hinein.
Ersatzweise suchten nun seine Unterarme Halt auf der Tischplatte. Kurz sah
er in meine Richtung. Leckte sich die wulstige Unterlippe zwei, drei Mal.
H&uuml;stelte und begann heiser: &quot;Ihr verdammten Journaille-schreiber.
Ihr geht auch jeder Schei&szlig;hausparole nach, was?!&quot; Wieder
streifte mich nur sein gehetzter Blick. &quot;Nun-nun&quot;, suchte ich ihn
zu beruhigen, &quot;fr&uuml;her hast Du uns nicht derart verunglimpft. als
es darum ging, Dir gen&uuml;gend Stimmen f&uuml;r Deine Ernennung zu
beschaffen.&quot; Seine Pranken ruderten abwehrend auf und ab. &quot;Bleib
sachlich, Gerd. Ich versichere Dir, da&szlig; an dem ganzen
Hintertreppengerede kein Sterbenswort dran ist.&quot; Es h&auml;tte nicht
viel gefehlt, und mir w&auml;r sein Ehrenwort entgegengeflattert. Sein
heiliges Eehrenwort. Es sa&szlig; ihm Schon auf der Zungenspitze. Er saugte
es aber noch zeitig genug zur&uuml;ck. vielleicht dachte er an Leute, die
in Badewannen enden. Undd dabei wu&szlig;te ich nur zu genau, da&szlig;
Bruno Krummhold log, hundsgemein log. </p>

<p>An der Post quetschte ich mich in eine Telefonzelle. &quot;Hallo MM. Was
wihert denn heute so der amtsschimmel?&quot; MM war Moritz Malscho&szlig;.
Ein Spezi, auf den ich mich bis jetzt verlassen konnte. &quot;Ich kau mich
gerade durch mein zweites Fr&uuml;hst&uuml;ck.&quot; &quot;Sag mal,
sch&auml;mst du Dich nicht? Ich hab nicht mal das erste im Magen.&quot;
Moritz war - was er selbsst zugab -ein &uuml;berbezahlter und v&ouml;llig
unterbesch&auml;ftigter Gemeindediener. Wenn er nicht gerade Aktenordner
aus der Registratur in diese oder jene Amtsstube schleppte, die
Aush&auml;nge im Schaukasten erneuerte oder einen langweilig belanglosen
Akteneintrag in die Maschine tippte, sa&szlig; er nur herum und l&ouml;ste
Kreuzwortr&auml;tsel. Sein gr&ouml;&szlig;ter Vorzug lag darin, mein
Informant zu sein. Die Loyalit&auml;t gegen&uuml;ber Krummhold war
hauchd&uuml;nn. Seine Sympathie f&uuml;r mich um so kompakter, seit ich ihn
einmal aus einer prek&auml;ren Situation herausgeboxt hatte. &quot;H&ouml;r
mal, mein Alter.&quot; &quot;Ich h&ouml;re&quot;, nuschelte er neben 300
Gramm Brotmasse hervor. &quot;&quot;Ich brauch da Infos, am besten
Fotokopien in Sachen Farnweiher.&quot; &quot;Hei&szlig;e Kiste. WEnns
rauskommt, haben sie mich beim Arsch.&quot; &quot;So brenzlig?&quot;,
staunte ich. &quot;Also willst Du lieber die finger davon lassen?&quot;
&quot;Ach, red kein Schei&szlig;. Ich seh zu, was ich machen kann.&quot;
&quot;Okey, dann bis sp&auml;ter.&quot; </p>

<p>Wieder auf der Stra&szlig;e blieb ich einen Augenblick stehen und
blinzelte nachdenklich auf die wetterd&uuml;stere Wolkenwand im Westen.
Sollte ich nicht doch besser gleich nach Haus? Nein. Ich mu&szlig;te Isidor
Distler noch einen Besuch abstatten. Wollte allzu gern wissen, welches
M&auml;rchen mir der Naturschutzbeauftragte auftischen w&uuml;rde. Wenn mir
schon Bruno, der stets integere Freund ohne Fehl und Tadel die Huke voll
log, dann hielt ich alles f&uuml;r m&ouml;glich. </p>

<p>Bei Distler roch es nach Naturkost. Er war der sprichw&ouml;rtliche
M&uuml;sli-Man in ungef&auml;rbter Schafwoll-Kleidung und
Birkenstock-Sandalen. Zum Gl&uuml;ck hatte ich mir vor der Haust&uuml;r
noch eine Lunge voll Zigarettenqualm geg&ouml;nnt. In seinen geheiligten
auraschwangeren R&auml;umen war dies Tabu. Distler n&ouml;tigte mich in
einen knisternden Rohrsessel, der zwar umweltfreundlich, aber h&ouml;chst
unbequem war. Pflanzte sich mir gegen&uuml;ber und nahm spielerisch einen
tennisballgro&szlig;en Bergkristall mal in die eine, mal in die andere
Hand. &quot;Ist gut f&uuml;r das innere Gleichgewicht&quot;, l&auml;chelte
er erl&ouml;serhaft. &quot;M&ouml;chten Sie auch mal?&quot; Ich mochte
nicht. Vielmehr hatte ich eine Menge Fragen auf der Latte, mit denen ich
ihn gleich aus seiner kristallenen ruhe bringen wollte. &quot;Was
k&ouml;nnen Sie mir im Hinblick auf den Naturschutz &uuml;ber das
Gel&auml;nde rund um den Farnweiher sagen?&quot; Distler zuckte nicht mal
mit einer Wimper. Die Frage traf ihn offenbar nicht unvorbereitet. Die
Antwort kam auch ohne Zeitverzug aus ihm herausgepurzelt: &quot;Das Terrain
unterliegt nach wie vor strengsten Auflagen. Ausnahme bildet das
Privatgrundst&uuml;ck von Frau Grundmoser.&quot; &quot;Wie erkl&auml;ren
Sie sich dann die hartn&auml;ckige M&auml;r von dem beabsichtigten Aufkauf
durch einen Chemiefabrikanten, </p>

<p>welches sich weit &uuml;ber das Gel&auml;nde der Verstorbenen ausdehnen
will? Und wie vertr&auml;gt sich eine industrielle Nutzung des Weihers mit
den heren Anspr&uuml;chen des Naturschutzes?&quot; Distler lie&szlig; die
Kugel von einer Hand in die andere springen, was wie der Anfang eines
Jongleuraktes aussah. Sein Kopf ruckte dabei mal hierhin, mal dorthin und
fegte den Pferdeschwanz wechselweise &uuml;ber beide Schultern nach vorn.
Endlich bedachte er, da&szlig; ich ihn etwas gefragt hatte.
&quot;Ger&uuml;chte, Herr Kramer, Ger&uuml;chte. Als Journalist sollten sie
die besser auf ihren Wahrheitsgehalt abklopfen.&quot; &quot;Gut gekontert.
Aber die Praxis erweist, da&szlig; an solchen Ger&uuml;chten immer ein
K&ouml;rnchen Wahrheit ist ...&quot; &quot;Seit wann geben Sie sich mit
hom&ouml;opathischen Dosen zufrieden?&quot; Da hatte er mir schon wieder
eins &uuml;bergebraten. 2:0 f&uuml;r ihn. &quot;Zu Ihnen ist nicht
zuf&auml;llig ein Herr in feinem Zwirn gepilgert, der eine pralle
Aktentasche trug?&quot; Jetzt endlich lie&szlig; er den Kristall in eine
Schale h&uuml;pfen und sah mich pfeilgerade an: &quot;Was wollen Sie damit
andeuten, Herr Kramer?&quot; &quot;Och, eigentlich nichts Besonderes.
H&auml;tte ja sein k&ouml;nnen, da&szlig; man Ihre Standhaftigkeit ein
wenig auf die Probe stellen wollte.&quot; W&uuml;tend sprang er auf,
&ouml;ffnete schwungvoll die T&uuml;r und reckte den Arm:
&quot;Hinaus!&quot; Ich kam langsam genug auf die F&uuml;&szlig;e, ihn noch
f&uuml;r ein paar zus&auml;tzliche Augenblicke zu reizen. &quot;Ich denke,
Herr Distler, bei all dieser h&uuml;bsch naturnahen Umgebung stinkt es hier
ganz gewaltig.&quot; &quot;Raus! Sie unversch&auml;mter Mensch. H&auml;tte
Lust, Ihnen eine Verleumdungsklage an den Hals zu h&auml;ngen.&quot; Dicht
vor ihm parkte ich mich ein letztes mal ab: &quot;Wieso denn? Was hab ich
Schlimmes gesagt? Sie haben lediglich ein paar Fragen gestellt bekommen.
Das wird doch noch erlaubt sein, oder?&quot; Sein Pfefferminzatem pfiff
mich scharf an: &quot;Sie sprachen von Gestank.&quot; &quot;Ja, das tat ich
allerdings. Dies ist eine Wohnlage mit &uuml;bler Luft. W&uuml;rde hier nie
bauen wollen. Auf Wiedersehen, Herr Distler.&quot; &quot;Gehen Sie zum
Teufel.&quot; Ich grinste ihm frech ins Gesicht: &quot;Heute nicht mehr.
Aber bald. Und dann erhalten auch Sie eine Vorladung bei Luzifer.&quot;
</p>

<p>Nun brauchte ich Karins n&uuml;chternen Verstand und ihre stets
hellwachen Ohren, die sie als Wirtin des Goldenen Pfaus bestens einzusetzen
wu&szlig;te. Karin Hofer, meine recht lose Beziehung. Sie h&ouml;rte sich
die Fakten an und meinte nach ein paar Rauchkringeln: &quot;Eindeutig
Schmiergeld.&quot; &quot;Soso&quot;, seufzte ich und schnippte mit meinem
Feuerzeug. &quot;Schmiergeld also. Und woraus schlie&szlig;t du das?&quot;
Karin knabberte sich langsam durch eine Salzstange, bevor sie mir Antwort
gab: &quot;So dies und das. Manch einer wirft pl&ouml;tzlich mit Geld um
sich.&quot; &quot;Zum Beispiel?&quot; &quot;Jochen Br&auml;sig.&quot; Ich
horchte auf. Br&auml;sig. Flickschuster mit einem Einkommen, das ihn mal
gerade &uuml;ber Wasser hielt. Einer der S&auml;ulen des Gemeinderats. Wenn
der pl&ouml;tzlich Geld zuviel hatte, dann konnte das nur eines bedeuten.
&quot;Und geerbt hat der es nicht?&quot; Meine Kleine sch&uuml;ttelte ihre
braunen Locken: &quot;Ausgeschlossen. Der alte Knorzer steht v&ouml;llig
allein in der Welt. Kauft sich mir nichts dir nichts eine harley und trinkt
mir den teuersten Champus weg.&quot; Ich rieb nachdenklich meine Zunge an
den Schneidez&auml;hnen. &quot;Und wer hat sonst noch Euros locker
sitzen?&quot; &quot;Arnold Koslowski.&quot; Ich pfiff durch die Z&auml;hne.
Koslowski sa&szlig; ebenfalls im Rat und unterhielt den Zeitungsstand am
Bahnhof. Der florierte nicht schlecht. Doch Reicht&uuml;mer konnte man
damit auch nicht erwerben. Wenn der Glatzkopf nun ebenfalls Scheinchen
flattern lie&szlig;, dann ... &quot;Bevor Du weiter fragst&quot;, Karin hob
die Hand und bog einen finger nach dem anderen ein. Dabei z&auml;hlte sie
namen auf. Es waren ihrer noch vier. Also hie&szlig; das, mehr als die
H&auml;lfte des Gemeinderats wurde korrumpiert. &quot;Und Krummhold?&quot;
Karin grinste s&auml;uerlich: &quot;Schau Dir doch mal an, in welcher
Kledage Frau Erna B&uuml;rgermeister neuerdings sonntags zur Kirche
wallfahrtet.&quot; &quot;Kein Wunder, da&szlig; mir Neuheide dieser Umstand
entgangen ist.&quot; Meine Kleine plinkerte mit Wimpern: &quot;Kirchegehen
zahlt sich manchmal auch aus.&quot; Schob Erdn&uuml;sse in ihr rosa
M&auml;ulchen und grinste: &quot;Hochw&uuml;rden tr&auml;gt neuerdings
einen kostbaren Talar.&quot; Auch das noch! Ich schneuzte meinen
vortrefflichen Riecher, der schon genug Unrat zu wittern bekam, als ich bei
Bruno sa&szlig;. &quot;Danke, das reicht.&quot; Und ich r&auml;kelte mich.
&quot;Aber, wei&szlig;t Du, es langt nur noch nicht f&uuml;r eine
entsprechende Notiz im Bl&auml;ttchen. Obschon es mich verdammt juckt, die
T&uuml;ren des Saustalls mal weit aufzurei&szlig;en.&quot; </p>

<p>Auch das, was mir Moritz eine halbe Stunde sp&auml;ter auf der
Stra&szlig;e heimlich zusteckte, es waren einige B&ouml;gen kopierter
Akteneintr&auml;ge, vermochte meine Aktivit&auml;t noch nicht in Gang zu
bringen. Ich hielt zwar den Beweis in H&auml;nden, da&szlig; einige
Ratsmitglieder und andere einflu&szlig;reiche Leute korrumpiert worden
waren, konnte und durfte Moritz zuliebe aber keinen Gebrauch davon machen.
Das &uuml;berraschenste Schriftst&uuml;ck allerdings war ein
Gef&auml;lligkeitsurteil des grundsoliden Herrn Distler mit dem Tenor,
da&szlig; die Ansiedlung eines Chemiewerkes am Farnweiher und
Nutzungsrechte des Wassers keinerlei Schaden f&uuml;r das Naturschutzgebiet
bringen w&uuml;rde. Mir zitterten vor Wut und Emp&ouml;rung die H&auml;nde.
Am liebsten h&auml;tte ich den Schrieb so wie er war in die Lokalseiten
gebracht. Aber ich mu&szlig;te auf Moritz R&uuml;cksicht nehmen. </p>

<p>Die Gelegenheit bot sich eine Woche sp&auml;ter in Form der offiziellen
Mitteilung im Aushang der Gemeindeverwaltung, da&szlig; das Grundst&uuml;ck
am Farnweiher endg&uuml;ltig dem Chemiekonzern &uuml;bereignet war. Wie
das? Ein Raunen ging durch die Gemeinde. Einige wollten das schon immer
gewu&szlig;t haben. Andere waren geschockt. Vor allem jene, die Emilie
Grundmoser n&auml;her gekannt hatten und von ihrer
unumst&ouml;&szlig;lichen Absicht wu&szlig;ten, das Gel&auml;nde keinem
Fabrikanten verkaufen zu wollen. Angebote und Dr&auml;ngeleien in dieser
Hinsicht hatte sie oft genug abgewiesen. Ein Gro&szlig;teil der
Volkesmeinung wurde recht laut: &quot;Das stinkt gen Himmel!&quot; Und ich
konnte endlich das schreiben, was ich noch brav zur&uuml;ckgehalten hatte.
</p>

<p>Mein Artikel l&ouml;ste einen regelrechten Skandal aus. Bruno Krummhold
r&uuml;ckte mir pers&ouml;nlich auf die bude. &quot;Du Dreckskerl! Du
Schmierenschreiber!&quot; Seine fleischigen F&auml;uste kamen meiner
abgetragenen Krawatte gef&auml;hrlich nahe. &quot;Du hast Dir da was aus
den tintenfleckigen Fingern gesogen, was ein himmelschreiender Unsinn
ist!&quot; K&uuml;hl und gelassen blickte ich in sein hochrot erhitztes
Gesicht. Wenn er mir hier nur keinen Schlaganfall bekam! &quot;H&uuml;bsch
langsam, mein Lieber. ICH HAB NUR ZUSAMMENGEFA&szlig;t, was allgemein
bekannt ist.&quot; &quot;Du hast einen Schei&szlig;dreck verzapft und die
Gemeinde verunglimpft!&quot;, br&uuml;llte Bruno mit scheibenklirrender
Lautst&auml;rke. &quot;Das ergibt den Tatbestand der Verleumdung. Du wirst
von meinem Rechtsanwalt h&ouml;ren.&quot; &quot;Gern&quot;, grinste ich
tapferer als ich war. Schlie&szlig;lich war mein Artikel auf eigene
Verantwortung ausgedruckt worden. Der Redakteur hielt sich wohlweislich den
Buckel sauber.</p>

<p>Es war sicher nicht angenehm, durch eine Vorladung auf das Kreisgericht
gebeten zu werden. &quot;Du brauchst den Pfau deshalb nicht extra zu
schlie&szlig;en.&quot; Aber Karin wollte unbedingt mit. &quot;Ich mu&szlig;
doch aufpassen, da&szlig; Du keinen Schwachsinn erz&auml;hlst.&quot; So
klapperten wir am 28. September in meiner Citroin-Ente nach Holtum.
Fr&uuml;hnebel lag auf den Feldern. Der Asphalt der Landstra&szlig;e war
na&szlig; und glitschig. Was konnte ich von solch einem Tag auch anders
erwarten? </p>

<p>&quot;Ruhe bitte!&quot; Die Schelle des Richters mahnte manchen
Bauernsch&auml;del im Saal zur Gelassenheit. Der Kasus stachelte die
Gem&uuml;hter zu heftigen Kontroversen auf. &quot;Wenn nicht bald Ruhe
herrscht, lasse ich den Saal r&auml;umen!&quot; Das wirkte -zumindest
vor&uuml;bergehend. &quot;Herr B&uuml;rgermeister Krummhold. Sie haben
Anzeige gegen den Journalisten Kramer des Engstettener Tageblatts wegen
b&ouml;swilliger Verleumdung angezeigt. Stimmt das?&quot; Bruno schob die
H&auml;nde noch tiefer in seine Hosentaschen und brummte ein kaum
vernehmliches &quot;Jo&quot;. Der Richter schlug &auml;rgerlich aufs Pult:
&quot; Erstens, Herr Krummhold, haben sie aufzustehen und die H&auml;nde
aus den Hosentaschen zu nemen. Soviel Anstand kann ich von einem
B&uuml;rgermeister erwarten. Und zweitens darf ich Sie bitten, in ganzen
S&auml;tzen zu antworten.&quot; Das sa&szlig;. Brunos Hamsterbacken
flammten purpurn, w&auml;hrend er sich &auml;chzend erhob und ein &quot;Ja,
Herr Richter, das stimmt so&quot; von sich gab. Anschlie&szlig;end
lie&szlig; er sich schwer auf den Stuhl zur&uuml;ckfallen. Richter Wermut
achtete nicht weiter darauf und bl&auml;tterte in seinen Akten. Dann
richteten sich seine Brillengl&auml;ser auf mich. Vorsorglich stand ich
schon einmal auf, was ein erstes L&auml;cheln des Rechsprechers
hervorzauberte. &quot;Herr Kramer. Was haben Sie gegen die Anschuldigung
vorzubringen?&quot; Mein Blick erfa&szlig;te kurz die Vollversammlung von
Freund und Feind im Saal. Es stand nicht sonderlich gut um meine Position.
Bruno hatte sich mit einem &Uuml;bergewicht an Falschaussagern versehen,
gegen das meine paar Zeugen nur mit handfesten Beweismitteln etwas
ausrichten konnten. Und was waren die wert? Selbstzweifel lie&szlig;en mich
h&uuml;steln. Krummholds schmutziges Grinsen machte mich noch unsicherer.
Schon hob Richter Wermut die Augenbrauen &uuml;ber den Brillenrand und sah
mich erstaunt an. Karin tippte mir aufmunternd in die Kniekehle. Endlich
l&ouml;ste sich mein Frosch im hals. &quot;Herr Richter. Ich habe dagegen
zu setzen, da&szlig; es handfeste Beweise gibt, da&szlig; in der
Nachla&szlig;sache von Frau Grundmoser dem Willen der Verstorbenen nicht
entsprochen wurde.&quot; rumoren im Saal. &quot;Laut Testament sollte das
Grundst&uuml;ck am Farnweiher oder ein Verkaufserl&ouml;s karitativen
Zwecken dienen. Dem wurde nicht entsprochen.&quot; Heftigeres rumoren und
&quot;H&ouml;rt-H&ouml;rt!&quot; Die Schelle des Richters bellte
dazwischen. &quot;Herr Kramer&quot;, Richter Wermut bl&auml;tterte in
seinen Unterlagen. &quot;Man wirft Ihnen vor, in einem Zeitungsartikel
B&uuml;rgermeister und Gemeinderat der Bestechlichkeit bezichtigt zu haben.
Sie verwendeten mehrfach den Begriff Schmiergeldempfang. Wenn Sie das nicht
handfest belegen k&ouml;nnen ...&quot; Er sah vom Schriftst&uuml;ck auf und
mich &uuml;ber den Brillenrand streng an. &quot;Das kann ich&quot;,
entgegnete ich so ruhig wie m&ouml;glich. &quot;Der Entscheid des
Gemeinderats wurde durch reichliches Verteilen von Bestechungsgeldern
beeinflu&szlig;t.&quot; Wieder Emp&ouml;rung im Sall und l&auml;ngeres
Sch&uuml;tteln der Schelle. &quot;Dann bitte ich um die Beweise.&quot; </p>

<p>Was folgte, war ein sich in die L&auml;nge ziehendes Aufrufen von Zeugen
und Gegenzeugen. Jedes meiner Argumente, jeden glasklaren Beweis wischte
Bruno mit einem Schlenker seiner fetten Hand vom Tisch. Es waren keine
Schmiergelder geflossen. Alles war L&uuml;ge und b&ouml;swillige
Verleumdung. Das Grundst&uuml;ck am Weiher kam durchaus rechtens in die
Hand des Chemieunternehmens. Und dieser Entscheid diene nur zum Nutz und
Frommen der Gemeinde, was wiederum im Sinne der Frau Grundmoser ... ...
blablabla. Kurzum, er war der strahlende held und ich ein b&ouml;swilliges
Arschloch. Ger&auml;uschvoll schnaufend setzte er sich. Richter Wermut
wandte sich nun wieder an mich: &quot;haben Sie den Auslassungen von Herrn
Kummhold noch etwas hinzuzuf&uuml;gen?&quot; Ich hatte. Ein Kramer sparte
sich den Trumpf stets f&uuml;r zuletzt auf. Mit samftem L&auml;cheln erhob
ich mich. &quot;Ist Frau Seltvyl im Saal?&quot; Ich wu&szlig;te, da&szlig;
sie anwesend war und hatte ihre schmale Erscheinung bereits registriert.
Erstauntes Gemurmel. Richter Wermut schlug ungeduldig mit der Faust auf den
Tisch: &quot;Frau Seltvyl, kommen Sie bitte nach vorn.&quot; Die Leiterin
des Kinderhorts st&ouml;ckelte leicht schwankend durch den Mittelgang.
Verunsicherung stand in ihrem ohnehin blassen Gesicht. &quot;M&ouml;chten
sie zu der Sache Krummhold : Kramer eine Aussage machen?&quot; Z&ouml;gern.
Schlucken. Ihr Blick irrte unstet zwischen mir und Bruno hin und her.
&quot;Bitte antworten Sie mit einem eindeutigen Ja oder Nein.&quot; Sie
hauchte ein ja. &quot;Herr Kramer, stellen Sie Ihre Frage an die
Zeugin.&quot; &quot;Frau Seltvyl&quot;, begann ich mit belegter Stimme,
&quot;was hat Sie bewogen, das urspr&uuml;nglich Ihrem Kinderhort
zugesprochene Gel&auml;nde aus dem Nachla&szlig; der Frau Grundmoser
abzulehnen?&quot; Hilfe suchte ihr Blick bei Bruno. Dessen Kiefer malmten
an einem dicken Brocken. Dann schaute sie flehentlich in meine Richtung.
Ich signalisierte ihr Unnachgiebigkeit. &quot;Die Kinder&quot;, hauchte sie
vor sich hin. &quot;Bitte lauter, Frau Seltvyl&quot;, mahnte der Richter.
&quot;Die Kinder w&uuml;nschten keine Ver&auml;nderung&quot;, gab sie mit
br&uuml;chiger Stimme zu Protokoll. Und f&uuml;gte erg&auml;nzend hinzu:
&quot;Sie sind an die bisherige Unterbringung gew&ouml;hnt und jede
&Auml;nderung ihrer Umgebung &auml;ngstigt sie.&quot; Ich h&auml;tte
Schei&szlig;e schreien m&ouml;gen &uuml;ber diesen offensichtlichen Unsinn.
Von zehn, wenn nicht noch mehr Kindern wu&szlig;te ich, da&szlig; sie sich
schon riesig auf das Gel&auml;nde am Farnweiher gefreut hatten und nun
recht traurig waren. Ich schnaubte und Zorn stieg in mir hoch. Unter Zorn
neigte ich zur Unbesonnenheit. H&auml;tte auch beinah eine Schimpfkanonade
losgelassen. Karin tippte mir rechtzeitig auf die Wade. Ich beugte mich
kurz zu ihr runter. &quot;Frag sie, woher sie das Geld f&uuml;r ihr teurres
Modellkleid hat.&quot; Sieh mal an! Dieser Umstand war mir noch gar nicht
aufgefallen. Dem hohen Gericht offensichtlich ebenfalls nicht. Also fragte
ich danach und l&ouml;ste einen Sturm der Entr&uuml;stung bei Krummhold und
seinen Anh&auml;ngern aus. &Uuml;ber die kreidewei&szlig;en Z&uuml;ge der
Seltvyl scho&szlig; flammende R&ouml;te. &quot;Ich ... ich ...&quot;
Schweigen. Der Richter ermahnte sie, auszusagen oder die Antwort zu
verweigern. Letzteres w&uuml;rde allerdings als eine Aussage zu ihren
Ungunsten gewertet. &quot;Eine kleine Erbschaft hat mich in die Lage
versetzt&quot;, fl&uuml;sterte sie und mu&szlig;te das lauter wiederholen.
&quot;K&ouml;nnen Sie diese Aussage auf ihren Eid nehmen?&quot;, fragte
Richter Wermut streng. Schweigen. &quot;Frau Seltvyl, bitte geben Sie
Antwort, ob Sie Ihre Aussage bez&uuml;glich der Erbschaft auf Ihren Eid
nehmen k&ouml;nnen.&quot; Das Farbspiel auf dem Gesicht der Leiterin des
Kinderhorts wechselte mehrfach von bleich nach rot und umgehkerht. Dann
senkte sie den blick zu Boden und hauchte ein &quot;Nein&quot;. Wermut
ersparte ihr, dies lauter zu wiederholen. Der Richter wandte sich an mich:
&quot;Noch Fragen an die Zeugin?&quot; Ich bejahte und wollte wissen, wer
und in welcher H&ouml;he sie bestochen habe, die Annahme des
Farnweiher-Gel&auml;ndes abzulehnen. Wermut ging ungeduldig dazwischen und
meinte, das t&auml;te nichts zur Sache und w&uuml;rde durch eine weitere
Verhandlung noch ausgiebig ermittelt. Hier st&uuml;nde nur die
Verleumdungsklage zur Debatte. Kurze Beratung des Gerichts. Dann
Urteilsspruch. Die Klage wurde abgewiesen. Wir atmeten auf. </p>

<p>F&uuml;r Krummhold und seine Spie&szlig;gesellen brachen schwere Zeiten
an. Im Vorfeld des Schmiergeld-Prozesses hatte er nichts zu lachen. Doch
sein B&uuml;rgermeisterstuhl wackelte heftigst. Kinder und Hunde liefen ihm
l&auml;rmend nach, sobald er sich auf der Stra&szlig;e blicken lie&szlig;.
Meist ging er nur unter Bedeckung aus. F&uuml;r's Tageblatt gab es goldene
Zeiten. Der SchmiergeldSkandal f&uuml;llte t&auml;glich neue Seiten und der
Absatz unseres Blattes stieg enorm. </p>

<p>Wie das alles endete? Nun - wie schon? Wie das Hornberger
Schie&szlig;en. Die Frist bis zur n&auml;chsten Verhandlung war lang genug,
alle belastenden Beweismittel zu f&auml;lschen oder zu vernichten. Selbst
Frau Seltvyl kippte noch einmal um und sagte falsch aus. Ihr neues Kleid
von Dior stand ihr allerdings gut zum bleichen Taint. Die Chemiefabrik ist
errichtet und hat der Gemeinde volle Steuerkassen beschert. Ein Teil des
Naturschutzgel&auml;ndes ist abgeholzt und gerodet. Dort werden bald neue
Werkhallen errichtet, was eine weitere Produktionssteigerung verspricht.
Leider aber durch Einsatz modernster Maschinen keine Einstellung
ortsans&auml;ssiger Arbeitskr&auml;fte, wie zuerst versprochen.
Naturschutz? Wer fragt schon danach? Nur Spinner und Greenpisser. Auch
M&uuml;sliman Distler schl&auml;ft sanft und friedlich auf seinem guten
Gewissen. Schlie&szlig;lich wurden auf seine Initiative Fr&ouml;sche und
Kr&ouml;ten des Farnweihers umgesiedelt. </p>

<p>Bruno Krummhold? Der ist schon l&auml;ngst nicht mehr
B&uuml;rgermeister. Die Niederlage bei der ersten Verhandlung hat ihm das
Genick gebrochen. Er unterh&auml;lt nun eine Kneipe in Holtum. Ich trank
neulich ein Bier an seiner Theke. Er spricht wieder mit mir. Seine
Einstellung zu der Nachla&szlig;geschichte hat sich um einhundertachtzig
Grad gedreht. Schimpft wie ein Rohrspatz auf bestechliche Beamte. Tja, ein
wenig sp&auml;t, was? </p>
        
<p>(c) J. Weidner, Bonn September 2002 </p>
        
</td>
</tr>
</tbody>
</table>
<br>
</body>
</html>
