<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Adobe GoLive 4">
		<title>Pelit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Boulder Dash 3D</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Petteri Bamberg &lt;<a href="mailto:piibii@hotmail.com">piibii@hotmail.com</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kaikki C64-veteraanit muistanevat Boulder Dashin, jossa pieni ukkeli kaivoi tunneleita ja ker&auml;si timantteja samalla varoen erilaisia vihollisia ja niskaan putoilevia kivi&auml;. Alkuper&auml;inen Boulder Dash on t&auml;h&auml;n menness&auml; ker&auml;nnyt kunnioitettavan m&auml;&auml;r&auml;n erilaisia j&auml;ljitelmi&auml; koneelle kuin koneelle. Tuhansien ja taas tuhansien Boulder Dash -kloonien joukosta l&ouml;ytyy onneksi my&ouml;s massasta erottuvia helmi&auml;, kuten juuri Boulder Dash 3D.
						<center>
							<p><img height="240" width="272" src="kuvat/boulder_1.jpg" border="0"></center>
						<p>Boulder Dash 3D:n kolmiulotteisuus n&auml;kyy jo heti alkudemossa, jossa esitell&auml;&auml;n pehme&auml;sti liikkuvaa tekstuurimapattua vektorikaupunkia. Taustalla n&auml;kyy kaunis auringonlasku, ja jopa auringon &quot;kameraan&quot; tekem&auml;t l&auml;pikuultavat valons&auml;teet n&auml;kyv&auml;t. Kyseist&auml; esityst&auml; katsoo muutaman minuutin mielikseen, kunnes sitten tekee jo mieli kokeilla itse peli&auml;. Mik&auml;li malttoi katsoa alkudemon loppuun, on edess&auml; valikko, josta p&auml;&auml;see galleriaan, pelaamaan tai elokuviin. Galleriassa ovat n&auml;ytill&auml; kaikki peliss&auml; olevat objektit sek&auml; selostukset niiden toiminnasta ja tarkoituksesta. Elokuvissa p&auml;&auml;see katsomaan kahden pelaajan valmiiksinauhoitettua kaksintaistelua eri kuvakulmista.</p>
						<center>
							<p><img height="240" width="272" src="kuvat/boulder_3.jpg" border="0"></center>
						<p>BD3D:n nykyaikainen pelaaja ei en&auml;&auml; k&auml;yt&auml; jalkojaan liikkumiseen, vaan sen sijaan astuu sis&auml;&auml;n avaruusalusta muistuttavaan h&ouml;k&ouml;tykseen ja kaasuttelee timantteja etsim&auml;&auml;n. Timantteja l&ouml;ytyy joko sellaisenaan tai kivien sis&auml;&auml;n k&auml;tkeytyneen&auml;. Timantin saa erotettua kivest&auml; tipauttamalla sen reunan yli maahan, jolloin se hajoaa paljastaen timantin.</p>
						<center>
							<p><img height="240" width="272" src="kuvat/boulder_2.jpg" border="0"></center>
						<p>Pelialuetta kolutessa t&ouml;rm&auml;&auml; erilaisiin esteisiin, jotka joko verottavat energiaa tai ovat muuten vain harmiksi. T&auml;llaisia ovat esim. timantteja varastelevat ravut ja mehil&auml;iset, plasmatykit, jotka ampuvat hehkuvia palleroita pelaajaa kohti, sek&auml; piikkipallot. Pelialueella lojuu my&ouml;s hy&ouml;dyllisi&auml; tavaroita, kuten v&auml;liaikainen suojakilpi, lentokyvyn antava rakettireppu sek&auml; pommeja, joilla saa r&auml;j&auml;ytetty&auml; kivi&auml; (tai halutessaan my&ouml;s vihollisia). Kun tarpeellinen m&auml;&auml;r&auml; timantteja on ker&auml;tty, aukeaa tiettyyn paikkaan tasoa exit, johon itsens&auml; tunkemalla teleporttautuu seuraavaan tasoon.</p>
						<p>Boulder Dash 3D ei vaadi koneelta paljon. Jo muistikortillisella A1200:lla BD3D on melko nopea jopa t&auml;ysruudulla pelattaessa. Ja ihmek&ouml;s tuo, sill&auml; peli k&auml;ytt&auml;&auml; Alien Breed 3D:st&auml; tuttua 2x2-pikselikokoa. Onneksi pelin nopeus kompensoi grafiikan ep&auml;tarkkuutta, eik&auml; siihen pelattaessa tule kiinnitt&auml;neeksi huomiota. Pelin kokonaiseen versioon kuitenkin lupaillaan tarkempia n&auml;ytt&ouml;tiloja tehokkaammille koneille.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekij&auml;:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Szymon Ulatowski</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Demoversio:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://ftp.sunet.se/~aminet/dirs/aminet/game/demo/boulderdash3d.lha">Aminet</a> (592 kt)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
					<td width="50%" bgcolor="#d8ecfd">68020+, AGA, 1,5 Mt muistia, Kickstart 3.0+</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Amiga 1200, 2 Mt Chip, 4 Mt Fast, 85 Mt kiintolevy</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Grafiikka:</font></td>
					<td width="50%" bgcolor="#d8ecfd">80%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">&Auml;&auml;net:</font></td>
					<td width="50%" bgcolor="#d8ecfd">87%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Pelattavuus:</font></td>
					<td width="50%" bgcolor="#d8ecfd">84%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Kiinnostavuus:</font></td>
					<td width="50%" bgcolor="#d8ecfd">77%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Yleisarvosana:</font></td>
					<td width="50%" bgcolor="#d8ecfd">85%</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
