<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Pelit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Max Rally</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Valtteri Murto</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<br>
							<img height="125" width="125" src="kuvat/maxrally_1.jpg" border="0"></center>
						<p>Amigisteja on jo ammoisista ajoista alkaen siunattu mit&auml; erilaisimmilla autopeleill&auml;. Nimet kuten Stunt Car Racer, Lotus 2, Nitro ja XTreme Racing ovat k&auml;sitteit&auml;: pelej&auml;, joiden kanssa jokainen meist&auml; on varmasti viett&auml;nyt illan jos toisenkin. Niinp&auml; my&ouml;s englantilaisen Fortressin Max Rallyyn kohdistuivat ainakin omalta osaltani suuret odotukset.</p>
						<p>Max Rally toimitetaan harhauttavan n&auml;k&ouml;isesti cd-kotelossa kahdella levykkeell&auml;. Py&ouml;ri&auml;kseen peli ei vaadi juuri mit&auml;&auml;n, megainen Amiga levyasemalla riitt&auml;&auml;. Peli asentuu vaivatta my&ouml;s kiintolevylle ja my&ouml;s toimii hyvin, kunhan muistia on yli kolme megatavua. Moniajoa peli ei tue. Pelaajia voi laitteistoista riippuen olla yhdest&auml; nelj&auml;&auml;n, ja my&ouml;s kahden Amigan liitt&auml;minen toisiinsa on mahdollista.</p>
						<p>Peliss&auml; on mukana 30 erilaista rataa, jotka on luokiteltu vaikeusasteen mukaan t&auml;hdill&auml; yhdest&auml; viiteen. Erilaisina teemoina ovat mm. tavanomaiset mets&auml;, avaruus ja formularata. Mit&auml;&auml;n revolution&auml;&auml;rist&auml; ratasuunnittelun kukkasta on valikoimasta turha hakea, radat ovat mit&auml; suurimmassa m&auml;&auml;rin muunnelmia tutuista ellipsi- ja kahdeksikkoteemoista. Oman vivahteensa tosin tuovat erin&auml;iset erikoisradat, joissa ajetaan alati l&auml;hestyv&auml;&auml; ruudun alareunaa karkuun erilaisten kuilujen ja porttien l&auml;pi. Mielenkiintoisia, mutta vaikeita.</p>
						<center>
							<p><img height="124" width="159" src="kuvat/maxrally_2.jpg" border="0"></p>
						</center>
						<p>Pelaajalla on valittavissa yksi kuudesta hahmosta, jotka voi halutessaan nimet&auml; my&ouml;s itse. Manuaalin mukaan ajajien autot k&auml;ytt&auml;ytyv&auml;t eri tavalla, mutta itse en ainakaan huomannut mit&auml;&auml;n eroja autojen v&auml;lill&auml;; vastustajien autot ajavat rypp&auml;&auml;ss&auml; rataa ymp&auml;ri sen kummempia t&ouml;peksim&auml;tt&auml;.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Moni kakku p&auml;&auml;lt&auml; kaunis...</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">P&auml;&auml;moodissa, &quot;Championship&quot;, tulee pelaajan voittaa jokainen rata p&auml;&auml;st&auml;kseen mestariksi. Voitottomia kisoja saa olla korkeintaan viisi, sen j&auml;lkeen on peli auttamattomasti ohi. Tallennusmahdollisuuksia peli ei tunne, eik&auml; salasanoistakaan ole tietoakaan. Koko peli on siis tahkottava kerralla l&auml;pi.
						<center>
							<p><img height="129" width="159" src="kuvat/maxrally_3.jpg" border="0"></p>
						</center>
						<p>Ei ehk&auml; kuulosta pahalta t&auml;m&auml;n luokan peliss&auml;, mutta kun jokaisessa kisassa on ajettava 12 kierrosta, alkaa pinna palaa viimeist&auml;&auml;n nelj&auml;n kisan j&auml;lkeen. Vastustajat kiert&auml;v&auml;t samoja ajolinjoja pitkin tymp&auml;&auml;nnytt&auml;vi&auml; ratoja, ja pahimmassa tapauksessa yhden virheen j&auml;lkeen on peli menetetty, vaikka kierroksia olisi j&auml;ljell&auml; viel&auml; kymmenen.</p>
						<p>Toinen hyvin &auml;rsytt&auml;v&auml; asia ovat pelin &auml;&auml;net. Valikkomusiikki on kamalan ep&auml;vireist&auml; tracker-vingutusta, ja autot kuulostavat silt&auml; kuin naapurissa raiskattaisiin ompelukonetta. Asetuksista voi s&auml;&auml;t&auml;&auml; valikoihin musiikin tai &auml;&auml;niefektit, mutta kaikkein t&auml;rkein asetus puuttuu kokonaan: &auml;&auml;net pois.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Ei niin pahaa, ettei jotain hyv&auml;&auml;kin</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<br>
							<img height="129" width="159" src="kuvat/maxrally_4.jpg" border="0"></center>
						<p>Grafiikoiltaan peli on hyv&auml;&auml; keskitasoa. Taustoissa on muutamia ihan n&auml;pp&auml;ri&auml; yksityiskohtia, ja valikkografiikatkin menettelev&auml;t. Autot tosin ovat t&auml;ysin animoimattomia p&ouml;lkkyj&auml;, joista ei aina kunnolla erota edes keulaa. Autojen ohjaus toimii my&ouml;s ihan hyvin, vaihtoehtoina perinteiset n&auml;pp&auml;imist&ouml; ja joystick.</p>
						<p>Voi olla, ett&auml; odotin pelilt&auml; ehk&auml; hieman liikaa, mutta Max Rallyst&auml; j&auml;&auml; suuhun hieman juosten kustun maku. Tekij&auml;t ovat ymp&auml;nneet mukaan yht&auml; sun toista pikkunippeli&auml; aina turboista hyppyreihin ja komeista hypyist&auml; saataviin &quot;boosteihin&quot;, mutta liian monet perusasiat ovat p&auml;&auml;sseet unohtumaan. T&auml;llaisenaan pelist&auml; nauttii ehk&auml; illan tai kaksi, jonka j&auml;lkeen palaa Aikaron ja kumppanien seuraan Xtreme Racingin pariin.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekij&auml;:</font></td>
					<td bgcolor="#d8ecfd"><a href="http://www.allcomm.co.uk/~fortress/">Fortress Software</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Levitt&auml;j&auml;:</font></td>
					<td bgcolor="#d8ecfd"><a href="http://www.csande.co.uk">Crystal Software &amp; Electronics</a> toimitti testikappaleen my&ouml;s Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:lle. Kiitos!</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Demoversio:</font></td>
					<td bgcolor="#d8ecfd"><a href="http://www.allcomm.co.uk/~fortress/download/maxdemo.lha">592 kt</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
					<td bgcolor="#d8ecfd">1 Mt (3 Mt kiintolevylle asentamiseksi)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Pelaajia:</font></td>
					<td bgcolor="#d8ecfd">1-4 (tukee jaettua n&auml;ytt&ouml;&auml; sek&auml; koneiden linkitt&auml;mist&auml;)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Grafiikka:</font></td>
					<td bgcolor="#d8ecfd">80%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">&Auml;&auml;net:</font></td>
					<td bgcolor="#d8ecfd">45%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Pelattavuus:</font></td>
					<td bgcolor="#d8ecfd">65%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Kiinnostavuus:</font></td>
					<td bgcolor="#d8ecfd">50%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Yleisarvosana:</font></td>
					<td bgcolor="#d8ecfd">62%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Muiden arvioita:</font></td>
					<td bgcolor="#d8ecfd">Amiga&nbsp;Format 80%, Amiga&nbsp;Flame 80%, Amiga&nbsp;Nutta&nbsp;82%, Amiga&nbsp;MAX&nbsp;81% sek&auml; Amiga&nbsp;Information&nbsp;Online&nbsp;88%.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>

