<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Pelit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Space Rogue - er&auml;&auml;n pelin tarina</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Esa Lyttinen &lt;<a href="mailto:virgo@vip.fi">virgo@vip.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<img height="78" width="243" src="kuvat/spacerogue_logo.jpg" border="0"></center>
						<p>Hamasta menneisyydest&auml; ilmestyi korppu, joka sis&auml;lsi aikoinaan Jukka Tapanim&auml;en MikroBitiss&auml; arvosteleman pelin. Silloin aikojen alussa kalustooni kuului vain 1 MHz:n tasolla hyrr&auml;&auml;v&auml; megasuosittu multimediatykki, joka vaivoin pystyi ruudulle taikomaan 3D-piirins&auml; avulla fillatuja avaruustaisteluja ja niiden lis&auml;n&auml; roolipelim&auml;ist&auml; ulottuvuutta: juonittelua, kiristyst&auml;, hirvi&ouml;it&auml;, sekop&auml;it&auml;, rakastuneita robotteja ja kaikkea, mit&auml; ihmismieli saattoi kuvitella l&ouml;yt&auml;v&auml;ns&auml; loputtoman universumin syvyyksist&auml; - kaikkea sit&auml;, mik&auml; tuntui puuttuvan Eliten t&auml;ydellisyydest&auml;.</p>
						<p>Ainoa asia, joka esti pelaamasta kyseisen pelin l&auml;vitse sen ostamisen j&auml;lkeen, oli edell&auml;mainitun multimediakoneen mielett&ouml;m&auml;n hidas lerppuasema - sit&auml; sahattiin alituiseen, mik&auml; rikkoi pahasti illuusion haaveiden universumista. Paketti levyineen p&ouml;lyyntyi kaappien hyllyill&auml; aikansa lukuunottamatta muutamia ep&auml;toivoisia yrityksi&auml; upottaa sen koodiin p&auml;ivitykset levyasema-ajureihin.</p>
						<center>
							<p><img height="200" width="319" src="kuvat/spacerogue.jpg" border="0" alt=" "></p>
						</center>
						<p>Ajat vieriv&auml;t, ja takaraivossa pysyi muistikuva t&auml;st&auml; unohtumattomasta paikasta jossain avaruuden &auml;&auml;riss&auml;. T&auml;m&auml; maaginen paikka avautui minulle vasta vuosien p&auml;&auml;st&auml; kuultuani kaveriltani toisenlaisen moduulin pystyv&auml;n upottamaan kyntens&auml; pelin sisuksiin ja p&auml;ivitt&auml;m&auml;&auml;n levyaseman 10x-nopeuteen. Onneksi kyseinen moduuli l&ouml;ytyi samasta paikasta kohtuullisen rahasumman vastikkeeksi.</p>
						<p>Lopultakin p&auml;&auml;sin pelaamaan ilman hermojaraastavia taukoja. Muutamien viikkojen j&auml;lkeen sain kaveriporukan avustuksella selvitetty&auml; imperiumin salaisuudet, joiden turvin lopullinen l&auml;pimurto toiseen galaksiin oli saavutettu. T&auml;m&auml;n pitk&auml;n session j&auml;lkeen kului monta viikkoa selvitell&auml;, mit&auml; oikeastaan oli tapahtunut. Kaverini kanssa vertailimme kokemuksiamme ja huomasimme, ettei tarina aina mennyt saman kaavan mukaisesti. Olin kuitenkin niin uupunut edellisest&auml;kin, etten jaksanut aloittaa alusta.</p>
						<p>Pelin arvostelussa oli maininta my&ouml;s Amiga-version julkistamisesta joskus. Toistuvista yrityksist&auml; huolimatta en kyseist&auml; versiota koskaan l&ouml;yt&auml;nyt. Tiet&auml;&auml;kseni sit&auml; ei muutamia harvoja erehdyksi&auml; lukuunottamatta Suomeen eksynyt. Kuitenkin er&auml;&auml;n&auml; p&auml;iv&auml;n&auml; istuin korppu k&auml;dess&auml;ni, ja toive siit&auml;, ett&auml; se sis&auml;lt&auml;isi kyseisen pelin, oli toteutumassa. J&auml;nnityksest&auml; nihkein k&auml;sin k&auml;ynnistin koneeni. Bootti ei selv&auml;stik&auml;&auml;n onnistunut, koska A1200:n kiintolevy alkoi iloisesti rouskuttaa normaalia k&auml;ynnistysrutiiniaan. Odottava tunnelma notkahti hieman: oliko disu aikansa el&auml;nyt?</p>
						<p>Lopulta kiintolevyni hiljeni aukaistuaan WB:n. Levyke n&auml;kyi kuin n&auml;kyikin siell&auml;: Space Rogue! Yes! Lopultakin todellista taistelua avaruuden herruudesta, nopeaa 3D-toimintaa... Kaikki t&auml;m&auml; oli liian t&auml;ydellist&auml; ollakseen totta, ajattelin ja k&auml;ynnistin pelin. Alkuintro toimi hienosti. Jatkoin innoissani itse peliin. Se toimi ja kaikki oli kuten ennenkin, paitsi ett&auml; alukset liikkuivat paljon siistimmin. 060:n avustuksella p&auml;&auml;sin aivan muihin ulottuvuuksiin kuin vanhalla koneellani. T&auml;st&auml; alkaa seikkailu...</p>
						<p>Mutta miten sitten k&auml;vik&auml;&auml;n? Ilo muuttui hersyv&auml;ksi nauruksi astuessani ensimm&auml;ist&auml; kertaa avaruusaseman liukuovista sis&auml;&auml;n. Mr. Avaruusmies oli ajan saatossa ilmeisesti unohtanut rakettireppunsa p&auml;&auml;lle, koska &auml;ij&auml; kiisi aseman k&auml;yt&auml;v&auml;&auml; &auml;lyt&ouml;nt&auml; kyyti&auml;. Oli miltei mahdotonta saada kontrollia niin nopeaan liikkumiseen. Toinen samanlainen ongelma ilmeni heti per&auml;&auml;n kohdattuani avaruudessa vihamielisen rosvoporukan, joka listi kokelaan seisaalleen triplahyperturboaseillaan - sarjatulen nopeus oli sit&auml; luokkaa, ettei pelaajalla ollut v&auml;h&auml;isint&auml;k&auml;&auml;n mahdollisuutta vastustajansa kanssa. Taistelusta hengiss&auml; selvi&auml;minen oli mahdotonta.</p>
						<p>T&auml;st&auml; seurasi selke&auml;sti pelikoneen vaihto tuttuun ja turvalliseen CDTV:hen, jonka 7 MHz:n &quot;nopeus&quot; taatusti laskisi pelaajan vaatimustasoa rankasti alasp&auml;in - ja n&auml;in k&auml;vi. Totuuden nimiss&auml; pit&auml;&auml; kyll&auml; mainita, etti nopeus en&auml;&auml; p&auml;&auml;t&auml; huimannut - oikeastaan jopa alkuper&auml;inen (se megahertsinen) kone ylt&auml;&auml; nopeampaan 3D-osuuteen. Samaan, jopa hitaampaan, pystyy A1200-normaalikokoonpanolla. Luultavasti peli on koodattu Amigan omalla Basic-ohjelmalla (joka on tunnettu ominaisuuksistaan kuten sen valmistajakin). Nopeammilla koneilla kun s&auml;&auml;t&auml;&auml; cachet ym. oikein kohdalleen, pystyy pelist&auml; nauttimaan t&auml;ysin siemauksin. Ja jos joku el&auml;ttelee toiveita multiuser-verkkopelin tekemisest&auml;, niin t&auml;ss&auml;p&auml; olisi oiva idea.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
