<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Neues zum AmigaNG
-----------------

1. Neues Executive Update von AMIGA-Pr&auml;sident Bill McEwen

»EXECUTIVE UPDATE

Liebe Amiga-Familie:

Nun haben wir den November 2000, elf Monate, nachdem wir das Ruder von 
AMIGA &uuml;bernommen haben. Wir haben einiges ge&auml;ndert, was in unseren 
urspr&uuml;nglichen Pl&auml;nen stand, und wir bem&uuml;hen uns immernoch sehr, unsere 
Visionen voran zu treiben.

Innerhalb der n&auml;chsten beiden Wochen wird das n&auml;chste neue Produkt von 
AMIGA ausgeliefert werden - Amiga OS 3.9! Dieses Erzeugnis wurde ganz 
besonders f&uuml;r eine Gruppe entwickelt - f&uuml;r Sie, die Amiga-Familie! Wir 
haben bei der Entwicklung dieses gro&szlig;artigen Produkts, auf das Sie alle 
sehr stolz sein werden, sehr eng mit Haage & Partner zusammen gearbeitet.

Wird es je eine Version 4.0 geben? Das h&auml;ngt wirklich von den 
Verkaufszahlen des OS 3.9 ab. Verstehen Sie bitte, wir hatten keinerlei 
Pl&auml;ne f&uuml;r eine weitere Version des Classic-OS. Aber wir erhielten immer 
wieder Nachfragen, und weil wir auf die Gemeinschaft h&ouml;ren, entschlossen 
wir uns, mit Haage & Partner das Projekt in Angriff zu nehmen. Wenn sich 
das OS 3.9 gut verkauft und wir daraus einen Bedarf erkennen, f&uuml;r die 
bestehende Classic-Plattform weiter zu entwickeln, dann ist mit gro&szlig;er 
Wahrscheinlichkeit eine Version 4.0 zu erwarten.

Es liegt in Ihren H&auml;nden!

Aber ganz gleich, was immer auch geschieht, AmigaDE entwickelt sich schnell 
und wir erwarten die Auslieferung einer weiteren Version des Amiga Software 
Development Kit (SDK) mit neuen Eigenschaften und Verbesserungen. In den 
n&auml;chsten Wochen wird AmigaDE 3D und Sound erhalten.

Bei AMIGA geschehen viele erstaunliche Dinge und ich hoffe, Ihnen allen die 
gro&szlig;artigen Einzelheiten und Ank&uuml;ndigungen im Dezember in K&ouml;ln in 
Deutschlamd mitteilen zu k&ouml;nnen. Ich erwarte, Sie alle dort bei der Amiga 
World Verkaufsausstellung zu treffen. Bringen Sie doch einen Freund mit!

Ich freue mich auf einen gro&szlig;artigen Besuch in K&ouml;ln und w&uuml;nsche uns allen 
eine wundersch&ouml;ne Weihnachtszeit,

Bill McEwen und die &uuml;brige AMIGA-Mannschaft.«

Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
(Quelle des Originals: AMIGA, Inc.)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
