<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Neuigkeiten von der Amiga Arena

Amiga Arena (http://online-club.de/~ARENA/) informiert:

틻miga Arena News
(04.11.2000)

Amiga Arena Sonderpreis Aktion
Apano Sin und Turbo Racer 3D

Die Amiga Arena erm&ouml;glicht in zusammenarbeit
mit Alfred Kn&ouml;tig (Alfs Corner) eine neue Sonderpreis Aktion!
Exklusiv kann Apano Sin - Der Classic Shooter zum
Sonderpreis von 45 DM &uuml;ber die Amiga Arena bestellt
werden.
Apano Sin ist ein Classic Automatenshooter der urspr&uuml;nglich 1993 f&uuml;r
die ECS Rechner entwickelt wurde.Die Entwicklung wurde aber
eingestellt und zur Amiga Messe in Neuss konnte Alfred K. 
dann endlich die Final Version pr&auml;sentieren,
nachdem er die Entwicklung und den Vertrieb &uuml;bernommen hatte.
Apano Sin ist auf allen Amiga Modellen lauff&auml;hig und nur auf Disk
erh&auml;ltlich.
Ein Installer ist in vorbereitung und somit bald erh&auml;ltlich!

Ein Preview von Apano Sin ist Online!

Turbo Racer 3D  - Das Voxel Rennspiel Version 1.5
Die 10 letzten im Handel erh&auml;ltlichen Orginal CDs
mit Box des Rennspiels Turbo Racer 3D k&ouml;nnen &uuml;ber
die Amiga Arena f&uuml;r 15 DM bestellt werden!

Turbo Racer 3D ist ein Voxel Rennspiel
in der art von "Flyin High"!
Turbo Racer 3D AGA Processor 68020-68060 mit 4 MB Fast
Dieses sind die letzten im Handel erh&auml;ltlichen
Orginal Verkausversionen 1.5

Weitere Infos im bereich "Aktionen"!

Ein Interview mit Alfred K. und weitere Infos &uuml;ber Zuk&uuml;nftige
Entwicklungen folgt!

Diese Sonderpreise sind exklusiv nur &uuml;ber die Amiga Arena mit dem dort
erh&auml;ltlichen Bestellschein erh&auml;ltlich!

틻miga Arena News
(07.11.2000)

Amiga Arena Sonderpreis Aktion
GeoWorld V1.12 kann jetzt schon zum Sonderpreis
in der Amiga Arena bestellt werden.
In zusammenarbeit mit Beer Productions erm&ouml;glicht
die Amiga Arena einen Sonderpreis f&uuml;r die neue
Version von GeoWorld die bis zum Wochenende erscheinen wird.
Der Textumfang (Geschichtsdaten etc) im Update
umfasst schon alleine fast 400 Kbyte.
GeoWorld ist das Erdkundeprogramm f&uuml;r den Amiga was
stetig weiterentwickelt und gepflegt wird.

틻miga Arena News
(11.11.2000)

Amiga Arena - Keeps The Flame Burning!
Die Amiga Arena freut sich, bekannt geben zu k&ouml;nnen das weitere Aktionen
bevorstehen.
Mit der Vollversion "Das Blaue Auge II" und zur
Zeit drei weiteren neuen Sonderpreisaktionen ist
dies nur der Vorgeschmack auf das was Euch
in den n&auml;chsten Tagen noch erwarten wird.
Bei allen Aktionen die, die Amiga Arena erm&ouml;glicht
vergisst bitte nicht dabei das es sich hier um eine
"NONE Profit" Homepage handelt die von mir alleine
und frei von Werbung betrieben wird.
Dabei m&ouml;chte Ich mich bei allen Usern bedanken
die,die Sonderpreise in Anspruch nehmen und die
Entwickler damit unterst&uuml;zen.
Wobei die Besucherzahlen und eingehenden
Registrationen bei den Entwicklern in keinem Verh&auml;ltniss
zueinander stehen!
Euer Olaf K.
 
Amiga Arena Vollversion Aktion
Die Amiga Arena pr&auml;sentiert das Rollenspiel
"Das Blaue Auge II - Die Schicksalss&auml;ge"
in der Uneingeschr&auml;nkten Vollversion!
Timo Kloss von Inutilis Software der zur Zeit das
Adventure "Ermentrud" entwickelt,hat exklusiv der
Amiga Arena sein Rollenspiel "Das Blaue Auge II"
als Vollversion zur verf&uuml;gung gestellt!

Amiga Arena Sonderpreis Aktion
In zusammenarbeit mit Bernhard Lindner erm&ouml;glicht
die Amiga Arena einen Sonderpreis f&uuml;r T.U.R.D. II.
Turd II ist die Relaisekarten Steuerungs Software
f&uuml;r den Amiga!
Es ist in der Lage 8-Kanal Relaiskarten an der
parallelen Schnittstelle,mit oder ohne Centronics-Protokoll,
anzusprechen und bietet verschiedene Steuerungsmethoden: Listen-,
Zeitplan-, Musik- und Zufallssteuerung and nat&uuml;rlich manuelle
Eingaben.

틻miga Arena News
(19.11.2000)

Amiga Arena - Sonderpreis Aktion!
In zusammenarbeit mit Christian Effenberger erm&ouml;glicht die Amiga Arena
exklusiv einen Sonderpreis f&uuml;r das Shareware Paket Siteway 1.0
Die Registrationsgeb&uuml;hr liegt bei 30 DM anstatt 80 DM!!

Siteway ist ein Softwarepaket was sich mit
integrietem Site- und Content -Managemt besch&auml;ftigt.
SiteWay soll folgende Eigenschaften besitzen:
* Datenbankbasiertes Layout- und Content-Managment.
* Automatische Erzeugung von WebSites nach zu bestimmenden Regeln und
  Inhalten.
* Automatische Erzeugung der Navigationen nach zu bestimmenden Regeln.
* Automatische Konvertierung f&uuml;r Webgerechte Datei-Formate.
* Globale und Lokale Formate, Regeln und Inhalte.
* Templates (Vorlagen) f&uuml;r alle relevanten Bereiche.
* Vorgefertigte Templates und Default-Klassen.
* Komplexer Template-Editor.
* Zentrale oder Dezentrale Verwaltung aller Resourcen.
* Erhaltung der Originale aller Resourcen.
* Vollst&auml;ndige Projektverwaltung.
* Intuitiv zu bedienende GUI.
* Funktionserweiterungen mittels externer Programme per DOS und/oder ARexx.

Das Programmpaket ist sehr Umfangreich,weitere Infos in der Amiga Arena!

틻miga Arena News
(25.11.2000)

Amiga Arena - In Union We Stand!
Liebe Amiga Freunde es ist soweit die Amiga Arena m&ouml;chte sich bei allen
Usern f&uuml;r Ihren besuch in der Amiga Arena bedanken f&uuml;r das Jahr 2000 und 
verlost als dankesch&ouml;n zahlreiche Amiga Goodies sowie die Amiga Arena CD 
Rom Edition.
Um auch weiterhin aktiv zu bleiben ist in diesem Zusammenhang eine kleine
Umfrage Online!
Unter allen Teilnehmern werden folgende Preise Verlost!

Amiga Arena Preise
5 * 1 Amiga Arena CD Rom (Erstauflage)
3 * 1 Amiga Krawatten Clip
3 * 1 paar Amiga Kn&ouml;pfe
3 * 1 Amiga Kugelschreiber
3 * 1 Poster "Keep the momentum going"
3 * 1 Poster "Back to the Future"
1 * 1 Amiga Feuerzeug

Die Amiga Arena bedankt sich ganz herzlich bei
Andreas Magerl vom APC&TCP der die Amiga Arena CD
Rom Edition zur Verf&uuml;gung gestellt hat und bei Petro
Tyschtschenko f&uuml;r die Amiga Goodies!
  
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
