<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Abschlie&szlig;end
------------

Das war's dann wohl...

...f&uuml;r dieses Jahr. Wieder sind (beinahe) zw&ouml;lf Monate vergangen, in denen 
kein neuer Amiga erschienen ist. Auch jetzt werden wieder etliche Amiga-
User das &uuml;bliche Ritual abhalten und sich sagen: Wenn es n&auml;chstes Jahr 
nicht klappt, ist der Zug endg&uuml;ltig abgefahren - wie sie das auch schon 
Ende 1999, 1998, 1997, 1996 und 1995 prophezeit hatten. Mit einem 
Unterschied: Diesmal werden sie Recht behalten, diesmal hei&szlig;t es wirklich 
"hopp oder topp". 

Wenn innerhalb der n&auml;chsten zw&ouml;lf Monate das AmigaDE nicht in einer 
Endanwenderversion erscheint (oder aber es die hochgesteckten Erwartungen 
der User entt&auml;uscht), wird damit die allerletzte Chance auf einen Amiga-
Neuanfang verspielt sein.

Denn der Markt wird bis dahin weiter schrumpfen. Ich wei&szlig;, es gibt kaum 
noch Firmen, die f&uuml;r den Amiga entwickeln - aber denen, die bis jetzt 
ausgeharrt haben, wird auch irgendwann die Puste ausgehen - und das wird, 
wenn man sich mal die Verkaufszahlen heutiger Amiga-Software vor Augen 
h&auml;lt, ganz sicher nicht erst in ein paar Jahren der Fall sein.
Zudem schl&auml;ft auch die Konkurrenz nicht. AMIGA ist nicht das einzige 
Unternehmen, das ein Betriebssystem mit Hardwareunabh&auml;ngigkeit auf 
Bin&auml;rebene auf den Markt bringen will. Also ist Eile angesagt.

Aber ich bin und bleibe Optimist. Zwar nicht, was die von Eyetech geplanten 
PowerPC-Erweiterungen betrifft, an deren Erscheinen ich - es m&ouml;ge mir 
verziehen werden - nicht so recht glauben mag, aber doch bez&uuml;glich des 
AmigaDE - und das ist die Hauptsache. Denn wenn das neue OS erst mal f&uuml;r 1 
Prozessorsystem erfolgreich auf den Markt gebracht wurde, wird es nicht 
lange dauern, bis auch andere CPU-Reihen unterst&uuml;tzt werden.

Somit sollten sich auch die treuen PowerPC-Fans nicht prim&auml;r die Frage 
stellen, wann das AmigaDE in einer PowerPC-Version erscheint, sondern wann 
es &uuml;berhaupt kommt.

Damit w&uuml;nsche ich euch allen ein frohes Weihnachtsfest und einen guten 
Start ins Jahr 2001.


Bis n&auml;chsten Monat,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
