<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Vorwort (mit R&uuml;ckblick auf den vergangenen Monat)
-------------------------------------------------

+++ AmigaOS 3.9 erscheint in wenigen Tagen auf der World of Amiga +++

Willkommen damit zur neuen Ausgabe von AMIGA aktuell.

Zun&auml;chst eine wichtige Information/Anfrage in eigener Sache: Andreas 
Falkenhahn kann sich leider aus zeitlichen Gr&uuml;nden ab der kommenden Ausgabe 
nicht mehr um den AMIGA-aktuell-Spieleteil k&uuml;mmern. Deshalb suchen wir 
dringend einen Nachfolger. Wer interessiert sich f&uuml;r Amiga-Spiele, kennt 
sich in diesem Bereich etwas aus und m&ouml;chte festes Redaktionsmitglied von 
AMIGA aktuell werden? Schreibt bitte an aakt@aakt.de

Nun noch ein paar Worte zum Ausscheiden von Andreas: Seit nun mehr zwei 
Jahren hat Andreas Monat f&uuml;r Monat den Spieleteil erstellt und in dieser 
Zeit unz&auml;hlige News verfasst und etliche Spiele getestet. Damit hat AMIGA 
aktuell ihm sehr viel zu verdanken.
Andreas, das gesamte Team w&uuml;nscht dir f&uuml;r die Zukunft alles Gute. Und wer 
wei&szlig;, vielleicht k&ouml;nnen wir ja ab und zu mal mit einem Gastbeitrag von dir 
rechnen?


Aber kommen wir zum Allmonatlichen: Der November verlief sehr ruhig und 
ohne gr&ouml;&szlig;ere Neuigkeiten. Die wird es aber in wenigen Tagen geben. Denn 
dann findet in K&ouml;ln die Messe »World of Amiga« statt, auf der der 
Startschuss zum Verkauf der neuen AmigaOS-Betriebssystemversion 3.9 f&auml;llt. 
Mehr Informationen zur WoA und zum AmigaOS-Update findet ihr in dieser 
Ausgabe von AMIGA aktuell.


Zu den regelm&auml;&szlig;igen Aufrufen:
    
* An dieser Stelle eine Bitte: Jeder Artikelschreiber freut sich &uuml;ber       
  Lob, aber auch &uuml;ber konstruktive Kritik, und wird durch sie motiviert.    
  Scheut euch also bitte nicht, eure Meinung zu den verschiedenen Beitr&auml;gen  
  zu &auml;u&szlig;ern, entweder, indem ihr direkt an die Autoren schreibt, oder aber  
  an AMIGA aktuell (aakt@aakt.de).

* Wir suchen st&auml;ndig Mitarbeiter, die regelm&auml;&szlig;ig, unregelm&auml;&szlig;ig oder         
  einmalig Beitr&auml;ge zu AMIGA aktuell beisteuern wollen. Inhaltlich sind     
  einer Mitarbeit kaum Grenzen gesetzt. Wer Interesse hat, sollte sich      
  an aakt@aakt.de wenden.


Viel Spa&szlig; jetzt bei dieser Ausgabe,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
