



<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Amiga strikes back!!</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="GREEN">Amiga auch in Zukunft?
Ja!</FONt></h1></CENTER></P>

Immer wieder h&#246;re ich von Usern (auch in der NoCover), da&#223; der Amiga
heutzutage zu nichts mehr nutze sei und man doch lieber auf einen PC
umschwenken sollte. Dazu habe ich mir mal einige Gedanken gemacht, die den
Amiga in einem ganz anderen Licht erscheinen lassen und garantiert jedem PC
&#252;berlegen macht.</P>

Man stelle sich mal folgendes vor: Man kauft sich eine PPC G4 Karte samt
entsprechender NG GraKa von Phase 5 und hat erstmal jede Menge Geld
verloren. Viele werden jetzt damit argumentieren, da&#223; sich diese Investition
f&#252;r die Handvoll Programme, die bereits existieren, nicht lohnt. Ok, dem
stimme ich zwar nicht voll zu, aber einen wahren Kern hat diese Aussage allemal.
Trotzdem l&#228;&#223;t sich mit einer PPC Karte viel anfangen: Zum ersten hat man
die oben erw&#228;hnte Amiga Software, die im groben alle Bereiche ausreichend
abdeckt. Angeblich sei aber das Softwareangebot f&#252;r den Amiga nicht
ausreichend. Ok, mit QNX kommt kostenlos mit den PPC Karten ein weiteres
modernes (!) OS. Aber einigen mag das immer noch nicht genug sein. Nun ja,
es gibt da ja noch ein OS, das sich Linux schimpft und das bereits in einer
PPC Version f&#252;r den Amiga vorliegt und gerade mal 69 DM kostet. Zus&#228;tzlich
l&#228;&#223;t sich noch der Mac PPC Emulator FusionPPC installieren, der de facto
erscheinen wird und den Amiga User aus der breit gef&#228;cherten Mac Software
w&#228;hlen l&#228;&#223;t. Und last but not least ist es sicherlich nur eine Frage der
Zeit, bis auch ein auf den PPC optimierter PC Emulator das Licht der Welt
erblicken wird.</P>

Halten wir das mal fest; mit einer PPC Karte kann ich folgende g&#228;ngige
Betriebssystem laufen lassen:</P><UL>

<li> AmigaOS 3.5 <BR>
<li> QNX Neutrino<BR>
<li> Linux PPC       <BR>
<li> Mac OS              </P></UL>

und in naher Zukunft...           </P><UL>

<li> Windows 95 / 98 </P></UL>


Da frage ich mich: Was will man mehr? Das einzigste, was ben&#246;tigt wird, ist
eine gro&#223;e Festplatte sowie ein PPC Bord und sp&#228;testens dann wird man von
Software erschlagen; egal aus welchem Bereich. </P>

Aber statt diese Fakten zur Kenntnis zu nehmen, wird sich vielerorts ein PC
gekauft und dann meinen viele, dieser w&#228;re besser als der Amiga. Allein
schon von der Rechenpower fegt der G4 mit Altivec alles aus dem PC Lager mit
gro&#223;em Abstand weg; und ausser f&#252;r Raytracing braucht doch ohnehin kaum
einer die gewaltige Rechenpower eines 400 MhZ G4.</P>

&quot;Aber Linux gibt`s auch f&#252;r den PC&quot; werden jetzt einige aufschreien. Zur
Kenntnis genommen und aktzeptiert, aber wir reden ja hier von einem Amiga,
der zus&#228;tzlich dazu noch Amiga Software (die ja auch nicht schlecht ist) und
Mac Software verwenden kann. Und wer einmal den UAE (Amiga Emulator f&#252;r den PC)
auf einem PC in Aktion
gesehen hat, wird sich nichts sehnlicher w&#252;nschen, als einen richtigen Amiga
zu besitzen.</P>

Den Bereich der Spiele lasse ich mal au&#223;en vor, denn daf&#252;r gibt`s
erstklassige Spielekonsolen eines Kalibers &quot;Dreamcast&quot;, die recht billig in
der Anschaffung sind.</P>

Wer also das n&#228;chste mal laut losbr&#252;llt, da&#223; es f&#252;r den Amiga keine Software
gibt, der soll sich diesen Artikel nochmal durchlesen und dann sagen, was
Sache ist.</P>

Amiga 4ever! Wer braucht denn da noch einen PC?</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
