



<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Joyride Preview</TITLE>
</HEAD>
<BODY TEXT=black background="kback.png" link=red alink=red>

<CENTER><h1><b>Nightlong Preview</CENTER></H1></B><P>
<hr><CENTER>
<img src="nightlong.jpg"></p></CENTER>
<hr>
<font size="+1,5">

Sp&#228;testens seit Spielen wie &quot;Napalm&quot; oder dem aktuellen &quot;T-ZerO&quot; wird der
Name ClickBoom in aller Munde sein. Mit &quot;Nightlong&quot; k&#252;ndigte die kanadische
Softwareperlenschmiede nun ein neues Adventure f&#252;r den Amiga an, das
verspricht, neue Ma&#223;st&#228;be zu setzen.</P>

Die Handlung ist recht schnell erz&#228;hlt: Nightlong spielt im Jahre 2099,
wobei der Spieler in die Rolle des Privatdetektives Joshua Reev schl&#252;pft.
Jener muss beim B&#252;rgermeister von Union City Mertens noch eine Schuld
begleichen und wird vom B&#252;rgermeister auserkoren, eine Verschw&#246;rung in Union
City aufzudecken.</P>

Soviel zur Handlung, nun aber zu den vorliegenden Fakten: Nightlong ist
keine ClickBoom Eigenproduktion, sondern eine Portierung vom PC.
Urspr&#252;nglich wurde Nightlong &#252;brigens von Team 17, eine Firma, die Amiga
Anwendern wohl was sagen wird, entwickelt. Es ist somit nicht weiter
verwunderlich, da&#223; Nightlong einige Features zu bieten hat: Auf dem PC
wusste Nightlong durch seine cyberpunkige Grafik (+ animierte Hintergr&#252;nde)
sehr zu gefallen. Hinzu gesellen sich mehr als 60 Minuten
handlungsgesteuerter Videosequenzen in Full Motion und &#252;ber 30 Minuten
gesprochene Sequenzen. Bei einer so gro&#223;en Datenmasse ist es nicht weiter
verwunderlich, da&#223; eine einzige CD nicht ausreichen wird. Zum ersten mal in
der Geschichte der Amiga Spiele wird ein Spiel auf 3 CD`s (!!) ausgeliefert.
Na, wenn das nichts ist?</P>

Nat&#252;rlich sind die Anforderungen auch nicht ohne: Neben mind. 16 MB Ram
sollte eine gro&#223;z&#252;gig proportionierte Festplatte sowie ein CD Laufwerk schon
vorhanden sein. Ob AGA und ein 040er Prozessor ausreichen werden, stand zum
jetztigen Zeitpunkt noch nicht fest, aber eine Grafikkarte kann ich wirklich
jedem Zocker nur ans Herz legen; unter AGA wird das 2D Adventure ohnehin
nicht mehr als eine grobpixelige Slideshow bleiben. Ob der brilliante Sound
(zumindest in der PC Version) auf dem Amiga auch durch Soundkarten
abgespielt werden kann, stand ebenfalls noch nicht fest.</P>

Aber: Auf dem PC war &quot;Nightlong&quot; ein Totalflop, was nicht zuletzt an einer
katastrophalen deutschen Lokalisierung lag - mit selbigem Problem werden
wohl auch die Amiga User zu k&#228;mpfen haben.</P>

<u>Fazit:</U></P>
Obwohl auf dem PC ein Flop, rechne ich Nightlong auf dem Amiga gute
Chancen aus - grafisch ist es eh mit das beste, was der Amiga seit Jahren
gesehen hat. Auch die Anforderungen sind volkommen in Ordnung, wenn man
bedenkt, da&#223; wir das Jahr 1999 schreiben. Und da es auf dem Amiga z.Zt.
ohnehin kaum neue Adventures gibt, kann ich Nightlong jedem Adventure Freund
schon jetzt ans Herz legen. Hoffen wir nur, da&#223; ClickBoom eine 1:1 Kopie
hinbekommt....</P><PRE>
<CENTER><img src="kit.gif"></CENTER></P>
Name          : Nightlong<BR>

Publisher     : ClickBoom<BR>

Release       : 4.Quartal `99<BR>

Preis         : um 100 DM<BR>

Anforderungen : 16 MB Fast Ram, gro&#223;e HD, CD Laufwerk, vermutlich AGA &amp; 040er<BR>

Empfohlen     : von allem mehr :-)))<BR>
</PRE>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
<HR>
</CENTER>
</P>
</BODY>
</HTML>
