



<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>The Last Preview</TITLE>
</HEAD>
<BODY TEXT=black background="kback.png" link=GRAY alink=GRAY>

<CENTER><h1><b>The Last Seal Preview</CENTER></H1></B><P>
<hr><CENTER>
<img src="lastseal.jpg"></p></CENTER>
<hr>
<font size="+1,5">

Neben dem ebenfalls in dieser Ausgabe vorgestellten Adventure &quot;Nightlong&quot;
befindet sich seit geraumer Zeit noch ein weiteres Adventure in der Mache.
Die Rede ist von &quot;The Last Seal&quot;, in dem nun schon mehr als ein Jahr
Entwicklungszeit steckt.</P>

Aber bevor wir uns genauer mit dem Game an sich besch&#228;ftigen, gibt`s erstmal
ein paar Worte zur Story: Diese f&#228;ngt schon zu Zeiten der &#196;gypter an, als
b&#246;se M&#228;chte von einem fremden Planeten auf der Erde landen und die
Menschheit versklaven wollen. Aber die &#196;gyper beten Ihre G&#246;tter an, welche
daraufhin vom Himmel herabsteigen (sic!) und die b&#246;sen M&#228;chte bek&#228;mpfen. Es
gelingt den G&#246;ttern schlie&#223;lich, die b&#246;sen M&#228;chte zu bezwingen und sie in
einen riesigen Raum einzusperren, der mit 5 Siegeln verschlossen wird.
Zur&#252;ck in der heutigen Zeit erf&#228;hrt der Spieler, da&#223; 4 Siegel bereits
entfernt wurden und die b&#246;sen M&#228;chte zu fliehen drohen. Dem Spieler f&#228;llt
nun, in der Rolle von Russ, die Aufgabe zu, die anderen 4 Siegel
wiederzufinden....</P>

Die vorliegende Demo Version befindet sich auf der aktuellen Amiga Future CD
und offenbart schonmal einen tieferen Einblick in das reinrassige Adventure.
Wie schon massig Adventures zuvor, orientiert sich auch &quot;The Last Seal&quot;
steuerungstechnisch an den bekannten Lucasfilm Adventures (&quot;Monkey Island&quot;,
&quot;Maniac Mansion&quot; etc.). F&#252;r diejenigen, die damit nichts anfangen k&#246;nnen,
sei es hier nochmal kurz erkl&#228;rt: Am unteren Bildschrimrand befinden sich
eine Reihe von Verben (z.B. &quot;nimm&quot;, &quot;benutze&quot;, &quot;&#246;ffne&quot; etc.), die man auf
alle Objekte anwenden kann, um so die R&#228;tsel zu l&#246;sen. Additional befindet
sich noch ein Inventar am unteren Bildschirmrand, das alle Gegenst&#228;nde
auff&#252;hrt, die man mit sich f&#252;hrt. Kling rect simpel? Ist es auch....</P>

Gl&#252;cklicherweise ist dieses &#220;berbleibsel aus alten Tagen das einzigste, was
&quot;The Last Seal&quot; noch an l&#228;ngst vergangene Tage erinnert. Denn im Gegensatz
zu seinen Vorbildern, setzt &quot;The Last Seal&quot; auf komplett (!) gerenderte
Grafiken. Im Klartext hei&#223;t das: S&#228;mtliche Locations (sowie s&#228;mtliche
Charakt&#228;re) entstammen dem Raytracer und sehen dementsprechen realistisch
aus. Und das hat sogar noch einen weiteren angenehmen Nebeneffekt: Die
Spielfigur bewegt sich, wie auch im richtigen Leben, nicht gleichbleibend
schnell, sondern &#228;ndert die Geschwindigkeit.</P>

Das ganze h&#246;rt sich schonmal gut an, aber die Jungs von Ancor (welches
momentan aus 3 Programmierern besteht) haben noch einige weitere Schmankerl
f&#252;r &quot;The Last Seal&quot; auf Lager:</P><ul>

<li> mehr als 5 (!) Perspektiven pro Spielort</P>

<li> Hauptcharakter besteht aus 300 Frames</P>

<li> alle anderen Charakt&#228;re immerhin aus 150 Frames</P>

<li> Sprachausgabe</P>

<li> viele gerenderte Videozwischensequenzen, die eine packende Atmosph&#228;re
 aufkommen lassen sollen</P></UL>

Ok, das ganze ist nat&#252;rlich auch mit einigen Anforderungen an die Hardware
verbunden: Ein Amiga (ach nee...) mit AGA, 68030 CPU, CD Laufwerk, 2 MB Chip
Ram und 16 MB Fast Ram sollten schon im heimischen Rechner stecken. Ach ja:
Grafikkarten werden bisher nicht unterst&#252;tzt; auf einer Picasso IV l&#228;uft`s,
dank integriertem Flickerfixer, trotzdem. Wie gewohnt sind nach oben nat&#252;rlich keine
Grenzen gesetzt...</P>

<u>Fazit:</U></P>
Die Demo macht auf jeden Fall Laune auf mehr. Die Grafik kann sich schon zum
jetztigen Zeitpunkt sehen lassen und auch das Gameplay ist nicht von
schlechten Eltern. Zwar mag die jetztige Demo noch nicht alles offerieren,
was f&#252;r die Vollversion geplant ist, aber Adventure Fans sollten diese auf
jeden Fall mal laden. Negativ ist eigentlich nur die fehlende Grafikkarten
Unterst&#252;tzung. Sollte diese in die Vollversion noch integriert werden, steht
uns sicherlich ein gutes Adventure ins Haus!</P><CENTER>
<img src="kit.gif"></CENTER></P>
<PRE>
Name          : The Last Seal</P>

Publisher     : ???</P>

Release       : 1. oder 2. Quartal 2000 </P>

Preis         : ???</P>

Anforderungen : 030 CPU, CD Laufwerk, 2 MB Chip Ram, 16 MB Fast Ram und AGA</P>

Empfohlen     : mehr ist immer gut :-))</P>
</PRE>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
<HR>
</CENTER>
</P>
</BODY>
</HTML>
