
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief von Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=green alink=red>

<h1><FONT COLOR="GREEN"><CENTER>Leserbrief von Kilian &quot;The Bruce&quot; Servais
</FONT></h1></CENTER></P>
<a href="#serratus.html">An den Welsfan Serratus</A><BR>
<a href="#nagash.html">An den einsamen K&#228;mpfer Nagash (Gerd
Wolpert)</A><BR>
<a href="#wolf.html">An den schreibw&#252;tigen Wolf Zimmer</A><BR>
<a href="#thowin.html">An den endlich wieder schreibenden Saint
(Thowin)</A><BR>
<a href="#top.html">Top 5</A></P><HR>
<a name="serratus.html">
<b>An Serratus:</B><BR>
Zu Deinen Abst&#252;rzen kann ich jetzt auch nichts genaues sagen. Welches
Treibersystem benutzt Du denn (Picasso 96 oder CyberGFX)? Evtl. hilft eine
aktuellere Version, die Abst&#252;rze zu vermindern. Ansonsten kann ich Dir nur
raten, alle nichtben&#246;tigeten Patches zu entfernen (also alles was in WB
Startup bzw. User Startup rumliegt) und dann zu kontrollieren, ob es immer
noch Abst&#252;rze gibt. Sollten die Abst&#252;rze regelm&#228;&#223;ig kommen (z.B. alle 10
Minuten) kann es auch an mangelnder K&#252;hlung der CPU liegen. Schreib mal
genauer was zu Deinen Abst&#252;rzen; das kriegen wir schon hin. Bis dann!
<BR>
<HR>
<a name="nagash.html">
<b>An Gerd Wolpert:</B><BR>
Hey, wann ist denn dieser Pseudonymaustausch wieder vorbei? M&#252;sste doch auch
bald sein....</P>

Das immer weniger Leute Leserbriefe schreiben, ist mir auch aufgefallen und
ich merke es ja auch Monat f&#252;r Monat an meinen eigenen Briefen; viel ist das
auch nicht mehr. </P>

Die &#220;berraschung zum HMG Test ist auf jeden Fall gelungen; an 4.0 NG arbeite
ich die letzten Tage wieder sehr intensiv und im Dezember m&#252;sste eigentlich
alles fertig sein (auch wenn jetzt in der Schule mal wieder Hochkonjunktur
angesagt ist). Kannst dann ja nochmal f&#252;r die Multi Ecke testen (wenn sie
denn mal wieder erscheinen w&#252;rde).</P>

Tja, jeder bevorzugt da seinen eigenen WWW Browser. Und da der Amiga in
diesem Bereich ohnehin &#252;ber einige Alternativen verf&#252;gt, die sich auch
kombinieren lassen, macht das auch nix. Ideal w&#228;re wohl wirklich AMozillaX;
aber mitlerweile glaube ich, das davon nie mehr was kommt :-(((</P>

Thema E-Mail: Der Frank macht das alles. Ist halt `nen PC User; was
erwartest Du da? Und seitdem er einen PC hat, will er vom Amiga auch nix
mehr h&#246;ren. Frag mal Dark Evil (Hey Frank! Man lie&#223;t keine fremden
Briefe...).</P>

See ya!</P>
<BR>
<HR>
<a name="wolf.html">
<B>Hi Wolf!</B><BR>
Sch&#246;n das Du noch was f&#252;r die NC machst. Mit Feedback ist es ja in den
letzten Ausgaben nicht so gut gewesen und &#252;ber das inhaltliche diskutieren
wir besser gar nicht weiter. Deine HTMl Workshops fand ich echt gut; woher
nimmst Du eigentlich das ganze Wissen? War bestimmt eine ganze Menge Arbeit,
oder?</P>

Schade finde ich auch, da&#223; Du die Aminet CD Tests nicht mehr machen kannst;
waren immer wirklich gute Artikel! Hoffentlich findet sich da jemand, der
das &#252;bernehmen will :-))))</P>

Mach`s mal gut!</P>
<BR>
<HR>
<a name="thowin.html">
<B>An Thomas Windecker:</B><BR>
Cool, da&#223; Du Dich mal wieder in der NC zu Wort meldest. Die Space Pages habe
ich die letzten Wochen richtig vermisst.</P>

Toll ist auch, da&#223; Du mal wieder mit Feedback r&#252;bergekommen bist. Zu Deinen
Artikeln habe ich in dieser Ausgabe etwas geschrieben :-)))</P>

Nun aber zu Deinem Feedback. Dort habe ich einiges nicht verstanden: Was meinst Du zum Bleistift
mit &quot;wenn man schon Guides zu seiner Metal CD Sammlung schreibt und auch
noch aus Herne kommt, dann ist man daf&#252;r wie geschaffen&quot; ? Kennst Du noch
andere Leute aus Herne, oder wie habe ich diesen Satz zu verstehen? Danke
auf jeden Fall f&#252;r das Kompliment zu meinen Artikeln; werde mich bem&#252;hen,
da&#223; Niveau zu halten.</P>

Ach ja: Wieso sind Wertungen wie 0 % oder 5 % zu hart? Ich brauche Produkte
nicht besser zu bewerten, als wirklich n&#246;tig, da die NC keine Zeitschrift
ist, die es sich mit den Programmierern verscherzen kann. Im Rahmen meiner
Tests versuche ich immer auf alles einzugehen und daraus eine realistische
Wertung zu konzipieren. Nun, im Falle der A+ CD`s war das auhc nicht weiter
schwer. Ob das nun zu hart war oder nicht, muss jeder selber entscheiden.
Aber von Pseudo Wertungen im Stil der A+ hatte ich genug.... das muss nicht
noch Einzug in die NC halten!</P>

Walk on!</P>
<HR>
<a name="top.html">
<h2><CENTER><FONT COLOR="YELLOW">Top 5</FONT></h2></CENTER></P>

1. HTML Workshops von Wolf Zimmer<BR>
2. Space Pages von Thowin (oder auch &quot;The Saint&quot;)<BR>
3. Astro Corner von Lars Ph.<BR>
4. Lagebesprechung von Nagash &amp; Yonder<BR>
5. Heretic II, Shogo &amp; Soul von Saint / Sax</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
