
<HTML>
<HEAD>
   <META NAME="Author" CONTENT="Markus Thomaschewski">
   <TITLE>Namenlos</TITLE>
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000" BACKGROUND="steinmauer.gif">

<H1>
<B>POST F&Uuml;R...</B> Wolf Zimmer, <A HREF="#castro">Markus Castro</A>,
<A HREF="#servais">Kilian Servais</A>, <A HREF="#wolpert">Gerd Wolpert</A>,
<A HREF="#windecker">Thomas Windecker</A>, <A HREF="#luebkemeier">Rainer
L&uuml;bkemeier</A> und die <A HREF="#top5">TOP 5</A>.</H1>

<HR ALIGN=LEFT NOSHADE WIDTH="100%">
<BR>
<H2>

<B>An Wolf Zimmer</B></H2>
Hallo.

<P>Nein, in der Tat: Wunder gibt es nicht. Aber Qualit&auml;t setzt sich
nunmal durch! ;) War nur ein Scherz!!! Warum (fast) nur meine drei Beitr&auml;ge
bei Dir "ankamen" (&uuml;bermittlungstechnisch, liebe Mitleser!) weis ich
nicht. Ich schicke dem Andreas meine Sachen immer ungepackt auf Disk zu.
Ok, Wunder gibt es nicht, daf&uuml;r aber Pechstr&auml;hnen. Das erkennt
man nicht nur an der Amiga-Geschichte, sondern auch an meiner Ex-Email-Adresse.
Schon seit Monaten habe ich mir fest vorgenommen die Sache in der Mitgliederliste
auszub&uuml;geln. Aber Monat f&uuml;r Monat wieder verge&szlig;en!

<P>Die Adresse ist noch von einer Probe-/Testzeit bei AOL. Innerhalb 30
Tage (glaube ich mich zu erinnern) sollte ich 60 Stunden gratis Surfen
d&uuml;rfen. Und nach etwa einer knappen Woche, hatte ich bestenfalls 10-12
Stunden vom Zeitguthaben verbraucht, verweigerte man mir bei AOL aber dem
weiteren Zutritt, mit dem Hinweis das meine Probezeit abgelaufen sei und
ich mich bitte unter einer Telefonnummer als festes Mitglied anmelden sollte.
Da sage ich doch "Nein Danke!", obwohl ich fest vorhatte nach der Probezeit
bei AOL zu bleiben. Gut m&ouml;glich das ich in absehbarer Zeit mit dem
Dreamcast Online gehe: Ohne Grundgeb&uuml;hr, nur Telefongeb&uuml;hren
zum Ortstarif. Das nenne ich verlockend. Allerdings sind da noch einige
Fragen technischer Natur offen.

<P>Wie Du richtig angemerkt hast, bin ich kein Gegner des WWW. Aber manchmal
frage ich mich schon: Brauche ich das wirklich? Wenn&acute;s nix kosten
w&uuml;rde, dann w&uuml;rde ich mir diese Frage nat&uuml;rlich nicht stellen.
Vor etwa zwei Jahren grasierte unter meinen Freunden und Bekannten die
Fax-Seuche, man mu&szlig;te sowas haben, das w&uuml;rde ja eines Tages
so etabliert sein wie Telefon heutzutage, usw. usf. Sicher, Internet hat
Zukunft ist aber nicht DIE Zukunft! Es ist n&uuml;tzlich und hat mehr Vorteile
als Nachteile zu bieten, das man aber vor lauter "technikgeilheit" den
Wald nicht mehr vor B&auml;umen sieht, zeigt das Beispiel NetAid.
<P>Ich weis nicht, ob du was davon mitbekommen hast. Ich selber habe erst
davon geh&ouml;rt, als es vorbei war. Es gab Mitte der Achtziger ja das
Projekt LiveAid von Bob Geldorf, wo unz&auml;hlige Stars aus der Pop und
Rockszene live vor einem Milliardenpublikum (1,5 Milliarden!) gespielt
hatte. Wie das m&ouml;glich war? TV-&Uuml;bertragung. Ziel war es Spendengelder
f&uuml;r die Welthungerhilfe zu sammeln. Und in Der Nacht vom 9. auf dem
10. Oktober war es soweit. NetAid sollte das weltweit gr&ouml;&szlig;te
Musikereignis seit LiveAid werden. Mit einer Milliarde "Visits" bzw. "Hits"
rechnete man. 300 Linux-Server sollten im RealVideo-Verfahren den Event
per Internet "streamen". Alles mit Rang und Namen war angetreten, auch
Kofi Annan und Michael Douglas. Musikstars sowieso in rauhen Mengen. Wie
aber sah die Praxis aus? Man konnte lesen von einer "...<FONT COLOR="#3333FF">pixeligen
Ruckeldiashow in Briefmarkenformat, wo man nur rote Augen bekam und sich
wunderte, wieso die Musik meist so druckvoll wie ein Kurzwellenradio r&uuml;berkam</FONT>".
Der Erfolg? 2,4 Millionen Hits. Die Gesamtsumme der Spenden ist bis heute
nicht bekanntgegeben worden. Wahrscheinlich ist arg wenig dabei zusammengekommen.

<P>H&auml;tte man blo&szlig; das alt bew&auml;hrte Konzept aus den Achtzigern
genommen, den dann w&auml;re wohl LiveAid die Zweite ein voller Erfolg
geworden! Aber nein, es mu&szlig;te ja unbedingt das trendige Internet
sein!!! Und weist Du was, Wolf? Mein bester Freund hat &uuml;berhaupt keinen
Computer f&uuml;hrt aber dennoch ein zufriedenes - vielleicht sogar gl&uuml;ckliches
- Leben! So ein Verblenderter, nicht wahr?! ;) Nein, Computer und Internet
sind eine feine und n&uuml;tzliche Sache. Gut das es sie gibt, aber der
ganze Hype der manchmal darum gemacht wird, geht mir geh&ouml;rig auf dem
Senkel!

<P>Daf&uuml;r das ich mich am Thema Horror beteiligt habe, brauchst Du
dich bei mir nicht zu Bedanken. Es gibt Themen die mich einfach reizen.
Es mag in meinen Fall vielleicht wirklich paradox sein, da ich selber durchaus
von Zeit zu Zeit Horror konsumiere. Aber ich denke das es &uuml;berall
Grenzen des guten Geschmacks gibt, selbst f&uuml;r Horror und Splatter-Fans.
Nun gut, mu&szlig; jeder selbst wissen womit er sich besch&auml;ftigt.

<P>Man schreibt sich.
<BR>

<P><A NAME="castro"></A>
<BR>
<HR ALIGN=LEFT NOSHADE WIDTH="100%">
<H2>

<B>An Markus Castro.</B></H2>
Wie geht&acute;s?

<P>Das Thema Horror k&ouml;nnen wir wirklich abhaken, zudem ich das Gef&uuml;hl
habe, das Du mich nicht verstehen willst! Nur soviel: &Auml;tsch, die Braindead-kompatiblen
Inhalte der Ash-Story waren allesamt von Daniel Stein! :) Und wor&uuml;ber
ich&nbsp; mich immer in meinen Ausf&uuml;hrungen aufregte, waren Snuff-Filme
und Gesichter des Todes und nicht "Dein" Braindead! &Uuml;berhaupt habe
ich den Eindruck gewonnen, das Du diese gesamte Diskussion als einen pers&ouml;nlichen
Angriff gegen Dich betrachtest. Richtig ist, das Du mit dem Braindead-Artikel
eine Diskussions-Lawine ins Rollen gebracht hast. Wolf warf die Frage auf,
ob f&uuml;r Horror Platz in der No Cover sein sollte und unter anderem
ich habe das Thema erweitert um "Grenzen des guten Geschmacks". Niemand
im Club h&auml;lt Dich f&uuml;r einen Geistesgest&ouml;rten oder &auml;hnlichem.
Also ruhig Blut, mein Lieber. (Nein, das IST NICHT tuntig gemeint! ;)

<P>Sollte der Pseudonym-Tausch witzig sein? Wenn ja, prima. K&ouml;nnt
ihr bitte ab jetzt wieder eure "normalen" Pseudos benutzen? Jeder Running
Gag l&auml;uft sich mal tot. Und schade das Du sowenig Zeit hast um mehr
f&uuml;r die No Cover zu schreiben, denn deine (scharfz&uuml;ngigen) Beitr&auml;ge
habe ich immer gerne gelesen! Achja, kannst mich in den erlauchten Kreis
der Feedback-Schreiber aufnehmen. Aber vorerst bitte nur einmal, als Test
sozusagen. Wenn&acute;s mir zusagt, bleibe ich dabei. Ok?

<P>Bis dann.
<BR>

<P><A NAME="servais"></A>
<BR>
<HR ALIGN=LEFT NOSHADE WIDTH="100%">
<H2>

<B>An Kilian Servais</B></H2>
Tach!

<P>Thanx f&uuml;r das Fastfood-Kompliment. Och, Mambo No.5 ist schon verdammt
nah am Pr&auml;dikat "SUPER-SCHROTT". Musik ist halt Geschmacksache. Der
Text unterbietet sogar das DJ Bobo-Niveau mit eleganter Leichtigkeit. Die
Melodie ist gecovert und das Lou Bega eine vern&uuml;nftige Stimme hat,
ist wohl wahr. Die Nummer "Blue" (?) von Eifel 65 (?) gefiel mir da schon
wesentlich besser.
<P>Ich meine mal was davon geh&ouml;rt zu haben, das C64-Software frei
gegeben wurde, also inzwischen frei kopierbar ist. Insofern kann man da
Epic keine Vorw&uuml;rfe machen. Jedenfalls hat Dein CD-Tip mich angeregt
bei Gelegenheit mir diese CD zu holen. Wenn Wizard of War und Spy vs Spy
drauf ist, lohnt sich die CD auf jedenfall!

<P>Tr&auml;um sch&ouml;n.
<BR>

<P><A NAME="wolpert"></A>
<BR>
<HR ALIGN=LEFT NOSHADE WIDTH="100%">
<H2>

<B>An Gerd Wolpert</B></H2>
Hall&ouml;chen!

<P>Ja genau, wo bleibt Deine Multimedia-Ecke ab? Da hat Kilian schon recht,
wenn er sie vermi&szlig;t. Die Lust verloren? Oder nur wenig Zeit? Oder
Motivation weg wegen wenig Feedback? &Uuml;ber eins m&uuml;&szlig;en wir
uns im klaren sein: die Zeiten des umfangreichen Feedbacks sind vorbei
- mal davon abgesehen das es diese Zeiten nie gab! Ich frage mich, wieviel
Clubmitglieder wir zur Zeit &uuml;berhaupt noch sind. Ich tippe auf knapp
Hundert - wenn &uuml;berhaupt!&nbsp; Meine Prognose: In einem Jahr gibt
es keine Amiga-Zeitschrift mehr, H&auml;ndler, bis auf ein-zwei Ausnahmen,
auch nicht. Die Anzahl der Clubmitglieder d&uuml;rfte weiterhin - teils
dramatisch - schrumpfen, so das der Fortbestand mehr als fragw&uuml;rdig
ist. Willst Du bis zum bitteren Ende durchhalten? Bei mir ist der September
2000 der Stichtag. Mal sehen was bis dahin noch passiert.

<P>Du bezeichnest Dich als LowEnd-WB-User (256 Farben HighRes)? Was bin
ich denn dann mit meinen 8 Farben? Mit HighRes meinst Du doch 640x256,
oder? Ja, hab ich auch. Bei mir z&auml;hlt nicht wie sch&ouml;n bunt die
WB ist, sondern ob es flutscht! F&uuml;hl Dich also nicht allein, schnieff!
;)

<P>La&szlig; wieder von Dir h&ouml;ren.
<BR>

<P><A NAME="windecker"></A>
<BR>
<HR ALIGN=LEFT NOSHADE WIDTH="100%">
<H2>

<B>An Thomas Windecker</B></H2>
Gr&uuml;&szlig; den Herrn!

<P>Gut das die Spacepages (zusammen geschrieben?) nicht, wie bei anderen
Serien in letzter Zeit &uuml;blich (Schande &uuml;ber mich), l&auml;nger
von der Bildfl&auml;che verschwunden ist. Wie ich aus eigener Erfahrung
weis, ist es nicht immer einfach jeden Monat was zusammenzubringen. Eigentlich
bin ich kein allzu gro&szlig;er Fan von Frames, aber so wie Du es bei Deinen
Space Pages (auseinander geschrieben?) gestaltet hast, gef&auml;llt es
mir gut.

<P>Thanx f&uuml;r das Fastfood-Kompliment. Naja, Musik ist halt Geschmacksache.
Aber ich habe der Bloodhound Gang auch 5 Sterne bei der Party-Wertung gegeben.
Ist das kein Trost? Oder h&auml;lst Du One Fierce Beer Coaster tats&auml;chlich
f&uuml;r ein ernsthaften Rock-Meilenstein? Huch. H&auml;ltst Du dann auch
Lou Bega&acute;s Album A little bit of Mambo f&uuml;r einen Pop-Klassiker,
gleichauf mit Michael Jackson&acute;s Thriller und Madonna&acute;s Like
a Virgin? F&uuml;r mich macht die Bloodhound Gang typische Fast-Food-Musik,
s&auml;ttigt zwar kurzfristig hat aber keinen l&auml;ngeren N&auml;hrwert.
Naja, eben Geschmacksache. Ich habe die Bloodhound Gang vor kurzen bei
Harald Schmidt gesehen und kann wirklich sagen, das sie fabelhaft Unterhalten.
Ne richtige Fun-Band. Was h&ouml;rst Du neben der Bloodhound Gang noch
gerne?

<P>South Park mu&szlig;te nicht auf eine Wertung verzichten, weil ich die
Serie zu hart fand, sondern weil ich mir nicht sicher war. Hatte zu diesem
Zeitpunkt erst zwei oder drei Folgen gesehen. Inzwischen sind es 6-8 Folgen
die ich gesehen habe und kann nun f&uuml;r meinen Teil sagen, das ich immer
noch nichts besonderes an dieser Serie finde. Manche Folgen waren mir drei
Sterne wert, andere gar nur Zwei. Vielleicht hatte ich auch nur Schiss
eine Kultserie mit drei Sternen abzuspeisen. Leider mu&szlig;te ich feststellen,
das der Kommentar "<I><FONT COLOR="#3333FF">Oh my! I haven&acute;t seen
a jew run like that since autumn 1938!</FONT></I>" nicht &uuml;bersetzt,
sondern durch einen wirklich dummen und unwitzigen Spruch ersetzt wurde.
Wenn RTL schon bei so einem harmlosen (?) Spruch Nerven zeigt, dann ist
es kein Wunder, wenn man die deutsche Fassung von South Park nicht wirklich
witzig finden kann. Wie findest Du die Serie denn? Schon mal Duckman gesehen?
Ist doch echt witziger, oder?!

<P>Stichpunkt Master of Orion: Sicher, ne spa&szlig;ige Idee, aber ob da
wirklich auf die Dauer gesehen gen&uuml;gend mitmachen? Ich selber verliere
bei solchen Sachen viel zu schnell die Begeisterung. Fazit: Rechne mit
mir besser nicht.

<P>Leb weiterhin wohl.
<BR>

<P><A NAME="luebkemeier"></A>
<BR>
<HR ALIGN=LEFT NOSHADE WIDTH="100%">
<H2>

<B>An Rainer L&uuml;bkemeier</B></H2>

<P><BR>Moin.

<P>W&auml;rst Du so nett, meine Email-Adresse zu deleten, drag &amp; drop
es in Dein Trashcan. Damit unsere HD&acute;s frei von Byte-Bugs sind!!!
Danke.

<P>Yo.
<BR>

<P>
<HR ALIGN=LEFT NOSHADE WIDTH="100%">
<A NAME="top5"></A>

<H2><B>TOP 5</B></H2>
1. Platz: Wolf Zimmer f&uuml;r seine HTML-Workshops
<BR>2. Platz: Thomas Windecker f&uuml;r seine Space Pages
<BR>3. Platz: Benjamin Hertwig f&uuml;r seine Hardware-Tips
<BR>4. Platz: Kilian Servais f&uuml;r sein C64 ClassiX CD-Test
<BR>5. Platz: Lars Philipsen f&uuml;r seine Astro-Corner

<P>Jeder Autor kann bei meiner TOP 5 nur einmal vertreten sein!
<BR>
</BODY>
</HTML>
