<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>WolfZ</title>
</head>
<body background="wolf1.gif" text=black link=blue alink="red" vlink="blue" bgcolor=gray>
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Wolf's Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a1"><b>f&uuml;r Lars Philips</a></b></li>
<li><a href="#a2"><b>f&uuml;r Gerd Wolpert und Daniel Stein</a></b></li>
<li><a href="#a3"><b>f&uuml;r Thomas Windecker</a></b></li>
</ul>
<br>
<table width=100% border=0 cellspacing=6><tr><td>
<h3><a name="a1">Gr&uuml;&szlig; dich Lars</h3> <p>Alles was mit
unserem Weltraum zusammenh&auml;ngt ist doch mehr oder weniger reine
Theorie und in vielen Vorstellungen irgendwie fiktiv (glaubt man), dennoch
ist alles fantastische Wirklichkeit. Mit unserer dreidimensionalen Physik
kann man eine ganze Menge erkl&auml;ren, aber es bleiben immer noch Fragen
offen und unbeantwortet. Meine Behauptung, dass der Mond (unser Erdtrabant
Luna) keine Eigenrotation aufweist, lasse ich weiterhin als gegeben im
Raume stehen. Wenn ich pers&ouml;nlich etwas nicht verstehe, dann versuche
ich stets mir eine Erkl&auml;rung an einfachen Beispielen zu suchen. Wenn
ein Auto immer konstant in einem Kreisverkehr seine Runden dreht und ich
mitten auf der Insel stehe und mich 28 mal um meine eigene Achse drehe bis
das Auto seine 360 Grad gefahren hat, dann sehe ich bei Blickkontakt immer
nur auf die eine Seite des Fahrzeuges. Das Auto f&auml;hrt zwar eine Kurve
mit eingeschlagener Lenkung, aber der Wagen dreht sich keinen Millimeter um
seine eigene Achse, weder objektiv noch subjektiv. Das gilt immer noch,
wenn das Beispiel als Modell auf einem Eisenbahnwagen montiert ist, der mit
einem Affenzahn auf seinen Gleisen entlangf&auml;hrt. F&uuml;r jemanden,
der den Zug vorbeifahren sieht, erscheint es so, als ob der Mond sich
drehe. Aber es ist dem nicht so, er tut es nicht. </p>

<p>Ich wei&szlig;, meine Beispiele hinken oft. Das kommt aber nur daher,
weil ich mir gerne so verr&uuml;ckt einfache Situationen vorstelle, an
denen ich vordergr&uuml;ndig eine optische Erkl&auml;rung suche und nach
meinem Geschmack manchmal auch finde. Ob die Antworten stimmen, sei
dahingestellt. Und ich lasse mich auch gerne &uuml;berzeugen, wenn man mir
beweist, dass ich mal wieder auf dem falschen Fu&szlig; Hurra geschrien
habe. Aber solange bleibe ich bei meiner Meinung. Bisher habe ich nirgendwo
gelesen oder geh&ouml;rt, dass sich die mittlere Erde/Mond Entfernung
&auml;ndert oder dass die Umlaufzeit sich variabel verh&auml;lt, respektive
ab- oder zunimmt. Somit ist der absolute Mittelpunkt der Erde auch der
Zentralpunkt f&uuml;r die Mondbahn. Unsere Physiker definieren
Zeiteinheiten im Giga- und Tera-Bereich und unterteilen diese weit hinein
in den Nano- und Piko-Bereich. Und f&uuml;r die sogenannten Mittelwerte
werden Konstanten vorgegeben. Das hei&szlig;t doch, dass unser System trotz
des Pulsierens ein starres System darstellt. Dazu m&ouml;chte ich aber
wieder mit einem Beispiel anmerken, messen kann ich doch nur etwas richtig,
wenn ich die entsprechenden Messwerkzeuge zur Verf&uuml;gung habe. Es ist
auch eine Unding mittels eines Zollstocks mit Zentimetereinteilung ein
Nadel&ouml;hr ausmessen zu wollen. Die erhaltenen Ergebnisse k&ouml;nnen
nur ann&auml;hernde Sch&auml;tzungen sein. </p>

<p>Dein Bericht &uuml;ber das Ph&auml;nomen eines Transpluto beweist doch
die starre dreidimensionale Denkweise unserer Astrophysiker. Sollte es sich
wirklich um einen Gasriesen handeln, w&auml;re er sicher schon l&auml;ngst
geortet worden. Warum kann sich niemand vorstellen, dass da irgendwo ein
wabberndes Magnetfeld ohne eigenen Kern herumirrt? Irgendjemand gibt mal
wieder eine fantastische durch nichts zu beweisende oder zu wiederlegende
Theorie bekannt und alles klatscht und dann geht man wieder zur
Tagesordnung &uuml;ber. Genau so verh&auml;lt es sich mit den
Entfernungsmessungen. Wer sagt denn, dass ein Lichtstrahl sich immer linear
verh&auml;lt? Warum kann es nicht sein, dass ein Magnetfeld das Licht
umlenkt und beschleunigt oder bremst? Sichtbare dunkle Stellen an unserem
Firmament, besonders wenn diese einem Pferdekopf &auml;hneln, geben zu
viellerlei Mutma&szlig;ungen Anlass. Die einen sagen, da ist halt nichts,
die anderen meinen, vielleicht fliegt da gerade eine Dreckwolke vorbei, so
dass niemand dahinterschauen kann, aber keiner sagt, da k&ouml;nne eine
Magnetwolke die Lichtstrahlen ablenken, so dass f&uuml;r uns von der Erde
aus optisch eine Leere ist. Es ist nicht plausibel, also kann und darf es
soetwas nicht geben. Nun bin ich aber wieder gewaltig vom Thema abgekommen
und ich wollte doch nur meine Meinung zum Mond sagen. </p>

<p>Bis demn&auml;chst mal wieder, Wolf.
</p>
<br>
<a href="#top">zum Anfang</a>
<hr size=4><br>
<h3><a name="a2">Gr&uuml;&szlig; dich Gerd! Gr&uuml;&szlig; dich Daniel! </h3>
<p>Zuerst wollte ich einen kleinen Artikel in Diskussionen bez&uuml;glich
eurer Lagebesprechung schreiben, dann entstanden aber nur diese
Leserbriefzeilen daraus. Obwohl ich euch beide anspreche, k&ouml;nnte ich
mir gut vorstellen, dass nur einer von euch beiden der Schreiber dieses
Zwiegespr&auml;chs war. Aber dieses m&ouml;chte ich keinesfalls vertiefen
oder irgendwie negativ beleuchten. Wirklich nicht. </p>

<p>Wenn ich die neue NoCover bekomme, lese ich kurz und schnell diagonal,
aber manche Artikel ganz. Erst wenn ich das Update zur NC-Guide fertig habe
und meine Homepage aktualisiert ist, dann setze ich mich hin und lese
alles, ich kann mit Fug und Recht sagen, fast alles durch. Es gibt
selbstredend Beitr&auml;ge, die ich anlese und dann weiterklicke, das habe
ich schon &ouml;fter gesagt und da &auml;ndert sich nichts daran. Eure
Lagebesprechung hatte mich gleich interessiert und ich las ihn schon beim
ersten Male komplett durch. Da ich aber nun diesen Leserbrief schreibe,
wisst ihr, dass ich nicht mit allem einverstanden war oder sonstige
Anmerkungen t&auml;tigen m&ouml;chte. Das zweite trifft hier zu. </p>

<p>Als erstes m&ouml;chte ich beim &quot;MMC&quot; ansetzen. Das avisierte
Ger&auml;t f&uuml;hrte aber die Bezeichnug: &quot;MCC&quot;, nicht
&quot;MMC&quot;. Als r&ouml;mische Zahlen lauten MMC gleich 2100 und MCC
demgem&auml;&szlig; 1200. Ob dies bei der Namensgebung beabsichtigt war,
vermag ich nicht zu beurteilen, w&auml;re aber in gewissem Sinne logisch.
Alle neuen Denkans&auml;tze gingen von der 1200er Platine aus und nicht von
der 4000er. Aber das ist es doch gar nicht weshalb ich diese Zeilen
schreibe. Mir geht es vordergr&uuml;ndig um die Aussage der Beteiligung der
Artikelschreiber f&uuml;r die NoCover. Wenn jemand so auch ihr etwas zu
bem&auml;ngeln habt, f&auml;ngt man bei der guten alten Zeit an. Aber
gerade in der Zeit der NC-30 herrschte ein leichtes Tief und etwas
Unwillen. Da wurde aufeinander &quot;losgedroschen&quot; und alle hielten
dies f&uuml;r cool. R&uuml;ckblick hat eigentlich noch nie richtig
geholfen. Manche sagen auch: R&uuml;ckblick = R&uuml;ckschritt. Und ganz
ehrlich, ein bisschen Wahrheit ist daran. Die NC-69 hat in der Online
Version 3,033 MB lha-Daten und entpackt sind es gerade 3,785 MB. Also eine
ziemliche schlechte Packrate, trotzdem so gro&szlig; war bisher noch keine
NoCover. Schauen wir aber etwas genauer hin, verbleiben nach Abzug von
Amiga Aktuell noch 2,609 MB. Alle HTML-Textdaten (ohne AA) ergeben
zusammengez&auml;hlt 926 KB und das ergibt ein Verh&auml;ltnis von ca 35%
Text- zu 65 % Bilddaten. Ob dieses ein gesundes Verh&auml;ltnis ist, ist
jedem selbst zur Beurteilung &uuml;berlassen. Als ich das erste Mal die
Zahl von 1,7 MB Bilddaten (ohne AA) sah, dachte ich, da musst du mal
genauer hinschauen, denn so viele Bilder sind mir doch gar nicht
aufgefallen. Und siehe da, ich wurde f&uuml;ndig. Alle Bilder von AA/extra
sind nochmals in der NoCover enthalten und das sind stolze 734 KB. In der
Hektik passieren schon mal solche Fehler. Ziehen wir nun diesen Betrag von
den 1,7 MB Bilddaten ab (sie werden ja sowieso nicht angesprochen), dann
sieht das Verh&auml;ltnis Text zu Bild ungef&auml;hr 1 zu 1 aus. Zieht man
aber hiervon die Bytes f&uuml;r das NoCoverger&uuml;st ab, ja dann sieht es
ein wenig mager aus. </p>

<p>An diesem Punkte angelangt setzt auch meine klitzekleine Kritik bei euch
beiden an. Warum die bl&ouml;den Spr&uuml;che als Workshop und nicht als
Beitrag in SmallTalk, wo diese hingeh&ouml;ren? Die Online Theke ist so
verwaist, warum schreibt ihr nicht ein paar Zeilen &uuml;ber nette
Homepages, die ihr entdeckt habt? Wahrscheinlich werdet ihr genauso wenig
Resonanz ernten, wie mein Versuch in der NC-67 erbrachte, n&auml;mlich
gleich 0. Aber das kann an meinem Schreibstil liegen, den du Gerd als zu
trocken bezeichnest. Aber Workshops sind halt mal trocken und sie sollen
doch auch sachgerecht und nicht im Romanstil vermittelt werden. Aber
manchmal frage ich mich, warum ich diese Reihe eigentlich
ver&ouml;ffentlicht habe, es liest fast niemand und wenn dann richtet sich
trotzdem fast keiner danach. Ist schon sehr &quot;annimierend&quot;. Aber
zu eurem Trauern von Fehlen entsprechender richtiger Workshops. Die
angef&uuml;hrten Beispiele gab es schon bei Erscheinen der entsprechenden
Software. Ihr m&uuml;sst halt in den Ausgaben 01 bis 20 mal nachschauen
oder noch besser, ihr schaut in meiner Guide in die entsprechenden Rubriken
und schon wisst ihr, wo ihr genau ansetzen k&ouml;nnt. Kommen einmal neuere
Themen wie das Raytracen von Frank Steinbach, sind nur minimale belanglose
Bemerkungen zu lesen. Es wundert mich &uuml;berhaupt nicht, wenn kein
dritter Kursteil mehr folgen wird. Die Resonanz kann frustierende Wirkungen
erzielen. </p>

<p>Der n&auml;chste von euch angesprochene Punkt sind die Stories. Das ist
wieder ein Kapitel f&uuml;r sich selbst. Daniel hast du nicht so um NC-47
herum kund getan, dass eine Story-Guide gebastelt wird? Als ich meine Guide
ab NC-50 auf HTML umstellte, hatte ich deswegen alle Stories drausen
vorgelassen, um ja euch nicht ins Gehege zu kommen. H&auml;ttet ihr dies
gemacht und dann h&auml;tte bestimmt der eine oder der andere
wahrscheinlich auch heute noch Lust, einen eingeschlagenen Weg bei
Storygame weiterzuf&uuml;hren. Das macht man doch viel eher, wenn alles
konzentriert vor einem liegt und nicht, da war doch irgendwann mal etwas.
Jetzt habe ich aber keinen Bock danach zu suchen und schon kommt keine
Fortsetzung mehr zustande. Also wo bleibt das Story-Guide? </p>

<p>Der Schluss des Beitrages hat mir nicht gefallen. Das Res&uuml;mee
gipfelt in der Aufforderung an die anderen mehr zu tun. Ihr habt in diesem
Zusammenhang aber ganz vergessen euch selbst anzustacheln und das
m&uuml;sste die erste Quintesenz eurer Lagebesprechung darstellen. Also
fordere ich euch auf, die Schaltfl&auml;chen von Multimedia, Online und
Story wieder zu beleben. </p> <p>Bis demn&auml;chst mal wieder, Wolf. </p>
<p>PS: Das halbe Jahr ist rum, wann eignet ihr endlich wieder eure alten
Pseudos an? </p>
<br>
<a href="#top">zum Anfang</a>
<hr size=4><br>
<h3><a name="a3">Gr&uuml;&szlig; dich Thomas! </h3>
<p>Dein Feedback zu meinem Artikel &quot;Zeit&quot; darf ich nicht so im
Raum stehen lassen, da eine vollkommen falsche Interpretation vorliegt. Ein
D&eacute;j&agrave;-vu-Erlebnis ist der psychische Eindruck gegenw&auml;rtig
etwas schon einmal dagewesenes noch einmal zu erleben. Nichts anderes. Und
so hat J&uuml;rgen seinen Artikel auch gesehen, blo&szlig; noch nicht
richtig formuliert. Eine Interpretation nach einem vermeintlichen
Hilfeschrei ist an dieser Stelle vollkommen fehl am Platze und J&uuml;rgen
hat sich &uuml;ber dein Statement an mich bestimmt halb kaputt gelacht. Die
elementare und prim&auml;re Frage besagten Artikels lautete: &quot;Was ist
Zeit?&quot;. Und diese habe ich in der sogenannten Begriffsdefinition etwas
anreissen wollen. Auch das abrupte Ende war gewollt, so wurde der Faktor
Zeit noch etwas hervorgehoben. Wenn du J&uuml;rgen nach seiner Motivation
&uuml;ber den wahren Grund seines Artikels fragen w&uuml;rdest, kann es
gut sein, dass er dir darauf antwortet, er habe nur ein neues Thema in der
Rubrik implementieren wollen, damit in n&auml;chster Zeit wieder mehr zu
lesen ist. </p>

<p>Da ich gerade an dich schreibe, m&ouml;chte ich mich bei dir bedanken,
dass du meine Workshops nicht auch als &uuml;berfl&uuml;ssig anschaust,
sondern dass sie dir gefallen haben. Eines m&ouml;chte ich aber anmerken,
das Thema &quot;komplexe Tabellen&quot; ist ein rein HTML-spezifisches
Thema und hat mit Page-Design vordergr&uuml;ndig nichts zu tun. Deshalb ist
es richtiger, beide Artikel getrennt zu betrachten. Wenn du irgendeinmal
n&auml;mlich nachschauen m&ouml;chtest, wie dies genau bewerkstelligt war
und worauf es beim Zerschneiden von Bildern ankommt, dann hast du einen
kleinen Artikel in konzentrierter Form vorliegen und musst dich nicht
endlos durch einen Roman hindurchscrollen.</p>

<p>Thomas ich kann dir sagen, warum ich bisher keine Feedbacks geschrieben
habe. Als diese Ecke durch Cord Hagen veranlasst und eingerichtet wurde,
hatte er versucht, mich als Interpret zu gewinnen. Ich lehnte aber von
vornherein ab, weil ich wusste und das trifft auch heute noch zu, dass ich
bei leichter Kritik meinerseits gerne etwas zu harsch in meiner Wortwahl
werde und dies k&ouml;nnte sehr leicht als verletzend aufgefasst werden. Um
diesem vorzubeugen habe ich nie eine komplette R&uuml;ckbetrachtung
gemacht. Aber ich bin teils auch etwas froh, dass du nicht f&uuml;r die
NC-69 das Feedback schreibst. Du h&auml;ttest bestimmt mir die einzelnen
Fehler in meinem Beitrag &quot;Sonnensystem&quot; angekreidet. Kannst du
dir vorstellen, dass dies bewusste Fehler sind, die es von 9 bis
10-J&auml;hrigen zu finden galt? Vielleicht h&auml;tte ich in einem
Vorwort schreiben sollen, dass dies eine Zusammenfassung von drei
Unterlagen f&uuml;r den Schulunterricht ist, ich hatte es aber unterlassen.
Aber vielleicht sind diese bewussten Fehler auch gar nicht aufgefallen. Das
Auswerten der Arbeitsbl&auml;tter hatte richtig Spa&szlig; gemacht. Die
Frage &quot;Warum haben wir nach dem Start vom Mars keine Landung auf einem
der nachfolgenden Planeten gemacht?&quot; wurde von allen richtig
beantwortet. Manche schrieben sogar hinzu, man wisse eben nicht, wie sich
die Gasoberfl&auml;che der Planeten bei offenem Feuer des
Raumschiffantriebs verhalten w&uuml;rde. Der fehlende Planet in der einen
Aufz&auml;hlung und der Zahlentausch wurde auch von allen gefunden. </p>

<p>Bis demn&auml;chst mal wieder, Wolf.
</p>
<br>
<a href="#top">zum Anfang</a>
<hr size=4><br>
</td></tr></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf">
http://www.chiemgau.com/apc&amp;tcp/members/wolf </a></font>
<br>
</td></tr></table>
<br>
        
</body>
</html>



