
<HTML>
<HEAD>
   <META NAME="Author" CONTENT="Mark Tom">
   <TITLE>Fastfood Ausgabe DEZEMBER 99</TITLE>
</HEAD>

<BODY BACKGROUND="orange.jpg">

<BR>
<CENTER>
<TABLE BORDER=0 CELLSPACING=4 CELLPADDING=4 COLS=1 WIDTH="532" HEIGHT="160" BGCOLOR="#000000">
<TR VALIGN=TOP>
<TD>
<CENTER><B><FONT COLOR="#FFFFCC">Ausgabe </FONT><FONT COLOR="#FFFF00">DEZEMBER
99<IMG SRC="logo.gif" HEIGHT=118 WIDTH=532 ALIGN=LEFT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
</CENTER>

<BR>
<BR>

<BR><BR><BR>
<A NAME="inhalt"></A>
<CENTER>
<H2><B><U>I-N-H-A-L-T-S-V-E-R-Z-E-I-C-H-N-I-S:</U></B></H2></CENTER>

<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="100%">
<TR>
<TD>
<B>LEGENDE:</B>
</TD>

<TD BGCOLOR="#FFFF00">
<CENTER>
<B>LESESPA&szlig;</B>
</CENTER>
</TD>

<TD BGCOLOR="#33CCFF">
<CENTER>
<B>OHRENSCHMAUS</B>
</CENTER>
</TD>

<TD BGCOLOR="#FFCCCC">
<CENTER>
<B>SPIELH&Ouml;LLE</B>
</CENTER>
</TD>

<TD BGCOLOR="#99FF99">
<CENTER>
<B>ZELLULOIDZAUBER</B>
</CENTER>
</TD>
</TR>
</TABLE>

<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="100%" BGCOLOR="#000000">
<TR><TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#993366">
<TR><TD>
<B><FONT COLOR="#FFFFFF">&nbsp;E-D-I-T-O-R-I-A-L</FONT></B>
</TD></TR>
</TABLE>
</TD></TR>
</TABLE>

<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="100%" BGCOLOR="#000000">
<TR><TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#993366" >
<TR><TD>
<B><FONT COLOR="#FFFFFF">&nbsp;Ein Satz mit X: Die Klausur.</FONT></B>
</TD></TR>
</TABLE>
</TD></TR>
</TABLE>





<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="100%" BGCOLOR="#000000">
<TR>
<TD WIDTH="20" HEIGHT="20"><A HREF="#A2"><IMG SRC="arrowblu.gif" HSPACE=4 VSPACE=4 BORDER=0 HEIGHT=18 WIDTH=18></A>
</TD>

<TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#33CCFF">
<TR>
<TD><B>Filter: "Title Of The Record"</B></TD>
</TR>
</TABLE>
</TD></TR>
</TABLE>



<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="100%" BGCOLOR="#000000">
<TR>
<TD WIDTH="20" HEIGHT="20"><A HREF="#A3"><IMG SRC="arrowblu.gif" HSPACE=4 VSPACE=4 BORDER=0 HEIGHT=18 WIDTH=18></A>
</TD>

<TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#33CCFF">
<TR>
<TD><B>Live: "The Distance To Here"</B></TD>
</TR>
</TABLE>
</TD></TR>
</TABLE>



<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="100%" BGCOLOR="#000000">
<TR>
<TD WIDTH="20" HEIGHT="20"><A HREF="#A4"><IMG SRC="arrowblu.gif" HSPACE=4 VSPACE=4 BORDER=0 HEIGHT=18 WIDTH=18></A>
</TD>

<TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#33CCFF">
<TR>
<TD><B>Chris Cornell: "Euphoria Morning"</B></TD>
</TR>
</TABLE>
</TD></TR>
</TABLE>



<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="100%" BGCOLOR="#000000">
<TR>
<TD WIDTH="20" HEIGHT="20"><A HREF="#A5"><IMG SRC="arrowblu.gif" HSPACE=4 VSPACE=4 BORDER=0 HEIGHT=18 WIDTH=18></A>
</TD>

<TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#33CCFF">
<TR>
<TD><B>Yes: "The Ladder"</B></TD>
</TR>
</TABLE>
</TD></TR>
</TABLE>



<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="100%" BGCOLOR="#000000">
<TR>
<TD WIDTH="20" HEIGHT="20"><A HREF="#A6"><IMG SRC="arrowblu.gif" HSPACE=4 VSPACE=4 BORDER=0 HEIGHT=18 WIDTH=18></A>
</TD>

<TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#33CCFF">
<TR>
<TD><B>David Bowie: "Hours"</B></TD>
</TR>
</TABLE>
</TD></TR>
</TABLE>





<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="100%" BGCOLOR="#000000">
<TR>
<TD WIDTH="20" HEIGHT="20"><A HREF="#A7"><IMG SRC="arrowred.gif" HSPACE=4 VSPACE=4 BORDER=0 HEIGHT=18 WIDTH=18></A>
</TD>

<TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#FFCCCC">
<TR>
<TD><B>KONSOLEN NEWS:</B></TD>
</TR>
</TABLE>
</TD></TR>
</TABLE>







<P><BR><BR><BR>
<HR ALIGN=LEFT NOSHADE WIDTH="100%">
<CENTER>
<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="90%" BGCOLOR="#000000" >
<TR>
<TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#993366" >
<TR>
<TD><FONT COLOR="WHITE"><B>EDITORIAL</B></FONT></TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>

<CENTER><TABLE BORDER=2 CELLSPACING=0 CELLPADDING=20 COLS=1 WIDTH="90%">
<TR>
<TD BGCOLOR="#FFCC99">

<BR><B><FONT COLOR="#CC0000">Neues Layout?</FONT></B>
<BR><FONT COLOR="#000000">Lieber Leser, sieht diese Fastfood-Ausgabe aus
wie immer? Dann hat Andreas Magerl die <B>Classic</B>-Version gew&auml;hlt.
Erkennst Du hingegen diese Fastfood-Ausgabe nicht wieder, dann fand die
<B>Orange-Techno</B>-Version
Andreas Gunst. Ich habe ihm zwei Layout-Versionen dieser Ausgabe geschickt
und auch ihm die Wahl &uuml;berlassen, da das neue Layout etwas mehr Platz
ben&ouml;tigt. Wenn ihr gerade das neue Layout vor euch habt, kann es u.
U. bei euch etwas "unordentlich" aussehen. <B>IBrowse 1.2</B> ist bei der
Darstellung der Tabellen leider nicht korrekt. Die besten Ergebnisse erzielte
ich mit <B>Voyager 2.88</B> und <B>2.92</B> (Offline-Version, Aminet CD
33). Andere Browser habe ich nicht getestet.</FONT>
<P><FONT COLOR="#000000">Ihr wundert euch vielleicht, wieso ich mir diese
M&uuml;he mache und ab jetzt jede Fastfood-Ausgabe zweimal unterschiedlich
layoute. Aber es ist keine M&uuml;he: mit dem selbstgeschriebenen Tool
<B>Fastfood
Creator</B> ist dies kein Problem: Aus einzelnen Beitr&auml;gen erstelle
ich eine Ausgabe, w&auml;hle das Layout und generiere sie dann! N&auml;heres
dazu in der Tools-Theke.</FONT>

<P><B><FONT COLOR="#CC0000">Ohrenschmaus:</FONT></B>
<BR>Ich geh&ouml;re zu dem Typ Musikfan, der sich manchmal monatelang kein
einziges neues Album kauft, dann aber gleich ein gutes Dutzend auf einmal.
So auch wieder erst vor wenigen Wochen geschehen. Aus diesem Grund gibt
es bei der Ohrenschmaus-Rubrik eine Premiere: F&uuml;nf 5-Sterne Alben
in einer Ausgabe! Nein, mich hat nicht der wertungstechnische Wahnsinn
gepackt, sondern schlicht und einfach, f&uuml;nf - auf ihre speziellen
Art spitzenm&auml;&szlig;ige - Rock-Alben. Ich h&auml;tte nat&uuml;rlich
diese Platten auf die n&auml;chsten Fastfood-Ausgaben besser verteilen
k&ouml;nnen, aber wenn einem was besonders gut gef&auml;llt, m&ouml;chte
man es auch gleich weitererz&auml;hlen. In den n&auml;chsten Ausgaben gibt
es den "Rest vom Fest": <B><FONT COLOR="#000099">Shack</FONT></B>, <B><FONT COLOR="#000099">Guided
By Voices</FONT></B>, <B><FONT COLOR="#000099">Saga</FONT></B>, <B><FONT COLOR="#000099">Gay
Dad</FONT></B>, <B><FONT COLOR="#000099">Leftfield</FONT></B>, <B><FONT COLOR="#000099">Farside</FONT></B>
und <B><FONT COLOR="#000099">Eat No Fish</FONT></B>. &Uuml;berwiegend 4-Sterne-Werke.

<P><B><FONT COLOR="#CC0000">Spielh&ouml;lle:</FONT></B>
<BR>An der Konsolenfront tut sich wieder was. Das <B><FONT COLOR="#000099">Dreamcast</FONT></B>
nun in Deutschland erh&auml;ltlich ist und das die <B><FONT COLOR="#000099">Playstation
2</FONT></B> und die Nintendo-Konsole <B><FONT COLOR="#000099">Dolphin</FONT></B>
ihre Schatten voraus werfen, ist nichts Neues. Aber der <B><FONT COLOR="#000099">NG-Gameboy</FONT></B>
und die Microsoft-Konsole <B><FONT COLOR="#000099">X-Box</FONT></B> erweitern
den Kreis der Hardware-Giganten. Das Special zu den Spiele-Editoren verschiebt
sich nocht etwas. Bitte habt Geduld...
<P>Tja, diese Fastfood-Ausgabe ist sicherlich nicht die Abwechslungsreichtse,
aber ich bin schon froh, das es &uuml;berhaupt eine weitere gibt. Ihr wisst
schon, die Sache mit dem inneren Schweinehund.

<P>Viel Spa&szlig; beim schm&ouml;kern!
<P>&nbsp;<B><I><FONT COLOR="#3333FF">MARK TOM</FONT></I></B>


</TD>
</TR>
</TABLE></CENTER>


<BR><BR><BR>
<HR ALIGN=LEFT NOSHADE WIDTH="100%">
<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="100%" BGCOLOR="#000000" >
<TR><TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#993366" >
<TR><TD>
<B><FONT COLOR="#FFFFFF">Ein Satz mit X: Die Klausur.</FONT></B>
</TD></TR>
</TABLE>
</TD></TR>
</TABLE>

<CENTER><TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 WIDTH="95%">
<TR>
<TD>
<BR><B><FONT COLOR="#000000">Alle Bewertungen in Fastfood sind nat&uuml;rlich
stark vom Geschmack des Autoren gepr&auml;gt und sollen nur zur groben
Einsch&auml;tzung dienen. Deswegen wurde das Bewertungsschema bewu&szlig;t
einfach gehalten.</FONT></B>
<BR><BR>
<TABLE BORDER=0 CELLSPACING=4 >
<TR>
<TD>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37><IMG SRC="X0.gif" HEIGHT=36 WIDTH=37><IMG SRC="X0.gif" HEIGHT=36 WIDTH=37><IMG SRC="X0.gif" HEIGHT=36 WIDTH=37><IMG SRC="X0.gif" HEIGHT=36 WIDTH=37>
</TD>
<TD>
<B>: Mies!</B></TD>
</TR>

<TR>
<TD>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37><IMG SRC="X1.gif" HEIGHT=36 WIDTH=37><IMG SRC="X0.gif" HEIGHT=36 WIDTH=37><IMG SRC="X0.gif" HEIGHT=36 WIDTH=37><IMG SRC="X0.gif" HEIGHT=36 WIDTH=37>
</TD>

<TD><B>: Nicht &Uuml;berzeugend!</B></TD>
</TR>

<TR>
<TD>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37><IMG SRC="X1.gif" HEIGHT=36 WIDTH=37><IMG SRC="X1.gif" HEIGHT=36 WIDTH=37><IMG SRC="X0.gif" HEIGHT=36 WIDTH=37><IMG SRC="X0.gif" HEIGHT=36 WIDTH=37>
</TD>

<TD><B>: Durchschnitt!</B></TD></TR>

<TR>
<TD><IMG SRC="X1.gif" HEIGHT=36 WIDTH=37><IMG SRC="X1.gif" HEIGHT=36 WIDTH=37><IMG SRC="X1.gif" HEIGHT=36 WIDTH=37><IMG SRC="X1.gif" HEIGHT=36 WIDTH=37><IMG SRC="X0.gif" HEIGHT=36 WIDTH=37></TD>

<TD><B>: Gut gelungen!</B></TD>
</TR>

<TR>
<TD><IMG SRC="X1.gif" HEIGHT=36 WIDTH=37><IMG SRC="X1.gif" HEIGHT=36 WIDTH=37><IMG SRC="X1.gif" HEIGHT=36 WIDTH=37><IMG SRC="X1.gif" HEIGHT=36 WIDTH=37><IMG SRC="X1.gif" HEIGHT=36 WIDTH=37></TD>

<TD><B>: Spitze!</B></TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE></CENTER>

<P><A NAME="A2"></A>
<BR>
<HR ALIGN=LEFT NOSHADE WIDTH="100%">
<CENTER>
<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="90%" BGCOLOR="#000000" >
<TR>
<TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#33CCFF" >
<TR>
<TD><B>Filter: "Title Of The Record"</B></TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>

<CENTER><TABLE BORDER=2 CELLSPACING=0 CELLPADDING=20 COLS=1 WIDTH="90%">
<TR>
<TD BGCOLOR="#FFCC99">

<BR>Moderner Hardrock? Gibt es sowas heutzutage &uuml;berhaupt noch? Ende
der Achtziger und Anfang der Neunziger zeigten Bands wie <B>Damn Yankees,
Europe, Scorpions, M&ouml;tley Cr&uuml;e, Poison, Bad English, Van Halen,
Giant</B> und <B>Hardline</B>, wie er zu klingen hatte, der perfekte Hardrock.
W&auml;hrend <B>Bon Jovi</B> und <B>Aerosmith</B> noch rechtzeitig den
Absprung schafften, l&ouml;sten sich viele der anderen Bands mit langweiligen,
glattproduzierten und voller klisches triefenden Alben auf. Grunge brachte
wieder Seele ins Rockgesch&auml;ft.

<P>Hardrock also ein musikalischer Dinosaurier der schon vor vielen Jahren
ausstarb? Grunge ist und war nichts anderes als Hardrock. Statt stromlinienf&ouml;rmige
Gitarrenriffs, wildes Geschrammel; statt affektiert zu posen, hing man
betroffen herum; statt simpler I-love-you-Lyrics und alberne Party-all-the-time-Texte,
gab es Inhalte zu schwerwiegenden Themen zu h&ouml;ren; statt frisch gef&ouml;nter
Dauerwelle und knallbunten Outfit mit Paillietten, boten Grunger schmuddlige
Jeans, verwaschene T-Shirts und fettige, kurze Haare. So oder so: Immer
mit viel Gitarre! Wenn es heutzuge noch modernen Hardrock gibt, dann machen
<B>Filter</B> ihn. Die Gitarren sind schwer und heftig, ohne dabei unmotiviert
zu schrammeln. Die Texte sind auch nicht mehre so hohl wie fr&uuml;her
so h&auml;ufig. Der Computer kommt auch mal zum Einsatz. Bei dem Opener
<B><FONT COLOR="#990000">Welcome To The Fold</FONT></B> schreit &uuml;ber
weite Teile xxx xxx als das er singt. Ruhige Passagen wechseln sich mit
W&uuml;tenden ab.<B><FONT COLOR="#990000"></FONT></B>

<P>Bei dem St&uuml;ck <B><FONT COLOR="#990000">The Best Things</FONT></B>
gehen die Jungs so tough zu Werke, das selbst die Herren von <B>Leftfield</B>
und <B>Prodigy</B> wie <B>Modern Talking</B> wirken! <B><FONT COLOR="#990000">Title
Of The Record</FONT></B> hat Power und einen Sound der keinen Grund zum
Klagen gibt. Selbst die langsamen Titeln pulsieren wie Lava knapp unter
der Erdoberfl&auml;che. Filter &uuml;berzeugen mit perfekt inzinierten
Rock der &uuml;ber weite Teile zu hart f&uuml;r den Chart-Mainstream ist.
Trotz der harten Gitarren und dem zeitweiligen Gebr&uuml;ll ist Filter
dennoch leicht verdauliche Kost f&uuml;r den gestandenen Rockfan. Die f&uuml;nf
Sterne bekommt Filter in erster Linie f&uuml;r das &uuml;berzeugende und
kraftvolle Rockpaket, das sie da abgeliefert haben. In Sachen Songwritting
bewegen sich die Herren im soliden Vier-Sterne-Bereich. Ein wirklicher
Knaller ist nicht dabei, aber das macht bei diesem Album irgendwie nichts.
Gute Songs im M&ouml;rdergewand sind auch so spitze!


</TD>
</TR>
</TABLE></CENTER>

<CENTER><TABLE BORDER=0 CELLSPACING=2 CELLPADDING=6 WIDTH="88%" >
<TR>
<TD WIDTH="20"><A HREF="#inhalt"><IMG SRC="arrowbac.gif" BORDER=0 HEIGHT=31 WIDTH=114></A>
</TD>

<TD>
<DIV ALIGN=right>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>

</DIV>
</TD>
</TR>
</TABLE>
</CENTER>

<P><A NAME="A3"></A>
<BR>
<HR ALIGN=LEFT NOSHADE WIDTH="100%">
<CENTER>
<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="90%" BGCOLOR="#000000" >
<TR>
<TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#33CCFF" >
<TR>
<TD><B>Live: "The Distance To Here"</B></TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>

<CENTER><TABLE BORDER=2 CELLSPACING=0 CELLPADDING=20 COLS=1 WIDTH="90%">
<TR>
<TD BGCOLOR="#FFCC99">

<BR>Denkt man an die musikalischen Neunziger, fallen einem wohl zuerst
die Genres HipHop und Grunge/Alternativ-Rock ein. Im letzten Bereich machten
besonders Bands wie <B>Nirvana</B>, <B>Pearl Jam</B> und <B>Soundgarden</B>
Furore. Das sind auch die Bands die den mei&szlig;ten zuerst wieder in
den Sinn kommen, wenn man an Grunge denkt. Dabei gab und gibt es noch etliche
andere erw&auml;hnenswerte Bands wie <B>Alice In Chains</B> oder <B>Live</B>.
Mit <B><FONT COLOR="#990000">Throwing Copper</FONT></B> gelang Live ein
Meilenstein der Seattle-&Auml;ra, welches sich zurecht in den USA millionenfach
verkaufte. Ein Album, das jeder Rockfan im Plattenschrank stehen haben
sollte.

<P>Das Nachfolgealbum <B><FONT COLOR="#990000">Secret Samadhi</FONT></B>
floppte. Es war bei weitem nicht mehr so gut <B><FONT COLOR="#990000">Throwing
Copper</FONT></B> und ging in der Masse von Durchschnittsalben unter. Jetzt
liegt das neue Album <B><FONT COLOR="#990000">The Distance To Here</FONT></B>
vor und es scheint, als habe Live wirklich eine lange Strecke seit dem
letzten Abum hinter sich gebracht. Mit alter Brillianz gl&auml;nzen wieder
die vier Mannen, als habe es Secret Samadhi nie gegeben. Im Vergleich zum
Megaseller zwar mit weniger Weltuntergangs-Melancholie, aber mit gleicher
Dramatik und Wucht. Es besteht sogar eine kleine &Auml;hnlichkeit zu Alanis
Morrisettes letztem Album. Zwar wird bei den meisten Titeln auf Computerfirlefanz
verzichtet, aber die Soundtrack-artige Inzenierung l&auml;sst sich durchaus
mit <B><FONT COLOR="#990000">Supposed Former Infactuation Junkie</FONT></B>
vergleichen. Titel wie <B><FONT COLOR="#990000">Feel The Quit River Rage</FONT></B>
oder <B><FONT COLOR="#990000">Face and Ghost</FONT></B> sind mehr als gew&ouml;hnliche
Standard-Rocksongs. H&ouml;rt man sie, laufen einem vor dem geistigen Auge
unwillk&uuml;rlich kleine Filme ab. Da braucht man kein Videoclip.

<P>Mit <B><FONT COLOR="#990000">They Stood Up For Love</FONT></B> haben
Live ein Pop-Juwel im Rockgewand geschaffen, wie sie nicht alle Tage geschrieben
wird. Eine Melodie, um die wohl jede Boygroup sich pr&uuml;geln w&uuml;rde.
Es gibt noch einige andere Songs die sich als Single-Auskopplungen eignen
w&uuml;rden, wie <B><FONT COLOR="#990000">Dolphin Cry</FONT></B> oder <B><FONT COLOR="#990000">The
Distance</FONT></B>, den Quasi-Titelsong. 13 Tracks bietet das neue Album,
von denen meiner Meinung nach 9 St&uuml;ck erstklassig sind und die restlichen
vier in die Kategorie "ok/nett/normal" geh&ouml;ren. Satter Sound, fette
Gitarren, Ed Kowalskis R&ouml;hre und bet&ouml;rende wie emotionale Melodien
ergeben Rockmusik wie sie moderner kaum sein kann: Rock mit Anspruch, Qualit&auml;t
und Klasse ohne dabei so exaltiert zu sein, das nur eine Minderheit daran
Freude finden kann! Volle Punktzahl!!!


</TD>
</TR>
</TABLE></CENTER>

<CENTER><TABLE BORDER=0 CELLSPACING=2 CELLPADDING=6 WIDTH="88%" >
<TR>
<TD WIDTH="20"><A HREF="#inhalt"><IMG SRC="arrowbac.gif" BORDER=0 HEIGHT=31 WIDTH=114></A>
</TD>

<TD>
<DIV ALIGN=right>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>

</DIV>
</TD>
</TR>
</TABLE>
</CENTER>

<P><A NAME="A4"></A>
<BR>
<HR ALIGN=LEFT NOSHADE WIDTH="100%">
<CENTER>
<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="90%" BGCOLOR="#000000" >
<TR>
<TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#33CCFF" >
<TR>
<TD><B>Chris Cornell: "Euphoria Morning"</B></TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>

<CENTER><TABLE BORDER=2 CELLSPACING=0 CELLPADDING=20 COLS=1 WIDTH="90%">
<TR>
<TD BGCOLOR="#FFCC99">

<BR>Seattle-Rock, die Zweite. <B>Soundgarden</B> gibts nun leider nicht
mehr. Aber zum Gl&uuml;ck bedeutet dies nicht, das man auf die wahnsinnige
R&ouml;hre des S&auml;ngers <B>Chris Cornell</B> verzichten mu&szlig;.
Mit <B><FONT COLOR="#990000">Euphoria Morning</FONT></B> liefert er sein
Solo-Deb&uuml;t ab. Und es gibt und gab kaum ein Album, das mich mit seiner
Traurigkeit mehr ber&uuml;hrt hat als diese Platte. Ich h&ouml;rte das
Werk an dem Wochenende zum allererstenmal, als ich von Gateways Plan erfuhr,
keinen NG-Amiga mehr zu bauen. Mann-o-mann, das war eine Mischung: Diese
Musik und diese Nachrichten sind ein Schlag in den Magen und eine schmerzhafte
Reiz&uuml;berflutung an das Nervensystem zugleich!

<P>Keine Ahnung ob an diesem Wochenende die Sonne schien, denn ich war
irgendwie nicht da, nicht anwesend. Das Album half mir dabei, die schlechten
Neuigkeiten zu verabeiten. Jetzt, wo ich sagen kann, das ich alles verdaut
habe und sogar wieder etwas Freude an und mit meinem Amiga versp&uuml;re,
kann ich das Album besser und neutraler Beurteilen. Chris m&ouml;rderische
Stimmb&auml;nder kommen hier noch besser zur Geltung als bei Soundgarden.
Besonders bei <B><FONT COLOR="#990000">Steel Reign</FONT></B> bekommt man
eine G&auml;nsehaut. Ich bilde mir ein, das selbst <B>David Coverdale</B>
(<B>Whitesnake</B>) in seinen besten Zeiten da kaum mithalten h&auml;tte
k&ouml;nnen. Besonders die erste H&auml;lfte des Albums bietet die potentiellen
Singles, die sch&ouml;nsten Melodien, der zweite Teil ist daf&uuml;r der
ausdruckst&auml;rkere Part.

<P>Die erste Single <B><FONT COLOR="#990000">Can&acute;t Change Me</FONT></B>
befindet sich noch einmal in eine franz&ouml;sichen Version auf dem Album.
Dank Zieharmonika, sch&ouml;nen Frauenstimmen im Background und mit weniger
Stones-Appeal als in der englischen Version, bl&uuml;ht der Song nochmals
auf. Der Song ist wirklich Klasse. Von mindest gleichem Kaliber, wenn nicht
noch h&ouml;heren - sind die darauffolgenden drei Titeln. Oder auch <B><FONT COLOR="#990000">Pillow
Of Your Bones</FONT></B> zeugt von den Songwriter-Qualit&auml;ten des Chris
Cornell. Kein typisches Hit-Album, aber ein Deb&uuml;t worauf Chris Stolz
sein kann. Es bezieht seine Qualit&auml;t in erster Linie, durch die Emotionen
die es beim H&ouml;rer weckt. Was aber gleichzeitig auch ein Kritikpunkt
ist: So viel Gef&uuml;hl es auch hervorruft, es ist durchweg ein melancholisches,
trauriges Gef&uuml;hl. Also ein Album f&uuml;r die besondere Gelegenheit.
Sollten Chris n&auml;chste drei Alben genauso werden, d&uuml;rfte eine
gewisse Eint&ouml;nigkeit eintreten. Aber wieso schreibe ich das hier?
Es ist Chris Deb&uuml;t, mit Emo-Rock der G&uuml;teklasse 1A (mal sanft,
mal wild), und das wirklich von Track eins bis Track 13. Klasse!!!


</TD>
</TR>
</TABLE></CENTER>

<CENTER><TABLE BORDER=0 CELLSPACING=2 CELLPADDING=6 WIDTH="88%" >
<TR>
<TD WIDTH="20"><A HREF="#inhalt"><IMG SRC="arrowbac.gif" BORDER=0 HEIGHT=31 WIDTH=114></A>
</TD>

<TD>
<DIV ALIGN=right>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>

</DIV>
</TD>
</TR>
</TABLE>
</CENTER>

<P><A NAME="A5"></A>
<BR>
<HR ALIGN=LEFT NOSHADE WIDTH="100%">
<CENTER>
<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="90%" BGCOLOR="#000000" >
<TR>
<TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#33CCFF" >
<TR>
<TD><B>Yes: "The Ladder"</B></TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>

<CENTER><TABLE BORDER=2 CELLSPACING=0 CELLPADDING=20 COLS=1 WIDTH="90%">
<TR>
<TD BGCOLOR="#FFCC99">

<BR>Ich sag Ja zu Yes! Ich geb&acute;s zu: <B>Yes</B> sind meine alten
Helden! Auch wenn eine objektive Beurteilung in diesem Fall sehr schwierig
ist, ist wohl die H&ouml;chstwertung mehr als gerechtfertigt. Wie ich schon
vor einiger Zeit in der <B>Toto</B>-Vorstellung schrieb, bin ich gerade
bei meinen Lieblingsbands besonders kritisch und juble nicht automatisch
jedes R&uuml;lpsen hoch, solange es von einer meiner Lieblingsbands kommt.
Yes gibt es schon seit den Siebzigern und z&auml;hlten damals zu den ganz
gro&szlig;en Prog-Rock-Bands neben <B>Genesis</B>. In den Achtzigern wurden
sie etwas kommerzieller und landeten mit dem Album 5051 (oder so &auml;hnlich!)
einen Megaseller. <B><FONT COLOR="#990000">Owner Of A Lonly Heart</FONT></B>
war ihr gr&ouml;&szlig;ter Hit daraus.

<P>Nach einer kurzen Aufl&ouml;sung gab es Anfang der Neunziger eine Reunion.
<B><FONT COLOR="#990000">Talk</FONT></B>
hie&szlig; ihr letztes Album. Reiht sich problemlos in die Reihe der mehr
als gelungenen Alben aus den Achtzigern. Wem <B><FONT COLOR="#990000">Big
Generator</FONT></B> gefiel, wird an Talk seine helle Freude finden. Nun
ist das neue Album drau&szlig;en, produziert von <B>Bruce Fairbairn</B>
(Bon Jovi, Loverboy, AC/DC, Aerosmith, Metallica usw.). Und es ist famous
geworden. Zwar h&auml;lt sich das progressive Element bei vielen Titeln
vornehm zur&uuml;ck und bietet f&uuml;r Prog-Rock-Fans auch keine besonderen
&Uuml;berraschungen, dennoch sprudelt das Werk vor Leben. Jon Anderson
singt so gut wie immer, die Musik ist filigran, bietet Raggae-Elemente,
afrikanische Rythmen, straighten Anglo-Rock und wundersam sch&ouml;nen
Melodien.

<P>W&auml;hrend viele Bands im Laufe der Zeit immer mehr zu langweilen
anfangen, schaffte Yes es immer interresant zu bleiben. Jon Andersons hohe
Stimme mag manch einen zuerst etwas "abschrecken", aber sehr schnell merkt
man das seine Stimme perfekt zur Musik pa&szlig;t. Die Titel <B><FONT COLOR="#990000">It
Would Be A Good Day</FONT></B> und <B><FONT COLOR="#990000">If Only You
Knew</FONT></B> sind Progfrei und somit ideale Singleaukopplungen. Und
da die Welt ungerecht ist, kann ich euch prophezeien das es mit Sicherheit
keine Yes-Single in die Charts schaffen wird - obwohl es besser ist als
irgendwas sonst in den Top Twenty&acute;s dieser Welt! Das Album ist dazu
der Soundtrack zum dem PC-Spiel <B>Homeworld</B>. Das Demo zu dem Spiel
und ein kurzes Interview sind im Multimedia-Teil der CD zu finden. Ich
sag wie es ist: Das Album ist eine Wucht! Yes-Freunde werden Freudentr&auml;nen
vor Gl&uuml;ck weinen, wenn sie das Werk zum ersten mal h&ouml;ren. Selbst
f&uuml;r Yes-Unkundige gilt: Wenn ihr halbwegs was mit sch&ouml;nen Rocksongs
anfangen k&ouml;nnt, werdet ihr von <B><FONT COLOR="#990000">The Ladder</FONT></B>
nicht entt&auml;uscht sein!!! Mit einem Knall haben Yes wieder bewiesen wie 
ein Album mit Klassiker-Qualit&auml;ten zu klingen hat!


</TD>
</TR>
</TABLE></CENTER>

<CENTER><TABLE BORDER=0 CELLSPACING=2 CELLPADDING=6 WIDTH="88%" >
<TR>
<TD WIDTH="20"><A HREF="#inhalt"><IMG SRC="arrowbac.gif" BORDER=0 HEIGHT=31 WIDTH=114></A>
</TD>

<TD>
<DIV ALIGN=right>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>

</DIV>
</TD>
</TR>
</TABLE>
</CENTER>

<P><A NAME="A6"></A>
<BR>
<HR ALIGN=LEFT NOSHADE WIDTH="100%">
<CENTER>
<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="90%" BGCOLOR="#000000" >
<TR>
<TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#33CCFF" >
<TR>
<TD><B>David Bowie: "Hours"</B></TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>

<CENTER><TABLE BORDER=2 CELLSPACING=0 CELLPADDING=20 COLS=1 WIDTH="90%">
<TR>
<TD BGCOLOR="#FFCC99">

<BR>David Bowie ist auch schon seit Urzeiten im Gesch&auml;ft. Und in all
den Jahren schaffte er es immer ein gewisses Niveau zu halten, egal welche
Musik er auch machte. Nicht nur sein &auml;u&szlig;eres &auml;nderte sich
oft, auch die Musik hatte stets viele neue Schattierungen zu bieten. Zwar
dominierte dabei die Rockmusik, zweilen konnte er auch sehr poppig werden.
Er lie&szlig; sich auch oft von der jeweilig angesagten Musikrichtung beeinflu&szlig;en.
Was aber in seinem Fall nichts mit einer Anbiederung am Publikum zu tun
hatte, sondern es stellte immer nur eine legitime Inspirationsquelle f&uuml;r
ihn dar.

<P>Mit dem Projekt <B>Tin Machine</B> lie&szlig; er den Rocker in sich
raus, mit seinem letzten Album <B><FONT COLOR="#990000">Earthling</FONT></B>
gab es viel Drum &acute;n Bass und andere Techno-Spielarten wie Jungle
zu h&ouml;ren. Aber Basis waren immer noch richtige Songs. Sein neues Album
<B><FONT COLOR="#990000">Hours</FONT></B> ist wieder bodenst&auml;ndiger
geworden. Mit <B><FONT COLOR="#990000">Tuesday Child</FONT></B>, <B><FONT COLOR="#990000">Survive</FONT></B>
und <B><FONT COLOR="#990000">Seven</FONT></B> bietet er gar drei gro&szlig;artige
Popsongs an, die vom Songwritting her gesehen, mit zu dem Besten geh&ouml;rt,
was ich in diesem Jahr h&ouml;ren durfte. Das aber auch diese Songs keine
Hits werden, liegt an David&acute;s exaltierten Gesang. Da mu&szlig; nicht
jeder Ton ein Wohlklang hervorrufen, nicht jeder gespielte Akkord wie Zuckerwatte
die Ohren verkleben. Bowie&acute;s Musik bietet neben vielen wundersch&ouml;nen
Melodien auch gen&uuml;gend Ecken und Kanten, wie auch unz&auml;hlige kleine
&Uuml;berraschungen in der Produktion, wodurch das h&ouml;ren des Album´s
nie wirklich langweilig wird.

<P>Bowie hat in einem Interview gesagt, das er es erst lernen mu&szlig;te,
"<FONT COLOR="#3333FF">...das Einfaches nicht unbedingt durchschnittlich
sein mu&szlig;</FONT>". Ja, da hat er Recht. Das Album ist zug&auml;nglicher
als seine letzten Alben, aber deswegen l&auml;ngst nicht oberfl&auml;chlicher.
Er schaffte es zumindest theoretisch Kommerz und "Kunst" zu vermischen.
<B><FONT COLOR="#990000">Hours</FONT></B> ist wie das aktuelle Yes-Werk
zum Teil der Soundtrack eines PC-Spiels: <B>Omikron - The Nomad Soul</B>.
Ich wei&szlig; zwar nicht genau welche Titel im Spiel vorkommen, aber im
letzten Drittel des Spiels soll man den jungen Bowie mit Band in einer
Kneipe spielen sehen k&ouml;nnen. Die Titel <B><FONT COLOR="#990000">What&acute;s
Really Happening?</FONT></B>, <B><FONT COLOR="#990000">New Angels Of Promises</FONT></B>
und <B><FONT COLOR="#990000">The Dreamers</FONT></B> w&uuml;rden jedenfalls
von der Stimmung hervorragend zum Spiel passen. Dieses Album ist auf seine
Art ein typisches Bowie-Werk: die Sucht tritt erst bei mehrmaligen h&ouml;ren
auf, dann hat es aber einen entg&uuml;ldig erwischt!


</TD>
</TR>
</TABLE></CENTER>

<CENTER><TABLE BORDER=0 CELLSPACING=2 CELLPADDING=6 WIDTH="88%" >
<TR>
<TD WIDTH="20"><A HREF="#inhalt"><IMG SRC="arrowbac.gif" BORDER=0 HEIGHT=31 WIDTH=114></A>
</TD>

<TD>
<DIV ALIGN=right>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>
<IMG SRC="X1.gif" HEIGHT=36 WIDTH=37>

</DIV>
</TD>
</TR>
</TABLE>
</CENTER>

<P><A NAME="A7"></A>
<BR>
<HR ALIGN=LEFT NOSHADE WIDTH="100%">
<CENTER>
<TABLE BORDER=2 CELLSPACING=2 CELLPADDING=2 WIDTH="90%" BGCOLOR="#000000" >
<TR>
<TD>
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#FFCCCC" >
<TR>
<TD><B>KONSOLEN NEWS:</B></TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>

<CENTER><TABLE BORDER=2 CELLSPACING=0 CELLPADDING=20 COLS=1 WIDTH="90%">
<TR>
<TD BGCOLOR="#FFCC99">

<B><U><FONT COLOR="#CC0000">SONY:</FONT></U></B>

<P>Jetzt ist es raus: Der PlayStation-Nachfolger wird <B>PlayStation 2</B>
hei&szlig;en. Urgs! Sicher, der Name PlayStation hat sich einen ausgezeichneten
Ruf erarbeitet, aber ich denke kaum das der Kunde schwierigkeiten h&auml;tte,
eine neue Konsole von Sony, die z.B. EmotionStation hei&szlig;t (basierend
auf der EmotionEngine), als den offiziellen PlayStation-Nachfolger zu erkennen.
In einer Zeit, wo sogar Prozessoren nicht mehr durchnummeriert werden,
sondern schicke Namen bekommen (Athlon, Willametta, Itanium), f&auml;llt
Sony in tiefste Einfallslosigkeit. Zumal es Mi&szlig;verst&auml;ndnise
hervorufen kann, nach dem Motto: "<FONT COLOR="#3333FF">Von welcher PlayStation
sprichst du gerade? Von der Ersten oder der Neuen?</FONT>". Oder wenn bei
einer telefonischen Bestellung eines Spieles das f&uuml;r PSX und PSX2
erscheint, man die falsche Version geschickt bekommt, weil der Versandh&auml;ndler
eine l&auml;ppische "2" bei der Bestellaufnahme &uuml;berh&ouml;rte.

<P>Nicht tragisch, sicher. Wo Sony mehr Phantasie zeigte war das Design.
Die Konsole ist einem sch&ouml;nem Schwarz gehalten und hat dank K&uuml;hlrippen
&Auml;hnlichkeit mit einer Endstufe oder einem Heizk&ouml;rper. Der Clou
schlechthin, ist die M&ouml;glichkeit die PSX2 senkrecht in Betrieb zu
nehmen, was mit den zwei St&uuml;tzen wirklich superschick aussieht. Bei
den Joypads handelt es sich um das <B>Dual-Shock-Joypad 2</B>. Fast Identisch
mit den herk&ouml;mmlichen Dual-Shock-Joypads, mit dem Unterschied, das
auch die Kn&ouml;pfe (au&szlig;er START und SELECT) analog abgefragt werden.
Was vielen dabei sauer aufst&ouml;&szlig;t, ist die Tatsache, das nur zwei
Joypad-Anschl&uuml;&szlig;e an der Konsole sind. M&ouml;chte man zu Dritt
oder Viert spielen, mu&szlig; man sich einen entsprechenden Adapter zulegen.

<P>Tolle Neuigkeit: Die PSX2 wird nun <U>definitiv</U> DVD-Filme abspielen
k&ouml;nnen! H&auml;tte mich auch gewundert, da ja Sony Mitglied des DVD-Konsortiums
ist. Die technischen Daten der PSX2 haben sich nicht ge&auml;ndert. In
einer &auml;lteren Ausgabe habe ich sie ja schon ausf&uuml;hrlich vorgestellt.
Nur eins ist noch Erw&auml;hnenswert: Die Memorycards bekommen satte 8
MB spendiert. Im Vergleich zu den mageren 128 Kb der PlayStation und des
Dreamcast (!), ein richtiger Quantensprung. Die PSX2 kann drei Formate
"abspielen": PSX1-CD&acute;s, DVD&acute;s und PSX2-CD&acute;s. Das legt
nat&uuml;rlich nahe, das Spiele nicht unbedingt auf DVD erscheinen m&uuml;&szlig;en,
sondern auch auf den (noch) preiswerteren Compact Discs. Und da es sich
hierbei um ein neues und spezielles Format handelt, soll wohl auch die
Kopierbarkeit der Spiele unterbunden werden. In Japan erscheint die PSX2
am 4. M&auml;rz 2000, Europa und USA sollen im Herbst folgen.

<P>Zu den Launch-Titeln geh&ouml;ren viele Sequels zu erfolgreichen Spielen,
was wohl normal ist. Die Entwicklung komplett neuer Spiele und Spielkonzepte
dauert ihre Zeit. Auf der Launchliste (Japan) stehen zu Zeit:

<CENTER>
<P>Gran Turismo 2000 (Rennspiel)
<BR>Tekken Tag Tournament (Pr&uuml;gelspiel)
<BR>New Ridge Racer (Rennspiel)
<BR>Street Fighter EX 3 (Pr&uuml;gelspiel)
<BR>Kessen (Strategie)
<BR>The Bouncer (Action)
<BR>ATrain IV (Simulation)</CENTER>

<P>Eine interresante Meldung: Der achte Teil der legend&auml;ren Final
Fantasy-Serie ist vor kurzen in Japan erschienen. Da wurde gleich bekanntgegeben,
das der neunte Teil auch noch f&uuml;r die PlayStation 1 erscheinen wird
und erst Final Fantasy X f&uuml;r PlayStation 2. Das interresante dabei
ist das Budget, das man bei Squaresoft f&uuml;r den 10. Teil veranschlagt
hat: sage und schreibe 40 Millionen US-Dollar!!! Uff.
<BR>

<P><B><U><FONT COLOR="#CC0000">SEGA:</FONT></U></B>

<P>So sieht die erste Zwischebilanz aus: In Japan ist Dreamcast ein milder
Flop, in den USA l&auml;uft es prima, in Deutschland gab es mehr Pannen
als Eitel Sonnenschein: Nicht nur das sich der Launch trotz der eh schon
langen Wartezeit um weitere 3 Wochen versp&auml;tete, gab&acute;s statt
den versprochenen 80.000 Konsolen am Erstverkaufstag nur 40.000. Sega braucht
sich also nicht wundern, wenn sie so wieder viele Kunden verprellt hat.
Die angek&uuml;ndigte riesige Werbekampagne kann man bis jetzt auch bestenfalls
nur als Strohfeuer bezeichnen. Und was eine Schweinerei von Sega ist: Nicht
nur das Europa mit einem 33.6 kb Modem abgespeist wurde, liegt in dem Dreamcast-Karton
nur ein simples AV-Kabel (Antennen-Ausgang) bei. Ein vern&uuml;nftiges
RGB-Kabel kostet schlappe 50-60 DM. Wer seinen Dreamcast ein einem Monitor
anschlie&szlig;en will darf noch mal tief in die Brieftasche greifen. Spiele
kosten zwischen 90 und 120 DM, wobei der Gro&szlig;teil der Spiele gute
100 DM kosten.

<P>Bei den Nintendo-Modulen waren hohe Preise aufgrund der Cartridges zumindest
nachvollziehbar und das DVD-Spiele zu Beginn auch ihr Geld kosten, wundert
einen nicht wirklich. Aber wie bittesch&ouml;n erkl&auml;rt Sega diese
Preise? Bei dem Giga-Disc-Format handelt es sich im Prinzip um nichts anderes
als herk&ouml;mmliche CD-Roms, bei denen durch ein spezielles Format die
Kapazit&auml;t auf etwa 1 GB erh&ouml;ht wurde. Wenn das der Grund sein
soll, dann wurde er zu teuer erkauft. Man kann es drehen wie man will,
Dreamcast steht schon in der Gefahr, wie der Saturn zu seiner Zeit, zu
floppen. Das Spieleangebot ist durchaus gut, aber es fehlen die Killer-Applikationen.
Bestenfalls f&uuml;r Pr&uuml;gelfans stellt Dreamcast eine "must-have"-Konsole
dar, dank Soul Blade, Power Stone und Virtua Fighter 3 tb, besseres bekommt
man auf keiner Plattform. Shenmue k&ouml;nnte eine solche Applikation werden.
Viele Rennspielfans vermissen "echte" Rally-Simulationen wie McRae Rally
oder V-Rally, sowie ein Formel-1 Spiel mit offizieller FIA-Lizenz. Action-Adventures
sind zumindest gen&uuml;gend angek&uuml;ndigt und auch etliche Horror-Titel
sind in der Mache.

<P>Die Spiele die es bis jetzt gibt sind fast alle sehr Arcade-lastig,
haben ein schnelles, leicht erlernbares Gameplay mit viel Fun zu bieten,
aber mit wenig Spieltiefe. Erscheinen in den n&auml;chsten 2-3 Monaten
gen&uuml;gend Spiele mit "Anspruch" und guten Namen wie Shadowman, Tomb
Raider IV oder Biohazard - Code Veronica (Exklusiv-Teil aus der Resident
Evil-Serie), sowie Killer-Applikationen (Shenmue, Quake Arena) und &uuml;berzeugt
die Onlinef&auml;higkeit der Konsole auch in der Praxis, ist f&uuml;r Sega
noch nichts verloren. Macht aber Sega noch mehr Fehler, siehts zunehmend
d&uuml;ster aus. Dreamcast ist zur Zeit noch ziemlich Freak-lastig und
viele Konsolenspieler sind bereit auf den Herbst 2000 zu warten. Wach auf
Sega: Dreamcast ist nicht automatisch ein Selbstl&auml;ufer, nur weil es
die leistungsf&auml;higste Konsole zur Zeit auf dem Markt ist!

<P>Ich habe in einer &auml;lteren Fastfood-Ausgabe geschrieben, das ich
mir p&uuml;nktlich zum Dreamcast-Start einen Dreamcast besorge. Habe ich
bis jetzt noch nicht getan. So um Januar/Februar herum werde ich micht
entg&uuml;ldig entscheiden. Schliesslich ist auch Dreamcast nicht billig.
Wenn man sich alles wichtige Zubeh&ouml;r und etwa 2-3 Spiele kauft, kratzt
man schon an der ein Tausend-Mark-Grenze. Zur Zeit stehen die Chancen 60:40
das ich mir trotz allem ein DC kaufen werde.
<BR>

<P><B><U><FONT COLOR="#CC0000">NINTENDO:</FONT></U></B>

<P>Bez&uuml;glich des <B>Dolphin</B> gibt es nichts Neues. An dem weltweiten
Launch Ende 2000 h&auml;lt man immer noch fest. Nintendo-Freaks sollten
sich aber trotzdem mit dem Gedanken anfreunden, das sich der PAL-Launch
bis zum 2. Quartal 2001 hinzieht. Nintendo neigte schon immer zur gro&szlig;en
Klappe.

<P>Die Tatsache das die Firma Nintendo immer noch so finanziell gut dasteht,
haben sie in den letzten Jahren allein dem Gamboy zu Verdanken. Das N64
hat sich halbwegs gemausert, weshalb man diese Konsole mit Sicherheit nicht
als Flop bezeichnen kann, aber vom Erfolg eines SNES kann das N64 nur tr&auml;umen.
Mit sage und schreibe 80 Millionen verkauften Game Boys ist dies die meistverbreitete
"Konsole" aller Zeiten. Die PlayStation liegt derzeit bei gut 55 Millionen
verkaufter Exemplare. Mit dem Game Boy Pocket und seit kurzem dem Game
Boy Color hat Nintendo in den letzten 1,5 Jahren eine solide Modelpflege
mit ihrem Klassiker betrieben.

<P>F&uuml;r viele &Uuml;berraschend, hat Nintendo einen offiziellen Game
Boy Nachfolger angk&uuml;ndigt. Zur Zeit nennt es sich noch <B>Game Boy
Advance</B> und wird in Zusammenarbeit mit Konami entwickelt. Der britische
Chiphersteller ARM entwickelt den 32Bit-Prozessor. Eine Schnittstelle f&uuml;r
das Internet, die mittels Handy gespeist wird, soll Online-Spiele jetzt
auch unterwegs m&ouml;glich machen. Die Leistung wurde nebul&ouml;s zwischen
einem SNES und der PlayStation eingeordnet. Das Handheld soll vorrausichtlich
im August 2000 in Japan erscheinen und kurz darauf im Rest der Welt.
<BR>

<P><B><U><FONT COLOR="#CC0000">MICROSOFT:</FONT></U></B>

<P>Das Microsoft mit dem Gedanken spielt eine Konsole auf den Markt zu
bringen und auch bei renomierten Firmen der Spielindustrie nach den Erfolgsaussichten
fragte, ist kein Ger&uuml;cht mehr. Wenn ihr dies hier lest hat Bill Gates
und sein Team eine entg&uuml;ldige Entscheidung getroffen, ob die sogenannte
<B>X-Box</B>
realisiert wird oder nicht. Nun die groben Fakten: Als Prozessor soll ein
hochgetakteter Athlon seinen Dienst verrichten. Als Grafikkarte wurde NVideas
GeForce 256 favourisiert. 64 MB Arbeitspeicher und DVD-Laufwerk runden
die Hardware ab. Die Leistung soll in etwa die einer PlayStation 2 entsprechen.
Nat&uuml;rlich l&auml;uft das ganze dann unter Windows CE. PC-Spiele sollen
dann wirklich extrem leicht und schnell umgesetzt werden k&ouml;nnen: Install-Routinen
raus, Controller-Routine rein und fertig!

<P>Eines ist merkw&uuml;rdig: Die Konsole will Microsoft als reine Softwarefirma
auch gar nicht selbst bauen. Die Firmen <B>Dell</B> und (nicht lachen!)
<B>Gateway</B>
sollen hier Interesse bekundet haben.&nbsp; X-Box Spiele kosten den Firmen
auch keine Lizenz-Geb&uuml;hren die an Microsoft gezahlt werden m&uuml;&szlig;en.
Wenn man so will, hat Microsoft kaum was davon, au&szlig;er eins: Microsoft
m&ouml;chte wohl entg&uuml;ldig auch die Konsolen-Szene mit ihrem Betriebsystem
"unterwandern". Das Dreamcast l&auml;uft optional auch unter WinCE, aber
kaum ein Spielehersteller nutzt dieses Betriebsystem, da es die Performance
des Dreamcast doch deutlich herabsetzt. Zumal noch in den Sternen steht,
ob Dreamcast in ein bis zwei Jahren noch eine bedeudente Rolle spielt.

<P>Es w&auml;re wirklich der Horror, wenn es in wenigen Jahren keine Konsole
mehr g&auml;be, auf der nicht Windows liefe. Aber das ist zum Gl&uuml;ck
nicht sonderlich Wahrscheinlich, da bei Konsolen der Preis-/Leistungs-Aspekt
eine &uuml;beraus wichtige Stellung einnimmt. Und das Windows, egal welche
Version, die Leistung einer Hardware bremst ist allgemein bekannt und die
Einsicht, das der Endkunde somit weniger Leistung f&uuml;r das Geld bekommt.
Sony hat mit der Linux-Wahl Verstand gezeigt.

<P>Was w&uuml;rdet ihr davon halten, wenn Gateway diese X-Box baut und
dann Amiga nennt? ;)


</TD>
</TR>
</TABLE></CENTER>

<CENTER><TABLE BORDER=0 CELLSPACING=2 CELLPADDING=6 WIDTH="88%" >
<TR>
<TD WIDTH="20"><A HREF="#inhalt"><IMG SRC="arrowbac.gif" BORDER=0 HEIGHT=31 WIDTH=114></A>
</TD>

<TD>
<DIV ALIGN=right>

</DIV>
</TD>
</TR>
</TABLE>
</CENTER>

</BODY>
</HTML>

