


<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Metal Corner by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=red bgcolor=black link=green alink=red>
<CENTER>
<img src="metalcorner.png">
<P><H1><FONT COLOR="GREEN">Metal Corner 12/99</FONT></H1></P>
 <a href ="#Vorwort.html">Vorwort</A><BR>
 <a href ="#News.html">News</a><BR>
 <a href ="#CDReviews.html">CD Reviews</A><BR>
 <a href ="#lyrics.html">Interessante Lyrics</A><BR>
 <a href ="#tour.html">Tourdaten</A><BR>
 <a href ="#Top10.html">Top 10</A><BR>
 <a href ="#Outro.html">Abschlieﬂend</A></P>
<hr>
<a name="Vorwort.html"></CENTER>
<h1><CENTER><FONT COLOR="YELLOW">Vorwort</FONT></CENTER></h1><p>

<u>Seid gegr&#252;&#223;t!</U><BR>
Wie Ihr es mitlerweile hoffentlich schon gewohnt seid, erscheint auch diesen
Monat wieder eine neue Ausgabe der Metal Corner. F&#252;r diese Ausgabe habe ich
leider nicht die Zeit gefunden, ein &quot;Special&quot; zu verfassen, aber daf&#252;r
gibt`s diesesmal zum Ausgleich mehr CD Reviews, was hoffentlich auch in
Eurem Sinne ist. Eine Bitte habe ich aber trotzdem noch an Euch da drau&#223;en:
Schreibt mir, was man an der Metal Corner verbessern kann oder was anders
gemacht werden sollte. Auch Ideen f&#252;r neue Rubriken werden gerne angenommen.
Aber jetzt erstmal viel Spa&#223; mit der letzten Ausgabe in diesem
Jahr!</P>
<CENTER>

                        Kilian<BLINK> &quot;The Bruce&quot;</BLINK>
Servais</P></CENTER>
<hr>
<a name="News.html">
<h1><CENTER><FONT COLOR="WHITE">News</FONT></H1></CENTER><p>
<ul>


<li> Reunions stehen zur Zeit wohl auf der Tagesordnung. So wollen sich nun
auch die Black Metaller <B>Celtic Frost</B> (dessen `85er Album &quot;To Mega Therion&quot;
heute Kultstatus besitzt) reformieren. Angeblich ist sogar schon ein
Festival f&#252;r n&#228;chstes Jahr gebucht...</P><BR>

<li> Reunion Nr.2: Die U.S. Power Metaller <B>Racer X</B> haben sich zusammengerauft
(allerdings ohne Drummer Scott Travis, der nach wie vor bei <B>Judas Priest</B> in
Lohn und Brot steht) und wollen evtl. noch dieses Jahr ein Comeback Album
auf die Menschheit loslassen. Laut Mastermind Paul Gilbert sind die
Aufnahmen dazu schon im vollen Gange.</P><BR> 

<li> Joey Belladonna (ex-<B>Anthrax</B>) hei&#223;t der neue S&#228;nger bei <B>Vicious Rumors</B>.
Aber bei den Rumors gibt`s noch weitere Personelle Ver&#228;nderungen: F&#252;r
Drummer Larry How sitzt jetzt Chris Newman hinter der Schie&#223;bude und Bassist
Tommy Sisco wurde durch einen gewissen Cornbread ersetzt.</P><BR>

<li> Bei <b>Testament</B> ist Gitarrist James Murphy &#252;berraschend ausgestiegen. Als
kurzweiligen Ersatz stellen die Jungs Steve Jacobs (ex-<B>Forbidden, Man Made
God</B>) vor.</P><BR>

<li> Nachdem es die letzten Monate etwas ruhig um die True Metal Dauerbrenner
von <B>HammerFall</B> geworden war, stellt die Band nun offiziell Anders Johansson
(Bruder von <B>Stratovarius</B> Keyborder Jens Johansson) als neuen Drummer vor.
Das n&#228;chste Album wird aber noch etwas auf sich warten lassen: Vor August
2000 sei damit nicht zu rechnen.</P><BR>

<li> Die deutschen Power Metaller <B>Edguy</B> wollen ihr Debutalbum &quot;Savage Poetry&quot;
neu einzimmern. Nichts gegen den Tatendrang der begnadeten Band, aber nach
den Ank&#252;ndigungen der letzten Monate (Coveralbum, Rockoper) sollten die Band
auch mal mit was handfestem r&#252;berkommen.</P><BR>

<li> Die Evergreens <B>Gamma Ray</B> wollen demn&#228;chste eine Best Of rausbringen,
welche von den Fans per Internet Befragung zusammengestellt wurde. Und jetzt
kommt`s: Alle Songs, die nicht mit dem aktuellen Line-up eingespielt wurden
(also alle Songs, die nicht von &quot;Powerplant&quot; und &quot;Somewhere Out In Space&quot; gew&#228;hlt wurden)
, sollen neue eingeh&#228;mmert werden. Mit ziemlicher Sicherheit wird das auch
f&#252;r Fans interessant, die schon alle Alben der Hamburger ihr eigen
nennen....</P><BR>

<li> Nun also doch! Nach vielen Ger&#252;chten, ist es nun offiziell: Die Herner
Melodic Power Metaller <B>Custard</B> haben einen neuen Leads&#228;nger. Obwohl der
&quot;Kingdoms Of Your Life&quot; Nachfolger schon fertig eingeh&#228;mmert war und
ursprp&#252;nglich im Oktober erscheinen sollte, haben die Jungs die alten
Gesangsspuren gel&#246;scht und neu einsingen lassen. Erscheinen wird das Teil
hoffentlich noch vor der Jahrtausendwende. Erste H&#246;rproben lassen auf ein
Hammeralbum schlie&#223;en.</P><BR>

<LI> Bassistin D`Arcy Wretkey und die <B>Smashing Pumpkins</B> haben sich getrennt.
Gr&#252;nde wurden nicht gennant; ebensowenig eine potentielle
Nachfolgerin.</P><BR>

<li> Das Debutalbum des Projekts <B>Demons &amp; Wizards</B> (mit <B>Iced Earth</B> Chef Jon
Schaffer und <B>Blind Guardian</B> Frontsirene Hnasi K&#252;rsch) soll nun Anfang
n&#228;chsten Jahres erscheinen und alles bisher dagewesene in den Schatten
stellen. Wir warten jetzt schon sehns&#252;chtig.... </P><BR></UL>


<hr>
<a name="CDReviews.html">
<h1><CENTER><FONT COLOR="BLUE">CD Reviews</FONT></H1></CENTER><p>


<h2><CENTER>Luca Turilli: King Of The Nordic Twilight</h2></CENTER></P>

Nach dem durchschlagendem Erfolg von Rhapsody (Power Metal mit klassischen
Elementen) war es nur eine Frage der Zeit, bis Gitarrist &amp; Songwriter Luca
Turilli eine Soloscheibe auf den Markt bringt. Das es allerdings so schnell
gehen w&#252;rde, hat viele &#252;berrascht. Wie auch immer: Mit &quot;King Of The Nordic
Twilight&quot; hat Luca Turilli nun seine erste Soloscheibe ver&#246;ffentlicht, die
nat&#252;rlich stark an Rhapsody angelehnt ist. Neben einer &#228;hnlichen Gestaltung
des Bookletts ist damit vor allem die Musik gemeint, die auch gut und gerne
auf einem der beiden bisher erschienenen Rhapsody Alben verewigt sein
k&#246;nnte, wenngleich das ganze einen Tick eing&#228;ngiger und weniger verspielt
wirk. Der Hauptunterschied zu Rhapsody liegt eigentlich nur beim S&#228;nger:
Olaf Hayer ist f&#252;r die Vocals auf dieser Scheibe verantwortlich und macht
einen &#228;u&#223;erst talentierten Eindruck. Seine guten Vocals (&#228;hnlich Fabio Lione
von Rhapsody) veredeln solche eing&#228;ngigen Kracher wie &quot;Black Dragon&quot;,
&quot;Legend Of Steel&quot; oder &quot;The Ancient Forest Of Elves&quot; (wer &quot;Emerald Sword&quot;
von Rhapsody kennt, kann sich daran orientieren). Aber auch balladeske
Kl&#228;nge finden sich auf der CD wieder: So sind &quot;Princess Aurora&quot; und &quot;Where
Heroes Lie&quot; zwei langsamere &amp; getragene St&#252;cke, die etwas Abwechselung in
die ansonsten sehr rifforientierte Scheibe bringen. Die finale Kr&#246;nung des
ganzen ist aber der 10 min&#252;tige, epische Titeltrack &quot;Kings Of The Nordic
Twilight&quot;, der alle Trademarks von Rhapsody (bzw. Luca Turilli) in sich
vereint. Hier wird besonders deutlich, wie gut es Luca Turilli versteht,
Metal mit klassiscshen Elementen (die auf der ganzen CD vorhanden sind) zu
verbinden und daraus &#228;u&#223;erst ansprechende und vor allem eing&#228;ngige Musik zu
schaffen. &#220;ber Sinn und Unsinn eines solchen &quot;Soloalbums&quot; (das im Grunde,
bis auf das unterschiedliche Line-up, nichts anderes als Rhapsody ist) kann
man sich nat&#252;rlich nun streiten. Fakt ist, da&#223; &quot;King Of The Nordic Twilight&quot; eine
markellose CD ist, die jedem Rhapsody und Melodic Power Metal Fan nur
w&#228;rmstens empfohlen werden kann.</P>

Fazit: 9.5 von 10 Punkten</P><CENTER>
<img src="kit.gif"></p>
<img src="mccov1.jpg"></P>
<img src="kit.gif"></P>


<h2>Rough Silk: Wheels Of Time - 2CD Best Of</h2></CENTER></P>

&#220;ber den Sinn und Unsinn von Best Of`s kann man sich immer wieder streiten
und nur selten wird man zu Ergebnissen kommen. Auch die deutschen Melodic
Metaller Rough Silk ver&#246;ffenlichen zum 10 j&#228;hrigen Bandbestehen eine Best
Of, die gleich auf zwei randvollen CD`s daherkommt und das bisherige
musikalische Schaffen der str&#228;flich unterbewerteten Band aus allen Epochen
dokumentiert. Neben &#228;lteren Kompositionen wie &quot;Roots Of Hate&quot;, &quot;The Clown&quot;
oder auch &quot;The End&quot; befindet sich auch Material vom letzten Studioalbum
&quot;Beyond The Sundown&quot; auf den beiden Silberscheiben. Zwar fehlen mir
pers&#246;nlich einige Songs von Rough Silk, die zu meinen pers&#246;nlichen Favoriten
z&#228;hlen (z.B. &quot;The Mysterious Boot Hill Grave Inscription&quot; oder &quot;Toxical
Roses&quot;), aber dennoch ist die Zusammenstellung im gro&#223;en und ganzen recht
representativ f&#252;r die Band. Um die Compilation auch f&#252;r langj&#228;hrige Fans
interessant zu machen, hat man noch 4 neue Songs (davon eine Billy Joel
Coverversion), die allesamt auf dem &#252;blichen Rough Silk Niveau stehen und
keine musikalischen Ver&#228;nderungen mit sich bringen, zwei Remixe, zwei
neuaufgenommene Versionen (&quot;In The Deep Of The Night&quot; und &quot;Never Lose
Again&quot;) und einen bisher unver&#246;ffentlichten Track auf die beiden CD`s
gepackt. Positiv bemerkbar macht sich auch das liebevoll gestaltete
Booklett, das nochmal eindrucksvoll beweist, da&#223; &quot;Wheels Of Time&quot; nicht
einfach nur eine auf die schnelle dahingeklatschte Best Of ist. Fans des Melodic
Metal, die Rough Silk noch nicht kennen, kann ich diese Best Of (30 DM)
bedingungslos empfehlen; Rough Silk Fans der ersten Stunde m&#252;ssen selber
entscheiden, ob das neue Material den Preis wert ist. Ich jedenfalls habe
den Kauf (obwohl ich alle Rough Silk CD`s habe) nicht bereut.</P>

Fazit:----</P><CENTER>
<img src="kit.gif"></P>
<img src="mccov2.jpg"></P>
<img src="kit.gif"></P>

<h2>Bruce Dickinson: Scream For Me Brazil!</h2></CENTER></P>

9 Jahre lang begl&#252;ckt uns Metal Ausnahmeshouter Bruce Dickinson schon mit
seiner Solokarriere, in der er 5 Studio Alben (wenn man das 1996 Projekt Skunkworks mal dazuz&#228;hlt)
sowie ein Live Album (&quot;Alive At The Marquee&quot;) auf die
Metal Fraktion losgelassen hat. Nun ist er wieder bei Iron Maiden und seine
Solokarriere d&#252;rfte die n&#228;chsten Jahre erstmal auf Eis liegen. Mit &quot;Scream
For Me Brazil&quot; ist ein Livealbum erschienen, das diese &#196;ra (und besonders
die Jahre 1997-1999) nochmal nachhaltig Live festhalten soll. Wie nicht
anders zu erwarten, liegt der Schwerpunkt der Songs auf dem letzten
(superben) Metal Album &quot;The Chemical Wedding&quot;. So ist z.B. der Titeltrack
&quot;The Chemical Wedding&quot; Live noch einen Tick besser, als in der
Studioversion. Aber auch &#228;ltere Sachen wie die Alltime Klassiker &quot;Tears Of
The Dragon&quot; und &quot;Laughing In The Hiding Bush&quot; (beide von &quot;Balls To Picasso&quot;)
sowie die &quot;Accident Of Birth&quot; Gassenhauer &quot;The Road To Hell&quot; und &quot;Darkside
Of Aquarius&quot; d&#252;rfen nicht fehlen. Das ganze wird von einem fenetischen
Publikum unterlegt, das der Live CD einen einzigartigen Stempel aufdr&#252;ckt.
Obligatorischerweise sei noch erw&#228;hnt, da&#223; auch die Band selber an diesem
Abend in bester Spiellaune war und somit musikalisch keine Abstriche gemacht
werden m&#252;ssen. Ganz im Gegenteil: Bruce Dickinson h&#246;rt sich 1999 besser an,
als auf den letzten beiden Iron Maiden Livealben &quot;A Real Live One&quot; bzw. &quot;A
Real Death One&quot;, die beide 1993 erschienen sind und damals das vorl&#228;ufige
Ende von Bruce Dickinson bei Iron Maiden darstellten. Aprospos Iron Maiden:
Es ist schade, da&#223; Bruce Dickinson darauf verzichtete, auch die Iron Maiden
Classics auf die CD zu packen, die genauso zum festen Live Set geh&#246;ren wie
&quot;Tattooed Millionaire&quot; von gleichnahmigen Debutalbum. Das sind aber auch die
einzigsten (kleineren) Wehrmutstropfen.</P>

Fazit: 9 von 10 Punkten</P><CENTER>
<img src="kit.gif"></P>
<img src="mccov3.jpg"></P>
<img src="kit.gif"></P>


<h2>Virgin Steele: The House Of Atreus-Act I</h2></CENTER></P>

&quot;Metal meets Klassik&quot; Projekte gab`s die letzten Monate &amp; Jahre viele,
qualitativ gute hingegen sehr wenig (z.B. Rage). Die US Metal Institution
Virgin Steele haben diesen Spagat nun auch gewagt und sind sogar noch einen
Schritt weiter gegangen: Virgin Steele Bos David DeFeis hat gleich eine
ganze Oper (auf Basis der antiken Geschichte &quot;Der Fluch der Atriden&quot;) komponiert, die
in Deutschland excellente Kritiken einheimsen konnte. Der erste Teil dieser
Oper kann nun, in einer etwas &#252;berarbeiteten Version, auf CD erworben
werden. Virgin Steele Fans, die jetzt allerdings bef&#252;rchten, da&#223; &quot;ihre&quot; Band
nach dem h&#228;rteren letzten Album &quot;Invictus&quot; nun wieder zur&#252;cksteckt, kann
ich beruhigen: &quot;The House Of Atreus&quot; ist im Grunde nichts anderes als ein Album
im Stil der &quot;Marriage Of Heaven And Hell&quot; Triologie (wenn man &quot;Invictus&quot; als 3. Teil betrachtet)
, wenngleich es etwas
mehr klassische Einfl&#252;sse und jede Menge Zwischenpassagen gibt.
Nichtsdestotrotz wird auch f&#252;r den Metal Fan einiges an gutem Material
geboten: Der fast achtmin&#252;tige Opener &quot;Kingdom Of The Fearless&quot; steht ganz
in der Tradition von Invictus St&#252;cken (wobei der Grundriff dort auch schamlos
geklaut wurde) und ist genauso ein typischer Virgin Steele Ohrwurm wie die
Midtemponummer &quot;The Fire God&quot; oder die schnelleren St&#252;cke &quot;Through The Ring
Of Fire&quot; und &quot;Great Sword Of Flame&quot;. Ebenfalls gelungen ist die
abschlie&#223;ende Ballade &quot;Gate Of Kings&quot;, die sehr unter die Haut geht und
jedem Virgin Steele Fan eine G&#228;nsehaut &#252;ber den R&#252;cken laufen l&#228;sst. Aber
auch die Zwischenpassagen sind sehr interessant, da sie die 77 min&#252;tige CD
hervorragend abrunden und den H&#246;rer richtig in die (&#228;u&#223;erst spannende)
Geschichte abtauchen lassen. F&#252;r Virgin Steele Fans sei noch erw&#228;hnt, da&#223;
die ganze Oper mit zahlreichen &#228;lteren Virgin Steele Zitaten versetzt ist
und sicherlich den einen oder anderen Schmunzler hervorkommen l&#228;&#223;t. Alles in
allem ist &quot;The House Of Atreus&quot; ein perfektes episches Metal Album, da&#223; ich
jedem Metal Fan nur empfehlen kann. F&#252;r mich einer der Anw&#228;rter auf das
&quot;Album des Jahres&quot;!</P>

Fazit: 10 von 10 Punkten</P><CENTER>
<img src="kit.gif"></P>
<img src="mccov4.jpg"></P>
<img src="kit.gif"></P></CENTER>
<hr>
<a name="lyrics.html">
<h1><CENTER><FONT COLOR="GRAY">Interessante Lyrics</FONT></h1><P>


F&#252;r diese Ausgabe habe ich mir den Song &quot;Afraid To Shoot Strangers&quot; von
Iron Maiden ausgesucht (Album: Fear Of The Dark). Dieser Song ist wirklich
sehr ergriefend und stark fesselnd. Leider kann ich Euch hier nur die Lyrics
niederschreiben; solltet IHr mal die M&#246;glichkeit haben, in den Song
hineinzuh&#246;ren, dann verpasst diese Gelegenheit nicht!</P>

Lying Awake At Night I Wipe The Sweat<br>
From My Brow<BR>
But It`s Not The Fear `cos<br>
I`d Rather Go Now</P>

Trying To Visualise The Horrors That<br>
Will Lay Ahead<br>
The Desert Sand Mound<br>
A Burial Ground</P>

When It Comes To The Time<br>
Are We Partners In Crime?<br>
When It Comes To The Time<br>
We`ll Be Ready To Die</P>

God Let Us Go Now And Finish What`s<BR>
To Be Done<BR>
Thy Kingdom Come<br>
Thy Shall Be Done.... On Earth</P>

Trying To Justify To Ourselves The<BR>
Reasons To Go<BR>
Should We Live And Let Live<BR>
Forget Or Forgive</P>

But How Can We Let Them Go On This Way?<BR>
The Reign Of Terror Corruption Must End<BR>
And We Know Deep Down There`s<br>
No Other Way<BR>
No Trust, No Reasoning, No More To Say</P>

<u>Refrain:</U><BR>
Afraid To Shoot Strangers<BR>
Afraid To Shoot Strangers</P>




</CENTER>
<hr>
<a name="tour.html">
<h1><CENTER><FONT COLOR="purple">Tourdaten</FONT>
</h1></CENTER></P><CENTER>

<h2><B>Sodom &amp; Tankard &amp; Goddess Of Desire</h2></B></P>

25.12. Engelsdorf, Hellraiser<br>
26.12. Stavenhagen, Tankhaus<br>
27.12. Osnabr&#252;ck, Works<br>
28.12. Spremberg, MTS<BR>
29.12. Ludwigsburg, Rockfabrik<br>
30.12. Bochum, Zeche</P>

<h2><b>Overkill &amp; Dismember &amp; Witchery</h2></B></P>

24.1. Hamburg, Markthalle<br>
25.1. N&#252;rnberg, Hirsch<br>
28.1. Offenbach, Hafenbahn<br>
29.1. Engelsdorf, Hellraiser<br>
30.1. Krefeld, Kulturfabrik</P>

<h2><b>Oomph!</h2></B></P>

1.12. M&#252;nchen, Incognito<br>
2.12. K&#246;ln, Prime Club<br>
4.12. Rostock, Mau<br>
5.12. Berlin, Pfefferberg<br>
7.12. Halle, Easy Schorre<br>
</CENTER>
<hr>
<a name="Top10.html">
<h1><CENTER><FONT COLOR="GREEN">Top 10</FONT></H1><p>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="Gray">
</TR><TR>
<TD>Iced Earth</TD>
<TD>Alive In Athens</TD>
</TR>
<TR>
<TD>Nightwish</TD>
<TD>Oceanborn</TD>
</TR>
<TR>
<TD>Gamma Ray</TD>
<TD>Powerplant</TD>
</TR>
<TR>
<TD>In Extremo</TD>
<TD>Verehrt und angespien</TD>
</TR>
<TR>
<TD>Subway To Sally</TD>
<TD>Hochzeit</TD>
</TR>
<TR>
<TD>Anathema</TD>
<TD>Judgement</TD>
</TR>
<TR>
<TD>Iced Earth</TD>
<TD>Something Wicked This Way Comes</TD>
</TR>
<TR>
<TD>In Flames</TD>
<TD>Colony</TD>
</TR>
<TR>
<TD>Blind Guardian</TD>
<TD>Nightfall In Middle-Earth</TD>
</TR>
<TR>
<TD>Testament</TD>
<TD>The Gathering</TD>
</TR>
</TABLE></P><BR>
Quelle: Rock Hard</P>
</CENTER>
<hr>
<a name="Outro.html">
<H1><CENTER>Abschlieﬂend</h1></CENTER><p>

Ende! Aus! Das war`s.... Zumindest f&#252;r diesen Monat!
Auch n&#228;chsten Monat wird es wieder eine (randvolle; soviel kann ich schonmal
vorwegnehmen) Metal Corner geben. Bei den CD`s wird es neben einem Review
zur neuen Dream Theater CD auch eine Kritik zu der neuen Best Of von
Stratovarius und dem neusten Studiowerk von Rage &quot;Ghosts&quot; geben. Ebenso
geplant ist ein Livebericht zum Rage Konzert vom 21.11. (Bochum; Zeche). Was
es dar&#252;ber hinaus noch geben wird, entscheidet sich kurzfristig. See ya,</P>

Kilian<BLINK> &quot;The Bruce&quot;</BLINK> Servais </P>

<HR>
<CENTER>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><P></A>
</CENTER>
</P>
</BODY>
</HTML>
