<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="bdw / Lars Philipsen">
   <meta name="GENERATOR" content="Mozilla/4.6 [de]C-CCK-MCD QXW0321u  (Win98; I) [Netscape]">
   <title>Astro-Corner 9 - Dezember 1999</title>
</head>
<body background="bkground.gif" bgproperties="fixed">
&nbsp;
<center><table BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#000000" >
<tr>
<td BGCOLOR="#FFCC00"><font size=+2><b>Astro-Corner 9 </b>- <i>Dezember
1999</i></font></td>
</tr>
</table></center>
<u>Hallo NoCover-Leser!</u>
<p>Wieder einmal ist es soweit, eine neue Ausgabe der <b>Astro-Corner</b>
ist da. Und wie immer gibt es wieder viel Neues aus den Bereichen der Astronomie
zu berichten.
<p>Los gehts ersteinmal mit dem Inhaltsverzeichnis der aktuellen Ausgabe:
<p><br>&nbsp;
<center><table BORDER=0 COLS=1 WIDTH="85%" BGCOLOR="#C0C0C0" >
<caption align="top">
<center><a NAME="Inhaltsverzeichnis"></a><b><u>I N H A L T</u></b></center>
</caption>

<tr>
<td BGCOLOR="#CCCCCC">
<center><a href="#1">Galaxien-Kollision mit den Augen Chandras beobachtet</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#2">Jetzt endg&uuml;ltig: Kein Wasser bei Absturz des
Mondsatelliten Lunar-Prospector entdeckt</a></center>
</td>
</tr>

<tr>
<td BGCOLOR="#CCCCCC">
<center><a href="#3">Entstehung eines kosmischen Jets bei einem Schwarzen
Loch beobachtet</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#4">Milchstra&szlig;e schluckte mehrere Zwerggalaxien</a></center>
</td>
</tr>

<tr>
<td BGCOLOR="#CCCCCC">
<center><a href="#5">Planet umkreist Doppelsternsystem</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#6">Im All k&ouml;nnen aus Gasplasma Kristalle entstehen&nbsp;</a></center>
</td>
</tr>

<tr>
<td BGCOLOR="#CCCCCC">
<center><a href="#7">Junge Galaxien waren die Geburtsmaschinen der Sterne</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#8">Universum unerwartet staubig</a></center>
</td>
</tr>

<tr>
<td BGCOLOR="#CCCCCC">
<center><a href="#9">Riesiger Vulkan auf Jupiter-Mond Io &auml;hnelt Kilauea
auf Hawai&nbsp;</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#10">&Uuml;berreste einer zerst&ouml;rten Galaxie im Hinterhof
der Sonne gefunden</a></center>
</td>
</tr>

<tr>
<td BGCOLOR="#CCCCCC">
<center><a href="#11">Unterschiedliche Meteoriten haben den gleichen Ursprung&nbsp;</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#12">Nachfolger f&uuml;r Hubble: 4 Millionen bewegliche
Mikrospiegel erlauben Blick in die "Dark Zone"&nbsp;</a></center>
</td>
</tr>

<tr>
<td BGCOLOR="#CCCCCC">
<center><a href="#13">Stern aus ungew&ouml;hnlicher Materie im Sternbild
des Sch&uuml;tzen?</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#14">Erster direkter Beweis f&uuml;r einen Planeten au&szlig;erhalb
unseres Sonnensystems</a></center>
</td>
</tr>

<tr>
<td BGCOLOR="#CCCCCC">
<center><a href="#15">Hubble im Winterschlaf</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#16">Neue Erkl&auml;rung f&uuml;r Sonneneruptionen</a></center>
</td>
</tr>

<tr>
<td BGCOLOR="#CCCCCC">
<center><a href="#17">Wandernder Jupiter</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#18">Leoniden: Ganz nett, aber nicht spektakul&auml;r</a></center>
</td>
</tr>

<tr>
<td BGCOLOR="#CCCCCC">
<center><a href="#19">Galaxien sind auch nur Menschen</a></center>
</td>
</tr>
</table></center>

<hr>
<p><i>Astrophysik:</i>
<br><a NAME="1"></a><b>Galaxien-Kollision mit den Augen Chandras beobachtet</b>
<p>(Meldung vom 28.10.1999)
<p>Vom Zentrum der Galaxis Centaurus A geht ein Jet aus R&ouml;ntgenstrahlen
aus, der 25.000 Lichtjahre lang ist - so viel wie der Durchmesser der Milchstra&thorn;e.
Das ist auf einer Aufnahme des R&ouml;ntgenteleskops Chandra zu sehen,
die die Nasa jetzt ver&ouml;ffentlicht hat.
<p><img SRC="acpic1.jpg" ALT="Jet aus Röntgenstrahlen" BORDER=2 height=296 width=300>
<p>Centaurus A ist als besonders aktive Galaxis bekannt, in deren Zentrum
ein supermassives Schwarzes Loch vermutet wird. Au&szlig;er dem Jet, der
von energiereichen Elektronen auf einer Spiralbahn produziert wird, sind
auf der Aufnahme noch andere R&ouml;ntgenquellen zu sehen. Sie liegen auf
einer Kugel rund um den Kern der Galaxis. "Daraus k&ouml;nnen wir schlie&thorn;en,
wie die Galaxis und das supermassive Schwarze Loch im Zentrum entstanden
sind", sagte Christine Jones vom Harvard Smithsonian Center for Astrophysics.
Aus optischen und infraroten Aufnahmen ist bekannt, dass Centaurus A vor
einigen hundert Millionen Jahren mit einer kleinen Spiralgalaxie zusammengesto&thorn;en
sein muss.
<p>Die Wissenschaftler sind begeistert von den Details, die die Chandra-Aufnahme
enth&auml;lt: "Es ist unglaublich, dass wir all diese Strukturen in dem
Jet erkennen k&ouml;nnen", sagte Allyn Tennant vom Marshall Space Flight
Center. Centaurus A ist eine besonders interessante Galaxis, da sie mit
einer Entfernung von elf Millionen Lichtjahren die n&auml;chste sogenannte
aktive Galaxis ist.
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astronomie allg.:</i>
<br><a NAME="2"></a><b>Jetzt endg&uuml;ltig: Kein Wasser bei Absturz des
Mondsatelliten Lunar-Prospector entdeckt</b>
<p>(Meldung vom 2.11.1999)
<p>Auch nach ausf&uuml;hrlicher Auswertung ihrer Daten konnten Wissenschaftler
von der University of Texas keine Hinweise darauf finden, dass die Raumsonde
Lunar Prospector bei ihrem Absturz auf den Mond am 31. Juli Wasser aufgewirbelt
hat. Das berichtete Ed Barker auf einer Tagung der American Astronomical
Society im italienischen Padua.
<p>Barker schlug mehrere Erkl&auml;rungen f&uuml;r dieses negative Ergebnis
vor, die nicht ausschlie&thorn;en, dass einst Wasser mit Kometen auf die
Mondoberfl&auml;che gelangte: Die Sonde k&ouml;nnte zum Beispiel das Ziel
verfehlt haben, sie k&ouml;nnte einen trockenen Flecken erwischt haben,
das Wasser k&ouml;nnte nicht als Eis vorliegen, sondern in Mineralien gebunden
sein. M&ouml;glicherweise haben die Forscher die Form der aufgewirbelten
Wolke nicht richtig berechnet, so dass die Teleskope falsch ausgerichtet
waren - oder die Wolke stieg gar nicht erst bis &uuml;ber den Kraterrand
auf.
<p>Wissenschafler der Nasa hatten ohnehin nur mit einer geringen Chance
f&uuml;r einen Erfolg gerechnet. Trotzdem hatte das Ende des Lunar Prospector
einen Nutzen f&uuml;r die beteiligten Wissenschaftler, sagte David Goldstein
von der University of Texas: "Wir haben nun Erfahrung, ein kompliziertes
Beobachtungsprogramm mit Astronomen rund um die Welt zu koordinieren. Au&thorn;erdem
haben wir etwas &uuml;ber die Eigenschaften der nat&uuml;rlichen Mondatmosph&auml;re
gelernt."
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astrophysik:</i>
<br><a NAME="3"></a><b>Entstehung eines kosmischen Jets bei einem Schwarzen
Loch beobachtet</b>
<p>(Meldung vom 3.11.1999)
<p>Zum ersten Mal ist es Astronomen gelungen, die Entstehung eines energiereichen
Teilchenstrahls - eines sogenannten Jets - innerhalb einer Galaxie detailliert
zu beobachten: Die Wissenschaftler unter Leitung von Bill Junor von der
University of New Mexico beobachteten die 50 Millionen Lichtjahre entfernte
Galaxie M87 mit mehreren Radioteleskopen und stellten fest, dass der Teilchenstrahl
nur Bruchteile eines Lichtjahres vom Zentrum der Galaxie gebildet wird.
Dort vermuten die Wissenschaftler ein Schwarzes Loch.
<p>In der Region, wo der Jet entsteht, &ouml;ffnet er sich zun&auml;chst
mit einem breiten Winkel von 60 Grad. Einige Lichtjahre weiter au&szlig;en
wird der Jet zu einem engen Strahl mit einer &Ouml;ffnung von nur sechs
Grad fokussiert. Wahrscheinlich wird der Strahl aus subatomaren Partikeln
durch ein starkes Magnetfeld fokussiert.
<p>Rund um das Schwarze Loch befindet sich eine schnell rotierende Scheibe
aus Staub und Gas, eine sogenannte Akkretionsscheibe. Durch die Rotation
werden vorhandene Magnetfeldlinien verdreht und verzerrt, vermuten die
Wissenschaftler, und leiten die Teilchen in die Jets. Der Teilchenstrahl
wird wahrscheinlich an den Polen dieser Akkretionsscheibe ausgesto&thorn;en
und fast bis auf Lichtgeschwindigkeit beschleunigt.
<p>Viele Quasare und Radiogalaxien besitzen solche Jets, deren Entstehungsmechanismus
aber bis jetzt noch im Dunkeln lag, da die Astronomen nicht bis in die
Kerne von Galaxien blicken konnten.
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astronomie allg.:</i>
<br><a NAME="4"></a><b>Milchstra&szlig;e schluckte mehrere Zwerggalaxien</b>
<p>(Meldung vom 8.11.1999)
<p>Die Milchstra&thorn;e verleibte sich bei ihrer Entstehung offenbar mehrere
Zwerggalaxien ein: Etwa acht Prozent aller Sterne, die sich im "Halo" der
Milchstra&szlig;e au&szlig;erhalb der galaktischen Ebene befinden, geh&ouml;rten
fr&uuml;her einer anderen Galaxis an, berichten Amina Helmi von der Universit&auml;t
Leiden in den Niederlanden und Kollegen im Fachblatt Nature.
<p>Die Astronomen bestimmten die genauen Geschwindigkeit und Bewegungsrichtung
von 88 Halo-Sternen in einem Umkreis von 3000 Lichtjahren von der Sonne.
Sieben dieser Sterne bilden einen dichten Klumpen, der sich einheitlich
bewegt. Die Wahrscheinlichkeit daf&uuml;r, dass sie sich durch Zufall so
angeordnet haben, ist &auml;u&szlig;erst gering. Wahrscheinlich geh&ouml;rten
sie fr&uuml;her einer Zwerggalaxis an, die mit der Milchstra&thorn;e kurz
nach deren Entstehung zusammenstie&thorn;,s chlie&thorn;en die Forscher.
Der Sternenhaufen Omega-Centauri k&ouml;nnte der Kern einer anderen Zwerggalaxis
gewesen sein. Diese kugelf&ouml;rmige Ansammlung von Sternen ist der hellste
Sternenhaufen unserer Galaxis.
<p>Untersuchungen von Young-Wook Lee von der Yonsei University, in Seoul,
Korea, und Kollegen zeigen, dass es in diesem Haufen zwei Sterngruppen
unterschiedlichen Alters gibt: Die j&uuml;ngeren, metallarmen Sterne entstanden
etwa zwei Milliarden Jahre nach den &auml;lteren, die sehr viel reicher
an Metallen sind. Wahrscheinlich, so vermuten die Forscher, l&ouml;sten
die Gezeitenkr&auml;fte, die die Zwerggalaxis auseinanderrissen, im &uuml;brig
gebliebenen galaktischen Kern eine neue Phase der Sternentstehung aus.
<p>Beide Untersuchungen belegen, dass vor allem die &auml;u&thorn;eren
Teile der Milchstra&thorn;e - ungef&auml;hr au&szlig;erhalb der Bahn der
Sonne - aus fr&uuml;heren Zwerggalaxien bestehen.
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astrophysik:</i>
<br><a NAME="5"></a><b>Planet umkreist Doppelsternsystem</b>
<p>(Meldung vom 8.11.1999)
<p>Amerikanische Wissenschaftler haben zum ersten Mal Hinweise auf einen
Planeten entdeckt, der ein Doppelsternsystem umkreist. Die Forscher unter
der Leitung von David Bennet und Sun Hong Rhie von der Universit&auml;t
von Notre Dame im US-Bundesstaat Indiana untersuchten innerhalb des "Microlensing
Planet Search"-Projektes das Licht eines Sterns, der 1997 hundert Tage
lang als Gravitationslinse f&uuml;r einen anderen Stern diente: Wenn ein
Objekt sich von der Erde aus gesehen vor einen weiter entfernten Stern
schiebt, wird das Licht durch die Gravitationskraft wie von einer Linse
geb&uuml;ndelt und verst&auml;rkt.
<p>Das komplexe Helligkeitsmuster, das sich bei dem untersuchten Ereignis
MACHO-97-BLG-41 ergab, l&auml;sst sich nach Meinung der Forscher dadurch
erkl&auml;ren, dass die Linse ein Doppelsternsystem mit einem Planeten
ist.
<p>Wie sie im Wissenschaftsjournal Nature schreiben, ist der Planet dreimal
so gro&thorn; wie Jupiter. Insgesamt sind bislang 20 Planeten au&szlig;erhalb
unseres Sonnensystems bekannt, die aber alle Einzelsterne umkreisen. "Zwischen
der H&auml;lfte und zwei Drittel aller Sterne in unserer Nachbarschaft
geh&ouml;ren zu Doppel- oder Mehrfachsternsystemen", sagt Morris Aizenman
von der National Science Foundation. "Wenn wir den Beweis f&uuml;r einen
Planeten finden, der ein Sternenpaar umkreist, muss es mehr Planetensysteme
geben als wir bisher dachten."
<p>Allerdings gibt es auch andere Modelle, um das Helligkeitsmuster der
Mikrolinse zu erkl&auml;ren: So k&ouml;nnte etwa der vergr&ouml;&szlig;erte
Stern ein Doppelstern sein. Auch die Bewegung der beiden Sonnen der Linse
ist eine m&ouml;gliche Ursache.
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astrophysik:</i>
<br><a NAME="6"></a><b>Im All k&ouml;nnen aus Gasplasma Kristalle entstehen</b>
<p>(Meldung vom 9.11.1999)
<p>Die Untersuchung von Plasmakristallen wird das erste physikalische Experiment
auf der Internationalen Raumstation (ISS) sein. Ab August 2000 werden russische
Kosmonauten und deutsche Forscher vom Max-Planck-Institut f&uuml;r extraterrestrische
Physik in Garching in zwei Versuchsreihen Plasmakristalle untersuchen,
die eines Tages in Solarzellen, der Pharmakologie sowie der Informationstechnologie
eingesetzt werden k&ouml;nnten, erkl&auml;rten die Forscher in einer Pressekonferenz
am Dienstag. Die Versuche sollen dazu beitragen, fundamentale physikalische
Gesetze, wie etwa das Schmelzen von Kristallen, besser zu verstehen.
<br>&nbsp;
<p>Plasma - hei&szlig;es, elektrisch geladenes Gas - kommt sowohl in jeder
Kerzenflamme als auch auf der Sonne vor. Materie, die als Plasma vorliegt,
ist in ihrem vielleicht ungeordnetsten Zustand. Trotzdem hat Hubertus Thomas
vom Max-Planck Institut es geschafft, Plasma in eine kristall&auml;hnliche
Form zu bringen. Dazu brachte er winzige Polymerk&uuml;gelchen in ein sogenanntes
Krypton-Gasplasma ein. Diese Mikrokugeln sammelten die Elektronen aus dem
Plasma ein und wurden daraufhin von einer Wolke positiv geladener Kryptonionen
umgeben.
<p>Elektrostatische Wechselwirkungen brachten die Elektronen, Ionen und
die kleine Kugel dazu, eine regelm&auml;&szlig;ige, dem Kristallgitter
in Festk&ouml;rpern &auml;hnliche, Struktur anzunehmen.
<p>"Dieses Modell er&ouml;ffnet einen ganz neuen Zugang zu fundamentalen
physikalischen Gesetzen," sagt Thomas. "Wir k&ouml;nnen einen bestimmten
Punkt in der Kristallstruktur beobachten und dessen Entstehung mit der
Kamera verfolgen." Die Mikrok&uuml;gelchen haben den Vorteil, "dass die
Vorg&auml;nge im Plasma bei diesem Modellsystem fast mit dem blo&szlig;en
Auge zu beobachten sind", erkl&auml;rt der Plasmaphysiker Joerg Winter
von der Ruhr-Universit&auml;t Bochum.
<p>Auf der Erde dr&uuml;ckt die Schwerkraft die Plasmakristalle jedoch
rasch in die Form eines Pfannkuchens. Im Weltraum, wo fast keine Schwerkraft
herrscht, beh&auml;lt der Plasmakristall seine dreidimensionale Struktur
bei und erm&ouml;glicht so weitergehende Studien. In Versuchen auf Raketen
wurde diese Annahme bereits getestet.
<p>Und auch die Anwendungen lassen nicht auf sich warten. Der deutsche
Projektleiter Gregor Morfill f&uuml;hrt dazu eine franz&ouml;sische Gruppe
als "phantastisches Beispiel f&uuml;r die Anwendung dieser Technologie"
an. "Sie haben eine Plasmakammer voll mit reaktivem Gas f&uuml;r Solarzellentechnologie
benutzt."
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Kosmologie:</i>
<br><a NAME="7"></a><b>Junge Galaxien waren die Geburtsmaschinen der Sterne</b>
<p>(Meldung vom 9.11.1999)
<p>Als das Universum ein bis drei Milliarden Jahre alt war, waren die meisten
Galaxien sehr viel aktiver als heute: W&auml;hrend Sternformationen wie
die Milchstrasse heute recht ruhige Orte sind, entstanden damals in fast
alle Galaxien in dichten Wolken aus Staub am laufenden Band junge Sterne.
<br>&nbsp;
<p>Beobachtungen des Infrarot-Teleskops Iso, die am Wochenende auf einer
Tagung auf Schloss Ringberg vorgestellt werden, belegen, dass die meisten
Galaxien in der Jugend des Universums sehr viel turbulenter waren als bisher
gedacht: Iso konnte zahlreiche weit entfernte Galaxien erstmals im infraroten
Licht beobachten. Die Rate der Sternenentstehung war bisher aus Untersuchungen
mit optischen Teleskopen abgesch&auml;tzt worden, bei denen aber Staubwolken
den Blick verh&uuml;llten. Aber gerade diese Staubwolken sind die "Kreisss&auml;le"
der Galaxien. Sie leuchten im Infrarot besonders hell und dienten den Wissenschaftlern
daher als Ma&szlig; f&uuml;r die Rate, mit der Sterne geboren werden.
<p>Offenbar ist sie drei- bis viermal hoher als die optischen Teleskope
vermuten lie&szlig;en. Besonders interessant sind f&uuml;r viele Experten
auch die Daten der infraroten Hintergrundstrahlung des Universums. Die
Infrarot-Hintergrundstrahlung wurde von allen Galaxien in der Vergangenheit
abgestrahlt, insbesondere von den hei&szlig;en Staubwolken. Leichte Schwankungen
darin, so vermutet der franz&ouml;sische Astronom Guilaine Lagache, werden
durch extrem weit entfernte und schwach leuchtende Galaxien verursacht,
die wie hinter einer Gardine versteckt sind, aber Energie in die Hintergrundstrahlung
pumpen.
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astronomie allg.:</i>
<br><a NAME="8"></a><b>Universum unerwartet staubig</b>
<p>(Meldung vom 10.11.1999)
<p>Eine typische Spiralgalaxie wie unsere Milchstra&szlig;e enth&auml;lt
etwa 100 Millionen Sonnenmassen kalten Staubes. Die Messungen des europ&auml;ischen
Infrarotsatelliten ISO ergaben bis zu zehnmal h&ouml;here Werte wie von
Astronomen erwartet. Gerade kalter Staub, der von dem Messger&auml;t ISOPHOT
erstmals gemessen wurde, gibt es zwei- bis zehnmal mehr als angenommen.
Diese neuesten Ergebnisse werden demn&auml;chst auf der Tagung ISO Surveys
of a Dusty Universe des Max-Planck-Instituts f&uuml;r Astronomie in Heidelberg
auf Schlo&szlig; Ringberg am Tegernsee diskutiert.
<p>Um den im Kosmos allgegenw&auml;rtigen Staub zu messen, haben Astronomen
einen Trick angewandt: Die Teilchen fangen n&auml;mlich sichtbares Licht
von den hei&szlig;en Sternen ihrer Umgebung ab und senden die aufgenommene
Strahlung als W&auml;rme weiter. Die "Helligkeit" dieser Strahlung messen
die Forscher und schlie&szlig;en daraus auf die Gesamtmenge an Staub in
der Galaxie. Das Me&szlig;ger&auml;t ISOPHOT konnte auf der ISO-Mission
erstmals auch die &auml;u&szlig;erst schwache W&auml;rmestrahlung der k&auml;ltesten
Staubteilchen messen und hat damit eine L&uuml;cke in den Beobachtungen
geschlossen. Die Untersuchungen ergaben, dass von minus 255 Grad Celsius
kaltem Staub etwa zwei- bis zehnmal mehr vorhanden ist, als angenommen.
"Staub ist im gesamten Kosmos allgegenw&auml;rtig", sagt Manfred Stickel
vom Heidelberger Max-Planck-Institut.
<p>In "normalen" Galaxien wie der Milchstra&szlig;e und dem Andromedanebel
existiert er ebenso wie in Quasaren, den leuchtkr&auml;ftigsten Sternsystemen
&uuml;berhaupt. Auch in ganz jungen Galaxien hat die ISO-Mission Staub
aufgesp&uuml;rt. Und das obwohl es beim Urknall vor 12 Milliarden Jahren
noch keinen Staub gab. Denn der entsteht erst, wenn Sterne explodieren
- also nach einem Sternenleben von einigen Millionen Jahren. Aus dem Staub
entwickeln sich dann die n&auml;chsten Generationen von Sternen. Und au&szlig;erdem
sch&uuml;tzt der Staub die "Nester" der Sterne vor der Hitze der Nachbarhimmelsk&ouml;rper.
"Im Staub sind Vergangenheit und Zukunft von Sternsystemen eingebrannt",
erkl&auml;rt Professor Dietrich Lemke aus Heidelberg. Und den Schleier,
den der Staub &uuml;ber das sichtbare Bild von anderen Galaxien legt, hat
ISO mit seinen W&auml;rmestrahlungsmessungen ein wenig gel&uuml;ftet.
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astronomie allg.:</i>
<br><a NAME="9"></a><b>Riesiger Vulkan auf Jupiter-Mond Io &auml;hnelt
Kilauea auf Hawai</b>
<p>(Meldung vom 10.11.1999)
<p>Die Raumsonde Galileo hat beeindruckende Bilder des Vulkans Prometheus
auf dem Jupiter-Mond Io aufgenommen: Auf den Aufnahmen, die die Nasa jetzt
ver&ouml;ffentlichte, ist die Struktur des Vulkans in bisher unerreichter
Detailsch&auml;rfe zu sehen. Der riesige Vulkan, der seit dem Besuch der
Raumsonde Voyager aktiv ist, &auml;hnelt dem j&uuml;ngsten Hawaii-Vulkan
Kilauea, der allerdings etwas kleiner ist.
<p>Beide besitzen einen Krater, der mit fl&uuml;ssiger Lava gef&uuml;llt
ist, die dann durch R&ouml;hren den Hang hinabl&auml;uft. Beim Kilauea
ist der Lava-See hundert Meter gro&szlig;, und die Lava flie&szlig;t etwa
zehn Kilometer bis zum Meer. Der Kilauea ist seit mehr als 16 Jahren kontinuierlich
aktiv.
<p>Auch Prometheus ist ein Dauerbrenner: Er spuckt seit mindestens 20 Jahren
Magma. Seine Caldera ist 28 Kilometer lang und 14 Kilometer breit, wie
die neuen Aufnahmen zeigen. Die Nasa-Forscher vermuten, dass die Lava dort
zur Oberfl&auml;che steigt. Anscheinend flie&szlig;t sie aber durch Kan&auml;le
50 bis hundert Kilometer weit, bevor sie an die Oberfl&auml;che tritt und
mit Schwefeldioxid reagiert, das wie Schnee die Oberfl&auml;che des Mondes
bedeckt. Dabei bildet sich eine pilzf&ouml;rmige Wolke, ein sogenannter
"Plume", den die Planetologen fr&uuml;her f&uuml;r das Zentrum des Vulkans
hielten. Die Schwefel-Wolke von Prometheus kann viel h&ouml;her aufsteigen,
da Io keine Atmosph&auml;re und eine geringere Schwerkraft als die Erde
besitzt.
<p>Die Aufnahmen wurden am 10. Oktober beim Vorbeiflug von Galileo an Io
gemacht. Weitere Bilder mit hoher Aufl&ouml;sung werden zurzeit zur Erde
&uuml;bertragen. Am 25. November wird sich Galileo erneut Io n&auml;hern,
um seine Entfernung zu Jupiter zu verringern. Da Io schon innerhalb des
Strahlungsg&uuml;rtels von Jupiter liegt, sind diese Man&ouml;ver relativ
riskant.
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astronomie allg.:</i>
<br><a NAME="10"></a><b>&Uuml;berreste einer zerst&ouml;rten Galaxie im
Hinterhof der Sonne gefunden</b>
<p>(Meldung vom 10.11.1999)
<p>&Uuml;berreste einer vor langer Zeit zerst&ouml;rten Galaxie in der
N&auml;he unserer Sonne entdeckten Astronomen des Leiden Observatoriums
in Holland und des Max-Planck-Instituts f&uuml;r Astrophysik in Garching,
indem sie Daten des Hipparcos-Satelliten der Europ&auml;ischen-Raumfahrt-Gesellschaft
auswerteten. Die Wissenschaftler haben &uuml;ber ihre Entdeckung in Nature
in der Ausgabe vom 4. November berichtet.
<p>In den Beobachtungen, die der Hipparcos-Satellit zwischen 1989 und 1993
machte, fanden Amina Helmi vom Leiden Observatorium sowie Simon White vom
Max-Planck-Institut zwei nahe Sternenb&auml;nder, die die Tr&uuml;mmer
einer einzelnen, von der Schwerkraft der Milchstra&szlig;e vor 10 Milliarden
Jahren zerfetzten Zwerggalaxie zu sein scheinen.
<p>Die Suche nach den &Uuml;berresten begannen die Wissenschaftler aufgrund
theoretischer Ergebnisse, die sie k&uuml;rzlich in einem Artikel im Monthly
Notices of the Royal Astronomical Society ver&ouml;ffentlichten. Anhand
von Computersimulationen zeigten sie, dass Galaxien, die mit der Milchstra&szlig;e
zusammengesto&szlig;en und zerst&ouml;rt worden sind, immer noch als geisterhafte
Schichten von Sternen in nahezu parallelen Umlaufbahnen gefunden werden
k&ouml;nnen. Das gilt auch f&uuml;r Galaxien, die schon w&auml;hrend der
Entstehung unserer Milchstra&szlig;e zu solchen Sternenb&auml;ndern wurden.
Der Prozess ist &auml;hnlich wie bei dem Kometen, der die Dinosaurier get&ouml;tet
haben soll. Von diesem blieb eine d&uuml;nne Iridium-reiche Schicht auf
den Knochen &uuml;brig.
<p>Die Forscher fanden in den Daten &uuml;ber Position, Entfernung und
Bewegung von Tausenden von Sternen, die Hipparcos machte, zwei kleine Sternengruppen,
die sich zusammen zu bewegen scheinen. Ihre Bewegung war unabh&auml;ngig
von nahen Sternengiganten. Daraus und aus Vergleichen mit Computerberechnungen
schlo&szlig; das Team, dass die Sterne zu zwei Tr&uuml;mmerb&auml;ndern
geh&ouml;ren m&uuml;ssen. Beide B&auml;nder k&ouml;nnten zu einer zerst&ouml;rten
Zwerggalaxie geh&ouml;ren, die w&auml;hrend oder kurz nach der Entstehung
der Milchstra&szlig;e zerst&ouml;rt wurde.
<p>Diese Tr&uuml;mmersterne sind &uuml;ber den Himmel verteilt, obwohl
sie sich parallel bewegen. Das zeigt, dass die Sonne sich zwischen den
zwei Tr&uuml;mmerb&auml;ndern befindet. Die Charakteristika dieser &Uuml;berresteschicht
passen auch auf andere Kleinstgalaxien, die immer noch in den Au&szlig;enbezirken
der Milchstra&szlig;e existieren, sowie auf die k&uuml;rzlich entdeckte
Sagittarius-Zwerggalaxie, die gerade jetzt von der Schwerkraft zerrissen
wird.
<p>Die tiefere Bedeutung dieser Entdeckung k&ouml;nnte Auswirkungen auf
die Frage nach der Entstehung der Milchstra&szlig;e haben. Denn noch immer
herrscht keine Klarheit, wie sich der &auml;ltere Teil unserer Galaxie
formiert hat. Die Milchstra&szlig;e hat zwei Hauptkomponenten: Eine ist
eine abgeflachte Scheibe, in der Gas und Sterne rotieren, wie die Planeten
um die Sonne kreisen. Die andere ist fast rund und besteht ausschlie&szlig;lich
aus alten Sternen, die wie ein Bienenschwarm fast ohne festgelegte Richtung
umherschwirren. Die Sterne, die Helmi und ihre Mitarbeiter untersuchten,
sind Mitglieder dieser Kategorie. Wie diese Sterne sich ansammelten, ist
bis heute umstritten. Die geisterhaften Sternenb&auml;nder, die das Team
entdeckte, m&ouml;gen tats&auml;chlich der erste Hinweis darauf sein, dass
sich unsere Galaxie aus solchen Tr&uuml;mmerst&uuml;cken zusammengesetzt
hat.
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astronomie allg.:</i>
<br><a NAME="11"></a><b>Unterschiedliche Meteoriten haben den gleichen
Ursprung</b>
<p>(Meldung vom 15.11.1999)
<p>Wie sich die Planeten aus der Gas- und Staubwolke des fr&uuml;hen Sonnensystems
formten, ist immer noch unklar. Die einfachsten Steinmeteoriten, die wahrscheinlich
in dieser turbulenten Phase entstanden sind die "kohligen Chondriten" -
so genannt nach ihrem hohen Kohlenstoffanteil und charakteristischen, glasartigen
K&uuml;gelchen, den "Chondren". Sie bilden immerhin sieben Klassen, die
sich durch Mineralgehalt, H&auml;ufigkeit der K&uuml;gelchen und vor allem
durch ihr Verh&auml;ltnis von Sauerstoff-Isotopen unterscheiden. Das legte
die Vermutung nahe, dass es mehrere Planetesimale, die Vorstufe von Planeten,
gab, die sp&auml;ter zerst&ouml;rt wurden und die Quelle f&uuml;r die unterschiedlichen
Chondriten bildeten.
<p>Jetzt konnten Wissenschaftler um Edward Young von der Universit&auml;t
Oxford zeigen, dass alle kohligen Chondriten einen gemeinsamen Ursprung
haben k&ouml;nnten. Ihre Erkl&auml;rung: Die chemischen Unterschiede k&ouml;nnten
sich im Mutterk&ouml;rper dadurch gebildet haben, dass fl&uuml;ssiges Wasser
von warmen zu kalten Stellen in dem Planetesimal floss. Dieses belegen
die Forscher durch Experimente, &uuml;ber die sie im Wissenschaftsmagazin
Science berichten.
<p>Bei ihrer Meteoriten-Simulation entstanden Gesteine, die den verschiedenen
Chondritenklassen stark &auml;hneln. Au&szlig;erdem untersuchten die Forscher
den ber&uuml;hmten Allende-Meteoriten und fanden m&ouml;gliche Hinweise
auf Reaktionen zwischen dem Gestein und einer Fl&uuml;ssigkeit bei niedrigen
Temperaturen. Die Theorie von Young und seinen Kollegen w&uuml;rde Szenarien
von der Entstehung des Sonnensystems stark vereinfachen: Bislang mussten
die Planetologen komplizierte Annahmen treffen, um die Entstehung der unterschiedlichen
Meteoriten zu erkl&auml;ren.
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astronomie allg.:</i>
<br><a NAME="12"></a><b>Nachfolger f&uuml;r Hubble: 4 Millionen bewegliche
Mikrospiegel erlauben Blick in die "Dark Zone"</b>
<p>(Meldung vom 16.11.1999)
<p>Im Department of Energy der Sandia National Laboratories wurden Mikrospiegel
entwickelt, die eines Tages Teil des "Next Generation Space Telescope"
(NGST) - des Nachfolgers des Hubble-Fernrohrs - sein k&ouml;nnten. Das
neue Fernrohr soll 2008 in Betrieb gehen. Mit ihm sollen die schwachen
Infrarot (IR)-Signale aus der ersten Milliarde Jahren nach dem Big Bang
aufgefangen werden.
<p>Die Signale aus dieser auch als "Dark Zone" bezeichneten Periode sollen
den Forschern beim Verst&auml;ndnis des Ursprunges des Universums helfen.
Das NGST wollen die Astronomen in der N&auml;he des Erdmondes platzieren,
um Streulicht aus dem Wege zu gehen und um besonders kalte Temperaturen
zu erreichen. Diese sind bei der Beobachtung der IR-Strahlung aus technischen
Gr&uuml;nden n&ouml;tig.
<p>Die Mitarbeiter um Ernie Garcia stellen eine der drei von der NASA ins
Rennen geschickten Gruppen, um Konstruktionsm&ouml;glichkeiten f&uuml;r
das NGST zu entwickeln und zu testen. "Wir entwickeln Spiegel, die sehr,
sehr klein sind, sich unabh&auml;ngig voneinander bewegen lassen und f&auml;hig
sind, die kalten Tempraturen und extremen Bedingungen im Weltall auszuhalten",
beschreibt der Forscher sein anspruchsvolles Vorhaben: Die Spiegel mit
den Ma&szlig;en 100 Mikrometer x 100 Mikrometer sind vergleichbar mit dem
Durchmesser eines menschlichen Haares und besitzen eine hohe Empfindlichkeit
im Infrarot-Bereich.
<p>Im September pr&auml;sentierte Garcia der NASA/Goddard Space Flight
Center eine Anordnung bestehend aus Reihen mit jeweils drei Mikrospiegeln
in einem Abstand von einem Mikrometer. Alle Spiegelreihen waren unisono
um 10 Grad gedreht. Garcia: "Diese miniaturisierten Spiegel in einem so
grossen Winkel zu drehen, ist ein wahrer Meilenstein in der Forschung."
<p>Die Mikrospiegel sollen sp&auml;ter im NGST in Verbindung mit einem
Spiegel, dessen Durchmesser ca. 8 Meter sein wird, arbeiten. Der grosse
Spiegel wird das Licht aus einem grossen Raumbereich sammeln. Erscheint
dort ein interessantes Objekt, so soll das Bild aus diesem beschr&auml;nktem
Raumbereich mit Hilfe der Mikrospiegel in Richtung des IR-Detektors gelenkt
werden.
<p>Daf&uuml;r m&uuml;ssen die geplanten vier Millionen Spiegel jedoch unabh&auml;ngig
voneinander beweglich sein, so dass jeder Spiegel optimal das detektierte
Signal in Richtung des Detektors lenkt. In einem neuentwickelten Design
ist es m&ouml;glich, den jeweils mittlere Spiegel unabh&auml;ngig zu bewegen.
Dieses Prinzip jedoch auf vier Millionen Spiegel anzuwenden, stellt immmer
noch die gr&ouml;sste H&uuml;rde bei der Entwicklung dar.
<p>Zus&auml;tzlich muss auch die Funktion der Mikrospiegel bei tiefen Temperaturen
gew&auml;hrleistet sein. Die Spiegel bestehen aus vier d&uuml;nnen polykristallinem
Silizium-Filmen, die auf Siliziumtr&auml;gern aufgebracht sind. Um einen
hohen IR-Reflexionsgrad zu erhalten, wird abschlie&szlig;end eine Goldschicht
aufgedampft. Doch gerade dieses Prinzip ist problematisch. "Die verschiedenen
Materialien zeigen unterschiedliche Schrumpfraten bei einer Temperatur&auml;nderung
und Gold schrumpft schneller als Silizium", erkl&auml;rt Garcia. Der dadurch
im Goldfilm erzeugt Stress k&ouml;nnte zur Zerst&ouml;rung der Schicht
oder sogar der Spiegel f&uuml;hren. Aus diesem Grund muss die Goldschicht
m&ouml;glichst d&uuml;nn gehalten werden.
<p>Das Microelectronics Development Laboratory (MDL) in Sandia wird demn&auml;chst
mit der Produktion der weiterentwickelten Spiegel beginnen, die im kommenden
Jahr von der NASA bei tiefen Temperaturen getestet werden.
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astronomie allg.:</i>
<br><a NAME="13"></a><b>Stern aus ungew&ouml;hnlicher Materie im Sternbild
des Sch&uuml;tzen?</b>
<p>(Meldung vom 16.11.1999)
<p>Der Stern mit der komplizierten Bezeichnung "SAXJ1808.4-3658" im Sternbild
des Sch&uuml;tzen k&ouml;nnte ein "seltsamer" Stern sein: Er k&ouml;nnte
aus seltsamem Material bestehen, ver&ouml;ffentlichte eine Astrophysikergruppe
unter der Leitung von Xiang-Dong Li an der Universit&auml;t Nanjing in
China in der neuesten Ausgabe der Physical Review Letters. Der Stern hilft
m&ouml;glicherweise dabei, die Sternentstehung und die Kernkr&auml;fte,
die die Eigenschaften extrem dichter Materie bestimmen, besser zu verstehen.
<p>Der Name der "seltsamen" Materie kommt daher, dass es von den kleinsten
Teilchen, den sogenannten Quarks, mehrere Sorten gibt. Dazu geh&ouml;ren
up, down und strange Quarks. Normale Materie besteht aus up und down Quarks,
die in Protonen und Neutronen vorkommen. In "seltsamer" Materie kommen
nur Quarks vor, die nicht in gr&ouml;&szlig;eren Kernteilchen eingebettet
sind und von denen einige "seltsam" sind. Ob es diese "seltsame" Materie
&uuml;berhaupt gibt, wird von Astronomen immer noch diskutiert. Und erst
recht, ob aus ihr ganze Sterne bestehen k&ouml;nnen.
<p>Der neueste "seltsame" Kandidat ist der Stern im Sch&uuml;tzen, der
vor drei Jahren vom italienisch-holl&auml;ndischen R&ouml;ntgen-Satelliten
BeppoSAX entdeckt worden war. Im vergangenen Jahr fand die NASA mit dem
Rossi R&ouml;ntgenstrahlen Timing Explorer neue Erkenntnisse &uuml;ber
SAXJ1808.4-3658: Der Stern rotiert sehr schnell, hat ein starkes magnetisches
Feld, emittiert 400 R&ouml;ntgenstrahlenimpulse pro Sekunde und saugt Materie
aus einem nahen Stern auf. Diese Entdeckungen deuteten darauf hin, dass
der Kandidat ein sehr kompakter Neutronenstern ist - das &Uuml;berbleibsel
einer Supernovaexplosion. Das w&auml;re aber ansich nichts sonderlich "seltsames".
<p>Die neuen Forschungen der Chinesen ergaben aber, dass der Stern vom
Standardmodell eines Neutronensterns abweicht. Mit R&ouml;ntgenuntersuchungen
haben sie festgestellt, dass er mit 17 Kilometern einen zu kleinen Durchmesser
f&uuml;r eine Neutronensterntypische Masse h&auml;tte. Dann n&auml;mlich
m&uuml;sste er einen Durchmesser von 22 bis 28 Kilometer besitzen. Der
kleine Radius deutet darauf hin, dass der Stern "seltsam" ist.
<p>Doch sind noch nicht alle Zweifel &uuml;ber den Stern ausger&auml;umt.
Astrophysiker Michiel van der Klis von der Universit&auml;t Amsterdam warnt,
dass das Modell, nach dem Li den Durchmesser berechnet hat, f&uuml;r Sterne
wie den SAXJ1808.4-3658 nicht genau sein m&uuml;sse, denn dieser habe nur
eine sehr kleine Magnetosph&auml;re. Doch auch er sagt, dass eine genauere
Betrachtung des Sterns wichtig sei, um die merkw&uuml;rdigen Eigenschaften
seltsamer Materie genauer zu untersuchen.
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astronomie allg.:</i>
<br><a NAME="14"></a><b>Erster direkter Beweis f&uuml;r einen Planeten
au&szlig;erhalb unseres Sonnensystems</b>
<p>(Meldung vom 17.11.1999)
<p>Amerikanischen Wissenschaftlern ist es erstmals gelungen, einen sichtbaren
Beweis f&uuml;r einen Planeten au&szlig;erhalb des Sonnensystems zu finden.
Wie BBC News Online berichtet, beobachteten die Astronomen um Geoffrey
Marcy von der University of California in Berkeley einen periodischen Helligkeitsabfall
bem 150 Lichtjahre entfernten Stern HD 209458, den sie auf einen riesigen
Gasplaneten zur&uuml;ckf&uuml;hren. Der Planet schiebt sich alle 3,5 Tage
zwischen die Erde und seinen Stern und schirmt so einen Teil des Sternenlichtes
ab.
<p>Den ersten Hinweis auf den Planeten lieferte seine Schwerkraft, die
den Stern leicht hin- und her wackeln l&auml;sst. Daraufhin richteten die
Astronomen genau zu dem Zeitpunkt ein Teleskop auf den Stern, an dem er
nach ihren Berechnungen durch den Planeten verdunkelt werden sollte. Tats&auml;chlich
nahm die Helligkeit des Sterns genau zum vorhergesagten Zeitpunkt um sieben
Prozent ab. Nach den Berechnungen der Forscher hat der Planet zwei Drittel
der Masse von Jupiter, aber einen 60 Prozent gr&ouml;&szlig;eren Radius.
Er umkreist seinen Stern alle 3 1/2 Tage auf einer Bahn, die 20 Mal n&auml;her
an seinem Stern liegt als die Erdbahn an der Sonne.
<p>Das best&auml;tigt Theorien, nach denen sich Planeten, die sich sehr
nah an ihrer Sonne befinden, aufbl&auml;hen. Die Oberfl&auml;chentemperatur
des neuen, 29. extrasolaren Planeten betr&auml;gt 2000 Grad Celsius.
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astronomie allg.:</i>
<br><a NAME="15"></a><b>Hubble im Winterschlaf</b>
<p>(Meldung vom 17.11.1999)
<p>Das Weltraumteleskop Hubble hat sich am Samstag in einen Sicherheitsmodus
begeben, nachdem das vierte von sechs sogenannten Gyroskopen - das sind
Kreisel, die die Position des Teleskops stabilisieren - kaputt gegangen
ist. Mindestens drei der Gyroskope m&uuml;ssen in Betrieb sein, damit das
Teleskop sicher funktionieren kann.
<p>Allerdings haben die Wissenschaftler, die das Hubble-Teleskop benutzen,
Gl&uuml;ck im Ungl&uuml;ck: Die n&auml;chste Mission zum Hubble-Teleskop
beginnt am 6. Dezember. Dabei sollten ohnehin alle sechs Gyroskope ausgetauscht
werden. "Wir verlieren nur drei Wochen an wissenschaftlichen Daten", sagte
John Campbell vom Goddard Space Flight Center der Nasa.
<p>Die Nasa-Ingenieure sind nun froh, dass sie die urspr&uuml;nglich f&uuml;r
Juni 2000 angesetzte Service-Mission geteilt haben. Im Dezember sollen
neben den Gyroskopen auch noch andere Ger&auml;te ausgetauscht werden.
Der Rest der Modernisierung findet dann erst im Jahr 2001 statt. Der Ausfall
des Gyroskops bringt das Teleskop nicht in Gefahr. Die Stromversorgung
wurde reduziert, so dass keine wissenschaftlichen Messungen mehr m&ouml;glich
sind. Doch sind die Solarpanels auf die Sonne ausgerichtet, so dass genug
Strom vorhanden ist.
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astronomie allg.:</i>
<br><a NAME="16"></a><b>Neue Erkl&auml;rung f&uuml;r Sonneneruptionen</b>
<p>(Meldung vom 18.11.1999)
<p>Im kommenden Fr&uuml;hjahr k&ouml;nnten Satelliten und Handys verr&uuml;ckt
spielen und Stromausf&auml;lle passieren. Denn die Sonne schickt mit Sonneneruptionen
(bild der wissenschaft - Newsticker vom 10.3.1999) gro&szlig;e Mengen geladener
Teilchen auf die Erde, die magnetische Felder beeinflussen k&ouml;nnen
und so die elektronische Kommunikation und die elektrische Stromversorgung
durcheinanderbringen. In ihrem Elf-Jahres-Zyklus befindet sich die Sonne
gerade in einer besonders aktiven Phase mit vielen Eruptionen. Auf einem
Treffen in Seattle haben Wissenschaftler vom Naval Research Laboratory
in Washington eine kontroverse neue Erkl&auml;rung f&uuml;r den Ursprung
der Sonneneruptionen vorgestellt.
<p>Manche Wissenschaftler halten die Theorie f&uuml;r vorschnell und unausgereift,
w&auml;hrend andere sie als ganz neuen Ansatz bezeichnen. "Die hohe &Uuml;bereinstimmung
der Daten mit unserer Theorie ist bisher un&uuml;bertroffen", sagt Jonathan
Krall vom Naval Research Laboratory.
<p>Bisher wurde angenommen, dass die Corona - die &auml;u&szlig;erste atmosph&auml;rische
Schicht der Sonne f&uuml;r die Eruptionen oder Coronal Mass Ejections verantwortlich
ist. „Diese Theorien haben aber keine Beobachtungen vorhersagen k&ouml;nnen",
wendet Krall ein. Die neue Idee von Krall und seinem Arbeitsgruppenleiter
James Chen beruht darauf, dass die Photosph&auml;re - die sichtbare Sonnenoberfl&auml;che
unter der Corona - die Energie f&uuml;r die Eruptionen liefert. Die Erkl&auml;rung
der Forscher beinhaltet das Konzept von „solar flux ropes", Sonnenflu&szlig;schleifen,
also riesigen Schleifen im magnetischen Feld unter der Photosph&auml;re.
<p>Nach der neuen Theorie m&uuml;sste der elektrische Strom entlang einer
solchen Schleife vor einer Eruption zunehmen. W&auml;hrend der Strom fliesst,
verst&auml;rkt sich das magnetische Feld der Schleife bei einer sogenannten
Flu&szlig;induktion. Dieses Ph&auml;nomen f&uuml;hrt dazu, dass sich die
Schleife ausdehnt, elektrisch geladene Partikel (meist Protonen und Elektronen)
mit sich nimmt und sie in den interplanetaren Raum schleudert. Jede dieser
Eruptionen kann bis zu 100 Milliarden Kilogramm an Materie mit Geschwindigkeiten
von bis zu 1000 Kilometer pro Sekunde „ausspucken". Laut Krall erzeugen
diese Sonnenflu&szlig;schleifen mehr als 30 Prozent aller Sonneneruptionen.
Um die Theorie zu st&uuml;tzen, verglichen die Wissenschaftler Daten des
LASCO (Large Angle and Spectrometric Coronagraph Experiment) Instruments
vom SOHO-Raumschiff, dass 1995 gestartet wurde, mit ihren Vorhersagen.
<p>Die Astronomen tun sich teilweise noch sehr schwer mit der neuen Theorie.
Sie werfe mehr Probleme auf als sie l&ouml;se, meint Leon Golub vom Harvard-Smithonian
Center of Astrophysics. Auch, dass die Photosph&auml;re w&auml;hrend einer
Sonneneruption sehr passiv sei, moniert Terry Forbes von der University
of New Hamsphire. Dagegen ist Craig De Forest von NASA-Goddard der Meinung,
dass das Modell von Krall und Chen so gut sei wie jedes andere g&auml;ngige
Modell und sicherlich eine neue und interessante Idee. „Ich bin gespannt,
wie es sich entwickelt und ob es mit den Beobachtungen &uuml;bereinstimmt."
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astronomie allg.:</i>
<br><a NAME="17"></a><b>Wandernder Jupiter</b>
<p>(Meldung vom 18.11.1999)
<p>Die Entstehung der vier Gasplaneten Jupiter, Saturn, Uranus und Neptun
liegt noch immer im Dunkeln. Jetzt werfen neue Messungen von Tobias Owen
von der University of Hawaii weitere Fragen auf: Wie Owen mit Kollegen
im Fachjournal Nature berichtet, bestimmte er die H&auml;ufigkeit der Gase
Stickstoff, Argon, Krypton und Xenon in Jupiter. Nach der g&auml;ngigen
Theorie - demnach sind die Riesenplaneten aus dem Gas des solaren Nebels
kondensiert und verleibten sich dann noch einige kometen&auml;hnliche Eisbrocken,
sogenannte Planetesimale, ein - d&uuml;rfte der Jupiter nicht mehr von
diesen Elementen enthalten als die Sonne.
<p>Tats&auml;chlich enth&auml;lt er aber h&ouml;here Konzentrationen dieser
schweren Elemente. Um das zu erkl&auml;ren, gibt es mehrere M&ouml;glichkeiten:
Entweder entstanden die Planetesimale weiter au&szlig;en als bisher gedacht,
n&auml;mlich au&szlig;erhalb der Neptunbahn, wo es so kalt war, dass sie
die Edelgase Argon, Krypton und Xenon einfangen konnten. Oder der gesamte
solare Nebel war k&auml;lter, als es die Forscher bisher angenommen haben.
Eine dritte M&ouml;glichkeit: Jupiter entstand gar nicht da, wo er sich
heute befindet, sondern weiter drau&szlig;en, und wanderte dann n&auml;her
zur Sonne.
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astronomie allg.:</i>
<br><a NAME="18"></a><b>Leoniden: Ganz nett, aber nicht spektakul&auml;r</b>
<p>(Meldung vom 19.11.1999)
<p>Auf immerhin 1700 Sternschnuppen pro Stunde haben es die diesj&auml;hrigen
Leoniden auf dem H&ouml;hepunkt des Meteorschauers gebracht. Das ist zwar
etwa sieben Mal soviel wie im letzten Jahr, reicht jedoch nicht an den
beeindruckenden Meteorsturm von 1966 heran, als 144.000 Sternschnuppen
pro Stunde auf die Erde niederregneten.
<p>In weiten Teilen Mitteleuropas war die Sicht auf das Schauspiel allerdings
durch Wolken versperrt. Mehr Gl&uuml;ck hatten Beobachter im Nahen Osten
und auch an der Ostk&uuml;ste der USA. Der H&ouml;hepunkt ereignete sich
ungef&auml;hr gegen drei Uhr in der Nacht von Dienstag auf Mittwoch, genau
wie vorhergesagt. Beobachter z&auml;hlten bis zu 30 Meteore pro Minute.
Schon nach 90 Minuten war der Schnuppenregen auf 450 pro Stunde abgeflaut.
<p>Nasa-Forscher, die das Spektakel vom Flugzeug aus beobachteten, hatten
schon in der Nacht von Montag auf Dienstag Gl&uuml;ck und bekamen zehn
Meteore vor die Linse, deren Spektren sie jetzt auf komplexe organische
Verbindungen untersuchen k&ouml;nnen.
<p>Im US-Bundesstaat New York und im Mittleren Westen musste einige Male
die Polizei ausr&uuml;cken: Einige farbenfrohe "Feuerb&auml;lle" wurden
f&uuml;r Ufos oder abst&uuml;rzende Flugzeuge gehalten.
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p><i>Astronomie allg.:</i>
<br><b>Galaxien&nbsp;<a NAME="19"></a>sind auch nur Menschen</b>
<p>(Meldung vom 19.11.1999)
<p>Auch Galaxien sind nur Menschen. Wissenschaftler der NASA haben eine
gigantische, weit entfernte Galaxie dabei beobachtet, wie sie sich aufbl&auml;hte
und dann einen gro&szlig;en Knoten im Bauch bekam. Und das Ganze als Reaktion
darauf, mit dem Schutt einer nahen hei&szlig;en Wolke vollgeladen zu werden.
<p>Bilder des Chandra R&ouml;ntgenstrahlen Observatoriums (bdw News-Ticker
vom 28.10.1999) zeigen die Galaxie 3C295 mit den gl&uuml;henden Knoten,
einen in der Mitte und zwei weiter au&szlig;en. Die Energie der drei Knoten
ist dreimal so gro&szlig; wie die gesamte Energie, die die Milchstra&szlig;e
ausst&ouml;sst.
<p>Astronomen glauben, dass diese Knoten eine Reaktion darauf sind, dass
eine umgebende hei&szlig;e Wolke gro&szlig;e Mengen an Gas in der Galaxie
abgeladen hat. Die Wissenschaftler erkl&auml;ren das &auml;hnlich wie bei
Wasser, das durch ein Rohr schie&szlig;t und dabei einen R&uuml;ckdruck
aufbaut. Die gro&szlig;e Energie kann dann bei dem Wasser zu einem m&auml;chtigen
R&uuml;ckstau und bei einer Galaxie zu einer Explosion f&uuml;hren. Bei
3C295 glauben die Astronomen, dass sie vor etwa einer Million Jahren von
einer Explosion gesch&uuml;ttelt wurde, die durch die gro&szlig;en Mengen
an Material zustande kam, die ein Schwarzes Loch in der Mitte der Galaxie
aufgesogen hat. Und die Knoten k&ouml;nnten an den Stellen der Explosion
liegen.
<p>Ein Chandra-Wissenschaftler aus dem Harvard Smithsonian Center for Astrophysics
in Cambridge meint, dass die Galaxie der Wolke "es mit dieser Reaktion
zur&uuml;ckzahlt".
<p><i><a href="#Inhaltsverzeichnis">Inhaltsverzeichnis</a></i>
<br>
<hr>
<p>So, abschlie&szlig;end habe ich noch was f&uuml;r euch, damit ihr auch
etwas zu tun habt:
<p>Diese <b>Astro-Corner</b> fand ich...
<br><form action="mailto:LarsPh@gmx.de" method="POST"
enctype="text/plain" name="Bewerung Astro-Corner">
<p><input type="radio" checked name="Astro-Corner"
    value="sehr interessant">sehr
interessant
<p><input type="radio" name="Astro-Corner"
    value="interessant">interessant
<p><input type="radio" name="Astro-Corner"
    value="weniger interessant">weniger
interessant
<p><input type="radio" name="Astro-Corner"
    value="uninteressant">uninteressant
<p><input type="submit" name="Schaltflaeche"
    value="Abschicken">
<br></form>
<br>&nbsp;
<br>&nbsp;
<p>LARS PHILIPSEN
<br><a href="mailto:LarsPh@gmx.de?subject=Aw: Astro-Corner 9"><img SRC="mailto.gif" ALT="Mail an Lars Philipsen" BORDER=0 height=32 width=140></a>
</body>
</html>
