<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Feedback</TITLE>
</HEAD>
<BODY TEXT=white bgcolor=black link=silver alink=red><CENTER>
<img src="feedback.gif"></CENTER></P><BR>
Ah, die neue NC ist da. Ausgepackt, Disk reingelegt und dann installiert.
Alles angeguckt und mein erster Eindruck war echt entt&#228;uschend: Immer noch
erscheinen viel zu wenig Artikel im gr&#246;&#223;ten Amiga Diskmag. Ups, ich bin ja
auch mit der Feedback Corner dran. Meine eigenen Artikel werde ich nicht mit einbeziehen.
Also los geht`s:</P>

<b>Vorwort:</B><BR>
Auch Andi hat die Zeichen der Zeit erkant und bittet die Mitglieder mal
wieder was zur NC beizusteuern. Das er diesem Thema einen ganzen Absatz
widment zeigt doch schon, da&#223; auch der Boss sich Gedanken um die Zukunft
macht. Ansonsten gibt`s hier nur den obligatorischen Kram, den wohl jeder
selber gelesen hat....</P>

<b><u><h2>Rubriken</b></u></h2></P>


<b>Space Pages:</B><br>
Ah, endlich sind die wieder da. Das gelungene Layout und der Inhalt machen
die Space Pages, aus meiner Sicht, zu einer der besten Rubriken innerhalb
der NC. Hier zeigt sich auch, da&#223; die Themen nicht unbedingt was mit dem
Amiga zu tun haben m&#252;ssen, um interessant zu sein. Neben einem
gelungenen Layout kann auch der Inhalt überzeugen. Wenn die ganze Chose dann
noch regelmäßig erscheintm wäre alles in Butter. 
mach damit auf jeden Fall
weiter Thowin!</P>

<b>Amiga-News:</B><br>
Hopla, was ist das denn? Ich dachte f&#252;r News w&#228;re die Amiga Aktuell da. Na
ja, da die NC diesesmal ohnehin mit reichlich Versp&#228;tung erschienen ist,
macht diese Rubrik sogar Sinn - die letzten News sind nichtmal zwei Tage
alt. Kann man aber auch rausnehmen....</P>

<u><B><h2>Workshops</u></B></h2></P>

<B>Image-Maps &amp; Tabellen (von Wolf Zimmer):</B><br>
Zwei, meiner Meinung nach, gute Workshops &#252;ber HTML. Beide Workshops waren
umfassend und zugleich verst&#228;ndlich erkl&#228;rt, so da&#223; man das neue Wissen
gleich weiterverwenden kann. Layout stimmte ebenfalls, so da&#223; diese beiden
Workshops einen nicht unwesentlichen Teil dazu beitrugen, die letzte NC
wenigstens etwas zu retten.</P>

<b>Harald Schmidt:</B><br>
Der Artikel war meiner Meinung nach unter der Rubrik &quot;Workshops&quot; falsch
plaziert und h&#228;tte eher in den Small Talk geh&#246;rt. Inhaltlich war das ganze
ganz unterhaltsam und war teilweise auch recht witzig gemacht. Nur das
Layout war grausig und h&#228;tte evtl. &#252;berarbeitet werden sollen. So hat es
keinen Spa&#223; gemacht, den Artikel zu lesen. Inhalt war trotzdem gut!
</P>
<h2><B><u>Games</h2></u></B></P>

<b>Heretic &amp; Shogo:</B><BR>
Was? Da wagt sich auch noch Thowin an Previews zu Spielen heran. Dazu m&#246;chte
ich aber einiges loswerden: Inhatlich waren die Previews recht interessant
zu lesen und auch die Screenshots waren gut gew&#228;hlt (obwohl Du bei den Logos
etwas an der Qualit&#228;tsschraube h&#228;ttest drehen k&#246;nnen). Ob es nun sinnvoll
ist, &#252;ber PC Spiele in einem Amiga Mag zu berichten (ohne das es eine
spielbare Demo auf der Freundin gibt) sei auch mal dahingestellt. Aber bei
einem Preview k&#246;nntest Du Dir eigentlich den Bewertungskasten sparen.
Immerhin kann keiner sagen, ob es eine 1:1 Portierung werden wird und ob
Abstriche gemacht werden m&#252;ssen. Mach damit auf jeden Fall weiter!
</P>
<b>Soul:</B><br>
Ah, ein SAX Preview. In der Diskettenversion fehlten leider einige
Screenshots; u.a. auch aus diesem Artikel. Was mich schon immer an Sax`s
Previews begeistert hat, war die Aktualit&#228;t seiner Artikel. Keiner ist da
wohl im Club aktueller als er. So gibt`s an dem Artikel auch nix
auszusetzen: Guter Inhalt, klasse Layout und aussagekr&#228;ftige Screenshots.
So soll`s sein :-)) </P>

<h2><B><u>Hardware</h2></B></U></P>

<b>Tests (ziemlich d&#228;mlicher Name :-))):</B><BR>
Benjamin Herwig hat gleich drei Tests geschrieben, die er zu einer Datei
zusammengefasst hat. Das verdient an dieser Stelle ein Extralob.
Das Layout kann zwar weniger &#252;berzeugen (tja, man lernt dazu :-))), aber
inhaltlich rangiert der Artikel im oberen Mittelfeld. Nervig waren zwar
einige Rechtschreibfehler sowie einige falsch eingetragene Umnlaute, aber
das passiert ja jedem (mir ja auch ganz gerne). Lediglich die Bewertungen
waren mir einen Tick zu optimistisch. Na ja, Ansichtssache....</P>

<h2><b><u>Multimedia</h2></B></U></P>

Ausser der Metal Corner (der in der Diskversion einige Bilder fehlten...)) nix los
gewesen.... </P>

<h2><b><u>Tools</h2></B></U></P>
Eigentlich leer (!!!!), aber: Ich hatte einen Test &#252;ber PFS III geschrieben,
der als HTML Datei (samt Pics) auch dabei war. Leider ist dazu kein Link zu
finden.... Wer diesen noch nicht gefunden hat, kann ja nochmal in NC69
nachgucken.</P>

<h2><b><u>CD</h2></B></U></P>

<b>Aminet 33:</B><BR>
Tja, der gute Wolf Zimmer hat mal wieder einen Test &#252;ber die aktuelle Aminet
CD geschrieben. Und damit beendet Wolf (leider!) seine zweimonatliche
Berichterstattung &#252;ber die jeweils aktuelle Aminet CD. Schade, denn ich fand
seine Berichte immer &#228;u&#223;erst lesenswert, auch wenn sich einige Dinge noch
&#228;ndern lie&#223;en: So fand ich das Inhaltsverzeichnis der CD`s immer absolut
&#252;berfl&#252;ssig; ebenso wie die &quot;geklauten&quot; Texte zu der jeweiligen Vollversion.
Auch die Bezeichnung &quot;test" trifft nicht unbedingt zu; das ganze ist eher
eine (gelungene) wertungsfreie &#220;bersicht &#252;ber die Aminet CD`s. Werde ich in
Zukunft auf jeden Fall vermissen.... </P>

<h2><B><u>Online</h2></B></U></P>

Nichts, aber absolut gar nichts.</P>
Kann sich denn kein Clubber mit Internet Zugang dazu aufrafen, seine
Erfahrungen presizugeben? Oder jeden Monat (meinetwegen auch alle zwei)
einige interessante Pages vorstellen? Da gibt`s im Netz der Netze doch wohl
einige....</P>

<h2><b><u>Helpline</h2></B></U></P>

Zwei k&#252;merliche Eintr&#228;ge in der Helpline. Also Leute, so geht`s nun wirklich
nicht: Sich auf der einen Seite beschweren, da&#223; einem im Club keiner hilft
und auf der anderen Seite dann gerade mal zwei (!!) Hilfegesuche in der
Helpline, von denen sich einer noch auf den PC konzentriert. Wenn Ihr keine
Fragen ver&#246;ffentlicht, dann beschwert Euch auch nicht, da&#223; keine Antwort
kommt. Fragen kostet doch schließlich nicht. Und das da draußen niemand Probleme hat, nehme ich Euch auch nicht ab.</P>

<h2><b><u>Leserbriefe </h2></B></U></P>

&quot;Jetzt trifft mich aber der Schlag&quot;, dachte ich nur noch, nachdem ich die
magere Anzahl an Leserbriefen der aktuellen Ausgabe gesehen hatte. Es kann
doch wirklich nicht zuviel verlangt sein, mal ein paar Zeilen an den einen
oder anderen Autoren zu schreiben; selbst ein stinknormales Feedback ohne
gro&#223;artige Gr&#252;nde reicht doch schon. Aber gar nichts? In K&#246;ln muss man sich
mal einige Herrschaften zur Brust nehmen :-))) Nein, mal erntshaft: Die
Leserbriefe haben die NC immer zu etwas besonderem gemacht. Es war halt ein
Forum, wo jeder mit jedem labern konnte. In der n&#228;chsten Ausgabe erwarte ich
hier Vollbesetzung. Mal abgesehen davon: Für diejenigen, die noch Leserbriefe schreiben,
wird es auch immer schwieriger, viel zu schreiben.... </P>

<h2><b><u>Diskussionen</h2></B></U></P>

<b>Zukunft:</B><BR> Der von Sieglinde Peters verfasste, sehr negative Artikel, gab mir
kurzzeitig zu denken. Aber bedenke liebe Sieglinde: Der Amiga wird
weiterleben; egal ob mit AI oder nicht. Und Dein Amiga funktioniert doch
auch noch? Wof&#252;r brauchst Du einen PC? Da stimme ich Dir leider &#252;berhaupt
nicht zu...</P>
Ausserdem: Was erwartest Du von der Messe in Köln? Ich glaube kaum, daß dort
etwas bahnbrechendes passieren wird. </P>

<b>Splatter:</B><BR> Kritikpunkt 1) Kein Name (!) unter dem Artikel!
Kritikpunkt 2) Keine &#220;berschrift, kein gutes Layout. Inhatlich verstehe ich diese
ganze Splatter Diskussion auch nicht. Und es gab auch keinen Addressaten...</P>

<b>Lagebesprechung:</B><BR>
Nagash &amp; Yonder haben hier die aktuelle Lage im APC &amp; TCP hervorragend
getroffen und ich stimme den beiden hier bedenkenlos zu. Nur bedenkt: Was
ist mit der Multimedia Corner? Was ist mit PD Spielen &amp; Demos? Auch ihr
beiden k&#246;nntet mal wieder was schreiben. Interessant fand ich noch das Thema
&quot;Amiga-zu wenig davon in der NC&quot;. Haben die beiden damit etwa recht? Ich
werde in Zukunft mal wieder mehr &quot;Amiga only&quot; Artikel schreiben.
</P>
<h2><b><u>Small Talk</H2></B></U></P>

<b>Sonnensystem (von Wolf Zimmer):</B><BR>
Ein typischer Wolf Artikel: Gutes Layout, interessante Thematik und eine
gute Verst&#228;ndlichkeit; das alles garniert mit einigen Pics. Der eine oder
andere Sch&#252;ler wird damit evtl. mal was anfangen k&#246;nnen. Die meisten werden
zwar wissen, wie unser Sonnensystem aufgebaut ist, aber als schnelles
Nachschlagewerk ist dieser Artikel immer noch gut genug.</P>

<b>Game Over (von Sascha van Wahnem):</B><BR>
Noch ein Amiga User weniger. Ich hatte vor Dir immer hohen Respekt, da Du
viel f&#252;r den Amiga (und die NC) gemacht hst. Zwar hatte ich in letzter Zeit
bei Dir keinen guten Stand (bzgl. der A+ CD`s), aber mitlerweile ist das ja
ohnehin nicht mehr Dein Ding. Um die Zukunft besser zu gestalten, habe ich
mich schon mit Markus Castro dar&#252;ber unterhalten und ihm ganze Listen von
&#196;nderungen zugeschickt. Wenn es die A+ bis dahin noch geben sollte, werden
die CD`s sicherlich wieder ganz anders aussehen. Nichtsdesto trotz w&#252;nsche ich Dir f&#252;r Deine
Zukunft alles gute; auch in Deinem Privatleben. Und vielleicht lie&#223;t man ja
doch noch mal was von Dir in der NC?</P> 

<b>Music (von Ojo):</B><BR>
Hatte gar nicht erwartet, da&#223; sich aus meinem &quot;Stand alone&quot; Artikel &quot;Musik&quot;
eine derartige Diskussion entwickelt. Intetressant fand ich Eure Standpunkte
allesamt schon, zumal wir alleman zum ersten Mal einig zu sein scheinen.
Auch Ojo macht da keine Ausnahme. Leider gibt`s kein Layout, aber das ist
bei einem solchen Artikel auch absolut sekund&#228;r...</P>

<b>Astro Corner (von Lars Ph.):</B><BR>
Eine sehr interessante und vor allem regelm&#228;&#223;ige Rubrik &#252;ber Astronomie. Wie
man dem Unfang nur unschwer entnehmen kann, steckt auch dahinter jede Menge
Arbeit; bleibt zu hoffen, da&#223; Lars Ph. weiter Arbeit in die Astro Corner
stecken wird. Mit dem Layout bin ich aber nicht ganz so zufrieden; auch wenn
die Information im Mittelpunkt steht, w&#252;rde ein Background dem Layout
sicherlich gut tun. Inhatlich aber einwandfrei!</P>

<b>Anonym:</B><BR>
Was der Schwachsinn jetzt sollte, entzieht sich meiner Kenntniss. Statt
sinnlos Speicherplatz zu verschwenden (in der Diskettenversion fehlen z.B.
einige Pics), k&#246;nnte der Autor (wer auch immer das sein mag) mal lieber was
sinnvolles zur NC beitragen. Denn davon hängt das Überleben der NC ab!</P>

<b>NC Hitparade (von Gerd Wolpert):</B><BR>
Wenigstens einer, der regelm&#228;&#223;ig sein Feedback abgibt und obendrein noch die
Quantit&#228;tshitparade gestaltet. Wenn jeder auch nur genausoviel Feedback
geben w&#252;rde, w&#228;re doch schon allen gedient. Auch wenn Du wenig Zeit hast Gerd: Mach
damit bitte weiter! Ansonsten gehen uns auch noch die letzten Autoren verloren.</P>

<h2><b><u>Storys</h2></B></U></P>

G&#228;hnende Leere; wo bleibt eigentlich der zweite Star Trek Teil???? Was ist
mit Nagash und Fabian Kruse los? Kein Bock mehr ????</P>

<h2><B><U>Tips &amp; Tricks</h2></u></B></P>

<b>Wet (von Gerd Wolpert):</B><BR>
Habe das Spiel zwar nicht, aber immerhin etwas (!) in der Rubrik. Selbst
solche kleinen Artikel k&#246;nnen hilfreich sein.</P>
<HR>

<h1><CENTER><FONT COLOR="GREEN">Fazit</FONT></CENTER></h1></P>
Die letzte Ausgabe war, so traurig es auch klingen mag, eine der Tiefpunkte
in der bisherigen NC Karriere. Es waren zwar einige nette Artikel dabei,
aber im gro&#223;en und ganzen fehlten einige Dinge. Neben Leserbriefen (=&gt; und
Feedback) machte sich vor allem das Fehlen von Amiga spezifischen Artikeln
bemerkbar. Ich kann wirklich jeden auffordern mal wieder etwas f&#252;r die NC zu
tun. Ansonsten l&#228;&#223;t auch die Motivation der letzten NC Schreiber nach und
das w&#228;re wirklich bedauerlich. Und um es mal ganz krass auszudr&#252;cken: Ohne
die Amiga Aktuell k&#246;nnte man die letzte Ausgabe sonstwo
hinwerfen....</P>

Was ebenfalls recht nervig war, ist die Tatsache, daß in der Diskversion
einige Pics fehlten. Leute, wenn Ihr Artikel schreibt und diese mit Grafiken
verseht, dann überprüft bitte, ob Ihr die Dateien nicht kleiner machen könnt
(z.B. 256 Farben statt 16.8 Mill; JPG größere Kompression etc.). Der Vorteil
liegt auf der Hand: Schnellere Ladezeiten für Internetuser und in der
Diskversion wäre mehr Platz vorhanden. 


Sorry f&#252;r die krassen Worte, aber anders l&#228;&#223;t es sich nicht beschreiben. 
</P>

Ach ja: Ursprünglich war diese Feedback Corner noch viel ausführlicher, aber
leider ist mir der Rechner abgeschmiert und dann war alles weg. Deswegen ist
leider alles etwas kurz & unkritischer geworden; ist vielleicht auch besser
so, denn das Original war ziemlich heftig. Sollte sich jemand auf den
Schlips getreten fühlen, bitte ich, kurz bescheid zu geben.... </P>





<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
