




<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Messebericht: Home Electronic World `99</TITLE>
</HEAD>
<BODY TEXT=white bgcolor=black link=silver alink=red>
<h1><CENTER><FONT COLOR="GREEN">Home Electronic World
`99</FONT></CENTER></H1></P>

Trotz der turbulenten vergangenen Monate fand auch dieses Jahr wieder in K&#246;ln
eine Computermesse statt, auf der nat&#252;rlich auch der Amiga traditionell
stark vertreten war. Keine Frage: Das durfte man sich nicht entgehen lassen.
</P>
Wie schon im vergangenen Jahr, musste ich auch dieses Jahr wieder mit dem
Zug nach K&#246;ln fahren. Die Frage nach dem Ticket war schnell gel&#246;st: Wenn es
halbwegs erschwinglich bleiben sollte, kam nur das Wochenendticket (35 DM)
in Frage. Nahchdem dann alles gekl&#228;rt war, konnte es am Samstag morgen in
aller Fr&#252;he losgehen. Also meine paar Sachen (Walkman, Flasche Apfelschorle
und noch einigem Kleinkram) zusammengepackt und auf in Richtung U-Bahn, die
mich dann zum Bochumer HBF bringen sollte. Wie &#252;blich, war ich mal wieder
viel zu fr&#252;h da, so da&#223; ich es mir noch leisten konnte, im
Bahnhofsbuchhandel einige Zeitschriften durchzubl&#228;tern. Und besonders die
aktuelle Ausgabe der A+ erregte schon jetzt mein Gem&#252;t: Neben wirklich
banalen Tests, war das Objekt der &#196;rgerniss vor allem die Heftdiskette. Dort
behauptet man ganz frech, da&#223; man MP3 Dateien nun auch auf dem Amiga
abspielen kann und zwar mit der &quot;Vollversion&quot; von Prayer II. Dieses Tool ist
kostenlos im Aminet zu bekommen und gar nicht mal so &#252;bel. Aber das es damit
&quot;endlich&quot; (!) m&#246;glich ist MP3 Dateien abzuspielen, stimmt so auch nicht....
</P>
Na ja, um 8 Uhr 30 kam dann (mit leichter Versp&#228;tung) mein Zug nach K&#246;ln am
Bochumer HBF an. Also nix wie rein und los ging`s. Im Gegensatz zum letzten
Jahr hatte ich sogar das Gl&#252;ck, nicht neben einem total durchgeknallten
Techon Freak zu sitzen, so da&#223; die Zugafhrt angenehm ruhig verlief. Kurz vor
10 Uhr war ich dann endlich am Messegel&#228;nde angekommen und kaufte mir
schnell ein Ticket (15 DM, also recht sozialer Preis). Ich hatte &#252;brigens Ticketnummer
16059. Und als ich dann an
Halle 11.2 angekommen war, wunderte ich mich etwas dar&#252;ber, da&#223; die
Hallentore noch nicht aufgemacht hatten....
</P>
Um kurz nach 10 Uhr &#246;ffneten sich diese dann langsam und einige krochen mal
wieder drunter her. Wie schon im letzten Jahr fiel mein erster Blick auf den gro&#223;en
Software 2000 Stand, die mal wieder ein Soap Opera Spiel (GZSZ)
herausgebracht haben. Aber das alles soll ja hier nicht weiter
interessieren, immerhin ist das hier ein Amiga Diskmag. Etwas
orientierungslos, schlenderte ich erstmal etwas durch die Halle, um einen
Grob&#252;berlick zu gewinnen. Neben dem &#252;blichen Stand von Amiga (der genauso
gestaltet war, wie schon die ganzen Jahre zuvor) waren auch noch einige
andere Amiga Firmen da, die teilweise recht interessante Dinge da hatten
(siehe unten).</P>

Zuerst einmal wurde nat&#252;rlich der Stand von Amiga begutachtet. Neben einem
Amiga Museum, in dem sogar ein Prototyp des Walker, auch bekannt als
<img src="kmesse.jpg" align=Left>Staubsauger, stand (wohingegen vom MCC nix zu sehen war...) stand nat&#252;rlich
OS 3.5 im Mittelpunkt. Dies konnte man sich zum einen vorf&#252;hren lassen (und
ich sage Euch: Holt es Euch! Es lohnt sich!!), und zum anderen selber mal
testen. Nat&#252;rlich konnte man es auch direkt vor Ort kaufen, auch wenn es
keinen Messepreisnachlass gab. Und da wir gerade bei OS 3.5 sind: Ich habe
dort mal mit Petro Tyscht. gesprochen. Er meint OS 3.5 h&#228;tte 300.000 DM
Entwicklungskosten veranschlagt und h&#228;tte sich bisher 5.000 mal verkauft.
Weiterhin meinte er, da&#223; sich Amiga derzeit nur noch vom Abverkauf von
A1200 &#252;ber Wasser h&#228;lt, was die n&#228;chsten zwei Jahre noch gut gehen w&#252;rde.
&#220;ber konkrete Pl&#228;ne, was in Zukunft passieren sollte, wollte (oder konnte)
er nichts sagen. Am Amiga Stand waren ferner noch einige Internet Terminals
pr&#228;sent (auf Amiga Basis), die aber in der Regel besetzt waren.
Und f&#252;r wahre Amiga Fans, warteten dort noch alle m&#246;glichen Fan Artikel auf
den Verkauf (der Renner war Amiga Cola zum Preis von 3 DM; in dem Bistro
kostete eine Dose doch glatt 5 DM).</P>

Nach dieser Stipvisite ging`s gleich r&#252;ber nach Epic, die mit einer kleinen
&#220;berraschung aufwarten konnten: Das britische Softwarehaus hat sich eine
Lizenz des Adventures &quot;Simon The Sorcerer II&quot; besorgt. Allerdings wird es
eine Amiga Portierung nur geben, wenn mindestens 500 Vorbestellungen
vorliegen. Zwar geht mir dieser Trend nach Vorbestellungen in letzter Zeit
m&#228;chtig auf den Zeiger, aber ich hoffe mal, da&#223; sich gen&#252;gend Vorbesteller
finden; w&#228;re schade, wenn dieses Projekt daran scheitern w&#252;rde. Nat&#252;rlich
hatten Epic auch ihr kompletes Softwaresortiment mitgebracht und gew&#228;hrten
darauf ,teilweise recht hohe, Messe Rabatte. An Neuheiten gab es neben
&quot;Foundation DC&quot;, das sich sehr gut verkauft hat, auch die Formel 1
Simulation &quot;Virtual GP&quot; zu erstehen. Der Stand von Epic war &#252;brigens dicht
umlagert...
</P>
Der n&#228;chste Stand war der des Hardwarehersteller ATC (Apollo Turbokarten
etc.), die neben ihren Beschleunigern auch etwas an Software mitgebracht
hatten: Neben &#228;lteren CD`s (Amiga Tools 2-8) konnte man dort auch
Playstation / Dreamcast Zubeh&#246;r erstehen. F&#252;r die meisten wird allerdings
das Zorro IV Bord wesentlich interessanter gewesen sein; zum Preis von 250
DM konnte man es dort direkt mit nach Hause nehmen. Ach ja: Eine neue CD war
dort auch zu erstehen: Die Patchwork CD 2. Diese war wohl die aktuelleste,
die es auf der Messe zu kaufen gab (Stand: 7.11.99) und enthielt die neuste
Version der NewIcon Lib. f&#252;r OS 3.5 sowie zahlreiche Icons und Updates
(Preis: 25 DM).</P>

Traditionell vertreten waren auch RBM Digitaltechnik. Neben ihren
Towerl&#246;sungen, die auf der Messe auch in verschiedenen Farben zu begutachten
waren (sieht wirklich gut aus), standen vor allem der AmstroNG
(unterbrechungsfreie Stromversorgung) und die brandaktuelle Version 5 des
beliebten Scanner Tools &quot;Scan Quix&quot; im Mittelpunkt. Letzteres hat einiges an
neuen Funktionen hinzugewonnen und unterst&#252;tzt nun auch das ICS
Farbmanagment (welches parktischerweise gleich auf der CD mitgeliefert
wird). Der Preis liegt bei 159 DM, das Update schl&#228;gt mit 69 DM zu Buche.
Lobend erw&#228;hnen m&#246;chte ich an dieser Stelle noch den freundlichen Support
von RBM Digitaltechnik: Da ich beabsichtige mir einen Scanner zuzulegen,
habe ich die Chance genutzt und auf der Messe bei RBM nachgefragt, welche
M&#246;glichkeiten ich h&#228;tte; der freundliche Mensch, der eigentlich Scan Quix5
vorf&#252;hren sollte, erteilte mir dann auch gleich freundlich Auskunft. Ein
Extralob an dieser Stelle!</P>

Ah, da ist auch schon der Stand von Titan. Am selbigen gab es zwar nichts
wirklich neues in Auskunft zu bringen, aber zu berichten gibt`s trotzdem
einiges. So wurde z.B. eine Demo von &quot;Heretic II&quot; gezeigt, die im Software
Modus auf einem PPC (ich glaube, es war ein 603e) immerhin gut 30 Frames bringt und dementsprechend
fl&#252;ssig l&#228;uft. Sollte noch Warp3D Support hinzukommen, d&#252;rfte die Framezahl
noch viel h&#246;her liegen. Aber auch Joyride konnte man Probespielen. Nat&#252;rlich
gab`s auch was f&#252;r das Anwenderherz: F&#252;r BurnIT 2.6 gibt es jetzt ein 30 DM
teures VideoCD Plugin mit PPC Unterst&#252;tzung. Und auch ein neues
DTP Programm namens ReproStudioNG stellten die Titanen vor (Preis: 250 DM). 
 Alle Produkte konnten nat&#252;rlich
auch vorbestellt werden bzw. &#228;ltere Sachen gleich g&#252;nstig mitgenommen
werden.</P>

Wer h&#228;tte es gedacht? Da ist ja auch der APC &amp; TCP Stand in fast optimaler
Lage. Und jedesmal, wenn ich dort vorbeikam, war er auch dichtumlagert. Nun
gut, es gab ja auch interessante Sachen. Unser Chef hat es doch tats&#228;chlich
geschafft, zwei Spiele st&#228;ndig am Stand vorzuf&#252;hren: Zum einen ist das die
WiSim Seaside, die recht ordentlich aussieht und verspricht, Schwung in
dieses Genre zu bringen (Preis 65 DM). Wesentlich interessanter war aber die
Live Vorf&#252;hrung von Ph&#246;nix. Und ich muss sagen: Mir fielen fast die Augen
aus dem Kopf, als ich sah, was die Programmierer da zusammengecodet haben.
So etwas habe ich bisher selten gesehen! Eingestellt wurde Ph&#246;nix nat&#252;rlich
nicht und aus einem Gespr&#228;ch mit dem Programmierer wei&#223; ich, da&#223; es
definitiv kommen wird (da schon sehr viel Arbeit in dem Projekt steckt).
Nat&#252;rlich konnte man auch noch das Amiga Kartenspiel sowie s&#228;mtlich weiteren
Produkte des APC &amp; TCP k&#228;uflich erwerben. Es w&#228;re mal interessant zu wissen,
was der Andreas zum Verlauf der Messe sagt.....</P>

Eine weitere Firma, die derzeit den Amiga kr&#228;ftig mit Software versorgt,
ist Haage &amp; Partner. Neben allen bekannten Softwarepaketen (Art Effekt 3.0,
ST Fax 4, Page Stream 4.0, Amiga Writer 1.2 etc.) gab es dort auch
Vorf&#252;hrungen von verschiedenen Programmen; u.a. auch von &quot;Wipeout 2097&quot; unter
Warp 3D. Wie ich verschiedenen Gespr&#228;chen entnehmen konnte, scheint die
Amiga Version des 3D Racers die beste zu sein, die es system&#252;bergreifend
gibt, was nicht zuletzt an der M&#246;glichkeit liegt, Wipeout auch im Fenster
auf der WB zu spielen. F&#252;r Programmierer nicht minder interessant d&#252;rfte die neue Developer CD 2.1
sein, die s&#228;mtliche Neuigkeiten zu OS 3.5 enth&#228;lt und f&#252;r Programmierer die ideale CD zum systemkonformen
Programmieren darstellt. Etwas irritiert hat mich hingegen die PC Version
des Mac Emulators &quot;Fusion&quot; (na ja, die PPC Version kommt ja jetzt
definitiv und soll so gut wie fertig sein)....</P>

Die gute alte Schatztruhe ist auch noch eine Firma, die die Amiga Flagge
hoch&#228;lt. Wie seit Jahren auf der K&#246;lner Messe &#252;blich, gab es dort auch neue
Produkte zu bewundern: &quot;Digital Almanac II&quot;, &quot;Amiga Unix Compendium 1.2&quot;,
&quot;Super View Productivy Suite 2&quot; (Tests dazu in der n&#228;chsten Ausgabe) und
Photogenics 4.0. Aber auch die Aminet CD 33 schien sich recht gut zu
verkaufen. Alle &#228;lteren CD`s waren nat&#252;rlich auch dabei....</P>

Deutlich bescheidener ausgefallen ist in diesem Jahr der Stand der A+, der
recht weit Abseits gelegen war und in diesem Jahr nur durch die aktuelle
Ausgabe und einer Amiga Kaffetasse gl&#228;nzte. Warum man weder die Amiga Future
noch die CD`s dort zum Verkauf anbot, entzieht sich leider meiner Kenntniss.
Ach doch: Die Developer CD 1.2 konnte dort erstanden werden (allerdings gab
es am Stand von Haage &amp; Partner eine bedeutend aktuelle Version von
selbiger). Ebenfalls verwunderlich war die Tatsache, da&#223; nur zwei
Mitarbeiter (der Chefred. und noch jemand) anwesend waren. Scheint so, als
ob die AmigaOS der Sieger im Amiga Zeitschriftenmarkt ist.</P>

Und da wir gerade bei der AmigaOS sind: Der Falke Verlag war
selbstverst&#228;ndlich auch anwesend und zwar als Unteraussteller am Amiga
Stand. Der Chefredakteur h&#246;chstpers&#246;nlich verkaufte dem Amiga User dort die
aktuelle Ausgabe (echt gut!). Und nicht nur das: Auch alle &#228;lteren Ausgaben
konnten zum Preis von 5 DM gleich mitgenommen werden. Selbiges gilt auch f&#252;r
die bisher erschienenen Leser CD`s (jeweils 15 DM). Abo`s (inkl. Abo Pr&#228;mie
vor Ort !!) konnten dort ebenfalls abgeschlossen werden. Abgerundet wurde
das Sortiment von der X-Ray CD 1, die f&#252;r Raytracing Freunde interessant ist
(10 DM). Ach ja: Wenn alles glatt geht, gibt`s in der n&#228;chsten Ausgabe ein
Interview mit Thomas Raukamp (Chefred. der AmigaOS). &#220;brigens ein sehr
freundlicher Mensch, mit dem man sich gut unterhalten konnte. </P>

Was gab es sonst noch? Das war nat&#252;rlich l&#228;ngst nicht alles: So waren auch
Individual Computers anwesend, von denen wir wohl noch einiges zu erwarten haben. Der Silversurfer
d&#252;rfte einigen ja schon ein Begriff sein. Neu ist hingegen die &quot;X-Surf&quot;, eine
neue Ethernetkarte zum Preis von 189 DM, die ab Dezember `99 lieferbar sein
wird. </P>

Neu ist ebenfalls die &quot;Twister 1200&quot;, eine neue serielle Schnittstelle f&#252;r
den A1200 aus dem Hause Kato Development.</P>

Was ich pers&#246;nlich noch am interessantesten fand, ist ein Programm namens
PPC680x0. Dieses Programm soll es erm&#246;glichen, 68K Programme in PPC
Versionen, mit dem entsprechenden Geschwindigkeitszuwachs, zu verwandeln.
Dami steht der PPC Softwareflut nichts mehr im Wege. Das ganze soll
75 Dollar kosten; eine neue Demo soll schon sehr bald im Aminet erscheinen.
</P>
Das war erstmal der erste Rundgang un mitlerweile ist es auch schon 12 Uhr
30, also Zeit f&#252;r den Annex Auftritt. Das darf man sich nat&#252;rlich nicht
entgehen lassen und so sa&#223; ich um 12 Uhr 30 in der zweiten Reihe vor der
Annex B&#252;hne. Die Band, heute &#252;brigens nur zu dritt, legte dann auch bald los
und zelebrierte drei Songs, die mich zwar alle nicht vom Hocker rissen, aber
dem Publikum wohl gefielen. Na ja, das alles Playback war, d&#252;rfte klar sein,
aber immerhin sieht die S&#228;ngerin gut aus und hat auch viel Charisma (na ja,
ab und an musste ich trotzdem &#252;ber das Gehopse der drei Schmunzeln).
Nichtsdestotrotz war der Auftritt von Annex sicherlich ein Highlight am
heutigen Samstag....</P>

.... was man vom Clubtreffen um 13 Uhr absolut nicht behaupten konnte. Denn
5 vor 13 Uhr stand ich am APC &amp; TCP Stand und wartete dort bis 10 nach 13
Uhr und niemand kam. Entweder ich habe niemanden erkannt oder es war einfach
keiner da.</P>

Es folgten noch weitere Durchg&#228;nge durch die Halle, um sich nochmal
alles genauer anzuschauen und sich etwas zu unterhalten. Dabei stolperte ich
auch &#252;ber den Stand von Macro Systems, die mit dem Casablanca Avio preislich
einen Schritt in die Zukunft gemacht haben (3000 DM), aber technologisch
einen Schritt zur&#252;ck gemacht haben. Anscheinend hat man s&#228;mtliche Amiga
Technologie aus dem Casablanca entfernt und stattdessen PC Hardwrae (u.a.
Pentium CPU) dort reingesteckt. Na ja, s&#228;mtliche Videozeitschriften waren
davon nicht sehr begeistert, was also den Erfolg des Avio in Frage stellen
wird. Interessanterweise sind mitlerweile die beiden Amiga Programme
&quot;Elastic Dreams&quot; und &quot;Candy Factory&quot; f&#252;r eben jene Kiste umgesetzt worden;
war recht interessant, als ich das k&#252;rzlich in einer Videozeitschrift
erblickte.... So schlecht kann die Amiga Software also auch nicht sein,
oder?? Aber ganz vergessen hat man den Amiga offenbar auch nicht: Mit dem
Amiga Link gibt`s jetzt endlich eine M&#246;glichkeit, Daten zwischen Amiga &amp;
Casablanca auszutauschen.</P>

Mitlerweile hatten wir auch 15 Uhr und es wurde langsam wieder Zeit,
aufzubrechen. Also raus aus der Messehalle und ab zum Bahnhof. Mist, Zug
verpasst. Schnell noch eine Pizza gekauft und etwas gewartet. Im Zug lie&#223;
ich dann die vergangenen Stunden nochmal Revue passieren und ich muss sagen:
Trotz der ungekl&#228;rten Situation und der Tatsache, da&#223; weniger Amiga Firmen
als im letzten Jahr dabei waren, fand ich die Messe recht gelungen.
Nat&#252;rlich w&#252;rden mir mehr Firmen (oder eine reine Amiga Messe) mehr zusagen,
aber tot ist der Amiga noch lange nicht. Die zahlreichen Neuerscheinungen
beweisen doch das genaue Gegenteil. Jetzt sollte nur noch die Community
zusammenhalten und alles ist in Butter. </P>

Fazit: K&#246;ln hat sich auch dieses Jahr wieder gelohnt!</P>


P.S.: Sorry, wenn ich hier nicht alles aufgef&#252;hrt habe, aber das wesentliche
sollte drin sein. </P>









<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
