<html>
<head>
<meta name="description" content="Wolf-INFO">
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="wolf1.gif" text=black link=blue alink=red vlink=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" bgcolor="#808080">
<font color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td></tr></table
<table border="0" cellpadding="5"><tr><td>
<a href="mitglieder/zimmer.html">
<img src="st_wolfinfo.jpg" width=100 height=100 border=0 align=left></a></td>
<td><ul><center><font color=blue> I n h a l t </font></center>
<li> <a href="#a0"> Messenachlese </a></li>
<li> <a href="#a1"> Lava-Lampe </a></li>
<li> <a href="#a2"> Die Falle </a></li>
<li> <a href="#a3"> Rechtssicherheit</a></li>
<li> <a href="#a4"> Feedback </a></li>
</ul></td></tr></table><br clear=all>
<hr>
<table border=0 width=100% cellpadding=6><tr><td>
<p align=center><a name="a0"><font color="800000" size="5">
<b>Messenachlese</font></b></a></p>
<p>Was w&auml;re ich froh, wenn ich hier an dieser Stelle lauthals
verk&uuml;nden k&ouml;nnte: &quot;Hurra, es geht mit Amiga wieder
aufw&auml;rts.&quot; Die ach so grausame Realit&auml;t sieht aber ganz
anders aus. Wie seit 1990 war ich auch dieses Jahr zur Pforten&ouml;ffnung
am Freitag anwesend. Ehrlich, letztes Jahr waren wir bestimmt viermal so
viele, wenn nicht noch mehr, als die Rolltore sich hoben. Die G&auml;nge
zwischen den Ausstellern waren sehr gro&szlig;z&uuml;gig dimensioniert und
die St&auml;nde waren sehr &uuml;bersichtlich und leicht zug&auml;nglich
angeordnet. Staus gabe es eigentlich nur bei dreien. RBM hatte viel zu tun.
Schlau wie die Leute waren, bekamen die registrierten ScanQuix User ein paar
Tage vorher den Update-Bescheid und gegen dieses Schreiben und den
entsprechenden Obulus konnte man das ganz neue ScanQuix 5 auf CD-ROM
ausgeh&auml;ndigt bekommen. Eine kleine Vorabbetrachtung siehe in Tools.
Wie ich beobachten konnte, fand auch fxPAINT einen guten Absatz.
Anziehungsmagnet bildete das Towerhawk Ausstellungsst&uuml;ck mit seinen
seitlichen Plexiglasscheiben, sodass das gesamte Innenleben betrachtet
werden konnte. An zweiter Stelle der Beliebtheitsskala lag Schatztruhe,
aber dicht gefolgt von Haage und Partner. Diese hatten 6 Terminals
aufgestellt und diese waren immer dicht umlagert. Um seine eigenen Fragen
loszuwerden, musste man schon ganz sch&ouml;n Geduld aufbringen. Manchmal
war dies aber nicht mehr notwendig, da konnte man aber dann die Antworten
zu den Fragen mit aufzuschnappen, die andere schon gestellt hatten. Bei
allen anderen Ausstellern hatte man Zeit und Mu&szlig;e, in Ruhe und in
aller Ausgiebigkeit sich mit diesen Leuten zu unterhalten. Es war
erschreckend und beinahe angsteinf&ouml;&szlig;end, wie wenig Besucher am
Freitag pr&auml;sent waren. Dass die K&ouml;lner noch alle im Bett
l&auml;gen, weil sie einen Tag vorher den Karnevalsbeginn zu stark gefeiert
h&auml;tten, lie&szlig; ich nicht als Ausrede gelten. Einen allgmeinen
R&uuml;ckblick &uuml;ber alle Aussteller unterlasse ich hier an dieser
Stelle, das werden andere bestimmt machen. Zu Amiga h&auml;tte ich zwei
Anmerkungen, erstens die Cola-Dosen mit dem Amiga-Ball waren billiger als
am Kiosk und hatten wahrscheinlich deshalb so regen Zuspruch und der
deutsche Oberboss Petro lieﬂ im Gespr&auml;ch sogar durchblicken, dass er
selber &uuml;berhaupt keine Ahnung hat, wie es weiter gehen soll und was im
Hause der schwarz-wei&szlig;en Kuh &uuml;berhaupt definitiv geplant ist.
Das sind doch fantastische Zukunftsaussichten. </p>

<p>Der APC&amp;TCP Stand war streckenweise sehr verwaist. Andreas, seine
Freundin und Georg Breitsprecher harrten der Dinge, die kommen
k&ouml;nnten, aber nicht kamen. Die einzigen Mitglieder, die sie zu sehen
bekamen, waren bestimmt nur wir &quot;Senioren&quot;. Annemarie und
G&uuml;nter, Sieglinde und ihr Mann, Rolf Nue aus Wue und ich waren wohl
die einzigen Clubmitglieder, die an diesem Freitag da waren. Andere habe
ich leider nicht gesehen, aber ich brach gegen 15.00 Uhr auf und ich
wei&szlig; nicht, ob doch noch jemand kam. Vielleicht waren doch welche da,
die wir nicht erkannten. Beim gegenseiten Abschied versicherten wir uns,
dass wir uns im n&auml;chsten Jahr wieder hier treffen und wenn es nur zum
Kaffetrinken ist. </p>

<p>Selber bin ich sehr gespannt, andere Beitr&auml;ge &uuml;ber die
K&ouml;lner Messe zu lesen und zwar von den Besuchern, die Samstag oder
Sonntag da waren. Da war hoffentlich mehr los. Meinen diesj‰hrigen
Sonntagsbesuch habe ich ausfallen lassen, es waren vorher auch keine
konkreten Absprachen getroffen worden. </p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a1"><font color="800000" size="5">
<b>Lava-Lampe</font></b></a></p>

<p> Mitte Oktober &uuml;berschwemmte uns eine eMail Umfrage mit 72
Positionen, die praktisch jeder an jeden weiterreichte. Frage 18 lautete:
<blockquote><i> Hast Du eine Lava-Lampe? </i></blockquote> Ich habe keine
Antwort gesehen, die darauf schlie&szlig;en lie&szlig;, dass der Antworter
&uuml;berhaupt wusste, worum es sich hier handelte.</p>

<p>Ja da sind wir Alten wieder fein raus. Die meisten der heutigen Jugend
kennt den Begriff &quot;die Achtundsechziger&quot; und verbindet dies mit
&quot;politische und gesellschaftliche Aufm&uuml;pfis&quot;. Dass diese
damaligen Jugendliche auch anst&auml;ndig feiern konnten, nimmt man
heutzutage wohl an, kann sich aber nicht vorstellen, wie dies gehen sollte,
kannte man derzeit doch keine Lasershows, keine anst&auml;ndige Discomusik
und und und. Wie man sich doch so irren kann. Neben &quot;fetziger&quot;
Musik gab es schon die gro&szlig;en Spiegelkugeln mit Prismenwirkung
(Zerlegung des einfallenden Lichtstrahls in die Spektralfarben) und die
<b>Lava-Lampe</b>. Das waren kleine und gro&szlig;e Lampen, in deren
Innerem Fl&uuml;ssigkeiten bunt umherwabberten und fantastische
Lichteffekte bewirkten. Heute w&uuml;rde man sagen, was waren die guten
alten 60er und 70er doch so sch&ouml;n bunt, grell und so herrlich
kitschig. </p>

<p>Der Soundblaster-Hersteller Creative Labs hat die Lavalampe wieder
entdeckt und bietet sie im Internet zum kostenlosen Downloaden f&uuml;r den
heimischen PC an. Mit der Software &quot;Lava&quot; von der Seite
<b>www.creative.com</b> wabbert und wubbert es nun bunt &uuml;ber den
PC-Bildschirm - und zwar im Takt zur jeweilig eingelegten Musik. Da gibt es
wirre B&auml;ume, verdrehte Ringe und echte Lava-Lampen. Man soll sogar
pers&ouml;nliche Bilder in das Programm laden k&ouml;nnen. Der PC ist jetzt
eine bunt zuckende Lichtorgel. Vielleicht gibt es demn&auml;chst jemanden,
der dieses Programm auch f&uuml;r den Amiga portiert. </p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a2"><font color="800000" size="5">
<b>Vorsicht Falle:<br>Gesch&auml;fte mit Tippfehlern</font></b></a></p>

<p>Das Internet ist gnadenlos, wenn die Adresse falsch geschrieben ist.
Schon der kleinste Tippfehler bei der Eingabe des Namens f&uuml;hrt
h&auml;ufig ins Leere - oder auf die Homepages besonders findiger
Gesch&auml;ftsleute. Der Gesch&auml;ftsleiter der Frankfurter Firma Sunrise
Kunststoffpflanzenvertrieb (www.shop.sunrise.de) sicherte sich vor
eineinhalb Jahren fast 200 Domains unter Verballhornungen bekannter
Markennamen wie &quot;simens.de&quot;, &quot;aple.de&quot; oder
&quot;soni.de&quot;, aber auch anz&uuml;gliches wie
&quot;www.nutten.de&quot;. Der Hintergedanke, neben Kundenfang f&uuml;r die
eigene Website: &quot;Vielleicht l&auml;sst sich so eine URL auch mal
verkaufen&quot;. Man hat angeblich keine Ahnung, wieviele Kunden mit dieser
Methode im Sunrise-Shop landen. </p>

<p>Einige weitere Beispiele: <ul>
<li> <b>www.kola.de</b><br>
Man erwartet die Homepage von Coca-Cola, landet aber bei einem <b> Internet-Katalog </b>. </li>
<li> <b>www.jahoo.de</b><br>
Hier kann man zwar nicht yahooen, sich aber immerhin in ein <b> G&auml;stebuch </b>
eintragen. </li>
<li> <b>www.yahooo.de</b><br>
Auch auf dieser Seiite wieder kein Yahoo - nur ein <b> Online -
Brillenversand</b>. </li>
<li> <b>www.intell.de</b><br>
Anstelle von Mikrochips findet sich hier ein <b> EDV-Vertrieb </b> namens
Roos-Marketing. </li>
<li> <b>www.pro6.de</b><br>
Besucher finden unter dieser Adresse eine <b> Sexseite</b>, jedoch nichts &uuml;ber
ProSieben. </li>
<li> <b>www.whitehouse.com</b><br>
Eine First Lady gibt es auf dieser <b> Sexseite </b> auch, aber bestimmt
nicht die richtige. </li>
<li> <b>www.microsofd.com</b><br>
Diese Seite befindet sich noch im Aufbau. Aber die gesuchte Softwarefirma ist
es bestimmt nicht. </li>
<li> <b>www.mikrosoft.de</b><br>
Viele die zu Bill Gates wollen, verirren sich. Darum kann man hier <b>
Werbung </b> schalten. </li>
<li> <b>www.mcdonald.de</b><br>
Nein, hier gibt es keine leckeren Burger und Pommes - eine <b> Privatseite </b> im
Aufbau. </li></ul>

Weniger lustig als das Ausnutzen der Rechtschreibschw&auml;che ist das
sogenannte Page-Jacking - eine neue Form der Netzkriminalit&auml;t. Vor
allem Anbieter von Pornosites nutzen die technische M&ouml;glichkeit, eine
bestehende Website komplett zu kopieren und dann mittels HTML-Codes oder
Javascript zu ihrer eigenen Homepage umzuleiten - die Seite wird
richtiggehend entf&uuml;hrt. Tippt ein Nutzer den Markennamen in eine
Suchmaschine, wird er statt dessen zu einer Porno-Seite gef&uuml;hrt.
Doppelt nervig: wer in so einem Fall den Backbutton des Browsers benutzen
will, landet meist wieder auf der Seite mit der automatischen Umleitung.
<br>
<font size=-1><i>[Der komplette Artikel kann in Tomorrow 11/99 nachgelesen werden.]
</font></i></p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a3"><font color="800000"
size="5"><b>Rechtssicherheit im Internet</font></b></a></p>
<p>Prof.Dr.Ulrich Sieber von der Uni W&uuml;rzburg hat ein Buch
ver&ouml;ffentlicht: &quot;Verantwortlichkeit im Internet&quot; (C.H.Beck
Verlag) und hieraus betrachten wir mal drei Kapitel im Schnelldurchgang.
</p>

<p><b>Hafte ich f&uuml;r Links zu strafbaren Inhalten?</b><br> In
Einzelf&auml;llen kommt eine strafrechtliche oder zivilrechtliche Haftung
in Betracht. Deswegen sollte man sich keinesfalls mit fremden Inhalten
identifizieren, die strafbar sein k&ouml;nnten. Sonst haftet man
n&auml;mlich schon bei Fahrl&auml;ssigkeit. Bei vors&auml;tzlich gesetzten
Links zu strafbaren Inhalten haftet man in jedem Falle, auch wenn man sich
noch so vehement davon distanziert. Dazu z&auml;hlt auch das beabsichtigte
F&uuml;hren &uuml;ber Umwege, die in einen strafbaren hochbelasteten
Bereich verweisen. </p>

<p><b>Gibt es Rechtssicherheit im Internet?</b><br> Wer im Internet ins
Ausland mailt, in Newsgroups postet oder WWW-Angebote bereitstellt,
unterliegt mit seinem Verhalten nach vorherrschender Meinung einer Vielzahl
von Rechtsordnungen. In den meisten Staaten ist das Internet-Recht jedoch
noch wenig entwickelt. Absolute Rechtssicherheit gibt es daher nicht,
jedoch sind die Grundlagen klar: Was offline strafbar ist, wird auch online
bestraft. Anbieter, Provider und Nutzer im Internet m&uuml;ssen sich dazu
nur eingehend &uuml;ber seri&ouml;se Rechtsberatung und einschl&auml;giger
Literatur mit den entsprechenden Fragen besch&auml;ftigen. Hat man etwas
strafbares gefunden, darf es keinesfalls gespeichert oder weitergegeben
werden. Cache und Papierkorb ist in jedem Falle zu leeren. Meldung oder
Anzeige einer Entdeckung darf nicht mit Beispielen untermauert werden,
sondern es ist nur die Fundstelle zu benennen. </p>

<p><b>Alterskontrollen - nur ein Bluff?</b><br> Bei harter Pornografie sind
alle angewandten Systeme sinnlos, da hier auch die Verbreitung unter
Erwachsenen strafbar ist. Bei einfacher Pornografie kann ein gutes
Altersverifikationssystem hingegen ausschlie&szlig;en, dass man
Jugendlichen die fraglichen Daten im Sinne des Gesetzes
&quot;zug&auml;nglich&quot; macht. F&uuml;r Inhalte, die einfach nur als
jugendgef&auml;hrdent gekennzeichnet sind, gelten aufgrund einer speziellen
Regelung im Gesetz &uuml;ber jugendgef&auml;hrdende Schriften und
Medieninhalte gro&szlig;z&uuml;gigere Bestimmungen. Die meisten zur Zeit
eingesetzten Systeme d&uuml;rften nur der letztgenannten Kategorie
entsprechen. Und wer glaubt, dass eine Alterskontrolle &uuml;ber die
nachgekommene Aufforderung zur Eingabe von Kreditkartendaten vorgenommen
wurde, darf sich nicht wundern, wenn sein Konto pl&ouml;tzlich leer ist.
</p>


Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a4"><font color="800000" size="5"><b>Feedback
</font></b></a></p>
<p>Folgende Artikel habe ich dieses Mal in meinem Feedback in
alphabetischer Reihenfolge der Titel ber&uuml;cksichtigt. Ein Autor
erscheint bei mir nur einmal, auch wenn mehrere Beitr&auml;ge lobenswert
sind: </p>
<ul>
<li> <b>AstroCorner</b> von Lars Philips </li>
<li> <b>C64-Classix</b> von Kilian Servais </li>
<li> <b>Hardwaretests</b> von Benjamin Herwig </li>
<li> <b>Lagebesprechung</b> von Gerd Wolpert und Daniel Stein </li>
<li> <b>Spiele-Preview</b> von Henning W. Knopp </li>
</ul>
Die anderen sollen bitte nicht traurig sein, ihr ward auch gut.
<hr size=4>
</td></tr></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf">
http://www.chiemgau.com/apc&amp;tcp/members/wolf </a></font>
<br>
</td></tr></table>
<br>
</body>
</html>
