

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>CD Datei - Eine Audiodatenbank mi Stil?  </TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<h1><CENTER><FONT COLOR="GREEN">CD Datei</FONT></CENTER></h1></P>
CD Liebhaber m&#246;chten stets einen &#220;berblick &#252;ber Ihre sauber sortierte
Sammlung haben. Was bietet sich also eher an, als eine Datenbank auf dem
hemischen Computer einzurichten? Nat&#252;rlich gibt`s auch entsprechende
Vertreter dieses Genres auf dem Amiga. Eine davon m&#246;chte ich heute
vorstellen: Das mitlerweile als Freeware freigegebene CD Datei.</P>

<h2><CENTER><FONT COLOR="YELLOW">Was brauche ich
alles?</FONT></h2></CENTER></P>
Die Hardwareanforderungen f&#252;hre ich der Vollst&#228;ndigkeit halber einfach mal
auf, auch wenn es wahrscheinlich kein Clubmitglied mehr gibt, das diese noch
unterbieten kann: Zum Betrieb von CD Datei wird AmigaOS 2.1 und ein 68000er
Prozessor ben&#246;tigt. Ferner muss noch die GUI Erweiterung MUI in Version 3.8
auf ihrem System installiert sein. Ach ja: Wer sich die M&#252;he erspaaren will,
die Titell&#228;nge jedes einzelnen Songs aus dem Booklet abzuschreiben (wie wir
alle wissen, soll es ja auch CD`s geben, wo keine Titell&#228;ngen angegeben
werden), kann diese auch vom CD Laufwerk auslesen lassen. Daf&#252;r m&#252;ssen
lediglich die beiden mitgelieferten Libraries &quot;cdplay.lib&quot; und &quot;asyncio.lib&quot;
installiert werden.</P>

Das w&#228;ren erstmal die Grundbedingungen, um CD Datei zum laufen zu bewegen.
Jetzt braucht man sich nur noch das Paket sowie das Keyfile aus dem Aminet laden (letzte
Version:3.14) und alles ordnungsgem&#228;&#223; installieren.
Die Installation ist übrigens sehr einfach und sollte niemanden vor Probleme
stellen. 
</P>

<h2><CENTER><FONT COLOR="WHITE">Tausend &#252;berfl&#252;ssige
Funktionen?</FONT></h2></CENTER></P>
Wer nun, anhand der &#220;berschrift, denkt, da&#223; CD Datei mit viel Schnickschnack
und unz&#228;hligen von Funktionen daherkommt, wird entt&#228;uscht werden. CD Datei
bietet wirklich nur die Funktionen, die man f&#252;r die Verwaltung seiner CD
Sammlung braucht und verzichtet auf &#252;berfl&#252;ssige Funktionen. Aber fangen wir mal von vorne an:
Zuerst einmal m&#252;ssen nat&#252;rlich die CD`s vom Benutzer eingegeben werden.
Dabei sollten neben den Titeln auch Angaben zum Interpreten und dem
Entstehungsjahr gemacht werden. Optional kann man dann auch noch der CD ein
Cover zuteilen; f&#252;r User, die einen Scanner (und eine gro&#223;e Festplatte)
haben sicherlich eine sinnvolle Sache. Und jetzt geht`s erst so richtig los:
Normalerweise reichen die oben genannten Angaben f&#252;r eine sinnvolle
Strukturierung seiner Sammlung aus. F&#252;r wirklich arbeitsfreudige User, die
jedes Fitzelchen an Infos &#252;ber ihre CD`s abrufbereit haben wollen, bietet CD
Datei noch einiges an Extrafeldern, die man, bei Bedarf, einschalten kann.
Dies w&#228;ren f&#252;r CD`s im einzelnen:</P><UL>

<li> Kategorie (z.B. Album, Maxi CD, Bootleg etc.)<BR>
<li> Kommentar (z.B. Lieblings CD etc.)<BR>
<li> H&#252;lle (=&gt; Cover) und H&#252;llendesign<BR>
<li> Plattenfirma<BR>
<li> Herrgestellt in <BR>
<li> Bestellnummer<BR>
<li> Musikstil<BR>
<li> Aufnahmetechnik<BR>
<li> Produziert von<BR>
<li> Verliehen </P></UL>

Aber auch f&#252;r einzelne Songs hat man noch Extraoptionen:</P><UL>

<li> Liedtext (z.B. im ASCII Format)<BR>
<li> Kommentar (z.B. Instrumental Komposition etc.)<BR>
<li> Samples</P></UL>

Ich denke mal, da&#223; Puristen ihre wahre Freude an CD Datei haben werden; der
normale CD Fan braucht im Grunde nur einige (wenige) Optionen. Umso
praktischer ist es, da&#223; man nicht gew&#252;nschte Infos problemlos ausstellen
kann.</P>

Nat&#252;rlich muss man zum Anzeigen von Bildern oder zum Abspielen von Sounds
Extraprogramme einbinden, aber diese M&#246;glichkeit erweitert CD Datei
ungemein: So ist es z.B. m&#246;glich MP3 Songs (die sich momentan ja gro&#223;er
Beliebtheit erfreuen) &#252;ber AmigaAMP laufen zu lassen oder ganze Lyrics als
HTML Datei per IBrowse aufrufen. Damit wird CD Datei praktisch zur
Schaltzentrale degradiert, aber PC User kommen so oftmals aus dem Staunen
nicht mehr raus. Man stelle sich nur eine perfekt gestaltete HTML Datei vor,
in der man beliebige Songs auswählen kann, die dann Amiga AMP, durch ARexx
ferngesteuert, im Hintergrund abspielt. Only Amiga makes it possible...
</P><CENTER>
<img src="cddatei1.gif"></CENTER></P>


<h2><CENTER><FONT COLOR="BLUE">In der Praxis</FONT></CENTER></h2></P>
Angenommen man hat jetzt seine &#252;ber die Jahre hinweg gewachsene CD Sammlung
eingegeben und ist erstmal gl&#252;cklich damit. Nat&#252;rlich legt man so eine
Datenbank nicht nur aus Spa&#223; an und fr&#252;her oder sp&#228;ter sucht man mal etwas
in seiner Sammlung. Nat&#252;rlich verf&#252;gt CD Datei auch &#252;ber eine entsprechende
Suchfunktion, mit der man recht schnell zu Ergebnissen kommt. Obendrein
arbeitet diese Suchfunktion noch recht schnell, so da&#223;, selbst bei gr&#246;&#223;eren
Datenbest&#228;nden, keine langen Wartezeiten zu erwarten sind (es sei denn, man
arbeitet noch mit einem 68020 :-)).</P>

Indirekt mit dem Suchen hat nat&#252;rlich auch die Sortierung des Datenbestandes
zu tun. Mit CD Datei hat man die M&#246;glichkeit, die CD`s auf verschiedene
Weise zu sortieren. Jeder hat da so seine pers&#246;nlichen Vorlieben und im
Grunde ist es ja auch ziemlich egal ob man CD`s nach Interpret, Jahr, Anzahl
Tracks oder nach der Spielzeit sortiert. Aber auch bei den Interpreten
(Anzahl CD`s, Anzahl Titel) und bei den Titeln (Zeit oder Name) kann man
seine gew&#252;nschte Auflistungsart einstellen.</P> 

Ein weiteres interessantes Feature ist auch der Export von Dateien. Wenn man
z.B. einem Freund oder Bekannten mal seine CD Sammlung auflisten will, aber
zu faul ist, alles einzutippen, kann man auch CD Datei darum bem&#252;hen. Das
Programm exportiert die Daten dann in das allseits bekannte Amiga Guide
Format mit einem &#252;bersichtlichen Layout. Ein, wie ich finde, sehr
interessanter Punkt. Und da es mitlerweile ja auch einen AmigaGuide
Betrachter f&#252;r Windows gibt, k&#246;nnen sich auch PC User daran erfreuen.
Nat&#252;rlich werden sich jetzt viele fragen, warum es denn keinen HTML Export
gibt. Auch diese Frage kann beantwortet werden: CD Datei wurde bis 1997
entwickelt und danach offenbar vom Autor aufgegeben. Tja, und 1997 war HTML
leider noch nicht ganz so gebr&#228;uchlich wie heute. Aber &#252;ber dieses kleine
Manko kann man sicherlich hinwegsehen.
Wer keine Daten exportieren m&#246;chte, sondern diese lieber in gedruckter Form
vor sich liegen haben m&#246;chte, kann dies nat&#252;rlich auch tun. CD Datei bietet
n&#228;mlich auch eine Druckoption.</P><CENTER>
<img src="cddatei2.gif"></CENTER></P>

<h2><CENTER><FONT COLOR="RED">Noch ein paar Worte zu CD
Datei</FONT></h2></CENTER></P>
Die Oberfl&#228;che von CD Datei basiert, wie oben bereits erw&#228;hnt, auf MUI und
ist dementsprechend intuitiv aufgebaut. Anf&#228;nger (gibt`s sowas &#252;berhaupt
noch?) werden also keine Probleme haben, mit CD Datei umzugehen. Sollten
doch mal Fragen auftauchen, kann man mit einem Druck auf die Help Taste
immer noch die Online Hilfe, die &#252;brigens in Deutsch vorliegt, aufrufen.
Diese schildert zwar teilweise recht knapp die Funktionen, reicht aber als
Hilfestellung durchaus aus.</P>

Jetzt kommt aber leider noch ein gro&#223;es ABER: CD Datei wird offensichtlich
nicht mehr weiterentwickelt. Es ist somit nicht anzunehmen, da&#223; es jemals
noch Updates oder Erweiterungen geben wird. Und da die Zukunft des Amigas
ohnehin ungewiss ist, sollten Sie es sich gut &#252;berlegen, ob Sie ihre private
CD Sammlung wirklich CD Datei anvertrauen. Bei gro&#223;en Sammlungen kann
sich unter Umst&#228;nden der Aufwand, alles einzugeben nicht mehr lohnen, wenn man &#252;ber kurz
oder lang ja doch zum PC wechseln will. Aber soetwas unterstelle ich hier
niemandem....</P><CENTER>
<img src="cddatei3.gif"></CENTER></P>

<h1><CENTER><FONT COLOR="GRAY">Fazit</FONT></h1></CENTER></P>
CD Datei ist eine &#228;u&#223;erst praktische Datenbank f&#252;r CD`s, die ich nicht mehr
missen will. Neben dem ungeheuren Funktionsumfang kann vor allem die leichte
Bedienung und die StyleGuide Oberfl&#228;che begeistern. Und immerhin ist das
ganze mitlerweile Freeware, so da&#223; man noch nichtmal mit zus&#228;tzlichen Kosten
konfrontiert wird. Ihr k&#246;nnt ja mal reinschauen...</P>





<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
