<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>fxPAINT</title>
</head>
<body background="wolf1.gif" text=black link=blue alink=red vlink=blue bgcolor=gray>
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>fxPAINT</b></font></center></p>
<table border=0 width=100% cellspaing=3 cellpadding=3>
<tr><td>
<p><img src="tt_fxpaint0.jpg" border=0 width=230 height=230 hspace=6
align="left" alt="CD-Cover"> Das fxPAINT war so neu, dass RBM noch nicht
einmal dazugekommen war, entsprechende Reklame zu machen und auf der Messe
dieses Produkt etwas mehr hervorzuheben. Da ich am Freitag die erste
Quittung erhielt, ist mein Programm als das erste offiziell auf der Messe
verkaufte zu betrachten. Deswegen ist es aber nicht anders als alle
anderen. </p>

<p>Auf der Messe hatte ich Andreas noch versprochen, einen kleinen ersten
Eindruck f&uuml;r die NoCover zu schreiben. H&auml;tte ich dies mal nicht
gemacht. Es ist f&uuml;r ein Produkt nichts so sch&auml;dlich, wie eine
Besprechung mit negativen S&auml;tzen zu beginnen. Und da dieser Artikel
eine emotionelle Betrachtung ist, muss ich leider mit zwei solcher Punkte
beginnen, die mir nicht gefielen. Das erste ist die Cover R&uuml;ckseite
der CD-Box. Sie ist schwarz, hat sieben kleine Bilder (schlie&szlig;lich
ist es ja auch ein Malprogramm) und ziemlich viel Text in deutsch und
englisch in den Farben gr&uuml;n und gelb. Der Font ist so klein, dass
sogar der dunkelgr&uuml;ne Textanteil f&uuml;r mich nur mit einer
gro&szlig;en Lupe und einem grellem Licht zu lesen ist. Der Text
hei&szlig;t &quot;F&auml;higkeiten&quot; und diese sind in 12 Unterpunkten
ausgiebig beschrieben. Das Verwenden von reinen Stichworten, ein
gr&ouml;&szlig;erer Font und eine bessere Farbabstimmung zum Background
w&auml;re von gro&szlig;em Vorteil. </p>

<p>Der zweite Punkt ist eigentlich der erste Schritt im Programm, nachdem
es wirklich sehr einfach und fast idiotensicher auf der Festplatte
installiert wurde. Das ist das Konfigurieren. Nach Aufruf von
&quot;Einstellungen&quot; und Festlegen des Bildschirmmodus und Setzen des
Hakens f&uuml;r &quot;eigenen Bildschirm&quot; ist der sofortige Absturz
auf meiner Anlage nach dem Speichern und der ersten Aktion, wie z.B. ein
Bild laden da. Um die Einstellungen wieder zu &auml;ndern muss ich das
Programm erst wieder von der Platte l&ouml;schen, da es nur beim Anfassen
sofort den GURU auf den Bildschirm ruft, und anschlie&szlig;end wieder
neuinstallieren. Ein Installieren wie ein Update funktioniert nicht, da ja
die Einstellungen dann &uuml;bernommen w&uuml;rden. Meine Hardwarekonfiguration
ist A4000/040, OS 3.0, 16 + 2 MB RAM, PicassoIV. Mein Screenmodus lautet
&quot;PicassoIV: 800×600 16bit&quot;. </p>

<p><img src="tt_fxpaint4.gif" border=0 width=61 height=189 hspace=6
align="left" alt="toolbox"> <img src="tt_fxpaint3.gif" border=0 width=320
height=44 alt="toolbar"><br><br>
Ohne den programmeigenen Bildschirm erscheint auf der Workbench und auf
eventuell ge&ouml;ffneten Fenstern nur die linke Toolbox. Eine Steuerung
mittels Tollbar (oben) ist nicht m&ouml;glich, da diese Leiste nur auf dem
programmeigenen Schirm erscheint. Beide Bilder sind hier um 50%
verkleinert. Ein Arbeiten ist f&uuml;r mich derzeit nur &uuml;ber das
Pulldown-Men&uuml; m&ouml;glich. Aber da gehe ich jetzt nicht n&auml;her
darauf ein, sondern erkl&auml;re nur ganz kurz die beiden Bilderleisten.
<br>
<table border=0 cellspacing=3 cellpadding=3>
<tr><th><b>Toolbox</b></th><th><b>Toolleiste</b></th></tr>
<tr><td>
  (1) = Zauberstab <br>
  (2) = Zeichenwerkzeug <br>
  (3) = Farbenpipette <br>
  (4) = Farben Manager <br>
  (5) = Effekt Optionen <br>
  (6) = fxMANAGER <br>
  (7) = Pinsel manager <br>
  (8) = Layer Toolbox <br>
  (9) = fxALBUM <br>
  (10)= Plugin-Starter <br>
  (11)= Bild-Auswah <br>
  (12)= Alphakanal-Auswahl <br>
  (13)= Alphakanal aktiv <br>
  (14)= Schnelle Pinsel-Auswahl
</td><td>
  (1) = Neu-Bild-Kreieren <br>
  (2) = Neues Bild laden <br>
  (3) = Bild speichern <br>
  (4) = Bild drucken <br>
  (5) = Reinzoomen <br>
  (6) = Rauszoomen <br>
  (7) = Layer f&uuml;llen <br>
  (8) = Layer l&ouml;schen <br>
  (9) = &Auml;nderung zur&uuml;cknehmen <br>
  (10)= &Auml;nderung wiederherstellen <br>
  (11)= Bild fixieren <br>
  (12)= Ikonifizieren <br>
  (13)= Statuszeile <br>
  (14)= Fortschrittsanzeige
</td></tr></table></p>

<p><center><img src="tt_fxpaint2.gif" border=0 width=342 height=100
alt="Pinselauswahl"><br>Das ist die Pinselauswahl</center>
</p>
</td></tr></table>
<table border=0 width=100% cellspaing=3 cellpadding=3>
<tr><td>

<p>Sobald das Problem mit dem programmeigenen Bildschirm verwenden bei mir
gel&ouml;st ist, werde ich selbstverst&auml;ndlich dar&uuml;ber berichten.
Hoffentlich noch vor dem Absenden des Artikels nach &Uuml;bersee, es kommt
darauf an, was der Mailingverkehr mit dem Autor Felix Schwarz ergibt. Alle
bisher erschienen Tests und Vorabbesprechungen k&ouml;nnen nach meiner
Meinung nur nach Handbuchlage erstellt worden sein. Denn meine Anlage ist
virenfrei und nicht exotisch. </p>

<p>Da dies eine erste Betrachtung des Programmes werden soll und kein
Workshop berichte ich erst einmal weiter ohne ein Bild erstellt oder
geladen zu haben. Ein Handbuch gibt es nur in Form eines Amigaguide in Doc
</p>
<h5><b>Inhalt</b></h5>
<dl>
<dt><strong>Allgemeine Informationen</strong></dt>
<dd> &Uuml;ber fxPAINT </dd>
<dd> F&auml;higkeiten </dd>
<dd> Vorraussetzungen </dd>
<dd> Geschichte </dd>

<dt><strong>Einleitung & Tutorien</strong></dt>
<dd> Wie fxPAINT arbeitet </dd>
<dd> Feuer zeichnen </dd>

<dt><strong>Referenz</strong></dt>
<dd> Toolbox </dd>
<dd> Toolleiste </dd>
<dd> Pulldown-Men&uuml;s </dd>
<dd> Effekte </dd>
<dd> fxEXTRAs </dd>
<dd> Unterst&uuml;tzte Formate </dd>

<dt><strong>Support</strong></dt>
<dd> Tipps & Tricks </dd>
<dd> H&auml;ufig gestellte Fragen </dd>
<dd> Technischer Support </dd>
<dd> Kontakt </dd>

<dt><strong>Disclaimer</strong></dt>
<dd> Disclaimer </dd>

</dl>
</p>

<p><img src="tt_fxpaint1.gif" border=0 width=280 height=125 hspace=6
align="left" alt="info"> Eine Vorstellung des Inhaltverzeichnisses ist
bestimmt nicht ausreichend und bevor ich nun in meinem freien Stil eine
Beschreibung abgebe, die eventuell dann noch nicht einmal stimmt,
&uuml;bernehme ich einfach Textteile des Autors. <br> Die Einleitung von
Felix Schwarz zu seinem Programm lautet (w&ouml;rtlich): <br clear="all">
<blockquote>
&Uuml;ber fxPAINT <br> fxPAINT ist die erste und einzige Bildbearbeitungs-
und Zeichensoftware auf dem AMIGA, die konsequent die AMIGA-Hardware und
verf&uuml;gbare Erweiterungen (vor allem PPCKarten) nutzt. Auch deswegen
bietet fxPAINT Ihnen gro&szlig;e Funktionalit&auml;t und Flexibilit&auml;t.
</p>

<p>fxPAINT vereint mehrere Programmarten in sich und stellt daher viel mehr
als nur ein traditionelles Zeichenprogramm dar (obwohl es auch daf&uuml;r
benutzt werden kann). Sie k&ouml;nnen Bilder organisieren, konvertieren,
anzeigen, HTML-&Uuml;bersichten erstellen oder ausdrucken. Scannen Sie,
digitalisieren Sie, erstellen Sie ... brauchen Sie eine fraktale Grafik,
Feuer oder Bildschirmfotos ? Kein Problem! fxPAINT kann sogar als
Workbencherweiterung benutzt werden! </p>

<p>Es spielt keine Rolle, ob Sie eine Profi-Grafiken sind oder ein
&quot;Hin-und-wieder&quot;-Nutzer, Sie werden fasziniert sein von der
Geschwindigkeit, dem Arbeitsfluss und den erweiterten F&auml;higkeiten von
fxPAINT. </p>
</blockquote> 
Weiter schreibt der Autor &uuml;ber die Funktionsweise (w&ouml;rtlich, der
Text ist von mir nur in die HTML-Form gebracht):
<blockquote>
Wie fxPAINT funktioniert<br> Um die gesamte Dokumentation verstehen zu
k&ouml;nnen, sollten Sie erst verstehen, wie fxPAINT arbeitet und intern
aufgebaut ist:
<dl>
<dt><strong>fxPAINT arbeitet mit mehreren &quot;Layern&quot; (von Hinten
nach Vorne):</strong></dt>
    <dd> - Der Bild-Layer <ul>
           Das sind jene Bilddaten, die Sie entweder erstellt oder in
           fxPAINT geladen haben. </ul></dd>
    <dd> - Der Zeichen-Layer  (8 Bit) </dd><br>
    <dd> - Der Alpha-Layer   (24 Bit) <ul>
           Diese beiden Layer legen gemeinsam fest, in welchen Bereichen der
           Inhalt des Effekt-Layers den des Bild-Layers ersetzt. </ul></dd>
    <dd> - Der Effekt-Layer <ul>
           Der Effekt, der auf das Bild berechnet werden soll. </ul></dd>

<dt><strong>Kurz:</strong></dt>
    <dd> fxPAINT erstellt das Bild durch Kombination des Effekt-Layers mit
         dem Bild-Layer, wobei es die Daten des Zeichen- und Alpha-Layers verwendet. <br>
         In den meisten F&auml;llen entspricht dies einem einfachen Durchrubbeln des
         Effekts, aber z.B. im Zeichenmodus wird der Effekt-Layer dynamisch durch
         den Inhalt des Zeichen- und Alpha-Layers erstellt. </dd><br>

<dt><strong>Zeichnen:</strong></dt>
    <dd> Klicken Sie in einem Projektfenster von fxPAINT die linke Maustaste, so
         f&uuml;gen Sie den Effekt an dieser Stelle hinzu, eine gedr&uuml;ckte
         rechte Maustaste entfernt ihn wieder an dieser Stelle. </dd>
</dl>
</p>

<p>F&uuml;r eine Erstbetrachtung sollte dieser Artikel vorerst einmal
ausreichend sein. Erg&auml;nzen k&ouml;nnte ich h&ouml;chstens auf die
Schnelle die Aufz&auml;hlung der Dateien auf der CD <ul type=square>
<li> Demos </li>
<li> Developers </li><ul type=disc>
     <li> ARexx </li>
     <li> Plugins </li></ul>
<li> Graphics </li>
<li> InstallData </li>
<li> Tools </li><ul type=disc>
     <li> NewIcons </li>
     <li> NewWPA8 </li>
     <li> JPEG_PPC_Datatype </li>
     <li> ICS </li>
     <li> CyberAVI </li>
     <li> FrameMachine (VHI) </li></ul>
</ul>

Die gesamte CD enth&auml;lt 288,2 MB Daten wobei der Gro&szlig;teil 268,6
MB auf den Ordner Graphics entf&auml;llt (im Format ppm bis auf wenige
Ausnahmen). Den Ordner Demos habe ich mir bisher noch nicht angeschaut, nur
das eine Video im Programm selber, das einen Workshop darstellt und zeigt,
wie das Explosionsfeuer auf der Covervorderseite erzeugt wurde. </p>

<hr size=4>
<br>
<h4>Nachtrag:</h4>
Wie oben erw&auml;hnt, wenn ich Antwort vom Autor habe, teile ich dieses
umgehend mit. Sie lautete:
<blockquote>
Bitte die Datei &quot;tipoftheday.plugin&quot; aus Plugins/ l&ouml;schen.
<br>
Mit freundlichem Gruss,<br>
Felix Schwarz
</blockquote>
Und ich kann sagen, es funktioniert jetzt, auch nach einer halben Stunde
hatte ich noch keinen Absturz. Mehr Zeit habe ich leider noch nicht verwendet.
</p>


</td></tr></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf">
http://www.chiemgau.com/apc&amp;tcp/members/wolf </a></font>
<br>
</td></tr></table>
<br>
        
</body>
</html>



