<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>ScanQuix 5</title>
</head>
<body background="wolf1.gif" text=black link=blue alink=red vlink=blue bgcolor=gray>
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>ScanQuix 5</b></font></center></p>
<table border=0 width=100% cellspaing=3 cellpadding=3>
<tr><td>
<p>P&uuml;nktlich zur K&ouml;lner Messe wurde das ScanQuix<font color=red>5
</font> fertig und alle wollten das Update haben. Diesmal wird es auf
CD-ROM ausgeliefert und die Scheibe beinhaltet rund 100 MB Daten. Zwei
Dateien konnte ich bisher noch nicht identifizieren (vielleicht bin ich zu
bl&ouml;de hierf&uuml;r), n&auml;mlich "kf" mit 67,1 MB und "sd" mit 47 KB.
An Dateien sind <ul>
<li> <a href="#a1">ScanQuix </a></li>
<li> <a href="#a2">fxSCAN </a></li>
<li> <a href="#a3">Manual (deutsch und englisch) </a></li>
<li> <a href="#a4">Developer (Dokumentationsteil zu SQ4) </a></li>
<li> <a href="#a5">Extra (ICS, ICS-Profiles, IOBlix 37.10, Warpup 4.0) </a></li></ul>
enthalten. </p><hr size=4>
<p><a name="a1"><font size=+2><b>ScanQuix 5</b></font><br>
Der gr&ouml;&szlig;te Unterschied zu ScanQuix4 ist nicht nur das Medium,
vorher Diskette und nun eine CD, sondern dass jetzt alle Treiber hier
enthalten sind. Eigentlich ein unheimliches Vertrauen, dass die
verbliebenen Amiga User so ehrlich sind und alle ihr eigenes Exemplar
kaufen, anstelle mal eben f&uuml;r 2 Portoausgaben sich eine CD
auszuleihen. </p>

<p>Die Unterschiede zu ScanQuix4 interessieren vor allem diejenigen, die
noch z&ouml;gern und nicht genau wissen, ob ein Update notwendig ist oder
ob die Geldausgabe gespart werden kann. Aus diesem Grund &uuml;bernehme ich
aus dem Manual den gesamten diesbez&uuml;glichen Text:
<hr width=90%>
<center><h3>&Auml;nderungen zur Version 4</h3></center>

<h4>ScanQuix</h4>

<ul>
<li>Die Programmteile zum Speichern und Laden von Bilddateien wurden
komplett &uuml;berarbeitet und verbessert. Dadurch wurden einige kleinere
Fehler behoben. </li>

<li>Statt der Liste mit Bildnamen werden jetzt kleine Indexbilder
angezeigt. Durch Doppelklick auf ein Bild kann eine Aktion ausgef&uuml;hrt
werden, z.B. die Vorschau &ouml;ffnen oder das Bild speichern. &Uuml;ber
den Men&uuml;punkt <i>Einstellungen &raquo; Indexbilder...</i> k&ouml;nnen
einige Eigenschaften der Indexbilder ge&auml;ndert werden, wie z. B. die
Gr&ouml;&szlig;e. </li>

<li> Eine Funktion zum L&ouml;schen aller Bilder wurde hinzugef&uuml;gt
(Men&uuml;punkt <i>Projekt &raquo; alle l&ouml;schen</i>). </li>

<li> F&uuml;r eine verbesserte Anzeige auf Bildschirmen mit bis zu 256
Farben k&ouml;nnen die Bilder gerastert dargestellt werden (Men&uuml;punkt
<i>Einstellungen &raquo; Rasterung</i>). </li></ul>

<h4>Scannertreiber</h4>

<ul>
<li> Drehen der Bilder beim Scannen ist jetzt mit allen Single-Pass-Scannern
m&ouml;glich. (Men&uuml;punkt <i>Scanner &raquo; Drehen</i>) </li>

<li> Gespiegelte und gedrehte Bilder werden in der Vorschau so angezeigt,
wie sie nachher gescannt werden.

<li> Feste Scanneraufl&ouml;sungen lassen sich direkt anw&auml;hlen,
dadurch kann die Scangeschwindigkeit erh&ouml;ht werden.

<li> Automatische Plazierung des Auswahlrahmens um das zu scannende Objekt.
Wenn z.B. nur ein Foto auf dem Scanner liegt, wird der Auswahlrahmen durch
Anklicken des &quot;Finden&quot;-Symbols genau um dieses Foto gelegt.

<li> Ein neuer Scannertreiber (Name: &quot;File_SQ5&quot;) erm&ouml;glicht
es, Bilddateien von Festplatte wie mit einem Scanner einzulesen. <br>

Damit stehen beim Laden von Bilddateien jetzt alle M&ouml;glichkeiten der
ScanQuix-Treiber zur Verf&uuml;gung, also die Wahl eines Bildausschnitts,
Skalieren in hoher Qualit&auml;t, Drehen, Spiegeln, Bildkorrekturen usw.
Und das in jeder Software, die ScanQuix unterst&uuml;tzt. </li>

<li> Volle Unterst&uuml;tzung des ICS-Farbmanagements, auch bei der Anzeige
der Vorschau. Die Umrechnung in Graustufen kann jetzt auch durch ICS
erfolgen, wenn der Men&uuml;punkt <i>Einstellungen &raquo; Graustufen aus
Farbscan ?</i> eingeschaltet ist. Dadurch wird die Graustufendarstellung
verbessert. Nachteil ist die langsamere Geschwindigkeit. </li>

<li> Der Auswahlrahmen l&auml;&szlig;t bei kleinen Ausschnitten genauer
positionieren. Au&szlig;erdem kann bei der Gr&ouml;&szlig;en&auml;nderung
das Seitenverh&auml;ltnis des Rahmens bewahrt werden, indem beim Ziehen die
&quot;Shift&quot;-Taste gedr&uuml;ckt wird. </li>

<li> Bei den Bildkorrekturen kann die Echtzeitanzeige ausgeschaltet werden,
was auf langsameren Rechnern ein fl&uuml;ssigeres Arbeiten erm&ouml;glicht
(Unten im Bildkorrektur-Fenster). </li>

<li> Die Vorschau kann auf Bildschirmen mit maximal 256 Farben gerastert
dargestellt werden (kann im Vorschau-Einsteller ge&auml;ndert werden:
Men&uuml;punkt <i>Einstellungen &raquo; Vorschau</i>). </li>

<li> Bei Epson-Scannern ist die Scan-Geschwindigkeit einstellbar.
(Men&uuml;punkt <i>Einstellungen &raquo; Scanner</i>). Bei langsamer
Geschwindigkeit mu&szlig; der Scannerschlitten beim Scannen nicht so oft
stoppen. </li></ul>

<h4>Sonstiges</h4>

<ul>
<li> PPC-Unterst&uuml;tzung durch WarpUP. Wenn ein PowerPC-Prozessor und das
WarpUP-System vorhanden ist, wird automatisch der PPC benutzt. </li>

<li> Wichtige Programmteile wurden auf den verwendeten Prozessor optimiert,
dadurch wird die vorhandene CPU optimal ausgenutzt. </li>

<li> Bei PhotoCopyPro kann nun die Verwendung des ICS beim Kopieren
ausgeschaltet werden. </li>

<li> Die Auslieferung erfolgt auf CD-ROM, komplett mit allen
Scannertreibern, ICS-Farbmanagementsystem und Bildbearbeitungssoftware
fxSCAN. </li>

<li> Minimale Systemkonfiguration: Amiga mit OS 3.0 und 68020 Prozessor, 6
MB Speicher. </li></ul>
<hr width=90%>

<p>So nun ein paar Worte zu den Neueinsteigern beim Scannen oder zu den
Interessierten, die ein paar S&auml;tze &uuml;ber Calibratix und ICS lesen
m&ouml;chten. </p>

<p>Calibratix ist nur mit Flachbettscannern einsetzbar ! <br>
Es wird empfohlen, dieses Farbmanagementprogramm nicht einzusetzen und
stattdessen das neue ICS-Farbmanagementsystem zu benutzen. ICS ist auf der
ScanQuix CD-ROM im Verzeichnis &quot;Extras/ICS&quot; mitgeliefert.
Calibratix ist (noch) Bestandteil von ScanQuix, um Anwendern der
ScanQuix-Version 4 die weitere Benutzung zu erm&ouml;glichen. </p>

<blockquote><i>
<p> ICS ist ein Farbmanagementsystem f&uuml;r den Amiga. Damit wird der
Scanner einmal mit Hilfe einer speziellen Vorlage (z.B. ein IT-8 Target)
kalibriert. Dadurch wird - im Gegensatz zu Calibratix, das nur die
Druckerfarben erfassen kann - der gesamte Farbraum ermittelt, den der
Scanner abtasten kann. Die Bilder werden dann in einem genormten Farbraum
abgelegt, so da&szlig; sie optimal auf allen Ger&auml;ten ausgegeben werden
k&ouml;nnen, die ebenfalls durch das ICS unterst&uuml;tzt werden.
Au&szlig;erdem ist der Transfer der Bilder zu anderen Plattformen
m&ouml;glich, ohne da&szlig; Farben verf&auml;lscht werden. </p>

<p> Sie finden ICS auf der ScanQuix CD-ROM im Verzeichnis
&quot;Extras/ICS&quot;. ICS wird nicht automatisch mit ScanQuix
installiert, das es kein Bestandteil von ScanQuix ist. ICS mu&szlig; daher
zus&auml;tzlich installiert werden, bevor es benutzt werden kann. </p>

<p> Bei <u>3-Pass Scannern</u> wie z. B. der Artec ViewStation A6000C oder
Mustek Paragon 600 und 1200 wird ICS nicht vom Scannertreiber unterst&uuml;tzt,
kann aber durch andere Programme nachtr&auml;glich auf die gescannten Bilder
angewendet werden. </p>

<p> Wenn ICS installiert ist, finden Sie im Men&uuml;
&quot;Einstellungen&quot; im Scannertreiber die folgenden zus&auml;tzlichen
Eint&auml;ge: </p>
<dl>
<dt><strong>ICS benutzen ?</strong>
<dd>ICS ein- oder ausschalten. Wenn das ICS eingeschaltet ist, sind keine
weiteren Bildkorrekturen mehr m&ouml;glich, da diese das Ergebnis
verf&auml;lschen w&uuml;rden.
<dt><strong>ICS...</strong>
<dd>&Ouml;ffnet das Einstellfenster des ICS.
<dt><strong>ICS kalibrieren ?</strong>
<dd>Schaltet den Kalibriermodus f&uuml;r das ICS ein.
<dt><strong>Graustufen aus Farbscan ?</strong>
<dd>Ist diese Option eingeschaltet, werden immer Farbbilder gescannt und
die Umwandlung in Graustufen durch ICS vorgenommen. Dies liefert bessere
Ergebnisse, da der Scanner auch im Farbmodus kalibriert wird. Nachteil ist
die langsamere Geschwindigkeit.
</dl>
</i></blockquote>

<p>So das war schon ein Auszug aus dem Manual. Und diese S&auml;tze sollten f&uuml;r heute
&uuml;ber das neue ScanQuix5 eigentlich ausreichen. </p>

<a href="#top">zum Anfang </a>
<hr size=4>

<p><a name="a2"><font size=+2><b>fxSCAN</b></font><br>
Felix Schwarz schreibt in seiner fxSCAN.guide folgende Einleitung:
<blockquote><i>
fxSCAN ist eine integrierte L&ouml;sung zum Scannen, Bearbeiten, Anzeigen,
Drucken, Laden und Speichern von Bildern. Sie k&ouml;nnen etwa ein Bild
scannen, ICS-Farbkorrektur anwenden, die Farbraumausnutzung optimieren oder
das Bild rotieren oder weichzeichnen. Wenn Sie das gew&uuml;nschte Ergebnis
erreicht haben, k&ouml;nnen Sie das Bild speichern oder ausdrucken. Alte,
unoptimierte Scans k&ouml;nnen Sie wieder einladen und bearbeiten.
Desweiteren kann fxSCAN als komfortabler Bildanzeiger benutzt werden und
ist eine der beiden AMIGA-Programme (das andere ist unser fxPAINT), dass
Fax-G3-TIFFs lesen kann. Weiterhin wird der PPC unter der ppc.lib und
WarpUP benutzt und das neue printer.device von OS 3.5 unterst&uuml;tzt.
</i></blockquote>

Auf einen kurzen Nenner gebracht bestehen die F&auml;higkeiten von fxSCAN aus
folgenden Punkten: <ul>

<li> Scannen eines Bildes via ScanQuix </li>
<li> Laden eines Bildes via eingebauten Lademodulen</li><ul>
     <li> BMP </li>
     <li> PCX </li>
     <li> IFF-ILBM </li>
     <li> TIFF (au&szlig;er LZW) </li>
     <li> JPEG </li>
     <li> TARGA </li>
     <li> YUVN </li>
     <li> IFF-RGB8 </li>
     <li> PNM (P5/P6) </li>
     <li> LJPG (Lossless JPEG) </li></ul>

<li> Speichern eines Bildes via den eingebauten Speichermodulen </li><ul>
     <li> BMP </li>
     <li> PGM </li>
     <li> PPM </li>
     <li> JPEG </li>
     <li> RGB8 </li>
     <li> TARGA </li>
     <li> IFF24 </li>
     <li> Speichern eines Thumbnail-Newicons zu jedem gespeicherten Bild </li></ul>

<li> Ein Bild anzeigen </li><ul>
     <li> Schnelle, optmierte Scrolling Routinen </li></ul>

<li> Ein Bild ausdrucken </li><ul>
     <li> OS 3.5 printer.device Unterst&uuml;tzung </li>
     <li> Optimierte Routinen f&uuml;r das "alte" printer.device </li></ul>

<li> Bearbeiten eines Bildes mit einem oder mehreren Effekten </li><ul>
     <li> Korrektur </li>
     <li> MinMax </li>
     <li> Spiegeln </li>
     <li> Weichzeichner </li>
     <li> Rotieren </li>
     <li> Invertieren </li>
     <li> Schwarz & Wei&szlig; </li>
     <li> ICS-color-calibration </li>
     <li> Skalieren </li></ul>

<li> BOOPSI-Klassen f&uuml;r GUI-Elemente wie im bekannten fxPAINT </li><ul>
     <li> volle 24bit-Elemente </li>
     <li> sehr benutzbare und einfach zu bedienende GUI </li>
     <li> Sprechblasen-Hilfe </li></ul></ul>

Und nun noch ein paar Aufz&auml;hlungen zu "Bild bearbeiten" (ich will hier
keine Reklame machen, es dient aber der &Uuml;bersichtlichkeit und des
Schnellverstehens):<ul>

<li> Korrektur </li><ul>
     <li> Helligkeit </li>
     <li> Rot/Gr&uuml;n/Blau <br>
          Einstellen der Helligkeit des gesamten Bildes und/oder f&uuml;r einen
          seperaten Farbkanal. </li>
     <li> Gammawert-Korrigierung des gesamten Bildes. </li>
     <li> Kontrast </li></ul>
          

<li> MinMax </li><ul>
     <li> Viele Bilder (vor allem gescannte Bilder) machen h&auml;ufig nicht Gebrauch
          von den 256 Abstufungen, die verwendet werden k&ouml;nnten. MinMax ermittelt
          die Minima und Maxima des Bildes und streckt den Farbraum, was in helleren
          und kontrastreicheren Bildern resultiert. </li></ul>

<li> Spiegeln (vertikal und/oder horizontal) </li>

<li> Weichzeichner </li>

<li> Rotieren (90, 180 oder 270 Grad) </li>

<li> Invertieren (Berechnet das Negativ des Bildes) </li>

<li> Schwarzwei&szlig; (Die grenze zwischen schwarz und wei&szlig; ist
eintellbar) </li>

<li> Skalieren (= Gr&ouml;&szlig;enver&auml;nderung) </li>

<li> Ausschneiden (= selbsterkl&auml;rend) </li>

<li> ICS-Farbkorrektur (siehe auch unter EXTRA am Ende). </li></ul>
 
Diese Aufz&auml;hlungsorm ist doch &uuml;bersichtlicher, als eine
Beschreibung in Prosa. </p>
<a href="#top">zum Anfang </a>
<hr size=4>

<p><a name="a3"><font size=+2><b>Manual</b></font><br>
Ein gedrucktes Handbuch liegt nicht bei. Daf&uuml;r ist eine HTML-Datei in deutsch
und in englich enthalten. Mitgeliefert wird auf der CD AWeb 3.3-LocalDEMO und ein
jeweiliges Startprogramm. </p>

<p>Anzumerken w&auml;re, dass bei der Installation von ScanQuix5 das Handbuch nicht
mit eingerichtet wird. Bei Bedarf ist es selber zu kopieren, jeder wie er will
und kann. Es ist aber kein Fehler, es zu tun, denn auch f&uuml;r Profis gibt es mal
eine Frage und die k&ouml;nnte hier beantwortet werden. </p>

<a href="#top">zum Anfang </a>
<hr size=4>

<p><a name="a4"><font size=+2><b>Developer</b></font><br> Diese Passage
er&uuml;brigt sich f&uuml;r die Allgemeinheit eigentlich. Denn ganz kurz
gesagt, sind dies Treiber f&uuml;r ScanQix4 und manche auch Scan"Quix3 um
<ul>
<li> ohne Scanner eine farbige Fl&auml;che zu erzeugen, </li>

<li> aus einer Datei Bilder einzulesen und eine feste Aufl&ouml;sung
vorzugeben </li>

<li> Include-Dateien zur Benutzung des Scanner Device mit der Sprache C. zu
erzeugen,</li>

<li> nutzen von Demotreiber, die einen Scanner simulieren usw. usw.
</li></ul>

und diejenigen unter uns, die sie nutzen wollen, wissen was sie wollen und
k&ouml;nnen damit mehr anfangen. </p>

<a href="#top">zum Anfang </a>
<hr size=4>

<p><a name="a5"><font size=+2><b>Extra</b></font><br>
Zum Directory "Extra" gibt es eine folgende Liesmich:<br>
<blockquote><i>
<p>Bei der Software in diesem Verzeichnis handelt es sich um frei
verf&uuml;gbare Software, die f&uuml;r die Benutzung von ScanQuix
n&uuml;tzlich sein kann. </p>

<p>Um Ihnen die M&uuml;he zu ersparen, sich die Software aus anderen
Quellen (z.B. dem Aminet) zu beschaffen, haben wir die Programme einfach
mit auf die ScanQuix-CD gepackt. </p>

<p>Bitte beachten Sie, da&szlig; "rbm digitaltechnik" keine
Unterst&uuml;tzung f&uuml;r die Software in diesem Verzeichnis geben kann
(ausgenommen davon ist die IOBlix-Treibersoftware). </p>
</i></blockquote>

<p>Die einzelnen Programme werde ich aber jetzt nicht vorstellen. &Uuml;ber
ICS habe ich schon eingangs ein paar S&auml;tze gesagt, aber das reicht bei
weitem nicht aus. Deswegen ist hier eine Erg&auml;nzung vollkommen
unabdingbar. Dieses Programm stammt von Wolf Faust (Druckertreiber STUDIO)
und wird f&uuml;r den Amiga als Freeware bereitgestellt. Die notwendigen
Farbvorlagen und das Rechnerprogramm ist f&uuml;r 20,- DM direkt bei ihm zu
bestellen. F&uuml;r die Scannerkalibrierung werden 24bit Tafeln
ben&ouml;tigt, die auch aus dem Netz gezogen werden k&ouml;nnen, nur wer
glaubt damit besser und billiger bedient zu sein, hat sich schwer
get&auml;uscht. Es k&ouml;nnen aber auch Kalibriertafeln bei den
H&auml;ndlern (ca. 100,- DM) gekauft werden, nur die Programme sind
f&uuml;r Mac's und Intelrechner ausgelegt. Wolf Faust bietet zu den 20,- DM
Geb&uuml;hren noch Extras mit an (solange der Vorrat reicht), wie eine
gedruckte Anleitung zu ICS (24 Seiten) und zus&auml;tzliche
Kalibierprogramme f&uuml;r andere Plattformen (wenn ich richtig gelesen
habe). Meldet sich bei ihm die Amigagemeinde nicht oder zu sp&auml;rlich,
dann stellt er seine Aktivit&auml;ten f&uuml;r dieses System vollkommen
ein. Das hie&szlig;e, dass weder von der konventionellen Firma Irsee
(Turboprint) noch von dem "Einmannbetrieb" Wolf Faust zuk&uuml;nftig
weitere Druckertreiber f&uuml;r den Amiga zu erhalten w&auml;ren und die
kommenden Druckergenerationen w&auml;ren am Amiga nicht einsatzf&auml;hig.
</p>
<a href="#top">zum Anfang </a>
<hr size=4>


</td></tr></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf">
http://www.chiemgau.com/apc&amp;tcp/members/wolf </a></font>
<br>
</td></tr></table>
<br>
        
</body>
</html>



