<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x07 - Lambda Sector Preview</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x009E.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x009D.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x009F.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=79 HEIGHT=25 SRC="../images/_spiele_.gif" ALT="[Spiele]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x009C.html">Genetic Species</A> | <A HREF="0x009D.html">Foundation</A> | <A HREF="0x009E.html">Lambda Sector Preview</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0093.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0094.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0095.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0096.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0097.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0098.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x009B.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x009C.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x009F.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00A0.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00A1.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Lambda Sector Preview - So schnell, so sch&ouml;n...</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Schon wieder so ein Testbericht, in dem ich mich
&uuml;ber die MS-Dosen-Besitzer ausschimpfen kann! Selbige sind
n&auml;mlich von Games wie X-Wing und Wing Commander (man beachte die
Namens&auml;hnlichkeit) schon seit Jahren verw&ouml;hnt. Tja, wo soll ich
eigentlich schimpfen, mir f&auml;llt gar kein Angriffspunkt ein... schade!
Na gut, dann erz&auml;hl ich halt eine kleine Anekdote, einen Schwank aus
meiner Kindheit sozusagen :-) </FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Da ging einmal ein gewisser Christoph L. in meine Parallelklasse. Er
hatte zwar einen Amiga, war aber kein besonders getreuer Amiga-Fan, denn er
besa&szlig; auch einen PC und war im Grunde ein &quot;Poser&quot;, den eh
nur die Megahertz interessierten - f&uuml;r ihn war ein 386er mit 40 MHz
sicher ein besserer (weil schnellerer, wuahahaha) Prozessor als ein
68040/25, nur um ein Beispiel zu nennen. Dennoch hat er es geschafft, mich
gr&uuml;ndlich zu verarschen (wie peinlich): er erkl&auml;rte mir, als alle
Dosenfreaks im X-Wing-Fieber waren, da&szlig; irgendwelche Hacker eine
X-Wing-Version irgendwo geklaut h&auml;tten, und zwar eine f&uuml;r den
Amiga 500, noch in der Entwicklung aber fast fertig. Und ich hab die
Geschichte nat&uuml;rlich gnadenlos gefressen, bis es mir irgendwann
d&auml;mmerte und ich erkannte, was f&uuml;r eine Verarschung ihm da
gelungen war. Traurig aber wahr!<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Kein X-Wing also, aber dennoch kein Grund zur Depression, denn ein
Amiga hat andere Qualit&auml;ten, die der PC nie erreichen konnte. Das ihm
oder anderen zu erkl&auml;ren, war allerdings vergebliche M&uuml;h´. Ich
erinnere mich, einem gewissen Andreas K. (Name, Adresse und
Schuhgr&ouml;&szlig;e der Redaktion bekannt) einmal den unterschied
zwischen Amiga- (Bitplanes) und PC-Grafikaufbau (Chunky) erkl&auml;ren zu
wollen und warum deshalb das Scrolling am Amiga einfach besser ist. Aber er
glaubte mir nicht mal, da&szlig; das WYSIWYG in Textverarbeitungen am PC
und am Amiga im Prinzip dasselbe ist und ein Amiga bei gleicher
Aufl&ouml;sung im AmiWrite demnach etwa dasselbe Bild produzieren mu&szlig;
wie das Mikroweich (tm) - Word am PC.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Und wo ich schon bei den Anekdoten bin (mittlerweile glaubt wohl kein
Leser mehr daran, da&szlig; dies eigentlich ein Testbericht sein soll),
gleich noch eine, die zum Thema pa&szlig;t: ich Wahnsinniger - geistige
Umnachtung mu&szlig; von mir Besitz ergriffen haben! - hab am Amiga 500
eine Weile mit Begeisterung das Wing Commander gespielt. Gnadenlose
Frameraten und gnadenlose Grafik, aber ich als tempor&auml;rer Masochist
steckte beides weg und knallte die b&ouml;sen Kilrathis quasi in Zeitlupe
ab. Mittlerweile habe ich festgestellt, da&szlig; das Game auf einem
68030/50 (ECS-Version wohlgemerkt) einigerma&szlig;en spielbar ist... aber
am nackten 68000er? Oh Gott <b>wuargh</b> ... ;-)<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Mir fallen momentan haufenweise Anekdoten ein - vielleicht erweitern
wir das AmigaScene demn&auml;chst um eine Anekdoten-Sektion? :-) Aber bevor
sich alle Leser kopfsch&uuml;ttelnd zum n&auml;chsten Artikel
weiterklicken, kehr ich doch vielleicht besser zum Thema zur&uuml;ck. Ich
habe die ehrenvolle Aufgabe, ein Preview (Version 0.8.101) von &quot;Lambda
Sector&quot; zu testen, ein Spiel, das X-Wing und Konsorten &auml;hnlich
werden soll. Mal sehen...<BR>

<BR>Was ich vor mir habe, ist eine interessante und gar nicht mal unflinke
3D-Engine. Alle Extras ausgeschaltet, auf der Blizzard 1230/50 und einem
PAL-LoRes-Screen, so l&auml;uft mein erster Test. Das Ergebnis: 20-25 fps.
Was ist denn &uuml;berhaupt zu sehen? Gute Idee, das mal zu erkl&auml;ren,
gew&uuml;rzt mit Screenshots, die mein Bruder, der Chefredakteur, grabben
wird <b>hehe</b> ...<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Der Sternenhimmel scrollt nicht starr, sondern w&ouml;lbt sich ein
bi&szlig;chen bei Schwenkbewegungen, was in der Tat viel besser wirkt als
anno dazumal bei Wing Commander. Den Effekt zu erkl&auml;ren, ist gar nicht
leicht (zumindest nicht bei meiner laienhaften Fachkenntnis), man kennt ihn
vielleicht von Kameras. Punkte am Rand liegen weiter auseinander, im
Zentrum r&uuml;cken sie ein wenig zusammen. Wer sich nichts drunter
vorstellen kann, sauge sich einfach das Demo, was ich ohnehin empfehlen
wollte. Bei Vorw&auml;rtsbewegungen kommen einem einige Sternchen entgegen,
kein besonders genialer Effekt, aber doch ganz nett. Man kann auch im Setup
einen Hintergrundnebel einstellen, was die Framerate stark verringert, aber
h&uuml;bsch anzusehen ist. Der Nebel verzerrt sich genauso wie die Sterne
und sein Licht wird noch dazu von der Oberfl&auml;che des Raumschiffchens,
welches der Spieler steuert, reflektiert - gut zu sehen auf der
Von-Hinten-Ansicht.<BR>

<BR>Fremde Schiffe sind nett anzusehen, aber leider stehen
sie starr da und lassen sich weder rammen noch abschie&szlig;en. Da gibt
das eigene Flugger&auml;t in der externen Ansicht doch mehr her, denn so
kann man das Shading viel besser bewundern. Diese fremden Objekte
verlangsamen die Framerate erneut ein wenig, aber nicht wesentlich. Witzig
sind die Waffen (im Demo sind leider nur zwei davon verf&uuml;gbar). Die
normale Kanone feuert bl&auml;uliche Sch&uuml;sse, nichts Besonderes an
sich, aber sie gelten scheinbar auch als Lichtquelle. In besagter externer
Ansicht leuchtet das Raumschiff bei Sch&uuml;ssen auf. Noch besser sind die
Missiles, die auf Wunsch Rauchwolken hinterlassen. Nicht nur das Schiff,
sondern auch die Missiles selbst leuchten beim Abfeuern auf (gut zu sehen
in der Rear-View). Man erkennt also eine gewisse Liebe zum realistischen
Detail beim Programmierer. Dem &quot;history.txt&quot; kann man die
Entwicklung der Shading-Routinen und der Engine in groben Z&uuml;gen
entnehmen.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Was gibt es noch zu sagen? Ich glaube, am meisten sagen wohl
Screenshots, und nat&uuml;rlich der pers&ouml;nliche Eindruck vom Demo.
Hiermit empfehle ich nochmal das Saugen oder den anderweitigen Erwerb des
Demos. Graphisch gesehen macht es jedenfalls einen wirklich guten Eindruck.
Vermutlich werden bei der endg&uuml;ltigen Ver&ouml;ffentlichung die
Features und Ideen, sowie die Atmosph&auml;re wesentliche Rollen spielen.
Wenn beides stimmt, dann spricht nichts dagegen, da&szlig; Lambda Sector
ein waschechter Hit wird!<BR>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#wolfi">Wolfgang Lukas</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x009E.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x009D.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x009F.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
