<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x07 - Amiga Forever CD</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0099.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0098.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x009A.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0098.html">Ami ATLAS</A> | <A HREF="0x0099.html">Amiga Forever CD</A> | <A HREF="0x009A.html">ADF Blitzer</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0093.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0094.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0095.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0096.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0097.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0098.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x009B.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x009C.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x009F.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00A0.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00A1.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Amiga Forever CD - Schneisen im Monopolwald</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Ein Amiga ist ein Amiga. Und bleibt es auch. Aber auf
anderer Hardware. </FONT><BR>

<BR>Die Zeiten &auml;ndern sich, so auch die Grundlagen unseres AmigaOS.
Zuerst lief es nur auf 68k-Prozessoren von Motorola, dann kamen die
Emulatoren auf x86 dazu und zuletzt die PPC-Erweiterungen. Nach neueren
Meldungen Hrn.Hiobs geht der Weg mitelfristig wieder zu x86 bis irgendwas
&quot;ganz Tolles, f&uuml;rchterlich Revolution&auml;res&quot; kommen soll. Nunja,
nichtsdestotrotz bietet diese CD von Cloanto eine Sammlung verschiedender
Amiga-Emulatoren f&uuml;r PC, Mac und anderen nebst einigen Goodies.<BR>

<BR>Das CD-DoppelCover (erh&auml;ltlich in &Ouml;sterreich u.a. bei <A
HREF="http://www.pointdesign.com/">PointDesign</A>) erweckt den Schein, als
w&auml;ren im Inneren 2 CDs verborgen, statt dessen ist im hinteren Teil
eine Amiga-Diskette in funktioneller Halterung befestigt, die den
Amiga-Teil des AmigaExplorers enth&auml;lt. Den Rest enth&auml;lt die CD.
Alles, was sich sonst noch in diesem Cover findet, ist ein kleiner
Aufklebebutton mit dem bekannten BoingBall-Motiv. Etwaige gedruckte
Anleitungen oder Dokus findet man keine.<BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Holzf&auml;llerwerkzeuge</B></H3>&nbsp;

<BR>Die CD enth&auml;lt neben WinUAE (v0.7.0), DOSUAE (v.0.6.9c) und Fellow
(v.0.3.2a) (siehe Emulatoren-Test in dieser Ausgabe) auch einen MacUAE
(v0.6.9) in vorinstallierter Fassung. In Archivform weiters Versionen
f&uuml;r Amiga (mit und ohne PPC) und diverse Unixe, sprich der Source
(v.0.6.9) im tar-Stream. Als besonderes Feature sind alle Kickstart-ROMs
und alle Workbench-Disketten von 1.0(!) bis 3.0 als Files auf der CD
enthalten. F&uuml;r die (immer noch) aktuelle V3.1 gab es keine Lizenzen.
Des weiteren ist die schon erw&auml;hnte Netzwerksoftware AmigaExplorer und
auch PersonalPaint (v7.1(!)) dabei.<BR>

<BR>Die umfangrecihe Online-Dokumentation im html-Format enth&auml;lt ein
Interview mit Jay Miner inklusive Original-Soundtrack als wav's und CDDA
und erkl&auml;rt auch die weiteren enthaltenen AmigaTools, wie den 'Filer',
'DirDiff' und 'AmiToRTF'.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Kettenschleifen</B></H3>&nbsp;

<BR>Legt man die CD in einen Rechner mit Win95 ein, so erscheint ein
sch&ouml;nes Auswahlmen&uuml;, mit dem ohne Installation die Emulatoren
direkt gestartet werden k&ouml;nnen oder die entsprechenden Installationen
durchgef&uuml;hrt werden. Das Kopieren der Daten selber ist schnell
geschehen und danach ist alles ohne Reset, Registry-Eintr&auml;ge oder
sonstige absonderlichen Scherze bereits verf&uuml;gbar und braucht nur per
Klick im Men&uuml; gestartet werden. Nat&uuml;rlich k&ouml;nnen eigene
Verkn&uuml;pfungen am Windows-Desktop oder sonstwo abgelegt erden, die dann
das sch&ouml;ne Men&uuml; umgehen und direkt in einen Emulator starten.<BR>

<BR>Die 'angewachsene' Version von PersonalPaint ist wirklich die
Vollversion und kann ohne Einschr&auml;nkung verwendet werden. Wird UAE
oder Fellow von der CD installiert, so ist die mitgelieferte Software
gleich in einem Verzeichnis der Work-Partition zu finden und kann direkt
gestartet werden.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Selbstverfreilichkeiten</B></H3>&nbsp;

<BR>Ja, es ist selbstverst&auml;ndlich, da&szlig; eine Windoofs-CD dieses
d&auml;mliche Autorun haben mu&szlig; und deshalb man auch nicht einfach
auf das CD-Icon im Explorer klicken kann, um sich den Inhalt anzeigen zu
lassen, da dann die CD startet (hebt sie nun ab, oder was?? Wie soll eine
CD von selber starten?). Dazu brauchts erst im, zugegebenerma&szlig;en
recht ansehnlichen, Men&uuml; einen eigene Punkt, mit dem man durch die
CD-ROM brausen kann (Eine Dusche t&auml;ts wohl nicht...).<BR>

<BR>Cloanto allerdings hat sich da nun doch M&uuml;he gegeben und was
Sinnvolles aus diesem Men&uuml; gemacht, was nun im PC-Bereich keine
Selbstverst&auml;ndlichkeit ist. In diesem Men&uuml; findet sich als erster
Punkt ein &quot;Read Documentation&quot;. Achja, alles auf englisch, nix teitsch, das
werte ich aber nicht abwertend. Zweiter Punkt: oben erw&auml;hnter
&quot;Wasserfall&quot;. Als drittes gleich ein &quot;Install to Harddisk&quot;, mit dem einige
zig MB auf die Platte kopiert werden. Lobenswerterweise auch hier (wie auch
bei der UAE-Standardinstallation) keine Eintr&auml;ge in Registries, keine
Resets, gar nix. Fein.<BR>

<BR>Zum Dr&uuml;berstreuen ein Link zur <A
HREF="http://www.cloanto.com/amiga/forever/">Amiga Forever Home Page</A>
und diverse verschiedene Win-, DOSUAE und Fellow-Konfigurationen zum
Direktstarten.<BR>

<BR>In diesem Archiv-Verzeichnis finden sich aber auch noch andere
interessantere Sachen:<BR>

<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=MIDDLE ALIGN=LEFT><TD>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <B>AFR</B> zum Beispiel, mit dem ein Amiga-Floppylaufwerk an den parallelen Port des PCs angeschlossen werden kann. Die einzige Voraussetzung f&uuml;r diesen Port ist, da&szlig; er bidirektional arbeiten kann, denn wie sollte man sonst Daten laden k&ouml;nnen?? Ob nun SPP, EP oder sonstige kryptische K&uuml;rzel diverse Qualit&auml;tsl&uuml;cken wettzumachen versuchen, ist da nicht mehr so erheblich...<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <B>AiG</B> nennt sich Amiga Interactive Guide und bringt im AmigaGuide-Format so Einiges an Informationen zu Geschichte, Programmen, etc. zum Amiga im Allgemeinen. Problematischerweise kann diese Datei mit Multiview nicht angezeigt werden. Sinnig. Die HTML-Version dagegen bietet massige und relativ aktuelle Information von Hi-Toro bis Gateway, von Lorraine bis A4000T und weiter zum A9000 und den diversen Ger&uuml;chten, nie erschienenen Versionen, Grundlagen, und, und, und.<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Schlie&szlig;lich noch ist ein Package namens <B>MSH</B> drauf, das im Grunde auch nichts anderes ist als ein CrossDOS: Amigas k&ouml;nnen damit PC-Disks bearbeiten. Am UAE geht das aber viel einfacher, denn im UAE-Control braucht man nur eine Disk als DFx: einbinden und schon gehts.<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Des Weiteren ein vollst&auml;ndiges Archiv von <B>Picasso96</B> inklusive Developer-Archiv.<BR>
</TD></TR></TABLE>&nbsp;

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Bl&auml;tterrauschen...</B></H3>&nbsp;

<BR>...bekommt man mit dieser CD keines zu h&ouml;ren: Null Doku auf
Papier. Die Online-Doku hats daf&uuml;r in sich. Nicht nur, da&szlig;
fundierte Anleitungen zu den Emulatoren in verschiedenen Versionen und
Sprachen nach einigem Klicken zu finden sind, auch die ganzen Guides zu
oben angegebenen Programmen sind per Webbrowser erreichbar. Da hat sich wer
die M&uuml;he angetan, das alles in HTML umzusetzen...<BR>

<BR>Die beiden Interviews vom Jay Miner sind zu lesen und zu h&ouml;ren und
die Patentschriften des Ur-Amigas (&quot;Video Game and Personal Computer&quot;) als
gut zu lesende GIFs dabei.<BR>

<BR>Nicht fehlen darf in der Doku nat&uuml;rlich die Erkl&auml;rung der
AmigaExplorer-Software, die es &auml;hnlich einem NFSd erlaubt,
Amiga-Laufwerke an PCs zu exportieren. Das Ganze mit graphischer
Oberfl&auml;che und einfacher Syntax. Gleiches kann man zwar mittlerweile
auch mit Samba und geeignetem Handler erreichen, aber eben nicht so
komfortabel. Die Verbindung zwischen Amiga und PC kann beim AmigaExplorer
sowohl &uuml;ber TCP/IP als auch &uuml;ber ein serielles Nullmodemkabel
erfolgen. Die Amiga-Seite des Explorers ist dabei auf der Diskette zu
finden.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Nebenger&auml;usche</B></H3>&nbsp;

<BR>Nur mehr peinlich wohl aber diese simulierte Amiga-Sprachausgabe, die
beim Starten des AuswahlMen&uuml;s unter Windows kommt und m&uuml;hsam ein
&quot;Amiga&quot; zu kr&auml;chzen versucht. Nervig!<BR>

<BR>F&uuml;r die Windows-Fanatiker unter dem Amiga-Usern ist auf der CD
noch so einiges an scheint's Unentbehrlichem, damit der UAE auch zum Laufen
kommt. So findet sich das Sabot- &auml;h, ServicePack 3 f&uuml;r NT4.0 in
vier Sprachen (sprich viermal in voller Ausf&uuml;hrung. Sowas wie
Lokalisierung in sinnvoller Weise ist dem Billy-Boy wohl noch nicht
begegnet...), die erforderlichen DirectX-Treiber, damit sich Picasso96
austoben kann und ein VESA-Treiber-Pack, damit UAE und Fellow unter DOS zu
ihren Ehren kommen k&ouml;nnen.<BR>

<BR>Insgesamt also ein recht umfangreiches Paket, da&szlig; man da bekommt,
von dem sich auch echte Amigas noch ein paar Sp&auml;ne heraushobeln
k&ouml;nnen ;-)<BR>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#rockus">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0099.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_07/amigaforever_cd.txt">ls -aR</A> Listing des Inhalts der Amiga-Forever-CD (ASCII;164KB)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_07/amigaforever_cd.lha">ls -aR (lha)</A> Selbiges im lha-Archiv (LHA;34KB)<BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.cloanto.com/amiga/forever/">Amiga Forever Home Page</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_07/amigaforever_cd.jpeg">Amiga Forever CD Cover</A> (JPEG;33K)<BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0098.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x009A.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
