<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x07 - Foundation</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x009D.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x009C.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x009E.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=79 HEIGHT=25 SRC="../images/_spiele_.gif" ALT="[Spiele]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x009C.html">Genetic Species</A> | <A HREF="0x009D.html">Foundation</A> | <A HREF="0x009E.html">Lambda Sector Preview</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0093.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0094.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0095.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0096.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0097.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0098.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x009B.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x009C.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x009F.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00A0.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00A1.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Foundation - &quot;Die Siedler III&quot;</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Alle Jahre wieder gibt es Spiele, die dank ihrer
Innovativit&auml;t und Genialit&auml;t binnen kurzer Zeit zu
&quot;Kultspielen&quot; erkoren werden. Ein solches Kultspiel war
sicherlich &quot;Die Siedler&quot; von Blue Byte. Da&szlig; man aber auch
diese Spielidee noch weit verbessern und verfeinern kann, davon zeugt
&quot;Foundation&quot; von Sadeness Software. </FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Tats&auml;chlich handelt es sich bei Foundation um ein h&ouml;chst
komplexes &quot;realtime strategy wargame&quot;, wie das Cover verspricht.
F&uuml;r alle, die Die Siedler nicht kennen sollten, sei kurz erkl&auml;rt,
worum es prinzipiell geht. Man bev&ouml;lkert und bebaut eine Landschaft
nach und nach mit kleinen Menschlein und Geb&auml;uden aller Art, wobei die
Rohstoffe begrenzt sind und erst gef&ouml;rdert werden wollen. Hierbei
ergibt sich eine gewisse Produktionskette, die es zu hegen und zu pflegen
gilt (beispielsweise durch effiziente Raumaufteilung). Nebenbei expandiert
man fr&ouml;hlich und vernichtet alle Feinde, die ihrerseits selbiges
planen. Das ganze Geschehen betrachtet man in einer Iso-3D-Sicht und kann
die umherwuselnden M&auml;nnchen beobachten, die sich z.B. &uuml;ber
Bergh&auml;nge etwas schwerer tun als in Ebenen. Man schl&auml;gert also
Holz und Stein, forstet den Wald wieder auf, baut Kohle, Erz und Gold ab,
versorgt die Arbeiter mit Nahrung von Farmen, B&auml;ckereien oder
Fischerh&uuml;tten, produziert aus den gewonnen Rohstoffen Waffen und
andere Werkzeuge, stellt Wachh&uuml;tten f&uuml;r die Ritter auf und
mu&szlig; - bei Die Siedler - auch noch penibel darauf achten, ein gutes
Stra&szlig;ennetz zu bauen, denn nur auf selbigem k&ouml;nnen sich die
kleinen Wuselm&auml;nner bewegen.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>W&auml;hrend allerdings bei Die Siedler alles viel automatischer und
allgemeiner abl&auml;uft, stellt Foundation durch die hohe
Individualit&auml;t enorme Anspr&uuml;che. Was ist denn damit gemeint? Ganz
einfach: zwar mu&szlig; man bei Foundation keine Stra&szlig;en bauen,
daf&uuml;r aber kann man jedes und wirklich jedes Menschlein einzeln
kontrollieren und steuern! Genauso bietet jedes Geb&auml;ude genaue
Einstellungsm&ouml;glichkeiten &uuml;ber Bewohner, Bedarf an und Produktion
von G&uuml;tern, man mu&szlig; es auch zeitweise reparieren.
Reparaturbed&uuml;rftig sind auch die Menschlein, denn jedes verf&uuml;gt
&uuml;ber eigene Gesundheit, Moral und Alter. Krankenh&auml;user, Kirchen
und Tavernen k&ouml;nnen hier Abhilfe schaffen, allerdings sollte man das
Problem schon an der Wurzel bek&auml;mpfen. Wer die Population mit gesunden
Nahrungsmitteln versorgt, hat wohl kaum Gesundheitsprobleme. Der Wein
wiederum st&auml;rkt die Moral auf Kosten der Gesundheit. Es ist also gar
nicht so einfach, es den M&auml;nnlein, Weiblein, Zauberern, Rittern und
Erfindern leicht zu machen.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Das war auch schon das Stichwort zur Erkl&auml;rung der Vielfalt des
Volkes. M&auml;nnlein sind Arbeiter oder Laufburschen, w&auml;hrend
Weiblein als Jungfern f&uuml;r die Vermehrung zust&auml;ndig sind. Selbiges
kann nur bei entsprechender Privatsph&auml;re geschehen, also baut man
Bauernh&auml;user, wo immer wieder frische M&auml;nnlein und Weiblein
&quot;produziert&quot; werden. Die Zauberer k&ouml;nnen H&auml;user bauen
und abrei&szlig;en, brennende H&auml;user l&ouml;schen (Bauern k&ouml;nnen
die n&auml;mlich mit &Ouml;l anz&uuml;nden!), Wald aufforsten und Steine
erschaffen. Ritter sind nat&uuml;rlich zu Verteidigung und Kampf da.<BR>

<BR>Hochinteressant und essentiell sind die Erfinder. Anfangs ist
n&auml;mlich die Auswahl an Geb&auml;uden noch stark begrenzt, und es
m&uuml;ssen erst neue Technologien erfunden werden. Die Vielfalt
w&auml;chst also erst allm&auml;hlich so richtig heran.<BR>

<BR>Da alle einmal in die ewigen Jagdgr&uuml;nde eingehen m&uuml;ssen
(Todesarten: nat&uuml;rlich, Altersschw&auml;che, Selbstmord, schlechte
Gesundheit, Mord ...), sollte der Nachschub gew&auml;hrleistet sein:
Erfinder, Zauberer und Ritter rekrutiert man in der Kaserne. Das kostet
Gold (aus dem Schmelzhaus) oder Waffen (aus der Waffenschmiede). Die Toten
sind &uuml;brigens alles andere als wertlos: im Krematorium wird aus ihnen
Magie f&uuml;r die Zauberer hergestellt. Und sollte einmal akuter Mangel an
irgendwelchen Waren bestehen, so kann man diesen im Tauschhandel beheben.
Der Sofortverkauf ist weniger ertragreich, aber eben sofort abgewickelt.
Man kann auch handeln, das ist effizienter, aber dauert ein Weilchen, und
manchmal wird der Handel dann abgelehnt.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>W&uuml;rde ich wirklich alles genauestens beschreiben, dann w&auml;re
dieser Testbericht bald ein Roman, den keiner mehr liest. Also springe ich
besser weiter zum strategisch-kriegerischen Teil: Jedes Menschlein kann
quer &uuml;ber die Insel geschickt werden, um das Gebiet zu erkunden. Es
ist n&auml;mlich keineswegs alles bekannt: was man nicht sieht, liegt im
Dunkeln. Schon gesehene Teile, wo niemand in der N&auml;he ist, sind
halbdunkel, und wer wissen will, was dort wirklich vorgeht, mu&szlig; wohl
oder &uuml;bel jemanden hinschicken oder ein Geb&auml;ude in der
unmittelbaren N&auml;he errichten. Aber wehe, wenn dieses angez&uuml;ndet
oder von Rittern &uuml;berfallen wird! Gottseidank hat jedes Geb&auml;ude
optionalen Ritterschutz, aber gegen eine gr&ouml;&szlig;ere Feindesschar
zieht ein einzelner Ritter wohl eher den K&uuml;rzeren.<BR>

<BR>Rache ist allerdings s&uuml;&szlig;, und was der Feind kann, kann der
Spieler schon lange! Man stelle einfach eine gro&szlig;e Gruppe Menschlein,
vorzugsweise Ritter, zusammen (komfortable Gruppenbefehle per Keyboard) und
schicke sie alle gemeinsam in bester Command&amp;Conquer-Manier los, auf
da&szlig; sie die feindlichen Forts &uuml;berrennen! Ist aber die eigene
Gesundheit wegen zu hohem Widerstand am Sand, so hilft nur die Flucht ins
traute Heim und dann ins Krankenhaus. Der Feind bricht die Verfolgung
hoffentlich angesichts des eigenen &quot;Dorfes&quot; ab, denn wo ein Dorf,
da sind frische K&auml;mpfer nicht weit...<BR>

<BR>So ein Nahkampf kostet ganz sch&ouml;n Substanz. Ist es da nicht viel
besser, Bogensch&uuml;tzen in Sch&uuml;tzent&uuml;rmen zu postieren? Das
ist zwar eine feige, aber durchaus effiziente Methode. Oder den Gegner ins
eigene Gebiet locken und ihm dann ganz hinterh&auml;ltig den Weg
abschneiden...<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Aber genug damit, sonst nehm ich ja noch die ganze Spannung weg! Zu den
Missionen sei noch erw&auml;hnt, da&szlig; sie relativ einfallsreich
ausgefallen sind, also nicht blo&szlig; &quot;vernichte den Feind&quot;,
sondern auch beispielsweise &quot;produziere dieses und jenes&quot; oder
&quot;zerst&ouml;re alle feindlichen Laboratorien&quot;. Klingt einfacher
als es ist! Zwischen den Missionen darf man h&uuml;bsch gerenderte und
gezeichnete Grafiken bestaunen und sich des netten Soundtracks erfreuen.
W&auml;hrend der Mission wird man, vorausgesetzt man installiert eifrig
Daten auf die Platte, von herrlichen CDDA-Soundtracks verw&ouml;hnt.
Samples und die Amiga-Musik sind wahlweise per AHI zu genie&szlig;en -
womit ich schon l&auml;ngst mitten in der Optionenvielfalt bin. Screenmodi
f&uuml;r Spiel und Missionen, AHI- oder &quot;normaler&quot; Sound, Grafik-
und Soundbuffer, die Sprache, was man alles von CD auf Harddisk
installieren m&ouml;chte ... dies und noch ein paar andere Dinge lassen
sich wunderbarerweise bestens konfigurieren. Volles Multitasking und
Systemfreundlichkeit geh&ouml;ren ebenfalls dazu. Das Handbuch ist -
selbstverst&auml;ndlich in mehreren Sprachen - in HTML-Form zug&auml;nglich
und recht informativ. Eine AWeb-Version und sonstiger notwendiger
Schnickschnack sind auf der CD gleich mitgeliefert. Eine nette Intro-Story
macht kr&auml;ftig Appetit auf das Spiel (hat man den nicht ohnehin
schon?).<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Und w&auml;hrend im Vergleich zu &quot;Die Siedler&quot; ein paar
Features &quot;fehlen&quot;, so hat Paul Burkey, der Programmierer, doch
eine Unmenge an eigenen neuen Features hinzugef&uuml;gt, die Foundation als
eigenst&auml;ndiges und innovatives Spiel erscheinen lassen. Au&szlig;erdem
hat er versprochen, das Game st&auml;ndig weiterzuentwickeln und die
Fangemeinde mit Updates zu versorgen, zu welchen auch eine
TCP/IP-Unterst&uuml;tzung geh&ouml;ren soll. Da kommt echte Freude auf! Ich
pers&ouml;nlich bin von dem Spiel ohnehin l&auml;ngst begeistert und werde
gewi&szlig; noch viele Stunden damit verbringen...<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die Mindestkonfiguration ist AGA oder eine Grafikkarte, 2 MB RAM, ein
68020-er, ein 2x-CD-Rom und eine Festplatte - das hat heutzutage eh schon
fast ein jeder. Wenn nicht, dann empfehle ich w&auml;rmstens ein
Aufr&uuml;sten, denn sonst k&ouml;nnte man gar den gro&szlig;artigen
Spielspa&szlig; verpassen, den Foundation bietet!<BR>

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Grafik</TD>          <TD><IMG SRC="../images/_box_red.gif" WIDTH=86 HEIGHT=10 ALT="[86]"><IMG SRC="../images/_box_black.gif" WIDTH=14 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Animation</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=70 HEIGHT=10 ALT="[70]"><IMG SRC="../images/_box_black.gif" WIDTH=30 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>SFX</TD>             <TD><IMG SRC="../images/_box_red.gif" WIDTH=88 HEIGHT=10 ALT="[88]"><IMG SRC="../images/_box_black.gif" WIDTH=12 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Music</TD>           <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Gameplay</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=87 HEIGHT=10 ALT="[87]"><IMG SRC="../images/_box_black.gif" WIDTH=13 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dauerspa&szlig;</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=82 HEIGHT=10 ALT="[82]"><IMG SRC="../images/_box_black.gif" WIDTH=18 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>OS-Friendly</TD>     <TD><IMG SRC="../images/_box_red.gif" WIDTH=80 HEIGHT=10 ALT="[80]"><IMG SRC="../images/_box_black.gif" WIDTH=20 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=85 HEIGHT=10 ALT="[85]"><IMG SRC="../images/_box_black.gif" WIDTH=15 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#wolfi">Wolfgang Lukas</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x009D.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x009C.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x009E.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
