<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x07 - UAE und Fellow</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x009F.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x009E.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00A0.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=100 HEIGHT=25 SRC="../images/_special_.gif" ALT="[Special]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x009F.html">UAE und Fellow</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0093.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0094.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0095.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0096.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0097.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0098.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x009B.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x009C.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x009F.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00A0.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00A1.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>UAE und Fellow - Amiga Emulatoren am PC und Mac</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">In Zeiten, wo selbst ein Amiga sich mit x86 und solch
&quot;Zeugs&quot; herumschlagen mu&szlig;, wird es immer wichtiger, sich
mal anzusehen, wie ein ClassicAmiga sich auf solchen Systemen verh&auml;lt.
Einen Vorgeschmack auf Kommendes m&ouml;gen die diversen f&uuml;r PCs
erh&auml;ltliche Emulatoren bieten, deren einer ein Unix-Derivat namens UAE
darstellt. </FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Angefangen hat der UAE als Versuch, Amiga-Spiele auch auf
Unix-Maschinen durchzocken zu k&ouml;nnen. Mittlerweile gibt es einen
ganzen Haufen Portierungen, eine davon auf x86 und Konsorten. Diese sei
hier nun unter die Lupe genommen.<BR>

<BR>Zum UAE selber kommt man, indem man sich entweder die AmigaForever-CD
kauft (siehe Test in dieser Ausgabe), oder sich die entsprechenden Archive
aus dem Netz herausfischt..<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Man nehme...</B></H3>&nbsp;

<BR>Damit man &uuml;berhaupt einen emulierten Amiga zu Gesicht bekommt und
sich an der gewohnten Oberfl&auml;che erfreuen kann (PC-User Kommentar:
<I>&quot;Das schafft auch NUR ein Amigafreak! Sch&ouml;n fad
grau!&quot;</I>), ist es aber notwendig, eine Kopie eines Kickstart-ROMs in
einem File zu besitzen und eine Startdiskette ebenfalls als File irgendwo
auf der PC-Platte liegen zu haben. Diese ROM-Images kann man mit einem
Zusatztool namens 'transrom' auf einem echten Amiga erzeugen und braucht
sie dann nur irgendwie auf den PC zu kriegen (das w&auml;re zum Beispiel
eine sinnvolle Anwendung des vielleicht gerade neugebauten Netzes anhand
unserer TCP-Artikelserie...). Um die entsprechenden Files von Disketten zu
erstellen, ben&ouml;tigt man ebenfalls einen echten Amiga
(<I>&quot;&Auml;tsch, nix mit Infiltration. He,he,...&quot;</I>), auf dem dann mit
'transdisk' oder zum Beispiel mittels ADFBLITZER (siehe A-Files in dieser
Ausgabe) die entsprechenden Files erzeugt, aber auch aus Files wieder
Disketten geschrieben werden k&ouml;nnen.<BR>

<BR>Weiters kann man einfach auf der PC-Seite ein Verzeichnis anlegen und
dieses als Harddisk-Emulation auf der Amiga-Seite einbinden
(<I>&quot;Billy, schnell ein paar Securitytools entwickeln! Sonst ist man
nicht mal mehr seiner Daten sicher!&quot;</I>). Dieses Einbinden geschieht
durch Kommandozeilenoptionen beim Aufruf. Man kann also f&uuml;r
verschiedene Konfigurationen weitere PIF-Files, respektive Icons auf der
PC-Seite, anlegen, in denen man angibt, mit welchen Optionen der UAE
gestartet werden soll (<I>&quot;Achtung!
Rachem&ouml;glichkeit!&quot;</I>).<BR>

<BR>Die Herkunft aus UNIX-Gebiet l&auml;&szlig;t sich beim UAE absolut
nicht leugnen, wenn man nach der Menge der kryptischen und unmerkbaren
Startoptionen geht, daher wohl auch die Deutung 'Unixoid Amiga
Emulator'...<BR>

<BR>Nicht nur einzelne Laufwerke oder Verzeichnisse lassen sich auf der
Amiga-Seite einbinden, auch HardDisk-Files k&ouml;nnen angelegt werden.
Diese unterscheiden sich durch Geschwindigkeit des Zugriffes und Art der
Formatierung von den Einbindungsarten &uuml;ber Verzeichnis, freilich
lassen sich solche Files auf der PC-Seite nicht lesen...<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>...und mische ordentlich durch.</B></H3>&nbsp;

<BR>Die Art, wie Amiga-Harddisks emuliert werden, erm&ouml;glicht es,
einfach die essentiellen Verzeichnisse eines originalen Amigas &uuml;bers
lokale Netz oder per Diskette in die enstprechenden Verzeichnisse, die man
als Amiga-Festplatte angegeben hat, zu kopieren, ohne da&szlig;
Amiga-seitig ein Formatieren n&ouml;tig w&auml;re. Die Struktur ist
schlie&szlig;lich auch vom PC aus les- und beschreibbar (<I>&quot;Ah
sch&ouml;n ...&quot;</I>), denn im Endeffekt sind es Files, die auf
PC-formatierten Platten abgelegt werden und nur der UAE setzt das so um,
da&szlig; auch der Amiga die Daten sieht. Auf die gleiche Weise werden auch
die nicht-Amiga-Daten auf anderen PC-Platten und sonstigen eingebundenen
filebasierten Devices auf der Amiga-Seite sichtbar
(<I>&quot;$%&amp;#%$&quot;</I>).<BR>

<BR>Das bringt aber auch die Gefahr mit sich, da&szlig; ein Amok-laufendes
Amiga-Programm Daten der PC-Seite mitrei&szlig;en kann... (<I>&quot;Na, da
haben wirs. Ist auch nicht besser als Win95. DAS zeigt wenigstens an, wenn
es abst&uuml;rzt - zumindest bei mir.&quot;</I>) Aber es steht zu hoffen,
da&szlig; in den n&auml;chsten Amiga-OS-Versionen Speicherschutz und
dergleichen eingebaut sein werden.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Ebenso leicht, wie sich Verzeichnisse von PC-Platten aus einbinden
lassen, k&ouml;nnen auch CD-Laufwerke verwendet werden, da sie ebenfalls
&uuml;ber den Laufwerksbuchstaben gemountet werden. Sogar ein Cd-Wechsel
wird erkannt und ordnungsgem&auml;&szlig; angezeigt. Eine versuchsweise
eingelegte Aminet-CD war einwandfrei benutzbar, nur ihr Diskicon wurde
durch ein DefaultIcon ersetzt. Auf die gleiche Art und Weise werden auch am
PC aus dem Netz importierte Verzeichnisse auf der Amiga-Seite als eigene
Laufwerke anzeigbar, wenn man nur die enstprechende Option in der
Kommandozeile beim Starten angibt.<BR>

<BR>Die Installation des UAE selber gestaltet sich simpel, da einfach das
File in ein Verzeichnis kopiert werden mu&szlig; und dann mittels einer
Menge Startoptionen aufgerufen werden kann. Dazu sind weder Neustart von
Windows, noch langwierige Installationssessions oder gar Eintr&auml;ge in
diverse Registries, bei denen sich eh keiner auskennt, n&ouml;tig (da kommt
ja fast Amiga-Feeling am PC auf ;-)) ) (<I>&quot;Nimm Dir daran ein
Beispiel, Billy!&quot;</I>). Erstellt man nun eine 'Verbindung' unter
Windows, so kann man dort direkt die Optionen eintragen und der UAE startet
per Doppelklick den Amiga hoch.<BR>

<BR>Nat&uuml;rlich geht die Emulation soweit (da ja 'originale' ROM-Images
verwendet werden), da&szlig; beim Dr&uuml;cken beider Maustasten beim Start
oder nach einem Reset man die Early-Startup zu Gesicht bekommt. Ja, richtig
gedacht: PAL-und NTSC-Screens werden auf die PC-Grafikkarte umgelenkt, erst
dadurch sind ja die ganzen Spiele spielbar...<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Nun schlage man es auf, trenne ordentlich...</B></H3>&nbsp;

<BR>Der UAE an sich &ouml;ffnet zuerst eine DOS-Session, aus der dann der
Amiga startet, insofern unterscheiden sich die DOS- und die Windows-Version
nicht sonderlich voneinander. Unter Windows aber arbeitet der UAE
v&ouml;llig im Multitasking und man kann ohne Probleme mit Alt-Tab zwischen
den PC-Tasks und Amiga-Seite umschalten. Erfreulicherweise l&auml;uft der
Amiga auch im Hintergrund weiter und die beiden Welten blockieren sich
gegenseitig nicht (<I>&quot;Wie war das mit dem Joystick Error. Der
Witzbold wollte unbedingt einen finden - ich hatte den doch extra
weggejumpert!!!&quot;</I>). Allerdings sind die Schnittstellen, die am
Amiga emuliert werden sollen, inzwischen f&uuml;r die PC-Seite gesperrt,
man kann also nicht schnell mitn Netscape was im Netz nachschauen, solange
die Emulation l&auml;uft (<I>&quot;Doof!&quot;</I>). Unter Windows ist ja
auch das Konzept eines shared-Zugriffes nicht wirklich bekannt...<BR>

<BR>Die Joystickemulation l&auml;&szlig;t zur Auswahl, was man auf die
beiden GamePorts des Amigas schalten m&ouml;chte. Neben PC-Maus stehen da
auch diverse Tastaturkombinationen zur Auswahl, mittels derer sich ein
Joystick emulieren l&auml;&szlig;t, was allerdings nicht sinnvoll scheint,
wenn man am Amiga auch Texte zu schreiben hat oder diese Tasten eben
anderweitig ben&ouml;tigt. Ein eventuell am PC vorhandener Joystick wird zu
erkennen und benutzen versucht.<BR>

<BR>Die Emulation kann einen 68000 oder einen '020er der Amiga-Seite
vorgaukeln, wobei sichtlich das Augenmerk auf Kompatibilit&auml;t gelenkt
wurde, da einige &auml;ltere Spiele sich auf einem UAE, der auf einem
neueren Amiga l&auml;uft, funktionieren, am echten Amiga darunter sich aber
nicht mehr starten lassen...<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>...und lasse ihn an einem warmen Platz gehen.</B></H3>&nbsp;

<BR>Hat man nun einmal die Workbench, kann man sich darauf fast ganz normal
wie auf einem echten Amiga bewegen (<I>&quot;Bewegen?! Da mu&szlig; man
erst einmal den Mauszeiger finden! So mini und scheu&szlig;lich rot wie der
ist, verliert man ihn auf dem grau-roten Hintergrund st&auml;ndig aus den
Augen - ich zumindest, und ich bin normalsichtig. Nur als
Randbemerkung...&quot;</I>). Selbst das Maushandling ist einigermassen
Amiga-like, auch wenn die Windows-typische Ungenauigkeit noch zu
sp&uuml;ren ist (<I>&quot;Grmpf... Ja, wenn man damit nicht umgehen
kann...&quot;</I>).<BR>

<BR>Irgendwie kommen mir die Proportionen der Original-Icons etwas in die
Breite gezogen vor (<I>&quot;Da stimmen einfach die Proportionen nicht.
Sogar die Uhr ist oval!&quot;</I>), was aber auch daran liegen kann,
da&szlig; ich schon lange keine Original-Disc-Icons mehr gesehen habe. Ohne
Probleme lassen sich aber die MWB-Icons oder sonstige
dar&uuml;berinstallieren, dennoch ist bei gleicher Breiten und
H&ouml;henangabe kein Quadrat, sondern ein Rechteck zu sehen. Nein, ich
habe keine obskure Aufl&ouml;sung gew&auml;hlt, sondern 1024x768 als
Standardaufl&ouml;sung...<BR>

<BR>Hat man sich in jahrelanger Kleinarbeit seinen Amiga eingerichtet,
f&auml;llt einem erst bei einem nackten UAE so wirklich auf, was eigentlich
im 3.1er so alles an kleinen Goodies und Tools fehlt. Aber das ist wohl ein
anderes Thema...<BR>

<BR>Ein KingCON und ARQ sind f&uuml;r mich nun mal ziemlich unverzichtbar,
auf ein Entklicken der Laufwerke kann man aber naturgem&auml;&szlig;
getrost verzichten, denn es gibt keine, die klicken k&ouml;nnten. Anstelle
dessen greift man ja eigentlich auf Files zu, denn ein PC-Laufwerk kann mit
Amiga-Disks nunmal ganz und gar nichts anfangen... (<I>&quot;Wozu
auch?&quot;</I>) Baut man sich das FastIPrefs, das unter Picasso96 ja fast
schon wieder Standard ist, in die startup-sequence ein, um auch unter
farbtieferen Screens wieder passende Icons zu haben, erlebt man allerdings
eine &Uuml;berraschung: es hilft n&auml;mlich nichts. Das hei&szlig;t, es
hilft schon, f&uuml;r die Aspekte, f&uuml;r die es sonst noch so da ist,
wie bessere WBPatterns, schnelleres Laden von Bildern usw. Aber die Icons
behalten ihre Falschfarben hartn&auml;ckig bei.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Normalerweise startet man in einem der PAL-oder NTSC-Modi, auch ein
Overscan ist einstellbar. Die Emulation des Chipsatzes ist wirklich gut
gelungen. Es funktioniert einfach. Fein.<BR>

<BR>Daneben kann man aber auch ein Picasso96 ohne Probleme installieren.
Ohne Amiga-Graikkarte? Freilich, denn es gibt einen Treiber namens
'uaegfx', der auf die PC-Grafikkarte zugreifen kann und somit auch einem
emulierten Amiga hohe Aufl&ouml;sungen und gro&szlig;e Farbtiefen bieten
kann (<I>&quot;Ha! Da sag noch einer, die PC-Hardware k&ouml;nne der Amiga
Hardware nicht das Wasser reichen!&quot;</I>). Die Funktionalit&auml;t und
Bedienbarkeit bleibt dabei v&ouml;llig gleich zum Verhalten auf echten
Amigas, zus&auml;tzlich lassen sich Grafikkarten mit 8MB auch einbinden und
es gibt sogar eine Option f&uuml;r mehr als 2MB ChipRAM :-)))<BR>

<BR>Ein Problem tritt aber mit 'uaegfx' dennoch auf, das es bei der
Emulation von PAL und NTSC nicht gibt: schaltet man auf die PC-Seite und
wieder zur&uuml;ck zum Amiga, wird nur der graue Hintergrund gezeigt und
das Bild mu&szlig; erst h&auml;ndisch refresht werden (<I>&quot;Das Problem
kennt man von Win95 NICHT!&quot;</I>). Woran im Speziellen das liegt,
konnte ich noch nicht herausfinden, denn mir kommt vor, da&szlig; das
direkt nach dem Installieren noch nicht so war.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Abschmecken und hei&szlig; servieren!</B></H3>&nbsp;

<BR>Mein Versuchs-UAE l&auml;uft mit Kick/WB 3.0 und in dieser
Konfiguration ist das Ganze nicht wirklich stabil. So viele Gurus (der
bekannte schwarze Screen mit blinkendem Rot hat am PC fast beruhigende
Wirkung :-)) ) (<I>&quot;Solange der nicht zu einem wohlbekannten
BlueScreen morpht...&quot;</I>) und Software Failures hatte ich schon lange
nicht mehr gesehen. Mit der neuen Version 0.7.5b1, die zwar noch in der
BetaPhase ist, &auml;nderte sich dieses Verhalten einigermassen, es ist
aber immer noch auff&auml;llig absturzgef&auml;hrdet (<I>&quot;Es wird
immer Windows95 &auml;hnlicher...&quot;</I>).<BR>

<BR>Mit Kick/WB 3.1 schaut das Ganze etwas anders aus, allerdings sind mir
hier auch Abst&uuml;rze vorgekommen, die aber eindeutig auf das Konto des
lieben ARQ gehen. Wirft man den aus dem System, geht's auf einmal...<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Im Gegensatz zur wohl urspr&uuml;nglichen Intention zur Spielbarmachung
alter Games habe ich versucht, den UAE zu einem Arbeitsger&auml;t
aufzusetzen und wollte somit unter anderem auch mal &uuml;ber Modem oder
Netzwerkkarte in ein DialIn- bzw. lokales Netz einsteigen.<BR>

<BR>Laut Dokumentation ist aber die Emulation der seriellen Schnittstelle
(der man PC-seitig ja frei eine der COMx zuweisen kann) noch nicht fertig
und unzuverl&auml;ssig. Das &auml;u&szlig;ert sich so, da&szlig; man z.B.
mit term ohne Probleme mit dem Modem sprechen kann und es w&auml;hlt und es
kommt die Kennung und man ist in der Mailbox drinnen, kurz, es
funktioniert. Auch wenn term beim Start motschgert, da&szlig; es kein
DSR-Signal finden kann. Das nun kann jetzt daran liegen, da&szlig; ich das
Konfigurieren der Seriellen am PC nicht durchschaut habe oder an der nur
teilweisen Emulation dieser Schnittstelle im aktuellen UAE (<I>&quot;Ich
wei&szlig; ja, da&szlig; man mit den Servern der TU-Graz Probleme haben
kann, aber mit der Seriellen ... Ha, da lacht euch der PC eins und sagt:
&quot;Meine Schnittstelle geh&ouml;rt MIR!!&quot;&quot;</I>).<BR>

<BR>Die Wirkung des fehlenden DSR und scheints auch noch anderer
Unstimmigkeiten &auml;u&szlig;ert sich weiters darin, da&szlig; ein Miami
das Modem m&uuml;hsam, aber doch, findet und sich auch einw&auml;hlen kann.
Jedoch steigt Miami wahlweise in der LCP- oder NCP-Phase der
PPP-Authentifizierung mit einem Timeout aus. AmiPPP dagegen kann bei
gleichen Schnittstellen-Einstellungen das Modem gar nicht finden...<BR>

<BR><CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die Unterst&uuml;tzung von lokal eingebauten Netzwerkkarten dagegen ist
noch gar nicht implementiert und so ist von der Amigaseite aus auch noch
kein Zugriff auf ein LAN m&ouml;glich (<I>&quot;Also nix mit
Netzwerkdrucker.&quot;</I>). Ist nat&uuml;rlich nicht sch&ouml;n, aber wenn
es nur ums Datenschaufeln geht, l&auml;&szlig;t sich das ja nun auch auf
der PC-Seite erledigen, da ja auch hier direkt in Amigabereiche kopiert
werden kann. Um auch vom Amiga aus drucken zu k&ouml;nnen, mu&szlig; der
Netzwerkdrucker auf der PC-Seite einer LPTx zugewiesen werden und diese
kann dann als Parallele in den UAE &uuml;bernommen werden.<BR>

<BR>Die Unterst&uuml;tzung von Netzwerkkarten und die vollst&auml;ndige
Emulation der Seriellen stehen aber neben Anderem auf der Todo-Liste der
UAE-Programmierer... (<I>&quot;K&ouml;nnen sich ruhig Zeit lassen. Mein PC
mu&szlig; schlie&szlig;lich auch noch was zu tun haben.&quot;</I>)<BR>

<BR>Man kann das Problem aber teilweise umgehen, indem man die Devices
PC-seitig importiert und dem UAE dann als lokales Devices zum Fressen
vorwirft.<BR>

<BR><CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Schon aufgegessen???</B></H3>&nbsp;

<BR>Ja, so schnell kanns gehen, aber schnell ist der UAE nur auf
aufgebohrten PCs. Ich sitze hier an einem AMD K6-200 mit ordentlicher
Grafikkarte und 64MB RAM und die Amiga-Seite ist brauchbar. Etwa
vergleichbar mit meinem 030er bei 40MHz, gef&uuml;hlsm&auml;ssig.<BR>

<BR>Ein CandyFactory zum Beispel aber schneckt nur und ist bei dieser
Konfiguration unbrauchbar, wenn auch funktionsf&auml;hig...<BR>

<BR><CENTER><A NAME="12" HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Kr&uuml;meleien...</B></H3>&nbsp;

<BR>Ja, nebenbei gibt es auch noch einen DOSUAE, der unter DOS gestartet
diesselben F&auml;higkeiten bieten soll, wie ein WinUAE. Disks per ADF- und
Platten per HDF-File eingebunden, sind ohne Probleme ansprechbar und
verwendbar, auch lassen sich wie beim WinUAE einzelne Verzeichnisse als
eigene Platten mounten. Das Problem dabei ist aber das archaiische
8.3-Format. Somit ist eine START~23. nicht mehr wirklich vom Amiga als
startup-sequence erkennbar und ein Devic~72.inf macht sich auch nicht
sonderlich gut als Info-File... An und f&uuml;r sich aber funktioniert es
und die Funktionen und Einschr&auml;nkungen sind die gleichen wie unter
WinUAE, schlie&szlig;lich ist es ja fast das gleiche Programm.<BR>

<BR>Und einen Fellow haben wir auch noch ausprobiert. Das ist nun ein an
den UAE angelehnter Emulator, der (lt. Doku) eine ganze Ecke schneller als
ein UAE am gleichen System sein soll (inkl. optimierten x86-Assembler-Code
in zeitkritischen Teilen), deshalb wurde er auch auf DOS ausgelegt. Bisher
(Fellow v0.3.2a) ist die Emulation aber erst soweit gediegen, da&szlig; ein
in edlen Blau- und Oranget&ouml;nen gehaltenes Kick/WB 1.3
(<I>&quot;Scheu&szlig;liche Farben in grauenhafter
Aufl&ouml;sung.&quot;</I>) emuliert werden kann. Mehr geht (noch) nicht.
Auf dem Testsystem l&auml;uft aber ein solcher Amiga mit ca. 400% der
Originalgeschwindigkeit, glaubt man der rechts oben eingeblendeten Zahl.
Ein Boing-Ball-Demo l&auml;uft hier sehr eindrucksvoll, aber trotzdem
rucklig. Dem PC kann man seine Eigenheiten eben nicht ganz abgew&ouml;hnen
;-(.<BR>

<BR>Beim MacUAE ist man mittlerweile bei Version 0.8.4 angekommen, die zwar
noch experimentellen Status hat, aber an und f&uuml;r sich l&auml;uft.
Getestet auf einem PowerMac 6100/60 (Danke, Agi!) brauchts allerdings trotz
wundersch&ouml;ner Oberfl&auml;che und eleganten Prefs (Mac eben, aber
sonst gleiche Syntax und Funktionsvielfalt wie auf anderen Systemen...)
eine Ewigkeit, bis &uuml;berhaupt die Diskette fliegen darf. Eine weitere
Ewigkeit bis zur Workbench. Im Grunde funktionierts aber.<BR>

<BR><CENTER><A NAME="13" HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#14"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Das Angenehme an allen diesen Emulatoren ist, da&szlig; sie alle die
gleichen ROM-Images, Key-Files, ADFs und HDFs verstehen, also alles
untereinander ausgetauscht werden kann.<BR>

<BR>Bei den ROM-Images gibt es noch die Besonderheit, da&szlig; nicht alle
so einfach funktionieren. Wer aber die ROM-Files aus einem 2000er oder
Vergleichbarem holt, hat keine Probleme.<BR>

<BR>Ganz und gar emuliert wird aber ein Amiga auch nicht, denn die FPU
fehlt auf der UAE-Seite immer (noch). Sie ist meiner Meinung nach aber
nicht so wichtig, denn f&uuml;r aufwendiges Rechnen nimmt man ja eh den
Original-Amiga, der daneben steht (<I>mit Betonpfeiler wachel...</I>), oder
gleich was &quot;Ordentliches&quot;, und welches Spiel braucht denn schon
eine FPU?<BR>

<BR><CENTER><A NAME="14" HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#15"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>L&auml;&szlig;t man die ganzen kleinen Testutilities &uuml;ber einen
UAE-Amiga laufen, findet man dann doch schnell die Unterschiede im System
heraus. Ein AIBB semmelt gleich beim Starten, wenn kein Prefs-File
vorhanden ist. SysInfo kann den Prozessor nicht bestimmen, zeigt aber bei
mir 44.44 MHz und einen Faktor von 1.12 gegen&uuml;ber einem 1200er mit
68020 bei 14MHz. SCSI will er in diesem reinen IDE-Rechner erkannt haben
und semmelt somit, wenn man sich dieses Detail n&auml;her ansehen will.
Ansonsten aber zeigt es die gewohnten Ergebnisse und Auflistungen. Ein
ShowConfigEnh (enhanced version, die die Namen der Boards und dessen
Hersteller anzeigt) bringt auch so manches zutage: (<I>Anm. d. Red.: das
letzte Board 2011/2 ist eigentlich ein Quicknet QN2000 Ethernet LAN
Board</I>)<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>PROCESSOR:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;CPU 68020
<BR>CUSTOM CHIPS:&nbsp;&nbsp;&nbsp;ECS PAL Agnus (id=$0020), Normal Denise (id=$00FF)
<BR>VERS:&nbsp;&nbsp;&nbsp;Kickstart version 40.63, Exec version 40.10, Disk version 40.42
<BR>RAM:&nbsp;&nbsp;&nbsp;&nbsp;Node type $A, Attributes $405 (FAST), at $40000000-$41FFFFFF (32.0 meg)
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Node type $A, Attributes $605 (FAST), at $200000-$9FFFFF (8.0 meg)
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Node type $A, Attributes $703 (CHIP), at $400-$1FFFFF (~2.0 meg)
<BR>BOARDS:
<BR>&nbsp;UAE emulated RAM expansion:&nbsp;&nbsp;&nbsp;Prod=2011/1($7DB/$1) (@$200000 8meg Mem)
<BR>&nbsp;UAE emulated RAM expansion:&nbsp;&nbsp;&nbsp;Prod=2011/3($7DB/$3)
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(@$40000000, size 32meg, subsize same Mem)
<BR>&nbsp;UAE emulated graphics:&nbsp;&nbsp;&nbsp;Prod=2011/96($7DB/$60)
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(@$42000000, size 8meg, subsize 2meg)
<BR>&nbsp;UAE emulated HD controller:&nbsp;&nbsp;&nbsp;Prod=2011/2($7DB/$2) (@$E90000 64K)
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Lieb auch die Ausgaben von Diskspeed, da&szlig; der
Billigstorfer-Platte in dem PC eine Transferrate von 11MB/s best&auml;tigt,
und das beim Schreiben von 256K-Bl&ouml;cken. Schon praktisch, diese
Caches...<BR>

<BR><CENTER><A NAME="15" HREF="#14"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Als Testumgebung fungierte der PC meiner lieben Nicole, den sie mit
Win95, einem AMD K6-200, einer Hercules S3 mit 2MB und 64MB RAM ein bisserl
aufgebessert hat. Ihr sind auch die Einw&uuml;rfe oben zu verdanken :-).
(<I>Anm. d. Red.: Die sind genial, hab' mich bereits k&ouml;stlich dabei
am&uuml;siert! So etwas k&ouml;nnten wir &ouml;fter machen.. ;-)</I>) <BR>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#rockus">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x009F.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>
					<A HREF="as-redax.html#nikki">Nicole Erkinger</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x009F.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.freiburg.linux.de/~uae/">Main UAE Site</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://homepage.uibk.ac.at/~csaa2031/amiga/uae/">Official Austrian WinUAE Mirror</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.uae.de/">German UAE Server</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.aqcom.com/lazarus/">Lazarus</A> - ADF-Files<BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://home6.inet.tele.dk/aqvist/uae/">Classics for UAE</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.geocities.com/SiliconValley/Bay/3211/links.html">All UAE Links Known to Mankind</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://people.netcom.co.uk/i.bell/elite/Default.html">Elite</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.factor5.com/download.htm">Katakis, Turrican und andere</A> im ADF-Format<BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x009E.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00A0.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
