<HTML>
<HEAD><TITLE>AmZeiger 06/97 - Amiga WWW Browser Fazit</TITLE>
<META NAME="keywords"    CONTENT="Amiga,WWW,Browser,Magazin,Computer,Zeitschrift">
<META NAME="author"      CONTENT="Andreas Schlick">
</HEAD>
<BODY BACKGROUND="../images/BG.gif">
<CENTER><H1><U>Amiga WWW Browser</U></H1><BR>von<BR><A HREF="mailto:A.Schlick@BBrandes.berlinet.de">Andreas Schlick</A><P></CENTER>

Folgende Browser gibt es f&uuml;r den Amiga noch oder wird es geben:<BR>
<UL>
<LI><A HREF="#ALynx">ALynx</A></LI>
<LI><A HREF="#AWeb">AWeb</A></LI>
<LI><A HREF="#AMosaic">AMosaic</A></LI>
<LI><A HREF="#FWC">Final Web Cruiser</A></LI>
</UL>
<P>

<A HREF="http://www.fhi-berlin.mpg.de/amiga/alynx.html"><A NAME="ALynx"><B>ALynx</B></A></A> ist
die Amiga-Version von <B>Lynx</B>, einem reinen ASCII-Browser, d.h. da&szlig z.B. Bilder nur mit
einem externen Viewer angezeigt werden k&ouml;nnen. Der Vorteil ist, da&szlig <B>ALynx</B>
sehr schnell ist, da nur reiner Text dargestellt werden mu&szlig; und auch sehr speicherschonend.
Die letzte Vollversion, wie auch die neuere
Beta-Version liefen bei mir ohne Probleme und lie&szligen sich auch relativ gut installieren.
<P><HR WIDTH=50%><BR>
An <A NAME="AWeb"><B>AWeb-II 2.1</B></A> ist das Auffallendste, da&szlig; er kein MUI benutzt. Das n&auml;chste (negtiv)
&Uuml;berraschende ist, da&szlig; <B>AWeb</B> der teuerste Browser ist.<P>
<B>AWeb</B> unterst&uuml;tzt in dieser Version leider weder echte Frames (Frames
werden nur als Link am Seitenanfang dargestellt) und auch keine Gif-Anims.
Tabellen werden jedoch grunds&auml;tzlich unterst&uuml;tzt und auch relativ gut
dargestellt. Es wurde zwar bereits f&uuml;r Mai eine Version 3 angek&uuml;ndigt, die aber
leider bisher nicht erschienen ist.  Ansonsten ist <B>AWeb</B> ein solider Browser,
der einzig durch die Nicht-Verwendung von MUI auff&auml;llt. Ich empfinde besonders seinen
Preis als zu teuer (jedenfalls fuer die Funktionen der 2.1Demo Version), wobei ich jedoch nicht
wei&szlig;, was die Vollversion nun tats&auml;chlich bietet.
Eine echte Frame-Unterst&uuml;tzung ist, so weit ich wei&szlig, jedoch bereits (fast) fertig.
Wer sich jedoch am Preis nicht st&ouml;rt und insbesondere einen nicht-MUI benutzenden
Browser haben will, der sollte <B>AWeb</B> nehmen. Alle anderen sind wahrscheinlich mit
<B>Voyager</B> oder <B>IBrowse</B> besser beraten.<BR>

<TABLE ALIGN=CENTER BORDER=1>
<TR><TD><B>Produkt:</B></TD><TD><A HREF="http://www.amitrix.com/aweb.html">AWeb</A></TD><TD><B>Programmierer:</B></TD><TD>Yvon Rozijn</TD></TR>
<TR><TD><B>Art:</B></TD><TD>WWW-Browser</TD><TD><B>Version:</B></TD><TD>2.1 Demo</TD></TR>
<TR><TD><B>Preis:</B></TD><TD>ca. $ 45US zzgl. Versandk.</TD><TD><B>Bez.Quelle:</B></TD><TD><A HREF="http://www.amitrix.com">AmiTrix</A></TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD COLSPAN=2 ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD COLSPAN=2 ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD COLSPAN=2 ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD COLSPAN=2 ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>3</TD></TR>
</TABLE>
<P><HR WIDTH=50%><BR>
<A NAME="AMosaic"><B>AMosaic</B></A> ist ein sehr alter Browser, der kaum neuere
Tags unterst&uuml;tzt. Dazu war er auch teilweise sehr absturzfreudig. Der Gebrauch dieses
Browsers kann nicht empfohlen werden, da er einfach zu alt ist.<P>

<A HREF="http://www.finale-dev.com/finale.html"><A NAME="FWC"><B>Final Web Crusier</B></A></A> ist
ein neues Programm, das von der jungen Firma <A HREF="http://www.finale-dev.com/">Finale Development</A> angek&uuml;ndigt
ist. Er soll den gesamten HTML 3.2 Standard unterst&uuml;tzen und mit Erscheinen von
<A HREF="http://www.finale-dev.com/java.html">MOca</A> auch Java beherrschen. Leider
war bis zum Redaktionsschlu&szlig; keine Version verf&uuml;gbar. Wir werden jedoch sicherlich
sp&auml;ter noch &uuml;ber ihn berichten. <P><HR WIDTH=50%><BR>

<CENTER><H2>Vergleich</H2>
<TABLE BORDER=0><TR><TD><UL><LI><A HREF="#SpVb">Speicherverbrauch</A></LI><LI><A HREF="#Geschw">Geschwindigkeit</A></LI></UL></TD>
<TD><UL><LI><A HREF="#Beurteilung">Beurteilung</A></LI><LI><A HREF="#Preise">Preise</A></LI></UL></TD></TR></TABLE></CENTER>

<P><CENTER><B><A NAME="SpVb">Speicherverbrauch</A></B></CENTER><BR>
Als ersten Vergleich gebe ich den Speicherverbrauch an.
In diesem Fall hat <B>AWeb</B> wahrscheinlich den Vorteil, da&szlig es nicht das
MUI-System mit hochf&auml;hrt, sondern sich auf ClassAct `beschr&auml;nkt'.
<P>
<U>Testverlauf:</U><BR>
F&uuml;r jeden Browser wurde eine neuer Reset gemacht und dann von
einer speziellen Startup-Sequence hochgefahren, die nur die n&ouml;tigsten
Assigns anlegt ohne die Workbench selbst zu starten. Dann wurde mit Avail
der verf&uuml;gbare Speicher angezeigt. Danach wurde der jeweilige Browser
gestartet und nach dem vollst&auml;ndigen Hochfahren wurde wieder mit Avail
der Speicher angezeigt. Ich habe mich hier jetzt nur auf die Differenzen
des verf&uuml;gbaren Speichers vorher und nachher beschr&auml;nkt:
Dabei wurde nat&uuml;rlich darauf geachtet, da&szlig; jeder Browser die gleiche Seite
lud.
<P>
<TABLE BORDER=1 ALIGN=CENTER>
<TH>Browser</TH><TH>Speicherverbrauch</TH><TH>Prozent in Bezug auf IBrowse</TH></TR>
<TR><TD>IBrowse V1.10:</TD><TD>2.233.936 Bytes</TD><TD ALIGN=CENTER>100%</TD></TR>
<TR><TD>Voyager V2.78:</TD><TD>1.660.128 Bytes</TD><TD ALIGN=CENTER>74.32%</TD></TR>
<TR><TD>AWeb    V2.1 :</TD><TD>1.003.072 Bytes</TD><TD ALIGN=CENTER>44.9%</TD></TR>
</TABLE>
<BR>

<P><CENTER><B><A NAME="Geschw">Geschwindigkeitstest</A></B></CENTER><BR>
Als n&auml;chstes ein <A NAME="Geschw">Geschwindigkeitstest</A>. Als Testseite
diente die dt. gecachte Seite der Homepage von <A HREF="http://www.haage-partner.com/">Haage&amp;Partner</A>.
Das Testsystem war ein Amiga2000/040/33Mhz mit einer PicassoIV.
<P>
<TABLE BORDER=1 ALIGN=CENTER>
<TH>Browser</TH><TH>Dauer in Sek.</TH><TH>Prozent in Bezug auf IBrowse</TH></TR>
<TR><TD>IBrowse V1.11:</TD><TD>33 sec.</TD><TD ALIGN=CENTER>100%</TD></TR>
<TR><TD>Voyager V2.88:</TD><TD>24 sec.</TD><TD ALIGN=CENTER>69%</TD></TR>
<TR><TD>AWeb    V2.1 :</TD><TD>35 sec.</TD><TD ALIGN=CENTER>106%</TD></TR>
</TABLE><BR>

<P><CENTER><B><A NAME="Beurteilung">Beurteilung</A></B></CENTER><BR>
Mir pers&ouml;nlich sagt <B>IBrowse</B> am meisten zu. Er unterst&uuml;tzt viele Tags und bietet
auch viele Features. Er ist zwar noch nicht v&ouml;llig bugfrei, aber er st&uuml;rzte bei
mir weniger ab, als z.B. Voyager. Jedoch wurde bei <B>IBrowse</B> die Cache-Verwaltung
nicht vorbildlich gel&ouml;st. Wenn <B>IBrowse</B> nicht normal beendet wurde (z.B. durch
einen Absturz oder Reset), wird beim n&auml;chsten Starten der Cache erstmal
aufger&auml;umt. Dieser Vorgang kann gerade bei einem gr&ouml;&szlig;eren Cache schon eine Weile in
Anspruch nehmen. Desweiteren werden dabei die neueren Seiten aus dem Cache
gel&ouml;scht. :(<BR>
<B>Voyager</B> ist ein guter Browser, der besonders durch seinen niedrigen Preis
besticht. Auch bietet <B>Voyager</B> h&auml;ufig als erster neue Funktionen an, die die
anderen Amiga-Browser erst sp&auml;ter unterst&uuml;tzen, wie z.B. Frames und SSL.
Er ist eine starke Alternative zu <B>IBrowse</B>. Leider sind einige
Funktionen noch immer nicht 100% befriedigend gel&ouml;st. So hat <B>Voyager</B> auch in der
aktuellen Version noch Probleme mit manchen Tabellen, bzw. ihre Darstellung ist
nicht optimal.<BR>
<B>AWeb</B> ist ein solider Browser, der jedoch leider noch keine echten Frames beherrscht.
Auch habe ich bisher keine Informationen, wann die Version 3 herauskommt und
was sie alles wirklich k&ouml;nnen wird. Mit dem Erscheinen der V3 kann er
inbesondere f&uuml;r Nicht-MUI-Fans eine gute Wahl sein, aber das wird sich erst noch
zeigen. Leider ist <B>AWeb</B> auch verh&auml;ltnism&auml;&szlig;ig teuer.<P>

<B>Was fehlt noch!?</B> Fehlen tut bei jedem Amiga Web Browser bisher eine
Unterst&uuml;zung von JavaScript, Java und einigen spez. Tags. Aber auch hier ist
Abhilfe in Arbeit. F&uuml;r <B>Voyager</B> ist ein JavaScript-PlugIn in Arbeit und
<B>IBrowse</B> soll in der Version 2 einiges Neues bieten. Und vielleicht
gibt`s demn&auml;chst auch mal eine Version vom <B>Final Web Cruiser</B> zum Testen.
Insgesamt hat sich die Lage der Amiga-Browser in letzter Zeit sehr verbessert,
aber man merkt immer noch an einiges Stellen das Hinterherhinken der Browser.
Aber an den Amiga-Browsern sitzen ja auch nicht gro&szlig;e Entwicklungsteams, wie
an z.B. <A HREF="http://www.NetScape.com">NetScape</A>.

<P><CENTER><B><A NAME="Preise">Preise</A></B></CENTER><BR>
<TABLE BORDER=0>
<TR><TD>AWeb</TD><TD>$45</TD></TR>
<TR><TD>IBrowse</TD><TD>DM 99 (von <A HREF="http://www.maxon.de">Maxon</A>)</TD></TR>
<TR><TD>Voyager</TD><TD>DM 40.00 (per EMail)</TD></TR>
</TABLE>
<BR>
Wir werden auch in kommenden <B>AmZeiger</B>-Ausgaben &uuml;ber Neuigkeiten berichten..
Bis dahin w&uuml;nsche ich ein fr&ouml;hliches Surfen im Netz... :)
<P><HR>
<TABLE WIDTH=100%>
<TR><TD ALIGN=LEFT><A HREF="../SW/Voy0697.htm"><FONT SIZE=2>Prev</FONT></A></TD>
<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../AmZ0697/main.htm">Inhaltsverzeichnis</A></FONT></TD><TD ALIGN=RIGHT><A HREF="../SW/FS0697.htm"><FONT SIZE=2>Next</FONT></A></TD></TR>
<TR><TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@BBrandes.berlinet.de">Der AmZeiger</A></FONT></TD></TR></TABLE>
</BODY></HTML>
