<HTML><HEAD>
<TITLE>AmZeiger 06/97 - Voyager V2.88</TITLE>
<META NAME="keywords"    CONTENT="Amiga,WWW,IBrowse,Browser,Magazin,Computer">
<META NAME="author"      CONTENT="Andreas Schlick">
</HEAD>
<BODY BACKGROUND="../images/BG.gif"><CENTER>
<H1><U><A HREF="http://www.vapor.com">Voyager V2.88</A></U></H1><BR>von<BR><A HREF="mailto:A.Schlick@BBrandes.berlinet.de">Andreas Schlick</A><P></CENTER>

Oliver Wagner benutzt, wie bei allen seinen neueren Projekten <A HREF="http://www.sasg.com">MUI</A>. Jedoch kann die
Oberfl&auml;che nicht so frei gestaltet werden, wie bei <A HREF="../SW/IB0697.htm">IBrowse</A>. Die Navigationsbuttons
k&ouml;nnen nicht einmal ausgeschaltet werden. Die Auswahl beschr&auml;nkt
sich auf Icons&Text, Icons only und Text only. Die Aufteilung des Fensters
ist standardm&auml;ssig und bietet nichts Neues.<P>

<B>Images:</B><BR>
<B>Voyager</B> benutzt seine internen Routinen zum Image-Decoding. Zur Farbreduzierung
stehen zwei Qualit&auml;tsstufen zur Verf&uuml;gung, plus ein abschaltbares Dithering.
Als Ditheringverfahren stehen Floyd-Steinberg und Ordered zur Auswahl,
w&auml;hrend IBrowse nur Floyd-Steinberg und AWeb-II Demo kein Dithering
unterst&uuml;tzt. Die Decodierungsroutinen lieferten auf meiner Retina wesentlich
bessere Ergebnisse als die von IBrowse (damals noch V1.02). Momentan
scheinen beide Routinen auf meiner <A HREF="../HW/Picasso4.htm">PicassoIV</A> gleich
gute Ergebnisse zu liefern, wobei ich mir jedoch nie sicher bin, ob nicht die
Picasso96-SW noch etwas dazwischenpfuscht.
Im Gegensatz zu fr&uuml;heren Versionen sind Voyagers Routinen erheblich weniger bugbehaftet und
st&uuml;rzen nicht mehr so h&auml;ufig ab (i.A. konnten jedoch noch wichtige Daten gesichert werden).
<P>
<B>F&auml;higkeiten:</B><BR>
Es wird ein gro&szlig;er Teil der Html3.2-Konvention unterst&uuml;tzt, teilweise ist
es jedoch nur `halbherzig' programmiert worden. Zum Beispielen stellt Voyager
Tabellen in Tabellen nicht immer korrekt dar, was auch f&uuml;r Bilder in Tabellen
zutrifft.<P>
Als einziger Amiga Web Browser besitzt <B>Voyager</B> ein Interface f&uuml;r PlugIns. Bisher
gibt es allerdings nur das Search-Plugin, das einen Suchbegriff zu vier
verschiedenen Search-Engines schickt, so da&szlig; der Gebrauch von sogenannten
Meta-Search-Engines entfallen kann.<BR>
Etwas st&ouml;rend ist, da&szlig; Voyager nur eine Gruppe aus der Hotlist im Men&uuml; darstellen
kann, so da&szlig; erstmal eine Obergruppe erstellt werden mu&szlig;, wenn man mehrere
Untermen&uuml;s darstellen will. St&ouml;rend ist dies besonders, wenn man die Hotlist
von anderen Browsern konvertiert.<BR>
Besonders gelungen ist auch der neue Cachebrowser. Der Cachebrowser listet die gecachten
Web-Seiten alle sortiert nach entweder Typ (z.B. gif, jpeg, html..), Alter oder URL.
Angezeigt wird dabei die URL, Typ, Gr&ouml;&szlig;e, Alter und der Dateiname des Files im Cache-Dir.
Die angew&auml;hlten Seiten k&ouml;nnen dann verschoben, kopiert oder gel&ouml;scht werden. Desweiteren k&ouml;nnen
auch bestimmte Seiten versteckt werden, damit auch lange Listen &uuml;bersichtlicher werden.
Eine Selection per Pattern ist auch m&ouml;glich. Negativ ist mir dabei aufgefallen, da&szlig;
der Button "View" mir die Files einfach auf die Festplatte kopierte.
<P>
<B>ein paar Features als &Uuml;bersicht:</B><BR>
<UL>
<LI>SSL-Unterst&uuml;tzung</LI>
<LI>Frames-Unterst&uuml;tzung (inkl. kleinem Bug)</LI>
<LI>Cookie-Unterst&uuml;tzung</LI>
<LI>NetStat-Window</LI>
<LI>PNG support</LI>
<LI>u.v.m.</LI>
</UL>
<P>
<B>Stabilit&auml;t:</B><BR>
Meiner Meinung nach ist die Stabilit&auml;t (besonders der alten Version) sehr systemabh&auml;ngig.
W&auml;hrend ich h&auml;ufiger Abst&uuml;rze des Imagedecoding Tasks und beim FTP hatte,
l&auml;uft es bei einem Freund sehr stabil.
<P>
<B>Bugs:</B><BR>

<UL>
<LI>Wenn einzelne Frame-Inhalte ge&auml;ndert werden, ohne da&szlig; sich die Location an sich
&auml;ndert, springt Voyager beim Ver&auml;ndern der Gr&ouml;&szlig;e des Fensters zur
Locationseite zur&uuml;ck. Obwohl ich den Bug schon bei einer der fr&uuml;hesten
Beta-Versionen gemeldet hatte, wurde er bis zur V2.88 leider nicht behoben. :(
<LI>Der Cachebrowser kopiert beim Klick auf &quot;View&quot; die Files einfach nur auf die Festplatte.
</UL>
<P>
<B>allg. Beurteilung:</B><BR>
<B>Voyager</B> ist zwar noch nicht v&ouml;llig ausgereift, jedoch besonders in der
letzten Version hat sich einiges getan, gerade was die Stabilit&auml;t betrifft. Wer nicht
gleich das Geld f&uuml;r IBrowse ausgeben will, der ist mit <B>Voyager</B> gut beraten,
da er nicht soviel kostet. F&uuml;r den durchschnittlichen Anwender reicht Voyager aus. Er hat
zwar noch ein paar Macken, die aber hoffentlich bald behoben werden. IBrowse bietet
jedoch immer noch eine gr&ouml;&szlig;ere Kompatiblit&auml;t.<P>
<P>
<B>weitere Entwicklng:</B><BR>
F&uuml;r <B>Voyager</B> ist ein PlugIn f&uuml;r JavaScript in Arbeit. Weitere Informationen dazu
lagen bei Redaktionschlu&szlig; leider nicht vor.<P>

<TABLE ALIGN=CENTER BORDER=1>
<TR><TD><B>Produkt:</B></TD><TD>Voyager</TD><TD><B>Hersteller:</B></TD><TD>Oliver Wagner</TD></TR>
<TR><TD><B>Art:</B></TD><TD>WWW-Browser</TD><TD><B>Version:</B></TD><TD>2.88</TD></TR>
<TR><TD><B>Preis:</B></TD><TD>40DM (per EMail) / 45DM (per Post)</TD><TD><B>Bez.Quelle:</B></TD><TD><A HREF="http://www.vapor.com">Vapor</A></TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2-</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2+</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD COLSPAN=2 ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD COLSPAN=2 ALIGN=CENTER>1-</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE>

<P><HR>
<TABLE WIDTH=100%>
<TR><TD ALIGN=LEFT><A HREF="../SW/IB0697.htm"><FONT SIZE=2>Prev</FONT></A></TD>
<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../AmZ0697/main.htm">Inhaltsverzeichnis</A></FONT></TD><TD ALIGN=RIGHT><A HREF="../SW/AWB0697.htm"><FONT SIZE=2>Next</FONT></A></TD></TR>
<TR><TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@BBrandes.berlinet.de">Der AmZeiger</FONT></A></TD></TR></TABLE>
</BODY></HTML>
