<HTML><HEAD><TITLE>AmZeiger 06/97 - XTreme Racing 1.01</TITLE></HEAD>
<BODY BACKGROUND="../images/BG.gif"><CENTER>
<H1><U>XtremeRacing 1.01</U></H1><BR>von<BR><A HREF="mailto:G.Franz@BBrandes.berlinet.de">Gregor Franz</A><P></CENTER>

<B>Auf</B> der neuesten AMINET-CD, der Ausgabe 18, befindet sich eine Vollversion des
Rennspiels XTremeRacing von Silltunna Software. Es handelt sich um die Version
1.01, ein Bugfix, welcher u.a. ein 030er Turbokarte mehr unterst&uuml;tzt, als die
1.0er-Version.<P>

Aber nun zum Spiel, welches problemlos von CD gespielt werden kann, aber zum
Abspeichern der Optionen und Rekorde auf Festplatte kopiert werden sollte (ca.
2,2 MByte). Einfaches kopieren gen&uuml;gt. Keine zu installierenden Fonts,
Libraries oder Assigns - ganz so, wie man es mag. Und es l&auml;uft auch noch
einfach so auf Anhieb von der WB aus, selbst, wenn man eine Grafikkarte
besitzt.<P>

Unterst&uuml;tzt wird diese allerdings nicht speziell, daf&uuml;r begn&uuml;gt sich XTR schon
mit den Standard-Grafikchips (OCS). Mit nur 2 MBytes Chipram l&auml;uft es auch,
allerdings mit eingeschr&auml;nkter Musik. Mindestvorraussetzung ist (auch von der
Geschwindigkeit her) ein 68020-Prozessor, meine Mindest- empfehlung ist
allerdings ein 25 MHz-68030 oder besser noch ein 50MHz-030. Mit 040`ern und
060`ern sollte es keine Probleme geben.<P>

Ein hammerharter Soundtrack und knallbuntes Design begr&uuml;ssen den
frischgebackenen XTR-Spieler. Im Hauptmen&uuml; kann man zwischen den `Main
Options`, den `Set-Up Options`, den `Link-Up Options`, dem `Save Setup` und
`Quit` w&auml;hlen, welches einen tats&auml;chlich wieder auf die Workbench
zur&uuml;ckbef&ouml;rdert.<P>

Bei den <B>`Set-Up Options`</B> kann man die Runden pro Strecke, Soundeffekte und
Musik ein-und ausschalten, Waffen aktivieren und den menschlichen Autos die
selben Eigenschaften verschaffen (was bei mehreren Spielern sicherlich fairer
ist).<P>

Mit den <B>`Link-Up Options`</B> kann man zwei Rechner per Nullmodem-Kabel verbinden
und sich so mehrere Spieler sehr komfortabel miteinander messen.<P>

Doch nun zu den <B>`Main Options`</B>, wo zuerst einmal zwischen 1 bis 4-Spieler-
Modus gew&auml;hlt werden kann. Danach kann man sich entweder f&uuml;r `Cup Race`,
`Season Race` oder `Single Race` entscheiden, ab 2 Spielern kommt noch der
`Death Match`-Modus hinzu.<P>

Beim <B>`Cup Race`</B> kann man einen von drei Cup`s fahren, bei denen man in jeder
Runde unter den ersten drei Fahrern sein mu&szlig;, um sich f&uuml;r die n&auml;chste Strecke
zu qualifizieren.<P>

Beim <B>`Season Race`</B> kann man einen Grandprix fahren, bei dem man, egal mit
welcher Platzierung, alle Runden fahren kann und je nach Position jeweils
Punkte bekommt, die nach der letzen Strecke zusammengez&auml;hlt werden. Ziel ist es
unter die ersten drei zu kommen bzw. nat&uuml;rlich Erster zu werden.<P>

Eine Besonderheit bei diesem Modus ist es, da&szlig; man mit einem vergleichsweise
schwachem Fahrzeug startet und ab und zu auf der Strecke verteilte (und
versteckte) Gold-und Silberm&uuml;nzen sammeln mu&szlig;, damit man vor Antritt der
n&auml;chsten Runde `aufr&uuml;sten` kann. Es stehen bessere Bremsen, Motoren und Reifen
f&uuml;r das n&ouml;tige Kleingeld bereit, sogar Zusatzpunkte sind k&auml;uflich erwerbbar.
<P>
Wenn man zu wenig sammelt, kann man sp&auml;ter nicht mehr mit den anderen Autos
mithalten. Wenn man zuviel sammelt, kann man sich nicht gut platzieren. Je
besser die Position pro Strecke ist, umso mehr Geld bekommt man auch als
Siegpr&auml;mie.<P>

Im <B>`Single Race`</B> kann man jede Strecke einzeln antesten und &uuml;ben. Genau, wie
beim `Cup Race` ist vor dem Rennen die Motorst&auml;rke w&auml;hlbar, n&auml;mlich: `Three
Wheeler`, `2.0 Fuel Injection` oder `Turbo Nutter`.<P>

In allen Modi kann man zwischen acht sehr unterschiedlichen Fahrzeugen, wie
z.B. Polizeiauto, Ferrari oder K&auml;fer, seinen Favoriten w&auml;hlen. Den Autos sind
automatisch spezielle Fahrer zugeordnet, so da&szlig; man sich auch bei
Ergebnistabellen immer &uuml;ber seine Identit&auml;t im Klaren ist.<P>

Okay, das waren die unterschiedlichen Spielmodi, doch nun <B>zum Spiel</B> selbst. Die
Sicht des Autos entspricht der `Lotus-Perspektive`, also von hinten. Die Grafik
wird von einer sehr flexiblen Grafik-Engine gemanagt, die im
Chunky-Pixel-Verfahren eine 3-Dimensionale Landschaft erzeugt, wie schon die
seligen DUMM-Klones. Bei mehr als einem Spieler wird der Bildschirm horizontal
geteilt, wenn es sein mu&szlig; in bis zu vier Teile.<P>

Nach dem Druck auf ESCAPE &ouml;ffnet sich ein weiteres Men&uuml;, in dem man u.a.
Frame-Rate, Kamerasicht, Bildschirmgr&ouml;&szlig;e und Pixelh&ouml;he-und Weite beeinflu&szlig;en
kann. Ein gesplitteter Bildschirmteil kann auch einer zus&auml;tzlichen `Kamera`
vorbehalten werden, deren Verhalten und Sicht man ebenfalls konfigurieren
kann.<P>

Zum Vergleich: auf einem Amiga mit 68030/25 MHz mu&szlig; der Bildschirm f&uuml;r eine
1x1-Pixelaufl&ouml;sung und guter Spielgeschwindigkeit etwas verkleinert werden.
Zwei Spieler k&ouml;nnen im 2x1-Modus spielen, drei m&uuml;ssen sich mit dem 2x2-Modus
begn&uuml;gen. Bei einem 68030/50 MHz k&ouml;nnen zwei Spieler sogar im 1x1-Modus spielen
und drei im 2x1-Modus.<P>

Kleiner <B>Tip</B> am Rande: Im Falle eines Falles sieht 2x1 besser aus, als 1x2.<P>

Aber alles eben genannte und noch soviele Optionen nutzen &uuml;berhaupt nichts,
wenn das Spiel keinen Spa&szlig; macht. Ich kann vorweg schon sagen: <B>XTR macht Spa&szlig;!</B>
<P>
Viele Unterschiedliche Strecken in sechs verschiedenen Umgebungen bzw.
Grafikstilen bieten eine Menge Abwechslung, die Computergegener sind sehr
knackig und tausend unvorhersehbare Situationen und viele nette Gimicks bringen
echte Spielfreude - ganz besonders mit zwei oder drei menschlichen Mitstreitern
bzw. Gegnern, wof&uuml;r ich insbesondere den `Season Race` empfehlen kann.<P>

An unterschiedlichen Streckenarten stehen <B>`Floating City`</B> zur Verf&uuml;gung, mit
einem Science Fiction-Design (bis auf am Rand sitzende H&auml;hne, die man auch
umnieten kann).<P>

Dann gibt es noch <B>`Forbidden Castle`</B> im Burg-Outfit, in dem besonders pl&ouml;tzlich
an Ketten herunterst&uuml;rzende Steinbl&ouml;cke fies sein k&ouml;nnen.<P>

In <B>`Grasslands`</B> gibt es sch&ouml;ne Strecken durch die freie Natur, <B>`Road Circuits`</B>
l&auml;&szlig;t etwas mehr Formel 1-Atmosph&auml;re aufkommen, in <B>`Toxic Refinery`</B> f&auml;hrt man
durch giftig erscheinende Industriegebiete und <B>`Tropical Islands`</B> gibt
S&uuml;dsee-Feeling, obwohl man hier das Badengehen vermeiden sollte.<P>

&Uuml;berall gibt es spezielle Zusatzobjekte, wie explosive Tonnen, oder bremsend
wirkende Zuschauer und nat&uuml;rlich versteckte Abk&uuml;rzungen, Turbo-und
Sprungstreifen usw. usf.<P>

In der N&auml;he der Ziellinie kommen auch noch gelb (wenn aktiv) leuchtende
Fragezeichen hinzu, die der Waffen-Option bei dem `Set-Up Options`-Men&uuml; eine
tiefere Bedeutung verleihen. Wenn man &uuml;ber sie hinwegf&auml;hrt, erh&auml;lt man nach dem
Lotterieprinzip eine von mehreren Waffen, mit denen man seine Gegner behindern
oder au&szlig;er Gefecht setzen kann.<P>

Bananenschalen z&auml;hlen ebenso dazu, wie unterschiedliche Granaten, Minen,
Raketen, Turbos und sogar ein <B>Schaf</B> (a la `Worms`), welches dann ebenfalls &uuml;ber
die Strecke saust und irgendjemanden explodieren l&auml;&szlig;t.<P>

Darauf basiert auch der oben erw&auml;hnte <B>`Death Match`</B>-Modus, der auf
unterschiedlichen `Arenen` die Bek&auml;mpfung eines anderen menschlichen
Mitspielers zum Ziel hat. Zahlreiche Fragezeichen bieten dazu M&ouml;glichkeiten zur
Gen&uuml;ge. Eigentlich ist das schon ein eigenes Spiel im Spiel.<P>

Da kommt wirklich keine Langeweile auf, aber vielleicht bei manchen einsamen
Spielern doch Frust? Denn <B>XTR ist schwer</B>. Die Computergegner sind unglaublich
stark, wirken am Anfang nahezu unbesiegbar und erst mit einiger Erfahrung kann
man, immer noch mit Gl&uuml;ck, erfolgreich gegen sie antreten.<P>

Ich kann au&szlig;er &uuml;ben nur empfehlen, mehrere Freunde einzuladen, mit denen man
sich beim `Season Cup` ja immerhin einen spannenden Kampf um die letzten Pl&auml;tze
liefern kann.<P>

Die von vielen Spielern bem&auml;ngelte (zu) hohe Spielst&auml;rke der Computer- gegner
hatte nach dem originalen Herauskommen des Spieles sp&auml;ter ein Update der
Programmierer von Silltunna Software zur Folge, das au&szlig;erdem neue
Streckenstile, Strecken, Cups, einen Editor und vieles mehr beinhaltete. Ob man
von der CD-Version updaten kann, wage ich aber zu bezweifeln.<P>

<B>Die Grafik</B> ist im 1x1-Modus sehr gut: detailliert, bunt, h&uuml;bsch und
abwechsungsreich. <B>Die Soundeffekte</B> sind auch sehr gut, die Musik ist
gew&ouml;hnungsbed&uuml;rftig und eher nervig beim Fahren, obwohl mehrere
unterschiedliche Module bzw. Stilrichtungen  gew&auml;hlt werden k&ouml;nnen.
<P>
<B>Alles in allem</B> also ein sehr gutes und interessantes St&uuml;cken Vollwert-Soft auf
der AMINET, das allen Freunden dieses Genres viel zu bieten hat. Etwas Bonus-PD
ist im Preis sozusagen inbegriffen. ;)
<P>
<TABLE BORDER=1 ALIGN=CENTER>
<TR><TD><B>Spiel:</B></TD><TD>XTreme Racing (AmiNet 18)</TD><TD><B>Hersteller:</B></TD><TD>Silltunna SW</TD></TR>
<TR><TD><B>Genre:</B></TD><TD>Autorennen</TD><TD><B>Version:</B></TD><TD>1.01</TD></TR>
<TR><TD><B>Preis:</B></TD><TD>25 DM zzgl. Versandk.</TD><TD><B>Bez.Quelle:</B></TD><TD><A HREF="http://www.schatztruhe.de">Schatztruhe GmbH</A> (AmiNet18)</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Festplattenspielbar?</B></TD><TD COLSPAN=2 ALIGN=CENTER>JA</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Exit zur Workbench?</B></TD><TD COLSPAN=2 ALIGN=CENTER>JA</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Grafik</B></TD><TD COLSPAN=2 ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>SoundFX</B></TD><TD COLSPAN=2 ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Musik</B></TD><TD COLSPAN=2 ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Spielbarkeit</B></TD><TD COLSPAN=2 ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Spielspa&szlig;</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung</B></TD><TD COLSPAN=2 ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt</B></TD><TD COLSPAN=2 ALIGN=CENTER>1.5</TD></TR>
<TR><TD COLSPAN=4</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTERA><B>Vertrieb:</B></TD><TD COLSPAN=2 ALIGN=CENTER>Stefan Ossowskis Schatztruhe GmbH, Veronikastr. 33, 45131 Essen</TD></TR>
</TABLE><BR>

<P><HR>
<TABLE WIDTH=100%>
<TR><TD ALIGN=LEFT><A HREF="../SW/FS0697.htm"><FONT SIZE=2>Prev</FONT></A></TD>
<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../AmZ0697/main.htm">Inhaltsverzeichnis</A></FONT></TD><TD ALIGN=RIGHT><A HREF="../HW/Picasso4.htm"><FONT SIZE=2>Next</FONT></A></TD></TR>
<TR><TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@BBrandes.berlinet.de">AmZeiger</A></FONT></TD></TR></TABLE>
</BODY></HTML>
