<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML VERSION="3.2">
<HEAD>
  <META HTTP-EQUIV="Content-Type" CONTENT="text/html;CHARSET=iso-8859-1">
  <META HTTP-EQUIV="Expires"      CONTENT="604800">
  <META NAME="Keywords"           CONTENT="HousePool, House, Techno, Rave, Trance, Gabber, CD, Vinyl, Platten, Szene, Magazin, Berichte, News, Booking, DJ, Live, Act, Deutsch, Medien, Media, Pool">
  <META NAME="Description"        CONTENT="HousePool, Das interaktive House-/Techno-Magazin im Internet mit vielen Artikeln, Berichten, allen relevanten Playlists, umfangreichen Plattentips, Szene-News und Trends.">
  <META NAME="Author"             CONTENT="Carsten Marmulla, HousePool Media International">
  <META NAME="Date"               CONTENT="1998-08-10">
  <META NAME="Reply-To"           CONTENT="housepool@turntable.de (HousePool Magazine)">
  <META NAME="Robots"             CONTENT="index">
  <META NAME="Robots"             CONTENT="follow">
<TITLE>HousePool - Magazin (deutsch) - Grundlagen: 96 kHz Abtastfrequenz</TITLE>
</HEAD>
<BODY BACKGROUND="" BGCOLOR="#FFFFFF" TEXT="#000000" ALINK="#990033" LINK="#0000FF" VLINK="#330099">
<BR>
<TABLE ALIGN="LEFT" BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
<TR ALIGN="LEFT">
  <TD ALIGN="LEFT" WIDTH="20">&nbsp;</TD>
  <TD ALIGN="CENTER">
    <CENTER>
    <!-- Werbebanner einblenden -->
    <A HREF="kunde/index-mag.html" TARGET="_blank">
    <IMG ALT="Besuchen Sie unseren Sponsor!" ALIGN="CENTER" BORDER="0" HEIGHT="" WIDTH="" SRC="kunde/banner-mag.pic"></A>
    <BR>
    <FONT ALIGN="CENTER" SIZE="2">
    <NOBR><A HREF="http://www.turntable.de/housepool/deutsch/info/anzeigen.html"><B>Anzeigen:</B></A>&nbsp;<A HREF="kunde/index-mag.html" TARGET="_blank">Klicken um Anzeigenkunden zu besuchen</A></NOBR>
    </FONT><BR>
    <BR>
    <!-- HousePool Titel -->
    <B><FONT SIZE="7">H</FONT><FONT SIZE="5">OUSE</FONT><FONT SIZE="7">P</FONT><FONT SIZE="5">OOL</FONT></B>&nbsp;&nbsp;<FONT SIZE="4"><I>Magazine</I></FONT><BR>
    <!-- Beginn -->
    <FONT ALIGN="CENTER" COLOR="#000000" SIZE="3">Ausgabe 20 (August/September 1998)</FONT><BR>
    <BR>
    <BR>
    <FONT ALIGN="CENTER" COLOR="#0000FF" SIZE="7">Grundlagen: 96 kHz Abtastfrequenz</FONT><BR>
    <BR>
    <HR WIDTH="25%">
    <FONT ALIGN="CENTER" COLOR="#000000" SIZE="2"><B>Von Dipl.-Ing. Thomas Sandmann</B></FONT>
    <HR WIDTH="25%">
    <BR>
    <TABLE ALIGN="CENTER" BORDER="0">
      <TR>
	<TD ALIGN="LEFT">
	<P ALIGN="JUSTIFY">
	<FONT SIZE="5"><B>Qualit&auml;tssteigerung bei Digitalaufnahmen</B></FONT><BR>
	<BR>
Seit Einzug der Digitaltechnik in unsere Studios haben sich zwei
Abtastfrequenzen etabliert: 44,1 kHz (Audio-CD, Profi-DAT) und 48 kHz
(Consumer-DAT, aber auch interne Frequenz vieler Digital-Effektger&auml;te).
Nun soll mit 96 kHz alles noch besser werden. H&ouml;rt man das
&uuml;berhaupt ?<BR>
<BR>
<B>Grundlagen:</B><BR>
Bei der Digitalisierung wird ein analoges Signal in bestimmten
Zeitabst&auml;nden abgetastet. Zu jedem dieser Zeitpunkte wird der Pegel des
Signales gemessen und als Zahlenwert dargestellt. Je h&auml;ufiger diese
Abtastung erfolgt, desto schneller k&ouml;nnen &Auml;nderungen der Amplitude
registriert werden - was nichts anderes bedeutet, als da&szlig; h&ouml;here
Frequenzen dargestellt werden k&ouml;nnen. Die h&ouml;chste darstellbare
Audio-Frequenz ergibt sich nach dem <I>Shannon'schen Abtasttheorem</I> als
die H&auml;lfte der Abtastfrequenz. Bei 44,1 kHz k&ouml;nnte das Audiosignal
theoretisch bis 22,05 kHz reichen. Sofern h&ouml;here Frequenzen als die
halbe Sampling-Frequenz (auch <I>Nyquist-Frequenz</I> genannt) im
Audiosignal vorkommen, entstehen unangenehme, nichtlineare Verzerrungen, die
als <I>Aliasing</I> (von &quot;alias&quot;, lat., der andere) bezeichnet
werden. Daher ist sicherzustellen, da&szlig; vor der A/D-Wandlung
tats&auml;chlich keine solchen Frequenzen mehr im Spektrum vorhanden sind.
Zu jedem A/D-Wandler geh&ouml;rt daher ein <I>Anti-Aliasing-Filter</I>, das
aufgrund seiner endlichen Flankensteilheit aber schon weit vor dem Wert von
22,05 kHz mit der Absenkung beginnt. Bei der Konstruktion solcher Filter ist
daher ein Kompromi&szlig; zu schlie&szlig;en: Entweder legt man das Filter
sehr steilflankig aus, so da&szlig; die Absenkung erst oberhalb von 20 kHz
beginnt, oder aber man w&auml;hlt eine flachere Flanke und beginnt schon
deutlich unterhalb von 20 kHz mit der Absenkung. Im ersten Fall wird das
Filter durch eine hohe Welligkeit im h&ouml;rbaren Bereich eine
Verf&auml;lschung erzeugen, im zweiten Fall ergibt sich die Verf&auml;lschung
durch die Filterflanke selbst.<BR>
<BR>
<B>96 kHz gegen Nyquist:</B><BR>
Bei einer Erh&ouml;hung der Samplingfrequenz auf 96 kHz steigt die
Nyquist-Frequenz auf satte 48 kHz. Dadurch kann die Eckfrequenz des Filters
beispielsweise auf 24 kHz eingestellt werden, wodurch einerseits der
Audio-Frequenzgang erweitert wird und andererseits eine volle Oktave
f&uuml;r die Filterflanke zur Verf&uuml;gung steht. Hier wird die
Problematik der etwas &quot;engen&quot; Auslegung der bisheringen
Samplingfrequenzen also deutlich entsch&auml;rft. Andererseits mu&szlig; man
zugeben, da&szlig; heutige Digitalfilter so hervorragend klingen, da&szlig;
der erweiterte Frequenzbereich nicht der wichtigste Grund f&uuml;r eine
Umstellung des Formates ist.<BR>
<BR>
<B>96 kHz und Equalizer:</B><BR>
Digitale Equalizer arbeiten mit Algorithmen, die zur Berechnung eines
einzelnen Sample-Wertes auch die benachbarten mit einbeziehen. In einem
96-kHz-Signal stehen in einem gleich breiten Zeitfenster aber viel mehr
benachbarte Werte zur Verf&uuml;gung, wodurch der Algorithmus pr&auml;ziser
wird. Dar&uuml;ber hinaus ergibt sich durch die Bandbegrenzung zur
Nyquist-Frequenz eine Asymmetrie der Glockenkurven parametrischer Equalizer,
die besonders in den hohen B&auml;ndern st&ouml;rend wirkt. Aus diesem Grund
arbeiten schon heute einige Ger&auml;te intern mit einer h&ouml;heren
Samplingfrequenz, auch wenn das Signal am Digitalausgang nur mit 44,1 oder
48 kHz ausgegeben wird.<BR>
<BR>
<B>96 kHz und der Haas-Effekt:</B><BR>
Beim Richtungsempfinden einer Stereo-Aufnahme unterscheiden wir zwischen der
Intensit&auml;ts-Stereofonie und der Laufzeit-Stereofonie. Erstere beruht
auf unterschiedlichen Pegeln eines Signals in beiden Kan&auml;len und wird
im Studio mit den Panorama-Reglern des Mischpults erzeugt. Bei
nat&uuml;rlichen Stereoaufnahmen, insbesondere bei Nutzung der klassischen
Zwei-Mikrofon-Technik, ergibt sich das Richtungsempfinden jedoch aus den
Laufzeitunterschieden. Nach dem Gesetz der ersten Wellenfront, auch
<I>Hass-Effekt</I> genannt, orten wir ein Signal aus der Richtung, aus der
der Schall zuerst unser Geh&ouml;r erreicht - und zwar auch dann, wenn die
Lautst&auml;rke an beiden Ohren gleich ist.<BR>
Nur wenig aus der Stereomitte verschobene Signale erzeugen
Laufzeitunterschiede von nur wenigen Mirosekunden. Der Abstand zweier
Samples eines 44,1-kHz-Signales betr&auml;gt jedoch eine 44.100stel Sekunde,
also ca. 23 Mikrosekunden ! Hierdurch ist das Ph&auml;nomen begr&uuml;ndet,
da&szlig; manche Analogaufnahmen einfach &quot;luftiger&quot; klingen als
das digitale Pendant. Eine Erh&ouml;hung auf 96 kHz bringt hier folglich
eine Steigerung, wobei zur kompromi&szlig;losen Ann&auml;herung an die
menschliche Wahrnehmungsgrenze auch eine Verdopplung auf 192 kHz noch nicht
zu viel w&auml;re...<BR>
<BR>
<B>Fazit:</B><BR>
Aus Sicht der Aliasing-Problematik sind wir mit den heute &uuml;blichen
Abtastfrequenzen bereits gut bedient. Die Erh&ouml;hung auf 96 kHz bringt
allenfalls leichte Verbesserungen, profitiert allerdings gleichzeitig auch
von besseren Equalizern und anderen Effekten zur Nachbearbeitung.
Stereoaufnahmen nach dem Laufzeitprinzip verbessern sich allerdings
drastisch, so da&szlig; die audiophile HiFi-Gemeinde sich schonmal auf den
neuen Standard freuen sollte. Besonders Klassik-Aufnahmen in
Zwei-Mikrofon-Technik versprechen eine bessere, r&auml;mliche Abbildung. Wer
hingegen sein Panaorama ausschlie&szlig;lich am Mischpult erzeugt und statt
subtiler Equalizer eher brachiale Klangverbiegungen mag, kann auch ohne das
neue Format leben.<BR>
<BR>
	</P>
	<BR>
	<P ALIGN="CEMTER">
	<CENTER>
	Autor: <B>Dipl.-Ing. Thomas Sandmann</B><BR>
	<A HREF="http://www.ths-nation.de/"><IMG SRC="http://www.ths-nation.de/eyecatcher.gif" BORDER="0" ALT="ths Nation"></A><BR>
	</CENTER>
	</P>
	<BR>
	<P ALIGN="RIGHT">
	<B><I>(<A HREF="impress.htm">ths</A>)</I></B>
	</P>
	</TD>
      </TR>
    </TABLE>
    </CENTER>
  </TD>
  <TD ALIGN="RIGHT" WIDTH="20">&nbsp;</TD>
</TR>
<TR>
  <TD></TD>
  <TD>
<BR>
<HR WIDTH="80%">
<BR>
<CENTER>
<FONT ALIGN="CENTER" SIZE="1">
<BR>
&#183;&nbsp;<NOBR>[<A HREF="../../index.html">Home</A>]</NOBR>
&#183;&nbsp;<NOBR>[<A HREF="index.htm">Cover</A>]</NOBR>
&#183;&nbsp;<NOBR>[<A HREF="inhalt.htm">Inhalt</A>]</NOBR>
&#183;&nbsp;<NOBR>[<A HREF="editor.htm">Editorial</A>]</NOBR>
&#183;&nbsp;<NOBR>[<A HREF="insides.htm">Insides</A>]</NOBR>
&#183;&nbsp;<NOBR>[<A HREF="l-style.htm">Lifestyle</A>]</NOBR>
&#183;&nbsp;<NOBR>[<A HREF="music.htm">Music</A>]</NOBR>
&#183;&nbsp;<NOBR>[<A HREF="standard.htm">Standards</A>]</NOBR>
&#183;&nbsp;<NOBR>[<A HREF="mailto:housepool@turntable.de">Email</A>]</NOBR>
&#183;
</FONT>
<BR>
<HR WIDTH="80%">
<BR>
</BODY>
<ADDRESS>
&copy; <A HREF="rechte.html">Copyright</A> 1995,1996,1997,1998 HousePool&reg; Media International<BR>
Carsten Marmulla &amp; Carsten Wiehle GbR<BR>
<BR>
<A HREF="rechte.html">Alle Rechte</A> sind vorbehalten und gesch?tzt.<BR>
Mi&szlig;achtungen f&uuml;hren zu zivil- und strafrechtlicher Verfolgung.<BR>
</ADDRESS>
  </TD>
  <TD></TD>
</TR>
</TABLE>
</CENTER>
</HTML>
