<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Erstes BoingBag-Update zum AmigaOS 3.9 erschienen</H2>
<P>
Amiga Inc. und Haage&amp;Partner gaben p&uuml;nktlich zur Messe in St. Louis die
Verf&uuml;gbarkeit von Boing Bag 1 f&uuml;r AmigaOS 3.9 bekannt. Das Update l&auml;sst
sich unter <A HREF="http://www.amiga.com/3.9/download/BoingBag39-1.lha" TARGET="_top">http://www.amiga.com/3.9/download/BoingBag39-1.lha</A> herunter
laden. Hier die neuen Features und Bugfixes:
</P>
<P><B>&raquo;Boing Bag 1 f&uuml;r AmigaOS3.9</B></P>
<HR>
<P><B>Inhalt des Updates</B></P>
<P><B>Internet-Software</B></P>
<P>
GenesisPrefs hat nun eine ReAction-Oberfl&auml;che! Die AWeb-SE-Dokumentation
wurde um Informationen &uuml;ber Plugins erg&auml;nzt.
</P>
<P><B>Festplatten-Nutzung</B></P>
<P>
HDToolBox vermeidet nun bei der Ger&auml;teauswahl das Auflisten einiger
weiterer Treiber, die keine Festplattentreiber sind. Es enth&auml;lt au&szlig;erdem
einige Bug-Fixes. Auch in IoTools wurden einige Fehler behoben, die
Kompatibilit&auml;t wurde erh&ouml;ht.
</P>
<P><B>Multimedia</B></P>
<P>
AMPlifier hat neue und verbesserte ARexx-Befehle.
</P>
<P><B>Verbesserte Shell und neue und erweiterte Shell-Befehle</B></P>
<P>
ViNCEd erlaubt nun mit einem Doppelklick ein einzelnes Wort auszuw&auml;hlen.
F&uuml;r Experten: Es unterst&uuml;tzt das Protokollieren durch eine CSI-Sequenz. Es
enth&auml;lt zudem einige Bugfixes.
</P>
<P>
WBRun erlaubt es, von der Shell oder einem Skript aus Programme im
Workbench-Modus zu starten. SetEnv hat eine &quot;SAVE&quot;-Option. Wenn angegeben,
wird die Umgebungsvariable nicht nur nach &quot;ENV:&quot; sondern auch nach
&quot;ENVARC:&quot; gespeichert. MakeDir hat eine &quot;ALL&quot;-Option, um komplette
Verzeichnispfade zu erzeugen. Ein Bug in LoadResource ist gefixt und
MakeLink wurde neu geschrieben.
</P>
<P><B>Workbench und Workbench-Hilfsmittel</B></P>
<P>
AsyncWB f&uuml;gt der Workbench das lang ersehnte asynchrone Kopieren und
L&ouml;schen von Dateien und Verzeichnissen hinzu. Auch das &quot;Neue Schublade&quot;-
und das &quot;Umbenennen&quot;-Fenster blockieren die Workbench nicht mehr.
</P>
<P>
UnArc erlaubt nun auszuw&auml;hlen, welche Dateien dearchiviert werden sollen.
Find unterst&uuml;tzt das Speichern der eigenen Fensterposition und -gr&ouml;&szlig;e und
funktioniert nun auch mit Verzeichnis mit einem Unterstrich in ihrem
Namen. Zudem lassen sich Suchpfade einfach per Drag&amp;Drop bzw.
Pull-Down-Men&uuml; hinzuf&uuml;gen.
</P>
<P>
Auch RAWBInfo wurde verbessert: Ein Mausklick auf ein Piktogramm-Merkmal,
w&auml;hrend die SHIFT-Taste gedr&uuml;ckt ist, aktiviert oder deaktiviert dieses
Merkmal. Wenn Sie Piktogramm-Merkmale von einem Informationsfenster in das
andere ziehen, k&ouml;nnen Sie sie mit der SHIFT-Taste hinzuf&uuml;gen anstatt sie
zu ersetzen.
</P>
<P>
BenchTrash kann nun asynchron arbeiten und die Workbench L&ouml;sch-Funktion
ersetzen. AnimatedIcon funktioniert wieder so, wie es soll.
</P>
<P><B>ReAction-Klassen</B></P>
<P>
Die ReAction-Klassen, die f&uuml;r die Darstellung von ReAction-Oberfl&auml;chen
zust&auml;ndig sind, wurden komplett &uuml;berarbeitet. Optimiertes Aussehen, viele
Bugfixes und gar einige neue Features sind das Ergebnis.
</P>
<P><B>Verschiedene Bugfixes</B></P>
<P>
Der Fontcache wird nach der Boing Bag-Installation automatisch aktiviert.
xadmaster ersetzt beim Entpacken nicht mehr l&auml;nger Leerzeichen mit
Unterstrichen. rexxmathlib.library ist nun enthalten. Und vieles weitere
mehr...
</P>
<P><B>Contribution</B></P>
<P>
Ein gro&szlig;es Dankesch&ouml;n geht an alle, die einen Beitrag zu AmigaOS 3.9
leisten. Weitere Beitr&auml;ge finden Sie auf &quot;ftp.amiga.com&quot; im Verzeichnis
&quot;OS3.9&quot;.
</P>
<P><B>John Nelson</B></P>
<UL>
<LI> RxTD: Ein ARexx-Skript zum Ersetzen von ToolsDaemon.
</LI>
</UL>
<P><B>Mikolaj Calusinski</B></P>
<UL>
<LI> ToolsDaemon 2.2 Patch: Ein Patch, der ToolsDaemon mit AmigaOS 3.9
  zusammenarbeiten l&auml;&szlig;t.
</LI>
</UL>
<P><B>Oliver Tacke</B></P>
<UL>
<LI> OS3.9 GlowIcons.
</LI>
</UL>
<P><B>Roger Hågensen</B></P>
<UL>
<LI> RunArgs: Ein weiteres ARexx-Skript zum Ersetzen von ToolsDaemon.
</LI>
</UL>
<P><B>Tim Kovack</B></P>
<UL>
<LI> IoJaz: Einige Mount-Dateien f&uuml;r Jaz-Medien
</LI>
</UL>
<P>
&copy; Amiga Inc., 34935 SE Douglas Street, Suite 210, Snoqualmie, WA 98065, USA<BR>
and HAAGE&amp;PARTNER Computer GmbH, Schlo&szlig;borner Weg 7, 61479 Glash&uuml;tten, Deutschland
</P>
<P>
Dieses Boing Bag wird ausschlie&szlig;lich von www.amiga.com zum Download
angeboten. Die Verbreitung auf irgendeinem anderen Medium bedarf der
Zustimmung von Amiga Inc. und HAAGE&amp;PARTNER GmbH.&laquo;
</P>
<P><B>(Quelle: AMIGA, Inc.)</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
