<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Erl&auml;uterung der j&uuml;ngsten Ank&uuml;ndigungen AMIGAs (von Stefan Czinczoll)</H2>
<P><B>Fr&uuml;h-Links-Erwachen unserer futuristischen Freundin</B></P>
<P>
Mit den etwas w&auml;rmeren Tagen scheint auch die gute Coder-Laune bei den
Amiga-Programmierern ausgebrochen zu sein. Den Beweis dazu tritt nicht nur
Amiga Inc. mit dem frischen BoingBag *1), dem aktuellen Update f&uuml;r OS3.9
an. Ein besonderes Schmankerl hatte sich das Team wie schon vorher angesagt
f&uuml;r die Amiga-Messe in St. Louis aufgehoben: Lt. Harv Laser soll Bill
McEwen dort ein PPC-natives Classic AmigaOS 4.0 angek&uuml;ndigt haben.
Da die Meldung allerdings am Abend des 31.3. rausging, war es sch&ouml;n, hierzu
die (offizielle Meldung) von Fleecy Moss in der Amiga-One-Mailingliste zu
lesen, da&szlig; dem tats&auml;chlich der Fall sein soll. :-)
Dabei soll der 68k-Prozessor vom PPC emuliert werden. Das Problem hierbei
ist, da&szlig; die originale Amiga-Hardware u.a. &uuml;ber Hardware-Interrupts vom
68k-Prozessor gesteuert wurde. Inwieweit sich dies emulieren l&auml;&szlig;t, wird
sich noch zeigen m&uuml;ssen.
</P>
<P>
Nicht nur der Zeitplan f&uuml;r die n&auml;chsten Versionen sieht beeindruckend aus:
Version 4.0 soll im Sommer erscheinen, 4.2 und 4.5 sollen dann in
halbj&auml;hrlichem Abstand folgen. Version 5.0 soll es Ende n&auml;chsten Jahres
geben. Mit der seit 3.5 z&uuml;gigen Update-Rate scheint die Schlafzimmer-
Politik vergangener Jahre offensichtlich vor&uuml;ber zu sein. Eine der
interessantesten Neuerungen der letzten Tage ist die Ank&uuml;ndigung von Gary
Peake, da&szlig; AmigaDE multiprozessorf&auml;hig sein soll. Dies entspricht der
Darstellung des Amiga Digital Environment aus der Amiga World #3. Mit
minimal einem Rechner ist es m&ouml;glich, das Amiverse zu entfalten. Mehrere
andere Rechner vergr&ouml;&szlig;ern es mit ihren Hardware-Ressourcen, jedoch ohne da&szlig;
sich die Natur des Amiverse dadurch ver&auml;ndert.
</P>
<P>
Bleibt zu hoffen, da&szlig; die User in Zukunft jeweils nur f&uuml;r die Vollversionen
voll bezahlen m&uuml;ssen. F&uuml;r mich pers&ouml;nlich hat es sich trotz der &quot;vielen
Shareware&quot; gelohnt; seit dem Update auf 3.9 l&auml;uft der Rechner so stabil wie
lange nicht, etliche alte Patches wurden &uuml;berfl&uuml;ssig. Eine zweite Hoffnung
bezieht sich auf die weitverbreitete PowerPC-Hardware von Phase5. Wird
diese hinreichend unterst&uuml;tzt werden? Kurz zusammengefasst stellt sich die
Situation so dar:
</P>
<P>
1. Es soll ein spezielles AmigaOS4+ f&uuml;r PPC geben. Dies beinhaltet auch die
erw&auml;hnte 680x0er-Unterst&uuml;tzung. Inwieweit dieses schon mit der
Versionsnummer 4.0 zusammenf&auml;llt, ist nach meinem Kenntnisstand unklar.
</P>
<P>
2. AmigaDE wird ebenso wie auf Windows und Linux auch auf diesem OS4+
laufen k&ouml;nnen.
</P>
<P>
3. AmigaOS4+ soll stufenweise erweitert und mit dem AmigaDE verschmolzen
werden.
</P>
<P>
Letzteres ist eigentlich die beste Nachricht. Gary Peake hat auf der
AmiOPEN-Mailingliste verlauten lassen, da&szlig; also das Classic-OS schrittweise
zu einer Art &quot;Homebase&quot; f&uuml;r AmigaDE-Entwickler ausgebaut werden soll.
Dieses Variante soll dann auch serverf&auml;hig sein, dazu f&uuml;r Mobiltelefone
genutzt werden.
</P>
<P>
Wenn man es recht bedenkt, hat unser System dann eigentlich alles, was Bill
Gates gerne h&auml;tte: Wir haben eine funkionierende Spielekonsole, demn&auml;chst
PDAs und Set-Top-Boxen von MeterNet auf Amiga-Basis, dazu das innovative
Potential von bis jetzt gemeldeten 2030 Entwicklern und ein bald ein OS,
das die .NET-Strategie um L&auml;ngen schlagen wird.
</P>
<P>
Was das OS selbst betrifft, hat sich die Vorgehensweise, altbew&auml;hrte
Shareware zu integrieren, voll bew&auml;hrt, auch wenn (hier) und in den NG
viele dar&uuml;ber geschimpft haben. Der Ansatz ist prinzipiell sinnvoll, da
sich so der Teil des OS, der nicht zum direkten Kern geh&ouml;rt, langfristig
&quot;von alleine&quot; um die Teile erweitert, die von den Usern am meisten erwartet
und als am besten erprobt erwiesen haben. Amiga und die Entwickler k&ouml;nnen
sich so auf die wichtigeren Teile konzentrieren und den Rest in Abstimmung
mit den Autoren integrieren. So liegt z.B. dem Boing-Bag die aktuelle Beta-
Version des erprobten Smart Filesystems bei. Wie w&auml;re es bei der n&auml;chsten
Version mit dem ToolManager, SnoopDos, einem Systemmonitor und Frogger oder
SoftCinema? Langfristig w&auml;ren eventuell sogar Abstimmungen/Umfragen hierzu
sinnvoll. Schlie&szlig;lich hat das AmigaOS vermittels SetFunction() schon lange
&quot;demokratische&quot; Qualit&auml;ten. :-)
Auf diese will man weiter bauen, indem Anwendungsm&ouml;glichkeiten aller Art
gesucht werden. Bisher sind etwa die H&auml;lfte der AmigaDE- Entwickler an
diesen &quot;neuen&quot; Anwendungsgebieten wie PDAs, Mobiltelefonen und SetTop-Boxen
interessiert, die andere H&auml;lfte wollen sich entweder ausschlie&szlig;lich dem
Desktop-Bereich widmen oder beide Seiten bedienen.
</P>
<P>
W&uuml;rde das Classic OS mit der n&auml;chsten Version tats&auml;chlich voll portiert
werden, w&auml;re das sicher ein gro&szlig;er Fortschritt, vor allem, wenn man sich
vorstellt, da&szlig; die alte Amiga-Hardware dann nur als eine der
unterschiedlichen Konfigurationen erschiene, unter denen das AmigaDE laufen
soll. Die User w&auml;ren nicht gezwungen, gro&szlig;e Summen in neue Rechner zu
investieren, stattdessen w&auml;re die aktuelle Userbasis (sicher der &quot;harte
Kern&quot; nach den letzten langen Durststrecke) ein dankbares Publikum, um das
neu geplante &quot;Digital Universe&quot; zuerst zu besiedeln.
</P>
<P>
Das AmigaDE scheint ebenfalls gute Fortschritte zu machen. Ab Weihnachten
sollen PDAs (Personal Digital Assistents, also Handhelds) von Sharp auf
Linux-Basis verkauft werden. Darauf w&uuml;rde dann das AmigaDE aufsetzen. In
diesem Bereich scheint es jedoch noch keine sicheren Aussagen zu geben.
Auf jeden Fall ist Amiga aber eine langfristige Partnerschaft mit Sharp
eingegangen, um deren Zaurus-Projekt mit Leben, sprich Content zu f&uuml;llen.
Damit hat sich die Palette der Projektpartner neben Tao, Sun, Corel, RedHat
und Matrox signifikant erweitert. &Uuml;ber das AmigaDE soll dann vor allem
Multimedia-Aufgaben abgewickelt werden - wof&uuml;r der Amiga ja schon immer
pr&auml;destiniert war.
</P>
<P>
Weiterhin erfreulich ist auch die Nachricht aus St. Louis, dass Dave Haynie
seine PIOS-One-Spezifikationen zur Verf&uuml;gung gestellt hat. Unabh&auml;ngig
davon, ob der neue AmigaONE auf diesen Pl&auml;nen basieren wird (was man
eigentlich nur hoffen kann), gibt es dann wohl eine realistische Chance, im
Sommer den AmigaOne (wie von Eyetech angek&uuml;ndigt) und das neue OS zusammen
zu sehen und auch kaufen zu k&ouml;nnen. Bei all diesen wirklich guten
Nachrichten sollte man bedenken, da&szlig; die Entwicklung eines anst&auml;ndigen
Systems dieser Gr&ouml;&szlig;enordnung Zeit braucht. Dieser Faktor wird sicher genau
beachtet werden. Amiga Inc. will dabei die bisher wohl guten Erfahrungen
von Haage&amp;Partner nutzen. Sollte im Sommer (also bis Ende September) mit
einem AmigaOS4.0 die lang ersehnte Nutzung der Classic-Hardware f&uuml;r PowerPC
nativ zusammen mit dem neuen Rechner kommen, w&uuml;rde diese Sensation sicher
f&uuml;r etliche frustrierte Jahre mit ungl&uuml;cklichen (fremden) Firmeneigent&uuml;mern
entsch&auml;digen.
</P>
<P><B>Amiga rulez!</B></P>
<P><B>Links:</B></P>
<P><B>*1) <A HREF="http://flyingmice.com/squid/moobunny/amiga/messages/50975.shtml" TARGET="_top">http://flyingmice.com/squid/moobunny/amiga/messages/50975.shtml</A></B></P>
<P><B>*2) <A HREF="http://www.amiga.com/press/zine/8-1-00/AmigaDE" TARGET="_top">http://www.amiga.com/press/zine/8-1-00/AmigaDE</A></B></P>
<P><B>*3) <A HREF="http://www.amiga.com/3.9/download/BoingBag39-1.lha" TARGET="_top">http://www.amiga.com/3.9/download/BoingBag39-1.lha</A></B></P>
<P><B>*4) <A HREF="http://www.haage-partner.de/aos39/faq/os39faq.html" TARGET="_top">http://www.haage-partner.de/aos39/faq/os39faq.html</A></B></P>
<P><B>*5) <A HREF="http://www.xmas.demon.co.uk/AmigaDirections.html" TARGET="_top">http://www.xmas.demon.co.uk/AmigaDirections.html</A></B></P>
<P><B>*6) <A HREF="http://www.amiga-news.de/archiv01/010331_st_louis.shtml" TARGET="_top">http://www.amiga-news.de/archiv01/010331_st_louis.shtml</A></B></P>
<P><B>*7) <A HREF="http://amiga.org" TARGET="_top">http://amiga.org</A></B></P>
<P><B>Stefan Czinczoll &lt;<A HREF="mailto:sn074cz@uni-duisburg.de">sn074cz@uni-duisburg.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
