<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. &raquo;St. Louis 2001: Es hat sich nichts ge&auml;ndert&laquo; (von Sven Drieling)</H2>
<P><i><a href="mailto:indy@olis.north.de">Sven Drieling</a>, 05-Apr-2001</i></P>
<P>
Amiga hat am Wochenende in St. Louis die aktuellen Pl&auml;ne ver&ouml;ffentlicht.
Angek&uuml;ndigt wurden diese mit einem Ground Shaking Event. Nachdem, was ich
seit Sonntag dar&uuml;ber &uuml;bers Internet gelesen habe, habe ich den Eindruck,
dass sich nichts ge&auml;ndert hat.
</P>
<P>
Das langfristige Ziel von Amiga ist weiterhin ein portables, eigenst&auml;ndig
laufendes AmigaDE in Kombination mit Elate von Tao. Neu ist, dass mit dem
AmigaOS V5 inklusive Speicherschutz, SMP und anderen Features eine weitere
Komponente als Grundlage f&uuml;r dieses System hinzugekommen ist. Au&szlig;erdem gibt
es mit Sharp eine Kooperation zur Entwicklung von Applikation f&uuml;r Sharp`s
Zaurus-PDA auf Basis von AmigaDE.
</P>
<P>
Leider hat sich auch nichts an der Informationspolitik von Amiga ge&auml;ndert,
so dass es sehr schwer ist zu verstehen, was Amiga eigentlich plant und ich
mir auch nicht wirklich sicher bin, ihre Pl&auml;ne nun richtig verstanden zu
haben.
</P>
<P>
Ich habe allerdings den Eindruck, dass Bill McEwen und Fleecy Moss von ein
und derselben Planung reden sich dabei aber auf die entgegengesetzten Enden
konzentrieren. Bill McEwen konzentriert sich auf die kurzfristigen
Ziele(AmigaOS f&uuml;r PPC, PDA, AmigaDE gehostet) und Fleecy Moss auf die
langfristigen(eigenst&auml;ndig laufendes, portables AmigaOS V5 + AmigaDE f&uuml;r
Hardware vom PDA bis hin zum Server einschlie&szlig;lich des Desktops). Diese
unterschiedlichen Schwerpunkte d&uuml;rften ein Grund f&uuml;r die derzeitigen
Verunsicherungen sein. Ein zweiter d&uuml;rfte darin liegen, dass Amiga bisher
keine zusammenh&auml;ngenden Texte ver&ouml;ffentlicht hat, aus denen ihre
Zukunftspl&auml;ne klar hervorgehen - u.a. ist weiterhin kaum etwas &uuml;ber AmigaDE
bekannt.
</P>
<P>
So wie ich es verstanden haben sehen die Pl&auml;ne nun folgenderma&szlig;en aus,
wobei ich mir absolut nicht sicher bin, ob diese Darstellung stimmt, da es
sehr m&uuml;hsam ist aus dem, was von Amiga kommt, herauszulesen was Amiga jetzt
eigentlich tun will und es auch Raum f&uuml;r eigene Interpretationen gibt.
</P>
<P>
Die kurzfristigen Ziele sind AmigaDE gehostet auf Linux und WindowsCE f&uuml;r
PDAs und ein AmigaOS V4.x plus gehosteten AmigaDE f&uuml;r PPC-Rechner, die der
Zico-Spezifikation entsprechen. Dies trifft z.B. auf dem AmigaOne 1200 von
Eyetech zu.
</P>
<P>
Das langfristige Ziel ist ein portables, eigenst&auml;ndiges, run anywhere OS
auf Basis des AmigaOS kombiniert mit Taos Elate und AmigaDE. Dieses OS wird
Speicherschutz, virtuellen Speicher, SMP u.&auml;. bieten und skalierbar vom PDA
bis hin zum Server verf&uuml;gbar sein.
</P>
<P>
An der Planung und Weiterentwicklung von AmigaDE hat sich dabei nichts
ge&auml;ndert. Es wird weiterhin den VP, die Sprache Sheep, OpenGL und die
anderen geplanten und weiterhin unbekannten Features bieten und sowohl
gehostet auf anderen Systemen als auch langfristig als eigenst&auml;ndiges
System verf&uuml;gbar sein.
</P>
<P>
Als Rechner f&uuml;r die Softwareentwicklung d&uuml;rfte auch weiterhin der d´Amiga
mit einer Weiterentwicklung des jetzigen SDKs dienen. Ich glaube/hoffe
nicht, dass Amiga den Zico-PPC zum einzigen Entwicklungsrechner f&uuml;r AmigaDE
ernennen wird.
</P>
<P>
Damit d&uuml;rfte Amiga nun, 15 Monate nach der Gr&uuml;ndung, sowohl die W&uuml;nsche der
AmigaOS f&uuml;r PPC- und als auch die W&uuml;nsche der AmigaDE-Bef&uuml;rworter erf&uuml;llen,
ohne das dies auf Kosten einer der beiden Grupppierungen geht.
</P>
<P>
Weshalb Amiga nicht in der Lage ist, dies der &Ouml;ffentlichtkeit zu vermitteln
ist mir vollkommen unverst&auml;ndlich.
</P>
<H3>Was mich an St. Louis st&ouml;rt</H3>
<P><B>Katastrophale Informationspolitik</B></P>
<P>
Die Informationspolitik von Amiga ist katastrophal. Amiga mu&szlig; endlich
begreifen, dass es derzeit f&uuml;r au&szlig;enstehende vollkommen unm&ouml;glich ist zu
verstehen und nachzuvollziehen was Amiga eigentlich aus welchen Gr&uuml;nden
plant. Dies liegt daran, das alle n&ouml;tigen Informationen nur St&uuml;ckchen f&uuml;r
St&uuml;ckchen aufgrund heftiger Reaktionen der Amiga-BenutzerInnen
ver&ouml;ffentlicht werden, die nach Amiga`s Ank&uuml;ndigungen in St. Louis
vollkommen desinformiert waren.
</P>
<P>
Was weiterhin fehlt sind Texte, die Amiga´s Pl&auml;ne klar, verst&auml;ndlich,
nachvollziehbar und widerspruchslos an einem St&uuml;ck auf amiga.com erl&auml;utern.
Damit w&auml;re nicht nur den Amiga-BenutzerInnen geholfen, sondern auch den
MitarbeiterInnen bei Amiga, die kurz nach St. Louis mal wieder in einer
Flut von heftigen Reaktionen erstickten und ihre Zeit sicherlich auch
sinnvoller h&auml;tten verbringen k&ouml;nnen.
</P>
<P><B>Kein neues SDK</B></P>
<P>
Entgegen der Erwartungen vieler wurde in St. Louis keine neue Version des
SDKs pr&auml;sentiert, die z.B. schon OpenGL enth&auml;lt und einen Ausblick auf
Sheep und andere Komponenten bietet. Was ein Grund daf&uuml;r sein d&uuml;rfte, dass
der Eindruck entstand, dass Amiga nun AmigaDE links liegen l&auml;&szlig;t und sich
stattdessen aufs AmigaOS konzentriert.
</P>
<P><B>Vernachl&auml;ssigung der jetzigen AmigaPPC-Rechner</B></P>
<P>
Zu Anfang hatte Amiga das AmigaOS links liegen lassen und sich auf AmigaDE
konzentriert. Es gab nicht mal die eindeutige Aussage, dass eine Drittfirma
AmigaDE auf die jetzigen AmigaPPC-Rechner portieren wird und AmigaDE von
Anfang an eine Amiga Classic-Emulation erhalten wird(die Betonung liegt
hier auf eindeutige Aussage). Aufgrund solcher Aussagen h&auml;tte man recht
ruhigen Gewissens Hard- und Software f&uuml;r die jetzigen Amigas kaufen k&ouml;nnen,
da man dann ja gewu&szlig;t h&auml;tte, dass man diese Komponenten auch in der Zukunft
zusammen mit AmigaDE nutzen kann. So h&auml;tten Amiga-Firmen und -H&auml;ndler seit
Anfang 2000 ihre Gesch&auml;fte ganz normal weiterf&uuml;hren k&ouml;nnen.
</P>
<P>
Daher verstehe ich nicht, weshalb Amiga nun schon wieder den gleichen
Fehler macht. AmigaOS V4.x wird f&uuml;r Zico-PPC-Rechner angek&uuml;ndigt aber es
gibt keine eindeutige Aussage, dass AmigaOS V4.x auch f&uuml;r die jetzigen
PPC-Amigas erh&auml;ltlich sein wird. Ausgestattet mit einem PCI-Board plus
enstprechender USB-, Firewire-Karten u.&auml;. w&uuml;rden diese Rechner zudem die
Zico-Spezifikation erf&uuml;llen.
</P>
<P>
Das sich Amiga selbst auf den leichter handhabbaren AmigaOne konzentriert,
verstehe ich. Dadurch verliert Amiga keine Zeit und kann sich besser auf
das eigentlich Ziel konzentrieren. Weshalb aber zusammen mit AmigaOS V4.x
f&uuml;r AmigaOne nicht die M&ouml;glichkeit genannt wird, dass Drittfirmen dieses OS
auf die jetzigen PPC-Amigas portieren k&ouml;nnen kann ich nicht verstehen.
Irgendwo hatte Fleecy Moss zwar diese M&ouml;glichkeit angedeutet, eine
eindeutige Aussage scheint es mir dazu aber nicht zu geben.
</P>
<P>
Amiga w&uuml;rde durch eine solche Portierung nichts verloren gehen aber es
k&auml;men vermutlich problemlos ein paar weitere 1000 AmigaOS V4.x
AnwenderInnen hinzu. Niemand w&auml;re sauer, dass pl&ouml;tzlich die teure
PPC-Hardware &uuml;berfl&uuml;ssig wird, obwohl sie sich f&uuml;r das AmigaOS eignen w&uuml;rde
und Amiga-Firmen und -H&auml;ndler k&ouml;nnten schon jetzt mit PCI-Boards u.&auml;. Geld
verdienen, statt bis zum Sommer auf den AmigaOne warten zu m&uuml;ssen.
</P>
<P><B>Vernachl&auml;ssigung der Desktop-Rechner</B></P>
<P>
In Bezug auf AmigaDE konzentriert sich Amiga zun&auml;chst auf PDAs. Da eine
Kooperation mit Sharp besteht und sich meiner Meinung nach im PDA-Bereich
leichter eine sichere Markposition einnehmen l&auml;&szlig;t als im Desktop-Bereich
ist dies auch richtig. Da AmigaDE aber f&uuml;r den Desktop-Rechner verf&uuml;gbar
sein mu&szlig;(Entwicklungsrechner) und ein wichtiger Punkt bei PDAs darin
besteht, dass man die Daten leicht zwischen PDA und Desktop austauschen
kann spricht meiner Meinung nach nichts dagegen, im gleichen Atemzug auch
den Desktop zu nennen. Da gerade AmigaDE es erlauben w&uuml;rde ein und dieselbe
Applikation auf PDAs als auch auf Desktops auszuf&uuml;hren. Die
Desktop-Variante w&uuml;rde dann gehostet auf den weit verbreiteten Windows- und
Linux-Rechnern und zus&auml;tzlich unter AmigaOS V4.x auf Amiga-PPC-Rechnern
laufen.
</P>
<P><B>Fazit</B></P>
<P>
Mit AmigaDE plus Anwendungen f&uuml;r PDA und AmigaOS plus der PPC-Hardware
schl&auml;gt Amiga meiner Meinung nach zwei Wege ein &uuml;ber denen sowohl Amiga als
auch Drittfirmen schon kurzfristig Einnahmen erwirtschaften k&ouml;nnen.
Zus&auml;tzlich erf&uuml;llt Amiga nun die W&uuml;nsche der PPC- und AmigaDE-Bef&uuml;rworter,
ohne dass sich die urspr&uuml;nglichen Ziele ge&auml;ndert haben.
</P>
<P>
Wieso sich Amiga jetzt wieder aufs AmigaOS zur&uuml;ckbesinnt wei&szlig; ich nicht.
Gr&uuml;nde daf&uuml;r k&ouml;nnten die Forderungen nach einer Weiterenwicklung des
AmigaOS sein und das Amiga in den letzten Monaten Bekanntschaft mit der
Realit&auml;t gemacht und dabei gelernt hat, dass es doch immer einige Zeit
braucht, die eigenen Ideen umzusetzen egal wie gut sie sind.
</P>
<P>
Die Zico-PPC-Rechner sind jedoch eine sehr kleine Marktnische, die erstmal
nur die jetzigen Amiga-BenutzerInnen anspricht. Mit einem LinuxPPC f&uuml;r
diese Rechner kann der Benutzerkreis noch um ein weitere handvoll Leute
erh&ouml;ht werden, die dadurch eventuell auch aufs AmigaOS und AmigaDE
aufmerksam werden. Einen gr&ouml;&szlig;eren Markt wird man damit meiner Einsch&auml;tzung
aber nicht erreichen k&ouml;nnen. Dies k&ouml;nnte aber mit dem gehosteten AmigaDE
f&uuml;r PDAs und Desktops m&ouml;glich sein. Wobei ich weiterhin nicht wei&szlig;, um was
es sich bei AmigaDE im Detail handelt, so dass ich nicht die geringste
Ahnung habe wie interessant dieses System f&uuml;r BenutzerInnen andere Systeme
sein k&ouml;nnte.
</P>
<P>
Wenn es aber auch schon jetzt ein eigenst&auml;ndig laufendes AmigaDE geben
w&uuml;rde, dann w&uuml;rde dieses meiner Einsch&auml;tzung nach nur einen kleinen Teil
der installierten AmigaDE-Systemen aus machen, da der &uuml;berwiegende Teil
vermutlich gehostet auf anderen Systemen laufen wird. Da die BenutzerInnen
so gleichzeitig ihr bekanntes System mit der bew&auml;hrten Software plus dem
neuen System mit der run anywhere Software nutzen k&ouml;nnten und nicht dazu
gezwungen w&auml;ren komplett von heute auf morgen auf ein neues System wechseln
zu m&uuml;ssen.
</P>
<P>
Weil ich keine Details zu AmigaDE kenne, kann ich derzeit nicht einsch&auml;tzen
wie gut Amigas Zukunftsaussichten sind. Ich denke aber, dass sie ihre
Planung nun auf einen soliden Boden gestellt haben, so dass die
Ausgangsvoraussetzungen gut sind.
</P>
<P>
Ein m&ouml;glicher Durchbruch wird meiner Meinung nach aber nicht &uuml;ber Nacht
kommen, sondern sich nach und nach in Laufe der Jahre ergeben. Ein
wichtiger Punkt wird dabei dann das portable AmigaOS V5 darstellen, in dem
vermutlich das AmigaOS und AmigaDE zusammenschmelzen werden und mit dem
sich Amiga dann von anderen Systemen unabh&auml;ngig macht.
</P>
<P><B>Sven Drieling &lt;<A HREF="mailto:indy@olis.north.de">indy@olis.north.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
