<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Forum</H1>
<P>
In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot;
zusammengefasst.
</P>
<P><B>Wenn Ihr einen Beitrag habt, schreibt bitte an:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Carsten Schr&ouml;der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Helmoltstra&szlig;e 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">37081 G&ouml;ttingen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>E-Mail: <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A></B></P>
<H2>1. Reaktion auf den OS3.9-Kommentar von M. Christoph (von Stephan Kolbe)</H2>
&lt; Ich bin, bereits seit AmigaOS 3.5, Betatester und wei&szlig; auch, wieviel<BR>
&lt; sich intern verbessert hat, was gar nicht &quot;nach au&szlig;en&quot; dringt oder zur<BR>
&lt; Kenntnis genommen wird.<BR>
<P>
Wenn doch aber einer mal dar&uuml;ber was sagen w&uuml;rde, es interessiert bestimmt
nicht wenige, was seit OS3.5 respektive 3.9 intern verbessert wurde.
Niemand, aber auch niemand von offizieller Seite h&auml;lt es f&uuml;r n&ouml;tig, die
User, also die Leute, die daf&uuml;r ihr Geld ausgeben wollen oder sollen,
aufzukl&auml;ren!!!
Die HTML-Dokus sind, sagen wir mal, ein Witz, und wenn, wie ich geh&ouml;rt
habe, in dem OS3.9-Buch vieles dar&uuml;ber steht, hei&szlig;t das nur, dass man sich
das auch noch kaufen mu&szlig;.
</P>
&lt; Unabh&auml;ngig davon schlie&szlig;e ich mich der Meinung an, da&szlig; ein PPC-AmigaOS<BR>
&lt; nicht erforderlich ist und eher negative Auswirkungen auf AmigaDE hat.<BR>
<P>
Wenn es denn ein AmigaDE je geben wird bzw. es &uuml;berhaupt die jetzigen
Amiga-User anspricht.
</P>
&lt; Abgesehen von einem (sinnlosen) Jahr Entwicklungszeit habe ich meine<BR>
&lt; Zweifel an der Bin&auml;rkompatibilit&auml;t zu dem jetzigen OS. Und wird die<BR>
&lt; Bin&auml;rkompatibilit&auml;t nur durch Emulation erreicht, ist kein<BR>
&lt; Geschwindigkeitszuwachs mehr vorhanden. In dieser Zeit k&ouml;nnte man eine<BR>
&lt; Menge an Verbesserungen im jetzigen AmigaOS vornehmen, die JEDEM zugute<BR>
&lt; kommen w&uuml;rden und nicht nur einer kleinen Anwendergruppe.<BR>
<P>
Diese Meinung halte ich nun wieder f&uuml;r vollkommen korrekt, bezweifle aber
dass in dieser Richtung zumindest von Seiten Amiga je wieder was passieren
wird.
</P>
<P>
Man sollte den Source offenlegen und die Anwenderschaft das machen lassen,
wenn es sich f&uuml;r ein komerzielles Unternehmen nicht mehr lohnt, und darauf
l&auml;uft doch alles hinaus.
</P>
<P>
Nebenbei bemerkt habe ich eine positive Meinung zum OS3.9, ob man nun Boing
Bag 2 oder Version 39 oder wie auch immer dazu sagt......
</P>
<P><B>Stephan Gururom Kolbe &lt;<A HREF="mailto:Gururom@skolbe.de">Gururom@skolbe.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Forum2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
