<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
<H2>AMIGA nimmt einmal mehr einen Kurswechsel vor (von Carsten Schr&ouml;der)</H2>
</P>
<P>
Von der Messe in St. Louis habe ich keine Wunder erwartet. Doch ging ich
fest davon aus, dass AMIGAs bisherige Strategie, die ich f&uuml;r goldrichtig
hielt und immer noch halte, konsequent weitergef&uuml;hrt wird. Doch es kam
anders.
</P>
<P>
Zur Zukunft des AmigaDE kann ich jetzt, Tage sp&auml;ter, &uuml;berhaupt nichts
sagen, denn ich habe den Eindruck gewonnen, die drei wichtigsten Personen
bei AMIGA, Bill McEwen, Fleecy Moss und Gary Peake, sprechen, wenn sie das
AmigaDE meinen, &uuml;ber drei verschiedene Projekte. Bill McEwens Worten nach
zu urteilen wurde die AmigaDE-Planung gravierend ge&auml;ndert, hier ist fast
nur die Rede von PDAs und anderen Kleinger&auml;ten sowie &raquo;Content&laquo;. Aus dem
Mund von Fleecy Moss h&ouml;rt sich das schon weniger dramatisch an, und Gary
Peake sagt: &quot;Es gibt &uuml;berhaupt keine &Auml;nderungen&quot;. Na toll. Ich kann
schlichtweg nicht beurteilen, ob die genannten Personen letztendlich nur
unterschiedliche Aspekte von ein- und derselben Sache ansprechen, oder ob
doch eine &Auml;nderung der AmigaDE-Planung dahinter steckt - und ich bin ganz
sicher nicht der Einzige, dem es so geht.
</P>
<P>
Allerdings bin ich insgesamt der Ansicht, dass die Kurs&auml;nderung, die es -
zumindest das steht fest - mit der Ank&uuml;ndigung einer PowerPC-nativen
Version des AmigaOS gegeben hat, ein schwerwiegender Fehler AMIGAs ist.
Ressourcen werden f&uuml;r ein (weiteres) v&ouml;llig neues Betriebssystem - nichts
anderes ist eine PowerPC-native AmigaOS-Version - verbraucht, dem ich
praktisch keine Marktchancen einr&auml;ume. Wer, bitte sch&ouml;n, soll sich dieses
OS zulegen? Zumindest habe ich bislang noch kein einziges Feature entdecken
k&ouml;nnen, das so au&szlig;ergew&ouml;hnlich ist, dass es Nutzer anderer Betriebssysteme
dazu bewegen k&ouml;nnte, zum PowerPC-AmigaOS zu wechseln. Schlie&szlig;lich darf
nicht &uuml;bersehen werden, dass die allermeisten Anwender einen x86-Rechner
benutzen und kaum bereit sein d&uuml;rften, sich einen wesentlich teureren
PowerPC-Rechner, auf dem sie im Notfall - sollte das PowerPC-AmigaOS
scheitern - nicht einmal mehr den Windows-Standard installieren k&ouml;nnen, zu
kaufen. Genauso sehe ich absolut keinen Grund, weshalb eine Softwarefirma
ihre Programme f&uuml;r das PowerPC-AmigaOS umsetzen sollte.
</P>
<P>
Kurzum: F&uuml;r die Chancen des jetzt geplanten PowerPC-nativen AmigaOS sehe
ich schwarz. Zwar soll das AmigaOS ab Version 5 Speicherschutz erhalten und
mit dem AmigaDE &quot;verschmolzen&quot; werden, hier stellt sich f&uuml;r mich nur die
Frage nach dem &quot;Wie?&quot;. Wir erinnern uns: Auch f&uuml;r das 68k-AmigaOS war vor
einigen Jahren eine Memory-Protection-Software angek&uuml;ndigt worden, deren
Realisierung sich schlie&szlig;lich als unm&ouml;glich erwies. Und die Verschmelzung
zweier Betriebssysteme d&uuml;rfte ebenfalls gravierende Probleme mit sich
bringen.
</P>
<P>
Pers&ouml;nliches Fazit: AMIGA verfolgte vor St. Louis eine simple, aber geniale
Idee: Man wollte mit dem AmigaDE ein Betriebssystem schaffen, das
Plattformunabh&auml;ngigkeit auf Bin&auml;rebene bietet, also auf nahezu s&auml;mtlichen
Prozessoren (und sogar gehostet unter fremden Betriebssystemen) lauff&auml;hig,
aber dennoch schnell ist. Die j&uuml;ngste Ank&uuml;ndigung eines PowerPC-AmigaOS,
das irgendwann und irgendwie mit dem AmigaDE verschmolzen werden soll,
klingt f&uuml;r mich alles andere als durchdacht und wirft einen Haufen Fragen
bez&uuml;glich der Realisierung auf. Die Vergangenheit - und hier gerade das
Beispiel BeOS, das mit Sicherheit kein schlechtes Produkt ist, und seit
l&auml;ngerem sogar kostenlos abgegeben wird - hat gezeigt, dass sich ein
Betriebssystem nur dann am Markt halten kann, wenn es wirklich einzigartige
Features besitzt. Ich kann beim besten Willen nicht erkennen, was das
Besondere an dem nun geplanten PowerPC-AmigaOS ist.
</P>
<P>
Ob ich weiterhin an einen &raquo;Neuen Amiga&laquo; glauben kann, h&auml;ngt somit
ma&szlig;geblich davon ab, ob das AmigaDE so verwirklicht werden wird, wie es
urspr&uuml;nglich geplant war. Wenn das nicht der Fall ist, und das AmigaDE
lediglich als ein Content-Lieferant f&uuml;r PDAs und Handies, nicht aber als
ein skalierbares, plattformunabh&auml;ngiges Betriebssystem realisiert wird,
werde ich mein Amiga-Engagement &uuml;ber kurz oder lang &uuml;berdenken m&uuml;ssen. Denn
ohne eine Zukunftsperspektive fehlt mir nun mal jegliche Motivation.
</P>
<P><B>Viele Gr&uuml;&szlig;e,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
