<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele7.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>6. Review: Nightlong</H2>
<P>
Das gr&ouml;&szlig;te Amigaspiel aller Zeiten! So nennen Clickboom ganz bescheiden ihr
Werk. Das man an so ein Spiel nicht wie an jedes andere Spiel herangeht
versteht sich von selbst. Aber der Hauptgrund, da&szlig; ich an dieser Stelle
nicht mit der Beschreibung der Verpackung und der Hintergrundstory
herangehe, ist der Installations&auml;rger, den Nightlong den meisten Usern
beschert. Es schein fast so, als stehe der Titel Nightlong f&uuml;r n&auml;chtelangen
&Auml;rger. Nachdem die CD eingelegt wurde, fand ich kein Installerprogramm.
Auch auf den anderen beiden CDs war nichts dergleichen. Komisch, dachte ich
mir.
</P>
<P>
<A HREF="img/nightlong1.jpg"><IMG SRC="thumb/nightlong1.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Und es sollte auch keine Mittel und Wege geben, eines herbeizuzaubern. Der
Grund liegt n&auml;mlich am Format, mit dem die CD gebrannt wurde. Dies ist
n&auml;mlich nicht das am Amiga &uuml;bliche Rockridge-Format. Und das vorliegende
Jouliet-Format wird leider nicht von jedem Filesystem erkannt. Also gilt
es, erst einmal ein passendes Filesystem zu installieren, wie z.B. das von
OS 3.9. Unter Umst&auml;nden hat man dann aber auch schon das n&auml;chste Problem:
Die CDs werden nicht mit ihrem richtigen Namen &quot;Q&quot;, sondern als &quot;unbekannt&quot;
angezeigt. Also mu&szlig; per Hand ein Assign (assign Q: cd0:) errichtet werden.
Puh! Aber Clickboom hat angek&uuml;ndigt, da&szlig; bei neuen Pressungen dieser Fehler
nicht mehr auftritt und alle schon vorhandenen (registrierten) CDs k&ouml;nnen
gegen neue eingetauscht werden. Aber dieser Fehler hat mir so auf den Magen
geschlagen, da&szlig; es bei &quot;Einstieg/Anleitung&quot; eine glatte 6 gibt! Zwar ist
die Anleitung sehr gut gemacht, aber so etwas geh&ouml;rt meiner Meinung nach
bestraft! Aber jetzt l&auml;uft das Spiel und somit kann der Test beginnen:
</P>
<P>
Nightlong wird auf drei CDs im gro&szlig;en Jewel Case geliefert. Die Qualit&auml;t
ist wie von Clickboom nicht anders gewohnt sehr hoch. Es liegt ein Booklet
mit Anleitung und Hintergrundstory bei. Leider ist alles komplett in
Englisch.
</P>
<P>
Hier eine kurze Zusammenfassung, um was es in Nightlong &uuml;berhaupt geht: Wir
schreiben das Jahr 2099, die Welt ist ein komplett anderer Ort geworden. Es
gab massive, technische Fortschritte, die es erlaubten billig und effektive
Energien zu nutzen. Der m&auml;chtigste Staat der Welt, &quot;The United States of
the New Order&quot;, hat diesen Fortschritt gef&ouml;rdert, aber in deren Hauptstadt,
&quot;Union City&quot;, l&auml;uft nicht alles rosig. Die Wissenschaft hat die Regierung
reich gemacht. Die L&auml;nder werden von gesichtslosen B&uuml;rokraten, welche f&uuml;r
gro&szlig;e, multinationale Gesellschaften arbeiten, kontrolliert. Genesis ist
die gr&ouml;&szlig;te dieser Gesellschaften und ist weltweit verantwortlich f&uuml;r
Transport, Energiekonsum, Medizin und Lasertechnik. Seit Jahrzehnten
herrscht Frieden, aber dies unter der strengen Kontrolle der
multinationalen Unternehmen.
</P>
<P>
<A HREF="img/nightlong2.jpg"><IMG SRC="thumb/nightlong2.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Eine der gr&ouml;&szlig;ten Errungenschaften dieses Zeitalters ist das Cyberspace und
hierf&uuml;r verantwortlich ist Genesis. Es erlaubt einen Austausch innerhalb
der riesigen Netzwerke. So kann man bequem vom Sessel aus arbeiten,
einkaufen oder sich selbst vergn&uuml;gen. Die Frage ist nur, wer arbeitet im
Hintergrund, zieht die F&auml;den und kontrolliert die Bev&ouml;lkerung?
</P>
<P>
Nach dem Start folgt zuerst einmal das Einblenden der Logos in wirklich
sehr guter Qualit&auml;t. Danach gibt es ein ca. f&uuml;nfmin&uuml;tiges Intro. Und hier
macht sich schon der Vorzug der PPC-Unterst&uuml;tzung bemerkbar: Denn in der
68k-Version gibt es dieses nur in einem kleinen Fenster (ca. 1/4 des
Bildschirms), und ansonsten in &auml;hnlicher Geschwindigkeit in Fullscreen!
</P>
<P>
&uuml;ber die Qualit&auml;t des Filmes l&auml;sst sich allerdings nicht streiten: Sie ist
erstklassig! Die Sprachausgabe ist perfekt gemacht und dank deutschem
Untertitel bekommen auch Englischmuffel mit, um was es geht. Und f&uuml;r die
Spielatmosph&auml;re sehr wichtig: Das Spiel beginnt genau an der Stelle, wo der
Film aufh&ouml;rt. Ebenso binden sich auch kleinere Zwischensequenzen in das
Spiel ein. So f&uuml;gt sich das Ganze fast zu einem Film zusammen. Nur, da&szlig; man
hier die Hauptrolle spielt. Als Privatdetektiv Joshua Reev sucht man f&uuml;r
den B&uuml;rgermeister von Union City (einem alten Freund) nach einem
verschollenen Agenten, der einen Terrorakt auf Genesis aufkl&auml;ren wollte.
Soviel als kurze Zusammenfassung des, ich mu&szlig; es nochmals wiederholen,
genialen Intros.
</P>
<P>
Nun haben wir also das Spiel nach n&auml;chtelangem Installationsstre&szlig; auf
unserem Lieblingsrechner und wissen auch, worum es geht: Aufdeckung einer
Verschw&ouml;rung in Union City. Fehlt also nur noch das Wie, sprich die
technische Umsetzung (Sound und Grafik) sowie das Gameplay.
</P>
<P>
<A HREF="img/nightlong3.jpg"><IMG SRC="thumb/nightlong3.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Fangen wir mit dem Gameplay an: Bei Nightlong handelt es sich um ein
klassisches Point-and-Click-Adventure a la Simon the Sorcerer oder Monkey
Island. Der Hauptteil des Bildschirms wird von der Szene eingenommen. Diese
lassen sich aber nicht wie bei den genannten Beispielen scrollen. F&auml;hrt man
mit dem Mauszeiger &uuml;ber das Bild, werden sogenannte &quot;aktive&quot; Objekte
sichtbar, indem der Name (z.B. T&uuml;r) erscheint. Nun kann man dieses Objekt
betrachten (linke Maustaste) oder benutzen (rechte Taste). Also nicht, wie
bei den klassischen Adventures mittels verschiedener Icons (nimm, gib,
gehe...) sondern einzig durch die Maus. Benutzt man das Objekt (rechte
Taste), macht der Charakter n&auml;mlich immer das naheliegendste (zum Beispiel:
bei einer Person - sprechen, bei einer T&uuml;r - &ouml;ffnen, bei einem losen
Gegenstand - mitnehmen). Dies vereinfacht den Spielflu&szlig; und steigert somit
die Langzeitmotivation ungemein. Nat&uuml;rlich gibt es auch bei Nighlong das
klassische Inventory. Hier werden alle mitgef&uuml;hrten Gegenst&auml;nde angezeigt.
F&auml;hrt man mit dem Mauszeiger an den unteren Rand des Bildschirmes, wird es
aufgerufen. F&uuml;r jede Sache gibt es ein Icon. Innerhalb des Inventars wird
genauso verfahren wie im Spiel: Klickt man mit der linken MT auf einen
Gegenstand, wird er betrachtet, mit der rechten Taste kann man ihn
benutzen. Auch hier &uuml;bernimmt wieder der Computer die Hauptarbeit. Der
Gegenstand, der benutzt werden soll, ist nach Dr&uuml;cken der rechten MT aktiv.
Nun wird bestimmt, was damit zu geschehen hat. Klickt man zum Beispiel auf
einen anderen Gegenstand im Inventory, werden beide kombiniert: z.B.
Haken+Leine=Angelschnur oder Feuerzeug+Stock=Fackel, benutzt man ihn mit
einer Person, wird er in der Regel &uuml;bergeben oder aber auch anderweitig
eingesetzt: z.B. Baseballschl&auml;ger+Person=Gewaltakt. Ich hoffe, die
Interaktion der Gegenst&auml;nde ist klar geworden. Nun, da wir wissen, wie man
sich in Union City zurechtfindet und was man &uuml;berhaupt da machen mu&szlig;, gilt
es noch herauszufinden, wie es dort &uuml;berhaupt aussieht und sich anh&ouml;rt:
Grafik und Sound!
</P>
<P>
Nightlong spielt sich auf einem 16Bit-Schirm in 640*480. Das ganze Bild ist
komplett animiert, so da&szlig; es wirklich schwer f&auml;llt, eine Stelle zu
benennen, wo sich nichts bewegt, als zu sagen: Dies und das im Hintergrund
ist animiert. Und es ist nat&uuml;rlich auch klar, was das bedeutet: Das Spiel
braucht Power! Dank des genialen Gameplays und der Super-Grafik ist
Nightlong auch f&uuml;r den 030er empfehlenswert, aber man sollte sich im Klaren
sein, da&szlig; ein 060er eigentlich die bessere Wahl ist. Und richtig Spa&szlig; macht
es erst mit einem PPC, da hier gar kein Ruckeln mehr zu merken ist und die
Fullscreen-Animationen den Spielspa&szlig; erst so richtig auf die Spitze
treiben. Deshalb gibt es hier die Bestnote bei Langzeitmotivation.
</P>
<P>
<A HREF="img/nightlong4.jpg"><IMG SRC="thumb/nightlong4.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Genauso wie die Grafik bietet der Sound alles erdenklich Gute. Die SoundFX
sind stimmungsvoll und passend (leider gibt es einen Bug, so da&szlig; sie nach
einigen Minuten verstummen, dieser wurde erst in der 68k-Version behoben)
und die Musik passt sich der Atmosph&auml;hre an. Highlight des Spiels ist aber
die Sprachausgabe. Leider ist sie nur in Englisch, aber in wirklich
professioneller Qualit&auml;t. Und durch die deutschen Untertitel st&ouml;rt es nicht
wirklich, unter Umst&auml;nden kann man sogar das eine oder andere lernen.
St&ouml;ren tut eigentlich nur die mittelm&auml;&szlig;ige &uuml;bersetzung und einige
Rechtschreibfehler (so steht statt &quot;T&uuml;r&quot; sehr oft nur &quot;T&uuml;&quot; oder aber so
Sachen wie: &quot;Bitten sie um den Fu&szlig;boden des Apartements&quot; (floor w&ouml;rtlich
&uuml;bersetzt)). Ich will nicht sagen, da&szlig; der Spielspa&szlig; dadurch g&auml;nzlich
verloren geht, aber die bis jetzt so strahlende Schicht der
Professionalit&auml;t wird doch etwas angekratzt. Aber ansonsten gibt es
technisch nix zu bem&auml;ngeln.
</P>
<P>
Ach &uuml;brigens: Nat&uuml;rlich kann man auch SoundFX und Musik getrennt
voneinander an- bzw. ausschalten und an jeder Stelle speichern.
</P>
<P>
Nightlong hat zwei negative Punkte. Da ist zum einen der angesprochene
Installationsstress. Dies ist gerade bei einer so gro&szlig;en Firma wie
Clickboom wirklich unverzeihlich. Aber wie gesagt: Die Kanadier haben den
Fehler eingesehen und eine komplette Neupressung veranla&szlig;t. Hut ab!!
Trotzdem gibt es in diesem Test noch die Strafe in Form einer schlechten
Benotung des Einstiegs.
</P>
<P>
Der zweite Punkt ist der Preis. Gut 200,-DM f&uuml;r die PPC-Version ist
wirklich heftig! Andererseits bekommt man wirklich 1a-Qualit&auml;t f&uuml;r sein
Geld. Und so meine ich, da&szlig; dieser Weg wirklich der einzig Richtige ist,
denn nur wenn man mit Amiga-Spielen kein Minus macht, lohnt sich f&uuml;r die
Firmen der Einsatz in diesem Bereich. Andererseits kann ein so hoher Preis
nat&uuml;rlich auch abschreckend wirken. Meine Meinung: kaufen! Das Spiel lohnt
das Geld und wahrscheinlich ist ein hoher Wiederverkaufspreis nach dem
Durchzocken garantiert! In diesem Sinne: empfehlenswert.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele7.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
