<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. Review: Exodus</H2>
<P>
Die Welle der Echtzeitstrategiespiele ist nun entg&uuml;ltig auch auf unser
System hereingebrochen. Nach Napalm und Earth 2140 untersuche ich nun mit
Exodus den dritten Kandidaten im Rennen um den Titel des besten RTS-Games
ein bisschen genauer. Und da fangen wir nat&uuml;rlich erst einmal mit
&auml;u&szlig;erlichkeiten an: anders die beiden angesprochenen Titel kommt Exodus in
einer klassischen Box. Drinnen befindet sich eine CD-H&uuml;lle mit dem Spiel,
die Anleitung und eine Regestrierungskarte. Echt klassisch! Das macht schon
mal einen sehr professionellen Eindruck. Leider ist die Anleitung nur in
englischer und polnischer Sprache, aber das Spiel soll ja auch deutsch
sein.
</P>
<P>
<A HREF="img/exodus1.jpg"><IMG SRC="thumb/exodus1.jpg" WIDTH="120" HEIGHT="83" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Nachdem ich die CD eingelegt habe, folgt schon die n&auml;chste positive
&uuml;berraschung: auf der CD befinden sich zum einen Installer f&uuml;r deutsch,
polnisch und englisch und zum anderen eine Schublade mit jeder Menge
Extras, als da w&auml;ren: ein kostenloses Ballerspiel, eine Anleitung, wie
Exodus entstanden ist (auf polnisch), Screenshots des neuen Spieles, WB-
Bilder und AMP Skins. Echt cool. Auch die Installation klappt hervorragend.
Danach gilt es noch ein Setup-Programm aufzurufen. Hier gilt es dann, das
CDRom und die Nullmodemfunktion mit einzubinden und die Aufl&ouml;sung sowie die
Sprache zu bestimmen. Nachdem hier abgespeichert wurde, kann es endlich
losgehen:
</P>
<P>
Das Spiel startet mit dem Einblenden der Logos und hier bin ich mit der
Qualit&auml;t nicht ganz so zufrieden. Daf&uuml;r entsch&auml;digt das Demo. Es ist zwar
kein Kracher wie bei Earth, aber sehr solide gemacht. Anders als bei Earth
wird hier die komplette Hintergrundgeschichte erz&auml;hlt. Leider nur auf
englich (mit polnischem Akzent), aber durch die dabei laufenden
Filmsequencen, kann man die Story gut nachvollziehen. Aber trotzdem hier
noch einmal die kurze Zusammenfassung:
</P>
<P>
&raquo;In wenigen Tagen wird der erste und gr&ouml;&szlig;te Teil eines zerst&ouml;rten Planeten
auf Bataar einschlagen und diesen Planeten in eine brennende Kugel
verwandeln. Die Fracht- und Kriegsschiffe schaffen deshalb die Techniker
und die Ausr&uuml;stung der Moroi von Bataar. Das Mutterschiff ist mit
komplizierten Einrichtungen ausger&uuml;stet um den Superspace-Tunnel zu &ouml;ffnen.
Hierdurch kann man sein Ziel schneller erreichen. Die Expedition der Moroi
f&uuml;hrt sie direkt zum zweiten Planeten im Antares System. Dort soll es eine
Minenkolonie der Zelds´ geben. Die Aussiedlung der Moroi kann beginnen.&laquo;
</P>
<P>
(P.S.: Das Intro bietet noch einige Infos mehr, dies ist nur eine
Zusammenfassung aus der Anleitung).
</P>
<P>
<A HREF="img/exodus2.jpg"><IMG SRC="thumb/exodus2.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Im Spiel &uuml;bernimmt man eine der beiden Parteien, Moroi oder Bataar und
st&uuml;rtzt sich in den &quot;letzten Krieg&quot;.
</P>
<P>
Das ganze sieht folgenderma&szlig;en aus: Es erscheint ein sch&ouml;n gemachtes Bild,
w&auml;hrend das Spiel l&auml;dt. Eine Fortschrittsanzeige meldet, wie lange dies
ungef&auml;hr dauert. Dann gibt es den Missionsauftrag. Und sp&auml;testens hier gibt
es den ersten (unfreiwilligen Lacher). Denn wo der polnische Akzent beim
Intro noch vertretbar war, ist dies bei der &uuml;bersetztung unverzeihlich. Ich
zitiere hier einmal kurz das erste Missionsziel um euch zu zeigen, was ich
meine:
</P>
<P>
&raquo;Ziele im Auftrag 1: Landend, die Armee Moroi eingestellt herauf
Unterseiten auf der Oberseite des Planeten. Ihre Armee gegen Angriffe
Zelds' zu verteidigen und zu steuern besetzten Bereich, sie werden bestellt
zu aufbauten eine Radarstation.&laquo;
</P>
<P>
Ohne mich jetzt &uuml;ber meine polnischen Nachbarn lustig machen zu wollen,
aber diese &uuml;bersetzungen sind mehr als lachhaft. Da h&auml;tte man besser ATO
konsultiert oder so. Aber hier erleidet der Spielspass tats&auml;chlich einen
Einbruch.
</P>
<P>
Aber sehen wir mal weiter: Nachdem man also die Aufgabenstellung erraten
hat geht es direkt ins Spielgeschehen. Oben am Rand gibt es eine
Statusleiste. Der Hauptteil der Bildschirms wird durch das Spielfeld
belegt, auf der rechten Seite gibt es dann ein Radar, mit dem man direkt zu
jedem beliebigen Punkt auf der Karte springen kann. Au&szlig;erdem wird von hier
die Expansion betrieben, sprich die Geb&auml;ude gebaut. Allerdings kann aus
&uuml;bersichtsgr&uuml;nden dieses Fenster auch verborgen werden, so da&szlig; man nur noch
das Spielfeld sieht.
</P>
<P>
Am Anfang gibt es auf eben diesem aber noch nicht viel zu sehen. Ein Teil
der Landschaft ist sichbar, der noch nicht erforschte Rest noch unsichtbar.
Man sieht einige eigene Einheiten und die Zentrale. Nun gilt es die Mission
zu erf&uuml;llen und dabei seine Basis zu sch&uuml;tzen. Daf&uuml;r braucht man in der
Regel aber neue Einheiten, welche aber Geld kosten. Um dieses zu bekommen
braucht man ein Bergwerk und eine Fabrik um den gewonnenen Rohstoff zu
verarbeiten.
</P>
<P>
<A HREF="img/exodus3.jpg"><IMG SRC="thumb/exodus3.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Aber diese auf den ersten Blick komplizierte Situation spielt sich schnell
ein (und ist jedem RTS-Fan sowieso gel&auml;ufig), so da&szlig; man sich auf das
Wesentliche konzentrieren kann: die Schlacht! Aber bevor ich hierauf n&auml;her
eingehe, k&uuml;mmere ich mich mal um die technischen Fakten: Sound und Grafik.
Soundtechnisch gibt es eigentlich nix zu bem&auml;ngeln. Die Musik von CD ist
stimmungsvoll und abwechslungsreich und auch die SoundFX unterstreichen das
Spiel. Es ist zwar nicht das Non plus Ultra, aber auch nicht viel weniger.
Die Sprachausgabefetzten h&auml;tte man sich sparen k&ouml;nnen, die tragen garnix
zur Atmosph&auml;re bei. Aber alles in allem kann man den Sound doch in der
oberen Region anordnen. Anders sieht da schon die Grafik aus. Selbst in der
hohen Aufl&ouml;sung spricht mich das Ganze nicht sonderlich an. Zugegeben, das
Scrolling ist schnell und die Hintergr&uuml;nde bunt und abwechslungsreich. Aber
ich bin halt seit Napalm und Earth etwas komplett anderes gewohnt und da
kommt Exodus einfach nicht mit. Die Bewegungsabl&auml;ufe wirken steif und
unbeholfen und das ganze Ambiente irgendwie unwirklich. Klar l&auml;uft Exodus
auch auf einem 030er, aber selbst hier nur in LowRes. Und selbst auf einem
060er ist HiRes nicht ganz ruckelfrei. Das hei&szlig;t nicht, da&szlig; Exodus eine
Sch...grafik hat sondern nur, da&szlig; die beiden Konkurrenten hier wesentlich
besser abschneiden. Aber n&auml;chste Woche stelle ich ja alle drei Spiele mit
ihren Vor- und Nachteilen gegen&uuml;ber und da wird man den Unterschied ja
erkennen.
</P>
<P>
<A HREF="img/exodus4.jpg"><IMG SRC="thumb/exodus4.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Aber wie ich selbst immer betone: Das &Auml;u&szlig;ere ist nicht so wichtig, wenn das
Gameplay stimmt. Der Spielspass kommt immer an erster Stelle! Und so leid
es mir tut: Auch hier kann ich mich nicht so recht mit Exodus anfreunden.
Die Steuerung ist einfach zu ungew&ouml;hnlich, als das richtige Spielaction
aufkommt. Um eine Einheit zu bewegen, klicke ich sie mit der linken
Maustaste an. Daraufhin erscheint ein Requester in dem ich einstelle, was
die Figur machen soll (zwischen dem Ausgangspunkt und einem Zielpunkt hin-
und herlaufen, angreifen oder zu einem Ziel gehen und dort bleiben). Dann
bestimme ich mit der rechten Maustaste den Zielpunkt und die Aktion wird
ausgef&uuml;hrt. Man kann sich leicht vorstellen, da&szlig; dies im Schlachtget&uuml;mmel
schon einmal zu Schwierigkeiten f&uuml;hren kann. Nat&uuml;rlich ist das wie immer
nur meine pers&ouml;nliche Meinung, der eine oder andere hat vielleicht schon
immer auf diese Art der Steuerung gewartet.
</P>
<P>
<A HREF="img/exodus5.jpg"><IMG SRC="thumb/exodus5.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Die Level sind ansprechend und abwechslungsreich gestaltet, aber durch die
nicht immer durchdachte k&uuml;nstliche Intelligenz geriet ich schon in mancher
Situation unn&ouml;ting in Gefahr. Die Einheiten &quot;sehen&quot; n&auml;mlich keine
Hindernisse. Sie ballern einfach in Richtung Feind, egal ob da ein Baum,
ein Berg oder gar eine eigene Einheit im Weg ist. Und das ist manchmal
wirklich t&ouml;dlich!
</P>
<P>
Alles in allem entpuppt sich Exodus also nicht als der Geheimtip, als der
er vorher gehandelt wurde. Ich w&uuml;rde das Spiel nur jemanden mit einem 030er
empfehlen, der unbedingt ein RTS-Spiel braucht. Und selbst hier bitte ich
jeden sich vorher mal die Demo anzuschauen. Exodus hat ein paar gute
Ans&auml;tzte ist aber f&uuml;r meine Begriffe keine echte Konkurrenz zu Napalm und
Earth. Dies klingt hart und wird wahrscheinlich wieder einige Kritiker auf
den Plan rufen, aber ich halte nun mal nichts davon ein Spiel sch&ouml;n zu
reden. Exodus hat mich ent&auml;uscht. Aber ich nehme gerne Gr&uuml;nde entgegen,
weshalb Exodus trotzdem spielenswert ist. Mailt uns doch einfach eure
Meinung zu Exodus.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
