<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Review: Earth 2140</H2>
<P>
Die optische Aufmachung von Earth 2140 ist perfekt. Das Spiel kommt in
einer schicken DVD-Box mit professionel gedrucktem Cover und Anleitung
daher. Das Spiel liegt in der internationalen Version vor, sprich in
Englisch. So ist auch die Anleitung, sowie alle Texte im Spiel in
englischer Sprache. Hier gibt es schon die ersten Einschr&auml;nkungen. Denn
eigentlich k&ouml;nnte man das Spiel auch in japanisch genie&szlig;en, aber zum einen
geht etwas von der Atmosph&auml;re fl&ouml;ten, wenn man gar nix von der
Hintergrundstory mitkriegt, zum anderen ist es schon fatal, wenn man nicht
wei&szlig;, was eine Mission von jemandem verlangt.
</P>
<P>
<A HREF="img/earth1.jpg"><IMG SRC="thumb/earth1.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Soll man zum Bespiel ein gegnerisches Geb&auml;ude einnehmen, zerst&ouml;rt es aber
stattdessen, ist das schon doof. Also: Englischkenntnisse sollten
wenigstens in groben Z&uuml;gen vorhanden sein.
</P>
<P>
Die verschiedenen Echtzeitstrategiespiele unterscheiden sich nicht nur
durch die Technik. Auch die Hintergrundstory fesselt den Spieler und zieht
ihn in seinen Bann. W&auml;hrend dies bei Napalm noch etwas stiefm&uuml;tterlich
behandelt wurde, besticht Earth durch eine dichtgewobene Handlung und eine
atemberaubende Introsequenz. Fangen wir aber mit der Hintergrundgeschichte
an. Das Handbuch vermittelt uns folgende Begebenheiten:
</P>
<P>
Es ist das Jahr 2140. Nach unz&auml;hligen Kriegen und Katastrophen gibt es nur
noch zwei Weltm&auml;chte: Die United Civilized States (UCS), welche den
amerikanischen Kontinenten, Westeuropa und Nordafrika beinhalten und die
Eurasion Dynasty (ED) mit den Landmassen von Osteuropa und Asien. Durch den
Schaden der verschiedenen Kriege waren beide Nationen gen&ouml;tigt die
Bev&ouml;lkerung in unterirdischen St&auml;dten wohnen zu lassen.
</P>
<P>
Australien und die meisten Teile Afrikas waren die Opfer in
jahrzehntelangen Kriegen. Hochgiftige biologische und chemische Waffen
wurden auf diese L&auml;nder abgeworfen und verseuchten sie so, da&szlig; kein
menschliches Wesen dort leben kann. Es ist nicht einmal die Benutzung von
Robotern oder Maschinen m&ouml;glich. So wurde allgemein geglaubt, da&szlig; diese
Kontinente f&uuml;r immer unbenutzbar bleiben und wurden von allen Karten
gestrichen. Der gr&ouml;&szlig;te Teil der Menschheit verga&szlig;, da&szlig; diese Kontinente je
existierten.
</P>
<P>
Die Bev&ouml;lkerung der UCS f&uuml;hrten ein sehr ausschweifendes Leben. Sie lebten
nur f&uuml;r ihren eigenen Spa&szlig; und lie&szlig;en Maschinen (sogenannte &quot;Black-Tech&quot;-
Roboter) alle Arbeit machen. Es gab kein politisches Interesse, die F&uuml;hrer
wurden per Zufallsprinzip gew&auml;hlt. Die Eurasian Dynasty wurde von dem
diktatorischen Khan Dynasty gef&uuml;hrt. In diesen Tagen war Tiao Zhe Khan (der
Name bedeutet &quot;Provakator des Krieges&quot;) F&uuml;hrer der ED. W&auml;hrend den gro&szlig;en
Problemen, die sich durch die Kriege und Verseuchung ergaben, ordnete der
34te Khan, Yong Shi Khan (&quot;Brave Warrior&quot;) an, da&szlig; der menschliche K&ouml;rper
zu gr&ouml;&szlig;ten Teilen durch Maschinen ersetzt wurde.
</P>
<P>
Nun, unter der Herrschaft des 37ten Khan, wurden diese Ziele
perfektioniert. Die Bev&ouml;lkerung besteht nun aus extrem m&auml;chtigen Androiden.
Der &quot;menschliche&quot; K&ouml;rper besteht nun aus rudiment&auml;ren Organismen, welche
das Gehirn und verschiedene mechanische Elemente unterst&uuml;tzen. Die
Population wird st&auml;ndig kontrolliert. Es wird eine Androiden Gehirn Zelle
ben&ouml;tigt um neue Androiden umzuwandeln und dann werden die mechanischen
Teile dort drumherum gebaut.
</P>
<P>
Die nat&uuml;rlichen Resourcen werden immer knapper und m&uuml;ssen tief unter der
Erde abgebaut werden. Es gab einige kleinere Konflikte zwischen den UCS und
der EN die mittlerweile eskalierten und in einen brutalen Krieg ausarten -
den letzten Weltkrieg! Nur eine Seite kann gewinnen. Dieser letzte Krieg
wird entscheiden, wer die letzten verf&uuml;gbaren Resourcen erh&auml;lt und somit
zum ultimativen Herrscher der Welt wird.
</P>
<P>
Bevor wir nat&uuml;rlich mit der Schlacht beginnen, gilt es Earth auf die
Festplatte zu bannen. Theoretisch k&ouml;nnte man auch von CD spielen, aber
sp&auml;testens beim Speichern merkt man, da&szlig; dies nicht gerade die g&uuml;nstigste
Variante ist. Eine Festplatteninstallation ist hier schon alleine der
Geschwindigkeit zuliebe ratsam. Dies funktioniert ganz bequem per Installer
und man kann zwischen verschiedenen Graden der Installation w&auml;hlen. Je
nachdem wie gro&szlig; die Festplatte ist, kann man unterschiedlich viele Dateien
auf eben diese bannen. Ich w&auml;hle nat&uuml;rlich die Vollinstallation und schon
nach k&uuml;rzester Zeit sind die 100MB sicher untergebracht und ich habe zwei
Ordner auf meiner Festplatte. Earth 2140 und Earth2140Samples.
</P>
<P>
Das Spiel befindet sich im Hauptordner. Und zwar gleich in vierfacher
Ausf&uuml;hrung. Hier kann man n&auml;mlich je nach Hardware w&auml;hlen, wie das Spiel
gestartet werden soll. Entweder mit PPC oder ohne und in 640*480 oder
800*600. Diese vier verschiedenen Starticons befinden sich auch auf der CD,
falls man - entgegen meines Rates - Earth doch direkt von dort starten
m&ouml;chte.
</P>
<P>
Nachdem das Spiel gestartet wurde, beginnt sofort das Intro. Und das hat es
wirklich in sich! Sieben Minuten gerenderter Film mit imposenter Musik und
tollen Soundeffekten. Die ganze Atmosph&auml;re erinnert stark an die
Zukunftsszenen aus Terminator.
</P>
<P>
Wirklich beeindruckend. Und das Tollste: auch auf Rechnern ohne PPC l&auml;uft
der Film nahezu ruckelfrei! Das nenne ich mal eine stimmungsvolle
Einstellung auf das Spiel. Nach diesem Intro kann ich es kaum erwarten,
mich in die Schlacht zu st&uuml;rzen. Aber vorher werden noch ein paar wichtige
Einstellungen verlangt: Der Optionsschirm l&auml;&szlig;t sich nach rechts und links
scrollen, so da&szlig; verschiedene M&ouml;glichkeiten offenbart werden. Die
Hauptenscheidung liegt wahrscheinlich in der Wahl der Partei oder ob ein
alter Spielstand geladen werden soll.
</P>
<P>
Wenn ich nach rechts schaue, gibt es die Credits zu sehen, ich kann mir das
Intro nochmals anschauen oder das Spiel komplett verlassen. Die linke Seite
bietet die Wahl zwischen Netzwerk- oder Modem/Nullmodemspiel (schaut Euch
dazu bitte den Kasten an!!!). Auch kann man sich hier anhand einer gut
gemachten Datenbank alle Einheiten und Geb&auml;ude des Spiels anschauen. Aber
ich will ja den letzten Weltkrieg gewinnen, also starte ich nun endlich das
Spiel.
</P>
<P>
<A HREF="img/earth2.jpg"><IMG SRC="thumb/earth2.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Earth 2140 ist ein klassisches Echtzeitstrategiespiel im Stile von DuneII,
Command&amp;Conquer oder eben Napalm. Im Grunde ist es ganz simpel: Man
entscheidet sich f&uuml;r eine Seite, in diesem Fall entweder f&uuml;r die United
Civilized States oder die Eurasion Dynasty.
</P>
<P>
Dann w&auml;hlt man den Schwierigkeitsgrad und auf einer gro&szlig;en Weltkarte den
Staat, um den man k&auml;mpfen m&ouml;chte. Hier hat man nochmals eine letzte Chance
sich doch f&uuml;r die andere Seite zu entscheiden: wenn man nach rechts
schwenkt befindet sich ein Notausgang. Dr&uuml;ckt man allerdings auf den
entsprechenden Staat, geht es los: Man erh&auml;lt einen Missionscreen, auf dem
steht, was man machen mu&szlig;, um diesen Level zu bestehen.
</P>
<P>
Stimmungsvoll sind auch hier verschiedene Zwischenanimationen, die die
Levels miteinander verbinden. Aber irgendwann befindet man sich auf dem
Schlachtfeld! Das Spielfeld teilt sich grob in drei Teile. Der gr&ouml;&szlig;te davon
ist das Spielfeld.
</P>
<P>
Am Anfang gibt es hier noch nicht allzuviel zu sehen. Meine Einheiten
stehen fein s&auml;uberlich aufgereiht und warten auf ihre Befehle. Ringsherum
ist noch alles schwarz. Links ist die Kontrolleiste, welche durch Druck auf
die <TAB> Taste allerdings auch nach rechts geschoben werden kann. Auch
diese ist nochmals unterteilt. Ganz oben ist das Zeichen des Staates, den
ich jetzt verk&ouml;rpere. Darunter ist eine verkleinerte Darstellung des
Schlachtfeldes, um einen groben &Uuml;berblick zu haben, wo es im Moment
hergeht.
</P>
<P>
Und dann gibt es noch verschiedene Schalter und Kn&ouml;pfe mit denen man die
Taktiken einstellen, H&auml;user bauen und auch das Spiel speichern oder
verlassen kann. Dies soll ja keine Anleitung sein, deshalb denke ich mir
mal, da&szlig; diese Erkl&auml;rung gen&uuml;gt. Der dritte Teil des Bildschirms befindet
sich ganz unten: hier ist eine Statusleiste, mit der man die wichtigsten
Infos sofort im Blick hat. Aber nun zum Spiel selbst: man bewegt seine
Einheiten &uuml;ber den Bildschirm und wann immer sie auf fremde Einheiten
treffen, gibt es einen Kampf. Dazu ist es vor allen Dingen in den sp&auml;teren
Levels von gravierender Bedeutung, da&szlig; man sich eine Strategie &uuml;berlegt und
nicht blind in die Schlacht rennt. Denn man kann Einheiten nur in einem
gewissen Radius rund um seine Units erkennen. Dieser Teil f&auml;rbt sich dann
hell.
</P>
<P>
Die Karte erweitert sich immer, wenn man &uuml;ber unbekanntes, schwarzes Gebiet
f&auml;hrt. Diesen Teil sieht man dann immer. Aber ob sich dort Gegner befinden,
wei&szlig; man erst, wenn sich dieser Teil auch hell abzeichnet, weil eigene
Truppen in der N&auml;he sind. Also immer aufpassen. In den meisten Levels l&auml;uft
es so ab: man errichtet ein Kraftwerk, eine Mine und eine Raffinerie um
Rohstoffe und so auch Geld zu gewinnen. Mit diesem Geld wiederum lassen
sich verschiedene andere Geb&auml;ude errichten, zum Beispiel zum Bauen neuer
Einheiten. Diese ganzen Geb&auml;ude m&uuml;ssen nat&uuml;rlich gesch&uuml;tzt werden und
gleichzeitig sollte die gestellte Mission - insgesamt 25 auf jeder Seite -
erf&uuml;llt werden. L&auml;&szlig;t sich das Ganze in den ersten Levels noch ganz leicht
angehen, wird es von Mal zu Mal anspruchsvoller.
</P>
<P>
Aber immerhin ist dies ja auch kein Kindergeburtstag sondern der letzte
Weltkrieg!
</P>
<P>
Die Grafik von Earth2140 ist wirklich beeindruckend. Ist ja auch kein
Kunstst&uuml;ck, da Dank des PPC nun eine Aufl&ouml;sung von 800*600 ruckelfrei
m&ouml;glich ist! Aber auch in 640*480 schaut Earth noch gut aus. Aber der PPC
ist schon Pflicht. Zwar lie&szlig;e sich das Spiel auch auf einem 68k Prozessor
spielen, aber selbst auf meinem 060er ist das Ergebniss eher schwach und
reicht nicht an die Geschwindigkeit von Napalm heran. Wer allerdings &uuml;ber
ein PPC Board verf&uuml;gt kann bei diesem Spiel bedenkenlos zugreifen. Hier
stimmt einfach alles: die Grafik ist wie gesagt hervorragend. Die Einheiten
und Geb&auml;ude sind detailreich animiert und die Effekte, wie zum Beispiel die
Explosionen suchen ihres Gleichen auf dem Amiga vergeblich. Aber auch die
Sound FX und vor allem der CD Soundtrack tragen ihren Teil zur
stimmungsvollen Atmosph&auml;re bei. Und dann ist da nat&uuml;rlich noch das Intro
und die Zwischenanimationen zu erw&auml;hnen, die die verschiedenen Levels zu
einer Einheit verschmelzen lassen.
</P>
<P>
<A HREF="img/earth3.jpg"><IMG SRC="thumb/earth3.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Auch der knackige, aber nicht unl&ouml;sbare Schwierigkeitsgrad, das
Vorhandensein von Tipps und Tricks im Internet und verschiedenen
Zeitschriften (da es sich ja um ein etwas &auml;lteres PC Spiel handelt) lassen
f&uuml;r mich nur einen Schlu&szlig; zu:
</P>
<P>
Napalm ist vom Thron verdr&auml;ngt worden! Aber Napalm 2 steht ja schon in den
Startl&ouml;chern.  Und noch ein Wort zum Schlu&szlig;: Dieser Artikel ist gerade in
der aktuellen Ausgabe der AmigaFuture erschienen. Sollte er euch zugesagt
haben, k&ouml;nnt ihr ja mal &uuml;ber ein Abo nachdenken ;-)
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
