<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">

    <TITLE>Delta V</TITLE>
  </HEAD>

  <BODY background="images/bg1.jpg" text="#000000" link="#0000ff"
  alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <CENTER>
            <IMG src="images/bilda.gif" width="300" height="226"
            border="0">
          </CENTER>

          <P>Etwas ungew&ouml;hnliches habe ich einmal heute hier
          f&uuml;r die NoCover: Der Test eines Brettspiels! Delta V
          ist ein Spiel f&uuml;r 2-4 Spielern und im Weltraum
          angesiedelt. Es geht darum in einer fernen Gelaxis
          m&ouml;glichst viele Auftr&auml;ge zu erf&uuml;llen indem
          man auf einem Asteroiteng&uuml;rtel, m&ouml;glichst viele
          gewinnbringende Mineralien abbaut.</P>

          <P>Zu Beginn wird das Spielfeld aufgebaut in einem
          Quadrat von 7X7 Feldern. In der Mitte legte man die
          Raumstation, was praktisch der Dreh und Angelpunkt dieses
          Universums und des gesammten Spiels ist. Von hier starten
          die Raketen wo jeder Spieler zu Beginn genau eine besitzt
          und man sich auf die Raumstation stellt. Vier weitere
          bekommt man ebenso wie f&uuml;nf Bestechungsk&auml;rtchen
          mit den f&uuml;nf verschiedenfarbigen Mineralien, die man
          sich nebenhin legt. Au&szlig;erdem gibt noch verschiedene
          Aufr&auml;ge mit unterschiedlich abgebildeten Mineralien,
          die offen neben der Spielfl&auml;che gelegt werden, damit
          sie jeder einsehen kann. Ist man am Zug, so kann man zwei
          Dinge tun: Man kann nun eine Aktion durchf&uuml;hren und
          versuchen einen Auftrag zu erf&uuml;llen, wobei die
          Aktion aus folgenden M&ouml;glichkeiten bestehen:</P>

          <P>Raketen bewegen - Man bewegt seine Raketen beliebig
          auf verschiedene Asteroitenfelder<BR>
           Sch&uuml;rfen - Man schaut heimlich unter alle Felder wo
          man Raketen stehen hat<BR>
           Spionage - Man dreht ein Bestechungsk&auml;rtchen um und
          schaut sich drei beliebige Karten einer
          zusammenh&auml;ngenden Reihen an<BR>
           Rakete bauen - Man stellt sich eine neue Rakete auf die
          Raumstation</P>

          <CENTER>
            <IMG src="images/bildb.gif" width="360" height="329"
            border="0">
          </CENTER>

          <P>In den ersten Z&uuml;gen bewegt man seine Raketen und
          versucht sich so viele Mineralien, die es in f&uuml;nf
          verschiedene Farben Gelb, Gr&uuml;n, Rot, Blau und Grau
          gibt, zu behalten. Au&szlig;erdem gibt es noch ein
          "Supermineral", was alle anderen ersetzt. Man kann
          gegnerische Raketen auch zerst&ouml;ren, allerdings
          mu&szlig; man daf&uuml;r selbst eine Rakete auf das
          besetzte Asteroitenfeld schicken und opfern, da diese mit
          zerst&ouml;rt wird. Glaubt man zu wissen, wo sich die
          verlangten Minaralien befinden, so kann man versuchen
          einen Aufrag zu erf&uuml;llen und dreht, nachdem man
          angek&uuml;ndigt hat welchen man erf&uuml;llen
          m&ouml;chte, nach und nach K&auml;rtchen herum, bis alle
          abgebildeten Farben zusammen sind. Diese werden
          anschlie&szlig;en mit dem jeweiligen Auftrag aus dem
          Spiel genommen und bekommt der Spieler, denn sie werden
          sp&auml;ter f&uuml;r die Punktez&auml;hlung
          ben&ouml;tigt, denn jedes Mineral z&auml;hlt
          unterschiedlich viele Punkte. Ist allerdings ein Mineral
          falsch, so legt er den Auftrag zur&uuml;ck und alle
          anderen Spieler sind um einige Erfahrungen reicher. Durch
          den Einsatz einer Bestechungkarte kann ein anderer
          Spieler versuchen sich ein Extraminaral abzustauben,
          indem er ein entsprechen farbiges Mineral der
          zugeh&ouml;rigen Bestechungskarte herumdreht. Jede
          Bestechungskarte kann nur einmal verwendet werden und
          bringt dem Spieler am ende des Spiel zwei Minuspunkte
          ein.</P>

          <P>Nun gibt es aber nicht nur Mineralien, sondern auch
          Ereignisfelder unter den Karten. Das geht vom Bau einer
          extra Rakete &uuml;ber Sabotage bis hin zu einem Alien,
          mit dem man gegnerische Raketen und Asteroiten
          au&szlig;er Gefecht setzen und dem Mitspieler eine
          Bestechungskarte klauen kann. Sind alle f&uuml;nf Aliens
          aufgedeckt, keine Asteroitenkarten mehr &uuml;brig, oder
          alle Auftr&auml;ge erf&uuml;llt, so ist des Spiel vorbei
          und wer die meisten Punkte hat ist der Sieger.</P>

          <P><B>FAZIT:</B> F&uuml;r die einen ist es Delta V,
          f&uuml;r anderen Memory II, denn wenn man sich nicht das
          Feld so gut wie m&ouml;glich einpr&auml;gt, dann hat man
          schon so gut wie verloren. Vieles ist zwar geklaut aus
          anderen Spielen, doch die Mischung stimmt, denn die
          Regeln passen auf zwei Seiten und so ist das Spiel auch
          relativ schnell erlernt. Dalta V ist allerdings kein
          Spiel mit man den ganzen Abend verbringen kann, denn
          daf&uuml;r ist die Spieldauer einfach zu kurz. Einige
          Dinge sind mir ebenso nicht ganz klar geworden. Dadurch
          da&szlig; man durch den Einsatz der Bestechungskarten
          Minuspunkte bekommt, setzt man sie entsprechend sparsam
          ein und das klauen von diesen Karten durch den Alien
          bringt einem eigendlich gar nichts, weil sie sowieso
          liegen bleiben. Auch das zerst&ouml;ren gegnerischer
          Raketen ist zwar m&ouml;glich, aber unsinnig weil das
          einem keinen Vorteil verschafft wenn man daf&uuml;r eine
          seiner Raketen opfert. Doch diese Kleinigkeiten sollten
          keinem davon abhalten viel Spa&szlig; mit Delta V zu
          haben, denn Regeln sind ja flexsiebel...</P>

          <P>Thomas Weber</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

