<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<TITLE>Buchbesprechungen</TITLE>
</HEAD>

<BODY background="images/bgb.gif" text="#000000" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="Seitenlayout mit Rand">
<TR>
<TD>
<P align="center"><FONT color="#000080" size="7"><B>Buchbesprechungen</B></FONT></P>
<A name="top"></A> 

<H3><B>Inhalt:</B></H3>

<UL>
<LI><A href="#a01">Der wiedergefundene Freund</A></LI>
<LI><A href="#a02">Dienstags bei Morrie</A></LI>
<LI><A href="#a03">Die Dunkelheit, die niemand kennt</A></LI>
<LI><A href="#a04">Der s&auml;chsische Gro&szlig;vater</A></LI>
<LI><A href="#a05">Der Mandarin von Niosan</A></LI>
<LI><A href="#a06">Die Br&uuml;cken der Freiheit</A></LI>
<LI><A href="#a07">Dunkel</A></LI>
<LI><A href="#a08">Nightvision</A></LI>
<LI><A href="#a09">Nostradamus</A></LI>
<LI><A href="#a10">Das Testament</A></LI>
<LI><A href="#a11">Sara</A></LI>
<LI><A href="#a12">Feuerkind</A></LI>
<LI><A href="#a13">Der Sch&uuml;ler Gerber</A></LI>
<LI><A href="#a14">Das Teufelsloch</A></LI>
<LI><A href="#a15">Die Zwillinge</A></LI>
<LI><A href="#a16">Der kleine Prinz</A></LI>
<LI><A href="#a17">Hierzulande andernorts</A></LI>
<LI><A href="#a18">Durch die W&uuml;ste</A></LI>
</UL>
<HR>
<A name="a01"></A> 

<H3>Buchtitel: Der wiedergefundene Freund<BR>
Autor: Uhlman, Fred<BR>
Vorgestellt von: rita<BR>
Verlag: Diogenes<BR>
Erscheinungsjahr: 1998<BR>
Gesamtseitenzahl: 115<BR>
ISBN: 3257231016<BR>
Format: Schwarzschrift</H3>

<P><B>Inhalt:</B><BR>
Dieses kleine Taschenbuch erz&auml;hlt vom Leben zweier Jungen, die eng
befreundet waren. Nach und nach schleicht sich der Judenhass in die
ehemalige Freundschaft. Diese ist entzweit, doch der entt&auml;uschte Jude
wird am Ende des Buches freudig &uuml;berrascht.</P>

<P><B>Anmerkungen:</B><BR>
Ein leicht geschriebener, zum Nachdenken anregender Roman, den es - soweit
mir bekannt - nicht in den H&ouml;rb&uuml;chereien gibt. Ich habe den Roman
eingescannt, aber nicht korrigiert.</P>

<P><B>Empfehlung:</B></P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a02"></A> 

<H3>Buchtitel: Dienstags bei Morrie<BR>
Autor: Albom, Mitch<BR>
Vorgestellt von: rita<BR>
Verlag: Goldmann<BR>
Erscheinungsjahr: 1998<BR>
Gesamtseitenzahl: 217<BR>
ISBN: 3442451752<BR>
Format: H&ouml;rbuch</H3>

<P><B>Inhalt:</B><BR>
Ein Professor erf&auml;hrt, dass er an einer t&ouml;dlichen Erkrankung
leidet. Durch Zufall nimmt sein ehemaliger Lieblingsstudent Kontakt zu ihm
auf.</P>

<P>Sie treffen sich - wie bereits zu seinen Studienzeiten - Dienstags bei
Morrie, um &uuml;ber die wesentlichen Dinge des Lebens zu plaudern. Das
Buch besteht aus Gespr&auml;chen, aber auch in dem Fortlauf der Erkrankung
von Morrie wird der Leser auf unaufdringliche Weise einbezogen.</P>

<P><B>Anmerkungen:</B><BR>
Das Buch gibt es in den verschiedensten H&ouml;rb&uuml;chereien. Die
Arbeitsgemeinschaft der Blindenh&ouml;rb&uuml;chereien gibt unter
06421/6858015 gerne Auskunft.</P>

<P><B>Empfehlung:</B></P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a03"></A> 

<H3>Buchtitel: Die Dunkelheit, die niemand kennt<BR>
Autor: Liedermann, Manon<BR>
Vorgestellt von: rita<BR>
Verlag: Bastei L&uuml;bbe / DZB Leipzig<BR>
Erscheinungsjahr: 1998<BR>
Gesamtseitenzahl: 237<BR>
ISBN: 3404614151<BR>
Format: Punktschrift</H3>

<P><B>Inhalt:</B><BR>
Eine blinde Sch&uuml;lerin hatte im Rahmen der Blista-Schulausbildung ein
Gastjahr in Amerika. Ihr Gastvater vergewaltigte sie mehrfach. Das Buch
schildert ihre Lebensgeschichte vor, w&auml;hrend und nach der Amerikazeit.
Das Buch zeigt in einer f&uuml;r mich sehr beeindruckenden Weise den Kampf,
den Manon durchlebt, um ihre schrecklichen Erfahrungen - ohne
M&auml;nnerhass -zu verarbeiten. Soviel sei vorweg erz&auml;hlt: Die
Reaktionen - sowohl der Blista - als auch der Gastschule in Amerika -
erleichterten Manon nicht gerade die Verarbeitung.</P>

<P><B>Anmerkungen:</B><BR>
Das Buch - dass bereits vergriffen ist und somit nur noch &uuml;ber Ebay
oder Amazon zu haben ist, gibt es auch als H&ouml;rbuch - z. B. in
M&uuml;nchen - oder als Punktschriftbuch in der DZB.</P>

<P><B>Empfehlung:</B></P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a04"></A> 

<H3>Buchtitel: Der s&auml;chsische Gro&szlig;vater<BR>
Autor: Hagelstange, Rudolf<BR>
Vorgestellt von: nathalie<BR>
Verlag: Paul-List-Verlag M&uuml;nchen/CfB Hamburg<BR>
Erscheinungsjahr: 1979<BR>
Gesamtseitenzahl: 62<BR>
ISBN:<BR>
Format: Punktschrift</H3>

<P><B>Inhalt:</B><BR>
Der Ich-Erz&auml;hler erlebt nach dem Tode seines s&auml;chsischen
Gro&szlig;vaters diesen, vor allem in seinen Tr&auml;umen, so lebendig, als
w&auml;re der Gro&szlig;vater noch da und immer an seiner Seite. Er stellt
sich dann vor, wie es wohl w&auml;re, wenn der Gro&szlig;vater noch einmal
f&uuml;r eine Woche auf die Erde zur&uuml;ckk&auml;me. Diese fiktive Woche
mit dem Gro&szlig;vater wird dem Leser anschaulich geschildert: seine
T&auml;tigkeit im Eisenbahndienst, das Leben in der Familie und mit der
Gro&szlig;mutter, die auch dadurch wieder lebendig wird usw. Sie, der
Gro&szlig;vater und der Enkel, stellen sich vor, dass sie diese eine Woche
-7 Tage - wie sieben Jahre leben, gemeinsam (er)leben wollen.</P>

<P><B>Anmerkungen:</B><BR>
Ich finde das Buch recht unterhaltend und innig geschrieben.</P>

<P><B>Empfehlung:</B></P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a05"></A> 

<H3>Buchtitel: Der Mandarin von Niosan<BR>
Autor: Hafner, Ambrosius<BR>
Vorgestellt von: nathalie<BR>
Verlag: Arena W&uuml;rzburg/Blindenschriftverlag
Paderborn<BR>
Erscheinungsjahr:<BR>
Gesamtseitenzahl: 166<BR>
ISBN:<BR>
Format: Punktschrift</H3>

<P><B>Inhalt:</B><BR>
In diesem Buch erf&auml;hrt man Einzelheiten &uuml;ber das Leben der ersten
Christen in Koreea, ihre K&auml;mpfe, beschwerlichen Wege und
R&uuml;ckschl&auml;ge.</P>

<P>Ein Vetter des erw&auml;hnten Mandarin von Niosan geh&ouml;rt zu den
ersten Christen in Korea und berichtet dar&uuml;ber.</P>

<P><B>Anmerkungen:</B><BR>
Ich finde es sehr anschaulich geschreiben. Da ich noch wenig &uuml;ber
Korea gelesen hatte, bisher, hat mir dieses Buch das Land, seine Geschichte
und sein Brauchtum etwas n&auml;hergebracht.</P>

<P><B>Empfehlung:</B></P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a06"></A> 

<H3>Buchtitel: Die Br&uuml;cken der Freiheit<BR>
Autor: Follett, Ken<BR>
Vorgestellt von: bianka<BR>
Verlag: L&uuml;bbe<BR>
Erscheinungsjahr: 1998<BR>
Gesamtseitenzahl: 544<BR>
ISBN: 340412815X<BR>
Format: digital</H3>

<P><B>Inhalt:</B><BR>
Das Buch erz&auml;hlt die Geschichte eines freiheitsliebenden
Bergarbeiters, der durch das schottische Rechtssystem im 18. Jahrhundert
faktisch zum Sklaven wird, und einer verarmten Tochter aus dem Adel, die
sich in der ihr zugedachten Rolle gefangen f&uuml;hlt. Nach vielen
Abenteuern, Irrungen und Wirrungen gelangen beide nach Amerika. Vielleicht
warten ja dort Gl&uuml;ck und Freiheit auf sie.</P>

<P><B>Anmerkungen:</B><BR>
Sch&ouml;ne, spannende Fluchtlekt&uuml;re ... ein M&auml;rchen, in dem man
schon wei&szlig;, wie es ausgeht. Der Weg dahin ist jedoch sehr spannend.
Au&szlig;erdem ist das Buch - soweit ich das beurteilen konnte - gut
rcherchiert. Genau die richtige Unterhaltung f&uuml;r lange Winterabende
oder Zeiten, in denen man sich einfach ablenken m&ouml;chte.</P>

<P><B>Empfehlung:</B><BR>
Ich empfehle es jedem, der sich anspruchsvoll unterhalten lassen m&ouml;chte.</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a07"></A> 

<H3>Buchtitel: Dunkel<BR>
Autor: Hohlbein Wolfgang<BR>
Vorgestellt von: Coni<BR>
Verlag: L&uuml;bbe<BR>
Erscheinungsjahr: 2001<BR>
Gesamtseitenzahl: 479<BR>
ISBN: 3404144783<BR>
Format: Audio</H3>

<P><B>Inhalt:</B><BR>
Jan ist 32 und kerngesund. Umso merkw&uuml;rdiger ist es, als er einmal im
Kino einen Herzstillstand bekommt und nur knapp &uuml;berlebt. Doch damit
nicht genug.</P>

<P>Pl&ouml;tzlich sieht Jan sich von Schatten umgeben, Schatten, mit denen
er nicht viel anfangen kann. Er erinnert sich nur, dass sein Vater sie im
Sterben "Die Dunklen" genannt hat.</P>

<P>So kommt es, dass er kurz darauf beinahe von einer Stra&szlig;enbahn
&uuml;berfahren worden w&auml;re, wenn nicht ein M&auml;dchen namens Vera
ihn gerettet h&auml;tte.</P>

<P>Vera ist merkw&uuml;rdig. Sie behauptet 912 Jahre alt zu sein und
besitzt fahle Augen wie ein Vampir.</P>

<P>Auf der anderen Seite ist da ein unheimlicher dunkler Schatten, der
anf&auml;ngt Jan und seine Angeh&ouml;rigen zu verfolgen.</P>

<P>Jan bittet seinen Bruder, der Journalist ist, sich genauer &uuml;ber das
Kino zu erkundigen, in dem er den Herzanfall hatte, denn genau dieses Kino
m&ouml;chte, dass er unterschreibt, dass es nichts damit zu tun hat.</P>

<P>Jans Bruder wird bald darauf tot aufgefunden. Herzstillstand...</P>

<P><B>Anmerkungen:</B><BR>
Ich fand das Buch cool, weil st&auml;ndig was passiert ist. Es gab
eigentlich kaum eine Spur von Langatmigkeit, eher zuviel Action, aber es
war echt cool und die Art, wie es geschrieben ist, ist super. Das einzige,
was ich etwas makaber fand, war der Schluss, aber lest selbst!</P>

<P><B>Empfehlung:</B><BR>
F&uuml;r Fantasy-Freaks und solche, die's werden wollen: unbedingt lesen!</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a08"></A> 

<H3>Buchtitel: Nightvision<BR>
Autor: Munson Ronald<BR>
Vorgestellt von: Coni<BR>
Verlag: L&uuml;bbe, Berg.-Gladb.<BR>
Erscheinungsjahr: 1998<BR>
Gesamtseitenzahl: 521<BR>
ISBN: 3404127749<BR>
Format: Digital</H3>

<P><B>Inhalt:</B><BR>
Die Schauspielerin Susan bekommt w&auml;hrend eines Szenendrehs eine
Panikattacke, woraufhin sie von einem Psychologen namens David Hightower
untersucht und in eine psychiatrische Klinik eingewiesen wird, was ihr zum
Verh&auml;ngnis wird, denn ein Computerhacker und Susan-Fanatiker bringt
mit Hilfe seiner Computerkenntnisse die Klinik in seine Gewalt.</P>

<P><B>Anmerkungen:</B><BR>
Das ist nicht einfach irgendeine Geiselnahme, es ist ein richtig gutes
Buch, bei dem nichts fehlt, nicht mal die Lovestory.</P>

<P><B>Empfehlung:</B><BR>
Echt lesenswert!</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a09"></A> 

<H3>Buchtitel: Nostradamus<BR>
Autor: Centurio, Dr. N. Alexander<BR>
Vorgestellt von: Karin<BR>
Verlag: Turm Verlag<BR>
Erscheinungsjahr: 1977<BR>
Gesamtseitenzahl: 292<BR>
ISBN: 3-7999-0179-5<BR>
Format: digital</H3>

<P><B>Inhalt:</B><BR>
Vorhersagen f&uuml;r Vergangenheit und Zukunft des Michael Nostradamus,
Astrologe und Pestarzt. Er lebte vor ca. 430 Jahren und hat in Versform
(Vierzeiler) die Zukunft bis ca. zum Jahr 3800 vorhergesagt.</P>

<P><B>Anmerkungen:</B></P>

<P><B>Empfehlung:</B><BR>
Wenn man Interesse an Astrologie hat, ist dieses Buch ein "Muss".</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a10"></A> 

<H3>Buchtitel: Das Testament<BR>
Autor: Grisham, John<BR>
Vorgestellt von: Bitschreck<BR>
Verlag: Heyne<BR>
Erscheinungsjahr: 2001<BR>
Gesamtseitenzahl: 492<BR>
ISBN: 3453190025<BR>
Format: Digital</H3>

<P><B>Inhalt:</B><BR>
(Aus dem Klappentext)<BR>
"Troy Phelan ist ein milliardenschwerer Exzentriker, der des Lebens
m&uuml;de ist.</P>

<P>Doch nicht so m&uuml;de, dass er sein Imperium kampflos seinen
geldgierigen Erben &uuml;berlassen w&uuml;rde. Bevor er sich aus dem
dreizehnten Stock st&uuml;rzt, verf&uuml;gt er, dass sein gesamtes
Verm&ouml;gen an seine bis dato v&ouml;llig unbekannte uneheliche Tochter
Rachel geht. In der Phelan-Familie bricht ein Sturm der Entr&uuml;stung
los, und es wird sofort alles in Bewegung gesetzt, um das Testament
anzufechten.</P>

<P>Unterdessen versucht der ehemalige Staranwalt Nate O'Riley, mit dessen
Karriere es schon seit Jahren bergab geht, die legitime Erbin aufzutreiben.
Doch wie Rachel finden, die irgendwo im unzug&auml;nglichen brasilianischen
Regenwald als Missionarin arbeitet? Als O'Riley nach einer abenteuerlichen
und lebensgef&auml;hrlichen Reise schlie&szlig;lich zu ihr gelangt, scheint
alles umsonst gewesen zu sein - Rachel interessiert sich nicht f&uuml;r das
Erbe ihres Vaters, daf&uuml;r um so mehr f&uuml;r die Lebensgeschichte von
Nate. Doch die Zeit l&auml;uft. Wenn O'Riley Rachel nicht umzustimmen
vermag, f&auml;llt das gesamte Verm&ouml;gen in die H&auml;nde des
uners&auml;ttlichen Phelan-Clans."</P>

<P><B>Anmerkungen:</B><BR>
In diesem Roman verkn&uuml;pft Grisham in gelungener Weise seine fundierten
Kenntnisse &uuml;ber anwaltliche T&auml;tigkeiten mit Abenteuern in
Entwicklungsgebieten.</P>

<P>Der Held dieser Geschichte ist ein erfahrener Anwalt, dessen
Alkoholprobleme ihn bereits nahe an seinen pers&ouml;nlichen Abgrund
gef&uuml;hrt haben.</P>

<P>Die spannende Lekt&uuml;re bringt den Leser auch dazu, &uuml;ber Gott
und den Sinn einiger Dinge im Leben nachzudenken. Sind wirklich alle
Handlungen so wichtig, wie wir es immer annehmen?</P>

<P><B>(aus dem Klappentext)</B><BR>
"Der Autor JOHN GRISHAM, geboren 1955, ist der meistgelesene
Bestsellerautor weltweit. Mit seinem Thrillerdeb&uuml;t &raquo;Die
Firma&laquo; begann seine ph&auml;nomenale Erfolgsgeschichte.</P>

<P>Zahlreiche seiner Romane dienten als Vorlage zu Hollywoodfilmen, die
allesamt zu Kassenschlagern wurden. Grisham war Abgeordneter im Parlament
des US-Bundesstaates Mississippi und f&uuml;hrte lange Jahre eine eigene
Anwaltskanzlei, bis er sich seit Mitte der achtziger Jahre ganz dem
Schreiben widmete. Er lebt mit seiner Familie in Virginia und
Mississippi.</P>

<P><B>Empfehlung:</B><BR>
Ein spannendes Buch, durch welches ich zum Nachdenken angeregt wurde. Es
sollte noch viele derartige Romane geben.</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a11"></A> 

<H3>Buchtitel: Sara<BR>
Autor: King, Stephen<BR>
Vorgestellt von: Bitschreck<BR>
Verlag: Wilhelm Heyne Verlag GmbH &amp; Co. KG, M&uuml;nchen<BR>
Erscheinungsjahr: 1998<BR>
Gesamtseitenzahl: 443<BR>
ISBN: 3-453-14297-7<BR>
Format: Digital</H3>

<P><B>Inhalt:</B><BR>
Am Anfang des Romans wird in sehr trauriger Weise erz&auml;hlt, wie der
Held, ein Schriftsteller, seine Frau verliert.</P>

<P>Dieser Verlust l&ouml;st bei ihm eine Schreibblockade aus. Nach einiger
Zeit f&auml;hrt er wieder einmal in das Sommerhaus, in dem er mit seiner
Frau viel Zeit verbracht hatte. Bald beginnen hier die mystischen
Verwicklungen und er versteht, dass nicht er das Haus ausgesucht hatte,
sondern das Haus, "Sara" ihn.</P>

<P><B>Anmerkungen:</B><BR>
Ein Horror-Roman, in Stephen King Manier.</P>

<P><B>Empfehlung:</B><BR>
Wer sich ein bissel gruseln m&ouml;chte, sollte diese, anunf&uuml;rsich
leichte Lekt&uuml;re ruhig lesen.</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a12"></A> 

<H3>Buchtitel: Feuerkind<BR>
Autor: King Stephen<BR>
Vorgestellt von: Eowyn<BR>
Verlag: Bastei - L&uuml;bbe<BR>
Erscheinungsjahr: 1980<BR>
Gesamtseitenzahl: 479<BR>
ISBN: 3-404-13001-4<BR>
Format: Digital</H3>

<P><B>Inhalt:</B><BR>
Andy befindet sich mit seiner erst sieben Jahre alten Tochter Charlie auf
der Flucht.</P>

<P>Auf der Flucht vor den M&auml;nnern in dem gr&uuml;nen Wagen - und das
nun schon seit fast einem Jahr.</P>

<P>Vor vielen Jahren, als Charlie noch nicht geboren und Andy noch nicht
verheiratet war, nahm er mit seiner zuk&uuml;nftigen Frau an einem
Experiment seiner Universit&auml;t teil. Zumindest hatte es erst den
Anschein, als w&auml;re allein die wissenschaftliche Abteilung daf&uuml;r
zust&auml;ndig, doch stellte sich bald heraus, dass "die Firma" hinter
allem steckte, eine geheime Organisation deren Namen allein wenigen bekannt
ist.</P>

<P>Hier bekommen mehrere Probanden eine - wie ihnen gesagt wird - schwach
halozinogene Droge verabreicht. Andy und die Frau, die er sp&auml;ter - was
er zu diesem Zeitpunkt noch nicht wei&szlig; - heiraten wird, erleben eine
menge unheimlicher Vorg&auml;nge, die allerdings schnell von den
&Auml;rzten und schlie&szlig;lich auch von ihnen als Halozinationen abgetan
werden. Das v&ouml;llige Ausrasten eines jungen Probanden, das Sterben
eines anderen...</P>

<P>Wenige Zeit sp&auml;ter stellt Andy jedoch fest, dass er und seine Frau
au&szlig;ergew&ouml;hnliche F&auml;higkeiten entwickeln. Sie ist in
geringem ma&szlig;e zur Telekinese f&auml;hig, Andy zur Telepathie. Er
vermag Menschen zu beeinflussen und zu steuern.</P>

<P>So mag es wohl nicht verwunderlich sein, dass Charlie, die Tochter der
beiden ebenfalls au&szlig;ergew&ouml;hnlich ist. Ihre F&auml;higkeiten sind
jedoch weit st&auml;rker und wie sich herausstellen soll, weitaus
fataler.</P>

<P>Denn Charlie ist ein Feuerkind. Sie vermag allein mit Hilfe ihres
Willens Dinge anzuz&uuml;nden, kann diese F&auml;higkeit jedoch noch nicht
recht steuern.</P>

<P>Die Firma erf&auml;hrt nicht nur von den F&auml;higkeiten Andys und
seiner Frau, sondern auch von dem au&szlig;ergew&ouml;hnlichen Kind, und
wie nach einer Waffe, nach einem Instrument, welches ihnen unglaubliche
macht verleihen k&ouml;nnte, beginnen sie, Andy und seine Tochter zu jagen,
um sie zu weiteren Forschungszwecken in ihr Quartier zu bringen.</P>

<P><B>Anmerkungen:</B><BR>
Dieses Buch bietet einem den Ansto&szlig;, sich &uuml;ber einige
Moralvorstellungen Gedanken zu machen. Zwischendurch kommt Charlie immer
wieder in eine Situation, in der sie sich entscheiden muss, ob sie sich und
ihren Vater mit ihrer F&auml;higkeit verteidigt. Jedes Mal, wenn Andy seine
kr&auml;fte nutzt, fordern sie schrecklichen Tribut, doch ein zum Anfang
der Geschichte 7-J&auml;hriges M&auml;dchen wird schwer damit fertig, jedes
Mal menschen zu t&ouml;ten, wenn es seine F&auml;higkeiten einsetzt, denn
meist l&auml;uft es unweigerlich darauf hinaus.</P>

<P>Des Weiteren denkt man &uuml;ber die Frage nach, wie hochwertig die
Moral einer Regierung sein kann - denn Die "Firma" ist eine
Regierungsorganisation (wenn auch fiktiv) -, die einerseits solche
Experimente an Menschen vornimmt, m&ouml;gen sie auch freiwillige sein, und
andererseits lebende Menschen rein als Objekt der wissenschaftlichen
Untersuchung ansieht und so ein Wesen geschaffen hat, das m&auml;chtiger
sein k&ouml;nnte, als alle technologischen Waffen, die es je gab oder geben
wird.</P>

<P><B>Empfehlung:</B><BR>
Ein Buch, das nicht den f&uuml;r Stephen King typischen Horror zu bieten
hat. Sehr im Vordergrund stehen hier die beiden Hauptpersonen, die
Beziehung zwischen Vater und Tochter unter solchen Umst&auml;nden und die
bereits erw&auml;hnte Moral des ganzen. Jedoch hat der Leser selbst genug
Freiheit, sich sein eigenes Urteil zu bilden.</P>

<P>Aber wie dieses auch aussehen mag, die beiden Hauptfiguren sind
plastisch dargestellt, und es handelt sich eindeutig um Menschen, nicht um
die "Helden" eines Romans.</P>

<P>Auf jeden Fall lesenswert.</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a13"></A>

<H3>Buchtitel: Der Sch&uuml;ler Gerber <BR>
Autor: Torberg, Friedrich <BR>
Vorgestellt von: Gonda <BR>
Verlag: dtv M&uuml;nchen <BR>
Erscheinungsjahr: 1992 <BR>
Gesamtseitenzahl: 291 <BR>
ISBN: 3-552-02334-8 <BR>
Format: digital </H3>

<P><B>Inhalt: </B><BR>

Roman um den Sch&uuml;ler Kurt Gerber, der kurz vor dem Abi - oder, wie zum
Zeitpunkt der Story ausgedr&uuml;ckt, vor der Matura - steht. Dieses letzte
Jahr durchlebt der Leser mit dem Sch&uuml;ler, seiner Klasse und vor allem
seinem Lehrer gemeinsam. </P>

<P><B>Der Klappentext: </B><BR>

"Das ist kein Schulroman mehr, das ist ein hellsichtiger, &uuml;berwacher,
vision&auml;rer Durchblick ins Gesamtbild unseres Daseins. Das R&auml;tsel
"Schule" wird nach allen Richtungen hin in das gr&ouml;&szlig;ere
R&auml;tsel "Leben" eingebaut. Und damit leistet der tapfere Roman mehr an
Erkenntnis, als wenn er mit groben Tendenzen und Reformversuchen
dreinf&uuml;hre." </P>

<P><B>Anmerkungen: </B><BR>

Ein wirklich au&szlig;ergew&ouml;hnliches Buch, in dem nicht einfach nur
eine Oberstufensch&uuml;lertrag&ouml;die dargestellt wird. Wer das Buch
einfach nur als Sch&uuml;lerstory lesen will, kommt sicherlich auf seine
Kosten. Wer aber genauer den Charakter von Kurt Gerber analysieren will,
der bemerkt sehr schnell, dass dieses Buch ein &auml;u&szlig;erst scharfer
Spiegel der verschiedenen Formen von Macht in unserer Gesellschaft ist.
Einerseits wird dem Sch&uuml;ler Gerber die offen zutage tretende Macht
seines Lehrers - Kupfer, Gott mbH -zuteil, andererseits wird er im Laufe
des Buches immer wieder mit der anonymen Macht seines Vaters konfrontiert
("mach mir keine Schande"). </P>

<P><B>Empfehlung: </B></P>

<A href="#top">zum Inhaltsverzeichnis</A>

<HR>

<A name="a14"></A>

<H3>Buchtitel: Das Teufelsloch <BR>
Autor: Hohlbein, Wolfgang <BR>
Vorgestellt von: Coni <BR>
Verlag: Verlag Carl Ueberreuter, Wien <BR>
Erscheinungsjahr: 1999 <BR>
Gesamtseitenzahl: 292 <BR>
ISBN: 3-8000-2584-1 <BR>
Format: digital </H3>

<P><B>Inhalt: </B></P>

<P><B>Klappentext: </B><BR>

"Devil's Hole, eine Mine, in der Eisen abgebaut wird, verdient ihren Namen
zu Recht. Denn seltsame Kreaturen verbergen sich in ihrem Inneren.
Kreaturen, die nur darauf warten, ans Licht zu kommen. </P>

<P>Als der Bergbauingenieur Harrison in einen vor langer Zeit stillgelegten
Stollen hinabsteigt, findet er einen Toten und ein Labyrinth von
G&auml;ngen und H&ouml;hlen. Diese scheinen viel &auml;lter als die
restliche Mine zu sein. An den W&auml;nden findet Harrison Bilder von
Kreaturen wieder, die zuvor bereits seine Tr&auml;ume verw&uuml;steten. Und
ein Ungeheuer, das selbst seine furchtbarsten Albtr&auml;ume
&uuml;bertrifft ..." </P>

<P><B>Anmerkungen: </B><BR>

Der Schluss ist etwas makaber, aber gerade das hat was f&uuml;r sich ... </P>

<P><B>Empfehlung: </B></P>   
<A href="#top">zum Inhaltsverzeichnis</A>
<HR>
<A name="a15"></A>

<H3>Buchtitel: Die Zwillinge <BR>
Autor: Loo, Tessa de <BR>
Vorgestellt von: bianka <BR>
Verlag: btb/Goldmann Verlag M&uuml;nchen <BR>
Erscheinungsjahr: 1997 <BR>
Gesamtseitenzahl: 477 <BR>
ISBN: 344272161X <BR>
Format: Punktschrift/H&ouml;rbuch </H3>

<P><B>Inhalt: </B> <BR>
Anna und Lotte sind Zwillinge, treffen sich als alte Frauen wieder,
zuf&auml;llig in einem belgischen Badeort. - Die eine ist in den Niederlanden,
die andere in Deutschland aufgewachsen. - Die beiden Frauen erz&auml;hlen sich
ihre Lebensgeschichten und dabei wird die ganze Tragweite der
unterschiedlichen Wahrnehmungen des 2. Weltkrieges in Deutschland und den
Niederlanden deutlich. Ein ergreifendes Buch, das auch vor allem in den
Niederlanden mit seinem reflektierten Deutschlandbild f&uuml;r Aufsehen sorgte.
Doch auch uns Deutschen hilft es, die Niederl&auml;nder und ihr gespaltenes
Verh&auml;ltnis zu Deutschland etwas besser zu verstehen. </P>

<P><B>Anmerkungen: </B><BR>
Die &Uuml;bersetzung ist laut eines ehemaligen Kommilitonen von mir, der sie mit
dem Originalwerk verglichen hat, auch sehr gut gelungen. </P>

<P><B>Empfehlung:</B></P> 
<A href="#top">zum Inhaltsverzeichnis</A>
<HR>
<A name="a16"></A>

<H3>Buchtitel: Der kleine Prinz <BR>
Autor: Saint-Exupéry, Antoine de <BR>  
Vorgestellt von: Heiko <BR>            
Verlag: Volk und Welt, Berlin / DZB Leipzig <BR>
Erscheinungsjahr: 1993 <BR>            
Gesamtseitenzahl: 123 <BR>
ISBN: Bestell-Nr DZB: 1301 <BR>        
Format: Punktschrift </H3>

<P><B>Inhalt:</B><BR>
Mit einer Motorpanne landet und strandet ein einsamer Pilot in der Sahara.
Dort trifft er auf den kleinen Prinzen. Dieser ist ebenfalls einsam. Er
kommt aus dem All und entf&uuml;hrt den Ich-Erz&auml;hler in eine Welt voller
bizarrer Gestalten und Geschichten. Er erz&auml;hlt von seinem winzigen
Planeten, auf dem er allein mit einer eitlen Blume lebte. Er berichtet von
einem K&ouml;nig, der von sich glaubte, das gesamte Universum zu beherrschen,
der aber doch nur ohne jeden Besuch auf seinem Stern allein blieb. </P>

<P>Verwundert erinnert er sich an einen Laternenanz&uuml;nder, dessen Planet
sich zunehmend beschleunigte, so dass ein Tag nur noch eine Minute dauerte
- der Laternenanz&uuml;nder musste also jede Minute seine Laterne anz&uuml;nden und
wieder l&ouml;schen und hatte keinen Moment der Ruhe mehr. Ruhe und Zeit finden
die beiden Protagonisten in der W&uuml;ste - viel Ruhe und Zeit f&uuml;r die
Fantasie. Und pl&ouml;tzlich sind sie beide nicht mehr einsam - sondern Freunde. </P>

<P><B>Anmerkungen: </B><BR>
Dieses poetische M&auml;rchen ist so unglaublich beeindruckend, weil jeder Satz
so einfach daherkommt, aber immer voller Menschlichkeit und Wahrheit
steckt. Saint-Exupérys literarisches Meisterwerk zieht seine Leser in die
fantastische und gleichzeitig melancholische Welt der Kinder. Es zeigt dem
erwachsenen Leser aber auch, wie nah uns diese wundersch&ouml;ne Welt noch sein
kann, wenn wir nicht aufh&ouml;ren zu tr&auml;umen. Wie sagt der kleine Prinz doch
zum Abschied zu seinem neuen Freund? "Wenn Du bei Nacht den Himmel
anschaust, wird es Dir sein, als lachten alle Sterne, weil ich auf einem
von ihnen wohne, weil ich auf einem von ihnen lache. Du allein wirst Sterne
haben, die lachen k&ouml;nnen!" Na, was will man mehr? </P>

<P><B>Empfehlung: </B><BR>
Eine traurig-fr&ouml;hliche Pflichtlekt&uuml;re! </P>
<A href="#top">zum Inhaltsverzeichnis</A>
<HR>
<A name="a17"></A>

<H3>Buchtitel: Hierzulande andernorts <BR>
Autor: Wolf, Christa <BR>                  
Vorgestellt von: Heiko <BR>                
Verlag: Luchterhand, M&uuml;nchen / DZB Leipzig <BR>
Erscheinungsjahr: 2001 <BR>                
Gesamtseitenzahl: 291 <BR>                 
ISBN: 3-630-86998-x <BR>                   
Format: Punktschrift </H3>

<P><B>Inhalt: </B><BR>
Dieser Band vereint kurze Erz&auml;hlungen, Zeitungsartikel und Reden von
Christa Wolf. In einigen von ihnen verarbeitet die Autorin ihre Erfahrungen
in den Vereinigten Staaten, in die sie nach der deutschen Wiedervereinigung
f&uuml;r einige Jahre zog. Sie schreibt von der dort wiedergefundenen Freiheit -
nachdem die bekennende Sozialistin zuvor in Deutschland, wegen ihrer Rolle
in der DDR, &ouml;ffentlichen Anfeindungen ausgesetzt war -, beschreibt aber
auch das Leben der Menschen in den USA, das von Massenmedien,
Wirtschaftsdruck und Armut gekennzeichnet sei. </P>

<P>In anderen Texten w&uuml;rdigt sie bedeutende Autoren des 20. Jahrhunderts,
von denen viele Weggef&auml;hrten Wolfs waren. Darunter sind G&uuml;nter Grass,
Heinrich B&ouml;ll und Lew Kopelew. Sie verortet sie und viele weitere K&uuml;nstler
in ihre Zeit, setzt deren Werke in Bezug zu der Gesellschaft von einst und
der von heute und l&auml;sst den Leser teilhaben an ihren ganz pers&ouml;nlichen
Erfahrungen mit ihnen. </P>

<P>Schlie&szlig;lich versucht Christa Wolf in "Hierzulande andernorts" eine
Selbstbestimmung im vereinten Deutschland - literarisch wie individuell.
R&uuml;ckblickend versucht sie die inneren Spannungen innerhalb der DDR zu
benennen, um aus ihnen den Zusammenbruch des Staates besser zu verstehen.
Schlie&szlig;lich versucht sie ihr eigenes literarisches Schaffen in Bezug zu
einem neu entstehenden, m&auml;chtigen, den Sozialstaat abbauenden und die
Emanzipation der Frauen behindernden Deutschland zu setzen, in dem auch
noch Nationalismus und Antisemitismus wieder sichtbar werden. </P>

<P><B>Anmerkungen:</B><BR>
Dieses sehr pers&ouml;nliche Buch ist ein Buch der Suche. Christa Wolf -
einerseits Sozialistin, andererseits schon fr&uuml;h in Konflikt mit der
offiziellen DDR-Linie - sucht nach der eigenen Rolle in einem Land, in dem
niemand mehr etwas von Sozialismus und DDR h&ouml;ren m&ouml;chte, in dem sie aber
gleichzeitig aus ihrem politischen Selbstverst&auml;ndnis heraus soziale
Ungerechtigkeiten wahrnimmt, gegen die sie anschreibt. Die verschiedenen
Texte, unabh&auml;ngig welcher Gattung sie angeh&ouml;ren, durchzieht eine
Unsicherheit, mit der Wolf auf die kleinsten zwischenmenschlichen und
politischen Ver&auml;nderungen reagiert. </P>

<P>Die Erz&auml;hlungen und Texte dieses Bandes sind f&uuml;r Christa Wolfs
Verh&auml;ltnisse einfach zu lesen. Sie helfen, eine Autorin und ihre
literarischen Inhalte besser zu verstehen. </P>

<P><B>Empfehlung:</B><BR>
Dieses Buch ist geeignet f&uuml;r Leser, die sich insbesondere f&uuml;r deutsche
Zeit- und Literaturgeschichte interessieren und die offen sind f&uuml;r einen
kritischen Blick auf unsere Gesellschaft, den es in Zeitung und Fernsehen
nicht mehr gibt. </P>    
<A href="#top">zum Inhaltsverzeichnis</A>
<HR>
<A name="a18"></A>

<H3>Buchtitel: Durch die W&uuml;ste <BR>
Autor: Karl May <BR>
Vorgestellt von: Rothaut <BR>
Verlag: Haffmansverlag, Z&uuml;rich <BR>
Erscheinungsjahr: 1992 <BR>
Gesamtseitenzahl: 542 <BR>
ISBN: <BR>
Format: Digital Ascii </H3>

<P><B>Inhalt:</B><BR>
Buchauszug: <BR>
"Und ist es wirklich wahr, Sihdi (Herr), dass du ein Giaur bleiben willst,
ein Ungl&auml;ubiger, welcher ver&auml;chtlicher ist als ein Hund, widerlicher als
eine Ratte, die nur Verfaultes fri&szlig;t?" <BR>

"ja," antwortete ich. <BR>

"Effendi, ich hasse die Ungl&auml;ubigen und g&ouml;nne es ihnen, dass sie nach ihrem
Tode in die Dschehenna kommen, wo der Teufel wohnt; aber dich m&ouml;chte ich
retten vor dem ewigen Verderben, welches dich ereilen wird, wenn du dich
nicht zum Ikrar bil Lisan, zum heiligen Zeugnisse, bekennst. Du bist so
gut, so ganz anders als andere Sihdis, denen ich gedient habe, und darum
werde ich dich bekehren, du magst wollen oder nicht." </P>
 
<P>So sprach Halef, mein Diener und Wegweiser, mit dem ich in den
Schluchten und Kl&uuml;ften des Dschebel Aures herumgekrochen und dann nach dem
Dra el Haua heruntergestiegen war, um &uuml;ber den Dschebel Tarfaui nach
Seddada, Kris und Dgasche zu kommen, von welchen Orten aus ein Weg &uuml;ber den
ber&uuml;chtigten Schott Dscherid nach Fetnassa und Kbilli f&uuml;hrt. <BR>
Buchauszug Ende. </P>

<P>Mit diesen Worten beginnt eine spannende Reise- und Abenteuererz&auml;hlung,
die die beiden Freunde auf die Spur zweier M&ouml;rder f&uuml;hrt. Sie geraten nicht
nur in Gefangenschaft eines Seer&auml;ubers, sondern m&uuml;ssen auch am Salzsee ein
lebensgef&auml;hrliches Abenteuer bestehen. Knapp vor dem Ziel entgehen ihnen
die M&ouml;rder abermals. </P>

<P><B>Anmerkungen:</B></B>
Dieses buch ist gepr&auml;gt von Spannung, Freundschaft und Treue, von Humor,
Idealismus, aber auch geografisch nicht uninteressant. </P>

<P><B>Empfehlung:</B><BR>

Ich habe dieses Buch schon mehr als 3mal gelesen, die Fortsetzungsb&auml;nde
nat&uuml;rlich auch, und entdecke immer wieder Neues. Die Lekt&uuml;re regt mich
immer zu neuem Denken und differenzierten Anschauungsweisen an. </P>

<A href="#top">zum Inhaltsverzeichnis</A>
<HR>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

