<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
    <META name="author" content="Johannes Weidner">

    <TITLE>Erdwein: Sie sind unter uns</TITLE>
  </HEAD>

  <BODY bgcolor="#FFFFF0" text="#000000" link="#0033CC" vlink=
  "#333366" leftmargin="10" topmargin="10" marginwidth="10"
  marginheight="10">
    <TABLE border="0" cellspacing="0" cellpadding="10" width="100%"
    summary="">
      <TBODY>
        <TR>
          <TD>
            <H3 align="center">Hanno Erdwein</H3>

            <H1 align="center">Sie sind unter uns</H1>

            <P>"Mach doch mal das Schei&szlig;-Radio leiser!" Bob
            gehorchte unwillig. "Meine Lieblingsscheibe,
            ausgerechnet!" Die alles verschluckende Technowolke
            schrumpfte zusammen zu leisem S&auml;useln, so dass der
            Stra&szlig;enl&auml;rm durch die schr&auml;ggestellten
            Fenster hereinschwappte. Jessy warf die New-York-Times
            auf den Tisch. "Lies mal!" Er griff danach und verzog
            angewidert die Lippen. Zeitunglesen war heute nicht
            sein Ding. Und Jessy kam ihm in letzter Zeit mit so
            verr&uuml;ckten Ideen wie Arbeitsuchen. Sie hatte doch
            einen Job. Was wollten sie mehr? "Seite drei unten
            rechts", dirigierte sie seinen tr&auml;gen Blick. Mit
            einigen bel&auml;stigten Seufzern faltete er das Blatt
            auf handliche Gr&ouml;&szlig;e und las &auml;rgerlich
            vor: "Schon wieder ein homosex .." Sah entr&uuml;stet
            zu ihr hoch. "Verdammt noch mal, weshalb soll ich das
            lesen?" "Warst Du nicht in Deiner Glanzzeit ein
            &uuml;beraus erfolgreicher Detektiv?" "Ach diese Kiste
            wieder." Knallte ver&auml;rgert die Zeitung auf den
            Tisch. "Wann h&ouml;rt das endlich auf, dass Du mir
            Arbeit aufhalsen willst?!" "Bob Lloydt!" Jessy
            r&uuml;ckte ihm mit ihren reizenden
            f&uuml;nfundf&uuml;nfzig Kilo auf den Pelz und boxte
            spielerisch gegen seinen Bizeps. "Wenn Du nicht bald
            was unternimmst, werden die da erst Pudding und
            hinterher gar nicht mehr vorhanden sein. Au&szlig;erdem
            hab ich es satt, uns allein durchzuf&uuml;ttern.
            Verstanden!" Das war deutlich. So deutlich, wie er es
            von seiner liebreizenden Freundin nie erwartet
            h&auml;tte. Seine Augen suchten die in Griffweite
            geparkte Whiskyflasche. "Pech gehabt", grinste sie
            b&ouml;sartig. "Hab ich erst mal in Sicherheit
            gebracht. Zu saufen gibts erst nach getaner Arbeit."
            Das war noch deutlicher. Mit einem Sprung, den ein
            gereizter Panther nicht besser hingelegt h&auml;tte,
            kam er auf die F&uuml;&szlig;e: "Jessika Hillery!",
            fauchte er raubtierhaft. trat aber angesichts des
            eisigen Glitzerns in ihren Augen voll auf die Bremse.
            "Also gut. Was soll es sein? Jemanden umlegen oder
            raushauen? Oder soll ich das Gold von Fort Knox
            bewachen?" "Gib Dir keine M&uuml;he, spa&szlig;ig zu
            wirken", warf sie leichthin. "Mit bescheidenen
            Recherchen l&auml;&szlig;t sich auch Geld verdienen."
            "Sind aber erheblich langweiliger", knurrte er und
            griff wieder nach der Zeitung. "Man hat also eine
            Schwuchtel kalt gemacht." Grinste &uuml;ber sein
            bl&ouml;des Wortspiel und nahm die wenigen Zeilen
            widerwillig in sich auf. Die Polizei kam seit gut einer
            Woche nicht vom Fleck und bat um sachdienliche Hinweise
            aus der Bev&ouml;lkerung. "Ein richtiger Schei&szlig;
            Job, bei dem man vom Herumlatschen Plattf&uuml;&szlig;e
            kriegt." Er sah hoch und senkte gleich ergeben den
            Blick. "Okay. Ich machs."</P>

            <P>Zuerst zu dem Typ, der f&uuml;r die Plackerei die
            Kohle rausr&uuml;ckte. Der Vorschuss war nicht
            &uuml;bel. Bob sah sich in dieser Pl&uuml;schbude nicht
            gerade diskret um. Der Schwuli beobachtete sein Tun mit
            triefnassem Blick. "Ihr hrrm Freund lebte hier mit
            Ihnen und .. ja, er kam an jenem Abend .." "Ich war mit
            ihm zum Essen verabredet. James kam nie zu sp&auml;t",
            schluchzte er mit hysterisch kicksender Stimme. "Jaja.
            Aber dann fand ihn ein Jogger im Centralpark. Habs
            gelesen." Er kramte schnaufend Zigaretten und Feuerzeug
            aus der Tasche. "Darf ich?" Bevor der andere verneinen
            konnte hatte er den brennenden Glimmstengel schon
            zwischen den Lippen. "H&ouml;chst merkw&uuml;rdig finde
            ich die Art und Weise, wie man ihren hrrm Freund
            umgebracht hat." "Ja?" Asche st&auml;ubte auf den
            Flockati. "Elektroschock. Hab mir die medizinische
            Analyse mal durchgelesen. Ein technisches Unding. So
            hohe Spannungen erzeugt man nicht mit einem
            herk&ouml;mmlichen Schocker." "Nein?" Wieder bekam der
            Flauscheteppich eine Ladung Asche ab. "Nun ja. Werde
            der Sache mal nachgehen." Dann lie&szlig; er sich noch
            erz&auml;hlen, was jeder von den beiden an jenem
            besagten Tag getrieben hatte. Angaben, die nach
            B&uuml;romief und Waschlauge rochen. Er, Robert Kirk,
            hatte sich in seiner Anwaltskanzlei von
            scheidungsw&uuml;tigen Weibsen die Ohren
            volls&uuml;lzen lassen. Sein hrrm Freund James Walker
            spielte derweil das h&auml;usliche Heimchen am Herd.
            "Und was hatte er in oder am Centralpark zu schaffen?"
            Kirk zuckte mit den schmalen Schultern. Vielleicht
            brachte er Sachen zur W&auml;scherei? Kann auch sein,
            dass .." "Ja?" "Er, er hatte Probleme mit
            H&auml;morrhoiden." "Ach ja." "Und, und war deswegen in
            Behandlung." Eine ganze Aschenwurst zerst&auml;ubte zu
            Bobs F&uuml;&szlig;en. "Okay. Brauch dann noch die
            Namen vom Quacksalber und dieses Schleudergangstudios."
            Das notierte er sich. Tippte an seinen Hutrand und war
            froh, gleich daraufwieder die abgasgeschw&auml;ngerte
            Stra&szlig;enluft atmen zu k&ouml;nnen.</P>

            <P>Weder der Internist noch der Halter des Waschsalons
            hatten Mister Walker an jenem Tag zu Gesicht bekommen.
            Bob wusste es. Es war einer dieser gottverdammten
            Plattf&uuml;&szlig;e-Jobs. Tagelang herumlaufen
            m&uuml;ssen f&uuml;r einen feuchten Afterwind. Sinnend
            stand er am Eingang zum Centralpark und stierte hinein.
            Da hinten irgendwo hatte man vor Jahren John Lennon
            abgeknallt. Und nun war es ein schwuler Bubi, den
            irgendwer mit einem Hochspannungsger&auml;t grillen
            wollte. Auf was f&uuml;r abgefuckte Ideen die Leute
            kamen! Wind frischte auf und blies ihm feucht in den
            Nacken. Er stellte den Mantelkragen hoch und
            dr&uuml;ckte den Hut tiefer in die Stirn. Kramte
            verdrossen in seinen Taschen. Die Zigarettenschachtel
            war leer. Fern langgezogenes Heulen eines
            Streifenwagens. Graues Licht hing in den Baumkronen. Er
            war ein gutes St&uuml;ck in den Park
            hineingeschlendert. Was wollte er hier? Bei dem
            Dreckwetter war eh kein Arsch unterwegs. Nur er armes
            Schwein musste einen M&ouml;rder suchen, weil Jessy
            sich das in den Kopf gesetzt hatte. Verdammte
            Weiber!</P>

            <P>Hier nur so herumzusitzen war wohl das Sinnloseste,
            was ihm einfallen konnte. Jedenfalls bot ihm der
            Pavillon Schutz vor dem Dreckwetter. Zur Westseite gab
            es eine Schutzwand. Windb&ouml;en dr&uuml;ckten
            Regenschauer dagegen. Buschwerk bog sich unter heftigen
            B&ouml;en. Hier also hatte man James mit dem
            vertr&auml;umten M&auml;dchenblick erledigt. Aber
            weshalb? Die Leiche wies weiter keine Spuren von Gewalt
            auf. Auch keine, die auf sexuellen Missbrauch
            hingewiesen h&auml;tten. Was war dann das Motiv? Ach du
            liebe Zeit! Motive gab es wie Sand am Meer. Nur -
            welches passte zu diesem Mord? Wieder w&uuml;hlte er in
            den Taschen nach nicht vorhandenen Zigaretten.
            Schnippte ein paar mal mit dem Feuerzeug. Zog endlich
            einen Streifen Kaugummi hervor und schob ihn sich
            &auml;rgerlich in den Mund. Eine Leiche. Ein absurder
            Mord. Keine Ideen. Was Schlimmeres konnte er sich nicht
            vorstellen.</P>

            <P>&Uuml;ber den von Wasserlachen gl&auml;nzenden Weg
            kam jemand dahergeschlendert. Ein junger Mann von
            mittlerer Gestalt. Schlank. Schmale Schultern. Langes
            rostbraunes Haar. Er trug nichts, was die immer noch
            heftigen Regenschauer abgewehrt h&auml;tte. Bei der
            sommerlich leichten Bekleidung, musste er bis auf die
            Haut durchn&auml;&szlig;t sein. Normalerweise sucht man
            in geduckter Haltung mit raschen Schritten den
            n&auml;chstbesten Unterstand auf. Er aber kam daher,
            als ginge ihn der Pladderregen nicht die Bohne an.
            Obschon ihm der Wind das nasse Haar ins Gesicht blies,
            promenierte er unter scheinbar freundlichster Sonne
            dahin. Bob besah sich den Sonderling. Ein armer Irrer!
            Mehr Aufmerksamkeit verschwendete er nicht auf den
            Vorfall. Und das war ein Fehler.</P>

            <P>Irgendwann wachte er auf und konnte sich nicht
            erinnern, wie er hierhergekommen war. Immer noch
            klatschte Regen aufs PavillonDach. Finsternis umgab
            ihn. Es war Nacht. Dem Chronometer an seinem Handgelenk
            zufolge musste er mehr als zw&ouml;lf Stunden
            geschlafen haben. Das brachte er selbst bei
            Volltrunkenheit nicht zustande. Volltrunkenheit?
            L&auml;cherlich. In den letzten zwei Tagen hatte er
            nicht mal an Alkohol riechen d&uuml;rfen. Oweh, Jessy.
            Sie w&uuml;rde sich Sorgen machen. Sollte sie! Verdammt
            ja, das sollte sie wirklich. Sie hatte ihm diesen
            Schwachsinns-Job aufgehalst. Er richtete sich auf und
            griff st&ouml;hnend an seinen Kopf. So einen
            Brummsch&auml;del hatte er lange schon nicht mehr
            gef&uuml;hlt. Wieso aber, verdammt noch mal? Und nicht
            mal kalt war ihm. Aber &uuml;bel. Geradezu
            spei&uuml;bel! Und eigentlich m&uuml;sste er bei der
            hohen Luftfeuchtigkeit total durchfroren sein und den
            Anfang einer z&uuml;nftigen Bronchitis haben. Nicht mal
            die Bekleidung f&uuml;hlte sich klamm an, Es sah so
            aus, als w&auml;re er vor wenigen Minuten aus einer
            warmen Umgebung weggebracht und hierhergelegt worden.
            V&ouml;llig absurd! Mit dem Aufstehen hatte er
            M&uuml;he. Die Beine wirkten wie Weichk&auml;se. Er
            schlenkerte eine Weile damit, bis er das Blut heftig
            pulsieren f&uuml;hlte. Dann stampfte er herum und
            befahl seinem inneren Sauhund, sich
            zusammenzurei&szlig;en. F&uuml;r alles gab es
            jedenfalls eine plausible Erkl&auml;rung. Er sollte
            endlich weniger Saufen und sich mehr Bewegung machen.
            Es war wohl der l&auml;ngst f&auml;llige Warnschuss vor
            den Bug. - Aber auch hierin irrte er sich gewaltig.</P>

            <P>Jessy lag im Tiefschlaf. Als er zu ihr kroch, drehte
            sie sich seufzend herum und pr&uuml;fte aus Gewohnheit
            schnuppernd die Luft. Dabei wachte sie nicht mal auf.
            Er grinste. Wickelte sich in seinen Deckenteil und
            tauchte traumlos ab.</P>

            <P>"Ah, Bob Lloydt! Wieder mal auf der Pirsch?"
            Inspector Grand tippte ihm auf die Schulter. Bob
            l&ouml;ste den Blick von den Seiten des Aktenordners
            und sah Grand gelangweilt an. "Und wenn schon. Was geht
            Sie das an?" "H&auml;ngt ganz von der F&auml;hrte ab,
            auf der Sie dahinhecheln." Grand hob sich auf die Zehen
            und peilte ihm &uuml;ber die Schulter. "Sie an. Sie
            durchst&ouml;bern alte Polizeianalen nach Morden an
            Schwulen." T&auml;tschelte mitleidig Bobs Arm.
            "Eiskalte F&auml;hrte, mein Bester. Als wenn wir das
            nicht l&auml;ngst schon getan h&auml;tten." "Auch Euch
            Bullen entgeht mal was." "V&ouml;llig richtig, Old Boy.
            Aber dann wirst Du das pflichtschuldigst melden. Klar?"
            "Fuck yourself!" "Grand stie&szlig; ihm die Faust in
            die Nieren: "Pure Verschwendung. Gibt bessere
            Pl&auml;tze daf&uuml;r." Und zog ab. Sie kannten und
            sch&auml;tzten sich seit Jahren. Hatten eine Zeitlang
            in der gleichen Abteilung gearbeitet. Dann wurde Bob
            gefeuert. Der "Oberdruide" hatte was gegen Alkohol im
            Dienst. Grand behielt Recht. &Auml;rgerlich warf er die
            Akte zu und schob sie zur&uuml;ck auf den Haufen. Hier
            gab es keine hei&szlig;e Spur. Mit den F&auml;usten in
            den Manteltaschen trat er auf die Stra&szlig;e. Ein
            frischer Wind trieb graues Gew&ouml;lk vor sich her.
            Aber es war trocken. Was mochte diesem James im
            Centralpark begegnet sein? Wer -um Himmels Willen -
            konnte Interesse haben, einen kleinen Schwulen auf
            diese idiotische Weise zu t&ouml;ten? Und wieder einmal
            fragte er sich, was das f&uuml;r ein Mordsding gewesen
            war, das derartige Schl&auml;ge versetzen konnte. Der
            Pathologe hatte bei James ein grundsolides Herz
            diagnostiziert.</P>

            <P>Wieder steuerte er auf den Park los. Hier irgendwo
            musste die L&ouml;sung zu finden sein. Ohne darauf zu
            achten, wohin er die Schritte lenkte, ging er
            gr&uuml;belnd vorw&auml;rts. Der Park stand in engem
            Zusammenhang mit der Tat, war vielleicht Ausl&ouml;ser
            oder Anlass. Vielleicht hatte James etwas entdeckt, was
            er nicht entdecken sollte. Dealer hatten hier ihren
            Umschlagplatz. Heimliche Treffs wurden verabredet,
            f&uuml;r die es genug geeignete Winkel gab. War er
            ungewollt in so was hineingestolpert? Aber was hatte er
            &uuml;berhaupt hier gewollt? Ein wenig Ausspannen?
            Merkw&uuml;rdig w&auml;re es schon, wenn jemand, der
            nur mal Luft schnappen will, in den abgelegensten
            Winkeln des Centralparks herumkriechen w&uuml;rde. Aber
            wer konnte wissen, was in so einem Hirn vorging.</P>

            <P>Ungewollt war auch er in abseitige Regionen
            vorgedrungen. Schmalere Wege. Dichtes Buschwerk. Immer
            wieder Pfade, die seitab f&uuml;hrten, wo sich
            P&auml;rchen ungest&ouml;rt besch&auml;ftigen konnten.
            P&auml;rchen? Robert Kirk schwor darauf, dass James ein
            braver Junge war. Das mochte nun stimmen oder nicht.
            Der Befund? Ja zum Teufel! Der verdammte
            kriminaltechnische Befund wies dazu nichts aus. Aber
            was besagte das schon.</P>

            <P>Seit einer geraumen Weile hatte er ein
            merkw&uuml;rdiges Gef&uuml;hl. Konnte das aber nicht
            genau benennen. War so eine Mischung von stark
            ozonhaltiger Luft wie nach einem Gewitter und dazu
            Kribbeln auf der Haut. Das Nackenhaar juckte und
            knisterte. Wahrhaft verteufelt komischer Zustand! Nun
            blieb er stehen. Sah irritiert um sich. Nichts
            Technisches in der N&auml;he. Und f&uuml;r Donner und
            Blitz war es nicht schw&uuml;l genug. Resigniert ging
            er weiter. Die Empfindung verst&auml;rkte sich. Auch
            begann die Luft mit einem mal zu leuchten. Eine
            Helligkeit, die mit dem Tageslicht, in welchem nach wie
            vor Schiefergrau vorherrschte, nichts zu tun hatte. Das
            wiederum l&ouml;ste in ihm so etwas wie Euphorie aus.
            Drei gro&szlig;e Gl&auml;ser Bourbon mochten
            &auml;hnlich wirken. Was zum Henker war das? Dann
            wusste er pl&ouml;tzlich nichts mehr von sich.</P>

            <P>Als er dann aus irgendwelchen sternenfernen
            Kindheitsphantasien in die Gegenwart zur&uuml;ckkehrte,
            fand er sich auf einer Art Liege ausgestreckt. Nach
            alter Gewohnheit wollte er sich mit einem Ruck
            aufrichten. So sehr er auch seine Muskeln anspannte, es
            gelang ihm nicht. Was war das? Nicht mal den kleinen
            Finger vermochte er von der Oberfl&auml;che des Lagers
            abzuheben. Soweit es der Blickwinkel zulie&szlig;,
            sp&auml;hte er um sich. Ein h&ouml;chst
            merkw&uuml;rdiger Raum war das. Die W&auml;nde
            bestanden aus einem ihm nicht bekannten Material. Nach
            der Struktur h&auml;tte es PVC sein k&ouml;nnen.
            Allerdings hatte er noch nie gesehen, dass PVC von
            selbst leuchtete. Apparaturen standen nahe seiner
            Streckbank, deren Sinn und Zweck vom &auml;u&szlig;eren
            Erscheinungsbild nicht zu erraten war. Nichts daran
            erinnerte ihn an irgend etwas, was er schon mal gesehen
            hatte. Er hob den Blick zur Decke, ober, was er
            f&uuml;r die Decke des Raums hielt. Dicht darunter
            schwebte eine Kugel. Schweben war offensichtlich die
            treffenste Bezeichnung; denn nirgends sah er etwas, was
            die Kugel h&auml;tte halten k&ouml;nnen. Und sie
            bewegte sich immerfort in die verschiedensten
            Richtungen, so dass er sie mal von unten, dann wieder
            von der Seite betrachten konnte. Nein, das Ding wurde
            durch keinen noch so d&uuml;nnen Faden gehalten. Wenn
            er dazu in der Lage gewesen w&auml;r, h&auml;tte er
            sich kneifen m&ouml;gen, um aus diesem verdammt
            d&auml;mlichen Traum endlich zu erwachen. Wieder hielt
            die medizinball gro&szlig;e Kugel unmittelbar &uuml;ber
            ihm. Ein eigenartiger Dunst, wolkige Schleier umgaben
            sie da und dort und verwehrten die Draufsicht. Und
            dort, wo etwas zu erkennen war, sah es ... ja, wie
            denn? Das sah exakt so aus, als blicke man aus dem All
            auf die Erde.</P>

            <P>Die Fremden f&uuml;hrten ihn in einen anderen Raum.
            Es glich entfernt dem Cockpit eines
            Gro&szlig;raumflugzeugs. &Uuml;berall MiniMonitore.
            Eigenartige Skalen. Kn&ouml;pfe. Hebel. Sinn und
            Funktion blieben ihm verborgen, bis sich einer seiner
            Begleiter zu schaffen machte. Zuerst wurde einer der
            W&auml;nde durchsichtig und bot den atemberaubenden
            Blick auf das sternen&uuml;bers&auml;te All. Ihn
            schwindelte. Er musste sich an einen seiner
            W&auml;chter festhalten, sonst w&auml;r er
            gest&uuml;rzt. Zugleich registrierte er, wie mulmig ihm
            vor Hunger war. Aber dieser Blick durch die Wand - war
            das nun real oder nur eine Vorspiegelung? Einige der
            bunten Punkte bewegten sich, als k&auml;men sie langsam
            und dann immer rascher auf den Betrachter zu. Was
            bedeutete das? Der Mann an den Konsolen nahm die Hand
            von den Schaltelementen, drehte sich zu ihm um und
            l&auml;chelte. Bob erkannte ihn. Es war jener
            langhaarige junge Mann, der so seltsam dem Regen
            getrotzt hatte. Er sah ihm direkt in die Augen. Das
            waren wei&szlig; Gott nicht die Augen eines jungen
            Mannes. In ihnen spiegelte sich die Erfahrung etlicher
            Generationen. Mein Gott! Wo war er und was sollte das?!
            Wenn er jetzt nicht bald was zu trinken bekam,
            w&uuml;rde er den Verstand verlieren! Auf einen Wink
            des ihm bekannten Mannes, den er f&uuml;r den
            Anf&uuml;hrer hielt, trat einer seiner Begleiter an
            eine andere Wand, griff durch sie hindurch und zog -
            das verschlug ihm den Atem - eine Flasche Bourbon
            heraus. Das musste man sich nur mal vorstellen. Und
            wenn er dies am Tresen in Jimmies Kneipe erz&auml;hlte,
            w&uuml;rden sie ihn f&uuml;r v&ouml;llig durchgeknallt
            halten. Vielleicht war er das bereits. Der Fremde griff
            mit der Linken - und er sah das erst jetzt, seine
            H&auml;nde hatten nur vier Finger - die Flasche.
            Schnippte mit der anderen und hielt, war das ein
            Zaubertrick?, pl&ouml;tzlich ein Trinkgef&auml;&szlig;
            umfasst. "Zum Wohl", l&auml;chelte der Kommandant,
            w&auml;hrend Bob ein volles Glas wahrhaftig nach Whisky
            duftenden Gebr&auml;us unter die Nase gehalten wurde.
            Er trank gierig. Danach war er zu halbwegs klaren
            Gedanken f&auml;hig und rekapitulierte, was ihm
            &uuml;ber seine Situation bekannt war. Das Letzte,
            woran er sich erinnern konnte, bevor ihn das
            Bewu&szlig;tsein verlie&szlig;, war jenes eigenartige
            Kribbeln der Luft im Centralpark. Und was hier mit ihm
            geschah, hatte unmittelbar damit zu tun.
            Au&szlig;erirdische? Aber das war absurd! Eine Weile
            noch wehrte sich sein logisch arbeitender Verstand
            gegen diese Annahme. Wenn er aber die h&ouml;chst
            unirdisch wirkende Umgebung in seine &Uuml;berlegungen
            einbezog, musste er sich an diesen Gedanken
            gew&ouml;hnen. Und dazu passte dann auch wieder der
            Eindruck, sie w&uuml;rden durch den Weltraum rasen.
            "Ganz recht", unterbrach der Kommandant sein
            Gr&uuml;beln und l&auml;chelte erneut. "Ihre
            Schlussfolgerungen lassen an Logik nichts zu
            w&uuml;nschen &uuml;brig. Ich freue mich, endlich einem
            Wesen zu begegnen, das unserer Denkweise ann&auml;hernd
            nahe kommt." Dabei stand er auf und kam auf Bob zu. Mit
            einer &uuml;beraus irdischen Geste reichte er ihm die
            Hand. "Willkommen an Bord ... wie w&uuml;rdet Ihr
            Erdlinge sagen? Ach ja. Ich begr&uuml;&szlig;e Sie an
            Bord der KOMET!"</P>

            <P>"He Mann! Wach auf!" Derbe F&auml;uste bearbeiteten
            seine Schulter. Bob hob langsam ein Augenlid und
            sp&auml;hte vorsichtig umher. Sah nach Central Parc
            aus. Und er lag auf einer dieser unbequemen B&auml;nke.
            "Pennen verboten. Kostet zehn Dollar." Der W&auml;chter
            hielt ihm seine schwielige Hand vor die Nase. Bob
            brachte sich &auml;chzend in sitzende Stellung und
            griff nach seiner Geldb&ouml;rse. "Ein wenig zu tief
            ins Schnapsglas geguckt, wie?" Widerlich, dieses
            Pferdezahn-Grinsen. Er dr&uuml;ckte dem H&uuml;ter der
            Ordnung einen Schein in die Hand. "Nun aber ab nach
            Hause zu Mutti und ins Bett!" Eindeutige Handbewegung
            und noch mehr Pferdez&auml;hne. "Wenn Sie Ihre Mutter
            beschlafen, ist das Ihre Sache. Ich ziehe anderes vor."
            Das Mondgesicht des W&auml;chters wechselte von
            &uuml;beraus heiter zu gewitterschw&uuml;l drohend. Bob
            machte sich aus dem Staub.</P>

            <P>So einiges bekam er nicht ganz auf die Reihe. Vor
            ... er be&auml;ugte ungl&auml;ubig seine Armbanduhr ...
            gut achtundvierzig Stunden war er hier hineinspaziert,
            um den Hintergrund eines Mords zu kl&auml;ren. Dann
            hatte er einen h&ouml;chst merkw&uuml;rdigen Traum
            getr&auml;umt von Au&szlig;erirdischen und ihrem
            Raumschiff. Aber - war es Traum oder Realit&auml;t?
            Kein Schwein w&uuml;rde ihm das abnehmen. Doch,
            verdammt noch mal, wo war er denn die leztten
            achtundvierzig Stunden gewesen? Die konnte er
            unm&ouml;glich auf dieser Parkbank zugebracht haben.
            Amn&auml;sie? Jessy hatte ihm schon l&auml;nger mit
            diesen &uuml;blen Folgen des Saufens gedroht. Nein, das
            war es nicht. Und den wilden Parkpenner hatte er auch
            offensichtlich nicht gespielt. Sein Anzug w&uuml;rde
            demensprechend aussehen. Aber, zum Teufel, wo hatte er
            die ganze Zeit gesteckt? Bei vierfingrigen Aliens?
            W&uuml;rde er derartige Geschichten erz&auml;hlen,
            w&auml;r das die Eintrittskarte f&uuml;r die
            Klapsm&uuml;hle. Und doch war da was dran. Der
            merkw&uuml;rdige junge Mann, der selbst bei dickem
            Regen nicht nass wurde, und den er sp&auml;ter in
            dieser Raumschiff Umgebung wiedergesehen hatte.
            Raumschiff? Ein UFO im Central Parc? Herr Gott noch
            mal! Das klang alles so hirnrissig, dass er an seinem
            eignen Verstand zu zweifeln begann. Und dennoch ...
            irgendwie passte alles pl&ouml;tzlich zusammen: James
            Walker, der im Central Parc an einer &Uuml;berdosis
            Energie starb. Sein eigenes Abtauchen in Hypnos Reich.
            Vierfingrige Wesen, die irgendwelche Experimente mit
            Erdmenschen anstellten, um sie zu studieren. Und sein
            zynischer Kommentar, als man ihm das alles erkl&auml;rt
            hatte: "F&uuml;r Sie sind wir somit nichts anderes als
            Laborratten, bei denen es auf einen weiteren Exitus
            schon gar nicht mehr ankommt." Und dann diese kalten
            analytischen Augen, mit denen er betrachtet und
            durchforscht wurde. "Sie irren sich. Wir achten Sie
            nicht minder als unsere eigene Spezies." "Aber weshalb
            spielen Sie dann leichtfertig mit unserem Leben." "Ein
            Unfall. Wir hatten anfangs den Energiefluss zu hart
            eingestellt." "Und weshalb das alles?" "Ein
            Forschungsauftrag der Galaktischen Union." "Der was?!"
            "Ein Verbund lebentragender Welten. Man hofft, auch die
            Ihrige eines Tages aufnehmen zu k&ouml;nnen." "Ach ja?"
            Er hatte das sarkastisch hingeworfen und die Mundwinkel
            herabgezogen. "Nach unseren Testergebnissen sind Sie
            noch zu weit von dem n&ouml;tigen Level entfernt." "Wie
            tr&ouml;stlich. Darf man erfahren, welche
            Voraussetzungen erforderlich sind?" "Es w&auml;re zu
            aufwendig, sie Ihnen aufzulisten. Doch was Ihnen dazu
            am meisten mangelt, ist Ihr Wille zur friedlichen
            Koexistenz mit Ihresgleichen und anderen Lebewesen."
            "Gibt es denn da drau&szlig;en keine Kriege mehr?" Die
            Frage blieb unbeantwortet. Das n&auml;chste, war dann
            sein unsanftes Erwachen auf der Parkbank.</P>

            <P>Er schlenderte noch eine Weile ziellos umher,
            hoffend, dass ihm eine glaubw&uuml;rdige Erkl&auml;rung
            f&uuml;r seinen Klienten einfallen w&uuml;rde. Mit der
            Story von den Au&szlig;erirdischen, das stand fest,
            durfte er ihm nicht aufwarten. Aber wie h&auml;tte
            James-Baby denn sonst noch zu Tode kommen k&ouml;nnen?
            Blitzschlag? Quatsch! An dem besagten Tag war weit und
            breit kein Gewitter zu sehen gewesen. Verdammt noch
            eins! Da hatte er sich ganz sch&ouml;n in die
            Schei&szlig;e gesetzt. Und so rasch w&uuml;rde er sich
            daraus nicht erheben k&ouml;nnen.</P>

            <P>Ein paar Drinks waren nun f&auml;llig. Der
            Schankraum war wie immer proppenvoll. "He Leute, da ist
            Bob." "Bob hierher!" Arme winkten ihn heran. Ein Stuhl
            stie&szlig; ihn in die Kniekehlen. Und er setzte sich.
            "Na, Old Boy, was macht das Gesch&auml;ft?" Bob winkte
            ab. "Flaute. Nichts los in der Welt." Grinsen und
            Zuprosten. "Aber die Schwuchtel, die man neulich im
            Park gefunden hat. Ist raus, woran der s&uuml;&szlig;e
            Kleine umkam?" "Interessiert mich nicht. An so was soll
            sich ein anderer die Pfoten dreckig machen." "Aja,
            soso. Und woran schn&uuml;ffelt man zur Zeit herum?"
            Bobs H&auml;nde und Augen hatten eine Weile mit dem
            Anz&uuml;nden eines Glimmstengels zu tun. Dann pustete
            er etliche Wolken zwischen sich und die l&auml;stigen
            Fragensteller. "so dies und das.
            Gesch&auml;ftsgeheimnis." Augenzwinkern. Kopfnicken.
            "Verstehe." Dann ein anderer: "Colin hat was Tolles
            gesehen. He Colin, erz&auml;hl mal!" Der Rotschopf nahm
            erst einen kr&auml;ftigenden Schluck, bevor er sich
            r&auml;usperte: "Glaubt mir ja doch kein Schwein. Aber
            es ist wahr." "Nun, raus mit der Sprache. Was hast Du
            Tolles beobachtet?" Ein weiterer grinste lasziv:
            "Vielleicht ist ihm Jocko Ono nackt begegnet." "Maul
            halten! Last den Jungen doch erz&auml;hjlen." Der
            r&auml;usperte sich nochmals: "Wurde schon dunkel.
            Musste am Central parc vor&uuml;ber. Kam aus der
            Highscool und wollte noch was einkaufen." "Mann, machs
            nicht so spannend." "Ja, da h&ouml;rte ich mit einem
            mal ein merkw&uuml;rdiges lautes Summen." "War sicher
            ne Handvoll Hornissen. Oder Du hattest Ohrensausen."
            "Ne, der hatte Aftersausen." "Halts Maul Jack und lass
            den Jungen erz&auml;hlen, sonst erfahren wir es bis
            morgen fr&uuml;h nicht mehr." "Auch wurde mir so
            schwindlig, dass ich dachte, gleich knall ich hin."
            "Habt wohl im Chemieunterricht am Brennspiritus
            genascht." "Schnauze! Erz&auml;hl weiter, Junge." "Und
            dann sah ich es." "Was sahst Du?" "Das Ding. Es stieg
            langsam &uuml;ber dem Central Parc hoch." "Ein Ding?
            Was f&uuml;r ein Ding?" "Wei&szlig; nicht. War ziemlich
            gro&szlig;. Fast wie eine riesige Kugel. Schimmerte
            merkw&uuml;rdig, als w&uuml;rde es von innen
            beleuchtet." Seufzen ringsum. "Schon wieder einer, der
            ein UFO gesehen haben will." "Ja und dann?" "Nichts
            weiter. Das Ding stieg und stieg. Wurde immer kleiner
            und war pl&ouml;tzlich fort." "Der &uuml;bliche
            Quatsch. Fast jeder will heute ein UFO gesehen haben.
            Aber es ist noch keiner mit handfesten Beweisen
            gekommen." "Ja, lasst uns von was anderem reden. Wer
            geht morgen zu dem Spiel? Ich hab noch Karten." Bob
            trank sein Glas aus. Er h&auml;tte einiges sagen und
            erkl&auml;ren k&ouml;nnen. Aber geglaubt h&auml;tte ihm
            niemand.</P>

            <P>(Mai 2002)</P>

            <P align="center">&nbsp;</P>
          </TD>
        </TR>
      </TBODY>
    </TABLE>
  </BODY>
</HTML>

