<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>"Tupper"-Party</TITLE>
  </HEAD>

  <BODY background="images/bga.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>"Tupper"-Party</B></FONT></P>

          <P>Letzte Woche komme ich mal etwas fr&uuml;her von der
          Arbeit ("&Uuml;berraschung, Schatz!") und was finde ich
          vor?</P>

          <P>Eine Gruppe von Mitdrei&szlig;igerinnen hockt in
          meinem Wohnzimmer, leider alle angezogen, meine Herzdame
          mitten unter ihnen, und sie haben einen Halbkreis um eine
          Mittdrei&szlig;igerin gezogen, die neben sich ein
          K&ouml;rbchen mit Plastikartikeln stehen hat. Jede der
          Damen hat eine Kaffeetasse unseres besten Geschirrs vor
          sich stehen, dazu unsere schweineteuren
          "Rosso-Bianco"-Gl&auml;ser, sie knabbern MEINE
          Salzst&auml;ngelchen und futtern MEINE
          S&uuml;&szlig;igkeiten und haben ob meines Eintretens
          einen erschrocken - gequ&auml;lten Gesichtsausdruck.</P>

          <P>Bis meine Frau die Worte als erstes findet:<BR>
           "Hallo Schatz, das ist Frau Mesenkamp (sie deutet auf
          die Lady mit den Plastikteilen), wir machen heute unsere
          "Tupper"-Party."</P>

          <P>Ahja. Party. Ohne mich. Tupper. Verstehe.</P>

          <P>"Hallo, Frau Mesenkamp" grinse ich die etwas verlegene
          Dame an. "Sch&ouml;n, sie kennenzulernen. Darf ich mich
          dazu setzen?"</P>

          <P>Alle M&auml;dels &ouml;ffnen den Mund, um "Nein" zu
          sagen, aber ich bin schneller und sitze am Tisch, bevor
          eines der anwesenden H&uuml;hner reagieren kann.</P>

          <P>"Na, dann mal los!" ermuntere ich Frau Mesenkamp. Die
          hat einen verlegenen Gesichtsausdruck, l&auml;chelt
          schamhaft und gibt jeder der anwesenden Hauskauffrauen
          ein Plastiksch&uuml;sselchen mit Deckel. Ich kriege auch
          eines und stelle es vor mich hin.</P>

          <P>"Das ist zum Frischhalten von Lebensmitteln"
          erkl&auml;rt Frau Mesenkamp bei der Ausgabe. "Alles, was
          sie da rein f&uuml;llen, wird bei Druck auf den Deckel
          luftdicht verschlossen. So k&ouml;nnen sie
          H&uuml;hnersalat bis zu einer Woche frisch
          aufbewahren."</P>

          <P>"Oh, ahja" echot die Damenriege und macht die
          Deckelchen auf die Sch&uuml;sselchen und im Nu ist die
          Luft erf&uuml;llt mit poppenden Ger&auml;uschen, als die
          h&uuml;hnersalatleeren Plastikteilchen verschlossen und
          wieder ge&ouml;ffnet, wieder verschlossen und wieder
          ge&ouml;ffnet werden. Ich lasse meine
          H&uuml;hnersalatsch&uuml;ssel zu und trommle ein wenig
          auf dem Deckel herum. Die Sitzgruppe hingegen kann nicht
          genug vom Sch&uuml;sselchen auf und zumachen
          bekommen.</P>

          <P>"Praktisch" meint meine Frau.</P>

          <P>"Ohja" gibt ihr Frau Mesenkamp Recht. "Tupperware ist
          die erste Firma, die diesen luftdichten Verschluss
          entwickelt hat und ist heute noch Marktf&uuml;hrer auf
          dem Segment."</P>

          <P>Nun, bisher habe ich in noch keiner
          B&ouml;rsenzeitschrift Kursnotierungen zum Segment
          "luftdichte Essensaufbewahrungsplastiksch&auml;lchen"
          gefunden, aber ich will ja Frau Mesenkamp nicht
          widersprechen.</P>

          <P>"Guck mal, Schatz", jubelt meine Frau "praktisch,
          oder?".</P>

          <P>"Sie k&ouml;nnen Ihrem Mann da auch Essen ins
          B&uuml;ro mitgeben", springt Frau Mesenkamp bei, die wohl
          ahnt, was jetzt kommt...... vorsichtshalber setzt sie
          noch ein "mein Mann macht das immer so" hinzu......</P>

          <P>"Man kann gut darauf trommeln", grinse ich sardonisch,
          "aber der Tag, an dem Du mir einen eine Woche alten
          H&uuml;hnersalat mit ins B&uuml;ro gibst, wird der Tag
          unserer Scheidung sein." Ich wende mich Frau Mesenkamp
          zu: "Was soll dieses Wunderwerk malaysischer
          Spitzenkonservierungstechnologie denn kosten?"</P>

          <P>Das Poppen mit den Deckelchen hat aufgeh&ouml;rt. Die
          Damen schauen mich teils fragend, teils feindselig an.
          Preisfragen stellen. Bei so einem Spitzenprodukt. Wie
          kann ich nur......</P>

          <P>Frau Mesenkamp, die meine Frage irrt&uuml;mlich als
          Kaufsignal wertet, strahlt mich an wie ein Christbaum
          "bei Abnahme von 10 St&uuml;ck kostet Sie eine
          Sch&uuml;ssel grade mal 2 Euro...."</P>

          <P>Wie? 2 Euro, damit ich von einem eine Woche alten
          H&uuml;hnersalat keinen Durchfall kriege?</P>

          <P>Ich wiege die lauernd wartende Mesenkamp in
          Sicherheit: "wie viel kostet eine Sch&uuml;ssel, wenn ich
          Ihnen 20 St&uuml;ck abnehme?"</P>

          <P>"Oh" sagt das Mesenkamp, da muss ich
          nachschauen"....</P>

          <P>"Tun sie das".</P>

          <P>Und w&auml;hrend die Herrin der Sch&uuml;sselchen nach
          ihrer Rabattliste kramt, starren die Mammis ihre
          Gastgeberin mit einer Mischung aus H&auml;me und
          Verachtung an. 20 Sch&uuml;sselchen. Meine Frau blitzt
          mich zornig an und tritt mir unter dem Tisch ans
          Schienbein. Aber jetzt gibt es kein Zur&uuml;ck.</P>

          <P>"Naja, Schatz, so oft, wie ich Reste essen muss...."
          Hinten kichert die Mutter des besten Freundes meines
          Sohnes und meine Gattin wechselt die Gesichtsfarbe.</P>

          <P>"Einseurof&uuml;nfundsiebzich" piept Frau Mesenkamp
          aus der Kreismitte, aber jetzt geht es nicht mehr um den
          Preis. Jetzt geht es um das Prestige meiner
          Lebenspartnerin als treusorgende Ehefrau.</P>

          <P>"Wann hast Du je Reste essen m&uuml;ssen.... ?" zischt
          sie.</P>

          <P>"Wann hat es bei uns je H&uuml;hnersalat gegeben, Du
          kannst doch gar keinen machen" gebe ich trotzig
          zur&uuml;ck und beschlie&szlig;e, die Situation weiter
          eskalieren zu lassen mit dem Satz, den jede Ehefrau nach
          "Ich muss Dir was gestehen" am meisten hasst: "Meine
          Mutter, die konnte H&uuml;hnersalat machen, der war immer
          klasse."</P>

          <P>"Willst Du damit sagen, dass Dir mein Essen nicht
          schmeckt?" Erneuter Gesichtsfarbwechsel.</P>

          <P>"Naja, bei Dosenravioli kann man ja nicht viel falsch
          machen" schlage ich zur&uuml;ck.</P>

          <P>Allgemeines, verhaltenes Kirchern in der Runde. Nur
          Frau Mesenkamp schweigt und &uuml;berlegt sich, wie sie
          die Situation entsch&auml;rfen und ihre T&ouml;pfchen
          doch noch an Mann und Frau bringen k&ouml;nnte. Aber sie
          braucht zu lange!</P>

          <P>"Mein lieber Mann", die schneidende Stimme meint dabei
          das Gegenteil von "lieber Mann", "ich racker mich von
          fr&uuml;h bis sp&auml;t ab und mache jedes Essen frisch
          und das wei&szlig;t Du auch!"</P>

          <P>"Und warum willst Du dann Tuppert&ouml;pfchen zum
          Frischhalten kaufen? Du widersprichst Dir doch selbst,
          merkst Du das nicht?"</P>

          <P>Frau Mesenkamp hat gespannt, wohin das f&uuml;hrt. Nix
          mit T&ouml;pfchenverkauf in der Damenrunde.
          Schlie&szlig;lich will sich keine als Resteverwerterin
          outen. Sie startet einen letzten Versuch mit "man kann in
          den Schalen ja auch Kuchenteig anr&uuml;hren" aber ich
          blocke mit "meine Frau kann nur eines noch weniger gut
          als H&uuml;hnersalat - das ist Kuchenbacken."</P>

          <P>Das wars. Meine Frau springt auf, heult, knallt zuerst
          mir eine und dann die Zimmert&uuml;re zu und ist weg.</P>

          <P>In die peinliche Stille geben die anwesenden Ladys,
          die mich mitterlweile f&uuml;r das gr&ouml;&szlig;te
          Chauvischwein der Welt halten, ihre T&ouml;pfchen Frau
          Mesenkamp zur&uuml;ck, diese sackt flugs wie ein
          Eichh&ouml;rnchen ihren Ramsch ein, alles verabschiedet
          sich mehr oder weniger murmelnd von mir, weil alle noch
          gaaaanz wichtige Termine haben, ziehen im
          G&auml;nsemarsch zur T&uuml;r und weg sind sie. Frau
          Mesenkamp und ihre Partygirls.</P>

          <P>Und ich klopfe mir auf die Schulter. Nichts bei Tupper
          gekauft!</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

