<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>Windows 95</TITLE>
  </HEAD>

  <BODY background="images/bgf.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>Windows 95</B></FONT></P>

          <P>Microsoft GmbH<BR>
          Edisonstra&szlig;e 1<BR>
          85716 M&uuml;nchen</P>

          <P>&nbsp;</P>

          <P>20. September 1995</P>

          <P>&nbsp;</P>

          <P>Sehr geehrte Damen und Herren,</P>

          <P>immer schon wollte ich einen Computzer haben mir nie
          einen leisten k&ouml;nnen. Jetzt habe ich ein paar Jahre
          gespart und bin ein sogenannter User. Der Verk&auml;ufer
          hat mir einen Benzium 90 verkauft, der sei sehr schnell,
          hat er gesagt. Der k&ouml;nnte angeblich schneller
          rechenen als mein Taschenrechner. Aber so schnell braucht
          der garnicht sein, weil ich habe ja Zeit genug. Aber ich
          schreibe Ihnen deshalb, weil ich Sie wirklich loben
          mu&szlig;. Ich hab mir n&auml;mlich dieses neue Windows
          95 dazu gekauft. Also ich mu&szlig; Ihnen sagen, das hat
          mich echt umgehauen. Ja so ein tolles Programm! Es ist
          wirklich beeindruckend, was Ihrem Chef da alles
          eingefallen ist. Dieser Gill Bates ist ein toller Hecht.
          Der mu&szlig; ja einen Kopf haben wie ein Elefant. Ja wie
          kann man sich denn sowas ausdenken? Sagen Sie ihm bitte
          einen sch&ouml;nen Gru&szlig; von mir, wenn Sie ihn
          sehen. Und sagen Sie ihm, da&szlig; ich ein Fan von ihm
          bin, obwohl er Amerikaner ist. Aber ich bin
          &uuml;berhaupt nich ausl&auml;nderfeindlich.</P>

          <P>Ich war ganz fasziniert, weil man da ja kaum mehr eine
          Tastatur dazu braucht. Alles l&auml;uft da mit dieser
          Maus. Was mich allerdings verwirrt, ist der Umstand,
          da&szlig; diese Maus zwei Kn&ouml;pfe hat, wo doch
          meistens nur der linke davon funktioniert. Ich nehme an,
          da&szlig; der rechte der Reserveknopf ist, falls der
          linke kaputtgeht. Aber da werde ich schon noch
          dahinterkommen. Auf dieser Maus steht &uuml;brigens auch
          Microsoft drauf. Und wieviele Fenster man da aufmachen
          kann! Ich habe zwischenzeitlich schon 8 Fenster auf
          einmal aufgemacht, und eins war sch&ouml;ner und bunter
          wie das andere. Ich bin auch draufgekommen, da&szlig; man
          diese Fenster gro&szlig; und klein machen kann und auf
          dem ganzen Bildschirm rumfahren kann damit. Das finde ich
          schon saupraktisch.</P>

          <P>Ich habe meinen Computer jetzt zwei Tage und habe mir
          gedacht, ich schreibe gleich den ersten Brief an Sie,
          weil das f&uuml;r mich auch eine gute &Uuml;bung ist. Ich
          habe dazu so ein Tintenschreibdruckger&auml;t, der sogar
          farbig drucken t&auml;t, wenn man da eine farbige
          Tintenh&uuml;lse reint&auml;te. Der Verk&auml;ufer wollte
          mir eine aufschw&auml;tzen. Aber das ist mir momentan zu
          viel Geld.</P>

          <P>Ich nehme an, da&szlig; Ihr Chef an diesem Programm
          weiterprogrammiert und m&ouml;chte mich jetzt schon
          vormerken lassen f&uuml;r n&auml;chstes Jahr f&uuml;r
          Windows 96. Bitte senden Sie mir Unterlagen zu.
          Vielleicht hat Ihr Chef noch andere Programme auf Lager,
          die t&auml;ten mich auch intressieren, jedenfalls
          w&auml;re es nett, wenn ich was von Ihnen h&ouml;ren
          w&uuml;rde. Ich kaufe Ihnen wahrscheinlich auch was
          ab.</P>

          <P>F&uuml;r Ihre M&uuml;he herzlichen Dank.</P>

          <P>Mit freundlichen Gr&uuml;&szlig;en</P>

          <P>xxxxxxx</P>
          <HR>

          <H3>Die Antwort</H3>

          <P>Firma<BR>
          Datentechnik<BR>
          Unterschlei&szlig;heim, 11.10.95</P>

          <P>PJ/hae<BR>
           Ihr Schreiben vom 20.09.95</P>

          <P>Sehr geehrter Herr xxxxxxx,</P>

          <P>Herzlichen Dank f&uuml;r Ihr nettes Schreiben zu
          Windows 95; es wird meinen Mitarbeitern und mir lange in
          Erinnerung bleiben, so viel Freude hat es uns bereitet.
          Wir bekommen t&auml;glich Tausende von netten Schreiben,
          aber Ihres war besonders lieb.</P>

          <P>Ich darf Sie im Namen der Microsoft GmbH nicht nur im
          Kreis der sogenannen User 1) begr&uuml;&szlig;en; nein,
          Ihr Wissen macht es unabdingbar, Sie auch in den
          elit&auml;ren Kreis der Microsoft Insider aufzunehmen.
          Nur wenigen Menschen ist es vorbehalten, die Wahrheit
          &uuml;ber unseren Chef zu erfahren: Er hei&szlig;t
          n&auml;mlich wirklich Gill Bates. Nur durch eine breit
          angelegte Pressekampagne - Sie k&ouml;nnen sicherlich
          nachvollziehen, was die Presse bewirken kann - war es
          m&ouml;glich, der Software-Gemeinde vorzugaukeln,
          da&szlig; er Bill Gates hei&szlig;t. Kann ja auch gar
          nicht sein, denn sonst w&auml;ren beide Namen rechlich
          gesch&uuml;tzt, oder? Wie haben Sie das nur
          rausbekommen?</P>

          <P>Ich soll Sie &uuml;brigens recht herzlich von Gill
          gr&uuml;&szlig;en. Er freut sich &uuml;ber jedes nette
          Schreiben zu Windows 95, und er m&ouml;chte auch jedes
          pers&ouml;nlich beantworten, aber leider sind das halt
          sehr, sehr viele. &Uuml;brigens hat er eigentlich einen
          normal gro&szlig;en Kopf, obwohl da t&uuml;chtig was rein
          geht. Er ist aber deshalb so erfolgreich, weil da auch
          ordentlich was raus kommt.</P>

          <P>Gill hat sich besonders &uuml;ber Ihre
          Ausf&uuml;hrungen zur Microsoft Mouse gefreut - ja, Sie
          haben recht, es ist die Reservetaste. Es kommt aber noch
          eine weitere Funktion hinzu. Wenn man &ouml;fters
          zwischen der linken und rechten Maustaste und
          gleichzeitig zwischen Mittelfinger und Zeigefinger
          abwechselt, dann kommt es viel seltener zu den in
          Anwenderkreisen gef&uuml;rchteten
          Mausfellfingerentz&uuml;ndungen (tbu 2)). An diesem
          Problem haben wir in unseren Usability-Labs 3) jahrelang
          gearbeitet, und das Ergebnis ist die rechte Schontaste
          der Maus, in Fachkreisen kurz DRStDM genannt.</P>

          <P>Zum Abschlu&szlig; m&ouml;chten wir Ihnen noch einen
          gesundheitlichen Rat geben. Jetzt, wo es "herbstelt" und
          der Winter quasi vor dem Windows steht, machen Sie besser
          nie mehr als 6 Fenster gleichzeitig auf - man holt sich
          schnell einen Zug.</P>

          <P>Weil wir Ihr Schreiben so nett finden, schicken wir
          Ihnen mit seperater Post ein Windows[tm] Shirt zu, weil
          wir sicher sind, Sie werden viel Freude damit haben.</P>

          <P>xxxxxxxx<BR>
          Director<BR>
          End-User Sales &amp; Marketing</P>

          <P>PS: Bei Ihren Ausf&uuml;hrungen zu "Benzium 90"
          wu&szlig;ten wir lange nicht, was Sie meinen. Aber wir
          haben es rausgekriegt. Sie meinen sicherlich Bentzium 19
          von Indel. Das haben mir meine Kollegen aus N&uuml;rnberg
          erkl&auml;rt.</P>

          <P>1) Wer nachweisen kann, da&szlig; er mindestens 3
          Jahre Windows-Erfahrung hat, den Text des Rolling Stones
          Song "Start me Up" auswendig singen und mehr als 12
          Fenster gleichzeitig bedienen kann, der wird von
          Microsoft vom User zum Power-User bef&ouml;rdert. Das ist
          so, wie eine Bef&ouml;rderung vom Gefreiten zum
          Obergefreiten. Aber ich bin &uuml;berhaupt kein
          Militarist! Wer einen Kurs besucht, der kann sogar zum
          MCM werden &middot; Microsoft Certified Mouser.</P>

          <P>2) to be understood</P>

          <P>3) das sind kleine, beheizte Zimmer, wo Anwender u.a.
          den ganzen Tag auf die Maustasten dr&uuml;cken, um zu
          sehen, wann die Maus schlapp macht.</P>
          <HR>

          <P>[waschweib]-Homepage:
          http://waschweib.blindzeln.de</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

