<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="AUTHOR" content="Thomas Nawroth">

    <TITLE>MPEG nach CDXL konvertieren</TITLE>
  </HEAD>

  <BODY bgcolor="#aaaaaa">
    <TABLE border="0" cellpadding="8">
      <TR>
        <TD>
          <P>Im Internet findet man unter "www.humor.li" neben
          Witzen und lustigen Fotos / Bildern eine gro&szlig;e
          Anzahl lustiger Filmchen aus allen m&ouml;glichen
          Bereichen. Jedem, der diese Seite noch nicht kennt, kann
          ich nur empfehlen dort mal vorbeizusurfen.</P>

          <P>Die meisten Filme sind jedoch im "MPEG"-Format. Bei
          meiner Config (68030/50Hz) bedeutet dies: graue,
          ruckelnde Bilder mit asyncronem Ton - eigentlich egal mit
          welchem Player. Da vergeht mir selbst beim lustigsten
          Film das Lachen. Also begab ich mich auf die Suche nach
          einer L&ouml;sung - und fand eine. Sie lautet CDXL.
          Deshalb hier nun mein Bericht, wie ich MPEG-Filme in CDXL
          konvertiere.</P>

          <H1 align="CENTER">MPEG -&gt; CDXL</H1>

          <P>Im Aminet findet man das Archiv Mp2Anim.lha. von
          Lorence Lombardo. Hierbei handelt es sich um eine
          Sammlung verschiedener Programme und einem Skript, mit
          dem es m&ouml;glich ist, MPEG-Animationen in das AMIGA
          Animation 5 Format umzuwandeln. Das ganze funktioniert
          absolut problemlos, mit einem Doppelklick auf das Skript,
          Auswahl des umzuwandelnden Films und Angabe des
          Ziel-Pfades und -Namens. Es kann sogar unter mehreren
          Formaten gew&auml;hlt werden.</P>

          <P align="center"><IMG src="Images/opm.gif" alt=
          "Output-Mode" width="522" height="72"></P>

          <P>Als optimal f&uuml;r das CDXL-Format erscheint mir ein
          Animationsformat der Gr&ouml;&szlig;e 160 * 120 bei 256
          Farben. Aus der Bildgr&ouml;&szlig;e des MPEG-Films
          ergibt sich somit, ob ich 256 oder 256_Scale
          ausw&auml;hle. Viele MPEG-Filmchen sind n&auml;hmlich
          bereits in der Gr&ouml;&szlig;e 160 * 120.</P>

          <P>Nachdem dies ausgew&auml;hlt wurde, hat man -
          abh&auml;ngig von der L&auml;nge des Films und der
          Gr&ouml;&szlig;e der Bilder entweder viel Zeit, oder
          seeeehr viel Zeit.</P>

          <P><U>Beispiel:</U></P>

          <P>Der (Ultra-)Kurzfilm mit dem Titel "Simpson: Beliebige
          Taste", zu finden auf www.humor.li -&gt; Filme -&gt;
          Comics besteht aus 200 Frames mit einer Gr&ouml;&szlig;e
          von 160 * 120. Also kann auf Skalierung verzichtet
          werden. Das Umwandeln in eine 256-Farben-Animation
          (ANIM5) dauerte 75 Minuten. Und das ist erst der erste
          Schritt zu CDXL. Stefan Raab`s Raabigramm an Brisko
          Schneider besteht aus 3370 Frames und dauerte mindestens
          36 Stunden. Als der AMIGA irgendwann nachts fertig war,
          habe ich geschlafen :-)</P>

          <P>Nun liegt also schon einmal eine Animation vor, die
          ruckelfrei und in Farbe abl&auml;uft. Diese kann mit
          vielen im Aminet erh&auml;ltlichen Playern, oder auch mit
          einem Malprogramm (ich verwende PPaint) betrachtet
          werden.</P>

          <P>Mit CDXL ist es m&ouml;glich eine vertonte Animation
          vor einem Hintergrund-Bild abzuspielen. Dies f&uuml;hrt
          dazu, da&szlig; eine 160 * 120 Animation nicht in der
          Monitormitte mit dickem schwarzen Rand ablaufen muss,
          sondern an einem beliebigen Platz in einen Rahmen
          eingebettet abgespielt werden kann.</P>

          <P>Daraus ergibt sich jedoch wiederum ein Problem. Jedes
          Bild der Animation besitzt eine eigene Farbpalette.
          F&uuml;r die Verwendung eines Rahmens ist dies
          nat&uuml;rlich nicht gut. Daher f&uuml;hre ich folgende
          Schritte durch:<BR>
           Die Animation mit PPaint laden und diese komplett als
          Anim-Brush ausschneiden. Ich habe eine sehr gut geeignete
          Standart-Farbpalette, die durch Druck auf die
          "Help"-Taste in das aktuelle Bild &uuml;bernommen wird.
          Der Aufruf des Menus "Pinsel", "Farbe", "Neu verteilen"
          f&uuml;hrt dazu, da&szlig; die Farben jedes einzelnen
          Frames des Anim-Brushes passend zu meiner
          Standart-Farb-Palette neu verteilt werden. Wenn nun auch
          das Hintergrundbild, bzw. der Rahmen die selbe Palette
          besitzt, gibt es nun keine Probleme beim Abspielen mehr.
          Allerdings gilt auch hier der Satz: Nachdem dies
          ausgew&auml;hlt wurde, hat man - abh&auml;ngig von der
          L&auml;nge des Films entweder viel Zeit, oder seeeehr
          viel Zeit. In einer Stunde werden ca 200 Frames
          umgerechnet.</P>

          <P>Zum Erstellen einer CDXL-Animation m&uuml;ssen die
          einzelnen Frames des Anim-Brushes als IFF-Bild vorliegen.
          Dies erledigeich mit dem Programm "Main Actor". Auf der
          Aminet 13 CD findet man die uneingeschr&auml;nkte Version
          1.55, dieses Programms.</P>

          <P>Nun fehlt noch der Ton.</P>

          <P>Auch hier wird man im Aminet f&uuml;ndig. Und zwar
          kann mit dem Programm "Mpgtoanim" der Ton eines
          MPEG-Filmes im mp3-Format abgespeichert werden. Das
          Programm konvertiert zwar auch MPEG in ANIM5, hat jedoch
          gegen&uuml;ber dem von mir bevorzugten Programm den
          Nachteil, da&szlig; es keine 256 Farben-Konvertierung
          anbietet. Zum Gl&uuml;ck wird der Ton zuerst
          abgespeichert, bevor das Programm mit der Umwandlung
          beginnt, die ich dann einfach abbreche. Der Ton mu&szlig;
          f&uuml;r CDXL nat&uuml;rlich im IFF-Format vorliegen.
          F&uuml;r diese Umwandlung benutze ich das Programm
          "Forrest" von Timo Savola.</P>

          <P>Nun liegen also die Frames, alle mit der gleichen
          Farbpalette, und der Ton im IFF-Format vor. Um nun daraus
          einen Tonfilm zu erstellen benutze ich das XLToolkitGUI
          von Christian Effenberger. Dies funktioniert eigentlich
          auch problemlos.</P>

          <P>Wenn alles soweit fertig ist, mach ich noch ein
          passendes Hintergrund-Bild und schreibe ein kleines
          Skript, das durch Doppelklick den Film ablaufen
          l&auml;&szlig;t. Das sieht z.B. so aus:</P>
          <BR>

          <TABLE align="CENTER" border="1">
            <TR>
              <TD>cdgsxl Brisko.CDXL X 2 Y 52 BLIT XLSPEED 131 BACK
              Brisko.Back LOOP -1 DOSXL LMBABORT<BR>
              EndCLI &gt;NIL:</TD>
            </TR>
          </TABLE>

          <P>Jetzt l&auml;uft der Film endlich ruckelfrei und in
          Farbe, vor einem Hintergrundbild bzw. Rahmen, der den
          Eindruck einer Fullscreen-Darstellung
          hinterl&auml;&szlig;t.</P>

          <P>Beide Formate im direkten Vergleich am Beispiel Stefan
          Raab`s Raabigramm an Brisko Schneider:</P>

          <TABLE align="CENTER" border="3">
            <TR>
              <TD>
                <CENTER>
                  <B>MPEG</B>
                </CENTER>
              </TD>

              <TD>
                <CENTER>
                  <B>CDXL</B>
                </CENTER>
              </TD>
            </TR>

            <TR>
              <TD>Dateigr&ouml;&szlig;e<BR>
              7.393.970 Byte</TD>

              <TD>Dateigr&ouml;&szlig;e<BR>
              36.244.350 Byte</TD>
            </TR>

            <TR>
              <TD>256 graustufen<SUP>*</SUP></TD>

              <TD>256 Farben<SUP>*</SUP></TD>
            </TR>

            <TR>
              <TD>&uuml;berspingen von<BR>
              Frames, damit Ton<BR>
              syncron l&auml;uft<SUP>*</SUP></TD>

              <TD>12,5 Frames/Sekunde<BR>
              syncroner Ton<SUP>*</SUP></TD>
            </TR>

            <TR>
              <TD>Nach download ab-<BR>
              spielbar</TD>

              <TD>Nach Download ca. drei<BR>
              Tage Convertierung,<BR>
              dannach abspielbar.</TD>
            </TR>

            <TR>
              <TD>Plattform-unab-<BR>
              h&auml;ngig</TD>

              <TD>Nur auf AMIGA lauff&auml;hig</TD>
            </TR>

            <TR>
              <TD align="center"><A href="Images/mpeg1.gif"><IMG
              src="Images/mpeg1k.gif" alt="MPEG-Screenshot" width=
              "80" height="60"></A></TD>

              <TD align="center"><A href="Images/cdxl1.gif"><IMG
              src="Images/cdxl1k.gif" alt="CDXL-Screenshot" width=
              "80" height="64"></A></TD>
            </TR>

            <TR>
              <TD align="center"><A href="Images/mpeg2.gif"><IMG
              src="Images/mpeg2k.gif" alt="MPEG-Screenshot" width=
              "80" height="60"></A></TD>

              <TD align="center"><A href="Images/cdxl2.gif"><IMG
              src="Images/cdxl2k.gif" alt="CDXL-Screenshot" width=
              "80" height="64"></A></TD>
            </TR>
          </TABLE>
          <BR>
           <SUP>*</SUP> Die Werte sind f&uuml;r meinen Geschmack,
          bei meiner Konfig. (AMIGA 1200, 68030/50Hz, 64MB
          FastMem), die Besten und k&ouml;nnen vom Anwender
          bestimmt werden. 

          <P>Ich habe festgestellt, das dies gerade die Leute
          beeindruckt, die von AMIGA auf PC umgestiegen sind, und
          dem AMIGA so etwas eigentlich nicht zugetraut
          h&auml;tten. Aber haupts&auml;chlich tue ich dies
          nat&uuml;rlich zu meinem eigenen Vergn&uuml;gen, denn ein
          lustiger MPEG-Film ist im CDXL-Format nochmal so
          lustig.</P>

          <P>Also probiert es doch selber einmal aus. Evtl.
          auftretenden Fragen eurerseits werden gerne beantwortet,
          soweit ich das kann. Auch gibt es noch den ein oder
          anderen Tipp / Trick, den ich hier nicht erw&auml;hnt
          habe. Aber auch gerne gelesen werden Tipps von Euch,
          falls Ihr wisst wie der ein oder andere
          Umwandlungs-Schritt verbessert werden kann, oder sonstige
          Info &uuml;ber CDXL.</P>

          <P>Wer ersteinmal sehen m&ouml;chte, was mit CDXL
          m&ouml;glich ist, sollte im Aminet den Suchbegriff "CDXL"
          eingeben....</P>
          <HR>
          <BR>

          <TABLE align="CENTER" border="3">
            <TR bgcolor="#ffffff">
              <TD><A href="mailto:">Thomas Nawroth</A></TD>
            </TR>
          </TABLE>
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

