<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Amiga OS 3.5 Boing Bag 2</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Amiga, tai oikeastaan Haage &amp; Partner, julkaisi edellisen korjausp&auml;ivityksen eli Boing Bagin Amiga OS 3.5:een ennen vuoden 1999 joulua, kun Gateway viel&auml; omisti Amigan. Boing Bag kakkosesta oli puhetta jo pian sen j&auml;lkeen, mutta mit&auml;&auml;n ei kuulunut pitk&auml;&auml;n aikaan. Sitten julkistettiin Amiga OS 3.9, ja useiden Boing Bag kakkoseen tarkoitettujen p&auml;ivitysten arveltiin siirtyneen siihen, ja hetken aikaa koko p&auml;ivityksen ilmestymist&auml; ep&auml;iltiin.
						<p>Boing Bag 2 kuitenkin julkaistiin viimein vuodenvaihteen tiet&auml;mill&auml;, reilut kaksitoista kuukautta ensimm&auml;isen Boing Bagin julkaisun j&auml;lkeen. Boing Bag ykk&ouml;nen toi mukanaan muutaman megan edest&auml; kaikenlaista pient&auml; ekstraa, mutta Boing Bag 2 keskittyy l&auml;hinn&auml; korjauksiin. Workbenchista, AmigaMailista, Multiviewist&auml;, HDToolBoxista, amigaguide.datatypest&auml; ja asl.libraryst&auml; on korjattu bugeja. N&auml;kyvi&auml; muutoksia ei l&ouml;ytynyt, mit&auml; nyt AmigaMail k&auml;ytt&auml;&auml; Address Bookista valittaessa vastaanottajien nimi&auml; s&auml;hk&ouml;postiosoitteiden lis&auml;ksi.</p>
						<center>
							<p><img height="370" width="400" src="kuvat/boingbag2.jpg" border="0" alt=" "></p>
						</center>
						<p>Lis&auml;ksi Boing Bag sis&auml;lt&auml;&auml; joukon uusia lokalisaatioita suomi mukaan lukien. K&auml;&auml;nn&ouml;s on kohtuullisen onnistunut, joskin sis&auml;lt&auml;&auml; muutamia merkkikokovirheit&auml; ja v&auml;hemm&auml;n onnistuneita k&auml;&auml;nn&ouml;ksi&auml;. Ymm&auml;rrett&auml;v&auml;sti k&auml;&auml;nt&auml;j&auml;n teht&auml;v&auml; ei ole ollut helppo, eih&auml;n Amigalle ole kovin hyvin vakiintuneita k&auml;&auml;nn&ouml;ksi&auml; eik&auml; k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml; ole kaikilta osin varustettu kest&auml;m&auml;&auml;n pitki&auml; suomenkielisi&auml; sanoja. Joka tapauksessa mukava lis&auml;, joka varmasti pienell&auml; hiomisella muotoutuu aivan k&auml;ytt&ouml;kelpoiseksi vaihtoehdoksi englannille.</p>
						<p>Tammikuun alussa Boing Bag 2:sta julkaistiin uusi hieman p&auml;ivitetty versio 2a, joka korjaa 2:n ongelmia. Boing Bag 2 vaatii Amiga OS 3.5:n ja sen saa osoitteesta: <a href="http://www.amiga.com/3.5/support.shtml" target="_blank">http://www.amiga.com/3.5/support.shtml</a></td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
