<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Amiga OS 3.9 pikatestiss&auml;</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">&quot;Tohtori AivoTurmio&quot; &lt;<a href="mailto:drbraindamage@nic.fi">drbraindamage@nic.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Amiga OS 3.9:n asennus oli helppoa. Mukavaa olisi kuitenkin ollut, jos heti alussa jo olisi kerrottu tyhj&auml;n levykkeen tarpeellisuudesta (sit&auml; tarvitaan asennuslevykkeen tekoon), eik&auml; vasta siin&auml; vaiheessa, kun asennus v&auml;&auml;r&auml;st&auml; paikasta alkoi. Mik&auml;&auml;n iso asia tuo ei ole, mutta se hieman verotti paketin ammattimaista kuvaa. Muuten idea levykkeen k&auml;yt&ouml;st&auml; oli hyv&auml;. Jos jokin olisi mennyt asennuksessa pieleen, niin pelastuslevykkeen, jolla saisi koneen silti viel&auml; normaalisti k&auml;yntiin, olisi tuntenut todella tervetulleeksi.
						<p>Kun asennus oli ohi, tuli eteeni sama ongelma johon t&ouml;rm&auml;sin Boing Bag 2:nkin kohdalla. Kone nimitt&auml;in vain pys&auml;htyi yht&auml;kki&auml; kesken startin. Ei kaatunut tai mit&auml;&auml;n., vain pys&auml;htyi. Kyseinen ongelma oli SquirrelSCSI-ohjaimeeni liittyv&auml;. Ongelman sain kuitenkin netin kautta selvitetty&auml;. Startup-sequencea pit&auml;&auml; muuttaa niin, ett&auml; &quot;execute s:squirrel-startup&quot; -rivi on ennen &quot;C:Setpatch QUIET&quot; -rivi&auml;.</p>
						<p>Kun sitten sain OS 3.9:n lopulta toimimaan, p&auml;&auml;sin kokeilemaan my&ouml;s sen ominaisuuksia. Selv&auml;sti huomaa taas, ett&auml; Amigaa suunnataan kohti monitoreja ja n&auml;ytt&ouml;kortteja, mik&auml; toki on hyv&auml; asia. 640x256-resoluutiolla nimitt&auml;in OS 3.9:&auml;&auml;n kuuluva AmiDock vie aika inhottavasti tilaa. Sen sijaan 640x512 tuo olisi ollut jo aika n&auml;pp&auml;r&auml;n kokoinen. Mutta muuten AmiDock on kyll&auml; ihan n&auml;pp&auml;r&auml; ohjelma, joka vastaa l&auml;hinn&auml; Amigan&nbsp;Toolmanageria tai Windowsin K&auml;ynnist&auml;-painiketta. Eroja kuitenkin on.</p>
						<p>Amidock nimitt&auml;in on koko ajan n&auml;kyviss&auml; ja siin&auml; on ikkuna, jonka sis&auml;ll&ouml;n voi valita siten, ett&auml; tekee esimerkiksi ryhm&auml;n Internet ja pelit. Kun valitsee &quot;Internet&quot;, saa n&auml;kyviin lis&auml;&auml;m&auml;ns&auml; Internet-ohjelmat, ja vastaavasti &quot;pelit&quot; valitsemalla ikkuna n&auml;ytt&auml;&auml; pelit, jotka sinne on laitettu. Pieni tottuminen on siin&auml;, ett&auml; Amidockin ikoneita t&auml;ytyy klikata vain kerran totutun kahden sijaan. My&ouml;s se h&auml;iritsee, ettei Amidockia saa vapaasti sijoittaa minne tahansa, vaan sen t&auml;ytyy aina olla reunoilla. Vaikka Amidockissa pieni&auml; suunnitteluvirheit&auml; onkin, on se silti hyvin toimiva.</p>
						<p>Seuraavana on erityisesti 030-omistajia ilahduttamaan AVI/MOV/QT-player, ACTION. Kyseinen playeri nimitt&auml;in toimi ainakin minun Blizzard 030/50 MHz + 50 Mhz FPU:llani aivan normaali nopeudella ilman ett&auml; &auml;&auml;net p&auml;tkiv&auml;t, joitain harvinaisia ei niin h&auml;ritsevi&auml; v&auml;lej&auml; lukuunottamatta. Tosin kuva toki on mustavalkoinen jne., mutta se ett&auml; 030 saa yleens&auml;k&auml;&auml;n edes jonkinlaisen oikeastaan virheett&ouml;m&auml;n playerin on jo mukavaa. Sen tarpeellisuudesta nyky&auml;&auml;n en sitten tied&auml;, kun monilla kuitenkin on jo huomattavasti isommat tehot koneessaan, eik&auml; 030-koneita pahemmin pit&auml;isi v&auml;ltt&auml;m&auml;tt&auml; en&auml;&auml; hyys&auml;t&auml;k&auml;&auml;n.</p>
						<p>Toisena on sitten MP3-playeri, Amplifier, joka my&ouml;s soitti 030-koneellani kappaleita virheett&auml; ja p&auml;tkim&auml;tt&auml;. &Auml;&auml;nenlaatu tosin ei tainnut olla korkein mahdollinen, mutta ottaen huomioon, mit&auml; vain viikko sitten yritin AMPEG-playerilla saada aikaan, niin t&auml;m&auml; oli todella huomattavasti parempi. Lis&auml;ksi oli viel&auml; CDplay Cd-Levyjen soittoa varten, mutta se ei suostunut minulla toimimaan. EditPad oli taas kerran minulle aivan turha, ja suosiolla laitoin heti tilalle GoldEdin. N&auml;pp&auml;r&auml; pieni tekstieditori sellaiselle, joka moista tarvitsee. Kello oli muuttunut varsin paljon, ja kellon asetuksissakin tuntui olevan melkoisen paljon optioita. Tarpeen tulee my&ouml;s Find-toiminto, joka l&ouml;ytyy Window-valikosta ja jolla voi etsi&auml; tiedostoja.</p>
						<p>Mukavaa oli my&ouml;s, ett&auml; CD:ll&auml; on AVI-videoita, MP3:sia ja CD:ll&auml; audioraita, jotta jokaista uutta player-ohjelmaa voi kokeilla. Kaiken lis&auml;ksi tuo audioraita on Annexia, joten ne jotka eiv&auml;t silloin aikanaan ostaneet levy&auml; tai muuten kuulleet sit&auml;, saavat vihdoin kuulla, millaista se Annexin Amigan-mainostusmusiikki oikein oli. AVI-p&auml;tk&auml;t ovat muutaman katsomani perusteella uusien elokuvien trailereita, lukuunottamatta clickBOOMin Nightlong-pelin traileria.</p>
						<p>Stabiilisuudesta on vaikea sanoa mit&auml;&auml;n, kun OS 3.9 ei ole viel&auml; joutunut pahemmin koetukselle, mutta joitain asioita lukuunottamatta tuntuu kone pystyss&auml; pysyv&auml;n. Ja n&auml;ill&auml; joillain tarkoitan l&auml;hinn&auml; sit&auml;, ett&auml; jokin ohjelma silloin t&auml;ll&ouml;in aiheuttaa koneen kaatumisen. Lyhyen k&auml;ytt&ouml;kokemuksen perusteella n&auml;ytt&auml;isi silt&auml;, ett&auml; ne joilta puuttuu MP3-player, MOV/AVI/QT-player tai jotka omaavat 030-koneen ja tarvitsevat sopivia t&auml;llaisia ohjelmia, saavat OS 3.9:st&auml; kaikkein eniten. Mutta p&auml;ivitys vaikuttaisi kannattavalta ostokselta kenelle tahansa, joka arvostaa kunnon k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml; ja tarpeellisia toimintoja siin&auml;.</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.amiga.com/3.9/" target="_blank">Amiga Inc.</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Edustaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.ge.vip.fi" target="_blank">Gentle Eye Ky</a>, puh. (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">320 mk</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
					<td width="50%" bgcolor="#d8ecfd">68020+, 3.1 ROMit, 6 Mt Fast, kiintolevy, CD-ROM</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Suositus:</font></td>
					<td width="50%" bgcolor="#d8ecfd">68030+, 10 Mt Fast, grafiikkakortti ja/tai scandoubler, modeemi</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Ihannekokoonpano:</font></td>
					<td width="50%" bgcolor="#d8ecfd">68060 ja PowerPC, 32 Mt Fast, 16-bittinen &auml;&auml;nikortti, I/O-kiihdytin</td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
