<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Amiga OS 3.9</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Sami Yl&ouml;nen</font></td>
				</tr>
			</table>
			</p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Vuoden v&auml;lein on nyt n&auml;hty kaksi Amigan k&auml;ytt&ouml;j&auml;rjestelm&auml;p&auml;ivityst&auml;. OS 3.9:st&auml; on sanottu, ett&auml; se on sellainen kuin OS&nbsp;3.5:n olisi pit&auml;nyt olla jo vuosi sitten.&nbsp;Niin tai n&auml;in, OS 3.9:ss&auml; on joka tapauksessa sellaisia ominaisuuksia, joita olisi kaivannut jo OS&nbsp;3.5:een. Luomme nyt pikasilm&auml;yksen tuoreimpaan k&auml;ytt&ouml;j&auml;rjestelm&auml;versioon.
						<p>Heti aluksi muistutan kaikkia, ett&auml; backupit kannattavat, mik&auml;li vain on mahdollisuus moista tehd&auml;. Asennuksessa tuskin ongelmia esiintyy, mutta backupit ovat silti suhteellisen hyv&auml; idea.</p>
						<p>Asennukset sujuivat suhteellisen helposti, ongelmia aiheutti vain ep&auml;t&auml;ydellinen OS 3.5 -asennus (CD-ajurit olivat jotkut antiikkiset ja kaikki OS 3.9 -tiedostot kopioituivat kovalevylle ISOILLA KIRJAIMILLA... hupsis) ja kovalevytilan puute. Boottipartitioni ovat aina olleet noin 60 megatavua, ja nyt ensimm&auml;ist&auml; kertaa tarvitsin lis&auml;&auml; tilaa (tosin vain noin 7 megatavua). My&ouml;s sarjahiiren ajuri hieman vikuroi, kun OS 3.9 -asennus kirjoitti uudelleen NSDPatch.cfg:n (jossa gameport.device pit&auml;&auml; olla disabloitu, jos haluaa koneen k&auml;ynnistyv&auml;n).</p>
						<center>
							<p><img height="59" width="375" src="kuvat/amidock.jpg" border="0" alt=" "></p>
						</center>
						<p>Mist&auml; sitten huomaa, ett&auml; koneessa on OS 3.9 sen k&auml;ynnistytty&auml;? Ensinn&auml;kin ruudun vasempaan alakulmaan on ilmestynyt AmiDock-valikko ja toisekseen Window-valikossa on kohta &quot;Find&quot;. Siin&auml;p&auml; ne n&auml;kyv&auml;t muutokset sitten olivatkin. AmiDock on ToolManagerin tyyppinen ohjelma, jolla saa melko n&auml;ttej&auml; nappuloita ja valikkoja, joista voi k&auml;ynnistell&auml; useimmiten tarvitsemansa ohjelmat suhteellisen nopeasti. OS 3.9:n mukana tulee muun muassa EditPad, Unarc, Amplifier, Action ja PlayCD.</p>
						<center>
							<p><img height="227" width="353" src="kuvat/unarc.gif" border="0" alt=" "></p>
						</center>
						<p>Unarc on tehty kaikenlaisten pakattujen tiedostojen k&auml;sittelemiseen, GUI on suhteellisen simppeli - valitaan vain paketti ja hakemisto mihin se puretaan. Paketin sis&auml;lt&ouml; tulee ikkunaan, ja siit&auml; on mahdollista valita purettavat tiedostot, v&auml;h&auml;n Winzip Classicin tyyliin (joskin turhat nappulat on karsittu).</p>
						<center>
							<p><img height="261" width="271" src="kuvat/amplifier.jpg" border="0" alt=" "></p>
						</center>
						<p>Amplifier taas soittaa MPEG layer 2 ja 3 -tiedostoja (eli tuttavallisemmin mp3:ia). Amplifieriss&auml; toimivat WinAmp-skinit ja mukana seuraakin suhteellisen hieno OS 3.9 skin, jonka Boing-pallo py&ouml;rii elegantisti hissukseen. Mp3-dekoodaus vaatii koneelta hieman enemm&auml;n tehoa kuin muu k&auml;ytt&ouml;j&auml;rjestelm&auml;, mutta hitaammallakin koneella saanee kuulumaan jotain pihin&auml;&auml;.</p>
						<center>
							<p><img height="178" width="167" src="kuvat/action.jpg" border="0" alt=" "></p>
						</center>
						<p>Actionilla voi toistaa mov-, avi- ja qt-videotiedostoja. OS 3.9 CD sis&auml;lt&auml;&auml; muutamia trailereita uudehkoista elokuvista, ja niiss&auml; ainakin Action esiintyy edukseen. J&auml;lleen tosin tehosy&ouml;pp&ouml; ohjelma.</p>
						<center>
							<p><img height="164" width="300" src="kuvat/playcd.jpg" border="0" alt=" "></p>
						</center>
						<p>PlayCD on hy&ouml;dyllinen vain jos omistat CD-aseman (todenn&auml;k&ouml;isesti omistat, jos asensit OS 3.9:n :) Sill&auml; voi toistaa CD-asemassa olevia audio-levyj&auml; ja sen GUI on suunniteltu yhtenev&auml;iseksi Amplifierin GUI:n kanssa. Viehke&auml;sti py&ouml;riv&auml; Boing-pallo t&auml;ss&auml;kin.</p>
						<center>
							<p><img height="73" width="311" src="kuvat/search.gif" border="0" alt=" "></p>
						</center>
						<p>Muita pieni&auml; uudistuksia, joihin todenn&auml;k&ouml;isesti heti t&ouml;rm&auml;&auml;, on text.datatypen haku, eli painamalla enteri&auml; teksti&auml; katsellessa esiin pomppaa hakukentt&auml;. Eritt&auml;in k&auml;ytt&ouml;helpoinen, jos moista ominaisuutta tarvitsee.</p>
						<center>
							<p><img height="162" width="226" src="kuvat/editpad.gif" border="0" alt=" "></p>
						</center>
						<p>Kaiken kaikkiaan voisi todeta jopa ett&auml; OS 3.9 on ihan kiva ja siin&auml; on varmasti paljon ohjelmia, jotka auttavat hy&ouml;dynt&auml;m&auml;&auml;n paremmin omaa rakasta Amigaa. Eri asia sitten on, n&auml;keek&ouml; sellainen k&auml;ytt&auml;j&auml;, jolla on jo rekister&ouml;ityin&auml; n&auml;m&auml; tai vastaavat ohjelmat ja ostettuna OS 3.5, p&auml;ivityst&auml; j&auml;rkev&auml;n&auml;. Onhan uudemmassa k&auml;ytt&ouml;j&auml;rjestelm&auml;ss&auml; toki paljon uutta ja mukavaa kaikille - kuten bugikorjauksia ja uusia bugeja. :) Minulla oli jo suurin osa ohjelmista, jotka OS 3.9:n mukana tulivat, mutta silti mielest&auml;ni sain vastinetta rahoilleni.</p>
						<p>Niin, toki mukana seuraa TCP/IP-pino Genesis (t&auml;ll&auml; kertaa t&auml;ysi versio!) ja uudempi, joskin edelleen Special Edition, versio AWebist&auml;. Vaan enp&auml;s paljastakaan kaikkea, j&auml;&auml; teillekin jotain mit&auml; ihastella kun saatte omat Amiga OS 3.9:nne asennettua!</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.amiga.com/3.9/" target="_blank">Amiga Inc.</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Edustaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.ge.vip.fi" target="_blank">Gentle Eye Ky</a>, puh. (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">320 mk</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
					<td width="50%" bgcolor="#d8ecfd">68020+, 3.1 ROMit, 6 Mt Fast, kiintolevy, CD-ROM</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Suositus:</font></td>
					<td width="50%" bgcolor="#d8ecfd">68030+, 10 Mt Fast, grafiikkakortti ja/tai scandoubler, modeemi</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Ihannekokoonpano:</font></td>
					<td width="50%" bgcolor="#d8ecfd">68060 ja PowerPC, 32 Mt Fast, 16-bittinen &auml;&auml;nikortti, I/O-kiihdytin</td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
