<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Amiga Software Development Kit 1.01</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Esittelimme Amiga Software Development Kitin ensiversiota edellisess&auml; Sakussa laajalti. Seuraavan sukupolven Amigan kehitysymp&auml;rist&ouml;n versio 1.0 ehti vanheta jo usean kuukauden ik&auml;iseksi, ennen kuin ensimm&auml;inen p&auml;ivitys, 1.01, julkaistiin rekister&ouml;ineille k&auml;ytt&auml;jille 28. lokakuuta. T&auml;m&auml;n p&auml;ivityksen tarkoitus oli alustavista ennakkotiedoista poiketen vain tarjota bugikorjauksia ja tuoda Linux SDK samalle tasolle samoihin aikoihin julkaistavan Amiga SDK:n Windows-version kanssa.
						<p>Anu Seilonen tarjosi t&auml;ll&auml;kin kertaa syyskuussa demok&auml;ytt&ouml;&ouml;n hankkimaansa SDK:ta tutkailtavaksi. Kiitos, Anu! P&auml;ivitys oli ilmainen - Amiga tarjoaa ilmaisia p&auml;ivityksi&auml; SDK:hon 12 kuukautta ostop&auml;iv&auml;st&auml; lukien. Toistaiseksi ei ole tiedossa, mit&auml; p&auml;ivitykset t&auml;m&auml;n ajan umpeuduttua maksavat.</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Vaihteeksi helpompi asennus</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Noin 24 megatavun p&auml;ivityspaketti oli noudettavissa Amigan developer-kotisivuilta (<a href="http://www.amigadev.net" target="_blank">http://www.amigadev.net</a>), kun oli ensin kirjoittautunut developer-tunnuksellaan sis&auml;&auml;n ja l&ouml;yt&auml;nyt itsens&auml; Developer-v&auml;lilehden SDK Updates -osastoon.
						<p>Tuoreessa muistissa olivat viel&auml;kin Amiga SDK:n Linux-version asennusvaikeudet (ks. Saku #34), joten oli mukava huomata, ett&auml; ainakin ensimm&auml;inen p&auml;ivitys solahti paikalleen ilman ongelmia. Amigan sivuilla ei valitettavasti tarjottu mit&auml;&auml;n asennusohjeita, mutta eip&auml; niit&auml; ainakaan kokeneempi k&auml;ytt&auml;j&auml; tarvinnut.</p>
						<center>
							<p><img height="105" width="400" src="kuvat/sdk101install.gif" border="0" alt=" "></p>
						</center>
						<p>Kookas tgz-paketti vain siirrettiin Linuxissa sopivaan hakemistoon ja purettiin komennolla &quot;untar -xvzf update_1.01.tgz&quot;. Sen j&auml;lkeen tiedostot asennettiin paikoilleen komennolla &quot;./update&quot;. Jonkin verran Linux-tuntemusta siis tarvittiin, mit&auml; varten jatkossa kyll&auml; toivoisi kunnon asennusohjeita, mutta muuten p&auml;ivitys sujui ongelmitta. Update-ohjelman ajamisen j&auml;lkeen p&auml;ivitetty SDK oli k&auml;ytett&auml;viss&auml; vanhaan malliin.</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Mit&auml; uutta?</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">1.01 on ensisijaisesti korjausp&auml;ivitys, joten mit&auml;&auml;n suurempia uudistuksia ei ollut odotettavissa. 1.0:n haaleita Boing-palloja Amiga Internationalin vanhojen kotisivujen taustakuvan tapaan sis&auml;lt&auml;nyt ty&ouml;p&ouml;yd&auml;n taustakuva on vaihdettu uuteen ja ehompaan, mik&auml; onkin ainoa selv&auml;sti erottuva uudistus. Taustakuva on osa SDK:n uutta logoa, lent&auml;vist&auml; palapelin palasista rakentuvaa Boing-palloa.
						<center>
							<p><img height="311" width="400" src="kuvat/sdk101.jpg"></p>
						</center>
						<p>Start-valikkoon ei ilmestynyt mit&auml;&auml;n uutta, joten muita uudistuksia saikin sitten kaivella pinnan alta. Ainakin C++ -k&auml;&auml;nt&auml;j&auml;ss&auml; olleita bugeja on korjailtu ja ilmeisen onnistuneesti, sill&auml; pian p&auml;ivityksen julkaisun j&auml;lkeen open@amiga.com-postituslistalla hihkuttiin p&auml;ivityksen saaneen jonkin aikaisemmin nikotelleen ohjelman k&auml;&auml;ntym&auml;&auml;n heti k&auml;ttelyss&auml;. My&ouml;s nopeus tuntuu kasvaneen, sill&auml; muutamat SDK:n k&auml;ytt&auml;j&auml;t raportoivat selv&auml;sti parantuneita dhrystone-testituloksia. Siin&auml; miss&auml; GCC:n O2-optimoinnella SDK 1.0 paahtoi dhrystoneja 785 MHz:n P3:lla 1,4 ms, 1.01 selvisi 0,9:ss&auml; ja natiivi-Linux 0,7:ss&auml;. Syy on Amigan mukaan uudessa linkkeriss&auml;, joka optimoi aggressiivisemmin - itse k&auml;&auml;nt&auml;j&auml;&auml; ei ole muutettu. Speed-tulokset eiv&auml;t 333 MHz:n K6-2:llani muuttuneet ajokerrasta riippuvaa vaihtelua enemp&auml;&auml;:</p>
						<p>
						<table border="0" cellpadding="0" cellspacing="2" width="400">
							<tr>
								<td>Amiga 1.0:/$ speed</td>
								<td>Amiga 1.0.1:/$ speed</td>
							</tr>
							<tr>
								<td>VP MIOPS = 415.119007</td>
								<td>VP MIOPS = 415.603390</td>
							</tr>
							<tr>
								<td>VP MLOPS = 74.703084</td>
								<td>VP MLOPS = 74.468394</td>
							</tr>
							<tr>
								<td>VP MFOPS = 25.349671</td>
								<td>VP MFOPS = 25.476597</td>
							</tr>
							<tr>
								<td>VP MDOPS = 21.904094</td>
								<td>VP MDOPS = 21.933300</td>
							</tr>
						</table>
						</p>
						<p>Oikea versionumero muuten on 1.01, ei 1.0.1. J&auml;lkimm&auml;inen tosin tuntuu esiintyv&auml;n useammassakin paikassa, mm. shellin komentokehotteessa, Amigan mukaan johtuen p&auml;ivityksen k&auml;ytt&auml;mien Linux-apuohjelmien versionumerointitavoista. Harmillista sin&auml;ns&auml;, sill&auml; Amiga ehti jo muutenkin t&auml;m&auml;n p&auml;ivityksen kohdalla julkistella useita virheellisi&auml; versionumeroita. Bill McEwenh&auml;n kutsui t&auml;t&auml; p&auml;ivityst&auml; 1.1:ksi, korjaten ett&auml; 1.2:ssa tulevat aikaisemmin ilmoitetut 3D- ja GUI-uudistukset. My&ouml;hemmin Amigalta korjailtiin, ett&auml; 1.1:ss&auml; ne tulevatkin, ett&auml; t&auml;m&auml; ensimm&auml;inen p&auml;ivitys on 1.01...</p>
						<p>1.01:n pit&auml;isi olla my&ouml;s 1.0:aa miellytt&auml;v&auml;mpi asennettava uudemmille RedHateille, sill&auml; ncurses-ongelma on korjattu. Lis&auml;ksi Elate/intent-ohjetiedostoja on p&auml;ivitetty.</p>
						<center>
							<p>* * *</p>
						</center>
						<p>Amiga SDK:sta kiinnostuneiden kannattaa tutustua Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n kotisivuilla loppuvuoden aikana esiteltyihin tusinaan viikon namupalaan eli SDK:lle julkaistuun ilmaisohjelmaan, -peliin ja demoon. Osoitehan on <a href="http://batman.jypoyl.fi/~saku/" target="_blank">http://batman.jypoly.fi/~saku/</a> tai <a href="http://tzimmola.tky.hut.fi/saku/" target="_blank">http://tzimmola.tky.hut.fi/saku/</a>.</p>
						<p>Tutustu my&ouml;s Daniel Robbinsin uuteen SDK-artikkeliin IBM developerWorksissa, jossa katsellaan Amiga SDK:n virtuaaliassemblerin koodia l&auml;hemmin: <a href="http://www-4.ibm.com/software/developer/library/l-amiga3/?dwzone=linux" target="_blank">http://www-4.ibm.com/software/developer/library/l-amiga3/?dwzone=linux</a></td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.amiga.com" target="_blank">Amiga Inc.</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Edustaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.ge.vip.fi" target="_blank">Gentle Eye Ky</a>, puh. (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">850 markkaa (versio 1.0, ilmainen p&auml;ivitys osoitteesta <a href="http://www.amigadev.net" target="_blank">www.amigadev.net</a>)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
					<td width="50%" bgcolor="#d8ecfd">AMD K6-2 333 MHz, RedHat Linux 6.2, 128 Mt muistia, 47 Gt kiintolevytilaa, Creative Labs Graphics Blaster Riva TNT -n&auml;yt&ouml;nohjain, D-Link DE-528CT-verkkokortti, Nokia Multigraph 449M -n&auml;ytt&ouml;.</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Muuta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Saatavilla erikseen ostettava versio Windowsille.</td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
