<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, blind guardian">
<title>Blind Guardian: And Then There Was Silence</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Blind Guardian: And Then There Was Silence</font></h1><BR> (17:49 + Videoclip / Virgin)</center></P>

<p>Zugegbenerma&#223;en: Einfach machten es die Krefelder Bombast Metaller von Blind Guardian es ihren zahlreichen Fans nicht, sind seit dem letzten Geniestreich &quot;Nightfall In Middle Earth&quot; doch gute dreieinhalb Jahre vergangen. Umso gr&#246;&#223;er war die Freude auf die just erschienene Single, derren Release ebenso wie das des Albums immer wieder nach hinten verschoben wurde. Aber das lange Warten hat sich wirklich gelohnt: Der Singletrack &quot;And Then There Was Silence&quot; mit seiner sehr, &#228;h, unkonventionellen Single L&#228;nge von &#252;ber 14 Minuten (!) vereint in sich alle Trademarks von Blind Guardian und nimmt den H&#246;rer mit auf eine akkustische Reise. Dabei ist &quot;And Then There Was Silence&quot; sehr abwechselungsreich, wartet mit zahlreichen Breaks auf und kann fast schon als Progressive Metal bezeichnet werden. Dabei klingen Blind Guardian nat&#252;rlich immer noch nach Blind Guardian, auch wenn die alten Speed Metal Tage damit wohl endg&#252;ltig ad acta gelegt wurden. Neben diesem absolut mitrei&#223;enden Knaller, der allerdings einige Durchl&#228;ufe braucht, um sich richtig festzusetzen, befindet sich auf der Single noch die orchestrale Ballade &quot;Harvest Of Sorrow&quot;, die mit leichten &#196;hnlichkeiten zum &quot;Bards Song&quot;  aufwartet. Abgerundet wird die Single schlie&#223;lich noch von einem Videoclip zum &quot;Imaginations From The Other Side&quot; Smasher &quot;Born In A Mourning Hall&quot;.  Fans der Krefelder Metal Institution m&#252;ssen bei dieser Single einfach zugreifen, muss man anonsten doch noch bis M&#228;rz warten bis der vollst&#228;ndige Longplayer erscheint. Getr&#252;bt wird das positive Gesamtbild der Single lediglich dadurch, dass kein exclusiver Bonus Track vorhanden ist und beide St&#252;cke ebenso auf dem regul&#228;ren Longplayer zu finden sein werden - da hilft auch der Videoclip nicht mehr viel. Trotzdem: An der musikalischen Qualit&#228;t gibt es nichts zu bem&#228;ngeln und deswegen geht der Daumen klar nach oben!</P>

<p>Fazit: ---</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd1.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
