<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,brainstorm,metus mortis">
<title>Brainstorm: Metus Mortis</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Brainstorm: Metus Mortis</font></h1><BR> (50:17 / Metal Blade)</center></P>

<p>Also ehrlich: Das Musik Buiseness kann schon echt unfair und brutal sein! Da legt eine Band wie Brainstorm konstante Killeralben vor (zun&#228;chst &quot;Hungry&quot;, dann das geniale &quot;Unholy&quot; und zuletzt &quot;Ambiguity&quot;), bekommt daf&#252;r die verdienten guten Kritiken und die Verkaufszahlen sind trotzdem nicht so gut wie bei anderen Bands. Tja, hoffentlich wird sich das mit dem neuen Album &#228;ndern, denn auch &quot;Metus Mortis&quot; reiht sich natlos in die Liste der geilen Brainstorm Alben ein. Noch immer regiert erfreulich klischeefreier Power Metal die musikalische Landschaft und es reiht sich ein Killeriff an den n&#228;chsten - die alten Metal Church oder Vicious Rumors lassen hier gr&#252;&#223;en. Ganz egal welchen Track man nun anspielt - Anspieltipps einer eigentlich rundherum gelungenen Platte sind der Opener &quot;Blind Suffering&quot;, das kraftvolle &quot;Strength Of Will&quot; sowie &quot;Checkmate In Red&quot; - man wird als Old School Power Metal Fan garantiert nicht entt&#228;uscht werden, zumal es Brainstorm auf ideale Art und Weise geschafft haben, die St&#228;rken ihrer bisherigen Alben zu b&#252;ndeln und straighter zu Werke zu gehen als noch auf dem stilistisch ziemlich gemischten Vorg&#228;nger. So hat man auf &quot;Metus Mortis&quot;, dessen Coverartwork erfeulicherweise zum ersten mal in der Bandgeschichte rundherum gelungen ist, ganz auf Herzschmerzballaden verzichtet und ballert sich stattdessen mit fetten Gitarrenriffs und Killerrefrains in die Geh&#246;rg&#228;nge der geneigten Fans. S&#228;mtliche Songs werden dabei von der volumin&#246;sen, aber stets melodischen Stimme von S&#228;nger Andy B.Franck (u.a. auch noch mit seiner anderen Combo Symphorce am Start) getragen und erhalten durch seinen eigenen Gesangstil eine v&#246;llig eigenst&#228;ndige Note. Keine Frage: Brainstorm geh&#246;ren zu den hoffnungsvollsten deutschen Power Metal Bands, was vor allem an der hohen Eigenst&#228;ndigkeit und der unb&#228;ndigen Power liegt. Der Sprung an die Spitze d&#252;rfte somit nur noch Formsache sein und ich bin der festen Ansicht, dass Brainstorm auch in Zukunft noch f&#252;r die eine oder andere &#220;berraschung gut sein werden!</P>

<p>Fazit: 9 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd2.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
