<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Edguy Livebericht</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="blue">Konzertbericht: Edguy, Lullacry, Heavenly &amp; Nostradameus vom 6.11.01 Zeche, Bochum</font></center></h1></P>

<p>In den letzten Jahren haben Edguy viel an Boden gut machen k&#246;nnen und z&#228;hlen nicht zuletzt durch das hervorragende aktuelle Album &quot;Mandrake&quot; sowie die Avantasia Oper aus der Feder von Edguy Mastermind Tobias Sammett mit zu der Champions Leage des deutschen Metals. Somit war es nur eine Frage der Zeit bis Edguy auf eine eigene Headlinertour gehen w&#252;rden und nun ist es endlich soweit, wobei es sich die Jungs aus Fulda nicht haben nehmen lassen, drei hervorragende Newcomerbands mit an Bord zu nehmen. Gl&#252;cklicherweise gastierten die Jungs auch in der Bochumer Zeche und somit konnte ich es mir an einem verregneten Dienstag Abend nicht verkneifen, direkt nach der Arbeit auch vor Ort zu sein....</P>

<p>Leider konnte ich nicht p&#252;ntklich vor Ort sein und bekam von Heavenly, die ich liebend gerne gesehen h&#228;tte, nur noch den Rauskicker &quot;Until The End&quot; vom aktuellen Album &quot;Sign Of The Winner&quot; mit. Nostradameus, die mich in Wacken und nicht zuletzt auch auf CD &#252;berzeugt hatten, hatte ich zudem ganz verpasst, wobei die Publikumsresonanzen wohl eher verhaltend gewesen sein sollen. Anyway, als n&#228;chstes rockten Lullacry auf der B&#252;hne ordentlich ab und gaben vom Start weg ordentlich Gas, auch wenn die musikalische Ausrichtung - traditioneller Rock - nicht ganz zum restlichen Programm passen wollte. Davon mal abgesehen waren Lullacry richtig gut und gaben gr&#246;&#223;tenteils Material des aktuellen Albums &quot;Be My God&quot; zum besten. Im Zentrum der Band stand nat&#252;rlich die attraktive S&#228;ngerin, die bei der W.A.S.P. Coverversion &quot;L.O.V.E. Machine&quot; zudem eindrucksvoll bewies, dass sie ihren m&#228;nnlichen Kollegen in nichts nachsteht. Bleibt 
also unter dem Strich eine engagierte Leistung der Band &#252;brig, die ein kurzweiliges Set bot und die Zeit bis Edguy angenehm verk&#252;rzten.</P>

<p>Als Edguy dann endlich die Bretter enterten gab es kein halten mehr. Unterlegt vom mehreren Pyroeffekten, zockten die Jungs gleich ganz arschtight die Speednummer &quot;Fallen Angels&quot; von der aktuellen Platte runter und h&#228;tten wohl keinen passenderen Opener w&#228;hlen k&#246;nnen. Die Meute vor der B&#252;hne stand sofort Kopf und die Stimmung kochte dementsprechend. Bemerkenswert war allerdings die Zusammensetzung des Publikums, welches im Schnitt nicht nur erstaunlich jung war, sondern zudem auch mit einem hohen Frauenanteil aufwarten konnte. Ist Tobias Sammett vielleicht soetwas wie der Fraunschwarm der Metal Szene? Somit wurde es stimmungstechnisch im weiteren Verlauf des Sets vergleichsweise etwas ruhiger, auch wenn Gamma Ray im September die Messlatte schon ziemlich hoch gelegt hatten. Trotzdem gaben sich die Jungs aus Fulda ordentlich M&#252;he, die Stimmung weiterhin am Siedepunkt zu halten und feuerten
mit &quot;Miracle&quot; und &quot;Vain Glory Opera&quot; im weiteren Verlauf des Sets auch alte Highlights ins Publikum. Im Mittelpunkt der Show stand aber erwartunsggem&#228;&#223; das neue Album, wobei insbesondere das &#252;berlange &quot;Pharao&quot;, welches Live mit zahlreichen Effekten wie Feuers&#228;ulen oder brennender Feuern versehen wurde, f&#252;r G&#228;nsehaut Atmosph&#228;re sorgte. Zwischen den Songs sorgte Tobias Sammett mit seinen dummen Spr&#252;chen (&quot;Hallo Bochum!
Wisst ihr, warum hier &#252;berall keine Mikros an der Decke h&#228;ngen? Weil wir hier in Bochum ganz exclusiv kein Live Album mitschneiden.....&quot;) und Ansagen mal wieder f&#252;r zahlreiche Lacher. Die Band ist trotz des zunehmenden Erfolges echt auf dem Boden geblieben und kommt - zumindest in meinen Augen - sympathisch r&#252;ber wie eh und je. Da konnte man Herrn Sammett auch den einen oder anderen schiefen Ton, der aus der PA kam, schonmal verzeihen. Leider war das Spektakel auch schon wieder recht schnell vorbei, wobei ich mir noch den einen oder anderen Klassiker vom &quot;Vain Glory Opera&quot; Album wie z.B. &quot;How
Many Miles&quot; gew&#252;nscht h&#228;tte. Entsch&#228;digt wurde das Publikum aber immerhin mit dem Zugabeteil, der die Avantasia Hymne &quot;Avantasia&quot; sowie den abschlie&#223;enden Rauskicker &quot;Out Of Control&quot; beinhaltete. Insgesamt gesehen war es ein richtig guter Gig von Edguy, der nicht nur 
spielerisch sondern insbesondere auch showtechnisch vollkommen &#252;berzeugen konnte. Wer bisher noch Zweifel hatte, ob Edguy eine eigene Headlinertour erfolgreich durchf&#252;hren k&#246;nnen, der ist nun eines besseren belehrt worden. Bis zum n&#228;chsten mal, Jungs!</P>

<p><b><u>Setlist:</B></U></P>
<p>Intro - &quot;A New Dimension&quot;<BR>
&quot;Fallen Angels&quot; <BR>
&quot;Tears of a Mandrake&quot; <br>
&quot;How many Miles&quot; <BR>
&quot;Land of The Miracle&quot;<BR>
&quot;Painting On The Wall&quot; <BR>
&quot;The Headless Game&quot; <BR>
&quot;Pharaoh&quot;   <BR>
&quot;Vain Glory Opera&quot; <BR>
-Drum Solo-<BR>
&quot;Save Us Now&quot;<BR>

<p>-Encore-</P>

<p>&quot;Avantasia&quot; <BR>
&quot;Out of Control&quot;  </P>  




<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
