<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="red">Newsflash</font></center></h1></P><ul>

<p><li>Bei <b>Running Wild</B> scheint es momentan drunter und dr&#252;ber zu gehen: Nachdem vor kurzer Zeit Peter Pichel als neuer Bassist vorgestellt wurde, verl&#228;sst nun der seit 1994 aktive Gitarrist Thilo Herrmann die Band, um sich mehr auf seine Familie konzentrieren zu k&#246;nnen. Ein Erstzmann steht bisher noch nicht fest, aber die neue CD &quot;The Brotherhood&quot; soll wie geplant Anfang n&#228;chsten Jahres erscheinen.</LI></P>

<p><li> Die schwedischen True Metaller <b>HammerFall</B>, die insbesondere &#252;ber die Produktion des letzten Albums anscheinend doch nicht mehr so erfreut sind, stellen uns f&#252;r Anfang 2002 eine DVD in Aussicht. Auch das modische &quot;Konservendosen&quot; Outfit wollen sich die Jungs nochmal durch den Kopf gehen lassen. Bleibt nur zu hoffen, dass das n&#228;chste Studioalbum wieder besser knallt, als das doch recht durchschnittliche &quot;Renegade&quot; Album.</LI></P>

<p><li> Die US Power Metal G&#246;tter <b>Steel Prophet</B> befinden sich schon wieder im Studio und h&#228;mmern den &quot;Book Of The Dead&quot; Nachfolger ein. Angeblich soll die Platte &#252;brigens in der klassischen Nu-Metal Gitarrenstimmung Cis eingespielt werden. Mal schauen, was Steve Kachinsky und Co. da verbraten....</LI></P>

<p><li> In absehbarer Zeit steht uns aus dem Hause <b>Gamma Ray</B> nicht nur eine Live DVD ins Haus, sondern auch ein Rerelease des gesamten Backkataloges. Die neuen Versionen sollen neben neuen Coverartworks und fetteren Bookletts vor allem auch einige Bonus Tracks enthalten. Das ich pers&#246;nlich von solchen Geschichten nichts halte - immerhin haben die Fans die Platten i.d.R. schon im Regal stehen - und den Weg bef&#252;rworte, den Stratovarius mit der Rarit&#228;ten Compilation &quot;Intermission&quot; gegangen sind, sollte allgemein bekannt sein. Na ja, es wird trotzdem wieder gen&#252;gend Leute geben, die diese Spielchen mitmachen und dadurch tief in den Geldbeutel greifen m&#252;ssen.</LI></P>

<p><li> Und wo wir gerade bei vermeintlicher <b>Abzocke</B> sind: Von dem Iced Earth 5 CD Set &quot;Dark Genesis&quot;, welches die ersten Platten der Jungs sowie eine altes Demo und eine CD mit Coverversionen enth&#228;lt, kann man noch sagen was man will, wenngleich ich der Meinung bin, dass auch hier jeder Fan die Platten bereits im Schrank stehen hat und rund 80 M&#228;rker f&#252;r ein gesuchtes Demo dann doch wieder viel Geld ist. Na ja, ist sicherlich Ansichtssache. Wesentlich kritischer sollte man da schon die beiden Shape Mini CDS &quot;Horroscope&quot; von Primal Fear und &quot;Alive In Torment&quot; von Dimmu Borgir betrachten, die mit einem Presi von rund 20 M&#228;rkern arg &#252;ber`s Ziel hinaus schie&#223;en und dem geneigten Fan neben einigen schon ver&#246;ffentlichten Bonustracks (Primal Fear) nicht mehr alzu viel neues bieten bzw. Live Aufnahmen darstellen (Dimmu Borgir). Bleibt zu hoffen, dass nicht noch mehr Plattenfirmen diese irsinnigen Spielchen mitmachen.</LI></P>

<p><li> Bei <b>Narnia</B> ist die Position des Bassisten nach dem Ausstieg von Jakob Persson derzeit unbesetzt. Die Trennung ist aber v&#246;llig stressfrei verlaufen und ein neuer Bassist wird wohl demn&#228;chst auch vorgestellt werden. Ein neues Album ist aber derzeit noch nicht in der Mache.</LI></P>

<p><li> Auch bei <b>Singery</B> hat es einen kleinen Wechsel geben: Da Drummer Tommi Lillman in Zukunft nur noch bei To / Die / For hinter der Schie&#223;bude sitzen will, wurde er durch Mats Karlsson ersetzt. Das neue Studioalbum &quot;Suicide By My Side&quot; wird Anfang Januar released.</LI></P>

<p><li> Die Sympathiebolzen von <b>Chinchilla</B> stehen mit einer neuen Scheibe namens &quot;The Last Millennium&quot; in den Startl&#246;chern. Diese wird Mitte M&#228;rz ver&#246;ffentlicht und sollte die Band die St&#228;rken des letzten Longplayers konsequent ausgelotet haben steht uns sicherlich ein Highlight in`s Haus.</LI></P>

<p><li> Vor kurzem wurden via Metal Blade erst die beiden ersten Manowar Alben als Digipack wiederver&#246;ffentlicht, nun will sich die selbe Plattenfirma auch &quot;The Dungeons Are Calling&quot; sowie &quot;Sirens&quot; von <b>Savatage</B> vornehmen. Selbige sollen Ende April auf die Headbanger Community losgelassen werden. Was ich von solchen Wiederver&#246;ffentlichungen halte, hatte ich ja bereits im Editorial geschrieben...</LI></P>

<p><li><b> Annihilator</B> haben nicht nur einen neuen Gitarristen namens Curran Murphy (ehemals Nevermore), sondern stehen nach dem hervorragenden letzten Album auch mit &quot;Waking The Fury&quot; mit einer neuen Scheibe in den Startl&#246;chern. Ich bin schon ziemlich gespannt, was uns da erwartet!</LI></P>

<p><li> Hier in Europa wurden gerade die ersten beiden Alben des Savatage Ablegers <b>TSO</B> ver&#246;ffentlicht (mit jahrelanger Versp&#228;tung - eine absolute Frechheit), in den Staaten werden die Ticketverk&#228;ufe der laufenden Tour die 200.000er Marke locker sprengen. Was das f&#252;r ein enormer Erfolg ist, brauche ich nicht extra zu erw&#228;hnen. Ach ja: Mit &quot;nur&quot; zweij&#228;hriger Versp&#228;tung wird das dritte TSO Album &quot;Beethoven`s Last Night&quot; auch im Fr&#252;hjahr bei uns released, was ja eigentlich schon vor einiger Zeit geplant war. Aber: Besser sp&#228;t, als nie, zumal die Scheibe echt der Hammer ist.</LI></P>

<p><li> Gerade erst wurde die neue <b>Transatlantic</B> Scheibe &quot;Bridge Across Forever&quot; ver&#246;ffentlicht und schon steht den geneigten Fans des All Star Projektes bereits neuer Stoff in Aussicht: So soll im Juni des kommenden Jahres eine Live DVD mit einem entsprechenden Album ver&#246;ffentlicht werden. Progressive Metal Fans z&#228;hlen jetzt schon die Stunden bis Juni, wobei mit Treshold und Flower Kings im selben Monat ebenfalls neues Material auf die geneigte Progressive Fraktion losgelassen wird. K&#246;nnte ein teurer Monat werden...</LI></P> </UL>







<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
