<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Vorwort</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><b>Greetings!</B><BR>
Hatte ich im letzten Vorwort bereits angedeutet, dass vor Weihnachten wieder zahlreiche &#252;berfl&#252;ssigen Releases den Markt &#252;berschwemmen, so haben wir jetzt die (grausige) Gewissheit, die man anhand einige Beispiele klar verdeultichne kann: so ver&#246;ffentlichen Iced Earth eine 5 CD Box, die die ersten drei Alben, ein legend&#228;res Demo sowie eine CD mit Coverversionen enth&#228;lt. Das sich das ganze wohl an den Fan aufgrund des Demos und der Cover CD richtet, steht wohl ausser Frage. Nur hat der Fan in der Regel eh schon die ersten drei Scheiben und will diese nat&#252;rlich nicht erneut in den Plattenschrank stellen, zumal gerade bei Iced Earth auch noch die Compilation &quot;Days Of Purgatory&quot; existiert, die die Fr&#252;hwerke in bereits aktuellen Versionen enth&#228;lt. Teil 1 der Geldmacherei. </P>

Ebenfalls ist k&#252;rzlich eine Shae Mini CD von Primal Fear und Dimmu Borgir erschienen, die jeweils 5 songs enth&#228;lt. Im Falle von Primal Fear sind das einige Bonus Tracks, die in der Vergangenheit schonmal auf limitierten Packungen released wurden sowie Coverversionen. Da das ganze zum Fan freundlichen Presi von 20 DM vertickt wird, kann man nur hoffen, dass nicht allzu viele hier zuschlagen da solche Aktionen sonst noch h&#228;ufiger vorkommen. Ebenfalls ein krasser Fall von Geldmacherei!</P>

<p>Und last but not least soll bald der komplette Gamma Ray Backkatalog wiederver&#246;ffentlicht werden. Prinzipiell keine schlechte Idee, wenn man mal davon absieht, dass dort auch wieder Bonus Track zu finden sein werden, die wiederrum nur f&#252;r Fans interessant sind, die ihrerseits s&#228;mtliche Platten schon
wieder da haben. Wie schon im Falle von Running Wild wird wohl auch hier drauf verzichtet, die Bonus Tracks als seperate CD zu releasen. Und ganz ehrlich: Ich bin nicht bereits, f&#252;r 2 oder 3 Bonustracks 25 DM auszugeben. Hier fand ich Stratovarius`s Idee, eine Compilation wie &quot;Intermission&quot; zu ver&#246;
ffentlichen schon wesentlich sinnvoller.Es lie&#223;en sich noch zahlreiche weitere Bands / Plattenfirmen anf&#252;hren, die &#228;hnlichen Mist verzapfen, aber ich denke schon diese Auswahl hat gezeigt, wie der Hase l&#228;uft. Tja, somit w&#252;nsche ich Euch allen alles gute f&#252;r das neue Jahr und einen hoffentlich volle Geldb&#246;rse. Stay heavy,</P>

<p>Kilian<blink> &quot;The Bruce&quot;</blink> Servais</P>
 





<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
