<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Ausgabe 4 von Amiga World erschienen - die wichtigsten News</H2>
<P>
Vor kurzem ist die vierte Ausgabe von AMIGAs Online-Magazin Amiga World
erschienen. Gernod Schomberg informiert kurz &uuml;ber den Inhalt:
</P>
<H3>D'Amiga</H3>
<UL>
<LI> F&uuml;nf Hersteller: Wonder Computer (Kanada), SoftwareHut (USA), KDH-
  Datentechnik (Deutschland), Unitech Electronics (Australien), Eyetech
  (UK)
</LI>
<BR><LI> Unterschiede bestehen wegen Erh&auml;ltlichkeit der Linux-Software: RedHat ist
  in Europa nicht eingef&uuml;hrt, deshalb wird hier SuSE verwendet.
</LI>
<BR><LI> Peripherie ist unabh&auml;ngig vom Betriebssystem! Allerdings sollten alle
  neuen Anwendungen auf der von AMIGA vorgegebenen Grundversion lauff&auml;hig
  sein.
</LI>
<BR><LI> Alle Hersteller liefern Support f&uuml;r ihre Maschinen.
</LI>
</UL>
<H3>Business, Amiga Style</H3>
<P><B>Ein Gespr&auml;ch mit Vince Pfeiffer</B></P>
<P>
Vince begann seine Karriere im Computer-Software-Gesch&auml;ft 1990 bei
Symantec. Nach Entwicklungen und Aufstieg in diesem Konzern zum
Vize-Pr&auml;sidenten f&uuml;r Produktentwicklung wechselte er zu GraphOn, die
in seiner Zeit den Umsatz vervierfachten und wo er auch wieder die Position
wie bei Symantec einnahm.
</P>
<P>
Er kam zu Amiga, weil ihm das die M&ouml;glichkeit bot, nicht nur eine einzelne
Sparte sondern eine ganze Gesellschaft so mit aufzubauen, wie es seinen
Vorstellungen entspricht.
</P>
<P>
Er &auml;u&szlig;ert sehr interessante Ideen &uuml;ber die Entwicklung der Software-
Technologie.
</P>
<H3>Developer Notes - Fall 2000</H3>
<P><B>(Mitteilungen f&uuml;r Entwickler - Herbst 2000)</B></P>
<P>
Gary Peake beschreibt die Informationsm&ouml;glichkeiten f&uuml;r Entwickler.
</P>
<P><B>Einige wichtige Punkte:</B></P>
<UL>
<LI> Er erkl&auml;rt, dass bis heute von AMIGA noch keine Entscheidung getroffen
  wurde, welche Bus-Architektur, welche CPU oder welche sonstigen Teile
  f&uuml;r den endg&uuml;ltigen Hardware-Referenz-Entwurf vorgesehen sind.
</LI>
<BR><LI> Es g&auml;be Hinweise, dass AmigaDE f&auml;lschlicherweise als &quot;Run Time&quot;-System
  bezeichnet worden sei. AmigaDE ist ein Realtime-OS. Es wird jedoch auch
  als RUN-TIME-System f&uuml;r Anwendungen vorgesehen. Das ist KEIN Fehler,
  dar&uuml;ber wurde mehrfach in der Open Amiga Developer List diskutiert.
</LI>
</UL>
<H3>First Impressions of the Software Developers Kit</H3>
<P><B>(Erste Eindr&uuml;cke vom SDK)</B></P>
<P>
Ausf&uuml;hrliche, sehr interessante Beschreibung des SDK mit Beispielen und
eindrucksvollen Bildschirm-Darstellungen.
</P>
<H3>Installing the Software Development Kit on Linux</H3>
<P><B>(Installation des SDK auf Linux)</B></P>
<P>
Eine locker geschriebene Einf&uuml;hrung in die Installation des SDK.
</P>
<H3>Making the Digital Environment talk Sheep</H3>
<P>
<B>(Das DE - Digitales Umfeld - soll &quot;Sheep&quot; reden)</B>
</P>
<P>
Dieser Artikel &uuml;ber die neue AmigaDE-Skript- und Programmiersprache mit dem
Arbeitstitel &quot;Sheep&quot; (Schafe) von Wouter van Oortmerssen ist sehr
ausf&uuml;hrlich und wert, gelesen zu werden.
</P>
<P><B>Gernod Schomberg &lt;<A HREF="mailto:G.Schomberg@t-online.de">G.Schomberg@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
