<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Gedankenbeitrag: &raquo;CLASSIC oder ONE?&laquo; (von Stefan Czinczoll)</H2>
<P>
P&uuml;nktlich zum 9. Dezember bei der WOA 2000 in K&ouml;ln soll das neue Classic-OS
vorgestellt werden.
</P>
<P>
Laut Hersteller Haage und Partner wird es u.a. folgende Features besitzen:
</P>
<UL>
<LI> Multimedia-Programme (AVI &amp; QT-, MP3- und CD-Player)
</LI>
<BR><LI> Webbrowser AWeb 3.4 SE
</LI>
<BR><LI> TCP/IP-Stack Genesis
</LI>
<BR><LI> AmiDock (Toolmanager-Ersatz)
</LI>
<BR><LI> WarpOS 5.0 (PowerPC-Kernel)
</LI>
<BR><LI> Iomega Tools (Treiber f&uuml;r Zip- und Jaz-Laufwerke)
</LI>
<BR><LI> neue Profi-Shell (mit umfangreichem Einsteller)
</LI>
<BR><LI> PPC-nativer Bilddatentyp
</LI>
<BR><LI> schnelle Suchfunktion
</LI>
<BR><LI> komfortabler Entpacker (f&uuml;r lha, lzx und zip-Format)
</LI>
<BR><LI> ASLPrefs (Dateiauswahl-Einsteller),
</LI>
<BR><LI> neue Dateiinfo-Dialogbox
</LI>
<BR><LI> neue Uhr
</LI>
<BR><LI> neuer Farbeinsteller
</LI>
<BR><LI> Fontcaching
</LI>
<BR><LI> Dokumentation (HTML) in Englisch und Deutsch
</LI>
</UL>
<P>
Die Liste sah f&uuml;r mich &uuml;berzeugend genug aus, um die entsprechende
Bestellung zu machen. Zu den Details:
</P>
<P>
Der Wechsel von Miami zu Genesis geht in Ordnung, wenn es sich dabei nicht
um eine funktional &uuml;berarbeitete Version (Stichwort: DHCP) handelt.
</P>
<P>
Der Begriff &quot;Profi-Shell&quot; hat mich stutzig gemacht, weil es sich ein wenig
nach einem Marketing-Trick anh&ouml;rt. Ist das eine Eigenentwicklung oder
handelt es sich um die beliebte KingCON? Oder eine CSH-Variante? Sollte es
wider Erwarten eine Classic Version 4.0 geben, w&uuml;rde ich f&uuml;r eine Shell
zumindest mit entsprechender Funktionalit&auml;t pl&auml;dieren.
</P>
<P>
Die &quot;schnelle Suchfunktion&quot; als Teil des OS ist sicher eine gute Sache,
welche viele User wohl schon lange erwartet hatten.
</P>
<P>
Bei der Dokumentation ist nat&uuml;rlich w&uuml;nschenswert, da&szlig; sie so umfangreich
wie m&ouml;glich ist. Eine einsprachige Ausgabe mit einem erniedrigten
Bundlepreis und im Gegenzug daf&uuml;r mit auf Papier gedrucktem Handbuch w&auml;re
wahrscheinlich zuviel verlangt. ;-)
</P>
<P>
Nun gibt es ein Executive-Update von Bill bez&uuml;glich der Frage, ob es eine
weitere Version des Classic-AmigaOS nach 3.9 geben wird oder ob diese
Entwicklungsschiene eingestellt werden soll. Bill macht das von den
Verkaufszahlen abh&auml;ngig. Ich w&uuml;rde daf&uuml;r pl&auml;dieren, da&szlig; sich m&ouml;glichst
viele User das letzte Classic-OS kaufen, um die Projektentwicklung von
AmigaDE (und Elate/RTOS) zu supporten. Das Amiverse sollte wachsen...
</P>
<P>
Damit letzteres Projekt ein Erfolg wird, sollten die &quot;Kronjuwelen&quot; des
Classic-OS in die Neuentwicklung mit einfliessen. Dazu z&auml;hlt f&uuml;r mich for
allem das Filesystem, so alt es auch sein mag. Man mu&szlig; den Rechner nicht
runterfahren wie in der Linux/Unix-Welt und es gibt nicht diese l&auml;stigen
und allseits bekannten Microschrott Windoof-H&auml;nger.
</P>
<P>
(Wenn es sich aus Energiespargr&uuml;nden nicht vermeiden l&auml;&szlig;t, ein Linux-
basiertes FS zu verwenden, darf nat&uuml;rlich eine freundliche Aufforderung zum
Abschalten nicht fehlen. :-)
</P>
<P>
Als Alternative w&uuml;rde ich mir eine Neuentwicklung mit dynamischen, Caching
w&uuml;nschen, wobei die Sicherheit nicht schlechter sein darf als beim fs45.1.
Ein Tool wie Dave Haynies ber&uuml;hmtes Disksalv mit Datenrettung oder Undelete
bei versehentlicher L&ouml;schung jenseits der 4 GB ist Pflicht eines
anst&auml;ndigen OS. In Anbetracht der heute &uuml;blichen IDE-Plattengr&ouml;&szlig;en sollte
der maximale Adressraum daf&uuml;r genutzt werden.
</P>
<P>
Bekanntlich ist die Firma Corel inzwischen aus dem Linux-Gesch&auml;ft als
Distributor ausgestiegen. Damit Elate und das Amiverse erfolgreich sind,
w&auml;re es nat&uuml;rlich gut, wenn es von dieser Seite einen Port des
erfolgreichen Corel Draw g&auml;be. Der Erfolg eines OS h&auml;ngt ja wesentlich von
der verf&uuml;gbaren Software ab! Weil es sich im Prinzip beim Amiverse wieder
um ein typisches &quot;Multimedia-OS&quot; handeln wird, sollte man doch darauf
achten, da&szlig; es z.B. eine neue Version von ScalaMM darin laufen wird, und
dass es endlich eine Alternative zu Powerpoint gibt. Rendering und
Animation sind nat&uuml;rlich weitere wichtige Anwendungsbereiche.
</P>
<P>
Eine Portierung von StarOffice5.2 w&auml;re SEHR hilfreich, um die vielen
Liebhaber von Office-Paketen zum Einstieg ins Amiverse &uuml;berzeugen zu
k&ouml;nnen. Damit h&auml;tte das Amiverse schlie&szlig;lich echte Chancen im allgemeinen
Profi-Bereich gegen&uuml;ber dem Hauptkonkurrenten.
</P>
<P><B>Info-Link:</B></P>
<P>
<A HREF="http://www.haage-partner.com/products/aos39/aos39-d.htm" TARGET="_top">http://www.haage-partner.com/products/aos39/aos39-d.htm</A>
</P>
<P><B>Stefan Czinczoll &lt;<A HREF="mailto:sn074cz@uni-duisburg.de">sn074cz@uni-duisburg.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
