<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Amiga Forever 4.0 bei Schatztruhe erh&auml;ltlich</H2>
<P><B>Schatztruhe (<A HREF="http://www.schatztruhe.de" TARGET="_top">http://www.schatztruhe.de</A>) informiert:</B></P>
<P><B>&raquo;Amiga Forever 4.0 ist verf&uuml;gbar!</B></P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Empfohlene Verkaufspreise:&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Vollversion&nbsp;</TD><TD VALIGN="TOP">DM 119,00&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Update von v1.0/v2.0/v3.0&nbsp;</TD><TD VALIGN="TOP">DM 59,00&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Bundle Vollversion + AmigaOS 3.5&nbsp;</TD><TD VALIGN="TOP">DM 149,00&laquo;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>&raquo;Amiga Forever V4.0 - Die Amiga Emulator CD-ROM</B></P>
<P>
Amiga Forever ist die integrierte Amigaemulations und Verbindungsumgebung
f&uuml;r PCs, offiziell lizensiert von Amiga International. Wir sind stolz,
Ihnen Amiga Forever 4.0 pr&auml;sentieren zu k&ouml;nnen. Diese neue Version enth&auml;lt
Version 3.1 der Amiga ROMs und Systemdateien, sowie Unterst&uuml;tzung f&uuml;r die
AGA-Bildschirmmodi unter WinUAE. Zus&auml;tzliche vorinstallierte Programme und
F&auml;higkeiten, wie z.B. Personal Paint, DirectoryOpus 5.5, TurboText, LhA-
Entpackung via Drag and Drop und das Toolmanager Dock, welche allesamt
aktualisiert wurden.
</P>
<P>
Diese Version enth&auml;lt zus&auml;tzlich ein Archiv mit einer neuen, sofort
lauff&auml;higen PowerMac Version. Diese Emulation ist aktuell die einzige
M&ouml;glichkeit, einen handlichen Amiga-Laptop zu besitzen (vorausgesetzt Sie
installieren es auf einem PC-Laptop oder Mac Powerbook/iBook).
</P>
<P><B>Neuerungen gegen&uuml;ber V3.0:</B></P>
<UL>
<LI> Cooler GlowIcon-Look (&auml;hnlich AmigaOS3.5; jedoch kompatibel mit NewIcons
  und MagicWB) inklusive der M&ouml;glichkeit auf Tastendruck zwischen &quot;New
  Look&quot; (GlowIcons) und &quot;Old Look&quot; (Classic) zu wechseln.
</LI>
<BR><LI> Amiga Explorer 4.0 Netzwerksoftware in der neuesten Version. Mit
  revolution&auml;ren Features wie &quot;self-install&quot; &uuml;ber serielles Kabel, sowie
  Cut, Copy und Paste-Funktionen.
</LI>
<BR><LI> Directory Opus 5.5 von GPSoftware
</LI>
<BR><LI> Personal Paint 7.1b von Cloanto Italia
</LI>
<BR><LI> Sehr guter Drucker Spooler zum einfachen Ausdruck von Amiga-Dokumenten
  unter Windows bei gleichzeitiger Umgehung der Parallelport-Emulation.
</LI>
<BR><LI> &Uuml;berarbeitete Amiga-Emulation und Workbench-Konfiguration mit schnellerer
  Emulation der Amiga-CPU.
</LI>
<BR><LI> Dutzende zus&auml;tzlicher Erweiterungen und Add-Ons.
</LI>
<BR><LI> Drei Stunden MPEG-1-Video, inklusive der kompletten Deathbed Vigil
  Dokumentation von Dave Haynie und einer Rede von Jay Miner.
</LI>
</UL>
<P><B>Amiga Forever 4.0 - &Uuml;bersicht</B></P>
<P>
Amiga Forever enth&auml;lt exzellente Programme, um die Hauptbed&uuml;rfnisse vieler
Amigabenutzer zu befriedigen: Datenaustausch zwischen Amiga und anderen
Systemen und die M&ouml;glichkeit, ihre vorhandene Amiga-Software und Daten auf
Nicht-Amiga-Hardware einzusetzen. Zus&auml;tzlich sind Software, Tutorien und
Referenzdateien enthalten, die von Interesse f&uuml;r jeden Amigaenthusiasten
sind.
</P>
<P><B>Amiga Forever 4.0 enth&auml;lt:</B></P>
<UL>
<LI> offiziell lizensierte Amiga ROMs und Systemdateien in den Versionen 1.3
  und 3.1. Zus&auml;tzliche Versionen sind aus historischen Interesse auch
  enthalten (alle generischen Versionen zwischen V1.0 und V3.1, die
  offiziell ver&ouml;ffentlicht wurden).
</LI>
<BR><LI> Amiga Explorer 4.0 Netzwerksoftware, die es Ihnen erlaubt, einen Amiga
  mit einem oder mehreren PCs zu verbinden, um vom Windows Desktop direkt
  auf Amigadateien und -verzeichnisse (einschlie&szlig;lich virtueller ADF- und
  ROM-Dateien) zuzugreifen. Amiga Explorer ist extrem einfach zu
  installieren und konfigurieren und unterst&uuml;tzt serielle (Nullmodem)
  Verbindungen sowie TCP/IP. Automatische Installation auf der Amiga-Seite
  &uuml;ber dasselbe serielle Kabel, das sp&auml;ter von der Software selbst
  verwendet wird. Keine zus&auml;tzlichen Terminalprogramme, PC-Dateisysteme
  oder andere Tools werden ben&ouml;tigt. Vor Amiga Explorer 3.5 wurde dies als
  unl&ouml;sbare Aufgabe betrachtet!
</LI>
<BR><LI> Dave Haynies legend&auml;res Deathbed Vigil Video ... eine Dokumentation &uuml;ber
  die letzten Stunden von Commodore mit zahlreichen Interviews, einem Gang
  durchs Geb&auml;ude und letztendlich der Entlassungsparty ...
</LI>
<BR><LI> Exclusives interview mit Jay Miner, &quot;Vater des Amiga&quot;, zu Themen von der
  Geburt des Amiga bis hin zu Computern in unserer Gesellschaft in Form
  eines Audiotracks.
</LI>
<BR><LI> UAE Amigaemulator f&uuml;r Windows (&quot;WinUAE&quot;). All f&uuml;r die Emulation
  ben&ouml;tigten Dateien(Amiga ROM und System, Cloanto Amigasoftware, Picasso
  96 Treiber, usw.) k&ouml;nnen leicht von den anderen Implementierungen (DOS,
  Linux, Be, Next, usw.) dieser Emulatoren, wie auch von zuk&uuml;nftigen
  Versionen genutzt werden. Zus&auml;tzlich enth&auml;lt die CD-ROM den Emulator
  Fellow f&uuml;r DOS und experimentelle Versionen von UAE f&uuml;r PowerPC-Amigas
  und PowerMac-Systeme. Quellcode f&uuml;r die Emulationssoftware
  (einschlie&szlig;lich der Linuxversion von UAE) sind im Verzeichnis &quot;Archives&quot;
  enthalten.
</LI>
<BR><LI> Picasso 96 Treiber f&uuml;r die Emulationssoftware, mit Unterst&uuml;tzung der
  Palettenmodi bis 256 Farben, sowie Echtfarben.
</LI>
<BR><LI> Cloanto Personal Paint 7.1b (Mal-, Animations- und
  Bildbearbeitungssoftware, mit kurzen Tutorien), DirDiff 5.1
  (Dateisynchronisierung und Replizierung), AmiToRTF 4.2 (konvertiert Texte
  vom Amiga in Windowsformate) und MailBX, um Amiga-Mailarchive nach
  Microsoft Mail, Outlook Express und Exchange Server zu konvertieren.
  Kopien dieser Programme sind auch in einem Verzeichnis installiert, auf
  das leicht von &quot;echten&quot; Amiga-Systemen zugegriffen werden kann.
</LI>
<BR><LI> Bonussoftware von Dritten, wie z.B. der Editor TurboText (eine exklusive
  Version mit den letzten Patches), KingCON, Pack- und Entpackwerkzeuge,
  alles vorinstalliert f&uuml;r einfache Drag and Drop-Funktionalit&auml;t vom
  ToolManager aus. Dokumentationen daf&uuml;r sind von der Amigaseite (der
  Emulation) verf&uuml;gbar.
</LI>
<BR><LI> Tutorien und FAQs zu Datenteilung, Emulation, Floppydisks, seriellen
  Verbindungen, TCP/IP, UAE, Fellow und vielem mehr.
</LI>
<BR><LI> Die CD-ROM ist eine multi-Plattform-CD (ISO, Rock-Ridge Amiga, Joliet und
  Audio). Die Macintoshdateien, die eine fertig lauff&auml;hige (experimentelle)
  PowerMac-Konfiguration enthalten, befinden sich in einem StuffIt-Archiv.
</LI>
</UL>
<P><B>Unterst&uuml;tzte Plattformen</B></P>
<P>
Die Amigaemulationssoftware kommt vorinstalliert und vorkunfiguriert f&uuml;r
Windows und DOS auf Intel-Plattformen. Die Amiga ROM- und Systemdateien
k&ouml;nnen von jeder Implementierung der Amigaemulatoren genutzt werden,
einschlie&szlig;lich z.B. Unix/Linux (UAE kommt mit Sourcecode), Be, PowerMac
usw. Diese Emulatoren werden laufend weiterentwickelt und k&ouml;nnen aus dem
Internet heruntergeladen werden.
</P>
<P>
Die Emulationssoftware, die Amiga Forever beiliegt, erfordert es nicht, da&szlig;
Sie einen echten Amiga besitzen. Auf Windows-Systemen kann die Emulation
wahlweise installiert oder ohne Installation direkt von CD gestartet
werden. Die lauff&auml;hige (experimentelle) PowerMac-Version befindet sich in
einem StuffIt-Archiv, von wo sie auf die Festplatte Ihres Macs entpackt
werden kann.
</P>
<P><B>Amiga Explorer und Dokumentation</B></P>
<P>
Der Amiga Explorer, der automatische Starter und die automatische
Installation wurden speziell f&uuml;r Windows entworfen. Die Amiga Explorer
Netzwerksoftware ist unabh&auml;ngig von der eigentlichen Emulation und kann
separat installiert werden.
</P>
<P>
Die Amigasoftware und Dokumentation in Amiga Forever sind v&ouml;llig unabh&auml;ngig
von sowohl den Netzwerk- als auch den Emulationskomponenten und k&ouml;nnen auch
von einem Amiga oder unter der Emulation gelesen werden. Die Amigasoftware
samt Dokumentation ist zudem vorinstalliert unter der Amiga Forever
Emulationsumgebung.
</P>
<P>
Die Hauptdokumentation von Amiga Forever ist im HTML Format und kann mit
einem Webbrowser Ihrer Wahl gelesen werden. Die Amigaspezifische
Dokumentation ist im Amigaguideformat und in Teilen auch in HTML.
</P>
<P>
Die Hauptdokumentation ist in Englisch. Die Dokumentation von Personal
Paint liegt in Deutsch, Englisch und Italienisch vor. Einige
Emualtionstutorien von Dritten sind in Deutsch, Franz&ouml;sisch, Polnisch und
Italienisch. Die Amiga ROM- und Systemdateien auf Amiga Forever enthalten
Lokalisierungen in allen Sprachen, die vom AmigaOS unterst&uuml;tzt werden.&laquo;
</P>
<P>
Anmerkung: In der n&auml;chsten Ausgabe von AMIGA aktuell wird ein Test von
Amiga Forever 4.0 zu finden sein.
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
