<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Neuigkeiten von Haage &amp; Partner</H2>
<P>
Haage &amp; Partner (<A HREF="http://www.haage-partner.com" TARGET="_top">http://www.haage-partner.com</A>) informiert:
</P>
<H3>&raquo;04. November 2000: Petro Tyschtschenko - Der Abschied</H3>
<P>
Auch wir bei H&amp;P bedauern die Entscheidung von &quot;Petro&quot;, Amiga Inc. zu
verlassen, zutiefst, denn nicht nur wir haben ihm einiges zu verdanken. Er
war es, der den AMIGA durch die tiefsten Krisen gef&uuml;hrt hat und seinem
unerm&uuml;dlichen Einsatz ist es letztlich zu verdanken, da&szlig; der AMIGA auch
heute noch lebt(!) Wir w&uuml;nschen ihm f&uuml;r seine Zukunft alles Gute und
hoffen, da&szlig; er im Herzen immer bei uns bleibt...
</P>
<P>
Auf AmigArt (<A HREF="http://www.amigart.com" TARGET="_top">http://www.amigart.com</A>) kann man ihm eine Nachricht zukommen
lassen: A Tribute To Petro
</P>
<H3>10. November 2000: AmigaOS 3.9 - Die ersten Details...</H3>
<P>
Wir freuen uns endlich erste Details des neuen AmigaOS 3.9 nennen zu
k&ouml;nnen. Die Liste ist noch vorl&auml;ufig und enth&auml;lt nicht alle Funktionen,
doch gibt sie einen ersten Eindruck. Weitere Details werden in K&uuml;rze auf
der Homepage von Amiga Inc. ver&ouml;ffentlicht.
</P>
<H3>15. November 2000: AmigaOS 3.9 - DAS BUCH</H3>
<P>
P&uuml;nktlich zum Verkaufsstart des neuen AmigaOS 3.9 gibt es von H&amp;P das
passende Buch. Auf rund 500 Seiten werden alle Themen rund um die
Neuerungen von OS 3.5 und OS 3.9 behandelt. Das Buch richtet sich an alle
Anwender von OS 3.5 und 3.9, die ein &uuml;bersichtliches und leicht
verst&auml;ndliches Buch suchen, das alle Bereiche umfassend behandelt.
Verkaufsstart ist der 9. Dezember 2000. Der Preis liegt bei 89 DM. Das
Paket aus AmigaOS 3.9 und AmigaOS 3.9 - Das Buch gibt es derzeit zum
Sonderpreis von 159 DM.
</P>
<H3>24. November 2000: Weitere News zur WOA 2000</H3>
<UL>
<LI> st&uuml;ndlich laufende Pr&auml;sentationen
</LI>
<BR><LI> Seminare zu OS 3.9, Hardware, Software
</LI>
</UL>
<P>
Eine Tradition wird fortgesetzt. Auch Sie halten Ihrem Amiga nach wie vor 
die Treue. Da ist es höchste Zeit, daß der AMIGA-Markt neuen Auftrieb 
erhält. Helfen Sie mit, den AMIGA-Markt zu stärken und besuchen die World 
of Amiga im Herzen von Köln. Wir haben uns kurzfristig dazu entschlossen, 
und alle Hebel in Bewegung gesetzt, um Ihnen rechtzeitig zu Weihnachten das 
neue AmigaOS 3.9 zu präsentieren. 
<P>
Um der Veranstaltung einen professionellen aber auch gem&uuml;tlichen Rahmen zu
geben - die Neusser Stadthalle war schon belegt - haben wir uns zur&uuml;ck auf
die &quot;K&ouml;lner Tradition&quot; besonnen und eine neue Lokation entdeckt: Der
zentral gelegene MediaPark in der K&ouml;lner Nordstadt ist futuristisch, bietet
eine gem&uuml;tliche Atmosph&auml;re und vor allem die n&ouml;tige Technik. Im Park sind
ein Muliplex Kinocenter, ein Buchladen und weitere Gesch&auml;fte.
Parkm&ouml;glichkeiten befinden sich in der Tiefgarage darunter. Im Haus
befindet sich ebenfalls ein Restaurant. Wir bem&uuml;hen uns nach Kr&auml;ften, Ihnen
den Messetag so interessant wie m&ouml;glich zu gestalten. Nutzen Sie die
Gelegenheit - wir freuen uns auf Ihr Kommen!&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
