<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
Beim letzten Gewinnspiel haben 35 Leser mitgemacht.
</P>
<P>
Bitte denkt diesmal wieder an die Teilnahme. Ihr wisst ja, dass ihr
bereits mit zwei Antworten gewinnen k&ouml;nnt.
</P>
<P><B>Jetzt zur Aufl&ouml;sung:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Standard-Frage:&nbsp;</TD><TD VALIGN="TOP">Die geplanten AmigaOne-Erweiterungen f&uuml;r Classic-Rechner&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">werden nicht von AMIGA selbst, sondern von einem britischen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Unternehmen auf den Markt gebracht werden. Wie hei&szlig;t es?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Antwort: Gesucht war die Firma Eyetech.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Master-Frage:&nbsp;</TD><TD VALIGN="TOP">Die gesuchte Firma hat vor wenigen Monaten, wie zwei andere&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Hersteller auch, eine PCI-Busboard-Erweiterung f&uuml;r den Amiga&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">angek&uuml;ndigt. Welchen Namen tr&auml;gt dieses Projekt?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Antwort: Die richtige L&ouml;sung lautet &raquo;Predator&laquo;.
</P>
<P>
Meinungsfrage: Wie beurteilst du die j&uuml;ngsten Ank&uuml;ndigungen von AMIGA?
</P>
<P><B>Die Auswertung:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">1 (Sehr positiv.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">12&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Eher positiv.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">21&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3 (Eher negativ.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">2&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">4 (Sehr negativ.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">0&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Zwei Teilnehmer konnten sich nicht f&uuml;r eine bestimmte Antwort entscheiden.
</P>
<P>
Einige Einsender hatten zu ihrer Beantwortung der Meinungsfrage Stellung
bezogen:
</P>
<P>
Ewald Rensen sieht die Ank&uuml;ndigungen eher positiv: &raquo;Nach vielen
R&uuml;ckschl&auml;gen in der Vergangenheit gibt es jetzt zumindest einige konkrete
Ans&auml;tze, etwas Neues auf die Beine zu stellen.&laquo;
</P>
<P>
Aus der Sicht von Stefan Wiegele bleiben viele Fragen offen: &raquo;Endlich wird
der Amiga wieder weiterentwickelt. Dass die alten Amiga weiter unterst&uuml;tzt
werden, finde ich mehr als gut.
</P>
<P>
Was soll ich vom Amiga One halten? Ich wei&szlig; es nicht. Was ist er &uuml;berhaupt?
Ein PC? Ein halber Amiga? F&uuml;r mich ist wichtig, dass ich meine Software
weiterhin benutzen kann, wenn ich mir einen neuen Rechner kaufe. Was soll
es dann f&uuml;r einer sein, Amiga 4000 &amp; Predator (Mediator) oder Amiga One?
F&uuml;r mich stellt sich immer noch die Frage, weshalb man die jetzige Hardware
nicht mehr weiterentwickeln kann?
W&auml;ren die Entwicklungskosten zu hoch oder l&auml;&szlig;t sich die Hardware nicht mehr
weiterentwickeln? Niemand wei&szlig; genau, wie der neue Amiga im n&auml;chsten Jahr
&quot;aussehen&quot; wird. Welchen Preis soll er haben? Zur Zeit wird viel dar&uuml;ber
geredet, welche Hardware-Komponenten er haben sollte oder auch nicht. Am
Ende gucken einige vielleicht bl&ouml;d aus der W&auml;sche, wenn nicht das
eintrifft, wie man ihn sich zur Zeit vorstellt.&laquo;
</P>
<P>
Peter K&uuml;hne ist vom Konzept des neuen Amiga &uuml;berzeugt: &raquo;Das ganze AmigaDE-
Projekt scheint sehr vielversprechend zu sein. Allerdings ist noch v&ouml;llig
offen, ob sich die Idee durchsetzen wird.&laquo;
</P>
<P>
Dirk Hase kritisiert die Schlie&szlig;ung von AMIGA Deutschland: &raquo;Die Ank&uuml;ndigung
von Amiga, da&szlig; die Gesch&auml;ftstelle in Langen zumacht, stimmt mich eher
traurig. Noch vor einigen Monaten sagte Bill McEwen, da&szlig; man eher noch
Vertriebspartner sucht und das Netz der B&uuml;ros in Europa noch ausweiten
wolle. Was soll man nun davon halten??? Ich kann ja verstehen, da&szlig; man in
den USA Geld sparen mu&szlig;, um alles in die neuen Projekte zu stecken, aber
wenigstens das Ersatzteillager sollte weiterbestehen. Ich kann mir nicht
vorstellen, da&szlig; Amiga alles in die USA verschifft und von dort aus
verkauft. Gerade wo jetzt Erweiterungen f&uuml;r die Classic-Amigas angek&uuml;ndigt
sind, die uns auf den Stand des Amiga One bringen sollen, mu&szlig; es doch einen
Support im Ersatzteilbereich geben. Oder sollen wir die letzten Classics
etwa ausschlachten???
Das ist wohl kaum zumutbar und in manchen Belangen gar nicht m&ouml;glich.
Fazit: Ich finde, Bill McEwen sollte sich &uuml;berlegen, was er tut, denn ohne
die bestehende Amiga-Gemeinde hat Amiga eine weitaus geringere Chance,
etwas zu bewegen, als mit der Unterst&uuml;tzung und Mundpropaganda der Leute,
die schon Jahrzehnte lang dabei sind.
</P>
<P>
Ich hoffe, wir alle erleben eine Renaissance des Amigas.&laquo;
</P>
<P>
Andreas Wolf meint kurz und knapp: &raquo;Das ist wohl das, worauf jeder wahre
Amiganer gehofft hat: G3/G4 f&uuml;r Classics bzw. ein neues Mainboard basierend
auf PPC.&laquo;
</P>
<P>
Wolf Zimmer sieht die j&uuml;ngsten Ank&uuml;ndigungen eher negativ: &raquo;Die letzten
Ver&ouml;ffentlichungen erinnern mich stark an den Refrain von Ernst Reuter:
Jetzt fangen wir aber gleich an. Eine klare Aussage, leicht verst&auml;ndlich
und im ersten Augenblick auch einleuchtend. Aber etwas l&auml;nger nachgedacht,
fehlt jeglicher Konsens und man wei&szlig; gar nichts.
</P>
<P>
Genau so w&uuml;rde ich die letzten Publikationen interpretieren.&laquo;
</P>
<P>
Wolfgang Mai sieht AMIGAs Weg positiv: &raquo;Ich finde die von AMIGA, Inc.
gemachten Ank&uuml;ndigungen erst einmal toll. Allerdings bestehen auch Zweifel,
ob sich eine doch so kleine Firma mit einem neuen Produkt gegen eine
&uuml;berm&auml;chtige Konkurrenz durchsetzen kann. Ansonsten bin ich gespannt auf
das neue OS und habe auch die Anschaffung des AmiOne 1200 schon fest
eingeplant. Die Wartezeit verk&uuml;rzt erst einmal OS 3.9, welches f&uuml;r mich
eine sehr positive &Uuml;berraschung ist.
</P>
<P>
Ansonsten w&uuml;nsche ich AMIGA mehr Gl&uuml;ck, als in den letzten Jahren.&laquo;
</P>
<P>
F&uuml;r Frank Leyendecker muss das neue Betriebssystem eine Classic-Amiga-
Emulation beinhalten: &raquo;Ich denke, da&szlig; die Classic Software auch auf dem
neuen Amiga laufen sollte, sonst wird es wohl eine Totgeburt à la BeOS.
Wenn ich das richtig verstanden habe, denkt man &uuml;ber eine Emulation nach,
es sollte aber definitiv eine geben, sonst verliert man einen Teil des
Amiga-Marktes.&laquo;
</P>
<P>
Emanuel Mairs Kommentar geht in dieselbe Richtung: &raquo;Das einzig Negative in
AMIGAs j&uuml;ngsten Ank&uuml;ndigungen ist die verz&ouml;gerte und noch unsichere
Integration einer transparenten Classic-Emulation im AmigaDE.&laquo;
</P>
<P>
Krister S. Skrtic f&uuml;rchtet um das &raquo;Amiga-Feeling&laquo;: &raquo;Ich wei&szlig; nicht viel
&uuml;ber die ganzen neuen Sachen, das AmigaDE und den Amiga One. Einige Dinge
klingen interessant, aber ich f&uuml;rchte, dass das AmigaDE am Ende nur ein
anderer PC sein wird, ohne das Amiga-Feeling und nicht in der Art, wie das
AmigaOS arbeitet, wie etwa dessen Benutzerfreundlichkeit.
</P>
<P>
Ich hoffe, es wird gut, und dass es auf den meisten Prozessoren l&auml;uft, ist
gro&szlig;artig, aber ansonsten wei&szlig; ich nicht. Bis dahin verwende ich meinen
Classic-Amiga weiter und hoffe, dass er mit den neuen PCI-Erweiterungen
wieder auferstehen wird.&laquo;
</P>
<P>
Gernod Schomberg antwortet mit &raquo;eher positiv&laquo; und merkt an: &raquo;Ich h&auml;tte gern
&raquo;sehr positiv&laquo; gesagt, denn es sieht wirklich danach aus, dass sich auf der
Ger&auml;teseite etwas tut. Die Abwertung deshalb, weil ich eigentlich gehofft
hatte, meinen neuen Rechner unter dem Weihnachtsbaum als Geschenk finden zu
k&ouml;nnen.
</P>
<P>
Aber vielleicht sollte ich es positiv sehen, dass man keine Schnellsch&uuml;sse
abgibt, die eventuell daneben gehen. Wie es aussieht, wird es doch kein
aufgepeppter PC-Clone.&laquo;
</P>
<P>
Christian Aichinger ist sich unschl&uuml;ssig: &raquo;Da ja gleich ein ganzer Haufen
Infos von Amiga kamen, kann ich zur Meinungsfrage auch keine
allgemeing&uuml;ltige Aussage treffen.
</P>
<P>
Die Ank&uuml;ndigung von Eyetech finde ich sehr positiv, wenn Eyetech das
Angek&uuml;ndigte auch garantieren kann. Wenn ich &quot;Zico&quot; eines Tages sehen und
anfassen kann, werde ich auch meine Meinung zu diesem Ger&auml;t &auml;u&szlig;ern. Im
Moment ist es (er?, sie?) aber nur eine Spezifikation auf einem St&uuml;ck
Papier, und mehr nicht! Auch die eigentliche Spezifikation h&ouml;rt sich nicht
wirklich weltbewegend an - weltbewegend ist die Software bzw. das OS, das
auf Zico laufen soll. Und das ist keine &quot;neue&quot; Ank&uuml;ndigung von Amiga,
sondern wurde schon Anfang dieses Jahres ver&ouml;ffentlicht. OS 3.9 h&ouml;rt sich
auch sehr gut an. Obwohl bestimmt viele ziemlich verwirrt sind, wo denn nun
BoingBag 2 geblieben ist bzw. ob BoingBag 2 nun erscheint oder nicht.
Passend wie die Faust aufs Auge kommt dann auch noch die Ank&uuml;ndigung von
Petros Ausscheiden. Bitte nicht falsch verstehen - ich w&uuml;nsche Petro
wirklich alles Gute und habe auch nichts gegen ihn, aber der Zeitpunkt
dieser Ver&ouml;ffentlichung war so ung&uuml;nstig wie es nur h&auml;tte sein k&ouml;nnen. Die
allgemeine Aufregung zu BoingBag 2 und OS 3.9 hat doch eigentlich schon
gereicht. H&auml;tte es nicht gen&uuml;gt, seinen Abgang NACH der Kl&auml;rung des
&quot;BoingBag 2 / OS 3.9&quot;-Problems zu verk&uuml;nden?
Irgendwie erinnert mich dieses Vorgehen an alte Commodore-Zeiten.
Amiga hat wohl doch nichts dazu gelernt.&laquo;
</P>
<P><B>Fazit:</B></P>
<P>
Eine &uuml;berw&auml;ltigende Mehrheit ist mit den j&uuml;ngsten Ank&uuml;ndigungen AMIGAs im
Gro&szlig;en und Ganzen zufrieden.
</P>
<P>
Kritik wurde zum Teil an der Schlie&szlig;ung von AMIGA Deutschland, an Details
des AmigaNG-Projekts sowie an der Ank&uuml;ndigungspolitik des Unternehmens
ge&uuml;bt.
</P>
<P>
Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;CDCat&quot;: Dirk Neubauer&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;Foundation Gold&quot;: Emanuel Mair&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;AmigaOS 3.5&quot;: Axel Knabe&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x CD-ROM &quot;Amiga Arena&quot;: Wolfgang Mai&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Herzlichen Gl&uuml;ckwunsch!</B></P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
