<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Messebericht</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Tests3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Messebericht
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Messebericht</H1>
<H2>1. Vorabinformationen zur &raquo;World of Amiga&laquo; in K&ouml;ln</H2>
<P>
Wie in der letzten Ausgabe angek&uuml;ndigt, folgt an dieser Stelle N&auml;heres zur
diesj&auml;hrigen K&ouml;lner Amiga-Messe. Die folgenden Informationen wurden der
offiziellen Messe-Homepage
(<A HREF="http://www.haage-partner.de/actions/woa2000/index-d.htm" TARGET="_top">http://www.haage-partner.de/actions/woa2000/index-d.htm</A>) entnommen:
</P>
<P>
<B>&raquo;02. November 2000<BR>
Offizielle Ank&uuml;ndigung der WOA 2000<BR></B>
</P>
<P>
Jetzt ist es soweit - die erste reine AMIGA-Messe seit vielen Jahren findet
wieder in K&ouml;ln statt. Vom 9.-10. Dezember ist dann der moderne MediaPark im
Herzen von K&ouml;ln das Ziel der AMIGA-Fans.
</P>
<P>
Highlight der Messe ist nat&uuml;rlich die erste &ouml;ffentliche Pr&auml;sentation des
neuen AmigaOS 3.9 und auch der Verkaufsstart. In einem gro&szlig;en Seminarsaal
wird es st&uuml;ndlich Vortr&auml;ge zu AmigaOS 3.9 und interessanter AMIGA-Software
und Hardware geben.
</P>
<P>
Alle bekannten H&auml;ndler und Hersteller haben schon Ihr Kommen zugesagt.
Nat&uuml;rlich wird auch Bill McEwen anwesend sein, um den Amiga-Fans seine
Vision von der AMIGA-Zukunft zu pr&auml;sentieren.
</P>
<P>
<B>23. November 2000<BR>
Weitere News zur WOA 2000<BR></B>
</P>
<UL>
<LI> st&uuml;ndlich laufende Pr&auml;sentationen
</LI>
<BR><LI> Seminare zu OS 3.9, Hardware, Software
</LI>
</UL>
<P>
Das offizielle Anschreiben, das gerade an 10.000 Kunden verschickt wird:
</P>
<P>
Liebe Kunden,<BR>
liebe Amiga-Freunde<BR>
</P>
<P>
Eine Tradition wird fortgesetzt. Auch Sie halten Ihrem Amiga nach wie vor
die Treue. Da ist es h&ouml;chste Zeit, da&szlig; der AMIGA-Markt neuen Auftrieb
erh&auml;lt. Helfen Sie mit, den Amiga Markt zu st&auml;rken und besuchen die World
of Amiga im Herzen von K&ouml;ln.
</P>
<P>
Wir haben uns kurzfristig dazu entschlossen, und alle Hebel in Bewegung
gesetzt, um Ihnen rechtzeitig zu Weihnachten das neue AmigaOS 3.9 zu
pr&auml;sentieren.
</P>
<P>
Um der Veranstaltung einen professionellen aber auch gem&uuml;tlichen Rahmen zu
geben - die Neusser Stadthalle war schon belegt - haben wir uns zur&uuml;ck auf
die &quot;K&ouml;lner Tradition&quot; besonnen und eine neue Lokation entdeckt: Der
zentral gelegene MediaPark in der K&ouml;lner Nordstadt ist futuristisch,
bietet eine gem&uuml;tliche Atmosph&auml;re und vor allem die n&ouml;tige Technik.
Parkm&ouml;glichkeiten befinden sich in der Tiefgarage darunter. Im Haus
befindet sich ebenfalls ein Restaurant.
</P>
<P>
Die Messe findet in Saal (300qm) und Foyer (180qm) von Mediapark Nr. 7
statt. Zwei weitere R&auml;ume im Nebengeb&auml;ude bieten Platz f&uuml;r Vortr&auml;ge. - Wir
bem&uuml;hen uns nach Kr&auml;ften, Ihnen den Messetag so interessant wie m&ouml;glich zu
gestalten.
</P>
<P>
Nutzen Sie die Gelegenheit - wir freuen uns auf Ihr Kommen!
</P>
<P>
<B>27. November 2000 [neu]<BR>
KDH Datentechnik kommt zur WOA 2000<BR></B>
</P>
<P>
Nach einer anf&auml;nglichen Absage hat sich KDH-Datentechnik nun doch
entschieden, als Aussteller an der WoA 2000 teilzunehmen. Ausschlaggebend
f&uuml;r diese Entscheidung waren viele Kundenanrufe, die KDH um Teilnahme an
der Messe gebeten haben. kdh-datentechnik.com
</P>
<P>
<B>27. November 2000 [neu]<BR>
Mitfahrb&ouml;rse<BR></B>
</P>
<P>
Wie schon zur Messe in Neuss hat J.Santillan auf seinen Seiten eine
Mitfahrb&ouml;rse eingerichtet: amiga-community.net&laquo;
</P>
<P>
&raquo;Was gibt es zu sehen... ?
</P>
<P>
Die aktuellen Neuigkeiten zur Messe gibt es jetzt t&auml;glich aktualisiert
hier...
</P>
<HR><BR>
<P>
Highlight der Messe ist nat&uuml;rlich die erste &ouml;ffentliche Pr&auml;sentation des
neuen AmigaOS 3.9 und auch der Verkaufsstart. In einem gro&szlig;en Seminarsaal
wird es st&uuml;ndlich Vortr&auml;ge zu AmigaOS 3.9.
</P>
<P>
P&uuml;nktlich zum Verkaufsstart des neuen AmigaOS 3.9 gibt es von H&amp;P auch das
passende Buch: AmigaOS 3.9 - Das Buch. Auf rund 500 Seiten werden alle
Themen rund um die Neuerungen von OS 3.5 und OS 3.9 behandelt.
</P>
<P>
Themenschwerpunkte sind u.a. Einbau der ROMs, Einrichten der Festplatte,
Softwareinstallation, eine Beschreibung aller Prefs, Commodities und
Tools, sowie spezielle Kapitel zum Multimedia, Internet, ARexx, WarpOS und
allen neuen Programmen von OS 3.9.
</P>
<P>
Zus&auml;tzlich bietet das Buch eine F&uuml;lle von Tips und Hinweisen zu allen
Programmen und ein spezielles Kapitel zur L&ouml;sung von Problemf&auml;llen.
</P>
<P>
Hyperion pr&auml;sentiert die ganze Palette der aktuellen Action-Spiele f&uuml;r den
Amiga.
</P>
<P><B>Heretic II</B></P>
<P>
Heretic 2 ist ein packerneder 3rd Person Shooter. Der Held Corvus kommt
nach langer Zeit zur&uuml;ck in seine Welt, doch alles hat sich ver&auml;ndert. Fast
alle Wesen sind mit einem Virus befallen und greifen Corvus prompt an.
Lassen Sie sich auch in diese Fantasie-Welt der Elfen und Monster
entf&uuml;hren und erleben Sie eine packende Story, sowie die eindrucksvolle
Grafik.
</P>
<P><B>Shogo</B></P>
<P>
Shogo ist ein imposanter Egoshooter im Manga-Stil. Sie sind ein 30m gro&szlig;er
Mech und k&auml;mpfen gegen &uuml;ber 20 Gegner in mehr als 40 Leveln. Die Grafik-
und Lichteffekte werden Sie in ihren Bann ziehen. Kommen Sie ins Reich der
Mechs und verfolgen Sie die packende Story am eigenen Leibe.
</P>
<P><B>FreeSpace</B></P>
<P>
Freespace ist ein Space-Combat. Es handelt von den Terranern und
Vasudanern, die sich bekriegen, bis eine &uuml;berlegene Rasse die Shivaner sie
alle &uuml;berrascht. Die Existenz dieser beiden Rassen steht wegen den weit
&uuml;belegenen Shivanern vor dem Abgrund. Werden sie die Katastrophe noch
abwenden k&ouml;nnen?
</P>
<P>
Earth 2140 ist ein grafisch tolles Echzeit-Strategie Spiel. Sein sie die
der entscheidene Keil im Krieg auf der Erde. Retten Sie die Erde vor der
v&ouml;lligen Zerst&ouml;rung und &uuml;bernehmen eine der beiden Parteien. Ohne ihre
hilfe wird die Erde f&uuml;r immer untegehen. Das Spiel finden Sie am Stand von
KDH.
</P>
<P>
Exodus erhebt nicht unberechtigt den Anspruch NAPALM vom Thron zu sto&szlig;en.
Es kommt einfach mit einer Menge neuen Features daher und l&auml;uft dazu auch
auf kleineren Systemen fl&uuml;ssig. Es l&auml;&szlig;t sich eine von 2 verschiedenen
Au&szlig;erirdischen Rassen w&auml;hlen, die dann m&auml;chtig aufeinander einpr&uuml;geln. F&uuml;r
jede Kampagne gibt es 20 Missionen und nochmals 24 Multiplayermissionen.
Das ganze spielt sich in 20 verschiedenen Szenarien ab. Es gibt sowohl
Luft, Land als auch Wassereinheiten. Die Einheiten sind im Gegensatz zu
NAPALM sehr futuristisch angelegt. Schafft es Exodus Napalm von seinem
Thron zu sto&szlig;en?
</P>
<P>
Das Meditor bietet Ihnen endlich die M&ouml;glichkeit Standard-PCI-Karten in
ihrem Amiga zu benutzen. So k&ouml;nnen Sie kosteng&uuml;nstig den Amiga mit
Netzwerk-, Sound- und Grafikkarten erweitern. Diese bietet ihnen ganz
andere Preis- und Leistungsverh&auml;ltnisse. Freuen Sie sich auf die
Geschwindigkeit einer Voodoo 3 oder auf den Sound einer Soundblaster Live!
</P>
<P>
Die REPULSE ist eine Soundkarte f&uuml;r den Amiga 2/3/4000. Sie ist f&uuml;r den
Anwender mit gehobenen Anspr&uuml;chen gedacht. Sie verbindet die neuste
Soundkartentechnologie mit einem niedrigen Preis.
</P>
<P>
Auch Zukunftsmusik wird man bei individual Computers im wahrsten Sinne des
Wortes h&ouml;ren k&ouml;nnen: Die Repulse Soundkarte (Zorro-Karte) von Aliendesign
(<A HREF="http://www.aliendesign.net">www.aliendesign.net</A>) wird bei IC produziert, und ab dem ersten Quartal
2001 lieferbar sein. Wer sich f&uuml;r diese Karte interessiert, kann schon auf
der WOA einen Blick auf den Prototypen werfen.
</P>
<P>
Schatztruhe ist stolz, Amiga Forever 4.0 pr&auml;sentieren zu k&ouml;nnen. Diese neue
Version enth&auml;lt Version 3.1 der Amiga ROMs und Systemdateien, sowie
Unterst&uuml;tzung f&uuml;r die AGA-Bildschirmmodi unter WinUAE. Zus&auml;tzliche
vorinstallierte Programme und F&auml;higkeiten, wie z.B. Personal Paint,
DirectoryOpus 5.5, TurboText, LhA-Entpackung via Drag and Drop und das
Toolmanager Dock, welche allesamt aktualisiert wurden.
</P>
<P>
Diese Version enth&auml;lt zus&auml;tzlich ein Archiv mit einer neuen, sofort
lauff&auml;higen PowerMac Version.
</P>
<P>
Diese Emulation ist aktuell die einzige M&ouml;glichkeit, einen handlichen
Amiga-Laptop zu besitzen (vorausgesetzt Sie installieren es auf einem
PC-Laptop oder Mac Powerbook/iBook).
</P>
<P>
Die Aminet CD 40 beinhaltet &uuml;ber 700 MB (ungepackt) an Software in fast
tausend Archiven. Seit der Aminet CD 39 sind unz&auml;hlige MB an Neuheiten
hinzugekommen. Alle Programme sind Deutsch beschrieben; viele verf&uuml;gen
&uuml;ber eine deutsche Dokumentation. Als besonderes Highlight enth&auml;lt die
Aminet 40 die Vollversion der Tabellenkalkulation TurboCalc 4.0.
</P>
<P>
Aminet Set 10 bietet alle Dateien, die seit dem Erscheinen des Sets 9 neu
hinzugekommen sind, sowie Vollversionen von Max Rally, Zombie Massacre,
Personal Paint 7.1b, Pinball Dreams, Pinball Fantasies &amp; Pinball
Illusions.
</P>
<P>
Der MAS-Player ist ein MP3-Player, der sich f&uuml;r alle Amiga mit
Parallelport- Anschlu&szlig; eignet. Er spielt MP3's mit sehr geringer
Prozessorlast in 18 Bit und 44 khz ab und stellt somit die beste und
g&uuml;nstigste L&ouml;sung dar, auf dem Amiga MP3-Musikst&uuml;cke zu h&ouml;ren.
</P>
<P>
Auf der Messe wird die Version (3.0) von FX-Scan bei COOL bits vorf&uuml;hren
und angeboten. Diese wird das erste Mal seit Jahren wieder die M&ouml;glichkeit
des OCR (Texterkennung) auf dem Amiga bieten. Nat&uuml;rlich werden auch die
weiteren Programme von Felix Schwarz (FX-Paint, VHI-Studio) angeboten.
</P>
<P>
Das aktuelle Turboprint 7.16 wird bei COOL bits angeboten und zudem die
M&ouml;glichkeit, von allen &auml;lteren Turboprint-Versionen auf das aktuelle
Turboprint 7.16 upzudaten.
</P>
<P>
Amiga-Fachh&auml;ngler 3 1/2 Computer wird folgendes bieten:
</P>
<UL>
<LI> ein breites Spektrum an Amiga Hard- und Software
</LI>
<BR><LI> z.B. 2,5&quot;-Festplatte 1,3 GB zu 149,- DM
</LI>
<BR><LI> Amiga 1200 zu 199,- DM
</LI>
<BR><LI> Ersatzteile A500 bis A4000
</LI>
<BR><LI> und viele Amiga-Software ab 9,90 DM
</LI>
</UL>
<P>
Das neue Compilersystem StormC 4 wurde im Laufe der letzen beiden Jahre
komplett &uuml;berarbeitet. Die Pr&auml;sentation auf der Messe wird jeden
Entwickler von der einmaligen Leistungsf&auml;higkeit dieses Werkzeuges
&uuml;berzeugen. Besuchen Sie die Seminare und Sie werden ungeahnte F&auml;higkeiten
Ihres Amiga entdecken.
</P>
<P>
Ebenfalls neu bei H&amp;P ist die deutschsprachige &Uuml;bersetzung des Handbuches
zu ImageFX inklusive der Erweiterungen zur Version 4.1.
</P>
<P><B>AMIGA plus</B></P>
Sch&ouml;ne Aussichten: WOA 2000 in K&ouml;ln<BR>
Erste Perspektiven im Detail: Amiga Inc. Status Report<BR>
Gewusst: 2 Internet-Workshops<BR>
Bunt: Internet-Browser im Vergleich<BR>
Laut: Napster und Amster<BR>
Gut gemischt: Die wichtigsten Internet-Tools<BR>
Hardware: ISDN und Amiga finden zueinander<BR>
Praktisch: Wildfire Workshop, Teil 3<BR>
Kostenlos: Kleinanzeigen<BR>
Scenish: Kimble<BR>
u. v. m.<BR>
<P><B>AmigActive 15</B></P>
<P>
Start Making Sense - The future according to Amiga, analysed in depth by
Amiga Active.
</P>
<P>
Nightlong - ClickBOOM's latest epic Amiga conversion under the spotlight.
New Amigas Announced - Details inside.
</P>
<P>
NextGen Games - 62 games announced for the AmigaOne, but can we expect to
see them all?&laquo;
</P>
<P><B>&raquo;Aussteller und Themen</B></P>
<P><B>Die vorl&auml;ufige Ausstellerliste:</B></P>
Amiga Inc.<BR>
AmigActive<BR>
AmigaClub<BR>
Amiga Future<BR>
Aliendesign [neu]<BR>
APC/TCP<BR>
Cool Bits<BR>
DreiEinHalb Computer<BR>
ELBOX Computer<BR>
epic interactive<BR>
Eternity<BR>
Falke-Verlag<BR>
Haage&amp;Partner Computer<BR>
Hyperion<BR>
individual computers<BR>
KDH Datentechnik [neu]<BR>
Schatztruhe<BR>
Verkosoft<BR>
<P><B>Die Themen der Aussteller</B></P>
<P>
Die World of Amiga 2000 ist eine reine Amiga-Messe. Die Aussteller bieten
Ihnen Informationen zum Thema Amiga-Hard- und Software. Selbstverst&auml;ndlich
sind auch einige Aussteller dabei, die Hardware-Zubeh&ouml;r wie Festplatten,
Drucker und Digitalkameras zeigen und verkaufen. Der Besuch lohnt sich f&uuml;r
Sie in jeder Beziehung!
</P>
<P><B>AmigaActive</B></P>
<P>
Die Redaktion des gr&ouml;&szlig;ten englischsprachigen Amiga Magazins bietet Ihnen
die neueste Ausgabe und selbstverst&auml;ndlich auch die Ausgaben der letzten
Monate. Vielleicht haben Sie eine Ausgabe verpasst und wollen Ihre
Sammlung vervollst&auml;ndigen.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><A HREF="http://www.amigactive.co.uk">www.amigactive.co.uk</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Amiga-Club im Btx &amp; Internet
</P>
<P>
... ist inzwischen zu einem festen Bestandteil einer jeden Amiga-Messe in
Deutschland geworden und so werden wir nat&uuml;rlich auch auf der World of
Amiga 2000 in K&ouml;ln dabeisein.
</P>
<P>
Geplante Highlights sind wiederkehrende Live-Installationen von AmigaOS 3.9
und damit das neue OS zum Anfassen und Ausprobieren. Weitere Infos und
einen Standplan findet man auf der Homepage des Clubs
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><A HREF="http://www.amiga-club.de">www.amiga-club.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>AmigaFuture</B></P>
<P>
Die Amiga Future wird seit der Ausgabe 27 komplett alleine von der
Redaktion erstellt und vertrieben. Inzwischen ist auch die Zukunft der
Amiga Future f&uuml;r mindestens einen Abozeitraum gesichert. Nat&uuml;rlich gibt es
auch eine sehr umfangreiche Homepage (<A HREF="http://www.amigafuture.de">www.amigafuture.de</A>) mit aktuellesten
News und vieles mehr. Die News werden in der Regel mehrmals t&auml;glich
aktualisiert. Auf der Messe in K&ouml;ln versuchen die Redaktionsmitglieder
alle Ihre Fragen zu beantworten. Eventuell. wird dort auch noch eine
kleine &Uuml;berraschung bereit gehalten.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><A HREF="http://www.amigafuture.de">www.amigafuture.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
AmigaPlus powered by AmigaOS<BR>
Falke Verlag<BR>
</P>
<P>
Ali Goukassian und Thomas Raukamp werden Ihren Fragen zur AmigaPlus Rede
und Antwort stehen. Die Dezember-Ausgabe der AmigaPlus wird vorr&auml;tig sein,
ebenso wie alle weiteren interessanten Produkte aus dem Hause Falke Verlag.
</P>
<P>
<A HREF="http://www.amigaplus.de">www.amigaplus.de</A><BR>
<A HREF="http://www.amigaos.de">www.amigaos.de</A><BR>
<A HREF="http://www.falke-verlag.de">www.falke-verlag.de</A><BR>
</P>
<P><B>ALIENDESIGN</B></P>
<P>
Auch Zukunftsmusik wird man bei individual Computers im wahrsten Sinne des
Wortes h&ouml;ren k&ouml;nnen: Die Repulse Soundkarte (Zorro-Karte) von Aliendesign
(<A HREF="http://www.aliendesign.net">www.aliendesign.net</A>) wird bei IC produziert, und ab dem ersten Quartal
2001 lieferbar sein. Wer sich f&uuml;r diese Karte interessiert, kann schon auf
der WOA einen Blick auf den Prototypen werfen.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><A HREF="http://www.aliendesign.net">www.aliendesign.net</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Cool Bits</B></P>
<P>
Martin Strobel aus K&ouml;ln ber&auml;t Sie zu allen Hardware-Problemen, die Sie mit
Ihrem Amiga haben. Sein Meisterbetrieb ist spezialisiert auf Amiga
Reparaturen. An seinem Stand k&ouml;nnen Sie die OCR-Texterkennung der Firma
Innovative/Felix Scharz bewundern: Endlich wieder eine professionelle
Texterkennung f&uuml;r den Amiga. Au&szlig;erdem bietet CoolBits die Produktpalette
von KDH und Vesalia, da beide Amiga H&auml;ndler aus terminlichen Gr&uuml;nden nicht
an der Messe teilnehmen k&ouml;nnen. Sie werden aber dennoch auf nichts
verzichten m&uuml;ssen.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><A HREF="http://www.coolbits.de">www.coolbits.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Dreieinhalb</B></P>
<P>
...ist bekannt f&uuml;r besonders g&uuml;nstige Preise. Und dies nicht nur in Sachen
Amiga. Bei Dreieinhalb k&ouml;nnen Sie Hardware-Zubeh&ouml;r f&uuml;r alle Bereiche
erwerben.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><A HREF="http://www.dreieinhalb.de">www.dreieinhalb.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>ELBOX Computer</B></P>
<P>
Ganz neu und brandaktuell ist das Mediator PCI Board f&uuml;r den A1200. Auf der
Messe wird die Voodo3 Grafikkarte mit dem soeben fertiggestellten
Software-Treiber pr&auml;sentiert. Jeder kann sich vor ort von der
Geschwindigkeit dieser Sensation beeindrucken lassen. Auch eine TV-Tuner
Karte soll bereits lauff&auml;hig sein und wird pr&auml;sentiert. Als Highlight soll
die SharkPPC das G3/G4-Board f&uuml;r den Mediator gezeigt werden.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><A HREF="http://www.elbox.com">www.elbox.com</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Eternity</B></P>
<P>
Martin Wolf pr&auml;sentiert die aktuelle Version des Spiels Tales of Tamar. Am
Stand k&ouml;nnen Sie direkt mit Herrn Neidhardt, dem Autor von EaSys,
sprechen. Dieses Produkt wird von Herrn Neidhardt im Seminarraum
pr&auml;sentiert.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><A HREF="http://www.eternity-computer.de">www.eternity-computer.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Individual Computers</B></P>
<P>
Am Stand von individual Computers gibt es Neuigkeiten aus der
Hardware-Welt. Der Hersteller der bekannten Produkte wie Catweasel,
Buddha, X-Surf Ethernet und IDE-fix zeigt gleich vier neue Produkte: Der
Lyra-Tastaturadapter erm&ouml;glicht den Anschlu&szlig; von PC-Tastaturen an den
Amiga. Dabei bekommt jede Taste eine sinnvolle Belegung, und man hat
darauf geachtet, da&szlig; das Amiga-Tastaturfeeling erhalten bleibt.
Endlich gibt es auch wieder eine ISDN-Karte f&uuml;r den Amiga zu kaufen. Der
&quot;ISDN-Surfer&quot; erm&ouml;glicht den direkten Anschlu&szlig; an den ISDN-S0-Bus, so da&szlig;
man keine Verluste in der &Uuml;bertragungsrate durch ein Modem oder einen
ISDN-Terminaladapter hat. F&uuml;r die Karte wird es sogar ein Telefon-Modul
geben, das den Amiga zu einem vollwertigen ISDN-Telefon macht. Der
ISDN-Surfer ist eine Zorro-Karte, aber das Ger&uuml;cht da&szlig; es eine A1200
Version geben wird, wollte Herr Sch&ouml;nfeld von individual Computers am
Telefon weder best&auml;tigen noch dementieren.
</P>
<P>
Auch die Amiga-Fans der ersten Stunde kommen nicht zu kurz: Erstmals auf
der WOA 2000 zeigt individual Computers die Kickstart-Erweiterung
&quot;Kickflash&quot; f&uuml;r den A1000 und den A500. Ein 1MB gro&szlig;es Flash-Rom kann alle
Kickstarts von V0.9 bis V3.1 aufnehmen, und man ist aufgrund der
Flash-gr&ouml;&szlig;e sogar auf neuere Versionen vorbereitet. Die Erweiterung wird
extern an den Computer angesteckt, und stellt noch zwei Steckpl&auml;tze zur
Verf&uuml;gung: Einen f&uuml;r eine A2000 Turbokarte und einen Zorro-Steckplatz.
Damit kann man einem A1000 v&ouml;llig neues Leben einhauchen!
</P>
<P>
Auch Zukunftsmusik wird man bei individual Computers im wahrsten Sinne des
Wortes h&ouml;ren k&ouml;nnen: Die Repulse Soundkarte (Zorro-Karte) von Aliendesign
(<A HREF="http://www.aliendesign.net">www.aliendesign.net</A>) wird bei IC produziert, und ab dem ersten Quartal
2001 lieferbar sein. Wer sich f&uuml;r diese Karte interessiert, kann schon auf
der WOA einen Blick auf den Prototypen werfen.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><A HREF="http://www.aliendesign.net">www.aliendesign.net</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP"><A HREF="http://www.jschoenfeld.de">www.jschoenfeld.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>KDH Datentechnik</B></P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><A HREF="http://www.kdh-datentechnik.com">www.kdh-datentechnik.com</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Schatztruhe</B></P>
<P>
Stefan Ossowski kommt mit seiner bew&auml;hrten Produktpalette und hat auch
einiges Neues dabei. Aminet® und die Aminet® Set CD sind in der jeweils
aktuellen Version zu haben. Der Amiga Emulator &quot;Amiga Forever&quot; bietet in
der Version 4.0 viele Neuerungen und enth&auml;lt au&szlig;erdem das &quot;Deathbed Vigil
Video&quot; und vieles mehr.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><A HREF="http://www.schatztruhe.de">www.schatztruhe.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Haage&amp;Partner</B></P>
<P>
Unter Termindruck sind wir am leistungsf&auml;higsten. Rechtzeitig zur Messe
wird das neue AmigaOS3.9 verkaufsfertig. N&auml;here Informationen hierzu
finden Sie auf der vorletzen Seite. Auch ein deutschsprachiges Buch zu
OS3.9 ist rechtzeitig fertig und kann nicht nur in Augenschein genommern
werden.
</P>
<P>
Unser Compilersystem StormC 4 wurde im Laufe der letzen beiden Jahre
komplett &uuml;berarbeitet. Die Pr&auml;sentation auf der Messe wird jeden
Entwickler von der einmaligen Leistungsf&auml;higkeit dieses Werkzeuges
&uuml;berzeugen. Besuchen Sie unsere Seminare und Sie werden ungeahnte
F&auml;higkeiten Ihres Amiga entdecken.
</P>
<P>
Ebenfalls neu im Programm ist die deutschsprachige &Uuml;bersetzung des
Handbuches zu ImageFX inklusive der Erweiterungen zur Version 4.1.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><A HREF="http://www.haage-partner.de">www.haage-partner.de</A>&laquo;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
&raquo;Seminare auf der WOA 2000:
</P>
<P><B>Vortragsprogramm</B></P>
<P>
Parallel zum Messegeschehen wird in zwei R&auml;umen im nahen Nebengeb&auml;ude ein
st&auml;ndiges Programm laufen. Wir wollen Ihnen damit brandaktuelle
Neuigkeiten n&auml;her bringen, Sie interessieren und begeistern!
</P>
<P>
Folgenden Themen sind bisher fest eingeplant:
</P>
<UL>
<LI> AmigaOS3.9 - Pr&auml;sentation (J&uuml;rgen Haage/HAAGE&amp;PARTNER)
</LI>
<BR><LI> AmigaOS3.9 im Detail (verschiedene Vortragende/HAAGE&amp;PARTNER)
</LI>
<BR><LI> StormC 4 - Rechnercluster (verschiedene Personen/HAAGE&amp;PARTNER)
</LI>
<BR><LI> Heretic II (Steffen H&auml;user/Hyperion)
</LI>
<BR><LI> Shogo (Thomas Frieden/Hyperion)
</LI>
<BR><LI> FreeSpace (Steffen H&auml;user/Hyperion)
</LI>
<BR><LI> CASABLANCA AVIO (CoolBits)
</LI>
<BR><LI> EaSys (Tom Neidhardt)
</LI>
<BR><LI> MAS Player (Dirk Conrad/Eternity)
</LI>
<BR><LI> iFusion - PowerMAC Emulator (Paul Lesurf)
</LI>
</UL>
<P>
Bill McEwen wird ebenfalls da sein und &uuml;ber die Zukunft reden.
</P>
<P>
Wenn Sie nicht aktiv dabei sein k&ouml;nnen...
</P>
<P>
...nehmen Sie von zu Hause aus am Geschehen teil! &Uuml;ber <A HREF="http://www.amigamesse.de">www.amigamesse.de</A>
laufen w&auml;hrend der Veranstaltung online Bilder und Informationen.&laquo;
</P>
<P>
(Quelle: jeweils Haage &amp; Partner)
</P>
<P>
Weitere Informationen, insbesondere zu Anreise, Ticketerwerb und
Unterkunft, sind auf
<A HREF="http://www.haage-partner.de/actions/woa2000/index-d.htm" TARGET="_top">http://www.haage-partner.de/actions/woa2000/index-d.htm</A> zu finden.
</P>
<P ALIGN="RIGHT">
<A HREF="Tests3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
