<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> ACSYS Erscheinung fraglich
</LI>
</UL>
<P>
Wie Christian Sobotta vom ACSYS-Entwicklungsteam diesen Monat mitteilte,
sind erst 50 Bekundungen von Kaufinteresse f&uuml;r ACSYS eingegangen; ben&ouml;tigt
werden allerdings 500, damit das Spiel erscheinen kann. Deshalb verweist
Christian nochmals ausf&uuml;hrlich darauf, dass es sich nicht um
Vorbestellungen handelt, sondern nur um Bekundungen eines eventuellen
Kaufinteresses. ACSYS ist ein sehr guter Turrican-Klon, der in der letzten
Ausgabe von AMIGA aktuell schon vorgestellt wurde.
</P>
<UL>
<LI> Hyperion Software k&uuml;ndigt weitere Portierung an
</LI>
</UL>
<P>
Fast jeden Monat gibt es eine neue Ank&uuml;ndigung von Hyperion Software zu
melden; dies ist auch dieses mal nichts anders. Angek&uuml;ndigt wurde eine
Portierung des PC-Spiels Majesty, welches auf dem Amiga schon im 1. Quartal
2001 erscheinen soll. Das Spiel soll auf einem PPC-Amiga mit WarpOS, 48MB
RAM und Grafikkarte laufen. Ob eine Version f&uuml;r den 68060 erscheint, ist
noch nicht sicher. Au&szlig;erdem wurde bekannt, dass Hyperion Software auf der
World of Amiga-Messe in K&ouml;ln zwar keinen eigenen Stand haben, jedoch einige
Spiele pr&auml;sentieren werde.
</P>
<UL>
<LI> Bubble Heroes f&uuml;r Grafikkarten-Benutzer
</LI>
</UL>
<P>
ArcadiA Products hat auf seiner Internet-Seite einen Patch zur Verf&uuml;gung
gestellt, der es Grafikkarten-Benutzern erlaubt, Bubble Heroes auch auf
ihrer Grafikkarte zu betreiben. Deer Patch soll auf jedem System laufen und
wird alle Benutzern von Grafikkarten empfohlen.
</P>
<UL>
<LI> Payback-Demoversion
</LI>
</UL>
<P>
Diesen Monat hat Apex Designs eine spielbare Demoversion von Payback f&uuml;r
Spielemagazine exklusiv ver&ouml;ffentlicht. Deshalb k&ouml;nnt ihr in dieser Ausgabe
ein Preview davon lesen.
</P>
<UL>
<LI> Exodus - The Last War
</LI>
</UL>
<P>
Wie Amiga-News.de berichtete, wurde einem Mitarbeiter die Information vom
Entwicklungsteam von Exodus mitgeteilt, dass es auf jeden Fall eine PPC-
Version von Exodus - The Last War geben werde.
</P>
<UL>
<LI> SpaceStation 3000 eingestellt
</LI>
</UL>
<P>
Viele hatten es schon vermutet bzw. bef&uuml;rchtet, diesen Monat hat Digital
Images bekanntgegeben, dass das Spiel SpaceStation 3000 nicht erscheinen
wird. Als Grund wurden Fehler bei der Projektkoordinierung sowie
Startschwierigkeiten des Entwicklungsteams genannt. In Zukunft will man
sich bei Digital Images jetzt mehr auf den Amiga One konzentrieren.
</P>
<UL>
<LI> Neue Spiele bei AmigaLand
</LI>
</UL>
<P>
AmigaLand hat die Lizenz bekommen, weitere kommerzielle Amiga-Spiele auf
ihrer Homepage zu ver&ouml;ffentlichen. Dazu z&auml;hlen nun Hanse - Die Expedition
AGA, Carribean Disaster, Whale's Voyage sowie Der Clou! Die Profi-Disk.
AmigaLand ist unter <A HREF="http://www.vivaline.de/matt/" TARGET="_top">http://www.vivaline.de/matt/</A> zu erreichen.
</P>
<UL>
<LI> HighAnt Development verl&auml;sst Amiga
</LI>
</UL>
<P>
Marco Frischkorn von HighAnt Development hat diesen Monat bekanntgegeben,
dass Battle das letzte Spiel f&uuml;r den Amiga sein wird. Als Begr&uuml;ndung wird
angegeben, dass man bei HighAnt Development die Pl&auml;ne von Amiga Inc.
einfach nicht als realistisch ansieht.
</P>
<UL>
<LI> Das Blaue Auge II zum freien Download
</LI>
</UL>
<P>
Timo Kloss von Inutilis Software hat der Amiga Arena die Erlaubnis erteilt,
das Spiel Das Blaue Auge II - Die Schicksalss&auml;ge kostenlos zur Verf&uuml;gung zu
stellen. Die Amiga Arena ist unter <A HREF="http://online-club.de/~ARENA/" TARGET="_top">http://online-club.de/~ARENA/</A> zu
erreichen.
</P>
<UL>
<LI> Ermentrud Demoversion
</LI>
</UL>
<P>
Desweiteren hat Inutilis Software diesen Monat eine erste Demoversion des
Adventures Ermentrud zum Download freigegeben. Diese Version l&auml;uft
allerdings bisher nur auf CyberGfx-Systemen, weshalb ich davon kein Preview
pr&auml;sentieren kann.
</P>
<UL>
<LI> Tales of Tamar
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Am 5. November wurde die Version 0.32 von Tales of Tamar ver&ouml;ffentlicht.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sie kann zusammen mit dem Client- und Hauptarchiv von <A HREF="http://www.tamar.net/" TARGET="_top">http://www.tamar.net/</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">heruntergeladen werden.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> Nightlong Goodies
</LI>
</UL>
<P>
Auf der Support-Seite f&uuml;r Nightlong auf <A HREF="http://www.clickboom.com" TARGET="_top">http://www.clickboom.com</A> wurden
einige Goodies f&uuml;r das Spiel ver&ouml;ffentlicht. So k&ouml;nnen Hintergrundbilder
und Filmsequenzen von dort heruntergeladen werden.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
