<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele8.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H1>6.2. PD-Tests (von Malte Mende)</H1>
<H2>NewMasterMind</H2>
<P>
Endlich mal was Neues. Endlich mal kein Tetris-, PacMan- oder Arcanoid-
Clone. Nein, sondern ein Mastermind-Clone. Ich denke doch mal, dass das
Spielprinzip von Mastermind sich mittlerweile rumgesprochen hat, oder?
Falls nicht, hier ein Erkl&auml;rungsversuch: Ihr m&uuml;sst versuchen, einen
vierstelligen Farbcode zu knacken. Dieser besteht aus vier Feldern mit vier
bis acht verschiedenen (ist einstellbar) Farben. Und um diesen Code zu
erraten, habt ihr zehn Versuche. Nach jedem Versuch seht ihr, wieviele
Farben ihr richtig gesetzt habt und wieviele Farben von denen, die ihr
benutzt habt, vorkommen. Im Kinder-Modus ist diese Anzeige in Relation zu
dem Code, den ihr gemacht habt, sprich: Ihr seht, welche richtig liegen
usw.
</P>
<P>
Dieses Spielchen spielt man eigentlich zu Zweit, der eine bestimmt den zu
knackenden Code, der andere muss ihn erraten. Aber ihr k&ouml;nnt auch euren
Amiga als k&uuml;nstlichen Unterhaltungsspielgef&auml;hrten missbrauchen.
Das Spiel l&auml;uft komplett auf der WB. Grafisch ist das Spiel, f&uuml;r ein WB-
Game, recht h&uuml;bsch gemacht, es d&uuml;rfte nur Probleme auf Rechnern mit wenigen
Farben geben. Beim Sound war mal wieder Schmalhans K&uuml;chenmeister. Den hat
man n&auml;mlich weggelassen.
</P>
<P>
Der einzige Vorteil dieses Spiels gegen&uuml;ber dem Brettspiel-Original ist der
Computergegner und die M&ouml;glichkeit, mehrere Farben zu benutzen.
Aber trotzdem ein lustiges Spielchen.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name:&nbsp;</TD><TD VALIGN="TOP">NewMasterMind&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Autor:&nbsp;</TD><TD VALIGN="TOP">Hâkan L. Younes&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">7 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sound:&nbsp;</TD><TD VALIGN="TOP">kein Sound&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Steuerung:&nbsp;</TD><TD VALIGN="TOP">7 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spielspa&szlig;:&nbsp;</TD><TD VALIGN="TOP">6 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Subjektiver Gesamteindruck vom Redakteur: 7 von 10 Punkten</B></P>
<H2>Arkanos</H2>
<P>
Muss sich MegaBall f&uuml;rchten vor dieser Konkurrenz? Nein, sicher nicht. Denn
auch wenn dieser Arkanoid/Breakout-Clone mit einer h&uuml;bschen Grafik, Sound
und etwa den gleichen Extras daherkommt, ist es nicht so fantastisch wie
das gute alte Megaball.
</P>
<P>
Neben den Standards eines Clones wie nett designte Levels und einer guten
physikalischen Umsetzung hat Arkanos noch diverse Extra-Blocks, die bei
Zerst&ouml;rung einiger Bl&ouml;cke herunterfallen. Diese bewirken, dass ihr zum
Beispiel schie&szlig;en k&ouml;nnt, der Ball einfach alle Bl&ouml;cke zerst&ouml;rt, ohne an
ihnen abzuprallen oder auch, dass euer Paddle gr&ouml;&szlig;er wird.
</P>
<P>
Allerdings gibt es auch ziemlich nervige Extras, bei denen man ein Leben
verliert oder den Level noch mal von vorn anfangen muss. Diese hemmen den
Spielspa&szlig; doch sehr.
</P>
<P>
Das Spiel ist &uuml;brigens Freeware, einen LevelEditor gibt es gegen 20 DM.
</P>
<P>
Ein lustiges Spielchen, aber subjektiv gesehen doch irgendwie langweilig.
Auch wenn es objektiv gesehen gut ist.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name:&nbsp;</TD><TD VALIGN="TOP">Arkanos&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Autor:&nbsp;</TD><TD VALIGN="TOP">Kargl Christian&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sound:&nbsp;</TD><TD VALIGN="TOP">6 von 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Steuerung:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spielspa&szlig;:&nbsp;</TD><TD VALIGN="TOP">6 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Subjektiver Gesamteindruck vom Redakteur: 6 von 10 Punkten</B></P>
<H2>Mattonite</H2>
<P>
Und noch ein Arkanoid-Clone...
</P>
<P>
Diesmal ist allerdings weder die Umsetzung, noch der subjektive Spielspa&szlig;
in irgendeiner Weise gelungen.
</P>
<P>
Das Spiel flackert an allen Ecken und Kanten (bin ja kein Profi, aber ich
glaube, der Programmierer hat das Doublebuffering vergessen...), ansonsten
ist die Grafik okay, wie auch der Sound.
</P>
<P>
Allerdings ist das Leveldesign in den ersten Leveln einfach nur dumm. Denn
man k&auml;mpft sich durch ein Rechteck aus Bl&ouml;cken, es gibt an den Seiten
keinen Freiraum. Sehr intelligent.
</P>
<P>
Wie bei Arkanos gibt es auch hier Extras wie vergr&ouml;&szlig;ertes Paddle, Schie&szlig;en
und einen Powerball, der durch alles durchgeht. Dieses Extra macht das
Spiel dann so einfach, dass man jedes Level ohne gro&szlig;e Anstrengung
durchspielen kann.
</P>
<P>
Was den Spielspa&szlig; ebenfalls hemmt ist, dass man den Ball wegen des
Flackerns teilweise &uuml;berhaupt nicht mehr sehen kann und dass das Spiel zum
Teil jeder logischen Physik widerspricht. Den Ball kann man auch nicht
steuern, da es egal ist, wo er am Paddle auftrifft. Er prallt immer nach
dem Einfallswinkel=Ausfallswinkel-Gesetz ab.
</P>
<P>
Jedes andere Arkanoid-Spiel ist besser als dieses, ich empfehle sowieso den
Download von MegaBall, dieses Spiel wird wohl nie ordentliche Konkurrenz
bekommen.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name:&nbsp;</TD><TD VALIGN="TOP">Mattonite&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Autor:&nbsp;</TD><TD VALIGN="TOP">???&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">4 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sound:&nbsp;</TD><TD VALIGN="TOP">6 von 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Steuerung:&nbsp;</TD><TD VALIGN="TOP">6 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spielspa&szlig;:&nbsp;</TD><TD VALIGN="TOP">4 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Subjektiver Gesamteindruck vom Redakteur: 4 von 10 Punkten</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele8.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
