<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Vorwort</H2>
<P><B>Hallo, liebe Leser!</B></P>
<P>
Vor euch liegt der AMIGA-aktuell-Spieleteil des Monats Dezember im Jahre
2000. Vor genau 2 Jahren habe ich diesen Spieleteil, wie sich die meisten
bestimmt noch erinnern k&ouml;nnen, von Jens Schr&ouml;der &uuml;bernommen, der keine Zeit
mehr hatte, sich um diesen zu k&uuml;mmern. Auch wenn ich bei dieser &Uuml;bernahme
gedacht hatte, dass ich immer Zeit f&uuml;r den Spieleteil haben werde, hat sich
vor etwa drei Monaten das Blatt gewendet und nun muss ich aus demselben
Grund meine Arbeit als leitender Redakteur des Spieleteils niederlegen.
Damit ist dieser Spieleteil der letzte, den ihr von mir lesen werdet.
</P>
<P>
Mit meinem Ausstieg sollte jetzt nat&uuml;rlich der Spieleteil von jemandem
weitergef&uuml;hrt werden, da er schon seit langem fester Bestandteil der AMIGA
aktuell ist und sich bestimmt auch allgemeiner Beliebtheit erfreut. Wer
sich also in der Lage dazu f&uuml;hlt, sollte nicht z&ouml;gern und sich mit Carsten
in Verbindung setzen. Lest dazu bitte auch den offiziellen Aufruf im
Einleitungsteil dieser AMIGA-aktuell-Ausgabe.
</P>
<P>
Zu guter letzt, m&ouml;chte ich noch allen danken, die &uuml;ber die zwei Jahre am
AMIGA-aktuell-Spieleteil mitgearbeitet haben.
</P>
<P>
Sicherlich w&auml;ren hier viele Namen zu nennen, ich will es mal bei ein paar
belassen: Andreas Koch f&uuml;r die Mac-Ecke, Manni Froitzheim f&uuml;r den
diskussionsw&uuml;rdigen Napalm-Test, Heiko Garelts f&uuml;r die PD-Tests sowie auch
Malte Mende f&uuml;r PD-Tests, die er hoffentlich weiterf&uuml;hrt. Und nat&uuml;rlich
auch Carsten Schr&ouml;der, der oft lange auf den Spieleteil warten und dann
auch noch die Formatierung &auml;ndern musste, da ich beim W&auml;hlen des
Texteditors recht w&auml;hlerisch war.
</P>
<P>
So! Das war's von mir f&uuml;r dieses Jahr und f&uuml;r den Spieleteil.
</P>
<P>
Ich w&uuml;nsche euch frohe Weihnachten, ein gutes neues Jahr und hoffe, dass
sich baldigst jemand bereit erkl&auml;rt und den Spieleteil &uuml;bernimmt, damit es
m&ouml;glichst keine Aussetzer gibt.
</P>
<P><B>Alles Gute!</B></P>
<P><B>Euer,</B></P>
<P>
Andreas<BR>
(<A HREF="mailto:Andreas.Falkenhahn@gmx.de">Andreas.Falkenhahn@gmx.de</A>)<BR>
</P>
<P>
(Andreas Falkenhahn, An der Trift 2, 36132 Eiterfeld-Arzell)
</P>
<P>
P.S.: Entschuldigt, wenn dieses Vorwort etwas zu monstr&ouml;s war....
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
