


<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>A-Z Of Amiga Games</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="GREEN">CD Test: A-Z Of Amiga
Games</FONT></h1></CENTER></P>

Was mich pers&#246;nlich auf dem Amiga schon immer begeistert hat, war die
Verf&#252;gbarkeit von Datenbanken &#252;ber alle erdenklichen Themengebiete.
Insbesondere die zahlreichen Amiga Guide und HTML Guides, die sich im Aminet
im Verzeichniss docs / hyper befinden, sind ein gutes Beispiel f&#252;r die
Vielschichtigkeit der Themengebiete. Was bisher fehlte war eine
entsprechende Guide &#252;ber alle bisher erschienenen Amiga Games. Diese L&#252;cke
wird nun mit der kommerziellen CD &quot;A-Z Of Amiga Games&quot; geschlossen, die im
Grunde nichts anderes ist als eine (zugegebenerma&#223;en riesige) Guide &#252;ber
alle bisher auf dem Amiga erschienenen Spiele. Ob diese auch was taugt, soll
dieser CD Test zeigen.</P>

<h2><CENTER><FONT COLOR="YELLOW">Die Frage nach dem
Inhalt</FONT></CENTER></h2></P>
Wie bei vielen kommerziellen Amiga Produkten mitlerweile (leider) &#252;blich, kommt auch
die CD &quot;A-Z Of Amiga Games&quot; auf einem selbstgebrannten Rohling daher, der in
einem normalen CD Jewel Case mit einem selbstproduzierten Cover / Background steckt, was
nicht wirklich professionell aussieht. Immerhin ist die CD mit &#252;ber 400 MB
an Daten gut gef&#252;llt und wenn man bedenkt, da&#223; diese allesamt zur Guide
geh&#246;ren, ist das schon eine staatliche Menge. Ein entsprechender Web Browser
zum Anzeigen der Daten wird (leider) nicht mitgeliefert, aber entsprechende
Demo Versionen sind auf unz&#228;hligen weiteren CD`s zu finden, so da&#223; dies
nicht wirklich ein Problem darstellt.</P>

Also die Hauptdatei in einen Web Browser reingeladen (die drei Amiga Web
Browser &quot;IBrowse 2.1&quot;, &quot;Voyager 3&quot; und &quot;A Web 3.3&quot; interpretieren allesamt
die HTML Tags perfekt, so da&#223; es zu keinen Darstellungsschwierigkeiten oder
Fehlern kam) und der erste Eindruck der Main Seite war nicht gerade
&#252;berw&#228;ltigend. Einige (grafisch armselige) Buttons sowie eine Tabelle mit
Buchstaben von A-Z sind alles, was man hier bewundern kann - keine Spur
eines Vorwortes oder &#228;hnlichem. Man springt sozusagen in`s kalte Wasser und
muss schauen, da&#223; man auch so zurecht kommt. Letzteres ist zwar kein
Problem, aber auch das macht keinen guten Einruck beim kritischen Tester.
Auch bei der grafischen Gestaltung h&#228;tte man sich etwas mehr M&#252;he geben
k&#246;nnen; ein kleines Logo sowie gut aussehende Buttons w&#228;ren wohl wirklich
kein Problem gewesen. Aber wir wollen jetzt mal nicht p&#228;pstlicher als der
Pabst sein und rufen uns in Erinerrung, da&#223; die Information bei dieser Guide klar im
Vordergrund steht.</P><CENTER>
<img src="az3.jpg"></CENTER></P><BR>

Und Quantit&#228;t wird mit dieser Guide wirklich geboten: &#220;ber 2000 (!) Amiga
Spiele werden in dieser Guide aufgef&#252;hrt, darunter sogar total alte Games
wie &quot;Bubble Bobble&quot;, &quot;Black Lamp&quot;, &quot;Karate Kid II&quot; und &quot;B.A.T.&quot;. F&#252;r
Nostalgiker ist das schonmal von vornherein eine tolle Sache. Weniger toll
sind hingegen die spärlichen Info`s, die man teilweise bekommt: Zu jedem Game bekommt
man das Release Datum, die Kompatibilit&#228;t (z.B. l&#228;uft nur auf dem Amiga
500), den Publisher, die Art des Games (z.B. Action) sowie den Preis (in
britischen Pfund) preisgegeben. Oftmals kommen noch evtl. Wertungen aus
Zeitschriften sowie die Zahl der Levels samt einem kleinen Kommentar hinzu.
Und in vielen F&#228;llen war es das leider auch schon. Wer erwartet hat, zu
jedem Spiel auch einen passenden Screenshot zu bekommen, wird bitter
entt&#228;uscht werden. Selbst bei einigen Games, die Multitasking-f&#228;hig sind
(wo es also wirklich kein Problem gewesen w&#228;re an entsprechende Screenshots
zu gelangen), liegen keine Bilder bei. Ich muss schon sagen, da&#223; ich in
dieser Hinsicht von der Guide ma&#223;los entt&#228;uscht bin. Daf&#252;r hat man oftmals
entsprechende Cover eingescannt und quasi als Wiedergutmachung beigelegt.
Leider ist hier aber die Qualit&#228;t nicht voll &#252;berzeugend, was aber
sicherlich auch ein Platzproblem ist. Qualitativ &#252;berzeugend ist sicherlich
auch nicht die Darstellungsqualit&#228;t der mitgelieferten Screenshots, denn
viel ist oftmals, dank hoher Kompressionsrate, nicht zu erkennen. Als Beweis zwei Screenshots, die
in dieser Form, nur statt im JPG im GIF Format (es wurde bei 100 % Qualität
konvertiert !), auf der CD vorlagen:</P><CENTER>
<img src="az1.jpg"></P><img src="az2.jpg"></P> </CENTER>

Lobenswert ist hingegen, da&#223; man zu zahlreichen Games auch evtl. bekannte
Cheats sowie L&#246;sungswege gleich mitgeliefert hat. Statt also in tausenden
von verschiedenen Guides zu w&#252;hlen, braucht man nun einfach nur noch die CD
einlegen und kann gleich nach seinem Lieblingsgame Ausschau halten, ob es
daf&#252;r nicht einen Trainer oder &#228;hnliches gibt. Insbesondere zu &#228;lteren
Spielen findet man mehr oder minder bekannte Hilfen, Codes und L&#246;sungswege.
Problem dabei ist oftmals nur, da&#223; auch die L&#246;sungen ausschlie&#223;lich (wie
&#252;brigens die gesamte CD !) in Englischer Sprache vorliegen. Letzteres hat
aber noch den Vorteil, da&#223; auch Spiele in der Guide aufgef&#252;hrt sind, die in
Deutschland indiziert sind (ich denke da an ein gewissen portierten 3D Shooter aus dem
Hause Click Boom).... </P>

Neben der alphabetischen Liste zu Spielen hat man zus&#228;tzliche noch eine
Liste entworfen, die die Games in die verschiedenen Genres einteilt (wer
schon immer mal wissen wollte, wieviele 3D Shooter schon f&#252;r den Amniga
erschienen sind, kann hier nachschauen).</P>

Als Bonus hat man aber noch zwei weitere (kleinere) Highlights parat: Zum
einen hat man sich die M&#252;he gemacht und eine Liste aller Softwareh&#228;user
gemacht, die recht umfassend zu sein scheint. Mit einem einfachen Klick auf
das entsprechende Softwarehaus (z.B. Psygnosis) hat man gleich eine Liste
aller Spiele, die jemals von dieser Firma herausgekommen ist. Zum anderen
existiert auf der CD noch eine weitere Liste und zwar mit Namen von
(gr&#246;&#223;tenteils Englischen) Programmierern mit entsprechender Angabe, wer am
welchen Spiel gearbeitet hat. Hier ist nat&#252;rlich etwas Insiderwissen
gefragt, denn ohne selbiges wird man mit einem Gro&#223;teil der Namen nichts
anfangen k&#246;nnen...</P><CENTER>
<img src="az4.jpg"></CENTER></P><BR>


<h2><CENTER><FONT COLOR="BLUE">Die Frage nach den
M&#228;ngeln</FONT></CENTER></h2></P>
Zu den schon oben erw&#228;hnten M&#228;ngeln (alles nur in Englisch, keine oder
qualitativ minderwertige Screenshots, keine Begr&#252;&#223;ungsguide, schlechtes
Layout etc.) kommen noch einige hinzu: So sind zu einigen Games teilweise,
mit Ausnahme des Namens, gar keine weitere Informationen ver&#246;ffentlicht, was
nat&#252;rlich nicht gerade als sinnvoll zu bezeichnen ist. Auch sind die
gegebenen Info`s, insbesondere was einige Releasedaten betrifft, nicht immer
vollkommen korrekt. Aber das ist bei einer Guide, die immerhin &#252;ber 2000 Spiele
beinhaltet, wohl auch zu erwarten. Nicht zu erwarten ist allerdings, da&#223;
einige bekanntere Games &#252;berhaupt nicht aufgef&#252;hrt sind (z.B. &quot;Wayne
Gretskey Hockey 2&quot;, &quot;Pick And Pile&quot; etc.).</P>

<h2><CENTER><FONT COLOR="WHITE">Die Frage nach dem
Fazit</FONT></CENTER></h2></P>
In Begeisterungsst&#252;rme breche ich nun wirklich nicht aus, wenn es um diese
CD geht. Denn obwohl sich die Zusammensteller wirklich eine Menge Arbeit
gemacht haben, kann man die durchaus vorhandenen M&#228;ngel nicht einfach
ignorieren - dazu sind selbige einfach zu gravierend und beeintr&#228;chtigen die
Funktionalit&#228;t in einem nicht unwesentlichen Ma&#223;e. Leute die einen &#220;berblick
&#252;ber alle Amiga Games haben wollen, k&#246;nnen sich die CD zwar zulegen, allen
anderen rate ich zum jetztigen Zeitpunkt vom Kauf ab, denn der Preis von 39 DM (vorher 59 DM)
ist für ein mittelmäßiges Nachschlagwerk von zudem begrenztem Nutzen einfach zu hoch.</P>

<u>Anmerkung:</U> Die vorliegende Versionsnummer ist 1.1 aus dem Jahre 1998. In der
Guide wird versprochen, alle 6 Monate Updates auf die Homepage zu stellen. Da
ich dieses Verfahren nicht ausprobiert habe (=&gt; kein Internetzugang), kann
es sein, da&#223; einige der M&#228;ngel mitlerweile schon behoben sind - eine
Garantie daf&#252;r kann ich selbstverst&#228;ndlich nicht geben.</P> 




<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
