
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Glow Icon Collection - Und alles glüht</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="GREEN">CD Test: Glow Icons</FONT></CENTER></h1></P>

Mit dem Betriebssystem Update OS 3.5 wurden, neben gelungenen Erweiterrungen
des Systems, auch einige optische Verbesserungen vorgenommen. Insbesondere
die Icons, die in fr&#252;heren Versionen alles andere als ansehnlich aussahen,
wurden an den aktuellen Stand der Dinge angepasst und schimpfen sich nun
&quot;Glow Icons&quot;. Nat&#252;rlich sind dem OS 3.5 Paket keine Icons f&#252;r jede denkbare
Applikation beigelegt, so da&#223; man teilweise wohl oder &#252;bel zu den
stilistisch etwas anders gearteten &quot;NewIcons&quot; (auf denen die Glow Icons
basieren) greifen muss. Wer das nicht will hat genau zwei M&#246;glichkeiten:
Entweder man pixelt sich seine eigenen Icons oder man greift zur CD &quot;Glow
Icons&quot;, die einem diese Arbeit abnimmt und verspricht, mehr als 3.500 Icons bereitzustellen.
Ob damit die WB wirklich in einem neuen Glanz erstrahlt, wird dieser Test
zeigen.</P>

<h2><CENTER><FONT COLOR="YELLOW">Und alles
gl&#252;ht...</FONT></CENTER></h2></P>
Eine CD nur mit Glow Icons zu f&#252;llen ist sicherlich nicht im Bereich des
m&#246;glichen, wenn man bedenkt, da&#223; auf eine CD 600 MB passen und ein Icon ca.
3 KB gro&#223; ist. Um die CD sinnvoll abzurunden, hat man noch folgende
zus&#228;tzlichen Dinge auf die CD gepackt:</P><UL>

<li> Hintergrundbilder<BR>
<li> Hintergrundmuster<BR>
<li> Toolbars f&#252;r diverse Programme<BR>
<li> Pics von der HEW `99<BR>
<li> HP der Firma Schatztruhe</P></UL>

&#220;ber diese Dinge m&#246;chte ich an dieser Stelle auch nicht mehr viele Worte
verlieren - die Hintergrundbilder und -muster sind sicherlich
Geschmackssache und die Pics der HEW `99 bzw. die Homepage d&#252;rften vielen
schon bekannt sein. Bleiben also noch die Toolbars (f&#252;r DirOPus, GNG,
IconBar, NetInfo, STFax, Voyager und YAM), die sicherlich dazu beitragen,
die WB im einheitlichen &quot;Glow Icons&quot; Stil zu halten und dementsprechend
attraktiv zu machen. Eines haben diese Extras aber alle gemeinsam: An der
grafischen Qualit&#228;t gibt`s nix zu meckern; in der Vergangenheit war es ja
h&#228;ufiger vorgekommen, da&#223; insbesondere die Patterns bei ähnlichen Compilations eine total
inaktzeptabele Qualit&#228;t hatten und somit nicht mehr sinvoll zu verwenden
waren.</P>

Kommen wir aber zu dem Schwerpunkt der CD: Den &quot;Glow Icons&quot;. Und hier hat
man wirklich ganze Arbeit geleistet. Statt nur die Icons allesamt in einen
Ordner zu packen, hat man alles sch&#246;n ordentlich in verschiedene Schubladen
gepackt, die obendrein noch nach Genres unterteilt sind. In der Praxis
bedeutet das: Sucht man ein Piktogram z.B. f&#252;r ein Grafiktool schaut man einfach
im Ordner &quot;Graphics&quot; nach und schon hat man alle Piktogramme dieses Genres
zur Verf&#252;gung und kann sich das passende einfach aussuchen. Aber nat&#252;rlich
braucht man auch entsprechene Schubladen im &quot;Glow Icons&quot; Stil für die WB, die im
Idealfall auch ein eigenes (kleines) Symbol beinhalten. Denn wenn wir
ehrlich sind k&#246;nnen die Standardschubladen im schn&#246;den blau, so sch&#246;n diese auch sein m&#246;gen,
nach einer gewissen Zeit langweilig werden. Nat&#252;rlich hält
die &quot;Glow Icons CD&quot; auch daf&#252;r Lösungen bereit und
bietet dem User unz&#228;hlige verschiedene Schubladen mit Symbolen. Alternativ
dazu kann man auch &quot;Folders&quot; verwenden, die ebenfalls in Massen f&#252;r so ziemlich jeden Bereich
vertreten sind. Um den Unterschied mal zu verdeutlichen, habe ich mal einen
Screenshot diverser Schubladen und Ordner gemacht - ebenfalls lediglich
eine Frage des Geschmacks (aus Platzgründen musste ich massiv an der Qualitätsschraube drehen - die Dinger sehen im Original wesentlich besser aus :-)):</P><CENTER>
<img src="gicd1.jpg"></P>Das wären die Ordner...</P><BR>
<img src="gicd2.jpg"></P>...und das die Schubladen</P><BR></CENTER>

Aber etwas darf nat&#252;rlich nicht fehlen: Die &quot;Def_Icons&quot;. Den Usern unter
uns, die mit diesem Begriff nichts anfangen k&#246;nnen, sei gesagt, da&#223; die &quot;Def
Icons&quot; Standardsymbole f&#252;r verschiedene Dateitypen sind (z.B. jedes JPG Bild
hat sein eigenes Icon, jedes HTML Dokument ebenfalls usw.). Leider hat man
hier die Auswahl recht &#252;berschaubar gehalten: Nur (??) 121 Icons sind hier
zu finden - im Normalfall reicht das aber auch aus. In diesem Zusammenhang
ist allerdings negativ anzumerken, da&#223; man f&#252;r diese Funktion das
Zusatzprogramm &quot;DefIcons&quot; (bzw. &quot;DefIcons44&quot; f&#252;r OS 3.5 User) braucht, das
man vergeblich auf dieser CD suchen wird. 
Abgerundet wird das Set
der &quot;Glow Icons&quot; noch mit Piktogrammen f&#252;r die verschiedenen Laufwerke
(verschiedene Festplatten, Disketten, Zip Medien etc.) sowie alternativen
Icons f&#252;r die Workbench - also f&#252;r all jene, die die mit OS 3.5
mitgelieferten Icons für die WB eher langweilig finden. Positiv zu erw&#228;hnen ist noch,
da&#223; alle &quot;Glow Icons&quot; eine standardisierte Gr&#246;&#223;e haben, was bei den
unterschiedlichen &quot;Glow Icons&quot; Set`s, die im Aminet zu finden sind, leider
nicht immer der Fall ist.</P>

Vergessen darf man nat&#252;rlich auch nicht die ebenfalls reichlich auf der CD
vorhandenen &quot;Dock Icons&quot;. Tja, das muss man sich auch mal vorstellen: Man
startet ein Programm, wechselt zur&#252;ck zur WB (dem Multitasking sei dank) und
ein Standard (Dock) Icon verschandelt den kompletten Look der WB....</P>

<h2><CENTER><FONT COLOR="BLUE">Sch&#246;n und gut: Aber wie installiere ich die Glow
Icons?</FONT></CENTER></h2></P>
Um die &quot;Glow Icons&quot; &#252;berhaupt installieren zu k&#246;nnen braucht man zun&#228;chst
einmal einen Amiga mit Kickstart 2.04. Aus Spa&#223; habe ich mir die &quot;Glow Icons&quot;
mal auf einem ECS Systen angeschaut und ich sage Euch eines: Unter 64 Farben
solltet Ihr die Idee, die &quot;Glow Icons&quot; zu installieren, gleich wieder
vergessen. Eine Grafikkarte sei Euch deshalb mehr als nur dringend
empfohlen, denn wirklich genial schaut die ganze Sache nur mit 256 Farben
aus - mal ganz davon zu schweigen, da&#223; die Darstellung unter AGA bei mehr
als 32 Farben alles andere als schnell ist. Ferner solltet Ihr mindestens
noch das New Icon System installiert haben (zu finden im Aminet - warum man
es nicht zus&#228;tzlich noch auf diese CD kopiert hat, wei&#223; ich
nicht);
empfohlen wird nat&#252;rlich OS 3.5.</P>

Nun aber zur Installation der &quot;Glow Icons&quot;: Am einfachsten ist tats&#228;chlich
die Installation bzw. Updaten der Icons mit OS 3.5: Einfach das zu
wechselnde Piktogramm anklicken, Informationsfenster &#246;ffnen, das zu
kopierende Icon per Drag &amp; Drop auf das alte im Informationsfenster
vorhandene Icon ziehen und &quot;fallen lassen&quot; - ein Vorgang der nicht mehr als
5 Sekunden dauert. Einen etwas umst&#228;ndlicheren Weg m&#252;ssen die pre-OS 3.5
User gehen, denn diese brauchen zun&#228;chst das Tool &quot;CopyNewIcon&quot; mit dem man
diesen Vorgang zwar auch recht fix, aber eben nicht so schnell,
bewerkstelligen kann. Alles in allem ist die Installation (wenn man den
Vorgang so nennen möchte) alles andere als kompliziert und auch für weniger
versierte User einfach zu bewerkstelligen.
</P>

<h2><CENTER><FONT COLOR="WHITE">Ist alles Gold was
gl&#252;ht?</FONT></CENTER></h2></P>
Wie bei jeder CD gibt`s auch bei der &quot;Gloew Icons CD&quot; etwas zu bem&#228;ngeln,
aber keine Angst: Es handelt sich lediglich um einige kleine
Sch&#246;hnheitsfehler. Neben der bereits erw&#228;hnten Tatsache, da&#223; sich einige
Zusatzprogramme nicht auf der CD befinden, ist mir vor allem negativ
aufgesto&#223;en, da&#223; nicht immer alles in der richtigen Art (also &quot;Schublade&quot;,
&quot;Projekt&quot; etc.) abgespeichert wurde. Zwar umgehen Tools wie &quot;CopyNewIcon&quot;
oder auch OS 3.5 diesen Fehler, aber passieren d&#252;rfte soetwas normalerweise
nicht. Zudem ist auch die Anleitung (die sowohl im Amiga Guide als auch im
optisch wesentlich attraktiveren HTML Format vorliegt) echt kurz geraten,
auch wenn es zu diesem Themenkomplex nicht ganz so viel zu erkl&#228;ren gibt. Es
w&#228;re aber z.B. mal sinnvoll gewesen auch auf das &quot;New Icon&quot; System genauer
einzugehen. Letzter Kritikpunkt ist, da&#223; sich einige Icons doppelt auf der
CD befinden - sofern man das als (negative) Kritik durchgehen lassen
kann.</P><CENTER><img src="gicd3.jpg"></CENTER></P><BR>

<h2><CENTER><FONT COLOR="RED">Fazit</FONT></CENTER></h2></P>
Endlich mal wieder eine CD, die durchweg begeistern kann. Insbesondere OS
3.5 User sollten diese CD unbedingt mal in`s Auge fassen - bei mir war es
jedenfalls der Fall, da&#223; ich mittels dieser CD fast die komplette WB in
einem neuen (Icon) Gewand erstrahlen lassen konnte und damit mitlerweile
viele PS User beeindruckt habe (habt ihr schonmal versucht unter Win98 so
einfach Schubladen Icons auszutauschen, wie es mit OS 3.5 m&#246;glich ist?
H&#246;h&#246;h&#246;...). Aber auch User, die auf das New Icon System setzen, sollten sich
diese CD zulegen. Lange Rede, kurzer Sinn: Eine CD, die f&#252;r knapp 30 DM
einen realen Gegenwert bietet und somit jede Mark wert ist. Pflichtkauf!</P>

<i>Anmerkung zu diesem CD Test: Auf die neue Schreibweise &quot;Ikon&quot; (!) habe ich
bewusst verzichtet und ein Dank an Wolf Zimmer, der mir diese CD zur
Rezension in der NC zukommen lie&#223;. Danke Wolf!</I></P><BR><CENTER>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Schatztruhe</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>29 DM</TD>
</TR>
<TR>
<TD>Inhalt</TD>
<TD>Glow Icons</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>86</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>90 %</TD>
</TR>
</TABLE></P>

<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
