
<HTML>
<HEAD>
<TITLE>Diskussion</TITLE>
<META NAME=<META NAME="AUTHOR" CONTENT="Sieglinde Peters">
</HEAD>
<body>
<BODY BACKGROUND="l_bg.gif">
<Font Color="#ff0000">
<center>
<img src="amigaos.gif" ALIGN=center ALT="amigaos.Gif" WIDTH=176 HEIGHT=44><p>
<H1 ALIGN=CENTER>Erfahrungen mit dem Falkeverlag</H1></FONT>
<p>
<font color=black font size=3>
<p>
</center>
Heute will ich Euch einmal von meinen Erfahrungen mit der AmigaOS
berichten, genau genommen mit dem Falkeverlag. &Uuml;ber die Zeitschrift selbst
wurde ja schon oft berichtet, die ist eigentlich auch ganz in Ordnung. Die
Kundenbetreuung des Verlages l&auml;&szlig;t jedoch sehr zu w&uuml;nschen &uuml;brig.
<br>
Das erste Heft habe ich mir damals auf der Messe in K&ouml;ln gekauft und gleich ein
Probeabo f&uuml;r drei Monate abgeschlossen. Die ersten drei Hefte wurden mir
schon jedesmal mit einigen Tagen Versp&auml;tung zugeschickt. Ich habe das auf
Anlaufschwierigkeiten zur&uuml;ckgef&uuml;hrt. Mit der Zuversicht, da&szlig; eigentlich
alles nur besser werden kann, habe ich dann ein Abo mit Leser-CD gekauft, die
Rechnung &uuml;berwiesen und bin dann in Urlaub geflogen.<BR>
Nach meiner R&uuml;ckkehr fand ich zu meinem Erstaunen eine Mahnung im Briefkasten.
Daraufhin schickte ich eine E-Mail an die Abo-Betreuung und teilte den Lieben
dort mit, da&szlig; ich die Rechnung bereits vor mehreren Wochen bezahlt habe.
Danach habe ich zwar  nichts mehr vom Falkeverlag geh&ouml;rt, aber eine kleine
Entschuldigung f&uuml;r eine unberechtigte Mahnung h&auml;tte ich schon erwartet.
<br>
Die Zeitschrift erschien weiterhin mit Versp&auml;tung. Besonders wenn die Leser-CD
mitgeliefert wurde, konnte die sie schon mal mehr als eine Woche betragen. Als
besonders &auml;rgerlich empfand ich die Tatsache, da&szlig;  die Zeitung
am Kiosk p&uuml;nktlich im Regal lag, w&auml;hrend ich als Abo-Kunde noch tagelang
darauf warten mu&szlig;te. Das habe ich auch dem Falkeverlag per E-Mail
mitgeteilt. Eine Antwort aber habe ich nie erhalten.
<br>
Neben der AmigaOS hatte
ich auch die AmigaPlus im Abo. Als sich so langsam abzeichnete, da&szlig; diese
Zeitung dem Ende entgegen ging, habe ich sie gek&uuml;ndigt. Mit der Ausgabe
6/2000 w&auml;re mein Abo ausgelaufen. Leider hat die AmigaPlus schon vorher
die Segel gestrichen. Auf die telefonische Anfrage beim ICP- Verlag, was denn
nun mit dem Geldbetrag f&uuml;r die nicht gelieferten AmigaPlus-Hefte geschehen
w&uuml;rde, wurde ich gebeten, mich an den Falkeverlag zu wenden, der habe
alles &uuml;bernommen. Auf der Homepage der AmigaOS konnte ich dann lesen,
da&szlig; die Plus-Abos in OS-Abos ge&auml;ndert, und einfach verl&auml;ngert werden
sollten.<br>
Damit war ich aber &uuml;berhaupt nicht einverstanden, weil die ewigen
Versp&auml;tungen mich inzwischen doch ziemlich nervten und ich au&szlig;erdem
&uuml;berlegte evtl. das System zu wechseln. Per Einschreiben habe ich Anfang
Januar mein Abo bei der AmigaOS gek&uuml;ndigt und darauf hingewiesen, da&szlig;
ich eine Verl&auml;ngerung des Abos nicht zustimme und auf die R&uuml;ckzahlung des
zuviel gezahlten Beitrages des AmigaPlus-Abos bestehe.  Wie immer kam vom
Falkeverlag keine Reaktion. Keine Antwort erhielt ich auch auf meine E-Mails.
<br>
Bei der Ausgabe 02/2000 fehlte die Leser-CD. Wieder schickte ich eine E-Mail
an die Abo-Betreuung. Darin bat ich um die fehlende CD und erinnerte
gleichzeitig noch einmal an die Angelegenheit mit der K&uuml;ndigung.  Am
n&auml;chsten Tag, ich wagte meinen altersweitsichtigen Augen kaum zu trauen,
fand ich eine E-Mail des Verlages in meinem Postfach. Sie versprachen die CD
sofort abzuschicken (Das haben sie auch tats&auml;chlich umgehend getan). Zu dem
anderen Problem haben sie sich nicht ge&auml;u&szlig;ert. Auf meine Frage, warum sie
meine E-Mail nicht vollst&auml;ndig beantwortet h&auml;tten, erhielt ich wieder keine
Antwort.
<br>
Jetzt bin ich es leid und werde rechtliche Schritte einleiten. Wenn es
beim Falkeverlag nicht &uuml;blich ist, mit den Kunden zu reden, hat ein Anwalt
vielleicht etwas mehr Gl&uuml;ck. Euch kann ich nur raten: Kauft euch die Zeitung
am Kiosk und blo&szlig; nicht im Abo. Abo-Kunden sind beim Verlag offenbar nicht
sehr gesch&auml;tzt. Teilt mir doch mal eure Erfahrungen mit dem Verlag mit. Da
die Leserbriefe in der Zeitschrift immer voll des Lobes sind, habe ich fast den
Eindruck, da&szlig; ich da irgendwie auf einer schwarzen Liste stehe.
<p>
Sieglinde Peters<br>
<img src="compwom.gif" ALIGN=right ALT="amigaos.gif" WIDTH=88 HEIGHT=88><p>
</FONT></BODY>
</HTML>
<HR>
