
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Bubble Heroes - Preview</TITLE>
</HEAD>
<BODY TEXT=black background="kback.png" link=silver alink=red>
<CENTER><h1><b>Bubble Heroes - Preview</CENTER></h1></B></P><HR>
<CENTER><img src="bubbleh.jpg"></CENTER><BR>
<HR>
<FONT SIZE="+1">

Auf dem PC war die &quot;Puzzle Bobble Serie&quot; ein wahrer Hit und sorgte auf der
Dose f&#252;r stundenlangen Spielspa&#223;. Mit &quot;Bubble Heroes&quot; schicken sich Arcadia
an, diesen Spielspa&#223; auch auf dem Amiga zu erm&#246;glichen und haben vor kurzem
eine erste Demo herausgebracht (u.a. auf der AmigaOS Leser CD #4 zu finden).
Das Spielprinzip &#228;hnelt dem bekannten Klassiker Tetris - allerdings mit der
Eigenschaft, da&#223; statt Steinen Blasen von dem Spieler nach oben geschossen
werden m&#252;ssen. Ob es ein gelungener Clone wird ist zum jetztigen
Zeitpunkt zwar noch nicht absehbar, aber trotzdem kann man sich anhand der
Demo schonmal ein Bild von "Bubble Heroes" machen.</P>

Die Vorgeschichte zu &quot;Bubble Heroes&quot; soll uns erstmal nicht weiter aufhalten
- wenn die Vollversion erschienen ist, haben wir immer noch gen&#252;gend Zeit
darauf einzugehen. Also konzentrieren wir uns erstmal auf das eigentliche
Game, in dem man drei verschiedene Spielmodi zur Auswahl hat:</P><UL>

<li> Ein Spieler Game<BR>
<li> Story Modus<BR>
<li> VS Combat</P></UL>

Zwar hat man in der Demo Version nur die M&#246;glichkeit gegen den Computer
anzutreten, aber insbesondere der Story Modus h&#246;rt sich sehr interessant an:
Hier muss man sich durch mehrere Levels mit unterschiedlichen Zielen k&#228;mpfen
und alle Nymphen befreien (deswegen wird der &quot;Story Modus&quot; auch als &quot;Nymphes
Rescue&quot; bezeichnet). In der finalen Endversion sollen sogar noch weitere
Spielmodi implementiert sein - bleibt zu hoffen, da&#223; man den Zwei Spieler
Modus nicht vergisst.</P>

Das alles w&#228;re nat&#252;rlich noch nichts besonderes und deswegen haben die
Programmierer noch einige zus&#228;tzlichen Features eingebaut, die ich Euch
nat&#252;rlich nicht vorenthalten m&#246;chte:</P>

So wird es viele verschiedene Charakt&#228;re geben (die &#252;brigens alle im Manga
Stil gehalten wurden), die jeweils eine Spezialwaffe haben um den Gegner
schneller zu schlagen. Mit diesen Charakt&#228;ren k&#246;nnt Ihr insgesamt 70 Levels
unsicher machen, die sich zudem noch durch jeweils verschiedene Grafik /
Animationen auszeichnen, damit auch ja keine Langeweile aufkommt. Zudem wird
es gesprochene Dialoge zwischen den Charakt&#228;ren, ein gigantisches Intro
sowie 25 CDDA Audio Tracks in der finalen Version geben, die den Spielspa&#223;
noch weiter aufpeppen sollen.</P>

F&#252;r Spielspa&#223; ist also reichlich gesorgt und aus eigener Erfahrung kann ich
sagen, da&#223; die auf drei Minuten beschr&#228;nkte Demo wirklich s&#252;chtig macht. Das
alleine ist nat&#252;rlich noch kein Garant f&#252;r ein gutes Spiel, denn auch die
Technik muss stimmen. Die Grafik ist schon in der jetztigen Demo Versionen
recht ansehnlich und, bedingt durch den Manga Stil, auch im gewissen Ma&#223;e
etwas besonderes. Am Sound gibt`s ebenfalls nichts zu meckern und wenn man
bedenkt, da&#223; es auch noch Intro`s, Animationen und CDDA Tracks geben wird,
braucht man sich um die technische Seite eigentlich keine Gedanken machen.
</P>
<b>Fazit:</B><BR>
Die erste Demo Version von &quot;Bubble Heroes&quot; ist durchaus gelungen und macht
Lust auf die Vollversion. Auch wenn viele Features (z.B. RTG Support) noch
nicht eingebaut sind, kann diese Demo in vielen Belangen schonmal
&#252;berzeugen und ich bin mir sicher, da&#223; die Programmierer mit der Endversion
einen potentiellen Hit abliefern k&#246;nne. Mit derartigen Prognosen soll man
zwar vorsichtig sein, aber &quot;Bubble Heroes&quot; scheint alles andere als ein
08/15 Game zu werden!</P><CENTER><img src="kit.gif"></CENTER></P><PRE>

Name          : Bubble Heroes</P>

Release       : irgendwann 2000</P>

Preis         : 60-90 DM</P>

Anforderungen : AGA, 68020, OS 3.0, 2MB Chip Ram, 4 MB Fast Ram, HD</P>

Empfohlen     : 68030, 8 MB Fast Ram, GraKa</P></PRE>
<HR>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
