

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Hell Squad - Preview</TITLE>
</HEAD>
<BODY TEXT=balck background="kback.png" link=silver alink=red>
<CENTER><h1><b>Hell Squad - Preview</CENTER></h1></B></P><HR>
<CENTER><img src="hell.jpg"></CENTER><BR>
<HR>
<FONT SIZE="+1">

Nach dem Hitverd&#228;chtigen Game &quot;Wasted Dreams&quot; (eine gelungene Mischung aus
Action und Adventure Elementen) haben die Jungs von Digital Dreams schon das
n&#228;chste Game f&#252;r das erste Quartal 2000 angek&#252;ndigt. Der Titel des neuen
Projektes lautet &#252;brigens &quot;Hell Squat&quot;, was dem geneigten Zocker schonmal
gewisse Auskunft &#252;ber das Game gibt.</P>

F&#252;r die NC habe ich mir mal die aktuelle Demo Version angeschaut, die man
entweder aus dem Aminet laden kann (2.5 MB als gepackte Datei) oder
ansonsten auf der neuesten Amiga Future CD findet.</P>

Nach dem Start des Demos befindet man sich auch gleich direkt im Spiel
wieder - ein Intro oder &#228;hnliches gibt es bisher noch nicht, aber bis zum
Release wird wohl, &#228;hnlich wie bei &quot;Wasted Dreams&quot;, noch ein Intro gekreiert
werden. Zu Vorgeschichte sei dann an dieser Stelle auch nicht viel verraten.
Ihr steuert halt eine 4 k&#246;pfige S&#246;ldnertruppe (wobei ihr mittels der F1 - F4
Tasten zwischen den Charakt&#228;ren wechseln k&#246;nnt), die hinter den feindlichen
Linien abgesetzt wurde, um eigene Truppen zu befreien.</P>

Das Spielprinzip ist dabei &#228;hnlich aufgebaut, wie bei &quot;Wasted Dreams&quot;: Ihr
k&#246;nnt auf dem Bildschirm hin und herlaufen (wobei aber die Locations
wesentlich &#246;fter gewechselt werden), dort Sachen aufsammeln und selbige mit
anderen Gegenst&#228;nden benutzen und nat&#252;rlich mittels Eurer Waffe evtl.
vorhandene Gegner eliminieren. Die Munition von dieser ist, zumindest in der
Demoversion, &#252;brigens unbegrenzt, was bei den zahlreichen Gegnern aber auch
bitter n&#246;tig ist. Insgesamt scheint sowieso der Action Anteil deutlich
ausgepr&#228;gter zu sein, auch wenn die vorhandenen R&#228;tsel es durchaus in sich
haben.</P>

Vom Spielprinzip her geht also schonmal alles in Ordnung. Knackpunkt ist mal
wieder die Grafik, die man zwar nicht als schlecht bezeichnen kann (die
Hintergr&#252;nde sind z.B. sehr detailliert gezeichnet worden), aber auch nicht
dem aktuellen Stand der Dinge entspricht. Und um der Wahrheit die Ehre zu
geben: Bei &quot;Hell Squat&quot; handelt es sich, genau wie bei &quot;Wasted Dreams&quot;
um ein ECS kompatibeles Spiel. Die Grafik kann man also am besten mit der
von &quot;Wasted Dreams&quot; vergleichen. Soundtechnisch geht auf jeden Fall alles in
Ordnung und in der Endversion wird es auch gleich komplette Sprachausgabe
geben - ein Feature, das ich mir von jedem Amiga Game w&#252;nschen w&#252;rde.
</P>
Die Anforderungen sind dementsprechend nicht besonders hoch: 3 MB Fast Ram
sowie ein CD Rom Laufwerk reichen aus, um &quot;Hell Squat&quot; zum laufen zu
bringen. Ob es Grafikkartenunterst&#252;tzung geben wird, stand zum Zeitpunkt
dieses Berichtes noch nicht fest, aber lobenswert w&#228;re es auf jeden Fall.
Wohl denen, die eine Picasso IV (mit integriertem Flickerfixer) Ihr eigen
nennen :-))
</P>
<h2><CENTER>Fazit</h2></CENTER></P><FONT SIZE="+1">
Im Gegensatz zu vielen aktuellen Demoversionen (ich sage nur &quot;Super Pino&quot;
etc.) macht &quot;Hell Squat&quot; schon jetzt einen tierischen Spa&#223; und verspricht,
ein kleiner Hit zu werden. Auch wenn man teilweise Abstriche bei der
grafischen Umsetzung machen muss, bleibt unter dem Strich ein wirklich gut
gemachtes Action Adventure &#252;brig. Besonders Fans von &quot;Wasted Dreams&quot; werden
mit &quot;Hell Squat&quot; einen Heidenspa&#223; haben; ein Antesten der Demo (bei der auch
gleich ein L&#246;sungsweg beiliegt) kann auf jeden Fall nicht schaden. Ich freu
mich schonmal auf die Vollversion!</P></FONT>
<PRE><CENTER>
<img src="kit.gif"></CENTER></P>
Name         : Hell Squat

Publisher    : Digital Dreams

Release      : 1. Quartal 2000

Preis        : zwischen 70-90 DM

Anfoderungen : ECS Amiga mit 3 MB Ram und CD Laufwerk

Empfohlen    : mehr als oben geschrieben, braucht man nicht....</PRE>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
