
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Red Mars - Pathfinder läßt grüßen!</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="GREEN">Game Test: Red Mars</FONT></h1></P>
<img src="rm1.jpg"><BR></P></CENTER>
Das der Amiga derzeit mit kommerziellen Spiele Ver&#246;ffentlichungen
&#252;bersch&#252;ttet wird, kann man wohl getrost verneinen. Rechtzeitig zum
Weihnachtsgesch&#228;ft (ist auch schon wieder `ne Weile her) ist aber das neue
Strategiespiel &quot;Red Mars&quot; (fr&#252;herer Titel &quot;Psyche Of Machines&quot;) endlich in
einer verkaufsfertigen Version erschienen. Ob diese freilich auch das
qualitative Zeug hat, ein kommerzieller Erfolg zu werden, muss sich noch
herausstellen.</P>

<h2><CENTER><FONT COLOR="YELLOW">Erst die Arbeit, dann das
Vergn&#252;gen</FONT></h2></CENTER></p>
Schon die Anforderrungen an die Hardware lassen dem Tester das Blut in den
Adern gefrieren: Ein Amiga mit 1MB Chip Ram und 1MB Fast Ram samt CD
Laufwerk wird da lediglich verlangt. Eine Firma, in diesem Fall die Newcomer
Elbox, hat es mal wieder geschafft, ein neues Game auf einem nahezu nackten
Amiga 500 zum laufen zu bewegen. Empfohlen wird zwar noch eine Festplatte
und Grafikkarten werden netterweise auch unterst&#252;tzt (wenn auch nicht
ausgenutzt), aber ich habe mir mal den Spa&#223; gemacht und &quot;Red Mars&quot; auf einem
degradierten Amiga 2000 laufen lassen - ein qualitativer Unterschied zu einem
A4000 mit einigen Extras (siehe Mitgliederliste) war kaum auszumachen.
</P>
Was die Installation angeht: Es befinden sich insgesamt 8 verschiedene
Versionen von &quot;Red Mars&quot; auf der CD, von denen man sich die geeignete
aussuchen muss. Da w&#228;ren erstmal die 4 normalen Versionen in verschiedenen
Sprachen (Englisch, Deutsch, Franz&#246;sisch und Polnisch), die dann auch
nochmals in entsprechenden RTG Versionen vorliegen. Wenn man die geeignete
Version gefunden hat, braucht man den entsprechenden Ordner nur noch auf die
Festplatte kopieren (ein starten von CD ist nat&#252;rlich auch m&#246;glich) und das
Script &quot;Prepare System&quot; starten, welches u.a. den Pfad f&#252;r die Spielst&#228;nde
angibt und zudem noch einige Modifikationen in der &quot;User-Startup&quot; vornimmt.
</P>
<h2><CENTER><FONT COLOR="WHITE">Das Game</FONT></CENTER></h2></P>
Nachdem man also alles erfolgreich installiert hat, kann man sich zuerst dem
&quot;Genuss&quot; des Intro`s aussetzen, welches man wohl ohne Probleme als eine
extrem billige Slideshow von Bildern bezeichnen k&#246;nnte. Dazu gibt`s einen
mit Rechtschreib- und Grammatikfehlern nur so &#252;berh&#228;uften Text gepaart mit
belangloser Musik. Motivation bzw. Lust auf`s Spiel will nach diesem Intro
absolut nicht mehr aufkommen - wie gut nur, da&#223; man mittels des &quot;Quick
Start&quot; Icons auch sofort in`s Spiel gelangen kann.</P>

Obwohl, &quot;sofort&quot; ist auch nicht das richtige Wort, denn man muss zuerst noch
das Problem des Kopierschutzes &#252;berwinden. Ja, Ihr habt richtig gelesen:
Kopierschutz! Dreimal m&#252;sst Ihr irgendwelchen Zeichenkombinationen auf dem
Schirm Zahlen &amp; Buchstaben zuordnen - das raubt einem wirklich den letzten
Spielspa&#223;.</P>

Nun kann es aber endlich losgehen und man kann endlich anfangen zu zocken. Wie man recht
schnell merkt, handelt es sich bei &quot;Red Mars&quot; nicht um ein
<img src="rm4.jpg" align=left>Echtzeitstrategiegame (wie es heute eigentlich &#252;blich ist), sondern um ein
Rundenbasierendes in der Tradition von &quot;Battle Isle&quot; oder &quot;History Line
1914-1918&quot;. Inhaltlich geht es bei &quot;Red Mars&quot; grob zusammengefasst darum,
da&#223; Ihr auf dem besagten roten Planeten eine eigene Gesellschaft von
Robotern aufbaut, die schlussendlich den ebenfalls auf dem Mars befindlichen
Gegnern den Gar ausmachen kann - und das nat&#252;rlich nicht etwa mit Diplomatie
(so etwas gibt es in &quot;Red Mars&quot; n&#228;mlich nicht), sondern mit purer
Waffengewalt. Um also eine gro&#223;e und m&#246;glichst schlagfertige Armee
aufzubauen muss man, &#228;hnlich wie beim Klassiker &quot;Die Siedler&quot;, f&#252;r die
konsequente Versorgung der Gesellschaft mit den verschiedenen Erzen
(insgesamt immerhin auch 9) sorgen. Um diese Erze zu f&#246;rdern braucht man
nat&#252;rlich entsprechende Minen (samt Arbeitern) und Kraftwerke, die die Erze
zu Strom weiterverarbeiten. Dieser Strom wird dann an die Laboratorien und
Fabriken weitergeleitet werden. In den Laboratorien werden neue Technologien
(z.B. bessere Roboter) erfunden und die Fabriken haben nat&#252;rlich die
Aufgabe, m&#246;glichst viele Roboter herzustellen. Insgesamt gibt es nur
4 verschiedene Roboter Arten: Die &quot;K&#228;mpfer&quot; (die nat&#252;rlich dem Angriff bzw. der Verteidigung dienen)
, die &quot;Techniker&quot; (diese k&#246;nnen neue Geb&#228;ude errichten und darin arbeiten),
die &quot;Minenarbieter&quot; (diese f&#246;rdern die Erze) und die &quot;Erkundungsroboter&quot;
(die das Gel&#228;nde zum Anfang eines Levels erkunden).</P>

Aber nicht nur mit der Quantit&#228;t der Roboter haben sich die Programmierer
merklich zur&#252;ckgehalten, auch die Anzahl der Geb&#228;ude ist nicht gerade
umwerfend: Neben den oben erw&#228;hnten Geb&#228;udetypen (Mine, Kraftwerk, Fabrik
und Laboratorium) sind nur noch zwei weitere Arten in das fertige Spiel
implementiert. Dies w&#228;re zum einen die Reperatur Werkstatt, in der man
besch&#228;digte Einheiten gegen Energie reparieren kann, und zum anderen der
Teleporter, mit dessen Hilfe man Einheiten schnell und einfach (aber nicht
umsonst) von einem Ort zum anderen transportieren kann. Einige der Geb&#228;ude
kann man zwar noch vergr&#246;&#223;ern (in max. drei Gr&#246;&#223;en), aber das tr&#228;gt auch
nicht wirklich dazu bei, die recht spatanische Ausstattung mit Geb&#228;uden zu
vergessen.</P>

Damit w&#228;re das Spielprinzip, das recht s&#252;chtig machen kann und zumindest
mich f&#252;r viele Stunden an den heimischen Amiga gefesselt hat, erkl&#228;rt und
hat sonst recht wenige neue Dinge zu offerieren; im Grunde nur ein Mix aus
bekannten Elementen, der zwar keine Meilensteine in diesem Genre setzen
wird, aber f&#252;r einige vergn&#252;gliche Stunden ausreichend ist.</P>

<h2><CENTER><FONT COLOR="BLUE">Die technische Seite</FONT></h2></CENTER></P>
War die spieltechnische Seite noch zufriedenstellend, ist die Technik an
sich in &quot;Red Mars&quot; absolut veraltet und macht ein ansonsten nettes Spiel f&#252;r
zwischendurch konsequent kaputt. Hauptkritikpunkt ist mal wieder die Grafik,
die mit aktuellen Amiga (Napalm, Exodus, Tales From Heaven, Ph&#246;nix
etc.) oder gar PC Spielen auf keiner Ebene mehr mithalten kann. Denn wenn
man mal von einigen recht passabelen gerenderten Zwischenbildern absieht,
ist die Grafik an sich nur ein Witz: Die Men&#252;s sind derma&#223;en &#252;berladen und
gl&#228;nzen zudem noch mit einer Farbenkonstellation (rote Schrift auf grauem
Hintegrrund), da&#223; man sich fast fragt, ob die Programmierer blind sind. Aber
auch die Geb&#228;ude und die Robotereinheiten sind viel zu grobpixelig und
Details lassen sich schon gar nicht erkennen. Hinzu kommt der absolut
langweilige Boden des roten Planeten, der so gut wie gar keine Abwechselung
bietet und mit Features wie Bergen, T&#228;lern oder Unebenheiten schon gar nicht
ausgestattet ist. 
Selbst unter AGA habe ich das
Gef&#252;hl, maximal 32 Farben auf dem Screen zu sehen.</P>

Hinzu kommt noch eine derma&#223;en nervige Musik (die zugegebenerma&#223;en
wenigstens etwas in`s Spielkonzept passt) sowie einige SoundFX, die
ebnefalls nicht der Wei&#223;heit letzter Schluss sein k&#246;nnen und genau wie die
Grafik total antiquiert wirken.</P><CENTER>
<img src="rm3.jpg"></CENTER></P><BR>
<h2><CENTER><FONT COLOR="RED">Fast vergessen...</FONT></h2></CENTER></P>
Im Gegensatz zu manch anderen Spielen hat &quot;Red Mars&quot; wenigstens eine
gedruckte Anleitung als CD Booklett beiliegen. Da gibt`s aber leider auch
einen kleinen Haaken bei: Die Anleitung ist komplett in Englisch gehalten
und somit zumindest f&#252;r einige User absolut unverst&#228;ndlich. Eine deutsche
Anleitung ist auf der CD nirgendswo zu finden, so da&#223; man sich evtl. erst eine l&#228;ngere Zeit
in
das Spiel einarbeiten muss. Zu einer weiteren Abwertung f&#252;hrten noch die
vereinzelten Fehler in der deutschen Version, die aber gl&#252;cklicherweise
nicht so oft auftraten wie im Intro. Auf der CD befinden sich auch noch
einige Pics, die als Hintergrundbilder f&#252;r die WB gedacht waren. Wer damit
seine WB &quot;versch&#246;nern&quot; will, der kann sich gleich die MagicWB Icons
samt OS 2.0 installieren. Auf Deutsch hei&#223;t das also, da&#223; die
Bilder nat&#252;rlich dem grafisch h&#246;chst abschreckenden Niveau des Games
entsprechen und somit h&#246;chstens f&#252;r den einen oder anderen Test zu
gebrauchen sind...</P><CENTER><img src="rm2.jpg"></CENTER></P><BR>

<h2><CENTER><FONT COLOR="GRAY">Fazit</FONT></h2></CENTER></P>
Ach, was soll ich noch gro&#223; Worte &#252;ber &quot;Red Mars&quot; verlieren. Ich hatte
zumindest etwas Spa&#223; an dem Game und muss festhalten, da&#223; zumindest
Spielspa&#223; r&#252;berkommt, auch wenn von Dauermotivation sicherlich nicht die
Rede sein kann. Bei einem Vergleich mit aktuellen Games auf dem Amiga w&#252;rde
&quot;Red Mars&quot; sicherlich gandenlos verlieren und sei deshalb nur Leuten
empfohlen, die gerne Klassiker wie &quot;Battle Isle&quot; zocken und sich nicht alzu
sehr um technische Details (wie etwa Grafik) k&#252;mmern. Im Grunde also
etwas besser als das total ungen&#252;gende &quot;Moonbases&quot;....
</P><BR><CENTER>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Programmierer / Anbieter</TD>
<TD>Elbox / Epic Marketing</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>59 DM</TD>
</TR>
<TR>
<TD>Genre</TD>
<TD>(rundenbasierendes) Strategiegame</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>650</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>40 %</TD>
</TR>
</TABLE>
</CENTER></P><BR>




<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
