

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Tales Of Tamar - Preview</TITLE>
</HEAD>
<BODY TEXT=black background="kback.png" link=silver alink=red>
<CENTER><h1><b>Tales Of Tamar - Preview</CENTER></h1></B></P><HR>
<CENTER><img src="tales.jpg"></CENTER><BR>
<HR>
<FONT SIZE="+1">

Lange Zeit war das erste Internet Game f&#252;r den Amiga angek&#252;ndigt - nun ist
endlich die erste offizielle Demo erschienen, die u.a. auf der Amiga Future CD 22
zu finden ist. Die Rede ist von dem RPG (Role Playing Game) &quot;Tales Of
Tamar&quot;.</P>

Und in der Tat: Die Demo macht Lust auf mehr - auch wenn ich nichts zum
eigentlichen Game sagen kann, da ich keinen Internetzugang habe. Aber auch
ohne kann man einen gem&#252;tlichen Rundgang durch das virtuelle Mittelalterdorf
in &quot;Tales Of Tamar&quot; machen. Am auff&#228;lligsten ist nat&#252;rlich die
atemberaubende Grafik, die richtig Atmosph&#228;re aufkommen l&#228;&#223;t und zumindest
in der Demo einen rundherum gelungenen Eindruck machte. Selbiges gilt auch
f&#252;r den Soundtrack, der ebenfalls &#252;ber jede Kritik erhaben scheint: Passend
zum Game hat man sich nat&#252;rlich auf Mittelaltermusik beschr&#228;nkt, die aber
gekonnt komponiert wurde und somit auch seinen Teil zum m&#246;glich
realit&#228;tsnahen Spiel beitr&#228;gt. Aber auch die Soundeffekte, von denen es auch
einige gibt, machen einen &#252;berragenden Eindruck. Abgerundet wird das
Thema "Atmosphäre" von angepassten Requestern, die ebenfalls im Mittelater
Look gestaltet sind.
Selten zuvor habe ich ein Spiel gesehen, das
eine derma&#223;en packende Atmosph&#228;re bot.</P>

Aber all das drumherum bringt nat&#252;rlich nichts, wenn das Spielprinzip dabei
vernachl&#228;ssigt wird. Ok, dazu l&#228;&#223;t sich aus meiner Sicht jetzt noch nicht
viel sagen, da ich das Game bisher noch nicht wirklich gespielt habe. F&#252;r
die, die es noch nicht wissen: Bei &quot;Tales Of Tamar&quot; geht es darum, eine
Stadt aufzubauen und diese zu verwalten, dabei aber stetig zu expandieren.
Dazu geh&#246;ren dann z.B. Dinge wie Handel, aber auch Krieg f&#252;hren (wer sich
mit &#228;lteren Amiga Games auskennt, kann &quot;Kaiser&quot; oder &quot;Hanse&quot; als
Anhaltspunkt w&#228;hlen).</P>

Das an sich w&#228;re noch nichts besonderes; auf dem PC gibt es immerhin duzende
solcher Spiele. Was &quot;Tales Of Tamar&quot; aber dennoch interessant macht ist die
oben erw&#228;hnte Tatsache, da&#223; es sich um ein Internetgame handelt, so da&#223; es
keine Limitation bei der Anzahl der Mitspieler gibt und theoretisch
unendlich viele dran teilnehmen k&#246;nne. Somit wird man als Spieler mit immer
neuen Gegnern konfrontiert und hat nicht die Zeit, sich mal eben zur Ruhe zu
setzen. Technisch sieht das ganze so aus, da&#223; man einen Internetzugang
braucht und w&#246;chentlich seine Daten per E-Mail verschickt (=&gt; eine
Spielrunde). Und da das Game auch f&#252;r andere Plattformen erscheint (erst
Amiga, dann PC und anschlie&#223;end Java), sollten sich gen&#252;gend Mitspieler
finden. F&#252;r Langzeitmotivation ist also bestens gesorgt...</P>

Und da "Tales Of Tamar" ohnehin Grenzen sprengen will, gibt`s noch zwei
weitere Extras, die das Game noch interessanter machen: Da wären zum einen
die integrierten (kleinen) Online Games, die das Spiel etwas auflockern und
abwechselungsreicher machen sollen. Und zum anderen wäre da ein extra
eingerichteter Chatroom, den man auch direkt aus dem Spiel heraus betreten
kann. Zwei wirklich tolle Ideen!</P>

<b>Fazit</B>:<BR>
Da &quot;Tales Of Tamar&quot; kostenlos (!!) erh&#228;ltlich sein wird, kann ich jedem
Amiga User mit Internetzugang das Spiel wirklich nur empfehlen.
Negativeindr&#252;cke konnte ich nicht ausmachen und somit sollte sich jeder
schnell die aktuelle Release holen. Ist wirklich eine tief beeindruckende
Sache, zumal angekündigt wurde, sich mit Updates / Erweiterrungen ständig um
das Game zu kümmern...</P><CENTER><img src="kit.gif"></CENTER></P>  
<PRE>
Publisher    : Eternity</P>

Release      : Schon fertig :-))</P>

Preis        : Umsonst!</P>

Anforderungen: Amiga mit AGA, 68040, Internetzugang, HD, 16 MB Fast Ram</P>

Empfohlen    : GraKa, 68060, mehr Ram</P></PRE>
</P>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
