
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Virtual Grand Prix - Der langerwartete Kracher?</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="YELLOW">Virtual GP</FONT></h1></CENTER></P>

Auch wenn es in letzter Zeit dem Amiga Spielemarkt wieder etwas besser zu
gehen scheint, was sich sowohl in der Qualit&#228;t als auch Quantit&#228;t der
Spielesoftware niederschlug, so wurde ein Genre in den letzten Jahren
&#252;berhaupt nicht beachtet. Die Rede ist hier von den Formel 1 Simulationen,
f&#252;r all jene, die mal nachempfinden wollen, wie sich Michael Schumacher und
Mikka H&#228;kkinen hinter dem Steuer f&#252;hlen. Nach den beiden Klassikern &quot;Formula
One GP&quot; und &quot;Grand Prix Circuit&quot; war in diesem Bereich auf dem Amiga absolut
nichts mehr los. Das neue &quot;Virtual GP&quot; (im folgenden mit &quot;VGP&quot; abgek&#252;rzt), das nach mehreren Verz&#246;gerungen nun
endlich erschienen ist, verspricht mal wieder etwas Bewegung in diesen
Bereich zu bringen. Ob dieses Unterfangen gelungen ist, soll dieser Test
zeigen.</P>

<h2><CENTER><FONT COLOR="WHITE">Was bietet VGP ?</FONT></CENTER></h2></P>
Zuerst einmal erwartet den Spieler nach dem Start des Games ein gut
gemachtes Intro, welches im HAM 8 Format vorliegt. Das Intro vermittelt auf
jeden Fall schonmal Atmosph&#228;re und macht Lust auf mehr, zumal es nicht
einfach nur ein 08 / 15 Intro ist. Selbiges kann man nat&#252;rlich auch mit
einem Klick auf die Maustaste abbrechen.
Man hat sich offenbar viel M&#252;he gegben um das Feeling der echten Formel 1
r&#252;berzubringen, was sich vor allem darin ausdr&#252;ckt, da&#223; man vor dem
jeweiligen Rennen viel an seinem Auto &#228;ndern und verbessern kann. Wer darauf
gehofft hat, sich einfach nur in das Cockpit zu setzen und dann auch noch
alle Rennen zu gewinnen, ist auf dem Holzweg. So kann man eine ganze Reihe
von Dingen vor der jeweiligen Fahrt einstellen, die dann sp&#252;rbare
Auswirkungen auf das Fahrverhalten haben. So gibt`s unter anderem
Einstellungsm&#246;glichkeiten f&#252;r Reifenverschlie&#223;, Umdrehungszahl,
Federungsrate, Bremskraft, Bodenhaftung und Gangschaltung. Es kommen aber
noch zahlreiche weitere hinzu, so da&#223; man vor dem eigentlichen Rennen viel
Zeit darin investieren sollte, um einen m&#246;glichst optimalen Flitzer in`s
Rennen schicken zu k&#246;nnen. Idealeinstellungen gibt es &#252;brigens auch nicht;
vielmehr h&#228;ngt alles vom individuellen Fahrstil sowie der jeweiligen Strecke
ab - eben wie in der richtigen Formel 1.</P>

Hat man nun endlich alles eingestellt und in Testrundl&#228;ufen schonmal etwas
Praxis gesammelt, kann man sich an sein erstes Rennen wagen. Bei den 16 zur Verf&#252;gung stehenden
Rennstrecken handelt es sich &#252;brigens um die Originalstrecken aus der Formel 1 mit all
<img src="vgp1.jpg" align=left>ihren T&#252;cken und Gemeinheiten. Selbiges gilt auch f&#252;r die Teams und die Namen der Fahrer,
wobei man aber, aus Lizenstechnischen Gr&#252;nden, leichte Ver&#228;nderungen
vornehmen musste. Ist aber auch ziemlich egal, da man mit einem Editor sehr
schnell alles ab&#228;ndern kann und somit in den Genuss von Originaldaten kommt.
Somit kann endlich das erste Rennen losgehen und wer dachte, da&#223; es einfach
wird, wird schnell eines besseren belehrt: Durch die sehr realit&#228;tsnahe
Steuerung wird das lenken des Fahrzeugs alles andere als einfach und wer
sein Auto nicht ausreichend optimiert hat, wird hier sein blaues Wunder
erleben. Aber selbst wenn man vorher viel Zeit darin investiert hat, die
optimalen Einstellungen zu finden, so ist dies noch lange kein Garant daf&#252;r,
da&#223; man die Ziellinie auch heil &#252;berquert. Denn schon geringe Fahrfehler
reichen aus, um einen spektakul&#228;ren Crash auf dem Bildschirm bewundern zu
k&#246;nnen, der wiederrum dem Auto alles andere als gut tut. Besonders als
Anf&#228;nger bleibt man davon leider nicht verschont und so wird man einiges an
Training in VGP stecken m&#252;ssen, um in dem Spiel zurecht zu kommen. F&#252;r
Langzeitmotivation ist n&#228;mlich, dank des hohen Schwierigkeitsgrades,
gesorgt. Teilweise kann man zwar noch Abhilfe schaffen (z.B. Automatische
Gangschaltung oder Ausgleich bei geringen Fahrfehlern), aber wesentlich
einfacher wird VGP dadurch auch nicht. Ich pers&#246;nlich finde das aber
gut so, denn was bringt mir eine Formel 1 Simulation, in der ich schon nach wenigen
Tagen alle Rennen gewinne ?</P>

<h2><CENTER><FONT COLOR="GREEN">Die Technik</FONT></CENTER></h2></P>
Die spielerische Seite stimmt also, auch bedingt durch das Nachempfinden der
echten Formel 1 mit der M&#246;glichkeit, alles einzustellen, vollkommen und gibt
keinen Anlass zur Kritik. Selbiges gilt leider nur eingeschr&#228;nkt f&#252;r die
grafischen und soundtechnischen Erg&#252;sse, die sich die Programmierer
geleistet haben. Sicherlich bietet VGP eine gute 3D Engine, die zwar nicht
mit den aktuellen auf dem PC mithalten kann, aber keineswegs schlecht ist,
<img src="vgp2.jpg" align=right>aber bedingt durch die Tatsache, da&#223; alles f&#252;r AGA konzipiert und optimiert
wurde, hat man vielzuviele Kompromisse geschlossen. So wirkt die Umgebung im
Rennen mit den ganzen Wolken, Zuschauern und B&#228;umen noch recht ordentlich,
aber die Fahrzeuge wirken teilweise etwas kantig. Eine Grafikkarte bringt in
Verbindung mit VGP &#252;brigens &#252;berhaupt keine Vorteile (da halt alles f&#252;r AGA
optimiert wurde) und eben jenes Vorgehen verstehe ich absolut nicht. Eine
entsprechende Warp 3D Version von VGP w&#228;re, in meinen Augen, absolut
sinnvoll gewesen, da die eigentliche Simulation, wie oben beschrieben,
absolut einwandfrei ist. Nicht unwesentlich schuld daran ist auch die sehr
niedrige Aufl&#246;sung, in der man VGP laufen lassen kann: Da w&#228;re einmal die
Standard Low Res Version (320 X 256) sowie die Med Res Version (320 X 512),
f&#252;r die man aber mindestens einen 040er braucht. F&#252;r Grafikkartenbesitzer
ist zudem noch die Version mit Double Buffering interessant, die das
Flackern bei bestimmten GraKa`s auf ein Minimum reduziert.</P> 

&#220;ber den Sound kann man hingegen nicht meckern: So gibt es w&#228;hrend des
Rennens halt die typischen Fahrger&#228;usche, wie man sie schon aus zig anderen
Simulationen und dem echten Leben kennt - viel mehr kann man hier auch nicht
bieten. Und vor dem Rennen bekommen die Ohren sogar noch einige, wenige
gesprochene S&#228;tze zu h&#246;ren, die allemal ein nettes Extra darstellen und f&#252;r
etwas Abwechselung sorgen.</P>

<h2><CENTER><FONT COLOR="BLUE">Was braucht man f&#252;r
Hardware</FONT></CENTER></h2></P>
Wie oben schon erw&#228;hnt, braucht man zwingend einen AGA Amiga. Dieser sollte
mit mind. einem 68030 mit 25 MhZ ausgestattet sein. Man kann das Spiel zwar
auch auf einem 020er zum laufen bewegen, allerdings ist dann die Frame Rate
derma&#223;en niedrig, da&#223; man an spielen nicht mehr denken kann. Zudem sollten
im Amiga mindestens 6 MB Ram (2 MB Chip + 4 MB Fast) sowie ein 8 X CD Rom Laufwerk ihren Dienst
verrichten. Grafikkarten werden zwar nicht explizit unterst&#252;tzt, aber auf meiner Picasso IV l&#228;uft es trotzdem
einwandfrei. Auf anderen Karten (z.B. BVision PPC) muss man, laut Anleitung, noch etwas
mit den Parametern rumspielen, um optimale Ergebnisse zu erhalten. Ich
empfehle einen 040er (oder besser) samt einer wohlwollend proportionierten Menge Ram, da die Med Res Version doch um einiges
besser aussieht, als die Low Res Version.</P>

<h2><CENTER><FONT COLOR="RED">War sonst noch was?</FONT></CENTER></h2></P>
Einige Kleinigkeiten sollten der Vollst&#228;ndigkeit halber noch kurz erw&#228;hnt
werden, sind aber f&#252;r das Spiel an sich nur sekund&#228;r: So gibt es z.B. mal
wieder kein Handbuch zu dem Spiel sondern nur eine simple deutsche und
englische ASCII Textdatei, die in kurzen Worten das wesentliche vom Spiel
vermittelt. Als ausf&#252;hrlich kann man diese zwar nicht bezeichnen, so da&#223; man
u.U. selber etwas experementieren muss. Zudem hielt man es auch nicht f&#252;r
n&#246;tig, ein ordentliches Installationsscript zu schreiben, so da&#223; man nach
der Installation noch einige weitere Dateien manuell auf die Festplatte
kopieren muss. Ist zwar nicht gerade schwierig, aber es ist trotzdem echt
nervig, da&#223; man solche Kleinigkeiten in letzter Zeit immer selber machen
muss. Ach ja: Sollten die Verk&#228;ufe von VGP dazu ermuntern, werden demn&#228;chst
noch einige Add-ons und Plug-ins realisiert, die dann f&#252;r registrierte User
kostenlos erh&#228;ltlich sein werden. Im einzelnen sind dies PPC Unterst&#252;tzung
(mit dem dann eine Aufl&#246;sung von 640 X 512 m&#246;glich w&#228;re), Multi Player
Option (via Nullmodem) und diverse Editoren (unter anderem f&#252;r Texturen,
Fahrzeuge, Hintergr&#252;nde und Strecken). Also Leute kauft das Spiel
ordentlich, damit diese Zus&#228;tze auch realisiert werden.</P>

<CENTER><img src="vgp3.jpg"></P><img src="vgp4.jpg"></P></CENTER>
<h2><CENTER><FONT COLOR="GRAY">Fazit</FONT></CENTER></h2></P>
VGP ist mit Sicherheit im spielerischen Bereich ein absoluter Volltreffer.
Alleine schon die Komplexit&#228;t beweist, mit welcher Liebe zum Detail hier
gearbeitet wurde. Knackpunkt ist mal wieder die Grafik, die zwar nicht &#252;bel,
aber auch nicht gerade modern ist. Sei es drum: Spielspa&#223; kommt trotzdem auf
und Fans dieses Genres k&#246;nnen bei VGP bedingungslos zugreifen und ich
verspreche jenen, da&#223; sie viele unterhaltsame Stunden vor dem heimischen
Amiga verbringen werden. Alle anderen k&#246;nnen ja mal die Demo antesten, um zu
kl&#228;ren, ob man sich mit diesem Spiel anfreunden kann. Insgesamt ein gutes
Spiel und mit Sicherheit die Nr.1 in diesem Bereich auf dem Amiga!</P><BR>
<CENTER>
<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Epic Marketing</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>ca.80 DM</TD>
</TR>
<TR>
<TD>Genre</TD>
<TD>Rennsimulation</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>527</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>80 %</TD>
</TR>
</TABLE></CENTER></P><BR>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
