

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief von Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=green alink=red>

<h1><CENTER><FONT COLOR="YELLOW">Leserbriefe von Kilian &quot;The Bruce&quot; Servais
</FONT></h1></CENTER></P>
<a href="#sieglinde.html">An Sieglinde Peters</A><BR>
<a href="#wolf.html">An Wolf Zimmer</A><BR>
<a href="#lars.html">An Lars Ph.</A><BR>
<a href="#top5.html">Top 5</A></P>
<hr>
<a name="sieglinde.html">
<b>An Sieglinde:</B><BR>
Sei herzlichst gegr&#252;&#223;t! Ich hoffe, da&#223; Dich der Diskussionbeitrag von Cord
Hagen davon &#252;berzeugt hat, dem Amiga noch eine letzte Chance zu geben - ich
denke diese hat er allemal verdient. Falls Du Dir noch nicht sicher bist,
dann lie&#223; Dir nochmal den Diskussionbeitrag von Cord Hagen durch; danach
wirst Du ohne Frage Deine Situation nochmal &#252;bedenken.</P>

Aber darum ging es mir im Grunde &#252;berhaupt nicht. Vielmehr wollte ich kurz
auf Dein Feedback eingehen. Du sagtest etwas von wegen &quot;noch nicht das
Handtuch geworfen haben&quot;. Sei Dir sicher: Ich werde auch in Zukunft
weiterhin f&#252;r die NoCover schreiben, denn quantitativ waren die letzten
Ausgaben eher d&#252;rftig. &#220;ber Dein Lob diesbez&#252;glich freue ich mich nat&#252;rlich
und ich hoffe nat&#252;rlich, da&#223; auch Du weiterhin f&#252;r die NC schreibst oder
Dich zumindest jeden Monat mit einem kleinen Leserbrief sowie Top 5 aktiv an
der NoCover beteiligst. Selbst wenn Du Dir wieder erwarten einen neuen
Rechner zulegen solltest: Das hei&#223;t ja noch lange nicht, wie Du ja auch
trefflich festgestellt hast, da&#223; man dann mit dem Club &amp; der NC nichts mehr
zu tun hat. Als mach`s mal gut und ich denke, da&#223; man auch weiterhin von
sich h&#246;ren wird!</P>
<hr>
<a name="wolf.html">
<b>An Wolf Zimmer:</B><BR>
Vorweg nochmal danke f&#252;r den netten Brief, den Du mir auf Disk zukommen
lie&#223;t. Dar&#252;ber werde ich mich wahrscheinlich schon per E-Mail bei Dir
gemeldet haben, so da&#223; ich den ganzen Kram thematisch nicht auch hier
nochmal auff&#252;hren muss.</P>

An Schreiberlingen braucht die NC zur Zeit ja ohnehin jeden, der dazu
freiwillig bereit ist. Ich gehe mal nicht davon aus, da&#223; auch nur
irgendjemand &quot;aufh&#246;ren, aufh&#246;ren&quot; rufen wird - dazu geht es der NC einfach
zu schlecht. Umso toller finde ich es da, da&#223; Du versuchst, m&#246;glichst viele
verschiedene Themengebiete anzuschneiden um so Abwechselung in die NC
reinzubringen. Ich jedenfalls finde das begr&#252;&#223;enswert, auch (oder gerade
weil?) wenn es nichts mit dem Amiga zu tun hat.</P>

Was die NC Guide angeht: Die neuen Rubriken E-Mail / HP finde ich als
Nachschlagewerk echt gut. Ich hatte jetzt nur nicht erwartet, da&#223; Du
diesbezugl. Feedback erwartet hattest. Mach aber auf jeden Fall, soweit es
die Zeit zul&#228;&#223;t, weiter damit.</P>

Danke auch f&#252;r die Hilfe zur Metal Corner; soltle ich in diese Ausgabe
bereits eingebaut haben. Als Kritik fasse ich das nat&#252;rlich nicht auf. Im
Gegenteil: Ich finde es echt gut, wenn sich andere Leute zum neuen Outfit
&#228;u&#223;ern und dann noch Verbesserungsvorschl&#228;ge einbringen. Auch daf&#252;r m&#246;chte
ich Dir danken!</P>

Was das Thema Scanner angeht: Das scheidet momentan leider aus, da ich die
n&#246;tigen Finanz Reserven einfach nicht habe. Schade, aber es geht leider
wirklich nicht. Aber vielleicht mal in Zukunft? Als Sch&#252;ler ist man in
dieser Hinsicht ja ohnehin stark limitiert....</P>

So, bis dann!</P>
Nachtrag: Mitlerweile haben wir schon öfter per E-Mail miteinander
kommuniziert, so daß der obige Inhalt nicht mehr aktuell ist. Nur um
Mißverständnissen vorzbeugen...</P>

<hr>
<a name="lars.html">
<b>An Lars Ph.:</B><BR>
Nur ganz kurz was zu Deiner Astro Corner: In der letzten Ausgabe hatte mein
Browser (IBrowse 1.22) einige Leerzeichen falsch interpretiert. Statt des Leerzeichens hatte ich
dann da so `ne Art Quadrat. Es k&#246;nnte daran liegen, da&#223; Du die Seiten auf
einem PC layoutest - bei der Konvertierung gibt es da ja leider immer einige
Probleme. Wollte ich nur mal kurz loswerden. Inhaltlich war &#252;brigens wieder
alles im gr&#252;nen Bereich - mach weiter so. See ya!</P><HR>

<a name="top5.html">
<h2><CENTER><FONT COLOR="GREEN">Top 5</FONT></CENTER></h2></P>

1. Diskussion von Cord Hagen (Volltreffer!)<BR>
2. Dunkelheit 1 + 2 von Wolf Zimmer<BR>
3. Descent Freespace Preview von Sax<BR>
4. Cinerama von Hightower / Fabian Kruse<BR>
5. Astro Corner von Lars Ph.</P>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
