<HTML>
<HEAD>
<TITLE>Count-Zero's COUNT COMEDY - ComputerClub-Satire</TITLE>
</HEAD>
<body background="onl_comcom1.gif" >
<a href=../index.htm><img src=onl_comcom2.gif border=no></a><br>
                                       
<center><h1>DER WDR COMPUTERCLUB</H1></center>
<p><font size=+1 color=brown>
(Man sieht das hell erleuchtete Podium in der Mitte des WDR-Fernsehstudios.
An der Wand dahinter prangt das gelb-verwaschene &quot;Computerclub&quot;-Logo,  rund
um die Mitte des Raumes stehen Tische, auf denen wassergek&uuml;hlte Pentium-
PC&acute;s stehen, auf denen der Windows-Bildschirmschoner flackert. Wolfgang &amp;
Wolfgang, auch bekannt als Dick (Wolfgang 2) &amp; Doof (Wolfgang 1) , sitzen
in den B&uuml;rost&uuml;hlen auf dem Podium und sortieren nerv&ouml;s ihre Spick-Zettel.)
</font></p>

<p><font size=+1 color=black> <b>Doof (schielend):</b>&quot;Hallo Wolfgang!&quot;
</p>

<p> <b>Dick:</b>&quot;Hallo Wolfgang!&quot;

<p> Doof:&quot;Sag&acute; mal, Wolfgang, Du warst doch sicher auf der CeBit?&quot; </p>

<p> (Dick reibt sich den Rauschebart) </p>

<p> <b>Dick:</b>&quot;Ja, toll da&szlig; Du es erw&auml;hnst Wolfgang, ich war tats&auml;chlich
da. Und ich habe ganz tolle Sachen mitgebracht.&quot; </p>

<p> <b>Doof:</b>&quot;Super, Wolfgang. Aber erz&auml;hl&acute; doch mal, war es voll auf
der CeBit?&quot; </p>

<p> <b>Dick:</b>&quot;Aber nat&uuml;rlich war es voll, Wolfgang. Die diesj&auml;hrige
Messe hatte &uuml;ber 650.000 Besucher, das sind fast die H&auml;lfte mal das
Doppelte mehr als letztes Jahr.&quot; </p>

<p> <b>Doof:</b>&quot;Na sensationell. Was gab es denn an besonderen Neuigkeiten
zu vermelden? Ist der neue 486DX-12 schon erh&auml;ltlich; oder setzt man bei
Intel doch eher auf den Pentium-200 Mhz???&quot; </p>

<p> <b>Dick:</b>&quot;Na, man setzt ganz klar auf den 486DX-12, das ist doch
offensichtlich. Das Eisberg-K&uuml;hlsystem des Pentium 200 war auf Dauer doch
etwas kostspielig... und &auml;hm.. umst&auml;ndlich. Der 486DX-12 ist zwar mit einem
Preis von $20.000 nicht unbedingt f&uuml;r jeden Heimanwender empfehlenswert,
also das gebe ich zu, aber trotzdem, ist er, &auml;hm, ja.&quot; </p>

<p> <b>Doof:</b>&quot;Aha. Wird der 486DX-12 denn ein RISC-Prozessor oder einer
der althergebrachten CISCS? Und wie steht es mit der
Duokondensalspirituosenleitung? Ist sie auf 256 oder 4096 Bit ausgelegt?&quot; </p>

<p> <b>Dick:</b>&quot;Also nein, ha ha, k&ouml;stlicher Witz Wolfgang, nein, die
Busbreite des 486DX-12 betr&auml;gt genau 128,17221 Bit.Nat&uuml;rlich ist eine 256
BitVersion geplant. Zu den Duokondensalspirituosenleitungen kann ich bis
jetzt nur sagen, da&szlig; sie zweifach kompensiertes MultiphasenVollduplex mit
DSP-Oversampling bieten.&quot; </p>

<p> <b>Doof:</b>&quot;Sch&ouml;n, aber war das nicht eine herbe Entt&auml;uschung? Ger&auml;t
SchwINTEL nicht langsam ins Kreuzfeuer der Kritik?&quot; </p>

<p> <b>Dick:</b>&quot;Ja, man mu&szlig;, &auml;hm, sagen, ja, die Juser f&uuml;hlen sich, wenn
ich das so banal sagen darf, ver&auml;ppelt. Da erwarten sie ein vollreziprokes
Binominalmultitasking, und bekommen nur ein, ann&auml;hernd, spinatalvirtuoses
32 Bit-Direktionalplexingsystem mit nur 48 DMA-Kan&auml;len.&quot; </p>

<p> <b>Doof:</b>&quot;Unglaublich, so eine Unversch&auml;mtheit.&quot; </p>

<p> <b>Dick:</b>&quot;Und wir, &auml;hm, wir haben es mal wieder aufgedeckt!&quot; </p>

<p> (Doof steht auf und taumelt, mit seinen Spickzetteln raschelnd, vom
Podium vor einen Ventilatorgek&uuml;hlten WOBIS-Laptop, deutet grinsend darauf
und dr&uuml;ckt ein paar Tasten.) </p>

<p> <b>Doof:</b>&quot;Nun, hier sehen sie das neueste von der Softwarefront. MS
DOS Version 4711. Es ist nahezu sensationell, was Hersteller Microsoft
dieses Mal alles in die neueste Version eingebaut hat.&quot; </p>

<p> (Dick w&auml;lzt sich mit der Grazie eines Walfisches ebenfalls vom Podium
und stolpert schwitzend zum anderen Wolfgang.) </p>

<p> <b>Dick:</b>&quot; &acute;Multitasking&acute; hei&szlig;t das Schlagwort. &quot;Multitasking&quot;, das
hat nichts mit Multivitaminsaft zu tun, hahaha, nein, &auml;hm, sondern, &auml;h, das
hei&szlig;t, da&szlig; man mehrere Programme gleichzeitig laufen lassen kann.&quot; </p>

<p> (Dick l&auml;&szlig;t sich ersch&ouml;pft in den Stuhl vor dem Laptop fallen und knetet
die Tastatur mit seinen Fettfingern.) </p>

<p> <b>Dick:</b>&quot;Ich kann das gerne mal demonstrieren, &auml;hm, also ich hab
hier jetzt drei Programme gleichzeitig geladen...&quot; </p>

<p> <b>Doof:</b>&quot;...das ist eine Art Weltneuheit!!!&quot; </p>

<p> <b>Dick:</b>&quot;Richtig, und jetzt, &auml;hm, also ich habe hier Word 12.1,
Lotus-2-4-6 und Quickbasic gleichzeitig laufen und kann jetzt per Mausklick
zwischen den Programmen hin und herschalten, sehen sie, ungef&auml;hr soo...&quot;
</p>

<p> (Dick fummelt ungeschickt mit der Maus herum. Nach drei Sekunden st&uuml;rzt
das System ab, der Monitor verdunkelt sich. Schwei&szlig;perlen stehen Dick auf
der Stirn.) </p>

<p> <b>Doof:</b>&quot;Es funktioniert nicht.&quot; </p>

<p> <b>Dick:</b>&quot;Es funktioniert nicht. Es funktioniert tats&auml;chlich nicht.
Warum funktioniert es jetzt nicht. Kann mal einer von der Technik kommen.&quot;
</p>

<p> <b>Doof:</b>&quot;Das System scheint also, nun ja, leider, nun ja, immer
noch nicht ausgereift zu sein, nicht wahr.&quot; </p>

<p> <b>Dick:</b>&quot;Eine wahre Mogelpackung f&uuml;r (zugegebenerma&szlig;en) schlappe
2000 DM, die wir Ihnen, liebe Zuschauer, trotzdem keinesfalls ans Herz
legen wollen.&quot; </p>

<p> <b>Doof:</b>&quot;Hmjaa, also neben Multitasking hat MS DOS 4711 jetzt auch
Netzwerkf&auml;higkeit. Das hat etwas mit Fischerei zu tun, nicht war,
Wolfgang?&quot; </p> <p> <b>Dick:</b>&quot;Richtig, Wolfgang! Netzwerke sind
sozusagen die Grundlage f&uuml;r die deutsche Fisch-Industrie.&quot; </p>

<p> <b>Doof:</b>&quot;Aber was noch sehr interessant ist, ist &quot;Doublespace&quot;
Version 3.121. Das sehr gute Festplatten, &auml;hm, Kompressionsprogramm, ist
jetzt noch viel besser, nicht wahr?&quot; </p>

<p> <b>Dick:</b>&quot;Hmmja, sieh mal Wolfgang...&quot; </p>

<p> (Doof guckt scheinbar interessiert auf den Bildschirm, wo einige
komplizierte Parametereinstellungen und Tabellen erscheinen.) </p>

<p> <b>Dick:</b>&quot;...also hier ein Beispiel. Die Festplatte ist ungef&auml;hr
1000 MB gro&szlig;, und das ist nat&uuml;rlich zu wenig f&uuml;r ernsthafte Anwendungen wie
&quot;Windoof San Francisco&quot; oder &quot;Axl for Windoof&quot; oder den Bildschirmschoner.&quot;
</p>

<p> <b>Doof:</b>&quot;Und hier kommt dann &quot;Doublespace&quot; zum Einsatz und
verkleinert die Daten. Aber was, Wolfgang, nicht wahr, was ist daran
neu???&quot; </p>

<p> <b>Dick:</b>&quot;Ganz einfach Wolfgang, neuerdings kann Doublespace n&auml;mlich
Packraten von 100% erzielen und alle Programme auf den Nullpunkt
schrumpfen. Das bedeutet unendlich viel Platz auf der Festplatte!&quot; </p>

<p> <b>Doof:</b>&quot;Na, das ist ja sensationell. Und wie macht das Programm
das???&quot; </p>

<p> <b>Dick:</b>&quot;Naja, &auml;hm, es l&ouml;scht einfach alle Programme.&quot; </p>

<p> <b>Doof:</b>&quot;Genial. Ich sage nur: Technische Innovation aus dem Hause
Microsoft!&quot; </p>

<p> (Dick steht auf und wankt zu einem anderen Tisch wo einige Modems
aufgebaut sind. Die Kamera folgt ihm, die Einblendung DF&Uuml;-Ecke erscheint.)
</p>

<p> <b>Dick:</b>&quot;Also, &auml;hm, hier sind wir wieder in unserer DF&Uuml;-Ecke. Und
da kann ich wieder tolle Neuigkeiten vorstellen, sozusagen Weltpremiere
hier in der Sendung.&quot; </p>

<p> (Dick zeigt auf einen Apparat, der entfernte &Auml;hnlichkeit mit einem
Elektrogrill hat.) </p>

<p> <b>Dick:</b>&quot;Das hier ist das neueste vom Markt, das wirklich
allerneueste, nicht ganz billig, aber wirklich eine technische Innovation.
Aus dem Hause SEIXL, in Zusammenarbeit mit WURGER KING, nun sozusagen etwas
ganz besonderes. Das &quot;Mikrowellen-Modem&quot;.&quot; </p>

<p> (Dick &ouml;ffnet eine kleine Klappe an dem Apparat und legt eine Bockwurst
hinein.) </p>

<p> <b>Dick:</b>&quot;Mit dem Mikrowellenmodem kann man warme Speisen durch den
hei&szlig;en Draht &uuml;bermitteln. Man legt hier, &auml;hm, einfach das Essen rein, w&auml;hlt
mit dem Computer die Nummer des anderen Modems an, und dann kommt das Essen
erhitzt im anderen Mikrowellenmodem an.&quot; </p>

<p> (Doof hat am anderen Ende des Studios Platz genommen, wo ebenfalls ein
PC mit Mikrowellenmodem aufgebaut ist.)


<p> <b>Dick:</b>&quot;Also, wir &auml;hm werden das jetzt mal versuchen. Ich habe die
kalte Bockwurst hier...&quot; </p>

<p> (Kamera filmt die Bockwurst im Modem in Nahaufnahme.) </p>

<p> <b>Dick:</b>&quot;...ins Mikrowellenmodem gelegt. Bist Du bereit, Wolfgang?&quot;
</p>

<p> <b>Doof:</b>&quot;Klar Wolfgang, schick r&uuml;ber!&quot; </p>

<p> (Dick tippt komplizierte Zahlenfolgen auf der Tastatur ein. Ein roter
Blitz schie&szlig;t aus dem Mikrowellenmodem.) </p>

<p> <b>Dick:</b>&quot;Soooo, das W&uuml;rstchen wird jetzt mit einer Transferrate von
14.400 Fettmolek&uuml;len in Wolfgang&acute; Modem &uuml;bertragen.&quot; </p>

<p> <b>Doof:</b>&quot;Ja, ich riech&acute; es schon, k&ouml;stlich, mjam mjam. Da l&auml;uft
einem ja das Wasser im Munde zusammen, nicht wahr...&quot; </p>

<p> <b>Dick:</b>&quot;So---- jetzt m&uuml;&szlig;te es langsam... angekommen sein!&quot; </p>

<p> <b>Doof:</b>&quot;Neiin, ich glaube das braucht noch *etwas* Zeit.&quot; </p>

<p> (Dick und Doof sitzen 10 Minuten lang da, werden zusehends nerv&ouml;ser.)
</p>

<p> <b>Dick:</b>&quot;Es klappt nicht.&quot; </p>

<p> <b>Doof:</b>&quot;Kann mal einer von der Technik kommen?&quot; </p>

<p> <b>Dick:</b>&quot;Ich habe mich gleich gefragt, wie die Wurst durch die
Telefonleitung passen soll...&quot; </p>

<p> <b>Doof:</b>&quot;Wir machen jedenfalls weiter mit einem interessanten
Film-Beitrag von der CeBIT.&quot; </p>

<p> (Das Bild wird ausgeblendet, Messegew&uuml;hl erscheint. Lautsprecher
dr&ouml;hnen. Doof steht, eng an die Kamera gedr&uuml;ckt, und umklammert krampfhaft
sein Mikrofon.) </p>

<p> Doof (schreiend):&quot;Wir sind hier mitten im CeBit-Messegew&uuml;hl, es riecht
nach frischen Elektroteilen und dem Schwei&szlig; von tausenden
enthusiasiatischer PC-Anwender aus der ganzen Welt. Fernab vom Messerummel,
in einer ruhigen Ecke, hat sich die Firma, &auml;hm, &quot;Popeldore&quot; oder wie sie
hei&szlig;t, ach ja, &quot;Commodore&quot;, breitgemacht. Und die gehen wir jetzt besuchen.
</p></font>

<p><font size=+1 color=brown> (In einer ruhigeren, nahezu totenstillen Ecke
der Commodore-Stand, gro&szlig; und chaotisch. Ein paar zerdr&uuml;ckte
Nesquik-Trinkp&auml;ckchen und Amiga 4000-Werbebl&auml;tter machen sich auf dem Boden
breit. Kleine Kinder spielen an den aufgebauten CD32-Ger&auml;ten herum; raffen
aber nicht, da&szlig; es nur eine unspielbare Demoversion zu sehen gibt. Etwas
gr&ouml;&szlig;ere Kinder stehen hinter verschiedenen Commodore-Computern und
Schreibmaschinen, adrett in ihre Konfirmationsanz&uuml;ge gekleidet, und sehen
sich hilfesuchend nach Kunden um. Irgendwo verlassen in der Ecke steht ein
angestaubter A 4000Tower. Auf den Stufen zur Pr&auml;sentations-Theke haben sich
zwei Lamer mit Baseball-K&auml;ppi breitgemacht und mampfen Pizza aus dem
Pappkarton. Hinter der Theke, genauer gesagt zwischen Theke und Wand
gequetscht, steht Dr. Peter Kittel, mit einem fr&ouml;hlichen L&auml;cheln auf den
Lippen.) </p></font>

<p><font size=+1 color=black> <b>Doof:</b>&quot;Das hier ist Herr Quittel...&quot;
</p>

<p> Dr.K:&quot;Kittel!&quot; </p>

<p> Doof&quot;...genau, Herr Tittel aus dem Hause Commodore!&quot; </p>

<p> Dr.K:&quot;Hi Freaks! Ich habe hier tolles SeaQuest-Infomaterial, wenn ihr
wollt. Und Gummib&auml;rchen!&quot; </p>

<p> <b>Doof:</b>&quot;Wir kamen eigentlich eher wegen der technischen
Neuvorstellungen.&quot; </p>

<p> Dr.K:&quot;Wegen WAS???&quot; </p>

<p> <b>Doof:</b>&quot;Technische Neuvorstellungen.&quot; </p>

<p> Dr.K:&quot;Aha.. Soso.. Naja. Da h&auml;tten wir erstmal das EMPECK-Modul f&uuml;r das
CD32!&quot; </p>

<p> <b>Doof:</b>&quot;CD32, da&szlig; ist doch ihr sehr erfolgreicher
Amiga Spielcomputer mit CD-Laufwerk, nicht wahr?&quot;</p>

<p> Dr.K:&quot;Ja, irgendwie sowas ist das.&quot; </p>

<p> <b>Doof:</b>&quot;Und was macht dieses EMPECK Modul?&quot; </p>

<p> Dr.K:&quot;Man kann es hier, hinten, in das CD32-Ger&auml;t einf&uuml;hren und sich
dann tolle Videofilme von CD ansehen! Hier l&auml;uft zum Beispiel gerade &acute;Die
Heinzelm&auml;nnchen im Wunderland&acute;, ein wirklich ganz toller Film f&uuml;r die
j&uuml;ngere Kundenschicht...&quot; </p>

<p> <b>Doof:</b>&quot;Und was ist mit dem Amiga 4000 Tower?&quot; </p>

<p> Dr.K:&quot;Ach der, der steht da dr&uuml;ben.&quot; </p>

<p> <b>Doof:</b>&quot;F&uuml;hren sie mich hin?&quot; </p>

<p> Dr.K:&quot;N&ouml;&ouml;, ich will mich nicht bewegen, immer links halten, den finden
sie schon.&quot; </p>

<p> <b>Doof:</b>&quot;Danke f&uuml;r das Gespr&auml;ch, Herr Mittel.&quot; </p>

<p> <b>Dr.M:</b>&quot;Kittel. DOKTOR Kittel.&quot; </p>

<p> <b>Doof:</b>&quot;Gut Professor Little. Danke.&quot; </p>

<p> (Doof geht r&uuml;ber zum Amiga 4000 Tower.) </p>

<p> <b>Doof:</b>&quot;DAS HIER ist das Zugpferd von Commodore. Der Amiga 4000 im
Towergeh&auml;use. Der am weitesten entwickelte Spiele-Computer, der derzeit auf
dem Markt ist.&quot; </p>

<p> (Doof wird von einer Horde aufgebrachter Amiga-Fans, die etwas wie
&quot;L&uuml;gner&quot; und &quot;Verr&auml;ter&quot; rufen, mit H&auml;mmern und &Auml;xten totgekn&uuml;ppelt. Danach:
R&uuml;ck-Blende ins WDR-Studio.) </p>

<p> <b>Dick:</b>&quot;Toller Auftritt, Wolfgang, die mochten Dich da richtig.&quot;
</p>

<p> <b>Doof:</b>&quot;Klar sicher, die freuen sich immer, wenn einer vom
WDR-Computerclub vorbeischaut.&quot; </p>

<p> <b>Dick:</b>&quot;Und was macht unser Mikrowellenmodem?&quot; </p>

<p> <b>Doof:</b>&quot;Klappt nicht.&quot; </p>

<p> <b>Dick:</b>&quot;Na egal. Dann machen wir Schlu&szlig; f&uuml;r heute!&quot; </p>

<p> <b>Doof:</b>&quot;Aber sicher. Also, liebe Zuschauer, in drei Wochen, wenn
sie wollen und k&ouml;nnen, schalten Sie doch wieder ein! Wir bieten ihnen dann
ein tolles Interview mit A. Mc Intosh von Apple Macintosh, einen Bericht
&uuml;ber CD ROMs und die Vorstellung des Amiga 5000.&quot; </p>

<p>
(Ausblende, Dick &amp;Doof verlassen plaudernd das Podium, w&auml;hrend die
Kamera zur&uuml;ckf&auml;hrt und der Schriftzug &quot;Hergestellt vom WDR, - 1994
erscheint.) </p> </font>

<p>
<HR><BR><center><MAP NAME="bar1.map">
<AREA SHAPE="RECT" COORDS="1,20,134,73" HREF="../index.htm">
<AREA SHAPE="RECT" COORDS="297,17,438,75" HREF="../../frframe.htm">
<AREA SHAPE="RECT" COORDS="147,25,207,46" HREF="http://www.hopa.de">
</MAP>
<img src="onl_comcom3.gif" border=0 usemap="#bar1.map">
</center>
<hr size=4>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; unbekannt. Seite im Netz gefunden unter:<br><center>
 <a href="http://www.hopa.de/frechen/count/story/comcom.htm">
http://www.hopa.de/frechen/count/story/comcom.htm </a></center><br>
von &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf">
http://www.chiemgau.com/apc&amp;tcp/members/wolf </a></font>
<br>
</td></tr></table>
<br>
</BODY>
</HTML>
