<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<html>
<head>
<!-- "Erstellt von Textman f&uuml;r die NoCover" -->
<title>Netzgef&uuml;ster</title>
</head>

<body text="#ffffff" background="onl_netz01.gif" bgcolor="#000000"
 link="#ff0000" alink="#ff0000" vlink="#ff0000">
<a name="top"><br>

<font size="-1">
Um den Frame wegzuschalten, bitte hier <a href="onl_netz.html" target="_top">
<b> klicken </a></b>, oder auch nicht, dann bleibt er halt erhalten.<br>
Wenn notwendig - <a href="NoCover.html" target="_top"> <b> Zur&uuml;ck zur NoCover
</a></b></font><br><br>

<center>
<br>
<img align="center" src="onl_netz03.gif" width="350" height="70" alt="Titel">
<br><br>

<a href="#a1">
<img src="onl_netz04.gif" width="200" height="60" border="0"></a>
<br><br>

<a href="#a2">
<img src="onl_netz07.gif" width="200" height="55" border="0"></a>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
<a href="#a3">
<img src="onl_netz05.gif" width="200" height="50" border="0"></a>
<br><br>

<a href="#a5">
<img src="onl_netz08.gif" width="200" height="60" border="0"></a>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
<a href="#a4">
<img src="onl_netz06.gif" width="200" height="50" border="0"></a>
<br><br><br>
<img src="onl_netz09.gif" width="402" height="5" border="0">
</center>

<a name="a1"><center>
<h1>Vorwort</h1></center>

<font size="+1">  

<p>Hallo und Willkommen zur zweiten Ausgabe des Netzgefl&uuml;sters ! </p>

<p>Wenn man die letzte Zeit so betrachtet scheint sich ja mal wieder was im
Bereich Amiga zu bewegen. Vor allen Dingen das Vorhaben einen neuen Amiga
heraus zu bringen scheint anzulaufen. Nagut, ich will und m&ouml;chte das
nicht bewerten, wann und ob da etwas kommt. Aber etwas zu tun ist besser
als gar nix zu tun! </p>


<p> Sicherlich wird sich der eine oder andere gefragt haben, warum das
Netzgefl&uuml;ster nicht in der Ausgabe 71 der NC mit dabei war. </p>

<p>Ganz einfach!
<br>

Die Zeit zwischen der Ausgabe 70 und 71 war f&uuml;r mich einfach zu kurz.
Da ja aber Andreas bekanntlich durch sein Krankenhausaufenthalt dies so
kurz ansetzen musste.</p>

<p>Eine R&auml;tselfrage! </p>

<p>Wer hat voriges Jahr 181 Millionen Dollar Umsatz gemacht? </p>

<p>Das wi&szlig;t Ihr nicht?
<br>

Ganz einfache Antwort: Macintosh
<br>

Da k&ouml;nnte man echt neidig werden. Tja, wann ist es endlich mal bei
Amiga so weit? </p>

<p>
<p>Sei es wie es sei, viel Spa&szlig; mit der zweiten Ausgabe w&uuml;nscht euch Textman ! </p>
</font>
<a href="#top">Zur&uuml;ck</a><br>
<center>
<img src="onl_netz09.gif" width="402" height="5"></center>
<br><br>

<a name="a2"><center>
<h1>Bereich Computer</h1></center>
<br>
<h2>Amiga</h2>

<font size="+1">
<p>Eine gute Seite f&uuml;r alle die auf der Suche nach Hintergr&uuml;nden
oder Gif Animationen f&uuml;r die eigene Web Seite sind. Gute Beschreibung
des jeweiligen Links runden diese Seite ab. Zu finden unter </p>

<p align=center>http://www.dino-online.de/seiten/go15dwlhgb.htm </p>

<p>Diese Woche bin ich wieder auf eine neue Internetseite gekommen die, so
meine ich, sehr gut ist. Gut f&uuml;r Leute die bestimmte Themen aus
Wirtschaft, Politik und Sport suchen. Auch der Bereich Computer kommt nicht
zu kurz. So gibt es auf dieser Seite Links zu PC, Amiga und Linux.
Au&szlig;erdem kann man sich &uuml;ber den Fahrplan der Deutschen Bahn
informieren. Unter </p>

<p align=center>http://web.de </p>

<p>k&ouml;nnt Ihr die beschrieben Seite finden.</p>

<p>Ihr sucht Links zu eurer Freundin? <br>

Unter dieser Adresse werdet ihr bestimmt f&uuml;ndig. </p>

<p align=center>http://www.uni-karlsruhe.de/~uaie/amiga.html </p>
</font>

<h2>Midis</h2>

<font size="+1">
<p>K&ouml;nnt Ihr euch noch an die Midi Seite erinnern die ich euch in der
ersten Ausgabe vorgestellt hab.<p> Jetzt habe ich eine ebenb&uuml;rtige
wenn nicht sogar bessere Midi Seite gefunden. Diese Seite hat sehr viele
Midis, die aus den 60ziger bis 90ziger Jahre stammen. Also, man k&ouml;nnte
schon fast sagen: " Wer hier sein passenden Midi File nicht findet ist
selber Schuld ". </p>

<p align=center>http://all-midi.net/60s-90s/dir/ </p>

<p>Unter </p>

<p align=center>http://www. Drbart.purespace.de/links.htm </p>

<p>sind viele gute Links zu finden die euch bestimmt auch interessieren. So
zum Beispiel &uuml;ber Reisen, Musik, Coverbilder Witze, Comic und noch
einiges andere mehr. </p>

</font>
<a href="#top">Zur&uuml;ck</a><br>
<center>
<img src="onl_netz09.gif" width="402" height="5"></center>
<br><br>


<a name="a3"><center>
<h1>Bereich Neu endeckt</h1></center>
<br><br>

<font size="+1">
<p>Sicherlich kennt ihr gescannte Bilder.
Aber sicher kennt ihr nicht diese Bilder die ebenfalls gescannt sind.
Au&szlig;erdem, sehen viele Bilder verdammt gut aus.
<br>
<p align=center>http://www.homestead.com/ananya/Galleryindex.html</p>

<p>Unter dieser Adresse erwartet euch viele Bilder.
Eine Mischung aus Fantasie, Horror, Landschaften und vieles andere mehr.
Einfach mal rein schauen !<p>
<center>
<img src="onl_netz11.gif" width="200" height="200" border="0" alt="">
</center>

</font>
<a href="#top">Zur&uuml;ck</a><br>

<center>
<img src="onl_netz09.gif" width="402" height="5"></center>
<br><br>

<a name="a5"><center>
<h1>Bereich Spassiges</h1></center>

<font size="+1">
<p>Und wieder gibt es was aus der Ruprik Spassiges.
<br>
Hier werden euch einige Sachen geboten wie: Witze,Cartoons, Zitate
und viele unterschiedliche Links zu diesem spa&szlig;igen Bereich.
Also, immer mal reinschauen wer f&uuml;r ein Spa&szlig; bereit ist ! 
<br>

Und hier die Web Adresse: </p>


<p align=center>http://home.munich.netsurf.de/Helmut.Sasse/ </font></p>


</font>
<a href="#top">Zur&uuml;ck</a><br>

<center>
<img src="onl_netz09.gif" width="402" height="5"></center>
<br><br>

<a name="a4"><center>
<h1>Bereich Seiten Preview</h1></center>
<br><br>

<font size="+1">
<p align=center>Sorry, leider noch leer ! </p>

<center>
<img src="onl_netz09.gif" width="402" height="5"></center>

<p>Leider f&auml;llt der Seiten Preview noch einmal aus.
Daf&uuml;r habe ich aber f&uuml;r Euch aus dem Netz dieses Interview
mit Petro Tyschtschenko gefunden. </p>

<p>7.3.2000 13:30<br>
per email Interview mit Petro Tyschtschenko (Amiga-Deutschland-Chef) 
</font></p>

<p><font size="+1" color=yellow>amiga.topcool.de:</font><br>
<font size="+1">Vor zwei Monaten haben Sie uns verraten, 12.000
AmigaOS 3.5-Pakete verkaufen zu k&ouml;nnen. Damals fehlten 13.000
St&uuml;ck um in die Gewinnzone zu gelangen. Wie sieht es derzeit aus? Ist
OS 3.5 mittlerweile profitabel? Wieviele OS3.5-CDs konnten Sie bis heute an
den User bringen? </font></p>

<p><font size="+1" color=yellow>Petro:</font><br>
<font size="+1">Leider ist der Verkauf von OS 3.5 seit Januar 2000 stark
r&uuml;ckl&auml;ufig. Ich hatte das schon so erwartet. Wir sind jetzt
insgesamt bei rund 12.800 St&uuml;ck angelangt. Pro Monat sind es jetzt im
Durchschnitt rund 400 bis 600 St&uuml;ck. Aber es war ja von mir nie anders
geplant worden. Es sollte ein Zeichen von AMIGA f&uuml;r die treue Gemeinde
gesetzt werden und das neue Produkt, das Jim Collas plante etwas
&uuml;berbr&uuml;cken. </font></p>

<p><font size="+1" color=yellow>amiga.topcool.de:</font><br>
<font size="+1">Bis zum 1.3.2000 soll ihr Team in Braunschweig komplett
sein. K&ouml;nnen Sie schon Namen nennen? Gibt es jetzt schon ein Datum,
wann die neue Internetseite von Amiga ins Netz gehen wird? </font></p>

<p><font size="+1" color=yellow>Petro:</font><br>
<font size="+1">Das stimmt und den Plan habe ich erf&uuml;llt. Am 14.2.2000
hat in Braunschweig Herr Markus Grohmann als stellvertretender
Logistikmanager angefangen. Am 1.3 2000 habe ich eine neue Sekret&auml;rin,
Barbara Nietzsche, eingestellt. Also Sie sehen es tut sich was bei AMIGA
International, Inc. Die Emailadressen werden kurzfristig eingerichtet und
die Bilder der beiden neuen Mitarbeiter werden auch noch diese Woche
ver&ouml;ffentlicht. </font></p>

<p><font size="+1" color=yellow>amiga.topcool.de:</font><br>
<font size="+1">Was denken Sie - wieviele Amiga-User gibt es derzeit
weltweit, bzw. in Deutschland? </font></p>

<p><font size="+1" color=yellow>Petro:</font><br>
<font size="+1">Also in Deutschland gibt es rund 20.000 aktive AMIGA User.
Leider schrumpft die Zahl t&auml;glich. Weltweit gibt es rund 80 bis 100
Tausend. Wir k&ouml;nnen nur mit neuen Produkten und Innovation den AMIGA
Markt halten bzw zur&uuml;ckgewinnen. </font></p>

<p><font size="+1" color=yellow>amiga.topcool.de:</font><br>
<font size="+1">Apple hat gezeigt, wie man Marktanteile zur&uuml;ckgewinnt.
Ein freches Design und intensives Marketing waren dabei wichtiger als
technische Aktuallit&auml;t. Wird Amiga einen &auml;hnlichen Weg gehen?
</font></p>

<p><font size="+1" color=yellow>Petro:</font><br>
<font size="+1">Wie Sie wissen, hat AMIGA seit 1.1.2000 einen neuen
Besitzer: BillMcEwen und Fleecy Moss. Die verstehen ja Gott sei Dank
einiges von AMIGA. Um in unseren Markt bestehen zu k&ouml;nnen ist es
notwendig f&uuml;r die Entwicklung viel Geld zu investieren. Die Investoren
im Hintergrund, so ist meine Information, sind durchaus bereit Geld in
AMIGAs Zukunft zu investieren. Es dauert halt wieder, f&uuml;r mich als
ungeduldigen Menschen, viel zu lange, aber entscheidend ist halt
&uuml;berhaupt die Investition und dann nat&uuml;rlich mit der richtigen
Marketingstrategie ... Das Design und die Technischen Features werden die
Zukunft gewinnen. Bill McEwen arbeitet schwer daran und will nat&uuml;rlich
erst mit den Fakten rausr&uuml;cken, wenn alles in trockenen T&uuml;chern
ist, um nicht wieder unrealistische Motive zu wecken. </font></p>

<p><font size="+1" color=yellow>amiga.topcool.de:</font><br>
<font size="+1">Wie geht es Ihrem Privatleben? Haben Sie viel
Stress oder auch noch Zeit f&uuml;r Ihre Familie? </font></p>

<p><font size="+1" color=yellow>Petro:</font><br>
<font size="+1">Leider mu&szlig; meine Familie immer zur&uuml;ckstecken. Am
Wochenende sind ja meistens die Usertreffen auf denen ich nach
M&ouml;glichkeit teilnehme. Jetzt habe ich seit 19. Februar Besuch aus
Indien, mein Hauptdistributor aus Delhi ist in Langen, und da muss ich mich
nat&uuml;rlich k&uuml;mmern. Dann habe ich verschiedene Verkaufsprojekte am
Laufen und bin viel unterwegs. Mir macht es allerdings immer noch einen
riesen Spa&szlig; und das ist mein Hauptmotive f&uuml;r AMIGA da zu sein.
Glauben Sie mir, mir f&auml;llt es nicht immer leicht diese ganze
H&ouml;hen und Tiefen zu verkraften: Commodore, ESCOM, Viscorp, Gateway,
AMINO - seit 1992 gab es zwei Konkurse und immer noch keine neuen Produkte.
Da wird man m&uuml;de. Trotzdem gebe ich immer noch nicht auf. Lang lebe
unser geliebter Amiga. Danke an alle meine Freunde in unserer Amiga
Szene. </font></p>

<p><font size="+1" color=yellow>amiga.topcool.de:</font><br>
<font size="+1">Ich danke f&uuml;r das Gespr&auml;ch. Das Interview
f&uuml;hrte Daniel Orth per email. </font></p>

<center>
<img src="onl_netz09.gif" width="402" height="5">
<br><br>
<p> LETZTE MELDUNG +++LETZTE MELDUNG +++</p>
<p> Das Amiga Printmagazin " AMIGA FORMAT " wurde eingestellt.</p>



<a href="#top">Zur&uuml;ck</a><br>

<center>
<img src="onl_netz09.gif" width="402" height="5">
<br><br>

<img src="franklogo.gif" width="280" height="80">
</center>
<br>
<a href="NoCover.html" target="_top"> Zur&uuml;ck zur NoCover </a><br><br>
</body>
</html>





 



 

