<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Lars Philipsen">
   <meta name="GENERATOR" content="Mozilla/4.6 [de]C-CCK-MCD QXW0321u  (Win98; I) [Netscape]">
   <meta name="Description" content="Quelle: bild der wissenschaft">
   <title>Astro-Corner 12 (Ausgabe Februar 2000)</title>
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#0000EE" vlink="#551A8B" alink="#FF0000" background="rock012.jpg">

<center><img SRC="ac_titel.jpg" ALT="Astro-Corner 12" BORDER=2 height=59 width=402><font size=+1>12</font></center>
<font size=+1></font>
<p><b><font size=+1>H</font></b>allo NoCover-Leser!
<p><b><font size=+1>W</font></b>illkommen zu der nunmehr 12. Ausgabe meiner
<b>Astro-Corner</b>! Seit der letzten Ausgabe gibt es wieder allerhand
Neues zu berichten. Diesmal verzichte ich wieder einmal auf ein Inhaltsverzeichnis,
welches aber wohl ohnehin nicht so wichtig sein sollte. Ich denke mal,
dass ihr sowieso <i>alle</i> Neuigkeiten interessant findet und durchlest...
;-)
<p><b><font size=+1>N</font></b>un, dann m&ouml;chte ich euch nicht noch
l&auml;nger auf die Folter spannen. Los geht's:
<p>
<hr WIDTH="100%">
<p><i>Astrophysik:</i>
<br><b>Gr&ouml;&szlig;te Lightshow auf dem Jupitermond "Io"</b>
<p>(Meldung vom 10.1.2000)
<p>Auf dem Jupitermond Io gibt es jede "Nacht" fantastische Farbenspiele.
Denn sobald der Mond in den Schatten des Jupiter eintritt, wird der Himmelsk&ouml;rper
von gr&uuml;nen, roten und blauen Lichtern umgeben. An den Polen leuchtet
die Aurora des Mondes Rot, anderswo Gr&uuml;n und quer &uuml;ber den &Auml;quator
des Mondes glimmen S&auml;ulen blauen Lichts auf, die aussehen wie riesige
Leuchtstoffr&ouml;hren - ein Ende auf der Oberfl&auml;che, das andere im
schwarzen Weltraum. Hier eine <a href="http://www.newscientist.com/ns/20000108/lightfanta1graphic.html">Grafik</a>.
Warum das so ist, versuchen Wissenschaftler mithilfe der NASA-Sonde Galileo
zu erforschen. Seit 1995 sendet die Sonde Bilder des Jupitermondes zur
Erde.
<p>F&uuml;r das Farbenspiel auf Io wirken zwei au&szlig;ergew&ouml;hnliche
Effekte zusammen. Der Mond ist erstens der vulkanisch aktivste Himmelsk&ouml;rper
in unserem Sonnensystem und bildet zweitens zusammen mit Jupiter ein starkes
Magnetfeld. Diese beiden Faktoren zusammen f&uuml;hren zu einem Naturschauspiel,
dass den irdischen Polarlichtern &auml;hnlich ist - nur viel gr&ouml;&szlig;er.
Auf der Erde erzeugt der Sonnenwind - geladene Partikel, die als Plasma
von der Sonne ausgesandt werden - die Polarlichter. Die Partikel werden
an den Polen der Erde vom magnetischen Feld angezogen und treffen auf die
Teilchen in der Erdatmosph&auml;re. Wenn sie mit Stickstoff- oder Sauerstoffmolek&uuml;len
kollidieren, entsteht Licht. Auf Io kann nicht der Sonnenwind f&uuml;r
das Farbenspiel verantwortlich sein, weil das starke Magnetfeld des Jupiter
den Mond vor dem Sonnenwind abschirmt.
<p>Astronomen glauben, dass Io sich seinen eigenen "Sonnenwind" erzeugt.
Der entsteht dadurch, dass der Mond auf seiner Umlaufbahn um den Jupiter
dessen Magnetfeld durchfliegt. Das erstreckt sich n&auml;mlich etwa 14
Millionen Kilometer in den Weltraum hinein. "Diese Bewegung erzeugt eine
Spannungsdifferenz," sagt Lou Frank, Plasmaphysiker an der Universit&auml;t
von Iowa, "eine halbe Million Volt, vielleicht ein bisschen mehr. Diese
Spannung muss irgendwo raus." Da die Oberfl&auml;che des Mondes ein schlechter
Leiter ist, entl&auml;dt sich die Spannung am besten &uuml;ber das gebogene
magnetische Feld zwischen Jupiter und Io. Ein Elektronenstrom von Hunderttausend
bis eine Million Ampere baut sich auf und schie&szlig;t von der negativ
geladenen Seite von Io auf Jupiter zu. Genauso flie&szlig;t ein Gegenstrom
vom Jupiter auf die positiv geladene Seite Ios. Diese zweispurige elektrische
Schnellstra&szlig;e hat nun denselben Effekt wie der Sonnenwind auf der
Erde. Die Elektronen sto&szlig;en mit Molek&uuml;len der Atmosph&auml;re
von Io zusammen und so entsteht Licht. Denn die Energie der Zusammenst&ouml;&szlig;e
erleuchtet das Gas wie eine riesige fluoreszierende Lampe.
<p>Die Farbe dieser "Lampe" zeigt Astronomen auch, aus was die Atmosph&auml;re
des Jupitermondes besteht. Denn jedes Element sendet eine spezifische Wellenl&auml;nge
und damit eine spezielle Farbe aus, wenn es angeregt ist. "Das Gr&uuml;n
spricht f&uuml;r Natrium," meint Paul Geissler von Mond- und Planetenlaboratorium
an der Universit&auml;t von Arizona. "Das rote Licht stammt vermutlich
von Sauerstoff und das kr&auml;ftige blaue Licht kommt vom Schwefeldioxid."
Lange glaubten die Astronomen, dass Io gar nicht viel Atmosph&auml;re habe.
Doch Galileos Partikeldetektoren zeigten etwas anderes. Heute meinen die
Wissenschaftler, dass die Elektronen und Ionen aus Ios Vulkanen eine riesige
Plasmawolke um den Mond haben entstehen lassen. Das magnetische Feld formt
aus diesem Plasma einen Torus - eine geometrische Form, die aussieht wie
ein Doughnut. Wenn Io den Jupiter umkreist, fliegt er durch diese Wolke.
Der rote Sauerstoffschein an den Polen zeigt laut Geissler die Anregung
des Sauerstoffs durch die Elektronen im Torus. Das Licht verr&auml;t au&szlig;erdem
viel &uuml;ber die Dynamik in Ios Atmosph&auml;re. Das gr&uuml;ne Natriumgl&uuml;hen
kommt nur &uuml;ber einer Seite des Mondes vor. Daraus schlie&szlig;en
Astronomen, dass die Bewegung des magnetischen Feldes des Jupiter relativ
zu Io die Natriumatome weg von der Mondatmosph&auml;re tragen und so das
gr&uuml;ne Licht erzeugen.
<p>"Die Atmosph&auml;re des Io ist &uuml;berraschend. Sie ist fleckig und
sehr variabel," sagt Geissler. Auch der Druck variiert stark. Nahe den
Vulkanen kann er bis zu tausend Mal gr&ouml;&szlig;er sein als an anderen
Stellen. Diese Aussage konnte Geissler nach einigen Versuchen im Laboratorium
auf der Erde aus einem Computermodell ziehen. Er bestimmte aus der Farbe
und Intensit&auml;t des Lichts die Konzentration bestimmter Gase an bestimmten
Stellen. Aus den Karten von Geissler wird klar, dass die blauen Lichter
mit den aktivsten Vulkanen und deren Schwefeldioxidaussto&szlig; zusammenh&auml;ngen.
Denn die Vulkanaktivit&auml;t auf Io h&auml;ngt eng mit dem Lichtspiel
zusammen.
<p>Denn genauso variabel wie die Atmosph&auml;re ist auch das Farbenspiel
in der "Nacht". Wenn der Mond in den Schatten Jupiters eintritt, leuchten
die Lichteffekte in allen Farben stark auf. Innerhalb von 40 Minuten gehen
dann aber die roten und gr&uuml;nen Lichter auf ein Drittel der vorherigen
Leuchtkraft zur&uuml;ck. In derselben Zeit werden die blauen Lichter um
denselben Betrag st&auml;rker. Den Grund daf&uuml;r kennt Geissler nicht,
hat aber eine Vermutung: "Es kann daran liegen, dass die Ionosph&auml;re
Ios abnimmt." W&auml;hrend des Tageslichts leiten geladene Teilchen den
Gro&szlig;teil des Stroms zwischen Io und Jupiter. Ohne Sonnenlicht k&uuml;hlt
sich die Atmosph&auml;re des Mondes rasch ab. Geissler vermutet, dass dann
auch die Konzentration von Elektronen und Ionen in der Ionosph&auml;re
abnimmt. Das k&ouml;nne daran liegen, dass diese Teilchen rekombinieren
oder auf anderen Partikeln kondensieren. Weil die Ionosph&auml;re dann
weniger gut leitet, m&uuml;sse sich der elektrische Strom einen anderen
Weg suchen. Und das scheinen die vulkanischen Emissionen zu sein. Denn
w&auml;hrend der Rest der Ionosph&auml;re ausk&uuml;hlt, schicken die Vulkane
weiterhin Gase inklusive geladener Teilchen in die Atmosph&auml;re. Entlang
dieser flie&szlig;t dann der Strom.
<p>Der Vulkanismus auf Io wird von zwei anderen gro&szlig;en Monden des
Jupiter getrieben. Die Schwerkraft von Ganymed und Europa knetet Io wie
einen Teigklumpen durch. Das f&uuml;hrt dazu, dass sich die feste H&uuml;lle
Ios regelm&auml;&szlig;ig um 100 Meter hebt und senkt. Durch diese Verschiebungen
ist das Innere des Mondes hei&szlig; und unter riesigem Druck. Wo immer
eine kleine Spalte im Mantel entsteht, schie&szlig;t sofort Lava empor
und mit ihr Staub- und Schwefeldioxidfont&auml;nen. Und das bis in eine
H&ouml;he von 400 Kilometern. Der st&auml;rkste Vulkan auf Io, Loki, ist
der st&auml;rkste im Sonnensystem bekannte und produziert mehr Hitze als
alle irdischen Vulkane zusammengenommen. Diese Eruptionen k&ouml;nnen so
gro&szlig; wie Arizona sein. Trotzdem ist der gr&ouml;&szlig;te Teil der
Oberfl&auml;che gefroren. Das Schwefeldioxid, das aus dem Inneren entweicht,
kondensiert und bedeckt als blassblauer Schnee den Mond. Zusammen mit den
Lichteffekten am Himmel sei dieser Anblick von der Mondoberfl&auml;che
aus sicher noch beeindruckender als auf den Bildern Galileos, meint Geissler.
<p><font size=-1>[Quelle: Cornelia Pretzer und New Scientist]</font>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Das Eis auf Charon schmeckt anders als das auf dem Pluto</b>
<p>(Meldung vom 12.1.2000)
<p>Die Oberfl&auml;che des Plutomondes Charon ist mit einer Eisschicht
aus Wasser und Ammoniak &uuml;berzogen. Ganz im Gegensatz zu Pluto, den
Methan-, Kohlenmonoxid- und Stickstoffeis bedecken. Das hat die meisten
Astronomen &uuml;berrascht, denn sie vermuteten, dass Pluto und Charon
ein "Doppelplanetenpaar" bilden. In einem Report in der neuesten Ausgabe
von Science ver&ouml;ffentlichten Michael Brown vom California Institute
of Technology und Wendy Calvin, Spektroskopieexpertin an der Universit&auml;t
von Nevada, ihre Ergebnisse einer spektroskopischen Analyse des Mondes.
<p>Im vergangenen Mai hatte eine seltene Nacht voller atmosph&auml;rischer
Besonderheiten Brown einen besonders klaren Blick mit dem Keck-Teleskop
auf Hawaii auf die beiden Himmelsk&ouml;rper erlaubt.
<p>Zusammen mit Calvin hatte er sich vorgenommen, die Au&szlig;enh&uuml;lle
Charons zu untersuchen. Die beiden analysierten die Bestandteile aufgrund
des ausgestrahlten Lichts, denn jedes Element st&ouml;&szlig;t eine bestimmte
Farbe Lichts aus, wenn es angeregt ist. Das Ergebnis der Untersuchung:
Die Oberfl&auml;che des Charon besteht aus kristallinem Wassereis. Das
kommt auf vielen Monden im &auml;u&szlig;eren Sonnensystem vor. Aber merkw&uuml;rdigerweise
fanden die Forscher einen weiteren Stoff, den sie als Ammoniak identifizierten.
Das &uuml;berrascht, denn die Astronomen haben Ammoniak bisher nur in Kometen
gefunden.
<p>Die Theorie der beiden Wissenschaftler dazu: Charon soll aus einem Zusammensto&szlig;
Plutos mit einem gro&szlig;en Objekt stammen. Der Schutt, der losgeschlagen
wurde, soll den Mond gebildet haben. Vulkane, aus der Hitze des Aufpralls
gespeist, k&ouml;nnten die Oberfl&auml;che mit einer schlammigen Ammoniak-Wasser-Mischung
&uuml;berzogen haben. Nachdem die Hitze aufgebraucht war, k&ouml;nnte Charon
gefroren sein. Pluto, f&uuml;nfmal so gro&szlig; wie Charon, behielt Methan,
Kohlenmonoxid und Stickstoff in seiner d&uuml;nnen Atmosph&auml;re und
als Eisschichten auf der Oberfl&auml;che, vermutet Brown.. &Uuml;ber Charon
konnte sich wegen der geringeren Schwerkraft keine Atmosph&auml;re halten,
weil der gr&ouml;&szlig;ere Pluto die Gase wegzog.
<p>Die Ergebnisse von Brown und Calvin sind allerdings umstritten. Eliot
Young vom Southwestern Research Institute Department of Space Studies meint,
dass die Vertiefung im Spektrum des Charon auch eine andere Stoffkombination
sein k&ouml;nne. Aber trotzdem ist Young sehr interessiert an der Zusammensetzung
von Charon. "Wenn es darum geht, woraus unser fr&uuml;hes Sonnensystem
bestand, sind Pluto und Charon besonders aufschlussreich," sagt er.
<p>Die beiden Himmelsk&ouml;rper umrunden sich in 6,4 Tagen mit einer Entfernung
von nur 20000 Kilometern. Die Erde ist vom Mond 20 mal weiter entfernt.
Diese enge Umschlingung macht es schwer, Charon zu untersuchen und hat
sogar dazu gef&uuml;hrt, dass er bis 1978 ganz &uuml;bersehen wurde. Das
Bild des Pluto und des am weitesten entfernten bekannten Mondes des Sonnensystems
verschwimmt sogar in ganz starken Teleskopen.
<br>&nbsp;
<p><font size=-1>[Quelle: Cornelia Pretzer und Academic Press]</font>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Ozean unter der Eisschicht "Europas"</b>
<p>(Meldung vom 13.1.2000)
<p>Die NASA-Raumsonde Galileo hat am 3. Januar Hinweise auf einen Ozean
unter der eisigen Kruste des Jupitermondes Europa gefunden. Als sie 351
Kilometer &uuml;ber dem Mond schwebte, fanden die magnetischen Messger&auml;te
St&ouml;rungen in dem Magnetfeld, das Europa umgibt. Diese Ergebnisse lassen
unter der Eiskruste auf eine leitende Schicht vermuten – zum Beispiel einen
salzigen, fl&uuml;ssigen Ozean.
<p>"Ich glaube diese Daten sagen uns, dass es unter der Oberfl&auml;che
tats&auml;chlich fl&uuml;ssiges Wasser auf Europa gibt," sagt Margaret
Kivelson, Hauptverantwortliche f&uuml;r die Magnetometer-Messungen. Die
Wissenschaftlerin der University of California, Los Angeles, die sich selbst
als von Natur vorsichtigen Menschen bezeichnet, meint, dass die neuen Hinweise
die Existenz eines Meeres sehr &uuml;berzeugend machten. Dieses Meer k&ouml;nnte
in den &auml;u&szlig;eren 100 Kilometern des Europamantels liegen. Kivelson
sch&auml;tzt die Dicke der vermuteten Wasserschicht etwa genauso gro&szlig;,
also etwa 100 Kilometer.
<p>Wie stie&szlig;en die Forscher auf die Hinweise? Kivelson erkl&auml;rt:
"Das Magnetfeld des Jupiter wechselt auf Europa alle f&uuml;nfeinhalb Stunden
die Richtung." Dieses sich &auml;ndernde Feld kann in einem Leiter – wie
einem Ozean – elektrische Str&ouml;me antreiben. Der Strom w&uuml;rde dann
ein magnetisches Feld erzeugen, das dem der Erde stark &auml;hnele. Doch
der magnetische Nordpol, der Punkt auf den die Kompassnadel auf Europa
zeigen w&uuml;rde, wandert auf dem Mond nahe des &Auml;quators herum. Au&szlig;erdem
wechselt er seine Richtung alle f&uuml;nfeinhalb Stunden.
<p>Auf fr&uuml;heren Fl&uuml;gen hat Galileo einen magnetischen Nordpol
gefunden, hatte aber nicht untersucht, ob der die Position wechselt. "Wir
haben uns gefragt, ob es m&ouml;glich w&auml;re, dass der Pol nicht wandert,"
sagt Kivelson. Deshalb planten die Forscher eine Extratour der Raumsonde,
um diese Frage zu kl&auml;ren. Galileo hatte nach der Tour eine klare Antwort
an Bord: Der Nordpol wandert. So lieferte die Sonde einen Schl&uuml;sselbeweis
f&uuml;r einen Ozean. Warum der Strom nicht durch festes Eis flie&szlig;en
kann, erkl&auml;rt Kivelson so: "Eis leitet nicht so gut wie Wasser. Doch
fl&uuml;ssiges Wasser mit gel&ouml;sten Salzen, so wie Meerwasser auf der
Erde, leitet ziemlich gut." Kivelson meint zudem, dass kein anderes leitendes
Material in Frage k&auml;me.
<p>Die neuen Erkenntnisse decken sich mit der Theorie zur Bildung Europas.
Die Oberfl&auml;che des Mondes scheint sich geformt zu haben, als das Oberfl&auml;cheneis
auf dem darunterliegenden Meer zerbrach und sich neu ordnete. Doch weitere
theoretische Arbeit ist n&ouml;tig, um die fl&uuml;ssige Schicht und ihre
Eigenschaften zu analysieren. "Interessant ist, ob dasselbe Ph&auml;nomen
auch auf dem Jupitermond Ganymed auftritt," meint Kivelson. Galileo soll
an Ganymed dieses Jahr zweimal vorbeifliegen und Erkenntnisse sammeln.
<br>&nbsp;
<p><font size=-1>[Quelle: Cornelia Pretzer und NASA]</font>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Asteroiden mit Kollisionskurs auf die Erde</b>
<p>(Meldung vom 14.1.2000)
<p>Dass die Erde von einem Asteroiden gerammt wird, ist nur halb so wahrscheinlich
wie bisher angenommen. Das haben David Rabinowitz, Astronom an der Yale
University, und Kollegen in der neuesten Ausgabe von Nature mitgeteilt.
Eine Neuberechnung der Zahl gro&szlig;er Asteroiden, die eine weltweite
Verheerung verursachen k&ouml;nnten, gibt nur noch h&ouml;chstens tausend
der Geschosse an.
<p>Jupiters Schwerkraft rei&szlig;t regelm&auml;&szlig;ig Asteroiden aus
ihrer Bahn in der Hauptumlaufbahn hinter Mars. Einige davon werden in Richtung
Erde geschleudert. Wissenschaftler glauben, dass einer dieser Irrl&auml;ufer
– erdnahe Asteroiden oder near Earth Asteroids (NEA) – mit der Erde vor
65 Millionen Jahren zusammenstiess und so das globale Klima derart &auml;nderte,
dass hunderte von Spezies ausstarben.
<p>Zu den Opfern geh&ouml;rten wahrscheinlich auch die Dinosaurier. Eine
solche Katastrophe h&auml;lt Rabinowitz nicht f&uuml;r eine "pure Idee
aus Science fiction Romanen". Trotzdem liegen die Chancen, dass ein weiterer
solcher Asteroid auf die Erde kracht in den kommenden tausend Jahren etwa
bei einem Prozent. Ein solcher Brocken m&uuml;sste einen Durchmesser von
&uuml;ber einem Kilometer haben, um weltweit Konsequenzen nach sich zu
ziehen.
<p>Rabinowitz hat eine neue automatisierte Methode entwickelt, um digitale
Bilder des Ein-Meter-Teleskops auf dem Haleakala Krater auf Hawaii auf
NEAs, die einen Durchmesser gr&ouml;&szlig;er als einen Kilometer haben,
zu sammeln. Bisher haben sie 45 gefunden. Mit dem Teleskop schwer zu sehen,
kam der erste NEA 1989 in Sicht. "Unsere Hoffnung ist es, keinen zu finden,
der Kurs auf die Erde nimmt," gibt Rabinowitz zu. Denn wenn ein gro&szlig;er
Asteroid auf die Erde zufliegt, gibt es keine M&ouml;glichkeit mehr, ihn
abzulenken. Bisher gibt es allerdings keinen Hinweis auf eine fatale Kollision.
Das Team hat au&szlig;erdem ein Computermodell erarbeitet, das die Zahl
der beobachteten NEAs extrapoliert, also aus den Gefundenen die Summe aller
NEAs berechnet. Das Team vermutet etwa 500 bis 1000 bislang nicht gesehene
NEAs im Sonnensystem. Alle vorherigen Sch&auml;tzungen kamen auf eine Zahl
zwischen 1000 und 2000.
<p>Astronom David Jewitt vom Institut f&uuml;r Astronomie auf Hawaii meint,
dass Rabinowitz gute Arbeit beim Z&auml;hlen der gro&szlig;en Asteroiden
geleistet hat. Er sorgt sich allerdings um die Hunderte und Tausende kleinerer
Gesteinsbrocken, die zwar kleiner als ein Kilometer sind aber gr&ouml;&szlig;er
als hundert Meter. Obwohl ein Gro&szlig;teil der Zivilisation &uuml;berleben
w&uuml;rde, k&ouml;nnten solche kleinen "Treffer" eine ganze Region vernichten.
"Dass so ein Brocken mit uns kollidiert ist hundert Mal wahrscheinlicher,"
sagt Jewitt. Diese drohenden Asteroiden zu finden, bedarf es eines Sechs-
bis Acht-Meter-Teleskops, dass etwa 100 Millionen Dollar kosten w&uuml;rde.
"Bisher sehe ich keine m&ouml;gliche Quelle f&uuml;r dieses Geld," bedauert
Jewitt.
<br>&nbsp;
<p><font size=-1>[Quelle: Cornelia Pretzer und Academic Press]</font>
<p>
<hr WIDTH="100%">
<p><i>Astrophysik:</i>
<br><b>FUSE macht Wasserstoff im Universum sichtbar</b>
<p>(Meldung vom 14.1.2000)
<p>Informationen des im Juni 1999 gestarteten NASA Far Ultraviolet Spectroscopic
Explorer Satelliten (FUSE) zeigen, dass molekularer Wasserstoff fast &uuml;berall
in der Milchstrasse vorkommt, meint Michael Shull, Professor f&uuml;r Astrophysik
und Planetenkunde an der University of Colorado in Boulder. Die Ergebnisse
der Arbeit pr&auml;sentierte Shull vom 11. Bis zum 15. Januar beim 195.
Treffen der American Astronomical Society in Atlanta.
<p>Wasserstoff ist das Element, das am meisten im Universum vorkommt und
au&szlig;erdem Hauptausgangsstoff f&uuml;r die Bildung von Sternen und
Planeten. Doch sobald es entsteht, bildet es schnell P&auml;rchen – es
wird zu molekularem Wasserstoff (H<sub>2</sub>), da es dann stabiler ist
als in Einzelatomen. Diesen Stoff hat FUSE sichtbar gemacht. Der Satellit
sucht das Lichtspektrum im All nach Ultraviolett (UV)-Strahlung ab, die
das Hubble Teleskop nicht "sehen" kann. "FUSE erm&ouml;glicht uns, Wasserstoff
mit einer tausendmal h&ouml;heren Empfindlichkeit zu beobachten als sein
Vorg&auml;nger Copernicus in den 70er Jahren," sagt Shull. Auch in den
gro&szlig;en und kleinen Magellanschen Wolken hat FUSE den Forschern geholfen,
Wasserstoff aufzusp&uuml;ren. Shull: "Damit wollten wir untersuchen, wie
die Bildung von Sternen in ganz anderen Umgebungen geschieht."
<p>Dunkle molekulare Wolken im All sind extrem kalt – etwa minus 150 Grad
Celsius, sagt Shull. Die interstellaren Wolken ziehen einzelne Wasserstoffatome
zusammen, die dann Wasserstoffmolek&uuml;le bilden. Diese kollabieren bald
unter Wirkung der eigenen Schwerkraft und beginnen Sterne zu bilden. "Die
Wolken sind die Kinderstuben der Sterne," erkl&auml;rt Shull. Sterne, die
sich in Klumpen an der dichtesten Stelle der interstellaren Wolken formieren,
seien zweifelsfrei von anderen sich neu bildenden Planeten umgeben, meint
er. Den Prozess verst&uuml;nden die Wissenschaftler aber noch nicht vollst&auml;ndig.
Am schnellsten bildeten sich jedoch die Sterne zweifelsfrei im dichten
Inneren der interstellaren Wolken. Junge, massive Sterne pusteten nach
ihrer Entstehung &uuml;briges Material mit starken Sternenwinden in den
Raum und br&auml;chten so neues Material zur Sternbildung ins All.
<p>Riesige explodierende Sterne wie Supernovae k&ouml;nnten einen Halo
aus stark erhitztem Wasserstoff gebildet haben, der die Milchstrasse umh&uuml;llt,
sagt Shull. Wie das hei&szlig;e Gas aber in den dunklen interstellaren
Wolken gesammelt werde und so den Lebenszirkel des Universums vervollst&auml;ndigte,
bleibe bisher ein Geheimnis. "FUSE hat den Astronomen Instrumente an die
Hand gegeben, um den Lebenszyklus der Sterne zu beobachten," sagt Shull.
Das er&ouml;ffne wiederum neue Perspektiven, denn " die Sternenbildung
in der Milchstrasse und naher Galaxien zu verstehen, ist der Schl&uuml;ssel
zum Verst&auml;ndnis von Sternenbildung vor 10 der 12 Milliarden Jahren."
Das k&ouml;nnte auch Licht in die Entstehung unserer eigenen Galaxie werfen.
<p>FUSE sp&uuml;rt Gase auf und untersucht ihre Zusammensetzung, Entfernung
und Geschwindigkeit, indem er Licht von weit entfernten, hellen Zielen
wie Quasaren auff&auml;ngt. Die Gaswolken dazwischen absorbieren Licht
und hinterlassen so "optische Fingerabdr&uuml;cke". Die verraten die Zusammensetzung
der Gase. Vier FUSE Teleskope sammeln UV-Licht und leiten es in einen 9
Millionen Dollar teuren Spektrographen, der an der University of Colorado
entwickelt wurde. Der teilt das Licht auf – etwa so wie ein Prisma sichtbares
Licht in seine verschiedenen Farben teilt. Diese Farben lassen dann R&uuml;ckschl&uuml;sse
auf die chemische Zusammensetzung der Herkunftssterne und Wolken zu. FUSE
kann Licht von 10 Milliarden Lichtjahren entfernten Quellen untersuchen
und bietet so gute M&ouml;glichkeiten, um Sterne, Galaxien, Quasare und
Gas und Staub im interstellaren Raum zu beobachten. Vorg&auml;nger Copernicus
konnte nur tausend Lichtjahre weit "gucken". (Ein Lichtjahr entspricht
etwa vier Billionen Kilometern.
<br>&nbsp;
<p><font size=-1>[Quelle: Cornelia Pretzer und Eurekalert]</font>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Weltraumm&uuml;ll- eine Gefahr f&uuml;r Satelliten</b>
<p>(Meldung vom 17.1.2000)
<p>Einige zehntausend Millionen menschgemachte Objekte umkreisen die Erde
– ohne die Satelliten einzurechnen. Nicholas Johnson, Raumm&uuml;llexperte
der NASA meint, dass die Teile "einem angreifenden Bieneschwarm gleichen".
<p>Unter den Objekten sind 9000 gro&szlig; genug, um von Radarger&auml;ten
auf der Erde gesehen zu werden. Der gr&ouml;&szlig;te Teil des Raumm&uuml;lls
ist allerdings sehr viel kleiner – normalerweise nur so gro&szlig; wie
ein Stecknadelkopf. Er wird durch Sonden, deren Tr&auml;gerraketen, Kollisionen
oder Explosionen verursacht. Einen Teil macht verbrannter Treibstoff aus
und sogar Farbpartikel von den Raumfahrzeugen der Menschen sind dabei.
Doch warum sollte dieser M&uuml;ll uns etwas ausmachen? Jeff Theall von
der NASA sagt: "Erinnern Sie sich an den Galaxy 4 Satelliten, der vergangenes
Jahr ausfiel. Wenn Ihr Arzt das Pager System benutzte, das &uuml;ber diesen
Satelliten lief, konnten Sie ihn etwa 24 Stunden lang nicht erreichen."
<p>Hunderte von Satelliten umkreisen die Erde. Mit v&ouml;llig unterschiedlichem
Zweck: zum Beispiel f&uuml;r die Kommunikation, um Wetterinformation zu
liefern und Verschmutzung zu &Uuml;berwachen. Ein Zusammenstoss mit M&uuml;ll
kann solche Satelliten zerst&ouml;ren oder zumindest au&szlig;er Betrieb
setzen. Sogar etwas ganz Kleines wie ein Farbrest kann das Fenster eines
Satelliten besch&auml;digen – das kostet immerhin 50000 Dollar. Ein kieselsteingro&szlig;es
St&uuml;ck M&uuml;ll k&ouml;nnte einen Kommunikationssatelliten ganz au&szlig;er
Gefecht setzen – Kostenpunkt eine halbe Milliarde Dollar.
<p>Der Abfall im All ist so zerst&ouml;rerisch, weil er so schnell ist.
Ein kieselgro&szlig;es St&uuml;ck kann sich problemlos mit etwa 7,2 Kilometern
pro Sekunde bewegen. F&uuml;r einen Kommunikationssatelliten, der entgegen
kommt, w&uuml;rde das in einer Kollisionskraft von 15 Kilometern pro Sekunde
resultieren.
<p>Gl&uuml;cklicherweise sind wenige St&uuml;cke gr&ouml;&szlig;er als
ein Kiesel. Die meisten Satelliten, die nach vollbrachtem Dienst (durchschnittlich
acht Jahre) auf die Erde zur&uuml;ckkehren, zeigen nur kleine Schrammen
von ihren M&uuml;ll-Kollisionen. Die Chance, dass ein Satellit von etwas
getroffen wird, das gro&szlig; genug ist, ihn zu zerst&ouml;ren, liegt
aber nur bei etwa 10000 zu 1. Laut Theall ist die Gefahr durch Raumm&uuml;ll
f&uuml;r Satelliten zwar nicht zu vernachl&auml;ssigen aber durchaus zu
bew&auml;ltigen. Er und seine Kollegen denken trotzdem &uuml;ber Szenarien
nach, wie die Raumm&uuml;llsituation sich in der Zukunft entwickeln k&ouml;nnte.
Ein Problem dabei ist, dass der M&uuml;ll sich mit der Zeit nicht zersetzt
wie auf der Erde. Wenn er hoch genug fliegt, kann er Tausende von Jahren
im All bleiben. Deshalb k&ouml;nnte sich der M&uuml;ll zu einem gro&szlig;en
Problem entwickeln. Die raumfahrenden Nationen arbeiten deshalb schon heute
an Raumschiffen, die keinen M&uuml;ll hinterlassen.
<br>&nbsp;
<p><font size=-1>[Quelle: Cornelia Pretzer und Nandotimes]</font>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Wir sind doch allein - ist unser Sonnensystem einzigartig?</b>
<p>(Meldung vom 17.1.2000)
<p>M&ouml;glicherweise ist ein Sonnensystem wie unseres nicht an jeder
Ecke des Universums zu finden. Darauf deuten die Ergebnisse des Projekts
PLANET (Probing Lensing Anomalies Network) hin, die Scott Gaudi von der
Ohio State University jetzt auf der Tagung der American Astronomical Society
in Atlanta vorstellte. Seit zwei Jahren versucht ein internationales Team
von Wissenschaftlern, Hinweise auf Planeten bei sogenannten Linsen-Ereignissen
zu finden: Dabei schiebt sich ein dunkles, schweres Objekt, etwa ein leuchtschwacher
Stern, vor einen hellen Stern und vergr&ouml;&szlig;ert sein Bild auf der
Erde. Falls der dunkle Stern einen Planeten hat, der so gro&szlig; und
so weit entfernt wie Jupiter ist, sollte sich das durch einen zus&auml;tzlichen
hellen Punkt bemerkbar machen. Bislang gelang es den Forschern nicht, so
einen Effekt bei einem der 23 Linsen-Ereignisse von 1998 und 1999 zu entdecken.
Sie schlie&szlig;en daraus, dass h&ouml;chstens 30 Prozent der Sterne Jupiter-&auml;hnliche
Planeten in Jupiter-&auml;hnlichen Entfernungen besitzen, so wie unser
Sonnensystem. Aus anderen Untersuchungen l&auml;sst sich schlie&szlig;en,
dass viele Planeten ihre Sterne in sehr geringer Entfernung umkreisen -
wo nicht besonders lebensfreundliche Bedingungen herrschen. Die Forscher
wollen nun die Obergrenze f&uuml;r Planetensysteme, die unserem &auml;hnlich
sind, noch weiter nach unten dr&uuml;cken - es sei denn, sie finden demn&auml;chst
endlich ein Linsenereignis mit Planetenbeteiligung.
<p>Mehr zu extrasolaren Planeten findet ihr <a href="http://www.wissenschaft.de/bdw/ticker/tickerdisplay.hbs?datum=0&suchmich=Planet+extrasolar&rubriknr=99&suchdatum=alle&mach=prev&sprung=10">hier</a>.
<p><font size=-1>[Quelle: Ute Kehse und NASA]</font>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Hat der Mars das Leben auf der Erde ges&auml;t?</b>
<p>(Meldung vom 17.1.2000)
<p>Vor Milliarden von Jahren k&ouml;nnten Gesteine, die Mikroben enthalten,
vom Mars zur Erde gelangt sein und dort die Saat des Lebens gebildet haben.
Astronomen berechneten, wie h&auml;ufig Asteroiden auf den Mars treffen,
deren Einschlag stark genug ist, einen Gesteinsbrocken zur Erde zu katapultieren.
Auch der umgekehrte Weg ist durchaus denkbar. "Die Frage ist, sind wir
wirklich alle Marsmenschen?", sagt Mauri Valtonen vom Turku Observatorium
in Finnland, Mitglied eines internationalen Forscherteams, welches der
Frage nachgeht, ob urspr&uuml;ngliche Lebensformen zwischen Planeten ausgetauscht
worden sein k&ouml;nnen.
<p>In einer Studie, die bei der nationalen Sitzung der American Astronomical
Society vorgestellt wird, berichten Experten dar&uuml;ber, dass, wenn jemals
Leben auf dem Mars existiert habe, es auch zu uns gelangt sein k&ouml;nnte.
Obwohl nur einige St&uuml;cke des Marsgesteins auf der Erde gefunden wurden,
nimmt das Team an, dass Tonnen des Materials hier sind.
<p>Das Team berechnete Druck, Temperatur, Beschleunigung und Strahlung,
die das Gestein auf dem Weg vom Mars zur Erde &uuml;berstanden haben m&uuml;sste.
Mindestens zwei gut bekannte Mikroben, Deinococcus radiodorans und Bacillus
subtilis, w&auml;ren f&auml;hig, diese Reise zu &uuml;berleben, so Curt
Mileikowsky, Astronom des Royal Institute of Technology in Stockholm und
Leiter des Forschungsteams. Er sagt, die Mikroben seien im Labor getestet
worden und zeigten sich in hohem Ma&szlig;e best&auml;ndig gegen Hitze-,
Strahlungs- und Beschleunigungskr&auml;fte.
<p>Obgleich das Leben auf dem Mars heute unwahrscheinlich ist, sagen Astronomen,
dass der Planet fr&uuml;h in der Geschichte des Sonnensystems Wasser, eine
Atmosph&auml;re und milde Temperaturen hatte und damals durchaus Leben
auf dem Mars m&ouml;glich gewesen w&auml;re.
<p><font size=-1>[Quelle: Corinna Lippert und Discovery]</font>
<p>
<hr WIDTH="100%">
<p><i>Astrophysik:</i>
<br><b>Quellen von Hintergrund-R&ouml;ntgenstrahlung des Universums entdeckt</b>
<p>(Meldung vom 17.1.2000)
<p>Ein gro&szlig;er Teil der R&ouml;ntgenstrahlung, mit der das ganze Universum
zu leuchten scheint, wird durch weit entfernte Galaxien erzeugt. Das berichteten
Wissenschaftler um Richard Mushotzky vom Goddard Space Flight Center der
NASA auf der diesj&auml;hrigen Tagung der American Astronomical Society
in Atlanta. Mushotzky und seine Kollegen untersuchten ein kleines St&uuml;ck
des Himmels - einen Kreis, der ungef&auml;hr ein F&uuml;nftel der Gr&ouml;&szlig;e
des Vollmondes hatte - mit dem R&ouml;ntgenteleskop Chandra. Dank der hohen
Aufl&ouml;sung Chandras gelang es ihnen, die scheinbar gleichm&auml;&szlig;ige
Hintergrundstrahlung einzelnen Quellen zuzuordnen. &Uuml;ber den ganzen
Himmel verteilt, m&uuml;ssen demnach etwa 70 Millionen Objekte zu der Hintergrundstrahlung
beitragen, rechneten die Forscher hoch. Ein Drittel der Quellen sind Galaxien,
deren Kerne im R&ouml;ntgenlicht hell strahlen, die aber kein sichtbares
Licht aussenden. M&ouml;glicherweise gibt es im Universum zig Millionen
dieser verschleierten Galaxienkerne, in deren Zentrum sich wahrscheinlich
ein massives Schwarzes Loch befindet. In dieses Schwarze Loch st&uuml;rzt
st&auml;ndig fast bis auf Lichtgeschwindigkeit beschleunigtes Gas hinein,
ein Vorgang, bei dem die R&ouml;ntgenstrahlen ausgesandt werden. Ein weiteres
Drittel der R&ouml;ntgenquellen machen sogenannte ultraschwache Galaxien
aus. Diese Sternenhaufen senden wenig oder gar kein optisches Licht aus,
entweder, weil die Galaxis von Staub umgeben ist, der das Licht abblockt,
oder weil das sichtbare Licht auf der langen Reise durch das Weltall irgendwo
abgefangen wird. Nach Mushotzkys Berechnungen k&ouml;nnten die Galaxien
in diesem Fall 14 Milliarden Lichtjahre entfernt sein und damit zu den
&auml;ltesten Objekten des Universums geh&ouml;ren. Mehr zur R&ouml;ntgenastronomie
findet ihr <a href="http://www.wissenschaft.de/bdw/ticker/tickerdisplay.hbs?datum=0&suchmich=Chandra&rubriknr=99&suchdatum=alle&mach=prev&sprung=10">hier</a>.
<p><font size=-1>[Quelle: Ute Kehse und NASA]</font>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Der "Alte Gl&auml;ubige" - gr&ouml;&szlig;ter Angeber unter den
Schwarzen L&ouml;chern</b>
<p>(Meldung vom 18.1.2000)
<p>Der "Alte Gl&auml;ubige" (auf Englisch: Old Faithful) schockt alle.
Der 40000 Lichtjahre von der Erde entfernte sogenannte Mikroquasar (auch
Schwarzes Loch) bricht gerade alle 45 bis 90 Minuten mit starken Schockwellen
aus (<a href="http://www.news.cornell.edu/photos/GRS1915.300.GIF">Bild</a>).
Das ist schon das zweite Mal, dass sich der Mikroquasar, der erste bekannte
in der Milchstrasse und auf den Sternenkarten als GRS 1915+105 Gef&uuml;hrte,
merkw&uuml;rdig verh&auml;lt. Vor zwei Jahren haben Astronomen Hinweise
im R&ouml;ntgenspektrum und Infrarotbereich darauf gefunden, dass er in
fast regelm&auml;&szlig;igen Jets etwa jede halbe Stunde hei&szlig;es Gas
ausst&ouml;&szlig;t. "Das System kann aufgrund seines Verhaltens chaotisch
genannt werden," sagt Stephen Eikenberry, Astronom an der Cornell University.
Eikenberry stellte die neuesten Ergebnisse des "gr&ouml;&szlig;ten Prahlers
aller Schwarzen L&ouml;cher" auf dem 195. Treffen der American Astronomical
Society in Atlanta vor.
<p>Mit dem 500-Zentimeter-Teleskop des Palomar Observatoriums und dem Rossi
X-Ray Timing Explorer Satellite haben die Astronomen im Juli 1998 den Alten
Gl&auml;ubigen untersucht. Sie entdeckten dabei, dass das Schwarze Loch
Schockfronten aussto&szlig;e, sagt Eikenberry. Das Verhalten des Alten
Gl&auml;ubigen erlaube dabei R&uuml;ckschl&uuml;sse auf das Verhalten von
Schwarzen L&ouml;chern au&szlig;erhalb unserer Galaxie. Dort scheinen Eruptionen
alle paar Jahre aufzutreten. Zum Vergleich: Bei GRS 1915+105 im Sternbild
des Adlers kam das in der Vergangenheit auch schon mal alle zwanzig Sekunden
vor.
<p>Ein Schwarzes Loch ist ein massiver, kollabierter Stern, der so dicht
gepackt ist, dass seine Schwerkraft das Licht am Entkommen hindert. Wie
andere kollabierte Sterne – zum Beispiel Neutronensterne – werden Schwarze
L&ouml;cher oftmals in der Umlaufbahn eines nahen Stern gefunden. Diesem
saugen sie dann gasf&ouml;rmiges Material weg, welches sich dann in einem
spiralf&ouml;rmigen Band oder einer Scheibe um das Schwarze Loch ansammelt.
In manchen F&auml;llen schleudert das Schwarze Loch einen Teil dieses Materials
fast in Lichtgeschwindigkeit von sich.
<p>Old Faithful offenbarte sich den Astronomen 1992 als helle R&ouml;ntgenstrahlenquelle.
1994 haben Radiountersuchungen bei ihm sogenannte Jets gefunden, die mit
mehr als 90 Prozent der Lichtgeschwindigkeit flogen. Zwei Jahre sp&auml;ter
haben Infrarot- und R&ouml;ntgenuntersuchungen kleinere Jets nahezu alle
30 Minuten aufgesp&uuml;rt. Jetzt sto&szlig;e GRS 1915+105 Synchrotronstrahlung
aus einer sich ausbreitenden Plasmablase aus, sagt Eikenberry. Synchrotronstrahlung
wird durch schnelle, geladenen Partikel erzeugt. Die Blase h&auml;lt der
Astronom f&uuml;r hochenergetische Elektronen, die in einem magnetischen
Feld umherschwirren und vielleicht durch die Schockwellen erzeugt wurden.
Das magnetische Feld biegt die Bahnen der Elektronen und bringt sie so
dazu Energie auszustrahlen. Eikenberry verfolgt die Theorie, dass eine
oder mehrere solcher Plasmablasen eine Jet-Explosion ausmachen. Das Neue
daran sei eine andere Betrachtungsweise dessen, was Material in einem rotierenden
Schwarzen Loch zusto&szlig;e. "Irgendetwas passiert an der Schnittstelle
zwischen der innersten Gas-Scheibe und dem Schwarzen Loch - und das erzeugt
einen Jet," meint er. Das Schwarze Loch beeinflusse die Scheibe so, dass
ein Teil in Form eines Jets ausgespuckt werde und ein anderer Teil in das
Schwarze Loch falle. Diese These wird durch fr&uuml;here Beobachtungen
eines Zerrei&szlig;ens der Scheibe kurz vor einem Jet gest&uuml;tzt. Die
neuen Ergebnisse haben dem noch die Plasmablase hinzugef&uuml;gt. "Da wir
immer dachten, das ein Schwarzes Loch die Jet-Aktivit&auml;t antreibt sind
die Plasmablasen eine echte &Uuml;berraschung," gibt Eikenberry zu. Daf&uuml;r
gebe es allerdings einige m&ouml;gliche Erkl&auml;rungen: Eine ist laut
Eikenberry eine Materialwelle, eine Schockfront, die sich durch die Scheibe
bewegt. Eine andere ist das kontinuierliche Aussto&szlig;en von Material
durch das Schwarze Loch. Das beobachtete Aufleuchten k&ouml;nnte dann eine
Schockfront sein, die mit einem Jet kollidiert. Doch die neuentdeckten
Jets aus Synchrotronstrahlung unterschieden sich sehr von den vorher beobachteten,
sagt Eikenberry. Daher m&uuml;sse es unterschiedliche Wege geben, wie Jets
oder Plasmablasen in Mikroquasaren entstehen.
<p><font size=-1>[Quelle: Cornelia Pretzer und Eurekalert]</font>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Zwei einsame Schwarze L&ouml;cher</b>
<p>(Meldung vom 18.1.2000)
<p>In unserer Galaxie wandern isolierte Schwarze L&ouml;cher zwischen den
Sternen herum. Das NASA Teleskop Hubble und die Bodenteleskope in Australien
und Chile haben erstmals Bilder von Zweien ihrer Art geliefert. "Dieses
Ergebnis k&ouml;nnte hei&szlig;en, dass Schwarze L&ouml;cher h&auml;ufiger
vorkommen und viele massive aber normale Sterne ihr Leben als solche beenden
und nicht als Neutronensterne, wie bisher vermutet," sagt David Bennett
von der University of Notre Dame in South Bend, IN. Bennett hat die Ergebnisse
seines Teams auf dem 195. Treffen der American Astronomical Society in
Atlanta vorgestellt.
<p>Alle bisher bekannten Schwarzen L&ouml;cher wurden in den Umlaufbahnen
normaler Sterne gefunden. Verraten haben sich die neuentdeckten, massereichen
Himmelsk&ouml;rper durch ihren Effekt auf den Stern, den sie umflogen.
Astronomen erkannten sie daran, dass sie das Licht eines dahinterliegenden
Sterns durch ihre extreme Schwerkraft beugten. Die Schwerkraft wirkt in
diesem Fall wie eine starke Linse und erzeugt so in den Teleskopen zwei
Bilder ein und desselben Sterns. Wenn sich das Schwarze Loch vor den Stern
schiebt, erscheinen zwei identische Bilder. Der Beugungswinkel ist dabei
immer noch 100 mal kleiner als die Winkelaufl&ouml;sung von Hubble, so
dass selbst das hochaufl&ouml;sende Teleskop nur ein Bild sieht. Doch zum
Gl&uuml;ck vergr&ouml;&szlig;ert die Schwerkraft des Schwarzen Lochs die
Sterne auch noch. Dadurch werden sie heller, wenn das Schwarze Loch vorbeizieht.
Bennetts Team suchte nach genau diesen Passagen – auch schwerkraftbedingte
Mikrolinsen-Ereignisse genannt.
<p>Eine genaue Analyse der zwei Ereignisse 1996 und 1998 zeigte auch, dass
die zwei beugenden Objekte - Schwarzen L&ouml;cher - etwa sechs Mal so
schwer sind wie die Sonne. Wenn die Objekte normale Sterne mit dem selben
Gewicht w&auml;ren, w&uuml;rden sie viel heller scheinen als der hinter
ihnen liegenden Stern, den die Forscher untersuchten. Die Massen sind auch
zu gro&szlig; als dass die Himmelsk&ouml;rper Wei&szlig;e Zwerge oder Neutronensterne
sein k&ouml;nnten. Dadurch wird ein Schwarzes Loch zur n&auml;chstliegenden
Erkl&auml;rung.
<p>Isolierte Schwarze L&ouml;cher k&ouml;nnten auch neue Erkenntnisse &uuml;ber
deren Entstehung liefern. Bisher glaubten Astronomen, dass Schwarze L&ouml;cher
nur aus Doppelsternsystemen entstehen k&ouml;nnten. Jetzt wird die von
Theoretikern lange favorisierte Idee interessant, die besagt, dass vielleicht
der Kollaps eines isolierten massiven Stern ausreiche und keine Interaktion
mit einem anderen Stern gegeben sein m&uuml;sse. Diese Theorie k&ouml;nnte
auch bei der Suche nach der sogenannten "Dunklen Materie" helfen.
<p><font size=-1>[Quelle: Cornelia Pretzer und NASA]</font>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Paradox - erste Fotos von Schwarzen L&ouml;chern</b>
<p>(Meldung vom 19.1.2000)
<p>Fotos von Schwarzen L&ouml;chern – ein Paradoxon? Denn die massereichen
Himmelsk&ouml;rper saugen mit ihrer Schwerkraft sogar das Licht ein. So
haben sie sich bisher den Kameras und Teleskopen erfolgreich entzogen.
Doch jetzt haben Astrophysiker des Max-Planck-Instituts f&uuml;r Radioastronomie
in Bonn, der John-Hopkins-Universit&auml;t in Baltimore und der University
of Arizona in Tucson ein “Computerfoto” eines Schwarzen Lochs im Zentrum
der Milchstrasse geschossen. Die Ergebnisse sind in den Astrophysical Research
Letters in der ersten Ausgabe des neuen Jahres zu lesen. <a href="http://www.mpg.de/pri00/sld1.html">Hier</a>
gibt es eine Diashow der Ergebnisse.
<p>In dem Artikel beschreiben die Astrophysiker, wie sie mit sogenannter
Radiointerferometrie mit langen Basisl&auml;ngen (engl.: Very Long Baseline
Interferometry oder VLBI) die Wege von Photonen (Lichtteilchen), die um
Haarsbreite der Anziehungskraft eines Schwarzen Lochs entgangen sind, verfolgen
wollen. Nach Einsteins Relativit&auml;tstheorie sollte das Schwarze Loch
einen kreisf&ouml;rmigen Schatten erzeugen – sagen Computermodelle. Dieser
Schatten w&auml;re eine Aufnahme des Ereignishorizonts eines Schwarzen
Lochs. Der Ereignishorizont ist die Grenze, ab der selbst Licht der Gravitation
nicht mehr entkommen kann. Dieser wirkt dabei sehr viel gr&ouml;&szlig;er
als er ist, denn das Schwarze Loch wirkt wie Linse. Auf dem Bild ist ein
dunkler Schatten zu sehen, der f&uuml;nf Mal so gro&szlig; wie erwartet
ist. Und damit sogar gro&szlig; genug, dass ihn Radioteleskope auf der
Erde sehen k&ouml;nnten.
<p>Nur ein Problem bleibt: Die Radiostrahlung k&ouml;nnte vom Gas, welches
das Schwarze Loch umgibt absorbiert werden. Noch k&uuml;rzere Wellenl&auml;ngen
l&auml;sst das Gasplasma aber durch und w&uuml;rde so den Astronomen erlauben,
den Schatten zu beobachten. “Dann k&ouml;nnten wir ihn von der Erde aus
nicht mehr sehen, aber von Satelliten aus sollte es m&ouml;glich sein,”
erkl&auml;rt Eric Agol, von der John-Hopkins-Universit&auml;t. Die Teleskope
auf der Erde k&ouml;nnen nicht mit so kurzen Wellenl&auml;ngen arbeiten,
weil die Erdatmosph&auml;re diese Strahlung schluckt.
<p>Schwarze L&ouml;cher haben Astronomen bisher indirekt aufgesp&uuml;rt.
Zum Beispiel durch ihren Einfluss auf die Bahnen naher Sterne oder durch
das Strahlen von Gas, das gerade in das Schwarze Loch eingesogen wurde.
In anderen Galaxien haben die Wissenschaftler diese Effekte schon l&auml;nger
beobachtet. Im Zentrum unserer Galaxie gibt es allerdings so viel interstellaren
Staub, dass die Teleskope nichts sehen. L&auml;ngere Wellenl&auml;ngen
im Infrarot- oder Radiobereich kommen aber ungest&ouml;rt auf der Erde
an.
<p>Der Stern, den die Wissenschaftler untersuchen ist Sagittarius A*, ein
Punkt im Herzen unserer Milchstrasse. “Dort haben Radioastronomen eine
ultra-kompakte Radioquelle gefunden – wahrscheinlich isoliertes Gas in
direkter N&auml;he eines Schwarzen Lochs,” sagt Falcke. Laut Falcke zeigen
Infrarotbeobachtungen in der selben Gegend Sterne, die von einer enormen
Masse in der N&auml;he von Sagittarius A* herumgewirbelt werden. Das sei
zur Zeit der beste Hinweis auf ein Schwarzes Loch, aber noch kein endg&uuml;ltiger
Beweis.
<p>Die Technik, mit der die Forscher Sagittarius A* beobachtet haben, ist
die so genannte VLBI-Technik, die durch das Zusammenschalten mehrerer Teleskope
Bilder mit mehr Details und h&ouml;herer Aufl&ouml;sung als einzelne Teleskope
erzeugt. Um ein Schwarzes Loch zu beobachten, sind allerdings noch bessere
Aufl&ouml;sung von N&ouml;ten. Am Max-Planck-Institut arbeiten die Wissenschaftler
deshalb an der so genannten Millimeter-VLBI-Technik. Mit k&uuml;rzeren
Wellenl&auml;ngen erreichen sie eine h&ouml;here Aufl&ouml;sung. “Ich glaube,
wir haben noch gar nicht realisiert, wie nahe wir mit dieser Technik schon
am Schatten des Schwarzen Lochs sind,” sagt Heino Falcke vom Max-Planck-Institut
f&uuml;r Radioastronomie. Zum Vergleich: Von Los Angeles aus k&ouml;nnen
die Teleskope eine Radioquelle von der Gr&ouml;&szlig;e eines Senfkorns
in Bonn finden. Falcke: “Jetzt wollen wir noch einen Schritt weiter gehen
und ein Loch in diesem Senfkorn finden.” Das dieses Ziel durchaus erreichbar
sei, meint auch Anton Zensus, Leiter der VLBI-Gruppe.
<p>Die heute m&ouml;gliche Aufl&ouml;sung bei kurzen Radiowellen l&auml;sst
Berechnungen zu, die einen kreisf&ouml;rmigen Schatten als charakteristische
Struktur der Strahlung von Sagittarius A* erkennen lassen. “Mit Millimeter-VLBI
sollte es uns bald gelingen, den echten Schatten eines Schwarzen Lochs
zu sehen,” meint Falcke. Das sei dann der endg&uuml;ltige Beweis, daf&uuml;r,
dass Schwarze L&ouml;cher und ihre Ereignishorizonte existieren. Das einzige
Problem sieht er in der begrenzten Beobachtungszeit an den Radioteleskopen,
so dass ein derartiges Experiment teuer und arbeitsaufwendig werden w&uuml;rde.
<p>Die Daten &uuml;ber Sagittarius A* haben die Wissenschaftler in ein
Computerprogramm namens “Ray-Tracing-Program” gef&uuml;ttert. Dabei gehen
vor allem die Masse und die Rotation des Schwarzen Lochs ein. Das Programm
verfolgt dann die Bahnen einzelner Photonen. Fulvio Melia, Astrophysiker
an der University of Arizona erkl&auml;rt das so: “Das Programm berechnet
den Effekt, den das Schwarze Loch auf die Bahn und die Wellenl&auml;nge
der Photonen hat. Diese Effekte sind durch Einsteins Relativit&auml;tstheorie
bereits sehr pr&auml;zise vorhergesagt worden.” Und schon in den siebziger
Jahren hatte ein Physiker namens James Bardeen sehr genaue Berechnungen
dazu gemacht – die waren als theoretische Spielerei abgetan worden.
<br>&nbsp;
<p><font size=-1>[Quelle: Cornelia Pretzer und Max-Planck-Gesellschaft]</font>
<p>
<hr WIDTH="100%">
<p><i>Sonnensystem:</i>
<br><b>Rosetta-Nebel t&auml;uscht Gr&ouml;&szlig;e vor</b>
<p>(Meldung vom 19.1.2000)
<p>Der ber&uuml;hmte Rosetta-Nebel, eine hell leuchtende Gaswolke in der
Milchstra&szlig;e, ist deutlich kleiner als bisher gedacht. Das wiesen
Greg Topasna und Kollegen von der amerikanischen Universit&auml;t Virginia
Tech mit einer neuen Spezialkamera nach. Die Kamera nimmt nur eine bestimmte
Wellenl&auml;nge des Lichts auf, die von angeregten Wasserstoffatomen abgestrahlt
wird - das sogenannte H-alpha-Licht. Die Forscher stellten fest, dass eine
Staubschale rund um den Nebel dieses H-alpha-Licht streut und so den Eindruck
erzeugt, der Nebel sei gr&ouml;&szlig;er. &Auml;hnliches passiert in der
Atmosph&auml;re der Erde: Der Himmel ist nur deswegen tags&uuml;ber hell,
weil das Sonnenlicht von den Molek&uuml;len in der Luft gestreut wird und
so aus allen Richtungen zu kommen scheint. Topasna und seine Kollegen konnten
diesen Effekt beim Rosetta-Nebel nachweisen, weil das gestreute H-alpha-Licht
polarisiert ist - genau wie das gestreute Himmelslicht. Topasna vermutet,
dass auch andere Nebel durch gestreutes Licht gr&ouml;&szlig;er erscheinen.
Der Rosetta-Nebel liegt etwa 5000 Lichtjahre von der Erde entfernt im Sternbild
Monceros. Mit seiner symmetrischen Form &auml;hnelt der Nebel einer Rose.
Ein Haufen hei&szlig;er Sterne innerhalb des Nebels erhitzt Gas auf einige
tausend Grad. Das Gas - zum &uuml;berwiegenden Teil Wasserstoff - strahlt
daraufhin Licht ab.
<p>Mehr zu Gaswolken im Universum findet ihr <a href="http://www.wissenschaft.de/bdw/ticker/tickerdisplay.hbs?datum=0&suchmich=Gaswolken&rubriknr=99&suchdatum=alle&mach=prev&sprung=10">hier</a>.
<p><font size=-1>[Quelle: Ute Kehse und Virginia Tech]</font>
<p>
<hr WIDTH="100%">
<p><i>Kosmologie:</i>
<br><b>Eisbrocken fallen von Spaniens Himmel</b>
<p>(Meldung vom 21.1.2000)
<p>Spaniens Meteorologen und Geologen sind gleicherma&szlig;en ratlos.
Seit mehr als 10 Tagen st&uuml;rzen dort Eisbl&ouml;cke vom Himmel, die
so gro&szlig; sind, dass sie unm&ouml;glich durch die bekannten Wetterph&auml;nomene
entstanden sein k&ouml;nnen. Derzeit sind mindestens f&uuml;nfzehn dieser
zum Teil &uuml;ber dreieinhalb Kilogramm schweren "Hagelk&ouml;rner" gefunden
worden und man kann von Gl&uuml;ck sprechen, dass sie bisher niemanden
verletzt haben.
<p>Der Geologe und Meteoritenexperte Jesus Martinez Frias vom Museo Nacional
de Ciencias Naturales steht wie seine Kollegen des Meteorologischen Dienstes
vor einem R&auml;tsel. Hagelk&ouml;rner, wie sie sich beispielsweise im
Auf und Ab der m&auml;chtigen vertikalen Luftzirkulationen eines Gewitters
bilden k&ouml;nnen, erreichen in der Regel h&ouml;chstens den Umfang eines
Tennisballes. Was da derzeit aber behutsam verpackt in den K&uuml;hlschr&auml;nken
der spanischen Wissenschaftler lagert, erreicht leicht die Gr&ouml;&szlig;e
eines Basketballs.
<p>Mit gro&szlig;er Spannung werden nun die Ergebnisse chemischer Untersuchungen
erwartet. Bis dahin bleibt Raum f&uuml;r Spekulationen. So ist es in der
Vergangenheit wiederholt vorgekommen, dass sich Eisbrocken von Passagierflugzeugen
l&ouml;sen - allerdings fallen diese meist durch die blaue Farbe der Desinfektionsmittel
auf. Vielleicht gibt die chemische Zusammensetzung auch Hinweise auf eine
m&ouml;gliche extraterrestrische Herkunft der Eisklumpen. Frias gibt dabei
allerdings zu bedenken, dass sowohl die regionale Verteilung der Fragmente
als auch die zeitliche Abfolge gegen den Einschlag eines Eiskometen sprechen.
Dar&uuml;ber hinaus h&auml;tten Eisbrocken dieser Gr&ouml;&szlig;enordnung
auf den Radarschirmen erscheinen m&uuml;ssen. Bis Ende der Woche hoffen
die Forscher nun, Licht in das Dunkel dieser mysteri&ouml;sen Ereignisse
zu bringen.
<p><font size=-1>[Quelle: Joachim Sch&uuml;ring und Associated Press]</font>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Schwarzes Loch vor unserer Haust&uuml;r?</b>
<p>(Meldung vom 25.1.2000)
<p>Schwarze L&ouml;cher sind f&uuml;r unsere Augen unsichtbar und dementsprechend
also nicht f&uuml;r jedermann leicht zu finden. Da klingt es schon abenteuerlich,
dass ausgerechnet ein australischer Amateurastronom m&ouml;glicherweise
das unserem Planeten n&auml;chste Schwarze Loch entdeckt hat, und als er
dem diensthabenden Astronomen am Massachusetts Institute of Technology
(MIT) Donald Smith seine Beobachtung eines ungew&ouml;hnlichen Erstrahlens
im Sternbild des Sch&uuml;tzen mitteilte, setzte dieser Stern Nr. V4641
erst mal nur auf seine Beobachtungsliste f&uuml;r jene Nacht.
<p>Donald Smith sagt heute, dass es ihn damals, am 14. September 1999,
"fast aus den Schuhen gehoben hat". Die R&ouml;ntgenbilder des Rossi X-ray
Timing Explorer Satelliten zeigten &uuml;ber einen Zeitraum von zwei Stunden
vier mal ein heftiges Auflodern, dass an Helligkeit zeitweise nur noch
von der Sonne &uuml;bertroffen wurde. Gleichzeitige Beobachtungen mit dem
Very Large Array Radioteleskop in Neumexiko best&auml;tigten das Ph&auml;nomen
starker Helligkeitsschwankungen, die f&uuml;r Rudy Wijnands vom MIT f&uuml;r
Schwarze L&ouml;cher so charakteristisch sind.
<p>Noch sind die Daten nicht eindeutig, zumal die Masse des Objektes, das
nur 1600 Lichtjahre von uns entfernt am sommerlichen Nachthimmel steht,
bisher noch nicht bestimmt werden konnte. Es dauert also noch ein paar
Monate, bis Donald Smith und seine Kollegen wieder an der Stelle im All
schauen k&ouml;nnen, wo Raum und Zeit relativ sind.
<p><font size=-1>[Quelle: Joachim Sch&uuml;ring und Associated Press]</font>
<p>
<hr WIDTH="100%">
<p><i>Sonnensystem:</i>
<br><b>Sonnenaktivit&auml;t n&auml;hert sich dem Maximum</b>
<p>(Meldung vom 25.1.2000)
<p>Auf ihrem Weg zum H&ouml;hepunkt ihres derzeitigen Aktivit&auml;tszyklus
begeistert die Sonne Forscher und Laien durch spektakul&auml;re Ausbr&uuml;che
und Explosionen. So nahm das Solar and Heliospheric Observatory (Soho)
am 18. Januar einen gigantischen, schleifenf&ouml;rmigen Gasausbruch auf,
der an seinem Maximum hundert mal gr&ouml;&szlig;er war als die Erde.
<br>Solche "Flares" und auch die sogenannten "Koronaren Massenejektionen"
ereignen sich zur Zeit fast jeden Tag. Falls ein solcher Ausbruch so liegt,
dass die Explosionswolke in Richtung Erde fliegt, kann es hier ein paar
Tage sp&auml;ter besonders pr&auml;chtige Polarlichter, aber auch Funkst&ouml;rungen
geben. Wissenschaftler vom Marshall Space Flight Center der Nasa erwarten
das Fleckenmaximum f&uuml;r Mitte dieses Jahres. Die Aktivit&auml;t wird
wahrscheinlich dieses und n&auml;chstes Jahr relativ hoch sein und dann
wieder abflauen. Vermutlich wird die Sonnenaktivit&auml;t etwas niedriger
sein als bei den letzten beiden Maxima 1989 und 1978, aber immer noch deutlich
&uuml;ber dem Durchschnitt aller seit 1700 beobachteten Zyklen.
<p>Mehr zur Sonne findet ihr <a href="http://www.wissenschaft.de/bdw/ticker/tickerdisplay.hbs?datum=0&suchmich=Sonne&rubriknr=99&suchdatum=alle&mach=prev&sprung=10">hier</a>.
<p><font size=-1>[Quelle: Ute Kehse und Nasa]</font>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Hubble is back - Beeindruckende Bilder vom Eskimo-Nebel und fernen
Galaxien</b>
<p>(Meldung vom 26.1.2000)
<p>Nachdem das Hubble Space Telescope aufgrund von Sch&auml;den f&uuml;r
l&auml;ngere Zeit in einen k&uuml;nstlichen Winterschlaf versetzt worden
war, wurde im Dezember vergangenen Jahres im Zuge einer Space Shuttle Mission
ein schadhaftes Gyroskop ausgetauscht und eine neue Elektronik eingesetzt.
Um das Teleskop zu testen, richteten die Astronomen es Mitte Januar auf
zwei besonders interessante himmlische Objekte: den Eskimo-Nebel, der ca.
5000 Lichtjahre von der Erde entfernt ist, und auf eine Anh&auml;ufung
von Galaxien, die den Namen Abell 2218 tr&auml;gt.
<p>Beim Eskimo-Nebel handelt es sich um die leuchtenden &Uuml;berreste
eines sterbenden, sonnen-&auml;hnlichen Sterns. Der Name r&uuml;hrt daher,
dass das Objekt wie ein Gesicht aussieht, das von einer Fellkaputze umrahmt
wird. Der Astronom Patrick Harrington von der University of Maryland ist
begeistert von den Hubble-Aufnahmen: ”Von allen planetaren Nebeln, die
mit Hubble aufgenommen wurden, ist das vom Eskimo-Nebel un&uuml;bertroffen
in seiner Sch&ouml;nheit!” Im Hubble-Bild erscheint Stickstoff rot, Wasserstoff
gr&uuml;n, Sauerstoff blau und Helium violett. Die Kaputze ist eine Materiescheibe,
die von einem Ring kometenhafter Objekten umgeben ist, deren Schweife vom
Zentrum wegweisen. Die Astronomen glauben, dass sich der planetare Nebel
vor gut 10.000 Jahren bildete, als der sterbende Stern Materie in den Raum
ausstie&szlig;. Ein den &Auml;quator umgebender Ring dichter Materie scheint
in der Phase entstanden zu sein, als der Stern ein roter Riese war.
<p>Das zweite von Hubble ins Visier genommene Objekt – die massive Anh&auml;ufung
der Galaxien – wirkt im Weltraum wie eine riesige Linse. Das Gravitationsfeld
der Anh&auml;ufung f&uuml;hrt zu einer Vergr&ouml;&szlig;erung der Lichtstrahlen,
die von wesentlich weiter entfernten Galaxien stammen und erlaubt somit
tiefere Einblicke in das Universum. Richard Ellis von der University of
Cambridge ist begeistert von den neuen Hubble-Bildern: ”Erstmals k&ouml;nnen
wir die interne Farbstruktur von einigen sehr weit entfernten Galaxien
beobachten.” Und Hubble-Astronom Andrew Fletcher erg&auml;nzt: ”Das beobachtete
Objekt besitzt Farben, die darauf schlie&szlig;en lassen, dass es entweder
ein extrem kalter Zwerg-Stern in unserer Galaxie ist oder das am weitesten
entfernte Objekt, das Hubble jemals gesehen hat.”
<p>Mehr &uuml;ber das Hubble Space Telescope findet ihr <a href="http://www.wissenschaft.de/bdw/ticker/tickerdisplay.hbs?datum=0&suchmich=HUBBLE&rubriknr=99&suchdatum=alle&mach=prev&sprung=10">hier</a>.
<p><font size=-1>[Quelle: Katja Bammel und BBC]</font>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Leben auf dem Mond</b>
<p>(Meldung vom 27.1.2000)
<p>Auf dem Computer ist vieles m&ouml;glich. Die Berechnungen von Bertil
Olsson von der Pennsylvania State University halten Leben auf Monden, die
von Riesen-Planeten wie Jupiter eingefangen worden sind, f&uuml;r m&ouml;glich.
Er stellte seine Ergebnisse vergangene Woche auf einem Treffen der American
Astronomical Society in Atlanta, Georgia, vor.
<p>Die Menschen suchen schon lange nach au&szlig;erirdischem Leben. Bei
den Planeten unseres Sonnensystems hatten sie bisher kein Gl&uuml;ck. Denn
selbst wenn Gasriesen wie Jupiter die Sonne im richtigen Abstand umkreisen
w&uuml;rden, g&auml;be es auf ihrer Oberfl&auml;che nicht die richtigen
Gegebenheiten f&uuml;r Leben. Astronomen tippen auf die Monde der Riesenplaneten.
Dabei gibt es ein anderes Problem: Monde, die solche Planeten umkreisen,
k&ouml;nnen nur schwer eine Atmosph&auml;re bilden. Die Schwerkraft des
nahen Planeten w&uuml;rde ihnen das Gas sofort weg saugen.
<p>Olsson fand eine andere M&ouml;glichkeit. Riesenplaneten k&ouml;nnten
Himmelsk&ouml;rper als Monde fangen, die etwa so gro&szlig; sind wie die
Erde. Dem Gedanken liegt die Theorie zugrunde, dass die Riesenplaneten
irgendwo an den R&auml;ndern des Sonnensystems entstanden und dann nach
innen gewandert sind. Kleinere Planeten k&ouml;nnten sie auf dieser Reise
aufsammeln. Die Tour durchs Universum berechnete Olsson am Computer. Er
fand heraus, dass es f&uuml;r einen solchen Himmelsk&ouml;rper einfach
ist, einen erd&auml;hnlichen Planeten als Mond auf einer stabilen Umlaufbahn
mitzunehmen. "Ich war &uuml;berrascht wie einfach das geht", sagt Olsson.
Die Simulation zeigte, dass Giganten, die zehn Mal so gro&szlig; sind wie
der Jupiter, Planeten an sich rei&szlig;en k&ouml;nnten, die zehn Mal so
gro&szlig; sind wie die Erde.
<p>Die Berechnungen beinhalten noch nicht, ob der Planet auch wirklich
in eine stabile Umlaufbahn ger&auml;t. Denn obwohl Olsson es so einfach
findet, k&ouml;nnte die Schwerkraft der Riesen die Zwerge auch aus ihren
Systemen werfen und in die Tiefen des Raumes schicken.
<p><font size=-1>[Quelle: Cornelia Pretzer und Newscientist]</font>
<p>
<hr WIDTH="100%">
<p><b><font size=+1>S</font></b>o, das war's nun f&uuml;r diesen Monat.
Ich hoffe, dass diesmal wieder einige interessante Neuigkeiten f&uuml;r
euch dabei waren. Bis zur n&auml;chsten <b>Astro-Corner</b> dann...
<p><b><font size=+1>E</font></b>uer <b><i>Lars Philipsen</i></b>.
<br>--
<br><a href="mailto:LarsPh@cityweb.de?subject=Re: Astro-Corner 12">E-MAIL</a>
</body>
</html>
