<html>
<head>
<meta name="description" content="Wolf-INFO">
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="wolf1.gif" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" bgcolor="#808080">
<font color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td></tr></table
<table border="0" cellpadding="5"><tr><td>
<a href="mitglieder/zimmer.html">
<img src="st_wolfinfo2.jpg" width=100 height=96 border=0 align=left></a></td>
<td><ul><center><font color=blue> I n h a l t </font></center>
<li> <a href="#a1"> Wo ist Randa? </a></li>
<li> <a href="#a2"> Online-Gauner </a></li>
<li> <a href="#a3"> Online-Frust </a></li>
<li> <a href="#a4"> Feedback </a></li>
</ul></td></tr></table><br clear=all>
<hr>
<table border=0 width=100% cellpadding=6><tr><td>

<p align=center><a name="a1"><font color="800000" size="5">
<b>Wo ist Randa ???????????</font></b></a></p>
<p>
<img src="st_wolfinfo1.gif" align=left width="160" height="160" hspace="6">
Die &Uuml;berschrift ist berechtigt. Thomas glaubt, niemand in den Reihen der
NoCoverleser w&uuml;rde Randa vermissen. Das gleiche gilt auch f&uuml;r Spacy. Nur
bei Oliver scheint es Hardwareprobleme zu geben, aber nicht f&uuml;r Randa.
Vermutlich gibt es hier eher Motivationsprobleme. Thomas glaubt, keiner
vermisse Randa und als ich ihn darauf hin angemailt hatte, meinte er,
ich sei wohl der einzige, dem &uuml;berhaupt aufgefallen sei, dass Randa fehlte.
Nun verstehe ich ehrlich gesagt fast nichts mehr. Nicht nur, dass niemand
mehr sich berufen f&uuml;hlt, einen klitzekleinen, netten, freundlichen,
aufmunternden Artikel f&uuml;r die NoCover zu schreiben, es wird noch nicht
einmal gemosert, wenn keiner mehr schreibt. Aber dass sich auch niemand
mehr aufregt, dass die Comics so mir nichts dir nichts einfach von der
Bildfl&auml;che verschwunden sind, das ist doch ein sehr starkes St&uuml;ck. Bald
komme ich mir vor, dass ich wohl noch der Letzte bin, der nur einen Amiga
hat und auch als Einziger die NoCover liest. Ganz so schlimm ist es noch
nicht, besonders Kilian, den flei&szlig;igsten aller verbliebenen Schreiber darf
ich hier nicht vergessen. Ganz ehrlich, wieviel bleibt eigentlich noch
&uuml;brig, wenn er mal krank w&uuml;rde oder etwa auch von der negativen Motivationseuphorie
angesteckt w&uuml;rde? </p>

<p>In meiner letzten Wolf-INFO habe ich schon dar&uuml;ber gemosert, dass hier
verflixt wenig geschrieben wird, aber glaubt ja nicht, dass ich darob einen
Feedback erhielt oder auch nur ein einziger gesagt hat: "mea culpa" und
Besserung gelobte. Nichts, nichts nichts. Frust, Frust, Frust. Andere Worte
fallen mir schon gar nicht mehr ein. Aber diese reichen wohl auch. </p>

<p>Also<br><center><font color="800000" size="5">
<b>Wo bleibt Randa ???????????</font></b></center></p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a2"><font color="800000" size="5">
<b>Online-Gauner</font></b></a></p>

<p>In der Internet-Illustrierten Tomorrow 2/2000 wurde als Titelbericht das Thema<br>
<center><b>Nepper, Schlepper, Online-Gauner</b></center>
gew&auml;hlt und nach meinem Geschmack auch gut recherchiert und dargestellt. Es lohnt sich
wirklich diesen Artikel vollst&auml;ndig zu lesen. Begonnen wird damit, wie ein
"Cleverle" Zeitungsinserate von Autoverk&auml;ufen ins Netz stellt und den Inserenten
eine Rechnung schickt. Wer diese nun bezahlt hat, ist automatisch einen Vertrag
eingegangen und kann sich nicht mehr wehren. "8000,- DM nebenbei verdienen?" versprechen
Lockinserate. Wer nun ausreichend Gutgl&auml;ubige geschr&ouml;pft hat und sich rechtzeitig
in die Karibik abgesetzt hat, ist dann schwerlich vor den Kadi zu ziehen. Wer eine
Karriere mit dem Verkauf von Katzenfellen gegen Rheuma oder in die Aalzucht einsteigen
will, findet im Netz neue Herausforderungen. Kettenbriefe und Schneeballsysteme
erleben online einen neuen Aufschwung. Wer bei Preisr&auml;tsel mitmacht und ein Handy
gewinnt, bekommt dieses aber nur, wenn er einen E-Plus Vertrag abschlie&szlig;t. Wer
im Netz verschiedene Produkte ordert und verschl&uuml;sselt mit Kreditkarte bezahlt,
darf sich nachher nicht wundern, wenn kurz danach von seinem Kreditkartenkonto Dollars
f&uuml;r Blumen, B&uuml;cher und Sexleistungen abgebucht werden. Da wieder zu seinem Geld
zu kommen ist verflixt schwer und sehr umst&auml;ndlich. </p>

<p>1998 bezogen sich laut GZS (Gesellschaft f&uuml;r Zahlungssysteme) &uuml;ber 30% der
Kreditkarten Reklamationen auf Zahlungen im Internet. Dabei liegt aber nicht immer
Betrug vor, leichtgl&auml;ubige und leichtsinnige Surfer &uuml;bersehen, dass Schnupper-Angebote
schnell kostenpflichtig werden k&ouml;nnen. </p>

<p>Netzgaunereien verbreiten sich rasant. H&auml;ufig zu schnell f&uuml;r Polizei und BKA, die
im Zeitraum von Januar bis August 1999 nur 11 Verdachtsf&auml;llen von Betrug - aber
632 F&auml;llen von Kinderornographie nachgegangen sind. Sehr beliebt sind derzeit
lukrative Geldanlagen, Minenbeteiligungen und Aktienkauf auf Grund gesteuerter
&Uuml;bernahmeger&uuml;chte und Gewinnprognosen sogenannter Insider. </p>

<p>Wer durch solche kriminelle Machenschaften im Netz viel Geld verliert, w&uuml;nscht
sich vermutlich er w&auml;re nur auf einen kleinen Gauner hereingefallen, der Viagra
zu liefern versprach, aber nur Pfefferminzbonbons lieferte. </p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a3"><font color="800000" size="5">
<b>Online-Frust</font></b></a></p>
<p>Dieser Tage bekam ich eine Weiterleitungsmail mit der Bitte, ebenfalls
eine Weiterleitung durchzuf&uuml;hren. Dieser Aufforderung bin ich nicht
nachgekommen. Denn es reicht wenn ich schon mit den sogenannten
Virenwarnungen auf dem falschen Fu&szlig; erwischt wurde. Trotzdem m&ouml;chte ich
diese Mail nicht vorenthalten, da sie symptomatisch f&uuml;r die Blau&auml;ugigkeit
mancher Netz-Freaks ist. Wenn jemand eine Dienstleistung (DL) im Netz
anbietet, ist diese nie kostenlos. Manche DL-Anbieter k&ouml;nnen einen
vordergr&uuml;ndigen Anschein erwecken, aber diese sind entweder voll gesponsert
oder der DL-Nutzer wird automatisch zum Werbetr&auml;ger ohne eine Entlohnung zu
bekommen. Wenn aber ein DL-Anbieter sich verkalkuliert hat und im
wirtschaftlichen Bereich verbleiben m&ouml;chte, m&uuml;ssen die Kosten
selbstverst&auml;ndlich auf die DL-Nutzer umgelegt werden. Nun also erst einmal
die Mail: <br>
<pre>
 &gt; Hallo lieber K&auml;ufer und Verk&auml;ufer bei Ebay!
 &gt;
 &gt; Bitte nícht b&ouml;se sein &uuml;ber dieses unaufgeforderte Mail von mir und allen
 &gt; anderen, die den neuen Geb&uuml;hren bei Ebay.de absolut fassungslos gegen&uuml;ber
 &gt; stehen, aber der Grund dieses Mails ist dringend und sehr einschneidend
 &gt; bez&uuml;glich der Gesch&auml;ftsgewohnheiten auf der Auktionsseite bei ebay.de!
 &gt; Aufgrund der neuen Geb&uuml;hrenordung sind nun alle Verk&auml;ufer verpflichtet
 &gt; nicht nur bei erfolgreichem Verkauf des entsprechenden Artikels an
 &gt; Ebay.de eine Verkaufsprovision abzuf&uuml;hren, sondern mit Inkrafttreten der
 &gt; neuen Geb&uuml;hrenneuordnung  von Ebay.de zum 05.02.2000 ist nun auch
 &gt; alleine f&uuml;r die Einstellung eines Artikels eine Geb&uuml;hr zu entrichten:
 &gt; "Die Geb&uuml;hr f&uuml;r das Anbieten von Artikeln (ab 05.02.2000) ist von der
 &gt; H&ouml;he des Startpreises abh&auml;ngig. Bis zu einem Startpreis von DM 9 kostet
 &gt; der Start einer Auktion 0,25 DM, bei Startpreisen zwischen 10 DM und 49
 &gt; DM berechnen wir 0,50 DM und ab 50 DM Startpreis stellen wir 1,00 DM in
 &gt; Rechnung. Im &Uuml;berblick: "
 &gt;
 &gt;         Startpreis  Angebotsgeb&uuml;hr (ab 05.02.2000)
 &gt;
 &gt;         von 1 DM bis 9 DM    0,25 DM
 &gt;         von 10 DM bis 49 DM  0,50 DM
 &gt;         ab 50 DM             1,00 DM
 &gt;
 &gt; ACHTUNG :
 &gt; Die Angebotsgeb&uuml;hr wird auch bei jeder Verl&auml;ngerung der Auktion
 &gt; berechnet !!
 &gt; Das hei&szlig;t auch bei jeder Verl&auml;ngerung einer nicht erfolgreichen Auktion
 &gt; wird in Zukunft die obige Geb&uuml;hr f&auml;llig. Bisher war dies alles
 &gt; kostenlos!!
 &gt;
 &gt; Folgen f&uuml;r den Verk&auml;ufer und K&auml;ufer:
 &gt;
 &gt; a. Massiv erh&ouml;hte Geb&uuml;hren sowohl beim Verkauf von Artikeln, als auch
 &gt;    alleine f&uuml;r die Einstellung von Artikeln - somit wird in Zukunft
 &gt;    schon bezahlt obwohl der Verk&auml;ufer noch gar nicht wei&szlig; ob und wann
 &gt;    er den einzustellenden Artikel verkaufen wird. Da k&ouml;nnte man gleich
 &gt;    eine Anzeige bei der Tagespresse in der "Verk&auml;ufe" Rubrik schalten
 &gt;    und die Resonanz abwarten.
 &gt; b. Tendenziell werden sich immer mehr ausschlie&szlig;lich gewerbliche
 &gt;    H&auml;ndler auf Ebay.de tummeln und immer weniger Privatleute, die was
 &gt;    verkaufen wollen, da sich die Geb&uuml;hren nur noch H&auml;ndler mit
 &gt;    entsprechendem Umsatz  werden leisten k&ouml;nnen.
 &gt; c. Preise m&uuml;ssen angehoben werden um denselben Verkaufserl&ouml;s wie vorher
 &gt;    zu erhalten. Dadurch sinkt nat&uuml;rlich die Erfolgsrate - durch h&ouml;here
 &gt;    Preise werden die Angebote zunehmend unattraktiver! ( ein negativer
 &gt;    Kreislauf der sich selbst verst&auml;rkt )
 &gt; d. Der Marktplatz Ebay.de wird zunehmend unattraktiver durch den
 &gt;    Wegfall der privaten "Sammlerst&uuml;cke", "Antiquariat" und die
 &gt;    hei&szlig;geliebten Schn&auml;ppchen f&uuml;r ein paar Mark. Denn jedes Angebot
 &gt;    hatte seinen besonderen Reiz - jetzt kommt die Massenfabrikware wo
 &gt;    ein St&uuml;ck wie das andere aussieht, nur der Preis, die Gr&ouml;&szlig;e und
 &gt;    Farbe unterscheiden sich noch !
 &gt; e. Soll das der Lohn f&uuml;r n&auml;chtelanges Eintippen und peinlichst genaue
 &gt;    und schnellst m&ouml;gliche Abwicklung sein ? Der Lohn f&uuml;r
 &gt;    zusammengerechnet "tagelanges Warten" bis sich die Seite endlich
 &gt;    aufbaut?  Der Lohn f&uuml;r Freizeit und Aktivit&auml;tenverzicht?
 &gt; f. Ist das der Dank f&uuml;r viele, viele Anregungen und geopferter Zeit?
 &gt;    Wo bleibt da unsere Entlohnung f&uuml;r all die aufgewendete Zeit?
 &gt; g. Ist das der Nutzen von ernsthaft angesammelten "Pluspunkten" bei
 &gt;    Ebay?
 &gt; h. Das ganze ist etwa so, wie wenn ein Arbeitnehmer bei einem neuen
 &gt;    Betrieb f&uuml;r DM 3000,- Brutto anf&auml;ngt und Monate sp&auml;ter erkl&auml;rt ihm
 &gt;    der Arbeitgeber, da&szlig; er von nun an dieselbe Arbeit f&uuml;r nur noch DM
 &gt;    2000,- zu tun h&auml;tte. Wieviele Arbeitnehmer w&uuml;rden noch bleiben, wenn
 &gt;    sie woanders dieselbe Stelle f&uuml;r DM 3000.- bekommen w&uuml;rden ohne da&szlig;
 &gt;    die Stelle anstrengender oder mit einem l&auml;ngeren Anfahrtsweg
 &gt;    verbunden w&auml;re? Ich denke die Antwort ist: Nicht viele!!!  Und das
 &gt;    sch&ouml;ne am Internet ist, da&szlig; der neue Arbeitgeber nur einen Klick
 &gt;    entfernt ist!!! Ob Ricardo, Amazon, Yahoo oder Lycos, da&szlig; ist uns
 &gt;    doch egal . Wir sollten uns deshalb unserer Macht bewu&szlig;t sein und
 &gt;    Ebay eine M&ouml;glichkeit geben, diese Entscheidung mit sofortiger
 &gt;    Wirkung wieder zur&uuml;ckzunehmen.
 &gt; i. Bis zu diesem Zeitpunkt sollten wir alle zusammen jeder einzelne f&uuml;r
 &gt;    sich seinen Teil dazu beitragen, indem er diese Aufforderung bzw
 &gt;    dieses E-Mail an m&ouml;glichst viele seiner letzten K&auml;ufer und Verk&auml;ufer
 &gt;    aus einer Ebay Auktion, sendet und zugleich keine  neuen Auktionen
 &gt;    auf Ebay mehr einstellt sowie ausgelaufene, erfolglose Auktionen ab
 &gt;    sofort nicht mehr verl&auml;ngert.
 &gt; j. Zudem sollte jeder diese oder eine eigene Mail an folgende Adresse
 &gt;    bei Ebay in Berlin weiterleiten ( qualitaet@ebay.de ) um darzustellen
 &gt;    wieviele sich gegen die Geb&uuml;hrenerh&ouml;hung aktiv wehren!!!
 &gt;
 &gt; Bitte wartet nicht lange denn die Zeit ist knapp - bitte sofort an alle
 &gt; Dir bekannten Verk&auml;ufer und K&auml;ufer der letzten Zeit weiterleiten!! Falls
 &gt; Ihr deren Mailadresse nicht mehr habt, geht einfach auf "Mein Ebay" und
 &gt; klickt auf  "meine erfolgreichen K&auml;ufe"  bzw.    "meine erfolgreichen
 &gt; Verk&auml;ufe".
 &gt; Da stehen sie alle noch !!
 &gt;
 &gt; MfG , Ingo ( NewCrazy )
 &gt; Ein sehr entt&auml;uschter Auktionator
</pre>

<br>Diese Mail werde ich nun nicht weiter bewerten, das sollte jeder f&uuml;r sich selbst
vornehmen. Nur eines ist sicher, sie geh&ouml;rt nicht in die Kategorie des vorigen
Artikels. </p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a4"><font color="800000" size="5">
<b>Feedback </font></b></a></p>
<p>Folgende Artikel habe ich dieses Mal in meinem Feedback in alphabetischer
Reihenfolge der Titel ber&#252;cksichtigt. Ein Autor erscheint bei mir nur
einmal, auch wenn mehrere Beitr&#228;ge lobenswert sind: </p>
<ul>
<li> <b>AmigaOS 3.5</b> von Kilian Servais </li>
<li> <b>AstroCorner</b> von Lars Philips </li>
<li> <b>Diskussion</b> von Cord Hagen </li>
<li> <b>Feedback</b> von Sieglinde Peters </li>
<li> <b>Freespace</b> von Henning Wolf Knopp </li>
</ul>

<p>Eigentlich h&auml;tte ich alle acht Autoren erw&auml;hnen k&ouml;nnen, aber es ist halt mal
vorgesehen, bei der Zahl 5 zu bleiben und so habe ich nun diese Auswahl getroffen. </p>

<hr size=4>
</td></tr></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf">
http://www.chiemgau.com/apc&amp;tcp/members/wolf </a></font>
<br>
</td></tr></table>
<br>
</body>
</html>
