<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Page Design</title>
</head>
<body background="wolf1.gif" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#800000" size="7">
<b>Web - Design</font></b></p>
<table width=100% border=0><tr><td>
<p>Bisher habe ich vier Workshops &uuml;ber dieses Thema geschrieben
<table border=0>
 <tr><td> &nbsp; </td><td> Nr.1 </td><td>Homepage (Teil 1)</td><td>NoCover-67</td></tr>
 <tr><td> &nbsp; </td><td> Nr.2 </td><td>Web-Site (Teil 2)</td><td>NoCover-68</td></tr>
 <tr><td> &nbsp; </td><td> Nr.3 </td><td>Page Design (Teil 1)</td><td>NoCover-67</td></tr>
 <tr><td> &nbsp; </td><td> Nr.4 </td><td>Page Design (Teil 2)</td><td>NoCover-68</td></tr>
 </table>
und es ist wohl an der Zeit, erstens nochmals kurz Revue zu passieren und
zweitens ein paar weitere Bemerkungen anzuf&uuml;gen. Derzeitige Aussagen:
&quot;interessiert mich nicht&quot;, &quot;Eigene Homepage? Nie!&quot; oder
&auml;hnliche &Auml;u&szlig;erungen sind &uuml;bereilt. Denn mit dem Metier
der eigenen Website werden mindestens die J&uuml;ngeren unter uns bestimmt
bald konfrontiert werden. Denn es hat sich ganz still und leise eine neue
Richtung aufgetan. Die Familiendom&auml;n. Eine Homepage nur f&uuml;r einen
internen Familienclan erstellt und von diesen dann laufend frequentiert.
Man ist immer auf dem neuesten Stand und es entfallen die l&auml;stigen
Telefonate mit Tante Friedchen oder den Geschwistern. Auch der f&auml;llige
Sonntagsbesuch bei der Oma kann auf einen l&auml;ngeren Intervallrhythmus
gesetzt werden. Man ist stets uptodate &uuml;ber die Zeugnisse und die
Entwicklung der Kinder und deren neuesten Kino- und Musikinteressen. Einer
ist der Webmaster, aber alle haben die M&ouml;glichkeit der Bef&uuml;llung,
Pflege, &Auml;nderung der eigenen eingebundenen Seite. Ab diesem Zeitpunkt
sollte man sich schon etwas auskennen, sowohl mit der fundametalen
Anwendung der HTML-Sprache (und nicht alles dem Pagemaker &uuml;berlassen,
der kann n&auml;mlich noch l&auml;ngst nicht alles) und falls Java-Script
oder CSS Style-Sheets verwendet wird, auf diesen Gebieten etwas mehr als
nur Ahnung haben. Dem unkontrollierten Wildwuchs sind n&auml;mlich sonst
T&uuml;r und Tor ge&ouml;ffnet. </p>

<p>Eine gute Homepage zeichnet sich erst durch ihren interessanten Inhalt
aus. Aber fast ebenso wichtig ist eine attraktive Aufmachung und die
Verpackung des Inhaltes. Hier werden Fehler gemacht, Fehler, Fehler,
Fehler. In einem &ouml;ffentlichen Forum fragte unl&auml;ngst jemand ganz
ernsthaft, warum seine Page nicht besucht w&uuml;rde. Seine Homepage
besteht aus <b>einer</b> einzigen HTML-Seite, mit mehreren verschiedenen
Tabellen, aber vor allen Dingen mit vielen animierten GIF-Bilder, einfachen
GIF- und JPG-Bilder, aber auch PNG-Bildchen. Der Hintergrund wird mittels
JAVA-Script dargestellt, was auch funktioniert, aber mit Browser ohne
Java-Script wird die Seite falsch aufgebaut und sieht katastrophal aus. Von
der Ladezeit m&ouml;chte ich schon nicht mehr sprechen, es waren glaube ich
acht Minuten. Dass da die allermeisten abbrechen ist doch wohl
selbsterkl&auml;rend. Da die gesamte Fl&auml;che der ersten drei
gescrollten Bildschirme nur aus Bilddateien ohne Text bestehen und alle
Bilder keine ALT-Bezeichnung haben, ist beim Laden ohne Bilder und
Hintergrund nichts ausser den Symbolen f&uuml;r fehlende Bilder zu sehen.
W&auml;re dieser junge Mann in unserem Club und h&auml;tte er die vier
ersten Workshops gelesen, dann w&auml;re ihm dies wohl nicht passiert.
Trotzdem werden von den meisten immer noch der Fehler der &uuml;berladenen
ersten Seite gemacht. Es muss ja nicht gleich so spartanisch wie auf meiner
Homepage bei T-Online zugehen, aber weniger w&auml;re bei den meisten mehr.
</p>

<p>Eine gute Homepage sollte wie eine gedruckte Seite in einem Buch
gestaltet sein: klar geordneter Text, feste Positionen f&uuml;r die Bilder,
nicht zu viele Stilwechsel auf einer Seite. Den Aufbau der einzelnen Seiten
und Links habe ich in den Teilen 1 und zwei wohl ausgiebig besprochen und
dargelegt. Ohne gute und solide Inhalte werden die Seiten langfristig
niemanden mehr begeistern. In den 80er Jahren konnten die MTV-Videoclips
noch manchen fesseln, aber selbst die fast perfekte Bilderflut entlockt
heute kaum jemanden mehr ein Jubeln. Die Mischung machts, Infotainment ist
gefragt. Dabei ist es keinesfalls so, dass Texte langweilig sein
m&uuml;ssen, im Gegenteil. Viele der beeindruckensten Seiten im Netz setzen
Grafiken und anderen Multimedia-Schnickschnack &uuml;beraus sparsam ein.
Daf&uuml;r herrscht hier die hohe Schule der Typographie. Mit Schriftart,
-gr&ouml;&szlig;e und -farbe wird eine enorme Wirkung erzielt. Im Idealfall
verschmelzen Schrift, grafische Gestaltung und Inhalt zu einer funktionalen
Einheit und zu einer optisch ansprechenden Information. </p>

<p>Der gr&ouml;&szlig;te Vorteil von Textseiten ist die kleine
Dateigr&ouml;&szlig;e und die daraus resultierende Ladezeit. Wer schon mal
mehrere Minuten auf eine Web-Seite gewartet hat, um dann nur von einem zu
gro&szlig;en &quot;Herzlich Willkommen&quot; - Bild begr&uuml;&szlig;t zu
werden, der versteht in dieser Hinsicht keinen Spa&szlig; und ist schon
wieder weitergesurft. Wer nun Dynamik auf seiner Seite haben m&ouml;chte,
der kann auch mit Text zaubern. Ein kleiner Java-Script sorgt daf&uuml;r,
dass k&uuml;rzere Mitteilungen sanft eingeblendet werden. Auch eine
Laufschrift oder ein blinkender Text kann in wenigen Sekunden erstellt
werden. Aber immer nur so, dass nie Hektik aufkommen kann. Den Vorzug
w&uuml;rde ich der Laufschrift geben, das wirkt wie ein Nachrichtenticker.
</p>
<hr>
<p>Es kann nie oft genug gesagt werden: Weniger ist mehr!!!! Deshalb nochmals
ein paar wichtige Regeln:<center>
<table border=0>
<tr><th colspan=2>Optimale Schriftauswahl und Formatierung</th></tr>
<tr><td>1. &nbsp; </td><td valign=top>h&ouml;chstens nur zwei Schrifttypen,
eine f&uuml;r den Grundtext und eine f&uuml;r die
&Uuml;berschriften.</td></tr>
<tr><td>2. &nbsp; </td><td valign=top>F&uuml;r den Grundtext eignet sich am
besten eine &quot;normale&quot; Schrift wie Times oder Arial.</td></tr>
<tr><td>3. &nbsp; </td><td valign=top>Im Dokument sollte man sich auf zwei
maximal drei verschiedene Zeichens&auml;tze beschr&auml;nken.</td></tr>
<tr><td>4. &nbsp; </td><td valign=top>Es ist genau zu &uuml;berlegen,
welche Bedeutung fette, kursive und farbige Hervorhebung haben sollte.
</td></tr>
<tr><td>5. &nbsp; </td><td valign=top>Auf Unterstreichungen sollte generell
verzichtet werden, damit keine Verwechslungen mit Links entstehen
k&ouml;nnen.</td></tr>
<tr><th colspan=2><hr>Beschr&auml;nkung der Textmenge</th></tr>
<tr><td>1. &nbsp; </td><td valign=top>Wenn m&ouml;glich ist eine Textzeile
auf 12 W&ouml;rter zu beschr&auml;nken. Denn kurzsichtige Surfer stellen
ihre Browser gerne auf das Godzilla-Format ein.</td></tr>
<tr><td>2. &nbsp; </td><td valign=top>Der Text ist in sinnvolle und schnell
erfassbare Abschnitte zu unterteilen. Am besten mit Absatz und kleiner
&Uuml;berschrift. </td></tr>
<tr><td>3. &nbsp; </td><td valign=top>Bei langen und l&auml;ngeren Texten
ist eine kurze Inhaltsangabe vor dem Text oder auch linksb&uuml;ndig sehr
angebracht.</td></tr></table>
<table border=0>
<tr><th><hr>Keine exotischen Schriftarten</th></tr>
<tr><td>Arial, Helvetica, Courier und Times sind die am weitesten
verbreiteten Schriftarten und werden von fast allen Browsern und
Betriebssystemen dargestellt. Es spielt keine Rolle, ob serifenlose oder
Serifenschriften (ohne oder mit F&uuml;&szlig;chen) bevorzugt werden, nur
eine nichtproportionale Schrift wie Courier sollte man nur wenn wirklich
notwendig einsetzen, damit keine wie mit Schreibmaschinen getippte Seite
entsteht.</td></tr>
<tr><th><hr>Text als Grafik</th></tr>
<tr><td>Wenn nur an wenigen Stellen ein anderer Font ben&ouml;tigt wird,
kann dieser auch als Grafik eingebunden werden. Der Vorteil ist, dass eine
bestimmte Schrift und die Gr&ouml;&szlig;e erzwungen werden,
gleichg&uuml;ltig mit welchem Browser, Betriebssystem und
benutzerdefinierten Voreinstellungen man diese Seite aufruft: Sie sieht
immer gleich aus. <br><br>
Der Nachteil ist jedoch gravierend, wenn ganze Textpassagen als Grafik
integriert sind: Wer aus Geschwindigkeitsgr&uuml;nden den Empfang von
Grafiken abgestellt hat, sieht von diesen Texten rein gar nichts. Und der
Seitenaufbau wird deutlich verl&auml;ngert, da Grafiken immer langsamer
geladen werden. Also keine sehr empfehlenswerte Vorgehensweise. </td></tr>
<tr><th><hr>Laufschriften und andere Texteffekte</th></tr>
<tr><td><img src="work_wbds.gif" width=56 height=77
align=left>hantasiereich kann auch ein Initial als Blockbeginn sein.
Blo&szlig; nicht zu h&auml;ufig oder generell. Das wirkt dann nicht mehr.
Buchstaben wirken auch, wenn der Hintergrund transparent ist. Im
vorliegenden Beispiel habe ich es aber unterlassen, damit der
Zweifarbenmodus besser herausgestellt wird. Farbige Initialen wirken meist
mit einem transparentem Hintergrund besser und wenn dann mittels CSS
Style-Sheets ein Textumfluss wie in einem DTP Programm realisiert wird, ist
die Wirkung besser als im vorliegendem Beispiel. Nur die Amigabrowser
h&auml;ngen hier noch hinterher. <br> Eine Laufschrift sollte eigentlich
nur mittels Java-Script gemacht werden, denn dies kann in der
Geschwindigkeit und ruckelfrei gesteuert werden. Browser ohne Java-Script
Darstellung zeigen dann gar nichts. Auch wieder noch nicht ganz das
richtige. Aber kommt Zeit, kommt Abhilfe. </td></tr><hr>
</table></center></p>

<p>&Uuml;ber Frames und deren Platzverschwendung, wenn dies
&uuml;bertrieben wird, &uuml;ber Links und Verkn&uuml;pfungen, &uuml;ber
Textmarken und Lesezeichen berichte ich heute nicht. Auch nicht &uuml;ber
Grafiken und deren Anwendungen, da dies nach meinem Daf&uuml;rhalten
ausreichend in den &auml;ltern Workshops abgehandelt wurde. &Uuml;ber die
interaktiven M&ouml;glichkeiten, wie G&auml;stebuch, R&uuml;ckmeldungen,
Musik und andere Ger&auml;usche (wie z.B. die eigene Stimme) und auch
&uuml;ber Filme / Animationen und auch Videokonferenzen schreibe ich an
dieser Stelle nicht. Der Sprung ist zu gro&szlig; und ich habe selbst noch
zu wenig dar&uuml;ber gelesen respektive ausprobiert. </p> </td></tr>
<hr size=4></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
</td></tr></table>
<br>
        
</body>
</html>
