<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Software / Testbericht: Amiga OS 3.5</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <img src="../pic/os35_1.gif" border="0">
  </td>
 </tr>
 <tr>
  <td>
  <br>
  <br>
  <font size="3" face="arial">
Es grenzt ja schon fast an ein Wunder das das Upgrade zum Amiga OS3.1 &uuml;berhaupt 
erschienen ist. Wer das geschehen etwas zur&uuml;ckverfolgt, dem wird aufgefallen sein,
das lang angek&uuml;ndigte Projekte oftmals nie endg&uuml;ltig realisiert wurden. Anders
dagegen beim OS3.5, obwohl es mehrmals verschoben wurde ist es nun f&uuml;r alle User
erh&auml;ltlich. Nach 7 Jahren nun endlich ein Upgrade f&uuml;r unser so geliebtes Betriebssystem.
<br><br>
Doch was steckt dahinter? Ist es nur ein simples Update des Designs, was man auch
mit Tools aus dem Aminet hinbekommen w&uuml;rde oder hat sich tats&auml;chlich einiges
getan? Was das OS3.5 so alles kann und was nich, erfahrt Ihr nun in unserem Test!
<br><br>
Es war schon ein ergreifender Moment als der nette Mann von DPD an meinen Haus
hielt und ein P&auml;ckchen zu mir brachte. Kaum war die Haust&uuml;r zu, schon war das Messer
in der Hand und der Klebestreifen am Paketrand hatte keine Chance mehr. Und da
war sie... die Software, auf die ich schon so lange gewartet hatte - das OS 3.5!
<br><br>
Wie auch nicht anders zu erwarten war, wird das OS 3.5 auf einer CD ausgeliefert,
dazu gibt es noch eine Registrierkarte und ein kleines Handbuch, da&szlig; grob die
Handhabung der CD und des Installationsscriptes beschreibt.
<br><br>
Da ich sehr an meinen Daten h&auml;nge, habe ich mir auch gleich noch vor der Installation
ein BackUp meiner Festplatte erstellt. Danach startete ich (bei unver&auml;nderter 
Festplattenkonfiguration - sprich ich habe nichts formatiert!!!) das Installationsscript
von der CD. Notwenig ist als erstes ein kleine Pre-Installation, die notwendige Dateien
kopiert und alles f&uuml;r die endg&uuml;ltige Installation vorbereitet. Danach f&uuml;r der Amiga
automatisch ein Reset aus und nach dem Neustart werden erstmalig auch die GlowIcons
korrekt angezeigt. Nun klickte ich mich (recht aufgeregt) bis zur Installation durch
und veranla&szlig;te diese. Das Upgraten auf Version 3.5 erfolgt, bei vorinstallierter OS 3.1
Version, im Grunde automatisch, nur weniger Einstellungen, wie Grafiktreiber und
CD Treiber m&uuml;ssen get&auml;tigt werden. Ist die CD abgeschlossen, k&ouml;nnen noch ein PPC
Treiber, ein CD Treiber und die Internetsoftware installiert bzw. eine Notfall-Diskette
angelegt werden, doch dazu gibt es sp&auml;ter noch genaueres.
  <br>
  <br>
  <center>
  <img src="../pic/os35_2.jpg" border="0">
  </center>
  <br>
  <br>
Nach dem Neustart kam dann die gro&szlig;e &Uuml;berraschung. Da ich vorher NewIcons installiert
hatte und keine Daten vorher l&ouml;schte, bliebt auch meine NewIcons Palette erhalten und
nur vereinzelt gab es die GlowIcons zu bestaunen. Das st&ouml;rte mich jedoch anfangs weniger.
Die Installation kopierte automatisch alle alten Datatypes und die Tools aus der WBStartup
Schublade in ein seperates Verzeichnis, damit diese nicht verloren gehen. Nachdem ich
diese Tools aus der &quot;WBStartup_disabled&quot; Schublade in die Richtige kopierte gab es auch
keine gro&szlig;artigen Pleiten und Pannen, was mich schonmal positiv stimmte. Leider nervte
mich der Mischmasch zwischen NewIcons und GlowIcons und so l&ouml;schte ich die NewIcons,
samt Eintrag in der User-Starup, von meiner Platte - doch dies f&uuml;hrte zum Desaster.
leider bootete meine Festplatte nicht mehr. Keine Ahnung warum! Danach folgte eine
mehrst&uuml;ndige Katastrophe die mich dazu brachte die scheixx Festplatte komplett zu
l&ouml;schen und alles neuzuinstallieren. Naja, gut war einzig und allein das ich nun sagen
kann, da&szlig; die OS3.1 Installation von CD fehlerfrei funktioniert:)
<br><br>
Nun war es zum X-ten mal vollbracht und siehe da, es war alles so wie es sein sollte.
GlowIcons so weit das Auge reicht. Nun mu&szlig;te ich nur noch alle Programme neu installieren
und daf&uuml;r sorgen das auch DOpus Magellan2 seine Arbeit wieder aufnimmt. Um mit DOpus Magellan2
keine Probleme zu haben, ben&ouml;tigt Ihr ein Patch der im Aminet bzw. ein GP Software zu finden
ist!
<br><br>
Neben den vielen neuen und aktualisierten Datein und Librarys hat man sehr viel Arbeit
in die Oberfl&auml;chengestaltung gesteckt. Nun ist es auch ohne zus&auml;tzliche Tools m&ouml;glich
verschiedene Hintergrundbilder (einzeln f&uuml;r Workbench und Fenster) festzulegen, wie
auch T&ouml;ne. Alle Men&uuml;s wurden (zumindest) grafisch aufgepeppt und erhielten teilweise
neue Optionen. So wurden vorallem die Druckereinstellungen erneuert, aktuelle Treiber
installiert und auch eine PPC Unterst&uuml;tzung eingef&uuml;gt. Auch einige Tools wurden bearbeitet,
so gibt es mit &quot;EditPad&quot; ein tollen kleinen Editor der auch grafische Buttons bietet.
Auch ein neue Player f&uuml;r Audio CD`s gibt es im Paket. Es w&uuml;rde sicher zuviel Platz wegnehmen
hier alle kleinen Erneuerungen aufzuz&auml;hlen, weshalb ich dazu abschlie&szlig;end sagen m&ouml;chte,
da&szlig; das Design in Version 3.5 fast ohne zus&auml;tzliche Tools erstaunliche Ergebnisse vorweist.
Positiv ist auch, da&szlig; man nun via Multiview ANIM-Animationen abspielen kann.
<br><br>
Neben der Unterst&uuml;tzung von Festplatten &uuml;ber 4 GB Kapazit&auml;t, PPC Support &uuml;ber WarpUP, 
neuen Druckertreibern und einem umfangreicheren CD Support (&uuml;ber CacheCDFS) hat man auch
viele Datatypes und Library`s aktualisiert, die nun schneller und robuster arbeiten.
Als Beispiel nenne ich hier einmal die neuen Datatypes f&uuml;r die Grafikformate GIF, JPG,
PNG und AIFF, oder &uuml;berarbeitete Libs, wie die 68040.library oder die bullet.library.
Im allgemeinen kann man sagen das OS 3.5 stabiler und schneller l&auml;uft als OS 3.x, jedoch ist
man vor einem Systemabsturz nie sicher. 
  <br>
  <br>
  <center>
  <img src="../pic/os35_4.jpg" border="0">
  </center>
  <br>
  <br>
Amiga OS 3.5 erm&ouml;glicht dem User nun auch ins Internet zu gehen. Daf&uuml;r gibt es als TCP/IP
Stack &quot;Miami&quot;, der allerdings derzeit noch auf eine 30 Minuten Version beschr&auml;nkt ist und
in K&uuml;rze ein Patch erh&auml;lt, damit man l&auml;nger surfen kann. Weiterhin gibt es als Browser
AWeb3-2 in einer Special Version und als EMail-Client &quot;AmigaMail&quot;. Auf Miami und AWeb 
brauche ich eigentlich nicht mehr eingehen, doch AmigaMail m&ouml;chte ich Euch kurz vorstellen.
AmigaMail wurde von Christopher E. Aldi f&uuml;r das OS 3.5 geschrieben, es ist kein simpler
EMail-Client, sondern schon ein Programm das man gut nutzen kann. Die Konfiguration
ist relativ leicht und auch der Umgang erkl&auml;rt sich von selbst. Trotzdem hat YAM im Vergleich
zum AmigaMail Programm die Nase wiederum vorn und ist (da es auch noch kostenlos ist) f&uuml;r
eine st&auml;ndige Nutzung mehr zu empfehlen.
<br><br>
Das Upgrade ist mit Sicherheit nach so vielen Jahren sehr empfehlenswert. Allein die
aktualisierten Treiber und die umfangreicheren Men&uuml;s machen die ganze Sache lohnenswert.
Doch leider kann man auf viele Tools trotzdem nicht verzichten. &quot;MagicMenu&quot; oder aber auch
&quot;DOpus Magellan&quot; erleichtern den Umgang ungemein und sollten auch nach der Installation
des Updates wieder ihren weg auf die Festplatte finden. Mit einigen Tools und Patches
gab es aber auch Probleme, die sich anhand eines Systemabsturzes bemerkbar machten. Auch
die Tatsache das der Amiga bei unserem Test ab und zu den Bootvorgang verweigerte, m&ouml;chte
ich hier nicht unerw&auml;hnt lassen. Um Probleme schon im Anfangsstaduim zu vermeiden, sollte
auf jedenfall ein BackUp der wichtigsten Daten angelegt und die Festplatte komplett neu
formatiert werden. Anschlie&szlig;end installiert Ihr das OS3.5 und komplett, also zu erst das
OS3.1 und danach OS3.5, und richtet Eure HD neu ein. Ist vielleicht ein bischen Arbeit,
aber besser als wenn der Rechner immer wieder &Auml;rger macht, weil ein paar Dateien streiken.
<br><br>
Um zu einem Fazit zu kommen schlie&szlig;e ich diesen Test nun ab:)
Ich kann sagen das das Amiga OS 3.5 eine sehr lohnenswerte Investition ist und da es auch
f&uuml;r das Jahr 2000 Problem ger&uuml;stet wurde, k&ouml;nnt Ihr mit diesem Upgrade getrost ins neue
Jahrtausend starten. F&uuml;r schlappe 99,- DM ist das OS 3.5 im Vergleich zu anderen Betriebssystemupgrade`s
(Windows 98 ect.) doch relativ preisg&uuml;nstig.
<br><br>
<br>
<b>Quelle:</b><br>
Amiga International, Inc.<br>
Robert-Bosch-Str. 118<br>
63225 Langen<br>
Deutschland<br>
<br>
Telefon: 06103/587870<br>
Fax: 06103/587888<br>
WWW: <a href="http://www.amiga.de">www.amiga.de</a>
<br>
<br><br>
<center>
<img src="../pic/hr.gif">
</center>
 <br><br>
<B><FONT size="5" FACE="Arial, Helvetica">Hier die komplette Liste aller Features des OS 3.5!</FONT></B>

<BLOCKQUOTE>
	<P><B><FONT FACE="Arial, Helvetica"><BR>
	Einfache Internet-Nutzung</FONT></B><FONT FACE="Arial, Helvetica"><BR>
	<BR>
	TCP/IP Stack</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Unterst&uuml;tzung f&uuml;r Internet und Ethernet</FONT>
		<LI><FONT FACE="Arial, Helvetica">Einfache Einrichtung der Verbindung zu Ihrem Provider innerhalb weniger Minuten
		(automatische Konfiguration der IP-Adresse, Netmasks, DNS Server, W&auml;hlscripte und aller ben&ouml;tigten Informationen)</FONT>
		<LI><FONT FACE="Arial, Helvetica">Unterst&uuml;tzung f&uuml;r mehrere Konfigurationsdateien, z.B. f&uuml;r mehrere
		Internet-Provider</FONT>
		<LI><FONT FACE="Arial, Helvetica">TCP/IP-Protokoll-Stack f&uuml;r PPP, SLIP, INetD und SANA-II</FONT>
		<LI><FONT FACE="Arial, Helvetica">Umfassende PPP-Realisierung mit Unterst&uuml;tzung f&uuml;r PAP und CHAP</FONT>
		<LI><FONT FACE="Arial, Helvetica">Socks v4/5 Client-Module f&uuml;r Firewalls</FONT>
		<LI><FONT FACE="Arial, Helvetica">Erweiterter SANA II Support f&uuml;r schnelle Transferraten</FONT>
		<LI><FONT FACE="Arial, Helvetica">SANA-II R3-Support f&uuml;r neuere Ethernet-Treiber (inklusive optimierter MNI
		Ethernet-Treiber f&uuml;r alle Amiga Zorro-II Ethernet-Karten f&uuml;r schnelleren Datentransfer als mit normalen
		SANA-II-Treibern)</FONT>
		<LI><FONT FACE="Arial, Helvetica">Unterst&uuml;tzung f&uuml;r analoge Modemverbindungen, ISDN-Karten, ISDN TAs,
		PPP, SLIP, Slirp, TIA, ADSL, Kabelmodems (!), Ethernet LANs, Arcnet LANs, parallele Links und verschiedene andere
		Verbindungstypen (inklusive umfangreicher Modem- und ISDN-Datenbank)</FONT>
		<LI><FONT FACE="Arial, Helvetica">Support f&uuml;r DHCP und BootP (wichtig f&uuml;r ADSL und Kabelmodems)</FONT>
		<LI><FONT FACE="Arial, Helvetica">Optionale Verbindungsunterbrechung bei Nichtnutzung oder Aufrechterhaltung auch
		bei Nichtnutzung</FONT>
		<LI><FONT FACE="Arial, Helvetica">Dynamischer DNS-Cache f&uuml;r schnelles Websurfen</FONT>
		<LI><FONT FACE="Arial, Helvetica">Inklusive Fingerd, Identd und Inet</FONT>
		<LI><FONT FACE="Arial, Helvetica">Kompatibel mit Bsdsocket-Library V4</FONT>
		<LI><FONT FACE="Arial, Helvetica">Anpassung an den neuen GUI-Look</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica">WWW-Browser mit Offline/Online Unterst&uuml;tzung</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Anzeigen der HTLM-Dokumentation und von Internet-Seiten</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica">Neue system&uuml;bergreifende E-Mail-Bibliothek</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Allgemeines API zum Senden und Empfangen von E-Mails</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica">Neuer E-Mail-Client</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Nutzt die Eigenschaften der E-Mail-Bibliothek</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica"><BR>
	</FONT><B><FONT FACE="Arial, Helvetica">Unterst&uuml;tzung von Festplatten &gt; 4 GB</FONT></B><FONT FACE="Arial, Helvetica"><BR>
	<BR>
	NSDPatch</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Neuer Standard f&uuml;r 64 Bit Devices</FONT>
		<LI><FONT FACE="Arial, Helvetica">Anpassung der Info-, Format-, Diskcopy-Applikationen und des FastFileSystems</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica">HDToolBox</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Die Low-Level-Bibliothek erledigt folgende Aufgaben</FONT>
		<UL>
			<LI><FONT FACE="Arial, Helvetica">Scannen des SCSI-Busses</FONT>
			<LI><FONT FACE="Arial, Helvetica">Lesen der physikalischen Informationen &uuml;ber die Festplatte</FONT>
			<LI><FONT FACE="Arial, Helvetica">Lesen und Schreiben logischer Informationen (RDBs)</FONT>
			<LI><FONT FACE="Arial, Helvetica">Erzeugen von Mount-Dateien</FONT>
			<LI><FONT FACE="Arial, Helvetica">Lesen spezieller Mount-Eintr&auml;ge zum Wiederherstellen von RDBs</FONT>
		</UL>
		<LI><FONT FACE="Arial, Helvetica">HDToolBox-Anwendung, die die Eigenschaften der Bibliothek nutzt</FONT>
		<UL>
			<LI><FONT FACE="Arial, Helvetica">Anpassung an den neuen GUI-Look</FONT>
		</UL>
	</UL>
	<P><FONT FACE="Arial, Helvetica"><BR>
	</FONT><B><FONT FACE="Arial, Helvetica">Moderne grafische Benutzerschnittstelle (GUI)<BR>
	</FONT></B><FONT FACE="Arial, Helvetica"><BR>
	Neuer Icon-Satz (Glow Icons)</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Neue Icons f&uuml;r alle Systembestandteile</FONT>
		<LI><FONT FACE="Arial, Helvetica">Neue Icons f&uuml;r die meisten Anwendungen</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica">Neue Icon-Bibliothek (icon.library)</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Icons mit bis zu 256 Farben</FONT>
		<LI><FONT FACE="Arial, Helvetica">Automatische Farbanpassung an die aktuelle Farbpalette</FONT>
		<LI><FONT FACE="Arial, Helvetica">NewIcon-kompatibel</FONT>
		<LI><FONT FACE="Arial, Helvetica">Kompatibel zu OS 3.1 Piktogrammen</FONT>
		<LI><FONT FACE="Arial, Helvetica">erweiterte Programmierschnittstelle (API)</FONT>
		<LI><FONT FACE="Arial, Helvetica">Schneller und robuster</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica">Neue BOOPSI-Bibliothek</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Ein kompletter Satz leistungsf&auml;higer BOOPSI-Gadgets</FONT>
		<LI><FONT FACE="Arial, Helvetica">Sehr schnell, modular und skalierbar</FONT>
		<LI><FONT FACE="Arial, Helvetica">AmigaOS-kompatible Integration</FONT>
		<LI><FONT FACE="Arial, Helvetica">Kompatibel zu bestehenden BOOPSI-Klassen</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica">Neue Ressource-Bibliothek</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">L&auml;dt und verwaltet alle Oberfl&auml;chen-Ressourcen</FONT>
		<LI><FONT FACE="Arial, Helvetica">Programmoberfl&auml;chen (GUI) k&ouml;nnen ohne Neukompilation der Applikation
		ge&auml;ndert werden</FONT>
		<LI><FONT FACE="Arial, Helvetica">Die Eigenschaften k&ouml;nnen mit jeder Programmiersprache genutzt werden</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica">Erweiterte und verbesserte Workbench</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">bessere R&uuml;ckmeldung der Benutzerschnittstelle</FONT>
		<LI><FONT FACE="Arial, Helvetica">Verlaufsanzeige f&uuml;r Kopieren/L&ouml;schen</FONT>
		<LI><FONT FACE="Arial, Helvetica">Verbesserte Informationen-Anzeige</FONT>
		<LI><FONT FACE="Arial, Helvetica">Schnellerer Bildaufbau</FONT>
		<LI><FONT FACE="Arial, Helvetica">Erweiterte Tastaturkontrolle</FONT>
		<LI><FONT FACE="Arial, Helvetica">erweiterte Programmierschnittstelle (API)</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica"><BR>
	</FONT><B><FONT FACE="Arial, Helvetica">Umfangreicher CD-ROM Support</FONT></B><FONT FACE="Arial, Helvetica"><BR>
	<BR>
	CacheCDFS</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">ISO9660, RockRidge, Joliet(Win 95/98) und MAC HFS kompatibel</FONT>
		<LI><FONT FACE="Arial, Helvetica">Unterst&uuml;tzt Amiga Protection-Bit und Datei-Kommentare</FONT>
		<LI><FONT FACE="Arial, Helvetica">MultiSession-CD Unterst&uuml;tzung</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica">Neuer CD-Player (PlayCD)</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Programmierbarer Audio-Player f&uuml;r SCSI- und ATAPI-CD-ROM-Ger&auml;te</FONT>
		<LI><FONT FACE="Arial, Helvetica">Geringer Speicherverbrauch</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica">Neue Einsteller f&uuml;r CDFS</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">CacheCDFS-Einstell-Dialog zur &quot;on the fly&quot; Konfiguration.</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica"><BR>
	</FONT><B><FONT FACE="Arial, Helvetica">Drucker-Support</FONT></B><FONT FACE="Arial, Helvetica"><BR>
	<BR>
	Neues Druckertreiber-Konzept</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Treiber f&uuml;r alle g&auml;ngigen Druckermodelle</FONT>
		<LI><FONT FACE="Arial, Helvetica">PowerPC-Unterst&uuml;tzung</FONT>
		<LI><FONT FACE="Arial, Helvetica">Neue Funktionen zum Drucken aller Arten von Bitmaps</FONT>
		<LI><FONT FACE="Arial, Helvetica">Neues API zur korrekten Bestimmung der Seitengr&ouml;&szlig;e und des Seitenumbruchs</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica">Unterst&uuml;tzt 24 Bit Picasso96 DumpRastPort-Kommando</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">TurboPrint spezifische Funktion zum Drucken von 8Bit-Chunky und 16/24Bit-Bitmaps</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica">Neuer Drucker-Einsteller</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Unterst&uuml;tzung der neuen Funktionen</FONT>
		<LI><FONT FACE="Arial, Helvetica">Anpassung an das Aussehen der neuen Benutzeroberfl&auml;che</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica"><BR>
	</FONT><B><FONT FACE="Arial, Helvetica">PowerPC-Support</FONT></B><FONT FACE="Arial, Helvetica"><BR>
	<BR>
	Neue WarpUP PowerPC-Unterst&uuml;tzung</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">AmigaOS-konforme Integration</FONT>
		<LI><FONT FACE="Arial, Helvetica">Umfangreiche Funktionalit&auml;t</FONT>
		<LI><FONT FACE="Arial, Helvetica">Hardware-unabh&auml;ngiges Treiberkonzept daher einfach erweiterbar</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica">Neuer Voreinsteller</FONT></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Einstell-Dialog im Stil der neuen Benutzeroberfl&auml;che</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica"><BR>
	</FONT><B><FONT FACE="Arial, Helvetica">HTML-Online-Dokumentation</FONT></B></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Neue umfassende Beschreibung</FONT>
		<LI><FONT FACE="Arial, Helvetica">&Uuml;berarbeitete Fassung der B&auml;nde Workbench, DOS, ARexx und Festplatten</FONT>
		<LI><FONT FACE="Arial, Helvetica">Erg&auml;nzungen &uuml;ber die neuen Eigenschaften von AmigaOS 3.5</FONT>
		<LI><FONT FACE="Arial, Helvetica">Umfangreich bebildert</FONT>
		<LI><FONT FACE="Arial, Helvetica">Zweisprachig deutsch/englisch</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica"><BR>
	</FONT><B><FONT FACE="Arial, Helvetica">Fehlerbereinigungen</FONT></B></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Korrekturen zur Verbesserung der Robustheit und um lange bekannte Fehler zu beheben</FONT>
		<LI><FONT FACE="Arial, Helvetica">&Uuml;berarbeitete A2024 Monitor-Treiber</FONT>
		<LI><FONT FACE="Arial, Helvetica">&Uuml;berarbeiteter CLI-Befehl (Join, Status und Type)</FONT>
		<LI><FONT FACE="Arial, Helvetica">&Uuml;berarbeiteter IPrefs-Befehl (robuster, bessere Unterst&uuml;tzung der Workbench-Muster)</FONT>
		<LI><FONT FACE="Arial, Helvetica">&Uuml;berarbeiteter LoadWB-Befehl</FONT>
	</UL>
	<P><B><FONT FACE="Arial, Helvetica">Erweiterungen</FONT></B></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">&Uuml;berarbeitete asl.library (besser ansprechbar, schneller, verbesserte Benutzerschnittstelle,
		robuster)</FONT>
		<LI><FONT FACE="Arial, Helvetica">&Uuml;berarbeitete DataTypes</FONT>
		<UL>
			<LI><B><FONT FACE="Arial, Helvetica">8svx.datatype</FONT></B><FONT FACE="Arial, Helvetica"> (unterst&uuml;tzt nun
			die Stereo-Wiedergabe; schneller und robuster)</FONT>
			<LI><B><FONT FACE="Arial, Helvetica">amigaguide.datatype / amigaguide.library</FONT></B><FONT FACE="Arial, Helvetica">
			(schneller, erweiterte Programmierschnittstelle)</FONT>
			<LI><B><FONT FACE="Arial, Helvetica">anim.datatype</FONT></B><FONT FACE="Arial, Helvetica"> (unterst&uuml;tzt nun
			alle wichtigen IFF-ANIM-Formate; robuster)</FONT>
			<LI><B><FONT FACE="Arial, Helvetica">animation.datatype</FONT></B><FONT FACE="Arial, Helvetica"> (unterst&uuml;tzt
			nun die Stereo-Wiedergabe; robuster; erweiterte Programmierschnittstelle; RTG-kompatibel)</FONT>
			<LI><B><FONT FACE="Arial, Helvetica">ascii.datatype</FONT></B><FONT FACE="Arial, Helvetica"> (schneller und robuster)</FONT>
			<LI><B><FONT FACE="Arial, Helvetica">cdxl.datatype</FONT></B><FONT FACE="Arial, Helvetica"> (unterst&uuml;tzt nun
			die Stereo-Wiedergabe; robuster)</FONT>
			<LI><B><FONT FACE="Arial, Helvetica">ilbm.datatype</FONT></B><FONT FACE="Arial, Helvetica"> (unterst&uuml;tzt nun
			24Bit-Echtfarb-Bilder (TrueColor); robuster)</FONT>
			<LI><B><FONT FACE="Arial, Helvetica">picture.datatype</FONT></B><FONT FACE="Arial, Helvetica"> (unterst&uuml;tzt
			nun Echtfarb-Bilder, Dithering und Farbquantisierung; robuster, erweiterte Programmierschnittstelle; RTG-kompatibel)</FONT>
			<LI><B><FONT FACE="Arial, Helvetica">sound.datatype</FONT></B><FONT FACE="Arial, Helvetica"> (unterst&uuml;tzt
			nun die Stereo-Wiedergabe; robuster, erweiterte Programmierschnittstelle)</FONT>
			<LI><B><FONT FACE="Arial, Helvetica">text.datatype</FONT></B><FONT FACE="Arial, Helvetica"> (schneller und robuster)</FONT>
		</UL>
		<LI><FONT FACE="Arial, Helvetica">Neue DataTypes f&uuml;r GIF, JPEG, PNG und AIFF</FONT>
		<LI><FONT FACE="Arial, Helvetica">&Uuml;berarbeitete 68040.library (Verbesserung der Geschwindigkeit)</FONT>
		<LI><FONT FACE="Arial, Helvetica">&Uuml;berarbeitete bullet.library (Verbesserung der Geschwindigkeit)</FONT>
		<LI><FONT FACE="Arial, Helvetica">Neues SCSI Mount-Programm</FONT>
	</UL>
	<P><FONT FACE="Arial, Helvetica"><BR>
	</FONT><B><FONT FACE="Arial, Helvetica">Die Zukunft (Pl&auml;ne und Optionen)</FONT></B></P>
	<UL>
		<LI><FONT FACE="Arial, Helvetica">Weitere Versionen oder Add-On Pakete</FONT>
		<LI><FONT FACE="Arial, Helvetica">Neue komplett &uuml;berarbeitete Kickstart</FONT>
		<LI><FONT FACE="Arial, Helvetica">Erweiterter PowerPC-Support</FONT>
		<LI><FONT FACE="Arial, Helvetica">Neuer 68K-Emulator f&uuml;r reine PPC-Systeme</FONT>
		<LI><FONT FACE="Arial, Helvetica">Viele System-Bibliotheken als PPC-Version</FONT>
	</UL>
  </td>
 </tr>
</table>

</BODY>
</HTML>
