<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Software / Testbericht: fxPaint</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <img src="../pic/fx-logo.jpg">
  </td>
 </tr>
 <tr>
  <td>
   <font size="3" face="arial">
   <br>
Innovative ist in der letzten Zeit ein Garant f&uuml;r gute Software geworden und auch mit
ihrem Programm fxPaint bahnt sich ein neuer Meilenstein an.
<br><br>
fxPaint ist ein Bildbearbeitungsprogramm das f&uuml;r jeden Anwender, ob Profi oder
Anf&auml;nger, angedacht ist. Das Programm erh&auml;lt man auf CD und mu&szlig; auf Festplatte
installiert werden. Nach der Installation wird noch die Seriennummer verlangt
und es kann losgehen. Als erstes f&auml;llt nat&uuml;rlich die tolle grafische Oberfl&auml;che
auf, die mit Farbverl&auml;ufen gl&auml;nzt. fxPaint arbeitet mit mehreren Layern,
das hei&szlig;t in mehreren Ebenen. Da w&auml;re der Bild-Layer, der Zeichen-Layer (8 Bit),
der Alpha-Layer (24 Bit) und der Effekt-Layer. Es wird also durch verschiedene
Kombinationen ein Bild er- bzw. zusammengestellt und bearbeitet. Dies l&auml;&szlig;t f&uuml;r
den Nutzer einen gro&szlig;en Freiraum zu und sorgt f&uuml;r fantastische Ergebnisse. Es ist
aber auch m&ouml;glich Bilder in fxPaint zu Zeichnen, doch in erster Linie ist es
f&uuml;r die Bearbeitung gedacht. Mit &uuml;ber 70 Effekten l&auml;&szlig;t fxPaint kaum W&uuml;nsche
offen, wir haben in unserer kleinen Galerie (ganz unten) Euch schon einmal ein
paar davon bereitgestellt. 
<br><br>
Doch gehen wir noch ein St&uuml;ck zur&uuml;ck. Obwohl fxPaint eine erstklassige Anleitung
im AmigaGuide Format bietet habe ich mir die M&uuml;he gemacht und diese ausgedruckt.
Wer mit AmigaGuide Dokumenten so seine Probleme hat sollte dies ebenfalls tun.
Das knapp 50 Din A4 Seiten umfassende &quot;Handbuch&quot; enth&auml;lt alle wichtigen Informationen,
erkl&auml;rt alle Effekte und Button`s und f&uuml;hrt den Nutzer in die Arbeitsweise des
Programmes ein. F&uuml;r eine schnelle Hilfe wurde eine &quot;Sprechblasen-Hilfe&quot; eingebaut.
<br><br>
Der Bildschirm wurde in mehrere Men&uuml;s unterteilt. In der Toolsbox sind alle
wichtigen Tools und Module untergebracht, wie z.B. die Auswahl des Zeichenwerkzeugs,
der Zauberstab, oder die Wahl des Farb- und Effekt Managers. Am unteren Bildschirmrand
werden alle Grafiken verkleinert angezeigt, die in fxPaint geladen wurden. Am oberen
Rand findet man eine kleine Auswahl verschiedener Optionen, wie Zoom, Fixieren, Laden und
Speichern. F&uuml;r ein genaueres Verst&auml;ndnis, seht Euch bitte dieses <a href="../pic/fx-all.jpg">Bild</a> an.
<br><br>
Hat man ein Bild geladen, kann man einen Alpha Kanal benutzen, der ein weiteres
Bild enth&auml;lt. Das Ausgangsbild sollte immer als Layer definiert werden. &Uuml;berhaupt
mu&szlig; man sich dessen bewu&szlig;t sein, das Ver&auml;nderungen - auch die kleinsten - immer gleich
manuell fixiert werden m&uuml;ssen, da sie ansonsten beim Einsatz eines neuen Pinsels
oder Effektes verloren gehen. Der Nutzer hat auf sehr vieles Einflu&szlig;. Jeder Pinsel,
jeder Effekt kann mit einer eigenen Farbe definiert werden. Auch Textpinsel sind
erstellbar, bisher leider nur einzeilige Textpinsel. Wer es leid ist immer nur
stupide Pinsel zu nutzen, kann diese durch den eigenen Tool-Layer ver&auml;ndern, z.B.
ein Gl&uuml;hen erzeugen, eine Silhouette erstellen oder den Pinsel drehen. Jedes Bild
verf&uuml;gt &uuml;ber einen eigenen fxManager der die einzelen Effekte enth&auml;lt. Unteranderem
kann eine Lichquelle erstellt und durch einen Positionierungsmodus &uuml;berall auf dem
Bild versetzt werden. Man kann eine Welle erstellen, einen Buttonrand einf&uuml;gen,
Spiegeln, Gl&auml;tten, Weichzeichner anwenden, Farbver&auml;nderungen vornehmen (besonders
erw&auml;hnenswert ist die &quot;Anti-Rote-Augen&quot; Funktion, die n&uuml;tzlich ist wenn man Fotos
bearbeiten m&ouml;chte), Verzerrungen (wie Lichtgeschwindigkeit oder Seite knicken),
Matrix Operationen, Rauschen oder Kompositionen nutzen. Es ist hier leider nicht
m&ouml;glich alle der &uuml;ber 70 Effekte aufzuz&auml;hlen und n&auml;her zu erl&auml;utern, doch es gibt
kaum eine Funktion die man vermisst. Durch die &quot;Pyro Plugin`s&quot; ist es nun erstmals 
auch m&ouml;glich Flammen und Explosionen binnen k&uuml;rzester Zeit zu erstellen.
Weiterhin enth&auml;lt fxPaint ein kleines Fotoalbum. In diesem kann man einzelne Bilder
ablegen und hat so eine &Uuml;bersicht &uuml;ber die eigenen Grafiken. Wem &quot;PictureManager&quot;
ein Begriff ist, der wird wissen worum es sich bei dem fxAlbum handelt.
<br><br>
Die Handhabung ist anfangs nicht sehr leicht, doch man ben&ouml;tigt positiverweise wenig Zeit um
sich in das Programm hineinzuarbeiten. Die Button`s erkl&auml;ren sich fast von selbst,
ansonsten gibt es ja noch die erw&auml;hnte &quot;Sprechblasen-Hilfe&quot;. fxPaint l&auml;uft sehr
stabil und st&uuml;rzte nicht einmal w&auml;hrend unserer Testphase ab, die Ergebnisse des
Programmes k&ouml;nnt Ihr teilweise auch auf unserer neuen WebSite bewundern! Felix Schwarz
hat neben einigen Demos anderen Produkte auch ein knapp 220 MB gro&szlig;en Workshop im
AVI Format auf die CD gepresst, der die Erstellung von Feuereffekten aufzeigt.
<br><br>
fxPaint l&auml;uft auf allen AGA Amiga`s mit 020 Prozessor, 6 Mb Ram und 10 MB HD.
Dies ist aber das absolute Minimum! Eine Grafikkarte sollte auf jedenfall vorhanden
sein, empfehlenswert ist weiterhin mindestens 16 MB Ram und ein PPC Prozessor!
<br><br>
<table width="100%" align="center">
 <tr>
  <td><font size"5"><b>Fazit:</b></font><br>
<font size="3">Was einem hier f&uuml;r knapp 140,- DM geboten wird, kann man durchweg als Glanzst&uuml;ck
in der Amiga Software beschreiben. Obwohl sicher noch einige Funktionen fehlen
und ein ausgefeiletes Tutorial f&uuml;r Anf&auml;nger ratsam w&auml;re, so bietet fxPaint in der
Version 1.0 schon ein Menge Features. Wer &uuml;ber einen schnellen Prozessor verf&uuml;gt,
hierbei sollte es sich um mindestens einen 68040, besser 68060+PPC, handeln, und
gerne mit grafischen Anwendungen arbeitet, f&uuml;r den ist fxPaint ein Pflichtkauf!
Mittlerweile ist auch schon ein Update erschienen, das man sich kostenlos downloaden
kann.
  </td>
  <td align="center" width="100">
   <img src="../pic/award.gif">
 </tr>
</table>
<br>
<br>
<b>Quelle</b>:<br>
Innovative<br>
c/o Felix Schwarz<br>
Am Gr&uuml;ndla 3<br>
D-91074 Herzogenaurach<br>
Germany<br>
<br>
EMail: <a href="mailto:info@innovative-web.de">info@innovative-web.de</a><br>
WWW:   <a href="http://www.innovative-web.de/">http://www.innovative-web.de/</a><br>
Phone: +(0)049 (0)9132/3400<br>
<br><br>
    <table width="90%" align="center" border="0">
     <th colspan="3"><font size="5">Effeckte von fxPaint!</font></th>
     <tr>
      <td align="center">
       <img src="../pic/fx-bild.jpg">
      </td>
      <td align="center">
       <img src="../pic/fx-rand.jpg">
      </td>
      <td align="center">
       <img src="../pic/fx-gravur.jpg">
      </td>
     </tr>
     <tr>
      <td align="center">
       <font size="3" face="arial">Originalbild</font>
      </td>
      <td align="center">
      <font size="3" face="arial">Buttonrand</font>
      </td>
      <td align="center">
      <font size="3" face="arial">Eingravieren</font>
      </td>      
     </tr>
     <tr> 
      <td align="center">
       <img src="../pic/fx-mirage.jpg">
      </td>
      <td align="center">
       <img src="../pic/fx-quelle.jpg">
      </td>
      <td align="center">
       <img src="../pic/fx-dr.jpg">
      </td>
     </tr>
     <tr>
      <td align="center">
      <font size="3" face="arial">Mirage</font>
      </td>
      <td align="center">
      <font size="3" face="arial">def. Lichtquelle</font>
      </td>
      <td align="center">
      <font size="3" face="arial">Durchrubbeln</font>
      </td>
     </tr>
    </table>

  </td>
 </tr>
</table>

</BODY>
</HTML>
