<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Spieleteil / Best of Gremlin Testbericht</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<table width=99% align="center"><tr><td>
<br>
<table align="center" border="0">
 <tr>
  <td valign="top" align="center">
   <img src="../pic/gremlin1.jpg">
  </td>
  <td valign="top" align="left">
   <font size="4" face="Arial">
Nicht mehr ganz taufrisch, dennoch interessant ist die &quot;Best of Gremlin&quot; CD,
die vor einigen Wochen erschienen ist. Hierbei handelt es sich um eine von
Islona erstellte CD mit (laut Cover) 25 der besten Spiele die Gremlin gemacht
hat. Ob dem aber wirklich so ist? Wir haben uns die CD-Rom f&uuml;r Euch angeschaut!
</font>
  </td>
 </tr>
</table>
<br><br>
Insgesamt 35 Vollspiele findet der K&auml;ufer auf dieser CD vor, dazu gibt es noch 
einige HD Installerscript f&uuml;r (auch auf der CD nicht enthaltene) Spiele
von Gremlin, ein paar Demos von Spielen, Soundmodule, Anleitungen und einige Tools.
18 Spiele sind sofort startbar, allerdings ben&ouml;tigen manche das Tool &quot;WHDLoad&quot;.
&quot;WHDLoad&quot; ist auf der CD enthalten, lief allerdings relativ unstabil und ist
unregistriert und verweigerte oftmals seinen Dienst. Die restlichen Spiele sind 
entweder als ADF oder DMS Archiv auf die CD gepresst worden und k&ouml;nnen leicht 
entpackt werden, dazu hat man eine grafische Oberfl&auml;che erstellt. Viele Spiele
gibt es sowohl in ECS und in AGA Versionen. Von Litil Divil, Disposable Hero
und Shadow Fighter hat Islona auch noch die CD32 Variante auf die CD gebracht.
Weiterhin enth&auml;lt die CD einen UAE Emulator damit man die CD und deren Spiele
auch auf einem PC nutzen kann.
<br><br>
Die CD enth&auml;lt wirklich eine gro&szlig;e Breite von Spielen, ob Jump`n`run, Simulation,
Rennspiele, Beat`em`ups oder Strategie, hier kann man spielen was man m&ouml;chte.
Und wer schon immer einmal die Titelmelodien auf dem eigenen Player h&ouml;ren wollte, der
kann das nun tun. Die Musikst&uuml;cke sind in MOD, MIDI und SDS vorhanden und ein Player
liegt ebenfalls bei. Die Demos sind kaum erw&auml;hnenswert, da die Vollversionen auf der
CD sind, somit h&auml;tte man sich dieses Verzeichnis auch sparen k&ouml;nnen.

<br><br>
<center><img src="../pic/gremlin2.jpg"></center>
<br><br>

<br><br>
<table align="center" width="99%" border="0">
 <tr>
  <td colspan="3" bgcolor="#ffffff" align="center">
   <font size="3" color="#ff2166">
    Die Best of Gremlin CD enth&auml;lt folgende Spiele
   </font>
  </td>
 </tr>
 <tr>
  <td valign="top" align="center">
   <img src="../pic/gremlin3.jpg">
  </td>
  <td valign="top" align="left">
   <font size="2" face="Arial">
Artura<br>
Butcherhill<br>
BSS Jane Seymore<br>
Dark Fusion<br>
Deflektor<br>
Disposable Hero<br>
F.O.F.T.<br>
H.A.T.E.<br>
Harlequin<br>
Impossamole<br>
K240<br>
Litil Divil<br>
Motor Masscare<br>
Pegasus<br>
Plan 9 from Outer Space<br>
Premier Manager <br>
Premier Manager 2<br>
Premier Manager 3<br>
Shadow Fighter<br>
Skidz<br>
Super Cars <br>
Super Cars 2<br>
Suspicious Cargo<br>
Switchblade<br>
Switchblade 2<br>
  </td>
  <td valign="top" align="left">
   <font size="2" face="Arial">
Super Scrambe Simulator<br>
TechnoCop<br>
Top Gear 2<br>
Utopia<br>
Vampires Empire<br>
Venus Flytrap<br>
Video Kid<br>
Zool <br>
Zool 2<br>
  </td>
 </tr>
</table>
<br>
<br>
<font size="5" face="arial">
<b>Fazit:</b>
<font size="3" face="arial">
Obwohl es eine gute Idee war, scheitert es etwas an der Umsetzung! Einige
Diskarchive haben Pr&uuml;fsummen- oder Schreib-/Lesefehler so da&szlig; die Spiele
nicht funktionieren. Das die Spiele auf der CD gekrackt sind und die 
Anleitungen in trostlose Amiga Guide Dateien umgewandelt wurden, teilweise
sogar nur URL Verweise da stehen, ist wahrscheinlich eine Ansichtsache, kann
aber nicht als positiv gewertet werden. Unverst&auml;ndlich ist, da&szlig; auf einer
&quot;Best of&quot; CD der Schmiede Gremlin wirkliche Knaller wie zum Beispiel die 
&quot;Lotus Triologie&quot; fehlen. Das mindestens 30% der Spiele nicht startbar waren,
sondern immer nur eine flackernde LED-Anzeige zum Vorschein kam, sollte nicht
unerw&auml;hnt bleiben. Um zu einem Ende zu kommen, die &quot;Best of Gremlin&quot; enth&auml;lt
einige wirklich gute Spiele, wie Zool 1+2, K240, Premier Manager 1-3 oder
Litil Divil, die ihr Geld durchaus wert sind, jedoch nerven die regelm&auml;&szlig;igen 
Systemabst&uuml;rze mit &quot;WHDLoad&quot; und die Tatsache, da&szlig; einige gerade alte Spiele, 
wie TechnoCop, einen Fehler haben.</font>
<br>
<br>
Quelle: <a href="http://www.kdh-datentechnik.com">KDH Datentechnik</a>
<br><br>
</td>
</tr>
</table>
</BODY>
</HTML>
