<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Spieleteil / Vorschau: Codename:HellSquad</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<table width=99% align="center"><tr><td>
<br>
<center><img src="../pic/hell1.jpg"></center>
<br><br>
Nach ihrem ersten Hit &quot;Wasted Dreams&quot; werkelt Digital Dreams Entertainment
schon flei&szlig;ig am n&auml;chsten Acton-Adventure. Ihr neustes Werk hei&szlig;t &quot;Codename:
Hell Squad&quot; und soll Ende 1999 in die L&auml;den kommen. F&uuml;r einen kleinen 
Vorgeschmack sorgt das bereits erh&auml;ltliche Demo - wir haben es f&uuml;r Sie einmal
angetestet.
<br><br>
<center><img src="../pic/hell2.gif"></center>
<br><br>
Ihre Aufgabe ist es, ein Team von 4 Soldaten zu f&uuml;hren und diese in Sicherheit
zu bringen. Eigentlich sollten Sie als Rettungstrupp agieren, jedoch wurden Sie &uuml;ber
feindlichem Gebiet abgeschossen und m&uuml;ssen nun selber um`s &Uuml;berleben k&auml;mpfen.
Ausger&uuml;stet mit einem Gewehr ist es nun Ihre Aufgabe aus den F&auml;ngen des Feindes
zu entkommen. Das ganze Spiel ist eine Mischung aus knallharter Action und 
Adventure. Es gilt mit Logik, Geschick, etwas Gl&uuml;ck und Einfallsreichtum in
diesem Abenteuer zu bestehen. Sie befinden sich mit 3 weiteren Leuten an
einem See, und &uuml;berpr&uuml;fen ersteinmal die Lage. Keine Feinde in Sicht, doch 
allerlei n&uuml;tzliche Utensilien gibt es und diese nehmen Sie sofort an sich.
Anschlie&szlig;end erkunden Sie die n&auml;here Umgebung und sofort treffen Sie auf 
ungebetene G&auml;ste und m&uuml;ssen diese eleminieren. Schon im Demo haben Sie mit
einigen kniffigen R&auml;tseln fertigzuwerden. Wie bei jedem Adventure, so gilt auch
hier, jeder verbirgt irgendetwas und so wird einfach alles durchsucht.
<br><br>
<center><img src="../pic/hell3.gif"></center>
<br><br>
Die Story ist sehr interessant und kann schnell fesseln, gerade weil man in
vielen Situationen bestehen mu&szlig; und die Aufgaben sehr abwechslungsreich gestellt
werden. Leider bleibt die Grafik bis jetzt auf der Strecke und man merkt 
schnell, da&szlig; dieses Spiel f&uuml;r ECS Amiga`s ausgelegt ist. Die Backgrounds sind
laut Hersteller komplett hangezeichnet worden, weisen ein geringes Spektrum an
Farben auf und sehen sehr grob aus. Die Animationen der Figuren k&ouml;nnen zwar 
gefallen, jedoch sind auch diese viel zu grobpixelig ausgefallen. Der Spielflu&szlig;
ist jetzt schon recht schnell, der Held rennt und l&auml;uft durch die verschiedenen
Screens, wobei auch Bewegungen in die Tiefe des Bildschirmes nichts ungew&ouml;hnliches.
<br><br>
<center><img src="../pic/hell4.gif"></center>
<br><br>
Bis jetzt kann &quot;Codename: Hell Squad&quot; in Bezug auf Gameplay und Story wirklich 
&uuml;berzeugen, die Grafik und der Sound sind allerdings nicht sehr atemberaubend
und sollten &uuml;berarbeitet werden. Das die Kollisionsabfrage &uuml;berhaupt nicht stimmt
sollte wir auch nicht verschweigen, so treffen Sie Ihren Feinde, obwohl diser sich
keineswegs in Ihrer Schu&szlig;linie befindet. Ist zwar n&uuml;tzlich, aber nicht gerade 
professionell. Ben&ouml;tigt wird f&uuml;r &quot;Codename: Hell Squad&quot; ein ECS/AGA Amiga mit
3 MB Ram, Festplatte und CD Laufwerk, Grafikkarten werden bis dato nicht unterst&uuml;tzt.
<br><br>
<center><img src="../pic/hell5.gif"></center>
<br><br>
Doch nicht so ganz neu???
<br><br>
Vor 3 Jahren arbeitete Vulcan Software an einem Spiel namens &quot;Hell Pigs&quot;, welches
1997 auf den Markt kommen sollte. Dieses Spiel war aufgrund dessen gewalt&auml;tigen Inhaltes
eher f&uuml;r &auml;ltere Spieler gedacht. Leider ist dieses Spiel nie erschienen, bis jetzt!?
Ist es Zufall das in &quot;Hell Squad&quot; die selben Screenshots wiederzufinden sind, die
damals in der Presse von &quot;Hell Pigs&quot; zu sehen waren? Bekannt ist uns nicht, ob DDE
die Arbeit von Vulcan fortsetzt, lobenswert ist es aber allemal. Warten wir also
auf das Endprodukt das bei Redaktionsschlu&szlig; fertig sein d&uuml;rfte.
<br><br>
</td>
</tr>
</table>
</BODY>
</HTML>
