<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Editorial</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center><table width=99%><tr><td>

<center><img src="../pic/atlogo.gif" alt="Amiga Times">
<br><img src="../pic/hr.gif">
<br>
<br>
<table border="0" width="100%">
 <tr>
  <td align="center">
   <font size="8">Ausgabe 4/99</font>
  </td>
 </tr>
</table>
<br>
<br>
<table border="0" width="100%">
 <tr>
  <td valign="top" width="50%" align="left">
   <font size="6">E<font size="3">in donnerndes Hallo an all` unsere Leser!!!
   Wir sind wieder da und viele EMails in unserer Abwesenheit haben uns gezeigt, da&szlig;
   man uns auch vermisst hat:) Ja und diese Leser m&ouml;chten wir nat&uuml;rlich auch nicht
   entt&auml;uschen. Wie Ihr seht haben wir uns auch ein neues Layout einfallen lassen, wir
   hoffen damit Euren hohen Geschmack zu treffen. Ja es sind auch allerlei Rubriken weggefallen
   und hier ist der Knackpunkt, wir m&ouml;chten 100%ig weitermachen, doch scheint es bei der
   derzeitigen Marktlage unm&ouml;glich alle Rubriken, die wir einst hatten, sinnvoll mit Beitr&auml;gen
   zu f&uuml;llen. Aus diesem Grund haben wir uns dazu entschieden, weniger Rubriken zu bringen,
   was sicher auch in Eurem Sinne ist. Alle Artikel die in keine richtige Sparte passen, erscheinen
   k&uuml;nftig im "Rubrik" Bereich der Amiga Times.<br>
   <br>
   <br>
   <font size="6">W<font size="3">ie gewohnt erscheint die Amiga Times weiterhin alle zwei Monate,
   jeweils zum 1. des Monats. Ob eine Ausgabe voll wird oder nicht, da&szlig; h&auml;ngt auch viel
   von der Marktlage ab und was wir so an Software bekommen - das ist der unangenehme Nebeneffeckt.
   Doch da wir die Amiga Times erhalten wollen, gehen wir diesen Kompromiss ein und hoffen auf Eurer
   Verst&auml;ndniss, es lohnt einfach nicht wegen 2 Produkten eine Ausgabe wochenlang 
   hinauszuz&ouml;gern. F&uuml;r Eure Mitarbeit sind wir sehr dankbar, also scheut Euch nicht und
   macht bei uns mit!!!!
   </font>
  </td>
  <td width="10">
  </td>
  <td valign="top" align="left" width="50%">
   <font size="6">I<font size="3">n der aktuellen Ausgabe haben wir relativ
   viele Testberichte f&uuml;r Euch in Petto, auch einige die nur auf unser "Entertainment WebSite" waren und
   dadurch vielleicht nicht allen bekannt sind. Ganz aktuell ist nat&uuml;rlich der <i>Amiga OS 3.5 </i> Test,
   wie auch die Vorstellung des neuen Grafikwunder`s <i>fxPaint </i> von Felix Schwarz. 
   <br><br>
   An neuen Spielen stellen wir Euch unteranderem die Wirtschaftsimulation von APC &amp; TCP <i>SeaSide </i>
   vor. Weiterhin haben wir uns ein Preview zum neuen Action Adventure <i> Hell Squad </i> von Digital Dreams 
   Entertainment angesehen und berichten Euch noch &uuml;ber einige Sammel CD-Rom`s.
   <br>
   <br>
   <font size="6">D<font size="3">as ist aber noch nicht alles, seht jedoch selbst. Wir w&uuml;nschen Euch
   noch viel Spa&szlig; und gute Unterhaltung mit unserer neusten Ausgabe und wir lesen uns am 1. Februar
   im Jahr 2000 wieder! Euch allen w&uuml;nschen wir auch noch ein frohes und erholsames Weihnachtsfest
   und eine tolle Feier ins neue <b>Millenium !!!!</b>
   <br><br>
   <font size="6">I<font size="3">n K&uuml;rze sind wir unter folgender neuer URL
   im Internet zu finden, &auml;ndert also bitte Eure Bookmarks. Demn&auml;chst gibt es
   die Amiga Times hier: <a href="http://www.amigatimes.de">www.amigatimes.de</a>!
   <br><br>
   <table width="50%" align="center">
    <tr>
     <td align="left">
      <font size="3">Euer Mario Nitschke</font><br>
      <font size="1">Chefredakteur</font>
     </td>
    </tr>
    <tr>
     <td align="right">
      <a href="aktuell.html"><img src="../pic/r.gif" border="0"></a>
     </td>
    </tr>
   </table>
   </font>
  </td>
 </tr>
</table>
<br>
<img src="../pic/hr.gif">
<br><br>
<font size="2">Copyright by Amiga Times - <a href="impressum.html">Impressum</a></font>
</td>
</tr>
</table>
<br>
</BODY>
</HTML>
