<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Spieleteil / Great Nations Preview</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center><table width=80%><tr><td>
<center><img src="../pic/gn_logo.gif">
<br><br>
<font size="6">Preview Test</font></center>
<br><br>
<font size="3">Es ist immer wieder erstaunlich was noch so alles im Spielebereich des
Amiga`s geschieht. Die Zeit in der Spiele f&uuml;r den Amiga so rar waren, wie
Wasser in der W&uuml;ste haben wir anscheinend &uuml;berwunden. Einer Ank&uuml;ndigung
folgt die n&auml;chste und immer wieder erscheinen neue Demos zu 
vielversprechenden Spielen. Obwohl mehr als ein Drittel der neuen Software 
3D-Shooter oder Weltraumsimulationen darstellen, werden auch immer mehr
Strategiespiele entwickelt.
<br><br>
<center><img src="../pic/gn_screen1.jpg"></center>
<br><br>
Wer kennt nicht die Sid Meier Spiele &quot;Civilization&quot; (1992) oder &quot;Colonization&quot;
(1995), die tagelang an den Bildschirm fesselten und auch noch heute begeistern.
&quot;Great Nations&quot; kann man eigentlich als einen Clone der beiden erw&auml;hnten Spiele
bezeichnen, denn viele Details erinnern daran. Great Nations ist ein
Multiplayer Strategiespiel, bei dem bis zu 8 Nationen gegeneinander
antreten k&ouml;nnen, nat&uuml;rlich kann man auch allein seine Nation zu Rum und
Ehre f&uuml;hren. Anfangs besteht die M&ouml;glichkeit, Nation und Herrscher 
auszuw&auml;hlen, ist dies getan, wird nach dem Rundenprinzip das Spiel 
fortgesetzt. Als Spieler befindet man sich nach dem Start schon auf dem 
Neuen Land, jedoch irgendwo in der Botanik und man wei&szlig; nicht, was einen
erwartet. Als Colonist k&ouml;nnen Sie das Land erkunden, St&auml;dte bauen, 
Stra&szlig;enverbindungen herstellen, oder Naturressourcen aussch&ouml;pfen. Ob Gold, 
Eisen, Diamanten oder aber B&uuml;ffel, Rehe und andere Tiere, da&szlig; Land ist 
voll von Rohstoffen und Lebewesen. Ist die erste Stadt errichtet, kann 
man neue Bauauftr&auml;ge geben, hierbei wird aber kein Geld ben&ouml;tigt, sondern
eine bestimmte Anzahl von Runden mu&szlig; vergehen, bis ein Geb&auml;ude oder eine
Einheit entstanden ist. St&auml;dte bringen nach einiger Zeit automatisch neue
Einheiten hervor, hierzu sollte Sie als Herrscher aber die Stadt von Kriegern
sch&uuml;tzen lassen, damit sie sich gut entwickelt. Das Preview ist schon sehr 
vielseitig, man kann riesige Landteile erforschen, Fremde St&auml;mme treffen, 
die sich einem anschlie&szlig;en oder mit Feinden K&auml;mpfe austragen. Ja selbst 
Kannibalen k&ouml;nnen sich Ihrer Einheiten bem&auml;chtigen. Umfangreiche Tips und
Infos zu den Einheiten und Geb&auml;uden gibt es &uuml;ber ein eigenes Men&uuml; und so
hat man sich binnen k&uuml;rzester Zeit in &quot;Great Nations&quot; eingearbeitet.</font>
<br><br>
<center><img src="../pic/gn_screen2.jpg"></center>
<br><br>
<font size="5">Der erste Eindruck:</font>
<br><br>
<font size="3">Sieht man einmal von den 15 Minuten Wartezeit beim allerersten Start des
Spieles (Sie sollten sofort nachher &quot;Speichern&quot;) und dem relativ langsamen
Bildschirmwechsel und Spielflu&szlig; ab, so macht &quot;Great Nations&quot; viel Spa&szlig;. Ob
das daran liegt, da&szlig; im Vergleich zu Civilization bzw. Colonization 
Bildschirmaufbau, Men&uuml;f&uuml;hrung, Steuerung und Grafik fast identlisch gehalten
wurden und somit eingefleischte Spieler keinerlei Probleme haben werden?
Mit Sicherheit ist dies der Hauptgrund f&uuml;r schnell aufkommende Motivation!
Die Grafik ist dagegen nicht gerade atemberaubend, doch f&uuml;r ein Spiel solchen 
Genres ausreichend. Sound gibt es derzeit noch nicht, jedoch kann man schon 
&uuml;ber das Internet mit anderen Usern spielen. Das f&uuml;r einen A1200 mit AGA, 
Festplatte und 6 MB Ram ausgelegte &quot;Great Nations&quot; wird hoffentlich nocheinmal
in Sachen Spielflu&szlig; und Geschwindigkeit &uuml;berarbeitet, denn selbst mit 030/50 Mhz
Prozessor und 20 MB Ram, wie auch Grafikkarte, kann von einem schnellen und 
komfortablen &quot;Welterobern&quot; im Moment noch nicht die Rede sein. Wenn dieses 
Manko ausgebessert wird, so erwartet uns hier ein wirklich guter Civilization
Clone oder inoffizieller Nachfolger, wie man es gern nennen m&ouml;chte, den man 
nicht verpassen sollte. Das vollst&auml;ndige Spiel wird weiterhin unmengen an 
Land und den verschiedensten Einheiten bieten (abh&auml;ngig ist dies von dem 
vorhandenen Speicherplatz Ihres Amiga`s!), realistische Grafiken und ein 
Terraineditor sind f&uuml;r die Endversion ebenfalls vorgesehen. &quot;Great Nations&quot; 
wird als Shareware Produkt auf den Markt kommen und die Registrierung soll um
die 40,- DM kosten.</font><br>
<br>

</td>
</tr>
</table>

</BODY>
</HTML>
