<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Spieleteil / SeaSide Testbericht</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<table width=99% align="center"><tr><td>
<br>
<center><img src="../pic/seaside.jpg"></center>
<br><br>
SeaSide erhalten Sie auf CD-Rom und kann entweder direkt von dem Silberling gespielt
oder auf Festplatte installiert werden. Wenn Sie von CD spielen, sollten Sie vorher
die Fonts von der CD (befinden sich in dem gleichnamigen Unterverzeichnis!) auf die
Workbench kopieren, um sp&auml;tere Schriftfehler im Spiel zu vermeiden.
<br><br>
Um was geht es bei SeaSide? Mit etwas Geld und dem Willen zum gro&szlig;en Manager zu werden,
haben Sie die Aufgabe Ferienh&auml;user zu bauen und diese an Urlauber zu vermieten. 
Das Spielziel ist somit schon erkl&auml;rt, doch SeaSide erweist sich als &auml;u&szlig;erst komplex.
Sie m&uuml;ssen n&auml;mlich von Null anfangen, das hei&szlig;t Sie m&uuml;ssen als erstes ein Grundst&uuml;ck
erwerben. Anschlie&szlig;end gilt es ein Haus darauf zu bauen, hier haben Sie insgesamt 14
verschiedene H&auml;user zur Auswahl. Ob das kleine Haus am Meer oder eine Prachtvilla,
m&ouml;glich ist alles solange Sie genug Geld haben. Wenn Sie nun ein Haus ihr eigen nennen,
m&uuml;ssen Sie dies auch einrichten, so k&ouml;nnen Sie das Bad, das Wohnzimmer, das Schlafzimmer
und die K&uuml;che f&uuml;r jedes Ihrer H&auml;user selbst bestimmen. Ist auch das Haus fertig, kommt
noch schnell eine Werbeanzeige in eine Tageszeitung und schon kann der Spa&szlig; beginnen.
Doch als Hausbesitzer m&uuml;ssen Sie vorsorgen, Versicherungen abschlie&szlig;en, wie auch 
Reparaturen erledigen. Damit das Geld in Str&ouml;men flie&szlig;t, sollte auch Ihr Freizeitangebot
stimmen und so haben Sie die Chance durch Eisdielen, Imbi&szlig;e oder Kioske weiterhin
Gewinn zu erzielen. Doch diese m&uuml;ssen auch t&auml;glich mit Waren, wie Eis, Pommes, Wurst,
Luftmatrazen, B&auml;llen oder Ansichtskarten, versorgt werden, da&szlig; d&uuml;rfen Sie nicht 
vergessen. Wenn ersteinmal einwenig Einnahmen da sind, k&ouml;nnen Sie auch weitere 
Grundst&uuml;cke erwerben, Str&auml;nde anlegen oder Gew&auml;sser bewirtschaften. Die Anzahl der 
Grundst&uuml;cke ist schier unendlich, Sie m&uuml;ssen eben nur genug Geld haben. 
<br><br>
<center><img src="../pic/seaside1.jpg"></center>
<br><br>
SeaSide bietet drei verschiedene Schwierigkeitsgrade, die sich grob gesagt dadurch
unterscheiden, da&szlig; Sie mit unterschiedlichen Geldbetr&auml;gen starten. Falls der Zaster
nicht reichen sollte, k&ouml;nnen Sie bei einer Bank, zu einem mehr oder weniger guten 
Zinssatz, einen Kredit aufnehmen. Gespielt wird im Rundenprinzip, haben Sie alle
Ihre Aufgaben get&auml;tigt, geht es ins wohlverdiente Wochenende. Sie erhalten dann den
Wochenbericht mit Ausgaben und Einnahmen und beginnen danach die n&auml;chste Runde.
Wie bei vielen anderen Wirtschaftsimulationen erhalten Sie die Tageszeitung, die
Sie &uuml;ber wichtige Dinge informiert. Leider kann man diese Zeitung auch verfluchen,
da&szlig; sie meist nur schlechte Neuigkeiten berichtet, wie Unwetter, Lieferverz&uuml;ge bei
H&auml;ndlern oder starke Preisabf&auml;lle von Produkten, an denen Sie sich dann anpassen
m&uuml;ssen. Das Spiel ist in drei Saison`s eingeteilt, Saison &quot;A&quot;, &quot;B&quot; und &quot;C&quot; die &uuml;ber das
ganze Jahr verteilt sind. Hierbei wurde auch die Haupturlaubszeit im Sommer in 
Betracht gezogen und Sie sollten da als Manager reagieren, die Preise h&uuml;bsch 
erh&ouml;hen und f&uuml;r eine klingelnde Kasse sorgen. Jede Saison kann einzeln mit einem
Preis versehen werden, behalten Sie auch im Auge, welche H&auml;user Sie zu welchen
Konditionen vermieten, es ist nicht empfehlenswert ein Prachthaus unter seinem
Wert zu vermieten, da sonst die Unkosten gr&ouml;&szlig;er sind als die Einnahmen. Experimentieren
Sie ruhig ein wenig herum, beginnen Sie notfalls eine erneute Karriere als Manager,
denn Sie werden mit jedem neuen Versuch um Erfahrung reicher. Und wer mal etwas
Abwechslung ben&ouml;tigt, kann eine Runde &quot;PacMan&quot; auf dem B&uuml;rocomputer spielen -
nette Idee.
<br><br>
<center><img src="../pic/seaside2.jpg"></center>
<br><br>
Das Gameplay ist relativ einfach, mit der Maus werden die jeweiligen Men&uuml;s 
ausgew&auml;hlt und mit der Tastatur Preise eingetragen.
Ihr B&uuml;ro stellt die Zentrale dar, von hier aus k&ouml;nnen Sie ihren Computer nutzen 
um Bestellungen aufzugeben, Grundst&uuml;cke zu erwerben, Versicherungen abzuschlie&szlig;en,
Werbeauftr&auml;ge aufzugeben, Statistiken zu begutachten, H&auml;user einzurichten und 
zu reparieren oder sogar wieder zu verkaufen. Die Steuerung ist schnell erlernt
und gut durchdacht worden und es sind keine &uuml;berfl&uuml;ssigen Button`s zu dr&uuml;cken.
Grafisch bietet SeaSide entweder komplett gerenderte Men&uuml;`s und Grafiken oder
normale AGA Grafikkost. Sch&ouml;n gestaltet wurden die H&auml;user, sowie deren Einrichtungen.
Insgesamt 3 verschiedene Musikst&uuml;cke tr&auml;llern im Hintergrund vor sich hin und 
untermalen positiv das Spiel, wer darauf aber verzichten m&ouml;chte, kann die Musik 
auch abstellen. Ansonsten zeigt sich SeaSide weniger aufwenig, hier hat man mehr
auf das Gameplay geachtet als &uuml;berfl&uuml;ssigen grafischen oder musikalischen 
SchnickSchnack einzubauen. SeaSide unterst&uuml;tzt Grafikkarten und ben&ouml;tigt einen 
AGA Amiga mit 6 MB Ram, Festplatte (f&uuml;r Spielst&auml;nde) und ein CD-Laufwerk.
<br><br>
<table width="90%" align="center">
 <tr>
  <td align="center">
   <img src="../pic/seasidek1.jpg">
  </td>
  <td align="center">
   <img src="../pic/seasidek2.jpg">
  </td>
 </tr>
</table>
<br><br>
Fazit:
<br><br>
SeaSide ist eine gute Wirtschaftsimulation, die sich aber nicht aus der Masse
hervorhebt. Ab einer bestimmten Spielzeit verliert man etwas an Motivation, da
es nichts Neues mehr gibt. Die Tatsache, da&szlig; man sehr lange spielen mu&szlig; um gro&szlig;e
Geldbetr&auml;ge zu ergattern und man die erste Zeit nur minimale Gewinne erziehlt,
f&uuml;hrt dazu das es schnell langweilig werden kann. Leider fehlt eine Art Tutorial
das Sie besser in das Spielgeschehen einf&uuml;hrt und Ihnen ein paar Tips gibt, wie Sie
anfangs vorgehen sollten um ein erfolgreicher Manager zu werden. F&uuml;r Fans von 
Wirtschaftssimulationen ist SeaSide sicherliche eine willkommene Abwechslung, 
f&uuml;r Neueinsteiger des Genre`s dagegen ist SeaSide weniger zu empfehlen. 
<br><br><br>
Quelle:<br>
<br>
APC&amp;TCP<br>
Andreas Magerl<br>
Postfach 83<br>
D-83236 &Uuml;bersee<br>
Fax: 08642/895004<br>
<a href="mailto:Andreas@chiemgau.baynet.de">Andreas@chiemgau.baynet.de</a><br>

</td></tr></table>
</BODY>
</HTML>
