<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Fun &amp; Talk / Das war die ASM</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center><table width=90%><tr><td>
<br>
<center><font size="6">Das war das ASM Magazin...</font></center><br>
<br>
<i>von Mathias Neumann</i><br><br> 
Die ASM
<br><br>
Die ASM was DAS Kult-Magazin der fr&uuml;hen 90er. Das hatte einen einfachen Grund:
Es war das erste Magazin, welches die Begriffe Computer, Spiel und Spa&szlig;
zusammenbrachte. Fr&uuml;her in den 80ern waren Computer eigentlich noch ernste
Maschinen, die man nur in Gro&szlig;raumb&uuml;ros vorfand. Und so sahen auch alle
derzeitigen Computermagazine aus. Stocksteif, ohne Bilder und voll mit kryptischen
Programmlisten zum selberabtippen. Einige Firmen begannen aber irgendwann f&uuml;r
das gemeine Volk auch kleinere Bin&auml;rmaschinen auf den Markt zu bringen.
Sogenannte Heimcomputer. Diese Dinger konnten so gut wie nix, kosteten ein Ver-
m&ouml;gen und waren eigentlich nur als bessere Schreibmaschine oder als gr&ouml;&szlig;erer
Taschenrechner gedacht. Wenn man digital spielen wollte, ging man in die Arcade
und verkloppte dort sein Silbergeld bei Pacman, Phoenix und Donkey Kong. Oder
man kaufte sich ein Telespiel, wie das ber&uuml;chtige ATARI VCS oder das COLECO-
VISION.
<br><br>
Irgendwann war die Zeit der Telespiele einfach vorbei und immer mehr Kids
kauften sich den ersten Kultcomputer f&uuml;r zu Hause, den C64 von Commodore. Viele
Spielehersteller schwangen auch um und programmierten jetzt Spiele f&uuml;r
Heimcomputer. Doch eines hatten sie nicht bedacht. Jeder Besitzer eines
Heimcomputer hatte auch die M&ouml;glichkeit mit dem Ding selber zu programmieren.
Und so crackten viele Kids, statt Hausaufgaben zu machen, damals die kommerziell
produzierten Spiele und &uuml;berschwemmten den Markt mit Gratis-Raubkopien. Es
war eine chaotische Zeit. Viele Firmen gingen Pleite, andere wurden steinreich und
viele Computerfreaks wurden richtige Stars. Hacker, Cracker und Lamer bestimmten
pl&ouml;tzlich die Welt der Heimcomputer. Eine neue Szene war geboren.
<br><br>
Und in dieser Zeit kam ein Kerl namens Manfred Kleimann auf die Idee, ein Magazin
zu ver&ouml;ffentlichen, in dem Computerspiele auf ihren spielerischen Gehalt getestet
werden sollten. Passend sollte das Blatt &quot;Aktueller Software Markt&quot; hei&szlig;en und
wurde der Einfachheit halber dann auf &quot;ASM&quot; abgek&uuml;rzt. Manni konnte Axel Gred&eacute;
schnell &uuml;berzeugen, das Magazin im Tronic-Verlag zu ver&ouml;ffentlichen. So startete die
ASM mit chaotischen Layout, billigen Papier und erstmal alle zwei Monate am Kiosk.
Sie wurde zum erfolgreichsten Computerspiel-Magazin und war das Sprachrohr der
damaligen Computerfreak-Szene.
<br><br>
Die ASM hatte drei Zeitalter, die ich mal, nach den Namen der damaligen
Chefredakteure, einfach Manni-, Mats- und Peter-&Auml;ra nennen will. Die Manni-&Auml;ra
war die Pionierzeit und endete in der goldenen Zeit der ASM. Die
Mats-&Auml;ra war die Zeit der coolen ASM und der sinkenden Auflage. Die Peter-&Auml;ra war
die Zeit vom Spa&szlig;magazin und dem Niedergang der ASM. Schlie&szlig;lich gab es noch
das Nachfolgemagazin PC SPIEL, welches nie auch nur ann&auml;hernd den Erfolg der
ASM erreichte und das mit der Konkursschlie&szlig;ung des Tronic-Verlags eingestellt
wurde.
<br><br>
Viele der heute erscheinenden Computerspiel-Magazine ahmen die
Grundkonzepte der ASM von Bewertung, Feedback, Hit bis Flop nach und verkaufen
sich traumhaft. Dennoch: Die Szene hat sich gewandelt. Heute ist es f&uuml;r ein
Computermagazin unerl&auml;&szlig;lich, mindestens zwei CDs auf dem Cover kleben zu
haben und die Buchstaben PC im Titel zu f&uuml;hren. Wird heute doch auch ein viel
breiteres Publikum als die damalige Crackerszene angesprochen.
<br><br>
W&uuml;rde sich die  ASM heutzutage noch verkaufen? Ich denke mal, sie m&uuml;&szlig;te sich
auf dem knallharten Printmedien-Markt der erfolgreichen Konkurrenz inhaltlich
anpassen und w&auml;re dementsprechend nicht mehr unbedingt das Magazin, das wir
damals lieben lernten.  Auch war es ja eigentlich nicht das Magazin, da&szlig; so
kultig war, sondern die Menschen, die es machten. Haupts&auml;chlich auch die Leser
selbst, mit ihren ellenlangen, verr&uuml;ckten Leserbriefen, die in der ASM auf
bis zu 16 Seiten Feedback abgedruckt wurden. Sie waren zusammen mit der
Redaktion das Herz und die Seele der ASM. Und ohne sie ist auch ein Aktuelles
Software Magazin nichts wert.
<br><br>
So bleibt die ASM in unserer Erinnerung ein Kult, der f&uuml;r den Zeitgeist
steht, welchen wir einmal lebten.
<br>
</td>
</tr>
</table>

</BODY>
</HTML>
