<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Fun &amp; Talk / Petro Tyschtschenko bei AR zu Gast</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center><table width=90%><tr><td>
<br>
<center><font size="6">AR Party Bericht</font></center><br>
<br>
<font size="4">Allgemeines</font><br>
<br>
<font size="3">Die Amiga-Revolution (kurz AR) wurde 1997 von Jack Miller ins Leben
gerufen. Mehr und mehr User verschiedener Computersysteme wie Linux, Mac, Atari
und vor allem nat&uuml;rlich Amiga haben sich haben sich seitdem angeschlossen
mit dem Ziel, die Welt zu verbessern. Im Vordergrund steht dabei die
Bek&auml;mpfung der derzeitigen Verh&auml;ltnisse auf dem Computermarkt, wie z.B. die durch
zweifelhafte Praktiken erlangte Monopolstellung von Microsoft.
Angestrebt ist ein freier Computermarkt mit ebenso freiem Wettbewerb auf dem
Softwarebereich. An oberster Stelle steht dabei die Gewaltlosigkeit aller Aktionen und
&Auml;u&szlig;erungen der AR. Wir zeigen konkrete L&ouml;sungsvorschl&auml;ge auf, um den
jetzt schon begehbaren Weg in die freie Welt zu finden, sprich wir stellen
Alternativsysteme vor, bieten Hilfe auf allen Bereichen der Anwendung,
informieren &uuml;ber Bezugswege und Nutzungsm&ouml;glichkeiten. Durch den Aufruf
zum totalen Boykott auf allen Bereichen wollen wir zudem Microsoft-Produkte
die Marktanteile nehmen. Zus&auml;tzliche Aktionen wie Parties, Flugbl&auml;tter, Plakate, Aufkleber und
nat&uuml;rlich unsere Homepage, das AR-Center, sollen einen steigenden
Bekanntheitsgrad der Revolution erzielen.
<br><br>
Und so kam es am 16.07.99 zum bisherigen H&ouml;hepunkt in der Geschichte der
AR, der ersten gro&szlig;en AR-Party.<br>
Kurz nach 23:00 Uhr kam Petro Tyschtschenko direkt aus Langen
angefahren. Noch kurz zuvor war er in den USA, und er war sichtlich begeistert. 
&quot;<i>Ich finde es eine richtige Revolution</i>&quot;, nannte er die Pl&auml;ne zum 
neuen Amiga, &quot;<i>Ich habe ein gutes Gef&uuml;hl!</i>&quot;. Den Namen des verwendeten Prozessors
wollte er selbstverst&auml;ndlich auch uns nicht preisgeben, er sagte allerdings aus,
es sei ein &quot;ganz neuer Prozessor&quot; und mit einem L&auml;cheln f&uuml;gte er hinzu, es
g&auml;be ja bereits Ger&uuml;chte. Dies ist ein klares Anzeichen, dass wahrscheinlich
der neue Pzozessor Transmeta im MCC verwendet werden wird. Einen Intel oder
IBM-Prozessor schloss er (zur Befriedigung der Revolution&auml;re) ganz aus.
Der NG-Amiga werde preiswert und sehr schnell sein. Er soll einfach sein,
aber auch etwas f&uuml;r Freaks, das Amiga-Feeling werde auch im neuen System
erhalten sein. Auf die Frage, was er von den dargelegten Pl&auml;nen halte, insgesamt 5
Millionen Amigas verkaufen zu wollen, wich er einer Zustimmung in diesem Punkt
aus. &quot;<i>Ich habe mittlerweile gelernt, nicht auf Papierzahlen zu horchen.</i>&quot; Er
lasse sich allerdings gerne &uuml;berzeugen und hofft, es wird stimmen. Von den
nach der Amiga-&Uuml;bernahme durch Escom geplanten 100.000 zu verkaufenden Amigas
sind bis heute 80.000 St&uuml;ck verkauft und noch einige auf Lager. Petro
betonte mehrfach seine erfolgreichen Gesch&auml;fte mit H&auml;ndlern v.a. in
Australien und Indien.
<br><br>
F&uuml;r &Uuml;berraschung sorgte die Aussage, Amiga wolle sich von Gateway
losl&ouml;sen und ein eigenes Unternehmen werden. In der jetzigen Aufbauphase k&ouml;nne
man keine B&uuml;rokratie verkraften, Amiga soll unabh&auml;ngig werden von all den
&quot;PC-Bastlern&quot;. Vielleicht sogar bereits zum 01. September soll eine Art
Management Buyout stattfinden, man sei bereits mit sehr interessanten
Investoren aus &Uuml;bersee (aber nicht Bill Gates :-) im Gespr&auml;ch.
Ende 2000 will AMIGA sogar an die B&ouml;rse gehen! Gateway sei dem nicht
abgeneigt und werde auch immer einen Anteil am Amiga haben, allerdings
nicht die Majorit&auml;t.
<br><br>
Jim Collas bezeichnete er klar als den &quot;<i>richtigen Mann</i>&quot;. Befragt nach
der Person, die dahinter steht, sagte er, Jim sei ein Super-Typ, wirklich
offen und grundehrlich. Er habe viel technische Ahnung, sei aber auch kein
Spinner. Vor allem bewundere Jim die community, er w&uuml;rde nie etwas
machen, das nicht in deren Sinne w&auml;re!
<br><br>
Speziell zum Gedanken der Amiga-Revolution brachte er folgende Vision -
auch betreffend den MCC - zum Ausdruck: &quot;<i>Die Zukunft wird eigentlich schon
sein, dass wir nicht das Monopol betreiben wollen und nicht in den Markt
reingehen wollen wie Bill Gates.</i>&quot; Weiter meinte er: &quot;Das neue System soll f&uuml;r
jedermann zug&auml;nglich sein im t&auml;glichen Leben. Es soll eine *L&ouml;sung*
sein. Wenn Sie heute einen Video-Recorder kaufen, wollen Sie auch nicht
wissen, was da drin ist. Man schaltet es an und dann muss es funktionieren!&quot; :-)
<br><br>
&Uuml;brigens wird das Geh&auml;use des MCC von Pentagram designt, die ebenfalls
den IMac gestaltet haben.
<br><br>
Wie bekannt wird das AmigaOS 3.5 wahrscheinlich ein Verlustgesch&auml;ft
sein, es wird allerdings dennoch als eine Art Treuegeschenk weitergef&uuml;hrt. Auch
an ein OS 3.6 k&ouml;nnte bei Bedarf noch gedacht werden. Im Laufe der Zeit will
AMIGA den Quellcode zum OS 3.1 und auch 3.5 auch freigeben.</font>
<br><br>
<center><font size="6">Der Party Bericht</font></center>
<br><br>
<font size="3">Am 16. Juli war es soweit: Im idyllischen Friedrichsdorf im Taunus nahe
Frankfurt am Main startete die erste gro&szlig;e Amiga-Revolutionsparty.
<br><br>
Der Einla&szlig; und inoffizielle Beginn war f&uuml;r 20:00 Uhr geplant, die
offzielle Begr&uuml;&szlig;ung f&uuml;r das zweit&auml;gige Festival war f&uuml;r 22:30 Uhr angesetzt.
Punktgenau mit der Er&ouml;ffnung sollte auch die neue Homepage, das
virutelle AR-Center online gehen.
<br><br>
Die Members fanden sich nach und nach im AR-Center ein, letzte
Vorbereitungen mu&szlig;ten noch abgeschlossen werden. Da man bisher lediglich
<br><br>
durch elektronische Post voneinander geh&ouml;rt hatte, war das erste reale
Aufeinandertreffen ein Erlebnis der ganz besonderen Art. Der Geist der
Revolution, den bisher das AR-Center nur virtuell ausstrahlen konnte,
griff sofort auf die Partygemeinschaft &uuml;ber. Hier bildete sich eine klasse
Community.
<br><br>
Auf drei Stockwerken pr&auml;sentierten das AR-Team diverse Attraktionen: Im
Kellergescho&szlig; wurde dem Pinugin ein vernetztes Zuhause geschaffen.
Mehrere herk&ouml;mmliche PC-Computer wurden per Netzwerk miteinander verbunden. Die
Macht &uuml;ber die Hardware hatte selbstverst&auml;ndlich der Pinguin, Linux
rulez! Das fortschrittliche und zukunftstr&auml;chtige Betriebssystem, das auf alle
Rechner vom 286er &uuml;ber Amiga, Atari,... bis hin zum Pentium III
unterst&uuml;tzt, eignete sich hervorragend, um die neue Homepage ausf&uuml;hrlich
vorzustellen. Schlie&szlig;lich dient die Linux-Plattform den Webmastern auch zum Erstellen
der Homepage.
<br><br>
Das Erdgescho&szlig; bot den Members Platz zum Kennenlernen, eine Chill-Out
Area zum Ausruhen und zum Diskutieren, eine mit Verpflegung gut gef&uuml;llte
K&uuml;che und Live-Music by DJ Harlequin. Die Musik wurde fast ausschlie&szlig;lich auf
Platte geliefert, der Verst&auml;rker bereitete uns anfangs leider
Kopfzerbrechen. Aber auch dieses Problem wurde im Laufe des Abends
behoben.
<br><br>
Die Amiga Area war ebenfalls im Erdgescho&szlig; angesiedelt. Dabei kamen hier
ausschlie&szlig;lich neueste Komponenten zum Einsatz. Die Vorstellung des
neuen i1500 von Micronik fand nicht statt, daf&uuml;r waren gleich drei gut
ausgestattete infinitiv-Towers anzutreffen. Au&szlig;erdem erblickte ein
Winner-Tower das Licht der Welt. Das High-End Ger&auml;t war jedoch ein
4000er im originalen Desktop-Geh&auml;use mit ppc604 und 68060er Prozessor. Modernste
Spiele und Anwendungsprogramme waren somit kein Problem.
<br><br>
Im obersten Stockwerk wurde den Members eine gro&szlig;e Zock-Area geboten,
bestehend aus klassischen Systemen der Classic-Area. Hier erlebte der
C64 seine Wiedergeburt: Zwei original 64er-Computer fesselten rund um die
Uhr die Besucher der Party. Auch verspielt zeigte sich der A500. Auf
mehreren Ger&auml;ten diesen Typs wurden unentwegt Dynablaster und weitere Kultspiele
gezockt.
<br><br>
Viel Aufmerksamkeit erregte der Besuch des Pr&auml;sidenten von Amiga
International, Inc., Petro Tytschtschenko.
Nicht nur durch die gro&szlig;z&uuml;gigen Werbegeschenke, in Form von
Ami-Cola-Dosen, Boxer-Shorts, Tennis-Str&uuml;mpfen, CDs und Mousepads, sondern vielmehr die
aufgeschlossene Art, mit der Petro den Members gegen&uuml;bertrat,
hinterlie&szlig;en einen tiefen Eindruck. Er stand bereitwillig Rede und Anwort und lie&szlig;
sich die einzelnen Areas der Party ausf&uuml;hrlich zeigen und erkl&auml;ren. Dar&uuml;ber
hinaus stiftete er der Amiga Revolution einen nagelneuen Amiga 1200HD.
Den H&ouml;hpunkt bildete schlie&szlig;lich die Verleihung der AR-Ehrenmitgliedschaft
durch Jack Miller.
<br><br>
Sehr gut kamen die Erzeugnisse der neugegr&uuml;ndeten AR-PrintStation bei
den Members an. Pr&auml;sentiert wurde eine erste Palette von Visitenkarten,
Aufklebern und Mousepads, selbstverst&auml;ndlich wurde auch jedem Besucher
ein spezielles Namensschild angeh&auml;ngt. Bestellen kann man diese und folgende
Artikel jederzeit &uuml;ber die AR-Homepage.
<br><br>
Die Veranstaltung lief noch bis in die fr&uuml;hen Morgenstunden des
Sonntages, leider mu&szlig;ten viele Members schon fr&uuml;her den Heimweg antreten. Insgesamt
kann man ein sehr positives Fazit ziehen: Die erste gro&szlig;e AR-Party war
ein voller Erfolg und hat sich gelohnt. Die Members lernten endlich einmal
real kennen, neue User konnten f&uuml;r die AR gewonnen werden, die neue Homepage
wurde p&uuml;nktlich ins Netz gesetzt und der gro&szlig;e Besuch aus Langen sorgte
f&uuml;r gute Stimmung auf der Party.
<br><br>
Leider kam die ideologisch Seite der AR ein wenig zu kurz. Das neue
Manifest wurde mit den neuen Internet-Seiten gleich mitgeliefert und sollte auf
der Party eigentlich ausf&uuml;hrlich diskutiert werden. Dazu kam es im Eifer des
Gefechtes leider nicht. Deshalb sind jetzt alle User aufgerufen, sich
w&auml;hrend der Sommerpause das evolutionierte Manifest genauestens
anzuschauen und es zu durchdenken. Eigene Einf&auml;lle, Erg&auml;nzungen, Kritiken, usw.
sollen ber&uuml;cksichtigt werden, bis das Manifest schlie&szlig;lich zu dem gereift ist,
f&uuml;r das es bestimmt ist: Die Grundlage unserer Amiga-Revolution.
<br><br>
In diesem Sinne warten wir gespannt auf die n&auml;chste AR-Party. Wann und
wo diese stattfinden soll, steht derzeit noch nicht fest. Fest steht
hingegen, da&szlig; es eine geben wird. Au&szlig;erdem wollen wir die diesj&auml;hrige Messe in
K&ouml;ln zum Anla&szlig; nehmen, ein weiteres AR-Meeting abzuhalten, um reege Teilnahme
wollen wir daher jetzt schon werben.
<br><br>
Jack Miller</font>
<br><br>

</td>
</tr>
</table>

</BODY>
</HTML>
