<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Spieleteil / T-Zer0 Testbericht</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<table width=99% align="center"><tr><td>
<center><img src="../pic/tzero1.jpg" border="0"></center>
<br><br>
<font size="3">
Auf der World of Amiga Show`99 pr&auml;sentierte clickBOOM ihr neustes
Werk. T-ZerO, ein Shoot`em Up im klassischen 2D-Stil, soll laut 
Hersteller wiedereinmal alles bisher dagewesene in den Schatten 
stellen. Mit neuem Joystick und viel Kraftfutter haben wir uns 
aufgemacht und wollten wissen was dran ist, am &quot;Besten Shoot`em
Up aller Zeiten!&quot;
<br><br>
T-ZerO erh&auml;lt man in einer normalen CD H&uuml;lle. Anscheinend verzichtet
man immer mehr auf richtige Verpackungen, doch das nur so nebenbei.
Das CD Booklet ist gleichzeitig das Handbuch (leider nur in Englisch)
und f&uuml;hrt Sie in das Spiel richtig ein. Waffen, PowerUps, Bonus-Punkte
und der Aufbau der jeweiligen Welten werden genauer erl&auml;utert. Die CD
bietet neben dem Spiel und deren 14 Audio Tracks auch noch einen Editor,
dazu aber sp&auml;ter n&auml;heres.
<br><br>
<b>Die Story</b><br>
&quot;... Sir, ich kann meine Geschichte nicht ver&auml;ndern! Ich habe es mit
meinen eigenen Augen gesehen. Ich habe es Ihnen doch schon tausendmal
erz&auml;hlt, als ich ES sah war ich nicht m&uuml;de und ich f&uuml;hlte mich auch 
nicht schlecht...&quot;
<br><br>
Mit diesen Worten wird die Story des Spieles eingeleitet und wenn
man im Booklet der CD weiterliest entpuppt sich die Geschichte
rund um T-ZerO als &auml;u&szlig;erst interessant. Eine Unterhaltung zwischen 
einem Major und seinem Vorgesetzten gibt Aufschlu&szlig; dar&uuml;ber, welche
b&ouml;se Macht sich im Weltall befindet. Diese b&ouml;se Macht, die man 
&quot;Kakistos&quot; nannte, befindet sich in einer Dimenson namens &quot;T-ZerO&quot;.
Alle Schiffe die entsand wurden, wurden schon kurz nach Eintritt in
diese Dimension zerst&ouml;rt und konnen nur wenige Informationen an
die Basis auf der Erde senden. Doch diese Informationen reichten aus,
um herauszufinden, da&szlig; &quot;T-ZerO&quot; f&uuml;nf W&auml;chter beinhaltet, die alle
&uuml;ber einen Diamanten wachen. Wenn man alle diese Diamanten besitzt,
ist es m&ouml;glich das Dimensionstor zu &ouml;ffnen und zu Kakistos zu gelangen.
Mit den besten Schiffen und Waffen ausger&uuml;stet liegt es nun an Ihnen
die Erde zu retten und Kakistos zu vernichten.
<br><br>
<b>Vor dem Spielbeginn...</b><br>
...sind nat&uuml;rlich auch noch einige Einstellungen zu t&auml;tigen. T-Zer0 mu&szlig;
zu Beginn installiert werden. Hier steht Ihnen frei, ob Sie nur 30 KB
oder gleich 255 MB auf die Festplatte kopieren m&ouml;chten. Nach der Installation
m&uuml;ssen Sie noch festlegen welches CD-Rom Laufwerk genutzt werden soll und
schon kann das Spiel beginnen.
Das Intro von T-Zer0 gleicht anfangs einer normalen Slidshow, denn man sieht
nur ein paar Grafiken und eine Frauenstimme erl&auml;utert aus den Hintergrund
heraus den Sachverhalt. Doch danach gibt es auch noch ein paar Animationen
zu sehen, die durch gekonnte Lichteffeckte und gutem Sound &uuml;berzeugen.
Anschlie&szlig;end kommen Sie automatisch ins Hauptmenu des Spieles. Hier k&ouml;nnen Sie
zwischen dem Arcade- und dem Story Modus ausw&auml;hlen. Der Untschied zwischen 
beiden Modi ist, da&szlig; beim Story Modus gegen Kakistos gek&auml;mpft werden mu&szlig; und
und man einige Animationen nach den Levels zu sehen bekommt die den Faden 
der Geschichte weiterspinnen. Im Arcade Modus dagegen, ist es nur wichtig
gen&uuml;gend Punkte wie m&ouml;glich zu erzielen und viele Coins einzusammeln.
Weiterhin k&ouml;nnen Sie w&auml;hlen, ob Sie allein oder zu zweit spielen m&ouml;chten,
ob der Schwierigkeitsgrad hoch oder niedrig sein soll (wobei bei dem leichten
Schwierigkeitsgrad nur die Welt 1 &amp; 2 spielbar ist), ob automatisch das
&quot;Autofire&quot; aktiviert werden soll, wie Ihre Steuerintesit&auml;t des Raumschiffes
ist oder ob Sie die Animationen sehen m&ouml;chten oder nicht. T-Zer0 k&ouml;nnen Sie
in zwei verschiedenen Stilen spielen. Im High-Tech-Style sehen alle Coins
und PowerUp`s futuristisch aus und Sie werden Trance Musik von CD h&ouml;ren.
Im Arcade-Game-Style finden Sie dagegen klassische Coins vor, wie Kuchen oder
Fr&uuml;chte, und es gibt typische Shoot`em Up Musikst&uuml;cke.
Nennenswert ist ebenfalls die M&ouml;glichkeit das Spiel zu sichern. Hat man eine
Ebene bew&auml;ltigt und wird im darauffolgenden Level vernichtet, so sichert das
Spiel automatisch ab und bei einem Neustart beginnt man mit den bis dahin 
gewonnen Punkten, Leben und Waffen im erreichten Level. Eine detailierte
Anleitung zum Sichern und Starten eines Spieles finden Sie im Booklet der CD.
<br><br>
<center><img src="../pic/tzero2.jpg" border="0"></center>
<br><br>
Ihnen stehen insgesamt 3 verschiedene Raumschiffe zur Verf&uuml;gung, die sich vom
&Auml;u&szlig;eren, von der Bewaffnung und von den Piloten unterscheiden. Auch die Farben
des jeweiligen Raumschiffes sind definierbar. Leider kann man keine Bewaffnung
festlegen, diese mu&szlig; man sich erst im Spiel erk&auml;mpfen. Die Welten von T-Zer0
sind im Story Modus jeweils in 4 Level unterteilt. Begonnen wird immer im 
&quot;Entrance Level&quot;, je nachdem wieviele Edelsteine Sie eingesammelt haben, wird
das Spiel in &quot;Route A&quot; bzw. &quot;Route B&quot; fortgesetzt. &quot;Route B&quot; ist schwerer als
&quot;Route A&quot;, daf&uuml;r gibt es aber mehr Bonus-Punkte und PowerUp`s. Beendet wird
jede Welt mit dem &quot;Exit Level&quot; und am Ende erwartet Sie einer der W&auml;chter und
wenn Sie diesen besiegen, erhalten Sie einen der f&uuml;nf Diamanten.
Das Spiel gestaltet sich sehr abwechslungsreich. Verschiedene Gegnerformationen
lassen keine Langeweile aufkommen und fordern den Spieler. Nat&uuml;rlich gibt es
auch einige n&uuml;tzliche Sachen, wie den Nuclear Blast (alle Feinde auf dem Screen werden
vernichtet), zus&auml;tzliche Schilde, besondere Waffen, Extra-Leben oder dem Hyperdrive.
Aber auch kleine Gemeinheiten wurden eingebaut, so gibt es den &quot;Short circuit&quot;, der
daf&uuml;r sorgt, da&szlig; all Ihre Waffen f&uuml;r einige Sekunden funktionsunf&auml;hig sind, und
&quot;Invasion&quot; macht die Steuerung zu einem Alptraum, da alle Funktionen vertauscht
werden.
<br><br>
<b>Gameplay, Grafik &amp; Sound</b>
<br>
T-Zer0 steuert sich einfach und unkompliziert. Sammeln Sie ein PowerUp Coin
ein, so werden Sie um eine Waffe reicher, erhalten ein Leben, Schild oder eine andere
Sachen. Ab und zu greift ein Hyperdrive ein, der Ihr Schiff automatisch schneller
macht. Das Spiel l&auml;uft leider nur auf normalen PAL Bildschirmen und unterst&uuml;tzt 
keine Grafikkarten. Der AGA Chip kann wiedereinmal beweisen, was noch in ihm
steckt, denn die Grafik wei&szlig; zu &uuml;berzeugen. Die sch&ouml;nen Hintergrundanimationen
und die diversen Androiden, W&auml;chter und sonstige Feinde hat clickBOOM farbenfroh
und doch etwas d&uuml;ster gehalten. Die Leveldesign`s sind hervorragend und auch
die Explosionen hat man gut zur Geltung gebracht. Kurz gesagt hat clickBOOM
ihr hohes Niveau an Grafik, Animationen und Movie`s (nach den Leveln) halten
k&ouml;nnen. Die 14 Audiotracks sind recht flott und passen sich sehr gut dem Geschehen
an. Kaum zu glauben, aber am Gameplay, an der Grafik und auch am Sound gibt es
nicht`s zu meckern, hier hat clickBOOM wieder einmal f&uuml;r Qualit&auml;t gesorgt.
<br><br>
<b>Der &quot;T-ZerO Editor&quot;</b>
<br>
clickBOOM legte dem Spiel auch noch einen eigenen Editor bei, mit welchem Sie
die jeweiligen Welten mit Gegnern und Bonuspunkten ausstatten k&ouml;nnen. Die 
Handhabung ist kinderleicht, jede Welt k&ouml;nnen Sie einzeln &uuml;ber ein Icon laden,
da&szlig; sich in der Schublade &quot;T0Editor&quot; befindet. Danach sind Sie in der Lage via
Maus und Tastatur die feindlichen Raumschiffe, sowie die Bonuspunkte, zu 
positionieren. Leider k&ouml;nnen Sie nicht die Welten ansich neu gestalten, Sie 
nutzen nur die Vorlagen von clickBOOM. Trotz dieser Einschr&auml;nkung ist der Editor
recht n&uuml;tzlich und sorgt f&uuml;r gute Unterhaltung. Bis zu 100 (!) Gegner k&ouml;nnen
auf einem Screen verwendet werden und bei 20 Screens pro Level, ist es m&ouml;glich
satte 2000 (!!!) feindliche Einheiten gegen Sie k&auml;mpfen zu lassen, dabei k&ouml;nnen
Sie auch noch Schu&szlig;st&auml;rke und Schu&szlig;intensit&auml;t bestimmen. Ist ein Level fertig
gestaltet und wird den eigenen Anspr&uuml;chen gerecht, speichert man ab und startet
das Spiel &uuml;ber das &quot;Custom_TZer0&quot;-Icon, anschlie&szlig;end w&auml;hlt &uuml;ber die Option 
&quot;Start at ..&quot; das Level aus.
<br><br>
<center><img src="../pic/tzero3.jpg" border="0"></center>
<br><br>
<b>Die zweite Vollversion</b>
<br>
Auf der T-Zer0 CD befindet sich neben dem eigentlichen Spiel auch noch ein
zweites Vollspiel. Das Erstlingswerk &quot;Capital Punishment&quot; fand Platz auf
der CD und d&uuml;rfte ein weiterer Anreiz f&uuml;r potentielle K&auml;ufer sein. Doch Vorsicht,
Capital Punishment ist nicht sofort spielbar, da Sie die &quot;Copy Protection&quot; 
ben&ouml;tigen um das Spiel zu starten. Diese erhalten Sie f&uuml;r den Aufpreis von nur 
$10 Dollar (~11DM), sowie ein Poster des Spieles. Wenn Sie sich allerdings 
als T-Zer0 K&auml;ufer registiereren lassen, ist das Spiel theoretisch kostenlos. 
Wieso? Ganz einfach! Jeder der ein erworbenes clickBOOM Spiel registieren l&auml;&szlig;t
erh&auml;lt $10 Dollar und kann diese schon f&uuml;r die &quot;Copy Protection&quot; nutzen. Somit
gibt es zum neuen Shoot`em Up von clickBOOM, auch noch geballte Beat`em Up Action.
<br><br>
<b>Fazit</b><br>
T-Zer0 eine endg&uuml;ltige Note zu geben ist nicht gerade einfach. Auf der einen
Seite &uuml;berzeugen die umfangreichen Levels, die fantastische Grafik/Animation
und die CD Audiotracks, und auf der anderen Seite l&auml;hmt der hohe 
Schwierigkeitsgrad die Motivation. Gerade die Welten 3-5 haben es ziemlich in
sich und wenn unz&auml;hlige Sch&uuml;sse und Gegner auf einen draufzukommen, ist es 
oftmals unm&ouml;glich das eigene Raumschiff vor der Zerst&ouml;rung zu retten. Sicherlich
wird das bei den ersten Versuchen keinen Spieler abschrecken, doch wenn Sie 
stundenlang im gleichen Level steckenbleiben, werden Sie nicht viel Zeit mit T-Zer0
verbringen und andere Software vorziehen. Wie erw&auml;hnt kann die Grafik, trotz 
fehlender Grafikkartenunterst&uuml;tzung, sehr &uuml;berzeugen und zeigt zu was der AGA
Chip immernoch in der Lage ist. Die Steuerung ist makellos und die vielen 
PowerUp`s und die Bonuslevel sorgen f&uuml;r Abwechslung. T-Zer0 ist ein &uuml;berdurch-
schnittlich-gutes Spiel, da&szlig; durch viele Features begeistert (Editor, CD Musik,
verschiedene Spiel-Modi ect.). Der hohe Schwierigkeitsgrad wird allerdings der
Grund sein, warum T-Zer0 nur f&uuml;r wenige User &quot;das Beste Shoot`em Up aller Zeiten&quot;
sein wird.
<br><br>
<table border="0" width="100%">
 <tr>
  <td valign="top">
  <font size="5">
  <b>Tip:</b>
  </font>
  </td>
  <td valign="top">
  <font size="3">
  Wer etwas Probleme mit T-Zer0 hat und immer wieder von vorn anfangen
  mu&szlig;, der sollte mal im Aminet nachschauen. Dort gibt es einen Trainer
  f&uuml;r T-Zer0 (dsd-tztr.lha) der da Abhilfe schaffen sollte!
  </font>
 </td>
</tr>
</table>
<br>
<br>
Quelle:<br>
<br>
KDH Datentechnik<br>
S&uuml;dring 65<br>
72160 Horb<br>
eMail: <a href="mailto:info@kdh-datentechnik.com">info@kdh-datentechnik.com</a><br>
Internet: <a href="http://www.kdh-datentechnik.com">www.kdh-datentechnik.com</a><br>
Telefon: 07451 / 55 51 10<br>
Fax: 07451 / 55 51 15<br>

</td>
</tr>
</table>

</BODY>
</HTML>
