<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Spieleteil / Wasted Dreams Testbericht</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<table width=99% align="center"><tr><td>
<br>
<center><img src="../pic/wasted1.jpg"></center>
<br><br>
Vor kurzem wurde das erste Spiel von Digital Dreams Entertainment
ver&ouml;ffentlicht, ein Action-Adventure mit Namen &quot;Wasted Dreams&quot;.
<br><br>
Wasted Dreams wird auf einer CD ausgeliefert, das beiliegende Booklet
ist gleicherma&szlig;en das (englische) Handbuch. Wasted Dreams ist komplett
in Deutsch und dank der A.T.O. (Amiga Translator Organisation) auch noch
in 17 weiteren Sprachen spielbar. Als Hardwarekonfiguration ist ein 
Amiga mit AGA und 68000 (!) ausreichend, jedoch sind 2 MB Chip Ram und 
ein 1 MB Fast Ram notwenig, wie auch ein 2fach CD Laufwerk. Das Spiel 
selbst l&auml;uft mit dieser Konfiguration ohne Probleme, jedoch sollten Sie 
&uuml;ber ein schnelleres CD Laufwerk und mehr Fast Ram verf&uuml;gen, wenn Sie 
die Animationen des Spieles fl&uuml;ssig sehen und nur kurze Nachladezeiten 
haben m&ouml;chten. Wasted Dreams ben&ouml;tigt keine Festplatteninstallation und
unterst&uuml;tzt derzeit noch keine Grafikkarten. Das kann sich allerdings 
schnell &auml;ndern, da eine Umfrage von Digital Dreams Entertainment im 
Internet ergab, da&szlig; eine GraKa-Unterst&uuml;tzung von fast 90% der Befragten
bef&uuml;hrwortet wurde.
<br><br>
Um das Spiel zu starten, gibt es zwei M&ouml;glichkeiten. &Uuml;ber das Icon 
&quot;Wasted Dreams&quot; wird das Spiel geladen und die Introanimation gezeigt.
Das Icon &quot;Engine&quot; bringt Sie sofort ins Spiel. Das mehrmin&uuml;tige Intro, das
durch fantastische Grafik in voller PAL Gr&ouml;&szlig;e, gutem Sound und hervorragender 
Sprachausgabe besticht, f&uuml;hrt Sie in die Geschichte von Wasted Dreams ein. Als 
einfacher Soldat &quot;qualifiziert f&uuml;r Verteidigungsstrategien&quot; wurden Sie ausgew&auml;hlt
mit einer Crew nach einem neuen Planeten f&uuml;r die Menschheit zu suchen, da die 
Erde durch mulitationale Firmen, Kriminalit&auml;t und Umweltverschmutzung beherrscht
wird. Nach 9 monatiger Suche finden Sie einen neuen Planten auf dem ein Neuanfang
m&ouml;glich scheint, da Naturressourcen vorhanden sind. Auf dem von Ihnen als 
&quot;Agillera&quot; genannten Planeten erschafft die gesamte Crew binnen 6 Monaten ein 
neues Camp. Nun scheint es an der Zeit, wieder zur Erde zur&uuml;ck zu kehren und den
anderen Menschen davon zu berichten. Alles ist perfekt, doch nur kurze Zeit nachdem
das Raumschiff zu Erde gestartet ist, Sie sind mit an Bord, wird es von irgendeinem
Punkt auf Agillera angegriffen und zerst&ouml;rt... als Sie wieder zu Bewu&szlig;tsein kommen,
sehen Sie neben sich Ihren Freund Harper, tot (1-Spieler Modus) bzw. lebendig 
(2-Spieler Modus) und eine demolierte Rettungskapsel, doch Sie k&ouml;nnen sich an 
nichts mehr erinnern. Jetzt liegt es an Ihnen, zum Camp zur&uuml;ck zu kehren und
das Geheimnis rund um den mysteri&ouml;sen Absturz zu l&ouml;sen.
<br><br>
<center><img src="../pic/wasted2.gif"></center>
<br><br>
<b>Das Spiel</b><br>
Sie wachen neben Ihrem Raumschiff auf, da&szlig; man allerdings nur noch als Wrack
bezeichnen kann. Neben Ihnen liegt der tote Harper, ein Freund, doch Sie haben
wenig Zeit um in Trauer zu verfallen. Neben dem Raumschiff liegen einige n&uuml;tzliche
Dinge, unteranderem eine Laserwaffe. Ist alles im Rucksack verstauht geht es sofort
los, es wird der Planet n&auml;her erkundet und schon nach sehr kurzer Zeit tauchen 
einige Aliens auf, die weniger freundlich gesinnt sind. Im Schu&szlig;wechsel gilt es 
als Sieger hervorzugehen, je nach eingestellter Option, wird der Feind mit einem 
Kreuz markiert, so da&szlig; Sie genau sehen, ob Sie ihn treffen w&uuml;rden. Die Spielfigur
kann sich entweder jeweils um 90&deg; oder um 45&deg; drehen, so das auch diagonale Angriffe
m&ouml;glich sind. Im Spiel wird man sehr oft mit Aliens konfrontiert und K&auml;mpfe sind 
unausweichlich. Sie haben ein Schutzschild und einen Medi-Kit zur Sicherheit und
k&ouml;nnen Ihre &quot;Schilde&quot; auch wieder aufladen. Doch Wasted Dreams ist mehr als nur 
ein Action Spiel, f&uuml;r Adventure Fans k&ouml;nnte dieser Genre-Mix auch interessant sein.
Neben dem puren &Uuml;berleben gilt es n&auml;mlich das R&auml;tsel um Ihren Absturz zu l&ouml;sen. 
Sie werden viele Hinweise, Gegenst&auml;nde und Menschen treffen und nach dem &quot;Hilfst` Du mir, 
helf ich Dir!&quot; -Prinzip handeln (m&uuml;ssen). Retten Sie zum Beispiel ein Alien vor 
dem Tod - nicht alle Aliens sind Feinde - bekommen Sie hilfreiche Items oder 
beschaffen Sie einem Mechaniker ein ben&ouml;tigstes Bauteil, so wird er Sie mit 
einer wichtigen Karte belohnen. 
Witzige Dialoge, die auch durch eine gute Sprachausgabe umgesetzt wurden, machen das
Spiel sehr interessant und abwechslungsreich. Schade ist nur, da&szlig; man keine S&auml;tze und
Fragen ausw&auml;hlen kann, sondern die Figuren sich komplett selbst&auml;ndig unterhalten.
Der Schwierigkeitsgrad ist teilweise relativ hoch, werden Sie von mehreren Aliens
gleichzeitig angegriffen, haben Sie keine Chance. Leicht zu l&ouml;sen ist das Spiel nicht,
da Sie mit vielen Leuten reden m&uuml;ssen und ein Kampf dem Anderen folgt. Wasted Dreams
macht eine Menge Spa&szlig; wenn man sich eingearbeitet hat, die M&ouml;glichkeit das Spiel zu
sichern besteht ebenfalls. Und wenn man es endlich geschafft hat, auf alle Fragen
eine Antwort wei&szlig; und den Feind eleminiert hat, wird man noch mit einer tollen 
Animation belohnt.
<br><br>
<center><img src="../pic/wasted3.gif"></center>
<br><br>
<b>Gameplay, Grafik &amp; Sound</b><br>
Wasted Dreams kann wahlweise allein oder zu zweit mit Tastatur, Joystick oder
Maus (solange sie im Joystick-Port steckt) gespielt werden. Die Steuerung kann
man auch w&auml;hrend des Spieles noch &auml;ndern, so empfiehlt es sich, alle M&ouml;glichkeiten
auszuprobieren und die geeignete zu finden. Gestartet wird das Spiel immer im
2-Spieler-Modus, wenn Sie aber allein durch die W&auml;lder streifen m&ouml;chten, sollten Sie
sofort nach dem Spielstart den 1-Spieler-Modus ausw&auml;hlen, da ein Moduswechsel ein
Neustart nach sich zieht und alle bis dahin gewonnen Items verloren gehen. 
Die Tastatur wird in jedem Fall ben&ouml;tigt, da &uuml;ber diese Werkzeuge, Waffen und alles
andere was sich in Ihrem Rucksack befindet, ausgew&auml;hlt wird. Gesteuert wird mit den 
Coursor-Tasten oder mit dem Joystick. Das Gameplay ist einfach und leicht, aber in
einem Kampf mit mehreren Gegener kann es schnell hektisch werden und die Steuerung
versagen, da Sie werden des unmittelbaren Beschusses nicht steuern k&ouml;nnen. Neben dem
normalen Laufen, k&ouml;nnen Sie auch Schwimmen. Wenn Sie irgendwelche Gegenst&auml;nde 
aktivieren oder aufnehmen k&ouml;nnen, so wird Ihnen das angezeigt. 
Musikalisch ist Wasted Dreams eher schlicht gehalten, d&uuml;stere Musik tr&auml;llert im 
Hintergrund und verschafft dem Spiel eine gute Atmosph&auml;re, Ger&auml;usche sind zu hauf
enthalten und klingen gut. Soundtechnisch h&auml;tte man aber mehr aus Wasted Dreams machen
k&ouml;nnen, die fantastische Sprachausgabe macht jedoch einiges wieder weg. Zwar kommen nur
englische Worte aus dem Lautsprecher, doch sie sind sauber und deutlich zu verstehen,
auch da&szlig; die Aliens durch eine Art &quot;Communicator&quot; sprechen und somit f&uuml;r die Menschen
zu verstehen sind, hat man beachtet und dies richtig vertont.
Als grafischen Leckerbissen kann man Wasted Dreams nicht bezeichnen, bis auf 
die Animationen wird f&uuml;r AGA Verh&auml;ltnisse Normalkost geboten. Die doch sehr stupide
Gegend in der man anfangs nach des R&auml;tsels L&ouml;sung sucht, l&auml;&szlig;t kaum Freiraum f&uuml;r 
grafische Spielchen - Felsen aus denen Wasser kommt, Berge, B&auml;ume oder dunkle G&auml;nge,
sind eben nichts Neues. Die Figuren sind gut animiert worden, aber irgendwie wird zu
oft nur gesagt was getan wird und es nicht gezeigt.
<br><br>
<center><img src="../pic/wasted4.gif"></center>
<br><br>
<b>Die Manko`s</b><br>
Ein perfektes Spiel gibt es nicht und hier macht Wasted Dreams keine Ausnahme.
In Wasted Dreams gibt es keine direkten Begrenzungen von Screens, so schwimmen 
Sie einen Flu&szlig; entlang und kommen zum Bildschirmende. Nun m&uuml;&szlig;te entweder das 
Scrolling einsetzen oder ein neuer Bereich geladen werden, doch f&uuml;r Sie ist 
hier Schlu&szlig;, obwohl der Flu&szlig; an dieser Stelle nicht endet. Direkte Grenzen f&uuml;r 
den Spieler h&auml;tte man auch als solche kennzeichnen sollen, durch B&auml;ume oder 
Gr&auml;ben ect., damit man sich unn&uuml;tzes herumlaufen ersparen kann und der Gefahr
entgeht aus dem Hinterhalt erschossen zu werden. Die Tatsache, da&szlig; Wasted 
Dreams in sage und schreibe 18 verschieden Sprachen spielbar ist, sollte man 
nicht unerw&auml;hnt lassen, in unserem Test fiel uns allerdings auf, da&szlig; sehr oft
Buchstaben vertauscht wurden bzw. Buchstaben fehlen und somit kein guter Ausdruck
zu stande kam. Wer vorallem an dem Adventure Part des Spieles interessiert ist, 
wird etwas entt&auml;uscht. Liebt man n&auml;mlich das Aussuchen von coolen Spr&uuml;chen oder
pfiffigen Antworten, so &uuml;bernimmt das die Spielfigur selbst und sie lesen nur mit.
Als trost sollte aber gesagt werden, da&szlig; die automatischen Antworten auch nicht 
ohne sind und f&uuml;r den ein oder anderen Lacher sorgen.
<br><br>

<b>Fazit</b><br>
Wasted Dreams ist ein gelungender Genre Mix aus Action und Adventure.
Mit kniffligen R&auml;tseln und witzigen Dialogen &uuml;berzeugt das Spiel schon nach kurzer
Zeit und da das Geheimnis rund um Ihren Absturz nur sp&auml;rlich preisgegeben 
wird, werden Sie den Computer sicherlich nicht so schnell wieder ausschalten. 
Mit unterschiedlichen Waffen machen Sie den Alien`s klar, wer der Chef ist.
Die tolle Intro- &amp; Extroanimation zeigen, zu was das AGA-Chipset noch alles 
f&auml;hig ist und auch die Animationen der einzelnen Figuren sind gelungen.
Ob das Spiel noch eine Grafikkartenunterst&uuml;tzung erh&auml;lt ist noch nicht zu 100%
sicher, anzuraten ist es aber auf alle F&auml;lle. Leider kam die Musik etwas zu 
kurz und die kleinen Fehler im Ausdruck (Tippfehler) h&auml;tten auch vermieden 
werden k&ouml;nnen, sieht man davon aber einmal ab, ist Wasted Dreams ein gutes Spiel.
<br><br><br>
Quelle:<br>
Digital Dreams Entertainment <a href="http://www.dd-ent.com">www.dd-ent.com</a><br>
<br>
</td>
</tr>
</table>
</BODY>
</HTML>
