<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Spieleteil / Testbericht Wet - The sexy Empire</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center><table width=90%><tr><td>
<br>
<center><font size="6">Wet - The Sexy Empire</font></center>
<br><br>
<font size="3">von Alexander Bramm</font><br><br>

Das Spiel Wet-The Sexy Empire wird auf einer CD von New Generation Software (kurz: 
NGS) bzw. von Interactive Strip ausgeliefert. 
<br><br>
<font size="3"><b>Die Installation</b><br>
<br>
Nachdem man die Installation gestartet hat kommt entweder eine Fehlermeldung 
(Diskaktivit&auml;t) oder man hat Gl&uuml;ck mit der Versionsnummer oder der richtigen Hardware. 
Die 2. Aktion war auf die NGS Homepage (<a href="http://www.newgsoft.com">http://www.newgsoft.com</a>) zu gehen und nach 
einem Pastch ausschau zu halten. Es fand sich schnell eins, welches Ihr nach dem Read me 
installatiert. Bevor ihr den Installationsvorgang beginnt m&uuml;sst ihr noch einige Optionen 
einstellen!<br>
<ul>
<li>1. Gro&szlig;e (140 MB) oder kleine (40 MB) Version installieren</li>
<li>2. Ob auf GFX-Karte oder AGA </li>
<li>3. Qualit&auml;t der Samples; 11 (ben&ouml;tigt 7,5 MB freies fast-ram) oder 22 khz (9 MB f.f.-r.)
Am besten installiert ihr die gro&szlig;e Version um lange Ladezeiten zu vermeiden und bei den 
anderen Optionen m&uuml;sst ihr selber nach eurer Hardware gehen.</li>
</ul>
<br>
<center><img src="../pic/wet1.jpg"></center><br>
<br>
<b>Die Story</b><br>
<br>
Die Story wird in einem sch&ouml;nen aber leider nur in 8 bit Video erkl&auml;rt:
Mit einem Freund und einer Freundin begehst Du einen Bankraub, aber es geht was 
schief! Dein Freund erschie&szlig;t eine Polizeibeamten. Ihr k&ouml;nnt zwar fl&uuml;chten aber mitten auf 
einer staubigen Stra&szlig;e wollen sie nichts mehr von Dir wissen und setzten dich ohne 
jeglichen Cent auf die Stra&szlig;e. Auf der suche nach zivilisierten Lebewesen kommst Du in 
das D&ouml;rflein , namens &quot;Wet Rock&quot;, wo Du auch die ungl&uuml;ckliche blondine Lula triffst. 
Nach kurzer Zeit machst Du mit ihr schon Bettk&auml;mpfe. Zusammen m&uuml;sst Ihr einen Weg 
aus diesem Kaff finden. Au&szlig;erdem ist Dir das FBI auf den Spuren. 
<br><br>
<b>Das Spiel</b><br>
<br>
Wie gesagt startest Du in Wet Rock, wo deine Aufgabe ist 50000$ auf dem Konto liegen 
zu haben. Um dieses Geld zu bekommen kann man Lula in der Bar strippen lassen oder 
man kann sie mit den sog. &quot;Opfern&quot; rummachen lassen, damit man dieses erpressen kann. 
Auf dem Klo kann man gelegentlich die betrunkenen &uuml;berfallen und den Inhalt ihrer 
Taschen beim Pfandleiher verkloppen. 
Wenn man so ein paar Dollar verdient hat kann man auch Fotos und Filme machen, 
welchen man wiederum lizensieren oder verkaufen kann.
Nachdem das Konto voll genug ist verlasst Ihr dieses Kaff und k&ouml;nnt selber Filme drehen. 
Man mu&szlig; beim Makler Studios, Planungsh&auml;user, Kopierh&auml;uschen etc. mieten (oder sp&auml;ter, 
wenn die M&uuml;nze stimmt auch kaufen), Mitarbeiter besorgen und und und.
Ja weiter bin ich leider selber noch nicht (ziemlich haariger Schwierigkeitsgrad)!
<br><br>
<center><img src="../pic/wet1.jpg"></center><br>
<br><br>
<b>Das Resultat</b><br>
<br>
Wet ist ein wirklich gutes Spiel mit sch&ouml;ner Grafik, einigen netten Spielereien, gutem 
Sound und viel Spielspa&szlig;! Eine Sache f&auml;llt mir aber negativ auf, und zwar, da&szlig; die Videos 
auch auf GFX-Karten nur mit 256 Farben (8 bit) dargestellt werden.
<br><br>
<table border="0" align="center">
 <tr>
  <td>Grafik:</td>
  <td>88 %</td>
  <td>Super Comic-Grafik</td>
 </tr>
 <tr>
  <td>Musik &amp; Sound:</td>
  <td>83 %</td>
  <td>klare sch&ouml;ne Sounds</td>
 </tr>
 <tr>
  <td>Spielspa&szlig;:</td>
  <td>85 %</td>
  <td>Super Spiel, aber recht schwer</td>
 </tr>
 <tr>
  <td><b>Gesamt:</b></td>
  <td><b>85 %</b></td>
  <td></td>
 </tr>
</table>
<br><br>
Anforderungen:<br>
<ul>Mindestens:
<li>AGA,020,40 MB freier HD-Platz,8x CD-Rom,1,7 MB chip &amp; 7,5 MB fast-ram</li>
</ul>
<ul>Empfohlen:
<li>CGX-Karte,mehr ram, schnellerer CPU, 160 MB freier HD-Platte</li>
</ul>
<br><br>
</td>
</tr>
</table>

</BODY>
</HTML>
