<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele8.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele10.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H1>5.5. Reviews</H1>
<H2>Syndicate</H2>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name&nbsp;</TD><TD VALIGN="TOP">: Syndicate&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Hersteller&nbsp;</TD><TD VALIGN="TOP">: Bullfrog&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Voraussetzungen&nbsp;</TD><TD VALIGN="TOP">: System 7, 2.5 MB&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Testgrundlage&nbsp;</TD><TD VALIGN="TOP">: (X) Vollversion (X) MacMagazin 11/94&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Testcomputer&nbsp;</TD><TD VALIGN="TOP">: 68040/40 unter Fusion&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<B>Spielbeschreibung:</B>
<P>
Zu diesem Spiel mu&szlig; ich wohl nicht allzuviele Worte verlieren, zumal es
neben der Mac- und PC-Version auch eine Version f&uuml;r unseren Amiga gibt,
die trotz ihres Alters nach wie vor erh&auml;ltlich ist.
</P>
<P>
F&uuml;r all diejenigen, die das Spiel trotzdem nicht kennen: In einer nahen
Zukunft, in der gro&szlig;e Firmen die Erde unter sich aufgeteilt haben, ist es
die Aufgabe des Spielers, sein eigenes kleines Syndikat zu leiten und
zur Weltherrschaft zu f&uuml;hren. Spieltechnisch umgesetzt ist dies in Form
einer futuristischen 3D Landschaft, in der sie bis zu vier Agenten aus
einer Schr&auml;gansicht steuern, und mit ihnen die, dem Einsatzland
zugeordneten, Missionen erf&uuml;llen m&uuml;ssen. Diese beinhalten meist das
Ausschalten aller gegnerischen Agenten oder einer Person.
</P>
<P>
M&ouml;glich ist dies mit einem ganzen Arsenal von Waffen, die im Strategieteil,
in dem man auch seine Agenten mit aufgecyberten K&ouml;rperteilen ausr&uuml;sten
kann, zun&auml;chst geforscht werden m&uuml;ssen.
</P>
<P>
Grafik, Sound und Spielbarkeit, sowie die entstehende Atmosph&auml;re, wissen
dabei absolut zu &uuml;berzeugen, so dass das Spiel nach wie vor noch viele
Stunden vor den Bildschirm fesseln kann. Dabei steht die Mac-Version der
auf dem PC in nichts nach - wie sie im Vergleich zum Amiga ist, kann ich
an dieser Stelle leider nicht beurteilen.
</P>
<B>Emulationsgeschwindigkeit:</B>
<P>
Wie zu erhoffen, merkt man dem Spiel nicht an, dass es auf einer Emulation
l&auml;uft. Auch auf langsameren Rechner sollte es problemlos spielbar sein.
</P>
<H2>Space Quest 6</H2>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Titel&nbsp;</TD><TD VALIGN="TOP">: Space Quest 6&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Hersteller&nbsp;</TD><TD VALIGN="TOP">: Sierra&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Voraussetzungen&nbsp;</TD><TD VALIGN="TOP">: 68040, 8MB&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Testgrundlage&nbsp;</TD><TD VALIGN="TOP">: (X) Vollversion (X) MacMagazin 7/96&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Testcomputer&nbsp;</TD><TD VALIGN="TOP">: 68040er unter Fusion&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<B>Spielbeschreibung:</B>
<P>
Space Quest 6 geh&ouml;rt zu den klassischen point&amp;click-Adventuren mit einer
cartoon&auml;hnlichen Grafik. Der Spieler schl&uuml;pft in die Rolle von Roger Wilco,
der aufgrund seiner Vergehen im Vorg&auml;nger degradiert wurde und als
zweiter Putzmann auf seine alte Wirkungsst&auml;tte zwangsversetzt wird; von wo
aus es jedoch geradewegs zwecks Landurlaub auf den w&uuml;sten Planeten
Polysorbate LX geht, wo das eigentliche Spiel beginnt. Hier m&uuml;ssen in
bekannter Manier Orte erforscht, Unterhaltungen gef&uuml;hrt und Gegenst&auml;nde
untersucht werden.
</P>
<P>
Trotz der witzigen Grafik und den ebenso bissigen Dialogen bietet das Spiel
leider nur einen begrenzten Unterhaltungswert  - ohne dass ich genau sagen
k&ouml;nnte, woran dies liegt. Auch wenn es Spa&szlig; macht, sich mit den
teilweise recht absonderlichen Kreaturen zu unterhalten (&uuml;brigens
in sehr guter Sprachausgabe), fehlt es dem Spiel einfach irgendwie an
langfristiger Motivation. Der m&auml;&szlig;ige Sound tut sein &uuml;briges, das Spiel
abzuwerten.
</P>
<B>Emulationsgeschwindigkeit:</B>
<P>
Zumindest die Spielgeschwindigkeit ist auf der Emulation angemessen. Auch
wenn das Spiel zus&auml;tzlich als PPC-Version vorliegt, ist die 68k-Variante
noch gut spielbar; nur manchmal k&ouml;nnte Roger Wilco ruhig einen Zahn
zulegen. Sp&auml;testens auf einem schnelleren Rechner oder eine Graka d&uuml;rfte
das aber kein Problem mehr sein.
</P>
<H2>The Secrets of Luxor</H2>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name&nbsp;</TD><TD VALIGN="TOP">: The Secrets of Luxor&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Hersteller&nbsp;</TD><TD VALIGN="TOP">: Mojave&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Voraussetzung&nbsp;</TD><TD VALIGN="TOP">: System 7&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Testgrundlage&nbsp;</TD><TD VALIGN="TOP">: (X) MacOpen Juli/August 96&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<B>Spielbeschreibung:</B>
<P>
Bei diesem Spiel handelt es sich um eines der, auf dem Mac extrem
beliebten, 3-D-First-Person-Adventure. In der Gestalt eines Arch&auml;ologen
kann der Spieler die Geheimnisse der ber&uuml;hmten Pyramiden erforschen und
st&ouml;&szlig;t dabei immer wieder auf Hinweise auf einen sagenumwobenen Obelisken,
dessen magische Kr&auml;fte Raum und Zeit beeinflussen k&ouml;nnen sollen.
Auf der Suche nach dieser Rarit&auml;t m&uuml;ssen zahlreiche R&auml;tsel gel&ouml;st und
mindestens ebensoviele Fallen umgangen werden. Dabei ger&auml;t der Spieler
immer n&auml;her in den Einflussbereich des Obelisken, so dass Raum und Zeit
auf mysteri&ouml;se Weise beeinflusst werden.
</P>
<P>
Zahlreiche Ausr&uuml;stungsgegenst&auml;nde wie Sofortbildkamera, Tagebuch und VR-
Headset, sowie ein angemessener Schwierigkeitsgrad und eine sehr gute und
atmosph&auml;rische grafische Gestaltung sorgen f&uuml;r ein sehr positives Geamt-
bild.
</P>
<P>
&quot;Dauerspannung, R&auml;tselvielfalt und Supergrafiken sorgen daf&uuml;r, dass mit
&quot;The Secrets of Luxor&quot; ein neuer Stern am Adventure-Himmel erstrahlt.&quot;
</P>
<B>Emulationsgeschwindigkeit:</B>
<P>
Ohne es sicher zu wissen vermute ich, dass sich die Geschwindigkeit auf
einem System ohne Grafikkarte in Grenzen h&auml;lt. Gerade bei der Bewegung
d&uuml;rften die &uuml;berblendungen, &auml;hnlich wie bei anderen Spielen dieses Genres,
relativ langsam ausfallen. F&uuml;r eine genauere Beschreibung w&auml;re ich
nat&uuml;rlich dankbar.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele8.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele10.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
