<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. Mac-Ecke</H2>
<H3>5.1. Vorwort</H3>
<P>
Alle die Leser, die die Mac-Ecke nicht vollkommen &uuml;bersehen, werden
festgestellt haben, dass der Informationsanteil in der letzten Ausgabe
der AAkt extrem mager ausfiel. Die naheliegende Vermutung, dass dies an
fehlenden Artikeln meinerseits lag, muss ich sch&auml;ndlicherweise best&auml;tigen.
Schuld daran war neben meiner akuten Zeitknappheit vor allem eine,
durch die Telekom erzwungene, Online-Abstinenz.
</P>
<P>
Doch auch ein kurzer Blick auf die jetzige Ausgabe offenbart eine
leidige Artikelarmut. Leider gibt es auch daf&uuml;r einen triftigen Grund: denn
ein Tag, bevor endlich mein Telefonanschluss freigeschaltet wurde, gab mein
Amiga den Geist auf! Bis ich also eine neue Hauptplatine habe, muss ich
wohl oder &uuml;bel zur&uuml;ckstecken.
</P>
<P>
Aus diesem Grund fasse ich mich diesen Monat kurz. Erw&auml;hnen m&ouml;chte ich
lediglich eine EMail, die mich erreichte. Hierin wurde ich auf einen
Fehler in der Kompatibilit&auml;tsliste hingewiesen - was leider wieder
beweist, dass man sich auf diese nicht 100-prozentig verlassen kann und
sollte. Das Spiel &quot;Imperialismus&quot; ist demnach nicht auf 68k-Rechnern
lauff&auml;hig!
Aus diesem Grunde rate ich jedem, der irgendein Mac-Spiel ordert, und
nicht explizit weiss, dass es auf dem eigenen Rechner l&auml;uft, bei der
Bestellung noch einmal nachzuhaken - denn auch ich bin bei dieser Liste auf
die Informationen aus Produktbeschreibungen, Tests oder Herstellerangaben
angewiesen; und die halten es scheinbar nicht immer f&uuml;r n&ouml;tig, einen PPC
als Systemvoraussetzung anzugeben.
</P>
<P>
Trotzdem hoffe ich, dem ein oder anderen mit dieser Liste oder meinen
Spiel-Vorstellungen weiterhelfen zu k&ouml;nnen. Ich w&uuml;nsche euch deshalb auch
in dieser sp&auml;rlichen Ausgabe viel Spaá beim Lesen und hoffe, n&auml;chsten Monat
wieder einen funktionsf&auml;higen Amiga und analog aktuellere und vor allem
mehr Informationen vorweisen zu k&ouml;nnen.
</P>
<P>
Andreas Koch
</P>
<HR>
<B>Nachtrag:</B>
<P>
Kurz vor dem Absenden der Artikel habe ich meinen Amiga doch noch zum
Laufen bekommen. Die n&auml;chste Ausgabe d&uuml;rfte also wieder etwas ausf&uuml;hrlicher
werden. Trotzdem w&auml;re es nat&uuml;rlich besser, wenn ihr dennoch einen Blick auf
den Aufruf werfen w&uuml;rdet...
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
