<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Simon the Sorcerer 2 erscheint bei Epic Marketing
</LI>
</UL>
<P>
Der Adventureknaller Simon the Sorcerer 2 kommt nun tats&auml;chlich
noch f&uuml;r den Amiga. Epic Marketing hat sich die Rechte an dem
anscheinend sogut wie fertigen Spiel gesichert. Simon the Sorcerer 2
sollte urspr&uuml;nglich schon 1995 f&uuml;r den Amiga ver&ouml;ffentlicht
werden, wurde dann aber eingestellt.
</P>
<UL>
<LI> Foundation D.C. brach Verkaufsrekorde
</LI>
</UL>
<P>
Wer sagt denn, dass sich am Amiga keine Spiele mehr verkaufen
lassen? Foundation D.C. (Directors Cut) hat auf der Home Electronics
World in K&ouml;ln alle Verkaufsrekorde gebrochen. Laut Paul Burkey,
Hauptentwickler des Spiels, hat es sich so gut verkauft, dass
fast alle Exemplare &uuml;ber den Tisch gingen. Er arbeite jetzt so
engagiert wie noch nie an dem Nachfolger. Ein ausf&uuml;hrliches
Review zu Foundation D.C. k&ouml;nnt ihr in der n&auml;chsten AMIGA aktuell
Ausgabe lesen.
</P>
<UL>
<LI> Heretic 2 Betaversion
</LI>
</UL>
<P>
Steffen H&auml;user hat einige Geschwindigkeitstests mit der Heretic 2
Betaversion durchgef&uuml;hrt. Dabei wurde die Amiga Geschwindigkeit
mit der PC Geschwindigkeit verglichen. Es wurden au&szlig;erdem nur
die Softwarerenderer getestet, wobei sich herausgestellt, dass
die Amiga Version der PC Version in Sachen Geschwindigkeit
eigentlich in nichts nachsteht. Wenn der Hardwarerenderer aber
erstmal fertig sei, lie&szlig;en sich noch weitaus bessere Ergebnisse
erzielen.
</P>
<UL>
<LI> Operation: Siberian Counterstrike?
</LI>
</UL>
<P>
Vor ein paar Monaten gab Blue Black Solutions bekannt, dass
ihr Command&amp;Conquer Klon Operation: Counterstrike in Siberian
Sun umbenannt wurde. Nun hat man es sich anscheinend wieder
anders &uuml;berlegt; das Spiel l&auml;uft jetzt wieder unter dem
Originalnamen Operation: Counterstrike. Au&szlig;erdem l&auml;uft das
Spiel jetzt nur noch auf Amigas mit 16MB Ram sowie einem
68060 Prozessor.
</P>
<UL>
<LI> The Holy Trinity
</LI>
</UL>
<P>
Seit langem gibt es mal wieder was vom RPG Adventure The Holy
Trinity zu berichten: Laut den Entwicklern von Digital Visionaries
geht das Spiel nun in die letzte Entwicklungsphase. Es w&uuml;rden
nun Texturen und die Charaktere eingebaut werden und dann sei
das Spiel fertig. The Holy Trinity ben&ouml;tigt mindestens einen
68030 Prozessor sowie 16MB Ram.
</P>
<UL>
<LI> eXtra Life: The Best of Games
</LI>
</UL>
<P>
Bei Epic Marketing ist eine neue Spiele CD-ROM mit dem Namen
&quot;eXtra Life: The Best of Games&quot; erschienen. Diese CD-ROM
enth&auml;lt die angeblich 200 besten PD-Spiele f&uuml;r den Amiga.
Einige Spiele wurden angepasst, damit sie auch auf 68040
und 68060 Amigas lauff&auml;hig sind. Au&szlig;erdem sind einige Spiele
jetzt sogar auf Grafikkarten spielbar.
</P>
<UL>
<LI> Lambda
</LI>
</UL>
<P>
Die Lambda Website wurde mal wieder aktualisiert. Momentan
arbeite man &quot;intensiv&quot; an der OpenGL Implementierung...
Mal sehen, vielleicht erscheint das Spiel ja doch noch
irgendwann.
</P>
<UL>
<LI> TWOM2: Ghelae and the Death-Sword
</LI>
</UL>
<P>
Ein neues Fantasieabenteuer mit dem Namen TWOM2 wurde von F1
Software angek&uuml;ndigt. Ziel des Spiels ist es die Welt zu retten.
TWOM 2 bietet unter anderem 30 interaktive Figuren, detaillierte
Grafiken und knifflige R&auml;tsel. TWOM2 soll Anfang dieses Monats
erscheinen.
</P>
<UL>
<LI> Explorer 2260
</LI>
</UL>
<P>
Die Entwickler von Explorer 2260, The World Foundry, haben
bekanntgegeben, dass Explorer 2260 nur noch auf Grafikkarten
lauff&auml;hig sein wird.
</P>
<UL>
<LI> Bubble Heroes
</LI>
</UL>
<P>
Diesen Monat wurde eine erste Demoversion von Bubble Heroes
ver&ouml;ffentlicht, welches von Crystal Software vertrieben
wird. Wann die Vollversion erscheint, wurde noch nicht
bekanntgegeben. Die Demoversion kann auf jeden Fall schon
mal von <A HREF="http://www.made.net/~arcadia/" TARGET="_TOP">http://www.made.net/~arcadia/</A> geladen werden.
</P>
<UL>
<LI> Exodus - The Last War
</LI>
</UL>
<P>
Von Exodus - The Last War wurde diesen Monat eine rund
6 Megabyte fassende Demoversion ver&ouml;ffentlicht. Das Demo
macht einen guten Eindruck und wird in der n&auml;chsten
Ausgabe genauer unter die Lupe genommen werden.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
