<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Vorwort</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Main.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Intern.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Vorwort
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Vorwort (mit R&uuml;ckblick auf den vergangenen Monat)</H1>
<P>
+++ Home Eletronics World mit geringem Interesse bei Ausstellern und
Besuchern +++ Ger&uuml;chte &uuml;ber einen m&ouml;glicherweise kurz bevorstehenden
Verkauf AMIGAs verdichten sich +++
</P>
<P>
Willkommen damit zur neuen Ausgabe von AMIGA aktuell.
</P>
<P>
Abgesehen von der K&ouml;lner Computermesse, Home Electronics World, die Mitte
November stattfand, verlief der vergangene Monat weitgehend unspektakul&auml;r.
Allerdings scheint an den j&uuml;ngsten Ger&uuml;chten wonach Gateway Verhandlungen
&uuml;ber den Verkauf seiner Amiga-Rechte f&uuml;hrt, etwas Wahres dran zu sein. Mehr
dazu im Schlusswort dieser Ausgabe.
</P>
<P>
Die Interna der heutigen Ausgabe:
</P>
<UL>
<LI> Leider muss Markus Tillmann den f&uuml;r diese Ausgabe vorgesehenen
  Messebericht &uuml;ber die Home Electronics World wegen eines Hardwaredefekts
  auf die n&auml;chste Ausgabe verschieben. Die wichtigsten Neuigkeiten sind
  jedoch auch in den verschiedenen Rubriken dieser Ausgabe enthalten.
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Zu den regelm&auml;&szlig;igen Aufrufen:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> Weiterhin gesucht werden Tester von frei kopierbarer Software. Jeder, der
  sich f&uuml;r diese Aufgabe bereit erkl&auml;rt, wird in eine spezielle
  Verteilerliste eingetragen und erh&auml;lt dann in unregelm&auml;&szlig;igen Abst&auml;nden
  Test-Vorschl&auml;ge. Nat&uuml;rlich freuen wir uns aber genauso &uuml;ber Tests
  kommerzieller Produkte und nicht &uuml;ber die Verteilerliste vorgeschlagener
  FD-Software. Schreibt an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A> .
</LI>
</UL>
<P>
Viel Spa&szlig; jetzt bei dieser Ausgabe,
</P>
<P>
euer
</P>
<P>
Carsten Schr&ouml;der
</P>
<P ALIGN="RIGHT">
<A HREF="Main.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Intern.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
