<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Der Commodore-Untergang aus meiner Sicht - Teil 2 (von Rainer Benda)</H2>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&raquo;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<H3>Warum hat Commodore den Vertrieb von OS-Kopien nicht unterbunden?</H3>
<P>
Unsere Abteilung (W. H&auml;ring und meiner einer) hatten seinerzeit die
Aufgabe, gewisse Testk&auml;ufe zu t&auml;tigen, um schwarze Schaaaaafe ausfindig
zu machen und ihnen auf die Finger zu klopfen. Das umfasste den Einkauf
von Kickstart-Umschaltplatinen genauso wie einzelne System-Disketten
(eingekauft bei Omega-Datentechnik, Mainhattan-Data etc.).
</P>
<P>
Entweder bekamen wir gef&auml;lschte OS-Disketten (nichtmal mit nachgemachten
Commodore Aufklebern) auf den Tisch, oder Umschaltplatinen mit Beta-
Rom's, die f&uuml;r diesen Rechner (OS 3.0 im A2000 z.B.) gar nicht gedacht
waren.
</P>
<P>
Wir legten das der Gesch&auml;ftsleitung vor. In einem Gespr&auml;ch meinte dann
unser Vertriebsleiter f&uuml;r High-End Ger&auml;te (PC's, Amiga's ab A3000) Gregor
Ruppert, ob wir diese H&auml;ndler (!) nicht lieber in unser Vertriebsnetz
integrieren sollten, wenn sie zu solchen Leistungen in der Lage seien.
</P>
<P>
Um es sich nicht auch noch mit Amiga-H&auml;ndlern zu verscherzen, hat man dann
auf rechtliche Schritte verzichtet und die Aktion &quot;Testeink&auml;ufe&quot; wurde
eingestellt. F&uuml;r mich dann das Zeichen, da&szlig; Commodore diese Aktionen
duldet, auch wenn es nie offiziell best&auml;tigt wurde.
</P>
<H3>Ist die Verbreitung von OS-Software &uuml;ber Mailboxen/Internet legal ?</H3>
<P>
Diese Frage ist eigentlich mit einem JAIN zu beantworten. Commodore konnte
seine Support-Probleme eigentlich nie richtig in den Griff bekommen.
Irgendwie war man immer froh, wenn man User an H&auml;ndler weiterleiten konnte,
die dann Hilfe leisteten.
</P>
<P>
Als dann mit der Zeit immer mehr Amiga-H&auml;ndler wegbrachen (Konkurs etc.)
wurde nach einer anderen Support-L&ouml;sung gesucht und dann auch gefunden. Es
gab bereits eine ComBo (Commodore Mailbox) dessen Sysop Anfangs Doc Peter
Kittel war. Leider war das System mit der Zeit in die Jahre gekommen und es
fehlte auch die Zeit, sich so richtig um das System zu k&uuml;mmern.
</P>
<P>
Ich schlug daher eine Neuauflage der ComBo-Mailbox vor, &uuml;ber den dann auch
der Support abgwickelt werden k&ouml;nnte. Zu dieser Zeit ging es Commodore
nicht mehr ganz so gut. Die Box sollte uns entlasten, damit wir nicht
dauernd Disketten kopieren mussten, oder diese sogar kopieren lassen
mussten (finanzieller Aufwand war einerseits zu hoch, andererseits w&auml;re f&uuml;r
sowas auch kein Geld mehr ausgegeben worden). Uwe Trebbien, der seinerzeit
f&uuml;r den Entwickler-Support verantworlich war, hatte zwar eine gewisse
Anzahl Disketten, die er verschicken konnte, nur fehlten sie dann unter
Umst&auml;nden unseren Entwicklern.
</P>
<P>
F&uuml;r die neue ComBo wurde ein A3000T eingerichtet, mit (puh, lang ist es
her) 4 analogen- und zwei ISDN-Leitungen. In diesem System wurden dann die
Amiga spezifische Software abgelegt. Zum Teil auch die Commodore PC-
Software, die aber keine besonders gro&szlig;e Rolle spielte (unser letzter PC-
Direktor bestand darauf - er meinte auch, es sei doch egal auf welchem
System die Box nun laufe...tsts :)) ).
</P>
<P>
Mein Grundgedanke lag eigentlich in der kostenlosen Bereitstellung der
Software, gegen die sich unser letzter technischer Direktor &quot;Wolfgang
Trompetter&quot; wehrte, da er meinte, die Sache m&uuml;sse wenigstens etwas Geld
einbringen, weil die Gesch&auml;ftsleitung (Helmut Jost) sonst gar nicht
mitspielen w&uuml;rde. Ich argumentierte zwar, da&szlig; die Anrufer schon die
Telefonkosten daf&uuml;r zu tragen h&auml;tten und Commodore die User nicht dauernd
so vor den Kopf sto&szlig;en solle (am liebsten h&auml;tte ich das Projekt komplett
gecancelt, doch besser das als gar nichts). F&uuml;r einen gewissen User-Beitrag
(H&ouml;he war glaube ich ca. 100 DM im Jahr - Entwicklerzug&auml;nge waren
kostenfrei) hatten dann Enduser Zugriff darauf. Das ganze System lief
soweit &quot;zufriedenstellend&quot;. Damit die Box aber dennoch weiterlaufen konnte,
musste ich monatliche Statistiken vorlegen, um der Box eine
Daseinsberechtigung zu verschaffen und um meinen Arbeitsplatz zus&auml;tzlich zu
&quot;rechtfertigen&quot; (im Jahr '93 wurden Kollegen im 10er Pack entlassen).
</P>
<P>
Nach meinem Weggang zum 30.09.93 (13 Kollegen durften dann mit mir gehen -
die Info bekam ich telefonisch w&auml;hrend meines Urlaubs von Wilfried H&auml;ring,
der mir best&auml;tigte, da&szlig; meine Annahme richtig gewesen sei - ich sagte ihm
vor meinem Urlaub, da&szlig; ich nicht glaube noch einen Arbeitsplatz bei meiner
Wiederkehr zu besitzen....) f&uuml;hrte Doc Peter Kittel die ComBo Mailbox bis
zum endg&uuml;ltigen Aus von Commodore bis M&auml;rz/April 1994 weiter.
</P>
<P>
Tja, was sollte nun mit der ComBo passieren ?
</P>
<P>
Die Gefahr bestand, da&szlig; die Inhalte f&uuml;r immer verloren gingen, der Rechner
und das Zubeh&ouml;r auseinandergerissen w&uuml;rden....Doc Peter Kittel hatte das
verhindert und nach Terminabsprache gelangte die Software der ComBo in
meine H&auml;nde. Da ich bereits seit 1990 eine eigene Mailbox betrieb (Black-
Zone), integrierte ich die ComBo-Software soweit vorhanden.
</P>
<P>
Der Konkurs von Commodore zog sich &uuml;ber einige Jahre hin. Wenn ich mich
richtig erinnere, war die Aktion erst ca. 3 Jahre sp&auml;ter beendet. Der
damalige Konkursverwalter &quot;Herr Hembach&quot; (wie unter www.amiga-news.de zu
lesen war, vor kurzem im Alter von 55 Jahren verstorben) hatte in einem
Nebengeb&auml;ude von Commodore seinen &quot;Verwaltungssitz&quot; und zwei f&uuml;r diesen
Zweck verbliebene Commodore-Mitarbeiterinnen. Ich habe &uuml;ber diesen Weg dann
kl&auml;ren lassen, ob es rechtliche Bedenken bei der Bereitstellung der
ehemaligen Commodore Software g&auml;be, dies wurde verneint.
</P>
<P>
Damit war f&uuml;r mich der Weg frei, die Software f&uuml;r jedermann zug&auml;nglich zu
machen, zumal die Zukunft des Amiga's immer ungewisser wurde. Auf diesem
Weg konnte ich dann auch endlich meinen Grundgedanken umsetzen, die
Software kostenfrei zur Verf&uuml;gung zu stellen.
</P>
<P>
Die Gefahr, da&szlig; sich jemand auf diesem Weg zu einer OS-Version verhalf war
sicherlich gegeben, aber auch zu vernachl&auml;ssigen. Hatte jemand ein ROM,
fehlten immer noch die Disketten und die Handb&uuml;cher. Die Disketten bekam er
zwar bei mir, die Unterlagen fehlten dann immernoch. Die Abrufzahlen der
letzten Jahre belegt f&uuml;r mich auch, da&szlig; sicherlich der kleinere Anteil
&quot;illegal&quot; gehandelt hat, denn daf&uuml;r waren sie einfach zu gering. Klar, die
Commodore Software fand sich auch in anderen Boxsystemen wieder, daf&uuml;r
musste _ich_ allerdings nicht herhalten und es lag in der Verantwortung der
anderen Sysops, ob sie die Commodore Software anboten oder nicht. Manche
Sysops fragten mich um Erlaubnis die Software anbieten zu k&ouml;nnen.....bei
mir pers&ouml;nlich bekannten Sysops habe ich sie dann auch &quot;erteilt&quot;. :))
</P>
<P>
Anzumerken sei vielleicht noch, da&szlig; Village Tronic die OS-Pakete zu ESCOM-
Zeiten nur komplett verkaufte (verkaufen durfte) und es einfach niemanden
gab, der bei defekten Disketten h&auml;tte Ersatz liefern k&ouml;nnen. Erst viel
sp&auml;ter wurden die OS-Pakete dann auseinandergerissen und in Teilen
angeboten.
</P>
<P>
Zu meinem sp&auml;teren Gastspiel bei Amiga Technologies sp&auml;ter noch ein paar
Worte, jedenfalls war es auch da geplant wieder ein Mailboxsystem
aufzubauen und als Support-Mittel zu verwenden. Dazu kam es dann allerdings
nicht mehr. Petro Tyschtschenko wusste nat&uuml;rlich zu dieser Zeit, da&szlig; ich
die Commodore-Software &uuml;ber mein System anbot. Es w&uuml;rde mich wundern, wenn
er nun im Nachhinein etwas dagegen h&auml;tte, die Software (nun &uuml;ber das
Internet) verf&uuml;gbar zu machen.
</P>
<P>
Ich denke schon, da&szlig; die Betreuung des Software-Archivs (manche Sachen
d&uuml;mpeln sicherlich noch auf einigen Disketten bei mir herum) in ausreichend
guten H&auml;nden war.&laquo;
</P>
<P>
Fortsetzung folgt...
</P>
<P ALIGN="RIGHT">
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
