<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
6. AMIGA und KDH Datentechnik schlie&szlig;en Vertriebskooperation

»AMIGA INC. UND KDH DATENTECHNICK GEBEN STRATEGISCHE VERTRIEBS&Uuml;BEREINKUNFT 
BEKANNT

Snoqualmie, Wa. USA - Amiga Inc. ist erfreut, ihre Partnerschaft zum 
Vertrieb der neuen d'AMIGA Entwicklermaschine, der Amiga-Produktline der 
n&auml;chsten Generation, sowie der AMIGA-CLASSIC-Produkte mit KDH Datentechnik 
aus Horb/Stuttgart bekannt geben zu d&uuml;rfen.

"Wir sind gl&uuml;cklich f&uuml;r unsere k&uuml;rzlich bekannt gegebene d'AMIGA Developer 
Machine (Entwicklermaschine) in Europa hohe Standards sicher stellen zu 
k&ouml;nnen. G&uuml;nter ist seit vielen Jahren ein bekannter und respektierter 
H&auml;ndler und hat gro&szlig;e Anstrengungen unternommen, um eine Verf&uuml;gbarkeit der 
d'AMIGA Developer Machine f&uuml;r Entwickler und andere H&auml;ndler in Europa 
sicher zu stellen. Wir freuen uns, unserer Gemeinde eine wirtschaftliche 
L&ouml;sung anbieten und zus&auml;tzliche Unterst&uuml;tzung von Amiga f&uuml;r unsere 
Entwickler b&uuml;ndeln zu k&ouml;nnen. Die d'AMIGA Developer Machine ist f&uuml;r jedes 
Mitglied unserer Gemeinde von gro&szlig;em Wert. Wie wir bereits in der 
Vergangenheit erkl&auml;rten, haben wir weitere wertvolle Dinge zur d'AMIGA 
Developer Machine hinzugef&uuml;gt, die sonst nirgendwo verf&uuml;gbar sein werden. 
Wenn Ihre Machine nicht &uuml;ber die d'AMIGA Developer Machine Plakette 
verf&uuml;gt, wird sie nicht auf die gleiche Weise unterst&uuml;tzt werden. Wir 
ermutigen die Gemeinde in die d'AMIGA Developer Machine zu investieren, die 
nur &uuml;ber KDH, Deutschland vertrieben werden wird. Ebenso ermutigen wir 
andere H&auml;ndler mit KDH Kontakt aufzunehmen, zwecks Verf&uuml;gbarkeit f&uuml;r unsere
Kunden.", sagte Randy Hughes, Vize Pr&auml;sident f&uuml;r Verkauf und strategische 
Allianzen bei Amiga Inc.

KDH Datentechnik, ein sehr geachteter Name in der AMIGA Gemeinde, ist hoch 
erfreut, Teil der Zukunftspl&auml;ne von Amiga Inc. zu sein. Sie sind gl&uuml;cklich, 
als exklusiver Lieferant der d'Amiga Developer Machine in Europa benannt 
worden zu sein und rechnen damit, dass der Verkauf des SDK und der 
Entwicklermachine sich einem steigenden Wachstum erfreuen werden. G&uuml;nter 
Horbach, Pr&auml;sident von KDH Datentechnik, f&uuml;gt hinzu, "Wir sind stolz, Teil 
der neuen Amiga-Zukunft und in der Lage zu sein, die aktuelle Amiga-Classic 
Line und die Produkte der n&auml;chsten Generation f&uuml;r die Amiga-Gemeinde in 
Europa bereitstellen zu k&ouml;nnen. Eine enge und faire Gesch&auml;ftsbeziehung mit 
unseren Amiga Kunden und Amiga H&auml;ndlern ist der Schl&uuml;ssel in unsere 
Zukunft. Unser zufriedener Kundenstamm macht uns zu einem der gr&ouml;ssten 
Amiga Versandh&auml;ndler in Europa. Wir m&ouml;chten diese Gelegenheit nutzen, 
unseren Kunden weltweit daf&uuml;r zu danken, dass wir sie betreuen durften und 
f&uuml;r die Unterst&uuml;tzung der derzeitigen Angebote von Amiga. Wir ermutigen die 
Anwender-Gemeinde sowie die anderen H&auml;ndler den gro&szlig;artigen Wert der 
d'AMIGA Developer Machine zu erforschen und beantworten gerne Ihre Fragen. 
Unsere Kunden ermutigten uns &uuml;ber die Jahre die Amiga-Plattform zu 
unterst&uuml;tzen und tun dies auch im Falle des Next Generation Amiga. Die 
Zufriedenheit der Kunden, freundlicher und unkomplizierter Service, 
zusammen mit den besten, technischen Fachkenntnissen kennzeichnen KDH. 
Diese Qualit&auml;ten sowie die Vision von Amiga Inc. sichern uns Allen eine 
strahlende Zukunft."

Es ist Amigas Misson, DIE Plattform zu liefern, Architekur und Tools f&uuml;r 
das kommende Universum der digitalen Inhalte. Dabei werden wir auf 
einzigartige Weise unsere Partner in die Lage versetzen, Produkte zu 
erzeugen, die die Versprechen des digitalen Zeitalters n&auml;her bringen 
werden. Das Erscheinen unseres ersten Produktes, das Amiga Software 
Development Kit (SDK) und jetzt die d'AMIGA Developer Machine, aktiviert 
tausende von Entwicklern, die der alten Plattformen - geschaffen f&uuml;r 
Dienste von Gestern - m&uuml;de sind, sich den zehntausenden von extistierenden 
Amiga-Entwicklern jetzt anzuschlie&szlig;en, die bereits mit Amiga an den 
Inhalten von heute und morgen arbeiten.

F&uuml;r weitere Informationen besuchen Sie bitte http://www.amiga.com.

F&uuml;r weitere Informationen zu KDH Datentechnik nehmen Sie bitte Kontakt auf 
mit:

Randall P. Hughes
Vice President Sales and Strategic Alliances
Amiga Inc.
mailto:randy@amiga.com

G&uuml;nter Horbach
Pr&auml;sident KDH Datentechnik
http://www.kdh-datentechnik.com«

(Quelle: KDH Datentechnik)    

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
