<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Neues zum AmigaNG
-----------------

1. AmigaNG-Entwicklerrechner »d'AMIGA« erschienen

»d'AMIGA

Die Workstation f&uuml;r Amiga-Entwickler

Als direkte Antwort auf viele Anfragen nach einer wirtschaftlich tragbaren 
Workstation f&uuml;r den Einsatz zur Entwicklung auf der Amiga-Plattform freuen 
wir uns, die Auslieferung der d'AMIGA-Entwickler-Workstation bekannt geben 
zu k&ouml;nnen. Der d'AMIGA ist f&uuml;r unsere Gemeinschaft au&szlig;ergew&ouml;hnlich wertvoll 
in seiner Funktionalit&auml;t und Unterst&uuml;tzung. Eigenschaft um Eigenschaft - er 
stellt den Amiga-Freunden und anderen Amiversum-Entwicklern die g&uuml;nstigst 
m&ouml;gliche Leistungsf&auml;higkeit und eine umfassende Unterst&uuml;tzung auf einer 
standardisierten Plattform zur Verf&uuml;gung.

Die d'AMIGA-Entwickler-Workstation bekommen Sie von Ihren bevorzugten 
H&auml;ndlern, die von folgenden Gro&szlig;h&auml;ndlern in ihren jeweiligen Bereichen 
beliefert werden:
 
   o USA - Software Hut Inc.
   o Canada - Wonder Computers International Inc
   o UK - Eyetech Group Ltd.
   o Europa - KDH Datentechnik
   o Australien - Unitech Electronics

Bitte setzen Sie sich mit dem H&auml;ndler Ihrer Wahl oder mit den oben 
genannten Gro&szlig;h&auml;ndlern in Verbindung, um sich &uuml;ber die bei Ihnen geltenden 
Preise zu informieren und die Lieferung Ihrer d'AMIGA-Entwickler-
Workstation noch heute in die Wege zu leiten.«


»Die d'AMIGA-Entwickler-Workstation

Der d'AMIGA ist DIE L&ouml;sung f&uuml;r Entwickler im Amiversum, die 
au&szlig;ergew&ouml;hnliche Wertigkeit und Unterst&uuml;tzung mit einer vollst&auml;ndigen 
Entwickler-Workstation suchen.

TECHNISCHE BESCHREIBUNG
 
   o Motherboard Gigabyte GA-5AX
   o CPU AMD K6-11 3D 500Mhz
   o Speicher 128 Mbyte SDRAM DIMM PC100
   o Festplatte 10 Gbyte IDE
   o CD-ROM 40X
   o Floppy 1.44 Mbyte
   o Sound Creative Sound blaster Live PCI-16
   o Grafikkarte Matrox G400 Dual Head
   o Lautsprecher 160 W
   o Netzwerkkarte Linksys NC100 v2.0
   o Garantie 2 Jahre 'Sealed Case' P&L

 Software:

   o Redhat Linux 6.1 vorinstalliert
   o AMIGA Software Development Tool Kit
   o Amiga Inc. ADN Support Package Trailblazer Level. Ein $1000-Wert
      o Bearbeitung in 24 Stunden bei Eingaben, Anfragen, Informationen,
        Tools, Dokumenten und Beta-Arbeiten vom Zeitpunkt der Verf&uuml;gbarkeit
        gegen&uuml;ber allgemein 7 Tagen zur Gemeinschaft.
      o Beta-Software ist erh&auml;ltlich &uuml;ber das ADN (Amiga Developers         
        Network)
      o Faq-O-Matic
      o 15% Rabatt bei Entwickler-Konferenzen
      o 15% Rabatt bei gedruckten und gehefteten Dokumenten
      o DatenSammlung zum Durchsuchen nach Bugs, Beta-Testern und           
        Entwicklern
      o Vollst&auml;ndige Zusammenstellung von Ergebnissen, Entwicklungsst&auml;nden,
        die dem Bugzilla und Faq-O-Matic entnommen wurden, alles zusammen
        gestellt in einer nach Dringlichkeit geordneten Online-             
        Datensammlung.
      o Bugzilla
      o Beispiel-Codes
      o Gesamtes Entwickler-Material, die Online-Entwickler-Mall 
        (-"Einkaufsstra&szlig;e") und weitere &uuml;ber das Web erreichbare Tools
      o Schwarzes Brett
      o Online-Entwickler-Dokumente
      o Mailinglists
      o Internet-Nachrichtendienst
   o IRC (Internet Relay Chat) mit internen Programmierern von AMIGA Inc.
     und dem leitenden Management
   o Monatliche Mitteilungen durch den CEO (Chief Executive Officer) an
     die Entwickler - Keine &Uuml;berraschungen mehr!

Der d'Amiga ist erh&auml;ltlich von Wonder Computers International und Software
Hut.«

Die &Uuml;bersetzungen aus dem Englischen stammen von Gernod Schomberg.
(Quelle der Originale: jeweils AMIGA, Inc.)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
