<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
11. Kurzmeldungen (von Oliver Tacke)

---------------------------------------------------------------------------
 Software
---------------------------------------------------------------------------

 Das zweite Update f&uuml;r OS3.5 (BoingBag 2) soll den bisher nur als
 Demoversion enthaltenen TCP/IP-Stack Miami durch die Vollversion von
 Genesis ersetzen. Dies teilte der Haage&Partner-Gesch&auml;ftsf&uuml;hrer &ouml;ffentlich  
 mit.

 Voyager V3 wird demn&auml;chst eine neue Layout Engine erhalten, die in der
 HTML-Darstellung im besten Fall um ein Vielfaches schneller sein soll als
 die bisherige.
 [http://v3.vapor.com/index.php?finger=owagner]

 Von MakeCD liegen die Version 3.2c und 3.2d. Letztere ist eine Betaversion
 und enth&auml;lt Unterst&uuml;tzung f&uuml;r DAO mit ATAPI-Laufwerken sowie Sony-Treiber.
 [http://makecd.core.de]

 Ein Update von Easys! auf Version 4.8 ist erschienen. Unter anderem wurden
 Probleme des Installerskripts von der CD V4.7.2 behoben.

 F&uuml;r das Programm Amiga Writer ist ein Patch auf V2.2 herausgegeben worden.
 Unter anderem k&ouml;nnen nun Dateien aus FinalWriter und Wordworth geladen
 werden.
 [http://www.haage-partner.com/d.htm]

 Die aktuelle Version der Webserversoftware Apache ist 1.3.12 mit mod_php,
 PHP Version 4.0.1 und Patch Level 2.
 [http://www.stud.uni-karlsruhe.de/~uck4/AmigaApache/]

 Vom DTP-Programm PageStream ist Version 4.7 verf&uuml;gbar.
 [http://www.haage-partner.com/]

 F&uuml;r die Brennersoftware BurnIt gibt es einen neuen Mastertreiber mit der
 Versionsnummer V2.72, der nun auch die CD-Brenner Teac54i und Ricoh8040
 unterst&uuml;tzt.
 [http://www.titan-computer.de]

 Es gibt wieder Neuigkeiten zum schon vor einiger Zeit angek&uuml;ndigten 
 Browser "Dry Ice". Unter Anderem findet man auch eine Alpha Version zum
 Download.
 [http://web.ukonline.co.uk/andrewmarkwell/dryice/]

 Photogenics Version 5 Beta Release 95 ist erschienen.
 [http://www.paulnolan.com/Amiga/download.html]

 Vom Zeichenprogramm ArtEffekt ist auf dem FTP-Server von Haage&Partner
 eine Demoversion der aktuellen Version 4 verf&uuml;gbar.
 [ftp://ftp.haage-partner.com/ArtEffect/ArtEffect4-Demo.lha]

 Service Pack 18 f&uuml;r GoldEd wurde ins Internet gestellt.
 [http://members.tripod.com/golded/studio08.htm]

 Au&szlig;erdem steht nun eine spezielle, frei erh&auml;ltliche Version von GoldEd 5
 zur Verf&uuml;gung.
 [http://golded.tripod.com/studio20.htm]

 Auch von Andreas Kleinert gibt es wieder Updates f&uuml;r seine Programme:
 akPNG.datatype V44.80, akMPEG2 V3.10 und akMPEG V4.46
 [http://home.t-online.de/home/Andreas_Kleinert/]

 IrseeSoft ver&ouml;ffentlicht eine Betaversion von Turboprint 7.12, die
 verbesserte HP Deskjet 9xx Treiber und einige verbesserte Canon und Epson
 Treiber bietet. Turboprint 7.10 oder 7.11 mu&szlig; bereits installiert sein.
 [http://www.irseesoft.de/tp712beta.lha]

 Jens Sch&ouml;nfeld gibt bekannt, da&szlig; das x-surf.device nun in Version 1.2 zur
 Verf&uuml;gung steht. Es k&ouml;nnen nun mehrere x-surf Karten in einem Amiga
 betrieben werden, der Duplexmodus wird gleich beim &Ouml;ffnen des Treibers
 aktiviert und ein Fehler im Promisc Modus wurde entfernt.
 [http://www.jschoenfeld.com/xsurf.lha]


---------------------------------------------------------------------------
 Hardware
---------------------------------------------------------------------------

 Das PCI Board namens "Mediator" f&uuml;r den Amiga 1200 und f&uuml;r Amigas mit
 ZorroIV Board kann bei Power-Computing vorbestellt werden. Das Board
 stellt 4 PCI 2.1 kompatible Slots zur Verf&uuml;gung und soll 129,95 Pfund
 kosten.
 [http://www.powerc.com/cgi-bin/psearch.cgi?page=/mediatorx.html&rn=244&aid
 =&uid=BEqPbgSpYdMC6&sid=&cid=4&act=ppage]

 F&uuml;r das PCI Board Mediator wurden von Power Computing mehrere
 Erweiterungsmodule angek&uuml;ndigt. Darunter befinden sich z.B. Grafikkarten
 basierend auf S3 Virge 4MB oder 3dfx Voodoo 3 16MB, ein MPEG-2 Hardware
 Decoder und ein USB-Controller.
 [http://www.powerc.com/cgi-bin/psearch.cgi?page=/mediatorx.html&rn=244&aid
 =&uid=BEqPbgSpYdMC6&sid=&cid=4&act=ppage]

 Elbox Computer und Vision Factory Development gaben Amiga-News per email
 (24.07.2000) bekannt, da&szlig; man zusammen an einer CyberGraphX L&ouml;sung f&uuml;r
 PCI Grafikkarten, die am PCI-Board Mediator betrieben werden, arbeite.
 [http://www.vgr.com/mediator/pressrelease1.txt]


---------------------------------------------------------------------------
 Verschiedenes
---------------------------------------------------------------------------

 Wir suchen dringend einen Mitarbeiter, der jeden Monat eine der Rubriken   
 »Tests und Erfahrungsberichte« ODER »Workshops« f&uuml;r unsere internationale  
 Ausgabe ins Englische &uuml;bersetzt. Grund ist, dass unser Mitarbeiter Jens    
 Neubauer mittlerweile leider beruflich sehr eingespannt ist. Meldet euch   
 bitte bei aakt@gmx.de

 Im Herbst k&ouml;nnte erneut eine vom Falke Verlag ausgerichtete Amiga Messe
 stattfinden. Eine Entscheidung falle nach Konsultation mit AMIGA in den    
 n&auml;chsten zwei Wochen, so Gesch&auml;ftsf&uuml;hrer Ali Goukassian.

 Wie Amiga-News am 15.07.2000 berichtete, ist ein neuer Amiga-Virus in
 Umlauf. Wie bisher bekannt ist, sind die "datatypes.library", "SetPatch"
 und der "Installer" betroffen. Der Rechner l&auml;&szlig;t sich nach Befall durch
 den Virus nicht mehr korrekt starten und st&uuml;rzt beim Setpatch Befehl ab.
 [http://www.amiga-news.de]

 Der Berliner Amiga Laden HD-Computer Technik aus der Pankstra&szlig;e ist
 umgezogen. Die neue Daten lauten: Hasenheide 9, 10967 Berlin,
 Tel.: 030-6959710


---------------------------------------------------------------------------
 Ger&uuml;chte
---------------------------------------------------------------------------

 Angeblich ist f&uuml;r November das Erscheinen eines Handhelds (tragbare
 Spielekonsole wie der Gameboy) auf Basis des ARM Prozessors und dem
 neuen AmigaOS geplant.

 Mehrere gro&szlig;e Firmen sollen Interesse bekundet haben, neue Amigas zu
 bauen, speziell die Handheld Variante. Darunter befinden sich Dell, IBM
 und - ironischerweise - Gateway.

Oliver Tacke &lt;O.Tacke@surfway.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
