<HTML>
<HEAD><TITLE>AmZeiger 06/97 - WB Tuning Teil: 1/6</TITLE></HEAD>
<BODY BACKGROUND="../images/BG.gif">
<CENTER>
<H1><U>WB Tuning Teil: 1</U></H1><BR>von<BR><A HREF="mailto:G.Franz@BBrandes.berlinet.de">Gregor Franz</A></CENTER><P>


Dieser Kurs widmet sich der Erleichterung der Arbeit mit der Workbench, der
Verbesserung ihrer Funktionen und auch ihrer Versch&ouml;nerung. Nat&uuml;rlich gibt es
unz&auml;hlige Programme, Patches usw. die dazu beitragen (wollen). Ich werde nicht
auf alle eingehen k&ouml;nnen, hoffe aber, da&szlig; hier ein paar Anregungen und Tips bei
sein werden, die noch nicht allen bekannt sind.<P>

Bei vielen Programmen gibt es spezielle Formen des Nutzungsrechtes. Es kann
sich z.B. um Shareware, Cardware o.&auml;. handeln. Ich gehe darauf nicht in jedem
Fall explizit ein. Eine Demoversion ist sogut wie immer frei erh&auml;ltlich. Als
Quelle fungiert das <A HREF="http://www.uni-paderborn.de/aminet/">AMINET</A>.<P>

Verschiedene Funktionen sind auch in Multifunktions-Commodities integriert, im
Teil 6 werde ich auf ein Beispiel hierf&uuml;r eingehen.<P>

<TABLE BORDER=0 ALIGN=CENTER>
<TR><TD COLSPAN=2>Der Kurs setzt sich aus folgenden Artikeln zusammen:</TD></TR>
<TR><TD><OL>
<LI> Optische WB-Verbesserung
<LI> Smarte ZusatzFX
<LI> Disk-Tuning
<LI> Hilfreiche C-Vitamine
<LI> Sonstige Helferlein
<LI> Beispiel f&uuml;r Multicommodities: MultiCX
</OL>
</TD><TD>#1<BR>#2<BR>#3<BR>#4<BR>#4 + #5<BR>#5</TD></TR></TABLE>
<BR>


<CENTER><H1>1. Optische WB-Verbesserung</H1></CENTER>

<B>Gleich</B> nach der Installation der Workbench steht fest, welcher Bereich als
Erstes `aufgebohrt` werden mu&szlig;. Die OriginalIcons, selbst bei OS 3.0 oder 3.1,
sind unertr&auml;glich h&auml;&szlig;lich.<P>

Erste Wahl daf&uuml;r ist <B><A HREF="http://www.sasg.com">MagicWB</A></B>, welches neben neuen, h&uuml;bschen Icons in
Pastell-Farbt&ouml;nen auch neue Hintergrundmuster und Standard-Zeichens&auml;tze
beinhaltet (z.B. XEN). Neben einer relativ alten und kostenfreien Demoversion
ist die Version 2.0 erh&auml;ltlich (30DM, Update 15DM), welche u.a. zus&auml;tzlich
einen MagicWB-Demon beinhaltet, der f&uuml;r die richtige Farbpalette sorgt und
MagicCopper, der unter AGA bestimmte Hintergrund- bilder um einem Farbverl&auml;uf
mit hunderten von Farbt&ouml;nen erweitert.<P>

Die wichtigste Neuerung sind aber sicherlich die ImageDrawer. Mit ihnen
bekommen schon die Schubladen ein aussagekr&auml;ftiges Aussehen. Die
Systempartition wird vollst&auml;ndig zum neuen Look umgewandelt. Die
Verzeichnis-Icons der anderen Partitionen kann man selbst mit vielen
mitgelieferten Icons und dem kleinen Zusatzprogramm `IconUpdate` umwandeln.
Dieses eignet sich im &uuml;brigen auch hervorragend f&uuml;r alle anderen Arten von
Icons, indem man zuerst das Quell-und dann das Ziel-Icon hineinzieht, welches
dann unter Beibehaltung der unver&auml;nderten Tooltypes (wichtig!) ersetzt wird.
<P>
Nach der `Sch&ouml;nheitsoperation` ist die Workbench kaum wiederzuerkennen.
Zahlreiche Pakete mit Icon-Sammlungen im MagicWB-Stil wurden und werden
ver&ouml;ffentlicht. Amiga-Programme werden immer h&auml;ufiger schon von Hause aus mit
den `magischen` Icons ausgeliefert und der MWB-Autor zeichnet auch f&uuml;r einen
Gro&szlig;teil des MUI-Designs verantwortlich. Man kann sicher mit Fug und Recht
behaupten, da&szlig; MagicWB zum Standard geworden ist.<P>

Sehr vehement dagegen verwahren, tuen sich die Anh&auml;nger des einzigen anderen
verbreiteten WB-Icon-Verbesserungspaketes, <B>NewIcons</B>.<P>

`NewIcons` ist nicht nur ein Icon-Austausch-Kit, sondern eine neue Art des
Umgangs mit Icons der Workbench. Daf&uuml;r mu&szlig; diese allerdings gepatcht werden.
Einige Vorteile stehen den Nachteilen gegen&uuml;ber.<P>

Der Umgang mit der Farbpalette wird flexibler, gerade Grafikkartenbesitzer
freuen sich &uuml;ber die M&ouml;glichkeit f&uuml;r wesentlich buntere Icons. Allerdings
werden die Icon-Grafiken als Textcode in den Tooltypes eines Dummy-Icons
gespeichert. Die Entschl&uuml;sselung dauert gerade bei gr&ouml;&szlig;eren Verzeichnissen
etwas l&auml;nger.<P>

Das Design der mitgelieferten Icons ist in meinen Augen sehr gew&ouml;hnungs-
bed&uuml;rftig, n&auml;mlich quietschbunt und isometrisch. Gerade letzteres ist
sicherlich ein schwieriger Stil auch f&uuml;r andere Hobby-Zeichner und hat eine
Verbreitung in dem Umfang wie bei MagicWB erschwert. Ein gro&szlig;er Vorteil soll
allerdings auch nicht verschwiegen werden: `NewIcons` ist Freeware, also
kostenlos.<P>

Soviel zu den gro&szlig;en Icon-Paketen. Nun zu anderen Tools im Zusammenhang mit
Icons. Die bekanntesten, weil qualitativ hochwertigsten Zusatzicon- Pakete f&uuml;r
MWB sind die <B>ROMIcons</B> von Roman Patzner, die im Moment nicht weitergef&uuml;hrt
werden.<P>

In `ROMIcons 8` schlug er eine neue Farbpalette vor, die volle 16 Farben auch
f&uuml;r MagicWB-Iser nutzbar machen sollte. Im Guide zu `ROMIcons 9` kann man genau
nachschlagen, wie sie zu installieren sind.<P>

Es handelt sich lediglich um eine Ver&auml;nderung der Werte des MagicWB-Demon. In
dieser Ausgabe sind auch viele phantastische Beispiele f&uuml;r Icons dieser Palette
mitgeliefert.<P>

Mit <B>PictIcon</B> von Chad Randall kann man mit der ROMIcon-Palette sehr leicht
Bilder zu Icons konvertieren und das mit guten Ergebnissen. Die Palette ist
kompatibel zur der originalen, allerdings erscheinen manche Fremd-Icons in
MWB-Format mit der ROM-Palette nun in Falschfarben. Es gen&uuml;gt jedoch sie mit
<B>328</B>, einem kleinen Hilfsprogramm, ebenfalls im PictIcon-Archiv enthalten,
umzuwandeln. &Uuml;brigens wird die Palette auch in `Iconian`, wahrscheinlich dem
besten Icon-Malprogramm, unterst&uuml;tzt.<P>

Soviel zu den Icons. Aber da gibt es auch noch einiges andere
Verbesserungsw&uuml;rdige. Zum Ersten w&auml;ren da die Cycle-Gadgets. Es ist schon
st&ouml;rend, wenn einen hinter diesen vielleicht ein Dutzend Optionen erwarten und
man sich Klick f&uuml;r Klick zu ihnen `hindurchdr&uuml;cken` mu&szlig; (bestes Beispiel
hierf&uuml;r sind die Monate bei dem Zeiteinsteller der WB).<P>

Mit <B>CycleToMenu</B> gibt es ein sehr n&uuml;tzliches und auch gut konfigurierbares
Commodity von F.Giannici, welches an der Position des CycleGadgets ein Men&uuml;
aufklappt, in dem man komfortabel seine Auswahl treffen kann. Selbst die
Aufklappverz&ouml;gerung ist hier einstellbar.<P>

Bleiben wir gleich bei den Men&uuml;s. Der bekannteste Vertreter der Gilde der
Men&uuml;verbesserer ist <A HREF="http://fsinfo.cs.uni-sb.de/~cattaneo/magicmenu/index.html">MagicMenu</A>, dessen neueste Versionen neuerdings von Olaf
Barthel (Term) programmiert werden.<P>

Das Design ist mit den neuen Versionen edel geworden und die
Konfigurationsm&ouml;glichkeiten &uuml;ppig. Nicht nur eine Designsver&auml;nderung der
Standard-WB-Men&uuml;s ist Aufgabe von MagicMenu. Es kann ebenso PopUp-Men&uuml;s
darstellen. Das hei&szlig;t, da&szlig; an der jeweiligen Mausposition bei Druck der rechten
Taste ein Men&uuml; aufklappt wird, aus dem gew&auml;hlt werden kann.<P>

Kleiner <B>Tip</B> am Rande: In der Anleitung wird davor gewarnt, die Option `Nicht
Blockierend` auszuschalten, da es sonst zu H&auml;ngern kommen kann und au&szlig;erdem das
Multitasking bei Men&uuml;operationen nicht ausgeschaltet wird (was z.B. ansonsten
als Blockierung jeder Bildschirmausgabe bei Men&uuml;aktivierung sichtbar wird). Bei
gro&szlig;en Men&uuml;s wird das ganze Handling aber sehr tr&auml;ge, was den Nutzen deutlich
schm&auml;lert. Bei mir traten im Test keine Probleme auf, wenn diese Option
deaktiviert war.<P>

Bleiben noch die Proportional-Gadgets (z.B. im Exchange der WB verwendet). Um
diese auf sch&ouml;nes 3D-Design `umzupolen` ben&ouml;tigt man <B>Prop3D</B>, welches man mit
mehreren Optionen in ENVARC: seinem Geschmack anpassen kann. Sogar XEN-Design
ist enthalten (MagicWB/ MUI).<P>

Einige Elemente der Workbench, die immer wieder ins Auge fallen, sind aber
gleich geblieben. Die Systemgadgets der Fenster und Schirme z.B. f&uuml;r
Schliessen, Gr&ouml;&szlig;e ver&auml;ndern etc. Daf&uuml;r gibt es <B>SysIHack</B>. Ein Patch, der schon
in der StartUp-Sequence aufgerufen werden mu&szlig; und diesen Elementen einen
professionellen 3D-Look gibt.<P>

Im selben Atemzug mu&szlig; man sicherlich <B>Urouhack</B> von Tinic Urou (TinyMeter)
nennen, welches auch noch die M&ouml;glichkeit der Einbindung von eigenen Designsets
an dieser Stelle bietet und zus&auml;tzlich auch u.a. normale Requestergadgets ins
XEN-Design umwandelt. Besonders deutlich wird diese Ver&auml;nderung z.B. bei
SnoopDos oder normalen ASL-Requestern.<P>

Requester sind auch das Stichwort. Denn mit <B>ARQ</B>, den animierten Requestern,
bekommen viele Standardmeldungen, wie `Diskette wieder in Floppy einlegen` u.&auml;.
eine kleine Animation neben den Text. Ein netter Gag, aber das Design ist
Geschmackssache.<P>

Das war schon ein ziemlicher Rundumschlag. Nun daher zu ein paar spezielleren
Extras. Wie etwa <B>Background</B>, einem kleinen Programm, das es erm&ouml;glicht, jedem
Workbench-Fenster oder jeder Fenster-Sorte (z.B. Disk- Fenster) seinen eigenen
Hintergrund anzeigen zu lassen. Bis jetzt wird die Konfiguration zwar noch
recht unkomfortabel &uuml;ber ein Text-Prefsfile gel&ouml;st, indem man als
Erkennungsmuster einen Teil des Fenstertitels angeben mu&szlig;, aber wer auf die
M&ouml;glichkeit wert legt, wird sich damit herumschlagen.<P>

Die <B>Tolle Uhr</B> geh&ouml;rt sicher zu den besten WB-Analoguhren. Ihr Aussehen ist
&auml;u&szlig;erst flexibel zu konfigurieren und sie bietet auch einen Alarm. In MagicWB
wird eine spezielle Konfig. mitgeliefert, die zum MWB-Outfit besonders gut
pa&szlig;t.<P>

Um jetzt noch einen letzten Tupfer auf Ihr, hoffentlich besonders sch&ouml;nes
WB-Hintergrundbild zu setzen, brauchen wir <B>BlueEyes</B>. Sie geh&ouml;ren zu den besten,
den Mauszeiger verfolgenden Augen f&uuml;r die Workbench. Nicht nur Paare, auch
einzelne Augen lassen sich platzieren und k&ouml;nnen in den neueren Versionen auch
mit dieser Position gespeichert werden. Wenn der Mauszeiger schlie&szlig;lich eine zu
lange Pause macht, so schlafen sie ein.<P>

So, das waren einige der wichtigsten Workbench-Versch&ouml;nerungs-Tips, denn: bei
einem bi&szlig;chen &Auml;sthetik am Arbeitsplatz (unserer Werkbank) macht das Ganze
nochmal so viel Spa&szlig;. :) Wir sehen uns bei `Smarten ZusatzFX` in der n&auml;chsten
AmZ-Ausgabe.
   
<P><HR>
<TABLE WIDTH=100%>
<TR><TD ALIGN=LEFT><A HREF="../HW/Picasso4.htm"><FONT SIZE=2>Prev</FONT></A></TD>
<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../AmZ0697/main.htm">Inhaltsverzeichnis</A></FONT></TD><TD ALIGN=RIGHT><A HREF="../AmZ0697/Postsack.htm"><FONT SIZE=2>Next</FONT></A></TD></TR>
<TR><TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@BBrandes.berlinet.de">Der AmZeiger</A></FONT></TD></TR></TABLE>
</BODY></HTML>


