<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>Buchvorstellungen</TITLE>
  </HEAD>

  <BODY background="images/bgb.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <A name="top"></A> 

          <P align="center"><FONT color="#000080" size=
          "7"><B>Buchvorstellungen</B></FONT></P>

          <P align="center"><FONT color="#000080" size="5"><B>von
          Nadine Alexander<BR>
           und Andreas Alexander</B></FONT></P>

          <H3>Inhalt:</H3>

          <UL>
            <LI><A href="#a01">Der Inquisitor, von Wolfgang
            Hohlbein</A></LI>

            <LI><A href="#a02">Die Zauberin, von Ruwenda, von
            Marion Zimmer Bradley</A></LI>

            <LI><A href="#a03">Katzenwinter, von Wolfgang und Heike
            Hohlbein</A></LI>

            <LI><A href="#a04">Ein Bergbauer erz&auml;hlt, von
            Reiner Regneri</A></LI>

            <LI><A href="#a05">About a Boy, von Nick
            Hornby</A></LI>

            <LI><A href="#a06">Tea-Bag, von Henning
            Mankell</A></LI>

            <LI><A href="#a07">Dunkel, von Wolfgang
            Hohlbein</A></LI>
          </UL>
          <HR>

          <P>In B&uuml;chern liegt die Seele aller gewesenen
          Zeit.<BR>
          Thomas Carlyle</P>
          <A name="a01"></A> 

          <H3>Buchtitel: Der Inquisitor<BR>
          Autor: Wolfgang Hohlbein<BR>
          Vorgestellt von: Eowyn<BR>
          Verlag: L&uuml;bbe<BR>
          Erscheinungsjahr: 1995<BR>
          ISBN: 3404136276<BR>
          Format: Digital</H3>

          <P><B>Inhalt:</B><BR>
          Deutschland im finstersten Mittelalter. Der Inquisitor
          Tobias wird nach Buchenfeld gerufen, einer Stadt im
          Norden des Reiches. von Dort erreichte seinen Abt ein
          Brief, eine hexe treibe in dem kleinen &Ouml;rtchen ihr
          Unwesen. Das Korn sei verfault, Tiere und Kinder
          k&auml;men mit Missbildungen zur Welt und selbst das
          Wasser sei vergiftet.</P>

          <P>Die Einwohner Buchenfelds geben Katrin, der Frau des
          Apothekers die Schuld an all dem Unheil. Doch als Tobias
          die der Hexerei Bezichtigte das erste mal sieht,
          &ouml;ffnen sich f&uuml;r ihn die Pforten in seine
          dunkelste Vergangenheit, denn er kennt Katrin, hat sie
          einst sogar geliebt.</P>

          <P>Nun steht er zwischen seiner Pflicht, die er der
          Kirche gegen&uuml;ber angenommen hat, seiner immer noch
          tiefen Gef&uuml;hle zu Katrin und dem Zorn der Einwohner
          Buchenfelds, die von der Schuld der Jungen Frau
          v&ouml;llig &uuml;berzeugt sind und sie somit auf den
          Scheiterhaufen w&uuml;nschen.</P>

          <P>Eine eindeutige Beweisfindung scheint f&uuml;r den
          Inquisitoren nicht m&ouml;glich, da er nur einseitige und
          gr&ouml;&szlig;tenteils abergl&auml;ubische und
          missg&uuml;nstige Aussagen der Dorfbewohner
          erh&auml;lt.</P>

          <P>Erschwerend kommt hinzu, dass Katrins Mann, der
          Apotheker vor einiger zeit eines sehr eigenartigen Todes
          gestorben ist, und man ist sich einig, sie m&uuml;sse ihn
          vergiftet haben.</P>

          <P>Aus dem Willen des Inquisitors, die noch immer
          geliebte Katrin zu retten wird langsam aber sicher der
          feste und teils begr&uuml;ndete Verdacht, sie habe keine
          Schuld an den kleinen und gro&szlig;en Katastrophen,
          welche seit l&auml;ngerer Zeit &uuml;ber Buchenfeld
          hereingebrochen sind.</P>

          <P>Unheimliche Schatten durchstreifen Buchenfeld und
          seine Umgebung in der Nacht, die Einwohner wagen sich
          nach dem Dunkelwerden nicht mehr vor die T&uuml;r und nur
          einige wenige sind klar und fest der Meinung, Katrin sei
          keine hexe. Worin sie allerdings die Ursache der
          unheimlichen Vorkommnisse sehen, deuten sie nur an oder
          verschweigen sie ganz.</P>

          <P>Doch Tobias scheinen dunkle Kr&auml;fte am Werk, die
          ganz und gar nichts mit Hexerei zu tun haben und auch
          nicht Schuld Katrins sind.</P>

          <P>So verstrickt er sich selbst immer weiter in die
          merkw&uuml;rdigen Ereignisse, die sich um das kleine
          &Ouml;rtchen ranken und findet schlie&szlig;lich auch
          sich selbst und sein Leben bedroht.</P>

          <P>Was passiert in Buchenfeld tats&auml;chlich?</P>

          <P>Was verheimlichen die B&uuml;rger?</P>

          <P>Und sind sie alle tats&auml;chlich so fest der
          Meinung, Katrin sei eine hexe, wie sie behaupten?</P>

          <P><B>Anmerkungen:</B><BR>
          Dieses Buch ist ein neuerliches Meisterwerk Hohlbeins.
          Nicht nur aufgrund seiner Schilderungen der Ereignisse,
          die auch hier wieder den Leser in ihren Bann schlagen,
          auch in der Darstellung des Inquisitors, der im Gegensatz
          zu den sonstigen Darstellungen mehr als nur ein paar
          Gef&uuml;hle zeigt und vor allem das rechte Urteil
          f&auml;llen m&ouml;chte, weil er sich selbst bewusst ist,
          dass viele der Anschuldigungen gegen Hexen ihre Ursache
          oft in Missgunst, Neid, Eifersucht oder einfachem
          Aberglauben haben.</P>

          <P>Trotz seiner Gef&uuml;hle sucht Tobias die ganze Zeit
          nach Beweisen, ob sie die Verd&auml;chtige nun ent- oder-
          belasten.</P>

          <P>Die Ereignisse verwickeln sich so sehr, dass jeder
          Verdacht, den der Leser haben k&ouml;nnte schnell
          zerstreut wird und man sich letztlich so verwirrt
          f&uuml;hlt, wie Hohlbein den Inquisitor schildert.</P>

          <P>Und eines ist gewiss. Die L&ouml;sung f&auml;llt
          schlie&szlig;lich ganz anders aus, als man es auch nur
          erwarten w&uuml;rde, selbst wenn man schon mehr als ein
          Buch von Hohlbein gelesen hat.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a02"></A> 

          <H3>Buchtitel: Die Zauberin von Ruwenda<BR>
          Autor: Marion Zimmer Bradley, Julian May<BR>
          Vorgestellt von: Rothaut<BR>
          Verlag: Heyne<BR>
          Erscheinungsjahr: 1995<BR>
          ISBN: 345309221X<BR>
           Format: Digital Ascii</H3>

          <P><B>Inhalt:</B><BR>
          Ruwenda, ein bl&uuml;hendes Land, wird seit Jahrhunderten
          von der Erzzauberin Binah besch&uuml;tzt. Als ihre
          Kr&auml;fte schwinden, &uuml;bergibt sie den drei
          Prinzessinnen, bei ihrer Geburt, Amulette mit der
          schwarzen Lilie. Einer mythischen Pflanze mit
          Zauberkraft. Die M&auml;dchen reifen zu
          wundersch&ouml;nen Frauen heran, doch dann werden die
          schlimmsten Bef&uuml;rchtungen von Binah Wirklichkeit.
          Der K&ouml;nig des benachbarten Labornok f&auml;llt in
          das Land ein und t&ouml;tet die K&ouml;nigsfamilie, nur
          die drei Prinzessinnen k&ouml;nnen fliehen. Binah schickt
          sie nun auf die Suche nach drei Talismanen, die
          zusammengef&uuml;gt ihre einzige Chance sind, das
          K&ouml;nigreich zur&uuml;ckzuerobern. Jede Prinzessin
          mu&szlig; ihre Aufgabe alleine ausf&uuml;hren. Und um zum
          Erfolg zu gelangen, m&uuml;ssen sie auch ihre eigenen
          Grenzen erkennen und &uuml;berwinden... Quelle:
          http://berg.heim.at/anden/420214/zauberinvonruwend</P>

          <P><B>Anmerkungen:</B><BR>
          Diese vielleicht etwas weniger bekannte Serie von Marion
          Zimmer Bradley und Coautoren hat ihren eigenen Reiz,
          f&uuml;hrt uns in eine Welt der Phantasie, aber auch
          gleichzeitig der realen menschlichen Konflikte. Wo ist
          die Grenze zwischen gut und b&ouml;se? Wo h&ouml;rt
          Verantwortung auf und beginnt Machtstreben?</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a03"></A> 

          <H3>Buchtitel: Katzenwinter<BR>
          Autor: Wolfgang und Heike Hohlbein<BR>
          Vorgestellt von: Eowyn<BR>
           Verlag: Verlag Carl Ueberreuter, Wien<BR>
          Erscheinungsjahr: 1997<BR>
           ISBN: 3-8000-2512-4<BR>
           Format: Digital</H3>

          <P><B>Inhalt:</B><BR>
           Das Stadtbild Crailsfeldens wird von einer
          niedergebrannten Klosterruine dominiert. Nach dem zweiten
          Weltkrieg wurde das ehemalige Kloster in ein Internat
          umgewandelt, welches schlie&szlig;lich bei einer
          Feuerkatastrophe, die auch einen Gro&szlig;teil
          Crailsfeldens zerst&ouml;rte ebenfalls niederbrannte.
          Doch noch immer scheint ein sp&uuml;rbarer d&uuml;sterer
          hauch von dieser Ruine auszugehen, den wohl alle
          Einwohner des kleinen St&auml;dtchens f&uuml;hlen, aber
          niemals erw&auml;hnen. Crailsfelden umgibt ein dunkles
          Geheimnis. In unregelm&auml;&szlig;igen Abst&auml;nden
          wird dieser sonst recht ruhige und beschauliche Ort von
          Wellen der Gewalt und Zerst&ouml;rung heimgesucht, welche
          augenscheinlich allein von den Einwohnern selbst ausgeht.
          Sie bringen Zerst&ouml;rung &uuml;ber ihre eigene Stadt,
          Vater k&auml;mpft gegen Sohn, Br&uuml;der gegen ihre
          Schwestern und jedes Mal fordert diese dunkle zeit nicht
          wenige Tote. Zu einer solchen Zeit brannte das ehemalige
          Kloster nieder und auch nun scheint sich wieder eine
          Welle von Zorn und hass &uuml;ber die Stadt
          niederzusenken. Und allein Justin scheint sich dessen
          v&ouml;llig bewusst. Er und seine Gro&szlig;mutter,
          welche allerdings einen unerkl&auml;rlichen und
          lebensgef&auml;hrlichen Unfall erleidet und so Justin
          nicht mehr helfen kann, das R&auml;tsel um die Stadt und
          das Kloster zu l&ouml;sen. Sie gilt im ganzen ort als
          eine Art Hexe und doch findet Justin bald heraus, dass
          sie die einzige ist, die es immer wieder geschafft hat,
          die schlimmsten Katastrophen zu verhindern. So sieht er
          sich selbst bald mit M&auml;chten Konfrontiert, die so
          alt wie die Menschheit sind, vielleicht &auml;lter, und
          kaum jemand kann ihm bei seinem Kampf um sein
          &Uuml;berleben, das seiner Eltern und vielleicht das der
          ganzen Stadt helfen. Allein die Katzen seiner
          Gro&szlig;mutter werden zu pl&ouml;tzlichen und hin und
          wieder auch etwas unheimlichen Verb&uuml;ndeten, sowie
          sich ein bis dahin Justin unbekanntes M&auml;dchen
          pl&ouml;tzlich als dienstbarer Geist zu erweisen scheint.
          Doch kann sie ihm wirklich helfen, als "Gespenster" aus
          der Vergangenheit wieder beginnen, ihren Schatten
          &uuml;ber Crailsfelden zu werfen? Und ist sie
          tats&auml;chlich seine Verb&uuml;ndete?</P>

          <P><B>Anmerkungen:</B><BR>
           Wolfgang Hohlbein hat mehrere B&uuml;cher geschrieben,
          die sich um die Stadt Crailsfelden drehen und eine Art
          fortlaufende und nicht ganz unblutige Geschichte dieser
          Stadt schildern. In seinem Buch "magog" beschreibt er die
          unheimlichen Ereignisse, die zu der gro&szlig;en
          Brandkatastrophe in Crailsfelden f&uuml;hren. Und 10
          Jahre sp&auml;ter beginnt die Geschichte Justins. Ein
          Buch, das es wieder versteht, den Leser in den bann der
          Ereignisse zu schlagen. Wolfgang Hohlbein hat auch dieses
          mit seiner Frau Heike zusammen geschrieben, und auch hier
          ist wieder nicht sicher, ob dieses Buch das Ende der
          Geschichte Crailsfeldens bildet, wie auch immer dieses
          Ende aussehen mag. Jeder der Fantasy gern liest, wird
          auch an diesem Buch seine Freude haben.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a04"></A> 

          <H3>Titel: Ein Bergbauer erz&auml;hlt<BR>
          Autor: Reiner Regneri<BR>
           Vorgestellt von: Nadine<BR>
           Datum: 08.04.2004</H3>

          <P><B>Oh du Zauberfee der Berge, Teil 1</B><BR>
           Wer zu unserm Hofe in die Berge zieht und in lauen
          N&auml;chten hoch zum Gipfel sieht, wer in diesen
          N&auml;chten und in dieser Zeit h&ouml;rt, wie F&ouml;hn
          und Sturmwind durch die Berge schreit, wer, ergriffen von
          den Lauten, vor dem Hause steht &uuml;bermannt von den
          Gef&uuml;hlen garnicht schlafen geht, der h&ouml;rt
          pl&ouml;tzlich, wie ein Zauber, hoch vom Berg ein Raunen.
          Und er lauscht nur. Angst ergreift ihn und er wird
          erstaunen, denn er wird hoch auf dem Berge dann ein
          M&auml;dchen sehn. Er schaut h&ouml;her, immer h&ouml;her
          und sein Herz bleibt stehn. Und sie sieht ihn und sie
          schaut mit sanften Augen zart ihn an und er f&uuml;hlt,
          da&szlig; dieses Schauen nur ein Engel zeigen kann.
          Schaut hinauf, denn auch in diesen N&auml;chten ist sie
          wirklich da, Claudia.</P>

          <P>Blond sind ihre Locken, golden ist ihr Kleid. Und ihr
          seid erschrocken, ihr verzaubert seid. Hoch vom
          wei&szlig;en Gletscher, hoch vom ew'gen Schnee schaut sie
          auf euch nieder, diese Zauberfee. Schlank ist sie
          gewachsen und ihr Haar ist lang. Diese Wunderlocken
          schm&uuml;ckt ein silbern Spang. Hell die Spange
          leuchtet, weit ins Tal hinaus. Alle h&ouml;rt man
          jammern, oh, Herrgott, oh graus. Jeden h&ouml;rt man
          sagen, Unheil bricht herein, denn wenn sie erscheinet
          kann's nur Unhheil sein. Und wenn die Lawinen brausend
          donnernd gehn sieht man diesen Zauber hoch am Gletscher
          stehn. Wer sie dann erblicket, jeden es bald reut und sie
          lacht herunter, als ob sie das freut. Alle Bauern klagen,
          sie bringt Ungl&uuml;ck nur. Wenn Lawinen schlagen sieht
          man ihre Spur. Aber l&auml;chelnd steht sie da,
          Claudia.</P>

          <P>Und bei Nacht, wenn die Gewitter toben &uuml;ber Berg
          und Tal h&ouml;rt man Wetterglocken l&auml;uten. Noch
          einmal und noch einmal. Doch in dieses Glockenl&auml;uten
          pl&ouml;tzlich eine Stimme schreit. Grell durchs tal
          beginnt's zu heulen. Da, die Fee, es kommt schlimm Zeit.
          Und im Donnern, Hageln, Blitzen steht sie leuchtend auf
          dem Eis. Laut ruft sie ins Tal hinunter. Was sie ruft?
          Wer wei&szlig;? Wer wei&szlig;? Was vom Berge schallt
          sind Schreie, die man nicht verstehen kann. Und in diesen
          Grauenn&auml;chten f&auml;ngt die Not im Tale an. Sie ist
          es schuld, man ha&szlig;t sie gar, Claudia.</P>

          <P>Niemand traut sich auf den Gletscher. Er hat Angst, er
          k&ouml;nnt sie sehn. Und die Fremden, die's gern wollen,
          l&auml;&szlig;t man ebenfalls nicht gehn. Denn die
          Fremden, ja so sagt man, diese, die nicht hier geborn
          k&ouml;nnten sie erz&uuml;rnet machen. Und es tr&auml;f
          das Dorf der Zorn dieser Zauberfee im Gletscher. Deshalb
          darf sie keiner sehn. Und die Leute schreien hilfe, unser
          Dorf wird untergehn. Doch der Fremde, der in einer
          Sommernacht sie schaut und sieht will hinauf zu diesem
          Engel. Es ergreift ihn wie ein Lied. Jeden Fremden, der
          sie schauet, rei&szlig;t sie mit wie nie zuvor. Eine
          Stimme, klar und deutlich, tr&auml;gt der Wind an seine
          Ohr. Sie erscheint in manchen Stunden, diese sch&ouml;ne
          Traumgestalt. Pl&ouml;tzlich ist sie j&auml;h
          verschwunden. Und der Hang ist schwarz und kalt. Und der
          Fremde, der sie schauet, den sie aus dem Haus
          gef&uuml;hrt ist ergriffen, ist erschrocken, ist
          verlassen, ist ger&uuml;hrt. Immer, wenn sie ist
          erschienen, sch&ouml;n und zauberhaft, oh ja, sind
          Gewitter, sind Lawinen, sind die Katastrofen da. Manche
          Kinder, die im Berge wandernd sangen frohe Lieder sind
          nicht mehr zur&uuml;ckgekommen. Und die Leute sagen
          wieder, Claudia hat sie genommen. Glaubt mir, sie ist
          immer da, Claudia.</P>

          <P><B>Oh, du Zauberfee der Berge, Teil 2</B><BR>
           Doch ein fremder kam gezogen. Er sah auch den Zauber
          dort. Und er sprach zu unsern Bauern, ich mu&szlig; hoch
          zum Berg, sofort. Doch kein Bauer zog mit jenem hoch zum
          Eise dort hinauf. Und der Fremde gibt kein Ruhe. Ja, er
          klettert selber rauf. Als nun stieg der Mann vom Berge
          und beim Bauernhaus kam an da verdunkelt sich der Himmel
          und es f&auml;ngt zu blitzen an. Schwere St&uuml;rme
          rasen &uuml;ber unser Dorf und unser Land. So inmitten
          dieser Wetter, auf dem Gletscher, dort, am Rand, da
          erscheint, stark, hell und pr&auml;chtig, Claudia die
          Bergesfee. Ja, ihr blick ist hell und m&auml;chtig und
          sie leuchtet wei&szlig; wie Schnee. Ihre Hand, oh Gott,
          sie hebt sich und zeigt drohend auf den Mann, der,
          ersch&uuml;ttert von den Kr&auml;ften, bald schon nicht
          mehr atmen kann. Machtvoll droht sie ihm vom Eise, sie
          nimmt diesen Mann ganz ein und im Sturme raunt es leise.
          H&ouml;rt, sie spricht, was mag es sein? Dieser Mann,
          seltsam verzaubert, sieht hinauf und nur Sekunden dauert
          es und pl&ouml;tzlich ist sie tief im Eis wieder
          verschwunden. Und im Gletscher grollt es dumpfer.
          Schaurig kracht das Eis zu Tal, grad so, da&szlig; die
          Leute Fragen, Herr, ist es das letzte mal? Klagend
          Wetterglocken l&auml;uten. Es wird schlimmer jede Stund.
          In den H&auml;usern Menschen knien. Herr, nun gehen wir
          zu Grund. Und der Fremde ist der schuldge, wie man's
          einmal wieder dreht. Wird beschimpfet, wird verachtet.
          Wenden tut er sich und geht. Und man sagt, er macht sie
          zornig. &Uuml;ber uns kommt Krankheit, Not. Sie wird
          keine Ruh mehr geben. Wer der Fremde doch nur tot. Ja, es
          stimmt, sie ist noch da, Claudia.</P>

          <P>Und die Tage gehn vor&uuml;ber. Unser Dorf, es rafft
          sich auf. Ruhe, ja, die ist uns lieber. Und die Zeit
          nimmt ihren Lauf. Diese Fee, von der die Rede, sah man
          lange schon nicht mehr. Jeder glaubt und jeder denkt
          sich, sie h&auml;tt keine Wiederkehr. Und der Herbst, der
          Sturmesbruder, zieht einher, f&auml;rbt Feld und Wald.
          &Uuml;berm Gletscher naht der Winter. Finster wird's und
          eisig kalt. Doch die Zaubermaid am Hange wird noch immer
          nicht gesehn. Und im Wetterglockenklange, nichts zu
          h&ouml;rn. Wie mag es gehn? Sie ist tot, so sagen alle.
          Jeder gibt es anders weiter. Glaubt's, sie ist vom Eis
          gefalle. Jeder wei&szlig; es. Ist gescheiter. Und der
          milde sch&ouml;ne Fr&uuml;hling bringt die Freud und
          W&auml;rm ins land. Schmilzt den Schnee und bringt
          Lawinen. Doch die Fee, sie scheint verbannt. Ist sie
          wirklich nicht mehr da? Claudia?</P>

          <P>Ja, die liebe g&uuml;tge Sonne, sie scheint heller,
          Tag f&uuml;r Tag und das Osterfest r&uuml;ckt n&auml;her.
          Alles geht nun schlag auf Schlag.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a05"></A> 

          <H3>Buchtitel: About a Boy<BR>
          Autor: Nick Hornby<BR>
          Vorgestellt von: Bitschreck<BR>
          Verlag: Droemer Knaur<BR>
           Erscheinungsjahr: 2000<BR>
           ISBN: 3426616904<BR>
           Format: Audio</H3>

          <P><B>Inhalt:</B><BR>
           Will, ein Singel in den Enddrei&szlig;igern, braucht
          seinen Lebensunterhalt nicht durch eine T&auml;tigkeit zu
          finanzieren. So bilden abwechselnde und kurzweilige
          Af&auml;hren die einzigen H&ouml;hepunkte in seinem
          Dasein. Er ist mit dieser Lebensf&uuml;hrung
          gl&uuml;cklich und versteht alle die nicht, die ihr Heil
          in festen Partnerschaften suchen.</P>

          <P>Der zw&ouml;lfj&auml;hrige Markus w&auml;chst allein
          bei seiner depressiven Mutter auf. Nach einem
          Schulwechsel wird er von den anderen Kindern in seiner
          neuen Umgebung geh&auml;nselt und terrorisiert. Er ist
          anders. Seine Kleidung, sein Haarschnitt, einfach alles
          ist f&uuml;r die Neunziger uncool.</P>

          <P>Will findet heraus, wo er willige und anspruchslose
          Frauen kennen lernen kann. Bei einem Treffen von
          Partnerschaftsgesch&auml;digten Singels. Er tritt dort
          als Mann auf, der von seiner Frau mi&szlig;verstanden und
          verlassen wurde.</P>

          <P>Hier lernt er die Freundin von Markus Mutter, Susie
          kennen.</P>

          <P>Die Dinge nehmen ihren Lauf. Will und Markus treffen
          aufeinander und der Leser merkt, wie &auml;hnlich die
          beiden sich sind.</P>

          <P>Markus hilft Will und Will zeigt Markus ein anderes
          Leben.</P>

          <P><B>Anmerkungen:</B><BR>
           Dieser Roman ist voll von intelegentem Witz. Die Figuren
          sind trotz ihrer Unzul&auml;nglichkeiten alle sehr
          liebenswert. Dieses Buch ist sehr zu empfehlen.</P>

          <P>Die H&ouml;rbuchausgabe erschien im Dhv (der
          H&ouml;rverlag August 2002) auf vier Audio-CDs.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a06"></A> 

          <H3>Buchtitel: Tea-Bag<BR>
          Autor: Mankell Henning<BR>
          Vorgestellt von: Bitschreck<BR>
          Verlag: Zsolnay<BR>
          Erscheinungsjahr: 2003<BR>
          ISBN: 3552052208<BR>
          Format: Audio</H3>

          <P><B>Inhalt:</B><BR>
           Dieser schwedische Autor ver&ouml;ffentlichte viele
          Kriminalromane und B&uuml;cher, deren Handlung sich mit
          Afrika besch&auml;ftigen. Das Buch 'Tea-Bag' k&ouml;nnte
          jedoch in jedem Land Westeuropas spielen. Zum Inhalt: Ein
          Autor ver&ouml;ffentlicht in jedem Jahr p&uuml;nktlich
          zum Geburtstag seiner inzwischen 87-J&auml;hrigen Mutter
          einen Gedichtsband. Da seine Auflagen stark sinken,
          sp&auml;ter im Roman erf&auml;hrt er, dass sein aktuelles
          Buch nach Monaten erst dreimal verkauft wurde,
          dr&auml;ngt ihn sein Verleger doch einen poetischen
          Kriminalroman zu schreiben. Damit kann sich der
          Schriftsteller &uuml;berhaupt nicht anfreunden. Um sein
          Buch bekannt zu machen, reist er durch die St&auml;dte
          und veranstaltet Buchlesungen. In einer kleinen Stadt. In
          der er in einer Bibliothek ebenfalls einen Lesungstermin
          hat, hat er einen alten Bekannten, den er vor der Lesung
          besucht. In der Bibliothek lauschen gerade mal 13
          Menschen seinen Gedichten. Im Anschluss an diese
          Veranstaltung ist er bei seinem Bekannten eingeladen.
          Dieser unterh&auml;lt einen Boxclub. Hier boxen
          &uuml;berwiegend Einwanderer. Durch f&uuml;r den
          Schriftsteller ung&uuml;nstige Situationen entsteht ein
          Schriftstellerlehrgang f&uuml;r junge Einwandererfrauen.
          Der Boxtrainer versteht es geschickt den Autor f&uuml;r
          diese Idee einzuspannen. Hier lernt er nun drei junge
          Frauen kennen, ohne weiter in ihre Belange eintauchen zu
          k&ouml;nnen. Er erlebt lediglich, wie sie sich als
          illegale Einwanderer in Schweden behaupten m&uuml;ssen.
          Die Beziehung zu seiner Freundin, die endlich ein Kind
          von ihm m&ouml;chte, wozu er aber noch nicht bereit ist,
          sein Verh&auml;ltnis zur Mutter, die in ihrem Alter eine
          Sexhotline f&uuml;r reife M&auml;nner betreibt und der
          immer gegenw&auml;rtige Verleger, mit seinen
          Vorstellungen eines poetischen Kriminalromans und
          schlie&szlig;lich seine Beziehung zu den drei Jungen
          Frauen, sind der haupts&auml;chliche Inhalt dieses
          Buches. Hier treffen vollkommen unterschiedliche Kulturen
          aufeinander. Die Unterschiede verschaffen dem
          Schriftsteller auch eine Nacht im Krankenhaus.
          &Uuml;berhaupt scheint niemand auf die Meinung und
          W&uuml;nsche des Romanhelden einzugehen.</P>

          <P><B>Anmerkungen:</B><BR>
           Die Geschichten der drei M&auml;dchen werden eigentlich
          nur angerissen. Aber ... das ist ausreichend, um sich mal
          tiefgr&uuml;ndigere Gedanken zu machen. Ich kann diesen
          Roman nur empfehlen.</P>

          <P>Das h&ouml;rbuch erschien im Mai 2003 beim DHV Der
          H&ouml;rverlag Dieser Verlag produzierte auch viele
          Krimminalromane von Henning Mankell als
          H&ouml;rspiel.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a07"></A> 

          <H3>Buchtitel: Dunkel<BR>
          Autor: Wolfgang Hohlbein<BR>
          Vorgestellt von: Eowyn<BR>
          Verlag: Gustav L&uuml;bbe Verlag GmbH, Bergisch
          Gladbach<BR>
          Erscheinungsjahr: 1999<BR>
          ISBN: 3-7857- 0931- 5<BR>
          Format: Digital</H3>

          <P><B>Inhalt:</B><BR>
           Ein ganz normaler abendlicher Kinobesuch endet f&uuml;r
          den Fotographen Jan mit einem beinahe t&ouml;dlichen
          Herzstillstand. Erst in letzter Minute gelingt es einem
          Angestellten des Kinos ihn mittels Herzmassage ins Leben
          zur&uuml;ckzuholen. Doch damit fangen die Schrecken
          f&uuml;r den jungen Mann erst an, der sich nicht
          erkl&auml;ren kann, wie er - v&ouml;llig gesund und mit
          fast vorbildlichem Lebensstil - eine solche Attacke hatte
          erleiden k&ouml;nnen, mit Anfang drei&szlig;ig.</P>

          <P>W&auml;hrend der wenigen Minuten, die sein Herz still
          steht, sieht er merkw&uuml;rdige Schatten von denen einer
          offenbar der Grund f&uuml;r diesen Herzstillstand zu sein
          scheint, doch tut Jan dies als die Halozinazionen eines
          Sterbenden ab und es dauert eine Weile, bis er von dieser
          Vermutung abl&auml;sst.</P>

          <P>Nicht nur, dass ihn solche Schatten immer weiter
          verfolgen, es stellt sich schlie&szlig;lich auch heraus,
          dass sein Anfall nur einer von 16 war, die in
          k&uuml;rzester Zeit im Kino oder dessen unmittelbarer
          Umgebung geschehen sind, nur dass Jan der einzige war,
          der es &uuml;berlebt hat.</P>

          <P>In den n&auml;chsten Tagen ger&auml;t Jan immer wieder
          in Lebensgefahr, doch taucht bald eine Junge und recht
          merkw&uuml;rdige Frau auf, die ihn immer wieder aus
          diesen Situationen rettet. Sie nistet sich bei Jan und
          dessen Freundin in der Wohnung ein und ist dort auch
          nicht mehr wegzubekommen.</P>

          <P>Wer ist diese geheimnisvolle Fremde, die sowohl am
          Tage als auch in der Nacht immer eine Sonnenbrille
          tr&auml;gt, immer zum rechten Zeitpunkt auftaucht, um Jan
          das Leben zu retten und auch sonst ungew&ouml;hnlich
          gro&szlig;en Anteil an seinem allt&auml;glichen Leben zu
          nehmen scheint?</P>

          <P>Was wei&szlig; sie wirklich &uuml;ber den Schatten,
          der Jan immer wieder verfolgt und den er bei sich
          inzwischen den Dunklen nennt, entlehnt von seinem Vater,
          der damals im Krankenhaus in seinen letzten Tagen von
          ganz &auml;hnlichen Erscheinungen sprach?</P>

          <P><B>Anmerkungen:</B><BR>
           Dieses Buch fesselt ebenfalls wieder den Leser, wie es
          viele von Hohlbeins Werken tun und doch habe ich es mit
          Vorsicht genossen.</P>

          <P>Schlie&szlig;lich tauchen in der Handlung Vampire auf,
          und auch wenn sich an dem Thema schon einige Autoren
          versucht haben, gehe ich mit der Darstellung Hohlbeins
          nicht ganz mit. Jeder Autor f&uuml;r sich, von Romanen
          oder Drehb&uuml;chern, hat seine eigene Darstellungsweise
          von Vampiren, aber es gibt doch Dinge, die sie gemein
          haben.</P>

          <P>Sie sind nachtaktiv, ern&auml;hren sich vom Blut der
          Menschen, k&ouml;nnen durch Silber verletzt werden und
          besitzen auch sonst F&auml;higkeiten, die denen der
          Menschen weit &uuml;berlegen sind.</P>

          <P>Einiges hat Hohlbein &uuml;bernommen. Silber ist noch
          immer eine so wirksame Waffe gegen Vampire, wie sie es
          &uuml;berall zu sein scheint, Vampire sind
          k&ouml;rperlich perfekt, um ein Vielfaches st&auml;rker
          und schneller als Menschen und damit h&ouml;rt es auch
          schon fast auf. Sie ern&auml;hren sich nicht
          zwangsl&auml;ufig von Blut in diesem Buch, k&ouml;nnen
          sich auch im Sonnenlicht aufhalten und im Gegensatz zu
          dem Mythos, dass man ihr Spiegelbild nicht sehen kann,
          stellt Hohlbein es so dar, dass sie sich, wie allgemein
          bekannt, zwar den Blicken der Menschen entziehen
          k&ouml;nnen, jedoch der Spiegel auch dann noch eine
          M&ouml;glichkeit ist, sie zu entdecken.</P>

          <P>Der letztliche Showdown, der in einer bizarren
          Verwandlung eines Vampirs in ein Unget&uuml;m von
          Fledermaus endet, nimmt dem buch einen ganzen Teil seiner
          "Glaubw&uuml;rdigkeit", wenn man es so nennen
          m&ouml;chte.</P>

          <P>Wer sich jedoch von solchen Details nicht abschrecken
          l&auml;sst, nur eine spannende und teils
          nervenaufreibende Erz&auml;hlung lesen m&ouml;chte, der
          ist mit "Dunkel" sogar recht gut bedient.</P>

          <P>Meiner Meinung nach bekommt Hohlbein das surreale, das
          seinen B&uuml;chern sonst eigen ist und einen
          gro&szlig;en Teil ihrer Faszination ausmacht nicht so
          recht zu fassen, aber ansonsten hat das Buch alles, was
          es f&uuml;r unterhaltsame Abendlekt&uuml;re braucht.</P>

          <P>Unheimliche Schatten, ein bisschen Blut und Knochen,
          einige K&auml;mpfe und zerbrochene Spiegel und nicht zu
          vergessen, die unheimliche und auf mysteri&ouml;se Weise
          sexuell anziehende Frau, der kein Mann tats&auml;chlich
          widerstehen kann und die &uuml;ber den Roman hinweg immer
          mehr von ihren verborgenen Qualit&auml;ten auf den
          verschiedensten Gebieten beweist.</P>

          <P>Es wirkt alles ein wenig seicht und schnell
          dahingeschrieben, aber es ist doch recht kurzweilig.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

