<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>[RADIOAKTIV]</TITLE>
  </HEAD>

  <BODY background="images/bgb.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>[RADIOAKTIV]</B><BR>
          (Kleine Auswahl aus April 2004)</FONT></P>
          <A name="top"></A> 

          <H3>Inhalt:</H3>

          <UL>
            <LI><A href="#a01">AMnews</A></LI>

            <LI><A href="#a02">Drei L&auml;nder, drei Radios, eine
            Party</A></LI>

            <LI><A href="#a03">AKTUELLE SENDERTIPPS</A></LI>

            <LI><A href="#a04">SUMMER KISSES Festival</A></LI>

            <LI><A href="#a05">5 Punkte-Papier</A></LI>

            <LI><A href="#a06">IMDR startet Print-Kampagne</A></LI>

            <LI><A href="#a07">Die Geschichte des
            Privatradios</A></LI>

            <LI><A href="#a08">Gemeinde geht gegen Sender
            vor</A></LI>

            <LI><A href="#a09">Medien</A></LI>

            <LI><A href="#a10">Die Geschichte von Radio4u</A></LI>

            <LI><A href="#a11">rockfun24</A></LI>

            <LI><A href="#a12">Lizenz f&uuml;r erstes deutsches
            Wissens-Radio</A></LI>
          </UL>
          <HR>
          <A name="a01"></A> 

          <H3>Slowakei: Kurzwelle bleibt vorerst erhalten</H3>

          <P>Der Slowakische Rundfunk hat die f&uuml;r den
          01.05.2004 geplante Einstellung seiner Sendungen auf
          Kurzwelle verschoben und als neuen Termin hierf&uuml;r
          den 01.07.2004 festgelegt. In einem am 25.04.2004
          ausgestrahlten Interview wurde dies von Ladislav Kubis ,
          dem Chefredakteur von Radio Slowakei International, als
          erster Teilerfolg bei seinen Bem&uuml;hungen um eine
          dauerhafte Erhaltung der Ausstrahlungen bewertet.
          Hintergrund dieser Entwicklungen ist eine dramatische
          K&uuml;rzung des dem Slowakischen Rundfunk im Rahmen des
          Staatshaushaltes durch das Parlament zur Verf&uuml;gung
          gestellten Etats; statt des angemeldeten Finanzbedarfs
          von 270 Millionen Slowakischen Kronen wurden f&uuml;r das
          Jahr 2004 nur 97 Millionen Kronen bewilligt. Von diesem
          Restbetrag wurde nicht, wie bisher &uuml;blich, ein
          bestimmter Teil f&uuml;r den Auslandsdienst reserviert.
          Dieses Vorgehen wird von Ladislav Kubis als rechtswidrig
          bewertet, da die Zuweisung staatlicher Mittel f&uuml;r
          den Auslandsrundfunk gesetzlich geregelt sei.</P>

          <H3>Digitaltest von Europe 1 auf 183 kHz?</H3>

          <P>Der auf 183 kHz arbeitende Langwellensender des
          franz&ouml;sischen Veranstalters Europe 1 in Felsberg
          (Saarland) hat in der Nacht zum 22.04.2004
          m&ouml;glicherweise einen Test des digitalen
          DRM-Verfahrens durchgef&uuml;hrt. Nach Angaben in einem
          Diskussionsforum soll dabei klassische Musik mit der
          Kennung "DW DRM" ausgestrahlt worden sein. Europe 1 wurde
          w&auml;hrend der franz&ouml;sischen Verwaltung des
          Saarlandes ins Leben gerufen, um das Verbot kommerzieller
          Rundfunksendungen in Frankreich zu umgehen. Die Sendungen
          waren zun&auml;chst fernmelderechtlich nicht legitimiert,
          konnten unter unklar bleibenden Umst&auml;nden aber auch
          nach dem Wirksamwerden der bundesdeutschen Funkhoheit im
          Saarland im Jahre 1957 fortgesetzt werden. Hingegen wurde
          der am 16.01.1958 auf der Langwellenstation Felsberg in
          Betrieb genommene Fernsehsender (sein Turm ist in direkt
          neben der Antennenspeiseleitung erkennbar) des Europe
          1-Ablegers Telesaar nach nur neun Tagen von
          Polizeikr&auml;ften durch Abtrennung und Versiegelung des
          Antennenkabels stillgelegt und in der Folge durch das
          Bundespostministerium die endg&uuml;ltige
          Schlie&szlig;ung von Telesaar zum 15.06.1958
          verf&uuml;gt. Ab 1959 beteiligte sich auch der
          franz&ouml;sische Staat &uuml;ber die Gesellschaft
          Sofirad an Europe 1. Veranstaltet wird das Programm heute
          von der Lagard&egrave;re-Gruppe. Die Sendestation in
          Felsberg wurde von 1952 bis 1954 errichtet. Ihr
          Wahrzeichen ist das verglaste, in freitragender
          Spannbetonbauweise ausgef&uuml;hrte Sendergeb&auml;ude,
          das als weltweit erste Anwendung dieser Bauform gilt und
          seit 1999 unter Denkmalschutz steht. Von Anbeginn wurden
          die Programme in Paris produziert und &uuml;ber eine
          Postleitung nach Felsberg &uuml;berspielt, wo mit Stand
          1975 f&uuml;r St&ouml;rungsf&auml;lle aber auch ein
          Notstudio mit je zwei Plattenspielern (EMT 930) und
          Bandmaschinen (Studer C37) eingerichtet war. Aufgenommen
          wurde der Sendebetrieb zun&auml;chst mit zwei 200
          kW-Sendern. 1976 wurden in Felsberg zwei 1000 kW-Sender
          installiert, die - als Paar mit einer Gesamtleistung von
          2000 kW betrieben - auch heute noch im Einsatz sein
          d&uuml;rften, sofern nicht zwischenzeitlich in neue
          Sendetechnik investiert wurde. Die Sendestation
          verf&uuml;gt &uuml;ber eine aufwendige Richtantenne aus
          vier Masten mit H&ouml;hen um 280 Meter, zus&auml;tzlich
          steht auch noch eine aus zwei Masten bestehende
          Notantenne zur Verf&uuml;gung. Die Hauptsendeantenne
          weist in Richtung S&uuml;dwesten einen Gewinn von 5 db
          und in &ouml;stliche Richtungen Ausblendd&auml;mpfungen
          von bis zu 35 db auf, womit die St&auml;rke des in
          Richtung Ostdeutschland abgestrahlten Signals dem eines
          Senders mit nur wenigen Kilowatt Leistung entspricht.
          Dabei wirkt diese ungew&ouml;hnlich tiefe Ausblendung nur
          auf den Tr&auml;ger, w&auml;hrend die Seitenb&auml;nder
          in deutlich geringerem Ausma&szlig; bed&auml;mpft werden.
          Dies f&uuml;hrt in den Regionen &ouml;stlich des Senders
          zu starken Verzerrungen, w&auml;hrend in noch
          gr&ouml;&szlig;erer Entfernung durch diesen Effekt der
          Sender Felsberg &uuml;berhaupt noch geh&ouml;rt werden
          kann, vor allem wenn ein entsprechend ausgestattetes
          Radio auf Einseitenbandempfang geschaltet wird
          Sendeschlu&szlig; der Langwelle nach den 01.00
          Uhr-Nachrichten). Nach der Aufnahme des Sendebetriebs am
          01.01.1955 wurden ohne Erfolg verschiedene Frequenzen
          erprobt. Wegen der verursachten St&ouml;rung anderer
          Stationen wurden diese Versuche am 23.01.1955
          zun&auml;chst wieder abgebrochen; der endg&uuml;ltige
          Wirkbetrieb begann erst am 01.04.1955 auf der dann
          gew&auml;hlten Frequenz 182 kHz. Anfang 1970 &auml;nderte
          Europe 1 seine Frequenz auf 180 kHz, um dem seinerzeit
          auf 185 kHz betriebenen Sender Zehlendorf bei Oranienburg
          auszuweichen. Im Zuge des Genfer Wellenplanes
          mu&szlig;ten beide Stationen dann ab 1978 auf 182 kHz
          arbeiten. Diese wegen massiver gegenseitiger
          St&ouml;rungen auf Dauer untragbare Situation wurde
          schlie&szlig;lich am 15.12.1980 mit der bis heute
          g&uuml;ltigen Regelung gel&ouml;st: Beide Sender arbeiten
          mit einem Frequenzoffset von jeweils 3 kHz gegen&uuml;ber
          dem nominellen Kanal. Damit ergaben sich zun&auml;chst
          die Sendefrequenzen 179 und 185 kHz, die mit der
          Anpassung des Kanalrasters auf Vielfache von 9 im Jahre
          1986 dann nochmals um 2 kHz nach unten auf die bis heute
          g&uuml;ltigen Frequenzen 177 und 183 kHz verschoben
          wurden. In den 90er Jahren standen zeitweise Bestrebungen
          der niederl&auml;ndischen Fernmeldeverwaltung im Raum,
          ihre Zustimmung zu dieser L&ouml;sung zugunsten der
          seinerzeit in den Niederlanden f&uuml;r die Frequenz 171
          kHz geplanten kommerziellen Station aufzuk&uuml;ndigen.
          In diesem Fall h&auml;tten die Sender Zehlendorf und
          Felsberg erneut zusammen auf der Nominalfrequenz (jetzt
          180 kHz) arbeiten m&uuml;ssen. Nach dem Scheitern des
          niederl&auml;ndischen Langwellenprojektes sind inzwischen
          aber keine Forderungen nach einer R&auml;umung der
          jetzigen Betriebsfrequenzen mehr bekannt.</P>

          <H3>Paris: Weitere Privatstation auf Mittelwelle</H3>

          <P>Im Gro&szlig;raum Paris hat eine weitere Privatstation
          ihren Sendebetrieb auf Mittelwelle aufgenommen. Das von
          der Produktionsfirma Air Productions getragene Loisirs AM
          wird von der Station Villebon-sur-Yvette auf 1314 kHz
          &uuml;bertragen. In den Abend- und Nachtstunden wird
          Loisirs AM aber selbst in Teilen von Paris durch den
          ebenfalls auf 1314 kHz arbeitenden Gro&szlig;sender
          Kvits&oslash;y (Norwegen) &uuml;bert&ouml;nt.
          Versch&auml;rft wird diese Situation durch die derzeit
          eingeschr&auml;nkte Sendeleistung; statt mit den
          zul&auml;ssigen 5 kW soll Loisirs AM in
          Villebon-sur-Yvette derzeit mit nur 1 kW ausgestrahlt
          werden. Ein Empfang im deutschsprachigen Raum d&uuml;rfte
          somit praktisch ausgeschlossen sein.</P>

          <H3>Weitere Informationen zur ORF-Kurzwelle</H3>

          <P>Inzwischen vorliegende weitere Informationen zu den
          Kurzwellensendungen des &Ouml;sterreichischen Rundfunks
          (ORF) zeichnen ein insgesamt d&uuml;steres Bild. Demnach
          beteiligt sich der ORF nicht mehr an der damit nur noch
          von Radio Polonia, Radio Prag, Radio Slowakei
          International und dem Slowenischen Rundfunk getragenen
          Gemeinschaftssendung "Insight Central Europe". Im
          Internetangebot dieses Projektes wird immer noch auf das
          seit zehn Monaten nicht mehr bestehende Radio
          &Ouml;sterreich International verwiesen, eingeschlossen
          Links zu dessen seit Januar 2004 endg&uuml;ltig nicht
          mehr existierenden Seiten im Internet. Das Projekt Radio
          Afrika International wird nach Informationen aus
          ORF-Kreisen aus Budgetgr&uuml;nden bereits seit dem
          11.06.2003 nicht mehr auf Kurzwelle verbreitet.</P>

          <H3>Frequenzwechsel in J&uuml;lich</H3>

          <P>F&uuml;r die Sendungen des Christian Science Herold
          &uuml;ber die Sender in J&uuml;lich Sendersaal) gilt seit
          dem 15.04.2004 eine neue Frequenz. Ausgestrahlt werden
          sie jetzt jeweils am Sonntag um 11.00 Uhr auf 6015 kHz
          Damit reagiert die T-Systems auf die Belegung der
          Frequenz 5990 kHz durch digitale Sendungen aus Luxemburg,
          welche die bisher genutzte Frequenz 5985 kHz v&ouml;llig
          unbrauchbar machen. Auf 5985 kHz l&auml;uft aus
          J&uuml;lich noch eine Sendung von Radio Vlaanderen
          Internationaal (vgl. n&auml;chste Meldung), deren
          Frequenzplanung jedoch nicht in der Verantwortung der
          T-Systems liegt. Christian Science hatte in den USA bis
          zum Februar die Kurzwellenstation WSHB betrieben und ist
          in Deutschland auch auf Sendepl&auml;tzen von
          Deutschlandradio Berlin, dem Bayerischen Rundfunk und dem
          Norddeutschen Rundfunk vertreten.</P>

          <H3>Frequenzen von Radio Vlaanderen Internationaal</H3>

          <P>Radio Vlaanderen Internationaal (RVI), der
          Auslandsdienst des fl&auml;mischen Rundfunks VRT, strahlt
          seine 15min&uuml;tigen deutschen Sendungen um 19.15 und
          21.00 Uhr jeweils auf der Mittelwelle 1512 kHz und der
          aus Ru&szlig;land betriebenen Kurzwelle 9925 kHz aus.
          Seit dem Jahre 2001 nutzt RVI die Kurzwellensender am
          belgischen Standort Wavre Leitstand) nicht mehr, mietet
          daf&uuml;r aber in gr&ouml;&szlig;erem Umfang Sendezeit
          im Ausland an, und zwar: J&uuml;lich (Deutschland)
          07.00-09.00 9590 kHz (f&uuml;r Nahost) 09.00-09.30 5985
          kHz (f&uuml;r Mitteleuropa) 18.30-21.00 11640 kHz
          (f&uuml;r Nahost) 20.00-22.00 5910 kHz; nur Sa (f&uuml;r
          Mitteleuropa)</P>

          <P>Skelton (England) 09.00-10.00 9590 kHz (f&uuml;r
          S&uuml;deuropa) 19.00-21.00 13690 kHz (f&uuml;r
          S&uuml;deuropa) 22.00-23.00 9840 kHz (f&uuml;r
          S&uuml;deuropa)</P>

          <P>Rampisham (England) 13.00-13.30 15195 kHz (f&uuml;r
          S&uuml;deuropa) 15.00-18.00 15160 kHz; nur So (f&uuml;r
          S&uuml;deuropa)</P>

          <P>Sendestellen im Raum Moskau 13.00-13.30 15450 kHz
          (f&uuml;r Mitteleuropa) 15.00-18.00 15195 kHz; nur So
          (f&uuml;r Mitteleuropa) 19.00-23.00 9925 kHz (f&uuml;r
          Mitteleuropa)</P>

          <P>Tbilisskaja (S&uuml;dru&szlig;land) 07.00-10.00 15195
          kHz (f&uuml;r Mitteleuropa)</P>

          <P>Angarsk (Sibirien) 13.30-14.30 9940 kHz (f&uuml;r
          Asien und Australien)</P>

          <P>Taschkent (Usbekistan) 14.00-14.30 17695 kHz (f&uuml;r
          Asien und Australien)</P>

          <P>Al-Dhabbaya (Abu Dhabi) 20.00-21.00 15325 kHz
          (f&uuml;r Afrika)</P>

          <P>Meyerton (S&uuml;dafrika) 07.00-07.30 9925 kHz
          (f&uuml;r Afrika) 12.00-13.00 21630 kHz; nur So (f&uuml;r
          Afrika) 13.00-13.30 21630 kHz (f&uuml;r Afrika)</P>

          <P>Bonaire (Niederl&auml;ndische Antillen) 00.00-01.00
          11635 kHz (f&uuml;r Nordamerika) 06.00-07.00 11635 kHz
          (f&uuml;r Nordamerika)</P>

          <H3>Th&uuml;ringen: Weitere Sender f&uuml;r Top 40
          eingeschaltet</H3>

          <P>In den vergangenen Tagen gingen mehrere neue
          Kleinsender f&uuml;r das von Antenne Th&uuml;ringen in
          Weimar produzierte Jugendprogramm Radio Top 40 in
          Betrieb. &Uuml;bertragen wird Radio Top 40 jetzt auch
          &uuml;ber die maximal 200 Watt starken und damit nur eine
          beschr&auml;nkte Reichweite aufweisenden Sender Gotha auf
          90,8 MHz, S&ouml;mmerda auf 91,0 MHz sowie Eisenach auf
          93,5 MHz.</P>

          <P>Eingeschaltet wurde auch der Sender Erfurt-Hochheim
          auf 88,6 MHz (500 Watt). Er tritt an die Stelle der
          bisher genutzten Erfurter Frequenz 100,2 MHz (3 kW), auf
          der ab 01.05.2004 wieder, wie urspr&uuml;nglich
          vorgesehen, das Programm von Antenne Th&uuml;ringen zu
          h&ouml;ren sein soll. &Uuml;ber l&auml;ngere Zeit war
          dies die einzige UKW-St&uuml;tzfrequenz des zun&auml;chst
          als Exklusivangebot zur F&ouml;rderung des Digital Audio
          Broadcasting (DAB) konzipierten Radio Top 40.</P>

          <P>Ab September 2001 wurde Radio Top 40 auch &uuml;ber
          die Geraer Stadtfrequenz 95,3 MHz verbreitet, jedoch
          verf&uuml;gte im Oktober 2001 das Verwaltungsgericht
          Weimar auf Antrag der Landeswelle Th&uuml;ringen eine
          Einstellung der Ausstrahlungen, da diese Frequenz ohne
          Ausschreibung vergeben worden war.</P>

          <P>Inzwischen ist der Sender in Gera-Heinrichsgr&uuml;n
          auf Grundlage eines im Jahre 2002 durchgef&uuml;hrten
          Ausschreibungsverfahrens, dessen Gegenstand auch die
          jetzt neu aufgeschalteten Frequenzen waren, wieder in
          Betrieb. Die Landeswelle Th&uuml;ringen ist im Zuge
          dieser Ausschreibung eine Anbietergemeinschaft mit
          Antenne Th&uuml;ringen zur Veranstaltung von Radio Top 40
          eingegangen.</P>

          <P>Radio Top 40 wurden auch die folgenden weiteren
          Stadtfrequenzen zugeteilt: Jena 94,8 MHz, Meiningen 99,5
          MHz, M&uuml;hlhausen 93,8 MHz, Nordhausen 103,0 MHz,
          P&ouml;&szlig;neck 98,9 MHz, Saalfeld 88,9 MHz, Schleiz
          92,4 MHz, Sondershausen 90,7 MHz, Suhl 92,1 MHz sowie
          Weimar 97,9 MHz. Ein Termin f&uuml;r die Inbetriebnahme
          dieser ebenfalls leistungsschwachen Frequenzen (zwischen
          50 und 200 Watt) ist bislang nicht bekannt.</P>

          <H3>Sendereinschaltungen in Bayern und Hessen</H3>

          <P>Neue UKW-Kleinsender gingen in den letzten Tagen auch
          in Bayern und Hessen in Betrieb.</P>

          <P>In Bayern wurde f&uuml;r Deutschlandradio Berlin in
          Traunstein ein Sender mit einer Strahlungsleistung von
          100 Watt auf 88,3 MHz eingeschaltet. Deutschlandradio
          Berlin verf&uuml;gt in Bayern inzwischen &uuml;ber mehr
          als 20 UKW-Sender. Mit Ausnahme der Augsburger Frequenz
          100,0 MHz (15 kW) und des fr&uuml;heren RIAS-Senders auf
          dem Gro&szlig;en Waldstein im Frankenwald (89,3 MHz, 20
          kW) handelt es sich dabei aber nur um Kleinsender mit
          geringer Reichweite.</P>

          <P>In Hessen wurde f&uuml;r Harmony FM, das dritte
          Programm der FFH-Gruppe, ein Sender in Korbach auf 107,4
          MHz mit einer Leistung von 200 Watt eingeschaltet.
          Harmony FM verf&uuml;gt &uuml;ber Frequenzen an
          verschiedenen Standorten in Hessen, eine UKW-Versorgung
          von Kassel, Frankfurt am Main und Wiesbaden steht aber
          nach wie vor aus.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a02"></A> 

          <H3>Drei L&auml;nder, drei Radios, eine Party</H3>

          <P>EU-Osterweiterungfeier in Zittau / RADIO PSR, RADIO
          IMPULS und Radio WAWa gemeinsam auf einer B&uuml;hne Ganz
          im Sinne des europ&auml;ischen Gedankens organisieren am
          1. Mai die drei Privatradios RADIO PSR (Sachsen), RADIO
          IMPULS (Tschechien) und Radio WAWa (Polen) ein
          trinationales B&uuml;hnen-Programm zum EU-Beitritt der
          beiden Nachbarstaaten. Im Rahmen der Feierlichkeiten
          unter dem Motto "Sternstunden Europas" werden prominente
          K&uuml;nstler aus Deutschland, Tschechien und Polen auf
          dem Klosterplatz, im Zentrum von Zittau, zwischen 11 und
          23 Uhr f&uuml;r Top-Unterhaltung sorgen. Die Besucher
          k&ouml;nnen sich auf die Chart-St&uuml;rmer Bellini,
          deren Hit "Samba de Janeiro" sich weltweit &uuml;ber vier
          Millionen Mal verkaufte, freuen. Um einige Jahre
          &auml;lter, aber noch flott auf der B&uuml;hne und
          f&uuml;r seine gnadenlosen Zwerchfell-Attacken bekannt,
          ist Opa Unger. Sachsens r&uuml;stiger Radiorentner treibt
          gemeinsam mit Freund Harry Werner den Moderator an den
          Rand des Wahnsinns und den Fans vor der B&uuml;hne die
          Tr&auml;nen in die Augen. Weitere H&ouml;hepunkte sind
          die Auftritte von Sachsens musizierendem
          Kleing&auml;rtner Gunther Schm&auml;che und den
          Pop-Rock-K&uuml;nstlern Oddzial Zamkniety aus Polen sowie
          den tschechischen Pop-Stars Ilona Csakov&aacute; und
          Martin Maxa. Die beliebten RADIO PSR-Morgenmoderatoren
          Jasmin und Alex begleiten die G&auml;ste durch den Abend.
          Initiatoren dieses l&auml;nder&uuml;bergreifenden
          Projekts sind die PSR-Mediengruppe und EUROCAST. Die
          PSR-Mediengruppe bildet mit ihren insgesamt sechs
          Tochterunternehmen eines der innovativsten und
          erfolgreichsten privaten Mediennetzwerke Deutschlands.
          Sie ist der gr&ouml;&szlig;te Arbeitgeber und das
          umsatzst&auml;rkste Unternehmen im Privatfunk der neuen
          Bundesl&auml;nder. EUROCAST ist ein strategischer
          Investor mit dem Ziel, ein wirtschaftlich erfolgreiches
          und stabiles Portfolio an Radiostationen in Europa
          aufzubauen, zu entwickeln und abzusichern.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a03"></A> 

          <H3>Frischer NuJazz beim Department Deluxe Radio - Nathan
          McLay an den Turntables</H3>

          <P>In der neuen Sendung des Department Deluxe Radio
          pr&auml;sentiert Resident-DJ Jan Siegmund wieder zwei
          Stunden lang frische Tunes aus der Welt zwischen Elektro
          und Jazz: Er stellt die neuen Alben von Quandt und
          Motorcitysoul vor, au&szlig;erdem die zwei herausragenden
          Compilations "Freedom Jazz Dance" und "Jazzflora -
          Scandinavian Aspects of Jazz". Die zweite Stunde der
          NuJazz-Show kommt direkt von "down under" aus Sydney.
          Denn wie gewohnt ist ein Gast in der Sendung:
          townb.comMastermind Nathan McLay aus Australien legt
          seine liebsten NuJazz-Platten auf.</P>

          <H3>AKTUELLE SENDERTIPPS</H3>

          <P>Strictly Black Music "Strictly Black Music" lautet das
          Motto von DefJay, dem Internetradio aus dem sonnigen
          Beverly Hills in Kalifornien. Hier dreht sich alles um
          R'n'B und HipHop der Extraklasse und allem anderen, was
          mit Black Music zu tun hat. Und das rund um die Uhr!
          Coole DJs stehen hier regelm&auml;&szlig;ig an den
          Plattentellern und sorgen mal f&uuml;r entspannte und mal
          f&uuml;r fette Beats.</P>

          <H3>WDR vor tiefgreifender Strukturreform</H3>

          <P>Der Westdeutsche Rundfunk steht vor einer
          tiefgreifenden Strukturver&auml;nderung. Der WDR, so
          Intendant Fritz Pleitgen vor dem Rundfunkrat am 22. April
          2004 in K&ouml;ln, sei immer gefordert, fortw&auml;hrend
          zu m&uuml;berpr&uuml;fen, ob das Unternehmen in seiner
          Vielschichtigkeit optimal aufgestellt ist. Durch die
          Zusammenlegung aller programmbezogenen mProduktions-,
          Technik- und Infrastrukturdienstleistungen in einer
          Direktion sollen Synergien erschlossen und die
          Rahmenbedingungen f&uuml;r mbiund trimediales Arbeiten
          verbessert werden. Wirtschaftlichkeit und Sparsamkeit
          seien gesetzliche Vorgaben, sie w&uuml;rden von der KEF
          energisch eingefordert. "Was wir gegenw&auml;rtig angehen
          bzw. bereits durchf&uuml;hren, sind ganz konkret die
          tiefgreifenden Strukturreformen, von denen die Politik
          fortw&auml;hrend mspricht " sagte Fritz Pleitgen im
          Rundfunkrat.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a04"></A> 

          <H3>SUMMER KISSES Festival - 98 8 KISS FM feiert 11.
          Geburtstag</H3>

          <P>SUMMER KISSES Festival - 98 8 KISS FM feiert 11.
          Geburtstag mit Sean Paul, T.O.K., CE'CILE, Elephant Man,
          Wayne Marshall, Vybz Kartel und Culcha Candela</P>

          <P>Berlin - Am Freitag, den 2.Juli 2004 feiert 98 8 KISS
          FM mit dem SUMMER KISSES Festival seinen 11. Geburtstag
          im gesamten Indoor -und Outdoor-Areal der Arena in
          Berlin-Treptow. Mit dabei sind Reggae und R'n'B Weltstar
          Sean Paul, der zur Zeit mit " I'm Still In Love With You"
          weltweit die Charts anf&uuml;hrt, die vier Jamaikaner von
          T.O.K, die als Reggae-Geheimtipp gehandelt werden, die
          Dancehall-Queen Ce'Cile, die es als eine der ganz wenigen
          Frauen mit Ihren Top-Hits "Changes" und "Double Jeopardy"
          an die Spitze der Reggae-Charts geschafft hat, Elephant
          Man, der 26j&auml;hrige Superstar der jamaikanischen
          Dancehall-Szene, sowie die Jamaikaner Wayne Marshall und
          Vybz Kartel, die in den Clubs in Kingston Town zu den
          hei&szlig;esten Acts geh&ouml;ren. Berlin-Flair bekommt
          das Festival durch die lokalen Reggae-Gr&ouml;&szlig;en
          von Culcha Candela.</P>

          <P>SUMMER KISSES wird ein riesiges Happening zum 11.
          Geburtstag von 98 8 KISS FM mit der Musik, die wie der
          Sommer schmeckt. Es wird unz&auml;hlige Chill-Out und
          Relax-Bereiche im Outdoor-Bereich des gesamten Areals der
          Arena in Berlin-Treptow, mit dem Glashaus, dem Yaam und
          dem Partyschiff Hoppetosse, geben. S&auml;mtliche 98 8
          KISS FM Moderatoren werden live vor Ort sein.</P>

          <P>"Wir gehen mit den SUMMER KISSES hier erstmals ein
          neues Festivalkonzept ein und beziehen s&auml;mtliche
          Innen -und Au&szlig;enbereiche der Arena in
          Berlin-Treptow in das Festival zum 11. Geburtstag von 98
          8 KISS FM mit ein. Unser Ziel ist es hier f&uuml;r den
          Besucher ein neues Konzerterlebnis mit verschiedenen
          Chill-Out-Bereichen zu schaffen, so Mohamed Anayssi,
          Leiter Kommunikation von 98 8 KISS FM.</P>

          <P>Die SUMMER KISSES werden am 2. Juli 2004 um 18.00 Uhr
          beginnen und Einlass wird bereits ab 16.00 Uhr sein. Die
          Tickets gibt es in allen teilnehmenden Mc Donald's -
          Filialen zum Sonderpreis von 29,90 EUR und nat&uuml;rlich
          an allen bekannten Vorverkaufsstellen.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a05"></A> 

          <H3>SAW pr&auml;sentiert 5 Punkte-Papier zur Zukunft des
          Radios</H3>

          <P>Am 22. April treffen sich in K&ouml;ln die
          f&uuml;hrenden Radioveranstalter mit Agenturen und Kunden
          zum traditionellen Radio Day. Im Mittelpunkt der
          Diskussion wird unter anderem eine Aufwertung des Mediums
          &acute;Radio&acute; in Deutschland stehen, das mit 5 % am
          Werbekuchen im internationalen Vergleich
          unterrepr&auml;sentiert ist. Der
          Gesch&auml;ftsf&uuml;hrer und Programmdirektor von radio
          SAW, einem der erfolgreichsten privaten Radioveranstalter
          in Deutschland, Mario A. Liese, will mit den folgenden
          Denkanst&ouml;&szlig;en Perspektiven f&uuml;r ein
          Zukunftsmodell aufzeigen, mit dem Radio zu einem
          wichtigen Player in der multimedialen und digitalen
          Zukunft von morgen werden kann:</P>

          <P>1 - Bereits jetzt zeichnet sich der Trend der
          n&auml;chsten Jahre ab: Das Verschmelzen der
          &Uuml;bertragungstechnologien auf digitaler Ebene. Die
          mp3-Technologie forciert diesen globalen Trend f&uuml;r
          alle deutlich sichtbar.</P>

          <P>2 - Das Radio muss die Chancen dieses Trends erkennen!
          Bislang wurde Digital Radio als Weiterentwicklung des
          UKW-Empfangs gesehen und nicht als beste, g&uuml;nstigste
          und zuverl&auml;ssigste Datenplattform f&uuml;r mobile
          digitale Anwendungen! Keine andere Technologie kann die
          Digitalwelt so kosteng&uuml;nstig vereinen (da
          point-to-multipoint-Technologie).</P>

          <P>3 - Die Telekommunikation diskutiert gerade &uuml;ber
          effizientere Methoden Mobiltelefone mit Daten und Videos
          zu versorgen. Die digitale Radiotechnologie kann genau
          diese Schnittstelle sein. Das Integrieren z.B. von DAB in
          Mobiltelefone erm&ouml;glicht den Verbrauchern die
          Nutzung eines R&uuml;ckkanals &uuml;ber UMTS. Der
          H&ouml;rer bzw. Nutzer kann dann nicht nur ein
          Radioprogramm oder Daten empfangen, sondern gleichzeitig
          auf seine Bed&uuml;rfnisse zugeschnittene,
          personalisierte Informationen erhalten oder
          Content-Service abrufen. Bereits jetzt hat Radio die
          Telekommunikation als neue Einnahmequelle erkannt. So
          konnte radio SAW in diesem Jahr allein beim Gewinnspiel
          "100.000 f&uuml;r 10" 2,5 Millionen calls generieren.
          Eine enge Verkn&uuml;pfung von Radio und
          Telekommunikation er&ouml;ffnet weitere
          M&ouml;glichkeiten.</P>

          <P>4 - Die digitale Radiotechnologie kann zugleich die
          Antwort sein, die die kabellose Computer- und
          Unterhaltungsindustrie sucht. Die Radiotechnologie ist zu
          allen digitalen Standards kompatibel, kosteng&uuml;nstig,
          mobil und sicher (keine Virengefahr bei
          Daten&uuml;bertragung).</P>

          <P>5 - Das Integrieren der digitalen Radiotechnologie in
          Mobiltelefone, Pocket-PCs und andere vor allem mobile
          Medien er&ouml;ffnet dem Radio neue
          Verbreitungsm&ouml;glichkeiten und den Zugang zu neuen
          Gesch&auml;ftsmodellen, die es zu entwickeln gilt. "Das
          Medium Radio kann selbstbewusst in die Zukunft blicken,
          denn es bietet gerade f&uuml;r die mobile Generation der
          Zukunft die bestm&ouml;glichen Antworten! Diese Chancen
          gilt es auch innerhalb des Mediums zu begreifen und zu
          nutzen. Ich w&uuml;nsche mir, dass mit diesen Punkten
          eine neue, vorw&auml;rtsblickende Diskussion um das
          Medium Radio er&ouml;ffnet wird und bedanke mich f&uuml;r
          die Unterst&uuml;tzung bei der Erarbeitung des
          Punkte-Papiers bei der Agentur Wiegel &amp; Werbung
          Marketing, M&uuml;nchen, und dem Verein Digital Radio
          Mitteldeutschland," so Liese.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a06"></A> 

          <H3>IMDR startet bundesweite Print-Kampagne</H3>

          <P>Die Initiative Marketing Digital Radio geht ab 19.
          April 2004 mit einer Aufsehen erregenden
          Anzeigen-Kampagne in die Offensive. "Rauscht's?" oder
          "Knackt's"? Mit frechen Fragen, die die Schw&auml;chen
          des analogen terrestrischen H&ouml;rfunks auf's Korn
          nehmen, wirbt die Initiative Marketing Digital Radio
          (IMDR) ab 19. April 2004 in gro&szlig;en Tageszeitungen
          f&uuml;r den H&ouml;rfunk-Standard der Zukunft: Digital
          Radio setzt neue Ma&szlig;st&auml;be in Sachen
          &Uuml;bertragungs- und Servicequalit&auml;t. Eine
          Teaserkampagne als Textteilanzeige soll die St&auml;rken
          einem breiten Publikum bekannt machen. "Wir setzen mit
          dieser Kampagne, die ab sofort rund zwei Monate in
          gro&szlig;en Tageszeitungen Deutschlands geschaltet wird,
          auf eine bewusst provozierende Ansprache des Publikums",
          erkl&auml;rt Helmut Egenbauer, Vorsitzender der IMDR.
          "Dabei m&ouml;chten wir die bekannten, durchaus
          vertrauten Schw&auml;chen des analogen terrestrischen
          H&ouml;rfunks zugespitzt - aber mit einem sympathischen
          Augenzwinkern - auf den Punkt bringen", f&uuml;hrt Helmut
          Egenbauer weiter aus. Das scheint gelungen. Die Teaser,
          die aufmerksamkeitsstark und mit gro&szlig;em
          Fragezeichen Knacken, Rauschen, St&ouml;rungen,
          &Uuml;berlagerungen und andere Allt&auml;glichkeiten des
          analogen Rundfunks thematisieren, werden jeweils unter
          der Headline "Un&uuml;berh&ouml;rbar gut" aufgel&ouml;st.
          Dort sind dann die aus Sicht der IMDR entscheidenden
          Vorteile dargestellt: H&ouml;rfunk in CD-Qualit&auml;t,
          begleitende Serviceleistungen wie Nachrichten, Wetter-
          und Verkehrsdienst sowie eine nahezu vollst&auml;ndige
          Abdeckung in Deutschland. Als Textteilanzeige platziert
          sorgen die Printmotive in gro&szlig;en Tageszeitungen
          f&uuml;r maximale Aufmerksamkeit. Hintergrund f&uuml;r
          diese Kommunikations-Offensive ist das ambitionierte Ziel
          der IMDR, Digital Radio in Deutschland als den "Standard
          der schon heute beginnenden Zukunft" zu etablieren, wie
          Helmut Egenbauer selbstbewusst ausf&uuml;hrt. "Denn
          Digital Radio ist einfach besser und er&ouml;ffnet allen
          Marktpartnern neue wirtschaftliche Chancen", f&uuml;gt er
          an dieser Stelle hinzu. Man sei sicher, dass an dieser
          entscheidenden Entwicklung niemand vorbeikomme. Das will
          die IMDR mit dieser Kampagne neben den Nutzern zu Hause
          und im Auto auch der Werbewirtschaft deutlich
          signalisieren.</P>

          <P><B>&Uuml;ber die IMDR</B><BR>
           Die Initiative Marketing Digital Radio als Gemeinschaft
          von Industrie, Netzbetreibern und Programmanbietern
          f&ouml;rdert die Verbreitung von Digital Radio. Ein
          gro&szlig;er Erfolg wurde die Internationale
          Funkausstellung in Berlin mit dem gemeinsamen Auftritt
          von WorldDAB/IMDR, bei dem die gro&szlig;e
          Endger&auml;tevielfalt Messebesucher &uuml;berzeugte.
          Digital Radio war auch Thema des ARD-Symposiums auf der
          IFA. 18 Mitgliedsunternehmen aus Deutschland
          unterst&uuml;tzen WorldDAB, f&uuml;nf der 14 Steering
          Board Members stammen ebenfalls aus Deutschland. Weltweit
          wird das neue Rundfunksystem von WorldDAB gef&ouml;rdert.
          Mehr Informationen gibt es online unter
          www.digitalradio.de mit einem umfangreichen Service-
          Angebot und Informationen &uuml;ber aktuelle Programme,
          Ger&auml;te und H&auml;ndler-Adressen.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a07"></A> 

          <H3>Die Geschichte des Privatradios</H3>

          <P>Das letzte Jahrtausend bescherte uns die
          Hexenverbrennung, die Pest und die FDP. Und um die
          B&uuml;chse der Pandora vollends zu leeren, auch noch den
          Privaten Rundfunk. All jene, die diesen wackligen Kahn
          bestiegen in den achtziger Jahren, waren von einer
          Tiefsitzenden Illusion beseelt, die da hie&szlig;: Auch
          da kann man anst&auml;ndiges Radio machen, bei dem man
          sich noch morgens im Spiegel betrachten kann. Huharhar,
          da hatten sie aber die Rechnung ohne die Gesetze des
          Kapitalismus gemacht. Denn eher wird ein Kamel
          Programmdirektor, als dass ein Reicher in den Radiohimmel
          kommt. Und reich konnte man damals werden mit der
          staatlichen Lizenz zum Gelddrucken. Tempi passati, wie
          der Italiener sagte, als der neue Volkswagen vorgestellt
          wurde. Doch blicken wir in Wehmut zur&uuml;ck auf die
          Goldgr&auml;berzeit im &Auml;ther. Die Achtziger Jahre
          neigten sich dem Ende zu, die DDR war noch
          eingez&auml;unt, Helmut Kohl hatte fast sein
          endg&uuml;ltiges Volumen erreicht und Phil Collins
          startete seine Solokarriere. Die zwei letzten Ereignisse
          sollten nachhaltigen Einfluss auf die deutsche
          Medienlandschaft haben. Ohne den Dudelking der
          fr&uuml;hen 90er h&auml;tte das Privatradio nicht so
          schnell den Durchbruch geschafft, ja und ohne Helmut Kohl
          im Zenit seiner Schaffenskraft mit seinem Hass auf den
          Rotfunk g&auml;be es &uuml;berhaupt keinen Privatfunk. In
          v&ouml;lliger Verkennung der Tatsachen hielt er die ARD
          f&uuml;r die f&uuml;nfte Kolonne Moskaus, wenn nicht gar
          der SPD. Um die roten Halunken auszur&auml;uchern,
          m&uuml;sste Konkurrenz in den &Auml;ther. Und so erfand
          der Dicke die neue Medienlandschaft und nannte sie in
          Anlehnung an seine m&auml;chtigen Extremit&auml;ten das
          Zweis&auml;ulenmodell. Doch wer war dieser vermeintliche
          Rotfunk wirklich, den der Oggersheimer so hasste.
          Aufgesplittert in ein Dutzend Landessender war die ARD
          eine Megabeh&ouml;rde, die Zwangsgeb&uuml;hren in
          Fr&uuml;hverrentung umwandelte. Vom Revoluzzertum waren
          die Wellenreitenden Medienleichen soweit entfernt wie die
          heutige SPD von sich selber. Abertausend
          Motivationsgreise sa&szlig;en in tristen B&uuml;ros oder
          so genannten Kasinos herum und unterschrieben den ganzen
          Tag Gl&uuml;ckwunschkarten f&uuml;r wieder andere
          Kollegen, die den Sprung in die Fr&uuml;hrente geschafft
          hatten. Sie f&uuml;hrten Titel wie "Hauptabteilungsleiter
          unterhaltendes Wort" oder "Zeitfunkredakteur". Kein
          normaler Mensch konnte sich vorstellen, was so jemand den
          ganzen Tag tat. Die Antwort war aber ganz leicht: nix.
          Denn die Marie kam ja auch so. dazu hatte man sich ein
          ganz perfides Instrument ausgedacht: die "Kommission zur
          Feststellung des Finanzbedarfes des
          &ouml;ffentlich-rechtlichen Rundfunks" Normale Menschen
          kennen dieses Ph&auml;nomen lediglich aus ihrer
          S&auml;uglingszeit: da musste man auch nur laut genug
          schreien und schon packte Mama die N&auml;hrtitte wieder
          aus und es gab was zu fressen. &Uuml;ber dieses Stadium
          sind ARD und ZDF nie hinausgekommen. Damit das auch immer
          weiter funktioniert, bedienen sie sich zweier todsicherer
          Systeme. Einmal des Rundfunkrates, eine Art
          M&uuml;lldeponie f&uuml;r aussortierte Parteischranzen.
          Als Endlagergeb&uuml;hr m&uuml;ssen die Parteien
          daf&uuml;r im Bundestag immer f&uuml;r die Erh&ouml;hung
          der Rundfunkgeb&uuml;hren stimmen. Das System
          funktioniert reibungslos. Die zweite
          &Uuml;berlebenssicherung ist etwas komplizierter. ARD und
          ZDF haben neben der Selbstverwaltung auch noch eine
          kleine Nebenaufgabe: die so genannte Grundversorgung,
          d.h. irgendwelchen Mist ausstrahlen, von dem sie glauben,
          dass der normale GEZ-Trottel das braucht:
          Volksmusiksendungen, Nachrichten oder Kleine
          Fernsehspiele. Da die reitenden Medienleichen aber selber
          keine Ahnung von Programmen haben, au&szlig;er es zu
          verhindern, bedienen sie sich einer hauseigenen Heloten-
          und Pariakaste, den so genannten "Freien". Da sie zumeist
          selber mal so angefangen haben, blicken sie auf diese
          Sklavenkaste mit gro&szlig;er Herablassung. Die "Freien"
          haben nur ein Ziel: "sich einklagen", die
          "Festangestellten" nur eine Aufgabe: genau das zu
          verhindern. Die Freien sind allerdings in einer
          beschisseneren Situation, weil sie nebenbei noch
          Programminhalte gegen den Widerstand der
          Schnarchs&auml;cke zusammenstoppeln m&uuml;ssen. Wenn
          sie's dann endlich geschafft haben, selber in die
          Herrscherkaste aufzusteigen, werden die neuen Freien
          nat&uuml;rlich umso mehr gefickt, um sich f&uuml;r ihre
          eigenen Dem&uuml;tigungen zu r&auml;chen. Was war das
          nun, was da so nebenbei aus den Ger&auml;ten rauschte und
          flimmerte damals? Ich sag mal so: es gab ja nix anderes!
          Ganze Senderketten verbreiteten 24-Stunden-Programme, in
          denen an sich schon stinklangweiligen Operetten Melodeien
          vom eigenen Rundfunkorchester der letzte Lebenshauch
          genommen wurde. In anderen Programmen, meistens waren es
          die "Zweiten" oder "Dritten" verstrahlte man "Magazine".
          Zwischen zuckers&uuml;&szlig;em Italopop blubberte ein
          k&uuml;rzlich wieder belebter Moderator eine Weisheit aus
          dem Bauernkalender herunter, dann entstand eine Pause so
          lang wie die Mittlere Kreidezeit. Der Mikrophongreis
          fuchtelte mit den Pranken in der Luft herum, auf der
          anderen Seite einer schusssicheren Scheibe blickte
          schlie&szlig;lich ein M&uuml;tterlein von seinem
          Strickzeug hoch und dr&uuml;ckte widerwillig auf einen
          roten Knopf. Endlich konnte der Geb&uuml;hrenzahler
          zuhause am Empf&auml;nger dann die brandhei&szlig;e
          Scheibe von Al Bano und Romina Power ... ausschalten.
          Manchmal gab es zwischendurch auch noch "gebaute
          Beitr&auml;ge mit Originalton Einspielungen". Da hatte
          man einen Sklaven mit einem zentnerschweren
          Tonbandger&auml;t nach H&uuml;ckeswagen geschickt, um das
          &ouml;rtliche Trachtenliesel aufzunehmen. War etwas
          richtig Spannendes los im Sendegebiet, etwa die
          Er&ouml;ffnung der Landesgartenschau in Bad Zwischenahn,
          dann gab's auch schon mal eine "Live Schalte". Dazu
          musste Tage vorher eine komplette Infanterie Einheit des
          Senders in das Zielgebiet verlegt werden. Mit mehreren
          &Uuml;-Wagen, Bergepanzern und sonstigem schweren
          Ger&auml;t. War dann aus Versehen tats&auml;chlich mal
          was los auf der Gartenschau, waren die Kollegen fast
          immer "in der Pause" oder wurden gerade "abgel&ouml;st".
          Deshalb wurden auch diese Jobs zusehends mit
          S&ouml;ldnern best&uuml;ckt, damit auch was zum Senden da
          war. Wie hinterw&auml;ldlerisch das jetzt auch alles
          klingen mag, aber die Magazinprogramme waren die
          Flaggschiffe der ARD-Sender, in den anderen Programmen
          sah es noch schlimmer aus. H&auml;tte Kafka noch gelebt,
          sein zeitgen&ouml;ssisches Werk hie&szlig;e
          "Rundfunkanstalt" mit Betonung auf den letzten beiden
          Silben. Nur in einem war die ARD ihrer Konkurrenz weit
          voraus: Sie war schon Mitte der 70er Jahre komplett
          digitalisiert, und zwar in den Armbanduhren ihrer
          Mitarbeiter, damit diese exakter in den Feierabend
          verschwinden konnten. Kurz gesagt, damals das war das
          Paradies oder zumindest war die ARD wie die DDR, eben nur
          mit ordentlich Valuta. Auf diese Situation trafen nun die
          neuen Privatsender in den sp&auml;ten Achtzigern. So muss
          es gewesen sein als Cortes die Aztekenhauptstadt
          Tenochtitlan betrat: Es war ein einziges Morden und
          Schlachten. Die Heerscharen der Konquistadoren trafen auf
          eine v&ouml;llig unbewaffnete dekadente Hochkultur, der
          sie in kurzer Zeit aber Millionen H&ouml;rer abnahmen.
          Wie haben sie das geschafft? Auch beim Privatfunk gab es
          damals keine Konkurrenz. Helmut Kohl und seine
          Duodezf&uuml;rsten hatten das Land in Lehen aufgeteilt
          und an ihre vermeintlichen Kumpels aus dem
          publizistischen Mittelstand verteilt.</P>

          <P>Eine Sendelizenz f&uuml;r ganz Norddeutschland gab es
          einfach so umsonst. Tolle Sache! Da freute sich der
          Besitzer des Ammerl&auml;nder Volksfreundes und stieg mit
          5% in die Sache ein. Das ganze Unternehmen war
          nat&uuml;rlich eine &auml;u&szlig;erst durchsichtige
          Vetternwirtschaft und hatte mit offenem Markt soviel zu
          tun wie die SPD mit Sozialismus. Richtig! Die musste
          nat&uuml;rlich auch noch zufrieden gestellt werden, damit
          die Kacke nicht zum Himmel stank. Und worauf steht der
          Soz am meisten? Genau: neue Beh&ouml;rden, wo er
          Altgedienten Genossen nach der M&uuml;hsal der
          Parteiarbeit ein Gnadenbrot zuschustern kann. Diese
          Beh&ouml;rden hie&szlig;en "Landesmedienanstalten" und
          beherbergten neben den Hauptamtlichen die Vertreter der
          "gesellschaftlich relevanten Gruppen", also Arbeitslose,
          Steuerhinterzieher, Tagediebe und Schwarzarbeiter.</P>

          <P>Hihi, falsch geraten. Unter einer "gesellschaftlich
          relevanten Gruppe" versteht man im Jargon der
          Bundesrepublik einen Verband, Lobbyverein oder
          Religionsverwalter, der seit mehreren Jahrzehnten seine
          Harmlosigkeit unter Beweis gestellt hat. Da sa&szlig;en
          sie nun in ihren neuen Landesmedienanstalten und
          kontrollierten bei den Privatradios z.B. den
          "prozentualen Wortanteil" oder ob der akustischer Trenner
          zwischen Gedudel und Werbung lang genug war - eine
          schweinerelevante T&auml;tigkeit auf jeden Fall. Kurz:
          Die Privatsender machten mehr oder weniger was sie
          wollten und das war Geld verdienen und sonst gar nix.
          Doch auch sie entstanden ja nicht im luftleeren Raum
          sondern brauchten Leute, die den Laden aufbauten. Das
          waren alles Figuren aus der Unterwelt, also der ARD. Die
          waren zwar noch nicht so vollkommen abgestorben wie ihre
          Kollegen, denn sonst h&auml;tten sie wohl kaum den
          Ausgang gefunden, aber sie machten eben auch ganz
          entscheidende Fehler. Der gr&ouml;&szlig;te war, zu
          glauben, f&uuml;r Privatradio br&auml;uchte man Personal.
          Erst in letzter Zeit wird dieser Fehler korrigiert. Woher
          nehmen? Nat&uuml;rlich auch aus der ARD, woher sonst. Aus
          den Zwingern der Sklaven und aus den gebohnerten Stuben
          der Sackgassenkarrieristen. Weil das aber noch nicht
          reichte, bediente man sich einer gro&szlig;en Zahl
          Quereinsteiger, die hatten von Radiomachen &uuml;berhaupt
          keine Ahnung und kamen deshalb mit den Chefs bestens
          zurecht. Wie inkompetent auch jeder Einzelne war,
          zusammen waren sie eine hochexplosive Mischung. Jeder
          steuerte seinen Teil zum Erfolg bei: die freigekauften
          ARD-Sklaven ihren Hass auf die ehemalige Haftanstalt, die
          Sackgassenkarrieristen eine vage Ahnung davon wie Radio
          funktioniert und die Quereinsteiger die Utopie, das es
          auch ganz anders geht. Es dauerte keine zwei Jahre und in
          den Nebelheimen der ARD ging die Angst umher: Wie
          schafften diese Chaoten und Privatfunker es blo&szlig;,
          soviel H&ouml;rer abzugreifen? Die hatten ja noch nicht
          mal ein Rundfunkorchester geschweige denn eine Horde
          menschlicher R&auml;uspertasten, genannt
          Sendeablauftechniker. Doch die Antwort war ganz einfach:
          gegen die ARD-Anstalten h&auml;tten selbst die
          Radioamateure der Taubstummenanstalt eine Chance gehabt.
          Es dauerte weitere zwei Jahre bis die Schnarchs&auml;cke
          aus ihrem Geb&uuml;hrenfinanzierten Kasinoschlaf
          erwachten und die einzig vern&uuml;nftige Antwort parat
          hatten: Wir kopieren einfach die neuen Sender.</P>

          <P>Dazu kauften sie die Sklavenmoderatoren von einst
          zur&uuml;ck, lernten W&ouml;rter wie "Verpackung",
          "Teaser", "Preselling" oder "Linercard" statt
          Schmierzettel. Schon bald h&ouml;rte sich Zauselwelle
          Zwei genauso an wie Hitradio 0815. Da wiederum ging den
          Werbefunkern die Lizenz auf Grundeis und es war Schluss
          mit lustigem Chaotenfunk, denn der Besitzer des
          Ammerl&auml;nder Volksfreundes fand es gar nicht witzig,
          dass die Werbeeinnahmen dahinschwanden. Und hier beginnt
          der eigentliche Niedergang des gesamten Radios. 75 Jahre
          lang hatte dieses Medium alles verkraftet, hatte trotz
          aller Widrigkeiten noch immer Inseln der zivilisierten
          Unterhaltung und Information geboten. Die Radiokultur
          hatte den Nationalsozialismus &uuml;berlebt, die DDR, die
          ARD, RSH und die Grippewelle Hamm. Doch nun wurde das
          Ende eingel&auml;utet: Es fing ganz harmlos an mit so
          genannten Beratern, meistens Bayern mit englischen
          Vornamen oder sogar Holl&auml;ndern. Ber&uuml;chtigt
          wurden sie unter dem Namen "Formatfaschisten". Ihr
          Glaubensbekenntnis hie&szlig;: Radio kann nicht
          bescheuert genug sein. Und der Weg dorthin lautete: Mach
          nix Neues, wenn Du auch etwas wiederholen kannst. Zuerst
          traf es die Musik, der Bestand wurde radikal auf 400
          Titel gek&uuml;rzt.</P>

          <P>Dann die Moderationen, der Wortschatz der Witzfigur am
          Mikrophon durfte aus maximal 25 falsch ausgesprochenen
          Stammelbegriffen bestehen, z.B. "Megahit", "superaktuell"
          oder "superaktueller Megahit". Als Ansager beim
          Autoscooter w&auml;ren sie mit dem beschr&auml;nkten
          Vokabular rausgeflogen. Die Formatfaschisten
          pr&uuml;gelten jedes aufmodulierte Nutzsignal in ihre
          Formatuhr, damit auf jeden Fall nix Neues passiert. Weil
          jeder Dreij&auml;hrige diese gequirlte Kinderkacke sofort
          durchschaut h&auml;tte, gaben sie dem ganzen
          Schei&szlig;dreck einen Anstrich von Seriosit&auml;t, den
          nannten sie "Research". Dazu sperrten sie f&uuml;nf
          Hausfrauen zwischen 14 und 29 in ein dunkles Loch und
          befeuerten sie mit 10 Sekunden -Schnipseln bekannter
          Popmusik. Immer wenn eine der f&uuml;nf zuckte, flog der
          Titel raus. Einmal hatte sich eine Wespe in eins der
          Research- L&ouml;cher verirrt, daraufhin musste der
          Auftragssender vier Wochen lang sein Programm mit drei
          Titeln bestreiten. Denn die Research ist heilig, da gab's
          nix dranrumzukritteln. Eigentlich waren die
          Formatfaschisten jetzt am Ziel: der nichts sagende
          Einheitsbrei aus Doofmanngedudel und Gejingel war
          perfekt. Und weil die Schurken fast alle Sender
          Deutschlands gleichzeitig &uuml;berfallen hatten, gab es
          f&uuml;r den H&ouml;rer auch keine Alternative.
          Notgedrungen lie&szlig; er das Radio unter der
          Aufmerksamkeitsschwelle weiterdudeln.</P>

          <P>Die ARD-Sender waren mittlerweile so schlau geworden,
          dass sie diese Attacke der Privaten sofort kopierten und
          auch die Formatfaschos mit Millionenbetr&auml;gen ihre
          Programme auf Linie ziehen lie&szlig;en. Es war die Mitte
          der Neunziger Jahre. Alle Resthirnbesitzer in den
          Radiobuden waren mittlerweile der Meinung: schlimmer
          kann's nicht mehr kommen. Doch die Formatfaschos
          brauchten wieder Auftr&auml;ge, also dachten sie sich die
          n&auml;chste Stufe des Wahnsinns aus: Die Morning Show.
          Wer bisher an einen fortschreitenden Prozess der
          Zivilisation in der Geschichte der Menschheit geglaubt
          hatte, wurde nun eines Besseren belehrt.</P>

          <P>Fast jeder Privatsender konzentrierte das gesamte in
          ihm versammelte B&ouml;se auf drei bis vier Stunden
          Sendezeit am fr&uuml;hen Morgen. Der Morgenm&auml;n, der
          Sidekick, das Wetterf&ouml;tzchen, die Verkehrsbiene
          direkt aus dem ADAC-Hubschrauber im Funkhauskeller. Diese
          Hominidenbrut quirlte einen Aufguss aus albernem
          Bl&ouml;dsinn, Gewinnspielchen und Witzeleien zusammen,
          der so unterirdisch war und ist, dass sich dem Chronisten
          vor Ekel der Mund verschlie&szlig;t. &Auml;hnlich wie
          Joseph Goebbels waren sie der Meinung, dass Bl&ouml;dsinn
          schreiend vorgetragen gern als Wahrheit akzeptiert wird.
          Allerdings hatten diese B&uuml;rschchen nat&uuml;rlich
          nicht sein Format.</P>

          <P>Die Landesmedienanstalten allerdings konnten sich
          freuen, denn erstmals stieg der Wortanteil wieder im
          Privatradio. Als H&ouml;rer w&uuml;nschte man sich
          allerdings, die rum&auml;nische Zungenf&auml;ule
          grassiere unter den Morgenm&auml;ns dieser Republik, gern
          mit t&ouml;dlichem Ausgang. Auch bei den Mitarbeitern
          hatte sich einiges getan. Wer seiner Zeit hoffnungsfroh
          aus der ARD hin&uuml;berwechselte, musste erkennen, dass
          Schei&szlig;e durchaus in mehreren Farben existierte. Wer
          konnte, wechselte zur&uuml;ck und legte sich irgendwo
          beim NDR oder WDR an die Heizung. Andere blieben im
          Hottentottenfunk, gr&uuml;ndeten Betriebsr&auml;te, damit
          sie zeitweise aus den Gro&szlig;raumb&uuml;ros fliehen
          konnten. Wieder andere gingen ganz, lernten was
          Anst&auml;ndiges wie Katzenschlachter oder Pf&ouml;rtner
          im H&uuml;hnerpuff. Es blieben vor allem zwei Gruppen. In
          der einen war man j&uuml;nger als 25 und dementsprechend
          korrumpierbar durch Cabrios und VIP-Karten. In der
          anderen Gruppe war man entweder abgebr&uuml;ht oder
          tats&auml;chlich so b&ouml;se. Der Einfachheit halber
          nenn ich die Gruppe mal die B&Ouml;SEN. Die B&Ouml;SEN
          hatten das Credo der Formatfaschisten in diversen
          W&uuml;stencamps in sich aufgesogen. Sie waren zu allem
          bereit: sie moderierten nackt vorm Mikrophon,
          lie&szlig;en H&ouml;rer ihr eigens Badezimmer
          zertr&uuml;mmern oder spielten DJ Bobo, ihnen war alles
          schei&szlig;egal. Sie hatten sich mit dem System
          arrangiert und profitierten davon.</P>

          <P>Doch f&uuml;r jeden Kollaborateur kommt auch einmal
          die Stunde der Wahrheit. Mittlerweile waren die
          Restinhalte des Programms so derma&szlig;en austauschbar
          und farblos geworden, dass selbst die
          zusammengeschrumpften Hirne der Morgenm&auml;ns
          unterfordert waren. Zudem hatte die Technik gro&szlig;e
          Fortschritte gemacht: das Format kann sich heute selber
          senden, es braucht seine Knechte nicht mehr. Denn in
          einem ist der Computer jedem Menschen voraus: Konsequent
          den selben Schei&szlig; runterleiern kann er viel besser.
          Und so schleichen im neuen Jahrtausend die Wortgespenster
          f&uuml;r ein paar Stunden pro Woche an ihren
          Aufnahmerechner, labern hundert bedeutungsschwere
          S&auml;tze wie "Und jetzt wieder einen Superhit am
          St&uuml;ck" auf die Festplatte, ja und dann d&uuml;rfen
          sie wieder in ihre Plattenbude zur&uuml;ck. Der
          Formatrechner puzzelt aus dem ganzen Mist ein
          24-Stunden-Non-Stop-Schleim und was der Sch&ouml;nste
          ist: der H&ouml;rer merkt &uuml;berhaupt keinen
          Unterschied. Jahrelang wurde er konsequent gegen jede
          Spontaneit&auml;t und Originalit&auml;t desensibilisiert,
          so dass ihm alles genauso wie fr&uuml;her erscheint.
          Endlich: das Kriegsziel der Formatfaschos ist erreicht:
          keine Menschenseele mehr aufm Flur, nur noch die
          Formatverwalter, die Radio ja sowieso hassen und froh
          sind, endlich unter sich zu sein.</P>

          <P>Was kann da noch kommen? Schon bald kann man
          Radioempf&auml;nger kaufen, in denen die Sender schon
          drin sind. Ganz Hitradio sowieso mit allem was es je zu
          sagen h&auml;tte passt auf einen daumennagelgro&szlig;en
          Chip. Seine komplette Vergangenheit und Zukunft ist schon
          im Ger&auml;t gespeichert und der Zufallsgenerator quirlt
          den besten Mix aller Zeiten so perfekt durcheinander,
          dass die unschuldigen H&ouml;rer immer noch glauben:
          irgendwo in einem Studio sitzt nachts ein Mensch allein
          und spricht zu anderen anonymen Nachteulen da
          drau&szlig;en, sozusagen von Mensch zu Mensch. Alles
          L&uuml;ge, alles l&auml;ngst Folklore.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a08"></A> 

          <H3>Mainflingen: Gemeinde geht gegen Sender vor</H3>

          <P>Die Gemeinde Mainhausen geht auf politischem und
          rechtlichem Wege gegen den etwa 1500 Meter
          au&szlig;erhalb der Ortslage Mainflingen befindlichen,
          seit 1996 vom Evangeliums-Rundfunk (ERF) genutzten
          Mittelwellensender vor. In Anschreiben an eine Reihe von
          Institutionen wird eine Neufestsetzung einschl&auml;giger
          Feldst&auml;rkegrenzwerte gefordert. Zugleich ist vor dem
          Landgericht Darmstadt eine Klage auf R&auml;umung des
          Sendergel&auml;ndes gegen die Deutsche Telekom
          anh&auml;ngig. Die B&uuml;rgermeisterin Ruth Disser wird
          von der Offenbach-Post mit der Argumentation zitiert,
          da&szlig; der ERF "vermutlich nur einen begrenzten
          H&ouml;rerkreis hat und dar&uuml;ber hinaus auch
          &uuml;ber Satellit zu empfangen ist".</P>

          <P>Das Programm des ERF wird in Mainflingen auf 1539 kHz
          mit zwei jeweils 350 kW starken Sendern aus dem Jahre
          1968 ausgestrahlt, die bei Dunkelheit mit voller
          Gesamtleistung von 700 kW und tags&uuml;ber mit 120 kW
          arbeiten. Bis 1994 lief &uuml;ber die Mainflinger
          Mittelwelle das Programm des Deutschlandfunks, der
          seinerzeit auf diese Frequenz zugunsten einer Anmietung
          der Mittelwelle des Saarl&auml;ndischen Rundfunks (1422
          kHz) verzichtete. Dar&uuml;ber hinaus werden in
          Mainflingen auch Langwellensender mit i.d.R. 50 kW
          f&uuml;r Fernwirkzwecke auf Frequenzen unterhalb des
          LW-Rundfunkbereichs betrieben, darunter der von
          handels&uuml;blichen Funkuhren empfangene
          Zeitzeichensender DCF77 auf 77,5 kHz. In der
          Vergangenheit wurden diese Sender bei Wartungsarbeiten in
          Donebach auch zur Ausstrahlung des Deutschlandfunks auf
          153 kHz herangezogen, dessen Langwellenverbreitung von
          1962 bis zur Inbetriebnahme des Senders Donebach im Jahre
          1967 generell von der Sendestelle Mainflingen besorgt
          wurde. Seit einigen Jahren wird auf solche
          Ersatzsendungen aus Mainflingen jedoch verzichtet, womit
          die Langwelle 153 kHz ersatzlos ausf&auml;llt, wenn sich
          Wartungsarbeiten an der aufwendigen Antennenanlage in
          Donebach erforderlich machen.</P>

          <P><B>Athlone 612 kHz abgeschaltet</B><BR>
           Wie angek&uuml;ndigt hat der irische Rundfunk RT&Eacute;
          seinen Mittelwellensender Athlone abgeschaltet. Seit dem
          13.04.2004 ist die Frequenz 612 kHz nicht mehr in
          Betrieb.</P>

          <P>Auf diesem damit nicht mehr aus Irland belegten Kanal
          sind bei Dunkelheit in Mitteleuropa jetzt vor allem
          Sender aus Sarajevo und Vilnius zu h&ouml;ren . Aus
          Vilnius werden mit einer Leistung von 100 kW derzeit der
          belorussische Dienst von Radio Liberty (05.00-07.00 und
          17.00-23.00 Uhr), ein ebenfalls belorussisches Programm
          von Radio Polonia (23.00-23.30 Uhr) sowie Programme der
          Stimme Ru&szlig;lands (09.00-17.00 Uhr) ausgestrahlt. Der
          Sender in Sarajevo &uuml;bertr&auml;gt das Programm von
          Radio Bosnien-Herzegowina, wobei aber zweifelhaft
          erscheint, ob die offizielle Angabe der Sendeleistung von
          600 kW zutrifft.</P>
          <B>&Ouml;sterreich auf Kurzwelle</B> <BR>
           Zehn Monate nach der Einstellung von Radio
          &Ouml;sterreich International liegen f&uuml;r die nunmehr
          von &Ouml;sterreich 1 betreuten Kurzwellensendungen des
          ORF kaum noch aussagekr&auml;ftige Informationen
          &uuml;ber deren Programmablauf vor. Das Internetangebot
          von &Ouml;sterreich 1 enthielt mit Stand 18.04.2004 nur
          veraltete Angaben f&uuml;r die zur&uuml;ckliegende
          Winterperiode. F&uuml;r Europa wird &uuml;ber die Sender
          in Moosbrunn weitestgehend das Programm von
          &Ouml;sterreich 1 ausgestrahlt ; einzige Ausnahmen sind
          Sendungen in Englisch, die offenbar Mo-Fr 14.45-15.00 Uhr
          (Report from Austria) sowie Sa und So 14.05-14.30 und
          14.35-15.00 Uhr (Insight Central Europe) laufen.
          Dar&uuml;ber hinaus werden auch noch die Mo-Fr um 22.55
          Uhr im Programm von Radio 1476 verbreiteten Nachrichten
          in Spanisch &uuml;bernommen. Die Sendungen in
          au&szlig;ereurop&auml;ische Zielgebiete werden aus
          Beitr&auml;gen von &Ouml;sterreich 1 und den
          ORF-Regionalradios sowie den genannten Sendungen in
          Englisch und Spanisch zusammengestellt. Ausgestrahlt
          werden die ORF-Programme &uuml;ber die Station Moosbrunn
          jetzt auf folgenden Frequenzen: 

          <UL>
            <LI>5945 kHz: 19.30-00.08 Uhr; f&uuml;r Europa</LI>

            <LI>6155 kHz: 06.00-00.08 Uhr; f&uuml;r Europa</LI>

            <LI>9870 kHz: 01.00-04.00 Uhr; f&uuml;r die
            Amerikas</LI>

            <LI>13730 kHz: 06.00-19.30 Uhr; f&uuml;r Europa</LI>

            <LI>17715 kHz: 14.00-15.00 Uhr; f&uuml;r Asien und
            Australien</LI>

            <LI>17870 kHz: 07.00-08.00 Uhr; f&uuml;r Nahost</LI>
          </UL>

          <P>Dar&uuml;ber hinaus wird &uuml;ber die Sendestation
          Sackville in Kanada ein Programmblock f&uuml;r
          Nordamerika 17.00-18.00 Uhr auf 13775 kHz
          &uuml;bertragen.</P>

          <P>Eingestellt wurden offenbar die
          Kurzwellen&uuml;bertragungen des Wiener Projektes Radio
          Afrika International. Vom ORF wurde zwar erneut eine
          Frequenz f&uuml;r Sendungen nach Afrika reserviert (17875
          kHz, 16.00-18.00 Uhr), jedoch liegen seit l&auml;ngerer
          Zeit keine Empfangsbeobachtungen mehr vor. Nach wie vor
          Bestand haben hingegen die Sendungen von Radio Afrika
          International im Rahmen des Programms von Radio 1476, die
          t&auml;glich zwischen 21.30 und 23.00 Uhr laufen (Audio
          2). Radio 1476 ist das Mittelwellenprogramm des ORF, das
          t&auml;glich von 18.00 bis 00.08 Uhr mit einer Leistung
          von 60 kW auf der gleichnamigen Frequenz ausgestrahlt
          wird Statusanzeige des hierf&uuml;r im Jahre 2000
          installierten Halbleitersenders).</P>

          <P><B>Sendung aus J&uuml;lich auf 6055 kHz</B><BR>
           Seit dem 18.04.2004 l&auml;uft &uuml;ber die
          Kurzwellensender der T-Systems in J&uuml;lich ein
          polnisches Programm der Bible Christian Association, die
          bislang nicht mit eigenen Rundfunksendungen in
          Erscheinung trat. Gesendet wird sonntags von 17.30 bis
          18.00 Uhr auf 6055 kHz Diese Frequenz wurde &uuml;ber
          Jahrzehnte ganzt&auml;gig vom Prager Rundfunk eingesetzt.
          Seit 1993 teilen sich Radio Prag und Radio Slowakei
          International diesen Kanal, haben dessen Belegung
          inzwischen aber eingeschr&auml;nkt. Wie an dieser Stelle
          berichtet soll die Kurzwellenverbreitung der Programme
          aus Bratislava zum 01.05.2004 ganz enden. Entsprechende
          Angaben mehrerer Redaktionen von Radio Slowakei
          International, die zun&auml;chst verschiedenenorts
          angezweifelt wurden, sind inzwischen aus Bratislava
          best&auml;tigt worden.</P>

          <P><B>Kaufinteressent f&uuml;r WSHB</B><BR>
           Die am 29.02.2004 abgeschaltete Kurzwellenstation WSHB
          im US-Bundesstaat South Carolina k&ouml;nnte - dann
          wahrscheinlich unter einem anderen Rufzeichen -in
          n&auml;chster Zeit wieder in Betrieb gehen. Mit einem
          bisher nicht namentlich bekannten Interessenten soll ein
          "Letter of intent" &uuml;ber einen Kauf der Anlagen
          unterzeichnet worden sein.</P>

          <P>Das bisherige WSHB verf&uuml;gt &uuml;ber zwei jeweils
          500 kW starke Sender und war 1989 vom Christian Science
          Herold errichtet worden. Christian Science hat sich mit
          der Aufgabe von WSHB aus dem Betrieb eigener Sender
          zur&uuml;ckgezogen.</P>

          <P><B>Neue Frequenz f&uuml;r Sky Radio Hessen</B><BR>
           Sky Radio Hessen, das Ende 2001 seinen Betrieb aufnahm
          und mittlerweile &uuml;ber 17 UKW-Kleinsender
          ausgestrahlt wird, k&uuml;ndigt die Inbetriebnahme einer
          weiteren Frequenz an. Noch im April soll ein Sender in
          Gie&szlig;en auf 92,6 MHz in den Dienst gestellt
          werden.</P>

          <P>Sky Radio Hessen wird von der gleichnamigen
          Mediengruppe betrieben, die neben umfangreichen
          Fernsehaktivit&auml;ten auch Rundfunkstationen in den
          Niederlanden und in D&auml;nemark unterh&auml;lt. Das
          d&auml;nische Sky Radio besteht erst seit dem vergangenen
          Jahr und ist die erste kommerzielle Station, die in
          D&auml;nemark landesweit verbreitet wird.</P>

          <P><B>Englische Sendungen aus der Schweiz
          eingestellt</B><BR>
           Schweizer Radio International (SRI) hat, wie an dieser
          Stelle berichtet, seine englischen Programme eingestellt.
          Am 12.04.2004, dem offiziellen letzten Sendetag, wurde
          nur noch Musik mit eingestreuten Ansagen ausgestrahlt.
          Die letzte redaktionelle Sendung lief &uuml;ber mehrere
          Tage -sp&auml;testens ab dem 09.04.2004 - in
          st&auml;ndigen Wiederholungen bis einschlie&szlig;lich
          11.04.2004.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a09"></A> 

          <H3>Was h&ouml;rst du, Alter?</H3>

          <P>29. Dezember 2003 Sie waren viele Jahre der
          attraktivste Ausweis f&uuml;r die Zukunft des
          &ouml;ffentlich-rechtlichen Radios: die Jugendprogramme
          der ARD. Sie sollten eine neue, unverbrauchte
          Identit&auml;t f&uuml;r den H&ouml;rfunk stiften, traten
          frech mit schr&auml;gen Etiketten auf: "Fritz" in Berlin
          und Brandenburg, "Sputnik" vom Mitteldeutschen Rundfunk,
          "N-Joy" vom NDR, "Eins live" beim WDR, "Das Ding" im
          S&uuml;dwesten oder "HR XXL", in Supergr&ouml;&szlig;e
          ausgewiesen beim "kleinen" Frankfurter Sender. Ihr
          Gesch&auml;ft geht auch heute gut; das jedenfalls teilte
          zuletzt die halbj&auml;hrlich publizierte Media-Analyse
          (MA) mit, die verl&auml;&szlig;lichste W&auml;hrung
          f&uuml;r H&ouml;rerquoten. "Eins live" geh&ouml;rt danach
          zu den zehn meistgeh&ouml;rten Programmen in Deutschland.
          Freilich: Es gibt erste heftige Krisensymptome. So verlor
          ausweislich der Media-Analyse das Jugendradio "Fritz",
          seit M&auml;rz 1993 auf Sendung, 70 000 H&ouml;rer und
          ist nun bei - auch noch beachtlichen - 100 000
          H&ouml;rern gelandet. Und dem Hessischen Rundfunk war die
          mangelnde H&ouml;rerresonanz seines "XXL"-Radios Grund
          genug, umzuschalten.</P>

          <P>Das Web ist die vierte Gewalt Im Januar startet im
          neuen Musikgewand mit neuem Namen "You FM". Man will, so
          die offizielle Lesart, das Image der Technowelle
          "absch&uuml;tteln", sowohl Hitparaden als auch weniger
          Bekanntes spielen. Aus dem Sender werden
          Bef&uuml;rchtungen kolportiert, das Jugendprogramm gerate
          damit zu sehr in die N&auml;he des Mainstream-Popsenders
          HR 3, sprich wohl auch: Es werde zu erwachsen. Beim
          Jugendradio geht es aber nicht nur um Binnenkonkurrenz
          oder notwendige Reformen. Die Jugendlichen von heute
          vierzehn bis neunzehn Jahren sind die erste echte
          Multimedia-Generation, die erst an den Computer und dann
          an andere "Medien" denkt. Einer aktuellen
          F&uuml;nf-Jahres-Bilanz der Studie "Jugend, Information,
          (Multi-)Media" zum Medienverhalten Jugendlicher in
          Deutschland, an der auch der S&uuml;dwestrundfunk
          beteiligt ist, ist zu entnehmen, da&szlig; sich die
          Rangfolge verkehrt hat. Der Computer hat schon 2002 dem
          Radio den Rang abgelaufen, rangiert in der Nutzung hinter
          dem Fernsehen auf Platz zwei. Die ARD/ZDF-Online-Studie
          2003 registriert nicht nur den allgemein bekannten
          unerwartet hohen Zuwachs an Internetverbreitung in
          Deutschland, sondern kommt auch zu tieferen Befunden.
          F&uuml;r die aktuellen Informationen steht das Internet,
          weil seine Verf&uuml;gbarkeit und Aktualit&auml;t "nach
          Meinung vieler Nutzer durch kein anderes Medium erreicht
          wird". Das Internet, so schlie&szlig;t die Studie, "hat
          seine Funktion als viertes tagesaktuelles Medium
          gefunden".</P>

          <P>Blaupause der multimedialen Zukunft Werden da nicht
          Konturen einer Blaupause der multimedialen Zukunft
          sichtbar? In welcher das Radio seine Mitte verliert und
          gerade die Jugendradios als fr&uuml;here Avantgarde des
          H&ouml;rfunks im neuen Grundrauschen von PC,
          Speichermedien und Internet an Stimme verlieren? Die von
          der eigenen Zukunft und Unabh&auml;ngigkeit Abschied
          nehmen und sich dem Mainstream der jungen
          Erwachsenenprogramme anpassen m&uuml;ssen? Die
          Entwicklung zu eigenst&auml;ndigen Jugendradios war zu
          Beginn auch als langer Marsch durch die Institution Radio
          zu verstehen, begonnen mit Jugendsendungen wie
          "Z&uuml;ndfunk". Rundfunk sollte urspr&uuml;nglich zur
          Integration der demokratischen Gesellschaft beitragen.
          Dem dienten vor allem Vollprogramme, bevor in Klassikund
          Kulturwellen der Kulturauftrag des Rundfunks, mit
          Service- und Verkehrswellen der Nutzwert des Radios
          ausgewiesen wurde. Da war es mit dem Urerlebnis Radio
          nach Programmschema und -ansage langsam vorbei, wirkte
          H&ouml;rfunk immer mehr nebenbei, fungierte als
          Tagesbegleiter. Zutreffend wurde er sp&auml;ter als "Teil
          der psychischen Grundversorgung" (Will Teichert)
          eingeordnet, lie&szlig;en sich nach Lebensstilen auch
          H&ouml;rertypologien einordnen, konnte flapsig gefolgert
          werden: Sage mir, welches Radio du h&ouml;rst, und ich
          sage, wer du bist.</P>

          <P>Unkonventionelles Gebaren Die Jugendradios hielten
          sich daran konsequent, bildeten Lebensstile ab, stellten
          sich auf Milieus ein, dr&auml;ngten sich nicht wie vor
          allem Kulturredakteure den H&ouml;rern auf. Service war
          Pflicht, das Zielpublikum zu exklusiven Teilnehmern von
          Ereignissen zu machen st&auml;ndige K&uuml;r, sich in
          Ansprache und Pr&auml;sentation mit dem "Wellenklima"
          zwanglos an die Jugendlichen zu richten ein Mu&szlig;.
          Zunehmend wurden die H&ouml;rer auch da abgeholt, wohin
          sie zunehmend gerieten: an ihren Computern, vornehmlich
          an der Schleuse Internet. Die Gesellschafts-, viel
          sp&auml;ter die Medientheorie, noch sp&auml;ter die
          Programmplaner haben den Wandel zu unabh&auml;ngigen
          Teilkulturen entdeckt: Schelskys "skeptische Generation",
          Sinus-Studien, erste Shell-Jugend-Studien waren
          l&auml;ngst durch, da wurde noch um Jugendinseln in
          Vollprogrammen polemisiert, war Aufm&uuml;pfigkeit
          Trumpf. In den eigenst&auml;ndigen Jugendwellen blieb vom
          Protest das unkonventionelle Gebaren, kam es eben auf
          Autonomie, die eigene Kultur an, wobei durchaus
          herk&ouml;mmliche Radiobed&uuml;rfnisse weiter ihre Rolle
          spielten: Information und Orientierungshilfe,
          Entspannung, Gespr&auml;che. Schlie&szlig;lich sollten
          die Jugendradios als Teil eines
          Rundfunk-Generationenpakts die Senderfamilie des Radios
          vor weiterem Altern bewahren helfen.</P>

          <P>Kommunikations- und Aktionsradio Zwar laufen die
          Jugendradios der ARD unter dem einen Label, aber es wird
          dabei doch h&ouml;chst Unterschiedliches &uuml;ber einen
          Leisten geschlagen, mal die Welt der Tagesbegleitung
          verj&uuml;ngt, mal fundamental dagegen programmiert. Das
          Radio "Fritz" gab eine Art Prototyp ab, gespeist aus dem
          kleinen Versuch "Radio for You" des fr&uuml;heren SFB und
          "RockRadioB" aus der aufkommenden Jugend-Radiokultur der
          sp&auml;ten DDR. Im Selbstverst&auml;ndnis ein
          Kommunikationsund Aktionsradio, errang das Programm aus
          dem Stand Ausnahmestatus, ebenso wie "Sputnik" des MDR,
          entstanden nach einer Selbstanzeige "aus einer
          Rumpfredaktion von DT 64, dem Kultsender einer
          wendegebeutelten ostdeutschen Jugend". "Sputnik" versteht
          sich nicht als reiner Radiosender, sondern als
          Cross-Media-Produkt und pflegt das Internet. Das
          "N-Joy"-Radio des NDR hingegen sucht die unter
          Neunzehnj&auml;hrigen mit der richtigen Musikmischung,
          Multimedia und Themen des Tages zu binden. Multimedial
          verschwistert ist besonders "Das Ding" vom SWR, gestartet
          1997 als Pilotprojekt digital &uuml;ber Antenne und
          Satellit. Musikalisch am ehesten im Mainstream schwimmt
          "Eins live", bietet einpr&auml;gsame Sendemarken auf wie
          "Heimatkult", eine Plattform f&uuml;r Bands und
          K&uuml;nstler aus der Region, oder "Domian", die
          Talksendung, die auch im WDR-Fernsehen l&auml;uft.</P>

          <P>"K&uuml;nstlicher Jugendwahn" Es sind jetzt rund zehn
          Jahre, da&szlig; die Jugendwellen funken, und das ist
          fast schon eine zu lange Lebenszeit f&uuml;r das Radio
          einer Altersgruppe, die zwischen zw&ouml;lf und zwanzig
          Jahren nur m&uuml;hsam eine gemeinsame Ansprache
          vertr&auml;gt. Das betrifft auch die Macher. "Fritz"
          mu&szlig; sich schon f&uuml;r die dritte
          H&ouml;rergeneration r&uuml;sten, Die Gr&uuml;nder sind
          l&auml;ngst ins "erwachsene" Radio gewechselt.
          Nat&uuml;rlich spekulieren die Anstalten darauf, sich das
          Innovationspotential der Jugendwellen f&uuml;r die
          anderen Radios zunutze zu machen. "Die jungen
          Spartenprogramme von heute sind die Mainstream-Sender von
          morgen", hat der Chef des privaten Technosenders
          "Sunshine Live" festgestellt. Und zum
          Alterungsproze&szlig; der Jugendprogramme gibt es
          l&auml;ngst heftige Polemik. Von einem "k&uuml;nstlichen
          Jugendwahn" ist die Rede. Ein nordischer
          M&ouml;belproduzent macht es vor: Die legend&auml;ren
          jungen Grundmodelle werden gerade noch im Angebot
          gehalten, derweil entwickelt man gestandenere,
          komfortable Einrichtungen. Weil die Moden immer schneller
          wechseln, das Verhalten der Konsumenten damit auch,
          werden der jugendlichere Anschein, die andere Ansprache
          auch von &Auml;lteren schneller angenommen. So r&uuml;ckt
          die Nutzung der j&uuml;ngeren Tagesbegleitprogramme
          zusammen. Die Media-Analyse weist es aus: Zugenommen hat
          bei den Jugendwellen die Zahl der
          drei&szlig;igj&auml;hrigen H&ouml;rer. Verringert hat
          sich der Anteil der jugendlichen Zielgruppe. Dabei geht
          auf das Konto der demographischen Entwicklung, da&szlig;
          es in Deutschland immer weniger Jugendliche gibt, der
          eigentliche Einbruch steht erst noch bevor.</P>

          <P>Ikea macht es vor Am Ende fehlt es dem Radio
          &uuml;berhaupt an neuem, jugendlichem Potential. Es gibt
          keine tragf&auml;hige Br&uuml;cke zur Kindheit - kein
          einziges Kinderradio -, h&ouml;chstens Kinderfunk als
          Eiland auf vereinzelten Sendepl&auml;tzen. Aus der Studie
          "Kinder und Medien 2002", die den Medienumgang der Sechs-
          bis Dreizehnj&auml;hrigen untersucht hat und die aus
          derselben Feder wie die Medien-Jugendstudie stammt, wird
          deutlich, da&szlig; sich in die Kinderzimmer weiterhin
          ein Medienkonsum einschleicht, der nicht mehr
          dr&ouml;hnt, sondern klickt. Walk- beziehungsweise
          Discman und MP3-Player spielen eine bevorzugte Rolle.
          F&uuml;nfundvierzig Prozent der befragten Kinder hatten
          zu Hause Zugang zum Internet. Zu Hause dagegen zum
          Radioh&ouml;ren "erzogen" zu werden, da gibt es eine
          Fehlanzeige. Und allen Forderungen von Verb&auml;nden und
          Interessengruppen nach einem eigenst&auml;ndigen
          Kinderradio zum Trotz gilt auch hier, da&szlig; die
          Altersgruppe der Sechs- bis Dreizehnj&auml;hrigen kaum
          eine gemeinsame Ansprache vertr&auml;gt. Die
          Anspr&uuml;che an Musik und Pr&auml;sentation lassen sich
          nicht auf einen gemeinsamen Radionenner bringen, sprechen
          f&uuml;r eine Programmvielfalt, die am ehesten mit
          Speichermedien zu befriedigen ist. So klang der Plan
          eines Berliner Kinderradios, vertrieben &uuml;ber
          Internet und DAB, eher nach gutgemeinter Nischenkultur,
          der Titel eines freundlichen Zeitungsberichts &uuml;ber
          das Vorhaben unfreiwillig entlarvend: "Da gibt's was auf
          die Ohren". Revolutionen bereiten sich schleichend vor.
          Gerade in den Umbr&uuml;chen der elektronischen Medien
          gilt diese Binsenweisheit, und die aktuellen Befunde
          &uuml;ber den Medienkonsum der nachwachsenden Generation
          verleiten leicht zur Dramatisierung. Aber bei aller
          anhaltenden Wertsch&auml;tzung auch Jugendlicher f&uuml;r
          das Radio, seiner Kompetenz f&uuml;r Musik und
          Information mehren sich die Indizien f&uuml;r eine
          Schw&auml;chung des Konstrukts &ouml;ffentlicher
          Vermittlung in Gestalt des Radios.</P>

          <P>Hinwendung zu neuem Arbeitsplatz PC Die
          Verh&auml;ltnisse werden sich auch deswegen verschieben,
          weil - auch dies ein schleichender Proze&szlig; - nicht
          der Ersatz des Radios durch den Computer zu bedenken ist,
          sondern die Hinwendung zu einem neuen Arbeitsplatz PC,
          der Verf&uuml;gbarkeit, schrittweises Lernen im Sinne der
          Informationsverarbeitung und angespannte Aktualit&auml;t
          verspricht. So folgert die eingangs genannte Jugendstudie
          nicht &uuml;berraschend: "Die emotionale Bindung an PC
          und Internet nimmt zu." Da wird auf Dauer manches an
          Radio auf der Strecke bleiben. Und es tr&ouml;stet wenig,
          pr&auml;zisiert nur die allgemeine demographische
          Entwicklung, wenn die Studie konstatiert: "Die Bedeutung
          des Radios w&auml;chst mit steigendem Alter." Vermutlich
          wird sich die Radiogeschichte nicht mehr einfach
          fortschreiben lassen. Die Kinder werden nicht kommen. Es
          hilft allenfalls eine strategische Neuorientierung, die
          am Gedanken &ouml;ffentlicher Vermittlung festh&auml;lt
          und deren Reservate neu bestimmt. Ans&auml;tze dazu
          liefert auch die Erkenntnis, da&szlig; die individuelle
          Verf&uuml;gbarkeit von Information durch den Computer
          nicht gerade den sozialen Zusammenhalt f&ouml;rdert. Den
          m&uuml;&szlig;te der &ouml;ffentlich-rechtliche Rundfunk
          sch&auml;rfer und f&uuml;r sich inhaltlich neu
          definieren. Damit das Radio - das Jugendradio vorneweg -
          nicht weiter vom Sog privat verf&uuml;gbarer Bits and
          Bytes erfa&szlig;t wird.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a10"></A> 

          <H3>Die Geschichte von Radio4u</H3>

          <P>Radio 4U ging am 30.April 1990 auf der Berliner
          Frequenz 98,2 MHz von SFB 4 auf Sendung. Es war die
          Erweiterung der abendlichen Musikstrecke, des SFBeat bei
          SFB 2 zu einem ganz eigenen Programm. Hier waren also von
          nun an die Pop-Musik-Journalisten des SFB zu finden, und
          das jeden Tag 19 Stunden lang. Sp&auml;ter wurde das
          Programm auf 24 Stunden ausgeweitet. Tags&uuml;ber gab es
          also eine Popmusikwelle f&uuml;r die jungen Berliner,
          aber eben keinen Dudelfunk, Kaminsky 4 w&auml;re
          wahrscheinlich noch am ehesten mit dem Rias-Treffpunkt
          vergleichbar, und 4 Frontal bot die Nachrichten des Tages
          in voller Breitseite und nat&uuml;rlich immer Musik.
          Abends dann konnte man diverse Special-Sendungen zu
          verschiedensten Stilrichtungen der Popmusik h&ouml;ren.
          Kein anderer Sender hat damals ein solch breit
          gef&auml;chertes Angebot unterbreitet Der Name Radio 4U
          h&auml;tte nicht besser gew&auml;hlt sein k&ouml;nnen!
          ORB und SFB planten eine gemeinsame Jugendwelle. Dazu
          sollten Radio 4U und die ORB-Jugendwelle Rockradio B
          vereint werden. Im Sommer 1992 gab es dann auch eine
          gemeinsame Sendung der beiden, in welcher u.a. mit
          Anrufern &uuml;ber das zuk&uuml;nftige gemeinsame
          Jugendprogramm diskutiert wurde. Es war eigentlich klar,
          dass dieses neue Programm dann aus Potsdam gesendet
          werden sollte. Doch irgendwann meinte der ORB ein eigenes
          Programm ohne den SFB auf die Beine stellen zu
          m&uuml;ssen und Intendant Rosenbauer verk&uuml;ndete:
          "Der SFB wird Radio 4U einstellen." Nat&uuml;rlich waren
          die 4U-Kollegen dar&uuml;ber nicht gerade gl&uuml;cklich
          und die H&ouml;rer auch besorgt bis ver&auml;rgert, denn
          wieso erlaubte es sich der Intendant einer anderen
          Anstalt, das Ende von 4U zu verk&uuml;nden? Im Herbst
          1992 beschloss der SFB, Radio 4U nur noch bis zum 31.12,
          zu betreiben. Bekannt gegeben wurde dies auf einer
          Mitarbeiterversammlung des SFB, auf der die 4U-Leute auch
          zun&auml;chst protestierten und dann den Intendanten
          G&uuml;nter von Lojewski und den H&ouml;rfunkdirektor
          Wolfgang Seifert ins 4U-Studio einluden. Hier gab es dann
          ein Streitgespr&auml;ch on Air zwischen den beiden und
          den Moderatoren Matthias Hanselmann und Volker Wieprecht.
          Von Lojewski nannte als Grund f&uuml;r die
          Sparma&szlig;nahmen, die bevorstehende Schaffung eines
          Berlin-Fernsehens, und zwar bevor ein privater Anbieter
          damit auf den Markt kam. Nach Bekanntwerden der Absicht,
          den Sender einzustellen, gab es eine Welle von Protesten.
          Diese &auml;u&szlig;erten sich nicht nur in schriftlicher
          Form, sondern auch akkustisch, als Songs. Die Songs kamen
          sowohl von den Radio 4U - Machern (4U-Rap) als auch von
          den H&ouml;rern. Dies alles hatte nichts gebracht, Radio
          4U wurde eingestellt und auf der Frequenz zun&auml;chst
          Rockradio B vom ORB verbreitet. Heute ist auf der 98zwo
          Radio Paradiso zu h&ouml;ren. Viele Mitarbeiter von Radio
          4U waren dann bei RockradioB wieder zu finden, und ab
          1.M&auml;rz 1993 bei Fritz zu h&ouml;ren.</P>

          <H3>DIGITAL RADIO auf dem Radio Day</H3>

          <P>Auf dem diesj&auml;hrigen Radio Day am 22. April in
          der K&ouml;lner Messe Halle 5 k&ouml;nnen sich
          Werbetreibende sowie interessierte Journalisten umfassend
          &uuml;ber die f&uuml;r NRW geplante erweiterte digitale
          Ballungsraumversorgung und deren Bewerber auf freie
          Kapazit&auml;ten informieren. Gerne werden auch nach
          Absprache Hintergrundgespr&auml;che mit den neuen
          Programmanbietern auf der gr&ouml;&szlig;ten Radiomesse
          Deutschlands vermittelt. Zur &Uuml;berpr&uuml;fung der
          digitalen Klangqualit&auml;t und der bereits angebotenen
          Zusatzfunktionen stehen sowohl am Messestand als auch in
          dem vor der Messehalle platzierten Multimedia-Transit
          verschiedene Empf&auml;nger zur Verf&uuml;gung.
          P&uuml;nktlich zum Radio Day liegt auch das druckfrische
          Digital Radio-Magazin reinH&Ouml;REN noch vor dem
          offiziellen Verkaufsstart (30.4.2004) am Stand aus. Die
          neue Ausgabe bietet den vollen &Uuml;berblick &uuml;ber
          alle Digital Radio-Programme in Deutschland, ausgesuchte
          neue Empf&auml;nger sowie technische Informationen in
          leicht verdaulicher Form. Das Messeteam der Digital Radio
          West GmbH freut sich auf Ihr Kommen und w&uuml;nscht
          allen Messeteilnehmern eine erfolgreiche Messe.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a11"></A> 

          <H3>rockfun24: neue Page, neues Programm</H3>

          <P>An diesem Wochenende hat der Osterhase m&auml;chtig zu
          schleppen: Ein besonders dickes Ei werden die Macher des
          hessischen Internetradios rockfun24 ihren H&ouml;rern ins
          Nest legen. Am Ostermontag (12.04.2004) startet der
          Sender mit einem komplet-ten Relaunch von Homepage und
          Programm in den Fr&uuml;hling. "rockfun24 kommt in einem
          v&ouml;llig neu gestalteten Layout" - verspricht Florian
          C&ouml;ster, Vorsitzender des Tr&auml;gervereins
          rockfun24 e.V. Nichts bleibt wie es ist - die Page
          pr&auml;sentiert sich ab Montag in einer oliven
          Trend-Farbe: "Wir haben genau untersucht, welche Farben
          und Features bei unseren H&ouml;rern angesagt sind." - so
          C&ouml;ster weiter. Die Page wird noch interaktiver: Auf
          einem "Shoutboard" k&ouml;nnen die User miteinan-der
          chatten, der "Foren-Spanner" erm&ouml;glicht einen Blick
          in das rockfun24-Forum - dort k&ouml;nnen die User
          &uuml;ber Programm und Musikauswahl diskutieren. Neu auf
          der Startseite von rockfun24: Der Top7-Vote - hier
          bestimmen die H&ouml;rer von rockfun24 Hessens einzige
          Newcomer-Charts. "Lauter Rock f&uuml;r Hessen" - so das
          Motto des Internetradios rockfun24. "Main-Stream hat bei
          uns nichts zu suchen" freut sich Heiko Franz, Leiter der
          Musikredakti-on. Rock, Metal, Punk, Ska - ein Sound, der
          einfach Spa&szlig; macht - das ist das Mu-sikprogramm von
          rockfun24. Auch am Programm haben die hessischen
          Radioma-cher gefeilt: Ab sofort gibt's t&auml;glich neue
          Sendungen auf die Ohren: Die "work-station" sorgt
          daf&uuml;r, dass Schreibtisch-Hocker und Sessel-Pupser an
          ihrem Arbeits-platz nicht einschlafen, mittags gibt's in
          "rockfun24-flash" News aus der Rockszene, Tipps und
          Termine oder den Movie der Woche und in "hessenrock" am
          Nachmittag erfahren die H&ouml;rer, warum zum Beispiel
          Hessen ohne Punk nicht leben kann. Der Mittwochabend
          steht ganz im Zeichen eines neuen Musikmagazins:
          rockfun24 pr&auml;-sentiert Mainstage, das independent
          music magazine ( http://www.mainstage.de/).</P>

          <P>Mit einem phatten Gewinnspiel auf der Page werden die
          H&ouml;rer von rockfun24 auch noch belohnt: Es gibt
          Tickets, CDs, T-Shirts und DVDs - fett absahnen ist
          angesagt. Wovon die meisten hoffentlich nichts merken:
          Das Internetradio nutzt ab Montag eine neue Software.
          Tage und Wochen haben ehrenamtliche Programmierer
          gebastelt, um das Programm und die neue Page
          p&uuml;nktlich zu Ostern an den Start zu bringen. Stephan
          Scheuermann: "Die neue Software erm&ouml;glicht uns
          schneller und aktueller im Programm von rockfun24 zu
          sein." rockfun24 sendet im Internet als Live-Stream,
          Wortbeitr&auml;ge sind per Klick sofort ab-rufbar. Zu
          besonderen Anl&auml;ssen ist rockfun24 lokal auf UKW
          empfangbar. Infos &uuml;ber das Internetradio finden Sie
          unter<BR>
          http://www.rockfun24.de/</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a12"></A> 

          <H3>Lizenz f&uuml;r erstes deutsches Wissens-Radio</H3>

          <P>Deutschlands erster Radiosender, der sich
          haupts&auml;chlich mit dem Thema "Wissen"
          besch&auml;ftigt, geht im Herbst im Gro&szlig;raum
          Stuttgart auf Sendung. Am 05.04.2004 beschlo&szlig; der
          Medienrat der Landesanstalt f&uuml;r Kommunikation (LFK)
          Baden-W&uuml;rttemberg, die Sendelizenz f&uuml;r die
          UKWFrequenz 88,6 an Radio WILANTIS zu vergeben, und
          folgte damit der Empfehlung des LFKVorstands. Das erste
          deutsche Wissens-Radio ist ein Privatsender und wird sich
          mit etwa 80 Prozent Wortanteil den Themen Wissenschaft,
          Forschung, Technik und Innovation widmen. Gesellschafter
          und Sponsoren aus Wirtschaft und Industrie tragen den
          Sender und streben eine bundesweite Verbreitung &uuml;ber
          analoge und digitale Kan&auml;le an.
          Gesch&auml;ftsf&uuml;hrer Wolfgang Vo&szlig;eler (51):
          "Wir reden nicht nur &uuml;ber moderne Technik, wir
          nutzen sie auch! F&uuml;r uns gilt der Satz: Wir zeigen
          immer das Bild dazu. Dazu wollen wir Internet, Handy und
          UMTS f&uuml;r die Verbreitung und auch f&uuml;r die
          Redaktionsarbeit nutzen. Die Region Stuttgart ist das
          pr&auml;gende Zentrum f&uuml;r Hightech, Qualit&auml;t
          und Innovation in Europa und lebt vom Wissen der
          Menschen. Was liegt also n&auml;her, als hier den
          Radiosender zu starten." WILANTIS will Wissen in
          verst&auml;ndlicher Form vermitteln. Vo&szlig;eler: "Wir
          leben mit Hightech in einer Zeit permanenter
          Ver&auml;nderung. Was heute noch im Labor steht, kann
          schon morgen Einflu&szlig; auf unseren Alltag haben.
          Technik ist faszinierend, wenn man sie versteht. Wir
          wollen uns wieder Zeit nehmen, zu erkl&auml;ren, warum
          die Welt so ist, wie sie ist, und wie sie morgen schon
          sein k&ouml;nnte." Am Abend werden im WILANTIS-Programm
          vier Stunden lang Ausz&uuml;ge aus H&ouml;rb&uuml;chern
          aller Art gesendet, f&uuml;r die eine komplett neue
          Online-Plattform geschaffen wird. &Uuml;ber diese
          Plattform werden auch alle ausgestrahlten Beitr&auml;ge
          im Internet abrufbar sein. Gesucht werden jetzt noch
          Mitarbeiter f&uuml;r die Bereiche Marketing, Vertrieb und
          Redaktion.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

