<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
    <META name="GENERATOR" content="HANDMADE">
    <META name="AUTHOR" content=
    "Dieter Beck &lt;Ray_Viper2000@Yahoo.de&gt;">
    <!-- Author =  Dieter Beck -->

    <TITLE>3 Lektionen</TITLE>
  </HEAD>

  <BODY background="images/bgc.gif" text="#000000" bgcolor=
  "#B0B0B0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "3 Lektionen">
      <TR>
        <TD>
          <P align="CENTER"><FONT color="#000080" size="7"><B>3
          Lektionen</B></FONT></P>
          <BR>
           

          <DL>
            <DT><B>Lektion Nr. 1</B></DT>

            <DD>Ein Mann betritt die Dusche gerade in dem
            Augenblick als seine Frau aus der Dusche steigt. Da
            l&auml;utet es an der Haust&uuml;r. Nach einer kurzen
            Diskussion, wer denn nun zur T&uuml;r geht, gibt die
            Frau nach, h&uuml;llt sich in ein Handtuch, l&auml;uft
            die Stiege hinunter und &ouml;ffnet die
            Haust&uuml;r.</DD>

            <DD>&nbsp;</DD>

            <DD>Es ist Bob, der Nachbar von nebenan. Bevor sie noch
            etwas sagen kann, legt er los: "Ich gebe dir sofort EUR
            800,- wenn du dein Handtuch fallen l&auml;&szlig;t".
            Ein bi&szlig;chen verwundert wartet sie ein paar
            Sekunden, knotet dann das Handtuch auf und steht nackt
            vor Bob. Er sieht sie an und gibt ihr dann EUR 800,- in
            100er-Scheinen. Ein bi&szlig;chen verdutzt von diesem
            Vorfall, aber froh &uuml;ber das kleine Verm&ouml;gen
            das sie in kaum 10 Sekunden gemacht hat, geht sie
            wieder hinauf ins Badezimmer. Ihr Mann, noch unter der
            Dusche, fragt sie: "Wer war es denn?" - "Bob, der
            Nachbar von nebenan" antwortet sie. Ihr Mann: "Super,
            hat er dir die EUR 800,- gegeben, die er mir
            schuldet?"</DD>

            <DD>&nbsp;</DD>

            <DT>Moral der Lektion Nr. 1</DT>

            <DD>Tauschen sie rasch Informationen gemeinsamer
            Arbeiten aus, wenn sie im Team arbeiten, so vermeiden
            sie schlechtes Auftreten nach au&szlig;en hin und
            Mi&szlig;verst&auml;ndnisse.</DD>

            <DD>&nbsp;</DD>
          </DL>

          <DL>
            <DT><B>Lektion Nr. 2</B></DT>

            <DD>Am Lenkrad seines Autos auf dem Weg zum Kloster
            begegnet ein Priester einer Nonne, die zu Fu&szlig;
            unterwegs ist. Er bleibt stehen und fragt sie, ob sie
            bis zum Kloster mitfahren m&ouml;chte. Sie akzeptiert,
            steigt ins Auto und als sie die Beine &uuml;berkreuzt
            kommen ihre sch&ouml;nen Beine zum Vorschein. Der
            Priester kann nicht anders als ihre Beine anzusehen und
            verliert f&uuml;r einen kurzen Moment die Kontrolle
            &uuml;ber sein Auto. Nachdem er das Auto wieder unter
            Kontrolle hat, legt er pl&ouml;tzlich die rechte Hand
            auf den Schenkel der Nonne. Sie sieht ihn an und sagt:
            "Vater, erinnern sie sich an Psalm 129?". Besch&auml;mt
            zieht er schnell seine Hand zur&uuml;ck und
            &uuml;berschl&auml;gt sich mit Entschuldigungen. Ein
            bi&szlig;chen sp&auml;ter, die Versuchung ist zu
            gro&szlig;, profitiert er von einer</DD>

            <DD>&nbsp;</DD>

            <DD>Gangschaltung und ber&uuml;hrt erneut den Schenkel
            der Nonne, worauf diese wieder dieselbe Frage stellt:
            "Vater, erinnern sie sich an Psalm 129?". Wieder wird
            er rot und zieht stotternd seine Hand zur&uuml;ck: "Tut
            mir Leid Schwester, aber das Fleisch ist schwach". Im
            Kloster angekommen steigt die Nonne wortlos aus dem
            Auto und wirft ihm einen eindeutigen Blick zu. Der
            Priester eilt sofort zur ersten Bibel die er finden
            kann und schl&auml;gt Psalm 129 auf: "Gehen sie nach
            vorw&auml;rts, suchen sie immer h&ouml;her, dort werden
            sie Herrlichkeit erlangen".</DD>

            <DD>&nbsp;</DD>

            <DT>Moral der Lektion Nr. 2</DT>

            <DD>Seien sie in der Arbeit immer gut informiert, sonst
            kann es sein, da&szlig; sch&ouml;ne Gelegenheiten an
            ihnen vor&uuml;bergehen.</DD>

            <DD>&nbsp;</DD>
          </DL>

          <DL>
            <DT><B>Lektion Nr. 3</B></DT>

            <DD>Ein Vertreter, eine B&uuml;roangestellte und ein
            Personalchef gehen mittags aus dem B&uuml;ro in
            Richtung eines kleinen Restaurants und finden auf einer
            Sitzbank eine alte &Ouml;llampe. Sie reiben an der
            &Ouml;llampe und wirklich entsteigt ihr ein Geist:
            "Normalerweise gew&auml;hre ich drei W&uuml;nsche, aber
            da ihr zu dritt seid, hat jeder einen Wunsch frei!" Die
            B&uuml;roangestellte dr&auml;ngt sich vor und
            gestikuliert wild: "Ich zuerst! Ich! Ich m&ouml;chte
            auf einem herrlich sch&ouml;nen Strand auf den Bahamas
            sein, der Urlaub soll nie enden, keine einzige Sorge
            soll mir mein sch&ouml;nes Leben vermasseln". Und -hop
            - verschwindet auch schon die B&uuml;roangestellte. Der
            Vertreter will nun an die Reihe kommen: "Ich Jetzt,
            ich! Ich will mit der Frau meiner Tr&auml;ume an einem
            Strand in Tahiti eine Pina Colada schl&uuml;rfen!" Und
            - hop -verschwindet der Vertreter. "Nun kommst du dran"
            sagt der Geist zum Personalchef. "Ich will, da&szlig;
            die beiden nach dem Mittagessen wieder im B&uuml;ro
            sind".</DD>

            <DD>&nbsp;</DD>

            <DT>Moral der Lektion Nr. 3</DT>

            <DD>Lassen sie jemanden, der ihnen h&ouml;hergestellt
            ist, immer zuerst sprechen!</DD>
          </DL>
          <BR>
           <BR>
           

          <P>Gefunde von: Dieter Beck<BR>
           &lt;Ray_Viper@gmx.de&gt;</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

