<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>April - April</TITLE>
  </HEAD>

  <BODY background="images/bgb.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>+++
          PRESSETICKER +++</B></FONT><BR>
           (kam f&uuml;r NC-121 leider 1 Tag zu sp&auml;t !!)</P>

          <H3>Bosch stellt Waschvollautomat mit eingebautem
          Fernseher und Internet vor</H3>

          <P>Der deutsche Hersteller Bosch meint im Gegensatz zu
          einem Mitbewerber besser zu wissen, was Frauen
          w&uuml;nschen. Mit dem neuen "Mediaclean 1200" stellt
          BOSCH erstmals eine Waschvollautomat vor, der statt des
          tristen Glasfensters ein 15"-TFT-Touchscreendisplay
          eingebaut hat. &Uuml;ber dieses Display lassen sich
          Kabeloder Sat-TV empfangen und durch eine integrierte
          Surfbox sogar im Internet surfen und EMails bearbeiten.
          So soll die Hausarbeit k&uuml;nftig zum Vergn&uuml;gen
          werden. Eduard Horsch, Pressesprecher der Firma Bosch
          erkl&auml;rte "Uns wurde der Wunsch nach so einem
          Ger&auml;t so oft heran getragen, dass wir dieses
          Ger&auml;t ganz einfach herstellen mussten". Mit einem
          Kampfpreis von nur 998,- Euro soll sich die neue
          Waschmaschine an die Verkaufspitze innerhalb
          k&uuml;rzester Zeit bef&ouml;rdern.</P>
          <HR>

          <H3>Der Vollmond regt zum streiten an</H3>

          <P>Was die Meisten l&auml;ngst wissen, wurde nun durch
          eine Langzeitstudie in Genf best&auml;tigt. Der Vollmond
          beeinflusst nicht nur die Meere und das Wachstum, sondern
          erh&ouml;ht Adrenalin und Blutdruck. Durch den
          erh&ouml;hten Zellinnendruck wird ein Gro&szlig;teil an
          Hirnzellen beeinflusst, so dass sich zivilisierte
          Menschen in ihrem geistigen Handeln drastisch zur&uuml;ck
          entwickeln k&ouml;nnen. Die Streitsucht steigt enorm und
          der kleinste Anlass gen&uuml;gt bereits f&uuml;r massive
          Wortgefechte bis hin zu Schl&auml;gereien. Als
          Gegenma&szlig;nahme wird empfohlen, das linke
          Ohrl&auml;ppchen sanft zwischen Zeigefinger und Daumen zu
          massieren. Das wirkt dem Zelldruck entgegen und entspannt
          K&ouml;rper und Geist deutlich.</P>
          <HR>

          <H3>Gesang einer Mutter beschleunigt Schwangerschaft</H3>

          <P>Nur nach acht Monaten erfolgt die v&ouml;llig
          unkomplizierte Geburt des kleinen Eric Huelstroem in
          Flatenberg / Schweden. Die &Auml;rzte stehen vor einem
          R&auml;tsel, denn normalerweise sind kleinere
          Komplikationen nach so kurzer Schwangerschaft zu
          erwarten, oder der S&auml;ugling ist zumindest deutlich
          kleiner und leichter. Doch der kleine Eric strotzt vor
          Gesundheit und statt zu schreien meinen Zuh&ouml;rer
          tats&auml;chlich eine Melodie heraus zu h&ouml;ren. "Das
          wundert mich nicht", erkl&auml;rte die frisch gebackene
          Mutter "ich singe f&uuml;r mein Leben gern, zu jeder Zeit
          und an jedem Ort, viele Stunden jeden Tag". Fachmediziner
          haben in der Tat eine positive Auswirkung durch
          Schallwellen im Mutterleib nachweisen k&ouml;nnen und
          sind sich sicher, dass es dem kleinen Eric in der Tat
          durch den t&auml;glichen Gesang der Mutter so gut geht
          und er regelrecht melodisch schreit. Es soll nun
          erforscht werden, welcher Musikstil die Geburt in welcher
          Form beeinflusst.</P>
          <HR>

          <H3>Erster Beweis f&uuml;r Reinkarnation</H3>

          <P>Durch einen kompletten Ged&auml;chtnisverlust konnte
          sich die Holl&auml;nderin Meidje Fien pl&ouml;tzlich an
          ein fr&uuml;heres Leben so detailliert erinnern, dass man
          ihre Angaben exakt &uuml;berpr&uuml;fen konnte. "Ich war
          K&uuml;chendienerin eines Adelshauses der Familie Rue de
          Passinette in den Jahren zwischen 1604 und 1656 im
          franz&ouml;sischen Debutrage sur le vin in der N&auml;he
          der Champagne" berichtete die Holl&auml;nderin mit
          detailliertem Wissen &uuml;ber dieses Leben, ohne sich
          auch nur eine einzige Erinnerung an ihr aktuelles Leben.
          Alle Angaben konnten aufgrund von alten Tageb&uuml;chern,
          die sich immer noch im Besitz der Familie befanden
          nachgewiesen werden. Zuletzt arbeitete Meidje in einem
          Amsterdamer Mc Donalds und war sogar Mitarbeiterin des
          Monats kurz vor ihrem Ged&auml;chtnisverlust. Ihre
          "Nachkommen" sind mittlerweile reiche Gutsbesitzer und
          freuen sich eine l&auml;ngst verstorbene Urahnin
          wiedergefunden zu haben.</P>
          <HR>

          <H3>IRC-Chat an allen Esso-Tankstellen</H3>

          <P>Der Treibstoffgigant Esso hat sich etwas ganz
          Besonderes einfallen lassen. An allen Esso-Tankstellen,
          die mit Snack&amp;Shop ausgestattet sind, werden
          k&uuml;nftig IRC-Terminals stehen. Bei einer guten Tasse
          Kaffee k&ouml;nnen die Kunden nebenbei kostenlos im IRC
          chatten. Auch an blinde und sehbehinderte Nutzer wurde
          dabei gedacht. So k&ouml;nnen &uuml;ber Kopfh&ouml;rer
          und Sprachausgabe auch blinde Chats&uuml;chtige ihrem
          Hobby kostenlos in jeder Esso-Tankstelle nachgehen. Die
          IRC-Terminals sind rund um die Uhr online und zur freien
          und kostenlosen Nutzung frei gegeben.</P>
          <HR>

          <H3>Kartoffelp&uuml;ree macht gl&uuml;cklicher</H3>

          <P>Prof. Frank Fleuyed hat in einem mehrj&auml;hrigen
          Langzeittest festgestellt, dass der Verzehr von wenig
          gesalzenem Kartoffelp&uuml;ree sich ungew&ouml;hnlich
          positiv auf die psychische Verfassung der zivilisierten
          Menschen auswirkt. Nachdem Professor Fleuyed an sich
          selbst durch &uuml;berm&auml;&szlig;igen Verzehr von
          Kartoffelp&uuml;ree positive Stimmungsverbesserungen
          entdeckte, startete er umgehend im Jahre 1997 eine
          Langzeitstudie, um dieses Ph&auml;nomen n&auml;her zu
          analysieren und suchte sich hierzu zehn Studenten der
          Universit&auml;t Wien. Alle zehn Studenten a&szlig;en
          &uuml;ber einen Zeitraum von 6 Jahren mindestens drei mal
          in der Woche eine gro&szlig;e Portion
          Kartoffelp&uuml;ree. Es wurden Psychogramme erstellt und
          Protokolle &uuml;ber den kompletten Zeitraum erfasst.
          Bereits nach den ersten acht Monaten konnten deutlich
          erh&ouml;hte Werte von Gl&uuml;ckshormonen festgestellt
          werden. Am Ende der Langzeitstudie, f&uuml;hlten sich
          alle Testabsolventen deutlich gl&uuml;cklicher, als zum
          Testanfang. Bei Spezialisten sind die Testergebnisse noch
          umstritten, meinen aber einheitlich "schaden kann es ja
          sicherlich nicht"...</P>
          <HR>

          <H3>Erster Blindenf&uuml;hrkater nimmt seinen Dienst
          auf</H3>

          <P>In New Portland, England nahm vor rund zwei Wochen der
          weltweit erste Blindenf&uuml;hrkater "Ronny" seinen
          Dienst auf. Nach anf&auml;nglicher Skepsis kann Leonard
          Willmey als erster Blinder mit einer
          Blindenf&uuml;hrkatze nur Positives berichten. "Nach
          bisher drei Blindenf&uuml;hrhunden konnte ich mir absolut
          nicht vorstellen, wie das mit einem Kater funktionieren
          soll, aber es klappt und es klappt sogar ganz
          hervorragend" berichtete Leonard im englischen
          Fachmagazin "the clever cat". Der Kater erweist sich als
          deutlich intelligenter, als seine Hundekollegen, ist im
          Unterhalt gen&uuml;gsamer und sorgt in &ouml;ffentlichen
          Einrichtungen f&uuml;r weniger Streitigkeiten. Im
          Restaurant kommt Ronny zB. einfach in eine offene Tasche
          und st&ouml;rt dadurch auch keine tierunfreundlichen
          Kellner oder Restaurantbesitzer. Nach diesem
          gro&szlig;artigen Erfolg wird es zumindest in England
          bald h&auml;ufiger F&uuml;hrhundkatzen auf den
          Stra&szlig;en geben.</P>
          <HR>

          <H3>Malermeister 5000 tapeziert automatisch</H3>

          <P>Ein neuer Tapezierroboter wurde auf der Handwerk &amp;
          Garten 2004 in Gunnerstadt von der Firma Colourfix GmbH
          vorgestellt und sorgte f&uuml;r gro&szlig;es Aufsehen bei
          Handwerk und Hobbyisten. Der Roboter wird &uuml;ber eine
          Fernbedienung mit allen n&ouml;tigen Daten
          gef&uuml;ttert, wie Ma&szlig;e der einzelnen W&auml;nde
          eines Zimmers. Das Ger&auml;t berechnet daraufhin
          automatisch die Anzahl n&ouml;tiger Tapetenrollen und
          Literangabe f&uuml;r Tapetenkleister. Im internen
          Speicherbeh&auml;lter werden entsprechend viele Rollen
          Tapeten und Kleistermenge abgelegt, bzw. eingef&uuml;llt.
          Nun kann man getrost den Raum verlassen und auf der
          Fernbedienung auf den "Start"-Knopf dr&uuml;cken. Schon
          legt der Malermeister 5000 los und tapeziert
          vollautomatisch und nahtlos eine Tapete neben die Andere.
          Auch in Ecken wird sauber tapeziert. Ein Raum mit einer
          Bodenfl&auml;che von etwa 25 Quadratmetern, einer
          T&uuml;r und einem Fenster hat der Tapezierroboter in
          weniger als 25 Minuten fertig tapeziert. Es m&uuml;ssen
          lediglich noch T&uuml;r- und Fenster&ouml;ffnungen sauber
          ausgeschnitten werden und schon ist das komplette Zimmer
          in Meisterqualit&auml;t tapeziert. Mit einem Marktpreis
          von nur 399 Euro rechnet der Hersteller mit
          rei&szlig;endem Absatz, wovon auch die Fachpresse sich
          auf dem Messestand &uuml;berzeugt hat.</P>
          <HR>

          <H3>Radiofrequenzbereich wird erweitert</H3>

          <P>Der Frequenzbereich f&uuml;r UKW soll zum dritten
          Quartal diesen Jahres erweitert werden. K&uuml;nftig
          werden Radioprogramme bis zu Frequenzen von 216,5
          erreichbar sein. Die Erweiterung wurde dringend
          erforderlich, da sich immer h&auml;ufiger Radioprogramme
          &uuml;berschneiden und die Programmpl&auml;tze zu eng
          werden. Frequenzen &uuml;ber 180,0 bleiben privaten
          Radiosendern vorbehalten, damit auch Hobbyisten
          gen&uuml;gend Platz f&uuml;r ihre eigenen Sender bekommen
          und den kommerziellen Radiobetrieb dabei nicht
          l&auml;nger st&ouml;ren. Alte Rundfunkempf&auml;nger die
          ab 1998 hergestellt wurden, k&ouml;nnen in
          Fachelektronikm&auml;rkten und Meisterbetrieben
          umger&uuml;stet werden. Bei noch &auml;lteren Tunern und
          Radioempf&auml;ngern ist eine Umr&uuml;stung in den
          meisten F&auml;llen leider nicht mehr m&ouml;glich.</P>
          <HR>

          <H3>Poesie lindert Zahnschmerzen</H3>

          <P>Ein Bochumer Zahnarzt verw&ouml;hnt seine Patienten
          jetzt mit einer g&auml;nzlich neuen Schmerztherapie. Eine
          zus&auml;tzliche Arzthelferin liest w&auml;hrend der
          Zahnbehandlung vom Zahnmediziner selbstgeschriebene
          Gedichte vor und lenkt dabei die Patienten auf so
          angenehme Weise von den Schmerzen ab, dass Diese ihre
          Zahnbehandlung tats&auml;chlich nicht mehr wahrnehmen.
          Das Buch wird bereits verfielf&auml;ltig und soll in den
          n&auml;chsten Wochen &uuml;ber den Zubeh&ouml;rhandel der
          Zahntechnikerinnung erh&auml;ltlich sein. Zahlreiche
          Zahn&auml;rzte haben sich vor Ort bereits vom Erfolg
          &uuml;berzeugen k&ouml;nnen und werden die v&ouml;llig
          neue und bisher ungew&ouml;hnliche Behandlungsmethode
          f&uuml;r ihre Praxis &uuml;bernehmen.</P>
          <HR>

          <H3>Microsoft bringt eigene Linuxdistribution</H3>

          <P>Softwaregigant Microsoft bringt im dritten Quartal
          eine eigene Linux-Distribution auf den Markt. Mit
          "Microsoft Linux XP" will der bekannte
          Betriebssystemhersteller seine Stellung auf dem
          hei&szlig; umk&auml;mpften Markt festigen. So hat man
          f&uuml;r die eigene Distribution spezielle OS-Bridgeports
          entwickelt, die es erm&ouml;glichen, dass nicht nur
          Software f&uuml;r Linux auf dem neuartigen Betriebssystem
          l&auml;uft, sondern in einer "Fly2Win-Box" auch alle zu
          Windows XP kompatiblen Softwareprodukte laufen werden.
          Fachleute haben diese Entwicklung bereits seit einigen
          Monaten geahnt und bef&uuml;rchten eine Festigung der
          Monopolstellung bei Betriebssystemen f&uuml;r den
          Desktopmarkt.</P>
          <HR>

          <H3>Neuer CPU-Hersteller geht mit Kampfpreisen auf den
          Markt</H3>

          <P>Ein neuer Prozessorhersteller will k&uuml;nftig auf
          dem lukrativen Desktop-CPU-Markt kr&auml;ftig mitmischen.
          Die amerikanische Firma Zuse Ltd. Inc. geht im 3. Quartal
          diesen Jahres mit Prozessoren, die dann bereits &uuml;ber
          4 GHz Taktfrequenz erm&ouml;glichen sollen zu Preisen
          deutlich unterhalb der Konkurrenzmodelle von VIA, AMD und
          Intel an den hei&szlig; umk&auml;mpften
          Halbleitermarkt.</P>

          <P>Erste Hardwaretests bei f&uuml;hrenden
          Fachzeitschriften brachten nahezu ma&szlig;lose Euphorien
          hervor. Der "Z80" mit 4 GHz Taktfrequenz bei einem FSB
          mit 800 MHz bietet &uuml;ber 70 % mehr Leistung, als ein
          aktueller AMD 64Bit-Prozessor 3200+ und kostet dabei nur
          drei Viertel des AMD-Prozessors. "Die derzeitigen
          CPU-Hersteller werden sich warm anziehen m&uuml;ssen",
          erkl&auml;rte der Chefredakteur der Go64!</P>
          <HR>

          <H3>BLINDzeln soll die Charts st&uuml;rmen</H3>

          <P>Mit einer neuen Single will Schirmherr Herbert
          Gr&ouml;nemeyer auf BLINDzeln aufmerksam machen. Die in
          Absprache mit BLINDzeln aufgenommene Single "Mit anderen
          Augen sehen" kommt heute in den CD-Handel und klingt
          bereits stark chartverd&auml;chtig. "Wir danken Herbert
          f&uuml;r seine Hilfe und seinen Einsatz, um unser
          sch&ouml;nes BLINDzeln-Projekt bekannt zu machen",
          erkl&auml;rte Fatih B&uuml;y&uuml;knarci - einer der
          Gr&uuml;nder des Projektes gegen&uuml;ber der
          Musikzeitschrift "Pop".</P>
          <HR>

          <H3>Microsoft steigt in den lukrativen Hilfsmittelmarkt
          ein</H3>

          <P>Wie Microsoft in einer Pressemitteilung bekannt gab,
          werde man mit dem kommenden Betriebssystem Opened-Windows
          RC 2005 einen gro&szlig;en Schritt in den
          Hilfsmittelmarkt anstellen. Das neue kurz OW2005 getaufte
          Betriebssystem arbeitet komplett &uuml;ber Sprachein- und
          ausgabe. Eine Unterst&uuml;tzung neuer
          Braille-15"-Displays, die von Microsoft Hardwares C.ltd.
          ebenfalls im kommenden Jahr vorgestellt werden,
          erm&ouml;glichen es blinden und stark sehbehinderten
          Computernutzern ein Bild komplett f&uuml;hlen zu
          k&ouml;nnen. Die Konturen werden durch eine feine
          Nadelmatrix aus dem Display herausgebracht und lassen
          sich somit komplett drei dimensional ertasten.</P>
          <HR>

          <H3>Bundesregierung erl&auml;sst Gesetz zur
          Nachrichtensperre</H3>

          <P>Die Bundesregierung stellt in der n&auml;chsten Woche
          ein neues Gesetz vor, das es g&auml;nzlich verbieten
          soll, Nachrichten ohne vorherige Kontrolle und Korrektur
          durch das Bundespresseamt zu ver&ouml;ffentlichen. Damit
          gehen ausschlie&szlig;lich noch politische Nachrichten
          &uuml;ber die Medien an die Interessierten, die vom
          Bundespresseamt genehmigt wurden. Die Pressefreiheit wird
          durch den Erlass des Gesetzes dann g&auml;nzlich
          aufgehoben.</P>
          <HR>

          <H3>Wer l&uuml;gt, fliegt</H3>

          <P>Zum ersten mal in der deutschen Rechtsprechung wurde
          ein 43j&auml;hriger Maurermeister zu einer Geldstrafe in
          H&ouml;he von 500 Euro verurteilt, weil er seine Freunde
          in einer gem&uuml;tlichen Stammtischrunde belogen hatte.
          Er hatte mit sehr &uuml;berdimensionierten
          Ma&szlig;angaben seines Geschlechtsteiles herumgeprahlt,
          woraufhin ihn seine ehemaligen Freunde auf Schadenersatz
          verklagten. Als Begr&uuml;ndung nannten sie eigene
          Minderwertigkeitskomplexe, was von den Richtern als
          leichte K&ouml;rperverletzung eingestuft wurde. Mit den
          &uuml;blichen &Uuml;bertreibungen und L&uuml;gen auch in
          einer freundschaftlichen Stammtischrunde wird es
          k&uuml;nftig wohl vorbei sein, da sich weitere Urteile an
          diesem Entscheid ein Beispiel nehmen k&ouml;nnten.</P>
          <HR>

          <H3>EU fordert Begr&uuml;&szlig;ungsgeld zur&uuml;ck</H3>

          <P>Der EU-Aufsichtsrat gab bekannt, dass im Zuge dringend
          notwendiger Sparma&szlig;nahmen auch &uuml;ber bereits
          nicht korrekt gezahlte Gelder und deren R&uuml;ckholung
          nachgedacht werden m&uuml;sse. Hierbei wurde auch
          &uuml;ber das bei der deutschen Einheit ausgezahlte
          Begr&uuml;&szlig;ungsgeld diskutiert, da es sich hierbei
          um staatliche, jedoch von der EU nicht genehmigte
          Ausgaben handelt. Die Begr&uuml;&szlig;ungsgelder sollen
          per Lastschrift bzw. Rechnung von den Ex-DDR-B&uuml;rgern
          bereits im 3. Quartal diesen Jahres zur&uuml;ck gezahlt
          werden. Ein entsprechender EU-Gesetzesentwurf liegt
          bereits seit mehreren Monaten vor und wird
          voraussichtlich in der kommenden Woche erfolgreich
          beschlossen werden.</P>
          <HR>

          <H3>Peinlich: Eierravioli mit Hundefutter
          gef&uuml;llt</H3>

          <P>Der f&uuml;hrende Hersteller Riglofoots RTM von
          Nudelgerichten mit F&uuml;llung, der f&uuml;r viele auf
          dem deutschen Markt bekannte Hersteller Eier-Ravioli
          herstellt, muss nun &uuml;ber drei&szlig;ig Millionen
          Konserven Eierravioli vom Markt zur&uuml;ck ziehen. Wie
          der Hersteller zugeben musste, produziere man f&uuml;r
          den Tierfuttermarkt auch spezielle Hundefuttermittel und
          durch eine peinliche Verwechslung wurden rund zwei Wochen
          lang die Ravioli mit Hundefutter bef&uuml;llt. Deutliche
          Nebenwirkungen wurden von den Verbrauchern jedoch nur in
          Form bei&szlig;enden &uuml;blen Atemgeruchs gemeldet.
          Auch erh&ouml;hte Darmfunktion und Bl&auml;hungen
          k&ouml;nnen auftreten. Verbraucher, die innerhalb der
          letzten zwei Wochen Konserven mit Eierravioli gekauft
          haben, werden gebeten, Diese im &ouml;rtlichen Tierheim
          abzugeben und sich diese R&uuml;ckgabe quittieren zu
          lassen. Sie erhalten &uuml;ber die Riglofoots RTM dann
          umgehend Ersatz.</P>
          <HR>

          <H3>CWM 500 Salbe - Schwangerschaft auf Rezept</H3>

          <P>Eine v&ouml;llig neue Salbe erm&ouml;glicht die
          Ausl&ouml;sung einer Schwangerschaft bei einer Frau.
          K&uuml;nstliche Spermien werden in einer speziellen
          chemischen L&ouml;sung konserviert in dieser Salbe
          gehalten, die beim Einreiben auf die weibliche Bauchdecke
          eine Befruchtung ausl&ouml;st. CWM (Child without Man)
          wurde bereits in Tierversuchen erfolgreich getestet.
          Medizinisch f&uuml;hrende Forschungsinstitute rechnen mit
          einer Markteinf&uuml;hrung in der Humanmedizin in
          weniger, als zehn Jahren!</P>
          <HR>

          <H3>Interview mit einem Geist</H3>

          <P>Spektakul&auml;r wurde im englischen Nachrichtenkanal
          CNN ein als echt eingestuftes Video gezeigt, indem ein
          Geist interviewt wurde. Es handelt sich hierbei um einen
          eindeutig 1872 verstorbenen Buchhalter, der auf Fragen
          des interviewenden Redakteurs exakte Antworten geben
          konnte. Die geisthafte Erscheinung war leicht transparent
          konnte aber genau identifiziert werden, da der Geist
          erkl&auml;ren konnte, wo ein Foto seiner Person zum
          beweisenden Vergleich zu finden sei. Einen Betrug
          schlie&szlig;t CNN bereits aus. Im Laufe des Tages wird
          es hierzu detailliertere Berichte geben.</P>
          <HR>

          <H3>EA Games: Need for Speed 2004 auch f&uuml;r blinde-
          und sehbehinderte Fahrer</H3>

          <P>Angek&uuml;ndigt f&uuml;r das 3. Quartal diesen Jahres
          hat der Spielegigant EA-Games das neue Autorennepos "Need
          for Speed". Erstmalig wurde das Spiel speziell angepasst
          zum Spielen f&uuml;r blinde und sehbehinderte
          Computerspieler. Per Force-Feedback und VibraVoice wird
          dem Spieler durch ein unterst&uuml;tztes Lenkrad die
          Fahrbahn &uuml;bermittelt. Ein virtueller Beifahrer
          beschreibt die Strecke recht detailliert. S&auml;mtliche
          Einstellungen und Onlinebeschreibungen des Spieles sind
          per Screenreader (ein blindenspezifisches Hilfsmittel)
          auslesbar. Zudem werden alle Ein- und Ausgaben akustisch
          unterst&uuml;tzt. Erste Tests erwiesen sich als absolute
          Spielerevolution f&uuml;r Blinde und Sehbehinderte. Mit
          "Blindcycle Cross 2004" soll im 4. Quartal ein auf
          demselben System basierendes Motorrad-Rennspiel auf den
          Markt kommen. Weitere Games sind bereits in
          Vorbereitung.</P>
          <HR>

          <H3>Sony stellt neues Universalmediensystem vor</H3>

          <P>Mit dem neuen UMS 2100 S stellt Sony ein neues
          universelles Medientalent vor. Das Ger&auml;t vereint
          Telefonieren, Internet, Video, Beleuchtung und
          Hifibereich. Klein und kompakt ist der UMS 2100 S. Mit
          nur 1,8 Kg sogar f&uuml;r den mobilen Einsatz perfekt.
          Das Allroundtalent kann im Wohnzimmer in einer Ecke
          v&ouml;llig unscheinbar stehen und ist dabei kaum
          gr&ouml;&szlig;er, als eine Micro-Hifianlage. Bedient
          wird es komplett per Spracheingabe. Als Videoprojektor
          wirft es entweder ein dimmbares und farblich variierendes
          Licht an die Wand, oder auch per Kabelanschlu&szlig; oder
          vom integrierten Sat-Receiver den Lieblingsfilm. Aber
          auch eine DVD-Recorderlaufwerk spielt DVDs aller Formate
          ab und nimmt auf DVD+R/+RW auf. Selbstverst&auml;ndlich
          fehlen Hifi-CD-Tauglichkeit, Radiotuner und MD-Laufwerk
          nicht. Selbst an einen DSL-Anschlu&szlig; f&uuml;r das
          Internet im Gro&szlig;format an der Wohnzimmertapete
          wurde gedacht. Ein Sprachsynthesizer kann hierbei die
          Internetseiten sogar vorlesen. Per Voicedial und
          Freisprecheinrichtung kann sogar mit dem eingebauten GSM-
          und UMTS-Handy telefoniert werden. Das Display wird
          wieder auf die Wand projiziert. Der Preis f&uuml;r den
          UMS 2100 S wird dabei das Produkt ebenfalls
          &auml;u&szlig;erst attraktiv machen, denn 1298,- Euro
          sind f&uuml;r solch ein Multitalent ein echtes
          Schn&auml;ppchen. Auf den Markt soll das Ger&auml;t noch
          im 4. Quartal diesen Jahres erscheinen.</P>
          <HR>

          <H3>Mediengleichstellungsgesetz verabschiedet -
          H&ouml;rb&uuml;cher f&uuml;r Alle</H3>

          <P>Das neue heute beschlossene
          Mediengleichstellungsgesetz verpflichtet Verlage
          k&uuml;nftig dazu, grunds&auml;tzlich zu einem
          ver&ouml;ffentlichtem Buch auch immer eine f&uuml;r
          Behinderte leichter zug&auml;ngliche Alternative heraus
          zu bringen. Im Klartext wird es dadurch wohl
          hinauslaufen, dass grunds&auml;tzlich jedes neue Buch
          immer auch als H&ouml;rbuch erh&auml;ltlich sein wird, da
          sich die Verlage bei dieser Alternative noch die besten
          Umsatzerwartungen versprechen. Gleichzeitig sieht das
          neue Gesetz auch eine identische Preisgestaltung vor, so
          dass H&ouml;rbuch und Schwarzschrift grunds&auml;tzlich
          denselben Verkaufspreis haben werden.</P>
          <HR>

          <H3>Nach der Ich-AG kommt die Ich-GmbH</H3>

          <P>Die Bundesagentur f&uuml;r Arbeit gab in einer
          Pressemitteilung eine weitere Unterst&uuml;tzungsform
          f&uuml;r Existenzgr&uuml;nder bekannt.</P>

          <P>Die auf "Ich-GmbH" getaufte Unterst&uuml;tzung wendet
          sich an Gruppen von Existenzgr&uuml;ndern und hofft auf
          die Verbindung zwischen den Arbeitsuchenden, die sich
          zusammen schlie&szlig;en wollen, um gemeinsame ein
          Unternehmen zu gr&uuml;nden.</P>

          <P>Solchen Gruppierungen werden erweiterte Zusch&uuml;sse
          bewilligt und Sonderkredite f&uuml;r Startkapital nach
          konzeptioneller &Uuml;berpr&uuml;fung bis zu 25000 Euro
          gew&auml;hrt. Durch diese massive Unterst&uuml;tzung
          erhofft sich die Regierungskoalition deutliche
          Trendwenden in der Arbeitslosenstatistik und eine
          konjunkturelle Verbesserung. Man erwartet hierdurch stark
          erh&ouml;hte Unternehmensgr&uuml;ndungen bereits im
          zweiten Halbjahr 2004.</P>
          <HR>

          <H3>&Uuml;berraschung von NOKIA: 9300i Communicator</H3>

          <P>In einer &uuml;berraschenden Pressemitteilung stellte
          der namhafte Handyhersteller noch vor
          Ver&ouml;ffentlichung des neuen 9500-Communicator einen
          fr&uuml;heren Nachfolger des beliebten 9210i-Modells
          vor.</P>

          <P>Der 9300i ist hierbei nahezu mit den technischen
          Details identisch mit dem zum 4. Quartal
          angek&uuml;ndigten 9500. Verzichtet wurde jedoch auf die
          eingebaute Kamera und Bluetooth-Technologie.</P>

          <P>Optisch ist der 9300i zun&auml;chst wie der 9500
          aufgebaut. Allerdings wurde bei diesem Modell auf eine
          neue Tastatur verzichtet und es kommt die bew&auml;hrte
          Tastatur aus dem 9210i weiterhin zum Einsatz.</P>

          <P>Der kleinere Communicator stellt somit eine Mischung
          des bew&auml;hrten 9210i und dem 9500 dar. Preislich wird
          der 9300i deutlich unter dem empfohlenen VK des 9500
          liegen und somit sicherlich seine Anwender finden.</P>
          <HR>

          <H3>Harry Potter Band 6 - Der Schein des Heiligen</H3>

          <P>&Uuml;berraschend teilte Joanne K. Rowling, die
          Autorin der Harry Potter-B&uuml;cher in einer
          Pressemitteilung mit, dass noch im 2. Quartal diesen
          Jahres der neue Band 6 der beliebten Buchreihe auf dem
          Markt erscheint. Zun&auml;chst wird die englische Version
          von "Der Schein der Heiligen" erscheinen, - noch vor
          Weihnachten 2004 soll die deutsche &Uuml;bersetzung in
          den Buchhandel gehen.</P>
          <HR>

          <H3>Neuer Virus erh&ouml;ht PC-Leistung</H3>

          <P>Erstmalig scheint es Anlass zur Freude &uuml;ber einen
          v&ouml;llig neuartigen Virus zu geben. W.32-TuneUp@Worm
          verbreitet sich rasendschnell &uuml;ber das Internet und
          erh&ouml;ht die PC-Leistung deutlich. Bei fast allen
          Computersysteme sind die Hard- und Softwarekomponenten
          nicht optimal konfiguriert. Der neue Virus untersucht das
          System und konfiguriert es ggf. so um, dass dadurch
          deutliche Leistungsreserven freigesetzt werden. Bis zu 69
          % Leistungssteigerungen wurden bereits gemeldet.</P>

          <P>Aufgrund der eher angenehmen Auswirkungen sind die
          f&uuml;hrenden Hersteller von Antivirensoftware zum
          ersten mal gegen ein Update ihrer eigenen Scansysteme und
          werden voraussichtlich diesen neuen Virus nicht
          bek&auml;mpfen.</P>

          <P>Microsoft ist dennoch sehr am Aufsp&uuml;ren des
          Programmierers, der in Polen vermutet wird interessiert.
          Durch Kooperationsvertr&auml;ge soll gesichert werden,
          W.32-TuneUp@Worm in eine kommende Betriebssystemversion
          von Microsoft Windows zu integrieren.</P>
          <HR>

          <H3>Blinde und sehbehinderte Jugendliche k&uuml;nftig ab
          15 Anspruch auf eigene Wohnung</H3>

          <P>Mit dem heutigen Tag wurde ein neues Gesetz im
          Bundestag verabschiedet, um blinden und sehbehinderte
          Jugendlichen noch fr&uuml;her ein eigenst&auml;ndiges
          Erwachsenwerden zu erm&ouml;glichen. K&uuml;nftig
          k&ouml;nnen diese Jugendlichen bereits ab dem
          f&uuml;nfzehnten vollendeten Lebensjahr mit staatlicher
          Unterst&uuml;tzung zuhause ausziehen und eine eigene
          Wohnung beziehen. Die Eltern gelten ab diesem Moment nur
          noch "bedingt erziehungsberechtigt". Durch das neue
          Gesetz erhoffen sich SPD und Gr&uuml;ne eine fr&uuml;here
          Integration in das Alltagsleben blinder und
          sehbehinderter Menschen, die nicht l&auml;nger von ihren
          Eltern abh&auml;ngig sein m&ouml;chten. Ein
          ausf&uuml;hrlicherer Pressebericht wird von der
          Regierungskoalition am sp&auml;ten Nachmittag
          erwartet.</P>
          <HR>

          <H3>Microsoft - erste Betaversion von Acoustic-Windows
          vorgestellt</H3>

          <P>In einer exklusiven Konferenzrunde f&uuml;hrte
          Microsoft ein revolution&auml;r neues Programmiersystem
          vor. Durch Sprachein- &amp; ausgabe lassen sich mit dem
          neuen Programmentwicklungssystem "Acoustic-Windows"
          s&auml;mtliche Funktionen der Windows-Oberfl&auml;che in
          einem Programmsystem erfassen. Die v&ouml;llig neuartige
          Entwicklerumgebung stellt v&ouml;llig neue Wege offen,
          die es gerade auch blinden und sehbehinderten
          Programmiereinsteigern vereinfachen soll, komplexe
          Programme f&uuml;r die n&auml;chste Windows-Version zu
          programmieren. Der Entwickler gibt &uuml;ber Mikrofon
          lediglich Modul und die gew&uuml;nschte Funktion an.
          Acoustic-Windows erstellt daraus den Sourcecode,
          kompiliert dann das Ganze und speichert das Programm
          ausf&uuml;hrbar ab. Ausgabe als grafische Oberfl&auml;che
          oder auch per Screenreader und andere Hilfsmittel wird
          dann weit&auml;sgehend &uuml;berfl&uuml;ssig sein.</P>
          <HR>

          <H3>Neues barrierefreies Bauprojekt in Berliner
          Verwaltungsgeb&auml;uden</H3>

          <P>Heute gab der Bausenator aus Berlin bei einer
          Pressemitteilung ein neues Bauprojekt bekannt, welches
          &ouml;ffentliche Einrichtungen kompatibel zum neuen BMPS
          (Blindstick-Magnetical-Positions-System) machen soll. Im
          dritten Quartal diesen Jahres werden Blindenst&ouml;cke
          dieses revolution&auml;re neue System eingebaut haben. Im
          Boden &ouml;ffentlicher Verwaltungsgeb&auml;ude sind
          spezielle sehr starke Elektromagneten eingelassen. In dem
          BMPS-Standard gefertigte Blindenst&ouml;cke f&uuml;hren
          in der Spitze ein spezielles Ortungssystem. Am Infostand
          gleich am Eingang jeder &ouml;ffentlichen Einrichtung
          gibt der Besucher sein Ziel akustisch an. Durch das BMPS
          wird er dann an seinem Blindenstock direkt an sein
          gew&uuml;nschtes Ziel gef&uuml;hrt, indem durch
          elektromagnetische Einfl&uuml;sse im Boden der
          Blindenstock gef&uuml;hrt wird. Durch die magnetische
          Anziehungskraft im Blindenstock f&uuml;hlt der blinde
          Besucher somit seinen Weg. Ein BMPS-kompatibler
          Blindenstock wird hierbei nur etwa 50 Euro &uuml;ber den
          Durchschnittspreisen ohne BMPS liegen. Berlin rechnet mit
          einem Abschluss seiner Umbauarbeiten etwa mit dem ersten
          Quartal des n&auml;chsten Jahres.</P>
          <HR>

          <H3>Pressemeldung direkt aus Berlin.</H3>

          <P>Die SPD sieht keine Chancen mehr, selbst die Probleme
          unseres Landes zu bew&auml;ltigen und gibt daher ihre
          Regierungsposition auf um Platz zu machen f&uuml;r eine
          neu gew&auml;hlte Regierung. Bundestagspr&auml;sident
          Tierse rechnet mit Neuwahlen bereits Mitte August diesen
          Jahres. CDU und CSU verhandeln derzeit sehr verbissen
          darum, welche Partei den n&auml;chsten Bundeskanzler
          stellt.</P>

          <P>Einen ausf&uuml;hrlicheren Pressebericht dieser gerade
          &ouml;ffentlich gewordenen spektakul&auml;ren
          Entscheidung wird es gegen 15 Uhr heute Nachmittag
          geben.</P>
          <HR>

          <H3>Bundesregierung erl&auml;sst Gesetz zur
          Nachrichtensperre</H3>

          <P>Die Bundesregierung stellt in der n&auml;chsten Woche
          ein neues Gesetz vor, das es g&auml;nzlich verbieten
          soll, Nachrichten ohne vorherige Kontrolle und Korrektur
          durch das Bundespresseamt zu ver&ouml;ffentlichen. Damit
          gehen ausschlie&szlig;lich noch politische Nachrichten
          &uuml;ber die Medien an die Interessierten, die vom
          Bundespresseamt genehmigt wurden. Die Pressefreiheit wird
          durch den Erlass des Gesetzes dann g&auml;nzlich
          aufgehoben.</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

