<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1"><!-- Author = Cord Hagen -->

    <TITLE>Frauenmeinungen</TITLE>
  </HEAD>

  <BODY background="images/bgb.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>Frauenmeinungen</B></FONT></P>

          <P>Was unterscheidet die Hunde- von der
          M&auml;nnerhaltung?<BR>
          Der Hund versaut schon mal den Teppich, der Mann das
          ganze Leben.</P>
          <HR>

          <P>"Harry sagt zu seiner Frau: 'H&ouml;r mal, das ist
          interessant, Schatz. Ich habe gerade gelesen, dass einer
          Studie zufolge M&auml;nner durchschnittlich 15000
          W&ouml;rter am Tag benutzen - Frauen dagegen fast 30000.
          Das d&uuml;rfte ja wohl endg&uuml;ltig beweisen, dass
          Frauen mehr reden als M&auml;nner.'</P>

          <P>'&Uuml;berhaupt nicht', sagt seine Frau. 'Das beweist
          nur, dass wir immer alles zweimal sagen m&uuml;ssen,
          damit ihr es kapiert!'</P>
          <HR>

          <P>Warum feiern wir eigentlich Weihnachten ... Es kommt
          doch jeden Tag vor, dass ein Mann geboren wird, der sich
          sp&auml;ter f&uuml;r Gott h&auml;lt.</P>
          <HR>

          <P>Wie r&auml;cht man sich an der Frau, die einem den
          Ehemann weggenommen hat? Man l&auml;&szlig;t sie ihn
          behalten.</P>
          <HR>

          <P>"Mama, stimmt es, dass in einigen Teilen Afrikas die
          Frauen ihre M&auml;nner vor der Ehe nicht kennen?" "Das
          ist in jedem Land so, Kleines."</P>
          <HR>

          <P>Was ist der Beweis daf&uuml;r, dass M&auml;rchen frei
          erfunden sind?<BR>
          Weil der Prinz immer ein intelligenter, gutaussehender
          Single ist.</P>
          <HR>

          <P>Nach einem Unfall: Der Verletzte liegt auf dem Rasen,
          einige rufen mit dem Handy die Polizei, &uuml;ber den
          Verletzten beugt sich eine Frau, um zu helfen. Kommt ein
          Mann sicheren und energischen Schrittes von hinten, tippt
          der Frau auf die Schulter und sagt: "Lassen Sie mich das
          mal machen, ich habe einen Erste-Hilfe-Kurs gemacht."</P>

          <P>Die Frau schaut ihm eine Weile zu und sagt dann zu
          ihm: "Wenn Sie an die Stelle kommen, wo sie den Arzt
          rufen sollten, ich bin schon da."</P>
          <HR>

          <P>Wann kann ein Mann aufrecht stehen?<BR>
          Wenn das Bier im obersten Regal steht.</P>
          <HR>

          <P>ERSTE FRAU: Was w&uuml;rdest Du mit einer machen, die
          Du mit Deinem Mann im Bett erwischst?</P>

          <P>ZWEITE FRAU: Ich w&uuml;rde zuerst Ihren Blindenhund
          erschie&szlig;en.....</P>
          <HR>

          <P>Ein Theologe diskutiert mit einer Architektin:<BR>
          Er: Ich wei&szlig; nicht, warum Sie sich so aufregen. der
          liebe Gott hat doch zuerst den Mann gebaut, und dann erst
          die Frau. Die Reihenfolge w&auml;re damit doch
          geregelt!<BR>
          SIE: Ja, ich mache auch immer zuerst eine Skizze.</P>
          <HR>
          Was ist der Unterschied zwischen M&auml;nnern und
          K&auml;se?<BR>
          K&auml;se reift. 
          <HR>

          <P>M&auml;nner sind:<BR>
          - wie Milch - wenn man sie stehen l&auml;sst, werden sie
          sauer.<BR>
          - unbestechlich - die meisten nehmen nicht einmal
          Vernunft an.<BR>
          - wie Autoreifen - ziemlich aufgeblasen + ohne Profil<BR>
          - wie Zwiebeln - nach dem Sch&auml;len ist der Rest zum
          Heulen.</P>

          <P>Lass dich nie von den strahlenden Augen eines Mannes
          blenden -es k&ouml;nnte die Sonne sein, die durch sein
          hohles Hirn scheint.</P>

          <P>In jedem Mann steckt etwas Gutes.<BR>
          Und wenn es nur das K&uuml;chenmesser ist!</P>

          <P>Warum sagt man nicht, "der dumme Mann" ?<BR>
          Man sagt ja auch nicht "der runde Kreis" !</P>

          <P>Auf der einen Seite der Stra&szlig;e stehen zwei
          M&auml;nner.<BR>
          Was steht auf der anderen? Auch nichts!</P>

          <P>Was ist der Unterschied zwischen einem Mann und einer
          Batterie?<BR>
          Eine Batterie hat auch noch eine positive Seite!</P>

          <P>Warum haben so viele M&auml;nner einen Bierbauch?<BR>
          Damit der Zwerg wenigstens ein Dach &uuml;ber dem Kopf
          hat.</P>

          <P>Was ist ein gutaussehender, intelligenter und
          sensibler Mann?<BR>
          Ein Ger&uuml;cht...</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

