<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x01 - Turboprint</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x001A.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0019.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x001B.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0019.html">PageStream</A> | <A HREF="0x001A.html">Turboprint</A> | <A HREF="0x001B.html">Tornado3D</A> | <A HREF="0x001C.html">The A-Files</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0013.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0014.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0015.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0016.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0017.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0019.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x001D.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x001E.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0022.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0024.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0026.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>TurboPrint Professional 6</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Sie wollen einen Drucker an Ihren Amiga
anschlie&szlig;en? Na, nichts leichter als das: Kabel an Drucker und die
parallele Schnittstelle am Amiga angesteckt, beide eingeschaltet, aus den
Preferences den richtigen Druckertreiber ausgew&auml;hlt und - was? Sie
finden ihren Drucker nicht? Der Ausdruck liegt weit unter den
F&auml;higkeiten Ihres Druckers? Tja, dann brauchen Sie wohl
Turboprint... </FONT><BR>

<P ALIGN=CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Am Amiga gibt es derzeit wohl nur zwei professionelle Methoden, um an
ansprechende Ausdrucke zu gelangen: Studio und TurboPrint. Letzteres wird
hier ein bi&szlig;chen in die Mangel genommen.</P>

<P>Die Version 6 gibt es in zwei Ausf&uuml;hrungen: als Vollversion und als
Update. Da ich schon gute Erfahrungen mit der Version 4 sammeln konnte,
bestellte ich das entsprechende Update. F&uuml;r Benutzer der Version 5
gibt es ein eigenes Angebot. Mit der Lieferung bekommt man einen neue
Diskette mit der ganzen Software und ein Handbuch, da&szlig; sich als
Update zum Handbuch der Version 4 herausstellt.</P>

<P>Darin sind, sehr gut auch f&uuml;r Laien in der Drucktechnik
verst&auml;ndlich, die Grundlagen und die Verwendung des Systems
beschrieben.</P>

<P>Das Grundprinzip hat sich zur Version 4 nicht wirklich ver&auml;ndert:
Turboprint implementiert einen neuen Druckertreiber in den Preferences, den
man dann aus allen Programmen heraus anw&auml;hlen kann, die die
Preferences unterst&uuml;tzen. M&ouml;glich sind damit dann Drucke bis zur
h&ouml;chsten Qualit&auml;t, die der entsprechende Drucker liefern kann
(bei meinem Stylus Color etwa 720x720 dpi in voller Farbtiefe). TurboPrint
ist das einzige Drucksystem f&uuml;r den Amiga, das einen 24bit
printer.driver beinhaltet und somit wirklich in TrueColor und nicht nur in
12bit (also diese 4096 Farben der Original-Workbench-Treiber) ausdrucken
kann.</P>

<P>F&uuml;r Programme, die direkt auf prt: zugreifen, funktioniert das
wunderbar. Wer allerdings direkt auf par: die Daten rausschreibt umgeht das
Treibersystem wunderbar und darf sich dann nicht wundern, wenn das Ergebnis
nicht den Wunschvorstellungen entspricht.</P>

<P ALIGN=CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Die gravierendste &Auml;nderung zur Version 4 f&auml;llt beim
GrafikPublisher ins Auge, der nun fast schon ein DTP-Programm ersetzt. Man
kann nicht nur, wie bei V4, einfach eine Grafik in beliebiger
Gr&ouml;&szlig;e irgendwo auf der Seite plazieren, sondern deren gleich
mehrere, auch &uuml;berlappend und eben frei skalierbar. Dazu k&ouml;nnen
(ebenfalls als Grafikobjekt frei skalier- und plazierbar) Textobjekte dazu
ins Bild gesetzt werden und somit eine Seite (oder auch mehrere) bis zum
Letzten durchgestaltet werden. Dabei kann zus&auml;tzlich noch
ausgew&auml;hlt werden, ob Text und/oder Hintergrund transparent sein
sollen. Sogar in Blocksatz lassen sich Textbl&ouml;cke einbinden. Das
Fenster des GrafikPublishers unterst&uuml;tzt volles Drag&amp;Drop,
soda&szlig; man Icons von Bildern einfach hineinwerfen kann. Die erstellten
Seiten k&ouml;nnen als Projekt abgespeichert werden, wobei die
eingebundenen Bilder darin nur als Link auf den Pfad auf der Platte, an dem
das Bild effektiv liegt, vermerkt werden. Die einzelnen Bilder auf der
Seite k&ouml;nnen in den Hintergrund geklickt oder in den Vordergrund
geholt werden, die Seiten lassen sich in eine andere Reihenfolge bringen,
l&ouml;schen, kopieren, einf&uuml;gen, usw.</P>

<P>Jedes einzelne Bild l&auml;&szlig;t sich unabh&auml;ngig von den anderen
nicht nur in Gr&ouml;&szlig;e und Position anpassen, sondern auch in seinen
Helligkeits-, Kontrast-, Gamma-, Farb-, Sch&auml;rfe- und RGB-Einstellungen
beeinflussen. Die ver&auml;nderten Bilder k&ouml;nnen dann auch wieder als
IFF, PPM oder Sunraster abgespeichert werden. Ebenso k&ouml;nnen die Bilder
frei gedreht werden, wie auch nur Ausschnitte daraus verwendet werden
k&ouml;nnen. Die Qualit&auml;t der Umrechnungen ist durchwegs sehr gut und
die Ergebnisse der Ausdrucke den Erwartungen mehr als entsprechend. Wenn
man passendes Papier verwendet, die Qualit&auml;t der Berechnungen und des
Drucks hochschraubt und entpsrechend viel Zeit beim Ausdruck voraussetzt,
lassen sich hervorragende Ergebnisse erzielen, die ihresgleichen
suchen.</P>

<P>Der Grafikpublisher kann entweder direkt auf der Workbench, oder aber
auf einem 8bit- oder 24bit-Screen laufen, wobei klarerweise nur bei
ersterer Methode das Drag&amp;Drop funktioniert. Ob nun ein CyberGraphX-
oder Picassso96-System verwendet wird, ist irrelevant, es funktioniert so
und so. Nur auf 8bit-Screens von Picasso96 rendert die Textfunktion nicht
richtig (was auch im Handbuch bemerkt wird). Dieser kleine Fehler ist
nat&uuml;rlich nicht sch&ouml;n, aber fast zu verschmerzen, da im Ausdruck
diese Fehler nicht auftreten. Richtig sch&ouml;n wird es aber erst, wenn
der Grafikpublsiher auf einem eigenen 24-Bit-Screen l&auml;uft, auf dem
dann die ganzen Bilder farbkr&auml;ftig gl&auml;nzen und der sch&ouml;n im
Blocksatz gerenderte Text flie&szlig;end um die Bilder
heruml&auml;uft...</P>

<P ALIGN=CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>F&uuml;r die Bilder gibt es die M&ouml;glichkeit, sie mittels des
PhotoOptimizers ganz automatisch oder auch benutzerdefiniert auf
bestm&ouml;gliche Druckqualit&auml;t hin anzupassen. Diese Option
funktioniert mit den vorgegebenen Einstellungen (jeweils auf den
verwendeten Drucker angepa&szlig;t) schon sehr gut, so da&szlig; hier eine
Anpassung durch den Benutzer grunds&auml;tzlich nicht erforderlich ist.</P>

<P>Zur photogetreuen Darstellung von Bildern im Ausdruck ist es wichtig,
da&szlig; die Farben m&ouml;glichst gut mit dem Original
&uuml;bereinstimmen, dazu gibt es die TrueMatch-Farbkorrektur, die in
TurboPrint 6 ihre Verfeinerung gefunden hat. F&uuml;r jeden Drucker
l&auml;&szlig;t sich nun eine eigene TrueMatch-Datei laden, auf da&szlig;
die Farben dem Original immer n&auml;her kommen.</P>

<P>Neu in V6 ist nun die M&ouml;glichkeit, eine TrueMatch-UCR
durchzuf&uuml;hren. UCR steht f&uuml;r &quot;Under Cover Removal&quot;,
einem Fachbegriff aus der Drucktechnik. Fast alle Farbdrucker arbeiten mit
den 4 Farben Cyan, Magenta, Gelb und Schwarz. Aus den Grundfarben Cyan,
Magenta und gElb lassen sich nun bereits nach der subtraktiven Farbmischung
alle Farbt&ouml;ne erzeugen. Schwarz wird zus&auml;tzlich eingesetzt, um
den Kontrast zu verbessern, reinere Graut&ouml;ne zu erhalten, Farbe zu
sparen und um im Textdruck die Geschwindigkeit zu steigern. Dieses Ersetzen
von Grundfarben durch Schwarz wird eben Under Cover Removal genannt, den
Grad der Ersetzung gibt man in Prozent an. In Turboprint4 nun wurde Schwarz
immer dort gedruckt, wo es mn&ouml;glich war (=100%), oder eben gar nicht
verwendet (=0%). Dies hat die Nachteile, da&szlig; Mischfarben manchmal
weniger leuchtend werden und die Rasterung gr&ouml;ber erscheint, da die
schwarzen Pixel wesentlich st&auml;rker ins Auge fallen als die farbigen.
Seit Turborprint5 kann man diese Ersetzung nun prozentual angeben,
beziehungsweise automatisch aus der dem Drucker entsprechenden
TrueMatch-Datei entnehmen lassen.</P>

<P ALIGN=CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Ebenfalls neu in V6 ist der Druckerspooler TurboSpool. Er speichert die
Druckdaten eines Programms auf der Platte zwischen und reicht dann erst die
Daten an den Drucker weiter. Daher steht die Anwendung fast sofort wieder
zur Verf&uuml;gung und es kann weitergearbeitet werden, w&auml;hrend noch
der Ausdruck l&auml;uft. Turbospool selber ist als Commodity implementiert
und dementsprechend einfach zu bedienen. Mit ihm k&ouml;nnen die einzelnen
Druckauftr&auml;ge nicht nur betrachtet werden, sondern auch in ihrere
Reihenfolge verschoben, angehalten oder abgebrochen werden. Genauso
k&ouml;nnen einzelnen Auftr&auml;ge aus der Warteschlange
herausgel&ouml;scht werden. Genauso, wie man es sich von einem
Druckerspooler eben auch erwartet. Zus&auml;tzlich kann auch der Drucker
resetiert werden, wobei allerdings auch die Warteschlange gel&ouml;scht
ist, was ja eigentlich nicht erforderlich w&auml;re. In einem eigenen
Kapitel wird im Handbuch auch noch darauf eingegeangen, wie ein Spooler
effektiv einzusetzen ist und was man wie machen sollte.</P>

<P>In der Theorie klingt das Ganze auch sehr sch&ouml;n, leider
funktioniert es nicht so ganz einfach, da der Spooler bei mir
regelm&auml;&szlig;ig absemmelte (Wurschtsemmel des Monats?!), den Grund
daf&uuml;r konnte ich aber nicht wirklich feststellen. Ohne Spooler
l&auml;uft das ganze Drucksystem ziemlich gut, dennoch aber nicht ganz so
stabil wie unter V4, das wird aber auch daran liegen, da&szlig; es eben
noch V6.0 ist und ich aber ein Arbeiten mit V4.3 gewohnt bin.</P>

<P>Genauso ist auch der Grafikpublisher nicht immer ganz stabil und zeigt
noch ab und zu manchmal &auml;u&szlig;erst interessant in Szene gesetzte
Abst&uuml;rze, die man einem Amiga gar nicht zutrauen w&uuml;rde. Da
Irseesoft aber bisher immer recht flott Updates nachgeschoben hat,
d&uuml;rfte das nicht allzulange ein Problem bereiten (bin ja auch selber
schuld, wenn ich mir ne x.0-Version zulege!).</P>

<P ALIGN=CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Wie auch schon bei V4 gibt es nat&uuml;rlich auch bei der neuen V6 die
M&ouml;glichkeit, Hardcopies einfach auf Tastendruck zu erstellen. Wer
diese Funktion schon kennt, braucht nicht umlernen, denn sie ist gleich
geblieben: ob nun ganze Screens direkt gedruckt oder per Maus
ausgew&auml;hlte Bereiche nur gespeichert werden sollen, es funktioniert
ganz einfach per Tastenkombination. Die Screenshots zu diesem Artikel sind
alle auf diese einfache Art entstanden.</P>

<P>F&uuml;r alte Benutzer ebenfalls nichts Neues ist die Poster-Funktion,
bei der aus &quot;kleinen&quot; Bildern ganz gro&szlig;e werden
k&ouml;nnen. Neu ist allerdings, da&szlig; auch einzelne Posterteile
nachgedruckt werden k&ouml;nnen.</P>

<P ALIGN=CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Laut Handbuch sind bereits viele rechenintensive Routinen von
TurboPrint auf PPC-native Code umgesetzt und sollten somit nun bei Anwahl
des entsprechenden Buttons erheblich schneller laufen. Aufgrund von
kurzfristigen &Auml;nderungen der ppc.library durch Phase5 konnten diese
PPC-Routinen aber nicht mehr in V6.0 integriert werden, werden aber
voraussichtlich ab Februar von der Homepage von Irseesoft zum Downloaden
sein, au&szlig;er wenn dauernd Anfragen dazu kommen, denn dann dauert es
noch l&auml;nger.</P>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x001A.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.irseesoft.com/default.htm">IrseeSoft</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="mailto:mail@irseesoft.com">Anfragen</A> an Irseesoft
<A HREF="../images_01/tp6_grafik.jpeg"><IMG WIDTH=137 HEIGHT=116 SRC="../images_01/tp6_grafiktn.jpeg" ALT="[TP]" ALIGN=RIGHT HSPACE=30 BORDER=0></A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="mailto:jschober@pointdesign.com">Vertrieb</A> von Turboprint in &Ouml;sterreich<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="mailto:support@irseesoft.com">Support</A> von Irseesoft<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/tp6_publisher.gif">Graphic Publisher 01</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/tp6_grafik.jpeg">Graphic Publisher 02</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/tp6_spooler.gif">Printer Spooler</A><BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0019.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x001B.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
