<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x01 - PPC Special</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0022.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0021.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0023.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=100 HEIGHT=25 SRC="../images/_special_.gif" ALT="[Special]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0022.html">PPC Special</A> | <A HREF="0x0023.html">PPC Tutorial</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0013.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0014.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0015.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0016.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0017.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0019.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x001D.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x001E.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0022.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0024.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0026.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>PPC-Amiga: Der Power-PC ?</B></FONT></H1>&nbsp;

<A HREF="../images_01/special_csppc.gif"><IMG WIDTH=129 HEIGHT=104 SRC="../images_01/special_csptn.gif" ALT="CSPPC" ALIGN=RIGHT HSPACE=20 BORDER=0></A>

<BR><FONT SIZE="+1">Nach langer Ank&uuml;ndigungsphase hat Phase5
Ende letzten Jahres begonnen, die PowerUp Boards f&uuml;r Amigas mit
A4000-kompatiblen CPU Steckplatz auszuliefern. Dieser Schwerpunkt soll
zeigen, was mit dem PowerPC im Amiga machbar sein kann, wie sich die
fremde CPU ins Amiga System integrieren l&auml;&szlig;t und welche
Perspektiven sich daraus ergeben.</FONT><BR>

<P ALIGN=CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Grunds&auml;tzlich kann im Amiga der PowerPC nicht direkt eingesetzt
werden. Der Befehlssatz, den die CPU des Amigas verstehen kann, die Befehle
der 68000er Familie, sind nicht kompatibel zum Befehlssatz des PowerPCs.
Das bedeutet, da&szlig; alle derzeitigen Programme - inklusive dem OS -
nicht auf dem PowerPC lauff&auml;hig sind. Warum also trotzdem den PowerPC
benutzen, obwohl bestehende Programme nicht bechleunigt werden? Ein
wichtiger Grund daf&uuml;r ist sicherlich, da&szlig; der 68060 der letzte
Chip in der 68000er Familie ist und diese Familie von Motorola nicht
weiterentwickelt wird. Ein logischer Schritt also, nach Alternativen zu
suchen. Apple ist mit dem erfolgreichen Umstieg vom 68k zum PowerPC diesen
Weg schon gegangen und hat gezeigt, was damit machbar ist. Der PowerPC
ist sehr viel Leistungsf&auml;higer als der schnellste Chip der 68k-Serie,
der 68060. Ein PPC640e mit 200MHz ist ca. 8 bis 15 Mal schneller als ein 68060 mit
50MHz! Im Praxistest auf einer CyberStorm! Von der Architektur macht ein
PowerPC weit mehr Sinn als ein 68k-Nachfolger oder eine andere CPU in der selben
Preisklasse, z.B. Pentium oder auch DEC's Alpha Prozessor. F&uuml;r Insider
m&ouml;chte ich nur die Endian Reihenfolge nennen. Der 68k benutzt ein
anderes Format als Intel Chips, ein PowerPC l&auml;&szlig;t sich hier frei
programmieren. Das ist in Bezug auf zuk&uuml;nftige Versionen des
Betriebssystems sehr von Vorteil, da dadurch direkt auf bestehende
Strukturen zugegriffen werden kann. F&uuml;r bestehenden Code bedeutet das,
man kann diesen im besten Fall einfach neu compilieren. Ich m&ouml;chte
darauf im zweiten Teil in dieser Ausgabe n&auml;her eingehen, wenn ich zur
Programmierung des PowerPC komme.</P>

<P ALIGN=CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Zuerst zur Vorstellung des uns vorliegenden CyberstormPPC Boards. Auf
dem erstaunlich kleinen Board mit den Ma&szlig;en von ca. 5x14cm finden 4
SIMM-Sockel im Standard 72 Pin PS/2 Format, der PowerPC 640e mit bis zu
200MHz (in unserem fall mit 180MHz), ein 68060 mit 50MHz und ein UltraWide
SCSI Controller Platz.</P>

<P ALIGN=CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Da der PowerPC das RAM mit einer Breite von 64 Bit anspricht,
m&uuml;ssen jeweils zwei Sockel parallel best&uuml;ckt werden. Ein Sockel
kann bis zu 32MB aufnehmen, was bei Vollausbau 128MB RAM bedeutet. Es
k&ouml;nnen (EDO-)Rams mit einer Zugriffszeit von 70ns oder schneller
verwendet werden. Beim SCSI Controller wurde erstmals ein UltraWide
Controller im Amiga eingesetzt. Dieser erm&ouml;glicht Transferraten bis zu
40MB/sec - falls die Festplatte das zul&auml;&szlig;t. Leider ist dieser
Controller intern nicht aktiv terminiert, d.h. der Anschlu&szlig; der
Festplatte mu&szlig; einem bestimten <A HREF="#UW-TermSchema">Schema</A>
folgen. Der Controller mu&szlig; quasi in der Mitte sitzen, das Kabel
mu&szlig; links und rechts davon terminiert sein. Das kann ein UltraWide
Terminator sein, oder auch eine Festplatte mit eingeschaltenenm Terminator.
Die Terminierung ist l&auml;stig. Ich h&auml;tte mir eine interne
Terminierung gew&uuml;nscht. Extra UltraWide Terminatoren sind teuer und
schwer zu bekommen. Andererseits ist so viel Technik auf so wenig Platz
untergebracht, da&szlig; man daf&uuml;r Verst&auml;ndnis aufbringt.</P>

<P ALIGN=CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<BR><CENTER><A NAME="UW-TermSchema"><IMG WIDTH=494 HEIGHT=114 ALT="[UW-Term.]" SRC="../images_01/special_uwterm.gif"></A></CENTER>

<P ALIGN=CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Eingesetzt wurde die Karte im Amiga 3000, in einem 16MHz- und in einem
25MHz-Board. Beim A3000 mu&szlig; das Motherboard modifiziert werden, da
ein Signal auf dem CPU-Steckplatz im <A HREF="#A3000PPC-Fix">3000er</A>
fehlt. Im A4000 ist dieses Signal wieder vorhanden. Laut Angaben von
Micronik funktioniert die PowerUp Karte auch im Infinity Tower mit ZorroIII
Erweiterungsboard, zum Zeitpunkt dieses Test konnten wir das aber noch
nicht verifizieren. In letzter Sekunden konnten wir noch ein Problem mit
dem UW-SCSI-Controller beheben. Eine IBM UltraStar 4.3 GB Festplatte
verweigerte anfangs beharrlich die Funktion. Ein R&uuml;ckruf bei Phase5
brachte die L&ouml;sung. Das cybppc.device, das sich in einem FlashROM auf
der Karte befindet und den Festplattencontroller ansteuert, hatte in dieser
Version Probleme mit IBM Festplatten. Ein Update kam prompt per e-mail. Das
kleine Programm l&auml;&szlig;t sich direkt starten und erneuert den Device
Treiber im FlashROM. Die aktuelle Version ist V44.24 und sollte auch mit
IBM Platten funktionieren. Leider einfacher gesagt als getan. Ich hatte die
Platte bereits mit dem alten Device partitioniert und ihr einen RDB (Rigid
Disk Block - enth&auml;llt Informationen f&uuml;r das AmigaOS &uuml;ber die
Festplatte) verpa&szlig;t. Das neue Device hatte offenbar Probleme mit diesem
RDB. Erst ein &quot;Hotstart&quot; (also ein Einstecken w&auml;hrend des
Betriebs - nicht zur Nachahmung empfohlen!) und ein neues Installieren des
RDB mit dem neuen Device brachte den gew&uuml;nschten Erfolg.</P>

<P ALIGN=CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<A NAME="A3000PPC-Fix"><BR></A><CENTER>
<TABLE BORDER=4 WIDTH="90%" CELLPADDING=4 BGCOLOR="#FFAA00">
<TR><TD>Um die CyberstormPPC (oder auch die MK3) im <B>Amiga 3000</B>
betreiben zu k&ouml;nnen, ist es notwendig, den L&ouml;tkolben anzuwerfen.
Am Prozessorslot des A3000 fehlt eine wichtige Interrupt-Leitung. Diese
wurde zu der Zeit, als der 200polige CPU-Slot entwickelt wurde,
absichtlich nicht integriert. Die Commodore Ingenieure waren der Meinung,
da&szlig; auf einer HighSpeed Schnittstelle keine I/O Ger&auml;te (wie
z.B. Festplattencontroller) eingestzt werden sollten. Diese
Interruptleitung (~INT2) ist aber f&uuml;r den SCSI-Controller notwendig
und wird auch zur Synchonisation des PowerPC benutzt. Ab dem Amiga 4000 ist
diese Leitung wieder am Prozessorslot (PIN 82). Es mu&szlig; also eine
Leitung <B>vom Pin 21 des CIA 8520 U350</B> auf den <B>Pin 82 des
Prozessorslots (Fastslot, CN606)</B> gezogen werden. Das kann man mit ein
bi&szlig;chen L&ouml;tkolbenerfahrung selber machen, allerdings auf eigene
Gefahr und ohne Gew&auml;hr! Im Detail sieht das so aus:</TD></TR>
<TR><TD ALIGN=CENTER>
<A HREF="../images_01/special_8520chip.gif"><IMG WIDTH=96 HEIGHT=54 ALT=" " SRC="../images_01/special_8520chiptn.gif" BORDER=0></A>
<A HREF="../images_01/special_8520pcb.gif"><IMG WIDTH=132 HEIGHT=96 ALT=" " SRC="../images_01/special_8520pcbtn.gif" BORDER=0></A>
<A HREF="../images_01/special_fastslot_near.gif"><IMG WIDTH=122 HEIGHT=31 ALT=" " SRC="../images_01/special_fastslot_neartn.gif" BORDER=0></A>
<A HREF="../images_01/special_fastslot.gif"><IMG WIDTH=321 HEIGHT=63 ALT=" " SRC="../images_01/special_fastslottn.gif" BORDER=0></A>
</TD></TR>
</TABLE>
</CENTER>
<BR>

<P ALIGN=CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Dann zeigte sich aber sofort, was in dem Controller steckt. Die IBM
UltraStar ist mit ihren 5400 rpm (Umdrehungen/Minute) eher eine der
langsameren ihrer Sorte, andere UltraWide Platten drehen mit 7200 rpm oder
mehr. Trotzdem bringt sie als Spitzenwert um die 6500MB/sec Durchsatz - bei
15% CPU Belastung! Nebenbei liefert der interne SCSI-Controllere meines
A3000 mit einer Quantum Fireball <B>parallel</B> dazu nochmals knapp
2MB/sec! Bei einem &quot;random seek&quot;-Test (es wird von einem Sektor
willk&uuml;rlich in einen anderen gesprungen, kommt z.B. beim Kopieren vor)
waren's dann noch immer knapp &uuml;ber 2MB/sec - immerhin soviel wie die
Fireball maximal bringt! Mit einer neuen Systeminstallation, die auf einer
PicolloSD64 unter Picasso96 und NewIconsV4.1 auf einer Workbench mit 256
Farben l&auml;uft, kommt dann ware Freude auf. Ein Double Click auf das
WBPattern und das Programm &ouml;ffnet sein Fenster subjektiv schneller als
man die Maustaste losl&auml;&szlig;t! Die Zugriffszeiten werden minimal,
die Ladegeschwindigkeiten schrumpfen. Das was man sich von einem Computer
erwartet!</P>

<P ALIGN=CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Trotz allem mu&szlig; ich hier auch erw&auml;hnen, da&szlig; der PowerPC
noch gar nicht zum Einsatz kam. Diese Ergebnisse w&uuml;rden sich wohl auch
mit einer Cyberstorm MK3 erreichen lassen. Kommen wir nach dem Ausflug in
die &quot;sch&ouml;nste Nebensache der Welt&quot; f&uuml;r einen
CyberStormPPC Besitzer zum eigentlichen Teil dieses Artikels, zum PowerPC
selbst. Der derzeitige Stand an verf&uuml;gbarer PowerPC Software ist
leider minimal. Lediglich WildFire unterst&uuml;tzt den PowerPC. Ich
m&ouml;chte hier aber nicht n&auml;her darauf eingehen, Wildfire alleine
w&auml;re schon einen Testbericht wert (kommt eventuell in einer
sp&auml;teren Ausgabe). Die Demos, die der CyberStorm PPC auf CD beiligen,
zeigen eindrucksvoll die Leistung der neuen Prozessorgeneration. Im
Durchschnitt ist der 180MHz 604e um den Faktor 10 schneller als ein mit 50
MHz getakteter 68060! Bei intensiven mathematischen Berechnungen bis zum
Faktor 15. Man kann sich ausmalen, welches Verh&auml;ltnis das zu den
Standard-Amigas ergibt, die gro&szlig;teils nur mit 68030 oder gar mit
68020 arbeiten! Trotzdem ist die Cyberstorm PPC eine HighEnd-Karte;
interessant werden wird der PowerPC wohl erst, wenn auch User mit kleinerm
Geldbeutel in den Genu&szlig; dieser Rechenleistung kommen. Die kleineren
Geschwister der Cyberstorm, die Blizzard 603e (mit 68030/50 Companion) und
die Blizzard 603e+ (mit 68040/25-40MHz Companion) sollten noch Anfang 1998
auf den Markt kommen - zu einem sagenhaften g&uuml;nstigen Preis. So soll
das 160MHz 603e Board (ohne 68k CPU) nur um die 5.500,- Schilling kosten,
die 250MHz Version wird wohl unter 10.000,- zu haben sein. Ein 68040/25
kostet ca. unter ATS 1.000,-.</P>

<P ALIGN=CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Leider, aus Mangel an Software, m&ouml;chte ich hier nicht n&auml;her
auf die Praxistauglichkeit der Cyberstorm eingehen, sondern auf den zweiten
Teil unseres Schwerpunktes verweisen, der die Systemintegration des PowerPC
in das AmigaOS beschreibt. Hier gibt es zwei konkurrierende Ans&auml;tze,
das WarpOS von Haage&amp;Partner und das eigene System von Phase5. Hoffen
wir, da&szlig; sich das bessere System durchsetzt und dem Benutzer die
Leistung gibt, die wir uns Ende der 90er jahre - nach langem Durchhalten -
auch verdient haben. Sobald mehr PPC Software zur Verf&uuml;gung steht,
werden wir diese in einem &Uuml;berblick vorstellen.</P>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#juergen">J&uuml;rgen Schober</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0022.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.phase5.de/">Phase5</A>
<A HREF="../images_01/special_uwbench.gif"><IMG WIDTH=140 HEIGHT=99 SRC="../images_01/special_uwbenchtn.gif" ALT="[UW-Bench]" HSPACE=20 BORDER=0 ALIGN=RIGHT></A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.haage-partner.com/">Haage&amp;Partner</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/special_csppc.gif">Die CyberStormPPC</A><BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp;
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0021.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0023.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
