<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x01 - Myst</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x001E.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x001D.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x001F.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=79 HEIGHT=25 SRC="../images/_spiele_.gif" ALT="[Spiele]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x001E.html">Myst</A> | <A HREF="0x001F.html">Cedric</A> | <A HREF="0x0020.html">Enemy</A> | <A HREF="0x0021.html">Sword</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0013.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0014.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0015.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0016.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0017.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0019.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x001D.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x001E.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0022.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0024.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0026.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>MYST - The Surrealistic Adventure That Will Become Your World.</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Soeben sind Sie auf das superspannende Buch
&quot;Myst&quot; gesto&szlig;en. Sie wissen nicht, woher es kommt, wer es
geschrieben hat, und auch nicht, wie alt es ist. Beim Lesen machen Sie
Bekanntschaft mit einer wundervoll beschriebenen Inselwelt. Aber es ist ja
doch nur ein Buch, oder? </FONT><BR>

<P ALIGN=CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Sie kommen am Ende des Buches an und legen Ihre Hand auf eine Seite.
Pl&ouml;tzlich l&ouml;st sich Ihre Welt im Dunkel auf und macht der
beschriebeben Inselwelt Platz. Sie sind jetzt hier, wo immer dieses Hier
auch sein mag. Und so bleibt Ihnen nur die M&ouml;glichkeit, Ihre Umgebung
immer weiter zu erforschen...</P>

<P>Es ist eine Insel, rundherum nur Wasser, ein versunkenes Schiff neben
einem Pier und ein paar seltsam anmutende Bauten, weit und breit aber kein
Lebewesen zu sehen. Zwischen den B&auml;umen hindurch verl&auml;uft ein
Pfad, gedankenverloren hebt man einen achtlos weggeworfenen Zettel auf und
wei&szlig; doch nicht, was man tun soll, denn was, bitte sch&ouml;n, ist
ein Bildgenerator, wo ist das Vorzimmer und was sollen all die vielen Hebel
auf der Insel????</P>

<P>Ein St&uuml;ck weit entfernt im Wasser steht eine Art Uhrturm, davor
einige Drehr&auml;der, wie um Leitungen abzusperren...</P>

<P>Man denkt, man ist in einer Fantasy-Welt und erwartet schon bald Ritter
und Burgen zu finden, doch dann st&ouml;&szlig;t man auf ein
Raumschiff...</P>

<P>Was es damit alles auf sich hat? Finden Sie es heraus, und vor allem:
finden Sie wieder nach Hause, denn sonst kann es Ihnen ergehen wie
Atrus...</P>

<P ALIGN=CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Man wandert durch eine Welt gerenderter Standbilder, zwischendurch durch
kleinere und gr&ouml;&szlig;ere Quicktime-Movies, die in den Bildern zum
Beispiel Windm&uuml;hlen bewegen oder Wasser pl&auml;tschern lassen,
aufgelockert. Dazu passendes Windrauschen, Summen eingeschalteter
Maschinen, und, was das Beste daran ist: keine nervige
T&uuml;del&uuml;-Musik-Untermalung, die ja nun auch in der Welt, in der wir
uns jetzt zu bewegen glauben, nicht einfach da ist.</P>

<P>Es ist eine sch&ouml;n simulierte Welt (oder sind es mehrere Welten oder
nur unterschiedliche Zeiten?), in die man sich hineinversetzt glaubt und
wenn man seinen Amiga auch brav an seine Stereoanlage angeschlossen hat, in
einem dunkleren Zimmer sitzt und sich hineinnsinken l&auml;&szlig;t, so
glaubt man doch wirklich, in dieser Welt umherzuirren.</P>

<P ALIGN=CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Erst mit der Zeit kommt man drauf, da&szlig; alles seine Bedeutung hat.
Wenn man nur genug sucht, oder auch nur nachdenkt (warum zum Teufel
z&uuml;ndet ein nicht brennendes Streichholz das Papier nicht an????),
bekommt man zu jedem einzelnen R&auml;tsel (eigentlich ist es ja nur ein
gro&szlig;es R&auml;tsel, aber viele kleine Unklarheiten) immer alle
Informationen. Man braucht nichts zu erraten, irgendwo findet sich der
Hinweis.</P>

<P>Und hat man mal einen Fehler gemacht, oder denkt nur, es sei einer, kein
Problem: Sackgassen gibt es keine, man kommt immer wieder dorthin, wo man
hinwill, auch wenn es nicht gleich offensichtlich erscheint.</P>

<P> Es macht seinem Namen alle Ehre, denn mystisch ist die ganze Stimmung,
eigen das Gef&uuml;hl, da&szlig; man bekommt, wenn man auf einem
Zahnarztsessel liegt und die Sterne beobachtet. Genauso mystisch kommt es
in einer sch&ouml;n gestylten Schachtel daher. Drinnen ist nicht viel: eine
CD mit H&uuml;lle, ein paar Werbezettel und eine Registrierungskarte, auf
der man auch angeben kann, welches andere Spiel man gerne f&uuml;r den
Amiga umgesetzt h&auml;tte.</P>

<P ALIGN=CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Die Installation an sich ist dank des Installers kein Problem und kann
zwischen 5MB und 310MB auf der Platte belegen. Dank des genialen Konzeptes,
da&szlig; zuerst auf der Platte gesucht wird und erst bei Nichtfinden von
der CD geladen wird, kann man einfach Files von der Platte l&ouml;schen
oder dazukopieren, und somit den verwendeten Plattenplatz fast dynamisch
anpassen. So habe ich daher alle 626MB der CD auf eine eigene Partition
kopiert und kann nun die ganzen Quicktime-Movies in ungest&ouml;rter
Qualit&auml;t betrachten, w&auml;hrend mein zweifach CD-Laufwerk daf&uuml;r
gerade zu langsam ist.</P>

<P>Auf einem 68030 mit 40MHz und PicassoII mit Picasso96 werden die Filme
ziemlich ruckelfrei abgespielt und mittels (auch mitgeliefertem) AHI auch
diverse Soundkarten unterst&uuml;tzt. Vorz&uuml;glich funktioniert
nat&uuml;rlich auch die Ausgabe &uuml;ber die Paula mittels AHI. Selbst auf
meinem System, da&szlig; f&uuml;r diese Art Anwendung doch die untere
Grenze darstellt, ist &quot;Paula:Fast 14bit stereo++ calibrated&quot; ohne
Probleme abzuspielen und es klingt (zumindest f&uuml;r meine Ohren)
erstaunlich gut, was die Paula da produziert.</P>

<P ALIGN=CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>So etwas wie eine auf&uuml;hrliche Spielanleitung oder ein Handbuch
sucht man aber vergebens, denn die einzige Dokumentation besteht aus einem
dickeren Inlet in der CD-H&uuml;lle. Mehr ist aber auch nicht notwendig,
denn die Steuerung (vollst&auml;ndig mit der Maus) ist sehr intuitiv und
bedarf eigentlich keiner Erkl&auml;rung.</P>

<P>Gew&ouml;hnungsbed&uuml;rftig hingegen ist die Art, wie Spielst&auml;nde
abgespeichert werden. Spielst&auml;nde? Wo gibt es auf dieser Insel ein
Spiel? Grunds&auml;tzlich kann man nur den aktuellen Stand speichern und
dann wieder aufrufen, es gibt keine Auswahlm&ouml;glichkeit f&uuml;r
mehrere Spielst&auml;nde, die ist aber auch garnicht m&ouml;glich, da es
keine Sackgassen gibt und man immer weiterspielen kann, auch wenn man noch
nicht alle momentan auf einer Insel vorhandenen R&auml;tsel gel&ouml;st hat
und trotzdem sich wieder fortbewegt. Beim Laden kommt man auf die Insel,
auf der man sich beim Speichern befunden hat, allerdings immer an einen
bestimmten Ort. Das &uuml;berrascht zun&auml;chst, doch wenn man
nachschaut, ist der Stand der Dinge wirklich so wie beim Speichern, auch
wenn man beim Speichern an einem ganz anderen Ort auf dieser Insel war.</P>

<P ALIGN=CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P> Myst ist ein Spiel, da&szlig; mehr ist. Es ist eine Simulation, die
Wirklichkeit wird. Es ist ein vollst&auml;ndig neuartiges Spielkonzept, mit
dem zum Beispiel eingessene Rollenspieler so ihre Anfangsprobleme haben
werden. Denn nichts ist so offensichtlich, wie es scheint. Eine Uhr, die
man einstellen kann, ist nicht nur einfach eine Uhr, sie birgt sicher ein
Geheimnis, da&szlig; man zu l&uuml;ften hat, aber damit lassen sich wieder
ganz andere wichtige Informationen gewinnen. Und stellt man etwas so ein,
wie es offensichtlich ist, hei&szlig;t das noch lange nicht, da&szlig; es
auch so gemeint ist. Wei&szlig; man etwas noch nicht, hei&szlig;t das nur,
da&szlig; man noch nicht genug gesucht hat...</P>

<P> Es ist eine Wohltat, zu sehen, da&szlig; f&uuml;r unseren geliebten
Amiga auch wieder Spiele programmiert werden und dann auch gleich noch in
solch einer wunderbaren Qualit&auml;t. Kein Wunder, da&szlig; Myst schon
auf PCs die Leute zu fesseln verstand, nur auf einem Amiga spielt es sich
sch&ouml;ner :-)))</P>

<P ALIGN=CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Das Spiel selbst l&auml;uft vollst&auml;ndig auf einem eigenen Screen im
Multitasking, schaltet man auf die Workbench zur&uuml;ck, h&ouml;rt man im
Hintergrund immer noch das Meerespl&auml;tschern und Windrauschen. Sehr
stimmungsvoll. In der Dokumentation zum Spiel steht, da&szlig; es unter
CyberGraphX lauft, aber auch wenn man Picasso96 auf seinem System
installiert hat, kann man Myst auf einem P96-Screen laufen lassen. Die
Aufl&ouml;sung sollte nur 640x480 bei 8bit betragen, sonst gibts b&ouml;se
Fehler oder Pixelm&uuml;ll. Ich konnte jedenfalls keinen anderen Modus zum
Funktionieren &uuml;berreden...</P>

<P>Laut Specs der Homepage von Myst l&auml;uft das
Spiel aber auch unter 24 bit sowie unter AGA mit einer Aufl&ouml;sung von
mindestens 640x400.</P>

<P ALIGN=CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P> Als Goodie gibt es dazu einen 14 min&uuml;tigen Quicktime-Film &quot;The
Making of Myst&quot;, der doch eine beachtliche L&auml;nge von 64MB
besitzt. Mit der Myst-Quicktime-Eingine ist dieser Film allerdings nur von
der CD zu betrachten. Wenn man ihn auf die Platte kopiert, versucht der
Player zuerst, das komplette File ins RAM zu laden, was aber bei nur 16MB
FastRAM nicht wirklich funktioniert.</P>

<P>Im Vergleich zu QT, einem QuicktimePlayer aus dem Aminet, ist die
eingebaute MovieEngine doch einiges langsamer und sie hat vor allem das
Problem, da&szlig; zeitweise Audio und Video auseinanderlaufen, was
eigentlich bei Quicktime gar nicht passieren k&ouml;nnen d&uuml;rfte.</P>

<P>Richtig interessant wird das Spiel auf mindestens einem 68040er, dort
kommt die Stimmung dann so richtig in Schwung, denn die Nachladezeiten mit
meinem 030er sind zwar sehr kurz (im Sekundenbereich), fallen aber doch als
Unterbrechung auf...</P>

<P ALIGN=CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Auf den Seiten von ClickBOOM gibt es neben ein paar Screenshots der
Amiga Version auch zus&auml;tzliche Infos und eventuelle
UpdateM&ouml;glichkeiten. Am Besten ist das Ganze aber immer noch im
englischsprachigen Teil der Anleitung beschrieben:</P>

<P ALIGN=CENTER>Myst is real.<BR> The key to Myst is to lose yourself in this fantastisc
virtual exploration,<BR> and act and react as if you were really there.</P>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x001E.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.ican.net/~clkboom/">ClickBOOM</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.ican.net/~clkboom/pxl/">PXL Computers</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.ican.net/~clkboom/frames.html">Myst</A>
<IMG WIDTH=76 HEIGHT=93 SRC="../images_01/myst_box.gif" ALT="[Myst]" HSPACE=30 ALIGN=RIGHT><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/myst_index.html">Myst Screenshot Menu</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/myst_01.jpeg">Screenshot 01</A> <A HREF="../images_01/myst_09.jpeg">Screenshot 09</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/myst_02.jpeg">Screenshot 02</A> <A HREF="../images_01/myst_10.jpeg">Screenshot 10</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/myst_03.jpeg">Screenshot 03</A> <A HREF="../images_01/myst_11.jpeg">Screenshot 11</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/myst_04.jpeg">Screenshot 04</A> <A HREF="../images_01/myst_12.jpeg">Screenshot 12</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/myst_05.jpeg">Screenshot 05</A> <A HREF="../images_01/myst_13.jpeg">Screenshot 13</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/myst_06.jpeg">Screenshot 06</A> <A HREF="../images_01/myst_14.jpeg">Screenshot 14</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/myst_07.jpeg">Screenshot 07</A> <A HREF="../images_01/myst_15.jpeg">Screenshot 15</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/myst_08.jpeg">Screenshot 08</A> <A HREF="../images_01/myst_16.jpeg">Screenshot 16</A><BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x001D.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x001F.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
