<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x01 - PPC Tutorial</TITLE>
 <META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0023.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0022.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0024.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

     <IMG WIDTH=100 HEIGHT=25 SRC="../images/_special_.gif" ALT="[Special]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0022.html">PPC Special</A> | <A HREF="0x0023.html">PPC Tutorial</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0013.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0014.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0015.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0016.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0017.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0019.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x001D.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x001E.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0022.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0024.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0026.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>To Warp or Not To Warp</B></FONT></H1>&nbsp;
    <H3><B>Die Systemintegration des PowerUp in das Amiga OS</B></H3>

<BR><FONT SIZE="+1">Der PowerPC verspricht Leistung ohne Ende. Doch was hilft die
Leistung, wenn Sie brachliegt. Ein ausgekl&uuml;geltes System ist
notwendig, um das Potential der Power CPU auch zu nutzen. Wie das neue Herz
in das bestehende Amiga System integriert wurde, lesen Sie hier.</FONT><BR>

<P ALIGN=CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Der PowerPC auf der Cyberstorm (und den Blizzard PPC Karten) arbeitet
parallel zur ebenfalls am Board befindlichen 68K CPU. Beide Prozessoren
k&ouml;nnen alle Resourcen des Amigas benutzen. Zum Betrieb des PowerPC ist
es aber unbedingt notwendig, RAM auf der Cyberstorm zu installieren. Dieses
RAM mu&szlig; paarweise installiert werden, weil der PowerPC mit 64 Bit
darauf zugreift. Der PowerPC selbst kann aber sogar ins ChipRAM schreiben
und davon lesen! Allerdings mit starken Perfomance-Einbr&uuml;chen. Seine
wahre Performance zeigt der PPC im Memtest in das FastRAM. Phase5's eigener
Memtest weist einen Durchsatz von 138MB/sec ins FastRAM (60ns -
FastPageMode Standard PS/2 SIMMs, m. 604e/180) zu vergleichsweise niedrigen
68MB/sec des 68060/50. Ein 200MHz 604e kommt auf geringf&uuml;gig
h&ouml;here Werte als die 180MHz Version.</P>

<P ALIGN=CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Laufen beide Prozessoren parallel, kommt es durch die gemeinsame Nutzung
des RAM-Interfaces zu einem Geschwindigkeitsverlust, der meistens aber
nicht merkbar ist. Im Rendertest mit lwShow (LightWave-Show zum Anzeigen
von Lightwave Objekten mit CyberGL) bekam ich beim Netzwerkzugriff auf den
Amiga Timeout Fehler, wenn nur der 68060 benutzt wurde. Rendert hingegen
der PowerPC, kann parallel noch voll &uuml;ber das Netzwerk auf den Amiga
zugegriffen werden, ohne das der Socket in die Knie geht.</P>

<P ALIGN=CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Nachdem das Betriebssystem nichts von der fremden CPU wei&szlig; und diese
nicht direkt nutzen kann, mu&szlig;ten sich die Entwickler etwas einfallen
lassen. Herausgekommen ist ein Minibetriebssystem, da&szlig; auf der
PowerPC CPU und der 68er CPU parallel l&auml;uft und die Verbindung
zwischen AmigaOS und PPC herstellt. Hier zeigt sich eindrucksvoll die
Flexibilit&auml;t des AmigaOS. Die Schnittstelle ist komplett als shared
library implementiert und kann von jedem Programm genutzt werden - ist also
nicht abh&auml;ngig von der Programmiersprache. Das PPC-Betriebssystem
sorgt f&uuml;r den Austausch von Nachrichten mit dem AmigaOS (Messages) und
verwaltet den Speicher f&uuml;r den PowerPC. Au&szlig;erdem sorgt es
daf&uuml;r, da&szlig; PowerPC-Programme parallel laufen k&ouml;nnen
(scheduler, multitasking auf dem PPC - parallel zum AmigaOS
Multitasking).</P>

<P ALIGN=CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Im Detail gibt es allerdings hier zwei verschiedene Ans&auml;tze von
Haage&amp;Partner (H&amp;P) und Phase5. Ich m&ouml;chte gleich vorweg
sagen, da&szlig; mir pers&ouml;nlich die Haage&amp;Partner L&ouml;sung
besser gef&auml;llt. Sie ist meiner Meinung nach eine bessere Integration
in das Amiga Konzept - allerdings auch mit Nachteilen die ich nicht
verheimlichen m&ouml;chte.</P>

<P ALIGN=CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<TABLE>
 <TR>
  <TD>
<P>Aber zuerst zu den Grundlagen, zur Integration der ppc.library(Phase5) bzw.
des WarpOS (H&amp;P). Wie schon erw&auml;hnt setzten beide L&ouml;sungen
eine Art Minikernel, ein Minibetriebssystem ein, das &uuml;ber ein
ausgekl&uuml;geltes Nachrichtensystem Daten und Anweisungen von einem
Prozessor zum anderen weiter leitet. Beide Teile arbeiten vollkommen
asynchron, der 68er Teil l&auml;uft also parallel zum PowerPC-Teil. Will
man nun PowerPC Code benutzen, mu&szlig; man zuerst ein PowerPC Programm
oder Programmmodul erstellen. Das wird dann in den Speicher des Power PC
&quot;geladen&quot; und eine Anweisung teilt dem PowerPC Betriebssystem
mit, da&szlig; das Programm an der Stelle xy ausgef&uuml;hrt werden soll.
Hier unterscheiden sich dann wieder die ppc.library (von Phase5) und das
WarpOS von Haage&amp;Partner.</P>
  </TD>
  <TD>
    <IMG WIDTH=153 HEIGHT=157 SRC="../images_01/special_warpup.gif" ALT="[WarpUp?]" ALIGN=RIGHT HSPACE=20 BORDER=0>
  </TD>
 </TR>
</TABLE>

<P ALIGN=CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Die ppc.library benutzt ein eigenes Bin&auml;rformat, da&szlig; auf anderen
PowerPC Platformen &uuml;blich ist: das ELF Format. Dieses ist
Konzeptbedingt inkompatibel mit dem Hunk-Format des Amigas. Man k&ouml;nnte
auch sagen, das Hunk Format ist &uuml;berholt. Das ELF Format hat den
Vorteil, da&szlig; man &quot;handels&uuml;bliche&quot; Compiler aus der
Workstation Welt benutzen kann, um PowerPC Code zu erzeugen. Der GNU C
Compiler f&uuml;r den Amiga wird beim Erwerb der Cyberstorm auf CD
mitgeliefert, seit kurzem gibt es im Aminet den Freware Compiler vbcc, der
ebenfalls ELF Programme erzeugen kann. Das Problem am ELF Format ist,
da&szlig; man ein Modul nicht einfach auslagern und vom 68000er als
&quot;Subroutine&quot; anspringen kann, da es tats&auml;chlich ein
eigenst&auml;ndiges Programm ist. Dieses Programm wird dann von der
ppc.library auf die PPC CPU &quot;downgeladen&quot; und bei Bedarf mit
einer Funktion &quot;RunPPC&quot; der ppc.libray aufgerufen.
Selbstverst&auml;ndlich ist es m&ouml;glich, dieses ELF Programm als
Bin&auml;rdatei in den 68K Teil zu linken, und diesen Teil dann dem PPC
zug&auml;nglich zu machen. Ein &quot;Programm&quot; an sich ist also nicht
zwingend erforderlich. Ich m&ouml;chte deshalb darauf hinweisen, weil
Haage&amp;Partner hier einen anderen Weg geht.</P>

<P ALIGN=CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Der StormC-PPC Compiler benutzt f&uuml;r den PPC Code nach wie vor das
Amiga-Hunk Format. Der Vorteil dabei ist, da&szlig; gew&ouml;hnlich
bestehender Code durch einfaches neucompilieren in PowerPC
&quot;umgewandelt&quot; werden kann. Das Programm kann weiter voll auf
Amiga Systemstrukturen und Resourcen zugreifen - was in dieser Art und
Weise mit dem gcc von Phase5 nicht m&ouml;glich ist. Shared Variablen
zwischen 68er und PPC CPU sind <B>nur</B> mit dem StormC m&ouml;glich - das
erfordert auch keinen Context-switch, da auf ein und die selbe Adresse im
Speicher von beiden CPUs zugegriffen werden kann - das geht mit dem gcc
auch, aber mit sehr viel mehr Aufwand. Der Nachteil dieser Methode - und
der auch das ELF-Format rechtfertigt: Systemstrukturen sind oft nicht auf
Langwort Adressen ausgerichtet, der gcc kann Strukturen nur an
Langwortadressen ausrichten, der vbcc kann auch so &quot;umgeschalten&quot;
werden, da&szlig; auf Amiga-Systemstrukturen zugegriffen werden kann.
F&uuml;r eine moderne RISC CPU sind byte aligned Speicherzugriffe (ungerade
Speicheradressen, auch auf WORD boundaries) der Performance Tod!</P>

<P ALIGN=CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Andererseits ist es nicht wirklich so tragisch. Das ELF Format wurde
dahingehend optimiert, um durch Langwortausrichtung das Pipelining der
PowerPC intensiv nutzen zu k&ouml;nnen. Durch ungerade Adressierung kann es
zu ineffizienter Ausnutzung der parallel Abarbeitung der Befehle in der
PowerPC CPU kommen. Eine geringere Leistung ist die Folge. Auf der anderen
Seite hat das AmigaOS ein F&uuml;lle von solchen
&quot;Alignment&quot;-Verletzungen. Auch eine neues OS kann diese aus
Kompatibilit&auml;tsgr&uuml;nden nicht einfach &quot;gerade&quot; biegen,
darum kommen wir nun mal nicht herum. F&uuml;r einen guten Programmierer
sollte es nicht zu schwierig sein, sich auch mit dem StormC an die
Alignment-Kriterien zu halten.</P>

<P ALIGN=CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<TABLE>
 <TR>
  <TD>
   <CENTER>
    <A HREF="../images_01/special_mand1024x768.jpeg">
     <IMG WIDTH=80 HEIGHT=60 SRC="../images_01/special_mand1024x768tn.gif" ALT="Mandelbrot BIG" BORDER=0><BR>
     <FONT SIZE="-1">Mandeldemo<BR>1024x768, 130K</FONT>
    </A>
   </CENTER>
  </TD>
  <TD>
<P>Mit dem StormC ist es sehr einfach, schnell bestehenden Code in PowerPC
Code umzuwandeln. Oft reicht ein einfaches Neucompilieren. Ich bin zum
Testen dieser Technik den umgekehrten Weg gegangen. Das Mandeldemo,
da&szlig; gemischten PowerPC/68K Code benutzt (zu diesem Thema kommen wir
noch) wurde in ein reines 68K Programm umgebaut. Es beinhaltet also nur
Amiga Funktionsaufrufe und Standard Ansi C Funktionen. Daraus wurde ein
68060 optimiertes Mandelbrotprogramm erstellt. Ich habe mir erlaubt, nur
einen 8 Bit Modus mit 256 Farben einzubauen - allerdings mit einer shared
Palette und es wird in ein Intuitionwindow gezeichnet. Dieses Detail ist
wichtig, da dieser Teil verh&auml;ltnism&auml;&szlig;g viele
Betriebssysteaufrufe beinhaltet. Wenn der PPC einen Betriebssystemteil
aufruft, kann dieser nur im 68000er Modus ausgef&uuml;hrt werden, d.h. das
Programm mu&szlig; vom PowerPC in den 68K Modus wechseln, ein sog.
Context-Switch ist notwendig. Dieser kann in Prozessorzeit eine kleine
Ewigkeit dauern - bis zu 2.5 ms.</P>
  </TD>
 </TR>
</TABLE>

<P ALIGN=CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<TABLE>
 <TR>
  <TD>
<P>Das Mandelbeispiel l&auml;&szlig;t sich mit dem StormC Compiler durch
einfaches Umschalten der Ziel-CPU in den Compilereinstellungen von 680x0
auf 603 bzw. 604 und durch ersetzten der amiga.lib gegen die ppcamiga.lib
neu compilieren. Durch das simple Neucompilieren erreichen wir einen
Steigerung der Rechngeschwindigkeit um den Faktor 8-12! Der Start des
Programms wird allerdings ein bi&szlig;chen &quot;verz&ouml;gert&quot;.
Hier m&ouml;chte ich wieder das Detail von zuvor aufgreifen. Die
&quot;shared Palette&quot; (also ein gemeinsamer Farbraum) wird anfangs in
einer Schleife mit 256 Durchl&auml;ufen berechnet. Pro Schleifendurchlauf
wird die Betriebssystemfunktion ObtainBestPen() aufgerufen, im
PowerPC-Programm also ein Contextswitch ausgef&uuml;hrt. Dieser Teil
braucht in der PowerPC Version l&auml;nger als in der 68K Version -
allerdings nicht unbrauchbar l&auml;nger. Durch geschickte Code Optimierung
kann der Teil mit hohem Anteil an System Code ausgegliedert und als 68000er
Code implementiert werden. Ein Mixed Binaries, also Code in dem 68000er und
PowerPC Teile vor kommen, ist machbar.</P>
  </TD>
  <TD>
   <CENTER>
    <A HREF="../images_01/special_mand800x600.jpeg">
     <IMG WIDTH=80 HEIGHT=60 SRC="../images_01/special_mand800x600tn.gif" ALT="[Mandelbrot Medium]" BORDER=0><BR>
     <FONT SIZE="-1">Mandeldemo<BR>800x600, 80K</FONT>
    </A>
   </CENTER>
  </TD>
 </TR>
</TABLE>
<P ALIGN=CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Hier kommen wir wieder zur&uuml;ck zum Verfahren von Phase5. &quot;Mixed
Binaries&quot; in dieser Form sind mit Phase5's L&ouml;sung nicht
m&ouml;glich, jedoch &auml;hnelt die Vorgehensweise doch dem des gemischten
Codes. Statt einen Funktionsaufruf wird &uuml;ber die ppc.library in das
ELF-&quot;Programm&quot; gesprungen. Prinzipiell wird das vom StormC nur
versteckt, der Programmierer &quot;sieht&quot; nur einen Sprungbefehl in
ein Untereprogramm.</P>

<P ALIGN=CENTER><A NAME="12" HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<TABLE>
 <TR>
  <TD>
<P>F&uuml;hrt man die Idee von Haage&amp;Partner noch einen Schritt weiter,
erkennt man aber Vorteile. Prinzipiell ist nicht definiert, wie ein PowerPC
Programm 68K-Teile aufruft. Man k&ouml;nnte vielleicht in Zukunft hier
einen 68000er Emulator einsetzten statt einer eigenen CPU (Man denke an PPC
Laptops). Au&szlig;erdem sind unter WarpOS Mixed Libraries m&ouml;glich,
deren Funktionen auch als PowerPC native Code vorliegen. Ruft ein PowerPC
Programm nun eine Funktion einer solchen Bibliothek auf, wird diese ohne
Contextswitch, also mit voller Performance, ausgef&uuml;hrt. K&ouml;nnte
man das mit Systemcode machen (kann jedoch nur der machen, der die Sourcen
des Systems besitzt, also AI), kann man das Betriebssystem schrittweise
native f&uuml;r den PowerPC portieren. Das ist allerdings nur ein
Gedankenmodell und wird wohl (leider) in dieser Form nicht realisiert
werden. Ich meine aber, da&szlig; man dadurch die unterschiedlichen
Philosopien zwischen WarpOS und ppc.library erkennen kann. Die ppc.library
ist ein Steuerschnittstelle f&uuml;r PowerUp Karten, WarpOS ist eher eine
Migrationsschnittstelle. Was sich schlu&szlig; endlich durchsetzen wird,
wird die Zeit zeigen. Wom&ouml;glich geht AI ganz andere Wege, wir werden
sehen.</P>
  </TD>
  <TD>
   <CENTER>
    <A HREF="../images_01/special_mandsrc.lha">
     <FONT SIZE="-1">WarpMandel<BR>
     <IMG WIDTH=54 HEIGHT=30 SRC="../images_01/special_cdrawer.gif" ALT="[Source]" BORDER=0><BR>
     Download 70K</FONT>
    </A>
   </CENTER>
  </TD>
 </TR>
</TABLE>

<P ALIGN=CENTER><A NAME="13" HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Zum Schlu&szlig; bleibt mir nur zu sagen, da&szlig; mit dem PowerUp der
erste wichtige Schritt getan ist, um rechenintensive Programme wieder auf
den Amiga zur&uuml;ck zu bringen. Als Nebeneffekt erh&auml;lt man neben den
PowerPC ja auch noch eine schnelle 68K CPU zu einem vern&uuml;nftigen
Preis. Diese ist f&uuml;r die Bedienung des Amiga (derzeit) noch
ausreichend, der PowerPC kann in Bereiche, wo Zeit gleich Geld ist, den
Amiga wieder attraktiv machen (z.B. in der Bildbearbeitung und zum
Rendern). In einer sp&auml;teren Ausgabe m&ouml;chte ich noch einen Schritt
tiefer in die Systemintegration des PowerUp einsteigen, eventuell auch in
Form eines Workshops. F&uuml;r diese Ausgabe sollte der Ansatz und die
grundlegenden Unterschiede zwischen WarpOS und ppc.library aber ausreichend
erklärt sein um beide Systeme vorzustellen.</P>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#juergen">Jürgen Schober</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0023.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.phase5.de/">Phase5</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.haage-partner.com/">Haage&amp;Partner</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/special_mand1024x768.jpeg">PowerPC Mandel Screenshot, 1024x768, ca. 130KB</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/special_mand800x600.jpeg">PowerPC Mandel Screenshot, 800x600 - skaliert, ca. 80KB</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/special_mandsrc.lha">PowerPC/68K WarpMandel StormC-Projekt, ca. 70KB</A><BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0022.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0024.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
