<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x01 - PageStream</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0019.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0018.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x001A.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0019.html">PageStream</A> | <A HREF="0x001A.html">Turboprint</A> | <A HREF="0x001B.html">Tornado3D</A> | <A HREF="0x001C.html">The A-Files</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0013.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0014.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0015.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0016.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0017.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0019.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x001D.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x001E.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0022.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0024.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0026.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>PageStream 3.3a</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1"><A HREF="../images_01/pagestream_dat.gif"><IMG WIDTH=207 HEIGHT=151 SRC="../images_01/pagestream_menu.gif" ALT="[PageMenu]" HSPACE=10 VSPACE=15 BORDER=0 ALIGN=LEFT></A>
Eine moderne Textverarbeitung hat viele
Funktionen implementiert, die sie eigentlich schon fast zu einem
DTP-Programm werden l&auml;&szlig;t: Grafikeinbindung, Rahmen, verschiedene
M&ouml;glichkeiten zur Gestaltung des Layouts.
Ein Laie wird den Unterschied kaum bemerken, aber bereits
f&uuml;r semiprofessionelle Anwendungen reicht ein derartiges Programm
nicht mehr aus. Ohne DTP macht das keinen Spa&szlig; und ist auch (beinahe)
unrealisierbar. PageStream ist jedenfalls ein Programm aus dieser Sparte.
Es z&auml;hlt auf dem Amiga nach wie vor zur Elite und ist heute schon ein
&quot;Klassiker&quot;.</FONT><BR CLEAR=ALL>

<P ALIGN=CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>PageStream von Soft-Logik in der Version 3.3 stand diesmal zum Test. Auf
f&uuml;nf Disketten ausgeliefert findet es &uuml;ber den Standard Installer
problemlos seinen Platz auf der Festplatte. Dabei bemerkt man jedoch schon,
da&szlig; die Benutzerf&uuml;hrung ausschlie&szlig;lich in englicher
Sprache abl&auml;uft. Auch im 220 Seiten starken Handbuch findet sich kein
deutsches Wort. Es ist aber trotzdem m&ouml;glich Texte in verschiedenen
Sprachen zu erstellen. Unterst&uuml;tzt werden unter anderem: amerikanisch,
deutsch, spanisch, franz&ouml;sich, italienisch und slowenisch. Die
hauts&auml;chlich verwendete Sprache ist in den Preferences einzustellen
und beeinflu&szlig;t die Trennregeln, Seiten- und Datumsangaben. Es ist
jedoch auch kein Problem, gemischtsprachige Dokumente zu verfassen, da die
Sprache f&uuml;r beliebige Textabschnitte verschieden eingestellt werden
kann. Jedoch sind offensichtlich nur die amerikanischen Trennregeln beim
Programm dabei. Jene f&uuml;r die deutsche Sprache mu&szlig; man sich erst
selbst m&uuml;hsam zusammenstellen. Dabei gibt es offensichtlich noch
Probleme, erstens m&uuml;ssen alle W&ouml;rter klein eingegeben werden und
andererseits k&ouml;nnen offensichtlich W&ouml;rter mit Umlauten
&uuml;berhaupt nicht automatisch getrennt werden. Hier kann man sich nur
mit dem h&auml;ndischen Setzen von Trennstellen helfen.</P>

<P ALIGN=CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Neben der Sprache geh&ouml;rt der zu verwendende Bildschirmmodus und
damit die Bildschirmaufl&ouml;sung zu den wichtigsten Einstellungen, denen
man sich sofort nach dem Installieren widmen sollte. Hier reicht es jedoch
nicht blo&szlig; aus den Screen festzulegen, sondern besonders die
wirkliche Aufl&ouml;sung in DPI (dots per inch = Punkte pro Zoll) will das
Programm wissen. Dazu mu&szlig; man die Ausma&szlig;e des Bildes am Schirm
in Breite und H&ouml;he abmessen, in Zoll umrechnen (ein Zoll entspricht
2,54 cm) und durch die Anzahl der dargestellten Pixel dividieren. Durch
Angabe dieser Daten erm&ouml;glicht man PageStream einerseits die Elemente
am Bildschirm gleich gro&szlig; anzuzeigen wie sie sp&auml;ter beim
Ausdruck erscheinen und au&szlig;erdem k&ouml;nnen Seitenverzerrungen
ausgeglichen werden. Hier traten jedoch ein paar Ungereimtheiten mit
BitMap-Grafiken auf. Obwohl das Seitenverh&auml;ltnis am Bildschirm
pa&szlig;te und ein Kreis auch als solcher und nicht als Ellipse erschien,
war dieser beim Ausdruck verzerrt. Erst das Umstellen der
Bildschirmaufl&ouml;sung auf gleiche horizontale und vertikale DPI z.B.
100&times;100 ergaben beim Ausdruck einen richtigen Kreis. Jetzt war aber
die Bildschirmdarstellung verzerrt. Ein Blick auf die Soft-Logik Home Page
(<A HREF="http://www.softlogik.com/">http://www.softlogik.com</A>) zeigte,
da&szlig; es bereits einen Patch auf Version 3.3a gibt, der zahlreiche
Probleme beheben sollte. Und tats&auml;chlich, die verzerrten BitMaps
geh&ouml;ren seitdem der Vergangenheit an.</P>

<P ALIGN=CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P>Wie bei Desktop Publishing Programmen (kurz DTP) &uuml;blich widmen sich
die von PageStream zur Verf&uuml;gung gestellten Funktionen
haupts&auml;chlich der Layoutgestaltung von Dokumenten. Laut Handbuch
sollte sich das Programm vom Erstellen einfacher Flugzettel bis hin zu
dicken B&uuml;chern gleich gut eignen. Das Handbuch selbst ist laut Angaben
von Soft-Logik mit PageStream auf Macintosh- und Amiga-Computern erstellt
worden. Dabei f&auml;llt auch gleich auf, da&szlig; die darin zahlreich
verwendeten Abbildungen durchwegs eine Macintosh-Oberfl&auml;che zeigen.
Zum Gl&uuml;ck sind jedoch die entsprechenden Amiga-Fenster &auml;hnlich
aufgebaut, wodurch die Verwirrung nicht allzu gro&szlig; wird. Auch werden
die Unterschiede der Amiga-Version angef&uuml;hrt wenn dies n&ouml;tig war.
Als leidenschaftlicher TeX-Anwender mu&szlig; ich jedoch bezweifeln,
da&szlig; PageStream zum Erstellen von umfangreicheren B&uuml;chern das
optimale Programm ist. Denn dazu fehlen einfach die n&ouml;tigen
Grundvoraussetzungen. Zwar k&ouml;nnen Dokumente in Kapitel und
Unterkapitel unterteilt werden, aber dise k&ouml;nnen immer nur auf einer
neuen Seite beginnen und eine Funktion zum automatischen Erstellen von
Inhaltsverzeichnissen und Indizes sucht man vergeblich.</P>

<P>Zum Gestalten von Zeitungen, Flugzettel, Einladungen oder effektvoller
Dokumente ist man jedoch gut ger&uuml;stet. Hier bietet das Programm
interessante M&ouml;glichkeiten. So kann die Schrift in beliebigen Winkeln
auf die Seite plaziert werden und auch Spiegelschrift ist kein Problem.
Sowohl Vektor- als auch BitMap-Grafiken k&ouml;nnen beliebig platziert,
maskiert und in ihrer Gr&ouml;&szlig;e ver&auml;ndert werden. </P>

<P ALIGN=CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Import, Export</B></P>

<P>Als Vektorgrafiken k&ouml;nnen IFF-DR2D, ProDrawClip, EPS, Adobe
Illustrator EPS, Art Expression EPS, Freehand EPS sowie SoftLogfik IFF-ILUS
eingebunden werden. Bei EPS (Encapsulated PostScript) Grafiken mu&szlig;
man jedoch einige Einschr&auml;nkungen hinnehmen. Nur jene die von Art
Expression oder Adobe Illustrator erstellt wurden k&ouml;nnen in eine
PageStream-Zeichnung umgewandelt werden, soda&szlig; diese innerhalb von
PageStream editiert, angezeigt und auf Nicht-PostScript-Druckern ausgegeben
werden k&ouml;nnen. Alle anderen EPS Grafiken, z.B. solche von DrawStudio
werden am Bildschirm nur als Rechteckige Boxen angezeigt und au&szlig;erdem
ben&ouml;tigt man einen PostScript-Drucker f&uuml;r die Ausgabe. Hier kann
man sich aber im Notfall auch mit einem vorgeschaltenen
Postscript-Interpreter wie z.B. GhostScript helfen, wenn der Drucker selbst
kein PostScript kann. Grunds&auml;tzlich mu&szlig; man jedoch sagen,
da&szlig; f&uuml;r professionelles Arbeiten ein PostScript-Drucker
unumg&auml;nglich ist. Bei den BitMap-Grafiken werden IFF-ILBM, TIFF, PICT,
JPEG, GIF, MacPaint, PCX und BMP vom Programm verstanden. Exportiert
k&ouml;nnen Grafiken in den Formaten IFF-ILBM, TIFF, PICT, GIF, PCX, BMP,
IFF ILUS, IFF-DR2D, EPS und Adobe Illustrator EPS werden.</P>

<P>Beim Text-Import versteht PageStream die Formate ASCII, RTF, Wordworth,
FinalWriter, Excellence, ProWrite, WordPerfect 4.1, IFF-CTXT (PageStreams
Textformat) und IFF-FTXT. Nicht alle Formate werden jedoch vollst&auml;ndig
unterst&uuml;tzt. Beim Text-Export hat man die Auswahl zwischen ASCII, RTF,
WordWorth, IFF-CTXT und IFF-FTXT.</P>

<P>Nicht immer funktioniert jedoch das Importieren problemlos. So konnte
sogar ein mit PageStream 2.2 gespeichertes Dokument nicht richtig
importiert werden. Die Plazierung mancher Textbl&ouml;cke war falsch.</P>

<P ALIGN=CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Texte</B></P>

<P>Bei DTP-Programmen werden die Textteile eines Dokumentes
&uuml;blicherweise in sog. Textrahmen zusammengefa&szlig;t. Ein solcher
Textrahmen ist ein rechteckiger Bereich wie zum Beispiel die Spalte einer
Zeitung, innerhalb derer der Text frei flie&szlig;en kann. Das bedeutet,
da&szlig; der Zeilenumbruch innerhalb eines Absatzes vom Programm
automatisch erfolgt. Auch die Worttrennung kann man automatisch
durchf&uuml;hren lassen. &Auml;ndert sich ein solcher Textrahmen in seiner
Ausdehnung, dann wird der darin befindliche Text sofort den neuen
Gegebenheiten angepa&szlig;t. Mehrere solcher Textrahmen k&ouml;nnen
verkettet werden, soda&szlig; der Text von einem Rahmen in den
n&auml;chsten flie&szlig;en kann. So zum Beispiel von der ersten in die
zweite Spalte oder auf eine neue Seite. Solche Textrahmen k&ouml;nnen
entweder h&auml;ndisch plaziert werden oder man l&auml;&szlig;t sie sich
von PageStream automatisch anlegen. Zum Beispiel f&uuml;r ein dreispaltiges
Dokument.</P>

<P>PageStream erm&ouml;glich es jedoch auch Text au&szlig;erhalb von
Textrahmen zu platzieren. Dabei mu&szlig; man dann jedoch den Zeilenumbruch
h&auml;ndisch vornehmen. Diese Art ist oft f&uuml;r &Uuml;berschriften oder
zum Beschriften von Grafiken n&uuml;tzlich.</P>

<P>PageStream f&uuml;r den Amiga unterst&uuml;tzt drei Zeichensatzsysteme:
Compugraphic Intellifont, PostScript Type 1 (Windows oder MS-DOS-Format)
und das von fr&uuml;heren Versionen des Programms verwendete PageStream
DMF-Format. Auch Windows TrueType-Fonts k&ouml;nnen verwendet werden wenn
man sich die extra zu erwebende Font-Engine besorgt. Zahlreiche
Zeichensatzfamilien sind beim Programm enthalten, soda&szlig; man nicht
gleich auf externe Zeichensatz-Ressourcen zuzugreifen zu braucht, solange
man keine besonders ausgefallenen W&uuml;sche hat.</P>

<P ALIGN=CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Grafiken</B></P>

<P>Auch die notwenigen Funktionen zum Erstellen einfacher Vektor-Zeichungen
oder Ausschm&uuml;ckungselemente sind in PageStream bereits integriert.
Neben den obligatorischen Elementen wie Linie, Rechteck, Kreis und Ellipse
k&ouml;nnen auch Kreissegmente, Vielecke, Polygone, Sterne,
B&eacute;zier-Kurven usw. erzeugt werden. Die Linienbreite, Linienart und
die Form des Linienabschlusses k&ouml;nnen individuell eingestellt werden.
Sehr reizvoll ist es auch, soche Grafikobjekte als Textrahmen zu verwenden.
Das hei&szlig;t, da&szlig; hiermit Textrahmen beliebiger Form erzeugt
werden k&ouml;nnen innerhalb derer der Text flie&szlig;t. Auch kann man den
Text um Grafiken flie&szlig;en lassen.</P>

<P ALIGN=CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Farbe</B></P>

<P>Auch farbige Gestaltung ist kein Problem. Die Farben k&ouml;nnen nach
verschiedenen Verfahren ausgew&auml;hlt werden: RGB, CMYK, HSV, HLS und
auch PANTONE&reg;. Besitzer einer Grafikkarte k&ouml;nnen PageStream auf
einem 24-Bit Screen betreiben und so schon beim Erstellen des Dokumentes
die endg&uuml;ltige Farbwirkung sehen.</P>

<P ALIGN=CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Ausdruck</B></P>

<P>F&uuml;r das Drucken stellt PageStream eigene Treiber zur
Verf&uuml;gung, kann jedoch notfalls auch mit den Workbench-Druckertreibern
arbeiten. Eigene Treiber gibts f&uuml;r zahlreiche HP- und Epson-Modelle
sowie f&uuml;r verschiedene Fargo und Postscript-Drucker. Eine weitere
M&ouml;glichkeit ist der Ausdruck in eine IFF-ILBM-Datei.</P>

<P ALIGN=CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Bedienoberfl&auml;che</B></P>

<P>Auf einer PicassoIV-Grafikkarte bei einer Aufl&ouml;sung von
1024&times;768 Punkten und 24 Bit Farbtiefe l&auml;&szlig;t sich gut
arbeiten. F&uuml;r Dokumente mit wenig Farben oder wenn eine exakte
Farbdarstellung am Bildschirm nicht von solcher Bedeutung ist, dann kann
man z.B. auch einen Screen mit einer Aufl&ouml;sung von 1280&times;1024 und
8 Bit Farbtiefe verwenden und hat Platz f&uuml;r mehr Bedienelemente sowie
eine feiner aufgel&ouml;ste Schrift. Dabei tritt jedoch auch ein Mangel der
PageStream-Bedieneroberfl&auml;che auf: Sie ist nicht vollkommen
Font-sensitiv. Das bedeutet, da&szlig; in zahlreichen Einstellfenstern stur
der Topaz 8 Zeichensatz oder der mit PageStream mitgelieferte
SoftLogik-Font verwendet werden. Diese sind jedoch so klein, da&szlig; man
bei gr&ouml;&szlig;eren Aufl&ouml;sungen damit nicht ergonomisch arbeiten
kann. Dieses Verhalten ist eigentlich f&uuml;r ein heutiges Programm nicht
mehr tolerierbar. Ansonsten findet man sich in der Bedienoberfl&auml;che
aber schnell zurecht und man kommt bald zu seinem gew&uuml;nschten
Ergebnis. Auch eine Online-Hilfe im HTML-Format sammt zugeh&ouml;rigem
Anzeigeprogramm ist vorhanden. Zahlreiche Werkzeugleisten und nichtmodale
Auswahlfenster k&ouml;nnen immer aufgeblendet bleiben und erm&ouml;glichen
eine schnelle Auswahl der gew&uuml;nschten Funktion. Nat&uuml;rlich
existiert auch eine ARexx-Schnittstelle und einige Skripts sind bereits
enthalten. Diese k&ouml;nnen komfortabel &uuml;ber ein eigenes Fenster
gestartet werden.</P>

<P>Die Stabilit&auml;t des Programms ist recht hoch. Nur gelegentlich kam
es zu Abst&uuml;rzen. Nach der Installation des Patches auf die Version
3.3a verschwanden auch diese. Jedoch kommt es jetzt bei einer expliziten
Bildschirmaktualisierung mit der F10-Taste gelegentlich zum
vollst&auml;ndigen H&auml;ngen des Programms. Gl&uuml;cklicherweise besitzt
PageStream die M&ouml;glichkeit in bestimmten Zeitintervallen automatisch
zu sichern, soda&szlig; im Fall eines Absturzes nicht alles verloren
ist.</P>

<P ALIGN=CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Geschwindigkeit</B></P>

<P>Soft-Logik empfielt f&uuml;r das Programm einen AGA-Amiga mit einem
68060 Prozessor, AmigaOS 3.1, 8 MB RAM und 8 MB oder mehr freien
Festplattenplatz. Au&szlig;erdem wird ein PostScript-Drucker f&uuml;r die
Ausgabe empfolen. Jedoch kann man auch mit Systemen weniger Leistung noch
vern&uuml;nftig arbeiten, wenn man nicht zu aufwendiges vor hat. Als
Mindestanforderung wird ein Rechner mit 68000 Prozessor, AmigaOS 2.04, 4 MB
RAM und 4 MB freien Festplattenplatz angegeben.</P>

<P>Das Eingeben von Text direkt in PageStream ist auch mit einem 68060
Prozessor z&auml;h. Deshalb sollte man seinen Text zuerst im mitgelieferten
Editor PageLiner verfassen und dann zur Formatierung in PageStream
&uuml;bernehmen.</P>

<P ALIGN=CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Fazit</B></P>

<P>Aufgrund seiner zahlreichen Funktionen die hier nur zu einem geringen
Teil angesprochen werden konnten, ist das Programm f&uuml;r jeden, der
aufwendige und professionelle Dokumente h&ouml;chster Qualit&auml;t
gestalten will zu empfehlen auch wenn es in manchen Bereichen wie der
Sprachunterst&uuml;tzung noch einige M&auml;ngel gibt
(Rechtschreibpr&uuml;fung und Trennmuster nur auf amerikanisch enthalten).
Auch eine Font-sensitive Oberfl&auml;che w&auml;re w&uuml;nschenswert.</P>

<P ALIGN=CENTER><A NAME="12" HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<TT>
<BR>Ausstattung der Testrechner:
<BR>
<A HREF="../images_01/pagestream_text.gif"><IMG WIDTH=216 HEIGHT=281 SRC="../images_01/pagestream_oval.gif" ALT="[PageOval]" HSPACE=30 BORDER=0 ALIGN=RIGHT></A>
<BR>Amiga 4000, AmigaOS 3.1
<BR>Prozessorkarte CyberStorm MK II, MC 68060, 50MHz
<BR>2 MB Chip, 16 MB Fast RAM
<BR>4 GB SCSI-II Festplatte
<BR>Picasso IV Grafikkarte, Picasso 96 Treibersoftware
<BR>Ariadne Netzwerkkarte
<BR>A2368 SX Br&uuml;ckenkarte
<BR>
<BR>Amiga 4000, Amiga OS 3.0
<BR>Prozessor MC 68040, 25 MHz
<BR>2 MB Chip, 16 MB Fast RAM
<BR>1 GB IDE Festplatte
<BR>CyberVision 64 Grafikkarte, Picasso 96 Treibersoftware
<BR>A2065 Netzwerkkarte
<BR>
<BR>CD&#179;&#178; mit SX 32, Amiga OS 3.1
<BR>2 MB Chip, 8 MB Fast RAM
<BR>170 MB IDE Festplatte
<BR>
<BR>
<BR>Verwendete Drucker:
<BR>
<BR>HP LaserJet 5MP (PostScript Level 2 sowie PCL 5)
<BR>Epson Sylus Color 400
</TT>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#thomas">Thomas &Ouml;llinger</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0019.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.softlogik.com/">SoftLogic</A> Homepage<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/pagestream_text.gif">Seitenlayout</A> mit PageStream<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/pagestream_dat.gif">Kassettenbeschriftung</A> f&uuml;r DATs und MCs<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/pagestream_kassette.lha">Kassettenbeschriftung</A> zum Downloaden (shift-click!)<BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0018.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x001A.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
