<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x01 - Pablo IV</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0017.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0016.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0018.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=148 HEIGHT=25 SRC="../images/_hardware_.gif" ALT="[Hardware]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0017.html">Pablo IV</A> | <A HREF="0x0018.html">iiyama MT-9017T</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0013.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0014.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0015.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0016.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0017.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0019.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x001D.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x001E.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0022.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0024.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0026.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Pablo IV</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Wie auch schon f&uuml;r die gute alte Picasso
II gibt es jetzt auch einen Pablo fuer die Picasso IV. Mitte Dezember
konnten wir eines der ersten Exemplare mit Videodaten f&uuml;ttern.
</FONT><BR>

<P ALIGN=CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Es weihnachtet sehr...</B></P>

<P>Es war ein sch&ouml;nes Packerl von VillageTronic per Nachnahme (die
&ouml;sterreichische Post ist auch nicht mehr das, was sie mal war: rechnen
245 DM mit 1374 ATS um, tststs :-))) ), drin war eine Mini-Platine und viel
Papier.</P>

<P>Brav wie ich bin, lese ich zuerst das Manual (engl./dt. kombiniert) und
fang' gleich zum Suchen an: kein Y/C-FBAS-Adapterkabel und keine
Regristrierungskarte. Der Rest, Pablo, Handbuch und Installdiskette, ist
aber vorhanden. Zus&auml;tzlich ist ein Zettel dabei, auf dem steht, wie
man sich ein SVHS-auf-FBAS-Kabel selber schnitzen kann.</P>

<P>Aber: Rein mechanisch pa&szlig;t das Ding gar nicht auf die PIV, weil
&uuml;ber dem zentralen Chip auf dem Pablo ein gro&szlig;es St&uuml;ck Alu
pickt, da&szlig; sich mit dem Elko, der auf der PIV direkt drunter ist,
bei&szlig;t. Schlecht!</P>

<P>Es kostet einige &Uuml;berwindung, auf der ebenfalls neuen PIV gleich
zum L&ouml;ten anzufangen (es ist eigentlich nur der stehende Elko
umzubiegen oder durch einen liegenden gleicher Kapazit&auml;t zu ersetzen),
aber auch andere Leute konnten sich schon &uuml;berwinden und die Karten
haben es &uuml;berlebt...</P>

<P>Nat&uuml;rlich macht sowas keine guten Eindruck, aber das ganze Packerl
scheint eine Alpha-Version zu sein, da auch die Au&szlig;enaufschrift nur
aus einer beigelegten Kopie besteht...</P>

<P ALIGN=CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Innereien</B></P>

<P>Ganz anders hingegen die ja eigentlich alleinig wichtigen
F&auml;higkeiten dieses Add-Ons: der SVHS-Ausgang auf der PicassoIV wird
aktiviert und bei entsprechend eingestelltem Screenmode erscheint an einem
angeschlossenen Monitor auch ein sch&ouml;nes Bild. Das hat sogar etwas mit
dem gemeinsam, was man auf dem Monitor zu sehen gewohnt ist.</P>

<P>Bevor man allerdings in den Screenmode-Preferences geeignete Modi
ausw&auml;hlen kann, mu&szlig; erst die dazugeh&ouml;rige Software installiert
werden. Dank Commodores genialem Installer ist das aber keine Hexerei.
Sollte das FlashROM auf der PicassoIV noch eine &auml;ltere Version beinhalten,
wird es gleich erneuert, damit der Pablo auch von der PicassoIV erkannt
wird. Ebenso mu&szlig; mindestens V1.27 von Picasso96 installiert sein,
damit die softwareseitige Einbindung des Pablo funktioniert.</P>

<P>Mit dem neuen FlashROM-Inhalt hat man auch gleich ein neues
Bootmen&uuml; gewonnen: H&auml;lt man beim Systemstart oder bei einem Reset
eine Shift-Taste gedr&uuml;ckt, erscheint ein Men&uuml; der PicassoIV, in
dem man unter anderem die Grunddaten des Pablo einstellen, sowie den
eingebauten Flickerfixer auf Default-Werte zur&uuml;cksetzen kann. Sollte
auch noch eine Concierto oder sonstiges auf der PIV stecken, so gibt es
daf&uuml;r eigene Untermen&uuml;s.</P>

<P>Im Preferences-Verzeichnis kommt ein neues Programm f&uuml;r den Pablo
dazu. Das bietet genau die gleichen M&ouml;glichkeiten wie das
entsprechende Untermen&uuml; im PIV-Bootmen&uuml;: Auswahl der
gew&uuml;nschten Ausgabenorm (PAL B/G/I, PAL M, NTSC, NTSC-EIA) und Wahl
der Signalart (SVHS, FBAS). Zus&auml;tzlich besteht die M&ouml;glichkeit,
zur Flimmerverminderung eine lineare Interpolation &uuml;ber 2 oder 3
Zeilen durchzuf&uuml;hren, die aber klarerweise z.B. Schrift stark
verschwimmen l&auml;&szlig;t. Ebenfalls kann man die Position des
dargestellten Bildes verschieben. Sollte das Bild zu hell oder zu dunkel
sein, lassen sich auch noch Lastwiderst&auml;nde an den RGB-Leitungen
dazuschalten. Zu guter Letzt kann man auch ein Farb- oder
Graustufentestbild darstellen.</P>

<P ALIGN=CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Farbkleckse</B></P>

<P>Die Modi f&uuml;r den Pablo stehen nach einem Reset ganz normal zur Auswahl
zur Verf&uuml;gung. Wer das Klacken eines Relais wie bei der PicassoII bei
der PicassoIV schon vermi&szlig;t hat, kommt mit dem Pablo wieder in den
Genu&szlig; sanfter Mechanik: denn nur wenn der ausgew&auml;hlte Screenmode
vom Pablo darstellbar ist, wird das Signal an den Ausgang
durchgeschaltet.</P>

<P>Die Aufl&ouml;sung betr&auml;gt grunds&auml;tzlich 640x480, nur in PAL
B/G/I gibt es einen Overscan-Modus mit 800x600 Pixeln, der auch wirklich
den Bildschirm voll ausf&uuml;llt, sollte nicht irgendsoein dahergelaufener
Bastler die Bildgeometrie am Fernseher verstellt haben....</P>

<P>L&auml;uft der Amiga im PAL-Modus (eingestellt im Bootmen&uuml; oder per
Jumper am Motherboard), stellt der Pablo auch nur den PicassoIV:PAL-Modus
dar, genauso im NTSC-Modus. Die Darstellung kann in bis zu 24 Bit erfolgen,
es sind also TrueColor-Anims ganz einfach mit einem Videorecorder
aufnehmbar.</P>

<P>Die Qualit&auml;t des Ausgangssignals ist f&uuml;r den Heimgebrauch auf
jeden Fall schon fast zu gut, denn sogar bei meiner Testkonfiguration
(Pablo -&gt; <A HREF="http://www.cis.tu-graz.ac.at/home/r/rockus/Amiga/SVHS2FBAS.html">Adapterkabel</A>
auf Cinch -&gt; Videorecorder -&gt; Antennenkabel -&gt;
Fernseher) konnte in PAL Overscan (eben diese 800x600-Aufl&ouml;sung) topaz
8-Schrift am Fernseher einwandfrei entziffert werden. Es ist nat&uuml;rlich
unscharf, aber bei diesem Signalweg durchaus verst&auml;ndlich.</P>

<P>Die Interpolation zur Flimmervermeidung funktioniert einwandfrei, sie
ist ja auch in der Hardware implementiert, natuerlich mit dem Nebeneffekt,
da&szlig; das Ganze unsch&auml;rfer wird...</P>

<P>Da die mitgelieferten Versionen der Software (P96 und PicassoModeTNG)
nun doch zu alt waren, installierte ich gleich eine neue Version beider
Teile dr&uuml;ber und mu&szlig;te mit Verwundern feststellen, da&szlig;
meine Pablo-Modi verschwunden waren. Erst eine Neuinstallation von der
Pablo-Disk brachte sie wieder zutage. Schuld daran war, da&szlig; ich bei
der Installation von P96 ein Update der Screenmodi-Datenbank angew&auml;hlt
habe und somit die gespeicherten Modi verloren gingen. Tja, wohl selber
schuld...</P>

<P>Sowohl mit Picasso96Mode als auch mit PicassoModeTNG lassen sich die
Pablo-Modi anw&auml;hlen und bearbeiten (naja, eigentlich sind fast alle
Parameter gesperrt, denn w&uuml;rde man diese &auml;ndern, h&auml;tte man
kein der Norm entsprechendes Signal mehr). Interessanterweise k&ouml;nnte
man mit Picasso96Mode die Parameter doch ver&auml;ndern, denn dieses
Programm kennt keinen Pablo und sieht die Eintr&auml;ge als normale
Screenmodi an. Hier ist also Vorsicht geboten. Daf&uuml;r lassen sich mit
PicassoModeTNG die Namen der Screenmodi nicht nach eigenen W&uuml;nschen
anpassen, zumindest habe ich es nicht fertiggebracht, dem Programm
beizubringen, da&szlig; es die neuen Modi so abspeichern soll, da&szlig;
sie nach einem Reset in Screenmode zur Verf&uuml;gung stehen...</P>

<P ALIGN=CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Buchstabensalat</B></P>

<P>Das Handbuch pr&auml;sentiert sich in VillageTronic-&uuml;blicher
Machart mit Spiralbindung. Die erste H&auml;lfte enth&auml;lt den
englischen Teil, danach ist die deutsche Version des Handbuchs
eingebunden.</P>

<P>Sowohl einige Grundlagen &uuml;ber Fernsehnormen, warum zum Beispiel
kein SECAM darstellbar ist, als auch die Einbau- und
Installationsanleitungen sind klar und strukturiert aufgebaut und auch
f&uuml;r Elektronik-Laien gut verst&auml;ndlich. Das Ganze wird von einer
Liste m&ouml;glicher Fehler und deren Behebung abgeschlossen, so da&szlig;
man mit dem Pablo eigentlich nur seine Freude haben wird k&ouml;nnen.</P>

<P>Was bleibt viel zu sagen? Pablo angesteckt, eingeschaltet, funktioniert.
Einfach sch&ouml;n! Mit diesem kleinen St&uuml;ck &quot;Platine mit Klumpat
drauf&quot; hat Village Tronic den Weg, den sie beim Pablo f&uuml;r die
PicassoII gegangen sind, konsequent fortgesetzt und ein ordentliches
St&uuml;ck Hardware produziert!</P>

<P ALIGN=CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Visionen</B></P>

<P>Wird es denn einmal eine Paloma geben, so kann man auch Videodaten
einlesen und somit wird (zumindest lt. Pablo-Handbuch) aus der PicassoIV
ein digitales Genlock, das als &quot;kleines&quot; Goodie auch Normwandlungen
durchf&uuml;hren k&ouml;nnen soll. Vor allem aufgrund der
hardwarem&auml;&szlig;ig implementierten Interpolations-Funktion
d&uuml;rften NTSC-to-PAL-Wandlungen somit von ansprechender Qualit&auml;t
sein. Sobald dieses weitere Add-On erh&auml;ltlich sein wird
(voraussichtlich Mitte Februar 1998), folgt ein Bericht hier in der
AmigaScene.</P>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0017.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.villagetronic.com/amiga/">VillageTronic</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.villagetronic.com/amiga/piv/">Picasso IV</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.villagetronic.com/amiga/pabloiv/">Pablo IV</A>
<A HREF="../images_01/pabloiv.jpeg"><IMG WIDTH=170 HEIGHT=60 SRC="../images_01/pabloiv_small.jpeg" ALT="[PabloIV]" ALIGN=RIGHT BORDER=0 HSPACE=30></A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://wwwcip.rus.uni-stuttgart.de/~etk10317/picasso96/">Picasso 96</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="mailto:support@village.de">Support</A> f&uuml;r VillageTronic-Produkte<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="mailto:jschober@pointdesign.com">Bestellungen</A> von VillageTronic-Produkten<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_01/pabloiv.jpeg">PabloIV-Platine</A><BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0016.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0018.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
