

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Fubar - immerhin schonmal der Soundtrack!</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="GREEN">Preview: Fubar - Original
Soundtrack</FONT></CENTER></h1></P><CENTER>
<img src="fubars.jpg"></P></CENTER>
<FONT SIZE="+1">
Q-Lab, die sich bisher nur f&#252;r die Musik in verschiedenen Games
verantwortlich zeichneten (u.a. Zombie Massacre), sind jetzt auch selber
aktiv unter die Spieleherrsteller gegangen. Ein Game, zu dem sie &quot;nur&quot; die
Musik beisteuerten ist Fubar, das zwar noch nicht erh&#228;ltlich ist, aber
anhand der Screenshots bzw. Demoversion schonmal einiges vermuten l&#228;&#223;t. Erh&#228;ltlich dagegen
ist immerhin schonmal der Soundtrack dazu.</P>

Das ganze wird auf einer selbst gebrannten CD ausgeliefert und enth&#228;lt
immerhin satte 17 Tracks:</P>
<ul>
<li>1. Take No Prisoners (Fubar Title Music)<BR>
<li>2. Fubar Loading Music<BR>
<li>3. Strategy Music 1<BR>
<li>4. Battle Music 1 - Part A<BR>
<li>5. Battle Music 1 - Part B<BR>
<li>6. Battle Music 1 - Part C<BR>
<li>7. Fubar<BR>
<li>8. Battle Music 2 - Part A<BR>
<li>9. Battle Music 2 - Part B<BR>
<li>10. Strategy Music 2 <BR>
<li>11. Fly - By<BR>
<li>12. Battle Music 3 - Part A<BR>
<li>13. Battle Music 3 - Part B<BR>
<li>14. Strategy Music 3<BR>
<li>15. Fubar - Remix<BR>
<li>16. Strategy Music 4<BR>
<li>17. Take No Prisoners - Remix</P>
</UL>
Wie es sich f&#252;r ein Spiel (bzw. dessen Soundtrack) geh&#246;rt, ist ein Gro&#223;teil
der Musik instrumental gehalten. Ausnahmen (z.B. &quot;Fubar&quot;) sind zwar
ebenfalls vertreten, bilden aber die deutliche Minderheit.</P>

Aber kommen wir nun zu der Musik selber: Wie man evtl. teilweise schon den
verschiedenen Titeln entnehmen kann, geht es mal hektischer und mal
entspannter zu Werke. So ist die erste Triologie der &quot;Battle Music&quot;
(Tracks 4-6) etwas d&#252;sterer gehalten und d&#252;rfte f&#252;r ein
Echtzeitstrategiegame (was Fubar ja ist) genau angemessen sein. Der zweite
Teil der &quot;Battle Music&quot; (Tracks 8 &amp; 9) f&#228;llt da schon etwas positiver aus
und vermittelt, auch durch die Klassischen Instrumente, eine Art
Aufbruchstimmung. Der letzte Teil der &quot;Battle Music&quot; (12 &amp; 13) stellt
schlie&#223;lich eine abwechselungsreiche Mischung aus den ersten beiden Teilen
dar.</P>

Leider ist die Battle Music (alle Tracks zusammen), zumindest in meinen
Augen, das beste auf dieser CD, was mit h&#246;chster Wahrscheinlichkeit daran
liegt, da&#223; man hierbei nicht so stark die Computer Einfl&#252;sse (Samples, Loops
etc.) raush&#246;rt. Zum anderen kommt bei der &quot;Battle Music&quot; wenigstens eine
gewisse Atmosph&#228;re r&#252;ber; will sagen, da&#223; man sich die Musik in einem
Echtzeitstrategiegame vorstellen kann.</P>

Selbiges gilt definitiv nicht f&#252;r den Rest: Die Title Music (genau wie
dessen Remix)  mag zwar noch als passabel durchgehen, aber s&#228;mtliche Teile
der &quot;Strategy Music&quot; (Tracks 3, 10, 14 &amp; 16) sind viel zu hektisch und
Techno lastig und lassen demzufolge keine richtige Atmosph&#228;re aufkommen.
Da das ganze teilweise noch mit einigen Sprachsamples in durchschnittlicher
Qualit&#228;t unterlegt ist, wird der Zuh&#246;rer eher abgelenkt (ging zumindest mir
so). Und dies kann f&#252;r ein Computergame wohl kaum von Vorteil sein. Und als
besonders eing&#228;ngig kann man die &quot;Strategy Music&quot; auch nicht bezeichnen.</P>

Auch das noch &#252;briggebliebene weitere Material  macht in dieser Hinsicht (fast) keine
Ausnahme: Die &quot;Loading Music&quot;, die immerhin fast 2 Minuten lang ist (fragt
sich, wielange das Laden wohl dauert?), ist auf Dauer einfach nur nervend,
ebenso wie &quot;Fubar&quot; (das einzigste St&#252;ck, das nicht von Will Morton, sondern
von &quot;The Unchosen&quot; komponiert wurde).</P>

Die einzigste Ausnahme findet man in &quot;Fly-By&quot;, dem 11.Track der CD. Diese,
leider nur 1:30 lange Komposition, h&#246;rt sich recht anst&#228;ndig an.
Offensichtlich ist bei &quot;Fly-By&quot; aber auch, da&#223; sich der Komponist wohl bei
&quot;Turrican II&quot; (&#228;lteres Ballergame mit Musik von Chris H&#252;lsbeck) bedient hat.
Vielleicht r&#252;hrt meine Symphatie zu &quot;Fly-By&quot; gerade daher (immerhin habe ich
&quot;Turrican II&quot; damals n&#228;chtelang gespielt)??
Wie dem auch sei: Als Untermalung für eine Zwischensequenz dürfte "Fly-By" hervorragend geeignet sein.</P>

<h2><CENTER><FONT COLOR="YELLOW">Fazit:</FONT></h2></CENTER></P><FONT
SIZE="+1">
Auf der knapp 42 min&#252;tigen CD befindet sich, zumindest ansatzweise, gut
gemachte Musik. Leider sind auch einige Aussetzer vertreten, die das
ansonsten positive Bild der CD wieder kaputt machen. Wenn man die CD also
unter dem Aspekt, f&#252;r ein Computerspiel gemacht worden zu sein, betrachtet,
gibt es ein zwiesp&#228;ltiges Bild: Auf der einen Seite hebt sich die Musik
deutlich von den 08 / 15 Produktionen anderer Games ab, aber auf der anderen
Seite sind auch einige Aussetzer vertreten. Somit hoffe ich mal, da&#223; in
einigen Bereichen noch nachgebessert wird, denn das Potential ist allemal
vorhanden. Warten wir mal auf das endg&#252;ltige Release von Fubar....</P>






<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
