



<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Sound Stream Volume I - Die CD für Musiker?</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="YELLOW">Sound Stream - Volume
I</FONT></h1></P>
<img src="sslogo.jpg"></P><BR>
<img src="sslogo2.jpg"></P><BR></CENTER>
Ebenso wie die ebenfalls in dieser NC getestete Soundtrack CD zu &quot;Fubar&quot;,
wurde auch &quot;Sound Stream - Volume I&quot; von der britischen Firma Q-Lab
hergestellt. Wie schon der Soudntrack zu &quot;Fubar&quot; wird auch &quot;Sound Stream -
Volume I&quot; auf einer selbstgebrannten CD in einem selbtsgestalteten
Tray geliefert.</P>

<h2><CENTER><FONT COLOR="GREEN">Worum geht`s?</FONT></CENTER></h2></P>
Wie man wahrscheinlich schon dem CD Namen entnehmen kann, handelt es sich
bei der vorliegenden CD um eine Sound CD, die massig Samples enth&#228;lt. Diese
Samples k&#246;nnen dann in den verschiedenen Trackerprogrammen (z.B. Octa Med)
eingearbeitet und weiter benutzt werden. Wer schonmal Techno, wo viel mit
Samples gearbeitet wird, geh&#246;rt hat, wei&#223;, worum es in etwa geht. Quasi als
Bonus hat Q-Lab auch noch eine 340 KB umfassenden HTML Dokumentation /
Inhaltsauflistung auf die CD gepackt, die auch einige Tips &amp; Tricks zum
sampeln bereith&#228;lt. Leider ist diese nur in englischer Sprache vorhanden und
wer sich noch nicht so gut in der Materie auskennt, dem wird das ganze
leider auch nicht sonderlich weiterhelfen.</P>

<h2><CENTER><FONT COLOR="WHITE">Der Inhalt der
Silberscheibe</FONT></CENTER></h2></P>
Um Mi&#223;verst&#228;ndnissen gleich vorzubeugen: Q-Lab haben alle Samples in Audio
Spuren untergebracht, die dann vom User selber runtergesampelt werden
m&#252;ssen, um diese im Computer weiterzuverwenden. Leider hat man es vers&#228;umt,
entsprechende Tools beizulegen, so da&#223; Anf&#228;nger bald ratlos im Regen stehen
werden. Es stellt sich also die Frage, warum man nicht alle Samples gleich im IFF, AIFF, WAV oder
MPEG Format auf die CD kopiert hat; so muss der User erst selbst Hand
anlegen und es darf somit auch mit einem kleinen Qualit&#228;tsverlust gerechnet
werden. Wie dem auch sei, die CD enth&#228;lt insgesamt 39 Tracks, wobei der
allererste f&#252;r den oben schon erw&#228;hnten Computerdatentrack mit der HTML
Dokumentation reserviert ist. Dieser darf auf keinen Fall in einem herkömlichen Cd Player abgespielt werden (!!!).</P>
Insgesamt enth&#228;lt die fast eine Stunde
umfassende CD Samples mit den folgenden Namen:</P><BR><CENTER>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>Sound Stream - Volume I Inhalt</B></H2></CAPTION><TR>
</TR><TR>
<TD>Track 1</TD>
<TD>Computerdaten</TD>
</TR>
<TR>
<TD>Tracks 2-5</TD>
<TD>Ambient Textures 1-4</TD>
</TR>
<TR>
<TD>Tracks 6-9</TD>
<TD>Analogue Sounds 1-120</TD>
</TR>
<TR>
<TD>Tracks 10-16</TD>
<TD>Analogue Arpeggio 1-7 </TD>
</TR>
<TR>
<TD>Track 17</TD>
<TD>Distorted Guitar Chords</TD>
</TR>
<TR>
<TD>Tracks 18 & 19</TD>
<TD>Leads 1-20</TD>
</TR>
<TR>
<TD>Tracks 20-24</TD>
<TD>Pads 1-60</TD>
</TR>
<TR>
<TD>Tracks 25-29</TD>
<TD>Robotic Breaks 1-50</TD>
</TR>
<TR>
<TD>Track 30</TD>
<TD>Spacey Hi-Hat Loops</TD>
</TR>
<TR>
<TD>Tracks 31-37</TD>
<TD>Live Drum Loop 1-7</TD>
</TR>
<TR>
<TD>Track 38</TD>
<TD>Assorted Live Drum Samples</TD>
</TR>
<TR>
<TD>Track 39</TD>
<TD>Live Drum Fills</TD>
</TR>
</TABLE></CENTER></P><BR>


Angemerkt sei an dieser Stelle noch, da&#223; ein Gro&#223;teil der Tracks (z.B. Live
Drum Loop), mehrere Samples enth&#228;lt, was das runtersampeln wieder etwas
schwieriger werden l&#228;sst.</P> 

Die Qualit&#228;t der Samples ist (erwartungsgem&#228;&#223;) recht gut ausgefallen, auch
wenn sich einige Samples teilweise wiederholen bzw. sich recht &#228;hnlich sind;
Ausf&#228;lle waren auf jeden Fall nicht auszumachen.</P>

<h2><CENTER><FONT COLOR="RED">Die Frage nach dem
Sinn</FONT></h2></CENTER></P>
&quot;Das alles ist ja sch&#246;n und gut&quot; werden jetzt einige sagen, &quot;aber was n&#252;tzt
mir das in der Praxis?&quot;. Diese Frage ist sicherlich berechtigt und ich will
im folgenden versuchen, darauf mal einzugehen.

Zun&#228;chst einmal sollte jedem klar sein, da&#223; ein &quot;normaler&quot; User, der mit dem
Thema &quot;Soundbearbeitung&quot; nichts am Hut hat, mit &quot;Sound Stream - Volume I&quot;
absolut nichts anfangen kann. Wer aber z.B. Videobearbeitung am Amiga
betreibt und eine passende Sounduntermalung sucht, der wird auf dieser CD
sicherlich f&#252;ndig (z.B. bei den Ambient Textures). Selbiges gilt nat&#252;rlich
auch f&#252;r Animationsfreaks, denn schlie&#223;lich rundet erst ein gelungener Sound
ein Video bzw. eine Animation ab.</P>

Auch f&#252;r Musiker (z.B. Vertonung eines Computergames), die auf Techno stehen, d&#252;rfte diese CD sehr viel
interessantes Material bieten, das sicherlich f&#252;r die eine oder andere
Komposition reichen d&#252;rfte. Nat&#252;rlich sollte man sich in diesem Fall schon
etwas in der Materie auskennen und in der Lage sein, einen Tracker wie
OctaMed richtig zu bedienen. Wer sich (musikalisch gesehen) darunter jetzt absolut nichts vorstellen kann, der soll
bei Gelegenheit mal im Aminet im Verzeichniss &quot;mods&quot;
nachschauen.</P>

Schlussendlich macht es auch irgendwo Spa&#223;, ein wenig mit all den Samples
rumzuspielen und das eine oder andere einfach mal auszuprobieren. Nat&#252;rlich
ist dies nicht jedermans Sache, aber wer etwas expermentierfreudig ist, der
wird sicherlich nach kurzer Zeit einige sch&#246;ne Sachen mit den Samples angestellt
haben, um z.B. seine WB klangtechnisch etwas aufzupeppen (ein Ger&#228;usch beim
l&#246;schen, ein anderes beim kopieren etc.).</P>

<h2><CENTER><FONT COLOR="GRAY">Fazit:</FONT></CENTER></h2></P>
Sicherlich ist diese Sound CD nur f&#252;r einen kleinen Kreis von Usern
interessant. Der Zocker wird die erste &quot;Sound Stream&quot; CD genauso wenig
brauchen, wie der lediglich an Office Arbeiten interessierte User. F&#252;r
diejenigen, die schon immer etwas mit Sound zu tun hatten und auf der Suche
nach neuem Material sind, stellt diese CD sicherlich eine interessante
Investition dar. Negativ ist nur, da&#223; die Samples im Audio Format vorliegen
und der User so alles selber sampeln darf; ansonsten ist die CD auf jeden
Fall gelungen!</P>

Anmerkung: Bei der mir vorliegenden Version handelt es sich um eine Promo
CD, die nicht unbedingt mit der (hoffentlich) bald erscheinenden, regul&#228;ren
CD identisch sein muss. Somit kann ich leider auch keine Angaben zum Preis machen.
 </P>












<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
