<html>
<head>
<title>Re: Dikussion / Thowins erkl&auml;render Rat f&uuml;r alle Besorgten</title>
</head>
<body background="indypattern.gif" text="white">
<table width="100%">
<tr><td><i><font color="khaki">best viewed with IBrowse or AWeb</font></i></td>
    <td align="right"><i><font color="khaki">geschrieben vom <a href="mitglieder/cschmidt.html">Indy</a></font></i></td>
</tr>
</table>
<br><p><br><p><br><p>
<p align="right">
<table width="90%"><tr><td>
<font size="+1">
Ich m&ouml;chte hier nicht weiter auf die Details Deines Artikels eingehen - aber
zwei Sachen m&ouml;chte schon mal anmerken:
<br><p>
<b>1.&nbsp; Pornographie</b>&nbsp; hat in der Nocover (mal abgesehen davon, da&szlig; ich noch nie welche in unserem
   Clubmag gesehen/gelesen hatte) nun wirklich nichts zu suchen, denn das w&uuml;rde dem
   Niveau auf dem sie sich befindet empfindlich schaden. Genauso wie es f&uuml;r den Club ein
   gro&szlig;er Image Verlust w&auml;re (verge&szlig;t bitte nicht: WIR sind der gr&ouml;&szlig;te Amiga Club in deutschen Landen
   und haben somit auch eine gewisse "Vorbild-Funktion"!).</br>
   Und das der Andi "Angst" vor Vati Staat hat, ist (jetzt) durchaus verts&auml;ndlich! Durch unsere
   Website auf der ja die NC von jedermann abrufbar ist, wird auch ein gr&ouml;&szlig;eres Publikum erreicht.
   Und unser Webspace Provider wird wohl auch immer mal nach dem rechten sehen - da kann man
   absolut sicher sein! (Dies gillt nicht nur f&uuml;r diesen Punkt sondern auch f&uuml;r das BEWERTEN von
   indizierten Spielen.)<br><p><br><p>

<b>2. Zu den Tests von verbotenen Spielen:</b>&nbsp; Ihr alle werdet die "c't" aus dem Heise Verlag kennen. (F&uuml;r
   alle die das nicht tun: Die c't ist das (nach der Computer Bild) auflagenst&auml;rkste PC Mag in
   Deutschland.) In ihr wird die Leistungsf&auml;higkeit von GraKas, CPUs und komplett Systemen nicht nur mit Benchmarks
   getestet, sondern auch mit den Spielen Quake I und Quake II. In der Ausgabe 2/99 war ein 15-Seiten
   Test &uuml;ber Graphikkarten abgedruckt. Abgesehen davon das, wie oben schon erw&auml;hnt, beide Quake Teile
   zur Leistungsbewertung der Graphikkarten herangezogen wurden, wurde auch ein Screenshoot von QuakeIII
   mit folgender Unterschrift abgedruckt.<br><p>
</td></tr>
<tr><td bgcolor="gray"><font color="black">
   "Das angek&uuml;ndigte QuakeIII &nbsp;<b>gl&auml;nzt</b>&nbsp; mit 'Curved Surfaces' und volumetrischem Nebel. Letzterer bewirkt,
   da&szlig; leuchtende Objekte auf gr&ouml;&szlig;ere Entfernung diffus erscheinen."
</td></tr>
<tr><td>
<font size="+1">
<br><p>
    Die c't hat weder f&uuml;r die Erw&auml;hnung der ID-Software Spiele, noch f&uuml;r den Screenshoot von Quake III
    (und dessen Anpreisung) einen "auf den Deckel bekommen".<br><p>

    Also braucht niemand Angst zu haben, wenn er hier schreibt, das Quake wunderbar auf seinem
    Rechner l&auml;uft (z.B. von der Graphik oder dem Sound her). Was aber niemand schreiben darf, ist wie
    toll er Quake doch findet, da dies WERBUNG f&uuml;r ein im Grunde verbotenes Spiel ist. Wobei verboten
    auch wieder nicht stimmt, da es f&uuml;r Erwachsene (18+) gekauft und somit auch gespielt werden darf.
    Theoretisch darf auch ich mir Quake (mit Zustimmung meiner Eltern oder im beisein der selbigen) kaufen.
    (hab' ich jedenfalls geh&ouml;rt...). Es w&auml;re z.B. nicht veboten f&uuml;r Quake in der NC Werbung zu machen,
    wenn sie nur von Erwachsenen gelesen werden k&ouml;nnte. DIES IST ABER NICHT DER FALL!!<br><p>

Wollte ich nur mal schnell loswerden...<br><p>
</tr></td>
</table>
</body>
</html>
