



<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Phönix Fighters Preview</TITLE>
</HEAD>
<BODY TEXT=black background="kback.png" link=red alink=red>
<h1><CENTER>Phönix Fighters Preview</h1></P><BR>
<HR><img src="phönixb.png"></P><BR>
<HR>
</CENTER><FONT SIZE="+1">
In den fr&#252;hen und sp&#228;ten 80er Jahren waren Spiele angesagt, die
einerseits sehr einfach zu bedienen waren und weniger Tiefgang hatten, aber
daf&#252;r regelrecht s&#252;chtig machten. Als Beispiel daf&#252;r seien einfach mal
Pacman und Tetris genannt. In dieser Zeit entstand auch die Idee zum Spiel
&quot;Gravity Force&quot; (davon tummeln sich heutzutage tausende von Clones im Aminet).
Ph&#246;nix Fighters ist praktisch eine &quot;Weiterentwicklung&quot; dieses Spielprinzips,
welche bald das Licht der Welt erblicken wird.</P>

F&#252;r die, die das Spielprinip nicht kennen: Der Spieler steuert ein
Raumschiff, das bestimmte Missionen zu erf&#252;llen hat (z.B. transportieren Sie
Ware A von Punkt X nach Punkt Y). Erschwert wird das zum einen durch
nat&#252;rliche Hindernisse wie W&#228;nde, die man nicht ber&#252;hren darf und zum
anderen durch k&#252;nstliche Hindernisse wie Schranken oder sonstige Barrieren.
Hinzu kommt noch, da&#223; man den normalen physikalischen Kr&#228;ften unterworfen
ist und es dadurch alles andere als leicht ist, das Raumschiff zu steuern.
Bei Ber&#252;hrungen wird dem Spieler Energie am Schutzschild abgezogen, die
ohnehin k&#228;rglich genug ist.</P> 

Damit das Spielprinzip auch heute noch kommerziell verwertbar ist, haben
sich die Programmierer einiges einfallen lassen:</P><UL>

<LI>80 Ein Spieler Missionen<BR>
<LI>50 Zwei Spieler Missionen<BR>
<LI>20 Ein oder Zwei Spieler Rennen <BR>
<LI>20 Ein oder Zwei Spieler &quot;Gem&quot; Races<BR>
<LI>40 Dog Fight Level</P>
</UL>

Zus&#228;tzlich kann man durch Geld noch Waffen kaufen, seine Schiffe reparieren
lassen oder neue Schiffe kaufen. Auch zus&#228;tzliches Equipment kann in einem
Shop erworben werden.</P> 

<U>In der Praxis:</U></P>

Was sich in der Theorie noch sch&#246;n und gut anh&#246;rt, wirkt in der Praxis
altbaken und absolut &#252;berholt. Die Grafik ist einfach nur grottenschlecht
und w&#228;re selbst zu A500 Zeiten kritisiert worden und der Sound beschr&#228;nkt
sich auf vereinzelte, unzureichende und teilweise undefinierbare T&#246;ne. Hinzu
kommt noch ein herber Schwierigkeitsgrad, der sicherlich alles andere als
motivationsf&#246;rdernd ist. Auch die Joystickabfrage ist in der vorliegenden
Demoversion noch nicht 100 % ausgereift und mindert den Spielspa&#223; somit
weiter.... </P>

Gute Ans&#228;tze waren eigentlich &#252;berhaupt nicht zu finden, lediglich die
Anzahl der Missionen sowie die durchaus vorhanden Vielfalt der Spielmodi
k&#246;nnen positiv erw&#228;hnt werden; auch wenn das Game dadurch auch nicht mehr
Spa&#223; macht.</P>

<U>Fazit:</U></P>
Tut mir echt leid, aber in diesem Zustand kann man Ph&#246;nix Fighters auf
keinen Fall kommerziell ver&#246;ffentlichen. Das Spiel untergr&#228;bt teilweise selbst PD
Niveau, nicht nur was den Spielspa&#223; angeht, sondern auch von der Grafik her.
Tut mir leid, aber zum angepeilten Verkaufspreis von 14.99 Pfund (tund 45
DM) wird das Game wohl ein Totalflop. Ich glaube nicht, da&#223; sich User
derma&#223;en verarschen lassen. Tut mir leid, aber so sieht es leider aus, wenn
an dem Game nicht mehr viel (und damit meine ich viel) ver&#228;ndert wird....</P>
<CENTER><img src="kit.gif"></CENTER></P><BR>
<PRE>
Name          : Ph&#246;nix Fighters</P>
Publisher     : Alive Mediasoft</P>
Release       : K&#246;nnte evtl. schon erh&#228;ltlich sein...</P>
Preis         : 14.99 Pfund (= 45 DM)</P>
Anforderungen : wahrscheinlich ein nackter A500 (wenn man sich so die Grafik anschaut)</P>

Empfohlen     : ???</P>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
