



<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Wasted Dreams - Das neue Game von Digital Dreams</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="YELLOW">Wasted Dreams</FONT></h1></P>
<img src="wastedl.jpg"></CENTER></P><BR>

Zwar hat es bis zum endg&#252;ltigen Release dieses Games eine ganze Weile gedauert, nicht
zuletzt weil mitten in der Entwicklung der Publisher absprang und somit das
Projekt ernsthaft gef&#228;hrdet war. Daneben gab es noch einige weitere Pannen,
die hier aber nicht erw&#228;hnt werden m&#252;ssen, denn das wichtigste ist, da&#223; das
Game endlich erh&#228;ltlich ist.
Schaun wir mal, ob der Erstling des neuen Labels Digital Dreams
Entertainment auch gelungen ist.</P>

Geliefert wird das Game in einer normalen CD Jewel Case, wie man es ja auf
dem Amiga Spielemarkt gewohnt ist. Dieses Jewel Case enth&#228;lt ein d&#252;nnes
Booklett, das (in englischer Sprache) auf die wichtigsten Sachen eingeht,
aber leider nur ziemlich knapp. Eine ausf&#252;hrlichere Anleitung (dank der
A.T.O. in 17 verschiedenen Sprachen; u.a. in Deutsch) befindet sich aber auf
der Silberscheibe.</P> 


<h2><CENTER><FONT COLOR="GREEN">Die Vorgeschichte:</FONT></CENTER></h2></P>
Wie bei jedem guten Game eigentlich &#252;blich, hat auch Wasted Dreams eine
Vorgeschichte anzubieten, die ich im folgenden einfach mal
zusammenfasse:</P>

In der fiktiven Zukunft, in der Wasted Dream spielt, wird die Erde von
Kriminalit&#228;t und Umweltverschmutzung beherrscht. Mit dem Ziel, einen
Ersatzplanet zu finden, wurde das ExplorerFX 2 Projekt aus dem Boden
gestampft an dem auch Johanson (Hauptfigur) und Harper (2. Person im
Zweispielermodus) teilnehmen. Wie nicht anders zu erwarten, findet die Crew
der ExplorerFX2 bald einen geeigneten Planeten namens Agillera. Da auf
diesem Planeten kein Leben zu existieren scheint, baut die Crew der
ExplorerFX2 binnen 6 Monaten ein Camp auf, ehe man sich entscheidet, 80 %
der Crew mit den guten Neuigkeiten zur&#252;ck zur Erde zu schicken, darunter
auch Johanson und Harper. Kurz nach dem Start wird das Raumschiff allerdings
angegriffen und so m&#252;ssen die Hauptprotagonisten notgedrungen mittels einer Rettungskapsel wieder auf
Agillera notlanden. Als die beiden (bzw. im Einspielermodus nur Johnason)
wieder aufwachen, sehen sie neben sich nur das Wrack... Und genau hier
startet f&#252;r den Spieler das Game!

<h2><CENTER><FONT COLOR="WHITE">Das Spiel:</FONT></CENTER></h2></P>
Wasted Dreams ist eine Mischung aus Adventure und Actionspektakel, wobei
beide Faktoren gleichberechtigt nebeneinanderstehen. Dies wird schon ganz am
Anfang kalr, wo man sich mit einer Laserwaffe gleich gegen zahlreiche
<img src="wasted1.jpg" align=left>Gegener durchsetzen muss, aber gleichzeitig auch darauf achten muss, seine
eigentliche Aufgabe immer im Hinterkopf zu behalten (=&gt; mit allen Mitteln
ins eigene Camp zu gelangen). Nat&#252;rlich bleibt es nicht beim stupiden
rumballern, sondern es m&#252;ssen auch Gegenst&#228;nde aufgesammelt werden und zum
richtigen Zeitpunkt wieder eingesetzt werden (Indiana Jones &amp; Monkey Island
like). Auch Dialoge mit verschiedenen Personen m&#252;ssen gef&#252;hrt werden, da man
ansonsten nicht weiterkommt. Ganz am Anfang ist es z.B. &#228;u&#223;erst praktisch,
einem verwundeten Alien mittels des &quot;Ertse Hilfe Koffers&quot;, der direkt am
Wrack liegt, zu helfen. Daf&#252;r erh&#228;lt man im Gegenzug h&#228;ufig ein anderes,
wichtiges Item. Man sieht, das ganze funktioniert also nach dem altbew&#228;hrten
&quot;Hilfst Du mir, so helfe ich Dir&quot; Prinzip.
Gesteuert wird das ganze wahlweise per Joystick / Maus &amp; Tastatur oder nur per
Tastatur. Auch ein Zweispielermodus ist in Wasted Dreams implementiert. Allerdings will
im Zweispielermodus nur sehr begrenzter Spielspa&#223; aufkommen, da sich
immer beide Spielfiguren auf einem Screen befinden m&#252;ssen und
Eigeninitiative somit entf&#228;llt. Macht aber auch nix, denn ein Game wie
Wasted Dreams zockt man sowieso eher alleine....</P>

Was sich hier jetzt noch besonders trocken und &#228;u&#223;erst eint&#246;nig anh&#246;rt,
macht in der Praxis verdammt viel Spa&#223;. Neben den netten Laserduellen sind
vor allem die Dialoge, die mit zahlreichen Witzen gespickt sind, sehr
erheiternd. Auch der Schwierigkeitsgrad geht absolut in Ordnung; sowohl was den
Adventure als auch den Action Teil betrifft. Nach und nach werden die R&#228;tsel n&#228;mlich
immer kniffliger und erfordern einiges an Denkvorg&#228;ngen. Auch die
Schussgefechte mit den Aliens sind auf die Dauer alles andere als einfach
und man sollte sich h&#252;ten, alzu oft getroffen werden. Dies kostet n&#228;mlich
die &#228;u&#223;erst begrenzte Schild Energie, die man bei sich hat. Als Unfair w&#252;rde
ich das ganze aber auch nicht bezeichnen; eben eine ausgewogene Mischung
zwischen zu leicht und sauschwer.</P>

<h2><CENTER><FONT COLOR="RED">Die Technik:</FONT></CENTER></h2></P>
Nat&#252;rlich macht ein gutes Gameplay noch lange kein Gutes Spiel aus. Nicht
minder wichtig sind meiner Meinung nach auch die akkustischen &amp; optischen
Leckerbissen, die bei Wasted Dreams auf jeden Fall vorhanden sind.</P>

Aber fangen wir mal beim Sound an:
Neben den obligatorischen Hintergrundger&#228;uschen (z.B. bei Lasergefechten)
und der d&#252;steren Hintergrundmusik, die das Spiel mit der richtigen Atmosph&#228;re
unterlegt, kann vor allem die Sprachausgabe &#252;berzeugen. Genau, ihr habt
richtig gelesen: Wasted Dreams verf&#252;gt &#252;ber Sprachausgabe. Diese erschallt
v&#246;llig rauschfrei und in einer hohen Qualit&#228;t aus den Boxen. An dieser
Stelle auch ein Kompliment an die Sprecher, die ihren Job wirklich
hervorragend meisterten. Leider ist die Sprachausgabe gegenw&#228;rtig nur in
Englischer Sprache vorhanden, was dem einen oder anderen User sicherlich
misfallen d&#252;rfte. Nat&#252;rlich stehen diese User nicht im Regen, sondern k&#246;nnen
sich &#252;ber die eingeblendeten Dialoge (u.a. Deutsch) freuen und k&#246;nnen so die
Handlung verfolgen.</P>

Grafisch gesehen f&#228;llt Wasted Dreams zwar etwas ab (was nicht zuletzt auch
an der ECS Kompatibilit&#228;t liegt), aber liegt dennoch &#252;ber dem Mittelma&#223;. Die
Charakt&#228;re sind sehr gut animiert. Die Landschaft ist ebenfalls nicht &#252;bel und
Abwechselung ist auch geboten (Bergbaumine, Wald, Abwassertunnel,
Raumstation etc.), aber als grafisches Highlight kann man Wasted Dreams nun
auch wieder nicht bezeichnen. An dieser Stelle seien auch noch die sehr gut
gemachten Anfangs - bzw. Endanimationen genannt, die beide im vollen PAL
Format fl&#252;ssig &#252;ber den Bildschirm flimmern. Die getraycte Grafik dieser
beeindruckenden Animationen ist, f&#252;r Amiga Verh&#228;ltnisse, auf jeden Fall
erste Sahne und konnte, zumindest mich, voll in den Bann ziehen. Nat&#252;rlich
darf man jetzt kein PSX Niveau erwarten, aber die Zeiten, bei denen Amiga
Games ganz ohne ordentliches Intro auskommen mussten, sind hiermit wohl auch
ad acta gelegt.

Allerdings scheint dieses nur mit sehr viel freiem Chip Ram zu laufen: Auf
meinem A4000 mit Picasso IV und etwas mehr als 2 MB freiem Chip Ram lief das
Intro volkommen korrekt; auf meinem alten A2000 (mit ebenfalls 2 MB Chip
Ram, aber ohne GraKa) wollte das Intro partrout nicht laufen, selbst wenn
ohne Startup Sequence gebootet wurde.</P>

<CENTER>
<img src="wasted3.jpg">
<img src="wasted4.jpg">
</P><BR></CENTER>
<h2><CENTER><FONT COLOR="GRAY">Die dunkle Seite der
Macht...</FONT></CENTER></h2></P>
Nat&#252;rlich ist auch Wasted Dreams nicht frei von M&#228;ngeln: Zum einen sollten
da die ab und an vorkommenden Rechtschreibfehler in den Textdialogen erw&#228;hnt
werden. Diese r&#252;cken zwar bei eingeschalteter Sprachausgabe wieder in den
Hintergrund, sind aber trotzdem allemal nervig. Auch die Tatsache, da&#223; man
nicht aktiv in die Dialoge eingreifen kann (wie von den bekannten
&quot;Lucasfilm&quot; Adventures gewohnt), ist eine nicht gerade bahnbrechende
Neuerung; auf der anderen Seite kann man so auch nicht &quot;gegen eine Wand
laufen&quot;, wenn man die falsche Antwort gew&#228;hlt hat.</P>

<h2><CENTER><FONT COLOR="BLUE">Halt! Die
Anforderungen:</FONT></CENTER></h2></P>
Wasted Dreams verlangt im Grunde sehr wenig: Gerade mal ein Amiga mit 68000
(!) Prozessor, 3 MB Ram (2 MB Chip und 1 MB Fast) und ein 2 X CD Rom wird
ben&#246;tigt. Wie das Game unter solchen &quot;Bedingungen&quot; l&#228;uft, kann ich nicht
beurteilen, da ich nicht im Besitz eines solchen Ger&#228;tes bin. Empfohlen wird
allerdings mehr Speicher, ein schnelleres CD Laufwerk und ein besserer
Prozessor. Eine Festplatteninstallation ist &#252;brigens nicht n&#246;tig und auch nicht vorgesehen.
Um einen kleinen Anhaltspunkt zu liefern, habe ich Wasted Dreams
mal auf zwei verschiedenen Konfigs ausprobiert:</P><UL>

<LI> Amiga 2000, 16 MB Fast Ram, 2 MB Chip Ram, 68040 / 40 MhZ, 10 X CD ROM, !
GB HD,
ECS:</P>

Spiel lief fl&#252;ssig und ohne Probleme. Lediglich das Intro verweigerte seinen
Dienst und die Sprachausgabe schien (subjektiv!!) nicht so gut, wie auf dem
4000er System (liegt wahrscheinlich an den ECS Chips). Unterschiede in der
Grafik zum AGA System waren kaum auszumachen.</P><BR>


<li> Amiga 4000, 16 MB Fast Ram, 2 MB Chip Ram, 68040 / 25 MhZ, 36 X CD Rom, Picasso IV, 1.28 GB HD
:</P>

Sowohl das Spiel als auch das Intro liefen fl&#252;ssig ab und auch die
Sprachausgabe funktionierte einwandfrei. Probleme mit der GraKa gab es
aufgrund des integrierten Flickerfixers
gl&#252;cklicherweise keine. Allerdings sollte man vorher testen, ob das Game
auch auf einer Cybervision 64 / 3D oder &#228;hnlichen l&#228;uft (denn laut mir
vorliegenden Infos tut es das nicht).</P></UL>

<h2><CENTER>Wasted Dreams oder Wasted Time? </h2></CENTER></P>
Als Fazit kann ich nur festhalten, da&#223; Wasted Dreams ein gelungener Mix aus
Action- und Adventure Game ist. Neben einer &#228;u&#223;erst motivierenden
Hintegrrundstory kann vor allem das Gameplay &#252;berzeugen und, zumindest mir,
hat &quot;Wated Dreams&quot; h&#246;llischen Spa&#223; gemacht und mich einige N&#228;chte vor dem
heimischen Amiga gefesselt. Schade ist nur, da&#223; das ganze (bewusst?) ECS
kompatibel gehalten wurde, denn ansonsten h&#228;tte man mehr aus der Grafik
machen k&#246;nnen. Dennoch bleibt unter dem Strich ein wirklich gutes Spiel
&#252;brig, das ich jedem Zocker nur empfehlen kann! </P>
<CENTER>
<img src="wasted2.jpg"></P>
<img src="wasted5.jpg"></P><BR>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Digital Dreams</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>zwischen 60-70 DM</TD>
</TR>
<TR>
<TD>Genre</TD>
<TD>Gelungener Mix aus Adventure & Action</TD>
</TR>
<TR>
<TD>Medium</TD>
<TD>CD (420 MB)</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>72 %</TD>
</TR>
</TABLE></P><BR></CENTER>








<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
