



<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbreif von The Bruce</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=Yellow alink=red>
<h1><CENTER><FONT COLOR="GREEN">Leserbrief von Kilian<blink> "The
Bruce"</BLINK> Servais</FONT></h1></CENTER></P>
<ul>
<li><a href="#alle1.html">An Alle (betr. E-Mail)</A><BR>
<li><a href="#alle2.html">Nochmal an Alle (betr. NC Installation)</A><BR>
<li><a href="#andreas.html">An Andreas &quot;Onkelz Freak&quot;
Etzrodt</A><BR>
<li><a href="#rolf.html">An den bald E-Mailenden Rolf Nue.</A><BR>
<li><a href="#dark.html">An den ideologisierenden (?) Dark (alias J&#252;rgen Kumiega)</A><BR>
<li><a href="#herwig.html">An den verschollenen Benjamin Herwig</A><BR>
<li><a href="#nagash.html">An den mitlerweile B&#214;SEN Nagash Alias Yonder Alias Gerd Wolpert</A><BR>
<li><a href="#thowin.html">An den zu recht verwirrten Thowin</A><BR>
<li><a href="#tom.html">An den diskutierenden Mark Tom</A><BR>
<li><a href="#thowin2.html">An den zweiten Thowin (alias Saint)</A><BR>
<li><a href="#top5.html">Meine Top 5
</UL>
<HR>
<a name="alle1.html">
<b>An Alle I:</B></P>
Nun, ich habe jetzt endlich eine eigene E-Mail Addresse und zwar
&quot;kilianservais&quot;at&quot;gmx.de&quot;. Da ich allerdings von zu Hause kein Modem habe
(und somit auch keinen Internetzugang), k&#246;nnen die Antworten etwas dauern
(ich habe von der Schule n&#228;mlich nur begrenzten Zugang...). Also nicht
wundern, wenn eine Antwort etwas dauert....</P>
<HR>
<a name="alle2.html">
<B>An Alle II:</B></P>
&#214;h, also, ich hatte bei der Installation der letzten NC einige Probleme.
Nachdem ich alles so wie immer installiert habe (und keine Fehlermeldungen
kam) und ich frohen Mutes die NC geladen hatte, kam der erste Schock: Es
fehlten zahlreiche Rubriken (z.B. die Main Seite von &quot;Multimedia&quot;) und auch
einige Artikel. Hinzu kam, da&#223; meine ganzen Artikel extrem verhunzt waren
(nur Datenm&#252;ll auf dem Screen; vermischt mit den beiden Worms Texten und
diversen Bildern). Nachdem ich mich nat&#252;rlich aufgeregt hatte und die NC
erneut von Disk installierte, funktionierte alles einwandfrei. Meine Frage
nun: Haben andere Mitglieder &#228;hnliche Probleme / Erfahrungen durchlebt???</P>
<HR>
<a name="andreas.html">
<B>An Andreas E.:</B></P>
Die Biographie &quot;Danke F&#252;r Nichts&quot; kenne ich auch, da seinerzeit beim
erscheinen in jedem Metal Mag ausf&#252;hrlich dr&#252;ber berichtet wurde; na ja,
somit kam ich also nicht drum herum, mich etwas damit zu befassen.</P>

Na ja, &#252;ber eine evtl. rechte Vergangenheit m&#246;chte ich hier jetzt nicht
spekulieren, da es bei den mir bekannteren Alben (neuere) nur &quot;normale" Texte
gab. Nun aber zu Deiner Aussage, da&#223; die Onkelz die besten (deutschen)
Lyrics machen: Das sehe ich leider total anders! Ok, im Vergleich zu anderen
deutschen Bands wie Rammstein, mag das sein. Aber wenn ich die lyrischen
&quot;Erg&#252;sse&quot; eines Stephan Weidner ("Wir sind Kneipenterroristen, schwerstens tätowiert, ahben immer einen sitzen ganz egal was auch
passiert.... blablabla und Streit ist unser Ziel") mit denen eines Carl Cadden James (Shadow
Gallery), James LaBrie &amp; Co (Dream Theater) oder dem Duo Jon Olivia / Paul
O`Neill (Savatage) vergleiche, dann muss ich &#252;ber Deine obige Aussage doch
sehr schmunzeln. Richtig ist zwar, da&#223; die Lyrics der Onkelz direkt sind. In
meinen Augen ist diese Art der Provokation (nichts anderes ist es ja) zu
plump und leider irgendwo auch sehr stumpfsinnig. Mag ja sein, da&#223; ich das
ganze jetzt etwas vorschnell aburteile, aber das Material, was mir von den
Onkelz vorliegt, l&#228;&#223;t nunmal keinen anderen Schluss zu....</P>

Manowar, Iced Earth, Roxette &amp; Klassik? Das ist ja ein breitgef&#228;chter
Musikgeschmack. Die ersten beiden Bands sind sicherlich Klasse (...), &#252;ber
den &quot;Rest&quot; kann ich mich nur sehr begrenzt &#228;u&#223;ern und deswegen lasse ich es
mal gleich lieber. Aber das Du Metal magst, freut mich irgendwo trotzdem
:-)))</P>

Das war`s auch im Grunde schon. Keep On Rockin`!</P>
<HR>
<a name="rolf.html">
<B>An Rolf N.:</B></P>
Wie Du ganz oben schon lesen konntest, habe ich jetzt auch eine E-Mail Addy.
Wenn also noch was ist, kannst Du Dich jetzt gerne auch per Mail an mich
wenden.</P>

Auch Deine Homepage kannst Du an obige Addresse schicken. W&#252;rde mich
tierisch &#252;ber Post von Dir freuen - nun muss auch nicht mehr die
Schneckenpost herhalten :-)))</P>

Was ist denn mal mit einigen Artikel von Dir f&#252;r die NC? Vielleicht ein paar
Ratschl&#228;ge, welche Homepages gut sind und welche weniger??</P>

Bis demn&#228;chst mal wieder!</P>
<hr>
<a name="dark.html">
<B>An Dark:</B></P>
Der &quot;Gro&#223;meister&quot; (Was? Nicht mehr???) l&#228;&#223;t sich herab um Dir Wurm zumindest
eine kleine Audienz zu gew&#228;hren. Knie also nieder und lese :-))))</P>

Mit Ver&#228;nderungen meinte ich eigentlich weniger welche, die optischer Natur
sind, sondern eher charakterliche. Ok, ist vielleicht etwas schwierig &amp;
schwammig formuliert, aber zumindets mir hat es damals geholfen. Vergiss
einfach den ganzen Schei&#223;, der da so um Dich rum passiert und fang nochmals
bei null an. Bei mir war es damals &#228;hnlich und mitlerweile hat sich einiges
wieder zum positiven gewandt. Evtl. werde ich das ganze mal per Brief
r&#252;berschicken, denn soetwas sollte nicht in der NC erscheinen... (hast Du
eine E-Mail Addy?)</P>

Thema Musik:
Richtig, Metallica sind ziemlich schlapp geworden. Das &quot;Black Album&quot; fand
ich auch recht gut und die &#228;lteren sind sowieso irgendwie Pflicht; auch wenn
mir pers&#246;nlich Metallica nie soooo wichtig waren. Stehe da mehr so auf Power
&amp; NWOBHM Stuff und nat&#252;rlich (Hard) Rock; hatte ich aber, glaube ich, schon
geschrieben.
Kennst Du eigentlich die letzte Therapy? ?? Fand ich nicht mehr ganz so
dolle.... </P>

An meinem Layout feile ich z.Zt. auch noch etwas, aber von Patterns halte
ich nicht alzu viel. Deswegen benutze ich selber auch nur einen Pattern bei
meinen (wenigen) Game Previews. Alle anderen Artikel bleiben in etwa so,
vielleicht werden einige Details noch abge&#228;ndert. Da sich aber bisher kaum
Leute zu meinem (neueren) Layout zu Worte gemeldet haben (ok, auch nicht
negativ), lasse ich diese erstmal so.</P>

&#220;brigens fande ich Deinen Stil im letzten Leserbrief an Ronald echt cool.
Hast den armen ja kr&#228;ftig auf die Schippe genommen. Aber Achtung: Der wird
sich (b&#246;se) r&#228;chen :-))))</P>

Read You!</P>
<HR>
<a name="herwig.html">
<B>An Benjamin:</B></P>
Hey, hab ja lange nix mehr von Dir geh&#246;rt. Ist mein Brief damals etwa nicht
mehr angekommen (ist schon etwas her??) ??? Na ja, ich dachte einfach mal,
melde Dich mal wieder per NC. Wie sieht`s mal wieder mit `nem Tape aus?
Melde Dich mal wieder. Bis denne!</P>
<HR>
<a name="nagash.html">
<B>An Gerd Wolpert:</B></P>
Man, was habt ihr denn da auf dem Clubbertreffen mit Euren Pseudos
angestellt? Das wird einigen Mitgliedern garantiert nicht gefallen.....</P>

Iron Maiden sind f&#252;r mich die Band, mit der ich aufgewachsen bin. Somit
haben sich von denen auch die meisten CD`s bei mir angesammelt. Tja, da&#223; die
alten CD`s von denen z.Zt. wieder teurer sind liegt daran, da&#223; diese
&quot;komplett digital remastered&quot; wurden und evtl. noch Bonustracks haben. Aber
bald kommen diese wieder auf den Markt (zum 4. Mal!!!). Wenn Du billig
Maiden CD`s suchst, kann ich Dir Plattenb&#246;rsen empfehlen. Dort zahlst Du pro
CD maximal 15 DM und das ist ja wohl recht anst&#228;ndig. Alternativ kann ich
Dir bei Gelegenheit auch ein &quot;Best Of Maiden&quot; Tape zukommen lassen; eine
Leerkasette w&#228;re dann aber sehr fein :-)))</P>

Thanx auch f&#252;r Deinen &quot;Test&quot; zur HMG 3.5; mitlerweile arbeite ich an der HMG
4.0 (HMG - NG), die in HTML erscheinen wird und komplett (!) &#252;berarbeitet
wurde. Wo liegt in der Note eigentlich der Unterschied zwischen 1- und 1.5
????</P>

Ach ja: Und schreib weiterhin so fleissig f&#252;r die NC!</P>
<HR>
<a name="thowin.html">
<B>An Thowin (Windecker):</B></P>
Hoffe mal, da&#223; diesen Monat die Disk ordnungsgem&#228;&#223; angekommen ist und nix
schief gelaufen ist. Tut mir deswegen auxh sehr leid, da&#223; Du letzten Monat
alles alleine schreiben musstest, aber das hatte ich ja schon erkl&#228;rt und
ich konnte ja auch nix daf&#252;r. Alles andere werde ich dann wohl schon per
Brief gekl&#228;rt haben oder war noch etwas wesentliches, was ich (in meiner
Hektik) mal wieder vergessen habe ? Wo bleibt eigentlich Dein Feedback?
Sollte das nicht auch regelm&#228;&#223;ig kommen? Nix f&#252;r ungut, aber mitlerweile
geht`s in der Hinsicht in der NC wieder leicht bergab.</P>

Beam me up!</P>
<hr>
<a name="tom.html">
<B>An Mark Tom:</B></P>

Ich wollte Dir auf diesem Weg nur mitteilen, da&#223; ich Deine Ausf&#252;hrungen zum
Thema &quot;Horror&quot; und mit allem was damit zusammenh&#228;ngt, volkommen teile. Auch
Deine Statements zum Themenkomplex &quot;Pornographie&quot; zeigen, da&#223; Du Dir da jede
Menge Gedanken gemacht hast und das ist z.Zt. in der NC leider nicht mehr
selbstverst&#228;ndlich. G&#252;tigerweise hat sich der Andreas dazu auch mal wieder
zu Wort gemeldet, so da&#223; dieses Thema jetzt wieder vorbei sein d&#252;rfte....</P>

Wo war eigentlich letzte Ausgabe FastFood? Habe es richtig vermisst.... Und
auch kein Feedback Deinerseits... schnifff....schnifff. Kommt hoffentlich ab
n&#228;chster Ausgabe wieder regelm&#228;&#223;ig.</P>

Bis denne!</P>
<HR>
<a name="thowin2.html">
<B>An Thowin II (Saint):</B></P>
Was war denn mit Dir in der letzten Ausgabe los? Keine Leserbriefe, kaum
Artikel. Neue Freundinn oder nur das obligatorische Sommerloch? Oder ein
kaputter Amiga?</P>

Die FD Hitparade m&#252;sste Dich ordnungsgem&#228;&#223; erreich habe, ebenso wie das
Tape. Ist dazu eigentlcih auch meine E-Mail angekommen? Hatte nix besseres
zu tun (nur Chemie GK) und habe deswegen aus der Schule mal eine Mail an Dich abgesetzt.
Da ich kein Experte in diesem Bereich bin, wei&#223; ich nicht, ob ich alles
richtig gemacht habe.</P>

By the way: Cooler Bericht vom Clubbertreffen....</P>
<HR>
<a name="top5.html">
<CENTER><h2><FONT COLOR="YELLOW">Top 5</FONT></h2></CENTER></P>

1. Alle Bericht vom Clubbertreffen</P>
2. MultiEcke von Yo... &#228;h...Nag...ah, Gerd Wolpert (wegen der HMG :-))))</P>
3. CD Test: Games Attack von Thowin (einfach nur gut &amp; objektiv)</P>
4. Der blanke Horror von Mark Tom (gute Argumentation)</P>
5. INRI von Daniel Stein (DER StoryGame Schreiber... besser kann es wohl
kaum einer!)</P>

Was in der letzten NC fehlte, war die Feedbackcorner sowie Feedback im
allgemeinen. Mag sein, da&#223; ich jetzt &#252;berreagiere, aber ich bitte doch alle,
mal eben Ihre Top 5 (Top 7, Top 10 oder was wei&#223; ich) aufzuschreiben. Mal
sehen, wie die n&#228;chste NC nach &#252;berstandenem Sommerloch aussieht. Macht`s
bis denne mal alle gut (oder B&#214;SE, ne, Ronald!).</P> 



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
