<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Tools-Test</title>
</head>
<body background="wolf1.jpg" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#800000" size="7">
<b>Web-Offensive und akademie.de</font></b></p>
<p> Dieser Tage las ich einen Artikel: <strong>Oracle unterst&uuml;tzt
Web-Offensive:</strong></font> Im Fr&uuml;hjahr 1998 hat akademie.de gemeinsam
mit FOCUS-Online die Web-Offensive ins Leben gerufen usw. usw. Obwohl ich
doch der deutschen Sprache einigerma&szlig;en m&auml;chtig bin, konnte mir beim besten
Willen nichts darunter vorstellen. Also schaute ich einfach auf den
Web-Sites nach und in Kurzform gebracht, kam folgende Quintesenz zu Tage:
</p>

<p>Die von <b>akademie.de</b> und <b>FOCUS-Online</b> initiierte
<b>Web-Offensive</b> stellt Existenzgr&uuml;ndern, kleinen und
mittelst&auml;ndischen Unternehmen gesponserte Web-Server mit eigenem
Domain-Namen zu sehr g&uuml;nstigen Konditionen zur Verf&uuml;gung. Dazu
bietet akademie.de kostenlose Unterst&uuml;tzung bei allen technischen
Fragen sowie kostenlose Online-Kurse und Workshops, die das Know-how
vermitteln, wie man eine Web-Site aufbaut und erfolgreiches
Internet-Marketing betreibt. </p>

<p><img src="onl_akadem3.gif" align="right" vspace="7" width=82 height=40
alt="Sponsoren" border="0">Mehrere namhafte Unternehmen wie Netscape, Sun
Microsystems und Speed-Link unterst&uuml;tzen bereits das Projekt als Sponsoren.
Jetzt z&auml;hlt auch das Unternehmen Oracle zu den Mitgliedern des
F&ouml;rderkreises der deutschen Internet-Wirtschaft und wird das Projekt in
erster Linie durch gesponserte Software-Lizenzen unterst&uuml;tzen. Neben der Verwaltung der
Teilnehmerdaten von akademie.de und der Web-Offensive, sollen in K&uuml;rze auch
Online-Tests und ein Pr&uuml;fungssystem mit Hilfe von Oracle entwickelt werden.
Der Zugriff auf die Test- und Pr&uuml;fungsm&ouml;glichkeiten erfolgt dabei &uuml;ber
Java-Servlets. Ziel der Web-Offensive ist es, Existenzgr&uuml;nder und
mittelst&auml;ndische Unternehmen bei ihrem Weg ins Internet zu begleiten. </p>

<p>
Es lohnt sich 100%ig f&uuml;r Interessierte, &uuml;ber detailliertere Informationen
auf den Web-Sites von <b>www.web-offensive.de</b> und <b>www.akademie.de</b>
nachzulesen.
</p>

<p align="center"><img src="onl_akadem1.gif" width=139 height=110
alt="web-offensive.de" border="0">
<img src="onl_akadem2.gif" width=105 height=111 alt="akademie.de" border="0"></p>

<p>Nun ein kleiner Auszug aus der Webseite:
<blockquote> Viele Unternehmen m&ouml;chten sich im Internet engagieren. Doch in
Deutschland gibt es nur wenige Mitarbeiter, die &uuml;ber entsprechendes Wissen
verf&uuml;gen. akademie.de vermittelt das notwendige Know-how effizient und
kostenlos, direkt per Internet an den Arbeitsplatz. akademie.de wird von
HRP, der von Hase, Rosdale & Partner Unternehmensberatung GmbH  getragen
und bis 31. Dezember 1999 durch das Bundesarbeitsministerium aus Mitteln
des Europ&auml;ischen Sozialfonds gef&ouml;rdert. Zur kostenlosen Teilnahme
berechtigt sind kleine und mittlere Unternehmen, einschlie&szlig;lich
Einzelunternehmen, GbRs und Existenzgr&uuml;nder. Vorausgesetzt wird, da&szlig;
teilnehmende Unternehmen einen Computer mit Internet-Zugang am Arbeitsplatz
bereitstellen und den Mitarbeiter die M&ouml;glichkeit einr&auml;umen, sich w&auml;hrend
der Arbeitszeit zu qualifizieren. Auch nicht f&ouml;rderberechtigte
Interessenten (Gro&szlig;unternehmen oder Privatpersonen) k&ouml;nnen an akademie.de
teilnehmen. </blockquote>
Soweit der Auszug. <br>

<img src="onl_akadem4.jpg" align="left" width=199 height=180 alt="B&uuml;cher"
border="0"> F&uuml;r die Kursteilnahme wird ein monatlicher Kostendeckungsbetrag
von 56,84 DM (netto 49,- DM) berechnet. Weitere Geb&uuml;hren f&uuml;r die
angebotenen Kurse entstehen meines Wissens nicht. Ausf&uuml;hrliche
Informationen zu den Schulungsangeboten im Rahmen der Web-Offensive,
Kursen, Workshops und Anmeldeunterlagen findet man unter: <ul>
<li> http://www.akademie.de/info/ </li> 
<li> http://www.akademie.de/workshops/ </li> 
<li> http://www.akademie.de/unterlagen/. </li></ul>
In den Kursen von akademie.de lernen die Teilnehmer der Web-Offensive, ihre
Internet-Pr&auml;senz auf einem Web-Server einzurichten und zu betreiben. Per
Login-Name und Pa&szlig;wort gelangen die Teilnehmer zu allen Lektionen,
Materialien, &Uuml;bungen, Tests und Kommunikationsmitteln. Die Teilnehmer
nutzen nur die f&uuml;r sie passenden Kurselemente. Zu einzelnen Themen werden
auch vertiefende Online-Workshops mit begrenzter Teilnehmerzahl zu festen
Terminen angeboten. <br>
Neu erschienen dazu: Die Buchreihe zum Internet! </p> 

<p>Nun ein paar Ausz&uuml;ge noch &uuml;ber FOCUS, Orakle und eine zusammenfassende
"Reklame". </p>

<p>Mit FOCUS startete 1993 ein Nachrichtenmagazin neuen Typs. FOCUS trennt
Fakten und Meinungen und bringt Nachrichten schneller auf den Punkt. Das
redaktionelle Konzept des Nachrichtenmagazins - die Verkn&uuml;pfung von Text,
Bild und Grafik - ist darauf ausgerichtet, komplexe Sachverhalte schnell
und &uuml;bersichtlich zu vermitteln. FOCUS ist eines der auflagenst&auml;rksten
Magazine Deutschlands und der reichweitenst&auml;rkste Titel der Burda-Gruppe.
Die Erfolgsstory von FOCUS setzt sich mit FOCUS Online fort. Der
nachrichten- und serviceorientierte Online-Dienst des Magazins erweitert
und aktualisiert t&auml;glich sein Angebot. FOCUS Online geh&ouml;rt zu den
erfolgreichsten Web-Sites im deutschsprachigen Internet. Seit April 1998
kann FOCUS Online seine Marktf&uuml;hrerschaft im Bereich der redaktionellen
General-Interest-Angebote behaupten. Informationen &uuml;ber die zusammen mit
akademie.de initiierte Web-Offensive finden Sie in FOCUS Online unter:
http://www.focus.de/web-offensive/ </p>

<p>Oracle  ist seit Juni 1999 Partner der Web-Offensive. Die von Oracle
gesponserte Software wird f&uuml;r die Verwaltung der Daten der Teilnehmer von
akademie.de und f&uuml;r die Web-Offensive eingesetzt. Auch Online-Anmeldungen
werden nun m&ouml;glich, bei denen die Daten direkt in die Oracle-Datenbank
geschrieben werden. Bei akademie.de werden auch Online-Tests und ein
Pr&uuml;fungssystem mit Oracle entwickelt. Der Zugriff auf die Test- und
Pr&uuml;fungsm&ouml;glichkeiten erfolgt dabei &uuml;ber Java-Servlets. Oracle ist heute
der f&uuml;hrende Anbieter von universellen Informations-Management-L&ouml;sungen und
das zweitgr&ouml;&szlig;te Softwarehaus der Welt. Das Portfolio ist einzigartig und
besteht neben Datenbanken aus Anwendungs-Servern, Entwicklungs- und
Analysewerkzeugen sowie betriebswirtschaftlicher Anwendungssoftware und
Business-L&ouml;sungen. Oracle ist Vorreiter des Internet Computing und
entwickelt L&ouml;sungen f&uuml;r die durch das Internet global vernetzte
Gesellschaft. Weitere Informationen &uuml;ber Oracle finden Sie unter:
http://www.oracle.de </p>

<p>Die Web-Offensive bietet allen Teilnehmern von akademie.de gesponserte
virtuelle Web-Server an. Diese k&ouml;nnen f&uuml;r die professionelle Web-Pr&auml;senz
unter eigenem Domain-Namen (www.IhreFirma.de) genutzt werden. Der
Web-Offensive-Server kostet j&auml;hrlich DM 199,- (netto: DM 171,55), weniger
als 55 Pfg. pro Tag! Weitere Anmelde- oder Einrichtungsgeb&uuml;hren fallen
nicht an. Wenn Sie noch kein Teilnehmer von akademie.de sind, dann finden
Sie hier Anmeldeunterlagen  und weitere Informationen . Wenn Sie bereits
Teilnehmer von akademie.de sind, k&ouml;nnen Sie hier sofort einen
Web-Offensive-Server  bestellen. Der Web-Offensive-Server bietet folgende
Merkmale: Ihr eigener Domain-Name unter ".de" (z.B. www.IhreFirma.de)
".com", ".net" oder ".org", 30 Mb freie Festplattenkapazit&auml;t, 1000 Mb
Volumentransfer monatlich frei, 5 POP-E-Mail-Accounts, damit mehrere
Mitarbeiter unabh&auml;ngig voneinander E-Mail empfangen und versenden k&ouml;nnen.
Einrichtung von unbegrenzt vielen E-Mail-Alias-Adressen
(z.B.vertrieb@IhreFirma.de), Pa&szlig;wortgesch&uuml;tzer FTP-Zugang f&uuml;r Updates,
Einrichtung gesch&uuml;tzter Verzeichnisse, eigenes gesichertes CGI-Bin
(Suexec-Wrapper), Installation eigener Scripts (Perl, C, TCL und
Bourne-Shell, PHP3), RAID-System und zus&auml;tzliche Datensicherung alle 24
Stunden, Statistikprogramm f&uuml;r Auswertungen der Zugriffe auf den Server
(grafische Auswertung, Logfile), Page-Counter und G&auml;stebuch f&uuml;r Ihre
Web-Seiten. </p>

<p>Wie leicht zu ersehen ist, sind die Texte der drei letzten Abs&auml;tze nicht
von mir, sondern von der Web-Site von Web-Offensive. Trotzdem habe ich
sie in meinem Artikel mit eingebaut, da sie in konzentrierter Form sehr
viel Hintergrundwissen vermitteln. Vielleicht versp&uuml;rt nun jemand Lust
beim n&auml;chtlichen Surfen auf den angesprochenen Seiten vorbeizuschauen.
</p>

<hr size=4>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
</td></tr></table>
<br>
        
</body>
</html>
