<HTML>
<HEAD>
<TITLE> Feedback-Corner zur NoCover 66 </TITLE>
</HEAD>
<BODY BACKGROUND=fcbgdark.png TEXT=#ffff00 link=blue alink=red bgcolor=#000000>

<CENTER><IMG SRC=fctitle.gif WIDTH=506 HEIGHT=35 ALT=FEEDBACK-CORNER>
</CENTER>
<P ALIGN=JUSTIFY>
Ich m&ouml;chte mich an dieser Stelle schonmal f&uuml;r eventuelle
Rechtschreibfehler entschuldigen. Ich schicke die NC-Artikel
&uuml;blicher am 25. zum Andreas. Am 22. hat ein Defragmentierprogramm
meine Datenpartition gecrasht. Von den 1000 MB konnte ich noch ca.
650 MB retten. Die restlichen Dateien sind ab ins Nirvana. Unter den
Dateien war auch das komplette Verzeichnis, in dem ich die
NoCover-Artikel speichere. Diesen Artikel habe ich aus einem Backup
gerettet. Ich habe jetzt leider keine Zeit alles
nochmal zu &uuml;berarbeiten. Seit also bitte nicht entt&auml;scht, wenn
ich euch nicht erw&auml;hne.
<DL>
<LH></LH>
<DT><STRONG>Amiga aktuell von Carsten Schr&ouml;der
</STRONG><DD>Hochinterssant wie immer, nur warum wurde f&uuml;r den linken
             Frame <CODE>SCROLLING=NO</CODE> angegeben?

<DT><STRONG>Space Pages von Thowin
</STRONG><DD>Auch er hat erhebliche Probleme mit der Framedarstellung ...

<DT><STRONG>Amiga User Liste von Stefan1200
</STRONG><DD>Gute Idee! Diese Rubrik lebt allerdings vom mitmachen, also
ihr Leser ihr wisst was ihr zu tun habt!

<DT><STRONG>Farben von Kilian Servais
</STRONG><DD>Der Amiga kommt bei dir viel zu schlecht weg. Er besitzt
doch gerade die beiden genialen Modi HAM6 und HAM8. Warum erw&auml;hnst
du sie nicht? Das Bild, das der AGA-Amiga angeblich wegen seiner 2,25 MB
nicht mehr darstellen kann ben&ouml;tigt im HAM8-Modus mal gerade 768 KB.
Es gibt also kein Problem.

<DT><STRONG>WormsDC von The Dark
</STRONG><DD>Stimmt Worms und WormsDC sind genial vor allem wenn man nicht
alleine spielt. Die Cheats waren schonmal in der NoCover 46 und in der
NoCover 47.

<DT><STRONG>Multiecke #12 von Gerd Wolpert
</STRONG><DD>Sch&ouml;n, dass sich jetzt ein Team gefunden hat, dass diese
Rubrik am Leben erh&auml;lt. Fr&uuml;her war diese Rubrik &ouml;fter /
meistens leer. <BR>
<UL>
<LH>Zum NoCover-Guide m&ouml;chte ich nur folgendes erg&auml;nzen:
</LH>
<LI>Wolf bietet einen tollen Update-Service an. Man l&auml;dt sich
    am besten den NoCover-Guide einmal aus dem Netz und l&auml;sst sich
    von Wolf die Updates per E-Mail schicken. So verpasst man keine
    &Auml;nderung.
<LI>Soviel ich wei&szlig; ging die Amigaguide-Version nur bis zur
    NoCover 50 !?! 
</UL>

<DT><STRONG>Peperoni von Wolf Zimmer
</STRONG><DD>Stimmt! Wirklich ein sch&ouml;nes Programm. Ich habe es
             selbst seit einiger Zeit installiert. Nur leider lassen
             sich damit nicht die PPC-Packer ansteuern, wodurch es
             bei mir &quot;relativ&quot; langsam packt/entpackt.

<DT><STRONG>Minigolf von OJo
</STRONG><DD>&lt;H3&gt; ist f&uuml;r &Uuml;berschriften und nicht
             f&uuml;r normalen Text gedacht !!! 

<DT><STRONG>Mein Rat von Thowin
</STRONG><DD>Du schreibst, dass man Realnamen am Anfang bei richtigen
             Zeitungen auch findet. Aber dir wird dann auch aufgefallen
             sein, dass dies in der gesamten Zeitung einheitlich ist.
             Entweder bei jedem Artikel am Anfang oder bei jedem Artikel
             am Ende. Bei der NoCover steht er nun mal bei jedem Artikel
             am Ende.<BR>
             <CITE>&quot;nat&uuml;rlich werde ich nicht meine ganze
             Verwandschaft gr&uuml;&szlig;en&quot;</CITE> Wenn das
             mal so nat&uuml;rlich w&auml;re. Erinnerst du dich an die
             Dezemberausgabe, bei der viele Artikel von zig Zeilen
             Gr&uuml;&szlig;en gefolgt wurden?

<DT><STRONG>Richtlinien von Andreas Magerl
</STRONG><DD>Ein Kritikpunkt: Warum sollen wir die Artikel nach HTML 3.2
             schreiben und nicht nach HTML 4.0 . Ich werde weiterhin
             meine Artikel nach HTML 4.0 schreiben!

<DT><STRONG>Clubtreffen 99 von Sax
</STRONG><DD>Ich musste das Hintergrundbild abschalten um die Schrift
             lesen zu k&ouml;nnen. Aber dann war der Artikel sehr gut.
             Schluchz, warum konnte ich dieses Mal nicht dabei sein ...

<DT><STRONG>Musik von The Bruce
</STRONG><DD>Ein sehr interessanter Artikel. Ich habe auch schon
             &auml;hnliches festgestellt.

<DT><STRONG>Astrocorner #5 von Lars Phillipsen
</STRONG><DD>Tolles Thema und sehr interessant! Ich bin schon gespannt
             auf die n&auml;chste Ausgabe? Wie ging das Experiment
             w&auml;hrend der Sofi aus?

<DT><STRONG>FeedbackManager von Markus Castro
</STRONG><DD>Bei den Erl&auml;terungen hast du was durcheinandergebracht
             ... <BR>
             Das kann doch nicht sein, dass niemand mehr f&uuml;r die
             FeedbackCorner schreiben will? Woran liegt's?

<DT><STRONG>Treffen 99 von Markus Castro
</STRONG><DD>Das beste Layout! Ein paar Stellen sehen zwar unter AWeb
             etwas &quot;verr&uuml;ckt&quot; aus ... aber trotzdem. <BR>
             mit dem Zur&uuml;ckbl&auml;ttern gibt es allerdings Probleme.<BR>
             Und wieso Sonntag 1.1.2000???

<DT><STRONG>INRI von Daniel Stein
</STRONG><DD>Eine ganz interessante Bibel-Interpretation. Sie erinnert
             mich an &quot;Der wahre Noah - Neuestes aus der
             Sintflutforschung&quot; von Wolfdietrich Schnurre.
</DL>
<P ALIGN=JUSTIFY>
<STRONG>Abschlie&szlig;end</STRONG><BR>
Insgesamt f&auml;llt mir an der NoCover auf, dass immer weniger interessante
Artikel &uuml;ber den Amiga erscheinen. Warum? Wird das als
&uuml;berfl&uuml;ssig angesehen da Carsten immer alle Neuigkeiten
ver&ouml;ffentlicht? Oder gibt es einfach nichts neues mehr?

<P ALIGN=JUSTIFY>
Das Layout der NoCover geht wieder dazu &uuml;ber, dass der Hintergrund
dunkel bis schwarz ist und die Schrift farbig und hell. Mir pers&ouml;nlich
gef&auml;llt das gut. Nur als das vor etlichen Ausgaben schonmal der Fall
war hatte sich Andreas ziemlich beschwert. Nun regt er durch den dunklen
Hintergrund beim Inhaltsverzeichnis gerade dazu an. <BR>
Da ich gerade beim Layout bin: Der obere Frame ist viel zu gro&szlig;. Mir
w&uuml;rde ein anderes Layout viel besser gefallen
<A HREF=fcframeset.html TARGET=_parent>... und zwar dieses</A>

<P ALIGN=JUSTIFY>
Der Hintergrund der Intern-Seiten m&uuml;sste auch noch auf dunkel
ge&auml;ndert werden. Sie passen sonst nicht mehr in das
Erscheinungsbild.

<P ALIGN=JUSTIFY>
Eine interessante Entwicklung ist die Besch&auml;ftigung mit Themen
aus dem Bereich der Psychologie und Ethik. Dar&uuml;ber diskutiere ich
zwar auch gern, aber gegen&uuml;ber einer tiefergehenden Diskussion in der
&Ouml;ffentlichkeit habe ich doch eine gewisse Hemmschwelle.

<P ALIGN=JUSTIFY>
Beteiligungen an Charts, Wettbewerben oder &auml;hnlichen lassen wie
schon seit Jahren zu w&uuml;nschen &uuml;brig. Wohl das einzige, was
sich an der NoCover nicht ge&auml;ndert hat ...


<P ALIGN=RIGHT>
<A HREF="mitglieder/steffens.html">
<IMG SRC=umo.gif WIDTH=84 HEIGHT=41 BORDER=0 ALT="UMO - Thomas Steffens"> </RIGHT>
</A> 

</BODY>
</HTML>

