<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="wolf1.jpg" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" bgcolor="#808080">
<font color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td></tr></table
<table border="0" cellpadding="5"><tr><td>
<a href="mitglieder/zimmer.html">
<img src="st_wolfinfo.gif" width=116 height=106 border=0 align=left></a></td>
<td><ul><center><font color=blue> I n h a l t </font></center>
<li> <a href="#a1"> NATO-Denkmal </a></li>
<li> <a href="#a2"> Ratlosigkeit </a></li>
<li> <a href="#a3"> Nachtrag zu Aminet-32</a></li>
<li> <a href="#a4"> Feedback </a></li>
</ul></td></tr></table>

<table border="0" cellpadding="5" width="100%"><tr><td>
<p><a name="a1"><font color="800000" size="5">
<b>NATO - Denkmal </font></b>
</a></p>

<p> Auch wenn ich bis dato keinen Erfolg verbuchen kann, um wenigstens
einen ganz kleinen Artikel &uuml;ber die Windrose schreiben zu k&ouml;nnen,
bleibe ich weiterhin am Ball, ich meine am Thema und versuche endlich
Hintergrundinformationen zu bekommen. Die NATO als Organisation ist wohl so
gro&szlig;, dass jeder dort glaubt, der andere hat f&uuml;r mich schon
gearbeitet und so kommt halt leider sehr wenig Konstruktives dabei heraus.
Und f&uuml;r das Image in der &Ouml;ffentlichkeit ist dies auch kein
Ruhmesblatt, da diese Organisation wohl eine Reikarnation des alten
deutschen Beamtentums darstellt mit all seinen negativen
Erscheinungsformen.</p>

<p>Im Abstand von ca 6 - 8 Wochen werde ich immer wieder einen kleinen
Brief an das Headquarter in Br&uuml;ssel senden, bis doch einem ein
Kronleuchter aufgeht, dass hier mehr Informationsbed&uuml;rfnis besteht,
als immer nur die gleichen Statements zu h&ouml;ren, wie wichtig so eine
Organisation f&uuml;r den Frieden ist und welche Verantwortung jeder hat,
so dass f&uuml;r Randbed&uuml;rfnisse keine Zeit mehr &uuml;brig bleibt.
Gegen Ende des Jahres werde ich aber dann (aus Frust) meine
Aktivit&auml;ten einstellen. </p>
Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p>
<a name="a2"><font color="800000" size="5">
<b>Ratlosigkeit</font></b></a></p>

<p>Wenn ich einmal meine Meinung als Artikel verfasse und w&uuml;nsche mir
einen Feedback, dann setze ich ihn in die Rubrik &quot;Diskussionen&quot;.
F&uuml;r Statements habe ich ja die hier vorliegende Form eingerichtet. Es
hat mich auch gefreut, dass eine Ressonanz erschienen ist, sowohl in Form
von Leserbriefbeitr&auml;gen wie ein Antwortartikel. Und das Alles
m&ouml;chte ich nun nicht unbeantwortet im Raum stehen lassen. </p>

<p>Leider muss ich auch diesmal feststellen, dass meine Beitr&auml;ge
entweder etwas fl&uuml;chtig gelesen werden oder ich dr&uuml;cke mich
missverst&auml;ndlich aus. Als erstes m&ouml;chte ich aber ein Fakt gerade
r&uuml;cken: Statuten sind Vereinbarungen und kein Gesetz im Sinne eines
rechtlichen Erlasses. Denn das Wort Grundgesetz kann ich leider nur in
diese Richtung auslegen, obwohl der Begriff &quot;Gesetz&quot; f&uuml;r
alles und nichts herangezogen werden kann. Jede noch so ver&uuml;ckte These
wird als Gesetz betituliert, solange nichts anderes bewiesen worden ist.
Statuten werden erst dann zu einer Satzung, wenn diese Vereinbarungen
gerichtlich festgeschrieben sind. Und das geht auch nur bei juristischen
Institutionen, wie eingeschrieben Vereinen, &ouml;ffentliche
K&ouml;rperschaften usw usw. Jede Vereinigung wie Kegelverein,
Thekenmannschaft, Mafia und Computerclubs (also nicht rechtlich
eingeschriebene Vereinigungen) haben Statuten, entweder festgeschrieben
oder durch m&uuml;ndliche Anweisung des Bosses. In unserem Falle nennt sich
das Richtlinien zum Artikelschreiben. Eine Satzung k&ouml;nnen wir uns erst
dann geben und bewilligen (Mitspracherecht), wenn unser Club ein
eingeschriebener Verein mit gew&auml;hltem Vorstand ist. Ein Club wird
meist autonom gef&uuml;hrt und alle haben zu tun, was der Boss sagt.
Vorschl&auml;ge kann jeder machen, aber das Sagen hat nur einer. Das sind
mal die ungeschriebenen Regeln aller Clubs. Und die Zeiten, wo die Wahl des
Vorsitzes mit der Keule ausgetragen wurde, sind vorbei (au&szlig;er bei der
Mafia o.&auml;. Gruppierungen). </p>

<p>Nun komme ich mal zu einem Beispiel, wo ich wieder einmal falsch
interpretiert worden bin. Und ich dachte, ich h&auml;tte mich klar und
deutlich ausgedr&uuml;ckt. Ich werde diese Passage nochmals bringen und die
W&ouml;rter, auf die es ankommt, rot hervorheben:
<blockquote><i>
Porno <font color=red>kann sich stimulierend</font> auf alle
m&ouml;glichen k&ouml;rperlichen Funktionen <font
color=red>auswirken</font>. Schaden <font color=red>kann</font> sie nur
denen, die <font color=red>schon</font> einen geistigen Defekt <font
color=red>haben</font>. Aber Horror? <font color=red>Wenn</font> sich das
f&uuml;r jemanden stimulierend auswirkt, <font color=red>dann</font> hat
er schon einen geistigen Defekt. Usw. usw. </i>
</blockquote>
Wenn ich Porno schreibe, meine ich auch Porno und nicht Sex oder sonst eine
abgeschw&auml;chte Definitionsstufe. Durch die h&auml;ufig falsch
angewandte Definitionsart wird auch das Wort &quot;Porno&quot;
&Auml;nderung des urspr&uuml;nglichen Sinnes durchmachen, wie z.B. die
W&ouml;rter: &quot;ordin&auml;r&quot; und &quot;vulg&auml;r&quot;.
Urspr&uuml;nglich hatten diese W&ouml;rter einen ganz anderen Sinn und
Bedeutung. </p>

<p>Antworten, wie:
<blockquote><i>
Seit wann ist Pornographie verboten? Ich darf daran erinnern das jemand mal
einen genialen Report &uuml;ber ErotikCD`s geschrieben (und ver&ouml;ffentlicht)
hatte, ..... </i>
</blockquote>
beweisen doch, dass das Wort &quot;Pornografie&quot; vollkommen falsch
definiert wird. Und
<blockquote><i>
Und das diverse Gliedma&szlig;en ihren Platz verlie&szlig;en um einige
Flugstunden zu nehmen, tja, es ist eben so. </i>
</blockquote>
zeigen mir, dass ich doch antiquiert bin und manche Jugendlichen heute in ihrer
Einstellung zur zwischenmenschlichen Ethik nicht mehr verstehe. Aber aus anderen
Kommentaren konnte ich auch das Gegenteil herauslesen und das tat meiner armen
Seele wieder gut und ich brauche doch nicht hoffnungslos in eine
hoffentlich nicht traurige Zukunft blicken.
<blockquote><i>
&Uuml;brigens, das war ein Splatterfilm und kein Horrorfilm. Darin liegt ein
Unterschied wie zwischen Drama und Kom&ouml;die. </i>
</blockquote>
Ob lustig oder traurig, es bleibt das gleiche Genre. Gewalt bleibt Gewalt,
egal ob dabei gelacht wird (was ich sogar noch schlimmer ansehe) oder ob
geweint wird. Lachen &uuml;ber angewandte Gewalt an Dritten charakterisiert
die totale innerliche Verrohung und das Fehlen von sensiblen Empfindungen.
Dagegen zeigt Gruseln noch Ans&auml;tze von Regungen. </p>

<p>Eines m&ouml;chte ich aber noch anf&uuml;gen d&uuml;rfen. Wenn man ein
Wort nicht versteht, dann sollte man &uuml;ber dessen Bedeutung nachlesen.
Stimulierung (nicht Stimulanz) ist ein Reizen, eine Erregung, die bis zur
Abschaltung der geistigen Zurechnungsf&auml;higkeit gehen kann, und nicht
die Vorstufe, wie Erh&ouml;hung des Adrenalinspiegels oder Spannung
erzeugen. </p>
<blockquote><i>
Hoffentlich hast du dir die Kommentare nicht zu sehr zu Herzen genommen.
Aber dieses Thema muss jeder f&uuml;r sich abkl&auml;ren und seine Grenzen
muss jeder selbst definieren. </i>
</blockquote>
Doch ich habe mir den ganzen Beitrag zu Herzen genommen, da leider wirklich
nicht der eigene Standpunkt genau zu definieren und einzuordnen ist.
</p>
Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p>
<a name="a3"><font color="800000" size="5">
<b>Nachtrag zu Aminet-32</font></b></a></p>

<p>Nachdem ich die Besprechung von Aminet-32 gemacht hatte, unterrichtete
ich auch Herrn Ossowski von Schatztruhe, dass das gesamte Dokument
&quot;SelfHTML&quot; fehlt. Als umgehende Antwort bekam ich folgende Mail:
<blockquote><i>
Die Datei SelfHTML wurde aus dem Aminet entfernt, da z.Zt. Abmahnungen
gegen alle Sites herausgegangen sind, die diese gespiegelt hatten. Um nicht
Gefahr zu laufen, eine gerade aktuelle Aminet-CD aus dem Markt nehmen zu
m&uuml;ssen, wurde das entsprechende Archiv bis zur endg&uuml;ltigen
Kl&auml;rung der Situation entfernt. <br><br>

Mit freundlichen Gr&uuml;&szlig;en,<br><br>

Dieter M&uuml;ller<br><br>

BTW: Vote against Spam at http://www.politik-digital.de/spam/<br>
--<br>
Stefan Ossowskis Schatztruhe, Gesellschaft fuer Software mbH<br>
Veronikastr. 33, 45131 Essen, Germany<br>
Phone: ++49-201-788778        Fax:   ++49-201-798447<br>
TechSupport: ++49-201-793010 (Mo.-Fr. 10.00-16.30)<br>
WWW:   http://www.schatztruhe.de/<br>
Email: support@schatztruhe.de <Technical Support> </i>
</blockquote>
Ein weiterer Kommentar meinerseit er&uuml;brigt sich wohl. H&ouml;chstens
eines zur Erl&auml;uterung, die Abmahnungen kommen nicht vom Verfasser oder
aus dessen Freundeskreis. Und ich dachte, die unruhigen Zeiten aus den
fr&uuml;hen 90er seien vor&uuml;ber. Wie man sich t&auml;uschen kann. </p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p>
<a name="a4"><font color="800000" size="5"><b>Feedback </font></b></a></p>

<p>
</p>
<ul>
<li> <b> </b> von </li>
<li> <b> </b> von </li>
<li> <b> </b> von </li>
<li> <b> </b> von </li>
<li> <b> </b> von </li>
</ul>
</td></tr></table>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
</td></tr></table>
<br>
</body>
</html>
