<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Steuer Profi `98 - Der Test</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="GREEN">Steuer Profi `98
(CD)</FONT></H1></CENTER></P>

Windows PC`s werden z.Zt. geradezu von Steuertools &#252;bersch&#252;ttet; auf dem
Amiga sieht es in dieser Hinsicht zwar nicht ganz so rosig aus, aber auch
f&#252;r dieses Jahr hat Stefan Ossowskis Schatztruhe eine neue Version ihres
bekannten Steuer Profi herausgebracht. Mal sehen, ob das Tool sein Geld auch
wert ist.</P>

<h2><CENTER><FONT COLOR="YELLOW">Der Inhalt:</FONT></h2></CENTER></P>
Wurden die ersten Versionen des Steuerprofi vor einigen Jahren noch auf
Diskette geliefert, so ist man inzwischen auf das Medium CD umgestiegen. Mit
93 MB ist die CD zwar nicht unbedingt bis an den Rand gef&#252;llt, enth&#228;lt aber
dennoch viel Material zum Themenkomplex Steuern. Im einzelnen befinden sich
folgende Programme auf der CD:</P>
<ul>

<li>Steuer Profi `93<BR>
<li>Steuer Profi `94<BR>
<li>Steuer Profi `95<BR>
<li>Steuer Profi `96<BR>
<li>Steuer Profi `97<BR>
<li>Steuer Profi `98<BR>
<li>Haushaltsbuch 3.0</P>
</UL>

Dazu kommt noch folgendes Zusatzmaterial:</P>
<UL>
<li>Einkommensteuergesetz (sehr ausf&#252;hrliche AG Datei)<BR>
<li>Steuerb&#246;gen `95-`98 (in verschiedenen Aufl&#246;sungen /
Formaten)<BR>
<li>Anleitungen</P>
</UL>

Sicherlich darf man &#252;ber den Nutzen der &#228;lteren Steuer Profi Versionen (die
l&#228;ngst nicht mehr auf dem aktuellen Stand des Geschehen sind und deswegen
auch von keinem User gebraucht werden) streiten. Aber da man ja ohnehin auf
das Medium CD umgestiegen ist, stellen diese (wohlgemerkt &#252;berfl&#252;ssigen)
Versionen auch kein Problem dar; selbiges gilt auch f&#252;r die Anleitungen zu
den &#228;lteren Versionen. <BR>
Auch bei den Steuerb&#246;gen von `95-`97 muss man sich fragen, was diese auf der
CD verloren haben. Denn ausser historischen Nutzen, erkenne ich darin keinen Sinn.</P>

<HR></P>

Im folgenden m&#246;chte ich mal auf die interessanten
Teile der CD genauer eingehen:</P>

<h2><CENTER><FONT
COLOR="WHITE">Einkommensteuergesetz:</FONT></h2></CENTER></P>
In diesem Ordner befinden sich drei Amiga Guide Dateien (insgesamt 700 KB
gro&#223;), die die einzelnen Paragraphen des Einkommensteuergesetztes enthalten
und bei kleineren Problemen sicherlich Aufschluss geben k&#246;nnen. Allerdings
sollte man sich in der Materie etwas besser auskennen, da es ansonsten
relativ schwierig ist, aus dem Beamtenjargon n&#252;tzliche Informationen
herauszuziehen. Ein weiteres Problem bei dieser Sammlung besteht darin, da&#223; diese von
`95 stammt und somit, zumindest teilweise, schon wieder &#252;berholt sein
d&#252;rfte. Inwieweit die Informationen noch zutreffend sind, kann ich
allerdings nicht sagen, da ich beileibe kein Experte in diesem Genre
bin.</P>


<h2><CENTER><FONT COLOR="BLUE">Haushaltsbuch 3.0:</FONT></h2></CENTER></P>
Dieses Tool d&#252;rfte langj&#228;hrigen User des Steuer Profi mitlerweile bekannt
sein. Das macht ja grunds&#228;tzlich auch nichts, h&#228;tte man sich im Hause
Ossowski wenigstens dazu durchgerungen, da&#223; Programm an den aktuellen Stand
der Dinge anzupassen, denn immerhin datiert das &quot;Haushaltsbuch&quot; von 1993;
dementsprechend sieht nat&#252;rlich auch die Oberfl&#228;che (GUI) aus.
Wenn man das &#196;u&#223;ere mal au&#223;en vor l&#228;&#223;t und sich voll auf das Programm selber
konzentriert, kommt ein gut gemachter Verwalter &#252;ber Ein- und Ausgaben zu
Tage. Wie der Name schon sagt, verwaltet das Haushaltsbuch ihre Finanzen .
Mittels des Haushaltsbuches k&#246;nnen sie jerdezeit feststellen, wieviel sie
wann und wof&#252;r ausgegeben haben. F&#252;r Leute, die immer die volle Kontrolle
&#252;ber ihre Ein- und Ausgaben haben wollen (und sich diese ggbf. auch grafisch
veranschaulichen lassen wollen), ist das Haushaltsbuch sicherlich ein
interessantes Tool. Ein Gro&#223;teil der User wird es h&#246;chstwahrscheinlich aber eher als
Spielerei abtun.</P> <CENTER>
<img src="sprofi1.png"></CENTER></P><BR>

<h2><CENTER><FONT COLOR="red">Steuerb&#246;gen:</FONT></h2></CENTER></P>
Wie oben schon erw&#228;hnt befinden sich auch die Steuerb&#246;gen der Jahre `95 bis
`98 auf der CD. Diese liegen sowohl in hochaufl&#246;sender, normalaufl&#246;sender und echtfarbiger Form
vor (in den Formaten iff, gif und teilweise tiff und jpg). Diese kann man
dann nat&#252;rlich mittels eines Druckers zu Papier bringen, allerdings gibt es
bei den echtfarbigen Steuerb&#246;gen ein (kleines?) Problem: Die JPG Dateien
sind in der Regel um die 300 KB gro&#223;. Um diese allerdings zu Papier zu
bringen, ben&#246;tigt man ein entsrechendes Programm. Aber sowohl ArtEffect,
ArtPro als auch MultiView (sowie diverse weitere PD Tools) weigerten sich,
die Grafik zu laden, mit der Begr&#252;ndung &quot;Speicherplatzmangel&quot; (ich habe 16
MB Fast Ram, 2 MB Chip Ram sowie eine Picasso IV). Lediglich der
Grafikpublisher von TurboPrint war zu einer Zusammenarbeit zu &#252;berreden. Und
nat&#252;rlich sollte noch erw&#228;hnt werden, da&#223; ein hochklassiger Ausdruck (720 X
720 DPI) verdammt viel Zeit in Anspruch nimmt. Ebenfalls bemängelt werden
sollte die nicht alzu hohe "Qualität" der Steuerbögen. Die gebotene Qualität
eignet sich somit nur zu Probedruckzwecken.</P>
<HR>

<h1><CENTER><FONT COLOR="GRAY">Steuer Profi `98</FONT></h1></CENTER></P>
Kommen wir aber nun endlich zu dem Hauptkaufgrund dieser CD: Dem Steuer
Profi `98 (auf die &#228;lteren Versionen gehe ich hier mal nicht genauer ein).
Aber schon beim ersten Start offenbart sich mir der erste Schock: Die
Oberfl&#228;che! Diese ist zum einen im tristen Grau gehalten (schonmal was von
MUI geh&#246;rt?), und zum anderen nicht frei konfigurierbar. Ok, unter HighRes mag das
ganze ja recht nett aussehen, aber mit einer Aufl&#246;sung von 1024 X 768 muss
man sich schon bem&#252;hen, den Topaz Font (8 Pt.) zu erkennen; zumal sich
dieser auch nicht &#228;ndern l&#228;sst. Grafikkartenuser sind also praktisch schon
gezwungen, die Aufl&#246;sung niedriger zu stellen, den auch Patches nutzen nicht mehr viel (z.B. MCP).
</P><CENTER>
<img src="sprofi2.png"></CENTER></P><BR>

<h2><CENTER><FONT COLOR="ff1234">In der Praxis:</FONT></h2></CENTER></P>
Um den Steuer Profi `98 auf Herz &amp; Nieren zu pr&#252;fen, habe ich mir zusammen
mit meinem Vater die letztj&#228;hrige Steuererkl&#228;rung geschnappt und diese mit
dem Steuer Profi nochmals durchgerechnet. Aber fangen wir mal vorne an:
Zuerst einmal m&#252;ssen alle pers&#246;nlichen Daten (Eink&#252;nfte etc.) sowie
Allgemeine Angaben zur eigenen Person gemacht werden; eben wie man es auch
von den &quot;normalen&quot; Steuererkl&#228;rungen gewohnt ist. Im Anschluss daran f&#252;hrt
einen der Steuer Profi durch alle Formulare, die ausgef&#252;llt werden m&#252;ssen.
Diese sind zwar etwas anders angeordnet als im Original, aber soetwas f&#228;llt
jemandem, der noch nie eine Steuererkl&#228;rung gemacht hat (so wie ich),
ohnehin nicht auf. Alternativ kann man auch versuchen, jedes Formular
einzeln auszuf&#252;llen, wobei die automatische Art (also die, in der der Steuer
Profi durch die Formulare f&#252;hrt) allemal zu preferrieren ist. Die Eingaben
selber gehen &#252;ber die Tastatur sehr einfach &#252;ber die B&#252;hne, auch wenn es
mitunter nervig ist, auf Ja / Nein Fragen erst die entsprechende Antwort zu
tippen (eine Checkbox w&#228;re da die bessere Alternative gewesen).</P>

Nachdem man sich also durch alle Formulare gew&#252;hlt hat (ich habe noch nie 3
so langweilige Stunden vor dem Amiga verbracht), ist nat&#252;rlich das Resultat
interessant: Der Steuer Profi kommt exact auf den selben Wert, den mein
Vater seinerzeit selbst herausbekommen hatte. Somit hat der Steuer Profi
sein prim&#228;res Ziel erreicht. Aber was n&#252;tzen einem schon die Daten im
Computer? Immerhin m&#252;ssen diese noch zum Finanzamt transportiert und was
liegt da n&#228;her als ein entsprechender Ausdruck? Also Drucker angeschlossen
und einige Probeseiten vom Steuerprofi ausdrucken lassen und siehe da, alle
Eingaben sa&#223;en perfekt in den auf den Steuerb&#246;gen vorgefertigten B&#246;gen.
Allerdings muss hier negativ hervorgehoben werden, da&#223; nicht alle
auszuf&#252;llenden Formulare auch gedruckt werden k&#246;nnen (z.B. fehlte die
Druckvorlage f&#252;r &quot;Eink&#252;nfte aus dem Gewerbebetrieb&quot;). Nichtsdestrotz
mei&#223;terte der Steuer Profi seine eigentliche Aufgabe recht ordentlich, auch
wenn der Zeitaufwand in beiden F&#228;llen (mein Vater brauchte seinerzeit etwa 4
Stunden; etwas weniger als wir beide jetzt f&#252;r das Ausf&#252;llen der Steuerb&#246;gen, die
ja auch noch gedruckt werden m&#252;ssen) etwa gleich ist; von einer erheblichen
Vereinfachung kann also nicht die Rede sein.</P><CENTER>
<img src="sprofi3.png"></CENTER></P><BR>

Zus&#228;tzlich dazu erh&#228;lt man noch einige Steuertools f&#252;r `99 (z.B.
Vorsorgeberechnung, Kirchensteuer etc.), die ein netter Bonus sind.</P>

<h2><CENTER><FONT COLOR="GRAY">Ach ja: Die
Anforderungen</FONT></h2></CENTER></P>
Offenbar hat man sich M&#252;he gegeben, die CD auch auf &#228;lteren Maschinen
lauff&#228;hig zu machen. Dementsprechend halten sich auch die
Hardwareanforderungen in Grenzen: Es wird lediglich ein Amiga mit OS 2.1, 1
MB Ram und ein CD Laufwerk ben&#246;tigt; eine Festplatte ist noch nicht mal
n&#246;tig. Nat&#252;rlich kann man nun &#252;ber den Sinn (oder Unsinn) einer solchen
Vorgehensweise streiten, aber wenn im n&#228;chsten Jahr der Steuer Profi
`99
rauskommt (was geplant ist), dann hoffe ich, da&#223; die Hardwareanforderungen
etwas gestiegen sind (nicht zuletzt wegen einer hoffentlich besseren GUI).</P> 

<h2><u><B><CENTER>Ziel erreicht?</h2></CENTER></U></B></P>
Eine schwierige Frage; da&#223; muss ich ehrlich gestehen. Zum einen hat man sich
offenbar beim Zusammenstellen der CD M&#252;he gegeben (immerhin h&#228;tte man den
Steuer Profi auch auf Disketten liefern k&#246;nnen) und der Steuer Profi `98
rechnete auch v&#246;llig korrekt. Zum anderen lassen sowohl die Oberfl&#228;che als
auch die starre Bedienung wieder Zweifel an der 99 DM (Update: 49 DM) teuren Investition
aufkommen (die aber steuerlich absetzbar ist :-))). Da sich das
Zeitverh&#228;ltniss im Gegensatz zum konventionellen Weg in etwa in der Waage
h&#228;lt, muss hier jeder selber entscheiden, ob er das n&#246;tige Kleingeld &#252;brig
hat.</P><BR><CENTER>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Stefan Ossowskis Schatztruhe</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>ca.99 DM</TD>
</TR>
<TR>
<TD>Inhalt</TD>
<TD>Steuerprogramme</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>93 MB</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>65 %</TD>
</TR>
</TABLE>





<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
