<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Page Design</title>
</head>
<body background="wolf1.gif" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#800000" size="7">
<b>Page Design</font></b></p>
<table width=100% cellspacing=3 cellpading=3 border=0><tr><td>
<p>Bei der Erstellung unserer eigenen Homepage oder schon bei der
Gestaltung der Artikel f&uuml;r die NoCover gibt es Grunds&auml;tzliches zu
beachten, n&auml;mlich die Erscheinungsform und die Funktionalit&auml;t.
Die grafische Gestaltung ist dazu da, eine visuelle Logik zu schaffen.
Gemeint ist damit die optimale Ausgewogenheit zwischen dem visuellen
Eindruck einerseits und den in Grafik oder Text enthaltenen Informationen
andererseits. Wirken Form, Farbe und Kontrast nicht optimal zusammen, ist
unsere neue Web-Seite grafisch nichtssagend und regt den Betrachter nicht
dazu an, ihren Inhalt zu erforschen. Dichtgeschriebene Textdokumente, wie
die meisten NC-Beitr&auml;ge, in denen es vers&auml;umt wurde, durch
Grafiken, ein sorgf&auml;ltiges Seitenlayout und eine ansprechende
Typografie (verkehrte Font-Gr&ouml;&szlig;e, wie einfache Benutzung von
&lt; H2&gt; f&uuml;r Texte) Kontraste und Auflockerung zu schaffen, sind
schwieriger zu lesen als solche, bei denen diese Gestaltungsprinzipien
ber&uuml;cksichtigt wurden. </p>

<p><img src="work_pgds1.gif" alt="Grafiken?" width="109" height="308"
align=left cellspacing=5 cellpadding=5 border=0> Wo liegen die
gr&ouml;&szlig;ten grafischen Gestaltungshindernisse, wenn wir versuchen,
ein ideales Gleichgewicht auf einer Web-Seite herzustellen? Erstens in der
vertikalen, listenorientierten Struktur von HTML, wie sie in den
derzeitigen Web-Browsern zutage tritt, und zweitens in den praktischen
Bandbreitenbeschr&auml;nkungen f&uuml;r die Zugangsgeschwindigkeiten der
Benutzer, die derzeit von 14.4 kbps Modems bis hin zu ISDN-Geschwindigkeit
oder mehr variieren. In den NC-Beitr&auml;gen sind zu viele Grafiken im
Beitrag wieder hinderlich, nicht nur des Platzes wegen. </p>

<p>Wenden wir uns heute der Gestaltung der eigenen Homepage zu. Wenn wir
unsere Besucher nicht vergraulen wollen, kommen wir nicht umhin, f&uuml;r
eine visuelle und funktionale Kontinuit&auml;t von Struktur und grafischer
Gestaltung zu sorgen. Eine sorgf&auml;ltige, systematische Seitengestaltung
kann das Navigieren erleichtern, die Zahl der Fehler verringern und es
f&uuml;r den Besucher bequemer machen, Informationen und Features unserer
Web-Site uneingeschr&auml;nkt zu nutzen. </p>

<p>Wenn wir auf der Homepage ein gro&szlig;es grafisches Men&uuml;
verwenden, sollten wir uns einmal genau &uuml;berlegen, was passiert, wenn
der Besucher den Grafikmodus seines Web-Browsers deaktiviert hat. Unsere
Informationen, die wir in die Grafiken unserer Web-Seite gepackt haben,
gelangen so nie zum Benutzer. </p>

<p>Jetzt aber genug der Vorrede. Jetzt ein Paar Worte von Leuten, die es
wissen m&uuml;ssen: </p> <blockquote> <p>Die wichtigste Aufgabe der
grafischen Gestaltung besteht darin, eine starke, konsequente visuelle
Hierarchie zu schaffen. In ihr werden die wichtigen Elemente in den
Vordergrund gestellt, die Inhalte in logischer und vorhersagbarer Weise
geordnet..</p>

<p>Grafische Gestaltung ist visuelles Informationsmanagement mit Hilfe von
Layout, Typografie und Illustration. Dieses Mittel wird dazu verwendet, den
Blick des Lesers &uuml;ber die Seite zu f&uuml;hren. Er nimmt eine Seite
zuerst als eine gro&szlig;e Ansammlung von Formen und Farben wahr, bei der
sich die Elemente des Vordergrunds gegen den Hintergrund abheben. Erst in
zweiter Linie beginnt er, spezifische Informationen, zun&auml;chst aus
eventuellen Grafiken, wahrzunehmen. Erst dann beginnt er in die Tiefe des
Mediums einzudringen und einzelne Worte und Phrasen zu lesen. </p>

<p>Aus diesem Grund ist die allgemeine grafische Ausgewogenheit und Ordnung
der Seite entscheidend daf&uuml;r, ob es gelingt, den Leser f&uuml;r den
Inhalt der Site zu gewinnen. Eine langweilige Seite mit Flie&szlig;text
wirkt abschreckend auf das Auge, weil sie sich als eine Masse
undifferenzierten Grautons pr&auml;sentiert. Gleichzeitig macht eine Seite,
die von schlecht gestalteten oder zu aufdringlichen Grafiken oder Schriften
dominiert wird, einen schlechten Eindruck auf anspruchsvolle Benutzer, die
nach aussagekr&auml;ftigen Inhalten Ausschau halten. Daher sollte eine
Ausgewogenheit angestrebt werden, die das Auge durch visuelle Kontraste
anzieht. </p> </blockquote> <center><img src="work_pgds2.gif"
alt="Seitenlayout" width="256" height="179"> </center>

<p>Diese S&auml;tze stimmen Wort f&uuml;r Wort und ich kann jeden einzelnen
Satz unterstreichen. Proportionen und Angemessenheit sind die wichtigsten
Faktoren f&uuml;r eine erfolgreiche Gestaltung. Entscheidungen hinsichtlich
dieser Faktoren k&ouml;nnen nur im Kontext unserer allgemeinen
Vorstellungen und Absichten bei der Entwicklung der Web-Site getroffen
werden. Weiterhin m&uuml;ssen wir die Art der Inhalte und vor allem die
Erwartungen der Besucher ber&uuml;cksichtigen.</p>

<p>Wenn wir beachten, dass wir von links nach rechts und von oben nach
unten lesen, haben wir schon eine Gestaltungsentscheidung und eine
Ausgangsbasis f&uuml;r das grafische Design unseres Seitenlayouts.
Ber&uuml;cksichtigen wir noch den typischen 14 bis 16 Zoll gro&szlig;en
Computermonitor, wo zun&auml;chst keine 640×480 Fl&auml;chen erscheinen,
sondern nach Abzug des Browserdesigns meist eine ca. 600×360 gro&szlig;e
Seite zu sehen ist. Zarte Pastellt&ouml;ne eignen sich am besten als
Hintergrund oder f&uuml;r kleinere Elemente, vor allem dann, wenn wir in
der Grafikgestaltung und Farbauswahl noch Neuling sind. Vermeiden wir also
unbedingt grelle, hochsaturierte Prim&auml;rfarben, ausgenommen in
Bereichen, die besonders betont werden sollen. Aber selbst dort sind diese
Farben mit Vorsicht zu verwenden. Buchstaben m&uuml;ssen sich immer scharf
von der Hintergrundfarbe abheben. Wenn auff&auml;llige oder komplexe
Grafiken verwendet werden, sollten wir uns erst dann heranwagen, wenn wir
etwas professioneller geworden sind. Am Anfang ist es deshalb sehr
sinnvoll, alles eher konservativ, konventionell und einfach zu gestalten.
</p>

<p>H&uuml;ten wir uns vor grafischen Verschn&ouml;rkelungen. Horizontale
Trennlinien, kreisf&ouml;rmige Absatzmarken, Piktogramme und andere
visuelle Markierungen haben in manchen F&auml;llen zwar durchaus ihre
Berechtigung, sollten aber, wenn &uuml;berhaupt, nur sparsam verwendet
werden, um einen zersplitterten und verwirrenden Layouteindruck zu
vermeiden. Dasselbe gilt f&uuml;r gr&ouml;&szlig;ere Schriftgrade, die von
den meisten Web-Browsern bei der Verwendung der H1 und H2 Header-Tags
angezeigt werden. Ein &uuml;berm&auml;&szlig;iger Einsatz all dieser
Faktoren wirkt wie ein Patchwork - alles ist grell und bunt, nichts wird
wirklich betont. </p>

<p>Erstellen wir uns ein Layout-Gitternetz und dieses dient uns als
Hintergrundbild als <a href="work_pgds3.gif"> Vorlage</a> f&uuml;r den
Umgang mit dem Text und den Grafiken. An diese Vorlage halten wir uns dann
konsequent. So sorgen wir daf&uuml;r, dass alle Seiten unserer Site einen
bestimmten Rhythmus und ein einheitliches Erscheinungsbild haben.
Wiederholungen sind in diesem Fall nicht langweilig, sondern geben ihr eine
grafische Identit&auml;t. So wird das spezifische
&quot;Ortsgef&uuml;hl&quot; verst&auml;rkt, durch das unsere Homepage den
Besuchern besser im Ged&auml;chtnis bleibt. </p>

<p>Zum Abschluss f&uuml;r heute m&ouml;chte ich noch sagen, versucht nicht
mit Gewalt einen bestimmten Stil zu kreieren, aber achtet auf der anderen
Seite auch darauf, nicht einfach grafische Elemente einer anderen Site oder
einer gedruckten Publikation zu importieren. Der grafische und
redaktionelle Stil unserer Web-Site sollte sich aus dem nat&uuml;rlichen
Umgang mit Inhalt und Seitenlayout ergeben.</p>

<p>Und noch ein wichtiger Hinweis:<br> Vergessen wir nicht, dass es um das
World Wide Web geht. Denken wir daran, dass jeder unsere Seiten lesen kann.
Auch wenn der ausl&auml;ndische Besucher deutsch spricht, helfen wir ihm am
besten damit, dass wir keinen Dialekt und keine &quot;In-Group&quot;-
Bezeichnungen benutzen. Dazu geh&ouml;ren auch ungew&ouml;hnliche oder
seltene Abk&uuml;rzungen, die wir gepflegentlich vermeiden sollten. Und vor
allen Dingen. vergessen wir nicht, dass Datums- und Zeitkonventionen
verschieden interpretiert werden k&ouml;nnen. K&uuml;rzt also Datumsangaben
nicht ab. F&uuml;r einen Deutschen bedeutet 11.08.99 den 11. August 1999,
f&uuml;r einen Amerikaner jedoch den 8. November 1999.</p>
</td></tr></table>

<hr size=4>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
</td></tr></table>
<br>
        
</body>
</html>
