<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Homepage</title>
</head>
<body background="wolf1.jpg" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#800000" size="7">
<b>Die Struktur unsere Homepage</font></b></p>
<p>Es ist einleuchtend, dass gro&szlig;e &quot;Informationsbrocken&quot;
aufgeteilt werden sollten, denn kleinere Informationseinheiten sind
&uuml;bersichtlicher und leichter verst&auml;ndlich. Statistisch ist
festgestellt, dass die meisten Menschen in ihrem Kurzzeitged&auml;chtnis
nur vier bis sieben verschiedene Informationseinheiten speichern
k&ouml;nnen. Also ist darauf zu achten, die Zahl der einzelnen Elemente,
die der Leser in sein Kurzzeitged&auml;chtnis aufnehmen muss,
m&ouml;glichst gering zu halten, weil kleinere, in sich geschlossene
Informationseinheiten funktioneller und &uuml;bersichtlicher sind als lange
einf&ouml;rmige Einheiten. </p>

<p>Die meisten Web-Sites enthalten Informationen, die von den Besuchern in
kleinen Einheiten abgerufen werden k&ouml;nnen. Es kommt nur selten vor,
dass ein Besucher auf dem Bildschirm lange, zusammenh&auml;ngende
Textpassagen liest. Wer auf der Suche nach einer bestimmten Information
ist, m&ouml;chte schnell finden, was er sucht. Er empfindet es als
st&ouml;rend, sich durch lange Texte durcharbeiten zu m&uuml;ssen. L&auml;ngere
Passagen werden grunds&auml;tzlich als Textdatei abgespeichert und sp&auml;ter
offline gelesen. (Wo sind denn nun die sch&ouml;nen Bildchen geblieben?). </p>

<p>In unserem beruflichen und sozialen Alltagsleben wird nur selten von
uns verlangt, unser Wissen in detaillierten Hierarchien zu
pr&auml;sentieren oder die Zusammenh&auml;nge zwischen den einzelnen
Einheiten darzustellen. Wenn wir es jedoch vers&auml;umen, unserer Web-Site
ein solides und logisches R&uuml;ckgrat zu geben, wird sie auch dann
unfunktionell sein, wenn ihr grunds&auml;tzlicher Inhalt klar und gut
geschrieben ist. Bei der Organisation von Informationen gibt es vier
grundlegende Schritte zu beachten:
<ol>
<li> Aufteilung in logische Einheiten, </li>
<li> Erstellung einer Hierarchie nach Wichtigkeit und Allgemeinheit, </li>
<li> Verwendung dieser Hierarchie f&uuml;r die Strukturierung von
Beziehungen zwischen den einzelnen Informationseinheiten, und </li>
<li> Analyse des funktionalen und &auml;sthetischen Erfolgs des
Systems. </li></ol></p>

<p>Jede Form der Aufbereitung erfordert eine hierarchische Reihung nach
Wichtigkeit. Das selbst dann, wenn der einzige Zweck darin besteht, die
grundlegenden Navigationsstrukturen f&uuml;r den Besucher festzulegen. Die
meisten Informationseinheiten k&ouml;nnen und sollten nach ihrer
Wichtigkeit gereiht und nach dem Grad der Verbindung zwischen ihren
einzelnen Einheiten organisiert werden. <br>
<center>
<img src="work_homepage1.gif" alt="erste Gedanken" width="126" height="121">
<img src="work_homepage2.gif" alt="zweite Gedanken" width="114" height="96">
</center><br>
Sobald eine logische Gruppe von Priorit&auml;ten feststeht, kann man
darangehen, eine Hierarchie aufzubauen. Dabei beginnt man bei den
wichtigsten oder allgemeinsten Konzepten und endet bei den optionalen oder
spezifischsten Themen. Die hierarchische Organisation im Web ist eine
Notwendigkeit. Der Grund daf&uuml;r liegt darin, dass die meisten Web-Site-
und Link-Konzepte sich auf Hierarchien st&uuml;tzen und dabei vom
allgemeinsten &Uuml;berblick &uuml;ber die Site zu immer spezifischer
werdenden Sub-Men&uuml;s und Inhaltsseiten fortschreiten. </p>

<p> Wenn ein Besucher auf ein neues, komplexes Informationssystem trifft,
hat er gleich ein geistiges Modell vor Augen. In einem n&auml;chsten
Schritt verschafft er sich anhand dieses geistigen Modells eine Vorstellung
von den Beziehungen zwischen den einzelnen Themen. Au&szlig;erdem stellt er
Annahmen dar&uuml;ber auf, wo er Dinge finden k&ouml;nnte, die er noch
nicht entdeckt hat.<br>
<center>
<img src="work_homepage7.gif" alt="Hierarchische Struktur" width="343" height="189">
</center><br>
Der Erfolg unserer Homepage wird zu einem gro&szlig;en
Teil dadurch bestimmt, wie gut das tats&auml;chliches Organisationsmodell
mit den Erwartungen &uuml;bereinstimmt. Wenn die Site logisch
aufgebaut ist, kann der Besucher erfolgreiche Prognosen dar&uuml;ber
treffen, wo er die gesuchten Dinge auffinden kann. </p>

<p>Wenn der Besucher durch eine Struktur irregef&uuml;hrt wird, die nicht
logisch ist (oder die &uuml;berhaupt keinen verst&auml;ndlichen
Zusammenhang erkennen l&auml;&szlig;t), wird er st&auml;ndig frustriert,
weil er Schwierigkeiten hat, sich zurechtzufinden. Unsere Site sollte auf
keinen Fall aussehen wie das untenstehende: <br>
<center>
<img src="work_homepage5.gif" alt="Konfuse Struktur" width="359" height="164">
</center><br>
Nachdem wir unsere Site erstellt haben, sollten wir &uuml;berpr&uuml;fen,
ob sie ein ansprechendes Erscheinungsbild hat und ob der Aufbau praktisch
und effizient ist. Ob eine Web-Site richtig strukturiert ist, h&auml;ngt im
wesentlichen von folgenden Faktoren ab: <ul>
<li> von der Ausgewogenheit der Struktur </li>
<li> sowie der Beziehungen zwischen Homepage, Men&uuml;seiten und einzelnen
Inhaltsseiten oder verbundenen Grafiken und Dokumenten. </li></ul>

Dabei spielt es keine Rolle, welche Organisationsstruktur f&uuml;r die
Web-Site gew&auml;hlt wird. Das Ziel besteht darin, eine Hierarchie der
Men&uuml;s und der Seiten zu schaffen, die dem Besucher nat&uuml;rlich
erscheint und ihn bei seiner Arbeit mit der Site nicht st&ouml;rt oder in
die Irre f&uuml;hrt. Web-Sites wachsen manchmal auf eine fast unheimliche Weise,
und oft weitet sich ein urspr&uuml;nglich vern&uuml;nftiger Men&uuml;aufbau
mit der Zeit ins Uferlose aus. Sites mit einer zu flachen Link-Hierarchie
brauchen riesige Men&uuml;seiten, die mit der Zeit zu verwirrenden
"Einkaufszetteln" zusammenhangloser Informationen verkommen, die ohne
erkennbares System aufgelistet sind. <br>

<CENTER>
<img src="work_homepage6.gif" alt="zu flache Hierarchie."  width="341" height="111">
</center> <br>

Men&uuml;systeme k&ouml;nnen aber auch zu tief sein, indem die
Informationen unter zu vielen Men&uuml;schichten vergraben sind:<br>

<center>
<img src="work_homepage3.gif" alt="zu tiefe Hierarchie" width="349" height="225">
</center> <br>
Es ist &auml;rgerlich und unn&ouml;tig, sich durch viele Schichten
verschachtelter Men&uuml;s durchnavigieren zu m&uuml;ssen, bevor man
endlich auf die gesuchte Information st&ouml;&szlig;t. </p>


<p>Wenn unsere Web-Site aktiv w&auml;chst, wird das
Streben nach der richtigen Ausgewogenheit zwischen Men&uuml;s und Seiten zu
einem beweglichen Ziel. <br>
<center>
<img src="work_homepage4.gif" align=absmiddle width="355" alt="ausgewogene Hierarchie." height="234">
</center><br>
Wenn alles steht und eine Zeit verstrichen ist, holt euch Feedback von den Besuchern ein und
analysiert zudem selbst, wie die Site verwendt wird. Das kann manchmal
helfen festzustellen, ob das Men&uuml;schema evtl. nicht mehr ausreichend
n&uuml;tzlich ist oder ob es schlecht strukturierte Bereiche enth&auml;lt.
Es stimmt nat&uuml;rlich, dass komplexe Dokumentstrukturen tiefe
Men&uuml;hierarchien erfordern. Trotzdem sollte der Besucher niemals dazu
gezwungen werden, in eine Men&uuml;seite nach der anderen hineinzugehen,
wenn auch ein direkter Zugang m&ouml;glich w&auml;re. Man sollte versuchen,
einen gut ausgewogenen Hierarchiebaum zu schaffen. Dieser sollte einen
raschen Zugang zu den Informationen erm&ouml;glichen. </p>




<hr size=4>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
</td></tr></table>
<br>
        
</body>
</html>
