<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>gepa Fair Handelshaus</title>
</head>
<body background="wol1.jpg" text=black link=blue alink=red bgcolor="#ffffee"><br>
<a name="top"></a><br>
<font color="#800000" size="7">
<center><b>Fair Play - Fair Pay</b></font></center>

<img src="st_gepa.jpg" width=169 height=84 border=0 hspace=10 vspace=0 align="right">
<p><font size=+2>Fair gehandelte Fu&#223;b&#228;lle aus Pakistan </font></p>
<p><font size=+1>
Sialkot - Stadt der Fu&#223;b&#228;lle </font></p>

<p> Die Stadt Sialkot im Nordosten Pakistans ist die Heimat de pakistanischen
Sportartikelindustrie, Sialkot ist eine Stadt mit mehr als 500.000 Einwohner,
von denen heute ungef&#228;hr 20.000 bis 25.000 mit der Herstellung von
Sportartikeln besh&#228;ftigt sind. Vor allem werden Fu&#223;b&#228;lle
gefertigt, sie machen wertm&#228;&#223;ig rund 50% der gesamten
Sportartikelexporte Pakistans aus. Etwa 80% der Weltproduktion an
Fu&#223;b&#228;llen kommt aus Sialkot.</p>

<p> Fu&#223;b&#228;lle bestehen heute &#252;berwiegend aus Kunstleder, das mit
mehreren Lagen von Geweben unterklebt wird, die Fu&#223;ballblase ist meistens
aus Latex. Die Kunstlederst&#252;cke werden in f&#252;nfeckige bzw. in
sechseckige Grundformen gestanzt, aus denen dann die B&#228;lle in Handarbeit
mit Garn zusammengen&#228;ht werden. Die Materialien f&#252;r B&#228;lle hoher
Qualit&#228;t sind dabei vollst&#228;ndig importiert, bei B&#228;llen einfacher
Qualit&#228;t werden Materialien einheimischer Zulieferer verwendet.</p>

<p>Fu&#223;b&#228;lle, vor allem in hochwertiger Qualit&#228;t, bestehen heute
fast ausschlie&#223;lich aus industriell gefertigter Komponenten. Das
Zusammenn&#228;hen geschieht jedoch nach wie vor in aufwendiger Handarbeit.
Dieser handwerkliche Teil der Fu&#223;ballproduktion wird in der Regel von den
Exporteuren an Subunternehmer weitergegeben. In kleinen Werkst&#228;tten und vor
allem in famili&#228;rer Heimarbeit werden die Fu&#223;b&#228;lle in den
D&#246;rfern der l&#228;ndlichen Umgebung von Sialkot gen&#228;ht. Ben&#246;tigt
wird eigentlich nur ein Arbeitsraum, denn Maschinen sind nicht erforderlich.
Alle Materialien - die ausgestanzten Kunstlederst&#252;cke, die Blasen und das
Garn stellen die Exportfirmen zur Verf&#252;gung. Die N&#228;herInnen erhalten
St&#252;ckl&#246;hne, eine Registrierung nach dem pakistanischen
Arbeitsschutzgesetz liegt in der Regel nicht vor (damit fehlen jegliche
Sozialleistungen). Eine Wertsch&#246;pfung erfolgt beim N&#228;hen kaum,
lediglich Geschicklichkeit und Kraft sind einzubringen und entsprechend gering
sind die orts&#252;blichen St&#252;ckl&#246;hne. Die kleinen Werkst&#228;tten
und die HeimarbeiterInnen sind dar&#252;ber hinaus v&#246;llig von der
Auftragslage abh&#228;ngig. Arbeitsausf&#228;lle infolge fehlender Auftr&#228;ge
k&#246;nnen das Einkommen nochmals verringern.</p>

<p>Das N&#228;hen von Fu&#223;b&#228;llen ist, verglichen mit anderen
Besch&#228;ftigungsm&#246;glichkeiten in der Sportartikelindustrie in Sialkot,
eine relativ unsichere und schlecht bezahlte Arbeit, insbesondere f&#252;r
M&#228;nner. Ein Mann kann bei einer Arbeitszeit von 9 bis 10 Stunden
t&#228;glich 3 bis 5 B&#228;lle - in Abh&#228;ngigkeit von deren
Qualit&#228;tsstufe - zusammenn&#228;hen. Das mit dieser Arbeitsleistung
erzielbare Monatseinkommen reicht jedoch nicht aus, um die Familie zu
ern&#228;hren. zu der durchschnittlich 6 bis 8 Personen geh&#246;ren. Frauen und
Kinder sind so gezwungen, zum Familieneinkommen beizutragen.</p>

<p>Das N&#228;hen von Fu&#223;b&#228;llen in Heimarbeit geh&#246;rt zu den
wenigen Arbeitsm&#246;glichkeiten f&#252;r Frauen in der islamisch orientierten
Gesellschaft Pakistans. Eine Studie der Entwicklungsorganisation Save the
Children Fund (SCF, Stitching footballs; voices of Children in Sialkot,
Pakistan, 1997) belegt, dass der Anteil von Frauen im N&#228;hprozess 53%
betr&#228;gt. Wegen famili&#228;rer Pflichten arbeiten die Frauen zwar Teilzeit,
dennoch wird etwa ein Drittel der exportierten B&#228;lle von ihnen
gen&#228;ht.</p>

<p>Nach Sch&#228;tzung von Arbeits- und Menschenrechtsorganisationen arbeiten
derzeit rund 7000 Kinder in N&#228;hwerkst&#228;tten f&#252;r
Fu&#223;b&#228;lle. Diese illegal arbeitenden Kinder erwirtschaften
durchschnittlich 23% des Familieneinkommens bei einer Arbeitszeit, die einer
Vollbesch&#228;ftigung von bis zu 10 Stunden t&#228;glich entspricht und so
keinen Schulbesuch zul&#228;sst.</p>

<p>F&#252;hrende Sportartikelhersteller - beispielsweise Adidas, Nike und Reebok
- sind nicht nur wegen der Arbeitsbedingen in den asiatischen
Sportschuhwerkst&#228;tten, sondern ebenso wegen der Kinderarbeit bei der
Herstellung von Fu&#223;b&#228;llen in Sialkot in die Schlagzeilen geraten.
Durch die Einf&#252;hrung von Sozialstandards oder durch Vereinbarungen wie das
&quot;Atlanta Agreement&quot; vom Fr&#252;hjahr 1997 versuchen sie, der
schlechten Publicity zu begegnen. So sieht das &quot;Atlanta Agreement&quot;
vor, innerhalb von 18 Monaten (d.h. bis Ende 1998) die Kinderarbeit bei der
Produktion von Fu&#223;b&#228;llen im pakistanischen Sialkot abzuschaffen.</p>

<p>Aus diesem Grunde werden seit 1997 an zentralen Orten gro&#223;e
N&#228;hzentren eingerichtet, in denen bis zu 500 erwachsene N&#228;her
arbeiten. Kinder und Frauen sind dort nicht mehr besch&#228;ftigt. Die
N&#228;her werden aus einem Umkreis von 15 bis 20 km mit Bussen herangeschafft;
die hohe t&#228;gliche Arbeitszeit wird dadurch nochmals mit etwa einer Stunde
Fahrtzeit belastet. Die Arbeitsbedingen in den N&#228;hzentren sind in der Regel
gut (Ventilation, Sanit&#228;reinrichtungen, Kantinen, medizinische Betreuung,
Einkaufsm&#246;glichkeit von Nahrungsmittel und Gebrauchsg&#252;ter zu
erm&#228;&#223;igten Preisen). Die St&#252;ckl&#246;hne f&#252;r die N&#228;her
haben sich allerdings nicht erh&#246;ht. Die mit den N&#228;hzentren entstanden
Zusatzkosten m&#252;ssen alleine von den pakistanischen Exporteuren getragen
werden. Auf diese Weise k&#246;nnen aber die gro&#223;en Sportartikelhersteller
jetzt Fu&#223;b&#228;lle auf den Markt bringen, die tats&#228;chlich frei von
Kinderarbeit sind.</p>

<p>Durch die Schaffung der neuen N&#228;hzentren verlieren viele Familien, die
bisher in d&#246;rflichen Kleinstbetrieben oder in Heimarbeit ihren
Lebensunterhalt verdienten, ihre Einkommensquelle. Es zeigt sich hier einmal
mehr, dass das Problem der Kinderarbeit (und ihre Ursachen!) nicht einfach mit
Verboten oder Produktionsverlagerung gel&#246;st werden kann, sondern vielmehr
sinnvolle Alternativen f&#252;r die betroffenen Familien notwendig sind.
Letztlich hat der internationale Druck auf die gro&#223;en
Sportartikelhersteller hinsichtlich Kinderarbeit bei der Fu&#223;ballproduktion
bisher lediglich &quot;L&#246;sungen&quot; bewirkt, die diejenigen treffen, die
schon benachteiligt sind und jetzt noch &#228;rmer werden.</p>

<p><font size=+1> Fu&#223;b&#228;lle aus fairem Handel</font></p>

<p>Ausgehend von dieser Situation entstand in Zusammenarbeit mit dem Fair Trade
e.V. das Projekt &quot;Fair Pay - Fair Play&quot; zur Promotion von fair
gehandelten Fu&#223;b&#228;llen. Die Hauptziele dieses Projekts sind: Produktion
ohne Kinderarbeit, Zahlung besserer L&#246;hne, Schaffung bzw. Erhaltung von
Arbeit in den D&#246;rfern, Sicherung sozialer Leistungen und Finanzierung von
Dorfentwicklungsma&#223;nahmen. Zur Erreichung dieser Zielvorstellungen wurden
Gespr&#228;che mit mittelst&#228;ndischen pakistanischen Fu&#223;ballexporteuren
gef&#252;hrt, um sie f&#252;r soziale Verbesserungen durch fairen Handel auf
Betriebs- als auch auf der Dorfebene zu gewinnen.</p>

<p>Der Grundgedanke besteht darin, kleine N&#228;hbetriebe f&#252;r
Fu&#223;b&#228;lle in den D&#246;rfern (village based stitching units) mit
mindestens 10 offiziell registrierten N&#228;herInnen zu schaffen.
Arbeitsgrundlage sind die von Fair Trade e.V. entwickelten Kriterien f&#252;r
fair gehandelte Fu&#223;b&#228;lle aus Pakistan, zu deren Einhaltung sind die
Exporteure vertraglich verpflichtet und deren Durchsetzung in den
N&#228;hbetrieben durch unabh&#228;ngige &#228;u&#223;ere Kontrolle gesichert
wird. Unter Ausschlu&#223; von unn&#246;tigem Zwischenhandel und ohne
Kinderarbeit werden Fu&#223;b&#228;lle gen&#228;ht, deren Vertrieb &#252;ber die
gepa mbH und andere europ&#228;ische Fairhandelsorganisationen erfolgt.</p>

<p>Ab Mitte April 1998 bietet die gepa fair gehandelte Fu&#223;b&#228;lle aus
Pakistan an: Die Profi-B&#228;lle &quot;Premier&quot; und &quot;Champion&quot;
sowie die hochwertigen Trainigsb&#228;lle &quot;Match&quot; und
&quot;Winner&quot;. Alle B&#228;lle entsprechen den FIFA- und
DFB-Richtlinien.</p>

<p>F&#252;r die fair gehandelten Fu&#223;b&#228;lle zahlt die gepa einen
Mehrpreis von je 2 US-Dollar f&#252;r die Profib&#228;lle und je 1 US-Dollar
f&#252;r die Trainigsb&#228;lle, was einer durchschnittlichen Erh&#246;hung des
Exportpreises von ca. 25% entspricht. Dieser Mehrpreis, der ausschlie&#223;lich
f&#252;r die Verbesserung der L&#246;hne und der sozialen Verh&#228;ltnisse in
der Fu&#223;ballproduktion verwendet werden darf, teilt sich in vier
Bestandteile auf:</p>
<ol>
<li> Der erste Bestandteil ist ein Zuschlag zum orts&#252;blichen, vom Exporteur
gezahlten St&#252;cklohn des N&#228;hers. Dieser Zuschlag entspricht einer
Lohnerh&#246;hung von etwa 35% (gemittelt &#252;ber die Ballqualit&#228;ten
&quot;Hoch&quot;, &quot;Mittel&quot;, &quot;Einfach&quot;) und ist so bemessen,
dass zwei erwachsene N&#228;her (Vater und Sohn &#252;ber 14 Jahren) bei
Vollarbeitszeit ein monatliches Einkommen von mehr als 6000 pakistanische Rupien
erziehlt. Verglichen mit den Verdienstm&#246;glichkeiten in der
Sportartikelindustrie von Sialkot, kann die Familie des N&#228;hers mit diesem
Einkommen einen angemessenen Lebensstandard sichern.</li>

<li> Der zweite Bestandteil dient der Begleichung der Sozialabgaben des
N&#228;hers (Kranken- und Rentenversicherung).</li>

<li> Der dritte Bestandteil geht in einen Fonds f&#252;r Kleinprojekte in den
D&#246;rfern, in denen fair gehandelte B&#228;lle gen&#228;ht werden. Zielgruppe
sind diejenigen Familien, die infolge der Umsetzung des &quot;Atlanta
Agreements&quot; Einkommensverluste durch den Wegfall der Frauen- und
Kinderarbeit hinnehmen mussten. Mit den Betroffenen werden konkrete
Ma&#223;nahmen (Mikrokredite zur Entwicklung bzw. Verbesserung der
Selbstversorgung durch landwirtschaftliche Produktion, Berufsausbildugsprogramme
f&#252;r freigesetzte Kindarbeiter, F&#246;rderung der bereits vorhandenen
Schulen etc.) vereinbart, deren Durchf&#252;hrung einer lokalen
Nichtregierungsorganisatuion &#252;bertragen wird. Hier liegt der Schwerpunkt
auf Kleinprojekten, die unmittelbar die wirtschaftliche und soziale Situation
der betroffenen Familien verbessern und wirksam Kinderarbeit vermeiden.</li>

<li> Der vierte Bestandteil steht dem Exporteur als Mehrpreis f&#252;r soziale,
technologische und logistische Entwicklungen innerhalb seines Unternehmens zur
Verf&#252;gung.</li></ol>

<p>In Verhandlungen mit interessierten Exporteuren zeigte sich, dass die
Kriterien f&#252;r fair gehandelte Fu&#223;b&#228;lle nicht sofort in vollem
Umfang umsetzbar sind, sondern ein l&#228;ngerfristiger Prozess der sozialen
Verbesserung in der Fu&#223;ballproduktion erforderlich ist, der auch
&#220;bergangsphasen und Kompromisse einschlie&#223;t. Ohne Bestellungen in
entsprechenden Gr&#246;&#223;enordnungen ist beispielsweise kein Exporteur
bereit, seine Produktion auf fair gehandelte Fu&#223;b&#228;lle umzustellen, so
dass eine &#220;bergangsphase auch traditionelle Heimarbeit akzeptiert wird.
F&#252;r jeden fair gehandelten Fu&#223;ball ist jedoch gesichert, dass er in
einem identifizierten N&#228;hbetrieb des Vertragspartners entsteht und die
vereinbarten Lohnzuschl&#228;ge, Sozialabgaben und
Dorfentwicklungsma&#223;nahmen garantiert sind.</p>

<p>Schwierig bleibt auch die Einbeziehung der Frauen in das N&#228;hen fair
gehandelter Fu&#223;b&#228;lle, weil im offiziellen Arbeitsprozess infolge der
islamischen Gesellschaftsordnung Pakistans eine Trennung der Geschlechter in den
N&#228;hbetrieben bestehen bleiben muss. Hier haben sich die interessierten
Unternehmen jedoch -in Abh&#228;ngigkeit von der Entwicklung der Bestellmengen -
bereiterkl&#228;rt, schrittweise N&#228;hbetriebe f&#252;r Frauen im
Verh&#228;ltnis ein zu vier zu schaffen, was einer Beteiligung der Frauen im
N&#228;hprozess von 25% entspricht.</p>

<p>Der erste Partner f&#252;r fair gehandelte Fu&#223;b&#228;lle aus Pakistan
ist das Privatunternehmen Talon Sports und der angelaufene Vertrieb erfolgt
durch das gepa Freihandelshaus (gepa mbH, Bruch 4, 42279 Wuppertal) und durch
COOP Italien. Das war der Stand im Sommer 1998. Der Text wurde aus einer
Produktinfo 2/98 entnommen und hier, wenn auch nur auszugsweise, aber
unver&#228;ndert wiedergegeben.</p>

<hr>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://home.chiemgau.com/amagerl/members/wolf"> http://home.chiemgau.com/amagerl/members/wolf </a>
</font>
<br>
<center>
<a href="NoCover.html#a3"> <img border=0 src="l_hauptinhalt.jpg" width=495 height=75></a>
</center></table></center></center><br>
</body>
</html>

