<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>blinde HTML-Tabellen</title>
</head>
<body background="wol1.jpg" text=black link=blue alink=red bgcolor="#ffffee"><br>
<a name="top"></a><br>
<font color="#800000" size="7">
<center><b>blinde Tabellen</b></font></center>
<ul>
<li>&nbsp; <a href="#a1"><b>Allgemeines zu blinden Tabellen</b></a></li>
<li>&nbsp; <a href="#a2"><b>Mehrspaltigkeit</b></a></li>
<li>&nbsp; <a href="#a3"><b>Text und Grafik</b></a></li>
<li>&nbsp; <a href="#a4"><b>Seitenr&auml;nder erzwingen</b></a></li>
<li>&nbsp; <a href="#a5"><b>Farbfl&auml;chen</b></a></li>
<li>&nbsp; <a href="#a6"><b>Schlusswort</b></a></li>
</ul>

<h3><font color="#800000"><a name="a1">Allgemeines zu blinden Tabellen</a></font></h3>

<p>Wenn bei WWW-Seiten auf sauber ausgerichtete, aber relativ frei verteilte
Elemente gesto&szlig;en wird, wurde in vielen F&auml;llen mit der Technik der
&quot;blinden Tabellen&quot; gearbeitet. Blinde Tabellen haben keine sichtbaren
Gitternetzlinien. Dadurch merkt der Betrachter gar nicht, dass es sich in
Wirklichkeit um eine Tabelle handelt.</p>

<p>Einen Nachteil sollte man jedoch dringlich beachten, wenn beabsichtigt wird, den
gesamten anzuzeigenden Inhalt einer WWW-Seite mit Hilfe einer blinden Tabelle
anzuordnen: Tabellen werden vom WWW-Browser erst angezeigt, nachdem ihr
kompletter Inhalt eingelesen wurde bzw. erst in dem Augenblick, wo der
WWW-Browser genau wei&szlig;, wie gro&szlig; und wie breit die Tabelle angezeigt
werden mu&szlig;. Das bedeutet bei der Daten&uuml;bertragung aus dem WWW,
dass ein Anwender am Bildschirm l&auml;nger wartet, bis &uuml;berhaupt
etwas angezeigt wird. Es sei denn, die Spalten wurden genauestens
vordefiniert. (IBrowse hat aber da noch seine Schwierigkeiten!)</p>
<a href="#top"> zum Anfang </a>
<hr>
<h3><font color="#800000"><a name="a2">Mehrspaltigkeit</a></font></h3>

<p>Tabellen dienen <b>nicht nur</b> dazu, um tabellarische Information anzuzeigen. In
HTML wie in anderen textverarbeitenden Systemen dienen Tabellen auch dazu, um
einen &quot;Mehrspaltensatz&quot; am Bildschirm zu erzwingen.</p>

<p>Mit Hilfe etwa einer dreispaltigen blinden Tabelle kann man leicht einen
attraktiv aussehenden 3spaltigen Textsatz im Stil einer Zeitung realisieren.<br>
<center>
<table width=50% cellpadding=10><tr><td><pre>
  &lt;table cellpadding=5&gt;
    &lt;tr valign=top&gt;
      &lt;td width=33%&gt;
  Hier folgt der Text von Spalte 1
      &lt;/td&gt;
      &lt;td width=33%&gt;
  Hier folgt der Text von Spalte 2
      &lt;/td&gt;
      &lt;td width=34%&gt;
  Hier folgt der Text von Spalte 3
      &lt;/td&gt;
    &lt;/tr&gt;
  &lt;/table&gt;
</pre></td></tr></table></center></p>

<p>In diesem Beispiel werden drei Spalten definiert, deren Breiten mit den
Angaben <tt>width=</tt> 33%, 33% und 34% (= 100%) definiert werden. Innerhalb
jeder der 3 Spalten k&ouml;nnen beliebige Elemente stehen. Grafiken, die zu
breit sind, sprengen allerdings die erzwungenen Spaltenbreiten.</p>

<p>Da die Inhalte der Spalten unterschiedlich lang sein k&ouml;nnen, wird mit
<tt>valign=top</tt> im einleitenden Tag der Zeile (<tt>&lt;tr&gt;</tt>)
erreicht, dass alle Inhalte obenb&uuml;ndig ausgerichtet werden.</p>

<p>Es ist sehr opportun darauf zu achten, dass die Inhalte aller definierten Spalten
ungef&auml;hr gleich lang sind und m&ouml;glichst nicht mehr Inhalt enthalten,
als ein Bildschirm bei 640 x 480 Pixeln Aufl&ouml;sung anzeigen kann. Denn sonst
mu&szlig; der Anwender dauernd scrollen. Falls mehr Information unterzubringen
sind, sollte danach einfach eine neue Tabellenzeile mit den n&auml;chsten
drei Zellen notiert werden. Falls Zwischen&uuml;berschriften oder Trennlinien
genutzt werden sollen, die sich &uuml;ber alle drei Spalten erstrecken sollen,
muss daf&uuml;r ebenfalls eine eigene neue Tabellenzeile angelegt werden.
Statt drei Zellen erstellt man dabei aber nur eine und erg&auml;nzt sie mit der
Zusatzangabe <tt>colspan=3</tt> und die Zelle reicht &uuml;ber alle drei Spalten.</p>

<a href="#top"> zum Anfang </a>
<hr>
<h3><font color="#800000"><a name="a3">Text und Grafik</a></font></h3>

<p>Mit Hilfe von blinden Tabellen k&ouml;nnen auch mehrere Grafiken sauber
nebeneinander plaziert werden und man hat die M&ouml;glichkeit, dar&uuml;ber und
darunter ebenso sauber Text zu plazieren.<br>

<table width=100% cellpadding=10><tr><td><pre>
&lt;table width=500 cellpadding=10&gt;
  &lt;tr align=center&gt;
    &lt;td&gt;&lt;h3&gt;&Uuml;berschrift&lt;/h3&gt;&lt;img src="grafik1.gif" width=70 height=76 border=0&gt;
    &lt;td&gt;&lt;h3&gt;&Uuml;berschrift&lt;/h3&gt;&lt;img src="grafik2.gif" width=66 height=76 border=0&gt;
    &lt;td&gt;&lt;h3&gt;&Uuml;berschrift&lt;/h3&gt;&lt;img src="grafik3.gif" width=81 height=76 border=0&gt;
  &lt;/tr&gt;
  &lt;tr align=center valign=top&gt;
    &lt;td&gt;&lt;Beschreibungstext&gt;
    &lt;td&gt;&lt;Beschreibungstext&gt;
    &lt;td&gt;&lt;Beschreibungstext&gt;
  &lt;/tr&gt;
&lt;/table&gt;
</pre></td></tr></table></p>

<p>In diesem Beispiel werden drei Spalten definiert. In der ersten Zeile sollen
3 &Uuml;berschriften mit 3 dazugeh&ouml;rigen Grafiken unterhalb stehen, in der
zweiten Zeile 3 passende Beschreibungstexte, wiederum unterhalb der jeweiligen
Grafiken. Mit der Angabe <tt>width=500</tt> wird eine Gesamtbreite der Tabelle
erzwungen. Die Breite ist in Abstimmung mit der Summe der Breite aller Grafiken
und dem Textumfang so gew&auml;hlt, dass es optisch ordentlich
aussieht.</p>

<p>Durch die Angabe <tt>cellpadding=10</tt> wird sichergestellt, dass sich
die Zelleninhalte bei gr&ouml;&szlig;erem Inhalt nicht zu nahe kommen.</p>

<p>Mit <tt>&lt;tr align=center&gt;</tt> werden alle Zellen der jeweiligen Zeile
zentriert ausgerichtet. Da die Beschreibungstexte unterschiedlich lang sein
k&ouml;nnen, wird mit der Angabe valign=top erreicht, dass sie alle
obenb&uuml;ndig ausgerichtet werden.</p>

<p>&Uuml;berschriften und Grafiken sind im obigen Beispiel zwar unmittelbar
nebeneinander geschrieben. Da &Uuml;berschriften aber einen eigenen Absatz erzeugen,
wird die dahinterstehende Grafik bei der Anzeige unterhalb der &Uuml;berschrift
plaziert. Da der Zellinhalt zentriert ausgerichtet wird, steht die
&Uuml;berschrift sauber zentriert &uuml;ber der jeweiligen Grafik.</p>
<p><font size="+1">Und so sieht so etwas aus:</font></p>
<table cellpadding=10 width=600>
  <tr align=center>
    <td><h3>Schadenfreude</h3><img src="work_blind1.gif" width=70 height=76 border=0>
    <td><h3>Erstaunen</h3><img src="work_blind2.gif" width=52 height=76 border=0>
    <td><h3>Skepsis</h3><img src="work_blind3.gif" width=65 height=76 border=0>
    <td><h3>Betretenheit</h3><img src="work_blind4.gif" width=55 height=77 border=0>
  </tr>
  <tr align=center valign=top>
    <td>ist die sch&ouml;nste Freude, kann aber Feinde schaffen
    <td>gebar die Philosophie und wird von Rechthabern immer wieder untersch&auml;tzt
    <td>ist bisweilen angebracht, sollte aber nicht das weitere Dazulernen behindern
    <td>ist sehr unangenehm, w&auml;hrt aber nicht ewig
  </tr>
</table>

<a href="#top"> zum Anfang </a>
<hr>
<h3><font color="#800000"><a name="a4">Seitenr&auml;nder erzwingen</a></font></h3>

Mit Hilfe einer blinden Tabelle besteht die M&ouml;glichkeit, mit einer einzigen Tabellenzelle
Seitenr&auml;nder zu erzwingen.<br><center>
<table width=50% cellpadding=10><tr><td><pre>
&lt;div align=center&gt;
&lt;table width=70%&gt;
  &lt;tr&gt;
    &lt;td&gt;
Hier folgt der eigentliche Inhalt
   &lt;/td&gt;
  &lt;/tr&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;/center&gt;  <b>(wird nur von/f&uuml;r
            Voyager ben&ouml;tigt!)</b>
</pre></td></tr></table></center></p>

<p>In diesem Beispiel wird zun&auml;chst mit <tt>&lt;div align=center&gt;</tt>
ein zentriert ausgerichteter Bereich definiert.</p>

<p>Zwischen dem Tag und seinem Gegenst&uuml;ck <tt>&lt;/div&gt;</tt> wird eine
Tabelle definiert, die nur eine Zeile mit einer Zelle enth&auml;lt. In dieser
Zelle steht der gesamte Inhalt, der mit Seitenr&auml;ndern versehen wird. Die
Seitenr&auml;nder selbst werden erreicht durch die Angabe <tt>width=70%</tt> im
einleitenden Tabellen-Tag. Da die Tabelle selbst zentriert ausgerichtet wird,
entsteht so links und rechts je ein Seitenrand von 15%.</p>

<p><font size="+1">Und so sieht so etwas aus:</font></p>

<div align=center>
  <table width=70%>
    <tr>
      <td>
<h2>Sind Z&uuml;ster akros?</h2>

<p>Von Dr. med. Hansheinz Mehlqual</p>

<p>Die Schwuderhaut, im Volksmund Zurrpfistel genannt, ihre medizinische
Bezeichnung lautet Nekrile Zinose, ist eine Verpinzung kleiner Fettschwaddeln im
Bindegewebe. Diese unsch&ouml;ne, wenn auch ungef&auml;hrliche Entartung tritt
gew&ouml;hnlich nach l&auml;ngeren Aufenthalten im Niederpinzgau auf, vermutlich
wegen der dort vorkommenden Zwollerl. Ein Forscherteam hat nun herausgefunden,
da&szlig; die Schwuderhaut mit ganz gew&ouml;hnlichen Pammeln erfolgreich
behandelt werden kann. Die Pammeln werden ja schon von altersher als Hausmittel
gegen Sodeln empfohlen, doch sieht man in neuerer Zeit keinen Grund mehr, die
possierlichen Sodeln durch &uuml;belriechende Pammeln zu vertreiben. Die Pammeln
werden direkt auf die von Schwuderhaut befallenen Partien aufgesetzt und dort
belassen. Nach l&auml;ngstens drei Tagen ist man von der l&auml;stigen
Schwuderhaut befreit, mu&szlig; sich aber nun freilich damit abfinden, mit
scheu&szlig;lichen Pammeln behaftet zu sein, die praktisch nie mehr a
bgehen.</p>
     </td>
    </tr>
  </table>
  </div></center>
<p>aus: Deutsch f&uuml;r Ausl&auml;nder (von Martin Auer)</p>

<a href="#top"> zum Anfang </a>
<hr>
<h3><font color="#800000"><a name="a5">Farbfl&auml;chen</a></font></h3>

<p>Mit blinden und zugleich farbigen Tabellen kann man einzelne
Fl&auml;chen farbig hinterlegen, ohne dass dies wie eine Tabelle wirkt.<br>

<table width=100% cellpadding=10><tr><td><pre>
&lt;table bgcolor=#000066 cellpadding=20&gt;
  &lt;tr&gt;
    &lt;td&gt;
&lt;div color=#FFFFFF&gt;Hier folgt der Inhalt - wei&szlig; auf dunkelblauem Grund&lt;/font&gt;   
   &lt;/td&gt;
  &lt;/tr&gt;
&lt;/table&gt;
</pre></td></tr></table></p>

<p>In diesem Beispiel wird eine Tabelle mit einer einzigen Zelle definiert.
Durch die Angabe <tt>bgcolor=#000066</tt> wird der Tabelle ein dunkelblauer
Hintergrund zugewiesen. Damit die Fl&auml;che den Text gro&szlig;z&uuml;gig
einrahmt, wird mit <tt>cellpadding=20</tt> ein Randabstand definiert. Um den
Text in der Zelle von dem dunklen Hintergrund abzuheben, wird mit <tt>&lt;font
color=#FFFFFF&gt;</tt> eine kontrastierende Textfarbe (wei&szlig;)
definiert.</p>

<p><font size="+1">Und so sieht so etwas aus:</font></p>

<table bgcolor=#000066 cellpadding=20>
    <tr>
      <td>
<font color=#FFFFFF>
<h2>In die Zwange gen&uuml;bert</h2>

<p>Aus dem gleichnamigen Roman von Mickey S. Chase, der durch die Verfilmung mit
Humphrey Bogart weltbekannt wurde</p>

<p>Endlich hatte ich Zw&ouml;schinger an der Furbel. Er war nicht gerade sehr
zwirch, und als ich ihm zwei Kransommeln zwischen die S&ouml;den lepperte, war
er es noch weniger.<br>
&quot;Wo sind die Vantossel?&quot; zeppte ich lemmig.<br>
&quot;Die kannst du dir abzinken, schwenziger Hutbondel,&quot; schwoberte er
m&uuml;sig, &quot;die haben wir mit zwei Tram Zober in die Zwange
gen&uuml;bert!&quot;<br>
&quot;In die Zwange gen&uuml;bert, so so&quot;, dr&ouml;ste ich. Ich
n&ouml;derte ihm meinen linken Telto in die Kantine und tschippte ihm mit einer
satten Fonte eins auf die Lumme.<br>
&quot;Na - ? Immer noch n&ouml;sig?&quot;<br>
Zw&ouml;schinger foberte. Ich n&uuml;bbelte ihm ein wenig den Tampus.
&quot;Spuller schnell raus, wo die Vantossel sind, oder ich nepper dir eins auf
deine zossligen Klieber, da&szlig; dir die Schnobengel zur Zwille
rausbullern.&quot;<br>
&quot;Die Vantossel...&quot; Zw&ouml;schinger schn&uuml;berte. Pl&ouml;tzlich
bieste er tr&ouml;nig und schlompte mit einem b&ouml;lligen Fomp zusammen. Ich
hatte ihn wohl zu kramm angenuppt.<br>
Ich fluppte die Possel und verkn&uuml;berte mich. Die Vantossel w&uuml;rden eben
ohne mich fertig werden m&uuml;ssen.</p> </font>
     </td>
    </tr>
  </table>
<p>aus: Deutsch f&uuml;r Ausl&auml;nder (von Martin Auer)</p>

<a href="#top"> zum Anfang </a>
<hr>
<h3><font color="#800000"><a name="a6">Schlusswort</a></font></h3>

Auch am Ende dieses Workshops m&ouml;chte ich nicht verhehlen, dass nicht alle S&auml;tze
auf meinem Mist gewachsen sind. Viele S&auml;tze und alle Beispiele stammen aus der
wirklich hervorragenden Arbeit von Stefan M&uuml;nz mit dem Titel "SelfHTML". Ich
kann nur allen empfehlen, die sich mit HTML ernsthaft besch&auml;ftigen wollen, sich
diese Arbeit zu beschaffen.</p>

<p><a href="http://www.teamone.de/selfaktuell/"><b>http://www.teamone.de/selfaktuell/</b></a></p>

<p>Dort erfahren alle zum Beispiel, wie man SELFHTML als <b>Buch</b> erwerben kann.<br>
Wenn <b>neue Versionen</b> des Dokuments anstehen, wird es dort angek&uuml;ndigt.<br>
Aktuelle <b>Downloadm&ouml;glichkeiten</b> werden dort bekannt gegeben.<br>
&quot;SELFHTML aktuell&quot; wird nach und nach erweitert.<br>
Also einfach von Zeit zu Zeit mal vorbeischauen !</p>

<a href="#top"> zum Anfang </a>
<hr>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://home.chiemgau.com/amagerl/members/wolf"> http://home.chiemgau.com/amagerl/members/wolf </a>
</font>
<br>
<center>
<a href="NoCover.html#a3"> <img border=0 src="l_hauptinhalt.jpg" width=495 height=75></a>
</center></table></center></center><br>
</body>
</html>

