<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Zwei Jahre 'Der AmZeiger'</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Zwei Jahre 'Der AmZeiger'</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<h2>Die Anf&auml;nge</h2>

<P>Im <B>Fr&uuml;hjahr 1997</B> war ich wieder relativ aktiv in meiner Stamm-Mailbox und
so lernte ich durch puren Zufall Andreas Schlick kennen. Ein kleiner
Disput zu einer Reihe allgemeiner Themen und nat&uuml;rlich zu unser beider
Computersystem Amiga entspann sich.</P>

<P>Die Situation des Amiga erschien wieder einmal/immer noch als sehr
unsicher, die Qualit&auml;t der Printmagazine auf dem Zeitschriftenmarkt hatte
sich inzwischen rapide verschlechtert, baldige Einstellung von Titeln sollte
folgen. Auch auf dem Diskmag/Online-Magazin-Sektor sah es nicht rosig aus,
neben zu diesem Zeitpunkt (meiner Meinung nach) wenig qualitativ gutem,
gab es haupts&auml;chlich Magazine, die Nachrichten und Pressemitteilungen der
letzten Zeit geb&uuml;ndelt verbreiteten. </P>

<P>Schon der <B>N&auml;hrboden</B> f&uuml;r eine neue kostenlose Online-Zeitschrift, ging es
mir im Kopf umher, aber der Aufwand, den ich relativ realistisch
einsch&auml;tzte, lie&szlig; mich z&ouml;gern, den Gedanken zu Ende zu denken. Andreas
Schlick jedoch machte einen frischen, begeisterungsf&auml;higen Eindruck (oh
je, wenn er das jetzt liest! :) - und ich sprach ihn einfach mal an, was
er dazu meine.</P>

<P>Er machte aus der Anfrage sp&auml;ter mal einen Cookie:</P>

---<br>
Cookie:<br>
<B>AmZeiger: Wie es begann...</B><br>
<br>
&quot;Was hieltest Du eigentlich von einer Amiga-Guide-Zeitschrift fuer den<br>
Amiga? Waere eine Alternative zum AMag, das ja nur noch ein Witzblatt ist.<br>
Nur so eine Idee.&quot; (Gregor Franz, aus &quot;WurzelPurzel&quot; [1.4.97])<br>
---<br>

<P>Wie man sieht, k&ouml;nnte ich mich jetzt (allerdings ein bi&szlig;chen sp&auml;t)
herausreden, da&szlig; alles nur ein Aprilscherz gewesen sei. ;)</P>

<P>Tats&auml;chlich reagierte er so, wie ich es mir vielleicht (unbewu&szlig;t?)
erhofft hatte:</P>

<P>Er schrieb mir eine lange Antwort mit Vorschl&auml;gen, wieviel Leute man
br&auml;uchte, was die tun m&uuml;&szlig;ten usw., sicherte mir Unterst&uuml;tzung zu, dabei
einschr&auml;nkend, da&szlig; er dabei nicht wirklich voll mitmachen k&ouml;nne.</P>
<P>
Andreas Schlick: <br>
<U>&quot;So nun habe ich dich vermutlich gleich mit meiner Antwort erschlagen. :)
Aber es ist halt gefaehrlich, sowas in meiner Naehe vorzuschlagen. :)&quot;</U></P>

<P>Gregor Franz:<br>
&quot;Das hab ich mir schon gedacht. Deshalb hab ichs ja gemacht. :)&quot;</P>

<P>Andreas Schlick:<br>
<U>&quot;Da ich mir wahrscheinlich (nicht ganz beabsichtigt) noch einiges an
anderer Arbeit aufgehalst habe (wird noch nicht verraten), werde ich
zwar keine grosse Unterstuetzung sein, aber vielleicht eine kleine. :)&quot;</U>
 </P>
<P>Gregor Franz: <BR>
&quot;Wie gesagt, ich bin mir noch nicht sicher. Ich habe mir eigentlich
vorgenommen ewas anderes Groesseres zu machen. Da muss man vorher schon
genau abschaetzen, wieviel Zeit investiert werden muesste und ob das
machbar ist, damit es keine kurzlebige Sache wird. Das waere dann auch
sinnlos.&quot;</P>

<h2>Es geht los</h2>

<P>Das &uuml;berzeugte mich schlie&szlig;lich. Ich dachte mir <B>den Namen</B> aus, der an die
Bezeichnung diverser deutscher Tageszeitungen ('Der Generalanzeiger')
angelehnt ist und durch die variierte erste Silbe den Amiga integriert.
Dann erstellte ich ein Konzept im AmigaGuide-Format, und &uuml;berzeugte
Andreas, doch als Redakteur mitzumachen. Er sorgte dann f&uuml;r die
Konvertierung vom AmigaGuide in das HTML-Format, so da&szlig; wir von Anfang
an gleichzeitig beide Versionen im Aminet verbreiteten und die HTML-
Ausgabe zus&auml;tzlich im WWW pr&auml;sentierten.</P>

<P>Vorher kam aber erst noch ein Aufruf in unsere zuk&uuml;nftige Support-Mailbox,
der leider keine allzugro&szlig;e Wirkung zeigte. Trotzdem machten wir
unverdrossen weiter und glaubten an das Projekt.</P>

<P>Im <B>Juni 1997</B> erschien dann schlie&szlig;lich der erste AmZeiger, auch heute noch
erfreulicherweise 'kompatibel' mit den aktuellen Ausgaben - das hei&szlig;t, da&szlig;
Konzept erwies sich als f&uuml;r die Zukunft tragf&auml;hig und brauchte nur
erweitert, aber nie umgeworfen zu werden. Im Wesentlichen war diese
Ausgabe noch von Andreas und mir bestritten worden. Andreas als HTML-
Redakteur und ich als Herausgeber und Chefredakteur sorgten beide f&uuml;r
die ersten Artikel, wobei klar war, da&szlig; wir f&uuml;r die Zukunft weitere
Mitarbeiter gewinnen mu&szlig;ten, um den AmZeiger auf l&auml;ngere Sicht am Leben
zu halten. Er sollte keine Ein-Ausgaben-Fliege ;) werden.</P>

<P>Die Reaktionen, die wir bekamen, waren ausgesprochen positiv, erste
Kontakte wurden gekn&uuml;pft und die Arbeit an der zweiten Ausgabe begann.</P>
<P>
<h2>Einzigartig</h2>

<P>Was sollte den AmZeiger von anderen Online-Magazinen unterscheiden, die
schon existierten?</P>

<P><B>Folgende Punkte</B> schwebten mir vor und die k&uuml;nftige Redaktion konnte sich
damit identifizieren:</P>

<UL>
<LI>wie in einer 'richtigen' (sprich 'gedruckten') Zeitung, sollten im
  AmZeiger nur redaktionelle Inhalte erscheinen, das hei&szlig;t keine Mischung
  mit aus irgendwelchen Netzen gefischten Artikeln, sowie keine reine
  Wiedergabe diverser verbreiteter Pressemitteilungen oder Werbemails
</LI><LI>alles sollte einheitlich in deutscher Sprache sein, wobei ein Augenmerk
  insbesondere darauf gelegt werden sollte, da&szlig; die Qualit&auml;t der Artikel,
  sprachlich und fachlich, ein gewisses Niveau erreichten
</LI><LI>
Kommentare zu Meldungen sollten nicht die ganze Ausgabe durchziehen und
  deutlich gekennzeichnet werden.
</LI><LI>
Bilder und Screenshots sollten auf ein Mindestma&szlig; beschr&auml;nkt werden,
  damit kein Download-Monster entst&uuml;nde
</LI><LI>
der Schwerpunkt sollte vor allem auf den Inhalt gelegt werden
</LI><LI>
von Anfang an sollte es f&uuml;r Tests eine verbindliche Wertung geben;
  Lobhudeleien oder unberechtigte Verrisse vermieden werden
</LI><LI>
bereits ab der ersten Ausgabe sollte der AmZeiger gleichzeitig, wie
  erw&auml;hnt, in einer AmigaGuide- und einer HTML-Version (beide strukturell
  m&ouml;glichst identisch) erscheinen; die Vorteile von HTML, wie Links,
  konsequent genutzt werden
</LI></UL>

<P>Die Realisierung einiger dieser Punkte l&auml;&szlig;t sich schon durch Augenschein
leicht &uuml;berpr&uuml;fen. Ob wir auch z.B. vom Inhalt her, den selbstgestellten
Forderungen gerecht wurden und werden, m&uuml;ssen Sie entscheiden.</P>

<h2>Die weitere Entwicklung</h2>

<P>&Uuml;ber die Ausgaben gelang es, neben dem gelegentlichen Unterbringen
einzelner Artikel von freien Mitarbeitern, vor allen Dingen einen kleinen
verl&auml;&szlig;lichen Stamm von Redakteuren aufzubauen. Eine ellenlange Liste mit
Leuten, die nichts oder selten etwas tun, konnte nicht das Ziel sein. Die
Ver&auml;nderungen in der Redaktion erfolgten bis jetzt gl&uuml;cklicherweise sanft
und stetig.</P>

<P>Das war eine bzw. die Voraussetzung daf&uuml;r, da&szlig; auch der AmZeiger selbst
kontinuierlich <B>wuchs</B> und auch neue Rubriken aufgenommen wurden. So die
Coder's Corner, die sich speziell an Programmierer wendet oder zuletzt
ein gro&szlig;er Public Domain-Bereich. Mit Hilfe unter anderem eines
Maskottchens, dem AmZeigerchen, hat sich auch das Design verbessert.</P>

<P>Wenig sp&auml;ter kreierten wir einen <B>Award</B>, einen Preis, der an Produkte
vergeben wird, die in unseren Tests die Noten 1 und 2 ('Sehr gut' und
'Gut') erreicht haben.</P>

<P>Unsere kritisch/sachliche Einstellung zu Tests hat auch einmal zu einem
kleinen <B>Streit</B> mit einer Firma gef&uuml;hrt, die ein spezielles Programm in
Deutschland vertreibt. Die meisten anderen 'Betroffenen' reagieren aber
auch auf Kritik positiv.</P>

<P>Ausdruck auch f&uuml;r unseren Erfolg im Bereich des <B>Lektorierens</B> und des
Heranf&uuml;hrens von freien Autoren an unseren Standard, war auch die Anfrage
eines Printmagazins (also im Zeitschriftenhandel erh&auml;ltlich) zum Nachdruck
eines Artikels.</P>

<P>Mit Hilfe einer k&uuml;rzlich er&ouml;ffneten aktuellen Info-/Ger&uuml;chte-/Meckerseite
(<B>ALF</b> - das <A HREF="http://home.ecore.net/amzeiger/alf.htm">AmZeiger-LeserForum</a>,
die &ouml;fter einmal geupdatet wird, wollen wir den viertelj&auml;hrlichen
Zwischenraum zwischen zwei Ausgaben ein wenig f&uuml;llen und die Statik
unseres Webangebotes w&auml;hrenddessen etwas aufweichen.</P>

<P>Noch mehr N&auml;he zu Lesern, durch deren Vorschl&auml;ge, Kritik oder Fragen,
soll eine Mailingliste f&ouml;rdern helfen, das <A HREF="../infml.htm">AmZeiger-InfoNetz</A>. Auch f&uuml;r
Diskussionen und zum Erfahrungsaustausch kann sie genutzt werden.</P>

<h2>Die Zukunft</h2>

<P>Sie steht in den Sternen, aber wir werden den Amiga (jedenfalls den, der
sich durch das AmigaOS definiert) sicher noch eine Weile begleiten.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="intern.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../alf/9906alf.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


