<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Editorial</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER">Editorial</H1>

<P>Tats&auml;chlich ist der AmZeiger mit dieser Ausgabe <A HREF="9906his.htm">zwei Jahre alt</A> geworden.
 </P>
<P>Mein <B>Dank</B> gilt allen treuen Lesern, Helfern und Supportern und nicht
zuletzt der zuverl&auml;ssigen und tatkr&auml;ftigen Redaktion.</P>

<P>Wer Interesse am Gewinn eines <B>Phoenix</B>-Exemplars hat, der sollte mal
bei <A HREF="intern.htm">Interna</A> reinschauen!</P>

<hr>

<P>Doch wieder zur&uuml;ck zum `Tagesgesch&auml;ft`:</P>

<P>Im allgemeinen Computerbereich mu&szlig; vermeldet werden, da&szlig; es in Sachen
<B>Indizierung</B> bzw. Alterseinstufung von Spielen zwischen Jugendbeh&ouml;rden und
Softwareindustrie inzwischen zum Eklat gekommen ist.</P>

<P>Fast so, als w&auml;re unser, ganz zuf&auml;llig ausgerechnet in der letzten Ausgabe
erschienener Artikel zum Thema Indizierung, daf&uuml;r verantwortlich. ;) Zur
aktuellen Lage finden sie Hintergr&uuml;nde und Kommentar in einem speziellen
<A HREF="zensur.htm">Beitrag</A>.</P>

<hr width="50%">

<P>Im Amiga-Lager rumort weiterhin die Ger&uuml;chtek&uuml;che, ohne viel konkretes
hervorzubringen. Nichts genaues wei&szlig; man nicht. </P>

<P>Au&szlig;er, da&szlig; in der letzten Zeit <B>zwei deutsche Online-Magazine und ein
Printmagazin</B> aufgeh&ouml;rt haben als Zeitschriften zu existieren. Die
sogenannte `Integration` der AmigaFever in die amigaOS ist ein
altbekannter Werbegag, der lediglich die &Uuml;bernahme der Abonnement-
Kunden zur Folge hat.   </P>

<P>Bei <B>Amiga</B> selbst zeichnet sich, neben weiteren Beschw&ouml;rungsformeln,
wieder der alte <B>Schludrijan</B> ab, der mit dem neuen Chef Jim Collas
eigentlich der Vergangenheit angeh&ouml;ren sollte.    </P>

<P>Indizien daf&uuml;r sind u.a. Hinweise der Entwickler im <a href="iv.htm">Interview</A> dieser
Ausgabe zum Amiga-Support, genauso wie der Absprung der Firma Albrecht
Computertechnik (A.C.T.) vom professionellen Amiga-Markt, die sich hohes
Ansehen f&uuml;r Hard- und Software gerade im Audiobereich erworben hatte. Nur
noch nebenbei in der Freizeit sollen von A.C.T. weiterhin Updates f&uuml;r den
Amiga entwickelt werden.</P>

<P>Eine Entwicklung, die man stoppen wollte, stoppen mu&szlig;, nimmt weiterhin
ihren verh&auml;ngnisvollen Verlauf.</P>

<P>Da klingt folgende <B>Meldung</B> von Ende April, verfa&szlig;t von Thomas Heinrich,
unserem stellvertretenden Chefredakteur, f&uuml;r das <A HREF="../alf/9906alf.htm">AmZeiger-LeserForum</A>
(ALF), fast wie der blanke Hohn und zwar nicht durch ihre Formulierung,
sondern durch den Anla&szlig;:    </P>

<table width=94% align=center> 
<tr><td>
<P> <B>Amiga ist Feuer und Flamme...</B>   </P>

<P>&quot;Nach der unentbehrlichen Designer-Uhr und dem einmaligen Mauspad, kommt
 nun der ultimative Amiga-Fanartikel aus den Marketingst&auml;tten: Die Amiga-
 Streichh&ouml;lzer!  </P>

<P> Das Sinnbild der menschlichen Evolution schlechthin, das Feuer, ist
 gerade gut genug, unserem Lieblingsrechner als Pseudonym zu dienen. Und
 wenn Sie mehrere Streichh&ouml;lzer auf einmal anz&uuml;nden, haben Sie sogar
 Multitasking...&quot;
                       </P>
</td></tr>
</table>

<P>H&auml;tte ich nicht besser sagen k&ouml;nnen. ;)</P>

<P>Da hei&szlig;t es also warten auf das <B>Amiga-OS 3.5</B>, damit wir endlich wieder
handfestere Tatsachen vermelden k&ouml;nnen.   </P>

<P>
Wie immer mit der Bitte um <A HREF="support.htm">Unterst&uuml;tzung</A> und Lesermeinungen verbleibt,</P>
<BR> <BR>
Ihr<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A><BR>
Chefredakteur<BR>

<DIV ALIGN="CENTER">...und unser <A HREF="danke.htm">DANK</A> geht an...<DIV ALIGN="CENTER">

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="main.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="news.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
