<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Interna Infernale</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN="CENTER"><H1>Interna Infernale</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<H3><B>Interna allgemein</B></H3>

<P>Mit dieser Ausgabe, die wunderbarerweise wieder angenehm prall gef&uuml;llt
ist, wird der AmZeiger, wie vielleicht schon im Editorial gelesen, volle
zwei Jahre alt. Zu diesem Jubil&auml;um gibt es eine kleine <A HREF="9906his.htm">'Geschichte'</A> des
AmZeigers.   </P>

<hr width="50%">

<P>Anl&auml;&szlig;lich des Jubil&auml;ums und nicht zuletzt des <A HREF="iv.htm">Interviews</A> mit <B>Future Tales</B>,
verlost der APC&amp;TCP, in Zusammenarbeit mit uns, zwei Exemplare von &quot;<B>Phoenix</B>&quot;
- dem Weltraumkampfspiel in WingCommander-Tradition, das auf dem Amiga
vermutlich Ma&szlig;st&auml;be setzen wird. </P>

<P>Sobald es verf&uuml;gbar ist, gehen die Exemplare an die Gewinner - noch bevor
der Handel beliefert wird!  </P>

<P>Sie m&uuml;ssen eine <b>Gewinnfrage</b>, die ich gleich stelle, beantworten. Senden
Sie die Antwort <B>bis zum 19. September 1999</B> per eMail oder Postkarte <B>an
den APC&amp;TCP</B> mit dem Stichwort &quot;AmZeiger&quot; (bei der eMail unter Betreff).</P>

<P>Die Adresse lautet: APC&amp;TCP, Postfach 83, D-83236 &Uuml;bersee; 
                    <A HREF="mailto:Andreas@chiemgau.baynet.de">Andreas@chiemgau.baynet.de</A></P>

<P>Angeh&ouml;rige der Redaktion des AmZeigers, sowie des APC&amp;TCP-Vorstands
d&uuml;rfen nicht teilnehmen. Der Rechtsweg ist ausgeschlossen.</P>

<P>Nun aber <B>die Frage:</B>    </P>

<P>&quot;Wie lautet die Langform der Abk&uuml;rzung ALF, die, neben unserer
Interpretation `AmZeiger-LeserForum`, auch &uuml;blich ist und die
so gar nichts mit Computern zu tun hat?&quot; </P>

<P>Wir lassen eine bestimmte deutsche und englische Variante gelten.
Die Gewinner werden in der n&auml;chsten Ausgabe bekanntgegeben. </P>

<P>Viel Gl&uuml;ck! </P>

<hr width="50%">

<P><B>Peter Fischer</B> ist nach der einen Probeausgabe, wie erwartet, nun
fester Redakteur des AmZeigers f&uuml;r <A HREF="../pd/9906tbox.htm">Public Domain</A>.</P>

<hr width="50%">

<P>Ich m&ouml;chte noch einmal auf zwei Einrichtungen hinweisen, die zusammen
mit der letzten Ausgabe gestartet wurden. </P>

<P>Nur online gibt es eine aktuelle Version von <B>A L F</b> - <a href="http://home.ecore.net/amzeiger/alf.htm">
Das AmZeiger-LeserForum</a>. Was meinen Sie zu den pr&auml;sentierten Themen? </P>

<P>Das <A HREF="../infml.htm">AmZeiger-InfoNetz</A> ist eine Mailingliste, die den direkten Kontakt
zwischen Redakteuren und Lesern erm&ouml;glicht, sowie zwischen letzteren
nat&uuml;rlich auch untereinander. Wer mehr Einflu&szlig; auf die Gestaltung des
AmZeigers nehmen, Erfahrungen und Probleme besprechen m&ouml;chte, der ist
hier gut aufgehoben.</P>

<hr width="50%">

<P>Diesmal gibt es nur ein Mitglied der <A HREF="../ml.htm">Abo-Mailingliste</A>, dessen eMail-Adresse
nicht mehr korrekt ist. Wenn A.Maschtaler also doch mitliest und sich
entdeckt: Bitte melden!  </P>

<P>Hier die Adresse: sucker@okay.net</P>

<hr width=70%>

<H2 align=center><B>Hinweise zu dieser Ausgabe #9</B></H2>

<P>Ab dieser Ausgabe gibt es in der Aktuell-Rubrik einen Unterabschnitt
<A HREF="../alf/9906alf.htm">ALF spricht Tacheles</A>, in dem die interessantesten Kommentare und
Gedankeng&auml;nge aus dem AmZeiger-LeserForum des letzten Vierteljahres
zusammengefa&szlig;t sind.     </P>

<hr width="50%">

<P>Der <A HREF="../kw/9906netz.htm">Netzwerkgrundlagen-Kurs</A> ist von Thomas Heinrich nun auf vier Teile
aufgestockt worden. Im vierten Teil werden Sicherheitsprobleme behandelt.</P>

<hr width="50%">

<P>Ansonsten gibt es wieder einiges in den jeweiligen Rubriken zu
durchst&ouml;bern.  </P>

<P>Wen die Eurozeichen-Problematik interessiert, dem kann ich in dieser
Ausgabe <A HREF="uhl.htm">Frau Gisela`s Problem-Ecke</A> empfehlen. </P>

<P>Au&szlig;erdem startet eine dreiteilige ausf&uuml;hrliche Serie zur <a href="../kw/9906ahis.htm">Historie</a>
des Amiga.</P>

<P>Doch es gibt noch wesentlich mehr zu entdecken, nicht zu vergessen die
<A HREF="../mmx/9906mmx.htm">Media Mal X</A>-Rubrik, zur Entspannung abseits des Computeralltags.</P>

<hr width=70%>

<H2 align=center><B>Hinweise zur letzten Ausgabe #8</B></H2>

<P>Bei <B>Frau Gisela</B> mu&szlig;te der Link zu HTMLview nat&uuml;rlich wie folgt
lauten: <A HREF="http://www.DIKU.dk/students/duff/">http://www.DIKU.dk/students/duff/</A> </P>

<P>Beim `http` hatte ein `t` gefehlt. </P>

<hr width=70%>

<H2 align=center><B>Hinweise zur n&auml;chsten Ausgabe #10</B></H2>

<P>Okay, ich gebs zu. Nachfolgend die noch g&uuml;ltigen S&auml;tze vom letzten Mal: </P>

<P>Wie immer ist es <B>schwierig</B> zu sagen, was genau kommen wird, bis auf die
Fortsetzungen zu den jeweiligen Kursteilen. </P>

<P>Aber <B>wann</B> der AmZeiger erscheint, kann ich absch&auml;tzen: das wird
voraussichtlich Ende September/Anfang Oktober sein. </P>

<P>Mit <B>W&uuml;nschen, Hinweisen</B> oder sogar eigenen Artikeln, einfach <A HREF="../kontakt.htm">hier</A> melden!
  </P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="pdnews.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906his.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


