<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Interview: Emmanuel Henn&eacute;</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>Interview</U></H1><P ALIGN="CENTER">mit<BR><b>Emmanuel Henn&eacute;</b></P>



<P>     Das seit l&auml;ngerem laufende, vielversprechende Projekt eines
     anspruchsvollen Weltraumkampfspiels im Stile von Wing Commander
     auf dem Amiga `<B>Phoenix</B>` scheint allm&auml;hlich der Fertigstellung
     entgegenzugehen. </P>

<P>     Mit Emmanuel Henn&egrave;, einer der treibenden Kr&auml;fte des
     Entwicklerteams &quot;<B>Future Tales</B>&quot;, f&uuml;hrte ich folgendes Interview.</P>

<P>     [Ergreifen Sie die Chance, <B>eines der zwei ersten Phoenix-Exemplare
      zu gewinnen</B> und spielen sie in unserem Preisausschreiben mit!
      N&auml;heres bei <A href="intern.htm">Interna</a>.]   </P>

<P><B>
AmZ:</b> Gregor Franz <br>
<b>EH:</b> Emmanuel Henn&eacute;         </P>

<hr>
 
<P>
<TABLE BORDER="1">
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wer steht eigentlich hinter &quot;Phoenix&quot;? Stell Euch doch einmal
     vor! Wie sind die Aufgaben verteilt?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>EH:</TH>
    <TD><P>Hinter Phoenix stehen Markus P&ouml;llmann, Emmanuel Henn&eacute; und Jochen
     Heizmann. Markus, der den meisten wohl durch &quot;Flyin' High&quot; bekannt
     ist, hat den Programmcode entwickelt.  </P>

     <P>Emmanuel Henn&eacute; (also ich) hat sich das Ganze ausgedacht, das Spiel
     designed, sowie die komplette Story, den Missionsablauf und die
     Grafik entwickelt.    </P>

     <P>Jochen Heizmann ist verantwortlich f&uuml;r den filmnahen Bombast-
     Soundtrack und die atmosph&auml;rische Untermalung des Spiels.</P>
    </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wie und wann ist das Projekt entstanden?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>EH:</TH>
    <TD><P>Entstanden ist es haupts&auml;chlich aus Frust, speziell wegen der wenig
     &uuml;berzeugenden Umsetzungen von &quot;Elite: Frontier&quot;, &quot;Wing Commander&quot;
     und &quot;Star Crusader&quot;. Ich habe mir immer gedacht: &quot;Das kann doch wohl
     nicht alles gewesen sein?&quot;</P>

     <P>Naja, und 1996 begannen wir dann mit dem Projekt &quot;Phoenix&quot;, um zu
     sehen, was man aus dem Amiga noch so rausholen kann. Damals sah die
     Lage des Marktes sehr schlecht aus, und ich wollte zumindest ein
     gutaussehendes Space-Game produzieren, bevor sich keiner mehr an
     den Amiga erinnert. </P>

     <P>F&uuml;r mich heisst &quot;gutaussehend&quot; mindestens 256 Farben und tolle
     Weltraumatmosph&auml;re. &quot;Frontier&quot; war mir zu abstrakt, &quot;Space Crusader&quot;
     und &quot;Wing Commander&quot; zu langsam und detailarm. </P>

 <P>    Es ging mir wie vielen Usern auch: ich sah brilliante Demos aus der
     Szene und fragte mich: Wieso sieht man so etwas nie in einem
     richtigen Spiel?</P>
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD> Eine wichtige Frage: Wann wird &quot;Phoenix&quot; fertig sein und wird
     es vorher Demoversionen geben?
	</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>EH:</TH>
    <TD> Mit der Demo halten wir es wie die &quot;Grossen&quot;: sie wird parallel zum
     fertigen Spiel erscheinen, um einen m&ouml;glichst genauen Eindruck zu
     vermitteln.
	</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wieviel ist prozentual schon ungef&auml;hr fertig, wo hakt es und
     was war bis jetzt das Schwierigste w&auml;hrend der Entwicklung?
	</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>EH:</TH>
    <TD><P>&Uuml;ber prozentuale Angaben m&ouml;chte ich mich nicht auslassen, da man
     ein Spiel von der Gr&ouml;ssenordnung schwer in Prozenten ausdr&uuml;cken
     kann.  </P>

     <P>Die Missionen werden zur Zeit &uuml;berarbeitet, die Charaktere werden
     verbessert, besonders hinsichtlich der Animation, die Engine wird
     optimiert (bis zum Schluss) usw.   </P>

     <P>Der gr&ouml;sste Haken war bisher im grafischen Bereich, sowohl was die
     Engine, als auch was die sonstige Grafik betrifft. Es ist so: Du
     siehst die ganzen neuen Sachen, die f&uuml;r andere Plattformen
     erscheinen und m&ouml;chtest nat&uuml;rlich vermeiden, dass deine Kunden
     sp&auml;ter sagen: &quot;Phoenix sieht aber nicht so aus wie XYZ!&quot;</P>

     <P>Die Schwierigkeit besteht darin, einen eigenen Stil zu finden, der
     zwar eigenst&auml;ndig aber doch massenwirksam ist... schliesslich machen
     wir Phoenix nicht zum Privatvergn&uuml;gen, sondern um den Amiga im
     bestm&ouml;glichen Licht dastehen zu lassen. </P>

     <P>Daher mussten wir uns bez&uuml;glich der 3-D-Grafik und der Engine auf
     einen h&ouml;heren Standard einlassen, was nat&uuml;rlich mehr Zeit und
     Sorgfalt erfordert. Das sieht man ganz gut, wenn man fr&uuml;he Phoenix-
     Shots mit aktuellen vergleicht.</P>
	</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Laut neuesten Meldungen soll der Handels-/Wirtschaftsanteil
     entfernt (war da schon etwas?) und sich mehr auf den Action-Aspekt
     a la 'Wing Commander' konzentriert werden. Was bewog Euch dazu?
	</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>EH:</TH>
    <TD><P>Die Grafik des Wirtschaftsparts war zu ca. 75% fertig, als sich
     herausstellte, dass es schlicht ein zu grosser Brocken werden w&uuml;rde,
     den wir da abbeissen wollten. </P>

     <P>Zudem stellte ich w&auml;hrend der Arbeit fest (besonders nach dem
     Studium &auml;hnlicher Spiele), dass es nicht ganz einfach sein w&uuml;rde,
     eine komplexe Storyline, eine komplexe Engine, eine komplexe Grafik
     und ein komplexes Wirtschaftssystem noch in diesem Jahrtausend
     fertigzustellen.      </P>

    <P> Die Story von Phoenix wurde urspr&uuml;nglich auf eine Trilogie ausgelegt,
     und was fr&uuml;her als Phoenix 1 geplant war, musste nun den Platz mit
     Phoenix 2 tauschen. Das heisst, dass Phoenix nun zwar ohne
     Wirtschaftspart auskommen muss, aber daf&uuml;r eine spannende,
     durchgehende Story zugrundeliegt.  </P>

     <P>Wenn man so will, haben wir uns f&uuml;r ein &quot;story driven&quot; und gegen ein
     &quot;free&quot; Game entschieden. Was nicht heisst, dass es nie ein &quot;Elite&quot;-
     artiges Phoenix 2 geben wird.  </P>
	</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wie wichtig wird die Hintergrundstory f&uuml;r das Spiel sein? Worum
     geht es in groben Z&uuml;gen?
	</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>EH:</TH>
    <TD><P>Die Hintergrundstory, besonders das Zusammenspiel mit Wingmen und
     anderen Figuren ist das R&uuml;ckgrat von &quot;Phoenix&quot;. Wir wollen dem
     Spieler die M&ouml;glichkeit geben, richtig einzutauchen, und wir hoffen,
     dass uns das gelingt, denn die letzten WingCommander-Episoden waren
     f&uuml;r meinen Geschmack nicht fesselnd genug, trotz oder gerade wegen
     der vielen Filme. </P>

     <P>Mit Phoenix kehren wir zu den Wurzeln zur&uuml;ck, indem wir dem Spieler
     nicht nur eine (Videos) sondern mehrere Motivationsquellen liefern.
     Es wird sich lohnen das Spiel zwei, dreimal zu spielen. </P>

     <P>Einzelheiten &uuml;ber die Story m&ouml;chte ich nicht vor dem Verkaufsstart
     bekanntgeben, da sie, wie gesagt, ein Hauptfaktor des Spiels ist.
     Nur soviel: der Spieler schl&uuml;pft in die Rolle von First Lieutenant
     Allan Best, erlebt wie dieser sich sein Callsign &quot;Phoenix&quot; erwirbt
     und zusammen mit seinen Crew-Kollegen einem scheinbar &uuml;berlegenen
     Feind entgegentreten muss. </P>

     <P>Die Story bietet einige Wendungen, Intrigen und Verrat und einen
     Feind, den der Spieler wirklich f&uuml;rchten muss. Der Humor zwischen
     den Kameraden an Bord des Mutterschiffes kommt nat&uuml;rlich auch nicht
     zu kurz.</P>

     <P>Wer &quot;WingCommander&quot; mit all seinen Helden wie Maniac oder Paladin
     mochte, wird auch &quot;Phoenix&quot; m&ouml;gen. </P>
	</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Einerseits sollen viele Standards vom Spiel unterst&uuml;tzt werden,
     wie AHI f&uuml;r den Sound, sowie Grafikkarten und PPC - andererseits
     sind die Mindestvoraussetzungen auch ziemlich hoch angesetzt. Nur
     mit den heute schnellsten Amiga-Prozessoren soll sich das Zocken
     lohnen. Kann man keine Features ausblenden, so da&szlig; es auch auf
     etwas kleineren Systemen ertr&auml;glich l&auml;uft, bzw. ist so die
     potentielle K&auml;uferbasis nicht viel zu schmal?
	</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>EH:</TH>
    <TD><P>So ganz ist diese Darstellung nicht richtig. Eine detaillierte
     Engine braucht nunmal Power, das steht ausser Frage. </P>

     <P>Selbstverst&auml;ndlich wird Phoenix Optionen bieten, um Details wie
     Hintergrundobjekte einzustellen, Spezialeffekte (Partikel,
     Bewegungsunsch&auml;rfe...) usw.. Fakt ist aber, dass das Spiel auf
     3-D-Hardware wie der CVPPC oder auch der CV3D drastisch besser
     aussehen wird und das dort fl&uuml;ssigere Frameraten zu erzielen sind.  </P>

     <P>Es wird diverse Optionen geben, die NUR auf besserer Hardware laufen
     und zum Beispiel auf normalen Grafikkarten und 68k-CPUs &uuml;berhaupt
     nicht dargestellt werden. Andererseits wird man aber das Spiel auch
     auf einem 040er mit AGA oder Grafikkarte spielen k&ouml;nnen.</P>

     <P>Was die potentielle K&auml;uferbasis angeht: bisher gab es eigentlich
     kein kommerzielles Spiel, das &auml;hnliche Hardware-Unterst&uuml;tzung
     aufwies, daher werden wir durch Phoenix erfahren, inwiefern die
     User bereits mit Hardware ausger&uuml;stet sind.      </P>

    <P> Im &Uuml;brigen w&uuml;rde ich eine Grundvoraussetzung von 040(FPU) und AGA
     nicht unbedingt als &quot;hoch&quot; bezeichnen.  </P>
	</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wie kamt Ihr eigentlich auf den Namen 'Future Tales' f&uuml;r Euer
     Team und wie funktioniert die Kommunikation w&auml;hrend der
     Entwicklungsarbeit?
	</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>EH:</TH>
    <TD> <P>Der Name fiel uns ein, ganz einfach :)</P>

     <P>Es sollte etwas Herausragendes sein, nicht unbedingt die Ein-Wort-
     Bezeichnungen, nicht unbedingt irgendwas mit &quot;Bytes&quot; oder &quot;Software&quot;. </P>

     <P>FUTURE TALES, das sind Erz&auml;hlungen aus der Zukunft, und das
     paradoxe daran ist, dass Erz&auml;hlungen sich eigentlich auf die
     Vergangenheit beziehen. Die Bezeichnung soll eine mystische
     Bedeutung haben.   </P>

   <P>  Unsere Kommunikation funktioniert &uuml;ber Telefon und eMail,
     tats&auml;chlich habe ich bisher nur den Jochen pers&ouml;nlich kennengelernt. </P>
	</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wie sind Eure Erfahrungen mit dem Entwicklersupport der f&uuml;r Euch
     relevanten Amiga-Firmen, wie z.B. Amiga, Phase5 oder Haage&amp;Partner?
	</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>EH:</TH>
    <TD><P>Der Support von Amiga ist eigentlich, zumindest f&uuml;r uns, nicht
     existent. Ich habe Jim Collas zwar mal per eMail &uuml;ber Phoenix
     informiert, aber mehr als ein nettes &quot;Interessant!&quot; kam da nicht
     zur&uuml;ck. </P>

     <P>Phase5 und Haage&amp;Partner hingegen sind wirklich hervorragend, was
     die Investition in die Zukunft angeht, da kann man sich als
     Entwickler nicht beschweren. F&uuml;r die Entwicklung von Phoenix wurden
     uns sowohl Hardware als auch Software gestellt.      </P>

     <P>Unser Vertrieb, der APC&amp;TCP, muss nat&uuml;rlich auch erw&auml;hnt werden. Die
     pers&ouml;nliche Betreuung durch Andras Magerl ist fabelhaft und &quot;genau
     richtig&quot;. Ich habe schon von Kollegen geh&ouml;rt, die mit Knebelvertr&auml;gen
     und absolut &uuml;bertriebenen Versprechungen konfrontiert wurden, sowie
     mit Publishern, die sich permanent ins Spieldesign einmischen usw. </P>

     <P>Da kann ich nur sagen, dass wir v&ouml;llige kreative freiheit geniessen
     und mit dem APC&amp;TCP bisher einen fairen Publisher und guten
     Entwicklungspartner gefunden haben.   </P>
	</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Im Moment h&auml;ufen sich wieder Meldungen &uuml;ber Aktivit&auml;ten von Hackern
     und Crackern auf dem Amiga. Sorgt Ihr Euch um m&ouml;gliche Einbu&szlig;en
     beim sp&auml;teren Verkauf und plant Ihr Ma&szlig;nahmen, z.B. den Einbau
     einer Codeabfrage?
	</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>EH:</TH>
    <TD><P>Nat&uuml;rlich kann ich hier keine Hinweise geben, aber nat&uuml;rlich haben
     wir uns &uuml;ber das Thema Gedanken gemacht und eine, wie ich hoffe,
     gute L&ouml;sung gefunden. </P>

    <P> Das Cracken wird man nie unterbinden k&ouml;nnen, das ist eine
     gegenseitige Aufholjagd. Dennoch sollte es jedem User klar sein,
     dass der Besitz und das Verbreiten von gecrackten Programmen den
     Entwicklern und letztendlich den Usern schadet, den juristischen
     Aspekt mal gar nicht mit einbezogen. </P>

<P>     Viele Leute haben Boxen voller Raubkopien, von denen sie nicht mal
     die H&auml;lfte nutzen, da stellt sich die Sinnfrage. </P>
	</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD> Wo liegen Eure Wurzeln? Wart Ihr vorher schon an anderen Projekten
     oder Programmen beteiligt?
	</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>EH:</TH>
    <TD><P>Markus hat neben dem Shareware-Game &quot;Virtual Interceptor&quot; nat&uuml;rlich
     &quot;Flyin' High&quot; programmiert. </P>

     <P>Jochen ist unser Multitalent: er musiziert und programmiert
     gleichzeitig, freih&auml;ndig und auf einem Bein! Zu seinen besten
     Programmen geh&ouml;rt sicherlich der Kultklassiker &quot;DangerDogg&quot;, sowie
     die R&auml;tselnuss &quot;Quattro&quot;.         </P>

     <P>Seine zweite grosse Begabung, das Komponieren von Soundtracks aller
     Stilrichtungen, hat er k&uuml;rzlich in Spielen wie &quot;T-Zero&quot; (clickBOOM)
     und &quot;Space Station 3000&quot; unter Beweis gestellt. </P>

     <P>Meine Wenigkeit hat schon an Spielen wie &quot;Trapped-Das Rad von Talmar&quot;,
     &quot;Samba Party&quot;, &quot;Samba WorldCup&quot;, &quot;Hollywood Pictures&quot;, &quot;Flamingo
     Tours&quot;, &quot;American Dream&quot; mitgewirkt.  </P>
	</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Was haltet Ihr von dem Weg, den Amiga mit Gateway jetzt nimmt?
     Wo liegen Eurer Meinung nach die Chancen und die Gefahren?
	</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>EH:</TH>
    <TD> <P>Nun, um ganz offen zu sein: Taten z&auml;hlen, nicht Worte. Was mir etwas
     missf&auml;llt, ist der geradezu religi&ouml;se Unterton, der in sovielen
     &quot;Public Letters&quot; von Amiga-Vertretern anklingt.</P>

     <P>Bisher wurde vieles angek&uuml;ndigt, aber die wirklich relevanten Fragen
     verschwinden immer in einem nebul&ouml;sen Brei aus Durchhalte-Parolen
     und halbherzigen Andeutungen.</P>

     <P>Beispielsweise weiss ja bis heute keiner, welche Rolle Amiga spielen
     wird. Machen die nun nur Hardware, nur Software? Auf welcher CPU
     l&auml;uft der zuk&uuml;nftige Amiga? Etwas befremdlich f&uuml;r eine Firma, die
     quasi die Revolution auf dem Computermarkt prophezeit. </P>

     <P>Ich hoffe, dass Amiga sich nicht in eine v&ouml;llig sinnlose Sache
     verrennt und versucht, eine avantgardistische Hardware/Software-
     Kombination zu erschaffen, die am Ende weder Fisch noch Fleisch ist,
     und die keiner will, weil sie zu abgehoben ist.</P>

     <P>Die Chance momentan ist, einen Amiga zu erschaffen, der kosteng&uuml;nstig
     ist, da er auf Standardhardware aufbaut, aber dennoch innovativ, da
     er mit einem guten Betriebssystem ausgestattet ist. Darauf aufbauend
     liesse sich eine Vision f&uuml;r die Zukunft entwickeln, die vielleicht
     wieder einen Rechner hervorbringt, der &auml;hnlich revolution&auml;r wie der
     Amiga von 1984 war.</P>

     <P>In meinen Augen w&auml;re es das Vern&uuml;nftigste, sich an Apple zu
     orientieren. Die haben zwar eine Durststrecke hinter sich gebracht,
     aber dennoch eine eigene Identit&auml;t bewahrt. Daher s&auml;he ich am
     liebsten einen PowerPC-Amiga mit guter Grafikkarte, statt eines
     Luftschlosses, das mit irgendwelchen geheimen Mystic Chips best&uuml;ckt
     die Mhz-Schallmauer durchbricht. Der Atari Jaguar und das CD32 haben
     bewiesen, dass die Hardware nicht unbedingt der ausschlaggebende
     Faktor ist.</P>
	</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD><P>Wo wohnt Ihr eigentlich, wie alt seid Ihr und was macht Ihr
     schulisch/beruflich bzw. in Eurer Freizeit neben dem 'Computern'? :)  </P>
	</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>EH:</TH>
    <TD><P>Ich bin 26, wohne im sch&ouml;nen Saarland, nahe der franz&ouml;sischen Grenze,
     und studiere noch. </P>

     <P>Jochen ist 18, wohnt im sonnigen Alpirsbach und geht noch zur Schule.</P>

     <P>Markus ist 25, ist auf dem besten Wege sein Studium der Informatik
     mit Bravour zu beenden und wohnt im f&uuml;rstlichen F&uuml;rstenfeldbruck.        </P>
	</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Unsere Standardfrage darf nat&uuml;rlich nicht fehlen: Kanntet Ihr den
     AmZeiger bereits vor dem Interview und was haltet Ihr von ihm?
	</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>EH:</TH>
    <TD><P>Der AmZeiger ist uns nat&uuml;rlich bekannt und als User und Entwickler
     sch&auml;tzen wir ihn gleichermassen als kompetentes und informatives
     Magazin rund um den Amiga.</P>

    <P> Der AmZeiger erf&uuml;llt am Amiga eine immer wichtiger werdende
     Funktion, n&auml;mlich die Versorgung der User mit News und Infos
     jenseits der Printmedien.</P>

	</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Vielen Dank f&uuml;r das Interview!</TD>
</TR>
</TABLE>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="web_adv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../sw/9906cfp.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
