<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - AmPuls</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U><A NAME="Top">Am Puls - Kurzmeldungen:</A></U></H1><P ALIGN="CENTER">
<A HREF="#Software">Software</A> / <A HREF="#Hardware">Hardware</A> / <A HREF="#Spiele">Spiele</A> / <A HREF="#Sonstiges">Sonstiges</A><br>
Weitere News: <a href="pdnews.htm">PD-News-Box</a></p>

<H2 ALIGN="CENTER">Amiga-Allgemein</H2>

<P>Zum <B>AmigaOS 3.5</B> gibt es inzwischen ein paar zus&auml;tzliche Details. Die
mitgelieferte Version des Browsers AWeb wird keine JavaScript-F&auml;higkeiten
aufweisen und als TCP-Stack eine &auml;ltere Miami-Version eingesetzt. Der
eMail-Client wird vom Programmierer des NewsReader `New York` bzw. des
eMail-Programms `Voodoo` erstellt.</P>

<P><A HREF="http://www.amiga.de">http://www.amiga.de</A><br>
<A HREF="http://www.haage-partner.com">http://www.haage-partner.com</A></P>

                                  <hr width="50%">

<P><A HREF="http://www.act-net.com/">A.C.T.</A> hat nun den endg&uuml;ltigen Abschied vom professionellen Amiga-Markt
bekanntgegeben. In einer l&auml;ngeren Erkl&auml;rung wurden die Gr&uuml;nde, u.a. die
Nicht-Beachtung durch Amiga, dargelegt. Amiga-Produkte w&uuml;rden von nun an
nur noch auf privater Basis `nebenbei` weiterentwickelt.</P>

                                  <hr width="50%">

<P>Die Zeitschrift <b>AmigaFever</b> wurde eingestellt und laut offizieller Lesart
in die <A HREF="http://www.amigaos.de">amigaOS</A> &uuml;bernommen. Abonnenten werden mit der amigaOS weiter
beliefert.</P>

<HR WIDTH="100%">
<A NAME="Hardware"><H2 ALIGN=CENTER>Hardware</H2></A>

<P><A HREF="http://www.phase5.de">Phase 5</A> hat die Spezifikationen seines von einer gen&uuml;gend hohen Anzahl an
Vorbestellungen und Anzahlungen abh&auml;ngigen G3/G4-Turbokartenprojektes
verbessert und die vorkalkulierten Preise etwas nach unten korrigiert.
Au&szlig;erdem wird es auch f&uuml;r A1200-Tower je eine G3/300 MHz- und eine G4/300
MHz-Beschleunigungskarte geben.</P>

<P>Alle Karten sollen generell mit SCSI ausgeliefert werden, die 1200er
Versionen mit Ultra-SCSI und die A3/4000-Versionen mit UltraWide-SCSI.
Au&szlig;erdem werden 400 MBit/s-Firewire-Ports integriert. Die Preise beginnen
bei etwa 1.500,- DM.  </P>


<P>[Kommentar zu p5-Pressemitteilungen bei <A HREF="../alf/9906alf.htm">ALF</A>.]</P>

                                  <hr width="50%">

<P>Die Firma <A HREF="http://www.metabox.de">Metab@x</A> (fr&uuml;her unter PIOS firmierend) will mit AmiJOE ebenfalls
eine G3-Turbokartenserie f&uuml;r A2/3/4000, sowie A1200 herausbringen, die auf
ihrer bereits verf&uuml;gbaren JoeCard-Familie (f&uuml;r Apple) basiert.</P>

<P>Als Prozessor werden der PowerPC 750 mit 333 (A1200) bzw. 400 MHz und 1 MB
Backside-Cache eingesetzt. PCI-Connector und USB-Schnittstelle sollen f&uuml;r
zuk&uuml;nftige Erweiterbarkeit sorgen und die Preise bei etwa 1.400,- DM f&uuml;r
die A1200-Version und 2.000,- DM f&uuml;r die andere Variante beginnen.</P>

                                  <hr width="50%">

<P>Auch <A HREF="http://www.titancomputer.de">Titan Computer</A> k&uuml;ndigt mit <B>Twister G3/G4</B> die Entwicklung einer neuen
Beschleunigerkarte f&uuml;r den A1200 an, die zusammen mit ACT (Apollo-Karten)
und Haage&amp;Partner projektiert wurde.</P>

<P>Die im FlashROM integrierte 68k-Emulation von <A HREF="http://www.haage-partner.com">Haage&amp;Partner</A> soll auf einem
300 MHz-G3 die Geschwindigkeit eines 68060 erreichen. 2 lokale PCI-Ports
sind f&uuml;r die Aufr&uuml;stung durch eine RivaTNT2-Grafikkarte und einen
UltarWide-SCSI-Controller gedacht.</P>

<P>Der voraussichtliche Preis f&uuml;r die im 4. Quartal 99 herauskommende
G3/300 MHz-Version betr&auml;gt 1.100,- DM. </P>

                                  <hr width="50%">

<P>Die Firma <A HREF="http://www.dcecom.de">DCE</A> aus Oberhausen wird einen gro&szlig;en Teil der <A HREF="http://www.phase5.de">Phase 5</A>-
Modellpalette in Lizenz fertigen, die dort zugunsten der PPC-Reihe
ausgelaufen ist. Dies umfa&szlig;t so gut wie alle zuletzt aktuellen 68k-
Blizzardkarten, den SCSI-Kit IV daf&uuml;r, sowie die CyberVision 64/3D
und Cyberstorm Mk III.</P>
                                  <hr width="50%">

<P><A HREF="http://www.vmc.de">VMC</A> senkt die Preise f&uuml;r seine <B>HyperCOM-Karten</B>. U.a. kostet die Zorro-II-
Karte HyperCOM 3+ nun 99,- und die HyperCOM 1 f&uuml;r den A1200 79,- DM.
Au&szlig;erdem wurde die zweite Generation der HyperCOM 3+ fertiggestellt.</P>

<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Software">Software</A></H2>

<P> Von <B>WarpUp</B> ist nun die wesentlich erweiterte Version 4 erschienen, die
gerade Entwicklern mehr Komfort bietet und m&ouml;glicherweise bald von vielen
Programmen vorausgesetzt werden wird. Enthalten ist auch eine PowerUp-
Emulation von Frank Wille, die es, obwohl noch nicht komplett, einigen
PowerUp-Programmen erm&ouml;glicht, unter WarpUp zu laufen.</P>

<P><A HREF="http://www.haage-partner.com">http://www.haage-partner.com</A> </P>
                                  <hr width="50%">

<P>Die bekannte Bildbearbeitungssoftware <B>Photogenics</B> wurde jetzt in der
Version 4 ver&ouml;ffentlicht. Zahlreiche neue Features zur Manipulation von
Grafiken und interne Verbesserungen sind hinzugekommen. Der Preis betr&auml;gt
179,- DM bzw. 119,- DM f&uuml;r das Update von einer &auml;lteren Version.</P>

<hr width="25%">

<P>Mit der `inoffiziellen RedHat 5.1 Linux`-Portierung (die Englischkenntnisse
voraussetzt), `gateway! Vol.3` (NetBSD) und der Vorabversion von pOS
bietet Schatztruhe jetzt ein <B>OS-Paket</B> zum Preis von 59,- DM an, deren
Bestandteile einzeln gekauft eigentlich 107,90 DM kosten w&uuml;rden. </P>

<P>[Kommentar: Von pOS wird es allerdings auch nie eine Vollversion geben,
da die Weiterentwicklung von proDAD schon vor l&auml;ngerem aufgegeben wurde;
d. Chefred.]</P>

<hr width="25%">

<P>Die <B>Aminet-CD 31</B> enth&auml;lt, neben etwa einem Gigabyte (entpackt) an Aminet-
Daten, als Bonus den Dateimanager bzw. WB-Emulator <B>Directory Opus 5.5</B>. Der
Preis betr&auml;gt 25,- DM.</P>

<P><A HREF="http://www.schatztruhe.de">http://www.schatztruhe.de</A></P>

                                  <hr width="50%">

<P>Ein kostenloser JAVA-Compiler namens <A HREF="http://www.ramjam.u-net.com/software/jikes/index.html">JIKES</A> wurde durch RamJam-Consultants
ver&ouml;ffentlicht. M&ouml;glicherweise wird es noch weitere JAVA-Software von
RamJam f&uuml;r den Amiga geben.</P>

                                  <hr width="50%">

<P><B>UltraConv</B>, das Effekt- und Konvertierprogramm f&uuml;r Einzelbilder und
Animationen, bietet in seiner Version 4 nun die Unterst&uuml;tzung 20
verschiedener Datenformate, sowie 55 animierte und 54 normale Filter,
dazu zahlreiche weitere Extras f&uuml;r 89,- DM.</P>

<P><A HREF="http://www.rbm.de">http://www.rbm.de</A></P>

                                  <hr width="50%">

<P>Das bekannte MIDI-Programm <A HREF="http://members.theglobe.com/geoarn/download.html">Bars&amp;Pipes Prof.</A> ist jetzt kostenlos im
Internet herunterzuladen.</P>
                                  <hr width="50%">

<P>Mit <A HREF="http://www.escape-net.org/3amigos-soft/main.htm">ShoutIRC</A> soll es bald eine weitere Alternative zum IRC-Client AmIRC
geben. Einen ersten Eindruck vom Entwicklungsstand kann man sich auf der
Homepage der Entwickler von `3 Amigos Software` verschaffen.</P>

                                  <hr width="50%">

<P>Das stark erweiterte Programm PlayHD zum Speichern von Audiodaten direkt
auf Festplatte wird bei erscheinen des n&auml;chsten Updates <A HREF="http://www.wentzler.limit.nl/">Audio Evolution</A>
hei&szlig;en.</P>

                                  <hr width="50%">

<P>Bei <A HREF="http://www.online-club.de/~ARENA/">Arena</A> gibt es diesmal u.a. <B>Digital Almanac II</B>, ein Programm f&uuml;r
Hobby-Astronomen, im Sonderangebot f&uuml;r 20,- DM. Allein die Sternendatei
umfa&szlig;t &uuml;ber 500.000 Daten.</P>

<P><A HREF="http://www.rzuser.uni-heidelberg.de/~astegema">http://www.rzuser.uni-heidelberg.de/~astegema</A></P>

<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Spiele">Spiele</A></H2>
 
<P>Nach zahlreichen Ger&uuml;chten und vielen widerspr&uuml;chlichen Meldungen hat
sich nun erwiesen, da&szlig; `<B>Siedler 2</B>` (BlueByte) tats&auml;chlich nicht auf
den Amiga umgesetzt wird, wie es Titan Computer urspr&uuml;nglich f&uuml;r sich
in Anspruch genommen hatte.</P>

<P>
<A HREF="http://www.titancomputer.de">http://www.titancomputer.de</A><br>
<A HREF="http://www.bluebyte.de">http://www.bluebyte.de</A>
 </P>
<P>[Kommentar zu dem Hickhack bei <A HREF="../alf/9906alf.htm">ALF</A>.]</P>

                                  <hr width="50%">

<P><B>Wasted Dreams</B> soll nach zahlreichen Schwierigkeiten tats&auml;chlich in
K&uuml;rze unter der Obhut von <A HREF="http://www.dd-ent.com/">Digital Dreams Entertainment</A> erscheinen. </P>

                                  <hr width="50%">

<P>Mit <A HREF="http://www.rz.tu-ilmenau.de/~sobotta/acsys.html/">ACSYS</A> wird an einem Turrican-Klone gearbeitet, der seinem Vorbild
kaum nachstehen soll.</P>

                                  <hr width="50%">

<P>Der <A HREF="http://www.chiemgau.com/apc&tcp/">APC&amp;TCP</A> k&uuml;ndigt mit <B>SeaSide</B> ein Spiel an, bei dem, &auml;hnlich Theme Park,
ein Ferienort aufgebaut und verwaltet werden mu&szlig;/darf.</P>

                                  <hr width="50%">

<P><A HREF="http://www.islona.co.uk/">Islona Entertainment</A> ver&ouml;ffentlicht eine CD `The Best of Gremlin`, die
u.a. `Litil Devil`, `Disposable Hero`, `Super Cars 2`, `Zool`, sowie
`Zool 2` enthalten wird. Der Preis betr&auml;gt 60,- DM.</P>

                                  <hr width="50%">

<P>Des Shoot`Em`Up <A HREF="http://www.clickboom.com/t0/">T-Zer0</A> (vormals Trauma Zero) soll laut clickBOOM! kurz
vor der Fertigstellung stehen. Die CD wird einen Leveleditor beinhalten. </P>



<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Sonstiges">Sonstiges</A></H2>

<P>Die Postfachnummer des Amiga-Clubs und Softwarevertriebs <A HREF="http://www.chiemgau.com/apc&tcp/">APC&amp;TCP</A> hat sich
zwischenzeitlich ge&auml;ndert. Vollst&auml;ndig lautet die Adresse nun:
APC&amp;TCP, Postfach 83, D-83236 &Uuml;bersee </P>

<hr width="50%">

<P>Nachdem der ber&uuml;hmte <A HREF="http://ftp.uni-paderborn.de/aminet/  ">Aminet</A>-Hauptserver `wustl` in Washington, USA, schon
&ouml;fter mal Probleme bereitet und damit dann das gesamte Netz l&auml;ngerfristig
gel&auml;hmt hat, ist nun endlich die `Uni-Paderborn` die Nummer 1 und
&uuml;bernimmt also die Serveraufgaben. </P>


<P><CENTER><A HREF="#Top">Zur&uuml;ck zum Anfang</A></CENTER></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="about.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="pdnews.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

