<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Der alte Postsack</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN=CENTER><U>Der alte Postsack</U></H1>

<P>Wieder sieht es &auml;u&szlig;erst mau aus mit echten Leserbriefen. Ohne mich
hier in Vorw&uuml;rfen &uuml;ber schlaffes Konsumverhalten zu verlieren oder
gleich die Keule der Drohung zu schwingen (zwei Online- und ein
Printmagazin f&uuml;r den Amiga haben in der letzten Zeit aufgeh&ouml;rt als
Zeitschriften zu existieren), m&ouml;chte ich Euch doch aufrufen, auch
ein klitzekleines bi&szlig;chen Engagement aufzubringen.</P>

<P>Direkt nach dem Lesen, wenn man zu sich sagt: &quot;Ja, das war richtig
gut&quot; oder &quot;Was`n das f&uuml;r`n Schwachsinn?&quot;, dann setzt Euch in der
Aufwallung doch mal ganz k&uuml;hn an die Tastatur, &ouml;ffnet Euren Mailer
und tippt zwei, bis zweieinhalb Worte (wenn n&ouml;tig auch mehr) an
die Adresse <A HREF="AmZeiger@gmx.de">AmZeiger@gmx.de</A>!</P>

<P>Ist das zuviel verlangt f&uuml;r mehrere Monate Arbeit von mehreren
Redakteuren?</P>

<P>Es w&uuml;rde mich und die gesamte Redaktion freuen, wenn sich mehr
dazu aufraffen k&ouml;nnten.</P>

<P>Nun zu den Briefen dieser Ausgabe:</P>

<PRE>

<HR>

           <B>&gt;&gt; Absender: Gunnar Edel (<A HREF="agathodaemon@gmx.de">agathodaemon@gmx.de</a>) &lt;&lt;</B>

(Wir hatten nachgefragt, ob die Anforderung Gunnars der Guide- UND
HTML-Version wirklich kein Versehen sei.)

G&gt; Hallo,
G&gt;
G&gt; ich wollte tats&auml;chlich beide Versionen haben ( .html zum Selberlesen
G&gt; und .guide zum Durchreichen an Freunde, welche nur OS 2.x und keinen
G&gt; Netzzugang besitzen).
G&gt;
G&gt; Den AmZeiger kenne ich seit 2 oder 3 Ausgaben und habe ihn aus dem
G&gt; Netz gezogen (meistens dem Aminet).
G&gt;
G&gt; mfg,
G&gt;      Gunnar Edel

Gibt es tats&auml;chlich noch Leute ohne Netzzugang? ;)

Jedenfalls erh&ouml;ht das erfreulicherweise die Dunkelziffer unserer
Leser! :))

<hr>

 <B>&gt;&gt; Absender: Andreas Mayer-Guerr (<A HREF="amayer@techfak.uni-bielefeld.de">amayer@techfak.uni-bielefeld.de</A>) &lt;&lt;</B>

A&gt; Hallo!
A&gt;
A&gt; Ich habe Euren Installer-Kurs im AmZeiger gefunden und wuerde ihn
A&gt; gerne offline lesen.
A&gt;
A&gt; Jetzt mein Verbesserungsvorschlag: wenn es bei Euch platzmaessig
A&gt; moeglich ist, koenntet Ihr dann Eure Kurse vielleicht auch als
A&gt; komplette Archive (jeweils einzeln) zum Download auf Eurer Webseite
A&gt; bereitstellen? Wie ich das verstanden habe, kann man im Moment nur

Das k&ouml;nnte zuk&uuml;nftig doch ein kleines Platzproblem darstellen, da
unsere Ausgaben ja im Moment auf drei verschiedenen Servern erh&auml;ltlich
sind. Aber...

A&gt; Eure kompletten Ausgaben einzeln downloaden.

...wir senden es Dir gerne komplett zu. Wenn jemand sonst einen
&auml;hnlichen Wunsch haben sollte: wir arbeiten hier ja auf Zuruf und
Service ist bei ins im Preis (ups, wir sind ja umsonst ;)
inbegriffen!

A&gt; Mich z. B., interessiertaber im Moment nur der Installer-Kurs.

Das ist nat&uuml;rlich schade, wir haben doch noch einiges mehr auf
dem Kasten! :)

A&gt; Danke fuer Eure gute Arbeit, Gruss,
A&gt; Andreas

<hr>
</pre>

<p>Danke f&uuml;r diese Mitteilungen.</p>

<p>Bitte beachtet das, was ich oben geschrieben habe. Ein kostenloses
Magazin lebt durch Motivation. Und diese Motivation m&uuml;ssen wir durch
unsere Leser erfahren - macht uns also etwas Mut!</p>

<p>In diesem Sinne,</p>

<p>Euer</p>

<A HREF="mailto:AmZeiger@gmx.de">Alter Postsack</A>

</p>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="uhl.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="wanted.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


