<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Fr. Gisela's Problemecke</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<TABLE BORDER=0 WIDTH="100%">
<TR>
<TD><H1>Frau Gisela`s Problemecke</H1></TD><TD ALIGN="RIGHT"><IMAGE SRC="../images/frg.gif"></TD>
</TR></TABLE>

<P><B>Dies ist eine Rubrik</B>, in der diverse Fragen gestellt oder Probleme
geschildert werden k&ouml;nnen. Da Frau Gisela in dieser Ausgabe (wie immer)
gerade bei einer bekannten deutschen Frauenzeitschrift unabk&ouml;mmlich ist,
werden gezwungenerma&szlig;en wir versuchen zu helfen bzw. den Sachverhalt
hier ver&ouml;ffentlichen, um jemanden zu finden, der dies kann.
</P><HR>
<B>Drei wichtige Anmerkungen:</B>
<UL>
<LI>Wir weisen noch einmal daraufhin (s. <A HREF="impres.htm">IMPRESSUM</A>), da&szlig; f&uuml;r die
Richtigkeit von Angaben, in diesem Fall f&uuml;r Tips, Hinweise, Scripte
o.&auml;., <B>keine Gew&auml;hr bzw. Haftung</B> f&uuml;r eventuelle Folgen &uuml;bernommen
werden kann.</LI>
<LI>Sollten jemandem Fehler, Bugs oder sonstige Ungereimtheiten auffallen,
oder er selbst praktische Tips oder Probleml&ouml;sungen kennen, so w&uuml;rden
wir uns &uuml;ber eine Nachricht sehr freuen.</LI>
<LI>Und wer Probleme hat, sollte sich nicht scheuen, Sie uns zu schildern,
weil ihm drei Monate Wartezeit zu lang sind. Die Redaktion versucht
selbstverst&auml;ndlich sofort zu helfen.</LI>
</UL>
<HR>

<p>Werner Schneemelcher (<A HREF="mailto:WSchnee@t-online.de">WSchnee@t-online.de</A>) hat uns zum Euro-Zeichen
befragt:</p>

<pre>
---
&gt;
&gt; Hi
&gt;
&gt;
&gt; Ich hoffe meine Frage klingt nicht zu bl&ouml;d und ist vielleicht von
&gt; allgemeinem Interesse.
&gt;
<B>&gt; Wo bekomme ich das Euro-Zeichen her, wie installiere ich es (wenn
&gt; vorhanden) und wie kann ich es gleicherma&szlig;en allen Programmen zur
&gt; Verf&uuml;gung stellen?</B>
&gt;
---
</pre>

<p>[Dies erwies sich als, im Verh&auml;ltnis, harte Nu&szlig;. Diesmal k&uuml;mmert sich
wieder Thomas Heinrich um die Belange von Frau Gisela und fa&szlig;t die
Erkenntnisse der Redaktion zusammen; d.Chefred.]</p>

<p>Auf den ersten Blick eine leichte Frage, denn es gibt ja den Flodis-Euro-
Font. Nur hat sich herausgestellt, da&szlig; der Font auf keinem Rechner der
Redaktionsmitglieder zum Laufen zu bekommen ist. Es werden &uuml;berhaupt
keine Zeichen angezeigt, geschweige denn das Euro-Symbol.</p>

<p>Unser PD-Redakteur Peter Fischer hat dann einen Patch gefunden, der
zumindest dem topaz.font ein Euro-Symbol verleiht: EuroHack, im Aminet
unter util/patch, bzw. util/boot. Dieses Programm von Jilles Tjoelker
ersetzt nur das Zeichen 164 (das universelle W&auml;hrungszeichen &quot;&#164;&quot;) im
topaz.font.</p>

<p>Soweit vorerst zur Verf&uuml;gbarkeit. Wie man drankommt, ist eine andere
Sache. Da nur der topaz.font gepatcht wird, mu&szlig; auch jedes Programm,
welches das Eurosymbol braucht, den topaz.font verwenden. In einer
Textverarbeitung nat&uuml;rlich absolut undenkbar. Trotzdem, wer es probieren
will: Mittels Alt-z kommt man an das Symbol ran.</p>

<p>Die zweite, flexiblere M&ouml;glichkeit w&auml;re, die &quot;ttflib&quot; zu verwenden. Das
ist ein aus Unix portiertes Programm, mit dem man die Truetype-Fonts
(bekannt aus Microsoft Windows) benutzen kann. Diese haben in den
neuesten Versionen das Euro-Symbol schon eingebaut und sind Freeware,
im Aminet zum Download (1.5 MB): text/font/WebFonts.lha.</p>

<p>Der Nachteil dabei ist, da&szlig; man selber aust&uuml;fteln mu&szlig;, welchen Code das
Eurosymbol hat, und es dann bei der Installation des Fonts auf ASCII 164
von Hand ummappen mu&szlig;. Pers&ouml;nlich habe ich das noch nicht probiert,
vielleicht hat ein Leser da weitergehende Erfahrungen. Standardm&auml;&szlig;ig
erscheint auf jeden Fall das Standardzeichen &quot;&#164;&quot;.</p>

<p>Mit der 'ttflib' hat man dann in der Textverarbeitung skalierbare Fonts
mit Eurosymbol, die beim Ausdruck auch gut aussehen, vorausgesetzt, die
Textverarbeitung unterst&uuml;tzt dies auch.</p>

<p>[Der Autor des Flodis-Eurofonts hat uns nun auf einen anderen, nicht von
ihm stammenden Font, hingewiesen, der auch das Euro-Zeichen enth&auml;lt. Es
handelt sich um `WBFontProp`, der im im Aminet unter
<A href="http://ftp.uni-paderborn.de/pub/aminet/text/font/WBFontProp.lha">http://ftp.uni-paderborn.de/pub/aminet/text/font/WBFontProp.lha</A>
verf&uuml;gbar ist; d.Chefred.]</p>

<p>Nochmal derselbe Leser, mit einer anderen Frage:</p>

<pre>
---
&gt;
&gt; Vielen Dank f&uuml;r eure Bem&uuml;hungen, auch wenn derzeit nicht mehr zu machen
&gt; ist. Das es mit Flodis Probleme gibt, habe ich auch feststellen m&uuml;ssen.
&gt; Euro-hack werde ich ausprobieren.
&gt;
&gt; Da ich schon mal schreibe, hier eine weitere Frage:
&gt;
<B>&gt; Habt Ihr Testangaben oder eigene Erfahrungen mit dem ScanExpress 600 CP?
&gt; Dieser wird zur Zeit f&uuml;r den Amiga angeboten f&uuml;r den Preis von 219.-
&gt; incl. ScanQuix4 (bei RBM). Ist Scannen mit 300x600dpi ausreichend?</B>
&gt;
---
</pre>

<p>Hier ist meine Antwort an ihn:</p>

<p>Kommt ganz darauf an, was Du Scannen willst und wie hoch Deine
Qualit&auml;tsanspr&uuml;che sind. Ich habe einen Microtek X6 mit 600x1200 dpi,
mit dem man Dias gerade noch und Pa&szlig;bilder in ziemlich guter Qualit&auml;t
hinbekommt.</p>

<p>Aus eigener Erfahrung wei&szlig; ich, da&szlig; man Vorlagen immer mit doppelter
Aufl&ouml;sung scannen sollte, als man eigentlich braucht. Wenn man sie
dann auf die H&auml;lfte skaliert, ist die Qualit&auml;t am besten.</p>

<p>Ein normales Pa&szlig;bild mit 4x6 cm kann der ScanExpress mit 472x708 Pixel
Gr&ouml;&szlig;e scannen (300 dpi). Die 600 dpi sind leider weitgehend nutzlos, denn
sie entsprechen der Aufl&ouml;sung der CCD-Zeile. Wichtig ist aber vor allem
die Feinheit der Mechanik, die die Zeile an der Vorlage entlangf&auml;hrt,
also die 300 dpi. Scannst Du mit 600 dpi, wird jeder zweite Pixel in der
vertikalen von der Software interpoliert, was herbe Qualit&auml;tsverluste
bedeutet. Trotzdem kannst Du mit 600 dpi scannen und dann
herunterskalieren, so da&szlig; Du im Vergleich noch eine etwas
bessere Qualit&auml;t bekommst, als mit 300 dpi.</p>

<p>Die Farbqualit&auml;t ist eine andere Sache. Die heutigen Scanner leisten
sich keine so starken Verf&auml;lschungen mehr, da&szlig; man sie nicht mit etwas
Nachbearbeitung wegbekommt.</p>

<p>[Zum Thema Scanner gibt es in dieser Ausgabe auch einen <A HREF="../hw/9906scan.htm">Test</A>.]
</p>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../mmx/9906fil1.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="postsack.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
