<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Spiderman</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>Spiderman's Web-Abenteuer</U></H1><P ALIGN="CENTER">von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></P>

<P>[<B>Hinweis</B>: F&uuml;r diese regelm&auml;&szlig;ige Rubrik suchen wir noch
einen freien Mitarbeiter! Wer Lust hat und &ouml;fter kreuz und quer durchs Web 'surft',
der <A HREF="wanted.htm">melde</A> sich bitte! ]</P>

<p>Wieder einmal habe ich mich nach interessanten Sites im Internet
umgeschaut:</p>

<p align=center><a href="#fp">Freie Presse-News</a> / <a href="#banana">B-A-M</a> / <a href="#midi">70s &amp; 80s MIDI</a> /
<a href="#nclub">NewsClub</a> / <a href="#stadt">Stadtplandienst</a></p> 

<hr width=75%>

<H2 ALIGN="CENTER"><A NAME="fp">Freie Presse - News</A></H2>

<P>Immer aktuelle Meldungen zum Tagesgeschehen gibt es auf den Webseiten der
<B>Freien Presse</B>.  </P>

<P>Auf der angenehm einfachen, unaufdringlichen News-Seite, erscheinen, nach
einer Zusammenfassung mit den &Uuml;berschriften, aufeinanderfolgend die
Meldungen der letzten 24 Stunden, jeweils mit Angabe der Uhrzeit.  </P>

<P><TABLE BORDER=1 ALIGN=CENTER>
<CAPTION>Freie Presse - News</CAPTION>
<TR><TD COLSPAN=2><A HREF="http://www.freiepresse.de/TEXTE/NEWS/news.html">http://www.freiepresse.de/TEXTE/NEWS/news.html</A></TD></TR>
<TR><TD>Sprache(n)</TD><TD>DEUTSCH</TD></TR>
<TR><TD>Frames ?</TD><TD>NEIN</TD></TR>
<TR><TD>Ladezeit</TD><TD>GERING</TD></TR>
<TR><TD>&Uuml;bersicht</TD><TD>SEHR GUT</TD></TR>
<TR><TD>Design</TD><TD>MITTEL</TD></TR>
<TR><TD>Nutzen</TD><TD>SEHR GUT</TD></TR>
<TR><TD>Seitenpflege</TD><TD>SEHR GUT</TD></TR>
<TR><TD COLSPAN=2></TD></TR>
<TR><TD>INSGESAMT</TD><TH>SEHR GUT</TH></TR>
</TABLE></P><BR><HR WIDTH=75%>

<CENTER><H2><A NAME="banana">Bananenaufklebermuseum B-A-M</A></H2></CENTER>
<BR>

<P>&quot;Entdecke die Welt des Bananenaufklebers!&quot; lautet der Spruch, der einen
sofort nach 'Betreten' der Homepage des im ersten Moment etwas skurril
anmutenden <B>Bananenaufklebermuseums</B> empf&auml;ngt. Aber es ist doch ganz lustig,
sich hier einmal umzuschauen. </P>

<P>Neben den Exponaten, den alphabetisch geordneten kleinen Bildchen der
Aufkleber (am 13.06.99 waren es 547 verschiedene) und einigen Angaben
dazu, gibt es auch viele allgemeine Informationen zu Bananen und zu
aktuellen Aktionen des Museums.  </P>

<P>Bei meinem Besuch waren z.B. Entw&uuml;rfe von Sch&uuml;lern einer Magdeburger
Klasse ausgestellt, mit eigenen Ideen zu Bananenaufklebern. Nach
anf&auml;nglicher Skepsis habe ich mir diese doch fasziniert angeschaut, da
doch viele originelle Einf&auml;lle zu bewundern waren. </P>

<P>Das Design der Site ist recht gut - nat&uuml;rlich bananenfarbig und
Bananenmaskottchen lockern die Site hier und da auf.  </P>

<P><TABLE BORDER=1 ALIGN=CENTER>
<CAPTION>Bananenaufklebermuseum B-A-M</CAPTION>
<TR><TD COLSPAN=2><A HREF="http://www.b-a-m.de">http://www.b-a-m.de</A></TD></TR>
<TR><TD>Sprache(n)</TD><TD>DEUTSCH</TD></TR>
<TR><TD>Frames ?</TD><TD>JA</TD></TR>
<TR><TD>Ladezeit</TD><TD>GERING</TD></TR>
<TR><TD>&Uuml;bersicht</TD><TD>GUT</TD></TR>
<TR><TD>Design</TD><TD>GUT</TD></TR>
<TR><TD>Nutzen</TD><TD>MITTEL</TD></TR>
<TR><TD>Seitenpflege</TD><TD>GUT</TD></TR>
<TR><TD COLSPAN=2></TD></TR>
<TR><TD>INSGESAMT</TD><TH>GUT</TH></TR>
</TABLE></P><BR><HR WIDTH=75%>

<CENTER><H2><A NAME="midi">70's &amp; 80's MIDI</A></H2></CENTER>
<BR>

<P>Auf dieser Site gibt es <B>Midi</B>-Versionen zahlreicher Rock-Hits der siebziger
und achtziger Jahre. Es handelt sich bei allen Songs um damalige Top50-Titel.    </P>

<P>Das Design ist einfach und zweckm&auml;&szlig;ig. Die Startseite erscheint in etwas
ungl&uuml;cklichen Farben, aber das gilt gl&uuml;cklicherweise nicht f&uuml;r die eigentlichen
Listen. In einem oberen Frame kann man die einzelnen Buchstaben der Liste
anw&auml;hlen und unter den vorhandenen Titeln der jeweiligen Gruppen dann w&auml;hlen. </P>
<P>
Ein Frame auf der linken Seite bietet noch ein paar Links zu diversen weiteren
Quellen und Suchmaschinen f&uuml;r MIDI-Dateien.   </P>

<P><TABLE BORDER=1 ALIGN=CENTER>
<CAPTION>70's &amp; 80's MIDI</CAPTION>
<TR><TD COLSPAN=2><A HREF="http://www.gshome.com/midi/">http://www.gshome.com/midi/</A></TD></TR>
<TR><TD>Sprache(n)</TD><TD>ENGLISCH</TD></TR>
<TR><TD>Frames ?</TD><TD>JA</TD></TR>
<TR><TD>Ladezeit</TD><TD>GERING</TD></TR>
<TR><TD>&Uuml;bersicht</TD><TD>GUT</TD></TR>
<TR><TD>Design</TD><TD>MITTEL</TD></TR>
<TR><TD>Nutzen</TD><TD>GUT</TD></TR>
<TR><TD>Seitenpflege</TD><TD>k.A.</TD></TR>
<TR><TD COLSPAN=2></TD></TR>
<TR><TD>INSGESAMT</TD><TH>GUT</TH></TR>
</TABLE></P><BR><HR WIDTH=75%>

<CENTER><H2><A NAME="nclub">NewsClub</A></H2></CENTER>

<P><B>NewsClub</B> ist ein Meta-Nachrichtendienst. Von diversen Quellen im WWW, wie
z.B. den Newstickern diverser Zeitschriften oder Presseagenturen, werden
die Meldungen eines Tages gesammelt und deren &Uuml;berschriften hier zusammen
angezeigt. Per Klick gelangt man dann zur Meldung des jeweiligen Dienstes.    </P>

<P>Das Ganze gibt es f&uuml;r acht verschiedene Themenbereiche, wie nat&uuml;rlich
Computer, aber auch Politik, Wissenschaft oder Sport usw. und umfa&szlig;t
im Moment nur deutsche Quellen. Auch ein eMail-Abonnement ist m&ouml;glich.    </P>

<P>Das Design der Site ist einfach, klar und schn&ouml;rkellos - gut.  </P>

<P><TABLE BORDER=1 ALIGN=CENTER>
<CAPTION>NewsClub</CAPTION>
<TR><TD COLSPAN=2><A HREF="http://www.newsclub.de">http://www.newsclub.de</A></TD></TR>
<TR><TD>Sprache(n)</TD><TD>DEUTSCH</TD></TR>
<TR><TD>Frames ?</TD><TD>NEIN</TD></TR>
<TR><TD>Ladezeit</TD><TD>GERING</TD></TR>
<TR><TD>&Uuml;bersicht</TD><TD>SEHR GUT</TD></TR>
<TR><TD>Design</TD><TD>GUT</TD></TR>
<TR><TD>Nutzen</TD><TD>GUT</TD></TR>
<TR><TD>Seitenpflege</TD><TD>SEHR GUT</TD></TR>
<TR><TD COLSPAN=2></TD></TR>
<TR><TD>INSGESAMT</TD><TH>GUT</TH></TR>
</TABLE></P><BR><HR WIDTH=75%>

<CENTER><H2><A NAME="stadt">Stadtplandienst</A></H2></CENTER>

<P>Zu guter Letzt komme ich zum <B>Stadtplandienst</B>. Das ist ein Service des
StadtINFO-Verlages und umfa&szlig;t leider bisher nur die St&auml;dte Berlin,
D&uuml;sseldorf, Hamburg und M&uuml;nchen. Da diese aber nicht die unbekanntesten
sind, k&ouml;nnte es trotzdem f&uuml;r manchen interessant sein oder werden.   </P>

<P>Geboten werden nat&uuml;rlich Stadtpl&auml;ne dieser St&auml;dte. Allerdings gibt es
keinen Blick auf eine riesige Karte zum Umbl&auml;ttern oder &auml;hnlich, sondern
man kann in einer Suchmaske am oberen Bildschirmrand eine Adresse
eingeben, die dann gesucht und auf den jeweiligen Planquadraten des
Stadtplans angezeigt wird.  </P>

<P>Sollte es z.B. mehrere Stra&szlig;en mit demselben Namen geben, so kann man
zwischen den angegebenen (meist in unterschiedlichen Bezirken) w&auml;hlen.
Auf der linken Seite erscheint generell eine kleine &Uuml;bersicht &uuml;ber die
gesamte Stadt, so da&szlig; man wei&szlig;, an welcher Stelle man sich im gro&szlig;en
Ma&szlig;stab ungef&auml;hr befindet. Au&szlig;erdem gibt es dar&uuml;ber ein paar kleine
'Icons' mit denen man im Stadtplan weiterscrollen, zwischen vier
Anzeigegr&ouml;&szlig;en (mehr Planquadrate auf einmal) w&auml;hlen oder zoomen kann. </P>

<P>Alles in allem ist dies ein wirklich gelungener Service - &uuml;bersichtlich,
komfortabel und n&uuml;tzlich. Die wenigen Werbebanner st&ouml;ren kaum.    </P>

<P><TABLE BORDER=1 ALIGN=CENTER>
<CAPTION>Stadtplandienst</CAPTION>
<TR><TD COLSPAN=2><A HREF="http://www.stadtplandienst.de">http://www.stadtplandienst.de</A></TD></TR>
<TR><TD>Sprache(n)</TD><TD>DEUTSCH/ENGLISCH</TD></TR>
<TR><TD>Frames ?</TD><TD>NEIN</TD></TR>
<TR><TD>Ladezeit</TD><TD>GERING</TD></TR>
<TR><TD>&Uuml;bersicht</TD><TD>SEHR GUT</TD></TR>
<TR><TD>Design</TD><TD>GUT</TD></TR>
<TR><TD>Nutzen</TD><TD>SEHR GUT</TD></TR>
<TR><TD>Seitenpflege</TD><TD>k.A.</TD></TR>
<TR><TD COLSPAN=2></TD></TR>
<TR><TD>INSGESAMT</TD><TH>GUT</TH></TR>
</TABLE></P><BR><HR WIDTH=75%>

<P>Bis zum n&auml;chsten Mal!</P>

           
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="zensur.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="iv.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;  `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

