<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Auf dem Weg zur Vorzensur?</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Auf dem Weg zur Vorzensur?</H1>
<p><b>Softwareindustrie und Jugendbeh&ouml;rden im Clinch</b><br>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV></p>


<P>Im Artikel &quot;<a href="../amz0399/derindex.htm">Indizierungen von Computerspielen in der Praxis</a>&quot;, der in der
letzten Ausgabe erschien und u.a. die rechtlichen Grundlagen, die auch
nachfolgend eine wichtige Rolle spielen, ausf&uuml;hrlich behandelt, schlo&szlig;
ich mit dem Vorschlag zur Zusammenarbeit von Beh&ouml;rden und Industrie
zwecks Durchsetzung einer pragmatischen, realit&auml;tsnahen L&ouml;sung zum
Schutze der Heranwachsenden. Stattdessen kam es inzwischen zum Bruch.</P>

<P><B>Zusammenarbeit unter schlechtem Vorzeichen</B></P>

<P>Am 10. Juni 1997 war zwischen dem <B>VUD</B> (Verband der Unterhaltungssoftware
Deutschland) und den <B>OLJB</B> (Oberste Landesjugendbeh&ouml;rden) eine Vereinbarung
zur Einhaltung der geltenden Jugendschutzbestimmungen bei interaktiven
Medien getroffen worden, die quasi ein gegenseitiges Anerkennen und ein
Mindestma&szlig; an Zusammenarbeit bedeutete.</P>

<P>Schon zu diesem Zeitpunkt gab es un&uuml;berbr&uuml;ckbare Differenzen in der Frage,
wann es sich bei Computerspielen um <B>&quot;vergleichbare Bildtr&auml;ger&quot;</B> im Sinne
des &#167;7 J&Ouml;SchG (Gesetz zum Schutze der Jugend in der &Ouml;ffentlichkeit)
handelt. Die von der Industrie gegr&uuml;ndete, aber unabh&auml;ngige und nach dem
Verursacherprinzip finanzierte <B>USK</B> (Unterhaltungssoftware Selbstkontrolle)
hatte dies laut der genannten Vereinbarung seitdem, vor ihrer
gutachterlichen T&auml;tigkeit, zu pr&uuml;fen und gegebenenfalls das Medium der
<B>FSK</B> (Freiwillige Selbstkontrolle der Filmwirtschaft) zur Einstufung und
&Uuml;berpr&uuml;fung vorzulegen, an deren Entscheidungen die Jugendschutzbeh&ouml;rden
direkt beteiligt sind.</P>

<P>Die USK war nat&uuml;rlich in der Regel der Ansicht, da&szlig; ein interaktives
Computerspiel kein einem Film &quot;vergleichbarer Bildtr&auml;ger&quot; w&auml;re, ganz im
Gegensatz zu den Jugendbeh&ouml;rden, die in diesem Fall nicht vor der Freigabe
an den Handel eingreifen k&ouml;nnten. Dieser Streit schwelte also seit 1997
bis die OLJB in einem Schreiben vom 19. M&auml;rz 1999 diese Vereinbarung mit
Wirkung zum 30. April 1999 <B>aufgek&uuml;ndigt</B> haben. Der USK wird somit jede
Kompetenz in Jugendschutzfragen abgesprochen, der Wirkungsbereich der
Beh&ouml;rden soll vergr&ouml;&szlig;ert werden.</P>

<P><B>Die Beh&ouml;rden wollen mehr - viel mehr</B></P>

<P>Die Ziele der OLJB sind aber noch viel weitergehender, da sie eine
<B>Novellierung</B> des Gesetzes anstreben, um zuk&uuml;nftig alle &quot;digitalen
Bild- und Tontr&auml;ger (CD-ROM)&quot; unter den im Auftrag der Obersten
Landesjugendbeh&ouml;rden durch die Freiwillige Selbstkontrolle der
Filmwirtschaft praktizierten gesetzlichen Jugendschutz zu stellen, also
im Grunde selbst an den Entscheidungen beteiligt zu sein und eine
generelle Vorlage- und Kennzeichnungspflicht zu erreichen.</P>

<P><B>Filme und Videos</B> sind generell erst einmal als jugendgef&auml;hrdend eingestuft
und f&uuml;r Kinder und Jugendliche verboten, bevor sie nicht von der FSK,
respektive den Jugendbeh&ouml;rden freigegeben werden. Dies soll k&uuml;nftig also
auch f&uuml;r den gesamten Multimediabereich Anwendung finden, wenn es nach den
zust&auml;ndigen Referenten geht. In der Praxis wird das von Juristen &quot;Verbot
mit Erlaubnisvorbehalt&quot; genannt und ist bei Verfassungsrechtlern sehr
umstritten, da im Art. 5 des Grundgesetzes ein Verbot gegen &quot;Vorzensur&quot;
verankert worden ist.</P>

<P><B>Vorzensur?</B></P>

<P>Ein hartes Wort, was bedeutet es eigentlich genau? Nachfolgend
ein Auszug aus dem Bertelsmann Lexikon:</P>

<P>&quot;<B>Zensur</B>, [die; lateinisch], Presse- und Rundfunkrecht: die - zumeist
 staatliche - Kontrolle von ver&ouml;ffentlichten oder zur Ver&ouml;ffentlichung
 bestimmten Presseerzeugnissen, von Rundfunk- oder Fernsehsendungen und
 Filmen.</P>

<P> Mit <B>Vorzensur</B> werden einschr&auml;nkende Ma&szlig;nahmen vor der Herstellung oder
 Verbreitung von Geisteswerken, insbesondere die Abh&auml;ngigkeit der
 Ver&ouml;ffentlichung von einer beh&ouml;rdlichen Vorpr&uuml;fung und Genehmigung des
 Inhalts, bezeichnet.</P>
<P>
 Von <B>Nachzensur</B> spricht man, wenn Kontrollma&szlig;nahmen nach Ver&ouml;ffentlichung
 eines Geisteswerkes ergriffen werden.</P>

<P> Das in der Bundesrepublik Deutschland ausnahmslos geltende <B>Zensurverbot</B>
 des Art. 5 Abs. 1 Satz 3 GG <B>gilt nur f&uuml;r die Vorzensur</B>. Die Rechte
 hinsichtlich bereits ver&ouml;ffentlichter Geisteswerke finden dagegen ihre
 Schranken in den Vorschriften der allgemeinen Gesetze, den Bestimmungen
 zum Schutz der Jugend und in dem Recht der pers&ouml;nlichen Ehre. F&uuml;r den
 Film besteht die Freiwillige Selbstkontrolle der Filmwirtschaft. Der
 Deutsche Presserat, eine Vereinigung von Verleger- und
 Journalistenverb&auml;nden, stellt u. a. Richtlinien f&uuml;r die Presse auf,
 ohne jedoch eine Zensur auszu&uuml;ben.&quot;
                                                  </P>
<P><B>Die USK-T&auml;tigkeit in der Praxis</B> </P>

<P>Wie sah die Praxis der USK-T&auml;tigkeit aber in der Vergangenheit eigentlich
aus? Waren die Ergebnisse so bedenklich, da&szlig; solche Ma&szlig;nahmen
gerechtfertigt scheinen?  </P>

<P>Die USK hat seit ihrer Gr&uuml;ndung im Jahre 1994 ca. <B>90 Prozent</B> der deutschen
PC-Spiele (gemessen am Umsatz) gepr&uuml;ft. Das waren bisher &uuml;ber 4.060 St&uuml;ck
von 195 Antragstellern aus 6 L&auml;ndern. Der Anteil der Titel die mit &quot;nicht
geeignet unter 18 Jahren&quot; eingestuft wurden, lag insgesamt bei ca. 5
Prozent. 15 Prozent dieser Titel, bei denen die Selbstkontrolle also
Nichteignung f&uuml;r Kinder und Jugendliche feststellte, wurden sp&auml;ter durch
die BPjS (Bundespr&uuml;fstelle f&uuml;r jugendgef&auml;hrdende Schriften) indiziert.  </P>

<P>Laut Dr. Gerstenberger, dem Leiter der USK wurde also das Achtungszeichen
der USK &quot;...insofern best&auml;tigt. Zugleich wurde per Selbstkontrolle also
<B>h&auml;ufiger</B> auf Risiken des Mediums hingewiesen als durch die interessierte
&Ouml;ffentlichkeit.&quot; </P>

<P>Eine fachliche Kritik an den vorgenommenen USK-Alterskennzeichnungen ist
&uuml;brigens in der gesamten Zeit nie erfolgt! </P>

<P><B>Gegens&auml;tzliche Ansichten</B></P>

<P>Der VUD ist weiterhin der Ansicht, da&szlig; der Handel die ihm obliegende
<B>Sorgfaltspflicht</B> erf&uuml;llt (der H&auml;ndler kann im Zweifelsfall sp&auml;ter angeben,
in gutem Glauben gehandelt zu haben), wenn er darauf achtet, da&szlig; die
Datentr&auml;ger entweder die Kennzeichen der FSK oder USK aufweisen.
 </P><P>
Die OLJB sind da ganz anderer Auffassung und beanspruchen die &quot;gesetzliche&quot;
Vorlagepflicht gem&auml;&szlig; den Vorschriften des J&Ouml;SchG (trifft, wie erw&auml;hnt,
nur auf Filmen &quot;vergleichbare Bildtr&auml;ger&quot; zu), was den Handel nat&uuml;rlich
verunsichert. Da die Altersfreigaben der Industrie nicht mehr von den OLJB
anerkannt werden, sollen sich die H&auml;ndler von nun an nur noch auf FSK-
Einstufungen verlassen, ansonsten w&uuml;rde der Gutglaubenschutz wegfallen.
     </P>  <P>
<B>Verfassungsklage</B>  </P>

<P>Der VUD hat daher wegen des Tatbestandes der Vorzensur eine Klage beim
Bundesverfassungsgericht eingeleitet, um die Lage zu kl&auml;ren und seine
Mitglieder zu sch&uuml;tzen.</P>

<P>Als Grundlage f&uuml;r die VUD-Position dient ein <B>Gutachten</B> des anerkannten
Verfassungsrechtlers Prof. Dr. K. Redeker, Bonn, und des Rechsanwaltes
Dr. U. Becker, Berlin. In deren Zusammenfassung des Gutachtens hei&szlig;t es
u.a.:</P>

<OL>
<LI>Computerspiele auf CD-ROM oder Cartridges fallen nicht unter die
    Vorlagepflicht des &#167;7 Abs. 1 J&Ouml;SchG. Die Bestimmung bezieht sich
    nach Wortlaut, Systematik und Gesetzeszweck nur auf Bildtr&auml;ger,
    auf denen Filme abgespeichert sind.
</LI>
<LI>Einer erweiterten Auslegung des &#167;7 Abs. 1, nach der alle CD-ROM
    vorzulegen sind, weil die Bestimmung jeden Bildtr&auml;ger erfa&szlig;t, der
    mit filmischen Szenenfolgen bespielt ist, die Eindruck und Wirkung
    des Bildtr&auml;gers pr&auml;gen, stehen durchgreifende verfassungsrechtliche
    Bedenken entgegen, die entweder zu der unter Ziffer 1 wiedergegebenen
    Auslegung oder aber zur Vorlage an das BVerfG zwingen.
</LI>
</OL>

<P><B>UFU?</B></P>
<P>
Eine Anfrage der Computerhandelsfirma CDV bei der FSK, als Kontrollstelle
der Filmindustrie in einem vollkommen anderen Bereich t&auml;tig, ergab, da&szlig;
man Computerspiele nicht pr&uuml;ft bzw. <B>wegen mangelnder Ausstattung</B> auch
nicht pr&uuml;fen k&ouml;nne. Sollten die Hersteller aber meinen, da&szlig; sich auf der
CD-ROM filmische Sequenzen befinden, dann k&ouml;nnten sie das Produkt doch zur
Pr&uuml;fung einreichen. Die Frage und die Antwort sind Ausdruck f&uuml;r die
Verwirrung der Beteiligten, die so gar nicht im Sinne des Jugendschutzes
sein d&uuml;rfte. </P>

<P>Nachfolgend ein sehr treffendes und sehr bezeichnendes <B>Zitat</B>: </P>

 <P>&quot;Der Handel schaut verunsichert auf die Erkl&auml;rungen beider Parteien, die
  doch nur das eine wollen: den Schutz unserer spielebegeisterten Jugend.         </P>
  <P>
  F&uuml;r mich stellt sich zun&auml;chst die Frage: Wer darf sich eigentlich selbst
  kontrollieren, oder besser, wer ist eigentlich wer? Denken wir einmal
  logisch. Darf sich die FSK weiter &quot;Selbstkontrolle&quot; nennen (lassen wir
  das W&ouml;rtchen Filmwirtschaft einmal beiseite), wenn sie ein Medium auf
  Jugendvertr&auml;glichkeit pr&uuml;ft, das der eigenen Branche gar nicht angeh&ouml;rt? </P>

<P>  Und weiter, darf sie dann noch den Zusatz &quot;freiwillig&quot; tragen, wenn die
  Spieleindustrie quasi gen&ouml;tigt wird, das Schicksal der eigenen Produkte
  in die H&auml;nde einer branchenfremden Interessensgemeinschaft zu &uuml;bergeben?  </P>

  <P>Was bleibt also? Was bleibt, ist das &quot;K&quot; f&uuml;r &quot;Kontrolle&quot;. Lassen sie
  mich einen Vorschlag machen. Wie w&auml;re es, wenn die FSK einen Unterverband
  gr&uuml;ndet, die <B>UFU</B>: Unfreiwillige Fremdkontrolle der Unterhaltungssoftware-
  Industrie. Aber wer will das schon?&quot; J&uuml;rgen Fr&ouml;hlich (aus MCV 07.05.1999) </P>

<P><B>Welche Auswirkungen w&uuml;rde diese neue Praxis nach sich ziehen?</B></P>
<P>
Spiele, die von der FSK ab 18 eingestuft w&uuml;rden, d&uuml;rften nicht mehr &uuml;ber
den Versandhandel, auch nicht an Erwachsene, vertrieben werden. Das
Erscheinen von f&uuml;r den deutschen Markt lokalisierten Spielversionen
d&uuml;rfte sich wesentlich verz&ouml;gern, selbst die Cover-CDs der Spiele-
Zeitschriften m&uuml;&szlig;ten ausnahmslos erst einmal zur Kontrolle. Attraktive,
einigerma&szlig;en aktuelle Angebote w&auml;ren so kaum noch zu erwarten, der
deutsche Markt w&uuml;rde in einem wachsenden Zukunftsbereich wieder
einmal hoffnungslos hinterherhinken.                                </P>

<P>Und das, obwohl in der Zusammenarbeit zwischen Beh&ouml;rden und Industrie
gen&uuml;gend <B>Potential</B> liegt, geeignete Mechanismen zum Jugendschutz auch
ohne einen Wust an Gesetzen, Verordnungen und Zw&auml;ngen zu erreichen -
und insbesondere ohne jede Form der Zensur. Denn darauf l&auml;uft es leider
hinaus.</P>

<P>Im Grunde wollen die Jugendbeh&ouml;rden nicht mehr am Rande oder per
Indizierung quasi hinterher an den Entscheidungen beteiligt sein, selbst
wenn sich diese als richtig erwiesen haben, sondern selbst `die erste
Geige spielen`. Angesichts dessen, da&szlig; sich aus den obigen Zahlen eine
Indizierungsrate von maximal 1 Prozent der auf dem Markt befindlichen
PC-Spiele ergibt (die also als &quot;sozialethisch desorientierend&quot; eingestuft
wurden) erscheint diese pl&ouml;tzliche hysterische Konfrontationshaltung
geradezu <B>grotesk</B>.  </P>

<P>Statt zu versuchen, ihren Kompetenzbereich zu vergr&ouml;&szlig;ern und &uuml;ber ihn
eifers&uuml;chtig zu wachen, sollten sich die OLJB darauf zur&uuml;ckbesinnen,
was ihr eigentlicher <B>Daseinszweck</B> ist, n&auml;mlich der Jugendschutz - dies
scheint offenbar in den Hintergrund getreten zu sein.</P>

<hr width=50%>

<P><B>Quellen und Adressen:</B> </P>

<ul>
<li>Bundespr&uuml;fstelle f&uuml;r jugendgef&auml;hrdende Schriften,
<A HREF="http://www.bmfsfj.de/bpjs/">http://www.bmfsfj.de/bpjs/</A><br></li>
<li>Unterhaltungssoftware-Selbstkontrolle (USK),
<A HREF="http://www.usk.de">http://www.usk.de</A><br>
</li>
<li>Verband der Unterhaltungssoftware Deutschland (VUD),
<A HREF="http://www.vud.de">http://www.vud.de/</A><br>
</li>
<li>Entertainment Markt Nr. 8  vom 19.04.1999<br>
</li>
<li>Maniac, 4/99 - Interview mit der USK (S. 30)<br>
</li>
<li>MCV - Markt f&uuml;r Computer- und Videospiele vom 07.05.1999<br>
</li>
<li><A HREF="http://www.heise.de/">http://www.heise.de/</A><br>
</li>
<li><A HREF="http://www.gamesmaniac.com/german/editorial/articles/zensur/zensur.htm">GamesManiac</A><br>
</li>
</ul>
<hr width=90%>

<P>Beispielf&auml;lle zur FSK und BPjS gibt es unter:
<A HREF="http://come.to/zensur/">http://come.to/zensur/</A><br> 
Eine Liste der indizierten Computerspiele findet sich hier:
<A HREF="http://www.Cybercity.de/BpjS.html/ ">http://www.Cybercity.de/BpjS.html/</A>    </P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../alf/9906alf.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="web_adv.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


