<html>
<head>
  <title>Diverses</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="diverses4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="diverses6.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

5. Sicherheitsrisiko durch gef&auml;lschte datatypes.library

&raquo;Sicherheitsempfehlung f&uuml;r Amiga-Internet-Benutzer
 -------------------------------------------------

von Nordic Global Inc., 5.12.98, zur sofortigen Ver&ouml;ffentlichung

W&auml;hrend der ersten Dezemberwoche wurde in der &quot;Szene&quot; eine Liste mit
&uuml;ber 700 gestohlenen Namen, Passworten und Zugangsnamen von Internet-
Zugangs-Anbietern (Internet Service Providern = ISP) herumgereicht und
und an verschiedenen Pl&auml;tzen einschlie&szlig;lich dem Usenet zur Verf&uuml;gung
gestellt. Die meisten Ver&ouml;ffentlichungen enthielten nicht die Passworte,
aber sie SIND auf der originalen Liste vorhanden, d.h. die Liste
existiert WIRKLICH und stellt eine echte Bedrohung f&uuml;r die aufgelisteten
Benutzer dar.

Jeder, der diese Liste besitzt, kann mit Hilfe der Eintr&auml;ge in die
Internet-Zugangsberechtigung des jeweiligen Anwenders einbrechen, wenn
dieser Benutzer nicht inzwischen sein Passwort gewechselt hat. Mit
anderen Worten: Wenn SIE auf der Liste stehen, kann jeder, der die
vollst&auml;ndige Liste hat, &uuml;ber IHRE Zugangsberechtigung ins Internet gehen,
bis Sie ihr Passwort &auml;ndern, falls das noch nicht geschehen ist.

Einige der Eintr&auml;ge der Liste hat man sich mit &quot;normalen&quot; Mitteln besorgt,
d.h. durch Eindringen in ISP-Router oder durch Ausbeutung bekannter
Schw&auml;chen in Unix- oder NT-Systemen. Diese Dinge passieren st&auml;ndig und
sind schwer zu unterbinden.

Viele der Eintr&auml;ge in der Liste wurden jedoch durch einen anderen
Mechanismus erlangt: ein &quot;Trojaner&quot; (trojanisches Pferd = geheimer
Eindringling) wurde an Amiga-Anwender verteilt, der heimlich die
Anwendernamen und Passworte ausspionierte und sie an eine Internet-
Adresse sandte, wo diese Informationen von Software-Piraten gesammelt und
ausgewertet wurden.

Es kursierte eine Menge falscher und manchmal verleumderischer Ger&uuml;chte,
wie der geheime Mechanismus arbeitet und welches Programm die Ursache
war, bis die gemeinsame Anstrengung von Nordic Global Inc. und mehrerer
hilfreicher Anwender, die anonym bleiben m&ouml;chten, schlie&szlig;lich die genaue
Ursache f&uuml;r die Erlangung der Passworte herausfand:

Eine Gruppe von Piraten verbreitete eine gef&auml;lschte Version der
&quot;datatypes.library&quot; &uuml;ber das Aminet. Diese Version hat die Nummer 45.4
oder 45.5 (je nachdem, wie die Versionsnummer gepr&uuml;ft wird) und hat eine
Dateigr&ouml;&szlig;e von 32748 Bytes. Diese Library enth&auml;lt einen versteckten
Trojaner, welcher den Anwendernamen und das Passwort aus der Einstellungs-
Datei f&uuml;r den Internetzugang auf Ihrer Festplatte ausliest und sie mit
eMail an die Piraten-Gruppe sendet, wo sie ausgewertet und in eine
Datensammlung eingetragen wird.

Wenn Sie diese Version der &quot;datatypes.library&quot; installiert haben, wird
Ihnen dringend empfohlen sie zu l&ouml;schen und sie durch eine legitime,
sichere Version der datatypes.library zu ersetzen, z.B. durch eine der
folgenden:

- 39.11 (von der Workbench-Disk)
- 40.6  (von der Workbench-Disk)
- 45.3  (aus dem Aminet)
- 45.4  (aus dem Aminet)

Wenn Sie 45.4 installieren, stellen Sie sicher, dass die Dateigr&ouml;&szlig;e
27780 Bytes betr&auml;gt. Ist sie 32748 Bytes gro&szlig;, handelt es sich
tats&auml;chlich um die gef&auml;hrliche, gef&auml;lschte Version 45.5, die eine
falsche Versionsnummer meldet, und nicht um die &quot;echte&quot; Version 45.4.

Danach sollten Sie, um sicher zu gehen, Ihren Computer tats&auml;chlich am
Netzschalter ausschalten, 30 Sekunden abwarten und ihn dann wieder
einschalten.

Sobald das erledigt ist, loggen Sie Sich bei Ihrem Internet-Dienstleister
ein und &auml;ndern Sie das Passwort. Wenn Sie zuvor schon das Passwort
ge&auml;ndert hatten, ohne die gef&auml;lschte Library zu ersetzen, dann sollten
Sie Ihr Passwort jetzt nocheinmal &auml;ndern, da die Informationen f&uuml;r
Ihren Zugang inzwischen schon wieder verraten worden sein k&ouml;nnen.

Bis jetzt ist es noch nicht sicher bekannt, wer der Programmierer der
gef&auml;lschten Datei und wer der &quot;Sammler&quot; der gestohlenen Zugangsdaten
ist, aber Untersuchungen sind im Gange. Es bestehen allerdings bisher
nicht best&auml;tigte Hinweise (einschlie&szlig;lich Zeugenausagen von Informanten),
dass die unr&uuml;hmlich bekannte Piratengruppe &quot;Digital Corruption&quot; daf&uuml;r
verantwortlich zu machen ist.

Wenn es sich als zutreffend herausstellen sollte, w&auml;re das ein neuer Beweis
daf&uuml;r, das Software, die von Piratenorganisationen oder in Zusammenarbeit
mit solchen geschrieben oder verbreitet wird, kein Vertrauen verdient und
dass man dabei mit versteckten sch&auml;dlichen Nebenwirkungen rechnen muss.


Wenn Sie Sich nun wundern, warum Nordic Global Inc. diese Mitteilung
verbreitet: Die originale Passwortliste, die verteilt wurde, enth&auml;lt
einen Kommentare in unfl&auml;tiger Ausdrucksweise, dass diese Passworte
durch eine angebliche &quot;Hintert&uuml;r in Miami&quot; erlangt wurden.

Bitte lassen Sie Sich dadurch nicht beirren. Diese Aussage ist eine
ganz klare L&uuml;ge, eine gemeine Anschuldigung, die das Ansehen von
Miami und Nordic Global Inc. beschmutzen soll, die jeglicher Grundlage
entbehrt. Amiga-Piratengruppen, besonders Digital Corruption, haben
seit langem versucht, Nordic Global Inc. wegen ihres entschiedenen
offenen Eintretens gegen Piraterie in dieser Weise zu beschuldigen.

Miami hat keine &quot;Hintert&uuml;ren&quot;, es wurde nicht benutzt und war dazu auch
garnicht in der Lage, um die Liste zusammenzustellen oder um irgend
welche Informationen zur Verf&uuml;gung zu stellen, die dort erschienen sind.
Trotzdem haben viele Benutzer und leider auch einige Entwickler und
H&auml;ndler das falsche Ger&uuml;cht weitergegeben, Miami sei irgendwie
&quot;gef&auml;hrlich&quot;. Das trifft offensichtlich &uuml;berhaupt nicht zu.

Wir glaubten, es sei notwendig, dass wir versuchen m&uuml;ssten, die
Wahrheit &uuml;ber das Entstehen der Liste herauszufinden, nicht nur, um
die Sicherheit von Miami zu dokumentieren, sondern auch, um den
Amiga-Anwendern die Informationen zu bieten, die sie brauchen, um
auf diese Bedrohung reagieren zu k&ouml;nnen und um weiteren Schaden zu
verh&uuml;ten.

Weitere Informationen &uuml;ber diesen Angriff finden Sie auf unserer
Website &quot;<a href="http://www.nordicglobal.com",">www.nordicglobal.com",</a> dort speziell im Abschnitt &quot;News&quot;.


Holger Kruse, Nordic Global Inc.
<a href="mailto:kruse@nordicglobal.com">kruse@nordicglobal.com</a>&laquo;

Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="diverses4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="diverses6.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
