<html>
<head>
  <title>Gewinnspiel</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="gewinnspiel1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="gewinnspiel3.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

2. Vorstellung der neuen Preise

Und jetzt gibt es f&uuml;r alle eine neue Chance auf einen Preis:


Andreas K&uuml;ssner vom Wildfire-Team hat die Animationssoftware Wildfire7 f&uuml;r 
das Gewinnspiel zur Verf&uuml;gung gestellt (ein ausf&uuml;hrlicher Test folgt in der 
n&auml;chsten Ausgabe):

&raquo;Wildfire ist das Spezial Effekt System f&uuml;r Animationen, Bildsequenzen und
Bilder. Es gibt sehr viele neue Programmeigenschaften - eingige davon sind 
wirklich einzigartig - aber das wichtigste an dieser Stelle ist, da&szlig; 
Wildfire7PPC sehr einfach zu verstehen und v&ouml;llig benutzerfreundlich ist.

Es ist nicht einfach ein altes Programm mit einer neuen Oberfl&auml;che, nein, 
wir haben fast alle Programmteile komplett neu geschrieben.

Einige der Haupteigenschaften sind:
 *leicht zu bedienende MUI-Oberfl&auml;che mit vielen Vorschaubildern
  und weitreichenden Drag`n`Drop Operationen
 *Ausgereifter Konverter (MPEG/QT/AVI/YAFA/IFF/Bildsequenzen)
 *Lineares und Nichtlineares Effekt System
 *Echte 3D-Effekte (einschlie&szlig;lich Lichtquellen, Phong-Shading,
  Transparenz, Alpha-Rendering)
 *mehr als 120 PlugIns
 *direkte PPC und CyberGraphX Unterst&uuml;tzung

Es ist noch m&auml;chtiger, als es Wildfire5 jemals war.


Werfen Sie einen Blick auf die Demoversion (Aminet):

Wildfire7 Demo Dateien:
----------------------

biz/demo/Wildfire7_Demo.lha   ... Haupt Dateien der Demoversion

biz/demo/Wildfire7_PPC.lha    ... zus&auml;tzliche PPC Dateien f&uuml;r PPC+68K,
                                  Haupt Dateien werden ben&ouml;tigt!

biz/demo/Wildfire7_3D.lha     ... zus&auml;tzliche 3D Effekte,
                                  Haupt Dateien werden ben&ouml;tigt!

biz/demo/Wildfire7_3DF.lha    ... zus&auml;tzlicher 3D Text Effekt,
                                  Haupt Dateien werden ben&ouml;tigt!


Wildfire-Unterst&uuml;tzung: <a href="mailto:eksec@eure.de">eksec@eure.de</a>        (Andreas K&uuml;ssner)

Wildfire-Homepage     : <a href="http://www.oberland.com/amiga/wildfire/">http://www.oberland.com/amiga/wildfire/</a>


Wildfire Vertrieb:      Oberland Computer
                        In der Schneithohl 5
                        61476 Kronberg
                        Germany

                        Tel. ++49-(0)6173-6080

                        email: <a href="mailto:info@oberland.com">info@oberland.com</a>

Wir hoffen, Ihnen wird das Arbeiten mit Wildfire7PPC gefallen!&laquo;


Frank Weber hat sein Programm AFiloFaxPro f&uuml;r das Gewinnspiel zur Verf&uuml;gung 
gestellt:

&raquo;AFiloFaxPro managet Ihr t&auml;gliches Leben. Dazu bietet es eine umfangreiche 
Terminplanerfunktion und dar&uuml;ber hinaus Features wie einen elektronischen 
Notizblock oder Statistikfunktionen, die u.a. die t&auml;gliche Computerlaufzeit 
protokollieren. (Unterst&uuml;tzt MUI)&laquo;

Eine Demo-Version des Programms ist im Aminet verf&uuml;gbar.

Der Autor von AFiloFaxPro ist unter folgender Adresse erreichbar:

Frank Weber
Schlizstra&szlig;e 53
74076 Heilbronn
Deutschland 

E-Mail: <a href="mailto:fweber@amigaworld.com">fweber@amigaworld.com</a>


Peter Elzner hat sein Programm Diamond Caves II f&uuml;r das Gewinnspiel zur 
Verf&uuml;gung gestellt:

&raquo;Diamond Caves II ist eine Weiterentwicklung des klassischen Emerald Mine
und Boulder Dash. In einer H&ouml;hle m&uuml;ssen alle Diamanten eingesammelt
werden, zahlreiche Objekte wie T&uuml;ren, Schutzschilder, Dynamitstangen und
Bomben sowie verschiedene Gegner sorgen f&uuml;r teilweise verzwickte Level.
Enthalten ist ein Zwei-Spieler-Modus (gleichzeitig!) sowie ein
komfortabler Leveleditor.
Voraussetzungen: Amiga mit Kick2.0, mind. 1MB Chipmem und 1MB Fastmem,
                            schneller Prozessor empfohlen, MUI wird f&uuml;r den 
Editor ben&ouml;tigt
Unregistrierte Version: 50 Level, Editor eingeschr&auml;nkt
Registrierte Version: 40 DM (umgerechnet etwa 20,50 Euro; Anm. d. Red.)&laquo;

Eine Demo-Version kann von <a href="http://www.diamond-pro.com">http://www.diamond-pro.com</a> heruntergeladen 
werden.

Der Autor ist unter folgender Adresse erreichbar:

Peter Elzner
Grudene 6a
58644 Iserlohn
                  
E-Mail: <a href="mailto:order@diamond-pro.com">order@diamond-pro.com</a> (Bestellungen) bzw.
        <a href="mailto:peter.elzner@diamond-pro.com">peter.elzner@diamond-pro.com</a> (Fragen)


Andreas Etzrodt hat sein Programm HomeCINEMA f&uuml;r das Gewinnspiel zur
Verf&uuml;gung gestellt:

&raquo;HomeCINEMA ist eine Video-Datenbank, die endlich einmal wirklich
EINFACH zu bedienen ist. Sie ist nicht &uuml;berladen mit Funktionen,
bietet daf&uuml;r aber alle wesentlichen Funktionen, die man sich
verspricht. Eine Demoversion ist unter: <a href="http://sharksoft.notrix.de">http://sharksoft.notrix.de</a>
zu finden.&laquo;


Des Weiteren hat Thomas Hasemann das 3D-Actionspiel Nemac IV f&uuml;r das 
Gewinnspiel zur Verf&uuml;gung gestellt.


Vielen Dank an alle Preisstifter!

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="gewinnspiel1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="gewinnspiel3.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
