<html>
<head>
  <title>Spieleteil</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="spiele5.html"><img src="prev.gif" alt="PREV" border=0></a><a href="spiele7.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

6. Review: OloFight
-------------------

OloFight vom Newcomer The Real Ologram kommt auf 10 Disketten in nett 
gestalteter Schachtel daher. Man bekommt dazu noch viele Extra Schmankerl 
wie Poster, Aufkleber usw. Das Handbuch ist in deutsch. Das Spiel muss 
zuerst auf Festplatte installiert werden, wo es ca. 10 Megabyte freien 
Speicher ben&ouml;tigt. Die Installation geht gewohnt fehlerfrei mit dem 
Commodore Installer von statten. OloFight ben&ouml;tigt mindestens einen A1200 
oder A4000, 0.7MB Chip Ram und 1,8MB Fast Ram sowie 10MB freier Platz auf 
der Festplatte. Ein Patch f&uuml;r Grafikkarten soll &uuml;brigens bald erscheinen.

Die Story handelt von den letzten Nachkommen der Menschheit, die auf acht 
k&uuml;nstlichen Planeten verteilt, leben. Weil die Erde durch eine 
Sternenkollision vernichtet wurde, zogen sie auf den Planeten Kobaia. Doch 
durch schlimme Kriege wurde dieser Planet in eine regelrechte W&uuml;ste 
verwandelt, so konnten sie ihn nur verlassen und begannen auf ihren selbst 
erbauten Planeten zu siedeln. Doch dann entdeckt Thitan, der Ex-F&uuml;hrer des 
Planet Karn, gewaltige Energie, die von dem Kern Kobaias erzeugt wird. 
Mutige Krieger von den acht Planeten brechen auf, um Thitan aufzuhalten, 
bevor er seinen Energiegenerator gebaut hat. Leider verb&uuml;nden sich die acht 
Krieger nicht gegen Thitan, sondern k&auml;mpfen auf Faust, und immer wenn sie 
zusammentreffen, gibt es Krawall. Dies passiert nun im Spiel.

Nach dem Start muss man erstmal seine Seriennummer sowie seinen Namen 
angeben. Au&szlig;erdem muss eine Handbuchabfrage beantwortet werden. Danach 
werden einem die acht verschiedenen Rassen in kleinen Animationen 
vorgestellt, wie sie auf ihrem Planeten leben. Danach geht es ins 
Hauptmen&uuml;. Insgesamt gibt es 5 verschiedenen Spielmodi. Im Story Mode muss 
man einen K&auml;mpfer zum Sieg f&uuml;hren und alle anderen vernichten. Im Survival 
Mode kann man testen wieviel vom Computer gesteuerte Feinde man besiegen 
kann, bis die vitale Energie ausgeht. Besiegt man einen Feind, bekommt man 
als Preis mehr vitale Energie. Im Time Attack Mode ist der Kampf 
zeitbedingt. W&auml;hlt man den Single Battle Mode kann man gegen den Computer 
in einem Einzelkampf spielen. Im VS Battle Mode kann man gegen den gleiche 
Charakter k&auml;mpfen. Im Records Men&uuml; kann man die Highscores anzeigen lassen 
oder auch per Internet an den Webserver von The Real Ologram 
(<a href="http://www.ologram.com">http://www.ologram.com</a>) schicken. Dort kann man dann die Ranglisten 
abrufen. Au&szlig;erdem gibt es verschiedene Optionen wie Autospeichern, Musik, 
SoundFX, die das Spiel angenehmer machen.

Nun zum Spiel: OloFight spielt sich relativ gut, allerdings ist die 
Steuerung etwas gew&ouml;hnungsbed&uuml;rftig. Bevor man in den Story Modus geht, 
sollte man erstmal im VS- oder Single Battle Modus ein bisschen 
herumexperimentieren, da durch die sehr intelligente Kollisionsabfrage man 
schon gezielt treffen muss, um den Gegner zu verwunden. Hat man sich 
einigerma&szlig;en in die Steuerung eingearbeitet, und beherrscht die Special 
Moves, so kann man in den Story Mode wechseln. Es f&auml;llt auf, dass der 
Computer schon in fr&uuml;hen Runden, sehr stark agiert. Dies kann man nur mit 
gezielten Schl&auml;gen und ausgekl&uuml;gelten Special Moves lindern. Leider musste 
ich feststellen, dass es w&auml;hrend des Spiels &ouml;fters mal kurze Ruckeleinlagen 
gab, die bei versprochenen 25fps nicht auftreten sollten.

<a href="olofight1.png">Screenshot</a> (ab OS 3.0; PNG-Datatype muss installiert sein)

<a href="olofight2.png">Screenshot</a> (ab OS 3.0; PNG-Datatype muss installiert sein)

<a href="olofight3.png">Screenshot</a> (ab OS 3.0; PNG-Datatype muss installiert sein)

Fazit: Die Grafik ist durchaus gelungen. Gerenderte K&auml;mpfer, mehr als 3000 
Farben, realistische Schatten runden sie ab. Die Musik ist relativ 
unterhaltsam und passt meistens zum Spielgeschehen. SoundFX k&ouml;nnen sich 
auch h&ouml;ren lassen. Die Aufmachung ist gut gelungen, besonders die vielen 
extra Beilagen fallen hier ins Gewicht genauso wie die Verpackung. Die 
Technik ist nicht ganz so &uuml;berzeugend, allerdings auch durchaus in der 
Mittelklasse. Der Spielspa&szlig; wird haupts&auml;chlich beeintr&auml;chtigt durch die 
Ruckeleinlagen und etwas zu starke Computergegner. Auch w&auml;re ein 2 Spieler 
Modus nicht schlecht gewesen.

+-------------------------------------------------------------------------+
|  Name:          Olo Fight                                               |
|  Hersteller:    The Real Ologram di Fabrizio Stoduto, Via Epitaffio 100 |
|                 P.co Nuovo Mondo, 80014 Guigliano (Na),                 |
|                 Fax: +39 (0)81 5514711, E-Mail: <a href="mailto:ologram@ologram.com">ologram@ologram.com</a>     |
|  Preis:         59 DM (umgerechnet etwa 30,30 Euro)                     |
|  Datentr&auml;ger:   10 Disketten oder CD-ROM                                |
|  Genre:         Beat `em` Up           | Spieler: 1                     |
|  Sprache:       englisch               | Anleitung: deutsch, englisch,..|
|  System:        mind. AGA, 0,7 MB Chip RAM &amp; 1,8 MB Fast RAM, Festplatte|
|                 oder CD-ROM-Laufwerk                                    |
|  Fazit:         nettes Kampfspiel mit ausgezeichneter Grafik allerdings |
|                 mit einigen technischen M&auml;ngeln                         |
|  Wertung:                                                               |
|                             Grafik:     8/10                            |
|                             Sound:      7/10                            |
|                             Handhabung: 8/10                            |
|                             Spielspa&szlig;:  6/10                            |
|                             GESAMT:      68%                            |
+-------------------------------------------------------------------------+

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="spiele5.html"><img src="prev.gif" alt="PREV" border=0></a><a href="spiele7.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
