<html>
<head>
  <title>Vorwort</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="main.html"><img src="prev.gif" alt="PREV" border=0></a><a href="intern1.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

Vorwort
-------

Willkommen zur ersten Ausgabe von AMIGA aktuell im neuen Jahr.

Diesmal m&uuml;sst ihr euch mit einer recht schlanken Ausgabe begn&uuml;gen. Es sieht 
so aus, als ob nach dem Schlagzeilen-Monat November die Firmen, Entwickler 
und Anwender nun erst einmal wieder neue Kr&auml;fte mobilisieren m&uuml;ssen... 
M&ouml;glicherweise war das ja die Ruhe vor einem neuen Sturm, vielleicht, und 
das ist wohl wahrscheinlicher, lag's aber auch nur am Weihnachts-Monat 
Dezember.

Zumindest ein Thema hat im Dezember aber sehr wohl eine wichtige Rolle 
gespielt: 3D! Gleich drei wichtige Ereignisse standen ins Haus:

* das Erscheinen der BVisionPPC, einer Grafikkarte mit dem 3D-Chip          
  Permedia2

* die Ank&uuml;ndigung Village Tronics, in K&uuml;rze eine 3DFX-Erweiterung f&uuml;r die   
  Grafikkarte Picasso IV auf den Markt bringen zu wollen

und nicht zuletzt

* die Ver&ouml;ffentlichung von Warp3D, einem Treibersystem eben f&uuml;r 3D-         
  Hardware. Bereits zu diesem Zeitpunkt haben eine Reihe von                
  Spieleentwicklern ihre Unterst&uuml;tzung angek&uuml;ndigt, was den Durchbruch von  
  3D-Hardware endlich auch beim AMIGA bedeuten d&uuml;rfte.


Die Interna der heutigen Ausgabe:

* Es ist mal wieder an der Zeit, zu appellieren, euch an AMIGA aktuell zu   
  beteiligen. Wir bem&uuml;hen uns, jeden Monat ein m&ouml;glichst gutes Magazin      
  abzuliefern, aber wenn jeder von euch, der etwas dazu beitragen k&ouml;nnte,   
  dies auch tun w&uuml;rde, dann w&auml;ren Umfang und Qualit&auml;t von AMIGA aktuell mit  
  Sicherheit noch wesentlich h&ouml;her. Aufgabenbereiche gibt es zur Gen&uuml;ge.
  Noch nicht zufriedenstellend ist beispielsweise die Anzahl der Tests      
  kommerzieller Produkte. Monat f&uuml;r Monat erscheinen Anwendungen und neue   
  Hardware-Produkte, die nachweislich auch von dem einen oder anderen       
  AMIGA-aktuell-Leser gekauft werden. Ist es denn zuviel verlangt, euch zu  
  bitten, einen Testbericht zu schreiben? Ihr tut damit ja nicht nur uns    
  und vor allem den anderen Lesern einen Gefallen, sondern k&ouml;nnt euch in    
  einem der meist gelesenen Amiga-News-Magazine wiederfinden.

* Ralf Kaiser w&uuml;nscht sich einen Test &quot;Linux f&uuml;r Amiga&quot;. Wer hat Interesse,  
  das zu &uuml;bernehmen? Mittlerweile hat zum Beispiel die Schatztruhe GmbH     
  eine neue Linux-CD herausgebracht.


Zu den regelm&auml;&szlig;igen Aufrufen:

* Wir suchen jemanden, der eine eigenst&auml;ndige AMIGA-aktuell-Rubrik f&uuml;hren   
  will, in der &uuml;ber Software-Updates informiert wird. Monat f&uuml;r Monat       
  erscheinen bekanntlich unz&auml;hlige FD- und kommerzielle AMIGA-Programme in  
  neuen Versionen. Ziel dieser neuen Rubrik ist es, die wichtigsten         
  Verbesserungen von neuen Software-Updates aufzulisten.
  Wer hat Interesse, sich darum zu k&uuml;mmern?
    
* Weiterhin gesucht werden Tester von frei kopierbarer Software. Jeder, der  
  sich f&uuml;r diese Aufgabe bereit erkl&auml;rt, wird in eine spezielle             
  Verteilerliste eingetragen und erh&auml;lt dann in unregelm&auml;&szlig;igen Abst&auml;nden    
  Test-Vorschl&auml;ge, ist aber zu nichts verpflichtet.
  Nat&uuml;rlich freuen wir uns aber genauso &uuml;ber Tests kommerzieller            
  Produkte und nicht &uuml;ber die Verteilerliste vorgeschlagener FD-Software.
  Schreibt an <a href="mailto:aakt@gmx.de">aakt@gmx.de</a> .


Viel Spa&szlig; jetzt bei dieser Ausgabe,

Euer

Carsten Schr&ouml;der

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="main.html"><img src="prev.gif" alt="PREV" border=0></a><a href="intern1.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
