<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Editorial der NoCover</TITLE>
  </HEAD>

  <BODY background="int_bg.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD width="70">&nbsp;</TD>

        <TD>
          <BR>
          <CENTER>
          <IMG src="edito.gif" width="275" height="85" alt="Titelbild"><BR>
          <H1><B>zur NoCover #108 (01.03.2003)</B></H1>
          </CENTER>

          <P>Liebe Leser(Innen) !</P>

          <P>Mittlerweile ist es schon regelrecht peinlich, gleich zu Beginn immer
          sagen zu m&uuml;ssen, auch in diesem Monat sind sehr wenige - besser und
          zutreffender - zu wenige Beitr&auml;gen eingegangen. NoCoverleser und
          -schreiber waren schon immer ein V&ouml;lkchen f&uuml;r sich und mit
          anderen Interessengruppen in "keinsterweise" vergleichbar. Jeder wollte
          alles lesen, jeder wusste alles besser, aber die Wenigsten wollten dies
          auch mit guten und stichhaltigen Argumenten in Bits und Bytes umsetzen.
          K&ouml;nnt ihr reinen Leser euch &uuml;berhaupt vorstellen, welcher Frust
          sich bei der verbliebenen kleinen Schar der Schreiber gerade ausbreitet,
          wenn &uuml;berhaupt keine Reaktionen zu ersehen sind? Ich pers&ouml;nlich
          bin ein gro&szlig;er Optimist und mich haut so schnell nichts um, aber wenn
          ich das vor sich "Hinged&uuml;mpele" so betrachte, vermute ich sehr stark,
          kann auch dies irgendwann meinen Enthusiasmus ins Negative ver&auml;ndern
          und die NoCover war gewesen.</P>

          <P>Damit mancher Leser der ersten Stunde sich mal wieder so richtig in
          Nostalgie w&auml;lzen kann, habe ich ein Remake der NoCover-01 als HTML
          gemacht. Aber alle, die die alten MagneticPages Ausgaben nicht kennen,
          sollen ruhig erleben, mit welcher Intensit&auml;t und mit welcher Freude
          seinerzeit sich die "Amiganer" um ein vern&uuml;nftiges Magazin bem&uuml;ht
          hatten. Hier k&ouml;nnt ihr &uuml;brigens sehen, wieviele User sich damals
          aktiv beteiligt hatten. In diesem Zusammenhang muss ich sagen, Rainer
          Wrieden hat auch ein Remake erstellt. Rainer hat aber eine andere Art
          gew&auml;hlt: er hat alle MagneticPages Seiten als einzelne Images erstellt
          und html-f&auml;hig zusammengestellt, damit auch auf einem PC die alte
          NoCover im &raquo;eins zu eins&laquo;-Outfit zu lesen ist. Da die gesamte
          NC-01 aus Pictures besteht, ist der Umfang als Mailanhang zu m&auml;chtig.
          Wer sie aber sein eigen nennen m&ouml;chte, wird sie auf Anfrage bei Rainer
          Wrieden (Mailanschrift siehe Mitglieder) bestimmt sofort "zugemailt"
          bekommen.</P>

          <P>Wer nun meine Ausfertigung der NC-01 gelesen hat, kann wieder zur NC-108
          zur&uuml;ckkehren, wenn er auf dem Inhaltsverzeichnis das Leerfeld zwischen
          den unteren beiden Schaltfl&auml;chen anklickt oder einfach im Schwarzen
          unterhalb der gelben Schaltfl&auml;chen seinen Klick setzt.</P>

          <P>Im vergangenen Monat habe ich erfahren, dass die NoCover auch von
          Blinden gelesen wird und ich hoffe, demn&auml;chst sogar detaillierte
          Berichte zu bekommen, wie dies bewerkstelligt wird. Gleichzeitig hat man
          mir versprochen, auch zu sagen, was wir tun k&ouml;nnen, damit die Texte
          besser und genauer in Blindenschrift dargestellt werden.</P>

          <P>Nun bitte ich Leser, die Erfahrung mit Linux auf dem Amiga haben und auf
          spezifizierte Fragen aussagekr&auml;ftige Antworten geben k&ouml;nnen, mich
          kurz anzumailen, damit ich mich mit ihnen in Verbindung setzten kann.</P>

          <P>Nun viel Spa&szlig; mit der neuen und der alten NoCover<BR>
          Wolf.<BR>
          <B>(wolf@wozim.de)</B></P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

