<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Interview Nr 1</TITLE>
  </HEAD>

  <BODY background="nc_bg2.jpg" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <CENTER>
            <P><FONT color="#000080" size="7"><B>Amiga Arena Interview</B></FONT></P>

            <TABLE width="60%" cellpadding="0" cellspacing="0" summary="">
              <TR>
                <TD valign="top">Entwickler:</TD>             
                <TD><B>Michael Lanser</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Software:</TD>               
                <TD>Realms of Power</TD>
              </TR>

              <TR>
                <TD valign="top">Homepage:</TD>               
                <TD>www.lanser-online.de.vu</TD>
              </TR>

              <TR>
                <TD valign="top">Email:</TD>                  
                <TD>M.Lanser@t-online.de</TD>
              </TR>
            </TABLE>
          </CENTER>

          <P><FONT color="#006000"><B>Hallo Michael, kannst Du bitte etwas &uuml;ber
          Dich und Deinem Amiga Werdegang erz&auml;hlen?</B></FONT><BR>

          Ich bin 25, komme aus der Gegend von K&ouml;ln und arbeite zur Zeit als
          Programmierer bei einer Versicherung. Einen Amiga besitze ich nun schon
          seit fast 14 Jahren. Angefangen mit dem 500er &uuml;ber den 2000er bis zu
          meinem heutigen 1200er mit PPC und BVision.</P>

          <P><FONT color="#006000"><B>Du hast Dir mit "Realms of Power" vorgenommen
          einen neuen Civilization Clone zu entwickeln, wie kamst Du auf die Idee und
          seit wann entwicklest Du an "Realms of Power"?</B></FONT><BR>

          Den Wunsch ein Spiel zu programmieren habe ich schon seit Jahren. Aber erst
          durch meine Umschulung zum Programmierer vor zwei Jahre bekam ich auch
          gen&uuml;gend Einblicke in die Programmierung um solch ein Projekt auch
          durchzusetzen. Als ich mir dann &uuml;berlegte,von welcher Art das Spiel
          sein soll, blieb mein Gedanke schnell bei Civilization h&auml;ngen. An
          Realms of Power entwickle ich nun schon etwa 5 Monate. Den Anfang bildete
          nat&uuml;rlich nur die Brainstorming Phase. Ich hab alles m&ouml;gliche
          aufgeschrieben, an was ich denken mu&szlig; und was alles rein soll in das
          Spiel.</P>

          <P><FONT color="#006000"><B>Entwickelst Du zur Zeit alleine an "Realms of
          Power" oder gibt es noch weitere Entwickler die an dem Spiel
          arbeiten?</B></FONT><BR>

          Ich programmiere alleine und habe zur Zeit 2 Grafiker die f&uuml;r mich
          pixeln.</P>

          <P><FONT color="#006000"><B>In welchem Entwicklungsstadium befindet sich
          zur Zeit "Realms of Power" und was denkst Du, wird es eine erste spielbare
          Demoversion geben?</B></FONT><BR>

          Das Spiel befindet sich in einer fr&uuml;hen Alpha Version. Man kann zur
          Zeit nichts anderes machen als &uuml;ber ein Men&uuml; Parameter f&uuml;r
          die neue Welt einzugeben und danach &uuml;ber diese zu scrollen. Eine erste
          Demoversion wird es wohl fr&uuml;hestens gegen Ende des Jahres geben.</P>

          <P><FONT color="#006000"><B>Was fasziniert Dich an dem Orginal Civilization
          bzw. worin soll sich "Realms of Power" unterscheiden oder anders
          sein?</B></FONT><BR>

          Die M&ouml;glichkeit ein ganzes Volk zu beherrschen und aufzubauen
          fasziniert mich einfach. St&auml;dte zu gr&uuml;nden Land zu erobern und
          eine Strategie zu&nbsp;entwickeln, den Gegner fertig zu machen ;-) Nun, da
          Civilization auf dem PC nun schon mehrere Nachfolger hatte gibt es
          nat&uuml;rlich einiges aufzuholen. Aber ich habe mir vorgenommen auch etwas
          Action ins Spiel zu bringen.</P>

          <P><FONT color="#006000"><B>Mit FreeCIV (Amiga Version) gibt es ja schon
          einen sehr guten Civilization Clone f&uuml;r Spieler die gerne &uuml;bers
          Netzt spielen. Wird "Realms of Power" auch Netzwerkf&auml;hig sein oder
          kompatible zu den Tiles sein?</B></FONT><BR>

          Netzwerkf&auml;higkeit ist vorerst nicht eingeplant. Aber ich werde es auf
          die Liste der "vielleicht" einzubauenden Features setzen. Die Tiles wird
          man sp&auml;ter gegen eigene Austauschen k&ouml;nnen. Sie werden allerdings
          ein eigenes Format besitzen.</P>

          <P><FONT color="#006000"><B>Allerdings finde ich die 1 Spieler Variante
          bez. Konfiguration unter FreeCIV nicht ganz einfach bez.
          Anwenderfreundlich, wird "Realms of Power" einfacher zu konfigurieren
          sein?</B></FONT><BR>

          Dies ist ein Punkt dem ich besonders gro&szlig;en Wert beimesse. Es wird
          auf jeden Fall intuitiv zu bedienen sein. Daf&uuml;r werden ich und die
          Betatester schon sorgen.</P>

          <P><FONT color="#006000"><B>Welche Ideen oder Features m&ouml;chtest Du
          f&uuml;r "Realms of Power" umsetzten?</B></FONT><BR>

          Realms of Power soll Civilization 3 m&ouml;glichst nahe kommen. Die
          verschiedenen Resourcen, eine Unmenge an Einheiten, Bildung von Armeen
          sowie der Handel, all das wird mit reingepackt. Dazu noch eine
          Actionsequenz die etwas mit dem Kampf zwischen den Einheiten zu tun
          hat.</P>

          <P><FONT color="#006000"><B>Wird es auch Einfl&uuml;sse von anderen Spielen
          geben z.B. von Colonization, wenn ja welche?</B></FONT><BR>

          Du meinst z.B. die explizite Herstellung von verschiedenen Waren (Zigarren,
          Rum, M&auml;ntel)? Ich kann mir zwar vorstellen,wie man das im Spiel
          verwenden k&ouml;nnte, aber nein, das w&uuml;rde wohl etwas den Rahmen
          sprengen.</P>

          <P><FONT color="#006000"><B>Ab welche Systemkonfiguration wird "Realms of
          Power" spielbar sein und welches OS hast Du vor zu
          unterst&uuml;zen?</B></FONT><BR>

          Ich selbst teste es auf einem 68040/25 Amiga. Aber auch auf langsameren
          Amigas wird es wohl spielbar sein. Auf jeden Fall ist eine Grafikkarte
          notwendig, da mein Spiel auf einem 800x600 Screen mit 15/16bit l&auml;uft.
          Picasso96 und CGX werden unterst&uuml;tzt. Ein PPC wird nicht notwendig
          sein.</P>

          <P><FONT color="#006000"><B>Handelt es sich um eine Free/Shareware
          Entwicklung oder verfolgst Du kommerzielle Ziele?</B></FONT><BR>

          Das Spiel soll auf jeden Fall kommerziell werden.</P>

          <P><FONT color="#006000"><B>Auf welchem System entwickelst Du "Realms of
          Power" und welche Software verwendest Du dazu?</B></FONT><BR>

          Ich entwickle hautps&auml;chlich auf meinem 1200er zuhause. Dieser ist mit
          einem 68040/25 und einem PPC603e/160 ausgestattet. Dazu noch eine BVision,
          82 MB Ram, Festplatte, Brenner, T-DSL halt alles, was man so braucht.<BR>
          Au&szlig;erdem benutze ich noch hin und wieder einen P-II/400 mit WinNT4
          und WinUAE... Zum Programmieren verwende ich das StormCV3 Paket, PPaint,
          PerfectPaint und die beiden kleinen Tools GfxCon und AGA2IFF.</P>

          <P><FONT color="#006000"><B>Welche Motivation befl&uuml;gelt Dich um solch
          ein Spiel zu entwickeln, bzw. glaubst Du, es gibt noch ausreichend Spieler
          am Amiga?</B></FONT><BR>

          Haupts&auml;chlich m&ouml;chte ich selber meinen Beitrag zum Erhalt des
          Amigas leisten. Dazu kommt noch der Ehrgeiz etwas auf die Beine zu stellen,
          was andere Leute toll finden, kaufen und benutzen. Ob es genug Spieler
          gibt, wird sich zeigen.<BR>

          Im Amiga Markt darf man schon lange nicht mehr an die gro&szlig;e Kohle
          denken.</P>

          <P><FONT color="#006000"><B>Welche Spiele bevorzugt Du noch heute am
          Amiga?</B></FONT><BR>

          Das letze Spiel was ich gekauft habe war "Descent: Freespace" - einfach
          super das Game. Earth2140 und Wipeout2097 sind ebenfalls meine
          Dauerbrenner...</P>

          <P><FONT color="#006000"><B>Glaubst Du an ein Comeback vom
          Amiga?</B></FONT><BR>

          Ich w&uuml;nsche es mir. Aber wahrscheinlicher ist wohl ein kleiner und
          hoffentlich stabiler Markt der &uuml;berlebensf&auml;hig und ausbaubar
          ist.</P>

          <P><FONT color="#006000"><B>Deine letzten Worte an die
          Leser?</B></FONT><BR>

          Anstatt so manchen verbliebenen Entwickler zu beschimpfen und seine
          Software schlecht zu machen, solltet Ihr Eure Energien lieber selber in ein
          Projekt stecken. &Uuml;berall werden noch Musiker, Grafiker und
          Programmierer gebraucht. Ich ben&ouml;tige auch noch ein wenig Hilfe. Wer
          also Lust und Zeit hat (bei einem Hobby Projekt gehts nicht um 10 Stunden
          am Tag) der kann sich gerne bei mir melden!</P>

          <P align="center">-- &copy; Amiga Arena 02/2003 --</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

