<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="Homesite">
<TITLE>Amiga 1986-1992</TITLE>
</HEAD>

<BODY background="nc_bg2.jpg" text="#000080">
<table width="100%" cellpadding="10" summary="">
<TR align="CENTER">
<TD>
<H2><FONT face="" color="#008000">Amiga 1986 - 1992</FONT></H2>
</TD>
</TR>

<TR>
<TD><p title="" align="JUSTIFY"><b><font face="" color="#0000FF">
Nach dreij&auml;hriger Planungsphase lie&szlig; Commodore am 23. Juli 1985 in New York
die Katze aus dem Sack. Vorgestellt wurde eine Supermaschine, die es in
sich hatte: Der Commodore-Amiga-Personalcomputer.</font></b></p>

<p title="" align="JUSTIFY"> Der Amiga hat eine beispielhafte
Computerkarriere hinter sich. &Uuml;ber vier Millionen Amigas wurden inzwischen
verkauft, neue Systeme sollen die Konkurrenzf&auml;higkeit der Amiga-Reihe in
der Zukunft sichern. Grund genug, einen nostalgischen Blick zur&uuml;ckzuwerfen
und die Spiele-Highlights der vergangenen sieben Amiga-Jahre zu beleuchten.
Wir haben uns jedes Jahr einzeln vorgenommen und pr&auml;sentieren auf den
folgenden Seiten Hoch- und Tiefpunkte der Amiga-Laufbahn. </p>
<table width="100%">
<tr>
<td><a href="#1986">1986</a></td>
<td><a href="#1987">1987</a></td>
<td><a href="#1988">1988</a></td>
<td><a href="#1989">1989</a></td>
<td><a href="#1990">1990</a></td>
<td><a href="#1991">1991</a></td>
<td><a href="#1992">1992</a></td>
<td><a href="#Resume">Res&uuml;me</a></td>
</tr>
</table>


<hr>
<a name="1986"></a>
<h3><font face="" color="#008000">1986</font></h3>
<p title="" align="JUSTIFY">Der Amiga ist die Computerattraktion des
Jahres. Als ein Exemplar des Wundercomputers in der Testredaktion von HAPPY
COMPUTER eintrifft, ist das Ger&auml;t st&auml;ndig von Schaulustigen umlagert. Die
technischen Daten sind revolution&auml;r: 4096 Farben, 640 mal 400 Pixel
Aufl&ouml;sung, vier Stereokan&auml;le und Multitasking. Trotzdem wird Commodore der
Computer anfangs nicht aus der Hand gerissen; rund 6000 Mark kostet der
Spa&szlig; als Komplettpaket. So halten sich auch die Spieleneuheiten im ersten
Amiga-Jahr in Grenzen. Die brillante Automaten-Adaption Marble Madness
tr&ouml;stet aber viele &uuml;ber den Softwaremangel hinweg. Ob allein oder zu zweit,
mit dem Murmelwahnsinn kann man die Grafikf&auml;higkeiten des Amiga anschaulich
demonstrieren. Da die Maus bislang ein Instrument f&uuml;r
High-Tech-Grafikcomputer und Anwendungsprofis war, begeistert die
innovative Steuerung jeden Spielefreak. Das Automatenvorbild wurde zwar via
Trackball, eine Art &quot;umgedrehte&quot; Maus, gesteuert, doch die Programmierer
holten aus der Mauskontrolle das beste heraus. Auch das Adventure The Pawn
fasziniert. Prinzipiell ist das Debut-Abenteuer von Magnetic Scrolls ein
reines Text-Adventure, &auml;hnlich den ber&uuml;hmten Infocoms. Zus&auml;tzlich werden
allerdings 30 fantastische Grafiken zu bestimmten Schaupl&auml;tzen
eingeblendet. Die Qualit&auml;t der Bilder ist beeindruckend. Immerhin sa&szlig;en
echte Grafikk&uuml;nstler vor den Malprogrammen - digitalisieren galt nicht. In
der &uuml;brigen Spielewelt geht's drunter und dr&uuml;ber: W&auml;hrend Epyx mit World
Games zu einem seiner letzten Klassiker ausholt, die Infocom-Anh&auml;ngerschaft
sich am Pseudo-Sex-Adventure Leather Godesses of Phobos erfreut und die
Bard's Tale von Interplay die Herzen der Rollenspieler erobert, wagt sich
die Spieleabteilung des Filmemachers George Lucas an ein neues
Adventure-System. Mit Labyrinth l&auml;utet Lucasfilm Games die &Auml;ra der Lauf-
und Anklickspiele ein - vorerst nur auf dem C64. Erw&auml;hnenswert ist in
diesem Jahr noch ein unbestrittener Klassiker: Elite erscheint auf BBC und
C64. <br><br>
<b>Amiga-News:</b><br>
Von Joystick- auf Computerproduktion umzusteigen; kann bei finanzieller
Fehlplanung mitunter zu herben Schwierigkeiten f&uuml;hren. Als die
Entwicklerfirma &quot;Amiga&quot; finanziell tief in den roten Zahlen steckte, griff
Commodore vor dem Konkurrenten Atari zu - im Sommer '86 erschien der
geplante Computer doch noch: der Amiga 1000. Motorola 68000 hei&szlig;t das
Zauberwort. Dieser schnelle Prozessor, den man erstmals im Sinclair QL,
Macintosh und Atari ST fand, ist auch das Herz des Amiga 1000. Er wird mit
einer Frequenz von 7,15909 MHz getaktet - im Vergleich zu den anderen
Rechnern keine Revolution. Allerdings werkeln im Amiga einige Spezial-Chips
- Stichwort Blitter. Sie sorgen f&uuml;r schnellen Grafikaufbau, flotte
Speicherverwaltung und komfortable Programmierung der Ein- und
Ausgabeger&auml;te. </p>
<hr>
<a name="1987"></a>
<h3><font face="" color="#008000">1987</font></h3>
<p title="" align="JUSTIFY">Der Amiga wird erschwinglich. F&uuml;r 2500 Mark
darf man ihn mit nach Hause nehmen. Die Spieleindustrie reagiert,
Programmierer und vor allem Grafiker legen sich ins Zeug. Die Fortsetzung
von The Pawn ist noch begehrter als ihr Vorg&auml;nger. Wer Mitglied in der
Gilde der Diebe (The Guild of Thieves) werden will, mu&szlig; verzwickte R&auml;tsel
l&ouml;sen und Kopfn&uuml;sse knacken. &Auml;u&szlig;erst stilvoll ist auch die Grafik des
ersten Cinemaware-Produkts: Defender ot the Crown zeigt, wie brillante
Grafiken ein mittelm&auml;&szlig;iges Strategiespiel aufwerten k&ouml;nnen. Etappenweises
Erobern des britischen Eilands ist angesagt. Mittelalterliche Nachhilfe wie
Duelle, Turniere oder Raub&uuml;berf&auml;lle geh&ouml;ren dazu. Das originelle und
herrlich umgesetzte Spielkonzept fesselt alle grafikverliebten
Amiga-Besitzer. Der China-Kn&uuml;ller Shanghai sorgt 1987 ebenfalls f&uuml;r
Aufsehen. Was auf den ersten Blicl wie eine Menory-Variante aussieht,
versetzt nach wenigen &quot;Darf ich mal?&quot;-Minuten die ganze Familie, ob
Spielefan oder nicht, in eine Art &quot;Suchtmodus&quot; - das einfache, aber
fazinierende Spielkonzept wird noch Jahre sp&auml;ter an den Amiga-Monitor
fesseln. Begeistert sind auch die Eroberer der 5000 Sentinel-Welten.
Zun&auml;chst escheint das Spiel allerdings auf dem C64 und dem Sinclair
Spectrum. Das Kultspiel um die Vektorlandschaft und ihre W&auml;chter fesselt
Tausende an die Monitore. Die Spielebranche stellt sich jedoch daruaf ein,
zuk&uuml;nftig dem Amiga die Priorit&auml;t Nummer Eins einzur&auml;umen. <br><br>
<b>Amiga-News:</b><br>
Nach dem Preisfall des Amiga 1000 wartet Commodore mit zwei
Neuvorstellungen auf, die insbesondere dem Atari ST den Todessto&szlig; geben
sollen. Diese zwei Ger&auml;te sind bis heute im Handel: Der Kassenschlager
schlechthin ist der Amiga 500. F&uuml;r sympathische 1000 Mark erh&auml;lt der K&auml;ufer
des Tastaturcomputers die sagenhafte Ausstattung des Vorg&auml;ngers - sogar um
einige Features erweitert: 512 KByte und Kickstart 1.2 sind jetzt
serienm&auml;&szlig;ig. Tats&auml;chlich verkauft sich der Amiga 500 noch besser als
erwartet. Auch sein gr&ouml;&szlig;erer Bruder, der Amiga 2000, steht seinen Chip. Der
2000er verbindet die etwas fortschrittlichere Technik des 500ers mit der
offenen Systemarchitektur des l000ers; das Geh&auml;use ist bulliger, um nicht
zu sagen klobig, und bietet Platz f&uuml;r f&uuml;nf Amiga- sowie vier
PC-Steckkarten. Au&szlig;erdem verf&uuml;gt der Amiga 2000 &uuml;ber ein ganzes MByte
RAM-Speicher - ein Schlaraffenland f&uuml;r Programmierer. </p>
<hr>
<a name="1988"></a>
<h3><font face="" color="#008000">1988</font></h3>
<p title="" align="JUSTIFY">Erste Verkaufszahlen dringen an die
&Ouml;ffentlichkeit: weltweit wurden bislang 600.000 Amigas verkauft, davon
allein 150.000 in Deutschland. Nach den zahlreichen englischen Produkten
setzen jetzt auch deutsche Softwareh&auml;user verst&auml;rkt auf den Amiga.
Hobbystrategen d&uuml;rfen sich an einem internationalen Taktikspiel rund um die
Schifffahrt austoben: Ports of Call. Die Entwickler kommen aus Deutschland
und den USA. Das Ergebnis der Cross-Over-Bem&uuml;hungen ist ein aufwendiges
Handelsspektakel, das lange in den Charts bleibt und von den Besitzern
anderer Computertypen beneidet wird. Die Baller-Freaks bringen bei Factor
5's Katakis ihr Adrenalin in Schwung. Der Horizontalscroller made in
germany zeigt, wieviel Action man aus dem Amiga herauskitzeln kann und ist
auf dem 16-Biter mindestens so erfolgreich wie auf dem C64.
Spiele-Perestroika: Der Superhit des Jahres kommt aus Ru&szlig;land: Tetris
erobert die Computerwelt. Alles spielt - auch seri&ouml;se Firmenbosse und
friedliche Hausfrauen wagen sich an die Tastaturen. Das Spiel um die
fallenden Steine wird zum &uuml;berragenden Erfolg. Der bahnbrechende
Perestroika-Hit endet in einem Sammelsurium von Clones und Varianten mit
abge&auml;nderten Regeln und anderen Steinen. Rollenspieler schauen in diesem
Jahr neidisch auf Kollegen mit einem Atari ST: In Dungeon Master l&auml;uft man
durch Gew&ouml;lbe und Gruften, die in einer detaillierten 3-D-Perspektive
dargestellt werden - alles aus der Sicht des Abenteurerteams. Die
Amiga-Version wird sehns&uuml;chtig erwartet. Flugsimulatorenfans kommen dieses
Jahr nicht zu kurz. Der rasante lnterceptor r&uuml;ckt ins Rampenlicht. Dank
Au&szlig;enansicht, Missle View und anderer Blickf&auml;nge, wird viel f&uuml;rs Auge
geboten. Wer auf &uuml;bertriebenen Realismus verzichtet, hat einen H&ouml;llenspa&szlig;
mit den zahlreichen Missionen, die entweder mit einer F-16 oder einer
F/A-18 geflogen werden. <br><br>
<b>Amiga-News:</b><br>
Das neue Betriebssystem ist da. Oberfl&auml;chlich betrachtet gibt keine gro&szlig;en
Unterschiede zwischen Kickstart 1.2 und 1.3 bzw. den entsprechenden
Workbench-Desktops. Der Fortschritt liegt im Verborgenen: So ist z.B.
Booten von anderen Ger&auml;ten wie einer Festplatte oder der ebenfalls neuen
resetfesten RAM-Disk m&ouml;glich. Das Update hat allerdings auch einen
unangenehmen Nebeneffekt. Programme, deren Sch&ouml;pfer sich nicht an die
Programmierrichtlinien von Commodore hielten, arbeiten nicht mit dem neuen
Kickstart - trotzdem wird die Version 1.3 zum Standard. </p>
<hr>
<a name="1989"></a>
<h3><font face="" color="#008000">1989</font></h3>
<p title="" align="JUSTIFY">Der Amiga etabliert sich als Heimcomputer f&uuml;r
Normalsterbllche. Die Anwendungssoftware wird professioneller, Spiele immer
zahlreicher und hochwertiger. Sogar Speichererweiterungen sind
erschwinglich, w&auml;hrend Festplatten Immer noch den Profis vorbehalten
bleiben. Die Bl&uuml;tezeit der Hardwarebastler und -anbieter beginnt. Auch die
Dungeon-Fans freuen sich: endlich erscheint die Amiga-Version von Dungeon
Master. Sie wird von der Rollenspielgemeinde mit Begeisterung aufgenommen,
obwohl sich gegen&uuml;ber der ST-Version kaum etwas ge&auml;ndert hat. Daf&uuml;r
pr&auml;sentieren Bullfrog nach Fusion ihr zweites Spiel auf dem Amiga: mit
Populous erlangt das britische Programmierteam Weltruhm. Nicht nur Grafik
und Sound sind entscheidend f&uuml;r den Erfolg, die Spielidee ist brillant
ausget&uuml;ftelt und perfekt umgesetzt. Mit Populous beginnt der Siegeszug der
kleinen M&auml;nnchen. Ein zweites Strategiespiel sorgt f&uuml;r lange &quot;Ich bin der
Herrscher&quot;-Abende: Maxis ver&ouml;ffentlicht Sim City. Auch hier werden nicht
die audiovisuellen Eigenschaften des Amigas ausgereizt, allein die geniale
Spielidee steht im Vordergrund. Im Bereich der GeschickIichkeitsspiele
sticht eines der wenigen deutschen Qualit&auml;tsprodukte heraus: Rock'n'Roll
aus dem Hause Rainbow Arts erntet Kritikerlob. Vertont wurde das
Kugelspektakel mit intuitiver Steuerung von Sound-Guru Chris H&uuml;lsbeck. Der
neue lndiana-Jones-Film l&auml;uft gerade in den deutschen Kinos, schon streiten
sich zwei Indy-Spiele um die Marktanteile: W&auml;hrend Oceans
Actionspiel-Variante im qualitativen Durchschnitt h&auml;ngenbleibt, g&auml;nzt das
Lucasfilm-Adventure mit einer liebevollen Umsetzung der Filmhandlung. Die
Animationen der Sprites sind hervorragend gelungen - das Auge wird f&uuml;r die
Leistung des Gehirns beim Puzzlel&ouml;sen belohnt. Aber auch der C-64-Kn&uuml;ller
Zak McKracken kommt auf dem Amiga gut an. In England macht ein Riesenerfolg
der Firma Psygnosisauf sich aufmerksam. Shadow of the Beast trifft trotz
der zahlreichen britischen Erfolge nicht den Geschmack des deutschen
Publikums. Da sind die Bitmap Brothers, ebenfalls aus England, schon
wesentlich erfolgreicher. In dem Actionspektakel Xenon 2 tummeln sich
bildschirmgro&szlig;e Qbermotze, Dutzende Gegner und ein Raumschiff, das in
voller Bewaffnung einem getunten Schlachtkreuzer aus Star Wars gleicht.
Alles in allem ist 1989 ein erfolgreiches Jahr f&uuml;r den Amiga; die deutschen
Verkaufszahlen erreichen etwa 300000 Einheiten. <br><br>
<b>Amiga-News:</b><br>
Nach den Amiga 2500 DTP greift der Amiga 2500 UX die Unix-Konkurrenz an.
Trotzdem sind die Erwartungen an den etwas aufgemotzten 2000er zu hoch
gesteckt. 5 MByte RAM, 80-MByte-Festplatte, 68030-Turbokarte, Flickerfixer
- pfiffige Amiga-Fans haben das alles l&auml;ngst. Trotzdem ist das System als
solches nicht leistungsf&auml;hig genug, um den Unix-Markt zu
revolutionieren.</p>
<hr>
<a name="1990"></a>
<h3><font face="" color="#008000">1990</font></h3>
<p title="" align="JUSTIFY">In diesem Jahr leben alle Amiga-Besitzer mehr
oder weniger gl&uuml;cklich vor sich hin, genie&szlig;en die sinkenden Preise von RAM
und Festplatten und erfreuen sich an neuer Software. Besonders Umsetzung
von erfolgreichen Spielen erobern die Amiga-Charts. Herausragendes Beispiel
f&uuml;r Langzeitmotlvation ist Pirates, das &uuml;ber f&uuml;nf Jahre Inder
Leserhitparade der PC WEH PLAY bleiben sollte. Absoluter Redaktionsliebling
ist die perfekte Adaption eines Arcade-Superhits: Das geniale Jump'n'Run
Rainbow lslands wird von der englischen Programmiertruppe Graftgold
unvergleich gut in Szene gesetzt. Viele Farben, schnelle Action und
intuitive Steuerung kennzeichnen den Geschicklichkeitshit ebenso wie
Langzeitmotivation durch Spielvielfalt und -abwechselung. Auch die
Abenteuerpalette wird immer gr&ouml;&szlig;er - das langersehnte Maniac Manslon von
Lucasfilm Games wird umgesetzt und pr&auml;sentiert sich auf dem 16-Biter in
&auml;hnlichem Niveau wie Zak McKracken im letzten Jahr. Auch aus Deutschland
l&auml;&szlig;t das wackere Programmierteam Factor 5 etwas von sich h&ouml;ren: Turrican
erobert die ActionWelt. Technisch ist das St&uuml;ck Software ein Meisterwerk.
Zahlreiche bombastische Musikst&uuml;cke peppen das Laser-Spektakel zus&auml;tzlich
auf. Aus England kommt Lotus Esprit Turbo Challenge. Das Flair und der
Spielspa&szlig;, den dieses Spiel vermittelt, ist einmalig. Auf dem ST erscheint
mittlerweile der Dungeon-Master-Nachfolger Chaos strikes back, auf den
Amiga-Besitzer leider noch warten m&uuml;ssen. <br><br>
<b>Amiga-News:</b><br>
Die Ger&uuml;chtek&uuml;che im Commodore-Haus brodelt; ein neuer Amiga soll
herauskommen. Die Pr&auml;sentation erfolgt allerdings erst im n&auml;chsten Jahr.
Der Amiga 3000 besitzt einen 68030-Prozessor und wird mit 16 oder 25 MHz
getaktet. Die High-End-Maschine soll sogar mit einer neuen
Betriebssystemversion ausgeliefert werden: Kickstart 2.0. Eines der wenigen
Highlights ist die interne Festplatte f&uuml;r den Amiga 500. Sie l&auml;&szlig;t sich in
das Rechnergeh&auml;use einsetzen und tr&auml;gt den liebevollen Namen Arriba. Die
Hardwarefirma Gigatron, nutzte dazu die neue
2-Zoll-Festplattengeneration.</p>
<hr>
<a name="1991"></a>
<h3><font face="" color="#008000">1991</font></h3>
<p title="" align="JUSTIFY">Die Leistungsf&auml;higkeit eines modernen PC
&uuml;berholt den Amiga um L&auml;ngen. Tats&auml;chlich st&uuml;rzen sich viele
Spieleentwickler auf MS-DOS-Spiele. Gerade rechenaufwendige Spielereien wie
3-D-Grafik kann man hier besser realisieren. Trotzdem wird auch auf der
Amiga-Schiene weiterentwickelt. Das originellste Spiel des Jahres handelt
von kleinen, selbstm&ouml;rderischen, gr&uuml;nhaarigen M&auml;nnchen - die Lemmings sind
los! Als Kommandant &uuml;ber ein verr&uuml;cktes V&ouml;lkchen d&uuml;rft Ihr Euch nach
Belieben austoben, denn jeder einzelne Lemming &uuml;bernimmt eigene Aufgaben -
bei hundert Lemmingen verliert man schon mal die Ubersicht. Auch Lucasfilm
Games feiert einen Riesenerfolg. Zur Gilde hervorragender Abenteuerspiele
gesellt sich The Secret of Monkey Island. Doch hier m&uuml;ssen erstmals
Amiga-Besitzer in den s&auml;uerlichen PC-Apfel bei&szlig;en: Die MS-DOS-Version mit
h&uuml;bscherer Grafik erscheint zuerst. Amiga-Freaks geben sich mit der
zweitbesten Optik zufrieden der Spielspa&szlig; leidet darunter jedoch kaum, die
Fortsetzung wird sehnlichst erwartet. In Deutschland sind exklusive
Amiga-Spiele made in germany nach wie vor sehr beliebt; besonders, wenn
eine pfiffige Spielidee dahintersteckt. Zum Beispiel Battle Isle. Der
Grundgedanke entspringt zwar einem japanischen Spiel, die europ&auml;ische
Deluxe-Version von Blue Byte sollte aber kein Stratege missen. Die
Turrican-Fan-Gemeinde wird mit der Fortsetzung Turrican 2 gef&uuml;ttert. Das
Konzept bleibt gleich, allerdings wird die Technik perfektioniert, die
Grafik &uuml;berarbeitet und Dutzende sch&ouml;ne Musikst&uuml;cke hineingestrickt. Der
Kultstatus bleibt Factor 5 erhalten. Einige ber&uuml;hmte Spiele werden f&uuml;r den
Amiga konvertiert: Railroad Tycoon, Silent Service 2 und Chaos strikes back
sind sehr erfolgreich und finden ihren Weg in die Charts. MS-DOS-Besitzer
lachen &uuml;ber diese alten H&uuml;te, denn die PC-Besitzer spielen bereits den
Zukunfts-Weltraumsimulator. <br><br>
<b>Amiga-News:</b><br>
Durch die wachsende PC-Konkurrenz steht Commodore unter Druck, einen
Computer zusammenzubasteln, der neue Ma&szlig;st&auml;be setzt. Das wohl umstrittenste
Ger&auml;t ist das CDTV, eine Symbiose zwischen Amiga und CD-Spieler bzw.
CD-ROM. Das Revolution&auml;re an CD-ROMs ist die enorme Speicherkapazit&auml;t. Etwa
600 MByte passen auf eine der silbernen Scheiben. Doch das CDTV ist zu
teuer und CD-gerechte Software l&auml;&szlig;t lange auf sich warten. Niemand ist so
recht sicher, ob das CDTV &uuml;ber die Startschwierigkeiten hinwegkommt. Der
Amiga 3000 erobert als Profimaschine den Markt. Wo 2000er Besitzer ihren
Rechner mit einigen Erweiterungen ausger&uuml;stet haben, hat der 3000er bereits
alles inklusive: 68030-Chip mit Coprozessor, Super Fat Agnus und das neue
Betriebssystem 2.0 inklusive der Oberfl&auml;che Workbench 2.0. Das neue Desktop
braucht sich nicht mehr hinter der PC-Konkurrenz zu verstecken. Allerdings
gibt es mal wieder Kompatibilit&auml;tsprobleme mit schlecht programmierter
Software. Das bef&uuml;rchtete Chaos bleibt jedoch aus. Die alten Amigas kommen
nicht zu kurz: Das komplette Kickstart-2.O-Paket ist f&uuml;r 200 Mark zu haben.
Letzter Streich von Commodore ist der Amiga 500 plus, der nur wenige
&Auml;nderungen gegen&uuml;ber seinem Vorg&auml;nger aufweist. Das Plus kennzeichnet mehr
Speicher und neuere Chip-Versionen. </p>
<hr>
<a name="1992"></a>
<h3><font face="" color="#008000">1992</font></h3>
<p title="" align="JUSTIFY">Langsam macht der PC dem Amiga die
Vormachtstellung in Sachen Spiele streitig. Viele Hersteller In den USA
spezialisieren sich ausschlie&szlig;lich auf IBM-kompatible. Ein neuer Ma&szlig;stab
wird angelegt: Unter 20 MByte und 25 MHz entwickelt man keine Spiele. Bei
diesen Daten kann der &quot;normale&quot; Amiga leider nicht mithalten.
Festplattenbesitzer trifft man zwar immer h&auml;ufiger, f&uuml;r rechenaufwendige
Flugsimulatoren ist der Amiga jedoch zu langsam. Allerdings behauptet sich
der Amiga erfolgreich in den anderen Spiele-Genres. Gerade bei Jump'n'Runs
und Actionspektakeln ist der Amiga der PC-Konkurrenz haushoch &uuml;berlegen.
Fire &amp; Ice ist das beste Beispiel f&uuml;r ein High-End-Geschicklichkeitsspiel.
Andrew Braybrook &amp; Co. zaubern mit Grafik und Sound. Auch
Multi-Player-Spiele werden beliebter - der Tophit ist die Umsetzung eines
originellen PC-Engine-Moduls Dynablasters. Als gelungene Packungsbeilage
findet Ihr einen Vier-Spieler-Adapter. Monkey Island 2 ist da! Der
langerwartete Hit schockiert alle Amiga-Besitzer. Auf einem normalen Amiga
ist der Spielablauf furchtbar tr&auml;ge, trotzdem bleibt's spielbar. Wer einen
68030er-Prozessor in seinem Amiga hat, kann den zweiten Teil um die
Affeninsel genie&szlig;en - grafisch ist das Lucasfilm-Spiel unerreicht gut. Die
Rollenspieler werden von Domark &uuml;berrascht. Shadowlands wartet mit
isometrischer 3-D-Grafik auf, bietet ein faszinierendes Fantasy-Ambiente
und setzt spielerisch Akzente. Entt&auml;uschend hingegen ist die
UItima-6-Umsetzung. Die Fortsetzung der bekannten Rollenspielsaga ist auf
einem 7-Mhz-getakteten Amiga unspielbar. <br><br>
<b>Amiga-News:</b><br>
Commodore legt sich bei der Neuentwicklung von Amigas m&auml;chtig ins Zeug,
denn die PC-Konkurrenz w&auml;chst und w&auml;chst - es regnet wieder Amigas. Der
600er provoziert in Fachkreisen allerdings schallendes Gel&auml;chter. Man
nehme: einen Amiga 500 plus, entferne die Zehnertastatur, verl&ouml;te alle
schadensanf&auml;lligen Chips unaustauschbar mit der Platine und installiere
einen omin&ouml;sen Port &auml;hnlich dem Modulschacht des C64. Heraus kommt ein
Ger&auml;t, dessen Preis/Leistungsverh&auml;ltnis fragw&uuml;rdig ist. Dabei ist der 600er
nur ein Vorreitermodell zur neuen Advanced Amiga-Generation. Der Amiga 4000
und Amiga 1200 werden noch dieses Jahr vorgestellt. Die beiden
High-Tech-Modelle sind mit einem neuen Chip-Set ausger&uuml;stet, mit dem h&ouml;here
Aufl&ouml;sungen und mehr Farben zu realisieren sind. Eine Aufr&uuml;stung f&uuml;r alte
Amigas wird nicht m&ouml;glich sein. </p>
<hr>
<a name="Resume"></a>
<h3><font face="" color="#008000">Res&uuml;me</font></h3>
<p title="" align="JUSTIFY">Der Amiga Ist heute sicher nicht mehr der
Traumcomputer, der er 1986 war. PCs, seine wohl &auml;rgste Konkurrenz, werden
immer leistungsf&auml;higer. Gl&uuml;cklicherweise versucht nun Commodore, den
High-Tech-Vorsprung der MS-DOS-Rechner zu verk&uuml;rzen. Die Modellpolitik ist
eindeutig: Zum einen werden preisg&uuml;nstige Einstiegsmodelle angeboten,
w&auml;hrend High-End-Produkte f&uuml;r Profis die Produktpalette nach oben abrunden.
Obwohl dies auf den ersten Blick etwas chaotisch wirkt, hat es einen
ungemeinen Vorteil: Commodore ist technologisch immer vorn dabei. W&auml;hrend
die PC-Architektur nun schon einige Jahre auf dem Buckel hat, stecken im
Amiga immer die neuesten Technologien. Programmierer kennen und nutzen den
Unterschied. Au&szlig;erdem hat der Amiga den Vorteil, da&szlig; er schon als
Grundger&auml;t eine professionell arbeitende Einheit bildet. Beim PC m&uuml;ssen
neue F&auml;higkeiten hinzugekauft werden: Multitasking, Audio- und
Videoanschl&uuml;sse sind Im Amiga seit langem Standard. Obwohl es so scheint,
als h&auml;tte Commodore eine Zeitlang am Anwender vorbei entwickelt, zielt
diese Politik darauf hin, die Angebotspalette und damit die Zielgruppe zu
verbreitern. Wie erfolgreich die Advanced-Amiga-Serie wird l&auml;&szlig;t sich noch
nicht absch&auml;tzen, doch eines ist sicher: Der Amiga 500 wim nicht allzu
schnell vom Homecomputer-Markt verschwinden. Sehr gespannt darf man auf den
neuen Amiga 1200 sein, von dem ich erwarte, da&szlig; er den Durchbruch
schafft.<br><br>

RICHARD EISENMENGER<br><br>

<strong>Dies ist ein Bericht aus der POWER PLAY 12/92</strong></p>
</TD>
</TR>
</TABLE>
<BR>
<BR>

<TABLE border="5" cellspacing="1" cellpadding="5" align="CENTER" summary="">
<TR>
<TD>Rainer Wrieden</TD>

<TD>E-Mail: <A href="mailto:spezis@terra.es">spezis@terra.es</A></TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

