<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat wieder etwas gefunden</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <A name="top"></A> 

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Bush
          - Satire</B></FONT></P>

          <P>Ein Artikel in der jetzigen Ausgabe von Tomorrow (Autorin: Birthe Wenge)
          hat mir sehr gut gefallen und ich werde ihn hier auszugsweise abgeschrieben
          euch vorstellen.</P>

          <P>Radio-Eriwan-Witze waren fr&uuml;her ein Ventil der Volksemp&ouml;rung
          gegen die Herrschenden. Heute muss sich Kanzler Schr&ouml;der mit dem
          Steuersong von Elmar Brandt Hohn und Spott gefallen lassen. Auch Georg
          Walker Bush kriegt nat&uuml;rlich gerade jetzt global, vor allem im
          Internet, sein Fett weg. Und das nicht wenig: Die Site lemonbovril.co.uk
          am&uuml;siert mit "Bushismus" - den Sprachst&ouml;rungen und dem
          Herumgestottere des Wortungewaltigen -, indem sie Klangschnipsel und
          Wortfetzen des US-Pr&auml;sidenten als Bastelanleitung f&uuml;r
          Kriegdrohungen zur Verf&uuml;gung stellt. Ein Bush-Zitat als Beispiel:
          "Nun, ich denke, wenn Sie sagen, dass Sie etwas tun werden und es dann
          nicht tun, das ist Vertrauensw&uuml;rdigkeit." Dazu passt auch das
          Interview des Parade-Texaners Larry Hagman (J.R.Ewing in Dallas), der
          seinen Landsmann Bush j&uuml;ngst wie folgt kritisierte: "Er kann nicht
          reden. Er kann nicht lesen. Er ist Legastheniker." Klar, dass
          Web-Humoristen bei derartigen Vorlagen nicht still daneben stehen
          k&ouml;nnen. Weswegen es jetzt im Internet die komplette Parodie-Palette
          gibt - von Witzen &uuml;ber fingierte Fotos bis hin zu Flash-Filmen und
          interaktiven Spielen. Der Spa&szlig; f&auml;ngt beim Spitznamen "Dubya" an
          -texanische Aussprache f&uuml;r "double u" - W f&uuml;r Walker - und
          h&ouml;rt bei ziemlich niveaulosen Kopulations-Animationen mit dem
          englischen Premier Tony Blair auf. Neben vielen vielen M&ouml;glichkeiten
          erlaubt eine Animation auf der Site "spankbush.com" den Usern, Bush
          pers&ouml;nlich zu &uuml;berraschen: mit einer virtuellen Tracht
          Pr&uuml;gel auf des Pr&auml;sidenten Allerwertesten. Bush beschimpft dabei
          den Schl&auml;ger: "Pr&uuml;geln ist ein Akt des Terrors!" Ein Anschreiben
          haben die Macher der Site auch bereit gestellt. "Lieber Pr&auml;sident,
          dein Verhalten war derma&szlig;en unentschuldbar und b&ouml;se, dass eine
          geringere Strafe - wie die Pferdchen von deiner Ranch in Texas zu klauen
          -schlichtweg nicht ausreicht. Du geh&ouml;rst verpr&uuml;gelt!"</P>

          <P align="center">
          <IMG src="mm_bush1.jpg" width="414" height="424" alt=""></P>
          <HR>

          <P>Und nun eine Aufz&auml;hlung verschiedener Satire-Sites &uuml;ber
          den US-Pr&auml;sident Bush:</P>

          <P><FONT color="#ff0000"><B>politicalhumor.about.com</B></FONT><BR>
          <B>WITZE UND SATIRE</B><BR>
          Riesiges Archiv mit Witzen, Fotocollagen, Videeos und teils animierten Cartoons
          &uuml;ber Bush, seine Feinde, T&ouml;chter und seine Sprachst&ouml;rungen.<BR>
          FAZIT: Gelungener Rundumschlag gegen Texas' "Dubya".</P>

          <P><FONT color="#ff0000"><B>bushspeaks.com</B></FONT><BR>
          <B>FRECHE COLLAGEN</B><BR>
          Bushs Reden-Generator sowie &uuml;ber 100 Text-Bild-Collagen (siehe unten das
          Neueste), teils mit Denkblasen und Ausschnitten aus Original&auml;u&szlig;erungen
          des oft konfusen US-Pr&auml;sidenten.<BR>
          FAZIT: Die fingierten Bilder, gepaart mit Zitaten, sind top.</P>

          <P><FONT color="#ff0000"><B>www.sandfords.net</B></FONT><BR>
          <B>&Uuml;BER 1000 SONGTEXTE</B><BR>
          Anti-Bush-Banner f&uuml;r die eigene Homepage und &uuml;ber 1000 Anti-Bush
          Song-Parodien. Leider sind nur die Texte zu lesen, die Melodien separat als
          Playback h&ouml;rbar.<BR>
          FAZIT: Gute Parodien, aber schlechtes, un&uuml;bersichtliches Design der Site.</P>

          <P><FONT color="#ff0000"><B>www.miniclip.com</B></FONT><BR>
          <B>WILDES ZAPPELN</B><BR>
          Interaktive Show-Einlagen &agrave; la "Bundesdance": Der US-Pr&auml;sident
          verrenkt sich beim Aerobic, tanzt allein und gemeinsam mit Britney Spears.<BR>
          FAZIT: Sehr nette H&uuml;ftschw&uuml;nge und Moowalks.</P>

          <P><FONT color="#ff0000"><B>www.toostupidtobepresident.com</B></FONT><BR>
          <B>HOHLBRATZE</B><BR>
          Animierte Cartoons, Top-Listen (z.B. "Top 11 Anzeichen daf&uuml;r, dass du
          Georg W.Bush oder Kim Jong II bist") und Flash-Animationen.<BR>
          FAZIT: Sehenswerte Flash-Animationen, inhaltlich aber nicht berauschend.</P>

          <P><FONT color="#ff0000"><B>www.dubyaspeak.com</B></FONT><BR>
          <B>BUSHISM</B><BR>
          Umfangreiche, nach Themen sortierte Textsammlung von Bushs planlosen
          &Auml;u&szlig;erungen, mit Kommentar der Site-Betreiber. Dazu wenige
          ausgew&auml;hlte Audiofiles.<BR>
          FAZIT: Die Realit&auml;t ist erschreckend und lustig zugleich.</P>

          <P><FONT color="#ff0000"><B>www.spankbush.com</B></FONT><BR>
          <B>BAD BOY'S STRAFE</B><BR>
          Mit der flachen Hand, einem Holzbrett oder einem Fisch Gerg W. virtuell Pr&uuml;gel
          verpassen - und ihm dann das Ganze mit frechen Anschreiben mailen.<BR>
          FAZIT: Erst steht er auf Schl&auml;ge, dann jault er - exzellente Idee
          und Umsetzung.</P>

          <P><FONT color="#ff0000"><B>www.gagarama.de</B></FONT><BR>
          <B>BUSH-BIOGRAFIE</B> (s.u.)<BR>
          Deutschsprachige Site mit Bush-Specials: Cartoons (teils animiert und mit
          Zitaten sowie Kommentaren der Macher), Kurzbiografie und Links.<BR>
          FAZIT: Wenig Auswahl, oft niveaulos und m&ouml;chtegern-witzig.</P>

          <P><FONT color="#ff0000">
          <B>www.newgrounds.com/collections/politics.html</B></FONT><BR>
          <B>FLASH-FUN</B><BR>
          &Uuml;ber 100 Flash-Filme und -Spiele, z.B. "Dress Dubya" oder "Bush calls 
          Putin", am einfachsten mithilfe der Suchmaske auf der Site zu finden.<BR>
          FAZIT: Sehr professionell, witzig und unterhaltsam, aber sehr lange Ladezeiten.</P>

          <P><FONT color="#ff0000"><B>www.madkane.com/bush.html</B></FONT><BR>
          <B>WEBLOG</B><BR>
          Satirisches Tagebuch des US-Pr&auml;sidenten, geschrieben von einer US-Kolumnistin.
          Zu besonderen Anl&auml;ssen mit Comic oder Link.<BR>
          FAZIT: Lustig, doch leider nicht t&auml;glich mit einem neuen Eintrag.</P>

          
          <HR>

          <P align="center"><FONT size="+2">George Bush jr.: Kurz-Biografie</FONT><BR>
          aus www.gagarama.de</P>

          <P>George Walker Bush, geb. am 6. Juli 1946<BR>
          43. Pr&auml;sident der Vereinigten Staaten von Amerika</P>

          <P>Bush's offizielle <STRIKE>Amts&uuml;bernahme</STRIKE>
          Macht&uuml;bernahme war am 20. Januar 2001. Sein Vize-Pr&auml;sident ist
          Dick Cheney, ebenso wie Bush ein echter Republikaner.</P>

          <P>George W. Bush jr. wurde in New Haven, Conneticut, geboren, wuchs jedoch
          in Texas auf, gemeinsam mit seinen Geschwistern Jeb, Neil, Marvin und
          Dorothy, die allesamt und nacheinander von ihrer Mom, Barbara Pierce Bush,
          zur Welt gebracht wurden.</P>

          <P>Bush erwarb sich den "Bachelor's degree" (Voraussetzung f&uuml;r ein
          weiterf&uuml;hrendes Graduate-Studium) auf der Yale University und den
          "Master of Business Administration degree" (Diplom) auf der Harvard
          Business School (die Kosten f&uuml;r Dubya's "Erwerb" dieser beiden
          Abschl&uuml;sse sind uns leider unbekannt -d.Red.). Nach seinem
          Abschlu&szlig; trat er der Texas Air National Guard bei und wurde F-102
          Pilot .. na ja, sagen wir mal ein halber Pilot, oder vielleicht doch eher
          ein Chicken Hawk?</P>

          <P>Chicken Hawk, h&auml; ..? Chicken Hawks (H&uuml;hner-Falken) ist eine
          relativ neue Bezeichnung f&uuml;r prominente Amerikaner (zumeist mehr oder
          minder m&auml;nnliche solche), die sich selbst bisher erfolgreich um ihre
          Vaterlandspflichten gedr&uuml;ckt haben, und die in Krisenzeiten dennoch
          oder gerade deshalb voller Kampfeslust und am lautesten von allen nach
          Krieg schreien - militante "Weicheier" quasi (s. <A href=
          "http://www.guardian.co.uk/Columnists/Column/0,5673,777572,00.html"
          target="_blank">The Guardian: Chicken Hawks</A>). So war der Kampfpilot
          Bush jr. eher ein Krampfpilot, jedenfalls wenn es um Vietnam ging, womit
          der amerikanische F&uuml;hrer denn auch in dieser uralten Disziplin
          f&uuml;hrend w&auml;re, hart gefolgt von seinem kleinen Zusatzf&uuml;hrer,
          Dick Cheney und vielen anderen <STRIKE>Falken</STRIKE> H&uuml;hner-Falken.
          Infos zu Bush's Fernbleiben vom Dienst? finden sich unter <A href=
          "http://www.awolbush.com/" target="_blank">GW Bush Went AWOL</A> und bei
          der New Hampshire Gazette findet sich schlie&szlig;lich sogar eine ganze <A
          href= "http://www.nhgazette.com/chickenhawks.html" target=
          "_blank">Chickenhawk Database</A>, eine sehr interessante solche ..</P>

          <P>Doch zur&uuml;ck zu unserer Bush-Bio: Nach einer weniger als
          mittelm&auml;&szlig;igen Karriere im &Ouml;lund Gas-Gesch&auml;ft, sowie
          als Mitbesitzer des Texas Rangers Baseball Teams, wandte Bush sich
          schlie&szlig;lich der Politik zu.</P>

          <P>Vom 17. Januar 1995 bis 21. Dezember 2000 war George Bush jr. Gouverneur
          von Texas. Bereits im Amt des Gouverneurs gl&auml;nzte er als absoluter
          Spitzenreiter im Verh&auml;ngen der Todesstrafe - 154 Hinrichtungen gingen
          damals auf Bush's Kappe, wof&uuml;r er von seinen Landsleuten
          schlie&szlig;lich als der "Texecutioner" bezeichnet wurde (s. <A href=
          "http://www.ccadp.org/serialpresident.htm" target= "_blank">CCADP.org - The
          Texecutioner George W. Bush: Texas Biggest Serial Killer</A>).</P>

          <P>Im Jahr 1977 heiratete Bush die ehemalige Lehrerin und Bibliothekarin
          Laura Welch (geb. 1946) aus Midland, Texas. Das Paar bekam 1981 ihre beiden
          Zwillingst&ouml;chter Barbara und Jenna, die mittlerweile ebenso wie ihr
          Vater bereits mehr als einschl&auml;gige Erfahrungen mit Drogen und Justiz
          aufweisen k&ouml;nnen (Bush's Trunkenheit am Steuer, s. <A href=
          "http://www.thesmokinggun.com/archive/bushdui1.html" target="_blank">Arrest
          Record Card - polizeiliches Original-Dokument / theSmokingGun.com</A>).</P>

          <P><A href="bush-bomb-light_s.htm" target="_blank">George W. Bush's
          Vater</A>, George Herbert Walker Bush (geb. 13. Juni 1924), war der 41.
          Pr&auml;sident der Vereinigten Staaten von Amerika (1989 bis 1993) und als
          solcher kaum besser, als sein nach unserer Meinung doch ziemlich <A
          href="bush-baby_s.htm" target="_blank">missratenes S&ouml;hnchen</A>.</P>

          <P>In seiner Freizeit betreibt George W. Bush gemeinsam mit seinen Kumpels,
          die er von seinem Dad zum <A href=
          "../mutant/donald-h-rumsfeld.htm">Weltlenken</A> geschenkt bekommen hat,
          u.a. ein gem&uuml;tliches Lager im s&uuml;dkubanischen Guantanamo Bay, mit
          einigen hundert afghanischen und sonstwie arabischen Entm&uuml;ndigten aus
          der amerikanischen Peng-Bumm-Revanche f&uuml;r 9/11 in Afghanistan, ein
          breitgespanntes Netz politischer Bordelle rund um den Globus, sowie die
          weltweit gr&ouml;&szlig;te Milit&auml;rmaschinerie inkl. den
          dazugeh&ouml;rigen Massenvernichtungswaffen, zur nachhaltigen Verbreitung
          von Frieden und Gerechtigkeit auf Erden und in <A href=
          "dubya-segne-gagarama-c.htm" target="_blank">Gottes Namen</A>.</P>

          <P>George Bush jr. spielt gerne mit roten Kn&ouml;pfen und gro&szlig;en,
          dummen Worten und ist der lebende Beweis f&uuml;r die kleinen Fehler der
          Natur und daf&uuml;r, wie gro&szlig; diese doch werden k&ouml;nnen.</P>

          <P>Links zu weiteren Informationen &uuml;ber Leben, Politik und Irrsinn von
          George Bush jr. sowie jede Menge Satire und Humor, &uuml;ber den man
          trotzdem lacht, finden sich in unserem <A href="dumbya-rama.htm" class=
          "mlred">Dumbyarama Link-Bezirk</A> biddesch&ouml;n ..</P>

          <P>.. oder aber und auch feine Bildchen und Anmiati&ouml;nchen von Little
          George and his oily Bunch indes gibt's frisch bei uns, da braucht man nicht
          lange rumzulaufen, da reicht ein beherzter Klick durch unsere <A
          href="george-w-bush.htm" class="mlred">George W. Bush Specials -
          Voil&agrave; mes amis ..</A></P> <HR>

          <P>Falls doch jemand Lust hat, die deutsche Satire-Site
          <B>www.gagarama.de</B> zu besuchen, hier eine kleine &Uuml;bersicht:</P>

          <CENTER>
            <TABLE border="0" cellpadding="5" cellspacing="0"
            width="437">
              <TR>
                <TD valign="top" colspan="2">
                </TD>
              </TR>

              <TR>
                <TD valign="top" bgcolor="#e1e1e1" width="50"><A
                href="roland-koch-hessen.htm"><IMG height="40"
                width="50" src="mm_bush1a.gif" border="0"></A></TD>

                <TD valign="top" bgcolor="#e1e1e1" width="362">
                <SPAN class=
                "text-mblack"><B>Oppopositionsget&uuml;te<BR>
                <A href="roland-koch-hessen.htm" class=
                "mlred">Roland koch Hessen ..</A></B><BR>
                .. aber lass Angela auch mal
                <STRIKE>kotzen</STRIKE> kosten!</SPAN></TD>
              </TR>

              <TR>
                <TD valign="top" bgcolor="#e1e1e1" width="50"><A
                href="rumsfeld-altes-europa.htm"><IMG height="40"
                width="50" src="mm_bush1b.gif" border="0"></A></TD>

                <TD valign="top" bgcolor="#e1e1e1" width="362">
                <SPAN class="text-mblack"><B>Amerikanische
                Steinzeit-Diplomatie<BR>
                <A href="rumsfeld-altes-europa.htm" class=
                "mlred">Donald Rumsfeld: "The center of gravity is
                shifting to the cave"</A></B><BR>
                Der irre alte Rummy Dumbsfeld ruft zum Keulenkampf
                ..</SPAN></TD>
              </TR>

              <TR>
                <TD valign="top" bgcolor="#e1e1e1" width="50"><A
                href="kanzlersong.htm"><IMG height="40" width="50"
                src="mm_bush1c.gif" border="0"></A></TD>

                <TD valign="top" bgcolor="#e1e1e1" width="362">
                <SPAN class="text-mblack"><B>Liedg&uuml;ter<BR>
                <A href="kanzlersong.htm" class="mlred">Der
                Kanzlersong : "Alles wird gut!"</A></B><BR>
                .. ein zarter Schmuse-Rap f&uuml;r wirklich jeden
                Geldbeutel!</SPAN></TD>
              </TR>

              <TR>
                <TD valign="top" bgcolor="#e1e1e1" width="50"><A
                href="schroeder-mit-eichel.htm"><IMG height="40"
                width="50" src="mm_bush1d.gif" border="0"></A></TD>

                <TD valign="top" bgcolor="#e1e1e1" width="362">
                <SPAN class="text-mblack"><B>Bundespolitik<BR>
                <A href="schroeder-mit-eichel.htm" class=
                "mlred">Wahlbetrug: CDU/CSU fordern Haft f&uuml;r
                Schr&ouml;der mit Eichel ..</A></B><BR>
                .. und verbrennen sich anschlie&szlig;end
                selbst!</SPAN></TD>
              </TR>

              <TR>
                <TD valign="top" bgcolor="#e1e1e1" width="50"><A
                href="wahlbetrug-pupskarte.htm"><IMG height="40"
                width="50" src="mm_bush1e.gif" border="0"></A></TD>

                <TD valign="top" bgcolor="#e1e1e1" width="362">
                <SPAN class="text-mblack"><B>Bundespolitik<BR>
                <A href="wahlbetrug-pupskarte.htm" class=
                "mlred">Wahlbetrug: CSU startet Pupskarten-Aktion
                ..</A></B><BR>
                .. und Gagarama startet mit!</SPAN></TD>
              </TR>

              <TR>
                <TD valign="top" bgcolor="#e1e1e1" width="50"><A
                href="wahlbetrug.htm"><IMG height="40" width="50"
                src="mm_bush1f.gif" border="0"></A></TD>

                <TD valign="top" bgcolor="#e1e1e1" width="362">
                <SPAN class="text-mblack"><B>Bundespolitik<BR>
                <A href="wahlbetrug.htm" class="mlred">Wahlbetrug:
                "CDU/CSU bitten um Verst&auml;ndnis!"</A></B><BR>
                Vom christlich demokratischen Appell und so
                ..</SPAN></TD>
              </TR>

              <TR>
                <TD valign="top" bgcolor="#e1e1e1" width="50"><A
                href="bunter-bundestag.htm"><IMG height="40" width=
                "50" src="mm_bush1g.gif" border="0"></A></TD>

                <TD valign="top" bgcolor="#e1e1e1" width="362">
                <SPAN class="text-mblack"><B>Bundespolitik<BR>
                <A href="bunter-bundestag.htm" class="mlred">Oh du
                bunter Bundestag ..</A></B><BR>
                Impressionen aus dem Berliner Reichstagstheater
                ..</SPAN></TD>
              </TR>

              <TR>
                <TD valign="top" bgcolor="#e1e1e1" width="50"><A
                href="steuersong.htm"><IMG height="40" width="50"
                src="mm_bush1d.gif" border="0"></A></TD>

                <TD valign="top" bgcolor="#e1e1e1" width="362">
                <SPAN class="text-mblack"><B>Karneval im
                Kanzlerland<BR>
                <A href="steuersong.htm" class="mlred">Der
                Steuersong:Tralala &agrave; la
                Ballermann?!</A></B><BR>
                Las Kanzlern bis die K&ouml;pfe bluten
                ..</SPAN></TD>
              </TR>

              <TR>
                <TD valign="top" bgcolor="#e1e1e1" width="50"><A
                href="terror-wellen-warnung.htm"><IMG height="40"
                width="50" src="mm_bush1h.gif" border="0"></A></TD>

                <TD valign="top" bgcolor="#e1e1e1" width="362">
                <SPAN class="text-mblack"><B>Weltpolitischer
                Schwachsinn<BR>
                <A href="terror-wellen-warnung.htm" class=
                "mlred">Warnung: Terrorwelle ersetzt Westerwelle
                ..</A></B><BR>
                .. und schwappt r&uuml;ber auf allen
                Kan&auml;len!</SPAN></TD>
              </TR>

              <TR>
                <TD valign="top" bgcolor="#e1e1e1" width="50"><A
                href="lieber-santa-george.htm"><IMG height="40"
                width="50" src="mm_bush1i.gif" border="0"></A></TD>

                <TD valign="top" bgcolor="#e1e1e1" width="362">
                <SPAN class="text-mblack"><B>Weltpolitischer
                Schwachsinn<BR>
                <A href="lieber-santa-george.htm" class=
                "mlred">Lieber Santa George!</A></B><BR>
                Von Ariel, seinem Wunschzettel und so
                ..</SPAN></TD>
              </TR>
            </TABLE>
          </CENTER>
          <HR>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

