<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="AUTHOR" content="Thomas Nawroth">
    <META name="DESCRIPTION" content="Ein Computer-Magazin von 1984">

    <TITLE>Happy Computer</TITLE>
  </HEAD>

  <BODY bgcolor="#fffff4" background="wolf1.gif">
    <TABLE border="0" summary="" width="100%" cellpadding="8">
      <TR>
        <TD>
          <CENTER>
            <IMG src="mm_hc05a.gif"><BR>
            <I>Folge 5</I>
          </CENTER>
          <HR>

          <P>Tonbandkassetten und Audiorecorder sind zwar billig -die langen
          Zugriffszeiten lassen aber auch bei Heimcomputer-Besitzern bald den Wunsch
          nach einem leistungsf&auml;higen Massenspeicher aufkommen. Floppy-Disk-
          oder Disketten-Laufwerke setzen sich deswegen immer st&auml;rker durch.</P>

          <H2 align="CENTER">Disketten, eine runde Sache</H2>

          <P>Im Jahr 1973 beschritt IBM bei der Massenspeichertechnik einen neuen
          Weg. Man beschichtete eine kreisf&ouml;rmige flexible Kunststoffscheibe mit
          der vom Tonband her bekannten Eisenoxidschicht und erhielt so die erste
          Diskette. Mit 8-Zoll Durchmesser schuf IBM einen Industriestandart, der im
          Datentr&auml;geraustausch zwischen Gro&szlig;rechenanlagen noch heute
          G&uuml;ltigkeit hat. Der weitgehenden Kompatibilit&auml;t stehen aber zwei
          Nachteile gegen&uuml;ber, die gerade im Heimbereich st&ouml;ren. Die
          8-Zoll-Laufwerke brauchen viel Platz und sind teuer. Als logische Folge
          wurde 1977 die 5 1/4-Zoll-Diskette entwickelt, die heute
          zahlenm&auml;&szlig;ig an der Spitze liegt. Auf ihr lassen sich je nach
          Computertyp und Speicherungsart Datenmengen von bis zu 3 MByte
          unterbringen.</P>

          <CENTER>
            <IMG src="mm_hc05c.gif">
          </CENTER>

          <P>Bei der Entwicklung der unterschiedlichen Laufwerke ging, wie in der
          Branche &uuml;blich die Kompatibilit&auml;t verloren. Unterschiedliche
          Spur- und Sektorzahlen, ein- oder zweiseitige Aufzeichnung mit einfacher
          oder doppelter Dichte sorgen f&uuml;r Unvertr&auml;glichkeit. Bei den
          neuesten Entwicklungen, den Minifloppys, einigte man sich noch nicht einmal
          auf einen Durchmesser. Die kleinsten Laufwerke arbeiten mit
          Disketten-Durchmesser von 3, 3 1/4 und 3 1/2 Zoll.</P>

          <P>Aber nicht nur in der Aufzeichnungsart und bei den Gr&ouml;&szlig;en
          gibt es Unterschiede zwischen den verschiedenen Typen. Zur Sektorierung
          stehen zwei verschiedene Arten zur Verf&uuml;gung. Bei hardsektorierten
          Disketten (Typ Shugart-Drive) werden eingestanzte L&ouml;cher optisch
          abgetastet und so die einzelnen Sektoren gefunden. Bei softsektorierung
          (IBM-kompatibel; bei Heimcomputern &uuml;bliche Form) werden die einzelnen
          Sektoren &uuml;ber einen speziellen "Daten-Vorspann" gesucht. Dieser
          Vorspann ben&ouml;tigt nat&uuml;rlich Speicherplatz, so da&szlig; die
          hardsektorierten Disketten in der Regel mehr Daten aufnehmen.</P>

          <CENTER>
            <IMG src="mm_hc05d.gif">
          </CENTER>
          <BR>
           

          <P>Die, verglichen mit Kassettenlaufwerken erheblich k&uuml;rzeren
          Zugriffs-, Lade- und Speicherzeiten und h&ouml;here Ladesicherheit haben
          den Diskettenlaufwerken auch zu einer starken Position am Heimcomputermarkt
          verholfen. W&auml;hrend ein Band immer erst zu der gesuchten Information
          vor. oder zur&uuml;cklaufen mu&szlig;, wird mit der Floppy-Disk jede Datei
          und gegebenenfalls jeder Datensatz nahezu direkt aufgerufen.</P>

          <P>Besonders wo man auf Daten zugreifen mu&szlig;, die rein physikalisch an
          verschiedenen Stellen stehen, zeigt sich die St&auml;rke der Diskette.
          Dateiverwaltungsprogramme sind mit einem Tonband nahezu undenkbar, denn ja
          nach Suchkriterium ben&ouml;tigt man verschiedene Informationen, die
          schnell gefunden werden m&uuml;ssen.<BR> Durch L&ouml;schen freigewordener
          Platz wird bei der Diskette sofort wieder ohne Reorganisierungsarbeit
          genutzt. Der Zeitvorteil, den die Floppy-Disk bietet, liegt in der gleichen
          Gr&ouml;&szlig;enordnung wie der Preisnachteil. Zehnmal so schnelle
          Zugriffszeit verursacht zehnmal so hohe Kosten beim Laufwerk.</P>

          <P>Die eigentliche Diskette ist eine d&uuml;nne Scheibe aus Kunststoff, die
          mit einem magnetisierbaren Film beschichtet ist. In einem Diskettenlaufwerk
          dreht sich diese Scheibe mit einer Geschwindigkeit von zumeist 300
          Umdrehungen pro Minute. In der Regel ist der Datentr&auml;ger in 35 (single
          density) oder 77 (double density) konzentrische Kreise (Spuren) eingeteilt,
          die wiederum in tortenst&uuml;ckf&ouml;rmige Sektoren unterteilt sind. Die
          Daten werden in Bl&ouml;cken (=Sektoren) von 128 oder 256 Byte
          abgespeichert, jeweils mit Angabe der Spur und Sektornummer als Adresse.
          Mit dem Schreib-/Lesekopf werden die Informationen auf die Diskette
          gespeichert, beziehungsweise von ihr gelesen. Der Kopf ist an einem Arm
          aufgeh&auml;ngt und wird durch einen eigenen Antrieb zur gew&uuml;nschten
          Spur gef&uuml;hrt. der gew&uuml;nschte Sektor wird durch die Drehung der
          Diskette erreicht. Das Prinzip der Abspeicherung ist das gleiche wie beim
          Tonbandger&auml;t. Durch Ausrichtung der magnetisierbaren Teile in der
          ferromagnetischen Schicht wird die Information gespeichert. Sie
          l&auml;&szlig;t sich beliebig oft lesen und wieder l&ouml;schen.</P>

          <CENTER>
            <IMG src="mm_hc05b.gif">
          </CENTER>

          <P>Um einen bestimmten Block zu finden und in den Computer einzulesen,
          ben&ouml;tigt man mit den heutigen Diskettenlaufwerken zwischen 100 und 350
          Millisekunden (mittlere Zugrffszeit). Abh&auml;ngig ist die
          Zugriffsgeschwindigkeit von der Bauart des Laufwerks. Die Diskette wird
          &uuml;ber eine Spindel angetrieben, die in das gro&szlig;e Loch in der
          Mitte der Diskette greift. Wie bei Plattenspielern der Teller kann diese
          Spindel entweder direkt oder mit einem Riemen angetrieben werden. Der
          Schreib-/Lesekopf wird meist mit einem digital gesteuerten Schrittmotor
          bewegt. Er liegt bei vielen Ger&auml;ten st&auml;ndig auf der Diskette auf.
          Bei anderen wird er nur zur Daten&uuml;bertragung - mittels eines
          Lademagneten - aufgesetzt. Bei der zweiten Methode ist die permanente
          Abnutzung geringer aber durch die st&auml;ndigen Aufsetzbewegungen die
          Gefahr der Zerst&ouml;rung einer Diskette gr&ouml;&szlig;er.</P>

          <P>Aus finanziellen Gr&uuml;nden versucht man die Laufwerke aus immer
          weniger Einzelteilen zu bauen. Nicht nur dem Preis, sondern auch der
          Zuverl&auml;ssigkeit kommt dies zugute. Bei dem Bestreben, die Abnutzung so
          gering wie m&ouml;glich zu halten, stehen heute verschiedene
          Konstruktionsprinzipien gegeneinander. Permanentes Drehen oder jeweiliges
          Hochfahren auf die n&ouml;tige Geschwindigkeit, st&auml;ndiges Aufliegen
          des Tonkopfes auf der Diskette oder nicht; jeder Hersteller verfolgt eine
          andere Philosophie.</P>

          <CENTER>
            <IMG src="mm_hc05e.gif">
          </CENTER>

          <P>Welches Fabrikat ein Anwender f&uuml;r seinen Computer benutzen kann,
          h&auml;ngt jedoch nicht nur von der Floppy-Station ab. Viel wichtiger sind
          der Controller und das DOS (Disc Operating System), welche die Verbindung
          zwischen Computer und Diskettenlaufwerk bilden. Hier mu&szlig; man sich
          wohl oder &uuml;bel mit dem anfreunden, was die einzelnen Hersteller
          anbieten. Das DOS kann im Betriebssystem realisiert sein (beispielsweise
          bei CP/M oder MS-DOS) oder - wie es Commodore macht - in die
          Diskettenstation selbst ausgelagert werden. Eine Realisierung mit Hilfe der
          zweiten Methode f&uuml;hrt zu computerspezifischen Diskettenlaufwerken -
          sicher besonders f&uuml;r den Produzenten empfehlenswert.</P>

          <P>Der Controller mu&szlig; auf den Computer speziell zugeschnitten sein.
          Hier ist der Anwender vollst&auml;ndig vom Computerhersteller oder einem
          Fremdanbieter abh&auml;ngig - ein Selbstbau oder eine &Auml;nderung im
          Controller ist nur etwas f&uuml;r Profis, die viel Zeit haben. Trotz des
          gro&szlig;en Angebots an Laufwerken stehen f&uuml;r die meisten
          Heimcomputer tats&auml;chlich nur wenige anschlu&szlig;fertige Ger&auml;te
          als Alternative zur Verf&uuml;gung (wenn es &uuml;berhaupt eine Auswahl
          gibt).</P>
          (hg)<BR>
          <HR>

          <P> In der n&auml;chsten NoCover gibt es einen Bericht &uuml;ber "DOS-XL" -
          einem alternativen Betriebssystem f&uuml;r ATARI.</P>
           

          <TABLE align="CENTER" border="3">
            <TR bgcolor="#ffffff">
              <TD><A href="mailto:">Thomas Nawroth</A></TD>
            </TR>
          </TABLE>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

