<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Gewicht im Griff
          </B></FONT></P>

          <P><IMG src="st_abn1.gif" width="290" height="410" align= "left" hspace="6"
          alt=""> Essen und Trinken ist ein gutes Beispiel f&uuml;r die "Kunst des
          Genie&szlig;ens". Was sich der Mensch einverleibt, kann Quell
          t&auml;glicher Freude sein, wenn das Schmausen f&uuml;r Gaumen- und andere
          Sinnesgen&uuml;sse sorgt und f&uuml;r Gem&uuml;tlichkeit und Lebenslust
          steht.</P>

          <P>80 Prozent der Deutschen bezeichnen sich als Genie&szlig;er und
          Genie&szlig;erinnen. Unabh&auml;ngig davon, was man genie&szlig;t, gibt es
          verschiedene Qualit&auml;ten. Der pure Genuss aus ganzem Herzen f&uuml;hlt
          sich anders an als der rein gewohnheitsm&auml;&szlig;ige oder gar der mit
          einem schlechten Gewissen verbundene. Findet sich h&auml;ufiger keine Zeit
          zum Essen und wird zu anderen Zeiten dann um so heftiger "zugeschlagen"
          oder ist des &ouml;fteren das Fleisch schw&auml;cher als der Geist willig,
          kann dies zu ungewolltem &Uuml;bergewicht f&uuml;hren. Dieses
          &Uuml;bergewicht kann nicht nur k&ouml;rperlich, sondern mit der Zeit auch
          psychisch zu einer (Dauer-)Belastung werden.</P>

          <P>Und wenn man sich dann (zu) dick f&uuml;hlt und mit den Schlanken und
          Sch&ouml;nen in der Werbung, in Filmen und Illustrierten vergleicht, dann
          soll das Angefutterte m&ouml;glichst ohne gro&szlig;e Einschr&auml;nkungen
          und vor allem schnell wieder runter. Dann verf&uuml;hrt erneut die x-te
          Di&auml;t, die wieder einmal 10 Pfund Gewichtsabnahme in 8 Tagen
          verspricht. Drei von vier Erwachsenen haben mindestens schon eine Di&auml;t
          durchgef&uuml;hrt und kennen von daher den Frust und die Entt&auml;uschung
          &uuml;ber fehlgeschlagene Versuche und das schlechte Gewissen.</P>

          <P>Dabei liegt die Schuld nicht unbedingt bei den Betroffenen selbst. Viele
          Di&auml;ten sind einseitig, schmecken nicht auf Dauer, &auml;ndern nichts
          am bisherigen und vielleicht ung&uuml;nstigen E&szlig;verhalten und liefern
          deshalb oft den Misserfolg gleich mit. Mit wiederholten "Wechselb&auml;drn"
          von Di&auml;tversuch und anschlie&szlig;ender Gewichtszunahme verwirren wir
          unseren Stoffwechsel, werden immer dicker und verlieren die
          tats&auml;chlichen Bed&uuml;rfnisse vollends aus den Augen.</P>

          <P>H&auml;ufig essen wir, weil wir Appetit, Stress, Freude, Kummer,
          Langeweile haben, oder wir essen aus Gewohnheit zu bestimmten Tageszeiten.
          Auch lassen wir uns durch &auml;u&szlig;ere Einfl&uuml;sse zum Essen
          anregen, durch die Duftfahne aus der B&auml;ckerei oder durch die nette
          Nachbarin, die wieder einmal Kuchen zum Probieren vorbeibringt.</P>

          <P>Richtigen Hunger haben wir heute selten. Wir lassen ihn kaum noch
          aufkommen und brauchen dies gl&uuml;cklicherweise auch nicht. Wie Hunger
          und S&auml;ttigung im Einzelnen reguliert werden kann, ist wissenschaftlich
          bis heute noch nicht endg&uuml;ltig gekl&auml;rt. Sicher ist jedoch, dass
          es im Gehirn ein Hunger- und S&auml;ttigungszentrum gibt.</P>

          <P>Hungersignale werden durch verschiedene innere Reize ausgel&ouml;st, die
          gr&ouml;&szlig;tenteils noch r&auml;tselhaft sind. Zwei wichtige Faktoren
          sind jedoch die Magendehnung durch volumin&ouml;ses, nicht aber unbedingt
          kalorienreiches Essen, sowie die Zusammensetzung der Nahrung. So
          k&ouml;nnen ein niedriger Blutzuckerspiegel und wahrscheinlich auch das
          Fehlen bestimmter Eiwei&szlig;bausteine Hungersignale ausl&ouml;sen.</P>

          <UL>
            Diese Mechanismen steuern das aktuelle Essbed&uuml;rfnis:

            <LI><B>S&auml;ttigung</B> wird beschrieben als Abwesenheit von Hunger bzw.
            als in der Weise gestillter Hunger, der sich im K&ouml;rper und Bewusstsein
            mit einem Gef&uuml;hl von Befriedigung, Sicherheit und Wohlbefinden
            breitmacht.</LI>

            <LI>Unter dem Begriff <B>V&ouml;llegef&uuml;hl</B> verstehen wir eine
            &Uuml;bers&auml;ttigung, die sich negativ mit Gef&uuml;hlen von Belastung,
            Unwohlsein bis an die Schmerzgrenze ausdr&uuml;ckt.</LI>
          </UL>

          <P>Nun ist es an der Zeit als erstes den eigenen K&ouml;rpersignalen
          bewusst mehr Aufmerksamkeit zu schenken und herauszufinden, wo und wann man
          Hunger, S&auml;ttigung und V&ouml;llegef&uuml;hl sp&uuml;rt. Hierf&uuml;r
          gibt es spezifische &Uuml;bungen, die ich aber hier an dieser Stelle nicht
          auswalzen m&ouml;chte. Die Essgewohnheiten geh&ouml;ren zu den stabilsten
          Verhaltensweisen des Menschen, da sie bereits in der Kindheit gepr&auml;gt
          werden. Sie zu &auml;ndern, erfordert Willen und Training und braucht seine
          Zeit und sollte in kleinen Schritten erfolgen.</P>

          <H3><B>Woher kommt mein &Uuml;bergewicht?</B></H3>

          <P>Die Ursache f&uuml;r &Uuml;bergewicht schien lange Zeit klar und ein
          schlichtes Bilanzproblem zu sein: Wer mehr isst, als der K&ouml;rper
          verbraucht, nimmt zu. Vor allem zuviel Fett schl&auml;gt sich gerne als
          P&ouml;lsterchen nieder. Mangelnde Bewegung ist ebenfalls ein wichtiger
          Grund. Aber es gibt auch individuelle Unterschiede im Umgang mit den
          Kolieren. Hier einige neuer Erkenntnisse dazu.</P>

          <H4><B>Die Macht der Gene</B></H4>

          <P>Etliche Untersuchungen best&auml;tigen den Einfluss von genetischen
          Faktoren bei der Entstehung von &Uuml;bergewicht, zu etwa der H&auml;lfte
          ist das Erbgut schuld. Gewisse K&ouml;rperkonstitutionen - wie etwa breite
          H&uuml;ften - und der Energieverbrauch (Grundumsatz), aber auch z.T. das
          Essverhalten werden vererbt. Eine Frau mit breiten H&uuml;ften und
          ung&uuml;nstiger Fettverwertung wird trotz aller Di&auml;ten nie eine
          Mannequinfigur erreichen. Aber: die Erbanlagen bestimmen nur, ob man dick
          werden kann. Ob man es auch wird und wie sehr, liegt an den Umweltfaktoren
          und die kann man mitgestealten. Der wichtigere Teil ist
          Selbstbestimmung!</P>

          <H4><B>Gute und schlechte Futterverwertung</B></H4>

          <P>Die ienen k&ouml;nnen schlemmen ohne zuzunehmen, die anderen werden
          schon beim Anblick von Essen dick. Ein schlanker K&ouml;rper kann eine
          &uuml;berreiche Mahlzeit oft kompensieren, in dem er mehr Kalorien
          verbrennt und die W&auml;rmeproduktion des K&ouml;rpers steigert.
          &Uuml;bergewichtige sind meist nicht in der Lage, &uuml;bersch&uuml;ssige
          Kalorien einfach "abzufackeln" und in Form von W&auml;rme verpuffen zu
          lassen.</P>

          <H4><B>Der Setpoint</B></H4>

          <P>Heute geht man davon aus, dass der K&ouml;rper sich bem&uuml;ht, sein
          Gewicht - in engen Grenzen -weitestgehend stabil zu halten. Diese
          Regulation &uuml;bernehmen verschiedene Proteine (z.B. Leptin), Rezeptoren
          im Fettgewebe und verschiedene Enzyme. St&ouml;rungen in diesen
          Regelkreisen, die auch genetisch bedingt sein k&ouml;nnen, f&uuml;hren
          wahrscheinlich zu &Uuml;bergewicht. Hier gibt es noch weiteren
          Forschungsbedarf. Auf jeden Fall lassen sich stabile
          Gewichtsver&auml;nderungen nur &uuml;ber einen l&auml;ngeren Zeitpunkt
          erreichen, Hau-ruck-Di&auml;ten bringen gar nichts.</P>

          <H4><B>Dick durch Di&auml;ten?</B></H4>

          <P>H&auml;ufige und drastische Di&auml;ten, die in wenigen Tagen eine
          Gewichtsabnahme von mehreren Kilos versprechen, lassen den K&ouml;rper
          glauben, es sei eine Hungersnot ausgebrochen. Er spart deshalb
          m&ouml;glichst viel Energie ein, der Grundumsatz sinkt. Der Organismus
          l&auml;uft auf Sparflamme. In Notzeiten war es sinnvoll, aber heute - bei
          Nahrungs&uuml;berangebot und geringer k&ouml;rperlichen Bewegung - ist es
          eher ein Nachteil. Nach Beendigung der Di&auml;t bleibt der niedriege
          Energiebedarf erst einmal bestehen. Isst man wieder normal, nimmt man jetzt
          besonders schnell zu.</P>

          <H4><B>Gest&ouml;rtes Hunger-S&auml;ttigungs-Gef&uuml;hl</B></H4>

          <P>Viele &Uuml;bergewichtige habemn das nat&uuml;rliche Gef&uuml;hl
          f&uuml;r Hunger und Sattsein verloren. Oft werden die Weichen daf&uuml;r
          bereits in der Kindheit gestellt. Wer als Kind seinen Teller immer leer
          oder sehr schnell essen musste, wer seine Portionsgr&ouml;&szlig;en nie
          selbst bestimmen durfte, l&auml;uft als Erwachsene/r Gefahr, dichk zu
          werden, weil die nat&uuml;rlichew Essbremse nicht mehr funktiioniert. Viele
          &Uuml;bergewichtige merken nicht (mehr), wann sie satt sind und reagieren
          verst&auml;rkt auf appetitanregende Au&szlig;enreize oder richten sich nach
          der Uhr, statt nach dem Knurrenb des Magens.</P>

          <P>Zu bedenken ist aber auch, dass verschiedene Lebensmittel
          unterschiedlich satt machen. Bei gleichem Kaloriengehalt k&ouml;nnen zwei
          Speisen gleich schnell s&auml;ttigen, die Sattheit h&auml;lt bei der einen
          aber l&auml;nger an. Fettreiches s&auml;ttigt schlechter als Kohlenhydrate
          und Ballaststoffe, wie z.B. in Vollkornbrot.</P>

          <P>&Uuml;brigens kann auch Stress Hunger ausl&ouml;sen, so wie er bei
          anderen Menschen auf den Magen schl&auml;gt.</P>

          <H4><B>Essen als Ersatz</B></H4>

          <P>Essen darf nicht zum Dreh- und Angelpunkt des Daseins werden und kein
          Ersatz f&uuml;r fehlende Zuwendung oder Ventil f&uuml;r &Auml;rger, Stress
          und Kummer sein. Dann hat Essen nichts mehr mit Genuss zu tun, sondern nur
          noch mit kurzfristiger Beruhigung, dem "Zustopfen" von Problemen und
          anschlie&szlig;endem schlechten Gewissen. Im schlimmsten Fall wird hier der
          Grundstein f&uuml;r eine Essst&ouml;rung gelegt. Derartige Gewichtsprobleme
          legen sich von alleine, wenn die eigentlichen Ursachen angepackt werden,
          notfalls zusammen mit einem Fachmann.</P>

          <P><A href="st_abn2g.gif" target="neu"><IMG src= "st_abn2.gif" width="125"
          height="150" align="left" hspace="6" alt="" border="2"></A> <FONT
          size="+1"><B>Die Ern&auml;hrungspyramide</B></FONT><BR> bietet eine
          Orientierung bei der Zusammenstellung der Vollwert-Ern&auml;hrung. Aus
          jeder Gruppe - au&szlig;er Fleisch, Fisch, Eier - sollte t&auml;glich etwas
          auf dem Speiseplan stehen. Die Mengen richten sich nach Tabellen, wie
          Abnehmen mit 1200 kcal pro Tag, 1500 kcal pro Tag oder 1700 kcal pro Tag.
          Um nicht zuweit auszuholen, werde ich nun nur Stichworte zu den einzelnen
          Kategorien geben:<BR clear="all"> <BR> <B>Gem&uuml;se und Kartoffeln</B>
          zeichnen sich durch ihren guten S&auml;ttigungswert und einen geringen
          Kaloriengehalt aus.</P>

          <P><B>Obst</B> ist besonders wegen seines hohen Vitamin-C und
          Kaliumgehaltes wichtig und kann ein guter Ersatz f&uuml;r
          S&uuml;&szlig;igkeiten sein. Obst sollte roh gegessen werden.</P>

          <P><B>Getreide und Getreideprodukte</B> sind die wichtigsten
          Kohlehydratlieferanten. Vollkonrmehl, Vollkornnudeln, Naturreis usw. sind
          gehaltvoller an w&uuml;nschenswerten Ballaststoffen, Vitaminen und
          Mineralstoffen und s&auml;ttigen besser und nachhaltiger als helle Brot-
          und Teigwaren.</P>

          <P><B>Milch, Milchprodukte, K&auml;se</B> sind die besten Calciumquellen
          und liefern wertvolles Eiwei&szlig;. Aber Vorsicht, verschiedene
          Fettangaben gerade bei Milchprodukten und K&auml;se k&ouml;nnen
          verwirren.</P>

          <BLOCKQUOTE>
            <P><B>"Fett i.Tr."</B> (Fettgehalt in Trockenmasse) gibt den
            Fettgehalt eines K&auml;&auml;ses nach Abzug des Wassergehaltes in Prozent
            an.</P>

            <P><B>Der absolute Fettgehalt</B> ist der tats&auml;chliche in einem
            Produkt. So hat z.B. eine Gouda mit 45% Fett i.Tr. einen tats&auml;chlichen
            Fettgehalt von etwa 28 Prozent.</P>

            <P><B>"Fettarm"</B> muss nicht gleich "arm an Kalorien" bedeuten. Eine
            "fettarme Dickmilch mit Fr&uuml;chten" z.B. kann in der zugegebenen
            Fruchtzubereitung viel Zucker enthalten und damit "unn&ouml;tige" Kalorien
            liefern. Ein mit frischem Obst selbstgemischter und event. mit Honig oder
            Zucker ges&uuml;&szlig;ter Naturjoghurt beugt da vor.</P>
          </BLOCKQUOTE>

          <P><B>Getr&auml;nke</B> sollen pro Tag ca 1,5 bis 2 Liter am Tag zu sich
          genommen werden. Zu bevorzugen sind nat&uuml;rlich Getr&auml;nke ohne
          Kalorien, wie Mineralwasser, Fr&uuml;chte- oder Kr&auml;utertee, schwarzer
          Tee und Kaffee.</P>

          <P><B>Fette</B> sind die Kalorienlieferanten Nummer eins. Als Grundregel
          gilt, mit allen Fetten sparsam umgehen. Die sichtbaren Fette (Butter,
          Margarine, &Ouml;le und Schmalz) k&ouml;nnen mit dem FdH-Prinzip im Zaum
          gehalten werden. Bei den sogenannten Halbfett butter oder Halbfettmargarine
          wird nur das zugemischte Wasser sehr teuer bezahlt. Die unsichtbaren Fetten
          in Wurst, K&auml;se, Fertigprodukten, S&uuml;&szlig;waren etc. und ihrer
          mengenm&auml;&szlig;igen Bedeutung kommt man am besten durch Studieren der
          Zusatzliste auf die Spur. Die einzelnen Zutaten sind in absteigender
          Reihenfolge (meist sehr klein geschrieben) aufgelistet.</P>

          <P><B>Fleisch, Fisch, Eier</B> sind traditionell die
          Eiwei&szlig;lieferanten. Auch hier gilt: weniger ist mehr.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

