<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>[ECHO]-Forum</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>[ECHO]-Forum</B></FONT></H1>

          <P>Ich habe ein neues Forum im Internet gegr&uuml;ndet. Das Forum selbst
          nennt sich [ECHO].</P>

          <P>Heute schon geBLINDzelt? - Einladung in unser [ECHO]-Forum</P>

          <P>[ECHO] ist der Treffpunk f&uuml;r H&ouml;rbuch- und H&ouml;rspielfreunde
          von www.BLINDzeln.de! Hier werden H&ouml;rb&uuml;cher und H&ouml;rspiele
          bewertet, empfohlen und die M&ouml;glichkeit zum Tausch und zu einer
          H&ouml;rbuchpatenschaft (ausschlie&szlig;lich Original-Tontr&auml;ger)
          geboten. Besonders eingeladen in diese Runde sind auch sehbehinderte und
          blinde Menschen. Alle Mitglieder dieses Forums werden BLINDzler genannt.
          Werde auch Du heute noch ein BLINDzler....</P>

          <P>Per EMail und online im Internet stehen allen BLINDzlern zudem viele
          Funktionen zur Verf&uuml;gung. So kann man seine Nachrichten nat&uuml;rlich
          auch &uuml;ber ein Webformular versenden, im Archiv &auml;ltere Nachrichten
          suchen und online lesen, es steht ein Textund Sprachbasierter Chat zur
          Verf&uuml;gung, eine Linkliste kann gemeinsam aufgebaut werden, Datenbanken
          und Umfragefunktionen k&ouml;nnen genutzt werden und ein gemeinsamer
          Kalender steht ebenfalls zur Verf&uuml;gung. Demn&auml;chst kommen noch
          kostenlose EMailadressen und Subdomains f&uuml;r jeden BLINDzler dazu.
          Interessiert?</P>

          <P>Wir m&ouml;chten Dich in unser Forum einladen. Sende  uns einfach eine
          EMail an:<BR>
          anmelden@blindzeln.de<BR>
          ...und Du kannst heute noch ein BLINDzler werden.</P>
          <HR width="60%">

          <P>Innerhalb der ersten zwei Tage haben sich bereits 34 Mitglieder
          versammelt. Zur Zeit geht der Einladungstext durch nahezu alle Foren, in
          denen sich sehbehinderte und blinde Menschen tummeln. Nach
          Einsch&auml;tzung einiger Mitglieder, die schon Jahre solche Foren nutzen,
          k&ouml;nnen es &uuml;ber 300 Mitglieder werden, wenn nur 2% sich aus
          anderen Foren auch bei uns anmelden.</P>

          <P>Es wird Kurzvorstellungen von H&ouml;rb&uuml;chern und H&ouml;rspielen
          geben - wahrscheinlich auch von MP3-Player, portablen CD-Playern etc. Diese
          Texte m&ouml;chte ich dann auch der NC zur Verf&uuml;gung stellen.</P>

          <P>Weiterhin ist im Registrierungsformular auch ein Punkt zum anhaken,
          womit man die NC abonnieren kann, so dass vermutlich auch Leser wieder
          dazukommen und wo mehr Leser, da auch mehr Schreiber. Mehr als hoffen, die
          Situation des Magazins dadurch deutlich zu verbessern habe ich
          nat&uuml;rlich nicht. Aber ich gebe noch lange nicht auf. Ich hoffe auch,
          dass Du (Wolf) noch etwas (geduldig) durchh&auml;lst.</P>

          <P>Herzliche Gr&uuml;&szlig;e<BR>
          Cord</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

