<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>NC-Rettung</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>NC-Rettung</B></FONT></H1>


          <P>Huhu,</P>

          <P>vielleicht kennen Einige von Euch schon das Onlinemagazin "NoCover". Es
          entstand vor sieben Jahren als reines Onlinemagazin f&uuml;r
          Amiga-Computeranwender. Mittlerweile wird es unter der Feder von Wolf
          Zimmer gef&uuml;hrt und hat sich zu einem allgemeinen Onlinemagazin von
          Computeranwender f&uuml;r Computeranwender entwickelt und ist offen
          f&uuml;r wirklich alle Themen.</P>

          <P>Erschienen ist jetzt die Ausgabe Nummer 107 und leider muss der Leser
          feststellen, dass es noch nie so wenig Artikel in diesem einstmals sehr
          guten und beliebten Online-Magazin gab. Wolf Zimmer ist gern bereit, sich
          die viele M&uuml;he auch weiterhin zu machen, aber es werden deutlich mehr
          Artikel ben&ouml;tigt, um das Magazin bunter und interessanter zu
          gestalten. Bei anhaltender Flaute eingesandter Artikel wird sich das
          Magazin &uuml;ber kurz oder lang nicht mehr halten k&ouml;nnen, weil
          niemand Lust hat, ein leeres Magazin zusammenzustellen.</P>

          <P>Daher diese EMail an Dich. Wenn Du Lust hast, Dich als Hobby-Redakteur
          ehrenamtlich zu versuchen, dann melde Dich doch bitte bei Wolf Zimmer
          wolf@wozim.de oder bei mir cordhagen@as-x.de per EMail. Du bist weder an
          Abgabetermine noch Themen oder sonst etwas gebunden. Schreib einfach
          &uuml;ber alles, woran Du Interesse hast oder was Dir auf dem Herzen liegt.
          &Uuml;ber Dein Hobby, &uuml;ber Internetseiten, die Du witzig oder
          interessant findst, &uuml;ber Hard- und Software - gleich, mit welchem
          System Du arbeitest oder spielst.</P>

          <P>Ob Rezepte, Deine Haustiere, Dein Auto, Deine Lieblingsmusik, politische
          Diskussionen, - was auch immer. Nichts kann so uninteressant sein, dass es
          andere Leser nicht interessieren k&ouml;nnte. Du kannst Deine Artikel
          selbst layouten (HTML) oder einfach als Text einsenden und wir
          &uuml;bernehmen das Layout. Viele ehemalige NoCover-Redakteure fanden so
          auch ihr Sprungbrett in den kommerziellen Redaktionsberuf. Die NoCover
          wartet auf Deinen ersten Artikel und braucht Deine Hilfe um ihrem Konzept
          gerecht zu werden - ein Magazin von Usern f&uuml;r User.</P>

          <P>Du kannst die NoCover nat&uuml;rlich auch kostenlos beziehen per
          EMailabo bei wolf@wozim.de oder auch im Internet online lesen unter
          http://www.apc-tcp.de/nocover.html</P>

          <P>Wir w&uuml;rden uns wirklich sehr freuen, wenn Du Lust hast, ein gutes
          Magazin aktiv zu unterst&uuml;tzen, damit die NoCover wieder so interessant
          und bunt gemischt an viele Leser gesendet werden kann, wie es fr&uuml;her
          der Fall war.</P>

          <P>Herzliche Gr&uuml;&szlig;e und vielen Dank f&uuml;r Dein Interesse,<BR>
          Cord Hagen</P>

          <HR>

          <P>.... diese EMail versandte ich Anfang Februar in der Hoffnung, die
          langatmige Flaute der NoCover wieder in den Griff bekommen zu k&ouml;nnen.
          Und tats&auml;chlich meldeten sich relativ viele Interessenten, die gern
          redaktionell f&uuml;r die gute alte NoCover t&auml;tig werden m&ouml;chten.
          Ich freue mich &uuml;ber diesen kleinen Erfolg und hoffe sehr, dass die
          NoCover damit wieder ein St&uuml;ck ihrer alten Beliebtheit zur&uuml;ck
          bekommen kann.</P>

          <P>Was ist geplant, wenn die NoCover wirklich wieder "genutzt" wird? Wenn
          ich merken sollte, dass es sich wieder lohnt, die NoCover zu
          unterst&uuml;tzen, dann m&ouml;chte ich das auch tun. Ich werde mich dann
          um ein virtuelles Zuhause der NoCover im Internet k&uuml;mmern. Die NC soll
          dann ihre eigene Homepage bekommen mit einem Downloadbereich, wo alle
          Ausgaben dann permanent zur Verf&uuml;gung stehen. Um den Traffic dann
          nicht aus den Augen zu verlieren, werden die Downloadarchive in einem
          Passwortgesch&uuml;tzten Bereich zur Verf&uuml;gung gestellt. Die
          Zugangsdaten kann man dann per EMail anfragen.</P>

          <P>Die Alternative sieht anders aus - sollte sich eine solch frustrierende
          Ausgabe, wie die NoCover 107 wiederholen, wird kaum noch jemand Lust haben,
          seine Freizeit f&uuml;r dieses Magazi zu opfern und &uuml;ber kurz oder
          lang k&ouml;nnte ich mir vorstellen, dass auch der gute Wolf die Lust
          verlieren k&ouml;nnte, dieses Magazin weiterhin zusammenzustellen.</P>

          <P>Also helft mit!<BR> Versucht regelm&auml;&szlig;ig etwas f&uuml;r Eure
          NoCover zu tun. Schreibt hin und wieder einen oder mehrere Artikel, fragt
          Eure Bekannten und Freunde, ob sie die NoCover nicht auch lesen
          m&ouml;chten. Ein Abo ist v&ouml;llig kostenlos und kann jederzeit bestellt
          und wieder abbestellt werden. Auch wenn Ihr weniger zu den Redakteuren
          geh&ouml;rt, k&ouml;nnt Ihr Euch bestimmt n&uuml;tzlich machen. Es wird
          Unterst&uuml;tzung gesucht, um das Magazin zu layouten und aus den
          eingesandten Textdateien eine ansprechende HTML-Seite zu gestalten. Wer
          lieber mit Grafiken arbeitet, kann auch hierbei mit grafischer Gestaltung
          helfen. Wer sich gern um die Homepage und deren Aktualisierung
          regelm&auml;&szlig;ig k&uuml;mmern m&ouml;chte, ist jederzeit herzlich
          Willkommen. Oder sucht weitere Helfer. Schnappt Euch den oberen Text und
          mailt ihn an Menschen oder Mailinglisten, von denen Ihr denkt, dass es
          f&uuml;r die Empf&auml;nger von Interesse sein k&ouml;nnte. Helfen kann
          Jeder unzwar immer!</P>

          <P>Die NoCover ist KEIN reines Amiga-Magazin mehr. Eine solch gravierende
          Einschr&auml;nkung w&uuml;rde sie nicht &uuml;berleben. Sie soll vielmehr
          ein vollkommen freies Onlinemagazin sein, indem es v&ouml;llig frei ist,
          welche Themen angesprochen werden. Es wurde noch nie ein Artikel
          zur&uuml;ck gewiesen und das wird es auch k&uuml;nftig nicht (bis auf
          allgemein &uuml;bliche gesetzliche Einschr&auml;nkungen). Also schreibt,
          was Euch gerade einf&auml;llt!</P>

          <P>Sollten wir der NoCover tats&auml;chlich zu einem "Neustart" verhelfen
          k&ouml;nnen, bekommen wir ein traditionelles und dennoch modernes
          Onlinemagazin, das nichts kostet, Menschen verbindet und sich mit allem
          besch&auml;ftigt, was den Leser interessiert. Ein Magazin von Anwender
          f&uuml;r Anwender!</P>

          <P>Euer Higgins<BR>
          Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

