<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Cyberkrieg</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>Cyberkrieg</B></FONT></H1>

          <P>Hier einmal ein interessanter Beitrag aus der letzten CoKO:</P>

          <P><B>Kriegsschauplatz im Internet</B></P>

          <P>Das Pentagon beginnt mit den Vorbereitungen f&uuml;r den elektronischen
          Krieg. Dass zuk&uuml;nftige Konflikte auch Informationsinfrastrukturen als
          Ziele und Schaupl&auml;tze kriegerischen Handelns einschlie&szlig;en, folgt
          der kalten Logik der Milit&auml;rs. Bei einem m&ouml;glichen Krieg gegen
          den Irak k&ouml;nnte auch das Internet eine der Fronten sein.</P>

          <P>Die Haager Landkriegsordnung sollte Vorbild sein f&uuml;r die
          Richtlinien eines Cyber-Kriegs, so forderte Anfang vergangener Woche der
          US-amerikanische Verteidigungsminister Donald Rumsfeld. Auch im Netz
          m&uuml;sse nach den Regeln zivilisierter L&auml;nder gek&auml;mpft werden.
          Daher br&auml;uchten die Milit&auml;rs, ebenso wie bei der Vorbereitung des
          Einsatzes von Atomwaffen, klare Anweisungen. Bei einem m&ouml;glichen Krieg
          gegen den Irak sollen diese Cyberkrieg-Regeln nun erstmalig angewendet
          werden.</P>

          <P>Auch ein elektronischer Krieg l&auml;uft nach genau kalkulierten
          Pl&auml;nen und Strategien ab, so sehen es zumindest Planer des Pentagon.
          Im Kern steht dabei eine in mehreren Stufen gegliederte
          Eskalationsstrategie. So sieht eine fr&uuml;he Phase vor, Bankkonten von
          Saddam Hussein und seiner Familie im Ausland digital zu pl&uuml;ndern.
          Entgegen juristischer Bedenken selbst unter US-Experten existieren dazu
          bereits fertig ausgearbeitete Planungen, um in Bankennetze einzudringen und
          Konten zu leeren. Die n&auml;chste Stufe auf der Skala der virtuellen
          Kriegsf&uuml;hrung sieht dann etwa vor, Stromnetze im Irak per Software
          lahm zu legen und so Milit&auml;rst&uuml;tzpunkte regelrecht abzuschalten.
          Dazu geh&ouml;rt ein ganzes Arsenal von Viren, W&uuml;rmern und
          trojanischen Pferden genauso wie der Einsatz spezieller Flugzeuge. So
          genannte EC-130-Fliegern sollen die Server der irakischen Luftabwehrsysteme
          und Infrastrukturrechner mit Mikrowellen st&ouml;ren und ausschalten.
          Entsprechende Versuche unternahm das europ&auml;ische Oberkommando der US
          Army in Stuttgart bereits vor einigen Monaten und kam zu dem Schluss, dass
          entsprechende Mikrowellenwaffen einsatzbereit seien Doch auch dem Gegner
          sind seine digitalen Schwachstellen nicht verborgen geblieben. So baute der
          Irak bereits im Krieg gegen den Iran -ironischerweise mit der
          Unterst&uuml;tzung durch die Vereinigten Staaten - ein eigenes
          Milit&auml;rnetz auf. Das hochmoderne Glasfasernetz umspannt den gesamten
          Irak und wurde offenbar in den vergangenen Jahren extrem intensiv gewartet.
          Dies belegen Untersuchungen von UN-Inspektoren. Bereits im ersten Golfkrieg
          versuchte die Allianz gegen den Irak, mit Bombardements und auch gezielten
          Angriffen durch "Cyber-Kommandos" die elektronische Infrastruktur zu
          vernichten. So bohrte eine Einheit des britischen Special Air Service
          damals Datenleitungen einer Superkanonenstellung im S&uuml;d-Irak vor Ort
          an, um dar&uuml;ber eine Verbindung nach Saudi-Arabien aufzubauen und die
          Luftabwehr dieser Gesch&uuml;tzstellung auszuschalten. Quasi per
          Fernbedienung wurden die Server der Flugabwehr vor einem Luftangriff
          einfach heruntergefahren. &Uuml;ber die verschiedenen Softwarewaffen des
          US-Milit&auml;rs ist indes nur sehr wenig bekannt, da sie einer noch
          strengeren Geheimhaltung unterliegen als Biooder Atomwaffen. Doch deuten
          die wenigen Informationen aus Pentagon und dem europ&auml;ischen
          Oberkommando EUCOM tats&auml;chlich auf ein ganzes Arsenal. Neben
          herk&ouml;mmlichen Angriffsprogrammen, wie sie auch von Hackern eingesetzt
          werden, also Viren, W&uuml;rmer, Trojanische Pferde, Denial of Servcie
          Attacken, gezieltem Aussp&auml;hen von Datenvermittlungsstellen und dem
          Angriff mit so genannten Hacker-Agenten, spielt vor allen Dingen das
          Abh&ouml;ren des Datenverkehrs eine gro&szlig;e Rolle. So verf&uuml;gen die
          USA noch aus dem ersten Golfkrieg Daten-Links, die Zugang zum irakischen
          Milit&auml;rnetz verschaffen. Auch gab das Pentagon zu, dass einheimische
          Mitarbeiter f&uuml;r die US-Beh&ouml;rden weitere Netzwerkverbindungen
          einrichteten. Teilsweise stammten jene Informationen, die
          US-Au&szlig;enminister Colin Powell vergangene Woche dem Weltsicherheitsrat
          vorlegte, aus solchen Quellen.</P>

          <P>Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

