<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Der Schwarzseher Teil 2</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H2 align="center"><FONT color="#ffff00"><B>Brief eines Strohwitwers an
          seine Frau</B></FONT></H2>

          <P>Alles in Ordnung, liebe Gerda!</P>

          <P>Herzlichen Dank f&uuml;r Deinen lieben Brief. Du brauchst Dir wirklich
          keine Sorgen um mich zu machen. Es ist alles in Ordnung. Das Essen koche
          ich selbst, und ich staune t&auml;glich mehr, wie gut es doch klappt.
          Mittlerweile kann ich es essen ohne das mir anschlie&szlig;end im
          Krankenhaus der Magen ausgepumpt werden muss.</P>

          <P>Da es oft schnell gehen mu&szlig; (wie beim Sex), habe ich mir gestern
          Bratkartoffeln gemacht. M&uuml;ssen die Kartoffeln eigentlich gesch&auml;lt
          werden? Zwischendurch war ich Bier....&auml;h.....Br&ouml;tchen holen. Nach
          meiner R&uuml;ckkehr war die Emaille in der Pfanne geschmolzen. Ich habe
          nie geglaubt, dass sie so wenig widerstandsf&auml;hig ist.</P>

          <P>Der Rauch in der K&uuml;che ist schon wieder abgezogen, aber die Katze
          ist schwarz wie ein Rabe und hustet. Seither ergreift sie panikartig die
          Flucht, wenn ich nur den Herd anschalte oder mit den Pfannen klappere. Da
          ich wenigstens einmal am Tag was warmes zu Essen brauche, wie du ja
          wei&szlig;t l&auml;&szlig;t sich Katze mittlerweile gar nicht mehr
          blicken!</P>

          <P>Sag mal, wie lange mu&szlig; man eigentlich Eier kochen? Ich habe sie
          zwei Stunden gekocht, aber sie waren nicht weich zu kriegen. Schreib mir
          doch mal, ob man angebrannte Milch noch verwenden kann. Soll ich sie
          aufheben, bist Du wiederkommst?</P>

          <P>Hatte leichte Probleme mit dem Gulasch, habe mir eine Dose warmgemacht.
          Doch leider ist sie in der Mikrowelle explodiert. Die T&uuml;r der
          Mikrowelle wurde durch's Fenster geschleudert und unser sch&ouml;nes
          Gew&auml;chshaus ist leider kaputt.....das Fenster auch. Da es geschlossen
          war (Muss ich immer, wenn ich koche, sonst r&uuml;ckt wieder die Feuerwehr
          aus) wurde es mit dem Rahmen komplett rausgerissen, die Druckwelle war
          gewaltig. Die Dose dagegen ging ab wie ein Z&auml;pfchen, senkrecht nach
          oben, durchschlug die Decke und traf die kleine 13j&auml;hrige Tochter von
          Herrn Bauer, der &uuml;ber uns wohnt genau zwischen die Beine. Sie war
          gerade beim Klavierspielen, ihr iss nix passiert, aber dem Klavierlehrer
          hat's 4 Finger abgerissen!</P>

          <P>Hast Du auch schon mal gehabt, da&szlig; Dir schmutziges Geschirr
          verschimmelt ist? Wie ist das nur in so kurzer Zeit m&ouml;glich? Du bist
          doch kaum vier Wochen fort. Hinter dem Sp&uuml;lstein lebt alles, da
          kannste "BREHMS TIERLEBEN" drehen. Wo kommt dieses Krabbelgetier her? Hast
          du die da etwa deponiert?</P>

          <P>Habe mich dann doch endlich dazu hinrei&szlig;en lassen und das Geschirr
          gesp&uuml;lt. Bitte schimpf nicht mein Schatz, aber das gute Porzellan von
          Oma ist hin. H&auml;tte nicht gedacht, sah doch so stabil aus, war wohl ein
          bisschen viel, 1000 Umdrehungen in der Waschmaschine. Die ist &uuml;brigens
          auch hin&uuml;ber, das gro&szlig;e Schlachtermesser hat beim Schleudern
          leider die Trommel ein wenig besch&auml;digt......und steckt jetzt in der
          Wand, das Messer, nicht die Trommel. Denn die hat die 300er Ziegelwand
          durchschlagen und liegt irgendwo drau&szlig;en sinnlos herum!</P>

          <P>Beim Essen habe ich leider den Wohnzimmerteppich eingesaut, mit
          Tomatenso&szlig;e. Du sagtest mir immer, das Tomatenso&szlig;e nicht mehr
          rausgeht. Da hast du dich geirrt, mein Liebling, die ging wunderbar raus,
          die Haare des Teppichs auch. Ich h&auml;tte doch wohl keine
          Nitroverd&uuml;nnung nehmen d&uuml;rfen!</P>

          <P>Den K&uuml;hlschrank habe ich auch abtauen m&uuml;ssen. Du bist da immer
          so ungeschickt, das Eis geht wunderbar ab mit einer Maurerkelle. Nur
          komischerweise heizt er jetzt. Auf jeden Fall ist das Fleisch gut durch.
          Joghurt, Sekt und Mineralwasser auch, alles explodiert!</P>

          <P>Mein Liebling! Am Donnerstag habe ich vergessen, die Wohnung
          abzuschlie&szlig;en. Es mu&szlig; jemand da gewesen sein, denn es fehlen
          einige Wertgegenst&auml;nde, aber Geld allein macht ja nicht
          gl&uuml;cklich, wie Du immer sagst.</P>

          <P>Der Kleiderschrank ist auch leer, aber es kann ja nicht viel drin
          gewesen sein, denn Du hast Dich ja immer beklagt, da&szlig; Du nichts zum
          Anziehen hast.</P>

          <P>Als ich gestern abend die Kaninchen f&uuml;ttern wollte, ist mir die
          Kerze umgefallen. Im Nu stand alles in Flammen. Ich hatte M&uuml;he, die
          Futtern&auml;pfe zu retten. Die H&auml;schen sind alle sch&ouml;n braun
          gebraten. Wir wollten sie ja sowieso schlachten. Hoffentlich halten sie
          sich, bis Du zur&uuml;ckkommst!</P>

          <P>Tja, wie du dir vorstellen kannst sah danach die Wohnung nicht mehr so
          aus wie du sie in Erinnerung hast. Ich musste alle Zimmer neu tapezieren,
          war 'ne schei&szlig; Arbeit zwischen den Tapetenbahnen einen
          Rei&szlig;verschluss einn&auml;hen. Da ich aber nicht soviel
          Rei&szlig;verschl&uuml;sse hatte, besser gesagt du nicht in deinem
          N&auml;hk&auml;stchen habe ich sie kurzerhand angenagelt.....die Tapeten,
          nicht die Rei&szlig;verschl&uuml;sse!</P>

          <P>Ach so, die N&auml;hmaschine ist auch Schrott. Ich h&auml;tte die
          Tapeten wohl doch lieber erst nach dem Ann&auml;hen der
          Rei&szlig;verschl&uuml;sse einkleistern sollen. Beim Tapezieren ist mir
          leider die Leiter umgefallen und hat das 4000Liter Aquarium
          zertr&uuml;mmert. Dadurch ist die Wohnung unter uns, die wir erst neu
          renoviert haben komplett abgesoffen. Jeder Depp wei&szlig;, dass Wasser dem
          Elektro-Strom nicht gut tut.</P>

          <P>Bei den Wasserspielen entstand leider ein Kurzschlu&szlig;,
          tragischerweise stand unser sch&ouml;nes Haus schon wieder in Flammen. Beim
          L&ouml;schen soff die Parterrewohnung vollkommen ab, der Keller ebenfalls.
          Dort stand das Wasser schon &uuml;ber einen Meter hoch.</P>

          <P>Da die Sicherungsk&auml;sten alle ausnahmslos im Keller sind,
          Kurzschluss, Bude brannte wieder lichterloh!</P>

          <P>Die Feuerwehr meint, dass sich l&ouml;schen nicht mehr lohnt und lies
          die Bude komplett abfackeln. Leider hatten die den Gasanschluss vergessen,
          der sich auch im Keller befand. Doch ich hatte Gl&uuml;ck im Ungl&uuml;ck,
          die gewaltige Explosion pustete das Feuer innerhalb k&uuml;rzester Zeit
          wieder aus.......den H&auml;userzug in der umliegenden Gegend &uuml;brigens
          auch!</P>

          <P>So sitze ich hier vor dem gro&szlig;en Loch, dass mal unser Haus war und
          schreibe dir diesen Brief. Hoffe du machst dir keine Sorgen um mich, hier
          ist alles klar, es geht mir gut. Da ich bei der ganzen Hektik irgendwie
          vergessen habe, die Versicherung zu bezahlen zahlt folglich die
          Versicherung auch nicht.</P>

          <P>Wir m&uuml;ssen ein wenig sparen um uns ein neues H&auml;uschen leisten
          zu k&ouml;nnen.</P>

          <P>Du wirst putzen gehen m&uuml;ssen, mein Schatz!</P>

          <P>Damit will ich diesen Brief schlie&szlig;en, morgen mehr. Ich hoffe,
          da&szlig; Du Deine Kur in sorgloser Ruhe und Freude genie&szlig;t.</P>

          <P>Viele herzliche Gr&uuml;&szlig;e von Deinem Erwin!</P>

          <P>PS: Als deine Mutter von diesem Ungl&uuml;ck erfahren hat, hat sie glatt
          der Schlag getroffen. Die Beerdigung war gestern, habe es dir nicht gesagt
          um dich nicht unn&ouml;tig zu beunruhigen. Du bist ja auf Kur und sollst
          dich erholen!</P>

          <P>Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

