<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Fastnacht</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>Das ABC der
          Fassenacht</B></FONT></H1>

          <P><B>APPLAUS</B><BR>
          Gleichm&auml;&szlig;iges Zusammenschlagen der Pranken -wird bevorzugt von
          stark angetrunkenen Sitzungsteilnehmern/innen ausgef&uuml;hrt, um die meist
          durchgeknallten B&uuml;hnenanimateure zu weiteren H&ouml;chstleistungen
          anzutreiben - die Wirkung ist meist sogar erfolgreich.</P>

          <P><B>B&Uuml;TTENREDNER</B><BR>
          Verbl&ouml;deter Profilneurotiker, der jedes Mal uralte Witze in
          ver&auml;nderter Form dem meist an fortgeschrittener Alzheimer leidenden
          Sitzungspublikum vortr&auml;gt, das dar&uuml;ber auch immer wieder
          lacht.</P>

          <P><B>ELFERRAT</B><BR>
          Eine Zusammenrottung von 11 Pantoffelhelden - die jede Gelegenheit
          benutzen, durch anberaumte Sitzungstermine ihren meist dominanten Ehefrauen
          zu entgehen! Bedingung f&uuml;r eine Teilnahme im Elferrat: absolute
          Trinkfestigkeit!</P>

          <P><B>FUNKENMARIECHEN</B><BR>
          als Tanzdarbietung getarnte Aufgeilm&ouml;glichkeit f&uuml;r sabbernde
          P&auml;derasten. Blutjunge M&auml;dchen pr&auml;sentieren Bein und
          Schl&uuml;pfer zu flotter Marschmusik. In kinderarmen Regionen h&auml;ufig
          ersetzt durch &uuml;berbreite Hausfrauen mit Plockwurststelzen in
          Satin-Pelle.</P>

          <P><B>GOTTLIEB WENDEHALS, DAS</B><BR>
          tragische Figur aus der griechischen Mythologie, in karierter Jacke mit
          Bratenfett im Haar, der f&uuml;r die Erfindung der Polon&auml;se Blankenese
          von den G&ouml;ttern dazu verflucht wurde, bis ans Ende aller Tage auf dem
          Boden herumzurutschen und doofe Lieder zu johlen, die niemand h&ouml;ren
          m&ouml;chte. Eng befreundet mit einem Gummihuhn.</P>

          <P><B>KARNEVALSPRINZ</B><BR>
          Vollidiot, der aus einer geschlossenen Abteilung entflohen ist und auf
          allen Veranstaltungen in Strumpfhosen herumrennt, sich dauernd betrinken
          mu&szlig; und am Ende alles auch noch bezahlt. Darf meistens nach der
          Session zur&uuml;ck in die Zwangsjacke!</P>

          <P><B>KONFETTI, DAS bunte</B><BR>       
          Jeckengehirn-Nachbildung in Orginalgr&ouml;&szlig;e. (Querverweis --
          Gehirn: rudiment&auml;r entwickeltes Restorgan im Sch&auml;del,
          ungef&auml;hr 15 cm &uuml;ber der Bier-Einf&uuml;ll&ouml;ffnung. Funktion
          unbekannt.)</P>

          <P><B>PRINZENGARDE</B><BR>

          Frustrierter M&auml;nnerbund von gescheiterten Existenzen, die den Sprung
          in den Elferrat nicht geschafft haben. Die Prinzengarde zeichnet sich in
          jeder Session besonders durch gelangweiltes Herumstehen auf der B&uuml;hne,
          Bewegungsarmut und v&ouml;llige Desorientierung aus.</P>

          <P><B>RIO DE JANEIRO</B><BR>

          zauberhafter Ort aus der Sagenwelt, an dem nach der Vorstellung
          l&uuml;sterner Abteilungsleiter das ganze Jahr &uuml;ber nackte Exotinnen
          durch die Fu&szlig;g&auml;ngerzone tanzen, die vom Sex mit dicken Touristen
          tr&auml;umen.</P>

          <P><B>SCHUNKELN</B><BR>

          T&auml;tigkeit. Arhythmisches Hin- und Hergeruckel nebeneinandersitzender
          Gummizellenbewohner (siehe auch --Rinderwahnsinn). Erinnert an ein
          Altenheim zur Mittagszeit, in dem 80% der Patienten der Katheter geplatzt
          ist.</P>

          <P><B>TUSCH, DER</B><BR>

          akustische Aufforderung zu k&uuml;nstlichem Gel&auml;chter und
          Zwangsapplaus. Markiert die Stelle im Text, wo eine Pointe h&auml;tte sein
          k&ouml;nnen.</P>

          <P><B>ZOTE, DIE</B><BR>

          (siehe auch -- Versauter Witz) schmieriger Scherz aus dem
          Uro-Genitalbereich, bevorzugt vorgetragen von besoffenen Messeg&auml;sten
          oder verklemmten Spie&szlig;b&uuml;rgern, die sich nicht trauen, laut das
          Wort 'ficken' auszusprechen und deshalb ihre Umwelt mit schl&uuml;pfrigen
          Zweideutigkeiten bel&auml;stigen.</P>

          <P>Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

