<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Online-Entwicklung
          </B></FONT></P>

          <H3 align="center"><B>Das Internet wird zum Massenmedium</B></H3>

          <P>Der Internet-Boom der vergangenen Jahre hat sich zwar abgeschw&auml;cht,
          aber die Zahl der Internet-Nutzer w&auml;chst weiter. Mittlerweile
          verf&uuml;gt bereits die H&auml;lfte der erwachsenen Deutschen &uuml;ber
          einen eigenen Internet-Zugang. Tendenz weiter steigend.</P>

          <P>Basis dieses Beitrags sind regelm&auml;&szlig;ige Erhebungen der
          Forschungsgruppe Wahlen zu Umfang und Struktur der Internet-Nutzung in
          Deutschland. F&uuml;r das vierte Quartal 2002 wurden insgesamt 3.826
          Personen ab 18 Jahre telefonisch befragt.</P>

          <P>Noch kann das Internet nicht mit der potenziellen Reichweite der
          klassischen Massenmedien mithalten. Die st&uuml;rmische Ausbreitung, die
          das Internet innerhalb nur weniger Jahre erfahren hat, zeigt aber, dass
          sich dies in nicht allzu ferner Zukunft &auml;ndern d&uuml;rfte. Inzwischen
          hat immerhin schon jeder zweite Bundesb&uuml;rger - 52 Prozent im Westen
          der Republik und 43 Prozent im Osten - Zugriff auf das Internet. Anfang
          1999 - das ist gerade einmal vier Jahre her - hatte kaum mehr als jeder
          Zehnte Internet-Zugang.</P>

          <P>Noch immer ist die Internet-Nutzung eine Frage des Alters, wenngleich
          dieser Aspekt l&auml;ngst nicht mehr so ausschlaggebend ist wie in der
          Anfangsjahren des Mediums, als es fast ausschlie&szlig;lich von den ganz
          Jungen, haupts&auml;chlich von Studenten, genutzt wurde. Inzwischen haben
          die mittleren Altersgruppen aufgeholt. So erreicht der Anteil der Nutzer in
          den Altersgruppen der 30- bis 39-J&auml;hrigen beziehungsweise der 40- bis
          49-J&auml;hrigen mit um die 70 Prozent &auml;hnlich hohe Werte wie bei den
          18- bis 24-J&auml;hrigen oder den 25- bis 29-J&auml;hrigen. Sogar in der
          Gruppe der 50- bis 59-J&auml;hrigen wird mit einem Anteil von 49 Prozent noch
          ann&auml;hernd der Durchschnittswert der Gesamtbev&ouml;lkerung erreicht;
          bei den &uuml;ber 60-J&auml;hrigen f&auml;llt der Anteil dann allerdings
          sehr deutlich ab: mit 16 Prozent ist in dieser Altersgruppe erst jeder
          Sechste im Internet unterwegs.</P>

          <P>In geschlechtsspezifischer Hinsicht gilt weiterhin, dass deutlich mehr
          M&auml;nner das Internet nutzen als Frauen - 58 Prozent gegen&uuml;ber 43
          Prozent. Unver&auml;ndert spielt auch die formale Bildung eine wichtige
          Rolle daf&uuml;r, ob jemand &uuml;ber einen Internet-Zugang verf&uuml;gt.
          So sind nur 15 Prozent der erwachsenen Deutschen mit Hauptschulabschluss
          ohne Lehre im Internet pr&auml;sent und 30 Prozent jener mit
          Hauptschulabschluss mit Lehre. Von den Erwachsenen mit Mittlerer Reife sind
          aber bereits 52 Prozent und von jenen mit Hochschulreife sogar 75 Prozent
          mit einem eigenen Internet-Zugang ausgestattet.</P>

          <P>Aufgrund ihrer beruflichen Nutzung sind die Selbstst&auml;ndigen am
          h&auml;ufigsten im Netz erreichbar - 67 Prozent - w&auml;hrend der Anteil
          der ungelernten Arbeiter, die &uuml;ber einen Internet-Zugang
          verf&uuml;gen, mit 15 Prozent noch immer sehr niedrig ist. Die Facharbeiter
          sowie die einfachen und mittleren Angestellten und Beamten konnten im Laufe
          des letzten Jahres<BR> h&ouml;h ere Zuw&auml;chse verbuchen. Heute nutzen
          35 beziehungsweise 52 Prozent jener Berufsgruppen das Internet als
          Kommunikationsmedium.</P>

          <P>Die untersuchten Aspekte des Nutzungsverhaltens haben sich kurzfristig,
          das hei&szlig;t im Vergleich zu vor einem Jahr, kaum ver&auml;ndert: Das
          Online-Brokerage hat parallel zu dem zuletzt schwierigen B&ouml;rsenumfeld
          ebenso wie das Abrufen von Wirtschafts- und B&ouml;rsennachrichten leicht
          an Attraktivit&auml;t verloren. Der Anteil derer, die Homebanking
          betreiben, ist hingegen stabil geblieben beziehungsweise sogar leicht
          gestiegen. Etwas kr&auml;ftiger zugelegt haben der Online-Einkauf und das
          damit verbundene Vergleichen von Produktpreisen im Internet.</P>

          <P>Diese Entwicklung der Online-Aktivit&auml;ten lassen zwar nicht gerade
          die Internet-Euphorie vergangener Zeiten wieder aufleben - das w&auml;re
          auch v&ouml;llig verfehlt - aber sie stimmen dennoch zuversichtlich, dass
          sich bei einer Verbesserung des allgemeinen wirtschaftlichen Umfelds - auch
          an den B&ouml;rsen -wieder st&auml;rkere Wachstumsimpulse einstellen
          werden.</P>

          <P>Auszugsweise aus www.bankenverband.de</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

