<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
  <P><FONT size="-1">Bildschirm zu <A href="st_konjunktur.html" target="_top"><B>klein?</B></A>
  &nbsp; &nbsp; &nbsp; und wieder <A href="javascript:history.back()"><B>r&uuml;ckg&auml;ngig?</B></A>
  &nbsp; &nbsp; &nbsp; oder zur&uuml;ck zur <A href="index.html" target="_top"><B>NoCover?</B></A></FONT></P>
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Konjunktur</B></FONT></P>

          <P>Zum Jahreswirtschaftsbericht der Bundesregierung vom
          29. Januar&nbsp;2003<BR>
          Der Jahreswirtschaftsbericht der Bundesregierung ist alles in allem eine
          ungeschminkte Beschreibung der wirtschaftlichen Lage in Deutschland. Mit
          einer Wachstumsprognose von rund 1 % liefere er eine optimistische, aber
          durchaus noch im Bereich des M&ouml;glichen liegende Einsch&auml;tzung der
          Wachstumsperspektiven f&uuml;r die deutsche Wirtschaft, so die Fachleute.
          Der Bericht zeige die Notwendigkeit umfassender Ver&auml;nderungen am
          Arbeitsmarkt und in den Sozialversicherungen. Damit sind laut Bankenverband
          wichtige Reformen zur Wiedererlangung der Wachstumsdynamik benannt. Nun
          kommt es darauf an, die Hausaufgaben zu machen und den Worten Taten folgen
          zu lassen, so Dr. Manfred Weber, BdB-Hauptgesch&auml;ftsf&uuml;hrer und
          Mitglied des Vorstands.</P>

          <P>Die unvermeidlichen Reformen m&uuml;ssten jetzt endlich in einem
          umfassenden Gesamtkonzept angegangen werden. Die Politik der "partiellen
          Eingriffe" helfe jedenfalls nicht mehr weiter. Mehr noch: Die positiven
          Reformelemente wie zum Beispiel die Einf&uuml;hrung der Abgeltungsteuer und
          die Umsetzung der Vorschl&auml;ge der Hartz-Kommission w&uuml;rden immer
          wieder durch wachstumshemmende Entscheidungen an anderer Stelle
          konterkariert. So bringe das "Steuerverg&uuml;nstigungsabbaugesetz"
          insgesamt neue Belastungen. Auch am Arbeitsmarkt sei ein ernsthafter Wille
          zur Reduzierung der Lohnnebenkosten weiterhin nicht erkennbar. &Auml;hnlich
          wie ein Autofahrer nicht vorankommt, wenn er gleichzeitig auf das Gas- und
          Bremspedal tritt steht sich die Wirtschaftspolitik der Bundesregierung noch
          zu oft selbst im Weg.</P>

          <P>Um das im Jahreswirtschaftsbericht anvisierte Ziel einer deutlichen
          Senkung der Abgabenquote zu erreichen, sei es unverzichtbar, die
          Beitragss&auml;tze zu den Sozialversicherungen von derzeit rund 42 auf
          unter 40 % zu senken. Der bislang recht unpr&auml;zise Arbeitsauftrag der
          R&uuml;rup-Kommission m&uuml;sse daher in diesem Sinne dringend
          konkretisiert werden.</P>

          <UL>
            <LI>Die Konjunktur in Deutschland befindet sich zum Jahresbeginn in
            einer sehr schwachen Verfassung. Nach vorl&auml;ufigen Berechnungen
            d&uuml;rfte das Wirtschaftswachstum Ende 2002 zum Stillstand gekommen sein.
            Au&szlig;erdem lassen sich bei den konjunkturellen Fr&uuml;hindikatoren
            nach wie vor keine Signale f&uuml;r eine konjunkturelle Trendwende
            erkennen. Die leichte Erholung der Auftragseing&auml;nge und die
            geringf&uuml;gige Besserung der Gesch&auml;ftserwartungen k&ouml;nnen
            allenfalls als vorsichtige Zeichen einer allm&auml;hlichen Stabilisierung
            interpretiert werden. Und das hei&szlig;t zurzeit: Fortsetzung der
            wirtschaftlichen Stagnation bis ins zweite Quartal hinein.</LI>

            <LI>Die Hoffnung auf ein Anziehen der deutschen Konjunktur in der zweiten
            Jahresh&auml;lfte beruht ausschlie&szlig;lich auf einer besseren
            Exportentwicklung. Dies setzt jedoch eine Abnahme der geopolitischen
            Risiken und ein st&auml;rkeres Wirtschaftswachstum in den USA voraus. Doch
            selbst wenn die Weltkonjunktur im Fr&uuml;hjahr wieder an Schwung gewinnen
            sollte, d&uuml;rfte die deutsche Wirtschaft 2003 nur eine Wachstumsrate von
            knapp 1 % erreichen.</LI>

            <LI>Eine Besserung am Arbeitsmarkt ist fr&uuml;hestens Ende des Jahres
            m&ouml;glich. Im Jahresdurchschnitt d&uuml;rfte die Zahl der Arbeitslosen
            um 150.000 bis 200.000 Personen auf deutlich &uuml;ber 4,2 Millionen
            steigen.</LI>

            <LI>Um das Besch&auml;ftigungsproblem zu entsch&auml;rfen, muss vor allem
            der Anstieg der Arbeitskosten gebremst werden. Das gilt f&uuml;r die
            Bruttol&ouml;hne ebenso wie f&uuml;r die Lohnzusatzkosten und die
            indirekten Arbeitskosten, die zum Beispiel durch Abfindungsregelungen oder
            die Vorschriften des Betriebsverfassungsgesetzes verursacht werden. Eine
            Lockerung des K&uuml;ndigungsschutzes k&ouml;nnte ebenfalls helfen, die
            Arbeitskosten zu reduzieren.</LI>

            <LI>Besonders dringend sind Kostensenkungen in den Sozialversicherungen.
            Hier w&uuml;rde die Arbeit der R&uuml;rup-Kommission erleichtert, wenn die
            Regierung eine Beitragssatzsenkung auf unter 40 % als Zielmarke vorgeben
            w&uuml;rde.</LI>

            <LI>Auch die Konjunktur im Euro-Raum befindet sich in einer
            ausgepr&auml;gten Schw&auml;chephase. Unter der Annahme einer Belebung des
            Welthandels im Fr&uuml;hjahr d&uuml;rfte sich das Wirtschaftswachstum nur
            von etwa 0,8 % im vergangenen Jahr auf rund 1 &frac12; % in diesem Jahr
            beschleunigen.</LI>

            <LI>Die j&uuml;ngste Aufwertung des Euro ist zurzeit kein Grund, die
            Wachstumsprognosen zu senken. Wichtig ist allerdings, dass die
            m&ouml;gliche Fortsetzung der Euro-Aufwertung in einem moderaten Tempo
            erfolgt. Schnelle und heftige Kursbewegungen k&ouml;nnten zu einer
            st&auml;rkeren Verunsicherung der Wirtschaftsakteure f&uuml;hren und
            w&uuml;rden letztlich sogar das Risiko einer &Uuml;berbewertung des Euro
            bergen.</LI>
          </UL>

          <P>Der vollst&auml;ndige Kunjunkturbericht kann als PDF-Datei von der
          Website des Bankenverbandes (www.bankenverband.de) gezogen werden.</P>
          <CENTER>
          <TABLE border="0" summary=""><TR><TD>
          <IMG src="st_konjunktur.png" width="546" height="394" alt=""><BR>
          Wer an diese Entwicklung noch glaubt, ist selber schuld !!!!
          </TD></TR></TABLE></CENTER>
          <P><FONT size="-1">Kein linker Frame? Dann klicke <A href="javascript:history.back()"><B>hier</B></A></FONT></P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

