<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Software in H&uuml;le und F&uuml;lle?</TITLE>
    <!--  Antidote   -->
  </HEAD>

  <BODY background="17_2.jpg" text="#000000" link="blue" vlink="#000000">
    <TABLE bgcolor="#ffffff" cellpadding="8" border="1" width="90%" summary="" align="center">
      <TR align="CENTER">
        <TD>
          <CENTER>
            <B><FONT face="Arial" size="6" color="#000000">Software in H&uuml;lle
            und F&uuml;lle!?!</FONT></B><BR>
            <FONT face="Arial" size="3">Meinung zur aktuellen Lage Teil1 - Software</FONT>
          </CENTER>
        </TD>
      </TR>

      <TR>
        <TD>
          <B><FONT face="Arial" size="5" color="#000000">N</FONT></B> <FONT
          face="Arial" size="3" color="#000000">at&uuml;rlich ist die Zeit der
          Software&uuml;berschwemmung im Amigamarkt schon lange vorbei. Das weiss
          eigentlich jede/r, der/die sich auch nur einen Hauch mit dem geliebten
          Amiga besch&auml;ftigt. Einige werden jetzt vielleicht meckern und sagen,
          dass es doch in einigen Anwendungsbereichen recht gut aussieht.<BR>

          Damit haben sie garnicht so unrecht. <B>Nur sind diese ein bis drei Sparten
          einfach zu wenig!</B><BR>

          Mir fallen eigentlich nur drei Bereiche ein, wo ich immernoch komplett
          zufrieden bin.<BR>

          Das w&auml;re einmal der Email-client Bereich, wo wir mit <A
          href="http://sourceforge.net/projects/yamos/" target="_NEW">YAM</A> (Ich
          benutze die DEV.2.4(060) Version) einen hervorragenden Vertreter haben und
          wo sich <A href="http://www.simplemail.de.vu" target="_NEW">SimpleMail</A>
          (Zur Zeit die Version 0.19) zu einem auch sehr interessanten Mailer
          entwickelt.<BR> Zwitens ist die Musiksparte gut abgedeckt. Das muss man
          schon sagen :) Allerdings ist das eher auch nicht so mein Gebiet. Immerhin
          gibt es gute Abspieler, Sampleprogramme und die sch&ouml;nen Tracker
          ;-)<BR>

          Der dritte Bereich ist der Grafik Bereich. Hier haben wir viele gute
          Programme, die immer noch sehr leistungsstark sind und teilweise noch
          weitergepflegt werden. Z.B. Pixelprgs, wie <B>PPaint7.1</B> oder das
          immernoch gute <B>DeluxePaintIV</B> sind f&uuml;r mich immer noch absolute
          Highlights und nicht wegdenkbar, auch wenn die schon l&auml;nger nicht mehr
          weiterentwickelt werden.<BR>

          Sonst gibt es ja in dem Bearbeitungsbereich noch <B>fxPaint 2.0</B>
          (Juchhuhh!!), <B>ArtEffect4</B>, das Freeware Prg <B>PerfectPaintv2.9</B>,
          <B>ImageFx</B>... um nur einige zu nennen. Das sind nat&uuml;rlich eine
          ganze Menge!!<BR><BR>

                    
          Doch das ist genau der Punkt, den ich ansprechen m&ouml;chte.<BR>

          Da haben wir einen Bereich, wie den Grafik/Bearbeitungsbereich, der
          erstaunlich viel Software bietet, aber auch wieder einen Bereich, wie. z.B.
          den Textbereich, der der Zeit definitiv hinterherh&auml;ngt!<BR>

          Auch wenn es Tools wie <B>APDF</B> und Engines wie <B>TTEngine</B> gibt, so
          fehlen generell Komplettl&ouml;sungen!<BR>

          <B>Textverarbeitungen</B>, w&auml;ren da eine Sache, besser nat&uuml;rlich
          eine Officepaket. Es wird immer wieder vieles angek&uuml;ndigt, was doch
          tolles portiert werden soll...aber solange ich nichts sehe, gebe ich auch
          auf solche Aussagen nichts mehr. Ich habe jetzt meinen Amiga und will ihn
          auch jetzt benutzen und nicht auf ein Softwarepaket warten, was dann doch
          nicht mehr kommt.<BR> <BR>

          Zu Anwendungen hier noch eine kurze Auflistung, was mir meiner Meinung
          sonst noch fehlt:</FONT>

          <UL>
            <LI><FONT face="Arial" size="3" color="#000000"><B>Tabellenkalkulation</B>
            (Auch wenn ich mit TurboCalc noch recht gut Arbeiten kann, fehlen
            mittlerweile eine Menge Features :-( Allerdings gibt es da ein Projekt
            f&uuml;r ein neues Prg in diesem Bereich (Nicht TurboCalc!!!), wo ich per
            Email eine Best&auml;tigung bekommen habe, dass noch daran gearbeitet wird.
            Wenn es einer Erscheinung n&auml;her r&uuml;ckt, werde ich bestimmt nochmal
            dar&uuml;ber berichten .</FONT></LI>

            <LI><FONT face="Arial" size="3" color="#000000"><B>Internet
            Browser</B>!!!! V&ouml;llig klar, dies ist f&uuml;r einen heutigen Rechner
            einfach Pflicht. Ich arbeite noch mit AWebII3.4 und werde mir wohl
            demn&auml;chst IBrowse2.3 besorgen, da mir die Demoversion gut gefallen
            hat. Auch wenn es super ist, das der Browser endlich mal wieder ein Update
            erfahren hat, so wissen wir doch eigentlich alle, dass immer noch eine
            Menge Dinge vermisst werden, wie z.B. die Unterst&uuml;tzung von CSS, Java
            usw.</FONT></LI>

            <LI><FONT face="Arial" size="3" color="#000000"><B>OS4.0</B> ;-)
            Winterschlaf...Fr&uuml;hling...Sommer...g&auml;hn.. nix gesehen
            :(</FONT></LI>
          </UL>
          <FONT face="Arial" size="3" color="#000000">E s gibt zwar noch einige
          Bereiche mehr, aber f&uuml;r mich pers&ouml;nlich sind da die Relevanten.
          Man kann nat&uuml;rlich auf die zu Schwache Hardware verweisen, aber die
          o.g. (ausser vielleicht OS4) Bereiche w&auml;ren immer noch auf der
          jetzigen Hardware machbar.<BR> <BR>

          Achja, ich m&ouml;chte hier mit meiner kleinen Aufz&auml;hlung nicht
          vergessen, dass es viele, teilweise berechtigte Gr&uuml;nde gibt, warum
          Programmierer nicht mehr f&uuml;r dieses System entwickeln und das die
          wenigen die noch dabei sind, sich ganz sch&ouml;n den Allerwertesten
          aufreissen um dann bestenfalls noch nen Arschtritt von der sog."Community"
          zu bekommen.<BR> <U>Es ist einfach nur eine kleine Aufz&auml;hlung von
          mir!!!!</U><BR> <BR>

          Ansichten &uuml;ber die Amiga <A href="st_spiele.html">Spiele</A>- und <A
          href="st_hardware.html">Hardwaresituation</A> (Gegenwart+Zukunft) gibt es
          zu gegebener Zeit ;-)<BR> <BR>

          <I>Vielleicht habt Ihr ja noch bessere Alternativen gefunden, f&uuml;r
          meine "Fehlliste" und wollt sie mal via der NC aufzeigen :) Oder Euch
          fehlen ganz andere Programme f&uuml;r den Amiga...<BR> Schreibt doch
          einfach mal!!</I></FONT>

          <CENTER>
            <FONT face="ComicSansMS, Arial" size="3" color=
            "#000000"><B>Antidote</B></FONT>
          </CENTER>
        </TD>
      </TR>
    </TABLE>

    <TABLE bgcolor="#cccccc" border="1" align="center">
      <TR>
        <TD><FONT face="Arial" size="2" color=
        "#000000"><B>Autor:</B> <A href="mailto:1xklein@web.de"
        target="_NEW">Antidote</A></FONT> </TD>

        <TD><FONT face="Arial" size="2" color="#000000"><B>Webseite:</B>
        <A href="http://people.freenet.de/amigagamezone" target="_NEW">
        AmigaGameZone</A></FONT> </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

