<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, axel, rudi, pell, wizard, chosen, few, best of">
<title>Axel Rudi Pell: The Wizards Chosen Few </title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><h1><font color="green">Axel Rudi Pell: The Wizards Chosen Few - Best Of (2 CD`s)</Font></center></h1></P>

<p>Noch Mitte des Jahres brachte Axel Rudi Pell mit &quot;The Masquerade Ball&quot; sein aktuelles Studioalbum heraus, welches, genauso wie die zahlreichen Vorg&#228;nger, durch die Bank hinweg gute Kritiken erhielt. Mit &quot;The Wizards Chosen Few&quot; ist wenige Monate sp&#228;ter nun die erste Best Of von Axel Rudi Pell erschienen, was nach &#252;ber 10 Jahren und 8 regul&#228;ren Studioalben, einem Live Album und zwei Balladen Compilations auch mal langsam an der Zeit war. Das Genie dieses Mannes merkt man erst daran, da&#223; man selbst auf diesen beiden bis zum Anschlag gef&#252;llten CD`s l&#228;ngst nicht alle Hits der Bandgeschichte unterbringen konnte - klar, die wichtigsten Songs sind in Form von &quot;Casbah&quot;, &quot;Eternal Prisoner&quot;, &quot;Fool Fool&quot;, &quot;Magic&quot;, &quot;The Masquerade Ball&quot;, &quot;Nasty Reputation&quot; oder auch &quot;Oceans Of Time&quot; vertreten, aber es fehlt auf dieser Best Of, die &#252;brigens von Fans zusammengestellt wurde, die eine oder 
andere Speed Nummer wie etwa &quot;Earls Of Black&quot;, &quot;Talk Of The Guns&quot; oder &quot;Nightmare&quot;, was aber angesichts der gebotenen Klasse der ausgesuchten Songs auch nicht so schwer in`s Gewicht f&#228;llt. Damit die in einem edlen Digipack ausgelieferte Best Of auch f&#252;r die Fans, die eh alle regul&#228;ren CD`s ihres Meisters im Regal stehen haben, interessant wird, sind auch zwei qualitativ hochwertige brandneue Tracks (&quot;Broken Dreams&quot; und &quot;Ghosthunter&quot;), ein gut 13 min&#252;tiges Live Medley sowie der Japan Bonus Track des `97er Albums &quot;Magic&quot; (das Instrumental &quot;Total Eclipse&quot;) auf den beiden CD`s verewigt. Dazu gibt`s ein richtig fettes Booklett, welches neben vielen Fotos auch eine History sowie einige Worte von Mr.Pell h&#246;chstpers&#246;nlich enth&#228;lt und die Best Of im positiven Sinne abrundet. Somit bleibt insgesamt wohl nur das Fazit &#252;ber, da&#223; all jene, die auf melodischen, bisweilen leicht verspielten (aber immer 
nachvollziehbaren!) Metal der Extraklasse stehen und bisher noch keine CD von Axel Rudi Pell im Schrank stehen haben (was aufgrund der bisherigen excellenten Outputs eigentlich kaum zu rechtfertigen ist), bei dieser Best Of blind zugreifen m&#252;ssen. Fans werden zwar angesichts 
des Preises von rund 30 DM f&#252;r vier neue Tracks erstmal schlucken, k&#246;nnen das Geld aber ebenfalls ruhigen Gewissens investieren. &quot;The Wizards Chosen Few&quot; ist mitnichten eine dieser typischen vorweihnachtlichen Ver&#246;ffentlichungen, die den Leuten das Geld aus der Tasche ziehen will, sondern eine liebevoll gestaltete Best Of, die den f&#252;r Qualit&#228;t stehenden Namen Axel Rudi Pell vollauf zu Recht tr&#228;gt.</P>

<p>Fazit: 10 von 10 Punkten </P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd1.jpg"></P>
<p><img src="kit.gif"></P>
</Center>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
