<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, rhapsody, dawn of victory">
<title>Rhapsody: Dawn Of Victory</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><h1><font color="green">Rhapsody: Dawn Of Victory</Font></center></h1></P>

<p>Neben den neuen Werken von HammerFall, Virgin Steele und Helloween habe ich mich in diesem Jahr insbesondere auf das neue Album der epischen Bombast Metaller Rhapsody gefreut. &quot;Dawn Of Victory&quot; ist das nunmehr dritte Album, welche die Story, die auf den Vorg&#228;ngern &quot;Legendary Tales&quot; (1997) sowie &quot;Symphony Of Enchanted Lands&quot; (1998) begonnen wurde, weiterspinnt, aber noch nicht zu Ende f&#252;hrt - das Ende der Fantasy Story wird erst auf dem n&#228;chsten Longplayer der f&#252;hrenden italienischen Band verraten. Musikalisch ist auch alles gr&#246;&#223;tenteils beim alten geblieben, wenngleich &quot;Dawn Of Victory&quot; einen Tick aggressiver und weniger Soundtrack-kompatibel daherkommt und insofern eher in die Richtung des Debut`s tendiert als zu dem mit allen m&#246;glichen Elementen vollgepackten Vorg&#228;nger. Pr&#228;gnat d&#252;rfte nach wie vor das excellente Gesp&#252;r der Herren Turilli und Staropoli f&#252;r eing&#228;ngige Melodien sein, die sich auf 
&quot;Dawn Of Victory&quot; nat&#252;rlich auch zu Hauf finden: Der typische Rhapsody Opener &quot;Dawn Of Victory&quot; bl&#228;st nach dem obligatorischem Intro schon gleich zu Beginn der Scheibe alles weg, ehe die Band mit &quot;Triumph For My Magic Steel&quot; sowie &quot;Dargor, Shadowlord Of The Black Mountain&quot; weitere Kohlen nachschiebt. Auffallend sind mal wieder die bombastischen Arrangements sowie das Plus an Streichern, welche zusammen den einzelnen Songs unverwechselbar den Namen Rhapsody aufdr&#252;cken. Erw&#228;hnenswert sind ansonsten noch das auch als Single ausgekoppelte und verdammt aggressive &quot;Holy Thunderforce&quot; sowie der epische Abschlusstrack &quot;The Mighty Ride Of The Firelord&quot;. Der einzige Schwachpunkt der CD ist im Grunde nur das belanglose Instrumental &quot;Trolls In The Dark&quot;, welches zu unspektakul&#228;r vor sich hin pl&#228;tschert. Lange Rede, kurzer Sinn: Das neue Studioalbum von Rhapsody braucht sich hinter seinen sehr guten Vorg&#228;ngern 
beileibe nicht verstecken und kann die hohen Erwartungen locker erf&#252;llen - es d&#252;rfte wohl keinen Rhapsody Fan geben, der von dem neuen Langeisen entt&#228;uscht wird. Sicherlich mag dem einen oder anderen die CD zu &#252;berladen wirken, aber dieser Sound hat Rhapsody nunmal ber&#252;hmt gemacht und passt so perfekt zu der Fantasy Story. Fans der Band sei &#252;brigens das Limitierte Digibook (20.000 Kopien weltweit) an`s Herz gelegt, welches zum Preis von rund 45 DM einige interessante Info`s &#252;ber Rhapsody (inkl. der kompletten Fantasy Story) sowie eine Bonus CD mit 4 weiteren Tracks (2 Alternative und eine Edit Version von drei verschiedenen Album Tracks sowie die Helloween Coverversion &quot;Guardians&quot;) samt Multimediapart enth&#228;lt. Aber auch die normale Version ist nahezu ohne Abstriche empfehlenswert und ist das Geld auf jeden Fall wert.</P>

<p>Fazit: 9.5 von 10 Punkten</P> 
<center>
<p><img src="kit.gif"></P>
<p><img src="cd5.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
