<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Konzertbericht: Iron Maiden und Rob Halford</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="yellow">Konzertbericht: Iron Maiden und Rob Halford</Font></center></h1></P>


<p>Viele von Euch werden sich sicherlich an das &quot;Metal 2000&quot; Desaster in Essen erinnern - f&#252;r diejenigen, die es nicht wissen, sei gesagt, da&#223; Iron Maiden eigentlich im Juli (zusammen mit einigen weiteren hochkar&#228;tigen Acts) in Essen spielen sollten, dies aber aufgrund einer Verletzung von Gitarrist Janick Gers nicht tun konnten und sich damit bei einigen Fans ziemlich unbeliebt machten. Aus diesem Grunde fand am 6. November in der Essener Grugahalle ein Nachholkonzert statt und nat&#252;rlich lie&#223; ich es mir nicht nehmen, auch anwesend zu sein.</P>

<p>Im Vorprogramm der Eisernen Jungfrauen fand sich ex-Judas Priest Frontsirene Rob Halford wieder, der mit &quot;Resurrection&quot; ein erstaunliches Comeback Album abgeliefert hat und sicherlich war ich nicht der einzigste, der sich auf Rob Halford und den Rest seiner Band gefreut hat. Die Ern&#252;chterrung kam sc
hnell, als die Band die B&#252;hne betrat und anfangs nur recht wenig Stimmung im Publikum aufkommen wollte, was freilich nicht am Publikum lag. Vielmehr verhielt sich S&#228;nger Rob Halford &#228;u&#223;erst passiv und bewegte sich bei den ersten beiden Songs &quot;Resurrection&quot; und &quot;Made In Hell&quot; &#252;berhaupt nicht vom Fleck. Die simple Erkl&#228;rung daf&#252;r: Er musste die Texte von einem Monitor ablesen, was schon ein Armutszeugniss an sich ist. Ok, der Mann ist nicht mehr der j&#252;ngste, aber sich dann im Laufe des weiteren Sets als &quot;Metal Gott&quot; feiern zu lassen, trifft die Sache irgendwie auch nicht. Wie auch immer: Mit den Priest Klassikern &quot;Metal Gods&quot;, &quot;The Helion / Electric Eye&quot;, &quot;Jawbreaker&quot; sowie &quot;Breaking The Law&quot; kam im Laufe der weiteren Halford Show wenigstens etwas Stimmung auf, aber auch bei diesen Songs war Halford nicht der agilste und sein Gepose fand ich mitunter auch recht l&#228;cherlich. Die Songs knallten zwar ordentlich, aber etwas mehr h&#228;tte ich mir von Halford und seiner Band dann doch versprochen.</P>

<p>Macht aber auch nichts, denn mit Iron Maiden enternten schlie&#223;lich die wahren &quot;Metal G&#246;tter&quot; die B&#252;hne und boten ein arschtightes Set, welches von den drei Brave New World Tracks &quot;The Wicker Man&quot;, &quot;Ghost Of the Navigator&quot; (G&#228;nsehaut pur!) und &quot;Brave New World&quot; (was f&#252;r ein Chorus!) er&#246;ffnet wurde. Das Publikum in der (wohl ausverkauften) Grugahalle war jetzt auch endlich in der passenden Stimmung, wenngleich ich sagen muss, da&#223; die Reaktionen auf der letztj&#228;hrigen Reunion Tour euphorischer waren. Auch optisch konnten Iron Maiden nicht alles aufbieten, was sie in petto hatten, da die Grugahalle schlichtweg zu klein war. So blieb es bei einigen wenigen optischen Gags, aber die Band machte das durch Spiellaune locker wieder wett - egal, ob es 
sich um Klassiker (&quot;The Trooper&quot;, &quot;Wrathchild&quot;, &quot;2 Minutes To Midnight&quot;), Stoff aus der Blaze Bayley &#196;ra (&quot;The Sign Of The Cross&quot; mit Bruce`s Stimme ist einfach nur g&#246;ttlich, zumal Bruce am Anfang des Songs an einem &#252;berdimensionalem Kreut hing) oder neues Material (&quot;Dream Of Mirrors&quot;, &quot;Blood Brothers&quot;) handelt - Iron Maiden schaffen es immer wieder, die Fans auf`s neue zu begeistern, was auch an Bruce Dickinson`s unerm&#252;dlichem Einsatz lag: Er sprintete quer &#252;ber die B&#252;hne, sprang wie ein kleines Kind v&#246;llig verr&#252;ckt durch die Gegend und animierte die Fans zudem st&#228;ndig zum mitsingen. Als die Band schlie&#223;lich verk&#252;ndete, im n&#228;chsten Jahr mit einem neuen Live Album die Fans zu erfreuen und ein neues Studioalbum auch auf der &quot;To Do&quot; Liste steht, gab es kaum noch halten und jeder, der der Band Geldgeilheit vorwirft, sollte sp&#228;testens jetzt seine Meinung revidieren. Etwas verwundert hat mich schlie&#223;lich nur, da&#223; die Band ihre neue Single &quot;Out Of The Silent Planet&quot; nicht gespielt hat und zudem mit Preisen von 60 DM f&#252;r ein T-Shirt (!!!) und 180 DM f&#252;r ein Original Trikot (!!!!!) vielen Fans vor den Kopf stie&#223;. Das konnte aber ein wirklich geniales Live Konzert nicht wirklich vermiesen und es war definitiv eines der besten Konzerte in diesem Jahr. Up The Irons! </P>

<p><u>Tracklist:</U></P>

<p>1. The Wicker Man<BR>
2. Ghost Of The Navigator<BR>
3. Brave New World<BR>
4. Wrathchild<BR>
5. 2 Minutes To Midnight<BR>
6. Blood Brothers<BR>
7. Sign Of The Cross<BR>
8. The Mercenary<BR>
9. The Trooper<BR>
10. Dream Of Mirrors<BR>
11. The Clansman<BR>
12. The Evil That Men Do<BR>
13. Fear Of The Dark<BR>
14. Iron Maiden<BR>
15. The Number Of The Beast<BR>
16. Hallowed Be Thy Name<BR>
17. Sanctuary</P>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
