<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, metal news">
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="red">Newsflash</font></center></h1></P><ul>
<p><li> Der gute <b>Bruce Dickinson</B> von <b>Iron Maiden</B> scheint momentan arg unterbesch&#228;ftigt zu sein: Neben dem Release eines Live Albums aus dem Hause seiner Stammband, steht uns f&#252;r das Jahr 2001 auch das neue Soloalbum des sympathischen S&#228;ngers in`s Haus. Und als ob das noch nicht genug des guten sei, plant <b>Bruce Dickinson</B> auch noch einen Film, der auf seinem letzten Soloalbum &quot;The Chemical Wedding&quot; basiert. M&#246;glicherweise starten die Dreharbeiten schon Anfang 2001.</LI></P>

<p><li>  S&#228;nger <b>Wade Black</B> ist, nach Differenzen mit Bandleader Jon Drenning, bei <b>Crimson Glory</B> ausgestiegen. Ob und wie es bei Crimson Glory weitergeht, steht momentan noch in den Sternen, aber Wade Black hat mit <b>Seven Witches</B>, derren S&#228;nger Bobby Lucas vor einigen Wochen seinen Hut nehmen musste, schon ein neues Bet&#228;tigungsfeld gefunden.</LI></P>

<p><li>  Wie aus heiterem Himmel ist pl&#246;tzlich <b>Angel Dust</B> Drummer &amp; Gr&#252;ndungsmitglied Dirk Assmuth ausgestiegen - angeblich, weil er berufliche Interessen nicht mehr mit der Band unter einen Hut bringen konnte. Einen festen Nachfolger gibt`s noch nicht, aber mit Sessiondrummer Michael Sticken hat man den Platz hinter den Drums immerhin bis Jahresende besetzt. </LI></P>

<p><li>  Die bekannte deutsche Metal Institution <b>Blind Guardian</B> lebt offenbar noch: 90 %  des neuen Material stehen mitlerweile und bereits Anfang Oktober gingen die ersten Aufnahmesessions &#252;ber die B&#252;hne. Produziert wird das Teil &#252;brigens von niemand geringerem als Charlie Bauernfeind (u.a. Helloween, Gamma Ray). Erscheinen wird die neue Blind Guardian Langrille aber vorraussichtlich erst im August / September n&#228;chsten Jahres. Ob da die &#252;bliche Verz&#246;gerungsfrist der Band schon eingerechnet ist, war leider nicht herauszufinden.</LI></P>

<p><li>  Nachschlag zu den <b>Judas Priest</B> News aus der letzten Ausgabe: Nach neuen Angaben soll der &quot;Jugulator&quot; Nachfolger bereits Ende Januar / Anfang Februar erscheinen. Lassen wir uns mal &#252;berraschen.</LI></P>

<p><li>  Traurige News aus dem Hause <b>Savatage</B>: Nach Gitarrist Al Pitrelli (nun bei <b>Megadeth</B>) hat auch der etatm&#228;&#223;ige S&#228;nger Zak Stevens das Handtuch geworfen. Als Gr&#252;nde f&#252;hrte er an, da&#223; er einen neuen Karriereweg gehen wolle und zudem mehr Zeit f&#252;r seine Familie braucht. Dieser pl&#246;tzliche Ausstieg ist zwar ein Schock f&#252;r alle Savatage Fans, aber nachdem Jon Olivia schon seit geraumer Zeit betonte, wie gut er wieder bei Stimme sei, war es letztendlich nicht so &#252;berraschend, wie es sich zun&#228;chst anh&#246;rt. Folgerichtig &#252;bernimmt Jon Olivia vorerst die Position des S&#228;ngers. Ob das neue Album &quot;Poets And Madman&quot; wieder einmal in der Gefahr schwebt, nach hinten verschoben zu werden, ist derzeit unklar. Da ist auch nur ein kleiner Trost, da&#223; das dritte <b>Trans Siberian Orchester</B> Album &quot;Beethovens Last Night&quot; (Review in Metal Corner 7 / 2000), grenau wie die beiden Vorg&#228;nger, Anfang 2001 auch die 
l&#228;nsgt &#252;berf&#228;llige Deutschlandpremiere feiert.</LI></P>

<p><li>  Die geplante drei-j&#228;hrige Auszeit von <b>Stratovarius</B>, die wohl nach dem Ende der Infinite Tour beginnt, wird den Fans zun&#228;chst mit der Single &quot;A Million Light Years Away&quot; vers&#252;sst. Parallel dazu erscheint auch das erste Stratovarius Video &quot;Infinite Visions&quot; auf DVD und VHS. Und last but not least folgt Anfang April dann noch ein Rarit&#228;ten Album, welches hoffentlich nicht daf&#252;r da ist, mal eben die schnelle Mark zu machen.</LI></P>

<p><li>  <b>Gamma Ray</B> befinden sich momentan mal wieder in den Kai Hansen Studios und arbeiten flei&#223;ig an Material f&#252;r den &quot;Powerplant&quot; Nachfolger, der irgendwann im Jahre 2001 via Noise Records, bei denen die Band nach dem Best Of Album &quot;Blast From The Past&quot; den Vertrag verl&#228;ngert hat, erscheinen wird. </LI></P>

<p><li>  Die kurzfristig zum Duo geschrumpften Fun Metaller <b>J.B.O.</B> haben immerhin schonmal einen neuen Drummer an Bord, der auf den Namen Wolfram Kellner h&#246;rt. Einen neuen Bassisten gibt`s angeblich auch schon, wobei sich die Band diesbez&#252;glich aber noch in Stillschweigen h&#252;llt.</LI></P>

<p><li>  Die italienische Power Metal Combo <b>Athena</B>, die 1998 ihr fulminantes Debutalbum &quot;A New Religion?&quot; auf den Markt brachte, gibt im Januar mal wieder ein Lebenszeichen in Form eines neuen Longplayer von sich, nachdem von der Band seit geraumer Zeit nichts mehr zu h&#246;ren war. &quot;Twilight Of Days&quot; nennt sich das neue Opus - allerdings ist auf diesem Konzeptalbum, welches via Noise Records ver&#246;ffentlicht wird, wohl Rhapsody / Vision Divine Frontsirene <b>Fabio Leone</B>, der noch das Debut von Athena einsang, nicht mehr mit von der Partie.</LI></P>

<p><li>  Lange angek&#252;ndigt, oftmals verschoben und nun wohl endlich spruchreif: Die Rede ist von dem neuen Studiolangeisen von <b>Narnia</B>, welches jetzt wohl endg&#252;ltig Mitte Februar unter dem Titel &quot;Desert Land&quot; ver&#246;ffentlicht wird. Wollen wir mal hoffen, da&#223; den Jungs nicht erneut etwas dazwischen kommt....</LI></P>




</UL>
</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
