<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
				<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
					<br>
				</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Shogo: Mobile Armor&nbsp;Division</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Teksti ja kuvat:&nbsp;<a href="http://www.saunalahti.fi/halmej/" target="_blank">Joni Halme</a> &lt;<a href="mailto:halmej@saunalahti.fi">halmej@saunalahti.fi</a>&gt;<br>
							
							Laitteisto: Erkki Vaaja &lt;<a href="mailto:erkki.vaaja@satabaana.net">erkki.vaaja@satabaana.net</a>&gt;</font></td>
				</tr>
			</table>
			<br>
			<font face="Trebuchet MS,Verdana,Arial,Helvetica">
				<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://www.hyperion-software.com" target="_blank">Hyperion Entertainment</a> ei todellakaan lep&auml;&auml; laakereillaan, vaan he v&auml;&auml;nt&auml;v&auml;t rankasti koodia Amigalle. Kaksi 3D-peli&auml; on jo portattu, ja uusia on tulossa. Warp3D:t&auml;kin kehitet&auml;&auml;n. Heretic II oli loistopeli, enk&auml; uskonut, ett&auml; he pystyisiv&auml;t parempaan, mutta olin v&auml;&auml;r&auml;ss&auml;. Shogo: Mobile Armor Division l&ouml;i minut &auml;llik&auml;ll&auml;.</font></p>
							<div align="center">
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/shogo_1.jpg" width="400" height="300" border="0" alt=" "></font></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Peli tuli isossa mutta todella kevyess&auml; paketissa. Etupuoli tuo ensimm&auml;isen&auml; mieleen vanhat A500-pelit. Takakannesta l&ouml;ytyy sitten hienoja ruutukaappauksia ja v&auml;h&auml;n tietoa pelist&auml;. Kaappaukset eiv&auml;t kumminkaan taida olla Amiga-versiosta. Amigan logo l&ouml;ytyy my&ouml;s kannesta. Tarkemmin katsottuna alta l&ouml;ytyi Macin logo. Paketti oli tehty Mac- ja Linux-versioille, ja Amigan tarra oli vain l&auml;tk&auml;isty p&auml;&auml;lle. Sis&auml;lt&auml; l&ouml;ytyy CD perinteisess&auml; paperitaskussa ja harmaas&auml;vyinen ohjekirja Amiga-versiolle englanniksi ja saksaksi. Ohjekirjassa on tekstit vuorotellen saksaksi ja englanniksi, mik&auml; k&auml;y v&auml;lill&auml; hieman sekavaksi, mutta se on varmasti halvempaa kuin tehd&auml; englannin kielelle omat sivut.</font></p>
							<div align="center">
								<p><img src="kuvat/shogo_2.jpg" width="400" height="250" border="0" alt=" "></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ensimm&auml;iselt&auml; sivulta l&ouml;ytyy laitevaatimukset Amigalle ja my&ouml;s AmigaOnelle. Tiivistettyn&auml; tarvitaan joko BlizzardPPC160 tai CyberStormPPC. Jos k&auml;yt&auml;t BlizzardPPC:t&auml;, on Permedia2-3D-n&auml;yt&ouml;nohjain (BlizzardVisionPPC) pakollinen. Muistia tarvitaan reilusti. Peli py&ouml;rii 64 megalla, mutta parempi olisi jos muistia l&ouml;ytyy ainakin 80 Mt. </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Asennus on tuttuun Hyperion-tyyliin todella tasokas. Asennuksen aikana ilmeni kaksi virhett&auml; purun yhteydess&auml;, mutta asennusohjelma ei t&auml;st&auml; v&auml;litt&auml;nyt, vaan jatkoi asennusta. Asennus kesti 40x-rompulta UWSCSI-kovalevylle 060/PPC-koneella 23 minuuttia, kun asennettiin my&ouml;s 100 Mt:n elokuvat. Lopussa sinulta kysyt&auml;&auml;n koneen asetuksia. Me valitsimme luonnollisesti &quot;060/PPC200 and Loads of memory&quot; :).</font></p>
							<div align="center">
								<p><img src="kuvat/shogo_3.jpg" width="400" height="300" border="0" alt=" "></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Shogossa on ominaisuus, josta pid&auml;n paljon ja jota yleens&auml; kikkaillaan muille 3D-peleille MUI-virityksin. Kyseess&auml; on todella tyylik&auml;s Launcher, jonka avulla voit muokata kaikkia asetuksia, k&auml;ynnist&auml;&auml; Multiplayer Wizardin yms. Pelin voi my&ouml;s k&auml;ynnist&auml;&auml; ilman Launcheria. Ensimm&auml;iselt&auml; sivulta valitsimme CVisionPPC:n minigl renderer ja 640x480-tarkkuuden. Shogo tukee AHI:a, joten Delfina Lite p&auml;&auml;see kunniaan. Launcheriin on my&ouml;s saatavana p&auml;ivitys (<a href="http://ftp.sunet.se/pub/aminet/biz/titan/LauncherUpd.lha" target="_blank">Aminet</a>, 34 kt). Launcher sis&auml;lt&auml;&auml; asetuksia enemm&auml;n kuin laki sallii, ja niille jotka haluavat kaikki irti koneestaan ja pelist&auml;, l&ouml;ytyy s&auml;&auml;timi&auml; joka l&auml;ht&ouml;&ouml;n. Meille t&auml;rkeimm&auml;t asetukset olivat vaihto DMA:sta AHI:in. Ellet k&auml;yt&auml; &auml;&auml;nikorttia, k&auml;yt&auml; ehdottomasti DMA:ta. N&auml;in saat lis&auml;&auml; prosessoriaikaa pelille. Memory-asetuksista laitoimme kaikki cachet maksimiin, koska muistia l&ouml;ytyy 128 Mt.</font></p>
							<div align="center">
								<p><img src="kuvat/shogo_4.jpg" width="400" height="300" border="0" alt=" "></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Sitten launch, ja peli k&auml;ynnistyy perinteisill&auml; alkudemoilla. Ensin Monolith, sitten Hyperion ja sitten itse pelin alkudemo. T&auml;ss&auml; vaiheessa olin kuolla nauruun. Ei itse demossa mit&auml;&auml;n vikaa, mutta se musiikki... Ensimm&auml;isen&auml; mieleeni tuli Pokemonit. Pelih&auml;n k&auml;ytt&auml;&auml; paljon manga-tyylist&auml; grafiikkaa, mutta musiikkikin oli kuin suoraan japanilaisesta piirretyst&auml;. T&auml;m&auml;h&auml;n on siis tietenkin makukysymys, mutta minulta tunnelma l&auml;s&auml;hti siihen. Shogon inspiraationa ovat olleet paitsi muut vastaavat 3D-pelit, my&ouml;s erityisesti japanilainen manga ja anime, mik&auml; n&auml;kyy varsinkin pelihahmoissa ja juonenkulussa, joten musiikit ovat luonnollisesti samaa tyylilajia.</font></p>
							<div align="center">
								<p><img src="kuvat/shogo_5.jpg" width="400" height="300" border="0" alt=" "></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Sitten p&auml;&auml;simmekin alkuvalikkoon. Ihmettelimme, kun valikotkin tahmasivat tarpeettomasti ja taustan animaatio oli tahmeaa. Menimme display optioneihin, ja vaikka Launcherissa m&auml;&auml;rittelimme MiniGL-renderoinnin, oli software-renderointi p&auml;&auml;ll&auml;. Vaihdoimme sen ja samalla s&auml;&auml;dimme muitakin asetuksia sopivammiksi. Kun s&auml;&auml;d&ouml;t oli tehty, p&auml;&auml;simme pelaamaan. Kone ruksutti pitemm&auml;n aikaa. Lataus kest&auml;&auml; melko pitk&auml;&auml;n nopeallakin kovalevyll&auml;, jos olet s&auml;&auml;t&auml;nyt kaiken ladattavaksi muistiin. Sitten iski ohraleip&auml;. Peli ei k&auml;ynnistynytk&auml;&auml;n, vaan kone j&auml;m&auml;hti siihen. Hammasta purren ryhdyimme vikaa etsim&auml;&auml;n. Muutaman tunnin mets&auml;styksen j&auml;lkeen vika l&ouml;ytyikin: WarpOS:n warp.libraryn versio ei kelvannut. K&auml;ytetty versio 5.1 ei kelvannut, ja jouduimme vaihtamaan versioon 4.0. En silti sano, etteik&ouml; peli toimisi versiolla 5.1, vaan ep&auml;ilen ett&auml; vika oli koneessa.</font></p>
							<div align="center">
								<p><img src="kuvat/shogo_6.jpg" width="400" height="300" border="0" alt=" "></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">P&auml;&auml;simme kuitenkin viimein peliin. Mit&auml;s nyt? Peli tahmasi luvattoman paljon - niin paljon, ettei peli&auml; voinut pelata. Ja taas vikaa mets&auml;st&auml;m&auml;&auml;n. Aloitimme Launcherista selke&auml;sti yksitellen optioita poistamalla, ja syyllinen l&ouml;ytyi kuin l&ouml;ytyikin: AHI-&auml;&auml;net. Vaihtamalla DMA-&auml;&auml;niin peli alkoi toimia kuten pit&auml;&auml;kin eli nopeasti. T&auml;m&auml; on silti kummallista, sill&auml; olimme kokeilleet Shogon demoa, ja siin&auml; AHI-&auml;&auml;nill&auml; peli py&ouml;ri silti sulavasti. Taas pient&auml; p&auml;hk&auml;ily&auml;, ja vika l&ouml;ytyi AHI:n asetuksista. M&auml;&auml;r&auml;tylle AHI-yksik&ouml;lle oli laitettu liikaa hertsej&auml;, ja se aiheutti tahmausta. Tiputimme hertsit 22000:een, ja sitten alkoi pelitt&auml;&auml; AHI:nkin kanssa. Shogoon on jo ehtinyt ilmesty&auml; p&auml;ivitys (<a href="http://www.hyperion-software.de/downloads/missing.lha" target="_blank">Hyperion</a>, 1,1 Mt), joka lis&auml;&auml; puuttuvia &auml;&auml;ni&auml;. </font></p>
							<div align="center">
								<p><img src="kuvat/shogo_7.jpg" width="400" height="300" border="0" alt=" "></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">CD-audiokaan ei s&auml;v&auml;yt&auml;. Raitoja on vain kuusi, ja kun olet nauttinut Napalmin tai Genetic Speciesin musiikeista, ovat Shogon musiikit pahasti keskener&auml;isen kuuloisia vanutuksia. Suurin osa musiikeista on tyls&auml;&auml;, mit&auml;&auml;nsanomatonta, maitoa v&auml;ssykk&auml;jumputusta. Totean kuitenkin taas, ettei makuasioista voida kuin tapella.</font></p>
							<div align="center">
								<p><img src="kuvat/shogo_8.jpg" width="400" height="300" border="0" alt=" "></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Pelatessa yksi miinus on, ettei pelin jaksojen v&auml;liss&auml; tulevia animaatioita voi ohittaa, mutta kyll&auml; sen kest&auml;&auml;. Alussa er&auml;&auml;ss&auml; v&auml;lianimaatiossa olin tukehtua nauruun, kun kenraalin puhuessa pystyinkin liikuttelemaan hahmoani, ja ammuin vahingossa kenraalin autuaimmille virtuaalimets&auml;stysmaille. T&auml;m&auml; aiheutti jotain paheksuntaa tovereissa, ja seuraavaksi jouduinkin puolustautumaan omia vastaan. En onnistunut toistamaan t&auml;t&auml; temppua seuraavalla kerralla.</font></p>
							<div align="center">
								<p><img src="kuvat/shogo_9.jpg" width="400" height="300" border="0" alt=" "></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Peliss&auml; juoni selvi&auml;&auml; hiljalleen pelin edetess&auml;, ja sin&auml; voit itse vaikuttaa juonen lopputulokseen. Shogo jakautuu kahdenlaisiin teht&auml;viin: ihmishahmolla pelattaviin ja isolla Mech-tyylisell&auml; ter&auml;sj&auml;ttil&auml;isell&auml; (MCA, mobile combat armor eli &quot;mecha&quot;) pelattaviin. Peli alkaa siit&auml;, ett&auml; sinun on ehditt&auml;v&auml; l&auml;hd&ouml;ss&auml; olevalle alukselle, ja matkaa tietenkin haittaavat vihollisen yksik&ouml;t. Peli liikkuu todella kauniisti. Liike on sulavaa high-detaileilla 640x480-tarkkuudella. 233 MHz:n PPC:ll&auml; ja Permedialla pelaaminen on ihana kokemus. En odottanut t&auml;llaisella kokoonpanolla n&auml;in upeaa pelattavuutta. Kokeilimme my&ouml;s 800x600-tarkkuutta low-detaileilla, ja viel&auml;kin peli py&ouml;ri pelattavasti. Tyydyimme kuitenkin 640x480-tilaan.</font></p>
							<div align="center">
								<p><img src="kuvat/shogo_a.jpg" width="400" height="300" border="0" alt=" "></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Joissakin vaiheissa pelin antamat ohjeet tuntuvat ep&auml;selvilt&auml;, mutta t&auml;m&auml; pakottaa hieman miettim&auml;&auml;n tekojaan (ja muistuttaa tallentamaan). Joissakin teht&auml;viss&auml; saat avuksesi joukkuetovereita, mutta heist&auml; on enemm&auml;n haittaa kuin hy&ouml;ty&auml;. Vaikka vihollisen AI on tarpeeksi &auml;lyk&auml;s, ei t&auml;t&auml; lahjaa ole suotu joukkuetovereille. He rynt&auml;&auml;v&auml;t suoraan sinun tulilinjallesi ja itse ampuvat minne sattuvat. Joskus on vain helpompaa antaa heille heti niskalaukaus - varmistus. Pelatessa pit&auml;&auml; olla varovainen, sill&auml; jos l&auml;hdet hy&ouml;kk&auml;ykseen aseet raikuen, olet vainaja alta aikayksik&ouml;n. Loistava ominaisuus on pikatalletus. Voit pelin aikana tehd&auml; nopean talletuksen, ja kun sinut taas teilataan, voit ladata pelin siit&auml; mihin j&auml;it.</font></p>
							<div align="center">
								<p><img src="kuvat/shogo_0.jpg" width="400" height="300" border="0" alt=" "></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Multiplayer Wizard helpottaa verkkopelin luomista tai sellaiseen osallistumista. Ensin kuitenkin pit&auml;&auml; hankkia servereiden osoitteita, joita netist&auml; tai GameTrackerilla, jonka l&ouml;yd&auml;t <a href="http://ftp.sunet.se/pub/aminet/game/misc/gametracker.lha">Aminetista</a> (1,1 Mt). Aluksi serverit olivat v&auml;h&auml;n hakusessa, mutta kyll&auml; niit&auml; l&ouml;ytyi. Siell&auml; otin er&auml;&auml; PC-pelaajia vastaan, ja takkiin tuli rajusti. Peliin pit&auml;isi saada hieman lis&auml;&auml; vauhtia, ja 256 kbit yhteys tuntui minimilt&auml;. Mieluummin pelaamme sit&auml; kuitenkin toisiamme vastaan Amigoilla, molemmilla kun on kiinte&auml; yhteys. Suositeltavia sivustoja Shogon ja nettipelien yst&auml;ville ovat mm. <a href="http://www.shogo-mad.com/" target="_blank">Shogo-MAD</a>, <a href="http://www.planetshogo.com" target="_blank">Planet Shogo</a> ja <a href="http://www.gameoholic.com" target="_blank">GameOHolic</a>.</font></p>
						</td>
				</tr>
			</table>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tekij&auml;:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://www.lith.com/" target="_blank">Monolith Productions</a></font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"> </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"> (PC-versio)</font>
						<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://www.lith.com/" target="_blank"><br>
								Hyperion Entertainment</a></font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"> (Amiga-versio)</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Julkaisija:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://www.titan-computer.com/" target="_blank">Titan Computer</a></font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Edustaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://www.ge.vip.fi" target="_blank">Gentle Eye Ky</a>, puh. (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a></font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">360 mk</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tiedostot:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://www.hyperion-software.de/downloads/missing.lha" target="_blank">Myyntiversion 1. p&auml;ivitys</a> (Hyperion, 1,6 Mt)<br>
							<a href="http://ftp.sunet.se/pub/aminet/biz/titan/ShogoDemo.lha" target="_blank">Demoversio</a> </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">(Aminet, 36 Mt)<br>
							<a href="http://ftp.sunet.se/pub/aminet/biz/titan/ShogoDemoUpd.lha" target="_blank">Multiplayer-p&auml;ivitys</a> (demoversioon) (Aminet, 394 kt)<br>
							<a href="http://ftp.sunet.se/pub/aminet/biz/titan/LauncherUpd.lha" target="_blank">Launcher-p&auml;ivitys</a> (demo- ja myyntiversio) (Aminet, 34 kt)<br>
							<a href="http://ftp.sunet.se/pub/aminet/game/misc/gametracker.lha" target="_blank">GameTracker</a> (etsii pelipalvelimia) (Aminet, 1,1 Mt)</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Vaatii:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amiga OS 3.1 tai parempi, WarpOS, Blizzard PPC ja 3D-grafiikkakortti tai CyberstormPPC (suositus Warp3D-yhteensopiva 3D-grafiikkakortti), 64 Mt muistia (suositus 80 Mt), 500 Mt kiintolevytilaa</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Testattu:</font></td>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">A3000, OS 3.5, CyberStormPPC/233, CyberVisionPPC, 128 Mt, Delfina Lite, UW-SCSI-kovalevyt ja 40x DVD-ROM. Verkkopeli&auml; varten X-Surf ja 256 kbit/128 kbit kaapelimodeemi.</font></p>
					</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Yhteenveto:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Jos sinulla on PPC ja Permedia tai jopa Voodoo3, niin mit&auml; viel&auml; odottelet. Puhelin kauniiseen k&auml;teen ja osta peli. Peli py&ouml;rii loistavasti ja on kaunista katseltavaa.</font></td>
				</tr>
			</table>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>