<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Amiga: The next Generation</title>
</head>
<body bgcolor="#000000" text="#000000">
<h1><font color="WHITE">NG-Amigas: Schon wieder...</font></h1>

<font color="WHITE">Hi Mark! Ich hatte schon gedacht du w&auml;hrst
ins Klo gefallen ;-)<br>
Na gut, auch auf die Gefahr hin, da&szlig; keine Antwort kommt ist
hier jetzt meine Antwort. Bitte entschuldige, wenn ich etwas weit
abschweife, aber ich hab bei diesem Text gute Laune
gehabt...</font>
<p><font color="WHITE">Der &uuml;bersicht halber greife ich einfach
mal ein par Zitate aus deinem Text heraus, und kommentiere
sie.</font></p>

<center>
<table border="1" cellspacing="0" cellpadding="5" width="85%">
<tr>
<td bgcolor="RED">
<table border="1" cellspacing="0" cellpadding="0" width="100%">
<tr><td>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH=100%><TR><TD BGCOLOR=Black>
<blockquote><font color="WHITE"><i>&raquo;W&auml;hrend wohl die
mei&szlig;ten unter euch ihre HTML-Dokumente und deren Tags
m&uuml;hselig per Hand tippen, findet man auf vielen CDs, die auf
Computer-Zeitschriften, Lifestyle-Magazinen und manchmal sogar auf
TV-Zeitschriften kleben, kostenlose Browser wie Explorer und
Netscape, deren Amiga-Pendants dagegen teilweise wie "Kinderkacke"
anmuten.&laquo;</i></font></blockquote>
</td>
</tr>

<tr>
<td bgcolor="WHITE">Jap, und dazu einen tollen Einstieg ins
Internet mit f&uuml;nfzig! Und dabei mu&szlig;t du noch nicht
einmal einen Videorekorder programmieren k&ouml;nnen. Du gehst
einfach online, und dann zur Verabredung, wie im Film... werd ich
sarkastisch?

<p>O.K., ernsthaft. Vieleicht ist es dir entgangen, aber im Moment
befindet sich aMozillaX in Entwicklung, und ich darf sagen: Wenn
die nur die H&auml;lfte von dem Quatsch halten, den sie
angek&uuml;ndigt haben, dann d&uuml;rfte das ganz sch&ouml;n
einschlagen. Ich sage garnicht, da&szlig; Netscape schlecht ist, im
Gegentum. Aber das pure Argument, man bek&auml;me eine Software
nachgeschmi&szlig;en, macht sie noch nicht gut. Auch am Navigator
gibt es noch einiges auszusetzen.</p>

<p>Das Email Modul gef&auml;llt mir &uuml;berhaupt nicht, da ist
Yam noch besser. Intern gibt es angeblich &uuml;ber 500 Bugs zu
beklagen, und ich habe es geschafft Netscape mindestens 2mal am Tag
abkn&uuml;ppeln zu lassen. Ich klicks einfach an! ;-)</p>

<p>Und der Composer ist jawohl ein Witz! Ich hab ihn zwar nur
f&uuml;r etwa 10 Minuten ausprobiert, aber nachdem ich dann immer
noch nicht wu&szlig;te, wie ich ein Bild hochskaliere hab ich
abgeschaltet, und bin nach Hause gegangen. Ich kann dir von Hand
mit Sicherheit tausendmal bessere Seiten Zaubern, als mit so einem
Ding. Mit dem Composer kann man vieleicht eine Seite mit einem
Hintergrund versehen, eine sch&ouml;ne bunte Schrift, dazu ein par
s&uuml;&szlig;e H&uuml;ndchen sowie ein Bild: "Das bin Ich" und
so`n Schei&szlig;, aber doch nichts ernsthaftes. Oder denkst du,
ein Webdesigner w&uuml;rde das benutzen?</p>
<!--
<tr>
<td bgcolor="#DDDD00" height="5"></td>
</tr>
//-->
<HR COLOR=#DDDD00 WIDTH=85%>
<p>
Es ist nunmal so, das der PC , ich sage es frei heraus, f&uuml;r
Dumme konzipiert ist. Ich pers&ouml;hnlich halte von dieser ganzen
Kinderkacke nicht sonderlich viel, und benutze lieber diesen
schnuckeligen Blacks-editor um meine Tags &quot;m&uuml;hselig&quot; per Hand
einzugeben, als auf diese Dummen - Soft angewiesen zu sein.</p>

<p>Im &uuml;brigen: Es wird den Leuten sowieso alles viel zu
einfach gemacht! Fr&uuml;her haben die Leute von Hand geschrieben,
heute gibt es Spracherkennung. Fr&uuml;her haben die Leute in
Maschinensprache programmiert, heute in &quot;VisualBasic&quot;! Fr&uuml;her
durften die Leute laufen, heute gibt es Autos. Die Leute werden
doch alle viel zu faul! ;-)</p>

<p>Ich wei&szlig;, da&szlig; das jetzt eigentlich gar nicht der
Punkt war, den du ansprechen wolltest, aber bevor du den
Fortschritt am PC lobst sieh dir lieber auch mal die Kehrseite an.
Ich gebe zu, am PC gibt es auch einige gute Sachen, von denen ich
drei doch sehr am Amiga vermisse:</p>

<ol>
<li>Die Clipboardf&auml;higkeiten werden wirklich konsequent
genutzt.</li>

<li>Echtes Drag and Drop!</li>

<li>Komplette Bedienung &uuml;ber Tastatur (wer das mal
kennengelernt hat fa&szlig;t die Mouse nie wieder an...)</li>
</ol>

Aber am Amiga gibt es auch Fortschritt, und sei er auch nicht
offiziell. In diesem Sinne bleibe ich bei meiner Devise: Ich glaube
was ich sehe. Und bei dem, was ich z.B. &uuml;ber OS3.5 gesehen
habe gucke ich lieber weg...</td>
</tr>
</table>
</td>
</tr>
</table>
</TD></TR></TABLE>
</center>


<br>
<center>
<table border="1" cellspacing="0" cellpadding="5" width="85%">
<tr>
<td bgcolor="RED">
<table border="1" cellspacing="0" cellpadding="0" width="100%">
<tr>
<TD>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH=100%><TR><TD BGCOLOR=Black>
<blockquote>
<p><font color="WHITE"><i>&raquo;Selbst wenn es gelingt unseren
betagten Rechner anhand einer PPC-Karte in modernere
Leistungsregionen zu pushen, mag das zwar uns begeistern, aber die
Computerwelt wird dies nicht sonderlich
tangieren.&laquo;</i></font></p>
</blockquote>
</td>
</tr>

<tr>
<td bgcolor="WHITE">
<p>Wei&szlig;t du was? Das`s mir Schei&szlig;egal! Ich habe meinen
Amiga, ich habe ihn jetzt, und ich mag ihn. F&uuml;r die Computer
Industrie wird der Amiga IMMER eine Daddelkiste sein, sofern die
Leute ihn &uuml;berhaupt noch kennen. Der B&uuml;romarkt setzt viel
zu sehr auf Kombatibilit&auml;t, da ist nichts neues m&ouml;glich.
Wenn der Amiga hier wieder nur auf Emulation setzt haben wir
endg&uuml;ltig verloren!<br>
Der Amiga k&ouml;nnte wieder als g&uuml;nstiges Modell in den
Heimcomputermarkt eindringen, aber wenn ich ehrlich sein soll: Ich
w&auml;hre dagegen! Im Moment unterh&auml;lt der Amiga eine mehr
oder weniger "exclusive" Fangemeinde, und dieses Gef&uuml;hl ist
echt sch&ouml;n! Oder schreibt dir Billy Boy vieleicht
Ostergr&uuml;&szlig;e?</p>

<p>Wenn ich mir ansehe, was f&uuml;r Idioten heutzutage meinen,
Ahnung von Computern (PeeCeehs) zu haben, da dreht sich mir der
Magen um. Ich glaube, die nennt man auch "Script Kids", in
Anlehnung an die billigen Scriptviren. Wenn die sp&auml;ter mal zum
Amiga kommen, geh ich zum C64!<br>
A propos Scriptviren: Schon einen Melissa bekommen? Ich leider noch
nicht. :-( Aber ich hab hier den Source Code, mal sehen, was ich
damit machen kann...</p>
</td>
</tr>
</table>
</td>
</tr>
</table>
</TD></TR></TABLE></center>

<br>
 

<center>
<table border="1" cellspacing="0" cellpadding="5" width="85%">
<tr>
<td bgcolor="RED">
<table border="1" cellspacing="0" cellpadding="0" width="100%">
<tr>
<TD>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH=100%><TR><TD BGCOLOR=Black>
<blockquote><font color="WHITE"><i>&raquo;Es ist vergebene
Liebesm&uuml;h den Amiga mit den PC zu vergleichen, und zu hoffen
das der Amiga dabei als strahlender Sieger
hervorgeht.&laquo;</i></font></blockquote>
</td>
</tr>

<tr>
<td bgcolor="WHITE">
<p>Wieso mu&szlig; man eigentlich immer besser sein? Mir reicht was
ich habe, ich bin zufrieden. Einige Sachen kann der Amiga besser
(E-Mail mit AOL? Das ich nicht lache!), einige halt der PC (Hm, mir
f&auml;llt im Moment leider nix ein. Macht nix...).</p>
</td>
</tr>
</table>
</td>
</tr>
</table>
</TD></TR></TABLE></center>

<br>
<center>
<table border="1" cellspacing="0" cellpadding="5" width="85%">
<tr>
<td bgcolor="RED">
<table border="1" cellspacing="0" cellpadding="0" width="100%">
<tr>
<TD>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH=100%><TR><TD BGCOLOR=Black>
<blockquote><font color="WHITE"><i>&raquo;Also, die PPC-Zukunft ist
nicht gew&auml;hrleistet.&laquo;</i></font></blockquote>
</td>
</tr>

<tr>
<td bgcolor="WHITE">
<p>Also, die MMC-Zukunft eigentlich auch nicht.</p>
</td>
</tr>
</table>
</td>
</tr>
</table>
</TD></TR></TABLE></center>

<br>
<center>
<table border="1" cellspacing="0" cellpadding="5" width="85%">
<tr>
<td bgcolor="RED">
<table border="1" cellspacing="0" cellpadding="0" width="100%">
<tr>
<TD>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH=100%><TR><TD BGCOLOR=Black>
<blockquote><font color="WHITE"><i>&raquo;Gateway hat schwach
(passiv) angefangen und scheint endlich in die G&auml;nge zu
kommen.&laquo;</i></font></blockquote>
</td>
</tr>

<tr>
<td bgcolor="WHITE">
<p>Also, bisher ist noch nichts gekommen. Wir wollen doch immer
sch&ouml;n sachlich bleiben...</p>
</td>
</tr>
</table>
</td>
</tr>
</table>
</TD></TR></TABLE></center>

<br>
<center>
<table border="1" cellspacing="0" cellpadding="5" width="85%">
<tr>
<td bgcolor="RED">
<table border="1" cellspacing="0" cellpadding="0" width="100%">
<tr>
<TD>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH=100%><TR><TD BGCOLOR=Black>
<blockquote><font color="WHITE"><i>&raquo;Es soll sogar welche
geben, die nur an das glauben was sie sehen... Und was ist mit dem
Wind? Was ist mit Strom? Was ist mit Magnetismus? Was ist mit der
Erdanziehungskraft? Was ist mit...&laquo;</i></font></blockquote>
</td>
</tr>

<tr>
<td bgcolor="WHITE">
<p>Hui, war das ein Angriff? Nanana ;-)</p>
</td>
</tr>
</table>
</td>
</tr>
</table>
</TD></TR></TABLE></center>
<BR>
<center>
<table border="1" cellspacing="0" cellpadding="5" width="85%">
<tr>
<td bgcolor="RED">
<table border="1" cellspacing="0" cellpadding="0" width="100%">
<tr>
<TD>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH=100%><TR><TD BGCOLOR=Black>
<blockquote><font color="WHITE"><i>&raquo;Aber Fakt (!!!) ist: 1.
Das OS 3.5 wird derzeit au&szlig;er Haus (Haage&amp;Partner)
entwickelt!-</i></font></blockquote>
</td>
</tr>

<tr>
<td bgcolor="WHITE">
<p>Das wei&szlig; ich, hab ich zwar nicht mit eigenen Augen
gesehen, aber daf&uuml;r stand dar&uuml;ber ein unabh&auml;ngiger
Bericht in der AmigaOS.</p>
</td>
</tr>
</table>
</td>
</tr>
</table>
</TD></TR></TABLE></center>

<br>
<center>
<table border="1" cellspacing="0" cellpadding="5" width="85%">
<tr>
<td bgcolor="RED">
<table border="1" cellspacing="0" cellpadding="0" width="100%">
<tr>
<TD>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH=100%><TR><TD BGCOLOR=Black>
<blockquote><font color="WHITE"><i>&raquo;2. AI entwickelt zur Zeit
einen neuen Amiga (Hardware &amp; OS 5.0)&laquo;</i></font>
</blockquote>
</td>
</tr>

<tr>
<td bgcolor="WHITE">
<p>Das wei&szlig; ich nicht. Soll ichs nochmal sagen? Na? O.K., ein
letztes Mal: Ich glaube nur, was ich sehe! :-)</p>
</td>
</tr>
</table>
</td>
</tr>
</table>
</TD></TR></TABLE></center>

<br>
<br>
<center>
<table border="1" cellspacing="0" cellpadding="5" width="85%">
<tr>
<td bgcolor="YELLOW">
<table border="1" cellspacing="0" cellpadding="5" width="100%">
<tr>
<TD BGCOLOR=black>
<p><font color="WHITE">O.K., der Rest wurde irgendwie schon gesagt,
oder ist selbsterk&auml;rend. Ich m&ouml;chte nur noch eins sagen:
Ich w&uuml;rde mir jetzt endlich gerne ein PPC-Board kaufen, aber
jetzt, wo ich grade die Knete habe, gibts keine mehr. <u>So</u>
kann aus PPC nat&uuml;rlich &uuml;berhaupt nichts werden
:-(((</font></p>
</td>
</tr>
</table>
</td>
</tr>
</table>

<!--The Saint!-->

<center><a href="mitglieder/castro.html"><img src="thesaint.gif" width="142" height="51" alt="The Saint" border="0"></a><br><small><font color="#FFFF00">Markus Castro</font></small></center>

<center><a href="NoCover.html"><img src="l_hauptinhalt.jpg" width="320" height="50" alt="Link zum Inhalt der NoCover" border></a><br>
</center>
</center>
</body>
</html>

