<html>
 <head>
<meta name="description" content="Diskussionen">
<meta name="author" content="Sieglinde Peters"
     <title>Es war einmal! Sieglinde Peters</TITLE>
</head>
  <body>
  <body background="stucco.gif" text=black link=darkblue alink=green>
    <Font Color=red>
      <center>
            <h1> Es war einmal?</h1>
    </Font Color=red>    
      </center>
<IMG SRC="compwom.gif" ALIGN=right Width=88 height=88>
<p>
<Font Size=5>
Antwort auf Mark Toms Diskussionsbeitrag <br>
</Font Size=5>
<Font Color=black Font Size=4>
Hallo Markus<br>
Da Du mich in Deinem Diskussionsbeitrag <Font Color="red">"Es war einmal"</Font Color="red">
direkt angesprochen hast, m&#246;chte ich Dir auch direkt darauf antworten:
<BR>
Eines mu&#223; ich zuerst einmal sagen:
<Font Color="red">Ich spucke niemanden vor die F&#252;&#223;e.
Das ist nicht mein Stil.</Font Color="red"> Ich habe nur sachlich festgestellt, da&#223;
auf der letzen Messe noch nicht viel von der Firma Amiga zu sehen war. Im Gegensatz zu
Dir kann ich mich aber auch nicht erfurchtsvoll vor der Firma Amiga.Inc verneigen.
Warum sollte ich das auch?-<br>
Amiga.Inc ist f&#252;r mich eine Firma wie andere auch. Sie m&#246;chte ein Produkt
herstellen, da&#223; ich (die Kundin) m&#246;glichst kaufen soll. Irgendwann mu&#223;
die Tochterfirma von Gateway auch Gewinn abwerfen, sonst ist der n&#228;chste Konkurs
unausweichlich und das w&#228;re dann das endg&#252;ltige Aus f&#252; unsere Freundin.<br>
Damit ich den NGAmiga auch wirklich kaufe, mu&#223; er gut sein.<br> Das hei&#223;t:<BR>
Das Amigagef&#252;hl ( oder wie immer man das nennen will) mu&#223; man 
noch erkennen k&#246;nnen,<br> 
er mu&#223; dem heutigen Stand in der Computertechnik entsprechen,<br>
der Preis mu&#223; akzeptabel sein,<br>
und Software mu&#223; gen&#252;gend vorhanden sein.<br>
Sind alle diese Merkmale erf&#252;llt, wird mein n&#228;chster Rechner bestimmt wieder
ein Amiga.<br> 
<p>
Den Vergleich des Amiga mit einem PC w&#228;re vor einigen Jahren sicher zu Gunsten
des Amigas ausgefallen, heute ist ein Vergleich nicht mehr m&#246;glich. Da stimme ich
Dir zu. Ich wurde schon Amigauserin als der Amiga im Heimbereich noch vor dem PC 
angesiedelt war. Begonnen habe ich mit einem A500, den ich nach und nach mit einer
Festplatte (die damals noch sehr teuer war) 2MBChip-und 3MB Fastram und Kick 2.1 
aufger&#252;stet hatte.Nach der &#220;bernahme durch Escom habe ich mir dann den A1200
gekauft. Wenn Du einmal einen Blick auf meine Rechnerkofiguration in der Mitgliederliste
wirfst, wirst Du feststellen, da&#223; mein Rechner wieder aufger&#252;stet werden
mu&#223;. Gerade als ich das in Angriff nehmen wollte kam die Mitteilung von Amiga.Inc.,
da&#223; sie die ClassicAmigas nicht mehr unterst&#252;tzen wollten. Inzwischen haben
die ihre Meinung zwar schon wieder ge&#228;ndert, aber ich traue dem Braten nun nicht
mehr so richtig. Ich habe f&#252r mich pers&#246;nlich entschieden bis zur Messe zu 
warten. Das hei&#223;t nun nicht, da&#223; ich da schon so einen Superamiga zum Kaufen
erwarte, aber ich m&#246;chte doch schon etwas von dem NGAmiga sehen und einen Eindruck
davon bekommen, was die Firma Amiga plant. Dann w&#228;re ich auch bereit noch weiter
zu warten. Allerdings, lieber Markus, ist auch in meinem Alter die Geduld nicht
unersch&#246;pflich. <br>
Also warten wir ab und trinken wir Tee und sprechen uns auf der n&#228;chsten Amigamesse
wieder wo immer die dann auch sein mag in Hennef oder K&#246;ln.
<hr>
<Strong>Viele Gr&#252;&#223;e Sieglinde
</Font Size=5>
<Font Color=black Font Size=4>
<br>
<hr>
    <CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
  </body>
</html>