<html>
<head>
<title>Irre Zukunfstvisionen</title>
</head>
<body bgcolor="BLACK" text="WHITE">
<center>
<h1><font color="darkgreen">Schreckens-<wbr>Visionen</font></h1>

<br>
<table width="90%" border="1" cellspacing="0" cellpadding="5"
bgcolor="DARKGREEN">
<tr>
<td>
<table border="1" cellspacing="0" cellpadding="3" bgcolor="BLACK">
<tr>
<td>Ich mu&szlig; zugeben, als ich Aragons Visionen la&szlig;
wu&szlig;te ich zuerst nicht, was ich nun denken sollte. Klar,
Fortschritt mu&szlig; sein, andernfalls h&auml;tten wir einen
R&uuml;ckschritt. Allerdings halte ich einige der angesprochenen
Dinge f&uuml;r Bl&ouml;dsinn (wenn sie auch machbar
w&auml;ren).</td>
</tr>
</table>
</td>
</tr>
</table>

<br>
<table width="90%" border="1" cellspacing="0" cellpadding="5"
bgcolor="DARKGREEN">
<tr>
<td>
<table border="1" cellspacing="0" cellpadding="3" bgcolor="BLACK">
<tr>
<td>Irgendwie erinnerte mich das alles an die Visionen einer
Zukunft, in der der Mensch sich nur noch im Cyberspace bewegt,
alles per Gedanken steuert, und nicht einen Finger r&uuml;hren
mu&szlig;. Alles wird von Robotern erledigt, die s&auml;mtliche
W&uuml;nsche von den Augen ablesen k&ouml;nnen. Ohne die Technik
ist kein Auskommen mehr, keiner kann sich ihr entziehen. Das halbe
Leben spielt sich nur in Gedanken ab, man kann beinahe alles
virtuell erledigen. Man mu&szlig; nicht aufstehen zum essen, per
Gedanken ruft man einfach ein Menu auf, das einen Schlauch mit
"Nahrung" steuert. K&ouml;rperliche Bet&auml;tigung ist
unn&uuml;tz, alles wird gedankengesteuert von Maschinen erledigt.
Der Mensch wird degradiert auf die Summe seiner &uuml;berlegungen,
er dient praktisch nur noch als Schaltungselement. Der Cyberspace
wird zur alles beherrschenden Droge, der Kapitalismus droht
zusammenzubrechen, da die Leute kaum noch etwas kaufen.</td>
</tr>
</table>
</td>
</tr>
</table>

<br>
<table width="90%" border="1" cellspacing="0" cellpadding="5"
bgcolor="DARKGREEN">
<tr>
<td>
<table border="1" cellspacing="0" cellpadding="3" bgcolor="BLACK">
<tr>
<td>Wer noch nicht genug hat, der sollte mal weiterlesen, es wird
noch besser:

<p>Die Globale Industrialisierung erlebt einen nie gekannten
Vorschub, die Natur wird immer weiter zur&uuml;ckgedr&auml;ngt. Der
Regenwald existiert nicht mehr, er wurde abgeholzt und statt dessen
eine Luftkl&auml;ranlage aufgestellt. Wer in sich dennoch einmal
ansehen will (nat&uuml;rlich "virtuell" im "Cyberspace") geht
einfach nach VRML://www.regenwald.org (VRML="Virtual Reality Markup
Language").</p>

<p>Es wurden nat&uuml;rlich auch einige Probleme gel&ouml;st: Z.B.
gibt es keine Verschmutzung durch Autos mehr - wenn keiner mehr von
zu Hause loskommt, braucht auch keiner mehr ein Auto.</p>

<p>Die Menschheit hat das Problem der &uuml;berbev&ouml;lkerung
gel&ouml;st: Sie schwindet immer weiter, weil jeder sich seinen
Kick unter VRML://www.sex.com holen kann - alles virtuell, versteht
sich. Wer braucht da noch eine Freundin?</p>

<p>Kriege existieren allerdings noch. Es war gar nicht so einfach
den menschlichen Drang zu Herschen und zu erobern zu stillen, aber
es wurde geschafft. Unter VRML://www.krieg.com spielen die
Herrscher ein riesiges Risiko Game, das &uuml;ber das Schicksal der
Welt entscheidet. Virtuell nat&uuml;rlich, es k&uuml;mmert die
meisten Leute nat&uuml;rlich nicht, ob sie nun aus Frankreich oder
doch aus Deutschland in den Cyberspace kommen.</p>

<p>Shutterbrillen sind &uuml;brigens schon lange out, die Computer
werden bereits direkt nach der Geburt ins Gehirn eingepflanzt, die
Kinder kennen nichts au&szlig;er den Cyberspace. Die Beziehung zur
Natur ist dennoch st&auml;rker denn je - auf VRML://www.nature.de
kann man sich Bilder von einem echten (!) Baum ansehen, sogar
Hologramme von dem letzten echten Hund k&ouml;nnen runtergeladen
werden. Es kursieren sogar Ger&uuml;chte, da&szlig; irgendwo im
Herzen Chinas noch Menschen ohne Cyberspace - Zugang leben.</p>
</td>
</tr>
</table>
</td>
</tr>
</table>

<br>
<table width="90%" border="1" cellspacing="0" cellpadding="5"
bgcolor="DARKGREEN">
<tr>
<td>
<table border="1" cellspacing="0" cellpadding="3" bgcolor="BLACK">
<tr>
<td>Alles in allem nat&uuml;rlich ein gro&szlig;er Schritt
vorw&auml;rts, und vor allem:<br>
Fortschritt!

<p>Ich rekapituliere nochmal: Wenn alle diese Visionen wahr werden,
sitze ich im Jahr 2020 im Cyberspace in VRML://www.zug.de, und
erfreue mich an diesen altmodischen Techniken (Shutterbrille ...
Auto ... Hund ... ), und bin auf dem Weg nach
VRML://www.freundin.de/members/CastroM/021513/home.vrml zu meiner
Freundin ... einfach toll dieser Fortschritt!</p>
</td>
</tr>
</table>
</td>
</tr>
</table>

<br>
<center><a href="mitglieder/castro.html"><img src="thesaint.png"
width="143" height="52" alt="The Saint" border="0"></a><br>
<small><font color="#00FF00">Markus Castro</font></small></center>

<center><a href="NoCover.html"><img src="l_hauptinhalt.jpg" width= 
"320" height="50" alt="Link zum Inhalt der NoCover" border=
"0"></a><br>
</center>
</center>
</body>
</html>

