<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>WolfZ</title>
</head>

<body background="wol1.jpg" text=black link=blue alink=red bgcolor=gray>
<a name="top"></a>
<p>
<center><font color="#000080" size="7"><b>Wolf's Leserbrief</b></font></center></p>
<ul>
<li><a href="#a1"><b>f&uuml;r Thomas Windecker</a></b></li>
<li><a href="#a2"><b>f&uuml;r Rolf N&uuml;nninghoff</a></b></li>
<li><a href="#a3"><b>f&uuml;r Kilian Servais</a></b></li>
<li><a href="#a4"><b>f&uuml;r Markus Thomaschewski</a></b></li>
<li><a href="#a5"><b>f&uuml;r Frank Steinbach</a></b></li>
</ul>
<br><br>
<h3><a name="a1">Gr&uuml;&szlig; Dich Thomas</h3>
<p><font size=+1> Danke, dass Dir meine Art des Test der Aminetreihe
gef&auml;llt. Es ist nicht jedermanns Geschmack und das ist auch ganz
nat&uuml;rlich. Eine Bewertung in Form von Noten er&uuml;brigt sich bei dieser
Reihe. Denn es ist <b> die </b> CD der Softwaresammlungen. Es gibt derzeit
mehrere und manche haben auch ein Schmankerl dabei, aber so uptodate wie das
Aminet ist keine andere Sammlung. Manche f&uuml;llen ihre CD's mit uraltem
Material aus den Anfangszeiten, andere bringen neben gepackter Version die
gleiche Sache nochmals ungepackt und bezeichnen dies mit "sofort startbar". Das
ist alles nur zum F&uuml;llen der Kapazit&auml;t der CD, damit sie sch&ouml;n
voll ausschaut. Die Aminet-CD ist auch nicht das optimalste, aber die Ersteller
m&uuml;ssen halt schauen, dass der zweimonatliche Rhythmus eingehalten werden
kann und damit die CD auch sch&ouml;n voll ist, erscheinen halt auch Uraltbilder
und Wiederholungen von Mods. Aber auch Sachen, die nur Australier oder US
Amerikaner interessiert und von allen Europ&auml;ern einfach &uuml;berlesen
werden. Trotzdem ist diese Aminetreihe ein Muss. Nur nicht jeder kann oder will
sie sich leisten. Aus diesem Grunde erscheint seit Anbeginn der NoCover (mit
kleinen Unterbrechungen) ein Inhaltsverzeichnis der Aminet-CD's. Hier
k&ouml;nnen nun all jene nachschauen, die auf die Aminet-Sets warten, oder
einfach kein Taschengeld f&uuml;r einen regelm&auml;&szlig;igen Bezug
er&uuml;brigen k&ouml;nnen. Aber sie m&ouml;chten gerne informiert sein und sie
sind es auch, die das Inhaltsverzeichnis richtig lesen k&ouml;nnen und es auch
tuen. Da ich pers&ouml;nlich die Aminetreihe seit Nr. 3 (Juli 94) im Abo
beziehe, war mir dieser Umstand anfangs auch nicht bewu&szlig;t und hatte sehr
fr&uuml;h vorgeschlagen, aus Platzmangel und Einsparungsgr&uuml;nden die
Inhaltverzeichnisse wegzulassen. Nach einer kurzen Gegendarstellung und
Erkl&auml;rung hatte ich meinen Standpunkt revidieren m&uuml;ssen und bringe
deshalb auch immer das komplette Verzeichnis. Die Liste der Highlights
rekrutiert sich (wenn ich es richtig verstanden habe) aus H&auml;ufigkeit von
Aufrufen im Netz. Also nach meinem Daf&uuml;rhalten gro&szlig;enteils von
Studenten, die eine Standleitung zur Verf&uuml;gung haben und sich etwas
l&auml;nger im Netz aufhalten k&ouml;nnen ohne dass der eigene Geldbeutel gleich
so strapaziert wird. Ein zus&auml;tzliches Vorstellen von Programmen geschieht
nur aus meinem Blickwinkel und ich wei&szlig;, dass ich bestimmt sehr
interessante Dinge einfach &uuml;bersehen habe. Spiele, Mods, Pictures und
Animationen lasse ich aus meinen Betrachtungen heraus. Erstens kenne ich mich
nicht aus, zweitens ist der Geschmack eines 59-j&auml;hrigen nicht immer mit dem
von Twenties gleichzusetzen und drittens wird dieses Metier von anderen schon
begrast.</p>

<p>Bei Vorstellungen von Programmen kann es nat&uuml;rlich gut sein, dass ich
auch Passagen aus der entsprechenden ReadMe Datei herausziehe und sie
&uuml;bernehme. Warum soll ich mit eigenen Worten nochmals das gleiche zum
Ausdruck bringen, was der Autor selber sagt und der muss doch am ehesten wissen,
was sein Programm leistet und was nicht. Die Schwachpunkte wird er selber
nat&uuml;rlich nicht hervorheben und die m&uuml;ssen dann gefunden werden.</p>

<p>Schwierig und diffizil sind die Programmbeigaben. Nachteilig wird aber meist
eine Besprechung eines Vollprogrammes mit einer &auml;lteren Versionsnummer,
wenn ich derzeit die neueste Version selbst installiert habe. Nimm als Beispiel
ArtEffect 1.5 von der letzten Aminet. Ich habe die Version 2.5 installiert und
kann nat&uuml;rlich nicht die alte Version installieren. Nun muss ich mich auf
meine alten Kenntnisse verlassen oder auf den Autor, der ja geschrieben hat, was
sich in der neuen Version alles ge&auml;ndert hat. Und daraus muss man dann
einen ehrlichen und glaubhaften Bericht machen. Schlimmer ist es mit
eingeschr&auml;nkten Versionen, wenn man selber die Vollversion hat. Dieser Grat
ist sehr schmal, wenn man ehrlich bleiben will.</p>

<p>Wenn nun einer aufsteht und sagt, er m&ouml;chte die Aminetreihe besprechen,
bitte sehr, ich habe nichts dagegen und vielleicht kommt dann auch ein frischer
Wind in dieses Kapitel. Und beleidigt bin ich keinesfalls.</p>

<p>&Uuml;ber Einstieg ins Internet als Workshop bin ich die falsche Adresse.
Alles was ich wei&szlig;, ist angelesen und &uuml;ber autodidaktisches Studium
selbst erlernt. Da gibt es L&uuml;cken!!! Der Marianen Graben ist bestimmt klein
dagegen. Seit NoCover-22 gibt es in unregelm&auml;&szlig;iger Folge Artikel
verschiedener Autoren &uuml;ber dieses Thema. Einen Dr.Oetker (Beschreibung: man
nehme....) gibt es nicht direkt, aber in vielen Artikeln ist immer dies ein
klein wenig angesprochen bzw es wurden die eigenen Erfahrungen mitgeteilt. Da
sollte schon jeder selber hindurch. Es kommt ja auch immer darauf an, welchen
Schwerpunkt der Einzelne gesetzt hat. Weiteres Kriterium ist die jeweilige
Anlagenausstattung und die Konfiguration. Und es darf nicht vergessen werden,
welche Programme stehen zur Verf&uuml;gung. Sind es nur die eingeschr&auml;nkten
Demoversionen oder die PD Versionen oder steht ein Vollprogramm zur
Verf&uuml;gung. Dies sind alles eminent wichtige Kriterien f&uuml;r solch einen
Dr.Oetker als Gebrauchsanweisung. So schlecht sind die angesprochen
Publikationen nicht. Nur halt nicht immer in vollem Umfange zutreffend. Deswegen
muss jeder nur das herauslesen, was er ben&ouml;tigt.<br>
Reicht die Antwort?<br>
Zum Schlu&szlig; noch ein kleiner Hinweis: Damit Du die NoCover nicht nur im
linken Frame zu sehen bekommst, wenn Du die Schaltfl&auml;che bet&auml;tigst, um
zum NoCover Hauptschirm zur&uuml;ckzukehren, musst Du Deine Anweisung &lt;a
href="NoCover.html"&gt; durch die entsprechende Anweisung erg&auml;nzen &lt;a
href="NoCover.html" target="_top"&gt; und schon hast Du die NoCover wieder
&uuml;ber den gesamten Schirm.
</font></p>
Gehe zum <a href="#top"> Anfang </a>
<hr>
<h3><a name="a2">Gr&uuml;&szlig; Dich Rolf</h3>
<p><font size=+1>
Da Du den Eindruck gewonnen hast, ich habe Dir die Leviten gelesen, bitte ich
Dich vielmals um Entschuldigung. Das lag wirklich nicht in meiner Absicht. In
Deiner Ausf&uuml;hrung dachte ich herausgelesen zu haben, dass Du generell etwas
gegen Mails hast, die mit drei K&ouml;pfen verziehrt sind und Du batest um
Bekanntgabe einer Methode, diese Mails auszufiltern. Ich wollte Dir
gegen&uuml;ber nur zum Ausdruck bringen, dass diese Art der Mails auch ihre
Berechtigung haben. Nat&uuml;rlich gibt es hier ein Handlingsproblem. Wenn
jemand auf eine solche Mail antworten will, muss er schon darauf achten, welche
Schaltfl&auml;che er anklicken muss, die dann zur Auswahl stehen <ul>
<li> an den Absender </li>
<li> an den Absender und alle Empf&auml;nger </li>
<li> an die Empf&auml;nger </li>
<li> abbrechen. </li></ul>
Schickt nun jeder Empf&auml;nger solch eine Schneeballmail komplett inklusive
einer Eingangsbest&auml;tigung an den Absender und an <b> alle </b> ......<br>
Da hast Du Recht. Hier kann Frust aufkommen. Aber dies ist gl&uuml;cklicherweise
eher die Ausnahme.</p>

<p>Jetzt schnell noch ein kleiner Tip. In Deinem Leserbrief (NC-62) hast Du die
Tags <b> &ltLI&gt </b> ohne das f&uuml;hrende Tag <b> &ltUL&gt </b> und <b>
wichtig </b> das abschlie&szlig;ende <b> &lt/UL&gt </b> benutzt. Somit wurde der
gesamte Text als letzter Listenpunkt angesehen und bleibt bei Voyager
einger&uuml;ckt. Voyager kann nicht alle Tags interpretieren und die er kennt,
m&uuml;ssen schon sauber verwendet werden. AWeb und IBrowse sind in manchen
Dingen nicht ganz so pingelig. Aber auch diese Programme werden in der
n&auml;chsten Version empfindlicher reagieren, wenn sie den HTML Standard 4.0
interpretieren k&ouml;nnen. Deswegen ist es kein Fehler, wenn Du jetzt schon in
Deinen Texten auch das <b> &lt/LI&gt </b> schreibst. Dann gibt es sp&auml;ter
keine Schwierigkeiten.</p>

<p>Vielen Dank auch an dieser Stelle &uuml;ber Dein Lob. Dieses hat mich wieder
etwas aufgerichtet, ob der vielen Schl&auml;ge, die ich diesmal verabreicht
bekam. <br>
Alles Gute bis zum n&auml;chsten Mal.</font></p>
Gehe zum <a href="#top"> Anfang </a>
<hr>
<h3><a name="a3">Gr&uuml;&szlig; Dich Kilian</h3>
<p><font size=+1> Auch Dir gilt mein Dank ob Deiner mutmachenden Worte an mich.
Aber f&uuml;r eine Erw&auml;hnung in den Feedback-Highlights brauchst Du Dich
nicht zu bedanken. Ich ver&ouml;ffentliche nun seit fast drei Jahren Artikel und
Statements und bisher habe ich auch immer gesagt, wenn mir etwas weniger
gefallen hat, aber auch wenn mir ein Artikel zusagte. Aber
Missfallens&auml;u&szlig;erungen kommen nicht immer an und deshalb habe ich
meine Meckerecke auch wieder eingestellt. Und in den sogenannten Highlights oder
Top 5 oder wie sie sonst bezeichnet werden erscheinen dann die Beitr&auml;ge,
die mir und meinem pers&ouml;nlichen Geschmack positiv aufgefallen sind.
Nat&uuml;rlich sagt die Zahl F&uuml;nf nicht viel aus, darf aber auch keinen
Anhaltspunkt einer Wertigkeit geben. Andere haben einen anderen Geschmack und
andere Interessen und schon werden f&uuml;nf andere Favoriten benannt. Diese
Wertgebung ist also eine ganz inviduelle Angelegenheit und sagt im Prinzip nicht
viel &uuml;ber den tats&auml;chlichen Lese- und Inhaltswert aus. Ein
ausgewerteter Feedback von sagen wir mal 20 % aller Leser w&uuml;rde schon eher
einen g&uuml;ltigen G&uuml;tesiegel abgeben, aber keinesfalls von den vier oder
f&uuml;nf Autoren, die sich emotionsvoll und vielleicht auch freundschaftlich
orientieren.</p>

<p>Sollte diesmal keine Wolf-INFO enthalten sein, also auch kein Feedback, dann
m&ouml;chte ich Dir an dieser Stelle sagen, dass mir Deine CD-Tests gefallen
haben. Wenn Du nun noch eine PicassoIV in Betrieb h&auml;ttest, dann
h&auml;ttest Du bald so viele Gurus bewundern k&ouml;nnen, wie Spiele auf einer
CD sind. Das ist der Preis daf&uuml;r, wenn man mit alten Kamellen noch Geld
verdienen will. Was glaubst Du, warum ich seit zwei Jahren keine 19,80 DM mehr
f&uuml;r damals monatliche nun zweimonatliche CD-Erscheinungen ausgebe? Durch
die Unwucht der Scheiben dr&ouml;hnt mein CD-Laufwerk regelrecht und
lauff&auml;hig ist beileibe nicht mehr alles auf den etwas gr&ouml;&szlig;eren
Maschinen. Das Dr&ouml;hnen kann man mittels eines leichten Druckes des Daumens
meist noch in Grenzen halten, aber die Programme und Bilder werden deshalb auch
nicht besser. Der Kauf auf der Messe waren die letzten dieses Genres f&uuml;r
mich und ich habe bis heute noch keine Ahnung, was da alles auf den gekauften
Scheiben drauf sein soll. M&ouml;ge Dir dieser Frust erspart bleiben.<br>
Bleib gelassen und schreibe sch&ouml;n flei&szlig;ig weiter.</font></p>
Gehe zum <a href="#top"> Anfang </a>
<hr>
<h3><a name="a4">Gr&uuml;&szlig; Dich Markus</h3>
<p><font size=+1>Eigentlich wollte ich Dir eine eMail schicken, was ich auch
getan hatte, leider kam sie bei Dir nicht an, sondern wurde wieder retourniert.
</font></p>
<blockquote><p>
The original message was received at Sun, 4 Apr 1999 17:44:23 -0400 (EDT)<br>
from mailout08.btx.dtag.de [194.25.2.156]</p>

<p>*** ATTENTION ***</p>

<p>Your e-mail is being returned to you because there was a problem with its
delivery.  The AOL address which was undeliverable is listed in the section
labeled: "----- The following addresses had permanent fatal errors -----".</p>

<p>The reason your mail is being returned to you is listed in the section
labeled: "----- Transcript of Session Follows -----".</p>

<p>The line beginning with "&lt;&lt;&lt;" describes the specific reason your
e-mail could not be delivered. The next line contains a second error message
which is a general translation for other e-mail servers.</p>

<p>Please direct further questions regarding this message to your e-mail
administrator.<br><br>

--AOL Postmaster</p>

<p> ----- The following addresses had permanent fatal errors -----<br>
&lt;MThoma6980@aol.com&gt;<br><br>
&gt;&gt;&gt; RCPT To:&lt;MThoma6980@aol.com&gt;<br>
&lt;&lt;&lt; 550 MAILBOX NOT FOUND<br>
550 &lt;MThoma6980@aol.com&gt;... User unknown<br>
usw.</p></blockquote>
<p><font size=+1>Der Inhalt der Mail lautete folgenderma&szlig;en:
<blockquote><i>
Gr&uuml;&szlig; Dich Markus!<br><br>

Deine Zeilen an mich in Deinem Artikel fand ich gar nicht gut, da Du den
Sachverhalt vollkommen falsch dargestellt hast. Lies erst noch einmal meine
Wolf-INFO/Messe Nachlese in der NC-58 und dann lies mal Deine S&auml;tze an
mich. Du wirst feststellen, dass Du ganz gewaltig auf dem falschen Fu&szlig;e
Hurra gebr&uuml;llt hast.<br><br>

Sollte mein Schreibstil tats&auml;chlich gem&auml;&szlig; meines Alters
antiquiert sein und automatisch zu Fehlinterpretationen verleiten, dann sagt es
mir und ich h&ouml;re sofort auf, Artikel f&uuml;r die NoCover zu
schreiben.<br><br>

Mein Vorname lautet ganz einfach nur Wolf und nicht Wolfgang.<br><br>

Mit freundlichen Gr&uuml;&szlig;en, Wolf</i>
</blockquote>
Solltest Du Dich in der NC-57 bez&uuml;glich Deiner eMail-Adresse verschrieben
haben und Du m&ouml;chtest angemailt werden, dann ist es sinnvoll eine
Berichtigung mindestens in der Mitgliederliste nachzureichen. Hat sich Deine
Mailbox aber ge&auml;ndert und Du teilst dieses nicht mit, ist anzunehmen, dass
Du keine Post erwartest ;-).</font></p>
Gehe zum <a href="#top"> Anfang </a>
<hr>
<h3><a name="a5">Gr&uuml;&szlig; Dich Frank</h3>
<p><font size=+1>Du hast meinen Beitrag an Rolf Nue aus Wue nicht richtig und
nicht genau genug gelesen, sonst h&auml;ttest Du nicht die Angst
ge&auml;u&szlig;ert, ich k&ouml;nne Dich von meiner Sammelmailingliste
streichen. Aber da wir beide bisher noch keinen e-Mail Verkehr hatten, stehst Du
noch gar nicht in meiner Liste. Das ist aber nicht der Grund, dass ich diese
Zeilen schreibe. Mich hat die &Uuml;berschrift Deines Bw-Gedichtes gest&ouml;rt
und zwar sehr gewaltig gest&ouml;rt. Nicht der Inhalt, die &Uuml;berschrift ist
es, was ich als diffamierend f&uuml;r einen ganzen Berufsstand ansehe. Und komme
mir bitte jetzt nicht mit den abgedroschenen Phrasen, das zieht nicht mehr. Du
darfst sogar potentieller M&ouml;rder sagen und bekommst vom obersten Gericht
noch Recht. Trotzdem sage ich immer ganz laut, wenn mich etwas st&ouml;rt und
ich es geschmacklos finde. Und das Wort Schweine finde ich dazugeh&ouml;rend.
Und dazu noch in Gro&szlig; und farblich herausgestellt. Vielleicht reagiere ich
momentan etwas &uuml;berspitzt, weil die &ouml;ffentliche Diskussion &uuml;ber
einen Auslandeinsatz mit teilweise bewu&szlig;t falschen Argumenten gef&uuml;hrt
wird. Ein Berufssoldat und ein Zeitsoldat (ein befristeter Berufssoldat) haben
einen Eid geschworen, die Aufgaben der Bundeswehr nach dem Gesetz nach bestem
Wissen auszuf&uuml;hren und nicht nur das Gehalt einzustecken. Das hat jeder vor
der Unterschrift gewu&szlig;t. Ein Wehrpflichtiger hat ein Gel&ouml;bnis
abgelegt, das deutsche Volk vor Schaden zu bewahren, was er auch in einem
Katastropheneinsatz (Oder&uuml;berschwemmung) unter Beweis stellen kann. Kommt
nun ein Wehrpflichtiger nach Hause oder zur Freundin und sagt, ich bin nach
Somalia abkommandiert oder sonstwohin, dann l&uuml;gt er. Er hat sich freiwillig
gemeldet und dies auch vor mehreren Zeugen schriftlich best&auml;tigt, weil er
wahrscheinlich nicht zu Hause bleiben will, wenn er drei Monate lang weit
&uuml;ber das dreifache Monatsgehalt verdienen kann. Wenn ein Wehrpflichtiger
nein sagt, ist dies oberstes Gesetz und nicht wie auf der Baustelle draussen, wo
ein Polier einem Hilfsarbeiter sagt, hilf hier mal das Ger&uuml;st mit
aufzubauen. Wenn der sagt, er habe Angst, er k&ouml;nnte runterfallen und
deshalb mache er es nicht, hat sofort seine Papiere und keine Arbeit mehr.
Wehrpflichtige Matrosen unterschreiben im Vornherein, sonst k&auml;men sie gar
nicht erst auf ein Schiff. Ich hoffe, dass Du einsichtig bist und beim
n&auml;chsten Mal eine gem&auml;&szlig;igtere &Uuml;berschrift w&auml;hlst.
</p>

<hr>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
<center>
<a href="NoCover.html#a12"> <img border=0 src="l_hauptinhalt.jpg" width=495 height=75></a>
</td></tr></table><br>
</body>
</html>
