<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Markus Thomaschewski">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.06 [de] (Win98; I) [Netscape]">
   <TITLE>Post von Mark Tom</TITLE>
</HEAD>
<BODY BACKGROUND="steinmauer.gif">

<CENTER>
<H1>
<B>Post von Mark Tom</B></H1></CENTER>

<CENTER><B>F&uuml;r <FONT COLOR="#CC0000">Alle</FONT>, <FONT COLOR="#FF6600">Markus
Castro</FONT>, <FONT COLOR="#009900">Wolfgang Zimmer</FONT>, <FONT COLOR="#3366FF">Daniel
Stein</FONT> und meine <FONT COLOR="#993366">Top Neun</FONT></B>
<BR>
<HR SIZE=4 NOSHADE WIDTH="100%"></CENTER>

<P><BR>
<BR>
<H3>
<B>An <FONT COLOR="#3333FF">A</FONT><FONT COLOR="#CC0000">L</FONT><FONT COLOR="#3333FF">L</FONT><FONT COLOR="#CC0000">E</FONT></B></H3>
<FONT COLOR="#000000">Mein Kompliment! Da haben wir es wohl doch tats&auml;chlich
geschafft, uns an unserem eigenem Schopf aus dem Schlamassel zu ziehen!
Die <B>No Cover 62</B> war so voll wie lange nicht mehr und hatte wirklich
viele interessante Artikel zu bieten. Obwohl wir alle zwischen den Classic-Amigas
und der neuen Generation etwas in der Luft h&auml;ngen und es deswegen
schwer f&auml;llt mit Begeisterung Artikel zu schreiben, haben wir dennoch
Einsatz gezeigt. Wenn es richtig losgeht mit den neuen <B>Wunderkisten</B>,
wird die No Cover wohl endg&uuml;ltig explodieren. <B>KAWUUUM!</B></FONT>
<P>Alle <B>Story-Games</B>-Autoren und die sich daf&uuml;r interessieren,
sollten bitte meine Zeilen an Daniel Stein lesen! Danke.
<BR>&nbsp;
<P>
<HR ALIGN=LEFT WIDTH="100%">
<BR>&nbsp;
<H3>
<B>An <FONT COLOR="#3333FF">Markus</FONT> / <FONT COLOR="#CC0000">The Saint
</FONT>/
<FONT COLOR="#3333FF">Castro</FONT></B></H3>
Uff, Deine <B>Feedbackcorner</B> aus der letzten <B>No Cover</B> hat mich
ganz sch&ouml;n &uuml;berrascht! Wieso? Ich glaube Du warst bisher der
Erste und somit Einzige, der buchst&auml;blich auf (fast) <U>alle</U> Artikel
einging! K&ouml;nnt ich nicht. W&auml;r mir echt zuviel Arbeit. Weniger
wegen der Tipparbeit an sich, sondern wegen dem lesen aller Artikel und
sich dann noch gro&szlig;artig die M&uuml;he zu machen, was passendes dazu
zu schreiben.
<P>Und ich fand nicht, da&szlig; Du zu kritisch warst. Eine <B>Feedbackcorner</B>
nach dem Motto "<I>Alles super - alles dufte hier!</I>" w&auml;re verlogen
und &uuml;berfl&uuml;ssig. Wie Du lesen konntest, ist mir die Lust zu streiten
nicht v&ouml;llig vergangen. Aber irgendwie wurde alles Wichtige mehr oder
weniger ausdiskutiert. Und dazu lernen wollt ihr ja auch nichts. :) Ich
habe erst diese Tage wieder meinen allerersten Diskussionsbeitrag zum Thema
MMC vs PPC ("Neue Hoffnung") gelesen und festgestellt, das bereits in diesem
alles gesagt wurde und er immer noch topaktuell ist. Es ist irgendwie ein
herzerfrischendes Gef&uuml;hl, das Leute wie Du bei diesem Thema so daneben
liegen! :) Unter Blinden f&uuml;hlt sich der Ein&auml;ugige n&auml;mlich
wie ein K&ouml;nig! Oder so. :)
<P>Mal &acute;ne andere Sache: Wie ich sehe, werden die Charts-Tabellen
in der <B>FD-Hitparade</B> immer noch im unattraktiven Ascii-Stil gehandhabt.
Wieso eigentlich? Gibts daf&uuml;r einen Grund oder bist Du nur zu faul
HTML-Tabellen zu erstellen? Ich habe mal ein Programm geschrieben, wo man
aus Datenbest&auml;nden automatisch HTML-Tabellen generieren kann. Wenn
Du m&ouml;chtest kannst Du dieses Tool von mir bekommen. Stell Dir einfach
eine Datenbank mit einfacher GUI vor, wo Du die Charts simpel verwalten
kannst. M&ouml;chtest Du diese Daten nun in Form einer HTML-Tabelle (optional:
Ascii-Tabelle) haben, w&auml;hlst Du die entsprechende Option - und schwupps
wird ein Ascii-File mit dem HTML-Quellcode abgespeichert, das Du nur noch
an die entsprechende Stelle der FD-Charts kopieren mu&szlig;t. Interesse?
<BR>&nbsp;
<P>
<HR ALIGN=LEFT WIDTH="100%">
<BR>&nbsp;
<H3>
<B>An <FONT COLOR="#3333FF">Wolfgang</FONT> <FONT COLOR="#CC0000">Zimmer</FONT></B></H3>
Bitte nimm mir meine deutlichen Worte aus meinem letzten Diskussions-Artikel
nicht &uuml;bel, denn ich sch&auml;tze Deine Beitr&auml;ge f&uuml;r den
Club. Aber Du scheinst wirklich nicht up-to-date zu sein, wenn ich mir
so Dein letztes <B>Wolf-Info</B> durchlese. Gehst Du allen ernstes davon
aus, das man erst in zwei bis drei Jahren mit NG-Amigas rechnen kann?!
Es ist Mai 1999 und ich befinde mich auf dem Planeten Erde. Wo verweilst
Du gerade?
<P>Entschuldige bitte wieder meinen provokanten Unterton, aber anders kann
ich meine Verwunderung nicht deutlich genug ausdr&uuml;cken. Ich w&uuml;rde
wirklich gerne wissen, was Du dachtest, als Du diese Zeilen getippt hast.
Ich meine, hast Du Dir dabei &uuml;berhaupt was gedacht, oder nur aus Wut
auf Gott und die Welt, in pessimistischer Miese-Peter-Laune,
<BR>alles in Frage gestellt?! Oh man, h&ouml;rt das Geseiere denn nie auf?!
Ich hab&acute;s satt! Die Schnauze bis oben hin voll! Verdammt nochmal,
wieso reagiere ich eigentlich noch auf so ein Geschreibsel?
<P>Vielleicht, weil Du kein <B>dahergelaufener Depp</B> bist? Wenn Du das
w&auml;rst, w&uuml;rde ich wohl nur milde l&auml;cheln. Aber wenn Amiga-Fans
(f&uuml;r mich Grund genug solche Menschen zu m&ouml;gen) sowas schreiben
und diese Amiga-Fans dazu noch bei mir ein gewisses Ansehen&nbsp; haben
(ja, das war ein zart dahin gehauchtes Lob), l&auml;&szlig;t mich das nicht
mehr kalt!
<P>Du brauchst wirklich nicht hierauf zu antworten (bringt sowieso nix,
oder?), ich wollt&acute;s halt nur los werden. Vielen Dank f&uuml;r Deine
Aufmerksamkeit!
<BR>&nbsp;
<P>
<HR ALIGN=LEFT WIDTH="100%">
<BR>&nbsp;
<H3>
<B>An <FONT COLOR="#CC0000">Daniel</FONT> <FONT COLOR="#3333FF">Stein</FONT></B></H3>
Du hast ja in der letzten No Cover zurecht bem&auml;ngelt, das die Story-Games
sich langsam in Luft aufl&ouml;sen. Aber daran seid ihr (so sehe ich das
jedenfalls) selber Schuld. Ich sehe das erfolgreiche Grundkonzept von den
Story-Games ganz anders als Du. Du schreibst, das die erste Regel w&auml;re,
das es keine Regel g&auml;be, nur die &Uuml;berg&auml;nge m&uuml;&szlig;ten
stimmen. Das ist der sichere Todesto&szlig; f&uuml;r eine lange und erfolgreiche
Story-Games History. Mal ehrlich, au&szlig;er den Story-Games Autoren hat
sich doch kaum jemand f&uuml;r die Geschichten interessiert, oder etwa
nicht?! Woran das lag?
<P><B>Erste Schwachstelle im Konzept:</B> An dem fehlen einer interessanten
Story. Es wurde im Star-Trek-Thema rumgealbert, was ja streckenweise sehr
lustig war, aber doch schnell langweilte. Ich meine der Sinn kann doch
nicht daran liegen, noch mehr Gags und "dumme" Spr&uuml;che in noch weniger
Text zu packen!
<P><B>Zweite Schwachstelle im Konzept:</B> Dadurch das jeder zu jeder Zeit
einen Teil schreiben darf, verzweigt die Story sich bis ins unerkenntliche.
Da halbwegs als Leser die &Uuml;bersicht zu behalten, ist ein Ding der
Unm&ouml;glichkeit! Wieso sollte ich dann die Storys lesen? Ein Story-Manager,
wie bei der Feedbackcorner, w&auml;re sinnvoll. Alle Autoren melden sich
an und werden in eine Liste eingetragen. Wenn man an der Reihe ist, f&uuml;hrt
man die Story weiter.
<P><B>Dritte Schwachstelle im Konzept:</B> &Auml;ndert sich mit jedem Teil
eines Story-Games der Stil v&ouml;llig, entt&auml;uscht dies in der Regel
den Leser. Du liest zum Beispiel den ersten Teil einer Story, der im Stil
eines Krimi-Noir geschrieben wurde und findest ihn gelungen und spannend.
Damit ist dem Autor was gelungen, was alle Autoren erreichen wollen: der
Leser ist gespannt wie es weiter geht und freut sich schon auf den n&auml;chsten
Teil. Und auf einmal f&auml;llt Bill Gates von der Zimmerdecke, Ernie und
Bert kommen ins Zimmer gerannt und entf&uuml;hren Bill... "<I><FONT COLOR="#3333FF">Urgs,
was ist das denn f&uuml;r ein schei&szlig;...?</FONT></I>!" denkt sich
der Leser beim zweiten Teil. Das dieser sich dann den dritten Teil noch
anttut kannste verge&szlig;en! Merke: Eine Ulk-Story sollte immer eine
sein und auch bleiben, eine Horror-Story sollte immer eine sein und auch
bleiben... usw.
<P>Das beste Beispiel wie man es nicht machen sollte, hast Du selber gegeben.
Dein Versuch einen neuen Zweig in die Story-Games zu integrieren beinhaltet
alle denkbaren Fehler: es ist zwar wirklich sehr gut geschrieben, in meinen
Augen ist es sogar druckreif, aber weder gibts eine Hintergrundgeschichte,
zudem &uuml;berl&auml;&szlig;t Du es in den anderen in welche Richtung
die Story weitergeht. Wenn Du Gl&uuml;ck hast, wird es ein paar Folge-Storys
geben, aber eher fr&uuml;her als sp&auml;ter, verl&auml;uft auch dieser
Zweig im Sande.
<P>Damit etwas Bestand hat, braucht es einen festen Sockel, eine Welt in
der man sich sicher bewegen kann. So eine Welt sollte nicht festgefahren
sein, sondern mit den Autoren mitwachsen. Du denkst Dir jetzt sicher zurecht,
das es doch langweilig wird, wenn es immer nur um einen Stil bzw. einem
Genre geht, wie dem Science Fiction. Aber wer sagt denn, das es nur ein
einziges Story-Game geben darf?! Es k&ouml;nnte ein Western-Story-Game,
ein Horror-Story-Game, ein Agenten-Persiflage-Story-Game, usw. geben.
<P>Hier sind meine <B><FONT COLOR="#FF6600">drei goldenen Regel</FONT></B>:
<UL>
<LI>
Eine interessante Story ist das A und O!</LI>

<LI>
Immer nur eine Folge nach der anderen!</LI>

<LI>
Der Story-Zweig mu&szlig; sich stiltreu bleiben!</LI>
</UL>

<P><BR>Wollen wir es nicht mal auf diesem Weg versuchen? Allerdings mu&szlig;
derjenige, der ein neues Story-Game ins Leben ruft, gewissenhaft dabei
vorgehen. Das bedeutet relativ viel Arbeit und M&uuml;he, eine neue Welt
oder neuen Stamm ins Leben zu rufen. Es reicht nicht aus zu schreiben "<I><FONT COLOR="#3333FF">Es
ist kalt drau&szlig;en, ungew&ouml;hnlich kalt f&uuml;r das Jahr 3056.
Monica und George ziehen sich den Metall-Anzug &uuml;ber und stapfen Richtung
Bank....</FONT></I>", und schon gehts los und wir sind mittendrin in der
Geschichte. Wichtig ist es, die Umst&auml;nde und die Begebenheiten, in
der die Geschichte eingebettet ist, etwas genauer zu beschreiben. Der erste
Teil d&uuml;rfte etwas l&auml;nger als normal sein und relativ wenig Handlung
beinhalten. Erst im letzten Drittel d&uuml;rfte die Handlung der Hauptpersonen
in die gew&uuml;nschte Richtung ins Rollen gebracht werden. Ich habe jedenfalls
schon eine Idee f&uuml;r ein neues Umfeld eines Story-Games.
<P>Es spielt in der nahen Zukunft. 1999 war das entscheidente Jahr f&uuml;r
die V&ouml;lkergemeinschaft. Es fing mit dem Fl&auml;chenbrand in Jugoslawien
an und drohte nicht nur Europa in die Katastrophe zu f&uuml;hren. Eine
unseelige Kettenreaktion wurde ausgel&ouml;st die in ihren bitteren Auswirkungen
bis in das Jahr 2004 hinein reichte... Die V&ouml;lkergemeinschaft zog
die richtigen Konsequenzen daraus, wodurch das Jahr 2005 zum Jahr der Wende
wurde. Die Welt ver&auml;nderte ihr Antlitz und machte erstaunliche Fortschritte
die Niemand f&uuml;r m&ouml;glich hielt. Knapp 20 Jahre sp&auml;ter, also
2024, ging man den n&auml;chsten Schritt und betrat den Weltraum...
<P>Was genau dies f&uuml;r Katastrophen waren, inwiefern die Menscheit
Fortschritte machte und was sie im Weltall erwartet, verrate ich hier nat&uuml;rlich
nicht. Nur soviel: Wer jetzt Jedi-Ritter, Borgs oder kleine gr&uuml;ne
M&auml;nnchen erwart, liegt v&ouml;llig daneben. Es wird sowieso anders
kommen, als wie dies die Menschen im Jahre 1999 erwarteten...
<P>Bin mal gespannt, was Du davon h&auml;lst!
<BR>&nbsp;
<P>
<HR ALIGN=LEFT WIDTH="100%">
<BR>&nbsp;
<P><B>MEINE <FONT COLOR="#CC0000">TOP</FONT> <FONT COLOR="#3333FF">NEUN</FONT></B>
<P><FONT COLOR="#000000">Zuf&auml;llige Reihenfolge:</FONT>
<BR>&nbsp;
<TABLE BORDER=0 CELLSPACING=8 CELLPADDING=2 WIDTH="100%" >
<TR>
<TD><B><FONT COLOR="#3333FF">ARTIKEL</FONT></B></TD>

<TD><B><FONT COLOR="#3333FF">AUTOR</FONT></B></TD>

<TD><B><FONT COLOR="#3333FF">KOMMENTAR</FONT></B></TD>
</TR>

<TR VALIGN=TOP>
<TD><B>Huhn</B></TD>

<TD>Christian Wimmer</TD>

<TD><B>S</B>tammt zwar nicht aus der eigenen Feder (h&ouml;h&ouml;, ein
Wortspiel!), war aber sehr lustig!</TD>
</TR>

<TR VALIGN=TOP>
<TD><B>Feedbackcorner</B></TD>

<TD>Markus Castro</TD>

<TD><B>E</B>s war die erste Feedbackcorner, die mir wirklich rundum gefiel
- so macht die Rubrik Sinn!</TD>
</TR>

<TR VALIGN=TOP>
<TD VALIGN=TOP><B>Best of Tools</B></TD>

<TD>Frank Steinbach</TD>

<TD><B>Z</B>war war das ganze nicht sonderlich ausf&uuml;hrlich, aber die
Idee, seine Lieblings-Tools mal vorzustellen, gef&auml;llt mir! N&auml;chstes
mal bitte etwas ausf&uuml;hrlicher!</TD>
</TR>

<TR>
<TD VALIGN=TOP><B>Multimedia-Ecke #8</B></TD>

<TD VALIGN=TOP>Gerd Wolpert</TD>

<TD><B>E</B>igentlich finde ich es nicht sonderlich spannend etwas &uuml;ber
Demos oder Musik-Mods zu lesen - ich schaue bzw. h&ouml;re mir sie lieber
an. Aber er macht sich solche M&uuml;he und das Design (speziell die Tabellen)
ist gut gelungen, weswegen ich diese Rubrik hier positiv erw&auml;hnen
will!</TD>
</TR>

<TR VALIGN=TOP>
<TD><B>Viele Verschiedene</B></TD>

<TD>Kilian Servais</TD>

<TD><B>F</B>lei&szlig;ig, flei&szlig;ig! Das geb&uuml;hrt an dieser Stelle
ein Extralob! Du warst ein guter Beweis daf&uuml;r, das Quantit&auml;t
nicht unweigerlich auf auf Kosten der Qualit&auml;t geht. Aber bitte, verzichte
in Zukunft auf knallrote Schrift auf schwarzen Hintergrund - mega &ouml;de!</TD>
</TR>

<TR VALIGN=TOP>
<TD><B>Amiga OS</B></TD>

<TD>Sieglinde Peters</TD>

<TD><B>T</B>uuusch! Ihr erster Testbericht! Deb&uuml;t gegl&uuml;ckt -
hoffe auf&nbsp; weitere Tests von Dir!</TD>
</TR>

<TR VALIGN=TOP>
<TD><B>DPSZ</B></TD>

<TD>Daniel Stein</TD>

<TD><B>I</B>ch habe mir schon immer mehr Vorstellungen und Tests zu anderen
Medien wie B&uuml;cher oder Musik-CD&acute;s in der No Cover gew&uuml;nscht
und da Buchtips besonders rar sind, danke f&uuml;r Deinen!</TD>
</TR>

<TR VALIGN=TOP>
<TD><B>Bl&ouml;de Spr&uuml;che</B></TD>

<TD>Thomas Weber</TD>

<TD><B>A</B>uch hier ein Fall von "nur abgetippt", aber dennoch sehr interessant.
Freue mich schon auf die n&auml;chste Folge!</TD>
</TR>

<TR VALIGN=TOP>
<TD><B>Alle Spiel-Tests</B></TD>

<TD>Verschiedene</TD>

<TD><B>A</B>lles prima, Jungs! Jemand Speziellen aus der Masse raus zu
greifen ist ein Ding der Unm&ouml;glichkeit. Also gibts an dieser Stelle
ein Kollektiv-Lob! :)</TD>
</TR>

<TR VALIGN=TOP>
<TD><B>Star Trek Pages</B></TD>

<TD>Thomas Windecker &amp; Co.</TD>

<TD><B>I</B>ch bin zwar kein fanatischer Trekkie-Fan, aber diese Rubrik
macht sich. Ich w&uuml;rde mir mehr Infos und News zu Serien wie <I><FONT COLOR="#3333FF">Outer
Limits</FONT></I> w&uuml;nschen!</TD>
</TR>
</TABLE>

<P><FONT COLOR="#000000"><B>Anmerkung:</B> Grunds&auml;tzlich sind selbst
geschriebene Artikel h&ouml;her zu Bewerten, als abgetippte Beitr&auml;ge.
Denn merke: Nur selbst geschriebenes gl&auml;nzt wie g&uuml;ldener Dung
auf unseren H&auml;uptern! :)</FONT>

<BR><HR><BR>
<CENTER>
<A HREF="NoCover.html"><H2><B> « ZURUECK ZUM INHALTSVERZEICHNIS DER NO COVER » </A>
</CENTER><BR>

</BODY>
</HTML>
