<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Heaven: Jetzt mit neuem Design</title>
</head>
<body bgcolor="WHIte" text="black" background="yellbin.jpg" link="red">
<table border="0" cellspacing="0" cellpadding="5">
<tr>
<td width="90"></td>
<td>
<center>
<h1><font color="RED">Heaven</font></h1>
</center>
<p>O.K., ihr habt ja recht. Das Design meiner par Briefe war
wirklich &uuml;berzogen. Deswegen ab heute wieder in einem kleinen,
schlichten Layout.</p>

<h3>An Rolf:</h3>

Also, ehrlich gesagt kann ich deine Vorw&uuml;rfe an mich nicht
nachvollziehen. Du beschwerst dich dar&uuml;ber, da&szlig; meine
Artikel unlesbare Hintergr&uuml;nde h&auml;tten? Kann ich echt
nicht sagen.

<p>Vieleicht h&auml;ttest du sie dir lieber mal ansehen sollen...
In Wahrheit haben n&auml;mlich die letzten Artikel von mir
&uuml;berhaupt keine Backgrounds. Das einzige mit Hintergrund waren
in den letzten NCs meine par Leserbriefe, und eigentlich konnte ich
sie immer lesen.</p>

<p>Du hast mich vor einiger Zeit schonmal darauf aufmerksam
gemacht, da&szlig; meine Artikel unlesbar w&auml;hren. Gut, damals
hattest du recht. Ich hatte echt einen ganz sch&ouml;nen Griff ins
Klo getan, aber eben aus diesem Grund lasse ich nun meistens meine
Hintergr&uuml;nde schwarz.</p>

Also, ich sehe keine Fehler meinerseits. Vieleicht hast du ja meine
Artikel zu sehr "umfrisiert"?

<p><i>The Saint</i></p>

<h3>An Thowin:</h3>

<p>Ja, der Oldietest war wirklich sehr kurz, da&szlig; geb ich zu
(siehe auch mein Feedback). Wegen den Listen ... Das mit den
Selbstmorden war IMHO eigentlich einer der besten Abs&auml;tze! Ich
h&auml;tt mich beinahe totgelacht bei einigen Methoden.
Nichtsdesdotrozt k&ouml;nnen das einige empfindliche Naturen als
"makaber" bezeichnen, deshalb m&ouml;chte ich mich hiermit bei euch
allen entschuldigen ...<br>
Klang das ehrlich? Nein? Gut! ;-)</p>

<p><i>The Saint</i></p>

<h3>An Aragon:</h3>

<p>Nur kurz wegen den Farben: Also, die meiste Arbeit hat mir hier
das Tool "HTML-Grad" aus dem Aminet abgenommen, damit wurden die
Farbverl&auml;ufe berechnet. Der HTML-Code mu&szlig; danach
allerdings noch kr&auml;ftig nachbearbeitet werden, da z.B.
s&auml;mtliche Font-Ende Tags fehlen.</p>

<p><i>The Saint</i></p>

<p>Und noch eine kurze Antwort an...</p>

<h3>Annemie</h3>

Tja, diese Spracherkennungssoftware ist anscheinend grade in
Mode... also, vom Preis her w&uuml;rde ich sagen o.k., aber die
Werbung ist der gr&ouml;&szlig;te Quatsch!<br>
Rechtschreibfehler produziert so ein Programm heutzutage noch
einige, besonders bei noch unbekannten W&ouml;rtern. F&uuml;r die
richtige Schreibweise braucht man dann nat&uuml;rlich doch
st&auml;ndigen Blickkontakt und die Tastatur...<br>
Und die 100 W&ouml;rter pro Minute kann man sich auch in die Haare
schmieren. Das w&auml;hren mehr als ein Wort pro Sekunde, zwar noch
nicht Sprechgeschwindigkeit, aber f&uuml;r den PC wohl doch um
einiges zu schnell.<br>
Im Fernsehen lief mal ein Test solcher Programme, besonders gut
abgeschnitten haben sie nicht. Wer ein wenig schnell mit der
Tastatur ist, kann so ein Programm meist locker in die Tasche
stecken.<br>
Auf dem Amiga gab es mal etwas entfernt verwandtes ... ein Programm
mit dem man Arexx- oder Cli- Befehle auf Sprachkommando starten
konnte. Ob es das noch gibt wei&szlig; ich nicht, genausowenig was
es taugt, sorry! 

<p><i>The Saint</i></p>

<h3>Top 5 der NoCover 62</h3>

<ol>
<li>Huhn- Doso</LI>
<LI>Wasser- Wolf Zimmer. Sehr gut geschrieben!</LI>
<LI>Internet Provider- Tobias Kaatz</LI>
<LI>Amiga Firmen- Bruce. Solche Artikel gab es früher auch häufiger...</LI>
<LI>Star Trek Pages- Thowin</LI>
</OL>

<p><font size="4"><i>The Saint</i></font></p>

<p><a href="NoCover.html"><center><font size="5">Zur
 NoCover</font></center></A></P>
</td>
</tr>
</table>
</body>
</html>

