<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Generator" CONTENT="Microsoft Word 97">
   <META NAME="Template" CONTENT="C:\PROGRAMME\MICROSOFT OFFICE\OFFICE\html.dot">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.06 [de] (Win98; I) [Netscape]">
   <TITLE>Fastfood MAI 99</TITLE>
</HEAD>
<BODY LINK="#0000FF" VLINK="#800080" BACKGROUND="steinmauer.gif">

<HR ALIGN=LEFT WIDTH="100%">
<CENTER>
<H1>
<B>F * A * S * T * F * O * O * D</B></H1></CENTER>

<CENTER><B><FONT COLOR="#990000">Ausgabe MAI 99</FONT></B></CENTER>

<P>
<HR ALIGN=LEFT WIDTH="100%">
<BR>&nbsp;
<CENTER><TABLE BORDER=2 >
<TR>
<TD BGCOLOR="#993366">
<CENTER>
<H3>
<B><U><FONT COLOR="#FFCCFF">&nbsp;INHALTSVERZEICHNIS&nbsp;</FONT></U></B></H3></CENTER>
</TD>
</TR>

<TR>
<TD BGCOLOR="#FFCCCC">&nbsp;<B>Vorwort / Editorial</B></TD>
</TR>

<TR>
<TD></TD>
</TR>

<TR>
<TD BGCOLOR="#3333FF"><B>&nbsp;<FONT COLOR="#CCFFFF">CD-Tips:</FONT></B></TD>
</TR>

<TR>
<TD BGCOLOR="#33CCFF">&nbsp;&nbsp;&nbsp;&nbsp; Republica " Speed Ballads
"</TD>
</TR>

<TR>
<TD BGCOLOR="#33CCFF">&nbsp;&nbsp;&nbsp;&nbsp; Catatonia " International
Velvet "</TD>
</TR>

<TR>
<TD BGCOLOR="#33CCFF">&nbsp;&nbsp;&nbsp;&nbsp; Mandaley " Empathy "</TD>
</TR>

<TR>
<TD></TD>
</TR>

<TR>
<TD BGCOLOR="#FFCC00"><B>&nbsp;Buch-Tip:</B></TD>
</TR>

<TR>
<TD BGCOLOR="#FFFF99">&nbsp;&nbsp;&nbsp;&nbsp; ---</TD>
</TR>

<TR>
<TD></TD>
</TR>

<TR>
<TD BGCOLOR="#009900"><B><FONT COLOR="#FFFFCC">&nbsp;Spiel-Tips:</FONT></B></TD>
</TR>

<TR>
<TD BGCOLOR="#66FF99">&nbsp;&nbsp;&nbsp;&nbsp; Die Siedler III (PC)</TD>
</TR>

<TR>
<TD BGCOLOR="#66FF99">&nbsp;&nbsp;&nbsp;&nbsp; Lure of the Temptress (Amiga)</TD>
</TR>

<TR>
<TD></TD>
</TR>

<TR>
<TD BGCOLOR="#CC0000">&nbsp;<B><FONT COLOR="#FFFFCC">Verschiedenes:&nbsp;</FONT></B></TD>
</TR>

<TR>
<TD BGCOLOR="#FF6666">&nbsp;&nbsp;&nbsp;&nbsp; Alles zum Playstation-Nachfolger!&nbsp;</TD>
</TR>

<TR>
<TD BGCOLOR="#FF6666">&nbsp;&nbsp;&nbsp;&nbsp; Lieber Dieter, was ich Dich
schon immer mal fragen wollte...&nbsp;</TD>
</TR>

<TR>
<TD BGCOLOR="#FF6666">&nbsp;&nbsp;&nbsp;&nbsp; Sachen zum lachen!</TD>
</TR>

<TR>
<TD></TD>
</TR>

<TR>
<TD BGCOLOR="#FFCCCC">&nbsp;<B>Vorschau</B></TD>
</TR>

<TR>
<TD BGCOLOR="#FFCCCC">&nbsp;<B>Credits</B></TD>
</TR>
</TABLE></CENTER>

<P>
<HR ALIGN=LEFT WIDTH="100%">
<BR>&nbsp;
<BR>&nbsp;
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=10 WIDTH="100%" >
<TR ALIGN=CENTER VALIGN=CENTER>
<TD ALIGN=CENTER VALIGN=CENTER BGCOLOR="#FFCCCC">
<H2>
<B><FONT COLOR="#000000">VORWORT / EDITORIAL</FONT></B></H2>
</TD>
</TR>
</TABLE>

<P>Meine Herren, im Konsolensektor gehts zur Zeit richtig Rund! In Tokio
wurde die <B>Playstation 2</B> vorgestellt, dessen Tech-Specs sogar die
noch von der <B>Emotion-Engine</B>-Vorstellung (siehe Fastfood NC62) leicht
&uuml;bertreffen, <B>Nintendo</B> kontert und k&uuml;ndigt eine neue Konsole
an, die noch besser als die <B>PSX 2</B> werden soll und die diesesmal
(zum Gl&uuml;ck) nicht auf Cartridges basieren wird und <B>Sega</B> will
bei Zeiten ein DVD-Addon f&uuml;r das <B>Dreamcast</B> auf den Markt bringen...
<P>Ihr merkt, in <B>Fastfood</B> steckt auch ein kleines <B>Zockerz Isle</B>.
Aber das hier ist ja meine Rubrik - da kann ich schreiben was ich will!
:)
<P>In den letzten Wochen hatte ich leider keine Zeit (beziehungsweise,
habe sie mir nicht genommen) um ein Buch zu lesen, weshalb es dieses mal
kein Buchtip von mir gibt. Neue Musik CD&acute;s habe ich mir in letzter
Zeit auch keine gekauft, werde deshalb zwei nicht mehr ganz so aktuelle
Alben vorstellen und ein relativ Neues von der britischen Band <B>Republica</B>.
Auch bei diesen drei Vorstellungen geben Frauen den Ton an - genauso wie
bei den drei CD-Tips aus der letzten Ausgabe. Frauenpower pur, sozusagen.
Aber keine Sorge, in der n&auml;chsten Ausgabe (wenn sie denn kommt - Stichpunkt:
Feedback!) werden m&auml;nnliche Vocals die Gesangesrolle &uuml;bernehmen.
Geplant sind die Vorstellung der neuen Alben von... och, lest einfach die
Vorschau.
<P>Der Spieltip des Monats ist wieder einmal ein PC-Spiel. Das liegt einfach
daran, weil die letzten Games die ich spielte, nunmal zwei PC-Spiele waren.
Konsolen-Spiele stehen bei mir nat&uuml;rlich immer noch hoch im Kurs,
aber ich hatte noch keine Gelegenheit (Zeit!) <B>Tomb Raider III</B>, <B>Metal
Gear Solid</B>,
<B>Zelda - Ocarina of Time</B> oder <B>Turok 2</B> zu zocken.
Aber der Spieltip d&uuml;rfte dennoch nicht gerade uninteressant sein,
da es der dritte Teil einer Serie ist, dessen Ursprung einmal der Amiga
war: <B>Die Siedler III</B> ! Die geplatzte Amiga-Umsetzung von Siedler
II hat sicherlich viele entt&auml;uscht, aber vielleicht darf man ja mit
Siedler III auf dem NG-Amiga rechnen und dies d&uuml;rfte dann mehr als
ein Trost sein, den der dritte Teil ist auch mit Abstand der Beste! Liebe
Freunde, seid bitte nicht pikiert, aber ich konnte es mir nicht verkneifen
auch ein &auml;lteres Amiga-Spiel zu testen. Sagt euch <B>Lure of the Temptress</B>
was? Ja?! Nein?! Fein! Dann lest meinen Oldie-but-goldie-Spieltip!
<P>Alle meine HTML-Beitr&auml;ge schreibe und layoute ich mit dem <B>Netscape
Composer</B>. Leider entspricht das Ergebnis auf den Amiga-Browsern aber
dann nicht immer 100%ig dem Original. Ich verzichte zwar auf unn&ouml;tige
Spielereien, aber was das Tabellen-Layout oder die Farbinterpretation z.B.
betrifft, sind <B>Voyager NG</B> und <B>IBrowse</B> leider nicht perfekt.
Hoffe stark, das das kostenlose <B>aMozilla</B> (welche z.T. auf dem Netscape-Sourcecode
basiert) endlich den PC-Standart erreicht und die unterschiedliche Darstellungsqualit&auml;ten
der derzeitigen Browser dann keine Rolle mehr spielen. Die anderen zwei
neuen Amiga-Browser die derzeit in Entwicklung sind, werden es zwar schwer
haben in Konkurrenz zu <B>aMozilla</B>, aber dennoch hoffe ich, das auch
mit <B>Dry Ice</B> und <B>AmiExplorer</B> neue Mindeststandarts erreicht
werden. Vielleicht stellt sich das Problem schon mit dem <B>AmigaOS 3.5</B>
ein. Sp&auml;testens mit dem Erscheinen der NG-Amigas d&uuml;rfte das Qualit&auml;tsproblem
sowieso gel&ouml;st sein. So oder so: Gute Aussichten!
<P>Viel Spa&szlig; mit dieser (bisher gelungenste - IMHO) Ausgabe w&uuml;nscht
euch
<H3>
<B><I><FONT COLOR="#3333FF">Mark Tom</FONT></I></B></H3>
&nbsp;
<P>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=10 WIDTH="100%" >
<TR ALIGN=CENTER VALIGN=CENTER>
<TD WIDTH="40%" BGCOLOR="#3333FF">
<CENTER>
<H2>
<B><FONT COLOR="#CCFFFF">CD-Tip:</FONT></B></H2></CENTER>
</TD>

<TD BGCOLOR="#33CCFF">
<CENTER>
<H2>
<B>Republica: "Speed Ballads"</B></H2></CENTER>
</TD>
</TR>
</TABLE>

<P>Dieses Album war f&uuml;r mich eine echte &Uuml;berraschung. Zum ersten
mal wurde ich vor gut zwei Jahren auf Republica aufmerksam, als sie ihre
erste Single "<B>Ready To Go</B>" auf den Markt brachten. Eine freche und
erfrischende Dance-Rock Nummer. Um so &ouml;fter ich sie h&ouml;rte, um
so weniger konnte ich mich der Single entziehen und kaufte mir gleich das
entsprechende Album. Welch eine Entt&auml;uschung! Zu 90% seichtes Techno-Gedudel,
ideal als Fahrstuhlmusik bei C&amp;A. Nur die Titel "<B>Bloke</B>" und
"<B>Holly</B>" konnten noch mit der Single halbwegs mithalten. Der Grund
des Dilemmas war leicht auszumachen. Als letzter Track befand sich die
Single "Ready To Go" nochmals in dem Original-Mix - ohne die energische
E-Gitarre. Ergebnis = Lascher Dance-Pop! Darunter krankte fast das komplette
Album.
<P>Als dann vor kurzem das zweite Album erschien, hatte ich die Gelegenheit
es mir auszuleihen, was ich auch tat. Vielleicht waren ja ein, zwei gute
Songs drauf. Als dann der Opener "<B>From Rushour With Love</B>" erklingt,
staune ich nicht schlecht. Ein kerniger Gitarrenriff, flotte Rythmusarbeit
aus dem Computer und der mitrei&szlig;ende Gesang von Saffron, der S&auml;ngerin.
Die Melodie ist zwar einfach gehalten, geht aber dennoch ungemein ins Ohr
und wirkt Hymnenenhaft. Der zweite Track ist wieder eine gelungene Mischung
aus Dance und Rock, die Melodie noch intelligenter als die vom Opener.
So k&ouml;nnte es weiter gehen, denke ich mir... Und so ging es auch weiter.
Der dritte Song ist f&uuml;r mich das Highlight der CD: "<B>Try Everything</B>"
ist hochmelodisch, aber kommt nicht altbekannt daher! Die Musik prickelt
regelrecht vor Lebenlust und Energie. Die Gitarre ist nun fester Bestandteil
des Albums, die Melodien teilweise von sehr hoher Qualit&auml;t. Zwar gibt
es drei bis vier schw&auml;chere Songs auf diesem Album (L&uuml;ckenf&uuml;ller),
aber die restlichen Titel sind so gut gelungen, das man sie gerne in Kauf
nimmt. G&auml;be es die schwachen Titel nicht, h&auml;tten <B>Garbage</B>
extrem starke Konkurrenz bekommen!
<P>Diese Musik ist ideal f&uuml;r den Fr&uuml;hlung und den Fr&uuml;hsommer:
Wenn die ersten Sonnenstrahlen unsere Lebensgeister wiedererwecken, dann
ist dieses Album unser Soundtrack dazu! Garbage-Fans h&ouml;ren mal rein!
<P><B><U><FONT COLOR="#CC0000">TRACKLIST:</FONT></U></B> <FONT COLOR="#3333FF">01.</FONT>
<B>From
Rushour With Love</B>, <FONT COLOR="#3333FF">02.</FONT> <B>Fading Of The
Man</B>, <FONT COLOR="#3333FF">03.</FONT> <B>Try Everything</B>,
<FONT COLOR="#3333FF">04.</FONT>
<B>Luxury
Cages</B>, <FONT COLOR="#3333FF">05.</FONT>
<B>Faster Faster</B>,
<FONT COLOR="#3333FF">06.</FONT>
<B>Nothing&acute;s
Feelin&acute; New</B>,
<FONT COLOR="#3333FF">07.</FONT>
<B>Millenium</B>,
<FONT COLOR="#3333FF">08.</FONT>
<B>Pretty
Girl Hate</B>,
<FONT COLOR="#3333FF">09.</FONT>
<B>Kung Fu Movies</B>,
<FONT COLOR="#3333FF">10.</FONT>
<B>Pub
Pusher</B>
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=10 WIDTH="100%" >
<TR ALIGN=CENTER VALIGN=CENTER>
<TD WIDTH="40%" BGCOLOR="#3333FF">
<CENTER>
<H2>
<B><FONT COLOR="#CCFFFF">CD-Tip:</FONT></B></H2></CENTER>
</TD>

<TD BGCOLOR="#33CCFF">
<CENTER>
<H2>
<B>Catatonia: "International Velvet"</B></H2></CENTER>
</TD>
</TR>
</TABLE>

<P>Catatonia ver&ouml;ffentlichen in einem Affentempo ihre Alben. Kaufte
ich noch vor knapp einem Jahr dieses Album, erscheint diese Tage schon
ihr N&auml;chstes. In drei Jahren drei Alben zu ver&ouml;ffentlichen, ist
schon ungew&ouml;hnlich, es sei denn man hei&szlig;t <B>Baby Bird</B> oder
<B>TAFKAP</B>.
<P>In UK mega-erfolgreich, hierzulande wohl eher ein Geheimtip. Tja, die
S&auml;ngerin <B>Cerys Matthews</B> singt, vorsichtig ausgedr&uuml;ckt,
sehr ungew&ouml;hnlich! Wie eine verzogene G&ouml;re, die sich partout
nicht einf&uuml;gen will, sondern immer wieder aus der Reihe springt und
zicken macht. Sie singt, als w&uuml;rde sie dabei Kaugummie kauen und den
imagin&auml;ren Zusehern die Zunge rausstrecken und Fratzen schneiden.
Ehrlich gesagt, hatte ich Anfangs Probleme mit ihrem Gesangs-Stil und das
ich die Titel "<B>Mulder and Scully</B>" oder "<B>Road Rage</B>" mochte,
lag nicht an ihr, sondern ich mochte sie trotz ihrem Gesang! Deren originellen
Melodien mit einer "ihr-k&ouml;nnt-mich-alle-mal"-Einstellung, haben mich
sehr in ihren Bann gezogen. Inzwischen find ich den Gesang von Cery absolut
klasse und umwerfend!!! Gerade ihr Stil ist zum gro&szlig;en Teil daf&uuml;r
verantwortlich, das die Musik von Catatonia so gut ist.
<P>Als ich das Album noch nicht lange hatte, konnte ich beileibe noch l&auml;ngst
nicht mit allen Titeln was anfangen - sicherlich auch wegen ihrem ungew&ouml;hnlichen
Gesangsstil. Inzwischen finde ich von den 12 Titeln gerade mal zwei davon
als nichts besonderes. Der Rest ist mehr oder weniger genial! Aber wenn
man sich auch mal die eher unscheinbaren Titel wie "<B>Strange Glue</B>"
genauer anh&ouml;rt und die Musik und deren Atmosph&auml;re auf sich wirken
l&auml;&szlig;t, gibt es ein hohes G&auml;nsehaut-Risiko! Okay, bisher
bin ich nur auf die Stimme von Cery eingegangen. Und was ist mit der Musik?
Sie ist etwas "normaler", was man heutzutage wohl "Modern Rock" nennt.
Etwas Brit- und Alternativ-Rock mit vielen kleinen Einf&auml;llen in der
Produktion. Nicht gerade langweilig, aber auch nicht &uuml;berm&auml;&szlig;ig
progressiv.
<P>Das neue Album hei&szlig;t "<B>Equally Cursed And Blessed</B>" und die
erste Single "<B>Dead From The Waised Down</B>". Zwar konnte ich die Single
bisher nur einmal h&ouml;ren, umgehauen hat sie mich jedenfalls nicht.
Mal vom Gesang abgesehen, ist sie zu sehr 08/15. Aber Vielleicht gef&auml;llt
sie mir ja besser, wenn ich sie mir &ouml;fter angeh&ouml;rt habe.
<P>Wer auf moderne, originelle und freche Rockmusik steht, sollte ruhig
mal reinh&ouml;ren!
<P><B><U><FONT COLOR="#CC0000">TRACKLIST:</FONT></U></B> <FONT COLOR="#3333FF">01.</FONT>
<B>Mulder
And Scully</B>, <FONT COLOR="#3333FF">02.</FONT> <B>Game On</B>,
<FONT COLOR="#3333FF">03.</FONT>
<B>I
Am The Mob</B>, <FONT COLOR="#3333FF">04</FONT>.
<B>Road Rage</B>,
<FONT COLOR="#3333FF">05</FONT>.
<B>Johny
Come Lately</B>,
<FONT COLOR="#3333FF">06</FONT>.
<B>Goldfish And Paracetamol</B>,
<FONT COLOR="#3333FF">07</FONT>.
<B>International
Velvet</B>, <FONT COLOR="#3333FF">08</FONT>.
<B>Why I Can&acute;t Stand
One Night Stands</B>, <FONT COLOR="#3333FF">09</FONT>.
<B>Part Of The Furniture,</B>
<FONT COLOR="#3333FF">10</FONT>.
<B>Don&acute;t
Need The Sunshine</B>,
<FONT COLOR="#3333FF">11</FONT>.
<B>Strange Glue</B>,
<FONT COLOR="#3333FF">12</FONT>.
<B>My
Selfish Gene</B>
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=10 WIDTH="100%" >
<TR ALIGN=CENTER VALIGN=CENTER>
<TD WIDTH="40%" BGCOLOR="#3333FF">
<CENTER>
<H2>
<B><FONT COLOR="#CCFFFF">CD-Tip:</FONT></B></H2></CENTER>
</TD>

<TD BGCOLOR="#33CCFF">
<CENTER>
<H2>
<B>Mandaley: "Empathy"</B></H2></CENTER>
</TD>
</TR>
</TABLE>

<P>Auch Mandaley ist eine Band aus England. Dieses Album ist angenehm,
entspannend, regt nicht auf - aber steht manchmal in der Gefahr etwas zu
langweilen. Der Opener "<B>This Life</B>" ist eine wundersch&ouml;ne Pop-Nummer,
die man immer wieder h&ouml;ren kann und kaum Abnutzungserscheinungen aufweist.
Eine leichte Melodie, locker und zart von der S&auml;ngerin <B>Nicola Hitchcock</B>
gesungen. Die Musik ist sozusagen der Sahnejoghurt unter der Popmusik.
Macht Mandaley klassiche Pop-Musik, wie zum Beispiel die <B>Corrs</B> es
tun? Nein, ab dem zweiten Titel kommt der eigentliche Musikstil von Mandaley
deutlich zum tragen. Das Grundger&uuml;st ist softer Drum &acute;n Bass,
ohne heftige Break-Beats, nichts schwerwiegendes also.
<P>Der vierte Titel bricht wieder etwas aus und geht verst&auml;rkt in
Richtung Pop. Sogar eine Gitarre spielt verf&uuml;hrerisch leicht die Line-Notes,
ein kleiner Traum, schwebend zum Verlieben. Ein kleiner H&ouml;hepunkt
ist dieser Titel, der sich "<B>Another</B>" nennt. Track 6 beinhaltet ein
Sample von Talk Talk aus dem Titel "<B>I Don&acute;t Believe In You</B>",
und ist mit &uuml;ber sechs Minuten gleichzeitig der l&auml;ngste Titel
auf dem Album. Besonders im letzten Drittel wird das Tempo und der Druck
angezogen, etwas, was ich mir &ouml;fters bei dieser Platte gew&uuml;nscht
h&auml;tte. Der vorletzte Track "<B>Beautiful</B>" ist wieder eher ein
Pop-Song, eine s&uuml;&szlig;e Ballade, die ich &ouml;fters auch im Radio
(<B>BR3</B>) h&ouml;ren konnte. War ein kleiner, veritabler Radio-Hit.
<P>Nicolas Gesang erinnert mich &ouml;fters an <B>Tori Amos</B>. Ist die
Musik wirklich langweilig? Nun ja, kommt auch auf die Stimmung an und zudem
finde ich die Musikrichtung Drum &acute;n Bass eh nicht sonderlich aufregend,
wenn ich mir so Leute wie <B>Goldie</B> oder <B>Adam F</B> anh&ouml;re.
Wenn man sich entspannen will und keine Musik h&ouml;ren m&ouml;chte, die
einen jetzt aufw&uuml;hlt, ist Mandaley ideal! Wer mit Tori Amos und einem
Drum &acute;n Bass / Pop - Verschnitt halbwegs was anfangen kann, sollte
ruhig mal rein h&ouml;ren. Das Album erschien letztes Jahr.
<P><B><U><FONT COLOR="#CC0000">TRACKLIST:</FONT></U></B> <FONT COLOR="#3333FF">01</FONT>.
<B>This Life</B> <FONT COLOR="#3333FF">02</FONT>. <B>Flowers Bloom</B>
<FONT COLOR="#3333FF">03</FONT>. <B>Insensible</B> <FONT COLOR="#3333FF">04</FONT>.
<B>Another</B> <FONT COLOR="#3333FF">05</FONT>. <B>Enough Love</B> <FONT COLOR="#3333FF">06</FONT>.
<B>All My Sins</B> <FONT COLOR="#3333FF">07</FONT>. <B>Opposites</B> <FONT COLOR="#3333FF">08</FONT>.
<B>This Time Last Year</B> <FONT COLOR="#3333FF">09</FONT>. <B>Kissing
The Day</B> <FONT COLOR="#3333FF">10</FONT>. <B>Beautiful</B> <FONT COLOR="#3333FF">11</FONT>.
<B>About You</B>
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=10 WIDTH="100%" >
<TR ALIGN=CENTER VALIGN=CENTER>
<TD WIDTH="40%" BGCOLOR="#009900">
<CENTER>
<H2>
<B><FONT COLOR="#FFFFCC">Spiel-Tip des Monats:</FONT></B></H2></CENTER>
</TD>

<TD BGCOLOR="#66FF99">
<CENTER>
<H2>
<B>Die Siedler III ( PC )</B></H2></CENTER>
</TD>
</TR>
</TABLE>

<P>Ich gehe mal davon aus, das der (nach vorn oder hinten ist egal) geneigte
Leser bereits den ersten Teil der Siedler auf dem Amiga kennt. Nun stellt
sich die Frage: Was ist neu?! Lascher Aufgu&szlig; ohne neue Ideen?! Oder
gar mit dem dritten Teil alles verschlimmbessert?!
<P>Nein, nein, nein! Das Teil ist fein! Die Grafik ist knudellig - fantastellig
- umwerfendellig! Wie soll man blo&szlig; einen anst&auml;ndigen Test schreiben,
wenn man vor Begeisterung nur Sabberlaute von sich geben kann und glaubt
nur in Superlativen dem Spiel halbwegs gerecht werden zu k&ouml;nnen -
doch ich werde es versuchen! (Bitte an dieser Stelle Applaus!)
<P><IMG SRC="food.gif" HSPACE=4 VSPACE=4 BORDER=4 HEIGHT=215 WIDTH=250 ALIGN=LEFT>Was
einem zuerst nach dem Start auff&auml;llt, ist neben der wundersch&ouml;nen
Grafik, die Tatsache das es keinen Wegbau mehr gibt. Jetzt greift sich
ein Siedler die Ware und tr&auml;gt diese bis zum Bestimmungsort und legt
sie nicht mehr an der n&auml;chsten Fahne des Wegnetzes ab. Wird eine Strecke
von vielen Siedlern benutzt, entsteht ein Trampelpfad. Was noch auff&auml;llt,
sind die Siedler und Soldaten, die schon zu Beginn des Spiels "dumm" herum
stehen. Fr&uuml;her waren diese in der Burg versteckt und kammen erst bei
Bedarf heraus. Auch die Waren liegen nun sichtbar auf dem Boden. Alle Waren
&uuml;ber die man im Spiel verf&uuml;gt, kann man nun auch immer sehen.
Auch die Lagerhallen mit der unbegrenzten Aufnahmekapazit&auml;t sind verschwunden
und wurden durch offene Lagerpl&auml;tze ersetzt. In diese pa&szlig;en
nur noch sechs verschiedene Waren zu je acht St&uuml;ck.
<P>Braucht man mehr Siedler, ben&ouml;tigt man auch mehr Wohnraum, da diese
nicht mehr im Schlo&szlig; "nachwachsen". Dazu gibt es kleine, mittlere
und gro&szlig;e Wohnh&auml;user. Sind sie gebaut, str&ouml;mmen die Siedler
vor die T&uuml;r und harren der Dinge die da kommen m&ouml;gen. Eine interessante
und n&uuml;tzliche Neuerung ist die M&ouml;glichkeit, den Arbeitsbereich
der mei&szlig;ten Berufe manuell festlegen zu k&ouml;nnen. Der Steinmetz
oder der Holzf&auml;ller m&uuml;&szlig;en nicht unbedingt die Arbeit direkt
vor ihrer T&uuml;r verrichten, sondern k&ouml;nnen auch in etwas entferntes
Gebiet geschickt werden. Durch die M&ouml;glichkeit der Schifffahrt wurde
dem sowieso grandiosem Siedler-Konzept, eine neue "Dimension" er&ouml;ffnet.
In einer Kampagne z.B., ist das eigene Volk auf zwei von vier Insel verstreut.
Die zwei anderen Insel sind hingegen von Feinden besiedelt und die eigenen
zwei sind nicht sonderlich gro&szlig;. Die Insel im tiefen S&uuml;den,
reserviert man f&uuml;r die Industrie, da nur hier Gebirge vorkommt und
die n&ouml;rdliche Insel wird f&uuml;r die Nahrungsproduktion und die Religion
(alles zu Priester &amp; Co. weiter unten) genutzt. Nun ben&ouml;tigt man
eine Werft und zwei Anlegestellen um die Waren transportieren zu k&ouml;nnen.
<P>Auf der Werft&nbsp; k&ouml;nnen Handelsschiffe gebaut werden oder F&auml;hren,
womit Soldaten oder Pioniere transportiert werden. F&uuml;r die Handelsschiffe
wird eine feste Route definiert und bei den Anlegestellen festgelegt, welche
Waren und wieviel davon, auf dieser Route verschifft werden soll. Hat man
diese Einstellungen getroffen, kann man mit ruhigem Gewissen die Arbeit
den Siedlern &uuml;berlassen und sich um andere Dinge k&uuml;mmern!
<P>Das es neben den R&ouml;mern noch zwei weitere St&auml;mme gibt, ist
f&uuml;r Amiga-Zocker zwar neu, fand aber schon im zweiten Teil (PC only!)
sein Deb&uuml;t. Es gibt da noch die Asiaten und die &Auml;gypter. Durch
die zwei neuen St&auml;mme, enstand eine Art nat&uuml;rlicher Schwierigkeitsgrad.
W&auml;hrend die R&ouml;mer beim Bauen mehr Holz als Granit ben&ouml;tigen,
ist das Material-Verh&auml;ltnis bei den Asiaten schon ausgeglichen, wohingegen
die Agypter sogar mehr Granit als Holz ben&ouml;tigen. Da Granit nicht
wie Holz nachw&auml;chst und auch nicht mehr in Minen abgebaut werden kann,
mu&szlig; man besonders als &Auml;gypter behutsam und bedacht beim Bau
vorgehen, was die ganze Sache nat&uuml;rlich etwas schwieriger macht.
<P>Dies ist, neben den anderen Grafik-Sets, nicht der einzige Unterschied
der V&ouml;lker. Es gibt nun Priester, die - gen&uuml;gend Mana voraus
gesetzt - verschiedene Wunder vollbringen k&ouml;nnen. Dazu geh&ouml;rt
z.B. die <B>G&ouml;ttliche Gabe</B>, wo ein kleiner Haufen mehr oder weniger
n&uuml;tzlicher Waren vom Himmel f&auml;llt. Mit dem Zauber <B>G&ouml;ttliches
Gr&uuml;n</B>, kann man braune W&uuml;stenflecke in bebaubares gr&uuml;nes
Land verwandeln. Oder man &auml;ngstigt mit dem passenden Spruch gegnerische
Angreifer oder bekehrt sie sogar zu eigenen Rekruten. Mit dem <B>Schnee
Schmelzen</B> Zauber, ist es m&ouml;glich die Schneekuppen auf den Gebirgen
zu schmelzen um dort bei Rohstoffvorkommen Minen bauen zu k&ouml;nnen.
Vielleicht will man doch lieber Eisenbarren in Goldbarren (<B>Hand Midas</B>)
umwandeln? Jedes Volk hat jedenfalls seine sieben speziellen Wunder zur
Verf&uuml;gung. Das achte Wunder ist bei allen gleich: die bereits erw&auml;hnte
G&ouml;ttliche Gabe.
<P>Um Priester zu bekommen, braucht man einen gro&szlig;en Tempel, worauf
dann alle 5 Minuten ein Priester "erschaffen" wird. F&uuml;r die n&ouml;tige
Mana-Kraft, ben&ouml;tigt man die kleinen Tempel, die endweder mit Wein
(R&ouml;mer), Schnapps (Asiaten) oder Bier (&Auml;gypter) beliefert werden.
Wein wird von den Weinbauern angebaut, die Asiaten bauen im Sumpf den Reis
an, woraus sie den Reis-Schnapps destillieren und die &Auml;gypter brauen
aus dem Getreide und Wasser ein k&uuml;hles Blondes. Auch bei dem Kriegsger&auml;t
unterscheiden sich die V&ouml;lker. Die R&ouml;mer k&ouml;nnen Katapulte
herstellen, die &Auml;gypter Ballisten (eine Art riesger Armbrust) und
die Asiaten die Kanonen. Die Kanonen sind zwar die durchschlagkr&auml;ftigsten
Kriegsger&auml;te, daf&uuml;r ist der Aufwand bei der Munitionsherstellung
auch die h&ouml;chste. F&uuml;r das Schie&szlig;pulver ben&ouml;tigen sie
einen Pulvermacher, der wiederum Schwefel (wird in Minen abgebaut) und
Kohle ben&ouml;tigt. Das war im Gro&szlig;en und Ganzen der Unterschied
der V&ouml;lker.
<P>Wo wir schon gerade beim Milit&auml;r sind: Auch im dritten Teil gibt
es die Schwertk&auml;mpfer, die Bogensch&uuml;tzen und die Krieger mit
dem Speer. Allerdings werden diese nicht mehr in den Burgen ausgebildet,
sondern von den Priestern in h&ouml;here R&auml;nge "gezaubert". Hat man
gen&uuml;gend Mana, werden die einzelnen K&auml;mpfergruppen in eine der
beiden h&ouml;heren R&auml;nge gesetzt, wovon aber nicht die bereits vorhandenen
K&auml;mpfer profitieren, sondern nur die, die neu Rekrutieren. Hat man
also z.B. f&uuml;r die Bogensch&uuml;tzen den h&ouml;chsten Rang erreicht,
sind alle neu rekrutierten Bogensch&uuml;tzen gleich von Beginn an im h&ouml;chsten
Rang.Was ein gro&szlig;er Unterschied zum ersten Teil ist, da&szlig; man
sie nun direkt steuern kann. Entweder man klickt einen einzelnen Soldaten
an oder zieht einen Rahmen um eine Gruppe von Kriegern. Die selektierten
Mannen haben nun ein kleines farbiges Quadrat &uuml;ber ihren Kopf, so
wie man es von g&auml;ngigen Echtzeit-Strategie-Spielen her kennt. Ist
das Quadrat gr&uuml;n, erfreut sich der Soldat noch bester Gesundheit.
Kranke Soldaten k&ouml;nnen von einem Heiler geheilt werden. Man kann nun
den gew&auml;hlten oder die gew&auml;hlten Soldaten zum Angriff oder auch
auf Patrouille schicken. Definierte Gruppen kann man mit einem Shortcut
zusammenfassen und bei Bedarf aktivieren. Es ist auch m&ouml;glich, mit
einem Tastendruck alle sichtbaren Soldaten zu selektieren, oder alle sichtbaren
einer bestimmten Waffengattung.
<P>So, ich denke das waren wohl alle wichtigen Neuerungen. Wie ihr gemerkt
habt, habe ich nicht das Grundprinzip von den Siedlern erkl&auml;rt, da
wohl jeder der sich halbwegs f&uuml;r Spiele am Amiga interessiert den
ersten Teil kennen d&uuml;rfte!
<P><B><FONT COLOR="#CC0000">Positiv:</FONT></B> Superbe Grafik, hoher Wusel-
und Niedlichkeits-Faktor, dank Zufalls-Karten-Generator und drei V&ouml;lker
sehr Umfangreich.
<P><B><FONT COLOR="#CC0000">Negativ:</FONT></B> Hmm, hier gibts nur Kleinigkeiten
zu berichten. Neben einem d&uuml;nnen CD-Booklet liegt die Anleitung nur
als HTML-Datei vor, was die Sache nicht gerade angenehm macht. Zudem l&auml;sst
die HTML-Anleitung einige wichtige Fragen offen. Siedler-Veteranen m&ouml;gen
damit leben k&ouml;nnen, Siedler-Neulinge d&uuml;rften verzweifeln! Aber
das ist nicht nur bei Blue Byte gang und g&auml;be. Inzwischen ist diese
Erfahrung typisch: riesige Schachteln, in der aber nur ein verlorenes CD-Case
rumfliegt! Wurde ein Turm fertig und kein pa&szlig;ender Krieger ist in
der N&auml;he um ihn zu besetzen, mu&szlig; man einen manuell dort hinschicken.
Wenn du deswegen &uuml;ber die ganze Welt scrollen mu&szlig;t um einen
pa&szlig;enden zu finden und dann den ganzen Weg wieder zur&uuml;ck zum
Turm, kann das ganz sch&ouml;n nerven! Dieser nervende Kleinkram k&ouml;nnte
ruhig der Computer erledigen! Mir f&auml;llt wirklich nichts gravierendes
mehr ein.
<BR>&nbsp;
<BR>&nbsp;
<TABLE BORDER COLS=22 WIDTH="440" BGCOLOR="#000000" >
<TR>
<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">GRAFIK/FX:</FONT></B></CENTER>
</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#33FF33">&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">90 %</FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<TABLE BORDER COLS=22 WIDTH="440" BGCOLOR="#000000" >
<TR>
<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">SOUND/FX:</FONT></B></CENTER>
</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#33FF33">&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">80 %</FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<TABLE BORDER COLS=22 WIDTH="440" BGCOLOR="#000000" >
<TR>
<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">GAMEPLAY:</FONT></B></CENTER>
</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#33FF33">&nbsp;</TD>

<TD>&nbsp;</TD>

<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">95 %</FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<BR>&nbsp;
<TABLE BORDER=2 COLS=1 WIDTH="100%" BGCOLOR="#FFCC99" >
<TR>
<TD ALIGN=CENTER VALIGN=CENTER>
<CENTER><B>Wie wird bewertet?</B></CENTER>
</TD>
</TR>

<TR>
<TD BGCOLOR="#FFFFCC">Selbstverst&auml;ndlich ist die Bewertung der einzelnen
Komponenten v&ouml;llig subjektiv, soll also nur zur groben Einsch&auml;tzung
des Spieles dienen. Desweiteren wird nur in 5%-Schritten und systembezogen
bewertet. Das Gameplay-Element bedarf aber einer kurzen Erkl&auml;rung:
Diese Bewertung ist eine Melange aus der Steuerung der Spielfigur oder
des Fahrzeuges (Ist die steuerung zu ungenau, zu schwammig,...) und der
Bewertung des Levelaufbaus (Unfaire Stellen die Frust aufkommen lassen?).
Hat ein Spiel eine hohe Gameplay-Wertung, dann machte es einfach Spa&szlig;
dieses Spiel zu spielen und keine schlechte Steuerung oder schlechtes Spieldesign
konnte die Freude verderben! Obwohl bei dieser Bewertung die Grafik und
der Sound &uuml;berhaupt nicht miteinflie&szlig;en, sollte man die Gameplay-Wertung
durchaus als die <U>Endwertung</U> des Spiels betrachten!&nbsp;</TD>
</TR>
</TABLE>

<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=10 WIDTH="100%" >
<TR ALIGN=CENTER VALIGN=CENTER>
<TD BGCOLOR="#009900">
<CENTER>
<H2>
<B><FONT COLOR="#FFFFCC">Spiel-Tip:</FONT></B></H2></CENTER>
</TD>

<TD BGCOLOR="#66FF99">
<CENTER>
<H2>
<B>Lure of the Temptress ( Amiga )</B></H2></CENTER>
</TD>
</TR>
</TABLE>

<P>Diesesmal auch eine Amiga-Oldie-Vorstellung von mir. W&auml;hrend <B>Markus
Castro &amp; Co.</B> allseits bekannte Amiga-Klassiker besprechen (auch
&acute;ne nette Idee :), m&ouml;chte ich an dieser Stelle Spiele aus der
"2. Reihe" vorstellen. Das sind Spiele die seinerzeit durchaus gute Kritiken
erhielten, aber nicht zu den ganz gro&szlig;en Klassikern z&auml;hlen und
selbst alten Amiga-Hasen zum Teil nur vom Namen her ein Begriff sind. Ein
recht interessantes Exemplar dieser Gattung ist <B>Lure of the Temptress</B>
(<B>LotT</B>).
<P>LotT stammt von <B>Revolution Software</B>, die auch f&uuml;r <B>Beneath
a steel sky</B> und die beiden <B>Baphomets Fluch</B> Teile verantwortlich
gemacht werden k&ouml;nnen. F&uuml;r dieses Adventure hat man sich das
<B>Virtual
Theatre</B> System ausgedacht, welches ein &uuml;berraschend interessantes
Feature darstellt.W&auml;hrend bei herk&ouml;mmlichen Adventures die Personen
entweder das ganze Spiel hin&uuml;ber an einer Stelle verharren oder pl&ouml;tzlich,
zB. wenn sie nicht mehr gebraucht werden, in Luft aufl&ouml;sen, gehen
die Protagonisten in LotT ihrem eigenen Leben nach. So ist es zum Beispiel
m&ouml;glich, einer Figur, die einem zuf&auml;llig &uuml;ber dem Weg l&auml;uft,
&uuml;ber mehrere Screens zu verfolgen. Diese neue Technik macht sich gleich
zu Beginn des Spiels bemerkbar. Aber worum geht&acute;s eigentlich?
<P>Also, diese Rubrik nennt sich Fastfood und erscheint in der No Cover.
Es werden hier B&uuml;cher... &auml;h, wie bitte? Oh...
<P><FONT COLOR="#000000"><B>Diernot</B> ist der Name des wieder mal tragischem
Helden. Der Held (also man selber) h&uuml;tet die Pferde des K&ouml;nigs
von Turnvale. W&auml;hrend man mit dem K&ouml;nig und dessen Gefolgschaft
auf der Jagd ist, geschieht das Unfassbare... na, schon G&auml;nsehaut?!
<B>Skorls</B>
(&auml;hneln stark den gr&uuml;nen Orks) &uuml;berfallen die Jagdgesellschaft,
wo alle - nat&uuml;rlich bis auf Diernot - abgeschlachtet werden. Das sehr
gut gelungene Intro vermittelt dieses barbarische Verhalten der Orks sehr
gut. Genial animierte Standbilder mit atmosph&auml;risch dichter Musik
und Text-Einblendungen stimmen wunderbar auf das Spiel ein. Diernot selber
&uuml;berlebt das Scham&uuml;tzel und wacht im Kerker der Skorls wieder
auf.</FONT>
<P><FONT COLOR="#000000">Da der Skorl an sich ziemlich d&uuml;mmlich ist,
handelt er nicht aus eigenem Antrieb, sondern steht unter den Pantoffeln
der b&ouml;&ouml;&ouml;sen Zauberin <B>Selena</B>. Lange dunkle Haare,
Superbusen, Wespentaile - wenn sie nicht so fies w&auml;r, w&auml;r sie
echt s&uuml;&uuml;&uuml;&szlig;! Also, man findet sich in einer feuchten
Zelle wieder, eine Fackel an der Wand lodert hell, ein fleckchen Stroh
modert in einer Ecke gem&uuml;tlich vor sich hin. Was sofort auff&auml;llt,
ist das Fehlen der typische Lucas-look-a-like Screenaufteilung: Im unterem
Drittel das Inventar und die Verben, in den 2/3tel dar&uuml;ber das Playfield.
Bei LotT gibts nur ein Bild worin sich alles abspielt. Und diese Bilder
sind auch nicht immer gleich gro&szlig;, sondern haben verschiedene Gr&ouml;&szlig;en
und Positionen. Will man mit Objekten handieren oder Skorls anquatschen,
klickt man auf sie, worauf unter dem Mauszeiger ein Men&uuml; erscheint,
wo man dann seinen Willen gnadenlos durchsetzt. Zur&uuml;ck in die Zelle!</FONT>
<P><FONT COLOR="#000000">Ein Loch in der Wand gibt den Blick auf das Nachbargemach
frei. Man kann einen Knaben auf der Streckbank sehen und von Zeit zu Zeit
einen Skorl. Kurz nachdem dieser aus dem Sichtfeld verschwunden ist, taucht
er in Diernots Zelle auf und schaut nach dem linken, manchmal auch nach
dem rechten. Diernot will nat&uuml;rlich fliehen um Selena zu besteigen,
nee, um sie zu besiegen nat&uuml;rlich. Also versuch ich, sobald der Skorl
wieder seinen Besuch in meine Zelle abstattet, aus der offen stehenden
T&uuml;r zu rennen - doch der b&ouml;se Onkel Skorl r&ouml;hrt wie ein
Hirsch und haut mich tot! Also ist dies ein Adventure wo man sterben kann.
Neuer Versuch. Diesesmal versuche ich Onkel Skorl abzulenken, werfe die
Fackel auf das Heu, welches nun fr&ouml;hlich vor sich hin brennt. Als
Onkel Skorl dies sieht, versucht er laut fluchend das Feuer zu l&ouml;schen
und droht mich zu t&ouml;ten, wenn er das Feuer gel&ouml;scht hat. Ich
renn&acute; aus der Zelle, freue mich wie ein Erlk&ouml;nig, Onkel Skorl
kommt mir nachgelaufen und macht sein Versprechen wahr. So ein Mist, ich
hab vergessen die T&uuml;r hinter mir zu schlie&szlig;en. Neuer Versuch.
Renn wieder raus, schlie&szlig;e die T&uuml;r, freue mich erneut wie ein
Erlk&ouml;nig, Onkel Skorl &ouml;ffnet die T&uuml;r, kommt rausgeiert und
haut micht tot! Hab ich doch glatt verge&szlig;en, die T&uuml;r auch zu
verriegeln!</FONT>
<P><FONT COLOR="#000000">Ja, so spa&szlig;ig k&ouml;nnen Adventures sein!
Ist man endlich aus seiner Zelle und sicher vor dem Skorl, ist man aber
noch l&auml;ngst nicht frei. Man befreit zun&auml;chst den jungen Mann
von der Streckbank, welcher zuvor der Hofnarr </FONT>vom K&ouml;nig war
und auf den Namen <B>Ratpouch</B> h&ouml;rt. Als Dank weicht er einem fortan
nicht mehr von der Seite. Wenn man sich selbst im laufe des Spiels nicht
die Finger schmutzig machen will, bastelt man sich anhand eines Satzbaukasten
einen bis zu drei S&auml;tzen langen Befehl und richtet ihn an Ratpouch,
der ihn prompt ausf&uuml;hrt.
<P><FONT COLOR="#000000">Durch das Virtual Theatre System bekommt das Adventure
ein Hauch von Action, hat also etwas von einem Action-Adventure. Die Quests
sind von hoher Qualit&auml;t, auch die Grafiken und Animationen sind f&uuml;r
Amiga-Verh&auml;ltnisse (ECS, 32 Farben) &uuml;berzeugend. Mit einem HD-Installer
aus dem Aminet ist es m&ouml;glich die vier NDOS-Disketten auf Festplatte
zu kopieren und die l&auml;stige Handbuchabfrage entf&auml;llt ebenfalls.</FONT>
<P><FONT COLOR="#000000">Denkt bitte bei der Bewertung daran, das sie systembezogen
ist und nur zum Vergleich mit anderen Amiga-Spiele dient!</FONT>
<BR>&nbsp;
<BR>&nbsp;
<TABLE BORDER COLS=22 WIDTH="440" BGCOLOR="#000000" >
<TR>
<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">GRAFIK/FX:</FONT></B></CENTER>
</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#33FF33">&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">70 %</FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<TABLE BORDER COLS=22 WIDTH="440" BGCOLOR="#000000" >
<TR>
<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">SOUND/FX:</FONT></B></CENTER>
</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#33FF33">&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">80 %</FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<TABLE BORDER COLS=22 WIDTH="440" BGCOLOR="#000000" >
<TR>
<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">GAMEPLAY:</FONT></B></CENTER>
</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#33FF33">&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">75 %</FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<P><B><FONT COLOR="#CC0000">Wie wird bewertet?</FONT> Siehe Test zu Siedler
III !!!</B>
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=10 WIDTH="100%" >
<TR>
<TD BGCOLOR="#CC0000">
<CENTER>
<H2>
<B><FONT COLOR="#FFFFCC">Verschiedenes:</FONT></B></H2></CENTER>
</TD>

<TD BGCOLOR="#FF6666">
<CENTER>
<H2>
<B>Alles zum Playstation-Nachfolger!</B></H2></CENTER>
</TD>
</TR>
</TABLE>

<P>Am 2. M&auml;rz, etwa zwei Wochen nach der International Solid-State
Circuits Conference (Fastfood berichtete), stellte Sony in Tokio, unter
dem Motto
<B>A glimpse of the future</B>, offiziell den Playstation-Nachfolger
vor. Allerdings wurde nur das Innere der neuen Konsole vorgestellt. Weder
gab es zu dem Zeitpunkt schon einen Namen (Playstation 2 bzw. Playstation
2000 wird die Konsole jedenfalls nicht hei&szlig;en!), noch gab es ein
pa&szlig;endes Geh&auml;use oder Zubeh&ouml;r wie Joypads zu sehen. Es
wurden "nur" die genauen und exakten technischen Daten bekannt gegeben
und einige fr&uuml;he Demos gezeigt um die Leistungsf&auml;higkeit zu Demonstrieren.
<P>In der Tat ist das Herzst&uuml;ck der neuen Konsole, die ich ab jetzt
einfacherhalber <B>PSX 2</B> nenne, die <B>Emotion Engine</B>. Zuerst einmal
die Technik-Tabellen:
<P><B><U>Die offiziellen Spezifikationen des "Emotion Engine"-Prozessors:</U></B>
<TABLE BORDER=2 BGCOLOR="#FFCC99" >
<TR>
<TD VALIGN=CENTER>CPU:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">128-Bit RISC (MIPS IV Subset)</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Taktfrequenz:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">300 MHz</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Integer-Einheit:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">64 Bit (Zweiwege-Superscalar)</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Befehls-Cache:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">16 Kbyte</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Daten-Cache:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">8 Kbyte</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Hauptspeicher:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">32 MByte (Direct Rambus-DRAM)</TD>
</TR>

<TR>
<TD VALIGN=CENTER>&Uuml;bertragungsrate Intern:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">3.2 Giga-Flops / Sekunde</TD>
</TR>

<TR>
<TD VALIGN=CENTER>DMA:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">10 Kan&auml;le</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Prim&auml;rer Co-Prozessor:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">FPU (FMAC, FDIV)</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Weitere Co-Prozessoren:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">VU0-Unit, VU1-Unit, jeweils mit Micro-Memory</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Flie&szlig;komma-Operationen:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">6.2 Giga-Flops / Sekunde</TD>
</TR>

<TR>
<TD VALIGN=CENTER COLSPAN="2" BGCOLOR="#FF9900">
<CENTER><B>POLYGON-LEISTUNG INTERN</B></CENTER>
</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Perspektiv-Transformation:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">66 Millionen / Sek.</TD>
</TR>

<TR>
<TD VALIGN=CENTER><B><FONT COLOR="#FF0000">+</FONT></B> Lichteffekte:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">38 Millionen / Sek.</TD>
</TR>

<TR>
<TD VALIGN=CENTER><B><FONT COLOR="#FF0000">+</FONT></B> Nebel:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">36 Millionen / Sek.</TD>
</TR>

<TR>
<TD VALIGN=CENTER><B><FONT COLOR="#FF0000">+</FONT></B> Bezier-Kurvenbearbeitung:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">16 Millionen / Sek.</TD>
</TR>

<TR>
<TD VALIGN=CENTER COLSPAN="2" BGCOLOR="#FF9900">
<CENTER><B>BILDBEARBEITUNG</B></CENTER>
</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Bildbearbeitungs-Einheit:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">MPEG2 Macroblock Layer Decoder</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Bildbearbeitungs-Leistung:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">150 Millionen Pixel / Sek.</TD>
</TR>

<TR>
<TD VALIGN=CENTER COLSPAN="2" BGCOLOR="#FF9900">
<CENTER><B>ALLGEMEINE DATEN</B></CENTER>
</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Prozessortechnologie:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">0.18 Micrometer</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Spannung:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">1.8 V</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Stromverbrauch:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">15 Watt</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Metallschichten:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">4</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Anzahl von Transistoren:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">10.5 Millionen</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Chip-Fl&auml;che ("Die Size"):</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">240 mm2</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Chip-Form:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">540 pin PBGA</TD>
</TR>
</TABLE>

<P><B><U>Die offiziellen Leistungsdaten des "Grafik Synthesizers" (Grafik-Prozessors):</U></B>
<TABLE BORDER=2 BGCOLOR="#FFCC99" >
<TR>
<TD VALIGN=CENTER>Prozessor-Typ:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">Parallel Rendering Processor mit integriertem
DRAM</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Taktfrequenz:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">150 MHz</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Anzahl der Pixel-Engines:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">16 (Parallel)</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Integriertes DRAM:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">4 MB Multi-port DRAM (150 MHz)</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Maximale interne Daten&uuml;bertragung:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">48 Gigabyte / Sek.</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Darstellbare Farbtiefe:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">32 Bit (RGBA: 8 Bit)</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Z-Buffering:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">32 Bit</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Render-Funktionen:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">Texture Mapping, Bump Mapping, Fogging,
Alpha Blending, Bi- und Tri-Liniear Filtering, Mip-Mapping, Anti-Aliasing,
Multi-pass Rendering (Parallele bearbeitung m&ouml;glich)</TD>
</TR>

<TR>
<TD VALIGN=CENTER COLSPAN="2" BGCOLOR="#FF9900">
<CENTER><B>RENDER-LEISTUNGSF&Auml;HIGKEIT</B></CENTER>
</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Pixel-F&uuml;llrate:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">(Z-Buffer und Transparenzen) 2.4 Giga-Pixel
/ Sek.</TD>
</TR>

<TR>
<TD VALIGN=CENTER>&nbsp;</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">(Z-Buffer, Transparenzen und Texturen)
1.2 giga-Pixel / Sek.</TD>
</TR>

<TR>
<TD VALIGN=CENTER COLSPAN="2" BGCOLOR="#FF9900">
<CENTER><B>INTERNE LEISTUNGSANGABEN</B></CENTER>
</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Partikel-Zeichengeschwindigkeit:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">150 Millionen / Sek.</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Polygon-Zeichengeschwindigkeit:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">75 Millionen / Sek. ("kleine" Polygone)</TD>
</TR>

<TR>
<TD VALIGN=CENTER>&nbsp;</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">50 Millionen / Sek. (48 Pixel Viereck
mit <B>Z</B> und
<B>A</B>)</TD>
</TR>

<TR>
<TD VALIGN=CENTER>&nbsp;</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">30 Millionen / Sek. (50 Pixel Dreieck
mit <B>Z</B> und
<B>A</B>)</TD>
</TR>

<TR>
<TD VALIGN=CENTER>&nbsp;</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">25 Millionen / Sek. (48 Pixel Viereck
mit <B>Z</B>, <B>A</B> und <B>T</B>)</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Sprite-Zeichengeschwindigkeit:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">18.75 Millionen / Sek. (8x8 Pixel)</TD>
</TR>

<TR>
<TD VALIGN=CENTER COLSPAN="2" BGCOLOR="#FF9900">
<CENTER><B>ALLGEMEINE ANGABEN</B></CENTER>
</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Ausgabeformat:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">NTSC / PAL / Digital TV (DTV), VESA
(maximal 1280x1024 Pixel)</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Prozessortechnologie:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">0.25 Micrometer (4-Schicht-Metall)</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Anzahl der Transistoren:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">43 Millionen</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Chip-Fl&auml;che ("Die Size"):</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">279 mm2</TD>
</TR>

<TR>
<TD VALIGN=CENTER>Chip-Typ:</TD>

<TD VALIGN=CENTER BGCOLOR="#FFFFCC">384 pin BGA</TD>
</TR>
</TABLE>
Anmerkung: <B>Z </B>= Z-Buffer, <B>A</B> = Alpha-Blending, <B>T</B> = Trilineares
Mip-Mapping
<BR>&nbsp;
<P>Wer aufmerksam die Tabellen studiert hat, wird ohne Zweifel erkannt
haben, was f&uuml;r ein Monster die PSX2 auf dem Papier ist. &Uuml;berhaupt
keine Schw&auml;chen? So gut wie keine, aber ein paar kleine Mankos hat
auch die PSX2.
<P><B><U>Der Arbeitsspeicher.</U></B>
<BR>&nbsp;
<BLOCKQUOTE>Die 32 MB stellen zu den 2 MB der PSX eine gewaltige Steigerung
dar und wahr ist auch die Tatsache, das 32 MB bei einer Konsole mehr Wert
sind, als bei einem PC mit Windows, was aber nicht davon ablenkt, das gerade
aufgrund der Power der PSX2, die 32 MB recht knapp bemessen sind. Wie schon
in der letzten Fastfood-Ausgabe angemerkt, brauchen auch die Polygonmodelle
ihren Platz im Arbeitsspeicher. Und da zig Millionen von Polygonen dargestellt
werden k&ouml;nnen, wachsen nat&uuml;rlich auch die Polygonmodelle an Umfang,
die dementsprechend viel Platz im Arbeitsspeicher ben&ouml;tigen. Mit den
32 MB k&ouml;nnen die Entwickler sicherlich gut arbeiten, aber fr&uuml;her
oder sp&auml;ter wird wohl der Arbeitspeicher der Bereich sein, wo die
Entwickler zuerst an die Grenze der M&ouml;glichkeiten sto&szlig;en werden.
Es ist kein riesiges Manko, stellt aber auf&nbsp; l&auml;ngere Sicht gesehen
die gr&ouml;&szlig;te Einschr&auml;nkung dar, also der potentielle "Flaschenhals"
der Hardware.</BLOCKQUOTE>

<P><BR><B><U>Online-Unterst&uuml;tzung noch offen.</U></B>
<BR>&nbsp;
<BLOCKQUOTE>Wo Sega mutig war, scheint Sony besondere Vorsicht walten zu
lassen. "<I><FONT COLOR="#3333FF">Diese neue Unterhaltungsform ist sehr
reizvoll. Die Infrastruktur ist aber f&uuml;r uns noch nicht zufriedenstellend.
Das PCMCIA-Interface erlaubt es uns hingegen, diese M&ouml;glichkeit zu
einem sp&auml;teren Zeitpunkt einfach in das System einzubeziehen</FONT></I>",
so Ken Kutaragi, der "Erfinder" der PSX. Sony&acute;s z&ouml;gern mag mach
einen etwas entt&auml;uschen, aber ich denke, Sony handelt durchaus besonnen.
Mann kann wunderbar anhand des Dreamcast die Akzeptanz und den Erfolg der
Online-Funktion bei den Usern beobachten und bei Bedarf nachziehen und
aus den m&ouml;glichen Fehlern Sega&acute;s lernen.</BLOCKQUOTE>

<P><BR><B><U>M&ouml;gliche Produktions-Engp&auml;sse.</U></B>
<BR>&nbsp;
<BLOCKQUOTE>Neue Technologien haben ihren Preis: "<I><FONT COLOR="#3333FF">Ich
bin sehr besorgt &uuml;ber den Stand der Direct-Rambus-Entwicklung. Viele
Firmen entwickeln immer noch ihre ersten 133 Mhz SDRAMS und DDR DRAMS sind
nicht stabil. Die Verf&uuml;gbarkeit von 0.18 Nikrometer-Silicon ist ebenfalls
eine gro&szlig;e Unbekannte. Es wird bis Ende des Jahres keine Fertigungskapazit&auml;ten
geben</FONT></I>", so Ken Kutaragi. Sony hat dies erkannt und will deswegen
in den n&auml;chsten Monaten eigene Fabriken aus dem Boden stampfen. Diese
Problematik hat sicherlich auch ihre Auswirkungen auf den Erscheinungsterminn
der PSX2. Sony hat vor, die PSX2 noch in diesem Gesch&auml;ftsjahr in Japan
zu ver&ouml;ffentlichen. Das Gesch&auml;ftsjahr geht bis zum <B>31.03.2000.</B>
Einige Optimisten rechnen noch im diesem (Kalender-)Jahr mit dem Japan-Deb&uuml;t
(und zwar dem 03.12.1999). Da aber erst vor kurzem europ&auml;ische und
amerikanische Entwickler die Dev-Kits erhielten und japanische Entwickler
sie auch erst Ende 98 erhielten, und anbetracht der Tatsache, da&szlig;
das Entwickeln neuer Spiele gut 12-18 Monate (wenn&acute;s glatt l&auml;uft!)
dauert, ist dieser Optimismus wohl nicht angebracht. Es w&auml;r schon
ein Erfolg f&uuml;r Sony, wenn man es bis zum M&auml;rz 2000 schaffen w&uuml;rde
die PSX2 serienm&auml;&szlig;ig zu produzieren und schon eine gute handvoll
Spiele presentieren k&ouml;nnte!</BLOCKQUOTE>

<P><BR><B><U>Der relativ hohe Preis.</U></B>
<BR>&nbsp;
<BLOCKQUOTE>Der Einstiegspreis f&uuml;r den User wird zu Beginn sicherlich
kein Super-Schn&auml;ppchen. Man rechnet mit demselben Preis, wie seinerzeit
der PSX bei der Einf&uuml;hrung gekostet hat, also einen Preis zwischen
<B>600</B>
und <B>700 DM</B>. Ist das zu teuer? Eigentlich nicht, denn man bekommt
f&uuml;r diesen Preis eine ungeheure Leistung, die jeden Pfennig f&uuml;nf
mal Wert ist, aber f&uuml;r Konsolen gelten mal eigene Preis-Gesetze. Man
spricht immer von einer magischen Preis-Grenze von 500 DM. Alles was dar&uuml;ber
liegt hat es schwer vom Massenmarkt angenommen zu werden. Wenn es denn
so kommt, ist damit zu rechnen das beim Erscheinen der PSX2 zuerst die
Freaks zugreifen werden und der Markt breitfl&auml;chig bei der ersten
deutlichen Preissenkung nachzieht. Konsolenhersteller haben&acute;s nicht
leicht: Der Endkunde erwartet inzwischen absolutes High-Tech-Spielzeug
zum Aldi-Preis!</BLOCKQUOTE>

<P><BR><B><U>Hohe Entwicklungskosten.</U></B>
<BR>&nbsp;
<BLOCKQUOTE>Nahezu alle Software-Hersteller prophezeien eine <B>Explosion
der Entwicklungskosten</B> f&uuml;r PSX2-Spiele. Diesen Trend gibts schon
l&auml;nger und nicht nur im Konsolensektor. Aber bei der PSX2 tritt dieser
Trend besonders deutlich zutage. Um ein Spiel zu entwickeln welches den
F&auml;higkeiten der PSX2 entspricht, braucht man ungeheure Resourcen:
Eine ganze Armada von Programmierern, Grafikern, Sound-T&uuml;ftler und
Designer. Was man auch besonders braucht, ist Zeit und Zeit ist Geld. Nicht
nur das Entwickeln neuer State-of-Art-Spiele ist kostspielig, sondern auch
die Devoloper-Kits der PSX2 sind nicht gerade billig. Mittlere und kleinere
Softwareh&auml;user werden wohl ersteinmal "drau&szlig;en" bleiben, aus
dem edlen Kreis der PSX2-Entwickler! Schade, denn manchmal sind es gerade
die kleinen Entwickler, die neue innovative Spielkonzepte liefern!</BLOCKQUOTE>

<P><BR><B><U>Die Multimedia-Falle.</U></B>
<BR>&nbsp;
<BLOCKQUOTE>Die PSX2 verf&uuml;gt &uuml;ber einen kleinen digitalen Bus,
der auch als <B>FireWire</B> bekannt ist und zum Beispiel beim neuen Apple
G3 verwendet wird. Dieser erlaubt es, Daten mit einer Rate von 400 Millionen
Bits pro Sekunde zu &uuml;bertragen. &Auml;hnlich wie bei SCSI k&ouml;nnen
63 Ger&auml;te in Reihe angeschlo&szlig;en werden. FireWire wird auch verwendet
zur Unterst&uuml;tzung von Digitalkameras, Videorekordern aber auch Mini-Festplatten
die ohne Netzteil auskommen, da FireWire Spannung transferiert. Die Standart-Anschl&uuml;&szlig;e
wie <B>USB</B> und <B>PCMCIA</B>, k&ouml;nnen zudem genutzt werden, um
Tastaturen und herk&ouml;mmliche Festplatten anzuschlie&szlig;en. Und da
sich jeder wohl denken kann, das Sony diese Schnittstellen nicht ohne Grund
implentiert haben, stellt sich die Frage, was denn Sony alles mit der PSX2
vor hat. Multimedia-Konsolen wie das <B>CD32</B>, <B>CDI</B> oder <B>3D0</B>
floppten bitterb&ouml;s. Verspekuliert sich Sony bei seiner eierlegenden
Wollmilchsau? Ich denke nicht, denn so wie es momentan aussieht, haben
Sony gar nicht vor, die PSX2 als All-around-Kiste auf den Markt zu bringen.
Zu Beginn wird es als reine "Zockerkiste" gelauncht und erst ab gewissen
Verkaufzahlen p&ouml;-a-p&ouml; einzelne Erweiterungen ins Sortiment aufgenommen.
Dieses Konzept k&ouml;nnte aufgehen.</BLOCKQUOTE>

<P><BR>Nach all den "kritischen" Anmerkungen, nun ein paar euphorische
Kommentare einiger Entwickler, &uuml;ber die Leistungsf&auml;higkeit der
PSX2:
<BR>&nbsp;
<BLOCKQUOTE>&nbsp;
<BR>"<I><FONT COLOR="#3333FF">Meine pers&ouml;nliche Einsch&auml;tzung
ist, da&szlig; diese Maschine wohl die erste Konsole sein wird, die die
Grenze von 100 Millionen verkauften Einheiten &uuml;berschreiten wird.
Die neue Playstation ist ein absolut bahnbrechendes Produkt und ihre technischen
Daten wegweisend f&uuml;r die gesamte Industrie.</FONT></I>"
<BR><B>Bruno Bonell, Chairman &amp; CEO Infogrames</B>.</BLOCKQUOTE>

<BLOCKQUOTE>&nbsp;
<BR>"<I><FONT COLOR="#3333FF">Das Chipset war sehr, sehr, sehr beeindruckend
- beeindruckender als alles andere, was man je zuvor gesehen hat.</FONT></I>
(...) <I><FONT COLOR="#3333FF">Sie &uuml;bertrifft unsere k&uuml;hnsten
Ertwartungen.</FONT></I> (...) <I><FONT COLOR="#3333FF">Die neue Playstation
stellt gegen&uuml;ber dem Dreamcast einen Quantensprung dar. Im Vergleich
dazu kommen einem Spielhallen-Automaten wie Game Boys vor. Es ist erschreckend!</FONT></I>"
<BR><B>Stephane Baudet, Managing Director Eidos Studios</B>.</BLOCKQUOTE>

<BLOCKQUOTE>&nbsp;
<BR>"<I><FONT COLOR="#3333FF">Unsere Erwartungen waren hoch, wurden aber
noch weit &uuml;bertroffen. Die blo&szlig;e Vorstellung, da&szlig; so eine
leistungsf&auml;hige Konsole schon im Jahr 2000 f&uuml;r unter 300 US-Dollar
erh&auml;ltlich sein wird, ist einfach unglaublich! Die Playstation 2 hat
uns bereits jetzt &uuml;berzeugt,</FONT></I> (...)."
<BR><B>Lorne Lanning, Chef von Oddworld Inhabitants</B>.</BLOCKQUOTE>

<BLOCKQUOTE>&nbsp;
<BR>"<I><FONT COLOR="#3333FF">Unglaublich beeindruckende Technik,</FONT></I>
(...) <I><FONT COLOR="#3333FF">Die Hardware ist jedenfalls &uuml;berw&auml;ltigend.</FONT></I>"
<BR><B>Jez San, Chef von Argonaut</B>.</BLOCKQUOTE>

<BLOCKQUOTE>&nbsp;
<BR>"<I><FONT COLOR="#3333FF">Sie hat mich v&ouml;llig umgehauen! Sony
ist nicht nur den n&auml;chsten Schritt gegangen, sondern hat den Zug zur
n&auml;chsten Haltestelle genommen. Das Ding sollte Playstation 5 hei&szlig;en!</FONT></I>"
<BR><B>David Perry, Chef von Shiny Entertainment</B>.</BLOCKQUOTE>

<BLOCKQUOTE>&nbsp;
<BR>"<I><FONT COLOR="#3333FF">Die technischen Daten lesen sich exzellent
- man kann nur staunen, wieviel High-Tech in die neue Playstation gepackt
werden soll. Das bedeutet unglaublich detaillierte Grafik, kristallklaren
Sound und v&ouml;llig neue Spiel-Erlebnisse. Da werden selbst die Tricksequenzen
von Jurassic Park alt aussehen!</FONT></I>"
<BR><B>Anatol Locker, Red. von der Screen Fun.</B></BLOCKQUOTE>

<P><BR>Ganz interessant ist ein Chat zwischen <B>David Perry</B> und <B>Lorne
Lanning</B> das man in der <B>fun.generation</B> (kein Tippfehler - wird
seit neuem so geschrieben!) lesen konnte. Beide entwickeln ja f&uuml;r
PC und Konsolen, weswegen man sie durchaus als neutral einstufen kann.
Aber bei dem Thema PSX2 flippten die Jungs beinahe aus! Sie unterhielten
sich &uuml;ber die Zukunft der Computer- / Video-Spiele, wie man als Spieldesigner
neue Welten erschaffen kann, wo es nicht nur um sinnlose Gewalt geht (wie
bei <B>id</B>&acute;s bekannte Shooter), sondern um Gef&uuml;hle und Konfliktl&ouml;sungen.
Keine Sorge, Action jeder Art (egal ob Ballern oder Horror-Szenarien) sollen
nicht aus den Spielen vertrieben - sondern in eine neue Erlebniswelt eingebettet
werden. Also nicht mehr nur als Muskelprotz, mit einer mehr als d&uuml;rftigen
Hintergrundgeschichte, wild ballernd durch 3D-Welten eilen . Und was die
Realisierung dieser Vorhaben betrifft, scheinen diese Beiden voll und ganz
auf die PSX2 zu setzen, da es in ihren Augen <B>DIE</B> gro&szlig;e Cance
der Zukunft ist um endg&uuml;ltig das digitale Spielvergn&uuml;gen aus
der Schmuddelecke zu holen und es nicht mehr als kindisch oder verbl&ouml;dend
abzustempeln zu lassen.
<P>Was ist mit dem <B>Pentium III</B>, <B>IV</B>...? Das die Technik sich
weiterentwickelt, ist ja nichts neues. Wieso begeistern sich dann die Beiden
bei der PSX2 so, wenn sie ja eh wissen, da&szlig; mit der Zeit sich die
Technik verbessert? Was im PC-Markt derzeit abl&auml;uft, hat mehr mit
einer schleichenden Evolution zu tun und rein gar nichts mit einer innovativen
Revolution. Man entwickelt sich zwar stetig weiter, aber nur in altbekannten
Bahnen. Kein Raum f&uuml;r Visionen!
<P>In der Multimedia-Rubrik von <B>TV Spielfilm</B>, konnte man auch etwas
&uuml;ber die PSX2 lesen. Die Ausf&uuml;hrungen und Einsch&auml;tzung des
Redakteurs hat mich &uuml;berrascht. Zwar hat er den PC korrekterweise
auch mit all seinen Vorteilen beschrieben (also kein PC-Hasser), aber was
er dann schrieb, hab ich in dieser Form noch nicht gelesen: "<I><FONT COLOR="#3333FF">Ob
er</FONT></I> [der PC, anm. von mir] <I><FONT COLOR="#3333FF">allerdings
je die Grafikpower der Playsation 2 erreicht, ist fraglich - daf&uuml;r
w&auml;r eine neue Technologie erforderlich, die nicht billig sein d&uuml;rfte.</FONT></I>"
Ob er mit dieser wagemutigen Behauptung recht hat, kann ich nicht beurteilen.
Zumindest k&ouml;nnte ein wahrer Kern dahinter stecken: Der Leistungsvorsprung
der PSX2-Technik d&uuml;rfte sehr lange anhalten, wenn Intel &amp; Co.
weiter so wie bisher neue CPU&acute;s entwickeln. Zwar wird etwa alle 18
Monate ein neuer Chip vorgestellt, aber die Steigerungen zu den Vorg&auml;nger-Modellen
sind relativ bescheiden. Mal ehrlich, die gr&ouml;&szlig;ten Neuerungen
stellen in diesem Gebiet h&ouml;here Taktfrequenzen und die Erweiterung
oder Verbesserung der internen Chip-Befehle dar! Innovationen und neue
Technologien sind gefragt, aber die Trampelpfade von Intel (und Microsoft,
was den Software-Bereich angeht) sind tief und fest "eingetrampelt".
<P>Es ist ganz aufschlu&szlig;reich, mal den Polygon-Count zwischen der
PSX und der PSX2 zu vergleichen. Die derzeitige PSX kann in etwa 500.000
nackte Polygone in der Sekunde zeichnen - wenn sie wirklich nichts anderes
zu berechnen braucht. Das bedeutet f&uuml;r den Nachfolger eine Steigerung
um den <B>Faktor 122</B> !!! Und man darf dabei nicht vergessen, das bei
diesem Vergleich alleine die Power der Haupt-CPU herangezogen wurde, der
Grafik-Prozessor wurde hier ignoriert! Hinzu kommt noch etwas: Bei den
500.000 Polygonen /Sek. handelt es sich um eine sehr optimistische Zahl:
von nicht Wenigen, wurde der tats&auml;chliche Count auf etwa 300.000 bis
350.000 gesetzt! Hier jetzt eine besonders gewagte Zahlenspielerei:
<P>Wir z&auml;hlen die gesamte Hardware-Power der PSX2 zusammen (auf Basis
der kleinen Polygone) und vergleichen ihn mit dem Mindest-Polygon-Count
der derzeitigen Playstation! Ergebnis: Die PSX2 ist dann in dieser Rechnung
exakt 470 (!!!) mal leistungsf&auml;higer als die PSX!!! <B>Vorsicht:</B>
Diese Rechnung ist sehr theoretisch und beruht nicht auf exakten und &uuml;berpr&uuml;fbaren
Daten und soll auch nur eine Zahlenspielerei sein! Aber eins ist sicher:
der Nachfolger ist nicht etwa doppelt oder drei mal so gut wie der Vorg&auml;nger
- sondern stellt vielmehr einen Quantensprung dar!
<P>Eins steht fest: Die Hardware hat eingeschlagen wie eine Bombe! Die
Abw&auml;rtskompatibilit&auml;t oder die Entscheidung f&uuml;r <B>Linux</B>
als Betriebssystem bezeugen, das Sony gro&szlig;es mit der PSX2 vor hat.
Was ein neues <B>Chipset</B> so alles bewirken kann! Stellt euch mal vor,
Sony h&auml;tte f&uuml;r die <B>Next Generation Playstation</B> (so bezeichnet
z.Z. Sony offiziell die PSX2) ein Prozessor-Gespann aus PowerPC (G3, G4,
G5, wei&szlig;derdeibel...) und Voodoo oder Riva TNT benutzt! Hey, man
h&auml;tte die Herrschaften geteert und gefedert, bei schlechter Laune
noch anschlie&szlig;end gel&uuml;ncht! Hmmm, das sollte man bei uns im
Club auch mal einf&uuml;hren...<B> :))</B>
<P>Ich bin mal auf die n&auml;chsten Monate gespannt, denn dann erscheint
das Dreamcast hierzulande, Nintendo will zudem noch in diesem Jahr den
N64-Nachfolger presentieren und man wird neue Details &uuml;ber die PSX2
erfahren! Die neuesten Entwicklungen werdet ihr auch in Zukunft an dieser
Stelle mitverfolgen k&ouml;nnen!
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=10 WIDTH="100%" >
<TR>
<TD ALIGN=CENTER VALIGN=CENTER BGCOLOR="#CC0000">
<CENTER>
<H2>
<B><FONT COLOR="#FFFFCC">Verschiedenes:</FONT></B></H2></CENTER>
</TD>

<TD ALIGN=CENTER VALIGN=CENTER BGCOLOR="#FF6666">
<CENTER>
<H2>
<B>Lieber Dieter, was ich Dich schon immer mal fragen wollte...?!</B></H2></CENTER>
</TD>
</TR>
</TABLE>

<BR>&nbsp;
<P><B><I><FONT COLOR="#3333FF">Lieber Dieter</FONT></I></B>,
<P>Dein Geschmack bei den Frauen ist sicherlich nicht der schlechteste,
aber was Dein Geschmack bei der Musik angeht... Nun gut, legen wir gn&auml;digerweise
den Mantel des Schweigens dar&uuml;ber. Ich hatte schon oft das Vergn&uuml;gen
(kicher) Dich und Deinen Freund Thomas im Fernsehen zu sehen, wo ihr in
Eintracht das Lied pr&auml;sentiert, welches Du Anfang der 80er geschrieben
hast... Wie? Du hast viele hundert St&uuml;cke geschrieben? Toll! Aber
wieso hast Du sie dann nie ver&ouml;ffentlicht...? Huch, Du hast sie ver&ouml;ffentlicht???
&Auml;h, unter welchen Synonym denn, bittesch&ouml;n?
<P>Jetzt l&uuml;gst Du aber, Dieter! Wie, ich soll mir die Lieder von MT
genauer anh&ouml;ren? Och n&ouml;&ouml;, bitte nicht! Ok, wenn man genau
hin h&ouml;rt, kann man schon Variationen erkennen. Ich geb mich geschlagen
und Du hast Recht: Es sind alles verschiedene Lieder. Aber das wollte ich
Dich nicht fragen, Dieter. Also, ich hab Thomas und Dich sch&ouml;n &ouml;fters
im Fernsehen gesehen und als Rockfan ist mir nat&uuml;rlich aufgefallen,
da&szlig; Du immer eine Gitarre dabei hast, welches Du bei den Songs benutzt.
Wenn ich Dir so dabei zuschaue, wie Du die Saiten schrubst, denke ich mir
immer, das dies aber ein genialer Riff sein mu&szlig; - nur, lieber Dieter
- ich h&ouml;r den nie!
<P>Was sagst Du dazu, Dieter? Ah, Du tust nur so als ob und in Wirklichkeit
kommt die Musik vom Band. Dieter, das wu&szlig;t ich doch schon l&auml;ngst.
Ich meine, ich h&ouml;r auch bei den Songs von der Konserve nie eine Gitarre,
also bei den Aufnahmen wurde wohl auch keine Gespielt, oder? Na Dieter,
wieso schaust Du so als h&auml;tte man Dich beim onanieren erwischt? Komm,
mir kannst Du doch die Wahrheit sagen... Aha, dacht ich es mir doch: Du
k&auml;mmst Dir ohne Gitarre bl&ouml;d vor und w&uuml;&szlig;test nicht
wohin mit den H&auml;nden. Soso, einfach nur hinter dem Micro zu stehen
und zu singen sagt Dir wohl nicht zu, was?!
<P>Und da sind wir schon bei meiner zweiten Frage angelangt, lieber Dieter.
Also, wenn ich Thomas und Dich im Fernsehen sehe, egal ob es &acute;84
oder &acute;98 war, Du singst das ganze Lied &uuml;ber mit voller Kehle
mit - nur, lieber Dieter - ich h&ouml;r Dich nie! Komm, raus mit der Sprache!
Na, wieso z&ouml;gerst Du...? Aha, Du singst wohl?! Und wann, wenn ich
fragen darf? W&auml;hrend dem Lied sagst Du? Wann genau bitte? Siehste,
geht doch! Also Du singst nur im zweiten Teil des Refrains mit, die Stelle,
wo selbst Eunuchen Zahnschmerzen kriegen. Hmm, aber im Fernsehen singst
Du auch bei den Versen! Dachte ich&acute;s mir doch: Du k&auml;mmst Dir
nur mit Gitarre hinterm Micro bl&ouml;d vor. W&auml;r ja auch bl&ouml;d
hinter einem Micro mit Gitarre zu stehen, wenn man gar nicht singt! Hehe!
Verstehst Du...? Also ich meinte, wenn man nicht singt, braucht man ja
eh kein Micro, egal ob mit oder ohne Gitarre... uff, vergi&szlig; es!
<P>Also, weder singst Du im Lied (naja, bis auf diese eine Stelle), noch
spielst Du Gitarre, aber auf der B&uuml;hne tust Du so als ob, oder?! Nennt
man sowas nicht "jemanden verarschen" ? Was Du sonst tun solltest? Junge,
nehm Dir ein Beispiel an James Last und stell Dich in Zukunft vor dem Thomas
und Swiiing - Swiiing - Swiiing ....
<P>Och, guck doch nicht so b&ouml;se, war doch nicht so gemeint.... Wie,
Du willst mir jetzt auch Fragen stellen? Na gut, nur heraus damit! &Auml;h,
hab ich Dich eben richtig verstanden, Du willst wissen, ob ich eine Platte
oder CD von euch habe? Ehem, Dieter, ich glaube das interessiert hier niemanden
und &uuml;berhaupt.... nee Dieter, wieso ist das jetzt von Bedeutung...?
Oh, Du hast vorhin in meinen Plattenschrank geschaut...? &Auml;h, ja, tats&auml;chlich?
Und da war - hihihi - euer drittes Album drin? <B>Wie kommt denn daaas
daaa hineiiin???</B> Ich ha-a-ab wirklich keene Ahnunu... ach jetzt wei&szlig;
ich wieder - es war ein Geschenk! Ja genau, ein Geschenk war das!!! Wirklich!
Von wem, willst Du wissen? Das war ein Geschenk von &auml;h,...&nbsp; Neiiiin,
er - &auml;h - sie ist verreist - ne, da kann man nicht anrufen - sie ist
gaaanz weit weg, da gibts keine Telefone... Dieter, jetzt mu&szlig;, &auml;h,
ich mu&szlig; aufh&ouml;ren, ich werde gleich angerufen, driiingend!
<P>Tsch&uuml;&szlig; D<I>iiieter</I>!
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=10 COLS=1 WIDTH="100%" BGCOLOR="#FFCCCC" >
<TR ALIGN=CENTER VALIGN=CENTER>
<TH ALIGN=CENTER VALIGN=CENTER>
<H2>
<B>SACHEN ZUM LACHEN!</B></H2>
</TH>
</TR>
</TABLE>

<BR>&nbsp;
<CENTER><TABLE BORDER=0 CELLSPACING=2 CELLPADDING=4 WIDTH="80%" >
<TR>
<TD WIDTH="50%">Stehen zwei K&uuml;he auf der Weide. Sagt die Erste: "<B>Muuuh!</B>".
Darauf erstaunt die Zweite: "<B>Das ist jetzt aber ein komischer Zufall!
Ich wollte gerade das gleiche sagen!!!</B>"</TD>

<TD WIDTH="40%"></TD>
</TR>

<TR>
<TD></TD>

<TD WIDTH="50%">
<DIV ALIGN=right>Stehen zwei K&uuml;he auf der Weide. Sagt die die Erste:
"<B>Muuuh!</B>". Darauf erwidert die Zweite: "<B>M&auml;&auml;&auml;h!</B>".
Genervt meint wieder die Erste: "<B>Mensch, das du auch immer vom Thema
abkommen mu&szlig;t!</B>"</DIV>
</TD>
</TR>

<TR>
<TD WIDTH="50%">Ein junger Pfarrer nimmt zum erstenmal die Beichte ab.
Anschlie&szlig;end fragt er seinen &auml;lteren Kollegen, der ihm unterst&uuml;tzend
zur Seite sa&szlig;: "<B>Na, wie war ich?</B>".
<BR>"<B>F&uuml;r den Anfang nicht schlecht, aber du solltest &ouml;fters
mal mi&szlig;billigend &acute;<I><FONT COLOR="#000099">Na, na, na</FONT></I>&acute;
sagen und nicht so oft &acute;<I><FONT COLOR="#000099">Whow</FONT></I><FONT COLOR="#000000">&acute;oder
&acute;</FONT><I><FONT COLOR="#000099">Ist ja echt scharf</FONT></I>&acute;!</B>"</TD>

<TD></TD>
</TR>

<TR>
<TD></TD>

<TD WIDTH="50%">
<DIV ALIGN=right><B>Warum hat Chelsea Clinton keine Geschwister?</B>
<BR>Weil Monica Lewinsky sie alle verschluckt hat.</DIV>
</TD>
</TR>

<TR>
<TD><B>S</B><I><FONT COLOR="#3333FF">orry, n&auml;chstes mal gibt&acute;s
mehr "gecks"!!!</FONT></I></TD>

<TD></TD>
</TR>
</TABLE></CENTER>

<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=10 COLS=1 WIDTH="100%" BGCOLOR="#FFCCCC" >
<TR ALIGN=CENTER VALIGN=CENTER>
<TH ALIGN=CENTER VALIGN=CENTER>
<H2>
<B>VORSCHAU...</B></H2>
</TH>
</TR>
</TABLE>

<P>Nat&uuml;rlich ist auch diese Vorschau pazifistisch (sprich ohne Gew&auml;hr)
und gibt Auskunft dar&uuml;ber, was ich mir zumindest vorgenommen habe.
Der Buchtip d&uuml;rfte ein <B>Koontz</B>-Roman werden, auch die neuen
Alben von <B>Wilco</B> und <B>Toto</B> stehen ganz oben auf meiner Wunschliste
als CD-Tips. Ob ich &uuml;berhaupt dazu komme etwas in den n&auml;chsten
Wochen zu spielen ist ungewi&szlig;, und wenn, habe ich noch keinen bla&szlig;en
Schimmer welches Spiel dies sein k&ouml;nnte. Naja, war wirklich keine
fette Vorschau. Merkt euch einfach Koontz, Wilco und Toto (viele Sachen
mit "o", was!?) und ihr ahnt in etwa was euch erwartet... <B>Ooooh!</B>
<P><B><FONT COLOR="#FF0000">Last Minute</FONT>: Werde wohl mit Fastfood
eine Ausgabe aussetzen und das Feedback zu dieser und der letzten Ausgabe
abwarten...</B>
<P>Bis dann <B>(?)</B> !

<BR><HR><BR>
<CENTER>
<A HREF="NoCover.html"><H2><B>  ZURUECK ZUM INHALTSVERZEICHNIS DER NO COVER  </A>
</CENTER><BR>

</BODY>
</HTML>
