<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Lars Philipsen">
   <META NAME="GENERATOR" CONTENT="Dem Lars seine Fingers.">
   <META NAME="Description" CONTENT="Neuigkeiten aus den Bereichen Astronomie und Astrophysik">
   <TITLE>Astro-Corner</TITLE>
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#99FF99" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><FONT SIZE=+2>ASTRO-Corner</FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>
Herzlich willkommen bei der Erstausgabe der <I>ASTRO-Corner.</I> Unter
diesem Titel m&ouml;chte ich in unregelm&auml;&szlig;igen Abst&auml;nden
&uuml;ber Neuigkeiten aus der Astronomie und der Astrophysik berichten.
Ich hoffe, es gibt unter den zahlreichen Lesern der <I>NoCover</I> auch
einige Interessierte, welche sich diese Zeilen auch durchlesen.
<BR>Nun ja, lange Rede, kurzer Sinn und los gehts...

<P>Beginnen m&ouml;chte ich mit einer Meldung vom <I>14. Januar 1999</I>:

<P><B><U>Erd&auml;hnlicher Planet entdeckt</U></B>
<BR>Ein internationales Astronomenteam hat bei Beobachtungen im Observatorium
vom australischen Mount Stromlo aus einen erd&auml;hnlichen Planeten entdeckt.
"Er hat wahrscheinlich eine Masse, die zwischen der der Erde und der des
Neptuns liegt", erkl&auml;rte der neuseel&auml;ndische Forscher Ian Bond
von der <A HREF="http://www.auckland.ac.nz">University Auckland</A>. Wahrscheinlich
ist der Planet jedoch nur etwas schwerer als die Erde. Dar&uuml;ber hinaus
befindet sich der neu aufgefundene Himmelsk&ouml;rper in einer Distanz
zu seinem Zentralgestirn, die etwa dem ein- bis vierfachen mittleren Abstand
zwischen Erde und Sonne entspricht. Viele Wissenschaftler halten eine Distanz
in diesem Rahmen f&uuml;r eine gute Voraussetzung, damit sich auf einem
Planeten Leben entwickeln kann. Der Planet ist etwa 30 000 Lichtjahre entfernt
und befindet sich inmitten unserer Galaxie, der Milchstra&szlig;e. Er kann
nicht direkt beobachtet werden und nur eine besondere Konstellation der
Sterne im Beobachtungsraum um den Planeten herum erm&ouml;glichte den Fund.
Bisher wurden 17 Planeten au&szlig;erhalb unseres eigenen Sonnensystems
entdeckt. Auf den meisten von ihnen d&uuml;rften lebensfeindliche Bedingungen
herrschen. Bond und seine Kollegen berichteten von ihrer Entdeckung auf
dem Treffen der "<A HREF="http://www.aas.org">American Astronomical Society</A>".
<BR>
<HR WIDTH="100%">
<BR>Weiter geht es mit einer Meldung vom <I>20. Januar 1999</I>:<BR>
<BR>
<B><U>Fliegt Pluto aus der Planeten-Gemeinschaft?<BR>
</U></B>Der Planet&nbsp; <A HREF="http://dosxx.colorado.edu/plutohome.html">Pluto</A>
k&ouml;nnte seinen Status als sonnenfernster Planet verlieren. Eine Abstimmung
unter Astronomen k&ouml;nnte schon in K&uuml;rze ergeben, dass unser&nbsp;
<A HREF="http://seds.lpl.arizona.edu/nineplanets/nineplanets/nineplanets.html">Sonnensystem</A>
nicht 9 - wie es in den Lehrb&uuml;chern steht - sondern nur 8 Planeten
hat. Pluto w&uuml;rde dann nicht mehr als Planet gelten.<BR>
Seit seiner Entdeckung im Jahre 1930 widersetzt sich Pluto jeglicher Klassifikation.
Sein Durchmesser ist ein Drittel geringer als der unseres Mondes; daf&uuml;r
hat er einen recht gro&szlig;en Begleiter: <A HREF="http://spaceart.com/solar/cap/pluto/pluto3.htm">Charon,</A>
der 1978 entdeckt wurde. Seine Entstehung verdankt Charon m&ouml;glicherweise
der Kollision des Pluto mit einem anderen Himmelsk&ouml;rper - &auml;hnlich,
wie es im Falle der Erde auch f&uuml;r unseren&nbsp; <A HREF="http://vss.iol.it/eng/moon.htm">Mond</A>
angenommen wird. Nach solch einer Kollision sollen sich die in den Orbit
geschleuderten Massen mit der Zeit zu einem Mond verdichtet haben.<BR>
Der Pluto stellt ein Gemenge aus Eis und Gestein dar. Die Frage, was Pluto
eigentlich wirklich ist, besch&auml;ftigt die Wissenschaft schon seit seiner
Entdeckung vor 69 Jahren durch den 1997 verstorbenen Astronomen Clyde Tombaugh
vom&nbsp; <A HREF="http://ftp.lowell.edu/">Lowell Observatory</A> in Arizona.
Pluto l&auml;sst sich weder den erd&auml;hnlichen, noch den gro&szlig;en
Gasplaneten zuordnen. &Uuml;ber seine Oberfl&auml;che ist nur sehr wenig
bekannt.<BR>
Selbst Bilder, die das starke&nbsp; <A HREF="http://www.stsci.edu/">Hubble
Weltraumteleskop</A> lieferte, zeigen nur verschwommene Details. Die Experten
sind sich unseins dar&uuml;ber, ob das, was sie auf den Bildern sehen,
wirklich als ein Planet zu bezeichnen ist. M&ouml;glicherweise, so die
Wissenschaftler, handelt es sich bei Pluto nur um einen der letzten der
im fr&uuml;hen Sonnensystem vorhandenen Eiszwerge - vor vier Jahren wurden
die ersten von mittlerweile etwa bekannten 60 Objekten innerhalb unseres
Sonnensystems im sogenannten&nbsp; <A HREF="http://www.ifa.hawaii.edu/~jewitt/kb.html">Kuiper
G&uuml;rtel</A> entdeckt, die aus Gestein und Eis bestehen und Durchmesser
von bis zu mehreren hundert Kilometer aufweisen. Auch k&ouml;nnte es sich
um einen, aus dem Anziehungsbereich des&nbsp; <A HREF="http://vss.iol.it/eng/neptune.htm">Neptun</A>
entwichenen Trabanten handeln.<BR>
248 Erdenjahre braucht Pluto, um seine stark elliptische Bahn um unser
Zentralgestirn zu ziehen. F&uuml;r einige Jahre w&auml;hrend seines Umlaufes
ist er diesem sogar n&auml;her als Neptun, der die zweitgr&ouml;&szlig;te
Entfernung zur Sonne aufweist. Diese derzeitige Phase endet am 11. Februar,
wenn Pluto die Neptunbahn wieder kreuzt und erneut der sonnenfernste Planet
ist. Der Pluto ist der einzige wesentliche Himmelsk&ouml;rper im Sonnensystem,
der noch nicht von einer Raumsonde besucht wurde. Doch mit dem " <A HREF="http://www.jpl.nasa.gov/ice_fire//pkexprss.htm">Pluto-Kuiper
Express</A>"-Projekt der NASA gibt es bereits Pl&auml;ne daf&uuml;r. Eine
besondere Problematik, welche die Wissenschaftler dabei interessiert, stellen
die enormen saisonalen Schwankungen dar, die aufgrund der geringen Gr&ouml;&szlig;e
und der sonnenfernen Position auf dem Pluto anzunehmen sind.<BR>
<BR>
<TABLE BORDER COLS=1 WIDTH="31%" >
<TR>
<TD><IMG SRC="pluto.jpeg" ALT="Pluto und sein Mond Charon" HEIGHT=168 WIDTH=350></TD>
</TR>
</TABLE>
Bild oben: Pluto und sein Mond Charon aus der Sicht des <I>Hubble Weltraumteleskops</I>.
<HR WIDTH="100%">
<BR>Viele galaktische Gr&uuml;&szlig;e und bis zum n&auml;chsten mal!&nbsp;<BR>
<BR>
Euer
<TABLE BORDER COLS=1 WIDTH="9%" >
<TR>
<TD><A HREF="mailto:LarsPh@gmx.de"><IMG SRC="lars_mail.jpg" ALT="Lars" HEIGHT=78 WIDTH=108></A></TD>
</TR>
</TABLE>
Philipsen.
</BODY>
</HTML>
