<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Lars Philipsen">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.03 [de] (Win95; I) [Netscape]">
   <META NAME="Description" CONTENT="Infos zum Buch Und immer wieder die Zeit von Alan Lightman aus dem Heyne-Verlag.">
   <TITLE>Buchtipp</TITLE>
</HEAD>
<BODY BACKGROUND="pattern.jpg">
<IMG SRC="gast.gif" HEIGHT=62 WIDTH=148> <FONT SIZE=+2>Alan Lightman
- <I>Und immer wieder die Zeit</I></FONT>
<BR>
<HR WIDTH="100%">
<BR><FONT SIZE=+1><U>Hallo Leseratten!<BR>
<BR>
</U>Vor kurzem ist mir bei einem Stadtbummel ein Buch aufgefallen, welches
den Namen <I>Einstein</I> auf dem Titelcover trug. Es ist ja sicherlich
inzwischen im Club bekannt, dass ich mich f&uuml;r Wissenschaft, und da
vor allem Astronomie/Astrophysik interessiere. Und ich dachte zuerst, dass
dies ein weiteres Sachbuch &uuml;ber die Spezielle/Allgemeine Relativit&auml;tstheorie
ist. Da es lediglich 5 DM kostete, ging es sofort in meinen Besitz &uuml;ber,
ohne mich vorher genauer vom Inhalt zu &uuml;berzeugen.&nbsp;<BR>
Daheim angekommen entdeckte ich, dass es eigentlich gar kein Sachbuch,
sondern vielmehr ein Roman ist. Da ich f&uuml;r Romane eher weniger zu
haben bin, wollte sich schon Entt&auml;uschung bei mir breit machen, welche
aber wieder schnell verschwand, als ich mir auf der R&uuml;ckseite den
Inhalt des Buches durchlas.<BR>
<BR>
Das Buch handelt von dem jungen Albert Einstein, der im Berner Patentamt
arbeitet und gerade seine Abhandlung zur Speziellen Relativit&auml;tstheorie
nahezu fertiggestellt hat. In diesem Roman l&auml;sst der Autor <I>Alan
Lightman</I>, welcher &uuml;brigens Professor f&uuml;r Astrophysik ist
und er somit wei&szlig; wovon er da schreibt, den jungen Albert Einstein
30 Tr&auml;ume &uuml;ber das schwer zu begreifende Wesen <I>Zeit</I> tr&auml;umen.
Er tr&auml;umt u.a. von den Konsequenzen, die durch seine revolution&auml;re
Theorie entstehen, von Welten, in denen die Zeit, statt in eine Richtung
gleichm&auml;&szlig;ig zu flie&szlig;en, stillsteht oder r&uuml;ckw&auml;rts
l&auml;uft, pl&ouml;tzlich verschwindet und in andere, extravagante Rollen
schl&uuml;pft.&nbsp;<BR>
<BR>
Alles in allem ist es ein sehr interessant geschriebenes Buch, bei dem
es einem sichtlich schwer f&auml;llt, eine Pause einzulegen und das Buch
kurz beiseite zu legen. Da es Taschenbuch-Format hat und auch "nur" 207
Seiten l&auml;sst es sich aber leicht schnell durchlesen. Da es sich um
keine wissenschaftliche Abhandlung &uuml;ber die Theorien von Einstein
handelt, braucht man auch kein Vorwissen, um den Inhalt zu verstehen. Jedoch
kann es nicht schaden, wenn man &uuml;ber etwas Phantasie verf&uuml;gt
und sich f&uuml;r das Thema Zeit interessiert.<BR>
<BR>
Ich f&uuml;r meinen Teil kann das Buch bedenkenlos empfehlen. Wer also
Interesse an diesem Buch bekommen und auch noch 5 DM &uuml;brig hat, der
kann es sich ja mal besorgen.<BR>
<BR>
</FONT><I>Alan Lightman - Und immer wieder die Zeit</I>
<BR><I>(Original: Einstein's Dreams)</I>
<BR><I>Heyne-Verlag</I>
<BR><I>ISBN 3-453-14403-1</I>
<BR>
<HR WIDTH="100%">
<BR><FONT SIZE=+1>Machts gut!<BR>
Euer<BR>
<A HREF="mailto:LarsPh@cityweb.de"><IMG SRC="lars_mail.jpg" ALT="Mail an Lars Ph." HEIGHT=78 WIDTH=108></A><BR>
</FONT>&lt;Lars Philipsen>
</BODY>
</HTML>
