<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Lars Philipsen">
   <META NAME="GENERATOR" CONTENT="Dem Lars seine Fingers.">
   <META NAME="Description" CONTENT="Quelle: Lexikon der populären Irrtümer, Bertelsmann VerlagAutoren: Walter Krämer, Götz Trenkler">
   <TITLE>Alles ganz anders!</TITLE>
</HEAD>
<BODY BACKGROUND="pattern.jpg">

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><I><FONT SIZE=+2><B>Popul&auml;re Irrt&uuml;mer </B>(Teil 2)</FONT></I></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>
<I><FONT COLOR="#000000"><FONT SIZE=+1>Hallo NoCover-Leser!<BR>
<BR>
In der NC 56 habe ich schon einmal einen Artikel &uuml;ber Denkfehler,
Irrt&uuml;mer, Vorurteile und Missverst&auml;ndnisse geschrieben. Hier
folgt nun der zweite Teil.&nbsp;<BR>
<BR>
Ich w&uuml;nsche viel Spa&szlig; beim Entdecken der Unwahrheiten!</FONT></FONT></I>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT COLOR="#000000"><FONT SIZE=+1>Elefanten haben ein au&szlig;ergew&ouml;hnliches
Ged&auml;chtnis</FONT></FONT></B></LI>
</UL>
<FONT COLOR="#000000"><FONT SIZE=+1>Das ph&auml;nomenale Ged&auml;chtnis
von Elefanten existiert vor allem in der Phantasie von Zeitungsschreibern.
Es mag zwar durchaus stimmen, wie man zuweilen liest, dass ein Elefant
einen Peiniger nach Jahren wiedererkennt und attackiert, aber das kann
einem L&ouml;wen- oder Tigerqu&auml;ler ebenso passieren.</FONT></FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT COLOR="#000000"><FONT SIZE=+1>In England regnet es mehr als in
Italien</FONT></FONT></B></LI>
</UL>
<FONT COLOR="#000000"><FONT SIZE=+1>In London fallen pro Jahr 590 mm Niederschlag,
in Rom 760, in Florenz 870, in Mailand 1000 und in Genua sogar 1100. Damit
ist London eine der trockensten St&auml;dte in Europa.&nbsp;<BR>
Auch im Rest des Landes ist England trockener als Italien: durchschnittlich
900 mm Niederschlag, verglichen mit 950 in Italien. Dass trotzdem die ausl&auml;ndischen
G&auml;ste einen ganz anderen Eindruck mit nach Hause nehmen, liegt an
der Verteilung: in Italien regnet es vor allem im Herbst und Winter, in
England das gleichm&auml;&szlig;ig das ganze Jahr. Und auch die Dauer der
Regenschauer ist verschieden: In England kommt der Regen britisch-dezent
in kleinen Dosen, daf&uuml;r aber &ouml;fter (im Durchschnitt regnet es
an jedem zweiten Tag), in Italien seltener, aber dann gewaltig. Daher hat
man das Gef&uuml;hl, es regnet weniger, obwohl die reine Menge des Niederschlags
in Italien gr&ouml;&szlig;er ist.</FONT></FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT COLOR="#000000"><FONT SIZE=+1>In England wird der meiste Tee getrunken</FONT></FONT></B></LI>
</UL>
<FONT COLOR="#000000"><FONT SIZE=+1>Laut "International Tea Committee LTD,
London" wird in Irland pro Kopf und Jahr mehr Tee getrunken als in England.</FONT></FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT COLOR="#000000"><FONT SIZE=+1>Deutschland bezieht das meiste Erd&ouml;l
aus dem Nahen Osten</FONT></FONT></B></LI>
</UL>
<FONT COLOR="#000000"><FONT SIZE=+1>Der wichtigste deutsche Erd&ouml;llieferant
ist England. Im Jahr 1990 hat Deutschland aus England 14,8 Mio Tonnen Erd&ouml;l
importiert, aus Norwegen 6,6 Mio und aus Saudi-Arabien nur 6 Mio Tonnen.</FONT></FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT COLOR="#000000"><FONT SIZE=+1>"Fast-Food" ist ungesund</FONT></FONT></B></LI>
</UL>
<FONT COLOR="#000000"><FONT SIZE=+1>Ein Big-Mac(tm) von McDonald's(r) ist
weder ges&uuml;nder noch unges&uuml;nder als ein Men&uuml; in einem Drei-Sterne-Spesenritter-Speisentempel.
Er enth&auml;lt gemessen an seinen Kalorien etwas zu viel Fett und etwas
zu wenig Ballaststoffe, daf&uuml;r aber mehr Vitamine, Kalzium und Eisen
als viele andere Speisen, die zehnmal so viel kosten. Und selbst das Fett-Ballaststoff-Gleichgewicht
l&auml;sst sich durch ein Glas Orangensaft billig und problemlos herstellen.
[...]</FONT></FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT SIZE=+1>Das Gef&auml;hrliche bei Br&auml;nden sind die Flammen</FONT></B></LI>
</UL>
<FONT SIZE=+1>Die meisten Menschen, die bei Br&auml;nden sterben, sterben
durch den Rauch, nicht durch die Flammen: Pro Jahr kommen in Deutschland
mehr als tausend Menschen durch Kohlenmonoxyd ums Leben, "nur" rund 800
sterben an Verbrennungen.</FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT SIZE=+1>Fische sind taub und stumm</FONT></B></LI>
</UL>
<FONT SIZE=+1>Viele Fische k&ouml;nnen durchaus Schallwellen wahrnehmen;
die n&ouml;tigen Organe, die sog. "Fischohren", befinden sich in Kapseln
hinter den Augen. Manche Fische erzeugen auch mehr oder weniger laute T&ouml;ne,
um sich mit Artgenossen verst&auml;ndigen zu k&ouml;nnen oder Feinde abzuwehren.
[...]</FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT SIZE=+1>Die sicherste Art des Reisens ist das Fliegen</FONT></B></LI>
</UL>
<FONT SIZE=+1>Je nachdem, wie man es nimmt. Z&auml;hlt man einmal weltweit
die Todesopfer des Bahn- und Luftverkehrs (das Auto als den unbestrittenen
Killer Nummer 1 lassen wir au&szlig;en vor) und teilen diese Zahlen durch
die zur&uuml;ckgelegten Passagierkilometer, so kommt folgendes heraus:&nbsp;<BR>
- Bahn: 9 Todesopfer pro 100 Milliarden Passagierkilometer<BR>
- Flugzeug: 3 Todesopfer pro 100 Milliarden Passagierkilometer</FONT><FONT SIZE=+1></FONT>

<P><FONT SIZE=+1>Teilen wir die Zahl der Opfer aber durch die Passagier<I>stunden</I>
statt durch die Passagierkilometer, ergibt sich das umgekehrte Bild:<BR>
- Bahn: 7 Todesopfer pro 100 Millionen Passagierstunden<BR>
- Flugzeug: 24 Todesopfer pro 100 Millionen Passagierstunden<BR>
<BR>
Mit anderen Worten: Die Gefahr, die n&auml;chste Stunde nicht zu &uuml;berleben,
ist im Flugzeug mehr als dreimal gr&ouml;&szlig;er. Und so gesehen ist
die Angst so vieler Menschen vor dem Fliegen gar nicht so irrational wie
wir immer weisgemacht bekommen.</FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT SIZE=+1>Friedhof hat etwas mit "Frieden" zu tun</FONT></B></LI>
</UL>
<FONT SIZE=+1>Friedhof kommt vom althochdeutschen "frithof"=Vorhof, Vorplatz,
Vorraum einer Kirche. Es bedeutet "eingefriedeter, besch&uuml;tzter Platz".
Da dieser eingefriedete, besch&uuml;tzte Platz vor den Kirchen oft auch
als Begr&auml;bnisst&auml;tte diente, hat diese eingeschr&auml;nkte Bedeutung
peu &agrave; peu das Wort f&uuml;r sich alleine in Beschlag genommen.</FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT SIZE=+1>In Afrika gibt es keine Gletscher</FONT></B></LI>
</UL>
<FONT SIZE=+1>Afrika besitzt rund 13 Quadratkilometer Gletscherfl&auml;che,
den gr&ouml;&szlig;ten Teil davon auf dem Kilimandscharo. Von allen Kontinenten
hat allein Australien keine Gletscher [...].&nbsp;<BR>
Das afrikanische Klima war auch l&auml;ngst nicht immer so warm wie heute.
Der Nil z.B. war seit 1 nach Christus mindestens zweimal, in den Jahren
829 und 1010, zugefroren.</FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT SIZE=+1>Gl&uuml;hw&uuml;rmchen</FONT></B></LI>
</UL>
<FONT SIZE=+1>Gl&uuml;hw&uuml;rmchen sind K&auml;fer, keine W&uuml;rmer.
Es gibt mehrere Arten, in Europa am bekanntesten die Lampyris noctiluca.
[...]</FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT SIZE=+1>Die Grasm&uuml;cke hat etwas mit M&uuml;cken und Gras
zu tun</FONT></B></LI>
</UL>
<FONT SIZE=+1>Dieser beliebte Singvogel aus der Gattung "Sylvia Atricapilla",
auch "Schwarzpl&auml;ttchen" oder "Plattm&ouml;nch" genannt, hat seinen
Namen von dem mittelhochdeutschen "Gra-smiege"=Grau-Schl&uuml;pfer; er
ist grau und ein Meister im Durchkriechen, Durchh&uuml;pfen und Durchschl&uuml;pfen
des Geb&uuml;schs.</FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT SIZE=+1>Hummeln stechen nicht</FONT></B></LI>
</UL>
<FONT SIZE=+1>Anders als Wespen oder gar Hornissen gelten Hummeln als eher
gutartig; sie haben wie die Honigbienen eine strenge soziale Hackordnung
mit K&ouml;nigin, Drohnen und Arbeiterinnen; sie sammeln wie diese Nektar
aus den Bl&uuml;ten von Pflanzen. Anders als die Bienen lassen sie sich
auch, wenn man vorsichtig ist, mit der Hand einfangen, ohne sich mit ihrem
Stachel zu wehren. Aber wenn sie sich ernsthaft bedroht f&uuml;hlen, k&ouml;nnen
sie auch stechen.</FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT SIZE=+1>Der Hundertj&auml;hrige Krieg dauerte 100 Jahre</FONT></B></LI>
</UL>
<FONT SIZE=+1>Der sogenannte Hundertj&auml;hrige Krieg, den sich die Franzosen
und Engl&auml;nder im Mittelalter lieferten, dauerte in Wahrheit 114 Jahre,
von 1339 bis 1453. [...]</FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT SIZE=+1>Hundstage</FONT></B></LI>
</UL>
<FONT SIZE=+1>Die Hundstage hei&szlig;en so, nicht weil es Hunden zu hei&szlig;
wird, sondern, weil um die Zeit des Jahres der Sirius, der Hundestern,
mit der Sonne zusammen aufgeht. In der Antike glaubte man, dass dieser
Stern noch zus&auml;tzliche Hitze br&auml;chte.</FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT SIZE=+1>Jahr Null</FONT></B></LI>
</UL>
<FONT SIZE=+1>In der Zeitrechnung der Menschheit gibt es kein Jahr Null.
Wir z&auml;hlen die Jahre vor Christus r&uuml;ckw&auml;rts, also 1 vor
Christus, 2 vor Christus und so weiter, und die Jahre nach Christus vorw&auml;rts,
also 1 nach Christus, 2 nach Christus und so weiter. Dabei ist "2 nach
Christus" im Sinn von 2 a.D., also "Anno Domini Nr. 2", "im zweiten Jahr
des Herrn" zu lesen, so dass kein "Nulltes Jahr des Herrn" existiert. Mit
anderen Worten: Die Jahresz&auml;hlung springt bei der Zeitenwende gleich
von -1 auf +1. [...]</FONT>
<BR>
<HR WIDTH="100%">
<UL>
<LI>
<B><FONT SIZE=+1>Das dritte Jahrtausend beginnt um Mitternacht des letzten
Tages 1999</FONT></B></LI>
</UL>
<FONT SIZE=+1>Das dritte Jahrtausend beginnt nicht am 1. Januar 2000, sondern
am 1. Januar 2001. Denn vom 1. Januar des Jahres 1 bis zum 31. Dezember
des Jahres 1999 sind erst 1999 Jahre vergangen. Damit ist das Jahr 2000
das 2000. Jahr der modernen Zeitrechnung; erst wenn dieses Jahr vor&uuml;ber
ist, beginnt Jahrtausend Nr. 3.</FONT>
<BR>
<HR WIDTH="100%">
<BR><I><FONT SIZE=+1>So, das war nun der zweite Teil meiner Artikelreihe
&uuml;ber kapitale Missverst&auml;ndnisse, Vorurteile und Denkfehler, denen
die meisten von uns, ohne es zu wissen, unterliegen. Ich sch&auml;tze,
dass insbesondere die beiden letzten Beitr&auml;ge zur Jahresz&auml;hlung
aus aktuellem Anlass wohl f&uuml;r die meisten interessant gewesen sein
d&uuml;rfte. Die meisten Menschen machen sich vollkommen unn&ouml;tig verr&uuml;ckt,
um entweder den angeblichen Jahrtausendwechsel an einem besonderen Ort
zu verbringen oder das "Jahrtausendbaby" zu produzieren. In Wirklichkeit
haben wir daf&uuml;r noch ein Jahr Zeit. ;-)<BR>
<BR>
Macht's gut!<BR>
Euer</FONT></I>
<BR><A HREF="mailto:LarsPh@cityweb.de"><IMG SRC="larsph.jpg" ALT="Mail an Lars Ph." HEIGHT=80 WIDTH=167></A>
<br>Lars Philipsen
</BODY>
</HTML>
