<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Sneak Preview: Aminet Set 11</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%>
<p><h1><center><font color="green">Sneak Preview: Aminet Set 11</font></center></h1></P>


<p>Was das Aminet ist, brauche ich wohl an dieser Stelle nicht gro&#223;artig erkl&#228;ren, oder? Auch die CD`s d&#252;rften jedem User hinreichend bekannt sein und sollten eigentlich zur Standardausr&#252;stung eines jeden Amiga Users geh&#246;ren. Und wem es zu viel M&#252;he bzw. zu umst&#228;ndlich ist, sich alle zwei Monate die Einzel CD zuzulegen, der erh&#228;lt alle acht Monate die M&#246;glichkeit, sich auch das entsprechende Set mit den letzten vier Einzel CD`s zuzulegen.</P>

<p>Nun ist es wieder soweit und ein neues Aminet Set ist erschienen. Und was soll ich dazu sagen? Gerade in den Zeiten, in denen der kommerzielle Sektor nicht gerade mit Neuheiten &#252;bersch&#252;ttet wird, bietet der Freeware / Sharwaresektor auf dem Amiga noch die eine oder andere Alternative bereit, die man zumindest antesten sollte. Insofern geh&#246;rt auch Set Nr.11 in jede Amiga Sammlung und es w&#228;re positiv, wenn sich die User zumindest dazu aufrappeln k&#246;nnten, den entsprechenden Programmierern Feedback zukommen zu lassen - gerade in heutiger Zeit kommt es auf jedes einzelne Programm an, das aktiv weiterentwickelt wird. S&#228;mtliche Highlight`s diese Set`s an dieser aufzuz&#228;hlen, w&#252;rde sicherlich zu weit gehen. Hervorhebenswert sind allerdings noch die Vollversionen, die das Set gelungen abrunden:</P><ul>

<p><li> Capital Punishment<br>
<li> Turbo Calc 4 <br>
<li> Wildfire 5 <br>
<li> Super View Productivity Suite</P></UL>

<p>Somit ist es aus allen Bereichen (Office, Grafik &amp; Unterhaltung) bei den Vollversionen etwas dabei und es handelt sich dabei ja bekanntlich nicht um die schlechteste Software. Zumindest Turbo Calc geh&#246;rt zum Standard in Sachen Tabellenkalkulation auf dem Amiga.</P>

<p>Ein Fazit f&#252;r dieses gerade einmal 59 DM teure Set ist damit eigentlich fast &#252;berfl&#252;ssig: Hier stimmt das Preis- / Leistungsverh&#228;ltniss volkommen und jeder Amiga User sollte diesen kleinen Beitrag zur Erhaltung des Aminet`s doch beitragen k&#246;nnen. Ein Pflichtkauf f&#252;r alle User, die nicht im Besitz der Einzel CD`s sind!</P>


<p>Kilian Servais</P>
</P>
</BODY>
</HTML>
