<HTML>
<HEAD>
<TITLE>Editorial der NoCover</TITLE>
</HEAD>
<body background="l_bg1.gif" text="#000000" link="#000000" alink="#ff0000" vlink="#000080"  bgcolor="#b0b0b0">

<center>

<table border=1 width=95%><tr><td><center>&nbsp;<br><strong><font color="#006000" size="7"><i> NoCover - Das Freeware Mag</i></font></strong></center></td></tr></table>
<br><img src="l_editorial2.gif" width=363 height=45>
<BR>
<h2><b>zur NoCover #91 (1.10.2001)</b>
<P>
<img src="l_editorial.gif" width=200 height=36 border=0>
<P>
<img src="l_bar.gif">
<BR><BR><table width=95%><TR><TD>
<p><b>Hi Folks!</B></P>

<p>Ja, ja, der September (mit seinem ach so beschissenen Wetter...) ist wieder vorbei und die neue NC k&#246;nnt ihr auf dem Bildschirm bewundern....</P>

<p>Also, was gibt es neues von der NC Front? Nun, eigentlich m&#246;chte ich an dieser Stelle eine ganze Menge des vergangenen Monats verarbeiten. Zuerst einmal m&#246;chte ich mich bei allen Usern bedanken, die sich die M&#252;he gemacht haben, mir Artikel / Anregungen zu schicken. Ohne diese Kommentare h&#228;tte ich wohl einige Dinge anders gemacht. Nat&#252;rlich sind Meinungen und Anregungen immer noch gerne gesehen und wer etwas auf dem Herzen hat, der soll es sich nicht nehmen lassen und mich kontaktieren (vorzugsweise per E-Mail an kilian@apc-tcp.de).</P> 

<p>Zun&#228;chst einmal das positive: Das Disketten Abo wird es weiterhin geben und ein jeder, der weiterhin die NC auf Disk erhalten m&#246;chte, der soll sich an Wolfgang Hass (amiga@haas-computerservice.de per E-Mail; Wolfgang Haas, Neunkirchenstr.115, 97980 Bad Mergentheim per Snail Mail) wenden. Die Unkosten m&#252;ssen nat&#252;rlich weiterhin erstattet werden, aber ich finde, dass das zumindest eine ganz gute Sache f&#252;r die User ist, die &#252;ber keinen Netz Zugang verf&#252;gen - oder um es anders auszudr&#252;cken: F&#252;r diese User &#228;ndert sich - ausser den Kontakt Addressen - absolut gar nichts. </P>

<p>Beim Online Abo habe ich einiges ausgebaut: Wer will kann sich das nat&#252;rlich nach wie vor von der Homepage laden bzw. auch aus dem Aminet saugen (dort ist die letzte Ausgabe bereits zu finden). Einfacher ist das E-Mail Abo, welches ich ab sofort kostenlos anbiete. Einige haben die aktuelle Ausgabe bereits per E-Mail erhalten, andere noch nicht. Wer also will, kann sich die jeweils aktuelle Ausgabe per E-Mail zustellen lassen und hat diese dann immer p&#252;nktlich im virtuellen Briefkasten. Vorbei sind die Zeiten, in denen man jeden Tag auf der HP vorbeigeschauen hat um zu testen, ob die aktuelle Ausgabe bereits dort hochgeladen wurde. Im Aminet ist die aktuelle Ausgabe nat&#252;rlich auch immer zu finden.</P>

<p>Nachdem also vorerst alles bezgl. des Vetriebsweges gekl&#228;rt ist (wer die NC auf seine private HP stellen will bzw. in Mailboxen hochladen m&#246;chte, der soll das tun!!), kommen wir nun zu einigen internen Dingen:Die Beteiligung war in diesem Monat alles andere als erfreulich. Ob es nun an der Umstellung gelegen hat, vermag ich nicht zu sagen. Erfreulich w&#228;re es auf jeden Fall, wenn sich jeder mal wieder aufrappeln k&#246;nnte und einige Zeilen in die Tastatur hauen w&#252;rde. Nur so kann die neue NC funktionieren und wieder attraktiver werden. Auch ich werde mich bem&#252;hen, in Zukunft den einen oder anderen Beitrag zu schreiben, aber nat&#252;rlich brauche ich dringend Eure Unterst&#252;tzung. Zumindest ein bisschen Feedback kann ja jeder in Form eines Leserbriefes von sich geben.</P>

<p>Nachdem das gekl&#228;rt ist, kommen wir zu einem weiteren Thema: Der Mitgliederliste bzw. Mitgliedschaft in der NC. Wie ihr sicherlich gemerkt habt, habe ich in der aktuellen Ausgabe die Mitgliederliste komplett rausgestrichen. Das hat einen einfachen Grund: Ich will eine komplett neue Liste erstellen, 
die m&#246;glichst aktuelle ist und keine toten Members enth&#228;lt. Jeder, der also als Mitglied der NC Community eingetragen werden will, sollte nicht nur den beigelgten Antrag ausf&#252;llen (befindet sich mit Icon im Hauptverzeichniss!!), sondern idealerweise auch eine Kurzvorstellung an mich schicken (kann so aufgebaut sein wie die alte; vorzugsweise in HTML). Nur so kann man auf Dauer eine gesunde Community aufbauen und ich hoffe, dass sich m&#246;glichst viele Leute f&#252;r die neue Liste melden. Die Mitgliedschaft ist nat&#252;rlich kostenlos und mit keinerlei Pflichten verbunden - wer die alte Amiga4ever bzw. Fireball kennt, der wird schon wissen, was ich meine :-)))</P>

<p>In Sachen Rubriken wird sich auch einiges ab der n&#228;chsten NC tun - so plane ich, diverse Rubriken zusammenzulegen, damit wir nicht st&#228;ndig verwaiste Rubriken haben. So k&#246;nnte man den Bereich &quot;Diskussionen&quot; mit den &quot;Leserbriefen&quot; unter dem Namen &quot;NC Talk&quot; zusammenlegen, was ohnehin viel treffender ist. Auch den Bereich &quot;Online&quot; und &quot;Multimedia&quot; k&#246;nnte man idealerweise zusammenlegen. Hier brauche ich aber dringend Euer Feedback, denn ich m&#246;chte die NC ja nicht f&#252;r mich machen. Also, sagt bescheid wie ihr diese Zusammenlegungen seht!!</P>

<p>Desweiteren wird die n&#228;chste Ausgabe der NC dank Wolf Zimmer in einem etwas anderem Gewand daherkommen, was ich f&#252;r durchaus sinnvoll erachte. Grafische &#196;nderrungen sollten mal langsam wieder gemacht werden und der Vorschlag, den Wolf mit geschickt hat, hat mich volkommen &#252;berzeugt. F&#252;r die aktuelle Ausgabe waren diese &#196;nderrungen allerdings zu kurzfristig - lasst Euch also schonmal &#252;berraschen.</P>

<p>Eine kleine Bitte habe ich allerdings auch noch: Wenn ihr mir Atikel per E-Mail schickt, w&#228;re es nett, wenn ihr diese mit LHA, ZIP oder LZX packen k&#246;nntet. Ich empfange die Mails n&#228;mlich auf einem PC und muss dann die Dateinamen auf dem Amiga nicht erst wieder m&#252;hevoll zusammensetzen. Desweiteren vermindert das die Online Kosten in einem ganz geringen Ma&#223;e :-)))</P>

<p>Ein wichtiges Anliegen habe ich auch noch: Ich brauche dringend jemande, der sich um die HP der NC / APC &amp; TCP k&#252;mmern kann. Wer daran Interesse hat., der sollte sich dringend mit mir in Verbdinung setzen.</P>

<p>Und zum Abschluss noch kurz eine Sache in eigenem Interesse: Hat irgendwer von Euch zuf&#228;llig alte PC hardware zu verschenken? Ich gurke n&#228;mlich momentan mit einem 100 MhZ PC im Internet rum und kann eigentlich alles gebrauchen - wenn also jemand Hardware rumfliegen hat (Grafikkarten, Ram, Mainbord etc.) und dieses Zeugs nicht mehr braucht, unbedingt bei mir (kilianservais@gmx.de) melden. Braucht nix aktuelles zu sein, nur macht Internet so keinen Spass....</P>

<p>Allright, jetzt w&#252;nsche ich Euch viel Spa&#223; beim Lesen der aktuellen NC. See ya,</P>

<p>Kilian <blink>&quot;The Bruce&quot;</blink> Servais</P>






<P>
<br></TD></TR></TABLE>
<P><img src="l_bar.gif"></center>
</BODY>
</HTML>
