<HTML>
<HEAD>
<TITLE>Bier Witze</TITLE>
</HEAD>
<BODY BACKGROUND="l_bg.jpg" TEXT=#000000 LINK="#000000" VLINK="#0000ff" ALINK="#000055">
<BR><BR><center><table width=95%><TR><TD>




<center>
<H1>Bier Witze</H1>
</CENTER>
<P>
<BR>
<P>

<p>Folgendes hab ich im Internet gefunden: </P>


<p><b>DOS Bier: </B><BR>
Du mu&#223;t Deinen eigenen Dosen&#246;ffner verwenden, und die Instruktionen zum 
&#246;ffnen m&#252;ssen genau gelesen werden. Fr&#252;her wurden 8er-Packs Dosen 
geliefert, heute bekommt man 16er-Packs, die allerdings in 8 mal zwei 
Kammern geteilt werden, damit die Packung beim Transport stabil bleibt. 
Die Produktion dieses Bieres wird bald eingestellt, aber die privaten 
Lagervorr&#228;te sind so gro&#223;, da&#223; es noch lange getrunken werden kann. </P>

<p><b>MAC Bier: </B><BR>
Es wurde fr&#252;her ausschlie&#223;lich in 16er-Packs geliefert und ist jetzt auch 
in 32er-Packs erh&#228;ltlich. Dieses sogenannte Di&#228;tbier &#246;ffnet sich 
selbstt&#228;tig, sobald man es aus dem K&#252;hlschrank nimmt. Die Inhaltsstoffe 
werden icht angegeben, fragt man danach, bekommt man zur Antwort, da&#223; man das nicht wissen m&#252;sse. Lediglich eine ,Leere Dose bitte recyclen&quot; 
Aufschrift findet sich auf der Dose. </P>

<p><b>OS/2 Bier: </B><BR>
Es wird in 32er-Packs geliefert, man kann mehrere davon gleichzeitig 
trinken, oder auch DOS Biere oder Windows Biere in beliebiger 
Kombination. Dieses Bier wird auch nicht explodieren wenn man es vor dem 
&#214;ffnen kr&#228;ftig sch&#252;ttelt. Der Hersteller IBM (Internationale Bier 
Manufaktur) gibt an, da&#223; 10 Millionen Packs verkauft wurden und die 
Konsumenten sagen dazu &quot;Nicht immer, aber immer &#246;fter&quot;.` Unter dem Motto 
&quot;Warp sei Lob und PROST&quot;` haben sich einige Kampftrinker zu einem 
TeamOS/2-Bierklub zusammengeschlossen, um der neuesten OS/2 
Geschmacksrichtung WARP (,,Wirklich A Richtiges Pils``) dem Trinkervolk 
nahezubringen. </P>

<p><b>Windows 3.x Bier: </B><BR>
Es ist wohl das bekannteste Bier am Markt. Es sieht ein wenig aus wie MAC 
Bier, wird aber nur in 16er-Packs geliefert, und man kann es nicht 
drinken, wenn man nicht vorher mit einem DOS Bier vorsp&#252;lt. An sich kann 
man DOS und Windows Bier zugleich trinken, wenn man nur wenige DOS Biere 
trinkt und diese sehr langsam. Manchmal explodiert die Windows Dose auch 
bei dem Versuch, sie zu &#246;ffnen. </P>

<p><b>Windows95 Bier: </B><BR>
Das neueste Bier am Markt. Viele Probetrinker behaupten, es schmecke 
vorz&#252;glich. Tats&#228;chlich sieht es aus wie eine Mischung aus MAC Bier und 
OS/2 Bier, schmeckt aber wie Windows 3.x Bier. Es wird in 32er-Packs 
verkauft, die allerdings nur 16 Dosen enhalten. Der durchschnittliche 
Bierfreund wird wohl bei Windows 3.x Bier bleiben, bis er am Stammtisch 
Freunde trifft, denen das Windows95 Bier geschmeckt hat. Obwohl die 
Herstellerfirma MS (Multi-Sauf) behauptet, bei diesem Bier sei eine 
v&#246;llig neue Sorte entstanden,findet man in der kleingedruckten 
Inhaltsstoffe-Liste MAC-, OS/2 und DOS Bier-Komponenten. </P>

<p><b>Windows NT Bier: </B><BR>
Es wird ausschlie&#223;lich in 32er-Packs geliefert, aber man braucht einen 
gro&#223;en K&#252;hlschrank, um es aufzubewahren, da man nur Gro&#223;packungen erh&#228;lt. 
Es sieht aus wie Windows 3.x Bier, aber die Herstellerfirma wird das Aussehen an Windows95 Bier anpassen, wenn dieses sich gut verkauft. Es wird als industrielles Starkbier verkauft und ist an sich nur zum 
Ausschank an qualifizierten Bars gedacht. </P>

<p><b>UNIX Bier: </B><BR>
Unix Bier kann man in verschiedensten Packungsgr&#246;&#223;en kaufen. Von 8er bis 
sogar 64er-Packs von verschiedenen Brauereien, deren Geschmack aber 
ziemlich gleich ist. Unix Biertrinker sind sehr loyal zu ihrer Marke. 
Manchmal ben&#246;tigt man einen eigenen Dosen&#246;ffner, denn ab und zu brechen 
die Verschlu&#223;ringe beim &#246;ffnen ab, doch dann braucht man viel &#220;bung oder 
einen Freund, der ein jahrelanger, erfahrener Unix Biertrinker ist. </P>

<p><b>AmigaDOS Bier: </B><BR>
Die urspr&#252;ngliche Herstellerfirma ging pleite, doch eine deutsche 
Brauerei hat das Rezept zwischenzeitlich &#252;bernommen und exportierte es. Nachdem auch die deutsche Brauerei pleite ging, war einige Zeit eine amerikanische Gro&#223;brauerei dran beteiligt. Einige Mitarbeiter hatten neue Rezepte f&#252;r ein neues Bier.  Diese wurden aber nicht umgesetzt.  Nachdem die amerikan
ische Gro&#223;brauerei nichts mehr mit dem alten Bier anzufangen wusste, &#252;bernahmen zwei einzelne Braumeister die Brauerei und wollen jetzt das neue Rezept etwas ver&#228;ndert doch noch umsetzen. Sie lassen sich aber ziemlich viel Zeit dabei, so da&#223; inzwischen viele urspr&#252;ngliche Amiga-Bier-Freunde zu einer anderen Brauerei &#252;bergelaufen sind.
Ein Verkaufsschlager war AmigaDOS Bier  nie, doch das lag am Marketing. &#196;hlich wie Unix-
Trinker sind AmigaDOS-Trinker ein loyales Gr&#252;ppchen. Es wurde anfangs  in 16er 
sowie sp&#228;ter in 32er Packs verkauft. Bei seiner Markteinf&#252;hrung 
erschien es als farbenpr&#228;chtiges und gehaltvolles Bier, aber das Design wurde nie wesentlich ver&#228;ndert, so da&#223; es jetzt etwas abgestanden wirkt. 
Kritiker meinen, man k&#246;nne es nur zum Fernsehen trinken. </P>















</TD></TR></TABLE>
</BODY>
</HTML>
