<HTML><HEAD><TITLE>Heaven!</TITLE></HEAD>
<BODY BGCOLOR=#0000dd text=#000000 background="wolke.jpg">
<TABLE BORDER=0 width=100% height=100% cellpadding=10><TR><TD>
 An Alle:<P>
 Wie ihr ja sicherlich alle inzwischen mitbekommen habt, wurde die fd-Hitparade
 eingestellt, und zwar aus dem einfachen Grund, das sich zuwenig Leute an ihr
beteiligt haben.<BR>Aber was einige von euch vieleicht noch nicht wissen:
Carsten Schr&ouml;der hat die Hitparade f&uuml;r die Aakt gerettet, sie wird ab sofort
dort erscheinen. Und ratet mal, wer f&uuml;r die Erstellung zust&auml;ndig ist? Na? Na wer
wohl? Ich nat&uuml;rlich :)<BR>Tja, Carsten meinte &uuml;ber die Aakt w&auml;hre das
Zielpublikum, und damit die Beteiligung h&ouml;her; Ich kann nur sagen, das hoffe ich
sehr.<P>Leute, 2 (In Worten: ZWEI) Einsendungen f&uuml;r Februar, da&szlig; ist doch echt
mickrig!!! Ist es denn zuviel verlangt, das ihr ein par Namen auf eine e-Mail
kliert, und sie da hin schickt? Leute Leute Leute, wenn das nicht besser wird
stirbt sie ein zweites Mal! Also, f&uuml;r die die schwer von Begriff sind:<BR>Wenn
ich nicht sp&auml;testens zum 20.03 in Mails ersaufe lege ich h&ouml;chstpers&ouml;hnlich eure
Amigas per Telekinese lahm, dazu noch eure Auto, Omas, und was ich sonst noch so
finde ;-)<P>O.K., den Text nicht ganz so ernst nehmen. Aber mal ehrlich, mehr
als zwei Mail sollten das schon werden. Stellt euch mal vor, nur 2 Leute w&uuml; rden
was zur NoCover beitragen. Ist vileicht nicht ganz vergleichbar, aber sie ist
leider auf dem besten Weg dahin :-(. Aber die Hitparade hat ja nun eine zweite
Chance bekommen, und daher wird sich jetzt auch einiges &auml;ndern:

<UL TYPE=BULLET>
<LI>Die Sparte fd-Serien f&auml;llt auf Wunsch von Carsten weg</LI>
<LI>Die Sparte "Multimedia" ist f&uuml;r Multimedia da, und sonst nix! Ihr erspart
mir geh&ouml;rig Pfriemelei, wenn ihr Voyager und co. direkt in "Anwendungen" setzt,
da geh&ouml;ren Programme schlie&szlig;lich hin.</LI>
<LI>Um am Gewinnspiel teilzunehmen m&uuml;&szlig;t ihr mindestens 3 Rubriken ausf&uuml;llen</LI>
<LI>Wenn ich seh, da&szlig; einer die Hitparade des Vormonats einfach kopiert hat,
k&ouml;nnte es passieren, das ich die betreffende Mail "verliere"....</LI>
</UL>
O.K., jetzt reicht es aber. Sonst kommen hier bald nur noch flames an 0;-).
Tschau...<P>
<I>The Saint</I>
</TD></TR></TABLE></BODY></HTML>