<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Aminet29</title>
</head>
<body background="cd_aminet29.jpg" text=black link=blue alink=red bgcolor="#FFFFCC"><br>
<font color="#800000" size="7">
<center><b>WILLKOMMEN ZUR AMINET CD 29</b></font></center><br>
<p>
Wie seit langer Zeit eingespielt wird man in der "LiesMich" mit der allgemeinen &#220;bersicht
begr&#252;&#223;t:<br>
<pre>
   Aminet ist wieder voll in Betrieb und es gibt wieder eine Menge Neuheiten.
   Der Inhalt:
   910 MB   neue Software    erschienen zwischen CD 28 und dem 3. Januar
     6 MB    kommerzielle    Software: ArtEffect 1.5 (Bildbearbeitung)

   F&#252;r die folgenden Datentypen gibt es spezielle Pr&#228;sentationen:
         Spiele       Eine Liste aller direkt startbaren Spiele
         Demos        Ein Index der besten Demos
         Bilder       Eine Datenbank mit verkleinerten Versionen
          Mods        Eine Liste aller Mods, sortiert nach Stil und Bewertung

   Weitere Informationen gibt es zu:
      Neuigkeiten     Was sich seit der letzten CD ge&#228;ndert hat
    Zugriffssoftware  Find, Prefs, und die ganzen anderen Werkzeuge
     Pers&#246;nliche CD   Wie man den Inhalt nach seinem Geschmack arrangiert
    Probleml&#246;sungen   &#220;bliche Probleme mit der CD und ihre L&#246;sungen
     Was ist Aminet   Das gr&#246;sste Amiga-Archiv der Welt
      Aminet-Zugang   Wo kann ich direkt auf Aminet zugreifen?
       Beisteuern     Wie krieg ich meine Software aufs Aminet? Frei-CDs!
       Bestellen      Wo man an Aminet CDs und Aminet Abos kommt
      Rechtliches     Viruswarnung, Sharewarenotiz
</pre></p><hr>
<p>
<img hspace=10 vspace=4 src="cd_aminet29a.jpg" alt="[ CDROM Cover ]" width=240 height=230 align=right>
Wie eingangs zu lesen ist, ist diesmal als Bonus das Bildbearbeitungsprogramm
ArtEffect 1.5 Vollversion der Firma Haage &amp; Partner beigelegt. Die
R&#252;ckseite des CD-Labels ist eine Bestellkarte f&#252;r das Upgrade von V1.5
auf V3.0 zu einem Preis von 149,- DM.</p>
<p>
Das Bildbearbeitungsprogramm wurde in der NoCover-33 von Michael Thaler und in der
NoCover-46 von Thomas Resch vorgestellt. Da dies doch schon einige Zeit her ist, werde ich
auch einige Worte hier&#252;ber verlieren.</p>
<ul>Im Directory <b>ArtEffect</b> befindet sich:
<li> ArtEffect 1.5 Classic</li>
<li> ArtEffect 1.5 Support</li>
<li> ArtEffect 2.6 Demo</li>
<li> ArtEffect 2.6 Support</li>
<li> ArtEffect Workshop</li>
</ul>
<p>
Der Workshop besteht nur aus einer Schublade mit 845 KB Bilder in GIF und JPG.
Texte existieren nicht, noch nicht einmal eine ReadMe-Datei.</p>
<p>
Eines schicke ich vorweg, installiert habe ich diese Version nicht, da ich
registrierter User von ArtEffect bin und demgem&#228;&#223; die neueste Version
installiert habe. Deshalb nur eine theoretische Betrachtung.</p>
<p>
Was ist ArtEffect? Es ist ein Programm zum kreativen Malen (pixelorientiert),
zur effektvollen Bildbearbeitung und zur Fotoretusche. Es erkennt beim Laden von
Grafiken die Formate IFF(ILBM), IFF(RGB8), JPEG, GIF, PING, TIFF, PCX, BMP und
TARGA. Beim Speichern k&#246;nnen die Formate IFF(ILBM), IFF(RGB8), JPEG, PING,
TIFF, PCX und TARGA gew&#228;hlt werden. Die Speicherung erfolgt immer im
24-Bit-Format. Voraussetzung ist mindestens ein AGA-Rechner mit OS 3.0 oder
h&#246;her. F&#252;r Bearbeitung etwas gr&#246;&#223;erer Bilder werden dann 6
bis 10 MB Arbeitsspeicher ben&#246;tigt. W&#228;rmstens empfohlen wird der
Einsatz einer Grafikkarte.</p>
<p>
Um nun dieses Programm sinnvoll testen und nutzen zu k&#246;nnen, ist
irgendetwas Schriftliches, wie ein altes Handbuch, ein Workshop in einer Zeitung
etc. dringends notwendig. Auf der Aminet fehlt diesbez&#252;glich alles. Das
einzige, womit man sich eventuell ein ganz kleines bisschen helfen k&#246;nnte,
ist die Hilfefunktion, da die Kataloge in allen m&#246;glichen Sprachen
enthalten sind. Nur durch Probieren kommt man seltenst hinter das Geheimnis, wie
das Malen mit Kreide, Wachs, Bleistift, Pinsel, &#214;l usw. funktioniert. Schon
das Verwenden einer "echten" Leinwand oder der Papiersorte als Hintergrund muss
man wissen, dass der Menuepunkt Maske/Papiersorte laden... gew&#228;hlt werden
muss.
<ul>Hier kann man dann w&#228;hlen zwischen
<li> Crushed (zerknittertes Papier)</li>
<li> Wood (Holz)</li>
<li> Granite (Granit)</li>
<li> Parchment (Pergament)</li>
<li> Stone (Stein)</li>
<li> Grass (Gras)</li></ul>
Die nachtr&#228;gliche Bildbearbeitung, wie Gl&#228;tten, Sch&#228;rfen,
Aufhellen, Abdunkeln, Verwischen etc. ist ohne Anleitung fast unm&#246;glich.
Wann soll man wissen, welche F-Taste welche Funktion ausf&#252;hrt oder
bereitstellt? Was bewirkt der Zauberstab? Wie erreiche ich einen effektvollen
Farbverlauf? Ohne irgendeine Anleitung sehe ich verflixt schwarz.</p>
<p>
Abschlie&#223;end kann ich aber sagen, wer dieses Programm kennt und
einigerma&#223;en mit umgehen kann, m&#246;chte es keinesfalls mehr missen.</p>
<hr>
<pre>
   Es folgen einige Highlights dieser CD. Mods, Spiele, Bilder und Demos
   werden nicht nicht aufgelistet, da sie eigene Bestenlisten haben.
   Unbedingt einen Blick wert sind auch die vielen elektronischen Magazine
   in docs/mags.

   "quickfile.lha"       biz/dbase  292K  "V3.19.5 Leistungsfhg.,schnelle Datenbank"
   "CandyProDemo.lha"    biz/demo   2.8M  "CandyFactoryPro, Demoversion"
   "FantasticDemoE.lha"  biz/demo   2.6M  "Fantastic Dreams English, Demoversion"
   "golded5.lha"         biz/demo   6.1M  "GoldED Studio 5, DEMO"
   "CycasDemo__FPU.lha"  biz/demo   693K  "CYCAS Demo 1.78 Architektur-Design 2+3D"
   "HTTPlister.lha"      biz/dopus   25K  "AmiNet-RECENT-Datei anschauen + laden"
   "Magnum_Opus31a.lha"  biz/dopus  270K  "435 DateiTypen, AmigaGuide-Dokus & Extras"
   "AFM2.lha"            comm/mail   34K  "FTP: Aminet in E-Mail 2 (MUI,YAM)"
   "AminetFTPMail.lha"   comm/mail   67K  "Aktuelle AmiNet-Uploads per eMail bekommen"
   "Hurl.lha"            comm/mail   14K  "Intelligenter Einschub f. YAMs URL-Grab"
   "Packet-Point.lha"    comm/misc  201K  "Point-Programm f. Packet-Radio/Funk (Ham)"
   "facts.lha"           comm/tcp    27K  "Ihre Uhr mit NTP-Server synchronisieren" 
   "MiamiStartStop.lha"  comm/tcp    60K  "Miami-Lader&Kontrolle/Onlinezeit,Geschw."
   "rexxcd.lha"          disk/cdrom 262K  "CD-Spieler, synchronis. Texte V1.4+Quelle" 
   "adosguide.lha"       docs/help  291K  "Detaillierte AmigaDOS-Referenz, V2.5"
   "DTypeGuide.lha"      docs/lists  50K  "Guide zu  230 Amiga-Datentypen   -19-" 
   "DevGuide.lha"        docs/lists  50K  "Guide zu  243 Amigageraeten      -17-"
   "LibGuide.lha"        docs/lists 189K  "Guide ueber 2038 Amigabibliotheken -33-"
   "Warp3DDev-1.1.lha"   gfx/board  175K  "Warp3D-Entwicklerarchiv" 
   "JPEG-Box.lha"        gfx/conv   147K  "JPEG-Generator fuer WWW-Grafiken V1.01 (6"
   "EuroChamp.lha"       docs/misc   22K  "Statistiken Europameisterschaften'60-'96"
   "F1Champ.lha"         docs/misc   25K  "Statistiken der Formel Eins 1950-1998"
   "AMP.lha"             gfx/show    72K  "MPEG1/2-Videospieler fuer PPC, schnell!"
   "AmigaAMP.lha"        mus/play   462K  "MPEG-Audio-Spieler mit GUI (68k/PPC)"
   "PippinEVD.lha"       misc/emu    13K  "ShapeShifter EVD mit PIP-Anzeige/Display"
   "amilab.lha"          misc/sci   337K  "Simulation elektron. Schaltkreise, V2.10"
   "BeatBox2.lha"        mus/edit   287K  "Musikeditor: Zeigen und Klicken" 
   "DBPro220.lha"        mus/edit   496K  "Multitracker-TB303emu,PPC-Unterstuetzung"
   "samplee.lha"         mus/edit   216K  "Schneller Sample-Editor f. 16Bit-Stereo " 
   "WaveTracer.lha"      mus/edit   1.1M  "Umfangreiches Soundbearbeitungsprogramm"
   "AmigaAMP.lha"        mus/play   462K  "MPEG-Audio-Spieler mit GUI (68k/PPC)" 
   "mpega.lha"           mus/play    39K  "MPEG I,II & III Audio-Dekodierung V3.4" 
   "SongPlayer.lha"      mus/play   208K  "Cooler, starker Audio-Spieler, V1.45  68"
   "TMLG.lha"            mus/play   215K  "MP3-Spieler, schlaegt AmigaAmp!" 
   "Fixed.lha"           text/bfont  14K  "Fixierte Schriften, Gr. 8,9,12,14,16"
   "NonFixed.lha"        text/bfont  16K  "Proportionalschriften, Gr. 8,9,12,14,16"
   "NonFixed.lha"        text/bfont  16K  "Proportionalschriften, Gr. 8,9,12,14,16" 
   "Change.lha"          text/misc   34K  "Texte/Daten in Files aendern/editieren"
   "meexchange.lha"      util/cdity  28K  "Exchange-Ersatz,mit einigen Extras,2.1"
   "Change.lha"          util/misc    7K  "Veraendert Datei anhand von Befehlen" 
   "LstVersn.lzh"        util/cli    18K  "CLI-Listversion, Befehl V1.36 (deutsch)" 
   "aiffdt41.lha"        util/dtype  17K  "Datentyp fuer AIFF-Geraeusche (41.2)"
   "wavdt41.lha"         util/dtype   7K  "Datentyp fuer wave-Sounds (41.2)" 
   "ppclibemu.lha"       util/libs   56K  "PPC.bibliothek-Emulation unter WarpOS" 
   "TaskersFlush.lha"    util/misc   20K  "Periodisches 'Wischen' des Speichers"
   "CpuLoadII.lha"       util/moni   11K  "Misst CPU-Gebrauch, sehr schoen" 
   "xfdmaster.lha"       util/pack  218K  "Rel1.23 gepackte Dateien dearchivieren"
   "SavInstaller.lha"    util/sys   159K  "Neue Implementation des C=-Installers"
   "Explorer46.lha"      util/wb    697K  "Zeigt File_IDs, Konvertiert Archive" 
</pre>
<hr>
<p>
Schauen wir uns doch einmal die Demoversion von GoldEd5 an. Die 6.1 MB gepackte
Datei ergibt ein Verzeichnis von 12,75 MB Namens "demo". Als erstes sollte man
die Begr&#252;&#223;ung lesen:
<blockquote><i>
Willkommen bei der Demo-Version von GoldED Studio 5, einem umfangreichen
Editorpaket f&#252;r Amiga Computer. Es handelt sich bei diesem Paket um eine
Produktpr&#228;sentation, nicht um voll funktionsf&#228;hige Software. Bitte
laden Sie GoldED 4.7.3 von unserer Webseite, wenn Sie ein voll
funktionsf&#228;higes Programm suchen. Aufgrund von
Gr&#246;&#223;enbeschr&#228;nkungen fehlen in der Demonstration einige Add-Ons
der Original-CD: die SAS/C-Erweiterung, die Installer-Erweiterung, das Thesaurus
und die meisten W&#246;rterb&#252;cher der Rechtschreibpr&#252;fung werde nicht
mitgeliefert.
</i></blockquote>
<a name=aa1>
<p>
<a href="cd_aminet29b.jpg" alt="[ Pref-Beispiel ]"width=520 height=390>
<img src="cd_aminet29l.jpg" alt="[ Klick mich ]" width=120 height=90 align=right></a>
Also keine Probleme, die einer Testung entgegenwirken k&#246;nnten. Das
Installerprogramm &#252;bernimmt fast alles vollautomatisch und nun das Demo
angeklickt erscheint ein etwas modernerer Bildschirm mit Farbtupfern und nicht
mehr im obligatorischen Grau/Blau/Schwarz. Das digitale Handbuch (&#252;ber Help
oder Menue aufrufbar) ist wie gewohnt gut und sauber gegliedert und im ersten
Augenblick auch ersch&#246;pfend auskunftfreudig. Die Standard-Prefs ist leicht
auf die eigenen Bed&#252;rfnisse einzustellen (klickt auf das Thumbnail!)und
schon legen wir mit dem Testen los. Wie versprochen funktioniert alles. Alles?
Nein. Es ist keine Speicherung eines editierten Textes m&#246;glich. Mit Trick
17 durch die kalte K&#252;che von hinten ins Auge ebenfalls keine Chance, auch
nicht durch vergebliches Versuchen der eigenen registrierten 4er Version. Die
funktioniert einfach gar nicht mehr. Es bleibt nach dem Testgang nichts anderes
&#252;brig, als in das entpackte Originalverzeichnis zu gehen und das Icon
"Uninstall" anzuklicken. Nun wird fast alles wieder deaktiviert und nach einem
Warmneustart ist alles wieder beim Alten.</p>
<p>
Jetzt nehmen wir uns auch mal die Zeit und lesen die gut gemachten Guides, die
sowohl in Englisch wie auch in deutsch vorliegen. Eine Frage bei FAQ lautete:
<blockquote><i>
Ist es m&#246;glich und zu empfehlen, diese Software &#252;ber GoldED 3 oder
GoldED 4 zu installieren? <br>
Antwort:<br>
Diese Software kann nicht &#252;ber GoldED 3, GoldED 4 oder fr&#252;herer
Versionen installiert werden. Installieren Sie bitte in ein neues Verzeichnis
und l&#246;schen Sie die alte Installation manuell, wenn GoldED Studio 5 zu
Ihrer Zufriedenheit arbeitet. Konfigurationsdaten von GoldED 4 k&#246;nnen
&#252;bernommen werden; das Format der Einstellungen ist abw&#228;rtskompatibel.
</i></blockquote>
Im Ordner "Bonus" gibt es zwei Directories: RA (ein Fernsteuerprogramm) und WWW.
Im letzteren hat Dieter Eilert seine Homepage komplett mitgeliefert, damit jeder
in Ruhe zu Hause alles lesen kann, ohne Online gehen zu m&#252;ssen. Hier wird
auch die Version 5 ausgiebig (alles in Englisch) inklusive 10 Screenshots
vorgestellt und die <a href="cd_aminet29b.html"> Unterschiede </a> zwischen
Version 4 und Version 5.</p>
<hr>
<p>
Ein weiteres sehr interesantes Demo ist das "CycasDemo__FPU.lha".<br>
Was ist CYCAS?</p>
<p>
CYCAS ist ein 2D+3D CAD/Architekturprogramm der neuen Generation f&#252;r Amiga
Computer.</p>
<p>
CYCAS verfolgt die Philosophie das Zeichenhandwerk an der Rei&#223;schiene im
Computer zu simulieren. Dem Zeichner werden dabei keine fachuntypischen
Arbeitsweisen aufgezwungen. Die Oberfl&#228;che von CYCAS zeichnet sich durch
eine benutzerfreundliche Gestaltung aus.</p>
<p>
Die grafische Benutzeroberfl&#228;che von CYCAS ist didaktisch ausgearbeitet und
einfach zu bedienen. Konzepte wie die Ebenentechnik oder die indexierten
Dialogfenster erlauben eine flexible Anpassung des Programms an die jeweils zu
bearbeitende Aufgabe.</p>
<p>
Neben den &#252;blichen CAD-Elementen k&#246;nnen spezielle Architekturelemente
wie W&#228;nde, &#214;ffnungen, 3D-Bauteile, Architekturverma&#223;ungen und
Fl&#228;chenberechnungen eingegeben werden. Gleichzeitig baut CYCAS im
Hintergrund das 3D-Modell auf. Dieses kann in verschiedenen Projektionen
bearbeiten und als Perspektive oder Isometrie berechnet werden. Schlie&#223;lich
kann das 3D Modell an einen beliebigen Amiga-Renderer ausgegeben werden, um eine
realistische Simulation des geplanten Geb&#228;udes zu erhalten.</p>
<p>
Die Zeichnungen k&#246;nnen &#252;ber jedem Drucker oder Plotter in optimaler
Qualit&#228;t ausgegeben werden.</p>
<p>
Die Symbolbibliothek kann beliebig um eigene 2D/3D Elemente erweitert werden.</p>
<p>
CYCAS hat 1993 in der Version 1.0 den Deutsch-&#214;sterreichischen
Hochschul-Software-Preis im Fachbereich Architektur gewonnen, der von der
Akademischen Software Kooperation (ASK) der Universit&#228;t Karlsruhe
ausgeschrieben wurde.</p>
<p>
Seitdem wurde CYCAS &#252;berarbeitet und erweitert und liegt nun in der Version 1.78
vor.</p>
<p>
Die DemoVersion von CYCAS ist nat&#252;rlich eingeschr&#228;nkt.
<ul>
<li> Das Speichern und Exportieren der Zeichnungen ist nicht m&#246;glich. </li>
<li> Die Ausgabe von Zeichnungen ist nur &#252;ber Drucker m&#246;glich. </li>
<li> Das Exportieren von 3D-Elementen im Lightwave-ObjektFormat ist nur begrenzt
m&#246;glich. </li>
<li> Die Symbolbibliothek ist eingeschr&#228;nkt. </li>
<li> Als Online-Hilfe kann nur eine Kurzanleitung aufgerufen werden. </li></ul>
<hr>
<p>
<a name=a1>Hier eine globale &Uuml;bersicht &uuml;ber Aminet29:</a><br><center>
<table border="2" cellpadding="3" cellspacing="3" width="80%">
<tr><td> <a href=cd_aminet29a.html#a1> &quot; biz  &quot; </a></td>
<td> Business software </td><td align="right"> 45,9 MB </td><td>&#160;</td></tr>
<tr><td> <a href=cd_aminet29a.html#a2> &quot; comm &quot; </a></td>
<td> Communications </td><td align="right"> 14,5 MB </td><td>&#160;</td></tr>
<tr><td> &quot; demo &quot; </td>
<td> Gfx and sound demos </td><td align="right"> 60,1 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet29a.html#a3> &quot; dev  &quot; </a></td>
<td> Development software </td><td align="right"> 15,3 MB </td><td>&#160;</td></tr>
<tr><td> <a href=cd_aminet29a.html#a4> &quot; disk &quot; </a></td>
<td> Disk/Harddisk tools </td><td align="right">  1,4 MB </td><td>&#160;</td></tr>
<tr><td> <a href=cd_aminet29a.html#a5> &quot; docs &quot; </a></td>
<td> Text documents </td><td align="right"> 47,6 MB </td><td>&#160;</td></tr>
<tr><td> &quot; game &quot; </td>
<td> Games </td><td align="right"> 44,8 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet29a.html#a6> &quot; gfx  &quot; </a></td>
<td> Graphics </td><td align="right"> 16,6 MB </td><td>&#160;</td></tr>
<tr><td> <a href=cd_aminet29a.html#a7> &quot; hard &quot; </a></td>
<td> Hardware </td><td align="right"> 1,1 MB </td><td>&#160;</td></tr>
<tr><td> <a href=cd_aminet29a.html#a8> &quot; misc &quot; </a></td>
<td> Miscellaneous </td><td align="right"> 10,8 MB </td><td>&#160;</td></tr>
<tr><td> &quot; mods &quot; </td>
<td> Music modules </td><td align="right"> 123,5 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet29a.html#a9> &quot; mus  &quot; </a></td>
<td> Musical software </td><td align="right"> 9,5 MB </td><td>&#160;</td></tr>
<tr><td> &quot; pix  &quot; </td>
<td> Pictures </td><td align="right"> 109,7 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet29a.html#a10> &quot; text &quot; </a></td>
<td> Text related </td><td align="right"> 4,9 MB </td><td>&#160;</td></tr>
<tr><td> <a href=cd_aminet29a.html#a11> &quot; util &quot; </a></td>
<td> Utilities </td><td align="right"> 17,7 MB </td><td>&#160;</td></tr></table></center>
</p>

<br><br><center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
<center>
<a href="NoCover.html#a9"> <img border=0 src="l_hauptinhalt.jpg" width=495 height=75></a>
</center></table></center></center>
</body>
</htlm>
