<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Einf&uuml;hrung</title>
</head>
<body background="wol1.jpg" bgcolor="#FFFFF0" text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<a name="top"></a><br>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Dienste im Internet</h2></td>
</tr>
<tr>
<td bgcolor=#FFFFF0 valign=top nowrap>

<p>
&nbsp;<a href="#a1"><b>E-Mail</b></a> <br>
&nbsp;<a href="#a2"><b>Telnet</b></a><br>
&nbsp;<a href="#a3"><b>File Transfer (FTP)</b></a><br>
&nbsp;<a href="#a4"><b>Gopher</b></a><br>
&nbsp;<a href="#a5"><b>Chat (IRC)</b></a><br>
&nbsp;<a href="#a6"><b>Newsgroups (News)</b></a><br>
&nbsp;<a href="#a7"><b>World Wide Web (WWW)</b></a>
</p>

</td>
</tr>
</table>
<hr noshade size=1>

<h2 class="Sh2"><a class="an" name="a1">E-Mail</a></h2>

<p>E-Mail (elektronische Post) ist wohl der am meisten genutzte Internet-Dienst.
E-Mail erlaubt die pers&ouml;nliche &Uuml;bermittlung von Nachrichten und
Dateien von einem Sender an einen Empf&auml;nger. Wer an diesem Dienst
teilnehmen will, braucht folglich eine eigene E-Mail-Adresse. Solche Adressen
sind an dem ber&uuml;hmten <b>@</b> (sprich: englisch &quot;at&quot;, also
&quot;bei&quot;) in der Mitte erkennbar.</p>

<p>Vor allem im Business-Bereich verdr&auml;ngt E-Mail nach und nach die
herk&ouml;mmliche Briefpost (von E-Mail-Anh&auml;ngern liebevoll oder
ver&auml;chtlich als &quot;Schneckenpost&quot; oder &quot;snail mail&quot;
bezeichnet). Auch das Fax ist eine durch E-Mail gef&auml;hrdete Gattung. Die
Vorteile liegen auf der Hand:</p>
<ul>
<li>E-Mails brauchen meist nur wenige Minuten vom Sender zum Empf&auml;nger,
egal ob einige wenige oder mehrere tausend Kilometer zwischen ihnen liegen.</li>

<li>E-Mails sind preiswert. Im Vergleich zu Briefen fallen f&uuml;r einfache
E-Mails nur Pfennigbetr&auml;ge an. </li>

<li>Gegen&uuml;ber einem Telefonat bieten sie den Vorteil, dass
Vereinbarungen oder dergleichen darin schriftlich festgehalten werden.</li>

<li>Moderne E-Mail-Programme k&ouml;nnen E-Mails in einer durchsuchbaren
Datenbank speichern, so dass Sie vor l&auml;ngerer Zeit gesendete oder
empfangene Mails leicht wiederfinden.</li>

<li>Der <b>Mime</b>-Standard, der sich bei E-Mails allm&auml;hlich durchsetzt,
erlaubt das bequeme Anh&auml;ngen beliebiger Computerdateien an eine Mail, so
dass E-Mail auch f&uuml;r den individuellen Austausch von Dateien immer
mehr Bedeutung gewinnt.</li>

<li>E-Mail zwingt Sender und Empf&auml;nger nicht, gleichzeitig online zu sein.
Sie holen sich Ihre E-Mails ab, wenn Sie gerade Zeit haben.</li>

<li>Neben der M&ouml;glichkeit, mit bestimmten anderen Internet-Teilnehmern
Nachrichten und Daten auszutauschen, k&ouml;nnen Sie mit einer eigenen
E-Mail-Adresse auch an <b>Mailing-Listen</b> teilnehmen, die Sie
interessieren.</li>
</ul>
<p>Das heutige E-Mail-System hat aber auch noch mit einigen Problemen zu
k&auml;mpfen. Eine normale E-Mail ist auf dem Weg vom Sender zum Empf&auml;nger
etwa so geheim wie eine Ansichtskarte. F&uuml;r vertrauliche Mitteilungen oder
sensible Daten ist sie ungeeignet. Mittlerweile gibt es
Verschl&uuml;sselungsverfahren wie <b>PGP (Pretty Good Privacy)</b>, die das
individuelle Kodieren und Dekodieren von E-Mails und angeh&auml;ngten Dateien
erlauben. Voraussetzung ist dazu jedoch, dass sowohl Sender als auch
Empf&auml;nger &uuml;ber eine entsprechende Zusatzsoftware verf&uuml;gen und
zuvor ihre &ouml;ffentlichen Kodierschl&uuml;ssel austauschen.</p>

<h5 align=right>gehe <a href="#top">zur&uuml;ck</a></h5>
<hr noshade size=1>
<h2 class="Sh2"><a class="an" name="a2">Telnet</a></h2>

<p>Telnet ist dazu gedacht, einen fernen Rechner im Internet so zu bedienen, als
s&auml;&szlig;e man direkt davor. Telnet ist damit eine einfache L&ouml;sung
f&uuml;r Teleworker. Und diese L&ouml;sung ist schon wesentlich &auml;lter als
der Begriff des &quot;Teleworkings&quot;.</p>

<p>Telnet ist vor allem f&uuml;r Unix-Systeme gedacht. Es erlaubt das
betriebssystemeigene <b>login</b> (Anmelden) eines Benutzers an einem ans
Internet angeschlossenen Host-Rechner in Form eines <b>rlogin</b> (remote
login). Das Anmelden ist nur m&ouml;glich, wenn Sie User-ID und Pa&szlig;wort
kennen, d.h. auf dem angew&auml;hlten Host-Rechner als Benutzer eingetragen
sind. Nach dem Einw&auml;hlen erhalten Sie eine Unix-Shell (Eingabeaufforderung)
und k&ouml;nnen auf dem entfernten Rechner Betriebssystembefehle eingeben,
Programme starten usw.</p>

<p>PC-Anwender, die nicht direkt mit der Verwaltung von Server-Rechnern im
Internet zu tun haben, werden mit Telnet kaum in Ber&uuml;hrung kommen. Es gibt
jedoch auch f&uuml;r PC-Benutzer von Systemen wie MS Windows oder Macintosh
<b>Telnet-Clients</b>. Diese Programme erlauben es, vom eigenen PC aus auf einem
entfernten Host-Rechner zu arbeiten. Ohne Kenntnis der Befehle des
Hostrechner-Betriebssystems ist ein solches Programm allerdings zwecklos.</p>


<h5 align=right>gehe <a href="#top">zur&uuml;ck</a></h5>
<hr noshade size=1>
<h2 class="Sh2"><a class="an" name="a3">File Transfer (FTP)</a></h2>

<p>FTP ist ein Internet-Dienst, der speziell dazu dient, sich auf einem
bestimmten Server-Rechner im Internet einzuw&auml;hlen und von dort Dateien auf
den eigenen Rechner zu &uuml;bertragen (<b>Download</b>) oder eigene Dateien an
den Server-Rechner zu &uuml;bertragen (<b>Upload</b>). Ferner bietet das
FTP-Protokoll Befehle an, um auf dem entfernten Rechner Operationen
durchzuf&uuml;hren wie Verzeichnisinhalte anzeigen, Verzeichnisse wechseln,
Verzeichnisse anlegen oder Dateien l&ouml;schen.</p>

<p>Beim Einw&auml;hlen an einem FTP-Server gilt es, zwei Arten zu unterscheiden:
es gibt &quot;normales&quot; FTP und <b>anonymes FTP</b>. </p>

<p>Beim normalen FTP haben Sie nur Zugriff auf den Server, wenn Sie beim
Einw&auml;hlen eine individuelle User-ID und ein Pa&szlig;wort angeben. Mit
diesen Zugangsdaten mu&szlig; der FTP-Serververwalter Sie am Server als
berechtigten Anwender eingetragen haben.</p>

<p>Bei anonymem FTP handelt es sich um &ouml;ffentlich zug&auml;ngliche Bereiche
auf Server-Rechnern. Dazu brauchen Sie keine Zugangsberechtigung. Sie
w&auml;hlen sich einfach mit der User-ID &quot;anonymous&quot; ein, und als
Pa&szlig;wort geben Sie Ihre E-Mail-Adresse an. Es gibt etliche &ouml;ffentliche
FTP-Server im Internet, die umfangreiche Dateibest&auml;nde zum Download
anbieten. Hier erhalten Sie Software, Hilfetexte, Grafiksammlungen usw.</p>

<p>F&uuml;r &ouml;ffentliche, anonyme FTP-Server gibt es Regeln. Da Sie beim
Besuch solcher Server nur Gast sind, sollten Sie sich auch entsprechend
verhalten. Bleiben Sie nicht l&auml;nger als n&ouml;tig. Laden Sie sich nicht
unn&ouml;tig viele Dateien herunter. Lesen Sie zuerst die Readme-Dateien, die es
in fast jedem Verzeichnis gibt und die den Inhalt des Verzeichnisses
erl&auml;utern.</p>

<p>Wenn Sie lediglich hin und wieder &ouml;ffentlich zug&auml;ngliche FTP-Server
besuchen, um von dort Dateien downzuloaden, k&ouml;nnen Sie das auch mit
modernen WWW-Browsern wie Netscape oder dem MS Internet Explorer tun. Solche
Browser zeigen die Dateilisten auf FTP-Servern als anklickbare Verweise an. Je
nach Dateityp k&ouml;nnen Sie Dateien dann downloaden oder direkt im
Browser-Fenster anzeigen.</p>

<p>F&uuml;r anspruchsvollere Arbeiten, vor allem, wenn Sie die Dateien Ihres
eigenen WWW-Projekts verwalten wollen, brauchen Sie ein FTP-Programm. Solche
Programme gibt es f&uuml;r alle Betriebssysteme, und einige Betriebssysteme,
etwa alle Unix-Derivate oder OS/2, haben bereits einen eingebauten
FTP-Client.</p>

<h5 align=right>gehe <a href="#top">zur&uuml;ck</a></h5>
<hr noshade size=1>
<h2 class="Sh2"><a class="an" name="a4">Gopher</a></h2>

<p>Gopher gilt heute als der Vorl&auml;ufer des World Wide Web. Der Name kommt
von &quot;go for&quot; und dr&uuml;ckt damit aus, was der wichtigste Zweck
dieses Dienstes ist: n&auml;mlich gro&szlig;e Informationsbest&auml;nde leichter
durchsuchbar zu machen.</p>

<p>Gopher ist eine men&uuml;basierte Bedienoberfl&auml;che zum Auffinden von
Information, aber auch zum Nutzen anderer Internet-Dienste wie FTP oder Telnet.
Einem Eintrag in einem Gopher-Men&uuml; ist nicht anzusehen, wo sich die damit
verbundenen Dateien oder Programme befinden. Anwender mit text- und
tastaturorientierten Rechnern k&ouml;nnen aus den Men&uuml;s, die das
Gophersystem am Bildschirm anzeigt, mit Buchstaben- oder Zifferntasten
Eintr&auml;ge ausw&auml;hlen. Bei grafischen Benutzeroberfl&auml;chen sind die
Men&uuml;s mit der Maus anklickbar. In dieser Hinsicht gleicht Gopher dem World
Wide Web, denn auch bei diesem Dienst m&uuml;ssen Sie keine Insider-Befehle
kennen, um im Informationsbestand zu navigieren.</p>

<p>Der Nachteil von Gopher gegen&uuml;ber dem WWW ist, dass es keine
Standards wie HTML gibt. Es gibt lediglich die Gopher-Men&uuml;s und die damit
verkn&uuml;pften Dateiaufrufe oder Befehle. Ein guter Gopher-Client kann zwar
diverse Dateiformate anzeigen, doch es gibt kein Mittel, um Bildschirmseiten zu
gestalten und dadurch eigenst&auml;ndige Pr&auml;sentationenen von Information
zu schaffen.</p>

<p>Moderne WWW-Browser wie Netscape sind auch gopher-f&auml;hig. Das bedeutet,
dass Sie mit einem solchen Browser problemlos Gopher-Adressen aufrufen
k&ouml;nnen. Die Gopher-Men&uuml;s erscheinen im Browser wie Listen mit
Verweisen in HTML.</p>

<h5 align=right>gehe <a href="#top">zur&uuml;ck</a></h5>
<h2 class="Sh2"><a class="an" name="a5">Chat (IRC)</a></h2>

<p>Wer sich einsam f&uuml;hlt oder einfach &quot;in&quot; sein will, geht im
Internet <b>chatten</b> (ratschen, quatschen). Am Bildschirm erscheint dann ein
zweigeteiltes Fenster. In den einen Teil werden wie von Geisterhand allerlei
ganze und halbe S&auml;tze, Kommentare und solche Dinge wie Emoticons
hineingeschrieben. Das sind Beitr&auml;ge von Teilnehmern, die gerade an der
gleichen Stelle online sind. Im anderen Fenster k&ouml;nnen Sie selbst etwas
eintippen. Auf diese Weise k&ouml;nnen Sie an der Unterhaltung teilnehmen.
Mittlerweile gibt es auch grafische Oberfl&auml;chen, bei denen sich jeder
Chat-Teilnehmer eine Figur aussucht, die dann als Teilnehmer in einer Szenerie
erscheint.</p>

<p>Kaum jemand erscheint dort mit seinem wahren Namen, und nicht wenige geben
sich als etwas ganz anderes aus, als sie wirklich sind. M&auml;nner spielen
Frau, um herauszufinden, wie es ist, als Frau von einem Mann angemacht zu
werden. Erwachsene spielen Jugendliche, um sich mal wieder richtig pubert&auml;r
benehmen zu d&uuml;rfen. Hin und wieder kommen interessante Gespr&auml;che
zustande, aber oft haben die Chat-Beitr&auml;ge auch das Niveau von
Kindergestammel.</p>

<p>IRC ist einer der Internet-Dienste, die teuer werden k&ouml;nnen. Denn
w&auml;hrend der ganzen Teilnahmedauer mu&szlig; man online sein, und viele
merken beim Quatschen nicht, wie die Zeit vergeht (das ist nicht anders als im
&quot;real life&quot;). Es gibt nur wenige, die eine ganze Nacht lang im WWW
surfen, aber viele, die eine ganze Nacht lang chatten. Viele der hochgradig
Internet-S&uuml;chtigen treiben sich vor allem in den Chat-Bereichen herum.</p>

<h5 align=right>gehe <a href="#top">zur&uuml;ck</a></h5>
<hr noshade size=1>
<h2 class="Sh2"><a class="an" name="a6">Newsgroups (News)</a></h2>

<p>Eine Newsgroup ist einem schwarzes Brett vergleichbar, wo Sie Nachrichten
posten k&ouml;nnen, die alle Besucher lesen k&ouml;nnen. Jede Newsgroup
behandelt einen Themenbereich. Mittlerweile sind mehr als 20.000 Newsgroups im
Internet verf&uuml;gbar. Es gibt praktisch nichts, zu dem es nicht eine
Newsgroup gibt. Egal ob Sie sich f&uuml;r die Konfiguration Ihres PCs
interessieren, f&uuml;r Origami oder f&uuml;r vermi&szlig;te Kinder - f&uuml;r
alles findet sich eine oder mehrere Newsgroups. T&auml;glich werden zigtausend
Nachrichten in Newsgroups gepostet. Es werden Fragen gestellt und Antworten
gegeben, es wird debattiert und geflachst. Die Newsgroups gelten allgemein als
der verr&uuml;ckteste Teil des Internet. Manchen Leuten sind sie aber auch ein
Dorn im Auge, denn es gibt auch etliche Newsgroups mit pornographischen und
extremistischen Inhalten.</p>

<p>Das System der Newsgroups ist auf verschiedene Netze verteilt. Das
gr&ouml;&szlig;te und bekannteste ist das <b>Usenet</b>. Hier finden Sie
Newsgroups mit Adressen wie <b>alt.music.pinkfloyd</b> oder
<b>de.soc.weltanschauung</b>. Wichtige Abk&uuml;rzungen in solchen
Newsgroup-Adressen sind:</p>

<ul>
<li><b>alt</b> = alternativ, bunt, verr&uuml;ckt, abgefahren</li>
<li><b>biz</b> = Kommerzielles, jedoch keine Werbung</li>
<li><b>comp</b> = Computer</li>
<li><b>de</b> = deutschsprachig</li>
<li><b>misc</b> = Sonstiges</li>
<li><b>news</b> = Newsgroups zum Thema Newsgroups</li>
<li><b>rec</b> = Freizeit, Hobby und Kunst</li>
<li><b>sci</b> = Wissenschaften</li>
<li><b>soc</b> = Soziales, Kultur, Politik</li>
<li><b>talk</b> = Klatsch und Tratsch</li>
</ul>

<p>Um Newsgroups lesen und daran teilnehmen zu k&ouml;nnen, brauchen Sie ein
<b>Newsreader</b>-Programm. Moderne WWW-Browser wie Netscape (ab V3.0) oder der
MS Internet Explorer (ab V4.0) haben einen eingebauten News-Client, so dass
Sie kein separates Programm mehr ben&ouml;tigen. Um Newsgroups empfangen zu
k&ouml;nnen, m&uuml;ssen Sie in den Einstellungen des verwendeten Programms
einen <b>News-Server</b> angeben.</p>

<p>Es empfiehlt sich, zun&auml;chst einmal alle verf&uuml;gbaren Newsgroups
einzulesen. Das kann eine Weile dauern, aber anschlie&szlig;end haben Sie eine
sortierte Liste aller Gruppen und k&ouml;nnen sich einen &Uuml;berblick
verschaffen. Newsgroups, die Sie interessieren, k&ouml;nnen Sie
<b>abonnieren</b>.</p>

<p>Nachrichten in Newsgroups sind hierarchisch organisiert. Irgendjemand postet
eine Nachricht mit einem neuen <b>Subject</b> (Thema). Ein anderer antwortet auf
die Nachricht und bezieht sich dadurch auf das gleiche Thema. Ein dritter
antwortet ebenfalls, und ein vierter antwortet dem Dritten. Auf diese Weise
entsteht eine Baumstruktur von Nachrichten zu einem einmal begonnenen Thema.
Diese Baumstruktur wird auch als <b>Thread</b> bezeichnet. Sie k&ouml;nnen
selbst einen neuen Thread beginnen oder auf eine Nachricht antworten und sich
dadurch den betreffenden Thread einschalten.</p>

<h5 align=right>gehe <a href="#top">zur&uuml;ck</a></h5>
<hr noshade size=1>
<h2 class="Sh2"><a class="an" name="a7">World Wide Web (WWW)</a></h2>

<p>Das World Wide Web (WWW) ist der j&uuml;ngste Dienst innerhalb des Internet.
Das Web zeichnet sich dadurch aus, dass es auch unge&uuml;bteren Anwendern
erlaubt, sich im Informationsangebot zu bewegen. Wer etwa mit einem FTP-Programm
einen FTP-Server aufruft, mu&szlig; sich in komplexen, unbekannten
Verzeichnisstrukturen zurechtfinden und sich an Dateinamen orientieren.
Interessante Dateien kann er auf seinen Rechner downloaden, um sie sp&auml;ter
zu &ouml;ffnen. Im WWW dagegen erscheinen Informationen gleich beim Aufruf am
Bildschirm. Wenn Sie mit einem WWW-Browser im Web unterwegs sind, brauchen Sie
sich nicht um Dateinamen oder um komplizierte Eingabebefehle zu k&uuml;mmern.
Das bequeme Navigieren mit Hilfe einfacher Mausklicks kann ein Hochgef&uuml;hl
erzeugen, weshalb sich auch die Redewendung vom &quot;Surfen im Netz&quot;
eingeb&uuml;rgert hat.</p>

<hr noshade size=1>
<b>gehe zur <a href="dfue_internet.html#a1">Gesamt&uuml;bersicht</a><br>
oder zum <a href="dfue_internet4.html">n&auml;chsten Kapitel</a><br>
oder zum <a href="dfue_internet2.html"> vorigen Kapitel</a></b>
<hr noshade size=1><br>

</body>
</html>
