<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Einf&uuml;hrung</title>
</head>
<body background="wol1.jpg" bgcolor="#FFFFF0" text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<a name="top"></a><br>

<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Wichtige Standards im Internet</h2></td>
</tr>
<tr>
<td bgcolor=#FFFFF0 valign=top nowrap>

<p>
&nbsp;<a href="#a1"><b>TCP/IP-Protokoll</b></a> <br>
&nbsp;<a href="#a2"><b>IP-Adressierung</b></a><br>
&nbsp;<a href="#a3"><b>Client-Server-Technologie</b></a><br>
&nbsp;<a href="#a4"><b>DNS - Domain Name Service</b></a><br>
&nbsp;<a href="#a5"><b>Routing und Gateways</b></a><br>
&nbsp;<a href="#a6"><b>Selbstorganisation im Internet</b></a>
</p>

</td>
</tr>
</table>
<hr noshade size=1>
<h2 class="Sh2"><a class="an" name="a1">TCP/IP-Protokoll</a></h2>

<p>TCP/IP ist der kleinste gemeinsame Nenner des gesamten Datenverkehrs im
Internet. Erst durch dieses Protokoll wurde historisch gesehen aus einem
begrenzten Netz ein Netz der Netze. Egal, ob Sie WWW-Seiten aufrufen, E-Mails
versenden, mit FTP Dateien downloaden oder mit Telnet auf einem entfernten
Rechner arbeiten: stets werden die Daten auf gleiche Weise adressiert und
transportiert. TCP bedeutet <b>Transmission Control Protocol</b> (Protokoll
f&uuml;r &Uuml;bertragungskontrolle), IP bedeutet <b>Internet Protocol</b>.</p>

<p>Wenn Sie eine E-Mail verschicken oder eine HTML-Datei im WWW aufrufen, werden
die Daten bei der &Uuml;bertragung im Netz in kleine Pakete zerst&uuml;ckelt.
Jedes Paket enth&auml;lt eine Angabe dazu, an welche Adresse es geschickt werden
soll, und das wievielte Paket innerhalb der Sendung es ist.</p>

<p>Die Adressierung besorgt das IP. Dazu gibt es ein Adressierungsschema, die
sogenannten <b>IP-Adressen</b>.</p>

<p>dass die Datenpakete auch wirklich beim Empf&auml;nger ankommen, und
zwar in der richtigen Reihenfolge, daf&uuml;r sorgt das TCP. Das TCP verwendet
Sequenznummern f&uuml;r die einzelnen Pakete einer Sendung. Erst wenn alle
Pakete einer Sendung vollst&auml;ndig beim Empf&auml;nger angekommen sind, gilt
die &Uuml;bertragung der Daten als abgeschlossen.</p>

<p>Jeder Rechner, der am Internet teilnimmt, ist mit einer IP-Adresse im Netz
angemeldet. Rechner, die ans Internet angeschlossen sind, werden als
<b>Hosts</b> oder <b>Hostrechner</b> bezeichnet. Wenn Sie also mit Ihrem PC im
WWW surfen oder neue E-Mails abholen, sind Sie mit einer IP-Adresse im Internet
angemeldet. Ihr Zugangs-Provider, &uuml;ber dessen Hostrechner Sie sich
einw&auml;hlen, kann feste IP-Adressen f&uuml;r Sie einrichten. Gro&szlig;e
Zugangs-Provider, etwa Online-Dienste wie CompuServe oder AOL, vergeben auch
personenunabh&auml;ngig dynamische IP-Adressen f&uuml;r jede Internet-Einwahl.
Damit ein Rechner am Internet teilnehmen kann, mu&szlig; er &uuml;ber eine
Software verf&uuml;gen, die das TCP/IP-Protokoll unterst&uuml;tzt. Unter MS
Windows ist das beispielsweise die Datei <b>winsock.dll</b> im
Windows-Verzeichnis.</p>

<h5 align=right>gehe <a href="#top">zur&uuml;ck</a></h5>
<hr noshade size=1>
<h2 class="Sh2"><a class="an" name="a2">IP-Adressierung</a></h2>

<p>Eine typische IP-Adresse sieht in Dezimalschreibweise so aus: 149.174.211.5 -
vier Zahlen also, getrennt durch Punkte. Die Punkte haben die Aufgabe,
&uuml;ber- und untergeordnete Netze anzusprechen. So wie zu einer Telefonnummer
im weltweiten Telefonnetz eine Landeskennzahl, eine Ortsnetzkennzahl, eine
Teilnehmerrufnummer und manchmal auch noch eine Durchwahlnummer geh&ouml;rt,
gibt es auch im Internet eine Vorwahl - die <b>Netzwerknummer</b>, und eine
Durchwahl - die <b>Hostnummer</b>.</p>

<p>Der erste Teil einer IP-Adresse ist die Netzwerknummer, der zweite Teil die
Hostnummer. Wo die Grenze zwischen Netzwerknummer und Hostnummer liegt, bestimmt
ein Klassifizierungsschema f&uuml;r Netztypen. Die folgende Tabelle verdeutlicht
dieses Schema. In den Spalten f&uuml;r die IP-Adressierung und einem typischen
Beispiel ist die Netzwerknummer (der Vorwahlteil) fett dargestellt. Der Rest der
IP-Adresse ist die Hostnummer eines Rechners innerhalb dieses Netzes.</p>

<table cellpadding=3 cellspacing=1>
<tr>
<td bgcolor=#EEEEEE class="doc">
Netztyp
</td>
<td bgcolor=#EEEEEE class="doc">
IP-Adressierung
</td>
<td bgcolor=#EEEEEE class="doc">
Typische IP-Adresse
</td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc">
Klasse-A-Netz
</td>
<td bgcolor=#FFFFE0 class="code">
<b>xxx</b>.xxx.xxx.xxx
</td>
<td bgcolor=#FFFFE0 class="code">
<b>103</b>.234.123.87
</td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc">
Klasse-B-Netz
</td>
<td bgcolor=#FFFFE0 class="code">
<b>xxx.xxx</b>.xxx.xxx
</td>
<td bgcolor=#FFFFE0 class="code">
<b>151.170</b>.102.15
</td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc">
Klasse-C-Netz
</td>
<td bgcolor=#FFFFE0 class="code">
<b>xxx.xxx.xxx</b>.xxx
</td>
<td bgcolor=#FFFFE0 class="code">
<b>196.23.155</b>.113
</td>
</tr>
</table>

<p>Die oberste Hierarchiestufe bilden die sogenannten <b>Klasse-A-Netze</b>. Nur
die erste Zahl einer IP-Adresse ist darin die Netzwerknummer, alle anderen
Zahlen sind Hostnummern innerhalb des Netzwerks. Bei Netzwerknummern solcher
Netze sind Zahlen zwischen 1 und 126 m&ouml;glich, d.h. es kann weltweit nur 126
Klasse-A-Netze geben. Eine IP-Adresse, die zu einem Klasse-A-Netz geh&ouml;rt,
ist also daran erkennbar, dass die erste Zahl zwischen 1 und 126 liegt. Das
amerikanische Milit&auml;rnetz ist beispielsweise so ein Klasse-A-Netz.
Innerhalb eines Klasse-A-Netzes kann der entsprechende Netzbetreiber die zweite,
dritte und vierte Zahl der einzelnen IP-Adressen seiner Netzteilnehmer frei
vergeben. Da alle drei Zahlen Werte von 0 bis 255 haben k&ouml;nnen, kann ein
Klasse-A-Netzbetreiber also bis zu 16,7 Millionen IP-Adressen an Host-Rechner
innerhalb seines Netzes vergeben.</p>

<p>Die zweith&ouml;chste Hierarchiestufe sind die <b>Klasse-B-Netze</b>. Die
Netzwerknummer solcher Netze erstreckt sich &uuml;ber die beiden ersten Zahlen
der IP-Adresse. Bei der ersten Zahl k&ouml;nnen Klasse-B-Netze Werte zwischen
128 und 192 haben. Eine IP-Adresse, die zu einem Klasse-B-Netz geh&ouml;rt, ist
also daran erkennbar, dass die erste Zahl zwischen 128 und 192 liegt. Bei
der zweiten sind Zahl Werte zwischen 0 und 255 erlaubt. Dadurch sind etwa 16.000
solcher Netze m&ouml;glich. Da die Zahlen drei und vier in solchen Netzen
ebenfalls Werte zwischen 0 und 255 haben d&uuml;rfen, k&ouml;nnen an jedem
Klasse-B-Netz bis zu ca. 65.000 Hostrechner angeschlossen werden. Klasse-B-Netze
werden vor allem an gro&szlig;e Firmen, Universit&auml;ten und Online-Dienste
vergeben.</p>

<p>Die unterste Hierarchie stellen die <b>Klasse-C-Netze</b> dar. Die erste Zahl
einer IP-Adresse eines Klasse-C-Netzes liegt zwischen 192 und 223. Die Zahlen
zwei und drei geh&ouml;ren ebenfalls noch zur Netzwerknummer. &Uuml;ber zwei
Millionen solcher Netze sind dadurch adressierbar. Vor allem an kleine und
mittlere Unternehmen mit direkter Internet-Verbindung, auch an kleinere
Internet-Provider, werden solche Adressen vergeben. Da nur noch eine Zahl mit
Werten zwischen 0 und 255 &uuml;brig bleibt, k&ouml;nnen in einem C-Netz maximal
255 Host-Rechner angeschlossen werden.</p>

<p>Ob dieses Adressierungs-Schema den Anforderungen der Zukunft noch gerecht
wird, bezweifeln manche. Es gibt bereits Ideen zu einer Neustrukturierung der
Adressierung von Netzen und Hostrechnern.</p>

<h5 align=right>gehe <a href="#top">zur&uuml;ck</a></h5>
<hr noshade size=1>
<h2 class="Sh2"><a class="an" name="a3">Client-Server-Technologie</a></h2>

<img src="dfue_inet.jpg" width=389 height=381 alt="" border="0" align=left>
<p>F&uuml;r die einzelnen Internet-Dienste wie World Wide Web,
Gopher, E-Mail, FTP usw. mu&szlig; auf einem Hostrechner, der anderen Rechnern
diese Dienste anbieten will, eine entsprechende <b>Server</b>-Software laufen.
Ein Hostrechner kann einen Internet-Dienst nur anbieten, wenn eine entsprechende
Server-Software auf dem Rechner aktiv ist, und wenn der Rechner
&quot;online&quot; ist.</p>

<p>Server sind Programme, die permanent darauf warten, dass eine Anfrage
eintrifft, die ihren Dienst betreffen. So wartet etwa ein WWW-Server darauf,
dass Anfragen eintreffen, die WWW-Seiten auf dem Server-Rechner abrufen
wollen.</p>

<p><b>Clients</b> sind dagegen Software-Programme, die typischerweise Daten von
Servern anfordern. Ihr WWW-Browser ist beispielsweise ein Client. Wenn Sie etwa
auf einen Verweis klicken, der zu einer HTTP-Adresse f&uuml;hrt, startet der
Browser, also der WWW-Client, eine Anfrage an den entsprechenden Server auf dem
entfernten Hostrechner. Der Server wertet die Anfrage aus und sendet die
gew&uuml;nschten Daten. Um die Kommunikation zwischen Clients und Servern zu
regeln, gibt es entsprechende Protokolle. Client-Server-Kommunikation im WWW
etwa regelt das HTTP-Protokoll. Ein solches Protokoll l&auml;uft oberhalb des
TCP/IP-Protokolls ab.</p>

<p>dass ein Client Daten anfordert und ein Server die Daten sendet, ist der
Normalfall. Es gibt jedoch auch &quot;Ausnahmen&quot;. So kann ein Client nicht
nur Daten anfordern, sondern auch Daten an einen Server schicken: zum Beispiel,
wenn Sie per FTP eine Datei auf den Server-Rechner hochladen, wenn Sie eine
E-Mail versenden oder im WWW ein Formular ausf&uuml;llen und abschicken. Bei
diesen F&auml;llen redet man auch von <b>Client-Push</b> (&quot;Client
dr&auml;ngt dem Server Daten auf&quot;).</p>

<p>Ein anderer Ausnahmefall ist es, wenn der Server zuerst aktiv wird und dem
Client etwas ohne dessen Anforderung zuschickt. Das nennt man <b>Server-Push</b>
(&quot;Server dr&auml;ngt dem Client Daten auf&quot;). Neue Technologien wollen
diesen Ausnahmefall zu einer Regel erheben: die sogenannten
<b>Push-Technologien</b>. Diese Technologien sollen erm&ouml;glichen, dass
ein Client regelm&auml;&szlig;ig Daten empfangen kann, ohne diese eigens
anzufordern. Dadurch sind Broadcasting-Dienste wie aktuelle Nachrichten usw.
realisierbar. Netscape und Microsoft Internet Explorer (beide ab Version 4.0)
haben entsprechende Schnittstellen, um solche Dienste in Anspruch zu nehmen.</p>
<br clear=all>

<h5 align=right>gehe <a href="#top">zur&uuml;ck</a></h5>
<hr noshade size=1>
<h2 class="Sh2"><a class="an" name="a4">DNS - Domain Name Service</a></h2>

<p>Computer k&ouml;nnen mit Zahlen besser umgehen, Menschen in der Regel besser
mit Namen. Deshalb hat man ein System ersonnen, das die numerischen IP-Adressen
f&uuml;r die Endanwender in anschauliche Namensadressen &uuml;bersetzt.</p>

<p>Dazu hat man ein System geschaffen, das &auml;hnlich wie bei den IP-Adressen
hierarchisch aufgebaut ist. Eine Namensadresse in diesem System geh&ouml;rt zu
einer <b>Top-Level-Domain</b> und innerhalb dieser zu einer
<b>Sub-Level-Domain</b>. Jede Sub-Level-Domain kann nochmals untergeordnete
Domains enthalten, mu&szlig; es aber nicht. Die einzelnen Teile solcher
Namensadressen sind wie bei IP-Adressen durch Punkte voneinander getrennt. Eine
solche Namensadresse ist beispielsweise <b>teamone.de</b>.</p>

<p>Top-Level-Domains stehen in einem Domain-Namen an letzter Stelle. Es handelt
sich um einigerma&szlig;en sprechende Abk&uuml;rzungen. Die Abk&uuml;rzungen,
die solche Top-Level-Domains bezeichnen, sind entweder Landeskennungen oder
Typenkennungen. Beispiele sind:<br>
<b>de</b> = Deutschland<br>
<b>at</b> = &Ouml;sterreich<br>
<b>ch</b> = Schweiz<br>
<b>it</b> = Italien<br>
<b>my</b> = Malaysia<br>
<b>com</b> = Kommerziell orientierter Namensinhaber<br>
<b>org</b> = Organisation<br>
<b>net</b> = Allgemeines Netz<br>
<b>edu</b> = amerikanische Hochschulen<br>
<b>gov</b> = amerikanische Beh&ouml;rden<br>
<b>mil</b> = amerikanische Milit&auml;reinrichtungen</p>

<p>Jede dieser Top-Level-Domains stellt einen Verwaltungsbereich dar, f&uuml;r
die es auch eine &quot;Verwaltungsbeh&ouml;rde&quot; gibt, die f&uuml;r die
Namensvergabe von Sub-Level-Domains innerhalb ihres Verwaltungsbereichs
zust&auml;ndig ist. Wenn Sie beispielsweise einen Domain-Namen wie
<b>MeineFirma.de</b> beantragen wollen, mu&szlig; der Antrag an das DE-NIC
(Deutsches Network Information Center) gestellt werden. Kommerzielle Provider
erledigen das f&uuml;r Sie, wenn Sie dort einen entsprechenden Service in
Anspruch nehmen. Ihren Wunschnamen erhalten Sie aber nur, wenn die Namensadresse
noch nicht anderweitig vergeben wurde. Schlauf&uuml;chse sind daher auf die Idee
gekommen, Namen gro&szlig;er Firmen, die noch keine eigene Domain beantragt
haben, f&uuml;r sich zu reservieren, um sie dann, wenn auch die gro&szlig;e
Firma die Zeichen der Zeit erkennt, teuer an diese weiterzuverkaufen.
Mittlerweile sind solchen Machenschaften Riegel vorgeschoben. Dennoch kommt es
immer wieder zu Rechtsstreitereien wegen attraktiven Domain-Namen. Wenn etwa
zwei zuf&auml;llig gleichnamige Firmen, die sonst nichts miteinander zu tun
haben, den gleichen Domain-Namen reservieren lassen wollen, kann nur eine der
Firmen den Zuschlag erhalten. Um Streitigkeiten dieser Art zu reduzieren, gibt
es mittlerweile auch neue Top-Level-Endungen.</p>

<p>Inhaber von zweiteiligen Domain-Namen k&ouml;nnen nochmals Sub-Level-Domains
vergeben. So gibt es beispielsweise eine Domain namens <b>seite.net</b>. Die
Betreiber dieser Domain haben nochmals Sub-Domains vergeben, wodurch
Domain-Adressen wie <b>java.seite.net</b> oder <b>javascript.seite.net</b>
entstanden.</p>

<h5 align=right>gehe <a href="#top">zur&uuml;ck</a></h5>
<hr noshade size=1>
<h2 class="Sh2"><a class="an" name="a5">Routing und Gateways</a></h2>

<p>Im Internet als dem Netz der Netze ist es zun&auml;chst nur innerhalb des
eigenen Sub-Netzes m&ouml;glich, Daten direkt von einer IP-Adresse zu einer
anderen zu schicken. In allen anderen F&auml;llen, wenn die Daten an eine andere
Netzwerknummer geschickt werden sollen, treten Rechner auf den Plan, die den
Verkehr zwischen den Netzen regeln. Solche Rechner werden als <b>Gateways</b>
bezeichnet. Diese Rechner leiten Daten von Hostrechnern aus dem eigenen Sub-Netz
an Gateways in anderen Sub-Netzen weiter und ankommende Daten von Gateways
anderer Sub-Netze an die darin adressierten Host-Rechner im eigenen Sub-Netz.
Ohne Gateways g&auml;be es gar kein Internet.</p>

<p>Das Weiterleiten der Daten zwischen Sub-Netzen wird als <b>Routing</b>
bezeichnet. Die Beschreibung der m&ouml;glichen Routen vom eigenen Netzwerk zu
anderen Netzwerken sind in <b>Routing-Tabellen</b> auf den Gateway-Rechnern
festgehalten.</p>

<p>Zu den Aufgaben eines Gateways geh&ouml;rt auch, eine Alternativ-Route zu
finden, wenn die &uuml;bliche Route nicht funktioniert, etwa, weil bei der
entsprechenden Leitung eine St&ouml;rung oder ein Datenstau aufgetreten ist.
Gateways senden sich st&auml;ndig Testpakete zu, um das Funktionieren der
Verbindung zu testen und f&uuml;r Datentransfers &quot;verkehrsarme&quot; Wege
zu finden.</p>

<p>Wenn also im Internet ein Datentransfer stattfindet, ist keinesfalls von
vorneherein klar, welchen Weg die Daten nehmen. Sogar einzelne Pakete einer
einzigen Sendung k&ouml;nnen v&ouml;llig unterschiedliche Wege nehmen. Wenn Sie
beispielsweise von Deutschland aus eine WWW-Seite aufrufen, die auf einem
Rechner in den USA liegt, kann es sein, dass die H&auml;lfte der Seite
&uuml;ber den Atlantik kommt und die andere &uuml;ber den Pazifik, bevor Ihr
WWW-Browser sie anzeigen kann. Weder Sie noch Ihr Browser bekommen davon etwas
mit.</p>

<h5 align=right>gehe <a href="#top">zur&uuml;ck</a></h5>
<hr noshade size=1>
<h2 class="Sh2"><a class="an" name="a6">Selbstorganisation im Internet</a></h2>

<p>In Anbetracht der Teilnehmerzahl im Internet ist der Verwaltungsaufwand im
Netz vergleichsweise klein. Die meisten Endanwender wissen nicht einmal,
dass es solche Verwaltungsstellen &uuml;berhaupt gibt.</p>

<p>Eine gesetzgeberische Institution, wie es sie etwa innerhalb des
Verfassungsbereichs eines Staates gibt, gibt es im Internet als weltweitem
Verbund nicht. Viele Bereiche im Internet beruhen faktisch auf
Selbstorganisation. Bei Diensten wie E-Mail gilt beispielsweise das stille
Abkommen, dass jeder beteiligte Gateway alle Mails weiterleitet, auch wenn
weder Sender noch Empf&auml;nger dem eigenen Sub-Netz angeh&ouml;ren. Die Kosten
tr&auml;gt zwar der Netzbetreiber, aber da alle ein Interesse am weltweiten
Funktionieren des Netzes haben, ist jeder bereit, die anfallenden Mehrkosten zu
tragen.</p>

<p>Die Funktionsf&auml;higkeit des Internet basiert also auf der Bereitschaft
der Beteiligten, keine Pfennigfuchserei zu betreiben! Gro&szlig;z&uuml;gigkeit
hat das Internet geschaffen, und Kleingeisterei ist der gr&ouml;&szlig;te Feind
der Internet-Idee.</p>

<p>Das Usenet, also der gr&ouml;&szlig;te Teil der Newsgroups, organisiert sich
sogar vollst&auml;ndig selbst, weshalb leidenschaftliche Anh&auml;nger dieses
System gerne als real existierendes Beispiel f&uuml;r Herrschaftsfreiheit
anf&uuml;hren. Die &quot;Verwaltung&quot; findet im Usenet in speziellen
Newsgroups statt (solchen, die mit <b>news.</b> beginnen). Dort k&ouml;nnen
beispielsweise Vorschl&auml;ge f&uuml;r neue Gruppen eingebracht werden, und in
Abstimmungen wird dar&uuml;ber entschieden, ob eine Gruppe eingerichtet oder
abgeschafft wird.</p>

<p>Offizielle Anlaufstellen gibt es f&uuml;r die Vergabe von Netzwerkadressen
und f&uuml;r Namensadressen (DNS). F&uuml;r die Vergabe von IP-Adressen
innerhalb eines Netzwerks ist der jeweilige Netzbetreiber verantwortlich. Dazu
kommen Organisationen, die sich um Standards innerhalb des Internets
k&uuml;mmern.</p>

<p>Die Kosten f&uuml;r die Daten&uuml;bertragungen im Internet tragen die
Betreiber der Sub-Netze. Diese Kosten pflanzen sich nach unten fort zu Providern
innerhalb der Sub-Netze bis hin zu Endanwendern, die &uuml;ber Provider Zugang
zum Internet haben oder Internet-Services wie eigene WWW-Seiten nutzen.</p>

<p>Die folgende Liste enth&auml;lt einige Verweise zu den wichtigsten
internationalen und nationalen Organisationen im Internet:</p>

<p><img src="dfue_deu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.denic.de/"><b>Deutsches Network Information Center (DE-NIC)</b></a><br>
Vergabestelle f&uuml;r Domain-Namen unterhalb der Top-Level-Domain <b>.de</b></p>

<p><img src="dfue_eng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.internic.net/"><b>International Network Information Center (InterNIC)</b></a><br>
Kollaboratives Projekt zwischen AT&amp;T, General Atomics und Network Solutions, Inc. AT&amp;T. Internationale Vergabestelle f&uuml;r Domain-Namen.</p>

<p><img src="dfue_eng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.gtld-mou.org/"><b>Generic Top Level Domain Memorandum of Understanding (gTLD-MoU)</b></a><br>
Organisation f&uuml;r die Schaffung von neuen Top-Level-Domains.</p>

<p><img src="dfue_eng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.isi.edu/iab/"><b>Internet Architecture Board (IAB)</b></a><br>
Organisation zur Dokumentation der Netzstruktur und der grunds&auml;tzlichen Abl&auml;ufe im Internet.</p>

<p><img src="dfue_eng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.isi.edu/iana/"><b>Internet Assigned Numbers Authority (IANA)</b></a><br>
Zentrale Koordinationsstelle f&uuml;r Internet-Protokolle</p>

<p><img src="dfue_eng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.ietf.org/"><b>Internet Engineering Task Force (IETF)</b></a><br>
Internationale Gemeinschaft von kommerziellen und nicht-kommerziellen Aktiven im Internet mit dem Ziel, technische Standards im Internet vorzuschlagen.</p>

<p><img src="dfue_eng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.isoc.org/"><b>Internet Society</b></a><br>
Internationale Organisation f&uuml;r die Kooperation und Koordination von Technologien und Anwendungen im Internet.</p>

<p><img src="dfue_eng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.w3.org/"><b>W3-Konsortium</b></a><br>
Organisation, die speziell die Weiterentwicklung technischer Standards des World Wide Web koordiniert, etwa HTML oder das HTTP-Protokoll.</p>

<p>Vor allem jene Organisationen, die sich um die technische Weiterentwicklung
im Internet k&uuml;mmern, werden zunehmend von gro&szlig;en Software-Firmen wie
Microsoft, Netscape oder Sun best&uuml;rmt, da diese Firmen ein Interesse daran
haben, ihren Software-Produkten und hauseigenen Standards bei
Server-Technologien, Programmiersprachen usw. zum Status weltweiter
Internet-Standards zu verhelfen. Ob und wie weit es gelingt, im Internet
angesichts des entstehenden Milliardenmarkts neue, firmenunabh&auml;ngige
Standards durchzusetzen, die so erfolgreich werden wie HTML oder HTTP, mu&szlig;
die Zukunft zeigen.</p>

<hr noshade size=1>
<b>gehe zur <a href="dfue_internet.html#a1">Gesamt&uuml;bersicht</a><br>
oder zum <a href="dfue_internet3.html">n&auml;chsten Kapitel</a><br>
oder zum <a href="dfue_internet1.html"> vorigen Kapitel</a></b>
<hr noshade size=1><br>

</body>
</html>
