<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Einf&uuml;hrung</title>
</head>
<body background="wol1.jpg" bgcolor="#FFFFF0" text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<a name="top"></a><br>

<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc"><h2>Entstehung des Internet</h2></td>
</tr>
<tr>
<td bgcolor=#FFFFF0 valign=top nowrap>

<p>
&nbsp;<a href="#a1"><b>Das ARPA-Net</b></a> <br>
&nbsp;<a href="#a2"><b>Wissenschaftliche Einrichtungen</b></a><br>
&nbsp;<a href="#a3"><b>Das Netz der Netze</b></a>
</p>

</td>
</tr>
</table>
<hr noshade size=1>
<h2 class="Sh2"><a class="an" name="a1">Das ARPA-Net</a></h2>

<p>Die Urspr&uuml;nge des heutigen Internet reichen in die 60er Jahre
zur&uuml;ck. Es war die Zeit des Kalten Krieges zwischen den beiden
Weltm&auml;chten USA und UdSSR. Neue Impulse in der Elektronischen
Datenverarbeitung (EDV) kamen in jener Zeit haupts&auml;chlich durch
milit&auml;rische Initiativen zustande.</p>

<p>Im Departement of Defense, dem amerikanischen Verteidigungsministerium, wurde
&uuml;berlegt, wie man wichtige milit&auml;rische Daten besser sch&uuml;tzen
k&ouml;nnte. Selbst bei einem atomaren Angriff des Gegners sollten die Daten
nicht zerst&ouml;rt werden k&ouml;nnen. Als L&ouml;sung kam nur ein
elektronisches Datennetz in Frage. Die gleichen Daten sollten dabei auf
mehreren, weit entfernten Rechnern abgelegt werden. Bei neuen oder
ge&auml;nderten Daten sollten sich alle angeschlossenen Rechner binnen
k&uuml;rzester Zeit den aktuellen Datenstand zusenden. Jeder Rechner sollte
dabei &uuml;ber mehrere Wege mit jedem anderen Rechner kommunizieren
k&ouml;nnen. So w&uuml;rde das Netz auch dann funktionieren, wenn ein einzelner
Rechner oder eine bestimmte Leitung durch einen Angriff zerst&ouml;rt
w&uuml;rde.</p>

<p>Die Advanced Research Projects Agency (ARPA), Teil der US-Milit&auml;rs,
realisierte das geplante Projekt. In den ersten Jahren wurde das Netz deshalb
<b>ARPA-Net</b> genannt. Ende 1969 waren die ersten vier Rechner an das ARPA-Net
angeschlossen. Drei Jahre sp&auml;ter waren es bereits 40 Rechner.</p>

<p>Die Geschichte des Internet beginnt also in der Zeit der ersten Mondlandung
und in jener Zeit, als die Hippies das Zeitalter des Wassermanns heraufziehen
sahen.</p>

<p>Informationen zum ARPA-Net im WWW:</p>

<p>
<img src="dfue_eng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.arpa.mil/"><b>Defense Advanced Research Projects Agency (DARPA)</b></a><br>
<img src="dfue_eng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.dei.isep.ipp.pt/docs/arpa.html"><b>History of ARPANET</b></a><br>
</p>
<h5 align=right>gehe <a href="#top">zur&uuml;ck</a></h5>
<hr noshade size=1>
<h2 class="Sh2"><a class="an" name="a2">Wissenschaftliche Einrichtungen</a></h2>

<p>Das Prinzip der vernetzten Rechner war aber nicht nur f&uuml;r
milit&auml;rische Zwecke interessant. Man erkannte schnell, dass auch der
akademische Betrieb vom ARPA-Net profitieren w&uuml;rde. F&uuml;r
Wissenschaftler war allerdings weniger das Synchronisieren von gleichen Daten
auf mehreren Rechnern interessant, sondern eher die M&ouml;glichkeit, Daten von
einem anderen Rechner abzurufen. Wegen der offenen Architektur des ARPA-Net
stand einer solchen Verwendung nichts im Wege. Wissenschaftler konnten von den
fr&uuml;hen 70er Jahren an Forschungsergebnisse anderer Institute &uuml;ber das
ARPA-Net abrufen oder anderen angeschlossenen Instituten eigene Daten zur
Verf&uuml;gung stellen.</p>

<p>Die Anzahl der angeschlossenen Rechner stieg an. Es handelte sich um sehr
unterschiedliche Rechnertypen mit nicht kompatiblen Betriebssystemen und
unterschiedlichem Netzzugang. Gro&szlig;rechner verschiedener Fabrikate,
Unix-Rechner und sp&auml;ter auch Personal Computer dr&auml;ngten ins Netz.
Einige hatten eine Standleitung, also eine st&auml;ndige Internetverbindung,
andere w&auml;hlten sich &uuml;ber Telefon und Modem ein. Um die
unterschiedlichen Voraussetzungen unter einen Hut zu bringen, entstand die
Notwendigkeit, ein neues Daten&uuml;bertragungsprotokoll f&uuml;r das Netz zu
entwickeln. Das Protokoll sollte nicht an bestimmte Computersysteme,
&Uuml;bertragungswege oder &Uuml;bertragungsgeschwindigkeiten gebunden sein. Aus
den Bem&uuml;hungen um ein solches Protokoll ging schlie&szlig;lich das
TCP/IP-Protokoll hervor. Daten&uuml;bertragungen im ARPA-Net liefen nach
Einf&uuml;hrung von TCP/IP nach einem einheitlichen und standardisierten Schema
ab.</p>

<p>Zu den wissenschaftlichen Einrichtungen geh&ouml;rten nat&uuml;rlich auch
Studenten. Die entdeckten das Netz auf ihre Weise. Eine Art &quot;black
board&quot; war ihr Wunsch, ein Nachrichtenbrett wie in Universit&auml;ten
&uuml;blich, f&uuml;r Mitfahrgelegenheiten, Jobs, Wohnm&ouml;glichkeiten,
Reisepartner oder die M&ouml;glichkeit, einfach nur zu diskutieren und zu
labern. So entstand das Usenet, die Hauptader der heutigen Newsgroups. Viele
eingefleischte &quot;Internetter&quot; halten die Newsgroups auch heute noch
f&uuml;r den spannendsten und lebendigsten Teil des Internet.</p>

<h5 align=right>gehe <a href="#top">zur&uuml;ck</a></h5>
<hr noshade size=1>
<h2 class="Sh2"><a class="an" name="a3">Das Netz der Netze</a></h2>

<p>Der Anschlu&szlig; der akademischen Welt ans Netz erforderte eine Trennung
zwischen milit&auml;rischem und zivilen Teil, da die Milit&auml;rs ihre eigenen
Interessen wahren wollten. So kam es, dass Anfang der 80er Jahre ein neues
milit&auml;risches Datennetz, das Milnet, vom ARPA-Net abgekoppelt wurde. Das
ARPA-Net selbst wurde dem wissenschaftlichen Betrieb &uuml;berlassen.</p>

<p>Im zivilen Teil des Netzes nahm die Anzahl der angeschlossenen Rechner im
Laufe der 80er Jahre sprunghaft zu. Eine wichtige Rolle spielte dabei die
amerikanische <b>National Science Foundation (NSF)</b>. Diese Organisation
schaffte ein Leitungs-Verbundsystem, das alle bedeutenden wissenschaftlichen
Rechenzentren des Landes miteinander verband. Einzelne Universit&auml;tsrechner
oder kleinere Rechnernetze konnten sich mit einem Rechenzentrum verbinden und
dar&uuml;ber in andere Netze gelangen. So entstand buchst&auml;blich ein Netz
der Netze. Alsbald b&uuml;rgerte sich denn auch der Name &quot;Internet&quot;
daf&uuml;r ein. Die Bezeichnung &quot;ARPA-Net&quot; wurde Ende der 80er Jahre
verworfen. Das Leitungs-Verbundsystem, &uuml;ber das die kleineren Einzelnetze
zu einem Gesamtnetz wurden, erhielt die treffende Bezeichnung <b>Backbone</b>
(R&uuml;ckgrat).</p>

<p>In Europa gab es zeitgleich &auml;hnliche Entwicklungen. Auf dem alten
Kontinent setzte man jedoch zun&auml;chst auf <b>ISO-Normen</b>. Von dem
amerikanischen TCP/IP-Modell, das nicht ISO-normiert war, wollte man deshalb
nichts wissen. 1986 wurde die Organisation <b>RARE (R&eacute;seaux
Associ&eacute;s pour la Recherche Europ&eacute;enne)</b> gegr&uuml;ndet. Diese
Organisation sollte alle Initiativen zur system&uuml;bergreifenden
Rechnervernetzung europaweit koordinieren. RARE rief dazu ein Projekt namens
<b>COSINE (Cooperation for an Open Systems Interconnection Networking in
Europe)</b> ins Leben.</p>

<p>Der Siegeszug des TCP/IP-Protokolls war jedoch nicht mehr aufzuhalten. Unter
dem Druck des Erfolgs in Amerika entstand schlie&szlig;lich ein
europ&auml;isches Datennetz, das multiprotokollf&auml;hig war und unter anderem
TCP/IP unterst&uuml;tzte. Dieses Netz lief zun&auml;chst unter der Bezeichnung
<b>EuropaNET</b>. Verschiedene nationale wissenschaftliche Netzwerke, etwa das
Deutsche Forschungsnetz (DFN), wurden daran angeschlossen.</p>

<p>Mittlerweile sorgt eine transatlantische Leitung f&uuml;r die Anbindung
Europas an den Backbone in den USA. Die Koordination des Internet-Verkehrs
innerhalb Europas obliegt der Organisation <b>RIPE (R&eacute;seaux IP
Europ&eacute;ens)</b>. Auch in Europa gibt es seit 1992 ein
Leitungs-Verbundsystem: dieses System nennt sich <b>Ebone (Europ&auml;ischer
Internet-Backbone)</b>. Auf anderen Kontinenten gab und gibt es vergleichbare
Entwicklungen.</p>

<p>Was wir also heute unter &quot;Internet&quot; verstehen, ist nicht ein
einziges homogenes Netz, sondern ein Verbund aus vielen kleinen, territorial
oder organisatorisch begrenzten Netzen. Diese Netze besitzen eine Anbindung an
die Backbones und damit an das Gesamtnetz. Auch kommerzielle Internet-Provider
h&auml;ngen an entsprechenden Netzen.</p>

<p>Ein paar Adressen im WWW zu diesen Themen:</p>

<p><img src="dfue_eng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.nsf.gov/"><b>National Science Foundation (NSF)</b></a><br>
<img src="dfue_deu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.dfn.de/"><b>Deutsches Forschungsnetz (DFN)</b></a><br>
<img src="dfue_eng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.ebone.net/"><b>Ebone-Net</b></a><br>
<img src="dfue_eng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.ripe.net/"><b>R&eacute;seaux IP Europ&eacute;ens (RIPE)</b></a></p>
<hr noshade size=1>
<b>gehe zur <a href="dfue_internet.html#a1">Gesamt&uuml;bersicht</a><br>
oder zum <a href="dfue_internet2.html">n&auml;chsten Kapitel</a></b>
<hr noshade size=1><br>

</body>
</html>
