<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Einf&uuml;hrung</title>
</head>
<body background="wol1.jpg" bgcolor="#FFFFF0" text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<a name="top"></a><br>

<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Entstehung des World Wide Web</h2></td>
</tr>
<tr>
<td bgcolor=#FFFFF0 valign=top nowrap>

<p>
&nbsp;<a href="#a1"><b>Die Anf&auml;nge</b></a> <br>
&nbsp;<a href="#a2"><b>Der Boom</b></a>
</p>

</td>
</tr>
</table>
<hr noshade size=1>

<h2 class="Sh2"><a class="an" name="a1">Die Anf&auml;nge</a></h2>

<p><img src="dfue_tim.jpg" width=82 height=123 border=0 alt="Tim Berners-Lee"
align=left hspace=10>Die Geschichte des World Wide Web ist - trotz ihres
unfa&szlig;baren Erfolges - noch ziemlich jung. Sie begann um 1990 in Genf.
<img src="dfue_eng.gif" width=16 height=10 border=0>&nbsp;<a target="_top"
href="http://www.w3.org/pub/WWW/People/Berners-Lee/"><b>Tim Berners-Lee</b></a>,
britischer Informatiker am Genfer Hochenergieforschungszentrum CERN, startete
zusammen mit einigen Kollegen eine Initiative, um das Internet f&uuml;r einen
neuartigen Informationsaustausch zwischen Wissenschaftlern zu nutzen. Es ging
darum, wissenschaftliche Dokumente online sichtbar zu machen, wobei einfache
Textformatierung und das Einbinden von Grafik m&ouml;glich sein sollte. Ganz
entscheidend war aber auch die Idee, Hypertextfunktionalit&auml;t einzubauen, so
dass Dokumente Verweise auf beliebige andere Dokumente enthalten
k&ouml;nnen, auch, wenn diese auf ganz anderen Internet-Servern liegen.</p>

<p>Die beiden S&auml;ulen des Projekts sollten das neue Dateiformat <b>HTML</b>
(Hypertext Markup Language) und das neue Internet-Protokoll <b>HTTP</b>
(Hypertext Transfer Protocol) bilden. Neue Endanwender-Software sollte die
Dateien online anzeigen und Verweise ausf&uuml;hren k&ouml;nnen. Wegen des
Hypertext-Charakters wurde das ganze Projekt World Wide Web (weltweites Netz)
getauft.</p>

<p>Gleichzeitig wurde bereits begonnen, WWW-Server einzurichten, die das neue
HTTP-Protokoll unterst&uuml;tzten. Erste Client-Programme f&uuml;r Endanwender
wurden entwickelt. Software-Entwickler wurden von der Idee des WWW angesteckt
und entwickelten fieberhaft die ersten WWW-Browser.</p>

<h5 align=right>gehe <a href="#top">zur&uuml;ck</a></h5>
<hr noshade size=1>
<h2 class="Sh2"><a class="an" name="a2">Der Boom</a></h2>

<p><img src="dfue_marc.jpg" width=60 height=100 border=0 alt="Marc Andreessen"
align=left hspace=20>Besonders aktiv war ein junger Mann namens <img
src="dfue_eng.gif" width=16 height=10 border=0>&nbsp;<a target="_top"
href="http://home.netscape.com/people/marca/"><b>Marc Andreessen</b></a>. Er
entwickelte den ersten WWW-Browser f&uuml;r grafische Benutzeroberfl&auml;chen,
den Browser <b>Mosaic</b>. Die Programmierer von Mosaic erfanden auch neue
Features, die sie in ihren WWW-Browser implementierten, ohne dass diese
Features standardisiert waren. Doch andererseits wurde haupts&auml;chlich
dadurch jene Lawine ins Rollen gebracht, die wir heute erleben. Marc Andreessen,
der den Boom fr&uuml;hzeitig witterte, stieg schlie&szlig;lich aus dem
Mosaic-Projekt aus und wurde Mitbegr&uuml;nder einer neuen Firma f&uuml;r
WWW-Software: <b>Netscape</b>.</p>

<p>In der zweiten Jahresh&auml;lfte 1993 brachten einflu&szlig;reiche
Bl&auml;tter wie die New York Times erste Artikel &uuml;ber das neue Fieber in
der Internet-Gemeinde. Die Anzahl der Schaulustigen wuchs, ebenso wie die Anzahl
von Server-Betreibern im Internet, die sich die frei verf&uuml;gbare
HTTP-Software installierten und damit WWW-f&auml;hig wurden. Hunderte, tausende
Menschen mit Internet-Zugang und Zugang zu Servern begannen, HTML f&uuml;rs WWW
zu schreiben, Wissenschaftliches, aber auch Pers&ouml;nliches, Abstruses,
Verr&uuml;cktes.</p>

<p>Bill Gates, Chef von Microsoft, dem m&auml;chtigsten Software-Konzern der
Welt, r&uuml;mpfte zu diesem Zeitpunkt h&ouml;chstens die Nase &uuml;ber die
Entwicklungen im Internet, wenn er sie &uuml;berhaupt zur Kenntnis nahm. Auch
traditionelle Online-Dienstanbieter wie CompuServe oder die Telekom schotteten
sich zun&auml;chst gegen das &quot;Chaos Internet&quot; ab. Die Lawine war
jedoch nicht mehr aufzuhalten. Sie wurde so m&auml;chtig, dass die
anf&auml;nglichen Gegner sp&auml;ter, als der Boom bereits in vollem Gange war
und Anwender entsprechende Software und Internet-Zug&auml;nge verlangten, Hals
&uuml;ber Kopf den Kurs wechselten und fieberhaft in das neue Medium
investierten. Heute sind Online-Dienste in erster Linie Internet-Provider, und
Microsoft besch&auml;ftigt Heerscharen von Entwicklern, die nichts anderes im
Sinn haben als das Vers&auml;umte nachzuholen, um auch im Internet-Bereich zum
Software-Anbieter mit dem gr&ouml;&szlig;ten Umsatz zu werden.</p>

<p>Die Anzahl von Technologien und Software-L&ouml;sungen im WWW-Bereich ist
heute kaum noch &uuml;berschaubar. Doch je bunter und un&uuml;bersichtlicher der
Markt, desto wichtiger werden allgemein anerkannte und weitgehend eingehaltene
Standards wie HTML und andere Sprachen, die vom W3-Konsortium normiert werden.
Denn letztendlich sind die Daten das Entscheidende, nicht die Software. Immer
mehr Endanwender und Entscheidungstr&auml;ger beginnen das zu begreifen. Und
dementsprechend w&auml;chst der Druck auf Software-Hersteller, sich an den
Standards zu orientieren. Das gilt f&uuml;r einfache Dokumentformate wie HTML
genau so wie etwa f&uuml;r Ans&auml;tze zu elektronischem Business.</p>

<hr noshade size=1>
<b>gehe zur <a href="dfue_internet.html#a1">Gesamt&uuml;bersicht</a><br>
oder zum <a href="dfue_internet5.html">n&auml;chsten Kapitel</a><br>
oder zum <a href="dfue_internet3.html"> vorigen Kapitel</a></b>
<hr noshade size=1><br>
</body>
</html>
