<HTML>
<HEAD><TITLE>Indiana Jones and the Fate of Atlantis</TITLE>
</HEAD>
<BODY BGCOLOR=#000000 TEXT=#ffffff link=BLUE>
<CENTER><TABLE BORDER=3 bordercolor=blue cellspacing=0 width=85% cellpadding=2><TR><TD>
<IMG SRC=lucas.gif align=right width=80 height=60 >
Es ist 1939- Deutsche Agenten haben sich auf die Suche nach der sagenumwobenen
versunken Stadt Atlantis gemacht. Sie wollen die gehiemnisvollen Kr&auml;fte der alten
Kultur dazu mi&szlig;brauchen, die Weltherrschaft an sich zu rei&szlig;en. Es liegt an Indy
diese teuflischen Machenschaften zu verhindern. Ein Wettlauf gegen die Zeit
beginnt, und wiedermal kannst nur du die Welt retten...</TD></TR></TABLE></CENTER>
<B><H1 align=center><FONT COLOR=#FFFF00>Indiana Jones and the Fate of Atlantis</FONT></H1></B>
		
Tja, was soll ich dazu noch gro&szlig;artig sagen? Indiana Jones war im Jahre 1993
eines der besten Adventures, auch wenn die Amiga Version grafisch schlechter
dasteht als z.B. die Mac-Version. Es kommt zwar weder vom Witz noch in irgendeiner
anderen Kategorie an Monkey Island 1+2 heran, hat daf&uuml;r aber seinen ganz eigenen
Reiz.
<DL>
<HR WIDTH=76% COLOR=#FF0000 NOSHADE size=2><DT><B>Handlung:</B></DT><P><DD>
Bei Indy gibt es die verschiedensten R&auml;tsel zu l&ouml;&szlig;en, vom Reparieren eines Generators
bin hin zu einer Verfolgungsjagd in Monte Carlo. Indy mu&szlig; sich gegen die Nazi<WBR>schergen
in Boxk&auml;mpfen durchsetzen, einen Ballon zur kleinen Kolonie f&uuml;hren, und ein Uboot kapern.
F&uuml;r einige Zeit Unterhaltung d&uuml;rfte somit gesorgt sein. &uuml;berdies spricht Indy 4
die logischen Denker an. Wenn man in Monkey Island z.B. mittels eines Zaubertranks
nach Monkey Island kommt, mu&szlig; man sich bei Indy streng nach den Gesetzen der
Natur richten. Ein Lastwagen und ein U-Boot tuns aber auch.<BR></DD>
<HR WIDTH=76% COLOR=#FF0000 NOSHADE size=2><DT><B>Die Grafik:</B></DT><P><DD>
Die Grafik ist wie schon bei Monkey Island teilweise mit dem Copper aufgebaut,
wodurch sogar auf den alten A500 Kisten 256 Farben ereicht werden. Auf anderen
Computersystemen soll die Grafik angeblich viel besser sein, was ich allerdings nicht
nachpr&uuml;fen konnte. Die Animationen sind wohl gerade wegen dieser Technik sehr stockend,
aber immer noch besser als in einigen Delphine Adventures...<BR>
Insgesamt nicht soviel zu meckern hier.</DD>
<HR WIDTH=76% COLOR=#FF0000 NOSHADE size=2><DT><B>Der Sound:</B></DT><P><DD>
Hier gibt es dann doch mehr zu meckern. Der Sound klingt um L&auml;ngen schlechter
als in z.B. Monkey Island. Nach einigen Minuten geht einem der jeweilige Soundtrack
doch geh&ouml;rig auf die Nerven, und man ist dankbar f&uuml;r die M&ouml;glichkeit am Fernseher
den Ton abzudrehen :(. In einigen Szenen passt er zwar anfangs ganz gut, aber
wie gesagt, er f&auml;ngt an zu nerven.</DD>
<HR WIDTH=76% COLOR=#FF0000 NOSHADE size=2><DT><B>Animationen:</B></DT><P><DD>
Aufgrund der Copper-System Grafik Routinen, sind die gr&ouml;&szlig;eren Animationen nicht
fl&uuml;&szlig;ig; im Gegenteil, die meisten gr&ouml;&szlig;eren Bilder bauen sich p&uuml;nktchenweise auf,
oder ruckeln. Der Vorteil dieses Systems ist allerdings, da&szlig; sogar die alten
A500s damals schon &uuml;ber 256 Farben benutzen konnten.</DD>
<HR WIDTH=76% COLOR=#FF0000 NOSHADE size=2><DT><B>Gameplay:</B></DT><P><DD>
Indy 4 ist ein sehr komplexes Adventure, aber leider sehr trocken. Es fehlt
irgendwie der coole Witz wie in Monkey Island, und leicht kann es passieren, da&szlig;
man an einer Stelle nicht weiterkommt, und das Spiel erstmal 2-3 Jahre ruhen
l&auml;&szlig;t. Dennoch macht es immer noch mehr Spa&szlig;, als z.B. die alten
Delphine-Adventures. Und ein nicht zu untersch&auml;tzender Vorteil ist, da&szlig; man sich
nicht verbauen kann. D.h., wenn du mal einen Fehler machst, kannst du ihn mei&szlig;t
sp&auml;ter wieder bereinigen. 
<BR>Die einzige Ausnahme, die mir aufgefallen ist, ist im Action Modus im
Labyrinth. Wenn man der Statue den Stab in den Mund steckt, ohne vorher den
Felsen weggerollt zu haben, kommt man nicht weiter. Aber ich denke mal, da&szlig; kann
man verschmerzen.</DD>
<HR WIDTH=76% COLOR=#FF0000 NOSHADE size=2><DT><B>Fazit:</B></DT><P>
<DD>Nich so gut Monkey Island aber trotzdem empfehlenswert, zumal man es
schon f&uuml;r ca. 15 Mark erwerben kann (neu).</DD>
<HR WIDTH=76% COLOR=#FF0000 NOSHADE size=2><P>
<CENTER><A HREF="mitglieder/castro.html"><IMG SRC="thesaint.gif" border=0 width=142 height=51 alt="The Saint, Gif, 142x51, Gr&ouml;&szlig;e ca. 2.5 KB, Link zur Mitgliederliste."></A></CENTER><BR><CENTER><FONT SIZE=1 color=#ffff00>Markus Castro</FONT></CENTER></P><P><CENTER><A HREF="NoCover.html"><IMG SRC="l_hauptinhalt.jpg" width=320 height=50 border=0 alt="Hauptinhalt, JPG, Link zur NoCover, 639x99, Gr&ouml;&szlig;e ca. 30 KB"></A></CENTER></P>
</BODY>
</HTML>
