<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>WolfZ</title>
</head>

<body background="wol1.jpg" text=black link=blue alink=red bgcolor="#FFFFCC">
<a name="top"></a>
<p>
<center><font color="#000080" size="7"><b>Wolf's Leserbrief</b></font></center></p>
<ul>
<li><a href="#a1"><b>f&uuml;r Rolf N&#252;nninghoff</a></b></li>
<li><a href="#a2"><b>f&uuml;r Kilian Servais</a></b></li>
<li><a href="#a3"><b>an  a l l e</a></b></li>
<li><a href="#a4"><b>Feedback-Corner</a></b></li>
</ul>
<br><br>
<p>
<a name="a1"><font size="+2">Gr&uuml;&szlig; Dich Rolf</font></p>
<p><font size="+1">
In der Rubrik "DFUe" in der NoCover-60 hast Du Dich &#252;ber das Ph&#228;nomen
der Sammelpost beschwert. Diese Sammelpost ist auch eine Adressierung ganz
pers&#246;nlich an Dich. Nur kannst Du im Kopf ersehen, wer noch alles die
Weihnachtsw&#252;nsche oder den Hilferuf bekommen haben. Stelle Dir nur einmal
vor, Du hast ein sch&#246;nes Bild und das m&#246;chtest Du all Deinen E-Mail
Freunden schicken. Gesetzt den Fall, das Bild hat ca 160 KB und Du m&#246;chtest
dieses an 12 Adressen versenden. Als Sammelpost sendest Du nur einmal, sagen wir
mal eineinhalb Minuten lang. W&#252;rdest Du diese Sendung aber 12 mal
verschicken m&#252;ssen, geht dies schon ins Telefongeld. Deswegen finde ich
pers&#246;nlich es als keine Diskriminierung, wenn eine Mail auch gleichzeitig
an viele andere geht. Gleichzeitig hast Du eine Liste, wer alles beteiligt war
und wer nicht.</p>
<p>
Deine S&#228;tze</font>
<blockquote><i>
Eigentlich schade, da&#223; man keine M&#246;glichkeit hat diesen Schindluder
(sage ich einfach so) abzustellen. Oder wei&#223; vielleicht jemand, wie man das
anstellt? Au&#223;erdem w&#252;rde ich gerne wissen, was Ihr davon haltet?
</blockquote></i>
<font size=+1>
versuche ich weitesgehend zu erl&#228;utern, um Dir eine Hilfestellung zu geben.</p>
<ul>
<li> Hattest Du einmal Kontakt zu einer Firma und diese sendet Dir regelm&#228;&#223;ig
Info-Material, das Du nicht haben m&#246;chtest, dann....</li>
<ol>
<li> kannst Du die Mail einfach l&#246;schen oder</li>
<li> zur&#252;ckmailen und um Eliminierung Deiner Anschrift ersuchen. (Denn es
ist verboten, unaufgefordert Info-Material zuzusenden.)</li></ol>
<li> Oder Dich st&#246;ren solche Sammelaktionen von Clubmitgliedern, wie die
Schneeballschlacht, Weihnachtsgr&#252;sse oder &#228;hnliches, dann sage es
deutlich in der NoCover und alle Club-Onliner nehmen Deine Anschrift aus ihrer
Sammelliste raus. (Dann wirst Du meist nur noch Antworten auf eigene Anfragen
bekommen).</li></ul>

<p> Wenn Du als Beispiel mein Adressenbuch anschauen w&#252;rdest, k&#246;nntest
Du sehen, dass ich mir mehrere Sammellisten angelegt habe. Und je nach Bedarf
kann dann solch eine Adressierliste herangezogen werden, was den Sendeverkehr
immens erleichtert.</p>

<p> Es wird viele Onliner gar nicht erfreut haben, dass Du das Verwenden von
Sammeladressen als Schindluder betituliert hast. Denn dies ist es wirklich
nicht, wie ich schon vorhin versuchte zu erkl&#228;ren. Hoffentlich beschimpft
Dich Deiner Meinung wegen keiner, denn Deine Ansicht ist bestimmt f&#252;r viele
nicht nachvollziehbar.</font></p>
<a href="#top">zum Anfang</a>
<hr><br>
<p>
<a name="a2"><font size="+2">Gr&uuml;&szlig; Dich Kilian</font></p>
<p><font size="+1">
Es ist f&#252;r mich doch ein ganz kleines bisschen &#252;berraschend, als einer
der letzten Hoffnungstr&#228;ger als Schreiberling angesehen zu werden. Im
Sommer werden es drei Jahre, dass ich anfangs in unregelm&#228;&#223;iger, aber
sp&#228;ter in etwas gleichm&#228;&#223;iger Form verschiedene Artikel,
Besprechungen, Workshops, aber auch Meckereien und Statements in der NoCover
ver&#246;ffentlichte.</p>

<p> Ausschlaggebend f&#252;r mein Engagement ist durch eine
bienenflei&#223;igige Kleinarbeit und hoher &#220;berredungskunst gef&#252;hrtem
"Weichkochen" durch Cord Hagen erst zustande gekommen. Meine wirklichen
Bef&#252;rchtungen waren wirklich mein Alter und das dadurch getr&#252;bte
Augenlicht f&#252;r die Belange der heutigen Jugend. Aber da stehe ich jetzt
dr&#252;ber.</p>

<p> Dabei habe ich stets versucht, in kein eingefahrenes Gleis zu kommen, damit
sich keine Lethargie ausbreiten konnte. Trotzdem habe ich &#246;fter den
Unwillen mancher Mitglieder geweckt, da ich nicht jugentlich genug schriebe.
Aber diesen Stil habe ich dann doch den Meckereren &#252;berlassen, die sich
&#252;brigens mittlerweile fast alle zur&#252;ckgezogen haben. Teilweise ist
dies noch nicht einmal schade, denn die seinerzeitigen Verballhornungen in der
Ausdrucksweise und die inhaltliche Leere in den Assays waren doch streckenweise
gravierender Mist hoch drei und f&#252;r mich sehr erm&#252;dent. </font></p>

<a href="#top">zum Anfang</a>
<hr><br>
<a name="a3"><font size="+2">an A l l e</font></p>
<p><font size="+1"> Wie Markus Castro Y Castro in seiner Highlightliste richtig
festgestellt hatte, ist mir bei der Besprechung der CD Aminet-28 wirklich der
Fehler unterlaufen, bei der Aufstellung des Inhaltes nochmals zus&#228;tzlich
die Bonusprogramme von Aminet-19 mit aufgef&#252;hrt zu haben. Urspr&#252;nglich
hatte ich da einen gro&#223;en Absatz, den ich aber wieder gel&#246;scht hatte,
leider aber nicht ganz.</p>

<p>Auf der Aminet-28 ist als Bonusprogramm nur "CygnusEd 3.5C" enthalten.</p>

<p>Bei der n&#228;chsten Besprechung werde ich mir wieder etwas mehr M&#252;he
geben, denn diese ist ja reichlich kurz ausgefallen. Alle getesteten Programme,
die ich anf&#252;hren wollte, gefielen mir nach wiederholtem Durchlesen nicht
mehr und so habe ich wieder rigoros gek&#252;rzt.</p>

<p>Es ist wirklich manchmal sehr schwer, auf die Schnelle ein neues Programm
oder Tool zu entdecken, das es wert ist, auch beschrieben und hervorgehoben zu
werden. Da ist halt nicht sehr viel. Der Gro&#223;teil sind Updates, wo kleinere
Bugs bereinigt wurden. Das Durchforsten der Rubriken "Games, Mods und Demos"
&#252;berlasse ich anderen, wie sich das in den Jahren so eingependelt hat.
</font></p>

<a href="#top">zum Anfang</a>
<hr><br>
<p>
<a name="a4"><font size="+2">Feedback-Corner</font></p>
<p><font size="+1">
Wie hier zu ersehen ist, habe ich beschlossen, auch wieder meine Feedback-Ecke
zu er&#246;ffnen. Es hatte sich eingeb&#252;rgert, f&#252;nf Titel/Beitr&#228;ge
herauszustellen, die einem pers&#246;nlich zugesagt haben. Deswegen werde ich
auch wieder an der Zahl 5 festhalten, wobei ich dies aber auf Autoren erweitere.
Sollte in der Highlightsliste ein Autor zum zweitenmal erscheinen, werde ich
dann die Nr 6 vorziehen. Eine Wertigkeit werde ich zu unterdr&#252;cken
versuchen, in dem ich die Aufz&#228;hlung alphabetisch erfolgen lasse.
<ul><li> Amiga-Test von Stefan Lebelt (falscher Titel gew&#228;hlt)</li>
<li> Demoz#3 von Henning W. Knopp</li>
<li> Future NoCover von Kilian Servais</li>
<li> Internet-Provider von Tobias Kaatz</li>
<li> Multimedia Ecke #6 von Gerd Wolpert</li>
</ul>
Sollte ich einen Beitrag &#252;bersehen haben, bitte ich um Entschuldigung.
Diese Wertung ist doch kein Spiegelbild, sondern nur ein ganz einfacher
emotionsgeladener Eindruck eines einzelnen. </font></p>
<hr>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
<center>
<a href="NoCover.html#a12"> <img border=0 src="l_hauptinhalt.jpg" width=495 height=75></a>
</td></tr></table><br>
</body>
</html>

