<HTML>
<HEAD><TITLE>Das Buch der Listen</TITLE></HEAD>
<BODY BGCOLOR=#FFFFFF TEXT=#000000 link=blue>
     <H1 align=center><B>
<FONT COLOR="000000">D<FONT COLOR="1F0000">a<FONT COLOR="3F0000">s<FONT COLOR="5F0000"> <FONT COLOR="7F0000">B<FONT COLOR="9F0000">u<FONT COLOR="BF0000">c<FONT COLOR="DF0000">h<FONT COLOR="FF0000"> <FONT COLOR="FF1900">d<FONT COLOR="FF3300">e<FONT COLOR="FF4C00">r<FONT COLOR="FF6600"> <FONT COLOR="FF7F00">L<FONT COLOR="FF9900">i<FONT COLOR="FFB200">s<FONT COLOR="FFCC00">t<FONT COLOR="FFE500">e<FONT COLOR="FFFF00">n
</FONT></FONT></FONT></FONT></FONT></FONT></FONT></FONT></FONT></FONT></FONT></FONT></FONT></FONT></FONT></FONT></FONT></FONT></FONT>
</B></H1>
Tja, diesmal kein Workshop &uuml;ber geordnete Listen, sondern mal etwas anderes.
Vor einiger Zeit habe ich n&auml;mlich das "Buch der Listen" bekommen, ein Buch mit
&uuml;ber 500 Listen &uuml;ber skurille Ereignisse, witzige (wahre) Geschichten, und
einigen coolen Statistiken. Nachdem ich es durchhatte dachte ich mir »Das w&auml;hre
doch mal was nettes f&uuml;r die NoCover«, und deswegen habe ich f&uuml;r heute mal diese
Sammlung der IMHO besten Listen zusammengestellt. Daher heute mal keine mit
Grafiken vollgestopfte Seite, sondern jede Menge Text. Enjoy it...<P>
<UL TYPE=CIRCLE>
<LI><A HREF=#1>Zehn Einsichten zum Geld</A><BR>
<LI><A HREF=#2>Zehn weniger bekannte Steuern</A><BR>
<LI><A HREF=#3>Zehn abgelehnte Wetten aus 14 Jahren »Wetten da&szlig; ...?«</A><BR>
<LI><A HREF=#4>Zehn Irrt&uuml;mer gro&szlig;er Gelehrter</A><BR>
<LI><A HREF=#5>Deutschlands d&uuml;mmste Kriminelle</A><BR>
<LI><A HREF=#6>Die Zehn d&uuml;mmsten Kriminellen aus »Nieten ohne Ende«</A><BR>
<LI><A HREF=#7>Sechs peinliche Versprecher</A><BR>
<LI><A HREF=#8>Vier Pannen beim Sport</A><BR>
<LI><A HREF=#9>Zehn mi&szlig;gl&uuml;ckte Schlagzeilen</A><BR>
<LI><A HREF=#10>Zehn mi&szlig;gl&uuml;ckte Argumente mit Statistik</A><BR>
<LI><A HREF=#11>Elf nicht allt&auml;gliche Alltagspannen</A><BR>
<LI><A HREF=#12>F&uuml;nf mi&szlig;gl&uuml;ckte Selbstmorde</A><BR>
<LI><A HREF=#13>Zehn spektakul&auml;re olympische Disqualifikationen</A><BR>
<LI><A HREF=#14>Zehn Aufrei&szlig;ertips aus der Bibel</A><BR>
<LI><A HREF=#15>Vier weniger gegl&uuml;ckte Reiseabenteuer</A><BR> 
<LI><A HREF=#16>Die Zehn unwahrscheinlichsten Zuf&auml;lle</A><BR>
<LI><A HREF=#17>Zw&ouml;lf au&szlig;ergew&ouml;nliche Todesf&auml;lle</A><BR>
<LI><A HREF=#18>Vier au&szlig;ergew&ouml;hnliche Selbstmorde</A><BR>
<LI><A HREF=#19>Sieben t&ouml;dliche Sportunf&auml;lle</A><BR>
<A NAME="1"></A>
<H2 ALIGN=CENTER><B><FONT COLOR="FF0000">Z</FONT><FONT  COLOR="E71700">e</FONT><FONT COLOR="D02E00">h</FONT><FONT COLOR="B94500">n</FONT><FONT COLOR="A25C00"> </FONT><FONT COLOR="8B7300">E</FONT><FONT COLOR="738B00">i</FONT><FONT COLOR="5CA200">n</FONT><FONT COLOR="45B900">s</FONT><FONT COLOR="2ED000">i</FONT><FONT COLOR="17E700">c</FONT><FONT COLOR="00FF00">h</FONT><FONT COLOR="00E915">t</FONT><FONT COLOR="00D42A">e</FONT><FONT COLOR="00BF3F">n</FONT><FONT COLOR="00AA55"> </FONT><FONT COLOR="00946A">z</FONT><FONT COLOR="007F7F">u</FONT><FONT COLOR="006A94">m</FONT><FONT COLOR="0055AA"> </FONT><FONT COLOR="003FBF">G</FONT><FONT COLOR="002AD4">e</FONT><FONT COLOR="0015E9">l</FONT><FONT COLOR="0000FF">d</FONT></B></H2>
</FONT>
</FONT><FONT COLOR=#000000>
<OL><LI>Geld stinkt nicht
(Sueton).<LI>Ohne Geld ist die Ehre nur eine Krankheit (Racine).<LI>Um Geld zu
verachten, mu&szlig; man es haben (Kurt G&ouml;tz).<LI>Geld allein macht nicht ungl&uuml;klich
(Peter Falk).<LI>Wo Geld vorangeht, sind alle Wege offen (Shakespeare).<LI>Der
Geist denkt, das Geld lenkt (Oswald Spengler).<LI>Wer Ohren hat, soll
h&ouml;ren,<BR>Wer Geld hat, solls verzehren (G&ouml;the).<LI>Die Menschen machen falsches
Geld, und das Geld macht falsche Menschen (K. Fasakas).<LI>Geld ist nicht alles.
Ein Mann mit 20 Millionen kann genauso gl&uuml;cklich sein, wie ein Mann mit 21
Millionen (J. Gleason).<LI>Manche haben von ihrem Verm&ouml;gen nur die Sorge, es zu
verlieren.</OL>
<A NAME="2"></A><H2 ALIGN=CENTER><B>
<FONT COLOR="0000FF">Z</FONT><FONT COLOR="0013EB">e</FONT><FONT COLOR="0027D7">h</FONT><FONT COLOR="003AC4">n</FONT><FONT COLOR="004EB0"> </FONT><FONT COLOR="00629C">w</FONT><FONT COLOR="007589">e</FONT><FONT COLOR="008975">n</FONT><FONT COLOR="009C62">i</FONT><FONT COLOR="00B04E">g</FONT><FONT COLOR="00C43A">e</FONT><FONT COLOR="00D727">r</FONT><FONT COLOR="00EB13"> </FONT><FONT COLOR="00FF00">b</FONT><FONT COLOR="00EE11">e</FONT><FONT COLOR="00DD22">k</FONT><FONT COLOR="00CC33">a</FONT><FONT COLOR="00BB44">n</FONT><FONT COLOR="00AA55">n</FONT><FONT COLOR="009966">t</FONT><FONT COLOR="008877">e</FONT><FONT COLOR="007788"> </FONT><FONT COLOR="006699">S</FONT><FONT COLOR="0055AA">t</FONT><FONT COLOR="0044BB">e</FONT><FONT COLOR="0033CC">u</FONT><FONT COLOR="0022DD">e</FONT><FONT COLOR="0011EE">r</FONT><FONT COLOR="0000FF">n</FONT><FONT COLOR=#000000>
</FONT></B></H2>


<DL>
<DT><B>1. Biersteuer</B></DT>
<DD>Besteuert werden Biere aus Malz, sowie Mischungen von Bier mit nicht<WBR>alkoholischen
Getr&auml;nken, und zwar nach der sog. »Stammw&uuml;rze« des Bieres; alkoholfreies und
an Angestellte und Arbeiter des Herstellungsbetriebe unentgeltlich abgegebenes
Bier (Haustrunk) ist steuerfrei.</DD>
<DT><B>2. Branntweinsteuer</B></DT>
<DD>Besteuert werden Ethylalkohol in jedweder Konzentration zusammengesetzte
alkoholhaltige Getr&auml;nke mit AlkoholGehalt von mehr als 1,2 Vol.%, sch&auml;umende
und nichtsch&auml;umende Weine und gegorene Getr&auml;nke.</DD>
<DT><B>3. Feuerschutzsteuer</B></DT>
<DD>
Wird zur F&ouml;rderung des Feuerl&ouml;schwesens und des vorbeugenden Brandschutzes
erhoben. Besteuert werden Pr&auml;mien und Beitr&auml;ge zu Feuerversicherungen.</DD>
<DT><B>4. Getr&auml;nkesteuer</B></DT>
<DD>Wird nur in Baden-W&uuml;rtemberg, Hessen und Sachsen-Anhalt erhoben. Besteuert
wird die »entgeltliche Abgabe« bestimmter Getr&auml;nke.</DD>
<DT><B>5. Hundesteuer</B></DT>
<DD>Wird den Haltern aller Hunde auferlegt (ausgenommen Blindenhunde, Diensthunde der Polizei
und von Forstbediensteten und Jagdaufsehern).</DD>
<DT><B>6. Kaffeesteuer</B></DT>
<DD>Wird erhoben auf R&ouml;stkaffe sowie Ausz&uuml;ge, Essenzen und Konzentrate aus Kaffee
(bei kaffeehaltigen Waren nur der Kaffeeanteil). Der Steuersatz f&uuml;r R&ouml;stkaffee
liegt derzeit bei 4,30 DM je Kilo.</DD>
<DT><B>7. Remmwett-, Lotterie- und Sportwettsteuer</B></DT>
<DD>Aufkommen 1994: 2,9 Mrd. DM.</DD>
<DT><B>8. Schankerlaubnissteuer</B></DT>
<DD>Wird nur in Rheinland-Pfalz und Hessen erhoben, und zwar f&uuml;r »die Erlangung
der Erlaubnis zum Betrieb einer Gastwirtschaft oder eines Kleinhandels mit Branntwein«.</DD>
<DT><B>9. Schaumweinsteuer</B></DT>
<DD>Wird erhoben auf »Schaumweine in Flaschen mit Schaumweinstopfen, der durch
eine besondere Haltevorichtung befestigt ist, oder die bei +20° C einen auf gel&ouml;stes
Kohlenstoffdioxid zur&uuml;ckzuf&uuml;hrenden &uuml;berdruck von 3 bar oder mehr aufweisen.«
Der Alkoholgehalt mu&szlig; mindestens 1,2 Vol.% und darf h&ouml;chstens 15 Vol.% betragen.</DD>
<DT><B>10. Vergn&uuml;gungssteuer</B></DT>
<DD>Wird erhoben auf Tanzveranstaltungen, Filmvorf&uuml;hrungen und f&uuml;r den Betrieb
von Spiel- und Unterhaltungsautomaten.</DD>
</DL>
<A NAME="3"></A>
<H2 ALIGN=CENTER><B>
<FONT COLOR="FF0000">Z</FONT><FONT COLOR="EB1300">e</FONT><FONT COLOR="D72700">h</FONT><FONT COLOR="C43A00">n</FONT><FONT COLOR="B04E00"> </FONT><FONT COLOR="9C6200">a</FONT><FONT COLOR="897500">b</FONT><FONT COLOR="758900">g</FONT><FONT COLOR="629C00">e</FONT><FONT COLOR="4EB000">l</FONT><FONT COLOR="3AC400">e</FONT><FONT COLOR="27D700">h</FONT><FONT COLOR="13EB00">n</FONT><FONT COLOR="00FF00">t</FONT><FONT COLOR="11FF00">e</FONT><FONT COLOR="22FF00"> </FONT><FONT COLOR="33FF00">W</FONT><FONT COLOR="44FF00">e</FONT><FONT COLOR="55FF00">t</FONT><FONT COLOR="66FF00">t</FONT><FONT COLOR="77FF00">e</FONT><FONT COLOR="88FF00">n</FONT><FONT COLOR="99FF00"> </FONT><FONT COLOR="AAFF00">a</FONT><FONT COLOR="BBFF00">u</FONT><FONT COLOR="CCFF00">s</FONT><FONT COLOR="DDFF00"> </FONT><FONT COLOR="EEFF00">1</FONT><FONT COLOR="FFFF00">4 </FONT><FONT COLOR="FFFF00">J</FONT><FONT COLOR="E7FF00">a</FONT><FONT COLOR="D0FF00">h</FONT><FONT COLOR="B9FF00">r</FONT><FONT COLOR="A2FF00">e</FONT><FONT COLOR="8BFF00">n</FONT><FONT COLOR="73FF00"> </FONT><FONT COLOR="5CFF00">»</FONT><FONT COLOR="45FF00">W</FONT><FONT COLOR="2EFF00">e</FONT><FONT COLOR="17FF00">t</FONT><FONT COLOR="00FF00">t</FONT><FONT COLOR="15E900">e</FONT><FONT COLOR="2AD400">n</FONT><FONT COLOR="3FBF00"> </FONT><FONT COLOR="55AA00">d</FONT><FONT COLOR="6A9400">a</FONT><FONT COLOR="7F7F00">&szlig;</FONT><FONT COLOR="946A00"> </FONT><FONT COLOR="AA5500">.</FONT><FONT COLOR="BF3F00">.</FONT><FONT COLOR="D42A00">.</FONT><FONT COLOR="E91500">?</FONT><FONT COLOR="FF0000">«</FONT><FONT COLOR=#000000>
</FONT></B></H2>
<OL>
<LI> »Ich wette, da&szlig; ich einen Luftballon mit meinem Hintern so aufblasen kann,
da&szlig; er in die L&uuml;fte steigt.« </LI>
<LI> »Ich wette, da&szlig; ich 6 von 20 Zigarettenmarken durch Knutschen mit der betreffenden
Raucherin erkenne.« </LI>
<LI> »Ich wette, da&szlig; ich mir ohne Blut zu verlieren einen gro&szlig;en Schinkenhaken
durch die Nase ziehen kann.« Der Kandidat bot dann als n&auml;chstes an, einen Kleiderb&uuml;gel
mit Mantel, oder ersatzweise die Stiefel des Moderators an diesem Schinkenhaken
aufzuh&auml;ngen).</LI>
<LI> »Ich wette, da&szlig; ich am Gesicht eines Toten erkennen kann, woran er gestorben ist.« </LI>
<LI> »Ich wette, da&szlig; ich mit einem Gabelstapler eine Zahnf&uuml;llung einsetzen kann.« </LI>
<LI> »Ich wette, da&szlig; ich w&auml;hrend der n&auml;chsten Sendung zum Bundeskanzlerkandidat
vorgeschlagen werde.« </LI>
<LI> »Wir wetten, da&szlig; wir innerhalb von zwei Stunden mit 24 Spitzhacken unser Schulgeb&auml;ude
einrei&szlig;en k&ouml;nnen.« </LI>
<LI> »Ich wette, da&szlig; ich mit meinem Mottorad zwischen den Schienen schneller fahre, als ein Eilzug.« </LI>
<LI> »Ich wette, da&szlig; ich mit meinem Penis eine 4 kg schwere Einkaufst&uuml;te tragen kann.« </LI>
<LI> »Ich wette, da&szlig; mein Partner mit einem zehn kilo schweren Vorschlaghammer, ohne
da&szlig; ich einen Kratzer kriege, zehn Dachpfannen auf meinem Kopf zerschlagen kann.« </LI></OL>
<A NAME="4"></A><H2 ALIGN=CENTER><B>
<FONT COLOR="000000">Z</FONT><FONT COLOR="001212">e</FONT><FONT COLOR="002424">h</FONT><FONT COLOR="003636">n</FONT><FONT COLOR="004848"> </FONT><FONT COLOR="005B5B">I</FONT><FONT COLOR="006D6D">r</FONT><FONT COLOR="007F7F">r</FONT><FONT COLOR="009191">t</FONT><FONT COLOR="00A3A3">&uuml;</FONT><FONT COLOR="00B6B6">m</FONT><FONT COLOR="00C8C8">e</FONT><FONT COLOR="00DADA">r</FONT><FONT COLOR="00ECEC"> </FONT><FONT COLOR="00FFFF">g</FONT><FONT COLOR="00EEEE">r</FONT><FONT COLOR="00DDDD">o</FONT><FONT COLOR="00CCCC">&szlig;</FONT><FONT COLOR="00BBBB">e</FONT><FONT COLOR="00AAAA">r</FONT><FONT COLOR="009999"> </FONT><FONT COLOR="008888">G</FONT><FONT COLOR="007777">e</FONT><FONT COLOR="006666">l</FONT><FONT COLOR="005555">e</FONT><FONT COLOR="004444">h</FONT><FONT COLOR="003333">r</FONT><FONT COLOR="002222">t</FONT><FONT COLOR="001111">e</FONT><FONT COLOR="000000">r</FONT><FONT COLOR=#000000>
</FONT></B></H2><OL><LI>Schwere Gegenst&auml;nde fallen schneller als leichte (Aristoteles).</LI><LI>Die Fallgeschwindigkeit eines Gegenstandes steigt proportional zur zur&uuml;ckgelegten Strecke (Leonardo da Vinci; richtig ist:Die Geschwindigkeit steigt proportional zur Fallzeit).</LI><LI>Wanzen entstehen durch Sonnenlicht (Immanuel Kant).</LI><LI>Die Wahrscheinlichkeit f&uuml;r »zweimal Kopf« beim zweimaligen M&uuml;nzwurd betr&auml;gt 1/3 (Jean d`Alembert; Richtig: 1/4).</LI><LI>Die Erde ist hohl (Edmund Halle).</LI><LI>Die Erde ist seit h&ouml;chstens 20 Millionen Jahren belebt (Lord Kelvin; nach heutiger Mehrhietsmeinung begann das Leben vor rund 600 Millionen Jahren; (Anmerkung: Alles Bullshit!)).</LI><LI>Atome existieren nicht (Ernst Mach).</LI><LI>Atome lassen sich nicht spalten (Ernest Rutherford).</LI><LI>Atomenergie l&auml;&szlig;t sich weder zivil noch milit&auml;rich nutzen (Nikola Tesla).</LI><LI>Das Universum dehnt sich nicht aus (Albert Einstein).</LI>
</OL>
<A NAME="5"></A><H2 ALIGN=CENTER><B>
<FONT COLOR="0000FF">D</FONT><FONT COLOR="0012FF">e</FONT><FONT COLOR="0024FF">u</FONT><FONT COLOR="0036FF">t</FONT><FONT COLOR="0048FF">s</FONT><FONT COLOR="005BFF">c</FONT><FONT COLOR="006DFF">h</FONT><FONT COLOR="007FFF">l</FONT><FONT COLOR="0091FF">a</FONT><FONT COLOR="00A3FF">n</FONT><FONT COLOR="00B6FF">d</FONT><FONT COLOR="00C8FF">s</FONT><FONT COLOR="00DAFF"> </FONT><FONT COLOR="00ECFF">d</FONT><FONT COLOR="00FFFF">&uuml;</FONT><FONT COLOR="00EFFF">m</FONT><FONT COLOR="00DFFF">m</FONT><FONT COLOR="00CFFF">s</FONT><FONT COLOR="00BFFF">t</FONT><FONT COLOR="00AFFF">e</FONT><FONT COLOR="009FFF"> </FONT><FONT COLOR="008FFF">K</FONT><FONT COLOR="007FFF">r</FONT><FONT COLOR="006FFF">i</FONT><FONT COLOR="005FFF">m</FONT><FONT COLOR="004FFF">i</FONT><FONT COLOR="003FFF">n</FONT><FONT COLOR="002FFF">e</FONT><FONT COLOR="001FFF">l</FONT><FONT COLOR="000FFF">l</FONT><FONT COLOR="0000FF">e</FONT><FONT COLOR=#000000>
</FONT></B></H2>
»In keiner Branche tummeln sich so viele Schwachk&ouml;pfe, Pechv&ouml;gel und Dilletanten als
unter Kriminellen«, schreibt der <I>stern</i>, dem wir die folgende Liste
verdanken:<OL>
<LI>In Frankfurt verkeil sich ein Einbrecher im Fenster einer Discothek; die
Feuerwehr mu&szlig; ihn mit Schneidbrennern befreien, dann &uuml;bergibt sie ihn der
Polizei.</LI>
<LI>Noch einfacher macht es den Ordnungskr&auml;ften ein gewisser Rudolf R.: Er
klettert in einen Panzerwagen, um Geldkoffer zu stehelen, einer der
Sicherheitsm&auml;nner schl&auml;gt die T&uuml;r hinter ihm zu, sperrt ihn ein und f&auml;hrt in
gradewegs in eine Polizeikaserne.</LI>
<LI>Andere Einbrecher setzen mit einem gestohlenen Lastwagen r&uuml;ckw&auml;rts durch die
Glast&uuml;r einer Bank, schlingen ein dickes Tau um Anh&auml;ngerkupplung und
Geldautomaten, geben Gas und rei&szlig;en das Ger&auml;t aus der Verankerung - es ist der
Kontoauszugsdrucker.</LI>
<LI>Kollegen von diesen fotografieren sich beim Einbruch selbst; da auf den
Polaroidbildern zun&auml;chst nichst zu sehen ist, lassen sie diese am Tatort im
Papierkorb liegen...</LI>
<LI>Ein Bundeswehrsoldat beraubt maskiert, aber in Uniform eine Bank; auf der
Brust prangt stolz sein Namensschild.</LI>
<LI>Ein anderer Bankr&auml;uber schiebt dem Kassierer einen Zettel mit der Aufschrift
zu »Das ist ein &uuml;berfall«. Der Kassierer dreht den Zettel um - es ist ein
Briefb&ouml;gen des R&auml;ubers selbst, mit Name, Telefonnummer Adresse.</LI>
<LI>Nach einem anderen Bankraub verl&auml;&szlig;t die T&auml;terin mit mehr als 40.000 Mark die
Schalterhalle, vergi&szlig;t aber die Maske abzunehmen. Das f&auml;llt einigen Passanten
auf, sie &uuml;bergeben sie der Polizei.</LI>
<LI>Dito Mike Z., der in Chemnitz mit 5.000 geraubten Mark die Sparkasse verl&auml;&szlig;t -
er findet sein Fluchtauto nicht, ger&auml;t in Panik und wird v&ouml;llig verst&ouml;rt von der
Polizei kassiert.</LI>
<LI>Ein anderer Bankr&auml;uber, diesmal in Magdeburg, findet zwar sein Fluchtauto,
aber das Fahrzeug startet nicht - kein Benzin im Tank.</LI>
<LI>Ebenfalls in Magdeburg: Zwei Anf&auml;nger erbeuten 5.000 Mark, verjubeln alles in
Hamburg auf der Reeperbahn, lassen w&auml;hrenddessen ihre Maschinenpistolen offen
auf dem R&uuml;cksitz ihres Fluchtfahrzeug liegen. Dieses wird von der Polizei
sichergestellt. Als das Gaunerduo, im Glauben, ihr Auto w&auml;hre nur wegen
Falschparkens umgestellt worden, auf der Wache reklamiert, wird es auf der
Stelle festgenommen.</LI>
</OL>
<A NAME="6"></A><H2 ALIGN=CENTER><B>
<FONT COLOR="00FF00">D</FONT><FONT COLOR="13EB00">i</FONT><FONT COLOR="27D700">e</FONT><FONT COLOR="3AC400"> </FONT><FONT COLOR="4EB000">Z</FONT><FONT COLOR="629C00">e</FONT><FONT COLOR="758900">h</FONT><FONT COLOR="897500">n</FONT><FONT COLOR="9C6200"> </FONT><FONT COLOR="B04E00">d</FONT><FONT COLOR="C43A00">&uuml;</FONT><FONT COLOR="D72700">m</FONT><FONT COLOR="EB1300">m</FONT><FONT COLOR="FF0000">s</FONT><FONT COLOR="EE1100">t</FONT><FONT COLOR="DD2200">e</FONT><FONT COLOR="CC3300">n</FONT><FONT COLOR="BB4400"> </FONT><FONT COLOR="AA5500">K</FONT><FONT COLOR="996600">r</FONT><FONT COLOR="887700">i</FONT><FONT COLOR="778800">m</FONT><FONT COLOR="669900">i</FONT><FONT COLOR="55AA00">n</FONT><FONT COLOR="44BB00">e</FONT><FONT COLOR="33CC00">l</FONT><FONT COLOR="22DD00">l</FONT><FONT COLOR="11EE00">e</FONT><FONT COLOR="00FF00">n </FONT><FONT COLOR="00FF00"> </FONT><FONT COLOR="19E500">a</FONT><FONT COLOR="33CC00">u</FONT><FONT COLOR="4CB200">s</FONT><FONT COLOR="669900"> </FONT><FONT COLOR="7F7F00">»</FONT><FONT COLOR="996600">N</FONT><FONT COLOR="B24C00">i</FONT><FONT COLOR="CC3300">e</FONT><FONT COLOR="E51900">t</FONT><FONT COLOR="FF0000">e</FONT><FONT COLOR="E91500">n</FONT><FONT COLOR="D42A00"> </FONT><FONT COLOR="BF3F00">o</FONT><FONT COLOR="AA5500">h</FONT><FONT COLOR="946A00">n</FONT><FONT COLOR="7F7F00">e</FONT><FONT COLOR="6A9400"> </FONT><FONT COLOR="55AA00">E</FONT><FONT COLOR="3FBF00">n</FONT><FONT COLOR="2AD400">d</FONT><FONT COLOR="15E900">e</FONT><FONT COLOR="00FF00">«</FONT><FONT color=#000000>
</FONT></B></H2>
<OL>
<LI>Ein Septembermorgen 1981: Zwei M&auml;nner &uuml;berfallen eine Tankstelle in Vancouver,
fesseln den Tankwart in der Toilette, und fl&uuml;chten mit hundert Dollar, verfahren
sich und fragen bei einer Tankstelle nach dem Weg - Der gleichen, die sie zuvor
&uuml;berfallen hatten. Der inzwischen befreite Tankwart l&auml;&szlig;t sie von der Polizei
verhaften.</LI>
<LI>Ein anderer R&auml;uber &uuml;berf&auml;llt mit den Worten »Her mit der Kasse oder ich
schie&szlig;e« eine Lebensmittelladen im englischen Wandsworth. ALs der Ladeninhaber
ihn h&ouml;flich fragt, wo er denn seine Revolver habe, verl&auml;&szlig;t der R&auml;uber
fluchtartig den Laden - den Revolver hatte er vergessen.</LI>
<LI>Ein weiterer Ladenr&auml;uber aus West Croydon schreibt auf einen Zettel »Ich habe
einen Revolver in der Tasche und knalle sie ab, oder sie r&uuml;cken sofort das Geld
heraus« und schiebt diesen der Kassiererin entgegen. Aus Angst, es handle sich
um etwas obz&ouml;nes, weigert sich die Kassiererin, den Zettel anzusehen. Daraufhin
wechselt  der R&auml;uber den Laden, aber der Besitzer kann kein Englisch. Im dritten
und letzten Laden schlieslich sagt der Bestizer, er m&uuml;sse erst seine Brille
holen, und ruft derweil die Polizei.</LI>
<LI>Im d&auml;nischen Munkebo sprengen drei Einbrecher den Safe einer Bank. Dabei
st&uuml;rzt das Bankgeb&auml;ude ein, der Safe bleibt heil.</LI>
<LI>Ebenfalls in D&auml;nemark fl&uuml;chtet ein Bankr&auml;uber in ein Taxi und ruft dem Fahrer
seine Adresse zu. Das vermeintliche Taxi entpuppt sich als ein Streifenwagen... </LI>
<LI>Im amerikanischen Bel Air bricht ein Dieb in eine Million&auml;rsvilla ein; er
findet sich in den zahlreichen R&auml;umen des Geb&auml;ues nicht zurecht, ger&auml;t in Panik,
landet im Schlafzimmer des anwesenden Besitzer, und bittet diesen ihn doch
irgendwo heruaszulassen. Aber da hatte er schon l&auml;ngst die Polizei gerufen... </LI>
<LI>Zwei Engl&auml;nder stehlen in Stoke-on-Trent einen Wassertank. Dieser ist halb
voll, und zieht eine Wasserspur direkt zum Haus der Diebe...</LI>
<LI>Ein Bankr&auml;uber in Malta fl&uuml;chtete mitsamt Beute in einen Bus. Jedoch hat der
Bus Versp&auml;tung, und ein zuf&auml;llig vorbeikommender Streifenpolizist, dem die aus
den Manteltaschen des R&auml;ubers ragenden Geldscheine auffallen, nimmt den R&auml;uber
fest.</LI>
<LI>Ein Ausbrecher aus dem Gef&auml;ngnis der amerikanischen Hafenstadt Madonna del
Freddo klopft nach gegl&uuml;ckter Flucht nachts an einer einsamen H&uuml;tte. Es &ouml;ffnet
der gleiche Polizist, der den Ausbrecher verhaftet hatte.</LI>
<LI>Ein anderer Ausbrecher versteckt sich im englischen Northeye-<WBR>Gef&auml;ngnis
in einem Lieferwagen voll Gem&uuml;se. Als der Lieferwagen nach einer l&auml;ngeren Fahrt
anh&auml;lt und der Ausbrecher sich aus dem Fahrzeug schleicht, mu&szlig;te er fetstellen,
da&szlig; er sich nunmehr in der Haftanstalt von Lewes befand.</LI>
</OL>
<A NAME="7"></A><H2 ALIGN=CENTER><B>
<FONT COLOR="000000">S</FONT><FONT COLOR="150000">e</FONT><FONT COLOR="2A0000">c</FONT><FONT COLOR="3F0000">h</FONT><FONT COLOR="550000">s</FONT><FONT COLOR="6A0000"> </FONT><FONT COLOR="7F0000">p</FONT><FONT COLOR="940000">e</FONT><FONT COLOR="AA0000">i</FONT><FONT COLOR="BF0000">n</FONT><FONT COLOR="D40000">l</FONT><FONT COLOR="E90000">i</FONT><FONT COLOR="FF0000">c</FONT><FONT COLOR="EC0000">h</FONT><FONT COLOR="DA0000">e</FONT><FONT COLOR="C80000"> </FONT><FONT COLOR="B60000">V</FONT><FONT COLOR="A30000">e</FONT><FONT COLOR="910000">r</FONT><FONT COLOR="7F0000">s</FONT><FONT COLOR="6D0000">p</FONT><FONT COLOR="5B0000">r</FONT><FONT COLOR="480000">e</FONT><FONT COLOR="360000">c</FONT><FONT COLOR="240000">h</FONT><FONT COLOR="120000">e</FONT><FONT COLOR="000000">r</FONT><FONT COLOR=#000000>
</FONT></B></H2>
<OL>
<LI>»This is a great day for France!« (Pr&auml;sident Nixon 1974 beim Begr&auml;bnis von
Georges Pompidou.)</LI>
<LI>»Sehr geehrte Damen und Herren, liebe Neger.«Pr&auml;sident L&uuml;bcke 1962 in
Liberia.)</LI>
<LI>»Now would you join me in a toast to President Figueredo and all the People of
Bolivia!« (Pr&auml;sident Reagan 1982 in Brasilien.)</LI>
<LI>»Die Warschauer F&uuml;hrung ist ein Haufen gottverlassener Landstreicher.« (Ronald
Reagan in einer Rede &uuml;ber Polen 1982.)</LI>
<LI>»We begin bombing of Russia in five Minute.« (Pr&auml;sident Reagan bei einer
Mikrophonprobe f&uuml;r eine Rundfunkrede 1984.)</LI>
<LI>»Who are these guys?« (Vizepr&auml;sident Al Gore vor den Statuen der amerikanischen
Pr&auml;sidenten Jefferson und Washington.)</LI>
</OL>
<A NAME="8"></A><H2 ALIGN=CENTER><B>
<FONT COLOR="FF06FF">V</FONT><FONT COLOR="E51EE5">i</FONT><FONT COLOR="CC37CC">e</FONT><FONT COLOR="B250B2">r</FONT><FONT COLOR="996999"> </FONT><FONT COLOR="7F827F">P</FONT><FONT COLOR="669B66">a</FONT><FONT COLOR="4CB44C">n</FONT><FONT COLOR="33CD33">n</FONT><FONT COLOR="19E619">e</FONT><FONT COLOR="00FF00">n</FONT><FONT COLOR="00E717"> </FONT><FONT COLOR="00D02E">b</FONT><FONT COLOR="00B945">e</FONT><FONT COLOR="00A25C">i</FONT><FONT COLOR="008B73">m</FONT><FONT COLOR="00738B"> </FONT><FONT COLOR="005CA2">S</FONT><FONT COLOR="0045B9">p</FONT><FONT COLOR="002ED0">o</FONT><FONT COLOR="0017E7">r</FONT><FONT COLOR="0000FE">t</FONT><FONT COLOR=#000000>
</FONT></B></H2>
<OL>
<LI>Bei einem Sportfest in England trifft ein Hammerwerfer sein eigenes am Rand
des Platzes geparktes Auto. Von dort fliegt der Hammer weiter durch ein Fenster
und schl&auml;gt den gerade mit seiner Frau telefonierenden Pr&auml;sidenten des
Sportvereins k.o. (Der gleiche Werfer hatte bei anderen Wettk&auml;mpfen bereits eine
Tankstelle, einen Polizeiwagen und ein Toilettenh&auml;uschen f&uuml;r M&auml;nner
getroffen.)</LI>
<LI>Bei den olympischen Spielen in Rom 1960 fallen s&auml;mtliche Reiter der
tunesischen F&uuml;nfkampf<WBR>mannschaft vom Pferd. Beim nachfolgenden Schwimmen
w&auml;re einer der Tunesier beinahe ertrunken, beim n&auml;chsten Wettbewerb, dem
Schie&szlig;en, wurde die Mannschaft des Platzes verwiesen, weil sie das Leben des
Schiedsrichters gef&auml;hrde, und beim Fechten wurde festgestellt, da&szlig; sich immer
derselbe K&auml;mpfer hinter der Fechtmaske verbarg - den anderen tunesischen
F&uuml;nfk&auml;mpfern war diese Sportart unbekannt.</LI>
<LI>Bei den olypmischen Spielen 1932 in Los Angeles vergi&szlig;t ein Rundenz&auml;hler, beim
3.000-<WBR>Meter-<WBR>Hindernis-<WBR>Lauf die letzte Runde einzul&auml;uten; die
Athleten laufen eine Runde zuviel, und der Sieger, der Finne Iso Hollo, verpa&szlig;t
seinen anvisierten Weltrekord.</LI>
<LI>American Football, Minnesota Vikings gegen San Fransico 49ers: Der
Minnesota-<WBR>Spieler Jim Marshall f&auml;ngt den Ball, sprintet &uuml;ber das ganze Feld
und erzielt einen Touchdown - in der falschen H&auml;lfte; in der Aufregung &uuml;ber den
unerwarteten Fang hatte er die Laufrichtung gewechselt.</LI>
</OL>
<A NAME="9"></A><H2 ALIGN=CENTER><B>
<FONT COLOR="FFFF00">Z</FONT><FONT COLOR="FFF400">e</FONT><FONT COLOR="FFE900">h</FONT><FONT COLOR="FFDE00">n</FONT><FONT COLOR="FFD300"> </FONT><FONT COLOR="FFC800">m</FONT><FONT COLOR="FFBD00">i</FONT><FONT COLOR="FFB200">&szlig;</FONT><FONT COLOR="FFA700">g</FONT><FONT COLOR="FF9C00">l</FONT><FONT COLOR="FF9100">&uuml;</FONT><FONT COLOR="FF8600">c</FONT><FONT COLOR="FF7B00">k</FONT><FONT COLOR="FF7100">t</FONT><FONT COLOR="EC6800">e</FONT><FONT COLOR="DA6000"> </FONT><FONT COLOR="C85800">S</FONT><FONT COLOR="B65000">c</FONT><FONT COLOR="A34800">h</FONT><FONT COLOR="914000">l</FONT><FONT COLOR="7F3800">a</FONT><FONT COLOR="6D3000">g</FONT><FONT COLOR="5B2800">z</FONT><FONT COLOR="482000">e</FONT><FONT COLOR="361800">i</FONT><FONT COLOR="241000">l</FONT><FONT COLOR="120800">e</FONT><FONT COLOR="000000">n</FONT><FONT COLOR=#000000>
</FONT></B></H2>
<OL>
<LI>Irrer Betrieb in der neuen Nervenklinik (Bild).</LI>
<LI>Polizei sucht Frau zum Abtasten (Bild).</LI>
<LI>Gemeiner Hund vergiftet Haustiere (Der Neue Tag).</LI>
<LI>Beim Sonnenbaden ertrunken (Frankfurter Rundschau).</LI>
<LI>Mehrheit f&uuml;r sch&ouml;nes Wetter (ap).</LI>
<LI>Vier Tote starben am Wochenende (Wimpfener Heimatblatt).</LI>
<LI>Jeder f&uuml;nfte Verkehrstote ging zu Fu&szlig; (Kieler Rundschau).</LI>
<LI>Die Zukunft geh&ouml;rt dem Mittagsschlaf (Rheinischer Merkur).</LI>
<LI>Unn&ouml;tige Ger&uuml;chelawine um Paul Breitner (Kicker).</LI>
<LI>Nonnen ohne Nachwuchs (K&ouml;lner Stadt-Anzeiger).</LI>
</OL>
<A NAME="10"></A><H2 ALIGN=CENTER><B>
<FONT COLOR="FF0000">Z</FONT><FONT COLOR="EB0000">e</FONT><FONT COLOR="D70000">h</FONT><FONT COLOR="C40000">n</FONT><FONT COLOR="B00000"> </FONT><FONT COLOR="9C0000">m</FONT><FONT COLOR="890000">i</FONT><FONT COLOR="750000">&szlig;</FONT><FONT COLOR="620000">g</FONT><FONT COLOR="4E0000">l</FONT><FONT COLOR="3A0000">&uuml;</FONT><FONT COLOR="270000">c</FONT><FONT COLOR="130000">k</FONT><FONT COLOR="000000">t</FONT><FONT COLOR="001100">e</FONT><FONT COLOR="002200"> </FONT><FONT COLOR="003300">A</FONT><FONT COLOR="004400">r</FONT><FONT COLOR="005500">g</FONT><FONT COLOR="006600">u</FONT><FONT COLOR="007700">m</FONT><FONT COLOR="008800">e</FONT><FONT COLOR="009900">n</FONT><FONT COLOR="00AA00">t</FONT><FONT COLOR="00BB00">e</FONT><FONT COLOR="00CC00"> </FONT><FONT COLOR="00DD00">m</FONT><FONT COLOR="00EE00">i</FONT><FONT COLOR="00FF00">t </FONT><FONT COLOR="00FF00">S</FONT><FONT COLOR="00AA00">t</FONT><FONT COLOR="005500">a</FONT><FONT COLOR="000000">t</FONT><FONT COLOR="000000">i</FONT><FONT COLOR="000000">s</FONT><FONT COLOR="000000">t</FONT><FONT COLOR="000000">i</FONT><FONT COLOR="000000">k</FONT><FONT color=#000000>

</FONT></B></H2>
<OL>
<LI>Jede Dritte Ehe in Deutschland wird geschieden, in Gro&szlig;st&auml;dten sogar jede
Vierte (Wochenpost).</LI>
<LI>38% aller Studentinnen sind weiblich (Bild).</LI>
<LI>Heute fallen in Westdeutschland j&auml;hrlich gut 12 kg Margarine auf den Kopf der
Bev&ouml;lkerung (Wochenpost).</LI>
<LI>Statistisch erwiesen: Aus parkenden Autos, in denen keine Fotoapparate liegen,
werden auch keine Fotoapparate geklaut (Hessische Allgemeine).</LI>
<LI>Die Kreishandwerkerschaft Uelzen ist mit dem Ausbildungsstand bei den Innungen
sehr zufrieden. Von den 363 Lehrlingen, die zu den Gesellenpr&uuml;fungen angemeldet
wurden, bestanden 338 die Pr&uuml;fung. Das sind mehr als 90 (Winsener Anzeiger).</LI>
<LI>Die Zahl der Geburten nimmt deshalb ab, weil so wenig Kinder auf die Welt
kommen.</LI>
<LI>Frauen leben im Durchschnitt l&auml;nger - das gilt besonders f&uuml;r Witwen
(Handelsblatt).</LI>
<LI>Die Lebenserwartung hat sich in der Bundesrepublik in den letzten zwanzig
Jahren kaum ver&auml;ndert (Frauen sterben dagegen weniger h&auml;ufig), trotz st&auml;ndig
steigender Gesundheitskosten (Die Zeit).</LI>
<LI>Der h&ouml;chste Anteil findet sich indes bei den J&uuml;ngeren und vor allem in den
&auml;lteren Altersgruppen (Hannoversche Nachrichten).</LI>
<LI>Zehn von hundert Menschen haben Ahnung von Prozentrechnung. Das sind &uuml;ber 17%.</LI>
</OL>
<A NAME="11"></A><H2 ALIGN=CENTER><B>
<FONT COLOR="FF0000">E</FONT><FONT COLOR="FF0700">l</FONT><FONT COLOR="FF0F00">f</FONT><FONT COLOR="FF1600"> </FONT><FONT COLOR="FF1E00">n</FONT><FONT COLOR="FF2500">i</FONT><FONT COLOR="FF2D00">c</FONT><FONT COLOR="FF3400">h</FONT><FONT COLOR="FF3C00">t</FONT><FONT COLOR="FF4300"> </FONT><FONT COLOR="FF4B00">a</FONT><FONT COLOR="FF5200">l</FONT><FONT COLOR="FF5A00">l</FONT><FONT COLOR="FF6100">t</FONT><FONT COLOR="FF6900">&auml;</FONT><FONT COLOR="FF7100">g</FONT><FONT COLOR="EF7900">l</FONT><FONT COLOR="DF8200">i</FONT><FONT COLOR="CF8B00">c</FONT><FONT COLOR="BF9400">h</FONT><FONT COLOR="AF9D00">e</FONT><FONT COLOR="9FA600"> </FONT><FONT COLOR="8FAF00">A</FONT><FONT COLOR="7FB800">l</FONT><FONT COLOR="6FC000">l</FONT><FONT COLOR="5FC900">t</FONT><FONT COLOR="4FD200">a</FONT><FONT COLOR="3FDB00">g</FONT><FONT COLOR="2FE400">s</FONT><FONT COLOR="1FED00">p</FONT><FONT COLOR="0FF600">a</FONT><FONT COLOR="00FF00">nnen</FONT><FONT color=#000000>
</FONT></B></H2>
<OL>
<LI>Ein Diplomat der britischen Botschaft in Wien besucht als Hamlet einen
Faschingsball. Bei der Heimfahrt klebt er, in dem Bem&uuml;hen, das vereiste
T&uuml;rschlo&szlig; durch Beatmen auzutauen, durch die K&auml;lte mit dem Mund am Auto kleben;
gut eine Stunde belustigt er als n&auml;chtlicher Hamlet die Passanten...</LI>
<LI>Amerikanische Kosumentensch&uuml;tzer lassen zu Weihnachten Tausende von
Anstecknadeln mit dem Text »Den Kindern zuliebe: Kinderfreundliches Spielzeug«
produzieren. S&auml;mtliche Nadeln m&uuml;ssen sofort aus dem Verkehr gezogen werden, sie
hatten scharfe Kanten, waren mit giftiger Bleifarbe bedruckt, und leicht von
Kleinkinder zu verschlucken.</LI>
<LI>Ein 35j&auml;hriger Berliner s&auml;gt den Ast eines Baumes ab, auf dem er selber
sitzt. Er st&uuml;rzt aus 5 Metern H&ouml;he zur Erde und kommt schwerverletzt ins
Krankenhaus.</LI>
<LI>»Ich wollte Fensterputzen. Damit ich von au&szlig;en an das Fenster herankommen
konnte, legte ich ein B&uuml;gelbrett auf die Fensterbank. Mein Mann, der schwerer
als ich ist, setzte sich innen auf das B&uuml;gelbrett, und ich putzte auf dem Brett
stehend das Fenster von au&szlig;en. Pl&ouml;tzlich klingelte es an der Haust&uuml;r. Als mein
Mann unten &ouml;ffnete, fand er mich vor dem Eingang liegend. Wir wissen bis heute
nicht, wer geklingelt hat.« (Aus einer Schadensmeldung an eine Versicherung)</LI>
<LI>Die englische Gemeinde Solihull beauftragt aine Abri&szlig;firma, einen Kuhstall
abzurei&szlig;en. Am Morgen des vereinbarten Tages sehen Nachbarn einen Abri&szlig;bagger
anrollen, am Kuhstall vorbeirollen, und auf Monkspath Hall, einen
denkmalgesch&uuml;tzten Gutshof aus dem 18. Jahrhundert zuhalten. Nach einer Stunde
sind vom Denkmal nur noch Tr&uuml;mmer &uuml;brig...</LI>
<LI>Der B&uuml;rgermeister von Leningrad feiert im Hermitage-<WBR>Museum die Hochzeit
seiner Tochter. Als einer der G&auml;ste seine Teetasse zu Boden fallen l&auml;&szlig;t, fassen
die anderen das als Zeichen auf und werfen zur Bekr&auml;ftigung des Brautgl&uuml;cks auch
ihre Teetassen zu Boden - Tassen aus dem einmaligen Teeservie Katharinas der
Gro&szlig;en. (Der B&uuml;rgermeister war nicht mehr lange B&uuml;rgermeister)</LI>
<LI>Ein Dr. John Fellows aus England will seine Tochter in New York besuchen.
Dort angekommen, findet er den Zettel mit ihrer Adresse nicht. Auch den Namen
seiner Tochter hatte er vergessen. Nach mehreren Stunden Nachdenkens auf dem
Flugplatz kehrt er unverrichteter Dinge nach England zur&uuml;ck.</LI>
<LI>Das Iroqois Theater in Chicago er&ouml;ffnet 1903 als erstes hundertprozentig
feuersicheres Theater der Welt. Einen Monat sp&auml;ter verursacht eine Gl&uuml;hbirne
einen Kurzschlu&szlig;, das Theater brennt bis auf die Grundmauern nieder.</LI>
<LI>Frankfurter Buchmesse 1980: Ein holl&auml;ndischer Verleger reicht eiben
Taxifahrer einen Zettel mit der Adresse seines Hotels; dann schl&auml;ft er - m&uuml;de
von den vielen Besprechungen und Parties - ein, und findet sich f&uuml;nf Stunden
sp&auml;ter vor seinem Haus in Amsterdam. Er hatte dem Taxifahrer die eigene Adresse
gegeben...</LI>
<LI>Ein Fahrgast des TGV verliert in der Toilette sein Portemonnaie, langt in
die Sch&uuml;&szlig;el, um es herauszufischen, und bleibt stecken. In letzter Verzweiflung
zieht er die Notbremse und wird schlie&szlig;lich von der Feuerwehr, die ihn mitsamt
der Toilette auf den Bahnsteig hievt, mit Schneidbrennern befreit.</LI>
<LI>Ein amerikanischer Waschmitelhersteller erlitt Mitte der 80er Jahre mit
einer teuren Werbekampagne in Saudi-Arabien einen gro&szlig;en Mi&szlig;erfolg: Die Anzeigen
zeigten links die schmutzige, rechts die saubere W&auml;sche, und das Waschpulver
dazwischen. In arabischen L&auml;ndern liest man von rechts nach links...</LI>
</OL>


<A NAME="12"></A><H2 align=center><B>
<FONT COLOR="FF00FF">F</FONT><FONT COLOR="E915F0">&uuml;</FONT><FONT COLOR="D42AE1">n</FONT><FONT COLOR="BF3FD3">f</FONT><FONT COLOR="AA55C4"> </FONT><FONT COLOR="946AB6">m</FONT><FONT COLOR="7F7FA7">i</FONT><FONT COLOR="6A9498">&szlig;</FONT><FONT COLOR="55AA8A">g</FONT><FONT COLOR="3FBF7B">l</FONT><FONT COLOR="2AD46D">&uuml;</FONT><FONT COLOR="15E95E">c</FONT><FONT COLOR="00FF50">k</FONT><FONT COLOR="00FF4A">t</FONT><FONT COLOR="00FF44">e</FONT><FONT COLOR="00FF3E"> </FONT><FONT COLOR="00FF39">S</FONT><FONT COLOR="00FF33">e</FONT><FONT COLOR="00FF2D">l</FONT><FONT COLOR="00FF28">b</FONT><FONT COLOR="00FF22">s</FONT><FONT COLOR="00FF1C">t</FONT><FONT COLOR="00FF16">m</FONT><FONT COLOR="00FF11">o</FONT><FONT COLOR="00FF0B">r</FONT><FONT COLOR="00FF05">d</FONT><FONT COLOR="00FF00">e</FONT><FONT color=#000000>
</FONT></B></H2>
<OL>
<LI>1979: Eine Mrs. Evita Adams st&uuml;rzt sich vom 86. Stock des New York Empire
State Buildins, wird aber von einem pl&ouml;tzlichen Windsto&szlig; in ein offenes Fenster
des 85. Stocks gewirbelt, wo sie ohne gr&ouml;&szlig;ere Verletzung landet.</LI>
<LI>1885: Aus Liebeskummer springt die Engl&auml;nderin Sarah Henley von der
ber&uuml;hmten, mehr als 70 Meter hohen Clifden-<WBR>Br&uuml;cke bei Bristol in die Tiefe.
Jedoch wirkt ihr Petticoat wie ein Fallschirm, sie segelt sanft nach unten,
landet weich im Schlamm, und stirbt erst mit 85 Jahren.</LI>
<LI>1992: Ein Mann will sich aus dem dritten Stock eines Hauses auf die Stra&szlig;e
st&uuml;rzen; er nimmt Anlauf, bricht durch ein Fenster, und landet leicht verletzt
auf einem Auto, das unter dem Fenster parkt. In Rage versetzt rennt der Mann
wieder in den dritten Stock, und st&uuml;rzt sich erneut aus dem Fenster; er landet
wieder auf dem Autodach - er hatte dasselbe Fenster genommen.</LI>
<LI>1992: Ein Chinese springt in die Fluten des Gelben Flu&szlig;es; er verheddert
sich in einer Angelschnur und wird von deren Besitzer bewu&szlig;tlos aus dem Flu&szlig;
gezogen.</LI>
<LI>1994: Ein Mann st&uuml;rzt sich vom 10. Stockwerk eines Hauses in die Tiefe; beim
Passieren des 9. Stocks wird er von einer dort w&auml;hrend eines Ehestreits
abgefeuerten Kugel getroffen und sofort get&ouml;tet.</LI>
</OL>
<A NAME="13"></A><H2 align=center><B>
<FONT COLOR="000000">Z</FONT><FONT COLOR="130000">e</FONT><FONT COLOR="270000">h</FONT><FONT COLOR="3A0000">n</FONT><FONT COLOR="4E0000"> </FONT><FONT COLOR="620000">s</FONT><FONT COLOR="750000">p</FONT><FONT COLOR="890000">e</FONT><FONT COLOR="9C0000">k</FONT><FONT COLOR="B00000">t</FONT><FONT COLOR="C40000">a</FONT><FONT COLOR="D70000">k</FONT><FONT COLOR="EB0000">u</FONT><FONT COLOR="FF0000">l</FONT><FONT COLOR="EC0000">&auml;</FONT><FONT COLOR="DA0000">r</FONT><FONT COLOR="C80000">e</FONT><FONT COLOR="B60000"> </FONT><FONT COLOR="A30000">o</FONT><FONT COLOR="910000">l</FONT><FONT COLOR="7F0000">y</FONT><FONT COLOR="6D0000">m</FONT><FONT COLOR="5B0000">p</FONT><FONT COLOR="480000">i</FONT><FONT COLOR="360000">s</FONT><FONT COLOR="240000">c</FONT><FONT COLOR="120000">h</FONT><FONT COLOR="000000">e </FONT><FONT COLOR="000000">D</FONT><FONT COLOR="1F0000">i</FONT><FONT COLOR="3F0000">s</FONT><FONT COLOR="5F0000">q</FONT><FONT COLOR="7F0000">u</FONT><FONT COLOR="9F0000">a</FONT><FONT COLOR="BF0000">l</FONT><FONT COLOR="DF0000">i</FONT><FONT COLOR="FF0000">f</FONT><FONT COLOR="FF0000">i</FONT><FONT COLOR="FF0000">k</FONT><FONT COLOR="FF0000">a</FONT><FONT COLOR="FF0000">t</FONT><FONT COLOR="FF0000">i</FONT><FONT COLOR="FF0000">o</FONT><FONT COLOR="FF0000">n</FONT><FONT COLOR="FF0000">e</FONT><FONT COLOR="FF0000">n</FONT><FONT color=#000000>
</FONT></B></H2>
<DL>
<DT><B>1. Fred Lorz</B></DT>
<DD>St. Louis 1904: der Amerikaner Fred Lorz, Sieger im Marathonlauf, war zehn
Mailen mit dem Auto gefahren...</DD>
<DT><B>2. Dorando Pietri</B></DT>
<DD>London 1908: Beim Marathonlauf bricht der Italiener Dorando Pietri, in
F&uuml;hrung liegend, kurz vor dem Ziel zusammen. Freundliche Helfer greifen ihm
unter die Arme - Disqualifikation.</DD>
<DT><B>3. Jim Thorpe</B></DT>
<DD>Stockholm 1912: Der Indianer Jim Thorpe gewinnt den F&uuml;nf- und den Zehnkampf,
wird zehn Monate sp&auml;ter disqualifiziert, weil er gegen Geld gestartet ist (1983
bekommt er seine Goldmedaillen zur&uuml;ck).</DD>
<DT><B>4. Schwedische Reiterequipe</B></DT>
<DD>London 1948: Die schwedischen Dressurreiter werden wegen Teilnahme eines
Unteroffiziers disqualifiziert (nach der olympischen Regel durften damals in der
Dressurmannschaft nur Offiziere reiten).</DD>
<DT><B>5. Amerikanische 4x100-<WBR>Meter-<WBR>Staffel</B></DT>
<DD>London 1948: Der amerikanischen Sprintstaffel wird dei Goldmedaille
verweigert, sie soll die Wechselmarke &uuml;bertreten haben. Ein Amateurfilm belegt
aber den korrekten Wechsel, die Medaille wird gerettet.</DD>
<DT><B>6. Dong-Kih Choh</B></DT>
<DD>Tokyo 1964: Der koreanische Boxer Dong-Kih Choh wird wegen Kopfschlages
disqualifiziert; sein nachfolgender 51 Minuten langer Sitzstreik in der
Ringmitte macht ihn weltber&uuml;hmt.</DD>
<DT><B>7. H. G. Liljenwall</B></DT>
<DD>Mexico City 1968: Der schwedische F&uuml;nfk&auml;mpfer Hans-<WBR>Gunnar Liljenwall
wird beim Schie&szlig;en disqualifiziert - er war besoffen!</DD>
<DT><B>8. Boris Ornischenko</B></DT>
<DD>Montreal 1976: Der russische F&uuml;nfk&auml;mpfer wird mit einem Degen erwischt, der
bei Bedarf durch den Druck der Hand den Trefferkontakt ausl&ouml;&szlig;t.</DD>
<DT><B>9. J&uuml;rgen Hingsen</B></DT><DD>
Der Mitfavorit auf das Olympiagold im Zehnkampf verschuldet
gleich bei der ersten Disziplin, den 100 Metern, vier Fehlstarts hintereinander
(in der Antike wurden Fehlstarter ausgepeitscht).</DD>
<DT><B>10. Ben Johnson</B></DT>
<DD>Seoul 1988: Der 100-<WBR>Meter-<WBR>Olympiasieger wird drei Tage sp&auml;ter des
Dopings &uuml;berf&uuml;hrt.</DD>
</DL>
<A NAME="14"></A><H2 align=center><B>
<FONT COLOR="00FF00">Z</FONT><FONT COLOR="00EE11">e</FONT><FONT COLOR="00DD22">h</FONT><FONT COLOR="00CC33">n</FONT><FONT COLOR="00BB44"> </FONT><FONT COLOR="00AA55">A</FONT><FONT COLOR="009966">u</FONT><FONT COLOR="008877">f</FONT><FONT COLOR="007788">r</FONT><FONT COLOR="006699">e</FONT><FONT COLOR="0055AA">i</FONT><FONT COLOR="0044BB">&szlig;</FONT><FONT COLOR="0033CC">e</FONT><FONT COLOR="0022DD">r</FONT><FONT COLOR="0011EE">t</FONT><FONT COLOR="0000FF">i</FONT><FONT COLOR="0F00EF">p</FONT><FONT COLOR="1F00DF">s</FONT><FONT COLOR="2F00CF"> </FONT><FONT COLOR="3F00BF">a</FONT><FONT COLOR="4F00AF">u</FONT><FONT COLOR="5F009F">s</FONT><FONT COLOR="6F008F"> </FONT><FONT COLOR="7F007F">d</FONT><FONT COLOR="8F006F">e</FONT><FONT COLOR="9F005F">r</FONT><FONT COLOR="AF004F"> </FONT><FONT COLOR="BF003F">B</FONT><FONT COLOR="CF002F">i</FONT><FONT COLOR="DF001F">b</FONT><FONT COLOR="EF000F">e</FONT><FONT COLOR="FF0000">l</FONT><FONT color=#000000>
</FONT></B></H2>
<OL>
<LI>Warten bis der Bruder stirbt, dann dessen Frau heiraten (&ouml;fters).</LI>
<LI>Eine Kriegesgefangene vergewaltigen: »Falls du zur Schlacht gegen deine 
Feinde ausziehst und Jehova, dein Gott, sie in deine Hand gegeben hat und 
du sie gefangen weggef&uuml;hrt hast, und du hast unter den Gefangenen eine Frau 
gesehen, sch&ouml;n von Gestalt, und du bist ihr anh&auml;nglich geworden und hast sie 
dir zur Frau genommen, dann sollst du sie mitten in dein Haus bringen. 
Sie soll jetzt ihr Haupt scheren und ihre N&auml;gel zurechtmachen und den 
Überwurf ihrer Gefangenschaft von sich ablegen und in deinem Haus wohnen
und einen ganzen Mondmonat um ihren Vater und ihre Mutter weinen; und danach 
solltest du Beziehungen mit ihr haben, und du sollst sie als deine Braut 
in Besitz nehmen, und sie soll deine Frau werden.« (5. Mose 21:10-13)</LI>
<LI>Eine Prostituierte heiraten: »Da war ein Beginn des durch Hosea [ergangenen]
 Wortes Jehovas, und Jehova sprach dann zu Hosea: "Geh, nimm dir eine Frau 
der Hurerei und Kinder der Hurerei, denn durch Hurerei wendet sich das Land 
ganz bestimmt davon ab, Jehova zu folgen."« (Hosea 1:2)</LI>
<LI>Zu den Haustieren des Vaters freundlich sein: »Der Priester von Midian nun 
hatte sieben T&ouml;chter, und wie &uuml;blich kamen sie und sch&ouml;pften Wasser und 
f&uuml;llten die Tr&auml;nkrinnen, um ihres Vaters Kleinviehherde zu tr&auml;nken. Und wie
&uuml;blich kamen die Hirten und trieben sie weg. Da stand Moses auf und leistete 
den Frauen Hilfe und tr&auml;nkte ihre Kleinviehherde.« (2. Mose 2:16+17) Zum Dank
wird Moses nach Hause eingeladen, und darf sich eine der T&ouml;chter zur Frau
nehmen.</LI>
<LI>Grundst&uuml;ck mit der Frau erwerben: »Da sagte Boas: "An dem Tag, an dem du 
das Feld aus Noomis Hand kaufst, sollst du es auch von Ruth, der Moabiterin,
der Frau des Verstorbenen, kaufen, um den Namen des Verstorbenen auf seinem 
Erbe erstehen zu lassen."« (Ruth 4:5)</LI>
<LI>Eine Party &uuml;berfallen: »Schlie&szlig;lich sprachen sie: "Siehe! Von Jahr zu Jahr 
findet ein Fest Jehovas in Silo statt, das n&ouml;rdlich von Bethel ist, &ouml;stlich 
von der Landstra&szlig;e, die von Bethel nach Sichem hinaufgeht, und s&uuml;dlich von 
Lebona." So geboten sie den S&ouml;hnen Benjamins, indem [sie] sagten: "Geht, und 
ihr sollt euch in den Weing&auml;rten auf die Lauer legen. Und ihr sollt sehen, 
und wenn nun die T&ouml;chter von Silo herauskommen, um im Reigen zu tanzen, so 
sollt ihr aus den Weing&auml;rten hervorkommen und euch mit Gewalt ein jeder aus 
den T&ouml;chtern von Silo seine Frau wegtragen; und ihr sollt in das Land Benjamin 
ziehen.« (Richter 21: 19-21)</LI>
<LI>Den Brautvater durch niedermetzeln seiner Feinde &uuml;berzeugen: »So stand 
David auf, und er und seine M&auml;nner gingen hin und schlugen unter den Philistern 
zweihundert Mann nieder, und David brachte dann ihre Vorh&auml;ute und gab sie dem 
K&ouml;nig vollz&auml;hlig, um sich mit dem K&ouml;nig zu verschw&auml;gern. Darauf gab Saul ihm 
seine Tochter Michal zur Frau.« (1. Samuel 18:27)</LI>
<LI>K&ouml;nig werden, einen Sch&ouml;nheitswettbewerb veranstalten, das sch&ouml;nste M&auml;dchen
mit nach Hause nehmen: »Dann sprachen die Bediensteten des K&ouml;nigs, seine 
Diener: "Man suche f&uuml;r den K&ouml;nig junge Frauen, Jungfrauen, sch&ouml;n von Aussehen,
und der K&ouml;nig bestimme Beauftragte in allen Gerichtsbezirken seines Reiches, 
und sie sollen alle jungen Frauen zusammenbringen, Jungfrauen, sch&ouml;n von Aussehen, 
nach Susa, der Burg, ins Frauenhaus, in die Obhut Hegais, des Eunuchen des K&ouml;nigs, 
des H&uuml;ters der Frauen; und man gebe [ihnen] ihre Massagen. Und die junge Frau, 
die in den Augen des K&ouml;nigs wohlgef&auml;llig erscheint, werde K&ouml;nigin an Waschtis 
Statt." Und die Sache war wohlgef&auml;llig in den Augen des K&ouml;nigs, und er ging daran, 
so zu tun.« (Esther 2: 3-4)</LI>
<LI>Papa mal machen lassen: »Dann ging Simson nach Timna hinab und sah in Timna 
eine Frau von den T&ouml;chtern der Philister. Da ging er hinauf und teilte [es] 
seinem Vater und seiner Mutter mit und sprach: "Da ist eine Frau von den 
T&ouml;chtern der Philister, die ich in Timna gesehen habe, und nun, nehmt sie 
mir zur Frau."« (Richter 14:1-2)</LI>
<LI>Keine Skrupel kennen: »Und es geschah um die Zeit des Abends, da&szlig; sich David 
dann von seinem Bett erhob und auf dem Flachdach des K&ouml;nigshauses umherging;
und vom Flachdach aus erblickte er eine sich badende Frau, und die Frau war 
von sehr gutem Aussehen. Dann sandte David hin und erkundigte sich nach der 
Frau, und man sagte: "Ist das nicht Bathseba, die Tochter Eliams, die Frau 
Urias, des Hethiters?" Danach sandte David Boten, um sie sich zu nehmen. 
Dann kam sie zu ihm herein, und er lag bei ihr, als sie daran war, sich von 
ihrer Unreinheit zu heiligen.« (2. Samuel 11:2-4a)</LI>
</OL>
</FONT><FONT SIZE=-1><CREDITS>Anmerkung: Die Texte aus dem Buch (Einheits&uuml;bersetzung) wurden durch
Verse aus der "Neuen Welt-&uuml;bersetzung der heiligen Schrift" ersetzt. Dabei half
mir das Programm "Bibelforscher".</CREDITS></FONT>
<A NAME="15"></A><H2 align=center><B>
<FONT COLOR="0000FF">V</FONT><FONT COLOR="1100EE">i</FONT><FONT COLOR="2200DD">e</FONT><FONT COLOR="3300CC">r</FONT><FONT COLOR="4400BB"> </FONT><FONT COLOR="5500AA">w</FONT><FONT COLOR="660099">e</FONT><FONT COLOR="770088">n</FONT><FONT COLOR="880077">i</FONT><FONT COLOR="990066">g</FONT><FONT COLOR="AA0055">e</FONT><FONT COLOR="BB0044">r</FONT><FONT COLOR="CC0033"> </FONT><FONT COLOR="DD0022">g</FONT><FONT COLOR="EE0011">e</FONT><FONT COLOR="FF0000">g</FONT><FONT COLOR="EF0000">l</FONT><FONT COLOR="DF0000">&uuml;</FONT><FONT COLOR="CF0000">c</FONT><FONT COLOR="BF0000">k</FONT><FONT COLOR="AF0000">t</FONT><FONT COLOR="9F0000">e</FONT><FONT COLOR="8F0000"> </FONT><FONT COLOR="7F0000">R</FONT><FONT COLOR="6F0000">e</FONT><FONT COLOR="5F0000">i</FONT><FONT COLOR="4F0000">s</FONT><FONT COLOR="3F0000">e</FONT><FONT COLOR="2F0000">a</FONT><FONT COLOR="1F0000">b</FONT><FONT COLOR="0F0000">e</FONT><FONT COLOR="000000">nteuer</FONT><FONT color=#000000>
</FONT></B></H2>
<OL>
<LI>Ein kanadischer Pazifist will aus Angst vor Krieg sein Heimatland gegen
einen friedlichen Flecken Erde tauschen - im M&auml;rz 1882, f&uuml;nf Tage vor der
Invasion der Argentinier, &uuml;bersiedelt er auf die Falklandinseln.</LI>
<LI>»Und f&uuml;r Touristen, die mal m&ouml;glichst weit weg vom Alltag sein wollen,
empfehlen wir eine Safari in Vietnam« (das amerikanische Nachrichtenmagazin
Newsweek anfang der 60er Jahre).</LI>
<LI>Ein Ehepar bucht eine Karibik-Kreuzfahrt, bekommt aber statt der erwarteten
lateinamerikanischen Musik des Abends fast nur Schweizer Volksmusik zu h&ouml;ren
(500 der 600 Passagiere geh&ouml;rten dem Schweizer Verein der Volksmusikfreunde an).
Das Amtsgericht Frankfurt verurteilte den Reiseveranstalter zu 30%
Schadensersatz, da Schweizer Volksmusik nicht zu den Risiken geh&ouml;re, die ein
Urlauber hinzunehmen habe.</LI>
<LI>Besucher des »West County Hotels« im Norden Englands sahen sich 1993 mit der
folgenden Notiz vor der Toilettent&uuml;r konfrontiert: »Due to alterations these
toilets will be closed tomorrow. Please do as much as you can today.«</LI>
</OL>
<A NAME="16"></A><H2 align=center><B>
<FONT COLOR="477782">D</FONT><FONT COLOR="556D78">i</FONT><FONT COLOR="63646E">e</FONT><FONT COLOR="715B64"> </FONT><FONT COLOR="7F525A">Z</FONT><FONT COLOR="8D4950">e</FONT><FONT COLOR="9B4046">h</FONT><FONT COLOR="AA363C">n</FONT><FONT COLOR="B82D32"> </FONT><FONT COLOR="C62428">u</FONT><FONT COLOR="D41B1E">n</FONT><FONT COLOR="E21214">w</FONT><FONT COLOR="F0090A">a</FONT><FONT COLOR="FF0000">h</FONT><FONT COLOR="F30708">r</FONT><FONT COLOR="E70E10">s</FONT><FONT COLOR="DB1518">c</FONT><FONT COLOR="CF1C21">h</FONT><FONT COLOR="C32329">e</FONT><FONT COLOR="B72A31">i</FONT><FONT COLOR="AB313A">n</FONT><FONT COLOR="A03942">l</FONT><FONT COLOR="94404A">i</FONT><FONT COLOR="884753">c</FONT><FONT COLOR="7C4E5B">h</FONT><FONT COLOR="705563">s</FONT><FONT COLOR="645C6C">t</FONT><FONT COLOR="586374">e</FONT><FONT COLOR="4D6A7C">n </FONT><FONT COLOR="477782">Z</FONT><FONT COLOR="233B41">u</FONT><FONT COLOR="000000">f</FONT><FONT COLOR="000000">&auml;</FONT><FONT COLOR="000000">l</FONT><FONT COLOR="000000">l</FONT><FONT COLOR="000000">e</FONT><FONT color=#000000>
</FONT></B></H2>
Mit einem Zufall ist hier ein Ereignis gemeint, da&szlig;, bevor es eingetreten ist,
sehr unwahrscheinlich ist. Davon gibt es Millionen und Milliarden; die folgende
Liste fa&szlig;t also also nicht die zehn unwahrscheinlichsten, sondern die zehn
ausgefallensten Zuf&auml;lle zusammen.<OL>
<LI>Die 5 Kinder Catherine, Carol, Charles, Claudia und Cecilia von Ralph und
Carolyn Cummins aus Clintwood in Virginia erblickten in mehrj&auml;hrigen Abst&auml;nden
zwischen 1952 und 1966 das Licht der Welt, alle am 20. Februar.</LI>
<LI>Zwei nicht verwandte Soldaten werden im ersten Weltkrieg in das gleiche
Lazarett gebracht. Sie sind beide 19 Jahre alt, haben beide eine
Lungenentz&uuml;ndung, kommen beide aus Schlesien, dienen beide als freiwillige in
einer Transportkompanie und hei&szlig;en beide Franz Richter.</LI>
<LI>Am 5 Dezember 1664 sinkt ein Atlantiksegler vor der walisischen K&uuml;ste. Es sind
81 Menschen an Bord, einer davon, mit Namen Hugh Williams, &uuml;berlebt. An einem
anderen 5. Dezember, 120 Jahre sp&auml;ter versinkt ein anderes Schiff mit 60
Passagieren, der einzige &uuml;berlebende hei&szlig;t Hugh Williams. Und als am 5 Dezember
1860 ein weiteres Schiff mit 25 Passagieren sinkt, hei&szlig;t der einzig &uuml;berlebende
Hugh Williams.</LI>
<LI>Eine Mutter aus dem Schwarzwald fotografiert ihren vierj&auml;hrigen Sohn, bringt
den Film nach Stra&szlig;burg zum Entwickeln, kann ihn aber wegen des ersten
Weltkriegs nicht abholen. Zwei Jahre sp&auml;ter kauft sie in Frankfurt einen neuen
Film, um ihre inzwischen geborene Tochter aufzunehmen. Jedoch erweist sich der
Film als doppelt belichtet, die erste Aufnahme zeigt ihren zwei Jahre zuvor
fotografierten Sohn.</LI>
<LI>Ein Monsieur Deschamps erh&auml;lt als Knabe von einem Monsieur de Fontgibu einen
Plumpudding geschenkt. Zehn Jahre sp&auml;ter sieht Deschamps einen Plumpudding in
einem Pariser Restaurant; er will ein St&uuml;ck davon bestellen, aber der
Plumpudding ist bereits bestellt, und zwar von Monsieur de Fontgibu. Viele Jahre
sp&auml;ter wird Deschamps zu einem Plumpudding geladen, wobei er bemerkt, jetzt
fehle nur noch de Fontgibu. Darauf &ouml;ffnet sich die T&uuml;r, und ein uralter
desorientierter Greis tritt ein: Monsieur de Fontgibu. Er hatte sich in der
Adresse geirrt, und war rein zuf&auml;llig in dieses Haus geraten.</LI>
<LI>Ein Mann mit Namen George D. Bryson mietet sich unangemeldet in einem Hotel in
Louisville, Kentucky, ein, findet aber in seinem Zimmer einen Brief adressiert
an George D. Bryson, Zimmer 307. Jedoch war der Brief gar nicht an ihn gerichtet
- der eigentliche Adressat des Briefes, ein George D. Bryson aus Montreal, der
vorher dieses Zimmer hatte, war soeben abgefahren.</LI>
<LI>Ein amerikanischer Soldat, aus dem ersten Weltkrieg heimgekehrt, findet am
Strand von Brooklyn eine angeschwemmte Waschb&uuml;rste - seine eigene, die mehrere
Jahre zuvor mit einem Truppentransporter und zahlreichen Kameraden des Soldaten
nach einem deutschen Angriff dor der franz&ouml;sischen Atlantikk&uuml;ste untergegangen
war.</LI>
<LI>»Abertausende amerikanischer Kinder schreiben in diesen Monaten
unbekannterweise Briefe an die im Persischen Golf eingesetzen US-Soldaten, um
ihnen zu zeigen, da&szlig; man sie in der Heimat nicht vergessen hat«, konnte man
w&auml;hrend des Golfkrieges in der Hannoverschen allgemeinen Zeitung lesen. »Die
Anschrift lautet &uuml;blicherweise `An irgendeinen Soldaten`. Einen solchen Brief
erhielt in Saudi-Arabien der 27-j&auml;hrige Sergeant Rory Lomas aus Georgia. Wie es
der Zufall wollte: Der Brief an irgendeinen Soldaten stammte von Lomas`
zehnj&auml;riger Tochter Cetericka.«</LI>
<LI>Eine aus Tschechien nach Deutschland &uuml;bersiedelte Frau mit Vornamen Janina,
Mutter zweier Kinder, telefoniert mit ihrer Freundin Eva in Prag, Mutter dreier
Kinder, zum zweiten Mal verheiratet. Sie hatte sich verw&auml;hlt, aber die Dame am
anderen Ende der Leitung hei&szlig;t tats&auml;chlich Eva, hat drei Kinder, ist zum zweiten
Mal verheiratet, und eine ihrer Freundinnen namens Janina ist k&uuml;rzlich nach
Deutschland ausgewandert.</LI>
<LI>Carl Zuckmayer findet eine handgemalte Wandtapete, die ihm im &ouml;stereichischen
Exil im Gasthof des Carl Mayr bei Salzburg zum ersten Mal begegnet war, nach
langen Jahren in einer amerikanischen Intellektuellenvilla wieder: »Viele Jahre
nach meiner Flucht aus dem besetzten &ouml;stereich«, schreibt er in <CREDITS>Als
w&auml;rs ein St&uuml;ck von mir</CREDITS>, »wurde ich dr&uuml;ben in Amerika einmal von
Freunden aus meiner Vermonter Farm weggeholt, um einen amerikanischen
Schriftsteller kennenzulernen, der sich einige kleine Autostunden weit in der
Ortschaft des alten, kolonialen Neuenglands angesiedelt hatte.« Nach einer
ausgiebigen Hausbesichtigung und nach langem Dr&auml;ngen Zuckmayers schlie&szlig;t dieser
ein unbeheiztes und deshalb nicht bewohntes letztes Gartenzimmer auf, worin fein
s&auml;uberlich an der Wand verklebt die Originaltapete aus Salzburg h&auml;ngt, »als
h&auml;tte Carl Mayr soeben den letzten Farbtupfen aufgesetzt«.</LI>
</OL>
<A NAME="17"></A><H2 align=center><B>
<FONT COLOR="000000">Z</FONT><FONT COLOR="110000">w</FONT><FONT COLOR="220000">&ouml;</FONT><FONT COLOR="330000">l</FONT><FONT COLOR="440000">f</FONT><FONT COLOR="550000"> </FONT><FONT COLOR="660000">a</FONT><FONT COLOR="770000">u</FONT><FONT COLOR="880000">&szlig;</FONT><FONT COLOR="990000">e</FONT><FONT COLOR="AA0000">r</FONT><FONT COLOR="BB0000">g</FONT><FONT COLOR="CC0000">e</FONT><FONT COLOR="DD0000">w</FONT><FONT COLOR="EE0000">&ouml;</FONT><FONT COLOR="FF0000">n</FONT><FONT COLOR="FF0F00">l</FONT><FONT COLOR="FF1F00">i</FONT><FONT COLOR="FF2F00">c</FONT><FONT COLOR="FF3F00">h</FONT><FONT COLOR="FF4F00">e</FONT><FONT COLOR="FF5F00"> </FONT><FONT COLOR="FF6F00">T</FONT><FONT COLOR="FF7F00">o</FONT><FONT COLOR="FF8F00">d</FONT><FONT COLOR="FF9F00">e</FONT><FONT COLOR="FFAF00">s</FONT><FONT COLOR="FFBF00">f</FONT><FONT COLOR="FFCF00">&auml;</FONT><FONT COLOR="FFDF00">l</FONT><FONT COLOR="FFEF00">l</FONT><FONT COLOR="FFFF00">e</FONT><FONT color=#000000>
</FONT></B></H2>
<DL>
<DT><B>1. Oma sieht Nackten und f&auml;llt tot um</B></DT>
<DD>»Kommen Sie sofort ...«, konnte der Polizist noch sagen, »dann brach sie
zusammen, Herzversagen, Tod.«</DD>
<DT><B>2. Winzer erstickt in Weinbottich</B></DT>
<DD>»Beim Zerstapfen der Trauben ist ein Winzer in Empurany im s&uuml;dfranz&ouml;sischen
Departement Ardeche am Wochenende in einem Weinbottich erstickt ... Der Winzer
war ... vermutlich dem CO² zum Opfer gefallen, das bei der G&auml;hrung der Trauben
entsteht.«</DD>
<DT><B>3. Iltis erschie&szlig;t Kreisrat</B></DT>
<DD>»Einen Rehbock wollte der Hobby-J&auml;ger schie&szlig;en, als er  nachts um drei im
Saebker Wald auf den Hochsitz kletterte. Aber es n&auml;hert sich nur ein Iltis, der
J&auml;ger feuert eine Ladung Schrot, der Iltis bleibt liegen. Um zu sehen, ob das
Tier noch lebt, tippt der J&auml;ger den Iltis mit dem Kolben seiner Doppelflinte
an...«</DD>
<DT><B>4. Todessturz vom Balkon</B></DT>
<DD>»Ein Bremer Schiffsoffizier gab eine Party...in der Wohnung dar&uuml;ber &auml;rgerte
sich der Hausmeister &uuml;ber den L&auml;rm so sehr, da&szlig; er sich &uuml;ber den Balkon beugte,
und eine Tomate an die Fenster des Ruhest&ouml;rer warf.« Dabei verliert er das
Gleichgewicht, und f&auml;llt auf die Stra&szlig;e.</DD>
<DT><B>5. Playboy beim Fensterln abgest&uuml;rzt</B></DT>
<DD>»Beim Fensterln in einer Pension mit h&uuml;bschen Urlauberinnen ist ein
26j&auml;hriger Bayer von der Leiter gefallen ... Der junge Mann galt als der Playboy
von Oberammergau.«</DD>
<DT><B>6. Vom Grabstein erschlagen</B></DT>
<DD>Ein junger Mann aus Glasgow will einen Weg abk&uuml;rzen - &uuml;ber einen Friedhof
unter einem bogenf&ouml;rmigen Grabstein hindurch; der Stein st&uuml;rzt um.</DD>
<DT><B>7. Zechpreller an Schweinshaxe erstickt</B></DT>
<DD>»An dem Tag, den er nicht &uuml;berlebte, hatte der 37j&auml;hrige Horst H. besonders
gro&szlig;en Appetit. Der arbeitslose Verlagsangestellte a&szlig; ... eine legierte
Tagessuppe, eine Poriotn Matjesfilet als Vorspeise, eine Portion
Schweineschulter mit Sauerkraut und Kartoffelp&uuml;ree, einen gro&szlig;en Eisbecher mit
Fr&uuml;chten und Sahne, drei St&uuml;ck Sahnetorte ...« Das zusammen mit sieben Glas
Bier, dann verschwand er durch den Notausgang. Abends in einem anderen Lokal »a&szlig;
er ein gro&szlig;es Schinkenbrot, dann eine krusprige Schweinshaxe ...«. Er
verschluckt sich und erstickt.</DD>
<DT><B>8. Blitz erschl&auml;gt Wurstk&ouml;nig</B></DT>
<DD>»Kurz unter dem Gipfel l&auml;chelte der Wurstmillion&auml;r Hans M&auml;rz (45) ersch&ouml;pft,
aber zufrieden ins Tal hinunter ... Pl&ouml;tzlich scho&szlig; ein Blitz aus den Wolken. Er
schlug direkt auf den Filzhut des st&auml;mmigen Fabrikanten und t&ouml;tete ihn auf der
Stelle.«</DD>
<DT><B>9. Rock-Fan an Kopfverrenkungen gestorben</B></DT>
<DD>»Wieder hat sich ein RockFan vor Begeisterung totgesch&uuml;ttelt ... Der Sch&uuml;ler
Chrostopher Tyrer (15) sch&uuml;ttelte seinen Kopf wie ein Irrer zur superlauten
Musik - bis er zusammenbrach. Gehirnblutung!«</DD>
<DT><B>10. Fallschirmspringer prallen in der Luft zusammen</B></DT>
<DD>Bei einem Schauspringen in Florida prallen zwei Springer beim Fallen
aufeinander, einer wird ohnm&auml;chtig, kann die Rei&szlig;leine nicht ziehen, und st&uuml;rzt
zwei Kilometer in die Tiefe...</DD>
<DT><B>11. Im Wohnzimmer von Auto &uuml;berfahren</B></DT>
<DD>»Beim Fernsehen im Wohnzimmer ist der Amerikaner William Skeen (42) in
Dayton (Ohio) am heiligen Abend von einem Auto get&ouml;tet worden: Der Mann sa&szlig;
gerade auf seinem Sofa, als eine Autofahrerin die Gewalt &uuml;ber ihren Wagen
verlor, und eine Hauswand durchbrach.«</DD>
<DT><B>12. Mit Handy gegen Baum gelaufen</B></DT>
<DD>»Weil ihm beim telefonieren ein Baum im Weg stand, starb der 36j&auml;hrige
Koreaner Kimm Il Song an den Folgen eines ungew&ouml;hnlichen Unfalls.« Herr Song
war, sein Handy haltend, gegen einen Baum gelaufen; er ist kurz darauf in einem
Krankenhaus gestorben.</DD>
</DL>
<A NAME="18"></A><H2 align=center><B>
<FONT COLOR="FFFF00">V</FONT><FONT COLOR="FFEE00">i</FONT><FONT COLOR="FFDD00">e</FONT><FONT COLOR="FFCC00">r</FONT><FONT COLOR="FFBB00"> </FONT><FONT COLOR="FFAA00">a</FONT><FONT COLOR="FF9900">u</FONT><FONT COLOR="FF8800">&szlig;</FONT><FONT COLOR="FF7700">e</FONT><FONT COLOR="FF6600">r</FONT><FONT COLOR="FF5500">g</FONT><FONT COLOR="FF4400">e</FONT><FONT COLOR="FF3300">w</FONT><FONT COLOR="FF2200">&ouml;</FONT><FONT COLOR="FF1100">h</FONT><FONT COLOR="FF0000">n</FONT><FONT COLOR="EF0000">l</FONT><FONT COLOR="DF0000">i</FONT><FONT COLOR="CF0000">c</FONT><FONT COLOR="BF0000">h</FONT><FONT COLOR="AF0000">e</FONT><FONT COLOR="9F0000"> </FONT><FONT COLOR="8F0000">S</FONT><FONT COLOR="7F0000">e</FONT><FONT COLOR="6F0000">l</FONT><FONT COLOR="5F0000">b</FONT><FONT COLOR="4F0000">s</FONT><FONT COLOR="3F0000">t</FONT><FONT COLOR="2F0000">m</FONT><FONT COLOR="1F0000">o</FONT><FONT COLOR="0F0000">r</FONT><FONT COLOR="000000">de</FONT><FONT color=#000000>
</FONT></B></H2>
<OL>
<LI>Ein Arbeiter aus Trstnik s&auml;gt sich mit einer Kreiss&auml;ge selbst den Kopf ab.</LI>
<LI>Eine junge Frau aus Melbourne erschie&szlig;t sich in einem Leichenschauhaus.
»Mein Tod soll nicht allzuviele Schwierigkeiten machen«, steht in ihrem
Abschiedsbrief...</LI>
<LI>Ein arbeitsloser Kranf&uuml;hrer aus Hamburg sprengt sein Haus in die Luft, l&auml;uft
in ein nahes Gartenh&auml;uschen, trinkt eine Flasche Pflanzengift, legt sich eine
Drahtschlinge um den Hals, und als sich diese zuzieht, schie&szlig;t er sich noch eine
Kugel in den Kopf. (Coool :-))</LI>
<LI>Nach zehn erfolglosen Selbstmordversuchen sprengt sich der &ouml;stereicher Anton
Kohlberger auf einer Polizeiwache in Lynz mit Dynamit in die Luft.</LI>
</OL>
<A NAME="19"></A><H2 align=center><B>
<FONT COLOR="00FF00">S</FONT><FONT COLOR="00EB00">i</FONT><FONT COLOR="00D700">e</FONT><FONT COLOR="00C400">b</FONT><FONT COLOR="00B000">e</FONT><FONT COLOR="009C00">n</FONT><FONT COLOR="008900"> </FONT><FONT COLOR="007500">t</FONT><FONT COLOR="006200">&ouml;</FONT><FONT COLOR="004E00">d</FONT><FONT COLOR="003A00">l</FONT><FONT COLOR="002700">i</FONT><FONT COLOR="001300">c</FONT><FONT COLOR="000000">h</FONT><FONT COLOR="001200">e</FONT><FONT COLOR="002400"> </FONT><FONT COLOR="003600">S</FONT><FONT COLOR="004800">p</FONT><FONT COLOR="005B00">o</FONT><FONT COLOR="006D00">r</FONT><FONT COLOR="007F00">t</FONT><FONT COLOR="009100">u</FONT><FONT COLOR="00A300">n</FONT><FONT COLOR="00B600">f</FONT><FONT COLOR="00C800">&auml;</FONT><FONT COLOR="00DA00">l</FONT><FONT COLOR="00EC00">l</FONT><FONT COLOR="00FE00">e</FONT><FONT color=#000000>
</FONT></B></H2>
<OL>
<LI>Ein 54j&auml;hriger Angler sitzt seit Stunden am Ufer. Vom Herbststurm aufgeweicht
bricht pl&ouml;tzlich die B&ouml;schung weg, der Mann rutscht ab und ertrinkt.</LI>
<LI>Mit viel Schwung wirft ein Sportfischer seine Angelsehne aus. Diese wickelt
sich um eine Hochspannungsleitung - Stromschlag, exitus.</LI>
<LI>W&auml;hrend eines Fu&szlig;ballspiels in Oldenburg ger&auml;t einem 22j&auml;hrigen Spieler ein
Kaugummi in die Luftr&ouml;hre - er erstickt.</LI>
<LI>Ein Schiedsrichter wird von einem umfallenden Tor erschlagen.</LI>
<LI>Ein 48j&auml;hriger Oberstudienrat legt sein Gewehr auf einem Schie&szlig;stand ab. Eine
Windb&ouml;e bl&auml;&szlig;t die Pappscheibe gegen die Waffe, darauf l&ouml;&szlig;t sich ein Schu&szlig;,
durchsl&auml;gt den Hals des Sch&uuml;tzen.</LI>
<LI>Ein 26j&auml;hriger Fu&szlig;ballspieler springt hoch, um einen Flankenball ins Tor zu
k&ouml;pfen, kollidiert mit dem gegnerischen Torwart, bricht sich den obersten
Halswirbel, und durchtrennt seine Arterie.</LI>
<LI>Ein Hobbytaucher mi&szlig;achtet die Gebrauchsanweisung s&uuml;r seine Sauerstofflasche.
Er l&auml;&szlig;t sich in eine Tiefe absinken, wo wegen der niedrigen Temperaturen das
Kondenswasser im Lungenautomaten gefriert, der Taucher erstickt.</LI>
</OL>
<HR WIDTH=50%>
<P>Ich hoffe, ihr konntet auch ab und zu mal lachen, und sage tsch&uuml;&szlig;...</P>
<CENTER><A HREF="mitglieder/castro.html"><IMG SRC="thesaint2.gif" border=0 width=142 height=51 alt="The Saint, Gif, 142x51, Gr&ouml;&szlig;e ca. 2.5 KB, Link zur Mitgliederliste."></A></CENTER><BR><CENTER><FONT SIZE=1 >Markus Castro</FONT></CENTER></P><P><CENTER><A HREF="NoCover.html"><IMG SRC="l_hauptinhalt.jpg" width=320 height=50 border=0 alt="Hauptinhalt, JPG, Link zur NoCover, 639x99, Gr&ouml;&szlig;e ca. 30 KB"></A></CENTER></P>
<SMALL>PS: Wehe mir kommt jetzt irgendwer mit diesem "Hausfrauen" Mist!</SMALL>
</BODY></HTML>