<html>
<head>
<title>Network PC </title>
</head>
<body background="indypattern.gif">

<center>
<h1><font color="white">Network PC von Weird Science</font></h1>
</center>
<font color="khaki">
<table width="100%">
<tr>
    <td><i> best viewed with IBrowse (at 800x600x24)<p></i> </td>
    <td align="right"><i>ein Test vom <a href="mitglieder/cschmidt.html">Indy</a><p><p></i></td>
</tr>
</table>
</i>
<p>
<p>
<b><font color="gold">
Vorwort
</b>
</font>
<p>
Leider ist es in der heutigen Zeit so, da&szlig; der Amiga im Berufsleben keinerlei Rolle mehr spielt und statt
dessen der PC allgegenw&auml;rtig ist. Wer nun auch noch wie ich in dem Bereich der Informationstechnik eine
Ausbildung beginnen m&ouml;chte, hat &uuml;berhaupt keine Alternative mehr zum PC. So geschah es nun, da&szlig; auch ich mir
einen PC zulegen mu&szlig;te. Da mir aber von vornherein klar war, da&szlig; ich den Amiga weiterbenutzen werde und relativ
wenig Platz in meinem Zimmer habe, mu&szlig;ten beide Systeme nat&uuml;rlich miteinander vernetzt werden. Dazu benutze
ich die Softwarel&ouml;sung "Network PC" von Weird Science. Desweiteren kommt noch ein Monitor- und
Tastaturumschalter zum Einsatz, um Monitor sowie Tastatur des PCs auch mit dem Amiga nutzen zuk&ouml;nnen.
<p><font color="gold"><b>
Aber nun zum Test...
</font></b>
<p>
F&uuml;r die Vernetzung von PC und Amiga bieten sich im gro&szlig;en und ganzen 3 verschiedene M&ouml;glichkeiten an:
<p>
<dl>
<dd>- Datenaustausch &uuml;ber Floppydisks&nbsp;&nbsp;(zu langsam und unbequem)
<dd>- Netzwerkkarten&nbsp;&nbsp;(zu teuer)
<dd>- Verbindung &uuml;ber Parallelkabel&nbsp;&nbsp;(Mischung aus beidem ;-))
</dl></P>
<p>
Ich habe mich f&uuml;r letztere L&ouml;sung entschieden. Sie hat nicht nur den Vorteil, ziemlich billig zu sein,
sondern sie ist auch relativ schnell - allerdings bei weitem nicht so schnell wie eine Verbindung beider
System via Netzwerkkarten.<p>
Lange Rede kurzer Sinn: Ich habe mich f&uuml;r die Software "Network PC" von Weird Science entschieden. Diese
kostet bei Oberland 59,- DM (plus 10DM f&uuml;r Versand und 3DM Nachnahme). Die Lieferzeit hielt sich mit 2
Wochen diesmal in Grenzen (f&uuml;r Amiga Software...). Auf meine CV64/3D zum Beispiel, mu&szlig;te ich &uuml;ber 4 Wochen
warten.<p>
Nachdem nun das P&auml;kchen angkommen war, offenbarte sich mir folgender Inhalt:
<p>
<ol>
<li>1 sch&ouml;ne bunte Schachtel wiederum mit folgendem Inhalt:
<li>&nbsp;&nbsp;&nbsp;&nbsp;1 Verbindungskabel (parallel)
<li>&nbsp;&nbsp;&nbsp;&nbsp;2 Disketten (eine f&uuml;r Amiga und eine f&uuml;r PC)
<li>&nbsp;&nbsp;&nbsp;&nbsp;1 CD mit Tools
</ol>
<p><font color="gold"><b>
Die Installation
</font></b>
<p>
Nachdem man beide Rechner &uuml;ber das mitgelieferte Parallelkabel miteinander vernetzt hat, mu&szlig;
die n&ouml;tige Software installiert werden, was auf beiden Rechnern relativ problemlos m&ouml;glich war. Da das Parallelkabel
die Pallelports beider Rechner belegt, sollte man zumidest einen "Mehrfachverteiler" f&uuml;r Parallelports sein eigen nennen,
um nicht bei jedem noch so kleinem Ausdruck die Kabel umst&ouml;bseln zum&uuml;ssen. Ich benutze dazu die Arxxon
Switchbox.
<p>
<p>
<font color="gold"><b>
Der Betrieb der Software
</font> </b>
<p>
Nachdem man nun, die ansonsten recht simple, Installation auf beiden Systemen hinter sich gebracht hat, kann
man sogleich die Software benutzen. Dabei sollte man jedoch beachten, das der Datentransfer nur in eine
Richtung erfolgen kann. U.z. vom Amiga zum PC, d.h. man kann mit dem Amiga ganz normal auf die Laufwerke
des PC's zugreifen, nicht aber umgekehrt mit dem PC auf die Amigalaufwerke. Positiv dagegen fiel die
Unterst&uuml;tzung langer Dateinamen unter Windows95/98 auf.
<p>
Die Geschwindigkeit bei dieser Methode der Vernetzung beider Computer ist erwartungsgem&auml;&szlig; eher gering, aber
f&uuml;r kleinere Transfers unterhalb der 2MB Grenze noch ertr&auml;glich. Der eben genannte Transfer dauert ca.
2 Minuten. Bei 5 Durchl&auml;ufen des mitgelieferten Speed-Testers ergaben sich folgende Ergebnisse:
<p>
(bei Zugriff auf eine beliebige Festplattenpartition des PCs)
<p>
<table align="right" border="0" bgcolor="gray">
<tr align="center">
    <td><font color="brown"> Writing <br>Maximale Geschwindigkeit</font></td>
    <td><font color="brown"> Reading <br>Maximale Geschwindigkeit</font></td>
</tr>
<tr align="center">
    <td> 21 kB/s </td>
    <td> 11 kB/s </td>
</tr>
<tr align="center">
    <td> 25 kB/s </td>
    <td> 13 kB/s </td>
</tr>
<tr align="center">
    <td> 25 kB/s </td>
    <td> 13 kB/s </td>
</tr>
<tr align="center">
    <td> 38 kB/s </td>
    <td> 19 kB/s </td>
</tr>
<tr align="center">
    <td> 21 kB/s </td>
    <td> 11 kB/s </td>
</tr>
</table>
<br>
<br>
An diesen Werten l&auml;sst sich ganz gut erkennen, da&szlig; die &Uuml;bertragungsraten nicht unbedingt als stabil zu bezeichnen sind.
<p>
Eine (kleine) Kuriosit&auml;t fiel mir auf der PC Seite auf: Jedesmal nach Start des NetworkPC Programms war der
Prozessor des PC zu 100% ausgelastet - egal ob Daten &uuml;bertragen wurden oder nicht. Ob dies an der Software
selbst liegt oder aber am Betriebssystem des PCs, wei&szlig; ich allerdings nicht.
<p>
Der Vollst&auml;ndigkeit halber sei erw&auml;hnt, da&szlig; Network PC, wenn es einmal gestartet ist, unsichtbar im
Hintergrund seine Arbeit verichtet. Da es ein Commidtiy ist, kann es jederzeit mit Exchange Aktiviert/
Deaktiviert werden.<p>
<img src="exchange.gif">
<p>
Hier ein kleines Bild der Oberfl&auml;che von NetworkPC
<p>
<img src="network.gif">
<p><font color="gold"><b>
Die Zusatztools
</font></b>
<p>
Auf der Installations Diskette f&uuml;r den Amiga befindet sich der Dateimanager SID in der Version 2, allerdings
lie&szlig; er sich nicht zu einem Start &uuml;berreden. Auch der oben benutzte Speedtester ist auf der Disk enthalten.
Auf der mit 631MB gef&uuml;llten CD befinden sich Tools f&uuml;r Amiga und PC (das &uuml;bliche halt: Tools wie Datenbanken,
Dateimanager, verschiedene Grafik und Musik Tools usw.). Besonders aufgefallen ist
mir bei den PC Programmen der Amiga Emulator UAE. Leider liegt ein einer total veralteten Version vor und weist
deshalb auch noch sehr viele Fehler auf. Desweiteren sind noch die Spiele PD Serie "Assasins" und einige alte
ECS Grafikdemos im UAE tauglichen ADF-Format enthalten.<br>
Fazit: Auf der CD ist im Prinzip nichts gro&szlig;artiges drauf, eine nette Zugabe ist sie aber allemal.
<p>
<p><font color="gold"><b>
Gesammt Fazit:
</font></b>
<p>
Ich benutze Network PC nun schon seit gut 5 Wochen und konnte noch nie einen Absturz, der auf das Programm
zur&uuml;ck zuf&uuml;hren w&auml;re, provozieren. Die &Uuml;bertragungsraten sind wie gesagt nicht weltbewegend aber meines
Erachtens nach f&uuml;r die meisten User (wie auch f&uuml;r mich) wohl ausreichend.
<p>
Wertung (nach Schulnotensystem)
<p>
<table border="0" bgcolor="gray">
<tr>
    <td> Anleitung: </td>
    <td> &nbsp;&nbsp;1&nbsp;&nbsp;  </td>
    <td>  </td>
</tr>
<tr>
    <td> Benutzerfreundlichkeit: </td>
    <td> &nbsp;&nbsp;3&nbsp;&nbsp; </td>
    <td> (f&uuml;r Leute die kein Englisch k&ouml;nnen (gibt's &uuml;berhaupt welche?) liegen keine deutschen Lokalisierungsdateien vor) </td>
</tr>
<tr>
    <td> Installation: </td>
    <td> &nbsp;&nbsp;2&nbsp;&nbsp; </td>
    <td>  </td>
</tr>
<tr>
    <td> Gesammt: </td>
    <td> &nbsp;&nbsp;2&nbsp;&nbsp; </td>
    <td> (insgesammt ergibt sich ein recht guter Eindruck - die Software h&auml;lt was sie verspricht) </td>
</tr>
</table>
<p><br><br><hr><br><br><p>
<b><font color="gold">Anhang:</font></b>
<p>
Benutzte Computer:
<table bgcolor="gray">
    <tr>
        <th></th>
        <th>Amiga</th>
        <th>PC</th>
    </tr>
    <tr>
        <td>Prozessor:</td>
        <td>68030 50Mhz</td>
        <td>Intel Celeron 333Mhz</td>
    </tr>
    <tr>
        <td>RAM Speicher:</td>
        <td>16 (Fast) + 2 (Chip)</td>
        <td>64MB</td>
    </tr>
    <tr>
        <td>Betriebssystem:</td>
        <td>AmigaOS3.1</td>
        <td>Windows89</td>
    </tr>
</table>
</font>

</body>
</html>
