<html>
<head>
<meta name="description" content="Wolf-INFO">
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="wol1.jpg" text=black link=blue bgcolor="#FFFFEE">
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" width="100%" bgcolor="#808080"><font
color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td>
</tr>
</table>

<table border="0" cellpadding="3" cellspacing="3" width="100%">
<tr>
<td valign="top" bgcolor="#808080"><font color="#000080"><b>Inhalt</b></font>
<p><a href="#a1"><font size="1" face="arial">5 Jahre NoCover
</font></a></p>
<p><a href="#a2"><font size="1" face="arial">Sonderzeichen
</font></a></p>
<p><a href="#a3"><font size="1" face="arial">NoCover Index
</font></a></p>
<p><a href="#a4"><font size="1" face="arial">Feedback
</font></a></p>

<p><center> <a href="mitglieder/zimmer.html">
<img src="st_wolfinfo.jpg" width=100 height=100 border=0></a><br><br><br>
<font size="2"> eMail: </font> <a href="mailto:wozim@t-online.de">
<font size="1" face="arial">wozim@t-online.de</font></a>
</center></p>
<p><a href="NoCover.html#a14"><font size="1" face="arial">Zur&#252;ck zum NoCover-Index
</font></a></p>
</td>
<td valign="top">
<a name="a1"><font color="800000" size="7"><center>
<b>F&#252;nf Jahre NoCover </font></b></a></center><br>
<p><font size="+1">
Wer von mir hier an dieser Stelle nun eine Vergangenheitsbew&#228;ltigung erwartet, sieht
sich get&#228;uscht. Das h&#228;tte ich in der vorigen NC ausgiebig tun k&#246;nnen, f&#252;hlte mich
aber nicht in ausreichendem Ma&#223;e kompetent, da wir z.Zt. Mitglieder haben, die fast von Anfang
an mit dabei sind.
</p>
<center><a href="st_wi1g.jpg" width=279 hight=272>
<img src="st_wi1.jpg" width=140 height=136 border=0 alt="Illusion 1"></a>
<a href="st_wi2g.jpg" width=279 hight=247>
<img src="st_wi2.jpg" width=140 height=136 border=0 alt="Illusion 2"></a>
<br><tt>(Durch Anklicken erscheinen sie doppelt so gro&#223;!)</tt>
</center>
<p>
So schaue ich mir lieber diese beiden Bildchen an und &#252;berlege vehement, welches dieser
beiden am N&#228;hesten den Charakter der Nocover interpretiert, wobei ich keinesfalls behaupten
will, dass die NoCover eine optische T&#228;uschung ist.</p></font></td></tr></table>

<p><font size="+1">
Ist es das Belv&#233;d&#232;re von Escher, das die r&#228;umliche Tiefe versinnbildlicht, egal aus
welcher Perspektive wir die Betrachtung ansetzen? Ist es die Unendliche Geschichte in
Form des Dreieckes, das die Gedanken in Verwirrung und Wallung bringen kann?</p>

<p>Der Schein tr&#252;gt! Darauf beruhen optische T&#228;uschungen. Wir meinen damit, dass wir die
Dinge im Allgemeinen anders sehen, als sie in Wirklichkeit sind. Unser Hirn ver&#228;ndert
das physikalische Bild. Denken wir z.B. an Perspektive und r&#228;umliche Tiefe. Aber gerade
diese Intepretationen unseres Gehirns ist auch der Grund daf&#252;r, dass unsere Augen tr&#252;gen
k&#246;nnen. Wie sich das im einzelnen abspielt, ist schwer zu erkl&#228;ren. Wir wissen es nicht genau.
Aber wir wissen, dass ein stehender Baum gr&#246;&#223;er erscheint als ein liegender, ein heller
Gegenstand gr&#246;&#223;er als ein dunkler, dass ebene Fl&#228;chen eine dritte Dimension aufzuweisen
scheinen, und so weiter.</p>
<p>Die Faszination liegt immer in der &#252;berraschenden neuen Perspektive, die es zu finden gilt.
Und wenn wir diese Erkenntnis auf die NoCover umsetzen, dies alles beherzigen, selbst
wieder zum Griffel greifen und unsere Erkenntnisse, Erg&#252;sse, Assays und pers&#246;nliche
Meinungen wieder niederschreiben und nicht darauf warten, was andere schreiben werden,
dann sehe ich wieder einen gro&#223;en Hoffnungsschimmer &#252;ber dem Horizont auftauchen.</p></font>
<a href="#top">Gehe zu Anfang </a>
<hr>
<a name="a2"><font color="800000" size="7"><center>
<b>Sonderzeichen </font></b></a></center><br>
<table width=100% border=0 cellpadding=12>
<tr><td>
<img src="st_wi3.gif" width=289 hight=302 border=0 align=left alt="ASCII-Sonderzeichen">
</td><td valign=top><font size="+1">
In der letzten Wolf-INFO habe ich die Aufstellung der ASCII-Zeichen 160 bis 255 sowohl
als numerischer Wert wie auch als Namenswert in listenform dargestellt. In diesem
Schaubild kann auf engstem Raume nochmals alle darstellbaren Sonderzeichen nachgeschaut
werden ohne dass die lange Tabelle wiederum bem&#252;ht werden muss. In diesem Schaubild
ist allerdings nur der numerische ASCII-Wert ablesbar.</font></td></tr></table>
<a href="#top" align=left>Gehe zu Anfang </a>
<hr>
<a name="a3"><font color="800000" size="7"><center>
<b>NoCover-Index </font></b></a></center><br>
<p><font size="+1">
Das direkte Ansteuern auf die Clubhomepage hat sich etwas ge&#228;ndert und lautet nun
folgenderma&#223;en:<br><center>
<a href="http://www.chiemgau.com/apc&amp;tcp/nocover.html"> http://www.chiemgau.com/apc&amp;tcp/nocover.html
</a></center></p>
<p>Der Name meiner Homepage bei T-Online hat sich nicht ge&#228;ndert. Auch hier ist der
NoCover-Index immer auf dem neuesten Stand downloadbar.</p></font>
<a href="#top">Gehe zu Anfang </a>
<hr>
<a name="a4"><font color="800000" size="7"><center>
<b>Feedback </font></b></a></center><br>
<p><font size="+1">
Meinen Feedback zur NC-60 werde ich hier nicht wiederholen, da ich in meinem Leserbrief
schon ausgiebig dar&#252;ber geschrieben habe. Beim nochmaligem Durchlesen der NoCover fiel
mir der Passus von Thomas Windecker in seinem Leserbrief an alle auf, wo er auffordert
mehr Feedback von sich zu geben. In diesem Zusammenhang habe ich beim besten Willen nicht
begriffen, warum Thomas W. Feedback lesen will, selbst sich aber mit keiner Silbe dar&#252;ber
&#228;u&#223;ert, was ihm gefallen hat. Bevor ich mich nun in Mutma&#223;ungen vergallopiere
und eventuell auf falschen Fu&#223;e Hurra schreie, beende ich hier lieber diese Zeilen.
</font></p>
<hr>
<center>
<table border="0" width=100% bgcolor="#808080"><tr><td>
<br>
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
<br><br>Gehe &#160; <a href="#top"> zum Anfang </a><br>
oder &#160; <a href="NoCover.html#a14"> zum NoCover-Inhaltsverzeichnis </a><br>
</table></center><br>
</body>
</html>
