<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Neues zum AmigaNG</H1>
<H2>1. Neues Executive Update von AMIGA-Pr&auml;sident Bill McEwen</H2>
<P><B>&raquo;Bill McEwen - 23. Dezember 2000</B></P>
<P><B>Executive Update - R&uuml;ckblick</B></P>
<P>
Frohe Weihnacht und ein gl&uuml;ckliches Neues Jahr Ihnen allen!
</P>
<P>
Toll, wir waren doch eine gl&uuml;ckhafte Gesellschaft dieses Jahr! Am 27.
Dezember 1999 erzielten wir unsere Vereinbarung mit Gateway und am 3.
Januar 2000 war unser erster Arbeitstag.
</P>
<P>
In einem Jahr konnten wir die Aktualisierung zum AmigaOS (3.9, zusammen mit
unserem Partner Haage und Partner) herausgeben, wir haben das SDK f&uuml;r das
neue AmigaDE (Digital Environment) angek&uuml;ndigt und zwei Versionen davon
heraus gegeben, wir haben die Spezifikationen f&uuml;r den AmigaOne
ver&ouml;ffentlicht und zwei Partner bekannt gegeben, die diese neuen Maschinen
bauen werden (bPlan und Eyetech).
</P>
<P>
Wenn wir auf diese letzten 12 Monate zur&uuml;ck blicken, sehen wir doch eine
ganze Zahl Lektionen, die wir lernen mussten, und mit diesen Erfahrungen
gehen wir weiter in das Jahr 2001 mit einem klaren Ausblick und zahlreichen
neuen Ank&uuml;ndigungen und Gesch&auml;ften. Ja, die Consumer Electronics Show in
Las Vegas wird ein gro&szlig;es Vergn&uuml;gen f&uuml;r alle Amiga-Freunde in der ganzen
Welt sein, denn genau dort wird die &uuml;brige Welt beginnen zu erfahren, was
Sie schon wissen! :-)
</P>
<P>
In dieser Zeit der Erinnerung und des Dankes wollen wir auch unserer
Freunde gedenken, die wir verloren haben. Coz, Bop Cosby, wird sehr
vermisst und wir denken an ihn und beten t&auml;glich f&uuml;r seine Frau Marsha. Es
war ein sehr ern&uuml;chterndes Ereignis f&uuml;r AMIGA und es half uns daran zu
denken, das es die Familie ist, die Amiga auszeichnet. Wir erwarten, dass
wir dieses Jahr viele Mitglieder zur Amiga-Familie hinzu gewinnen k&ouml;nnen.
</P>
<P>
Dieses Jahr war aber auch in anderer Hinsicht schwer f&uuml;r uns: Die
Verfassung des Aktienmarkts beeintr&auml;chtigte deutlich unsere Bem&uuml;hungen,
Kapital aufzunehmen, mit dem wir unsere Pl&auml;ne beschleunigen wollten, und
viele von uns hatten finanzielle H&auml;rten zu &uuml;berstehen, um den Traum Amiga
Wirklichkeit werden zu lassen. Das Team AMIGA steht zusammen und strebt
diesem neuen und aufregenden Jahr entgegen.
</P>
<P>
Ich m&ouml;chte allen und jedem von Ihnen f&uuml;r Ihre andauernde Unterst&uuml;tzung und
daf&uuml;r, dass sie mit uns an einem Strang ziehen, herzlich danken.
</P>
<P><B>Wir sind wirklich eine ganz besondere Gesellschaft!</B></P>
<P>
Ganz pers&ouml;nlich m&ouml;chte ich allen ein ganz fr&ouml;hliches Weihnachtsfest und ein
sehr gl&uuml;ckliches Neues Jahr w&uuml;nschen!
</P>
<P><B>Gottes Segen,</B></P>
<P>
&gt;&lt;&gt; Bill McEwen &gt;&lt;&gt; Pr&auml;sident CEO Amiga, Inc, <A HREF="mailto:bill@amiga.com.">bill@amiga.com.</A>&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<BR>
(Quelle des Originals: AMIGA, Inc.)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
