<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Neuigkeiten von Haage &amp; Partner</H2>
<P><B>Haage &amp; Partner (<A HREF="http://www.haage-partner.com" TARGET="_top">http://www.haage-partner.com</A>) informiert:</B></P>
<H3>&raquo;04. Dezember 2000: Genesis-Ger&uuml;chte</H3>
<P>
Heute fr&uuml;h wurde eine Meldung verbreitet, in der wir &ouml;ffentlich beschuldigt
wurden, keine Lizenz f&uuml;r Genesis zu besitzen. Im August diesen Jahres
erwarben wir vom englischen Hersteller Active Technologies die
entsprechende Lizenz, was wir auch in einer &ouml;ffentlichen Ank&uuml;ndigung
mitteilten. Umso erstaunlicher ist es nun diese Aktion, kurz vor dem
Verkaufsstart von OS3.9
</P>
<H3>06. Dezember 2000: AmigaOS 3.9 Details</H3>
<P>
Seit gestern gibt es auf unseren OS 3.9-Seiten eine ausf&uuml;hrliche Liste der
neuen Funktionen von OS 3.9, neue Bilder und die Liste der Personen, die an
der Entwicklung, der &Uuml;bersetzung und dem Test beteiligt waren.
</P>
<H3>14. Dezember 2000: WOA 2000 R&uuml;ckblick</H3>
<P>
Mittlerweile d&uuml;rften alle Beteiligten von der Messe wohlbehalten
zur&uuml;ckgekehrt sein; auch wir sind seit Montag Nachmittag wieder vollz&auml;hlig
und haben bereits die Computer wieder aufgebaut. Die Auslieferung von
Vorbestellungen (haupts&auml;chlich OS 3.9) und Bestellungen von der Messe ist
in vollem Gange. Wir bitten in einigen F&auml;llen um etwas Geduld, wenn es
etwas l&auml;nger dauert - wir tun, was wir k&ouml;nnen...
</P>
<P>
Auch diese Messe war gepr&auml;gt von netten Begegnungen mit der Amiga-
Anwenderschaft. Verkaufsgespr&auml;che, Supportfragen und der pers&ouml;nliche
Austausch standen im Vordergrund. An erster Stelle m&ouml;chten wir den Helfern
und dabei besonders dem Amiga-Club f&uuml;r die Webcam und den Chat danken. Dank
aber auch an die H&auml;ndler und Aussteller, die, trotz der kurzen Zeit, f&uuml;r
das umfangreiche Angebot und die Neuheiten gesorgt haben, ohne die die
Messe nicht so interessant geworden w&auml;re.
</P>
<P>
Insgesamt &auml;u&szlig;erte man sich zufrieden mit der Messe und wir sind froh, da&szlig;
unser erster Gehversuch in dieser Richtung weitgehend reibungslos verlaufen
ist.
</P>
<P>
Mittlerweile sind einige Berichte und Fotosammlungen online. Auf amiga-
news.de ist eine sch&ouml;ne Zusammenfassung von Petra Struck, mit
Informationen, Bildern und weiteren Links, daher wollen wir an dieser
Stelle darauf verweisen.
</P>
<H3>15. Dezember 2000: Deutscher Supportbereich er&ouml;ffnet</H3>
<P>
Seit gestern ist auch ein deutscher Bereich f&uuml;r die Registrierung und den
Support von OS 3.9 bei H&amp;P online. Die Seiten auf amiga.com lassen derzeit
leider keinen echten deutschsprachigen Bereich zu, daher haben wir uns
entschlossen dies direkt bei uns zur Verf&uuml;gung zu stellen.
</P>
<P>
Frohe Weihnachten...
</P>
<P>
Das Team von Haage&amp;Partner w&uuml;nscht allen AMIGA-Fans ein sch&ouml;nes
Weihnachtsfest und einen
</P>
<P><B>... guten Rutsch ins Neue Jahr!</B></P>
<P>
In der Zeit vom 25. Dezember 2000 bis zum 7. Januar 2001 ist unser B&uuml;ro
geschlossen. Ab Montag den 8. Januar stehen wir Ihnen dann wieder mit Rat
und Tat zur Verf&uuml;gung.
</P>
<P>
Der OS 3.9-Support ist in dieser Zeit nur am 27. und 28. Dezember von 16 -
18 Uhr erreichbar.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
