<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
An der letzten Ausgabe unseres Gewinnspiels haben 32 Leser teilgenommen.
Bitte denkt diesmal wieder an die Teilnahme. Ihr wisst ja, dass ihr bereits
mit zwei Antworten gewinnen k&ouml;nnt.
</P>
<P><B>Jetzt zur Aufl&ouml;sung:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Standard-Frage:&nbsp;</TD><TD VALIGN="TOP">In diesem Monat findet (bzw. fand) in Deutschland eine&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Amiga-Messe statt. Unter welcher Bezeichnung wird (bzw.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">wurde) sie veranstaltet?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Die richtige L&ouml;sung lautet &raquo;World of Amiga&laquo;.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<br>
<TR><TD VALIGN="TOP">Master-Frage:&nbsp;</TD><TD VALIGN="TOP">Im Jahr 2000 gab es bereits eine andere deutsche Amiga-Messe.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Gesucht sind Austragungsort und -monat.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Im Juni wurde in der Stadt Neuss die &raquo;World of Alternatives&laquo;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">veranstaltet.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<br>
<TR><TD VALIGN="TOP">Meinungsfrage:&nbsp;</TD><TD VALIGN="TOP">In den letzten Jahren wurden die deutschen Amiga-Messen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">jeweils im Rheinland ausgetragen. Sollte das so bleiben oder&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">favorisierst du einen mehr in der Mitte Deutschlands&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">gelegenen Ort?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">1 (Die Messen sollten weiterhin im Rheinland ausgetragen werden.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">16&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Die Messen sollten in der Mitte Deutschlands ausgetragen werden.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">13&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Drei Teilnehmer beantworteten die Meinungsfrage nicht.
</P>
<P>
Einige Einsender hatten zu ihrer Beantwortung der Meinungsfrage Stellung
bezogen:
</P>
<P>
Kai Stegemann ist f&uuml;r das Rheinland, merkt allerdings an: &raquo;Wenn die anderen
es w&uuml;nschen, k&ouml;nnte ich mir aber als guten Kompromiss den Standort
Frankfurt/Main vorstellen.&laquo;
</P>
<P>
André Beer w&uuml;rde eine Amiga-Messe etwa in der Mitte Deutschlands
bevorzugen: &raquo;Das ist allerdings eine subjektive Einsch&auml;tzung von mir, da
ich dann einen wesentlich k&uuml;rzeren Anfahrtsweg h&auml;tte. Am liebsten w&auml;re mir
nat&uuml;rlich auch, wenn Amiga wieder so bedeutend w&uuml;rde, da&szlig; sie auch auf der
CEBIT ausstellen - ich denke also an Hannover...&laquo;
</P>
<P>
Jean Holzammer ist ebenfalls von einer langen Anreise betroffen: &raquo;Ich
selbst fahr nur alle drei Jahre auf eine Amiga-Messe. Denn nach K&ouml;ln bin
ich von hier (Ostbayern) aus einfach 5 Stunden unterwegs. Bei den zuletzt
gew&auml;hlten Standorten (Media-Center/K&ouml;ln, Stadthalle Neuss) ist es noch
deutlich mehr, so da&szlig; f&uuml;r den eigentlichen Messebesuch nur vier bis f&uuml;nf
Stunden zur Verf&uuml;gung stehen. Da rentiert es sich nicht mehr, &uuml;berhaupt
hinzufahren. Ein zentraler gelegener Standort, der von &uuml;berall leicht zu
erreichen ist, w&auml;re zum Beispiel Frankfurt. Aber man k&ouml;nnte auch rotieren.
Ein Jahr in K&ouml;ln, was gut f&uuml;r die Leute aus Westdeutschland und den
Niederlanden ist, beim n&auml;chsten Mal dann halt in Berlin oder Leipzig, also
optimal f&uuml;r die Ostdeutschen. Und dann auch mal in M&uuml;nchen, gut f&uuml;r die
&Ouml;sterreicher, Bayern, Schweizer, Baden-W&uuml;rttemberger und S&uuml;dtiroler.&laquo;
</P>
<P>
Elmar Steup merkt an: &raquo;Vielleicht auch mal 'ne Messe im Norden...?&laquo;
</P>
<P>
&raquo;Die Messen sollten etwa in der Mitte Deutschlands ausgetragen werden.&laquo;
meint Denis Zwornarz und f&uuml;gt hinzu: &raquo;Das sollte im Prinzip kein allzu
gro&szlig;es Problem sein, da kein sehr gro&szlig;es Messegel&auml;nde ben&ouml;tigt wird
(leider...).&laquo;
</P>
<P>
F&uuml;r Wolf Zimmer ist die Sache klar: &raquo;Nat&uuml;rlich im Rheinland, schlie&szlig;lich
wohne ich hier und gehe von Anbeginn nach K&ouml;ln, und fr&uuml;her fuhr ich noch
zus&auml;tzlich nach Frankfurt zur World of Commodore.&laquo;
</P>
<P>
David R&ouml;skamm ist in der augenblicklichen Situation f&uuml;r zentralere Amiga-
Messen: &raquo;Zur Zeit sollten Amiga-Messen mehr zentral gelegt werden, damit
f&uuml;r jeden die Anfahrtkosten halbwegs tragbar sind. Viele haben einfach
nicht genug Geld, um durch halb Deutschland zu reisen. Weiterer Vorteil
w&auml;ren die leichter zu findenen Mitfahrgelegenheiten.
</P>
<P>
Wenn es dem Amiga wieder besser geht, finden auch &ouml;fters Amiga-Messen
statt, dann ist es besser, wenn die Messen mehr verteilt sind. Dadurch
w&uuml;rden viel mehr Leute einmal eine Messe mehr oder weniger direkt vor der
T&uuml;r haben, was nur positiv ist.
</P>
<P>
Richtig gro&szlig;e offizielle Messen sollten weiterhin zentral gelegt werden.&laquo;
</P>
<P>
Christian Aichinger sieht dagegen momentan Vorteile f&uuml;r die Firmen: &raquo;Das
Rheinland ist ok. Zwar nicht gerade f&uuml;r mich ;) und andere deutsche Amiga-
Anwender, aber f&uuml;r europ&auml;ischen Amiga-Firmen ist das Rheinland eigentlich
ideal gelegen. Alle haben relativ kurze Anreisen. Egal, ob diese Firmen
jetzt aus UK, Frankreich, Italien oder Polen kommen.&laquo;
</P>
<P><B>Fazit:</B></P>
<P>
Die Entscheidung ist sehr knapp ausgefallen. Nicht verwunderlich ist, dass
die Teilnehmer, die im Rheinland oder in dessen N&auml;he leben, in der Regel
mit Antwort 1 gestimmt haben, w&auml;hrend diejenigen, die weiter entfernt
wohnen, meist f&uuml;r zentraler gelegene Messestandorte sind.
</P>
<P><B>Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;AFiloFaxPro&quot;: Philipp Geldmacher&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;Amiga Writer 2.0&quot;: Michael Scholz&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;AmigaOS 3.5&quot;: Kai Stegemann&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x CD-ROM &quot;Amiga Arena&quot;: Thorsten Sch&ouml;lzel&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Herzlichen Gl&uuml;ckwunsch!</B></P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
