<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Messebericht</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Tests7.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Messebericht
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Messebericht</H1>
<H2>1. Nachlese: K&ouml;lner Messe &raquo;World of Amiga 2000&laquo; (von Petra Struck)</H2>
<P>
Der folgende Bericht wurde von unserem Partner amiga-news.de
ver&ouml;ffentlicht:
</P>
<P>
&raquo;Die World of Amiga 2000 vom 9. und 10. Dezember 2000, welche von Haage &amp;
Partner organisiert wurde, stand ganz im Zeichen vom Verkaufsstart des
neuen AMIGA OS3.9, welches sich H&auml;ndleraussagen nach hervorragend verkauft
hat.
</P>
<P>
Die Messe fand im wirklich imposanten Geb&auml;ude des K&ouml;lner Mediaparks 7 auf
ca. 300 qm&sup2; statt. Daf&uuml;r, dass die Messe in allerk&uuml;rzester Zeit
organisiert worden war, war die Veranstaltung mit ca. 1500 G&auml;sten
(Anmerkung: eigene Sch&auml;tzung) sehr gut besucht. Die Seminare wurden im
gegen&uuml;ber liegenden Geb&auml;ude Mediapark 6 abgehalten. Der erste Messetag
Samstag war von regem Gedr&auml;nge gepr&auml;gt, w&auml;hrend es am Sonntag eher
gem&uuml;tlich zuging, da es nur noch halb so voll war.
</P>
<P>
Bevor ich zur Beschreibung der einzelnen Messe-Highlights komme, m&ouml;chte ich
allen Lesern vermitteln, dass mir pers&ouml;nlich diese Messe wieder
ausgesprochen gut gefallen hat. Ich bin immer wieder von der herzlichen
und pers&ouml;nlichen Atmosph&auml;re begeistert. Wie bereits in Neuss sind
erstaunlich viele internationale Besucher angereist. Ich habe Leute aus
England, Holland, D&auml;nemark, Italien, Belgien, Frankreich und Spanien
getroffen und gesprochen. Die Besucher hatten sichtlich Spa&szlig; und waren
beeindruckt von den vielen verschiedenen Pr&auml;sentationen. &Uuml;berall bildeten
sich Trauben von interessierten Zuschauern.
</P>
<P>
Entt&auml;uschung machte sich einzig durch die Tatsache breit, dass Bill McEwen
nicht anwesend war; kurzfristige, unaufschiebbare Termine hatten ihn
abgehalten. Fleecy Moss, der Vizepr&auml;sident und Entwicklungschef hingegen
sorgte durch seine Aussage, es m&uuml;ssen mindestens 50.000 AMIGA OS3.9
verkauft werden, um OS4.0 in Angriff nehmen zu k&ouml;nnen, f&uuml;r ungl&auml;ubiges
Staunen. Da das derzeit niemand f&uuml;r m&ouml;glich h&auml;lt, wird seine Aussage als
ein klares Nein zu OS 4.0 gewertet.
</P>
<P>
Zusammen mit dem Amiga-Club im BTX &amp; Internet war amiga-news.de wie bereits
in Neuss mit einem eigenen Stand vertreten. Aus unserer Redaktion waren vor
Ort: Dirk Baeyens, Tomás J. Cantó, Torsten Dudai, R&uuml;diger Engel, Guido
Fehst, Eric Gillé, Martina Jacobs, Rolf Tingler und meine Wenigkeit. Nico
Barbat war ebenfalls auf der Messe, hatte aber nat&uuml;rlich am eigenen Stand
(Falke-Verlag) genug zu tun. Rolf hat die Besucher mit seinen
Airbrush-K&uuml;nsten begeistert.
</P>
<P>
Wir haben es genossen, mit den Lesern in direkten Kontakt zu kommen und die
unz&auml;hligen Gespr&auml;che haben uns &uuml;berzeugt, dass unsere Arbeit hohe
Anerkennung geniesst und motivieren uns, weiterhin unsere Freizeit f&uuml;r das
Projekt zur Verf&uuml;gung zu stellen. Besonders intensiv und interessant waren
die Gespr&auml;che mit Editoren anderer Newsdienste, wie bespielsweise Andrea
Vallinotto von diff.org (Italien), Adrian Sweeney von amigaglobe.com
(Irland), Ian Maack von amiga.dk (D&auml;nemark), Sebastian Brylka von Fun Time
World (Deutschland), und Mark Hinton und Russell Trent von AmigActive
(England). Ich m&ouml;chte mich auf diesem Wege ganz herzlich f&uuml;r die vielen
netten Komplimente bez&uuml;glich unseres Newsdienstes bedanken.
</P>
<P>
Der Amiga-Club hat die User, die nicht zur Messe kommen konnten per WebCam
mit aktuellen Bildern von der Messe versorgt und daf&uuml;r Sorge getragen,
dass die UGN IRC-Chats problemlos durchgef&uuml;hrt werden konnten.
</P>
<P>
Traditionell standen die Clubmitglieder Usern Rede und Antwort und trugen
dazu bei, dass wieder das eine oder andere Anwenderproblem gel&ouml;st werden
konnte.
</P>
<P>
Auch diesmal waren Michael Sch&auml;fer und Dennis Pauler von Virtual Dimension
mit ihrer Video-Kamera unterwegs, um ein informatives Messe-Video zu
erstellen. Sie f&uuml;hrten viele Interviews und vergewisserten sich immer
wieder, dass das Mikrofon auch funktioniert, da dieses bei der letzten
Messe komplett ausgefallen war, was nat&uuml;rlich einer mittleren Katastrophe
gleichkam.
</P>
<P>
Der Handel und die Gro&szlig;en der Branche waren mit eigenen St&auml;nden vertreten -
der Gerechtigkeit halber diesmal in alphabetischer, aber umgekehrter
Reihenfolge:
</P>
<UL>
<LI> Vesalia Computer
</LI>
<BR><LI> Verkosoft
</LI>
<BR><LI> Schatztruhe
</LI>
<BR><LI> KDH-Datentechnik
</LI>
<BR><LI> individual computers
</LI>
<BR><LI> Hyperion Entertainment
</LI>
<BR><LI> Haage &amp; Partner
</LI>
<BR><LI> Falke Verlag
</LI>
<BR><LI> Eternity Computer
</LI>
<BR><LI> epic interactive
</LI>
<BR><LI> Elbox
</LI>
<BR><LI> DreiEinHalb Computer
</LI>
<BR><LI> COOLbits
</LI>
<BR><LI> APC&amp;TCP
</LI>
</UL>
<P>
Bei Gespr&auml;chen mit den Ausstellern kristallisierte sich heraus, dass - fast
unisono - die Anreise mit gemischten Gef&uuml;hlen erfolgt war, die Besucher
sich aber wider Erwarten sehr kauffreudig zeigten. Der Handel &auml;u&szlig;erte sich
insgesamt zufrieden &uuml;ber die Ums&auml;tze.
</P>
<P>
Fast auf allen der o.g. St&auml;nde fanden Pr&auml;sentationen verschiedenster Soft-
und Hardware statt, die ich nachfolgend ohne besondere Reihenfolge
beschreiben werde. So z.B. stellten Peter Hoffmann, Stefan Sommerfeld und
J&ouml;rg Rebenstorf von Aliendesign ihre neue Soundkarte ´Repulse´ vor, die in
jedem Amiga mit Zorro II Erweiterungskarte einsetzbar ist. Die Soundkarte
bietet Abtastraten von 8 - 48 kHz inklusive 44,1 kHz und 96 kHz S/P-Diff
und unterst&uuml;tzt 16, 18, 20 und 24 Bit (S/P-DIF) Sample-Aufl&ouml;sung in Mono
oder Stereo.
</P>
<P>
Neu bei individual computers war die ISDN-Surfer Zorro Karte, die man
entweder mit oder ohne OVP erwerben konnte. Die angek&uuml;ndigten Produkte
´Lyra´ (Adapter, um WindowsTM-Tastaturen am Amiga zu betreiben) und
´Buddha Flash MK2´ sind leider nicht fertig geworden, sollen aber
wahrscheinlich noch vor Weihnachten lieferbar sein.
</P>
<P>
Dirk Conrad hat seinen MAS-Player vorgestellt, der &uuml;ber Eternity vertrieben
wird. Der MPEG-Player ist ein kleines Hardwareteil, welches wie ein
serieller Stecker aussieht. Der Player kann MP3 schon auf Rechnern, die
lediglich mit einem 68000er-Prozessor ausgestattet sind, abspielen. Die
HiFi-Qualit&auml;t liegt im Bereich 18 Bit / 44 kHz. Seit der WoA 2000 wird
AmigaAMP unterst&uuml;tzt.
</P>
<P>
Am Stand von Hyperion konnten die Besucher einen G-Rex PCI-Prototypen mit
einer Voodoo3 Grafikkarte von DCE in Aktion bewundern. Mit diesem System
sieht Heretic II wirklich fl&uuml;ssig aus, ist schnell und die Lichteffekte
kommen wunderbar heraus. Die User k&ouml;nnen sich auf bessere Geschwindigkeit
und sch&ouml;nere Grafik freuen. Die Fertigstellung der Karten ist f&uuml;r Ende
Dezember 2000 geplant.
</P>
<P>
Nat&uuml;rlich haben wir auch gleich nach den in Arbeit befindlichen Projekten
von Hyperion gefragt und die Antworten nachfolgend zusammengefasst.
</P>
<UL>
<LI> Shogo: Hans-J&ouml;rg und Thomas Frieden arbeiten an der Amigaversion, die
     voraussichtlich Ende Januar 2001 fertig werden wird.
</LI>
<BR><LI> Freespace: An der Umsetzung dieses Space-Shooters arbeiten Steffen
     H&auml;user und Matthias Roslund. Die Fertigstellung ist f&uuml;r das 1.
     Quartal 2001 geplant.
</LI>
<BR><LI> Majesty: Stephan Rusdorf und Thomas Frieden sind mit der Umsetzung des
     Fantasy-Strategiespiels, welches Rollenspiel-Elemente enth&auml;lt,
     besch&auml;ftigt. Mit Fertigstellung wird im 2. Quartal 2001 gerechnet.
</LI>
<BR><LI> Die V&ouml;lker (Alien Nations): Harry Sintonen arbeitet an der Umsetzung
     des bekannten Aufbau- und Strategiespiels, dass &auml;hnlich Siedler ein
     gro&szlig;er Erfolg ist. Auch hier wird das 2. Quartal 2001 als
     Fertigstellungstermin angestrebt.
</LI>
<BR><LI> SIN: Steffen H&auml;user und Peter Annuss arbeiten an der Umsetzung des
     3D-Shooters. Das Spiel wird voraussichtlich im 1. Quartal 2001 fertig
     werden.
</LI>
<BR><LI> Hyperion wird au&szlig;erdem die 3D-Software ´Realsoft 3D´ von Realsoft auf
     den Amiga portieren! Mit dieser mit ´Cinema3D´ oder ´Reflections´
     vergleichbaren Software werden die Amiga-User ein
     3D-Modelling-Werkzeug erhalten, dass umfangreicher, moderner und
     besser als alles bisher Dagewesene.
</LI>
</UL>
<P>
Firma Eyetech hat zusammen mit Martin Sch&uuml;ler von Escena die Pl&auml;ne f&uuml;r den
AmigaOne Rechner vorgestellt. Anhand von Diagrammen wurde gezeigt, wie das
System aussehen wird. Die 68k Emulation wird der von Haage&amp;Partner
entwickelt.
</P>
<P>
Bei Eternity wurde Tales of Tamar - Martin Wolfs Lieblingsprojekt -
vorgestellt. Mittlerweile sind die Weltkarte und St&auml;dte aktiviert worden.
Nach wie vor laufen intensive Online-Tests und die Betatester sind ganz
begeistert von dem Spiel. Erste gr&ouml;&szlig;ere &ouml;ffentliche Betatests sind im 2.
Quartal 2001 geplant.
</P>
<P>
Ebenfalls bei Eternity wurde EASys! von Tom Neidhardt pr&auml;sentiert. Das
aktuelle Update des Programms hat einige Neuerungen, wie beispielsweise
ein eingebautes Startmen&uuml;, OS3.9-Men&uuml;-Unterst&uuml;tzung und Anpassung zu
bieten. Weitere &Auml;nderungen: Der Archiv-Manager unterst&uuml;tzt nun XPK; die
Men&uuml;s sind besser strukturiert und der Umfang der Men&uuml;s l&auml;sst sich
verkleinern und au&szlig;erdem wurde die fehlerbehaftete Installation der
letzten Version bereinigt, sodass nun eine problemlose Installation
m&ouml;glich ist.
</P>
<P>
Eternity pr&auml;sentierte au&szlig;erdem einen PC (Eternity 1) auf 1 GHz Basis
(Thunderbird-Prozessor von AMD) ausger&uuml;stet mit Gigabyte-Board, 128 MB
DIMM -133, Ge-Force II Grafikkarte mit 32 MB DD-RAM, Catweazel-Controller,
52fach CD-ROM, 20 GB Quantum, zwei PC-Laufwerken (eins am Catweazel) sowie
Soundkarte 128 Bit PCI. Der Gag an dem PC ist das perfekt vorinstallierte
UAE, welches unter Windows installiert ist. So hat man einen schnellen PC
und einen AMIGA, der von der Geschwindigkeit her zwischen einem 68040/60
liegt.
</P>
<P>
Im Gespr&auml;ch mit Andreas Magerl und Georg Breitsprecher von Amiga Future und
APC&amp;TCP erkl&auml;rte Magerl, dass die Finanzierung des nun in Eigenregie
&uuml;bernommenen Print-Magazins ´Amiga Future´ endg&uuml;ltig gesichert ist. Die
Abolage sei zwar immer noch nicht 100%-ig zufriedenstellend, aber eine
gewaltige Verbesserung des Layouts werde weitere Abos bringen. Ich habe
mir das neue Layout angesehen und kann best&auml;tigen, dass es ein Unterschied
wie Tag und Nacht ist :-).
</P>
<P>
Andreas K&uuml;ssner von WK-Artworks hat den Wildfire-Nachfolger ´Taifun´
vorgef&uuml;hrt. Taifun wird f&uuml;r das neue Betriebssystem ´Amiga DE´ entwickelt.
Die Entwicklung von Taifun wird auf dem Amiga Software Developer Kit (SDK)
durchgef&uuml;hrt. Der Vertrieb wird &uuml;ber KDH-Datentechnik erfolgen.
</P>
<P>
Bei epic interactive stellte Paul Burkey ´Simon The Sorcerer II´ vor. Das
Spiel wird ab Mitte n&auml;chster Woche im Handel sein. Vorgef&uuml;hrt wurde auch
´Earth 2140´, ein Echtzeit-Strategie-Spiel, welches von Pagan Games im
Auftrag von epic interactive auf Amiga umgesetzt wurde. Die Master-CD ist
auf dem Weg ins Presswerk.
</P>
<P>
In Arbeit ist nach wie vor Dafel:Bloodline. Status: Thomas W&uuml;rgler arbeitet
weiter an der Entwicklung dieses Spiels, aber es ist derzeit nicht
abzusehen, wann es fertig werden wird. Die Priorit&auml;ten sind aktuell mehr
auf den Bereich ´Konvertierung von Spielen´ gesetzt.
</P>
<P>
Das Team von ATC hat mir eine Diskette mit einem Preview des neu
&uuml;berarbeiteten Klassikers Dynamite in die Hand gedr&uuml;ckt. Es wird &uuml;ber
Internet spielbar sein. Ich verspreche, dass ich es in den n&auml;chsten Tagen
anschauen werde :).
</P>
<P>
Mein ganz pers&ouml;nliches Res&uuml;mee: Der AMIGA ist alles andere als tot! Es
finden innovative Entwicklungen im Hard- und Softwarebereich statt. Das
Engagement ist ungebrochen und die Bereitschaft weiterzumachen ist
uneingeschr&auml;nkt vorhanden. In vielen Gespr&auml;chen wurde klar, dass wir zwar
in eine ungewisse, aber nicht hoffnungslose Zukunft wandern. Tenor aus
kaufm&auml;nnischer Sicht der Aussteller: &quot;Man kann zwar genug Geld, jedoch
nicht die ´gro&szlig;e Kohle´ mit dem Amiga verdienen&quot;. Schon alleine aus diesem
Blickwinkel werte ich die Messe als Erfolg. Ich hatte jedenfalls viel Spa&szlig;
und mir hat die Teilnahme einen richtigen Motivationsschub gegeben :-).
</P>
<P>
In diesem Sinne ...
</P>
<P><B>Petra Struck &lt;<A HREF="mailto:ps@amiga-news.de">ps@amiga-news.de</A>&gt;&laquo;</B></P>
<P ALIGN="RIGHT">
<A HREF="Tests7.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
