<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Review: &raquo;Simon the Sorcerer II&laquo;</H2>
<P><B>Der Zauberer kehrt zur&uuml;ck</B></P>
<P>
Nach sieben Jahren findet eines der beliebtesten Point and Click Adventures
auf dem Amiga seine Fortsetzung
</P>
<P>
K&ouml;ln, WOA 2000, Samstag 15.00Uhr: Simon II wird zum Verkauf angeboten. Nach
l&auml;ngerer Wartezeit (dazu nachher mehr) gibt es nun die Fortsetzung von
&quot;Simon the Sorcerer&quot; endlich zu kaufen. Das Spiel kommt in einer DVD-H&uuml;lle
mit Hochglanzcover. Innen befindet sich die CD und eine gedruckte (!)
Anleitung. Alles in allem macht das Ganze also einen sehr professionellen
Eindruck. Ob dieser sich halten kann, lest ihr in diesem Test.
</P>
<P>
Um Simon II gab es einigen Hick-Hack. Erst dauerten die Verhandlungen um
die Rechte so endlos lange und dann geriet die Programmierung immer mehr
ins Stocken. Simon II entwickelte sich zum Sorgenkind. Aus verschiedenen
Sourcecodes eines zum gr&ouml;&szlig;ten Teil in x68 Assambler DOS/Windows
geschriebenen Spiels, mu&szlig;te eine f&uuml;r den Amiga lauff&auml;hige Version
geschaffen werden. Schlu&szlig;endlich schafften dies Paul Burkey (Foundation)
und Peter Mulholland. Daf&uuml;r sei ihnen gedankt, denn mit Simon II liegt der
hitverd&auml;chtige Klassiker nun endlich auch f&uuml;r unseren Lieblingsrechner vor.
</P>
<P>
Um zu wissen worum es geht, schaue ich nat&uuml;rlich zuerst in die Anleitung.
&quot;Simon ist ein kleiner Junge, der zuf&auml;llig in ein seltsames Land
teleportiert wird. Dort hat er viele Abenteuer zu bestehen...blablabla und
rettet einige Leute etc, und t&ouml;tet Sordid, den b&ouml;sen Zauberer, der... wie
k&ouml;nnte es anders sein, nun aus dem Grab auf Rache sinnt.&quot; Nun, dies ist
wirklich eine schnell erz&auml;hlte Story, oder? Aber die Anleitung hat noch
andere Sp&auml;&szlig;e parat, so hei&szlig;t die &Uuml;berschrift unter der erkl&auml;rt wird, wie
das mit dem Ton funktioniert, die &quot;Mach-den-verdammten-L&auml;rm-Leiser-
Funktion&quot;. Oder zum Beispiel das letzte Wort: &quot;Wir hoffen wirklich, da&szlig; ihr
viel Spa&szlig; beim Spielen von Simon 2 habt, wenn ihr eine legale Kopie von
Simon zockt. Wenn das nicht der Fall ist, hoffen wir, da&szlig; ihr jede
verdammte Minute ha&szlig;t.&quot; Dem kann man sich nur nur anschlie&szlig;en. Aber worum
geht es nun? Das Intro erz&auml;hlt, wie Runt der Lehrling von Sordid wird. Mit
seiner Hilfe versucht dieser Simon zu sich zu holen um dann wieder zum
Leben erweckt zu werden. Er schickt einen magischen Wandschrank in die
Dimension von Simon, welcher ihn auch direkt in die Welt von Sordid
teleportiert. Leider landet er nicht im Schloss von Sordid, sondern vor
Calypsos Laden (Simon hat Calypso im ersten Teil gerettet). Dieser erkl&auml;rt
ihm, da&szlig; er BedFull braucht, um wieder in seine Dimension zur&uuml;ckzukommen.
Unterdessen schickt Sordid seine Monster um Simon zu fangen. Das Spiel kann
beginnen.
</P>
<P>
Immer mehr Spiele fordern den Amiga bis aufs letzte heraus. PPC und 3D-
Grafikkarte sind oft Pflicht, 64 MB RAM Minimum, und ein 4*CD-ROM-Laufwerk
reicht schon lange nicht mehr. Simon II ist da erfrischend sparsamer. Als
Mindestkonfiguration reicht ein Rechner mit AGA, 68030, CD-ROM-Laufwerk,
AHI (ist aber auf der CD) und 16 MByte RAM. Das sollte ja wohl drin sein,
oder?
Um so besser, da&szlig; wohl mehr Speicher und sogar Grafikkarten unterst&uuml;tzt
werden. Die Installation geht denkbar einfach von der Hand: einfach auf den
Installer klicken und los geht's. Man sollte eine eigene Schublade anlegen,
wohin dann  die 175 MB Daten verfrachtet werden. Leider gibt es keine
M&ouml;glichkeit der Teilinstallation bei kleineren Festplatten, wohl aber die
Option, Simon II direkt von der CD zu starten. Das Spiel selbst ist
komplett englisch, aber mit deutschen (und italienischen) Untertiteln. So,
nun wi&szlig;t ihr, worum es geht, und ob es auf eurem Rechner l&auml;uft. Wenn ihr
euch jetzt noch f&uuml;r Simon II interessiert, lest einfach weiter:
</P>
<P>
<A HREF="img/Simon1.jpg"><IMG SRC="thumb/Simon1.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
(Bei einem so guten Spiel geht mancher die Decke rauf)
</P>
<P>
Nach dem Start mu&szlig; man einen AHI-Sound- sowie einen Bildschirmmodus
(320*200, 8Bit) ausw&auml;hlen. Wenn man keinen Screenmode ausw&auml;hlt, startet
Simon II auf der Workbench! Das Spiel beginnt mit der Animation, in der
gezeigt wird, wie Runt zum b&ouml;sen Sordid wechselt. (Solltet ihr keine
deutschen Untertitel sehen, dr&uuml;ckt mal &quot;V&quot; und/oder &quot;T&quot; und dann &quot;Space&quot;,
um eure Sprache einzustellen. Bei einem erneuten Start sollte eigentlich
die richtige Einstellung gespeichert sein). Grafisch hat sich gegen&uuml;ber
Teil eins f&uuml;r meine Begriffe nicht viel getan, was aber nicht unbedingt ein
Nachteil ist, waren die Grafiken doch schon damals ein Augenschmaus. Zwar
mu&szlig; sich das Heretic II und Earth 2140 verw&ouml;hnte Auge erst einmal wieder an
einen 320*200-Bildschirm gew&ouml;hnen, aber das geht bei so coolen Grafiken
wirklich schnell. Nun, zur&uuml;ck zum Thema:
Diese erste Filmsequenz ist ja schon wirklich lustig, aber was dann folgt,
ist der Lacher schlechthin: die Credits! Die Credits? Was soll denn daran
lustig sein? Nun, wie bei Teil eins l&auml;uft w&auml;hrend der Einblendungen der
Programmierer usw. ein weiteres Intro ab, welches zwar nix mit dem Spiel zu
tun hat, aber wirklich spa&szlig;ig ist. (Simon hat Streit mit einem zum Leben
erweckten Besen. Wer gewinnt, wird nicht verraten.)
Und endlich geht das Spiel los: Simon landet mit seinem Kleiderschrank vor
Calypsos Zauberladen. In einer kurzen Zwischensequenz erfahren wir, was wir
&uuml;berhaupt tun m&uuml;ssen (wenn ihr es nicht wi&szlig;t, habt ihr wahrscheinlich
&quot;Worum geht es &uuml;berhaupt?&quot; nicht gelesen. Na-na, wieder zur&uuml;ck zum Start,
ziehe keine 4000 Mark ein). Der Bildschirm ist in zwei H&auml;lften eingeteilt.
Den gr&ouml;&szlig;ten Teil, nimmt das Spielfeld ein. Man sieht die Landschaft und
kann mit dem Mauszeiger herumfahren. Dr&uuml;ckt man an einer Stelle die
Maustaste, bewegt sich Simon dorthin. Ist dies zuf&auml;llig das Ende des
Schirms bzw. ein Weg, geht der Held in den n&auml;chsten Schirm, oder in das
Haus oder so. Das untere Drittel des Schirms ist das &quot;Gehirn&quot; von Simon.
Hier bestimmt man, was er &uuml;berhaupt machen soll. Daf&uuml;r gibt es acht Bilder
(waren es in Teil eins noch geschriebene Worte, ist man jetzt zu
internationalen Piktogrammen &uuml;bergegangen). Um zu sprechen, dr&uuml;ckt man
beispielsweise den Mund und auf denjenigen, mit dem man sprechen will. Um
Sachen zu untersuchen auf die Lupe, und um etwas zu nehmen auf den
Magneten. Ich denke mal, die Sache d&uuml;rfte jetzt f&uuml;r jeden verst&auml;ndlich
sein. Diese Steuerung ist etwas umst&auml;ndlich, wo es doch bei vielen Sachen
sowieso nur eine M&ouml;glichkeit g&auml;be. Trotzdem kann man sich sehr schnell
damit anfreunden, und Fans des ersten Teils sind sowieso schon daran
gew&ouml;hnt. In der Mitte dieser Statusleiste ist das Inventar, wo sich alle
Sachen befinden, die Simon im Laufe seiner Reise so findet. Von hier aus
k&ouml;nnen diese Sachen untersucht, benutzt oder auch weitergegeben werden. Am
Anfang haben wir nur eine Postkarte zum Speichern, Laden oder Verlassen.
Man kann an jeder beliebigen Stelle abspeichern. Man kann zwar nicht
&quot;sterben&quot;, aber trotzdem ist es wichtig, ab und zu zwischenzuspeichern. Und
sei es nur, weil irgendwann einmal der Computer abst&uuml;rzt. (Habe schon davon
geh&ouml;rt.)
Nun geht es darum, kleinere und gr&ouml;&szlig;ere R&auml;tsel zu l&ouml;sen, indem ihr Sachen
sammelt und an den richtigen Stellen einsetzt, und euch mit vielen Leuten
unterhaltet. Daf&uuml;r gibt es meistens drei S&auml;tze, aus denen ihr euch einen
aussucht. So gibt es dann ein mehr oder weniger ergiebiges Gespr&auml;ch. Da es
sehr viele Charaktere (darunter auch viele Bekannte aus Teil 1) und jede
Menge (zum Teil scrollbare) Locations gibt, ist Simon II ziemlich
umfangreich. Mittelpunkt unserer Reise ist zun&auml;chst einmal die Karte des
Reiches, von wo aus man viele Locations besuchen kann. Einfach auf den
gew&uuml;nschten Ort klicken, und schon befindet sich Simon an der gew&uuml;nschten
Stelle. Sp&auml;ter gibt es nat&uuml;rlich weitere Karten.
</P>
<P>
Sollte man einmal nicht weiterkommen, gibt es viele Komplettl&ouml;sungen, aber
der Schwierigkeitsgrad ist eigentlich so gehalten, da&szlig; man irgendwann auch
mal von allein drauf kommt. Und nat&uuml;rlich sollte man Humor haben. Es wird
immer noch ein Kalauer drauf gelegt. So ist man ja auf der Suche nach
BedFull, um dem Schrank Fl&uuml;gel zu verleihen, es gibt unz&auml;hlige Andeutungen
auf Teil 1, und wenn man lange Zeit nix macht, zerf&auml;llt Simon zu einem
H&auml;ufchen Knochen.
</P>
<P>
<A HREF="img/Simon2.jpg"><IMG SRC="thumb/Simon2.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
<A HREF="img/Simon3.jpg"><IMG SRC="thumb/Simon3.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
(Wie sollen wir hier reinkommen?)
</P>
<P>
<A HREF="img/Simon4.jpg"><IMG SRC="thumb/Simon4.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
(Huch: Auf meiner Workbench ist ein Zauberer)
</P>
<P>
Simon II ist auf jeden Fall ein Gl&uuml;cksgriff. Die Technik befindet sich zwar
nicht mehr auf dem neuesten Stand, wie z.B. bei dem erst vor kurzem
erschienenen Nightlong, aber daf&uuml;r darf sich fast jeder Amiganer daran
erg&ouml;tzen, und es kostet auch nur die H&auml;lfte. Trotzdem gibt es nat&uuml;rlich den
einen oder anderen Grund zum Meckern. Ganz gravierend sind die Bugs unter
OS 3.9, hier konnte man zum Beispiel nicht abspeichern, das Intro schmierte
manchmal ab, und man mu&szlig;te bei jedem Start wieder neu den AHI- und
Bildschirmmodus ausw&auml;hlen. Hierf&uuml;r gibt es aber mittlerweile einen Patch.
Die englische Sprachausgabe ist insofern &auml;rgerlich, als es ja eine deutsche
Version gibt! Aber die Rechte lagen leider bei jemand anderem. Schade.
Trotzdem sollte man die gut gelungene englische Sprache anlassen. Denn
durch die deutschen Untertitel hat das ganze dann sogar noch einen
Lerneffekt. Und die Sprachausgabe ist wirklich gut gelungen. Manchmal
hinken die Untertitel ein bisschen nach, aber nicht so, da&szlig; es st&ouml;ren
w&uuml;rde.
</P>
<P>
Wichtiger Hinweis zum Schlu&szlig;: Wenn ihr den Eindruck habt, als h&auml;ttet ihr
diesen Artikel schon gelesen, dann seid ihr Abonnenten der AmigaFuture.
Dieser Bericht ist n&auml;mlich stark an mein dort bereits erschienenes Review
angelehnt. Solltet ihr die Future nicht regelm&auml;&szlig;ig ins Haus bekommen,
&auml;ndert dies: <A HREF="http://www.amigafuture.de" TARGET="_top">http://www.amigafuture.de</A> . Indem ihr diese Zeitschrift
abonniert, unterst&uuml;tzt ihr den schon recht schwachen Amiga-Printmagazin-
Markt und habt au&szlig;erdem solche Berichte wie den gerade gelesenen einige
Zeit fr&uuml;her. DANKE.
</P>
<P><B>Testrechner:</B></P>
<P>
Amiga 1200<BR>
ZorroIV-Board<BR>
PPC603e/060<BR>
BVisionPPC<BR>
128MB Fast-RAM<BR>
40GB HD<BR>
20*IDE-CD-ROM<BR>
17&quot;Zoll-Monitor<BR>
</P>
<P><B>Mindestanforderung: AGA, 68030, 16 MB RAM, CD-ROM-Laufwerk</B></P>
<P>
empfohlene Konfiguration: CGX, 68040+, mehr RAM, Festplatte (180 MB)
</P>
<P><B>Vertrieb und Preis: Epic Interactive, 89,95 DM</B></P>
<P><B>Internetpr&auml;senz:</B></P>
<P>
<A HREF="http://www.shoecake.com/simon2.html" TARGET="_top">http://www.shoecake.com/simon2.html</A> (Simon II Support-Site)<BR>
<A HREF="http://www.epic-interactive.com" TARGET="_top">http://www.epic-interactive.com</A>
</P>
<P><B>Bewertung:</B></P>
<P>
Simon II ist die gelungene Fortsetzung des Klassikers. Da uns dieser zweite
Teil um einiges sp&auml;ter erreicht, als dies beim PC der Fall war, sind die
Grafiken nicht mehr ganz up-to-date. Vor allem Nightlong hat da sichtlich
mehr zu bieten. Aber in Sachen Gameplay und Spielwitz ist Simon II ebenso
wie sein Vorg&auml;nger nicht zu schlagen. Es lohnt sich allemal, in diese
lustige Welt voller R&auml;tsel einzutauchen: Man wird lange nicht mehr davon
loskommen!
</P>
<UL>
<LI> endlich die Fortsetzung des Klassikers
</LI>
<BR><LI> lustig bis zum Abwinken
</LI>
<BR><LI> sehr umfangreich
</LI>
<BR><LI> keine gro&szlig;en Hardwareanforderungen
</LI>
<BR><LI> einige Fehler unter OS 3.9
</LI>
<BR><LI> keine deutsche Sprachausgabe
</LI>
<BR><LI> grafisch nicht mehr ganz up to date
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">7 von 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Musik/SoundFX:&nbsp;</TD><TD VALIGN="TOP">8 von 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Preis/Leistung:&nbsp;</TD><TD VALIGN="TOP">9 von 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Gesamt:&nbsp;</TD><TD VALIGN="TOP">8 von 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
