<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. Review: &raquo;Ermentrud - Ein Leben f&uuml;r den K&ouml;nig&laquo;</H2>
<P><B>Adventure-Leckerbissen oder mittelalterliche Posse?</B></P>
<P>
Inutilis Software wagen den Spagat zwischem ernstzunehmenden Adventure und
einer ver&uuml;ckten Story!
</P>
<P>
Nicht erst seit Monkey Island sind Point-and-Click-Adventures auf dem Amiga
ein Renner. Die neuesten Vertreter dieses Genres sind Nightlong (Clickboom)
und Simon the Sorcerer II (Epic Interactive). Und f&uuml;r Nachschub scheint
gesorgt: Befindet sich mit Ermentrud doch ein weiterer Titel dieses Genres
in den Startl&ouml;chern. Da das Programmiererteam aus nicht mehr als einer
Person besteht (und diese auch noch kurz vor dem Abitur steht), dr&auml;ngt sich
nat&uuml;rlich die Frage auf, ob das Spiel mit der bestehenden Konkurrenz
mithalten kann. Aber lest selbst, was euch (bald?) erwartet:
</P>
<P>
Ermentrud l&auml;uft nur auf CGFX-Bildschirmen mit 640*480 und 8Bit auf Amigas
mit Workbench 3.x. Dies ist richtig mutig. Grafikkartenunterst&uuml;tzung finde
ich ja klasse, aber eine Graka und CGFX als Vorraussetzung? Aber dies
deutet auf den Ehrgeiz hin, der hinter diesem Projekt steht: Es sollen ca.
40 Locations zu untersuchen sein. Alle Hintergr&uuml;nde werden von Hand gemalt
sein und auf dem Amiga koloriert werden. Au&szlig;erdem soll es Sprachausgabe und
Musikuntermalung durch AHI geben. H&ouml;rt sich doch schon mal nach einem guten
Projekt an, oder? Aber worum geht es eigentlich?
</P>
<P>
<A HREF="img/Ermentrud.jpg"><IMG SRC="thumb/Ermentrud.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Ein paar Kohlk&ouml;pfe (w&ouml;rtlich!) entf&uuml;hren die Prinzessin. W&auml;hrenddessen
waren alle Wachen in der Taverne &quot;Bei Helga&quot; besoffen.
</P>
<P>
Der K&ouml;nig l&auml;sst Ermentrud (den Helden) herbeiholen und gibt ihm den
Auftrag, die Prinzessin zur&uuml;ckzuholen, da sie in ein paar Tagen mit Prinz
R&uuml;bensupp verheiratet werden soll. Bei dieser Rettungsaktion bereist er
unter anderem die mittelalterliche Hauptstadt des K&ouml;nigs Pilsener, die
semi-orientalische Insel Thymian, das fremde Nachbarland, wo der Harz aus
B&auml;umen flie&szlig;t und die Untergrundwelt derer von Kohlkopf.
</P>
<P>
Es ist geplant, die Handlung jedoch nicht linear verlaufen zu lassen,
sondern die einzelnen Kapitel (mit Ausnahme des ersten und letzten) in
beliebiger Reihenfolge durchspielbar zu machen. Im Grunde genommen geht es
inhaltlich haupts&auml;chlich um Suppe, Suppenkr&auml;uter und eine
sehr...imposante... Prinzessin. Man glaubt ja gar nicht, wo man &uuml;berall
Kr&auml;uter und deren &Uuml;berreste findet.
</P>
<P>
Momentan ist die Story noch in der Konstruktion, und genauere Details sowie
der bereits geplante Showdown k&ouml;nnen hier nat&uuml;rlich noch nicht offenbart
werden. Es sei nur soviel gesagt: Kohl ist nicht das einzige aktive Gem&uuml;se
in diesem Spiel.
</P>
<P>
Nun denn, die Story verspricht ein lustiges Spiel. Wenn man dann noch
bedenkt, da&szlig; neben der Software noch ein Film (siehe Kasten) mit gleichem
Titel gedreht wird, steht einem Intro à la Codename: Hellsquad nichts im
Wege. Aber dies ist nat&uuml;rlich noch Zukunftsmusik. Denn eine erste
Demoversion beinhaltet gerade mal einen Bildschirm und kein Inventar. Man
kann noch nichts machen, und SoundFX, Musik oder gar Sprachausgabe sind
Fehlanzeige. Und trotzdem lohnt sich ein Blick hinein. Da ich &uuml;ber einen
Rechner mit CyperGraphX verf&uuml;ge, habe ich mir das Teil mal angeschaut. Es
mu&szlig; einfach irgendwohin entpackt werden und kann sofort &uuml;ber (das recht
lustige) Icon gestartet werden. Und siehe da: Es schaut ganz passabel aus!
Die Screenshots werden dem Spiel nicht ganz gerecht. Und witzig ist das
ganze auch noch: Da steht der Held mit einem Pferd à la Monty Pythons
&quot;Ritter der Kokosnuss&quot; und direkt vor ihm das &quot;obligatorische Kr&ouml;tenvieh&quot;.
Wenn man den Mauszeiger &uuml;ber das Spielfeld gleiten l&auml;&szlig;t, erscheinen die
aktiven Gegenst&auml;nde als Text auf dem Schirm, als da w&auml;ren die schon
angesprochene Kr&ouml;te, der See und die T&uuml;r.
</P>
<P>
Das sieht alles schon sehr professionell aus, und der Witz kommt auch nicht
zu kurz: So sagt der Held bei dem Versuch, die T&uuml;re zu &ouml;ffnen: &quot;Die T&uuml;r hat
keine Klinke. Verdammte Demoversion.&quot; Aber wie &ouml;ffnet man &uuml;berhaupt die
T&uuml;re? Nun, dies ist ganz einfach gel&ouml;st - mit der linken Maustaste benutzt
man Gegenst&auml;nde (&ouml;ffnen, aufnehmen usw. - das l&auml;stige Kombinieren von
Verben entf&auml;llt), und mit der rechten Maustaste schaut man selbige
Gegenst&auml;nde erst einmal an (robuste T&uuml;r aus Eichenimitat. Toll wie
www.inutilis.de). Wie es allerdings mit dem Inventar funktioniert, wei&szlig; ich
noch nicht, auch die zweite Demoversion bietet hierauf keine Antwort.
</P>
<P>
&Uuml;berhaupt kann diese zweite Demo beiweiten nicht den ersten guten Eindruck
verfestigen. So gibt es au&szlig;er zwei neuen Bildschirmen nichts Neues. Ein
Inventar ist immer noch nicht vorhanden, und selbst die neuen Bilder sind
qualitativ schlechter als das Startbild. Und storytechnisch gibt es sowieso
noch nix zu sehen. Im Haus ist ein sprechender Schuh(!). Und der quasselt
einen total voll. Aber man kann weder Gespr&auml;chskomponenten selbst
ausw&auml;hlen, noch das Gespr&auml;ch abbrechen. Und wenn man ihn ein zweites Mal
anspricht, beginnt genau dasselbe Gespr&auml;ch von vorn! Auf dem zweiten
Bildschirm liegt dann die Titanic(!!), und die Sache f&auml;ngt an, sich in
Albernheiten zu verstricken. Es taucht ein zweiter sprechender Schuh auf,
der nur flucht und gar nicht gut auf den ersten Schuh zu sprechen ist. Es
wimmelt vor Anspielungen auf Inutilis-Produkte. Dies ist zwar selbst bei
LucasArts-Produkten Gang und Gebe, aber wirkt in dieser Menge nur nervig!
Aber das hei&szlig;t noch nicht, da&szlig; Ermentrud ein Flop wird. Ganz im Gegenteil!
Dies ist ja immer noch die Entwicklungsphase der Engine (wenn auch schon
weit vorangeschritten), und man erkennt das Potential, welches in diesem
Spiel steckt. Bleibt zu hoffen, da&szlig; die Qualit&auml;t des Spiels nicht durch die
alberne Handlung nach unten gezogen wird. Aber der Entwickler, wie auch der
Storywriter, arbeiten fieberhaft daran, auch wenn das ganze noch &quot;mehrere
Monate dauern wird&quot; (Zitat Inutilis Software).
</P>
<P>
Es wird auf jeden Fall keine AGA-Version geben, da das Spiel wegen der
hohen Aufl&ouml;sung zu langsam w&auml;re. Aber unter P96 soll das Teil laufen. Nun
warten wir noch auf eine dritte Demoversion, vielleicht sogar schon mit
einem Inventar und/oder den ersten Versuchen der Sprachausgabe? Ach: Einen
kompletten CD-Soundtrack soll es auch noch geben. In diesem Sinne: Schaut
euch die Demoversion mal an und wartet gespannt auf den Test der
Vollversion.
</P>
<P>
Wichtiger Hinweis zum Schlu&szlig;: Wenn ihr den Eindruck habt, als h&auml;ttet ihr
diesen Artikel schon gelesen, dann seid ihr Abonnenten der AmigaFuture.
Dieser Bericht ist n&auml;mlich stark an mein dort bereits erschienenes Preview
angelehnt. Solltet ihr die Future nicht regelm&auml;&szlig;ig ins Haus bekommen,
&auml;ndert dies: <A HREF="http://www.amigafuture.de" TARGET="_top">http://www.amigafuture.de</A> . Indem ihr diese Zeitschrift
abonniert, unterst&uuml;tzt ihr den schon recht schwachen Amiga-Printmagazin-
Markt und habt au&szlig;erdem solche Berichte, wie den gerade gelesenen einige
Zeit fr&uuml;her. DANKE.
</P>
<P><B>Testrechner:</B></P>
<P>
Amiga1200<BR>
ZorroIV Board<BR>
PPC603e/060<BR>
BVisionPPC<BR>
128MB Fast Ram<BR>
40GB HD<BR>
20*IDE CDRom<BR>
17&quot;Zoll Monitor<BR>
</P>
<P><B>Internetpr&auml;senz:</B></P>
<P>
<A HREF="http://www.inutilis.de/ermentrudgame/index.html" TARGET="_top">http://www.inutilis.de/ermentrudgame/index.html</A>
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
