<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Testit</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Pieni tulostustarviketesti</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Juha-Pekka Kuusela &lt;<a href="mailto:jpq@mbnet.fi">jpq@mbnet.fi</a>&gt;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b><a href="http://www.timenco.fi">Timenco</a> on haminalainen verkkokauppa, joka myy tulostimien, kopiokoneiden ja faksien v&auml;riaineita, tarvikkeita ja tulostusmateriaaleja. Tilasin sielt&auml; v&auml;h&auml;n tulostustarvikkeita, seuraavassa pieni&auml; kokemuksia niist&auml;.</b></font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tilasin kaksipuoleista 180-grammaista photo matta valokuvapaperia 100 kpl (hintaa </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">27 euroa) ja kiilt&auml;vi&auml; 105x148 mm postikorttipohjia 40 kpl (8 euroa). Aluksi k&auml;vi niin, ett&auml; postiennakkolapussa oli summa tilaamieni kiilt&auml;vien postikorttipohjien kanssa, mutta paketissa oli himme&auml;pintaisia, puolet halvempia, joten hintaa oli siis liikaa 4 euroa. En tosin en&auml;&auml; nyky&auml;&auml;n l&ouml;yd&auml; sivulta himme&auml;pintaisia korttipohjia - tilauksen yhteydess&auml; tulleessa, jo aiemminkin omistamassani hinnastossa niit&auml; viel&auml; oli. <br>
							<br>
							Valokuvapaperi vaikutti todella mainiolta, mutta kun rupesin tulostamaan, k&auml;vi ik&auml;v&auml;kseni niin ettei Epson Stylus Photo 810 -tulostimeni suostunut yhteisty&ouml;h&ouml;n: arkkien sy&ouml;tt&auml;minen onnistuu, mutta aina tapahtui &quot;l&auml;pilasku&quot; eli arkki tuli k&auml;yt&auml;nn&ouml;ss&auml; koskemattomana ulos. Veljeni onnistui omalla Epson Stylys Color 300:llaan tuolostamaan niihin, ja my&ouml;s toisella Epsonilla onnistui (malli unohtunut, uudempi kuin tuo minun tulostimeni). Minulla lienee siis huono s&auml;k&auml;. H&auml;m&auml;&auml;m&auml;&auml;n j&auml;i se, ett&auml; tulostimeni on noista kolmesta ainoa oikea valokuvatulostin, jonka kanssa noissa papereissa olisi eniten j&auml;rke&auml;. Paperista j&auml;i siis muuten hyv&auml; kuva, mutta itse en sit&auml; pystynyt hy&ouml;dynt&auml;m&auml;&auml;n alkuper&auml;isess&auml; k&auml;ytt&ouml;tarkoituksessa. Onneksi k&auml;yt&auml;n paperia muuhunkin kuin tulostukseen, eli maalaukseen ja piirt&auml;miseen.<br>
							<br>Postikorttipohjat olivat taas muuten hyv&auml;&auml; tavaraa, mutta en saanut kuvia tulostettua, vaikka kuinka mittailin pohjien keskelle Turbo Print -ohjelmistolla ja tulostimellani. Ongelmani niiden kanssa ei siis varsinaisesti johtunut korttipohjista. Kun ilmoitin saaneeni v&auml;&auml;ri&auml; korttipohjia, myyj&auml; lupasi l&auml;hett&auml;&auml; oikeat, mutta vasta toisen soittokerran j&auml;lkeen l&auml;htiv&auml;t. Itse asiassa sain siis lopulta kahta lajia korttipohjia ja maksoin vain 2/3 niiden oikeasta yhteishinnasta. Tarkoituksenani on selvitt&auml;&auml;, onko Photo Glossy tai Extra Photo Glossy samaa paperia kuin kiilt&auml;v&auml;t korttipohjat, sill&auml; jos on, niin min&auml; ja veljeni olemme mieliss&auml;mme, koska mielest&auml;mme se oli parempaa kuin valmistajan oma. Minusta ainakin kaikki alueet s&auml;ilyttiv&auml;t kiiltonsa, eiv&auml;t vain valkoiseksi j&auml;&auml;neet, eli vaikutelma oli valokuvamaisempi.<br>
							<br>
							Loppujen lopuksi kokemus oli rutkalti negatiivinen: aika lailla s&auml;hl&auml;yst&auml;, ja toinen tuote oli k&auml;yt&auml;nn&ouml;ss&auml; pettymys. Opin ainakin sen, ett&auml; tyytynen valmistajan omiin papereihin ja musteisiin. Kopiomusteiden testaus ei ole edes k&auml;ynyt mieless&auml;, sill&auml; sen verran kovan hinnan tulostimestani olen maksanut, ja toiseksi v&auml;rien oikeellisuus on minulle t&auml;rke&auml;&auml;. Jos v&auml;ltt&auml;m&auml;tt&auml; haluatte testata Timencon tulostusmateriaaleja, niin kannattaa ostaa 10 euroa maksava kokeilupakkaus, jossa on yhdeks&auml;&auml; eri lajia tulostusmateriaaleja muutaman kappaleen erin&auml;. Olisin muuten itse ostanut sen, mutta oli kiire ja budjetti tiukalla.</font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td colspan="2" valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Tulostusmateriaaleja mustesuihkutulostimiin</b></font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Myyj&auml;:&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://www.timenco.fi" target="_blank">Timenco</a>, puh. (05) 344 7400, <a href="mailto:timenco@timenco.fi" target="_blank">timenco@timenco.fi</a>, verkkokauppa <a href="http://www.kauppakeskus.com/timenco/" target="_blank">kauppakeskus.comissa</a></font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Hinta:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Photo matta valokuvapaperi, 180 g, 2-puoleinen 100 kpl 27 e<br>
							Postikorttipohja, kiilt&auml;v&auml;, 40 korttia 8 e</font></td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Testit</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;&nbsp;</font><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>
				</tr>
			</table>
		</center>
	</body>

</html>