<HTML>
<HEAD><TITLE>AMIGA-aktuell-Forum</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0404.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0406.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>AMIGA-aktuell-Forum</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H2>5. Kritik an den AMIGA-Zukunftspl&auml;nen einiger User (von Sascha van Wahnem)</H2>

<P>
<BLOCKQUOTE>»Ich habe mir jetzt schon seit mehreren Monaten die ganze Sache da von
wegen Amiga-Zukunft und alles mal in Ruhe angeh&ouml;rt und mir bisher immer
meinen Teil gedacht, aber ich denke, es wird Zeit da&szlig; ich meinen Senf auch
mal dazugebe.
<P>
1. Warum PCI in neuen Amigas???
<P>
Das w&uuml;rde mich mal brennend interessieren, warum alle so 'geil' auf PCI
sind!?
<P>
Ist PCI so was Besonderes? Ich meine von der Leistung her? Wohl kaum,
bestimmt gibt es 'was Besseres.
<P>
Oder ist es nur wegen des wahnsinnigen Kartenangebots auf dem Markt?
Ihr k&ouml;nnt' mich f&uuml;r bl&ouml;de halten, aber ich denke, da&szlig; der Einzug von PCI
als Hauptschnittstellen-System der technische R&uuml;ckschritt wird! Sollte PCI
der Ersatz werden f&uuml;r die bisherigen ISA-Slots im Amiga, na gut, bin ich
bereit zu sagen, auch gut. Aber wenn dadurch unser Zorro-Bus-System
wegf&auml;llt, w&auml;re das, zu deutsch gesagt, M&uuml;ll!
<P>
O.k., Zorro m&uuml;&szlig;te man entwickeln, um wieder eine halbwegs gescheite
Geschwindigkeit zu haben. Aber Zorro IV oder Zorro V h&auml;tten durchaus
Vorteile. Zum einen k&ouml;nnte man sie kompatibel halten zu den alten Zorro-
II/III-Standards. Die alten Karten w&auml;ren weiterhin nutzbar, wenn man will.
Die besondere Amiga-Hardware (Picasso IV oder andere Karten) k&ouml;nnten in
Ruhe weiterentwickelt werden, f&uuml;r noch mehr Leistung. Bessere Karten k&ouml;nnte
man bauen. T&auml;uscht Euch nicht, der PCI-Bus ist bei weitem keine L&ouml;sung.
Erst mal ist dieser schon wieder steinalt, zum anderen gibt es auf dem PC-
Markt auch schon Probleme mit diesem. Also ist es nur noch eine Frage der
Zeit, bis dieser auch ersetzt wird.
<P>
Zum anderen ist es ja doll, wenn ich dann den Amiga (8000 ??) da stehen
habe, der dann eine normale SoundBlaster-kompatible Soundkarte hat, eine
Matrox Millenium sowieso, und was wei&szlig; ich nicht noch alles vom PC her hat.
Da mu&szlig; ich doch mal ganz klar die Frage stellen, ist das &uuml;berhaupt ein
Amiga, oder sollte man dann nicht schon eher sagen, es handelt sich um
einen IBM-PC? Was hat uns denn bisher immer so stark vom IBM-PC-Markt
unterschieden? Wir hatten unsere eigene Hardware, die NUR f&uuml;r den Amiga
gemacht war, sie ist immer eine gro&szlig;e Innovation gewesen, weil sie &uuml;ber
meist besondere Sachen verf&uuml;gt hat, Leistungen und Erweiterungs-
M&ouml;glichkeiten, die fast nur auf dem Amiga angesagt waren. Meiner Meinung
nach war das immer mit einer der Gr&uuml;nde, warum der Amiga so was Besonderes
war. Ich bin eindeutig f&uuml;r eine Weiterentwicklung der Zorro-Systeme. Ich
hoffe, da&szlig; ich mit dieser Meinung nicht allein dastehe. Ich kenne auf jeden
Fall noch mehrere Leutchen, die diese Meinung mit mir teilen. Ich w&uuml;rde
mich freuen, wenn sich weitere Personen dazu bei mir melden w&uuml;rden.
Vielleicht kann man mich ja doch noch umstimmen, wer wei&szlig;?! E-Mail:
<A HREF="mailto:Wile.E@cww.de">Wile.E@cww.de</A>
<P>
2. Neuer Amiga!
<P>
So stelle ich ihn mir vor:
<P>
CPU: PPC 604e (min. 200 MHz) onboard, weiterhin die M&ouml;glichkeit, &uuml;ber CPU-
Boards die Sache auszubauen.
<P>
RAM: Nur noch Fast-RAM, kein Chip-RAM mehr. Erweiterbar bis 512 MB &uuml;ber
PS/2 UND DIMM!!
<P>
Floppy: Wie beim A2/3/4000 2 St&uuml;ck anschlie&szlig;bar, serienm&auml;&szlig;ig mit einem HD-Floppy
<P>
Kontroller: 2x EIDE oder (optional) SCSI-2 bzw. UW-SCSI
<P>
Bus-System: min. 5 x Zorro IV- oder -V-System (128 Bit-Schnittstelle) mit
ISA und/oder PCI als Second-Port. Trotzdem durch Software aber volle
Unterst&uuml;tzung wie beim Zorro-Bus
<P>
Board: Wenn's geht im ATX-Design. Gegebenenfalls etwas gr&ouml;&szlig;er.
<P>
OS: Wieder ROM. Besser gesagt EPROM, wo man ganz einfach durch Kauf eines
Betriebssystems das EPROM onboard neu brennt. Vorteile vom ROM gegen&uuml;ber
einem Betriebssystem auf Datentr&auml;ger sind allgemein bekannt, denke ich mal.
Wenn nicht, denkt mal an Windows!!
<P>
Sound: 16 Bit DSP-Chip onboard, aber mit besserer Option, das Ganze bei
Wunsch auf Soundkarte umzulenken.
<P>
Grafik: Grafikchip mit 3D-Unterst&uuml;tzung. Bildschirm von 1024*768 in 32 Bit
darf kein Problem sein. 8 MB VRAM (erweiterbar?). Auch hier wieder die
Option durch Einbau einer Grafikkarte, das zu verbessern.
Das Ganze als Mini- oder BigTower, f&uuml;r den Anwender halt passend.
Typische Schnittstellen (Maus, etc., alles wie bisher. Vielleicht aber
einen Chip f&uuml;r die Tastatur, der durch Um-Jumpern umzustellen ist auf
Amiga- oder PC-Tastatur.
<P>
Ihr merkt, ich w&uuml;rde eigentlich das Vergleichbare wie bisher nehmen, halt
nur auf dem aktuellen Stand der Technik. Warum? Nun, bei heutigen PC wird
auch immer mehr auf Customchips gesetzt. Immer mehr Funktionen werden
onboard gel&ouml;st. Warum sollten wir, die es nicht anders kennen, jetzt dazu
&uuml;bergehen, alles auf Steckkarten zu l&ouml;sen, wo der PC doch genau in die
andere Richtung geht. Ihr wollt zwar alles vom PC irgendwie &uuml;bernehmen,
aber das schlechte kann man doch au&szlig;en vor lassen. Oder?
<P>
Aber durch einen solchen Amiga k&ouml;nnte man wieder Hoffnung sch&ouml;pfen, weil
hier wieder das alte Feeling 'r&uuml;berkommt, das den Amiga so ber&uuml;hmt gemacht
hat. Wenn ich da die Zukunftsvisionen von einigen sehe, dann kann ich nur
beten, da&szlig; es nie so wird. Viel zuviel nach dem PC-Muster!
<P>
Ich w&uuml;nsche mir wirklich wieder einen Amiga wie den 'alten', halt nur auf
dem neusten Stand. Was ist an der bisherigen Technik denn schlecht? Jetzt
kommt keiner mehr mit "zu lahm" und "veraltet"! Denkt bitte daran, seit
1994 KEINE neuen Modelle mehr, keine gro&szlig;en Schritte mehr! Wir k&ouml;nnen froh
sein, da&szlig; es uns noch so gut geht!
<P>
Ich bin bereit, mit anderen &uuml;ber die ganze Sache zu diskutieren! E-Mail:
<A HREF="mailto:wile.e@cww.de">wile.e@cww.de</A>
<P>
Bis dann!
<P>
Snoopy [Sascha van Wahnem]«</BLOCKQUOTE>
<P>


<P ALIGN=RIGHT>
<A HREF="0404.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0406.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
