<HTML>
<HEAD><TITLE>Testberichte</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0600.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0602.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>Testberichte</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H2>1. Testreihe: Die Multiview-Herausforderer - Teil 1 (von Uwe Pannecke)</H2>

<P>
»Seit einiger Zeit tummeln sich im Aminet einige Programme, die nach
Aussage ihrer Autoren angetreten sind, das bew&auml;hrte Multiview des OS 3.x zu
ersetzen.
<P>
Zum Teil, um den Multiview-Einsatz auch unter OS 2.x zu erm&ouml;glichen,
andererseits, um die vermeintlichen Schw&auml;chen des betagten Multifunktions-
Tools auszumerzen.
<P>
Ich habe mir die folgenden vier Programme etwas n&auml;her angesehen:
<P>
AView,
2bmvos2 (sehr einpr&auml;gsamer Name :-)),
iX- Guide,
UniView.
<P>
Dar&uuml;ber hinaus tritt Powerguide auf den Aminet-CD's an,
zumindest die Textanzeigefunktion von Multiview zu erweitern.
<P>
In loser Reihenfolge werde ich die oben genannten Programme einem
Praxistest unterziehen.
<P>
Heute der erste Kandidat:
<P>
<B>AView.</B>
<P>
Dem Programm liegt eine ausf&uuml;hrliche englische und deutsche Beschreibung
bei. AView soll laut Autor Guido Mersmann eine Erg&auml;nzung zu den Datatypes
und vor allem Multiview sein.
Dabei benutzt das Programm nicht nur vorhandene Datatypes f&uuml;r die Anzeige
der Daten, sondern erm&ouml;glicht dem User auch, f&uuml;r jedes beliebige
Dateiformat ein gew&uuml;nschtes Programm zu starten.
AView l&auml;uft ab OS 2.x.
Sollen Programme im Workbench-Modus gestartet werden, ist die
WBStart.library n&ouml;tig.
<P>
Die Installaton mittels Installer verlief ohne Probleme.
AView residiert in einer eigenen Schublade auf der Festplatte und l&auml;&szlig;t sich
so auch bei Nichtgefallen problemlos deinstallieren - einfach die Schublade
l&ouml;schen und die Pfad-Zuweisung auf AView aus der User-Startup entfernen.
Fertig. So sollte es auch sein.
<P>
Ich habe AView V1.46 unter CyberGfx 3.x auf einem A3k mit 12 MB Fast-RAM
und einem 040/40-Prozessor getestet.
<P>
Bevor man AView benutzt, ist es sinnvoll, AViewPrefs zu starten. Denn
dieses Programm erm&ouml;glicht die ganz individuelle Einbindung der
verschiedensten Datentypen (Text, Guide, diverse Bildformate, LHA-, DMS-
Archive, Animationen,...) und deren Behandlung.
Viele Dateitypen sind schon per default vordefiniert.
Im Expertenmodus kann man die "Identifizierer" f&uuml;r x-beliebige Dateitypen
ver&auml;ndern oder auch v&ouml;llig neue hinzuf&uuml;gen. Dabei bietet AView sinnvolle
Kommandos zur Unterst&uuml;tzung der Identifizierung an.
So lassen sich auch zuk&uuml;nftige oder exotische Dateitypen der bestehenden
Prefs-Liste anh&auml;ngen.
<P>
Nun erkennt AView alle Dateitypen, die definiert wurden und f&uuml;hrt die
entsprechenden Funktionen aus bzw. ruft die passenden Programme auf.
AView selbst kann &uuml;ber das CLI, die Workbench und/oder als AppIcon
(Einbindung in Toolmanager u.&auml;.) aufgerufen werden.
Der Start &uuml;ber die Workbench sorgt jedoch immer f&uuml;r die &Ouml;ffnung eines ASL-
Requesters, in dem dann die Datei ausgew&auml;hlt werden kann.
Ist AView als AppIcon oder Toolmanager-Dock ins System eingebunden, wird
AView alle Dateien anzeigen, die ihm &uuml;bergeben werden (vorausgesetzt, der
Dateityp wurde in AViewPrefs ber&uuml;cksichtigt).
<P>
Zus&auml;tzlich bietet AView ein kleines Hilfsprogramm namens AVDeficons. Dieses
erlaubt das Definieren von Piktogrammen f&uuml;r jeden Dateityp, den AView
kennt.
<P>
Der User braucht nur die Icons zu erstellen oder z.B. aus den
unersch&ouml;pflichen MagicWB- und NewIcon-Ozeanen zu fischen, den Rest erledigt
AVDeficons.
<P>
Auch hier sind schon einige Piktogramme im Lieferumfang enthalten.
Aber Vorsicht, ein paar Stolpersteine liegen im Weg. Und werden in der
Programmdokumentation beschrieben.
<P>
AView bestand einen umfangreichen Test und erledigte die ihm &uuml;bertragenen
Aufgaben klaglos.
Leider k&ouml;nnen im vorliegenden Programm-Paket nur 10 Dateitypen gleichzeitig
benutzt werden, denn AView ist Shareware. Der Autor bittet um 15,- DM und
liefert daf&uuml;r ein Keyfile, welches die gesperrten Funktionen freischaltet.
<P>
Alle Besitzer von DirectoryOpus jedoch k&ouml;nnen getrost AView vergessen (und
die RegGeb&uuml;hr f&uuml;r ein DOpus-Update sparen), denn DOpus bietet (neben vielen
anderen Dingen) auch AView-Funktionalit&auml;t.
<P>
Zu finden ist AView auf dem Aminet (oder den Aminet-CDs) im Verzeichnis
util/misc.
<P>
Der n&auml;chste Testkandidat wird 2bvmos2 sein.
<P>
Uwe Pannecke
<A HREF="mailto:Uwe.Panecke@t-online.de">Uwe.Panecke@t-online.de</A>«
<P>


<P ALIGN=RIGHT>
<A HREF="0600.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0602.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
