<HTML>
<HEAD><TITLE>Testberichte</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0601.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0603.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>Testberichte</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H2>2. Wordworth 7: Erste Erfahrungen (von Heiko Kuschel)</H2>

<P>
»Lange erwartet und schon vor einem halben Jahr angek&uuml;ndigt, ist Wordworth
7 nun endlich da. Es kommt auf einer CD-ROM daher, die die englische,
franz&ouml;sische und deutsche Version enth&auml;lt, daneben einige ClipArts (z.T.
andere als bei WW6!) und einige Dateien aus einer CD des englischen Amiga-
Magazins Amiga Format.
<P>
<H3>1. Installation</H3>
<P>
Im Gegensatz zur Installation der Version 6, ber&uuml;cksichtigt das neue
Installationsskript die Tatsache, da&szlig; es viele User gibt, die von einer
vorhergehenden Version updaten. Das bedeutet:
<P>
<UL><LI>
   Die Schublade Wordworth6 (bzw. Wordworth5 etc.) wird in Wordworth7
umbenannt, dadurch bleiben alle Dokumente erhalten. (Vorsicht mit
Assigns, die vielleicht auf ein Unterverzeichnis von Wordworth6 zeigen!
Die m&uuml;ssen nat&uuml;rlich angepa&szlig;t werden, ebenso alle Skripte, die den Pfad
eines Dokuments beinhalten.)
<P>
</LI><LI>
   Die Dateien AutoCorrect.txt, User Dictionary, RecentDocs bleiben
erhalten. Nicht jedoch die Konfigurationsdatei! Dem kann man leicht
abhelfen, indem man die alte Konfiguration unter einem anderen Namen
abspeichert, bevor man die Installation durchf&uuml;hrt. Dann mu&szlig; man
allerdings alle Pfade (z.B. der Rechtschreibpr&uuml;fung etc.) neu einstellen.
<P>
</LI><LI>
   Die alte Registriernummer wird automatisch &uuml;bernommen.
<P>
</LI></UL>
Von Hand eingestellt werden mu&szlig; allerdings das Verzeichnis f&uuml;r die
Dokumente. Es zeigt, wie in der englischen Version, auf das
Unterverzeichnis "Documents" statt "Dokumente". Einzustellen ist das im
Icon von Wordworth: Einmal anklicken, im Workbench-Men&uuml;
Piktogramm/Informationen... aufrufen, und dort &auml;ndern. Fertig.
<P>
<H3>2. Die Neuerungen</H3>
<P>
Neue Funktionen gibt es wieder einmal vor allem im Bereich der Objekte:
<P>
<UL><LI>
   Endlich, endlich k&ouml;nnen Objekte an einem frei einstellbaren Gitternetz
ausgerichtet werden. Nicht nur Objekte fallen darunter, sondern z. B.
auch die Trennlinien von Tabellen, die zwar beim Erstellen der Tabellen
ihre Standardeinstellung haben, aber sobald man sie mit der Maus erfa&szlig;t,
richten sie sich nach dem Gitter aus (falls die Option eingeschaltet ist,
nat&uuml;rlich). Auf diese Weise k&ouml;nnen nun - mit etwas Herumtricksen - auch
einzelne Zellen mit Farbe hinterlegt werden, da ein dahinterliegendes
"Box"-Objekt genau auf die Gr&ouml;&szlig;e der Tabelle abgestimmt werden kann.
<P>
</LI><LI>
   Au&szlig;erdem k&ouml;nnen Objekte auch in ihrer Position aufeinander abgestimmt
werden.
<P>
</LI><LI>
   Es gibt wieder mal eine neue Art von Objekt: Die sogenannten "Quick
Shapes" (Schnelle Formen). Es stehen verschiedene Sterne, Dreiecke,
Pfeile und Sprechblasen zur Verf&uuml;gung, die mit einem Mausklick ausgew&auml;hlt
werden k&ouml;nnen und in jeder beliebigen Gr&ouml;&szlig;e eingesetzt werden k&ouml;nnen.
Offenbar kann man allerdings die Auswahl dieser Quick Shapes nicht
beeinflussen. Schade, ich h&auml;tte z. B. gerne geschweifte Klammern
gehabt...
<P>
</LI><LI>
   Verkn&uuml;pfte Textrahmen: Das ist eine wirklich sinnvolle Neuerung. Endlich
ist es m&ouml;glich, da&szlig; Text, der in einen Textrahmen nicht mehr pa&szlig;t,
automatisch in den n&auml;chsten flie&szlig;t. Auch Silbentrennung zwischen den
Rahmen ist kein Problem, ebensowenig wie Vergr&ouml;&szlig;ern und Verkleinern der
Rahmen, Einf&uuml;gen von Text usw. Die Funktion scheint sehr zuverl&auml;ssig zu
arbeiten. Leider kann man Textrahmen nicht nachtr&auml;glich verkn&uuml;pfen. Dies
kann nur beim Erstellen eines neuen Rahmens geschehen.
<P>
</LI><LI>
   R&auml;nder um Grafiken. Auch Grafiken k&ouml;nnen nun mit einem Rand versehen
werden.
<P>
</LI><LI>
   Schriftattribute sind nun auch bei Texteffekten m&ouml;glich.
<P>
</LI></UL>
Weitere neue Funktionen:
<P>
<UL><LI>
   Automatische Rechtschreibpr&uuml;fung, wobei jedes unbekannte Wort rot
unterringelt wird (abschaltbar).
<P>
</LI><LI>
   Neue Optionen f&uuml;r die Rechtschreibpr&uuml;fung: Ganz gro&szlig;geschriebene W&ouml;rter
und W&ouml;rter, die Zahlen enthalten, k&ouml;nnen ignoriert werden.
<P>
</LI><LI>
   Kontext-Men&uuml;s: Ein Doppelklick auf die rechte Maustaste &ouml;ffnet
kontextabh&auml;ngige Men&uuml;s. Das ist sehr praktisch. Auch ein von der
Rechtschreibpr&uuml;fung erkanntes "falsches" Wort kann durch diese Funktion
gleich durch ein Wort aus der Vorschlagsliste ersetzt oder ins User-
Dictionary aufgenommen werden.
<P>
</LI><LI>
   Die RTF-Unterst&uuml;tzung wurde weiter verbessert. Dadurch ist ein leichterer
Textaustausch mit anderen Textverarbeitungen m&ouml;glich.
<P>
</LI><LI>
   Es gibt einen neuen "Cool Look", der zum Gl&uuml;ck auch abgeschaltet werden
kann. Er entfernt n&auml;mlich die R&auml;nder zwischen den Symbolen in der
Symbolleiste. Ich f&uuml;hle mich da ziemlich orientierungslos, aber das ist
wohl Geschmackssache...
<P>
</LI><LI>
   Durch Klicken an den linken Rand des Dokuments lassen sich ganze Zeilen
markieren.
<P>
</LI><LI>
   Einige (wenige) ARexx-Funktionen kamen dazu bzw. wurden erweitert. Z.B.
kann man jetzt Grafiken laden, aber leider noch nicht bestimmen, wo sie
plaziert werden sollen.
<P>
</LI><LI>
   Einige Schriften, die seit Wordworth 3.1. nicht mehr korrekt verarbeitet
wurden, erscheinen jetzt brav wieder.
<P>
</LI></UL>
<H3>3. Was fehlt?</H3>
<P>
<UL><LI>
   Ein sinnvoller ARexx-Port w&auml;re eine Grundvoraussetzung, um die Arbeit mit
Wordworth weitgehend automatisieren zu k&ouml;nnen. Leider ist es noch nicht
einmal m&ouml;glich, den Namen des aktuellen Dokuments herauszukriegen. Bei
vielen Befehlen kann man bisher nur den entsprechenden Requester &ouml;ffnen,
aber nicht selbst &uuml;ber ARexx Einstellungen vornehmen. Hier ist noch viel
Arbeit zu leisten.
<P>
</LI><LI>
   Die Fu&szlig;-/Endnotenverwaltung ist weiterhin unbrauchbar. Hier wurden
keinerlei Verbesserungen vorgenommen.
<P>
</LI><LI>
   Daneben g&auml;be es noch eine ganze Liste von kleinen
Verbesserungsm&ouml;glichkeiten, die ich hier nicht alle auff&uuml;hren will.
<P>
</LI></UL>
<H3>4. Fazit</H3>
<P>
Immerhin: Wordworth wird noch weiterentwickelt. Einige der Neuerungen sind
auch wirklich sinnvoll. Leider sind dies Neuerungen, die eher in Richtung
DTP gehen (Grafikobjekte!). Die f&uuml;r eine Textverarbeitung wichtigen
Funktionen, insbesondere die Fu&szlig;-/Endnotenverwaltung, liegen weiterhin
brach. Meine Examensarbeit habe ich mit Beckertext III geschrieben. Auch
mit der neuen Version Wordworth 7 w&uuml;rde mir bei damals ca. 180 Anmerkungen
wohl nichts anderes &uuml;brigbleiben.
<P>
Der Preis f&uuml;r das Update ist hoch. Ob die neuen Funktionen diesen Preis
rechtfertigen, mu&szlig; jeder selbst entscheiden. F&uuml;r mich war es keine Frage,
denn Wordworth ist das Programm, das ich jeden Tag benutze. Au&szlig;erdem bin
ich froh, da&szlig; &uuml;berhaupt noch Entwicklung stattfindet, und bin in diesem
Fall bereit, dazu meinen finanziellen Beitrag zu leisten.
<P>
Kontakt:<BR>
Stefan Ossowskis Schatztruhe<BR>
Veronikastr. 33<BR>
45131 Essen<BR>
Tel 0201/788778<BR>
Fax 0201/798447<BR>
Net <A HREF="http://www.schatztruhe.de">http://www.schatztruhe.de</A><BR>
E-Mail <A HREF="mailto:stefano@schatztruhe.de">stefano@schatztruhe.de</A>
<P>
Digita:
<A HREF="http://www.digita.com">http://www.digita.com</A>
<P>
Preis Update: 89,- DM (von beliebiger WW-Version)
neu: 129,- DM«
<P>


<P ALIGN=RIGHT>
<A HREF="0601.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0603.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
