<HTML>
<HEAD><TITLE>Testberichte</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0602.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0604.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>Testberichte</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H2>3. TurboPrint 6.02: Erste Erfahrungen (von Heiko Kuschel)</H2>

<P>
»TurboPrint war schon in den vorangegangenen Versionen ein zuverl&auml;ssiges
und stabiles Programm. Die Ausdruckergebnisse &uuml;bertreffen bei vielen
Druckern die der Original-Windows-Treiber. Nun ist die neue Version 6
erschienen, die nat&uuml;rlich wieder neueste Druckertreiber enth&auml;lt. Daneben
gibt es eine ganze Menge weiterer Neuerungen:
<P>
<H3>1. TurboPrint</H3>
<P>
Neben den neuen Druckertreibern hat das Hauptprogramm einige zus&auml;tzliche
Neuerungen erfahren. Eine wichtige ist sicherlich der PPC-Code, der
Ausdrucke bei vorhandenem PPC-Prozessor wesentlich beschleunigen soll.
Dieser Code kann von Irseesofts Homepage geladen werden, da er etwas sp&auml;ter
fertiggestellt wurde als TP 6.0.
Neu ist au&szlig;erdem die Einstellung f&uuml;r "Under Cover Removal" (UCR). In
bisherigen Versionen konnte man w&auml;hlen, ob Schwarz durch eine Mischung der
drei Grundfarben Gelb, Magenta und Cyan erzeugt werden soll oder direkt mit
schwarzer Farbe. Nun kann der Prozentanteil, in dem Schwarz die
Grundfarbenmischung ersetzen soll, frei eingestellt werden. Nat&uuml;rlich wurde
f&uuml;r jeden Druckertreiber wieder der optimale Wert ermittelt.
Ansonsten ist das Hauptmodul weitgehend unver&auml;ndert geblieben. Was sollte
man auch noch verbessern?
<P>
<H3>2. Der Druckerspooler (TurboSpool)</H3>
<P>
Dieses neue Programm, das optional gestartet werden kann, leitet
Druckausgaben zun&auml;chst auf die Festplatte um. Dadurch bleibt der Drucker
immer ansprechbar, auch wenn gerade gedruckt wird. Das ist besonders dann
interessant, wenn:
<UL><LI>
   verschiedene Dokumente nacheinander automatisch gedruckt werden sollen
</LI><LI>
   die Druckausgabe wesentlich langsamer ist als das Programm.
</LI></UL>
Selbst in Wordworth ist es z.B. m&ouml;glich, mehrere Druckauftr&auml;ge gleichzeitig
zu starten. Einer davon wird dann direkt gedruckt, die anderen auf
Festplatte zwischengespeichert. Und wenn man schnell zwischen den schon
laufenden Druckauftr&auml;gen noch etwas zwischenschieben will: Kein Problem.
Die Reihenfolge, in der die Dokumente gedruckt werden, ist beliebig
ver&auml;nderbar. Allerdings mu&szlig; man bedenken, da&szlig; TurboSpool die Druckzeit ein
klein wenig erh&ouml;ht, da zus&auml;tzliche Rechenzeit f&uuml;r die Zwischenlagerung und
Verwaltung der Daten erforderlich ist.
Der erste Eindruck dieses Programmteils ist: Durchdacht, stabil,
zuverl&auml;ssig und praktisch. Schon allein hierf&uuml;r lohnt sich das Update
meines Erachtens.
In der Anleitung steht, da&szlig; TurboSpool mit TurboCalc und FinalCalc nicht
zusammenarbeitet. Ein erster Test hat bei mir mit TurboCalc aber keine
Probleme ergeben - abgesehen von denen, die ich mit TC beim Drucken sowieso
schon habe.
<P>
<H3>3. Der GrafikPublisher</H3>
<P>
Dieser Programmteil mausert sich langsam, aber sicher, zum lupenreinen
DTP-Programm. Neben Bildern in nahezu allen bekannten Grafikformaten
(allerdings keine Vektorgrafiken) lassen sich nun auch Texte einbinden. Die
Texteingabe ist noch nicht hundertprozentig ausgereift, aber durchaus
akzeptabel. Es l&auml;&szlig;t sich jede beliebige ins System eingebundene Schrift
verwenden, dazu die Styles "fett" und "kursiv". Hintergrundfarbe und
Schriftfarbe k&ouml;nnen frei eingestellt werden.
Die Schriftgr&ouml;&szlig;e pa&szlig;t sich automatisch der Gr&ouml;&szlig;e des Textrahmens an. Dabei
ist auch die M&ouml;glichkeit sehr interessant, eine durchsichtige Schrift auf
undurchsichtigem Hintergrund zu verwenden. In diesem Fall scheint das
dahinterliegende Bild an den Buchstaben hervor.
Neu ist auch die Funktion "PhotoOptimize", die Bilder (z.B. gescannte
Photos) analysiert und die optimalen Druckwerte f&uuml;r dieses Bild berechnet,
so da&szlig; diese Bilder mit noch mehr Brillanz gedruckt werden k&ouml;nnen.
<P>
<H3>4. Das Handbuch</H3>
<P>
Wieder einmal wurde nur ein Erg&auml;nzungshandbuch zum Handbuch der Version 4
gedruckt. Dieses f&uuml;hrt allerdings gut verst&auml;ndlich in alle Neuerungen ein
und ist durchaus gelungen.
<P>
<H3>5. Inkompatibilit&auml;ten</H3>
<P>
Wie bereits erw&auml;hnt, arbeitet TurboPrint offenbar nicht korrekt mit
TurboCalc und FinalCalc zusammen. Warum, wurde nicht erkl&auml;rt. Ich konnte es
bisher auch nicht herausfinden.
Au&szlig;erdem besteht weiterhin das Problem, da&szlig; TurboPrint alle Druckausgaben
auf den Drucker umleitet. Wenn man also z.B. mit STFax ein Fax aus einer
Textverarbeitung versenden will, mu&szlig; TurboPrint vorher beendet werden.
Dieses Problem ist aber systembedingt und l&auml;&szlig;t sich wohl nur schwer
abstellen.
<P>
<H3>6. Fazit</H3>
<P>
TurboPrint ist weiterhin die Referenz der Druckertreiber auf dem Amiga. Wer
professionell drucken will, kommt an TurboPrint nicht vorbei. Das Update
ist meines Erachtens in jedem Fall empfehlenswert.
<P>
Preis: DM 149,-<BR>
Update von Version 5: DM 49,-
<P>
Bezugsadresse:
Irseesoft<BR>
Meinrad-Spie&szlig;-Platz 2<BR>
87660 Irsee<BR>
<P>
Tel. 08341/74327<BR>
Fax  08341/12042<BR>
<P>
<A HREF="http://www.irseesoft.com">http://www.irseesoft.com</A>«
<P>


<P ALIGN=RIGHT>
<A HREF="0602.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0604.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
