<HTML>
<HEAD><TITLE>AMIGA ActionGamesPlayerJoker - von Jens Schr&ouml;der (jschroe@gwdg.de)</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0703.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0705.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>AMIGA ActionGamesPlayerJoker - von Jens Schr&ouml;der (jschroe@gwdg.de)</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H2>4. Spiele-News aus aller Welt</H2>


<H3>clickBOOM-News</H3>

Mit einer beispiellosen Aktion sorgte clickBOOM in diesem Monat f&uuml;r
Aufsehen. In einer E-Mail an alle clickBOOM-News-Abonnenten waren nur die
Worte "bad news from clickboom - more on our homepage" zu lesen.
Begab man sich nun dorthin, konnte man folgendes lesen:
<P>
"clickBOOM<BR>
1994 - 1998<BR>
April 13, 1998.<BR>
<P>
Dear visitor,
You are probably here looking for clickBOOM web site and info on our
latest game developments. Unfortunately, the only news we can report is the
worst news of all - clickBOOM as a development team does not exist anymore.
The inevitable has happened, and we have to go. We might be back one day,
in some better, more peaceful future. Until then, we will be missing each
and every one of you, for you were our inspiration."
<P>
Ein Mausklick weiter hie&szlig; es:
<P>
"clickBOOM<BR>
1994 - 1998<BR>
<P>
It was fun making video games, and we'll miss it dearly. But, there is no
choice now. Maybe one day those of us who survive will try to work with
computers again... It's hard to think about that now.
We hope you were prepared for The News. You must have heard all the
warnings, and like us, thought it would all somehow resolve itself.
But it didn't...
The boiling point was reached last night and..."
<P>
Doch einen Mausklick weiter l&ouml;ste sich das R&auml;tsel. Der einzige Grund f&uuml;r
die erschreckenden Worte von clickBOOM war die Ank&uuml;ndigung des neuen
Spiels "Napalm: The Crimson Crisis", bei dem es sich um einen Command &
Conquer-Clone der Extraklasse handelt (Screenshots lassen vermuten, da&szlig;
es sich dabei um das Spiel Diversia handelt, von dem schon lange nichts
Neues mehr zu h&ouml;ren war). "The War has started" war noch zu lesen, und
einen Mausklick weiter wurden auch jene aufgekl&auml;rt, die immer noch nichts
verstanden hatten:
<P>
"For those of you who have no clue what is going on -- no, of course we are
not going anywhere, it's the fictional war in NAPALM that started last
night. So, take a cold drink, and if you haven't already ordered Quake and
Myst, what in hell are you waiting for? Obviously we have to send the
NAPALM army to persuade you.
Oh, and don't forget to tell your Amiga friends about the bad news."
<P>
clickBOOM hat sich dazu entschieden, ein neues Spiel zu programmieren,
anstatt zu versuchen, eine Lizenz des PC-Originals Command & Conquer 1
oder 2 zu erwerben. Nur so kann man laut clickBOOM eigene Vorstellungen
in das Spiel einbringen. Napalm spielt in der nahen Zukunft. Der Spieler
hat die Aufgabe, agressive Roboter zu stoppen, die der Mensch einst selbst
entwickelte. Ziel des Spiels ist logischerweise die Zerst&ouml;rung der
feindlichen Armee. Daf&uuml;r stehen dem Spieler High-Tech-Waffensysteme und
jede Menge Fahrzeuge zur Verf&uuml;gung. Napalm l&auml;&szlig;t sich allein oder zu zweit
spielen. Mindestvoraussetzungen sind 68020 + 8 MB Fast-RAM + 2xCD-ROM +
HD. Empfohlen werden allerdings ein 060-Prozessor, 16 MB Fast-RAM und ein
4xCD-ROM-Laufwerk. Grafikkarten werden unterst&uuml;tzt, das Spiel soll au&szlig;erdem
absolut multitaskingf&auml;hig und systemfreundlich sein. Ein Erscheinungstermin
steht (leider) noch nicht fest.
<P>
Als weitere Werbema&szlig;nahmen f&uuml;r Napalm hat clickBOOM ein Gewinnspiel ins
Leben gerufen, bei dem es 1000 kanadische Dollar (ca, 1250 DM) zu gewinnen
gibt. Um dieses Geld zu gewinnen, mu&szlig; man Napalm bei clickBOOM
vorbestellen. Weitere Aktionen sind die M&ouml;glichkeit f&uuml;r Leute, die alle 3
bisherigen clickBOOM-Spiele registrieren lassen haben, Napalm f&uuml;r den
halben Preis zu erwerben, sowie die M&ouml;glichkeit, ein clickBOOM-Spiel nach
Wahl zu gewinnen, wenn man Napalm vorbestellt.
<P>
<A HREF="img/Napalm.jpg">Logo</A><BR>
<A HREF="img/Napalm2.jpg">Screenshot</A>
<P>
&Uuml;brigens ist Quake nun von id Software abgesegnet worden und wird wohl
demn&auml;chst endg&uuml;ltig erscheinen. Au&szlig;erdem ist im Aminet ein ca. 20 MB
gro&szlig;es Demo des Spiels Myst erschienen. Die aktuelle QuakePlayer-Version
ist 0.96.
<P>
<H3>Sadeness-News</H3>
<P>
Nach vielen Verschiebungen soll Foundation nun endg&uuml;ltig auf der "World of
Amiga"-Messe erscheinen, die am 16. und 17. Mai in London stattfindet.
Die neuesten Features des Spiels sind CDDA-Audio-Tracks, AHI-Support und
eine 99%-Chance auf TCP-Support.
Dafel: Bloodline sieht nach Angaben von Sadeness immer besser aus, nachdem
man drei neue Grafiker verpflichtet hat. Die Mischung aus "Legend of Zelda
und Beat Em Up-Elementen wird &uuml;ber gerenderte Sprites verf&uuml;gen.
<P>
<H3>Vulcan-News</H3>
Abgesehen davon, da&szlig; sich die Vulcan-Homepage seit dem 1. April in einem
neuen, aber un&uuml;bersichtlicheren Layout befindet, gibt es News zu Desolate.
Desolate wird ein Spiel mit starken &Auml;hnlichkeiten zum Bitmap Brothers-
Klassiker Gods. Es wird &uuml;ber 12 gro&szlig;e Level verf&uuml;gen und 30 verschiedene
Feinde bieten. Desolate wird Shoot-Em-Up-, aber auch Puzzle-Elemente
beinhalten. Digitale Sprache, 3D-Stereo-Sound und eine 3D-Intro-Animation
runden das Spiel ab. Desolate soll im Juni erscheinen.
Systemvoraussetzungen sind lediglich 2 MB Chip-RAM und ein CD-ROM-Laufwerk.
<P>
<A HREF="img/Desolate.png">Screenshot</A>
<P>
<H3>Epic-News</H3>
<P>
Die beiden Spiele, die von Hurricane Software entwickelt werden, werden
bei Epic erscheinen. Escape towards the Unknown ist ein Adventure im
Monkey Island-Stil. Es wird Grafikkarten und AHI unterst&uuml;tzen. Eat the
Whistle wird ein Fu&szlig;ballspiel, das u.a. gesprochene Kommentare bieten wird.
Es soll im Juli auf Disk und CD erscheinen.
<P>
Au&szlig;erdem erscheint bei Epic Anfang Mai Virtual Karting 2, das selbst auf
unaufger&uuml;steten AMIGAs 50 fps bieten soll und auf Disk und CD erscheinen
wird.
<P>
Der Director's Cut von Gloom 3 bietet unter anderem ein 20-min&uuml;tiges Intro,
80 Levels, 42 neue Levels, 20 neue Zombies (in 49 Frames statt 14),
komplett neue Grafiken und Sounds, sowie die komplette Gloom 3-Website auf
der CD. Weiterhin soll das Spiel schneller als der Vorg&auml;nger sein und
Support f&uuml;r Grafikkarten bieten. Erscheinungstermin ist der Sommer.
Ab sofort sind die CD-Version von Sixth Sense Investigations und das Spiel
Mobile Warfare erh&auml;ltlich. Tests dieser Spiele (hoffentlich) demn&auml;chst in
AMIGA AGPJ.
<P>
<H3>APC&TCP-News</H3>
<P>
Nachdem nun auch APC&TCP eine Website hat, gibt es hier ein paar
ausf&uuml;hrlichere News zu den zuk&uuml;nftigen Spielen:
Skaut wird ein Adventure im LucasArts-Stil und soll im September
erscheinen. Erste Screenshots sehen allerdings nicht sehr &uuml;berzeugend aus.
Adventure-Shop wird ein Autorensystem, das es jedem erm&ouml;glichen wird,
umfangreiche Adventures in der Art von Myst zu erstellen. Adventureshop-
Projekte werden AGA und Grafikkarten gleicherma&szlig;en unterst&uuml;tzen. Ein
Preview des Programmes k&ouml;nnt Ihr weiter unten lesen.
Phoenix soll ein Weltraum-3D-Action-Strategiespiel werden, also Wing
Commander und Elite-Elemente verbinden. Es bietet au&szlig;erdem eine
durchgehende Story, die sich &uuml;ber 4 Sternensysteme erstrecken wird. Der
Flug zwischen den Planeten wird mittels einer Polygon-Texturemap-Engine
vonstatten gehen, die durch viele Effekte veredelt wird. Die 2D-Grafiken
des Spiels (also die Zwischengrafiken etc.) wurden zu 75 % mit Maxon Cinema
4D erstellt. Systemvoraussetzungen sind ein 68030/50-Prozessor, AGA und 4MB
Fast-RAM. Unterst&uuml;tzt werden Grafikkarten, Multiscan-Monitore, mehr RAM,
68040- und 68060-Prozessoren. Screenshots des Spiels lassen einen gro&szlig;en
Hit vermuten, aber warten wir ab, bis das Spiel im November erscheint.
<P>
<A HREF="img/Phoenix.jpg">Screenshot1</A><BR>
<A HREF="img/Phoenix2.jpg">Screenshot2</A><BR>
<A HREF="img/Phoenix3.jpg">Screenshot3</A><BR>
<A HREF="img/Phoenix4.jpg">Screenshot4</A><BR>
<P>
Testament 2 ist der Nachfolger des mittelm&auml;&szlig;igen 3D-Shooters Testament.
Das Spiel soll im Juli erscheinen, und setzt einen AMIGA 1200 mit 2 MB
Chip-RAM und 1 MB Fast-RAM voraus (nat&uuml;rlich werden auch 040/060-
Prozessoren unterst&uuml;tzt).
Ob das Rollenspiel Magic Island erscheinen wird, steht noch nicht fest.
Auch die Fans von Flyin' High (gibt es welche?) werden weiter bedient. Im
Juni soll die 2. Daten-Disk erscheinen, die weitere Welten und neue Sounds
bieten wird.
Forest Dumb Forever, das nun doch erscheinen wird, ist ein nettes kleines
Jump N Run und ben&ouml;tigt lediglich 1 MB RAM.
GunBee F-99, ein Shoot-Em-Up wird im Juli erscheinen.
Skimmers (Preview in einer fr&uuml;heren AGPJ-Ausgabe) wird nun im Dezember
erscheinen.
Das Adventure Daydream (AGPJ berichtete in der letzten Ausgabe) erscheint
erst 1999.
Westerados soll ein "Spiel à la Siedler" werden. Man darf gespannt sein.
Es erscheint ebenfalls erst 1999.
Das Shoot Em Up Pulsator soll nun im Juni erscheinen. Es wird u.a. &uuml;ber
512 Farben gleichzeitig und 50 Frames pro Sekunde bieten.
Kurz vor Redaktionsschlu&szlig; wurde noch bekannt, da&szlig; APC & TCP ein weiteres
Spiel ver&ouml;ffentlicht: SeaSide erscheint im November. N&auml;here News dazu
demn&auml;chst in AMIGA AGPJ.
<P>
<H3>Sayonara Software zur&uuml;ck</H3>
<P>
Die Firma Sayonara Software, die dem AMIGA bereits Spiele wie die beiden
Samba Partie-Fu&szlig;ballmanager beschert hat, kehrt mit den Spielen Samba World
Cup und Travel Manager zur&uuml;ck zum AMIGA. Letzteres ist bereits erschienen
(einen Test gibt es in der n&auml;chsten AMIGA AGPJ).
<P>
<H3>New Generation Software</H3>
<P>
New Generation bringt angeblich demn&auml;chst ein Spiel namens Tennis Manager
heraus.
<P>
<H3>Moonbases erscheint bei Verkosoft</H3>
<P>
Das Echtzeit-Strategiespiel Moonbases von Homegrown Software hat einen
Publisher: Verkosoft. Das Spiel wurde von Dune II, Command & Conquer und
Warcraft beeinflu&szlig;t und bietet geraytracte Grafiken und Sprachausgabe.
Screenshots des Spiels sehen zwar nicht sehr berauschend aus, aber
vielleicht straft mich das fertige Produkt ja L&uuml;gen. Moonbases erscheint
in den n&auml;chsten Monaten auf Disketten und CD.
<P>
<H3>Aufregung um Lambda</H3>
<P>
Nachdem eine neue Demo-Version des Spiels Lambda (Preview weiter unten)
erschienen war, das sehr positive Resonanz im Internet bekam, sorgte der
Programmierer selbst f&uuml;r Aufregung. F&uuml;r mehrere Tage waren auf der Lambda-
Homepage nur die Worte "Amiga Sux - Go buy a PC" zu lesen. Entgegen ersten
Vermutungen, die von Hackern ausgingen, war es der Programmierer selbst,
der in einer Phase von Frustration &uuml;ber die geringen F&auml;higkeiten der AMIGA-
Hardware diese Worte verfa&szlig;te. Mittlerweile ist die Homepage jedoch wieder
voll funktionst&uuml;chtig und das Spiel wird weiterprogrammiert.
Inzwischen gibt es sogar eine neue Lambda-Homepage. Die Adresse gibt es
weiter unten in den Bookmarks.
<P>
<A HREF="img/Lambda.jpg">Screenshot</A>
<P>
<H3>neues 3D-Spiel: Enforce</H3>
<P>
Tschechische Programmierer entwickeln ein neues 3D-Rollenspiel, das eine
&auml;hnliche 3D-Engine wie Quake bietet, aber dreimal so schnell sein soll.
Erste Screenshots sehen hervorragend aus. Systemvoraussetzungen sind 040,
AGA, 8 MB RAM und ein CD-ROM-Laufwerk. Grafikkarten werden unterst&uuml;tzt.
Enforce wird mehrere Missionen enthalten, in denen jedoch nicht nur
geballert werden mu&szlig;. Auch ein PPC-Support soll wahrscheinlich kommen.
Eine Demo-Version wird demn&auml;chst ver&ouml;ffentlicht.
<P>
<A HREF="img/Enforce.jpg">Screenshot1</A><BR>
<A HREF="img/Enforce2.jpg">Screenshot2</A>
<P>
<H3>Doom/Descent-Update: neue Versionen</H3>
<P>
<PRE>DoomAttack 0.8
ADoom PPC 1.2
ADescent 0.6
Descent 0.39  ... alles im Aminet downloadbar</PRE>
<P>
<H3>Alpha Software</H3>
<P>
Alpha Software, die im Moment Gloom 3: Director's Cut produzieren,
entwickeln nun einen Resident Evil-Clone f&uuml;r den AMIGA: The Dead Walk.
Das Spiel soll Grafiken in unglaublich hohen Aufl&ouml;sungen und Polygon-
Sprites bieten. The Dead Walk hat noch keinen Publisher, soll aber
mindestens so gut wie Resident Evil auf PC und Playstation werden.
Angesichts des letzten Produkts von Alpha Software, Ultimate Gloom, kann
man da aber noch ein bi&szlig;chen skeptisch sein. Das Spiel soll noch im Sommer
1998 erscheinen.
<P>
Weiterhin wird bei Alpha Software das Rennspiel Tiny Car Racing entwickelt,
das als Mix aus Supersprint, Super Off Road, Badlands und Indy Heat
bezeichnet wird. Die Grafiken sollen hervorragend aussehen, trotzdem
soll das Spiel auch auf normalen 020ern spielbar sein.
<P>
<H3>UFO: Enemy Unknown-Vollversion auf Amiga Format-CD-ROM</H3>
<P>
Die Vollversion des Strategie-Klassikers UFO: Enemy Unknown befindet sich
auf der n&auml;chsten AMIGA Format-CD-ROM. In UFO &uuml;bernimmt der Spieler die
Rolle eines X-COM-Mitglieds, einer Organisation, die die Alien-Invasion
auf der Erde zur&uuml;ckdr&auml;ngen soll. Das Spiel erschien urspr&uuml;nglich 1994 bei
Microprose. Alle Strategie-Spiel-Fans, die UFO noch nicht besitzen, wissen,
was zu tun ist: AMIGA FORMAT 4/98 mit AFCD 25 (Ausgaben- und CD-Nummer ohne
Gew&auml;hr) kaufen !
<P>
<H3>Alive Mediasoft-News</H3>
<P>
Alive Mediasoft produziert ab sofort auch Software f&uuml;r Kinder. Geplant
sind u.a. ein Malprogramm, ein Computerlernprogramm, Programme um lesen
und schreiben zu lernen, usw. f&uuml;r drei- bis elfj&auml;hrige.
Unterdessen h&ouml;rt die Verwirrung um den Alive Mediasoft-Split (AGPJ
berichtete) nicht auf. Spiele wie Haunted sollen nun doch bei Alive
erscheinen, und nicht bei der angeblich gegr&uuml;ndeten Firma Crystal
Software.
<P>
Au&szlig;erdem legt Alive Mediasoft das Myst-&auml;hnliche Adventure "Labyrinth of
Time" neu auf, das 1993 von Electronic Arts herausgebracht wurde.
<P>
<H3>Wingnuts</H3>
<P>
Das in den englischen Zeitschriften bereits als kommerzielles Spiel
getestete Wingnuts ist als Shareware ver&ouml;ffentlicht worden. Wingnuts ist
ein Shoot-Em-Up, bei dem man verschiedene Flugger&auml;te steuert und 5 andere
Spieler abschie&szlig;en mu&szlig;. Systemvoraussetzung ist ein AGA-AMIGA mit 2 MB RAM
und einer Festplatte. Die Shareware-Geb&uuml;hr ist 5 englische Pfund. Die Tests
in der englischen Presse waren allerdings nur mittelm&auml;&szlig;ig. Ein Test
demn&auml;chst in AMIGA AGPJ.
<P>
<H3>Martian Tales-Update</H3>
<P>
Die Reihen des angek&uuml;ndigten Command&amp;Conquer-Clones lichten sich. So haben
die Programmierer des Spiels Martian Tales nun beschlossen, ihr Spiel in
eine andere Richtung weiterzuprogrammieren. Das Spiel soll nun eher
&Auml;hnlichkeiten zu Colonisation und Civilization haben und wird auf Runden
basieren. Erste Screenshots lassen ein witziges Spiel vermuten.
<P>
<A HREF="img/MartianTales.png">Screenshot</A>
<P>
<H3>Fortress of Fear-Update</H3>
<P>
Der Diablo-Clone Fortress of Fear von Digital Reality SoftworX verz&ouml;gert
sich etwas. Eine Ende M&auml;rz angek&uuml;ndigte Demo-Version soll nun im Sommer
erscheinen. Erste Screenshots des Spiels soll es noch Ende April geben.
Neueste Features sind CD-Audio, komplette Sprachausgabe, etc.
<P>
<H3>neuer Fu&szlig;ballmanager: The Boot Room</H3>
<P>
Dynamic Youth Software entwickelt ein neues Fu&szlig;ballmanagerspiel namens
The Boot Room. Es soll das bieten, was die AMIGA-Version von Championship
Manager 2 nicht bieten konnte. Es soll gesprochene Kommentare, Interviews
mit Sprache, ein gerendertes Intro, einen Daten-Editor und vieles mehr
bieten. Wann es erscheinen wird, steht in den Sternen.
<P>
<H3>Nulikon</H3>
<P>
Nulikon soll laut Programmierer-Team eine Mischung aus Turrican und Mario
64 werden, also ein 3D-Platform-Shoot Em Up. Erste Screenshots sehen nicht
sehr gut aus; die Entwickler suchen auch noch Hilfe bei den 2D- und 3D-
Grafiken, bei Musik und bei Programmierung - mit anderen Worten bei allem.
Ein Demo soll in den n&auml;chsten Monaten erscheinen - man wird sehen.
<P>
<H3>Beyond</H3>
<P>
Ein Lambda-&auml;hnliches Spiel, das als Hauptfeature die M&ouml;glichkeit des
Spielens &uuml;ber das Internet bieten soll, ist angeblich in der Entwicklung.
Weitere Details &uuml;ber Beyond gibt es noch nicht.
<P>


<P ALIGN=RIGHT>
<A HREF="0703.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0705.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
