<HTML>
<HEAD><TITLE>Diverse Neuigkeiten</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="1106.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="1108.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>Diverse Neuigkeiten</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H2>7. Update-Information zum Raytracer Tornado 3D</H2>

<P>
In der letzten Ausgabe von AMIGA aktuell war bereits eine Kurzmeldung
ver&ouml;ffentlicht, nachfolgend die offizielle Information zum Update des
Raytracers Tornado3D:
<P>
<BLOCKQUOTE>»HAAGE & PARTNER NEWS April, 1998
<P>
Tornado3D: Der Sturm tobt weiter
<P>
Ab sofort ist das 3D-Rendering-Programm Tornado3D in der Version 1.5
verf&uuml;gbar. Gegen&uuml;ber der Vorg&auml;ngerversion wurden eine Reihe von
Verbesserungen und Erweiterungen vorgenommen, wobei sehr viel Wert darauf
gelegt wurde, auf die von den Benutzern ge&auml;u&szlig;erten W&uuml;nsche einzugehen.
<P>
Die neue Version bietet unter Anderem die M&ouml;glichkeit, einzelne Objekte
optional mittels Raytracingberechnen zu lassen und diese frei mit anders
berechneten Objekten zu kombinieren.
<P>
Freiform-Deformationsk&auml;fige erm&ouml;glichen ein sehr viel einfacheres und
glaubw&uuml;rdigeres Objekt-Morphing, und dank Field-Rendering und
Broadcast-Encoding erf&uuml;llt Tornado3D jetzt alle Voraussetzungen f&uuml;r das
Aufzeichen von Animationen auf Video in h&ouml;chstm&ouml;glicher Qualit&auml;t.
<P>
F&uuml;r das Erstellen von Objekten von Grund auf, bietet Tornado3D ab sofort
auch die bekannte und beliebte Schicht-Aufbau-Methode. Zus&auml;tzlich steht nun
eine Reihe von vorgefertigten Spline-Pfaden in verschiedenen Formen (z.B.
Kreis, Quadrat) auf einen Men&uuml;aufruf hin zur Verf&uuml;gung.
<P>
Das Erstellen von Animationen ist nun noch einfacher und intuitiver - fast
jede Art von Keyframe wird bei Bedarf automatisch erzeugt. Zus&auml;tzlich wurde
aber noch der Positur-Manager eingef&uuml;hrt, der das Verwalten der
Objektzust&auml;nde vereinfacht, und dar&uuml;ber hinaus die Inter- und Extrapolation
neuer Keyframes aus bestehenden erm&ouml;glicht.
<P>
Der Virge-Chip auf der CyberVision64/3D Graphikkarte wird jetzt vollst&auml;ndig
unterst&uuml;tzt, dadurch wird eine schnellere Darstellung der Vorschau erzielt,
wie sie selbst mit einem 68060 alleine nicht m&ouml;glich w&auml;re.
<P>
Als weitere Neuerung bietet Tornado3D jetzt Verschiebungs-Maps und
-texturen. Im Gegensatz zu Bump-Maps haben Verschiebungs-Maps eine echte
Auswirkung auf die Objektgeometrie, was vielf&auml;ltige und realistische
Effekte erm&ouml;glicht, die das rein optische Bump-Mapping nicht bieten kann.
<P>
Das von Tornado3D verwendete Kamera-Modell bietet nun eine fast
vollst&auml;ndige Simulation einer realen Spiegelreflex-Kamera, deren technische
Daten in weiten Grenzen ge&auml;ndert werden k&ouml;nnen. Damit einher geht eine
Verbesserung der Tiefensch&auml;rfe-Simulation und eine verbesserte Kontrolle
&uuml;ber die Bewegungsunsch&auml;rfe.
<P>
F&uuml;r die Anf&auml;nger unter den Benutzern bietet Tornado3D nun n&uuml;tzliche Tips,
die beim Programmstart und auf Wunsch angezeigt werden k&ouml;nnen und
hilfreiche Hinweise zur Arbeit mit Tornado3D geben.
<P>
Das Speichern von Projekten wurde bequemer und sicherer gestaltet - alle im
Projekt verwendeten Objekte werden in einem eigenen Projekt-Verzeichnis
abgelegt - auf diese Weise ist es nicht mehr m&ouml;glich, versehentlich ein
Projekt zu speichern, ohne die darin enthaltenen Objekte ebenfalls zu
sichern. Weiterhin bietet Tornado3D &uuml;ber das Men&uuml; sofortigen Zugriff auf
die sechs zuletzt ge&ouml;ffneten Projekte und Objekte.
<P>
Dar&uuml;ber hinaus wurde noch eine Vielzahl von Kleinigkeiten verbessert, die
alle hier aufzulisten nicht m&ouml;glich ist.
<P>
Die Version 1.5 wird an registrierte Kunden kostenlos vom Hersteller
verschickt.
 
<P>
To get more information, please visit our homepage:
www.haage-partner.com
<P>
HAAGE & PARTNER is the leading manufacturer of Development Systems and
Applications for the Amiga family of computers. The Storm series (StormC,
StormWizard, StormPowerASM) for 68K AmigaOS, PowerPC and p.OS provide a
powerful suite of programming tools. Our latest project is MERAPI, which
will bring the power of JAVA to the Amiga.
HAAGE & PARTNER is also the developer and/or distributor of several cutting
edge applications including: ArtEffect, PowerEffects, EasyWriter,
DrawStudio, Tornado3D, NetConnect and ClassX products. Our mission is to
provide the Amiga market with the most effective tools and applications
possible. It's not enough to just ask: "Where do you want to go?" At Haage
& Partner we are harnessing the power of the Amiga to actually help get you
there!
<P>
HAAGE & PARTNER Computer GmbH, PO Box 80, 61191 Rosbach, Germany<BR>
Phone: +49 - 6007 - 930050, Fax: +49 - 6007 - 7543<BR>
Email: <A HREF="mailto:info@haage-partner.com">info@haage-partner.com</A> Internet: <A HREF="http://www.haage-partner.com">http://www.haage-partner.com</A>
<BR>
We develop to WarpUP the Amiga!«</BLOCKQUOTE>
<P>


<P ALIGN=RIGHT>
<A HREF="1106.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="1108.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
