<HTML>
<HEAD><TITLE>Diverse Neuigkeiten</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="1107.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="1109.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>Diverse Neuigkeiten</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H2>8. ImageFX 3.0 auf dem Markt</H2>

<P>
Oberland Computer informiert &uuml;ber die neue Version der Grafiksoftware
ImageFX, die f&uuml;r 349 Mark erh&auml;ltlich ist (ein Update von v1.5 kostet 269
Mark, eines von v2.0 - 2.6 189 Mark):
<P>
<BLOCKQUOTE>»ImageFX 3.0 ist nun verf&uuml;gbar!
<P>
Das lange erwartete Update auf die Version 3.0 von ImageFX von Nova Design,
dem Hersteller der vielfach ausgezeichneten Programmpakete ImageFX und
Aladdin 4D, wird ab sofort ausgeliefert! ImageFX ist seit Jahren ein Mu&szlig;
f&uuml;r jeden Amiga-Besitzer; es vereint Malfunktionen, Formatkonvertierung,
Bildverarbeitung und Special Effects und belegt daher eine Spitzenfunktion
in Sachen Bildbearbeitung f&uuml;r den Amiga.
<P>
Bob Fisher, Vizepr&auml;sident von Nova Design: "In die Entwicklung von ImageFX
3.0 sind zahllose W&uuml;nsche unserer Kunden eingeflossen. Neben vielen tollen
Verbesserungen an der Benutzeroberfl&auml;che lassen sich Bilder nun auch im
Hintergrund neuzeichnen, es gibt eine verbesserte Vorschaufunktion mit
Vergr&ouml;&szlig;erungsm&ouml;glichkeit, mehrere Bildfenster gleichzeitig, unz&auml;hlige neue
Effekte und sogar verschiedene Bildebenen und vieles mehr!
<P>
Die Highlights von ImageFX 3.0
<P>
Das professionelle Erscheinungsbild der Benutzeroberfl&auml;che mit seinem
Paintbox-Aussehen entspricht immer noch den Amiga-Systemrichtlinien und den
hohen Anforderungen der Video- und Filmindustrie. Bei ImageFX 3.0 wurde
dieser Ansatz jedoch um eine ganze Reihe von Konzepten erweitert:
Untermen&uuml;s, die st&auml;ndig ge&ouml;ffnet bleiben k&ouml;nnen und somit einen schnellen
Zugriff auf h&auml;ufig ben&ouml;tigte Funktionen gew&auml;hren; gr&ouml;&szlig;ere
Effektvorschaufenster mit Funktionen, um den sichtbaren Bereich zu
verschieben, zu vergr&ouml;&szlig;ern und zu verkleinern; Fontsensibilit&auml;t; mehrere
Bildfenster gleichzeitig, auch f&uuml;r dasselbe Bild; unterschiedliche,
voneinander unabh&auml;ngige, PhotoshopTM-kompatible Bildebenen zur Erstellung
komplexer Bildcollagen, die sich beliebig oft und problemlos modifizieren
lassen, und viele weitere Verbesserungen.
<P>
Schon immer war die system&uuml;bergreifende Funktionalit&auml;t eine der gr&ouml;&szlig;ten
St&auml;rken von ImageFX. Durch die Unterst&uuml;tzung einer gro&szlig;en Anzahl von
Grafikformaten lassen sich aber nicht nur Grafikdateien von allen anderen
Computersystemen laden und speichern: Die neue Version unterst&uuml;tzt sogar
das "Photoshop"-eigene Dateiformat, so da&szlig; beim Export von Photoshop-
Dateien in ImageFX die individuellen Bildebenen erhalten bleiben! Au&szlig;erdem
bietet ImageFX nun die M&ouml;glichkeit, Grafikdaten im CMAP-Format zu laden, um
eine schnelle, genaue Konvertierung dieser Daten zu erm&ouml;glichen.
<P>
In der vorliegenden Ausgabe sind nun optimierte Versionen f&uuml;r 68040- und
68060-Prozessoren enthalten.
<P>
Schon immer geh&ouml;rten die "Special Effects" zu den herausragenden Merkmalen
von ImageFX: Anders als bei anderen Paketen machte IFX schon von der ersten
Version an High-End-Effekte wie Morphing, St&ouml;rungsfilter und Blitz- oder
Feuereffekte auf normalen Desktop-Computern m&ouml;glich, und die aktuelle
Version f&uuml;hrt diese Tradition weiter fort:
<P>
Mit Hilfe des brandneuen Wolkenmoduls erstellen Sie verbl&uuml;ffend
wirklichkeitsgetreue Wolken, die sich bewegen lassen und durch
automatisierte Skriptverarbeitung sogar &uuml;ber einen festgelegten Zeitraum
ihr Aussehen ver&auml;ndern k&ouml;nnen! Dar&uuml;ber hinaus lassen sie sich zum Erzielen
eines dreidimensionalen Effekts auch &uuml;bereinanderlegen und mit
selbsterstellten oder mitgelieferten Paletten versehen, um z. B. einen
auff&auml;lligen Plasmaeffekt zu schaffen.
<P>
Die Bezeichnung "Scatter" beschreibt einen Explosionseffekt, bei dem sich
die Gr&ouml;&szlig;e der einzelnen Segmente bis auf einen einzigen Bildpunkt
reduzieren l&auml;&szlig;t. Einsatzm&ouml;glichkeiten f&uuml;r diese Funktion reichen von
k&uuml;nstlerischem Design bis hin zu auff&auml;lligen &Uuml;berblendeffekten.
<P>
Eine weitere Neuerung bei ImageFX 3.0 stellt der sogenannte "Splash"-Effekt
dar. Mit dieser Funktion lassen sich durch den Einsatz von Technologien wie
Ray Tracing und Bump Mapping wirklichkeitsgetreue Simulationen von Regen,
Wasserskispuren, dickfl&uuml;ssigen Massen und anderen Ph&auml;nomenen erzeugen. Auch
dieser Effekt l&auml;&szlig;t sich per Stapelverarbeitung einsetzen, um z. B.
animierte Regenpf&uuml;tzen oder organisch wirkende &Uuml;berblendungen zu schaffen.
<P>
Auch das von anderen Computersystemen bekannte "Aufbl&auml;ttern" wurde nun in
die Effektbibliothek aufgenommen: Neben dem bekannten Umschlagen der
unteren Seitenkante lassen sich aber auch zahllose andere Effekte erzielen,
wie z. B. das "Abziehen" von Buchstaben von einer Heftseite!
<P>
Das absolute Highlight unter den neuen Effekte von ImageFX 3.0 stellt
jedoch die Effektengine "FXForge" dar. Mit ihr lassen sich auf der
Grundlage einfacher mathematischer Formeln hunderte eindrucksvoller, neuer
Effekte erstellen. Die verwendete Technologie ist zu der in dem Adobe
Photoshop 4 Plug-In "Filter Factory" verwendeten kompatibel, daher lassen
sich alle f&uuml;r dieses Programm entwickelten Formeleffekte auch in ImageFX
3.0 verwenden. Da die Formeln sich unter Photoshop-Usern gr&ouml;&szlig;ter
Beliebtheit erfreuen, sind schon heute &uuml;ber das Internet hunderte, wenn
nicht tausende davon frei verf&uuml;gbar. Nat&uuml;rlich k&ouml;nnen erfahrene Benutzer
dieses Feature aber auch zur Entwicklung eigener Effekte nutzen. Und: Das
"FXForge"-Modul von ImageFX bietet die einzigartige M&ouml;glichkeit, Parameter
zu animieren und unter Zuhilfenahme des Bildpuffers von ImageFX sogar
&Uuml;berblendeffekte zu erstellen!
<P>
Preise finden Sie auf unserer Preisliste Amiga Grafiksoftware
<P>
Oberland Computer<BR>
In der Schneithohl 5<BR>
D-61476 Kronberg<BR>
Deutschland / Germany<BR>
Tel.: 06173 - 608-0<BR>
Fax: 06173 - 63385
<P>
EMail: <A HREF="mailto:info@oberland.com">info@oberland.com</A>«</BLOCKQUOTE>
<P>
(Quelle: Oberland Computer)
<P>


<P ALIGN=RIGHT>
<A HREF="1107.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="1109.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
