<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Maxtor&nbsp;DiamondMax</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Jarmo Piippo</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Nopeammin kuin sammakko ehtii aivastaa, oli Workbench latautunut, ja havaitsin sormenp&auml;ideni ulottuvilla olevan yli 46 rompun edest&auml; tallennustilaa. Hyv&auml;sti, ahtaan paikan kammo! Ainakin hetkeksi...</font></td>
				</tr>
			</table>
				<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kiintymys kiintolevyihin</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Maxtorin DiamondMax VL 40 -sarjan levyt on valmistajan mukaan tarkoitettu edulliseksi mutta silti tehokkaaksi vaihtoehdoksi kotitietokoneen massamuistiksi. Niiss&auml; on mallista riippuen joko yksi tai kaksi levy&auml; ja yhdest&auml; nelj&auml;&auml;n luku/kirjoitusp&auml;&auml;t&auml;. Levypintaa kohden kapasiteettia l&ouml;ytyy 10 gigaa, joten malliston kapasiteetit vaihtelevat 10:st&auml; 40 gigatavuun.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Oma yksil&ouml;ni on 30 gigatavun malli 33073H3, joka on nielaissut sis&auml;&auml;ns&auml; kaksi levy&auml; ja kolme luku/kirjoitusp&auml;&auml;t&auml;. Ensimm&auml;ist&auml; kertaa tuli vastaan kiintolevy, jonka mukana antistaattisessa pussissa oli manuaali. Se on tosin vain suunnilleen A4-kokoinen kokoon taiteltu paperi, joka on t&auml;ynn&auml; pienell&auml; painettua teksti&auml;. Manuaalissa neuvotaan levyn asennus ja jumpperien asennot, ja lis&auml;ksi siin&auml; on ohjeita BIOS-asetusten ja levyn osioinnin tekoon erilaisissa PC-koneissa. Amiga-k&auml;yt&ouml;ss&auml; riitt&auml;&auml; kun osaa tehd&auml; levyn master/slave-valinnan, loppu j&auml;&auml; tiedostoj&auml;rjestelm&auml;n huomaan, olettaen tietysti ett&auml; se on tarpeeksi uusi tukeakseen suuria kiintolevyj&auml;.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Liitetty&auml;ni levyn koneeseeni tuli ensin vastaan hiukan h&auml;mmennyst&auml; aiheuttava pulma. Power Flyer -levyohjaimeni vanha 1998 hankittu ohjainversio rajoitti levylt&auml; k&auml;ytett&auml;viss&auml; olevan tilan 8,4 gigatavuun. Rajoituksen poistava ajurin p&auml;ivitys l&ouml;ytyy onneksi helposti Vesalian kotisivuilta: <a href="http://www.vesalia.de/files/fastata99.lha">http://www.vesalia.de/files/fastata99.lha</a>, 84 kt. (Kiitokset vinkist&auml; Boogielle!)</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Levyn osioinnin tein alun perin OS 3.1:n HDToolbox-ohjelmalla, enk&auml; sit&auml; varmaankaan tule aivan heti muuttamaan, sill&auml; vaikka my&ouml;s OS 3.5 on k&auml;ytett&auml;viss&auml;ni, on levyn toimittava my&ouml;s 3.1:ll&auml;. Tiedostoj&auml;rjestelm&auml;n&auml; k&auml;yt&ouml;ss&auml;ni on PFS2, direct SCSI -moodissa. Uusimpien FFS:n versioiden pit&auml;isi toimia my&ouml;s, samoin kuin ilmaisen SFS:n, mutta niit&auml; en ole tullut kokeilleeksi.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Joillakin IDE-levyill&auml; aiemmin ilmenneiden, liian suuresta MaxTransfer-arvosta johtuneiden ongelmien takia p&auml;&auml;tin heti k&auml;ttelyss&auml; asettaa sen arvoon &quot;0x1fe00&quot;, jota olen k&auml;ytt&auml;nyt ennenkin. Testailin varmuuden vuoksi ett&auml; levy toimii virheett&ouml;m&auml;sti kopioimalla suurelle osiolle yli 3 gigatavua LHA-paketteja ja IFF-animaatioita. Kaikki toimivat levylt&auml; t&auml;ysin moitteetta, ja LHA-pakettien tarkistussummat n&auml;kyiv&auml;t LHA-purkajan test option mukaan olevan oikein. PFS2:n manuaalin mukaan Workbench sis&auml;lt&auml;&auml; bugin, jonka takia MaxTransfer-arvon on oltava jaollinen levyn sektorikoolla, eli yleens&auml; 512 tavulla. Arvon on siis p&auml;&auml;tytt&auml;v&auml; lukuun &quot;e00&quot;.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Massamediatykki</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Maxtorin mukaan levyn koko on 30,736 gigaa, mutta kuten valmistajilla on yleisesti tapana, ne tarkoittavat miljardeja tavuja eiv&auml;tk&auml; tietotekniikan yhteydess&auml; normaalisti k&auml;ytettyj&auml; 2 potenssiin 30 tavun yksik&ouml;it&auml;. Levylohkoja asemassa on tarkalleen sanottuna 60 032 448, eli todellinen kapasiteetti on noin 28,6 &quot;oikeaa&quot; gigatavua.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Jatkuvaksi lukunopeudeksi levylle testiohjelmat ilmoittavat koneessani hiukan yli 7 megatavua sekunnissa. Kuten aikoinaan arvelinkin, paljon t&auml;m&auml;n suurempiin nopeuksiin ei siis A1200:n ROM-kantoihin kiinnitett&auml;v&auml;ll&auml; Power Flyerilla p&auml;&auml;se emolevyn v&auml;yl&auml;n asettamien rajoitusten takia. Ehk&auml;p&auml; vastik&auml;&auml;n markkinoille tulleisiin PCI-laajennuskortteihin voisi liitt&auml;&auml; nopeampiakin IDE-ohjaimia, joilla saisi uusien levyjen siirtonopeuden kunnolla hy&ouml;dynnetty&auml;? Huippua olisi, jos ne viel&auml; saisi toimimaan DMA:lla, jolloin prosessoriaikaa j&auml;isi siirtojen aikanakin ohjelmien k&auml;ytt&ouml;&ouml;n.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">K&auml;yt&auml;nn&ouml;n nopeuden mittaamiseksi siirtelin j&auml;lleen kellon kanssa satoja megoja tavaraa, jota siirtyi levyosiolta toiselle keskim&auml;&auml;rin 2,6 megatavua sekunnissa. Huomasin samalla, ettei Directory Opuksen sis&auml;ist&auml; kopiointik&auml;sky&auml; ehk&auml; kannata k&auml;ytt&auml;&auml; suurten tiedostojen siirtoon osioiden v&auml;lill&auml;, sill&auml; ainakin omassa versiossani se vaikuttaa k&auml;ytt&auml;v&auml;n aivan liian pient&auml; muistipuskuria kopioinnissa. Siit&auml; seuraa hermoja raastava swappaus lukup&auml;&auml;n joutuessa ravaamaan l&auml;hde- ja kohdeosioiden v&auml;lill&auml;. Puute on helppo kiert&auml;&auml; tekem&auml;ll&auml; DirOpukseen toimintonappula, joka suorittaa kopioinnin k&auml;ytt&ouml;j&auml;rjestelm&auml;n omalla copy-komennolla k&auml;ytt&auml;en buf-parametrin avulla vaikkapa 10 megan puskuria.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yksi k&auml;ytt&ouml;kohde, jossa nopeusero aiempaan WD:n kaksigigaiseen levyyni verrattuna on todella selv&auml;sti aistittavissa, on Internet Movie Databasen paikallisen asennuksen k&auml;ytt&ouml; MovieMUI-ohjelmalla. Suurten tiedostojen k&auml;sittely&auml; helpottaa selv&auml;sti uuden levyn nopea hakuaika sek&auml; se, ett&auml; yh&auml; suurempi osa isostakin tiedostosta l&ouml;ytyy levylt&auml; aina saman sylinterin alueelta.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Pikaisen testauksen mukaan DiamondMax VL 40 vaikutti toimivan ongelmitta my&ouml;s A1200:n emolevyn IDE-portissa. Etuk&auml;teen arvelin, ettei kone tunnistaisi lainkaan PFS2-tiedostoj&auml;rjestelm&auml;n 68060-versiota, joka on asennettuna levyn RDB:lle. Mutta eik&ouml;s mit&auml;, konehan l&auml;hti hetke&auml;k&auml;&auml;n ep&auml;r&ouml;im&auml;tt&auml; boottaamaan sielt&auml;! Tosin bootti ei tietenk&auml;&auml;n voinut onnistua kovinkaan pitk&auml;lle, sill&auml; levyll&auml; oli 060-koneeni Startup-Sequence, joka yritti ladata ROM-imagetiedostoa Fast-muistiin MMU:n avulla. A1200:n IDE-portissa levyn siirtonopeus rajoittuu suunnilleen 2,5 megatavun tienoille sekunnissa, mutta suuri sylinterikoko ja nopea hakuaika antavat silti siin&auml;kin tuntuvan tehonlis&auml;n verrattuna vanhoihin kiintolevyihin.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Maxtor DiamondMax on selke&auml;sti t&auml;m&auml;n vuosituhannen paras hankintani t&auml;h&auml;n menness&auml;!-)</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
					<tr>
						<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Valmistaja:</font></td>
						<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://www.maxtor.com" target="_blank">Maxtor</a></font></td>
					</tr>
					<tr>
						<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Myyj&auml;:</font></td>
						<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://www.karkkainen.com" target="_blank">K&auml;rkk&auml;inen</a></font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">, Oulu</font></td>
					</tr>
					<tr>
						<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hinta:</font></td>
						<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">950 mk (helmikuu 2001)</font></td>
					</tr>
					<tr>
						<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Takuu:</font></td>
						<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">3 vuotta</font></td>
					</tr>
					<tr>
						<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Liit&auml;nt&auml;:</font></td>
						<td width="50%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Fast ATA/Enhanced IDE, Ultra ATA/100</font></td>
					</tr>
					<tr>
						<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Py&ouml;rimisnopeus:</font></td>
						<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">5400 rpm</font></td>
					</tr>
					<tr>
						<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">V&auml;limuisti:</font></td>
						<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">2 Mt SDRAM</font></td>
					</tr>
					<tr>
						<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hakuaika:</font></td>
						<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&lt;9,5 ms</font></td>
					</tr>
					<tr>
						<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Testattu:</font></td>
						<td width="50%" bgcolor="#d8ecfd">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amiga 1200, 68060/50 MHz, 32 Mt, Power Flyer<br>
								</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amiga 1200, 68EC030/50 MHz, 8 Mt</font></p>
						</td>
					</tr>
				</table>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		</center>
	</body>

</html>