<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. AMIGA gibt Erscheinen des Developerkits bekannt

Am 3. Juni hat AMIGA das Erscheinen des angek&uuml;ndigten Entwicklerpakets 
bekannt gegeben, dar&uuml;ber hinaus wurde auf der AMIGA-Homepage 
(http://www.amiga.com) ein neuer Bereich eingerichtet, auf dem &uuml;ber die f&uuml;r 
den Amiga der n&auml;chsten Generation geplanten Computerspiele informiert wird 
(http://www.amiga.com/games). Au&szlig;erdem wurde ein Link zu einem neuen 
Supportbereich f&uuml;r Entwickler installiert, der unter 
http://www.amigadev.net erreichbar sein wird.

Es folgt die offizielle Ank&uuml;ndigung des Developerkits in einer deutschen 
&Uuml;bersetzung von Gernod Schomberg:


»Presse-Mitteilung


Amiga ist wieder da und wird den Umgang mit Computern f&uuml;r immer ver&auml;ndern,
wie es das schon einmal tat!

Amiga, die Begr&uuml;nder des Multimedia-Computers, gaben die Freigabe ihres
Entwickler-Pakets f&uuml;r Amiga-, Linux- und Jave-Entwickler bekannt.


3. Juni 2000 - Snoqualmie, WA - Amiga k&uuml;ndigt die Herausgabe des Amiga
Software Developer Kit (Sofware-Paket f&uuml;r Amiga-Entwickler) an, des
ersten neuen Produkts f&uuml;r die Einf&uuml;hrung der Amiga-Plattform der
n&auml;chsten Generation.

Das Amiga Software Developers Kit (SDK) bietet die Einstiegsmittel und
Beispiele f&uuml;r Entwickler zur Herstellung erstaunlicher Multimedia-Inhalte,
die auf unterschiedlichen Ger&auml;ten und Rechner-Umgebungen eingesetzt werden
k&ouml;nnen. Die einmalige St&auml;rke des Neuen Amiga entspringt aus der 
Partnerschaft mit der Tao-Gruppe in Reading, England, welche die Grundlage 
f&uuml;r Entwickler bietet, die Vorteile einer allgegenw&auml;rtigen Computer-
Umgebung wahr zu nehmen.

Im Jahr 1984 f&uuml;hrte Amiga das ein, was heute als Multi-Media bekannt ist.
Als Ergebnis davon werden Amiga-Systeme in aller Welt von f&uuml;hrenden Film-
Studios, Animations-Herstellern und in Betriebs-kritischen Anwendungen
eingesetzt. Von dieser Grundlage aus schreitet der Amiga voran mit der
Erzeugung von Multimedia f&uuml;r zahlreiche Ger&auml;te und Rechner-gesteuerte
Umgebungen im Heim, im B&uuml;ro und weit dar&uuml;ber hinaus.

Das Amiga-OS kann eigenst&auml;ndig arbeiten, aber auch auf anderen
Betriebssystemen als Zusatz angesiedelt werden. Die gleiche
Anwendung kann auf x86, PowerPC, M.core, ARM, StrongARM, MIPs, SH3/4
und weiteren laufen. In einer Host-Umgebung l&auml;uft das neue Amiga auf
Versionen von Linux, Windows 95/98/NT, Windows CE, OS/9, QNX4, und andere
werden noch dazu kommen.

Das neue Betriebssystem umfasst auch die Java-Sprache auf eine neue,
m&auml;chtige und anpassungsf&auml;hige Art. Die "intent Java Technology Edition"
von Tao ist weltweit anerkannt f&uuml;r ihre Geschwindigkeit und die kompakte
Ausf&uuml;hrung von Java-Anwendungen. Mit der neuen Umgebung werden Entwickler
die Vorteile sowohl von Java wie auch von portablen Assembler-Codierungen
wahrnehmen k&ouml;nnen.

"Heute machen wir unseren ersten Schritt in die Zukunft.", sagte Bill
McEwen, Pr&auml;sident und CEO von Amiga, Inc., "Das neue Amiga-SDK bietet
eine Umgebung, mit der die besten Entwickler der Welt erstaunliche
Anwendungen erzeugen k&ouml;nnen, mit welchen die Hardware-Grenzen
&uuml;berwunden werden. Heute k&ouml;nnen Amiga-Entwickler sich mit Linux- und
Java-Entwicklern in einer Umgebung zusammentun, mit der als Grundlage
die Zukunfts-Erzeugnisse geliefert werden."

"Bei Tao spricht man schon l&auml;nger &uuml;ber unsere Entwicklungen zur Herstellung
des Digital Heaven&#174; und wir sehen Amiga und seine Gemeinschaft als einen
grundlegenden Teil der neuen Ordnung, die dieses entstehen lassen und eine
f&uuml;hrende Rolle in der Industrie einnehmen kann. Mit der ihnen eigenen
Z&auml;higkeit und den manigfaltigen F&auml;higkeiten von McEwen und seiner Amiga-
Truppe wird die Welt Amiga als herausragende Marke f&uuml;r verbundenen digitale
Anwendungen erkennen", sagt Francis Charig, Chairman der Tao-Gruppe.

F&uuml;r die Entwickler erzeugt das neue SDK eine einheitliche Umgebung, die
anpassungsf&auml;hig ist von Handger&auml;ten, wie Handies (cell phones), an 
aufw&auml;rts.
Neue Versionen des Pakets, die sp&auml;ter im Jahr herauskommen, werden viele
neue Media-Eigenschaften einf&uuml;hren. Sowohl die derzeitige wie auch die
zuk&uuml;nftigen Versionen erm&ouml;glichen kompakte, sehr leistungsf&auml;hige und 
robuste Media-L&ouml;sungen, die mit gleichen Bin&auml;r-Codes in einem weiten
Bereich von Ger&auml;ten verwendet werden k&ouml;nnen.

Das neue Amiga-SDK ist bei &ouml;rtlichen H&auml;ndlern f&uuml;r $ 99.00 erh&auml;ltlich, bald
auch von der Amiga-Website, von Amazon.com und anderen Quellen. Eine 
Version die &uuml;ber einen japanischen Vertrieb laufen wird, wird in K&uuml;rze 
ver&ouml;ffentlicht werden.

&Uuml;ber Amiga:

Amiga Incorporated widmet sich der Herstellung einer Betriebsumgebung f&uuml;r
Multimedia, die den Entwicklern und Anwendern ein neues erfreuliches
Niveau bietet.

Wie schon in den fr&uuml;hen 80er Jahren steht Amiga bereit, die n&auml;chste Stufe
im Computerbetrieb einzuf&uuml;hren. 


Markenzeichen:

Amiga ist ein Markenzeichen von Amiga Inc
intent(TM) ist ein Markenzeichen der Tao Group Ltd
Digital Heaven(TM) ist ein Markenzeichen der Tao Group Ltd
Linux(R) ist ein eingetragenes Markenzeichen von Linus Torvalds
Windows(R) ist ein eingetragenes Markenzeichen der Microsoft Corporation
QNX ist ein eingetragenes Markenzeichen von QNX Software Systems Ltd
OS-9(R) ist ein eingetragenes Markenzeichen von Microware Systems 
Corporation
NEC V850(R) ist ein eingetragenes Markenzeichen der NEC Corporation in den
Vereinigten Staaten und anderen L&auml;ndern
MIPS ist ein eingetragenes Markenzeichen, MIPS-based ist ein
Markenzeichen, beide von MIPS Technologies, Inc.
ARM and StrongARM sind eingetragene Markenzeichen von ARM Limited
Motorola PowerPC(TM) and M-Core(TM) sind Markenzeichen von of Motorola, 
Inc«

(Quelle des Originals: AMIGA Inc.)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
