<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
6. Reviews
----------

Sharks! CD32
------------

Seit &uuml;ber 2 Jahren gab es am CD32 keine Ver&ouml;ffentlichungen mehr.
Nun hat sich Christian Steiner, Autor des Shareware-Spieles Sharks!,
dazu entschlossen, eine CD32 Edition seines Spieles herauszubringen.
Da ich auch Besitzer eines CD32 bin, war das f&uuml;r mich Grund genug,
dieses Spiel mal etwas genauer unter die Lupe zu nehmen.

Sharks! CD32 kommt in der einfachen CD-H&uuml;lle als Rohling daher.
Eine Anleitung findet man nur im Spiel selbst zum Abrufen. Nach
dem Einlegen der Spiel CD-ROM f&auml;ngt das CD32 wie gewohnt an
zu laden. Auff&auml;llig ist hierbei, dass es im CDTV-Modus (= ECS)
hochf&auml;hrt. Nichtsdestotrotz, erscheint dann ein Auswahlmen&uuml;,
in dem man zwischen Sharks! und zwei Bonus-Spielen w&auml;hlen kann.
Wir entscheiden uns hier prim&auml;r nat&uuml;rlich f&uuml;r Sharks!.

Nun erscheint eine kleine Einf&uuml;hrung in das Spiel, in dem u.a.
die Autoren genannt werden, die am Spiel mitgearbeitet. Nachdem
dieses Introduktion abgelaufen ist, beginnt das CD32 wieder
flei&szlig;ig zu laden und dann erscheint auch das eigentliche Spiel,
Sharks!. Im Hauptmen&uuml; des Spiels kann man nun verschiedene
Optionen einstellen, wie z.B. Art des CD-Soundtracks, Grafikmodus
(hier kann man nun auch AGA ausw&auml;hlen!), Spielgeschwindigkeit
und einiges mehr. Auch die Anleitung ist hier abrufbar. Nach
dem Dr&uuml;cken des Feuerknopfes befindet man sich nun endlich im
Spiel.

Im Spiel geht es darum, durch einen Taucher Sch&auml;tze einzusammeln
und Haien auszuweichen. Dies ist nat&uuml;rlich schwerer als es sich
anh&ouml;rt: So muss der Taucher auch von Zeit zu Zeit Luft holen, um
nicht zu ertrinken. Ebenfalls werden die Haie zunehmend gef&auml;hrlicher
und angriffslustiger. Die ersten Runden sollten allerdings f&uuml;r
einen mittelm&auml;&szlig;igen Spieler keine sonderliche Herausforderung
darstellen. Wer mit der n&ouml;tigen Geschicklichkeit an das Spiel
herangeht und auch Geduld mitbringt, da der Bildschirm sich nicht
selbstst&auml;ndig fortbewegt, der wird sicherlich recht weit kommen.

Sharks! spielt sich recht ordentlich und auch die Grafik kann
sich f&uuml;r Shareware-Nivaeu durchaus sehen lassen. Sie sieht teils
sogar noch besser aus, als einige momentane kommerzielle Spiele.
Die Musik kommt direkt von CD und besitzt einen astreinen Klang.
Auch sie passt meist zum Spielgeschehen. Die Animation dagegen
sieht ein wenig zu ruhig aus; hier h&auml;tte man sicherlich noch
ein paar mehr Einzelbilder verwenden k&ouml;nnen. Dies tr&uuml;bt allerdings
nicht den Spielspa&szlig;, da auch die Steuerung keine Probleme
bereitet. Man k&ouml;nnte den Spielspa&szlig; von Sharks! allerdings noch
dadurch erh&ouml;hen, dass sich der Bildschirm selbstst&auml;ndig weiter
bewegt. Mit solch einer Option w&uuml;rde das Spiel nicht nur schwerer,
sondern auch spannender werden, da es momentan etwas langweilig
ist, immer selbst den Bildschirm zu veranlassen, dass er sich
bewegt. 

Fazit: Sharks! hinterl&auml;sst einen auf Shareware-Nivaeu guten
Eindruck. Die Grafik kann sich durchaus sehen lassen und auch
an der Musik wurde mit Liebe gearbeitet und au&szlig;erdem noch
Audio-Tracks fabriziert. Das Spiel ist zwar ein eher kurzweiliger
Shareware-Spa&szlig;, der sicherlich noch gesteigert werden k&ouml;nnte
(durch entsprechende Zusatzoptionen). Der Preis von 30,- ist
angesichts der enormen Verbesserungen zur Standardversion
angemessen. Als weiterer Pluspunkt bleibt noch zu nennen, dass
sich noch zwei andere Spiele auf der CD-ROM befinden und
dass alle Spiele auch auf normalen Amigas gespielt werden
k&ouml;nnen. Kommen wir nun zur Bewertung, in der ich allerdings
ber&uuml;cksichtigt habe, dass es sich nicht um ein kommerzielles
Spiel handelt. Bei einem solchen w&auml;re die Bewertung sicherlich
schlechter ausgefallen.

Screenshot:
<IMG SRC="../extra/Sharks1.jpg" ALT="Screenshot">
Screenshot:
<IMG SRC="../extra/Sharks2.jpg" ALT="Screenshot">
Screenshot:
<IMG SRC="../extra/Sharks3.jpg" ALT="Screenshot">
Screenshot:
<IMG SRC="../extra/Sharks4.jpg" ALT="Screenshot">

+-------------------------------------------------------------------------+
|  Name:          Sharks! CD32 Edition                                    |
|  Hersteller:    Christian Steiner, Hansastra&szlig;e 65, 48465 Sch&uuml;ttorf      |
|                 E-Mail: C-Steiner@t-online.de,                          | 
|                 Internet: http://www.t-online.de/home/C-Steiner/        |
|  Preis:         30 DM (inkl. Porto und Verpackung)                      |
|  Datentr&auml;ger:   1 CD-Rohling                                            |
|  Genre:         Action                 | Spieler: 1                     |
|  Sprache:       deutsch                | Anleitung: deutsch             |
|  System:        CD32 (OCS/ECS/AGA)     | CD-ROM                         |
|                                                                         |
|  Fazit:         F&uuml;r Shareware-Nivaeu wirklich aufwendig gestaltetes     |
|                 Spiel, welches kurzweilig begeistern kann.              |
|                                                                         |
|  Wertung:                                                               |
|                             Grafik:     8/10                            |
|                             Sound:      8/10                            |
|                             Handhabung: 7/10                            |
|                             Spielspa&szlig;:  6/10                            |
|                             GESAMT:      73%                            |
+-------------------------------------------------------------------------+


Sharks! CD32 (von der Amiga CD32 Allianz)
-----------------------------------------

Es darf wieder am CD남 gezockt werden...!!!
...denn Christian Steiner bringt mit "Sharks!" sein erstes
CD남 Spiel auf den Markt. Doch die eins bleibt weiter im
Mittelpunkt, denn "Sharks!" ist auch das erste CD남 Spiel
im Jahre 2000. [Anm. d. R.: Sharks! ist auch das einzige
CD32 Spiel seit Mitte 1997] 


DIE PR&Auml;SENTATION:
Die CD ins Laufwerk des CD남 gelegt und schon geht es los.
Nach kurzer Ladedauer erscheint ein Auswahlmen&uuml;, wo man sich
zwischen dem eigendlichen Spiel "Sharks!" und zwei weiteren
Spielen die quasi als Bonbon mit auf die CD gepresst worden 
sind entscheiden. 
Nun beginnt eine kleine Intro-Animation, gezeigt wird darin 
u.a. wer Sharks! programmiert hat und wer daran mitgearbeitet hat.
Nachdem auch das Intro zuende gegangen ist, kommt man widerrum
in ein Auswahlmen&uuml;, diesmal kann man zwischen Optionen und
der Anleitung zu Sharks! in Englisch oder Deutsch ausw&auml;hlen.
Nat&uuml;rlich kann man jetzt sogleich ins Spielgeschehen durch
dr&uuml;cken des roten Kopfes kommen.
Durch dr&uuml;cken des blauen Knopfes auf dem CD남-Joypad kommt
man in das Optionsmen&uuml;.
Zun&auml;chst einmal stehen verschiedene sogenannte "FPS"-Werte zur
Auswahl, je nachdem ob man ein normales CD남 oder ein 
beschleunigtes CD남 (mit SX남Pro-Modul) besitzt, kann man
diese FPS-Werte auf diese zwei CD남-Varianten optimieren bzw.
ver&auml;ndern.
Zudem hat man die M&ouml;glichkeit den Schwierigkeitsgrad zu
&auml;ndern, es stehen drei Varianten zur Auswahl.
Wer Sharks! im AGA-Modus spielen m&ouml;chte sollte auch dieses vorher
im Optionsmen&uuml; anw&auml;hlen, da Sharks! standartm&auml;ssig im CDTV-Modus
startet.
Desweiteren stehen weitere Einstellungen zur Auswahl.

DAS GAMEPLAY:
Als Taucher m&uuml;ssen Sie nun versuchen, Sch&auml;tze (Diamanten, M&uuml;nzen,
Edelsteine...etc.) vom Meeresboden aufzusammeln. Doch seien Sie
vorsichtig, denn es lauern Sharks (=Haie) auf Sie, diese sehr
gefr&auml;ssig sind und Sie wollen doch nicht das Hauptgericht
sein oder?
Wenn Sie nun diese Sch&auml;tze vom Meeresboden aufgesammelt haben,
so m&uuml;ssen Sie versuchen diese zu Ihrem Schiff zu bringen.
Ausser Ihnen und den Haien schwimmen unz&auml;hlige Fische
verschiedenster Arten im Wasser herum, vor denen Sie sich
aber nicht f&uuml;rchten brauchen, es sei denn vor dem Zitteraal,
denn wollen Sie dem Taucher zumuten einen elektrischen 
Stromschlag im Wasser zu bekommen?
Nett animiert sind die Luftblasen, diese an die Meeresoberfl&auml;che
steigen.
Es stehen Ihnen insgesamt 3 Taucher zur Verf&uuml;gung um die Sch&auml;tze
vom Meeresboden auf Ihr Schiff zu holen. Denken Sie daran,
f&uuml;r jeden einzelnen Schatz bekommen Sie Punkte, die Ihnen
Helfen werden, in der Hi-Score Liste an den 1.Platz zu
gelangen, zudem muss man alle Sch&auml;tze einsammeln um in
weitere Levels zu kommen.
Trotz allen Mutes wird es von Level zu Level immer schwieriger,
denn die Haie werden zunehmend gefr&auml;ssiger und aggresiver,
kommen Sie also nicht in die N&auml;he...denn es beginnt eine
wahre Verfolgungsjagd.

Screenshot:
<IMG SRC="../extra/Sharks1.jpg" ALT="Screenshot">
Screenshot:
<IMG SRC="../extra/Sharks2.jpg" ALT="Screenshot">
Screenshot:
<IMG SRC="../extra/Sharks3.jpg" ALT="Screenshot">
Screenshot:
<IMG SRC="../extra/Sharks4.jpg" ALT="Screenshot">

FAZIT:
Es macht wirklich richtigen Spass "Sharks!" am CD남 zu spielen,
trotz das "Sharks!" ein Sharewarespiel ist und dessen Niveu besitzt. 
Die Musikst&uuml;cke die von Matthias F. Kretzler komponiert worden
sind, wirken zu keinem Zeitpunkt st&ouml;rend und tragen ma&szlig;st&auml;blich
zum Spielspass bei.
Christian Steiner hat uns allen wider unz&auml;hlige Stunden vor unserem
CD남 beschert. Wer einmal begonnen hat "Sharks!" zu spielen,
wird die darauf folgenden Wochen nicht davon los kommen,
selten hat ein PD bzw. Sharewarespiel einen so positiven
Eindruck hinterlassen wie dieses.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
