<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,interview,beyond twilight">
<title>Interview: Beyond Twilight</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="blue">Interview mit Beyond Twilight</Font></center></h1></P>

<p>Mit Finn Zierler, Gitarrist und Kopf von Beyond Twilight, hat man das Gl&#252;ck, 
einen richtig herzigen Interview-Partner am Telefon zu haben, der zwar eine 
Menge zu erz&#228;hlen hat, dabei aber nicht wie so manche S&#252;dl&#228;nder textet  bis der 
andere Kopfaua kriegt. Und es ist einfach immer wieder nett, wenn sich jemand 
fast wie ein kleines Kind freuen kann. Zumal &#252;ber Dinge, die eigentlich f&#252;r 
einen Normalsterblichen selbstverst&#228;ndlich sind. So ist Finn total angetan vom 
bisherigen Erfolg der aktuellen Scheibe *The Devil's Hall Of Fame* - obwohl man 
angesichts der genialen Songs eigentlich damit rechnen k&#246;nnte. Aber anscheinend 
ist das berstende Selbstbewu&#223;tsein anderen K&#252;nstler &#252;berlassen, egal welche 
G&#252;lle sie produzieren.</P> 

<p><i>Bereits vor dem Release haben mir die Leute L&#246;cher in 
den Bauch gefragt, weil sie da und dort bereits von der Scheibe erfahren oder 
dr&#252;ber gelesen hatten. Es scheint sich also auch bezahlt zu machen, da&#223; Beyond 
Twilight so ziemlich ganz anders strukturiert ist als viele andere Combos. 
Wobei ich jetzt hier nichts bewerten will. <b>The Devil's Hall...</B> ist ein sehr 
vielschichtiges Konzeptalbum, f&#252;r das ich selbst keine Schublade finde. Es 
handelt von einem Jungen, der feststellt, eine Art Chip im Gehirn zu haben. Es 
gehen nat&#252;rlich im Laufe der Zeit auch immer wieder Informationen verloren, 
manches wird gel&#246;scht oder funktioniert nicht. Er macht sich auf Suche nach 
seiner Vergangenheit, den verlorenen Puzzle-Teilchen, der gro&#223;en Liebe, findet 
aber am Ende nur seine eigene Art von Tod.</P></I>

<p>Erinnert ein wenig an Soul Doctor&#180;s 
J&#246;rg Deisingers Kurzgeschichte, in der eine junge Frau stirbt. Allerdings nicht 
im herk&#246;mmlichen Sinne, sondern mehr in Richtung Neu-Anfang. Manchmal fragt man 
sich allerdings schon, wie manche K&#252;nstler auf die Ideen zu ihren Texten und 
Geschichten kommen. So mancher Psycho-Analytiker h&#228;tte daran mindestens genauso 
seine Freude wie am Traumdeuten. Vielleicht liegt es auch nur daran, da&#223; sich 
K&#252;nstler, die ihre Sache wirklich mit dem Herz und Tiefe betreiben, einfach 
offener in emotionaler Hinsicht sein m&#252;ssen, Gef&#252;hle besser reflektieren und 
einfangen k&#246;nnen. Wahre Werte bieten in solchen F&#228;llen immer wieder 
Querverweise Richtung Glaube, der Weg dorthin eine Menge Psychologie und die 
Art und Weise der Umsetzung kann schon mal sehr philosophisch anmuten. Ist also 
die Besch&#228;ftigung mit einem dieser Themen alleine &#252;berhaupt m&#246;glich?</P> 

<p><i>Ob 
Religion Philosophie ist oder umgekehrt... schwierige Frage. Ich bin der 
Meinung, da&#223; beides gleiche Aspekte beinhaltet und sich auch durch angeeignetes 
Wissen aus beiderlei Richtungen, als auch der Psychologie, ein besseres 
Verst&#228;ndnis f&#252;r alles, was in der Welt passiert, entwickelt. Zudem lassen sich 
auch Dinge aus Glaubensrichtungen besser erkl&#228;ren. Die Wahrheit liegt in uns, 
doch die Suche danach kann sehr zerst&#246;rerisch werden, wenn man zu tief 
abdriftet. Die Fragen werden immer mehr, immer tiefer. Das Ergebnis kann 
supergut ausfallen oder erschreckend. Das h&#228;ngt allerdings auch von der 
pers&#246;nlichen Einstellung eines jeden selbst ab. Es kostet auf jeden Fall viel 
Kraft, sich all diesen Dingen zu stellen. Die Story der CD hatte ich erst in 
Buchform, habe sie dann aber mit Jorn f&#252;r die Platte ausgearbeitet. Der Bezug zur Realit&#228;t in dieser Geschichte liegt darin, da&#223; 
viele Menschen echt wie ferngesteuert durchs Leben laufen. Durch die Verbindung 
von Realit&#228;t und Fiktion wird die Geschichte hoffentlich auch gut 
funktionieren. Ich hacke gern in den Gehirnen anderer herum</I> (ah ja...; Kilian)<i> 
ich finde das sehr interessant. Die Gedankeng&#228;nge mancher Leute verstehen zu 
wollen, ist eine Herausforderung.</P></I>

<p>W&#228;hrend viele diese Gabe zu ihrem Vorteil 
ausnutzen und durch das Erkennen der W&#252;nsche und Bed&#252;rfnisse anderer hier den 
Hebel ansetzen, ist Finn aber mehr der gutm&#252;tige Vertreter, der sich mit 
solchen Aktionen wohl mehr das Benehmen anderer erkl&#228;ren will. Aber bleiben wir 
mal beim Hirnhacken:</P> 

<p><i>Gedanken und Gef&#252;hle anderer zum Thema zu machen ist, wie 
gesagt, interessant, kann aber auch nach hinten losgehen. Denk` nur mal an die 
Klonerei. Auf eine Art kopiert man ein menschliches Gehirn, seinen K&#246;rper - 
doch in einem Menschen steckt wesentlich mehr.</I></P>

<p>Was mittlerweile sogar wissenschaftlich bewiesen scheint. So haben einige Profis zwischen Gehirnrinde 
und Sch&#228;deldecke etwas gefunden, was sie selbst nicht genauer benennen k&#246;nnen. 
Es handelt sich nicht um Nervenzellen oder dergleichen, allerdings ist 
erwiesen, da&#223; von dort aus der menschliche Wille und einiges mehr gesteuert 
wird. Es sieht also ganz so aus, als h&#228;tte man die Seele gefunden. Laut 
Informationen soll einer der Professoren gemeint haben, wer noch nicht gebetet 
hat, sollte sich mal langsam aber sicher dran machen. </P>

<p><i>Man sieht einem Menschen 
nicht an, was ihn im steckt. Man kann es zum Teil f&#252;hlen, aber das ist nicht 
jedermanns Sache. Es gibt mehr zwischen Himmel und Erde, doch viele Menschen 
sind zu stolz, da&#223; auch glauben zu wollen. Sie denken allen Ernstes, wir w&#228;ren 
die Krone der Sch&#246;pfung und &#252;ber uns st&#252;nde nichts mehr.</P></I>

<p>Also, wenn die 
Menschheit das Beste sein soll, was das Universum zu bieten hat, dann danke. </P>

<p><i>Ich finde schon, da&#223; man hin und wieder Zeichen erh&#228;lt, da&#223; es noch mehr gibt 
als unser Sinne erfassen k&#246;nnen. Doch viele sehen diese Zeichen entweder nicht 
oder verstehen sie nicht. Und erkl&#228;ren kann man sich solche Situationen erst 
recht nicht. Ich finde es sehr schade, da&#223; viele derart eindimensional denken,</I> 
gr&#252;belt Finn, der die gesamte Platte &#252;brigens auf einem Trip durch die W&#252;ste im 
Kopf (!!) geschrieben und sie erst zu Hause musikalisch umgesetzt hat.<I> Oftmals 
ist man auch der Meinung, sich selbst ganz genau zu kennen, doch in 
Extremsituationen ist man nicht selten von sich selbst &#252;berrascht oder f&#252;hlt 
sich vor den Kopf gesto&#223;en. Man kann durch solche Extremsituationen lernen und 
sie auch selbst zu diesem Zweck w&#228;hlen. Meine Reise durch Afrika war eine 
solche Sache f&#252;r mich. Dieses Erlebnis, das Alleinsein, hat mich viel gelehrt. 
Wenn der Alltagsstre&#223; von einem abf&#228;llt, entwickelt sich wieder ein Sinn f&#252;r 
tiefere Dinge. Das Problem ist nur, da&#223; die meisten selten die Zeit finden, mal 
anzuhalten und die Gedanken auf Reise gehen zu lassen. Warum sind soviele 
Menschen Single? Nicht selten, weil sie sehr egoistisch sind. Menschen sind 
eigentlich ein sozialer Haufen mit sozialen Bindungen. Aber die Entwicklung 
geht in eine andere Richtung. Bevor man andere kritisiert, sie unter Druck 
setzt oder fordert, sollte man bei sich selbst anfangen. Man sollte in den 
Spiegel schauen und dieser Nase im Spiegel auftragen, neu anzufangen, Dinge zu 
&#252;berdenken. Und vielleicht sollte manch einer auch mal schnallen, da&#223; man erst 
vor der eigenen T&#252;r kehren sollte, bevor man stets andere f&#252;r jedes Scheitern 
verantwortlich macht.</P></I> 



</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
