<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,gamma ray,no world order">
<title>Gamma Ray: No World Order</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Gamma Ray: No World Order</font></h1><BR> (51:58 / Metal-Is Records)</center></P>

<p>Da ist es endlich: Auf das neue Gamma Ray Album habe ich mich pers&#246;nlich in diesem Jahr am meisten gefreut, wenngleich ich zugeben muss, dass ich nach den Vorabinfo`s, die den Grundtenor enthielten, Gamma Ray w&#252;rden sich in Richtung Judas Priest entwicklen, ein wenig skeptisch war. Na ja, diese Skepsis war sp&#228;testens nach dem zweiten Durchlauf von &quot;No World Order&quot; verflogen, denn Gamma Ray haben - wie eigentlich jedesmal in der Karriere - eine Platte abgeliefert, die langj&#228;hrigen Fans der Band gefallen d&#252;rfte. Dabei ist &quot;No World Order&quot; insgesamt eine ganze Ecke rauher und aggressiver geworden und enth&#228;lt mit dem famosen, von Tempowechseln gepr&#228;gten und eing&#228;ngigen &quot;The Heart Of The Unicorn&quot; tats&#228;chlich eine Nummer, die sich auf Judas Priest`s &quot;Painkiller&quot; ebenfalls gut gemacht h&#228;tte. Auch das straighte &quot;Solid&quot; (welches eigentlich f&#252;r Iron Savior geschrieben wurde) geh&#246;rt in diese Kategorie, wei&#223; aber ebenfalls zu gefallen. Die bekannten Trademarks der Band sind aber nat&#252;rlich nicht verloren gegangen und Fans des alten Helloween Materials bzw. fr&#252;herem Gamma Ray Stoff werden mit den beiden nicht minder eing&#228;ngigen &quot;Heaven Or Hell&quot; (&quot;I Want Out - Part II&quot; ??) und &quot;Follow Me&quot; vollauf entsch&#228;digt. Hinzu kommen mit dem Opener &quot;Deathrone Tyranny&quot; (dem ein Intro der Marke Rhapsody vorrangeht), dem superben (beinahe) Titeltrack &quot;New World Order&quot; und &quot;Eagle&quot; drei weitere Highlight`s, die sich natlos in die nicht gerade kurze Liste von geilen Songs in der Karriere von Gamma Ray einreihen. Lediglich die abschlie&#223;ende Ballade &quot;Lake Of Tears&quot; sowie die Midtemponummer &quot;Fire Below&quot; rei&#223;en mich nicht ganz so vom Hocker, w&#228;ren bei anderen Bands - das sollte man fairerweise erw&#228;hnen - aber absolute Highlights gewesen. Gamma Ray haben n&#228;mlich schlicht und ergreifend das Problem, dass man die Band - ob man nun will oder nicht - mit ihren bisherigen (Kn&#252;ller) Alben vergleicht und gerade das letzte Album &quot;Powerplant&quot; war ja wahrlich nicht von Pappe und einen entsprechenden Nachfolger zu stricken, der ebenfalls diesem Niveau 
entspricht, ist gar nicht so einfach und eine Steigerrung war schon gar nicht m&#246;glich. Somit muss man rein objektiv sagen, dass &quot;No World Order&quot; ein wenig im Vergleich zu &quot;Powerplant&quot; abf&#228;llt und vom Niveau her mit dem `97er Output &quot;Somewhere Out In Space&quot; zu vergleichen ist. Trotzdem: Diese Platte geh&#246;rt f&#252;r jeden Metaller, der nur etwas auf sich h&#228;lt, zum absoluten Pflichtprogramm in diesem Jahr und ich bin zuversichtlich, dass &quot;No World Order&quot; auch in der Jahresabrechnung ganz oben mitmischen wird. Gamma Ray Fans werden - das sei der Vollst&#228;ndigkeit halber nochmal erw&#228;hnt - garantiert nicht entt&#228;uscht sein!</P>

<p>Fazit: 9 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd2.jpg"></P>
<p><img src="kit.gif"></P>
</Center>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
