<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="red">Newsflash</font></center></h1></P><ul>

<p><li> <b>Helloween</B> Fans sollten sich besser irgendwo festhalten, denn aus dem Lager der K&#252;rbisk&#246;pfe gibt es leider keine guten Neuigkeiten: So sind sowohl Gitarrist Roland Grapow als auch Drummer Uli Kusch nicht mehr Bestandteil der Band und das Line-up, welches seit dem `94er Album &quot;Master Of The Rings&quot; Betand hatte, geh&#246;rt somit der Vergangenheit an - &#252;ber die Gr&#252;nde ist bisher noch nichts bekannt, aber die Dinge werden f&#252;r Helloween damit zweifelsohne nicht leichter, zumal die letzten beiden Alben &quot;The Dark Ride&quot; und &quot;Better Than Raw&quot; in meinen Augen eher durchschnittlich waren und Roland Grapow sich dort jeweils noch f&#252;r diverse Highlight`s verantwortlich zeichnete. Helloween werden aber definitiv weitermachen und in K&#252;rze neue Leute vorstellen.</LI></P>

<p><li> Und f&#252;r Fans des deutschen Power Metalls gibt es - nach den Helloween News - gleich die n&#228;chste schlechte Meldung serviert: Die bisher str&#228;flich unterbewerteten <b>Heavens Gate</B> geh&#246;ren offensichtlich der Vergangenheit an und liegen laut Gitarrist Sascha Paeth vorerst f&#252;r unbestimmte Zeit auf Eis, da 
alle Members kein &#252;bergro&#223;es Interesse mehr an der Band haben und in andere Projekte involviert sind. Somit d&#252;rfte der Beitrag zu dem Tribute Album &quot;Keepers Of Jericho&quot; der letzte in der Bandhistory gewesen sein - schade, ich fand die Combo immer ziemlich cool und Alben wie &quot;Planet E.&quot;, &quot;Living In Hysteria&quot; und &quot;Hell For Sale&quot; geh&#246;ren eigentlich in jeden Plattenschrank!</LI></P>

<p><li> Allehand Neuigkeiten gibt es an der <b>Dream Theater</B> Front: Die Dreifach Live CD steht im September in den CD Regalen der H&#228;ndler und im Januar soll bereits das n&#228;chste Studioalbum in trockenen T&#252;chern sein (na ja, hier ist wohl eher Skepsis aufgrund der Vergangenheit angebracht). Zus&#228;tzlich will Mike Portnoy noch mehrere (!) Rarit&#228;ten Compilations in Angriff nehmen und zudem evtl. sogar die Majesty-Demos remixen. Prog. Fans fangen am besten schonmal an zu spaaren.</LI></P>

<p><li> Ein kleineres Update gibt es bei <b>Rhapsody</B>: Im Herbst erscheint nicht nur das zweite Luca Turilli Soloalbum sondern auch eine neue Rhapsody EP. Im Fr&#252;hjahr 2002 soll uns dann bereits das neue Rhapsody Studioalbum begl&#252;cken, mit dem die Geschichte, die auf dem `97er Debutalbum begonnen wurde, endlich zu Ende gestrickt wurde.</LI></P>

<p><li> Tja, die Jubelorgie im letzten Monat aufgrund der Tatsache, dass Jack Starr (ex-Virgin Steele) und seine Band <b>Guardians Of Flame</B> mit S&#228;nger Chris Collins (Dream Theater Originalfrontman) eine handfeste &#220;berraschung pr&#228;sentierten, erwies sich als verfr&#252;ht. Jack Starr und Chris Collins haben sich wieder getrennt, wobei Jack Starr mit Holy Mother S&#228;nger Mike Tirelli gleich einen Ersatzmann pr&#228;sentierte.</LI></P>

<p><li> Bei <b>Freedom Call</B> gibt es auch einige News: So hat Gitarrist Sascha Gerstner die Band aus freien St&#252;cken verlassen, um eigene musikalische Wege zu gehen. Mit Cederic Dupont - vielleicht dem einen oder anderen als Gitarrist von Symphorce bekannt - hat man aber schon Ersatz gefunden. Momentan arbeitet man an neuen Songs, so dass man Anfang 2002 in`s Studio gehen kann und die neue Platte im Sommer 2002 ver&#246;ffentlichungsreif sein soll.</LI></P>

<p><li> Bei <b>W.A.S.P.</B> scheint immer noch kein regul&#228;rer Ersatz f&#252;r Gitarrist Chris Holmes gefunden worden zu sein: Nachdem erst Tuff Member Darrell Roberts diese Position ausf&#252;llen sollte (von der Band aber dann doch nicht genommen wurde), auf dem Europa Abstecher aber Doug Blair auf der B&#252;hne stand, ist etwas Kofusion angesagt, zumal W.A.S.P. Vordenker Blackie Lawless nun doch wieder Darell Roberts haben will. Wer jetzt aber konkret die Position einnimmt, ist momentan nicht so ganz klar - wahrscheinlich taucht bald eh wieder Chris Holmes (wie schon einige Male vorher) auf und alles ist erledigt.</LI></P>

<p><li> HammerFall Gitarrist Stefan Elmgren hat ein Sideprojekt namens <b>Full Strike</B> am Start, bei dem neben ihm selber noch S&#228;nger Niklas Jonsson, Bassist Chris Goldsmith (ex-Crawley) und Drummer Bj&#246;rn Fryklund (Freak Kitchen) t&#228;tig sein werden. Das erste Langeisen dieses Projektes, welches stilistisch zwischen Dokken und Gary Moor pendeln soll, ist f&#252;r Anfang 2002 angedacht. </LI></P>

<p><li> Japaner m&#252;sste man sein: Das in Rio mitgeschnittene <b>Iron Maiden</B> Live Album wird in Japan bereits Mitte September ver&#246;ffentlicht. Die Europ&#228;er m&#252;ssen sich noch etwas in Geduld &#252;ben, kommt von Seiten des Managments doch nur die lapidare Aussage, dass das Teil in Europa &quot;irgendwann sp&#228;ter ver&#246;ffentlicht&quot; wird. Allerdings d&#252;rfte das auch eher wenige Fans der Band st&#246;ren, gibt es von der gesamten Brave New World Tour (inkl. des Gig`s in Rio) zahlreiche Bootlegs - teilweise sogar mehrere von einer Show - in excellenter Qualit&#228;t. Hier k&#246;nnte sogar der Vergleich zwischen Rio Bootleg und offizieller Version richtig interessant werden....</LI></P>

<p><li> Und wo wir gerade bei <b>Iron Maiden</B> sind: S&#228;nger <b>Bruce Dickinson</B> wird im September eine Best Of ver&#246;ffentlichen, derren limitierte Erstauflage eine Bonus CD mit vielen Rarit&#228;ten enth&#228;lt (u.a. Material aus dem &quot;Lost Keith Olsen&quot; Album, einen Track namens &quot;The Wicker Man&quot; (!!) sowie die Original Version des Maiden Nr.1 Hit`s &quot;Bring Your Daughter To The Slaughter&quot;). Ein neues Sologeschoss br&#252;tet der Meister zudem ebenfalls wieder aus - wir d&#252;rfen gespannt sein. </LI></P>

<p><li><b> Manowar</B> sind ohne Zweifel eine Kult Band - aber was so in den letzten Jahren um die &quot;Kings Of Metal&quot; abging, d&#252;rfte sogar Die-Hard Fans mitlerweile kr&#228;ftig auf den Zeiger gehen: Nach den Rereleases der ersten beiden Platten im Digipack (Frechheit Nr.1, diese Dinger f&#252;r 30 Ocken zu verticken), steht nun die DVD Version des &quot;Hell On Earth - Part I&quot; Videos an, welche nat&#252;rlich massig Bonusmaterial enthalten soll (auch ganz toll, das Teil gut ein Jahr nach dem Video nachzuschieben, damit man doppelt abkassieren kann - Frechheit Nr.2 !!). Tja, und anstatt anschlie&#223;end mal wieder Gedanken an eine neue Platte zu verschwenden, wird erstamal Teil 2 von &quot;Hell On Earth&quot; in Angriff genommen. Somit d&#252;rfte eine neue Studioplatte wohl noch bis 2010 auf sich warten lassen...</LI></P></UL>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
