<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. AMIGA ernennt Eyetech zum Hersteller von Entwickler-Workstations
   
»Amiga Inc. und Eyetech bilden Partnerschaft

6. Juni 2000 - Snoqualmie, Washington, USA

Amiga Inc. in Snoqualmie, WA, freut sich, die Bildung einer strategischen 
Verbindung mit Eyetech Group Ltd. in Stokesley, North Yorkshire, UK, 
bekanntgeben zu k&ouml;nnen, deren Ziel es ist, die erste Auflage der 
Entwickler-Maschinen f&uuml;r den Amiga der n&auml;chsten Generation zu fertigen und 
in Gro&szlig;britannien und in der Republik Irland zu vertreiben.

Es besteht kein Zweifel, dass dies eine willkommene Neuigkeit f&uuml;r die 
britische Amiga-Gemeinschaft sein wird, die sich seit langem ganz 
ausgezeichneter Kontakte zu Eyetech erfreut.

Eyetech ist wohlbekannt als mit gro&szlig;er Zuverl&auml;ssigkeit f&uuml;hrend in der 
Unterst&uuml;tzung des Amiga und der Amiga-Gemeinschaft. Eyetechs Verbindung zum 
Amiga-Markt besteht schon seit 1993.

Amiga und Eyetech haben gemeinsam die Vision und die Strategie, das Amiga 
Operating Environment der n&auml;chsten Generation als die f&uuml;hrende Hardware-
unabh&auml;ngige Multimedia-Plattform f&uuml;r das Jahr 2000 und dar&uuml;ber hinaus 
wieder aufzubauen. Beide Gesellschaften glauben, dass diese Strategie den 
Amiga wieder auf seine angestammte Position als F&uuml;hrer der Multimedia-
Computer-Anwendungen zur&uuml;ckbringen und damit die die Anerkennung und den 
Stolz der loyalen Amiga-Gemeinschaft zur&uuml;ckgewinnen wird, die sich in den 
vergangenen 15 Jahren nicht hat unterdr&uuml;cken lassen.

Unsere Verbindung mit dem langj&auml;hrigen Vorsitzenden der Gesellschaft, Alan 
Redhouse, beweist, das Eyetech fest an unser Produkt, unsere Firma und 
unsere Gemeinschaft glaubt. Besonders interessant sowohl f&uuml;r Amiga wie auch 
f&uuml;r die Gemeinschaft ist Eyetechs EZTower Mk5, welcher - in einem einzelnen 
Tower-Geh&auml;use - einen A1200 (optional mit PPC/BVision) mit einer 
Entwickler-Maschine der n&auml;chsten Amiga-Generation und dem SDK (Software 
Developer Kit = Software-Entwickler-System) vernetzt.
"Eytechs Ruf ebenso wie seine F&auml;higkeit, ein Ger&auml;te so hoher Qualit&auml;t und 
so weitreichender M&ouml;glichkeiten sowohl als EZTower Mk5 wie auch als EZDev-
Plus - Eyetech's Nur-Entwickler-Ger&auml;t - der Amiga-Gemeinschaft anzubieten, 
ist ohne Beispiel. Wir unterst&uuml;tzen Alan und seine Mannschaft bei Eyetech 
von ganzem Herzen und begr&uuml;&szlig;en Eyetech zusammen mit der Gemeinschaft in der 
Amiga-Zukunft", sagte Randall Hughes, Vize-Pr&auml;sident f&uuml;r Verkauf und 
Strategische Verbindungen bei Amiga.

Alan Redhouse erl&auml;uterte: "Ich freue mich, dass Eyetech zum Partner von 
Amiga erw&auml;hlt wurde, Gesellschaften und Einzelpersonen dabei unterst&uuml;tzen 
zu k&ouml;nnen, die Vorteile bei der Umsetzung und Entwicklung von Anwendungen 
unter dem neuen Amiga Operating Environment wahrnehmen zu k&ouml;nnen. Wir 
werden nat&uuml;rlich weiterhin weltweit die Benutzer des klassischen Amiga 
bedienen und unterst&uuml;tzen. Wir haben dazu 5000 Quadratfu&szlig; (500 
Quadratmeter) Lagerplatz nur f&uuml;r Amiga-Produkte hier in unser Basis in den 
UK.

"Der klassische Amiga bildet auch die Grundlage unseres Multimedia-
Pr&auml;sentations- und Kiosk-Systems, denn sein eng eingebundenes, 
zweckbestimmtes vorbelegendes (preemtive) Multitasking-zentriertes 
Betriebssystem erm&ouml;glicht uns die Einhaltung einer Ausf&uuml;hrungs-, 
Zuverl&auml;ssigkeits- und Preis-Qualit&auml;t, die von einem auf PC basierenden 
System nicht ann&auml;hernd erreicht werden kann. Wir freuen uns darauf, neue 
Hochleistungs-Multimedia-Produkte um das Amiga Operating Environment der 
Neuen Generation entwickeln zu k&ouml;nnen, wie wir auch weiterhin unsere Kunden 
im kommerziellen und Heimbereich unterst&uuml;tzen werden."

Die Entwickler-Ger&auml;te von Eyetech f&uuml;r das Amiga Operating Environment der 
Neuen Generation werden offiziell am 1. Juni 2000 zur Verf&uuml;gung stehen.
Die Produktreihe enth&auml;lt auf EZTower Mk 5 basierende integrierte Systeme, 
Aufr&uuml;st-S&auml;tze f&uuml;r Besitzer von EZTowers und das reine Entwicklersystem 
EZDev-Plus. Alle Systeme werden mit der 5-Click Amiga-Linux-Netzwerk-
Software von Eyetech ausgeliefert, die besonders an das neue Amiga 
Operating Environment angepasst wurde.

Weiter Einzelheiten erfahren Sie von:

   Randall P Hughes
   VP Sales and Strategic Business Development
   AMIGA INC.
   randy@amiga.com


   Alan M Redhouse
   Chairman, Eyetech Group Ltd
   The Old Bank
   12 West Green
   Stokesley
   North Yorks
   TS9 5BB, UK
   Phone: +44 164 271 3185
   Fax: +44 164 271 3634
   Email: sales@eyetech.co.uk


&Uuml;ber Eyetech

Eyetech wurde urspr&uuml;nglich im Jahre 1983  gegr&uuml;ndet, um die Vorteile 
automatischer Daten-Sammelsystemen gro&szlig;en kommerziellen Firmen nahe zu 
bringen. Die Gesellschaft war intensiv mit vielen sehr ausgepr&auml;gten 
Projekten befasst, vom automatischen Wegezoll-Inkassosystem an der 
Dartford-Flusskreuzung (London, UK) bis hin zu den meisten Bar-Code-
Systemen zur Transportweg-Verfolgung, die beim nationalen Paketdienst des 
UK verwendet werden.

Eyetech wurde 1983 als Tochtergesellschaft einer internationalen 
Gesellschaft im UK gegr&uuml;ndet. Seit dem Sp&auml;tjahr 1985 - nach einem 
Ausverkauf des Managements - firmiert Eyetech als privat haftende 
Gesellschaft. Die Gesellschaft war haupts&auml;chlich mit der Fertigung 
ma&szlig;geschneiderter kommerzieller Sowftware/Systeme besch&auml;ftigt - 
haupts&auml;chlich unter Unix/AIX - zum Teil im Transport- und Verteilungs-
Bereich. Eyetechs Spezialit&auml;t waren die Weg-Verfolgungssysteme mit Bar-
Codes - tats&auml;chlich haben die meisten Paketdienste im UK, die Bar-Codes 
verwenden, ein System, das von Eyetech entwickelt und/oder eingerichtet 
wurde. Die Gesellschaft fertigt auch Bar-Code-Leseger&auml;te und industrielle 
(vernetzte) Datenaufnahme- und Zugangs-Kontrollsysteme f&uuml;r Verkaufsr&auml;ume.

Eyetech interessierte sich f&uuml;r den Amiga und wurde eingetragener Entwickler 
f&uuml;r Amiga gegen Ende 1993. Eyetechs Amiga-bezogene kommerzielle Systeme 
umfassen zur Zeit zwei Hauptbereiche: Als eine integrierte Multimedia-
Entwicklung / Als eine Lieferplattform f&uuml;r seine derzeitigen Kunden mit 
ma&szlig;geschneiderten Systemen aufgebaut um klassische Amiga-Architektur.

Umgebaute klassische Amiga-Hardware als preiswerte Multitasking-Grundlage 
wird verwendet f&uuml;r die Datensammlung und -kontrolle in Verkaufsr&auml;umen, 
wobei gleichzeitig &ouml;rtliche Untersuchungen und die R&uuml;ckgabe der Daten an 
(typischerweise) Berechnungsmaschinen als Hintergrundprozess erfolgen.

Bei der Entwicklung der Amiga-Expertensysteme w&auml;hrend der vergangenen Jahre 
musste Eyetech Hard- und Software-Komponente, die nicht ab Lager, zu 
vern&uuml;nftigen Preisen oder in industrieller Qualit&auml;t von den &uuml;blichen Amiga-
H&auml;ndlern zu erhalten waren, beistellen. Die Gesellschaft musste deshalb 
diese Teile anderswo entwickeln bzw. beschaffen lassen und begann damit, 
die &uuml;bersch&uuml;ssigen Teile als Versandh&auml;ndler der &uuml;brigen Amiga-Gemeinschaft 
zur Verf&uuml;gung zu stellen. Diese Sparte des Gesch&auml;fts entwickelte sich 
weiter und f&uuml;hrte dazu, dass Eyetech einer der gr&ouml;&szlig;ten Versand-
Einzelh&auml;ndler f&uuml;r Amiga-Produkte im englischsprachigen Raum geworden ist.«
 
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
(Quelle des Originals: AMIGA, Inc.)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
