<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Taos intent, Java Technology Edition, nun von Sun autorisiert

»Extrem leistungsf&auml;hige, speichereffiziente L&ouml;sung zum Betrieb von auf 
Java(TM) basierenden Mediainhalten quer &uuml;ber digitale Kunden-Ger&auml;te hinweg.

JavaOne(SM)-Konferenz, San Francisco, Kalifornien. 6. Juni 2000 --

Die Tao-Gruppe gibt heute bekannt, dass sein Multimediasystem zur 
Verbesserung von auf Java(TM)-Technologie basierenden Anwendungen, das 
"intent, Java Edition", von Sun mit dem Status "Sun Authorized Virtual 
Machine" ausgezeichnet wurde, nachdem es Suns umfassende Pr&uuml;fungen f&uuml;r 
PersonalJava(TM) bestanden hat.

Seit einigen Jahren wird intent von Taos Ingenieurabteilung zum Einsatz f&uuml;r 
verbundene Ger&auml;te in h&auml;uslichen und mobilen Netzwerken entwickelt. 
Nachdruck lag auf der Erschaffung einer offenen, umfassenden, anpassbaren, 
kompakten, schnellen und bin&auml;r portablen Multimedial&ouml;sung, die 
hochentwickelte F&auml;higkeiten zur Wiedergabe von Audio- und Videostr&ouml;men hat. 
Das Herzst&uuml;ck bilden Taos von Sun anerkannte Virtual Machine und Libraries 
(Programm-Bibliotheken). Heute wird diese Software in einem weiten Bereich 
des Markts eingesetzt, eingeschlossen sind digitale Spiele, Heim-Netzwerke, 
digitales Fernsehen, automatische Fahrzeuge und Telefone.

"Taos Verpflichtung zur Kompatibilit&auml;t ist der Schl&uuml;ssel zur F&ouml;rderung der 
Anpassung der Java-Plattform an wachsende M&auml;rkte, wie die digitalen 
Kundenger&auml;te sie bieten," sagte Curtis Sasaki, Direktor f&uuml;r 
Produktvermarktung, Kunden-Technologien bei Sun Microsystems. "Taos 
anpassungsf&auml;hige virtuelle Maschine und die Programm-Bibliotheken bieten 
einen beeindruckende Umfang grafischer M&ouml;glichkeiten f&uuml;r Hersteller, die 
Kundenger&auml;te mit einem breit gef&auml;cherten Bereich an M&ouml;glichkeiten 
entwickeln."

Bill McEwen, Pr&auml;sident von Amiga, stellt fest, dass "Amiga weiterhin die 
offenste Multimedia-schaffende und k&uuml;nstlerische Gemeinschaft der Welt 
unterst&uuml;tzt. Die Plattform des Neuen Amiga ist auf der intent-Grundlage 
erbaut, weil nur intent die Infrastruktur zur Verf&uuml;gung stellt, mit der wir 
die Erwartungen des Marktes erf&uuml;llen k&ouml;nnen. Amiga wird eine Fundgrube f&uuml;r 
eine un&uuml;bersehbare Menge hochwertiger Multimedia-Erzeugnisse sein, denen 
intent zu Grunde liegt, und wir erwarten passende in der Java-Sprache 
programmierte Anwendungen, die auf Maschinen mit Tao als Basis laufen als 
die grundlegende Komponente, um Amiga zum De-Facto-Standard zu machen."

"Die fortschrittlichen Multimedia-Technologien von intent in Verbindung mit 
der Java-Technologie bieten Tao eine einmalige und starke Position auf dem 
Verbrauchermarkt," meint Hiro Uchida, General-Direktor der strategischen 
Risiko-Management-Gruppe, Sony Corporation.

"Auf dem Markt besteht ein wachsender Bedarf nach Java-Anwendungen, die auf 
Ger&auml;ten mit einem ARM&#174;-Kern laufen," sagte Andrew Cummins, Java-Programm-
Manager, ARM. "Taos L&ouml;sung f&uuml;r die Architektur von ARM bietet unseren 
silicon-(IC-Entwicklungs-) und System-Partnern eine hocheffektive 
Multimedia-Komponente f&uuml;r die n&auml;chste Generation Java-f&auml;higer Ger&auml;te, die 
auf einen weiten Bereich von Anwendungen hinzielen, eingeschlossen 
automatische Fahrzeuge, digitales Fernsehen und L&ouml;sungen f&uuml;r mobile 
Kommunikation."

Ray Burgess, korporativer Vizepr&auml;sident von Motorola, bemerkt, dass "Java-
Technologie schnell eine Notwendigkeit in der bilderzeugenden und 
unterhaltenden Welt wird. Bisher haben ja oft die Gr&ouml;&szlig;e und Grenzen der 
Leistungsf&auml;higkeit die M&ouml;glichkeiten bei der Verwendung von Java-Software 
in Anwender-Ger&auml;ten eingeschr&auml;nkt. Taos vollst&auml;ndig anpassbare 
beschleunigte Java-Maschine wird uns helfen, diese Schranken zu 
durchbrechen und er&ouml;ffnet uns den ganzen Bereich neuer Gegebenheiten f&uuml;r 
vernetzte Java-Ger&auml;te."

Mike Foss, Executive Manager (Betriebsleiter) bei Hitachi Semiconductor, 
kommentiert: "Unsere Unterst&uuml;tzung f&uuml;r Tao existiert seit einigen Jahren. 
Wir freuen uns, dass Taos Unterst&uuml;tzung der Multimedia-Java-Technologie bei 
der SH-Familie der Mikroprozessoren sowohl angepasst, aber auch aufregend 
ist."

Takeshi Shibamoto, beigeordneter Direktor von Victor Co. in Japan [JVC], 
bemerkte: "Ich freue mich zu sehen, dass Taos wunderbare Technologie nun 
anerkannt ist. Wir arbeiten mit Taos Mannschaft seit einigen Jahren 
zusammen und es ist eine Genugtuung f&uuml;r uns, dass unser Glaube an diese 
Weltklasse-Software nun voll best&auml;tigt ist. Ich erwarte, dass Taos Software 
im Verbraucher- und Professionalbereich viele Jahre lang eine wichtige 
Rolle spielen wird."

Hiroshi Saito, Direktor und General-Manager bei Fujitsu Aichi Engineering 
stellte fest, dass "Fujitsu AEL Taos Technologie stark unterst&uuml;tzt, weil 
sein Java und sein Multimedia es einfach zum Besten seiner Klasse machen."

"Cadence Design Services und Tao arbeiten eng miteinander, um L&ouml;sungen f&uuml;r 
integrierte Technologie zu schaffen und L&ouml;sungen f&uuml;r Dienstprogramme zu 
entwerfen, und damit Taos Produkt, die intent JTE (Java Technology 
Edition), in den globalen Markt einzuf&uuml;hren," sagte Brent Hudson, 
Vizepr&auml;sident und Generaldirektor von der Cadence's Wireless und Multimedia 
Design Gruppe. "intent vereinigt hervorragende Leistung mit minimalem 
Bedarf an Speicher und ist ideal geeignet f&uuml;r den schnell wachsenden Markt 
des digitalen Fernsehens, einem Bereich, in dem wir bemerkenswerte 
Erfahrung gesammelt haben und wo Java-Vertr&auml;glichkeit eine lebenswichtige 
Komponente ist."

"Es ist wirklich gut &uuml;ber den Durchbruch einer Technologie sprechen zu 
k&ouml;nnen, die tats&auml;chlich das mitbringt, was der Markt braucht, und die es 
auch schon gibt," sagte Tetsuya Hikino, leitender Direktor, NEC Electronics 
(UK) Limited, "die M&ouml;glichkeiten von Taos Software sind bemerkenswert und 
ich bin sicher, sie wird sich rasch &uuml;berall bei Multimedia- und auf 
Internet basierenden Ger&auml;ten einf&uuml;hren."

Gem&auml;&szlig; Huw Price-Stephens, dem technischen Direktor bei Yes Television, 
einem f&uuml;hrenden Anbieter von interaktiven TV-Produkten und 
Dienstleistungen, "ist Java-Vertr&auml;glichkeit eine kritische Anforderung, um 
Rundfunk- und Dienstanbietern die die Zusammenarbeit &uuml;ber verschiedene 
Plattformen hinweg zu garantieren. YES Television unterst&uuml;tzt die Java-
Technologie kr&auml;ftig und freut sich, die Vorteile von Taos einmaliger und 
vertr&auml;glicher JVM-Einrichtung wahrnehmen zu k&ouml;nnen."

Martyn Gilbert, leitender gesch&auml;ftsf&uuml;hrender Vorstand von Amino 
Communications sagte: "W&auml;hrend Aminos Hardware-Entwicklungen die Art und 
Weise revolutioniert haben, wie kundenspezifische Internet-Anwendungen 
heute erzeugt werden, hat Tao so gut wie das Gleiche mit seinen F&auml;higkeiten 
bei der Media-Software erreicht. Wir haben den Markt sehr intensiv 
durchforscht, um sicher zu stellen, unseren Kunden in jeder Hinsicht das 
Beste bieten zu k&ouml;nnen, aber Tao ist so &uuml;ber die Konkurrenz 
hinausgewachsen, dass man zweimal hinschauen muss, um das zu glauben!"

"Diese Ank&uuml;ndigung befestigt weiterhin die Java-Technologie als die 
erw&uuml;nschte Entwicklungs-Plattform f&uuml;r intelligente Ger&auml;te," stellte Jaison 
Dolvane, Pr&auml;sident und CEO von Espial fest. "Tao und Espial arbeiten 
zusammen, um eine herausragende und umfassende L&ouml;sung f&uuml;r intelligente 
Ger&auml;te zu schaffen, vollst&auml;ndig mit Multimedia-F&auml;higkeiten, mit der Java-
Sprache, einer universalen Plattform f&uuml;r Dienstleistungen, 
Kerneinrichtungen f&uuml;r das Internet und mit Entwicklungswerkzeugen. Zusammen 
mit Taos hervorragender Java-Technologie der virtuellen Maschine wird 
Espial bald seinen Kunden vollst&auml;ndige und robuste L&ouml;sungen f&uuml;r die M&auml;rkte 
f&uuml;r TV, drahtlose &Uuml;bertragungen, Kraftfahrzeuge, Spiele und Internet-
Anwendungen bieten."

"Durch die Kombination hoher Leistung mit geringem Speicherbedarf 
entspricht intent den hohen Anforderungen von Ger&auml;ten der n&auml;chsten 
Generation, die auf dem QNX&#174; 4 Realtime OS gr&uuml;nden," sagte Linda Campbell, 
Vizepr&auml;sident f&uuml;r strategische Allianzen bei QNX Software Systems.

"Gemeinsam bieten QNX und intent Entwicklern eine L&ouml;sung, die sofort 
zuverl&auml;ssig, offen und Medien-reich ist," sagte Mr. Norizaku Suzuki, 
Pr&auml;sident der ASCII Corporation in Japan. "ASCII half dieses Programm zu 
sponsorn und wir haben seine Entwicklung mit gro&szlig;er Bewunderung verfolgt. 
Taos Technologie bietet viel Wertzuwachs, der wichtig f&uuml;r die Hersteller 
von Verbraucherelektronik, Rundfunk, Operatoren und Endanwender ist, und 
wir glauben, dass die weite Ausbreitung von intent unvermeidlich ist."

Yasuhiro Kawashima, Pr&auml;sident von WebLogic, sagte: "Wir und Tao erwarten 
die Weiterentwicklung des wunderbaren intent Java Multimedia-Produkts mit 
der Einf&uuml;hrung von WebLogics h&ouml;herwertiger Hardware-Beschleunigung. Eine 
preiswerte, super-schnelle und Java-geeignete Multimedia-L&ouml;sung ist etwas, 
wor&uuml;ber jeder froh sein sollte."

"Wir hatten nichts anderes als vollst&auml;ndige Unterst&uuml;tzung von Sun. Ihre 
Offenheit ist herzerfrischend," sagte Francis Charig, Vorsitzender der Tao 
Gruppe. "Ich glaube, das Modell, das sie entwickelt haben und das andere 
Gesellschaften wie Tao ermutigt, ihre Standardangebote aufzuwerten, ist 
sehr erfolgreich. Tao konnte Technologien zur Unterst&uuml;tzung der bin&auml;ren 
Portabilit&auml;t, zum g&uuml;nstigeren Speicherverbrauch, neue, bessere Techniken 
zur "garbadge collection" und zur Kundenanpassung und viele weitere 
einzigartige Eigenschaften beisteuern und dabei die wichtige Kompatibilit&auml;t 
zu den Java-Spezifikationen beibehalten. Am Wichtigsten ist jedoch, dass 
wir den Markt f&uuml;r digitale Ger&auml;te voran treiben durch den Einsatz 
hochwertiger, auf Java basierender Multimedia-Anwendungen."


Anmerkungen f&uuml;r Redakteure

&Uuml;ber Tao

Die Tao Gruppe ist eine Schmiede f&uuml;r intelligente Entwicklungen und 
Software-Organisation spezialisiert auf Technologien f&uuml;r Heim- und mobile 
Netzwerke. Gegr&uuml;ndet im Jahre 1992 bietet die Gesellschaft herausragende 
Erzeugnisse f&uuml;r die entstehenden, schnell wachsenden M&auml;rkte f&uuml;r 
intelligente Verbraucherger&auml;te. Die Philosophie der Gesellschaft gr&uuml;ndet 
sich darauf, leistungsf&auml;hige Ramenwerke f&uuml;r die Anwendungen &uuml;ber den ganzen 
Bereich der Netzwerktechnik von intelligenten Telefonen bis hin zum 
digitalen Fernsehen zu liefern, in das Taos Kunden ihre eigenen 
Markenfabrikate einbauen und mit ihren eigenen Mitteln aufwerten k&ouml;nnen. 
Motorola und Sony halten Anteile an der Tao Gruppe. Unter seine Kunden sind 
"Blue-Chip-Technologie"-Gesellschaften quer durch Nord-Amerika, Japan und 
Europa und das "intent toolkit" ist die dem Neuen Amiga zugrunde liegende 
Anwendungsebene. Hauptniederlassung ist in Reading, England, B&uuml;ros werden 
in Tokyo und Kalifornien unterhalten. Tao besitzt hochwertige globale 
Patente und ist Empf&auml;nger mehrerer Industrie-Auszeichnungen sowohl f&uuml;r 
seine Technologien wie auch f&uuml;r seine Wachstumsrate als Gesellschaft.
 
Sun, Sun Microsystems, das Sun Logo, Java und PersonalJava sind 
Warenzeichen oder eingetragene Warenzeichen von Sun Microsystems, Inc. in 
den Vereinigten Staaten und anderen L&auml;ndern.«

Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
(Quelle des Originals: AMIGA, Inc.)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
