<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Messebericht
------------

1. Die gro&szlig;e, kleine Messe - ein Bericht aus Neuss (von Martin Baute)

»Die "Welt der Alternativen" ist klein geworden, - zumindest r&auml;umlich 
gesehen - das war mein erster Eindruck von der World of Alternatives,
die in der Neusser Stadthalle veranstaltet wurde.

Nach dem rapiden R&uuml;ckgang der Besucherzahlen und des Niveaus der Messe in
K&ouml;ln - zu sp&uuml;ren schon 1998, und letztes Jahr nicht mehr zu &uuml;bersehen -
hatte ich schon fast bef&uuml;rchtet, in Neuss einen verbesserten Flohmarkt
vorzufinden. Doch im Gegensatz zur Fl&auml;che stand das Niveau dieser Messe der
Home Electronics World in nichts nach.

Man sah viele bekannte Gesichter. Vielleicht ZU bekannt, denn wenn man bei
jedem zweiten Besucher das bestimmte Gef&uuml;hl hat, ihn schon einmal auf einer
&auml;hnlichen Veranstaltung gesehen zu haben, dann fehlt dem Markt frischer
Wind. Nat&uuml;rlich keine wirklich neue Entdeckung... So waren denn auch keine
aufregend neuen Produkte zu bestaunen; die Demo-Animation der Fantasy-
Simulation "Tales of Tamar" war hier eine nennenswerte Ausnahme, die von 
den Besuchern auch alle halbe Stunde entsprechend gew&uuml;rdigt wurde.

Ansonsten war von der Messe nur wenig zu berichten. Ja, hier und da gab es 
Software in einer neuen Version, oder eine weitere Hardware f&uuml;r den 
betagten A1200. Am Stand von individual computers hatte Jens Sch&ouml;nfeld 
einen von Jay Miner handsignierten A1000 ausgestellt.

Screenshot:
<IMG SRC="../extra/WoA1.jpg" ALT="Screenshot">

Der Besucherstrom f&uuml;llte zwar zeitweilig die Halle bis zum Bersten, was
aber aufgrund der sowieso herrschenden Enge nicht viel besagt.

Screenshot:
<IMG SRC="../extra/WoA2.jpg" ALT="Screenshot">

Und doch war ein aufziehender frischer Wind zu sp&uuml;ren, und zwar aus 
Richtung der Vortrags-"R&auml;ume". Bill McEwen, Pr&auml;sident von Amiga Inc., war 
aus den USA angereist, um den Wissensdurst der Anwender- und 
Entwicklergemeinde zu stillen. Im Gep&auml;ck dabei hatte er die Erstausgabe des 
Amiga Software Developer Kits (SDK) - das, entgegen vorheriger 
Ank&uuml;ndigungen, auch ohne unterzeichnete Stillschweigenserkl&auml;rung frei 
verk&auml;uflich war.

Genaueres zum SDK werde ich sp&auml;ter noch sagen, doch einen kleinen D&auml;mpfer
vorneweg: Nein, das SDK enth&auml;lt keine grafische Entwicklerumgebung. Es
enth&auml;lt noch keinen startf&auml;higen neuen Desktop, auf dem man sofort neue
Anwendungen ausprobieren kann. Es fehlen noch verschiedene Teile (z.B. 3D-
und Sound-Unterst&uuml;tzung). Und der Anteil der Firma Amiga Inc. an diesem SDK
ist (noch) relativ gering. Der Gro&szlig;teil des SDKs ist von und &uuml;ber Tao, den
Technologie-Partner von Amiga Inc.

Doch auf der anderen Seite - neben dem beinahe obligatorischen C/C++-
Compiler (einer modifizierten Version des gcc) enth&auml;lt das SDK eine Java
Virtual Machine (die laut Sun 22-mal schneller bei der Darstellung von
Multimedia-Inhalten ist als jede andere JVM), einen Java-Compiler mit
Unterst&uuml;tzung f&uuml;r PersonalJava 1.1.7 - zertifiziert durch Sun, volle
Unicode-Unterst&uuml;tzung, Dokumentation und Tools zum Programmieren in VP
(dem Objekt-basierten, bin&auml;rkompatiblen Makro-Assembler, der die Grundlage
f&uuml;r das neue Betriebssystem bildet), sowie fast 300 Seiten gedruckter
Dokumentation zus&auml;tzlich zu 4 MByte (gepackter) Online-Dokumentation. Ich
lasse das einmal f&uuml;r sich selbst sprechen.

Mindestens genauso interessant wie das SDK waren die Informationen, die man
bei den Pr&auml;sentationen Bill McEwens erhaschen konnte. Partnerschaften,
M&ouml;glichkeiten, Zukunftsaussichten - wer die Anstrengungen von Amiga Inc.
mit dem vergleicht, was EsCom bzw. Gateway zu Wege gebracht haben, muss
von dem Schwung und Tempo der neuen Mannschaft begeistert sein. Ob dieses
Unternehmen von Erfolg gekr&ouml;nt sein wird, liegt nicht (allein) in unserer
Hand. Aber Bill McEwen glaubt ganz offensichtlich felsenfest an sein
Projekt, und er versteht es, andere mit seinem Enthusiasmus anzustecken.

Man merkte zwar deutlich, dass viele seiner Zuh&ouml;rer sich st&auml;rkere
Zugest&auml;ndnisse an den "Classic"-Markt gew&uuml;nscht h&auml;tten. Mehrfach wurde die
Frage nach einer Weiterentwicklung des AmigaOS 3.5 gestellt. Doch McEwen
entt&auml;uschte diese Hoffnungen, und er tat es offen, ehrlich und mit einer
verst&auml;ndlichen Begr&uuml;ndung: Das AmigaOS auf den PPC zu portieren, w&auml;re eine
Aufgabe von 18 bis 24 Monaten - und selbst dann w&auml;re diese Portierung nur 
zu 80% vollst&auml;ndig (sprich, kompatibel), da viele Teile des OS sehr eng mit 
den Custom Chips verkn&uuml;pft sind.

Da sich schon das OS 3.5 nur sehr z&ouml;gerlich verkaufen lie&szlig; - und ein auf 
PPC basierender Hardware-Nachfolger von A4000 und A1200 ebenfalls nicht in 
Sicht ist - w&uuml;rden sich die Anstrengungen einer solchen Portierung einfach 
nicht auszahlen.

Statt dessen will sich Amiga Inc. voll auf die Zukunft, auf das neue OS 
(das ja eigentlich ein OE - Operating Environment - sein soll, Collas l&auml;&szlig;t
gr&uuml;&szlig;en) und auf neue Partnerschaften konzentrieren. Jahrelang haben wir
dar&uuml;ber geschimpft, dass "unsere" jeweiligen "Mutterkonzerne" 
schwachsinnige Entscheidungen getroffen, Marktchancen nicht erkannt und 
keine Zukunftsvisionen entwickelt haben. Bleibt nur zu bedauern, dass nach 
einem Jahrzehnt technologischem Stillstand eine "Wiederbelebung" der 
"Classic"-Amigas inzwischen unter "schwachsinnige Entscheidung" f&auml;llt. 
Traurig, aber wahr.

Also, wie sieht die Zukunft aus?

Das SDK ist - zumindest f&uuml;r Entwickler - der erste Schritt. Die Version 1.0
ist noch recht eingeschr&auml;nkt: Sie l&auml;uft nur mit einer Linux-Installation 
als Host, und auch nur auf einem x86er Prozessor. Offiziell getestete 
Linux-Distributionen sind Red Hat 6.1 (_nicht_ 6.2, die diverse Fehler 
enth&auml;lt!), und Corel Linux. Verschiedene Anwender haben das SDK auch unter 
der hierzulande leichter erh&auml;ltlichen SuSE 6.4-Distribution erfolgreich 
getestet.

Sp&auml;tere Versionen des SDK (Updates k&ouml;nnen umsonst aus dem Internet
heruntergeladen werden) laufen dann auch auf anderen Prozessoren, z.B.
APUS-Linux auf PPC-Amigas - aber auch StrongARM, MIPS, SH/4 und andere
CPUs, wie sie z.B. in Spielkonsolen viel verwendet werden. Diese
Kompatibilit&auml;t &uuml;ber CPU-Grenzen hinweg gilt dann nat&uuml;rlich auch f&uuml;r das
endg&uuml;ltige OS f&uuml;r Anwender.

Das OS-Endprodukt wird dann auch andere Betriebssysteme als Host nutzen
k&ouml;nnen, so z.B. Windows (98, NT, CE) oder QNX. Unterst&uuml;tzung f&uuml;r Nicht-
Desktop-OS wie EPOC oder PalmOS sind in der Entwicklung. So kann man sp&auml;ter
ganz einfach mal in das neue AmigaOS "reinschn&uuml;ffeln", ohne gleich vollends
umsteigen zu m&uuml;ssen - f&uuml;r Quereinsteiger sicher ein starkes Argument.

Nat&uuml;rlich wird das neue Betriebssystem sp&auml;ter keinen Host mehr ben&ouml;tigen,
sondern wahlweise auch als eigenst&auml;ndiges OS fungieren k&ouml;nnen - 
entsprechende Treiber vorausgesetzt (wobei Haage & Partner bereits 
angek&uuml;ndigt hatten, ihr WarpUP entsprechend anzupassen). F&uuml;r Entwickler 
wird empfohlen, ein System mit AMD-K6-2 CPU, Matrox G400 Grafikkarte, 
Soundblaster Live! und 128 MByte RAM anzupeilen, da dies die 
Spezifikationen f&uuml;r die Amiga DevBox sind.

Volle Unterst&uuml;tzung f&uuml;r Entwickler bei Hardware-Problemen kann und wird
Amiga Inc. aber nur bei den Maschinen leisten, die von lokalen H&auml;ndlern
unter Lizenz als DevBox im Bundle mit dem SDK verkauft werden.

Und der Anwender, der nicht programmieren kann oder m&ouml;chte?

Nun, Bill McEwen hat den AmigaOne angek&uuml;ndigt, einen Multimedia-Desktop mit
dem neuen Betriebssystem, der von Amiga Inc. entwickelt und von einer
Partnerfirma hergestellt werden wird, sobald das neue Betriebssystem soweit
ist. &Uuml;ber die verwendete Hardware wollte er noch nichts sagen, denn es wird
noch einige Zeit dauern, bis es soweit ist. Andererseits, wenn das
Betriebssytem einmal fertig ist, wird es ziemlich egal sein, auf welcher
Hardware man es einsetzt...

Martin Baute &lt;solar@baud.de&gt; am 27.Juni 2000« 

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
