<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Die Pressekonferenz auf der World of Alternatives (von Martin Baute)

»Fast eine dreiviertel Stunde hat Bill McEwen in einem dr&uuml;ckend hei&szlig;en
"Tagungsraum" (der aus einigen aufgestellten Plastikw&auml;nden, einem Pult und
viel zu wenigen St&uuml;hlen bestand) &uuml;ber die Zukunft von Amiga gesprochen. Zu
h&ouml;ren gab es da einiges. Also das Diktierger&auml;t zur&uuml;ckgespult und das
Wichtigste zusammengefa&szlig;t...

Screenshot:
<IMG SRC="../extra/WoA3.jpg" ALT="Screenshot">

Nachdem der Beamer im f&uuml;nften Versuch erfolgreich aus dem Standby geweckt
war, legte McEwen mit viel Schwung und Humor los ("Wellcome to the Amiga
sauna..."). Als erstes r&auml;umte er das Ger&uuml;cht aus, Amiga w&auml;re gegen&uuml;ber
Gateway in Zahlungsverzug. Amiga schuldet Gateway kein Geld. Mehr noch,
Amiga h&auml;tte &uuml;berhaupt keine Schulden.

Des weiteren wiederholte er die Vorstellung von Dean Brown (DKB) als
Director of Hardware; dieser w&auml;re verantwortlich, Referenz-Hardware
herzustellen, an der sich interessierte Drittanbieter orientieren k&ouml;nnten.
Bereits fertiggestellt w&auml;re ein Spiele-Handheld, der intern von Amiga
benutzt w&uuml;rde, um Interessenten aus dem Bereich der Consumer Electronic von
den F&auml;higkeiten des neuen Betriebssystems zu beeindrucken. Basierend auf
einem StrongARM mit 250 Mips, mit Anschlu&szlig; f&uuml;r einen Sony Memory Stick und
einem Farbdisplay macht das Ger&auml;t wohl eine recht gute Figur - und war nach
einer Woche Entwicklungszeit fertiggestellt!

Geheimnisvoll gab sich McEwen beim neuen Vice President of Engineering, den
man wohl erst am 10. Juli vorstellen wird, da er im Moment noch f&uuml;r eine
andere Firma arbeitet - "one that is large, and is in trouble, you know..."
(eine die gro&szlig; und in Schwierigkeiten ist), dazu die Geste des
Zerrei&szlig;ens...

Es folgten Informationen zu den Leistungsdaten der Tao Java-VM, die - so
McEwen - 22x schneller in der Bearbeitung von Multimedia-Inhalten sei als
jede andere JVM (!).

McEwen machte auch klar, da&szlig; er die Gemeinde nicht um Geduld bitten w&uuml;rde.
Die Tatsache, da&szlig; die Messe stattfindet, da&szlig; sich die Zuh&ouml;rer im
(zugegebenerma&szlig;en zu kleinen) Raum dr&auml;ngten, w&auml;re Bewei&szlig; genug, da&szlig; die
Amiga-User Geduld h&auml;tten - seit f&uuml;nf Jahren schon. Er machte aber auch
klar, da&szlig; er und seine Mitarbeiter erst seit genausovielen Monaten daran
arbeiten w&uuml;rden, die hoch gesteckten Erwartungen zu erf&uuml;llen.

Als ersten Beweis des Erfolges hatte McEwen Amiga SDKs zur Messe
mitgebracht, die - wie er ausdr&uuml;cklich betonte - noch sehr unvollst&auml;ndig
w&auml;ren und sich in erster Linie an den erfahrenen Entwickler wenden; der
Endanwender wird noch einige Zeit auf ein greifbares Produkt warten m&uuml;ssen.
So w&auml;re z.B. noch keine Unterst&uuml;tzung f&uuml;r Sound, Streaming oder 3D-Grafik
im SDK enthalten, diese w&uuml;rden sp&auml;ter folgen (3D-Support z.B. in etwa zwei
Monaten).

Zu dem immer schon kritischen Thema Marketing gab McEwen zu, da&szlig; ein VP of
Marketing noch nicht eingestellt worden sei - er hielte es f&uuml;r wichtiger,
zun&auml;chst einmal ein Produkt zu entwickeln, f&uuml;r das sich ein entsprechendes
Marketing auszahlen w&uuml;rde; anstatt in "bester" Amiga-Tradition gro&szlig;e
Ank&uuml;ndigungen zu machen, die man dann nicht erf&uuml;llen kann.

Als n&auml;chstes sprach er die urspr&uuml;nglichen Pl&auml;ne an, eine Entwicklerbox als
Kombination als Hard- und Software anzubieten. Aufgrund der negativen
Reaktion der Amiga-User hat man sich anders entschieden - was eine Menge an
&Auml;nderungen und zus&auml;tzlichen Programmen (z.B. Installationsskripts)
notwendig machte. Nun h&auml;tte man die Software des SDK zum Verkauf
freigegeben; die HW/SW-Entwicklerbox w&uuml;rde in etwa zwei Wochen folgen.

Amigas Ziel sei "Ubiquity in Computing": Handy, PDA, Multiprozessor-Server,
ein neuer Desktop, eine neue Spielkonsole, alles unter dem gleichen
Betriebssystem - soetwas h&auml;tte es noch nie gegeben.

Dabei w&auml;ren Anwendungen voll skalierbar. Nachdem man sich als Entwickler
entschieden habe, wo man die eigene Anwendung ansiedeln m&ouml;chte, k&ouml;nne diese
selbe Anwendung die "Food Chain" beliebig weit aufsteigen. Ein f&uuml;r einen
Handheld geschriebenes Spiel w&uuml;rde also auch auf einem Mehrprozessor-Server
laufen. Andersherum w&uuml;rde eine f&uuml;r einen Server geschriebene Anwendung
allerdings nicht auf einem Handy laufen - oder besser, nur sehr, sehr
langsam...

Vom Betriebssystem bereits unterst&uuml;tzte Prozessoren w&auml;ren PPC, M.core, X86,
StrongARM, ARM, SH/3,4,5, MIPS sowie eine Reihe weiterer Prozessoren, die
man (noch) nicht bekanntgeben k&ouml;nnte, weil man unter NDA mit den
Herstellern steht.

Anschlie&szlig;end sprach Bill von der JavaOne, einer Messe, die letzte Woche in
San Francisco stattfand, und auf der die Tao-Group mit einem eigenen Stand
vertreten war. Dieselbe Demonstration, die hier auf der Amiga-Messe gezeigt
wurde, lief dort auf einer Sega Dreamcast, Set-Top-Boxen, einem StrongARM
Notebook und einem x86er. Allein das h&auml;tte die Besucher magnetisch
angezogen, und dann h&auml;tte man das Handy gez&uuml;ckt, auf dem trotz der geringen
Leistung von 3,5 Mips ein Pole Position-Klon gespielt werden konnte. Dies
w&auml;re das gleiche Handy gewesen, mit dem Scott McNeilly (SUN) die B&uuml;hne der
CES im Januar betreten h&auml;tte, "ich habe Ihnen gesagt, das wir eines Tages
Java auf Ger&auml;ten wie diesem haben w&uuml;rden" - nur, da&szlig; es nicht Suns Java-VM
gewesen sei, die auf dem Handy gelaufen w&auml;re...

Auch w&auml;re Linux nicht das einzige Betriebssystem, das als Host f&uuml;r den
neuen Amiga in Frage k&auml;me. Weitere Hosts w&auml;ren Windows, WindowsNT, Linux,
WindowsCE, QNX und OS/9 (einem OS von Microware, das auf Set-Top-Boxen
Marktf&uuml;hrer ist). Host-Unterst&uuml;tzung f&uuml;r iTron, Epoc, VxWorks und PalmOS
sei in der Entwicklung und kurz vor der Fertigstellung.

Die Zusammenarbeit mit der Tao-Group beleuchtete McEwen in einem ganz neuen
Licht. Es sei durchaus nicht so, da&szlig; man nur die Produkte von Tao nutzen
w&uuml;rde. Vielmehr h&auml;tte man Zugriff auf 50 Entwickler bei der Tao-Group, um
Dinge herzustellen, die von Amiga ben&ouml;tigt werden.

Weiter h&auml;tte man die BOOPSI-Bibliotheken portiert. Diese Portierung sei
bereits abgeschlossen, man w&uuml;rde jetzt noch Tests und Optimisierungen
durchf&uuml;hren. Die neue Skriptsprache (SHEEP) sei ebenfalls in den n&auml;chsten
Monaten fertig - die Rechte an ARexx liegen bei einem Dritthersteller,
daher h&auml;tte man eine neue Sprache entwickelt. Das Stichwort Renderware fiel
ebenfalls, auch hierf&uuml;r w&uuml;rde das neue OS vorbereitet sein.

Dann hatte Bill McEwen ein ganz besonderes Bonbon: Wenn die einzelnen Teile
des Betriebssystems zusammengefunden haben, wird es den AmigaOne geben -
einen neuen Multimedia-Desktop, entwickelt und designed by Amiga, wenn auch
von Drittherstellern produziert. Mehr wollte McEwen so fr&uuml;h noch nicht
sagen, der Weg dahin sei noch weit.

Screenshot:
<IMG SRC="../extra/WoA4.jpg" ALT="Screenshot">

Bill McEwen fuhr mit seiner Pr&auml;sentation fort, sprach &uuml;ber OEMs (also
Drittfirmen, die in Zukunft neue Amigas bauen und herstellen sollen) und
ISVs - letzteres sind Firmen, die zwar den neuen Amiga unterst&uuml;tzen wollen,
aber im Moment ihre Aufmerksamkeit auf ihr Kerngesch&auml;ft richten m&uuml;ssen.
McEwen sprach von elf solcher ISVs, die den Entwicklern bei Amiga ihre
Quellcodes &uuml;berlassen haben, da diese Firmen (noch) nicht bereit sind,
eigene Entwicklerkr&auml;fte auf ein Amiga-Projekt anzusetzen.

Nat&uuml;rlich wurden auch die bereits bekannten Partner der Tao-Group genannt:
Sun, Sony, Motorola, JVC und andere. McEwen empfahl, sich die letzte
Presseerkl&auml;rung auf der Tao-Webseite durchzulesen (&uuml;ber die Zertifizierung
der Tao-Java-VM) - vor allem im Hinblick darauf, was f&uuml;r Leute in dieser
Erkl&auml;rung zitiert wurden. Amiga w&auml;re mit jedem einzelner dieser Firmen in
Verhandlungen.

Dann zeigte McEwen Bilder seines alten B&uuml;ros, und Bilder vom neuen
"Amiga-Hauptquartier". Dort bef&auml;nden sich f&uuml;nf weitere Firmen, die zum
gr&ouml;&szlig;ten Teil High-End Elektronik zu Demonstrationszwecken herstellen - und
deren Ausstattung man wohl umsonst benutzen k&ouml;nne.

Dann f&uuml;hrte Bill McEwen einige Demos vor, die unter dem neuen
Betriebssystem liefen, gehostet unter Red Hat Linux auf einem Notebook -
wie er betonte, ohne Hardware-Beschleunigung (die ja im August folgen
soll). Es ist schwierig in Worte zu fassen, aber was gezeigt wurde, waren
blitzschnelle Java-Demos, ein paar 2D-Spiele, die altbekannte Boing-Demo,
frei herumfliegende (und mit der Maus bewegbare) Boing-B&auml;lle, ein
Unicode-f&auml;higer Browser, 2D-Filter, das transparente "Uhr"-Fenster (eine
Uhr, die sich auf dem Bildschirm verschieben l&auml;&szlig;t, w&auml;hrend man den
Boing-Ball dahinter durch die Uhr hindurch greifen und bewegen konnte...
das alles auf Linux aufsetzend, und ohne ein Ruckeln, egal was geschah.
Nein, stimmt nicht, einmal habe ich ein Ruckeln gesehen - als McEwen ein
zweites Mal das Betriebssystem in einem zweiten Fenster startete, hielt die
Animation im ersten Fenster f&uuml;r den Bruchteil einer Sekunde an, um danach
absolut fl&uuml;ssig weiterzulaufen - w&auml;hrend McEwen noch einmal die gleiche
Anzahl Demos im zweiten Elate-Fenster startete.

Insgesamt war die Demo angesichts des fr&uuml;hen Entwicklungsstadiums sehr
beeindruckend; die Fotos k&ouml;nnen das nur zum Teil wiedergeben.

&Uuml;ber einige weitere Pl&auml;ne konnte bzw. wollte McEwen nicht sprechen, verwies
aber auf einen Artikel im Byte Magazine von 1994, auf den auf www.amiga.com
ein Verweis zeigt. Diesen sollte man sich genau durchlesen; man h&auml;tte
einige Dinge in Planung, die alles auf den Kopf stellen w&uuml;rden, was man
&uuml;ber verteilte Rechnernetze (Distributed Computing) heute zu wissen glaube.

Screenshot:
<IMG SRC="../extra/WoA5.jpg" ALT="Screenshot">

Zum Ende stellte sich McEwen den Fragen der Zuh&ouml;rer.

F: Was wird mit dem Classic OS?
McEwen: Wir nutzen die Teile, wo immer das Sinn macht.

F: Wird es daf&uuml;r eine Emulation geben?&lt;
McEwen: Wir haben bereits einen lauff&auml;higen Emulator. Die Tests wurden
bereits durchgef&uuml;hrt, wir optimieren ihn jetzt damit er schnell l&auml;uft. Ihr
kennt Brian King? Ihr wi&szlig;t, wo er arbeitet? Er ist ein guter Mann, Brian.
Er hilft uns. Also, wir arbeiten gerade daran, ihn schneller zu machen, er
ist ein bi&szlig;chen langsam. Wir sind also gerade in der Optimierungsphase.
(Anmerkung des Autors: Brian King ist der Programmierer von WinUAE.)

McEwen: Bevor jemand fragt, Ihr werdet fragen, ob ich [das Classic OS] auf
den PPC portieren werde. Nein. Ich sage Euch, warum. Ganz egal, mit wem ich
gesprochen habe, R.J.Mical, Carl Sassenrath, Allan Havemose, jeder von 
denen hat in der Vergangenheit ein Auge darauf geworfen. Es ist eine Sache 
von 18 bis 24 Monaten, und sie alle zusammen stimmen &uuml;berein das es nur zu 
80% vollst&auml;ndig sein w&uuml;rde. Denn ich m&uuml;&szlig;te den AGA-Chipsatz neu entwickeln,
Agnus, Denise, all diese Dinge sind direkt in das OS eingebunden.
Tats&auml;chlich war das gr&ouml;&szlig;te Problem f&uuml;r Havemose beim Build der 3.1 die
ganzen Fehler in diesen Chips, auf die man achten mu&szlig;te. So w&auml;re es f&uuml;r uns
im Moment zu kostspielig, die Anstrengungen zu unternehmen, die n&ouml;tig
w&auml;ren, um auf dem Markt Gewinn zu machen; wir m&uuml;ssen uns vorw&auml;rts bewegen.
Es hilft mir nicht, &uuml;berall zu sein. Es hilft mir nicht dabei, ein
skalierbares Betriebssystem zu bauen, und das ist was wir zum Erfolg
brauchen. Einfach ein weiteres System auf einem bestimmten Chip zu sein,
ist nicht genug. Wir m&uuml;ssen zu Sony gehen k&ouml;nnen, zu Panasonic, zu all
diesen Leuten, und sagen k&ouml;nnen "w&auml;hlt Euren Chip".

F: (Schlecht zu verstehen, Frage &uuml;ber die Hardware-Anforderungen des SDK,
ob es ein spezieller Prozessor sein mu&szlig;.)
McEwen: Das SDK... wenn Du Red Hat Linux fahren kannst, sollte alles in
Ordnung sein. Wir haben es unter Red Hat und Corel getestet. Da sollte
alles in Ordnung gehen.

F: Wird es auch auf dem Amiga laufen?
McEwen: Nicht im Moment, nein. Wir haben nichts auf dem 68000. Wir hoffen,
mit unseren Freunden zusammenarbeiten zu k&ouml;nnen, so da&szlig;, wenn Du PPC hast,
auf dem bekannterweise Linux l&auml;uft, Du darauf aufsetzen kannst. Und wir
werden native auf den PPC-Karten laufen k&ouml;nnen. Das ist im Moment eines
unserer gr&ouml;&szlig;ten Probleme, Ihr habt Zusagen von Leuten erhalten, und nichts
passiert.

F: Planen Sie das Design der Schnittstelle zu &auml;ndern?
McEwen: Sie ist entworfen mit einer Flexibilit&auml;t &auml;hnlich wie heute, so da&szlig;
Ihr sie einstellen k&ouml;nnt wie Ihr sie wollt. Es wird verschiedene Vorgaben
geben, da ein Amiga-User wahrscheinlich die Workbench als Vorgabe haben
will, aber andere Kunden es anders haben wollen. Ihr bekommt die Vorgaben,
mit der Freiheit, sie beliebig zu &auml;ndern.

F: (nicht zu verstehen) McEwen: Wenn man Linux auf einer PPC-Karte in einem
Amiga f&auml;hrt, richtig? Wir haben es noch nicht ausprobiert, aber die beiden
Hersteller haben das und sagen, es w&uuml;rde laufen.

F: (nicht zu verstehen)
McEwen: Nicht mit dem ersten Build, nein. Ein Teil des Problems sind die
Tools, die Tools die man braucht, um es zu benutzen. Wir haben im Moment
zwei Firmen, die daran arbeiten, eine IDE speziell f&uuml;r uns herzustellen, so
da&szlig; dies in Zukunft nicht mehr n&ouml;tig sein wird. Es ist noch nicht alles
hier drin (SDK), wir wissen das, und manche Dinge werden sich sicher noch
&auml;ndern. Allerdings fanden wir es wichtig genug, das die Leute lernen, in VP
zu programmieren und einige &Auml;nderungen. Chris Hinsley, der das hier
entworfen hat, ist, wie Ihr wi&szlig;t, jemand aus der Amiga-Spieleszene; und ich
denke, Ihr werdet genau wie die meisten anderen, die damit herumgespielt
haben, herausfinden, das es in vielerlei Hinsicht sehr gro&szlig;e &Auml;hnlichkeiten
damit hat, wie wir heute programmieren. Also wird es eine sehr schnelle
Lernkurve sein, aber es wird eine Lernkurve geben. Wir wollen es unter die
Leute bringen, damit sie anfangen k&ouml;nnen, damit zu arbeiten, es zu
benutzen, mit dem Programmieren einiger Anwendungen anfangen. Sich damit
bekanntmachen k&ouml;nnen, so da&szlig; wenn die anderen Teile hinzukommen, man in der
Lage ist, sehr viel schneller zu reagieren.

F: (schlecht zu verstehen, eine weitere Frage zur Kompatibilit&auml;t mit alten
Anwendungen)
McEwen: Wir haben in der Tat schon einen lauff&auml;higen Emulator. Er ist nicht
in diesem Build, weil wir noch Optimierungen vornehmen. Tats&auml;chlich
untersuchen wir auch eine Hardware-L&ouml;sung hierf&uuml;r.

F: Kann das gesammte SDK auf einem Amiga PPC genutzt werden?
McEwen: Neineinein. Was hier drin ist, ist gemacht, um mit Red Hat oder
Corel auf einer x86 Plattform zu laufen, OK? Wenn es vollst&auml;ndig ist, und
man ein ausf&uuml;hrbares OS laufen hat, ist alles fein, es wird laufen.
Nochmal, wir haben es bisher noch nicht ausprobiert, laut einiger
Dritthersteller kann es auf einem PowerPC-Beschleuniger in einem Amiga
laufen, solange Linux vorhanden ist. Wir haben es noch nicht ausprobiert,
also werde ich Euch nicht sagen, ja es geht. Wir wollen es erst testen. Wir
haben zwei Maschinen im Haus mit denen wir es ausprobieren.

F: (schlecht zu verstehen, eine Frage &uuml;ber die zu erwartende Verf&uuml;gbarkeit
von Software f&uuml;r das neue System)
McEwen: Wir haben bereits Zusagen f&uuml;r 131 Anwendungen.
F: Auch Spiele?
McEwen: Die meisten davon sind Spiele. Da gibt es eine sehr gro&szlig;e indische
Firma, die eine Menge mit interaktiven Spielen macht [...] man hat uns
bereits Zusagen gemacht, und sie werden alle ihre Spiele auf den Amiga
bringen. Sie selbst haben 63 Spiele, alles interaktive Multiuser-Spiele
&uuml;ber das Netz.

F: (nicht zu verstehen) McEwen: Oh, oh, die Multiple Screens? Ja, die sind
in Ordnung. Was Ihr heute seht, von einem visuellen Standpunkt aus, k&ouml;nnt
Ihr weiterhin haben, OK? All die mehrfachen Ebenen, etc., das ist alles
drin.

Vielen Dank!
---------------------------------------------------------------------------
Vor dieser Pr&auml;sentation hatten bereits zwei andere stattgefunden. Zur
ersten, um elf Uhr, war ich noch unterwegs auf der Autobahn. Zur zweiten
Pr&auml;sentation war der Vorf&uuml;hrungsraum bereits &uuml;berf&uuml;llt, doch konnte ich
mein Diktierger&auml;t nah genug am Podium deponieren, um noch aufzuschnappen,
da&szlig; Sun das Amiga SDK wohl bei den eigenen Entwicklern als Java-Umgebung
der Wahl bewerben wird.

Martin Baute &lt;solar@baud.de&gt;«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
