<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Elbox pr&auml;sentiert PCI-Interface f&uuml;r A1200 (von Steffen H&auml;user)

»Auf der Neuss-Messe pr&auml;sentierte Elbox ein PCI Interface fuer A1200. 
Meiner Ansicht nach war dies die gro&szlig;e Messe&uuml;berraschung, allerdings waren 
sich viele der Bedeutung dieses neuen Produkts gar nicht im Klaren. Ich 
habe in der Zwischenzeit recherchiert und N&auml;heres herausgefunden (bzw. 
einiges des unten aufgef&uuml;hrtes ist auch schlicht aus dem Pressetext von
Elbox):

- 4 PCI Slots
- Zwischen den Slots: Bis zu 132 MB/sec.
- Zwischen PCI Slot und Rest vom Amiga: 22 MB/sec. (Vergleich: CV/PPC zu
  Cyberstorm PPC Bus bringt 18 MB/sec.)
- Elbox wird Treiber-L&ouml;sungen f&uuml;r Grafikkarten bieten, die auf den Chips

  * VirgeDX 8 MB
  * Voodoo 3 16 MB
  * Voodoo 5 32 MB

  basieren. Dabei hat Elbox bereits nahezu fertiggestellte Picasso 96
  Treiber. Warp3D Treiber f&uuml;r die Karten werden von Hyperion entwickelt.
- Elbox wird sp&auml;ter Treiber fuer weitere Karten (etwa Netzwerkkarten,
  Soundkarten, MPEG Hardware...) anbieten.
- Eine A4000-Version wird nach der Release der A1200-Version auch
  erscheinen

Allein ein Voodoo 3 besitzt gewiss die 10fache F&uuml;llrate eines Permedia 2,
wenn nicht sogar mehr. Und die F&uuml;llrate ist derzeit der "Bottleneck" fuer
Amiga-3D-Hardware... das ganze ist eine Revolution... und wenn man weiter
denkt... wenn JETZT Treiber f&uuml;r PCI Karten entwickelt wird, werden auch 
k&uuml;nftige PCI Systeme wie G3-Turbokarten oder der Boxer hiervon profitieren.

Steffen H&auml;user &lt;magicsn@birdland.es.bawue.de&gt;«


Fazit:

Das h&ouml;rt sich alles sehr gut an. Nur gebe ich zu bedenken, dass bislang 
jedes Amiga-PCI-Projekt an der Realisierung gescheitert ist, und zumindest 
ich bef&uuml;rchte, dass sich das bei der Elbox-Entwicklung genauso verhalten 
wird.
Zudem stellt sich f&uuml;r mich die Frage, welchen Sinn das Projekt angesichts 
der ansonsten veralteten Amiga-Hardware &uuml;berhaupt macht. Anstatt sich eine 
G3-Erweiterung und die PCI-Br&uuml;cke (sofern beides &uuml;berhaupt erscheint) zu 
kaufen, werden sich viele Anwender zweimal &uuml;berlegen, ob sie sich nicht 
lieber gleich - zu einem m&ouml;glicherweise sogar niedrigeren Preis - einen 
komplett neuen Rechner f&uuml;r das AmigaNG-Betriebssystem oder sogar direkt den 
f&uuml;r Ende des Jahres angek&uuml;ndigten »Amiga One« zulegen sollten.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
