<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Amiga PowerPC
-------------

1. AmiJoe kommt wahrscheinlich erst 2001 / A2/3/4000-Versionen gestrichen

Metabox hat sich nach Monaten der Ungewissheit endlich &ouml;ffentlich zur 
Zukunft der angek&uuml;ndigten Amiga-G3-PPC-Karten ge&auml;u&szlig;ert. Demnach sind 
momentan keine Versionen mehr f&uuml;r A2000/3000/4000-Rechner, sondern nur noch 
die A1200-Variante geplant. Wahrscheinlich werde das Produkt im 1. Quartal 
2001 erscheinen.
Der folgende Fragenkatalog ist auf http://212.96.44.74/de/amiga/news.html 
nachzulesen:

»Seit einigen Wochen h&ouml;rt man ja nicht sehr viel vom vielversprechenden
AmiJoe-Projekt. Hat man die Entwicklung bereits eingestellt?

Das AmiJoe Projekt ist - anderslautenden Ger&uuml;chten zum trotz - nicht
eingestellt worden. Die Entwicklungsabteilung CPU Upgrades hat nunmal 
einfach auch andere Projekte mit h&ouml;heren Priorit&auml;ten.


Vor wenigen Wochen kam die Information von ihrer Firma, die Karte w&auml;re 
bereits fertig, es fehle nur noch die 68K-Emulation. Wie weit ist man? 
Arbeitet man jetzt mit Haage & Partner zusammen?

Ja, wir dachten tats&auml;chlich vor einigen Wochen, da&szlig; die Hardware nun laufen
w&uuml;rden. Also haben wir mit Haage und Partner intensiv &uuml;ber die Portierung
von WarpOS auf die AmiJoe konferiert und ein Agreement geschlossen. Im Zuge 
der weiteren Vorbereitung ist dann jedoch ein schwerwiegender Fehler 
aufgetreten. Der Memory/PCI Bridge Controller der AmiJoe 1200 enth&auml;lt einen 
BUG. Pr&auml;zisiert bedeutet dies, dam man im Moment nicht das SDRAM der AmiJoe 
1200, sondern nur das langsame Amiga-Ram nutzen kann. Erst wenn dieser 
Fehler behoben ist, kann die AmiJoe in Produktion gehen.

Da dieser BUG nicht gerade ein unwichtiges Bestandteil der AmiJoe in seiner 
Funktion einschr&auml;nkt, haben wir uns entschlossen die AmiJoe erst einmal 
zur&uuml;ckzuziehen und den Memory/PCI Bridge Controller einem Redesign zu 
unterziehen.

Den oft aufkommenden Fragen nach Karten f&uuml;r die Amiga 2000/3000/4000 Serien 
mu&szlig; ich erst einmal eine Absage erteilen. Wir haben uns dazu entschlossen - 
und haben auch nur dies bekanntgegeben - eine G3 Karte f&uuml;r den Amiga 1200 
zu entwickeln. [Letzteres entspricht nicht der Wahrheit. Metabox hat - 
nicht nur einmal - AmiJoe-Versionen f&uuml;r den A2000, 3000 und 4000 
angek&uuml;ndigt, teilweise sogar mit genaueren Spezifikationen, Lieferterminen 
und Preisen; Anm. d. Red.]


Wann ist die Karte reif f&uuml;r den Amiga-Markt? Wie fix ist dieser Release-
Termin?

Um nicht dem Fehler anderer bekannter Firmen nachzukommen anzuk&uuml;ndigen, 
Geld in Empfang zu nehmen und dann dar&uuml;ber zu entscheiden, ob das Produkt 
&uuml;berhaupt entwickelt wird um sich dann vom Markt zu verabschieden, m&ouml;chte 
ich nur Produkte announcen, die auch tats&auml;chlich verf&uuml;gbar werden. Im Falle 
der AmiJoe hei&szlig;t das, da&szlig; ich mit einer Verf&uuml;gbarkeit der Karte fr&uuml;hestens
zum Ende des Jahres, eher im 1. Quartal 2001 rechne. Dies bedeutet 
nat&uuml;rlich, da&szlig; die Amiga Gemeinde weitere 6 Monate mindestens auf die 
AmiJoe warten mu&szlig;. Jedoch ist das Warte auf ein ausgereiftes Produkt besser 
als die Nutzung eines Beta-Produktes.


K&ouml;nnen Sie uns die Spezifikationen mitteilen?

Spezifikationen der AmiJoe 1200

Unterst&uuml;tzter Amiga: A1200
CPU: PowerPCTM G3 ab 300Mhz
Cache: 512kb oder 1mb Back Side Cache mit 1/2 des CPU Taktes
RAM: max 128mb SDRAM durch ein SODIMM-Steckplatz
HD: 1 IDE Anschlu&szlig; (nicht Master/Slave f&auml;hig)
PCI: kein direkter PCI SLOT (*)


(*) die Spezifikation des PCI-Interconnects werden von uns an interessierte 
Entwickler distributiert, damit jene eine PCI Backplane entwickeln k&ouml;nnen.
Grafikkarte: geplant, aber noch nicht entwickelt; die Grafikkarte belegt 
den PCI Interconnect, so da&szlig; keine Backplane genutzt werden kann


Wie teuer sind die einzelnen Karten?

&Uuml;ber genaue Preise kann man im Moment noch nichts sagen. Die AmiJoe 1200 
mit 300Mhz wird aber deutlich unter 1.000 DM liegen. Bei Verf&uuml;gbarkeit der 
Karten wird der genaue Preis bekanntgegeben.«

(Quelle: Metabox)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
