<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Der Commodore-Untergang aus meiner Sicht - Teil 9 (von Rainer Benda)

»Und dann hatten wir noch ein Gastspiel...
==========================================

...bei Amiga Technologies. Irgendwann 1995 rief mich Doc Peter Kittel an 
und fragte, ob ich nicht Lust h&auml;tte, f&uuml;r Amiga Tech. zu arbeiten.

Zuerst wollte ich nicht, da ich ja meinen eigenen Laden hatte (immer noch 
habe, wenn auch nur noch als Pseudo-Hobby) und dennoch war es recht 
reizvoll dem Gedanken nachzugehen, unter der Regie von Escom eine 
Wiederbelebung des Amiga's mitzuerleben.

Peter teilte mir mit, Petro sei auch an Board. Das machte mir zuerst wenig
Sorgen, weil Escom-Chef Schmitt der Gesch&auml;ftsf&uuml;hrer von Amiga Tech. war 
bzw. werden wollte, doch das &auml;nderte sich kurz nach meinem Eintritt. Er 
vergab den Posten an Petro, wor&uuml;ber auch Peter nicht sehr gl&uuml;cklich war. 
Der Grund lag darin, da&szlig; Schmitt in seinem PC-Business voll ausgelastet war 
und nicht noch einen Job &uuml;bernehmen wollte.

In den ersten 2 Wochen (es waren insgesamt nur 5 :-) ) kam ich mir bei 
Amiga Tech. recht &uuml;berfl&uuml;ssig vor. Wir hatten keine Arbeitspl&auml;tze, keine 
eigenen B&uuml;ros und Peter und ich teilten uns ein R&auml;umchen mit zwei Escom-
Mitarbeitern, die unseren Job...sagen wir "bel&auml;chelten".....nach diesen 
zwei Wochen erfuhren wir, da&szlig; wir nach Bensheim umziehen w&uuml;rden, in eigene 
B&uuml;ro-R&auml;ume. Die Freude war gro&szlig;, endlich (so dachte ich) k&ouml;nnte ich meinem 
Job nachgehen....und der umfasste eigentlich die gleichen Aufgaben wie zu 
C= Zeiten (Support, Aufbau von Support-Medien wie Internet, Mailbox etc. - 
also wieder Anlaufstation f&uuml;r Probleme aller Art um den Amiga herum).

Ich wurde allerdings recht schnell auf den Boden der Realit&auml;t zur&uuml;ckgeholt, 
denn wir mussten unsere Arbeitsger&auml;te selbst mitbringen, denn es gab nichts 
seitens Amiga Tech., nichtmal ausreichend Telefonleitungen etc. - die Sache 
mit den mitgebrachten Arbeitsmitteln eskalierte dann am Ende soweit (Petro
dachte/denkt vielleicht immer noch, da&szlig; ich es aus Rache getan habe - zu 
unrecht), da&szlig; wir via Anw&auml;lte verkehrten und ich am Ende noch zu einen der 
Gl&auml;ubigern geh&ouml;rte, der auch an der Amiga Tech. Gl&auml;ubigerversammlung mit 
seines Zeichens Konkursverwalter (Hembach) teilnahm. 

Mein "Job" war es nun, mich um Kaffeemaschinen, die Organisation eines 
"Firmenstempels" zu k&uuml;mmern, sowie um die Installation der 
Telefonanschl&uuml;sse u.v.m.

Ich habe das zuerst noch als "normal" angesehen, schlie&szlig;lich befand sich 
Amiga Tech. im Aufbau.

Vielleicht sollte ich hier schon meine Ansicht zu Petro kundtun, da ich 
"ihn" nicht an das Ende des Kapitels h&auml;ngen kann, ohne die Zusammenh&auml;nge 
aus den Augen zu verlieren.

Ich (und Peter) haben unsere Erfahrungen mit Petro bereits bei C= gemacht 
und wir waren nicht gerade gl&uuml;cklich dar&uuml;ber, da&szlig; er nun unser Chef war. 
Peter war sich immer klar, da&szlig; es zu Problemen kommen w&uuml;rde und ich hatte 
gehofft, meinen Job in Ruhe tun zu d&uuml;rfen und somit einer Konfrontation aus 
dem Weg zu gehen.

Ich habe zwar nach Jahren (als ich Petro um 1998 mal in Langen besuchte) 
eine Art "Frieden" geschlossen und denke mir nun mehr als ich schreibe (und 
eigentlich m&uuml;sste ich es ihm nachmachen, ein Buch zu schreiben und evtl. 
noch ein paar Mark mitzunehmen), doch ich habe nicht das Bed&uuml;rfnis nach 
einem Buch und jeder sollte auch "Informationen" bekommen, ohne daraus auch 
noch ein Gesch&auml;ft machen zu m&uuml;ssen....aber jeder wie er meint.

Insgesamt ist Petro ein Typ Mensch, mit dem ich auf Dauer nicht einen Raum 
teilen kann....weil er mir zu cholerisch ist. Einmal springt er einem mit 
dem nackten Hintern ins Gesicht, 5 Minuten sp&auml;ter ist alles wieder 
vergessen (bei ihm). Ich bin auch nicht der Ansicht, da&szlig; er den Amiga wegen 
des Amigas "gerettet" hat, er hat die Gunst der Stunde genutzt (das ist ihm 
sicherlich hoch anzurechnen), jemandem ein Produkt schmackhaft zu machen. 
Das ist ihm bei Escom und Gateway gelungen, auch wenn unterm Strich nichts 
f&uuml;r die User dabei herum kam.
 
Als "Chef" eines Unternehmens h&auml;tte ich an seiner Stelle einen anderen 
Einsatz gezeigt, als er es bis heute getan hat. Manche Entscheidung h&auml;tte 
(es bleibt leider bei "h&auml;tte") durch ihn stattfinden m&uuml;ssen, andernfalls 
sehe ich keine Verwendung f&uuml;r einen Gesch&auml;ftsf&uuml;hrer, wenn er nichts zu 
f&uuml;hren hat. Sicherlich hat Petro in diesem Bereich auch andere Erfahrungen 
gemacht, allerdings w&auml;re ich an einer Stelle wo ich nicht mehr weiterkomme, 
aus dem Unternehmen ausgeschieden.

Die "Gemeinde" und das Produkt Amiga alleine kann es nicht gewesen sein. 
Bei allem Respekt gegen&uuml;ber Petro und auch auf meine Frage, die ich ihm in 
Langen gestellt habe, warum er es &uuml;berhaupt noch macht (seine Antwort war, 
weil er dem Amiga treu bleiben will), kann ich bei aller Vernunft nicht 
nachvollziehen.

Ich pers&ouml;nlich (!) denke eher daran, da&szlig; Petro auch nicht so sehr viele 
M&ouml;glichkeiten hat(te), im Arbeitsmarkt eine Position zu finden, bei der er 
Herr der Dinge ist und zugleich "tun und lassen kann was er will".

An dieser Stelle denken vielleicht einige (Petro vielleicht auch), es w&auml;re
besser sich auf "Amiga" zu konzentrieren und mit vereinten Kr&auml;ften ans Werk 
zu gehen, allerdings kann ich f&uuml;r mich pers&ouml;nlich nur zu dem Ergebnis 
kommen, da&szlig; ich meinen Teil in dieser Geschichte mehr als einmal 
beigetragen habe, ohne da&szlig; es sich in irgendeiner Weise ausgezahlt h&auml;tte. 
Weder f&uuml;r mich, noch f&uuml;r den Amiga. Von daher gehen mir Spr&uuml;che wie "Amiga 
Community" und "Zusammenhalt" etc., die in mir mehr das Gef&uuml;hl eines 
Zusammenhalts einer Sekte geben, an einem gewissen K&ouml;rperteil vorbei. Zu 
Zeiten, als ich "dabei" war, gab es schon keine M&ouml;glichkeiten, irgendwas am 
Geschehen zu ver&auml;ndern, warum sollte das gerade jetzt der Fall sein ?

Nicht aufzugeben ist eine Sache, aber sich f&uuml;r dumm verkaufen zu lassen, 
etwas anderes.

Zur&uuml;ck zu Amiga Tech. - wir bekamen zuerst personelle Verst&auml;rkung durch 
eine Kollegin seitens Escom, die f&uuml;r uns und vor allem Petro 
Sekretariatsaufgaben &uuml;bernahm. Es lief bis dahin alles recht z&auml;h und wenn 
wir uns mal trauten vor 21.00 Uhr den Laden zu verlassen, gab es schon 
Spr&uuml;che, ob wir mittags schon Feierabend machen.....fand ich wenig witzig.

Zu meinem Bedauern wiederholten sich viele Ereignisse, wie ich sie bereits 
von C= kannte. Den A1200 sah man damals "immer noch" als konkurenzlos zu 
den PCs an. Die Kombination A1200 und Scala versetzte gewisse Personen in 
sabbernde Zust&auml;nde. Ich konnte dar&uuml;ber nur mit dem Kopf sch&uuml;tteln, ebenso 
Doc Peter.«

Fortsetzung folgt...

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
