<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sekalaiset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Sekalaiset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Katsaus menneeseen ja tulevaan</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Tomi Jaskari, 2.6.2002, Länsimäki</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hei,<br>
							<br>
							
							
							aloitan tunnustuksella; en ole k&auml;ytt&auml;nyt Amigaani t&auml;n&auml; vuonna kertaakaan. Mutta henki el&auml;&auml;, muistan hyvin ajan jolloin Amiga oli ainokaiseni enk&auml; tavallista PC:t&auml; voinut siet&auml;&auml;. T&auml;st&auml; vanhasta ajasta kouriintuntuvimpana muistutuksena on monitori, jonka n&auml;yt&ouml;lt&auml; t&auml;t&auml; teksti&auml; katselen. N&auml;pp&auml;imist&ouml;n&auml; on IBM, kaiuttimissa lukee JBL Pro ja vieress&auml; on tekstip&auml;&auml;te, jossa digital VT420. ATK-p&ouml;yt&auml;ni alapuolella on kaksi PC:t&auml;. Isommassa kotelossa on MSI:n emolevy, josta l&ouml;ytyy 6 USB v1.1 sarjaporttia ja kotelon takana on 4 diagnostista ledi&auml;, jotka vilkuttavat koneen s&auml;hk&ouml;pistokkeen kytketty&auml;ni hetken punaista kunnes vihre&auml; voittaa.<br>
							<br>
							
							
							K&auml;ytt&ouml;j&auml;rjestelm&auml; on Windows XP Professional, joka juuri &auml;sken kaatui ensimm&auml;ist&auml; kertaa yritt&auml;ess&auml;ni kytke&auml; koneen ISDN:n kautta Internettiin. Kaatuminen tapahtui kuitenkin hyvin hallitusti: lyhyt sininen v&auml;l&auml;hdys, jonka j&auml;lkeen kone boottasi, tarkisti kiintolevyni er&auml;&auml;n FAT32 osion ja ilmoitti sitten, ett&auml; j&auml;rjestelm&auml; on toipunut vakavasta virheest&auml;. Ja antoi hyvin varovasti lis&auml;tietoja, mit&auml; oikein tapahtui. Voi vain arvata, oliko kyseess&auml; &auml;kspeehen hyvin syv&auml;lle piiloutunut matonen vai auringonpilkkujen runsaus ja kiintolevy&auml; h&auml;irinnyt kosminen s&auml;teily. Olin juuri etsinyt kiintolevyn asiakirjoista er&auml;st&auml; merkkijonoa ja l&ouml;yt&auml;nyt sen 40 tiedostosta. Haku oli tapahtunut hakuvelhon avustuksella, joka koko haun ajan py&ouml;ritti taikapalloa k&auml;siss&auml;&auml;n. Sen j&auml;lkeen avasin suurimman l&ouml;ytyneist&auml; tiedostoista eli &quot;Saku.html&quot;-nimisen tiedoston. Se tietenkin avautui Internet Exploreriin, ja k&auml;ytt&ouml;liittym&auml; hidastui olennaisesti. Pian kone sitten kaatuikin. ;-)<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Saku.html sis&auml;lsi tuoreimmat Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n hallitusta koskeneet viestit eli l&auml;hinn&auml; Janne Sir&eacute;nin ansiokasta puhetta ja minun selitysyrityksi&auml;ni, ett&auml; miksi t&auml;rke&auml;t asiat ovat hoitamatta. Mutta t&auml;m&auml; on historiaa, enk&auml; min&auml; en&auml;&auml; vastaa yhdistyksen taloudenpidosta. Taloudellista asioista vastaaminen ei todellakaan ole minun alaani; siit&auml; on osoituksena juuri t&auml;m&auml;n hetkinenkin taloudellinen tilanteeni. Tili on pahasti miinuksella, palkkap&auml;iv&auml;&auml;n on kaksi viikkoa ja velkaa on ainakin kolmelle yst&auml;v&auml;lle. Onneksi on edes hyvi&auml; ty&ouml;kavereita ja entisi&auml; pomoja, joilta tarvittaessa voi vipata. Rahahan se on, mik&auml; t&auml;t&auml; maailmaa suureksi osaksi liikuttaa. Muistetaan kuitenkin, ett&auml; niin sanotulla kuluttajalla on se suurin valta omien rahojensa suhteen. Lompakon voi visusti j&auml;tt&auml;&auml; avaamatta ja &auml;&auml;nest&auml;&auml; kest&auml;v&auml;mm&auml;n kulutuksen puolesta. Esimerkiksi tietokoneen p&auml;ivitt&auml;minen t&auml;ysin uudella joka ikinen vuosi ei liene &auml;&auml;ni ymp&auml;rist&ouml;n puolesta. Niin paljon kemikaaleja ja uusiutumattomia raaka-ainevaroja uuden koneen valmistaminen vaatii! Ty&ouml;paikallani on juuri siirt&auml;m&auml;ss&auml; kierr&auml;tykseen vanhoja 486DX- ja Pentium I -koneita, jotka parhaimmillaan ovat palvelleet yli 5 vuotta ja ker&auml;nneet sisuksiinsa erikokoisia p&ouml;lyn&auml;ytteit&auml;.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Mennyt ja tuleva kohtaavat juuri t&auml;ss&auml; hetkess&auml;.. Huomaan kuinka vaikeata minun on keskitty&auml; vain ja ainoastaan k&auml;sill&auml; olevaan teht&auml;v&auml;&auml;n. Mutta keskittymiskyky onkin sellainen taito, mit&auml; kiireinen arkip&auml;iv&auml; mielell&auml;&auml;n koettelee. Asioita ei mitenk&auml;&auml;n tee helpommaksi k&auml;nnyk&ouml;iden jatkuva jokeltelu ja ty&ouml;p&auml;ivien lyhyys ja rajallisuus. Ainoastaan j&auml;rjestelm&auml;llisell&auml; asioiden rakentamisella on mahdollista saada aikaan Isoja asioita! IT-maailmassa t&auml;m&auml;n hetken isoja asioita lienev&auml;t ainakin seuraavat: Linux, Java, MS-NET, GPRS, UMTS, BlueTooth, IPv6, XML-tekniikat. Osa toistensa pahimpia kilpailijoita, osa parhaimpia liittolaisia ja suurin osa kuitenkin vain yksi tapa toteuttaa asiat lukemattomien mahdollisten tapojen joukosta. Erittelen nyt lyhyesti n&auml;kemykseni n&auml;ist&auml; tekniikoista ja omistan kullekin kappaleen.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Linus Torvalds ja lukuisat muut aktiiviset avoimen ohjelmoinnin kannattajat ovat luoneet meille vaihtoehtoisen k&auml;ytt&ouml;j&auml;rjestelm&auml;n. Microsoft Windows lisenssin hyv&auml;ksyminen ei en&auml;&auml; ole v&auml;ltt&auml;m&auml;t&ouml;nt&auml; voidaksesi ty&ouml;skennell&auml; PC:n graafisella ty&ouml;p&ouml;yd&auml;ll&auml;. Linux on silti viel&auml; enemm&auml;n IT-ammattilaisten ja j&auml;reiden palvelinkoneiden k&auml;ytt&ouml;j&auml;rjestelm&auml; kuin Matti Meik&auml;l&auml;isen henkil&ouml;kohtainen ty&ouml;kalu. Valtaosa ihmisist&auml; kokee tietokoneen ty&ouml;kaluna, jonka toteutustekniikasta harva mit&auml;&auml;n ymm&auml;rt&auml;&auml; tai kykenee sen vikoja analysoimaan ja korjaamaan. Mutta he, jotka pystyv&auml;t Linuxin kerneliin perehtym&auml;&auml;n, ovat silti olemassa ja heid&auml;n lukum&auml;&auml;r&auml;ns&auml; todenn&auml;k&ouml;isesti kuitenkin pikemminkin kasvaa kuin v&auml;henee. Seurauksena on, ett&auml; Linuxista kehittyy yh&auml; luotettavampi ja parempi ymp&auml;rist&ouml;. Kirjakaupasta on saatavilla esimerkiksi suomenkielinen IT Linux 2002, joka pohjautuu Red Hat 7.2 jakeluun. Siin&auml; on siis kaikki Red Hatin uudet ominaisuudet ja lis&auml;ksi:</font>
						<ul>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Red Hatin julkaisemat korjaukset, mm. ydin 2.4.9 ja glibc.</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">CD-ROM-multiboot-ominaisuus. Vastaavaa ei ole yhdess&auml;k&auml;&auml;n toisessa Linuxin levitysversiossa.</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Parted-k&auml;ynnistyslevyke, jolla osioiden kokoja voidaan muuttaa tietoja menett&auml;m&auml;tt&auml;</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">OpenOffice beta</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Linuxin ja Windowsin helppo asennus samaan koneeseen</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ext3-tiedostoj&auml;rjestelm&auml;, jossa on journalointi. Tiedostoj&auml;rjestelm&auml;n tarkistus sujuu nyt tyypillisesti alle sekunnissa eik&auml; tietoja huku yht&auml; herk&auml;sti edes s&auml;hk&ouml;katkojen tai muiden vakavien virhetilanteiden yhteydess&auml;. P&auml;ivitt&auml;ess&auml; vanhat ext2-osiot voidaan muuttaa ext3-osioiksi asennuksen yhteydess&auml;.</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Palomuurin konfigurointi asennuksen yhteydess&auml;.</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">KDE 2.2 (&euro;-symbolin tuki)</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Gnome 1.4</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">XFree86 4.1.0</font>
						</ul>
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Laitteistosuositus on </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Intel Pentium tai uudempi, </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">900 Mt vapaata kiintolevytilaa</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">, 64 Mt keskusmuistia ja </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">CD-ROM-asema. </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">IT Linux tukee my&ouml;s esimerkiksi useimpia n&auml;yt&ouml;nohjaimia, tulostimia, verkkokortteja, Ultra DMA -kiintolevyj&auml;, kuvanlukijoita ja modeemeja. </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">T&auml;ydellinen yhteensopivuuslista ja muita lis&auml;tietoja osoitteesta <a href="http://www.itpress.fi/itlinux2002/" target="_blank">www.itpress.fi/itlinux2002/</a> ja </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">osoitteesta <a href="http://www.raimokoski.com" target="_blank">www.raimokoski.com</a> l&ouml;ytyy esimerkiksi artikkeli &quot;Linuxin yleisimm&auml;t k&auml;ytt&ouml;kohteet&quot;.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hypertekstin idea oli olemassa paljon aikaisemmin kuin nykyinen Internet l&auml;hti syntym&auml;&auml;n Yhdysvaltojen ARPANETin pioneerity&ouml;n pohjalta. World Wide Web rakentuu muutaman standardoidun tekniikan p&auml;&auml;lle. N&auml;it&auml; ovat HTTP-protokolla, joka m&auml;&auml;rittelee miten selainohjelma ja esimerkiksi Apache WWW-palvelin v&auml;litt&auml;v&auml;t tietoja. Tiedonsiirron pullonkauloja paikataan erilaisilla v&auml;lityspalvelinratkaisuilla eli proxyilla. Kehitys t&auml;ll&auml; alalla on hyvin kiivasta. XML eli Extended Markup Language on HTML:n kehittyneempi muoto, jonka varaan on mahdollista rakentaa uusia tiedonsiirtotapoja. Kirja &quot;Inside Java ja XML&quot;  (lue <a href="http://www.itpress.fi/vanhat/doc/kirjat/javaxmlinside.htm" target="_blank">esittely</a>) kertonee alustariippumattomasta ohjelmoinnista ainakin ensi h&auml;t&auml;&auml;n riitt&auml;v&auml;sti. Javan ideahan on Sun Microsystemsin kehitt&auml;m&auml; ja perustuu tulkittuun tavukoodiin, jonka tietoturvaan ja stardardimaisuuteen on todella paneuduttu. Javan varaan on rakennettu lukuisia luokkakirjastoja, joita IT-alan ohjelmointitalot hy&ouml;dyntyv&auml;t liiketoiminnan j&auml;rjestelmi&auml; rakentaessaan. <a href="http://java.sun.com/j2se/1.4/download.html " target="_blank">Sunin sivuilta</a> l&ouml;ytyv&auml;t Javan SDK- ja JRE-arkistot eri alustoille. SDK on ohjelmistokehitt&auml;j&auml;n paketti ja JRE on ajoaikainen ymp&auml;rist&ouml;. Jos olet todella vannoutunut Bill Gates -fani ja Windows(TM)-kehitt&auml;j&auml; niin arvokkain ty&ouml;kalu lienee Visual Studio J++ Microsoftilta. Kyseeess&auml; on eritt&auml;in hyvin integroitu tuote, jonka kanssa on mahdollista tuottaa my&ouml;s hyvin alustariippuvaista (mutta nopeaa) koodia!<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">MS-NET? Eli Microsoftin NET-teknologiaperhe. P&ouml;yt&auml;tietokoneiden markkinat eiv&auml;t en&auml;&auml; kasva ja konepakettien hinnan yh&auml; halventuessa Microsoftin pit&auml;&auml; etsi&auml; uudia markkinoita ja ideoita. Windows 2000/XP-ty&ouml;asemat ja -palvelimet, ActiveX-komponentit ja COM+ -konsepti ovat niit&auml; voimavaroja ja resursseja, joiden varassa kaupallisten ohjelmistovalmistajien tuotekehittely jatkuu. <a href="http://msdn.microsoft.com/default.asp" target="_blank">MSDN-sivusto</a> kertoo lis&auml;&auml;. Tosiasia on se, ett&auml; monet suuryritykset jatkavat Microsoftin k&auml;ytt&ouml;j&auml;rjestelmien ja toimisto-ohjelmien varassa, eik&auml; n&auml;k&ouml;piiriss&auml; ole nopeata valtatasapainon muutosta. Jos &quot;alhaisen&quot; tason ohjelmointi ja tekniikat Windowsissa kiinnostavat tai kummastuttavat sinua, niin k&auml;y ihmeess&auml; k&auml;siksi Microsoft Developer Networkin artikkeleihin, esimerkiksi <a href="http://msdn.microsoft.com/msdnmag/issues/02/06/debug/debug.asp" target="_blank">t&auml;h&auml;n</a> - Interet Explorer selaimella varustautuneena. Toki muillakin selaimilla saa jotakin n&auml;kyviin, vaikka ainakaan Opera 6.01 ei suoriutunut sivun mutkikkaasta Javascriptist&auml; t&auml;ysin kunniallisesti, ehk&auml; ongelma onkin kyseisen sivun ohjelmoinnissa tai sen tuottaneessa Javascript-editorissa?<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">GPRS eli matkapuhelinten ja k&auml;mmentietokoneiden tietoliikennett&auml; nopeuttava yleinen pakettipohjainen radiol&auml;hetystapa. Vapaasti suomentanut min&auml;. :-) Etsin t&auml;ss&auml; juuri netist&auml; tietol&auml;hteit&auml;, jotka hieman konkretisoisivat omaa hataraa k&auml;sityst&auml;ni t&auml;st&auml; aihealueesta. Olen kyll&auml; lukenut Martti H&auml;iki&ouml;n kirjoittaman ja EDITAn julkaiseman kirjan &quot;ALKUR&Auml;J&Auml;HDYS: Radiolinja ja Suomen GSM-matkapuhelintoiminta 1988-1998&quot;, mutta en silti ole mik&auml;&auml;n langattoman tietoliikenteen asiantuntija, ja GPRS on vasta nousussa oleva teknologia. Ja UMTS odottaa nurkan takana. Radiolinja varmennepalveluineen on uusien s&auml;hk&ouml;isten palveluiden edell&auml;k&auml;vij&auml;, kuten se oli edell&auml;k&auml;vij&auml; Suomen GSM-matkapuhelinverkkoa ja yleist&auml; telealan lupapolitiikkaa luotaessa.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Lis&auml;&auml; telekommunikaatioalan historiasta voi lukea artikkelista <a href="http://www.info.uta.fi/winsoc/luento/tele.htm" target="_blank">Telekommunikaatioinfrastruktuuri ja internet</a>. T&auml;m&auml;n kappaleen tietoja tarkistaessani totesin, ett&auml; ainakin Ihmemaa palauttaa hakutuloksissaan vanhentuneita linkkej&auml;. Ajanmukainen osoite voisi olla vaikka t&auml;m&auml;... tai sitten t&auml;t&auml; lukiessasi osoite on taas muuttunut! General Packet Radio Service kymmenkertaistaa nopeuden 9,6 kbit/s nopeuteen 115 kbit/s, kertoo <a href="http://www.ericsson.fi/technology/GPRS.shtml" target="_blank">Ericsson</a>. Nokian vastaava <a href="http://www.nokia.fi/puhelimet/teknologiat/gprs/" target="_blank">termin m&auml;&auml;rittely</a> kertoo asiasta hieman laveammin ja samalla ep&auml;tarkemmin, mutta on silti informaatioarvoltaan parempi kuin Sony-Ericssonin sivu. Minulla on muuten Nokian 6310 ja ulkona sataa. Siin&auml; on BlueTooth ja WAP. WAP-selausta olen jopa k&auml;ytt&auml;nytkin, mutta mit&auml;&auml;n todellista hy&ouml;ty&auml; t&auml;st&auml; ominaisuudesta en viel&auml; ole saanut.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">BlueTooth on langaton teknologia, joka toimii l&auml;hinn&auml; sis&auml;tiloissa pienell&auml;, noin 10 metrin toimintas&auml;teell&auml;. Puhelimessani siis on kyseinen valmius, mutta koska minulla ei ole viel&auml; ollut taloudellista mahdollisuutta hankkia omaa kannettavaa ja olen tuominnut p&ouml;yt&auml;tietokoneeseen hankittavan BlueTooth-palikan turhaksi hankinnaksi, minulla ei viel&auml; ole k&auml;yt&auml;nn&ouml;n kokemuksia t&auml;st&auml; teknologiasta. Lupaukset lis&auml;&auml;ntyneest&auml; mukavuudesta ja k&auml;yt&ouml;n helppoudesta ovat suuria ja kunhan l&ouml;yd&auml;n lis&auml;&auml; t&ouml;it&auml; ja sit&auml; my&ouml;ten taloudellisia voimavaroja p&auml;&auml;sen varmasti kokeilemaan k&auml;yt&auml;nn&ouml;ss&auml;. Tarvinnen my&ouml;s uuden SIM-kortin, jossa on WIM-moduli k&auml;ytt&auml;&auml;kseni p&auml;&auml;tett&auml;ni langattomana lompakkona. Toivottavasti voin raportoida kokemuksistani seuraavalla Sakulla - tulevaisuudestahan ei oikeasti voi olla ollenkaan varma!<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Siihen asti Voikaa Erinomaisesti!</font></p>
					</td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Sekalaiset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;</font><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;</td>
				</tr>
			</table>
		</center>
	</body>

</html>