<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sekalaiset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Sekalaiset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Pieni kurkistus VP-assemblyyn</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Markus&nbsp;Ketola</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Sakussa ja Saku-foorumilla on oltu varsin hiljaa Amiga SDK-ohjelmoinnista, joten ajattelin, ett&auml; on aika hieman raottaa verhoa VP-assemblyn takana, ja tehd&auml; pieni katsaus VP-assemblyn kiehtovaan maailmaan. Katsaus on todellakin vain pieni; v&auml;h&auml;ist&auml; virtuaaliprosessorin ja VP-assemblyn ominaisuuksien esittely&auml; painottuen esimerkkilistaukseen. Useiden pienten yksityiskohtien lis&auml;ksi t&auml;ss&auml; artikkelissa ei k&auml;sitell&auml; VP-assemblyn olio-ohjelmointiominaisuuksia, mutta ne ovat kuitenkin v&auml;hint&auml;&auml;nkin maininnan arvoisia ominaisuuksia eli ovatpa ainakin tulleet nyt alussa mainituksi, jolloin niiden olemassaolo sent&auml;&auml;n tulee tiett&auml;v&auml;ksi.</b></font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Mit&auml; on VP-assembly?</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">VP liittyy AmigaDE-maailmaan ja tulee sanoista Virtual Processor, eli VP-assembly on virtuaaliprosessorin symbolista konekielt&auml;. Virtuaaliprosessorille (VP) tehdyt ohjelmat ovat ajettavissa sellaisenaan miss&auml; tahansa ymp&auml;rist&ouml;ss&auml;, miss&auml; Translator-niminen ohjelma hoitaa VP-tavukoodin k&auml;&auml;nt&auml;misen natiiviksi koodiksi. K&auml;yt&auml;nn&ouml;ss&auml; Translator ei n&auml;y k&auml;ytt&auml;j&auml;lle mitenk&auml;&auml;n eli sit&auml; ei itse ajeta kuten esim. Java-tulkki ajetaan. Translator on siis osa k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml;.<br>
							<br>
							Virtuaaliprosessorilla on viidentyyppisi&auml; rekistereit&auml;: 32- ja 64-bittisi&auml; kokonaislukurekistereit&auml;, yksin- ja kaksinkertaisen tarkkuuden liukulukurekistereit&auml; (32- ja 64-bittisi&auml;) ja 32-bittisi&auml; pointterirekistereit&auml;. Rekisterit on nimetty alkukirjaimilla I, L, F, D ja P sek&auml; numero-osalla alkaen nollasta. T&auml;ten esim. I0 on ensimm&auml;inen kokonaislukureisteri ja vastaavasti F0 ensimm&auml;inen yksinkertaisen tarkkuuden liukulukurekisteri. Mielenkiintoista on se, ett&auml; rekistereiden m&auml;&auml;r&auml;&auml; ei ole rajoitettu VP-assemblyss&auml; muutoin kuin pinomuistin m&auml;&auml;r&auml;ll&auml; ja pinomuistin m&auml;&auml;r&auml;n ohjelmoija voi itse asettaa. Ohjelmoija voi lis&auml;ksi antaa rekistereille selv&auml;kielisi&auml; nimi&auml;.</font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Osoitusmuodoista</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ensimm&auml;isen esitelt&auml;v&auml; VP-assemblyn k&auml;sky on CPY. Nimi tulee sanasta copy ja se vastaa Motorolan 68K-assemblyn MOVE-k&auml;sky&auml; vaikkakin osoitusmuodot ovat hieman erilaisia. Kuitenkin l&auml;hdeoperandi tulee ensin ja sitten kohdeoperandi samoin kuin 68K-assemblyss&auml;. K&auml;skyll&auml; siis siirret&auml;&auml;n tavaraa muistiin tai muistista tai rekistereihin tai rekistereist&auml;.<br>
								<br>
								Tarkastellaanpa sitten itse osoitusmuotoja. 68k-assemblyss&auml; MOVE.L 4,D7 laittaisi osoitteen 4 sis&auml;ll&ouml;n D7:&auml;&auml;n, mutta VP-assemblyss&auml; CPY 4,I7 laittaa vakion 4 rekisteriin I7. 68K-assemblyss&auml;h&auml;n MOVE.L #4,D7 laittaisi vakion 4 rekisteriin D7. VP-assemblyss&auml; osoitteen 4 sis&auml;ll&ouml;n saa siirretty&auml; rekisteriin I7 kirjoittamalla CPY [4],I7 eli ep&auml;suora osoitus tehd&auml;&auml;n hakasulkujen avulla. Muut osoitusmuodot saadaan rakennettua helposti. Esim. 68K-assemblyn MOVE.L 4(A4,D7),D4 saa VP-assemblyss&auml; muodon CPY [4+P4+I7],I4.</font></div>
					</td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Makrot</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Makroilla on keskeinen sija VP-assemblyss&auml; ja niit&auml; on kolmenlaisia: Makrok&auml;skyt, korkean tason makrot ja k&auml;&auml;nn&ouml;saikaiset makrot (assembly-time macros). Makrok&auml;skyt soveltuvat hyvin erilaisiin matemaattisiin toimenpiteisiin, ja niit&auml; ovatkin mm. ADD, SUB, DIV ja MUL. Lis&auml;ksi niit&auml; on erilaisiin loogisiin operaatioihin. Esimerkki k&auml;yt&ouml;st&auml;:</font>
							<pre>ADD 5,I2
</pre>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Korkean tason makroilla saadaan lohkorakenteisten ohjelmointikielten - kuten C-kielen - ominaisuuksia VP-assemblyyn. N&auml;it&auml; makroja ovat mm. parit REPEAT ... UNTIL, WHILE ... ENDWHILE, IF ... ENDIF ja FOR ... NEXT. Sek&auml; toki l&ouml;ytyy viel&auml; makroja n&auml;iden rakenteiden kontrolloimiseen: BREAK ja CONTINUE. N&auml;ist&auml; molemmista on my&ouml;s ehdolliset versiot.<br>
								<br>
								Lis&auml;ksi on korkean tason makroja muotoiltuun tekstintulostukseen; n&auml;it&auml; makroja ovat PRINTF, TRACEF ja KTRACE. N&auml;iden lis&auml;ksi on korkean tason makroja mm. tietorakenteiden muistinvaraamiseen.<br>
								<br>
								K&auml;&auml;nn&ouml;saikaiset makrot (toivottavasti k&auml;&auml;nn&ouml;skseni on kelpo) alkavat pisteell&auml; (.) ja n&auml;ill&auml; voi ohjata ohjelman k&auml;&auml;nn&ouml;sprosessia. K&auml;&auml;nn&ouml;saikaisia makroja ovat .IF, .ELSEIF, .ELSE, .ENDIF, .INCLUDE, .ALIGN ja ennen kaikkea .MACRO ja .ENDM mill&auml; parilla voi m&auml;&auml;ritell&auml; omia makroja.</font></div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Esimerkkiohjelma</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ennen esimerkkiohjelmaa muutama sana VP-assembly-ohjelmista. Niit&auml; nimitt&auml;in kutsutaan englanninkielisell&auml; sanalla &quot;tools&quot; (ty&ouml;kalut) ja ne koostuvat ns. <i>entblock</i>eista (t&auml;lle en yrit&auml;k&auml;&auml;n keksi&auml; suomennosta).<br>
								<br>
								Ja sitten esimerkkiohjelmaan. Ohjelma arpoo 7 lukua v&auml;lilt&auml; 0...39 kunnes k&auml;ytt&auml;j&auml;&auml; antaa nollan. Ohjelma ei kuitenkaan ole Lotto-ohjelma, koska ohjelma ei tarkista, onko arvottu numero jo esiintynyt.</font>
							<pre>.include 'tao'

tool 'demo/Saku39/VPEsimerkki',VP,TF_MAIN,8192,0

ent -:-

qcall lib/malloc,(4:p0)

repeat
   cpy 7,i1
   for i1
      qcall lib/rand,(-:i2)
      cpy (i2 % 39)+1,i2
      printf&quot;%d\n&quot;,i2
   next i1

   printf&quot;Arvotaanko uudestaan? (0=Ei, Muut numerot kuin 0=Kylla)\n&quot;
   scanf&quot;%d&quot;,p0
until [p0]=0

qcall lib/free,(p0:-)
qcall lib/exit,(0:-)
ret

toolend
.end
</pre>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Katsotaanpa sitten ohjelmaa tarkemmin.</font>
							<pre>.include 'tao'

tool 'demo/Saku39/VPEsimerkki',VP,TF_MAIN,8192,0

ent -:-
</pre>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ensimm&auml;inen rivi ei kaivanne liiemmin selityst&auml;, mutta sanottakoon, ett&auml; include-tiedostot l&ouml;ytyv&auml;t hakemistosta lang/asm/include ja niist&auml; l&ouml;ytyv&auml;t muun muassa makrom&auml;&auml;rittelyt.<br>
								<br>
								Seuraava rivi onkin mielenkiintoisempi. Kuten t&auml;m&auml;n kappaleen alussa totesin, VP-assembly-ohjelmat ovat ty&ouml;kaluja, engl. tools, ja ohjelmien alusta l&ouml;ytyykin tool-m&auml;&auml;rittely, miss&auml; kerrotaan, mist&auml; ohjelma l&ouml;ytyy ja sitten kerrotaan, mill&auml; kielell&auml; ohjelma on toteutettu (t&auml;ss&auml; VP). Sitten TF_MAIN-m&auml;&auml;reell&auml; on kerrottu, ett&auml; t&auml;m&auml; ty&ouml;kalu on ajettava ohjelma. T&auml;m&auml;n j&auml;lkeen tulee pinomuistin m&auml;&auml;r&auml; ja sitten tulee globaalien muuttujien muistin m&auml;&auml;r&auml;.<br>
								<br>
								ENT-direktiivi aloittaa itse ohjelman. Koska meid&auml;n tapuksessamme kyseess&auml; on p&auml;&auml;ohjelma, ei ENT-direktiivill&auml; ole parametreina mit&auml;&auml;n rekistereit&auml;, joten l&auml;hde- ja output-parametrien paikalla on miinusmerkki.</font>
							<pre>qcall lib/malloc,(4:p0)
</pre>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">T&auml;m&auml; on mielenkiintoinen rivi. C-ohjelmoijat tunnistanevat malloc-kutsun, ja totta tosiaan, se varaa muistia samoin kuin C-ohjelmissa! VP-assemblyyn onkin sis&auml;llytetty kaikki ANSI-C-funktiot sek&auml; osa POSIX-funktioista! QCALL on makro, jolla siis kutsutaan malloc-funktiota. L&auml;hdeparametrina v&auml;litet&auml;&auml;n 4, joka on kokonaislukutyypin (integer) koko tavuina. Output-parametrina v&auml;litet&auml;&auml;n P0, jolloin varaamamme 4 tavua l&ouml;ytyv&auml;t malloc-kutsun j&auml;lkeen osoitteesta, johon P0 osoittaa.</font>
							<pre>repeat
...
until [p0]=0
</pre>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">REPEAT ... UNTIL parissa REPEAT siis aloittaa loppuehtoisen silmukkarakenteen. Silmukkaa toistetaan kunnes UNTIL-osan ehto toteutuu. T&auml;ss&auml; tapauksessa kunnes P0:n osoittaman muistipaikan sis&auml;lt&ouml; on nolla. Menn&auml;&auml;n sitten REPEAT ... UNTIL -rakenteen sis&auml;lle:</font>
							<pre>   cpy 7,i1
   for i1
      qcall lib/rand,(-:i2)
      cpy (i2 % 39)+1,i2
      printf&quot;%d\n&quot;,i2
   next i1
</pre>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">CPY-k&auml;syll&auml; siirret&auml;&auml;n 7 rekisteriin I1. T&auml;m&auml;n j&auml;lkeen aloitetaan FOR-silmukka. Silmukka toistetaan FOR-sanan j&auml;lkeen tulevan rekisterin sis&auml;lt&auml;m&auml;n kokonaisluvun verran. NEXT-osa v&auml;hent&auml;&auml; rekisterin arvoa yhdell&auml;.<br>
								<br>
								Sitten koodissa tulee j&auml;lleen ANSI-C-kutsu. Output-parametrina annetaan rekisteri I2, johon RAND-funktion palauttama arvo laitetaan. T&auml;m&auml;n j&auml;lkeen jaetaan saatu luku 39:ll&auml;, ja jaon jakoj&auml;&auml;nn&ouml;s plus 1 talletetaan rekisteriin I2, jolloin I2:ssa on luku v&auml;lilt&auml; 0...39. PRINTF on korkean tason makro ja toimii samoin kuin C-kielen PRINTF-funktio eli t&auml;ss&auml; tapauksessa tulostaa kokonaislukurekisteriss&auml; I2 olevan arvon sek&auml; lopuksi tekee rivinvaihdon. %d ja \n ovat siis muotoilukoodeja samoin kuin C-kielen vastaavat.<br>
								<br>
								Edet&auml;&auml;n koodissa SCANF-lauseeseen:</font>
							<pre>   scanf&quot;%d&quot;,p0
</pre>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kuten C-kieless&auml;, VP-assemblyss&auml;kin SCANF toimii tavallaan k&auml;&auml;nteisesti PRINTF:&auml;&auml;n n&auml;hden eli t&auml;ss&auml; tapauksessa SCANF lukee ruudulta kokonaislukuarvon, joka kerrotaan koodilla %d, ja sijoittaa arvon rekisterin P0 osoittamaan osoitteeseen. Otetaan sitten j&auml;ljell&auml; oleva koodi k&auml;sittelyyn:</font>
							<pre>qcall lib/free,(p0:-)
qcall lib/exit,(0:-)

ret

toolend
.end
</pre>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Free-kutsu tulee j&auml;lleen ANSI-C-maailmasta. Sill&auml; vapautetaan varattu muisti; l&auml;hdeparametrina annetaan pointterirekisteri P0, jossa meill&auml; on varatun muistin alkuosoite. Exit-kutsukin on per&auml;isin ANSI-C-maailmasta eli sill&auml; poistutaan ohjelmasta ja palautetaan SHELL:iin paluukoodi. K&auml;sky&auml; RET, joka tulee sanasta return (paluu), ei sitten itse asiassa koskaan saavutetakaan. Mutta se on t&auml;ydellisyyden vuoksi mukana; aliohjelmatapauksissa (non-primary tools) sill&auml; palattaisiin kutsuvaan ohjelmaan. TOOLEND-makrolla lopetaan alussa TOOL-makrolla aloitettu lohko. .END-makro ei ole pakollinen. Se kertoo k&auml;&auml;nt&auml;j&auml;lle, ett&auml; koodi loppuu. </font></div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Lopuksi</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Toivottavasti t&auml;m&auml; hyvin pintapuolisesti VP-assembly&auml; k&auml;sittelev&auml; artikkeli antoi jonkinlaisen kuvan VP-assemblyn mahdollisuuksista. Kenties joku tekee enemm&auml;n VP-assemblyn mahdollisuuksia esittelev&auml;n artikkelin. :) Ohessa viel&auml; <a href="VPEsimerkki.asm">esimerkkilistaus</a>.</font></div>
					</td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Sekalaiset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;</font><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;</td>
				</tr>
			</table>
		</center>
	</body>

</html>