<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sekalaiset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Sekalaiset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Erin&auml;k&ouml;inen Amiga</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Tero Siironen &lt;<a href="mailto:tsiirone@paju.oulu.fi">tsiirone@paju.oulu.fi</a>&gt;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Idea kotelon vaihtamiseen l&auml;hti liikkeelle jo vuoden 2000 kes&auml;ll&auml;, kun ostin nykyisen Amigani. A1200-kokoonpano oli rakennettu IBM:n pieneen tornikoteloon, joka oli kyll&auml; sin&auml;ns&auml; toimiva ratkaisu, muttei kuitenkaan niin silmi&auml; hivelev&auml;n kaunis. P&auml;&auml;tin l&auml;hte&auml; p&auml;ivitt&auml;misess&auml; hitaasti liikkeelle; ostaisin sopivan tornin vasta sitten, kun sellainen tulisi vastaan sopivaan hintaan.</b></font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Aika kului, eik&auml; sopivaa koteloa ollut k&auml;vellyt vastaan. Vuoden 2002 vapun vieton keskell&auml; kuitenkin sain toisenlaisen idean. Kaverini kertoi, kuinka h&auml;n oli lukenut netist&auml; projektista, jossa PC oli rakennettu hifilaitemittoihin sopivaan koteloon kotiteatterik&auml;ytt&ouml;&auml; varten. Seuraavana aamuna etsin k&auml;siini mitan ja aloin tutkia mahdollisuuksia. A1200 ja Blizzard 1230-IV ovat yhdess&auml; n. 41 cm pitk&auml; yhdistelm&auml;, eli se sopisi 42 cm leve&auml;&auml;n koteloon. Muiksi minimimitoiksi kokoonpanolle sain korkeudeksi 9 cm ja syvyydeksi n. 35 cm. T&auml;llaistakaan koteloa ei ihan heti tullut vastaan, ja ehdinkin jo hankkia vanhan AT-maxitornikotelon varalle sek&auml; p&ouml;yt&auml;mallin AT-kotelon.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/duxvideo.jpg" alt="DUX-videot alkuasussaan" height="195" width="400" border="1"></font></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Lopulta onnistuin kuitenkin l&ouml;yt&auml;m&auml;&auml;n paikallisesta TV- ja radiohuollosta DUX-merkkisen videon, joka t&auml;ytti mitoiltaan vaatimukseni.</font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Rakentaminen alkaa</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ensimm&auml;inen teht&auml;v&auml; oli tyhjent&auml;&auml; kotelo vanhasta rojusta. Se sujui suhteellisen helposti, samoin kuin etupaneelin karsinta turhista napeista ja muusta tarpeettomasta materiaalista. Samoin purin Amigani pois vanhasta kotelosta, jotta voisin mittailla ja sovitella tavarat uuteen kotiin. Gentle Eyelt&auml; tilasin Lyran, PCMCIA-kulma-adapterin sek&auml; AmigaOS 3.9:n. Aikaisemmin olin jo hankkinut k&auml;ytettyn&auml; toisen PCMCIA-adapterin.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/verkkokortti.jpg" alt="PCMCIA-verkkokortti" height="188" width="400" border="1"></font></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kaksi kappaletta tarvitsin, jotta saisin verkkokortin mahtumaan kotelon sis&auml;&auml;n. Suunnittelin verkkokortin 180 asteen kulmaan emolevyn p&auml;&auml;lle. Lyra puolestaan sen vuoksi, ett&auml; k&auml;yt&auml;n Amigaani l&auml;hinn&auml; vanhojen pelien pelaamiseen, ja nyt saisin siis painettua peleiss&auml; useamman napin yht&auml; aikaa pohjaan, joka on jossain peleiss&auml; aika v&auml;ltt&auml;m&auml;t&ouml;nt&auml;.<br>
							<br>
							<i>Lyra-adapterista voit lukea Janne Per&auml;ahon <a href="../testit/lyra.html" target="_self">arvostelun</a> toisaalta t&auml;st&auml; lehdest&auml;!</i></font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Uusia ideoita</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Koska olin aikeissa ostaa television, p&auml;&auml;tin lis&auml;t&auml; koteloon scart-liittimen RGB-kuvaa varten. Toisaalta, koska vain toinen TV:n scart-liittimist&auml; tukisi RGB:t&auml;, pit&auml;isi kuva saada my&ouml;s jollain toisella keinolla TV:lle, sill&auml; DVD-soitin veisi tulevaisuudessa RGB-scartin. Laadullisestihan S-video on RGB:st&auml; seuraava alasp&auml;in, joten aloin tutkia mahdollisuuksia lis&auml;t&auml; S-video-liit&auml;nt&auml; Amigaani, komposiittivideo kun ei kuvanlaadullaan minua houkutellut. A1200:aan pohjautuvassa CD32:ssahan S-video-liit&auml;nt&auml; on vakiona, joten mahdotonta sen lis&auml;&auml;minen ei pit&auml;isi olla. Netist&auml; l&ouml;ysinkin ohjeet, joilla A520-TV-modulaattorista saisi kuvan ulos S-videona. Moista laitetta en kuitenkaan itse omistanut, ja toiseksi se olisi vienyt turhaa tilaa jo muutenkin pieness&auml; kotelossa. Lis&auml;ksi scan doubler varasi jo Amigan videoportin.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Parin p&auml;iv&auml;n surffauksen j&auml;lkeen tein l&ouml;yd&ouml;n. Sain selville, ett&auml; A1200:n modulaattoripiiri on sama kuin 8-bittisen Sega Master System 2 -pelikonsolin. Lis&auml;ksi l&ouml;ysin datalehden ko. piirille, vaikka se olikin japaniksi. SMS2:een oli S-video-modifikaatioita ilmeisesti tehty. L&ouml;ysin sivun, jossa oli ohje S-video-ulostuloon, tosin kytkent&auml;&auml; ei ollut testattu, koska tekij&auml;ll&auml; ei ollut kyseist&auml; liit&auml;nt&auml;&auml; tukevaa televisiota. Mutta datalehdist&auml; varmensin piirin oikeat jalat ja p&auml;&auml;tin kokeilla onneani.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/modifikaatio.jpg" alt="S-video-modifikaatio" height="212" width="400" border="1"></font></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Itse modifikaatio oli helpohko. A1200 k&auml;ytt&auml;&auml; kuvan modulointiin Sonyn CXA1145M-piiri&auml;, joka on emolevyll&auml; piiri U12, l&auml;hell&auml; RF-modulaattorin suojakuorta. Yhdistetyn Y-signaalin (luminanssi + synkronointi) saa ulos piirin jalasta 16 ja C-signaalin (krominanssi) jalasta numero 15. N&auml;iden per&auml;&auml;n vain 75 ohmin vastukset sek&auml; 200 mikrofaradin elektrolyyttikondensaattorit, plus-jalat kohti piiri&auml;. Maasignaalit yhdistin toisiinsa ja juotin RF-modulaattorin kuoreen. Itse komponentit juotin pienelle muovilevyn palaselle, kun en verolevy&auml; omistanut sill&auml; hetkell&auml;.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/liitannat.gif" alt="Liit&auml;nt&auml;kaaviot" height="221" width="420" border="1"></font></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Johdon p&auml;&auml;h&auml;n naaraspuolinen nelj&auml; pinninen minidin-liitin, joka kytket&auml;&auml;n seuraavalla tavalla. Pinniin numero 1 Y maa, nro. 2 C maa, nro. 3 Y ja nro. 4 C. Ja hyvinh&auml;n se sitten toimikin, TV-kortilla kuva n&auml;kyi v&auml;reiss&auml; ja suhteellisen ter&auml;v&auml;n&auml;. Huono puoli oli se, ett&auml; kuvan kontrasti vaihteli voimakkaasti riippuen valoisuudesta. Onneksi t&auml;m&auml; vaivasi vain TV-kortin kuvaa, sill&auml; oikeassa televisiossa t&auml;t&auml; ilmi&ouml;t&auml; ei tapahdu. Kuva on paljon tarkempi kuin komposiittivideosta saatu kuva, mutta kuvassa on kuitenkin enemm&auml;n kohinaa kuin RGB-kuvassa.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Lis&auml;ksi tein siis scart-liittimen, josta saa ulos RGB-signaalia. Aluksi tein kytkenn&auml;n netist&auml; l&ouml;yt&auml;mieni ohjeiden mukaan. Ensimm&auml;isell&auml; yritt&auml;m&auml;ll&auml; ei kuitenkaan kuvaa televisioon tullut. Tarkistin kytkenn&auml;n, mutta en havainnut vikaa. P&auml;&auml;tin kokeilla toista kytkent&auml;&auml;, Saku #16:n ohjeiden mukaan. Mutta taaskaan ei kuvaa tullut, v&auml;rit vain vilisiv&auml;t TV:ss&auml;. Pidemm&auml;npuoleisen pohdiskelun j&auml;lkeen keksin, ett&auml; synkronointisignaali tulee eri pinniin kuin ohjeessa. En nimitt&auml;in ollut tekem&auml;ss&auml; v&auml;likaapelia kuten ohjeessa, vaan liittimen koteloon, josta signaali vied&auml;&auml;n normaalia scart-kaapelia pitkin TV:lle. Eli csync pitikin kytke&auml; pinnin 20 sijasta pinniin 19.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/tvkuva.jpg" alt="Vihdoin kuva televisioon" height="223" width="400" border="1"></font></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Virheen korjauksen j&auml;lkeen alkoi kuva n&auml;ky&auml; oikein TV:ss&auml;. Scart-liittimeni jakaa Amigan videoportin, mutta onneksi se ei ainakaan n&auml;kyv&auml;sti kuvanlaatuun vaikuta, vaikka pit&auml;isi sek&auml; TV:n ett&auml; monitorin p&auml;&auml;ll&auml; yht&auml; aikaa.</font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Rakentaminen jatkuu</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Koteloon tuli kaiken kaikkiaan seuraavat osat: emolevy, turbokortti, kovalevy, korppuasema, lis&auml;levyasema ohjaimineen, CD-ROM-asema, PCMCIA-verkkokortti ja virtal&auml;hde. Kun laitoin kaikki osat koteloon yht&auml; aikaa, alkoi kotelo n&auml;ytt&auml;&auml; jo ahtaalta. Virtal&auml;hteest&auml; oli otettava kuoret pois, sek&auml; korkeutensa ett&auml; syvyytens&auml; takia.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Pieni varoituksen sana lienee my&ouml;s paikallaan. Virtal&auml;hteess&auml; on aika suuria kondensaattoreita, joten on syyt&auml; antaa niiden purkautua aina ennen kuin pist&auml;&auml; sormensa l&auml;hellek&auml;&auml;n sen sis&auml;lmyksi&auml;. Itse tein sen seuraavalla tavalla: kun sammutin Amigan, otin virtajohdon pois, ja sen j&auml;lkeen virtakytkin takaisin on-asentoon. Tuuletin py&ouml;r&auml;hti yleens&auml; hiukan, ja viel&auml; odottelemalla kuului kuinka kondensaattorien varaus purkautui. Sen j&auml;lkeen vasta k&auml;vin k&auml;siksi virtal&auml;hteeseen.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kotelon muoviosia aloin muokkaamaan Dremelill&auml;, katkaisulaikkoja kului jo t&auml;ss&auml; vaiheessa muutamia. Alumiiniosien ty&ouml;st&ouml;n j&auml;lkeen laskin kulutukseksi jo yli kymmenen laikkaa. Etupaneelista otin l&auml;hes kaiken muovin pois, j&auml;tin vain reunat, joihin voisin kiinnitt&auml;&auml; alumiinilevyn. Samoin takalevy koki aikamoista muodonmuutosta. Takalevyksikin tulisi alumiinilevy&auml;.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kun kotelo oli karsittu minimiins&auml;, oli aika taas sovitella tavarat koteloon. Ja hyvinh&auml;n ne sinne sopivatkin - tai no, ei v&auml;ltt&auml;m&auml;tt&auml; hyvin, mutta mahtuivat kuitenkin. Olin suunnitellut arkkitehtuurin siten, ett&auml; emolevy tulisi pohjalle etureunaan, levy- ja CD-asemat sen yl&auml;puolelle ja takareunaan virtal&auml;hde sek&auml; kovalevy. Sitten tuli mieleen ajatus, ett&auml; mill&auml;h&auml;n ilveell&auml; saan ne asemat &quot;leijumaan&quot; siihen emolevyn yl&auml;puolelle. Joksikin aikaa jo vaihdoin suunnitelman siten, ett&auml; asemat pohjalle ja emolevy p&auml;&auml;lle. Se idea kuitenkin tuli tuomittua sen perusteella, ettei ilma olisi p&auml;&auml;ssyt kiert&auml;m&auml;&auml;n kotelossa juuri lainkaan. Palasin takaisin suunnitelmaan A.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/telineet.jpg" alt="Asematelineet alumiinista" height="259" width="400"></font></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Keksin sitten, ett&auml; alumiinilevyst&auml; voisin tehd&auml; telineet, joiden varassa asemat olisivat. Niinp&auml; ryhdyin suunnittelemaan sopivia paloja pahvin avulla. Kun sopivat palaset oli tehty, rautasaha k&auml;teen ja alumiinilevyn kimppuun. Sovitteluun meni aikansa, mutta lopulta sain sellaisen tuloksen aikaiseksi, johon olin tyytyv&auml;inen.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/levyt.jpg" alt="Etu- ja takalevy" height="191" width="400" border="1"></font></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Etu- ja takalevyn suunnittelin my&ouml;s ensin pahvista, jonka j&auml;lkeen otin taas Dremelin ja porakoneen esiin ja aloin ty&ouml;st&auml;m&auml;&auml;n alumiinia. Lopputulos oli ihan ok, pari pient&auml; harhaj&auml;lke&auml; sain aikaiseksi, mutta nekin sain suhteellisen n&auml;kym&auml;tt&ouml;m&auml;ksi hiontavaiheessa ennen maalausta.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Virtal&auml;hteest&auml; jouduin sahaamaan regulaattorien j&auml;&auml;hdytyslevyj&auml; hiukan matalammiksi, jotta se ylip&auml;&auml;t&auml;&auml;n mahtuisi koteloon sis&auml;lle. Kun kaikki mahtuivat kotelon sis&auml;&auml;n, oli aika testata kokoonpanoa. Kaikki toimi muuten hyvin, mutta jostain syyst&auml; VGA-monitorille tuli vihermusta kuva. Otin virrat pois p&auml;&auml;lt&auml; ja liit&auml;nn&auml;t tutkinnan alle. Syyksi paljastui irtonainen maajohto, joka oli kontaktissa scan doublerin piirilevyyn, hups! Onneksi mit&auml;&auml;n ei k&auml;r&auml;ht&auml;nyt, ja kun poistin johdon, oli kuvakin taas normaali, ainakin melkein. Kuvassa nimitt&auml;in esiintyi lyhyit&auml; vaakasuoria h&auml;iri&ouml;viivoja ja v&auml;lill&auml; kuva h&auml;ipyi kokonaan. Samaan aikaan RGB- ja RF-kuva n&auml;kyi kuitenkin hyvin televisioissa. Eli vika paikallistui scan doubleriin. My&ouml;hemmin huomasin, ett&auml; scan doublerin liitinpiirilevyss&auml; kondensaattori oli saanut siipeens&auml; taivuttelusta, samoin veto sen toiseen jalkaan oli poikki. N&auml;m&auml; sain korjattua johdolla ja vaihtamalla komponentin. Vaakaviivat h&auml;visiv&auml;t, mutta kuva h&auml;ipyi v&auml;lill&auml; edelleen.</font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Poks!</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Huomasin my&ouml;hemmin, ett&auml; kuva h&auml;ipyi vain silloin kun virtal&auml;hde oli paikallaan kotelossa. Jos sen nosti pois kotelosta, kuva pysyi hyv&auml;n&auml; koko ajan. Samoin jos virtal&auml;hdett&auml; nosti muutaman sentin yl&ouml;sp&auml;in, oli kuva ok. No, ylim&auml;&auml;r&auml;ist&auml; tilaa ei kuitenkaan kotelossa ollut moiseen operaatioon. Niinp&auml; piti yritt&auml;&auml; poistaa h&auml;iri&ouml;t&auml; muilla keinoilla. Tein alumiinilevyst&auml; pienen suojan videoliit&auml;nn&auml;n p&auml;&auml;lle, mutta se auttoi vain v&auml;h&auml;n. Seuraavaksi tein virtal&auml;hteelle puolittaisen koteloinnin, my&ouml;s alumiinista. Kuori peitt&auml;&auml; virtal&auml;hteen alapuolelta, emolevyn puoleiselta reunalta sek&auml; v&auml;h&auml;n matkaa yl&auml;puolelta.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Taas testaamaan. Virtajohto paikalleen ja sen j&auml;lkeen johto pistorasiaan. POKS! Kaikki ei ollut ilmeisesti kunnossa. Virtal&auml;hteest&auml; r&auml;j&auml;hti nimitt&auml;in vastus. Syyn&auml; oli joko liian ohut eristys virtal&auml;hteen piirilevyn ja kuoren v&auml;liss&auml; tai sitten se, ett&auml; p&auml;&auml;llyskuori oli kosketuksissa regulaattorien j&auml;&auml;hdytyslevyihin. My&ouml;hemmin huomasin, ett&auml; j&auml;lkimm&auml;inen taisi olla oikea syy, nimitt&auml;in virtal&auml;hteen maajohdon ja yhden j&auml;&auml;hdytyslevyn potentiaaliero oli n. 100V(!), kun mittasin sen yleismittarilla Amigan ollessa p&auml;&auml;ll&auml;.							<table width="100%" border="0" cellspacing="2" cellpadding="0">
								<tr>
									<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
								</tr>
								<tr>
									<td valign="top" width="50%"></td>
									<td valign="top">
										<div align="center">
											<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/poks.jpg" alt="Poksahtanut vastus" height="313" width="332" border="1"></font></div>
									</td>
									<td valign="top" width="50%"></td>
								</tr>
								<tr>
									<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
								</tr>
							</table>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Onnekseni vastuksesta j&auml;i noin kahden neli&ouml;millimetrin kokoinen pala kuorta j&auml;ljelle, jotta pystyin katsomaan vastuksen arvon ja ostamaan uuden tilalle. Virtal&auml;hde alkoikin toimia, kun vaihdoin vastuksen. Onni onnettomuudessa, sill&auml; jos olisin joutunut hankkimaan uuden virtal&auml;hteen, eiv&auml;t takapaneelin rei&auml;t virtal&auml;hteen liittimille olisi varmastikaan olleet kohdallaan. Toisaalta tuliter&auml;&auml; virtal&auml;hdett&auml; ei muutenkaan tekisi mieli heti purkaa.<br>
							<br>Paransin eristyst&auml; sek&auml; virtal&auml;hteen ala- ett&auml; yl&auml;puolelta ja huomasin, etteiv&auml;t alumiinikuoretkaan riitt&auml;neet h&auml;iri&ouml;n poistoon. Kuva r&auml;psyi edelleen, tosin kylm&auml;n&auml; kuva pysyi vakaana, mutta kunhan Amiga oli ollut noin 20-30 minuuttia p&auml;&auml;ll&auml;, alkoi kuva taas r&auml;psy&auml;. Tein my&ouml;s havainnon, ettei NTSC-kuva k&auml;rsinyt h&auml;iri&ouml;st&auml; juuri lainkaan; vain pieni alue kuvasta v&auml;r&auml;hteli silloin t&auml;ll&ouml;in. Workbench-ruutu ei k&auml;rsinyt ongelmasta puolestaan lainkaan, vaan kuva piirtyi monitorille hyvin. Eli ilmeisesti verkkovirran 50 Hz s&auml;teili kotelon sis&auml;ll&auml; sen verran, ett&auml; aiheutti h&auml;iri&ouml;t&auml; scan doublerille PAL-kuvassa. Ratkaisu ongelmaan olisi se, ett&auml; vaihdan kovalevyn ja virtal&auml;hteen paikkoja kotelon sis&auml;ll&auml;, mutta se saa odottaa ainakin ensi kes&auml;&auml;n, sill&auml; televisiosta kuva n&auml;kyy hyvin kaikilla liit&auml;nt&auml;tavoilla. Ty&ouml;p&ouml;yt&auml; n&auml;kyy puolestaan monitorista hyvin, koska se k&auml;ytt&auml;&auml; korkeampaa n&auml;ytt&ouml;tilaa korkeammalla virkistystaajuudella.</font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Loppukokoonpano</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/tilapula.jpg" alt="Kaapeleilla ahdasta" height="322" width="400" border="1"></font></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Jos kotelo vaikutti jo aiemmin ahtaalta, niin kaikkien v&auml;likaapelien lis&auml;&auml;misen j&auml;lkeen vaikutti jo silt&auml;, ettei koteloon j&auml;isi sentti&auml;k&auml;&auml;n tilaa. Asiaa auttoi hiukan se, ett&auml; viipaloin lattakaapelit, kuten IDE- ja floppykaapelit, noin 10 johtimen nippuihin. Lis&auml;ksi pyrin j&auml;rjestelm&auml;&auml;n kaapelit siten, ett&auml; ilma p&auml;&auml;sisi liikkumaan mahdollisimman hyvin.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Etupaneeliin tein pienet rei&auml;t 3 mm:n ledeille. Virta-, kovalevy- ja levyasemaledit sain suoraan emolevyst&auml; 180 ohmin etuvastuksien kautta. Lis&auml;levyaseman ledin tilalle vaihdoin johdon p&auml;&auml;ss&auml; olevan ledin ja CD-asemaakin modifioin sen verran, ett&auml; laitoin sen oman ledin rinnalle johdon p&auml;&auml;h&auml;n toisen. Tosin sen vuoksi CD-aseman ledi vilkkuu nyt himme&auml;mp&auml;n&auml; kuin muut, mutta en halunnut poistaa pintaliitosledi&auml; CD-asemasta. Ledirivist&ouml;n liimasin kuumaliimalla etupaneelin taakse, ja ledien ja niiden reikien v&auml;liss&auml; on kirkas muovi. Lis&auml;ksi etupaneeliin tein erillisen eject-napin CD-asemalle, n&auml;pp&auml;imist&ouml;liittimen rei&auml;n ja peliporttien liittimet. Lyran n&auml;pp&auml;imist&ouml;liittimen johdon korvasin pidemm&auml;ll&auml;, ja lis&auml;ksi jouduin taivuttamaan liittimen vinoon, jotta se mahtuu olemaan CD-aseman alla.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/takaa.jpg" alt="Valmis kotelo takaa" height="208" width="400" border="1"></font></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Takapaneeliin tuli virtal&auml;hteen liittimet, sarja-, rinnakkais- ja lis&auml;levyasemanliit&auml;nn&auml;t, Scart-liitin, S-video-liitin, scan doublerin SVGA-liitin sek&auml; viel&auml; RCA-liittimet &auml;&auml;nelle, RF-signaalille ja komposiittivideolle. Takalevyyn tein lis&auml;ksi rei&auml;n verkkokaapelia ja isomman rei&auml;n 6 cm:n tuuletinta varten. Tuulettimen kytkin 100 ohmin potentiometrin kautta, joten takapaneelista voi s&auml;&auml;t&auml;&auml; tuulettimen nopeutta. Verkkokaapelin liittimen tein jatkopalasta, jonka purin ja juotin kiinni lyhyen johdon, jolla sen pystyi kytkem&auml;&auml;n PCMCIA-verkkokortin liitinmoduuliin.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kun alumiinilevyt oli maalattu ja liittimet kiinnitetty takalevyyn, oli aika kiinnitt&auml;&auml; paneelit koteloon. Siin&auml; vaiheessa huomasin yhden suunnitteluvirheen. RCA-liittimet olivat hiukan liian ylh&auml;&auml;ll&auml; ja ottavat kovalevyn asennustelineeseen kiinni. Korjasin tilanteen sopivalla m&auml;&auml;r&auml;ll&auml; eristysteippi&auml;. Toisenlainen korjaus sitten, kun vaihdan kovalevyn ja virtal&auml;hteen paikkoja. Alumiinilevyjen kiinnityst&auml; yritin aluksi kuumaliimalla, mutta k&auml;ytt&auml;m&auml;ni kuumaliima ei oikein pysynyt alumiinissa, joten piti keksi&auml; toinen kiinnitystapa. Ostin vesiliukoista kontaktiliimaa, joka ainakin lupasi liimata metallia ja muovia. Sill&auml; sainkin sitten paneelit pysym&auml;&auml;n paikoillaan.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/edesta.jpg" alt="Valmis kotelo edest&auml;" height="207" width="400" border="1"></font></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">CD-aseman luukkuun tein my&ouml;s oman alumiinisuikaleen, jonka liimasin pikaliimalla sopivan paksuisen muovipalikan avulla luukkuun kiinni. Lis&auml;ksi pursotin v&auml;lin t&auml;yteen kuumaliimaa, jotta kiinnitys varmasti pit&auml;isi. Alumiiniluukku on aika v&auml;lj&auml; verrattuna etupaneelin aukkoon, mutta sen verran on my&ouml;s v&auml;lj&auml; CD-aseman kiinnitys koteloon, ett&auml; oikeastaan on vain hyv&auml;, ett&auml; toleranssia l&ouml;ytyy v&auml;h&auml;n. Lis&auml;ksi kun maalasin CD-aseman oikean etupaneelin my&ouml;s mustaksi, ei rako erotu hirve&auml;sti. Pohjaan laitoin kuusi kappaletta kumitassuja ja nelj&auml; kromiputken p&auml;tk&auml;&auml;, joilla sain viimeistelty&auml; hifilaitemaisen ulkon&auml;&ouml;n. Lopuksi viel&auml; tarrat liittimien viereen, ja projekti oli t&auml;ss&auml; muodossaan valmis.</font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Yhteenveto</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Olen aherrukseni j&auml;lkeen tyytyv&auml;inen, ett&auml; tulin l&auml;hteneeksi t&auml;h&auml;n projektiin. Nyt Amigani saa viett&auml;&auml; aikaansa paremmassa seurassa vahvistimen, CD-soittimen yms. vieress&auml;. T&auml;m&auml; helpottaa huomattavasti sijoittamista ja laskee lis&auml;ksi kynnyst&auml; Amigan k&auml;ytt&ouml;&ouml;n. Lis&auml;ksi n&auml;pp&auml;imist&ouml;n ja ohjaimet saa helposti irrotettua tai vaihdettua kotelon etupaneelista. RGB:n ja S-videon kautta on mukava pelata esim. Sensible Socceria 32&quot; laajakuvatelevisiossa.<br>
							<br>
							Negatiivisena puolena projektissa on PAL-kuvan r&auml;psyminen scan doublerin kautta, joka tosin on korjattavissa, ja varmaan sen teenkin l&auml;hitulevaisuudessa. Lis&auml;ksi koteloon ei voi asentaa juuri en&auml;&auml; mit&auml;&auml;n laajennuksia, kuten esim. PCI-v&auml;yl&auml;korttia. Mutta enp&auml; niit&auml; nykyisess&auml; k&auml;yt&ouml;ss&auml; hirve&auml;sti kaipaakaan. Turbokortin pystynee vaihtamaan tehokkaampaan tarvittaessa, tosin vaivaa joutuu n&auml;kem&auml;&auml;n aika paljon. Rahaa projektiin upposi kaiken kaikkeaan 220 euroa, joista PCMCIA-adapterien, Lyran ja AmigaOS 3.9:n osuus on 160 euroa. Itse kotelointi tuli siis maksamaan 60 euroa.</font></td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Sekalaiset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;</font><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;</td>
				</tr>
			</table>
		</center>
	</body>

</html>