<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Amiga Plus CD Nr.2 / 2000</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<h1><CENTER><FONT COLOR="GREEN">Amiga Plus CD 2 / 2000</FONT></CENTER></h1></P>
Nach der &#228;u&#223;erst gelungenen Ausgabe 1 / 2000 der A+ (Review in NC 72) ist es
nat&#252;rlich auch ein Mu&#223;, die zweite Ausgabe des aktuellen Jahres hier
vorzustellen, denn nicht wenige werden sich vielleicht geadcht haben, da&#223;
die 1 / 2000 ein positiver &quot;Ausrutscher&quot; war und nachfolgende CD`s das hohe
Niveau nicht mehr halten k&#246;nnen. Was die 2 / 2000 taugt, wird dieser Bericht
zeigen m&#252;ssen...</P>

<h2><CENTER><FONT COLOR="YELLOW">Offensichtliche Ver&#228;nderrungen</FONT></CENTER></h2></P>
War schon die erste Ausgabe der A+ CD in diesem Jahr von vielen kleineren
oder gr&#246;&#223;eren Ver&#228;nderrungen gepr&#228;gt, so hat man auch mit der aktuellen
Ausgabe einige Sachen abge&#228;ndert, die dem Gesamteindruck der CD sicherlich
gut tun:</P>

Als erstes w&#228;re da sicherlich der HTML Index zu nennen mit dem es von nun an
m&#246;glich ist, auch per Browser durch die CD zu navigieren und das alles
nat&#252;rlich auf einer ansprechenden HTML Seite. Ich bin zwar nicht unbedingt
der Fan von dieser Art eine CD zu durchsuchen, aber es wird sicherlich User
geben, die diesen Weg lieben werden. Damit ihr dies auch mit Eurem
Lieblingsbroswer machen k&#246;nnt, wurde extra f&#252;r die A+ CD Reihe ein Prefs
Programm gekreiert, mit dem ihr (wahlweise Multimedial) Eure Lieblingstools
zum betrachten von Bildern, HTML Seiten, MP3 St&#252;cken sowie QuickTime und MPG
Animationen einstellen k&#246;nnt. Das ganze funktioniert in der Praxis auch ganz
hervorragend und bietet der A+ CD in Sachen Komfort schonmal einen
entscheidenden Vorteil gegen&#252;ber &#228;hnlich gearteten CD`s.</P>
<CENTER><img src="aplus2.jpg"></CENTER></P><BR>

Ebenfalls &#252;berarbeitet wurde der &quot;Updater&quot;, der immer daf&#252;r sorgt, da&#223; ihr
nur die aktuellesten Dateien (z.B. Libs, Datatypes etc.) auf Eurer
Festplatte habt. Zwar gibt es noch einige kleinere Probleme mit OS 3.5, aber
der Markus Castro (f&#252;r Inhalt etc. vernatwortlich) hat mir schon versprochen,
dieses Manko auszumerzen. Es kann also damit gerechnet werden, da&#223; dieses
Problem auch bald der Vergangenheit angeh&#246;rt.</P>

<CENTER><h2><FONT COLOR="RED">Der Inhalt</FONT></CENTER></h2></P>
Das ganze &quot;drumherum&quot; stimmt also schonmal, aber wichtiger ist sicherlich
der Inhalt. Und auch hier hat die 2 / 2000 CD einiges zu bieten:</P>

<h3><B>Bereich Multimedia</h3></B></P>

<u>GFX:</U><BR>
Neben vielen Glow Icons f&#252;r das aktuelle OS 3.5 System (man kann diese auch
mit dem bekannten NewIcon System benutzen) findet sich hier auch die
Bildergalerie der A+ wieder, die mit 16 Autoren (viele davon mit mehreren Beitr&#228;gen)
erstaunlich stark besetzt ist. Freunde von Raytracing Pics werden hier
sicherlich f&#252;ndig werden, auch wenn es mitunter starke qualitative
Unterschiede gibt.</P>

<u>Videos:</U><BR>
Hier werden im Grunde alle nostalgisch veranlagten User f&#252;ndig, denn man hat
es geschafft, einige Uralte Werbespots, wie sie im Fernsehen gezeigt wurden,
im MPEG Format auf die CD zu bringen. Darunter sind u.a. so tolle Dinge wie
die Commodore Werbespots f&#252;r den A1000 sowie &quot;aktuellere&quot; Spots f&#252;r das
CD32. Zus&#228;tzlich gibt`s noch das Music Video von AI. Einzigstes Problem bei
der ganzen Sache: Die Clips liegen leider in bescheidener Qualit&#228;t vor, was
zwar einerseits den &quot;Genuss&quot; auch auf schw&#228;cheren Modellen erm&#246;glicht,
andererseits aber High End User ver&#228;rgern wird. Tja, es ist halt nicht immer
leicht, den idealen Mittelweg zu finden :-)))</P>

<u>Sound:</U><BR>
Hier tummeln sich einige MP3 Dateien aus dem Netz der Netze, die aber
absolut nicht meinen pers&#246;nlichen Geschmack treffen (Heavy Metal Rulez). Wer
da nicht alzu sehr auf eine Musikrichtung versteift ist, der kann hier ja
mal reinh&#246;ren. Wie gesagt: Mein Geschmack ist es nicht, aber das kann nun ja
auch kein Kriterium f&#252;r einen objektiven Test sein.</P>


<h3><B>Bereich Misc</h3></B></P>

<u>Mags:</U><BR>
Wie nicht schwer zu erraten tummeln sich hier die bekannteren Online Mags,
darunter auch die NoCover sowie das Star Mag (R.I.P), das Gadget, die neue
Amiga Ph&#246;nix und nat&#252;rlich die AAktuell. Leider fehlen auch einige namhafte
Namen wie z.B. die Amiga4ever oder auch die FunTime. Alles in allem wird
hier aber Lesespa&#223; ohne Ende geboten.</P>

<u>Data:</U><BR>
Neben dem Programm &quot;Bibelforscher&quot; ist hier nur noch die &quot;Amiga User Liste&quot;
zu finden; letzteres halte ich &#252;brigens f&#252;r ein sinniges Projekt und kann
nur alle aktiven Amiganer bitten, sich dort einzutragen. Irgendwie wirkt es
n&#228;mlich etwas peinlich, wenn dort noch nichtmal 1000 Eintr&#228;ge zu finden
sind...</P>

<h3><B>Bereich Scene</h3></B></P>

<u>Demos:</U><BR>
Hier kommen nat&#252;rlich Fans der phantastischen Demos auf ihre Kosten - egal
ob man nun auf neue Demos der Marke &quot;Astrology&quot; oder &quot;Utopia&quot; steht oder
alte Demos preferriert - hier ist einiges zu finden. Nicht Demo Fans (gibt es sowas überhaupt?) werden
damit zwar nix anfangen k&#246;nnen, aber man kann es ja nunmal auch nicht jedem
recht machen.</P>

<u>Mags:</U><BR>
Recht d&#252;rftig ist die Ausbeute an Mags aus der Demo Scene: Mit Seenpoint
befindet sich hier n&#228;mlich nur ein Eintrag :-((</P>

<u>Events:</u><BR>
Abgerundet wird der Ordner &quot;Scene&quot; von einigen Pics von der Zentrix99. Halt
was f&#252;r wirkliche Fans der Scene...</P>

<h3><B>Games</h3></B></P>

<u>Demos &amp; Previews</u><BR>
Zusammenfassend kann man diese beiden Ordner (auf der Original CD sind diese getrennt) als Schwerpunkt auf aktuellen Games thematisieren. So findet ma
n z.B. Demoversionen zu &quot;Wipeout&quot;, &quot;Exodus&quot; und &quot;Hellsquad&quot; sowie Previewmaterial in Form von MP3 Dateien (&quot;Counterstrike&quot;), QT Movies (&quot;Heretic II&quot;) 
und Pics (&quot;Deep Silence&quot;) zu diversen sich in der Entstehung befindenen Games f&#252;r den Classic Amiga.</P>

<u>Oldies &amp; PD</U><BR>
Zwar sind diese beiden Ordner ebenfalls recht schwach besetzt, aber da sich die Schwesterzeitschrift Amiga Future ohnehin f&#252;r Spiele verantwortlich zeichnet (und diese nat&#252;rlich dort auch den Schwerpunkt auf der CD bilden), kann man getro&#223;t dar&#252;ber hinwegsehen. Und wer dennoch auf Klassiker wie &quot;Bleed&quot; oder &quot;Pamehta&quot; bzw. neues Material in Form von &quot;Bombsquare&quot;, &quot;Muscarine&quot;, &quot;Battle Duel&quot; oder &quot;Orthello&quot;nicht missen m&#246;chte, der wird auch auf dieser CD f&#252;ndig.</P>

<u>Starter &amp; Updates</U><BR>
Aufgrund der sehr bewegenden Spiele Vergangenheit des Amigas, gibt`s heutzutage eine Reihe von HD Installern im Aminet, die &#228;ltere Games auf der HD installieren. Vorraussetzung daf&#252;r ist eine spezielle Software, die man in Form von &quot;JST&quot; und &quot;WHD Load&quot; auch hier findet. Dazu gibt`s mit &quot;Tude&quot; noch einen recht praktischen Degrader sowie ein Update zu &quot;Foundation&quot;, aktuelle &quot;Virtual GP&quot; Daten und ein Hilfetool f&#252;r &quot;Napalm&quot;.</P>

<h3><B>PowerPC &amp; Tools</b></h3></P>
Mit &#252;ber 200 MB an Daten stellen diese beiden Bereiche sicherlich den Schwerpunkt der CD da. Tats&#228;chlich ist es so, da&#223; sich hier unz&#228;hlige Programme 
aus den verschiedensten Bereichen (Grafik, Musik, DFUE, Internet, Emulatoren, OS 3.5, Patch, WB, Viren u.v.a.) finden, deren Auflistung mal wieder den
 Rahmen des Testberichtes sprengen w&#252;rden. Tatsache ist aber, da&#223; alle Programme verh&#228;ltensm&#228;&#223;ig (wenn man Vorlaufszeit etc. einer CD bedenkt) aktuell
 sind und zudem fein s&#228;uberlich sortiert wurden, so da&#223; die Suche nach einem bestimmten Tool nicht alzu lange dauern d&#252;rfte. Hinzu kommt noch, da&#223; man
 sich erfreulicherweise bei der Auswahl nicht nur auf das Aminet beschr&#228;nkt hat, sondern auch andere Quellen hinzugezogen hat (es finden sich im Emulatorbereich z.B. einige C64 Diskmags sowie Software f&#252;r den Brotkasten). Alles in allem eine sehr gelungene Zusammenstellung an freier Software und ich
 kann Euch versprechen, da&#223; Ihr insbesondere hiermit eine Menge Zeit vor Eurem heimischen Amiga verbringen k&#246;nnt.
</P><CENTER><IMG SRC="aplus1.jpg"></CENTER></P><BR>
<h2><CENTER><FONT COLOR="WHITE">Fazit:</FONT></h2></CENTER></P>
Wie schon die erste CD in diesem Jahr kann auch die Nr.2 / 2000 der A+ CD Reihe vollkommen &#252;berzeugen und schl&#228;gt den Vorg&#228;nger nochmals in einigen Bereichen (HTML Index etc.). Da zudem auch die Auswahl der Software stimmt und man obendrein noch das Gef&#252;hl hat, da&#223; sich der Zusammensteller viel M&#252;he
 gegeben hat (man hat wohl bewusst nicht irgendwelche Software wahllos kopiert), kann man eine eindeutige Kaufempfehlung f&#252;r diese CD abgeben. Wieder 
einmal kann ich Euch nur empfehlen, die 19.80 DM f&#252;r diese CD zu opfern - das Geld ist sie fraglos wert. Immer weiter so!</P>







<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
