<HTML>
<HEAD>
<TITLE>APC & TCP</TITLE>
</HEAD>
<BODY BACKGROUND="l_bg.gif" TEXT=#000000 LINK="#0000FF" VLINK="#000080" ALINK="#FF0000"
 BGCOLOR="#FFFFF4">
<CENTER>
<P><H2>Disku - AMIGA OS !</H2></P><BR>
<P><H4>Einwand - liebe Sieglinde ! </H4></P>
</CENTER><br>

Ich habe Deinen Artikel gelesen ! Und ich mu&szlig; sagen, ich bin sehr verwundert.<br>
Ich war seit Jahren bei IPC und habe immer p&uuml;nktlich und ohne
gro&szlig;es Palaber meine CD's und die Zeitschrift m.d. Diskette bekommen, auch wenn ich zwischendurch mal eine EXTRA-CD bestellt
habe, sie ist prompt gekommen und es gab keine M&auml;ngel. Die CD's
und Disketten waren zwar nicht immer nach meinem Geschmack, aber
in diesen Zeiten wo der AMIGA-Markt so schlecht best&uuml;ckt ist, meinte ich, wenigstens etwas f&uuml;r die, dem AMIGA treu bleibenden
Firmen, zu tun. Da ich ja kein Spiele-Freak bin, war es wenig genug.<br>
Nun, ich h&ouml;re Dich schon schimpfen, was hat das mit dem Falke-Verlag zu tun, aber gemach, gemach !<br>
Jedenfalls war der &Uuml;bergang, wie es mir erschien, etwas ungew&ouml;hnlich, aber es hat einwandfrei geklappt bei mir. Ich war sogar froh, da&szlig; der Falke-Verlag die AMIGA+ und das drumherum
&uuml;bernommen hat, denn mir erschien die AMIGA OS wesentlich professioneller aufgemacht.<br>
Ich hatte zwar zu Anfang ebenfalls mal einen Anruf beim Falke-
Verlag t&auml;tigen m&uuml;ssen, dieweil die Umstellung vom 3-Monats-ABO
zum 12-Monats-ABO nicht reibungslos funktionierte, aber es wurde
zur vollsten Zufriedenheit erledigt. Die Zeitschrift kam zwar
etwas sp&auml;ter als gew&ouml;hnlich, aber sie kam ohne Fehl und Tadel !<br>
Allerdings, mu&szlig; ich jetzt feststellen, da&szlig; die AMIGA-+-CD nicht
mehr so einwandfrei l&auml;uft, es sind viele Fehlfunktionen drin, die
mir gar nicht mehr gefallen. Man merkt zwar, da&szlig; die CD irgendwie
sch&ouml;ner aufgemacht wird, aber funktionieren mu&szlig; es halt !
Aber ich denke, die neuen Redakteure und Schreiberlinge m&uuml;ssen
sich sicher erst an das neue "Outfit" gew&ouml;hnen und sich versuchen, anzupassen.<br>
Nun, ich denke alles braucht seine Zeit und jetzt, da der AMIGA-
Markt so ziemlich am Boden zerst&ouml;rt ist, ist es besonders schwierig gut geschulte Fachkr&auml;fte und willige Mitarbeiter zu bekommen. Ich jedenfalls bin zuversichtlich und werde erstmal
weiterhin das ABO behalten und will sehen wie es weitergeht,
obwohl ich z.Zt. nicht viel Freude mit meinem AMIGA habe. Aber
dies ist eine andere Geschichte.<br>
Das war es, was ich zu dieser "Disku" beitragen m&ouml;chte.<br>
<HR>
<BR>
<img src="burg.gif" width="40" height="40" border="0" alt="Burg" align=right hspace=10>
von: &#160;<a href="Mitglieder/nuenninghoff.html">Rolf Nue. aus Wue.</a><br>
E-Mail:<a href="mailto:093113563-0001@t-online.de">
093113563-0001@t-online.de</a><p>
</P>
<HR>
</BODY>
</HTML>
