<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Diskussion: Falke Verlag</TITLE>
</HEAD>
<BODY TEXT=white bgcolor=black link=silver alink=red>
<h1><CENTER><FONT COLOR="GREEN">Diskussion: Falke Verlag</FONT></CENTER></h1></P>

Nachdem Sieglinde in der letzten Ausgabe schon ausf&#252;hrlich &#252;ber ihre
Erlebnisse mit diesem &quot;Verlag&quot; berichtet hatte, muss ich nun auch mal meinen
Senf dazugeben, denn auch ich haben &#228;hnliche Erfahrungen gemacht. Aber
fangen wir vorne an:</P>

Nachdem sich das Amiga Magazin, von dem ich ein langj&#228;hriger und sehr zufriedener Abonoment war,
im Januar `98 von uns Amiga Usern
verabschiedet hatte, blieben f&#252;r mich nur die A+ und Special &#252;brig, die ich
zwar regelm&#228;&#223;ig gekauft habe, aber niemals alzu &#252;berzeugt davon war - ein
Abo kam aus jenem Grund auch nicht in Frage. Nachdem ich aber die ersten
beiden Ausgaben der AmigaOS gekauft hatte, war ich recht schnell bereit, ein
Probeabo samt Leser CD zu schlie&#223;en; wahrscheinlich lag es daran, da&#223; die AmigaOS
mich sehr an das Amiga Magazin erinnert hat. Wie dem auch sei: Schon von
Anfang an hat es der Verlag nicht geschafft, die Hefte p&#252;nktlich zu liefern,
was ich gutgl&#228;ubigerweise einfach mal auf die Startschwierigkeiten geschoben
habe. Nachdem das Probeabo ausgelaufen war, wurde dann auch ein Jahresabo
mit CD geschlossen und hier begannen die Probleme: So hat es der Falke
Verlag einfach nicht geschafft, die Abo Pr&#228;mie (Elastic Dreams) an mich
auszuliefern und erst nachdem ich mehrfach telefonisch (wenn mal jemand da
war) dort nachgefragt hatte, kam die Software schlie&#223;lich an. Zus&#228;tzlich
gab es komischerweise noch mehrere Mahnungen (obwohl das Geld l&#228;ngst
&#252;berwiesen war !) und auch die Hefte erreichten mich immer einige Tage
sp&#228;ter, als sie am Bahnhofskisok auslagen.</P>

Richtig sauer wurde ich aber erst, als es jede Menge Stress mit den Leser
CD`s zu Weihnachten gab. So habe ich eine Ausgabe mit einer Verz&#246;gerungszeit
von fast drei (!!) Monaten zugeschickt bekommen und die H&#228;rte dabei war, da&#223;
es nichtmal ein Wort der Entschuldigung gab. Den Vogel abgeschossen hat der
Verlag aber vor einigen Tagen: Nachdem die April Ausgabe auch eine Woche nach
dem &quot;Release&quot; am Bahnhofsbuchhandel noch nicht bei mir eingetroffen war,
hatte ich die Faxen so dicke, da&#223; ich erneut beim Verlag angerufen habe und
denen dort mal klar die Meinung gesagt hatte. Zitat der Hotline: &quot;Wir werden
Ihnen das Heft dann mal die n&#228;chsten Tage zuschicken&quot;. Wow, sind die
gro&#223;z&#252;gig! Es scheint ja heute noch nicht mal mehr normal zu sein, da&#223; man
seine (bezahlten!) Hefte &#252;berhaupt bekommt.</P>

Was ich ebenfalls nicht verstehe, ist das Prinzip der Heftdisk. Warum zum
Teufel packt man im Jahre 2000 noch eine Diskette (!) bei? Das ist nicht nur
peinlich, sondern auch absolut &#252;berfl&#252;ssig. Das Geld, was man durch`s
wegrationalisieren spaaren w&#252;rde, k&#246;nnte man in eine bessere Vewaltung
stecken. St&#246;ren w&#252;rde es auch keinen, da jeder ernsthafte Amiganer &#252;ber ein
CD Laufwerk verf&#252;gt und man die Software der Disk auch bequem auf die Leser
CD brennen k&#246;nnte. Wer da anderer Meinung ist, der sollte sich unbedingt mal
zu Wort melden - die Erkl&#228;rung ist sicherlich sehr interessant....</P>

Ich k&#246;nnte hier noch wesentlich mehr &#252;ber diesen Verlag schreiben, aber das
w&#252;rde weder mir noch dem Verlag nutzen. Ich kann den Verantwortlichen nur
eines raten: Bringt etwas mehr Professionalismus im Bezug auf Abo`s &amp;
Verwaltung mit und alles ist in Butter. Denn inhaltlich ist die AmigaOS
sicherlich erste Sahne und auch die CD`s sind gar nicht &#252;bel auch wenn die
anderen CD Reihen (A+ / AmigaFuture) momentan einen kleinen Tick besser
sind.</P>

Hat jemand zur Abwechselung auch mal was positives &#252;ber den Verlag zu berichten? </P>





<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
