

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Preview: Ali Baba</TITLE>
</HEAD>
<BODY TEXT=black background="kback.png" link=silver alink=red>
<CENTER><h1><B>Ali Baba - Preview</CENTER></h1></B></P><HR>
<CENTER><img src="ali.jpg"></CENTER><BR>
<HR>
<FONT SIZE="+1">

Im Bereich der Jump &amp; Run`s war es in den letzten Monaten eher still gewesen
auf dem kommerziellen Amiga Sektor. Mit "Ali Baba" wurde nun ein neues Game
aus diesem Genre angek&#252;ndigt, welches von einem einzigen Programmierer
geschaffen wurde.</P>

Und diese Tatsache merkt man ehrlich gesagt in der Demoversion ganz extrem:
Die Grafik ist f&#252;r heutige Verh&#228;ltnisse einfach ungen&#252;gend und selbst zu
Hochzeiten des A500 hat es besseres gegeben. Wenn man sich die Grafik so
anschaut will man gar nicht glauben, da&#223; diese f&#252;r das AGA Chipset geschaffen wurde. So sind die
Levels nicht gerade als abwechselungsreich zu bezeichnen und auch die Gegner sehen relativ platt aus.
Wer sich davon aber noch nicht abschrecken l&#228;&#223;t, den erwartet zum einen ein
h&#246;chst durchschnittlicher Sound (Musik aus dem Orient mit einigen wenigen
modernen Elementen aufgepeppt) und zum anderen ein hundsmiserabeles
Gameplay, wobei wir auch bei der Hintergrundgeschichte, die verbl&#252;ffende &#196;hnlichkeiten mit &quot;Aladdin&quot; aufweist,
w&#228;ren:</P>

Alib Baba hat endlich das Versteck der 40 R&#228;uber entdeckt und ist auf der
Suche nach den Sch&#228;tzen, die diese erbeutet haben. Daf&#252;r ben&#246;tigt er aber
unbedingt 10 magische Lampen, die in den diversen Levels versteckt sind und
nat&#252;rlich von vielen Gegnern bewacht werden. Und nat&#252;rlich ist es die
Aufgabe vom Spieler, diese Lampen zu beschaffen, was angesichts der
Tatsache, da&#223; Ali Baba nur einen einfachen S&#228;bel mit sich f&#252;hrt, nicht als
einfach zu bezeichnen ist. Im weiteren Verlauf des Spiels kann der Spieler
seine Spielfigur aber noch mit einem Schild sowie mehr Lebensenergie
&quot;aufr&#252;sten&quot;.</P>

Soweit also die Hintergrundgeschichte zu Ali Baba, die sich zwar nett lesen
l&#228;&#223;t, aber garantiert auch nicht zur Langzeitmotivation beitragen wird. Das
Gameplay an sich beschr&#228;nkt sich auch darauf, stur gerade aus zu laufen, ein
bi&#223;chen zu springen, diverse Gegner abzustechen und nat&#252;rlich drauf zu
achten, da&#223; einem nicht zu viel Energie abgezogen wird - in Zeiten des C64
mag das ja noch als halbwegs passabel durchgegangen sein, aber heutzutage
ist diese Idee in etwa so interessant wie Windows. Da zudem die Steuerung
auch nicht ganz exact ist und der gute Ali Baba teilweise mit unfairen
Situationen konfrontiert wird (=&gt; ein Energieabzug ist nicht immer zu
vermeiden) kann man noch nichtmal auf ein gelungenes Gameplay verweisen und
Spielspa&#223; will wirklich nicht aufkommen. Um es klar auf den Punkt zu bringen: Die Zeit, die ich mit "Ali Baba" bisher verbracht habe um es hier vorzustellen, wird garantiert die letzte gewesen sein, die ich in dieses Spiel gesteckt habe - Spielspaﬂ & Motivation gleich null!
</P>

Weiterhin macht sich negativ bemerkbar, da&#223; &quot;Ali Baba&quot;  nur auf
unaufger&#252;steten Amiga`s lauff&#228;hig ist und nat&#252;rlich von Features wie RTG
oder AHI Support erst recht nix geh&#246;rt hat. Selbst eine
Festplatteninstallation ist bei der Endversion (die nat&#252;rlich auf Disketten
ausgeliefert wird) nicht vorgesehen, was den negativen Eindruck nur weiter
verst&#228;rkt.</P>

<h2><center><b>Fazit</H2></b></center></P><font size=+1>
F&#252;r mich ist es eine bodenlose Frechheit ein Game wie &quot;Ali Baba&quot;, das in
keinem Bereich konkurrenzf&#228;hig ist, heutzutage auf den Markt zu bringen und
daf&#252;r noch Geld zu verlangen. Der Preis von 35 DM ist immer noch total
&#252;berzogen und selbst eingefleischte Jump &amp; Run Fans sollten sich den Kauf
zweimal &#252;berlegen. Und ich waage einfach mal die niederschmetternde
Prognose, da&#223; &quot;Ali Baba&quot; selbst auf dem Freeware Sektor nur guter
Durchschnitt w&#228;re. Finger weg!</P><Center><img src="kit.gif"></P><br></Center>
<pre>
Name          : Ali Baba

Programmierer : Medici (der Programmierer selbst...)

Release       : 2.Quartal 2000

Preis         : 35 DM

Anforderungen : AGA Amiga

Empfohlen     : mehr wird nicht unterst&#252;tzt :-((

</PRE>
<hr>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
