
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Homeland - Preview</TITLE>
</HEAD>
<BODY TEXT=black background="kback.png" link=silver alink=red>
<CENTER><h1><b>Homeland - Preview</CENTER></h1></B></P><HR>
<CENTER><img src="hl.jpg"></CENTER><BR>
<HR>
<FONT SIZE="+1">
Echtzeitstrategiegames wurden in den letzten Monaten mehrfach angek&#252;ndigt,
aber wenn man mal von dem wirklich excellenten &quot;Exodus&quot; absieht, ist bisher
noch nicht alzu viel r&#252;bergekommen. Mit &quot;Homeland&quot; schickt sich ein weiterer
Titel an, den Kampf um den Amiga Thron in diesem Genre aufzunehmen; eine
spielbare Demoversion ist auch schon erschienen und befindet sich u.a. auf
der Future CD 23.</P>

Nachdem wir uns das h&#252;bsche Titelbild angesehen haben und uns dann schnell
im eigentlichen Spiel wiederfinden, macht sich erstmal Ern&#252;chterrung breit;
insbesondere was die grafischen Erg&#252;sse von &quot;Homeland&quot; angeht. So kann das
Spiel derzeit nur in einer Aufl&#246;sung von 320 X 256 gespielt werden und
Grafikkarten werden von vornherein nicht unterst&#252;tzt. Davon mal abgesehen
wirkt auch die Grafik an sich, trotz Benutzung des mitlerweile auch in die
Jahre gekommendem AGA Chipsatz, antiquiert. Die Geb&#228;ude, die in der
Demoversion zur Verf&#252;gung stehen (insgesmt 7), wirken total lieblos
gestaltet und Details lassen sich auch nicht ausmachen - selbiges gilt auch
f&#252;r die verschiedenen Fahrzeuge sowie das Gel&#228;nde an sich. Symptomatisches
Beispiel daf&#252;r ist, da&#223; man die kleinen blauen T&#252;mpel, die &#252;berall im Gebiet
zu finden sind, zun&#228;chst f&#252;r kleine Seen h&#228;lt, ehe man in der Anleitung
erf&#228;hrt, da&#223; es sich dabei um handels&#252;blichen Rohstoff handelt, um den sich
alles in &quot;Homeland&quot; dreht.</P>

Ok, lassen wir die grafische Seite mal aussen vor (Sounds gibt`s &#252;brigens
bisher &#252;berhaupt keinen) und widmen uns dem Spielgeschehen. Wie es sich f&#252;r
ein Echtzeitstrategiegame geh&#246;rt, muss man in &quot;Homeland&quot; seine eigene
Infrastruktur aufbauen, um m&#246;glichst schnell die umherliegenden Rohstoffe
aufzusammeln und weiterzuverarbeiten und daraus dann kriegstaugliche
Einheiten zu bauen, die den Gegner in die Schranken weisen können. Der Feind
versucht seinerzeit nat&#252;rlich das selbe und so darf man keine Zeit mit
gen&#252;sslichen Erkundungen des Landes verplempern. Da das Spielprinzip wohl
von &quot;Napalm&quot; oder &quot;Command &amp; Conquer&quot; von der Dose bekannt sein d&#252;rfte,
gehen wir mal zu den ern&#252;chternden Fakten von &quot;Homeland&quot; &#252;ber: Insgesamt
stehen in der Demo nur 7 Geb&#228;ude zur Verf&#252;gung (darunter typische wie
Kolonie Geb&#228;ude f&#252;r die Bev&#246;lkerung, Schulen, Hafen und
Herrstellungsfabriken f&#252;r die Fahrzeuge), was insgesamt nicht viel ist und
garantiert nicht zur Steigerrung der Langzeitmotivation beitr&#228;gt, da es ab
einer bestimmten Stelle immer nach dem selben Prinzip (erst das bauen, dann
das und dann das) abl&#228;uft. Im Vergleich zu &quot;Napalm&quot; oder &quot;Exodus&quot; zieht
&quot;Homeland&quot; also den eindeutig k&#252;rzeren; und wenn man dann noch anmerkt, da&#223;
dem Gegner in der aktuellen Demo auch noch die komplette k&#252;nstliche
Intelligenz fehlt (will sagen: Verteidung kennt dieser nicht), schaltet man
die Demo lieber gleich wieder ab...</P>

<h2><center><b>Fazit:</h2></CEnter></b></P>
<font size="+1">
Um es ohne Umschweife zu sagen: Die mir vorliegende Demo von &quot;Homeland&quot; ist
&#228;u&#223;erst schwach ausgefallen - sowohl was die technische als auch
spielerische Seite betrifft und ist somit ohne gro&#223;e Verbesserungen alles
andere als kommerziell verwertbar. Sollte man noch etwas an den
verschiedenen Faktoren (also Grafik, Gameplay &amp; Sound) arbeiten und diese
Arbeit so halbwegs aktzeptabel ausf&#252;hren, st&#228;nde einer Ver&#246;ffentlichung als
Shareware oder max. Low Budget Game nichts mehr im Wege. Allerdings wird das
wahrscheinlich noch etwas auf sich warten lassen - aber da wir bald ohnehin
&quot;Exodus&quot; k&#228;uflich erwerben k&#246;nnen, kann man &quot;Homeland&quot; getrost links liegen
lassen...</P><CENTER><img src="kit.gif"></CENTER><PRE>
Name          : Homeland

Publisher     : ???

Release       : ???

Preis         : ???

Anforderungen : 68020 CPU, AGA, OS 3.0, 2 MB Chip Ram

Empfohlen     : 68030 CPU, etwas Fast Ram
</PRE>
<HR>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
