
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Virtual Ball Fighters - Preview</TITLE>
</HEAD>
<BODY TEXT=black background="kback.png" link=silver alink=red>
<CENTER><h1><b>Virtual Ball Fighters - Preview</CENTER></h1></B></P><HR>
<CENTER><img src="vbf.jpg"></CENTER><BR>
<HR>
<FONT SIZE="+1">

Nachdem man von &quot;Virtual Ball Fighters&quot; (kurz: VBF) etwas l&#228;nger nichts mehr geh&#246;rt
hatte, ist nun endlich eine spielbare (RTG) Demoversion im Aminet
erschienen. Ob die italienische Softwareschmiede Hurrican Software (u.a.
&quot;Eat The Whistle&quot;, &quot;Escape Towards The Unknown&quot; etc.) damit einen
Meilenstein in der Spielegeschichte abliefert oder nicht, ist zum jetztigen
Zeitpunkt zwar noch nicht zu erkennen, aber f&#252;r ein Preview in der NC reicht
es allemal...</P>

Eines gleich vorweg: Einen Preis f&#252;r Innovationen wird &quot;VBF&quot; sicherlich
nicht gewinnen, denn im Grunde handelt es sich um nichts anderes als einen
weiteren Tetris Clone wie wir sie schon zu gen&#252;ge aus dem Aminet kennen. So
hat man bei &quot;VBF&quot; prim&#228;r die Aufgabe die vom oberen Bildschirmrand
runterfallenden Murmeln, die jeweils im Dreierpack und unterschiedlichen Farben
auf den Spieler zukommen, so zu sortieren, da&#223;
mindestens drei gleichfarbige Murmeln horizontal, vertikal oder auch
diagonal in einer Reihe liegen.</P>

Das man mit diesem (zugegebernerma&#223;en s&#252;chtig machenden) Spielkonzept
lediglich eine kommerzielle Pleite heraufbeschw&#246;rt, d&#252;rfte jedem klar sein -
und gl&#252;cklicherweise haben das auch die Jungs von Hurrican Software erkannt
und das Spiel nur um diese Idee herum aufgebaut. So wird es im Spiel
beispielsweise diverse Boni geben (u.a. kann man mit dem richtigen Extra
daf&#252;r sorgen, da&#223; die Kugeln beim Gegner schneller runterfallen) und
zus&#228;tzlich gibt`s noch 8 verschiedene K&#228;mpfer, die allesamt &#252;ber
verschiedene Eigenschaften verf&#252;gen. Angereichert wird das Konzept noch durch 6 verschiedene Spiel Varianten,
verschiedene Schwierigkeitsstufen und verschiedenen Backgrounds.</P>

Aber selbst diese Features werden einige von Euch sicherlich noch nicht
restlos &#252;berzeugen k&#246;nnen. Aber keine Angst, die technische Seite wird auch
die noch verbliebenen Pessimisten &#252;berzeugen k&#246;nnen: So wird es in der
Endversion insgesamt 13 Audio Tracks mit einer Gesamtspielzeit von &#252;ber 40
Minuten geben. Auch PPC und Grafikkartensupport wird geboten und mit
letzterem ist sogar eine Aufl&#246;sung von 640 X 480 m&#246;glich, wobei es sogar
spezielle 16 und 24 bit Grafiken geben wird. Kein Wunder, denn immerhin soll
die Endversion 45 MB an Grafiken in der AGA bzw. 70 MB an Grafiken in der
RTG Version enthalten. Wenn man jetzt noch bedenkt, da&#223; jeder K&#228;mpfer mehr
als 100 Animationsframes enthalten soll, kann man sich sicherlich schon
jetzt auf einen grafischen Genuss der Extraklasse freuen. Ein Intro wird es
selbstredent auch geben und diverse Zwischenanimationen sind ebenfalls
eingeplant - insgesamt rechnet man mit 400 MB an Animationen.</P>

Somit ist die kalkulierbare Rechenpower f&#252;r einen &quot;Tetris&quot; Clone auch nicht
von schlechten Eltern: Ein AGA Amiga mit mind. OS 3.0 nebst 68030 CPU, CD Rom Laufwerk und
8MB Fast Ram sind das absolute Minimum. Fairerweise sollte man erw&#228;hnen, da&#223; das Spiel mit dieser
Konfig. alles andere als annehmbar laufen wird; so ben&#246;tigt die RTG Version
schon einen 68040 Prozessor und eine Grafikkarte sei ebenfalls dringend
empfohlen, wenn man das Game auch fl&#252;ssig in vern&#252;nftigen Aufl&#246;sungen
spielen will. Unerst&#252;tzt werden ferner der PPC, AHI, RTG sowie die Benutzung
diverser Eingabeger&#228;te (Joypad, Joystick, Tastatur).</P>

<b><u>Fazit:</B></U><BR>
Aufgrund der Tatsache, da&#223; man in der Demo nur ein Bruchteil des fertigen
Games bewundern kann (es fehlen nat&#252;rlich Intro, Audio Tracks und &#228;hnliche
Schmankerl), ist es recht schwierig ein Fazit &#252;ber &quot;VBF&quot; festzuhalten. Das
Game ist im jetztigen Stadium schon &#228;u&#223;erst gelungen und macht zudem recht
schnell s&#252;chtig. Von dieser Seite gibt es schonmal keinen Einwand und ich
bin mir sicher, da&#223; auch die technische Seite vollkommen &#252;berzeugen kann,
wenn man h&#228;lt, was man an Extras in das Spiel einzubauen gedenkt. Aber das
werden wir wohl erst erfahren, wenn die Vollversion ausgeliefert wird.
Sollte dies der Fall sein, wird &quot;VBF&quot; auf jeden Fall ein potentieller Hit!</P>
<CENTER><img src="kit.gif"></P><BR><PRE></CENTER>

Name          : Virtual Ball Fighters</P>

Publisher     : Epic Marketing</P>

Release       : 1. oder 2. Quartal 2000</P>

Preis         : Fullprice Game</P>

Anforderungen : AGA Amiga, OS 3.0, 68030, 8 MB Fast Ram, CD Laufwerk</P>

Empfohlen: Amiga mit GraKa, 68040 / 060 / PPC, 16 MB Fast Ram</P></PRE>


<HR>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
