<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<body background="jd-back.png">

<center>
<h1>
Funk Kopfh&ouml;rer
</h1>
</center>

<h3>
Hallo Leute.</h3>
Ich wei&szlig;, das das ein Teil ist, das nichts mit dem Amiga zu tun hat,
aber um die NoCover voll zu bekommen ist es nicht schlecht. Oder?
<br>Also in diesem Artikel geht es um einen Funk Kopfh&ouml;rer von <b>VIVANCO</b>
<br>Dieses sch&ouml;nem kleine Ger&auml;t kommt in eine, kleinem karton
zu euch nach hause. Wenn man sich ein wenig mit Technik auskennt, kann
man das Ding auch ohne Problemme in betrieb nehmen. Das einzige was ich
nicht auf anhieb gefunden habe ist das Bateriefach der H&ouml;rer.
<br>Also das Ger&auml;t wird ausgeliefert mit einem Funk-H&ouml;rer ;-)
einem Netzteil, einem Kabel, mit dem man den H&ouml;rer wieder aufladen
kann und einem Audio-anschlu&szlig; kabel, das man mit einem Klinkenstecker
in die Station steckt. Am anderem ende befinden sie allerdings zwei Chinch-stecker,
mit denen man z.B. den Amiga anschlie&szlig;en kann. Nat&uuml;rlich sind
die Audio-Signale auch wieder rausgef&uuml;hrt und man kann z.B. seinen
Vert&auml;rcker ect. &uuml;ber zwei Chinch-stecker anschlie&szlig;en.
<br>Als besonders erw&auml;nenswert befinde ich einmal die Baterieladekontrolle,
die mir anzeig, wie voll die Akkus sind, und als besonderes Highlight hat
die Station auch noch eine Aussteueranzeige f&uuml;r Links und Rechts.
Das Display ist auserdem noch beleuchtet.
<hr>Alles in allem kann ich dieses Ger&auml;t mit ruhigem Gewissen weiterempfehlen,
da man mit dem Ding eigendlich nichts falsch machen kann.
<br>Ich habe diesen Funk Kopfh&ouml;rer (der &Uuml;brigens mit 863 Mhz
auf 3 Kan&auml;len arbeitet) bei <a href="http://www.conrad.de">Conrad
Elektrink</a> gekauft. die Bestellnummer lautet: 38 20 10-33 und kostet
149.-DM. Die Reichweite betr&auml;gt &uuml;brigens laut beschreibung 100
Meter.
<hr>Fassen wir also zusammen:
<br>&nbsp;
<center><table BORDER COLS=2 >
<tr VALIGN=TOP>
<td WIDTH="80">Zubeh&ouml;r</td>

<td>Basis-station
<br>Funkkopfh&ouml;rer mit Baterien
<br>Verbindungskabel zum
<br>Aufladen des Funkh&ouml;rers
<br>Audio-Anschlu&szlig;leitung
<br>Netzteil</td>
</tr>

<tr VALIGN=TOP>
<td>Technische Daten</td>

<td>230V 50Hz ~
<br>100 Meter Reichweite
<br>863 Mhz auf 3 Kan&auml;len</td>
</tr>

<tr VALIGN=TOP>
<td>Bezugsquelle</td>

<td>Conrad Elektronic
<br>Bestellnummer 38 20 10-33
<br>149.-DM</td>
</tr>
</table></center>

<p>
<hr>
Ich hoffe, das ich auch nichts vergessen habe. Wenn ihr fragen habt, könnt ihr mich neuerdings auch anmailen. Wäre aber lieber per NoCover, da ich erstens jetzt beim Bund bin und au&szlig;erdem müßen wir die NoCover voll kriegen. Ok?
<br>
Auf bald, last mal von euch lesen.
<hr>
<center><a href="mitglieder/brunen.html"><img SRC="john_doe.png" BORDER=0 ></a></center>

</body>
</html>
