<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief von Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=blue alink=red>
<h1><center><font color="green">Leserbrief von Kilian &quot;The Bruce&quot; Servais</FONt></CENTER></H1></P>

<a href="#yonder.html">An Yonder</A><BR>
<a href="#wolf.html">An Wolf</A><BR>
<a href="#sascha.html">An Sascha</A><br>
<a href="#top.html">Top 5</A></P>
<hr>
<a name="yonder.html">
<b>Hi Yonder!</B><BR>
Was ist eigentlich mit der Multimedia-Ecke los? Keine Zeit oder keine Lust
mehr? Insbesondere in Zeiten, wo es mit der NC ohnehin nicht mehr so gut
aussieht, ist jeder Artikel wichtig.</P>

Aber eigentlich ging es mir mehr um die Metal Corner und dabei nat&#252;rlich
prim&#228;r um Deinen Comment aus der letzten NC. Was meintest Du denn mit &quot;Bitte
schwarz als Hintergrundfarbe&quot; ? Ist die Schrift etwa schlecht zu lesen oder
sieht es bei anderen Browsern (ich benutze IBrowse) nicht so gut aus? Sollte
dies der Fall sein, so werde ich nat&#252;rlich in Zukunft wieder auf Schwarz
als Hintergrundfarbe setzen. Also kl&#228;re mich am besten mal per NC auf; bis
dahin lasse ich erstmal alles beim alten (zumal die beiden Ausagben, die in
dieser NC zu finden sind, schon seit Tagen fertig sind und die n&#228;chste Issue
im Grunde auch schon komplett gef&#252;llt ist). Danke auch f&#252;r den vierfachen
Eintrag in Deinen Top 9!</P>
So, bis dann mal!</P>
<hr>
<a name="wolf.html">
<b>Hi Wolf!</B><BR>
Aufgrund von diversen Problemen ist es mir leider momentan nicht m&#246;glich,
irgendwelche E-Mails abzuholen oder zu versenden, weswegen Du wahrscheinlich
seit einiger Zeit keine Post mehr von mir bekommen hast. Deswegen folgt hier
jetzt erstmal die E-Mail, die ich Dir eigentlich schon vor Wochen zukommen
lassen wollte:</P><i>


Hallo Wolf!</P>

Ich glaube Du hast mich bezgl. des Clubbtreffens v&#246;llig falsch verstanden.
Der Satz &quot;Dank Deines Angebotes habe ich ja nun gar keine andere Chance mehr
als dort aufzutauchen&quot; war scherzhaft gemeint - deswegen auch der Smiley
dahinter. Ich bin Dir wirklich ziemlich dankbar f&#252;r Dein Angebot und werde
auch drauf zur&#252;ckkommen. Und um ehrlich zu sein: Ich freue mich jetzt schon
auf das Treffen, da man so mal die Chance hat, alle Leute kennenzulernen und
sich mal gr&#252;ndlicher auszutauschen.</P>

Sieht man sich eigentlich dieses Jahr in Neuss am 10 &amp; 11.6?? Ich werde dort
ebenfalls mal am Samstag vorbeischauen und ich hoffe, da&#223; dieses mal (im
Gegensatz zur HEW `99) dort auch ein APC &amp; TCP Treffen stattfindet. Auch
wenn ich vom Konzept her nicht alzu viel von einer gemischten Amiga &amp; Atari
Messe halte.</P>

Den Daniel Stein werde ich bei Gelegenheit mal kontakten und in Erfahrung
bringen, wie das jetzt genau aussieht. Also irgendwie l&#228;uft im Bezug auf das
Clubtreffen alles etwas chaotisch ab :-)))</P>

Herzlichen Gl&#252;ckwunsch auch nachtr&#228;glich zu Deinem 60. Geburtstag, aber
dadurch, da&#223; die NC nicht erschienen ist, habe ich das doch glatt vergessen.
Ohnehin war es eine richtig merkw&#252;rdige Zeit ohne NC - obwohl die neue heute
(3.4.00) auch noch nicht da ist. Wird aber bestimmt im Laufe der Woche
ankommen.</P>

Und wo wir gerade bei der NC sind: Jetzt habe ich vom Andi doch glatt einige
neue Testmuster erhalten und rate mal, was dabei war.... unsere viel
diskutierte Glow Icon CD! Ich glaube wir h&#228;tten uns viel Aufwand schenken
k&#246;nnen, wenn wir noch einige Wochen abgewartet h&#228;tten. Aber immerhin brauch
ich dann dar&#252;ber keinen neuen Testbericht schreiben!</P>

Was die Amiga Topcool angeht: Ich bin mir sicher, da&#223; das Projekt was werden
k&#246;nnte, zumal eine kleine Konkurrenz dem Zeitschriftenmarkt gut tun w&#252;rde.
Der Falke Verlag ist einfach nur total unf&#228;hig (ich habe die Plus im Abo -
einen Fehler, den ich nicht nochmal machen werde!) und beileibe nicht mehr
so engagiert wie am Anfang. Traurig, aber leider wahr...</P>

Was die Future angeht: Du solltest zumindest mal einen Blick in die aktuelle
Issue werfen; dann wirst Du vielleicht die Future mit ganz neuen Augen
betrachten. Ach was w&#252;rde ich daf&#252;r geben, dort als Redakteur t&#228;tig zu
werden...</P>

So, ich muss jetzt noch einige andere Mails schreiben und mache hier erstmal
Schluss. See ya,</P>


Kilian &quot;The Bruce&quot; Servais</P></I>

So, da&#223; dann dazu und jetzt zu etwas komplett anderem: Von Dir als einer der
flei&#223;igsten Schreiber tituliert zu werden freut mich nat&#252;rlich enorm und
Deine Bef&#252;rchtung, da&#223; auch ich mich an der aktuellen Motivationslosigkeit
anstecken k&#246;nnte, kann ich hiermit auch sofort entkr&#228;ften - soweit ich in
Zukunft Zeit habe, werde ich diese in die NC stecken und monatlich meine
paar Artikel beisteuern. Und es w&#228;re doch gelacht, wenn wir das alte
Flagschiff der Diskmags, die NC, nicht wieder flott kriegen w&#252;rden. Mit den
besten Gr&#252;&#223;en!</P>
<hr>
<a name="sascha.html">
<b>Hi Sascha!</B><br>
Erstmal wollte ich Dir ein Kompliment bezgl. Deiner Pl&#228;ne f&#252;r die Zukunft
der Mitgliederliste aussprechen, denn diese hat eine Modernisierung
dringenst n&#246;tig. Deswegen wollte ich Dir auch mitteilen, da&#223; meine Daten
soweit noch aktuell sind, wenn man mal davon absieht, da&#223; beim A4000 OS 3.0
steht. Mitlerweile habe ich OS 3.5 im Einsatz und es w&#228;re nett,
wenn Du das dementsprechend ab&#228;ndern w&#252;rdest.</P>

Und auch ansonsten finde ich es richtig toll, da&#223; Du die NC mit so vielen
Artikeln tatkr&#228;ftig unterst&#252;tzt. Mach also bitte weiter so und ich bin mir
sicher, da&#223; die NC bald wieder im alten Glanz erstrahlen wird. Read you!</P>
<hr>
<a name="top.html">
<h1><center><font color="yellow">Top 5</FONT></CENTER></h1></P>

1. Digitale Streifz&#252;ge von Cord (einfach unbeschreiblich)<br>
2. Web Design von Wolf (gute Zusammenfassung seiner Workshops)<br>
3. 68000 &amp; MP3 von Sascha (interessant)<br>
4. Astro Corner #12 von Lars (erneut gut)<br>
5. Da gehn`s hin von Sascha (sehe ich &#228;hnlich)</P>





<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
