<HTML>
<HEAD>
<meta name="author" content="Sieglinde Peters"
<TITLE>Leserbrief Sieglinde Peters</TITLE>
</HEAD>
<body background="l_bg.gif" text=black link=Blue alink=red>
<CENTER>
<IMG SRC="briefm.gif">
<P><H1><Font Color=red>Heute  gibt es Nachrichten für:</H1></P>
<Font Size=5>
</center>
<UL Type="Circle">
<li><a href="#1">Andreas Magerl</a>
<li><a href="#2">Kilian Servais</a>
<li><a href="#3">An Alle</a>
<li><a href="#4">Und zum Schluß die Top 5 der NC 73"</a>
</UL>
<HR>
<a Name="1"><br>
<b>Andreas Magerl</b> <br>
</Font Size=5>
<Font Color=black Font Size=3>
Sch&#246;n, da&#223; Du wieder aus dem Krankenhaus entlassen bist. Hoffentlich geht
es Dir jetzt auch gesundheitlich wieder besser. Wir haben Dich und die
NoCover vermi&#223;t.
<br>
<hr>
</Font Size=3>
<Font Size=5>
<a Name="2"><BR>
<b>Kilian Servais</b><br>
<Font Color=Black>
</Font Size=5>
<Font Color=black Font Size=3>
Nein, ich habe noch keinen PC in meinem B&#252;ro stehen. Ich werkel immer
noch auf meinem Amiga herum. Bis jetzt habe ich den Kauf eines neuen 
Computers immer wieder hinausgez&#246;gert, weil mir der Wechsel auf ein
anderes System eben nicht so leicht f&#228;llt. In mein bestehendes Amigasystem
werde ich jedoch nichts mehr investieren. Wenn sich die neuen 
Ank&#252;ndigungen aber wieder nur als hei&#223;e Luft erweisen und kein neuer
Amigarechner auf den Markt kommt, dann mu&#223; ich einfach wechseln, denn
auf Dauer macht das Arbeiten auf so einem veralteten Rechner auch keinen 
Spa&#223;
<br>
<hr>
</Font Size=3>
<Font Size=5>
<a Name="3"><BR>
<b>An Alle</b><br>
<Font Color=Black>
</Font Size=5>
<Font Color=black Font Size=3>
Endlich ist die es soweit, die NoCover wieder da. Durch die
Terminverschiebungen gab es eine gr&#246;&#223;ere L&#252;cke und man vermi&#223;t Dinge
manchmal tats&#228;chlich erst, wenn sie nicht mehr in gewohnter Weise da sind.
<p>
Hoffentlch kommt jetzt wieder etwas mehr Leben in den Club. Es haben sich 
ja inzwischen eine Menge Mitglieder verabschiedet. Das ist zwar sehr 
bedauerlich, aber irgendwie auch verst&#228;ndlich. Die Flaute beim Amiga zieht
nat&#252;rlich  eine Flaute bei den Mitgliedern nach sich.
 Wenn es kaum
Neuank&#252;ndigungen auf dem Markt gibt, dann gibt es zwangsl&#228;ufig auch
weniger interessante Themen, &#252;ber die man schreiben kann.
<br>
 Man braucht sich
ja nur die letzte Ausgabe der AmigaOS genauer anzusehen:
 Ich jedenfalls habe
darin nur sehr wenig interessantes gefunden.
<p>
 Higgins hat mit seinem
Diskussionsbeitrag wieder so etwas wie neue Hoffnung in die Amigalandschaft 
gestreut. Wenn diese neue Chance aber auch wieder ungenutzt verstreicht, 
sehe ich kein Licht mehr am Horizont. Was mir gro&#223;e Sorgen macht, ist der
geschrumpfte Markt im Amigabereich. Es gibt nur noch sehr wenige H&#228;ndler,
die Amigaware vertreiben, der Zeitschriftenmarkt ist geschrumpft. Wo 
bekomme ich dann objektive Testberichte &#252;ber die neue Hard und Software
her und wer verkauft mir die Ware dann und wie wird der Service geregelt? 
<br>
In meinem n&#228;heren Umfeld ist jetzt schon keine Hard-und Software zu
bekommen. Aber wir haben so lange gewartet, da kommt es jetzt auf ein paar 
Monate mehr oder weniger auch nicht an.
<p>
<hr>
</Font Size=3>
<Font Size=5>
<a Name="3"><BR>
<b>Top5 der letzten NoCover</b><br>
<Font Color=Black>
</Font Size=5>
<Font Color=black Font Size=3>
WEB-Design Workshop Wolf Zimmer<br>
5 Spieletests von Kilian Servais<br>
Da geh`ns hin von Sascha van Wahnem<br>
Astro-Corner von Lars Philipsen<br>
Wolf-Info von Wolf Zimmer<br>
<p>
<hr>
Viele Grüße<br>
Sieglinde Peters<br>
<img src="compwom.gif" ALIGN=right ALT="amigaOs.gif" WIDTH=88 HEIGHT=88><p>
</FONT></BODY>
</HTML>




