<HTML>
<HEAD>
<TITLE>APC & TCP</TITLE>
</HEAD>
<BODY BACKGROUND="l_bg.gif" TEXT=#000000 LINK="#0000FF" VLINK="#000080" ALINK="#FF0000"
 BGCOLOR="#FFFFF4">
<CENTER>
<P><H2>Betreffend "DiskSalv" !</H2></P><BR>
<P><H4>Einige Bemerkungen zu diesem Programm und anderes! </H4></P>
</CENTER><br>
Ich wei&szlig; nicht wie ich beginnen soll ! Fangen wir einfach an. Das ganze Dilemma begann damit, da&szlig; ich mir die neue Version der Amiga-Workbench auf der letzten Messe in K&ouml;ln gekauft habe.<br>
Nach mehrmaligen vergeblichen Versuchen die Version OS 3.5 auf
meinem AMIGA zu installieren, wegen des fehlenden Speicherplatzes, habe ich angefangen diverse Programme und Dateien auf eine andere Partition auszulagern. Dann hatte ich
gen&uuml;gend Platz und ich konnte einen neuen Versuch starten. Es klappte. Dann ging das probieren los. Vieles hat mir nicht gefallen. Die Icons bekamen ein anderes Aussehen, nicht alle !
Und die waren dann nicht besonders sch&ouml;n. Mein weniger Chip-
Speicher schrumpfte immer mehr zusammen. Dann klappte auf einmal
mein CD-Rom-Laufwerk nicht mehr. Eine CD hing drin und wollte nicht mehr heraus. Vieles habe ich probiert. Ein Besuch bei einem Amiga-Fan in der n&auml;heren Umgebung (90 km) war dann die
L&ouml;sung. Ein neues Laufwerk mu&szlig;te her. Mit diesem mu&szlig;te ein neues
Treiber-System installiert werden. "SPEEDUP" ist endg&uuml;ltig verbannt worden. Auch die zweite Festplatte mu&szlig;te ich entfernen, da ich sonst noch wieder einen neuen Adapter gebraucht h&auml;tte. Jetzt habe ich zwar nur noch eine Festplatte in meinem geliebten AMIGA aber es funktioniert wenigsten etwas.
Allerdings habe ich beim weiteren herumprobieren meine 2. Partition "geliefert". Ich konnte sie nicht mehr ansprechen und meine ganzen ausgelagerten Programme standen nicht mehr zur Verf&uuml;gung.<br>
Nun war guter Rat teuer !<br>
Ein altes "DiskSalv"-Programm benutzt, aber es klappte nicht.
Das Programm war &uuml;berfordert mit den mehreren MB gro&szlig;en und kleinen Dateien. Ich beschaffte mir die CD "AMIGA REPAIR KIT"
von der Schatztruhe. Da ich auch mit "RDB-Salv" nicht weiter
kam.<br>
Jetzt wollte ich mich mit der Guide-Datei von "DiskSalv" erst einmal richtig schlau machen. Aber die Datei hatte irgendeinen
Fehler. Habe viele Versuche unternommen, den Fehler zu finden. Es gelang mir nicht.<br>
Dann fiel mir ein, da&szlig; der gute Wolf Zimmer ein<font face="MS Sans Serif"></font> "GUIDE-Macher" im wahrsten Sinne des Wortes ist. Ich habe ihn angeschrieben.<br>
Und was soll ich Euch sagen, er hat den Fehler zwar auch nicht
gefunden, mir aber die ganze Datei in einem Format zugeschickt,
welcher auch auf einem "PC" zu lesen und zu gebrauchen ist.<br>
Er ist wirklich ersten ein sehr t&uuml;chtiger AMIGA-Experte und zweitens ein sehr hilfreicher Mensch.<br>
Ich war sehr froh und bin ihm sehr sehr dankbar !<br><br>
Nun, ich mu&szlig; Euch n&auml;mlich gestehen, langsam hatte ich es satt, mich mit dem AMIGA herumzuplagen. Es machte einfach keinen Spa&szlig; mehr. &Uuml;berall nur Fehler, nichts ging mehr richtig und meine vielen sch&ouml;nen Programme waren nicht anzusprechen. Lange Rede kurzer Sinn, ich habe mir einen PC zugelegt mit einem sch&ouml;nen gro&szlig;en Bildschirm und einen neuen Drucker dazu. Jetzt konnte ich wenigsten wieder meine vielen e-Mail-Partner anschreiben, meine Post wieder in empfang nehmen usw. usw.<br>
Ich mu&szlig;te mich zwar auch hier erst an viele Dinge gew&ouml;hnen und
vieles lesen und lernen, aber ich war mit mir ganz zufrieden. Ich brauchte mich nicht &uuml;ber die vielen englischen Texte zu &auml;rgern und so konnte ich bald richtig loslegen.<br>
Jedenfalls war der AMIGA erst einmal "abgemeldet".<br><br>
Aber jetzt bin ich doch total vom Thema abgekommen - ich mu&szlig;
Euch n&auml;mlich noch schreiben, da&szlig; ich den Fehler mit der "Guide-Datei" auch den Leuten bei der Schatztruhe mitgeteilt habe. Sie haben sich der Sache angenommen, denn den Fehler konnten sie auch nicht sofort reparieren. Sie wollen mir die
fehlerlose Datei dann per e-Mail zuschicken. Bin gespannt wann dies sein wird.<br>
Nun aber zu meiner 2.Partition der Festplatte.<br>
Mit der neuen Version von DiskSalv habe ich dann angefangen meine Daten retten zu wollen. Erst einmal wurde sie wieder g&uuml;ltig gemacht, dann habe ich den ganzen Wust an Daten eingescannt und mit der Version "Bergung" mir dann alle in eine
Schublade gepackt. Jetzt kommt das gro&szlig;e "ABER": Viele Daten
sind nicht mehr lesbar, weder mit einem ASCII-Schreibprogramm,
noch in "HEX" oder sonst einem Anzeiger. Auch Programme laufen
nicht mehr und Bilder kann mir auch nicht anschauen.<br><br>
Jetzt m&ouml;chte ich von Euch wissen, ob ich bei der R&uuml;ckg&uuml;ltigmachung eventuell einen Fehler gemacht habe.<br>
Ich mu&szlig;te mich n&auml;mlich entscheiden zwischen 50% FFS und 50%
eines anderen Filesystems (den Namen habe ich vergessen). Ich
hatte mich f&uuml;r FFS entschieden.<br>
Wie w&auml;re es, meint einer von Euch dies genau zu wissen ?
Inzwischen war ich so frustriert, da&szlig; ich die Platte neu formatiert habe und habe mich entschlossen, beim AMIGA ganz von
vorne zu beginnen.<br><br>
So, dies war es was ich inzwischen mit meinem AMIGA erlebt habe.
Ich w&uuml;nsche es keinem !<br>
<HR>
<BR>
<img src="burg.gif" width="40" height="40" border="0" alt="Burg" align=right hspace=10>
von: &#160;<a href="Mitglieder/nuenninghoff.html">Rolf Nue. aus Wue.</a><br>
E-Mail:<a href="mailto:093113563-0001@t-online.de">
093113563-0001@t-online.de</a><p>
</P>
<HR>
</BODY>
</HTML>