<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
<td VALIGN=TOP WIDTH="445" HEIGHT="205">
<div align=right><font color="#3333FF">hier k&ouml;nnen Sie Ihre News&nbsp;</font>
<br><font color="#3333FF">per eMail aufgeben: <a href="mailto:a.goukassian@falke-verlag.de">info@falke-verlag.de</a></font></div>
<b><font face="Arial,Helvetica"></font></b>
<br>&nbsp;
<p>&nbsp;
<br><b><font face="Arial,Helvetica">Messe-Promotion rollt an ... (22.04.2000)</font></b><b><font face="Arial,Helvetica"></font></b>
<p><font face="Arial,Helvetica">In den Tagen nach Ostern wird die Bewerbung
der gro&szlig;en „World of Alternatives“ ausgeweitet. Ein Presse-B&uuml;ro
wird &uuml;ber 400 deutschsprachige IT-/Computer-Fachzeitschriften sowie
die lokale Fachpresse mit ausf&uuml;hrlichen Informationen zur gro&szlig;en
AMIGA- und ATARI-Messe versorgen.</font>
<br><font face="Arial,Helvetica">Die Computersendungen von 3SAT und WDR
werden in ihren kommenden Ausgaben ausdr&uuml;cklich auf die Messe hinweisen.</font>
<br><font face="Arial,Helvetica">Dar&uuml;ber hinaus wird der Veranstalter
insgesamt 30.000 aktive AMIGA- und ATARI-Anwender direkt anschreiben und
mit der geplanten Messe-Zeitung versorgen.</font>
<br><font face="Arial,Helvetica">Eine englischsprachige Web-Site ist f&uuml;r
den Zeitraum 2. Mai-Woche geplant.</font>
<br><font face="Arial,Helvetica">Dar&uuml;ber hinaus wird der erste offizielle
Messe-Standplan ab dem 5. Mai auf diesen Web-Sites ver&ouml;ffentlicht.</font>
<br><b><font face="Arial,Helvetica"></font></b>&nbsp;
<p><b><font face="Arial,Helvetica">Vortr&auml;ge mit VGA-Projektor (07.04.2000)</font></b>
<br><font face="Arial,Helvetica">In Absprache mit Petro Tyschtschenko von
AMIGA Deutschland wird AMIGA f&uuml;r einen der beiden Vortragsr&auml;ume
einen VGA-Projektor zur Verf&uuml;gung stellen. Wenn Sie als Besucher,
Programmautor oder Aussteller Interesse haben, Pr&auml;sentationen, Workshops
etc. auf der Messe anzubieten, dann setzen Sie sich bitte mit uns in Verdingung.
</font>
<br>&nbsp;
<p><b><font face="Arial,Helvetica">STEmulator 2.0 kommt zur Messe (07.04.2000)</font></b>
<br><font face="Arial,Helvetica">Der Falke Verlag hat angek&uuml;ndigt,
zur Amiga- &amp; ATARI-Messe in Neuss die aktuelle und neueste Version
des beliebten Atari-Emulators f&uuml;r PCs direkt auf der Messe anzubieten.
Eine Liste registrierter User wird vorhanden sein, so da&szlig; Sie vor
Ort g&uuml;nstige Updates erwerben k&ouml;nnen. Aktuelle Infos zum STEmulator
erhalten Sie ab dem 20.04.2000 unter <a href="http://www.stemulator.de">www.stemualtor.de.</a></font>
<br><b><font face="Arial,Helvetica"></font></b>&nbsp;<b><font face="Arial,Helvetica"></font></b>
<p><b><font face="Arial,Helvetica">Amiga&acute;s Auftritt (05.04.2000)</font></b>
<br><font face="Arial,Helvetica">W&auml;hrend eines rund einst&uuml;ndigen
Gespr&auml;ches mit Petro wurde best&auml;tigt, da&szlig; Amiga an der
Neusser Messe teilnehmen wird! Ein eigener Stand wird sich insofern noch
nicht rentieren, als Amiga auf dieser Messe noch nichts zu verkaufen hat.
Allerdings sind mehrmals t&auml;glich Vorf&uuml;hrungen des neuen Amiga-Systems
in Rahmen von Pressekonferenzen und Workshops geplant. Voraussichtlich
werden neben Petro auch Bill McEwan und Fleecy Moss die Systeme vorstellen.
Parallel hierzu stellen sie sich den Fragen der Besucher nicht nur im Rahmen
der Vorf&uuml;hrungen, sondern auch direkt am Stand des Falke Verlags.
Promotion-Items, Autogramme usw. werden wie immer gern von Petro und den
anderen vergeben. Wir d&uuml;rfen sehr auf die Vorf&uuml;hrungen gespannt
sein.</font>
<br>&nbsp;
<br>&nbsp;</td>
</tr>

<tr>


<td WIDTH="8">&nbsp;</td>

<td WIDTH="445">&nbsp;</td>
</tr>
</table>

</body>
</html>
