<html>
<head>
<meta name="description" content="Wolf-INFO">
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="wolf1.gif" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" bgcolor="#808080">
<font color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td></tr></table
<table border="0" cellpadding="5"><tr><td>
<a href="mitglieder/zimmer.html">
<img src="st_wolfinfo.jpg" width=100 height=100 border=0 align=left></a></td>
<td><ul><center><font color=blue> I n h a l t </font></center>
<li> <a href="#a1"> Randa ist wieder da </a></li>
<li> <a href="#a2"> Internet-Provider </a></li>
<li> <a href="#a3"> Online-Geld </a></li>
<li> <a href="#a4"> Feedback </a></li>
</ul></td></tr></table><br clear=all>
<hr>
<table border=0 width=100% cellpadding=6><tr><td>

<p align=center><a name="a1"><font color="800000" size="5">
<b>Randa fehlt immer noch!!! </font></b></a></p>
<p>
<img src="st_wolfinfo1.gif" align=left width="160" height="160" hspace="6">
Es sieht so aus, dass Thomas &uuml;berhaupt nicht geahnt hat, dass mein
voriger Artikel erscheinen w&uuml;rde und ich die Frage nach Randa stellen
w&uuml;rde. Vielleicht geh&ouml;ren meine sehnlichsten W&uuml;nsche in ein
Luftschloss und Thomas empfängt meine ausgesandten telepathischen
Strahlungen nicht. Wer wei&szlig;? Ist ja alles auch &quot;Wurscht&quot;.
Hauptsache Randa kommt bald wieder. </p>

<p>Aber nicht nur Randa erfreute unsere Gem&uuml;ter, auch die Spacys
sollen aus den unendlichen Weiten des Weltraum wieder aufgetauchen und sich
der Verschleppung im Netz entziehen. Ich bin schon gespannt, wie dies
weitergehen soll. </p>

<br clear=all>


Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a2"><font color="800000" size="5">
<b>Wohin mit meiner Homepage?</font></b></a></p>

<p>Noch vor einigen Jahren war die Situation einfach: Es gab drei
gro&szlig;e &quot;Zubringer&quot; zur Datenautobahn: AOL, CompuServe und
T-Online. Dagegen gab es auch ein paar kleinere Anbieter f&uuml;r
Firmenkunden zu horrenden Preisen oder mit etwas fragw&uuml;rdigen
Angeboten. Inzwischen hat sich die Marktsituation ge&auml;ndert: Es traten
neue Anbieter auf den Markt wie Metro oder die Mobilfunkbetreiber. Die
Preise gerieten in Bewegung, noch nicht so stark wie auf dem Telefonmarkt,
aber immerhin. Alle gro&szlig;en Provider bieten die M&ouml;glichkeit, bei
ihnen die private Homepage zu ver&ouml;ffentlichen. Die Internet-Preise
kennen wir alle: einmalige &quot;Aufnahmegeb&uuml;hr&quot; und eine
monatliche Grundgeb&uuml;hr (wobei der Platz f&uuml;r die Homepage eine
Zugabe ist). Wechselt man nun aus welchen Gr&uuml;nden auch immer seinen
Provider, muss die Homepage ebenfalls mit umziehen. Ideal w&auml;re also
ein neutraler Ort, unabh&auml;ngig vom Provider f&uuml;r den Netzzugang.
</p>

<p>Angenommen, wir wollen unsere Homepage nun an einem neutralen Ort
unterbringen. Am besten an einem Platz, der wenig oder am besten gar nichts
kostet. Es gibt inzwischen zahlreiche Firmen, die viel Geld in riesige
Festplattensysteme investieren, allerdings von den Benutzern dieser
Festplatten kein Geld verlangen. Sind diese Anbieter verr&uuml;ckt, weil
sie daf&uuml;r kein Geld verlangen? Keineswegs. Finanziert werden diese
Angebote durch Werbung und Sponsoren. Wer nun viele Surfer auf seine Seiten
ziehen kann, der verdient auch viel. Vor allem, wenn die Besucher
regelm&auml;&szlig;ig wiederkehren. Und wenn man dann noch Freunde
mitbringt, zeigen sich die Werbekunden ganz besonders spendabel. </p>

<p>Wer kostenlos Festplattenspeicher anbietet und diesen zug&auml;nglich
macht, hat viele Freunde. So ergeht es der Firma GeoCities. Jeder der zur
Zeit 3,5 Millionen GeoCities-Nutzer war der Firma Yahoo! Anfang des Jahres
1999 rund 1.300 Dollar wert. Machen wir uns also keine Sorgen um die Herren
mit den Spendierhosen, denn denen geht es richtig gut. Hat man bei
GeoCities beispielsweise 15 Megabyte Platz, bietet der Konkurrent
FortuneCity schon 20 Megabyte. Verschiedene Anbieter stellen inzwischen
unbegrenzt Speicherplatz zur Verf&uuml;gung. </p>

<p>Wichtig: <font color=red> <b>Kostenlos ist nicht umsonst. </b></font>
Auch wenn keine Geb&uuml;hren f&uuml;r den Homepageplatz verlangt werden,
werden von den meisten &quot;Kostenlosen&quot; Werbebanner auf die Seite
gestellt und zus&auml;tzlich auch das Logo des Anbieters, damit man ja
sehen kann, bei wem man seine Homepage platziert hat. </p>

<p>Der bekannte Werbeslogan: <b>Gut, dass Sie verglichen haben </b> gilt
auch hier in vollem Umfang.
<ul>
<li> Wieviel Speicherraum bekommt man </li>
<li> Wieviele Bannerwerber werden eingeblendet? </li>
<li> Wieviel Platz geht dadurch je Seite verloren? </li>
<li> Wie einfach oder kompliziert ist der Umgang mit dem Anbieter? </li>
</ul>
Der Markt f&uuml;r Anbieter von freiem Webspace ist st&auml;ndig in
Bewegung. Wenn man also einen derzeit g&uuml;ltigen totalen &Uuml;berblick
erhalten will, empfielt es sich auf der Seite
<b>&quot;www.freewebspace.net&quot;</b> nachzuschauen. Hier ist wirklich
jeder freier Speicherraum des Planeten Erde ausfindig zu machen. Es werden
dabei auch folgenden M&ouml;glichkeit geboten:
<ul>
<li> Die gro&szlig;en Anbieter werden sehr kompetent vorgestellt und
fachkundig beurteilt. </li>
<li> Wenn nur Anbieter gesucht werden, die Werbeeinblendungen ersparen,
mittels ein paar Mausklicks erscheint eine entsprechende Liste. Auch diese
ist detailliert und &uuml;bersichtlich und enth&auml;lt die entsprechenden
Bedingungen der Anbieter. </li>
</ul>
Bei der Auswahl sollte aber schon etwas auf die Sprache und auf eine
vielleicht vorhersehbare Lebensdauer des Anbieters geachtet werden. Was
n&uuml;tzt der sch&ouml;nste Platz, wenn dieser adhoc &uuml;ber Nacht
schlie&szlig;en muss, weil das Geld ausgegangen ist? </p>

<p>Wie schon gesagt, der Markt f&uuml;r Anbieter von freiem Webspace ist
st&auml;ndig in Bewegung. Erfolgreiche Internetfirmen werden an der
B&ouml;rse in atemberaubender H&ouml;he gehandelt. F&uuml;r GeoCities
bezahlte die Fa Yahoo bei der &Uuml;bernahme 1999 unglaubliche 4,7
Milliarden US-Dollar. Dagegen wurde Tripod (www.tripod.de) gerade mal
f&uuml;r 58 Millionan US-Dollar 1998 von Lycos vereinnahmt. </p>

<p>Kostenlose Homepages haben immer einen l&auml;stigen Nachteil, selbst
wenn diese keine Werbung enthalten: Die Adresse ist mitunter sehr lang.
Wenn z.B. auf unserer Visitenkarte dann steht: <br><center>
www.Geocities.com/ResearchTriangle/Thinktank/1234/WolfZimmer.html
<br></center> dann sieht dies schlichtweg unm&ouml;glich aus. Und wer
m&ouml;chte ehrlich gesagt auch so eine meterlange Adresse in seinem
Browser eintippen? Und dann auch noch fehlerfrei, sonst....... ja, ja</p>

<p>Eine Adresse muss man sich merken k&ouml;nnen. Daher sind kurze und
pr&auml;gnante Adressen heiss begehrt. Auch dieser Wunsch kann erf&uuml;llt
werden - und sogar kostenlos! </p>

<p>Es gibt einige Firmen, deren Aufgabe ausschlie&szlig;lich im Bauen von
Umleitungen besteht. Hier wird mit einer kurzen und leicht zu merkenden
Adresse auf die wirkliche Homepageadresse umgeleitet.
<ul>
<li> www.AutoNr.net/SU-WV567/ (ADAC-Mitglieder und D&W-Kunden) </li>
<li> www.tnr.de/022451486/  oder www.tel.de/022451486/
<li> come.to/wozim/ oder surf.to/wozim oder move.to/wozim oder fly.to/wozim <br>
Dieser exotische Suffix &quot;.to&quot; steht f&uuml;r das K&ouml;nigreich
Tonga. Neben den drei eben erw&auml;hnten gibt es noch weitere
Kombinationen. Einfach bei www.come.to nachschauen. </li>
<li> www.wozim.iscool.de oder www.wozim.ultracool.de <br>
einfach bei www.cool-domain.de oder bei www.iscool.net vorbeischauen. </li>
<li> www.wozim.notrix.de <br>
bei www.notrix.de bekommt man nicht nur eine Domain, sondern kann auch
gleich ein G&auml;stebuch anlegen und die eigene Website in zwanzig
Suchmaschinen eintragen lassen. </li>
</ul>
Diese kurze Anregung zu Umleitung mit Aliasnamen soll ausreichen. Es gibt
weitere Adressen und auch M&ouml;glichkeiten. Aber alle haben etwas
gemeinsam. Man wird zum Werbetr&auml;ger ob man will oder nicht. Bei
www.come.to und allen Abarten wird ein zweites Pannel &uuml;ber die eigene
Homepage gestellt, die nur Werbungen enth&auml;lt. Erst wenn diese zweite
Seite geschlossen wird, erscheint die eigene Homepage. &Uuml;brigens alle
Beispiele mit meinem Namen, Autokennzeichen und Telefonnummer sind nur
fiktiv. Come.to/wozim hatte ich sogar beantragt, und bekam auch ein
Passwort zugesandt. Bevor ich aber diese Umleitung aktivierte, schickte ich
ein Mail mit der Frage, ob dies wirklich kostenlos sei und ob garantiert
w&uuml;rde, dass meine Domain nicht zu weiteren Werbungen herangezogen
w&uuml;rde. Ich bekam keine Antwort und so habe ich auch meine Umleitung
nicht aktiviert. </p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a3"><font color="800000" size="5">
<b>Geldverdienen mit der Homepage</font></b></a></p>

<p>Um jegliche Missverst&auml;ndnisse zu vermeiden: Das gro&szlig;e Geld
kann man mit einer privaten Homepage nicht verdienen. F&uuml;r eine
Aufbesserung des Taschengeldes ist eine private Homepage jedoch unter
Umst&auml;nden durchaus zu gebrauchen. Das Zauberwort hei&szlig;t
&quot;Bannerwerbung&quot;. Man meldet sich bei einem sogenannten
&quot;Bannerbroker&quot; an und integriert den dort erh&auml;ltlichen
HTML-Code auf seiner Seite. Wenn nun ein Besucher die Homepage
empf&auml;ngt, wird ein Banner vom Server des Bannerbrokers geladen. Klickt
der Besucher auf diesen Banner, wird dies registriert und der Besucher auf
die Webseite des Werbers geleitet. In der Regel hat man jedoch keinen
Einfluss darauf, f&uuml;r welche Firma und welches Produkt geworben wird.
Stellt euch vor, eure Freundin oder Frau schaut auf eure Homepage und sieht
dort pl&ouml;tzlich ein sehr bewegtes Banner mit der Aufforderung, die 100
sch&ouml;nsten Frauen im Internet zu besuchen! </p>

<p>Momentan sind drei Varianten gel&auml;ufig, mit denen etwas Geld mit
unserer Homepage verdient werden kann:
<ul>
<li> <b>Pay per Click </b><br>
Manche Firmen bezahlen ein paar Pfennige, wenn ein Besucher unserer
Homepage auf das Banner der Firma klickt und dadurch mit deren Homepage
verbunden wird. </li>
<li> <b>Pay per Lead </b><br>
Andere Firmen bezahlen einen festen Betrag, wenn ein Besucher bei der Firma
von unserer Homepage kommt und dort eine kostenlose Aktion ausf&uuml;hrt -
beispielsweise ein Formular ausf&uuml;llt oder an einem Gewinnspiel
teilnimmt. </li>
<li> <b>Pay per Sale </b><br>
Schlie&szlig;lich gibt es Programme, die eine prozentuale Verkaufsprovision
bezahlen. Man bekommt also dann Geld, wenn ein Kunde von unserer Homepage
gekommen ist und dort etwas gekauft hat. </li>
</ul>
Diese M&ouml;glichkeiten m&ouml;gen zwar verlockend klingen, aber reich
wird man auf diesem Wege nicht. Die Abrechnung der Bannerwerbung erfolgt in
der Regel in US-Dollar und die Bankgeb&uuml;hren zehren den ganzen
Werbegewinn meist schon wieder auf. </p>

<p>Man geht davon aus, dass 1000 Klicks ca 40 bis 50 US-Dollar erbringen
und wenn man sehr gut rechnet, dann klickt jeder 20. Besucher auf einen
Werbebanner und das ist schon hochgerechnet. Also ben&ouml;tigt man
mindestens 20.000 Besucher und wenn dies pro Monat geschehen sollte, dann
wird es Zeit, sofort seinen Beruf zu wechseln, einen potenten Geldgeber zu
suchen und dann ins Internetgesch&auml;ft einzutreten. Und wenn ihr dann
selber einen Banner erstellt und diesen platzieren lasst, dann kostet dies
meist bis zu 2000,- DM pro Monat. Also m&uuml;sst ihr schon etwas Gutes zu
verkaufen haben, wenn dies kein Loch ins Budget fressen soll. Wer nun zu
rechnen beginnt, sollte sich im Klaren sein, dass die echten
&quot;AdClick&quot;-Raten bei 1 bis 2% liegen, also braucht man f&uuml;r
das &Uuml;berleben ca 100.000 Besucher pro Monat. </p>

<p>F&uuml;r Kleinstunternehmer gibt es aber eine weitere M&ouml;glichkeit,
mit relativ geringem Aufwand online Geld zu verdienen. Mit Strato AG ist es
seit kurzem kein Problem mehr, einen Laden im Web zu er&ouml;ffnen -
&quot;zum Sparschweinchen Tarif&quot;. Der Vertrieb von Waren und
Dienstleistungen im Internet, inklusive der Abwicklung des kompletten
Bestellvorganges ist hier als Schnupperangebot erh&auml;ltlich. </p>

<p>Durch die Partnerschaft mit dem E-Commerce-Pionier Intershop ist die
Er&ouml;ffnung eines virtuellen Ladens eine Sache von wenigen Minuten. Man
kann aus &uuml;ber 30 fertigen Shopdesigns ausw&auml;hlen, sie
&quot;schl&uuml;sselfertig&quot; zur Verf&uuml;gung stehen.
Selbstverst&auml;ndlich kann man das eigene Firmenlogo und pers&ouml;nliche
Daten zus&auml;tzlich mit einbringen. </p>

<p>Diverse Zahlungsarten, verschiedene Steuers&auml;tze, D-Mark und Euro,
umfangreiche Kundenbefragungen, alles was das Herz eines E-Commerce
Einsteigers begehrt, stehen hier zur Verf&uuml;gung. Und das Beste: Der
Kompakt-Shop, in dem bis zu 20 Artikel angeboten werden k&ouml;nnen, ist
kostenlos. Dem Erfolg der neuen Internetfirma steht also nichts mehr im
Wege, ausgenommen der Waren, die auch gebraucht werden, um sie anbieten
zu k&ouml;nnen. </p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a4"><font color="800000" size="5">
<b>Feedback </font></b></a></p>
<p>Folgende Artikel habe ich dieses Mal in meinem Feedback in alphabetischer
Reihenfolge der Titel ber&#252;cksichtigt. Ein Autor erscheint bei mir nur
einmal, auch wenn mehrere Beitr&#228;ge lobenswert sind: </p>
<ul>
<li> <b> Alle 5 Gamesberichte</b> von  Kilian Servais</li>
<li> <b> Astrocorner</b> von  Lars Philipsen</li>
<li> <b> Corel Linux</b> von  Cord Hagen</li>
<li> <b> Da gehn's hin</b> von  Sascha van Wahnem</li>
<li> <b> Netzgeflüster</b> von  Frank Guder</li>
</ul>

<p>Eigentlich h&auml;tte ich auch diesmal alle Autoren erw&auml;hnen
k&ouml;nnen, aber es ist halt mal vorgesehen, bei der Zahl 5 zu bleiben und
so habe ich nun diese Auswahl getroffen. </p>

<hr size=4>
</td></tr></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.apc-tcp.de/members/wolf">
http://www.apc-tcp.de/members/wolf </a></font>
<br>
</td></tr></table>
<br>
</body>
</html>
