
<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Req Attack - Der ultimative Requester Patch?</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="GREEN">Tools Test: Req
Attack</FONT></CENTER></h1></P>

Obwohl mit OS 3.5 einige kosmetische Korrekturen f&#252;r die WB vorgenommen
wurden, sehen die Standard Requester immer noch viel zu farblos und
unansprechend aus. Ein Tool, welches die Requester in einem zeitgem&#228;&#223;en Look
erscheinen l&#228;&#223;t, nennt sich &quot;Req Attack&quot;. Ob man damit wirklich die WB
aufpeppen kann, wird dieser Test zeigen!</P>

<h2><CENTER><FONT COLOR="RED">Einige Features &amp;
Installation</FONT></CENTER></h2></P>
Um Euch den Mund etwas w&#228;sserig zu machen, fangen wir erstmal mit einigen
Features an, die &quot;Req Attack" so zu bieten hat:</P><ul>

<li> Konfigurierbare Requester Logos, die auch animiert sein k&#246;nnen<BR>

<li> Konfigurierbare Button Images<BR>

<li> Konfigurierbares Button Aussehen<BR>

<li> Konfigurierbares Requester-Hintergrundmuster<BR>

<li> Tastaturbedienung innehralb von Requestern<BR>

<li> M&#246;glichkeit, das erscheinen von Requestern umzulenken (z.B. unter dem
Mauszeiger)<BR>

<li> Individuelle &amp; sehr umfangreiche Konfiguration m&#246;glich<BR>

<li> Commodities Schnittstelle</P></UL>

Das h&#246;rt sich doch schonmal echt prima an, oder? Bevor wir aber zum
praktischen Teil kommen, muss zun&#228;chst einmal auf die Installation
eingegangen werden.</P>

Es existiert zwar ein Installationscript (f&#252;r das man zwingend eine aktuelle
Version des Installers ben&#246;tigt!) f&#252;r &quot;Req Attack&quot;, allerdings f&#252;hrt dieses
nicht s&#228;mtliche Schritte automatisch aus, so da&#223; man nach gegl&#252;ckter
Installation noch einige Kleinigkeiten erledigen muss, die aber keiner
besonderen Kenntnisse bed&#252;rfen. So muss lediglich noch das Hauptprogramm in
die User Startup eingetragen bzw. in die WB Startup Schublade gelegt werden
- fertig! Ein De-Installationsscript existiert, wie bei leider vielen Amiga
Programmen, nicht, aber da zum einen in der Anleitung sehr ausf&#252;hrlich
erkl&#228;rt ist, was man zu l&#246;schen hat, ist das auch gar kein Problem. Und da
das AmigaOS ohnehin wesentlich durchschaubarer ist, als das v&#246;llig
aufgebl&#228;hte Windoof, ist ein De-Installationscript auch nicht zwingend
n&#246;tig.</P>

<h2><CENTER><FONT COLOR="YELLOW">Jetzt geht es los!</FONT></CENTER></h2></P>
Nach einem Neustart des Rechners, stehen die neuen Requester auch gleich zur
Verf&#252;gung und wer mit den Standardeinstellungen von &quot;Req Attack&quot; zufrieden
ist, der braucht sich um das Tool auch nicht mehr weiter zu k&#252;mmern. Um Euch
mal einen kleinen Eindruck zu verschaffen, klickt einfach mal auf &quot;WB
About&quot; und bestaunt den neuen Requester oder schaut Euch folgenden
Screenshot an (der leider die ablaufende Animation nur als Standbild
einfangen konnte):</P><CENTER>
<img src="ra1.png"></P>
                              Sieht doch gut aus, oder?</P></CENTER>

Und selbigs kann man nun f&#252;r jeden erscheinenden Requester machen, seien es
nun simple Abfragen oder beliebige Systemmeldungen (z.B. &quot;Legen Sie Datentr&#228;ger XY in
Laufwerk XY: ein&quot; etc.). Jedem Requester kann man Button`s, animierte Logos
(sieht besonders in Verbindung mit den Animated Icon`s von OS 3.5 megagenial
aus) oder auch diverse Hintergrundmuster zuweisen. Und dank OS 3.5, mit dem
man ja schon ReAction Programmen Hintergrundmuster zuweisen konnte,
hat man nun im ganzen System einheitliche Hintergrundmuster, was garantiert
besser aussieht, als das triste Grau. Denn selbstverständlich bietet "Req Attack" die Möglichkeit, den Requestern auch Hintergrundmuster zuzuordnen.
</P>

Auch Ordentlichkeitsfanatiker werden mit &quot;Req Attack&quot; viel Spa&#223; haben, denn
damit hat man sogar die M&#246;glichkeit, jede noch so kleine Einstellung
vorzunehmen; seien es nun die Ausrichtung, die Farbe oder sogar der
Pixelabstand zwischen den einzelnen Elementen - alles ist m&#246;glich!</P>

Nicht unerw&#228;hnt bleiben sollte nat&#252;rlich auch die M&#246;glichkeit, die Requester
von nun an auch mit der Tastatur zu steuern bzw. mittels der Tastatur
die n&#246;tigen Eingaben zu steuern. Wenn man nun nochmals auf OS 3.5
zur&#252;ckkommt (ich wei&#223;, es nervt langsam :-) und dabei insbesondere die stark
verbesserte Tastaturunterst&#252;tzung bedenkt, kann man nun die WB (fast) auch
ohne Maus komfortabel bedienen. Es soll ja durchaus mal vorkommen, da&#223; ein
Nager seine Arbeit verweigert und man einige Tage auf Ersatz warten
muss...</P>

<h2><CENTER><FONT COLOR="BLUE">M&#252;heselige
Handarbeit?</FONT></CENTER></h2></P>
Das alles h&#246;rt sich bisher ja ganz toll an und es wird sicherlich einige
unter Euch geben, die jetzt schnellstens die aktuelle Aminet CD rauskramen
und sich &quot;Req Attack&quot; installieren. Tja, das wird ein b&#246;ses Erwachen geben,
denn sp&#228;testens wenn man nach der GUI zum Einstellen der oben erw&#228;hnten
Eigenschaften sucht, wird man nicht mehr f&#252;ndig, denn so eine GUI existiert
&#252;berhaupt nicht. Vielmehr speichert &quot;Req Attack&quot; eine Konfigurationsdatei im
&quot;ENVARC&quot; auf der Systempartition, die dann bei jedem Neustart in`s Ram
kopiert wird - soweit ist das nichts ungew&#246;hnliches f&#252;r ein Tool, da auch
die WB Programme so verfahren. Wer jetzt allerdings etwas an den
Eigenschaften von &quot;Req Attack&quot; &#228;ndern will, der muss sich wohl oder &#252;bel
einen Texteditor schnappen und diese Konfigurationsdatei per Hand
editieren.</P>

Das ganze l&#228;uft &#228;hnlich ab wie eine Programmiersprache und ist Basic &#228;hnlich
aufgebaut und wird dem nicht so erfahrenen User sicherlich einiges an
Kopfschmerzen bereiten. Programmierer werden zwar schnell mit der
Konfigurationsdatei zurecht kommen und auch Unwissende, die die &#228;u&#223;erst
ausf&#252;hrliche Anleitung studieren, kommen sicherlich bald zu
Erfolsgergebnissen, aber elegant ist dieser Weg sicherlich nicht. Besser
w&#228;re da schon eine GUI zum Einstellen s&#228;mtlicher Variablen, die auch
unwissenden Usern eine einfache und vor allem schnelle Konfiguration des
Programms erm&#246;glicht. Denn wenn (was f&#252;r ein gelungener Satzanfang...) man
sich so die Listen mit all den verschiedenen Variablen anschaut, vergeht
,zumindest mir, recht schnell die Lust alles einzustellen. Wer wirklich
alles einstellen will, der sollte sich schon einen Nachmittag Zeit nehmen...
</P>
<h2><CENTER><FONT COLOR="GRAY">Mitgelieferte Tools</FONT></CENTER></h2></P>
Um &quot;Req Attack&quot; vern&#252;nftig benutzen zu k&#246;nnen, werden auch gleich noch
einige (kleinere) Tools mitgeliefert, die haupts&#228;chlich dazu dienen, neue
einzubindene Grafikdateien zu erstellen, denn genau hier liegt ein weiterer
Knackpunkt bei &quot;Req Attack&quot;: Das Tool kann lediglich Grafiken, die im
eigenen RAIM (<b>R</B>eq <b>A</B>ttack <b>Im</B>age) Format vorliegen verarbeiten - Support f&#252;r
andere Dateitypen (z.B. f&#252;r das Amiga typische IFF oder das
Plattform&#252;bergreifende JPG Format) gibt es bisher leider nicht und ist
eigentlich schade, da man so erst alles m&#252;heselig mit den mitgelieferten
Tools konvertieren muss. S&#228;mtliche Tools, die f&#252;r das RAIM Format zust&#228;ndig
sind (insgesamt 6 St&#252;ck; beispielsweise um Info`s einzuholen oder eine
Animation zu erzeugen), lassen sich nur &#252;ber CLI starten und bedienen. Dies
ist zwar kein richtiger Kritikpunkt, da die Tools ohnehin recht einfach
gehalten sind (also nichts, wof&#252;r sich der Aufwand eine grafische Oberfl&#228;che
zu kreiern lohnen w&#252;rde), tragen aber nicht dazu bei, &quot;Req Attack&quot; Usern
zug&#228;nglich zu machen, die noch nicht so lange beim Amiga sind.</P>

Recht gut gelungen ist hingegen der mitgelieferte Datatype, auch wenn er in der vorliegenden
Version noch etwas buggy ist; als Previewfunktion reicht er aber vollst&#228;ndig
aus.</P>
<CENTER><img src="ra2.png"></CENTER></P><BR>

<h2><CENTER><FONT COLOR="WHITE">Rumgepatche?</FONT></CENTER></h2></P>
Jedes Tool, das in irgendeiner Weise in die Funktionen des Betriebsystems
eingreift, bringt die Gefahr mit sich, da&#223; es sich nicht vollst&#228;ndig mit
anderen Tools vertr&#228;gt und daher zu unerkl&#228;rlichen Abst&#252;rzen f&#252;hrt.
Insgesamt betrachtet ist &quot;Req Attack&quot; ziemlich stabil und f&#252;hrte bei mir zu
keinerleich Beeintr&#228;chtigungen die Stabilit&#228;t betreffend. Allerdings soll es
massive Probleme geben, wenn man das Tool &quot;Smart Crash&quot; installiert hat. Da
ich eben dieses Tool nicht in mein System eingebunden habe, kann ich dazu
nat&#252;rlich nix sagen. Allerdings beweist dieser Fall mal wieder sehr
eindrucksvoll, da&#223; sich Tools v&#246;llig verschiedener Genres gerne auch mal in
die Quere kommen. Um weitere Probleme zu vermeiden, sollte man noch das Tool
&quot;CyReq&quot; installiert haben - dann sollte eigentlich nichts mehr schiefgehen
und Euer OS so stabil laufen, wie vor der Installation.</P>

<h2><CENTER><FONT COLOR="GREEN">Fazit</FONT></CENTER></h2></P>
&quot;Req Attack&quot; geh&#246;rt sicherlich zu den Tools, die man installiert haben
sollte, wenn man Wert auf eine gepflegte, zeitgem&#228;&#223;e und vor allem
anspruchsvolle grafische Benutzeroberfl&#228;che legt. Allerdings gibt es da
einige M&#228;ngel, wobei insbesondere die schwierige Konfiguration (respektive
das Fehlen jeglicher GUI) und die Fixierung auf das eigene RAIM Format zu
nennen sind. Wenn man das mal au&#223;en vor l&#228;&#223;t und zudem bedenkt, da&#223; die
Shareware Geb&#252;hr lediglich bei 2 DM (!!) liegt (alles dar&#252;ber wird nat&#252;rlich
auch nicht abgelehnt), kann man dar&#252;ber nochmal locker wegsehen. Wer sich
also von den M&#228;ngeln nicht abgeschreckt f&#252;hlt, sollte &quot;Req Attack&quot; unbedingt
mal ausprobieren. Alle anderen k&#246;nnen sich ja noch auf die (geplanten)
zuk&#252;nftigen Releases freuen...</P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
