<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Steuer Profi `99 - Das liebe Finanzamt läßt grüßen...</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<h1><CENTER><FONT COLOR="GREEN">Steuer Profi `99</FONT></CENTER></h1></P>

Die Schatztruhe ist eine der wenigen Softwareschmieden, die trotz der
bescheidenen Situation immer noch viel Software rausbringen - darunter auch
jeweils einmal zu Beginn des neuen Jahres den &quot;Steuerprofi&quot;. In diesem Jahr
steht nat&#252;rlich der Steuerprofi `99 auf der Liste, den ich mir mal f&#252;r die
NC angeguckt habe.</P>

<h2><CENTER><FONT COLOR="YELLOW">Der Inhalt</FONT></h2></CENTER></P>
In NC 67 stellte ich bereits den &quot;Steuer Profi `98&quot; ausf&#252;hrlich vor und
inhaltlich hat sich im Grunde nicht viel getan. Immer noch wird der &quot;Steuer
Profi&quot; auf CD ausgeliefert, auf der sich folgende Programme verstecken:</P><UL>

 <li>Steuer Profi (alle Versionen von `93-`99)<BR>
 <li>Steuerb&#246;gen (von `95-`99)<BR>
 <li>Anleitungen<BR>
 <li> Guide Dateien zum Einkommensteuergesetz</P></UL>

Das bekannte &quot;Haushaltsbuch&quot;, welches ansonsten immer Bestandteil der CD
war, ist auf der aktuellen Release nicht mehr vorhanden, was aber aufgrund
des Alters des Programms auch nicht weiter zu bedauern ist.</P>

Warum man allerdings erneut alle &#228;lteren Programmversionen nebst den &#228;lteren
&quot;Steuerb&#246;gen&quot; auf die CD kopiert hat, entzieht sich meiner Kenntniss.
Immerhin sind diese bei weitem nicht mehr aktuell und somit schlicht und
ergreifend &#252;berfl&#252;ssig. Aber da die CD mit 183 MB an Daten ohnehin nur zu
einem geringen Teil ausgenutzt ist, f&#228;llt das auch nicht weiter in`s
Gewicht. Was mir hingegen negativ aufgefallen ist, ist die Tatsache, da&#223;
s&#228;mtliche Icon`s auf der CD im Standard 3.0 Look vorliegen, was optisch
nat&#252;rlich alles andere als ansprechend ist. Von NewIcons (oder gar Glow
Icon`s) scheint der Zusammensteller noch nichts geh&#246;rt zu haben. Auch wenn
dieser Punkt alles andere als wichtig ist, macht es doch keinen guten
Eindruck und l&#228;&#223;t die Zusammenstellung schon jetzt leicht antiquiert
wirken...</P>

<h2><CENTER><FONT COLOR="WHITE">Der Steuer Profi</FONT></CENTER></h2></P>
Wie nicht anders zu erwarten, ist der aktuelle &quot;Steuer Profi `99&quot; wieder
einmal an die aktuelle Gesetzteslage angepasst worden, was nat&#252;rlich der
wichtigste Grund f&#252;r ein Update ist. S&#228;mtliche M&#228;ngel der Vorg&#228;ngerversion
wurden aber leider in den &quot;Steuer Profi `99&quot; &#252;bernommen, wobei insbesondere
die absolut triste und v&#246;llig unaktrative GUI negativ auff&#228;llt. Diese ist
immer noch im OS 2.0 / 3.0 Look gehalten und macht zu keinem Zeitpunkt die
Arbeit zu einem Vergn&#252;gen. Selbst g&#228;ngige Patches helfen da nicht mehr viel
und Usern mit Grafikkarte wird beim Anblick dieser GUI wirklich &#252;bel. Und
selbst wenn man auf eine attraktive GUI wenig oder gar keinen Wert legt, so
leidet im Fall des &quot;Steuer Profi `99&quot; auch der Komfort darunter. So ist es
bei Ja / Nein Fragen z.B. n&#246;tig, erst die entsprechende Antwort einzutippen
anstatt, wie heutzutage &#252;blich, eine Checkbox bequem mit der Maus
anzuklicken. Symptomatisch f&#252;r den etwas angestaubten Charakter des &quot;Steuer
Profi `99&quot; ist auch der beiliegende Taschenrechner, der gut und gerne aus OS
1.3 Zeiten stammen k&#246;nnte und dem eine zeitgem&#228;&#223;e &#220;berarbeitung auch mal
wieder gut tun w&#252;rde.
Um es insgesamt mal positiv auszudr&#252;cken: Die GUI vom &quot;Steuer Profi `99&quot;
ist als zwecksdienlich zu bezeichnen.</P><CENTER><img src="sprofi1.jpg"></CENTER></P><BR>

Wichtiger aber als s&#228;mtliche grafischen Erg&#252;sse &amp; Komfort ist bei einem
Steuerprogramm die Tatsache, ob es korrekt rechnet. Und wie schon im letzten
Jahr habe ich mir erneut die aktuelle Steuererkl&#228;rung geschnappt und diese
am Computer durchgerechnet. Dabei f&#228;llt positiv auf, da&#223; der &quot;Steuer Profi&quot;
zu Beginn alle ben&#246;tigten Angaben abfragt und auf Basis von diesen
&#252;berfl&#252;ssige Eingaben ausschlie&#223;t. Dabei l&#228;uft alles automatisch (wenn auch
nicht in der Reihenfolge, wie man es von den Originalb&#246;gen gewohnt ist) ab
und man muss sich um die korrekte Reihenfolge oder um die Tatsache etwas
vergessen zu haben, keine Sorgen machen.</P>

Wenn man nach einiger Zeit (in unserem Fall zweieinhalb Stunden !) endlich
alles eingegeben hat, freut man sich nat&#252;rlich auf das entsprechende
Ergebniss. Und wie nicht anders zu erwarten war, hat der aktuelle &quot;Steuer
Profi&quot; den korrekten Wert errechnet und alle Daten richtig zusammengez&#228;hlt.
</P>
Nun muss man alles nur noch ausdrucken und auch hier macht der &quot;Steuer Profi
`99&quot; einen guten Eidnruck: Alle Angaben sa&#223;en v&#246;llig korrek in den daf&#252;r
vorgesehenen Feldern (Drucker: Epson Stylus Color II). Allerdings sollte man
vorher den einen oder anderen Probeausdruck waagen, denn man kann sich bei
all den verschiedenen Druckern / Treibern nie so ganz sicher sein, ob alles
wirklich korrekt gedruckt wird. Ebenfalls nicht unerw&#228;hnt bleiben sollte die
Tatsache, da&#223; der Ausdruck auch so seine Zeit braucht und deshalb zu den
oben bereits erw&#228;hnten zweieinhalb Stunden hinzugez&#228;hlt werden sollte. Zum
Vergleich sei herangef&#252;hrt, da&#223; man auf dem konventionellen Weg (also ohne
Computer) etwas mehr als 4 Stunden f&#252;r die gleiche Steuererkl&#228;rung gebraucht
hat. Ein erheblicher Zeitgewinn l&#228;&#223;t sich also nicht ausmachen und sollte
somit definitiv nicht als Kaufargument f&#252;r den &quot;Steuer Profi `99&quot; angef&#252;hrt
werden.</P>

Als Boni liegen dem &quot;Steuer Profi `99&quot; noch einige (kleinere) Steuertools
(u.a. Kirchensteuer, Vorsorgeberechnung, Steuerklasse etc.) bei, die
ebnefalls aktualisiert wurden und den Euro als W&#228;hrungseinheit bestens
unterst&#252;tzen (auch wenn dieser aufgrund von Fluktuationen in den letzten
Wochen alles andere als eine feste Gr&#246;&#223;e ist). Nichtsdestotrotz kann man mit
diesen kleinen Tools (die auch f&#252;r Windows auf der CD vorliegen) einiges
anfangen und sich die Arbeit doch etwas vereinfachen. </P><CENTER>
<img src="sprofi2.jpg"></P><BR></CENTER>
<h2><CENTER><FONT COLOR="BLUE">Die Steuerb&#246;gen</FONT></CENTER></h2></P>
Platzm&#228;&#223;ig machen die Steuerb&#246;gen (ich werde an dieser Stelle nur auf die aktuellen eingehen)
einen Gro&#223;teil der CD aus, da diese von vornherein in drei Kategorien
aufgeteilt sind: Hochaufl&#246;send, normalaufl&#246;send und Echtfarben. Letztere
Dateien liegen lediglich im JPG Format vor und sind mit gut 4 MB im Schnitt
alles andere als klein. Es bedarf also schon gro&#223;er Mengen an Speicher, um
diese in einer aktzeptabelen Geschwindigkeit auf`s Papier zu bringen oder
&#252;berhaupt zu laden (ich empfehle daf&#252;r &quot;Turbo Print&quot; aus dem Hause Irsee
Soft). Was die hochaufl&#246;senden &amp; normalaufl&#246;senden Grafiken angeht: Diese
liegen sowohl im Amiga typischen IFF Format als auch im GIF Format vor und
sind dementsprechend kleiner (so zwischen 200-800 KB; je nach Aufl&#246;sung und
Format). Im Gegensatz zur Vorg&#228;ngerversion ist diesesmal die Qualit&#228;t der
&quot;Steuerb&#246;gen&quot; absolut einwandfrei und kann somit zu mehr als nur zu
Probezwecken verwendet werden.</P>

<h2><CENTER><FONT COLOR="GRAY">Und hardwareseitig?</FONT></CENTER></h2></P>
Dar&#252;ber sollte sich eigentlich niemand ernsthaft Gedanken machen. Neben
einem CD Laufwerk ist nur noch OS 2.1, 1 MB Ram sowie ein Drucker
erforderlich. Aber wenn man sich so die GUI anguckt, d&#252;rfte das auch nicht
weiter verwunderlich sein. Schade nur, da&#223; man die Hardwareanforderrungen
nicht etwas h&#246;her ansetzt und daf&#252;r dem User eine ansprechende GUI sowie ein
Minimum an Komfort bietet. Un mal ehrlich: Wer hat heute nicht mindestens 8
MB sowie einen 030er unter Haube?</P>

<h1><CENTER><FONT COLOR="RED">Fazit</FONT></h1></CENTER></P>
Wie schon beim letzten Release muss ich auch diesesmal festhalten, da&#223; der
&quot;Steuer Profi `99&quot; zwar keineswegs &#252;bel ist und auch korrekt rechnet, aber
im gro&#223;en und ganzen keine alzu gro&#223;e Zeitersparniss mit sich bringt. Hinzu
kommen noch auff&#228;llige M&#228;ngel bei der grafischen Oberfl&#228;che sowie einige
weitere Kleinigkeiten, die das Programm zwangsl&#228;ufig etwas abwerten, auch
wenn der Programmierer im Bezug auf die Aktualit&#228;t (Gesetzteslage) ganze
Arbeit geleistet hat. Hier muss wirklich jeder selber entscheiden, ob er
sich f&#252;r die 99 DM teure Investition, die vollst&#228;ndig steuerlich absetzbar
ist, entscheidet.</P><BR><CENTER>
<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Schatztruhe</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>99 DM (neu) bzw. 69 DM (Update)</TD>
</TR>
<TR>
<TD>Art</TD>
<TD>Steuerprogramm & Tools für Steuererklärung</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>183</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>60 %</TD>
</TR>
</TABLE>





<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
