<!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Sekalaiset</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>ADSL&nbsp;Amigassa</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Wanha wiisaus kuuluu, ett&auml; ruokahalu kasvaa sy&ouml;dess&auml;. T&auml;m&auml; p&auml;tee hyvin paitsi ateriointiin, my&ouml;s harrastuksiin. Akvaariostanikin on moni sanonut, ett&auml; seuraava koko on varmaankin uima-allas. Internetiss&auml; vietetty aika ja verkon kasvanut ja monipuolistunut tarjonta on pikku hiljaa kasvattanut liikennett&auml; niin, ett&auml; perinteiseen puhelintekniikkaan pohjautuva liikenn&ouml;inti alkaa auttamattomasti t&ouml;kki&auml;, ja verkkoel&auml;imen mieli halajaa nopeampaa yhteytt&auml;. ISDN-liittym&auml;n ehdin omistaa vain alle puoli vuotta, kun Oulun Puhelin toi markkinoille kohtuuhintaisen ADSL-liittym&auml;n. Kolmen koneen k&auml;yt&ouml;ss&auml; ISDN-liittym&auml; oli ylip&auml;&auml;sem&auml;t&ouml;n pullonkaula, joten ADSL:n tilausp&auml;&auml;t&ouml;s ei kauan kest&auml;nyt.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Vanha reik&auml;, uudet kujeet?</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">ADSL on lyhenne sanoista Asymmetric Digital Subscriber Line, ep&auml;symmetrinen digitaalinen tilaajajohto. DSL-variaatioita on muitakin, mutta yleisnimityksen&auml; kaikista k&auml;y xDSL. Erilaisia toteutuksia ovat mm. ADSL Lite, CDSL, HDSL, IDSL, RADSL, SDSL ja VDSL - ota noista sitten selv&auml;. :) K&auml;ytt&auml;j&auml;n kannalta lienee t&auml;rkeint&auml;, ett&auml; data liikkuu linjoilla liukkaasti, eik&auml; hinta ole aivan p&auml;&auml;t&auml; huimaava. ADSL-yhteys on aina &quot;auki&quot;, eik&auml; siin&auml; ole aikaveloitusta, vaan ainoastaan kiinte&auml; kuukausimaksu. Ei siis ole v&auml;li&auml;, roikutko linjalla tunnin p&auml;iv&auml;ss&auml; vai 24 h/vrk seitsem&auml;n&auml; p&auml;iv&auml;n&auml; viikossa, maksu on aina sama.
						<p>Mit&auml;&auml;n erityisen digitaalista yhteydess&auml; ei ole, vaikka nimest&auml; niin voisi p&auml;&auml;tell&auml;, vaan kyseess&auml; on laajakaistainen tietoliikenneyhteys, joka hoituu perinteisen yksiparisen puhelintilaajajohdon kautta. Liikenn&ouml;intiin k&auml;ytet&auml;&auml;n laajempaa taajuuskaistaa kuin &quot;perinteisess&auml;&quot; puhelin- ja modeemiliikenteess&auml;, joten yhteydet ovat nopeammat. Kaapelimodeemin nopeus riippuu l&auml;hialueen kaistan kuormituksesta, mutta ADSL-yhteys on liittym&auml;kohtainen, joten nopeus on teoriassa aina sama. (Sanon &quot;teoriassa&quot;, koska tavallisille netin tukkeutumisille ja palvelinh&auml;iri&ouml;ille ei ADSL:k&auml;&auml;n ole immuuni.)</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Kiinte&auml; linja, kiinte&auml;t taksat</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Oulun Puhelimen asiakkaille ADSL:n asennusmaksu on t&auml;ll&auml; hetkell&auml; 1159 markkaa (sis. alv 22%). Entisen HPY:n eli nykyisen Elisa Communicationsin asennusmaksu on esimerkin vuoksi kirjoitushetkell&auml; 2950 markkaa, joten alueelliset erot voivat olla huimia. Oulun alueella ADSL-liittymien kysynt&auml; on ylitt&auml;nyt reilusti kaikki ennakko-odotukset, ja minunkin tapauksessani toimitusajaksi ilmoitettiin 10-12 viikkoa. Aika tarkalleen 10 viikkoa siin&auml; menikin, kunnes asennusmies oli oven takana. Voimassa olevaa puhelinliittym&auml;&auml; tai -osaketta ei tarvitse olla ADSL:&auml;&auml; tilattaessa, riitt&auml;&auml; ett&auml; kiinteist&ouml;st&auml; tai huoneesta l&ouml;ytyy asennettu puhelinkaapeli.
						<p>ADSL:n asentamisen yhteydess&auml; lopetettiin ISDN-liittym&auml; ja samalla my&ouml;s perinteinen lankapuhelinliittym&auml;, lankapuhelimeen kun ei juuri kukaan muu en&auml;&auml; soittanutkaan kuin lehtimyyj&auml;t ja gallupintekij&auml;t, ja n&auml;m&auml;kin aina yleens&auml; silloin, kun olin kainaloitani my&ouml;ten akvaariota siivoamassa. Joulupukki mokoma toi minulle onnettomalle m&auml;nn&auml; jouluna k&auml;nnyk&auml;n, joten sik&auml;likin lankaliittym&auml; alkoi olla turha.</p>
						<p>Kuukausimaksu yhteydest&auml; on Oulussa t&auml;ll&auml; hetkell&auml; 790 markkaa, ja siihen sis&auml;ltyy ADSL-verkkop&auml;&auml;tteen vuokra. Verkkop&auml;&auml;te on tavallisen ulkoisen vaakamallisen p&ouml;yt&auml;modeemin n&auml;k&ouml;inen ja kokoinen vehje, jossa on kosolti ledej&auml; ja takana RJ-45-liittimet verkkokaapelia varten. Verkkop&auml;&auml;tteen mukana toimitetaan yksi verkkokaapeli sek&auml; laitteen tarvitsema muuntaja. Kuukausimaksua alettiin itselt&auml;ni veloittaa vasta ensimm&auml;iselt&auml; t&auml;ydelt&auml; kuukaudelta, joten asennusmaksu kattoi my&ouml;s ensimm&auml;isen parin viikon linjoilla lentelyt.</p>
						<p>Verkkokortit eiv&auml;t sis&auml;lly liittym&auml;n hintaan, vaan ne pit&auml;&auml; olla omasta takaa, tosin halutessaan ne voi ostaa erikseen liittym&auml;n mukana. Kahdessa PC:ss&auml; yhteytt&auml; hoitavat muutaman satasen maksaneet PCI-verkkokortit, Amigassani taas on Zorro-v&auml;yl&auml;inen X-Surf-verkkokortti, josta voit lukea lis&auml;&auml; Testit-osaston artikkelista &quot;<a href="../testit/x-surf.html" target="_self">X-Surf</a>&quot;.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Jaetaan nyt v&auml;h&auml;n muillekin</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">On huomattava, ett&auml; yhteys voi olla &quot;auki&quot; vain yhdell&auml; koneella kerrallaan, mik&auml;li yhteytt&auml; ei ole mill&auml;&auml;n jaettu. Useamman koneen saaminen verkkoon yht&auml; aikaa vaatii siis hieman j&auml;rjestelyj&auml;. Helpoin tapa on perustaa oma l&auml;hiverkko, jossa joku koneista toimii reitittimen&auml; ja jakaa yhteytt&auml; toisille koneille. Jakava kone tarvitsee tietenkin kaksi verkkokorttia, toisen ADSL-yhteydelle ja toisen l&auml;hiverkolle, asiakaskoneisiin riitt&auml;&auml; yksi kortti. Yleisesti k&auml;ytetty ratkaisu on asentaa reitittimen virkaa hoitamaan vaikkapa vanhahko PC-kone, johon on asennettu Linux. Oikein s&auml;&auml;detty Linux toimii samalla my&ouml;s palomuurina, sill&auml; Linuxin tietoturvaominaisuudet ovat oikein s&auml;&auml;dettyn&auml; t&auml;ysin ylivertaiset onnettomiin Windows-koneisiin verrattuna.
						<p>Hommassa oli vain yksi mutta. Minulla ei ollut &quot;ylim&auml;&auml;r&auml;ist&auml;&quot; konetta luovuttaa pelkk&auml;&auml;n reititink&auml;ytt&ouml;&ouml;n, ja toisekseen Linuxin asennus on tietenkin oma urakkansa, johon ei ainakaan t&auml;mm&ouml;inen keltanokka olisi jaksanut ryhty&auml;. (Kyll&auml;, olen s&auml;&auml;lityinen, terveisi&auml; psilonille ja kumppaneille... ;) Kolmantena puolustavana seikkana on kuitenkin palveluntarjoajan eli OPOY:n oma palomuuri, joka est&auml;&auml; k&auml;yt&auml;nn&ouml;ss&auml; kaikki luvattomat tunkeutumisyritykset verkosta asiakkaalle p&auml;in. (V&auml;h&auml;n liiankin tehokkaasti, sill&auml; esim. monien IRC- ja vaikkapa FTP-palvelimien kyselem&auml; auth/ident-porttikin on blokattu... Ei niin hyv&auml;&auml;, ettei jotain huonoakin.)</p>
						<p>T&auml;m&auml;n vuoksi en kantanut suuremmin huolta yhteyden turvariskeist&auml;, niit&auml; kun ei k&auml;yt&auml;nn&ouml;ss&auml; juuri ole. Muutamien porttiskannausten yhteydess&auml; l&ouml;ytyneet &quot;auki&quot; olevat portit ovat k&auml;yt&auml;nn&ouml;ss&auml; antaneet ulosp&auml;in OPOY:n proxyn IP-osoitetta, eik&auml; koneen omaa. IP-osoite on OPOY:n mukaan dynaaminen, mutta k&auml;yt&auml;nn&ouml;ss&auml; se vaihtuu kuitenkin melko harvoin. Liittym&auml; on ollut k&auml;yt&ouml;ss&auml; nyt hieman yli kaksi kuukautta, ja IP on sin&auml; aikana vaihtunut kerran.</p>
						<p>Olin kuullut kauhujuttuja yhteyden jakamisen hirveydest&auml; Windows-koneella ja hirvitt&auml;vi&auml; tarinoita WinGaten s&auml;&auml;t&auml;misest&auml; kuntoon. Niinp&auml; olin enemm&auml;n kuin yll&auml;ttynyt, kun SyGate-niminen simppeli ohjelmisto hoiti homman vain muutaman minuutin s&auml;hellyksen j&auml;lkeen. SyGate asennetaan palvelinkoneelle, jolla t&auml;ytyy ensin olla toimiva yhteys sek&auml; Internetiin ett&auml; l&auml;hiverkkoon. Windowsin verkkoasetuksiin m&auml;&auml;r&auml;sin ADSL-yhteytt&auml; hoitavan verkkokortin hakemaan asetukset automaattisesti (DNS-palvelimia lukuun ottamatta, ne t&auml;ytyy asettaa k&auml;sin).</p>
						<p>L&auml;hiverkkoa hoitavan kortin puolelle annoin IP-osoitteeksi 192.168.0.1 ja hostmaskiksi 255.255.255.0. (SyGate toimii tarvittaessa l&auml;hiverkossa DHCP-palvelimenakin, mutta halusin ett&auml; koneilla on kiinte&auml;t IP-numerot.) Amigan IP-osoitteeksi s&auml;&auml;din Miamiin 192.168.0.2, gatewayksi 192.168.0.1, nimipalvelimeksi OPOY:n antaman palvelimen ja hostmaskiksi samoin 255.255.255.0. Toinen PC sai IP-numerokseen 192.168.0.3, muista asetuksista huolehtii siin&auml;kin koneessa SyGate, jonka asentaminen ei tosin ole asiakaskoneeseen v&auml;ltt&auml;m&auml;t&ouml;nt&auml; mutta jonka avulla voi helposti seurata yhteyden liikennett&auml; ja verkon toimintaa.</p>
						<p>Kun ping toimi kaikkien koneiden v&auml;lill&auml; hyvin, k&auml;ynnistin palvelinkoneessa SyGaten, Amigassa Miamin ja boottasin toisenkin PC:n. Selaimiin sun muihin nettikilkkeisiin viel&auml; OPOY:n proxy-m&auml;&auml;rittelyt kuntoon, ja hellurei: kolme konetta kivuttomasti ADSL-yhteydell&auml; netiss&auml; yht&auml; aikaa. Kaikki kolme konetta ovat yleens&auml; aina p&auml;&auml;ll&auml;, joten yhteyskin on jatkuvasti k&auml;yt&ouml;ss&auml;. RC5-murskaimet hakevat ja l&auml;hett&auml;v&auml;t pakettejaan omia aikojaan, toisen huoneen PC k&auml;ytt&auml;&auml; palvelinkoneen tulostimia ja CD-RW-asemaa, ja Amigakin toimii melko lailla kakistelematta, vaikka joutuukin olemaan winhotuksen kanssa samassa letkussa. ;)</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>T&auml;ysi palvelupaketti, tiukat muurit</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">OPOY:n Baana-liittym&auml;&auml;n kuuluu automaattisesti my&ouml;s Wnet-Internet-liittym&auml;, johon kuuluvat yleisimm&auml;t Internet-palvelut kuten s&auml;hk&ouml;posti, IRC yms. Itse en k&auml;yt&auml; uutta s&auml;hk&ouml;postiosoitettani, vaan haen postit edelleen Saunalahden palvelimelta, l&auml;hett&auml;minen tietenkin menee OPOY:n palvelimen kautta. Jonkin verran alkuvaikeuksia oli esim. OPOY:n huonosti s&auml;&auml;detyn DHCP-palvelun vuoksi. Palomuuri on ehk&auml; hiukan liian tiukkapipoinen, mutta ainakaan ei tarvitse pel&auml;t&auml; virtuaalirosmoja. Muuten ei ole isompaa valittamista. Esim. IRC:ss&auml; DCC send on estetty, mutta receive toimii, vaikka helpdesk muuta yrittikin v&auml;itt&auml;&auml;. FTP-palvelinta en ole viel&auml; tullut kokeilleeksi py&ouml;ritt&auml;&auml;.
						<p>790 markan kuukausimaksu voi tuntua kalliilta, mutta jos puhelinlaskutkin ovat olleet nelinumeroisia, ei ADSL-liittym&auml; ole etuihinsa n&auml;hden mitenk&auml;&auml;n suuri sijoitus. Tosin meit&auml; on kaksi maksajaa, joten oikeastaan hintaa j&auml;&auml; vajaa 400 markkaa per nuppi kuukaudessa. OPOY ei tarjoa liittym&auml;st&auml; eri nopeusvaihtoehtoja kuten HPY/Elisa, vaan hinta on aina kaikille sama, eik&auml; yhteysnopeutta rajoiteta mitenk&auml;&auml;n keinotekoisesti. V&auml;hint&auml;&auml;n 768 kbit taataan kaikkialle molempiin suuntiin, ja alueen keskuksen ja kaapelien tasosta riippuen sitten enemm&auml;n. Maksimi t&auml;ll&auml; hetkell&auml; on 1 Mbit ulos ja 7 Mbit sis&auml;&auml;n, ja ainakin t&auml;&auml;ll&auml; tuo on k&auml;yt&auml;nn&ouml;ss&auml; saavutettu: noin 100 kt/sek olen siirt&auml;nyt Saunalahden palvelimelle, ja reilut 650 kt/sek hakenut tavaraa funet.fi:st&auml;.</p>
						<p>Lyhyesti sanottuna: ei tule modeemia tai ISDN:&auml;&auml; ik&auml;v&auml;! Suosittelen!</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
