<!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Adobe GoLive 4">
		<title>Sekalaiset</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Canal Digital</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Timo Kemppaala &lt;<a href="mailto:apache@mbnet.fi">apache@mbnet.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Halusin saada Discovery Channelin k&auml;ytt&ouml;&ouml;ni, ja ajattelin mahdollisuutta hankkia se itsekseni pari p&auml;iv&auml;&auml;, ennen kuin ilmoitin rakkaalleni, ett&auml; aikoisin tilata kanavia k&auml;ytt&ouml;&ouml;mme. Vastalauseita ei pahemmin kuulunut, ja rahoittaja kun olin, sain mietti&auml;, mit&auml; kanavia haluaisin. Meni p&auml;iv&auml; jos toinenkin, kun mietin kanavia, joista minulla ei ollut hajuakaan. Loppujen lopuksi homma selvisi.
						<p>Menin Canal Finlandin p&auml;&auml;konttoriin reippain mielin ja pyysin heti lomakkeet mukaan. Totta kai sain ne ja luulin, ett&auml; laitteet saa heti mukaan, mutta kun ei. Ensin tuli &quot;luotettavuustesti&quot;, jolla tarkastetaan asiakkaan luottokelpoisuus. &quot;Ei se mit&auml;&auml;n&quot;, ajattelin. J&auml;in odottelemaan laitetta saapuvaksi postiin. Odotus oli pitk&auml; ja meni muutama p&auml;iv&auml;, kun mietin, miten kytkisin koneeni Canaliin. Lopulta se k&auml;vi Paloma IV:een kytkettyn&auml; RF-kaapelilla, josta nappaamieni kuvien h&auml;iri&ouml;tkin ovat per&auml;isin. My&ouml;s SVBS/S-VHS onnistuu, mutta sopiva liitin oli saatavissa vain PlayStation 1:een. Kuvanlaadultaan suora SVBS on tarkempi kuin RF.</p>
						<p>Laite tuli kymmenkiloisessa paketissa. Laitteen hinta, 1200 markkaa, maksettaisiin vasta ensi laskun yhteydess&auml;. Jouduin kantamaan laitteen kotiin asti pelk&auml;ll&auml; k&auml;sivoimalla (Canal maksoi vain postikulut).</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Vehkeet paikoilleen</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Sijainti talossamme antoi oikeuden tilaamiseen, muutenhan en olisi tilannut koko laitetta. Talo osui juuri tuohon THOR-II-transponderiin (l&auml;hetin avaruudessa). Antennin suunta on digitaalivastaanottimella eritt&auml;in t&auml;rke&auml;, sill&auml; pienikin virhe, ja siin&auml;h&auml;n olet lautasiesi kanssa avuttomana. T&auml;m&auml; satelliittipakkaus, josta olen henkil&ouml;kohtaisesti kirjoittamassa, on eritt&auml;in tarkka virheist&auml;. Syyst&auml;kin siis kannattaa muistaa maltti.
						<center>
							<p><img height="155" width="236" src="kuvat/antenni.jpg" alt=" "></p>
						</center>
						<p>Saisin nyt kykyjeni mukaan vastaanottaa kuvaa ja &auml;&auml;nt&auml;. Puoleentoista p&auml;iv&auml;&auml;n ei n&auml;kynyt tai kuulunut mit&auml;&auml;n, mutta sitten p&auml;&auml;tin muuttaa suuntimaa ihan mieleni mukaan ja alkaa etsi&auml; asemia milli millilt&auml;. Kuva ei anna juurikaan tietoa yhteydest&auml;, mutta toimii minulla. Olen jopa joskus saanut vihre&auml;t&auml; palkkia esille. Siltik&auml;&auml;n t&auml;m&auml; ei toimi, ellei lautanen ole kohdallaan. Mustaan kuvaan tulee punainen neli&ouml; pohjalle, jos lautanen ei ole kohdallaan. Yrit&auml; kohdistaa lautasta 1 aste l&auml;nteen eli sinne, miss&auml; aurinko paistaa kello 15.00. (T&auml;st&auml; en ole varma talviaikana!)</p>
						<center>
							<p><img height="138" width="267" src="kuvat/haku.jpg" alt=" "></p>
						</center>
						<p>Aikaa t&auml;m&auml; vei noin kuusi tuntia. Aloitin aamulla yhdeks&auml;lt&auml;, ja k&auml;rsiv&auml;llisyys on parhaita puoliani, joten sain kuin sainkin kuvat esiin juuri kello 15.00. Ensimm&auml;isen&auml; taisi Nelonen (tulee joka digitilauksen yhteydess&auml;) ilmoittaa tuoneensa kuvaa ja &auml;&auml;nt&auml; koneelleni. (Esimerkkitapauksessa kanava on Canal+.) T&auml;st&auml; innostuneena p&auml;&auml;tin hakea lis&auml;&auml; kanavia. Kuinka ollakaan, kaikkia kanavia ei heti saatu k&auml;ytt&ouml;&ouml;n, vaan jouduin noin kolmen tunnin p&auml;&auml;st&auml; k&auml;ynnist&auml;m&auml;&auml;n hakuohjelman loppuja kanavia varten. &quot;INFO&quot;-napilla saa esitteill&auml; olevasta ohjelmasta tietoa, joka n&auml;kyy tekstin&auml; mustalla pohjalla alhaalla. &quot;+&quot;-napilla n&auml;kee tekstitietoa ohjelman juonesta. Kanavat tulivat heti oikein kunnolla, ja sill&auml; hetkell&auml; asentamisesta tuli oikein hyv&auml;&auml; tunne.</p>
						<center>
							<p><img height="253" width="313" src="kuvat/canalplus.jpg" alt=" "></center>
					</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Jo vihdoinkin n&auml;kyy!</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Canal Digital mahdollistaa erilaisten ohjelmien ajastamisen tiettyyn aikaan itselle sopiviksi. Kuitenkaan ohjelmia ei saa esitetty&auml; miten tahansa, vaan ohjelmille on varattu tietty aika. Esim. MTV3:n tutut mokailut ovat historiaa, sill&auml; kaikki on valmiiksi tietokannassa, ja kun ohjelma alkaa, loppuu toinen l&auml;hetys. T&auml;ydellist&auml;! Ja viel&auml; ilman naurettavia min&auml;-min&auml;-kauppa-mainoksia, joilla tosin minutkin saatiin Canal Digital tilaamaan. :) T&auml;m&auml; tosin hoitui lehdess&auml; olleella ilmoituksella.
						<p>Ohjelman ja kanavan voi tietysti valita mieleisekseen, ja muitakin vaihtoehtoja l&ouml;ytyy pilvin pimein. Valitettavasti tila ei riit&auml; siihen, ett&auml; alkaisin selitt&auml;&auml; kaikkien toimintojen tarkoitukset. Tokihan tosi hardware-guru osaa englantia, joten lastenleikki&auml;h&auml;n t&auml;m&auml; kanavien ajastaminen on. Nauhoituksessa on syyt&auml; muistaa ohjelmoida video, sill&auml; vaikka laite on digitaalisesti hieno, se ei kuitenkaan l&auml;het&auml; normaalisti mit&auml;&auml;n tietoa videolle. ShowView on erikseen, ja sen koodit n&auml;kyv&auml;t muuten my&ouml;s TView-ohjelmassa, joka on imuroitavissa <a href="http://ftp.sunet.se/pub/aminet/comm/tcp/TView.lha">Aminetist&auml;</a>.</p>
						<center>
							<p><img height="181" width="263" src="kuvat/ohjelmointi.jpg" alt=" "></p>
						</center>
						<p>Canal Digital otti vastaan ensimm&auml;iset ohjelmapyynt&ouml;ni ja kirjasi minut j&auml;rjestelm&auml;&auml;n mukaan, kun sain homman toimimaan. Canal Digital k&auml;ytt&auml;&auml; muistaakseni ViaAccess-purkua, joka on kiinte&auml;n&auml; laitteessa. Ruotsalainen firma k&auml;ytt&auml;&auml; samaa purkua, joten moduulien vaihdot eiv&auml;t ole ongelma. Ilman korttia laite kertoo karua faktaa, ja vaikka kortti olisikin olemassa, t&auml;ytyy sinun olla mukana &quot;listalla&quot;, jotta saat oikeudet katsella salattuja kanavia.</p>
						<p>Ainoastaan Nokia-malleista uusin ei ole yhteensopiva (vaikkakin sopiva), sill&auml; kun laitetta k&auml;ytt&auml;&auml; Canal Digital -palveluissa, t&auml;ytyy siin&auml; olla modeemi mukaanrakennettuna. Uudessa Nokia Mediamasterissa sit&auml; ei ole. Voihan vanhan Nokia-palikan sijoittaa uuteen, mutta se voi jopa purkaa sopimuksen Canal Digitalin kanssa. Uusin Nokia-malli voi toisaalta ottaa vastaan salattuja ja ei-salattuja digikanavia, mik&auml; on huimaa Philipsin malliin verrattuna. Lis&auml;ksi siin&auml; on esiohjelmoituna muutama kanavakin.</p>
						<p>Canal Digital on myynyt t&auml;t&auml; Philipsi&auml; jo pari vuotta. Minua kiinnostivat ensimm&auml;isen&auml; Discovery-kanavat. Vaikka nyt myyd&auml;&auml;n Nokia-malliakin, osa niist&auml; saatavista kanavista on nyky&auml;&auml;n salattuja, jopa digitilaajille. Nokia pystyy sen sijaan seuraamaan ilmaisiakin digikanavia. Kanavat ja niiden tilaus on huippuluokkaa. Katselin muutamaan otteeseen ennen ty&ouml;llistymist&auml; (n. 12 h/p&auml;iv&auml;) kanavien tulemista ja poistumista.</p>
						<p>Digitaaliset set-top-boksit ovat tulossa Suomeen kovalla vauhdilla, ja aikaisemmin t&auml;m&auml; samainen j&auml;rjestelm&auml; ei ollut kauaakaan Saksassa, kunnes se ehti Suomeen. Byrokraattien hitauksien ja lakien takia on Canal Digitalin nousu ollut vaikeata, mutta nyt tuntuu helpottavan. Ouluunkin on mennyt tuhansia lautasia samalla kertaa, ei kai siit&auml; tarvitse muuta kertoa?-)</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Mit&auml; on tarjolla?</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Canal Digital tarjoaa esimerkiksi Formula-nautintoa sellaisesta kiinnostuneille. Valittavissa on seitsem&auml;n kameraa, joista kuusi on auto-, varikko- jne. kameroita ja viimeinen on mosaiikkikanava kaikista saatavilla olevista kameroista. Formula-nautintoa olen kerran kokeillut, ja t&auml;ll&auml; kertaa oman virhen&auml;pp&auml;ilyni seurauksena tilasin elokuvan, vaikka tarkoitus oli siis n&auml;ytt&auml;&auml; systeemin toimintaa. Noh, mik&auml;p&auml; olisi parempi tapa n&auml;ytt&auml;&auml; toimintaa kuin toiminta itse?-)
						<p>T&auml;ll&auml; hetkell&auml; minua kiinnostavia aiheita ovat mm. dinosaurukset (asiaa ja mielenkiintoista, Bob Bakker jne.), tietokoneet (sanomattakin selv&auml;&auml;), virukset (kemiaa suureksi osaksi), rikokset (Forensic detectives :), Ghost Hunters (juu, juu, mutta kiinnostavaa), Arthur C. Clarke (eniten seurattu!), Vietnamin sota (mit&auml;, kuka, miss&auml;), sota yleens&auml;, Weapons of War (sodan aseet) ja PowerZone (aaah = Apache + muut koneet). Listassa on vain osa siit&auml;, mit&auml; seuraan.</p>
						<p>Ensikokeilujen j&auml;lkeen sain eritt&auml;in hyv&auml;n kuvan laitteesta. Kuvanlaatu ei ensiksi ollut mik&auml;&auml;n kiitett&auml;v&auml;, sill&auml; sain pitki&auml; taukoja kuvan p&auml;ivitt&auml;misess&auml;, mutta tiesin, ett&auml; suunta oli oikea, ja kytkin laitteen RF-liit&auml;nn&auml;ll&auml; vanhaan telkkuun. Uuden 28&quot; telkun tullessa ja Nokian vallatessa yh&auml; komeampaa laitteistokokoonpanoani sain kytke&auml; my&ouml;s PIV:n sis&auml;&auml;nmenon kiinni erilaisiin laitteisiin, jolloin minulla olisi nyt k&auml;yt&ouml;ss&auml; muitakin laitteita kuin oma Amigani. (Digitaalikuvat ovat otettu suoraan laitteen live-esiintymisest&auml;.) WB:n p&auml;&auml;ll&auml; on my&ouml;s mahdollista esitt&auml;&auml; kaikkia kanavia, mutta ohjelma, joka nappaa kuvia ei t&auml;h&auml;n suostu, vaan j&auml;tt&auml;&auml; ruudun silt&auml; osin tyhj&auml;ksi. Asetukset olivat eritt&auml;in helppoja.</p>
						<p>Kanavien laatu on eritt&auml;in hyv&auml;, mik&auml; johtuu MPEG-2-pakkauksesta, jolloin voi pakata kuvaa melkein ihan miten haluaa, ja kanavia voi my&ouml;s l&auml;hett&auml;&auml; enemm&auml;n matkaan. Ainoa viive tulee taajuuden hakemisessa, joka kest&auml;&auml; noin sekunnin. T&auml;ss&auml; tapauksessa transponderi l&auml;hett&auml;&auml; 17 kanavaa yht&auml;aikaa, ellei enemm&auml;nkin. Bittivirta on noin 55 Mt/sek. Enemm&auml;nkin kanavia olisi varmasti suotavaa, mutten ole jaksanut etsi&auml; alkuhakujen j&auml;lkeen kuin muutamia kertoja. &Auml;&auml;nenlaatu on eritt&auml;in hyv&auml;, ja my&ouml;s tekstin ja kielen voi valita. &Auml;&auml;niformaatti ei ik&auml;v&auml; kyll&auml; tue Philips-mallilla AC-3:a (Dolby Digital), mutta tilanne kuitenkin muuttuu, sill&auml; Astra-19 E, Eutelsat 13 E, Sirius ja Thor 1 W l&auml;hett&auml;v&auml;t jo testin&auml; AC-3-normia.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Tilaamisen siet&auml;m&auml;t&ouml;n helppous</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Elokuvien tai sarjojen tilaaminen on helppoa. Laite vain kytket&auml;&auml;n puhelinpistokkeeseen, jotta data p&auml;&auml;see ulos, ja sen j&auml;lkeen onnistuu kaikenmoinen tilaaminen - liiankin helposti. T&auml;ll&auml; hetkell&auml; tilasin vahingossa elokuvan &quot;Hope Floats&quot;, jota en kuitenkaan ehtinyt katsomaan. :( Tarkoituksena oli kyll&auml; tilata Formuloita. Tilauskoodin j&auml;lkeen annetaan vain l&auml;ht&ouml;k&auml;sky, ja homma toimii.
						<center>
							<p><img height="151" width="237" src="kuvat/virhe.jpg" alt=" "></p>
						</center>
						<p>Loppujen lopuksi t&auml;ss&auml; tulee mieleen DVD-Internet. :) Vaikka lautasella pelk&auml;st&auml;&auml;n vastaanottaminen on tarkoitus, voi sill&auml; my&ouml;s vastaanottaa suoraan koneeseen kytkettyn&auml; verkkodataa, jolloin jokainen k&auml;ytt&auml;j&auml; on IP-verkossa. T&auml;ll&auml; hetkell&auml; oma Philipsini ei tue moista ominaisuutta, joten t&auml;ytyy ostaa laite, joka siihen pystyy.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Musiikkikanavia:</font></td>
					<td bgcolor="#d8ecfd">25&gt; (radiokanavat jne.)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Videokanavia:</font></td>
					<td bgcolor="#d8ecfd">80&gt;</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Pakkausalgoritmi:</font></td>
					<td bgcolor="#d8ecfd">MPEG-2</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Prosessori:</font></td>
					<td bgcolor="#d8ecfd">RISC (tiet&auml;&auml;kseni 32-bittinen)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Muisti:</font></td>
					<td bgcolor="#d8ecfd">noin 4 Mt EDO</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Symbolinopeus:</font></td>
					<td bgcolor="#d8ecfd">36500 m/s - 50 000 m/s</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Virheenkorjaus:</font></td>
					<td bgcolor="#d8ecfd">1/8</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">L&auml;ht&ouml;liit&auml;nn&auml;t: </font></td>
					<td bgcolor="#d8ecfd">
						<ul>
							<li>RCA (&auml;&auml;nelle)
							<li>2 x EURO-AV/Scart (TV &amp; video)
							<li>1 x BNC-passthru (analogiselle)
						</ul>
					</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Purkupiiri:</font></td>
					<td bgcolor="#d8ecfd">ViaAccess</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Korttipaikka:</font></td>
					<td bgcolor="#d8ecfd">Conax</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">K&auml;ytt&ouml;liittym&auml;:</font></td>
					<td bgcolor="#d8ecfd">MediaHighway (Ranska)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Plussaa:</font></td>
					<td bgcolor="#d8ecfd">
						<ul>
							<li>todella laadukas kuva ja &auml;&auml;ni
							<li>tilausvideopalvelut
							<li>helppok&auml;ytt&ouml;inen
							<li>mahdollisuus Internet-k&auml;ytt&ouml;&ouml;n
						</ul>
					</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Miinusta:</font></td>
					<td bgcolor="#d8ecfd">
						<ul>
							<li>1200 markan alkurys&auml;ys!
							<li>ei toistaiseksi tue DTS/AC3:a
						</ul>
					</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">L&auml;hteet:</font></td>
					<td bgcolor="#d8ecfd">
						<ul>
							<li>Tekniikan Maailma 1/2000, s. 51-54
							<li>Canal Digital -ohjevihkonen
							<li>Internet
						</ul>
					</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
