<!!!!!!!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Sekalaiset</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Z&ouml;&ouml;zi kanttori</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Petri Keckman &lt;<a href="mailto:keckman@mbnet.fi">keckman@mbnet.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Edellisess&auml; Sakussa artikkelissani &quot;Suhtari&quot; romutin nykyfysiikkaa. T&auml;ss&auml; Sakussa romutan matematiikan perusteita. Painotan, ett&auml; artikkelini t&auml;ytt&auml;v&auml;t tieteellisen ja loogisen p&auml;tevyyden, vaikka niiss&auml; on osittain pieni humoristinen perusvire - matematiikkakin voi olla hauskaa! Jos nykyp&auml;iv&auml;n tieteilij&auml;t eiv&auml;t artikkeleitani noteeraa, niin sen kyll&auml; tulevat tekem&auml;&auml;n tulevaisuuden tieteilij&auml;t. T&auml;ss&auml; artikkelissa perustelen v&auml;itteit&auml;, ett&auml; R=Q ja ett&auml; numeroituvuuden k&auml;site on ristiriitainen. Ai mik&auml; se on?
						<center>
							<p><img height="165" width="135" src="kuvat/cantor.gif" alt=" "></p>
						</center>
						<p>Aloitetaan alusta: Sir Georg <img height="22" width="106" src="kuvat/cantor0.gif" alt=" "> Cantor (1845-1918) loi v&auml;lineist&ouml;n ja k&auml;sitteet, joilla &auml;&auml;rett&ouml;m&auml;t joukot saatiin matematiikkaan. &Auml;&auml;rett&ouml;mien joukkojen teoriassa on k&auml;site &quot;numeroituvuus&quot; t&auml;rke&auml;. Jokin joukko X on numeroituva, jos se on &quot;yht&auml; mahtava&quot; kuin luonnollisten lukujen joukko N={0,1,2,... .}. Yht&auml; mahtava se taas on, jos - ja vain jos - l&ouml;ytyy yksik&auml;sitteinen kuvaus X:st&auml; N:&auml;&auml;n, jossa jokaiseen X:n alkioon voidaan liitt&auml;&auml; eri N:n alkio, siis luonnollinen luku, ja samoin jokaiseen N:n alkioon voidaan liitt&auml;&auml; yksik&auml;sitteinen X:n alkio. Hienosti sanottuna kyseess&auml; on bijektiivinen kuvaus.</p>
						<p>Numeroituvuus merkitsee sit&auml;, ett&auml; joukon X kaikki alkiot voidaan luetella jossakin j&auml;rjestyksess&auml; siten, ett&auml; niihin jokaiseen liitet&auml;&auml;n eri j&auml;rjestysnumero 0,1,2,... Voisi &auml;kki&auml; ajatella, ett&auml; esimerkiksi murtolukujen joukko olisi &quot;mahtavampi&quot; kuin luonnollisten lukujen joukko, sill&auml; voidaanhan kaikki luonnolliset luvut kuvata mink&auml; tahansa kahden erisuuren murtoluvun a ja b v&auml;liin vaikkapa kuvauksella f(n)=b-(b-a)/(n+1). Josta siis f(0)=a ja f(n) l&auml;hestyy b:t&auml; kun n l&auml;hestyy &auml;&auml;ret&ouml;nt&auml;. f(0)=b-(b-a)/(0+1)=b-b+a=a ja f(99999999)=b+(b-a)/100000000. Esimerkiksi jos a=1,2 ja b=1,3 saadaan:</p>
						<p><font size="2">
						<table border="0" cellpadding="0" cellspacing="6">
							<tr>
								<td><font size="2">f(0)=1,200000</font></td>
								<td><font size="2">f(1)=1,250000</font></td>
								<td><font size="2">f(2)=1,266667</font></td>
							</tr>
							<tr>
								<td><font size="2">f(3)=1,275000</font></td>
								<td><font size="2">f(4)=1,280000</font></td>
								<td><font size="2">f(5)=1,283333</font></td>
							</tr>
							<tr>
								<td><font size="2">f(6)=1,285714</font></td>
								<td><font size="2">f(7)=1,287500</font></td>
								<td><font size="2">f(8)=1,288889</font></td>
							</tr>
							<tr>
								<td><font size="2">f(9)=1,290000</font></td>
								<td><font size="2">f(10)=1,290909</font></td>
								<td><font size="2">f(11)=1,291667</font></td>
							</tr>
							<tr>
								<td><font size="2">f(12)=1,292308</font></td>
								<td><font size="2">f(13)=1,292857</font></td>
								<td><font size="2">f(14)=1,293333</font></td>
							</tr>
							<tr>
								<td><font size="2">f(15)=1,293750</font></td>
								<td><font size="2">f(16)=1,294118</font></td>
								<td><font size="2">f(17)=1,294444</font></td>
							</tr>
							<tr>
								<td><font size="2">f(18)=1,294737</font></td>
								<td><font size="2">f(19)=1,295000</font></td>
								<td><font size="2">f(100)=1,299010</font></td>
							</tr>
							<tr>
								<td><font size="2">f(1000)=1,299900</font></td>
								<td><font size="2">f(10000)=1,299990</font></td>
								<td><font size="2">f(100000)=1,299999</font></td>
							</tr>
						</table>
						</font></p>
						<p>Seuraavassa kuvassa on viel&auml; esimerkin vuoksi tarkasteltu tilannetta kun a=18,3 ja b=18,8. Keskell&auml; on kokonaislukuakseli, josta numerot 0..27 on kuvattu v&auml;lille a..b. Alla on lueteltu lis&auml;&auml; lukuja.</p>
						<center>
							<p><a href="kuvat/cantor1.gif" target="_blank"><img height="96" width="256" src="kuvat/cantor1s.gif" alt=" "></a></p>
						</center>
						<p>a ja b voidaan valita siis mielivaltaisen l&auml;helt&auml; toisiaan, ja t&auml;llaisia v&auml;lej&auml; mahtuu mihin tahansa kahden annetun luvun v&auml;liin viel&auml; &auml;&auml;rett&ouml;m&auml;n monta, ja vaikka niiden pituus lukuakselilla voidaan saada mielivaltaisen l&auml;helle nollaa, niin n&auml;ihin kaikkiin v&auml;leihin erikseen voidaan kaikki luvut 0,1,2,... kuvata. Jokaisessa v&auml;liss&auml; &quot;riitt&auml;isi siis lueteltavaa kaikille luonnollisille luvuille loppuel&auml;m&auml;ksi&quot;. Tuntuu oudolta, ett&auml; kuitenkin on olemassa m&auml;&auml;ritelm&auml; &quot;yht&auml; mahtavuus&quot;, joka siis sanoo, ett&auml; luonnollisten lukujen joukko N on yht&auml; mahtava kuin koko murtolukujen joukko Q, kun n&auml;ytt&auml;isi ilmeiselt&auml;, ett&auml; murtolukujen joukko Q on &auml;&auml;rett&ouml;m&auml;n monta kertaa &quot;suurempi&quot; kuin N.</p>
						<p>Joukkojen Q ja N &quot;yht&auml;mahtavuutta&quot; perustellaan er&auml;&auml;nlaisella luettelotempulla. Kaikki rationaaliluvut eli murtoluvut ovat siis m&auml;&auml;ritelt&auml;viss&auml; kahden luonnollisen luvun n ja m jakolaskuna eli osam&auml;&auml;r&auml;n&auml; n/m. Q on niiden alkioiden n/m joukko, miss&auml; n ja m kuuluvat N:&auml;&auml;n. Tehd&auml;&auml;n kaksiulotteinen taulukko, jossa riveitt&auml;in kasvaa n ja sarakkeittain m.</p>
						<center>
							<p><img height="86" width="354" src="kuvat/cantor2.gif" alt=" "></p>
						</center>
						<p>Annetaan nyt jokaiselle murtoluvulle j&auml;rjestysnumero siten, ett&auml; luvut luetellaan vinottain:</p>
						<center>
							<p><img height="104" width="362" src="kuvat/cantor3.gif" alt=" "></p>
						</center>
						<p>Jokaiseen annettuun murtolukuun n/m voidaan n&auml;in liitt&auml;&auml; yksi ja m&auml;&auml;r&auml;tty luonnollinen luku. Sivuutan t&auml;ss&auml; nyt negatiiviset luvut, sill&auml; ne voidaan lis&auml;t&auml; luetteloon muodostamalla toinen samanlainen taulukko ja ottamalla joka toisen luvun sielt&auml;. Murtolukujen joukossa samaistetaan luvut, jotka ovat muotoa (i*n)/(i*m) ja n/m. Esimerkiksi kaikki vinoakselilla n,n olevat luvut 1/1, 2/2, ... ovat samat kuin 1, joista vain ensimm&auml;inen 1/1 otetaan ja muut pyyhit&auml;&auml;n yli. Samoin 6/2 = 3/1 jne... N&auml;ihin jokaiseen on kuitenkin liitetty luonnollinen luku. Luonnollisia lukuja pit&auml;isi olla siis &quot;niin paljon enemm&auml;n&quot;, ett&auml; niit&auml; on varaa tuhlata ylim&auml;&auml;r&auml;isten numerointiin, vaikka edell&auml; v&auml;h&auml;n jo perustelin, miksi niit&auml; on &auml;&auml;rett&ouml;m&auml;n monta kertaa v&auml;hemm&auml;n.</p>
						<p>Vaikka murtoluvut voidaan Cantorin ja nykymatemaatikoiden mielest&auml; luetella, niin reaalilukuja - joihin kuuluvat my&ouml;s p&auml;&auml;ttym&auml;tt&ouml;m&auml;t desimaalikehitelm&auml;t kuten 0,1234567891011121314..., pii=3,141592643589 jne. ei sent&auml;&auml;n voida.</p>
						<p>Heid&auml;n todistuksensa on seuraavanlainen (perustuu vastav&auml;itteeseen): oletetaan, ett&auml; kaikki reaaliluvut v&auml;lilt&auml; 0...1 (edes t&auml;lt&auml; v&auml;lilt&auml;) voitaisiin luetella jossakin j&auml;rjestyksess&auml;, esimerkiksi:</p>
						<p>I:</p>
						<p><font size="2"><nobr>r(0)=0,89737775667080080857467873875759757587462856567674...<br>
						r(1)=0,5767747387376876764474874476086083348685378588860868...<br>
						r(2)=0,567800000000000000000000000000000000000000000000000000<br>
						r(3)=0,45466745453679885796799779767766796708204820099599496...</nobr></font></p>
						<p>Konstruoidaan nyt luku r siten, ett&auml; k&auml;yd&auml;&auml;n listaa l&auml;pi ja jokaisen luvun r(n) kohdalla lis&auml;t&auml;&auml;n r:&auml;&auml;n luvun r(n) n:s desimaali siten, ett&auml; siihen lis&auml;t&auml;&auml;n 1. Jos luvun r(n) n:s desimaalinumero on 3, laitetaan r:&auml;&auml;n 4. 9:st&auml; laitetaan 0. Luvun r alku n&auml;ytt&auml;&auml; siis: 0,9887...</p>
						<pre><font size="2">r(0)=0.89737</font>
<font size="2">       |</font>
<font size="2">       8+1=_9_</font>
<font size="2">r(1)=0.57677</font>
<font size="2">        |</font>
<font size="2">        7+1=_8_</font>
<font size="2">r(2)=0.56780</font>
<font size="2">         |</font>
<font size="2">         7+1=_8_</font>
<font size="2">r(3)=0.45466</font>
<font size="2">          |</font>
<font size="2">          6+1=_7_</font></pre>
						<p>Luku r tulee siis eroamaan kaikista luetelluista luvuista, koska se eroaa niist&auml; jokaisesta ainakin yhdell&auml; desimaalilla. Koskaan ei tiedet&auml;, voisiko luvun r(n) kohdalla konstruoitu luku r olla kuitenkin jo seuraava, mutta seuraavan luvun kohdalla jatketaan luvun r konstruointia siten, ett&auml; se eroaa kaikista jo luetelluista luvuista. Kuinka t&auml;m&auml; eroaisi siit&auml;, ett&auml; todistettaisiin, ettei edes luonnollisia lukuja voida luetella miss&auml;&auml;n j&auml;rjestyksess&auml; vastaavalla tavalla? Oletetaan, ett&auml; luonnolliset luvut voitaisiin luetella jossakin j&auml;rjestyksess&auml;.</p>
						<p><font size="2">f(0)=0<br>
						f(1)=5453533<br>
						f(2)=5367568797<br>
						f(3)=1</font></p>
						<p>Yleens&auml;h&auml;n luonnolliset luvut luetellaan suuruusj&auml;rjestyksess&auml; 0,1,2,... mutta t&auml;ss&auml; nyt oletetaan, ett&auml; ne olisi voitu edes jossakin j&auml;rjestyksess&auml; luetella.</p>
						<p>Konstruoidaan nyt luku i siten, ett&auml; aina luvun f(n) kohdalla siihen lis&auml;t&auml;&auml;n f(n)+1. Aluksi i on siis 0 ja siihen lis&auml;t&auml;&auml;n f(0):n kohdalla f(0)+1. Saadaan</p>
						<pre><font size="2"><nobr>f(0)=0           i=0+1=1</nobr></font>
<font size="2"><nobr>f(1)=5453533     i=1+5453533+1=5453535</nobr></font>
<font size="2"><nobr>f(2)=5367568797  i=5453535+5367568797+1=5373022332</nobr></font>
<font size="2"><nobr>f(3)=1           i=5373022332+1=5373022333</nobr></font></pre>
						<p>Luku i eroaa varmasti kaikista jo luetelluista luvuista, onhan se niit&auml; kaikkia suurempi. Siis luonnollisia lukuja ei voida luetella? Samoin kuin ei reaalilukuja. Vai miten t&auml;m&auml; eroaa todistuksesta, jossa todistettiin ett&auml; reaalilukuja ei voida luetella? Jos yrit&auml;t selitt&auml;&auml; jotain, ett&auml; reaalilukuja koskevassa todistuksessa ollaan jo etuk&auml;teen varmoja, ett&auml; konstruoitua lukua ei tule olemaan luettelossa, kun taas esimerkiksi lueteltaessa luonnollisia lukuja ihan tavallisessa suuruusj&auml;rjestyksess&auml;, ollaan varmoja, ett&auml; mille tahansa luvulle n l&ouml;ytyy siit&auml; paikka - se on nimitt&auml;in n:nten&auml; luettelossa - niin se ei p&auml;de. Sill&auml; voidaanhan reaalilukuja yritt&auml;&auml; luetella toisella tavalla: aina luvun r(n) kohdalla konstruoitu luku r siirret&auml;&auml;n seuraavaksi ja sit&auml; seuraavia yhden pyk&auml;l&auml;n eteenp&auml;in.</p>
						<p>Siis edellisen yrityksen I tapa luetella reaalilukuja muutetaan seuraavanlaiseksi:</p>
						<p>II:</p>
						<p><font size="2"><nobr>r(0)=0,89737775667080080857467873875759757587462856567674...<br>
						r(1)=0,9<br>
						r(2)=0,5767747387376876764474874476086083348685378588860868...<br>
						r(3)=0,98<br>
						r(4)=0,567800000000000000000000000000000000000000000000000000<br>
						r(5)=0,988<br>
						r(6)=0,45466745453679885796799779767766796708204820099599496...<br>
						r(7)=0,9887</nobr></font></p>
						<p>T&auml;ss&auml; luettelossa on nyt tilanne jokaisen luvun kohdalla sellainen, ett&auml; vaikka kuinka yritet&auml;&auml;n konstruoida desimaalilukua, jota ei voida luetella, niin se &auml;nke&auml;&auml; itsens&auml; heti seuraavaksi. Ihan sama kuin jos luonnollisia lukuja lueteltaessa konstruoitaisiin jokaisen luvun kohdalla n luku n+1 ja todistetaan, ettei luonnollisia lukuja voida luetella, koska jokaisen luvun kohdalla on konstruoitavissa luku, joka ei ole esiintynyt listassa. T&auml;ll&auml; asialla on nyt artikkelissani sellainen painoarvo, ett&auml; jos matemaatikot eiv&auml;t t&auml;h&auml;n reagoi ja vastaa, miss&auml; teen p&auml;&auml;ttelyss&auml;ni virheen, niin samoin kuin katson edellisess&auml; Sakussa kumonneeni suhteellisuusteorian, niin nyt katson kumonneeni matematiikan perusteet, ellei t&auml;h&auml;n vastata (koska ei voida vastata muuta kuin v&auml;&auml;rin perustein). Luonnollisia lukuja lueteltaessa ovat t&auml;sm&auml;lleen samat ehdot voimassa kuin tavassa yritt&auml;&auml; luetella desimaalilukuja v&auml;lilt&auml; 0...1 todistettaessa ettei niin voi tehd&auml;.</p>
						<ol>
							<li>Jokaisen luvun kohdalla konstruoidaan luku, jota ei ole ollut listassa.
							<li>Siis, p&auml;&auml;teltiin, ett&auml; on olemassa luku, joka ei ole listassa.
							<li>Luetteloa muodostettaessa siit&auml; ei kuitenkaan tiedet&auml; muuta kuin ett&auml; se ei ole esiintynyt viel&auml; (ja yll&auml; olevassa tavassa II seh&auml;n aina esiintyy jo seuraavana my&ouml;s desimaaliluvuilla).
						</ol>
						<p>Mik&auml; on se matemaattisen tarkasti ilmaistavissa oleva ero? Matemaatikoilta haluaisin kysy&auml; t&auml;t&auml;. Tosin matemaatikot eiv&auml;t ik&auml;v&auml; kyll&auml; lue Sakua, kuten eiv&auml;t ilmeisesti fyysikotkaan, sill&auml; muutenhan he olisivat jo teilanneet edellisess&auml; Sakussa olleen artikkelini?</p>
						<p>Matematiikanhan v&auml;itet&auml;&auml;n olevan tarkkaa ja eksaktia, eik&auml; siin&auml; saisi pit&auml;yty&auml; mihink&auml;&auml;n &quot;musta tuntuu&quot; -todistuksiin. Kyll&auml; minustakin tuntuu, ettei reaalilukuja voida luetella, mutta minusta tuntuu my&ouml;s, ettei rationaalilukuja voida liitt&auml;&auml; yksik&auml;sitteisesti luonnollisiin lukuihin. Ja itse asiassa minusta tuntuu, ettei edes luonnollisia lukuja voida luetella - tai ainakaan niit&auml; ei voida luetella samasta syyst&auml; ja samanlaisen todistuksen perusteella kuin desimaalilukuja.</p>
						<p>Palataan rationaalilukujen luettelointiyritykseen taulukkotempulla, josta muuten voidaan todeta, ett&auml; k&auml;sitt&auml;&auml;kseni mit&auml;&auml;n suoraa lauseketta ei ole olemassa murtoluvun liitt&auml;miseen luonnolliseen, vaan se t&auml;ytyy aina algoritmillisesti konstruoida. Jos ei tarvitsisi pyyhki&auml; yli supistetussa muodossaan olevan luvun useita esiintymisi&auml;, niin sitten lukuun n/m liitetty j&auml;rjestysnumero i olisi helposti laskettavissa: i=(n-1)(n/2)+(n-1)(m-1)+m(m-1)/2. Tosin t&auml;m&auml; lauseke p&auml;tee, jos lukuja luetellaan aina oikealta ylh&auml;&auml;lt&auml; vasemmalle alasp&auml;in eik&auml; vuorotellen, mutta vastaavanlainen lauseke jossa esiintyisi tekij&auml;n&auml; mod(2) saataisiin t&auml;ss&auml; k&auml;ytetylle siksak-luetteloinnille.</p>
						<p>Mutta koska n&auml;in ei voida tehd&auml;, ja eri murtolukujen samat supistetut esitysmuodot samaistetaan, ei ole olemassa lausekkeellista bijektiivist&auml; kuvausta N-&gt;Q. Meill&auml; on siis vain k&auml;yt&auml;nt&ouml; ja &auml;&auml;relliset tietokoneet murtolukujen liitt&auml;miseen luonnollisiin lukuihin.</p>
						<p>Alla olevan kuvan soluissa alkioina olevat luvut ovat:</p>
						<ol>
							<li>ylimp&auml;n&auml; rivi- ja sarakenumeroa vastaava i/j
							<li>sen suora j&auml;rjestysnumero
							<li>ylipyyhittyjen perusteella saatu uusi j&auml;rjestysnumero
							<li>suurimman yhteisen tekij&auml;n supistuksen j&auml;lkeen saatu (i/j) supistettuna syt:ll&auml;
						</ol>
						<center>
							<p><img height="143" width="390" src="kuvat/cantor4.gif" alt=" "></p>
						</center>
						<p>Mit&auml; kauemmaksi luettelossa menn&auml;&auml;n, sit&auml; suuremmaksi tulee ylipyyhittyjen murtolukujen m&auml;&auml;r&auml; suhteessa kaikkiin osam&auml;&auml;riin. Ensimm&auml;inen ylipyyhitty on siis 2/2, joka on viides lueteltu luku. Miljoonannen luvun kohdalla ylipyyhittyj&auml; on 39,1196 %.</p>
						<pre><font size="2"><nobr> ruudun suora  sieven-   rivi/   sieven- sievennetyt 1000:n</nobr></font>
<font size="2"><nobr> j&auml;rjestys-    nettyj&auml;  sarake   netty   /kaikki     otanta</nobr></font>
<font size="2"><nobr> numero</nobr></font>
<font size="2"><nobr>         1        0      1/1      1/1    0.000000</nobr></font>
<font size="2"><nobr>         2        0      1/2      1/2    0.000000</nobr></font>
<font size="2"><nobr>         3        0      2/1      2/1    0.000000</nobr></font>
<font size="2"><nobr>         4        0      3/1      3/1    0.000000</nobr></font>
<font size="2"><nobr>         5        1      2/2      1/1    0.200000</nobr></font>
<font size="2"><nobr>         6        1      1/3      1/3    0.166667</nobr></font>
<font size="2"><nobr>         7        1      1/4      1/4    0.142857</nobr></font>
<font size="2"><nobr>         8        1      2/3      2/3    0.125000</nobr></font>
<font size="2"><nobr>         9        1      3/2      3/2    0.111111</nobr></font>
<font size="2"><nobr>        10        1      4/1      4/1    0.100000</nobr></font>
<font size="2"><nobr>        11        1      5/1      5/1    0.090909</nobr></font>
<font size="2"><nobr>        12        2      4/2      2/1    0.166667</nobr></font>
<font size="2"><nobr>        13        3      3/3      1/1    0.230769</nobr></font>
<font size="2"><nobr>        14        4      2/4      1/2    0.285714</nobr></font>
<font size="2"><nobr>        15        4      1/5      1/5    0.266667</nobr></font>
<font size="2"><nobr>        16        4      1/6      1/6    0.250000</nobr></font>
<font size="2"><nobr>        17        4      2/5      2/5    0.235294</nobr></font>
<font size="2"><nobr>        18        4      3/4      3/4    0.222222</nobr></font>
<font size="2"><nobr>        19        4      4/3      4/3    0.210526</nobr></font>
<font size="2"><nobr>       100       32      9/6      3/2    0.320000</nobr></font>
<font size="2"><nobr>      1000      368     36/10    18/5    0.368000 0.382000 (1000</nobr></font>
<font size="2"><nobr>     10000     3845     12/130    6/65   0.384500 0.365000 -2000)</nobr></font>
<font size="2"><nobr>    100000    38990    129/319  129/319  0.389900 0.383000</nobr></font>
<font size="2"><nobr>   1000000   391196   1009/406 1009/406  0.391196 0.481000</nobr></font>
<font size="2"><nobr>  10000000  3918075   2844/1629 316/181  0.391808 0.437000</nobr></font>
<font size="2"><nobr> 100000000 39196810  8989/5154 8989/5154 0.391968</nobr></font></pre>
						<p>Lukujen luettelointij&auml;rjestyksest&auml; johtuu, ett&auml; jos luku yleens&auml;k&auml;&auml;n voidaan sievent&auml;&auml;, sen sievennetty versio on jo lueteltu, sill&auml; luku i/j esiintyy luettelossa aina ennen lukua n*i/n*j. T&auml;m&auml; ylipyyhittyjen m&auml;&auml;r&auml;n kasvu ei ole niin oleellista, mutta onpahan vain artikkelissa mukana, kun tietokoneella ja luvuilla leikkiminen on niin hauskaa. Mutta seuraava asia on (oleellinen):</p>
						<p>Kun tarkastellaan murtolukuun n/m liitetty&auml; j&auml;rjestyslukua (suoraa tai supistetut huomioiden) ja verrataan sit&auml; suurimpaan taulukossa esiintyneeseen murtolukuun n/m listaamalla niit&auml; alusta hieman...:</p>
						<pre><font size="2"><nobr>suora       oikea      suurin  suhde</nobr></font>
<font size="2"><nobr>j&auml;rjestys-  j&auml;rjestys- arvo</nobr></font>
<font size="2"><nobr>luku        luku</nobr></font>
<font size="2"><nobr>       1        1        1     1.000000</nobr></font>
<font size="2"><nobr>       2        2        1     0.500000</nobr></font>
<font size="2"><nobr>       3        3        2     0.666667</nobr></font>
<font size="2"><nobr>       4        4        3     0.750000</nobr></font>
<font size="2"><nobr>       5        4        3     0.750000</nobr></font>
<font size="2"><nobr>       6        5        3     0.600000</nobr></font>
<font size="2"><nobr>       7        6        3     0.500000</nobr></font>
<font size="2"><nobr>       8        7        3     0.428571</nobr></font>
<font size="2"><nobr>       9        8        3     0.375000</nobr></font>
<font size="2"><nobr>      10        9        4     0.444444</nobr></font>
<font size="2"><nobr>      20       16        5     0.312500</nobr></font>
<font size="2"><nobr>      30       23        7     0.304348</nobr></font>
<font size="2"><nobr>     100       68       13     0.191176</nobr></font>
<font size="2"><nobr>     200      133       19     0.142857</nobr></font>
<font size="2"><nobr>     300      199       24     0.120603</nobr></font>
<font size="2"><nobr>    1000      632       45     0.071203</nobr></font>
<font size="2"><nobr>    2000     1251       63     0.050360</nobr></font>
<font size="2"><nobr>    3000     1854       77     0.041532</nobr></font>
<font size="2"><nobr>   10000     6155      141     0.022908</nobr></font>
<font size="2"><nobr>   20000    12297      199     0.016183</nobr></font>
<font size="2"><nobr>   30000    18379      245     0.013330</nobr></font>
<font size="2"><nobr>  100000    61010      447     0.007327</nobr></font>
<font size="2"><nobr>  200000   122030      631     0.005171</nobr></font>
<font size="2"><nobr>  300000   182973      775     0.004236</nobr></font>
<font size="2"><nobr> 1000000   608804     1413     0.002321</nobr></font>
<font size="2"><nobr> 2000000  1217203     1999     0.001642</nobr></font>
<font size="2"><nobr> 3000000  1825275     2449     0.001342</nobr></font>
<font size="2"><nobr>10000000  6081925     4471     0.000735</nobr></font>
<font size="2"><nobr>20000000 12162604     6325     0.000520</nobr></font>
<font size="2"><nobr>30000000 18242397     7745     0.000425</nobr></font></pre>
						<p>...havaitaan, ett&auml; j&auml;rjestysluku kasvaa huomattavan nopeasti ja on jokaisella vinorivill&auml; suurempi kuin mik&auml;&auml;n sill&auml; esiintyv&auml; murtoluku, johon se on liitetty. Suurin murtoluku joka sijaitsee vinorivill&auml; (ks. seuraava kuva alla), jolla sijaitsee luku n/m on ensimm&auml;isell&auml; sarakkeella sijaitseva (n+m-1), ja suurin suorista j&auml;rjestysluvuista, jotka ylip&auml;&auml;t&auml;ns&auml; voidaan laskea, on (n+m-1)*(n+m)/2 ja n&auml;iden suhde 2/(n+m) l&auml;hestyy nollaa kun n+m kasvaa.</p>
						<p>Luonnollisten lukujen joukko on kuitenkin murtolukujen aito osajoukko ja kaikille luonnollisillekin luvuille l&ouml;ytyy j&auml;rjestysnumero. Varmasti jokaisella luonnollisella luvulla n on paikkansa taulukossa, onhan se n/1 ja esiintyy siis n:n rivin ensimm&auml;isess&auml; sarakkeessa. Mutta t&auml;st&auml; huolimatta jokaisen vinorivin kohdalla voidaan konstruoida n kappaletta lukuja - nimitt&auml;in kaikki j&auml;rjestysluvut - jotka eiv&auml;t ole esiintyneet viel&auml; listassa. Siis j&auml;rjestysluvuille ei ole viel&auml; l&ouml;ytynyt j&auml;rjestyslukua.</p>
						<p>Eik&ouml; tilanne muistuta taas samaa tapaa, jolla Cantor todisti, ettei reaalilukuja voida luetella? Varsinkin kun korostetaan sit&auml;, ettei ole olemassa matemaattista lauseketta lukuun n/m liitetylle j&auml;rjestysluvulle, koska ei tiedet&auml;, kuinka monta sit&auml; ennen on pyyhitty yli. Tai jos ylipyyhityt j&auml;tet&auml;&auml;n vain noteeraamatta eli luonnollisia lukuja &quot;tuhlataan&quot; ylim&auml;&auml;r&auml;isten luettelointiin, niin sitten on lauseke (n-1)(n/2)+(n-1)(m-1)+m(m-1)/2, joka liitt&auml;&auml; murtolukuun n/m sen j&auml;rjestysluvun.</p>
						<center>
							<p><a href="kuvat/cantor5.gif" target="_blank"><img height="62" width="262" src="kuvat/cantor5s.gif" alt=" "></a></p>
						</center>
						<p>J&auml;rjestysluku voidaan muuten p&auml;&auml;tell&auml; pinta-aloja tarkastelemalla. P&auml;&auml;tell&auml;&auml;n yll&auml; olevasta kuvasta esim. ruudun 7/6 suora j&auml;rjestysnumero. Koko eri v&auml;reill&auml; v&auml;ritetyn neli&ouml;osan pinta-ala on 12*12=(7+6-1)*(7+6-1). Siit&auml; v&auml;hennet&auml;&auml;n alemman puolikkaan pinta-ala (12*11)/2 - joka voidaan p&auml;&auml;tell&auml; siit&auml;, ett&auml; sarjan 1+2+...+n summa on (n+1)*(n/2) (Gaussin summa: ensimm&auml;inen + viimeinen, toinen plus tokavika,.. niiden kaikkien arvo on n+1 ja niit&auml; on n/2 kappaletta) - ja lis&auml;t&auml;&auml;n joko 7 tai 6 riippuen siit&auml;, kumpaan suuntaan ollaan luettelemassa vinorivi&auml;, jolla 7/6 sijaitsee. Ilmeisesti 7, koska (7+6) mod 2 = 1. Siis n/m:n suora j&auml;rjestysnumeron on p&auml;&auml;telty olevan (n+m-1)(n+m-1)-(n+m-2)(n+m-1)/2 johon lis&auml;t&auml;&auml;n joko n tai m riippuen siit&auml; kumpaan suuntaan ollaan kuljettu eli lausekkeena esim.:((n+m) mod 2)(n+m)-m ja lauseke olisi muodossa (n+m-1)(n+m-1)-(n+m-2)(n+m-1)/2+n, jos vinorivej&auml; kuljettaisiin aina samaan suuntaan, ja sieventyisi yll&auml; antamaani muotoon.</p>
						<p>Mit&auml; haluan tarkasteluillani sanoa? V&auml;itt&auml;&auml;k&ouml;, ett&auml; taulukosta puuttuu jokin murtoluku n/m? Ei, sit&auml; en halua sanoa ainakaan jos minun pit&auml;isi kertoa, mik&auml; luku siit&auml; puuttuu, mutta ei siit&auml; seuraa, ett&auml; numeroitavuuden k&auml;site olisi j&auml;rkev&auml; tai ett&auml; Cantorin todistukset olisivat sit&auml; tai ett&auml; koko &auml;&auml;rett&ouml;m&auml;n k&auml;sitteess&auml; olisi mielt&auml;. Jos N:&auml;&auml;n kelpuutetaan kaikki luvut n+1 jos n kuuluu N:&auml;&auml;n, niin samoin kaikki murtoluvut muotoa a+1/n kelpuutetaan Q:hun jos a kuuluu Q:hun. T&auml;st&auml; seuraisikin, ett&auml; reaaliluvut kuuluisivat Q:hun, sill&auml; ne on m&auml;&auml;ritelty rationaalilukujen p&auml;&auml;ttym&auml;tt&ouml;min&auml; sarjoina. Esim. pii voidaan esitt&auml;&auml; muodossa pii=1-1/3+1/5-1/7+..., joka kuuluisi murtolukuihin samoin kun kaikki luvut n+1 kuuluvat aina N:&auml;&auml;n jos n kuuluu N:&auml;&auml;n.</p>
						<p>&Auml;&auml;rett&ouml;m&auml;n k&auml;sitteeseen on matematiikassa t&ouml;rm&auml;tty raja-arvoja m&auml;&auml;rittelem&auml;ll&auml;. En tied&auml;, kuinka matemaatikot suhtautuvat esim. luvun 33333.../111111... raja-arvoon. Seh&auml;n on ilmiselv&auml;sti kolme. T&auml;ss&auml; vain k&auml;ytet&auml;&auml;n &auml;&auml;rett&ouml;m&auml;n pitki&auml; lukuja. Kuuluvatko ne N:&auml;&auml;n? Jos eiv&auml;t, niin mill&auml; perusteella? N:&auml;&auml;nh&auml;n kuuluvat kaikki muotoa n+1 olevat luvut, jos n kuuluu N:&auml;&auml;n. Ja luku 333333... voidaan m&auml;&auml;ritell&auml; &auml;&auml;rett&ouml;m&auml;n&auml; summana 3+30+300+3000+... joka kuuluu N:&auml;&auml;n, vaikka termej&auml; olisi - ja kun niit&auml; on - &auml;&auml;rett&ouml;m&auml;n monta. T&auml;t&auml; kautta N saataisiinkin yht&auml; mahtavaksi kuin R, jos luvuiksi kelpuutetaan &auml;&auml;rett&ouml;m&auml;n pitk&auml;t. Jos ei kelpuuteta, niin miksi muuten ylip&auml;&auml;t&auml;ns&auml; leikit&auml;&auml;n &auml;&auml;rett&ouml;mill&auml; luvuilla, kun kaikki reaalinen on &auml;&auml;rellist&auml; (paitsi ehk&auml; aika - paitsi ihmisel&auml;m&auml;lle)?</p>
						<p>Rationaalilukujen luettelotempusta totean viel&auml;: Esitin jo taulukkoluetteloon liittyen funktion F(n,m), jolla liitettiin rationaalilukuun (n/m) sen luonnollinen &quot;luetteloluku&quot; i = (n+1)(n/2) + (n-1)(m-1) + m(m-1)/2. L&ouml;ytyyk&ouml; t&auml;lle selke&auml;&auml; k&auml;&auml;nteiskuvausta ts. kahta lauseketta f(i) ja g(i), joilla luonnollisesta luvusta i saataisiin selville sit&auml; vastaava murtoluku f(i) / g(i) = n / m, ilman ett&auml; se t&auml;ytyy laskea tietokoneella? Totesin, ett&auml; siin&auml; tapauksessa, ett&auml; ylipyyhityt luvut huomioidaan, sit&auml; ei voida laskea suoraan vaan se t&auml;ytyy algoritmillisesti tutkia. Sin&auml;ns&auml;h&auml;n se on yksik&auml;sitteisesti m&auml;&auml;r&auml;tty. Mutta jos ylipyyhittyj&auml; ei huomioida - tai siis ei poisteta ollenkaan, niin suora yht&auml;l&ouml; j&auml;rjestyslukua i vastaavalle murtoluvulle l&ouml;ytyy.</p>
						<p>Siis meill&auml; ovat voimassa yht&auml;l&ouml;t:</p>
						<ol>
							<li>i = F(n,m) = (n-1)(n/2)+(n-1)(m-1)+m(m-1)/2 (t&auml;m&auml;n yht&auml;l&ouml;n 1: siis johdimme jo ylemp&auml;n&auml; pinta-aloja tarkastelemalla)
							<li>F(1,n+m-1) = m(m-1)/2 (vinorivin ensimm&auml;inen alkio)
							<li>F(n+m-1,1) = n(n-1)/2 (vinorivin viimeinen alkio)
						</ol>
						<p>Toisaalta kuviota tarkastelemalla voidaan todeta:<br>
						n = i-m(m-1)/2 ja m = n(n-1)/2 - i + 1</p>
						<p>Josta m:lle toiseen asteen yht&auml;l&ouml;n ratk.:<br>
						m = 1/2+-sqrt(1/4+2(i-n))/(-i) ja m = n*n/2 - n/2 - i+1</p>
						<p>Siis:<br>
						m = n*n/2 - n/2 - i+1 = 1/2+-sqrt(1/4+2(i-n))/(-i)</p>
						<p>T&auml;st&auml; saadaan n:lle 4. asteen yht&auml;l&ouml;, josta se voidaan ratkaista i:n suhteen ja sijoitetaan ratkaisu 1:een, josta ratkaistaan m i:n suhteen. Siis m/n on ratkaistavissa lausekkeellisesti j&auml;rjestysluvusta i. Eli vaikka osittain saadaankin analyyttinen bijektio aikaiseksi my&ouml;skin N -&gt; Q, (paitsi ett&auml; t&auml;ss&auml; nyt taas j&auml;tet&auml;&auml;n huomioimatta se ett&auml; Q:ssa luku n/m=(i*n)/(i*m) ja siis ylipyyhint&auml;&auml; ei tehd&auml;) mutta silti, yht&auml;mahtavuuden m&auml;&auml;rittelyss&auml;, tai koko &auml;&auml;rett&ouml;myyden k&auml;sitteess&auml; ei ole mielt&auml;.</p>
						<p>Maalijoukko t&auml;ytyy m&auml;&auml;ritell&auml; siten, ett&auml; kaikkien niiden alkioiden, jotka ovat kuvattuja Q:sta N:&auml;&auml;n, t&auml;ytyy my&ouml;s olla kuvauksen N -&gt; Q l&auml;ht&ouml;joukossa. Ja t&auml;m&auml; on mahdotonta, sill&auml; aina kun otetaan uusi N:n alkio k&auml;ytt&ouml;&ouml;n, niin sekin pit&auml;isi pysty&auml; kuvaamaan, mutta sille kuvausta etsitt&auml;ess&auml; joudutaan ottamaan yh&auml; uudempia ja aina vain isompia N:n alkiota k&auml;ytt&ouml;&ouml;n. &Auml;&auml;rett&ouml;myytt&auml; t&auml;ytyy tarkastella siten, ett&auml; mit&auml; tapahtuu maali- ja kuvajoukoille siin&auml; tilanteessa kun niit&auml; alkioita &quot;luetellaan&quot;.</p>
						<p>Jos v&auml;itet&auml;&auml;n, ett&auml; n&auml;in ei ole, niin sitten meid&auml;n t&auml;ytyisi hyv&auml;ksy&auml; my&ouml;s se, ett&auml; Q on yht&auml; mahtava kuin R. Koska reaaliluvut ovat m&auml;&auml;riteltyj&auml; rationaalilukujen p&auml;&auml;ttym&auml;tt&ouml;min&auml; sarjojen summina. Jos tarkastellaan k&auml;sitett&auml; kaikki reaaliluvut (johon siis kuuluvat rationaali- ja irrationaaliluvut) ja k&auml;sitett&auml; koko rationaalilukujen joukko, niin t&auml;ytyyh&auml;n t&auml;h&auml;n hyv&auml;ksy&auml; my&ouml;s kaikki siihen kuuluvat vaikka &auml;&auml;rett&ouml;m&auml;n pitk&auml;tkin sarjat. Ja koska ne ovat sellaisiksi m&auml;&auml;riteltyj&auml; (reaaliluvut), niin ne kuuluvat Q:hun. Koska jos luku a on rationaaliluku niin luku a+b on rationaaliluku. Yht&auml; hyvin kuin jos n on luonnollinen luku, niin n+1 on luonnollinen luku, aina.</p>
						<p>Yht&auml; hyvin kuin hyv&auml;ksymme kuinka suuren luvun tahansa &auml;&auml;rett&ouml;m&auml;n suureen luonnollisten lukujen joukkoon N, niin meid&auml;n on hyv&auml;ksytt&auml;v&auml; &auml;&auml;rett&ouml;m&auml;n pitk&auml;t rationaalilukujen summat (a+b+...) joukkoon Q. siis Q = R.</p>
						<p>Artikkeliin kuuluvilla C-kielisell&auml; oheisohjelmilla canttori1.exe ja canttori2.exe voidaan tuottaa artikkelissa k&auml;ytettyj&auml; kuvia. canttori2.exe:lle voidaan antaa parametriksi joko 1, 2 tai 3. Lis&auml;ksi pari muuta ohjelmaa, joilla listataan lukuja.</p>
						<p><a href="ohjelmat.lha">Ohjelmat.lha</a> (50 kt, C-kieliset l&auml;hdekoodilistaukset ja Amiga-exet)</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
