<!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Adobe GoLive 4">
		<title>Sekalaiset</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Installerin ohjelmointi - Osa 2</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Ilkka Lehtoranta &lt;<a href="mailto:iti@solutions.fi">iti@solutions.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Ensimm&auml;isess&auml; osassa k&auml;sittelimme hiukan yleisesti Installerin lausekkeita. T&auml;ss&auml; toisessa osassa k&auml;ymme viel&auml; l&auml;pi joitakin herkullisia lis&auml;ominaisuuksia, joita Installer tarjoaa.
						<p>Joskus omassa asennusohjelmassa voi tulla tarvetta k&auml;sitell&auml; ikoneita, esimerkiksi asettaa tooltype. T&auml;h&auml;n tarkoitukseen l&ouml;ytyy 'tooltype'-lauseke:</p>
						<p>(tooltype<br>
						(prompt &quot;K&auml;sitell&auml;&auml;n T-hakemiston ikonia&quot;)<br>
						(help &quot;Ei apuja&quot;)<br>
						(dest &quot;T:/t&quot;)<br>
						(noposition)<br>
						(settooltype &quot;VUOSI&quot; &quot;2000&quot;)<br>
						(confirm)<br>
						)</p>
						<p>Kohdeparametriksi annetaan k&auml;sitelt&auml;v&auml;n ikonin nimi ilman info-p&auml;&auml;tett&auml;, eli siis 'T:/t'. Parametri 'noposition' aiheuttaa ikonin uudelleensijoituksen, jolloin ikonilla ei ole en&auml;&auml; mit&auml;&auml;n m&auml;&auml;r&auml;tty&auml; paikkaa. Kun ikkuna, jossa ikoni sijaitsee, avataan seuraavan kerran, Workbench sijoittaa ikonin niin kuin parhaaksi katsoo. 'settooltype' taas on se useimmin k&auml;ytetty ominaisuus. Sen ensimm&auml;inen parametri m&auml;&auml;r&auml;&auml; tooltypen nimen ja j&auml;lkimm&auml;inen sen arvon. N&auml;in ollen ikoniin ilmestyisi tooltype 'VUOSI=2000'. Tooltypen saa poistettua laittamalla pelk&auml;st&auml;&auml;n tooltypen nimen ilman parametri&auml;.</p>
						<p>'Tooltype'-lauseke tunnistaa my&ouml;s parametrit 'setstack' ja 'setdefaulttool', joista ensimm&auml;inen asettaa pinon ja j&auml;lkimm&auml;inen ohjelman, joka k&auml;ynnistet&auml;&auml;n automaattisesti, kun ikonia kaksoisklikataan.</p>
						<p>AmigaOS 3.5 tarjoaa joitakin uusia ominaisuuksia, joita voit hy&ouml;dynt&auml;&auml; my&ouml;s Installerissa. Yksi pitk&auml;&auml;n kaivattu ominaisuus on mahdollisuus avata hakemistoikkunoita suoraan ohjelmasta k&auml;sin. My&ouml;s Installer osaa hy&ouml;dynt&auml;&auml; t&auml;t&auml; ominaisuutta.</p>
						<p>'openwbobject' avaa halutun kohteen ty&ouml;p&ouml;yd&auml;ll&auml;, aivan kuten k&auml;ytt&auml;j&auml; olisi kaksoisklikannut sit&auml;. 'closewbobject' puolestaan sulkee sen samaan tapaan. Parametriksi k&auml;y kohteen nimi ilman info-p&auml;&auml;tett&auml;, ja kohdeikoni voi olla mink&auml; tyyppinen tahansa. Tietenk&auml;&auml;n tool- tai project-tyyppist&auml; ikonia ei voi sulkea, mutta mink&auml; tahansa kohteen voi kuitenkin avata, oli sill&auml; ikonia tai ei. Hienos&auml;&auml;t&ouml;&ouml;n l&ouml;ytyy 'showwbobject'-lauseke, joka tarvittaessa vieritt&auml;&auml; halutun ikonin n&auml;kyviin.</p>
						<p>Uusi Installer tarjoaa my&ouml;s multimediaominaisuuksia. 'showmedia'-lausekkeella voi esitt&auml;&auml; erityyppisi&auml; tiedostoja, edellytt&auml;en kuitenkin, ett&auml; vaadittu datatyyppi on asennettu. Lauseke tuntee kasan parametrej&auml;, mutta sen k&auml;ytt&ouml; on kuitenkin kohtalaisen helppoa.</p>
						<p>Lausekkeen ensimm&auml;inen parametri on nimi, joka kohteelle annetaan. Se ei siis ole esitett&auml;v&auml;n tiedoston nimi. Sen k&auml;ytt&ouml; voi aluksi tuntua oudolta, mutta sit&auml; tarvitaan my&ouml;hemmin 'setmedia'-lausekkeessa, jotta tiedet&auml;&auml;n, mille medialle komento annetaan. Vasta seuraava parametri on varsinaisen esitett&auml;v&auml;n tiedoston nimi. Loput parametrit ovat sen verran mutkikkaita, ettei niit&auml; kannata t&auml;ss&auml; sen tarkemmin esitell&auml;.</p>
						<p>'setmedia'-lausekkeella voidaan antaa komentoja medialle, tyypillisesti aloittaa animaatio tai soittaa ladattu &auml;&auml;nitiedosto. Alla on esimerkki, kuinka vaikkapa asennuksen lopuksi avataan hakemisto, johon ohjelma on asennettu ja soitetaan &auml;&auml;nimerkki:</p>
						<p>(if (&gt; @installer-version 2883583)<br>
						(<br>
						(showmedia 'media' &quot;Misc/Sproing.snd&quot; 'center' 'none' 0)<br>
						(openwbobject @default-dest)<br>
						(setmedia media 'play')<br>
						)<br>
						)</p>
						<p>Muista, ett&auml; Installerin vanhemmat versiot eiv&auml;t tunnista uusia lausekkeita, vaan antavat virheilmoituksen. T&auml;ll&ouml;in asennusskriptin suoritus hyytyy kalkkiviivoilla, ja k&auml;ytt&auml;j&auml;lle j&auml;&auml; ep&auml;varma olo asennuksen onnistumisesta. Sit&auml; varten t&auml;ytyy varmistaa, ettei lausekkeita yritet&auml; suorittaa Installerilla, joka ei niit&auml; pysty suorittamaan. Kannattaa my&ouml;s huomata, ettei OS-versiota tarvitse erikseen testata eli 'openwbobject' sujuu ongelmitta my&ouml;s vanhemmilla OS-versioilla, joskaan haluttu hakemistokaan ei silloin avaudu.</p>
						<p>Sama koskee my&ouml;s multimediaominaisuuksia; jos tarvittavaa datatyyppi&auml; ei ole asennettu tai k&auml;ytt&ouml;j&auml;rjestelm&auml; on niin vanha ettei se niit&auml; edes tunne, niin Installer jatkaa suoritusta ohittamalla kyseiset lausekkeet.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
