<!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Sekalaiset</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Iso torni - A1200 torniin 650 markalla</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Harry Sintonen &lt;<a href="mailto:sintonen@iki.fi">sintonen@iki.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><b>VAROITUS!</b> T&auml;m&auml;n artikkelin ohjeet tulevat ilman takuuta. Voit helposti rikkoa laitteistosi tornittaessasi sit&auml;! T&auml;m&auml;n dokumentin ohjeissa oletan, ett&auml; osaat k&auml;ytt&auml;&auml; kolvia eik&auml; sinulla ole elektroniikassa peukalo keskell&auml; k&auml;mment&auml;! Ennen kuin kosket arkoihin elektronisiin laitteisiin, maadoita itsesi samaan potentiaaliin kyseisen laitteen kanssa esim. koskettamalla laitteen maadoitettua runkoa. Lis&auml;ksi en voi menn&auml; takuuseen ohjeiden virheett&ouml;myydest&auml;, vaikka olenkin pyrkinyt mahdollisimman selke&auml;&auml;n ja yksiselitteiseen esitykseen.
						<p><b>Varoitus!</b> T&auml;m&auml; tornitusprojekti ei sovellu laitteisiin, joissa on Zorro-laajennuspaikkoja! Jos tarkoituksena on k&auml;ytt&auml;&auml; Zorro-laajennuksia, tulee emolevy (yleens&auml;) asentaa pystyasentoon! Sinua on varoitettu!</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Kun tornista tila loppui</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Muutama vuosi sitten rakensin A1200:ni PC:n minitorniin. Silloin laitteistoni koostui A1200:sta, jossa oli yksi kovalevy ja Blizzard 1230-III -turbo. Sittemmin hankittuani runsaasti lis&auml;laitteita ja useampia kovalevyj&auml; tila minitornissa loppui kesken. Oli uuden tornikotelon aika.
						<p>Er&auml;&auml;n&auml; kirpe&auml;n&auml; maaliskuisena aamuna l&auml;hdin kiert&auml;m&auml;&auml;n Jyv&auml;skyl&auml;n keskustan tietokoneliikkeit&auml; etsien tarpeeksi syv&auml;&auml; tornikoteloa. Tarkoituksenani oli saada A1200:n emolevy tornin sis&auml;lle pitkitt&auml;in, turbo tornin etuosaan ja PCMCIA-liitin koneen taakse. Myyj&auml;sed&auml;t hieman kummissaan katselivat tyyppi&auml;, joka mittanauhan kanssa tutkiskeli tornikoteloita, mutta tiesin ett&auml; olisi aivan turha k&auml;yd&auml; n&auml;ille sedille selitt&auml;m&auml;&auml;n projektini hienouksia...</p>
						<p>Harmikseni totesin, etteiv&auml;t edes nykyiset ATX-tornikotelot ole tarpeeksi syvi&auml;. Oli vain yksi mahdollisuus: ostaa midi- tai t&auml;yskorkea ATX-kotelo ja yritt&auml;&auml; asentaa emolevy pystyasentoon. Pystyasennossa on se etu, ett&auml; mahdolliset Zorro-laajennukset tulevat &quot;oikeinp&auml;in&quot;, ts. korttipaikat ovat vaakatasossa, mutta toisaalta korkeustila saattaa loppua kesken. My&ouml;s A1200:n emolevyn tukeva kiinnitys pystyasentoon voi tuottaa ongelmia. Ostin siis muutaman korttelin k&auml;velymatkan p&auml;&auml;ss&auml; sijaitsevasta liikkeest&auml; t&auml;yskorkean tornin, hintaa 650 markkaa. Luulin emolevyn mahtuvan t&auml;h&auml;n tornikoteloon pystyasennossa, mutta lopulta huomasin, ett&auml; vaaka-asento olisi helpompi toteuttaa, enk&auml; kuitenkaan koskaan tulisi Zorro-laajennusta hankkimaan.</p>
						<p>Hymyilev&auml;n yleis&ouml;n kannustaessa raahasin t&auml;m&auml;n ison paketin kotiin. (N&auml;ky oli varmasti huvittava, enh&auml;n itse edes n&auml;hnyt mit&auml;&auml;n pakettia kantaessani, jouduin aina v&auml;lill&auml; kurkkimaan paketin sivulta eteeni...) Huomasin, ett&auml; t&auml;m&auml; kotelo ei todellakaan ole muovista tehty, sen verran k&auml;det venyiv&auml;t sit&auml; kantaessa. Innosta hihkuen revin t&auml;m&auml;n houkuttelevan ruskean paketin auki heti kotiin saavuttuani. Sis&auml;lt&ouml;n&auml; oli sit&auml; standardiroipetta eli itse tornikotelo, pari muovipussia ruuveja ynn&auml; muuta s&auml;l&auml;&auml;, tyhjien laitepaikkojen maskit, 250W:n virtal&auml;hde ja virtajohto. Hienoa, kaikki tarvittava tuntui olevan k&auml;sill&auml;.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Tarvittava s&auml;l&auml;</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Tarkoituksena on rakentaa A1200 t&auml;yskorkeaan tornikoteloon siten ett&auml; n&auml;pp&auml;imist&ouml; on ulkoinen ja ett&auml; n&auml;ytt&ouml;-, hiiri- sek&auml; joystick-liittimet ovat siististi koneen takana. Tarvittaessa my&ouml;s serial-, parallel-, levyasema- ja &auml;&auml;niliittimet on saatavissa koneen taakse.
						<ul>
							<li>t&auml;yskorkea ATX tornikotelo + virtal&auml;hde (650 mk)
							<li>A1200 + virtal&auml;hde, A500:n virtal&auml;hde k&auml;y my&ouml;s (no t&auml;m&auml;h&auml;n l&ouml;ytyy jo)
							<li>A500-n&auml;pp&auml;imist&ouml; tai erillinen n&auml;pp&auml;imist&ouml;adapteri (saa l&auml;hes ilmaiseksi)
							<li>scandoubler (ei v&auml;ltt&auml;m&auml;t&ouml;n)
							<li>3 kpl uros-D9-liitin (halpoja...)
							<li>3 kpl naaras-D9-liitin (kuten my&ouml;s)
							<li>piuhaa (melkein ilmaista)
							<li>lattakaapelia (nurkista l&ouml;ytyy)
							<li>tarvittaessa: D23- ja D25-liittimi&auml; (uros ja naaras), RCA-liittimi&auml; (uros ja naaras), vastuksia
							<li>yleismittari
							<li>laadukas kolvi ja tinaa
						</ul>
					</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Riisutaan tornikotelo ja A1200</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Koko tornitusprojektin onnistuminen on eniten kiinni itse kotelosta. Jos vain mahdollista, etsi sis&auml;mitoiltaan mahdollisimman syv&auml; kotelo. Ideaalitapauksessa koko A1200-emolevy mahtuu pitkitt&auml;in kotelon sis&auml;lle. Muista, ett&auml; A1200:n turbokortit l&auml;hes poikkeuksetta jatkavat emolevyn pituutta! Jos kotelo j&auml;&auml; lyhyeksi, osa emolevyst&auml; pilkottaa koneen takaa, ja t&auml;m&auml; luonnollisesti voi pilata muuten hienon kokonaisuuden.
						<p>Kun sopiva kotelo on l&ouml;ytynyt, kannattaa koko projekti aloittaa sill&auml; purkamalla kotelo osiin. Ainakin etumaski kannattaa rakentelun ajaksi poistaa kokonaan. Yleens&auml; koteloissa on my&ouml;s turhaa PC-s&auml;l&auml;&auml;, josta kannattaa t&auml;ss&auml; vaiheessa hankkiutua eroon: mm. piipperikaiutin on turha kapine. Omasta kotelostani poistin my&ouml;s muovisen tuulettimen sek&auml; laajennuskorttien pidikkeen.</p>
						<p>Kun kaikki turha s&auml;l&auml; on poistettu, on aika purkaa A1200 osiin (ellei n&auml;in ole jo tehty). Purkaminen on kohtalaisen helppoa, kunhan ei revi mit&auml;&auml;n irti v&auml;kisin ja s&auml;ilytt&auml;&auml; kaikki osat huolellisesti. Erityisesti n&auml;pp&auml;imist&ouml;&auml; irrottaessa tulee olla varovainen, ettei vahingoittaisi haurasta lattakaapelia, jolla n&auml;pp&auml;imist&ouml; on liitetty emolevyyn. On my&ouml;s hyv&auml; painaa mieleen, mik&auml; osa kuuluu minnekin... Maalaisj&auml;rke&auml; saa ja pit&auml;&auml; k&auml;ytt&auml;&auml;.</p>
						<p>Lopulta itse A1200-emolevyn pit&auml;isi irrota kuoren pohjaosasta. Peltinen suojalevy kannattaa j&auml;tt&auml;&auml; kiinni emolevyyn, sill&auml; se suojaa emolevyn alapuolta oikosuluilta, ja lis&auml;ksi t&auml;m&auml;n levyn irrottaminen olisi v&auml;hint&auml;&auml;nkin ty&ouml;l&auml;st&auml;. Peltinen suojaosa jatkuu normaalisti oikealle turbokortin leveydelle asti, mutta joissain emolevyiss&auml; on mahdollista saada lis&auml;tilaa leikkaamalla 5-10 cm pelti&auml; pois. T&auml;m&auml; ei kuitenkaan auta paljon, sill&auml; turbokortti itse jatkuu peltiosaa pidemm&auml;lle.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Emolevy uuteen kotiin</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Viimeist&auml;&auml;n t&auml;ss&auml; vaiheessa p&auml;&auml;see sovittelemaan emolevy&auml; tornikotelon sis&auml;lle. Yleens&auml; ATX-koteloissa metallilevy, johon emolevyn kiinnitet&auml;&auml;n ja laajennuskorttipaikkojen ja liittimien takalevy irtoavat yhten&auml; pakettina (er&auml;&auml;nlainen &quot;emolevykelkka&quot;, kuva 1a).
						<center>
							<p><img height="227" width="239" src="kuvat/torni1.gif" alt=" "></p>
							<p>Kuva 1a - t&auml;yskorkea ATX-tornikotelo</p>
						</center>
						<p>T&auml;ll&ouml;in laajennusten yms. huoltotoimenpiteiden tekeminen on helppoa. Parhaassa tapauksessa A1200-emolevy mahtuu suoraan kiinni t&auml;h&auml;n emolevyn alustaan (kuva 1b).</p>
						<center>
							<p><img height="204" width="142" src="kuvat/torni2.gif" alt=" "></p>
							<p>Kuva 1b - A1200-emolevyn sijoittaminen</p>
						</center>
						<p>Tosin on turha toivoa, ett&auml; kiinnitysruuvien paikat sattuisivat kohdalleen, omassa tornissani kohdalleen sattui onnekkaasti jopa kaksi kiinnityskohtaa. Lis&auml;ksi emolevy on yl&auml;osastaan kiinnitetty eristysteipill&auml; (purkkaviritys rules ok!). Jos tarmoa riitt&auml;&auml;, on mahdollista porata emolevyyn (tai ehk&auml; mieluummin emolevykelkkaan) sopiviin kohtiin lis&auml;reiki&auml; tukevan kiinnityksen varmistamiseksi. Sopivan kohdan etsiminen emolevylt&auml; on sitten jo hankalampaa, sill&auml; yll&auml;tt&auml;v&auml;&auml; kyll&auml;, reiki&auml; ei voi porata mihin sattuu.</p>
						<p>Jos emolevy ei mahdu koneen sis&auml;lle, yleens&auml; tila j&auml;&auml; muutamaa senttimetri&auml; vajaaksi. Jos tarvittavat ty&ouml;kalut ovat k&auml;sill&auml;, voi t&auml;t&auml; tilaa yritt&auml;&auml; saada leikkaamalla pala pois tornikotelon peltikuoresta. Omassa tornissani BlizzardPPC:n p&auml;&auml; ty&ouml;ntyy t&auml;h&auml;n leikattuun tilaan (kuva 1c).</p>
						<center>
							<p><img height="213" width="258" src="kuvat/torni3.gif" alt=" "></p>
							<p>Kuva 1c - Tilan raivaaminen turbokortille</p>
						</center>
						<p>Useimmissa tornikoteloissa on pari kolme ledi&auml; (esim. kovalevy, turbo, power), ja n&auml;m&auml; on mahdollista viritt&auml;&auml; n&auml;ytt&auml;m&auml;&auml;n alkuper&auml;isten Amigan ledien tilaa. Liitin, josta kyseiset nastat l&ouml;ytyv&auml;t, sijaitsee A1200:n emolevyll&auml; sis&auml;isen levyaseman virtaliittimen vieress&auml; (kuva 1d).</p>
						<center>
							<p><img height="159" width="188" src="kuvat/ledit.gif" alt=" "></p>
							<p>Kuva 1d - A1200-emolevyn lediliitin</p>
						</center>
						<p>Normaalisti A1200:n n&auml;pp&auml;imist&ouml;ss&auml; kiinni oleva lediosa on siis kiinnitetty t&auml;h&auml;n liittimeen. Helpointa on leikata liitin irti lediosasta, jolloin johtimet vastaavat seuraavia signaaleja:</p>
						<p>
						<table border="0" cellpadding="0" cellspacing="0" width="160">
							<tr>
								<td><u>V&auml;ri</u></td>
								<td><u>Kytkent&auml;</u></td>
							</tr>
							<tr>
								<td>vihre&auml;</td>
								<td>GND</td>
							</tr>
							<tr>
								<td>oranssi</td>
								<td>kovalevy</td>
							</tr>
							<tr>
								<td>musta</td>
								<td>virta</td>
							</tr>
							<tr>
								<td>punainen</td>
								<td>levyasema</td>
							</tr>
						</table>
						</p>
						<p>Elektroniikasta enemm&auml;n ymm&auml;rt&auml;v&auml; yst&auml;v&auml;ni (terve DrDick :) selitti minulle hieman aiheesta: Ledej&auml; ei pid&auml; liitt&auml;&auml; suoraan n&auml;ihin johtimiin, sill&auml; tuloksena olisi vain nippu k&auml;r&auml;ht&auml;neit&auml; ledej&auml;. V&auml;liin tulee laittaa esim. 330 ohmin vastus, jolloin ledien pit&auml;isi s&auml;ily&auml; ehj&auml;n&auml;. Lis&auml;&auml; (t&auml;st&auml;kin) aiheesta l&ouml;ytyy Aminetin <a href="http://ftp.sunet.se/~aminet/dirs/hard_hack.html" target="_blank">hard/hack</a>-hakemistosta. Omassa tornissani en ole ledej&auml; viitsinyt viritt&auml;&auml;.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>N&auml;pp&auml;imist&ouml;n viritt&auml;minen</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Ehk&auml;p&auml; suurin este A1200:aa tornitettaessa on n&auml;pp&auml;imist&ouml;. A500:sta poiketen A1200:n n&auml;pp&auml;imist&ouml;n prosessori on emolevyll&auml;, ja n&auml;pp&auml;imist&ouml; itse on liitetty emolevyyn leve&auml;ll&auml; lattakaapelilla. Ulkoisen n&auml;pp&auml;imist&ouml;n rakentamisessa on kolme mahdollisuutta:
						<ol>
							<li>valmiin n&auml;pp&auml;imist&ouml;adapterin k&auml;ytt&ouml;
							<li>piuhoituksen kolvaaminen emolevylle ja standardin A2000/A3000/A4000-n&auml;pp&auml;imist&ouml;n k&auml;ytt&ouml;
							<li>piuhoituksen kolvaaminen emolevylle ja A1200:n oman n&auml;pp&auml;imist&ouml;n k&auml;ytt&ouml; A500:n n&auml;pp&auml;imist&ouml;n MPU:lla.
						</ol>
						<p>Ensimm&auml;inen vaihtoehto on ehk&auml;p&auml; suositeltavin, koska t&auml;h&auml;n liittyy v&auml;hiten emolevyn kolvaamista. Lis&auml;ksi adapterit mahdollistavat PC-n&auml;pp&auml;imist&ouml;n k&auml;yt&ouml;n. Jos taas alkuper&auml;inen Amigan n&auml;pp&auml;imist&ouml; on se ainoa oikea, ovat kohdat 2. ja 3. sinua varten. Jos saatavilla on A2000/A3000/A4000-n&auml;pp&auml;imist&ouml;, voidaan koneen taakse rakentaa standardi Amigan n&auml;pp&auml;imist&ouml;liitin ja n&auml;pp&auml;imist&ouml; liitet&auml;&auml;n t&auml;h&auml;n (huom! n&auml;ppisresetti ei toimi ilman erillist&auml; virityst&auml;!). Jos taas ulkoista n&auml;pp&auml;imist&ouml;&auml; ei ole saatavilla tai rahavaranto on tiukilla, on mahdollista rakentaa n&auml;pp&auml;imist&ouml; A1200:n alkuper&auml;isest&auml; n&auml;pp&auml;imist&ouml;st&auml; (jolloin bonuksena my&ouml;s n&auml;ppisresetti toimii!).</p>
						<p><b>1. Valmiin n&auml;pp&auml;imist&ouml;adapterin k&auml;ytt&ouml;</b></p>
						<p>Adaptereita on useita erilaisia, asennusohjeet tulevat poikkeuksetta paketin mukana. Paras vaihtoehto on adapteri, jossa on tarpeeksi pitk&auml; kaapeli sek&auml; liitin, jonka saa kiinnitetty&auml; koneen takaosaan.</p>
						<p><b>2. A2000/A3000/A4000-n&auml;pp&auml;imist&ouml;n k&auml;ytt&ouml;</b></p>
						<p>Standardin Amiga-n&auml;pp&auml;imist&ouml;n liitt&auml;miseksi t&auml;ytyy emolevylle kolvata kolme johdinta ja katkaista alkuper&auml;isest&auml; MPU:sta kaksi jalkaa. Kaksi muuta johdinta ovat +5V ja GND, jotka voidaan helposti ottaa suoraan PC-virtal&auml;hteest&auml;.</p>
						<p>KCLK-johdin kolvataan piirin U7 nastaan 44<br>
						KDAT-johdin kolvataan piirin U7 nastaan 43<br>
						RESET-johdin kolvataan piirin U13 nastaan 38<br>
						+5V-johdin PC-virtal&auml;hteest&auml;<br>
						GND-johdin PC-virtal&auml;hteest&auml;<br>
						Piirin U13 jalka 13 katkaistaan (alkuper&auml;inen KDAT)<br>
						Piirin U13 jalka 14 katkaistaan (alkuper&auml;inen KCLK)</p>
						<p>Operaatio kannattaa aloittaa etsim&auml;ll&auml; oikeat piirit emolevylt&auml;. On hyv&auml; idea esim. tussilla merkit&auml; piiriin oikean nastan kohdalle pieni merkki, n&auml;in virheiden mahdollisuus pienenee. Ensimm&auml;isen&auml; kannattaa etsi&auml; katkaistavat jalat ja pient&auml; veist&auml; k&auml;ytt&auml;en leikata yhteys emolevyyn poikki (kuva 2a, piirin U13 jalat 13 ja 14). Lienee selv&auml;&auml;, ett&auml; t&auml;m&auml;n j&auml;lkeen alkuper&auml;inen n&auml;pp&auml;imist&ouml; ei en&auml;&auml; toimi, vaikka se liitett&auml;isiinkin takaisin lattakaapelin liittimeen.</p>
						<center>
							<p><img height="161" width="295" src="kuvat/nappis.gif" alt=" "></p>
							<p>Kuva 2a - Muutosty&ouml;t emolevyll&auml;</p>
						</center>
						<p>Seuraavaksi kolme johdinta (KCLK, KDAT ja RESET) kolvataan emolevylle (piirien jalat ovat helpoin paikka kolvata) (kuva 2a, piirin U7 jalat 43 ja 44, ja piirin U13 jalka 38). Kolvin k&auml;rjen olisi hyv&auml; olla ohut, tai kolvausoperaatio menee kikkailuksi. Piirit, joiden jalkoihin johtimet kolvataan, ovat pintaliitoksella emolevyll&auml;, joten ty&ouml; vaatii melkoista tarkkuutta. Mik&auml;li piirien jalkoihin kolvaaminen tuntuu liian vaikealta tai pelk&auml;&auml;t tuhoavasti itse emolevyn, on mahdollista hankkia sopiva kehikko painettavaksi piirin p&auml;&auml;lle. Johtimien kolvaaminen t&auml;llaiseen kehikkoon on helpompaa ja turvallisempaa. Lopputuloksena pit&auml;isi olla viisi johdinta: KCLK, KDAT, RESET, +5V ja GND. Ja n&auml;m&auml; ovat t&auml;sm&auml;lleen samat kuin Amigan alkuper&auml;isen n&auml;pp&auml;imist&ouml;n liittimess&auml; (kuva 2b).</p>
						<center>
							<p><img height="123" width="211" src="kuvat/nappis2000.gif" alt=" "></p>
							<p>Kuva 2b - A2000/A3000-n&auml;pp&auml;imist&ouml;n liitin</p>
						</center>
						<p>Riippuen halutun n&auml;pp&auml;imist&ouml;n tyypist&auml; koneen taakse tuleva liitin on hieman erilainen. A2000/A3000:n n&auml;pp&auml;imist&ouml;n liittimen nastoitus l&ouml;ytyy <a href="http://www.hwb.acc.umu.se/co_KeyboardAmiga5.html" target="_blank">t&auml;&auml;lt&auml;</a> (ja kuva 2b). A4000:n n&auml;pp&auml;imist&ouml;n liittimen nastoitus l&ouml;ytyy <a href="http://www.hwb.acc.umu.se/co_KeyboardAmiga6.html " target="_blank">t&auml;&auml;lt&auml;</a> (ja kuva 2c). On my&ouml;s mahdollista k&auml;ytt&auml;&auml; A1000:n n&auml;pp&auml;imist&ouml;&auml;, tosin t&auml;llaista museotavaraa en ainakaan henkil&ouml;kohtaisesti viitsisi uhrata p&auml;ivitt&auml;iseen k&auml;ytt&ouml;&ouml;n. hwb:st&auml; l&ouml;ytyy tarvittaessa A1000-n&auml;pp&auml;imist&ouml;n liittimen nastoitus. Itse liittimen rakentaminen on yksinkertaista: kolvataan oikea johdin oikeaan nastaan ja kiinnitet&auml;&auml;n liitin tornin takaosaan.</p>
						<center>
							<p><img height="131" width="237" src="kuvat/nappis4000.gif" alt=" "></p>
							<p>Kuva 2c - A4000-n&auml;pp&auml;imist&ouml;n liitin</p>
						</center>
						<p>N&auml;pp&auml;imist&ouml;-reset saattaa toimia tai sitten ei. Jos reset ei toimi, on mahdollista liitt&auml;&auml; tornikotelon reset-nappi yhdist&auml;m&auml;&auml;n GND ja U13 piirin pinni 38 jolloin kone resetoituu (kuva 2a). My&ouml;s n&auml;pp&auml;imist&ouml;-reset on mahdollista saada toimimaan erillisell&auml; logiikalla. Lis&auml;&auml; aiheesta l&ouml;ytyy aminetin <a href="http://ftp.sunet.se/~aminet/dirs/hard_hack.html" target="_blank">hard/hack</a>-hakemistosta (mm. <a href="http://ftp.sunet.se/~aminet/dirs/aminet/hard/hack/KBD-Reset103.lha">hard/hack/KBD-Reset103.lha</a>).</p>
						<p><b>3. A1200-n&auml;pp&auml;imist&ouml;n k&auml;ytt&ouml;</b></p>
						<p>Suurin etu alkuper&auml;isen A1200:n n&auml;pp&auml;imist&ouml;n k&auml;ytt&auml;misess&auml; on se, ett&auml; n&auml;ppis-reset toimii suoraan ilman erillisi&auml; virityksi&auml;. T&auml;m&auml; reset tosin on A500-tyylinen eli reset tapahtuu v&auml;litt&ouml;m&auml;sti, kun kolme maagista n&auml;pp&auml;int&auml; painaa pohjaan, ts. software-pohjainen resetin k&auml;sittely ei en&auml;&auml; toimi. Toisaalta resetoinnissa ei ole en&auml;&auml; h&auml;m&auml;&auml;v&auml;&auml; maksimissaan 10 sekunnin viivett&auml;. Huonona puolena mainittakoon, ett&auml; n&auml;pp&auml;imist&ouml;n kuoren saaminen siistiksi vaatii ty&ouml;t&auml;. (Omassa rakennelmassani n&auml;pp&auml;imist&ouml;n kuoret on viritetty vanhan A500:n kuorista, ei kovinkaan esteettinen ratkaisu.)</p>
						<p>Rakentaminen menee samaa latua kuin &quot;A2000/A3000/A4000-n&auml;pp&auml;imist&ouml;n k&auml;ytt&ouml;&quot; -kohdassa on esitetty. On toki mahdollista k&auml;ytt&auml;&auml; A2000/A3000:n tai A4000:n n&auml;pp&auml;imist&ouml;n liitint&auml;, ja ehk&auml; t&auml;m&auml; onkin parempi ratkaisu, koska t&auml;ll&ouml;in voi halutessaan vaihtaa n&auml;pp&auml;imist&ouml;n helposti &quot;oikeaan&quot;. Itse kuitenkin k&auml;ytin standardia uros-D9-liitint&auml;. Itse n&auml;pp&auml;imist&ouml; rakennetaan seuraavasti:</p>
						<p>Irrotetaan A500:n n&auml;pp&auml;imist&ouml;st&auml; oikeassa yl&auml;kulmassa sijaitseva piirilevy (kuva 3a). Liitet&auml;&auml;n t&auml;m&auml; piirilevy A1200:n n&auml;pp&auml;imist&ouml;n lattakaapeliin (kuva 3b). Itse piirilevyn voi piilottaa n&auml;pp&auml;imist&ouml;n alle, kannattaa kuitenkin olla varovainen, ettei vahingoita itse lattakaapelia! (kuva 3c) A500:n n&auml;pp&auml;imist&ouml;-MPU:n piirilevyst&auml; l&auml;htee reilusti johtoja (kuva 3a), joista l&ouml;ytyv&auml;t my&ouml;s - yll&auml;tys yll&auml;tys - juuri n&auml;m&auml; KCLK-, KDAT-, RESET-, +5V- ja GND-johtimet. On t&auml;ysin omasta virittelynhalusta kiinni, mink&auml;laisen johdotuksen ja liittimet n&auml;pp&auml;imist&ouml;&ouml;ns&auml; rakentaa, p&auml;&auml;asia ett&auml; oikea johdin p&auml;&auml;tyy lopulta oikeaan paikkaan emolevyll&auml;. Itse k&auml;ytin n&auml;pp&auml;imist&ouml;n johtona vanhan joystickin johtoa, ja n&auml;pp&auml;imist&ouml;n liittimen&auml; on koneen takana uros-D9-liitin.</p>
						<center>
							<p><img height="180" width="245" src="kuvat/a500mpu.gif"></p>
							<p>Kuva 3a - A500:n n&auml;pp&auml;imist&ouml;n-MPU:n piirilevy</p>
							<p><img height="200" width="289" src="kuvat/nappis1200a.gif"></p>
							<p>Kuva 3b - A1200-n&auml;pp&auml;imist&ouml;n viritys, osa 1</p>
							<p><img height="124" width="289" src="kuvat/nappis1200b.gif"></p>
							<p>Kuva 3c - A1200-n&auml;pp&auml;imist&ouml;n viritys, osa 2</p>
						</center>
						<p>Ohessa taulukko A500:n n&auml;pp&auml;imist&ouml;-MPU:n piirilevyn nastoista:</p>
						<p>
						<table border="0" cellpadding="0" cellspacing="0" width="160">
							<tr>
								<td><u>Nasta</u></td>
								<td><u>Kytkent&auml;</u></td>
							</tr>
							<tr>
								<td>1</td>
								<td>KCLK</td>
							</tr>
							<tr>
								<td>2</td>
								<td>KDAT</td>
							</tr>
							<tr>
								<td>3</td>
								<td>RESET</td>
							</tr>
							<tr>
								<td>4</td>
								<td>+5V</td>
							</tr>
							<tr>
								<td>5</td>
								<td>nc</td>
							</tr>
							<tr>
								<td>6</td>
								<td>GND</td>
							</tr>
							<tr>
								<td>7</td>
								<td>virtaledi</td>
							</tr>
							<tr>
								<td>8</td>
								<td>levyasemaledi</td>
							</tr>
						</table>
						</p>
						<p>N&auml;pp&auml;imist&ouml; ei n&auml;yt&auml; kovinkaan hyv&auml;lt&auml; ilman kuoria. Er&auml;s mahdollisuus on rakentaa kuoret A1200:n kuorista sahaamalla ylim&auml;&auml;r&auml;inen osa pois. Itse k&auml;ytin A500:n kuoria, koska sellaiset sattuivat nurkassa lojumaan.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Virtal&auml;hde</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Tornikotelo toimitetaan l&auml;hes poikkeuksetta virtal&auml;hteen kera. Isot ATX-tornikotelot sis&auml;lt&auml;v&auml;t 250W:n tai 300W:n virtal&auml;hteen, tosin 200W on jo enemm&auml;n kuin riitt&auml;v&auml;. Suurin ongelma virtal&auml;hteen viritt&auml;misess&auml; Amigan k&auml;ytt&ouml;&ouml;n on l&ouml;yt&auml;&auml; oikeat j&auml;nnitteet sek&auml; PC- ett&auml; Amiga-virtal&auml;hteest&auml;. T&auml;ss&auml; apuun kannattaa ottaa yleismittari, paperia ja kyn&auml;. Amigan virtal&auml;hteen nastoitus selvi&auml;&auml; virtal&auml;hteen pohjasta, mutta on suositeltavaa my&ouml;s itse mitata j&auml;nnitteet, jotta voi varmistua kytkent&ouml;jen oikeellisuudesta.
						<p>Paperille kannattaa piirt&auml;&auml; Amigan power-liittimen kuva ja numeroida nastat. Mittausten perusteella pit&auml;isi l&ouml;yty&auml; nastat: +5V, +12V, -12V ja GND (kuva 4a). Seuraavaksi PC-powerin kimppuun. Etsit&auml;&auml;n liitin, jossa on kyljess&auml; merkint&auml; P8. T&auml;m&auml;n liittimen nastoista l&ouml;ytyv&auml;t nuo samat +5V, +12V, -12V ja GND (kuva 4b). T&auml;ss&auml; tapauksessa kannattaa paperille merkit&auml; johtimen v&auml;ri ja j&auml;nnite.</p>
						<center>
							<p><img height="80" width="195" src="kuvat/amigapower.gif" alt=" "></p>
							<p>Kuva 4a - A1200-virtal&auml;hteen liitin</p>
							<p><img height="106" width="236" src="kuvat/pcpower.gif" alt=" "></p>
							<p>Kuva 4b - PC-virtal&auml;hteen liitin</p>
						</center>
						<p>Kun kaikki t&auml;m&auml; informaatio on ker&auml;tty, on aika rakentaa itse virtaliitin. On toki mahdollista kolvata johtimet suoraan emolevylle, mutta itse suosittelen Amigan virtaliittimen kolvaamista P8-liittimen tilalle: Katkaistaan Amigan virtal&auml;hteen kaapeli noin 30-40 cm liittimest&auml;. Leikataan P8-liitin irti PC-powerista. T&auml;ss&auml; voi leikata aivan liittimen juuresta. Kolvataan +5V, +12V, -12V ja GND siten ett&auml; Amigan virtaliittimest&auml; saadaan ulos vastaavat j&auml;nnitteet kuin alkuper&auml;isest&auml; virtal&auml;hteest&auml;.</p>
						<p>Seuraavissa taulukoissa on esitetty sek&auml; PC:n ett&auml; A1200:n virtal&auml;hteiden johtimien v&auml;rit ja j&auml;nnitteet. Viimeisess&auml; taulukossa on esitetty johtimien liitt&auml;misj&auml;rjestys. HUOM: Vaikka suurin osa laitteista k&auml;ytt&auml;&auml; juuri n&auml;it&auml; v&auml;rej&auml;, on silti syyt&auml; tarkistaa kytkenn&auml;t!</p>
						<p><b>PC-virtal&auml;hde (P8)</b><br>
						<table border="0" cellpadding="0" cellspacing="0" width="150">
							<tr>
								<td><u>V&auml;ri</u></td>
								<td><u>J&auml;nnite</u></td>
							</tr>
							<tr>
								<td>punainen</td>
								<td>+5V</td>
							</tr>
							<tr>
								<td>keltainen</td>
								<td>+12V</td>
							</tr>
							<tr>
								<td>sininen</td>
								<td>-12V</td>
							</tr>
							<tr>
								<td>musta</td>
								<td>GND</td>
							</tr>
						</table>
						</p>
						<p><b>A1200-virtal&auml;hde</b><br>
						<table border="0" cellpadding="0" cellspacing="0" width="150">
							<tr>
								<td><u>V&auml;ri</u></td>
								<td><u>J&auml;nnite</u></td>
							</tr>
							<tr>
								<td>punainen</td>
								<td>+5V</td>
							</tr>
							<tr>
								<td>valkoinen</td>
								<td>-12V</td>
							</tr>
							<tr>
								<td>musta</td>
								<td>GND</td>
							</tr>
							<tr>
								<td>ruskea</td>
								<td>+12V</td>
							</tr>
						</table>
						</p>
						<p>
						<table border="0" cellpadding="0" cellspacing="0" width="230">
							<tr>
								<td><u><b>PC-virtal&auml;hde</b></u></td>
								<td><u><b>A1200-virtal&auml;hde</b></u></td>
							</tr>
							<tr>
								<td>punainen</td>
								<td>punainen</td>
							</tr>
							<tr>
								<td>keltainen</td>
								<td>ruskea</td>
							</tr>
							<tr>
								<td>sininen</td>
								<td>valkoinen</td>
							</tr>
							<tr>
								<td>musta</td>
								<td>musta</td>
							</tr>
						</table>
						</p>
						<p>Kannattaa tarkistaa kytkenn&auml;t muutamaan kertaan, sill&auml; jos johtimet menev&auml;t sekaisin, tuloksena on pahimmassa tapauksessa emolevyn/turbokortin/kovalevyjen sek&auml; itse virtal&auml;hteen tuhoutuminen. Onnistuneen kytkent&auml;urakan j&auml;lkeen lopputuloksena on PC-virtal&auml;hde, jossa on Amigan virtajohto liittimineen. Kun emolevy on sijoitettu tornikotelon sis&auml;&auml;n, voidaan virtaliitin kytke&auml; paikoilleen.</p>
						<p>T&auml;yskorkeissa tornikoteloissa on yleens&auml; virtal&auml;hde, jossa on runsaasti pieni&auml; ja isoja powerliittimi&auml;. Isot liittimet saattavat tosin loppua kesken, jos laitteistossa on useita kovalevyj&auml; ja esim. CD-ROM ja CD-RW. T&auml;llaisessa tilanteessa voi ostaa valmiita jakokappaleita tai rakentaa sellainen itse. Helpointa on leikata hajonneesta tai turhasta PC-virtal&auml;hteest&auml; isot powerliittimet ja kuoria yhdest&auml; power-liittimest&auml; johtimia sen verran, ett&auml; n&auml;m&auml; lis&auml;liittimet saa kolvattua kiinni. Mielikuvitusta saa k&auml;ytt&auml;&auml;, hyv&auml; idea on esimerkiksi purkaa yksi pieni liitin ja lis&auml;t&auml; t&auml;h&auml;n vaikkapa 10 kpl isoja liittimi&auml;, eiv&auml;tp&auml;h&auml;n lopu kesken.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>IDE-levy</b><b>t</b></font><b> <font color="black">ja sis&auml;inen levyasema</font></b></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">IDE laitteiden viritt&auml;minen ei tuota ongelmia, joskin kaapeleiden pidennys saattaa tulla kyseeseen. Jos koneessa on aiemmin ollut vain 2,5&quot;:n kovalevy, on t&auml;ss&auml; yhteydess&auml; helppo laajentaa levytilaa halvalla 20-30 gigatavun levyll&auml;. 2.5&quot; -&gt; 3.5&quot; adaptereita saa ostettua kohtalaisen halvalla, tosin parempi vaihtoehto lienee 4-Way-adapteri (IDEFix), jonka avulla saa yhteens&auml; nelj&auml; IDE-laitetta kiinni. Aminetissa <a href="http://ftp.sunet.se/~aminet/dirs/hard_hack.html" target="_blank">hard/hack</a>-hakemistossa on parikin eri ohjetta 4-way-adapterin rakentamiseen. Luonnollisesti 3,5&quot;:n laitteiden virta kannattaa ottaa suoraan PC-virtal&auml;hteest&auml;.
						<p>Sis&auml;isen levyaseman siirt&auml;misess&auml; tornikoteloon on pari hankaluutta. Ensinn&auml;kin alkuper&auml;inen lattakaapeli on aivan liian lyhyt, ja toisekseen sis&auml;isess&auml; A1200-levyasemassa ei ole maskia. Ensimm&auml;inen ongelma on helppo ratkaista hankkimalla tarpeeksi pitk&auml; p&auml;tk&auml; lattakaapelia ja siirt&auml;m&auml;ll&auml; alkuper&auml;isen kaapelin liittimet t&auml;h&auml;n (tarkkana, ett&auml; liittimet tulevat oikein p&auml;in!).</p>
						<p>Maskin puuttuminen on ratkaistavissa parillakin tavalla. Ensinn&auml;kin risasta tai tarpeettomasta PC:n korppuasemasta voi yritt&auml;&auml; sovitella maskia. Jos k&auml;dentaitoja ja ty&ouml;kaluja l&ouml;ytyy voi sopivan maskin s&auml;&auml;t&auml;&auml; itse. Toinen vaihtoehto on hankkia sis&auml;inen Amigan high density -korputin (mieluiten A4000-malli, koska se tulee maskilla). Hinta tosin voi hirvitt&auml;&auml;... Virta sis&auml;iseen levyasemaan kannattaa luonnollisesti ottaa suoraan PC-virtal&auml;hteest&auml;.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Monitoriliitin</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Alkuper&auml;isen monitoriliit&auml;nn&auml;n siirt&auml;minen koneen takapaneeliin voi tuottaa ongelmia, koska sopivien liittimien l&ouml;yt&auml;minen on hankalaa. (Amigan RGB-liitin k&auml;ytt&auml;&auml; harvinaisempaa 23 pinnist&auml; D-liitint&auml;.) Jos tarvittavat liittimet l&ouml;yt&auml;&auml;, on jatkokaapelin rakentaminen helppoa: kolvataan vain uros- ja naaras-D23-liittimen jokainen nasta (t&auml;ss&auml; voi &quot;optimoida&quot; j&auml;tt&auml;m&auml;ll&auml; turhat nastat kolvaamatta, <a href="http://www.hwb.acc.umu.se/" target="_blank">http://www.hwb.acc.umu.se/</a>:st&auml; l&ouml;ytyy RGB-liittimen nastoitus).
						<p>Suositeltavampi ja yksinkertainen ratkaisu on k&auml;ytt&auml;&auml; scandoubleria, jossa on VGA-liitin kaapelin p&auml;&auml;ss&auml;. T&auml;m&auml; liitin on helppo kiinnitt&auml;&auml; tornin takaosaan. Jos kuitenkin scandoubleria k&auml;ytt&auml;&auml;, voi ongelmia tulla siit&auml;, ett&auml; sek&auml; n&auml;pp&auml;imist&ouml; ett&auml; scandoubler tarvitsevat samoja nastoja tietyist&auml; piireist&auml;. (Esim. Micronik Scandy -scandoubler ja omatekoinen ulkoinen n&auml;pp&auml;imist&ouml; vaatii erityist&auml; virittely&auml;, itse kolvasin n&auml;pp&auml;imist&ouml;n tarvitsemat johtimet CIA U7 -piirin p&auml;&auml;lle painettavaan kehikkoon. Jos k&auml;ytt&auml;&auml; valmista n&auml;pp&auml;imist&ouml;adapteria, t&auml;lt&auml; ongelmalta saattaa v&auml;ltty&auml;, riippuen adapterin tyypist&auml;.)</p>
						<p>Lis&auml;ksi jos koneessa on n&auml;ytt&ouml;kortti (BlizzardVision tai vastaava), my&ouml;s sen VGA-liitin on helppo kiinnitt&auml;&auml; koneen taakse. Omassa rakennelmassani on tornin takana p&auml;&auml;llekk&auml;in AGA-, scandoubler- ja BVision-VGA-liittimet.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Hiiri, joystick, serial, parallel, lis&auml;levyasema, &auml;&auml;net</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Hiiri- ja joystick-liittimet on helppo saada koneen taakse jatkokaapeleilla. Otetaan tarpeeksi pitk&auml;t p&auml;tk&auml;t lattakaapelia (40-50 cm) ja halkaistaan kaapeli 9-johtoiseksi. Kaapelin toiseen p&auml;&auml;h&auml;n kolvataan naaras-D9-liitin ja toiseen p&auml;&auml;h&auml;n uros-D9. Naarasliitin tulee emolevyn liittimeen ja urosliitin kiinnitet&auml;&auml;n torninkotelon taakse. Helppoa.
						<p>Serial- ja parallel-kaapelit on helppo toteuttaa samaan tapaan kuin hiiri- ja joystick-liittimet. Yhdistett&auml;viss&auml; nastoissa voi j&auml;lleen &quot;s&auml;&auml;st&auml;&auml;&quot;, tarkemmat tiedot <a href="http://www.hwb.acc.umu.se/" target="_blank">http://www.hwb.acc.umu.se/</a>:st&auml;. Itse en n&auml;it&auml; liittimi&auml; tarvitse, joten en ole niit&auml; koneen taakse vienyt.</p>
						<p>Lis&auml;levyaseman liittimen vieminen koneen taakse on samanlaatuinen operaatio. On tietenkin mahdollista j&auml;tt&auml;&auml; lis&auml;levyasemat tornikotelon sis&auml;lle, jolloin itse liittimen vieminen ei ole tarpeen.</p>
						<p>Amigan RCA-liittimet on helppo jatkaa sopivilla osilla (2 kpl uros- ja naaras-RCA-liittimi&auml; ja piuhaa) tornin takaosaan. Jos A1200:ssa on kelloporttiin kiinnitett&auml;v&auml; &auml;&auml;nikortti, sen mukana yleens&auml; toimitetaan tarvittavat kaapelit ja liittimet (mm. Delfina A1200; Zuikkis: muista sitten pist&auml;&auml; ne rahat tilille... ;). T&auml;ll&auml;isen kortin kanssa saa my&ouml;s CD-&auml;&auml;net helposti kuuluviin. Jos CD-&auml;&auml;net haluaa kuuluville ilman &auml;&auml;nikorttia, on t&auml;m&auml;kin mahdollista erillisell&auml; virityksell&auml;. Lis&auml;&auml; aiheesta Aminetin <a href="http://ftp.sunet.se/~aminet/dirs/hard_hack.html" target="_blank">hard/hack</a>-hakemistossa. Omassa laitteistossani kaiuttimien RCA-kaapeli tulee suoraan koneen sis&auml;lt&auml;.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>PCMCIA-liitin</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">PCMCIA-liitint&auml; (nykyiselt&auml; nimelt&auml;&auml;n PC Card) kritisoitiin A1200:n alkuaikoina, mutta nyttemmin moni A4000:n omistaja kiroaa, kun A1200:aan saa ethernet-verkkokortin naurettavan halvalla. Kun emolevy kiinnitet&auml;&auml;n tornikotelon sis&auml;lle pitkitt&auml;in, ei PCMCIA-liitint&auml; tarvitse muuttaa, sill&auml; kotelon takasein&auml;&auml; muuttamalla liittimen saa k&auml;tev&auml;sti viety&auml; koneen taakse. Jos PCMCIA-liittimeen ei tarvitse p&auml;&auml;st&auml; k&auml;siksi, on toki mahdollista hankkia 90 asteen kulma liittimeen, jolloin koko paketti j&auml;&auml; siististi koneen sis&auml;lle. T&auml;ll&ouml;in esim. ethernet-kortista koneen taakse j&auml;&auml; vain mullukka, jossa on itse nettipiuhan liittimet.
						<p>1200:n PCMCIA-liittimess&auml; on bugi, sill&auml; kortti ei koskaan saa CC_RESET-signaalia. Jos PCMCIA-kortti vaatii hotplugin (eli siis kortti pit&auml;&auml; irrottaa ja ty&ouml;nt&auml;&auml; joka kerta liittimeen, kun koneeseen laitetaan virrat) on tilanne mahdollista korjata yksinkertaisella piirill&auml;. On olemassa ainakin kaksi erilaista ratkaisua ongelmaan, Aminetin <a href="http://ftp.sunet.se/~aminet/dirs/aminet/hard/drivr/cnetdevice.lha">cnet.device-paketissa</a> oleva ohje ja <a href="http://ftp.sunet.se/~aminet/dirs/aminet/hard/hack/pcmciafix.lha">pcmciafix.lha</a>. Molempien on todettu toimivan.</p>
						<p>Itsell&auml;ni on cnet.device-paketin ohjeiden mukaan rakennettu korjauspiiri, joten siit&auml; hieman lis&auml;&auml;. Ohjeessa luetellut komponentit on syyt&auml; hankkia todella ohjeen mukaan, siis yksi 22K vastus, yksi 10K vastus ja BC327-PNP-transistori (tai vastaava, omassa piiriss&auml;ni BC3275). Ensimm&auml;inen viritykseni ei toiminut ilmeisesti v&auml;&auml;rien komponenttien takia. Rakennettuani piirin uudelleen ja varmasti oikeilla komponenteilla l&auml;hti piiri toimimaan. Jos Gayle-piirin jalkoihin kolvaaminen ei innosta, on mahdollista hankkia sopiva kehikko, joka painetaan piirin p&auml;&auml;lle. Johtimien kolvaaminen t&auml;h&auml;n kehikkoon on helpompaa ja turvallisempaa.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Lis&auml;virtaa emolevylle ja turbolle</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Joidenkin turbokorttien kanssa voi tulla ongelmia, vaikka virtal&auml;hde itse olisikin tarpeeksi tehokas. T&auml;m&auml; ongelma johtuu siit&auml;, ettei emolevy pysty toimittamaan tarpeeksi suurta j&auml;nnitett&auml; laajennusliittimeen, jolloin turbokortti ei toimi oikein ja/tai kone kaatuilee usein.
						<p>Esimerkiksi BlizzardPPC-ohjekirjanen ehdottaa, ett&auml; emolevyn sis&auml;isen levyaseman virtaliittimeen kytket&auml;&auml;n suoraan powerliitin PC-virtal&auml;hteest&auml;. T&auml;m&auml; levyaseman virtaliitin on &quot;l&auml;hemp&auml;n&auml;&quot; laajennusliitint&auml;, ja siten turbokortti saa tarvittavan j&auml;nnitteen. Omassa BlizzardPPC-laitteistossani sy&ouml;t&auml;n suoraan +5V virtal&auml;hteest&auml; kortille. Kolvasin +5V- ja GND-johtimet suoraan PowerPC-prosessorin tuulettimen johtimiin (punainen johdin on +5V, musta on GND).</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Lis&auml;tuuletus</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Jos laitteistossa on useita kovalevyj&auml;, CD-ROM tai CD-RW asema, turbokortti ynn&auml; muuta s&auml;l&auml;&auml;, nousee koneen l&auml;mp&ouml;tila helposti liikaa. T&auml;yskokoinen tornikotelo mahdollistaa kuitenkin useiden lis&auml;tuulettimien asentamisen, ja usein kotelossa on suoraan paikkoja tuulettimille, sopivine ruuvinreikineen.
						<p>Pikkutuulettimia on karkeasti jakaen kahta tyyppi&auml;: +5V ja +12V. +5V-mallit ovat yleens&auml; prosessorituulettimia ja +12V-malleja on esim. virtal&auml;hteiss&auml;. On my&ouml;s olemassa isoja verkkovirralla toimivia tuulettimia, ja jos t&auml;llaisen jostain l&ouml;yt&auml;&auml;, kannattaa sit&auml; ehdottomasti k&auml;ytt&auml;&auml;. Elektroniikkaliikkeiss&auml; t&auml;llaiset verkkovirtatuulettimet maksavat vajaan satasen, ja ne ovat usein huomattavasti hiljaisempia kuin +5V- ja +12V-mallit.</p>
						<p>Pikkutuulettimet ovat juuri sopivia, jos prosessori tai esim. BlizzardVisionin Permedia 2 tarvitsee lis&auml;j&auml;&auml;hdytyst&auml;. Tarvittava johdotus on helppo rakentaa, itse tuulettimen kiinnitys tukevasti voi sen sijaan olla hankalampaa. Uusien BlizzardVision-korttien Permedia 2 -piirin p&auml;&auml;ll&auml; on kuulemma valmiiksi pieni siili, tosin lis&auml;j&auml;&auml;hdytys tuskin koskaan on pahasta.</p>
						<p>+12V-tuulettimet (joita muuten k&auml;tev&auml;sti saa vanhoista PC-powereista purkamalla, tosin n&auml;m&auml; tuulettimet ovat usein loppuun kuluneita) sopivat itse kotelon tuuletukseen +5V pikkuvelji&auml;&auml;n paremmin. Omassa tornissani on kaksi t&auml;llaista tuuletinta vierekk&auml;in takana yl&auml;osassa imem&auml;ss&auml; l&auml;mmint&auml; ilmaa ulos. Yksi tuuletin taas on tornin edess&auml; alhaalla imem&auml;ss&auml; viile&auml;&auml; ilmaa kotelon sis&auml;lle. T&auml;llainen ratkaisu taatusti vaihtaa ilmaa tornikotelossa, eik&auml; vain py&ouml;rit&auml; sit&auml; ymp&auml;riins&auml; kotelon sis&auml;ll&auml;.</p>
						<p>Lis&auml;tuulettimista aiheutuu aina melua, ja jos laitteisto muuten on hiljainen, voi olla kannattavaa sijoittaa hiljaisiin ja laadukkaisiin tuulettimiin.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Savua?</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kun laitteisto alkaa olla kasassa, on j&auml;rkev&auml;&auml; viel&auml; kerran tarkistaa kaikki liit&auml;nn&auml;t oikosulkujen ja v&auml;&auml;rien liit&auml;nt&ouml;jen varalta. Lis&auml;ksi kannattaa tarkistaa, ettei emolevylle ole pudonnut ty&ouml;skentelyn aikana johtimenp&auml;tki&auml; tai muuta metallis&auml;l&auml;&auml;, joka voisi aiheuttaa oikosulun. Tarkistuslistalla ovat my&ouml;s IDE- ja levyasemaliittimet: ovatko liit&auml;nn&auml;t oikein p&auml;in? Onko virtal&auml;hteen johtimet varmasti oikein kytketty? Onko n&auml;pp&auml;imist&ouml;n johtimet oikein liitetty?
						<p>Kun kaikki viimein tuntuu olevan kunnossa, kannattaa laitteistoon kytke&auml; vain n&auml;pp&auml;imist&ouml; ja monitori. Ja... virtaa p&auml;&auml;lle! Jos savua ja kipin&ouml;it&auml; ei nouse, on syyt&auml; seurata monitoria. Siihen pit&auml;isi kohtalaisen ajan kuluttua ilmesty&auml; kuva, joka ehdottaa levykkeen asettamista levyasemaan. Jos kone tuntuu toimivan, voi rakennelmaan lis&auml;t&auml; muita laitteita ja kokeilla k&auml;ynnist&auml;mist&auml; uudestaan.</p>
						<p>Jos n&auml;pp&auml;imist&ouml; ei toimi, on syyt&auml; tarkistaa, etteiv&auml;t KCLK ja KDAT ole menneet sekaisin, sill&auml; jos n&auml;m&auml; sekoittaa kesken&auml;&auml;n, n&auml;pp&auml;imist&ouml; vain suoltaa ulos sekavaa merkkim&ouml;ss&ouml;&auml;... Jos kovalevyt eiv&auml;t toimi eiv&auml;tk&auml; edes l&auml;hde py&ouml;rim&auml;&auml;n (kuulee &auml;&auml;nest&auml;, tai siis sen puutteesta), on syyt&auml; tarkistaa virtaliittimet ja IDE-liittimien suunta. Jos IDE-liittimen kytkee v&auml;&auml;rin p&auml;in, levy ei n&auml;et k&auml;ynnisty, ja lis&auml;ksi ruudulle saattaa ilmesty&auml; ilotulitusefektej&auml;. Jos &auml;&auml;net eiv&auml;t kuulu, on vika todenn&auml;k&ouml;isesti joko itse RCA-liittimien jatkokaapeleissa tai sitten -12V puuttuu tai on kytketty v&auml;&auml;rin. My&ouml;s seriaaliportti lakkaa toimimasta, jos -12V puuttuu.</p>
						<p>Jos ongelmia ilmenee, kannattaa aina riisua laitteita irti, kunnes kone j&auml;lleen toimii, n&auml;in on helppo selvitt&auml;&auml; miss&auml; p&auml;in ongelma piilee. Yleens&auml; ottaen A1200 on todella vankkaa tekoa, sen rikkominen on v&auml;hint&auml;&auml;nkin vaikeaa. Itsell&auml;ni on ollut levyasema, IDE-liitin ja n&auml;pp&auml;imist&ouml; v&auml;&auml;rin kytkettyn&auml;, lis&auml;ksi muutaman kerran on -12V puuttunut emolevylt&auml; kokonaan, ja emolevy on my&ouml;s ollut oikosulussa useampaan otteeseen. Silti kirjoitan t&auml;t&auml; artikkelia juuri samaisella koneella. Amiga rules. :)</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Loppul&ouml;pin&auml;t - ja lopputulos</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kone on (toivottavasti) kasassa ja kuoret p&auml;&auml;ll&auml;, joten koko viritys on en&auml;&auml; loppusilausta vailla. Koneen kylkeen &quot;powered by Amiga&quot; -tarra ja koneen taakse nimitarrat liittimille. Ainakaan tulevaisuudessa ei tule tilaongelmia, jos ilmenee tarve lis&auml;t&auml; vaikkapa CD-poltin tai muu lis&auml;laite, sill&auml; vapaana on viisi kappaletta 5,25&quot;:n paikkoja. Tornin sis&auml;ll&auml; on vapaana kolme kappaletta 3,5&quot;:n paikkoja, ja lis&auml;&auml; on j&auml;rjestett&auml;viss&auml; hankkimalla ylim&auml;&auml;r&auml;inen 3,5&quot;:n laitteiden asennuskehikko.
						<center>
							<p><img height="269" width="300" src="kuvat/sivu.jpg" alt="Tornin sis&auml;lt&ouml;"></p>
							<p><img height="320" width="300" src="kuvat/etutaka.jpg" alt="Torni takaa ja edest&auml;"></center>
					</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
