<HTML>
<HEAD>
<TITLE>REFLECTOR 038</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.GIF">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
Leserbriefe</H1></CENTER>
<HR SIZE=5><P>

Dem<B> REFLECTOR-Team</B> liegt viel an Eurer Meinung zu unserem Magazin, zu<B> REFLECTIONS</B> und jeden
anderen Thema. In der Abteilung Leserbriefe kann der Leser des<B> REFLECTOR</B>-Magazins sein
Statement zur Diskussion stellen.<P>

<B>Bevor es nun losgeht, etwas in eigener Sache: Wir bitten Euch uns Eure Zusendungen bzw.
Leserbriefe als ASCII - Text auf Disk zukommen zu lassen. Es ist eine &auml;u&szlig;erst
undankbare Aufgabe, seitenlange Briefe abzutippen. Hinzu kommt, da&szlig; diese meistens
sowieso auf einem Rechner geschrieben und anschlie&szlig;end ausgedruckt wurden. In
Zukunft werden wir Leserbriefe, die nicht  als ASCII-File vorliegen zwar zur Kenntnis
nehmen, aber nicht ver&ouml;ffentlichen.</B><P>

<HR><P>

<A NAME="TinoStandke"></A>
<B>Tino Standke</B> aus Manching er&ouml;ffnet heute den Reigen der Leserbriefe. Ohne
lange Vorreden lassen wir Ihn zu Wort kommen:<P>

<B>Hallo Reflector !<P> 
Ich bin´s mal wieder, Tino. Habe schon lange nichts mehr von mir sehen lassen, was
ich mit dem heutigen Zeilen wieder gut machen will. Eure letzten Ausgaben waren wie
immer gut (Schleim). Kommt es mir nur so vor oder kommen immer weniger Ausgaben ?
Oder bin ich immer nur so gespannt darauf ? Ich fiebere jedenfalls jeder neuen
Reflector-Ausgabe nur so entgegen. 2-3 Monate warten ist schon echt lang. Zur Zeit
scheint ja im Club etwas Flaute zu herrschen. Kaum Bilder, keine Briefe und noch
weniger Tools. Da&szlig; das am so genannten Sommerloch liegen soll glaube ich kaum, da
ich ja auch rund um die Uhr Rendere und Szenen gestalte. Teilweise 2-3 Tage am
St&uuml;ck. Ich bin eher der Meinung,  da&szlig; sich jetzt alles rund um Reflections im
Internet abspielt. Ihr solltet mal schauen was sich in den Mailinglists von Oberland
so abspielt. Jede Menge Problehme rund um Reflections . Aber auch sehr viel
n&uuml;tzliches wie Tips und Tricks. Ich finde ihr solltet parallel zu Euren
Reflector-Mag verst&auml;rkt euer Augenmerk auf eure Seiten im Internet richten.
Etwas Facelifting w&uuml;rde denen sicherlich nicht schaden. Ein netter Konferenz
und Chat Bereich rund um unser Lieblingspielzeug, das w&auml;r doch was. Man
k&ouml;nnte dann z.b. am Wochenende oder so eine nette Konferenz halten  und sich
mal Richtig ausschwatzen  &uuml;ber Reflections. Das kommt sicherlich gut. Meint ihr
nicht ? Ihr k&ouml;nntet &uuml;berhaupt mal einen kleinen Bericht &uuml;ber die 
Internet Seiten von Oberland abgeben, da tummeln sich ja einige Super Bilder von
den Mitgliedern rum. Habe jedenfalls schon genug endeckt. Ich pers&ouml;nlich
w&uuml;rde mich auch mal freuen, wenn ihr &uuml;ber all die Zusatz Tools von
Oberland berichten w&uuml;rdet , z. B. Das Buch" Zaubern mit Reflections ", da
scheinen sich ja auch die Geister zu scheiden. Oberland lobt es (was sonst ) und
die anderen haben es vor Wut zum Fenster raus geschmissen.<P></B>

Dr. Reflectus:<BR>
Wir haben auch schon mit dem Gedanken gespielt im Internet rumzufuhrwerken, nur
wer zahlt dann unsere Telefonrechnung ? Trotz aller Lobsingerei ist das Internet
leider sehr teuer. Zu Glanzzeiten haben wir bereits an die 200-300 DM Telefonkosten.
Wobei die Masse dann tats&auml;chlich auf <B>REFLECTIONS-Club</B> - Belange zur&uuml;ckzuf&uuml;hren
ist. Mal ganz davon abgesehen, da&szlig; WWW bekannterma&szlig;en ja ´WeltWeites Warten´  hei&szlig;t. 
Aber wie w&auml;re es, wenn unsere Mitglieder regelm&auml;&szlig;ig ´Bericht´ erstatten,
was sich so im Internet abspielt?<P>

Zu dem Buch "Zaubern mit Reflections" k&ouml;nnen wir nur eins sagen: Klasse ! Selbst
unsereins hat noch von dem Buch lernen k&ouml;nnen und das nach &uuml;ber 5 Jahren
mit <B>REFLECTIONS</B>. Das sagt doch wohl alles aus, oder ?<P>

<B>Ich w&uuml;rde es mir schon ganz gern kaufen, nur habe ich keine Lust in eine
Trickkiste zu greifen. Und schon gar nicht zu diesem Preis. Das mit der Firma, die
noch Grafiker sucht, fand ich besonders nett; so etwas sollte es &ouml;ffters geben.
Grins. Ich habe denen nat&uuml;rlich sofort geschrieben (gemailt), nur wei&szlig;
ich nicht ob die Adresse richtig war , das @ oder was das sein sollte war bei mir
total verwaschen . K&ouml;nntet ihr sie noch mal aufschreiben ? Bitte !<P></B>

Dr. Reflectus:<BR>
Die Bitte wird erf&uuml;llt, hier noch mal die Email-Adresse:
<A HREF=mailto:e.f.c@top.east.de>e.f.c@top.east.de</A><P>
 
<B>Vor ein paar Monaten habe ich auch schon mal so etwas &auml;hnliches vorgehabt,
aber da habt ihr ja geschrieben man k&ouml;nnte unsere Mitglieder nicht zu so etwas
motivieren. Schade eigendlich, es gibt doch nichts sch&ouml;neres wie mit seinem
Hobby ein bisserl Geld nebenbei zu Verdienen. Wie sieht es eigendlich mal mit einen 
kleinen Wettbewerb aus? Ein Thema viele Einsendungen , das oder der beste 
bekommt etwas tolles .(Reise nach Oberland) h&auml; h&auml; . Was macht ihr eigentlich 
mit all den Bildern die ihr nicht Ver&ouml;ffentlicht ? Verstauben die oder wie ? 
Da k&ouml;nnte man doch sicherlich auch bald eine CD draus machen . Rigo,s CD 
scheint ja auch ein 3 Jahresprojekt zu werden .Letzte Woche hat mir Rigo 
geschrieben das die CD immer noch nicht fertig wird , eildieweil er noch auf 
einen Workshop von Akira wartet . Also Akira, nu mach mal hinne Mensch !  
(Sicherlich wird der Workshop auf einen Amiga geschrieben). grins . Ach 
&uuml;brigens weil ich gerade dabei bin, Orhan deine Fische fand ich echt gut.
Ist schon mal was anderes als immer irgend ein Raumschiff zu Rendern , 
Raumschiff umdrehen neuer Hindergrund fertig ist Bild Nummer 2 u.s.w. .<P></B>

Dr. Reflectus:<BR>
Die CD ist fertig und kann bei Rigo Sievert geordert werden. F&uuml;r Mitglieder
kostet diese 25 ,- DM + Porto. F&uuml;r nicht Mitglieder 35,- DM + Porto.
Wir meinen ein fairer Preis f&uuml;r das Scheibchen. Viele Bilder die nicht 
ver&ouml;ffentlicht werden konnten sind auf dieser CD und nat&uuml;rlich jede Menge
Anims usw. la&szlig;t Euch &uuml;berraschen.<P>

<B>Manchmal kommt es mir sowieso so vor als sei Reflections ein Trecki oder 
Star Wars Programm , lauter Raumschiffe . Als gebe es nix anderes . Wo 
sind eigendlich die Kampfstern Galactica Fans ? Ein Zylonen Kampfschiff 
habe jedenfall schon mal fertig , jetzt fehlt mir nur noch ein Opfer . 
Das Raumschiff Enterprise w&auml;re ganz geignet , oder ein paar X Wing Fighter. 
hi hi. Na ja mal sehen irgend einen werden meine Blechk&ouml;pfe schon aus den 
Universum vertreiben. Alle Macht den Zylonen .!!!!!!! So nun werde ich mal 
wieder zum Ende kommen , diese Woche oder n&auml;chste schicke ich euch noch ein 
paar Bilder mit der Deutschen Bundespost. Ich hoffe ich konnte mit meinen 
Bildern und meinen paar l&auml;ppigen  Zeilen dazu beitragen das die n&auml;chsten 
Ausgaben vom Reflector wieder ein bischen spannender wird. Also Leute macht 
mal weiter so und alles Gute f&uuml;r die Zukunft w&uuml;nscht euch.<P></B>

<B>Tino Standke aus Manching<P></B>

Dr. Reflectus:<BR>
Wo ist denn das Zylonen Raumschiff ? Auf <B>REFLECTOR</B> wurde es bis jetzt auf
jeden Fall noch nicht gesichtet. Also immer her mit dem Gelumpe. Klar, da&szlig; es
viel StarTrek und StarWars auf <B>REFLECTOR</B> zu sehen gibt. Wir haben ja auch
viele Trekker im Club. Ist das so schlimm ?<P>

Ansonsten bedanken wir uns bei Tino f&uuml;r seinen Leserbrief und wollen nat&uuml;rlich
auch seine Anschrift bekanntgeben:<P>

<PRE><B><P>
	Tino Standke
        Am Kreuzfeld 7

        85077 Oberstimm
        Tel.: 08459-30758
</B></PRE><P>

<HR><P>

<A NAME="MarkusKuhnen"></A>
Die n&auml;chste Zuschrift stammt von <B>Markus Kuhnen</B> aus Essen. Markus sollte Euch
ja inzwischen bekannt und dies nicht nur als Trekki. Markus hat einiges zum
Besten zu geben. Los geht's:<P>

<B>Hallo Reflector,<P>

nachdem ja in letzter Zeit das Material f&uuml;r REFLECTOR immer knapper wird, 
schicke ich Dir auf diesen beiden Disketten meine neuesten Erg&uuml;sse sowie 
einige Tools, die bei der t&auml;glichen Arbeit mit REFLECTIONS meiner Meinung 
nach ganz praktisch sind.<P>

Da h&auml;tten wir zun&auml;chst ein ARexx-Script zum automatischen Laden mehrerer 
Szenen auf einmal. Dieses Script wurde von einem Mitglied der REFLECTIONS-Mailinglist 
geschrieben und funktioniert tadellos, mit zwei Einschr&auml;nkungen: Es funktioniert 
NICHT mit Ref-2.5-Szenen, und weil es ein ARexx-Script ist, l&auml;uft es nat&uuml;rlich 
NUR auf dem AMIGA, nicht auf dem PC. Das Script mu&szlig; lediglich ins ARexx-Verzeichnis 
innerhalb des REFLECTIONS-Verzeichnisses kopiert werden, und schon l&auml;&szlig;t es sich 
per Men&uuml; von REFLECTIONS aus aufrufen.<P></B>

Dr. Reflectus:<BR>
Jo, das Tool bzw. ARexx-Script ist ganz n&uuml;tzlich. Wir haben es auf diese Ausgabe gepackt:
( <A HREF="SZLADEN.HTM">Script Szenen_Laden</A> ). Viel Spa&szlig; damit.<P>

<B>Das zweite ARexx-Script stammt aus dem Aminet. Es hei&szlig;t RefLandscape und
ist daf&uuml;r gedacht, mit REFLECTIONS 4.0 (!) fraktale Landschaften zu erstellen.
Es mu&szlig; ebenfalls in REFLECTIONS' ARexx-Verzeichnis kopiert werden, ebenso wie
das zugeh&ouml;rige ausf&uuml;hrbare Programm. Um es mit REF 4.1 nutzen zu k&ouml;nnen,
sind zwei &auml;nderungen vorzunehmen: Das Script "landscape.rexx" mu&szlig; in
"landscape.ref_rexx" umbenannt werden, und innerhalb des Scripts mu&szlig; in der Zeile
(ziemlich am Anfang), in der das Programm "landscape" aufgerufen wird, der volle Pfad zu
diesem Programm eingegeben werden. Bei mir ist das z. B.
"sys:Grafik/Reflections/Arexx/landscape", da sich das Programm landscape auch im
ARexx-Verzeichnis befindet. Auch dieses ARexx-Script l&auml;uft nat&uuml;rlich nur 
auf dem AMIGA. Eine Schw&auml;che des Programms m&ouml;chte ich noch erw&auml;hnen:
ARexx ist nicht gerade daf&uuml;r entwickelt worden, um damit zeitkritische und
rechenintensive Operationen durchzuf&uuml;hren. Mithin ist die Landschaftsgenerierung
etwas langsam und dauert auch auf einem 60er etwas l&auml;nger als man erwarten
w&uuml;rde. Bis zu einer Iterationstiefe von 5 werden die Landschaften noch innerhalb
von Sekunden berechnet. Bei 6 ist es schon fast eine Minute und bei 7 schon fast 10
Minuten. 8 (das Maximum) habe ich bislang noch nicht ausprobiert. Eine so riesige
Landschaft (immerhin 131.072 Dreiecke) brauche ich normalerweise nicht.<P></B>

Dr. Reflectus:<BR>
Ist ebenfalls in der <A HREF="LANDSCAP.HTM">Tool-Ecke</A> zu finden. Ist wirklich
ganz n&uuml;tzlich. Die Geschwindigkeit ist als ertr&auml;glich zu bezeichnen (kommt nat&uuml;rlich
auf den Prozessor an), wobei ARexx sich hier ja nicht gerade mit Ruhm bekleckert.<P>

<B>Als drittes Programm liegt noch 'JPEGOptim' bei. Es hat zwar nichts mit REFLECTIONS
zu tun, ist aber dennoch ganz praktisch. Es optimiert JPEG-Files wahlweise mit oder
ohne Qualit&auml;tsverlust. Ohne Qualit&auml;tsverlust verkleinert es die meisten
JPEG-Bilder um 1-5%. Das ist zwar nicht viel, aber jedes gesparte Byte kann wertvoll
sein, wenn ein Bild dadurch so gerade noch auf eine Diskette pa&szlig;t.</B><P>

Dr. Reflectus:<BR>
In der Tat kann jedes gespartes Byte irgendwo hilfreich sein. Ausprobiert haben wir
das Tool allerdings nicht. Zu finden ist es in der <A HREF="JPEGOPTI.HTM">Tool-Ecke</A>
auf dieser Ausgabe. Also bei Interesse mal reinschnuppern.<P>

<B>Als Erg&auml;nzung zu meinen beiden Workshop- Bildern zu den Mathe-Texturen habe
ich noch ein  drittes Bild erstellt. Diesmal geht es um die
<A HREF="WORKSHOP.HTM">Holz-Textur</A>. Direkt von der phase5 - Homepage habe ich
noch einen Text besorgt, der sich mit den <A HREF="PPCNEWS.HTM">PowerUp-Pl&auml;nen</A> 
f&uuml;r den A1200 besch&auml;ftigt.</B><P>

Dr. Reflectus:<BR>
Der ein oder andere findet den Mini-Workshop hinsichtlich der Parameter der
mathematischen Holztextur sicherlich n&uuml;tzlich. Auf die A1200 PPC-Karten sind wir
gespannt. Die Karten f&uuml;r den A4000 sind ja bereits seit l&auml;ngerem lieferbar, allerdings
l&auml;&szlig;t <B>REFLECTIONS-PPC</B> ja noch auf sich warten (Carsten mach' hinne!).<P>

<B>Als Abschlu&szlig; m&ouml;chte ich noch ein paar Anmerkungen zu verschiedenen
Leserbriefen machen. Da ich zu faul bin, mir die Namen der Schreiber rauszusuchen,
schreibe ich nur allgemein zu den Themen. Der jeweilige Schreiber wird dann schon
wissen, da&szlig; es um seinen Brief geht:<P>

Da gab es den Vorschlag, da&szlig; die Amiga-User sich auf den PC-Dateinamenstandard
"8+3" beschr&auml;nken sollten. Dazu bin ich schlicht und ergreifend nicht bereit !
Auf dem Amiga sind lange Dateinamen schon seit 10 Jahren Standard! Im Laufe der Jahre
habe ich mich derma&szlig;en daran gew&ouml;hnt, meine Dateien mit ordentlichen,
selbsterkl&auml;renden Namen zu versehen, da&szlig; es f&uuml;r mich eine gewaltige
Einschr&auml;nkung w&auml;re, wenn ich pl&ouml;tzlich mit kryptischen Abk&uuml;rzungen 
arbeiten m&uuml;&szlig;te, deren Bedeutung man nach ein paar Wochen sowieso nicht
mehr wei&szlig;. Ich denke, jeder sollte die Vorz&uuml;ge seines Systems voll ausnutzen,
und beim AMIGA z&auml;hlen die langen Dateinamen sicherlich dazu. Schlie&szlig;lich
w&uuml;rde ich nie von einem PCler verlangen, nur noch Programme zu benutzen, die es
auch f&uuml;r den AMIGA gibt.</B><P>

Dr. Reflectus:<BR>
Dies betrifft auch nur Windows 3.1 usw. Unter Windows 95 sind l&auml;ngere Dateinamen
erlaubt. Problematisch ist dann nur noch CrossDOS auf dem Amiga, da hier die langen
Dateinamen auf "8+3" gek&uuml;rzt werden. Abhilfe: einfach die Dateien mit den langen
Dateinamen mit ZIP packen und das Archiv auf Disk kopieren. Dann klappt es einwandfrei.<P>

<B>Dann hat sich jemand dar&uuml;ber ausgelassen, da&szlig; in den meisten Bildern
Kriegsger&auml;t zu sehen sei. Seit wann sind denn bitte sch&ouml;n Star-Trek-Raumschiffe
Kriegsger&auml;t ? Wie Guinan es in der Folge "Yesterday's Enterprise" so sch&ouml;n 
usdr&uuml;ckt: "Dies (die Enterprise) ist doch kein Kriegsschiff! Es ist ein Schiff
des Friedens!"</B><P>

Dr. Reflectus:<BR>
Tja, das ist wohl alles Auslegungssache. Die Bundeswehr fliegt schlie&szlig;lich auch nicht
zu Kriegseins&auml;tzen, sondern soll mit Waffen den Frieden durchsetzen. Ist an sich schon
ein Widerspruch. So ist er halt der Mensch.<P>

<B>Last but not least noch zu dem Modell des Raumlabors Regula 1 auf der letzten
Objektdisk: Ich finde das Objekt wirklich super! Es ist sehr detailliert ausgearbeitet
und sieht einfach toll aus. Aber leider kann ich es nicht benutzen! Obwohl ich mit
16 MB Fastram sicherlich f&uuml;r Amiga-Verh&auml;ltnisse &uuml;berdurchschnittlich
viel Speicher habe, reicht das nicht f&uuml;r dieses "Klopper"-Modell aus. Zum
Einladen und Betrachten in REFLECTIONS reichen die 16 MB noch, aber sobald die Texturen
zum Rendern dazu geladen werden, wird's zu eng. Auch wenn ich Beams direkt von der
Workbench aus starte. Dies ist umso bedauerlicher, als ich beim Anschauen des
Objektes festgestellt habe, da&szlig; es nicht so riesig sein m&uuml;&szlig;te.
Da gibt es Zylinder, deren Rotation mit mehr als 100 Abschnitten durchgef&uuml;hrt
wurde. Das ist unn&ouml;tig! Daf&uuml;r gibt es doch das "Rund"-Flag. F&uuml;r einen
Zylinder reichen 36 Unterteilungen (alle 10 Grad eine) in jeden Falle aus. H&auml;tte
man das Objekt nur ein bi&szlig;chen sparsamer erstellt, k&auml;me es sicherlich mit
einem Viertel des Speichers aus, den es jetzt ben&ouml;tigt, und s&auml;he genauso aus. 
Um Mi&szlig;verst&auml;ndnissen vorzubeugen: ich will hier den Objektersteller nicht
niedermachen. Wie schon gesagt, finde ich das Modell genial! Aber ein bi&szlig;chen
konstruktive Kritik hat noch niemandem geschadet.<P>

So, das soll's f&uuml;r heute gewesen sein, bis dann</B><P>

Dr. Reflectus:<BR>
In der Tat ist das ein h&uuml;bsches Objekt. Recht detailliert aber auch recht umfangreich,
wie erw&auml;hnt. <B>REFLECTIONS</B> und besonders die Version 4 ist ja auch ein extremer
Speicherfresser (grmpfe&%$§"!!!!!). Allerdings w&uuml;rden wir sagen, da&szlig; 16 MB alles andere
als ausreichend sind. Schlie&szlig;lich ist RAM derzeit ja &auml;u&szlig;erst g&uuml;nstig. Unter 40 MB
spielt sich da sowieso nichts mehr ab. Inzwischen sollte Markus ja &uuml;ber mehr Speicher
verf&uuml;gen. Eines stimmt aber: Seit <B>REF v3</B> wird wenig auf die enstehende
Dreiecksmenge geachtet. Das war bei den fr&uuml;heren Versionen anders, da diese ja
bei der maximalen nutzbaren Punktmenge begrenzt waren. So &auml;ndern sich die Zeiten.<P>

Danke an Markus f&uuml;r den Leserbrief. Hier die Anschrift:<P>

<PRE><B>
        Markus Kuhnen
        Halfmannwiese 7

        45355 Essen
        Tel.: 0201-679952
        EMail: <A HREF="mailto:Markus.Kuhnen@t-online.de">Markus.Kuhnen@t-online.de</A>
</PRE></B>

<HR><P>

<A NAME="Wolfgang Hermsdorf"></A>
Als n&auml;chstes kommt <B>Wolfgang Hermsdorf</B> zum Zuge. Wolfgang wird unter
anderem von einem Problem geplagt. Lassen wir ihn zu Wort kommen:<P>

<B>Hallo Dr.Reflectus<P>

Hiermit will ich mich bei euch bedanken, f&uuml;r die schnelle Antwort auf meine
Fragen in meinen letzten Brief. Noch mehr war ich &uuml;berrascht meine ersten
Arbeiten die ich euch zuschickte schon in der Ausgabe 035 zusehen. War schon ein
gutes Gef&uuml;hl.</B><P>

Dr. Reflectus:<BR>
Sch&ouml;n, da&szlig; wir Dir helfen konnten. <B>REFLECTOR</B> ist schlie&szlig;lich f&uuml;r Euch
und nat&uuml;rlich Eure Werke da. Wenn eine Ver&ouml;ffentlichung auch noch Gl&uuml;cksgef&uuml;hle
bringt umso besser.<P>

<B>Aber ich habe nun eine anderes Problem auf meinen PC ( und Win95B ),und zwar
wenn ich mir eine Animation berechnen lasse ist sie im .avi Modus in Ordnung
aber im .flc Modus wird nie die ganze Animation berechnet es fehlen immer am
Schluss ein paar Bilder. Auch bei Firma Oberland konnte man mir bis jetzt
leider nicht helfen. Wenn ich nun einen Fremdplayer ( Autodesk Player V1.10 )
benutze,um eine neu erstellte .flc Modus Animation mir anzuschauen bricht
der Player immer mit einer Schutzverletzungs-Meldung ab. Leider kann ich auch
den Player ( PlayAni ) der auf der Ref_CD 4.1 ist nicht benutzen,da ich hier
beim Start immer die Meldung bekomme er k&ouml;nne die Playani.cfg nicht &ouml;ffnen,
trotzdem sie im selben Verzeichnis liegt wie die PlayAni.exe. Nun meine Frage
ob vieleicht andere PC-Reflection Anwender evtl. auch solche Probleme haben
unter Win95 oder Win95B, oder welche anderen Player sie benutzen.</B><P>

Dr. Reflectus:<BR>
Puuh, wieder mal so ein <B>REFLECTIONS</B>-Ph&auml;nomen. Leider k&ouml;nnen wir dazu
nichts weiter sagen, da Uwe und ich (Olaf) keinen PC nutzen. Aber uns
<A HREF="PC-SUPPO.HTM">Werner</A> wei&szlig; vielleicht Rat. Ist &uuml;brigens ein m&auml;chtig
mieses Format dieses AVI. Jedenfalls das von <B>REF</B>, da es unkomprimiert
abgespeichert wird (Klopperdateien lassen gr&uuml;&szlig;en). Vielleicht hat ja einer
unserer Mitglieder ebenfalls solche Erfahrungen gemacht und wei&szlig; Rat.<P>

<B>Noch eine Frage zur PC_CD von Rigo Sievert ist sie vielleicht schon zuhaben ?
Aber nun genug f&uuml;r Heute und vielen Dank im Vorraus.<P>

Es gr&uuml;sst euch Wolfang</B><P>

Dr. Reflectus:<BR>
Die <B>REFLECTOR-CD</B> ist bereits erh&auml;ltlich. N&auml;here <A HREF="REFLECCD.HTM">Info's</A>
sind auf dieser Ausgabe zu finden.<BR>
Abschlie&szlig;end bedanken wir uns bei Wolfgang f&uuml;r seine Zuschrift und geben wie immer
seine Adresse preis:<P> 

<PRE><B> 
        Wolfgang Hermsdorf
        Prinzenstr.81

        10969 Berlin
        Tel.: 030-6147284
</B></PRE><P>

<HR><P>

<A NAME="ClausPeterNandelstaedt"></A>
Jetzt kommt unser Dauerschreiber <B>Claus-Peter Nandelstaedt</B> zu Wort. Claus-Peter
ist gleich zweimal vertreten. Wie immer hat uns Nandi einige Statements zum besten zu
geben:<P>

<B>Hallo Team.<P>

In 35 schreibt Ihr, es w&auml;ren noch genug Leserbriefe auf Halde und in 36
habt Ihr pl&ouml;tzlich keine mehr ??? Na wat denn nu ???? :-)</B><P>

Dr. Reflectus:<BR>
Ja, watt denn nu, watt is denn los ? Hat da etwa der vors&auml;tzliche Fehlerteufel
Einzug gehalten oder was ? Keine Ahnung, vielleicht hatten wir auch keine Lust
auf Leserbriefe oder waren mit anderen Dingen, zum Beispiel LightWave,
besch&auml;ftigt. Wir geloben Besserung ;-))<P>

<B>Hier mal eine gute Nachricht und ein kleiner Tip f&uuml;rs neue Ref 4.
Ich habe irgendwann mal wieder mit unserem Carsten telefoniert.
Dabei habe ich auch ganz beil&auml;ufig erw&auml;hnt,da&szlig; ich Cinema
gerne verwende, weil damit ein flottes Arbeiten m&ouml;glich ist. Unter anderem,
wenn man mal geschlafen hat, kann jede gestartete Aktion sofort wieder abgebrochen
werden. Mu&szlig; ihn wohl beeindruckt haben, denn die beste Funktion im neuen
Ref 4 ist die Esc-Taste. Jetzt kann man endlich mehrere &Auml;nderungen vornehmen,
ohne durch endloses Plotten unterbrochen zu werden. Einfach Esc-Taste dr&uuml;cken.<BR>
Und nun zum Tip:<P>

&Ouml;ffne ich z.B. ein Extra-Fenster,welches bei mir den ganzen Bildschirm f&uuml;llt,
nehme &Auml;nderungen vor und m&ouml;chte dann das Fenster wieder schlie&szlig;en,
geht nichts mehr. Das Fenster l&auml;sst sich lange nicht schlie&szlig;en und ich
dachte schon an Absturz. Weit daneben gedacht. Nach jeder &Auml;nderung plottet
Ref 4 mit absoluter Priorit&auml;t, was ich nicht sehen konnte. Alles andere hat zu
warten, also auch das schlie&szlig;en des Fensters. Wer also unter dem gleichen
Problem leidet, einfach Esc-Taste dr&uuml;cken und schon wird das Fenster geschlossen.
Das Plotten der Szene auf dem Bildschirm ist unterbrochen und kann ja jederzeit wieder
gestartet werden.</B><P>

Dr. Reflectus:<BR>
Jo, &ouml;fters mal was Neues in <B>REFLECTIONS</B>. Diese Funktion ist wirklich als
&auml;u&szlig;erst hilfreich zu bezeichnen. Ab und wann werden doch mal Verbesserungsvorschl&auml;ge
umgesetzt. Dank an Carsten !<P>

</B>Werners Bilder haben mir sehr gefallen.</B><P>

Dr. Reflectus:<BR>
Uns auch, deshalb sind sie auch drauf gewesen. Au&szlig;erdem hei&szlig;t es doch so sch&ouml;n:
Eine Hand w&auml;scht die andere (hehe).<P>

<B>Noch ein Tip f&uuml;r Werner Hermsdorf. Der TIP von Uwe mit dem K&ouml;rperfenster
ist richtig aber..... oft sind keine K&ouml;rper im K&ouml;rperfenster vorhanden, weil
gel&ouml;scht. Hier noch ne kleine Erg&auml;nzung:<BR>
Es scheint fast unm&ouml;glich einen bestimmten K&ouml;rper aus einem komplexen Objekt
herauszusch&auml;len, weil im Hintergrund immer unsichtbare Punkte lauern, welche beim
Selektieren pl&ouml;tzlich sichtbar werden. Es ist aber doch ganz einfach mit der
Punkte-selectieren-verbunden-Funktion. Das geht so:<P>

Objekt im Wire-Modus plotten lassen. Durch die verbindenden Linien l&auml;sst sich nun
eigentlich jeder K&ouml;rper erkennen. Notfalls kann man bei gro&szlig;em Gedr&auml;nge
ja mit Taste 6 vergr&ouml;ssern, was die ganze Sache noch etwas entwirrt und im
Kamerafenster wird es dann oft noch einfacher einen beliebigen Punkt vom gew&uuml;nschten
K&ouml;rpers zu finden. Im Punkte-Editor wird dann dieser eine, und wirklich nur dieser
eine Punkt selektiert (das ist das Feine an der Sache). Dann wird das K&ouml;rperfenster
ge&ouml;ffnet und der Hammer im K&ouml;rperfenster !!! angeklickt. Im aufgehenden Fenster
definieren-verbunden anw&auml;hlen. Zur Kontrolle plottet Ref 4 nun den K&ouml;rper in
einer anderen Farbe. Ist es der gew&uuml;nschte K&ouml;rper,mu&szlig; er noch einen Namen
erhalten und erscheint dann im K&ouml;rperfenster als K&ouml;rper. Wird dieser K&ouml;rper
jetzt in ein Objekt umgewandelt, wird das neue Objekt automatisch in der Hirarchieliste
an das Ursprungsobjekt angeh&auml;ngt. Sonst geht bei einer Bewegung des Ursprungsobjekts
das neue Objekt nicht mit. Das neue Objekt hingegen kann bewegt werden ohne das
Ursprungsobjekt mitzunehmen.</B><P>

Dr. Reflectus:<BR>
In der Tat ist es so wie beschrieben m&ouml;glich. Oftmals sieht man den Wald vor lauter
B&auml;umen nicht. Da mu&szlig; dann uns Nandi in die Bresche springen und Abhilfe schaffen.
Den Tip werden wir sicherlich in Erinnerung behalten, da er einiges an Arbeit wesentlich
ersparen kann.<P>

<B>Das regelt die Anordnung der Hierachie und wie ich feststellen musste, haben sogar
alte Hasen damit ihre Probleme. Die Sache ist auch hier ganz einfach.<P>
<A HREF="../BILDER/ANLEIT.GIF"><IMG WIDTH=128 HEIGHT=102 SRC="../BILDER/ANLEIT1.GIF" ALT="[BILD]">( Anleitung )</A>.<P>

Nehmen wir mal den Arm eines Robbis oder Menschen:<P>

Ansicht R.<BR>
<OL>

<LI> Er besteht hier, vereinfacht, aus einem Quader(Hand), einem Zylinder
(Unterarm) und einem 2 .Zylinder (Oberarm).Ich will nun jedem Teil eine
andere Haltung geben, ohne da&szlig; der Arm auseinandergerissen wird.</LI><P>

<LI> Dazu verschiebe ich den Achsenschnittpunkt des Oberarmes dorthin, wo die
Schulterkugel sitzen m&uuml;sste. Den Achsenschnittpunkt des Unterarms dorthin wo
das Ellenbogengelenk sitzt und den Schnittpunkt der Hand, wo das Handgelenk
sitzt. Denn alles dreht sich um den jeweiligen Achsenschnittpunkt. Jetzt mache
ich eine Hirachie in Oberarm-Unterarm-Hand.</LI><P>

<LI> Im Geoeditor drehe ich jetzt den Oberarm da&szlig; er schr&auml;g nach unten zeigt.
Alles geht mit.</LI><P>

<LI> Dann drehe ich den Unterarm schr&auml;g nach Oben, die Hand geht mit.</LI><P>

<LI> Zuletzt kann ich auch noch die Hand allein drehen. Will ich dagegen die Hand
in eine bestimmte R&auml;umliche Stellung drehen, muss ich die Hirachie &auml;ndern
in Hand-Unterarm-Oberarm.</LI><P>

<LI> Den Schnittpunkt der Hand zur Schulterkugel ziehen und wenn ich jetzt
die Hand drehe geht der Arm komplett mit. Das war's. Nehmt den Schnittpunkt der
Hand wieder zum Handgelenk zur&uuml;ck und dreht dann die Hand und Ihr werdet
sehen wie wichtig der Schnittpunkt ist und der richtige Aufbau der Hirachie.</LI><P>

</OL>

Beim Drehen der einzelnen K&ouml;rper drehen sich nat&uuml;rlich auch die Achsen
entsprechend mit.Wer sp&auml;ter mal &uuml;ber eine Achse drehen oder bewegen
m&ouml;chte, mu&szlig; entweder sehr aufpassen, oder sollte gleich nach einer
Drehung mit dem Gadget &uuml;ber dem Schnittpunkt-bewegen-Gadget die Sache bereinigen.
(Dies ist aber auch zu einem sp&auml;teren Zeitpunkt noch m&ouml;glich).</B><P>

Dr. Reflectus:<BR>
Tja, so etwas lieben wir: ein kompletter Workshop. Da brauchen wir nicht mehr viel
zu schreiben. Wir haben &uuml;brigens die Sache bisher nicht nachvollzogen bzw. gepr&uuml;ft.
Ist allerdings bei Onkel Nandi auch nicht n&ouml;tig. Weiter geht's mit einem weiteren
Leserbrief von Claus-Peter:<P>

<B>Tach,Team!<P>

Danke f&uuml;r die M&uuml;he, uns tolle Sachen mit dem Reflector r&uuml;berzuschieben !!!!<P>

Ich w&uuml;nsche Allen ein frohes Fest und feiert sch&ouml;n ordentlich Silvester.
Passt auf, wenn Ihr abgef&uuml;llt seid, dass Ihr beim Umfallen nicht immer
mit dem Kopf die <U>Tischkanten abschlagt</U>. (:-) Na denn, Prost Neujahr.</B><P>

Dr. Reflectus:<BR>
Alles paletti &uuml;berstanden und doch wieder zugenommen; also nix neues dieses Jahr
Weihnachten. Gut reingerutscht sind wir auch und zwar "nur" anges&auml;uselt. Wir wu&szlig;ten
schon noch was wir tun und so und &uuml;berhaupt.<P>

<B>Anbei noch eines meiner
<A HREF="../BILDER/AUGHOEH.JPG"><IMG WIDTH=128 HEIGHT=102 SRC="../BILDER/AUGHOEH.GIF" ALT="[BILD]"></A>Frage-Bilder</A>.
H&auml;ngt auch bei  meiner pers&ouml;nlichen Galerie.Sieht auf den ersten Blick recht langweilig aus.
Meine G&auml;ste sehen sich die Bilder aber immer genau an und dann beginnt die
Fragerei.Bei diesem Bild passt n&auml;mlich genaugenommen garnichts zusammen.
Der helle Stern kann nicht der Lichtspender sein,denn dann m&uuml;ssten die
Schatten parallel laufen. Wo also h&auml;ngt die nahe Lichtquelle ?
Wo befindet sich der Planet ? Bestimmt nicht in unserem System, denn Abstand
und Gr&ouml;&szlig;e zueinander stimmen nicht. Wo kommt dann der Mensch her?
Ist er der letzte &Uuml;berlebende des gro&szlig;en Raumschiffes und hat sein Wissen
verloren ? Wer fliegt dann die Ufos ? Etwa die Augen ?
Helfen sie Ihm,oder wird er von dem gro&szlig;en Auge bedroht ?
Was macht das kleine Auge auf dem Steinbrocken ?
Ist er an der lila Kuh interessiert,oder hat er Angst vor Ihr ?
Was ist das &uuml;berhaupt f&uuml;r eine kleine Kuh ?
War da ein Schokoladefan unter der Besatzung,oder wurden Genversuche
gemacht,die aus dem Ruder liefen und den Planet verw&uuml;stet haben?
Sieht man deshalb kein Gr&uuml;n,der Dunst signalisiert Feuchtigkeit.<P>

Und, und, und.......<P>

Bei vielen Gl&auml;sken Wein,haben wir zu Viert mal einen ganzen Abend &uuml;ber das
Bild diskutiert, Theorien aufgestellt und wieder verworfen.So um Mitternacht hatten wir einen
hatten wir dann eine story die fast druckreif war.</B><P>

Dr. Reflectus:<BR>
Ganz so weit sind wir noch nicht, denn wir finden ein Bild gut oder nicht gut. Dar&uuml;ber zu
sinnieren warum etwas so ist und weshalb und &uuml;berhaupt, daf&uuml;r ist sehr wenig Zeit. Sicherlich
fallen einige Dinge auf, aber wir nehmen so etwas als sch&ouml;pferische Freiheit hin. Was soll's.<P>

Also doch nicht so langweilig? Man mu&szlig; nur was daraus machen.<P>

An Dr.Reflectus.<P>
Hierzu geh&ouml;rt auch die beiliegende<A HREF="O-NANDEL.HTM">ZugSzene</A>.
Die gerenderte Szene ist in Reflector 33 zu bewundern.<P>
                
<B>Die kleinen Vorschau-Bilder im Reflector haben bei mir immer grausam
ausgesehen. Heute hatte ich nun den grandiosen Einfall meine Workbench vor dem
starten des browsers auf 256 Farben umzustellen.Jetzt sieht dat ganz ganz
toll aus.So finde ich blindes Huhn auch mal einen Korn.Nicht immer,aber immer
&ouml;fter.Ich k&ouml;nnte mir vorstellen, dass der Eine oder Andere seine workbench
auch noch mit weniger als 256 Farben betreibt damit die Rechnerleistung
nicht unn&ouml;tig gebremst wird,daf&uuml;r im HTM aber scheu&szlig;liche Bildchen hat.</B><P>

Dr. Reflectus:<BR>
Die Sache mit den Vorschaubildern liegt sicherlich nicht unbedingt an HTML. Wir haben damals
zur Einf&uuml;hrung oft genug darauf hingewiesen. 256 Farben sollten es schon sein. Im &uuml;brigen kann
man die Amiga-Browsern ja einen eigenen Screen mit entsprechender Farbanzahl &ouml;ffnen lassen. Die
Workbench kann ja weiterhin mit wenig Farben gefahren werden.<P>

<B>Hallo Orhan!<P>

Das war am Thema vorbei.
Ich wei&szlig; nicht warum, aber irgendwie mu&szlig; ich den Eindruck erwecken,Ref 4
sei f&uuml;r mich ein B&ouml;hmisches Dorf und ich wei&szlig; nicht wie ich damit umgehen
mu&szlig;??? Das dem nicht so ist beweist meine beiliegende Zugszene, eine reine
Ref 4 Arbeit.(Zur Nachahmung empfohlen).</B><P>

Dr. Reflectus:<BR>
Jo, die Szene ist ja in der <B>Objekt-Bibliothek</B> zu finden. Ist wirklich wieder mal ein
typisches Nandi-Produkt. Ist es wirklich gut gelungen und auch wie von Claus-Peter bemerkt
zur Nachahmung zu empfehlen.<P>

<B>Danke f&uuml;r die M&uuml;he mich zu unterst&uuml;tzen.Deine Tips sind mir bekannt,l&ouml;sen
aber das Problem nicht,denn es ist viel komplexer,als es den Anschein hat.
Ich habe eine riesige Sammlung von Objekten, welche fast immer mit den
gleichen Materialien aus einer Stammliste best&uuml;ckt sind.<P>

Wer mich kennt,dem ist bekannt dass meine Szenen nicht nur aus 1-2 Objekten
bestehen.(siehe beiliegende Zugszene)
Mache ich nun eine neue Szene, werden aus der Objektsammlung neue Objekte
zusammengemixt.Das ist viel einfacher,als immer wieder die gleichen Objekte
neu zu konstruieren.
Neue Objekte, welche ich f&uuml;r eine Szene brauche werden erst mal einzeln
erstellt,damit beim Konstruieren nicht unn&ouml;tiger M&uuml;ll mitgeschleppt wird.
Das bedeutet sp&auml;ter nachladen, nachladen, nachladen.
Und hier liegt der Hase im Pfeffer.
Anstatt wie in 2.5 zu schecken,ob bereits Materialien mit
gleichen Namen vorhanden sind, wird eifrig vorhandenes Material +1 hinzu
geladen.Anstelle von 10-20 Materialien habe ich dann schnell weit &uuml;ber 100.
( z.B. rot+8, gelb+10 usw.). Kein Wunder, das Ref 4 so aufgeblasen ist.<P>

Dieses +1 ist die Stolperfalle!!! Nicht auf das Material an sich greifen die
vorhandenen Objekte zur&uuml;ck,sondern auf Ihre Nummer,welche beim Nachladen
zugeteilt wurden.
Da kann ich speichern soviel ich will,da wird nix gel&ouml;scht.Logisch.</B><P>

Dr. Reflectus:<BR>
Ist in der Tat ein dummes Verhalten von uns <B>REFLECTIONS</B> und tr&auml;gt auch sicherlich
zum erh&ouml;hten Speicherverbrauch bei. Wir haben des &ouml;fteren schon darauf hingewiesen, da&szlig;
dies in der Version 2.5 einfach besser gel&ouml;st war. Vielleicht bringt die Zeit ja mal eine
&Auml;nderung.<P>

<B>zum Mitschreiben:
Starte Ref 4 mit einer leeren !!! Materialliste.
Erzeuge einen W&uuml;rfel und erzeuge ein Material,welches Du an den W&uuml;rfel
vergibst.In der Materialliste ist also jetzt nur dieses eine Material.
Jetzt sichere mal die Szene.ok.
Lade dann die gespeicherte Szene wieder dazu und lade die gespeicherte Szene
ein weiteres mal dazu.(entspricht dem laden verschiedener Objekte mit
exact dem gleichen Material).
Jetzt hast Du in Deiner Szene 3 W&uuml;rfel mit exact dem gleichen Material.
Und nun sieh mal in der Materialliste nach.Dort erscheint
Material,Material1,Material2, also exact 3 mal das gleiche Material,
ben&ouml;tigt wird aber nur 1 Material.
Nun zu Deinem Vorschlag:
Speichere die Szene mit den 3 W&uuml;rfeln als PKL ab.
Gehe auf Neu.Jetzt hast Du keine Szene und eine leere Materialliste.ok?
Lade jetzt die Szene mit den 3 W&uuml;rfeln und schau Dir die Materialliste an.
Die 3 Materialien sind immernoch da.(Werden beim speichern nicht gel&ouml;scht,
weil Objekte daraufzur&uuml;ckgreifen).</B><P>

Dr. Reflectus:<BR>
Hey Orhan, alles mitbekommen ? Los nachmachen ...<P>

<B>Nun zu Deinem n&auml;chsten Vorschlag:
Lade die Zugszene, l&ouml;sche die Lokomotive und einen Wagen weil diese, aus
welchen Gr&uuml;nden auch immer,nicht mehr in der Szene erw&uuml;nscht sind.
Nun l&ouml;sche mal die Materialien welche nicht mehr ben&ouml;tigt werden
in der Art und Weise,welche Du mir vorgeschlagen hast.
Jetzt grins ich mir aber eins. (:-)
You know what I mean . Isnt it ??
Das l&ouml;schen mit der Gummibox kannste vergessen,denn welche Materialien
liegen schon so sortiert in der Liste, das man sie mit der Gummibox
selektieren kann.
Bleibt die Einzelselektierung.Hier mu&szlig; man sich m&uuml;hsam durch die Liste
hangeln und l&auml;uft immer Gefahr,das Falsche zu l&ouml;schen.Ja glaubt denn
wirklich jemand,ich weiss ob das gel&ouml;schte Objekt z.B. rot3 oder rot5
gehabt hat?Bin ich denn der Leo, dass ich mich mit so einem Schei&szlig;
rumschlagen muss??<P>

Jetzt k&ouml;nnte man zwar wirklich &uuml;ber die Pkl speichern,auf Neu gehen und
die gespeicherte Szene wieder laden, aber das dauert und kann ja wohl nicht
das Gelbe vom Ei sein.
Bestimmte Materialien werden beim speichern nur gel&ouml;scht, wenn ein Objekt
mit eben diesen Materialien gel&ouml;scht  oder Material nicht vergeben wurde.
Und genau das ist es, was mich so auf die Palme bringt.
Denn es besagt doch,dass Ref 4 genau wei&szlig;,welche Materialien &uuml;berfl&uuml;ssig
sind.Warum also l&ouml;scht Ref4 nicht nach einer Frage automatisch diese
Materialien, wenn das Objekt gel&ouml;scht wurde.
Unn&ouml;tige Arbeit,wie in der Steinzeit und nicht wie im Computerzeitalter!!!
Gerechterweise mu&szlig; ich auch erw&auml;hnen, da&szlig; uns Carsten mit dem +1
fr&uuml;here Fehler umgehen will.
z.B. Ich mache  einzeln eine rote matte Kugel mit der Materialbezeichnung rot,
einen rot gl&auml;nzenden W&uuml;rfel mit der Materialbezeichnung rot und einen
 rotleuchtenden Zylinder mit der Materialbezeichnung rot.
Wurden diese in 2.5 nacheinander zugeladen gab es dann eine rotmatte Kugel
einen rotmatten W&uuml;rfel und einen rotmatten Zylinder, weil die rotmatte
Kugel zuerst geladen wurde und beim nachladen der anderen Objekte eben diese
bezeichnung rot schon vorhanden war und damit rot nicht mehr  geladen wurde.
Es gab Anwender welche nicht darauf geachtet haben und dann reklamierten.<P>

Es ging und geht aber auch anders:
Man hat einfach seine pers&ouml;nliche Materialliste.Wenn das Renderprogramm
gestartet wird,wird diese Materialliste gleich mitgeladen.Mache ich nun ein
neues Objekt kann ich Material aus dieser Materialliste verwenden.
Ben&ouml;tige ich ein noch nicht vorhandenes Material wird es einfach mit einem
Namen erstellt,der noch nicht vorhanden ist und dann gespeichert.So kann es
keine Verwechslungen geben.Da es Heute bei jedem Programm auch eine Ansicht
des Materials gibt kann man die Namen sehr kurz halten.r=Rot, gl=Glanz,
s=Spiegel ist rgls=rot mit Glanz und Spiegel.
In meiner ZugSzene trifft das noch nicht zu, weil mir die Kugelerstellung
zu unhandlich und zeitaufwendig ist.<P>

Cinema macht das automatisch sowie ein Material ge&auml;ndert oder neu gemacht
wird.
Lade ich mal Materialien in Cinema,die noch keine Kugelansicht haben,(alte
Ref-Materialien),gen&uuml;gt ein Klick und Cinema erzeugt alle noch fehlenden
Kugeln,ohne dass ich erst das Material aufrufen und ins Materialfenster
gehen mu&szlig;.
Cinema jedenfalls hat mit dem Material keine Probleme.
Wenn ich mehrere Objekte mit gleichen Materialien lade,kann anschlie&szlig;end
z.B. rot auch mehrmals vorhanden sein.
Mit einem Tastendruck kann ich aber jederzeit nicht vergebenes oder doppeltes
Material l&ouml;schen.
Es geht also.Hat nichts mit mehreren Programmierern zu tun und mit dem Preis
schon garnie nicht, sondern hat was mit Anwenderfreundlickeit zu tun.
Der Anwender bezahlt n&auml;mlich den Programmierer,auch wenn das Manche nicht
nachvollziehen k&ouml;nnen.
So kommt bei Ref 4 ein Minus zum Anderen.
Ref 4 ist jedenfalls von meinem Rechner verschwunden und solange kein
Converter kostenlos dabei ist,der wenigstens Ref 4  Objekte in 1 g&auml;ngiges
Format convertiert, oder Ref4 die Szenen in einem g&auml;ngigen Format
speichern kann,wird es auch weiterhin einstauben.
Kostenlos deshalb, weil jeder Programierer eigentlich Haue verdient, wenn
er meint noch ein neues Format verwenden zu m&uuml;ssen.
Konkret, wer mit Ref 4 m&uuml;hselig und mit viel Schwei&szlig; Objekte macht,kann sie
nicht der breiten Masse zug&auml;nglich machen.Das ist ein unm&ouml;glicher Zustand.<P>

Siehe die neue Reflections People Collection von Oberland.
Hier wurde erstmal von einem g&auml;ngigen Format nach Reflection convertiert.
Jetzt kann ich aber diese Objekte nur f&uuml;r Reflection verwenden,k&ouml;nnte sie
f&uuml;r Cinema oder Imagine auch brauchen, geht aber nicht.
Was f&uuml;r ein Irrsinn.

So,jetzt ist mein Kropf geleert und das Neue Jahr kann kommen.</B><P>

Dr. Reflectus:<BR>
Da ist er wieder: der alte Onkel Nandi. Klare Worte ohne Kompromisse. Wir lassen das mal
so stehen, denn wir haben auch keine Lust ewig die Bugs von <B>REF</B> zu besprechen.<P>
                  
<B>&Uuml;brigens, wer mal in cinema reinschauen m&ouml;chte, cinema 2 ist auf der neuen
CD AMIGA_PLUS No.1/98 .Allerdings ist die Version auf der Scheibe nicht mit
der neuen Version 4 zu vergleichen.<P>

Hallo,Akira.<P>
Danke f&uuml;r die Blumen.
Die Bilder mit 1.6 sind doch einwandfrei.
Du hast ja so recht.Ohne Tobias und sein Workshop mit dem Wing-Fighter
w&auml;re Reflection damals mit Sicherheit von der Bildfl&auml;che verschwunden.
Dieser Workshop hat auch mich zum raytracen  gebracht.<P>

Wir sollten f&uuml;r Tobias eine Gedenkminute einlegen .<P></B>

Dr. Reflectus:<BR>
Ja, das Tobias Reflections den R&uuml;cken gekehrt hat, hat uns
ja alle wohl ein bi&szlig;chen getroffen. Aber Tobias ist nicht aus der Welt des 
Raytracing wegzudenken. Man betrachte sich nur den neuen Sience Fiction Roman
<B>Hagar Qim</B>, erschienen im Heel Verlag. Das ist ein Roman mit Video-Sequenzen
zum Buch. F&uuml;r den Raytracing-Fan ein absolutes Mu&szlig;. Tobias hat sich da
wieder einmal irre Raumschiffe ausgedacht.<P>

So, soviel zu CPN. Danke an Claus-Peter f&uuml;r die Leserbriefe. Hier seine Anschrift:<P>

<PRE><B><P>
        Claus Peter Nandelsteadt
        Grunbacherstr. 3

        70736 Fellbach
        Tel.: 0711-512323
</B></PRE><P> 

<HR><P>

<A NAME="OliverBock"></A>
Jetzt ist die Zuschrift von <B>Oliver Bock</B> aus Goslar an der Reihe:<P>

<B>Hallo Uwe,<P>

nach fast 1-j&auml;hriger Pause schicke ich euch mal wieder ein paar Bilder. 
Die meisten Bilder sind mit VistaPro (Landschaften) erstellt worden. 
Es ist ganz witzig seine eigenen Landschaften zu gestalten. Einige 
Neuerung sind bei mir eingetreten. Erst einmal habe ich nun endlich 
mein Studium abgeschlossen. Das hei&szlig;t, da&szlig; ich, bis auf die Kleinigkeit 
der Arbeitssuche (ist heutzutage ganz easy!), mehr Zeit habe um ein paar 
Bilder zu erstellen. Und zum zweiten, seht ihr die ersten Bilder (J&auml;ger 
und Echsendorf) die ich mit Lightwave 4.0 erstellt habe. Dabei ist 
die <A HREF="../BILDER/JAEGER.JPG"><IMG WIDTH=128 HEIGHT=102 SRC="../BILDER/JAEGER.GIF" ALT="[BILD]"></A>J&auml;ger-Staffel</A>
nicht von mir, sondern war als Objektbeigabe dabei. Hier habe ich nur den
Hintergrund gestaltet. Das Bild <A HREF="OBOCK.HTM">Echsendorf</A> hingegen ist 
vollst&auml;ndig von mir konstruiert worden. Ich hoffe es gef&auml;llt euch. Ich 
werden mir aber trotzdem demn&auml;chst Reflections 4.1 zulegen. Falls Interesse 
besteht kann ich euch mal etwas &uuml;ber das Programm schreiben.</B><P>

Dr. Reflectus:<BR>
Her mit den Infos, wir schauen ja auch &uuml;ber den Tellerrand. LightWave ist ja ein super
Programm, die Lichtquellen wird uns Carsten wohl nie so hinbekommen (lechz). Das Bild gef&auml;llt
uns &uuml;brigens gut.<P>

<B>Ich habe gestern im Videotext von SAT1 gelesen das Gateway "neue" 
AMIGA-Modelle herausbringen will. Als alter AMIGA-Fan (irgendwie 
trauere ich der alten Kiste immer noch nach) war ich gleich Feuer 
und Flamme. Als ich am Ende der Seite gelesen hatte was alles im 
A5000 enthalten sein solle, kamen mal wieder mir die Tr&auml;nen. Ein 
68030-Prozessor, 1,6 GB Festplatte, 24x CD-ROM Laufwerk und ansonsten 
nichts neues. Da stellt sich mir doch die Frage, ob es nicht endlich 
mal eine Firma gibt, die N&auml;gel mit K&ouml;pfen macht. Ein 68030 - Prozessor 
ist doch nun warhaftig ein alte Hut. Warum nicht gleich einen A5000 
mit mindestens einem 68060- Prozessor und den angek&uuml;ndigten A6000 
mit PowerPC- Prozessor mit einer entsprechenden Taktzahl. Man, Man, 
Man, der AMIGA war das Beste was der Computermarkt &uuml;ber Jahre hinweg 
zu bieten hatte. W&auml;hrend sich Apple, AMD und leider auch (immer noch) 
Intel sich gegenseitig mit neueren und immer h&ouml;her getakteten 
Prozessoren &uuml;berbieten, kommt der brandhei&szlig;e A5000 mit einem 5 - Jahre 
alten 68030iger daher. Sicher ist nicht alles Gold, vor allem bei 
Intel, was gl&auml;nzt (MMX, TX-Chipsatz, Pentium II), aber ob man bei 
Gateway wirklich glaubt selbst AMIGA-Fans damit zu bet&ouml;ren m&ouml;chte 
ich an dieser Stelle stark bezweifeln. Einziger Trost k&ouml;nnte der 
Preis werden, denn der stand noch nicht (zum Gl&uuml;ck?) fest. 
Zum Schlu&szlig; habe ich noch eine Frage: Gibt es das AMIGA-Magazin noch ? 
Hin und wieder verfolge ich den AMIGA-Markt. Ich kann aber schon seit 
ca. 2 Monaten in ganz Goslar kein AMIGA-Magazin mehr auftreiben.</B><P>

Dr. Reflectus:<BR>
Klar gibt es das Amiga Magazin noch, aber nur noch an Bahnh&ouml;fen, fragt uns
bitte nicht warum? Der A5000 wird nicht von Amiga oder Gareway 2000 gebaut,
sondern von DCE in Oberhausen. Er soll als Einsteigerger&auml;t
lauf. Es wird aber auch ein A6000 kommen mit 040'er und 060'er Prozessor,
laut Presse Mitteilungen ist DCE sogar in Verhandlung mit Phase 5. Das hei&szlig;t
es wird ein Power PC direkt auf dem Hauptboard geben. Wenn das kein Schritt
in die richtige Richtung ist ? Ach ja, der Preis f&uuml;r den A5000 soll bei
1500,- DM liegen.<P>

Kleiner Nachtrag zum Amiga Magazin: Inzwischen gibt es das Magazin nur noch als Beilage
im PCGo-Magazin (hehe). Nur Leute mit Abo bekommen das Magazin zugeschickt. Laut Ger&uuml;chten
sind aber an die 98% der Abos inzwischen gek&uuml;ndigt worden.<P>

Danke an Oliver f&uuml;r den Leserbrief. Hier seine Anschrift:<P>

<PRE><B>
	Oliver Bock
	Kneippstra&szlig;e 10

	38642 Goslar
	Tel.: 05321-85929
</PRE></B>

<HR><P>
<A Name="TorstenLudwig"></A>
Als n&auml;chstes ist <B>Thorsten Ludwig</B> aus Neustadt an der Reihe an der Reihe. Torsten
ist so etwas wie die Disketten-Fee des <B>REFLECTIONS-Clubs</B>. Laufend bekommen wir
von ihm solche zugesandt. An dieser Stelle eine m&auml;chtige Bedankung an uns Thorsten. Nun
aber los mit dem Leserbrief:<P>

<B>Hi Reflector-Leute !<P>

Zun&auml;chst mal ein dickes Lob an Euch f&uuml;r die letzte(n) Reflector-Ausgabe(n). 
Da ich mich schonmal an meiner eigenen Homepage versucht habe (das Projekt 
wurde wegen Zeitmangels f&uuml;r gestorben erkl&auml;rt), wei&szlig; ich, wieviel Arbeit 
in dem HTML-Gelumpe steckt, bis die Texte und Bilder dort sitzen, wo sie 
hinsollen. Allerdings hatte ich mit dem I-View, das ich mal von Euch 
gekriegt habe, so meine Probleme. Ich bekam z.Bsp. regelm&auml;&szlig;ig beim 
Anschauen der Objekt-Bibliothek oder der Galerie einen Hals, weil ich 
den "Zur&uuml;ck"-Button nicht mehr erreichen konnte. Ich mu&szlig;te dann jedesmal 
die Hauptseite neu laden. Seit ich Netscape installiert habe, klappts aber 
hervorragend.</B><P>

Dr. Reflectus:<BR>
Ein Gl&uuml;ck, da&szlig; es nun klappt. So einen Fehler erstmal zu finden ist fast schon Gl&uuml;cksache.
Gut da&szlig; der Internet Explorer ja nun zum Betriebssystem von Windows geh&ouml;rt (oder wie
war das ?). Egal, Hauptsache es funktioklappt nun.<P>

<B>Den <A HREF="../BILDER/HALO.JPG"><IMG WIDTH=128 HEIGHT=102 SRC="../BILDER/HALO.GIF" ALT="[BILD]"></A>Halogen-Strahler</A>
f&uuml;r unter die Decke zu h&auml;ngen (&ouml;rks, was f&uuml;rn Deutsch!), den ich Euch
geschickt habe, habe ich auch auf die Mailbox von Oberland kopiert, um ihn jedem zur
Verf&uuml;gung zu stellen. Ist zwar nix besonderes, aber es war zu diesem Zeitpunkt
das einzige "Free"-Objekt auf der Box. Auch auf der Homepage ist zur Zeit leider nur
mein Strahler zu finden.<P>

Was ist los, Leute ?  Seid Ihr zu geizig, Eure sch&ouml;pferischen Erg&uuml;sse den 
anderen zur Verf&uuml;gung zu stellen ???  Sicher, der ein oder andere wird ein
paar Mark dazuverdienen, indem er Objekte, Bilder oder Anims entwirft und 
verkauft, aber das kann doch nicht der gro&szlig;e Teil der REF-User sein. Ich 
w&uuml;rde mir w&uuml;nschen, da&szlig; ein erstelltes Objekt dort landet, damit alle was 
davon haben. Wenn Ihr der Meinung seid, das Objekt ist es nicht wert, 
ver&ouml;ffentlicht zu werden - Quatsch. Auch ich habe mich voller Scham dazu 
durchringen m&uuml;ssen, das Teil abzuschicken, weil ich dachte, das ist zu 
l&auml;ppsch (pf&auml;lzisch: einfach,simpel). Ich habe allerdings schon ein paar 
Reaktionen darauf erhalten, Anfragen, wie dies oder das gemacht wurde. 
Dazu ist doch "unser" Club da, damit die User untereinander helfen k&ouml;nnen, 
oder etwa nicht ??
Ich bin &uuml;berzeugt, da&szlig; auch Oberland sich &uuml;ber eine regere Teilnahme am 
Objekt-Austausch freuen w&uuml;rde.</B><P>

Dr. Reflectus:<BR>
Genau Leute, Torsten spricht uns aus der Seele. Also her mit Euren "Free" - Erg&uuml;ssen. Es
kann Euch nur Lob zuteil werden.<P>

<B>So, genug gemeckert. Ich habe da noch nen kleinen Tip: zur Zeit ist es ja 
recht m&uuml;hsam, einen Zeischensatz f&uuml;r REF zu erstellen (ich hab keine Ahnung, 
wie das geht). ich helfe mir da mit einem kleinen Tool (leider nur f&uuml;r PC/Win).
Das Teil hei&szlig;t "TrueType Converter" und stammt von Markus Rahlff 
(Westerhamerweg 12, 82024 Taufkirchen), dem Autor des "Konkurrenzprogramms" 
HIGHLIGHT PRO. Mit diesem Programm kann man die installierten TTF-Zeichens&auml;tze 
in DXF-Objekte konvertieren. Nach Auswahl des Fonts, kann man unter 
"Konvertieren" entweder die zu konvertierenden Zeichen ausw&auml;hlen, oder einen 
Text eingeben, der dann konvertiert wird. Das fertige DXF-Objekt kann dann in 
REF geladen werden und entweder komplett verwurstelt werden, oder &uuml;ber 
K&ouml;rperdefinitionen in einzelne Buchstaben zerlegt werden.
Beim Konvertieren kann eine beliebige Phase an die Buchstaben geschnitten 
werden (--> schr&auml;ge , bzw. runde Kanten). Ich habe diesem Text ein paar Bilder 
"beigelegt", die zum einen das "Konvertier"-Fenster und zum anderen ein paar 
Ergebnisse zeigen. Den Preis wei&szlig; ich leider nicht mehr (bewegt sich weit 
unter 100 DMs), aber ich bin sicher, Hr. Rahlff gibt gerne Auskunft.</B><P>

Dr. Reflectus:<BR>
Wer wei&szlig;, vielleicht steht ja bald ein neues PlugIn bereit, mit dem man ebenfalls
TrueType-Fonts in <B>REF</B>-3DFonts wandeln kann. Zumindest sollte so etwas
ja wohl m&ouml;glich sein.<P>

<B>So, ansonsten hoffe ich, in Zukunft mehr Zeit zum Rendern zu haben, unser 
Umbau ist abgeschlossen und der Umzug vollzogen (--> neue Adresse : 
Theodor-Heuss-Stra&szlig;e 3, alles andere bleibt).<P>

Zum Thema Reflector im Internet: es ist nicht einzusehen, da&szlig; man auf dem 
Internet alles runterladen, bzw. lesen kann, wof&uuml;r man als Club-Mitglied 
bezahlt. Vielleicht kann man eine Art versteckte URL einrichten, auf die 
nur Mitglieder Zugriff haben.<P>

PS: K&ouml;nntet Ihr Euch nicht ne EMail-Adresse "zulegen" ? Es ist wesentlich 
einfacher, Euch ab und zu mal ein Bild/Text/Objekt per Mail zu schicken, 
als per Diskette ;-)  (Hat sich jetzt erledigt :-)))  )</B><P>

Dr. Reflectus:<BR>
Jo, das mit dem Internet ist in der Tat f&uuml;r unsere Mitglieder keine gl&uuml;ckliche
L&ouml;sung gewesen. Aus diesem Grunde gibt's dort inzwischen nur noch eine Light-Version
(hehe). Die EMail-Adresse ist im <A HREF="EDITORIA.HTM">Editorial</A> zu finden.<P>

Wir bedanken uns bei Thorsten und geben nat&uuml;rlich auch seine Adresse preis:<P>

<PRE><B>
	Thorsten Ludwig
	Theodor-Heuss-Stra&szlig;e 3

	67435 Neustadt
	Tel.: 06327/960980
	EMail: <A HREF=mailto:Thorsten.Ludwig@gecits-eu.com>Thorsten.Ludwig@gecits-eu.com</A>
</PRE></B><P>

<HR><P>

Damit w&auml;ren wir am Ende der Leserbriefe angelangt. Nat&uuml;rlich harren wir
der weiteren Post, die da auf uns zukommen wird. Also ran an die Tasten
und her mit Euren Statements.<P>

<B><I>Euer REFLECTOR-Team!</I></B><P>

<HR SIZE=5>
<B>
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
</B>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
