<HTML>
<HEAD>
<TITLE>REFLECTOR 038</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.GIF">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
Vorstellung Club REFTools</H1></CENTER>
<HR SIZE=5><P>

<FONT SIZE=4><B>Scripts, Tools und Plug-Ins</B></FONT><P>

Der Club <B>REFTools</B> befa&szlig;t sich mit dem Programmieren von Scripts, Tools
sowie PlugIns f&uuml;r uns <B>REFLECTIONS</B>. So stammten die Scripts auf der letzten
Ausgabe von Mitgliedern des <B>REFTools-Clubs</B>.<P>

Wir hatten &uuml;brigens vergessen einen entsprechenden Hinweis zu ver&ouml;ffentlichen
(Teufel auch sorry!). Aus diesem Grund: Wir m&ouml;chten hiermit darauf hinweisen,
da&szlig; diese Scripts nicht ohne Genehmigung des jeweiligen Autors weitergegeben werden
d&uuml;rfen. Bei weiteren Fragen zu den Scripts wendet Euch bitte an die EMail-Adresse
<A HREF="mailto:Dirk.Kamp@metronet.de">Dirk.Kamp@metronet.de</A> oder an
<A HREF="mailto:Dirk.Kamp@cww.de">Dirk.Kamp@cww.de</A>. Alternativ k&ouml;nnt Ihr auch
an die weiter unten genannte Adresse von Dirk Kamp schreiben.<P>

Der Koordinator des <B>REFTools-Clubs</B>, Dirk Kamp, hat uns einige Info's zukommen
lassen. Klar, da&szlig; wir Euch diese nicht vorenthalten wollen:<P>

<B>Hall&ouml;chen Reflector Mitglieder,<P>

einige von Euch, vorwiegend diejenigen die auch im Internet sind, haben von
uns und unserer Arbeit schon was geh&ouml;rt. Vor etwa 5 Monaten haben sich
einige Programmierer zusammengetan um die, jetzt endlich vorhandene, Plugin-
Schnittstelle von Reflections 4.1 mit Leben zu f&uuml;llen.<P>

Was anf&auml;nglich mit 2 Programmierern begann, erweiterte sich im laufe
der letzten 5 Monate zu einem Team von 12 Mann. Dabei sind nicht nur C/C++
oder Delphi Programmierer, sondern auch etliche, die sich nur mit der
Scriptsprache besch&auml;ftigen. Einige Scripts davon sind ja schon bei etlichen
bekannt.<P>

Nat&uuml;rlich soll unsere Arbeit - Plugins und externe Tools - nicht nur
auf dem PC beschr&auml;nkt sein. Doch haben wir da ein Problem. So wie es
scheint, gibt es mehr PC- als Amigaprogrammierer. Unser momentanes
Verh&auml;ltnis zwischen PC und Amiga ist 10:2 . Was nat&uuml;rlich dazu
f&uuml;hrt, das wir mehr f&uuml;r den PC Programmieren k&ouml;nnen als f&uuml;r
den Amiga.<P>

Sollte es vielleicht unter Euch noch ein paar Programmierer geben, die gerne
bei uns mitmachen wollen, w&auml;re ich sehr erfreut von Euch zu h&ouml;ren.
Wir alle sind Reflections-User und sollten somit auch versuchen, das beste
aus dem Programm und den uns zur Verf&uuml;gung stehenden M&ouml;glichkeiten
zu machen.<P>

Alles was wir programmieren, soll allen Reflections-Usern frei zur
Verf&uuml;gung stehen. Die meisten, die Reflections benutzen, sind Hobbyanwender
und somit auch nicht in der Lage, f&uuml;r ein paar kleine Tools oder Plugins
nochmals ein paar Hundert Mark zu bezahlen.<P>

Etliche Scripts stehen ja auf unserer Homepage schon zur Verf&uuml;gung .
Ein erstes Mathe-Texturplugin auch und weitere werden folgen.<P>

Einen ersten Prototypen des Landscape-Generators f&uuml;r den Amiga ist dort
auch schon vorhanden. An der Konvertierung f&uuml;r den PC wird gerade
gearbeitet.<P>

Etliche andere Projekte sind in Arbeit, wie z.B.:
<P>
Weitere Mathe-Texturen, einen Scripteditor ( Syntax- und Parameterchecking,
Vorinterpretation und Makros),Plugin f&uuml;r eine schnelle Rundumansicht
eines Objektes und noch so einige andere Sachen.<P>

Da jetzt endlich auch die Spezifikationen f&uuml;r die Reflections Schnittstelle
fertig ist, k&ouml;nnen wir unsere Arbeitswut nun auch daran auslassen. Bisher
war ja nur die Beams Schnittstelle bekannt. So das wir uns bis jetzt nur
mit dem Problem der Mathe-Texturen herumstreiten konnten.<P>

Aber auch die Anwender von Reflections k&ouml;nnen etwas dazu beitragen,
das dieses Programm noch besser wird.
<P>
Wie hei&szlig;t es doch so sch&ouml;n in der Ikea Werbung :<P>

" Ideen entstehen aus Bed&uuml;rfnissen !"<P>

Und welche Ideen und/oder Bed&uuml;rfnisse habt ihr als Reflector Leser,
was Reflections betrifft ?<P>

Neue Ideen k&ouml;nnen wir immer gebrauchen. Wenn ihr also welche habt, was
man an Reflections noch verbessern oder erweitern k&ouml;nnte, ist unser
Ohr genau das richtige, wo ihr sowas los werden k&ouml;nnt.<P>

Und jetzt w&uuml;nschen wir vom REFTools! Team noch viel Spa&szlig; beim
lesen des Reflector&#180;s.<P>

Wir werden den Reflector und seine Mitglieder auf dem Laufenden halten !<P></B>

Jo, Ihr m&uuml;&szlig;t zugegen, da&szlig; sich das alles sehr schmakofatz anh&ouml;rt. Also, falls Ihr
Ideen, Vorschl&auml;ge, W&uuml;nsche oder sonstwas Programmiertechnisches auf dem Herzen habt,
dann immer ran an die Tasten. In der Zwischenzeit haben Uwe und ich (Olaf) Dirk
auch pers&ouml;nlich kennengelernt. Neben einem verst&auml;rkten Erfahrungsaustausch und
Zusammenarbeit haben wir auch die Aufnahme einer <B>REFTools</B>-Seite im Rahmen
des <B>REFLECTOR-Magazins</B> vereinbart. Ab der n&auml;chsten Ausgabe geht's dann zur
Sache und wir pr&auml;sentieren die ersten PlugIns f&uuml;r uns <B>REFLECTIONS</B>.<P>

Hier die Anschrift von Dirk Kamps:<P>

<IMG WIDTH=100 HEIGHT=149 SRC="../PIX/REFTOOLS.GIF" ALT="[REFTools-Logo]">
<FONT SIZE=6><B>REFTools-Club</B></FONT><P>

<PRE><B>
        Dirk Kamp
        Viehoferplatz 15

        45127 Essen
        Tel.: 0201 / 236582
        EMail: <A HREF="mailto:dirkkamp@metronet.de">Dirk.Kamp@metronet.de</A> 
        Internet: <A HREF="http://www.duisburg.netsurf.de/~michael.krafzik/ref/reflections.html">REFTools-Club</A>
</PRE></B><P>

<B><I>Euer REFLECTOR-Team!</I></B><P>
     
<HR>
<B>
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
</B>
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
