<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Das AMIGA-aktuell-Gewinnspiel
-----------------------------

1. Ergebnisse des letzten Gewinnspiels

Im letzten Monat haben leider nur 40 Leser am Gewinnspiel teilgenommen. Ich 
hoffe, dass dies lediglich ein vor&uuml;bergehender R&uuml;ckgang war. Denkt dran: 
Selbst, wenn ihr die Antwort zur Masterfrage nicht wisst, nehmt ihr an der 
Verlosung teil, wenn ihr die beiden anderen Fragen beantwortet.


Jetzt aber zur Aufl&ouml;sung:


Standard-Frage: Welches ist die aktuelle Version des AmigaOS?

Antwort: Es handelt sich, wie nat&uuml;rlich jeder wusste, um die Version 3.5.


Master-Frage: In welchem wichtigen Merkmal stimmt die aktuelle Version des  
              AmigaOS mit der Version 2.1 &uuml;berein, nicht jedoch mit allen   
              anderen Versionen des Betriebssystems seit v2.0?

Antwort: Dies scheint f&uuml;r viele von euch eine harte Nuss gewesen zu sein:   
         Bei den Versionen 2.1 und 3.5 handelt es sich um reine             
         Softwareupdates, die kein neues Kickstart-ROM ben&ouml;tigen.  


Meinungsfrage: Hast du vor, auf die aktuelle Version des AmigaOS            
               umzusteigen?

Die Auswertung:

Antwort                                                Anzahl der Nennungen
---------------------------------------------------------------------------
1 (Ich verwende sie bereits.)                                            22
2 (Ja, auf jeden Fall.)                                                   9
3 (Ja, wahrscheinlich.)                                                   6
4 (Nein, wahrscheinlich nicht.)                                           2
5 (Nein, auf keinen Fall.)                                                1


Einige Einsender haben zu ihrer Beantwortung der Meinungsfrage Stellung 
genommen:


Sascha van Wahnem schreibt:

»Also ich benutze es bereits, warum? 
a) OS3.5 ist das aktuellste Betriebssystem, und dies sollte man eigentlich
auch nutzen.
b) Es hat Amiga, und vor allem den Usern, soviel Arbeit gemacht ein neues 
OS zu bekommen, und jeder der geschrien hat 'neues OS her!', zu denen ich 
auch z&auml;hle, sollte es dann auch kaufen, was bringt es, wenn etwas gefordert 
wird, was keiner, dann wenn es da ist, kauft.
Au&szlig;erem mu&szlig; ich sagen, finde ich das OS3.5 einfach super, der einzige
Haken: Es kommt nicht mit ARQ klar.« 


Jean Holzammer meint:

»Ich werd mir im Fr&uuml;hjahr einen neuen Amiga zulegen 
(Boxer/Amirage/wasauchimmer), somit erhalte ich dann OS 3.5 sowieso; wegen
ein paar Monaten werd ich nicht 170,- DM ausgeben (fahr noch 3.0)).

Au&szlig;erdem bringt mir 3.5 nicht viel, da ich bereits Turboprint7, MagellanII, 
IBrowse, Miami, die GlowIcons aus dem Aminet, installiert hab, ebenso die 
aktualisierte Version des FastFileSystem und von SetPatch, die unter 
amiga.de zu finden sind. Dazu nat&uuml;rlich aktuelle Datatypes aus dem Aminet.«


Thomas Beck besitzt das AmigaOS 3.5 bereits, war aber anfangs vorsichtig:

»Erstmal nur auf neuer Platte installiert - sicher ist sicher ;-) Ich hab 
zuviel schlechte Nachrichten in csam und de.csam gelesen, so da&szlig; ich das 
auf keinen Fall ungetestet &uuml;ber mein stabil funktionierendes und &uuml;ber Jahre 
gewachsenes OS3.1-System dr&uuml;berb&uuml;gle.«


Auch Gunnar Edel &auml;u&szlig;ert sich zum AmigaOS 3.5:

»Damit haben sich die Amiga-Macher aber verdammt viel Zeit gelassen.
Das h&auml;tte man eher erledigen k&ouml;nnen. Das meiste gibt's eh alles schon als
Patch im Aminet. Nur die neue HD-Toolbox mit HD-Unterst&uuml;tzung &gt;4 GB ist 
wirklich dringenst n&ouml;tig gewesen. Und da&szlig; nur Demo/SE-Versionen der
Internet-Software dabei sind, ist auch nicht das Wahre. Es wurde viel
versprochen: Vollversion eines TCP/IP-Stacks, eine Browser-Vollversion 
(keine SE!), ein revolution&auml;res Druckertreibersystem (ja, wo ist es denn? 
Mit Druckertreibern sieht's immer noch m&uuml;de aus auf dem Amiga!), aber es 
ist nicht allzuviel bei rausgekommen.

War wohl eher ein Symbol des guten Willens...«


Fazit:
------

Das Ergebnis ist eindeutig: Die meisten Teilnehmer besitzen das AmigaOS 3.5 
bereits, von den &uuml;brigen will es sich die Mehrheit noch zulegen. Wenn die 
&uuml;brigen Amiga-Anwender diesem Beispiel folgen, sollte der zur Entwicklung 
weiterer Updates des Amiga-Betriebssystems ben&ouml;tigte Verkaufserfolg 
erreichbar sein.


Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:


1 x Schnittstellenkarte "Hypercom 3+": Marco Miljak
1 x Grafiksoftware "SView Productivity Suite": Dirk Neubauer
1 x Grafiksoftware "SView Productivity Suite": Christoph Bubel
1 x Grafiksoftware "SView Productivity Suite": Thomas Bodlien
1 x Vollversion von "AFiloFaxPro": David Scheibler
1 x Vollversion von "Diamond Caves II": Michael Titze


Herzlichen Gl&uuml;ckwunsch!

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
