<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Workshops / Hintergrundberichte / Buchvorstellungen
---------------------------------------------------

1. Workshop: Installation von Debian2.1-Linux - Teil 3 (von Uwe Pannecke)

»Willkommen bei den Pinguinen

Linux-Installation am Beispiel der Debian 2.1 m68k-Distribution

Teil 3 "Ein (fast) komplettes Linux-System"


1. Vorbetrachtung

Am Ende des zweiten Teils unseres Linux-Workshops hatten wir ein Basis-
System mit funktionsf&auml;higem X-Window-System installiert.
Dieses Basis-System ist ja recht nett, und es macht auch Spa&szlig;, ein neues
Betriebssystem kennenzulernen, aber noch fehlen die eigentlichen Programme,
um Linux auch f&uuml;r die t&auml;glichen Arbeit einsetzen zu k&ouml;nnen. 
Zwar existiert im Internet und auf den verschiedensten CD-ROMs eine schier
un&uuml;berschaubare Vielfalt an Linux-Programmen, aber mit unserem Minimal-
System bleibt uns ein Gro&szlig;teil dieser Programme unerreichbar, da zum einen
viele Programme auf bestimmte Bibliotheken aufbauen, die in unserem System
noch nicht vorhanden sind und zum anderen nur als Source-Code vorliegen und
vor dem eigentlichen Gebrauch erst kompiliert werden m&uuml;ssen.
Nun kann man nat&uuml;rlich sagen: Ich will kein Programmierer werden, weshalb
soll ich also meine Programme vor dem Einsatz erst einmal mit den ent-
sprechenden Programmierwerkzeugen in eine lauff&auml;hige Version verwandeln?
Wenn man aber bedenkt, da&szlig; Linux unter verschiedensten Betriebssystemen auf
unterschiedlichsten Prozessoren installiert ist, macht die Verbreitung der
Programme als Source-Code sehr wohl Sinn, denn so kann man diese Software
(in fast allen F&auml;llen) auf s&auml;mtlichen Hardware-Plattformen nach der 
Kompilierung einsetzen.
Und um ein Linux-Source zu kompilieren, sind im allgemeinen keine 
detaillierten Programmierkenntnisse erforderlich. An einigen Beispielen 
werde ich Euch dies weiter unten demonstrieren.
Zurück zu unserem Debian-System. Um die genannte Programmvielfalt (ob nun
als Bin&auml;r- oder Source-Code) nutzen zu k&ouml;nnen, mu&szlig; unser System noch 
deutlich ausgebaut werden. Zwar ist auch dies von Hand St&uuml;ck f&uuml;r St&uuml;ck 
m&ouml;glich, aber da es ein sehr beschwerlicher und fehlertr&auml;chtiger Weg w&auml;re, 
wollen wir diesmal auf das jeder Debian-Distribution beiliegende 
Installation-Programm "dselect" zur&uuml;ckgreifen. Auch wenn die Bedienung zum 
Teil eigenartig erscheint, ist "dselect" doch eine recht m&auml;chtige 
Installationshilfe.


2. Neuinstallation

Im folgenden soll unser Linux-System so ausgebaut werden, da&szlig; auch im 
Source-Code vorliegende Programmpakete kompiliert und installiert und 
werden k&ouml;nnen.
Aus diesem Grund ist es sinnvoll, Linux nochmals neu zu installieren, da
gegen Ende der Installations-Prozedur die Auswahl eines Profils f&uuml;r den
zuk&uuml;nftigen Einsatz angeboten wird. Und dieses Pofil sorgt dann im 
Zusammenspiel mit "dselect" f&uuml;r eine dem gew&uuml;nschten Einsatzzweck komplette 
Ber&uuml;cksichtigung aller notwendigen Bibliotheken, Editoren, Kompiler, ...
Auch wenn Euch jetzt die Haare zu Berge stehen sollten, da Ihr Euer m&uuml;hsam
installiertes System nun wieder ins Daten-Nirvana schicken sollt,- es wird
sich lohnen! Zum einen vertieft Ihr Eure Linux-Installations-Kenntnisse :-
))
und zum anderen war unser bisher doch recht rudiment&auml;res Linux ja auch nur
zum ersten Hineinschnuppern gedacht. Habt Ihr in der Zwischenzeit 
pers&ouml;nliche Daten (Texte, Programmeinstellungen usw.) erstellt, so solltet 
Ihr diese vor der Neuinstallation sichern.
Auf geht es:
Wie in den ersten beiden Teilen beschrieben, werden die "swap" und "root"-
Partition(en) formatiert und das Basis-System aufgespielt. Nach dem 
notwendigen Reboot des Systems und der Eingabe des Passworts sowie der 
Einrichtung eines Gast-Users kommt die Frage "Do you want to use a PPP 
connection to install the system?", die Ihr mit "N" beantwortet, um dann 
sofort im n&auml;chsten Schritt mit einem Angebot zur Auswahl verschiedener 
Pakete (one of several selections of packages) konfrontiert zu werden. Auf 
die Anfrage "Do you want to perform this step?" solltet Ihr mit "Y" 
antworten.
Im nun folgenden Bildschirm fordert man Euch mit "Please select a Profile"
auf, ein Euren Bed&uuml;rfnissen entsprechenden Einsatz-Profil auszuw&auml;hlen.
Zur Auswahl stehen

Einsatz-Profil   notwendiger Speicherplatz auf der Festplatte
-------------------------------------------------------------
Custom           (ohne, da abh&auml;ngig von der Auswahl durch den Nutzer)
Admin            330 MB
Basic             26 MB
Devel_comp       405 MB
Devel_std        343 MB
Dialup           431 MB
Server_Comp       57 MB
Server_std        48 MB
Work_sci         471 MB
Work_std         401 MB
 
Es hat sich nach Test verschiedener Varianten herausgestellt, da&szlig; f&uuml;r
den skizzierten Einsatzzweck (Nutzung von Bin&auml;rprogrammen UND Sourcen-
Kompilierung) die Variante Devel_std (frei &uuml;bersetzt Programmier-System in
Standardausf&uuml;hrung) am besten geeignet ist. Ihr ben&ouml;tigt f&uuml;r diese 
Installation jedoch ca. 350 MB an freiem Festplattenplatz.
Selbstverst&auml;ndlich werden neben den Programmierwerkzeugen und Bibliotheken
auch ein komplettes X-Window-System einschlie&szlig;lich diverser Programmen wie
z.B. TeX, Ghostscript, The Gimp, Texteditoren, Filemanager und vieles mehr
installiert. Ein weiteres Beispiel ist der im nachfolgenden Screenshot zu
sehende komfortable PostScript-Viewer "gv".

Screenshot:
<IMG SRC="../extra/Debian-gv.png" ALT="Screenshot">


3. Dselect

Habt Ihr "Devel_std" ausgew&auml;hlt, speichert das Installationsprogramm dieses
Einsatz-Profil und ruft "dselect" auf. Die Programmoberfl&auml;che kennt Ihr ja
schon aus dem zweiten Workshop-Teil. Bevor Ihr nun mit "dselect" an die
weitere Installation geht, k&ouml;nnte es notwendig sein, das CD-ROM-Laufwerk
einzubinden, um die gew&uuml;nschten Pakete von dort einspielen zu k&ouml;nnen.  
F&uuml;r diesen Zweck &ouml;ffnet Ihr eine zweite Konsole mit "ALT + F2" und loggt
Euch als "root" ein. Mit "vi /etc/fstab" kann nun durch z.B.
"/dev/scd0  /cdrom  iso9660  defaults  0  1" das CD-ROM-Laufwerk 
eingetragen werden. Nachdem Ihr die modifizierte "fstab" abgespeichert 
habt, solltet Ihr mit "mount /cdrom" selbiges anmelden.
Dann kehrt Ihr mit "ALT + F1" auf die erste Konsole und damit in den
"dselect"-Bildschirm zur&uuml;ck und w&auml;hlt den Programmpunkt "Access" und dort 
den Unterpunkt "multi_cd". Daraufhin sollte das CD-ROM-Laufwerk 
angesprochen und die Debian-Hierarchie eingescannt werden.
Nachdem "dselect" damit fertig ist, springt es automatisch im 
Ausgangsbildschirm auf "Update". W&auml;hlt diesen Punkt aus und "dselect" wird 
nun die "Packages" bzw. "Packages.gz"-Files mit den Informationen &uuml;ber die 
verf&uuml;gbaren Programmpakete von der CD-ROM lesen. Nachdem dies geschehen 
ist, k&ouml;nnt Ihr im "dselect"-Bildschirm den Punkt "Select" &uuml;berspringen, da 
Ihr ja bereits im Vorfeld das gew&uuml;nschte Einsatz-Profil (Devel_std) 
festgelegt habt.
(Selbstverst&auml;ndlich l&auml;&szlig;t sich &uuml;ber "Select" das Einsatz-Profil weiter 
verfeinern, indem Programme abgw&auml;hlt oder zus&auml;tzliche hinzugef&uuml;gt werden.)
Sorgt nun durch die Anwahl von "Install" f&uuml;r die Installation der 
Programmpakete. Nachdem "dselect" dpkg aufgerufen hat, habt Ihr Zeit f&uuml;r 
mehrere Tassen Kaffee... Dennoch werdet Ihr in der sich der Installation 
anschlie&szlig;enden Konfiguration der einzelnen Pakete gebraucht. Die zu 
treffenden Entscheidungen werden durch aussagekr&auml;ftige Programmmeldungen 
kommentiert, so da&szlig; ich hier auf Einzelheiten verzichte.


4.  Installationsabschlu&szlig;

Ist die Konfiguration aller Pakete erledigt, sollte nun noch durch 
"cp /usr/doc/xserver-common/examples/XF86Config.eg /etc/X11/XF86Config" und 
"ln -s /dev/amigamouse /dev/mouse" X11 startklar gemacht werden (siehe Teil 
2 des Debian-Workshops). Ein "startx" bringt das neu installierte X Window
System zum Vorschein.


5. TeX mit LyX

Als Grundbestandteil jeder Linux-Distribution ist auch in unserem Fall TeX
mit von der Partie. Dieses au&szlig;erordentlich leistungsf&auml;hige Text-Satzsystem
zeichnet sich aber neben seiner beeindruckenden Funktionsf&uuml;lle durch eine
sehr spr&ouml;de und kryptische Bedienung aus. Zwar werden viele Texteditoren in
der Linux-Welt mit TeX-Syntax-Erweiterungen ausgestattet, aber dennoch mu&szlig;
man sich auch bei diesen Editoren meist immer noch mit der TeX- bzw- LaTeX-
Syntax "herumschlagen".
Dennoch w&auml;re es schade, wenn Ihr aus diesen Gr&uuml;nden einen Bogen um TeX
machen w&uuml;rdet, denn wenn es um perfekten Textsatz und/oder sehr gro&szlig;e 
Textdokumente einschlie&szlig;lich optimal gesetzter mathematischer Formeln und 
eingebundener Bilder geht, l&auml;&szlig;t TeX jede kommerzielle Textverarbeitung, 
egal ob auf dem Amiga oder unter Wintel (Word & Co.) sehr bla&szlig; aussehen. 
Versucht doch einmal, ein mehrere hundert Seiten starkes Dokument mit den 
beschriebenen Erweiterungen mit einer Textverarbeitung zu setzen- f&uuml;r TeX 
ist das kein Problem- selbst auf einem eher schwachbr&uuml;stigen Amiga.
Eine sehr anwenderfreundliche Benutzeroberfl&auml;che f&uuml;r TeX und LaTeX stellt
LyX dar [1]. Nur liegt diese TeX-Oberfl&auml;che keinem Amiga-Un*x-System als
bin&auml;res Programmpaket bei. Wie schade,k&ouml;nnte man meinen. Aber:
Hier kommt nun unsere neu installierte Linux-Entwickler-Umgebung zu ihrem
ersten Einsatz. Denn mit dem installierten System seid Ihr in der Lage, den
Source-Code zu kompilieren und damit LyX unter einem m68k-Linux 
einzusetzen.
Ihr ben&ouml;tigt hierf&uuml;r zum einen den LyX-Source, unter [2] ist beispielsweise
die zur Zeit aktuelle Version 1.0.4 zu finden, sowie die Xforms-Bibliothek,
die in bereits kompilierten Zustand auch f&uuml;r m68k-Prozessoren z.B. unter 
[3] zu finden ist.
Nachdem Ihr die tar.gz.-Pakete aus dem Internet gezogen habt, wechselt Ihr
mit "cd /usr/src" sinnvollerweise ins f&uuml;r die anstehenden Arbeiten bereits
durch die grundlegende Linux-Installation angelegte Source-Verzeichnis. Von
dort werden die Source-Pakete mit "gzip -cd paketname_mit_Pfad | tar xvf -"
entpackt. Im Anschlu&szlig; sollten nach Eingabe von "ls" die Verzeichnisse
"lyx-1.0.4" und "xforms" aufgelistet werden.
Wechselt nun in das "xforms"-Verzeichnis mit "cd xforms" und gebt dort
"make install" ein. Nach kurzer Zeit sind alle notwendigen Bibliotheken
kopiert und Ihr k&ouml;nnt mit "cd .." auf die obere Verzeichnisebene, d.h. nach
"/usr/src" zur&uuml;ckkehren. Nun wechselt Ihr mit "cd lyx-1.0.4" ins "lyx"-
Verzeichnis. Drei Eingaben sind hier zu t&auml;tigen: "./configure" veranla&szlig;t
eine Anpassung der Sourcen an die Gegebenheiten des vorhandenen Linux-
Systems, "make" sorgt im Anschlu&szlig; f&uuml;r die eigentliche Kompilierung und ein
"make install" f&uuml;r die korrekte Installation im vorhandenen Linux-System.
Habt nach Eingabe der gerade genannten Befehle etwas Geduld, sowohl die
Konfiguration als auch die Kompilierung brauchen auf einem Amiga ihre 
Zeit...

Screenshot:
<IMG SRC="../extra/Debian-LyX.png" ALT="Screenshot">

Tja, und ist alles ohne Fehlermeldung &uuml;ber die B&uuml;hne gegangen, k&ouml;nnt Ihr in
einem "xterm"-Fenster durch Eingabe von "lyx" das Programm aufrufen und 
Euch an Eurem ersten "Eigen-Kompilat" erfreuen. &Uuml;brigens kommt LyX mit 
einer umfangreichen, auch in Deutsch vorhandenen Dokumentation und TeX(t)-
Beispielen daher.


6. Office-Paket

Ein weiterer wichtiger Punkt f&uuml;r die Alltagstauglichkeit ist die Verf&uuml;g-
barkeit von Office-Paketen. Zwar existieren eine ganze Reihe solcher Pakete
f&uuml;r Linux,- aber leider bleibt m68k-Linux da meist unber&uuml;cksichtigt, denn
viele dieser Pakete werden als Bin&auml;rdateien nur f&uuml;r x86- oder wie z.B. bei
Applixware, auch f&uuml;r PPC-CPUs vertrieben.
Ein angenehme Ausnahme stellt das Siag-Office dar, welches als Source-Code
frei verf&uuml;gbar und auch auf m68k-Systemen kompilierbar ist. Siag beinhaltet
neben der Textverarbeitung "Pathetic Writer" die Tabellenkalkulation 
"siag", das Animationsprogramm "egon", den Texteditor "xedplus", den 
Filemanager "xfiler" und den PostScript-Viewer "gvu".

Screenshot:
<IMG SRC="../extra/Debian-Office.png" ALT="Screenshot">

Ihr ben&ouml;tigt f&uuml;r dieses Office-Paket die Siag-Sourcen [4] selbst sowie ein
passendes Xaw3d-Archiv wie bspw. [5]. Habt Ihr die Archive auf Eurer Fest-
platte, k&ouml;nnt Ihr sie analog dem Beispiel LyX von "/usr/src" aus mit
"gzip -cd paketname_mit_Pfad | tar xvf -" entpacken. Diesmal finden sich
nach dem Entpacken und Eingabe von "ls" die Verzeichnisse "siag-3.1.22" und
"xc".
Wechselt als erstes ins Verzeichnis "xc/lib/Xaw3d". Da das Siag-Office auf
die Xaw3d-Include-Dateien zur&uuml;ckgreift, m&uuml;sst Ihr nun mit
"mkdir /usr/X11R6/include/X11/Xaw3d" ein notwendiges Verzeichnis im X11-
Verzeichnisbaum anlegen. Als n&auml;chstes kopiert Ihr die ben&ouml;tigten Include-
Files mit "cp *.h /usr/X11R6/include/X11/Xaw3d/" in das soeben erstellte
Verzeichnis.
Nun wechselt Ihr ins "siag-3.1.22" Verzeichnis ("cd /usr/src/siag*") und
leitet hier als erstes die Konfiguration mit "./configure" ein. Hat sich
siag zur&uuml;ckgemeldet, k&ouml;nnt Ihr noch eine kleine Manipulation am Makefile
im "xfiler"-Verzeichnis vornehmen. Dazu &ouml;ffnet Ihr mit "vi xfiler/Makefile"
das File uns setzt in der Zeile "xfiler_SCRIPTS=makeicons als erstes 
Zeichen ein "#". Nach dem Abspeichern des Makefiles kann nun die 
Kompilierung des Office-Paketes duch Eingabe von "make" erfolgen. Ein "make 
install" sorgt im Anschlu&szlig; wiederum f&uuml;r die Installation im vorhandenen 
Linux-System. Und um die einzelnen Office-Bestandteile jederzeit zur hand 
zu haben, k&ouml;nnt Ihr sie f&uuml;r f&uuml;r diesen Zweck in die Konfigurationsdatei des 
genutzten Window-Managers aufnehmen.

Screenshot:
<IMG SRC="../extra/Debian-OfficeFvwm.png" ALT="Screenshot">

Wie Ihr an den beiden Beispielen sehen konntet, ist die Kompilierung von
Sourcen (meist) nicht allzu kompliziert. In vielen F&auml;llen reichen dazu drei
Befehle aus:

./configure
make
make install

Auf jeden Fall solltet Ihr die in jedem Paket mitgelieferten README- bzw.
INSTALL-Dateien lesen, denn in diesen Dateien wird die Prozedur f&uuml;r 
Kompilierung und Installation ausf&uuml;hrlich beschrieben.


7. Grafik

Ein sehr leistungsf&auml;higes Grafik-Programm wurde schon mit der Einrichtung
des Linux-System entsprechend unseres Einsatz-Profils installiert:
The Gimp. In der Debian2.1-Distribution liegt es in Version 1.0.2 vor.

Screenshot:
<IMG SRC="../extra/Debian-Gimp.png" ALT="Screenshot">

Mit "Gimp" macht die Bildmanipulation Spa&szlig;- vorausgesetzt, Ihr habt eine
schnelle CPU in Eurem Amiga oder viel Geduld. 
Au&szlig;erdem finden sich noch viele weitere interessante Grafik-Programme auf 
den CD-ROMs. Geht einfach auf Entdeckungsreise. Es wird interessant. Ganz
bestimmt.

 
8. Ausblick

Neben der Debian-Distribution buhlen nat&uuml;rlich noch weitere Un*x-Derivate
um die Gunst der Amiganer. Im vierten Teil dieses Workshops wird das von
Stefan Ossowskis Schatztruhe seit kurzem ver&ouml;ffentlichte "The Amiga Unix 
Compendium V1.2" unter die Lupe genommen. Interessant bei diesem 3-fach
CD-ROM-Set: Neben einem RedHat-m68k-Linux sind ebenso LinuxPPC und NetBSD
mit von der Partie. 
Au&szlig;erdem soll die f&uuml;r diesen dritten Teil schon angek&uuml;ndigte Datensicherung
endlich zur Sprache kommen.


[1] http://www.uni-sw.gwdg.de/~pit/LyX/index.html
[2] ftp://ftp.uni-sw.gwdg.de/pub/people/pit/lyx-1.0.4.tar.gz
[3] ftp://gd.tuwien.ac.at/hci/xforms/linux-m68k/bxform-088.glibc2.tgz
[4] ftp://ftp.edu.stockholm.se/pub/siag/siag-3.1.22.tar.gz
[5] ftp://ftp.edu.stockholm.se/pub/siag/Xaw3d-1.3.tar.gz


Uwe Pannecke &lt;Uwe.Pannecke@t-online.de&gt;«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
