<HTML>
<HEAD>
<TITLE>Blizzard 603e Power Board -kiihdytinkortti Amiga 1200:lle</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=60% ALIGN=LEFT><FONT SIZE=4 FACE="Arial" color="#109f00"><B><I>Blizzard 603e Power Board -kiihdytinkortti Amiga 1200:lle</I></B></FONT></TD>
  <TD WIDTH=40% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><I>Lehdist&ouml;tiedotteesta k&auml;&auml;nt&auml;nyt</I><BR><B>Eero Rantanen</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>2</FONT><FONT SIZE=3>
5. helmikuuta 1997 phase 5 ilmoitti tulevasta PowerPC-turbokortista Amiga 1200:lle ja tornitetuille A1200-koneille. T&auml;m&auml; uusi kortti tuo A1200:n laajentamiseen uuden ulottuvuuden. Se parantaa koneen suorituskyky&auml; moninkertaiseksi verrattuna nopeimpiin 68k-pohjaisiin turbokortteihin ja viel&auml; sensaatiomaisen alhaisella hinnalla.<BR>
Koska kortti on suunniteltu olemassa olevien Amigoiden laajennukseksi, se perustuu phase 5:n kekseli&auml;&auml;seen tuplaprosessoritekniikkaan. Nopea PowerPC RISC-prosessori toimii yhdess&auml; 68k-prosessorin kanssa, joka Blizzard 603e:n tapauksessa on 68030. Molemmat prosessorit jakavat dynaamisesti muistin ja v&auml;yl&auml;t, mik&auml; on tarpeen aidolle moniprosessoritoiminnalle. Kun alkuper&auml;inen AmigaOS 3.x toimii 68030:ll&auml;, kuten my&ouml;s olemassa olevat ohjelmat, on 100% yhteensopivuus taattu. PowerPC 603e:t&auml; tukee laaja PPC-kirjasto, joka tarjoaa kaikki toiminnot, jotta PowerPC liittyy Amigan moniajoymp&auml;rist&ouml;&ouml;n. Ohjelmistojen kehitt&auml;j&auml;t voivat helposti optimoida ohjelmansa askel askeleelta porttaamalla PowerPC-koodille yksitt&auml;isi&auml; teht&auml;vi&auml;, joita voidaan silloin ajaa rinnan 68k-teht&auml;vien kanssa. Monet t&auml;rke&auml;t Amigan ohjelmistotuottajat ovat jo valmistelemassa portattuja tai optimoituja versioita ohjelmistoistaan, joten pian on odotettavissa suuri m&auml;&auml;r&auml; PowerPC:t&auml; tukevia ohjelmistoja.<BR><BR>
Blizzard 603e Power Board tulee saataville nopealla 120 MHz:n PowerPC603e-prosessorilla, ja kortilla on PGA-kanta 68030-prosessorille. Kortilla on my&ouml;s FAST-muistin laajennusmahdollisuus, joka k&auml;ytt&auml;&auml; standardin mukaisia PS/2 SIMMej&auml;. Prosessorit jakavat muistin dynaamisesti kesken&auml;&auml;n. Optiona tulee saataville Fast SCSI-II -ohjain, joka yhdist&auml;&auml; 10 Mt/s siirtonopeuden SCSI-standardin joustavuuteen ja laajennettavuuteen.<BR><BR>
120 MHz:n 603e-prosessorillaan kiihdytin tarjoaa - vain PPC-puolella - n. 170 MIPS tai n. 3.5 SPECint95 ja 2.8 SPECfp95 (arviot perustuvat Motorolan/IBM:n tuotantotietoihin). T&auml;m&auml; huimaava nopeus kilpailee hyvinkin t&auml;m&auml;n p&auml;iv&auml;n nopeimpien PC-koneiden kanssa. T&auml;ll&auml; teholla Blizzard 603e on valmis mihin tahansa vaativiin teht&auml;viin, kuten 3D-renderointiin, nopeisiin 3D-peleihin, kuvank&auml;sittelyyn, animaatioon, videoty&ouml;skentelyyn ja moniin muihin nopeasta prosessorista riippuviin t&ouml;ihin.<BR><BR>
Blizzard 603e toimitetaan laajan ohjelmistopaketin kanssa, joka sis&auml;lt&auml;&auml; PPC-kirjaston ja ty&ouml;kalut luoville k&auml;ytt&auml;jille. Niiden joukossa on mm. PD GNU C -k&auml;&auml;nt&auml;j&auml; PowerPC:lle (sis&auml;lt&auml;&auml; l&auml;hdekoodin) ja monia demo-ohjelmia ja hy&ouml;tyohjelmia l&auml;hdekoodeineen. T&auml;m&auml;n lis&auml;ksi ilmainen kehitt&auml;j&auml;tuki on saatavilla phase 5:sen FTP-palvelimelta. Viimeisen&auml;, muttei suinkaan v&auml;h&auml;isemp&auml;n&auml; tulee PowerPC-optimoitu versio CyberGraphX V3:sta, RISC-optimoiduilla CyberGL/3D- ja MPEG-funktioilla ja kirjastoilla (mukana my&ouml;s oma GGX-ajuri AGA-piirist&ouml;lle) - ja kaikki tietenkin laajasti dokumentoituna.<BR><BR>
Blizzard 603e Power Boardia tullaan myym&auml;&auml;n sensaatiomaisella hinnalla, joka tarjoaa mahtavan hinta-tehosuhteen. Ehdotetut hinnat ovat:<BR><BR>

<B>Blizzard 603e Power Board 120 MHz 603e-prosessorilla</B><BR>
<I>DEM 699,- / GBP 279,- / USD 399,-</I><BR><BR>

Huomaa, ett&auml; hinnat ovat j&auml;lleenmyyntihintoja. Englannin ja Saksan hintoihin sis&auml;ltyy paikallinen alv, mutta jenkkihinta ei sis&auml;ll&auml; paikallisia veroja. N&auml;m&auml; hinnat ovat ilman 68030 prosessoria, joka tarvitaan turbokortin k&auml;ytt&ouml;&ouml;n. Vanhasta turbokortista otettu prosessori sopii suoraan sille varattuun kantaan. Jos sinulla ei ole 68030-kiihdytint&auml;, niin kysy edullista p&auml;ivitystarjousta paikalliselta kauppiaaltasi.<BR><BR>
Blizzard 68030 -korttien rekister&ouml;idyt omistajat - jotka ovat PowerUp-ohjelmassa - saavat upean erikoistarjouksen postissa maaliskuun aikana. Paikalliset edustajat huolehtivat n&auml;ist&auml;.<BR><BR>
Blizzard 603e Power Board pit&auml;isi olla saatavilla toukokuun lopussa 1997. Sen saatavuus A1200-p&ouml;yt&auml;mallille riippuu CE-hyv&auml;ksynn&auml;n l&auml;pimenosta tuohon p&auml;iv&auml;&auml;n menness&auml;.<BR><BR>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
