<HTML>
<HEAD>
<TITLE>Gateway 2000 ostaa Amiga Technologiesin?</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=4 FACE="Arial" color="#109f00"><B><I>Gateway 2000 ostaa Amiga Technologiesin?</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Jari Ristiranta</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>G</FONT><FONT SIZE=3>
ateway 2000 Inc. on ilmoittanut (27.3.1997) tehneens&auml; tarjouksen Amiga Technologiesin omaisuudesta, patenteista, liikemerkeist&auml; ja tuotenimist&auml;. Tarjouksen suuruus ei ole tiedossa.<BR><BR>
Maanantaina (31.3.1997) annetun tiedotteen mukaan konkurssituomioistuin on hyv&auml;ksynyt tarjouksen, mutta sit&auml; ei ole viel&auml; artikkelin kirjoitushetkell&auml; tarkastettu ja varmistettu saati sitten pantu t&auml;yt&auml;nt&ouml;&ouml;n. Selvill&auml; eiv&auml;t my&ouml;sk&auml;&auml;n ole Gateway 2000:n aikeet Amigaa kohtaan.<BR><BR>
<I>"Kauppa on hyv&auml; uutinen Gatewaylle ja Amigan k&auml;ytt&auml;jille. Se vahvistaa meid&auml;n kaupallista asemaamme ja yhti&ouml;t&auml; (Amiga Technologies), joka on ollut edell&auml;k&auml;vij&auml; multimediasovellutuksissa ja k&auml;ytt&ouml;j&auml;rjestelm&auml;teknologiassa."</I> - Rick Snyder, Gatewayn toimitusjohtaja<BR><BR>
Kaupan mahdollisesti vahvistuessa Amiga Technologiesin uudeksi nimeksi tulee Amiga International ja se jatkaa erillisen&auml; yksikk&ouml;n&auml; nykyisen toimitusjohtajan Petro Tyschtschenkon johdolla.<BR><BR>
<I>"Gateway 2000 antaa meille uutta voimaa ja valoa tulevaisuuteen."</I> - Petro Tyschtschenko<BR><BR>
Gateway 2000 Inc. on perustettu vuonna 1985 ja on t&auml;n&auml; p&auml;iv&auml;n&auml; maailman johtavia PC-tietokoneiden suoramarkkinointiyhti&ouml;it&auml; viiden miljardin dollarin liikevaihdollaan ja 250 miljoonan dollarin nettotuloillaan (1995).<BR><BR>

Lis&auml;&auml; tietoa Gatewaysta nettiosoitteessa <A HREF="http://www.gateway2000.com"><I>http://www.gateway2000.com/</I></A>.
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
