<HTML>
<HEAD>
<TITLE>Netti Finland Oy:n Internet-palvelut</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Netti Finland Oy:n Internet-palvelut</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Joni Lehto</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>I</FONT><FONT SIZE=3>
nternet-yhteyksien tarjoajia on paljon, joten monia koneenomistajia varmaankin mietitytt&auml;&auml;, mist&auml; yhteyden hankkisi. Hankintap&auml;&auml;t&ouml;st&auml; teht&auml;ess&auml; kannattaa kiinnitt&auml;&auml; huomiota siihen, mihin tarkoitukseen yhteytt&auml; on hankkimassa. Ennen kaikkea on t&auml;rke&auml;&auml;, ett&auml; palveluntarjoaja on jokseenkin tunnettu, jolloin voi olla varma yhteyden toimivuudesta ja siit&auml;, ettei kyseess&auml; ole mik&auml;&auml;n Matti Meik&auml;l&auml;inen, joka on saanut p&auml;&auml;h&auml;ns&auml; rahastaa ihmisi&auml; parilla 14400 bps modeemilla ja ylikuormitetuilla linjoilla.<BR><BR>
Min&auml; p&auml;&auml;dyin valitsemaan palveluni Netti Finland Oy:lt&auml;, joka silloin kuului halvimpiin palveluntarjoajiin. P&auml;&auml;t&ouml;s Netti Finlandin hyv&auml;ksi syntyi l&auml;hinn&auml; siksi, ett&auml; se tarjoaa v.34-paketissa k&auml;ytt&ouml;&ouml;n:<BR>
<BLOCKQUOTE><CODE>
- s&auml;hk&ouml;postin (sis. 10 Mt:n postilaatikon!)<BR>
- World Wild Web -hypermedian<BR>
- Usenet News -uutisryhm&auml;t<BR>
- FTP-tiedostonsiirron<BR>
- IRC-keskustelukanavat<BR>
- Telnet-p&auml;&auml;teyhteyden<BR>
- henkil&ouml;kohtaisen WWW-kotisivun (max. koko 5 Mt)<BR>
- Unix-shell-oikeuden<BR>
</CODE></BLOCKQUOTE>

Lis&auml;ksi Netti-liittym&auml;n mukana toimitetaan PC:n Windowsille kaikki tarvittavat ohjelmistot, joiden avulla p&auml;&auml;st&auml;&auml;n k&auml;ytt&auml;m&auml;&auml;n kaikkia Internet-palveluita. Paketti sis&auml;lt&auml;&auml; mm. Microsoft Internet Explorer -WWW-selaimen sek&auml; s&auml;hk&ouml;posti- ja News-ohjelman. Mukana seuraa my&ouml;s eritt&auml;in selke&auml; lappunen, jossa on kaikki tarvittavat tiedot ohjelmien asentamiseksi.<BR><BR>
Koska Amigaa k&auml;ytt&auml;v&auml;t eiv&auml;t voi hy&ouml;dynt&auml;&auml; mukana tulevaa pakettia, niin suosittelenkin jokaiselle Miamia ja IBrowsea, jolloin on helppoa ja nopeaa p&auml;&auml;st&auml; linjoille ja luoda PPP/Slip-yhteys.<BR><BR>

</FONT><FONT SIZE=4><B>Mit&auml; Netti Finlandin palvelut maksavat?</B></FONT><BR><BR>
</FONT><FONT SIZE=5>N</FONT><FONT SIZE=3>
etti Finland Oy:n palvelut maksavat seuraavanlaisesti (sis. alv 22%):<BR>
<PRE>
- Uuden asiakkaan rekister&ouml;inti ........................ <I>120 mk</I>
- Perusmaksu ...........................................  <I>39 mk/kk</I>
- K&auml;ytt&ouml;maksu, Turun- ja Porin tla (02-suunta) .........  <I>11 p/min</I>
- K&auml;ytt&ouml;maksu, muualta Suomesta ........................  <I>16 p/min</I>
</PRE>
Laskutuskautena on kalenterikuukausi. Lasku sis&auml;lt&auml;&auml; edellisen kuukauden perusmaksun ja k&auml;ytt&ouml;maksun k&auml;ytettyjen minuuttien mukaan. Lasku toimitetaan erillisen&auml;, ei puhelinlaskuun liitettyn&auml;. Hinnat eiv&auml;t sis&auml;ll&auml; puhelinkuluja!<BR><BR>
(Tele ja puhelinyhti&ouml;t periv&auml;t lis&auml;ksi paikallispuhelumaksun, joten koko Suomesta p&auml;&auml;see soittamaan paikallispuhelumaksun hinnalla Netti Finlandin palvelimelle.)<BR><BR>
</FONT><FONT SIZE=4><B>Laitteistovaatimukset</B></FONT><BR><BR>
</FONT><FONT SIZE=5>L</FONT><FONT SIZE=3>
aitteistovaatimukset Internet-liittym&auml;lle ovat tietokone ja puhelinmodeemi. Tietokone voi olla Amiga, Mac, PC tai vastaava, johon on saatavana tarvittava modeemi ja ohjelmistot. Modeemin ja tietokoneen nopeuden ja kapasiteetin tarve riippuu k&auml;ytetyist&auml; Internet-palveluista ja ohjelmaversioista.<BR><BR>
Jopa 286-tasoisella mikrolla ja 2400 bps modeemilla voidaan k&auml;ytt&auml;&auml; s&auml;hk&ouml;postia, newsej&auml; tai jopa merkkipohjaista WWW:t&auml;. :) Suositus on kuitenkin v&auml;hint&auml;&auml;n 386-pohjainen mikro, Windows tai OS/2, graafiset Internet-ohjelmat ja v&auml;hint&auml;&auml;n 9600 bps modeemi.<BR><BR>
Amigalla, jossa on 14400 bps modeemi, p&auml;rj&auml;&auml; aivan mainiosti ja se toimii jopa suhteellisen nopeasti WWW-sivuilla liikuttaessa. Tosin koneessa kannattaa olla FAST-muistia ja mielell&auml;&auml;n my&ouml;s jonkinlainen turbokortti k&auml;ytett&auml;ess&auml; graafista yhteytt&auml;, koska muutoin kuvien latautuminen kest&auml;&auml; kauan!<BR><BR>
Jos yhteytt&auml; tarvitsee vain tiedostojen hakuun, kannattaa k&auml;ytt&auml;&auml; vaikka Lynxi&auml;, jolloin siirto suorastaan lent&auml;&auml; (ainakin k&auml;ytett&auml;ess&auml; 28800 bps yhteytt&auml;)!<BR><BR>

</FONT><FONT SIZE=4><B>Mit&auml; n&auml;m&auml; palvelut ovat?</B></FONT><BR><BR>
</FONT><FONT SIZE=5>K</FONT><FONT SIZE=3>
oska joukossamme saattaa olla joitakin, jotka eiv&auml;t koskaan ole olleet Internetiss&auml;, niin kerron hieman noista palveluista.<BR><BR>

<B>World Wide Web</B><BR><BR>

World Wide Web, WWW eli webbi on nykyisen Internetin keskeisin palvelu s&auml;hk&ouml;postin ohella. Se on hypermediaverkosto, joka koostuu suuresta m&auml;&auml;r&auml;st&auml; teksti&auml;, kuvia ja jopa &auml;&auml;nt&auml;. Kaikki informaatio on palveluntarjoajien ja yritysten WWW-palvelimilla, joita Internetin k&auml;ytt&auml;j&auml;t p&auml;&auml;sev&auml;t hy&ouml;dynt&auml;m&auml;&auml;n omilla WWW-selaimillaan. Tiesittek&ouml;, ett&auml; yhdell&auml; tietokoneella ja Internet-liittym&auml;ll&auml; saadaan yrityksen informaatio n&auml;kyville jopa 30 miljoonalle ihmiselle? Kyseess&auml; on siis laaja organisaatio eik&auml; mik&auml;&auml;n pikku verkko. ;)<BR><BR>

<B>S&auml;hk&ouml;posti</B><BR><BR>

S&auml;hk&ouml;posti, email, on Internetin t&auml;rkein ja k&auml;ytetyin palvelu. Internetin s&auml;hk&ouml;posti on tietenkin eritt&auml;in nopea: l&auml;hetetty viesti on vastaanottajan postilaatikossa parhaimmillaan muutamassa sekunnissa ja toiselle puolelle maapalloa viesti siirtyy minuutissa!<BR><BR>
S&auml;hk&ouml;postia voi l&auml;hett&auml;&auml; kaikille, joilla on oma s&auml;hk&ouml;postiosoite. Lis&auml;ksi voi liitty&auml; joihinkin tuhansista postituslistoista, jolloin postilaatikkoosi tulee automaattisesti postia sinua kiinnostavista aiheista.<BR><BR>

<B>Usenet News</B><BR><BR>

Usenet News, nyyssit, uutiset - jo nimi kertoo palvelun sis&auml;lt&auml;v&auml;n uutisia, ilmoituksia sek&auml; tiedotuksia. Newsit ovat kuin suuri ilmoitustaulu, jonne jokainen voi j&auml;tt&auml;&auml; kysymyksens&auml;, kommenttinsa tai mink&auml; tahansa ilmoituksen. News-palvelu on j&auml;rjestelty hierarkkisesti aihepiirin mukaan tuhansiin eri uutisryhmiin.<BR><BR>
<I>AG-toimittajan huomio: uutisryhm&auml;t ovat l&auml;hinn&auml; keskustelualueita, eiv&auml;t uutis- tai tiedotusalueita.</I><BR><BR>

<B>FTP-tiedostonsiirto</B><BR><BR>

FTP-tiedostonsiirtopalvelut ovat eritt&auml;in suosittuja erilaisten ohjelmien ja tiedostojen siirtoa ja jakelua varten. Maailmassa on tuhansia pieni&auml; ja eritt&auml;in suuria FTP-palvelimia, joissa on rajaton m&auml;&auml;r&auml; ilmaisia hy&ouml;tyohjelmia, tiedostoja ja pelej&auml; eri k&auml;ytt&ouml;j&auml;rjestelmille. Suomessa on Euroopan suurin FTP-palvelin, josta on nopeat yhteydet ymp&auml;ri Suomen.<BR><BR>

<B>Telnet</B><BR><BR>

Telnetin avulla voidaan ottaa merkkipohjainen p&auml;&auml;teyhteys verkkoon kytkettyyn koneeseen. K&auml;ytt&ouml; vastaa normaalia paikallisverkon p&auml;&auml;teyhteytt&auml; ja vaati yleens&auml; k&auml;ytt&ouml;oikeden ko. koneeseen sek&auml; t&auml;rkeimpien Unix-komentojen tuntemuksen.<BR><BR>
Telnet-yhteyden avulla voidaan hoitaa my&ouml;s pankkipalvelut, pelata verkossa olevia pelej&auml; (esim. MUD-pelit) ja olla yhteydess&auml; BBS-j&auml;rjestelmiin.<BR><BR>

<B>IRC-keskustelukanavat</B><BR><BR>

IRC-keskustelukanavat ovat reaaliaikaisia ryhmi&auml;, joissa verkossa olevat k&auml;ytt&auml;j&auml;t voivat keskustella toistensa kanssa aiheesta kuin aiheesta. Keskustelijat naputtelevat koneeltaan tekstin ja muiden keskustelijoiden "puheet" ilmestyv&auml;t n&auml;yt&ouml;lle v&auml;litt&ouml;m&auml;sti.<BR><BR>

<B>Gopher-tiedostopalvelut</B><BR><BR>

Gopher-tiedostopalvelut ovat p&auml;&auml;asiassa yliopistojen yll&auml;pit&auml;mi&auml; laajoja tekstipohjaisia tietoaineistoja, jotka on j&auml;rjestetty hierarkkisesti eri aiheryhmiin.<BR><BR>
Gopher-palvelut sis&auml;lt&auml;v&auml;t vastaavaa tietoa kuin WWW-palvelimet mutta ovat vain tekstipohjaisia. Haku- ja selailutoiminnot ovat nopeammat ja selke&auml;mm&auml;t kuin WWW:ss&auml;, mutta silti n&auml;m&auml; Gopher-palvelut ovat siirtym&auml;ss&auml; monipuolisempaan WWW-muotoon.<BR><BR>

</FONT><FONT SIZE=4><B>Ja viel&auml; jos olette hereill&auml;...</B></FONT><BR><BR>
</FONT><FONT SIZE=5>T</FONT><FONT SIZE=3>
oivon, ett&auml; t&auml;st&auml; ensimm&auml;isest&auml; muttei toivottavasti viimeisest&auml; Saku-artikkelistani sai edes jonkinlaista selkoa siit&auml;, mit&auml; Netti Finland tarjoaa ja mill&auml; hinnalla. Toivon my&ouml;s, ett&auml; sellaiset lukijat, jotka eiv&auml;t aiemmin olleet kuulleetkaan WWW:st&auml;, olisivat saanneet siit&auml; edes jonkinlaisen kuvan.<BR><BR>
Jos joku haluaa lis&auml;tietoja Netti Finland Oy:n littym&auml;st&auml;, niin kannattaa ottaa yhteytt&auml; johonkin seuraavista:<BR>
<PRE>
Netti Finland Oy      puhelin 020 8307070 <BLINK><B>*</B></BLINK>
PL 10, 20811 Turku    telefax 020 730 7090

Email:    <A HREF="mailto:netti@netti.fi"><I>netti@netti.fi</I></A>
WWW-sivu: <A HREF="http://www.netti.fi/"><I>http://www.netti.fi/</I></A>
</PRE>
<BLINK><B>*</B></BLINK> Ilmainen asiakaspalvelupuhelin p&auml;ivyst&auml;&auml; arkisin (ma-pe) klo 9.00 -17.00.<BR><BR>

</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
