<HTML>
<HEAD>
<TITLE>P&auml;&auml;toimittajan p&auml;&auml;kirjoitus</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>P&auml;&auml;toimittajan p&auml;&auml;kirjoitus</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Esa Heikkinen</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>K</FONT><FONT SIZE=3>
ev&auml;t saapuu j&auml;lleen ja niin saapui my&ouml;s t&auml;m&auml;n lehden julkaisup&auml;iv&auml;. Mutta artikkeleja ei pahemmin saapunut! En halua lukea kenek&auml;&auml;n valittavan lehden suppeaa sis&auml;lt&ouml;&auml;, joten jos jollakulla on intoa valittaa siit&auml;, menk&ouml;&ouml;n itseens&auml; ja miettik&ouml;&ouml;n, olisiko tuon innostuksen voinut k&auml;ytt&auml;&auml; artikkelien v&auml;s&auml;&auml;miseen. Kuten olen jo monta monituista kertaa todennut (samoin kuin edellisetkin p&auml;&auml;toimittajat), niin t&auml;m&auml;n lehden tekev&auml;t lukijat ja vapaaehtoiset omilla artikkeleillaan.<BR><BR>
Onko sitten kiinnostus lehte&auml; kohtaan laantunut niin tyystin, ett&auml; juttujen kirjoitusinto on tosi laimeaa? Halutaanko Sakua en&auml;&auml; lukea jatkossa s&auml;&auml;nn&ouml;llisesti? N&auml;m&auml; ovat kysymyksi&auml;, joihin itse kukin voi vastata omalla panoksellaan - kirjoittamalla tai olemalla kirjoittamatta. Ilman juttuja t&auml;m&auml; lehti loppuu, t&auml;h&auml;n todellisuuteen on nyt jokaisen lukijan her&auml;tt&auml;v&auml;!<BR><BR>
Olen varma, ett&auml; lukijoiden joukossa on kirjoitustaitoisia, on ainakin aiemmin ollut, ja muutama juttu t&auml;h&auml;nkin lehteen saatiin. Mutta aivan liian v&auml;h&auml;n! Joten nyt jos koskaan olisi aika alkaa v&auml;&auml;nt&auml;&auml; jutunp&auml;tk&auml;&auml; jostakin aiheesta, jonka luulisi lukijoita kiinnostavan. Jutun aiheen ei tarvitse olla kiinte&auml;sti Amigaan liittyv&auml;, jos se tuottaa ongelmia. Mutta Amigastakin l&ouml;ytyy varmasti kirjoittamista. Kirjoittakaa vaikka jostain ohjelmasta tai laitteesta, jota k&auml;yt&auml;tte. Kirjoittakaa oma n&auml;k&ouml;kantanne asiaan, vaikka samaa asiaa olisi puitu lehdess&auml; jo aiemminkin!<BR><BR>
&Auml;lk&auml;&auml; antako hyv&auml;n idean kuihtua vaan kirjoitelkaa!
<BR><BR>
<BLOCKQUOTE><I>Esa Heikkinen</I></BLOCKQUOTE>
</FONT>

<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
