<HTML>
<HEAD>
<TITLE>Interneti&auml;</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Interneti&auml;</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR><BR>
  <FONT SIZE=3><B>Heikki Niemel&auml;</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>H</FONT><FONT SIZE=3>
eips..<BR><BR>
</FONT><FONT SIZE=5>O</FONT><FONT SIZE=3>
n tullut k&auml;ytetty&auml; tuota bbss&auml;&auml;kin kai aika kauan, modeemin hommasin joskus 91.. Olen nyt k&auml;ytt&auml;nyt interneti&auml; marraskuusta asti, ja j&auml;i h&auml;iritsem&auml;&auml;n tuossa Klemolan Miami artikkelissa parit jutut, tuntui kuin h&auml;n ei tiet&auml;isi amigan client ohjelmista mit&auml;&auml;n?!<BR><BR>
Esim yleist&auml; browsereista ibrowse on luotettavin, mutta ei tue frameja, aweb on aika hyv&auml; kuvia 'impatessa'. Voyager on mainio koska se tukee my&auml;s frameja yms. Amftp on varsin mainio gui ohjelma ftp-hen, sek&auml; DirectoryOpus 5:lla onnuistuu my&ouml;s..<BR><BR>
Ja h&auml;n ei ole n&auml;hnyt AmIRC ohjelmaa??? Seh&auml;n on uskomattoman mainio!! K&auml;sitt&auml;&auml;kseni Aminetissakin taitaa olla jotain versioita? Hyv&auml; gui, ja todella k&auml;tev&auml;...<BR><BR>
Itse k&auml;yt&auml;nkin:<BR>
<BLOCKQUOTE><I>
Mui 3.7 (uusin 3.8) ilmainen<BR>
Miami 1.93 (uusin 2.x) demo ilmainen, aikarajoituksetonkin halpa<BR>
Yam(email)  ilmainen<BR>
Ibrowse1.02 demokin toimii, paitsi ei ftp ja email<BR>
Voyager joku uudehko <BR>
Amirc 1.3x aminet?<BR>
Amftp 1.7x aminet?<BR>
</I></BLOCKQUOTE>

Ja ovat mit&auml; mainioimpia! hmm <I>'en ole koskaan n&auml;hnyt AmIRCi&auml;'</I>??? apua!<BR><BR>
En huomannut Sami Klemolan e-mailia, joten ajattelin kirjoitaa postipalstalle, josko asia menisi eteenp&auml;in..<BR><BR>
Ja a\boxista seuraavaan sakuun!! ihmisill&auml; on oikeus tiet&auml;&auml; :-) Min&auml; ainakin jo kuolaan sen per&auml;&auml;n.. (sori etten itse lue kovin aktiivisesti, koska newseja saan IRCist&auml; kamuilta ymp&auml;ri eurooppaa.)<BR><BR>
<I>PS!</I> Olen ajatellut tuon IMDB:n joskus laittaa kun on backuppi v&auml;lineet zippi tai romppu, mutta saakohan ne jostain ftp palvelimista tai muualta? Aminetissahan ne on, mutta hitaasti :-/, ja Amiga Zonella, mutta se on kaukopuhelu. P&auml;&auml;sek&ouml; Amiga Zonelle ftp:ll&auml; tai muulla? :-?<BR>
<BLOCKQUOTE><I>Heikki Niemel&auml;</I></BLOCKQUOTE>

<HR width=40% size=1 align=CENTER><BR>

</FONT><FONT SIZE=5>A</FONT><FONT SIZE=3>
\boxista ei kukaan ole kirjoittaunut juttua, joten siihen asiaan ei nyt viel&auml; l&auml;ytynyt apua. Kenties ensi lehteen joku asiaan syv&auml;llisemmin perhehtynyt voisi laatia jutunp&auml;tk&auml;&auml;(?) Uutuutena A\BOX on todella jotain mit&auml; on odotettu, ja et varmasti ole ainoa joka haluaisi tiet&auml;&auml; asiasta lis&auml;&auml;. Varsinkin kun valtakunnalliset tietokonelehdet eiv&auml;t uskalla siit&auml; kirjoittaa, lieneek&auml; pelkona PC:n ylivallan h&auml;iriintyminen. The Internet Movie Database (IMDB) l&ouml;ytyy ftp:ll&auml; nopeimmin osoitteesta ftp.sunet.se hakemistosta pub/tv+movies/imdb. Alihakemistosta diffs/ l&ouml;ytyy tietokantaan viikottain ilmestyv&auml;t p&auml;ivitykset. P&auml;ivitykset on pakattu gnu zipill&auml; ja koottu gnutarilla, joista molemmista l&ouml;ytyy k&auml;&auml;nn&auml;kset Amigalle. P&auml;ivitykset ja listatiedostot voi purkaa gnuzipill&auml; seuraavasti:<BR>
<BLOCKQUOTE><CODE>gzip -d &lt;tiedostonimi&gt;</CODE></BLOCKQUOTE><BR>
Mik&auml;li purettu tiedosto on .tar p&auml;&auml;tteinen, sis&auml;lt&auml;&auml; se ison kasan tiedostoja tai kokonaisen hakemistorakenteen. Tar-paketti puretaan komennolla:<BR>
<BLOCKQUOTE><CODE>gnutar -xvf &lt;tiedostonimi.tar&gt;</CODE></BLOCKQUOTE><BR>
</FONT><FONT SIZE=5>A</FONT><FONT SIZE=3>
miga Zone levitt&auml;&auml; itse MovieDataBasea t&auml;ydellisen&auml; sek&auml; viikottaisia p&auml;ivityksi&auml; sit&auml; mukaa kun paketteja tulee. Amiga Zonelta paketit saa LZX-muodossa, tosin muotoa ollaan vaihtamassa LhA:ksi useiden OS/2 k&auml;ytt&auml;jien pyynn&auml;st&auml;, koska OS/2 k&auml;ytt&ouml;j&auml;rjestelm&auml;lle ei saa LZX-pakkaajaa. PC seuraa Amigaa per&auml;ss&auml; ja OS/2 on &auml;skett&auml;in saanut oman versionsa MovieDataBasesta, joka k&auml;ytt&auml;&auml; samoja datatiedostoja kuin unixin alkuper&auml;inen versio ja Amigan versio. T&auml;st&auml; siis OS/2 k&auml;ytt&auml;jien kiinnostus Amiga Zonella olevia MovieDataBasen tiedostoja kohtaan. Amiga Zonelle ei t&auml;t&auml; nyky&auml; p&auml;&auml;se internetin kautta. Kenties tulevaisuus tuo joskus tullessaan j&auml;rkev&auml;n hintaisia yhteyksi&auml; jolloin moinen voisi olla mahdollista.<BR>
<BLOCKQUOTE><I>Esa Heikkinen</I></BLOCKQUOTE>

<TABLE WIDTH=100%>
<TR><TD ALIGN=RIGHT><A HREF="Postipalsta.html"><I>Paluu takaisin postipalstalle</I></A></TD></TR>
</TABLE>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
