<HTML>
<HEAD>
<TITLE>Palautetta</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Palautetta</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Valtteri Murto</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>K</FONT><FONT SIZE=3>
un nyt kaikki valittelevat etteiv&auml;t koskaan saa palautetta niin annettakoon kansalle mit&auml; kansa tahtoo...<BR><BR>
Aluksi voisin hieman kommentoida t&auml;t&auml; uutta(?) lehte&auml;, jota t&auml;ss&auml; jo tunnin verran olen ehtinyt lueskelemaankin. Ensivaikutelma on t&auml;rke&auml;. Pirte&auml; musiikki taustalla, talvisen auringon paiste ikkunasta, ja lopultakin varma tieto siit&auml;, ett&auml; Saku todellakin viel&auml; el&auml;&auml; ja voi hyvin, tekev&auml;t temppunsa; mieleni piristyy rankan koulup&auml;iv&auml;n j&auml;lkeen suorastaan ennen n&auml;kem&auml;tt&ouml;m&auml;ll&auml; tavalla, ja ehk&auml;p&auml; sen takia ette nyt kauheasti molli-s&auml;vyist&auml; kritiikki&auml; kuulekaan.<BR><BR>
Intro kuvasta p&auml;&auml;tellen tekij&auml; on selv&auml;sti viel&auml; alle teini-ik&auml;inen, tai juuri astumassa t&auml;lle kynnykselle, (olen pahoillani jos loukkasin jotain) joten piirt&auml;j&auml;n arvioidun i&auml;n perusteella tuo on ihan mukava kansi, ja tuo ainakin vaihtelua niiden kymmenien sammakko-logojen j&auml;lkeen.<BR><BR>
P&auml;&auml;kirjoitus oli jotenkin paljon "kevyemm&auml;ll&auml; k&auml;dell&auml;" kirjoitettua kuin ennen, johtuneeko sitten Esan perhetapahtumasta? Joka tapauksessa ainakin paljon pirte&auml;mp&auml;&auml; luettavaa kuin ennen.<BR><BR>
Sis&auml;lt&ouml;luettelo nyt ei kovin paljoa pullistele, mik&auml; tosin on t&auml;ysin ymm&auml;rrett&auml;v&auml;&auml;kin, onhan t&auml;m&auml; lehti sen verran my&ouml;h&auml;ss&auml;kin. Mielest&auml;ni liian paljon ottaen huomioon sen, ett&auml; lehden tilanteesta ei ole tullut mink&auml;&auml;nlaisia tilannekatsauksia tai vastaavia v&auml;liaikaisia tiedotteita.  Toivon kuitenkin, ett&auml; t&auml;m&auml;n uuden lehden my&ouml;t&auml; tilanne hieman piristyisi, ja uusia artikkeleita alkaisi tihkua toimitukseen. Yrit&auml;n ainakin oman panokseni antaa.<BR><BR>
Jotkut ovat varmasti my&ouml;s ihmetelleet sit&auml;, ett&auml; miksi ihmeess&auml; Sakussa julkaistaan nyt tuollaisia juttuja, kuten kirjoittamani X-Files video artikkeli. Heille kerrottakoon, ett&auml; kyseinen juttu oli kirjoitettu hein&auml;kuussa, kun uuden Sakun piti ilmesty&auml; syyskuussa, ja t&auml;m&auml; elokuvakin tuli TV:st&auml; kolmessa osassa elokuussa... :-I<BR><BR>
Sitten hieman kommentointia postista:<BR><BR>
Mielest&auml;ni Sakun nykyinen lukija ei ainakaan ole sent&auml;&auml;n @{b}niin@{ub} huono kuin millaisen kuvan Petri Keckman siit&auml; antaa. Jotenkin t&auml;m&auml; on vain iskostunut selk&auml;ytimeen, ja lehte&auml; selaa luontevasti unissaankin. Sit&auml;paitsi t&auml;m&auml; vanha lukija mielest&auml;ni kunnioittaa diskettilehtien perinteit&auml;, vaikkei nyt susi lampaiden vaatteissa olekaan... :)<BR><BR>
Yksi asia kuitenkin tuo mustia pilvi&auml; taivaani ylle: Mink&auml; ihmeen takia meid&auml;n jo valmiiksikin haukuttujen, syrjittyjen ja p&auml;&auml;h&auml;n potkittujen Amigistien pit&auml;&auml; viel&auml; toisiammekin alkaa haukkua? Siis kuinka kauan viel&auml; joudun seuraamaan herrojen SK ja JS "keskustelua", joka on hyv&auml;&auml; vauhtia siirtym&auml;ss&auml; Juupas-eip&auml;s leikiksi? Mielest&auml;ni meid&auml;n Amigistien tulisi pit&auml;&auml; yht&auml;. En halua, ett&auml; t&auml;m&auml;(kin) lehti kaatuu sis&auml;isiin ristiriitoihin, vaan ett&auml; sen tekij&ouml;iden keskuudessa arvostettaisiin sek&auml; omaa, ett&auml; toisen tekem&auml;&auml; ty&ouml;t&auml;. Suotakoon siis Jannelle viel&auml; viimeinen puolustus puheenvuoro, ja sen j&auml;lkeen voisi mielest&auml;ni keskustelun lopettaa kokonaan, sill&auml; se vain lietsoo ristiriitaisuutta Sakuun, ja t&auml;t&auml; kautta lukijaankin.<BR><BR>
Ihmettelen hieman Klemolan kommenttia: <I>"En koskaan ole saanut kiitosta ty&ouml;st&auml;ni"</I>, sill&auml; varmasti olen lukenut sakusta palautetta, jossa ollaan kiitelty j&auml;rjestelm&auml;ohjelmointi kursseista, ja pyydetty sit&auml; jopa lis&auml;&auml;kin. Ymm&auml;rr&auml;n kyll&auml; kantasi Lincwareen, mutta montakos kertaa olet sielt&auml; tavaraa tilannut? Minulle he ovat joka kerta toimittaneet tavarat alle viikossa. Edellytt&auml;en tietenkin ett&auml; heill&auml; on tavaraa varastossa.<BR><BR>
Yhdistyksen rahan k&auml;yt&ouml;st&auml; kirjoittaessasi olit kyll&auml; oikeassa. Mielest&auml;ni 500markkaa oli t&auml;ysin uskomaton summa musiikkikilpailun voitosta, verraten, ett&auml; sinne meni melkein kymmenen j&auml;senen, joita niit&auml;k&auml;&auml;n nyt ei koskaan tarpeeksi ole, vuosimaksut...<BR><BR>
Ja liikkeist&auml; kun nyt puhutaan, niin lis&auml;isin viel&auml; Anu Seilosen kirjeeseen Com2001:st&auml;, ett&auml; silmiin pisti my&ouml;s, ett&auml; Web Direct ainakin jossain mainoksissaan myi Amiga-pelej&auml;, jotka olivat tuotantoa vuosilta '93-'94 viel&auml; '96 mainoksissaan, joten eiv&auml;t he n&auml;k&ouml;j&auml;&auml;n kaikkea sielt&auml; nurkista pois myyneet... :)<BR><BR>
Ja sitten viel&auml; muutama ehdotus:<BR><BR>
<B>1)</B> Olisiko liian paljon vaadittu, ett&auml; <CODE>SakuXX.run</CODE> paketti sis&auml;lt&auml;isi oman hakemiston? T&auml;m&auml; kun on nyky&auml;&auml;n enemm&auml;nkin s&auml;&auml;nt&ouml; kuin poikkeus kaikissa paketeissa. Tied&auml;n kyll&auml;, ett&auml; tuon parhaiten purkaa nopeasti lha:n komentorivill&auml;, mutta monet kun suoraan k&auml;ytt&auml;v&auml;t sit&auml; vain exe-tiedostona, niin olisi ihan k&auml;tev&auml;&auml;, ett&auml; tuo tiedosto loisi oman hakemiston, eik&auml; sotkisi tiedostoja pitkin download-hakemistoa.<BR><BR>
<B>2)</B> Mitenk&auml;s olisi erillinen palsta lehte&auml; koskevalle keskustelulle, sek&auml; palautteelle, ja toinen koneilua koskeville kysymyksille?<BR><BR>
Kas n&auml;in. Hyv&auml;t kev&auml;&auml;t ja jatkot kaikille Amigisteille!<BR>
<BLOCKQUOTE><I>Valtteri Murto</I></BLOCKQUOTE>
<HR width=40% size=1 align=CENTER><BR>
</FONT><FONT SIZE=5>K</FONT><FONT SIZE=3>
iitoksia kommenteista. Sakun levityspaketeista sen verran, ett&auml; ne on ajateltu siten ett&auml; aloittelevakin osaisi itse purkaa paketteja disketille. Siksi niihin ei ole pakattu mukaan hakemistoa, koska Saku ei t&auml;ll&ouml;in toimisi disketilt&auml;. Pidemm&auml;lle ehtinyt k&auml;ytt&auml;j&auml; joka omistaa kiintolevyn ja haluaa pit&auml;&auml; sen j&auml;rjestyksess&auml;, osaa varmasti my&ouml;s luoda hakemistoja. Kun levityspaketin kopioi luotuun hakemistoon ja ajaa siell&auml;, purkautuu lehti asiallisesti omaan hakemistoonsa eik&auml; sotke v&auml;&auml;r&auml;&auml; hakemistoa. Erillisi&auml; palstoja voidaan pit&auml;&auml; sen mukaan miten niille tulee postia. Postipalsta on ollut viimeaikoina paikoitellen laajakin, jolloin olisi aivan perusteltua jakaa se osastoihin. Kiitos ehdotuksista!<BR>
<BLOCKQUOTE><I>Esa Heikkinen</I></BLOCKQUOTE>
<TABLE WIDTH=100%>
<TR><TD ALIGN=RIGHT><A HREF="Postipalsta.html"><I>Paluu takaisin postipalstalle</I></A></TD></TR>
</TABLE>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
