<HTML>
<HEAD>
<TITLE>Taajuusalue</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Taajuusalue</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Esa Heikkinen</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER>
<CENTER>
<TABLE WIDTH=100% BORDER=0>
<TR>
 <TD WIDTH=45% ALIGN=RIGHT>
   <!-- 3 --><FONT SIZE=2 FACE="Arial">Edellinen: <A HREF="Taivaalta3.html"><I>Reilut 100 kanavaa...</I></A></FONT>
 </TD>
 <TD WIDTH=10%>
 <CENTER>
   <!-- index --><FONT SIZE=2 FACE="Arial">| <A HREF="TaivaaltaIndex.html"><I>Sis&auml;lt&ouml;</I></A> |</FONT>
 </CENTER>
 </TD>
 <TD WIDTH=45%>
   <!-- 5 --><FONT SIZE=2 FACE="Arial">Seuraava: <A HREF="Taivaalta5.html"><I>Radiol&auml;hetyksi&auml;</I></A></FONT>
 </TD>
</TR>
</TABLE>
</CENTER>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>S</FONT><FONT SIZE=3>
atelliittien taajuusalueita on k&auml;yt&ouml;ss&auml; useita:<BR>
<BLOCKQUOTE>
<PRE><B>S-alue:</B>   <I>1700 - 3000 MHz</I>
<B>C-alue:</B>   <I>3700 - 4200 MHz</I>
<B>Ku-alue:</B>  <I>10,7 - 12,7 GHz</I>
<B>Ka-alue:</B>  <I>18,0 - 20,0 GHz</I></PRE>
</BLOCKQUOTE>
Ven&auml;l&auml;iset ja amerikkalaiset k&auml;ytt&auml;v&auml;t laajalti nk. C-aluetta, joka sijaitsee 4 GHz:n molemmin puolin. S-aluetta ja Ka-aluetta ei k&auml;ytet&auml; nyky&auml;&auml;n liiemmin tv-l&auml;hetyksiss&auml;, joten keskitymme t&auml;ss&auml; artikkelissa ainoastaan Ku-alueen vastaanottoon: sielt&auml; l&ouml;ytyy ylivoimaisesti suurin ohjelmatarjonta ja kiinnostavimmat kanavat. Ku-alueen vastaanottolaitteisto on my&ouml;s helpoimmin ja edullisimmin itse toteutettavissa.<BR><BR>
Satelliittil&auml;hetysten taajuusalueen ollessa laaja mahtuu mukaan suuri joukko kanavia ilman ett&auml; niiden kaistanleveytt&auml; tarvitsee merkitt&auml;v&auml;sti rajoittaa. Analogisissa satelliittil&auml;hetyksiss&auml; on k&auml;yt&ouml;ss&auml; p&auml;&auml;s&auml;&auml;nt&ouml;isesti 27 MHz kaistanleveys per kanava (tavallisen tv-l&auml;hetysten kaistanleveys on noin 5 MHz). Siten jokaisen tv-l&auml;hetyksen mukana voi olla maksimissaan jopa 10 &auml;&auml;nikanavaa, ja koska yhden tv-l&auml;hetyksen &auml;&auml;ni stereonakaan ei vaadi enemp&auml;&auml; kuin kaksi &auml;&auml;nikanavaa, j&auml;&auml; jokaisen tv-l&auml;hetyksen mukaan tilaa radiokanaville! Joillakin tv-kanavilla (kuten EuroSport) on &auml;&auml;nikanavat hy&ouml;dynnetty selostuksen l&auml;hett&auml;miseen monella eri kielell&auml;.<BR><BR>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
