<HTML>
<HEAD>
<TITLE>Viihdett&auml; taivaalta</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Viihdett&auml; taivaalta</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Esa Heikkinen</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER>
<CENTER>
<TABLE WIDTH=100% BORDER=0>
<TR>
 <TD WIDTH=45% ALIGN=RIGHT>
   <!-- muut --><FONT SIZE=2 FACE="Arial">Takaisin: <A HREF="Muut2.html"><I>Muut</I></A></FONT>
 </TD>
 <TD WIDTH=10%>
 <CENTER>
   <!-- index --><FONT SIZE=2 FACE="Arial">| <A HREF="TaivaaltaIndex.html"><I>Sis&auml;lt&ouml;</I></A> |</FONT>
 </CENTER>
 </TD>
 <TD WIDTH=45%>
   <!-- 1 --><FONT SIZE=2 FACE="Arial">Seuraava: <A HREF="Taivaalta1.html"><I>Kolme kanavaa liian v&auml;h&auml;n?</I></A></FONT>
 </TD>
</TR>
</TABLE>
</CENTER>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>T</FONT><FONT SIZE=3>
&auml;m&auml; juttu on jatkoa aiemmin kirjoittamilleni kotiteatteriin ja videokirjastoon liittyville artikkeleille. Idea t&auml;h&auml;n juttuun on kytenyt jo useita kuukausia, mutta olen pid&auml;tellyt ideaa v&auml;h&auml;n kuin pahan p&auml;iv&auml;n varalle ajan puutteessa. Nyt oli oikea aika laatia t&auml;m&auml; juttu, kun Sakun juttusis&auml;lt&ouml; n&auml;ytti varsin ohuelta - onpahan nyt ainakin yksi juttu lis&auml;&auml;, ja olen lehden kasauksen ohessa yritt&auml;nyt parantaa lehden sis&auml;lt&ouml;&auml; edes hieman. Ainakin Sakunetin k&auml;ytt&auml;j&auml;t arvaavat jo otsikosta, ett&auml; t&auml;m&auml; juttu k&auml;sittelee oman satelliitti-tv-j&auml;rjestelm&auml;n rakentamista, asiasta kun on ollut sivumennen juttua Sakunetiss&auml; muutamaan otteeseen. Kommentoikaa, ellette halua lukea t&auml;m&auml;ntyyppisi&auml; juttuja en&auml;&auml; jatkossa!<BR><BR>
Tekstin tarkoitus olisi innostaa yh&auml; useampi lukija rakentamaan oma satelliitti-tv-j&auml;rjestelm&auml;, sill&auml; lis&auml;kanavien n&auml;kyviin saaminen ei ole kallista tiedett&auml;, jonka vain ammattimiehet osaavat, vaan laitteiston voi l&auml;hes kuka tahansa kasata itse jopa muutaman sadan markan sijoituksilla, eik&auml; satelliittien etsiminen taivaalta ole mik&auml;&auml;n millintarkka homma kuten yleisesti luullaan, vaan kuvan voi saada n&auml;kyviin jopa muutamassa minuutissa, kunhan osaa oikealla tavalla etsi&auml;!<BR><BR>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
