<HTML>
<HEAD>
<TITLE>Lautaset</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Lautaset</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Esa Heikkinen</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER>
<CENTER>
<TABLE WIDTH=100% BORDER=0>
<TR>
 <TD WIDTH=45% ALIGN=RIGHT>
   <!-- 11 --><FONT SIZE=2 FACE="Arial">Edellinen: <A HREF="Taivaalta11.html"><I>Ent&auml;p&auml; mikrop&auml;&auml;?</I></A></FONT>
 </TD>
 <TD WIDTH=10%>
 <CENTER>
   <!-- index --><FONT SIZE=2 FACE="Arial">| <A HREF="TaivaaltaIndex.html"><I>Sis&auml;lt&ouml;</I></A> |</FONT>
 </CENTER>
 </TD>
 <TD WIDTH=45%>
   <!-- 13 --><FONT SIZE=2 FACE="Arial">Seuraava: <A HREF="Taivaalta13.html"><I>Asennus</I></A></FONT>
 </TD>
</TR>
</TABLE>
</CENTER>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>J</FONT><FONT SIZE=3>
oskus vanhoina FidoNet-aikoinani lueskelin jonkun helsinkil&auml;isen kirjoittelavan siit&auml;, kun h&auml;n rakensi satelliittilautasen itse kattilan kannesta. N&auml;m&auml; olivat niit&auml; aikoja, kun Sirius-satelliitti l&auml;hetti eritt&auml;in suurella teholla, jolloin l&auml;hete n&auml;kyi jo varsin olemattomilla varusteilla. Nyky&auml;&auml;n minimi lautasen koko, jota kannattaa harkita on 45 cm, ja t&auml;m&auml;kin p&auml;tee vain etel&auml;ss&auml;. J&auml;lleen valintaan vaikuttaa ratkaisevasti se mit&auml; aikoo katsoa. Alle 1,5-metristen lautasten hinnoissa ei kuitenkaan ole j&auml;risytt&auml;v&auml;n suuria hintaeroja, joten liian pient&auml; ei kannata hankkia, vaan mietti&auml; pikemminkin sit&auml;, ett&auml; j&auml;tt&auml;&auml; itselleen mahdollisuuden siirty&auml; esimerkiksi Eutelsatin ilmaiskanaviin, mik&auml;li maksullinen tarjonta ja ainaiset kuukausimaksut alkavat kyll&auml;stytt&auml;&auml;. Suositeltavat lautasen koot on mainittu edell&auml; eri satelliittisuuntien yhteydess&auml;.<BR><BR>
Satelliittilautasia on kahta tyyppi&auml;. Vanhemmat sek&auml; yli 1,5-metriset lautaset ovat poikkeuksetta nk. prime focus -lautasia, jotka tunnistaa siit&auml;, ett&auml; mikrop&auml;&auml; on sijoitettu tarkalleen lautasen keskipisteeseen ja lautanen itse on suunnattu yl&auml;viistoon taivaalle. Uudemman tyyppiset sek&auml; pienemm&auml;t lautaset ovat nk. offset-tyyppisi&auml;. N&auml;m&auml; lautaset ovat liev&auml;sti soikioita ja mikrop&auml;&auml; on sijoitettu lautasen eteen melko lailla alas yleens&auml; tukevan varren varaan. Lautanen itse on suunnattu enemm&auml;nkin maahan kuin taivaalle p&auml;in, koska offset-lautasessa heijastus tapahtuu kulmassa, ei suoraan.<BR><BR>
Molempiin lautastyyppeihin on olemassa omat mikrop&auml;&auml;ns&auml; eik&auml; niit&auml; voi k&auml;ytt&auml;&auml; ristiin. Kummankin tyyppiset lautaset ovat suhteessa l&auml;hes yht&auml; tehokkaita. Offset-tyyppist&auml; lautasta alkaa kuitenkin arvostaa, kun tulee ensimm&auml;inen talvi. Lautasen pysty olemus nimitt&auml;in aiheuttaa sen, ettei siihen tartu lainkaan lumi, ei kovallakaan lumisatella. Prime focus -lautasen omistaja taas saa varata varrellisen harjan talveksi lautasen l&auml;heisyyteen, jos mielii katsoa ohjelmia, sill&auml; yl&ouml;sp&auml;in suunnattu lautanen ottaa kiusallisen herk&auml;sti lunta itseens&auml;, eik&auml; t&auml;ll&ouml;in n&auml;y mit&auml;&auml;n. Isot lautaset ovat kuitenkin aina prime focus -tyyppi&auml;. Suurimmat tapaamani offsetit ovat luokkaa 1,3 metri&auml;, ja sellainen tuosta omaltakin parvekkeelta l&ouml;ytyy k&auml;&auml;ntyvine jalustoineen.<BR><BR>
K&auml;&auml;ntyv&auml;&auml; lautasta saattaa kaivata harrastaja, joka haluaa poimia taivaalta kaikki Suomessa n&auml;kyv&auml;t satelliittil&auml;hetykset suuntaan katsomatta. Satelliitit sijaitsevat taivaalla nk. geostationaarisella radalla, jossa maan painovoima kumoaa keskipakovoiman ja satelliitit py&ouml;riv&auml;t tarkalleen maan py&ouml;rimisliikkeen mukana ja pysyv&auml;t maasta katsoen paikallaan. T&auml;m&auml; alue muodostaa taivaalle ohuen "clarken vy&ouml;ksi" kutsutun kaarevan alueen, jonka tarkkaan seurantaan sivusuunnassa riitt&auml;&auml; varsin yksinkertainen lautasen kiinnitystapa, jota nimitet&auml;&auml;n polarmount-jalustaksi. Moottori liikuttaa lautasta sivusuunnassa edestakaisin ja oikein s&auml;&auml;detyt kulmat jalustan akselistossa aiheuttavat sen, ett&auml; lautasen polttopiste siirtyy taivaalla t&auml;sm&auml;lleen clarken vy&ouml;t&auml; seuraten, jolloin on mahdollista valita useamman satelliitin joukosta kulloinkin haluttu.<BR><BR>
K&auml;&auml;nt&ouml;moottori on itseasiassa vain vet&auml;v&auml; ja ty&ouml;nt&auml;v&auml; "tunkki", joka py&ouml;riess&auml;&auml;n l&auml;hett&auml;&auml; liikkeeseen verrannollista pulssia takaisinp&auml;in erillisi&auml; kontrollijohtimia pitkin. Kun moottori liitet&auml;&auml;n erilliseen moottorinohjaimeen, voidaan ohjaimen muistiin ohjelmoida eri satelliittien paikat, jolloin satelliitin vaihto k&auml;y helposti. Kalleimmissa satelliittivirittimiss&auml; voi olla moottorinohjain sis&auml;isen&auml;kin, jolloin j&auml;rjestelm&auml; on t&auml;ydellinen - vaihtaessasi kanavaa k&auml;&auml;ntyy lautanen tarvittaessa toiseen satelliittiin, kaikki k&auml;y kaukos&auml;&auml;timell&auml; sohvalla nojaillen!<BR><BR>
Edellisen kaltainen t&auml;ydellinen k&auml;&auml;ntyv&auml; j&auml;rjestelm&auml; nostaa kuitenkin koko j&auml;rjestelm&auml;n hintaa melko paljon, joten jos ei ole tarvetta kuin kahdelle satelliittisuunnalle (esimerkiksi 1&#176; West ja 13&#176; East), on halvempaa hankkia kaksi erillist&auml; lautasta ja mikrop&auml;&auml;t&auml;, mik&auml;li n&auml;iden asentamiselle ei ole muuta estett&auml;. L&auml;hes kaikissa satelliittivirittimiss&auml; on nimitt&auml;in antennisis&auml;&auml;nmenot ainakin kahdelle lautaselle. Yhteen lautaseen on my&ouml;s mahdollista asentaa useampia mikrop&auml;it&auml; ns. sivusy&ouml;tt&ouml;in&auml;, mutta t&auml;m&auml; tapa vaimentaa jonkin verran signaalin voimakkuutta ja onkin siten k&auml;ytt&ouml;kelpoinen l&auml;hinn&auml; Etel&auml;-Suomessa.<BR><BR>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
