<HTML>
<HEAD>
<TITLE>Salaukset</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Salaukset</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Esa Heikkinen</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER>
<CENTER>
<TABLE WIDTH=100% BORDER=0>
<TR>
 <TD WIDTH=45% ALIGN=RIGHT>
   <!-- 6 --><FONT SIZE=2 FACE="Arial">Edellinen: <A HREF="Taivaalta6.html"><I>Monenlaista normia</I></A></FONT>
 </TD>
 <TD WIDTH=10%>
 <CENTER>
   <!-- index --><FONT SIZE=2 FACE="Arial">| <A HREF="TaivaaltaIndex.html"><I>Sis&auml;lt&ouml;</I></A> |</FONT>
 </CENTER>
 </TD>
 <TD WIDTH=45%>
   <!-- 8 --><FONT SIZE=2 FACE="Arial">Seuraava: <A HREF="Taivaalta8.html"><I>T&auml;rkeimm&auml;t suunnat</I></A></FONT>
 </TD>
</TR>
</TABLE>
</CENTER>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>M</FONT><FONT SIZE=3>
aksulliset kanavat l&auml;hetet&auml;&auml;n salattuina, jolloin niiden katseluun tarvitaan kyseist&auml; salausta purkava dekooderi sek&auml; voimassa oleva &auml;lykortti. Euroopassa yleisin salaus, johon MAC-virittimen omistaja t&ouml;rm&auml;&auml;, on EuroCrypt. EuroCrypt-salauksessa jokainen juova katkaistaan satunnaisesti 256:sta eri mahdollisuudesta ja puolikkaat vaihdetaan kesken&auml;&auml;n. Salattua kuvaa on siten mahdotonta seurata. Katkaisukohdat lasketaan satunnaislukugeneraattorilla, jonka siemenarvoksi annetaan muutaman sekunnin v&auml;lein vaihtuva tv-aseman l&auml;hett&auml;m&auml; salattu koodi. Koodit on salattu DES-salausalgoritmilla, ja salauksen purkamisen hoitaa &auml;lykortti. Kortissa itsess&auml;&auml;n on sarjanumero, jonka avulla tv-asema voi s&auml;&auml;dell&auml; jokaisen asiakkaansa korttia erikseen. Aina kun katselumaksua maksetaan, p&auml;ivittyy kortille tiedot voimassaoloajasta. Tiedot p&auml;ivitet&auml;&auml;n, kun kyseisen kanavan l&auml;hetyst&auml; katsellaan, ts. maksutiedot v&auml;littyv&auml;t satelliitin kautta ohjelman ohessa. Jos voimassaoloaika t&auml;yttyy ilman ett&auml; uutta maksua on maksettu, lopettaa kortti kyseisen kanavan salauksen purkamisen. MAC-virittimess&auml;/dekooderissa on yleens&auml; v&auml;hint&auml;&auml;n kaksi kortinlukijaa eri maksukortteja varten.<BR><BR>
Viime aikoina EuroCrypt-salauksen tehokkuutta ovat heikent&auml;neet myynniss&auml; olevat piraattikortit, jotka purkavat salauksen useilta eri kanavilta ilman ett&auml; kanavia tarvitee edes tilata itselleen. My&ouml;s Internet on pullollaan t&auml;llaisten korttien eri versioita ja rakenteluohjeita. Kortin voi periaatteessa rakentaa helposti kuka tahansa, jolla on tietokone k&auml;yt&ouml;ss&auml;&auml;n. N&auml;m&auml; kortit eiv&auml;t luonnollisestikaan v&auml;lit&auml; maksutiedoista mit&auml;&auml;n, vaan avaavat kanavan kuin kanavan loputtomiin asti, kunnes l&auml;hetysp&auml;&auml;ss&auml; tehd&auml;&auml;n muutoksia salaukseen. Muutokset eiv&auml;t kuitenkaan yleens&auml; auta: muutaman p&auml;iv&auml;n tai viikon kuluttua saa esimerkiksi Internetist&auml; tai kortin myyj&auml;lt&auml; muutaman numerokoodin, joilla kortti saadaan taas ajan tasalle ja maksullinen autuus n&auml;kyy j&auml;lleen ilmaiseksi.<BR><BR>
Koska piraattikatselu on r&auml;j&auml;hdysm&auml;isesti yleistynyt viime aikoina, eiv&auml;t tv-asemat katsele touhua sivusta: menett&auml;v&auml;th&auml;n he siin&auml; suuria summia rahaa, joskin asiaa kannattaisi punnita my&ouml;s silt&auml; puolelta, ett&auml; jos katselumaksut olisivat kohtuullisia, ei kenenk&auml;&auml;n kannattaisi hankkia piraattikorttia! Niinp&auml; monet kanavat ovat ryhtyneet kehittelem&auml;&auml;n uusia salausmenetelmi&auml; piraattikatselun est&auml;miseksi. EuroCrypt asettaa kuitenkin menetelmille omat rajansa: salaus on aina murrettavissa, mutta se ottaa aikansa. Internetist&auml; l&ouml;ytyy esimerkiksi suuri joukko tietokoneen k&auml;ytt&auml;ji&auml;, jotka etsiv&auml;t avaimia omilla tietokoneillaan. Kehittyneimm&auml;t ohjelmat kokeilevat jopa yli 500000 avainta sekunnissa, ja kun t&auml;llaista ohjelmaa ajetaan useilla sadoilla (kenties tuhansilla) koneilla, on selv&auml;&auml;, ett&auml; avain l&ouml;ytyy joskus.<BR><BR>
Tv-asemat tosin ly&ouml;v&auml;t ennemmin tai my&ouml;hemmin takaisin aika-ajoin vaihdettavalla &auml;lykortilla, jossa on esimerkiksi joka p&auml;iv&auml;lle eri salausavain. N&auml;in nopeasti ei kukaan viel&auml; pysty murtamaan avaimia, ja jos edell&auml;kuvatun kaltainen kortti yleistyy, merkinnee se loppua piraattikatselulle - ainakin toistaiseksi. Menetelm&auml; on kuitenkin varsin kallis tv-asemille - esimerkiksi kuukausittain uusittavat kortit kaikille asiakkaille ovat pitk&auml; penni - mutta niin ovat my&ouml;s piraattikorttien vuoksi menetetyt katselumaksut. My&ouml;s piraattikorttibisneksess&auml; py&ouml;riv&auml;t ammattilaispiireiss&auml; isot rahat, joten suojausten hakkerointiperinne tulee tuskin koskaan katoamaan t&auml;ysin: uusia suojauksia yritet&auml;&auml;n aina murtaa ja ennemmin tai my&ouml;hemmin joku voi l&ouml;yt&auml;&auml; heikon kohdan. Internet toimii tehokkaana tiedonlevitt&auml;j&auml;n&auml; aiheeseen liittyvine uutisryhmineen, joten tieto mahdollisesta onnistuneesta salauksenmurrosta ja sen yksityiskohdista levi&auml;&auml; ymp&auml;ri maailman hetkess&auml;.<BR><BR>
Pitk&auml;lti Internetin vuoksi monet tv-asemat ovat joutuneet ahdinkoon piraattikatselun takia. Kun maksulliset tv-l&auml;hetykset &auml;lykortteineen aikoinaan alkoivat, ei kukaan voinut kuvitellakaan, ett&auml; salauksen purkukotikonstein olisi mill&auml;&auml;n lailla mahdollista. Nyky&auml;&auml;n on taas enemm&auml;nkin itsest&auml;&auml;nselvyys, ett&auml; kanavia katsotaan ilman kuukausimaksuja. Er&auml;s satelliittilaitteita myyv&auml; kauppias totesi kerran, ett&auml; laitteiden myynti on kasvanut r&auml;j&auml;hdysm&auml;isesti piraattikorttien tultua ja hankintakynnys on nyt alempi, kun ei mene kuukausimaksuja. Aika n&auml;ytt&auml;&auml;, mit&auml; tulemavaisuus tuo tullessaan, mutta toistaiseksi koodisota hakkereiden ja tv-asemien v&auml;lill&auml; on jatkunut kiivaana.<BR><BR>
Paras ratkaisu piraattikatselun v&auml;hent&auml;miseksi olisi j&auml;rjestelm&auml;n tarjoaman PayPerView-ominaisuuden ottaminen k&auml;ytt&ouml;&ouml;n. T&auml;ss&auml; j&auml;rjestelm&auml;ss&auml; katsoja maksaa ainoastaan niist&auml; ohjelmista, jotka haluaa katsoa. T&auml;ll&ouml;in turhasta ei laskuteta ja salaus purkautuu vain tilatuista ohjelmista. T&auml;ss&auml; vaiheessa motiivi salausten murtamiseen ja samalla piraattikorttien markkinat varmasti pienenisiv&auml;t. Tokihan itse kukin maksaa juuri mieleisest&auml;&auml;n ohjelmasta mieluummin kuin maksaa kuukaudesta toiseen korkeita katselumaksuja eik&auml; saa vastineeksi riitt&auml;v&auml;sti mieleist&auml;&auml;n ohjelmaa. PayPerView-ominaisuus on ollut olemassa MAC-j&auml;rjestelm&auml;ss&auml; alusta alkaen, mutta tv-asemien politiikassa on jotakin todella pahasti vialla, kun t&auml;t&auml; ominaisuutta ei k&auml;ytet&auml;! Milt&auml; tuntuisi maksaa esimerkiksi puhelimesta joka kuukausi sama summa (oletetaan t&auml;ss&auml; ett&auml; korkea summa, tuhansia markkoja), riippumatta siit&auml; mink&auml; verran olet soittanut?<BR><BR>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
