<HTML>
<HEAD>
<TITLE>Monenlaista normia</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Monenlaista normia</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Esa Heikkinen</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER>
<CENTER>
<TABLE WIDTH=100% BORDER=0>
<TR>
 <TD WIDTH=45% ALIGN=RIGHT>
   <!-- 5 --><FONT SIZE=2 FACE="Arial">Edellinen: <A HREF="Taivaalta5.html"><I>Radiol&auml;hetyksi&auml;</I></A></FONT>
 </TD>
 <TD WIDTH=10%>
 <CENTER>
   <!-- index --><FONT SIZE=2 FACE="Arial">| <A HREF="TaivaaltaIndex.html"><I>Sis&auml;lt&ouml;</I></A> |</FONT>
 </CENTER>
 </TD>
 <TD WIDTH=45%>
   <!-- 7 --><FONT SIZE=2 FACE="Arial">Seuraava: <A HREF="Taivaalta7.html"><I>Salaukset</I></A></FONT>
 </TD>
</TR>
</TABLE>
</CENTER>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>A</FONT><FONT SIZE=3>
migan k&auml;ytt&auml;jist&auml; varmasti jokainen tuntee tv-normit PAL ja NTSC. Helposti luulisi, ett&auml; kun pelataan satelliittilaitteiden kanssa, joudutaan n&auml;iden samojen tuttujen normien kanssa tekemisiin. N&auml;in ei kuitenkaan ole. NTSC-l&auml;hetyksi&auml; ei Suomessa ole mahdollista vastaanottaa, koska amerikkalaiset satelliitit j&auml;&auml;v&auml;t pahasti horisontin taakse. Mutta l&ouml;ytyy sit&auml; normeja Euroopastakin, joten seuraavaksi luomme lyhyen katsauksen erityyppisiin tv-normeihin.<BR><BR>
<B>PAL-l&auml;hetys:</B><BR><BR>
T&auml;m&auml; on ylivoimaisesti yleisin l&auml;hete, jota Suomessa on mahdollista vastaanottaa. Kuva- ja &auml;&auml;nikanavat l&auml;hetet&auml;&auml;n kaikki taajuusmoduloituina omina kantoaaltoinaan 27 MHz kaistassa. Huomattavin ero tavalliseen tv-l&auml;hetykseen on nimenomaan taajuusmodulaation k&auml;ytt&ouml;. Pintal&auml;hetyksiss&auml; k&auml;ytet&auml;&auml;n nimitt&auml;in amplitudimodulaatiota (AM) kuvainformaation v&auml;litt&auml;miseen, ja t&auml;m&auml;n vuoksi l&auml;hetys on herkk&auml; kaikenlaisille kipin&auml;h&auml;iri&ouml;ille. Satelliittil&auml;hetyksiss&auml; ei luonnollisesti ole mit&auml;&auml;n edellisen kaltaisia h&auml;iri&ouml;it&auml;, mutta kuva kyll&auml; kipin&ouml;i, jos signaali on heikko esimerkiksi liian pienen lautasen tai huonon s&auml;&auml;n vuoksi.<BR><BR>
<B>D2MAC-l&auml;hetys:</B><BR><BR>
T&auml;m&auml; l&auml;hetetyyppi on yleisin l&auml;hinn&auml; pohjoismaissa. D2MAC ja sen laajempi versio DMAC soveltuvat parhaiten maksullisten tv-ohjelmien v&auml;litt&auml;miseen, koska j&auml;rjestelm&auml;ss&auml; on tehokkaat salausominaisuudet vakiona. MAC-l&auml;hete on analogisen ja digitaalisen l&auml;hetteen sekoitus, jossa analoginen kuvasignaali on multipleksoitu kukin komponentti erilliseksi paketikseen, jotka v&auml;litet&auml;&auml;n ajallisesti per&auml;kk&auml;in. Tavallisessa televisiol&auml;hetyksess&auml;h&auml;n esimerkiksi v&auml;ri- ja mustavalkoinformaatio kulkevat samaa signaalitiet&auml; sekoitettuina kesken&auml;&auml;n. MAC on t&auml;ss&auml; suhteessa edell&auml;, sill&auml; l&auml;hetett&auml;ess&auml; kuvasta erotetaan mustavalko- ja v&auml;ri-informaatiot joka tv-juovasta, mink&auml; j&auml;lkeen ne l&auml;hetet&auml;&auml;n ajallisesti per&auml;kk&auml;in kahtena pakettina, ja n&auml;iden lis&auml;ksi jokainen MAC-juova sis&auml;lt&auml;&auml; digitaalipaketin, jossa on &auml;&auml;nikanavat (maksimissaan 8 digitaalista &auml;&auml;nikanavaa), teksti-tv sek&auml; ohjauskoodeja mm. salauksenpurkua ja korttien voimassaolotietoja varten. Digitaalipaketti sis&auml;lt&auml;&auml; my&ouml;s monenlaista tietoa l&auml;hetett&auml;v&auml;st&auml; ohjelmasta ja mm. kuvasuhteen. L&auml;hetykset voivat olla normaalia television 4:3 kuvaruutukokoa taikka elokuvan alkuper&auml;ist&auml; 16:9 kuvasuhdetta.<BR><BR>
<B>Digitaaliset l&auml;hetykset, MPEG:</B><BR><BR>
Taivaalta tulee my&ouml;s monenlaista digitaalil&auml;hetett&auml;. Esimerkiksi t&auml;ll&auml; hetkell&auml; monella suunnalla mainostettu DSTV on kokonaan digitaalinen tv-j&auml;rjestelm&auml;, jonka kanavat l&auml;hetet&auml;&auml;n MPEG-datavirtana. Lis&auml;ksi taivaalta l&ouml;ytyy kymmeni&auml; digitaalisia radiokanavia, joiden vastaanottoon tarvitaan erillinen esim. ADR- tai DSR-tyyppinen vastaanotin sek&auml; maksukortti. Digitaalisen j&auml;rjestelm&auml;n etu analogisiin verrattuna on sen pieni kaistanleveyden tarve: yhden analogisen kanavan viem&auml;&auml;n kaistaan mahtuu jopa kymmeni&auml; digitaalisia kanavia, riippuen hieman laadusta. Digitaalisten kanavien l&auml;hett&auml;minen on siten halvempaa kuin perinteisen analogisen, koska satelliitista ei tarvitse vuokrata niin paljon tilaa per kanava.<BR><BR>
J&auml;rjestelm&auml;ss&auml; on kuitenkin my&ouml;s puutteita. H&auml;vi&ouml;llinen MPEG-s&auml;&auml;st&ouml;koodaus on kyll&auml;kin parhaimmillaan kuvanlaadultaan parempi kuin analogiset kanavat, mutta valitettavasti ohjelmantarjoajille on j&auml;tetty mahdollisuus vaikuttaa itse kuvan laatuun. Mit&auml; parempi kuva, sit&auml; suurempi datavirta ja sit&auml; kalliimmat l&auml;hetyskustannukset - jokainen arvaa helposti, mit&auml; t&auml;st&auml; seuraa: hyv&auml;laatuista MPEG-l&auml;hetett&auml; ei taivaalta helposti l&ouml;ydy, ja useimmat kanavat j&auml;&auml;v&auml;t laadultaan huonommiksi kuin perinteiset analogiset kanavat. J&auml;rjestelm&auml;n suomia mahdollisuuksia ei nykyisell&auml;&auml;n k&auml;ytet&auml; kunnolla hy&ouml;dyksi. T&auml;m&auml; uusi j&auml;rjestelm&auml; n&auml;ytt&auml;&auml;kin olevan viel&auml; lapsenkengiss&auml;&auml;n, joten ehk&auml; kannattaa viel&auml; odotella muutama vuosi ennen n&auml;iden laitteiden hankkimista. Satelliittimaailma on kuitenkin tulevaisuudessa digitaalista, eli ennemmin tai my&ouml;hemmin joutuu MPEG-kuvaan tyytym&auml;&auml;n, ellei sit&auml; ennen keksit&auml; parempilaatuista vaihtoehtoa.<BR><BR>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
