<HTML>
<HEAD>
<TITLE>Asennus</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Asennus</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Esa Heikkinen</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER>
<CENTER>
<TABLE WIDTH=100% BORDER=0>
<TR>
 <TD WIDTH=45% ALIGN=RIGHT>
   <!-- 12 --><FONT SIZE=2 FACE="Arial">Edellinen: <A HREF="Taivaalta12.html"><I>Lautaset</I></A></FONT>
 </TD>
 <TD WIDTH=10%>
 <CENTER>
   <!-- index --><FONT SIZE=2 FACE="Arial">| <A HREF="TaivaaltaIndex.html"><I>Sis&auml;lt&ouml;</I></A> |</FONT>
 </CENTER>
 </TD>
 <TD WIDTH=45%>
   <!-- 14 --><FONT SIZE=2 FACE="Arial">Seuraava: <A HREF="Taivaalta14.html"><I>Kanavia viritt&auml;m&auml;&auml;n!</I></A></FONT>
 </TD>
</TR>
</TABLE>
</CENTER>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>K</FONT><FONT SIZE=3>
aikkia viritin- ja lautasmalleja kattavaa asennusopasta on minun mahdotonta tehd&auml;, mutta seuraavassa lyhyt kuvaus, jonka perusteella alkava harrastaja saanee taivaalta jotakin n&auml;kyviin pienell&auml; vaivalla ilman kompassia, astemittaa, laskinta ja kulmakaavoja. Kaikki mit&auml; tarvitaan on itse satelliittilaitteisto. Olen havainnut seuraavassa kuvailemani asennusmenettelyn helpoksi ja nopeaksi tavaksi saada kanavat n&auml;kyviin ilman erikoislaitteita. Menetelm&auml; edellytt&auml;&auml; kuitenkin, ett&auml; lautaseen on helppo p&auml;&auml;st&auml; k&auml;siksi samalla kun on mahdollista n&auml;hd&auml; vastaanotettu tv-kuva. Joissakin tapauksissa t&auml;m&auml; saattaa tiet&auml;&auml; television ja virittimen raahaamista pihalle puutarhap&ouml;yd&auml;n nurkalle...<BR><BR>
Aluksi t&auml;ytyy hoitaa kaapeloinnit. Kaapeloinneissa on k&auml;ytett&auml;v&auml; satelliittij&auml;rjestelm&auml;&auml;n soveltuvaa koaksiaalikaapelia, yleens&auml; nk. "foam"-koaksiaali soveltuu mainiosti. Tavallinen "antennijohtokin" toimii vaihtelevalla menestyksell&auml; ja sit&auml; voi koemieless&auml; k&auml;ytt&auml;&auml;, jos esimerkiksi pysyv&auml;ksi aiotun kaapeloinnin reitti on viel&auml; ep&auml;selv&auml;. Kaapelin kumpaankin p&auml;&auml;h&auml;n hankitaan asianmukaiset liittimet, joita kutsutaan F-liittimiksi. Liitin on varsin yksinkertainen holkki, jossa on kierteet sis&auml;pinnalla. Koaksiaalikaapelin keskijohdin kuoritaan paljaaksi noin sentin alueelta ja sen ymp&auml;rill&auml; oleva metallisukka samoin. F-liitin kierret&auml;&auml;n tiukasti sukan ymp&auml;rille, ja jos kaapeli on ohutta, voi ymp&auml;rill&auml; sukan taivuttaa kuoren p&auml;&auml;lle ennen liittimen kiinnitt&auml;mist&auml;. Joka tapauksessa F-liitin on k&auml;ytt&ouml;valmis, kun keskijohdin j&auml;&auml; noin 5 mm liittimen mutteripuolelta n&auml;kyviin eik&auml; se tavoita miss&auml;&auml;n kohtaa liittimen runko-osaa taikka suojasukkaa. Kun liittimet on py&ouml;ritetty johdon p&auml;ihin, voidaan johdon p&auml;&auml;t ruuvata virittimeen ja mikrop&auml;&auml;h&auml;n kiinni.<BR><BR>
<B><I>HUOMIO:</I></B> Lopullisessa asennuksessa tulee mikrop&auml;&auml;n puolelle F-liittimen ja johdon p&auml;&auml;lle py&ouml;ritt&auml;&auml; muutaman sentin alue itsevulkanoituvaa eristysteippi&auml; siten, ettei ulkona oleva liitos joudu mill&auml;&auml;n lailla tekemisiin veden tai kosteuden kanssa!! T&auml;ss&auml; pit&auml;&auml; olla huolellinen, sill&auml; jos liittimen sis&auml;lle p&auml;&auml;see vett&auml;, sy&ouml;pyy liitos nopeasti rikki, koska koaksiaalikaapelissa kulkee my&ouml;s mikrop&auml;&auml;n k&auml;ytt&ouml;j&auml;nnite!<BR><BR>
Ennen kanava-asetuksia on virittimen k&auml;ytt&ouml;ohje kanavien virityksen osalta luettava huolellisesti, jotta s&auml;&auml;styt&auml;&auml;n kenties tuntienkin turhalta ty&ouml;lt&auml;. Kuva tulee n&auml;kyviin vasta kun joka ikinen kanavaa koskeva asetus virittimest&auml; on kohdallaan ja lautanen suunnassaan. Siten on osattava virittimen asetukset ja k&auml;ytt&ouml;, ennen kuin taivaalta aletaan etsi&auml; mit&auml;&auml;n.<BR><BR>
Sy&ouml;t&auml; virittimeen taajuustaulukosta jokin tunnettu kanava, jolla on vahva l&auml;hete. Voit k&auml;ytt&auml;&auml; esimerkiksi THORin kanavia suunnasta 1&#176; West, mik&auml;li olet suuntaamassa sinne lautasta, taikka jotakin RAIUNO/RAIDUE/RAITRE-kanavista, jos olet suuntaamassa lautasta 13&#176; Eastiin. N&auml;m&auml; ovat ko. suuntien vahvimpia kanavia. Suunnassa 5&#176; East ovat kaikki kanavat voimakkaita, ja t&auml;m&auml;n suunnan moni l&ouml;yt&auml;&auml;kin ensimm&auml;isen&auml; 1&#176; Westiin t&auml;ht&auml;illess&auml;&auml;n. Mik&auml;li valitsit salatun kanavan, aseta &auml;lykortti valmiiksi paikoilleen, jotta n&auml;kisit heti signaalin l&ouml;ydetty&auml;si, mik&auml; kanava on kyseess&auml;. Tarkista viel&auml; kerran, ett&auml; kaikki asetukset (taajuus, polarisaatio, mikrop&auml;&auml;n asetukset) ovat varmasti oikein ennen kuin alat etsi&auml;. Joissakin kotimaisissa virittimiss&auml; on suuntausapu, jolla kaiuttimista saa kuulumaan &auml;&auml;nitaajuuden, joka muuttuu signaalin mukaan. T&auml;m&auml;n avulla on melko helppo l&ouml;yt&auml;&auml; satellittien paikat, mutta joskus vinku voi johtaa pahasti harhateille.<BR><BR>
Ennen kuin kiinnit&auml;t mit&auml;&auml;n mihink&auml;&auml;n tai poraat reiki&auml;, on syyt&auml; kokeilla, onko aiottu lautasen paikka vastaanottoon sopiva. VARSINKIN, jos pihapiiriss&auml; on puita, joutuu lautasen paikan etsim&auml;&auml;n kokeilemalla. Mene paikalle, johon olet aikonut kiinnitt&auml;&auml; lautasen, ota lautanen k&auml;siisi ja osoita sill&auml; suurinpiirtein lounaaseen (olettaen tietenkin, ett&auml; lautasesi on helposti liikuteltavan kokoinen ja painoinen). Offset-lautasta suunnatessasi osoita lautasella hieman alaviistoon ja ala sen j&auml;lkeen tehd&auml; lievi&auml; liikkeit&auml; vaakasuunnassa edestakaisin ja samalla seuraa tv:ss&auml; olevaa kohinaa. Nosta pystykulmaa hitaasti joka vaakaheilautuksella hieman yl&ouml;sp&auml;in, kunnes saat eloa tv-ruutuun. Kun jotakin l&ouml;ytyy, etsi nopeasti sivusuunnassa paras mahdollinen signaali. T&auml;m&auml;n j&auml;lkeen voit varovasti muutella pystykulmaa, mink&auml; tuloksena l&auml;hes puhdas kuva pit&auml;isi tulla n&auml;kyviin. Kun olet l&ouml;yt&auml;nyt tavoittelemasi kanavan, n&auml;et itse k&auml;yt&auml;nn&ouml;ss&auml;, onnistuuko lautasen kiinnitys suunnittelemaasi paikkaan.<BR><BR>
Varsinaisessa kiinnitysvaiheessa voit toimia samalla periaatteella, eli etsi ensin vaakasuunta kohdalleen ja s&auml;&auml;d&auml; lopuksi pystykulma. Kirist&auml; pultteja hieman mutta ei viel&auml; loppuun asti, ja kokeile s&auml;&auml;t&auml;&auml; virittimest&auml; kanavan taajuutta n&auml;hd&auml;ksesi, saatko kuvaa viel&auml;kin paremmaksi. Varsinkin vanhojen ja halvempien mikrop&auml;iden paikallisoskillaattorit voivat heitt&auml;&auml; usealla MHz:lla, samoin itse virittimien taajuusn&auml;yt&ouml;t, joten kanavan paras vastaanottotaajuus ei ole v&auml;ltt&auml;m&auml;tt&auml; sama kuin taajuustaulukossa. Joissakin virittimess&auml; voi s&auml;&auml;t&auml;&auml; "offset"-arvon, jolla n&auml;ytt&auml;m&auml;virhe saadaan kalibroitua ja taajuusn&auml;ytt&ouml; tarkaksi. Kun olet s&auml;&auml;t&auml;nyt taajuuden kohdalleen, voit viel&auml; kokeilla hienos&auml;&auml;t&auml;&auml; lautasen suuntausta, josko saisit kuvaa viel&auml;kin paremmaksi. Viimeisimm&auml;n silauksen lautasen suuntaukseen saat, kun etsit jonkin heikomman kanavan ja suuntaat sen avulla kuvan mahdollisimman hyv&auml;ksi. 1&#176; West -suunnassa hienos&auml;&auml;t&ouml;&ouml;n sopii esimerkiksi 3+ (11.977 GHz) ja 13&#176; East -suunnassa Vivat.<BR><BR>
Lopuksi kiinnit&auml; pultit siten, ett&auml; lautanen pysyy tuulessakin hyvin suunnassaan, kuitenkaan katkaisematta pultteja. Kun teet lopullista kiristyst&auml;, tarkkaile kuvan laatua tai testisignaalia, ettei lautanen p&auml;&auml;se liikkumaan t&auml;ss&auml; vaiheessa. Jos lautanen on kiinni mastoputkessa esimerkiksi perinteisesti kahdella mutterilla kiristett&auml;v&auml;ll&auml; pannalla, pyri kirist&auml;m&auml;&auml;n kumpaakin mutteria vuoron per&auml;&auml;n siten, ettei lautanen p&auml;&auml;se k&auml;&auml;ntym&auml;&auml;n sivusuunnassa ep&auml;tasaisen kiristyksen tuloksena.<BR><BR>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
