<HTML>
<HEAD>
<TITLE>Kanavia viritt&auml;m&auml;&auml;n!</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Kanavia viritt&auml;m&auml;&auml;n!</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Esa Heikkinen</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER>
<CENTER>
<TABLE WIDTH=100% BORDER=0>
<TR>
 <TD WIDTH=45% ALIGN=RIGHT>
   <!-- 13 --><FONT SIZE=2 FACE="Arial">Edellinen: <A HREF="Taivaalta13.html"><I>Asennus</I></A></FONT>
 </TD>
 <TD WIDTH=10%>
 <CENTER>
   <!-- index --><FONT SIZE=2 FACE="Arial">| <A HREF="TaivaaltaIndex.html"><I>Sis&auml;lt&ouml;</I></A> |</FONT>
 </CENTER>
 </TD>
 <TD WIDTH=45%>
   <!-- alku --><FONT SIZE=2 FACE="Arial">Alkuun: <A HREF="Taivaalta.html"><I>Viihdett&auml; taivaalta!</I></A></FONT>
 </TD>
</TR>
</TABLE>
</CENTER>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>K</FONT><FONT SIZE=3>
un lautanen on lopullisesti asetettu, voidaan aloittaa tutustuminen laajentuneeseen tv-tarjontaan. Kanavat voi viritt&auml;&auml; vallan mainiosti itse etsim&auml;ll&auml;, varsinkin jos virittimess&auml; on automaattihaku. K&auml;yd&auml;&auml;n vain l&auml;pi sek&auml; H- ett&auml; V-polarisaatioilla kaikki taajuusalueet, jotka mikrop&auml;&auml;ll&auml; on mahdollista vastaanottaa. Joku voi taas pit&auml;&auml; enemm&auml;n valmiin taulukon kanssa viritt&auml;misest&auml;, eli katsoa suoraan taulukosta taajuudet ja sy&ouml;tt&auml;&auml; ne virittimeen. Taajuustaulukko on toki hyv&auml; olla olemassa, jotta voisi varmistaa kaikkien mahdollisten kanavien l&ouml;ytymisen.<BR><BR>
Taajuustaulukosta n&auml;kee my&ouml;s k&auml;tev&auml;sti &auml;&auml;nikantoaallot, jotka pit&auml;&auml; viritt&auml;&auml; PAL-kanaville erikseen. Joidenkin kanavien mukana tulee extrana radiokanavia, ja n&auml;iden &auml;&auml;nikantoaaltotaajuudet l&ouml;ytyv&auml;t my&ouml;s taajuuslistasta. Yleisimmin PAL-kanavien mono&auml;&auml;ni l&auml;hetet&auml;&auml;n joko kantoaaltotaajuudella 6,60 tai 6,65 MHz. Stereo&auml;&auml;ni taas tulee yleisimmin 7,02 MHz vasen ja 7,20 MHz oikea. N&auml;ill&auml; asetuksilla pit&auml;isi l&auml;hes kanavan kuin kanavan &auml;&auml;ni alkaa kuulua. Muita taajuuspareja stereol&auml;hetyksille (esimerkiksi radiol&auml;hetyksille) ovat 7,38/7,56, 7,74/7,92, 8,10/8,28. Ž&auml;nikantoaallot voivat sis&auml;lt&auml;&auml; my&ouml;s useita monol&auml;hetteit&auml;.<BR><BR>
Kulloinkin ajan tasalla olevan taajuustaulukon l&ouml;yt&auml;&auml; k&auml;tevimmin Internetist&auml;, ftp:ll&auml; osoitteesta <A HREF="ftp://login.dknet.dk/"><I>ftp://login.dknet.dk</I></A>, hakemisto <A HREF="ftp://login.dknet.dk/pub/husted/"><I>pub/husted/</I></A> ja sielt&auml; tiedosto <A HREF="ftp://login.dknet.dk/pub/husted/satellit.zip"><I>satellit.zip</I></A>. Osoitteeseen p&auml;&auml;see my&ouml;s www-selaimen avulla.<BR><BR>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
