<HTML>
<HEAD>
<TITLE>Ent&auml;p&auml; mikrop&auml;&auml;?</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Ent&auml;p&auml; mikrop&auml;&auml;?</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Esa Heikkinen</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER>
<CENTER>
<TABLE WIDTH=100% BORDER=0>
<TR>
 <TD WIDTH=45% ALIGN=RIGHT>
   <!-- 10 --><FONT SIZE=2 FACE="Arial">Edellinen: <A HREF="Taivaalta10.html"><I>Millainen viritin?</I></A></FONT>
 </TD>
 <TD WIDTH=10%>
 <CENTER>
   <!-- index --><FONT SIZE=2 FACE="Arial">| <A HREF="TaivaaltaIndex.html"><I>Sis&auml;lt&ouml;</I></A> |</FONT>
 </CENTER>
 </TD>
 <TD WIDTH=45%>
   <!-- 12 --><FONT SIZE=2 FACE="Arial">Seuraava: <A HREF="Taivaalta12.html"><I>Lautaset</I></A></FONT>
 </TD>
</TR>
</TABLE>
</CENTER>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>M</FONT><FONT SIZE=3>
ikrop&auml;&auml; (k&auml;ytet&auml;&auml;n my&ouml;s nimityst&auml; taajuusmuunnin) on se komponentti, johon lautasen ker&auml;&auml;m&auml; satelliitin mikroaaltol&auml;hete kohdistetaan. Mikrop&auml;&auml; on sijoitettu tarkasti lautasen polttopisteeseen. Mikrop&auml;&auml; rakentuu aaltoputkeen sijoitetusta antennista, joka ker&auml;&auml; mikroaaltos&auml;teilyn; polarisaattorista, jolla valitaan joko vaaka- tai pystypolarisaatio sek&auml; varsinaisesta taajuusmuunninosasta, jolla 10,7 - 12,7 GHz taajuusalue muunnetaan alemmalle taajuusalueelle (750 - 2100 MHz), jolloin se voidaan sy&ouml;tt&auml;&auml; koaksiaalikaapelia pitkin virittimelle. Yli 10 GHz taajuudet eiv&auml;t kulkisi lainkaan tavallista koaksiaalikaapelia pitkin sellaisenaan.<BR><BR>
Pudotustaajuuden m&auml;&auml;r&auml;&auml; mikrop&auml;&auml;n paikallis (local-) oskillaattori, jonka taajuus on joko 9,750 GHz, 10 GHz, 10,05 GHz, 10,6 GHz tai 10,750 GHz hieman tyypist&auml; riippuen. Mikrop&auml;&auml; siis v&auml;hent&auml;&auml; l&auml;hetystaajuudesta oman oskillaattorinsa taajuuden, ts. jos katsomme esimerkiksi FilmNet 1 -kanavaa THOR-satelliitista ja taajuus on 12,091 GHz, saamme 10,600 GHz paikallisoskillaattorilla varustetulta mikrop&auml;&auml;lt&auml; kyseisen kanavan ulos 1491 MHz taajuudella.<BR><BR>
Miksi sitten mikrop&auml;it&auml; on saatavilla n&auml;in monella erilaisella oskillaattorilla? Vastaus l&ouml;ytyy virittimest&auml;. Tyypillisen virittimen virityskaista on minimiss&auml;&auml;n luokkaa 900 - 2000 MHz eli v&auml;hint&auml;&auml;n 1100 MHz. Kun taas laskemme, ett&auml; taivaalta tulee ohjelmaa taajuusv&auml;lill&auml; 10,7 - 12,7 GHz, merkitsee t&auml;m&auml; noin 2000 MHz leve&auml;&auml; kaistaa - viritin ei siis pysty sellaisenaan vastaanottamaan kaikkia kanavia! Sen vuoksi eri satelliittien vastaanottoon on tarkoitettu erityyppiset mikrop&auml;&auml;t. Eutelsat-kanavat sijaitsevat alhaisilla taajuuksilla, jolloin Eutelsat-k&auml;ytt&ouml;&ouml;n on paras 9,750 GHz paikallisoskillaattorilla varustettu mikrop&auml;&auml;, koska sill&auml; voi vastaanottaa kaikki PAL-kanavat vaivatta mill&auml; tahansa virittimell&auml;. Jos sen sijaan yritt&auml;isimme katsoa em. mikrop&auml;&auml;ll&auml; aiemmin mainittua FilmNet 1 -kanavaa THORista, saisimme vastaanottotaajuudeksi 12,091 GHz - 9,750 GHz = 2341 MHz, joka j&auml;&auml; normaalin satelliittivastaanottimen virityskaistan ulkopuolelle sen lis&auml;ksi, ettei mikrop&auml;&auml;k&auml;&auml;n anna en&auml;&auml; ulos kunnolla n&auml;in korkeita taajuuksia. T&auml;m&auml;n vuoksi THOR-satelliitin katsomiseen on valittava korkeammalla paikallisoskillaattorilla (10,6 GHz tai 10,75 GHz) varustettu mikrop&auml;&auml;.<BR><BR>
Ent&auml;p&auml; jos halutaan vastaanottaa my&ouml;s muita suunnassa 1&#176; West olevia satelliitteja kuin THORia, ja esimerkiksi INTELSATin alimmille kanaville (TNT/Cartoon: 11,002 GHz) on 10,600 GHz paikallistaajuus liian korkea (11,002 GHz - 10,600 GHz = 402 MHz)? T&auml;h&auml;nkin ongelmaan l&ouml;ytyy helppo ratkaisu, eik&auml; edes tarvitse ostaa kahta erillist&auml; mikrop&auml;&auml;t&auml;. Nykyaikaiset nk. "universal"-tyyppiset mikrop&auml;&auml;t sis&auml;lt&auml;v&auml;t kaksi eri paikallisoskillaattoria, tyypillisesti 9,750 GHz ja 10,600 GHz. K&auml;ytt&auml;j&auml; voi kanavan mukaan valita k&auml;ytt&ouml;&ouml;n kumman tahansa ja t&auml;ll&auml; tavoin haravoida koko Ku-alueen helposti katsottavakseen!<BR><BR>
T&auml;ss&auml;kin asiassa on silti yksi mutta: viritin. Mikrop&auml;&auml;n oskillaattoritaajuutta nimitt&auml;in vaihdetaan antamalla mikrop&auml;&auml;lle antennijohtoa my&ouml;ten 22 kHz &auml;&auml;niohjaus (nk. "tone"), jolloin mikrop&auml;&auml; valitsee ylemm&auml;n (10,600 GHz) oskillaattorin k&auml;ytt&ouml;&ouml;n. Virittimen on oltava sellaista tyyppi&auml;, jotta se kykenee antamaan kyseisen ohjauksen mikrop&auml;&auml;lle. Uudemmissa virittimiss&auml; ominaisuus on vakiona, vanhempiin joutuu hankkimaan erillisen v&auml;lirasian, joka liitet&auml;&auml;n virittimen ja mikrop&auml;&auml;n v&auml;lille antennijohtoon. T&auml;m&auml; rasia kehitt&auml;&auml; 22 kHz tonen, kun sille sy&ouml;tet&auml;&auml;n 12V j&auml;nnite. Joissakin virittimiss&auml; on nk. CTRL-ulostulo, josta 12V j&auml;nnitteen olemassaoloa voi s&auml;&auml;dell&auml; jopa kanavakohtaisesti, jolloin j&auml;rjestelm&auml;n saa toimimaan t&auml;ysin kaukos&auml;&auml;t&ouml;isesti. Viritint&auml; ostettaessa kannattaa selvitt&auml;&auml;, onko laitteessa tone-ominaisuus, mik&auml;li aikoo k&auml;ytt&auml;&auml; viritint&auml; muuhunkin kuin Eutelsatin katseluun ja hankkia t&auml;t&auml; varten universal-mikrop&auml;&auml;n.<BR><BR>
Polarisaatioista oli jo asiaa aiempana. Moni lukija ehk&auml; havaitsi, ett&auml; mikrop&auml;&auml;ksi kannattaa valita normaali HV-polarisaattorilla varustettu, koska se vastaanottaa my&ouml;s kierrel&auml;hetteet polarisaatioista riippumatta. N&auml;in samalla mikrop&auml;&auml;ll&auml; voi vastaanottaa enemm&auml;n kanavia, sill&auml; esimerkiksi THOR-satelliitin l&auml;hett&auml;m&auml;t kierrel&auml;hetteet ovat eritt&auml;in voimakkaita ja n&auml;kyv&auml;t siten vaivatta ilman kierrepolarisoivaa mikrop&auml;&auml;t&auml;. Tyypilliselle mikrop&auml;&auml;lle kerrotaan polarisaatio muuttamalla mikrop&auml;&auml;n k&auml;ytt&ouml;j&auml;nnitett&auml;. T&auml;ll&ouml;in voidaan puhua nk. "volttiohjatusta" mikrop&auml;&auml;st&auml;, jolloin satelliittivirittimen asennusvalikosta valitaan polarisaation ohjaukseksi valinta "volt". Ohjaus menee luonnollisesti samaa johtoa pitkin kuin k&auml;ytt&ouml;j&auml;nnite ja tuleva signaalikin, eli ulos tarvitsee vet&auml;&auml; vain yksi koaksiaalikaapeli virittimest&auml; mikrop&auml;&auml;h&auml;n.<BR><BR>
Toinen polarisaattorimahdollisuus on erillinen, nk. "magneettinen" polarisaattori, joka lis&auml;t&auml;&auml;n erillisen&auml; komponenttina mikrop&auml;&auml;n "nokkaan". Mikrop&auml;&auml; on t&auml;ll&ouml;in vain yht&auml; polarisaatiota vastaanottava, ja j&auml;nnitteell&auml; voi olla mahdollista vaihtaa esimerkiksi paikallisoskillaattorin taajuutta. T&auml;ss&auml; tapauksessa ulos joudutaan vet&auml;m&auml;&auml;n antennijohdon lis&auml;ksi kaksi johdinta polarisaattoria varten. Lis&auml;ksi virittimess&auml; tulee olla liit&auml;nt&auml; magneettiselle polarisaattorille. K&auml;yt&auml;nn&ouml;ss&auml; aloitteleva harrastelija ei kuitenkaan t&ouml;rm&auml;nne t&auml;m&auml;nkaltaiseen mikrop&auml;&auml;h&auml;n ellei osta isoa prime focus -tyyppist&auml; lautasta (kts. kohta lautaset seuraavana) taikka erityisen vanhaa k&auml;ytetty&auml; satelliittipakettia. Mikrop&auml;&auml;t maksavat mallista riippuen kolmesta sadasta markasta yl&ouml;sp&auml;in (offset-lautasiin).<BR><BR>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
