<HTML>
<HEAD>
<TITLE>Millainen viritin?</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Millainen viritin?</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Esa Heikkinen</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER>
<CENTER>
<TABLE WIDTH=100% BORDER=0>
<TR>
 <TD WIDTH=45% ALIGN=RIGHT>
   <!-- 9 --><FONT SIZE=2 FACE="Arial">Edellinen: <A HREF="Taivaalta9.html"><I>Polarisaatiot</I></A></FONT>
 </TD>
 <TD WIDTH=10%>
 <CENTER>
   <!-- index --><FONT SIZE=2 FACE="Arial">| <A HREF="TaivaaltaIndex.html"><I>Sis&auml;lt&ouml;</I></A> |</FONT>
 </CENTER>
 </TD>
 <TD WIDTH=45%>
   <!-- 11 --><FONT SIZE=2 FACE="Arial">Seuraava: <A HREF="Taivaalta11.html"><I>Ent&auml;p&auml; mikrop&auml;&auml;?</I></A></FONT>
 </TD>
</TR>
</TABLE>
</CENTER>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>E</FONT><FONT SIZE=3>
nnen virittimen hankkimista tulee mietti&auml;, mit&auml; haluaa taivaalta katsoa. T&auml;rkein virittimen hankintaan vaikuttava seikka on, tarvitaanko mahdollisuutta vastaanottaa maksullisia DMAC/D2MAC-l&auml;hetyksi&auml; vai riitt&auml;&auml;k&ouml; ilmaisten PAL-kanavien tarjonta. MAC-dekooderin voi ostaa my&ouml;hemminkin, joten ellei ole varma, miten harrastus etenee, kannattaa hankkia aluksi edullinen PAL-viritin!<BR><BR>
Koska kyseess&auml; on t&auml;ysin analoginen l&auml;hetys, ovat pelkk&auml;&auml;n PAL-vastaanottoon tarkoitetut satelliittivastaanottimet halpoja. Hinnat liikkuvat parista sadasta markasta noin reiluun tuhanteen markkaan. PAL-viritin antaa ulos televisioon sopivan RF-signaalin sek&auml; CVBS-komposiittikuvasignaalin, jota voi sy&ouml;tt&auml;&auml; useimpiin televisioihin scart-liittimen kautta. Stereo&auml;&auml;nelle on yleens&auml; erilliset RCA-liittimet. Joihinkin televisioihin saa lis&auml;varusteena sis&auml;isesti asennettavan satelliittivirittimen. N&auml;m&auml; ovat yleens&auml; PAL-virittimi&auml;. T&auml;m&auml;ntyyppist&auml; viritint&auml; kannattaa kuitenkin v&auml;ltt&auml;&auml;, sill&auml; t&auml;rke&auml;t ominaisuudet kuten virityskaista ovat n&auml;iss&auml; usein turhan suppeita. Lis&auml;ksi j&auml;rjestelm&auml;n laajentaminen my&ouml;hemmin esimerkiksi MAC-dekooderilla tai moottorinohjaimella voi olla jopa mahdotonta.<BR><BR>
DMAC/D2MAC-l&auml;hetysten vastaanottoon tarvittavat &auml;lykortinlukijalla varustetut MAC-satelliittivirittimet maksavat noin kahdesta tuhannesta markasta yl&ouml;sp&auml;in. K&auml;ytettyj&auml; saa edullisimmin 1000-1500 markkaan. MAC-dekoodereita saa siis my&ouml;s erikseen, jolloin jo olemassaolevaan PAL-vastaanottolaitteistoon voi lis&auml;t&auml; MAC-vastaanottomahdollisuuden. Erilliset dekooderit maksavat noin 1000-3000 markkaa laadusta riippuen ja voivat my&ouml;s monessa tapauksessa olla ominaisuuksiltaan ja kuvanlaadultaan parempia kuin kuin vastaanottimeen integroidut, jolloin huippuluokan PAL-virittimen omistajat voivat hankkia laitteen oheen huippulaatuisen MAC-dekooderin. Lis&auml;ksi erillislaitteistolla saavutetaan sekin etu, ett&auml; MAC-dekooderin rikkoutuessa j&auml;&auml;v&auml;t PAL-kanavat k&auml;ytt&ouml;&ouml;n.<BR><BR>
MAC-dekooderit ovat varsin kuumina k&auml;yvi&auml; laitteita niiss&auml; tapahtuvan reaaliaikaisen kuvasignaalin k&auml;sittelyn takia, ja siten ne my&ouml;s ovat herkimmin vikaantuvia osia satelliittilaitteistossa. Erillinen dekooderi liitet&auml;&auml;n hyviss&auml; PAL-vastaanottimissa helposti yhdell&auml; scart-johtimella sille varattuun scart-liittimeen. PAL-viritin sy&ouml;tt&auml;&auml; dekooderille nk. baseband-signaalia, josta dekooderi purkaa kuvasignaalin ja &auml;&auml;nikanavat. MAC-virittimet/dekooderit ovat my&ouml;s liit&auml;nn&ouml;ilt&auml;&auml;n PAL-laitteita monipuolisempia. Kunnollisessa MAC-dekooderissa tai virittimess&auml; on normaalien kuval&auml;ht&ouml;jen (RF ja CVBS) lis&auml;ksi my&ouml;s RGB-komponenttivideo ja Y/C-tyyppinen S-VHS-videol&auml;ht&ouml;. N&auml;iden ansiosta laitteiden kuvanlaatu voi ylitt&auml;&auml; merkitt&auml;v&auml;stikin perinteiset tv-l&auml;hetykset. Lopullinen kuvanlaatu riippuu kuitenkin dekooderista itsest&auml;&auml;n, sill&auml; MAC-dekoodereissa jos miss&auml; on AD- ja DA-muuntimia ja muita komponentteja, joilla k&auml;sitell&auml;&auml;n itse kuvasignaalia, ja t&auml;ll&ouml;in dekooderin laatu (ja hinta) on suoraan verrannollinen kuvan laatuun.<BR><BR>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
