<HTML>
<HEAD>
<TITLE>Reilut 100 kanavaa...</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Reilut 100 kanavaa...</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Esa Heikkinen</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER>
<CENTER>
<TABLE WIDTH=100% BORDER=0>
<TR>
 <TD WIDTH=45% ALIGN=RIGHT>
   <!-- 2 --><FONT SIZE=2 FACE="Arial">Edellinen: <A HREF="Taivaalta2.html"><I>Ehk&auml; sittenkin kaapeli-tv?</I></A></FONT>
 </TD>
 <TD WIDTH=10%>
 <CENTER>
   <!-- index --><FONT SIZE=2 FACE="Arial">| <A HREF="TaivaaltaIndex.html"><I>Sis&auml;lt&ouml;</I></A> |</FONT>
 </CENTER>
 </TD>
 <TD WIDTH=45%>
   <!-- 4 --><FONT SIZE=2 FACE="Arial">Seuraava: <A HREF="Taivaalta4.html"><I>Taajuusalue</I></A></FONT>
 </TD>
</TR>
</TABLE>
</CENTER>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>S</FONT><FONT SIZE=3>
atelliittiv&auml;litys on siis teknisesti ylivoimaisin tapa v&auml;litt&auml;&auml; korkealaatuista televisiokuvaa jopa useilla &auml;&auml;niraidoilla varustettuna. Silti t&auml;ss&auml;kin j&auml;rjestelm&auml;ss&auml; on merkitt&auml;vi&auml; ongelmia. Ehk&auml; pahin ongelma, joka pudottaa hyvin suuren joukon katsojista pois, on se, ett&auml; tarkka "n&auml;k&ouml;yhteys" satelliittiin tiettyyn taivaan kohtaan on oltava olemassa. Edess&auml; ei saa olla rakennuksia, ei mets&auml;&auml; - ei edes yksitt&auml;ist&auml; puuta. Esimerkiksi kerrostalossa asuvalla on tuuria, jos on parveke etel&auml;&auml;n tai l&auml;nteen p&auml;in ja mahdollisuus satelliittilautasen kiinnitt&auml;miseen. Hankalissa taloyhti&ouml;iss&auml; voi omien antennien kiinnitys olla kielletty&auml;, jolloin hienosti alkanut suunnitelma lis&auml;kanavista kuolee heti alkuunsa ja ainoa ratkaisu olisi asuinpaikan vaihto tai n&ouml;yrtyminen ja luopuminen koko ajatuksesta.<BR><BR>
L&auml;hes koko Suomen alueella on mahdollista vastaanottaa yli 100 tv-kanavaa ja useita kymmeni&auml; radiokanavia kohtuullisilla laitteilla, jotka t&auml;ss&auml; yhteydess&auml; tarkoittavat enint&auml;&auml;n 1,3 - 1,5 metrin satelliittilautasta varustettuna laajakaistaisella Ku-alueen (10,7 - 12,7 GHz) mikrop&auml;&auml;ll&auml;. Rannikkoalueilla l&auml;nness&auml; sek&auml; Etel&auml;-Suomessa vastaanottokelpoisten kanavien m&auml;&auml;r&auml; voi nousta merkitt&auml;v&auml;stikin taikka tarvittavan lautasen koko pienenty&auml;. Kaikki kanavat eiv&auml;t kuitenkaan ole k&auml;ytt&ouml;kelpoisia, koska taivaalta tulee ohjelmaa hyvin moneen maahan. Esimerkiksi turkkilaisia, arabialaisia, unkarilaisia jne. kanavia viitsii harvempi suomalainen katsoa.<BR><BR>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
