<HTML>
<HEAD>
<TITLE>Ehk&auml; sittenkin kaapeli-tv?</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=70% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>Ehk&auml; sittenkin kaapeli-tv?</I></B></FONT></TD>
  <TD WIDTH=30% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Esa Heikkinen</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER>
<CENTER>
<TABLE WIDTH=100% BORDER=0>
<TR>
 <TD WIDTH=45% ALIGN=RIGHT>
   <!-- 1 --><FONT SIZE=2 FACE="Arial">Edellinen: <A HREF="Taivaalta1.html"><I>Kolme kanavaa liian v&auml;h&auml;n?</I></A></FONT>
 </TD>
 <TD WIDTH=10%>
 <CENTER>
   <!-- index --><FONT SIZE=2 FACE="Arial">| <A HREF="TaivaaltaIndex.html"><I>Sis&auml;lt&ouml;</I></A> |</FONT>
 </CENTER>
 </TD>
 <TD WIDTH=45%>
   <!-- 3 --><FONT SIZE=2 FACE="Arial">Seuraava: <A HREF="Taivaalta3.html"><I>Reilut 100 kanavaa...</I></A></FONT>
 </TD>
</TR>
</TABLE>
</CENTER>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>K</FONT><FONT SIZE=3>
enties jollain on jo kaapeli-tv-liittym&auml; ja sen kautta saatava tarjonta tyydytt&auml;&auml; kaikki tarpeet. Omalla lautasella on kuitenkin etuja kaapeli-tv-j&auml;rjestelmiin n&auml;hden. Merkitt&auml;vimm&auml;t edut k&auml;yt&ouml;n kannalta ovat voittamaton kuvan- ja &auml;&auml;nenlaatu, jotka ovat satelliittil&auml;hetyksiss&auml; l&auml;hes poikkeuksetta paremmat kuin "maan pinnalla" v&auml;litett&auml;viss&auml; tv-l&auml;hetyksiss&auml;. Kaapeli j&auml;&auml; t&auml;ss&auml; suhteessa viel&auml; huonommaksi, ja syytkin ovat selke&auml;t: kilometreitt&auml;in tien poskeen vedetty kaapeli huonontaa v&auml;kisinkin kuvanlaatua, eik&auml; v&auml;hiten pituutensa vuoksi vaan my&ouml;s siksi, ett&auml; samaan kaapeliin tungetaan todella paljon ohjelmaa kuitenkin varsin vaatimattomalla taajuusalueella.<BR><BR>
Taajuusalueen laajennus loputtomiin ei ole mahdollista, koska UHF-l&auml;hetykset eiv&auml;t etene pitki&auml; matkoja kaapelitse. Esimerkiksi kerrostalojen yhteisantenneissa muutetaan UHF-alueella l&auml;hetett&auml;v&auml;t TV2- ja MTV3-kanavat VHF-alueelle juuri t&auml;m&auml;n vuoksi. Niinp&auml; my&ouml;s kaapeli-tv-l&auml;hetykset ovat sidottuja suppealle VHF-alueelle, kunnes kuvan siirtoon aletaan k&auml;ytt&auml;&auml; valokuitua tai muuta tapaa, joka ei ole samalla tavalla h&auml;vi&ouml;llinen kuin koaksiaalikaapeli. Taajuusalueen suppeus rajoittaa my&ouml;s varsinaisten kanavien m&auml;&auml;r&auml;&auml; rankasti, ja kun yhdelle kanavalle varattu tila on minimaalisen pieni, ei kaikkiin kanaviin voida tarjota esimerkiksi NICAM-stereo&auml;&auml;nt&auml;, koska se vie enemm&auml;n kaistanleveytt&auml;. Lis&auml;ksi NICAM-enkooderit ovat kalliita laitteita joita kaapeli-tv yhti&ouml;t eiv&auml;t varmasti vapaaehtoisesti hanki.<BR><BR>
Tavallisissa maan pinnalla v&auml;litett&auml;viss&auml; tv-kanavissa on taas tutut vanhat ongelmat. Kuva voi helposti olla kohinainen, jos asuu loitommalla, ja lis&auml;ksi se ottaa helposti h&auml;iri&ouml;it&auml; esimerkiksi ohi ajavista puutteellisella h&auml;iri&ouml;nestolla varustetuista ajokeista (jokainen on varmasti n&auml;hnyt ko. kipin&auml;h&auml;iri&ouml;it&auml;). Jos taas asuu kaupungissa kivitalojen keskell&auml;, voi kuvaan muodostua varjokuvia, kun signaali heijastuu taloista ja tulee oikean suunnan lis&auml;ksi kaikuna esimerkiksi vastaanottoantennin takakeilasta. Lis&auml;ksi maallisissakin l&auml;hetyksiss&auml; on taajuuskaista rajoittava tekij&auml; - ei siksi, ett&auml; kanavilla olisi tunkua (mit&auml; nyt kokonaista kolme kanavaa, heh) vaan sen vuoksi, ettei UHF-signaali etene ilmassakaan pitki&auml; matkoja yht&auml; helposti kuin VHF-kanavat. Tarvitaan siis suuritehoisia l&auml;hettimi&auml; ja tihe&auml;&auml;n, jotta Suomenkin kokoisen maan asukkaille voitaisiin kaikille taata hyv&auml; televisiokuva.<BR><BR>
</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
