<HTML>
<HEAD>
<TITLE>X-Link v.34+</TITLE>
</HEAD>
<BODY background="Kuvat/Tausta.GIF" bgcolor="#ffffff" text="#000000" link="#109F00" vlink="#095200">

<TABLE WIDTH=100% BORDER=0>
<TR>
  <TD WIDTH=60% ALIGN=LEFT><FONT SIZE=5 FACE="Arial" color="#109f00"><B><I>X-Link v.34+</I></B></FONT></TD>
  <TD WIDTH=40% ALIGN=RIGHT><FONT SIZE=2><I><B>HtmlSaku #21, 12.4.1997</B></I></FONT><BR>
  <FONT SIZE=3><B>Kirjoittaja tuntematon</B></FONT></TD>
</TR>
</TABLE>
<HR width=100% size=2 align=CENTER><BR>
<FONT SIZE=5>M</FONT><FONT SIZE=3>
ikroilijalla on kolme suuretta, jotka eiv&auml;t koskaan ole liian suuria: muistin m&auml;&auml;r&auml;, kiintolevytilan m&auml;&auml;r&auml; sek&auml; modeemin siirtonopeus. Koska minulta kahta ensimm&auml;ist&auml; l&ouml;ytyi jo mielest&auml;ni tarpeeksi ja vanha Suprani alkoi osoittaa r&auml;j&auml;ht&auml;misen merkkej&auml;, p&auml;&auml;tin hankkia uuden modeemin.<BR><BR>
Kuten jokainen l&auml;hellek&auml;&auml;n kolmatta vuosikymment&auml; p&auml;&auml;ssyt tiet&auml;&auml;, opiskelijalla ei koskaan ole rahaa tarpeeksi, ja ne pienetkin summat on kulutettava hyvin tarkkaan. T&auml;st&auml;kin sain karvaan muistutuksen k&auml;yty&auml;ni hieman suuremmassa mikromyym&auml;l&auml;ss&auml;, jossa 33600 bps -nopeuksisen modeemin hinnaksi tarjottiin 1190 mk. Se siit&auml; helposta modeemin hankkimisesta, joten alkoi armoton pienempiin postimyyntifirmoihin soittelu mahdollisten supertarjousten per&auml;ss&auml;. Siin&auml;h&auml;n aika kului Hesarin ilmoituksia kaivellessa, kunnes kaverini vihjasi tilanneensa Lincwarelta X-Link-modeemin, joka pystyisi tuohon maagiseen 33600 bps nopeuteen, ja hintakin oli eritt&auml;in kohtuullinen, 680 mk. Soitto siis Lincwarelle, ja jo kahden p&auml;iv&auml;n kuluttua postilaatikkooni tuli ilmoitus paketin saapumisesta.<BR><BR>
Laatikko auki. Modeemi, virtal&auml;hde, ohjekirjat, t&auml;rkeimm&auml;t komennot sek&auml; Windows-ajureiden asennuslevyke - kaikki mit&auml; olin osannut odottaakin. Lis&auml;ksi l&ouml;ytyi viel&auml; muovinen tuki, jolla modeemin sai laitettua p&ouml;yd&auml;lle my&ouml;s pystyasentoon - hieno lis&auml;. Mink&auml;&auml;nlaisia koneen ja modeemin v&auml;lisi&auml; kaapeleita ei siis mukana tule, ja ne onkin hyv&auml; omata etuk&auml;teen, kuten my&ouml;s terminaaliohjelma.<BR><BR>
Ei siis muuta kuin johdot kiinni ja linjoille. Modeemin valojen tulkinnan opettelu vei aikansa, sill&auml; Suprassani ollut pistematriisin&auml;ytt&ouml; ilmaisi itse&auml;&auml;n paljon selke&auml;mmin kuin yhdeks&auml;n riviss&auml; olevaa l&auml;hes identtist&auml; punaista valoa. Hyvin alkaa: heti ensimm&auml;isell&auml; yrityksell&auml; 28800 bps yhteys, joka tuntui suorastaan lent&auml;miselt&auml; vanhaan 14400:aan verrattuna. Kaikki hyvin, kunnes yritin tiedoston siirtoa. ZModem ei edes suostunut aloittamaan l&auml;hetyst&auml;. Syyksi kuitenkin paljastui 8n1.device, joten serial.device tilalle, ja hyvin pelitti. Soittipa my&ouml;s kaverini uudella samanlaisella modeemillaan, ja mutkitta tuli 33600 yhteys. Siin&auml; vauhdissa data kirjaimellisesti lent&auml;&auml;.<BR><BR>
Modeemi toimii kohtuullisen hyvin perusasetuksillakin, vaikka l&auml;hetyksen t&auml;ydellinen kuntoon saaminen vaatiikin pient&auml; virittely&auml;. Baudrateksi 030/50:ll&auml; varustetussa koneessa laitoin 57600, joka lienee k&auml;yt&auml;nn&ouml;llisin t&auml;m&auml;n nopeuksisiin yhteyksiin. 115200:lla alkaa tulla jo Hardware overflow -virheit&auml;, ja kun NCommin tukemaa 76800:aa ei monikaan muu ohjelma tue, j&auml;&auml; 57600 l&auml;hes ainoaksi vaihtoehdoksi ellei satu omistamaan sarjakorttia.<BR><BR>
Yhteydet muodostuvat kohtuullisen nopeasti ja ovat suhteellisen luotettavia. L&auml;hes joka modeemin kanssa X-Link p&auml;&auml;see maksiminopeuteen, mutta esim. USRoboticsin 33600 bps (v.everything) -modeemien kanssa saadaan nopeudeksi vain 31200. Kaikkien Rockwellin piirisarjaa k&auml;ytt&auml;vien modeemien kanssa kuitenkin maksiminopeus on taattu. Pienen&auml; kummallisuutena joskus modeemi ik&auml;&auml;n kuin "j&auml;&auml; jumiin" jonnekin soitettaessa. T&auml;ll&ouml;in modeemi koko ajan v&auml;itt&auml;&auml; "busy", vaikka linja todellisuudessa olisikin jo jonkin aikaa ollut vapaa. T&auml;h&auml;n auttaa soittamisen hetkellinen keskeytt&auml;minen ja hetken p&auml;&auml;st&auml; normaalisti jatkaminen, mink&auml; j&auml;lkeen kaikki toimii aivan normaalisti. Muiden X-Linkin omistajien en kuitenkaan ole kuullut asiasta valittaneen, joten vika saattaa olla laitekohtainen.<BR><BR>
Jos X-linkist&auml; on pakko jotain negatiivista sanoa, niin ainakin virtakytkimen sijoittamista olisi voinut mietti&auml; toisenkin kerran. T&auml;llaisenaan se nimitt&auml;in on modeemin takapaneelissa RS-232-liittimen ja modeemin kuoren v&auml;liss&auml;, joten jos modeemin sijoittaa johonkin ahtaaseen tilaan, saa varautua todelliseen sormiakrobatiaan, jos modeemia haluaa v&auml;lill&auml; sammuttaa tai laittaa p&auml;&auml;lle.<BR><BR>
T&auml;llaiset pikku virheet eiv&auml;t kuitenkaan k&auml;ytt&ouml;&auml; haittaa, ja monet pit&auml;v&auml;t modeeminsa koko ajan p&auml;&auml;ll&auml;, jolloin virtanappikaan ei p&auml;&auml;se h&auml;iritsem&auml;&auml;n k&auml;ytt&ouml;&auml;. Hinnan ja laadun suhteeltaan modeemi on aivan omaa luokkaansa, ja sille my&ouml;nnet&auml;&auml;n kahden vuoden takuu.<BR><BR>
Ohessa taulukko keskim&auml;&auml;r&auml;isist&auml; siirtonopeuksista imuroitaessa 300 kt:n kokoista lha:lla pakattua tiedostoa:<BR>
<BLOCKQUOTE>
<I>X-Link v.34+<BR>
serial.device 37.4<BR>
xprzmodem.library 3.1<BR>
NComm 3.06<BR>
Amiga 1230/50 MHz</I><BR>
</BLOCKQUOTE>
<PRE>
<B>Yhteys:(bps) | ZModem (cps) | SModem (cps)
-------------+--------------+-------------</B>
14.400       <B>|</B> 1620         <B>|</B> 1730
28.800 	     <B>|</B> 2800-3100    <B>|</B> 3200-3400
33.600       <B>|</B> 3200-3300    <B>|</B> 3400-3800(!)
</PRE>
Tilasto on laitekohtainen, ja se voi hyvinkin vaihdella laitteiston, terminaaliohjelman ja yhteyden laadun mukaan.<BR>
<BLOCKQUOTE>
<PRE>
<B>X-Link v.34+</B>
    <B>Nopeus:</B><I> 33600 bps</I>
     <B>Hinta:</B><I> 680 mk (ulkoinen, Lincware computers)</I>
 <B>Liit&auml;nn&auml;t:</B><I> Phone, line, RS-232c ja virtaliitin.</I>
<B>Virtal&auml;hde:</B><I> AC/AC 9V 100mA</I>
     <B>Takuu:</B><I> 2 vuotta</I>
  <B>Testattu:</B><I> Amiga 1230/50 MHz, 8 Mt Fast, NComm 3.06.</I>
</PRE>
</BLOCKQUOTE>

</FONT>
<HR width=100% size=2 align=CENTER>
<CENTER>
 <FONT SIZE=2><I>HtmlSaku numero 21, &copy; Copyright 1993-1997 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</I><BR></FONT>
</CENTER>
</BODY>
</HTML>
