<html>
<head>
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 01/98 - Editorial</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">


<center><h1>das Editorial</h1></center>
<p>
Hallo und Willkommen bei der Amiga Times 2/98!<br>
Ooooh ja, kaum zu glauben das es schon wieder soweit ist, 2 Monate sind
ja wirklich schnell vorbei. Aber einiges haben wir zusammentragen k&ouml;nnen,
wie zum Beispiel Test`s zu &quot;Wordworth 7&quot;, &quot;Aminet Set 6&quot; oder aber auch 
Tests zu &quot;Amiga Forever 2&quot;, geh&ouml;ren genauso dazu, wie interessante Fun
&amp; Talk Artikel oder Interviews. Nun es d&uuml;rfte f&uuml;r jeden etwas dabei sein,
jeglich der Spieleteil ist mager ausgefallen.

Nun soviel gibt es diesesmal nicht zusagen, ich freue mich, da&szlig; unser eMail
Abo sich immer gr&ouml;&szlig;erer Beliebtheit erfreut. Unser kleines gro&szlig;es Problem
mit dem HTML Konvertierer hat sich positiverweise gel&ouml;st, so da&szlig; ich Euch
Sven als neuen Mitarbeiter vorstellen kann. Aber auch einen Ersatzmann haben
wir bekommen, genauso wie einen neuen Redakteur (Christopher) und wenn das
so weiter geht, werden wir sicher noch mehr Zuwachs bekommen, vielleicht
hat ja der ein oder andere schon mal dar&uuml;ber nachgedacht??? Nicht z&ouml;gern,
mitmachen!

<p><table><tr><td valign="top">
<pre>Just HTML:</pre></td><td> Neu ist jetzt in der HTML Version, da&szlig; es am unteren Bildschirmrand, bzw. am Ende des Textes (wo es die Links &quot;Vor&quot;
           und &quot;Zur&uuml;ck&quot; gibt) ein neuer Link mit Namen &quot;i&quot; gibt, mit
           dem man zum Inhalt des jeweiligen Themenbereich kommt.</td></tr></table>
<p>
&Auml;h... leider ist mir erst sehr sp&auml;t aufgefallen, da&szlig; es doch ab und zu
einige Rechtschreibfehler gibt, bzw. mal ein Buchstabe fehlt. Sorry,
leider war es nicht mehr &auml;nderbar, aber nicht das ihr denkt, wir k&ouml;nnten
kein deutsch, es ist eher das schnelle Tippen, da&szlig; die Fehler zul&auml;&szlig;t und
man &uuml;berlie&szlig;t diese auch sehr oft, also entschuldigt dies bitte, in der
n&auml;chsten Ausgabe werden wir da etwas genauer drauf achten! 
<p>
Verschweigen m&ouml;chte ich jedoch nicht, da&szlig; es uns diesesmal etwas schwer
viel die AT zu f&uuml;llen. Das lag einerseits daran, da&szlig; auch in in den
letzten zwei Monaten sehr wenig Zeit hatte und die Arbeit verschob, und
andererseits, haben wir im Vergleich zu den letzten Ausgaben wenig Soft-
ware erhalten. Reich beschenkt hatte uns zwar die Schatztruhe, denen wir
jetzt nochmal danken wollen, aber au&szlig;er VAK und ein paar Shareware Programmierer, zeigten sich kaum H&auml;ndler kooperativ. Schade eigentlich!
<p>
So, Euch w&uuml;nsche ich jetzt noch viel Spa&szlig; und gute Unterhaltung bei unser
neusten Ausgabe, auf da&szlig; weitere erscheinen m&ouml;gen!

<p>
<i><b>Euer Mario </i></b>



<p><center>
<IMG SRC="../images/next1.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="../startup.htm" target="_top">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="inhfr01.htm" target="_top">
</MAP><hr></center>
</body>
</html>
