<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 02/98 - AT-Spieleteil</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
<center><h1>A7 - Gamecompilation</h1></center>

<p>NEW GENERATION Software hat ja f&uuml;r unsere Freundin schon allerhand
produziert, ob Trapped I oder II. Mit Ihrer schon vor einiger Zeit erschienen &quot;A7 Gamecompilation&quot; brachten sie auf einer CD gleich mehrere Titel an
den User. Diese CD gibt es heute schon f&uuml;r wenig Geld im Versand zu kaufen.
Wir wollten mal sehn, ob sich diese CD lohnt, oder ob man auch ohne sie
leben kann. Gleich 7  Games sind auf der CD enthalten und auch ein  paar
Demos und Screenshots fand ihren Platz. Ein kleinen Film gibt es auch, 
dieser ist eine ziemlich gutgemachte Werbung f&uuml;r &quot;Trapped2&quot;, und diese
sollte man sich unbedingt mal ansehen.

<p><center>|<a href="#smash"> Smash </a>|
<a href="#ooze"> Ooze </a>|
<a href="#ant"> Ant Wars2 </a>|
<a href="#bazza"> Bazza'n'Runt </a>|
<a href="#trap"> Trap'em </a>|
<a href="#jimmy"> Jimmy's </a>|
<a href="#rocket"> Rocketz </a>|<a href=#fazit>Fazit</a>|
<hr>
<h2><a name=smash>Smash</a></h2></center>

Smash ist wiedermal ein Clone und zwar diesmal von &quot;Worms&quot;. Mit &quot;Ant Wars2&quot;
w&auml;r' es also schon der zweite auf dieser CD! Doch &quot;Smash&quot; bietet allerhand.
Das Intro sowie das Spiel ansich enth&auml;lt kleine Sprachsamples und die Grafik
ist ertr&auml;glich. Leider st&ouml;rt der Sound, aber das kann man ja abstellen.
<p>
Bei &quot;Smash&quot; gibt es ein rotes und ein blaues Team. Mit Panzern, Zeppelins,
Bazooka's und anderen Waffen hat man nun die Aufagbe seinen Feind zu ver-
nichten. Der Bildschirm ist sehr gro&szlig;, nach links und rechts scrollbar.
An jedem Ende (links ganz au&szlig;en und rechts ganz au&szlig;en) befinden sich jeweils die Startpunkte der beiden Teams. Anfangs kann man nur mit einer
Bazooka in den Kampf ziehen, doch nicht lange dauert es bis man auch mit
Panzern dem Gegner das Leben schwer macht. Ganz einfach ist es eben nicht,
so mu&szlig; man sich oft durch Berge (like &quot;Worms&quot;) durchgraben um zum Feind zugelangen, Br&uuml;cken bauen oder einfach nur viel Gl&uuml;ck haben. Die verschiedenen
Sprachsamples lockern das Game auf, da&szlig; Gameplay ist sehr einfach und es
macht dadurch eine Menge Spa&szlig;. Das hat ja auch schon bei &quot;Worms&quot; den Leuten
gefallen.
<p>
Man steuert seinen Trupp bzw. seinen Mann (nach dem Tod bekommt man einen
neuen, jedoch auch nur begrenzt auf 9 Mann) mit dem Joystick quer durch die
Botanik und mu&szlig; versuchen am schnellsten beim Gegner zu sein. Der Computer
ist leicht zu besiegen, da er oft die selbe Taktik w&auml;hlt und man dadurch
sehr schnell siegt, doch Vorsicht, der Schwierigkeitsgrad steigt je Level
und unbegrenzt Munition hat man auch nicht!
<p>
Fazit: &quot;Smash&quot; ist ein gute Shareware Game und man spielt schon ein Weilchen daran. Das die Grafik mittelm&auml;&szlig;ig ist, st&ouml;rt nicht, da da&szlig;
       Spielprinzip fesselt. Der Sound ist schrott, jedoch sind die Samples
       aufheiternd... wer h&ouml;rt nicht gerne ein &quot;Welcome to die&quot; vor dem
       Spielanfang??? Gesamt gesehen ist &quot;Smash&quot; <b><i>- gut - </i></b> 
<p>
<center>Wertung: <b>80 %</b>

<hr>|<a href="#smash"> Smash </a>|
<a href="#ooze"> Ooze </a>|
<a href="#ant"> Ant Wars2 </a>|
<a href="#bazza"> Bazza'n'Runt </a>|
<a href="#trap"> Trap'em </a>|
<a href="#jimmy"> Jimmy's </a>|
<a href="#rocket"> Rocketz </a>|<a href=#fazit>Fazit</a>|
<h2><a name=ooze>Ooze - AGA</a></h2></center>

&quot;Ooze&quot; h&ouml;rt sich eigentlich nach einem Action Game an, bei welchem man
wieder mal alles niedermetzeln mu&szlig;, was einem in die Quere kommt. Doch
ganz anders... &quot;Ooze&quot; ist ein Denkspiel. Man mu&szlig; verschiedene Bl&ouml;cke
verschieben, bis entweder die Spielfl&auml;che voll ist, oder man sich nicht
mehr bewegen kann. &quot;Ooze&quot; erinnert an das Spiel &quot;Atoms&quot; oder vergleichbare.
<p>
Im Grunde ist es ein Denkspiel, da&szlig; vom Sinn her &quot;Langweileralarm&quot; ervorruft. Aber nein, da&szlig; Spiel kann einen wirklich fesseln, man mu&szlig; sich
immer neue Strategien ausdenken um seinen Gegner zubesiegen.
<p>
Doch wie funktioniert es???? Man mu&szlig; sich ein Spielfeld mit 7x7 Feldern.
An jeder Ecke liegt ein Stein, diagonal sind immer zwei Steine gleicher
Farbe. Gesteuert wird mit der Maus, der Spieler mu&szlig; einen seiner Steine
anklicken, bis dieser grau wird. Danach kann man ein Feld anklicken, 
welches neben dem Stein liegt und aus einem Stein werden zwei. Klickt man
auf ein Feld bzw. springt &uuml;ber ein Feld (man landet praktisch zwei Felder
weiter, als vom Ausgangspunkt) wird Dein Stein nicht verdoppelt, sondern
der Stein zoomt nur zur anderen Fl&auml;che. Geht man jetzt auf ein Feld, 
bei dem ein Stein des Gegners angrenzt, so verf&auml;rbt sich des Gegners Stein
in Deine Farbe und das geht so lange weiter, bis entweder alle Steine
Deine Farbe haben oder das Spielfeld mit Steinen voll ist.
<p>
Das alles klingt etwas komlpiziert, ist aber total einfach zu handhaben.
Aber Vorsicht: Bei &quot;Ooze&quot; ist Nachdenken angzuraten, denn ist man einmal
unvorsichtig hat man die Runde schon fast verloren.
<p>
Es gibt kein Zeitlimit, deshalb kann sich ein Runde lange hinziehen und
macht auch ein Menge Spa&szlig;, obwohl man fast so schnell gewinnt, wie verliert. Das Blatt kann sich n&auml;mlich schlagartig &auml;ndern.
<p>
Fazit: Zu zweit macht &quot;Ooze&quot; eine Menge Spa&szlig; und man kann mehrere Stunden
       damit verbringen. Leider ist &quot;Ooze&quot;, wie auch &quot;Jimmy's&quot; ein Gl&uuml;cksgriff auf dieser CD und kann sie nicht mehr retten, schade eigent-
       lich. Wegen &quot;Ooze&quot; w&uuml;rde ich die CD nicht kaufen, aber wenn Du es
       einzeln im Handel bekommst, solltest Du es auf jedenfall kaufen!!!
       <i><b>- Empfehlenswert - </i></b>
<p>
<center>Wertung: <b>86 %</b>

<hr>|<a href="#smash"> Smash </a>|
<a href="#ooze"> Ooze </a>|
<a href="#ant"> Ant Wars2 </a>|
<a href="#bazza"> Bazza'n'Runt </a>|
<a href="#trap"> Trap'em </a>|
<a href="#jimmy"> Jimmy's </a>|
<a href="#rocket"> Rocketz </a>|<a href=#fazit>Fazit</a>|
<h2><a name=ant>Ant Wars 2.35</a></h2></center>

Die Story von &quot;Ant Wars2&quot; wird im Spiel sehr gro&szlig; und breit erz&auml;hlt, ist
aber sehr kurz zusammenfa&szlig;bar. Das Ziel besteht einfach nur darin, alle
Gegner zu t&ouml;ten und das Basislager des Feindes zu zerst&ouml;ren. Das Spiel
selbst ist erstmal nicht bootf&auml;hig, sondern mu&szlig; von der Festplatte gestartet werden bzw. von einer geladenen Workbench.
<p>
Anfangs bekommt man noch eine recht gut aussehende (dreh-) Animation von
zwei Ameisen zusehen - das ist aber auch die beste Grafik aus dem Spiel.
Das Spiel hat kaum mehr als 32 Farben zubieten (wenn &uuml;berhaupt, es k&ouml;nnten
auch nur 16 sein, was ist stark annehme) und der Hintergrund Sound nervt
total. Da er sich auch nict &auml;ndert, sollte man ihn schleunigst abstellen,
ansonsten spielt man nur eine sehr sehr geringe Zeit &quot;Ant Wars2&quot; und bootet
genervt neu.
<p>
Das Spiel bzw. der Screen ist in zwei h&auml;lften geteilt. Jeder Spieler f&auml;ngt
woanders an und mu&szlig; sich zum Gegner vork&auml;mpfen. Gesteuert wird mit Tastatur
(P1) und mit Joystick (P2). Anfangs braucht man einige Zeit, bis man damit
zurecht kommt, aber es geht schon.
<p>
Also laufen wir mal zum Feind, man hat keine Zeit oder Schrittbegrenzung,
so da&szlig; man gleich drauflos rennen kann. An Waffen stehen anfangs nur die
Bazooka zur Verf&uuml;gung. Die Schu&szlig;zahl ist begrenz und man sollte sich die
Muniton einteilen. Br&uuml;cken mu&szlig; man bauen um Hindernisse zu&uuml;berqueren, oder
man schie&szlig;t sie einfach weg, egal wie, hauptsache man findet den Feind.
<p>
Das Prinzip geht also immer so weiter, sp&auml;ter gibt es noch Hubschrauber,
Flugzeuge, Jeeps, Panzer und Motorr&auml;der, mit dessen Hilfe es einfacher
werden soll den Feind zu besiegen.
<p>
Nun ja, &quot;Ant Wars&quot; errinnert sehr stark an &quot;Worms&quot; und ist teilweise auch
so gestaltet worden. Der vorhandene Mapeditor soll noch mal einen Motivationsschub geben, was allerdings nicht der Fall ist. Viele werden das Game
sowieso gleich beenden, wenn sie die Grafik sehen, denn die ist echt Schrott
und allen anderen wird sp&auml;testens nach 10 Minuten eint&ouml;niger Musik der Spa&szlig;
vergehen. W&auml;ren die Figuren etwas gr&ouml;&szlig;er, ginge es noch, aber leider sind
sie viel zu klein. Alles in allem kein Spiel was man &uuml;berhaupt verkaufen
d&uuml;rfte, PD w&auml;re da sicher noch akzeptabel. <b><i>- Schlecht - </b></i>
<p>
<center>Wertung: <b>54 %</b>

<hr>|<a href="#smash"> Smash </a>|
<a href="#ooze"> Ooze </a>|
<a href="#ant"> Ant Wars2 </a>|
<a href="#bazza"> Bazza'n'Runt </a>|
<a href="#trap"> Trap'em </a>|
<a href="#jimmy"> Jimmy's </a>|
<a href="#rocket"> Rocketz </a>|<a href=#fazit>Fazit</a>|
<h2><a name=bazza>Bazza'n'Runt</a></h2></center>

Leider funktionierte bei uns weder die vorinstallierte Version auf CD ROM,
noch das entpackte DMS Archiv (liegt ebenfalls der CD bei). Aus diesem
Grund kann ich nat&uuml;rlich &uuml;ber &quot;Bazza'n'Runt&quot; keinen Test schreiben - sorry.
Nat&uuml;rlich f&auml;llt das Game bei der Gesamtwerung raus!
<p>
<center>Wertung: <b>-- %</b>

<hr>|<a href="#smash"> Smash </a>|
<a href="#ooze"> Ooze </a>|
<a href="#ant"> Ant Wars2 </a>|
<a href="#bazza"> Bazza'n'Runt </a>|
<a href="#trap"> Trap'em </a>|
<a href="#jimmy"> Jimmy's </a>|
<a href="#rocket"> Rocketz </a>|<a href=#fazit>Fazit</a>|
<h2><a name=trap>Trap'em!</a></h2></center>

Das ein Disketten gro&szlig;e Spiel wird durch ein Story-Intro eingeleitet.
Nach einem gro&szlig;en Landwirtschafts Unfall wurden Louis und Pug - die
Helden des Spieles -  von den Menschen verbannt und gezwungen die 
&quot;Nashorn Ebene&quot; aufzubauen und diese zu besch&uuml;tzen. Der einzige Freund
wurde beim bewachen der Ebene hinter&uuml;cks angegriffen (von 3 Operns&auml;ngern,
welche Poppy mit Fleisch bewarfen) und kampfunf&auml;hig gemacht. Danach
stolen die Diebe noch ein Trio der 4-beinigen Biester und verschwanden,
ohne ein Spur zuhinterlassen.
<p>
Man nimmt an, da&szlig; sie sich in den TRAP'EM Towers auf &quot;Chaos Island&quot;
verstecken. Luis und Plug m&uuml;ssen jetzt die Diebe fassen, leider haben
sie nichts au&szlig;er einer Pistole, doch das hindert keinen von beiden.
<p>
Als Spieler mu&szlig;t Du nun allein oder zu zweit durch die Tower und alle
Gegner t&ouml;ten und versuchen die Diebe zu fassen. Insgesamt 3 Tower mu&szlig;t
Du &uuml;berstehen und etlichen Fallen entkommen.
<p>
Am besten und erfolgreichsten besiegt man die Gegner, wenn man eine Falle
aufstellt und wenn diese dann reinlaufen ununterbrochen auf sie zuschie&szlig;en. Man kann verschiedene PowerUps einsammeln und durch sie
mehr Ziet, Power, Geld, Energie, Punkte oder sogar die Unsichtbarkeit
erlangen. Auch Bonusgegenst&auml;nde k&ouml;nnen eingesammelt werden.
Alle Items kann man sich im Hauptmenu erkl&auml;ren lassen, damit man wei&szlig;,
was man einsammelt. &quot;Trap'em&quot; bietet auch Passw&ouml;rter, damit man nicht
immer neu anfangen mu&szlig;.
<p>
Das alles h&ouml;rt sich vielleicht gut an, ist aber in der &quot;Praxis&quot; vollkommen mist. Die Grafik und der Sound k&ouml;nnen nicht &uuml;berzeugen. Auch ist
das Spiel teilweise viel zu einfach un man hat es nach wenigen Stunden
durchgespielt. Die Spielidee ist auch nicht gerade neu, sowas gab es vor
Jahren schonmal in besserer Aufmachung in &quot;Rodlands&quot;, dort mu&szlig;t man als
kleine Prinzessin mit einen Zauberstrahl Torten und andere &quot;Viecher&quot;
t&ouml;ten. Man mu&szlig;te auch dort immer Leitern hochsteigen und dann versuchen
den Gegner zubesiegen um dann ein Stage (Bildabschnitt) weiterzukommen.
Klingt einwenig nach einem Kinderspiel, hat aber eine Menge Spa&szlig; gemacht.
<p>
Die Steuerung erfolgt &uuml;ber den Joystick und bietet kaum Abwechslung.
Nach einem bestandenen Stage, kann man einen Shop besuchen um sich dort
Fallen, Waffen, Schuhe (schneller) u.a. zu kaufen. Dann geht es weiter
ins n&auml;chste Level.
<p>
Das Spiel motiviert aufgrund fehlender Innovationen nicht und erh&auml;lt nur
eine befriedigende Wertung. Grafik und Sound sind mittelm&auml;&szlig;ig und tragen
zum Gesamtergebnis (negativ) bei. Keine Glanzleistung!
<b><i>- Befriedigend - </i></b>
<p>
<center>Wertung: <b>70 %</b>

<hr>|<a href="#smash"> Smash </a>|
<a href="#ooze"> Ooze </a>|
<a href="#ant"> Ant Wars2 </a>|
<a href="#bazza"> Bazza'n'Runt </a>|
<a href="#trap"> Trap'em </a>|
<a href="#jimmy"> Jimmy's </a>|
<a href="#rocket"> Rocketz </a>|<a href=#fazit>Fazit</a>|
<h2><a name=jimmy>Jimmy's Fantastic Journey</a></h2></center>

&quot;Jimmy's&quot; hat keine richtige Story, man mu&szlig; 24 Levels bestehen, welche
auf 4 verschiedene Welten verteilt sind. Da gibt es: &quot;Das Haus des
Spa&szlig;es&quot;, &quot;Melon Weltraum&quot;, &quot;der Wald&quot;, sowie &quot;der hektische Hafen&quot;.
<p>
Die Grafik kann gefallen und sieht kunterbunt aus, obwohl es nur ein
ECS Game ist. Die Steuerung ist sehr einfach, mit dem Joystick l&auml;uft und
springt man und mit dem Feuerknopf schie&szlig;t man. Hierbei sollte man aber
sagen, da&szlig; man nicht mit Kugeln, sondern mit Ballons schie&szlig;t, welche aber
die gleiche Wirkung haben. Der Sound ist mittm&auml;&szlig;ig, pa&szlig;t zwar zum Spiel...
&uuml;berzeugt aber nicht. Doch das ist eigentlich egal, da &quot;Jimmy's&quot; eine
unglaubliche Motivation aufweisen kann. Das Spiel macht einfach nur Spa&szlig;
und ist neben &quot;Ooze&quot; die einzige Attraktion der Spiele.
<p>
Fazit: &quot;Jimmy's Fantastic Journey&quot; ist einfach super, es macht Spa&szlig; und
       l&auml;st einen Hauch von Nostalgie aufkommen. Es errinnert an Klassiker
       wie &quot;Rick Dangerous&quot; und sorgt f&uuml;r jede Menge Spa&szlig; am Screen. Doch
       auch hier stellt sich wieder die Frage! Lohnt sich der Kauf wegen
       einem Spiel??? &quot;Jimmy's&quot; gibt es noch bei einigen H&auml;ndlern f&uuml;r knapp
       20,- DM im Laden, so da&szlig; ihr selbst entscheiden solltet, ob Ihr noch
       etwas drauflegt oder nicht!<i><b>- Empfehlenswert - </i></b>
<p>
<center>Wertung: <b>84 %</b>

<hr>|<a href="#smash"> Smash </a>|
<a href="#ooze"> Ooze </a>|
<a href="#ant"> Ant Wars2 </a>|
<a href="#bazza"> Bazza'n'Runt </a>|
<a href="#trap"> Trap'em </a>|
<a href="#jimmy"> Jimmy's </a>|
<a href="#rocket"> Rocketz </a>|<a href=#fazit>Fazit</a>|
<h2><a name=rocket>Rocketz</a></h2></center>

In &quot;Roketz&quot; mu&szlig; man mit einem Raumschif verschiedene Strecken abfliegen
und dabei seine Feinde zuzerst&ouml;ren. Das alles mu&szlig; man aber noch in einer
Zeitvorgabe schaffen. Insgesamt 6 Strecken gibt es und 4 verschiedene
Flugzeuge. Die einzige Waffe die man hat, sind Raketen und sonst nicht,
aber mehr brauch man auch nicht, da man viel mehr damit besch&auml;ftigt ist
eine Runde zu schaffen. Gesteuert wird &quot;Roketz&quot; via Joystick und das
geht &auml;u&szlig;erst schlecht. Durch die Gravitation st&ouml;&szlig;t man sehr oft an die
Bande und wird dadurch get&ouml;tet. &quot;Rocketz&quot; ist ein schnelles Spiel, jedoch
ist es vielmehr das Ziel mal eine Runde bzw. eine Strecke zubestehen und
nicht vorher get&ouml;tet zuwerden. 
<p>
Die Grafik und der Sound sind wirklich gut und eigentlich auch das beste
daran. Das Spiel l&auml;uft nur auf AGA Amiga's und ist Festplatten tauglich.
<p>
Gehen wir aber nochmal zum Anfang des Spieles. Hat man sich das Comicartige
Intro angesehen, wei&szlig; man erstmal &uuml;ber die Story bescheid. Im Hauptmenu 
kann man alle n&ouml;tigen Einstellungen vornehmen, das Level ausw&auml;hlen und
ebenfalls das Raumschiff aussuchen. Danach kann es schon losgehen.
<p>
Kaum nach dem Startschu&szlig; rasen die Gegner los und man slebst mu&szlig; erstmal
mit der Steuerung klarkommen. Falls man damit je zurechtkommt, kann man
auf die Jagd nach den Feinden gehen und das Prim&auml;rziel (Rundensieg) in
Angriff nehmen. Leider schafft, man es nicht sehr oft. Im Gegenteil, man
geht viel zu oft tot und das meist in den ersten Runden. Man hat zwar max.
10 Leben, doch die sind sehr schnell verbraucht.
<p>
Die verschiedenen Strecken sind abwechslungsreich und sehr schwer, gerade
mit der Anziehungskraft hat man Probleme. Diese Feature sollte zwar eine
neu Idee sein und f&uuml;r den richtigen Schwierigkeitsgrad sorgen (ist ihnen
aich gelungen), aber leider zerst&ouml;rt es auch jeglichen Spa&szlig; des Spielers,
da man nach irgendwann (nach dem Xten Tod) aufgibt.
<p>
Fazit: Leider sind nur die Grafik und der Sound gut, der Rest nicht.
       Die Spielidee ist nicht gerade neu und dadurch, da&szlig; das Gameziemlich hakelich ist, gibt man nach einigen Versuchen verzweifelt auf. Anfangs bin ich schon kurz nach der Startlinie
       gegen eine Bande geknallt und war sofort tot, wenn das einem
       mehrmals passiert, legt man &quot;Rocketz&quot; sehr schnell wieder weg.
       W&auml;re die Steuerung besser, k&ouml;nnte man nochmal dr&uuml;ber reden, aber
       so nicht, schade eigentlich. <b><i>- Befriedigend - </b></i>
<p>
<center>Wertung: <b>67 %</b>
<hr>|<a href="#smash"> Smash </a>|
<a href="#ooze"> Ooze </a>|
<a href="#ant"> Ant Wars2 </a>|
<a href="#bazza"> Bazza'n'Runt </a>|
<a href="#trap"> Trap'em </a>|
<a href="#jimmy"> Jimmy's </a>|
<a href="#rocket"> Rocketz </a>|<a href=#fazit>Fazit</a>|
<h2><a name=fazit>Fazit</a></h2></center>
Die CD enth&auml;lt 141 MB Daten, darunter sind auch alle Anleitungen zu
den Spielen, Slideshows, (wie oben erw&auml;hnt) Module und Animationen. Viel
konnte ich den Vollversionen nicht abgewinnen, daf&uuml;r waren sie einfach
zu schlecht. Zwar hatte ich einige Zeit an &quot;Jimmy`s Fantastic's Journey&quot;
gespielt, doch diesen einzelnen Titel gibt es f&uuml;r weniger Geld im Handel.
Gesamtgesehen ist diese CD befriedigend, mehr leider nicht, daf&uuml;r sind
die Games einerseits zu alt und andererseits nicht fesselnd genug.
<b><i>- Befriedigend - </b></i>
<p><center>
<b>Hier die Wertung der Spiele:</b>
<table><tr><td>Smash</td><td>80 %</td></tr>
<tr><td>Ooze</td><td>86 %</td></tr>
<tr><td>Ant Wars 2</td><td>54 %</td></tr>
<tr><td>Bazza`n`Runt</td><td>-- %</td></tr>
<tr><td>Trap'em!</td><td>70 %</td></tr>
<tr><td>Jimmy's</td><td>84 %</td></tr>
<tr><td>Rocketz</td><td>67 %</td></tr>
<tr><td><u>Gesamt CD Wertung:</u></td><td><b><u>74 %</u></b></td></tr></table>
</center>
<p>
<b>Bezugsquelle:</b> NEW GENERATION Software , D-49586 Neuenkirchen
<p  align="right"><em>-mn-</em></p>
<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="games01.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh06.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="games03.htm">
</MAP><hr></center>
</body>
</html>
