<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 02/98 - AT-Spieleteil</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><h1>vak ACTION cd 2</h1></center>


Vor fast 5 Monaten erschien die erste &quot;VAK-Action CD&quot;. Diese bot einige
Demos, viele PD und Shareware Sachen. Jetzt, ende April scheint die zweite
&quot;Ausgabe&quot; dieser CD-ROM. Mit knapp 560 MB &uuml;bertrifft sie die erste CD um
l&auml;ngen, doch ob auch der Inhalt besser ist, wird sich noch herausstellen.
<p>
Die Oberfl&auml;che ist sehr schlicht gehalten, wie immer mit Schubladen versehen, vorzufinden gibt es...
<p>
<b>Previews</b><br>
Hier findet man Demos zu &quot;Breed96&quot;, &quot;Genetic Species3.0&quot;, &quot;Battelecraft&quot;,
sowie zu 4 anderen Spielen. &quot;Breed96&quot; kannte ich schon, genau wie das
&quot;Genetic Species 3.0&quot; aus, aber &quot;Battlecraft&quot; konnte mich schon fesseln.
Diese Mischung aus Strategie und Action (like Warcraft) ist einfach super.
<p>
<b>Spiele</b><br>
Nun hier findet viel bekanntes, doch an einem kam ich nicht vorbei, an der
&quot;WormsDC&quot; Schublade. Dort befand sich n&auml;mlich die Vollversion von &quot;Worms2&quot;.
Eigentlich unvorstellbar, aber da es keinen Timer gab, und alle Funktionen
anw&auml;hlbar waren, mu&szlig; es sich eigentlich um die Vollversion handeln.
Auch ein paar neue Sachen gibt es, hier ein kleiner Auszug...
&quot;Legends of Triten, ZhaDOOM, Doom 1 &amp; 2, Final Doom&quot; und anderes.
<p>
<b>Amiga Times</b><br>
Nun, hier habe ich nicht sclecht gestaunt, als ich das Verzeichnis sah.
Beinhalten tut es die Ausgabe 2/97 ind der HTML Fassung, sowie Voyager.
Mal sehn, ob sich hier zuk&uuml;nftig noch etwas einrichten l&auml;&szlig;t, bis dahin
abwarten und Kaffeetrnken.
<p>
<b>Demos</b><br>
Hier gibt es allerhand Szene Demos mit guter Musik und tollen Grafiken.
<p>
<b>BlitzBombers</b><br>
BlitzBombers liegt a&ouml;s Vollversion der CD bei und ist eine Art &quot;Bomberman&quot;.
Bei Blitzbombers mu&szlig; ma allerdinsg sich den weg zum Levelausgang freibombardieren und dies auch noch unter Zeitdruck. Das Spiel macht doch viel
Spa&szlig; und kann eine ganze Zeit lang vor den Monitor fesseln. Wie gesagt,
es ist kein Bomberman, sondern ein Game was darauf etwas basiert, es gibt
keinen Gegner (ich habe keinen gesehen), nur die Zeit und die wird ab und
zu knapp. Ein lustiger Zeitvertreib, den man sich ansehen sollte!
<p>
<b>VAK-Entertainment</b><br>
Hier gibt es sehr viele Bilder, welche unter der Rubrik &quot;Erotic Dreams&quot;
laufen, was da&szlig; f&uuml;r welche sind, d&uuml;rfte ja da jedem klar sein. Weiterhin gibt es Animationen, zum Beispiel vom Angriff Ausserirdischer u.a.
und daan enth&auml;lt dieses Verzeichnis noch &quot;Turbo Racer 3d&quot;, ein Autorennspiel, und ein Demo von &quot;Whools&quot;, einem 3d Shotter. Da mu&szlig; man
Aliens zerlegen... wems gef&auml;llt!?!
<p>
<b>Amos</b><br>
Die Amos-Schublage enth&auml;lt die &quot;Amos Packs 1- 10&quot;, sowie &quot;Reality Art
1-5&quot; (alles Bilder) dann gibt es noch &quot;Amos&quot; und &quot;AmosAGA&quot;. Wer also
in Amos programmieren m&ouml;chte, bekommt hier die n&ouml;tige Software.
<p>
<b>Anims</b><br>
Was soll man hier schreiben?? Es gibt nat&uuml;rlich Animationen, zwar nicht
viele, aber bei gr&ouml;&szlig;en von 3-10 MB ist es schon gro&szlig;.
<p>
<b>Anwender</b><br>
&quot;Dir Opus 5.1&quot;, &quot;IDE-fix&quot;, ein Demo von &quot;PC Task4&quot; und sehr viele Modelle
f&uuml;r &quot;Image 3d&quot; sind nur einige Sachen, die man hier findet. Einige Tools,
Audioplayer, oder Dosdrivers sind genauso vorhanden, wie die 3.7er Version
von MUI oder Datatypes. Zwar gibt es nicht so ein gro&szlig;es Angebot und oft
sucht man das, was nicht dabei ist, aber vielleicht findet man doch etwas
brauchbares?!
<p>
<b>Blizzard</b><br>
Nun, hier ist nur &quot;CyberAvi&quot; und ein paar Avi Animationen f&uuml;r alle
Blizzard Besitzer drin! Sie laufen zwar auch auf anderen Turboboards,
bzw. mit ihnen, jedoch etwas langsam.
<p>
<b>Fazit:</b><br>
Alles in allem ist diese CD wieder sehenswert, f&uuml;r knapp 20 DM
sowieso geschenkt. Zumahl ich immer noch davon &uuml;berzeugt bin, da&szlig;
WormsDC in der Vollversion beiliegt, ist diese CD noch interessanter,
au&szlig;erdem gibt es ja viele Anwender Tools und - was ich doch sehr
gut fand - die Amos Packs. Nun, ich w&uuml;rde sagen, mit dieser CD-ROM
hat bzw. w&uuml;rde niemand einen Fehlkauf begehen!
<i><b>- Gut - </b></i>
<p align="right"><em>-mn- </em></p>
<p>
<b>Quelle:</b><br>
VAK, Alfred Kn&ouml;tig<br>
Postfach 1623<br>
36251 Bad Hersfeld<br>
Tel: 06621/13626<br>
Fax: 06621/13626


<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="games04.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh06.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="inhfr07.htm" target="_top">
</MAP><hr></center>
</body>
</html>
