<html>
<head>
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 02/98 - Helpline</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><h1>erben der erde</h1></center>

Nachdem unser Held knapp die Meisterschaft des R&auml;tselspieles verpa&szlig;t und
somit nur den zweiten Platz belegte, wurde er beschuldigt, die &quot;Sturmkugel&quot;
gestohlen zu haben. Ihm blieb nichts anderes &uuml;brig als sich bereit zu
erkl&auml;ren, die &quot;Sturmkugel&quot; zu suchen. Damit er sich nicht aus dem Staub
macht, entschlo&szlig; sich die Keilerwache, seine Freundin Rhene solange in
Gewahrsam zu nehmen. Als zus&auml;tzliche Sicherheitsma&szlig;nahme wurden ihm zwei
Begleiter, Eeah von der Elchgarde und Okk von der Keilergarde, zur Seite
gestellt.
<p>
Als erstes befragt der Held die Besucher des Jahrmarktes, aber au&szlig;er
einiger interessanter Geschichten gibt es nichts zu h&ouml;ren. Diese Befragung
ergibt also keine hei&szlig;e Spur. Allerdings kann er im Zelt des Geldwechslers
seine Silbermedaille versetzen und so an ein wenig Geld f&uuml;r die Reise
kommen.
<p>
Danach begibt sich Rif samt Anhang zum Tempel der &quot;Sturmkugel&quot;, um den
Tatort zu besichtigen. Die Pristerin Elara befindet sich im Tempel auf der
Ostseite des Heiligtums. Allerdings glaubt sie unseren Helden nicht,
sondern verlangt einen Beweis daf&uuml;r, da&szlig; sie im Auftrag des Waldk&ouml;nigs
handeln.
<p>
Also machen sich Rif und seine Begleiter auf in den Wald und treffen dort
auf den Elchk&ouml;nig. Dieser gibt ihnen einen goldenen Apfel, den sie Elara
als Zeichen &uuml;bergeben sollen.
<p>
Wieder zur&uuml;ck im Heiligtum erweist sich Elara nach Erhalten des Apfels
durchaus gewillt zu helfen, allerdings wei&szlig; sie nicht viel &uuml;ber den
Diebstahl. Sie erlaubt ihnen allerdings, sich frei im Heiligtum zu bewegen.
<p>
Im Garten, n&ouml;rdlich der Wohnh&auml;user, finden sie dann auch einen seltsamen
Fu&szlig;abdruck und einige, unbekannte Beeren. Da niemand den Fu&szlig;abdruck oder
die Beeren identifizieren kann, wenden sich unsere Helden an den
Rattenk&ouml;nig, der weithin bekannt f&uuml;r seine Weisheit ist. Um zu ihm zu
gelangen, mu&szlig; man allerdings erst an einem pedantischen W&auml;chter vorbei.
Dies gelingt durch ein verbales Ablenkungsman&ouml;ver, das Eeah und Okk
auff&uuml;hren und so den W&auml;chter ablenken. Rif kann sich unbemerkt einen Mantel
schnappen und sich damit tarnen. Die H&ouml;hlen der Ratten erweisen sich als
richtiges Labyrinth, aber mit etwas Geduld ist auch dieses zu schaffen.
<p>
Endlich bei K&ouml;nig Sist angekommen, verlangt dieser, da&szlig; man ihm den
Gipsabdruck des geheimnisvollen Fu&szlig;abdruckes bringen soll. Die Beeren
kommen ihm zwar bekannt vor, aber genau identifizieren kann er sie nicht.
<p>
Zur&uuml;ck bei Eeah und Okk, die noch immer den W&auml;chter ablenken, macht sich
die Gruppe auf den Weg ins Dorf der Frettchen, um dort Gips f&uuml;r den Abdruck
zu kaufen. Der Gemischtwarenladen befindet sich links vom s&uuml;dlichen
Eingang. Der Besitzer erweist sich zwar als wahrer Scherzbold, verkauft
ihnen aber einen Sack mit Gips, mit dem sie zur&uuml;ck ins Heiligtum eilen. Im
Tempelgarten finden sie einen Eimer, in dem man den Gips mit Wasser
verr&uuml;hren kann. Schnell ist ein Gipsabdruck der unbekannten Spur gemacht
und man eilt zur&uuml;ck zum Rattenk&ouml;nig.
<p>
Endlich wieder bei diesem angekommen, stellt sich heraus, da&szlig; der
Fu&szlig;abdruck einem Waschb&auml;ren geh&ouml;rt.
<p>
Dieses Wissen wollen unsere Helden direkt dem Wildschweink&ouml;nig mitteilen,
was aber gar nicht so einfach ist, da der K&ouml;nig gerade sein Schlammbad
nimmt. Dies h&auml;lt Rif aber nicht auf, mutig st&uuml;rzt er sich in die braunen
Fluten und spricht mit dem K&ouml;nig. Danach, mit schlamverklebtem Fell, ist
erst einmal K&ouml;rperpflege angesagt. Dabei kommt ein Ring mit einem
Wolfskopf, der sich in Rifs Fell verfangen hat, zum Vorschein. Deutet dies
nicht eventuell auf ein B&uuml;ndnis zwischen den W&ouml;lfen und den Wildschweinen
hin?
<p>
Die n&auml;chste Station ist das Haus von Tycho Northpaw, einem alten Hund, der
&uuml;ber eine sehr interessante Karte verf&uuml;gt. Diese w&uuml;rde er den Helden auch
gerne &uuml;berlassen, doch daf&uuml;r m&uuml;ssen sie eine defekte Linse ersetzen.
<p>
Ein Glasbl&auml;ser befindet sich im Dorf der Frettchen, der, nachdem man ihm
die Linse gezeigt hat, die Helden mit zu einer Versammlung in die
Dorfschenke nimmt. In der Dorfschenke mu&szlig; sich Rif allerdings erst einem
Test unterziehen, bevor man ihm hilft. Das Puzzle erweist sich als nicht
sehr schwer und nachdem Rif es gel&ouml;st hat, will sich der Glasbl&auml;ser direkt
an die Arbeit machen. Dabei bemerkt er, da&szlig; ihm ein geeigntes Poliermittel
fehlt. Okk erinnert sich daran, da&szlig; sein K&ouml;nig feinen, roten Sand f&uuml;r sein
Schlammbad verwendet. Dieser Sand w&uuml;rde sich vorz&uuml;glich als Poliermittel
eignen. Ein kurzes Schlammbad sp&auml;ter, verf&uuml;gt der Glasmeister &uuml;ber das
geeignete Poliermittel und ist in der Lage, die Linse zu vollenden.
<p>
Tycho gibt im Austausch f&uuml;r die Linse die Karte heraus. Vor dem Haus trifft
Rif auf einen Boten von Elara.
<p>
Dieser &uuml;bergibt den Helden einen Brief f&uuml;r Elaras Schwester, die irgendwo
in der Wildnis lebt. Die Freunde machen sich auf den Weg und kommen nach
kurzer Zeit am Schlo&szlig; des Hundeprinzen vorbei. Dieser entpuppt sich als gar
nicht so witzig wie erwartet, vor allem, da er alle Witze, die Rif ihm als
Zoll erz&auml;hlt, schon kennt, und so wandern die Freunde in den Kerker.
<p>
Ein Stein in der R&uuml;ckwand l&auml;&szlig;t sich zwar lockern, aber nicht l&ouml;sen. Vor
allem nicht, da sich Rif schon ganz schwach vor Hunger f&uuml;hlt. Also ruft er
den W&auml;chter und dieser bringt einen Napf voll Essen. Nach dem Essen
versucht Rif es erneut, und siehe da, der Stein l&auml;&szlig;t sich l&ouml;sen. Allerdings
ist die &Ouml;ffnung sehr klein, so da&szlig; Okk und Eeah nicht durchpassen. In der
Hoffnung irgendwo Hilfe zu finden, macht sich Rif alleine auf den Weg.
<p>
Das Labyrinth hinter der Zelle ist kein Problem f&uuml;r ihn, nur der kleinen
Echse sollte man wenn m&ouml;glich aus dem Weg gehen, da sie einen sonst ins
Wasser wirft. Nachdem Rif das Labyrinth verlassen hat, macht er sich auf
den Weg. Auf Tychos Karte sind einige Zelte eingezeichnet, die vorerst als
Ziel ausreichen. Dort eingetroffen findet er heraus, da&szlig; die Bewohner
dieser Zeltstadt, die Katzen, selber Hilfe brauchen: die Tochter der
Anf&uuml;hrerin ist t&ouml;dlich erkrankt. Rif erkl&auml;rt sich dazu bereit, ein
Heilmittel zu suchen. Im Norden findet er ein einsames Haus, in dem Elaras
Schwester lebt. Diese teilt ihm mit, da&szlig; sie zwar ein Heilmittel kennt,
aber nicht &uuml;ber die n&ouml;tigen Zutaten verf&uuml;gt. Also macht sich Rif auf die
Suche nach Nadel und Faden, Honig und Katzenkraut.
<p>
Den Honig befindet sich noch im Bienenstock, der an einem einsamen Baum auf
einem H&uuml;gel h&auml;ngt. Schnell ist durch den Einsatz von Feuerstein, den Rif im
Steinbruch im Osten gefunden hat, und einiger trockener &shy;ste ein Feuer
entfacht. So kommt er an den Honig heran, ohne gestochen zu werden.
<p>
Das Katzenkraut w&auml;chst an einem Flu&szlig; im Westen und Nadel und Faden kann man
beim fahrenden H&auml;ndler, Kylas Honeyfoot, kaufen, der sich auf einer
Lichtung aufh&auml;lt.
<p>
Nachdem Elaras Schwester diese Zutaten zu einer Medizin vermischt hat, eilt
Rif zur&uuml;ck zu der kranken Katze ... und siehe da, die Medizin bewirkt wahre
Wunder! Der Kranken geht es augenblicklich besser. Aus Dank erkl&auml;ren die
Katzen sich bereit, Rif bei der Befreiung seiner Freunde zu helfen.
<p>
Sie mischen den Hunden ein Schlafmittel ins Essen, so da&szlig; Rif sich ins
Schlo&szlig; schleichen kann. Der Schl&uuml;ssel zur Zelle befindet sich in der Hand
des schlafenden Prinzen. Dieser dreht sich allerdings jedesmal um, wenn man
auf eine knarrende Holzbohle tritt. Hier ist Vorsicht geboten! Nachdem Rif
den Schl&uuml;ssel ergattert hat, macht er sich auf den Weg in den Kerker,
vorbei an den kartenspielenden Wachen, und l&auml;&szlig;t seine Freunde frei.
Zusammen verlassen sie das Schlo&szlig; und wandern erneut zum Steinbruch. Dort
brich Okk den gr&uuml;nen Kristall aus der Wand und Rif schnappt sich das
herumliegende Seil. Danach suchen sie den H&auml;ndler Kylas Honeyfoot auf und
tauschen den Kristall gegen den Ring ein.
<p>
Im hohen Norden gibt es einen Abgrund, den alle mit Hilfe des Seiles und
Eeahs Sprungkraft &uuml;berwinden k&ouml;nnen. Weiter im Nordwesten finden die
Freunde eine Bootsanlegestelle. Der dort ans&auml;ssige F&auml;hrmann erkl&auml;rt sich,
nachdem er den Wolfskopfring gesehen hat, bereit, die Freunde &uuml;berzusetzen.
Dabei erz&auml;hlt er einige interessante Geschichten.
<p>
Auf der Insel angekommen, begeben sich die Freunde zum Wasserfall, wo sie
auf die W&ouml;lfin Shiala treffen. Danach f&uuml;hrt der Weg der Freunde in das Dorf
der aggressiven W&ouml;lfe, die die Helden direkt gefangen nehmen. Letztendlich
treffen sie dann auf den Waschb&auml;ren. Kurze Zeit sp&auml;ter kommt Shiala und
befreit die Gefangenen. In einer Baracke befindet sich eine Troph&auml;e, die
Rif einsteckt, und die Freunde machen sich auf den Weg zu den Ruinen im
Osten. Beim Durchsuchen der Ruinen findet Okk im zweiten Geb&auml;ude auf der
linken Seite eine Drahtspule.
<p>
Diese erweist sich schon kurz darauf an einer Klippe als sehr n&uuml;tzlich. Mit
Hilfe des Drahtes lassen Okk und Eeah Rif auf einen Vorsprung herunter, auf
dem ein seltsamer Gegenstand liegt.
<p>
Zur&uuml;ck an der Anlegestelle tauschen sie beim H&auml;ndler Honeyfoot die Troph&auml;e
gegen eine &Ouml;llampe. Damit begeben sich die Helden zu den Ruinen zur&uuml;ck, und
mit einigen Tropfen &Ouml;l aus der Lampe gelingt es ihnen,
<p>
die T&uuml;r des dritten Geb&auml;udes von links zu &ouml;ffnen. Im Inneren finden sie
einen Schraubenzieher, den sie mitnehmen. Die Freunde gehen in Richtung
S&uuml;den und biegen am Zaun in Richtung S&uuml;dwesten ab, worauf sie kurze Zeit
sp&auml;ter auf eine T&uuml;re treffen, die in einen seltsamen Raum f&uuml;hrt. In diesem
Raum befindet sich einen andere auff&auml;llige T&uuml;r, die sich erst &ouml;ffnet,
nachdem man das unbekannte, metallische Objekt in eines der Spalten
gesteckt hat. In dem dahinter liegenden Labyrinth biegen die Freunde an der
ersten Kreuzung nach links ab, an der zweiten nach rechts und schon sind
sie im Computerraum. Dort entdecken sie einen dreieckigen Gegenstand, mit
dem sie sich auf den R&uuml;ckweg machen (R&uuml;clweg: erste und zweite Kreuzung
geradeaus; dritte links; vierte, f&uuml;nfte und sechste wieder geradeaus).
Danach begeben sich unsere Helden zum Damm. Dort benutzen sie den
Schraubenzieher, um das T&uuml;rschlo&szlig; des Geb&auml;udes auf dem H&uuml;gel zu knacken. Im
Inneren des Geb&auml;udes liegt ein kleiner Kasten mit blinkenden Lichtern, den
die Freunde genauer untersuchen. Dabei f&auml;llt aus dem Kasten ein kleiner
Metalzylinder heraus. Dieser pa&szlig;t in das dreieckige Fundst&uuml;ck und ein
gr&uuml;nes Licht leuchtet auf.
<p>
Am Wasserfall entdecken die Freunde einen versteckten Durchgang, der zu
Shialas Wohnraum f&uuml;hrt. Dort gibt es eine T&uuml;re, die sich erst &ouml;ffnet,
nachdem man den dreieckigen Gegenstand in die entsprechende &Ouml;ffnung
gesteckt hat.
<p>
Die Freunde klettern einige Leitern nach oben und finden eine Treppe, und
danach erneut eine Leiter. Endlich oben angekommen, treffen unsere Helden
auf den diebischen Waschb&auml;ren und es kommt zum dramatischen
<p>
FINALE!
<p>
Bezugsquelle : World Wide Web


<p align="right"><em>-sbh- </em></p>


<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="help02.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh08.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="help04.htm">
</MAP><hr></center>

</body>
</html>
