<html>
<head>
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 02/98 - Helpline</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
<center>
<h1>tips &amp; tricks</h1><P>
| <a href=#delete>L&ouml;schabfrage</a> | <a href=#join>Join</a> | <a href=#maschine>AMIGA-Schreibmaschine</a> |
<hr><h2><a name=delete>L&ouml;schabfrage</a></h2></center>
   Wer von Euch nur ab und zu mal etwas zu L&ouml;schen hat wird sich
   sicherlich schon ge&auml;rgert haben das man immer ein Directory Utily
   &ouml;ffnen mu&szlig; um auf der sicheren seite zu stehen, denn im Shell gibt es
   f&uuml;r Delete keine Sicherheitsabfrage. Leider mu&szlig; man sagen.
   Aber mit einem kleinen Trick l&auml;&szlig;t sich auch das bewerkstelligen.
   Wozu hat man den die m&ouml;glichkeit ( fast ) alles per Script zu
   bewerkstelligen.<p>
   Ich habe ein Script mit den Namen Del geschrieben und dieses ( wie
   es sich geh&ouml;hrt ) in das S: Verzeichnis kopiert.
   Mit DEL wird im Shell erst mal gezeigt was im Verzeichnis steht,
   und gefragt ob &uuml;berhaupt gel&ouml;scht werden soll. Dieses zu
   best&auml;tigen bleibt dem benutzer &uuml;berlassen. Ansonsten funktioniert
   dieser Script genauso wie der Befehl Delete, nur das es halt kein
   Programm ist.<p>
   Wer von Euch das Script nicht immer mit Execute aufrufen m&ouml;chte,
   sollte die Schutzbits s und e setzen. Somit l&auml;st es sich ohne
   Execute und Pfadangabe wie Delete aufrufen.
   Bleibt Euch nur noch das Script Abzutippen. und ins S: Verzeichnis
   zu kopieren.
<pre>
   .key pat
   Echo &quot;*N*N&quot;
   list &quot;&#060;pat&#062;&quot;
   Ask &quot;*N*N -&#062; Wirklich alles L&ouml;schen ??? (y/n):   &quot;
   If Warn
   Echo &quot;*N*N&quot;
   Delete &quot;&#060;pat&#062;&quot;
   Echo &quot;*N*N Aktion Ausgef&uuml;hrt - Alles Gel&ouml;scht.*N*N&quot;
   Else
   Echo &quot;*N*N Aktion Abgebrochen !!!*N*N&quot;
   EndIf
   ; $VER: 1.2 DEL (17.01.98)
   ; &copy; Copyright by <a href="mailto:Ralf.Stecher@t-online.de">Ralf.Stecher@t-online.de</a>
   ; Script zum L&ouml;schen von Dateien mit Abfrage.
</pre>
<hr>
<center>| <a href=#delete>L&ouml;schabfrage</a> | <a href=#join>Join</a> | <a href=#maschine>AMIGA-Schreibmaschine</a> |
<h2><a name=join>Join !?!</a></h2></center>
<p>
   Und schon wieder etwas da nicht jeder wei&szlig;.
<P>
   St&auml;ndig bin ich dabei und schreibe .guide dateien oder Installer
   Scripte. Mein einziges Problem war fr&uuml;her das Zusammenfassen der
   einzelnen Textabschnitte mittels Join.
   Dem kann aber abgeholfen werden, und das gilt f&uuml;r jeden der
   mehrere Dateien zusammenfassen mu&szlig;, m&ouml;chte, will oder was wei&szlig; ich
   den &uuml;berhaupt.<p>
   Der Befehl Type ist hierzu n&auml;mlich hervorragend geeignet.
   Glaubt Ihr nicht? Na dann lest mal weiter.
   Mittels der Umlenkfunktion &#062; kann man hier einiges
   bewerkstelligen. Allerdings mu&szlig; die Funktion gleich zwei mal
   aufgerufen werden ( &#062;&#062; ).<p>
   Wozu Braucht man dieses eigendlich werdet Ihr Euch fragen.
   Auch diese Sache liegt klar auf der Hand.
   Join kann keine Texte &Uuml;berschreiben, man ist also immer gezwungen
   alle Textteile immer wieder neu zusammenzuf&uuml;gen, auch wenn man an
   Bestehende Texte nur etwas anh&auml;ngen m&ouml;chte. Type H&auml;ngt an.
   Der Befehlssyntax hierzu ist auch ganz einfach:<p>
   Type &#062;&#062;Datei Anhang1 Anhang2 Anhang3...<p>
   Die Datei wird in diesm Fall also &Uuml;berschrieben, bzw. erweitert.
   Es d&uuml;rfte klar sein das die Datei erst einmal Vorhanden sein mu&szlig;
   da diese ja schlie&szlig;lich erweitert werden soll.
   Wer diese Funktion &ouml;fters ben&ouml;tigt (!) kann sich in der
   Shell-Startup folgende Zeile anh&auml;ngen:
   ALIAS TJOIN TYPE &#062;&#062;[]<p>
   Somit braucht man in zukunft nur noch
   TJoin Datei Anhang1 Anhang2 Anhang3...
   in der Shell eintippen und erspart sich somit Type &#062;&#062;
   Anstadt TJoin k&ouml;nnt ihr auch beliebigen anderen Namen W&auml;hlen,
   passt nur auf das der gew&auml;hlte name nicht schon in einem Suchpfad
   Existiert, da Ihr ansonsten das Betriebssystem Durcheinanderbringen
   k&ouml;nnt.
<hr>
<center>| <a href=#delete>L&ouml;schabfrage</a> | <a href=#join>Join</a> | <a href=#maschine>AMIGA-Schreibmaschine</a> |
<h2><a name=maschine>AMIGA-Schreibmaschine</a></h2></center>
<P>
   Habt Ihr schon mal versucht Euren AMIGA als Schreibmachine zu
   mi&szlig;brauchen ? Noch nicht ??? Hab ich mir gedacht, und daher binn
   ich der Meinung das es nun endlich mal zeit wird f&uuml;r solche
   Spielereien.<p>
   Aber es steckt auch ein ernster Gedanke bei dieser sache.
   Stellt Euch mal vor, Ihr seid so sch&ouml;n am Schreiben eines Scriptes
   mit ED, seit fast Fertig und der Rechner H&auml;ngt sich auf weil Euer
   Programm im Hintergrund ( Bidberechnung, Backupprogramm... )<p>
   einen gravierenden Fehler aufwei&szlig;t ( &quot;es gibt kein perfektes
   Programm... ) und schon ist Eure ganze arbeit zunichte, und nur
   weil irgend so&acute;n Idiot die Sicherung herausgehauen hat.<p>
   Und genau daf&uuml;r gibt es im AMIGA-DOS einen Hervorragenden Trick um
   Eingaben sofort in eine Datei oder wie hier zum Drucker zu
   schicken. Also Shell &ouml;ffnen und Folgende Zeile eingeben:
   Copy * to PRT:<p>
   Einziger Harken an der sache ist das nur Zeilenweise ( nach
   bet&auml;tigen der Return Taste ) &uuml;bertragen wird.
   mann kann also auch in eine Datei schreiben, z.B. mit
   Copy * to RAD:Kochrezepte/Rehr&uuml;cken<p>
   Ihr Schreibt also eine Zeile, und Speichert diese sofort ab.
   Ins &quot;Normale&quot; Shell kehrt man mit der Tastenkombination Control
   (Ctrl) und der verkehrte Schr&auml;gstrich (neben Backslash) zur&uuml;ck.

<p align="right"><em>-rs-</em></p>

<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="inh08.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh08.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="help02.htm">
</MAP><hr></center>

</body>
</html>
