<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusED 4.2">
<title>AMIGA TIMES 02/98 - Internet & Co.</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">


<center><h1>IBrowse 1.2 update erh&auml;ltlich</h1></center>

Seit einigen Wochen ist jetzt f&uuml;r Registrierte Benutzer des
Internetbrowsers IBrowse ein Kostenloses Update auf die
Version 1.2 erh&auml;ltlich. Das etwa 450 KByte gro&szlig;e Update ist
das sechte Release und soll die Wartezeit auf die neue
Version 2.0 verk&uuml;rzen.
<p>
Hab mir nat&uuml;rlich gleich das Update aus dem Internet
besorgt um hier &uuml;ber die neuen Features der IBrowse 1.2
Version berichten zu k&ouml;nnen.
<p>
Grafiken k&ouml;nnen jetzt in den FAST-RAM geladen werden, so
spart man sich einiges von dem kostbaren Chip-RAM. Zudem
finde ich das die Grafiken auch etwas schneller dargestellt
werden.
<p>
Das Aufrufenes des Cache-Browser ist um ein vielfaches
schneller geworden. (Laut Info-Text um 500 Prozent!!)
Kanns leider nimmer vergleichen, aber &uuml;bertrieben ist
diese Aussage mit sicherheit nicht.
<p>
Speichern von HTML-Seiten jetzt auch in reinen ASCII-
Format m&ouml;glich.
<p>
Neu ist auch ein &quot;Global History&quot; Fenster in dem alle
zuletzt besuchten URL's aufgenommen werden. Die Haltezeit
der URL's in diesem Fenster kann bei den Einstellungen
festgelegt werden.
<p>
Man kann jetzt w&auml;hlen welche Zusatzfenster beim Start
immer ge&ouml;ffnet werden sollen. (Infofenster, Clipboard,
Netzstatistik, Hotlist, usw...)
<p>
Bei gedr&uuml;ckter ALT-Taste kann jetzt mit Cursor Links/
Rechts auch per Tastautr zwischen den zuletzt aufgerufenen
Seiten gesprungen werden.
<p>
Es kann festgelegt werden wieviel Chip-RAM mindestens
freigelassen werden soll.
<p>
Unterst&uuml;tzt jetzt auch die Grafik-Formate &quot;PNG&quot; und &quot;XBM&quot;.
<p>
Insgesamt gesehn hat sich das Update auf jeden Fall                           
gelohnt, zumal es ja auch nix gekostet hat. :) Ob die                         
neue Version jetzt stabiler l&auml;uft kann ich allerdings                         
nicht sagen, da es ja auch schon mit der Vorg&auml;nger-                           
Version keine nennenswerten Probleme                                          
gegeben hat.                                                                  
<p>
Ganz kurz zeigen wir jetzt noch die Liste der Neuerungen:
<p><ul>
<li> neu  PNG und XBM-Unterst&uuml;tzung
<li> neu  globales History-Fenster mit den bereits besuchten URLs
<li> neu  als ASCII-Datei speichern
<li> neu  smarter Modus f&uuml;r Fenster-Aktivierung
<li> neu  Option, das Download-Fenster nicht zu selektieren
<li> neu  untere Grenze f&uuml;r Chip-Memory in den Prefs
<li> neu  Option, Fenster beim Start &ouml;ffnen zu lassen
<li> neu  Clipboard-Unterst&uuml;tzung
<li> Starten den Cache-Browsers beschleunigt
<li> Farbbehandlung der Bilder verbessert (Nun ist es m&ouml;glich, Bilder
  im Fastram zu speichern. 2MB Chip-Memory-Grenze ade! Als Nebeneffekt
  ist das Dekodieren von Bilder unter AGA schneller.)
<li> Alt cursor links/rechts bedeutet nun back/forward
<li> Fehler beim ftp behoben, die zu Abst&uuml;rzen f&uuml;hrten
<li> Fehler beim ARexx behoben
<li> Probleme bei Sites mit nachgestellten Leerzeichen in ihren Cookies behoben
<li> Viele kleine Probleme in den Bilddekodern behoben, die zu Abst&uuml;rzen f&uuml;hren
  konnten
<li> (Endlich!) den Fehler bei Dateikommentaren (l&auml;nger als 80 Zeichen) behoben;
  IBrowse schneidet nun die URL ab und versucht, die unwichtigsten Teile der
  URL zu entfernen Quelle: HiSoft
</ul>
<p align="right"><em>-ros-/-wr- </em>



<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="inet01.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh10.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="inet03.htm">
</MAP><hr></center>


</body>
</html>
