<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusED 4.2">
<title>AMIGA TIMES 02/98 - Aktuelles</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">


<center><h1>Wahl des ICOA Userrepr&auml;sentanten 1998</h1></center>

Vor kurzer Zeit erhielten wir in der Redaktion eine eMail von der &quot;Jay
Miner Society&quot;. In Verbingung mit der &quot;ICOA (Industry Council of the Open
Amiga)&quot; veranstaltet die &quot;JMS&quot; die Wahl des Userrepr&auml;sentanten`98.
Nun folgend, ver&ouml;ffentlichen wir auszugsweise die eMail die wir erhalten
haben, damit Ihr Euch genaustens informieren k&ouml;nnt und aktiv bei der Wahl
dabei seid.
<p>
<i>Anfang M&auml;rz startete eine Wahl, um einen Repr&auml;sentanten der Benutzer im 
F&uuml;hrungskomitee der ICOA f&uuml;r das n&auml;chste Jahr zu bestimmen. Die Wahl wird 
durchgef&uuml;hrt von der Jay Miner Society [JMS], die von dem behelfsm&auml;ssigen 
F&uuml;hrungskomitee der ICOA daf&uuml;r bestimmt wurde. Die Nominierungen wurden 
zwei Wochen lang angenommen, und die Wahl begann eine Woche darauf f&uuml;r 
eine Dauer von zwei weiteren Wochen. 
<p>
Es war von Anfang an klar, dass dies ein knapper Zeitplan war und einige 
Fehler gemacht wurden. Die Nominierungsphase war zu kurz und wurde nicht 
gen&uuml;gend publik gemacht. Die Wahl war ebenso zu sp&auml;rlich angek&uuml;ndigt worden. 
Als Folge war es einigen potentellen Kandidaten nicht m&ouml;glich, sich noch
rechtzeitig zu nominieren, und andere haben vielleicht nichts von der Wahl 
mitbekommen, bis es zu sp&auml;t war. Eine entt&auml;uschend kleine Anzahl Stimmen 
wurde abgegeben, und drei der Kandidaten waren alles andere als ungleich. 
Einige gef&auml;lschte Simmen machten es schwierig zu entscheiden, ob irgendeiner 
von ihnen gewonnen hatte.<br> 
Nach R&uuml;cksprache mit den Kandidaten hat das F&uuml;hrungskomitee der ICOA und 
der JMS beschlossen, die Wahl erneut zu beginnen. Die JMS wird eng mit Team 
AMIGA, dem User Group Network und Amiga-Magazinen zusammenarbeiten, um so 
viele Leute wie m&ouml;glich auf die Wahl und die M&ouml;glichkeit der Stimmenabgabe 
aufmerksam zu machen.</i>
<p>Magazine sollen jetzt bei der zweiten Wahl hier etwas helfen,
was wir von der Amiga Times nat&uuml;rlich gern machen. <i>
<p>
Nominierungen  
<p>
Der User-Rep. wird einen Sitz mit voller Stimmkraft im F&uuml;hrungskomitee 
f&uuml;r die Zeitspanne eines Jahres haben, neben den vier Sitzen der von den 
ICOA-Mitgliedern Gew&auml;hlten und einem st&auml;ndigen nicht-stimmenden Vetositz, 
der von einem Repr&auml;sentanten von Amiga Inc. besetzt wird. Diese Position 
verbindet die Rolle des Konsumentenvertreters, Meinungssammlers, Strategen 
und Verbindungsmann zur Gemeinde, und verlangt ernsthaften Einsatz von Zeit 
und M&uuml;he. Die JMS und andere User-Organisationen werden Unterst&uuml;tzung daf&uuml;r 
bereitstellen. Das Komittee wird ungef&auml;hr alle drei Monate Versammlungen 
abhalten und wird auf ausgesuchten Amiga-Messen auch vertreten sein. Kosten, 
die dem User-Rep. entstehen, um diesen Ereignissen beizuwohnen, werden von 
der ICOA bezahlt. 
<p>
F&uuml;r postalische Nominierungen sind n&ouml;tig:  
<ul>
<li> Name und Unterschrift des Kandidaten mit entweder einer EMail-Adresse  
  oder einer Postanschrift und Telefonnummer. 
<li> Volle Namen und Unterschriften von f&uuml;nf Unterst&uuml;tzenden mit entweder 
  einer EMail-Adresse oder Postanschrift und Telefonnummer von jedem. 
<li> Eine Erkl&auml;rung, dass der Kandidat und die Unterst&uuml;tzer die Wahlprozedur 
  und die Entscheidungen der Schiedsrichter akzeptieren. (Die Prozedur wird 
  auf der Website der JMS zug&auml;nglich sein.) 
<li> Ein Wahl-Beitrag von nicht mehr als 500 W&ouml;rtern f&uuml;r die JMS-Wahl-Website, 
  der dort im Namen des Nominierten ver&ouml;ffentlicht wird. (Die JMS beh&auml;lt 
  sich das Recht vor, jegliche Statements abzulehnen, deren Inhalt zur 
  Verbreitung als nicht legal erscheinen.) 
</ul>
<p>  Nominierungen sind zu senden an: 
<p><table><tr><td valign="top">USA/Kanada</td><td> Andrew Bienhaus<br> 
90 Farr Crescent<br>Cambridge<br>Ontario N3C 1R6<br>Canada </td></tr>
<tr><td valign="top">England</td><td>Ben Hutchings<br>
19 Lewell Avenue<br>Marston<br>Oxford OX3 0RL&quot;</td></tr></table> 



<p>Wahl-Website
 
<p>Die URL ist <a href="http://www.jms.org/election/>.">http://www.jms.org/election/>.</a> Dort werden die vollst&auml;ndigen
 Regeln der Wahl, Statements, Pressemitteilungen, Wahlzettel etc. verf&uuml;gbar
 sein.

<p> Quelle: Ben Hutchings, Gary Peake

<p>Wir bleiben f&uuml;r Euch am Ball und werden demn&auml;chst einen Wahlzettel auf
unserer Homepage ver&ouml;ffentlichen! Dann gibt es auch noch ein paar weitere
Infos und nat&uuml;rlich die Liste der Kandidaten.

<p align="right"><em>-wr-/-mn- </em></p>





<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="news02.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="inhfr02.htm" target="_top">
</MAP><hr></center>


</body>
</html>
