<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 02/98 - Software</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><h1>Wordworth 7</h1></center>

Nach einigen Spezial Versionen, tut es wirklich gut, wiedermal eine neue
-volle-  Version von &quot;Wordworth&quot; benutzen zu k&ouml;nnen. Wordworth 7 gibt es
auf CD ROM und in drei verschiedenen Sprachen. Man hat die Wahl zwischen
&quot;Deutsch&quot;, &quot;Englisch&quot; oder &quot;Franz&ouml;sich&quot;. Hat man sich eine Sprache ausgesucht, mu&szlig; Wordworth installiert werden. Das geht ganz einfach mit dem 
beigelegten Installscript, nach der Installation sucht man sich noch den
richtigen Druckertreiber und ab geht die Post. Nach der Eingabe der Registriernummer wird der Wordworth Bildschirm geladen, welcher in verschiedenen Aufl&ouml;sungen genutzt werden kann. &Auml;u&szlig;erlich hat sich zu den vergangenen Versionen nicht viel ge&auml;ndert, es gibt jetzt einen &quot;Cool Look&quot;, bei
dem die anklickbaren Icons keinen Rahmen mehr haben, jedoch ist diese 
Funktionen eher nebens&auml;chlich. Als erstes setzte ich ein Schreiben auf
und wollte dieses nat&uuml;rlich richtig sch&ouml;n gestalten, mit tollen Fonts
und jeder Menge Grafik, doch Pustekuchen!!! Gerade mal das &quot;Shannen Book&quot;
Font war installiert, und kein`s von den 50 anderen Fonts vorhanden.
Also, schob ich die CD nochmals in mein Laufwerk und suchte die Fonts,
in dem gleichnamigen Verzeichnis befand sich auch ein readme Text, in
dem stand, wie ich die Fonts installieren k&ouml;nne, nun, von Hand ist es
etwas umst&auml;ndlicher... erst kopieren, dann installieren... das h&auml;tte
man auch gleich in den Installscript einbauen k&ouml;nnen. Weiterhin liegen
der CD noch 1000 Cliparts (Grafiken) bei, die ich mit auf die HD b&auml;ndigte
und nachher einen Umfang von knapp 15 MB Wordworth zusprechen konnte.
Aber egal, das war es mir wert.
<p>
Wenn man keinerlei Einstellungen t&auml;tig, sondern sofort losschreibt, kommt
die erste Neuerungenschafft zum Vorschein, und zwar wird jedes falsch geschriebene oder &quot;anders-sprachige&quot; Wort <a href="gfx04.htm">rot unterstrichen</a>, und zwar ist
das die automatische Rechtschreibkorrektur von Wordworth. Diese kann man
nat&uuml;rlich abstellen.
<p>
Weiterhin hat man jetzt die M&ouml;glichkeit Polygonen einzuf&uuml;gen, was ich anhand
des folgenden <a href="gfx05.htm">Bild </a> zeigen m&ouml;chte. Doch das ist nicht alles, es gibt noch
einiges mehr, was &quot;Wordworth 7&quot; zu bieten hat, da w&auml;ren doch zum Beispiel:
&quot;Tabellen, Fu&szlig;- und Endnoten, Listenherstellung, Bildrahmen, verkn&uuml;pfbare 
Textrahmen, Passwortsicherung von Dokumenten und der Import von PC &amp; Mac 
Dateien&quot;, da&szlig; sind aber nur ein paar neue Eigenschaften. Auch ist jetzt neu,
die Option des Assistenten, der zum Beispiel das Erstellen von WebSites erm&ouml;glicht und dies sehr vereinfacht, doch es gibt noch andere Assistenten 
(f&uuml;r Rechnung, Memo, Serienbriefe oder Faxvorlage). Eine weitere neue Funktion ist die Einbindung von &quot;Quick Shapes&quot;. Um Euch das zu erkl&auml;ren, solltet
Ihr Euch dieses <a href="gfx06.htm">Bild </a> ansehen.
<p><table><tr><td valign="top">
Fazit:</td><td> &quot;Wordworth&quot; zeigt mit seinen neuen Funktionen doch schon allerhand
       und ein Neukauf bzw. ein Update zur Version 7 ist schon eine gute
       Idee. Mit &quot;Wordworth&quot; kann man seine Texte sehr gut gestalten, die
       Textrahmen Funktion l&auml;&szlig;t dem &quot;Layouter&quot; viel Freiraum und man kann
       eigentlich schon profesionell Texte produzieren. Mit den vielen Grafiken kann man seine Texte, Briefe oder andere Schriften noch unterlegen oder verbessern. Negativ ist jedoch, da&szlig; man relativ wenig
       Schrifts&auml;tze zur Verf&uuml;gung hat, denn die 50 angepriesenen Fonts,
       sind im Endeffeckt nur zustande gekommen, da zu jedem Font noch die
       fetten oder kursiven Fonts dazu geh&ouml;ren (z.B.: Guardian, Guardian_
       Bolditalic, Guardian_Italic, Guardian_Bold, also nur 1 Font, mit 3
       anderen Formatierungsm&ouml;glichkeiten). Trotz dieses Makels, gef&auml;llt
       mir &quot;Wordworth 7&quot; wirklich und ich kann es nur jedem empfehlen.
       F&uuml;r weitere Versionen w&uuml;nsche ich mir mehr Fonts, die auch automatisch installiert werden (FinalWriter hat hier einen Vorteil). <b> -Empfehlenswert- </b></td></tr></table>
      
<pre>
Preis: Vollversion 129,- DM
       Update       89,- DM
</pre>
<p align="right"><em>-mn- </em></p>
<p>
<b>Quelle:</b><br>
Stefan Ossowskis Schatztruhe<br>
Gesellschaft f&uuml;r Software mbH<br>
Veronikastra&szlig;e 33<br>
45131 Essen<br>
Tel: 0201/78 87 78<br>
Fax: 0201/79 84 47<br>
eMail: <a href="mailto:stefano@schatztruhe.de">stefano@schatztruhe.de</a><br>
www: <a href="http://www.schatztruhe.de">http://www.schatztruhe.de</a>

<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="inh02.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh02.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="softw02.htm">
</MAP><hr></center>
</body>
</html>
