<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 02/98 - Software</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><h1>yam 2.0</h1></center>

better than the best???
<p>
eMails... die sch&ouml;nste Sprache der Welt?! Nun, das stimmt doch, denn
sie sind schnell und kosteng&uuml;nstig versandt und dazu noch komfortabel!
eMails haben sich schon einen sehr guten Stand verschafft, doch ohne ein
richtiges eMail Programm, ist der Spa&szlig; nur halb so gro&szlig;. Shareware, aber
auch Freeware Programme gibt es seit geraumer Zeit f&uuml;r den Amiga und wer
nur einmal im Aminet ist, findet dort sicher ein geeignetes Programm.
<p>
&quot;Yam&quot; ist sehr bekannt und sehr beliebt bei den Usern, die Bedienung ist
&auml;u&szlig;erst leicht und man kann schnell Mails versenden, empfangen und bearbeiten, ohne gro&szlig;e Konfigurationen erledigen zu m&uuml;ssen. &quot;Yam&quot; ist Free-
ware, ein Lob an den Autor w&auml;re angebracht, da die neue Preview Version
&quot;2.0&quot; schon sehr professionell aussieht und jede Menge Funktionen bietet.
<p>
&quot;Yam&quot; wurde jetzt mit kleinen Grafiken ausgestattet, welche die jeweiligen
Optionsbutton &quot;darstellen&quot;. Der Aufbau l&auml;st sich aber am besten mit einem
<a href="gfx07.htm">Bild</a> erkl&auml;ren.
<p>
&quot;Yam 2.0&quot; ist sehr umfangreich geworden, das Adressbuch bietet viele neue
M&ouml;glichkeiten, jetzt kann man die komplette Anschrift, eventuell ein gescanntes Pa&szlig;foto und vieles mehr einf&uuml;gen. &quot;Yam&quot; ist dadruch noch leichter
zu handhaben, jedoch dauert daf&uuml;r auch die Ladezeit etwas l&auml;nger.
<p>
&quot;Yam 2.0&quot; ist derzeit noch in der letzten Bearbeitungsphase, seit einiger
Zeit gibt es schon Previews und mit denen kann man sich schon ein gutes
Bild der &quot;Lage&quot; verschaffen.
<p>
&quot;Yam 2.0&quot; ist voll Updatefahig und &uuml;bernimmt bei der Installation (in das
alte &quot;Yam&quot; Verzeichnis) das alte Adressbuch, sowie die voreingestellte
Konfiguration und den alten Cache. Der Freeware Status ist sehr lobenswert
und ich kann &quot;Yam&quot; nur jedem User empfehlen!
<p>
Leider wie&szlig; die Preview Version einige Bugs auf, welche aber laut Marcel
Beck gr&ouml;&szlig;tenteils behoben werden, so st&uuml;rzte mir der Rechner immer dann
ab, als ich eine Mail l&ouml;schen wollte. Negativ fand ich auch, da&szlig; die
Option &quot;Archivieren&quot; rausgelassen wurde und man die Mails jetzt verschieben
mu&szlig; und nicht einfach nur auf Archivieren klicken und das wars. Mehr ist
mir bis jetzt aber nicht aufgefallen! Einen ausf&uuml;hrlichen Test gibt es nach
erscheinen der Endversion!
<p><table><tr><td valign="top">
Fazit:</td><td> &quot;Yam 2.0&quot; (Preview 3) ist trotz seiner vielen neuen und alten
       Funktionen nicht umst&auml;ndlich geworden und hat einiges auf dem
       kasten. Das (be-)arbeiten mit (von) eMails wird leichter und
       man kommt schnell zum Ziel. Ich bleibe dabei:&quot; Yam ist f&uuml;r mich
       der beste eMailer den es f&uuml;r den AMIGA gibt... get it now!
       <i><b>- Sehr gut -</i></b></td></tr></table>


<p align="right"><em>-mn- </em>

<p>
<b>Bezug:</b> <a href="http://www.yam.ch">http://www.yam.ch</a>



<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="softw08.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh02.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="softw10.htm">
</MAP><hr></center>

</body>
</html>
