<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CyugnusEd 4.2">
<title>AMIGA TIMES 02/98 - Software</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
<center><h1>Siegfried Soft</h1></center>


<p>&quot;Siegfried Soft&quot; d&uuml;rfte ja eigentlich jedem User bekannt sein. Programme
wie &quot;Siegfried Anti Virus&quot; oder &quot;Siegfried Copy&quot; gibt es ja schon seit
Jahren f&uuml;r den Amiga. Nat&uuml;rlich werden diese Programme auch erweitert
und wir haben uns da mal folgende Programme angesehen...

<p><center>|<a href="#copy"> Siegfried Copy v2.2 </a>|
<a href="#alpha"> Siegfried Copy Alpha </a>|
<a href="#trans"> Siegfried Translate </a>|
<a href="#virus"> Siegfried Anti Virus Pro v1.8 </a>|

<hr>
<h2><a name="copy">Siegfried Copy v2.2</a></h2></center>

<p>Kopieren, die leichteste Sache der Welt, ist in letzter Zeit nicht mehr
so aktuell, zumahl die CD ROM`s den Markt erobern und man kaum noch etwas
kopieren m&uuml;&szlig;te - Raubkopien sollte man ja sowieso nicht machen!!!

<p>&quot;SFCopy&quot; in der Version 2.2 gibt es deutsch, als auch englisch in einer
einzelnen Version und l&auml;uft auf allen Rechnern. Die &quot;Steuerung&quot; ist gut
und einfach. Viele verschiedene Formate k&ouml;nnen angewndt werden, sowohl
beim Kopieren, wie auch beim Formatieren. Weiterhin kann &quot;SFCopy 2.2&quot;
kann auch Schreibgesch&uuml;zte Disketten kopieren. Unterst&uuml;tzung von HD
Disketten ist ebenfalls vorhanden. Wenn man im Besitz von einem zweiten
Diskettenlaufwerkist, kann man mit SFCopy allerhand anstellen, aber auch
ohne, geht es prima.

<p>Doch was ist neu an Version 2.2??? &Auml;nderungen/Erweiterungen Version:


<p>Verbesserte Hardware-Kopierroutinen. Steigerung der Kopierf&auml;higkeit und 
  -sicherheit von HD-PC&#009;Disketten per FLASH1-Kopiermodul. Mit den
  aktualisierten Kopierroutinen stellen auch sog. &quot;FingerPrints&quot; kein
  Problem beim Erstellen von Sicherungen dar! Die besten Erfolge beim
  Sichern von Disketten mit &quot;Fingerprints&quot; ist der Kopiermodus &quot;Hardware
  synchronisiert&quot;.
<p>&Uuml;bernahme des SYNC aus SYNC-Analyse per Mausklick. Durch einfachen Mausklick
  SYNC-Werte aus dem SYNC-Analysefenster zum Kopieren &uuml;bernehmen. Hierzu
  wurde das Untermen&uuml; &quot;Tools/Sync&quot; ge&auml;ndert. Der Eintrag &quot;Show&quot; wurde in 2
  Men&uuml;punkte aufgeteilt. &quot;Print&quot; verh&auml;lt sich genau wie der alte Men&uuml;punkt
  &quot;Show&quot;, er dient zum Anzeigen und Speichern/Drucken der SYNC-Werte.
  &quot;Select&quot; zeigt auch die SYNC-Werte an, hier kann aber per Mausklick ein
  SYNC-Wert angew&auml;hlt werden und per &quot;OK&quot; bzw. Doppelklick in die aktuelle
  SYNC-Einstellung &uuml;bernommen werden.
<p>Analyser erweitert. Der Analyzer untersucht jetzt auch Archive die mit dem
  Diskettenarchivierer &quot;ZOOM&quot; erstellt wurde. Dazu wurde das Untermen&uuml;
  &quot;File List/Check Archives&quot; um den Men&uuml;punkt &quot;ZOOM&quot; erweitert.
<p>Virenerkennung aktualisiert </i> (Quelle: SFCopy 2.2 / Bitte_lesen.guide)

<p><table><tr><td valign="top">Negativ:</td> 
<td>Laut Siegfried Soft, macht &quot;SFCopy 2.2&quot; etwas Probleme bei Disk
Expander Benutzern. Ein Nachlesen im Handbuch sollte hier aber
Abhilfe schaffen.</td></tr></table>

<p>Ein kleines Tool rundet dann noch das (positive) Gesamtbild ab. Und 
zwar kann man in &quot;Siegfried Copy&quot; auch Soudnmodule h&ouml;ren, welche man
auf der Platte hat. Unterst&uuml;tzt werden hierbei alle Sound/Noise/Protracker-, S3M-, MED-, OctaMED-, OctaMED Studio-, Oktalyzer-, Digital
Sound Studio-, Future Composer Module (u.a.). Nette Idee, damit die
Wartezeit nicht so langsam und eint&ouml;nig wird. <b><i>- Gut - </b></i>

<p>SFCopy ist Multitasking f&auml;hig und eines fand ich sehr toll, sobald man
SFCopy gestartet hat, ein Mod im Hintergrund ausw&auml;hlte und danach das
Programm neustartet, beginnt das Modul automatisch zu spielen. So hat
man von anfang an Musik dabei.

<p><table><tr><td valign="top">Fazit:</td><td> F&uuml;r den Preis von 79,- DM ist SFCopy zwar etwas teuer, bietet aber
       mehr Funktionen als vergleichbare Programme. Sicherlich kann man
       auch mit PD Programmen kopiren und das auch sehr gut, doch wer
       ein professionelles Programm haben m&ouml;chte, ist mit SFCopy 2.2 gut
       bedient.</td></tr></table>

<hr><center>|<a href="#copy"> Siegfried Copy v2.2 </a>|
<a href="#alpha"> Siegfried Copy Alpha </a>|
<a href="#trans"> Siegfried Translate </a>|
<a href="#virus"> Siegfried Anti Virus Pro v1.8 </a>|
<h2><a name=alpha>Siegfried Alpha, Editor ohne Makel???</a></h2></center>

<p> Editoren gibt es wie Sand am Meer. Ob PD, Shareware oder
kommerziell, man bekommt alles um seine Texte zu bearbeiten
oder um ersteinmal welche zu schreiben. &quot;Siegfried Aplha&quot;
ist ebenfalls ein Editor, obwohl man ihn von einigen F&auml;higkeiten auch schon als richtige Textverarbeitung einordnen
k&ouml;nnte. Um Euch die Men&uuml;`s und die Oberfl&auml;che am besten zu
verdeutlichen (zu zeigen) solltet Ihr Euch folgendes <a href="gfx01.htm" target="main">Bild</a> 
mal ansehen.

<p>Die Bedienung ist sehr leicht und erinnert an das uralte
Programm &quot;Transcript&quot;, welches aber auch noch sehr gut
funktioniert.

<p>Man hat die M&ouml;glichkeit verschiedene Textformate anzuwenden
oder sogar die Texte ins PC Format zu konvertieren. Die Opt-
ionen sind f&uuml;r einen Editor sehr reichlich und beinhalten
ebenfalls die Benutzung von Makros. Tja... was sollte ich
noch erw&auml;hnen??? &quot;Siegfried Aplha&quot; ist sehr schnell im lesen
von Bin&auml;rdatein, zwar ist das nicht sooo wichtig, aber manche
- die gern in Spieldatein rumschreiben um sich das Game zu
erleichtern - bekommen hier ihre Daten in k&uuml;rzester Zeit ge-
laden. Eine 720 KB Datei brauchte weniger als 5 Sekunden, da&szlig;
ist doch was???

<p>Leider bietet &quot;Alpha&quot; nicht die M&ouml;glichkeit andere Fonts zu-
benutzen, so da&szlig; man dem alten Topaz wieder die Treue halten
mu&szlig;.

<p><table><tr><td valign="top">Fazit:</td><td> &quot;Siegfried Alpha&quot; ist ein guter Texteditor.
       Eine leichte Bearbeitung von Texten oder Dateien
       ist garantiert, da es sehr einfach ist, diesen
       Editor zu benutzen. F&uuml;r den Preis von knapp 90,- DM
       bekommt man ihn im Handel oder bei Siegfried Soft.
       Leider kann &quot;Siegfried Aplha&quot; nicht mit CygnusED
       mithalten, trotzdem sollte man sich vorhandene
       Demos besorgen und sich den Editor mal ansehen
       und dann entscheiden. <i><b>- Gut - </i></b></td></tr></table>

<hr><center>|<a href="#copy"> Siegfried Copy v2.2 </a>|
<a href="#alpha"> Siegfried Copy Alpha </a>|
<a href="#trans"> Siegfried Translate </a>|
<a href="#virus"> Siegfried Anti Virus Pro v1.8 </a>|
<h2><a name=trans>Siegfried Translate, der bessere Englischlehrer???</a></h2></center> 

<p>Wer kennt das nicht, trotz langj&auml;hriger Schulausbildung hagt es des
&ouml;ftern bei der englischen Sprache. Sehr oft machen weniger Wortgruppen
Probleme, als vielmehr einzelne W&ouml;rter. Jetzt gibt es nur eine M&ouml;glich-
keit, ein W&ouml;rterbuch. Doch es geht auch einfacher, mit dem &quot;Siegfried
Translate&quot; Programm. Der 3 Disketten umfassende &Uuml;bersetzer nimmt ca. 11
MB Festplattenspeicher ein und ben&ouml;tigt mindestens Kickstart 2.04!

<p>Nach der einfachen, aber langwierigen Installation, startete ich das
Programm und es &ouml;ffnete sich ein kleines Fenster am oberen Bildschirm-
rand - nicht mehr. Das Fenster konnte man nat&uuml;rlich auf Vollbild ver-
gr&ouml;&szlig;ern, da&szlig; sieht dann <a href="gfx02.htm" target="main">so</a> aus.

<p>Das Programm enth&auml;lt mehr als 60.000 Begriffe und kann sowohl ins
englische, als auch ins deutsche &uuml;bersetzen.

<p>Weiterhin bietet &quot;Siegfried Translate&quot; die M&ouml;glichkeit des Screen &quot;Jumps&quot;,
was soviel bedeutet wie, da&szlig; das Fenster von &quot;Translate&quot; auch in andere
existierende Fenster wechseln kann, was sich gerade bei Browsern bew&auml;hrt.
Kann man ein Wort nicht &uuml;bersetzen und es sich auch nicht von der Recht-
schreibung her merken, &quot;Jump&quot;t man einfach ins (vor's) Browserfenster und
kann dann nach dem entsprechenden Wort suchen und es sich (falls vorhanden)
ins deutsche &uuml;bersetzen lassen.

<p>&quot;Siegfried Translate&quot; ist sehr umfangreich und einfach in der Bedienung.
Man findet auf anhieb mindestens eine &Uuml;bersetzung zu einem Wort, ab und
zu sogar 5 deutsche W&ouml;rter. Leider kann &quot;Siegfried Translate&quot; keine Texte
&uuml;bersetzen, vielleicht auch gut so, wer wei&szlig; was da wieder f&uuml;r ein Quatsch
(Ausdrucksm&auml;&szlig;ig) rauskommen w&uuml;rde. Aber auch Wortgruppen akzeptiert das
Programm nicht, man kann nur einzelne W&ouml;rter eingeben bzw. in der Liste
allein danach suchen.

<p>&quot;Siegfried Translate&quot; gibt es f&uuml;r 79,- DM und sollte einige &Uuml;berlegung
wert sein. Gerade im privaten Gebrauch ist es oft sehr n&uuml;tzlich und 
bietet schnelle Hilfe bei &Uuml;bersetzungsproblemen. <b><i>- Empfehlenswert - </b></i>

<p><table><tr><td valign="top">Fazit:</td><td> &quot;Siegfried Translate&quot; hat viele Vorteile und nur sehr wenige
       Nachteile. Die Option der kompletten Text&uuml;bersetzung ist wahr-
       scheinlich nur aus einem Grund nicht mit eingebunden. Was
       bringt auch schon eine &Uuml;bersetzung, bei der nur die einzelnen
       W&ouml;rter &uuml;bersetzt werden, der Satz im Gesamtbild keinen Sinn
       mehr ergibt? Von daher ist es auch besser so.
       Gerade wer mit Englisch noch etwas Probleme hat, sollte sich
       das Programm zulegen, da man einerseits etwas mit lernt und
       andererseits schneller zum Erfolg kommt, als wenn man erst im
       W&ouml;rterbuch nachschl&auml;gt.</td></tr></table>

<hr><center>|<a href="#copy"> Siegfried Copy v2.2 </a>|
<a href="#alpha"> Siegfried Copy Alpha </a>|
<a href="#trans"> Siegfried Translate </a>|
<a href="#virus"> Siegfried Anti Virus Pro v1.8 </a>|
<h2><a name=virus>Siegfried Anti Virus Pro, Viren ade???</a></h2></center>

<p>Und ein weiterer Siegfried Artikel. &quot;Anti Virus&quot; ist ein sehr bekannter
Virusbek&auml;mpfer und schon lange auf dem Amiga im Einsatz. Die Vorliegende
Version 1.8 hat nat&uuml;rlich wieder ein paar neue Funktionen, die ich am
besten mal hier kurz aufschreibe...

<p>&Auml;nderungen/Erweiterungen Version 1.8:

<p>Blockcheck auf Bitmaps bezogen bei OFS und FFS Filesystemen. Dies f&uuml;hrt
  zu einer verbesserten Suchgenauigkeit und einer Erh&ouml;hung der
  Suchgeschwindigkeit. Es werden nur belegete Datenbereiche einer Spur
  gepr&uuml;ft. Je nachdem wie voll eine Platte ist liegt die Geschwindigkeits-
  steigerung zwischen 10-400% (!).

<p> Automatisches Speichern von Protokollen. Die Namen der Protokolldateien
  k&ouml;nnen automatisch Datumsabh&auml;ngig erzeugt werden. Dazu wurde der
  Men&uuml;punkt &quot;Prefs/Protokoll&quot; umgestellt. &Uuml;ber diesen Men&uuml;punkt &ouml;ffnet sich
  ein Fenster in dem alle relevanten Daten f&uuml;r das Protokoll eingestellt
  werden k&ouml;nnen, wie z.B. welche Ereignisse protokolliert werden oder ob
  eine Protokolldatei automatisch angelegt werden soll. Folgende
  Einstellm&ouml;glichkeiten stehen zur Verf&uuml;gung:

  <p>&quot;Pfad und Name der Protokolldatei&quot;
    Hier kann ausgew&auml;hlt werden wie eine automatische Protokolldatei hei&szlig;em
    soll und wo sie liegt. Die Angaben k&ouml;nnen direkt eingegeben werden oder
    &uuml;ber ein Dateiauswahlfenster gew&auml;hlt werden. Als Standard wird
    &quot;RAM:SFAP%m%d.log&quot; vorgegeben.
    Der Name der automatischen Protokolldatei kann folgende Platzhalter
    beinhalten:
    %d = Tag (2-stellig)
    %m = Monat (2-stellig)
    %y = Jahr (2-stellig)
    Die Platzhalter k&ouml;nnen in beliebiger Reihenfolge beim Dateinamen 
    angegeben werden.
    Sobald ein neues Protokoll gestartet wird werden die Platzhalter durch 
    die aktuellen Datumsangaben ersetzt. &Uuml;ber die Platzhalter ist es z.B.
    m&ouml;glich automatische Protokolle f&uuml;r einzelne Tage oder Monate zu 
    erstellen.
  <p> &quot;Nicht schreiben&quot;
    Das Erzeugen automatischer Protokolldateien kann &uuml;ber diesen Punkt
    ausgeschaltet werden (Standardeinstellung)
  <p> &quot;Anh&auml;ngen&quot;
    Jede Aktion von Siegfried Antivirus wird fortlaufend in der
    automatischen Protokolldatei gespeichert. Da so ziemlich jede Aktion
    von Siegfried Antivirus ein Protokoll erzeugt, kann mit der Zeit die
    automatische Protokolldatei ziemlich gro&szlig; werden!
  <p> &quot;&Uuml;berschreiben&quot;
    Bei jeder neuen Aktion die ein Protkoll erzeugt wird die bestehende
    automatische Protokolldatei wieder neu &uuml;berschrieben. Der Inhalt der 
    automatischen Protokolldatei entspricht dann dem was auch &uuml;ber das
    Gadget &quot;Protokoll&quot; zu sehen w&auml;re.
  <p> &quot;Sicheres Speichern&quot;
    Soll eine automatische Protokolldatei erzeugt werden kann zus&auml;tzlich
    &uuml;ber diesen Schalter die Art des Speichern bestimmt werden.
    Normalerweise wird beim Start eines Protokolls die Protokolldatei
    ge&ouml;ffnet und beschrieben. Nachdem die Aktion beendet wurde wird die
    Datei geschlossen. Ist &quot;Sicheres Speichern&quot; dagegen aktiv, wird die
    Protokolldatei immer dann ge&ouml;ffnet wenn Daten geschrieben werden und
    danach sofort wieder geschlossen. Dies hat folgenden Vorteil: sollte
    es w&auml;hrend des Virussuchen zu einem Absturz kommen (z.B. durch eine
    defekte Datei) ist die bis zu diesem Zeitpunkt getane Arbeit gesichert
    (oder in Falle der defekten Datei kann man den Dateinamen ermitteln.
  <p> &quot;Virus&quot;, &quot;Packer&quot;, &quot;Programme&quot;
    Hier wird eingestellt was von Siegfried Antivirus protokolliert werden
    soll. &quot;Virus&quot; protokolliert alle gefunden Viren (Standardeinstellung),
    mit &quot;Packer&quot; werden alle Programme ausgegeben die gepackt sind und mit
    &quot;Programme&quot; werden alle ausf&uuml;hrbaren Dateien protokolliert.

  <p>&Uuml;ber &quot;Weiter&quot; werden die Getroffenen Angaben &uuml;bernommen. &quot;Abbruch&quot; verwirft
  alle Einstellungen. Wie gewohnt k&ouml;nnen die Einstellung von 
  &quot;Prefs/Protokoll&quot; in den Voreinstellungen dauerhaft gespeichert werden.

<p> Archiv&uuml;berpr&uuml;fung erweitert. Auf vielfachen Kundenwunsch haben wir die
  Archiv&uuml;berpr&uuml;fung um den Diskettenpacker &quot;Zoom&quot; erweitert. Die &Uuml;berpr&uuml;fung
  wird &uuml;ber den Men&uuml;punkt &quot;Prefs/.../Zoom&quot; aktiviert. Zur Benutzung mu&szlig; sich
  Zoom im Verzeichnis f&uuml;r Packer befinden. Getestet haben wir mit ZOOM V5.1.

<p> Virenerkennung aktualisiert! </i> Quelle: Siegfried Anti Virus Pro/Bitte_lesen.guide

<p><a href="gfx03.htm" target="main">Bild</a> &quot;SFAnti Virus&quot; ist sehr gut, ob man einen
schnellen Plattencheck machen will oder intensiv nach Viren sucht, hier
zeigen sich die St&auml;rken dieses Programms. Zum Preis von 79,- DM zwar nicht
ganz billig, aber ob ich mir eine neue Festplatte kaufen oder sie damit
repariere ist schon einige &Uuml;berlegung wert. Im schnellen Check ist &quot;SfAnti
Virus&quot; noch schneller als das bekannte PD-Programm &quot;VT-Schutz&quot;. Funktionen
wie Archive entpacken und diese zu&uuml;berpr&uuml;fen k&ouml;nnen f&uuml;r &quot;h&auml;ufig Aminet&quot;
Anwender sicherlich gut sein, damit sie ihre zeitintensiven Downloads nicht
durch irgendwelche Viren verlieren.

<p>&quot;SFAnti&quot; bietet auch wieder die M&ouml;glichkeit des Background-Sounds und kann
Aufgrund der leichten Bedienbarkeit begeistern.

<p><table><tr><td valign="top">Fazit:</td><td> Wer viel mit Viren Probleme hat, sollte sich &quot;SFAnti Virus&quot; auf-
       jedenfall zulegen. Auch wer mit seiner Platte ansich Probleme
       hat (Pr&uuml;fsummenfehler, Bootblockprobleme) findet hier die L&ouml;sung.
       <b><i>- Empfehlenswert - </b></i></td></tr></table>

<hr><center>|<a href="#copy"> Siegfried Copy v2.2 </a>|
<a href="#alpha"> Siegfried Copy Alpha </a>|
<a href="#trans"> Siegfried Translate </a>|
<a href="#virus"> Siegfried Anti Virus Pro v1.8 </a>|</center>
<p><table><tr><td valign="top"><b>Abschlie&szlig;end:</b></td><td> Siegfried Soft ist und bleibt die erste Anlaufstelle
              wenn es um professionelle Programme jeglicher Art geht.
              Doch man sollte bedenken, ob man nicht auch etwas kosten-
              g&uuml;nstiger wegkommt, zum Beispiel im Aminet. Dort ist jedoch
              die Gefahr von Fehlern oder falscher Programmierung nicht
              auszuschlie&szlig;en. Also... dann lieber ein paar Mark mehr und
              Qualit&auml;t, als fast umsonst und fehlerhaft.</td></tr></table>
<p align="right"><em>-mn-/-sph-</em></p>

<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="softw06.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh02.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="softw08.htm">
</MAP><hr></center>

</body>
</html>
