<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 02/98 - Software</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><h1>Amiga Forever v2.0</h1></center>

F&uuml;r immer dein
<p>
Es f&auml;llt schwer, sich von seiner Freundin zu trennen, die einem so lange
treu war, um sie durch einen langweiligen grauen Kasten zu ersetzen, von
dem man genau wei&szlig;, das man damit nie wieder so viel Spa&szlig; haben wird, wie
mit seinem Amiga. Aber auch graue K&auml;sten k&ouml;nnen ein bi&szlig;chen bunt werden,
f&uuml;r Nostalgiker und alle, die sich, aus welchen Gr&uuml;nden auch immer, einen
Standard-PC zulegen m&uuml;ssen, hat Cloanto Amiga Forever herausgebracht.
<p>
Der Amiga Explorer ist ein Zusatzprogramm f&uuml;r Windows 95, das per Nullmodemkabel oder ein TCP/IP den Zugriff auf die Laufwerke eines Amiga
erm&ouml;glicht. Es k&ouml;nnen nicht nurdie einzelnen Dateien oder ganze Verzeichnisb&auml;ume, sondern auch Disketten in Form von ADFs und das Kickstart-ROM
&uuml;bertragen werden.
<p>
Die n&ouml;tige Software am Amiga ist denkbar einfach zu installieren: 
Einfach das AExplorer-Icon von der Diskette in eine beliebige Schublade
ziehen, ggf. sogar in WBStartup, und per Doppelklick starten. &Uuml;ber die
Tooltypes k&ouml;nnen s&auml;mtliche Parameter eingestellt werden.
Unter Windows 95 dagegen wird von der CD erst mal das Installationsprogramm gestartet, das den Amiga Explorer und die Emulatoren UAE (f&uuml;r
DOS und Windows) und Fellow einrichtet. Wenn die Emulatoren installiert
werden, t&auml;uscht &uuml;brigens die Angabe des ben&ouml;tigten Platzbedarfs auf der
Festplatte von 36 MB, denn hier wurde nich ber&uuml;cksichtigt, da&szlig; in diesen
36 MB viele kleine Dateien enthalten sind, die je nach Clustergr&ouml;&szlig;e,
ordentlich zus&auml;tzlichen Platz fordern k&ouml;nnen. Die 66 MB Kapazit&auml;t, die auf
dem Testrechner noch frei waren, reichten jedenfalls nicht aus, hier mu&szlig;te
erst ein komprimiertes Laufwerk eingerichtet werden. &Auml;rgerlich war, da&szlig;
das Installationsprogramm lediglich ein leeres Fehlermeldungsfenster ausgab,
das erst nach mehrmaligen anklicken des OK-Buttons wieder verschwand und
die Installation daraufhin abgebrochen wurde. Ist der Amiga Explorer endlich installiert, kann er &uuml;ber einen Klick mit der rechten Maustaste auf
das Amiga Explorer-Icon konfiguriert werden. <a href="gfx10.htm">Bild</a>
<p>
Der AmigaExplorer erscheint im Explorer-Fenster mit dem Icon Amiga Computer,
als dessen Unterpunkte wiederum die Laufwerke des Amiga erscheinen. Hier 
lassen sich nun wie auch sonst unter Windows Dateien und Verzeichnisse vom
und zum Amiga kopieren. Leider erwie&szlig; sich eine Verbindung mit 115.200 bps
als instabil, 57.600 bps dagegen machten keinerlei Probleme, so konnte dann
eine 1 MB gro&szlig;e Datei in 3 Minuten und 10 Sekunden &uuml;bertragen werden. Die-
selbe Datei wurde &uuml;brigens unter Verwendung von zwei Terminalprogrammen und
des ZModem-Protokolls &uuml;ber eine 115.200er Verbindung in 2 Minuten &uuml;berspielt.
Zwar kommt es bei dieser Geschwindigkeit auch bei ZModem zu Fehlern, aber
das Protokoll erkennt das und schickt die fehlerhaften Bl&ouml;cke einfach nochmal, w&auml;hrend beim AmigaExplorer nur ein Neustart von Windows half. Bei den
Testrechnern handelte es sich &uuml;brigens um einen Pentium 166 MMX und einem
Amiga 1200 mit einer Blizzard 1230/IV. Eine &Uuml;bertragung per TCP/IP w&auml;re zwar
schneller und w&uuml;rde von dem Programm auch unterst&uuml;tzt, wer aber seinen Amiga
mit dem Windows-PC vernetzt hat, wird den Amiga Explorer ohnehin nicht ben&ouml;tigen. <a href="gfx11.htm">Bild </a>
<p>
Die Emulatoren UAE und Fellow sind bereits vorinstalliert, UAE kommt sogar
mit Personal Paint 7.1 auf seiner Amiga-Partition. Auf der CD ist auch noch
UAE f&uuml;r Unix, Macintosh und die ber&uuml;hmt-ber&uuml;chtigte Amiga-Version zu finden,
alle bisher dagewesenen Versionen des AmigaOS und ein Interview mit Jay Miner.
Ich will hier nicht auf die Emulatoren eingehen, ich denke, es wurde schon
genug dar&uuml;ber berichtet.
<p>
Eine weitaus preiswertere Methode zur Daten&uuml;bertragung zwischen Amiga und 
eigentlich jedem anderen Computersystem w&auml;re es, auf beiden Seiten ein 
Terminalprogramm laufen zu lassen und die Daten per ZModem zu &uuml;bertragen.
Sollten allerdings mehrere Dateien, noch dazu in verschachtelten Unterver-
zeichnissen, auf den anderen Rechner gelangen, w&auml;re es n&ouml;tig, diese samt 
Pfadangaben in ein Archiv zu packen, etwas mehr Handarbeit also.
Die Emulatoren sind Public Domain, also auch in PD-Sammlungen, Mailboxen
und im Internet zu finden. Wer sich das Zeug lieber selbst saugt, mu&szlig; diese
auch selbst konfigurieren, w&auml;hrend die Programme mit Amiga Forever per Mausklick bereits hervorragend vorinstalliert auf die Platte kommen.
Insgesamt w&auml;re Amiga Forever eine interessante CD, aber der Preis von 119 DM
erscheint mir doch ein wenig zu hoch, trotz der damit verbundenen AmigaOSLizenzen.

<p align="right"><em>Stephan Sommer</em></p>
<p>
<b><u>Quelle:</u></b><p>
Stefan Ossowskis Schatztruhe<br>
Gesellschaft f&uuml;r Software mbH<br>
Veronikastra&szlig;e 33<br>
45131 Essen<br>
Tel: 0201/78 87 78<br>
Fax: 0201/79 84 47<br>
eMail: <a href="mailto:stefano@schatztruhe.de">stefano@schatztruhe.de</a><br>
www: <a href="http://www.schatztruhe.de">http://www.schatztruhe.de</a>


<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="softw02.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh02.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="softw04.htm">
</MAP><hr></center>
</body>
</html>
