<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 02/98 - Software</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><h1>Aminet Set 6 - das gigabyte pack</h1></center>

Es war schon toll, den &quot;Aminet Set 6&quot; Pack in H&auml;nden halten zu k&ouml;nnen,
denn da hatte ich doch tats&auml;chlich an die 4 Gigabyte Daten in der Hand.
Wow, kennt Ihr den Film &quot;Vernetzt&quot;? Der hauptdarsteller dort w&auml;re &uuml;ber
eine solche Datengr&ouml;&szlig;e sicherlich mehr als begeistert, doch auch ich, ein
Otto-Normal User aus Deutschland bin von dem Set angetan. Aufgeteilt ist
Set 6 in CD &quot;a&quot;, welche Tools enth&auml;lt, in CD &quot;b&quot;, die mit Grafiksoftware
und Bildern vollgestopft ist, in CD &quot;c&quot;, die sich auf den Fun Teil (Games,
Demos...) spezialisiert und in CD &quot;d&quot;, auf der sich mehr als 1000 MB Soundmodule befinden. 
<p>
Jetzt sehen wir uns die CD-ROM`s mal einzeln an.
<p>
<b>cd 1 - tools</b>
<p>
Auf dieser CD findet man haupts&auml;chlich die Verzeichnisse <i>comm, dev, disk,
docs, hard, text und util </i>. Ich glaube die jeweiligen Verzeichnisse
brauche ich nicht zuerkl&auml;ren, denn wer von den Online Usern war noch nicht
im Aminet??? Die 620 MB umfassende CD hat sehr viele beinhaltet zwar auch
die anderen Directorys des Aminets, doch die anderen sind hier im Hintergrund gestellt worden, denn daf&uuml;r war auf den anderen CD`s noch genug Platz.
Wie sieht es jetzt nun aus? Es gibt...
<p><center><table width=50%>
<tr><td>comm</td><td>113 MB</td><td>678 Dateien</td></tr>
<tr><td>dev </td><td>115 MB</td><td>351 Dateien</td></tr>
<tr><td>disk</td><td>&nbsp;16 MB</td><td>&nbsp;81 Dateien</td></tr>
<tr><td>docs</td><td>181 MB</td><td>341 Dateien</td></tr>
<tr><td>hard</td><td>&nbsp;&nbsp;7 MB</td><td>&nbsp;60 Dateien</td></tr>
<tr><td>text</td><td>&nbsp;34 MB</td><td>119 Dateien</td></tr>
<tr><td>util</td><td>118 MB</td><td>826 Dateien</td></tr>
</table></center><p>
Doch schon eine stattliche Gr&ouml;&szlig;e, und beinhaltet komplett neue Sachen,
gegen&uuml;ber dem Set 5. Wer noch alte Mag Ausgben sucht, findet hier noch
einige und auch viele Tools f&uuml;r Internetsoftware, eMail Programme oder
einfach nur Hilf-Guides, hier ist wieder alles dabei. Wer jedoch lieber
sich Grafiken ansieht oder welche selbst gestaltet, sollte gleich zur
CD 2 (&quot;b&quot;) wechseln. Als Vollversion liegt &quot;Wordworth5SE&quot; bei.
<p>
<b>cd 2 - gfx</b>
<p>
CD-ROM Nummer 2 hat doch tats&auml;chlich au&szlig;er Grafiken und Grafiksoftware
fast nichts zubieten... h&auml;h&auml;... wer will denn noch mehr???? Hier kann man
sich mal in Ruhe die Meisterwerke einiger sehr f&auml;higer User ansehen oder
sich mit beiliegender Public Domain Software selbst bet&auml;tigen, bzw. mit
Patches seine Programme auf den neusten Stand bringen.
<p><center><table width=50%>
<tr><td>gfx</td><td>158 MB</td><td>338 Dateien</td></tr>
<tr><td>pix</td><td>878 MB</td><td>975 Dateien</td></tr>
</table></center><p>
Viele Bilder sind 1 MB oder noch gr&ouml;&szlig;er, auch die Animation sind teilweise
sehr gro&szlig;, aber das macht ja nichts, oder??? Nun man sollte schon ca. 100
MB auf seiner Festplatte freihalten, es sei denn... nach dem ansehen l&ouml;scht
man die jeweiligen Dateien sofort, und entpackt danach die n&auml;chste. Einige
Schmankerl habe ich finden k&ouml;nnen, so haben mir die Sachen von Eric Schwartz
sehr gut gefallen, aber auch die anderen Pix oder Anims konnten begeistern.
Der CD &quot;b&quot; hat als Vollversion &quot;PPaint 6.4&quot; und ist mit einer Gr&ouml;&szlig;e von 631
MB wiedermal proppe voll geworden.
<p>
<b>cd 3 - fun</b>
<p>
F&uuml;r jeden Spielefreak ist dies sicherlich die interessanteste CD im Set 6.
Mehr als 400 MB an Games sind n&auml;mlich dort drauf, gepaart mit 400 MB an 
Grapikdemos, ca. 90 MB Gesch&auml;ftssoftware und mit mehr als 90 MB diverser
Software, ergibt diese CD eine bunte Mischung, die jedem gefallen wird.
Gerdae wer Patches, Cheats oder Komplettl&ouml;sungen sucht, hier sind sie.
Zwar ist vieles nicht mehr neu und schon auf den einzelnen Aminet CDs
erschienen, aber wer diese nicht vollz&auml;hlig hat, kann seine Sammlung hier
indirekt vervollst&auml;ndigen. Sehr schwach finde ich, da&szlig; man mal wieder alle
Foundation Archive, s&auml;mtlichen Vulcan Demos (naja... es sind sehr viel)
und altbekanntes mit draufgemacht hat, so geht man als &quot;Internetzug&auml;nger&quot;
etwas entt&auml;uscht aus dem Demo Verzeichnis raus. Alle &quot;No Modem User&quot; werden
das sicherlihc nicht als negativ ansehen, ich hingegen finde es doof, da&szlig;
auf fast jeder CD (Compilations, Mag CDs) die gleiche Software draufge-
brannt wird. Ansonsten gibt es unterhaltsame Games im Public Domain Bereich,
aber auch wieder viele Patches f&uuml;r Programme der &quot;gro&szlig;en&quot; Firmen, wie
Cloanto, Haage&amp;Partner oder Softwood. Nun, mir hat die CD zwar gefallen,
da mir einiges im Aminet nicht aufgefallen war oder der Download zulange
gedauert h&auml;tte, doch wie ich schon sagte, man kennt eben doch recht viel.
<p><center><table width=50%>
<tr><td>biz </td><td>&nbsp;88 MB</td><td>259 Dateien</td></tr>
<tr><td>demo</td><td>406 MB</td><td>379 Dateien</td></tr>
<tr><td>game</td><td>441 MB</td><td>756 Dateien</td></tr>
<tr><td>misc</td><td>&nbsp;93 MB</td><td>189 Dateien</td></tr>
</table></center><p>
&quot;Wildfire 3.38&quot; bekommt man mit dieser CD als Vollversion geliefert.
<p>
<b>cd 4 - mods</b>
<p>
Die 4. und damit letzte CD - und mein Favorit - ist die &quot;mod&quot;-CD. Mehr
als 1000 Megabyte an Soundmodule gibt es hier. Egal was, ob Pop, Rock,
Techno, Melodic, Gesungenes oder Hardcore. F&uuml;r Musikfans ist alles dabei.
Es wird zwar wirklich schwer, sich jedes Modul anzuh&ouml;ren, doch via Guide
kann ma ja sehr viele Mods Probeh&ouml;ren und sich dann eventeull auf die HD
kopieren. Vertreten sind MMD, SM3D, Mod, Med und andere Modularten, f&uuml;r die
man allerdings (wenn es kein &quot;.mod&quot; ist) einen entsprechenden Player.
<p>
Weiterhin gibt es sehr viele Programme zum selbermachen. Doch auch hier
braucht man Zeit, denn Player bzw. Editor ist nicht gleich Editor. Viel
kann man zu dieser CD nicht sagen, sie ist einfach gut und wer ein Fan
von Computermusik ist (die teilweise besser ist, als manch andere &quot;au&szlig;ercomputerisierte&quot; Musik) wird hier sehr viel Zeit verbringen.
<p><center><table width=50%>
<tr><td>mods</td><td>1017 MB</td><td>1994 Dateien</td></tr>
<tr><td>mus </td><td>&nbsp;&nbsp;46 MB</td><td>&nbsp;159 Dateien</td></tr>
</table></center><p>
Die 627 MB gro&szlig;e CD bietet au&szlig;er den vielen Modulen auch noch &quot;TurboCalc3.5&quot;
, mit dem man Tabellenkalkulationen erledigen kann.
<p>
<b>Fazit:</b><p> 
Nun, Auch dieses Set hat mir gefallen. zwar war nicht &uuml;berall
etwas f&uuml;r mich dabei, aber das wird vielen so gehen. F&uuml;r den Preis
von 59,- DM kann man sich das &quot;Aminet Set 6&quot; bei der Schatztruhe be-
stellen und sollte f&uuml;r die n&auml;chste Zeit versorgt sein. Es wird kaum
jemanden geben, der sich jede Software auf den CDs ansieht, da&szlig; ist
eigentlich unm&ouml;glich. St&ouml;bern ist bei diesen CD`s zwar das beste,
doch wer dringend etwas sucht, sollte auf die Suchfunktionen zur&uuml;ckgreifen. Zwar erh&auml;lt diese CD Sammlung als Wertung nur ein <b>- Gut - </b>,
doch das solltet Ihr nicht negativ sehen, da ich davon ausgehe, ein
sehr gut kann eine solche Sammlung nie bekommen, daf&uuml;r ist das
Angebot zu subjektiv zubetrachten.  


<p align="right"><em>-mn- </em></p>
<p>
<b>Quelle:</b><br>
Stefan Ossowskis Schatztruhe<br>
Gesellschaft f&uuml;r Software mbH<br>
Veronikastra&szlig;e 33<br>
45131 Essen<br>
Tel: 0201/78 87 78<br>
Fax: 0201/79 84 47<br>
eMail: <a href="mailto:stefano@schatztruhe.de">stefano@schatztruhe.de</a><br>
www: <a href="http://www.schatztruhe.de">http://www.schatztruhe.de</a>

<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="softw03.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh02.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="softw05.htm">
</MAP><hr></center>
</body>
</html>
