<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusED 4.2">
<title>AMIGA TIMES 02/98 - Fun & Talk</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><h1>Petro Tyschtschenko im Interview</h1></center>


AT = Amiga Times / Mario Nitschke<br>
PT = Petro Tyschtschenko
<p><table Border=0 CellSpacing=4 CellPadding=4>
<tr><td valign="top">
<b>AT:</td><td>Die derzeitige Lage ist doch sehr verwirrend. Phase5 will
    jetzt einen eigenen Rechner auf den Markt bringen, der aber
    f&uuml;r knapp 6000,- DM doch sehr hochgegriffen ist. Man h&ouml;rt
    Ger&uuml;chte &uuml;ber neue AI Amigas im n&auml;chsten Jahr und auch DCE
    bringen neue alte Amigas. Wie sieht es den nun aus? Auf was
    sollten wir jetzt achten? Lohnt es sich &uuml;berhaupt noch ein
    Amiga zu kaufen, der nur eine andere Peripherie (Zusammen-
    stellung als die Originalen) aufweisen kann, als wirklich
    neue Chips???</b></td></tr>
<tr><td valign="top">
PT:</td><td>Unser Ziel ist es das unsere Lizenznehmer Ihr eigenes Board
    entwickeln, das dieses jedoch 100% mit unserem Betriebsystem
    kompatibel ist. EIN OS- VIELE HARDWARE ENTWICKLUNGEN.....</td></tr>
<tr><td valign="top">
<b>AT:</td><td>Wie reagiert man von Seitens AI auf die Fremdprodukte?
    Ist dies in Ihrem Sinne oder nur eine Art der &Uuml;berbr&uuml;ckung
    um den Markt abzudecken???</b></td></tr>
<tr><td valign="top">
PT:</td><td>Es sollen keine Fremdprodukte sein, es sind Produkte die
    von Lizenznehmern entwickelt werden, basierend auf AMIGA
    Technologie.</td></tr>
<tr><td valign="top">
<b>AT:</td><td>Wie empfanden Sie eigentlich die Messe in St. Louis?
    War es ein kleiner Erfolg oder nur eine von vielen
    (doch meist) &ouml;den Messen?</b></td></tr>
<tr><td valign="top">
PT:</td><td>Die St.Louis Messe war sehr positiv und unsere amerikanischen
    User sind immer wieder begeisterungsf&auml;hig. Jeff Schindler,
    unser Entwicklungsleiter stand nat&uuml;rlich ganz im Rampernlicht
    und konnte leider Gottes gar nicht viel neues erz&auml;hlen....
    Die Neuentwicklung geht halt etwas schleppend voran... darunter
    leide ich nat&uuml;rlich auch... keine neuen Produkte bedeutet ein
    aus f&uuml;r AMIGA......</td></tr>
<tr><td valign="top">
<b>AT:</td><td>Die PowerPC Karten und deren Grafikkarten sind ein hei&szlig;es
    Eisen und viele User denken &uuml;ber einen Kauf nach. Doch ich
    selbst z&ouml;gere insgeheim noch aus einem Grund: Wird es bei
    neuen AI Amiga Modellen (wenn es welche gibt) eine Unter-
    st&uuml;tzung dieser Boards geben? Oder werden sie diese schon
    enthalten?</b></td></tr>
<tr><td valign="top">
PT:</td><td>Wir werden so viel wie m&ouml;glich unterst&uuml;tzen, aber ich schlage
    vor &uuml;ber Detailfragen sollten Sie mal direkt an Jeff Schindler
    unter <a href="mailto:schinjef@gateway.com">schinjef@gateway.com</a> herantreten......</td></tr>
<tr><td valign="top">
<b>AT:</td><td>Das neue OS 3.5 oder 4.0 besch&auml;ftigt die User nun schon
    l&auml;nger, seit der Ank&uuml;ndigung im letzten jahr hat sich kaum
    etwas getan, wird es &uuml;berhaupt noch etwas mit einer neuen
    Betriebssystemversion in diesem Jahr???</b></td></tr>
<tr><td valign="top">
PT:</td><td>Unser Plan ist es das OS 3.5 zur K&ouml;lner Messe &quot;Computer&acute;98&quot;
    im November 98 als Beta Version vorzustellen..... aber wiege-
    sagt, das ist von unserer Entwicklungsabteilung in USA abh&auml;ngig.</td></tr>
<tr><td valign="top">
<b>AT:</td><td>Viele User klagen, da&szlig; der AGA Chip zu alt ist. Denkt man
    bei AI &uuml;ber einen neuen Chip nach oder wird man zuk&uuml;nftigt
    auf den OnBoard Grafikchip verzichten und auf Grafikkarten
    setzten???</b></td></tr>
<tr><td valign="top">
PT:</td><td>Auch dar&uuml;ber wird nachgedacht und es gibt sogar schon L&ouml;sungs-
    vorschl&auml;ge.... Details darf ich zur Zeit nicht ver&ouml;ffentlichen..
    ... bitte kontaktieren Sie diesbez&uuml;glich  auch  meinen  Kollegen
    Jeff in den USA.</td></tr>
<tr><td valign="top">
<b>AT:</td><td>Zum Schlu&szlig;, w&uuml;rde mich (und sicher auch unsere Leser)
    interessieren, was wir demn&auml;chst von AI erwarten k&ouml;nnen
    und welche Ziele bei Ihnen verfolgt werden, um den Amiga
    attraktiver und fortschrittlicher zu machen???</b></td></tr>
<tr><td valign="top">
PT:</td><td>Wie Sie sicher wissen bin ich f&uuml;r Sales und Marketing zust&auml;ndig
    und bereite durch gezielte Abverkaufsaktionen des A1200 den Markt
    f&uuml;r die Zukunft vor. Lizenzvergabe..... Boing Ball, Erweiterung
    unserer M&auml;rkte und jetzt auch noch unsere neue AMIGA AUDIO CD,
    die es ab 15.5.98 geben wird sind Eckpfeiler...... jetzt brauchen
    wir nur noch neue Produkte......
    Ich bin sicher das sich unsere Geduld bezahlbar macht.....</td></tr>
<tr><td valign="top">
<b>AT:</td><td>Vielen Dank f&uuml;r das Interview!</b></td></tr>
</table><p>
Leider war es uns in der k&uuml;rze der Zeit nicht mehr m&ouml;glich Jeff Schindler
zu kontaktieren, dies holen wir aber in unserer n&auml;chsten Ausgabe nach!

<p align="right"><em>-mn- </em></p>


<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="talk03.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh04.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="talk05.htm">
</MAP><hr></center>


</body>
</html>
