<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusED 4.2">
<title>AMIGA TIMES 02/98 - Fun & Talk</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><h1>around the world</h1></center>
amiga mit daseinsberechtigung?
<p>
Ich wei&szlig; nicht wie es Euch geht, doch ich bin ein sehr interessierter
User geworden, verfolge regelm&auml;&szlig;ig Nachrichten, lesen (fast) alle Online Mags
und kontaktiere Firmen und User. Dies alles l&auml;&szlig;t bzw. verursacht ein ganz
anderes denken, als da&szlig; was der Otto-Normal-User hat. Die einzelnen Meinung
und Ansichten gehen teilweise stark auseinandern und viele sind doch noch sehr
pessimistisch. Doch hier kommt meine Frage:&quot;Warum?&quot;<br>
Habt Ihr noch nicht bemerkt das es aufw&auml;rts geht??? das jahr 1997 hat uns ein
gro&szlig;en Schritt nach vorn gebracht. Messen finden &ouml;fter statt, Amiga wird sogar
Marktf&uuml;hrend (wenn auch nur in Indien), die Zeitungen berichten fast regelm&auml;&szlig;ig
von unserer Freundin oder wollen sie in ihr Sortiment mit aufnehmen und ver-
kauft wird unser Lieblingscomputer auch noch. Sicherlich liegt die Ank&uuml;ndigung
des neuen Betriebssystems OS4.0 f&uuml;r ende `98 vielen schwer im Magen, aber in
meinen Augen sollte jetzt nicht soviel &uuml;berst&uuml;rzt werden. Die verlorene Commodore
Zeit holt keiner mehr auf, aber wir k&ouml;nnen jetzt versuchen &quot;alles&quot; richtig zu
machen, und da&szlig; geht leider nur durch treue zum Amiga, Vertrauen und den (oft sehr)
schweren Griff in die Geldb&ouml;rse!
<p>
Ich selbst habe schon seit mitte M&auml;rz vor mir eine PPC Karte zukaufen und als
ich h&ouml;rte da&szlig; die Preise gesenkt wurden, war dieser Entschlu&szlig; entg&uuml;ltig. Zwar
fehlten mir da noch die finaziellen Mittel, doch ich habe immer daran gedacht
und bin immer noch fest dazu entschlossen.
<p>
Auch wenn ich jetzt etwas abschweifen werde... aber ich m&ouml;chte Euch mal etwas
erz&auml;hlen. Fast jeden tag - wenn ich mit meinen Kumpels zur Arbeit fahre - haben
wir das Thema Computer. Sicherlich kann ich nocht sooo mitreden, wenn die sich
streiten, welche Pin nun gesteckt werden mu&szlig;, doch ich bekomme sehr viel mit
und mu&szlig; doch sehr oft das Lachen unterdr&uuml;cken. Wenn ich so h&ouml;re, mit was die
alles zu k&auml;mpfen haben... oh Gott... da bin ich froh einen Amiga zu haben, mit
dem ist das arbeiten doch noch leicht und gerade das haben in letzter zeit mehr
und mehr Leute festgestellt, wie sonst kann man sich den Verkauf von Amigas erkl&auml;ren... Sammlerst&uuml;cke??? Unwahrscheinlich!!! Die DOSen haben doch mit allem
Probleme, da fehlt das und jenes, manchmal frage ich mich warum deren Betriebs-
system eigentlich &quot;Windows&quot; hei&szlig;t?? &quot;Window&quot; ist doch das Fenster, soll es eine
versteckte Aufforderung des &quot;PC aus dem Fensterschmei&szlig;ens&quot; sein? Sch&ouml;n w&auml;rs,
mal sehen, vielleicht hei&szlig;t &quot;Windos2000&quot; nicht mehr &quot;Windows&quot;, sondern &quot;Problemos
2.0&quot; nat&uuml;rlich nicht update fahig.
<p>
Ich habe nie verstanden warum soviel den Amiga verlie&szlig;en, zwar stimmt es, da&szlig; kaum
Spiele erscheinen, was Ihr auch an unserem &quot;AT-Spieleteil&quot; seht, doch das ist
kein Grund, es mu&szlig; ja erstmal wieder losgehen und das tut es ja bereits. Meine
bitte an Euch ist die, verla&szlig;t den Amiga nicht, warte noch und unterst&uuml;tzt vorhandene Soft- und Hardware, la&szlig;t die H&auml;ndler nicht im Stich, h&ouml;rt auf mit den
Raubkopien und in absehbarer Zeit gibt es den Amiga wieder dort, wo er seine
soll... (fast) ganz oben (scheiXXX Gates Monopol)! 


<p align="right"><em>-mn- </em>
<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="talk02.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh04.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="talk04.htm">
</MAP><hr></center>


</body>
</html>
