<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusED 4.2">
<title>AMIGA TIMES 02/98 - Fun & Talk</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">


<center><h1>Themendurchforstung, von A bis Z!!!</h1></center>


Hallo Redakteure der div. Online-Mags, Amiga-User/
innen  aus der ganzen  Welt  und  an alle Firmen !
<p>
<b>A</b>
<p>
Es wird  immer schwerer Software von Softwarefirmen
zu  bekommen. Das liegt halt daran, das jemand  auf
die Idee  kommt, ein Online-Mag  zu  machen.  Diese
erscheinen 1-2 mal und bekommen Software von Firmen
(z.B. Titan Computers) und stellen mist an. Es soll
auch welche gegeben haben, die die Spiele  dann  im
Internet  als  Raubkopien verbreitet  haben sollen.
Zudem  ist es auch den andern  Mags gegen&uuml;ber unge-
recht,wenn diese dann keine Software mehr bekommen.
Wozu soll es dann Online-Mags geben, die den  Amiga
Usern etwas bieten  wollen ?  Dar&uuml;ber  denkt keiner
nach ! Zumindest diese Mags,  die nur 1 oder 2  mal
erschienen sind und dann nie wieder !!!!!!!!!!! Wir
geben uns M&uuml;he und k&ouml;nnen Euch durch solche
Aktionen kaum aktuelle Tests bieten! Das liegt auch
nur an  denjenigen, die halt  den  Mist  verursacht
haben ! Ein anderes Beispiel ist auch im Shareware-
bereich! Viele User besitzen z.B. MagicWB, doch sie
lassen sich  nicht einmal  registrieren.  Ja,  dann
w&uuml;rde ich mir auch nicht mehr diese M&uuml;he machen.   
Besonders spreche ich hier diejenigen  an,  die die
Raubkopiererei stark unterst&uuml;tzen! Traurig,Traurig.
Aber so ist es. Ich bin als Amiga-User und als  Re-
dakteur richtig sauer ! Diejenigen, die diesen Mist
verursachen,haben wir es auch zu verdanken, das wir
keine aktuelle Software vorstellen k&ouml;nnen. &Uuml;berlegt
Euch  das ganz  genau,  ob es denn Amiga  weiterhin
geben soll oder  Online-Mags, wenn die  Firmen wei-
terhin bereit sind, uns zu unterst&uuml;tzen.  Wer  sich
daraus  nichts macht, wird es schon  sehn,  was  er
davon hat. Unser Online-Mag und alle anderen,werden
eines Tages aufh&ouml;ren m&uuml;&szlig;en. Ich habe auch  das  Ge-
f&uuml;hl, da&szlig; die deutschen &quot;AMIGA MAGAZINE&quot; immer sch-
lechter werden (z.B. Amiga Magazin das von den  An-
fangstagen  des Amigas dabei  war).  Wahrscheinlich
schadet  der  Name &quot;AMIGA&quot;  das  Image der  Firmen.
Naja, ich hoffe das sich vielleicht der eine   oder
andere heraus eine Lehre zieht.  Die Firmen  k&ouml;nnen
nicht alle Amiga-User f&uuml;r den Bl&ouml;dsinn  der anderen
Magazine zur Verantwortung ziehen.Wenn ihr uns also
nichts mehr zum Testen sendet,  last  es  halt.  In
Deutschland ist dann das herausbringen von  Spielen
sinnlos.Da es nur eine Spielezeitung gibt mit &quot;NUR&quot;
ca. 75 Seiten, einer bl&ouml;den CD und das  ganze   f&uuml;r
19,80 DM.  HA HA,  verarschen  k&ouml;nnt  Ihr Euch dann
selber ! Es gibt bestimmt eine ganze Reihe  anderer
User,die sich das &uuml;berlegt haben oder mit mir einer
Meinung sind.<br>                                      
DER MIST ANDERER HAT FOLGEN F&Uuml;R ALLE ANDEREN !!!!!!
                       
<p>
Themawechsel!                                      
<p>
<b>M</b>
<p>
Die IDIOTEN von Microsoft bauen Ihr  Monopol  immer
mehr aus.  BILL GATES   k&ouml;nnte sich  eigentlich mit
seinen mehr als &quot;36 Milliarden US $ doch endlich zu
Ruhe setzen. Aber nein, er arbeitet weiterhin daran
sein Monopol zu erweitern und alle  Firmen aus  dem
Weg zu r&auml;umen. Vielleicht hat er ja schon Pl&auml;ne, z.
B. Apple Macintosh  komplett  aufzukaufen,  was ich
nicht hoffe.Dann w&uuml;rde auch noch ein super Computer
vom Markt verschwinden !<br>                           
Der gr&ouml;&szlig;te Anteil  aller Magazine  (PC,  Amiga  und
Apple) werden mit Mac gemacht.                     
<p>
Themawechsel!                                      
<p>
<b>P</b>
<p>
Unser Amiga h&auml;ngt mit der  Entwicklung,  ganz  weit 
hinten! Wof&uuml;r wurde Amiga Inc. gegr&uuml;ndet,  wenn  es
doch keinen neuen Amigas von Amiga Int. geben soll.
Mir ist meine &quot;Freundin&quot; ans Herz gewachsen und ich
werde meinen Amiga auch nicht mehr verkaufen.  Doch
der Grafikchip ist &quot;ZU&quot; alt.Mir reicht er im Moment
noch, ich mache z.B. mit meinem Amiga  meine ganzen
Schularbeiten. Es gibt nicht nur PC um sowas machen
zu k&ouml;nnen.                                         
<p>
Themawechsel!                                      
<p>
<b>T</b>
<p>
Die neuen Turbo Karten namens PowerPC sind mir viel
zu teuer ! Warum k&ouml;nnten die nicht zumindest   200-
300 DM billiger sein.Normalerwei&szlig;e halten diese mit
einem PentiumPC mit, aber das ist schon wieder vor-
bei. Es gibt schon neue Pentium Prozessoren mit 400
Mhz. Die Entwicklung in Sachen Geschwindigkeit wird
auch immer schneller beim PC. Doch ich  habe  einen
Amiga und darauf bin ich stolz! Aber wenn ich keine
Resultate sehe, werde ich gezwungen sein,das System
zu wechseln. Dann werde ich auf Mac  umsteigen.  Es
gibt ja  sonst  keine  weiteren  &quot;KONKURENZF&Auml;HIGEN&quot;
Computer mehr. F&uuml;r die PC-Welt, sind wir  die  User
mit dem&quot; Spielcomputer&quot;, wobei mehr 98%  aller  PC-
User mit ihrem &quot;Computer&quot; spielen ! Zudem sind  das
auch sehr absturz gef&auml;hrdete &quot;SCHEI&szlig;&quot;  Ger&auml;te,  mit
einer Grafikkarte, einer FP, Prozessor und Ram  und
das d&auml;mlichste,was die Welt je gesehen hat &quot;WINDOWS
95/98&quot; erfunden von &quot;BILL SCHWACHSINIG&quot;. Vielleicht
schaffen  wir  es auch soweit mit  der  d&auml;mlichsten
Idee, die die Welt jemals gesehen hat. Und bekannte 
Firmen, wie BlueByte, Electronic Arts,die f&uuml;r Amiga
fr&uuml;her produzierten, kr&auml;ftige Unterst&uuml;tzung.   Doch
das ist nur ein kleiner geringer Anteil von  vielen
anderen Herstellern.                               
<p>
Themawechsel!                                      
<p>
<b>Z</b>
<p>
Warum wird das Betriebssystem Linux, das es  glaube
ich derzeit f&uuml;r Power&quot;PC&quot; Amiga gibt, nicht ordent-
lich unterst&uuml;tzt ??? Halt weil die Firmen dann wohl
von Microschrott platt gemacht werden? Aber ich bin
nicht  nur  von den  Raubkopier-Piraten  ent&auml;uscht,
nein  auch von Amiga Inc.  und allen  Software Her-
stellern...                                        


<p align="right"><em>-sbh- </em></p>                                            

<hr>

<p>
Nun, so einfach kann ich diese Worte nicht  stehen
lassen. Da bin ich wahrscheinlich zu  optimistisch
als andere, aber gerade unser Optimissmus hat  den
AMIGA durch die schweren Zeiten gebracht. Doch ich
m&ouml;chte gern zu einigen der genannten  Themen  kurz
etwas sagen!                                      
<p>
<b>A:</b> <p>    Nun,dies ist eine sehr gro&szlig;e Anschuldigung
die man aber nicht von der Hand  weisen kann, Tat-
sache ist, da&szlig; wir keine Software erhalten  haben,
da andere Mags mist gebaut haben! Jedoch finde ich
die Beschuldigung, da&szlig; Mags die nur 1 oder  2x er-
scheinen, hier profitieren und wir  leer  ausgehen
nicht gerechtfertigt! Wer wei&szlig; heut noch, was lang
h&auml;lt??? Selbst wir bzw. ich wu&szlig;te nicht,ob von der
AT eine weitere Ausgabe erscheint, mit viel  Gl&uuml;ck
und interessierten Usern hatte es  aber  geklappt,
doch wie gesagt, denen kann man kaum  eine  Schuld
zuweisen, da sie etwas  versuchen,  jedoch  keinen
Erfolg hatten. Und nochetwas zum &quot;Spielemag f&uuml;r 20
DM&quot;, jeder wei&szlig; das es hier um die &quot;Amiga  Future&quot;
geht und ich m&ouml;chte nochmal sagen, da&szlig; diese  eine
subjektive Aussage war und es in der  AT-Redaktion
auch andere Ansichten gibt!!! Ich selbst finde die
Idee sehr gut, kedoch hapert es an der  Umsetzung,
was nicht allein daran liegt, da&szlig; es zuwenig Leute
gibt - meine Meinung!                             
<p>
<b>P:</b> <p>    Amiga Inc, ist die Entwicklungsfirma,  da&szlig;
steht schon mal fest. das wir in der letzten  Zeit
kaum  etwas von denen geh&ouml;rt  haben,   st&ouml;rt  mich
weniger, da ich mir vorstellen kann, da&szlig; die  auch
nur mit Wasser  kochen und  in einem  halben  Jahr
kein neuer und vorallem vern&uuml;nftiger Rechner    zu
stande kommt. Wir m&uuml;ssen uns eben noch  ein  wenig
gedulden. Wir haben seit 1993 keine bewegende neue
Technik bekommen, welche der Amiga ansich hat, ich
meine hier eben keine zus&auml;tzliche Peripherie,  wie
PPC oder so. Als Commodore pleite ging  und  Escom
AMIGA aufkaufte, geschah au&szlig;er Versprechungen auch
nichts, als es dann mit VisCorp ein Weilchen  lief
passierte auch nichts. Dann  kam  Gateway2000  und
gr&uuml;ndete Amiga Inc.  und  Amiga  International und
nun aufeinmal mu&szlig; alles rasend schnell gehen,   in
ungef&auml;hr einem halben Jahr  mu&szlig; ein  neuer Rechner
her, in zwei oder drei Monaten sollte das neue  OS
fertig sein, und  alle Chips  m&uuml;ssen  ausgetauscht
werden. Sorry, da&szlig; verstehe ich nicht,  wieso  gab
es damals nicht soviel Gerede??? Da hie&szlig; es   nur,
wie kann ich am besten meinen A500 aufr&uuml;sten??????
Wie soll denn eine neugegr&uuml;ndete  Firma  in kurzer
Zeit soviel schaffen??? Das  bis  jetzt  erreichte
ist doch schon gut, und wenn wir uns ein  Weilchen
gedulden kommt der Rest,   wieso  mu&szlig; jetzt  alles
&uuml;berst&uuml;rzt werden????                             

<p align="right"><em>-mn- </em></p>                                           

<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="talk05.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh04.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="inhfr05.htm" target="_top">
</MAP><hr></center>


</body>
</html>
