<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusED 4.2">
<title>AMIGA TIMES 02/98 - Fun & Talk</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><h1>Ein Interview mit dem `Austex Team`</h1></center>


(Vulcan Softwares `Austex Team` ist verantwortlich f&uuml;r die `Uropa2 CDRom`)

<P>
Paul: Paul Carrington BA (Director)<br>
Stephen: Stephen Smith<br>
[&Uuml;bersetzung f&uuml;r die AT: -wr-]


<p>Wer sind die Mitglieder Eures Teams und wie habt Ihr Austex
zusammengebracht?<p>
<table><tr><td valign="top">
Paul:</td><td> Austex Software besteht aus nur zwei Leuten: Stephen Smith
      und Paul Goulding. Wir beide sind Besitzer von Amigas seit
      1987 und bildeten unsere eigene Demo Group im Jahre 1989
      zusammen mit zwei anderen, genannt Aushax. Wir haben ein
      ein paar Demos programmiert (ungef&auml;hr vier) und entschlossen
      uns dann, eine Compilaton Disk mit einigen Demos, ein paar
      Utilities und einem Freeware Spiel zu machen. Die Compilation
      Disk wurde 1990 fertig und hiess &quot;Genesis&quot;. Das Spiel hiess
      Nebula und bekam sp&auml;ter einige ziemlich gute Kritiken von
      den Amigamagazinen. Nach der Genesis Collection entschieden
      wir, die Demoszene zu verlassen und ein kommerzielles Projekt
      nur mit Stephen und mir zu beginnen.
      Zu diesem Anlass gab es auf der Disk ein Demo mit dem Titel
      &quot;End of Aushax&quot;. Das war der Tot von Aushax und die Geburt
      von Austex Software. So war es Anfang 1991, als wir mit der
      Planung des Spiels begannen, welches wir heute Uropa2 nennen.
      Wir hatten einen talentierten Grafiker f&uuml;r Uropa2, Bruce Abel,
      aber er ist eigentlich kein Mitglied von Austex Software.</td></tr>
</table><p>&nbsp;

<p>Uropa2 ist ein sehr kompliziertes Spiel, das eine Vielzahl von Genres
beinhaltet. Hat sich das mit der Zeit langsam entwickelt, oder habt Ihr
auf ein Spieldesign hin gearbeitet?<p>
<table><tr><td valign="top">
Paul:</td><td> Ein Spieldesign!! Ich w&uuml;nschte, es w&auml;re so. Das geplante Spiel
      und das ver&ouml;ffentlichte Spiel haben nur eine einzige Sache
      gemeinsam. Beide sind in isometrischem 3D. Davon abgesehen hat
      es sich v&ouml;llig ver&auml;ndert.</td></tr><tr><td valign="top">

Stephen:</td><td> Urspr&uuml;nglich sollte es den Namen &quot;Ulterior Colony&quot; erhalten
         und auf einer Morduntersuchung an Bord eines Raumfrachters
         namens &quot;Vindicator&quot; basieren. Anfang 1991 hatten wir das
         Spiel geplant und brauchten einen Grafiker. Schliesslich
         wendeten wir uns an jemanden aus der n&auml;heren Umgebung,
         n&auml;mlich Bruce Abel, der zustimmte, f&uuml;r uns die Grafik zu
         machen. Er fing damit auch an, war aber von isometischen
         Sachen nicht gerade begeistert. Wir wollten die Kolonisten,
         die im Frachter umherlaufen sollten, in Iso3D gezeichnet
         haben, aber wir erhielten am Ende roboter&auml;hnliche Kreaturen.
         Nun fing Bruce mit der Eingabe des Spiels an, aber es wurde
         schwierig, diese mit der urspr&uuml;nglichen Planung in Einklang
         zu bringen.
         Als das Design allm&auml;hlich ge&auml;ndert wurde, erhielten wir
         schliesslich ein Spiel mit langweiligem Gameplay, voller
         Wiederholungen, das sehr schwierig zu implementieren war.
         Zu dieser Zeit (1994) sah die L&ouml;sung so aus, das Spiel mit
         Features aus dem originalen Uropa 1, das wir einige Jahre
         zuvor fertiggestellt hatten, zu vereinen. Das machte einen
         enormen Unterschied in Bezug auf das ganze Projekt und
         erlaubte uns, das Spiel zu beenden. Ich finde nur schade,
         dass die Grafiken etwas moderner h&auml;tten sein k&ouml;nnen. Der
         Teil des Spiel auf der Oberfl&auml;ce sollte mit Texturen und
         echtzeitberechneten Lichtquellen arbeiten und mehr Kontrolle
         &uuml;ber die Hovars geben (z.B. schr&auml;ges Fliegen, verschiedene
         H&ouml;hen usw.) Der Teil auf der Basis w&uuml;rde in Hires mit R&auml;umen
         und Leveln &uuml;ber mehrere Bildschirme verteilt besser aussehen.</td></tr>
</table><p>&nbsp;

<p>Was war die Inspiraton f&uuml;r Uropa2?<p>
<table><tr><td valign="top">
Paul:</td><td> Naja, das ist schwierig zu sagen, I sch&auml;tze, das originale
      Uropa, das wir auf dem BCC und dem C64 in den Jahren 85 und
      86 programmiert hatten, war eine Inspiration. Die Inspiration
      f&uuml;r das original Uropa war Elite auf dem C64 und dem BBC. Ich
      glaube auch heute noch, dass Elite zu seiner Zeit viel
      bahnbrechender war, als irgendeiner der Doom/Quake-Klone es
      heute ist. Aber Uropa2 ist ganz anders als Elite, also glaube
      ich, dass es eine Vielzahl von Spielen gibt, die Teile aus
      Uropa2 inspiriert haben, aber keines, das daraus besonders
      hervorsticht, hatte einen besonders signifikanten Einfluss.
      Hat das jemand verstanden?</td></tr>
<tr><td valign="top">
Stephen:</td><td> Kein Mensch. - Urspr&uuml;nglich wollte ich mit Uropa1 ein Spiel
         schreiben, in dem man mit einer Art Fahrzeug oder Schiff
         einen Planeten bereist, und dann im Untergrund verschiedene
         St&auml;dte erforschen kann. Elite war grossartig, aber ich
         w&uuml;nschte mir, dass man h&auml;tte landen und die Planeten besuchen
         k&ouml;nnen. Frontier hat das teilweise schon geboten, aber man
         kann darin nicht hinuntergehen und in Geb&auml;ude reinspazieren.
         Uropa2 erlaubt einem, auf der Moondoberfl&auml;che herumzufliegen,
         dann eine Basis anzusteuern und innerhalb herumzugehen. Wie
         es nun mal so sein muss, ist die totale Freiheit, &uuml;berall
         hingehen zu k&ouml;nnen und Puzzles zu l&ouml;sen, ein
         programmiertechnischer Alptraum, sodass hier die L&ouml;sung war,
         auf Missionen aufzubauen.</td></tr>
</table><p>&nbsp;

<p>Uropa2 ist gewaltig gross! Wie lange habt Ihr f&uuml;r die Entwicklung gebraucht?<p>
<table><tr><td valign="top">
Paul:</td><td> Oh, sprich das bloss nicht an, es war zu lange. Wie ich schon
      vorhin erw&auml;hnt habe, starteten wir die Planung des Spiels
      Anfang 1991. Wir fingen das eigentliche Programmieren Ende 1991
      an. Also wenn meine Rechnung stimmt, hat es uns sechs Jahre
      gekostet, das Spiel fertigzustellen. Es war eigentlich geplant,
      irgendwann 1994 fertig zu sein, aber wir haben immer wieder so
      viel daran ge&auml;ndert, und dann mussten wir neue Features einbauen,
      damit es wieder up to date ist. Das hat es etwas verz&ouml;gert, dazu
      kam noch Anfang 1996, dass wir von der Amigaszene sehr entt&auml;uscht
      wurden und f&uuml;r die n&auml;chsten sechs Monate aufgaben. Dann nach
      weiteren &Uuml;berlegungen stellten wir fest, dass die einzige
      &Uuml;berlebenschance f&uuml;r den Amiga die bleibende Unterst&uuml;tzung durch
      Softwareentwickler ist. Darum haben wir es doch noch fertiggestellt.</td></tr>
<tr><td valign="top">
Stephen:</td><td> Auch war die Ver&ouml;ffentlichung als Shareware fast ein Flop,
         so kam Vulcan und rettete uns. Ich denke viele Leute fragen
         sich, &quot;warum zum Teufel hat es sechs Jahre gedauert, um Uropa2
         zu schreiben?&quot; Ich habe mir selbst diese Frage sehr oft gestellt.
         Einer der wichtigeren Gr&uuml;nde f&uuml;r die lange Dauer ist, dass wir
         beide andere Jobs hatten, und die Programmierung von Uropa2 ein
         Teilzeit-Projekt war.</td></tr>
</table><p>&nbsp;

<p>Was gef&auml;llt Euch am besten am fertigen Spiel?<p>
<table><tr><td valign="top">
Paul:</td><td> Es ist kein Doom-, Quake- oder &quot;Red alert&quot;-Klone. Also ich mag
      Read alert wirklich, aber diese Art von Spielen ist zu Zeit
      sehr verbreitet und Uropa2 ist im Vergleich zu beiden sehr
      verschieden. Wir steckten auch h&ouml;llisch viel Arbeit in kleinere
      Details, da sind viele Dinge im Spiel, die die meisten Leute
      nicht sehen werden, wenn sie nicht herumspielen und Sachen
      ausprobieren, die nicht f&uuml;r die L&ouml;sung des Spiels unbedingt
      notwendig sind. Solche Dinge sind z.B. ein paar Kolonisten
      anzuz&uuml;nden und zu schauen was passiert; ein anderer Centurion
      Roboter wird sich dann n&auml;mlich in den Haupttransporterraum
      transportieren und Jagd auf Dich machen.</td></tr>
<tr><td valign="top">
Stephen:</td><td> Ich mag die zwei Ebenen des Spiels, mit den Basis- und den
         Abschnitten auf der Oberfl&auml;che. Ich denke, das verhindert
         mit Erfolg, dass das Spiel sich nur in einem Stil pr&auml;sentiert.</td></tr>

</table><p>&nbsp;
<p>An welchen anderen Amigaprojekten seid Ihr beteiligt?<p>
<table><tr><td valign="top">
Stephen:</td><td> Ich habe an einer Anzahl von Projekten, an der Universit&auml;t
         f&uuml;r die ich t&auml;tig war, gearbeitet, die mit dem Amiga zu tun
         hatten. Dazu geh&ouml;rte ein VHF-Radarsystem, von dem ich die
         A/D-Karte, die Firmware und die Radarsoftware entworfen und
         programmiert habe.</td></tr>
</table><p>&nbsp;

<p>Wie sieht es innerhalb der Amigaszene aus ?<p>
<table><tr><td valign="top">
Paul:</td><td> Wirklich ein bischen traurig, es gibt n&auml;mlich immernoch
      treusorgende Amigah&auml;ndler in ungef&auml;hr vier von f&uuml;nf gr&ouml;sseren
      St&auml;dten, aber draussen in den Kleinst&auml;dten wie z.B. Townsville
      [England] gibt es keine. Ich sch&auml;tze, es gibt noch so einige
      verstreute Enthusiasten &uuml;berall, und wir sprechen mit ihnen im
      IRC, aber es ist noch eine kr&auml;ftigerer Schuss Enthusiasmus von
      Gateway 2000 n&ouml;tig.</td></tr>

</table><p>&nbsp;
<p>War es schwierig, w&auml;hrend dieser turbulenten Zeiten f&uuml;r den Amiga zu entwickeln?<p>
<table><tr><td valign="top">
Paul:</td><td> Fr&uuml;her war es noch sehr aufregend, das gab uns den n&ouml;tigen Anschub,
      aber als 1994 Commodore auf einmal zusammenbrach, wurde es schwierig.
      Wir hatten die Nase voll von einigen Leuten, denen wir den Absturz
      des Amigas zuschrieben. Man kann leicht darauf kommen, wen wir damit
      meinen, indem man einfach spielt. Diese Leute finden dort unliebsame
      Erw&auml;hnung. Das &Uuml;berraschende ist das erneute Interesse am Amiga in
      den letzten sechs Monaten. Firmen wie Vulcan, Phase5 und andere
      treiben die Entwicklung voran, das sehe ich gerne.</td></tr>

</table><p>&nbsp;
<p>Was m&ouml;chtet ihr, was aus dem Amiga werden soll?<p>
<table><tr><td valign="top">
Stephen:</td><td> Der Amiga braucht offensichtlich in Sachen OS und Hardware
         eine General&uuml;berholung. Das Betriebsystem ist im Moment
         allerdings alles, was der Amiga jetzt braucht. Der Trend
         geht heutzutage dorthin, mit dem Strom zu schwimmen und
         Teile vom Fliessband zu nehmen. Als der Amiga erschien,
         hat das Chipset jeden erstaunt. Ein sehr interessanter
         Trend ist zur Zeit, dass einige Firmen nur Designer sind
         und die eigentliche Chip-Produktion anderen bekannten
         Firmen &uuml;berlassen. Ich sehe nicht ein, warum das mit dem
         Amiga nicht so gemacht werden kann, ein neues Chipset
         entwickeln und einige grosse Halbleiterhersteller zur
         Herstellung bringen. Das geschah bei Chromatic Research
         mit ihren MPact Chips so.</td></tr>
<tr><td valign="top">
Paul:</td><td> Wieder ein neuer, moderner, starker und wundervoller Computer
      werden. (Nostalgie kommt auf.) Ich erinnere mich noch an die
      Tage, als wir auf andere Computerbesitzer, besonders Besitzer
      von PCs, herabblicken und sie so richtig &auml;rgern konnten.
      Der Amiga war in den sp&auml;ten 80ern in jeder Hinsicht besser.
      Und es gibt immer noch ein paar Besonderheiten am Amiga, die
      besser als bei den beiden anderen Systemen (Mac &amp; PC) sind.</td></tr>

</table><p>&nbsp;
<p>Was ist das beste daran, Amigaentwickler zu sein?<p>
<table><tr><td valign="top">
Paul:</td><td> Nicht am PC programmieren zu m&uuml;ssen. Mal ehrlich, Windows ist
      das aufgeblasenste St&uuml;ck Software, das ich jemals benutzt habe.</td></tr>
<tr><td valign="top">
Stephen:</td><td> Ich mag den Amiga und mag, f&uuml;r ihn zu programmieren. Die
         Tatsache, dass er zwei Bankrotts &uuml;berlebt hat, ist ein mehr
         als ausreichendes G&uuml;tesiegel f&uuml;r sein Konzept. Ich habe
         niemals am PC programmiert und werde das auch nie.</td></tr>

</table><p>&nbsp;
<p>Welchen Rat w&uuml;rdet Ihr anderen Leuten geben, die Amigaspiele schreiben wollen?<p>
<table><tr><td valign="top">
Paul:</td><td> Ich habe drei Tips:<p>

      1. Niemals zu 100% in Assembler programmieren.<p>

       2. Niemals zu 100% in Assembler programmieren.<p>

         3. Niemals zu 100% in Assembler programmieren.<p>

      Mal im Ernst, als wir damals die Demos gehackt haben, waren wir
      froh, dass wir Assemblersprache verwenden konnten, um die Hardware
      direkt anzusteuern. Spiele allerdings sollten alle Regeln des
      Betriebssystems befolgen. Es ist zu schwierig und zu zeitaufwendig,
      derart grosse Projekte in Assembler zu machen. Das n&auml;chste Projekt,
      das wir machen, wird wahrscheinlich eine Mischung 80:20 sein,
      80% in C oder C++ oder einer &auml;hnlichen Hochsprache, und die
      verbleibenden 20% werden in Assembler sein.
      Dann muss man nat&uuml;rlich einige hingebungsvolle Betatester finden,
      die ernsthaft am Testen interessiert sind und nicht nur ein
      kostenloses Spiel haben wollen. Wir hatten ein paar gute Tester,
      und die waren excellent, wohingegen andere uns grunds&auml;tzlich nichts
      mitzuteilen hatten und immer nur nach einem weiteren kostenlosen
      Exemplar verlangten, sobald sie verf&uuml;gbar waren. K&uuml;mmert Euch um
      die guten und werdet die nutzlosen los.</td></tr>
<tr><td valign="top">
Stephen:</td><td> Mein Rat w&auml;re, niemals (heute sowieso) ein Spiel nur in Teilzeit
         zu programmieren. Auch sollte man sicherstellen, dass man ein
         Team organisiert, in dem jede Person genau weiss, was von ihr
         verlangt wird.<tr><td>
<tr><td valign="top">
Paul:</td><td> Dazu noch, wenn man ein Spiel nur in Teilzeit programmiert, wird es
      mindestens zwei bis drei Jahre zum Fertigstellen in Anspruch nehmen.
      Man muss sich klarmachen, dass Computer rapide leistungsf&auml;higer werden,
      und dass die vorhandenen langsamen Ger&auml;te zum Zeitpunkt der
      Ver&ouml;ffentlichung vermutlich die mittelschnellen von heute gewesen sein
      werden.</td></tr>

</table><p>&nbsp;
<p>Welche Pl&auml;ne habt Ihr f&uuml;r die Zukunft.<p>
<table><tr><td valign="top">
Paul:</td><td> Erstmal die Spiele anderer Leute f&uuml;r die n&auml;chsten sechs Monate spielen,
      und dann mit der Planung f&uuml;r ein weiteres Projekt beginnen. Wie klingt
      &quot;Uropa3&quot;??</td></tr>
<tr><td valign="top">
Stephen:</td><td> Die Idee zu Uropa3D geisterte so einige Zeit herum. Es w&auml;re vom Typ
         her wie Quake2, aber mit dem Thema von Uropa2, allerdings w&uuml;rde es
         auf Missionen aufbauen. Ich habe einige Pl&auml;ne f&uuml;r bestimmte Hard-
         und Software, die viel Arbeit ben&ouml;tigen, auf die ich hinausblicke.</td></tr>

</table><p>&nbsp;
<h3>RECHTLICHES</h3>
Die in diesem Interview ausgedr&uuml;ckten Ansichten sind nicht<br>
notwendigerweise gleich den Ansichten von Vulcan Software. [ oder der Amiga Times ;-) ]
<p>
Vulcan Software Limited  --  <a href="http://www.vulcan.co.uk">http://www.vulcan.co.uk</a>

<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="talk01.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh04.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="talk03.htm">
</MAP><hr></center>


</body>
</html>
