<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Diskriminierung behinderter Menschen</TITLE>
</HEAD>

<BODY background="bga.gif" text="#000000" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<P align="center"><FONT color="#000080" size="7"><B>Demonstration in
Bremen</B></FONT></P>

<P>Arbeitskreis Bremer Protest gegen Diskriminierung behinderter Menschen
Blinden- und Sehbehindertenverein Bremen e.V. Landesarbeitsgemeinschaft
Hilfe f&uuml;r Behinderte Bremen e.V. SelbstBestimmt Leben e.V. Bremen</P>

<H3>Pressemitteilung</H3>

<P>Bremer Behindertenb&uuml;ndnis fordert:<BR>
<B>"Landespflegegeldgesetz muss bleiben!"</B></P>

<P>Bremen, den 3. Juli 2003<BR>
Etwa 200 Menschen protestierten heute vormittag vor dem Haus der Bremischen
B&uuml;rgerschaft gegen die Sparbeschl&uuml;sse im Koalitionsvertrag, von
denen behinderte Menschen besonders betroffen sind. Auf Flugbl&auml;ttern
und in Reden verschiedener Behindertenvertreter forderten sie mehr
"Teilhabe statt Ausgrenzungssparen".</P>

<P>Besonders erregte die Demonstranten die beabsichtigte Streichung des
Landesblinden- und Landespflegegeldes. Als "klaren Wortbruch" bezeichnete
Dr. Joachim Steinbr&uuml;ck vom Blinden- und Sehbehindertenverein Bremen
e.V. diese Ank&uuml;ndigung. Das Landesblindengeld stand bereits vor zwei
Jahren zur Diskussion, doch damals konnten der Bremer Blindenverein und
andere Behindertenverb&auml;nde durch &ouml;ffentlichkeitswirksame Aktionen
und gute Argumente die f&uuml;hrenden Politiker von SPD und CDU von der
Notwendigkeit dieser Leistung &uuml;berzeugen. Danach war von seiten der
Politik zugesichert worden, dass das Landespflegegeldgesetz f&uuml;r
l&auml;ngere Zeit von der Tagesordnung verschwindet.</P>

<P>Besonders bitter: der Blindenverein h&auml;tte sich vor zwei Jahren auf
eine Besitzstandsregelung einlassen k&ouml;nnen, die man den Blinden wohl
heute nicht mehr nehmen k&ouml;nnte. Doch der Verein zeigte sich
solidarisch mit den Menschen, f&uuml;r die das Blindengeld erst in Zukunft
von Bedeutung werden k&ouml;nnte. Und er nahm R&uuml;cksicht auf die
Bed&uuml;rfnisse schwerstbehinderter HeimbewohnerInnen, die mit dem
Landespflegegeld u.a. in die Lage versetzt werden, selbstbestimmt Kontakte
au&szlig;erhalb der jeweiligen Einrichtung zu pflegen. Daf&uuml;r nahm man
eine Absenkung des Blindengeldanspruches von damals 750 DM auf 650 DM in
Kauf. "Diese solidarische Haltung der Blinden erm&ouml;glichte einen
Kompromiss, der auch der Politik das Gesicht wahren half, und wurde daher
von allen Seiten sehr gelobt. Nun wird dies Verhalten im Nachhinein doch
noch bestraft - ein schlechtes Signal f&uuml;r die politische Kultur in
diesem Gemeinwesen!" schimpfte Wilhelm Winkelmeier vom Verein
SelbstBestimmt Leben, der sich vor zwei Jahren besonders f&uuml;r die
Interessen der schwerstbehinderten Heimbewohner stark gemacht hatte.
&Auml;hnlich befremdet zeigte sich Dieter Stegmann von der LAG Hilfe
f&uuml;r Behinderte Bremen &uuml;ber die geplante Streichung der
Fahrdienstpauschale, die vor allem Rollstuhlfahrer zum Ausgleich der
Mehrkosten erhalten, wenn sie statt &ouml;ffentlicher Nahverkehrsmittel
Taxis nutzen m&uuml;ssen. "Dabei war die Verwaltung selbst im vergangenen
Jahr zu dem Ergebnis gelangt, dass diese Pauschale in n&auml;chster Zeit
unver&auml;ndert weiter zu zahlen ist. Aber was soll man auch von einer
Regierung erwarten, der im Koalitionsvertrag zum Thema Behinderte und
&Ouml;PNV nur einf&auml;llt, dass man ,endlich' was dagegen tun muss, dass
,so viele' Mobilit&auml;tsbehinderte Busse und Bahnen umsonst nutzen
d&uuml;rfen?"</P>

<P>Gro&szlig;e Sorge bereitete allen Rednern die Zukunft der
Eingliederungshilfe f&uuml;r Behinderte. Hierzu enth&auml;lt der
Koalitionsvertrag eine Reihe von Bemerkungen, die vor allem f&uuml;r die
Betreuung und F&ouml;rderung von Menschen mit geistiger Behinderung nichts
Gutes erwarten lassen: Personalschl&uuml;ssel sollen abgesenkt werden, und
der Senat will sich daf&uuml;r einsetzen, dass die Eingliederungshilfe
insgesamt in die Verantwortung des Bundes &uuml;bergeht. Dazu die
Behindertenvertreter: "Wenn das auf eine Absenkung von Leistungen auf ein
nicht bedarfsgerechtes Bundesniveau hinausl&auml;uft, dann sehen wir uns
hier noch oft wieder!"</P>

<P>Kontakt: Wilhelm Winkelmeier, SelbstBestimmt Leben, Tel. 0421 70 44 09
Dr. Joachim Steinbr&uuml;ck, Blinden- und Sehbehindertenverein Bremen, Tel
361-5474</P>

<P>Sicher sind den Initiatoren ein Bericht im Regionalfernsehen (Interview
mit Herrn Steinbr&uuml;ck) und einer in Radio Bremen (Interview mit Uwe
Boysen). Ein Anfang ist also gemacht und auch die Abgeordneten der Bremer
B&uuml;rgerschaft bekommen heute noch Post.</P> <HR width="60%">

<P align="center"><FONT color="#000080" size=
"7"><B>&Auml;nderungen bei den Tarifen der Deutschen Bahn
AG</B></FONT></P>

<P>Nun aber noch ein ganz anderes Thema, das die Gem&uuml;ter nichts desto
trotz immer wieder erhitzt - die Deutsche Bahn AG: Rainer Engel,
DVBS-Mitglied und stellvertretender Vorsitzender des Fahrgastverbandes Pro
Bahn hat in nachfolgendem Artikel detailiert dargestellt, wie sich die
Tarife f&uuml;r Blinde und Sehbehinderte nach der gestrigen Pressekonferenz
darstellen. Das wollen wir Ihnen nicht vorenthalten, zumal es eine wirklich
gute Nachricht gibt: Die BahnCard mit 50 % kommt wieder - ab dem 1.8.2003.
Aber lesen Sie selbst:</P>

<P>DB-Tarif umgekrempelt:</P>

<P>Einfach fahren - einfach sparen</P>

<P>Die alte Bahncard ist wieder da</P>

<P>Der schroffen Ablehnung jeder Nachbesserung am "genialen Preissystem"
der DB folgten erste z&ouml;gerliche Korrekturen am Tarif- und
Auskunftssystem, dann die Senkung der Stornogeb&uuml;hren und am 2. Juli
nicht nur die Bekanntgabe der Wiedereinf&uuml;hrung der "alten" Bahncard
mit 50 % Rabatt, sondern eine grundlegende Revision des Rabattsystems. Die
&uuml;berraschend konsequente und umfassende Korrektur ist ein Erfolg
f&uuml;r PRO BAHN und die sp&auml;te Best&auml;tigung daf&uuml;r, dass die
Kritik am "neuen" Preissystem richtig war.</P>

<P>Die &Auml;nderungen zum 1. August 2003</P>

<P><B>* Bahncard 25</B><BR>
Die "neue" Bahncard mit 25 % Rabatt wird billiger: sie kostet in der 2.
Klasse 50 Euro (bisher 60 Euro), in der 1. Klasse 100 Euro (bisher 150
Euro). F&uuml;r Familien gibt es weiter die Partner- und Kinder-Bahncard zu
je 5 Euro. Diese Bahncard kann mit dem Mitfahrer-Rabatt kombiniert werden,
auch k&ouml;nnen Kinder kostenlos mit Eltern und Gro&szlig;eltern fahren.
Bis zum 30.9.2004 ist die Kombination mit den Sparpreisen m&ouml;glich.
Eine weitere Verbilligung f&uuml;r Schwerbehinderte wird nicht angeboten.
Der Umtausch in die Bahncard 50 ist m&ouml;glich.</P>

<P><B>* Bahncard 50</B><BR>
Die Bahncard mit 50 % Rabatt kostet 200 Euro (2. Klasse) bzw. 400 Euro (1.
Klasse). F&uuml;r Partner, Kinder, Jugendliche, Studenten, Rentner und
Schwerbehinderte (MdE mindestens 70 %) kostet sie 100 bzw. 200 Euro.
Mitfahrer-Rabatt und die kostenlose Kindermitnahme gilt k&uuml;nftig auch
f&uuml;r diese Bahncard. Damit ist der Zustand wie vor dem 15. Dezember
2002 fast wieder hergestellt.</P>

<P><B>* Bahncard 100</B><BR>
Das war bisher die pers&ouml;nliche Netzkarte. Sie wird rund 10 %
preiswerter und kostet f&uuml;r ein Jahr in der 2. Klasse 3.000 Euro, in
der 1. Klasse 5.000 Euro. Partner und Kinder erhalten eine Bahncard 25
kostenlos, die Kindermitnahme gilt.</P>

<P><B>* Sparpreise</B><BR>
Das System der bisherigen Plan&amp;Spar-Preise mit Zugbindung wird
vereinfacht:<BR> R&uuml;ckfahrkarten mit Zugbindung bringen 25 % Rabatt,
mit Wochenendbindung 50 %. Den Rabatt gibt es nur "solange der Vorrat
reicht". Einheitlich betr&auml;gt die Buchungsfrist 3 Tage, die
Stornogeb&uuml;hr 15 Euro und ein Mindestpreis (2. Klasse: 30 Euro). Mit 50
% Rabatt kann man jetzt auch am gleichen Tag hin- und zur&uuml;ckfahren,
wenn es ein Samstag oder Sonntag ist.</P>

<P><B>* Kinder und Mitfahrer</B><BR>
Die Mitfahrer-Regelung (Mitfahrer zahlen die H&auml;lfte) und die
kostenlose Mitfahrt von Kindern unter 15 Jahren mit Eltern und
Gro&szlig;eltern bleiben erhalten.</P>

<P><B>Weitere &Auml;nderungen am Tarif- und Auskunftssystem:</B><BR>
Ihre Bef&ouml;rderungsbedingungen hat die DB seit der Einf&uuml;hrung am
15.12.2002 schon drei Mal ge&auml;ndert: zum 1. April, zum 21. Mai und zum
15. Juni 2003. Dabei wurden Details in immer gr&ouml;&szlig;eren Schritten
nachgebessert, die Behinderten-Diskriminierung aber noch nicht
beseitigt.</P>

<P><B>Familienkarte eingef&uuml;hrt</B><BR>
Heftige Kritik entz&uuml;ndete sich daran, dass die DB in der Werbung
versprach, das Eltern und Gro&szlig;eltern beliebig viele Kinder kostenlos
mitnehmen d&uuml;rfen, die aber in der Fahrkarte eingetragen werden
m&uuml;ssen. Am Fahrkartenschalter stellt sich dann heraus, dass mehr als
f&uuml;nf Personen nicht in die Fahrkarte eingetragen werden k&ouml;nnen.
Hierauf reagierte die DB bereits im Februar mit der Einf&uuml;hrung einer
"Familienkarte". Sie wird aber nur ausgestellt, wenn mehr als drei Kinder
zwischen 6 und 14 Jahren vorhanden sind, und erfordert einen Antrag. Nicht
verwechselt werden darf diese Familienkarte mit der "TEE-Familienkarte".
Diese wird f&uuml;r grenz&uuml;berschreitende Reisen in die Schweiz und
nach &Ouml;sterreich ausgestellt. Sie ist schon f&uuml;r das erste Kind
n&ouml;tig und erlaubt Eltern und Gro&szlig;eltern, Kinder bis zu 16 Jahren
kostenlos mitzunehmen. Hier d&uuml;rfen aber nur maximal 5 Personen
zusammen reisen. Ob Zugpersonal und Fahrg&auml;ste die Unterschiede
verstehen?</P>

<P><B>Fahrtunterbrechung erm&ouml;glicht</B><BR>
Eine durchgehende Fahrkarte zu kaufen, war nach dem alten Tarif eher eine
Frage der Bequemlichkeit. Nach dem neuen Tarif muss erhebliche
Einbu&szlig;en hinnehmen, wer seine Fahrkarten einzeln kauft: der Rabatt
f&uuml;r weite Entfernungen, der durch den degressiven Tarif gew&auml;hrt
wird, geht verloren, und Spar-Rabatte gibt es nur f&uuml;r
R&uuml;ckfahrkarten.</P>

<P>Die Geltungsdauer der Fahrkarten wurde seit dem 15. Dezember 2002 von 4
auf 2 Tage herabgesetzt. Doch diese Geltungsdauer konnte bei
Fahrtunterbrechungen nicht ausgenutzt werden: das Computersystem begrenzte
die Fahrtunterbrechung auf 12 Stunden. In den Bef&ouml;rderungsbedingungen
war das nicht vermerkt. Am 16. Mai wurde verk&uuml;ndet, dass ab 15.Juni
die Konditionen verbessert werden. Nun erlaubt der Computer mehr als 12
Stunden Fahrtunterbrechung.</P>

<P><B>Stornogeb&uuml;hren gesenkt</B><BR>
Seit dem 21. Mai wird statt der mit 15, 30 und 45 Euro gestaffelten
Stornogeb&uuml;hr nur noch einheitlich 15 Euro erhoben.</P>

<P><B>Anfangsfahrschein eingef&uuml;hrt</B><BR>
Wieder eingef&uuml;hrt wurde auch der "Anfangsfahrschein". Dieser ist aus
Nahverkehrsautomaten zu erhalten, wenn diese daf&uuml;r eingerichtet sind,
die Umstellung geht schleppend vor sich, in einigen Bundesl&auml;ndern wird
der "Anfangsfahrschein" nicht eingef&uuml;hrt. Der "Anfangsfahrschein"
kostet je nach Region 10 oder 15 Euro und soll erm&ouml;glichen, dass man
im Zug oder auf einem Unterwegsbahnhof einen richtigen Fahrschein ohne
Nachl&ouml;segeb&uuml;hr erh&auml;lt.</P>

<P><B>Internet: Auskunft und Verkauf verbessert</B><BR>
Auch die Internet-Auskunft der DB wurde verbessert. Seit dem 15. Juni kennt
das System das "Sch&ouml;nes-Wochenende-Ticket" und zeigt die Preise
korrekt f&uuml;r einfache Fahrt und Hin- und R&uuml;ckfahrt an. Die
L&auml;ndertickets sind nach wie vor nicht eingearbeitet. Der
Mi&szlig;stand unrichtiger Ausk&uuml;nfte besteht also teilweise fort, er
zeigt, wie wenig Tarif und Auskunftssystem harmonieren.</P>

<P>Die M&ouml;glichkeit, sich in der Internet-Auskunft auch preiswertere,
aber langsamere Verbindungen anzeigen zu lassen, ist nicht mehr versteckt,
sondern auf der Seite zug&auml;nglich, auf der man die Auskunft anfordert.
Allerdings muss man dazu ein H&auml;kchen an der Eingabe "Schnelle
Verbindungen bevorzugen" entfernen und selbst darauf kommen, dass schnell
auch fast immer teuer ist.</P>

<P>Daf&uuml;r ist es nun nicht mehr m&ouml;glich, die Zeit f&uuml;r
Umsteigen und Fahrtunterbrechung pr&auml;zise anzugeben.
Fahrtunterbrechungen k&ouml;nnen nur in vollen Stunden angegeben werden,
was dazu f&uuml;hren kann, dass bestimmte Anschlu&szlig;z&uuml;ge einfach
nicht gefunden werden. Umsteigezeiten kann man mit mindestens 15, 30 und 45
Minuten angeben.</P>

<P>Der Kauf von Online-Tickets ist nun allen Kreditkarteninhabern
zug&auml;nglich. Im Online-Shop sind jetzt auch alle L&auml;ndertickets und
einige andere Tickets wie z.B. das Egronet-Ticket f&uuml;r das Vogtland und
Nordb&ouml;hmen zu bekommen.</P>

<P><B>Weitere M&auml;ngel bleiben</B><BR>
Bisher sind aber die Bestimmungen, die Schwerbehinderte diskriminieren,
nicht beseitigt worden. Weiterhin ist die Mitnahme von Tandems nach den
Bef&ouml;rderungsbedingungen verboten, wenngleich in der Praxis dieses
Verbot nicht bekannt ist und f&uuml;r Tandems auch spezielle
Stellpl&auml;tze reserviert werden k&ouml;nnen. F&uuml;r Tandems ist in der
Praxis nur noch eine Fahrradkarte erforderlich.</P>

<P>Behinderte, die Automaten nicht bedienen k&ouml;nnen, m&uuml;ssen
dennoch im Zug weiterhin den Bordpreis zahlen. Ausgenommen sind nur Blinde
- die Sehbehinderten werden also weiterhin diskriminiert. F&uuml;r den 1.
August sind erneut &uuml;berarbeitete Bef&ouml;rderungsbedingungen zu
erwarten. PRO BAHN wird sie alsbald pr&uuml;fen.</P>

<P>Stand: 3. Juli 2003 - Angaben ohne Gew&auml;hr</P>

<TABLE border="1" cellpadding="4" summary="">
<TR>
<TH colspan="2">- Michael Herbst -<BR>
DVBS - &Ouml;ffentlichkeitsarbeit</TH>
</TR>

<TR>
<TD colspan="2">Deutscher Verein der Blinden und Sehbehinderten<BR>
in Studium und Beruf e.V. - DVBS</TD>
</TR>

<TR>
<TD>Anschrift:<BR>
Tel:<BR>
Fax:<BR>
E-Mail:<BR>
Internet:</TD>

<TD>Frauenbergstra&szlig;e 8, 35039 Marburg<BR>
+49 (0) 64 21 / 9 48 88-0<BR>
+49 (0) 64 21 / 9 48 88-10<BR>
mailto:herbst@dvbs-online.de<BR>
http://www.dvbs-online.de</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

