<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Cord Hagen -->

<TITLE>XXL</TITLE>
</HEAD>

<BODY background="bg_cord1.jpg" text="#fffff0" bgcolor="#000000">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<H2 align="center"><FONT color="#ffff00"><B>XXL k&uuml;nftig nur noch
f&uuml;r Telefongespr&auml;che</B></FONT></H2>

<P>Beitrag im Forum <B>[Orakel]</B></P>

<P>Die Telekom[1] hat bei der Regulierungsbeh&ouml;rde[2] einen Antrag[3]
auf &Auml;nderung des XXL-Tarifs eingereicht. Zwar sollen XXL-Kunden
k&uuml;nftig auch samstags kostenlos telefonieren k&ouml;nnen, daf&uuml;r
f&auml;llt aber die M&ouml;glichkeit weg, auch kostenlos zu surfen. Im
Antragstext ist ein entsprechender Passus enthalten. Wie diese
Unterscheidung funktionieren soll, ist bislang aber noch nicht klar.
Alleine nach dem Dienstmerkmal "Daten" ist es nicht m&ouml;glich, denn das
nutzen beispielsweise auch Bildtelefone, nicht hingegen Modems, die
&uuml;ber eine Telefonanlage angeschlossen sind. Es bleibt also vermutlich
nur die Identifizierung zahlreicher Einwahlknoten &uuml;ber die
Telefonnummer.</P>

<P>Der hohe Aufwand zur Ermittlung der Einwahlknoten d&uuml;rfte sich
f&uuml;r die Telekom aber schnell auszahlen: XXL-Einwahlpunkte[4] liegen in
der Regel in Fremdnetzen. Die Telekom muss in diesem Fall f&uuml;r jede
Verbindungsminute rund 0,5 Cent an die Telefongesellschaft abf&uuml;hren,
in deren Netz der Einwahlknoten liegt. XXL-Surfer, die lange
Online-Sitzungen durchweg in Fremdnetzen verbringen, verursachen der
Telekom also hohe Kosten.</P>

<P>F&uuml;r Altkunden, die ihren bestehenden Tarif nicht wechseln, wird
sich vorerst nichts &auml;ndern. Neukunden und Tarif-Wechsler zahlen nach
den Vorstellungen der Telekom 9,22 Euro im Monat f&uuml;r den neu
gestalteten XXL-Tarif. Der neue Preis gilt laut Antrag auch f&uuml;r
Analogkunden; bislang mussten diese erheblich mehr f&uuml;r den XXL-Tarif
zahlen. Im Antrag findet sich aber auch ein Passus, der eine Preselection
auf einen anderen Netzbetreiber verbietet. Offensichtlich setzt der Konzern
auf ein kurzes Ged&auml;chtnis der Beh&ouml;rden: Vor rund zwei Jahren
hatte die Regulierungsbeh&ouml;rde genau diese Praxis untersagt[5].</P>

<P>Voraussetzung f&uuml;r den neuen Tarif ist allerdings, dass die RegTP
diesen auch tats&auml;chlich genehmigt. Das muss nicht unbedingt der Fall
sein: In der Vergangenheit hat die Regulierungsbeh&ouml;rde schon
h&auml;ufiger Telekom-Antr&auml;ge abgelehnt oder ge&auml;ndert. Besonders
beim Punkt Preselection d&uuml;rfte die Telekom beim Regulierer auf Granit
bei&szlig;en. (uma[6]/c't)</P>

<P>URL dieses Artikels:<BR>
http://www.heise.de/newsticker/data/uma-07.07.03-000/</P>

<P>Cord Hagen</P>
<HR>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

