<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Cord Hagen -->

<TITLE>Die Foren von www.BLINDzeln.de</TITLE>
</HEAD>

<BODY background="bg_cord1.jpg" text="#ffffff" bgcolor="#000000">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>

<H1 align="center"><FONT color="#ffff00"><B>Die Foren von www.BLINDzeln.de
</B></FONT></H1>

<H3><B>Forum 001 [ECHO] gestartet am 24. Februar 2003</B></H3>

<P>[ECHO] ist der Treffpunk f&uuml;r H&ouml;rbuch- und H&ouml;rspielfreunde
von www.BLINDzeln.de! Hier werden H&ouml;rb&uuml;cher und H&ouml;rspiele
bewertet, empfohlen und die M&ouml;glichkeit zum Tausch und zu einer
H&ouml;rbuchpatenschaft (ausschlie&szlig;lich Original-Tontr&auml;ger)
geboten. Besonders eingeladen in diese Runde sind auch sehbehinderte und
blinde Menschen. Alle Mitglieder dieses Forums werden BLINDzler genannt.
Werde auch Du heute noch ein BLINDzler....<BR>
<FONT color="#ffff00">anmelden-echo@blindzeln.de</FONT></P>
<HR>

<H3><B>Forum 002 [ORAKEL] gestartet am 04. April 2003</B></H3>

<P>[ORAKEL] ist ein weiteres Forum von www.BLINDzeln.de rund um das Thema,
Computer, Internet und mehr. Endlich ein Forum, indem man alles fragen
kann, ohne das man &uuml;berlegen muss, ob die Frage vielleicht peinlich
sein k&ouml;nnte. Bei uns gibt es keine dummen Fragen, sondern kluge
Antworten. [ORAKEL] bietet dazu dasselbe famil&auml;r-freundschaftliche
Flair, wie bei allen Foren von www.BLINDzeln.de! Wir m&ouml;gen hier keine
Besserwissser, sondern besseres Wissen. [ORAKEL], das nette Forum mit
Wohlf&uuml;hlgarantie auf der st&auml;ndigen Suche nach Antworten und nette
Menschen, die Erfahrungen austauschen m&ouml;chten. Unsere Forenmitglieder
werden BLINDzler genannt und freuen sich &uuml;ber Deinen Besuch. Heute
schon geBLINDzelt?<BR>
<FONT color="#ffff00">anmelden-orakel@blindzeln.de</FONT></P>
<HR>

<H3><B>Forum 003 [COMMI] gestartet am 06. April 2003</B></H3>

<P>[COMMI] - endlich ein Forum nur f&uuml;r Freunde und Interessenten des
Communicators von Nokia. Hier findest Du Gleichgesinnte, die sich nicht
f&uuml;r modische Spielzeughandys begeistern k&ouml;nnen, sondern eben
f&uuml;r einen Commi. Es spielt keine Rolle, welchen Nokia Communicator Du
hast, oder ob Du &uuml;berhaupt schon so eine eierlegende Wollmilchsau
hast. Schon das Du Dich daf&uuml;r interessierst gen&uuml;gt, um zu wissen,
dass Du hier richtig bist. [COMMI] ist ein Forum von www.BLINDzeln.de und
m&ouml;chte sein famil&auml;r-freundliches Flair auch in dieses Forum
transportieren. Hier sind uns nur nette, hilfsbereite und freundliche
Menschen herzlich Willkommen. Diese Menschen nennen sich BLINDzler und wenn
Du Dich angesprochen f&uuml;hlst, dann besuche uns doch jetzt gleich. Wir
freuen uns auf Dich. Heute schon geBLINDzelt?<BR>
<FONT color="#ffff00">anmelden-commi@blindzeln.de</FONT></P>
<HR>

<H3><B>Forum 004 [PINGUIN] gestartet am 19. April 2003</B></H3>

<P>[PINGUIN] ist ein weiteres Forum von www.BLINDzeln.de, welches sich rund
um das Thema Linux k&uuml;mmern m&ouml;chte. Hier findest Du
Erfahrungsaustausch, Hilfe und nette Kontakte zu anderen
BLINDzel-Pinguinen. Unsere Mitglieder nennen sich BLINDzler und wir freuen
sich immer &uuml;ber neue nette Menschen, die BLINDzler werden
m&ouml;chten. Auch in [PINGUIN] findest Du das gewohnt freundschaftliche
Flair, das aus den anderen Foren von www.BLINDzeln.de bekannt ist. Sei bei
[PINGUIN] dabei und freue Dich auf nette BLINDzler-Kontakte.<BR>
<FONT color="#ffff00">anmelden-pinguin@blindzeln.de</FONT></P>
<HR>

<H3><B>Forum 005 [WASCHWEIB] gestartet am 17. Juni 2003</B></H3>

<P>[WASCHWEIB] ist das lockerfreundliche Forum von www.BLINDzeln.de -
Ernste Diskussionen und Menschen, die nach strengen Regeln leben,
m&uuml;ssen leider drau&szlig;en bleiben. Dieses Forum soll die anderen
Themenbezogenen Foren von www.BLINDzeln.de etwas entlasten. In [WASCHWEIB]
finden sich nette Leute zum Plaudern und Austausch unsinnigster Gedanken
zusammen. Spa&szlig;, nette BLINDzler, viel zum Lachen und schmunzeln aber
auch andere pers&ouml;nliche Diskussionen k&ouml;nnen hier z&uuml;gellos
gef&uuml;hrt werden. Bist Du noch kein [WASCHWEIB]? Dann komm zu uns und
bring viel gute Laune mit....<BR>
<FONT color="#ffff00">anmelden-waschweib@blindzeln.de</FONT></P>
<HR>

<H3><B>Forum 006 [SEHHUND] gestartet am 28. Juni 2003</B></H3>

<P>[SEHHUND] ist unser Forum rund um das Thema F&uuml;hrhund. Hier treffen
sich F&uuml;hrhundhalter und solche, die es gern werden m&ouml;chten, um
Tipps und Informationen austauschen zu k&ouml;nnen. Aber auch andere
lebendige Wegweiser bekommen hier ihre angemessene Aufmerksamkeit.
[SEHHUND] ist ein Forum von www.BLINDzeln.de und hier ist der gleiche
freundschaftliche und vor allem freundliche Umgangston erw&uuml;nscht, wie
in allen Foren von www.BLINDzeln.de -Miteinander erreichen wir mehr!<BR>
<FONT color="#ffff00">anmelden-sehhund@blindzeln.de</FONT></P>
<HR>

<H3><B>Forum 007 [BRANDMAUER] gestartet am 29. Juni 2003</B></H3>                                       

<P>[BRANDMAUER] - immer wieder ein heiss diskutiertes Thema im Alltag mit
Computern und Internet waren Firewalls und Sicherheit und dieses Thema wird
immer aktuell bleiben. In unserem Forum [BRANDMAUER] befassen wir uns ganz
gezielt mit der Sicherheit von Computersystemen im Internet und geben
Tipps, wie man sich vor unbefugten Zugriffen, Viren und anderen ungebetenen
G&auml;sten sch&uuml;tzen kann. Wir diskutieren &uuml;ber die vielen
M&ouml;glichkeiten, sich sicherer im Netz der Netze bewegen zu k&ouml;nnen
und stellen Software vor, die dabei helfen soll. Hier wird auch nicht
einfach auf andere Internetseiten aufmerksam gemacht, sondern hier wird
erkl&auml;rt - unzwar ausf&uuml;hrlich und f&uuml;r Jeden
verst&auml;ndlich! Das es auch in diesem Forum freundlich und in einem
besonders netten Umgangston zugehen soll, ist dabei
selbstverst&auml;ndlich, denn auch unsere [BRANDMAUER] ist ein Forum von
www.BLINDzeln.de<BR>             
<FONT color="#ffff00">anmelden-brandmauer@blindzeln.de</FONT></P>
<HR>

<H3><B>Forum 008 [BAUZAUN] gestartet am 30. Juni 2003</B></H3>

<P>[BAUZAUN] setzt sich mit dem Thema barrierefreis Bauen, Wohnen und die
Gestaltung des &ouml;ffentlichen Raumes mit und f&uuml;r sehbehinderte und
blinde B&uuml;rgerinnen auseinander. Auf den Seiten "Kopf und Herz
barrierefrei" auf www.BLINDzeln.de werden hierzu screenreadergeeignete
Praxisberichte und Forschungsergebnisse gesammelt und zum Download zur
Verf&uuml;gung gestellt. Zudem werden Links zu Experten und Herstellern
Schritt f&uuml;r Schritt zusammengetragen. [BAUZAUN] l&auml;dt herzlich
langj&auml;hrig Aktive und Engagierte vor Ort ein, miteinander ihre
positiven und negativen Erfahrungen auszutauschen, um gemeinsam
m&ouml;glichst viele Barrieren im Alltag aus dem Weg zu r&auml;umen. Wie
alle Foren von www.BLINDzeln.de, so ist uns auch hier der sehr angenehme
nahezu freundschaftliche Umgangston besonders wichtig. Riskiere auch Du
heute noch einen Blick &uuml;ber den [BAUZAUN]....<BR>
<FONT color="#ffff00">anmelden-bauzaun@blindzeln.de</FONT></P>
<HR>

<H3><B>Forum 009 [KURPFUSCHER] gestartet am 02. Juli 2003</B></H3>

<P>[KURPFUSCHER] ist das Forum f&uuml;r Naturheilkunde und allem, was dazu
geh&ouml;rt. Hier werden Theman zu Phytotherapien oder zu Physiotherapien,
wie Massagemethoden, Reflexzonenmassage, G&uuml;sse, Lymphdrainagen,
Bewegungs&uuml;bungen, Schlingentisch, Krankengymnastik, Elektrotherapie
(Reizstrom) und anderes diskutiert. Alles zum Thema Kr&auml;uter und deren
Verwendung, Beschreibungen einzelner Pflanzen, Tees und Elixiere weis
unsere [KURPFUSCHER]. Von den Hausmitteln der "Alten" bis zur
Hom&ouml;opathie, von Informationen zu Impfungen und deren viele
t&ouml;dliche Ausg&auml;nge bis zu den vielen alternativen Heilmethoden und
Beantwortung von Fragen zu Beipackzetteln - komm zu uns zu den
[KURPFUSCHER] und erfahre mehr hierzu. Dabei soll es in [KURPFUSCHER]
genauso nett und freundschaftlich zugehen, wie in allen anderen Foren von
www.BLINDzeln.de. Komm zu uns zu den [KURPFUSCHER]n und lass Dich
verarzten....<BR>
<FONT color="#ffff00">anmelden-kurpfuscher@blindzeln.de</FONT></P>
<HR>

<H3><B>Forum 010 [NUNTIUS] gestartet am 04. Juli 2003</B></H3>

<P>[NUNTIUS] - hier werden Neuigkeiten aus dem Internet gesucht, gesammelt
und ver&ouml;ffentlicht um BLINDzlern die aufw&auml;ndige Suche nach
wichtigen Informationen zu ersparen. In [NUNTIUS] (lateinisch: "Der Bote")
werden News aus den Themenbereichen Behindertenpolitik, Behindertensport,
Behindertenfreizeit und Kultur aufbereitet und k&ouml;nnen anschliessend
auch diskutiert werden. Vereine und Verb&auml;nde k&ouml;nnen sich im
[NUNTIUS] zu Wort melden und sich und Ihr Angebot n&auml;her vorstellen.
Dieses Forum von www.BLINDzeln.de soll wie alle anderen BLINDzeln-Foren
netten BLINDzlern vorbehalten sein, die wissen, wie man nett und
freundschaftlich miteinander umgeht. Informiere auch Du Dich in unserem
[NUNTIUS]....<BR>
<FONT color="#ffff00">anmelden-nuntius@blindzeln.de</FONT></P>

<P>Weitere Foren in Vorbereitung....</P>

<P>Cord Hagen</P>
<HR>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

