<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Tiger Tale Adventure Hunter Report</TITLE>
</HEAD>

<BODY background="nc_bg1.jpg" text="#000000" link="#0000ff"
alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE border="0" width="100%" cellpadding="8" summary="">
<TR>
<TD>
<P align="center">
<IMG src="gt_trmenu.gif" width="85" height="54" alt="Menu-Bild"></P>

<H1>Tiger Tale Adventure Hunter Report</H1>

<P>Ich begr&uuml;&szlig;e Euch wieder alle, die sich heute hierher verirrt
haben zum aktuellen Tiger Tale Adventure Hunter Report. Nachdem ich letzten
Monat ungef&auml;hr angerissen habe, worum es geht, habe ich nun einige
R&auml;ume erstellt die dringend gebraucht werden und wo das Spiel beginnen
soll. Das ist nat&uuml;rlich Randas Haus. Erstellt habe ich zuerst Randas
Schlafzimmer, dazu erst einmal ein Bild, damit ihr wisst worum es geht:</P>

<P align="center"><A href="gt_trsh.gif" target="_blank" align="center">
<IMG src="gt_trshk.gif" width="160" height="120" alt="Randas Schlafzimmer
hell"></A></P>

<P>Vielleicht nun ein paar Worte dazu. Damit man wei&szlig; wie der Raum am
besten aussieht, macht man sich nat&uuml;rlich Gedanken und Skizzen dazu.
Diese kann ich Euch leider nicht pr&auml;sentieren, da ich keinen Scanner
besitze. Ihr verpasst aber nicht besonders viel, denn nicht immer geht es
in der Praxis so wie man es sich am Anfang vorstellt. Der Schrank sollte
normal erst wo anders stehen, n&auml;mlich rechts an der Wand, wo nun die
gr&uuml;ne Ankleidewand steht. Wie ich dann aber sp&auml;ter feststellte
ist es besser, wenn man ihn von vorne sieht, denn man soll ihn ja auch
&ouml;ffnen k&ouml;nnen und dann kann man besser hineinschauen.
Au&szlig;erdem h&auml;tte ich mit Sicherheit die Schnitzereien nicht so
sch&ouml;n hinbekommen. Beachtet auch mal diesen kleinen Kasten neben dem
Bett an der Wand. Wenn man ihn bet&auml;tigt, dann soll sp&auml;ter das
passieren:</P>

<P align="center"><A href="gt_trsd.gif" target="_blank" align="center">
<IMG src="gt_trsdk.gif" width="160" height="120" alt="Randas Schlafzimmer
dunkel"></A></P>

<P>Ich habe das Schlafzimmer durch den Filter von PPaint laufen lassen und
herausgekommen ist dieses Schlafzimmer in der D&auml;mmerung. Wenn es in
der Story erforderlich ist, kann man es sp&auml;ter noch einmal abdunkeln
um die R&auml;ume bei v&ouml;lliger Dunkelheit zu erhalten, aber das nur
nebenbei vielleicht fliegt der Lichtschalter sp&auml;ter auch wieder raus.
Die Ankleidewand ist ebenfalls noch eine Erw&auml;hnung wert, denn dort
soll man auch dahinter laufen k&ouml;nnen. Dazu ist es erforderlich eine
sogenanne Maske zu erstellen aus zwei Farben mit Schwarz als Farbe 1. Die
zwei Bilder werden sp&auml;ter &uuml;bereinander gelegt und die Figur
verschwindet, sobald man diesen schwarzen Bereich betritt. Diese Maske
zeige ich Euch auch gleich, auch wenn es wohl etwas langweilig f&uuml;r
Euch ist, aber der Vollst&auml;ndigkeit halber bitte sehr:</P>

<P align="center"><A href="gt_trshm.gif" target="_blank" align="center">
<IMG src="gt_trshm.gif" width="160" height="120" alt="Maske im hellen
Schlafraum"></A></P>

<P>Der Boden sieht f&uuml;r manche vielleicht ziemlich m&uuml;hselig aus,
in Wirklichkeit war es eine Sache von wenigen Sekunden, denn es ist nur ein
kleiner Ausschnitt, der sich st&auml;ndig wiederholt aber es f&auml;llt
eigendlich nicht auf, wenn man es nicht wei&szlig;. Ich dachte, ich mache
das komplette Obergescho&szlig; mit diesem Holzboden, denn es ist einfacher
f&uuml;r mich und die ganze Sache wird sch&ouml;n einheitlich. Sonst wirkt
der Raum allerdings zugegebenerma&szlig;en ziemlich leer. Das kann ich
ebenfalls erkl&auml;ren, denn ich habe momentan nur die notwendigsten
Einrichtungsgegenst&auml;nde plaziert da ich ja noch nicht wei&szlig;,
welche Gegenst&auml;nde f&uuml;r die R&auml;tsel sp&auml;ter wichtig sind.
Das muss dann separat gezeichnet und platziert werden. Darum mache ich mir
aber sehr viel sp&auml;ter Gedanken, wenn alle R&auml;ume des ersten Akts
begehbar sind und die Feinheiten dazukommen.</P>

<P>Kommen wir nun zu dem Flur. Dieser besteht aus zwei Teilen, dem Ober-
und Untergescho&szlig;. Dort ist es nat&uuml;rlich Unsinn den gesammten
Bereich zu verwenden. Aus diesem Grund habe ich es optisch begrenzt:</P>

<P align="center"><A href="gt_trfo.gif" target="_blank" align="center">
<IMG src="gt_trfok.gif" width="160" height="120" alt="oberer Flur"></A>
<A href="gt_trfu.gif" target="_blank" align="center">
<IMG src="gt_trfuk.gif" width="160" height="120" alt="unterer Flur"></A></P>

<P>Zum gutem Schluss noch Verinas Zimmer. Storym&auml;&szlig;ig
verl&auml;uft es &auml;hnlich wie in der Randa Saga. Verina hat ihre Eltern
verloren und so wohnt sie bei Randa, das macht storytechnisch gesehen
vieles einfacher. Verina ist ein gro&szlig;er Fan einer Buchreihe &uuml;ber
die Elfe Silvina Regenbogenhein. Das wird sp&auml;ter noch irgendwie von
Bedeutung sein. Daraus stammt auch das Poster an der Wand. In dieser
sch&ouml;nen Perspektive bekommt man das nur mit DPantIV hin, was deutlich
macht, dass man beide Malprogramme braucht. Beide haben sch&ouml;ne
Funktionen die sich gegenseitig gut erg&auml;nzen. Ob man den Schrank
sp&auml;ter auch &ouml;ffen kann, oder ob Randa sp&auml;ter einfach sagt
"Ich w&uuml;hle nicht in ihren Sachen rum" wei&szlig; ich noch nicht.
Geplant ist es auf jeden Fall erst einmal nicht. Auch dieser Raum sollte
erst ein wenig anders aussehen, aber ich wollte umbedingt das sch&ouml;ne
Poster an der Wand haben und so mu&szlig;te ich den Schreibtisch leider
direkt vor das Bett knallen. Bl&ouml;d ist nur, dass das sch&ouml;ne Bett,
an dem ich bestimmt eine Stunde gesessen habe, nun halb verschwindet, aber
so schlimm ist es doch nicht, oder? So ein Kinderzimmer hat den
unsch&auml;tzbaren Vorteil, das man auch eine peppigere Farbe f&uuml;r die
Wand nehmen kann, Ich habe mich f&uuml;r ein Hellblau entschieden und zeige
Euch gleich hier den Raum:</P>

<P align="center"><A href="gt_trvz.gif" target="_blank" align="center">
<IMG src="gt_trvzk.gif" width="160" height="120" alt="Verinas Zimmer"></A></P>

<P>Was gibt es f&uuml;r Pl&auml;ne in der Zukunft? Wichtig ist auf jeden
Fall Verina. Sie muss komplett animiert werden in alle vier Richtungen, was
meine n&auml;chste Monatsbesch&auml;ftigung sein wird. Au&szlig;erdem
fehlen noch die R&auml;ume Wohnzimmer, K&uuml;che, E&szlig;zimmer und noch
ein Raum, den ich mir erst einmal offen lasse. Diese R&auml;ume sind aber
erst einmal nicht so wichtig, dass ich sie vorerst hinten anstelle. Ich
w&uuml;nsche Euch weiterhin vergn&uuml;gliche Stunden mit der NoCover und
verbleibe mit den Worten, bis demn&auml;chst!</P>

<P>Thomas Weber</P>
<BR>
<BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

