¸<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author =  -->

<TITLE></TITLE>
</HEAD>

<BODY background="nc_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<P align="center"><FONT color="#000080" size="7"><B>Mail Nr.1</B></FONT></P>

<H3>Hallo,</H3>

<P>ich habe gerade mal die neue NoCover (112) &uuml;berflogen. Ich wollte
eigentlich schon ein paar Ausgaben eher meine Kritik loswerden, aber ich
dachte die NoCover h&auml;lt sich eh nicht mehr so lange, so das ich mir
die M&uuml;he auch sparen k&ouml;nnen...<BR> Nunja, ihr lebt immer noch
(freut mich) also st&ouml;ren mich auch weiterhin folgende Sachen:</P>

<OL>
<LI>Das Titelbild ist schlecht. Wie w&auml;re es mal mit einem eigenem
Logo oder Schriftzug?? Den BoingBall aus dem OS3.5 Hintergrund kann jeder
ausschneiden und passt zudem zu den Rest des Layoutes wenig.</LI>

<LI>Das ewige Gejammer &uuml;ber sinkende Beteiligung in dem Editorial ist
Standart. Mal ein Aufruf ist gut, aber das in JEDER Ausgabe nervt einfach
nur. Das Editorial ist weder unterhaltend noch regt es den Leser an, sich
die NoCover durchzulesen...<BR> Aufrufe und &auml;hnliches geh&ouml;ren in
die Rubrik "Intern" oder "SmallTalk".</LI></OL>

<P>Lob:<BR>
Die Remakes der alten NoCovers!! Ich habe fr&uuml;her die NoCover sehr
gerne gelesen, u.a. wegen dem coolen Layout (Magnetic Pages).</P>

<P>Viele Gr&uuml;&szlig;e<BR>
David</P>

<P align="center"><FONT color="#000080" size="7"><B>Mail Nr.2</B></FONT></P>

<P>Hallo Wolf,<BR>
am 02.07.03 hast du folgendes in die Tasten gehauen:</P>

<BLOCKQUOTE>
<FONT color="#006000"><B><I>Anhand der Autorenliste kannst du erkennen, wer
was eingesandt hatte und wenn du bedenkst, dass von den 94
Mailempf&auml;ngern so wenig beitragen, ist es nicht verwunderlich, wenn
ich diesbez&uuml;glich einige Worte im Editorial loswerde.</I></B></FONT>
</BLOCKQUOTE>

<P>Das ist verst&auml;ndlich. Aber jede Ausgabe? Da wird
einem die gute Stimmung genommen...  </P>

<BLOCKQUOTE>
<FONT color="#006000"><B><I>Gehe ich in der Annahme recht, dass ich diese Mail
als Leserbrief einbringen soll? Du wirst einige b&ouml;se Worte zu lesen
bekommen, so in der Richtung: Nicht mosern, sondern machen.</I></B></FONT>
</BLOCKQUOTE>

<P>Das weicht nun etwas von meiner Kritik
(negativ+positiv) ab, aber gerne nehme ich hierzu Stellung:<BR>
Meinetwegen kannst du ihn als Leserbrief einbringen, war eigentlich auch so
gewollt um der NC einen Gefallen zu tun.<BR>
Sicher kommt eine Antwort wie "Mach besser!". Ich wei&szlig; wie schwer das
ist, vielleicht kennst du noch das Disk-Mag "Amiga4ever". Da habe ich eine
zeitlang f&uuml;r geschrieben und die letzten drei Ausgaben selbst in die
Hand genommen. Danach habe ich noch f&uuml;r das Nachfolger-Mag geschrieben
(Fireball), die 10te Ausgabe l&auml;&szlig;t jetzt seit einem halben Jahr
auf sich warten, mangels Beteiligung.<BR>
Aber bis die Beteiligung zunimmt, mu&szlig; wohl der neue Amiga viele
K&auml;ufer gefunden haben...<BR>
Ich selber habe keine Lust f&uuml;r ein Mag zu schreiben, wo sich niemand
beteiligt und meine Artikel von gerade mal ein paar Dutzend Leuten gelesen
wird - ohne Feedback bringt es (mir) keinen Spa&szlig;. </P>
               

<P>Ursachen?<BR>
Foren wie z.B. amiga-news.de "klaut" die schreib-willigen. Wenn ich ein
Topic im Forum von amiga-news.de er&ouml;ffne, erhalt ich am selben Tag
min. eine Antwort, je nach Thema. Nun, warum sollte man also seine
Gedanken, Meinungen, Fragen, etc. in einem Online-Mag niederschreiben?</P>

<OL type="A">
<LI>Ein Online-Mag ist wie eine Zeitung, man kann sp&auml;ter nachschlagen
und es ist &uuml;bersichtlicher</LI>

<LI>Die Artikel sind meistens umfangreicher oder qualitiv besser</LI>

<LI>Ein Online-Mag ist famili&auml;rer</LI>

<LI>Das Mag (und somit meistens der eigene, wichtige Name) wird auf
verschiedene CD's gepresst</LI> </OL>

<P>Mehr f&auml;llt mir spontan nicht ein. Punkt A + D trifft auf jedes Mag
zu, Punkt C h&auml;ngt von den Mitgliedern bzw. Verfassern ab. Punkt B
trifft nicht bei jedem Mag zu, ist f&uuml;r den Amiga Sektor aber
letzendlich weniger von Bedeutung, da der Amiga User keine Wahl unter den
deutsch sprachigen Online Mags hat welches er bevorzugt.</P>

<P>Sind alle Punkte erf&uuml;llt, und die Beteiligung stimmt immer noch
nicht liegt es an den nicht vorhandenen aktiven Usern. Man k&ouml;nnte
jetzt meinen, niemand w&uuml;rde sich mehr f&uuml;r Online Mags
interessieren, aber in anderen Bereichen, sei es z.B. bei anderen
Betriebssystemen, Musik oder Auto-Szenen klappt es doch.</P>

<P>Damit sind wir wieder bei dem kleinen Amiga Markt... solange sich da
nichts &auml;ndert reizt es mich wenig Artikel zu verfassen. Ich
m&ouml;chte um gottes Willen niemandem den Spa&szlig; am Amiga oder dessen
Mags nehmen, aber wenn einer sich beteiligen soll, dann auch weil er es
m&ouml;chte, sprich es sollte f&uuml;r den einzelnen ein Reiz vorhanden
sein sich zu beteiligen.</P>

<P>Have a nice day<BR>
--<BR>
http://www.maccrack.de.vu<BR>
http://www.whdload-chat.de.vu<BR>
ICQ: 146750990</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

