<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Johannes Weidner -->

<TITLE>Vom braven Bruno Wolf</TITLE>
</HEAD>

<BODY background="bgc.gif" text="#000000" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<H2 align="center">Vom braven Bruno Wolf und den sieben frivolen
Gei&szlig;lein</H2>

<H4 align="center">Hanno Erdwein</H4>

<P>Jeder kannte Bruno Wolf. Sein ehrliches und aufrechtes Wesen war in
unserer kleinen Stadt in aller Munde. Gern wurde er als leuchtendes
Beispiel f&uuml;r kreuzbraves Verhalten hingestellt. Deshalb konnten ihn
viele Kinder, aber auch manch ein Erwachsener nicht ausstehen.</P>

<P>Bruno war neunzehn und wollte nach dem Hochschulabschluss Theologie
studieren. Er tr&auml;umte davon, einmal Geistlicher zu werden.</P>

<P>Das moralische Gegenteil zu Bruno waren wohl die sieben T&ouml;chter der
Linda Gei&szlig;. Auch &uuml;ber sie war mancherlei in Umlauf, was der
alleinerziehenden Mutter m&auml;chtig gegen den Strich ging. "Ihr solltet
endlich erwachsen werden", schimpfte sie mehrmals am Tag und sah streng auf
die Rotsch&ouml;pfe herab. "Wir tun keiner Fliege was zuleid", erhielt sie
zur Antwort. "Die Leute k&ouml;nnen uns nicht leiden, weil wir nicht so
spie&szlig;ig sind wie Bruno Wolf." So ganz von der Hand zu weisen war das
nicht. Im Grunde hielt Mutter Gei&szlig; ihre Spr&ouml;&szlig;linge nicht
f&uuml;r schlecht. Ja, sie hatten es oft genug arg getrieben und mit ihren
Sp&auml;&szlig;en die Leute aufgebracht. Aber die waren doch auch einmal
jung gewesen. Nur wollte sich niemand mehr an die Zeit erinnern. Und was
waren das schon f&uuml;r Schandtaten, die sich Britta, Iris und Lou (die
siebzehnj&auml;hrigen Drillinge), Sandra, Vicky und Evelyn (ebenfalls
Drillinge und sechzehn), sowie die f&uuml;nfzehnj&auml;hrige Lilly
erlaubten? W&auml;ren sie Jungs, w&uuml;rde man l&auml;chelnd dar&uuml;ber
hinweggesehen haben. Aber sie waren M&auml;dchen und hatten sich
gef&auml;lligst als solche aufzuf&uuml;hren.</P>

<P>Eines sonntagsmorgens warf Mutter Gei&szlig; ihre T&ouml;chter schon
zeitig aus den Betten. "Ihr m&uuml;sst heute einmal ohne mich
zurechtkommen", verk&uuml;ndete sie mit Sorgenfalten auf der Stirn. "Ich
muss r&uuml;ber nach Elmshorn zu eurer Tante Trudy. Die Gute hat ein paar
Probleme, wor&uuml;ber wir sprechen m&uuml;ssen." "Oooch", heuchlten die
M&auml;dels Bedauern.*Vorschlag: riefen die M&auml;dchen - ich finde, man
h&ouml;rt die Heuchelei auch so "Wir hier ganz allein?! Wie sollen wir
damit fertigwerden?" "Stellt euch nicht an. Ihr seid alt genug, mal ein
paar Stunden f&uuml;r euch selbst zu sorgen." Warf noch ein paar Sachen in
die Reisetasche und ging zur T&uuml;r. Dort drehte sie sich noch einmal um:
"Macht keine Dummheiten. Lasst niemand rein und &auml;rgert mir die Leute
nicht!" "Fahr ruhig", versicherte Britta mit glei&szlig;nerischem
Augenaufschlag, "wir werden alles befolgen." Im Grunde jubelten die sieben
klammheimlich &uuml;ber die sturmfreie Bude. Eine solche Gelegenheit kam so
rasch nicht wieder. Und das musste ordentlich ausgenutzt werden.</P>

<P>Sie steckten eine Weile die K&ouml;pfe zusammen und beratschlagten, wer
diesmal dran glauben sollte und wie sie vorgehen wollten. "Klar", grinste
Lilly, "das muss der Simpel von Bruno Wolf sein. Der hat l&auml;ngst einen
Denkzettel verdient." Die sechs anderen klopften ihrer j&uuml;ngsten
Schwester lachend auf die Achsel und waren begeistert. "Dem werden wir
ordentlich die H&ouml;lle hei&szlig; machen!" Lou kr&auml;uselte die Nase:
"Wenn der Betbruder nachher von der Kirche kommt, muss er hier vorbei. Wir
werden ihn unter irgendeinem Vorwand ins Haus locken." "Genau! Das machen
wir!" Vor Begeisterung sprangen sie in der Stube herum, kreischten und
johlten. Und wer den L&auml;rm von drau&szlig;en h&ouml;rte, musste denken,
dort w&uuml;rde eine w&uuml;ste Orgie gefeiert.</P>

<P>Bruno Wolf ging bewegt von der Kirche nach Hause. An diesem Marienfest
hatte ihm der Pfarrer so recht aus der Seele gepredigt und die heilige
Jungfrau als guten Weg zu Jesus dargestellt. Mit diesen Gedanken war er
besch&auml;ftigt, als er angesprochen wurde. "Hallo Bruno", fl&ouml;tete
eine M&auml;dchenstimme vom Haus der Gei&szlig; in seine Versunkenheit.
"M&ouml;chtest du nicht f&uuml;r einen Augenblick hereinkommen. Wir haben
ein Problem." Die Hilfsbereitschaft des jungen Mannes war ebenfalls in
aller Munde. Und die sieben Rotsch&ouml;pfe nutzten das schamlos aus. Bruno
&uuml;berlegte nicht lange. Ging arglos auf die T&uuml;r zu und wurde
hereingelassen. Rasch riegelte Lilly hinter ihm ab und zwinkerte ihren
Schwestern, was hei&szlig;en sollte: Den haben wir sicher. Bruno sah sich
um: "Was habt ihr denn f&uuml;r Probleme?" Evelin schob ihren Pulli hoch
und zeigte zwei knackige Br&uuml;ste: "Das hier", bekannte sie in
gespielter Unschuld. "Bist du krank", fragte Bruno besorgt. "Ja", seufzte
sie, "krank nach dir!" Aber der junge Mann reagierte ganz anders, als sie
sich das erhofft hatten: "Da kann ich dir nicht helfen. Ich bin ein Mann
Gottes und hab mit Frauensachen nichts im Sinn." "Auch nicht, wenn ich dich
ganz lieb bitte?" Sie r&uuml;ckte ihm mit ihren blo&szlig;en
Liebes&auml;pfeln auf die Pelle und rieb sich am rauhen Stoff seines
Anzugs. Er schob sie von sich. Ber&uuml;hrte dabei blo&szlig;es Fleisch,
das unter seinen Fingern zu brennen schien. V&ouml;llig unempf&auml;nglich
f&uuml;r weibliche Reize war auch er nicht. Und er hatte sich der Jungfrau
Maria deswegen geweiht, weil er den Stachel in seinem Fleisch abt&ouml;ten
wollte. "Weiche von mir, Satansweib!", fauchte er und wandte sich gegen die
T&uuml;r, das Haus fluchtartig zu verlassen. Aber die war versprerrt und
Britta stand in verf&uuml;hrerischer Pose davor. Ihre Jeans stand vorne auf
und zeigte genug vom Kraushaar, einen Bischof zu verf&uuml;hren. "Ich habe
auch ein Problem", seufzte sie. "Sei barmherzig und hilf mir!" "Scher dich
zur H&ouml;lle, geile Lilith", knirschte er. "Aber - aber! Wie kann man so
unfromm schimpfen!" Das j&uuml;ngste der M&auml;del war aus ihren Kleidern
geschl&uuml;pft und sprang nackend auf Brunos R&uuml;cken. "Mir hilf auch
bitte", flehte sie theatralisch. Durch den d&uuml;nnen Stoff seines
Sommeranzugs sp&uuml;rte er ihr hei&szlig;es Fleisch. Das musste ihn
zwangsl&auml;ufig erregen. Er biss die Z&auml;hne aufeinander, die Erektion
zu unterdr&uuml;cken, die sich bereits seine Hose ausbeulend bemerkbar
machte. Die frivolen M&auml;dels beobachteten das mit Vergn&uuml;gen und
begannen, ihn wie einen Spielball mal hierhin, mal dorthin zu schubsen.
&Uuml;berall geriet er an nackte Haut und l&auml;ngst schon begann sein
Glied die Hosenkn&ouml;pfe zu sprengen, um wie wild hervorzuzucken. "Ei!
Was ist denn das? Hat der fromme Bruno etwa einen &uuml;blen Hosenteufel?"
Kichernd trieben sie es noch wilder mit ihm. "Komm b&ouml;ser Wolf",
quiekte Vicky, "nimm mich. Ich bin ganz dein. Oder willst du lieber die
kleine Lilly vernaschen?" "Ich habe mich der Jungfrau Maria versprochen",
st&ouml;hnte er gequ&auml;lt. "Ach so bist du drauf", lachte Britta. Lilly
ist die einzige Jungfrau unter uns. Nimm sie. Sie wird dir dankbar
sein."</P>

<P>Vor geiler Lust und von starken Skrupeln gepeinigt, geriet Bruno immer
mehr in Raserei. Er schoss - einen Ausweg suchend - mal hierhin, mal
dorthin. Nach welcher Seite er sich auch wandte, &uuml;berall lockten Busen
und Schamhaar, streckten sich ihm aufreizend h&uuml;bsche Beine entgegen.
"Lasst mich raus!", flehte er verzweifelt. "Ihr seid Hexen und Teufelinnen.
Rauslassen!" Sandra versperrte ihm die T&uuml;r. In blinder Wut griff er
nach ihr und biss ihr in die Brust. Das M&auml;del schrie auf und gab
jammernd die T&uuml;r frei. Bruno kn&ouml;pfte sich zu, riss hastig den
Riegel zur&uuml;ck und st&uuml;rmte hinaus. Die M&auml;dels glucksten und
kicherten ihm hinterdrein. Nur Sandra tupfte sich das Blut vom Busen.</P>

<P>"Hat er heftig zugebissen?", wollte Britta wissen." "Ach, es geht. Er
ist ein Idiot. H&auml;tte doch eine von uns haben k&ouml;nnen." "Der? Der
wei&szlig; doch nicht mal, wie das geht." Am&uuml;siert zogen sie sich an
und sp&auml;hten durch die Gardine, das weitere Geschehen zu verfolgen.</P>

<P>Bruno hetzte die Stra&szlig;e lang. "Ich muss zur Muttergottes, meine
Schuld abb&uuml;&szlig;en. Ich muss mich ihr zu F&uuml;&szlig;en werfen!"
Das betete er halblaut vor sich hin und strebte dem Heiligenwinkel zu, der
an der n&auml;chsten Kreuzung stand. Das Pflaster war uneben. Platten
ragten zentimeterweise heraus. Schon stolperte der junge Mann und schlug
der L&auml;nge nach hin. "Ach Gott! Der arme Kerl!" Zwei alte
M&uuml;tterchen waren gleich bei ihm und untersuchten den Verletzten. "Ist
es schlimm, Jung?" Blut quoll ihm aus einer Platzwunde an der Stirn. "Ruf
doch mal einer den Krankenwagen", riefen die Frauen und sorgten sich
m&uuml;tterlich um den armen Kerl.</P>

<P>Bruno hatte das Erlebnis im Haus der Gei&szlig;ens nie ganz verwunden.
Und er h&uuml;tete sich, davon zu erz&auml;hlen. Nur sein Beichtvater
erfuhr von der seelischen Not. "Weihe dich der Gottesmutter", riet er ihm.
"Sie wird dir &uuml;ber das &Auml;rgste hinweghelfen."</P>

<P>Die N&auml;chte waren das Schlimmste. Die sieben M&auml;dels suchten ihn
immerfort in seinen Tr&auml;umen heim und lockten mit ihren Reizen. Er
masturbierte. Statt darin Erleichterung zu finden, wurde es noch
schlimmer.</P>

<P>Auch trieb er sich sp&auml;tabends in der N&auml;he des
Gei&szlig;enhauses herum. Er wusste selbst nicht, was er dort suchte - oder
er wusste es und wollte es vor sich selbst nicht wahrhaben. "Schaut mal",
grinste Vicky, "wer da um unseren Garten herumschleicht. "Oooch", meinte
Lou, "der arme Kerl. Will sich keiner seiner sexuellen Not erbarmen?"
Britta griff nach Lillys Arm: "Du wolltest doch immer schon einmal deine
d&auml;mliche Jungfernhaut verlieren. Da drau&szlig;en wartet die
Gelegenheit!"</P>

<P>Lilly schl&uuml;pfte aus der T&uuml;r und wurde gleich von Bruno hart am
Arm gepackt. Ohne ein Wort zog er sie ins n&auml;chste Erlengeh&ouml;lz.
Dort riss er ihr die W&auml;sche vom Leib und drang brutal in sie ein.
Lilly quiekte nur ein ganz klein wenig. Dann machte es ihr sogar
Spa&szlig;.</P>

<P>"Na", fragte Sandra, "wie wars? Bist du endlich das l&auml;stige Hymen
los?" Lilly zog ein Schn&auml;uzchen: "Bruno ist ein richtiger Mann. Er hat
mich genommen, wie es sich geh&ouml;rt." "Merkw&uuml;rdig, dass er sich bei
uns so idiotisch anstellte", wunderte sich Vicky. "Und er hat dich nach
allen Regeln der Kunst gebumst?" "Hmmm", meinte Lou, "was wohl seine
Jungfrau Maria dazu sagen wird!" Gekicher.</P>

<P>Eines Tages fand man Bruno blut&uuml;berstr&ouml;mt im Keller seines
Hauses. Nach n&auml;herer Untersuchung entdeckte man, dass er sich
kastriert hatte. Von da an hatte er endlich Ruhe vor den sieben roten
Teufelinnen.</P>

<P>Was aus den Gei&szlig;enm&auml;dchen geworden ist, entzieht sich unserer
Kenntnis. Vielleicht brave Hausm&uuml;tterchen oder lockere
Nachtv&ouml;gel. Bruno aber wurde, was er sich immer ertr&auml;umt hatte,
Priester. Er bew&auml;hrte sich und stieg mit der Zeit zum Bischof auf.
Heute ist er Kardinal. Und - wer wei&szlig; -vielleicht wird er eines Tages
sogar Papst.</P>

<P>(c) 2. Juni 2003</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

