<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Johannes Weidner -->

<TITLE>Hei&szlig; und kalt</TITLE>
</HEAD>

<BODY background="bgg.gif" text="#000000" link="#0000ff" alink=
"#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<H1 align="center">Hei&szlig; und kalt</H1>

<H3 align="center">Hanno Erdwein</H3>

<P>Wind pfiff. K&auml;lte biss. Ihr Schlenkergang kam die Stra&szlig;e
herabgest&ouml;ckelt. Windf&auml;uste zausten den Rotschopf. Und das Haar
brannte um ihren kleinen Kopf. So flammte sie mir entgegen. "Ah, Du hast
auf mich gewartet?" Ich hatte sie abgepasst, ihren t&auml;glichen Weg
erkundet, mich statt nochmal im Bett herumzudrehen zeitig auf die Socken
gemacht. Und da stand ich mit frostroten Wangen - oder war es Verlegenheit
- und zwinkerte ihr entgegen.</P>

<P>Ihre kleine kalte Hand schl&uuml;pfte zu mir. Ich w&auml;rmte sie an der
meinen in der Jackentasche. So schlenderten wir durch den dunklen,
froststarren Morgen. Sp&auml;rlich beleuchtet die Bergstra&szlig;e.<BR>
</P>

<P>Finsternis zwischen zwei gelben Funzeln. Sterne zeigten sich,
blinzelten, winkten, klirrten im frostigen Himmel. Ich sp&uuml;rte Lilly
schaudern. Schlang meinen Arm um ihre Schulter und dr&uuml;ckte sie fester
an mich. Aber so lie&szlig; sich schlecht gehen. Wir hielten an. Finster
wars und nahe der Park. Wenige Schritte und wir standen von B&uuml;schen
umgeben, suchten die W&auml;rme des andern, imdem wir uns aneinander
pressten. "Nicht! Du Schlimmer!" Ich &uuml;berh&ouml;rte die halbe
L&uuml;ge. Lillys Leib kam meinen H&auml;nden warm entgegen. Auch ihre
H&auml;nde suchten und fanden W&auml;rme. Nicht lange, da kam es
Doing-Doing-Doing. Der Kirchturm bronzte die Dreiviertelstunde.</P>

<P>"Nun m&uuml;ssen wir aber ..", erschrak sie und r&uuml;ckte die Kleidung
zurecht. Auch ich schloss meine Hose, griff rasch ihren Korb, damit sie
nicht fortlief und lie&szlig; Lilly bei mir einhaken. Das wirkte recht
bider. Wir h&auml;tten ein altgedientes Ehepaar abgegeben, wenn Lilly nicht
diesen Monroe-H&uuml;ftschwung draufgehabt h&auml;tte. Bei jedem
Wackelschritt streifte sie meinen Oberschenkel. Trotz der K&auml;lte
kribbelte es meine Lenden hinauf. Und ihr schr&auml;gender Blick verriet zu
genau, wohin das zielte. W&auml;r Zeit genug, ich h&auml;tte sie hinter das
n&auml;chste Geb&uuml;sch gezerrt und es ihr gegeben. Verdammtes Aas!</P>

<P>Reichlich K&auml;lte f&uuml;r sieben Winter! Anfang Februar kam auch
noch Schnee hinzu. Kinder nutzten die wenig befahrene Bergstra&szlig;e als
Schlitterbahn. Noch vor wenigen Jahren war ich dabei und zog meinen
Schlitten immer wieder den Hang hinauf, um den Fahrtwind beim Hinabsausen
zu sp&uuml;ren. Und auch f&uuml;r den Bau des Schneemanns, der Jahr
f&uuml;r Jahr den Eingang zum Park zierte, hatte ich manche Kugel gerollt.
Ich gr&uuml;&szlig;te den Wei&szlig;rock. "Na, Alter Knabe. So kalt und
einsam?" Er nickte unmerklich. Man hatte seinen Kopf nicht allzu fest
aufgesetzt. "Jemand sollte Dir eine Schneefrau bauen. Dann k&ouml;nntet Ihr
Euch gegenseitig w&auml;rmen." Ungl&auml;ubig glitzerten seine Kohleaugen
und die M&ouml;hrennase wurde um eine Schatierung blasser. "W&auml;rme?",
schien er zweifelnd zu fragen, "bei Dir piepsts wohl!" Nun ja, man kann es
nicht allen recht machen.</P>

<P>Lillies H&auml;nde krochen noch manchen Morgen in meine Tasche. Und
unterwegs gab es Gelegenheit genug, meine Zungenspitze ihren Mund erkunden
zu lassen. Der Schneekerl sa&szlig; breit&auml;rschig auf seinen Ballen und
sah uns zu. Mir schien, dass ihm unsere Hitze nicht gut bekam. T&auml;glich
sank er mehr in sich zusammen. Die Nase rutschte nach vorn und lag bald auf
seiner Brust. Der Hut glitt ihm &uuml;ber die Augen. Gut so. Dann sah er
auch nicht, wie dreist ich Lillies W&auml;rmezonen erforschte.</P>

<P>(c) HE - Kapitel 2 aus "Voll auf's Auge"</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

