<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Johannes Weidner -->

<TITLE>FRIEDE AUF ERDEN</TITLE>
</HEAD>

<BODY background="bga.gif" text="#000000" link="#0000ff" alink=
"#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<P align="center"><FONT color="#000080" size="7"><B>FRIEDE AUF ERDEN</B></FONT></P>

<H2 align="center">oder: Wie man auch Weihnachten feiern
kann</H2>

<H3 align="center">Hanno Erdwein</H3>

<P>Feststimmung? Wohl eher, was man daf&uuml;r h&auml;lt. Der Baum
erstrahlt im alten Glanz. Feierlichkeit verbreitet der teure
Weihnachtsschmuck. Die Erwachsenen; Vater, Mutter, Onkel und Tanten ringen
krampfhaft um Harmonie. Noch vor einer halben Stunde h&ouml;rte man ihr
Gez&auml;nk durchs Haus schallen. Nun gl&auml;ttet ein s&auml;uerlich
s&uuml;&szlig;er Ausdruck ihre Mienen, w&auml;hrend der Mund Inbrunst
heuchelnd Weihnachtslieder h&ouml;ren l&auml;sst. Kinderaugen spiegeln
Kerzenlicht wieder. Die kleinen H&auml;nde umkrampfen ein Taschentuch. Das
ist nass von Tr&auml;nen.</P>

<P>"So, und nun wollen wir mal sehen, ob das Christkind euch was gebracht
hat?", l&auml;sst sich Vater leutselig vernehmen. Mit beiden H&auml;nden
greift er unter den Baum und teilt aus. Laute satter Gutm&uuml;tigkeit von
Seiten der Gro&szlig;en begleiten die Arbeit des Auswickelns, mit denen die
Kinder eine Weile besch&auml;ftigt sind. Jede Enth&uuml;llung entlockt den
Erwachsenen ein vielstimmiges "Oh" und "Ah". Und sie beugen sich tief
&uuml;ber das Spiel der Kleinen, ein wenig Anteilnahme vorspiegelnd.</P>

<P>"Das ist aber ein feines P&uuml;ppchen! Kann es auch Mama sagen?" "Hast
du ein tolles Auto bekommen. Zeig mal. So was bekam ich nie geschenkt!" Die
Puppe wandert von Hand zu Hand, und das fernlenkbare vollelektronische
Super-Auto kurvt durch sachkundige Onkelhand gesteuert &uuml;ber den Tisch,
Teller mit s&uuml;&szlig;er Last umkreisend.</P>

<P>Derweil stapeln die Kinder unterm Tisch leere Kartons aufeinander und
schm&uuml;cken sie mit Schleifen und Geschenkpapier. In ihr unfestliches
Spiel vertieft, vergessen sie, dass Weihnachten ist und dass sie eigentlich
die neuen Spielsachen bekommen haben, mit denen sich die Gro&szlig;en
zwischen Wein und s&uuml;&szlig;en H&auml;ppchen vergn&uuml;gen. "Ein
toller Flitzer", Vater nimmt Onkel Klaus die Fernbedienung aus der Hand.
"Pass auf", ruft er und dr&uuml;ckt eine Taste. Zwei kleine Scheinwerfer
blenden grell auf. Die Damen kreischen theatralisch und Mutter rutscht die
Puppe vom Scho&szlig;, die dann zu Boden plumpst, wo sie ihr f&uuml;r alle
Zeiten letztes Mama von sich gibt und verstummt. Vaters geschickte
H&auml;nde verwandeln den kleinen Wagen in eine Art Formel-Eins-Renner. Die
Reifen hasten &uuml;bers Tischtuch und zirpen schrill in den Kurven. Auch
der h&auml;ufige Gebrauch der Mini-Hupe macht sich recht wirkungsvoll, wenn
das Fahrzeug um den Teller mit Honigkuchen herum auf das Sofa
zuschie&szlig;t, um kurz vor der Tischkante hart herumzuschwenken und sich
in die n&auml;chste Gerade zu st&uuml;rzen. "Das ist ein Schlitten!",
triumphiert er, "schade, dass er so klein ist. In voller Gr&ouml;&szlig;e
ging ich damit zum N&uuml;rburgring!" Er gie&szlig;t ein Glas Wein hinunter
und seine Wangen gl&uuml;hen ebenso rot wie die Stoplichter seines Renners.
"Pah N&uuml;rburgring", spottet Onkel Robert, "kannst ja noch nicht mal
deinen VW vern&uuml;nftig einparken. " "Was kann ich nicht?!" "Deine
Rostlaube da drau&szlig;en so hinstellen, dass andere auch Platz haben. "
"Frechheit! Hast du das geh&ouml;rt, Marga? Dieser Vollidiot will MIR
beibringen, wie man einen Wagen parkt ..."</P>

<P>Die Fernbedienung knallt auf den Tisch hart neben das Weinglas, welches
- inzwischen frisch gef&uuml;llt -prompt umst&uuml;rzt und seinen Inhalt
auf Tante Irenes Festkleid ergie&szlig;t. Unter Gekreisch springt diese auf
und st&ouml;&szlig;t ihren Stuhl nach hinten gegen den Weihnachtsbaum, der
sich unter leisem Seufzen neigt und mit hellem Geklirr auf dem Boden
landet. Peng. Das war die Sicherung. Stromkreise sind nun mal begrenzt
belastbar. Es w&auml;re jetzt stockfinster, wenn nicht eine
Stra&szlig;enlaterne gn&auml;dig die Szene beleuchten w&uuml;rde.</P>

<P>Eine Szene? Mehr ein Schattenspiel aus wild fuchtelnden H&auml;nden und
hektischer Gesch&auml;ftigkeit. Vater kramt in Schubladen und sucht nach
einer Ersatzsicherung. Onkel Klaus und Onkel Robert m&uuml;hen sich, dem
Weihnachtsbaum neue Standfestigkeit zu geben. Mutter hat eine Kerze
gefunden. Tante Irene will sie mit zitternden H&auml;nden anz&uuml;nden.
"Lass mich mal. " Tante Karola dr&auml;ngt sich dazu und nimmt ihrer
Schwester die Z&uuml;ndh&ouml;lzer weg. "Du steckst uns noch die Bude in
Brand mit deiner Ungeschicklichkeit. " "Also - da h&ouml;rt sich doch ...",
Tante Irene dreht sich um und l&auml;uft schluchzend aus dem Raum. " Das
bl&ouml;de Huhn. Zimperlich wie eine Mimose!" "Sprichst du von meiner
Frau?" Onkel Robert l&auml;sst den Christbaum los, der wieder zu Boden
kippt und geht drohend auf Tante Karola zu. "Von wem denn sonst? Bring ihr
mal Beherrschung bei, deiner piekfeinen Zimtzie..." Eine Ohrfeige
unterbricht die Tante mitten im Wort. Gleich darauf sind es ihre
N&auml;gel, die im Gesicht von Onkel Robert ihre blutige Spur hinterlassen.
Partei ergreifend mischen die Andern sich munter ein. Gebr&uuml;ll und
Handgreiflichkeiten steigern sich zum Crescendo. Gegenst&auml;nde, die
zuvor noch ein trautes Beieinander symbolisierten, werden zur Waffe, zu
Wurfgeschossen, zu Schutzschilden. Im Dunkeln tobt der Zwist mit verbalen
und k&ouml;rperlichen Verletzungen von einer Seite des Raums zur anderen
immer um den Tisch herum, unter dem die Kinder seelenruhig mit der
Verpackung spielen.</P>

<P>"Hornochse!" "Esel!" "D&auml;mlicher Hund!" "Bl&ouml;de Kuh!" Die
Kleinen spitzen die Ohren. Offensichtlich erhalten sie eine Extrastunde
Zoologie. "Frigide Henne!" "Geiler Bock!" "Verhurte Ratte!" "Impotenter
Ochse!" Die Ausschm&uuml;ckungen lassen an Farbigkeit nichts zu
w&uuml;nschen &uuml;brig. Doch einer fehlt bei alledem, Vater; denn sein
Stentor-Organ h&auml;tte alles schlankweg niedergebr&uuml;llt. W&auml;hrend
nun die Ohrfeigen klatschen und Worte wie Gegenst&auml;nde umherfliegen,
stolpert der Herr des Hauses volltrunken zum Keller hinab. Seine Rechte
umklammert einen runden Gegenstand. Eine Weile hantiert er unsicher im
Dunkeln herum. Doch dann flammt pl&ouml;tzlich das Kellerlicht auf. Droben
wird schlagartig die Szene beleuchtet und aus dem Musikschrank, der immer
wieder kr&auml;ftige St&ouml;&szlig;e verpasst bekommt, dr&ouml;hnt laut
und vernehmlich ein M&auml;dchenchor: "Frieden auf Erden!" Vater lehnt
schlaff im T&uuml;rrahmen und blinzelt ungl&auml;ubig auf das Chaos, auf
die blutig geschundene Familie und die Tr&uuml;mmer der Einrichtung. Einzig
zufrieden mit allem sind nach wie vor die Kinder unter dem Tisch. Sie
schauen strahlend umher mit Festglanz in den Augen. Dazu wiederholt der
M&auml;dchenchor aus der Musiktruhe nachdr&uuml;cklich: "Und Frieden den
Menschen auf Erden, die guten Willens sind!"</P>

<P>(c) HE Dezember 1993</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

