<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Johannes Weidner -->

<TITLE>Baskenm&uuml;tze</TITLE>
</HEAD>

<BODY background="bgb.gif" text="#000000" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<P align="center"><FONT color="#000080" size="7"><B>Baskenm&uuml;tze</B></FONT></P>

<H3 align="center">Hanno Erdwein</H3>

<P align="center">- Romanauszug -</P>

<P>Vater, ich seh ihn noch vor mir. Mittelgro&szlig;. Mehr hager als
schlank, fast schon von zierlichem Knochenbau. Trug alltags gern alte
Sachen, um die guten zu schonen. So die damalige Erziehung zur Sparsamkeit.
Daher der sch&auml;bige Mantel, die fadenscheinige Jacke und der von
Klebpflaster zusammengehaltene Hut. "So kannst du doch nicht mehr
herumlaufen." Mutter war entsetzt, als ihr eine Nachbarin das
&Auml;u&szlig;ere ihres Gatten schilderte. "Ab sofort ziehst du dich besser
an. Und wir kaufen f&uuml;r gut neue Sachen." "Aber die Sachen sind doch
noch ganz", wehrte sich Vater, dem die vermeintliche Verschwendung gegen
den Strich ging. Mutter &uuml;berging den Einwand und verbot ihm, den
h&auml;&szlig;lichen Hut noch einen Tag l&auml;nger anzuziehen. "Der sitzt
doch so bequem", jammerte mein alter Herr und dr&uuml;ckte das
scheu&szlig;liche St&uuml;ck wie eine Reliquie an sich. "Du hast dem
weichen Filzhut." "Das gute St&uuml;ck im Alltag verschlei&szlig;en",
jammerte Vater, der unter solcher Prasserei k&ouml;rperlich litt. "Unsinn,
der ist auch schon f&uuml;nf Jahre alt und du hast ihn kaum getragen."
"Eben. Viel zu schade f&uuml;r jedes Dreckwetter." Mutter seufzte
angestrengt: "Na gut. Dann kaufen wir dir f&uuml;r solche Tage eine
Baskenm&uuml;tze." Vater verzog schmerzlich den Mund. Nicht, weil er etwas
gegen Baskenm&uuml;tzen einzuwenden hatte. Ihm pa&szlig;te die in seinen
blinden Augen unn&ouml;tige Ausgabe ganz und gar nicht.</P>

<P>Mutters neuster Fimmel waren nun mal diese Franzosendeckel. Frau
Schladerer, die schon erw&auml;hnte Nachbarin, war daran schuld. Lang und
breit hatte die sich &uuml;ber das schmucke Aussehen der belgischen
Besatzungs-Soldaten ausgelassen und wie vorteilhaft denen gerade die
Baskenm&uuml;tze st&uuml;nde. Seitdem lag uns Mama mit dieser
d&auml;mlichen M&uuml;tze in den Ohren. "So eine Kopfbedeckung ist doch
schmuck und praktisch", verk&uuml;ndete sie zu jeder Gelegenheit, wo wir
f&uuml;r ihre Episteln greifbar waren. "Ist Leicht, nimmt in der Tasche
nicht viel Platz weg. Und wenn es anf&auml;ngt zu regnen, zieht man sie
elegant hervor."</P>

<P>Wir konnten und mochten das einfach nicht mehr h&ouml;ren. Vater, weil
er immer noch seinem ollen Hut nachtrauerte und ich -nun, f&uuml;r so einen
platten Deckel auf dem Kopf mit Blitzableiter- W&uuml;rmchen mu&szlig;te
man schon die entsprechende Sch&auml;delform haben. Einen Belgier, einen
Franzosen und vielleicht auch einen Schweitzer w&uuml;rde das Ding nicht
sonderlich entstellen. Aber auf vaters und meinen Sch&auml;del geh&ouml;rte
dieses gallische UFO absolut nicht hin. Ich konnte mir schon das
d&auml;mliche Gefeixe vorstellen, wenn ich mit Baskenm&uuml;tze bei meinen
Kameraden auftauchen w&uuml;rde. Und an die M&auml;dels durfte ich erst
recht nicht denken. Mutter sollte uns gef&auml;lligst damit in Ruhe lassen.
Aber genau das tat sie nicht.</P>

<P>Sie kaufte die Mistdinger und zog sie uns gewaltsam &uuml;ber den
Scheitel. Wir waren emp&ouml;rt. "Mu&szlig;te das sein", knurrte Vater. Ich
hielt dem Mund, weil man gegen Mutter ohnehin nie ankam. "Nun tragt die
M&uuml;tzen. Sie sind kleidsam." Das war ganz Mutter.</P>

<P>Meine M&uuml;tze verschwand zu unterst in meiner Aktentasche. Ich
benutzte sie als Polster f&uuml;r besonders empfindliche Sachen wie
Schallplatten. Vater trug seine ein paar Tage.</P>

<P>Einmal sah ich ihn am Arm des wiederlichen Kuglers &uuml;ber den Parkweg
daherkommen. In seiner Unwissenheit hatte Vater die M&uuml;tze so
aufgesetzt, da&szlig; das helle Schwei&szlig;band wie ein Rand um seine
Stirn lief. Das sah nat&uuml;rlich verboten aus. Kugler - damals noch
Leiter der B&uuml;rstenmacherei - war ein zynischer Hund. Statt Vater
hinsichtlich der M&uuml;tze einen Tip zu geben, geno&szlig; er sichtlich
den grotesken Anblick und zwinkerte mir auch noch zu. H&auml;tte dem
Dreckskerl mit Wonne in die Eier treten m&ouml;gen. Ich mu&szlig;te meinem
alten Herrn erkl&auml;ren, wie man den Pfeifendeckel richtig aufzusetzen
hatte. Vater stopfte das Ding erst mal gekr&auml;nkt in die Tasche.
Sp&auml;ter traf ich ihn. Und da hatte er - nicht etwa die Baskenm&uuml;tze
auf -nein, seinen x-mal geflickten Hut. Den mu&szlig;te er vor mutters
Vernichtung gerettet an einem verborgenen Ort verwahrt haben. Gern
h&auml;tte ich ihn davon &uuml;berzeugt, da&szlig; dieser Hut noch
bescheuerter auf seinem Sch&auml;del Prangte als die M&uuml;tze. Aber das
gelang mir nicht.</P>

<P>Klar hatte die geschw&auml;tzige Nachbarin die Auferstehung des Hutes
ersp&auml;ht und das Mutter hinterbracht. Das gab daheim ein mittelschweres
Erdbeben. Vater ging und knallte die Zimmert&uuml;r. Mutter ging und
knallte sie ebenfalls. Und weil aller guten Dinge drei sein sollten,
knallte ich sie auch noch einmal, als ich ging, um mir das Hirn mit ein
paar Pils freizusp&uuml;len.</P>

<P>(c) HE aus "Also lautet der Beschlu&szlig;" Juni
2003</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

