<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Johannes Weidner -->

<TITLE>Timevision</TITLE>
</HEAD>

<BODY background="bgd.gif" text="#000000" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<H1 align="center">TIMEVISION (oder: Die Zeit-Hacker)</H1>

<H3 align="center">Hanno Erdwein</H3>

<P>Mit leisem Zischen schlie&szlig;t sich die Schleuse. Thorwald dehnt und
reckt sich, um den Luftstrom von allen Seiten wirken zu lassen.
Gleichzeitig mit dem Gong erscheint auf dem Display die Meldung:
DEKONTAMINIERT. Er seufzt. F&uuml;r ihn ist diese Prozedur jedesmal nach
dem Spielen im Freien totlangweilig. Auch der hermetisch schlie&szlig;ende
Schutzanzug, in dem er immer noch steckt, gibt nicht die Bewegungsfreiheit,
die sich ein vierzehnj&auml;hriger Junge beim Herumtoben w&uuml;nscht. Er
wei&szlig; zwar, dass es notwendig ist.</P>

<P>Giftstoffe und Strahlung tr&auml;gt der st&auml;ndige Mistral von einer
Seite des Kontinents zur anderen. Auch der Sonnenschein, den er so liebt,
ist nicht ganz ungef&auml;hrlich f&uuml;r die Haut. Aber l&auml;stig, elend
l&auml;stig ist so eine Verpackung! Heftig zippt er den Anzug auf und
steigt heraus. Dann nimmt er den Helm und die Gesichtsmaske ab. "Puh, das
tut gut!", st&ouml;hnt er und rubbelt sich mit einem Handtuch die Wangen,
bis sie rot gl&uuml;hen. "Jetzt was essen!", befiehlt er sich und
erh&auml;lt aus dem Magen knurrenden Beifall. Gleich hinter der
Innenschleuse blitzt ein weiteres Display auf: HI THORWALD, SIND BIS HEUTE
ABEND UNTERWEGS. GENUG ZU ESSEN BEIM SERVER. MACH KEINE DUMMHEITEN! DEINE
ELTERN.</P>

<P>"Pah, Dummheiten!", brummt er und dreht dem Display den R&uuml;cken zu,
das darauf gleich dunkel wird. "Die denken immer noch, ich w&auml;r ein
Baby." Mit leichtem Schwung nimmt er rittlings auf einem Stuhl Platz und
schnalzt mit der Zunge. Auf der gegen&uuml;berliegenden Wand erscheint ein
helles Quadrat. "He, Server, r&uuml;ck deinen Speiseplan raus!", fordert
Thorwald. Schon huscht eine mehrspaltige Liste &uuml;ber die
Bildfl&auml;che. "Hmmm", &uuml;berlegt der Junge, "Fisch and Chips, n&ouml;,
hatten wir gestern, Seelachs auf Thymian, brrr!, ges&uuml;lzter Dorsch,
&auml;&auml;hh, ekelhaft! H&ouml;r mal, du Kochk&uuml;nstler, hast du keine
Big Toms?", fragt er &auml;rgerlich. Die gl&auml;nzenden Stahlarme des
Roboters machen eine hilflose Bewegung und seine sanfte Stimme
erkl&auml;rt: "Big Toms sind dem jungen Herrn verboten." "Quatsch,
verboten", braust Thorwald auf, "alles was gut schmeckt ist verboten.
Ausgerechnet Big Toms, die ich so mag! Schei&szlig; Kochk&uuml;nstler!
Schei&szlig; Essen. Jetzt will ich gar nichts! Halt deinen ges&uuml;lzten
Thymian-Fra&szlig; f&uuml;r dich und erstick dran!" "Wie der junge Herr es
w&uuml;nscht." Der Roboter schweigt und das helle Quadrat verschwindet.
Eine Weile bleibt Thorwald sitzen und klopft mit zwei Fingern einen
Rhythmus auf die Stuhllehne w&auml;hrend er &uuml;berlegt, was er beginnen
k&ouml;nnte. Da sind zwar noch Schularbeiten von einer ganzen Woche in der
Mailbox. Aber wer wird arbeiten wollen, wenn die Wohnung endlich einmal
"Sturmfrei" ist?! "Ja, sturmfrei! Das ist es!", jauchzt er und springt von
dem Stuhl hoch. Er rennt durch zwei T&uuml;ren, die sich
automatisch &ouml;ffnen und schlie&szlig;en, in das "Allerheiligste" seines
Vaters. Die Einrichtung ist ihm zwar vertraut, doch es ist ihm strengstens
untersagt, hier allein einzudringen, geschweige denn, die komplizierte
Apparatur zu bedienen. "Pah, kompliziert!", knurrt er ver&auml;chtlich.
Schlie&szlig;lich steht ein &auml;hnliches, wenn auch ungleich
schw&auml;cheres System in seinem Zimmer. Auf einen Wink wird die Decke
taghell. Rot leuchtet auf der gegen&uuml;berliegenden Wand die Frage:
PASSWORT? Thorwald grinst. "Lotos", sagt er jubelnd. Vater h&auml;tte ihn
sicher f&uuml;r diese Frechheit georfeigt. Aber erstens wei&szlig; er
nicht, dass sein Spr&ouml;ssling das Passwort erlauscht hat
und zweitens ist der mit Mutter auf der Mondbasis beim Cyberty-Fest. "Na,
dann mal viel Spa&szlig; auf Luna!", kichert er und l&auml;sst durch
Handzeichen einige Men&uuml;s &uuml;ber die Wand flimmern. Rasch findet er,
wonach er gesucht hat.</P>

<P><U>INTERSTELLARE NETZE</U><BR>
(1) WEGA<BR>
(2)SIRIUS<BR>
(3) CAPELLA<BR>
(4) ATAIR ...</P>

<P>"Sirius, Knoten 5, Nummer 79831", verlangt der Junge. Die Wand wird
f&uuml;r eine knappe Minute dunkel. Thorwald schlie&szlig;t die Augen und
stellt sich vor, wie der Ruf mit &Uuml;berlichtgeschwindigkeit Richtung
Sirius-System abgeschickt wird. "Ist schon enorm, diese Technik", murmelt
er bewundernd. Und schon senkt sich ein Lichtvorhang von der Decke herab
und wird gleich zu einem dreidimensionalen Bild. "Hi Thorwald!" Ein
sommersprossiges M&auml;dchen grinst ihm entgegen. "Hi Elfi!", antwortet er
nicht mehr ganz so kess und selbstsicher, wie er die Sache begonnen
hat. "Na, du Schlingel. Spielst wohl mit Papas HYPERCOM, was? Wenn dein
Alter das spitz kriegt, gibts Dresche!" Die Augen des M&auml;dchens
glitzern vor Spottlust. "Ach was", schwindelt Thorwald, "mein Dad hat mir
das erlaubt. Ich darf alle Funktionen bedienen!" "Ach nee, alle Funktionen?
Wirklich?! Das glaubt dir kein Mondkalb!<BR> Was ist denn mit TIMEVISION?
Du wirst mir doch nicht erz&auml;hlen wollen, dass du da auch rein
darfst?!" "Klar, darf ich, mit allen Sonderrechten!" Die Augen des
M&auml;dchens werden dunkel. B&ouml;se erwidert sie: "Verdammter
L&uuml;gner! Such dir andere, denen du das erz&auml;hlen kannst!" Langsam
hebt sich der Lichtvorhang und verschwindet Richtung Decke. "Weiber!",
emp&ouml;rt sich der Junge.</P>

<P>Lange braucht er nicht &uuml;ber das Erlebte nachzudenken; denn die
Stimme des Servers meldet: "Nachrichten f&uuml;r sie, junger Herr. Soll ich
sie in den aktuellen Raum schalten?" "Her damit!" Thorwald l&uuml;mmelt
sich in Vaters bequemsten Sessel und schnippst die Videowand an. HI THOR,
KOMMEN ZU DIR RUEBER, DENKEN, BRAUCHST GESELLSCHAFT. JOERG, KARSTEN UND
BENNIE.</P>

<P>Die Besucher lassen nicht lange auf sich warten. Gleich darauf summt es
vernehmlich und die drei springen aus der Schleuse. "Na, du H&uuml;ter des
heimischen Herdes!", spottet Carsten. "Was treibt man denn so?" "Ooch,
nichts besondres", prahlt Thorwald, "hab nur mal gerade mit Elfi auf Sirius
gechattet." "He, Sirius? Spinnst du?", fragt Bennie ungl&auml;ubig,
"daf&uuml;r brauchst Du doch Sonderrecht!" "Hab ich", wirft sich Thorwald
in die Brust und grinst unversch&auml;mt, "kenn doch das Passwort von
meinem alten Herrn." "Oh, das wei&szlig;t Du?! Ist ja toll! Mann, dann
k&ouml;nnen wir ..." "Dann k&ouml;nnen wir ja ..." "Klar, das k&ouml;nnen
wir!" Die vier sehen sich verschw&ouml;rerisch an und ihre Mundwinkel
wandern vergn&uuml;gt bis hinauf zu den Ohrl&auml;ppchen. Schon hocken sie
nebeneinander auf der Aktionsbank und taxieren die Tasten, Kn&ouml;pfe und
L&auml;mpchen der Apparatur. "K&auml;m ich nie mit zurecht", gibt Bennie
zu. "Sieht schlimmer aus, als es ist", tr&ouml;stet ihn Carsten. "Im
neunten Schuljahr sitzt jeder zweimal in der Woche vor so'nem Schaltkasten.
Kenn mich so ziemlich aus." "Ich auch", brumt J&ouml;rg und Thorwald beeilt
sich, hinzuzuf&uuml;gen: "Klar, hab auch schon damit hantiert." Den
zweifelnden Seitenblick des um gut ein Jahr &auml;lteren Carsten ignoriert
er geflissentlich. Statt dessen fragt er forsch: "Und nun Leute?" "Wie
w&auml;r's mit Cyberspace?", schl&auml;gt Bennie vor. "Cyberspace",
g&auml;hnt J&ouml;rg. "Ist die Zeit zu schade f&uuml;r", meint auch Carsten
und Thorwald nickt zustimmend. "Aber was haltet ihr von TV?", grinst der
&Auml;lteste."Au ja, Timevision!", kommt es freudig von allen Seiten. "Na,
dann wollen wir mal ...", r&auml;uspert sich Carsten unternehmerisch und
legt zwei Schalter um. Die Wand hinter der Apparatur wird in voller Breite
hell. Rote Feuerr&auml;der jagen dar&uuml;ber hin und ein durchdringender
Sirenenton rast die Tonskala rauf und runter."Die Zulassung! Rasch!",
&uuml;berschreit Carsten den L&auml;rm und sieht Thorwald beschw&ouml;rend
an. Der zuckt hilflos mit den Achseln. "Was, du wei&szlig;t die Zulassung
nicht?!" Die Augen des gro&szlig;en Jungen funkeln agressiv. "Hmmm,
&auml;&auml;h, Lotos, denk ich ..." "Idiot", br&uuml;llt ihn der andere an,
"das ist doch das Passwort! Die Zu-las-sung f&uuml;r TV brauch ich.
Und ein wenig fix, wenn ich bitten darf, sonst blockiert sich das System
selbstt&auml;tig und Deine Alten bekommen &Auml;rger!" "Schei&szlig;e",
murmelt Thorwald in sich hinein."Was sagst du", fragt Carsten, "ich versteh
nicht." Pl&ouml;tzlich springt Thorwald auf und kreischt: "Ich glaub, ich
habs. Es war irgendwas mit einem Nebel und einem Frauennamen. Irgend so
eine Galaxie, die in einem Sternbild steckt. "Andromeda", feixt
J&ouml;rg,"ziemlich h&auml;ufig verwendetes Schl&uuml;sselwort. Dein Oller
soll sich mal was originelleres ausdenken." "Stimmt, best&auml;tigt
Carsten,"aber f&uuml;r uns ist es ein Gl&uuml;ck, dass er nicht zuviel
Phantasie darauf verschwendet hat." Seine Finger huschen &uuml;ber die
Tastatur und geben den Schl&uuml;ssel ein. Prompt verstummt der Krach und
der Bildschirm beruhigt sich ebenfalls. "Na, siehste wohl!" Die H&auml;nde
des Jungen springen &uuml;ber die Tastatur und entlocken der Wand Men&uuml;
auf Men&uuml;. "Wo wollen wir denn mal hin. Vorschl&auml;ge Leute!" Die
drei &uuml;brigen sehen sich hilflos an. Jetzt, wo das Tor zur Zeit offen
steht, hat niemand einen gescheiten Einfall. "Also lange bleibt der Kanal
nicht auf", warnt Carsten, "nach drei Minuten fliegen wir wieder raus. Und
ob ich ihn dann noch mal auf bekomme, wei&szlig; ich nicht. Na, los, ihr
steckt doch sonst voll verr&uuml;ckter Einf&auml;lle!" "Fahr doch mal
dreitausend Jahre zur&uuml;ck", kichert J&ouml;rg. "Ich w&uuml;rde gern mal
dem ollen Zuse &uuml;ber die Schulter sehen." "Tststs", macht Bennie,
"oller Zuse, wie respektlos sprichst du vom Gr&uuml;nder der Cyberty?" "Ja
und vonwegen dreitausend Jahre, da musst du noch gut f&uuml;nfhundert
dazu tun. Schlie&szlig;lich leben wir im Jahr 5521, oller Mathemuffel!",
r&auml;soniert Thorwald. "Gut, das ist ein Ziel. Fahren wir in das Jahr
2000." Carsten gibt die Daten ein und lehnt sich zur&uuml;ck. Die Wand
&ouml;ffnet sich. Landschaft entsteht dreidimensional aus einer
Perespektive, wie sie Astronauten in einem Raumschiff geboten wird. Die
Hand des Jungen greift nach einem kleinen Stab, den er spielerisch hin und
her bewegt. Dadurch ver&auml;ndert sich der jeweilige Blickwinkel, als
wende sich die Position des Betrachters nach dieser oder jener Seite. "Wo
sind wir?", fragt Bennie. "Ist das Zusien?", wundert sich Thorwald
zweifelnd. J&ouml;rg erkl&auml;rt: "Also damals hie&szlig; das noch
Eurasien und sah v&ouml;llig anders aus als heute." "Da gabs hier noch
Urw&auml;lder, glaub ich", wei&szlig; Thorwald gro&szlig;spurig.
"Urw&auml;lder in Zusien ... pardone, Eurasien? Wohl kaum", zweifelt
J&ouml;rg. "Stimmt", best&auml;tigt Carsten.</P>

<P>"Das Leben spielte sich zwar im Gegensatz zu unserer Zeit oberirdisch
ab. Aber die Gr&uuml;nfl&auml;chen waren damals schon stark reduziert.
Passt auf, ich fahr mal n&auml;her ran!" Der Stab in Carstens Hand
beschreibt mehrere kleine Kreise. Daraufhin r&uuml;ckt der Doppelkontinent
auf die Betrachter zu und in atemberaubender Geschwindigkeit st&uuml;rzen
sie dem Grund entgegen. Bennie und Thorwald schlie&szlig;en erschrocken die
Augen. J&ouml;rg zwinkert ein paarmal heftig, um der &Uuml;belkeit Herr zu
werden. Nur Carsten steuert souver&auml;n mit dem Stab die Richtung. Ein
Spinnennetz d&uuml;nner F&auml;den kommt in Sicht. "Das sind
Stra&szlig;en", erkl&auml;rt der gro&szlig;e Junge. "Die gibt es heutzutage
im Zeitalter der Transmitter nicht mehr. Damals verbanden sie
s&auml;mtliche Wohneinheiten untereinander." Bennie und Thorwald
bek&auml;mpfen die Panik und &ouml;ffnen ihre Augen.
Unregelm&auml;&szlig;ige Flecken sind an manchen Kreuzungspunkten der
Stra&szlig;en-F&auml;den zu erkennen. Carsten richtet seinen Aktivator auf
einen recht gro&szlig;en Klecks und dr&uuml;ckt den Knopf. "Berlin,
Hauptstadt Deutschlands, Sitz der Administration seit ...", leiert eine
elektronische Stimme herunter. "Da wollen wir aber nicht hin", murmelt der
Junge und sucht mit der Spitze des Stabes in westlicher Richtung herum.
Nach "Hannover","M&uuml;nster" und "Dortmund" h&ouml;ren die vier
pl&ouml;tzlich "Borken, Zentrale Generalverwaltung der CybertY,
gegr&uuml;ndet 2030 von Arnold Zuse ..." "Na endlich", st&ouml;hnt
J&ouml;rg. "Nichts wie hin." Unter der Spitze des Stabs w&auml;chst der
Fleck rasch heran und f&uuml;llt die gesamte Bildfl&auml;che. Einzelheiten
sind schon erkennbar. "Was sind das f&uuml;r merkw&uuml;rdige
K&auml;sten?", fragt Thorwald. "Man nannte das damals H&auml;user",
erl&auml;utert J&ouml;rg. "Menschen wohnten darin. Die durchsichtigen
Fl&auml;chen dienten dazu, Licht rein- und den Blick rauszulassen." "Also
gab es schon Television?", wundert sich Bennie. "Nicht so perfekt wie bei
uns", gibt Carsten zu bedenken."Die durchsichtigen Scheiben, man nannte sie
Fenster, zeigten ohne jede Elektronik die Umgebung." "Och, wie primitiv",
meint Thorwald ver&auml;chtlich und erh&auml;lt einen strafenden Blick von
Carsten. "Ich w&auml;re vorsichtig mit solchen &Auml;u&szlig;erungen", sagt
der gro&szlig;e Junge streng. "Jedenfalls lebte ein Gro&szlig;teil der
Menschheit zu jener Zeit noch in einer halbwegs intakten Umwelt, was
heutzutage nicht mehr der Fall ist. Seht mal das viele Gr&uuml;n ringsum!"
Inzwischen ist der Blickwinkel der Betrachter auf Stra&szlig;enniveau
angelangt. B&auml;ume und Rasenfl&auml;chen sind f&uuml;r die vier ein
ungewohnter Anblick. Zu dem dreidimensionalen Bild ist nun auf der
Realbasis auch der Ton und das Geruchsspektrum hinzugekommen. Durch kleine
Druckluftventilatoren wird jede athmosph&auml;rische Ver&auml;nderung
authentisch vermittelt. "Igit! Was riecht hier so?", beschwert sich
Thorwald. "Wei&szlig; nicht", brummt Carsten, der den scharfen Geruch nach
Landwirtschaft ebensowenig kennt wie die anderen drei. "Das ist immer so",
erl&auml;utert J&ouml;rg,"eine andere Zeit riecht auch anders. Nach ein
paar Minuten hat man sich an den Geruch gew&ouml;hnt." Inzwischen hat
Carsten den Aktivator auf ein besonders auff&auml;lliges Geb&auml;ude
gerichtet."Cyberty Generalniederlassung" qu&auml;kt es aus dem
Lautsprecher."Genau da wollen wir hin", grinst Thorwald. Eine Bewegung des
Stabs und die Hauswand verschwindet vor ihren Blicken. Carsten geht voran,
geht mitten hinein in das 3-D-Bild, das hei&szlig;t, das Bild baut sich um
die vier Jungs herum auf. Sie stehen in einem Raum mit Schreibtischen und
Regalen. Zwei der Schreibtische sind besetzt. "Ich werd verr&uuml;ckt",
ruft Thorwald, "das sind ja Arnold Zuse und Boid Middelsmith!" "Was hattest
du denn gedacht", knurrt J&ouml;rg, "C&auml;sar und Napoleon?!" "Na, dann
schau ihm mal &uuml;ber die Schulter, das wolltest du doch!", fordert
Carsten J&ouml;rg auf.</P>

<P>Scheu, als k&ouml;nnten seine Schritte geh&ouml;rt werden, n&auml;hert
sich der Junge dem Tisch des System-Gr&uuml;nders. "Nur Mut!", lacht
Carsten,"man kann dich weder sehen noch h&ouml;ren!" &Uuml;ber den
Bildschirm jagen Zeichen dahin, die f&uuml;r die vier unverst&auml;ndlich
bleiben."Verstehst du das?", fragt J&ouml;rg und dreht sich nach Carsten
um."Hmmmm, nur schwer. Sind ganz andere Symbole, als die, die wir heute
verwenden. Wenn ich das richtig verstehe, geht es um ein Ereignis, das man
mit CEBIT bezeichnet. Die CybertY soll dort durch eine Abordnung
repr&auml;sentiert werden." "Mann, ist das langweilig hier!", mault der
J&uuml;ngste. "Gibt's nichts spannenderes, das wir tun k&ouml;nnen?" "Also,
ich find das schon interessant genug", erwidert Carsten und blickt umher.
"Aber wenn ihr wollt, machen wir was anderes." Erwartungsvoll schaut er in
die Gesichter seiner drei Gef&auml;hrten. "Na, wo bleiben die
Vorschl&auml;ge?" "K&ouml;nnen wir nichts ver&auml;ndern?", fragt Thorwald
und grinst von einem Ohr zum andern. Carsten runzelt die Stirn.<BR>
"K&ouml;nnen schon", meint er nachdenklich, "beim Status deines Vaters sind
Manipulationen erlaubt." "Ist ja galaktisch!", freut sich Bennie. "Ich
wei&szlig; nicht", z&ouml;gert Carsten, "die Sache ist h&ouml;chst
gef&auml;hrlich." "Ach was, gef&auml;hrlich!", wirft Thorwald
ver&auml;chtlich hin. Wir brauchen ja nicht gleich die Zeitgeschichte
umzukrempeln. Ein kleiner Eingriff, nur um zu gucken, was daraus wird, ja?"
Carsten sieht J&ouml;rg an, seine Meinung einzuholen. "Na ja", meint der,
"eine unbedeutende Kleinigkeit k&ouml;nnten wir schon anstellen." "Ok",
seufzt Carsten, "Von mir aus. Und was soll das sein?" Gespannt sieht er zu,
wie die drei Freunde sich ansehen. Pl&ouml;tzlich lacht Bennie laut auf.
"Ich hab's!" Er prustet los und kann sich eine Weile nicht beruhigen. "Ja,
nun sag schon", dr&auml;ngeln die andern. "Sport", keucht der Kleinste.
"Ihr wisst doch, Sport ist das Ekelhafteste, was es gibt." "Na und?",
will J&ouml;rg wissen, "willst du alle Sportger&auml;te vernichten? Dann
hast du was zu tun." "Bl&ouml;dsinn", &auml;rgert sich Bennie, "ich
lass den Typen verschwinden, der den Sport so wichtig gemacht hat."
Thorwald pfeift zwischen den Z&auml;hnen. "Ich wei&szlig;, wen du meinst."
"Klar", meldet sich auch J&ouml;rg, "wir sollen also den Turnvater Jahn
ausl&ouml;schen? Das willst du?" "Genau", strahlt Bennie. "Diese
langweiligen Frei&uuml;bungen, ekelhaft! Und nur, weil dieser Jahn einen
Sportfimmel hatte!" "Aber das ist nicht so einfach, wie du dir das
vorstellst", d&auml;mpft Carsten die Freude des Kleinen.</P>

<P>"Einen Mord d&uuml;rfen wir nicht begehen. Das verst&ouml;&szlig;t gegen
alle Konventionen und Thorwalds Vater w&uuml;rde nach Pluto deportiert, um
in den Uranminen zu sterben." "Quatsch, wer redet von umbringen? Ich will
ihn erst gar nicht existieren lassen. Seine Existenz einfach l&ouml;schen,
bevor er ..." "Hi, stimmt", lacht J&ouml;rg, "so gehts. Wir l&ouml;schen
einfach den Eintrag im Stammregister." Nach anf&auml;nglichen Bedenken
willigt Carsten ein.</P>

<P>Mit Hilfe des Cyberty-Lexikons erfahren sie, wann und wo Turnvater Jahn
geboren wurde und machen sich r&auml;umlich und zeitlich auf den Weg. Sie
dringen weitere 252 Jahre in die Vergangenheit vor und landen in einem Ort
namens Lanz."Eigenartige Bauten", kommentiert J&ouml;rg die Umgebung. Der
elektronische Wegweiser leitet sie zu einem unscheinbaren Haus, das sich
B&uuml;rgermeisteramt nennt. Eine Weile irren sie in den Wohnr&auml;umen
umher, bis sie das richtige Zimmer gefunden haben. "Wo sind denn hier die
Computer?!", wundert sich Thorwald. Carsten grinst. Gibt es zu dieser Zeit
noch nicht, nicht mal elektrischen Strom.." "Und jetzt?", fragt Bennie
entt&auml;uscht, "wird jetzt nichts aus meinem Plan?" "Mal sehen." Carstens
Stab l&auml;sst einen dickleibigen Folianten nach dem anderen
aufspringen. M&uuml;hsam entziffert er die handschriflichen Eintr&auml;ge:.
"Jacker, Jacobson, Jahn ... na, wer sagts denn." Mit einem Sto&szlig; des
Aktivators fixiert er die Seite des Folianten. "Jahn, Friedrich Ludwig,
geboren 11. Augusst 1778", liest er vor. "Das muss heute vormittag
hier eingetragen worden sein. Gut, l&ouml;schen wirs aus." Der Aktivator
schnurrt &uuml;ber die Zeilen und l&auml;sst die Schrift verschwinden.
"Meinst du wirklich", zweifelt J&ouml;rg, "wenn wir die Schrift
l&ouml;schen, dass auch die Person verschwindet?" Carstens Blick
verweilt einen Moment auf J&ouml;rgs Gesicht. "Theoretisch magst du recht
haben", gibt er zu, "aber praktisch ist jeder tot, dessen Personalien nicht
ordnungsgem&auml;&szlig; registriert sind." Damit tippt er das Buch an, das
wie von Geisterhand geschlossen wird.</P>

<P>"Zufrieden", fragt Carsten und dreht sich nach Bennie um. Aber hinter
ihm steht kein Bennie. "He Bennie! Wo hat der Kleine sich versteckt?" Die
drei schauen hinter jeden Schreibtisch. Bennie bleibt verschwunden.
"Herrjeh!", ruft pl&ouml;tzlich J&ouml;rg, "das darf doch nicht wahr sein!"
Carsten und Thorwald starren J&ouml;rg an. Ganz langsam fragt Carsten: "Du
willst doch wohl nicht behaupten wollen, dass Bennie ..." "Genau das",
best&auml;tigt J&ouml;rg, "er ist ein direkter nachfahre. Der
Bl&ouml;dmann! Das h&auml;tte er doch wissen m&uuml;ssen!" "Aber er
hei&szlig;t doch John und nicht Jahn", wundert sich Thorwald.
"Lautverschiebung", brummt Carsten, "gibt es h&auml;ufiger nach etlichen
Generationswechseln. Aber auch das h&auml;tte ihm klar sein m&uuml;ssen."
Thorwald beginnt br&uuml;llend zu lachen. "Der hat sich selbst
ausgel&ouml;scht! Der hat sich aus der Geschichte getilgt! Das ist der
beste Witz des Jahrhunderts!" "Den erz&auml;hl mal deinem Vater",
schl&auml;gt Carsten ern&uuml;chternd vor.</P>

<P>Die drei trotten bedr&uuml;ckt aus dem B&uuml;rgermeisterhaus und kehren
in ihre eigene Zeitebene zur&uuml;ck. "Und jetzt?", fragt J&ouml;rg, "was
k&ouml;nnen wir tun?" "Nichts", erwidert der gro&szlig;e Junge resigniert,
w&auml;hrend seine H&auml;nde mit Kn&ouml;pfen und Schaltern
besch&auml;ftigt sind, das Timivisi auszuschalten. Anschlie&szlig;end
schleichen sie r&uuml;ber ins Wohnzimmer und setzen sich, als w&auml;re
nichts geschehen, an den Tisch. "Ich k&ouml;nnt was trinken", r&auml;uspert
sich Thorwald nach einer Weile. "He, Server, drei Mango-Colas!" "Gute
Idee", lobt J&ouml;rg,"k&ouml;nnte aber auch 'nen Happen vertragen. Wie
w&auml;r's mit Big Toms?" Thorwald grinst s&auml;uerlich: "Sind gestrichen.
Meine Alten meinen, die w&auml;ren nicht gut f&uuml;r mich. Ich kann dir
ges&uuml;lzten Dorsch oder Seelachs auf Thymian empfehlen." "Die zieh dir
mal selber rein." J&ouml;rg verzerrt angeekelt den Mund. Die Arme des
Servers schwenken&uuml;ber den Tisch und stellen Gl&auml;ser ab. Die beiden
J&uuml;ngeren st&uuml;rzen das Getr&auml;nk in gro&szlig;en Schlucken
hinunter. Carsten r&uuml;hrt sein Glas nicht an. Mit h&auml;ngenden
Schultern hockt er da und starrt d&uuml;ster vor sich hin. Offensichtlich
macht er sich Vorw&uuml;rfe."Mann, Carsten! Take it easy!" Thorwald
schl&auml;gt dem &Auml;lteren kamaradschaftlich auf die Schulter. Der aber
blickt ihn nur finster an um dann wieder starren Auges vor sich
hinzugr&uuml;beln. Die beiden andern zucken gelangweilt die Achseln. Ihnen
ist unverst&auml;ndlich, dass sich ihr Freund die Sache so zu Herzen
nimmt. Die Geschichte ist nun mal passiert. Gut. Die Erwachsenen werden es
schon glattb&uuml;geln. Und so verdr&auml;ngen sie erfolgreich das Problem
und st&uuml;rzen sich in ein Spiel Black Jo gegen den Server, bis die
Signalleuchte aufblinkt und anzeigt, dass jemand die Schleuse
betritt."He, da kommen Deine Alten nach Hause", meint J&ouml;rg mit
belegter Stimme. Auch Thorwalds Gleichmut ger&auml;t ins Wanken. Beide sind
ein wenig blasser geworden. Carsten setzt sich gerade hin und sieht den
Dingen mit grimmiger Entschlossenheit entgegen. Die T&uuml;re schwingt auf
und Thorwalds Mutter kommt kreidebleich heraus gefolgt von ihrem Mann, der
besorgt ihren Arm st&uuml;tzt und kurz zu den Kindern
hin&uuml;bergr&uuml;&szlig;t. "Oh, diese Transmitter!", seufzt sie und
h&auml;lt sich den Kopf. "Mich bringen keine zehn Server mehr nach Luna!"
"Leg dich ein St&uuml;ndchen hin", r&auml;t Thorwalds Vater, "dann gehts
dir gleich besser. Im &uuml;brigen war es doch ein gelungenes Fest auf dem
Mond. Was mag das die CybertY wieder mal gekostet haben?!" "Jaja, es war
nicht &uuml;bel", gibt sie zu und steuert in Richtung Schlafzimmer, "wenn
nur nicht diese Transmitterspr&uuml;nge w&auml;ren! Einen lass ich mir
ja noch gefallen - aber gleich f&uuml;nf!" St&ouml;hnend h&auml;lt sie sich
am T&uuml;rrahmen fest. "Du bist nun mal empfindlich ..." "...empfindsam,
bitte!", wirft sie augenblitzend ein. "Gut, empfindsam, wenn du das lieber
h&ouml;rst. Nimm ein oder zwei Deterdin und ruh ein St&uuml;ndchen, ja
Liebes?" "Mach ich", haucht sie und verschwindet im Schlafzimmer."Na, ihr
Marsfl&ouml;he", wendet sich der Heimgekehrte an die Kinder,"habt ihr euch
gut unterhalten?" "Klar Paps!", strahlt Thorwald in gespielter Unschuld.
"Herr Sonderhoff", meldet sich Carsten, bevor ein anderer es verhindern
kann. "Ich muss ihnen eine gro&szlig;e Dummheit gestehen..." Thorwalds
Fu&szlig;spitze knallt unterm Tisch gegen Carstens Bein und J&ouml;rg
sch&uuml;ttelt verst&auml;ndnislos den Kopf."Wir haben ihr Timevisi
benutzt." "Was habt ihr?" Vor Verbl&uuml;ffung vergisst der Erwachsene
den Mund zu schlie&szlig;en. "Ja, aber ... aber ... das Passwort, der
Schl&uuml;ssel?" "Haben wir herausbekommen. Sie hatten es uns leicht
gemacht, weil Andromeda h&auml;ufig verwendet wird. Wir sind dann ..."
"Hoffentlich habt ihr nichts angestellt!", unterbricht Thorwalds Vater den
Jungen. "Ihr wisst ja, wie gef&auml;hrlich Manipulationen sind!"</P>

<P>Nerv&ouml;s st&uuml;rzt er in seinen Arbeitsraum. Die drei folgen ihm
mit Herzklopfen. "Wir haben aber leider etwas ver&auml;ndert, Herr
Sonderhoff", gibt Carsten tapfer zu. "Und durch die Manipulation ist Bennie
pl&ouml;tzlich verschwunden." "Ach ja, Bennie! Wunderte mich schon,
&uuml;ber den vierten Schutzanzug in der Schleuse. Ja um Zuses Willen! Was
habt ihr denn blo&szlig; gemacht?" In knappen S&auml;tzen berichtet Carsten
ihren Streifzug durch die Vergangenheit und l&auml;sst auch das
Amtszimmer in Lanz nicht aus. "Bei Zuse!", flucht Herr Sonderhoff, der
sonst den Namen des Gr&uuml;nders der Cyberty nur mit h&ouml;chstem Respekt
in den Mund nimmt, "da habt ihr mich ganz sch&ouml;n in Schwierigkeiten
gebracht. Jetzt hei&szlig;t es Beeilung, bevor das Ver&auml;nderte konstant
wird und sich niemand mehr an Bennie erinnern kann!" Nach einem kurzen
Blick auf den Realtimer jagen seine H&auml;nde &uuml;ber Kn&ouml;pfe und
Schalter. Wieder hetzen die Bilder wie ein Spiralrad vorbei. "Welches Datum
war das?", erkundigt sich der Erwachsene und fixiert den Aktionsstab
f&uuml;r die Programmierung. "11. 8. 1778", meldet sich der gro&szlig;e
Junge mit belegter Stimme. In schwindelerregendem Tempo st&uuml;rzt das
Bild der Erde auf die Betrachter zu. Die Hand des Profis holt aus dem
Aktionsstab ganz andere M&ouml;glichkeiten heraus. Mit einem
unauff&auml;lligen Drehen des Handgelenks stehen sie bereits wieder in
jener staubigen Stube und Carsten deutet schuldbewusst auf den braunen
Folianten, in dem er den Eintrag gel&ouml;scht hat. Thorwalds Vater wirft
einen kurzen Blick auf den Echtzeitchronometer an seinem Handgelenk.
"Vierzig Sekunden noch", murmelt er und macht sich ans Werk. Mit hilfe des
Stabs &ouml;ffnet sich das Buch bei der richtigen Seite. Unter dem
Energiestrahl kommt langsam Buchstabe um Buchstabe wieder zum Vorschein. Es
dauert qu&auml;lend lang. Aus dem Augenwinkel sieht der Erwachsene die
Sekunden dahinrasen. Die drei Kinder halten den Atem an. ... 57 ... 58
..."Geschafft!", freut sich Horst Sonderhoff und l&auml;sst die Deckel
des Buchs wieder zuklappen. "He, habt ihrs?", kr&auml;ht die helle Stimme
Bennies in die Stille. "Ist der olle Jahn getilgt?" "Und du, sein
soundsovielter Urenkel, gleich mit ihm", grinst J&ouml;rg. "Jaja, die
lieben Familienbande", kommt Carstens Sto&szlig;seufzer. Jetzt erst sieht
der Kleine den Erwachsenen, der sich mit dem Handr&uuml;cken den
Schwei&szlig; von der Stirn wischt. "Aber wie kommt ...?", will Bennie
verwundert fragen, da nimmt Thorwalds Vater die Hand des Jungen und zu
f&uuml;nft kehren sie durch Zeit und Raum in die Gegenwart zur&uuml;ck.
"Wer mag Big Toms?", fragt er l&auml;chelnd. Die Augen der vier blicken ihn
verwundert an. Jeder von ihnen rechnete im Stillen mit einer z&uuml;nftigen
Standpauke. "Eeehm", meldet sich Thorwald, "die sind doch gestrichen!"
"Normalerweise ja", best&auml;tigt sein Vater immer noch l&auml;chelnd,
"aber heute ist eine Ausnahme. Wir m&uuml;ssen doch Bennies Wiedergeburt
feiern."</P>

<P>* Ende *</P>

<P>(c) HE</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

