<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">
<HTML>
<HEAD>
<META NAME="AUTHOR" CONTENT="Thomas Nawroth">
<META NAME="DESCRIPTION" CONTENT="Ein Computer-Magazin von 1984">
<TITLE>Happy Computer</TITLE>
</HEAD>
<BODY bgcolor="#fffff4" background="mm_hc10b.gif">
<TABLE border="0" cellpadding="8">
<TR>
<TD>
<CENTER><IMG SRC="mm_hc10a.gif">
<BR><I>Folge 10</I></CENTER><BR>
<BR>
<P>Konkurrenz f&uuml;r die Speichererweiterungs-Module: Zwei 64
KByte-Karten werben um die Gunst der VC20-Besitzer. Was sie k&ouml;nnen und
f&uuml;r wen sie sich lohnen, zeigt unser Test.</P>

<H1 ALIGN="CENTER">Doping f&uuml;r den VC20</H1><BR>

<P>Was kann er schon in der Grundversion? Nun, der VC20 bietet bereits
unaufger&uuml;stet einiges mehr als andere Heimcomputer in seiner
Preisklasse. Der fortgeschrittene Programmierer st&ouml;&szlig;t jedoch
bald an die Grenze des Speichervolumens, die bei nicht einmal 4 KByte
liegt. Um diesem &Uuml;bel beizukommen, erfreuen sich die verschiedenen
Speichererweiterungen gro&szlig;er Beliebtheit, denen nun mit den
neuartigen 64 KByte-RAM-Karten Konkurrenz bl&uuml;ht.</P>

<P>Zum Test standen der &quot;RAM-Master&quot; und die
&quot;Zero-Karte&quot; an. Beide Karten ersetzen zun&auml;chst einmal
s&auml;mtliche Speichererweiterungs-Module, die f&uuml;r den VC20 angeboten
werden. Mit ihnen l&auml;&szlig;t sich also der Basic Speicherbereich bis
auf die maximalen 27,5 KByte hochp&auml;ppeln. Wie die Module werden die
Karten in den User-Port des (ausgeschalteten) Computers gesteckt. Mit den
Erweiterungs-Karten l&auml;&szlig;t sich jede Speichererweiterung
simulieren, was je nach Modell mittels f&uuml;nf beziehungsweise sechs
DIL-Schaltern geschieht. Sind die Karten erst einmal im User-Port
befestigt, kommt man nicht mehr an die Schalter heran. Um einen anderen
Speicherbereich zu w&auml;hlen, mu&szlig; zuerst der Computer ausgeschaltet
und dann die Platine herausgezogen werden. Doch die beiden Karten
k&ouml;nnen mehr als &quot;nur&quot; den Basic-Speicherbereich erweitern.
Das gr&uuml;ne Zorro-Modell verf&uuml;gt &uuml;ber ein EPROM. Damit kann
der VC20 acht zus&auml;tzliche Ger&auml;teadressen mittels den folgenden
Basic-Befehlen ansteuern: &quot;LOAD&quot;, &quot;SAVE&quot;,
&quot;OPEN&quot;, &quot;CLOSE&quot;, &quot;PRINT&quot;, &quot;FILE&quot;,
&quot;INPUT FILE&quot; und &quot;GET FILE&quot;. Diese Ger&auml;teadressen
erm&ouml;glichen es, bis zu acht verschiedene BasicProgramme voneinander
unabh&auml;ngig zu bearbeiten. Das ist eine praktische Sache, weil man so
zwischen den Programmen &quot;pendeln&quot; kann.</P>

<TABLE border="0">
<TR><TD>
<BR><CENTER><IMG SRC="mm_hc10d.gif" ALT="Zorro-Modell">
</TD><TD>ZORRO-Modell</CENTER><BR><BR>
</TD></TR></TABLE>

<P>Beim RAM-Master sieht dies etwas anders aus: Da er &uuml;ber kein EPROM
verf&uuml;gt, ist es komplizierter, Programme ins Ged&auml;chtnis der Karte
zu schiebe. Die Programme d&uuml;rfen maximal 8 KByte umfassen (bei Zero
bis zu 32 KByte) und spezielle Ger&auml;teadressen stehen nicht zur
Verf&uuml;gung. Des weiteren mu&szlig; der Basic-Anfang auf 6000 gesetzt
werden, was gewisse Vorkenntnisse voraussetzt. Als Pluspunkt gibt es jedoch
die M&ouml;glichkeit, den RAM-Master mit einer externen Stromquelle zu
versorgen. So bleiben in ihm gespeicherte Programme auch nach dem
Ausschalten des Computers erhalten. Die Karte bietet sich somit als
Alternative zu einem teuren Disketten-Laufwerk an. Im Gegensatz zum
Zero-Modell ist der RAM-Master per Modul-Box mit anderen
Speichererweiterungen kombinierbar. Vorteil: Man kann die 64 KByte der
Karte vollst&auml;ndig zum Speichern von Programmen benutzen.</P>

<TABLE border="0">
<TR><TD>
<BR><CENTER><IMG SRC="mm_hc10c.gif" ALT="RAM-Master">
</TD><TD>RAM-Master</CENTER><BR><BR>
</TD></TR></TABLE>
<P>Der silberne RAM-Master schl&auml;gt mit 298 Mark aufs Konto, ist aber
f&uuml;r 50 Mark weniger auch als Bausatz zu haben. Die Zero-Karte liegt
mit 279 Mark auf einem &auml;hnlichen Preis-Niveau. Teurer als eine reine
Speichererweiterung von 32 KByte (um die 180 Mark) sind die Karten allemal,
sie bieten aber auch einiges mehr. F&uuml;r wen lohnen sich also die
RAM-Karten? Wohl am ehesten f&uuml;r Anwender, die oft zwischen mehreren
Programmen hin und her wechseln, insbesondere dann, wenn sie &uuml;ber
keine Floppy verf&uuml;gen. F&uuml;r den
&quot;DurchschnittsComputerer&quot; halten sich die Vorteile gegen&uuml;ber
einer billigeren Speichererweiterung in Grenzen.</P>

(Christian Spitzner/hl)
<BR>
<BR>
<HR><BR>
In der n&auml;chsten NoCover gibt es Grundlagen zu EPROM`s.
</TD>
</TR>
</TABLE>
<BR><BR>
<TABLE ALIGN="CENTER" border="3">
<TR bgcolor="#ffffff">
<TD><A HREF=mailto:"thomasnawroth@web.de">Thomas Nawroth</A></TD>
</TR>
</TABLE>
</BODY>
</HTML>
