<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      AntiSpam2
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="">
      <TR>
        <TD>
        <A href="tl_tlx.html"><FONT size="+1"><B>zur&uuml;ck zum Frame</B></FONT></A>
          <H2 align="center">
            <B>AntiSpam2</B>
          </H2>
          <BR>

          <P>
            Wer mit kennt sie nicht: <B>SPAM.</B>
          </P>
          <P>
            Unerw&uuml;nschte Werbung, zumeist &uuml;ber Zwielichtige Gesch&auml;fte oder Erotik-Artikel, die einem das Postfach verstopft. SPAMs kosten Geld, Zeit und Nerven. Aber es gibt jetzt ein
            wirksames Mittel dagegen - AntiSPAM 2.<BR>
             Das Projekt arbeitet Hand in Hand mit YAM und anderen Mailern zusammen. AntiSpam in seiner zweiten Stufe bietet mehr Komfort, leichtere Installation und viel gr&ouml;&szlig;ere
            Treffsicherheit als fr&uuml;her. Im Gegensatz zu AntiSpam1 braucht man nun nur alle Mails auszuw&auml;hlen und per AddSpammer auf den Server zu schieben.<BR>
             Zur Konfiguration dient das Skript <TT>AntiSpam2.start</TT>. Mit der Option SpamScore wird die Filterempfindlichkeit eingestellt. SpamScore ist der Wert den die EMail beim Test erreicht.
            &Uuml;berschreitet man den Score der als Grenze eingestellt ist, fliegt die Mail als SPAM weg. Je h&ouml;her man die Grenze setzt, desto weniger Mails erreichen sie. Die die Grenze
            erreichen sind dann mit h&ouml;hrerer Wahrscheinlichkeit echte Spams, d. h. die Fehlerquote geht zur&uuml;ck. Es werden weniger NICHTSpams als Spams gel&ouml;scht. Mit der Zeit werden
            alle AntiSpam User diesen Wert nach oben korregieren m&uuml;ssen, zwangsweise, weil sich das aus der Art der Scoreberechnung und dem Ansteigen der Spams in der Datenbank ergibt.
          </P>
          <P>
            Ist das Archiv AntiSpam2.lha von der BenderIRC-Homepage runtergeladen, wird das Archiv in das <TT>YAM</TT>-Verzeichnis entpackt. Von dort kommem die drei Library`s mit <TT>copy #?. libs
            libs:</TT> in das Libs-Verzeichnis.<BR>
             Soweit die Installation.
          </P>
          <P>
            Nun zur Konfiguration:<BR>
             Als erstes wird YAM gestartet und danach der Men&uuml;-Punkt <TT>Einstellungen &gt; Koniguration...</TT> angew&auml;hlt.<BR>
             Zun&auml;chst geht ihr auf <TT>ARexx.</TT>Dort auf <TT>Programmstart</TT> klicken und unten in der Zeile Skript <TT>yam:bin/antispam2.start</TT> eingeben oder mit einem Klick auf das
            Ordner-Symbol aus dem Verzeichnis <TT>bin</TT> ausw&auml;hlen.<BR>
          </P>
          <DIV align="CENTER">
            <IMG src="st_antispam1.jpg" alt="AntiSpam2.start" width="657" height="296">
          </DIV>
          <P>
            Dieser Befehl wird dann als <TT>AmigaDOS</TT> markiert. <TT>Warte auf Beendigung</TT> bitte <B>nicht</B> einschalten.
          </P>
          <P>
            Als zweites wird <TT>Nach dem Holen von Post</TT> bearbeitet.
          </P>
          <BR>

          <DIV align="CENTER">
            <IMG src="st_antispam2.jpg" alt="AntiSpam2 Post holen" width="658" height="296">
          </DIV>
          <BR>
           <BR>

          <P>
            Hier wieder auf das Ordner-Symbol klicken und aus dem <TT>bin</TT>-Verzeichnis den Befehl <TT>SignalAntiSpamD</TT> ausw&auml;hlen. Auch diesesmal als <TT>AmigaDOS</TT> markieren, und
            jetzt <TT>Warte auf Beendigung</TT> anklicken.
          </P>
          <P>
            Habt ihr das geschafft, folgt der n&auml;chste Schritt:<BR>
             In Skripts <TT>Programmende</TT> anw&auml;hlen, das Ordner-Symbol anklicken und dort aus dem <TT>bin</TT>-Verzeichnis den Befehl <TT>stopAntiSpamD</TT> anw&auml;hlen.
          </P>
          <DIV align="CENTER">
            <IMG src="st_antispam4.jpg" alt="Konfiguratinon Programmende" width="657" height="294">
          </DIV>
          <P>
            Als n&auml;chstes Erstellen wir einen Men&uuml;-Eintrag.<BR>
             Dazu einfach auf <TT>`Skripts` Men&uuml;eintrag 1</TT> oder das erste, bei euch freie (nicht markierte) Skript anklicken. Auch hier auf das Ordner-Symbol klicken und aus dem
            <TT>Rexx</TT>-Verzeichnis in YAM das <TT>AddSpammer.rexx</TT>-Skript ausw&auml;hlen. Hier wird auf <TT>ARexx</TT> umgeschaltet, <TT>&ouml;ffne Konsolenfenster</TT> und <TT>Warte auf
            Beendigung</TT> geklickt.<BR>
          </P>
          <DIV align="CENTER">
            <IMG src="st_antispam3.jpg" alt="Men&uuml;-Eintrag in YAM" width="658" height="295">
          </DIV>
          <P>
            Zu guter Letzt fertigen wir uns noch einen Men&uuml;eintrag zum Erg&auml;nzen einer WhiteList an. Das ist eine Liste mit Adressen augew&auml;hlter Mail`s, z.B. von Freunden und Bekannten,
            die nicht blockiert werden sollen. Dazu wird wie oben bei <TT>AddSpammer.rexx</TT> verfahren. Nur den n&auml;chsten Men&uuml;eintrag nehmen, dann <TT>AddWhitelist.rexx</TT> ausw&auml;hlen
            und auf <TT>ARexx</TT> umschalten.<BR>
             Das war es schon im groben und ganzen.
          </P>
          <P>
            Nun ein Hinweis f&uuml;r diejenigen, die schon die erste Version von AntiSpam nutzten:<BR>
             AntiSpam1 speicherte sein Spam-Daten in der <TT>.config</TT>-Datei von Yam im <TT>YAM</TT>. Diese Daten k&ouml;nnen, m&uuml;ssen aber nicht gel&ouml;scht werden.<BR>
             Das l&ouml;schen geht am einfachsten im Konfigurations-Fenster <TT>Filter</TT>. Den AntiSpam-Filter in der <TT>Liste der Filter</TT> anklicken und l&ouml;schen.
          </P>
          <P>
            Nun zur Bedienung von AntiSpam2:<BR>
             Beim Start von YAM holt sich AntiSpam2 von BenderIRC.de die neusten Spam-Daten. Durch die Umfangreiche Liste (&uuml;ber 3600 Eintr&auml;ge) braucht diese Prozedur mit einem Modem etwas
            Zeit. Dabei wird ein Shell-Fenster ge&ouml;ffnet und &uuml;ber den Verbindungsaufbau und die Menge der gelesenen Daten informiert. Danach werden die E-Mails geladen.<BR>
             Ist jetzt noch Spam durch den Filter gerutscht, seid ihr gefragt.<BR>
             Ohne die Mitwirkung der von Spam heimgesuchten Anwender wird der Filtervorgang nicht besser. Nach dem anw&auml;hlen geht man einfach in den Men&uuml;punkt <TT>Skripts</TT> und w&auml;hlt
            den neuen Eintrag <TT>AddSpammer</TT> an. Das war`s schon. So haben wir alle etwas von dem Eintrag in dem Spam-Filter.
          </P>
          <P>
            Ist in den E-Mail`s eine Post, die immer durchkommen soll, ist das auch kein Problem. Diese Post ausw&auml;hlen, den neuen Skript-Eintrag <TT>AntiSpamWhiteList</TT> anw&auml;hlen und
            schon wird der Absender der AddSpamWhiteList angef&uuml;gt. Das kann man &uuml;brigens auch manuell mit einem ASCII-Editor machen.
          </P>
          <P>
            Laut "Cyborg" ist f&uuml;r den Betrieb von AntiSpam2 mindestens ein Amiga mit 68040 und 25 Mhz erforderlich, damit das Generieren der Spam-Datenbank im Speicher nicht zu lange dauert. Aus
            meiner Sicht dauert das nicht zu lang, denn das einzige, was mir auff&auml;llt, ist das laden der Spam-Daten aus dem Netz.<BR>
             Wer sich dennoch die langen Downloadzeiten sparen will, kommentiert einfach getfilters2 im StartScript aus und schafft sich einen UPDATE-Men&uuml;punkt mit Getfilters2 an. Das hat den
            Vorteil das man nur einmal die Woche runterladen braucht und der YAM Start geht auch schneller.<BR>
             Ich w&uuml;rde daher AntiSpam2 auch denen ans Herz legen, die einen 68030 Prozessor ihr eigen nennen.<BR>
             Ausprobieren schadet bestimmt nicht.
          </P>
          <B>Freeware</B> und zu beziehen unter <A href="http://benderirc.de/antispam.html">BenderIRC.de</A><BR>
           <B>Archiv-Name:</B> AntiSpam2.lha<BR>
           <B>Das Archiv</B> hat eine Gr&ouml;sse von ca. 83 KByte.<BR>
           <B>Autor:</B> <A href="mailto:Cyborg@BenderIRC.de">"Cyborg"</A>
          <P>
            <B>Mein Fazit:</B> Wer E-Mail`s empf&auml;ngt der braucht AntiSpam2.
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <CENTER>
            <TABLE border summary="">
              <TR>
                <TH bgcolor="#CCCCCC">
                  <FONT color="#f3300CC">JoJo</FONT> &nbsp; J&uuml;rgen Sperling
                </TH>
              </TR>
              <TR>
                <TH bgcolor="#FFFFCC">
                  sperlingbergen@freenet.de
                </TH>
              </TR>
            </TABLE>
          </CENTER>
        <A href="tl_tlx.html"><FONT size="+1"><B>zur&uuml;ck zum Frame</B></FONT></A>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

