<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Cord Hagen -->

<TITLE>Die Katze und die Pille</TITLE>
</HEAD>

<BODY background="bgg.gif" text="#000000" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<P align="center"><FONT color="#000080" size="7"><B>ANLEITUNG</B></FONT><BR>
<FONT color="#000080" size="5"><B>einer Katze eine Pille zu verabreichen</B></FONT></P>

<TABLE border="0">
<TR>
<TD valign="top" align="right">1.</TD>

<TD>Nehmen Sie die Katze in die Beuge Ihres linken Armes, so, als ob Sie
ein Baby halten. Legen Sie den rechten Daumen und Mittelfinger an beiden
Seiten des M&auml;ulchens an und &uuml;ben Sie sanften Druck aus, bis die
Katze es &ouml;ffnet. Schieben Sie die Pille hinein und lassen Sie die
Katze das M&auml;ulchen schlie&szlig;en.</TD></TR>

<TR>
<TD valign="top" align="right">2.</TD>

<TD>Sammeln Sie die Pille vom Boden auf und holen Sie die Katze hinterm
Sofa vor. Nehmen Sie sie wieder auf den Arm und wiederholen Sie den
Vorgang.</TD></TR>

<TR>
<TD valign="top" align="right">3.</TD>

<TD>Holen Sie die Katze aus dem Schlafzimmer und schmei&szlig;en Sie die
angesabberte Pille weg.</TD></TR>

<TR>
<TD valign="top" align="right">4.</TD>

<TD>Nehmen Sie eine neue Pille aus der Verpackung, die Katze erneut auf den
Arm und halten Sie die Tatzen mit der linken Hand fest. Zwingen Sie den
Kiefer auf und schieben Sie die Pille in den hinteren Bereich des
M&auml;ulchens. Schlie&szlig;en Sie es und z&auml;hlen Sie bis 10.</TD>
</TR>

<TR>
<TD valign="top" align="right">5.</TD>

<TD>Angeln Sie die Pille aus dem Goldfischglas und die Katze von der
Garderobe. Rufen Sie Ihren Mann (Ihre Frau)aus dem Garten.</TD></TR>

<TR>
<TD valign="top" align="right">6.</TD>

<TD>Knien Sie sich auf den Boden und klemmen Sie die Katze zwischen die
Knie. Halten Sie die Vorderpfoten fest. Ignorieren Sie das Knurren der
Katze. Bitten Sie Ihren Mann (Ihre Frau), den Kopf der Katze festzuhalten
und ihr ein Holzlineal in den Hals zu schieben. Lassen Sie die Pille das
Lineal runterkullern und reiben Sie anschlie&szlig;end den Katzenhals.</TD>
</TR>

<TR>
<TD valign="top" align="right">7.</TD>

<TD>Pfl&uuml;cken Sie die Katze aus dem Vorhang. Nehmen Sie eine neue Pille
aus der Packung. Notieren Sie sich, ein neues Lineal zu kaufen und den
Vorhang zu flicken.</TD></TR>

<TR>
<TD valign="top" align="right">8.</TD>

<TD>Wickeln Sie die Katze in ein gro&szlig;es Handtuch. Drapieren Sie die
Pille in das Endst&uuml;ck eines Strohhalmes. Bitten Sie Ihren Mann (Ihre
Frau), die Katze in den Schwitzkasten zu nehmen, so dass lediglich der Kopf
durch die Ellenbogenbeuge guckt. Hebeln sie das Katzenm&auml;ulchen mit
Hilfe eines Kugelschreibers auf und pusten Sie die Pille in ihren
Hals.</TD></TR>

<TR>
<TD valign="top" align="right">9.</TD>

<TD>&Uuml;berpr&uuml;fen Sie die Packungsbeilage um sicher zu gehen, dass
die Pille f&uuml;r Menschen harmlos ist. Trinken Sie ein Glas Wasser, um
den Geschmack loszuwerden. Verbinden Sie den Arm Ihres Mannes (Ihrer Frau)
und entfernen Sie das Blut aus dem Teppich mit kaltem Wasser und
Seife.</TD></TR>

<TR>
<TD valign="top" align="right">10.</TD>

<TD>Holen Sie die Katze aus dem Gartenh&auml;uschen des Nachbarn. Nehmen
Sie eine neue Pille. Stecken Sie die Katze in einen Schrank und
schlie&szlig;en Sie die T&uuml;r in H&ouml;he des Nackens, so dass der Kopf
herausschaut. Hebeln Sie das Maulchen mit einem Dessert-L&ouml;ffel auf.
Flitschen Sie die Pille mit einem Gummiband in den Rachen.</TD></TR>

<TR>
<TD valign="top" align="right">11.</TD>

<TD>Holen Sie einen Schraubenzieher aus der Garage und h&auml;ngen Sie die
T&uuml;r zur&uuml;ck in die Angeln. Legen Sie kalte Kompressen auf Ihr
Gesicht und &uuml;berpr&uuml;fen Sie das Datum Ihrer letzten
Tetanusimpfung. Werfen Sie Ihr blutgesprenkeltes T-Shirt weg und holen Sie
ein neues aus dem Schlafzimmer.</TD></TR>

<TR>
<TD valign="top" align="right">12.</TD>

<TD>Lassen Sie die Feuerwehr die Katze aus dem Baum auf der
gegen&uuml;berliegenden Stra&szlig;e holen. Entschuldigen Sie sich beim
Nachbarn, der in den Zaun gefahren ist, um der Katze auszuweichen. Nehmen
Sie die letzte Pille aus der Packung.</TD></TR>

<TR>
<TD valign="top" align="right">13.</TD>

<TD>Binden Sie die Vorder- und Hinterpfoten der Katze
mit W&auml;scheleine zusammen. Kn&uuml;pfen Sie sie
an die Beine des Esstisches. Ziehen Sie sich
Gartenhandschuhe &uuml;ber, &ouml;ffnen Sie das
M&auml;ulchen mit Hilfe eines Brecheisens. Stopfen
Sie die Pille hinein, gefolgt von einem gro&szlig;en
St&uuml;ck Filetsteak. Halten Sie den Kopf der Katze
senkrecht und sch&uuml;tten sie Wasser hinterher, um
die Pille herunter zu sp&uuml;len.</TD></TR>

<TR>
<TD valign="top" align="right">14.</TD>

<TD>Lassen Sie sich von Ihrem Mann (Ihrer Frau) ins Krankenhaus fahren.
Sitzen Sie still, w&auml;hrend der Arzt Finger und Arm n&auml;ht und Ihnen
die Pille aus dem rechten Auge entfernt. Halten Sie auf dem R&uuml;ckweg am
M&ouml;belhaus und bestellen Sie einen neuen Tisch.</TD></TR>
</TABLE>

<P>Internetfundst&uuml;ck per EMail<BR>
Cord Hagen</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

