<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Cord Hagen -->

<TITLE>Politik f&uuml;r Anf&auml;nger</TITLE>
</HEAD>

<BODY background="bg_cord1.jpg" text="#fffff0" bgcolor="#000000">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<H1 align="center"><FONT color="#ffff00"><B>Politik f&uuml;r Anf&auml;nger<BR>
am Beispiel von zwei K&uuml;hen</B></FONT></H1>

<P><B>Christdemokrat:</B><BR>
Sie besitzen zwei K&uuml;he. Ihr Nachbar besitzt keine. Sie behalten eine
und schenken ihrem armen Nachbarn die andere. Danach bereuen Sie es.</P>

<P><B>Sozialist:</B><BR>
Sie besitzen zwei K&uuml;he. Ihr Nachbar besitzt keine. Die Regierung nimmt
Ihnen eine ab und gibt diese Ihrem Nachbarn. Sie werden gezwungen, eine
Genossenschaft zu gr&uuml;nden, um Ihrem Nachbarn bei der Tierhaltung zu
helfen.</P>

<P><B>Sozialdemokrat:</B><BR>
Sie besitzen zwei K&uuml;he. Ihr Nachbar besitzt keine. Sie f&uuml;hlen
sich schuldig, weil Sie erfolgreich arbeiten. Sie w&auml;hlen Leute in die
Regierung, die Ihre K&uuml;he besteuern. Das zwingt Sie, eine Kuh zu
verkaufen, um die Steuern bezahlen zu k&ouml;nnen. Die Leute, die Sie
gew&auml;hlt haben, nehmen dieses Geld, kaufen eine Kuh und geben diese
Ihrem Nachbarn. Sie f&uuml;hlen sich rechtschaffen. Udo Lindenberg singt
f&uuml;r Sie.</P>

<P><B>Freidemokrat:</B><BR>
Sie besitzen zwei K&uuml;he. Ihr Nachbar besitzt keine. Und?</P>

<P><B>Kommunist:</B><BR>
Sie besitzen zwei K&uuml;he. Ihr Nachbar besitzt keine. Die Regierung
beschlagnahmt beide K&uuml;he und verkauft Ihnen die Milch. Sie stehen
stundenlang f&uuml;r die Milch an. Sie ist sauer.</P>

<P><B>Kapitalismus pur:</B><BR>
Sie besitzen zwei K&uuml;he. Sie verkaufen eine und kaufen einen Bullen, um
eine Herde zu z&uuml;chten.</P>

<P><B>EU-B&uuml;rokratie:</B><BR>
Sie besitzen zwei K&uuml;he. Die EU nimmt ihnen beide ab, t&ouml;tet eine,
melkt die andere, bezahlt Ihnen eine Entsch&auml;digung aus dem
Verkaufserl&ouml;s der Milch und sch&uuml;ttet diese dann in die
Nordsee.</P>

<P><B>Amerikanisches Unternehmen:</B><BR>
Sie besitzen zwei K&uuml;he. Sie verkaufen eine und leasen sie zur&uuml;ck.
Sie gr&uuml;nden eine Aktiengesellschaft. Sie zwingen die beiden K&uuml;he,
das Vierfache an Milch zu geben. Sie wundern sich, als eine tot
umf&auml;llt. Sie geben eine Presseerkl&auml;rung heraus, in der Sie
erkl&auml;ren, Sie h&auml;tten Ihre Kosten um 50 % gesenkt. Ihre Aktien
steigen.</P>

<P><B>Franz&ouml;sisches Unternehmen:</B><BR>
Sie besitzen zwei K&uuml;he. Sie streiken, weil Sie drei K&uuml;he haben
wollen. Sie gehen Mittagessen. Das Leben ist sch&ouml;n.</P>

<P><B>Japanisches Unternehmen:</B><BR>
Sie besitzen zwei K&uuml;he. Mittels modernster Gentechnik werden die Tiere
auf ein Zehntel ihrer urspr&uuml;nglichen Gr&ouml;&szlig;e gez&uuml;chtet,
die das Zwanzigfache der Milch geben.</P>

<P><B>Deutsches Unternehmen:</B><BR>
Sie besitzen zwei K&uuml;he. Mittels modernster Gentechnik werden die Tiere
"redesigned", so dass sie alle blond sind, eine Menge Bier saufen, Milch
von h&ouml;chster Qualit&auml;t geben und 160 km/h laufen k&ouml;nnen.
Leider fordern die K&uuml;he 13 Wochen Urlaub im Jahr.</P>

<P><B>Italienisches Unternehmen:</B><BR>
Sie besitzen zwei K&uuml;he, aber Sie wissen nicht, wo sie sind.
W&auml;hrend Sie sie suchen, sehen Sie eine sch&ouml;ne Frau. Sie machen
Mittagspause. Das Leben ist sch&ouml;n.</P>

<P><B>Russisches Unternehmen:</B><BR>
Sie besitzen zwei K&uuml;he. Sie z&auml;hlen jedoch f&uuml;nf. Sie trinken
noch mehr Wodka. Sie z&auml;hlen erneut und kommen nunmehr auf 42
K&uuml;he. Hoch erfreut z&auml;hlen Sie gleich noch mal und jetzt sind es
zw&ouml;lf K&uuml;he. Entt&auml;uscht lassen Sie das Z&auml;hlen sein und
&ouml;ffnen die n&auml;chste Flasche Wodka. Die Mafia kommt vorbei und
nimmt Ihnen - wie viele K&uuml;he es auch immer sein m&ouml;gen -</P>

<P><B>Schweizer Unternehmen:</B><BR>
Sie verf&uuml;gen &uuml;ber 5.000 K&uuml;he, von denen Ihnen aber keine
einzige geh&ouml;rt. Sie betreuen die Tiere nur f&uuml;r andere. Wenn die
K&uuml;he Milch geben, erz&auml;hlen Sie es niemandem.</P>

<P>Internetfundst&uuml;ck per EMail<BR>
Cord Hagen</P>
<HR>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

