<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Cord Hagen -->

<TITLE>Vorbildliche Kontaktanzeigen</TITLE>
</HEAD>

<BODY background="bg_cord1.jpg" text="#fffff0" bgcolor="#000000">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>

<H1 align="center"><FONT color="#ffff00"><B>Vorbildliche Kontaktanzeigen</B>
</FONT></H1>

<P>Spa&szlig;vogel (19) sucht verst&auml;ndnisvolle Partnerin, die es mag,
Wasser &uuml;ber den Kopf zu kriegen, Spinnen im Bett zu finden und an
T&uuml;rklinken zu fassen, die unter Starkstrom stehen. Muss mehr Humor
haben als meine letzten 27 Freundinnen!! Chiffre 92378</P>

<P>Attraktiv, wohlhabend, intelligent, geistreich, sportlich, elegant,
sensibel, humorvoll, welterfahren und erfolgreich ... bin ich NICHT. Aber
schreibt mir ruhig! Chiffre 722201</P>

<P>Mediziner sucht M&auml;dchen mit innerer Sch&ouml;nheit.
R&ouml;ntgenbilder bitte an Chiffre 28934</P>

<P>SIE, lebhaft (nicht still), schlank (nicht dick), br&uuml;nett (nicht
blond) sucht ruhigen (nicht lauten) Mann (nicht Frau) f&uuml;r gemeinsame
(nicht alleinige) Abendstunden (nicht am Tag). Kennwort "Eva" (nicht Adam)
unter Chiffre 27883 (nicht 27884)</P>

<P>Puffi-muffi-Schnuckelb&auml;rchen sucht zuckers&uuml;&szlig;es
Hutzimutzi, das ganz kille-kille-schmuselieb zu ihm ist .. und daf&uuml;r
sorgt, dass er endlich wieder vern&uuml;nftig redet! -Chiffre 422617</P>

<P>Chronischer L&uuml;gner (190, sportlich, Magnum-Typ) sucht
gutaussehendes M&auml;dchen f&uuml;r Reise zu seiner Zehn-Millionen-Villa
in St. Tropez. Chiffre 677389</P>

<P>Verfassungsschutz-Beamter m&ouml;chte nette Freundin kennenlernen. Bitte
keine Adressen, K&ouml;rperma&szlig;e oder Fotos schicken, haben wir alles
hier im Computer gespeichert! - Chiffre 7892</P>

<P>Ich habe die Figur von Bo Derek, die Oberweite von Dolly Dollar, den Sex
von Tina Turner. Und au&szlig;erdem habe ich ein Problem: Ich bin
n&auml;mlich ein Mann. -Chiffre 77628</P>

<P>Ich bin eine attraktive, gebildete Blondine (25/168/57) mit
h&ouml;chstem Einkommen. Ich habe Liebhaber in rauhen Mengen und irre viel
Spa&szlig; am Leben. Kurzum: Ich hab's nicht n&ouml;tig, mein Geld oder
meine Zeit f&uuml;r Nieten zu verschwenden, die Kontaktanzeigen lesen.
Deshalb werde ich auch niemandem antworten, der mir schreibt! - Chiffre
21903</P>

<P>Mensch mit Ged&auml;chtnisschwund. Ich wei&szlig; nicht mehr, wer ich
bin ... und auch nicht, was f&uuml;r einen Partner ich suche. Und die
Chiffre-Nr habe ich auch vergessen.</P>

<P>Unternehmer mit Knoblauch-Fabrik und
Stinktier-Z&uuml;chtung sucht Lebensgef&auml;hrtin mit
Dauerschnupfen. Chiffre 267811</P>

<P>Sch&uuml;chterner Typ, 23, sucht -</P>

<P>Auch Idioten brauchen Liebe! Wenn du also jemand bist, der st&auml;ndig
zu tanken vergisst, andern Leuten Getr&auml;nke &uuml;ber die Klamotten
sch&uuml;ttest und immer erst ins Kino kommst, wenn der Film schon eine
Stunde l&auml;uft ... dann haben wir bereits drei Dinge gemeinsam! Lass uns
herausfinden, worin wir NOCH komplette Nieten sind! Chiffre 42155</P>

<P>Umwerfende Erscheinung sucht Typ zum Umwerfen. Gern auch mit Keule,
Schlagring, Peitsche, Bratpfanne oder Hammer, Chiffre 36720</P>

<P>Bin hoffnungslos pleite und schulde jedem Geld. Falls Sie nicht zu
meinen Gl&auml;ubigern geh&ouml;ren, w&uuml;rde ich Sie gerne kennenlernen.
Bitte Telefonnummer - meine wurde gesperrt. Unter Chiffre 87312</P>

<P>Fraknor, der Kriegsf&uuml;rst des Planeten Zambo, sucht G&ouml;ttin der
Vierten Dimension, um mit ihr gemeinsam den Thron der Yugurtha-Galaxis zu
besteigen. Bitte nur ernstgemeinte Zuschriften unter Chiffre 9024</P>

<P>Motorradfahrender Trapezk&uuml;nstler, Vegetarier mit Interesse an
Okkultismus, Bismarck, Schlammringkampf und Karpfenzucht, sucht weibliches
Gegenst&uuml;ck. - Chiffre 1532</P>

<P>An das blonde M&auml;dchen im Madonna-T-Shirt, das mich gestern mittag
im C13-Bus anl&auml;chelte: Du bist NICHT mein Typ, und ich will dich NICHT
kennenlernen. -Wankelm&uuml;tige Sie, 34, sucht &auml;lteren Mann (um die
zwanzig?) mit blauen, braunen oder gr&uuml;nen Augen sowie dunkelblonden,
vielleicht aber auch schwarzen oder roten Haaren! Ruf mich doch mal an ...
oder schreibe einen Brief ... oder vielleicht sollten wir das Ganze lieber
lassen? Oder vielleicht doch nicht, hm??? Unter Chiffre 672290</P>

<P>W&uuml;tende Menschenmenge mit Holzpr&uuml;geln und Fackeln sucht
haariges Monster zwecks Verfolgung bei Vollmond und anschlie&szlig;ender
T&ouml;tung. Chiffre 112113</P>

<P>Erstversuch! Mann, m. gr. Spw., vg. u. m. weitr. Vbn. sucht Leute, die
ihm erkl&auml;ren, was "m. gr. Spw., vg. u. m. weitr. Vbn." bedeutet!
Chiffre 33562</P>

<P>90j&auml;hrige hat nur noch wenige Wochen zu leben. Welcher junge Mann
versch&ouml;nt mir die letzten Tage und erbt daf&uuml;r mein
Millionenverm&ouml;gen? Chiffre (Bereits vergeben. Der Setzer.)</P>

<P>Orgel zu verkaufen. Ja ... ich wei&szlig;, das ist keine Kontaktanzeige.
Aber in der Spalte "Zu verkaufen" habe ich nie eine Antwort gekriegt! Und
au&szlig;erdem: Wenn du hier keinen passenden Partner gefunden hast ... wer
wei&szlig;, vielleicht versuchst du's statt dessen mal mit einer netten
Orgel. Chiffre 345228</P>

<P>Unscheinbarer Typ mit Akne sucht Freundin. Ich wei&szlig;, das gibt
nicht viel her, aber ich wette, das ist die einzige wirklich ehrliche
Anzeige auf dieser Seite! - Chiffre 32214</P>

<P>Ich hasse endlose Kontaktanzeigen, diese Dinger, wo der Schreiber nur
labert und labert, anstatt sich aufs Wesentliche zu beschr&auml;nken. In
der K&uuml;rze liegt die W&uuml;rze, besagt das Sprichwort, und so ist es
auch bei Anzeigen. Die meisten Leute beachten solche Marathon-Anzeigen gar
nicht, und selbst wenn man sich die Zeit nimmt, sie zu lesen, merkt man
schnell, dass &uuml;ber den Verfasser so gut wie gar nichts drinsteht!
Deshalb will ich in aller K&uuml;rze mitteilen (Fortsetzung auf Seite
53)</P>

<P>Und noch 2 Witze</P>

<P><B>Baden verboten!</B><BR>
"Baden ist hier verboten!", erkl&auml;rt der Polizist einer jungen Frau.<BR>
"Warum haben Sie das nicht gesagt, bevor ich mich ausgezogen habe?"<BR>
"Ausziehen ist nicht verboten..."</P>

<P>In der U-bahn sitzt ein alter Mann einem Punker gegen&uuml;ber, der
einen richtig sch&ouml;nen Irokesenschnitt hat. Nach einer Weile fragt der
Punker den immer noch guckenden alten Mann:<BR>
"Na, Opa. Was ist? Gefall ich Dir?"<BR>
Erwidert der alte Mann:<BR>
"Ich wei&szlig; nicht recht. Fr&uuml;her habe ich mal H&uuml;hner gebumst
und jetzt &uuml;berlege ich, ob Du mein Sohn sein k&ouml;nntest."</P>

<P>"Fatih" &lt;fatih@freie-akademie.de&gt;</P>
<HR>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

