<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Cord Hagen -->

<TITLE>"Ich bin doof"</TITLE>
</HEAD>

<BODY background="bg_cord1.jpg" text="#fffff0" bgcolor="#000000">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<H1 align="center"><FONT color="#ffff00"><B>Dein Schild: "Ich bin
doof"</B></FONT></H1>

<P>Doofe Leute sollten Schilder tragen m&uuml;ssen auf denen steht: "Ich
bin doof". Dann w&uuml;rde man sich nicht auf sie verlassen, oder? Du
w&uuml;rdest sie nichts fragen. Es w&auml;re wie " tschuldigung, ich...
&auml;h, vergiss es. Hab das Schild nicht gesehen." Man w&uuml;sste
zumindest, was auf einen zukommt.</P>

<P>So wie letztes Jahr, als ich mit meiner Familie mitten im Umzug stand.
Die ganze Wohnung voll mit Umzugskartons, der Lkw vor der T&uuml;r. Mein
Nachbar kommt r&uuml;ber und fragt: "Hey, du ziehst um?" "N&ouml;. Wir
packen nur ein- bis zweimal die Woche unsere Klamotten ein, um zu sehen,
wie viel Kartons wir daf&uuml;r brauchen. Hier ist dein Schild!"</P>

<P>Letzten Sommer war ich mit 'nem Freund angeln. Wir zogen sein Boot an
Land und holten gerade unseren Fang aus dem Boot, als dieser Idiot von der
Anlegestelle kam und fragte: "Habt ihr all die Fische gefangen?" "N&ouml;.
Wir haben sie &uuml;berredet aufzugeben. Hier ist dein Schild!"</P>

<P>Letztens hatte ich 'nen Plattfu&szlig;. Ich also zur n&auml;chsten
Tankstelle. Kommt einer auf mich zu, wirft 'nen Blick auf die Karre und
fragt: "Reifen platt?" Ich konnte einfach nicht widerstehen. "N&ouml;, ich
fuhr gerade so rum, als sich die anderen drei pl&ouml;tzlich aufpumpten.
Hier ist dein Schild!"</P>

<P>Vor kurzem wollte ich mein Auto verkaufen. Kommt so ein Typ r&uuml;ber,
macht ne dreiviertel Stunde Probefahrt. Als er zur&uuml;ckkommt, steigt er
aus, b&uuml;ckt sich, greift an den Auspuff und schreit "Schei&szlig;e, ist
das hei&szlig;." Siehst du? H&auml;tte er sein Schild getragen, h&auml;tte
ich ihn abhalten k&ouml;nnen.</P>

<P>Ich bin fr&uuml;her mal Sattelschlepper gefahren. Einmal
versch&auml;tzte ich mich bei der H&ouml;he einer Br&uuml;cke, verkeilte
den Lkw und kam nicht wieder los, egal was ich auch versuchte. &Uuml;ber
Funk hab ich Hilfe angefordert. Dann kam ein Polizist und fing an, einen
Bericht zu schreiben. Er stellte die &uuml;blichen Fragen... o.k. ... kein
Problem. Ich war mir schon fast sicher, dass er kein Schild
br&auml;uchte... bis er fragte "... also..., ihr Lkw hat sich verkeilt?"
Ich konnte mir nicht helfen. Ich schaute ihn an, blickte zur&uuml;ck zum
Sattelschlepper, dann zur&uuml;ck zu ihm und sagte: "N&ouml;. Ich liefere
eine Br&uuml;cke. Hier ist dein Schild!"</P>

<P>Wenn du heute Abend l&auml;nger arbeiten musst und ein Kollege bei dir
reinschaut und fragt: "Du bist immer noch hier?", dann antworte: "N&ouml;.
Bin schon vor 'ner Stunde gegangen. Hier ist dein Schild!!!"</P>

<P>Cord Hagen</P>
<HR>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

