<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Cord Hagen -->

<TITLE>Werbung</TITLE>
</HEAD>

<BODY background="bg_cord1.jpg" text="#fffff0" bgcolor="#000000">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<H1 align="center"><FONT color="#ffff00"><B>Werbung</B></FONT></H1>

<H3 align="center"><FONT color="#ffff00"><B>Andere L&auml;nder - andere Sitten<BR>
Saubl&ouml;de Pannen.</B></FONT></H3>

<P>McDonalds<BR>
Der McDonald-Konzern erlitt vor einiger Zeit mit einer Werbekampagne in
Japan Schiffbruch. Grund daf&uuml;r war das Maskottchen des Konzerns, der
Clown Ronnie-McDonald, welcher &uuml;blicherweise mit einem
weissgeschminkten Gesicht auftritt. In Japan ist ein weissgeschminktes
Gesicht aber ein Synonym f&uuml;r den Tod...</P>

<P>Coca-Cola<BR>
Coca-Cola floppte bei der Markteinf&uuml;hrung der 2-Liter-Flasche in
Spanien. Niemand hatte bedacht, dass die meisten Spanier nur kleine
K&uuml;hlschr&auml;nke besassen, in denen die Flasche nicht hineinpasste.
Und lauwarm wollte auch niemand die s&uuml;&szlig;e Limonade trinken...</P>

<P>Electrolux<BR>
Ein vom Schwedischen in das Englische &uuml;bersetzter Anzeigentext las
sich in einer koreanischen Zeitschrift, wenn man ihn frei und
r&uuml;cksichtsvoll in das Deutsche &uuml;bersetzte, wie folgt: 'Nichts
saugt so hundsmiserabel wie ein Elektrolux-Staubsauger.'</P>

<P>Philips<BR>
Auch Philips machte Erfahrungen mit den japanischen Miniatur-K&uuml;chen.
Der niederl&auml;ndische Konzern konnte seine Kaffeemaschinen erst
verkaufen, als sie gr&ouml;&szlig;enm&auml;&szlig;ig an die japanischen
K&uuml;chen angepasst wurden. &Auml;hnlich verhielt es sich mit den
Rasierern des selben Herstellers. Diese waren zu gro&szlig; f&uuml;r die
zierlichen japanischen M&auml;nnerh&auml;nde...</P>

<P>Campbell<BR>
Campbell musste bei der Markteinf&uuml;hrung seine Suppenkonzentrate in
England Verluste von 30 Mio. USD hinnehmen. Der Grund: Niemand kl&auml;rte
den Verbraucher dar&uuml;ber auf, dass es sich um ein Konzentrat handle, zu
dem man Wasser hinzuf&uuml;gen m&uuml;sse. Deshalb hielten die meisten
Briten solch kleine Dosen mit Suppe einfach f&uuml;r zu teuer...</P>

<P>Waschmittel<BR>
Die Missachtung regionaler Gepflogenheiten hatte auch f&uuml;r einen
amerikanischen Waschmittelhersteller Folgen. Dieser schaltete Mitte der
80er Jahre eine Anzeige, die links einen Berg schmutziger W&auml;sche, das
Produkt in der Mitte und rechts als Ergebnis einen Berg sauberer
W&auml;sche als Motiv hatte. Was aber nicht beachtet wurde: Araber lesen
von rechts nach links. Das Produkt floppte...</P>

<P>Colgate<BR>
Colgate f&uuml;hrte in Frankreich eine Zahnpasta namens 'Cue' ein. Was man
aber nicht wusste: 'Cue' ist der Name eines in Frankreich sehr bekannten
Pornomagazins....</P>

<P>Cord Hagen</P>
<HR>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

