<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Cord Hagen -->

<TITLE>Unf&auml;lle</TITLE>
</HEAD>

<BODY background="bg_cord1.jpg" text="#fffff0" bgcolor="#000000">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<H1 align="center"><FONT color="#ffff00"><B>Unf&auml;lle</B></FONT></H1>

<P>Folgende Schadensregulierungsantr&auml;ge sind tats&auml;chlich bei
Versicherungen eingegangen:</P>

<P>"Ich fuhr mit meinem Wagen gegen die Leitschiene, &uuml;berschlug mich
und prallte gegen einen Baum. Dann verlor ich die Herrschaft &uuml;ber mein
Auto."</P>

<P>"An der Kreuzung hatte ich einen unvorhergesehenen Anfall von
Farbenblindheit."</P>

<P>"Im gesetzlich zul&auml;ssigen H&ouml;chsttempo kollidierte ich mit
einer unvorschriftsm&auml;&szlig;igen Frau in der Gegenrichtung."</P>

<P>"Dummerweise stie&szlig; ich mit dem Fu&szlig;g&auml;nger zusammen. Er
wurde ins Krankenhaus eingeliefert und bedauerte dies sehr..."</P>

<P>"Der Fu&szlig;g&auml;nger hatte anscheinend keine Ahnung, in welche
Richtung er gehen sollte, und so &uuml;berfuhr ich ihn."</P>

<P>"Der andere Wagen war absolut unsichtbar, und dann verschwand er."</P>

<P>"Ich fand ein gro&szlig;es Schlagloch und blieb in demselben."</P>

<P>"Das andere Auto kollidierte mit dem meinigen, ohne mir vorher seine
Absicht mitzuteilen."</P>

<P>"Im hohen Tempo n&auml;herte sich mir die Telegraphenstange. Ich schlug
einen Zickzackkurs ein, aber dennoch traf die Telegraphenstange am
K&uuml;hler. Der Kraftsachverst&auml;ndige war v&ouml;llig ungehalten, als
er auf mein Vorderteil blickte..."</P>

<P>"Ein Fu&szlig;g&auml;nger rannte in mich und verschwand wortlos unter
meinem Auto."</P>

<P>"Ich habe noch nie Fahrerflucht begangen; im Gegenteil, ich mu&szlig;te
immer weggetragen werden."</P>

<P>"Ich &uuml;berfuhr einen Mann. Er gab seine Schuld zu, da ihm dies schon
einmal passiert war."</P>

<P>"Schon bevor ich ihn anfuhr, war ich davon &uuml;berzeugt, da&szlig;
dieser alte Mann nie die andere Strassenseite erreichen w&uuml;rde."</P>

<P>"Da sich der Fu&szlig;g&auml;nger nicht entscheiden konnte, nach welcher
Seite er rennen sollte, fuhr ich obendr&uuml;ber."</P>

<P>"Ein unsichtbares Fahrzeug kam aus dem Nichts, stie&szlig; mit mir
zusammen und verschwand dann spurlos."</P>

<P>"Nachdem ich vierzig Jahre gefahren war, schlief ich am Lenkrad
ein."</P>

<P>"Ich hatte den ganzen Tag Pflanzen eingekauft. Als ich die Kreuzung
erreichte, wuchs pl&ouml;tzlich ein Busch in mein Blickfeld, und ich konnte
das andere Fahrzeug nicht mehr sehen."</P>

<P>"Als ich eine Fliege erschlagen wollte, erwischte ich den Telefonmast."</P>

<P>"Der Pfosten raste auf mich zu, und als ich ihm Platz machen wollte,
stie&szlig; ich frontal damit zusammen."</P>

<P>"Zuerst sagte ich der Polizei, ich sei nicht verletzt, aber als ich den
Hut abnahm, bemerkte ich einen Sch&auml;delbruch."</P>

<P>"Als mein Auto von der Strasse abkam, wurde ich hinausgeschleudert.
Sp&auml;ter entdeckten mich so ein paar K&uuml;he in meinem Loch."</P>

<P>"Ich sah ein trauriges Gesicht langsam vor&uuml;berschweben. Dann schlug
der Herr auf dem Dach meines Wagens auf."</P>

<P>Ebenfalls aus einem Madrider Unfallbericht von einem Mann, der wegen
eines dringenden Bed&uuml;rfnisses auf der Landstrasse gehalten hatte,
worauf ein LKW in sein Auto fuhr.</P>

<P>"W&auml;hrend ich die Strasse normal befuhr, &uuml;berkam mich das
Verlangen, mich zu erleichtern, weswegen ich das Fahrzeug am Rand anhielt
und mich in ein nahes Geb&uuml;sch begab. Nachdem ich die Hosen
heruntergelassen hatte, kam der Gegner und gab's mir von hinten mit dem
Kipper."</P>

<P>Cord Hagen</P>
<HR>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

