<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Heike R&ouml;hl -->

<TITLE>Frauen</TITLE>
</HEAD>

<BODY background="bgc.gif" text="#000000" link="#0000ff" alink=
"#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<P align="center"><FONT color="#000080" size="7"><B>Frauen</B></FONT></P>

<P>Glaubt man der Bibel, so war die Frau im gro&szlig;en
Sch&ouml;pfungsplan zuerst gar nicht vorgesehen. Der Mann allein h&auml;tte
eigentlich vollkommen ausgereicht, um alles zu vergeigen, aber leider wurde
ihm langweilig und er hatte einfach keinen Bock mehr, andauernd nur an sich
selbst herumzugrabbeln.</P>

<P>Deshalb schnippelte er flinkerhand eine &uuml;berz&auml;hlige Rippe aus
seiner Seite und bestellte sich daf&uuml;r aus Thailand eine Frau. So oder
&auml;hnlich soll es gewesen sein.</P>

<P>Allerdings war der liebe Gott mit dieser Sonderlieferung am Wochenende
wohl doch ein wenig &uuml;berfordert, denn er sandte Freund Adam eine noch
ziemlich unausgegorene Mensch-Variante als Partner: ein Pimmel zuwenig,
viel zuviel Br&uuml;ste und genetisch bedingte Wahnvorstellungen, wie z. B.
der Irrglaube, in der Fu&szlig;g&auml;ngerzone tot umzufallen, wenn man
nicht mindesten zehn Minuten an jedem Schuhgesch&auml;ft stehen bleibt.</P>

<P>Ein Blick auf die weiblichen Chromosomen beweist auch heute noch ganz
eindeutig die Mangelhaftigkeit des Modells: zweimal X, das hei&szlig;t
zweimal durchgestrichen - sollte also eigentlich noch mal &uuml;berarbeitet
werden.</P>

<P>Trotzdem schaffte es die Frau, ihren Platz auf der Welt zu behaupten.
Konnte der Mann schon immer besser gucken als denken, so machte sie sich
diese Schw&auml;che zunutze und konnte schon bald besser aussehen als Auto
fahren.</P>

<P>Mit ein paar gezielten Pinselstrichen um Mund und Augen und der
Erweiterung des Dekollet&eacute;s in reziprokem Verh&auml;ltnis zur
K&uuml;rzung der Rockl&auml;nge gelang es ihr, selbst die verschachtelten
Gehirnwindungen eines Nobelpreistr&auml;gers in Sekundenschnelle auf einen
einzigen rudiment&auml;ren Rammelimpuls zu reduzieren.</P>

<P>Es l&auml;&szlig;t sich halt nicht leugnen - jeder Mann guckt ab und zu
mal "Baywatch", aber der Intellektuelle dreht wenigstens den Ton ab!
Inzwischen hat die Frau den Mann auf der Erfolgsspur l&auml;ngst
&uuml;berholt. Verona Feldsalat hat gezeigt, wie man durch einfaches
Nicht-kochen-k&ouml;nnen und Sich-scheiden-lassen zum Medienstar werden
kann.</P>

<P>Ein Supermegaweib wie Hera Lind kann gleichzeitig Kuchen backen, eine
Talk-Show leiten, ein Buch schreiben und Zwillinge geb&auml;ren. Und der
tschechische Nuklear-Tittenbomber Dolly Buster beweist, wie leicht man
defizit&auml;re Schulbildung durch ein paar Zentner Silikon in der Bluse
wieder ausgleichen kann.</P>

<P>Akzeptieren wir es: M&auml;nner werden nicht mehr wirklich gebraucht.
Frauen k&ouml;nnen allein ihr Geld verdienen, ohne unsere Hilfe Bier
trinken, Fu&szlig;ball gucken und im Notfall sogar einen fahren lassen.</P>

<P>Und irgendwann - nur um uns endg&uuml;ltig zu dem&uuml;tigen - werden
sie anfangen, im Stehen zu pinkeln. Frauen k&ouml;nnen so gemein
sein...</P>

<P>Heike<BR>
www.mc-snapdragon.de</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

