<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Heike R&ouml;hl -->

<TITLE>Arche Noah damals und heute</TITLE>
</HEAD>

<BODY background="bgg.gif" text="#000000" link="#0000ff" alink=
"#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<P align="center"><FONT color="#000080" size="7"><B>Arche Noah damals und
heute</B></FONT></P>

<P>Selbst Noah hat im heutigen Europa seine Probleme:-)))))))</P>

<P>Nach vielen Jahren sah Gott wieder einmal auf die Erde. Die Menschen
waren verdorben und gewaltt&auml;tig und er beschloss, sie zu vertilgen,
genau so, wie er es vor langer langer Zeit schon einmal getan hatte.</P>

<P>Er sprach zu Noah: "Noah, bau mir noch einmal eine Arche aus Zedernholz,
so wie damals: 300 Ellen lang, 50 Ellen breit und 30 Ellen hoch. Ich will
eine zweite Sintflut &uuml;ber die Erde bringen. Die Menschen haben nichts
dazu gelernt. Du aber gehe mit deiner Frau, deinen S&ouml;hnen und deren
Frauen in die Arche und nimm von allen Tieren zwei mit, je ein
M&auml;nnchen und ein Weibchen. In sechs Monaten werde ich den gro&szlig;en
Regen schicken."</P>

<P>Noah st&ouml;hnte auf; musste das denn schon wieder sein? Wieder 40 Tage
Regen und 150 unbequeme Tage auf dem Wasser mit all den l&auml;stigen
Tieren an Bord und ohne Fernsehen! Aber Noah war gehorsam und versprach,
alles genau so zu tun, wie Gott ihm aufgetragen hatte.</P>

<P>Nach sechs Monaten zogen dunkle Wolken auf und es begann zu regnen. Noah
sah in seinem Vorgarten und weinte und, denn da war keine Arche.</P>

<P>"Noah",rief der Herr, "Noah, wo ist die Arche?"</P>

<P>Noah blickte zum Himmel und sprach: "Herr, sei mir gn&auml;dig" und
verstummte.</P>

<P>Gott fragte abermals: "Wo ist die Arche, Noah?"</P>

<P>Da trocknete Noah seine Tr&auml;nen und sprach: "Herr, was hast du mir
angetan? Als Erstes beantragte ich beim Landkreis eine Baugenehmigung. Die
dachten zuerst, ich wollte einen extravaganten Schafstall bauen. Die kamen
mit der ausgefallenen Bauform nicht zurecht, denn an einen Schiffbau
wollten sie nicht glauben. Auch deine Ma&szlig;angaben stifteten
Verwirrung, weil niemand mehr wei&szlig;, wie lang eine Elle ist. Also
musste mein Architekt einen neuen Plan entwerfen.</P>

<P>Die Baugenehmigung wurde mir zun&auml;chst abgelehnt, weil eine Werft in
einem Wohngebiet planungsrechtlich unzul&auml;ssig sei. Nachdem ich dann
endlich ein passendes Gewerbegrundst&uuml;ck gefunden hatte, gab es nur
noch Probleme. Im Moment geht es z. B. um die Frage, ob die Arche
feuerhemmende T&uuml;ren, eine Sprinkleranlage und einen
L&ouml;schwassertank ben&ouml;tige. Auf einen Hinweis, ich h&auml;tte im
Ernstfall rundherum genug L&ouml;schwasser, glaubten die Beamten, ich
wollte mich &uuml;ber sie lustig machen. Als ich ihnen erkl&auml;rte, das
Wasser k&auml;me noch in gro&szlig;en Mengen, und zwar viel mehr als ich
zum L&ouml;schen ben&ouml;tigte, brachte mir das den Besuch eines Arztes
vom Landeskrankenhaus ein.</P>

<P>Er wollte von mir wissen, was ein Schiffbau auf dem Trockenen, fernab
von jedem Gew&auml;sser, solle. Die Bezirksregierung teilte mir daraufhin
telefonisch mit, ich k&ouml;nnte ja gern ein Schiff bauen, m&uuml;sste aber
selbst zusehen, wie es zum n&auml;chsten gr&ouml;&szlig;eren Fluss
k&auml;me. Mit dem Bau eines Sperrwerks k&ouml;nnte ich nicht rechnen,
nachdem der Ministerpr&auml;sident zur&uuml;ckgetreten sei.</P>

<P>Dann rief mich noch ein anderer Beamter dieser Beh&ouml;rde an, der mir
erkl&auml;rte, sie seien inzwischen ein kundenorientiertes
Dienstleistungsunternehmen und darum wolle er mich darauf hinweisen, dass
ich bei der EU in Br&uuml;ssel eine Werftbeihilfe beantragen k&ouml;nne;
allerdings m&uuml;sste der Antrag achtfach in den drei Amtssprachen
eingereicht werden.</P>

<P>Inzwischen ist beim Verwaltungsgericht ein vorl&auml;ufiges
Rechtsschutzverfahren meines Nachbarn anh&auml;ngig, der einen
Gro&szlig;handel f&uuml;r Tierfutter betreibt. Der h&auml;lt das Vorhaben
f&uuml;r einen gro&szlig;en Werbegag - mein Schiffbau sei nur darauf
angelegt, ihm Kunden abspenstig zu machen.</P>

<P>Ich habe ihm schon zwei Mal erkl&auml;rt, dass ich gar nichts verkaufen
wolle. Er h&ouml;rt mir gar nicht zu und das Verwaltungsgericht hat
offenbar auch viel Zeit.</P>

<P>Die Suche nach dem Zedernholz habe ich eingestellt. Libanesische Zedern
d&uuml;rfen nicht mehr eingef&uuml;hrt werden. Als ich deshalb hier im Wald
Bauholz beschaffen wollte, wurde mir das F&auml;llen von B&auml;umen -
unter Hinweis auf das Landeswaldgesetz verweigert. Dies sch&auml;dige den
Naturhaushalt und das Klima. Au&szlig;erdem sollte ich erst eine
Ersatzaufforstung nachweisen.</P>

<P>Mein Einwand, in K&uuml;rze werde es gar keine Natur mehr geben und das
Pflanzen von B&auml;umen an anderer Stelle sei deshalb v&ouml;llig sinnlos,
brachte mir den zweiten Besuch des Arztes vom Landeskrankenhaus ein.</P>

<P>Die angeheuerten Zimmerleute versprachen mir schlie&szlig;lich, f&uuml;r
das notwendige Holz selbst zu sorgen. Sie w&auml;hlten jedoch erst einmal
einen Betriebsrat. Der wollte mit mir zun&auml;chst einen Tarifvertrag
f&uuml;r den Holzschiffbau auf dem flachen Lande ohne Wasserkontakt
aushandeln. Weil wir uns aber nicht einig wurden, kam es zu einer
Urabstimmung und zum Streik.</P>

<P>Herr, wei&szlig;t du eigentlich, was Handwerker heute verlangen? Wie
soll ich denn das bezahlen?</P>

<P>Weil die Zeit dr&auml;ngte, fing ich schon einmal an, Tiere
einzusammeln. Am Anfang ging das noch ganz gut, vor allem die beiden
Ameisen sind noch immer wohlauf. Aber seit ich zwei Tiger und zwei Schafe
von der Notwendigkeit ihres gemeinsamen und friedlichen Aufenthaltes bei
mir &uuml;berzeugt hatte, meldete sich der &ouml;rtliche Tierschutzverein
und r&uuml;gte die artwidrige Haltung. Und mein Nachbar klagt auch schon
wieder, weil er auch die Er&ouml;ffnung eines Zoos f&uuml;r
gesch&auml;ftssch&auml;digend h&auml;lt.</P>

<P>Herr, ist dir eigentlich klar, dass ich auch nach der Europ&auml;ischen
Tierschutztransportverordnung eine Genehmigung brauche? Ich bin schon auf
Seite 22 des Formulars und gr&uuml;ble im Moment dar&uuml;ber, was ich als
Transportziel angeben soll. Und wusstest du, dass z. B Geweih tragende
Tiere w&auml;hrend der Brunftzeit &uuml;berhaupt nicht transportiert werden
d&uuml;rfen? Und die Hirsche sind st&auml;ndig am Schnackseln, wie
F&uuml;rstin Gloria sagen w&uuml;rde und auch der gemeine Elch und Ochse
denken an nichts anderes, besonders die s&uuml;dlicheren! Herr, wusstest du
das?</P>

<P>&Uuml;brigens, wo hast du eigentlich die Callipepia caliconica - du
wei&szlig;t schon, die Schopfwachteln und den Lethamus Discolor versteckt?
Den Schwalbensittich habe ich bisher auch nicht finden k&ouml;nnen. Dir ist
nat&uuml;rlich auch bewusst, dass ich die 43 Vorschriften der
Binnenmarkt-Tierschutzverordnung bei dem Transport der Kaninchen strikt
beachten muss. Meine Rechtsanw&auml;lte pr&uuml;fen gerade, ob diese
Vorschriften auch f&uuml;r Hasen gelten.</P>

<P>&Uuml;brigens: wenn du es einrichten k&ouml;nntest, die Arche als
fremdflaggiges Schiff zu deklarieren, das sich nur im Bereich des deutschen
K&uuml;stenmeeres aufh&auml;lt, bek&auml;me ich die Genehmigung viel
einfacher. Du k&ouml;nntest dich doch auch einmal f&uuml;r mich
bem&uuml;hen. Ein Umweltsch&uuml;tzer von Greenpeace erkl&auml;rte mir,
dass ich G&uuml;lle, Jauche, Exkremente und Stallmist nicht im Wasser
entsorgen darf.</P>

<P>Wie stellst du dir das eigentlich vor? Damals ging es doch auch!</P>

<P>Vor zwei Wochen hat sich das Oberkommando der Marine bei mir gemeldet
und von mir eine Karte der k&uuml;nftig &uuml;berfluteten Gebiete erbeten.
Ich habe ihnen einen blau angemalten Globus geschickt. Und vor zehn Tagen
erschien die Steuerfahndung; die haben den Verdacht, ich bereite meine
Steuerflucht vor. Ich komme so nicht weiter Herr, ich bin verzweifelt! Soll
ich nicht doch lieber meinen Rechtsanwalt mit auf die Arche nehmen?"</P>

<P>Noah fing wieder an zu weinen.</P>

<P>Da h&ouml;rte der Regen auf, der Himmel klarte auf und die Sonne schien
wieder. Und es zeigte sich ein wundersch&ouml;ner Regenbogen.</P>

<P>Noah blickte auf und l&auml;chelte. "Herr, du wirst die Erde doch nicht
zerst&ouml;ren?"</P>

<P>Da sprach der Herr: "Darum sorge ich mich nicht mehr, das schafft schon
eure Verwaltung!"</P>

<P>Heike<BR>
www.mc-snapdragon.de</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

