<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Heike R&ouml;hl -->

<TITLE></TITLE>
</HEAD>

<BODY background="bgg.gif" text="#000000" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<P align="center"><FONT color="#000080" size="7"><B>Ein Text einfach zum
Nachdenken</B></FONT></P>

<P align="center"><FONT color="#000080" size="5"><B>Das Gespr&auml;ch
zwischen einem Hund und seinem Halter</B></FONT></P>

<TABLE border="0" summary="">
<TR><TD colspan="2">Hallo? Hallo! Haaalllooo!!</TD></TR>

<TR><TD colspan="2">Mensch schaut verwirrt um sich, da er doch allein
Zuhaus mit Hund ist.</TD></TR>

<TR><TD valign="top">Wieder:</TD>
<TD>Hallo! Hallo, so h&ouml;rst du denn nicht Mensch?</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Ja, ich h&ouml;re, wer spricht denn da?</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Ich bin es, dreh dich doch mal um Mensch!</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Hund, bist du das?</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Ja, ich bin es, warum h&ouml;rst du nicht wenn ich dich rufe?</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Aber, Hunde k&ouml;nnen doch nicht sprechen!</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Doch k&ouml;nnen sie, ihr h&ouml;rt es nur einfach nicht.</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>H&ouml;ren? Ja, aber wie denn?</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Wir schauen euch an und sprechen, wir geben euch die Pfoten, wir legen
unsere Ohren vor oder zur&uuml;ck und manchmal, aber auch nur wenn ihr uns
schlecht behandelt, zeigen wir auch die Z&auml;hne, nur ihr wollt uns
einfach nicht h&ouml;ren.</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Hund, wenn ich gewu&szlig;t h&auml;tte das du sprechen kannst,
h&auml;tte ich dir doch zugeh&ouml;rt.</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Siehst du, Mensch. Du hast schon wieder nicht zugeh&ouml;rt, ich habe
es dir doch soeben erkl&auml;rt.</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Hund, du hast recht und ich verspreche dir Besserung.</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Mensch, wir mu&szlig;ten auch eure Sprache lernen, ist es da zuviel
verlangt wenn wir von euch erwarten das ihr wenigstens versucht uns zu
verstehen?</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Nein Hund, du hast vollkommen recht. Aber das ich dich jetzt so
h&ouml;ren kann, hat das einen Grund?</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Ja, das hat es in der Tat.</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Trage mir dein Anliegen vor!</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Es geht darum was ihr Menschen mit uns tut.</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Was tun wir denn mit euch?</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Ihr foltert uns!</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Aber wieso das? Habe ich dich jemals schlecht behandelt? Habe ich nicht
immer daf&uuml;r gesorgt, dass es dir an nichts mangelt?</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Mensch, was ich zum Leben brauche gibst du mir und auch an Zuneigung
sparst du nicht, aber...</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Aber was? Erkl&auml;re mir bitte was du meinst.</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Es geht nicht nur um mich, es geht um alle Hunde zusammen!</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Ich verstehe dich nicht ganz!</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Also gut, Frage: Unterteilen wir euch etwa in verschiedene Rassen?</TD>
</TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Ich wei&szlig; nicht, tut ihr es?</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Nein, aber ihr tut es!</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Ist das ein Problem f&uuml;r euch?</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>An und f&uuml;r sich nicht, aber einige von uns sind derzeit arm dran
und auch uns anderen, vor allem uns Gro&szlig;en geht es nicht gut!</TD>
</TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Hund, erkl&auml;re mir das bitte genauer.</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Einige von uns von euch unterteilte Rassen zumeist, wurden schlecht
behandelt. Manche wurden einfach zueinander getan und in schlimmen
F&auml;llen in Keller gesperrt. Wir haben Angst und niemand kommt, um uns
zu tr&ouml;sten, unregelm&auml;&szlig;ig und selten bekommen wir Futter und
Wasser. Einige fressen sogar Ratten vor lauter Hunger. Wochen, manchmal
Monatelang k&ouml;nnen wir die Sonne nicht sehen und das Gras nicht
riechen. In vielen F&auml;llen sind wir wenigstens noch zu zweit und wir
tr&ouml;sten uns gegenseitig und haben uns lieb, manchmal auch so sehr,
dass wir auch noch Nachwuchs bekommen, aber unseren Kindern geht es auch
nicht gut. Den M&uuml;ttern geht es an die Gesundheit ihre Kinder zu
n&auml;hren und die Kleinen werden schw&auml;cher, weil keine Milch mehr da
ist. Wir haben Angst, dass unsere Kinder nicht &uuml;berleben.</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Hund, das ist ja furchtbar. Mir dr&uuml;ckt das Herz!</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>H&ouml;r weiter zu! Eines Tages kommen die Folterer und bringen
Menschen mit und obwohl es uns so schlecht geht, freuen wir uns. Wir wedeln
mit den Ruten und begr&uuml;&szlig;en den Besuch, doch anscheinend ist es
nicht erw&uuml;nscht, denn schon bald bekommen wir durch Tritte zu
sp&uuml;ren, dass wir uns nicht freuen sollen. Die Mutter scheint zu
sp&uuml;ren, dass etwas nicht stimmt. Sie f&auml;ngt an zu knurren und
zeigt den Menschen die Z&auml;hne. Mit Gegenst&auml;nden schlagen sie auf
sie ein und sie bleibt regungslos in einer Ecke liegen. Dann nehmen sie die
Babys hoch. Sie packen sie im Nacken und die Kleinen schreien und strampeln
heftig, doch man l&auml;&szlig;t sie nicht los und so schnappen einige von
ihnen in die Luft. Das scheint die Menschen zu freuen und eine Menge Geld
wandert von einer Menschenhand in die Andere. Tag f&uuml;r Tag kommen die
Menschen, bis alle Babys weg sind. Ihre Mutter r&uuml;hrt sich noch immer
nicht.</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Hund, was hat das mit mir zu tun?</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Wir brauchen eure Hilfe, darum h&ouml;r mir weiter zu! Es vergehen
viele Tage ohne Futter und Wasser f&uuml;r den Vater der Babys und der
Hunger wird immer gr&ouml;&szlig;er. Die Mutter hat sich seit Tagen nicht
mehr ger&uuml;hrt und es beginnt sich ein Geruch auszubreiten, den wohl
jedes Tier kennt. Der Vater &uuml;berlegt noch, ehe er sich angewiedert
daran macht die Mutter aufzufressen, das ist der &Uuml;berlebungsinstinkt
den wir Hunde haben. Irgendwann kommen wieder Menschen und er fletscht
seine Z&auml;hne und knurrt so laut er kann. Er h&ouml;rt einen der
Menschen sprechen, der sagt Jetzt ist er soweit. Jetzt hast du einen guten,
scharfen Hund und er wird Dir viel Geld einbringen. Die Menschen nehmen ihn
mit nach drau&szlig;en. Und obwohl er knurrt und die Z&auml;hne zeigt, wagt
er nicht die Menschen zu bei&szlig;en, weil er nicht vergessen hat was
seiner Gef&auml;hrtin widerfahren ist. Er wartet ab und geht folgsam, ohne
Strick mit den Menschen auf die Stra&szlig;e. Er verh&auml;lt sich ruhig,
um nicht aufzufallen und die Menschen werden unachtsam. In einer
g&uuml;nstigen Minute rennt er los. Er rennt so lange und so weit ihn die
Pfoten tragen und erst als er sicher ist, dass sie ihn nicht mehr
verfolgen, l&auml;uft er gem&auml;chlich durch die Stra&szlig;en.
Zwischendurch schl&auml;ft er in verborgenen Ecken oder unter
Str&auml;uchern. Doch nach einiger Zeit bekommt er Hunger und n&auml;hert
sich den H&auml;usern der Menschen. Er riecht an den M&uuml;llboxen das
dort etwas Fre&szlig;bares drin sein mu&szlig;. Er schubst die Boxen um,
was nat&uuml;rlich L&auml;rm macht. Doch der Hunger ist st&auml;rker als
der Fluchttrieb und so bleibt er stehen.</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Hund, so komm auf den Kern der Sache, ich kann dir kaum folgen!</TD></TR>

<TR><TD valign="top">Hund:</TD>
<TD>Gleich, Mensch gleich wirst du verstehen! Der L&auml;rm macht die
Menschen aufmerksam, die, sobald sie sehen, dass sich ein hungriger
Streuner an den Boxen zu schaffen macht, mit Kn&uuml;ppeln auf ihn
einschlagen und schlie&szlig;lich noch mit Steine bewerfen. Der Hund
fl&uuml;chtet, aber er hat sich gemerkt, dass die Menschen nicht nett sind
und ist bereit sein Leben zu verteidigen. So begibt es sich, dass ein
anderer Mensch mit Taschen daherl&auml;uft aus denen es verf&uuml;hrerisch
riecht. Auf leisen Pfoten folgt der Hund dem Duft und als der Mensch kurz
wegschaut, getraut er sich, seine Nase hineinzustecken. Jedoch bemerkt der
Mensch das und fuchtelt mit den Armen herum und schaut den Hund b&ouml;se
an. Der Hund f&uuml;rchtet erneute Schmerzen und bei&szlig;t mal hier, mal
dort hin. Der Mensch liegt am Boden, doch in dem Augenblick erinnert sich
der Hund an all die Qualen die er erleiden mu&szlig;te und seine Wut wird
immer gr&ouml;&szlig;er und er handelt wie unter einem Zwang. Er
f&uuml;rchtet, wenn er losl&auml;st, dass die Schmerzen niemals mehr
aufh&ouml;ren und h&auml;lt fest. Dann ein lautes Ger&auml;usch! Etwas
warmes l&auml;uft an seinem K&ouml;rper herunter und ihm schwinden die
Sinne. Dann wird es um ihn herum dunkel. Er hat keine Schmerzen mehr und er
kann nichts mehr h&ouml;ren. Er schwebt ins angenehme Nichts. Die Augen
schlie&szlig;en sich und lautlos geht er dahin wo seine Leidensgenossen
bereits seit langem sind. Hund Und weil solche schlimmen Dinge geschehen
sind, sollen wir anderen alle b&uuml;&szlig;en. Die Menschen begreifen
nicht, das sie die B&ouml;sen sind. Und andere Menschen lassen uns jetzt
leiden. Wir bekommen so seltsame Dinger um die Schnauze, die scheuern an
den Leftzen und hindern uns daran zu hecheln, was aber doch sehr wichtig
ist, weil wir nicht anders Schwitzen k&ouml;nnen. Dann sind wir auch noch
an den Strick gefesselt und wir d&uuml;rfen uns nicht mehr frei bewegen.
Wir sind dar&uuml;ber ver&auml;rgert und brummeln auch manchmal unsere
Artgenossen an. Wir verstehen uns ja selbst nicht mehr, da diese Dinger
unsere eigene Sprache unkenntlich machen, was zu Verwechselungen
untereinander f&uuml;hrt. Wir langweilen uns und manche lecken sich zu
Hause auf ihren Decken die Pfoten oder wir bei&szlig;en uns irgendwo, bis
wir den Schmerz sp&uuml;ren. Warum nehmen sich einige Menschen das Recht
heraus, uns zu foltern? Warum darf ich nicht mehr mit meinem Stock oder dem
Ball auf der Wiese toben, was mich immer so angenehm m&uuml;de macht?
Zuhause darf ich nicht bellen, drau&szlig;en durfte ich vorher immer, aber
mit diesem Ding auf der Schnauze kann ich es auch dort nicht mehr tun. Der
Ball war auch nichts f&uuml;r die Wohnung, da die anderen Menschen im Haus
sich dadurch gest&ouml;hrt f&uuml;hlen. Wie und wo sollen wir uns jetzt
austoben? Mensch, ich kann dir leider nicht garantieren das ich
fr&ouml;hlich bleibe und dazu noch immer nett und freundlich bin, alles und
jedem gegen&uuml;ber. Mir fehlt das Spielen und Rennen und ich m&ouml;chte
auch meine vierbeinigen Freunde wiedersehen und mit ihnen herumbalgen
k&ouml;nnen. Ihr unterhaltet euch doch auch und spielt auch eure Spiele.
Ist unser Leben denn weniger Wert als eures?</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Hund, ich wei&szlig; was du mir sagen wolltest. Ich schreibe die
Geschichte auf und sorge daf&uuml;r das noch viele Menschen sie lesen. Und
ich hoffe das auch sie begreifen werden, was du uns damit mitteilen
wolltest. Hund, ist es das, was du m&ouml;chtest?</TD></TR>

<TR><TD valign="top">Mensch:</TD>
<TD>Hund? Hund! Huuunnnd! Warum sagst du nichts mehr?</TD></TR>

<TR><TD colspan="2">Der Hund schaut seinen Menschen offen an und
schl&auml;gt mit der Rute schnell hin und her. Er hebt die Pfote und der
Mensch begreift, dass der Hund mit ihm spricht. Er nimmt die Pfote wie zum
Handschlag und nimmt sich fest vor, die Geschichte weiterzugeben.</TD></TR>
</TABLE>

<P>Heike</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

