<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Heike R&ouml;hl -->

<TITLE>Ein Ratgeber f&uuml;r alle Katzen</TITLE>
</HEAD>

<BODY background="bgd.gif" text="#000000" bgcolor="#b0b0b0"> <TABLE
width="100%" border="0" cellpadding="8" summary=""> <TR> <TD> <P
align="center"><FONT color="#000080" size="7"><B>Ein Ratgeber f&uuml;r alle
Katzen</B></FONT></P>

<P>Die meisten Katzen wissen instinktiv, wie man sich richtig benimmt, es
gibt aber bestimmt einige, die von den nachfolgenden Tipps profitieren.
Denkt daran, dass es nur Vorschl&auml;ge sind und der jeweiligen Situation
angepasst werden k&ouml;nnen.</P>

<H3>Es ist serviert!</H3>

<P>Fresse niemals aus Deiner eigenen Sch&uuml;ssel, wenn Du Essen vom Tisch
klauen kannst.</P>

<P>Trinke niemals aus Deiner Wassersch&uuml;ssel, wenn irgendwo ein Glas
Wasser (oder besser noch, mit Milch) steht, aus dem Du trinken kannst.</P>

<P>Jammere niemals vor Hunger bevor die Leute das Futter aus dem Schrank
nehmen. Schreie dann aber so, als ob Du seit Wochen nichts mehr zu fressen
bekommen hast.</P>

<P>Sobald das Futter in der Sch&uuml;ssel ist, sollte es erst mal ignoriert
werden.</P>

<H3>G&auml;ste!</H3>

<P>Setze eine &uuml;berraschte und verletzte Miene auf,
wenn Du beschimpft wirst, weil Du nach dem Essen auf dem Tisch zwischen dem
Geschirr spazieren gehst.</P>

<P>Der Ausdruck sollte besagen: " Aber wenn kein Besuch da ist, darf ich
das doch auch!"</P>

<P>Wenn Du einen Scho&szlig; zum Sitzen aussuchst, achte immer darauf, dass
dieser auch einen guten Kontrast zu Deiner Fellfarbe abgibt. Beispiel: eine
wei&szlig;e Katze sollte sich immer auf dunkle Sch&ouml;&szlig;e
setzen.</P>

<P>Begleite G&auml;ste immer zur Toilette und beobachte, ob sie auch alles
richtig machen.</P>

<P>Falls ein Gast sagen sollte, dass er Katzen liebe, behandle ihn mit
hochm&uuml;tigem Stolz, verh&auml;nge Deine Krallen in den
Nylonstr&uuml;mpfen (falls zutreffend), bei&szlig;e ihn in die
Fu&szlig;kn&ouml;chel oder wende eine Kombination der ausgef&uuml;hrten
M&ouml;glichkeiten an.</P>

<H3>T&uuml;ren!</H3>

<P>Toleriere keine geschlossenen T&uuml;ren. Um die T&uuml;ren zu
&ouml;ffnen kann man entweder daran kratzen oder dagegen schlagen. Sobald
die T&uuml;r ge&ouml;ffnet wird, darf man selbstverst&auml;ndlich nicht
durchgehen.</P>

<P>Nachdem Du befohlen hast, dass eine nach drau&szlig;en f&uuml;hrende
T&uuml;r f&uuml;r Dich ge&ouml;ffnet wird, stehe auf der Schwelle, halb
innen und halb au&szlig;en, und fange an, &uuml;ber alles m&ouml;gliche
nachzudenken. Das ist vor allem wichtig, wenn es entweder sehr kalt oder
sehr hei&szlig; ist und w&auml;hrend der Schnaken-Hochsaison.</P>

<H3>Waschtag!</H3>

<P>Setze Dich niemals in den Waschkorb mit dreckiger W&auml;sche, warte bis
alles sauber ist und vielleicht gar warm vom Trockner. Dieses ist sehr
wichtig, vor allem bei Handt&uuml;chern.</P>

<P>Helfe stets beim W&auml;schezusammenlegen. Zeige es den Leuten, wenn sie
es Deiner Meinung nach nicht richtig gemacht haben, indem Du die
W&auml;sche rumziehst.</P>

<P>Hilf stets beim Bettenmachen. Laken und Bettbez&uuml;ge m&uuml;ssen
angegriffen und gebissen werden, um sie gef&uuml;gig zu machen.</P>

<H3>Zusammenleben mit Menschen!</H3>

<P>Als allgemeine Regel gilt, dass man sich immer zu dem Menschen setzt,
der besch&auml;ftigt ist und nicht zu dem, der im Moment nichts tut.</P>

<P>Liest einer Deiner Menschen ein Buch oder eine Zeitung, versuche immer,
Dich darauf zu setzen. Wenn das nicht m&ouml;glich ist, so setze Dich
zwischen Buch und Gesicht.</P>

<P>Falls Dein Mensch strickt, setze Dich ganz brav auf seinen Scho&szlig;.
Vergiss aber nicht, ab und zu die Stricknadeln anzugreifen.</P>

<P>Wenn Dein Mensch beim Briefe schreiben oder &auml;hnlichem ist, setze
Dich immer auf die Papiere, auf denen er gerade schreibt. Wenn sie Dich
herunterheben, beobachte sie mit trauriger Miene. Pass gut auf, ob
vielleicht mit Tinte geschrieben wird. Sobald Du noch feuchte Tinte auf
Papier siehst, setze Dich drauf. Nach dem zweiten Hinunterheben musst Du
anfangen Kugelschreiber und Bleistifte vom Tisch zu werfen, aber einzeln
bitte.</P>

<P>Auch Schreibmaschinen sollte der Mensch nicht alleine bedienen
m&uuml;ssen. Setze Dich auf den Scho&szlig; Deines Menschen und versuche,
die Typen zu fangen. Wenn es an der Zeit ist, Papier zu bei&szlig;en, dann
warte, bis der Mensch ein perfekt getipptes Blatt aus der Maschine
zieht.</P>

<P>Noch sch&ouml;ner sind Computer. Warte, bis das Telefon klingelt und der
Mensch den Computer verl&auml;sst und spiele "Katze auf der Tastatur". Du
wirst staunen, was Du alles auf dem Bildschirm sehen kannst.</P>

<P>Das waren einige Richtlinien, Du kannst weiter improvisieren. Denke
daran, dass eine erfolgreiche Katze immer gut ausgeruht ist; schlafe
deshalb fast den ganzen Tag damit Du nachts um 3 Uhr fit bist, um auf dem
Bett Bergsteigen oder M&auml;usefangen zu spielen.</P>

<P>Heike<BR>
www.mc-snapdragon.de</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

