<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Andreas Guldner -->

<TITLE>Meister?</TITLE>
</HEAD>

<BODY background="nc_bg2.jpg" text="#000000" link="#000000"
vlink="#0000ff" alink="#000055">
<BR>
<BR>
     

<TABLE width="100%" border="0" cellpadding="10" summary="">
<TR>
<TD>
<H1 align="center"><B>Meister</B></H1>

<P>Nun soll es mit Deregulierungen aufw&auml;rts gehen und weil wir am
Amiga mit dem Thema "der Weg in die Zukunft" ja &Uuml;bung haben, dachte
ich kann ein Beispiel f&uuml;r Realit&auml;tsverlust bei Verantwortlichen
hier niemanden schocken.</P>

<P>Als Handwerker glaubte ich eine sichere Zukunft zu haben aber da habe
ich wohl unsere allseits geliebten Politiker vergessen. Denn sobald es
schwierig wird regiert die Vereinfachung in Deutschland. Um die
wohlbekannten Probleme am Arbeitsmarkt und in der Ausbildung billig
abzuschieben wirft man kurz und ohne Nachzudenken die Schuld an der Misere
den "&uuml;berkommenen" Regeln vor und z&auml;hlt dazu den
Handwerksmeister.</P>

<P>Es mag ja in diesem Lande zu einigen Zeiten ein Zunftunwesen gegeben
haben das die Interessen einiger Gr&uuml;ppchen gegen die Mehrheit der
Bev&ouml;lkerung durchgesetzt hat, aber das ist schon sehr lange vorbei!
Als Literatur zum Verst&auml;ndnis des gewesenen k&ouml;nnte ich hier "Das
Deutsche Handwerk" von Eduard Otto, ISBN 3-8289-0789-X, nennen. Dieses Buch
erschien erstmals 1899 und wurde bis zur vierten Auflage 1912 bearbeitet.
Der mir vorliegende Nachdruck ist im Weltbild-Verlag erschienen 2003. Das
Buch bietet eine gute &Uuml;bersicht des Zunftwesens der vergangenen
Jahrhunderte und der Urspr&uuml;nge mancher Tradition. Doch heute sind wir
im Jahr 2003 und fast alles was einmal war hat sich ge&auml;ndert!</P>

<P>Ob nun jede Ver&auml;nderung zum Vorteil der Handwerker und ihrer Kunden
war, will ich hier nicht einzeln zerpfl&uuml;cken, aber den Meisterbrief
als Hemmnis darzustellen und so zu tun als w&auml;ren Regeln nur gut wenn
sie neu sind grenzt schon an Wahnvorstellungen. Man kann in einem Land wie
unserem, ohne Bodensch&auml;tze oder Billigarbeitskr&auml;fte nur im
Bereich des K&ouml;nnens und Wissens dauerhaft Konkurrenzf&auml;higkeit
schaffen! Dazu geh&ouml;rt au&szlig;er den Akademikern auch der mehr
praktisch orientierte Facharbeiter und Handwerker. Leider will mancher
Eurokrat nun alles auf kleinstem gemeinsamen Nenner gleichschalten und
treibt damit uns weiter in den Abgrund. Denn die Grundlagen sind sehr
einfach zu erkl&auml;ren: Auftrag = Arbeitnehmerbedarf =
Arbeitspl&auml;tze, weniger Auftr&auml;ge = weniger Arbeitspl&auml;tze;
statt diese Gegebenheiten zu betrachten und die einzige L&ouml;sung zu
versuchen (mehr Auftr&auml;ge) glaubt ein Wirtschaftsminister an "billigere
Arbeitskr&auml;fte = mehr Besch&auml;ftigte".</P>

<P>Was hat das jetzt mit dem Meister zu tun? Ganz einfach : durch Verzicht
auf einen Meisterbrief als Grundlage zur Selbst&auml;ndigkeit sollen neue
Firmen und Arbeitspl&auml;tze entstehen. Au&szlig;erdem soll die
Ausf&uuml;hrung einfacher T&auml;tigkeiten durch angelernte
Hilfskr&auml;fte erlaubt sein. Hier denkt wohl einer an den (Flop) Ich-AG
als Jobmaschine? Das die m&ouml;glichen Kunden ohne Entlastung keine
zus&auml;tzlichen Auftr&auml;ge vergeben werden, vergessen hier einige. Es
ist sogar derzeit so, dass einige Firmen im Verlustbereich Arbeiten
ausf&uuml;hren nur um ihr Personal zu besch&auml;ftigen und weil die
meisten Handwerker nur kleine Betriebe haben und auch selbst mit ihrem
Privatbesitz voll mitdrinh&auml;ngen wird es in naher Zukunft sicher eher
weniger Arbeits- und Ausbildungspl&auml;tze geben! Das gerade die
Handwerker viel ausbilden hilft zwar noch die Rationalisierungen der
Industrie nicht zur Massenarbeitslosigkeit der Jugend werden zu lassen, auf
Dauer wird aber eine kleinere Zahl an Handwerkern nat&uuml;rlich auch
weniger Leute ausbilden k&ouml;nnen! Vorrausetzung zum Ausbilden ist
&uuml;brigens der Meisterbrief, weil erst in der Fortbildung zum Meister
auch Kaufm&auml;nnische und Personalf&uuml;hrungs-Techniken gelehrt werden.
Im Vergleich zum Gesellen ist die Meisterausbildung erheblich umfangreicher
und bildet auch eine weitere Bef&auml;higungspr&uuml;fung um m&ouml;glichst
viel K&ouml;nnen und Wissen zu sichern.</P>

<P>Wenn die Handwerker also keine mittelalterlichen Z&uuml;nftler geblieben
sind, sondern sich fortbilden und auch engagiert um den Erhalt von Arbeit
bem&uuml;hen, sollten sich Politiker nicht als Landv&ouml;gte benehmen und
zuerst vor ihrer eigenen T&uuml;r kehren. Die Hauptpreistreiber im Handwerk
sind der Staat mit einem B&uuml;rokratiewasserkopf und hohen Steuern,
genauso wie die M&ouml;chtegernelite von Pseudowissenden welche trotz
Beratung vermeintlich billigere L&ouml;sungen haben m&uuml;ssen nur damit
zum Schluss die Gesamtkosten explodieren. Es w&auml;re f&uuml;r alle von
Vorteil, wenn Argumente die Schlagworte ersetzen w&uuml;rden.</P>

<P>Die erhoffte Wirkung einer Freigabe einzelner T&auml;tigkeiten und der
Verzicht auf Eignungsnachweise als Gesch&auml;ftsgrundlage gibt es nur in
den Tr&auml;umen der Ahnungslosen, denn die Billigarbeiter m&uuml;ssen ja
hier im Hochpreisland leben und nur Illegale oder Saisonarbeiter aus
Entwicklungsl&auml;ndern k&ouml;nnten mit sehr geringen L&ouml;hnen
problemlos auskommen. Der Knackpunkt bleibt also unser Verwaltungsmonster
Staat, wo man auf eine &Auml;nderung im eigenen Haus keinen Wert legt und
wo zuerst per Steuer die Kosten hochgetrieben werden und anschlie&szlig;end
stellt man sich zum B&uuml;rger und beklagt die hohen Preise. Dass viele
Handwerker schon jetzt nur unter Durchschnitt verdienen (bei 40 h Woche)
bleibt oft unerw&auml;hnt und ergibt dann das Zerrbild vom unflexiblen
geldgierigen Pfuscher der nie Zeit hat.</P>

<P>Mit mehr Ehrlichkeit in der Diskussion um den Weg aus der Krise
w&uuml;rde auch das "schwarze Peter" Spiel und die fruchtlose
Verschleierung von EU-weiten Regelungen komplett entfallen, weil die offene
Aussprache anstehender Ver&auml;nderungen allen die M&ouml;glichkeit
g&auml;be sich rechtzeitig vorzubereiten. Da es aber scheinbar
interessanter ist, jeden Widerstand durch Desinformation zu vermeiden, kann
man als Normalb&uuml;rger nur noch den entstandenen Unfug ertragen. Eine
klare Aussage &uuml;ber die Zukunft des Meisterbriefs in den betroffenen
"nicht sicherheitsrelevanten" Berufen ist nicht so einfach. Dass es mehr
Arbeitspl&auml;tze geben wird, obwohl schon existierende Firmen eher
zuwenig als zuviel Auftr&auml;ge haben, oder dass es weniger Schwarzarbeit,
oder die Kosten der Kunden sinken werden halte ich f&uuml;r schlicht so
unwahrscheinlich wie mehrere Lottosechser in einem Leben.</P>

<P>Notwendige Anpassungen an die Regeln in der EU finden sicher statt, doch
ob man immer alles auf niedrigstem gemeinsamen Niveau machen muss? Die
Wirkung der Freigabe "leicht erlernbarer" T&auml;tigkeiten ist dazu ja
reine Augenwischerei, weil es nur an der Vertragsgestaltung liegt, welche
Arbeiten zu welchen Stundens&auml;tzen ausgef&uuml;hrt werden. Dass
allerdings f&uuml;r saubere Arbeit mehr verlangt wird wie f&uuml;r
Hingemurkstes, ist eigentlich keine Besonderheit des Handwerks.</P>

<P>Ein kleines Beispiel f&uuml;r die Finanzentwicklung im Handwerk: Ich
arbeite seit gut 10 Jahren als Handwerker und bekomme dabei einen
Stundenlohn, d.h. bezahlt wird nach Arbeitsstunden (ca 160 pro Monat) und
habe so von Beginn meiner T&auml;tigkeit bis heute zwar eine Steigerung auf
das doppelte des "Startbetrages" erfahren, komme aber trotzdem beim Netto
NIEMALS auch nur in die N&auml;he des doppelten Betrages (bei gleicher
arbeitszeit)!!!!! Stattdessen habe ich so ca 15-20% mehr! Daraus folgt,
dass es bestimmt nicht die "hohen" L&ouml;hne sind, sondern die politisch
gewollte &Uuml;bersteuerung der Einkommen, weshalb die Kosten f&uuml;r
Handwerker sehr oft m&ouml;glichen Kunden zu teuer erscheinen ohne dass
klar wird, wer wirklich abkassiert. Erst wenn die gesamten Kosten f&uuml;r
L&ouml;hne und Verwaltung auf das notwendige zur&uuml;ckgefahren werden (in
den Gesetzen), k&ouml;nnen die Handwerker zu kleineren Preisen arbeiten und
statt Selbstherummurksen, Schwarzarbeit oder ilegalen Billigsklaven
g&auml;be es Arbeitspl&auml;tze.</P>

<P>Eine sogenannte Erleichterung wie die Reduzierung der Qualit&auml;t dank
freien Zugangs ohne Meister hilft weder den einheimischen Betrieben noch
den Kunden. Die wirklichen Problemstrukturen im staatlichen Bauwesen und
der Bauwirtschaft allgemein reichen zwar f&uuml;r Medienrummel aber leider
nicht f&uuml;r &Auml;nderungen, die Steuermittel schonen und Firmen vom
Missbrauch als "Kreditgeber" befreien. Wenn das Interesse an Reformen
vorhanden sein sollte, dann br&auml;uchte man keine Experten, Komissionen
und Agendas, sondern nur ein offenes Ohr f&uuml;r diejenigen Personen deren
t&auml;gliches Arbeitserlebnis nicht nur am Schreibtisch stattfindet.</P>

<P>Andreas Guldner</P>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

