<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE></TITLE>
</HEAD>

<BODY background="st_rolf01.gif" text="#000000" link="#0000FF"
vlink="#000080" alink="#FF0000" bgcolor="#FFFFF4">
<TABLE border="0" width="100%" summary="" cellspacing="2" cellpadding="8">
<TR>
<TD>
<DIV align="center">
<H2>Frank-Markus Barwasser</H2>

<H3>ist</H3>

<H4>ERWIN PELZIG</H4>

<P>Aus seinem Buch (aufgelegt unter ISBN 3-492-04503-0)<BR>
<BR>
<FONT size="+1" color="#008030">Was w&auml;re' ich ohne mich?</FONT></P>
</DIV>
<BR>
<BR>
&Uuml;berschrift: <FONT size="+1">Der Computer-Inder</FONT><BR>
<BR>
Deutschland ist ein rohstoffarmes Land. Wir haben hier nur den Rohstoff
Geist. Und der wird auch immer knapper. Deshalb m&uuml;ssen wir wieder
geistreicher werden, und deshalb werden wir jetzt ein Einwanderungsland.
Die Ausl&auml;nder m&uuml;ssen jetzt kommen. Also net alle Ausl&auml;nder.
Nur die, die wo net so sind wie wir. Also die intelligenten Ausl&auml;nder
sollen kommen. Die, wo gut rechnen k&ouml;nnen. Und einen guten Deutsch
m&uuml;ssen sie k&ouml;nnen. Ganz wichtig. Das hat die CSU ja schon vor
Jahren gefordert: Wer keinen gescheiten Deutsch sprechen tut, wird
gezwungen, das Land m&uuml;ss zum Verlass. Also die intelligenten
Ausl&auml;nder m&uuml;ssen jetzt her. Aber das kann ja nix werden. Weil die
intelligenten Ausl&auml;nder, wo wir wollen, die wollen gar net zu uns. Da
sind die viel zu intelligent. Ich sag ja net, da&szlig; nur die Bl&ouml;den
da w&auml;ren. Aber kennen Sie pers&ouml;nlich einen einzigen von diesen
ber&uuml;hmten Computer-Indern? Ich nicht. Was ich kenn: Rosen-Inder. Da
sind sehr nette Kerle drunter. Und in Augsburg habe ich unl&auml;ngst so
einen Hotel-Inder kennengelernt. Im Hotel "Drei Mohren". Aber einen
Computer-Inder hab ich noch nirgends getroffen. Die wollen n&auml;mlich gar
nicht zu uns. Dabei k&ouml;nnen die hier locker um die 5000 Euro netto im
Monat abgreifen. Aber sie kommen net. Und warum kommen sie net? Weil sie
Angst haben, da&szlig; sie in Deutschland dann von irgend so einem
Drecks-Nazi auf der Stra&szlig;e totgeschlagen werden. Und dann sind 5000
Euro wieder a weng wenig. Dann ist das ja praktisch nur eine
Bestattungs-Beihilfe.<BR>
<HR>
<FONT size="+1" color="#008030">Aufgemerkt!</FONT><BR>
<FONT color="#008030">Rot-wei&szlig; kariertes Hemd und
Herrent&auml;schchen -das ist er Erwin Pelzig, der fr&auml;nkische
Weltphilosoph. Und wenn er &uuml;ber Tiefk&uuml;hltruhen, den Dalai Lama
und Designer-S&ouml;ckli nachdenkt, ist das schon einmal den Deutschen
Kabaratpreis wert.<BR>
"Nichts ist ihm fremd und heilig schon gar nichts. Selten sieht man einen
Kabarettisten so gewitzt und schlagfertig"<BR>
S&uuml;ddeutsche Zeitung</FONT> 
<HR>
<FONT size="+1" color="#008030">Und wer noch mehr &uuml;ber den Autor
wissen m&ouml;chte<A href= "http://www.pelzig.de">&nbsp; hier</A> findet er
mehr</FONT><BR>
<HR>
<IMG src="st_rolf.gif" width="40" height="40" border="0" alt="Burg"
align="right" hspace="10"> von: &nbsp;<A href= "nuenninghoff.html">Rolf
Nue. aus Wue.</A><BR>
E-Mail:<A href="mailto:093113563-0001@t-online.de">093113563-0001@t-online.de</A><BR>

Homepage:<A href="http://www.rolfnuenninghoff.de">Rolf N&uuml;nninghoff</A> 
<HR>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

