<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      Ein` hab ich noch...
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling 090703">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="">
      <TR>
        <TD>
          <CENTER>
            <IMG src="st_einnoch.jpg" alt="Ein` hab ich noch" width="432" height="96">
          </CENTER>
          <HR align="center" width="75%" size="5" color="#C8C6C2">
          <BR>

          <P>
            "Womit haben sie auf den Kl&auml;ger geworfen, Angeklagter?" - "Mit Pfirsichen, Herr Richter!"<BR>
             "Und woher hat er dann diese f&uuml;rchterlichen Beulen am Kopf?"<BR>
             "Die Pfirsiche waren noch in der Dose!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Guten Tag Hans, darf ich mir deinen Rasenm&auml;her ausleihen?" - Na klar, solang der in meinem Garten bleibt...
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Komisch," sagt der eine Ehemann zum anderen, "Immer wenn meine Frau eine Gurkenmaske auf ihrem Gesicht hatte, gibt`s am n&auml;chsten Tag Tzatziki. Irgend etwas stimm da doch nicht!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Na, Angelika, wie klappt denn eure K&uuml;nstlerehe?" - "Tadellos! Er malt Bilder, ich koche das Essen. Hinterher raten wir beide, was es sein soll!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Herr L&uuml;ders soll auf Gesch&auml;ftsreise. Seine Frau packt mit der kleinen Tochter den Koffer: "Ein grosses Bier, damit Papa nicht verdurstet, eine T&uuml;te Chips, damit der Papa
            nicht verhungert!"<BR>
             Geht das kleine M&auml;dchen ins Bad und holt eine Flasche Parf&uuml;m. Fragt die Mutter: "Wozu ist das denn?" - "Damit der Papa nicht verduftet!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Geht ein Mann im Supermarkt an den Fleischtresen: "Ich h&auml;tte gerne 250 Gramm Leberwurst. - Aber von der groben, der fetten!"<BR>
             "Geht nicht!", sagt der Fleischer, "Die hat heute Berufsschule!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Herr Franz liest beim Fr&uuml;hst&uuml;ck in der Zeitung das Horoskop , schaut seine Frau vorwurfsvoll an und sagt: "Warum bist du nicht drei Tage fr&uuml;her auf die Welt gekommen, dann
            w&auml;rst du intelligent und freundlich!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Was zeigt man einer Frau, die 10 Jahre lang unfallfrei gefahren ist?<BR>
             Den 2. Gang!
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Bei der goldenen Hochzeit wird der Ehemann gefragt: "Was war denn die sch&ouml;nste Zeit in all den Ehejahren?"<BR>
             "Die f&uuml;nf Jahre russische Kriegsgefangenschaft!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Was denkt sich eine Frau nach 20 Ehejahren, wenn sie in der Fr&uuml;h in den Spiegel schaut? "Ha! Das g&ouml;nn ich ihm!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Was macht man, wenn die Schwiegermutter auf einen zutaumelt?<BR>
             Noch mal schie&szlig;en!
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Zwei Eheleute haben wieder einmal Streit. Er: "Wenn du stirbst, besorge ich dir einen Grabstein mit der Inschrift: Hier liegt meine Frau - Kalt wie immer".<BR>
             Sie: "Und wenn du stirbst, stelle ich dir einen Grabstein hin worauf steht: Hier liegt mein Mann - Endlich steif".
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Er: "Hast du den Wagen in die Garage gefahren?"<BR>
             Sie: "Teilweise!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Franzl: "Ich habe gestern mit meiner Gattin einen riesen Ehekrach gehabt!"<BR>
             "Und, wor&uuml;ber?"<BR>
             "Es ging um einen Geschirrsp&uuml;ler. - Meine Frau meint, ich brauche keinen!"
          </P>
          <BR>
           <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Ein Mann m&ouml;chte seine Frau umbringen. Er geht zur Apotheke und verlangt Zyankali.<BR>
             Der Apotheker mustert ihn streng und meint: "Sie wissen aber schon, dass ich Ihnen das so ohne Weiteres nicht geben darf?"<BR>
             Der Mann &ouml;ffnet seinen Geldbeutel, holt ein Foto seiner Gattin heraus und legt es auf die Theke.<BR>
             Der Apotheker wirft einen Blick darauf und meint: "Entschuldigung, ich wu&szlig;te nicht, dass Sie ein Rezept dabei haben."
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Wie stellt ein Eheman, der frisch verheiratet ist, jemandem seine Frau vor:<BR>
             "Darf ich vorstellen, meine Frau!"<BR>
             Wie stellt ein Eheman, der 10 Jahre verheiratet ist, jemandem seine Frau vor:<BR>
             "Das ist meine Frau, k&ouml;nnen sie sich das vorstellen?"<BR>
             Wie stellt ein Eheman, der 35 Jahre verheiratet ist, jemandem seine Frau vor:<BR>
             "Das ist meine Frau, k&ouml;nnen sie sich mal davor stellen?"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Warum summen M&uuml;cken? - Weil sie den Text vergessen haben!
          </P>
          <HR width="100%" size="3">
          <BR>

          <P>
            Liegt ein Penner im Winter unter einer Br&uuml;cke und friert. Da erscheint ihm eine gute Fee und sagt: "Du hast einen Wunsch frei!" Der Penner sagt schlotternd: "Ach, eigentlich
            w&uuml;nsche ich mir nur ein warmes Pl&auml;tzchen." Es blitzt, und die Fee h&auml;lt dem Penner einen dampfenden Keks vor die Nase.
          </P>
          <HR align="center" width="75%" size="5" color="#C8C6C2">
          <BR>

          <CENTER>
            <BR>

            <TABLE border summary="">
              <TR>
                <TH bgcolor="#CCCCCC" align="left">
                  <CENTER>
                    <FONT color="#f3300CC">JoJo</FONT> &nbsp; J&uuml;rgen Sperling
                  </CENTER>
                </TH>
              </TR>
              <TR>
                <TH bgcolor="#FFFFCC" align="left">
                  sperlingbergen@freenet.de
                </TH>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

