<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<!-- Author = Wolf Zimmer -->

<TITLE></TITLE>
</HEAD>

<BODY background="bg_wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<P align="center"><FONT color="#000080" size="6"><B>Deutschland steht nicht vor einer
Deflation</B></FONT></P>

<P><IMG src="st_wolf1.gif" width="222" height="206" alt="Logo des Artikels" align="left">
<FONT size="+1"><B>Dieser Artikel wurde als PDF-Datei von der Website
<FONT color="#0000ff"><B>&lt;www.bankenverband.de&gt;</B></FONT>
gezogen und ohne &Auml;nderungen (aber ohne die Statistikbilder) hier
&uuml;bernommen.</B></FONT><BR clear="all">
</P>

<H1 align="center"><B>Was ist Deflation ?</B></H1>

<H3><B>Argumente im &Uuml;berblick</B></H3>

<UL>
<LI>Ein sinkendes Preisniveau f&uuml;hrt nicht notwendigerweise in die
Deflation. Bereits Mitte der achtziger Jahre sanken in Deutschland
&uuml;ber zw&ouml;lf Monate die Verbraucherpreise, ohne dass sich daraus
eine Deflationsspirale entwickelte.</LI>

<LI>Die Existenz eines negativen &raquo;output gap&laquo; in Deutschland
sollte nicht &uuml;berinterpretiert werden. Mit Ausnahme des
Wirtschaftsbooms nach der deutschen Vereinigung klafft in Deutschland seit
der zweiten &Ouml;lkrise zu Beginn der achtziger Jahre eine L&uuml;cke
zwischen dem Produktionspotenzial und dem Bruttoinlandsprodukt. Sie ist der
sichtbare Beleg f&uuml;r die seit langer Zeit schwelende Strukturkrise der
deutschen Wirtschaft.</LI>

<LI>Die Bankstatistik weist f&uuml;r 2002 einen leichten R&uuml;ckgang der
ausstehenden Kredite aus. Daraus kann aber keine Kreditklemme abgeleitet
werden. Denn der R&uuml;ckgang ist zumindest teilweise durch die
Ver&auml;nderungen in der Fremdkapitalfinanzierung der Unternehmen bedingt.
Diese werden in der Kreditstatistik nicht erfasst.Vor allem
Gro&szlig;unternehmen haben in erheblichem Umfang Bankkredite durch
gro&szlig;volumige Anleihen substituiert.</LI>

<LI>Bef&uuml;rchtungen, ein l&auml;ngerfristiger, wenn auch nur geringer
R&uuml;ckgang des Preisniveaus k&ouml;nne eine &auml;hnlich
ausgepr&auml;gte Stagnationsphase zur Folge haben wie in Japan, sind
unbegr&uuml;ndet. Die Situationen in beiden L&auml;ndern sind nicht
miteinander vergleichbar.</LI>

<LI>Gegen ein sinkendes Preisniveau wirken nach wie vor die
&uuml;berdurchschnittlich steigenden Preise f&uuml;r Dienstleistungen sowie
der anhaltende Kostendruck durch weiter steigende Lohnkosten.</LI>

<LI>Damit die EZB ihre Handlungsf&auml;higkeit permanent aufrechterhalten
kann, hat sie ein Stabilit&auml;tsziel mit einer Preissteigerungsrate von
nahe 2 % gesetzt. Sie tr&auml;gt damit der Gefahr einer Deflation in
ausreichendem Ma&szlig;e Rechnung. Bei einem Refinanzierungssatz von 2,5 %
ist au&szlig;erdem der Handlungsspielraum der EZB noch ausreichend
gro&szlig;, um einem Verfall des Preisniveaus entgegenzuwirken.</LI>

<LI>Als Teil der EWU kann Deutschland allein nicht in eine Deflation
geraten. Die unterdurchschnittlichen Inflationsraten verbessern die
preisliche Wettbewerbsf&auml;higkeit der Unternehmen in Deutschland,
wodurch die Nachfrage aus der EWU zunimmt und ein weiteres Abgleiten des
Preisniveaus verhindert wird.</LI>
</UL>

<P>Ein stabiler Geldwert ist eine unverzichtbare Voraussetzung und ein
wertvoller Aktivposten f&uuml;r eine solide Wirtschaftspolitik. Mit einer
Preissteigerungsrate, die in Deutschland gegenw&auml;rtig unter 1% liegt,
k&ouml;nnten die Bedingungen f&uuml;r die notwendige Reformpolitik von
monet&auml;rer Seite nicht g&uuml;nstiger sein. Anstatt aber dieses
erfreuliche Ma&szlig; an Preisniveaustabilit&auml;t als einen Erfolg der
Geldpolitik der EZB zu w&uuml;rdigen, h&auml;ufen sich die Warnungen vor
einem Abrutschen Deutschlands in die Deflation.</P>

<P><TABLE border="1" bgcolor="#c0c0c0" width="50%" align="right">
<TR>
<TD>
<H4>Was ist Deflation?</H4>

<P><FONT size="-1">Unter Deflation versteht man gemeinhin den dauerhaften
R&uuml;ckgang eines allgemeinen Preisindexes wie des Indexes f&uuml;r die
Verbraucherpreise oder des Deflators des Bruttoinlandsprodukts.
Erfahrungsgem&auml;&szlig; geht eine Deflation mit einer Verminderung der
umlaufenden Geldmenge und/oder der Umlaufgeschwindigkeit des Geldes einher.
Die Furcht vor einer Deflation ist vor allem gepr&auml;gt von den
Erfahrungen der Weltwirtschaftskrise zu Beginn der drei&szlig;iger Jahre,
als es zu einer deflation&auml;ren Abw&auml;rtsspirale mit sinkenden
Preisen, fallender Produktion und weiter sinkenden Preisen kam. Die
Erfahrungen in Japan zeigen aber, dass auch ein anhaltender
geringf&uuml;giger R&uuml;ckgang des Preisniveaus f&uuml;r eine
Volkswirtschaft sch&auml;dlich sein kann. Eine solche Entwicklung
erh&ouml;ht die Unsicherheit, verzerrt die Allokation der Ressourcen, hat
nachteilige Verteilungswirkungen und verhindert dadurch eine nachhaltige
Erholung des Wachstums.</FONT></P>

<P><FONT size="-1">Als Deflation gilt dagegen nicht, wenn der Preisindex
nur w&auml;hrend eines oder zweier Quartale sinkt. Auch der R&uuml;ckgang
des Preisindexes in einzelnen Branchen oder Sektoren einer Volkswirtschaft
wird nicht als Deflation gewertet. Solche Entwicklungen spiegeln normale
Marktprozesse wider und dienen der Reallokation der Ressourcen.</FONT></P>
</TD>
</TR>
</TABLE>

Angesichts der gravierenden Auswirkungen, die eine
Deflation auf die Wirtschaft eines Landes haben kann, w&auml;re es
zweifellos leichtfertig, entsprechende Warnungen auf die leichte Schulter
zu nehmen. Dennoch erscheinen sie,auch wenn sie von angesehenen Adressen
vorgebracht werden, selbst bei vorsichtiger Interpretation der
gegenw&auml;rtigen wirtschaftlichen Lage als &uuml;berzogen. Und nicht nur
das: Die aufgeregte Diskussion &uuml;ber das Gef&auml;hrdungspotenzial
beg&uuml;nstigt unter Umst&auml;nden eine Entwicklung, vor der sie an sich
warnen m&ouml;chte. </P>

<P>Der IWF sieht das Risiko einer Deflation Deutschland befindet sich im
dritten Jahr einer Stagnationsphase, die einhergeht mit einer Reihe
ungel&ouml;ster Strukturprobleme. Dies wird schon als hinreichend
daf&uuml;r erachtet, dass die deutsche Wirtschaft in einen Strudel
sinkender Preise, r&uuml;ckl&auml;ufiger Produktion und abnehmender
Besch&auml;ftigung geraten k&ouml;nnte. Ausl&ouml;ser f&uuml;r die
wachsende Zahl von Warnungen vor einer Deflation in Deutschland war die
Studie einer Arbeitsgruppe des Internationalen W&auml;hrungsfonds (IWF)
&uuml;ber aktuelle Deflationsrisiken in der Weltwirtschaft.Darin ist auch
die Warnung enthalten, in Deutschland bestehe das Risiko einer
Deflation.Der IWF st&uuml;tzt seine Warnung vor dem Abgleiten in die
Deflation insbesondere auf die folgenden Faktoren:</P>

<UL>
<LI>Die Inflationsrate in Deutschland ist unter 1% gesunken.</LI>

<LI>Die Lohnst&uuml;ckkosten sind in Deutschland im Durchschnitt der
vergangenen f&uuml;nf Jahre nur um 0,75 % gestiegen.</LI>

<LI>Die Aktienkurse sind im Jahr 2002 um 40 % gesunken und liegen auf dem
Niveau des Jahres 1997. Die Immobilienpreise sind
r&uuml;ckl&auml;ufig.</LI>

<LI>Die reale Inlandsnachfrage sinkt, und das Bruttoinlandsprodukt wird im
dritten Jahr in Folge hinter dem Produktionspotenzial zur&uuml;ckbleiben.
Der Abstand zwischen Bruttoinlandsprodukt und Produktionspotenzial, der so
genannte &raquo;output gap&laquo;, wird auf 2,75 % steigen.</LI>

<LI>Die Zahl der Unternehmenskonkurse erreicht ein neues Rekordniveau.</LI>

<LI>Die Banken und Versicherungen befinden sich in einem tief greifenden
Umstrukturierungsprozess.</LI>
</UL>

<P>Aus diesen hinl&auml;nglich bekannten &ouml;konomischen
Rahmenbedingungen in Deutschland leiten die &Ouml;konomen des IWF ein
Deflationsrisiko ab, weil</P>

<UL>
<LI>der &raquo;output gap&laquo; &uuml;berdurchschnittlich gro&szlig; ist
und anders als in fr&uuml;heren vergleichbaren Phasen mit steigender
Arbeitslosigkeit und sinkenden Inflationsraten einhergeht;</LI>

<LI>das Kreditwachstum hinter der Kreditnachfrage zur&uuml;ckgeblieben
ist,</LI>

<LI>die Exportst&auml;rke nicht ausreicht, um eine pl&ouml;tzliche
Verschlechterung der Inlandsnachfrage auszugleichen.</LI>
</UL>

<P>Der IWF erwartet zwar nicht, dass es wie in der Weltwirtschaftskrise
nach 1929 zu einer deflation&auml;ren Abw&auml;rtsspirale kommt. Aber ein
&uuml;ber einen l&auml;ngeren Zeitraum geringf&uuml;gig sinkendes
Preisniveau - &auml;hnlich wie in Japan mit vergleichbaren
&ouml;konomischen Folgen f&uuml;r Deutschland - erscheint den Volkswirten
des IWF durchaus m&ouml;glich. Nun gibt es an der Diagnose der
wirtschaftlichen Lage in Deutschland durch den IWF wenig
auszusetzen.Allerdings verdient die daraus gezogene Schlussfolgerung eine
eingehende Diskussion. Drei Aspekte m&uuml;ssen dabei besonders
hervorgehoben werden.</P>

<UL>
<LI>Erstens ist die Interpretation des IWF keineswegs zwangsl&auml;ufig. Es
lassen sich eine Reihe von Argumenten anf&uuml;hren,die dagegen sprechen,
dass sich Deutschland am Rande einer Deflation bewegt.</LI>

<LI>Zweitens haben die Erfahrungen mit deflation&auml;ren Entwicklungen im
Verlauf des vergangenen Jahrhunderts gezeigt, dass eine Deflation ohne
Fehler der Notenbank und/oder der Wirtschaftspolitik nicht m&ouml;glich
ist. Die Gefahr einer Deflation in Deutschland best&uuml;nde dann, wenn die
von der Geldpolitik der EZB verfolgte Strategie asymmetrisch auf die
Gefahren der Inflation ausgerichtet w&auml;re und die EZB die Gefahren der
Deflation zu gering einsch&auml;tzte. Zudem m&uuml;sste die
Wirtschaftspolitik aktiv zum Entstehen einer deflatorischen L&uuml;cke
beitragen.</LI>

<LI>Drittens ist Deutschland Teil eines gr&ouml;&szlig;eren
W&auml;hrungsraums. Die Bedeutung des internationalen Preiszusammenhangs
f&uuml;r die Entwicklung des Preisniveaus und des Wirtschaftswachstums wird
vom IWF untersch&auml;tzt.</LI>
</UL>

<H3>Wie real ist die Gefahr einer Deflation in Deutschland?</H3>

<P>Ein sinkendes Preisniveau ist nichts Neues. Sinkende Preise f&uuml;r
G&uuml;ter und Dienstleistungen m&uuml;ssen nicht zwangsl&auml;ufig negativ
sein. So waren Mitte der achtziger Jahre die Verbraucherpreise in
Deutschland &uuml;ber ein ganzes Jahr r&uuml;ckl&auml;ufig. In der Spitze
sank der Verbraucherpreisindex um 1% gegen&uuml;ber dem Vorjahr. Eine
vergleichbare Deflationsdebatte hat es damals nicht gegeben, kam doch der
Stabilit&auml;tsimpuls im Wesentlichen &uuml;ber sinkende Roh&ouml;lpreise
und eine Aufwertung der D-Mark. Die Marktteilnehmer erkannten dies als ein
vor&uuml;bergehendes Ph&auml;nomen und erwarteten keinen dauerhaften
R&uuml;ckgang des Preisniveaus. Die Situation im Fr&uuml;hjahr 2003 ist
damit durchaus vergleichbar. Nach dem Ende des Irak-Krieges sanken die
Preise f&uuml;r Roh&ouml;l wieder sp&uuml;rbar, und gleichzeitig setzte
eine deutliche Abwertung des US-Dollar ein.</P>

<H3>Ein negativer &raquo;output gap&laquo; besteht schon lange</H3>

<P>Auch der Umstand eines negativen &raquo;&bdquo;output gap&laquo; in
Deutschland sollte nicht &uuml;berinterpretiert werden. Mit Ausnahme des
Wirtschaftsbooms nach der deutschen Vereinigung klafft in Deutschland seit
der zweiten &Ouml;lkrise zu Beginn der achtziger Jahre eine L&uuml;cke
zwischen dem Produktionspotenzial und dem Bruttoinlandsprodukt. Sie ist der
sichtbare Beleg f&uuml;r die seit langer Zeit schwelende Strukturkrise der
deutschen Wirtschaft. Ein Blick in die achtziger Jahre zeigt zudem, dass in
den Jahren 1985 bis 1987, als der Preisindex zeitweise r&uuml;ckl&auml;ufig
war, der &raquo;output gap&laquo; eine &auml;hnliche Gr&ouml;&szlig;e
aufwies wie heute.</P>

<H3>Es gibt keine Kreditklemme</H3>

<P>Mit Vorsicht muss auch der Interpretation des IWF bez&uuml;glich der
Entwicklung der Kreditvergabe in Deutschland begegnet werden. Die
Statistiken der Deutschen Bundesbank weisen zwar eindeutig eine Stagnation
der Kreditvergabe im Jahr 2002 aus, und im ersten Quartal dieses Jahres
liegt die Summe der vergebenen Kredite sogar leicht unter dem
Vorjahreswert. Es ist allerdings schwierig, aus diesen Daten mehr
herauszulesen als die normale zyklische Entwicklung der Kreditvergabe
w&auml;hrend einer &ouml;konomischen Schw&auml;chephase. Anzeichen f&uuml;r
eine Kreditklemme, die zu einer deflatorischen L&uuml;cke f&uuml;hren
k&ouml;nnte, sind entgegen anders lautenden Meinungen daraus kaum
ableitbar. Denn die Daten zur Kreditvergabe erfassen insbesondere nicht die
Ver&auml;nderungen, die sich im Verlauf der letzten Jahre in der
Fremdkapitalfinanzierung der Unternehmen ergeben haben. Seit Beginn der
W&auml;hrungsunion hat auch in Deutschland die Bedeutung von
Unternehmensanleihen erheblich zugenommen. Vor allem Gro&szlig;unternehmen
haben in den letzten Jahren Bankkredite durch gro&szlig;volumige Anleihen
substituiert. Im Ergebnis d&uuml;rfte das tats&auml;chliche
Fremdfinanzierungsvolumen die ausgewiesenen Bankkredite deutlich
&uuml;bersteigen. Da vielfach deutsche Unternehmen Unternehmensanleihen
&uuml;ber Tochterunternehmen im Ausland begeben, m&uuml;ssen diese
Kreditbeziehungen mit dem Ausland mitber&uuml;cksichtigt werden, damit ein
umfassendes Bild von der Kreditvergabe an Unternehmen in Deutschland
entsteht. So sind die Verbindlichkeiten deutscher Unternehmen
gegen&uuml;ber dem Ausland auch im Jahr 2002 um 5,6 % gestiegen. Untersucht
man lediglich die in Euro denominierten langfristigen Finanzbeziehungen
deutscher Unternehmen zu verbundenen Unternehmen,so sind sie 2002 erneut
kr&auml;ftig um 28,7 % gestiegen. Seit Beginn der W&auml;hrungsunion haben
sich diese Verbindlichkeiten vervierfacht. </P>

<H3>Nur ein Versagen der Wirtschaftspolitik kann in eine Deflation
f&uuml;hren</H3>

<P>Nun ist es keinesfalls unwahrscheinlich, dass bei weiter nachlassendem
Inflationsdruck in der EWU die Verbraucherpreise in Deutschland im Verlauf
der kommenden zw&ouml;lf Monate die Null-Linie unterschreiten. Damit ist
aber noch nicht gesagt,dass dann die bef&uuml;rchteten realwirtschaftlichen
Auswirkungen eintreten, die in der gegenw&auml;rtigen Diskussion mit einer
Deflation in Verbindung gebracht werden. Der R&uuml;ckgang des allgemeinen
Preisniveaus kennzeichnet zwar formal das Vorliegen einer Deflation,
negative &ouml;konomische Auswirkungen sind aber von den Erwartungen der
Marktteilnehmer abh&auml;ngig und vor allem von den Aktionen der
Wirtschaftspolitik. Ohne gravierende wirtschaftspolitische Fehler wird eine
Deflation nicht entstehen. Sie ist nicht das zwangsl&auml;ufige Ergebnis
eines zeitweise sinkenden Preisindexes.</P>

<H3>Es bestehen keine Parallelen zu Japan</H3>

<P>Ein kollektives Versagen der Wirtschaftspolitik wie w&auml;hrend der
Weltwirtschaftskrise zu Beginn der drei&szlig;iger Jahre wird selbst bei
den aktuellen Warnungen vor einer Deflation in Deutschland nicht
erwartet.Wohl aber werden Parallelen zur Entwicklung in Japan gezogen.
Bef&uuml;rchtet wird, dass ein l&auml;ngerfristiger, wenn auch nur geringer
R&uuml;ckgang des Preisniveaus eine &auml;hnlich ausgepr&auml;gte
Stagnationsphase zur Folge haben k&ouml;nnte wie in Japan. </P>
           

<P><TABLE border="1" summary="" width="50%" bgcolor="#c0c0c0" align="right">
<TR>
<TD>
<P><FONT size="-1">Die Lehren aus der Weltwirtschaftskrise zu Beginn der
drei&szlig;iger Jahre</FONT></P>

<P><FONT size="-1">Vor allem die Erfahrungen aus der Weltwirtschaftskrise
Anfang der drei&szlig;iger Jahre zeigten, welche dramatischen Konsequenzen
ein nachhaltiger R&uuml;ckgang des gesamtwirtschaftlichen Preisniveaus
f&uuml;r Produktion und Besch&auml;ftigung eines Landes haben
kann.</FONT></P>

<P><FONT size="-1">Die gesamtwirtschaftliche Nachfrage fiel hinter das
Angebot zur&uuml;ck, es kam zu einer &raquo;deflatorischen
L&uuml;cke&laquo;, aus der sich eine regelrechte Abw&auml;rtsspirale
entwickelte. Diese verl&auml;uft haupts&auml;chlich &uuml;ber zwei
Wirkungszusammenh&auml;nge.</FONT></P>

<UL>
<LI><FONT size="-1">Ein anhaltender Preisr&uuml;ckgang bei Waren und
Dienstleistungen f&uuml;hrt insbesondere bei wenig flexiblen Kosten zu
einer Verschlechterung der Erl&ouml;s-Kosten-Relation der Unternehmen. Der
Druck auf die Gewinnmargen und die Ungewissheit &uuml;ber Ausma&szlig; und
Dauer des Preisverfalls beeintr&auml;chtigen die Investitionsneigung.
K&ouml;nnen die L&ouml;hne nicht oder nur verz&ouml;gert angepasst werden,
so kommt es zu steigenden Reall&ouml;hnen, zu einer sinkenden Nachfrage
nach Arbeit und zu steigender Arbeitslosigkeit. Eine Tendenz zur
Selbstverst&auml;rkung ergibt sich zus&auml;tzlich daraus, dass eine
Deflation die Geldhaltung attraktiv macht und private Haushalte wie auch
Unternehmen veranlassen kann, sich in Erwartung weiter sinkender Preise mit
K&auml;ufen zur&uuml;ckzuhalten.</FONT></LI>

<LI><FONT size="-1">Ein besonderes Problem besteht schlie&szlig;lich darin,
dass Zinsen nicht negativ werden k&ouml;nnen. In einer Deflation steigen
deshalb die Realzinsen sp&uuml;rbar. Dies beeintr&auml;chtigt nicht nur die
Investitionsbereitschaft der Unternehmen; hohe Realzinsen erschweren
Betrieben und privaten Haushalten auch die Bedienung in ihrem Wert
st&auml;ndig steigender Verbindlichkeiten. Dadurch erh&ouml;ht sich das
Kreditrisiko, und die Bereitschaft der Banken zur Kreditvergabe nimmt
ab.</FONT></LI>
</UL>

<P><FONT size="-1">In einer solchen Situation kommt es darauf an, dass die
Wirtschaftspolitik die deflatorischen Tendenzen nicht weiter
verst&auml;rkt. Welche Fehler die Wirtschaftspolitik begehen kann, hat die
Weltwir tschaftskrise Anfang der drei&szlig;iger Jahre ebenfalls
gezeigt.</FONT></P>

<UL>
<LI><FONT size="-1">Der Staat versuchte, die durch sinkende Preise und den
R&uuml;ckgang der gesamtwirtschaftlichen Nachfrage entstehenden
Steuerausf&auml;lle durch Ausgabenk&uuml;rzungen auszugleichen. Er
vergr&ouml;&szlig;erte damit die deflatorische L&uuml;cke und beschleunigte
den Abschwung.</FONT></LI>

<LI><FONT size="-1">Krisenversch&auml;rfend wirkte auch der Versuch, durch
Handelsrestriktionen wie Einfuhrz&ouml;lle oder -kontingente die eigene
wirtschaftliche Situation zu verbessern. Da die Handelspartner zu den
gleichen Mitteln griffen, wurden lediglich Handel und internationale
Arbeitsteilung eingeschr&auml;nkt - mit entsprechenden negativen
Konsequenzen.</FONT></LI>

<LI><FONT size="-1">Erhebliche Verantwortung hat schlie&szlig;lich auch die
Geldpolitik. Reagiert sie, wie beispielsweise die Deutsche Reichsbank
w&auml;hrend der Weltwir tschaftskrise, auf den R&uuml;ckgang der Preise
mit einer entsprechenden Einschr&auml;nkung der Geldversorgung, so setzt
sie einen wichtigen "automatischen Stabilisator" au&szlig;er Kraft. Das
Zur&uuml;ckbleiben der Geldmengenentwicklung hinter der Entwicklung des
gesamtwir tschaftlichen Produktionspotenzials wirkt restriktiv und
verst&auml;rkt den deflatorischen Prozess. Auch die seit einigen Jahren
anhaltende Deflation in Japan hat eine wesentliche Ursache in einer zu
z&ouml;gerlichen Haltung der Notenbank bei der erforderlichen Ausweitung
der Geldmenge.</FONT></LI>
</UL>
</TD>
</TR>
</TABLE>

Solche Mutma&szlig;ungen scheinen jedoch voreilig. Denn tats&auml;chlich
ist die Entwicklung beider Volkswirtschaften nicht vergleichbar. Der
Ursprung der japanischen Wirtschaftskrise liegt in der hochspekulativen
Blasenbildung an den japanischen Immobilienm&auml;rkten Ende der achtziger
Jahre, die das gesamte japanische Bankensystem in eine Schieflage gebracht
hat. In Deutschland sind entgegen den &Auml;u&szlig;erungen des IWF die
Immobilienpreise weitgehend stabil. Das Bankensystem befindet sich zwar in
einer Ertragskrise, ist insgesamt aber ebenfalls stabil und kann seine
gesamtwirtschaftlichen Aufgaben erf&uuml;llen. Eine Kreditklemme wie in
Japan besteht in Deutschland nicht und ist auch nicht zu bef&uuml;rchten.
</P>

<P>Allein die Dimension des Kreditproblems in Japan zeigt, dass die Lage
der deutschen Kreditwirtschaft nicht mit der der japanischen vergleichbar
ist. Die notleidenden Kredite summieren sich in Japan auf ann&auml;hernd 8
% des Bruttoinlandsprodukts, w&auml;hrend nach Sch&auml;tzung von Goldman
Sachs dieser Anteil in Deutschland bei 1% liegt. Hinzu kommt,dass nach
&uuml;bereinstimmender Einsch&auml;tzung die Geldpolitik der japanischen
Notenbank mit ausschlaggebend f&uuml;r das Entstehen der Deflation gewesen
ist. Sie hat nach heutiger Erkenntnis zu sp&auml;t mit einer expansiveren
Geldpolitik begonnen.</P>

<P>Mit Vorbehalt sollte auch der Aussage des IWF begegnet werden, dass
selbst geringe Deflationsraten wie in Japan Ursache f&uuml;r die Stagnation
der dortigen Wirtschaft seien. Die anhaltende Krise d&uuml;rfte vielmehr
durch unzureichende Reformanstrengungen und falsche Ma&szlig;nahmen der
Wirtschaftspolitik verursacht worden sein. Die fehlende Entschlossenheit,
die offensichtlichen Probleme im Zusammenhang mit den notleidenden Krediten
z&uuml;gig zu bereinigen, d&uuml;rfte eine der Hauptursachen f&uuml;r die
L&auml;hmung der japanischen Wirtschaft sein. Es ist also nicht die
geringf&uuml;gige Deflation, die die japanische Wirtschaft an der
R&uuml;ckkehr zum Wirtschaftswachstum hindert, sondern der fehlende
Reformwille der Wirtschaftspolitik, der die japanische Wirtschaft
l&auml;hmt.Wenn &uuml;berhaupt eine Parallele zwischen Deutschland und
Japan gezogen werden kann, dann die einer allzu z&ouml;gerlichen
Reformpolitik. Nach wie vor gibt es Auftriebskr&auml;fte f&uuml;r die
Preise Die Warnungen vor Deflationsgefahren lassen in aller Regel
au&szlig;er Acht, dass es weiterhin eine ganze Reihe von Entwicklungen
gibt, die eher in Richtung steigender Preise wirken werden. Dazu z&auml;hlt
in Deutschland vor allem die Entwicklung der Preise f&uuml;r
Dienstleistungen. Sie steigen nach wie vor st&auml;rker als der Preisindex
insgesamt. Da die Preise f&uuml;r Dienstleistungen auch kaum von der
Aufwertung des Euro profitieren werden, Verbraucherpreise insgesamt
Gest&uuml;tzt wird die Entwicklung der Verbraucherpreise auch weiterhin von
der Kostenseite. Zwar d&uuml;rfte es vielen Unternehmen in der aktuellen
Konjunkturlage schwerer fallen, gestiegene Kosten durch eine Anhebung der
Preise weiterzugeben; dies bedeutet jedoch nicht, dass diese
M&ouml;glichkeit g&auml;nzlich entfallen ist. Noch immer geht von der
Entwicklung der L&ouml;hne ein anhaltender Preisdruck aus. Sowohl
Tarifl&ouml;hne als auch Lohnst&uuml;ckkosten setzten bis in die
j&uuml;ngste Vergangenheit ihren Anstieg fort. Die Tarifverdienste sind in
Deutschland im vergangenen Jahr um rund 2,5 % gestiegen. In diesem Jahr
wird ein &auml;hnlich hoher Anstieg erwartet. Wichtig sind
schlie&szlig;lich die Erwartungen der Konsumenten und Unternehmen. Deren
Ausgabeverhalten wird zwar gegenw&auml;rtig durch die insgesamt schlechte
Wirtschaftslage und die Unsicherheiten hinsichtlich der anstehenden
Reformma&szlig;nahmen ged&auml;mpft, ein Kauf-Attentismus ist aber auch
nach den j&uuml;ngsten Daten zum Wirtschaftswachstum nicht erkennbar. Der
Anstieg der Sparquote auf inzwischen wieder 10,4 % kann ebenfalls nicht in
dieser Weise gedeutet werden. Dieser Anstieg ist vielmehr die R&uuml;ckkehr
zu einem f&uuml;r Deutschland normalen Sparniveau, nachdem die Quote
w&auml;hrend der Aktienhausse bis zum Jahr 2000 deutlich gesunken war.</P>

<H3>Ist die EZB blind f&uuml;r die Gefahren der Deflation?</H3>

<P>Die Geldpolitik der EZB ist der Geldwertstabilit&auml;t des Euro im
gesamten W&auml;hrungsraum verpflichtet. Da die wirtschaftliche Entwicklung
in den einzelnen L&auml;ndern divergiert,weisen auch die nationalen
Preissteigerungsraten starke Unterschiede auf. Hinter dem Anstieg der
Verbraucherpreise im Euro-Raum um 2,2 % im vergangenen Jahr verbirgt sich
also ein breites Spektrum nationaler Inflationsraten. Diese Unterschiede
lassen sich im Wesentlichen durch die unterschiedliche
Wachstumsgeschwindigkeit in den einzelnen Mitgliedsl&auml;ndern
erkl&auml;ren. Daraus ergeben sich allerdings einige Probleme. Da die
Nominalzinsen innerhalb des W&auml;hrungsraums weitgehend ein einheitliches
Niveau aufweisen, divergieren die Realzinsen. L&auml;nder mit
unterdurchschnittlicher Inflationsrate verzeichnen einen
&uuml;berdurchschnittlichen Realzins, in L&auml;ndern mit
&uuml;berdurchschnittlicher Inflationsrate ist es umgekehrt. Dies kann im
Konjunkturverlauf zu prozyklischen Effekten f&uuml;hren, im Falle
Deutschlands k&ouml;nnte also die Investitionst&auml;tigkeit
zus&auml;tzlich dadurch gebremst werden, dass die Geldpolitik der EZB auf
den gesamten W&auml;hrungsraum ausgerichtet ist und nicht speziell auf die
wirtschaftliche Situation in Deutschland.</P>

<P>In der gegenw&auml;rtigen Diskussion richtet sich das Augenmerk
allerdings auf die Tatsache, dass bei einer starken Streuung der
Inflationsraten einige L&auml;nder &ndash; wie Deutschland &ndash; deutlich
niedrigere Preisanstiege als der EWU-Durchschnitt aufweisen. Damit in
diesem Fall ein Land nicht in die N&auml;he einer deflation&auml;ren
Entwicklung kommt,wird von den Notenbanken die mit
Preisniveaustabilit&auml;t vereinbare Teuerungsrate h&ouml;her als 0 %
angesetzt. Das Stabilit&auml;tsziel der EZB mit einer Preissteigerungsrate
von nahe 2 % tr&auml;gt also der Gefahr der Deflation in ausreichendem
Ma&szlig;e Rechnung. Ein weiterer Grund f&uuml;r die Zentralbank, einen
gewissen Abstand zur Null-Linie zu halten, ist die Tatsache, dass der
Preisindex in aller Regel die Inflation &uuml;berzeichnet. In den USA wurde
dieser Effekt lange Zeit auf einen halben bis einen Prozentpunkt
gesch&auml;tzt.In der EWU d&uuml;rfte dieser Effekt nicht so
ausgepr&auml;gt sein, aber sicherheitshalber sollte von einem halben
Prozentpunkt als Fehlermarge ausgegangen werden.</P>

<P><TABLE border="1" bgcolor="#c0c0c0" width="50%" align=
"right">
<TR>
<TD>
<H4>Die Liquidit&auml;tsfalle</H4>

<P><FONT size="-1">Die Liquidit&auml;tsfalle ist das Trauma der
Geldpolitik. Der Begriff umschreibt eine Situation, in der der Versuch der
Notenbank, durch ein gr&ouml;&szlig;eres Geldangebot der Wirtschaft neue
Wachstumsimpulse zu geben, wirkungslos verpufft, da das Geld nicht wieder
in den Geldkreislauf gelangt, sondern von Unternehmen und Haushalten
gehortet wird. Voraussetzung hierf&uuml;r ist ein Zinsniveau nahe null, so
dass die Notenbank ihre Zinsen auf Grund des erreichten niedrigen Niveaus
nicht mehr weiter senken kann.</FONT></P>

<P><FONT size="-1">Bei einem Refinanzierungssatz von 2,5 % ist der
Handlungsspielraum der EZB noch ausreichend gro&szlig;, um im Falle eines
weiteren Inflationsr&uuml;ckgangs durch Zinssenkungen einem Verfall des
Preisniveaus entgegenzuwirken.</FONT></P>
</TD>
</TR>
</TABLE>
Ein ausreichender Abstand der Inflationsrate zur Null-Linie ist sicherlich
auch erforderlich,um die Handlungsf&auml;higkeit der Geldpolitik zu
erhalten. Diese d&uuml;rfte n&auml;mlich dann nicht mehr gegeben sein, wenn
der Nominalzins auf null gesunken ist. Sp&auml;testens dann besteht die
akute Gefahr einer Liquidit&auml;tsfalle (siehe Kasten).J&uuml;ngste
&Uuml;berlegungen in den USA, dass die Geldpolitik auch in einem solchen
Fall noch handlungsf&auml;hig sei,etwa durch den Ankauf festverzinslicher
Wertpapiere, sind mit Vorsicht zu genie&szlig;en. Die Erfahrungen in Japan
lassen jedenfalls keinen allzu gro&szlig;en Optimismus hinsichtlich einer
solchen Situation zu. Hinzu kommt, dass der EZB der Ankauf staatlicher
Wertpapiere verboten ist, diese M&ouml;glichkeit in der EWU also gar nicht
besteht. </P>

<H3>Kann es eine Deflation in Teilen einer W&auml;hrungsunion geben?</H3>

<P>Mit Beginn der W&auml;hrungsunion ist Deutschland nur noch ein Teil
eines einheitlichen W&auml;hrungsraums. Die Abschirmung vor den
Auswirkungen wirtschaftlicher Entwicklungen in anderen L&auml;ndern durch
den Wechselkurs ist nun nicht mehr m&ouml;glich. Vielmehr bildet die
W&auml;hrungsunion einen einheitlichen Markt mit direktem
Preiszusammenhang. Die Auswirkungen unterschiedlicher Preissteigerungsraten
sind damit innerhalb der EWU prinzipiell &auml;hnlich zu gewichten wie
Differenzen in der Preisentwicklung einzelner Bundesl&auml;nder vor der
W&auml;hrungsunion. Niemand w&auml;re jemals auf die Idee gekommen, dass
ein einzelnes Bundesland in eine Deflation geraten k&ouml;nne. Dabei sind
und waren die regionalen Wachstumsdivergenzen durchaus betr&auml;chtlich,
und auch die Preissteigerungsraten divergieren zeitweise recht stark.</P>

<P>Der Grund daf&uuml;r, dass in Bundesl&auml;ndern mit einem
unterdurchschnittlichen Preisanstieg keineswegs eine Deflation drohte, ist
recht einfach. Durch den geringeren Preisanstieg verbesserte sich die
Wettbewerbsf&auml;higkeit der ans&auml;ssigen Unternehmen.</P>

<P>Die Nachfrage nach ihren Produkten stieg und st&uuml;tzte damit sowohl
das regionale Wirtschaftswachstum als auch die Preisentwicklung. Dieser
enge preisliche Zusammenhang gilt nicht nur regional oder national,sondern
- wie zahlreiche Untersuchungen gezeigt haben - auch international. Ist
diese These richtig, kann Deutschland als Teil der EWU allein nicht in eine
Deflation geraten. Bereits jetzt verbessert sich die preisliche
Wettbewerbsf&auml;higkeit der Unternehmen in Deutschland kontinuierlich,
weil die Inflationsrate in Deutschland unterhalb des Durchschnitts der EWU
liegt. Sollte das Preisniveau in Deutschland tats&auml;chlich
vor&uuml;bergehend sinken, so w&uuml;rde sich dieser Effekt weiter
verst&auml;rken.</P>

<P>Durch den internationalen Preiszusammenhang steigt die Nachfrage nach
den preiswerteren deutschen Produkten. Mit dem Anstieg der Exporte in die
EWU-L&auml;nder k&auml;me die Deflation aber automatisch zum Stillstand.
Dieser Gewinn an internationaler Wettbewerbsf&auml;higkeit ist f&uuml;r die
deutsche Wirtschaft nicht zu untersch&auml;tzen. Immerhin gingen im
vergangenen Jahr 43 % der deutschen Exporte in die L&auml;nder der EWU.</P>

<P>Der internationale Preiszusammenhang beruht auf dem grundlegenden
Prinzip der Arbitrage. Darunter versteht man, dass Wirtschaftssubjekte
(Arbitrageure) bei regionalen Preisdifferenzen f&uuml;r ein identisches
handelbares Gut einen starken Anreiz haben, dieses am billigeren Ort
anzukaufen und es am teureren Ort wieder zu verkaufen. Arbitrage f&uuml;hrt
dann im Prinzip dazu, dass handelbare G&uuml;ter &uuml;berall zu einem
einheitlichen Preis angeboten werden.</P>

<P>Die Voraussetzungen f&uuml;r Abweichungen von diesem "Gesetz",
n&auml;mlich Z&ouml;lle oder nicht-tarif&auml;re Handelshemmnisse,
existieren in der EWU nicht. Durch die gemeinsame W&auml;hrung wurden auch
die Transaktionskosten des Devisenumtauschs und der
W&auml;hrungsabsicherung beseitigt. Preisunterschiede k&ouml;nnen in der
EWU direkt beobachtet werden. Wenn nun in Deutschland das Preisniveau
konstant ist, die Preise im Ausland aber steigen, dann ist es f&uuml;r die
inl&auml;ndischen Unternehmer einfacher, ihre Produkte international
abzusetzen. Der internationale Preiszusammenhang Verst&auml;rkt wird dieser
Effekt durch den Umstand,dass das Wirtschaftswachstum in den &uuml;brigen
EWU-L&auml;ndern h&ouml;her ist als in Deutschland. Im Ergebnis
d&uuml;rften die EWUL&auml;nder also per saldo Deutschland "mitziehen",
anstatt umgekehrt von diesem nach unten gezogen zu werden.</P>

<P>Gegen das Argument des internationalen Preiszusammenhangs wird
h&auml;ufig vorgebracht, dass mit einer unterdurchschnittlichen
Inflationsrate in Deutschland auch ein &uuml;berdurchschnittliches Niveau
der realen Zinsen einhergeht. Dadurch werde die wirtschaftliche
Entwicklung, insbesondere aber die Investitionst&auml;tigkeit,gebremst.
Diesem Argument steht allerdings entgegen, dass in Zeiten einer Stagnation
mit geringer Kapazit&auml;tsauslastung die Abh&auml;ngigkeit der
Investitionen von den Zinsen gelockert ist. Dies h&auml;ngt damit zusammen,
dass zum einen die Bedeutung von Ersatzinvestitionen gr&ouml;&szlig;er ist
als in einer Phase wirtschaftlicher Expansion und zum anderen die
Unternehmen vor allem auf die Entwicklung der Nachfrage und der
Kapazit&auml;tsauslastung reagieren.</P>

<H3>Fazit</H3>

<P>Die Warnungen vor einer Deflation in Deutschland scheinen bei genauerer
Betrachtung als weit &uuml;berzogen. Dass sie gleichwohl einen so starken
Widerhall fanden und eine &ouml;ffentliche Diskussion in Deutschland
ausl&ouml;sten, ist ein sichtbares Zeichen f&uuml;r die Zweifel, die
hierzulande inzwischen bez&uuml;glich der wirtschaftlichen St&auml;rke und
des Verm&ouml;gens der Wirtschaftspolitik, Reformen
durchzusetzen,bestehen.</P>

<P>Die Antwort auf die Warnung des IWF kann deshalb allein die
Wirtschaftspolitik geben. Eine z&uuml;gige Umsetzung der Agenda 2010 und
das rasche In-Angriff-Nehmen weiterer Reformschritte w&uuml;rden das
Vertrauen in die Wirtschaftskraft Deutschlands wieder herstellen und alle
Deflationsauguren verstummen lassen.</P>

<P>Berlin, Juni 2003<BR>
AZF 06/2003</P>

<TABLE border="0" summary="">
<TR>
<TD valign="top"><IMG src="st_wolf2.gif" width="57"
height="57" alt="dbb-Logo"></TD>

<TD><FONT size="-1">Bundesverband deutscher
Banken<BR>
Postfach 04 03 07 - 10062 Berlin<BR>
Telefon: 030/16 63-0<BR>
Telefax: 030/16 63-1399<BR>
Internet: www.bdb.de</FONT> </TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>

<CENTER>
<TABLE border="8" width="95%" cellspacing="0" cellpadding="8" summary="">
<TR bgcolor="#88ccff">
<TD align="center">&nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
<TD align="center"><FONT color="#0000ff"><B>wolf@nc-mag.de</B></FONT> </TD>
<TD align="center"><FONT color="#0000ff"><B>http://www.nc-mag.de</B></FONT> </TD>
</TR>
</TABLE>
</CENTER>
<BR>
</BODY>
</HTML>

