<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      Laut und Leise
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling 090703">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE summary="" width="98%" align="center" border="0" cellspacing="0" cellpadding="8">
      <TR>
        <TD>
          <H1 align="center">
            Laut und Leise
          </H1>
          <BR>

          <P>
            Computernutzter mit Familie wissen wovon ich rede: Man sitzt am Computer, spielt oder macht sonst etwas mit dem Rechenknecht was Ger&auml;usche verursacht, und dauernd bekommt man zu
            h&ouml;ren: "mach das Ding leiser" oder "schalt doch den Ton ab!"<BR>
             Oder man m&ouml;chte selbst in Ruhe ohne St&ouml;rungen am Computer Musik h&ouml;ren, hat aber keinen Kopfh&ouml;rer-Anschlu&szlig; an seinen Computer-Boxen.
          </P>
          <P>
            F&uuml;r alle Computer-Ger&auml;usch-Genervten-Familienmitglieder und Musik-Liebhaber habe ich etwas gefunden:<BR>
             Es nennt sich <I>PC-Audio-Adapter "DAP".</I> Das ist ein kleines Weiss-Blaues K&auml;stchen mit drei Klinken-Buchsen und zwei Klinken-Steckern. Alles in 3.5 mm Ausf&uuml;hrung und in
            Stereo.
          </P>
          <CENTER>
            <IMG src="tt_audio-adapter.jpg" alt="PC-Audio-Adapter DAP" width="216" height="187">
          </CENTER>
          <P>
            Der Anschlu&szlig; dieses Adapters ist recht Simpel: Die ca. 130 cm lange Zuleitung komm an der Computer. Amiga-Benutzter brauchen noch einen Adapter von den beiden Amiga-Chinch-Buchsen
            auf eine 3,5 mm Stereo-Buchse. Wie auf dem Bild zu erkennen ist, besitzt der Audio-Adapter aber zwei Klinken-Stecker. Leicht erkl&auml;rt: An diesen Adapter kann zus&auml;tzlich das
            Mikrofon eines Headsets angeschlossen werden. Die Mikrofon-Buchse und die Kopfh&ouml;rer-Buchse sind vorne, der Anschluss f&uuml;r die PC-Lautsprecher befindet sich hinten neben der
            Zuleitung.<BR>
             Das Umschalten zwischen Lautsprecher und Kopfh&ouml;rer erfolgt durch einen Druckschalter, der sich mittig auf dem Adapter befindet.
          </P>
          <P>
            Der Adapter hat die Ma&szlig;e von 50 x 50 mm und eine H&ouml;he von 27 mm. Befestigen kann man dieses Teil mittels eines mitgelieferten Klebepads am Monitor oder direkt an einem der
            Lautsprecher.<BR>
             Die Verarbeitung dieses Adapter und die Kabell&auml;nge sind vollkommen in Ordnung, der Preis von 9.95 Euro angemessen. Bitte daran denken, es kommen noch Versandtkosten von ca. 5 Euro
            dazu.
          </P>
          <P>
            <B>Mein Fazit</B>: F&uuml;r all jene ein brauchbares Teil, die nicht zum Umstecken von Lautsprecher auf Kopfh&ouml;rer unter den Schreitisch kriechen wollen.
          </P>
          <P>
            <B>Bezugsquelle:</B> Conrad&nbsp; <A href="http://www.conrad.de">www.conrad.de</A> &nbsp;92240 Hirschau &nbsp; Tel.: 0180 5312111<BR>
             <B>Bestell-Nr.</B>: 99&nbsp;24 &nbsp;97<BR>
             <B>Preis:</B> 9.95 Euro
          </P>
          <HR>
          <BR>

          <CENTER>
            <TABLE border summary="">
              <TR>
                <TH bgcolor="#CCCCCC">
                  <FONT color="#f3300CC">JoJo</FONT> &nbsp; J&uuml;rgen Sperling
                </TH>
              </TR>
              <TR>
                <TH bgcolor="#FFFFCC">
                  sperlingbergen@freenet.de
                </TH>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

