<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Neues zum AmigaNG
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>5. Statusbericht von Eyetech zum AmigaOne</H2>
<P>
Ulrich Beckers (<A HREF="mailto:ujb@via-altera.de">ujb@via-altera.de</A>) hat sich f&uuml;r unseren Partner amiga-
news.de die Riesenarbeit gemacht, das j&uuml;ngste Statement von Eyetech zum
PowerPC-Mainboard AmigaOne zu &uuml;bersetzen und uns freundlicherweise die
Erlaubnis erteilt, den Text in AMIGA aktuell zu ver&ouml;ffentlichen.
Achtung: Nachtr&auml;glich hat Eyetech den Namen des Produkts in AmigaOneG3-SE
abge&auml;ndert.
</P>
<P><B>&raquo;Zur sofortigen Ver&ouml;ffentlichung</B></P>
<P><B>Der A1.5 ist nun fertig!</B></P>
<P>
Der AmigaOne.5 ist jetzt fertig f&uuml;r die Produktion und erm&auml;&szlig;igte
Bestellungen f&uuml;r Entwickler/H&auml;ndler/OS4 Beta-Tester zur Auslieferung im
April werden nun angenommen (aber nur bis Sonntag, den 24. M&auml;rz 2002
Mitternacht GMT). Dieses Enddatum ist notwendig, damit wir die Menge der
anf&auml;nglich zu produzierenden Boards bestimmen, und die Bestellung an den
Hersteller geben k&ouml;nnen. K&auml;ufern dieser Boards wird die M&ouml;glichkeit
gegeben, einen Rabatt auf die volle User-Version des OS4.0 zu bekommen,
wenn es ver&ouml;ffentlicht ist.
</P>
<P>
Falls Sie sich vormals als Betatester oder H&auml;ndler beworben haben, M&Uuml;SSEN
SIE SICH NEU BEWERBEN, da wir nun keine Betatester f&uuml;r das A1 Board selber
mehr ben&ouml;tigen, nur noch f&uuml;r OS4 und Applikationen, die damit laufen (oder
laufen sollten!). Falls Sie ein H&auml;ndler sind, vermerken Sie dieses bitte
auf Ihrer Bestellung, die H&auml;ndlerpreise werden dann zu Ihnen
weitergeleitet.
</P>
<P>
Die Hauptproduktion wird zeitlich so angesetzt, dass die Boards zeitgleich
zur Kundenver&ouml;ffentlichung des OS4 fertig sind, wahrscheinlich im Mai
2002.
</P>
<P>
Die Entwickler/H&auml;ndlerboards und (mindestens) die erste Charge der
Produktion werden mit aufgel&ouml;teter G3 PPC CPU bei 600 MHz, welche einen
markanten Geschwindigkeitszuwachs gegen&uuml;ber existierenden G2-
(Blizzard/Cyberstorm-)PPC-Beschleunigern geben werden, ausgeliefert. Das
feste Verl&ouml;ten der CPU - anstatt einen BGA Sockel oder eine
CPU-Tr&auml;gerkarte zu verwenden - erm&ouml;glicht uns die Zuverl&auml;ssigkeit sehr
hoch, und den Preis so gering wie m&ouml;glich zu halten. (BGA Sockel und/oder
CPU-Tr&auml;gerkarten addieren einen gro&szlig;en Betrag zu den Kosten des Boards).
</P>
<P>
Da OS4 Versionen (oder Anwendungssoftware) entwickelt werden, die Gebrauch
der Altivec-Einheit des G4 machen, werden wir eine, ebenso fest verl&ouml;tete
(mit MPC 7441 @700 MHz), G4 Version verf&uuml;gbar machen. Es k&ouml;nnte m&ouml;glich
sein, dass wir eine Version mit CPU Sockel produzieren, aber nur, wenn die
Kosten auf eine Erh&ouml;hung von nicht mehr als 15% gegen&uuml;ber der verl&ouml;teten
CPU gesenkt werden k&ouml;nnen.
</P>
<P><B>Der A1.5? Was geschah mit dem Original-A1?</B></P>
<P>
Im Oktober 2000, als wir das Design f&uuml;r den A1 entwarfen, war kein
kommerziell verf&uuml;gbarer 'Northbridge' Chip (das Interface zwischen CPU,
Speicher und PCI Bus) in verh&auml;ltnism&auml;&szlig;ig kleinen Margen, die wir
ben&ouml;tigten, zu einem &ouml;konomischen Preis zu bekommen. 'Southbridge' Chips
waren verf&uuml;gbar (diese verwalten das Systemtiming, Interrupts, etc. und
beinhalten, traditionell, die Peripheriefunktionen geringerer
Geschwindigkeit, wie etwa IDE, USB etc.) aber nat&uuml;rlich gab es diese nicht
mit eingebauter A1200-PCI Bridge, welche aus spezieller Logik h&auml;tte
gebaut werden m&uuml;ssen (Anm. des &Uuml;bers.: Diese spezielle oder custom - Logik
basiert auf g&auml;ngigen frei programmierbaren Logikbausteinen). Es machte
daher &ouml;konomischen Sinn, eine spezielle Southbridge zu bauen, welche die
A1200-PCI Bridge beherbergte - aber ohne die integrierten
Peripheriebausteine (welche sowieso als separate Chips zu geringen Preisen
verf&uuml;gbar waren). Die Arbeit lief bis April/Mai gut am A1 Design... Aber
nicht viel - zumindest nicht genug, um &uuml;berhaupt zu &uuml;berlegen, die
Produktion zu beginnen - geschah mit OS4 in diesem Stadium. Daher
reduzierten wir die Entwicklungsarbeit an der Hardware und konzentrierten
uns darauf, eine arbeitsf&auml;hige L&ouml;sung f&uuml;r OS4 zu erm&ouml;glichen.
</P>
<P>
Zu der Zeit, als die OS4-Entwicklung im fr&uuml;hen November unterzeichnet
wurde, hatte sich die Welt weiterbewegt. Kommerziell verf&uuml;gbare PPC
Northbridgechips waren verf&uuml;gbar und, kombiniert mit Standard
Southbridgechips, erm&ouml;glichten eine bessere Preis-Leistung als das
spezielle A1 Chip Design und dieses (seit auch schon die 'big boys' diese
erfolgreich nutzen) ohne das Risiko von im Inneren liegender Fehler jeder
L&ouml;sung aus spezieller Logik. Dieses bedeutete, dass nur die eine einzige
aus spezieller Logik bestehende Funktion ben&ouml;tigt wurde, die der A1200-PCI
Bridge.
</P>
<P>
Daneben hatten viele Leute den Wunsch nach einem Stand-alone-A1-Board, ohne
einen Bedarf (oder M&ouml;glichkeit) hardwareabh&auml;ngiger Applikationen, ge&auml;u&szlig;ert.
Zus&auml;tzlich haben Hyperion besseren Fortschritt beim Losl&ouml;sen der Amiga
Chipset-Abh&auml;ngigkeiten als erwartet gemacht, mit dem Ergebnis, dass das
auf ein Amiga-Chipset angewiesen sein zu einem sehr fr&uuml;hen Stadium des OS
4 Ver&ouml;ffentlichungsreihe enden kann. (Nat&uuml;rlich ben&ouml;tigen die Hardware
direkt ansprechende Applikationen, zu einem gr&ouml;&szlig;eren oder kleineren Teil,
Zugriff auf ein echtes Amiga-Chipset). Dieses zusammengenommen, dachten
wir, dass es sinnvoll w&auml;re, eine Amiga-Chipset Verf&uuml;gbarkeit als Option
bereitzustellen, so dass auf das A1 Board nicht die Kosten f&uuml;r die
Bereitstellung dieser Verbindung aufgeschlagen werden - genauer jene f&uuml;r
PCB, Komponentenbeherbergung und den Bedarf eines speziellen Towers um
dieses einzubauen. Das Ergebnis ist, dass Escena eine L&ouml;sung liefert, die
erm&ouml;glicht, einen A1200 mittels eines Flachbandkabels von einer PCI-Karte
zum A1200-Expansionport zu verbinden. Die Verwendung eines Flachbandkabels
wird auch beim L&ouml;sen des Problems &quot;Wird es in Tower XYZ laufen&quot; helfen, da
es so einen Spielraum (in Grenzen) der A1 und A1200 Positionierung gibt.
Die A1200 PCI Bridge wird als gesondert verkauft, f&uuml;r jene, die eine
brauchen.
</P>
<P><B>&Uuml;berarbeite Spezifikation f&uuml;r den AmigaOne.5</B></P>
<P>
&Uuml;ber etwa einem Jahr, seit die originalen AmigaOne-Spezifikationen zuerst
ver&ouml;ffentlicht wurden, bekamen wir eine Menge privates - und mehr als
genug &ouml;ffentliches - Feedback dessen, was die Leute gerne in den AmigaOne-
Spezifikationen sehen w&uuml;rden, au&szlig;er dem, was wir ver&ouml;ffentlicht haben.
Nat&uuml;rlich waren einige dieser W&uuml;nsche kommerziell v&ouml;llig unrealistisch
(Beispielzitat: &quot;Warum baut ihr nicht einen Gameboy-gro&szlig;en und -teuren
AmigaOne mit der Leistung einer Top-SGI-Workstation, die mit einer
Mignonbatterie 6 Monate l&auml;uft, vom User aufr&uuml;stbar und mit der A500 WB1.3
Floppydisk l&auml;uft&quot;) - aber da waren auch eine Menge sinnvoller Kommentare.
</P>
<P>
Das haupts&auml;chlich n&uuml;tzliche Feedback kam w&auml;hrend des vergangenen Jahres
bez&uuml;glich des Originaldesigns - und der Weg mit dem der AmigaOne.5 dieses
ber&uuml;cksichtigt, kann folgenderma&szlig;en zusammengefasst werden:
</P>
<P><B>CPU speed concerns</B></P>
<P>
The AmigaOnepoint5 will handle G3/G4 CPU's to their current clocking limits
(but, of course, subject to chip availability at the higher end - Apple
currently absorbs most of these chips under contract).
</P>
<P><B>Memory speed concerns</B></P>
<P>
The AmigaOnepoint5 supports 133MHz FSB SDRAM. (According to our engineers
DDR memory doesn't gain anything in help PPC board design).
</P>
<P><B>Provision of legacy peripherals</B></P>
<P>
The AmigaOnepoint5 has on board FDD, serial, parallel, PS2 kb &amp; PS2 mouse
ports.
</P>
<P><B>Provision of integrated peripherals</B></P>
<P>
The AmigaOnepoint5 provides 2x USB on the motherboard rear ATX I/O panel) +
2 more on headers (for using a front bay outlet), 10/100 ethernet, AC97
audio and MC97 data/fax/modem, and UDMA 100 hard disk/ATAPI interface (2
channels - 4 devices).
</P>
<P><B>Graphics interface speed</B></P>
<P>
The AmigaOnepoint5 supports a 2x AGP bus, and PCI graphics cards at 66 MHz.
</P>
<P><B>Will it run Linux?</B></P>
<P>
Yes - in fact that's how the AmigaOnepoint5 hardware design was debugged.
The developer editions will be shipped with Linux PPC and UAE PPC install
CD's.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">I don't need hardware-hitting application compatibility&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
The AmigaOnepoint5 will run in standalone mode as soon as OS4.0 has had all
the legacy hardware dependency removed from it. As most of this (according
to Hyperion) was in the already-rewritten exec.library this full hardware
independence will be introduced very soon after the first release of OS4,
if not actually incorporated into it. If your application itself still
requires the presence of the original Amiga chipset then you will need to
use the optional PCI/Amiga bridgeboard.
</P>
<P>
Will it fit in an EZTower Mk1-5 / Elbox tower / standard ATX tower?
</P>
<P>
The AmigaOnepoint5 has a full ATX form factor and will therefore fit into
any suitable ATX tower with a 250W or higher PSU. It will fit directly into
the EZTower Mk4 &amp; 5 (these will need the AT PSU replacing with an ATX
unit) in the PC board position, and into the EZTower Mk1-3 (which will
need a minor amount of metalwork to accommodate the back panel ATX I/O
connectors &amp; an ATX PSU). The EZTower Mk1-5 also allow an A1200
motherboard to be mounted within the same case as the AmigaOnepoint5
board.
</P>
<P>
The EZTower-Z4, the Power/Elbox Tower and any other Amiga-specific tower
design are not suitable for the AmigaOnepoint5 board without substantial
modification. However if you have purchased an Eyetech EZTower-Z4 directly
from us since 1st January 2001 please read the special arrangements we have
made for you in the FAQ's below.
</P>
<P><B>Die Zusammenfassung der AmigaOne.5 Ausstattung:</B></P>
<UL>
<LI> 4 x PCI-Slots + 1 x AGP-Slot auf zwei Bussen
</LI>
<BR><LI> 10/100 Mbps Ethernet
</LI>
<BR><LI> 2 x USB Stecker + 2 weitere als Header [Anm. d. &Uuml;bersetzers: Was der
     &quot;Header&quot; ist, wei&szlig; ich nicht, es d&uuml;rfte sich um einen Anschluss auf
     dem Mainboard ohne Stecker handeln..]
</LI>
<BR><LI> 2 x UDMA 100 Kan&auml;le (f&uuml;r 4 Ger&auml;te)
</LI>
<BR><LI> Open-firmware-kompatibles BIOS mit OS4.0-Erweiterungen und
     nichtfl&uuml;chtigem Speicher
</LI>
<BR><LI> PS2 Maus- und Tastaturanschluss
</LI>
<BR><LI> Sound, Modem und Game-I/O &uuml;ber den AMR-Port
</LI>
<BR><LI> Anschl&uuml;sse: Parallel, Seriell &amp; Floppy (PC-FDD-Controller)
</LI>
<BR><LI> Echtzeituhr
</LI>
<BR><LI> 2 x SD-RAM-Sockel f&uuml;r maximal 2 GByte Hauptspeicher
</LI>
</UL>
<P><B>CPU Optionen</B></P>
<P>
Was die CPU betrifft, wird die erste Serie der Boards eine fest verl&ouml;tete
600 MHz G3 CPU haben und daher die Kosten so gering wie m&ouml;glich halten. So
wie die G4s im Preis fallen/besser verf&uuml;gbar sind, werden wir eine Option
einer festverl&ouml;teten G4 CPU bieten. Wenn wir die Mehrkosten einer
Sockel/CPU-Tr&auml;gerkarte auf einen Aufpreis unterhalb von 15% der Kosten der
verl&ouml;teten entsprechenden Version dr&uuml;cken k&ouml;nnen, werden wir &uuml;berlegen,
diese Versionen zu produzieren.
</P>
<P>
Was geschieht, wenn Sie ein Einstiegsmodell kaufen und in einem Jahr oder
so aufr&uuml;sten wollen? Nun, genau das gleiche, wie wenn Sie vor einigen
Jahren eine Beschleunigerkarte kauften und diese nun aufr&uuml;sten wollen
(aber dieses Mal bekommen Sie einen ganzen Computer gratis dazu!). Sie
k&ouml;nnen ihn entweder privat verkaufen oder beim H&auml;ndler, bei dem Sie ihn
kauften, in Zahlung geben. &Uuml;brigens wird im PC-Markt, obwohl alle
Prozessoren gesockelt sind, bei fast keinem jemals die CPU gewechselt -
sie kaufen fast alle (mindestens) ebenso ein neues Motherboard. Wir ziehen
da nur gleich!
</P>
<P><B>AmigaOne.5 Verf&uuml;gbarkeit</B></P>
<P>
Um die Preise niedrig zu halten und die Qualit&auml;t hoch, werden die Boards im
fernen Osten hergestellt. Die Lieferung zu uns in das vereinigte K&ouml;nigreich
wird etwa 4 Wochen nach unserer Bestellung beim Hersteller sein. Die
Entwickler/H&auml;ndler Boards werden am 25. M&auml;rz bestellt und an jene
zugeteilt, die Ihre Bestellung, inklusive Bezahlungsbedingungen, vor
Sonntag, dem 24. M&auml;rz um Mitternacht GMT machten. Die Boards sind nicht
vor Auslieferung zu zahlen.
</P>
<P>
Die Hauptproduktionsbestellung wird get&auml;tigt, wenn Hyperion uns mitteilt,
wann sie die OS4 Ver&ouml;ffentlichung f&uuml;r Endkunden vornehmen werden.
Hyperions Webseite wird regelm&auml;&szlig;ig aktuelle OS 4
Ver&ouml;ffentlichungsinformationen bieten. Wir laden Amiga H&auml;ndler dann dazu
ein, feste Bestellmengen an uns zu richten, die Auslieferung erfolgt in
der Reihenfolge der Bestelleing&auml;nge (FIFO, first in - first out). Es wird
eine minimale Bestellmenge und Supportleistungsbedingungen geben, um ein
AmigaOne.5 H&auml;ndler zu werden. Die aktualisierten A1 H&auml;ndlerbedingungen
werden auf der Mailingliste auf www.yahoogroups.com/group/a1dealer
ver&ouml;ffentlicht.
</P>
<P>
F&uuml;r H&auml;ndler (und Endkunden) wird es zwingend sein, pro AmigaOne.5 Mainboard
oder System eine Kopie des OS4 zu kaufen. H&auml;ndler k&ouml;nnen OS4 direkt bei
Hyperion erwerben.
</P>
<P><B>AmigaOne.5 Preise</B></P>
<P>
H&auml;ndler sind frei, eigene Endkundenpreise festzulegen, sowohl f&uuml;r
AmigaOne.5Boards als auch f&uuml;r Komplettsysteme, um den anfallenden Steuern,
Lokalisierung des Supports, Dokumentation etc. Rechnung zu tragen.
Ansonsten betr&auml;gt unser empfohlener Preis inklusive eines 750CXe 600Mhz G3
Prozessors, aber ohne lokale [Anm. d. &Uuml;bersetzers: In der BRD dann wohl +
16% MwSt] Steuern und Liefergeb&uuml;hren, 350 £, 500 US$, 600 EUR.
</P>
<P>
Die OS4 Preise werden von Hyperion bestimmt, aber werden so um die 42.50 £,
62.50 US$, 70 EUR sein (exklusive lokaler Steuern) wenn es mit einem
AmigaOne.5 Board oder System gekauft wird. Der Einzelpreis f&uuml;r OS4 (f&uuml;r
Nutzung mit CyberstormPPC etc.) wird etwa 51 £, 74 US$, 84 EUR sein
(exklusive Steuern und Versand).
</P>
<P><B>Entwickler/OS4 Beta Tester Systeme</B></P>
<P>
Eine begrenzte Zahl von Entwicklern/H&auml;ndlern [Anm. d. &Uuml;bers.: Hier steht
wirklich H&auml;ndler, sch&auml;tze aber mal, dass Betatester gemeint ist]
AmigaOne.5-Boards wird f&uuml;r jene, die eine Bestellung vor Mitternacht GMT
am Sonntag, den 24. M&auml;rz gemacht haben, im April zur Auslieferung bereit
sein. Diese werden voll funktional und getestet sein, identisch denen, die
in der ersten Produktionsserie gefertigt werden. Diese Entwicklerboards
werden mit LinuxPPC und UAE PPC auf CD (muss selbst installiert werden)
geliefert, eine Beta-Version des OS 4.0 wird von Hyperions Webseite f&uuml;r
die K&auml;ufer des Boards als Download verf&uuml;gbar sein. [Anmerkung des
&Uuml;bersetzers: hier folgt wohl eine falsche Textformatierung, ein Satz wird
wiederholt]. Eyetech bietet keinen direkten Support zur Installation von
LinuxPPC oder UAE PPC, au&szlig;er durch unsere Webseiten. Wenn Sie glauben,
dass diese Aufgabe jenseits Ihrer F&auml;higkeiten liegt, bestellen Sie bitte
kein Entwicklerboard - es ist nicht f&uuml;r Sie gedacht.
</P>
<P>
Die Entwicklerboards werden zu einen Nachlass von 10% gegen&uuml;ber des
regul&auml;ren Preises angeboten (d.h. 315 £, 450 US$, 540 EUR (exklusive
lokaler Steuern und Versandkosten)). Weiterhin werden f&uuml;r die K&auml;ufer des
Entwicklerboards 10% Preisnachlass auf die Endkundenversion des OS4
gegeben, wenn es ver&ouml;ffentlicht wird. (H&auml;ndlerbedingungen f&uuml;r diese Boards
werden auf www.yahoogroups.com/group/a1dealer ver&ouml;ffentlicht).
</P>
<P><B>FAQ´s</B></P>
<P><B>Welche Linuxversionen laufen auf dem AmigaOne.5?</B></P>
<P>
Das Board l&auml;uft gegenw&auml;rtig mit TurboLinux PPC und es wird gerade eine
Installation von SuSE Linux PPC ausprobiert.
</P>
<P>
Kann ich eine Version des Boards nur f&uuml;r Linux PPC kaufen?
</P>
<P>
Wir &uuml;berlegen gerade, dieses zu erm&ouml;glichen. Jedenfalls sollte bemerkt
werden, dass es nicht m&ouml;glich sein wird, auf einem solchen Board OS 4
laufen zu lassen, ohne eine spezielle Version mit Firmware Update ROM zu
erwerben. Dieses ist (offensichtlich), um Raubkopien des OS 4 zu vermeiden,
was notwendig ist, wenn Hyperion/Amiga Inc. fortfahren sollen das OS4 zu
entwickeln.
</P>
<P><B>Wird MorphOS auf dem Board laufen?</B></P>
<P>
Der AmigaOne.5 ist entworfen, um Amiga OS4 und sp&auml;tere Versionen und Linux
PPC darauf laufen zu lassen. Es ist wahrscheinlich, dass MorphOS auf dem
AmigaOne.5 zum Laufen gebracht werden k&ouml;nnte, wenn jemand einen Port daf&uuml;r
anfertigt, aber dieses wird weder von uns noch von Hyperion unterst&uuml;tzt.
</P>
<P><B>Wo kann ich ihn kaufen?</B></P>
<P>
Der AmigaOne.5 wird &uuml;ber ein 'offenes Distributions'-Modell vertrieben. Das
bedeutet, dass es keine territorialen Exklusivrechte f&uuml;r den Markt gibt und
jede bonit&auml;re Firma, die den technischen Supportanforderungen gen&uuml;gt und
die Mindestzahl bestellt, kann den AmigaOne.5 (und OS4) verkaufen. Falls
dieses auf Sie zutrifft (oder Sie einen m&ouml;glichen interessierten H&auml;ndler
kennen), bitte schauen sie auf die Informationsseite f&uuml;r H&auml;ndler.
</P>
<P><B>Was f&uuml;r Speicher wird eingesetzt?</B></P>
<P>
Das Board hat 2 168-Pin-SD-RAM-Sockel, jeder best&uuml;ckbar mit einem 133 MHz
SD-RAM DIMM mit je maximal 1 GB. DIMMS m&uuml;ssen nicht die gleiche Gr&ouml;&szlig;e haben,
aber sollten idealerweise vom selben Massenmarkthersteller und die
gepufferte Variante sein.
</P>
<P><B>Ben&ouml;tige ich die A1200/PCI Br&uuml;ckenkarte?</B></P>
<P>
Wir erwarten, dass eine 'v&ouml;llig abstrahierte' Version des OS4 - das ist
eine ohne irgendeine Abh&auml;ngigkeit des Amiga-Chipset - mit oder kurz nach
der ersten Ver&ouml;ffentlichung des OS4 verf&uuml;gbar sein wird. Dies bedeutet,
dass alle Anwendungssoftware, die nicht auf der Verf&uuml;gbarkeit der
spezifischen Amigahardware (oder auf spezifischen Treibern, welche diese
Hardware ansprechen) aufsetzt, gut ohne eingesetzte PCI-Amiga-Br&uuml;ckenkarte
arbeitet. Diese bezeichnen wir als 'abstrahierte Anwendungen' und, grob,
sind dieses die Anwendungen die mit Grafikkarten, Soundkarten,
Schnittstellenkarten, etc. zusammenarbeiten. Andere Anwendungen, die
speziellen Zugang zu mehr spezifischen Amigachips ben&ouml;tigen - etwa Spiele
mit Scrolling oder Scala - ben&ouml;tigen die Br&uuml;ckenkarte.
</P>
<P>
Wie funktioniert die Amiga/PCI Br&uuml;ckenkarte. Gibt es keine f&uuml;r meinen Amiga
x000?
</P>
<P>
Alle Amigas (mit ein paar kleineren Ausnahmen) verwenden ein gemeinsames
Speicherverzeichnis, in dem alle spezifischen Chipregisteradressen,
Chip-RAM, Kickstart ROM etc. aufgelistet sind. Diese sind alle in den
unteren 16 MB des Amigaspeicherverzeichnisses, so dass auf sie &uuml;ber den 24
Bit Adressbus der 680x0 CPU der fr&uuml;hen und leistungsschw&auml;cheren Amigas
zugegriffen werden kann. Die Br&uuml;ckenkarte verlegt 16 MB ihres Speichers auf
den Adressraum der 16 MB des Amiga 1200 und stellt so die Adressen, Daten-
und Kontrollleitungen zur Verf&uuml;gung, um vom und zum Chipset und I/O
(Beispiel: Parallel, Seriell, Diskette, Festplatte, PCMCIA etc.) zu lesen
und schreiben. Die PPC MMU legt die 16 MB des PCI-Karten-Adressraumes in
die unteren 16 MB des Speicherverzeichnisses des Emulators, so dass jede
Anwendung, die in dieser Region Daten lesen oder schreiben will, die
aktuellen Amiga Chipset Register durch die PCI-Br&uuml;cke liest oder schreibt
(d.h. so wie der Programmierer das beabsichtigte). Das Interface zwischen
der PCI Karte und dem Amiga Expansionsport benutzt spezielle Chips -
&auml;hnlich denen einiger Mikroprozessor Emulationsboards, die die Integrit&auml;t
der Daten garantieren.
</P>
<P>
Theoretisch k&ouml;nnten wir die gleiche PCI Karte mit einem A3000/A4000-CPU-
Slot (oder sogar mit einen A2000 CPU Adapter) nutzen, um die Chipsets
dieser Maschinen anzusprechen. Ob diese aber gebaut werden, obliegt den
kommerziellen Gegebenheiten nach Auslieferung der ersten Charge.
</P>
<P><B>Welche Art Tower ben&ouml;tigt das Board?</B></P>
<P>
Das AmigaOne.5 Board ist ein Fullsize-ATX-Board und ben&ouml;tigt ein 250W, oder
mehr, ATX-Netzteil. Wir empfehlen das Board vor dem Tower zu kaufen oder es
von einem offiziellen AmigaOne.5 H&auml;ndler als Komponente oder Komplettsystem
zu kaufen. Wir empfehlen ein 'Super-Midi'-Tower (etwa wie der T05AC, den es
hier gibt), welches eine Menge an Erweiterungsraum gibt. Naya Design
produzieren auch sehr stylische Designs f&uuml;r den AmigaOne.5, die &uuml;ber uns
oder Ihren lokalen H&auml;ndler zu beziehen sind. Alle Details werden vor Ostern
ver&ouml;ffentlicht.
</P>
<P>
Ich habe in Erwartung schon einen A1200-Tower gekauft - was geschieht mit
mir?
</P>
<P>
Der Hauptgrund hinter den Neudesign war, dass wir eine bessere Performance
zum geringeren Preis liefern k&ouml;nnen, als es mit dem AmigaOne-1200 Design
m&ouml;glich war. Obwohl bislang kein Preis ver&ouml;ffentlicht wurde, war unsere
Preisfeststellung, dass ein AmigaOne1200 etwa einen vergleichbaren Preis
der gr&ouml;&szlig;ten PPC-Beschleunigerkarten von Phase5 gehabt h&auml;tte - d.h. etwa 550
£, 800 US$, 900 EUR ohne Steuern und Versand. Einer der Gr&uuml;nde f&uuml;r eine
bessere Preis-Leistung liegt darin, dass mit dem AmigaOne.5 Standard ATX
Geh&auml;use genutzt werden k&ouml;nnen und nicht die speziellen und teureren EZTower
Z4, Elbox Tower, Power Tower etc.
</P>
<P>
Offensichtlich, auch wenn Sie einen neuen Tower f&uuml;r den AmigaOne.5 kaufen
und den alten speziellen Amigatower begraben, haben Sie immer noch Geld
gespart und Performance gewonnen gegen&uuml;ber dem, was ein AmigaOne-1200
gekostet h&auml;tte.
</P>
<P>
Jedenfalls bekommen alle Kunden, die zwischen dem 1.1.2002 und dem
15.3.2002 direkt bei uns einen A1200 Tower kaufen und eine AmigaOne.5
direkt bei uns bestellen, einen brandneuen T05AC Tower (ohne Netzteil und
ohne clip-on-Plastikteile, die vom EZTower-Z4 &uuml;bernommen werden k&ouml;nnen)
gratis.
</P>
<P>
Ist der AmigaOne.5 der gleiche wie der MAI TeronCx?
</P>
<P>
Nein. W&auml;hrend der Entwicklungsphase, die zur OS4 Entwicklungsvereinbarung
gef&uuml;hrt hat, &uuml;berpr&uuml;ften wir den Articia S Northbridgechip f&uuml;r ein m&ouml;gliche
Nutzung im neu entworfenen AmigaOne. Wir schlussfolgerten, dass dieses der
kosteng&uuml;nstigste Chip f&uuml;r das Design war, und f&uuml;hrten unsere Ausarbeitung
der neuen, kosteng&uuml;nstigeren AmigaOne-Spezifikationen fort, zum AmigaOne.5.
Nat&uuml;rlich bedeutete die Verwendung des Articia S statt des speziellen
Escena-Designs, dass beides, das schematische und das BCB-Design v&ouml;llig
neu sein mussten. MAI logic sind Hersteller von Chipsets, nicht von PPC
Motherboards, aber sie haben eine geringe Menge, teurer Evaluationboards,
die Teron Cx, lieferbar, um den Verkauf ihrer Chips&auml;tze zu unterst&uuml;tzen.
Das Teron Cx war selber niemals f&uuml;r die Serienproduktion gedacht. Daher
fragten wir sie, ob sie uns eine Entwicklungsfirma empfehlen k&ouml;nnen, die
mit dem Articia S PPC Motherboarddesign vertraut war. Sie empfohlen uns
die gleiche (Fernost) Firma, die das Teron Cx Evaluationsboard
entwickelte.
</P>
<P>
Das neue Eyetech-AmigaOne.5-Design teilt sich offensichtlich eine Menge
Gemeinsamkeiten mit dem Teron Cx Board, aber mehr als eine Kleinigkeit bei
den Spezifikationen (ATA Geschwindigkeit, integriertes Ethernet, spezielle
Firmware, Zahl der aktiven PCI/AGP-Slots etc.) - und der Preis - beider
Boards sollten die meisten Leute &uuml;berzeugen, dass diese wirklich zwei
verschiedenen Designs sind.
</P>
<P>
Falls Sie immer noch un&uuml;berzeugt bleiben, sind Sie nat&uuml;rlich herzlich
willkommen, ein Teron Cx Evaluationsboard zu kaufen. Es kostet 3900 US$,
ihm fehlen viele Features des AmigaOne.5 und OS4 wird nicht laufen.
</P>
<P>
Ich habe ein Party Pack gekauft und beanspruche meine 100 US$!
</P>
<P>
Das Amiga DE SDK Party Pack ist ein Amiga Inc. Werbeprogramm und hat nichts
mit Eyetech, Hyperion oder irgendeinem anderen AmigaOne.5 H&auml;ndler zu tun.
Amiga Inc. wird die Verwaltung dieses Programms direkt durchf&uuml;hren und die
zu befolgende Vorgehensweise ank&uuml;ndigen, wenn der Verkauf des AmigaOne.5 in
Serie geht.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
