<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG7.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Neues zum AmigaNG
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>6. Statement von Amithlon-Autor Bernd Meyer zu rechtlichen Problemen</H2>
<P>
Bernd Meyer, Hauptprogrammierer des von Haage &amp; Partner vertriebenen x86-
Amiga-Emulators Amithlon, hat sich aus unerfreulichem Anlass mit folgendem
Statement an die &Ouml;ffentlichkeit gewandt:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&raquo;&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Quo vadis, Amithlon?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
In den letzten Wochen fand sich Einiges an Diskussionen und Spekulationen
zur Zukunft von Amithlon auf den einschl&auml;gigen Amiga-News-Sites sowie
auf der Amithlon-Mailingliste. Es ist vermutlich nicht unbemerkt geblieben,
dass ich mich in ungew&ouml;hnlicher Weise aus diesen Diskussionen
herausgehalten habe; Dass ich zu dem Thema, zu dem ich ohne jeden Zweifel
meine Meinung habe, nichts beigesteuert habe.
</P>
<P>
Der Grund daf&uuml;r ist traurigerweise ein rechtlicher. Es steht nicht gut
um Amithlon.
</P>
<P>
In den fr&uuml;hen Morgenstunden des 9. M&auml;rz (Melbourner Zeitzone) erhielt ich
eine E-Mail von Amiga Inc, in der mir mitgeteilt wurde, dass nach Ansicht
von Amiga Inc der Vertrieb von AmigaOS XL die Rechte an ihrem geistigen
Eigentum verletzt und daher rechtswidrig ist. Die behauptete
Schutzrechtsverletzung betraf mehrere Teile des AmigaOS XL Pakets, unter
anderem auch das in der Datei &quot;isolinux/bigird.gz&quot; enthaltene geistige
Eigentum von Amiga Inc.
</P>
<P>
Der Vertriebsvertrag f&uuml;r Amithlon legt fest, dass ich alleinig und
unbegrenzt f&uuml;r Anspr&uuml;che, die dritte aus Gr&uuml;nden geistigen Eigentums
geltend machen, verantwortlich bin falls diese Anspr&uuml;che aus von mir
beigesteuerten Teilen des Pakets resultieren. Die Datei
&quot;isolinux/bigird.gz&quot; wurde von mir an Haage &amp; Partner geliefert und
unver&auml;ndert auf der AmigaOS XL CD ver&ouml;ffentlicht.
</P>
<P>
Ich m&ouml;chte deutlich klarstellen, dass w&auml;hrend der Verhandlungen zum
Distributionsvertrag f&uuml;r Amithlon es mir gegen&uuml;ber dargestellt wurde,
dass Haage &amp; Partner im Besitz der f&uuml;r den Vertrieb notwendigen Lizenzen
von Amiga Inc seien. Genaugenommen waren es eben diese Lizenzen, die den
Hauptgrund, wenn nicht gar den einzigen Grund daf&uuml;r darstellen, dass H&amp;P
als Vertriebspartner f&uuml;r Amithlon ausgew&auml;hlt wurde.
</P>
<P>
Es muss betont werden, dass es mir v&ouml;llig unm&ouml;glich ist, festzustellen,
ob Amiga Inc's Anspr&uuml;che begr&uuml;ndet sind. Ebenso ist es mir unm&ouml;glich,
festzustellen, ob oder ob nicht Haage &amp; Partner im Besitz der n&ouml;tigen
Lizenzen f&uuml;r Amiga Inc's geistiges Eigentum sind.
</P>
<P>
Unabh&auml;ngig davon ist es ein Faktum, dass Amiga Inc mir gegen&uuml;ber eine
Schutzrechtsverletzung behauptet hat. Rechtlich Schritte wurden erw&auml;hnt.
Und der Amithlon-Vertriebsvertrag verpflichtet mich, aus behaupteten
Schutzrechtsverletzungen resultierende Rechtsstreitigkeiten auf meine
Kosten und in meinem Namen zu f&uuml;hren. Ferner verpflichtet er mich, im
Falle eines begr&uuml;ndeten Anspruchs, alleinig und unbegrenzt zu haften.
</P>
<P>
Um das aus dieser Situation resultieren legale Risiko f&uuml;r meine Person zu
minimieren, habe ich sofort nach Erhalt der E-Mail von Amiga Inc Haage &amp;
Partner kontaktiert. Per E-Mail habe ich eine Vertragsklausel aktiviert, die
es mir in einer solchen Situation erlaubt, die Nutzung oder Verwertung von
Amithlon mit sofortiger Wirkung zu untersagen.
</P>
<P>
In einer Antwortmail, abgeschickt um 17:05 Uhr am 8. M&auml;rz (deutscher Zeit)
best&auml;tigte Herr Haage dass &quot;noch keine Einigung [mit Amiga Inc] getroffen
wurde&quot;.
</P>
<P>
Da Herrn Haages E-Mail nicht darauf einging, dass ich die Nutzung und
Verwertung von Amithlon untersagt hatte, habe ich um 3:29 Uhr am 9. M&auml;rz
(Zeitzone Australien) eine weitere Mail an Haage &amp; Partner geschickt, in
der ich klargestellt habe dass die mir gegen&uuml;ber behauptete
Schutzrechtsverletzung von mir bereitgestellte Teile des Pakets betrifft
und dass ich daher die weitere Nutzung von Amithlon mit sofortiger Wirkung
untersage.
</P>
<P>
Ferner schlug ich vor, dass Herr Haage, der mir per Mail versichert hatte
dass &quot;Niemand [mich] f&uuml;r irgendetwas verantwortlich machen wollen oder
k&ouml;nnen&quot; w&uuml;rde, per Zusatz zum Vertriebsvertrag die volle und alleinige
Verantwortung f&uuml;r von Amiga Inc vorgebracht Anspr&uuml;che &uuml;bernehmen und
mich explizit von allen aus solchen Anspr&uuml;chen resultierenden
Verpflichtungen entbinden solle.
</P>
<P>
Diese Mail ist bis heute unbeantwortet geblieben, obwohl von meiner
Mailsoftware erzeugten Logfiles belegen dass sie Haage &amp; Partners
Mailserver zugestellt wurde.
</P>
<P>
Der Vertrieb von AmigaOS XL durch Haage &amp; Partner geht weiter; Am 15. M&auml;rz
haben H&amp;P sogar ein neues Komplettsystem mit vorinstalliertem Amithlon
vorgestellt. Durch diese Aktivit&auml;ten entsteht mir ein signifikantes
legales Risiko.
</P>
<P>
Meiner Ansicht nach sind alle Exemplare von Amithlon, die durch Haage &amp;
Partner sp&auml;ter als 17:05 Uhr am 8. M&auml;rz (deutscher Zeit) ausgeliefert
wurden im direkten Konflikt mit dem Vertriebsvertrag. Ich weise
ausdr&uuml;cklich jede Verantwortung oder rechtliche Forderung, die aus solchen
Lieferungen abgeleitet werden, zur&uuml;ck. Ich muss au&szlig;erdem betonen, dass,
soweit es mich betrifft, die K&auml;ufer solcher Exemplare keine Lizenzen f&uuml;r
die Nutzung von mir erstellter Teile von Amithlon erworben haben; Dies
schlie&szlig;t unter anderem das eigentliche Executable des Emulators ein.
</P>
<P>
Als freischaffender Software Designer h&auml;ngt mein Lebensunterhalt davon ab,
dass geistiges Eigentum gesch&auml;tzt und bezahlt wird. Ich m&ouml;chte es
klarstellen dass ich unter keinen Umst&auml;nden den Vertrieb eines Produktes
guthei&szlig;e, dem gegen&uuml;ber glaubw&uuml;rdige und nicht gekl&auml;rte
Schutzrechtsanspr&uuml;che vorliegen.
</P>
<P>
Ich bedauere es zutiefst, der &Uuml;berbringer solch negativer Nachrichten zu
sein. Amithlon ist ein Produkt, in das ich mich mit Herz und Seele
investiert habe, und auf das ich stolz bin. Die Notwendigkeit, den weiteren
Vertrieb zu untersagen, tat weh. Die Tatsache, dass der Vertrieb
weitergeht, und die daraus resultierenden Folgen, haben mich psychisch und
physisch mitgenommen, und davon abgehalten, das zu tun, was ich am besten
mache --- n&uuml;tzliche Software zu schreiben.
</P>
<P>
Im Laufe der letzten Wochen habe ich mit Amiga Inc zusammengearbeitet und
versucht, eine gemeinsame L&ouml;sung zu finden. Ungl&uuml;cklicherweise habe ich
den Eindruck gewonnen, dass sie aufgrund der schwebenden Auseinandersetzung
zwischen Amiga Inc und Haage &amp; Partner derzeit keinen &ouml;ffentlichen
Kommentar abgeben k&ouml;nnen; Gleichzeitig kam es jedoch so weit, dass der aus
dieser ganzen Aff&auml;re resultierende Stress mein Leben, meine Gesundheit und
auch meinen Support f&uuml;r die Amithlon-Nutzer negative beeintr&auml;chtigt hat.
Das konnte so nicht weitergehen.
</P>
<P><B>Bernd Meyer, BComp(Hon), Amithlon-Hauptentwickler&laquo;</B></P>
<P><B>Fazit:</B></P>
<P>
Es darf einfach nicht wahr sein! Ausgerechnet das Projekt, dem ich (neben
dem verwandten UAE) die gr&ouml;&szlig;ten Chancen einr&auml;ume, das AmigaOS noch eine
Zeitlang am Leben zu erhalten, ist in seiner Existenz bedroht.
Ich habe gr&ouml;&szlig;tes Verst&auml;ndnis, wenn ein Unternehmen auch restriktive
Ma&szlig;nahmen ergreift, um sein geistiges Eigentum zu sch&uuml;tzen. In diesem
speziellen Fall jedoch sollten AMIGA, Inc., Haage &amp; Partner und Bernd Meyer
versuchen, schnellstm&ouml;glich zu einer f&uuml;r alle Beteiligten akzeptablen
L&ouml;sung des Problems zu kommen. Denn sonst erleidet der Amiga-Markt
insgesamt einmal mehr gro&szlig;en Schaden - und damit ist wahrlich niemandem
geholfen.
</P>
<P><B>Carsten Schr&ouml;der &lt;<A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG7.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
