<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Zwischenruf.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Neues zum AmigaNG
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>7. &Uuml;berblick: Nokia Mediaterminal 511 S (von Oliver Tacke)</H2>
<P>
Im Februar &uuml;berraschte uns Amiga, Inc. mit der Ank&uuml;ndigung einer
Partnerschaft mit der finnischen Firma Nokia, die besonders durch ihre
mobilen Telefonger&auml;te bekannt geworden ist. Die Partnerschaft betreffe die
Bereitstellung der &quot;Amiga Anywhere&quot;-Umgebung (ehemals AmigaDE) f&uuml;r das
Nokia Mediaterminal 511 S sowie die Schaffung von Inhalten. Laut Amiga,
Inc. soll Amiga Anywhere auch auf der im Sommer erscheinenden Version des
Ger&auml;ts vorinstalliert sein.
</P>
<P>
Auf die Nachfrage bei Nokia Home Communications Deutschland hin erhielten
wir eine zwar prompte, aber dennoch wenig informative Antwort. Das
Mediaterminal werde, aller Voraussicht nach, im ersten Halbjahr dieses
Jahres erscheinen. Mehr Informationen, als sie auf der Nokia-Website [1]
zur Verf&uuml;gung stehen, l&auml;gen bislang nicht vor. Also hier noch keine
Best&auml;tigung des Deals. Der Hauptsitz von Nokia dagegen antwortete kurz vor
Redaktionsschluss wie folgt:
</P>
<P>
&quot;It is not Amiga Anywhere, but rather a Linux version of Amiga Digital
Environment (DE).  Amiga DE is pre-installed on the Nokia Mediaterminal,
for the Swedish market. The Nokia Mediaterminal is currently available in
Sweden and is an infotainment device for the home which combines digital
television, internet  and more.  This cooperation is with Nokia Home
Communications in Sweden, for the Swedish market, and only for the Nokia
Mediaterminal in that market.&quot;
</P>
<P>
(Es handelt sich nicht um Amiga Anywhere, sondern eher um eine Linux-
Version des Amiga Digital Environment (DE). Amiga DE ist auf dem Nokia
Mediaterminal f&uuml;r den schwedischen Markt vorinstalliert. Das Nokia
Mediaterminal ist derzeit in Schweden erh&auml;ltlich und ein Infotainment-Ger&auml;t
f&uuml;r zuhause, es kombiniert digitales Fernsehen, Internet und mehr. Die
Kooperation besteht mit Nokia Home Communications in Schweden, f&uuml;r den
schwedischen Markt und nur f&uuml;r das Nokia Mediaterminal in diesem Markt.)
</P>
<P>
Ein wenig ern&uuml;chternd also. Doch was bekommen die Schweden denn da
&uuml;berhaupt?
</P>
<P>
Im recht schicken Geh&auml;use findet sich ein Intel Celeron, getaktet mit
mindestens 566 MHz, eine 40-GByte-Festplatte und 64 MByte Speicher. Dazu
gesellt sich ein integriertes V.90-Modem (Unterst&uuml;tzung f&uuml;r ein DSL-Modem
ist gegeben). F&uuml;r den Kontakt nach au&szlig;en gibt es zwei Smart-Card-Slots,
einen PCMCIA-Slot, zweimal Firewire, zweimal USB, einmal Ethernet 10/100
MBit sowie Anschl&uuml;sse f&uuml;r analogen und digitalen Sound und f&uuml;r ein
Standard-Antennenkabel.
</P>
<P>
Gedacht ist das Ger&auml;t n&auml;mlich als Multifunktionseinheit, die einfach an den
heimischen Fernseher gest&ouml;pselt wird und dort eine Vielzahl von Diensten
vereinigt. Das Mediaterminal ist ein digitaler Satelliten-Receiver, der
nicht nur Free-TV sondern auch Pay-TV und Pay-per-view-Dienste unterst&uuml;tzt.
Weiterhin bietet das Ger&auml;t die Funktion eines digitalen Videorecorders, der
bis zu 9 Stunden aufzeichnen kann. Nettes Goodie ist die &quot;Pausefunktion&quot;,
die das laufende Programm zwischenspeichert, so dass man ruhig auf die
Toilette gehen kann und dann an der Stelle weitersieht, an der man pausiert
hatte.
</P>
<P>
Neben den Fernseh-Features erm&ouml;glicht das Terminal auch den Empfang von
digitalen Radio-Programmen. Au&szlig;erdem ist es nat&uuml;rlich auch m&ouml;glich, wie
sollte es anders sein, im Internet zu surfen (mit Mozilla als Browser) und
E-Mails zu schreiben.
</P>
<P>
Au&szlig;erdem soll das Terminal auch f&uuml;r den Spielspa&szlig; zwischendurch dienen,
und hier kommt wohl das &quot;Amiga Anywhere&quot; ins Spiel, denn das Ger&auml;t nutzt
Linux als Betriebssystem, und der Player f&uuml;r Linux ist ja bereits seit
einiger Zeit verf&uuml;gbar. Da das Ger&auml;t wohl kaum f&uuml;r Computer-Freaks gedacht
ist, sondern f&uuml;r Durchschnittsb&uuml;rger, die sonst gar nicht die M&ouml;glichkeit
h&auml;tten, mit dem &quot;Amiga Anywhere&quot; in Ber&uuml;hrung zu kommen, ist das sicherlich
positiv zu beurteilen. Wirklichen Nutzen vom &quot;Amiga Anywhere&quot; hat man
allerdings erst, wenn man mehrere Ger&auml;te besitzt, die es unterst&uuml;tzen. Da
muss AMIGA, Inc. wohl noch mehr Firmen &uuml;berzeugen, aber dies versuchen sie
ja bereits, unter anderem in Form der wenig popul&auml;ren Kooperation mit
Microsoft.
</P>
<P>[1] <A HREF="http://www.nokia.de/home_communications/produkte/media_terminal/" TARGET="_top">http://www.nokia.de/home_communications/produkte/media_terminal/</A></P>
<P><B>Oliver Tacke &lt;<A HREF="mailto:oliver@aakt.de">oliver@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Zwischenruf.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
