<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Neues zum AmigaNG
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>3. Neues Executive Update von AMIGA-CEO Bill McEwen</H2>
<P>
Andreas Hahn (<A HREF="mailto:ami4ever@gmx.de">ami4ever@gmx.de</A>) hat das j&uuml;ngste Executive Update von AMIGA-
CEO Bill McEwen f&uuml;r unseren Partner amiga-news.de &uuml;bersetzt und uns
freundlicherweise f&uuml;r eine Ver&ouml;ffentlichung zur Verf&uuml;gung gestellt:
</P>
<P><B>&raquo;Executive Update - Bekanntmachung zum Amiga Status</B></P>
<P><B>Bill McEwen - 25 M&auml;rz 2002</B></P>
<P>
Sch&ouml;ne Gr&uuml;&szlig;e euch allen!
Ich bin gerade zur&uuml;ck von einer fantastischen Veranstaltung, der Embedded
Systems in San Francisco, auf der Amiga Anywhere Kommentatoren, Entwickler
und potentielle Kunden gleicherma&szlig;en verbl&uuml;fft und begeistert hat. Nun
m&ouml;chte ich mir die Zeit nehmen, der Amigagemeinde das Flagschiff unter
unseren Projekten n&auml;her zu bringen - AmigaOS.
</P>
<P>
Entgegen dem Unsinn, der von einigen Schw&auml;tzern verbreitet wird, ist
AmigaOS &auml;u&szlig;erst lebendig und wir haben sehr aufregende Pl&auml;ne f&uuml;r die
Zukunft mit weiteren Rechnermodellen und tollen neuen Features. Die
Existenz ist nachhaltig gesichert und wir haben langfristige Ziele f&uuml;r
dieses erstaunliche Produkt.
</P>
<P>
Wir sehen das AmigaOS als Schreibtischl&ouml;sung und Amiga Anywhere als
eingebettete L&ouml;sung f&uuml;r Mobiltelefone, PDA's (Kleincomputer), Set Top Boxen
(Digitalempf&auml;nger), Internetger&auml;te und &auml;hnliche neue Produkte. Sobald
AmigaOS 5.0 erscheint, wird man sehen, wie diese beiden Linien
verschmelzen. Zwei Welten werden inhaltlich zueinander finden, und das
Softwareangebot wird weiter wachsen.
</P>
<P>
Es ist wichtig zu sehen, dass AmigaOS f&uuml;r die Amigagemeinde bestimmt ist,
w&auml;hrend Amiga Anywhere uns dem Rest der Welt bekannt macht. So wollen wir
neue Freunde finden und in die Amigagemeinschaft einladen. Uns geht es um
Marktanteile, Expansionsm&ouml;glichkeiten, Vergr&ouml;&szlig;erung des Amigamarktes und
wachsende Nutzerzahlen.
</P>
<P>
Wie ihr wisst, haben wir die strategische Entscheidung getroffen, die
Entwicklung der n&auml;chsten Hardware- und kompatiblen AmigaOS Version
Partnerfirmen zu &uuml;berlassen. Dies haben wir getan, um uns auf unser
langfristiges Ziel AmigaOS 5 konzentrieren zu k&ouml;nnen, w&auml;hrend wir auch f&uuml;r
einen &uuml;berzeugenden und leistungsf&auml;higen Pfad vom AmigaOS 3 aus sorgen
wollen. Kurz- und mittelfristig ergibt sich f&uuml;r die Amigagemeinde ein
Produkt, auf das sie stolz sein kann.
</P>
<P>
Der Hardwarevertrag wurde Eyetech Limited (England) zuerkannt, der
Softwarevertrag Hyperion Entertainment (Belgien). Beide Unternehmen
verf&uuml;gen &uuml;ber eine beeindruckende Reputation f&uuml;r Qualit&auml;tsprodukte und eine
tiefe Verbundenheit dem Amiga gegen&uuml;ber, beide haben in den vergangenen
f&uuml;nf Jahren eine wichtige Rolle zur Erhaltung unserer Plattform gespielt.
</P>
<P>
Diesen beiden Vertr&auml;gen zugrunde liegt das erste neue kombinierte Amiga
Hardware- und Softwareprodukt seit mehr als acht Jahren - der AmigaOne.
Seine Features und Funktionen wurden nach den W&uuml;nschen der Gemeinschaft,
ausgedr&uuml;ckt in Tausenden von E-Mails, Artikeln und Kommentaren, festgelegt.
Der PowerPC wurde verlangt und von uns best&auml;tigt. Die M&ouml;glichkeit, Nutzen
aus der j&uuml;ngsten Video- und Audiotechnik zu ziehen, wurde gefordert und von
uns sukzessiv implementiert. USB-Unterst&uuml;tzung war im Gespr&auml;ch und wir
stimmten zu. Ein besseres Dateisystem, integriertes TCP/IP und 3D, eine
weiterentwickelte Workbench - all das wurde im AmigaOS 4 umgesetzt.
</P>
<P>
Die Spannung steigt. Der AmigaOne l&auml;uft bereits unter PPC-Linux, AmigaOS 4
macht rasche Fortschritte auf PowerUp-Amigas und wird zurzeit f&uuml;r den
AmigaOne angepasst. Bestellungen f&uuml;r Entwicklerboards werden angenommen und
viele Entwickler arbeiten eng mit dem AmigaOS4-Team zusammen, um
sicherzustellen, dass ihre Anwendungen optimal f&uuml;r die Zukunft vorbereitet
sind.
</P>
<P>
Es war ein z&auml;hes Ringen und die Stra&szlig;e war holprig. Mit der anziehenden
Weltwirtschaft und dem Erfolg des Amiga Anywhere werden wir jedoch st&auml;rker
und st&auml;rker. Dies w&auml;re nicht m&ouml;glich gewesen ohne die Unterst&uuml;tzung und
Hingabe der Amigagemeinschaft und wir m&ouml;chten diese Gemeinschaft wissen
lassen, dass sie am Erfolg beider Produktlinien, Amiga Anywhere und
AmigaOS, gleicherma&szlig;en teilhat.
</P>
<P><B>Hardware-Update</B></P>
<P>
Im vergangenen Monat besuchte unser Chefentwickler Fleecy Moss das
Hauptquartier von Eyetech und verbrachte einige Stunden mit den Managern,
Ingenieuren und ihrer neuesten Errungenschaft, einem PPC-Mainboard, welches
das Herz des AmigaOne bilden wird. Das Board lief mit einer speziell
angepassten Version von PPC-Linux, um eine &Uuml;berpr&uuml;fung zu erm&ouml;glichen.
Board und Peripherie liefen fehlerlos, das System war einwandfrei
ansprechbar und flink - gute Vorzeichen f&uuml;r ein optimiertes und effizientes
AmigaOS!
</P>
<P>
Urspr&uuml;nglich sah der Plan f&uuml;r den AmigaOne vor, zwei Produkte zu kreieren,
zum einen  ein Motherboard mit integrierter 1200er-Schnittstelle f&uuml;r eine
AmigaOS4.0-Version, die rasch fertiggestellt werden sollte und Zugriff auf
den traditionellen Chipsatz geboten h&auml;tte, zum anderen eine komplette
Neuentwicklung f&uuml;r das AmigaOS 4.2, die v&ouml;llig unabh&auml;ngig von den Custom
Chips gewesen w&auml;re.
</P>
<P>
Im Verlauf der letzten sechs Monate haben Fortschritte in der Hardware dazu
gef&uuml;hrt, dass das zweite Produkt vor dem ersten h&auml;tte verf&uuml;gbar werden
k&ouml;nnen. Daher haben wir die Strategie ge&auml;ndert. Der AmigaOne wird auf Basis
einer Motherboardrevision 1.5 gebaut. Diese Revision wird ohne AA-Chipsatz
und ohne Verbindung zu einem 1200er unter AmigaOS 4.0 laufen. Es wird kein
Motherboard mit integrierter 1200er-Schnittstelle geben, stattdessen plant
Eyetech die Entwicklung einer PCI-Karte zur Verbindung mit einem 1200er-
Mainboard. In diesem Fall verh&auml;lt sich der 1200er wie eine zus&auml;tzliche
Grafikkarte in einem PCI-Steckplatz und erm&ouml;glicht die Ausf&uuml;hrung &auml;lterer
Amiga-Software, die direkten Zugriff auf die AA-Chips verlangt.
</P>
<P>
Durch diese Methode ist es auch technisch m&ouml;glich, die PCI-
Kabelschnittstelle zur Verbindung mit dem CPU-Steckplatz eines 3000ers oder
4000ers, oder sogar zu einem 2000er &uuml;ber einen Prozessorsockel
herzustellen. Diese Schnittstellenvarianten sollen sp&auml;ter folgen, abh&auml;ngig
von der Nachfrage.
</P>
<P><B>Die aktuellen Hardware-Spezifikationen f&uuml;r den AmigaOne</B></P>
<UL>
<LI>   CPU - G3/G4 in aktuell verf&uuml;gbarer Taktrate
</LI>
<BR><LI>   RAM - Zwei 133MHz-SD-RAM-Steckpl&auml;tze f&uuml;r bis zu 2 GB
</LI>
<BR><LI>   Grafikkartenunterst&uuml;tzung - AGP (2x) und 66MHz-PCI
</LI>
<BR><LI>   Erweiterungssteckpl&auml;tze - 4 x PCI
</LI>
<BR>
<BR><LI>   Althergebrachte Anschl&uuml;sse
<UL>
<LI>   FDD (Diskettenlaufwerk)
</LI>
<BR><LI>   Seriell
</LI>
<BR><LI>   Parallel
</LI>
<BR><LI>   PS/2-Tastatur und -Maus
</LI>
</UL>
</LI>
<BR>
<BR><LI>   Integrierte Anschl&uuml;sse
<UL>
<LI>   2 x USB und 2 zus&auml;tzliche Header (f&uuml;r bis zu 4 weitere Ger&auml;te)
</LI>
<BR><LI>   10/100-Mbps-Ethernet
</LI>
<BR><LI>   AC97 (Audio)
</LI>
<BR><LI>   MC97 (Data/Fax/Modem)
</LI>
<BR><LI>   UDMA 100/ATAPI - 2 Z&uuml;ge (f&uuml;r 4 Ger&auml;te)
</LI>
</UL>
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Ab dem 18. M&auml;rz k&ouml;nnen Entwickler und H&auml;ndler Entwicklerversionen der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Boards bestellen, um diese auszuprobieren und um f&uuml;r die f&uuml;r AmigaOS 4&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">sinnvolle Optimierung ihrer Software ger&uuml;stet zu sein. Benutzt zur&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Bestellung bitte Eyetechs Online-Shop, f&uuml;r weiterf&uuml;hrende Informationen zur&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">AmigaOne-Hardware besucht bitte Eyetechs AmigaOne-Seiten.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Software-Update</B></P>
<P>
Hyperion hat f&uuml;r die Arbeit an AmigaOS 4.0 wirklich cremige Entwickler
versammelt, um sowohl Topqualit&auml;t als auch entsprechende Leistung f&uuml;r die
Endversion garantieren zu k&ouml;nnen und AmigaOS 4.0 und folgende zu einem
echten Amigaprodukt zu machen, erschaffen mit Sorgfalt und im Sinne unserer
Philosophie und Methodik, die Amigal&ouml;sungen immer zu etwas besonderem
gemacht haben. AmigaOS 4.0 wird momentan auf 4000ern mit CyberStormPPCs
entwickelt und f&uuml;r AmigaOne-1.5-Boards von Hyperion angepasst.
</P>
<P><B>Die strategischen Ziele von AmigaOS 4.0</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1.&nbsp;</TD><TD VALIGN="TOP">&Uuml;bergang von 68k basierter Custom-Chipset-Amiga-Hardware zu PPC-&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">basierter steckbarer Teilsystem-Hardware (kleiner Scherz des&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&Uuml;bersetzers...)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2.&nbsp;</TD><TD VALIGN="TOP">So viel Abw&auml;rtskompatibilit&auml;t wie m&ouml;glich&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3.&nbsp;</TD><TD VALIGN="TOP">Optimierung des AmigaOS f&uuml;r die neue Hardwaregrundlage&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">4.&nbsp;</TD><TD VALIGN="TOP">AmigaOS vorw&auml;rts zu bringen, neue Features und hohe Leistung im&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">traditionellen Stil einfach zu nutzender Amiga-Architektur zu entwickeln&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">5.&nbsp;</TD><TD VALIGN="TOP">Den Weg zu bereiten f&uuml;r AmigaOS 5&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Das aktuelle Sortiment an Features</B></P>
<P>
Ein neu entworfener und implementierter Exec-Kern der zweiten Generation,
der die Anpassung des AmigaOS 4.0 an jede passende PPC-Hardware erlaubt,
einschlie&szlig;lich (aber nicht begrenzt auf!) AmigaOne, BlizzardPPC,
CyberstormPPC, SharkPPC von Elbox, Pegasos von bPlan etc.
</P>
<P><B>Die folgenden Merkmale werden gerade hinzugef&uuml;gt</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1.&nbsp;</TD><TD VALIGN="TOP">HAL (Hardware abstraction layer oder abstrahierte HW-Zwischenschicht)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2.&nbsp;</TD><TD VALIGN="TOP">Virtueller Speicher&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3.&nbsp;</TD><TD VALIGN="TOP">Eine neue Schnittstelle f&uuml;r Libraries&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">4.&nbsp;</TD><TD VALIGN="TOP">Ressourcenverfolgung und -Management&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">5.&nbsp;</TD><TD VALIGN="TOP">Wahlweise Speicherschutz&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">6.&nbsp;</TD><TD VALIGN="TOP">WarpOS-Abw&auml;rtskompatibilit&auml;t&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
<B>68K Emulation -</B> Das ist der Schl&uuml;ssel zu AmigaOS 4.0, da viele der nicht
zeitkritischen Betriebssystemelemente und auch ein Gro&szlig;teil der &auml;lteren
Software diese ben&ouml;tigen. Zum Erreichen maximaler Geschwindigkeit wird
aktuellste JIT-(Just-in-Time oder zur-Laufzeit)-Technologie verwendet,
viele Bereiche werden sogar von Hand optimiert.
</P>
<P>
<B>PPC-native (ohne Emulation) integrierte Netzwerkf&auml;higkeit -</B> Das war das
meistverlangte Feature der Gemeinschaft und entsprechend der Wichtigkeit
vertrauten wir die Entwicklung Olaf Barthel an, einem der am meisten
respektierten Amiga-Entwickler der Welt. Er hat uns nicht entt&auml;uscht,
Benchmarks belegen, dass die neue AmigaOS4-L&ouml;sung schneller als irgend eine
andere L&ouml;sung ist.
</P>
<P><B>Die Features</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1.&nbsp;</TD><TD VALIGN="TOP">Implementiert als Single Shared Library (eine von allen nutzbare Lib)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2.&nbsp;</TD><TD VALIGN="TOP">Kompatibel zur Amiga-Standard-&quot;bsdsocket&quot;-API (Softwareschnittstelle),&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">urspr&uuml;nglich definiert durch AmiTCP&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3.&nbsp;</TD><TD VALIGN="TOP">Erweiterte API f&uuml;r mehr Kontrolle &uuml;ber innere Abl&auml;ufe und die&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Konfiguration&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">4.&nbsp;</TD><TD VALIGN="TOP">Eingebauter DHCP-Klient (Einfache Konfiguration von Netzwerken)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">5.&nbsp;</TD><TD VALIGN="TOP">Internet-Superserver (inetd)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">6.&nbsp;</TD><TD VALIGN="TOP">IP-Filter und &Uuml;bersetzung von Netzwerksadressen (NAT)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">7.&nbsp;</TD><TD VALIGN="TOP">Treiber f&uuml;r asynchrones PPP (W&auml;hlverbindungen) und PPP &uuml;ber Ethernet&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">8.&nbsp;</TD><TD VALIGN="TOP">SSL-Version 2 (relativ sicherer Standard im Internet)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
<B>PPC-native Implementierung des Amiga-Filesystem (FFS2) -</B> FFS2 ist eine
abw&auml;rtskompatible Umsetzung des FastFileSystems in C. Unterst&uuml;tzt werden
Partitionen gr&ouml;&szlig;er 4 GByte und lange Dateinamen bis zu 108 Zeichen.
Enthaltene Datenrettungswerkzeuge werden FFS2 und SFS unterst&uuml;tzen.
</P>
<P>
<B>PPC-natives CD-Dateisystem -</B> die Features dieses am zweith&auml;ufigsten
verlangten Details des AmigaOS 4
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1.&nbsp;</TD><TD VALIGN="TOP">Unterst&uuml;tzung des Joliet-Formats (Microsoft)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2.&nbsp;</TD><TD VALIGN="TOP">Unterst&uuml;tzung des RockRidge-Formats (Daten)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3.&nbsp;</TD><TD VALIGN="TOP">CDDA-Unterst&uuml;tzung (Audio)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">4.&nbsp;</TD><TD VALIGN="TOP">Multi-Session-Unterst&uuml;tzung (Brennen in Etappen)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">5.&nbsp;</TD><TD VALIGN="TOP">Unterst&uuml;tzung f&uuml;r Video-CDs (MPEG1)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Wir beabsichtigen dar&uuml;ber hinaus auch gemischte Audio/Daten-CDs und das
Macintosh-HFS/HFS+-Dateisystem zu unterst&uuml;tzen.
</P>
<P>
<B>PPC-natives RTG-(Grafik-)System -</B> Beim AmigaOne, der sowohl AGP- als auch
PCI-Grafikkarten unterst&uuml;tzt, ist das Grafiksystem eine zeitkritische
Angelegenheit. Die unter Leitung der Picasso96-Sch&ouml;pfer neu entworfene und
implementierte RTG-L&ouml;sung f&uuml;r AmigaOS 4.0 und den AmigaOne wird h&ouml;chste
Qualit&auml;tsanspr&uuml;che in der Bildschirmausgabe sichern, sei es f&uuml;r Spieler,
K&uuml;nstler oder den allt&auml;glichen Gebrauch. Zus&auml;tzlich werden handgeschriebene
Treiber f&uuml;r folgende Grafikkarten geliefert, weitere folgen sp&auml;ter.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1.&nbsp;</TD><TD VALIGN="TOP">Permedia 2&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2.&nbsp;</TD><TD VALIGN="TOP">Permedia 3&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3.&nbsp;</TD><TD VALIGN="TOP">Voodoo 3&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">4.&nbsp;</TD><TD VALIGN="TOP">Matrox G450/G550&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">5.&nbsp;</TD><TD VALIGN="TOP">ATI Radeon&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
<B>Amiga3D -</B> entwickelt aus der pionierhaften Warp3D-L&ouml;sung, die von Hyperion
angeboten wird und nun f&uuml;r AmigaOS und AmigaDE verf&uuml;gbar ist, bietet diese
3D-L&ouml;sung die Leistung und Einfachheit einer hardwarenahen 3D-
Schnittstelle, die es Entwicklern erlaubt, bahnbrechend schnelle 3D-
Anwendungen ohne den Ballast einer &uuml;berdimensionierten 3D-L&ouml;sung wie OpenGL
zu erstellen. Von Hand erstellte Treiber f&uuml;r die oben genannten
Grafikkarten werden die Leistungsf&auml;higkeit weiter steigern. Wer behauptet
hat, Spiele w&auml;ren irrelevant auf dem Amiga, kann sich auf eine &Uuml;berraschung
gefasst machen.
</P>
<P>
<B>OpenGL1.3-Unterst&uuml;tzung (Mesa 4.0) -</B> W&auml;hrend Ami3D dem Entwickler erlaubt,
ans Eingemachte zu gehen, bietet OpenGL den kompletten Standard einer 3D-
L&ouml;sung. AmigaOS 4.0 wird OpenGL-1.3-Unterst&uuml;tzung durch die Implementierung
von Mesa 4.0, aufgesetzt auf Ami3D, bieten und Entwicklern die Wahl
zwischen Leistung und dem &uuml;ppigen Satz an Funktionen lassen.
</P>
<P>
<B>PPC-natives RTA (Audio) -</B> Mit der Einf&uuml;hrung der PCI-Unterst&uuml;tzung hat die
Amigagemeinschaft nun Zugang zur neusten Audiohardware. Ausgehend von der
exzellenten Sammlung von Audio-Software wie Audio Evolution, Samplitude und
anderen, erlaubt diese AHI-kompatible L&ouml;sung dem AmigaOne, eine echte Macht
bei den Audio-Kreativen zu werden. Dank der Treiber f&uuml;r die meisten Amiga-
Audiokarten, die Soundblaster live und die Soundblaster 128 sieht die
Zukunft besser aus denn je.
</P>
<P>
<B>PPC-natives-GUI-System (Oberfl&auml;che) -</B> Das Look and Feel des AmigaOS wird
komplett &uuml;berarbeitet.
</P>
<P>
Um die interaktive AmigaOS-Oberfl&auml;che auf eine PPC-native Grundlage stellen
zu k&ouml;nnen, wird Intuition gerade neu geschrieben und weiterentwickelt.
Das BOOPSI-basierte GUI Reaction ist f&uuml;r eine nahtlose Integration ins
AmigaOS neu implementiert und verbessert worden.
</P>
<P>
Viele neue Klassen werden zurzeit programmiert, w&auml;hrend Drag and Drop
systemweit eingef&uuml;hrt wird.
</P>
<P>
Um das Design des AmigaOS 4 modern und einzigartig zu machen, hat Matt
Chaput, der Sch&ouml;pfer der bekannten GlowIcons, eine f&uuml;hrende Rolle
&uuml;bernommen. Eine PPC-Version von AmiDock wird enthalten sein, damit die
Workbench auch weiterhin die beste Nutzeroberfl&auml;che unter den verschiedenen
Plattformen darstellt.
</P>
<P>
<B>PPC-native Shell (Kommandozeile) -</B> Dieses Werkzeug der Wahl wird
fehlerbereinigt und weiter verbessert, um es noch n&uuml;tzlicher zu machen.
</P>
<P>
<B>SCSI-Interface -</B> SCSI wird unterst&uuml;tzt werden, damit Amiganer ihre bereits
zahlreich vorhandenen Ger&auml;te weiternutzen k&ouml;nnen. F&uuml;r die n&auml;chste
Generation von Ger&auml;ten widmen wir besondere Beachtung solchen, die Gebrauch
von SCRIPTS machen.
</P>
<P>
<B>AmigaInput (Eingabeger&auml;te) -</B> Ein neuer Rahmen zur Verwaltung von
Eingabeger&auml;ten wird im Hinblick auf die Erfordernisse von AmigaOS 5
entwickelt. Dieser wird in AmigaOS 4 erscheinen und zu einem entscheidenden
Teil der in Entwicklung befindlichen Amiga-L&ouml;sung werden.
</P>
<P>
<B>USB -</B> USB sollte urspr&uuml;nglich mit AmigaOS 4.2 erscheinen, aber durch den
Entwicklungsstand des 1.5er-Motherboards wird es zum Teil schon mit AmigaOS
4.0 eingef&uuml;hrt werden. Zun&auml;chst wird der Anschluss von USB-M&auml;usen und -
Tastaturen m&ouml;glich sein. Wenn alles gut geht, kommt sp&auml;ter Unterst&uuml;tzung
f&uuml;r weitere Ger&auml;te hinzu, als n&auml;chstes voraussichtlich f&uuml;r Scanner.
</P>
<P>
<B>PPC-Datatypes (Dateitypen) -</B> Das Dateitypensystem wurde ins AmigaDE
implementiert und erweitert und demonstriert unser Bekenntnis zu
&uuml;berlegener Amiga-Technologie. Mit dem &Uuml;bergang zum PPC gewinnen System und
viele Dateitypen dramatisch an Leistung.
</P>
<P>
<B>PPC Storage Toolbox (Speicherger&auml;te) -</B> Eine Sammlung von Funktionen zur
Verwaltung von fest eingebauten und Wechsellaufwerken.
</P>
<P>
<B>PPC font engine (Schriften) -</B> &Uuml;berraschenderweise wurde ein Treibersystem
f&uuml;r Schriften mit am h&auml;ufigsten gefordert, so versehen wir also das AmigaOS
mit einer brandneuen Engine. Diese wird sowohl TrueType- als auch OpenType-
Schriften unterst&uuml;tzen. Erg&auml;nzend werden Bullet Library und Diskfont
Library neu implementiert und verbessert. Ein Vertrag mit Agfa &uuml;ber 12
Truetype-Schriften ist bereits ausgehandelt.
</P>
<P>
Dar&uuml;ber hinaus demonstrieren viele Amiga Entwickler ihre Fortschritte und
ihre Unterst&uuml;tzung f&uuml;r den AmigaOne und das AmigaOS 4 - im einzelnen:
</P>
1. Die erste spezielle PPC-native OEM-Version von IBrowse 2.3<BR>
2. Eine PPC-native Version von MUI f&uuml;r Anwendungen, die es ben&ouml;tigen<BR>
3. Eine spezielle PPC-native abgespeckte Version von Audio Evolution<BR>
<P>
Alles in allem kommt AmigaOS 4.0 so in Form und wird zu einem sehr
&uuml;berzeugenden und begeisternden Produkt, das in Kombination mit dem
AmigaOne f&uuml;r ein System sorgt, auf das wir lange gewartet haben und das wir
der Amigagemeinschaft nun anbieten k&ouml;nnen.
</P>
<P>
W&auml;hrend der ge&auml;nderte Zeitplan gerade recht f&uuml;r die AmigaOne-Boards kommt,
kann so Arbeit am AmigaOS, die f&uuml;r 4.2 vorgesehen war, mit in 4.0
integriert werden, insbesondere die Abstraktion des AA-Chipsatzes.
M&ouml;glicherweise wird sich die Auslieferung von AmigaOS 4.0 verz&ouml;gern, da
auch noch diverse Features implementiert werden m&uuml;ssen, die von Haage &amp;
Partner in AmigaOS 3.5 bzw. 3.9 eingef&uuml;hrt wurden. Um Klarheit &uuml;ber die
noch zu erwartende Entwicklungszeit zu bekommen, wird momentan eine Analyse
gemacht.
</P>
<P>
Amiga, Inc. schuldet der Amigagemeinde gro&szlig;en Dank. Durch den Erfolg des
AmigaDE k&ouml;nnen wir nun Geld erwirtschaften und die Ressourcen vergr&ouml;&szlig;ern
und die lang gehegten Pl&auml;ne f&uuml;r das AmigaDE UND das AmigaOS umsetzen. Danke
f&uuml;r eure Unterst&uuml;tzung und ab in die Zukunft! Gezeichnet im Namen von
Amiga, Inc., Eyetech, Hyperion und allen, die f&uuml;r die Zukunft des Amiga
zusammenarbeiten.
</P>
<P>
Bill McEwen<BR>
CEO (Generaldirektor)<BR>
Amiga Inc.<BR>
Snoqualmie, WA&laquo;<BR>
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
