<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Diverse Amiga-News
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Diverse Amiga-News</H1>
<H2>1. Neuigkeiten von Haage &amp; Partner</H2>
<P><B>Haage &amp; Partner (<A HREF="http://www.haage-partner.com" TARGET="_top">http://www.haage-partner.com</A>) informiert:</B></P>
<P><B>&raquo;OS XL: Notebooks &amp; ADF</B></P>
<P>
06. M&auml;rz 2002: Auf den AmigaOS XL-Seiten findet man nun eine Liste von
Notebooks, die mit Amithlon und/oder AmigaXL getestet wurden. Zudem gibt
es mit ADF View ein Programm mit dem man unter Windows auf ADF-Dateien
zugreifen kann.
</P>
<P><B>1.000.000ster Besucher</B></P>
<P>
11. M&auml;rz 2002: Am vergangenen Wochenende hatten wir den 1.000.000sten
Besucher auf unseren Webseiten. Wir freuen uns &uuml;ber den Zuspruch und
werden auch in Zukunft alles unternehmen um ein Interessantes Angebot
bieten zu k&ouml;nnen.
</P>
<P><B>AXL: Neues Monstersystem</B></P>
<P>
15. M&auml;rz 2002: F&uuml;r leistungshungrige Amiga-Anwender bieten wir jetzt zwei
neue Top-Systeme an. Herzst&uuml;ck ist jeweils der AMD Athlon XP 2000+. Zur
K&uuml;hlung wird der CPU-L&uuml;fter Coolermaster Heat Pipe eingesetzt, der gerade
in einem Testbericht zum leistungsf&auml;higsten CPU-K&uuml;hler ernannt wurde.
Damit gibt es ausreichend Spielraum f&uuml;r &Uuml;bertaktungen. Zusammen mit einer
GeForce 2-Grafikkarte, schnellerem CD-RW-Brenner, DVD-Laufwerk, Sound,
Netzwerkkarte, zwei 40 GB IBM-Festplatten und dem Funksystem Logitech
Desktop iTouch kostet die Version im Towergeh&auml;use 1.799 Euro. Mit dem
wundersch&ouml;nen blauen Coolermaster Aluminiumgeh&auml;use kostet der Rechner
1.999 Euro. Amithlon und AmigaXL/QNX sind dabei vorinstalliert und k&ouml;nnen
&uuml;ber einen Bootmanager ausgew&auml;hlt werden. Auf Wunsch k&ouml;nnen wir Ihnen auch
noch ein Windows-Betriebssystem vorinstallieren.
</P>
<P><B>OS 3.9: Boing Bag 2 verf&uuml;gbar</B></P>
<P>
20. M&auml;rz 2002: H&amp;P ist stolz, das Boing Bag 2 f&uuml;r AmigaOS 3.9 anzuk&uuml;ndigen
zu k&ouml;nnen. Das Boing Bag 3.9-2 enth&auml;lt zahlreiche Bugfixes, kleine
Verbesserungen und neue Features in den Bereichen Multimedia (AMPlifier,
PlayCD, Sound-Datentyp), Shell, Workbench (Find, AsyncWB, UnArc, XAD v10),
ReAction und Festplatten-Unterst&uuml;tzung. Das Boing Bag 2 besteht aus drei
getrennt downloadbaren Teilen: Dem Hauptarchiv, mit allen Dateien, um
AmigaOS 3.9 zu aktualisieren, den &Uuml;bersetzungen in verschiedene Sprachen
sowie den Contributions (CDDB-Library, OpenURL, ClassAction). Wir danken
allen Beteiligten, die diese Update m&ouml;glich gemacht haben.
</P>
<P>
Bitte laden Sie zumindest das Hauptarchiv und die &Uuml;bersetzung(en) f&uuml;r die
von Ihnen gew&uuml;nschte Sprache(n). Die Contributions sind optional.
</P>
<P>
Hinweis: Dieses Update ben&ouml;tigt AmigaOS 3.9 mit Boing Bag 1. AmigaOS
XL-Kunden k&ouml;nnen das Boing Bag 2 i.d.R. direkt installieren.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
