<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Diverse Amiga-News
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>2. Neuigkeiten von der Amiga Arena</H2>
<P><B>Amiga Arena (<A HREF="http://online-club.de/~ARENA/" TARGET="_top">http://online-club.de/~ARENA/</A>) informiert:</B></P>
<P><B>&raquo;Amiga Arena - Interview mit &quot;Steven Solie&quot;</B></P>
<P>
Mit &quot;Axis and Allies Game Master&quot; hat der Entwickler &quot;Steven Solie&quot; sich
zum Ziel gesetzt die Brettspiel variante &quot;Axis and Allies&quot; f&uuml;r den Amiga
umzusetzen!
Die Amiga Arena sprach mit &quot;Steven Solie&quot; wie es zu der Umsetung kam und
welche Features in Zukunft noch umgesetzt werden.
</P>
<P>
Desweiteren sucht &quot;Steven Solie&quot; jemanden der gerne eine Deutsche Locale
erstellen m&ouml;chte!&laquo;
</P>
<P><B>&raquo;Amiga Arena - Interview mit &quot;Dennis Gronewold&quot;</B></P>
<P>
Mit &quot;SoftCinemaRA-GUI&quot; befindet sich seit kurzem eine Alternative zur
&quot;Argue-GUI&quot; f&uuml;r den &quot;Shareware&quot; PPC Movie/Animationsplayer &quot;SoftCinema&quot;.
Das sich &quot;SoftCinemaRA-GUI&quot; anscheindend grosser beliebtheit zu erfreuen
scheint, zeigen die 500 Hits in den ersten Tagen auf der Homepage von
&quot;Dennis Gronewold&quot;!
Downloadzahlen,Feedback und die Gewissheit das der kleinste Teil der
Anwender davon registriert sein d&uuml;rfte spricht einmal mehr f&uuml;r die
Verh&auml;ltnisse am AMIGA!&laquo;
</P>
<P><B>&raquo;Amiga Arena - Interview mit &quot;Mathias Roslund&quot;</B></P>
<P>
&quot;Mathias Roslund&quot; d&uuml;rfte vielen PPC Usern bekannt sein durch die Software
&quot;AMP&quot;. Neben &quot;AMP&quot; einem Multimedia-Abspieler,portiert er auch zahlreiche
PPC Emulatoren,wie FPSE,AmiGenerator,DarcNES u.v.a.!
In der Regel erscheinen die &quot;Amiga Arena - Interviews&quot; zu aktuellen
Entwicklungen oder Updates was bei &quot;AMP&quot; zur Zeit ja nicht der Fall
ist,allerdings sollte dieses Interview,schon vor Monaten erscheinen!!
Wie &quot;Mathias Roslund&quot; im Interview schon erw&auml;hnt,scheinen Coder nie genug
Zeit zu haben! ;-)
Vielen Dank an &quot;Christian Busse&quot; f&uuml;r die &Uuml;bersetzung und folgt dem Aufruf
von &quot;Mathias Roslund&quot; - schickt Feedback,Feature-Anfrage oder einen guten
Witz!&laquo;
</P>
<P><B>&raquo;Amiga Arena - Vollversion Update &quot;Pferderennen 1.1b&quot;</B></P>
<P>
Eine neue (Beta) Version des Spieles &quot;Pferderennen&quot; liegt zum Download
bereit!
Pferderennen ist wie der Name schon sagt ein Wettspiel wobei Sie auf  eines
von 6 Pferden wetten k&ouml;nnen, welches zuerst das Ziel erreicht!
Pferderennen bietet:
</P>
<P>
-Unterhaltung f&uuml;r bis zu 8 Spieler
-Detailierte &quot;Pferdest&auml;rken&quot; ;)
-bis zu 30 St&auml;lle mit je bis zu 50 Pferden
-einen Pferdeeditor
-Speicherbare Spielst&auml;nde
</P>
<P>
Besonderen Dank an &quot;Markus Pohlmann&quot; dem Entwickler von &quot;Pferderennen&quot; der
trotz Zeitmangels weiterhin Updates erm&ouml;glicht!
F&uuml;r Feedback,Ideen,Bugs schreibt bitte an &quot;Markus Pohlmann&quot;
(<A HREF="mailto:Markus-Pohlmann@t-online.de">Markus-Pohlmann@t-online.de</A>)&laquo;
</P>
<P><B>&raquo;Amiga Arena - Interview mit &quot;Georg H&ouml;rmann&quot;</B></P>
<P>
&quot;Georg H&ouml;rmann&quot; vielen von Euch bekannt als Urspr&uuml;nglicher Author der
xfdmaster.library die jetzt von &quot;Dirk St&ouml;cker&quot; weiter entwickelt
wird,ver&ouml;ffentlichte nach langer Zeit eine neue Version des Virenkillers
&quot;VirusZ&quot;.
</P>
<P>
&quot;Georg H&ouml;rmann&quot; erz&auml;hlt im Interview mit der Amiga Arena &uuml;ber und wie es zu
der Entwicklung von &quot;VirusZ&quot; kam.&laquo;
</P>
<P><B>&raquo;Amiga Arena - &quot;PuzzelBOBS&quot; Demo-Update</B></P>
<P>
Ein neues Update zur Demoversion von &quot;PuzelBOBS&quot; dem &quot;Bust a Move&quot; Clone
von &quot;Nexus Development&quot; liegt zum Download bereit!
Hierbei wurden Bugfixes vorgenommen sowie Probleme unter &quot;Picasso 96&quot; und
Emulatoren z.b. &quot;WinUAE&quot; behoben.&laquo;
</P>
<P><B>&raquo;Amiga Arena - &quot;BallMasterAGA&quot; Re-Release</B></P>
<P>
Das Puzzel / Mind Spiel &quot;BallMasterAGA&quot; (Registriert auf &quot;Amiga Arena&quot;) von
Damir Arh liegt seit der Erstver&ouml;ffentlichung im Jahr 2000 nun wieder zum
Download bereit!
</P>
<P><B>Amiga Arena - Interview mit &quot;Michal Rybinski&quot;</B></P>
<P>
Mit der Software &quot;MP3TagEditor&quot; von &quot;Michal Rybinski&quot; lassen sich  bequem
IDs f&uuml;r MP3 Songs bearbeitet!
Die Amiga Arena sprach mit &quot;Michal Rybinski&quot; &uuml;ber &quot;MP3TagEditor&quot; und dessen
Zukunft!
Der recht junge Entwickler schaffte es,seine Antworten auf nicht mehr als
einen Satz zu verfassen! ;-)&laquo;
</P>
<P><B>&raquo;Amiga Arena - Interview mit &quot;Halvadjian Georges&quot;</B></P>
<P>
Es gibt wohl z.Z. nur ein Mal und Bildbearbeitungs Programm f&uuml;r den Amiga
was sich nicht nur wachsender beliebtheit erfreut, sondern auch in sachen
&quot;weiter Entwicklung&quot; die Konkurenz aus dem Kommerziellen Bereich schl&auml;gt.
Die Rede ist von &quot;PerfectPaint&quot;!
Lange hat es gedauert,doch nun lest selbst im Interview mit &quot;Halvadjian
Georges&quot; welche neuen features Wir in Zukunft noch erwarten d&uuml;rfen sowie
welche Plattformen unterst&uuml;zt werden.&laquo;
</P>
<P><B>&raquo;Amiga Arena - Interview mit &quot;Paul Heams&quot;</B></P>
<P>
Wie viele von Euch bin auch ich mit dem C64 aufgewachsen und wenn sich
eines in mein Ged&auml;chnis &quot;eingebrannt&quot; hat, sind es die Soundtracks und
Samples von Spielen wie &quot;OutRun&quot;,&quot;Rambo&quot;,&quot;Declathon&quot;,&quot;Winter Games&quot; oder
&quot;Beach Head&quot; um hier nur einige wenige zu nennen!
Mit &quot;Sid4Amiga&quot; existiert f&uuml;r den Amiga ein sehr komfortabler Abspieler f&uuml;r
genau diese unvergessenen C64 Sounds!
&quot;Paul Heams&quot; der Entwickler von &quot;Sid4Amiga&quot; sprach &uuml;ber die weiter
Entwicklung seiner Programme und &auml;ussert sich im Interview mit der Amiga
Arena sehr positiv &uuml;ber das AmigaDE und wartet schon sehns&uuml;chtig auf seinen
Vorbestellten AmigaOne SE.
</P>
<P>
&quot;Paul Heams&quot; sucht noch Beta Tester f&uuml;r seine neue Version von
&quot;Sid4Amiga&quot;,also wer Interesse hat einfach eine mail an Paul!
&quot;Unterst&uuml;zt die Entwickler und die Entwickler unterst&uuml;zen Euch!&quot;
</P>
<P><B>Amiga Arena Interview mit &quot;Michael Rybinski&quot;</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Das Interview mit &quot;Michael Rybinski&quot;&nbsp;</TD><TD VALIGN="TOP">(Mp3TagEditor) liegt nun auch in&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Deutsch vor!&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Besonderen Dank an Christian Busse und Kai Stegemann die dies erm&ouml;glichen!&laquo;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>&raquo;Amiga Arena - Interview mit &quot;Michal Lanser&quot;</B></P>
<P>
&quot;Michal Lanser&quot; erm&ouml;glicht mit seinem Programm &quot;MP3TOCDDA&quot; das Decodieren
von MP3 Songs in CDDA Files mittels der MPEGA.library.
</P>
<P>
Da die Byetorder gew&auml;hlt werden kann l&auml;st sich das CDDA File direkt auf CD
brennen.
</P>
<P>
Im Interview stellte sich &quot;Michal Lanser&quot; den Fragen der Amiga Arena!&laquo;
</P>
<P><B>&raquo;Amiga Arena - Interview mit &quot;Álmos Rajnai&quot;</B></P>
<P>
Codename:Petunia!<BR>
Seit dem letzten &quot;Executive Update&quot; von Amiga Inc. ist es Officiell!
Hinter diesem Namen verbirgt sich der Zuk&uuml;nftige &quot;Just In Time&quot; -
Kompilierungs-basierende Motorola 68040-Emulator f&uuml;r f&uuml;r das AmigaOS 4.0!
In dem Interview mit der Amiga Arena,erz&auml;hlt uns &quot;Álmos Rajnai&quot; einwenig
&uuml;ber seinen Werdegang und wie es zu der Entwicklung von &quot;Petunia&quot; kam.&laquo;
</P>
<P><B>&raquo;Amiga Arena - Vollversion/Source Code</B></P>
<P>
In Zusammenarbeit mit &quot;David Ekholm&quot; ver&ouml;ffentlicht die Amiga Arena die
Final Version von DBase 3.4 inklusive frei verf&uuml;gbaren Source Code!
DBase ist eine kleine aber schnelle Datenbank.
</P>
<P>
Der Source Code wurde unter dem SAS Compiler (6.xx) erstellt!
Somit befindet sich nach &quot;ArtPro&quot; und &quot;Aual Illusion&quot; ein weiteres Programm
welches zur freien weiter Entwicklung zur Verf&uuml;gung steht!
Weitere Informationen befindet sich im Download Archive oder k&ouml;nnen von
&quot;David Ekholm&quot;  (<A HREF="mailto:david-ek@dsv.su.se">david-ek@dsv.su.se</A>)  bezogen werden!&laquo;
</P>
<P><B>&raquo;Amiga Arena - Interview mit &quot;Laszlo T&ouml;r&ouml;k&quot;</B></P>
<P>
Der AVI/MOV Abspieler &quot;MooVid&quot;,der auch bestandteil von Amiga OS 3.9 ist,
befindet sich zur Zeit in der Beta 1.6 Version und wird in Zukunft Divx
support beinhalten.
</P>
<P>
Im Interview mit der Amiga Arena sprach &quot;Laszlo T&ouml;r&ouml;k&quot; &uuml;ber zuk&uuml;nftige
features und stellte sich den *Standard* Fragen!
Hinweis: Aus aktuellem Anlass kann ich z.Z. nur die Englische Version
ver&ouml;ffentlichen!
Der Fragenkatalog wurde bereits vor Wochen an &quot;Laszlo T&ouml;r&ouml;k&quot; gesendet,den
ich aber auch erst heute unverhofft erhielt!&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
