<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Forum1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Forum
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>2. Leserbeitr&auml;ge zur Frage nach den verwendeten Betriebssystemen</H2>
<P>
In der Februarausgabe hatten wir euch gebeten, uns mitzuteilen, ob ihr
neben dem AmigaOS noch ein oder mehrere weitere Betriebssysteme benutzt.
Sechs Leser haben uns geschrieben, hier ihre Beitr&auml;ge:
</P>
<P><B>Norbert Britting:</B></P>
<P>
&raquo;Ich habe neben AmigaOS 3.9 (A4000/PPC604-200, 040-40) Win98SE und WinXP.
Ich habe auch MacOS 8.1 mit Fusion, das wird aber nur noch selten benutzt.&laquo;
</P>
<P><B>Herbert Klackl:</B></P>
<P>
&raquo;Nachdem ihr euch in der letzten AMIGA aktuell daf&uuml;r interessiert habt,
welche anderen Betriebssysteme die User noch verwenden, hier meine kleine
Liste:
</P>
<P><B>Privat besitze ich &quot;nur&quot; einen A4000 mit</B></P>
<UL>
<LI> AmigaOS 3.9
</LI>
<BR><LI> Linux/APUS *)
</LI>
<BR><LI> MorphOS *)
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">*) aufgrund eines Defektes meiner PPC-Karte derzeit leider nicht. 8(&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Ich arbeite momentan beruflich auf einem PC unter Win 2000 und - wie ja
allgemein bekannt - ist dort auch nicht alles Gold was gl&auml;nzt. Am meisten
&auml;rgert mich die Tatsache, dass trotz einer CPU, die eigentlich ein
mehrfaches der alten 68060er leisten sollte, die Amiga-GUI doch viel
angenehmer von der Antwortzeit ist als der PC (aber das nur nebenbei, nicht
dass jemand denkt, ich will hier einen Flamewar provozieren 8) ).
</P>
<P>
Wenn es n&auml;mlich um die Stabilit&auml;t eines Betriebssystems gehen w&uuml;rde, w&uuml;rde
ich auf eine AS/400 umsteigen (auf der ich ebenfalls programmiert habe).
Und obwohl die dortige Software ziemlich spartanisch ist, ist deren
Betriebssystem wohl das (IMHO) Beste - was die Stabilit&auml;t betrifft -, mit
dem ich jemals gearbeitet habe.&laquo;
</P>
<P><B>Armin Forster:</B></P>
<P><B>&raquo;Folgende Rechner stehen bei mir zu Hause:</B></P>
<P><B>Amigas:</B></P>
<P>
A 4000 CyberstormPPC/180 MHz, CybervisionPPC, int. Scandoubler f&uuml;r
AGA, Teac 32-fach, int. ZIP-SCSI, 128 MB RAM. Auf dem UW-SCSI laufen 2 HD
von IBM mit insgesamt 6,2 GB und eine Quantum UDMA (nur &uuml;ber UW-SCSI to
UDMA-Controller).
</P>
Selten genutzt:<BR>
A 1200 inkl. Turbokarte, Kick 3.1, 1230/40MHz<BR>
A 2000 inkl. A2620-Turbokarte, Kick 3.1 und Scandoubler<BR>
A 2000 inkl. MK3-Frezer, Kick 2.05 und Scandoubler<BR>
A 600, Kick 2.0,<BR>
A 500 (2x)....<BR>
<P><B>PC:</B></P>
<P>
Athlon 1400 und 256 MByte RAM mit Voodoo 5&laquo;
</P>
<P><B>G&uuml;nter Raab:</B></P>
<P>
&raquo;...bin wohl einer der letzten REIN-AMIGA-USER(!!) in &Ouml;sterreich. :-(
</P>
<P>
Sicher. Der PC und MAC sind in Hardware-technischer Hinsicht um Lichtjahre
voraus. Beim Amiga ist der PPC wohl nur sehr selten anzutreffen. Zu teuer?
Na ja. Auch. Aber eben nicht nur der Preis ist ausschlaggebend.
</P>
<P>
Ich schreibe aus Erfahrung: Vor etwa 2 Jahren wollte ich meinen A1200 mit
einem PPC/210/SCSI aufr&uuml;sten. Also eine deutsche Firma (Vesalia)
angeschrieben, Karte bestellt.
</P>
<P>
Warten. Nach einigen Wochen(!) Anfrage, was los sei. Antwort: ist in
Lieferung. Also: warten. Nach einigen Wochen(!)...aber das hatten wir
schon. Kurzum: Ich habe es aufgegeben, solch eine Karte zu erwerben. Da
andere noch existierende Firmen von besagter in punkto Lieferung abh&auml;ngig
sind, ergibt sich eben ein Riesenmanko am Amiga-Markt: WOHER BEKOMME ICH
NOCH PRODUKTE UND IN WELCHEM ZEITRAUM??
In &Ouml;sterreich ist nur mehr ein (in Zahlen: 1) Amiga-H&auml;ndler (Point&amp;Design,
Graz)  &uuml;brig. Er engagiert sich wirklich, veranstaltete vor Kurzem sogar
eine Amiga-Hausmesse, aber auch er hat gro&szlig;e Probleme, Bestellungen seiner
Kunden erf&uuml;llen zu k&ouml;nnen.&laquo;
</P>
<P><B>Robert Gisinger:</B></P>
<P>
&raquo;Ich habe mich bis jetzt erfolgreich gegen Windows und Konsorten
gewehrt. Noch bin ich meinem OS 3.9 treu. Bisher war ich echt zufrieden,
denn Geschwindigkeit und Bedienbarkeit waren toll.
</P>
<P>
Mittlerweile wird's aber schon &quot;bescheiden&quot;, wenn man mal eine E-Mail im
Word- oder PS-Format erh&auml;lt. Manche Homepages crashen das System, usw. Plug
and Play war mal.
</P>
<P>
Was als N&auml;chstes kommt, wei&szlig; ich noch nicht. Kann sein PC mit AmigaXL und
Amithlon, oder wenn's machbar ist, ein Mac. Ungern w&uuml;rde ich auf
liebgewonnene Software wie ArtEffect, Adorage, Wildfire... verzichten.&laquo;
</P>
<P><B>Daniel (Nachname unbekannt):</B></P>
<P>
&raquo;Ich f&uuml;r meinen Teil benutze ausschlie&szlig;lich einen Amiga!!! Nebenbei l&auml;uft
bei mir nix. Au&szlig;er, dass ich noch 'nen C64 und Sega MegaDrive hier stehen
habe. (Ach, da gibt's feine Spiele :-) ).
</P>
<P>
F&uuml;r den Amiga habe ich mir jetzt gerade (gebraucht) meine letzte &quot;gro&szlig;e&quot;
Anschaffung geleistet, eine 1260/50-Turbokarte. Letzte Anschaffung, da ich
danach f&uuml;r den Classic-Amiga (auch die veralteten PPC-Karten) einfach nix
mehr ausgeben kann. Die Hardware ist so &uuml;berteuert, das ist fast schon
unglaublich, und was man als Gegenleistung erh&auml;lt (besonders bei den PPCs)
ist einfach nur ein Witz. Kaum sind mal 'nen paar gute (an zwei H&auml;nden
abzuz&auml;hlen!!) Spiele daf&uuml;r erschienen (Heretic II, Freespace,
Nightlong...), ist die Hardware schon wieder zu schwach, als dass neuere
Konvertierungen darauf vern&uuml;nftig laufen w&uuml;rden.
</P>
<P>
Auch Anwendersoftware, die den PPC vern&uuml;nftig nutzt, ist ja wohl eher rar.
Und was soll ich mit 'nem PCI-Board?? Ich habe z.B. ein Zorro-IV-Board, das
offenbar einen Defekt hat. Bis so was aber von z.B. Vesalia repariert wird,
vergehen gut 11/2 Jahre...aber das ist jetzt ein anderes Thema).
Okay, es gibt zur Zeit verschiedene PCI-Board-L&ouml;sungen f&uuml;r ca. 200 - 250
EUR. Dazu m&uuml;sste man sich dann noch die entsprechenden PCI-Karten holen, die
auch noch ein paar Euro kosten. Von den zus&auml;tzlich zu bezahlenden Treibern
ganz zu schweigen! Wo ist da die Verh&auml;ltnism&auml;&szlig;igkeit???
&quot;Nur&quot; f&uuml;r eine schnellere Grafikkarte und Soundkarte soviel Geld ausgeben??
Und was m&uuml;ssen Leute ausgeben, die keine PPC-Karte oder das Zorro-IV-Board
haben, um darauf das PCI-Board laufen zu lassen??
Erst eine neue Turbokarte kaufen (wenn sie denn bei irgendeinem H&auml;ndler mal
zu bekommen ist!).... Das k&ouml;nnte man jetzt noch gro&szlig; und lang weiter
spinnen. Auch das Nicht-Zusammenarbeiten von kommerziellen
Hardware/Softwareh&auml;usern, usw.
</P>
<P>
Klartext: &quot;Ich werde mir nix mehr f&uuml;r meinen Classic-Amiga kaufen (au&szlig;er
das eine oder andere nette Spiel, z.B. Payback, etc.)!
Solange noch nicht mal Amiga, Inc. daf&uuml;r sorgen kann, dass es endlich mal
einen guten Browser f&uuml;r den Amiga gibt, ist es doch alles ein Witz...
Ich werde mir dieses Jahr (wohl eher im 4. Quartal) definitiv einen
komplett neuen Rechner kaufen. Wenn der Pegasos kommen sollte (*), der
Preis stimmt und schon in den ersten Monate abzusehen ist, dass es
erstklassige Software daf&uuml;r geben wird, w&uuml;rde ich mir wirklich &uuml;berlegen,
den Rechner anzuschaffen. Wenn ich allerdings ehrlich bin, glaube ich noch
nicht ganz daran! :-(
Tja, wenn das dann halt nicht der Fall sein sollte, w&uuml;rde wohl oder &uuml;bel
ein g&uuml;nstiger PC f&uuml;r Internet etc. ins Haus kommen. Die sonstigen Sachen
w&uuml;rde ich dann aber noch mit meinem Amiga machen!!!! Immerhin hat man schon
'ne Menge Kohle in das System gesteckt!!! Falls sich dann Ende des Jahres
herausgestellt hat, welche Spielkonsole das Rennen macht (wahrscheinlich
immer noch die PS2?!), w&auml;re ich da bestimmt auch nicht abgeneigt. Tja, da
gibt es halt 'ne Menge Games...und da ich gerne spiele...
</P>
<P>
In der Hoffnung, dass da noch ein &quot;Super&quot;-Amiga kommt
</P>
<P><B>Rainbow</B></P>
<P>
(*) Immerhin ist bis zum heutigen Tage immer noch kein Board zu haben, auch
f&uuml;r Entwickler wie Hyperion nicht!!&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Forum1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Forum3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
