<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele8.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>7. Oldies but Goldies</H2>
<P><B>Dungeon Master</B></P>
<P>
Es war im Jahre 1988: Rollenspiele waren ein ganz, ganz gro&szlig;er Trend im
Spielesektor. Die Ultima- und Bard's Tale-Reihen feierten riesige Erfolge
und wurden technisch immer ausgefeilter. Nach Meinung vieler Kenner war die
Spitze der Evolution der Rollenspiele erreicht, als eine kleine
Softwareschmiede mit dem Namen FTL f&uuml;r Furore sorgte. Grund f&uuml;r die
Aufregung war die Ank&uuml;ndigung eines Rollenspiels mit Echtzeit-Aspekten:
Dungeon Master.
</P>
<P>
 <A HREF="img/DM_Title.png"><IMG SRC="thumb/DM_Title.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Die ersten Screenshots zeigten wenig Aufregendes, erste Informationen zur
Bedienung und den Echtzeit-Features hingegen klangen geradezu revolution&auml;r:
Die Bedienung sollte vollst&auml;ndig intuitiv sein und die Gegner sollten sich
in Echtzeit bewegen, was f&uuml;r diesen Spielesektor eine echte Neuheit
darstellte.
</P>
<P>
Nach dem Erscheinen der ersten Version f&uuml;r den Atari ST wurde schnell klar,
dass FTL nicht zu viel versprochen hatte. Dungeon Master war tats&auml;chlich
eine Revolution! Es fand im Laufe der Zeit immer mehr Fans, es erschienen
mehr und mehr Umsetzungen f&uuml;r die verschiedenen Computersysteme und sogar
Spielkonsolen.
</P>
<P>
Auch heute noch hat Dungeon Master eine gro&szlig;e Fangemeinde, wie ein Blick in
die Ergebnisse diverser Suchmaschinen zum Stichwort 'Dungeon Master' zeigt.
</P>
<P>
Nach der technischen Seite betrachten wir nun die spielerische Seite dieses
Meilensteins der Computerspiele.
</P>
<P>
Nat&uuml;rlich hat auch Dungeon Master eine Hintergrund-Story, die dem Spieler
erkl&auml;rt, wie das Spiel eigentlich funktioniert und auf einige
Besonderheiten aufmerksam macht, die im Verlauf des Spiels von besonderer
Bedeutung sind.
</P>
<P>
Alles beginnt im Labyrinth des Grauen Lords, einem m&auml;chtigen Zauberer, der
sich seit Jahren darauf vorbereitet, den sagenhaften 'Power Gem' aus dem
Inneren des Berges zu befreien, in dem er vom Sch&ouml;pfer des Universums
versteckt wurde.
</P>
<P>
Der Graue Lord hatte einen Gehilfen mit Namen Theron, der, wie sein Herr,
dem Tag entgegenfieberte, an dem der Power Gem befreit werden und zum Wohle
aller Gesch&ouml;pfe seine Kraft spenden sollte. Es war dem Grauen Lord
allerdings bewusst, dass dieses Unternehmen extrem gef&auml;hrlich war. Daher
sorgte er daf&uuml;r, dass sein Gehilfe eine Reise zu unternehmen hatte, bevor
das Unternehmen in die wirklich gef&auml;hrliche Phase trat.
</P>
<P>
Es zeigte sich, wie weise dieser Plan war, denn genau zu dem Zeitpunkt, als
Theron sich schon auf dem Weg befand und der Graue Lord den 'Fire Staff'
nahm und einen Zauberspruch aufsagte, der den Power Gem zum Vorschein
bringen sollte, passierte es: Der Spruch war nicht der richtige und der
Power Gem zeigte daher einen kleinen Vorgeschmack auf seine Macht. Das
Universum spaltete sich, und der Graue Lord mit ihm. Die unbegreiflichen
Kr&auml;fte des Power Gem teilten den Grauen Lord in die zwei Seiten seiner
Pers&ouml;nlichkeit. Die gute, verdammt dazu, als Geist zu existieren und nicht
f&auml;hig, den begangenen Fehler zu korrigieren und die b&ouml;se, nur darauf
erpicht, Chaos und Verderben &uuml;ber das Universum zu bringen. Der Power Gem
verblieb in dem Berg und der 'Fire Staff' befand sich nun auch dort.
</P>
<P>
Das war die Situation, die Theron bei seiner R&uuml;ckkehr vorfand. Die gute
H&auml;lfte des Grauen Lords hatte noch daf&uuml;r sorgen k&ouml;nnen, dass wenigstens
Theron die vor&uuml;bergehende Teilung des Universums &uuml;berstand und bat Theron
nun darum, stellvertretend den begangenen Fehler r&uuml;ckg&auml;ngig zu machen.
Theron sollte sich zu dem Berg begeben, in dessen Inneren sich der Power
Gem befand. Sein Meister ben&ouml;tigte den 'Fire Staff', um den Power Gem zu
bergen und die alte Ordnung wiederherzustellen.
</P>
<P>
Es gab da allerdings ein klitzekleines Problem: Die b&ouml;se H&auml;lfte des Grauen
Lords, die sich Lord Chaos nannte, hatte den Power Gem bereits gefunden und
in dem Labyrinth im Inneren des Berges versteckt. Es blieb nicht mehr viel
Zeit, denn Lord Chaos war dabei, sich die Kr&auml;fte des Power Gem zunutze zu
machen, und es war nur eine Frage der Zeit, ob er den Power Gem voll unter
Kontrolle bringen konnte.
</P>
<P>
Doch der Graue Lord hatte auch f&uuml;r dieses Problem schon vorgesorgt: Er
schaffte es, die Seelen vor langer Zeit gestorbener Abenteurer, Krieger,
Zwerge, Diebe und sogar ein Monster, vor dem dunklen Nichts zu retten. Er
steckte diese Seelen in Spiegel, die er im obersten Stockwerk des
Labyrinths, der 'Hall of Champions', verteilt hatte, und so warteten diese
Seelen darauf, von Theron wieder zum Leben erweckt zu werden.
</P>
<P>
Therons Aufgabe war es somit, mit Hilfe der wiedererweckten 'Champions' in
das Labyrinth einzudringen und den 'Fire Staff' zu finden, um ihn seinem
Meister zu &uuml;bergeben.
</P>
<P>
Nach dieser spannenden Geschichte kommen wir nun zum eigentlichen Spiel.
</P>
<P>
Nach dem Vorspann sieht man vor sich das Eingangstor zum Labyrinth. Mit
einem Klick auf den gr&uuml;nen Knopf &ouml;ffnet es sich und man kann eintreten. In
diesem Stockwerk des Labyrinths trifft man noch nicht auf Gegner, hier
befinden sich die Spiegel der Seelen. Man kann frei umher wandern und sich
die Bilder in aller Ruhe betrachten. Klickt man mit der Maus auf eines der
Bilder, bekommt man Informationen &uuml;ber den Krieger, dessen Seele im
jeweiligen Spiegel steckt.
</P>
<P>
 <A HREF="img/DM_MainMenu.png"><IMG SRC="thumb/DM_MainMenu.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
 <A HREF="img/DM_InGame.png"><IMG SRC="thumb/DM_InGame.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Es gibt zwei M&ouml;glichkeiten, einen der Champions wiederzuerwecken:
'Resurrection' und 'Reincarnation'. Bei 'Resurrection' werden die Champions
so wiedererweckt, wie sie vor Ihrem Tod waren, mit allen F&auml;higkeiten und
Gegenst&auml;nden. Bei 'Reincarnation' sind alle F&auml;higkeiten und Gegenst&auml;nde
nicht mehr vorhanden, und die Champions m&uuml;ssen sozusagen neu ausgebildet
und ausgestattet werden. Allerdings werden bei der Reinkarnation die vorher
vorhandenen F&auml;higkeiten in st&auml;rkere physische Attribute umgewandelt, und
man kann dem Champion einen Namen eigener Wahl geben.
</P>
<P>
Insgesamt kann man vier Champions seiner Gruppe hinzuf&uuml;gen. Zu jedem
Champion gibt es am oberen Bildschirmrand ein paar Icons, &uuml;ber die der
jeweilige Champion gesteuert werden kann und die seine momentane Ausr&uuml;stung
zeigen.
</P>
<P>
Die Steuerung ist wirklich sehr intuitiv, denn wenn man m&ouml;chte, dass einer
seiner Champions z.B. eine Waffe in die Hand nehmen soll, klickt man
einfach auf die 'rechte Hand' des jeweiligen Champions und w&auml;hlt die
gew&uuml;nschte Waffe aus. Schon hat der Champion die gew&auml;hlte Waffe in der Hand
und kann sie einsetzen.
</P>
<P>
 <A HREF="img/DM_InGameInventory.png"><IMG SRC="thumb/DM_InGameInventory.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Nachdem man sich ein wenig mit den M&ouml;glichkeiten der Charaktersteuerung
auseinandergesetzt hat, ist es an der Zeit, in die Tiefen des Labyrinths
hinabzusteigen. Kurz bevor man die erste hinabf&uuml;hrende Treppe erreicht,
findet man eine Schriftrolle. Diese kann man aufnehmen und mit dem 'Auge'
in der Charaktersteuerung lesen. Sie enth&auml;lt die Anweisung f&uuml;r einen
Zauberspruch, der ein magisches Licht erzeugt. Im weiteren Verlauf des
Spieles findet man noch einen ganzen Haufen Schriftrollen, die dem Spieler
Zauberspr&uuml;che erkl&auml;ren und ein paar Hilfen f&uuml;r die &uuml;berall vorhandenen
Geheimnisse des Labyrinths geben.
</P>
<P>
Man steigt nun also die erste Treppe hinab, und kurz darauf h&ouml;rt man auch
schon die ersten Ger&auml;usche. Es ist ein dumpfes Tappen, recht unheimlich
klingend. Kein Wunder, denn wenn man ein klein wenig heruml&auml;uft, trifft man
auch schon auf die ersten Monster: Mumien. Hier kann man auch das erste Mal
den Echtzeit-Aspekt des Spiels kennen lernen. Weicht man vor den Mumien
zur&uuml;ck, verfolgen sie die Gruppe, und zwar auch dann, wenn sich die Gruppe
selbst nicht bewegt.
</P>
<P>
Diese Monster, die in beinahe jedem Stockwerk zu finden sind, sind f&uuml;r den
Anf&auml;nger schon recht harte Brocken. Man kann sie mit den vorhandenen Waffen
bek&auml;mpfen, was am Anfang noch ziemlich schwer ist. Es kann durchaus
passieren, dass man das erste Mal an diesen Gegnern scheitert. Findige
Spieler werden allerdings bemerken, dass an einer Wand&ouml;ffnung, die
verd&auml;chtig nach Falltor aussieht, ein Schalter zu sehen ist. Bet&auml;tigt man
diesen, f&auml;llt ein Tor herab, bet&auml;tigt man ihn noch einmal, wird das Tor
wieder hinaufgezogen. Was spricht also dagegen, die Mumien unter dieses Tor
zu locken und auszuprobieren, wie diese auf das herabfallende Tor
reagieren?
</P>
<P>
Der Spieler wird feststellen, dass die Level des Spiels recht klug angelegt
sind. Monster und R&auml;tsel sind so aufgestellt, dass man die Bedienung und die
Geheimnisse des Spiels quasi spielerisch erlernt. F&uuml;r das weitere Spiel
wichtige Kenntnisse und Fertigkeiten (dazu geh&ouml;rt auch das Spielchen mit
der Fallt&uuml;r ;) ) werden dem Spieler im ersten und auch in sp&auml;teren Levels
nahegebracht. Das gilt auch f&uuml;r  die Zauberspr&uuml;che, die man in Form von
Schriftrollen in beinahe jedem Level findet. Diese sind so im Spiel
verteilt, dass die f&uuml;r den jeweiligen Level brauchbaren Zauberspr&uuml;che zum
richtigen Zeitpunkt gefunden werden k&ouml;nnen.
</P>
<P>
Im &Uuml;brigen bietet Dungeon Master alles, was man von einem Computer-
Rollenspiel erwartet. Jede Menge Monster, geheime T&uuml;ren und Durchg&auml;nge in
den Mauern, R&auml;tsel aller Art und in jedem Schwierigkeitsgrad. Man tritt hin
und wieder auf Platten, die eine Aktion ausl&ouml;sen, Fallt&uuml;ren im Boden, es
gibt Drehfelder und Teleporter. Auf dem Weg in die Tiefen des Labyrinths
kann man also reichlich Abenteuer erleben, und das auf eine Art und Weise,
die Dungeon Master zu einem wahren Klassiker der Spielegeschichte gemacht
hat.
</P>
<P><B>Wolfgang Hosemann &lt;<A HREF="mailto:whose@web.de">whose@web.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele8.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
