<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>3. News</H2>
<P><B>&quot;Tales of Tamar&quot;</B></P>
<P>
Das Ende naht mit gro&szlig;en Schritten, Gott sei dank nicht das Ende des
Spiels, sondern das Ende der Wartezeit. Im M&auml;rz sind f&uuml;r die Betatester
immerhin drei Updates erschienen, die das ganze z.B. um die Artillerie und
die Kavallerie erweitert haben. Es fehlen f&uuml;r das erste Basis-Set nun
nur noch die Siedler und der Statistikscreen. Ist das erledigt, folgt noch
eine zweimonatige Testphase, und dann d&uuml;rfen wir uns hoffentlich endlich
des Spiels erfreuen. Ich bin jedenfalls schon sehr gespannt.
</P>
<P>[1] <A HREF="http://www.tamar.net" TARGET="_top">http://www.tamar.net</A></P>
<P><B>&quot;Foundation Gold&quot;</B></P>
<P>
Unverhofft kommt oft. Epic Interactive bietet im Downloadbereich ein
Update f&uuml;r das Strategiespiel Foundation Gold an, das alle bekannten Fehler
ausmerzt. Das Update ist allerdings NICHT geeignet f&uuml;r die &uuml;brigen
Versionen von Foundation, wirklich nur f&uuml;r &quot;Foundation Gold&quot;.
</P>
<P>[1] <A HREF="http://www.epic-interactive.com/english/download/download.html" TARGET="_top">http://www.epic-interactive.com/english/download/download.html</A></P>
<P><B>&quot;Simon The Sorcerer 2&quot;</B></P>
<P>
Genauso unerwartet wie zu Foundation Gold hat Epic Interactive ein Update
f&uuml;r den Zauberer Simon im Gep&auml;ck. Hobbymagier mit PPC-angetriebenem
Zauberstab, &auml;h, Rechner, d&uuml;rften hocherfreut sein, dass diesmal auch an sie
gedacht wurde. Eine PPC-Version liegt n&auml;mlich auch vor und machte zumindest
hier keinerlei Probleme - allerdings halten sich die Unterschiede auch in
Grenzen.
</P>
<P>[1] <A HREF="http://www.epic-interactive.com/english/download/download.html" TARGET="_top">http://www.epic-interactive.com/english/download/download.html</A></P>
<P><B>&quot;BallMasterAGA&quot;</B></P>
<P>
Die Amiga Arena hat wieder einmal Programmierer &uuml;berreden k&ouml;nnen, eines
ihrer Spiele f&uuml;r die &Ouml;ffentlichkeit frei zug&auml;nglich zu machen. Diesmal
handelt es sich um &quot;BallMasterAGA&quot;, das ein wenig an das gute alte
&quot;Brettspiel&quot; Slotter erinnert.
</P>
<P>
 <A HREF="img/BallMasterAGA.png"><IMG SRC="thumb/BallMasterAGA.jpg" WIDTH="120" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Es geht darum, je vier gleichfarbige B&auml;lle in die bereitstehenden Beh&auml;lter
zu bef&ouml;rdern. Die Beh&auml;lter lassen sich drehen und sind durch Kan&auml;le
miteinander verbunden. Die B&auml;lle lassen sich &uuml;ber die Kan&auml;le von Beh&auml;lter
zu Beh&auml;lter schieben. Jetzt das Problem: Erstens passen in jeden Beh&auml;lter
maximal vier B&auml;lle und au&szlig;erdem kommt st&auml;ndig ein neuer Ball von oben nach.
Wenn man nicht schnell genug ist, ist's eben aus.
</P>
<P>[1] <A HREF="http://www.online-club.de/arena/" TARGET="_top">http://www.online-club.de/arena/</A></P>
<P><B>&quot;Freespace - The Great War&quot;</B></P>
<P>
Nicht von Hyperion, aber trotzdem nicht verkehrt sind die MODs und neuen
Kampagnen, die es im Internet zu finden gibt. Den Anfang machen die
Kampagne &quot;Black Horizon&quot; und die MODs f&uuml;r Babylon5 und StarTrek. Weitere
sollen folgen.
</P>
<P>[1] <A HREF="http://www.amigalien.de/freespace/hp/mods.htm" TARGET="_top">http://www.amigalien.de/freespace/hp/mods.htm</A></P>
<P><B>&quot;Nightlong&quot;</B></P>
<P>
Einen Prozess in Aussicht, hat die Dublium Corp. f&uuml;r Clickboom neue
Versionen der fehlerbehafteten CD-ROMs von Nightlong hergestellt. Diese
k&ouml;nnen bei Clickboom gekauft werden.
</P>
<P>
Nichts davon haben allerdings die bisherigen K&auml;ufer. Die Duplizierfirma
weigert sich weiterhin, die bisher ausgelieferten CD-ROMs zu ersetzen.
</P>
<P>[1] <A HREF="http://www.clickboom.com/s-files/17.shtml" TARGET="_top">http://www.clickboom.com/s-files/17.shtml</A></P>
<P><B>&quot;ScummVM&quot;</B></P>
<P>
F&uuml;r die MorphOS-Version des Lucasfilm-Adventure-Interpreters (nettes Wort)
ist ein Update erschienen. Monkey Island 1 funktioniert nun tadellos, Indy
4 l&auml;sst sich komplett spielen und ebenfalls Day of The Tentacle.
</P>
<P>[1] <A HREF="http://www.muenster.de/~timjoad/scummvm.html" TARGET="_top">http://www.muenster.de/~timjoad/scummvm.html</A></P>
<P><B>&quot;Spieleank&uuml;ndigungen von Clickboom&quot;</B></P>
<P>
Clickboom k&uuml;ndigt neue Spiele an, schweigt sich aber &uuml;ber die Titel aus.
Steht nicht noch immer &quot;Z&quot; aus???
</P>
<P>[1] <A HREF="http://www.clickboom.com/s-files/17.shtml" TARGET="_top">http://www.clickboom.com/s-files/17.shtml</A></P>
<P><B>&quot;Entwicklerportal f&uuml;r Amiga-Spiele&quot;</B></P>
<P>
J&uuml;rgen A. Theiner m&ouml;chte playamiga.de als Entwicklerportal nutzen, d.h.
interessierte Leute k&ouml;nnen sich bei ihm melden, wenn sie an einem
Projekt teilnehmen m&ouml;chten oder eines anzubieten haben.
</P>
<P>[1] <A HREF="http://www.eternity-computer.de/playamiga/" TARGET="_top">http://www.eternity-computer.de/playamiga/</A></P>
<P><B>Oliver Tacke &lt;<A HREF="mailto:oliver@aakt.de">oliver@aakt.de</A>&gt; - schickt mir eure News!</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
