<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele7.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>6. Review: dynAMIte v1.9</H2>
<P>
Es ist schon eine Weile her, da erschien das kostenlose Spiel dynAMIte in
seiner ersten Version. Mittlerweile tr&auml;gt das Programm die Versionsnummer
1.9. Ein guter Grund, um sich die &Auml;nderungen einmal anzuschauen.
</P>
<P>
Ganz kurz, aber wirklich nur ganz kurz, f&uuml;r diejenigen, die das Spiel nicht
kennen: dynAMIte ist ein Bomberman-Clone mit diversen Extras, bei dem es
gilt, die anderen Mitspieler mittels Bomben auszuschalten. F&uuml;r mehr gebt
mal &quot;Bomberman&quot; oder &quot;Dynablaster&quot; in eine Suchmaschine ein.
</P>
<P>
Aber zur&uuml;ck zu den neuen Features. Da gibt es zum einen als neues Item den
Nachbrenner, der die Explosion der Bomben verl&auml;ngert. Sehr praktisch. Neu
ist auch die Flagge. Wer diese einsammelt, hat sofort gewonnen. Starship
Troopers l&auml;sst gr&uuml;&szlig;en. Der altbekannte Teleporter hat einen Bruder
bekommen, der nicht den Spieler selbst, sondern alle anderen Mitspieler an
eine beliebige andere Stelle bringt. F&uuml;r feige H&uuml;hner gibt es nun den &quot;Map
Jump&quot;, d.h. ein neues Spiel beginnt auf einem anderen Spielfeld.
Dann gibt es noch die Positionstauscher. Die funktionieren so &auml;hnlich wie
die Teleporter, nur dass die Rematerialisierungspunkte nicht willk&uuml;rlich
sind, sondern jeweils von der Position der anderen Spieler abh&auml;ngen. Auch
hier gibt es zwei Versionen. Die eine betrifft alle Spieler, die andere nur
die &quot;b&ouml;sen&quot; Gegner. Und wo das Teleportieren sich schon so nach Star Trek
anh&ouml;rt: Wurml&ouml;cher gibt es auch.
</P>
<P>
Geklaut von Counterstrike, na ja nicht wirklich, ist die Blendgranate.
Zum guten Schluss kommen wir zu meinem liebsten neuen Item, dem H&ouml;llenfurz!
Wer den einsammelt, der zieht eine ganze Weile lang eine Duftspur hinter
sich her, die den lieben Mitstreitern kontinuierlich Energie abzieht, wenn
sie es nicht wagen, einen Totensch&auml;del einzusammeln.
</P>
<P>
Eine &Auml;nderung gab es beim Duell und bei der Fernlenkbombe. Spieler, die das
Zeitliche gesegnet haben, d&uuml;rfen nun wirklich nicht mehr mitspielen.
</P>
<P>
Soweit die &Auml;nderungen direkt im Spiel. Kommen wir zu den anderen
Neuerungen. Da muss man z.B. die Sprechblasen nennen. Man kann die F-Tasten
frei mit Spr&uuml;chen belegen, die das Alter Ego dann im Comic-Stil von sich
gibt.
</P>
<P>
Hochinteressant ist auch die Weltrangliste [1], auf der man jederzeit sehen
kann, wie gut man wirklich ist. Dazu werden die Siege im Verh&auml;ltnis zu der
Anzahl durchlittener Spiele zu Rate gezogen.
</P>
<P>
F&uuml;r diejenigen, die keinen Spielpartner finden, gibt es mittlerweile auch
Bots, gegen die man in die Arena steigen kann. Die sind zwar nicht die
hellsten, aber zum Einsteigen oder zum Wieder-In-Form-Kommen reicht es.
Wem die Standard-Tastaturbelegung nicht zusagt, der kann diese nun auch
&auml;ndern. Und schaut euch auf der dynAMIte-Website [2] mal die Abteilung Maps
an: haufenweise neue Spielfelder!
</P>
<P>
Alles in allem recht viele Neuerungen. Ein wenig verwirrend ist die
mittlerweile recht gro&szlig;e Anzahl von Extras, die man einsammeln kann. Der
Reiz des Spieles hat dadurch ein wenig verloren. Vielleicht sollte man das
Serverprogramm dahingehend erweitern, dass sich f&uuml;r jeden Server einstellen
l&auml;sst, welche Items es gibt. &Uuml;bersch&uuml;ssige k&ouml;nnte man dann durch leere
Felder ersetzen.
</P>
<P>
Nichtsdestotrotz ist dynAMIte ein fantastisches Spiel und hat von einem Fan
sogar ein eigenes Lied spendiert bekommen [3], das wirklich gut dazu passt.
Bleibt zu hoffen, dass die Entwicklung weitergeht und die Zockerzahlen
wieder ein wenig steigen. dynAMIte ist es wert.
</P>
<P>
[1] <A HREF="http://amisource.de/dynamite/score.php" TARGET="_top">http://amisource.de/dynamite/score.php</A><BR>
[2] <A HREF="http://amisource.de/dynamite/" TARGET="_top">http://amisource.de/dynamite/</A><BR>
[3] <A HREF="http://www.djbase.de/audio/letsdynamite.mp3" TARGET="_top">http://www.djbase.de/audio/letsdynamite.mp3</A>
</P>
<P><B>Oliver Tacke &lt;<A HREF="mailto:oliver@aakt.de">oliver@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele7.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
