<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG7.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Der Zwischenruf
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Der Zwischenruf</H1>
<P>
<H2>Die Story vom bedruckten Papier und den Folgen ihres Fehlens...</H2>
</P>
<P>
Es war einmal, dass sich Dichter und Denker hinsetzten und unter viel
Zeiteinsatz ein Meisterwerk fabrizierten, das viele Menschen gl&uuml;cklich
machte. Nat&uuml;rlich nur, wenn es gedruckt und gebunden in H&auml;nden gehalten
werden konnte. Stand doch die kiloschwere Last f&uuml;r viele M&ouml;glichkeiten.
</P>
<P>
Doch die Leser wurden immer fauler und wussten die Lekt&uuml;re nicht mehr zu
sch&auml;tzen. Auch der Zeitdruck bei den Dichtern und Denkern nahm zu, so dass
keine gro&szlig;en und aufwendigen Werke mehr verfasst werden konnten. Man
beschr&auml;nkte sich vielmehr auf das Wichtigste und hinterlie&szlig; es den Lesenden
auf schwarzen Plastikscheiben. Mit der Zeit wurden daraus sch&ouml;ne silbrig
gl&auml;nzende Scheiben. Diese wurden oftmals auch noch liebevoll mit einem
farbigen Aufdruck versehen. Und auch immer mehr aufwendig gestaltete Fotos
fanden ihren Einzug in die Werke.
</P>
<P>
Womit die Lesenden recht gut leben konnten, brachte aber die Pr&uuml;fenden auf
die Palme, weshalb sie in jedem Bericht deutlich das Fehlen des bedruckten
Papiers anprangerten. Und sogar in der Benotung wirkte sich dieser Punkt
sichtbar aus! Aus Sicht der Pr&uuml;fenden sicher verst&auml;ndlich, mussten sie doch
jetzt in den kalten Wintertagen ohne die w&auml;rmende Literatur auskommen.
Stattdessen mussten sie jetzt in den Wald gehen, um sich Brennholz als
Ersatz f&uuml;r die w&auml;rmenden &Ouml;fen zu schlagen.
</P>
<P>
Dabei geben sich doch die Dichter und Denker immer gr&ouml;&szlig;ere M&uuml;he und legen
der Dokumentation oftmals auch gleich eine fertig druckbare Version bei.
Unter Benutzung geeigneter Sichtbarmacher und dem dazu passenden
Papierproduzierer, kann dieser philosophische Text jederzeit und in
beliebiger Menge zu dem ersehnten Papierstapel verarbeitet werden.
</P>
<P>
Und vielleicht kann dadurch auch wieder der eine oder andere Leser an die
spannende Lekt&uuml;re herangef&uuml;hrt werden. Finden sich doch dort oftmals viele
interessante Perlen, die einem im t&auml;glichen Leben sonst verborgen geblieben
w&auml;ren. Und auch die Pr&uuml;fenden k&ouml;nnen wieder in wohlig warmer Umgebung ihrer
eigentlichen Aufgabe nachkommen.
</P>
<P><B>Michael Christoph &lt;<A HREF="mailto:michael@meicky-soft.de">michael@meicky-soft.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG7.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
