<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Pelit</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>C h a o s</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">"Tohtori AivoTurmio"</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				<center><img src="kuvat/chaos.jpg" width="272" height="225" alt="Chaos"></center>
				<br>
				Viime numerossa Petteri Bamberg kirjoitti pelist&auml; nimelt&auml; Chaos 1.0, joka on siis Alastair Murrayn tekem&auml; Chaos-pelin Amos-versio. Itse en pit&auml;nyt tuosta kyseisest&auml; Amoksella r&auml;pelletyst&auml; Chaoksesta p&auml;tk&auml;n vertaa, mutta sen sijaan samaisesta Chaoksesta on olemassa my&ouml;s James Conwellin ja Sean A. Irvinen yhdess&auml; tekem&auml;t versiot 0.7 ja 2.5.<br>
				<br>
				Ideahan k&auml;vi jo p&auml;&auml;osin selv&auml;ksi edellisen Sakun jutusta: t&auml;ss&auml; versiossa 0-8 velhoa taistelee toisiaan vastaan taikojen ja erilaisten olentojen avulla. Eroa arvostellun version ja muiden versioiden kanssa kuitenkin on. Amoksen sijaan on k&auml;ytetty C-kielt&auml;. Loitsuja on enemm&auml;n ja useampaan kategoriaan kuuluvia. Illuusioloitsuja ei ole, ja ep&auml;kuolleita vastaan voi taistella ainoastaan taika tai toinen ep&auml;kuollut.<br>
				<br>
				Suosittelen tutustumistarkoitukseen Chaos 0.7:&auml;&auml;, vaikka versiossa 2.5 onkin paljon enemm&auml;n kaikenlaista. Chaos 2.5 on nimitt&auml;in vain demoversio, jossa on kierrosrajoitus. Muistaakseni kierroksella 18 tai 25 peli loppuu, kun sen sijaan 0.7:&auml;&auml; voi pelata niin monta kierrosta kuin haluaa. T&auml;m&auml; kierrosten m&auml;&auml;r&auml; on siksi tarpeen, ett&auml; peli&auml; voi pelata niin monella eri tavalla, ja jotkin tavat ehdottomasti vaativat yli 25 kierrosta, jotta muuttuisivat riemuksi.<br>
				<br>
				Jo se, ett&auml; vaihtaa loitsujen m&auml;&auml;r&auml;n joko todella isoksi tai v&auml;h&auml;iseksi, tekee pelist&auml; aivan uudenlaisen, ja eri loitsut saavat ihan uuden merkityksen. Jos esimerkiksi laitat jokaiselle taikurille viisi loitsua, niin meditointipuut, joista siis saa uusia loitsuja silloin kun ne katoavat ja olet niiden sis&auml;ll&auml;, muuttuvat yll&auml;tt&auml;v&auml;n arvokkaiksi. Koska puut katoavat, mik&auml;li niiden loitsija kuolee, niin sen loitsijan hengiss&auml;pitokin muuttuu varsin mielekk&auml;&auml;ksi puuhaksi. Toki on aina se riski, ett&auml; joku saa lohik&auml;&auml;rmeen niiden viiden loitsun joukkoon, jolloin kyseinen sessio on usein aika ennalta arvattava.<br>
				<br>
				0.7:ss&auml; on kuitenkin suuria puutteita, ja kuten versionumerokin kertoo, 0.7 ei ole valmis versio. On loitsuja, jotka eiv&auml;t toimi. Er&auml;s t&auml;llainen toimimaton loitsu korvaisi pelaajan kuoltua t&auml;m&auml;n generaattorilla, josta tulee summamutikassa elukoita v&auml;h&auml;n v&auml;li&auml;. N&auml;it&auml; elukoita voisi sitten kuitenkin viel&auml; kontrolloida. My&ouml;s koneen &auml;ly on monilta osin rajoittunut. Kone ei esimerkiksi itse osaa k&auml;ytt&auml;&auml; meditointipuita tai linnoja. Kone kyll&auml; tajuaa pyrki&auml; niit&auml; kohti, mutta sen sijaan ett&auml; p&auml;&auml;sisi sis&auml;lle niihin, se vain hakkaa niit&auml;. Chaos 0.7 on rajoittamattomuutensa takia kuitenkin hyv&auml; pelin demoversioksi.<br>
				<br>
				Kun 0.7:&auml;&auml; on sitten jonkin verran kokeillut, kannattaa hankkia Chaos 2.5:n demo, joka ainakin parissa viime Amiga Formatin CD:ss&auml; on n&auml;kynyt olevan, ja sitten p&auml;&auml;tt&auml;&auml; ostaako pelin kokonaan vai ei. Itsell&auml;ni on tarkoituksena ostaa peli kokonaan hinnasta huolimatta, on siin&auml; kuitenkin niin paljon kaikkea mahdollista uutta, sek&auml; loitsuja ett&auml; ominaisuuksia.<br>
				<br>
				Hauskaa sin&auml;ns&auml; Chaos 2.5:ss&auml; on se, ett&auml; yleens&auml; shareware-peleiss&auml; ostamista ja ohjeita siihen tyrkytet&auml;&auml;n joka tuutista, mutta Chaos 2.5:n readmesta sain oikein toden teolla etsi&auml;, ett&auml; l&ouml;ysin rekister&ouml;innin hinnan ja ohjeet. On helppo kuvitella, ett&auml; joku on j&auml;tt&auml;nyt rekister&ouml;im&auml;tt&auml; Chaoksen ihan vain siksi, ett&auml; ei todellakaan ole l&ouml;yt&auml;nyt ohjeita sen rekister&ouml;intiin. <i>[Toim.huom.: ChaosDocs.tex-tiedostosta l&ouml;ytyi n&auml;pp&auml;r&auml;sti sek&auml; hinta ett&auml; osoitteet, TEX-formaatissa tosin, mutta seh&auml;n on k&auml;yt&auml;nn&ouml;ss&auml; puhdasta ASCIIta.]</i><br>
				<br>
				Vaikka Chaos n&auml;ytt&auml;&auml;kin aika k&ouml;k&ouml;lt&auml;, niin ei kannata antaa ulkon&auml;&ouml;n pett&auml;&auml;, vaan pelaa peli&auml; muutaman kerran. Ensimm&auml;iset pari peli&auml; kun menev&auml;t jo pelkk&auml;&auml;n oppimiseen ja seuraavat sata loitsujen oppimiseen, kun niit&auml; on niin paljon. Erityisen hienoa on, ett&auml; peliss&auml; on joitain niin harvoin tulevia loitsuja, ett&auml; viel&auml;kin v&auml;lill&auml; tulee loitsu, jota ei ole koskaan aiemmin n&auml;hnyt. 0.7:&auml;&auml; sent&auml;&auml;n olen pelaillut jo varmaan viimeisen nelj&auml;n vuoden ajan, tai ainakin hyvin l&auml;helle sit&auml;.<br>
				<br>
				2.5 toimii ihan perus-A500:llakin, jossa on mega muistia. 0.7 taitaa toimia puolella megallakin, mutta tekij&auml; on kyll&auml; puhunut, ett&auml; 2.5 on viimeinen versio, joka viel&auml; toimii perus-A500:ssa ja ett&auml; t&auml;st&auml; l&auml;htien vaaditaan v&auml;hint&auml;&auml;n kaksi megaa muistia ja 20 Mt kiintolevytilaa. Hauska n&auml;hd&auml;, millainen se uusi versio sitten tulee olemaan...<br>
				<br>
				Koko versio maksaa 35 dollaria, ja rekister&ouml;im&auml;ll&auml; sinut my&ouml;s mainitaan pelin testaajaksi aina uusien versioiden ilmestyess&auml;.
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				<font size="2"><b>Aminet:</b><br>
				<a href="http://ftp.sunet.se/pub/aminet/game/think/chaos.lzh">http://ftp.sunet.se/pub/aminet/game/think/chaos.lzh</a> (1,5 Mt, v2.5d)</font>
			</td></tr>
		</table>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

