<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Pelit</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>I m p e r a t o r</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">"Tohtori AivoTurmio"</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				Imperator on strategiapeli, jossa tavoitteenasi on nousta Rooman hallitsijaksi. Alussa sinulla on Tribuunin arvonimi, 4000 tavallisen miehen armeija ja 20 000 yksikk&ouml;&auml; rahaa, viljaa ja viini&auml;.<br>
				<br>
				Viljalla ruokitaan armeija ja viinill&auml; voidaan sek&auml; pit&auml;&auml; yll&auml; armeijan moraalia ja uskollisuutta ett&auml; nostaa sit&auml; lahjoittamalla ylim&auml;&auml;r&auml;ist&auml;. Lis&auml;ksi sek&auml; viinill&auml; ett&auml; viljalla voi tehd&auml; kauppaa ostamalla ja myym&auml;ll&auml;. Viljalla voi my&ouml;s nostaa suosiotaan senaatissa lahjoittamalla sit&auml; kansalle. Muita tapoja suosion nostoon ovat lahjonta, alueiden valloittaminen ja vihollisten tuhoaminen. Lahjonnasta tosin ei tuntunut olevan mit&auml;&auml;n hy&ouml;ty&auml; - vaikka lahjoin koko senaatin, mit&auml;&auml;n ei tapahtunut.<br>
				<br>
				Armeijoita liikutetaan alueelta toiselle ja yritet&auml;&auml;n saada koko maailma haltuun - Rooma mukaanluettuna. Kun armeija tulee alueelle, joka ei ole Rooman omistuksessa, alueesta saa jonkin verran tietoa: onko alueella iso, pieni vai keskikokoinen armeija, kuinka korkea sen taistelumoraali on ja kuinka kehittynyt alue on. Mit&auml; kehittyneempi alue, sen parempaa aseistautumista on odotettavissa. Omien armeijoiden m&auml;&auml;r&auml;&auml; ja laatua saa parannettua hankkimalla arvonime&auml;.<br>
				<br>
				Alin arvonimi Tribuuni saa pit&auml;&auml; vain yht&auml; armeijaa kerralla ja siin&auml; saa olla vain tavallisia sotilaita. Tribuuni ei saa pit&auml;&auml; laivastoa. Legaani saa pit&auml;&auml; kahta armeijaa, yht&auml; laivastoa ja saa tavallisen armeijan lis&auml;ksi hankkia 400 jousimiest&auml; armeijoihinsa. Praetor saa pit&auml;&auml; nelj&auml; armeijaa, kaksi laivastoa ja voi ostaa tavallisten sotilaiden ja jousimiesten lis&auml;ksi 600 hevosmiest&auml;. Consul saa pit&auml;&auml; kahdeksan armeijaa, kolme laivastoa ja voi edellisten lis&auml;ksi pit&auml;&auml; armeijassaan kahta katapulttia, jotka ovat todella k&auml;yt&auml;nn&ouml;llisi&auml;. Korkein arvo on Rooman hallitsija, jonka saa ainoastaan Rooman valtaamalla. Rooma vallataan tavallisesti sinne hy&ouml;kk&auml;&auml;m&auml;ll&auml;. Miehet eiv&auml;t kuitenkaan suostu seuraamaan sinua taisteluun Roomaa vastaan ellet ole Consul, joka siis on korkein tavallisesti hankittava arvonimi. Hallitsija saa pit&auml;&auml; 15 armeijaa ja 8 laivastoa. Muuten rajoitukset ovat samat kuin consulilla.<br>
				<br>
				Jokainen armeija tarvitsee itselleen johtajan, joita on valittavana Ridiculouksesta (huonoin) Fabulukseen (paras). Parempi maksaa enemm&auml;n, ja palkka on maksettava joka kuukausi. Ridiculouksen hinta on 100 kuussa, Fabuluksen 10 000 kuussa, muiden silt&auml; v&auml;lilt&auml;. Yksi komentaja voi komentaa vain yht&auml; armeijaa, eli jos ostat Fabuluksen yhteen armeijaasi komentajaksi, ei mik&auml;&auml;n muu armeijoistasi voi en&auml;&auml; Fabulusta saada, ellet vapauta Fabulusta ensin teht&auml;v&auml;st&auml;&auml;n. T&auml;m&auml; on sin&auml;ns&auml; ep&auml;reilua, sill&auml; peliss&auml; voi pelata maksimissaan kolme pelaajaa yht&auml; aikaa. T&auml;st&auml; seuraa, ett&auml; se joka on ensimm&auml;isen&auml; vuorossa saa parhaan komentajan ja se joka on viimeisen&auml; saa huonoimman.<br>
				<br>
				Taistelut voi hoitaa joko itse tai vaihtoehtoisesti antaa koneen hoidettavaksi, jolloin armeijan johtajalla on paljonkin merkityst&auml;. Mit&auml; parempi johtaja, sen paremmin kone p&auml;rj&auml;&auml;. Automaattitaistelussa on my&ouml;s typer&auml;t puolensa, joista tosin pelaajalle on etua. Jos vastapuolella on nelj&auml; katapulttia mutta alhainen taistelumoraali ja itsell&auml;si on ainoastaan tavallisia sotilaita, niin jos itse menet taistelemaan, ei sinulla ole mit&auml;&auml;n mahdollisuuksia, mutta sen sijaan jos annat koneen hoitaa homman Fabulus johtajanasi, sinulla on varsin hyv&auml;tkin mahdollisuudet voittaa taistelu. Taistelusysteemi on vuoropohjainen. Ohjeet taisteluun l&ouml;ytyv&auml;t Imperatorin demoversiosta, joka on ainakin Amiga Formatin CD:ll&auml; numero 44 sek&auml; Aminetiss&auml;. Muita ohjeita ei peliin sitten olekaan.<br>
				<br>
				Armeija on jaettu yksik&ouml;ihin. Yksik&ouml;t ovat seuraavanlaisia silloin kun armeijassa on maksimim&auml;&auml;r&auml; miehi&auml;: 10 yksikk&ouml;&auml; tavallisia sotilaita, kussakin yksik&ouml;ss&auml; 400 miest&auml;; 4 yksikk&ouml;&auml; jousimiehi&auml;, kussakin 100 jousimiest&auml;; 4 yksikk&ouml;&auml; hevosmiehi&auml;, kussakin 150 hevosta sek&auml; 2 katapulttia, kumpikin erill&auml;&auml;n. Kaikki yksik&ouml;t liikkuvat samalla tavoin: klikataan hiiren vasenta nappia yksik&ouml;n kohdalla, ja sitten klikataan mihin yksik&ouml;n on tarkoitus liikkua.<br>
				<br>
				<center><img src="kuvat/imperator.jpg" width="320" height="235" alt="Imperator"></center>
				<br>
				Tavallinen sotilas, katapultti ja jousimiehet liikkuvat yhden ruudun kierroksessa. Hevonen joko k&auml;&auml;ntyy 90 astetta tai liikkuu suoraan eteenp&auml;in maksimissaan 4 ruutua kierroksessa. Yksik&ouml;t liikkuvat aina suoraan sivuttais- tai pystysuunnassa, eiv&auml;t viistosti. Tavallinen sotilas ja jousimiehet k&auml;&auml;nnet&auml;&auml;n katsomaan/taistelemaan toiseen suuntaan painamalla oikeanpuoleista hiirennappia yksik&ouml;n kohdalla. Sen j&auml;lkeen hiiren osoitin menee pieneen neli&ouml;&ouml;n, josta valitaan mihin suuntaan yksikk&ouml; k&auml;&auml;ntyy katsomaan. Sill&auml;, mihin suuntaan yksikk&ouml; katsoo, ei ole liikkumisen kannalta merkityst&auml;, koska se osaa kyll&auml; itse automaattisesti k&auml;&auml;nty&auml; siihen suuntaan mihin tarkoitus on menn&auml;, poikkeuksena hevonen.<br>
				<br>
				Katapultti ampuu aina suoraan yl&ouml;s tai alasp&auml;in riippuen siit&auml;, oletko hy&ouml;kk&auml;&auml;j&auml; vai puolustaja, mutta ei koskaan sivuille. Katapultti voi kuitenkin liikkua sivusuunnassakin. Hevosta ja katapulttia ei voi k&auml;&auml;nt&auml;&auml; katsomaan sivusuuntaan samoin kuin sotilaita tai jousimiehi&auml; ja katapulttia ei ollenkaan. Hevonen k&auml;&auml;ntyy, jos sen tarkoituksena on liikkua siihen suuntaan. Jos hevosen sivustaan tulee vihollisyksikk&ouml;, niin klikkaamalla hevosen liikkumaan yksik&ouml;n p&auml;&auml;lle hevonen k&auml;&auml;ntyy siihen suuntaan ja alkaa seuraavasta kierroksesta l&auml;htien taistella. Edest&auml;p&auml;in hy&ouml;kk&auml;ys on kaikkein tehottominta ja takaap&auml;in hy&ouml;kk&auml;&auml;minen kaikkein tehokkainta, joten kannattaa siis yritt&auml;&auml; piiritt&auml;&auml; vihollinen aina mahdollisimman monelta suunnalta.<br>
				<br>
				Yksik&ouml;iden naamasta n&auml;kee sek&auml; yksik&ouml;n tyypin ett&auml; sen moraalin. Heikolla moraalilla ovat yksik&ouml;t suupielet alasp&auml;in tai s&auml;ik&auml;ht&auml;neit&auml;, korkealla moraalilla hymysuin. Kun moraali laskee tarpeeksi, yksikk&ouml; kirkaisee, eik&auml; sit&auml; voi en&auml;&auml; sen j&auml;lkeen komentaa, vaan se pyrkii suoraan vastasuuntaan taistelusta, ellei sen moraalia nosteta komentajan boostilla. Moraalin lis&auml;ksi toinen valvontaa vaativa ominaisuus on yksik&ouml;n voima, joka n&auml;kyy prosenttina. Mik&auml;li voima on nollilla, ei yksikk&ouml; voi edes liikkua. Aina kun liikut tai taistelet, voima laskee.<br>
				<br>
				Mit&auml;&auml;n tekem&auml;tt&auml; oleminen tai komentajan boost palauttaa voimia. Itsekseen voimat eiv&auml;t palaudu yli 100 prosentin, komentajan boostilla voi nostaa voiman 200 prosenttiin. Mit&auml; enemm&auml;n voimaa, sit&auml; enemm&auml;n vahinkoa vihollinen k&auml;rsii. Mit&auml; parempi komentaja, sit&auml; enemm&auml;n boost auttaa. K&auml;yt&auml;nn&ouml;ss&auml; voit jakaa hinnan 100:lla, niin saat tiet&auml;&auml; kuinka monta prosenttia komentaja lis&auml;&auml; voimaa boostillaan, eli Ridiculous nostaa 1 prosentilla ja Fabulus 100 prosentilla. Tietokonevihollisilla ei kuitenkaan ole boostia k&auml;yt&ouml;ss&auml;, joten yhdell&auml; jousimiehell&auml; voi voittaa koko vihollisen armeijan, jos vihollinen on jo ehtinyt v&auml;s&auml;ht&auml;&auml;. Menet vain ymp&auml;ri ruutua, annat boostia yksik&ouml;llesi ja ammut v&auml;lill&auml; vihollista. T&auml;ysin ylivoimaista et itsest&auml;si peliss&auml; pysty tekem&auml;&auml;n armeijarajoitusten takia. Ylivoimaanhan riitt&auml;isi parikymment&auml; katapulttia, mutta 2 on rajoitus.<br>
				<br>
				Katapultilla ja jousimiehill&auml; ei voi samalla kierroksella liikkua ja ampua. Katapultilla ammuttaan painamalla oikeanpuoleista hiirennappia katapultin kohdalla ja sen j&auml;lkeen valitaan, mihin kohtaan suoralla linjalla ammutaan. Jousimiehet ampuvat automaattisesti siihen suuntaan mihin katsovat, jos siell&auml; on ammuttavaa. Jousimiehet kuitenkin ampuvat vain nelj&auml;n ruudun p&auml;&auml;h&auml;n. N&auml;ill&auml; ohjeilla sinun pit&auml;isi jo p&auml;&auml;st&auml; taistelun alkuun, ja yh&auml; edelleen voit k&auml;ytt&auml;&auml; my&ouml;s tietokonetta taistelusi hoitamiseen.<br>
				<br>
				Moninpelin&auml; Imperatorista tulee mielenkiintoisempi my&ouml;s senaatin suosion kannalta, sill&auml; yksi tapa lis&auml;t&auml; suosiotaan senaatissa on pit&auml;&auml; puhe, mutta moninpeliss&auml; tuota samaista puhetta voi my&ouml;s k&auml;ytt&auml;&auml; vastapelaajien maineen mustamaalamiseen. Lis&auml;ksi voi k&auml;ytt&auml;&auml; viiden eri jumalan apua, kutakin kerran pelin aikana. Jumalat vaikuttavat rahaan, laivastoon, maavoimiin ja Kleopatraan, ja Zeus tekee kaiken sen mit&auml; muutkin kerralla. Rakkauden jumalalla voi s&auml;&auml;sty&auml; toimittamasta Kleopatran vaatimuksia, joita joutuu t&auml;ytt&auml;m&auml;&auml;n, jos tekee liiton h&auml;nen kanssaan tai valtaa Egyptin. Halvemmalla tosin p&auml;&auml;see, jos j&auml;tt&auml;&auml; t&auml;ytt&auml;m&auml;tt&auml; Kleopatran vaatimuksen ja j&auml;rjest&auml;&auml; heti per&auml;&auml;n Egyptin kansalle huvitusta.<br>
				<br>
				Vaikkei ohjekirjaa peliss&auml; olekaan mink&auml;&auml;nlaista, niin kyll&auml; sen silti suht nopeasti oppii, vaikka joillakin luultavasti onkin hankaluuksia oppimisessa. Paljon auttaa kuitenkin tieto, ett&auml; useasti oikean ja vasemman hiirennapin k&auml;ytt&auml;misell&auml; on eroa. Esimerkiksi jos kartalla klikkaat vasemmanpuoleisella armeijaasi, saat armeijavalikon, jossa on kyseinen armeija valittuna. Sen sijaan jos painat oikeanpuoleista hiirennappia, p&auml;&auml;set liikuttamaan armeijaasi.<br>
				<br>
				Amiga Formatin arvostelija ei ollut pit&auml;nyt taisteluosuudesta, mutta oli pit&auml;nyt pelist&auml; muuten. Itse pidin molemmista osuuksista ja ostin pelin l&auml;hinn&auml; demoversion taisteluosuuden perusteella. Amiga Formatin arvostelija oli my&ouml;s pit&auml;nyt taisteluja vaikeina, itsest&auml;ni ne olivat aika lailla sopivan vaikeuksisia vaikka koneen teko&auml;ly olisikin saanut olla parempi.<br>
				<br>
				Imperator on ilmeisesti Amos Prolla tehty, tai ainakin paljolti n&auml;ytt&auml;isi silt&auml;. Joitain pikkuk&ouml;mm&auml;hdyksi&auml; peliss&auml; on ja jotkin toiminnot j&auml;&auml;v&auml;t kokonaan k&auml;ytt&auml;m&auml;tt&auml;, koska niit&auml; ei yksinkertaisesti tarvitse, kuten esimerkiksi oman kaupungin ry&ouml;v&auml;&auml;minen armeijallaan. Siit&auml; saatava raha on kuitenkin niin pieni, ettei jaksa vaivautua, paitsi ehk&auml; ihan alussa.<br>
				<br>
				Pelin kyll&auml; menee aika nopeasti l&auml;vitse, yhdess&auml; p&auml;iv&auml;ss&auml; jos tarkemmin sanotaan, mutta sit&auml; jaksaa pelata jonkin verran viel&auml; sen j&auml;lkeenkin. Pienill&auml; muutoksilla Imperatorista olisi saanut vallan mainion nettipelin, nyt moninpeli j&auml;&auml; aika lailla turhaksi, sill&auml; harva jaksaa alkaa pelata t&auml;llaista peli&auml; moninpelin&auml;, sen verran puutteellinen se moninpeli&auml; ajatellen kuitenkin on. Plussana on kuitenkin sanottava, ett&auml; moninpeliss&auml; voi lahjoittaa kaverilleen rahaa, viljaa tai viini&auml; niin tahtoessaan. T&auml;m&auml; hoituu kaupanteolla eli myym&auml;ll&auml; esimerkiksi satatuhatta rahaa ilmaiseksi.<br>
				<br>
				Imperatorissa on ihan mukavat grafiikat huolimatta siit&auml;, ett&auml; ne toimivat ECS-koneissakin. Musiikkia ei peliss&auml; alkudemoa lukuunottamatta ole, &auml;&auml;ni&auml; kuitenkin edes joitain. Imperator on kuitenkin on halpa ja omasta mielest&auml;ni oli hintansa arvoinen. Suosittelen silti kokeilemaan ensin demoversiota ja siit&auml; p&auml;&auml;ttelem&auml;&auml;n, pid&auml;tk&ouml; pelist&auml; vai et. Mit&auml;&auml;n maailmaa mullistavaa peli ei mink&auml;&auml;n suhteen tarjoa, mutta on harvinaisen viihtyis&auml;. Positiivista on my&ouml;s se, etten muista pelin kertaakaan kaatuneen viel&auml;. Peli tulee CD-kotelosta huolimatta kahdella levykkeell&auml;, joten &auml;lk&auml;&auml; antako pakkauksen h&auml;m&auml;t&auml;.<br>
				<br>
				
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Julkaisija:</font></td>
				<td width="50%" bgcolor="#d8ecfd">Epic Marketing<br><font size="2"><a href="http://www.epic-marketing.de/Imperator_UK.html" target="_top">http://www.epic-marketing.de/Imperator_UK.html</a></font></td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Myyj&auml;:</font></td>
				<td width="50%" bgcolor="#d8ecfd">Gentle Eye Ky, puh. (03) 363 0048<br><font size="2"><a href="mailto:ge@vip.fi">ge@vip.fi</a>, <a href="http://www.ge.vip.fi/" target="_top">http://www.ge.vip.fi/</a></font></td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
				<td width="50%" bgcolor="#d8ecfd">110 mk</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
				<td width="50%" bgcolor="#d8ecfd">2 Mt muistia, kiintolevy</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
				<td width="50%" bgcolor="#d8ecfd">A1200, 68030/50 MHz, 16 Mt Fast</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Yleisarvosana:</font></td>
				<td width="50%" bgcolor="#d8ecfd">82%</td>
			</tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				<font size="2"><b>Aminet, demoversio:</b><br>
				<a href="http://ftp.sunet.se/pub/aminet/game/demo/ImpDemoUK.lha">http://ftp.sunet.se/pub/aminet/game/demo/ImpDemoUK.lha</a> (773 kt)<br>
				<br>
				<b>Aminet, ruutukaappauksia:</b><br>
				<a href="http://ftp.sunet.se/pub/aminet/game/demo/Imperator_ss.lha">http://ftp.sunet.se/pub/aminet/game/demo/Imperator_ss.lha</a> (279 kt)</font>
			</td></tr>
		</table>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

