<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Pelit</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>M o o n b a s e s</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Timo Kemppaala &lt;<a href="mailto:apache@mbnet.fi">apache@mbnet.fi</a>&gt;</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				<center><img src="kuvat/moonbases.jpg" width="416" height="305" alt="Moonbases"></center>
				<br>
				Amigalle ei ole monta CGX-tuella ryyditetty&auml; strategiapeli&auml;, mutta jo t&auml;n&auml;&auml;nkin l&ouml;ytyy useita, jotka ovat kaupallisia tai vaihtoehtoisesti sharewarea. Napalm oli ensimm&auml;inen kunnolla tehty kaupallinen Command &amp; Conquer -klooni, jota todellakin on nautinto pelata. Valitettavasti pelin vaatimukset ovat liian korkeat useille k&auml;ytt&auml;jille: minimivaatimuksenakin on 16 Mt Fast-muistia ja 1 Mt Chip, jos sit&auml; pelailee AGA-koneella. Grafiikkakortin omistajia hemmotellaan paremmilla grafiikoilla ja ihanalla nopeudella. Vaatimukset ovat siin&auml;kin samat minimikokoonpanolla, mutta se on silti raskas koneille, joissa ei ole muistia prosessorikortilla.<br>
				<br>
				Moonbases on Command &amp; Conquer -ideologian kevyempi versio, jossa ei ole turhan kauniita grafiikoita. Peli on pelattava ilman kaunista grafiikkaakin, ja se on silloin ostoksen arvoinen. Itse testailin Moonbases-demoa ja tulin siihen tulokseen, ettei demon kahta kentt&auml;&auml; jaksa loputtomiin hakata. Kun pelatessa n&auml;lk&auml; vain kasvoi, niin Saku 99 -tapahtuman aikana livahdin ostamaan Gentle Eyelt&auml; kyseisen pelin.<br>
				<br>
				Peliss&auml; on teht&auml;v&auml;n&auml; tietenkin vihollisen lahtaaminen erilaisilla ajoneuvoilla. Tapahtumat sijoittuvat vuoteen 2075 ja Kuuhun, jossa kaksi kilpailevaa mineraalienkaivuuyhti&ouml;t&auml; (Sigma ja Omicron Corporation) tappelee siit&auml;, kumpi saa hallita mineraalivarantoja Maahan siirrett&auml;v&auml;ksi. Pelaaja voi valita, kummalla joukkiolla pelin yritt&auml;&auml; voittaa. Teht&auml;vi&auml; on 20, ne on jaettu kahteen kampanjaan ja niit&auml; voi my&ouml;s editorilla rakennella itse.<br>
				<br>
				Ajoneuvot on luotu raytrace-tekniikalla, kuten my&ouml;s pelin kuvat. Ajoneuvoja on kahdenlaisia: py&ouml;rill&auml; kulkevia ja leijuntakykyisi&auml;, raskaita ja pieni&auml;. Py&ouml;r&auml;lliset ovat tietenkin hitaampia kulkemaan ja toimimaan, mutta my&ouml;s halvempia. Leijuntakykyiset ajoneuvot ovat nopeita ja kalliita, ja lis&auml;ksi niill&auml; voi kulkea miinakenttien yli ilman miinanraivausta. Ajoneuvoja voi rakentaa sit&auml; mukaa kuin rahavarat antavat my&ouml;ten, ja joukkoja voi my&ouml;s valita kerralla paljon siirrett&auml;v&auml;ksi.<br>
				<br>
				Aluksia on eri taistelutilanteisiin, tiedusteluun ja mineraalien kaivamista varten. Pelaaja joutuu rahoittamaan toimintansa itse, joten mineraalit ovat eritt&auml;in arvokkaassa asemassa. Taistelualueen voi n&auml;hd&auml; satelliitin avulla, kun ostaa siihen sopivan aseman, jolloin p&auml;&auml;see rakentamaan erilaisia tiedustelutilanteita vihollisen p&auml;&auml;nvaivaksi. Lis&auml;ksi maa-asema kannattaa hankkia, jos rahat alkavat huveta. Vihollista voi my&ouml;s yritt&auml;&auml; huijata ja h&auml;rn&auml;t&auml; mielin m&auml;&auml;rin, jos siihen tuntee tarvetta. Vihollinen tekee my&ouml;s pikahy&ouml;kk&auml;yksi&auml; kaivauksillesi.<br>
				<br>
				Peliss&auml; on monipuoliset konfigurointimahdollisuudet eri laitteistoille. Sit&auml; voi pelata niin modeemilla kuin nollakaapelillakin toista vastaan. Peli on itse asiassa loistava, vaikkakaan ei tue AHIa, mutta ilmankin peli&auml; pelaa. Peli tukee CyberGraphX- ja Picasso96-ymp&auml;rist&ouml;j&auml; (640x470) sek&auml; AGA-tiloja (320x256, 640x256). V&auml;risyvyydenkin voi valita, mutta se on jo p&ouml;yhistely&auml;, koska peliss&auml; ei ole tuhansia v&auml;rej&auml;. Peliss&auml; on huippumusiikit ja &auml;&auml;niefektit, mukaanlukien pelinaikaiset puheet. CD:ll&auml; tulee lis&auml;ksi demoversiot peleist&auml; The Prophet, Goal!, Phoenix Fighters, Blade ja PuttySquad.<br>
				<br>
				Moonbases on kiinnostava, ja teht&auml;vi&auml; voi muokata mieleisekseen. Ainakin minulla on ollut ilo pelata peli&auml; iltamy&ouml;h&auml;&auml;n. Peli aiheuttaa pient&auml; riippuvuutta ja teht&auml;vi&auml;kin voi rakentaa itse.
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekij&auml;:</font></td>
				<td width="50%" bgcolor="#d8ecfd">HomeGrown Software<br><font size="2"><a href="http://www.eclipse.co.uk/homegrown" target="_top">http://www.eclipse.co.uk/homegrown</a></font></td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Julkaisija:</font></td>
				<td width="50%" bgcolor="#d8ecfd">Alive Mediasoft Ltd.<br><font size="2"><a href="http://www.innotts.co.uk/alive-mediasoft" target="_top">http://www.innotts.co.uk/alive-mediasoft</a></font></td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Myyj&auml;:</font></td>
				<td width="50%" bgcolor="#d8ecfd">Gentle Eye Ky, (03) 363 0048<br><font size="2"><a href="http://www.ge.vip.fi" target="_top">http://www.ge.vip.fi</a>, <a href="mailto:ge@vip.fi">ge@vip.fi</a></font></td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
				<td width="50%" bgcolor="#d8ecfd">190 mk (12/99)</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Pelityyppi:</font></td>
				<td width="50%" bgcolor="#d8ecfd">strategia</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
				<td width="50%" bgcolor="#d8ecfd">AGA tai CGX/P96, 1 Mt Fast, CD-ROM, 10 Mt HD</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Suositus:</font></td>
				<td width="50%" bgcolor="#d8ecfd">68030/50 MHz tai nopeampi prosessori</td>
			</tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
					<font size="2"><b>Aminet (pelattavat demoversiot):</b><br>
					<a href="http://ftp.sunet.se/pub/aminet/game/demo/Moonbases_demo.lha">http://ftp.sunet.se/pub/aminet/game/demo/Moonbases_demo.lha</a> (AGA, 680 kt)<br>
					<a href="http://ftp.sunet.se/pub/aminet/game/demo/Moon_RTG_demo.lha">http://ftp.sunet.se/pub/aminet/game/demo/Moon_RTG_demo.lha</a> (RTG, 592 kt)</font>
			</td></tr>
		</table>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

