<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Pelit</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>T h e &nbsp; T u r t l e m i n a t o r</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Tatu Tamminen &lt;<a href="mailto:tx3@iobox.com">tx3@iobox.com</a>&gt;</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				<center><img src="kuvat/turtleminator.jpg" width="200" height="192" alt=""></center>
				<br>
				Aminetiin ilmestyi hauskalta kuulostava peli. Se on Cannon Fodder -tyylinen ja sis&auml;lt&auml;&auml; loistavia ideoita. Kun pelin k&auml;ynnist&auml;&auml;, tulee Monolith Productionsin logo ja Terminator 2 -elokuvasta tuttu kappale alkaa soida. Peliss&auml; on muitakin piloja samaisesta elokuvasta. Alussa kerrotaan pelin juoni v&auml;rikk&auml;iden kuvien saattelemana. Intron j&auml;lkeen tulee valikko, josta voi valita p&auml;&auml;lle tai pois raakuuden, valikko- ja pelinaikaiset musiikit, &auml;&auml;nitehosteet ja puheet.<br>
				<br>
				Peli on jaettu teht&auml;viin, jotka sis&auml;lt&auml;v&auml;t alateht&auml;vi&auml;. Kun isomman teht&auml;v&auml;paketin suorittaa, saa salasanan, jottei tarvitse aina aloittaa alusta. Teht&auml;v&auml;t sijoittuvat eri maastotyyppeihin kuten esim. arktinen. Kentiss&auml; on erilaisia teht&auml;vi&auml;, joita pit&auml;&auml; suorittaa, kuten kilpikonnien munien ker&auml;&auml;minen, vihollisten tappaminen, vihollispes&auml;kkeitten tuhoaminen, pikkulintujen pelastaminen jne.<br>
				<br>
				Jotta peli ei olisi liian helppo, on kenttiin ripoteltu reilusti erilaisia vihollisia, joita tulee eri alueilla erilaisia. Esimerkiksi osa vihollisista tulee pelaaja kohti, toiset heitt&auml;v&auml;t kranaatteja ja toiset taas ampuvat konekiv&auml;&auml;rill&auml;. Koska pelaaja ohjaa kilpikonnaa, on h&auml;nell&auml; sel&auml;ss&auml; luontainen kilpi, jolla voi singota vihollisten ampumat panokset takaisin. Kentist&auml; saa my&ouml;s itselle apureita, joita osaksi tietokone ohjaa. Ne seuraavat omaa pelaajaasi, mutta ampuvat itsen&auml;isesti. Lis&auml;ksi pelaajaa autetaan lentorepulla, kranaateilla, miinoilla, dynamiiteilla, kuolemattomuudella, kulkuneuvoilla jne.<br>
				<br>
				Kaiken lis&auml;ksi peliin on helppo p&auml;&auml;st&auml; sis&auml;lle, koska esim. ensimm&auml;isess&auml; teht&auml;v&auml;ss&auml; ei ole vihollisia ollenkaan, joten pelaaja voi ihan rauhassa tutkia, miten peli&auml; pelataan. Kaiken kukkuraksi peli viel&auml; tukee 3-nappista hiirt&auml;, jolloin vasemmasta napista k&auml;vell&auml;&auml;n, oikeasta ammutaan ja keskimm&auml;isest&auml; heitet&auml;&auml;n kranaatteja. (Jos et kolmenappista hiirt&auml; omista, niin silloin kranaatit heitet&auml;&auml;n painamalla vasenta ja oikeaa hiiren nappia yht&auml;aikaa.) Peliss&auml; on muuten my&ouml;s piilotettu kentt&auml;editori ja huijausmoodi.<br>
				<br>
				Pelin &auml;&auml;net, musiikit ja grafiikat ovat kaikki mainioita. Enp&auml; oikein keksi pelist&auml; mit&auml;&auml;n pahaa sanottavaa. :) Alastair Murray on tehnyt pelej&auml; aiemminkin, ja sen kyll&auml; huomaa! Jos pid&auml;tte pelist&auml;, niin k&auml;yk&auml;&auml; pist&auml;m&auml;ss&auml; tekij&auml;lle s&auml;hk&ouml;postia.
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekij&auml;:</font></td>
				<td width="50%" bgcolor="#d8ecfd">Alastair Murray<br><font size="2"><a href="mailto:alastair.murray@ukgateway.net">alastair.murray@ukgateway.net</a></font></td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Tyyppi:</font></td>
				<td width="50%" bgcolor="#d8ecfd">Cannon Fodder -klooni</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
				<td width="50%" bgcolor="#d8ecfd">1 Mt Chip, 1 Mt Fast</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Suositus:</font></td>
				<td width="50%" bgcolor="#d8ecfd">68030/50 MHz tai nopeampi prosessori</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Yleisarvosana:</font></td>
				<td width="50%" bgcolor="#d8ecfd">91%</td>
			</tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				<font size="2"><b>Aminet:</b><br>
				<a href="http://ftp.sunet.se/pub/aminet/game/shoot/Turtleminator.lha">http://ftp.sunet.se/pub/aminet/game/shoot/Turtleminator.lha</a> (995 kt)<br>
				<br>
				<b>Tekij&auml;n kotisivu:</b><br>
				<a href="http://freespace.virgin.net/malcolm.murray/monolith/index.html" target="_top">http://freespace.virgin.net/malcolm.murray/monolith/index.html</a></font>
			</td></tr>
		</table>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

