<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Pelit</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>W i n g s</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">"Tohtori AivoTurmio"</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				Kuinka moni viel&auml; muistaa Cinemawaren? Kyseinen pelivalmistaja nimitt&auml;in teki kaikkein elokuvamaisimmat pelit, mit&auml; siihen aikaan oli. Yht&auml; l&auml;helle interaktiivista elokuvaa kuin Cinemawaren peleiss&auml; ei noihin aikoihin p&auml;&auml;ssyt. Yh&auml; olisi monilla interaktiivisten elokuvien ja elokuvamaisten pelien tekij&ouml;ill&auml; oppimista Cinemawarelta.<br>
				<br>
				Jostain syyst&auml; Cinemaware katosi suunnilleen 1992 paikkeilla, jolloin koneiden resurssit tehd&auml; heid&auml;n tahtomansa kaltaisia pelej&auml; olisivat vihdoin alkaneet riitt&auml;&auml;. En tied&auml;, oliko kyseess&auml; konkurssi vai saivatko he kenties paremman tarjouksen, mutta joka tapauksessa ainakin Wing Commanderissa aikanaan n&auml;kyi tuttuja nimi&auml;. Ei siis mik&auml;&auml;n ihme, ett&auml; Wing Commander muistuttaa hyvin paljon Wingsi&auml;, sill&auml; monet Wing Commanderin ideoista on suoraan otettu Wingsist&auml;. Eik&auml; Wing Commander ole ainoa, johon ideoita on otettu Cinemawaren peleist&auml;, sill&auml; Cinemaware oli edell&auml;k&auml;vij&auml;.<br>
				<br>
				Joan of Arc aikanaan oli kuin Cinemawaren Defender of The Crownin jatko-osa. It Came From the Desert 1:ss&auml; ja 2:ssa tapeltiin muurahaisia vastaan, jotka meteoriitin s&auml;teily oli muuttanut suunnilleen sata metri&auml; pitkiksi ja monta metri&auml; korkeiksi. Ennen kaikkea elokuvamaisuus ja juoni tekiv&auml;t pelist&auml; hienon. Muurahaisia vastaan ei heti tapeltu, vaan sin&auml; huomasit niiden olemassaolon, ja muu kaupunki armeija mukaanlukien piti saada vakuuttuneeksi niist&auml;. Peliss&auml; riitti ideoita vaikka kuinka: lentokoneella lentely&auml;, j&auml;nishousukisaa autolla, puukkotappelua, sairaalasta karkaamista jne.<br>
				<br>
				Vaikka It Came From The Desertit olivatkin massiivisimmat Cinemawaren pelit, ei Wingsk&auml;&auml;n pieneksi j&auml;&auml;. Peliss&auml; on 243 teht&auml;v&auml;&auml;, joihin kuuluu 3D-taisteluja, kaksintaistelua, koneiden saattoteht&auml;vi&auml;, pallojen ammuntaa ja oman aseman suojaamista, yl&auml;viistosta kuvattua sotilaiden, tarvikkeiden, autokuljetusten ja junien ammuntaa sek&auml; ylh&auml;&auml;lt&auml; kuvattuja pommitusteht&auml;vi&auml;, kuten sukellusveneiden, laivojen, junien, juna-asemien, tehtaiden, autojen, lentokoneiden ja vaikka mink&auml; pommitusta. Lis&auml;ksi pommitusteht&auml;viss&auml; saattoi viel&auml; tulla vastaan viholliskoneita, joita sitten saattoi yritt&auml;&auml; konekiv&auml;&auml;rill&auml; ampua hengilt&auml;. Uskomatonta, kuinka paljon vaihtelevuutta Cinemaware aikoinaan kykeni laittamaan kahdelle levykkeelle, ja kuinka v&auml;h&auml;n nykyajan pelien tekij&auml;t saavat laitettua CD:lle.<br>
				<br>
				Wings siis sijoittuu ensimm&auml;iseen maailmansotaan, ja olet yksi brittien lent&auml;jist&auml;. Jotta p&auml;&auml;set suorittamaan sotateht&auml;vi&auml;, on sinun ensiksi ansaittava itsellesi siivet. Siivet ansaitaan lent&auml;m&auml;ll&auml; yksi helppo harjoitusteht&auml;v&auml;, joka on vaihtoehtoisesti pallon alasampuminen, talon pommittaminen tai parin laatikon ampuminen. Kun selvi&auml;t siit&auml; kunnialla, p&auml;&auml;set itse sotaan. Koska tulet paikalle niin sopivasti, saat alkaa pit&auml;&auml; asemasi p&auml;iv&auml;kirjaa.<br>
				<br>
				T&auml;m&auml; p&auml;iv&auml;kirja n&auml;kyy aina jokaisen teht&auml;v&auml;n v&auml;liss&auml; ja esitt&auml;&auml;, kuinka olet taas kirjoittanut siihen uutta teksti&auml;. Kyseist&auml; teksti&auml; on arviolta noin 100 pokkarikirjan sivun verran, ja teksti on pelitekstiksi koko ajan todella korkealaatuista ja sis&auml;lt&auml;&auml; paljon historiallista faktatietoa. P&auml;iv&auml;kirjaa kannattaa lukea, sill&auml; se nostaa el&auml;ytymisen huomattavasti paremmalle tasolle, koska kirjassa on varsin odottamattomiakin asioita, kuten kenraali Farrahin, paikan johtajan avioero. V&auml;lill&auml; kirjaan on liitetty my&ouml;s valokuvia, jotka rikastuttavat kirjan sis&auml;lt&ouml;&auml; entisest&auml;&auml;nkin. Pilotti (sin&auml; siis) my&ouml;s ajattelee aina ennen teht&auml;v&auml;&auml; jotakin uutta, kuten alkaa my&ouml;hemmin pohtia sodan mielett&ouml;myytt&auml;.<br>
				<br>
				Sen lis&auml;ksi, ett&auml; t&auml;m&auml; on oivallinen sotapeli, en ainakaan muista n&auml;hneeni t&auml;h&auml;n menness&auml; mit&auml;&auml;n muuta sodanvastaista peli&auml;. Sodanvastaisuus k&auml;y peliss&auml; loppua kohti aina vain ilmeisemm&auml;ksi, loppudemossakin oli hyv&auml; idea, mutta se menee varmasti suurimmalta osalta ohitse. Aina kun kuolet, tulet uutena lent&auml;j&auml;n&auml; takaisin, ja edellisen lent&auml;j&auml;n nimi tulee marmoritauluun. Kun sota sitten vihdoin loppuu eli olet p&auml;&auml;ssyt pelin l&auml;vitse, tuota kyseist&auml; muistolaattaa n&auml;ytet&auml;&auml;n voitonjuhlinnan lomassa. Sin&auml;ns&auml; hyv&auml; idea, jokainen v&auml;h&auml;n aikaa selvinnyt oma lent&auml;j&auml; kun totta kai tuntuu kuin kaverilta, joten sodan loputtua tuntuu, ett&auml; kaverit ovat kuolleet. Kun itse kuolee, on silloin my&ouml;s p&auml;iv&auml;kirjan kirjoittaja kuollut, joten kun tulet uutena lent&auml;j&auml;n&auml; paikalle, p&auml;&auml;setkin juuri sopivasti t&auml;ytt&auml;m&auml;&auml;n kirjoittajan paikan. Hyv&auml; idea sekin.<br>
				<br>
				Ongelma tulee siin&auml;, ett&auml; koneista hieman tiet&auml;v&auml; kykenee kiert&auml;m&auml;&auml;n kuoleman, jolloin ei muistolaattaan lent&auml;jien nimi&auml; kerry ja idean tehokkuus on poissa. Kuoleman pystyy kiert&auml;m&auml;&auml;n, kun resetoi koneen sen sijaan ett&auml; k&auml;ytt&auml;isi exit-toimintoa. Jos poistuu pelist&auml; exitin avulla, niin peli tallentaa automaattisesti senhetkisen tilanteen, eli kuollut j&auml;&auml; kuolleeksi. T&auml;m&auml;n voi tosin v&auml;ltt&auml;&auml; my&ouml;s ottamalla kopion Pilot.dat-tiedostosta.<br>
				<br>
				Itse pelin grafiikat ovat yh&auml; todella hyv&auml;t 3D-osuutta lukuunottamatta. Itse asiassa, jos 3D-osuuden tekisi uusiksi, niin t&auml;m&auml;n pelin voisi ihan hyvin uudelleen julkaista halpapelin&auml;. Harmi ettei Cinemaware ole en&auml;&auml; kuvioissa mukana, sill&auml; t&auml;st&auml; pelist&auml; todella kannattaisi tehd&auml; paranneltu versio. 3D-osuudet vaikuttavat 8-v&auml;risilt&auml; - joka tapauksessa hyvin v&auml;h&auml;n v&auml;rej&auml; ja hyvin huonoa koodia nykypeleihin verrattuna. Itse asiassa 3D-engine t&ouml;kki aika pahastikin, vaikka pelasin 030-koneella. 3D-osuuksissa on hieno idea se, ett&auml; oma lentokone on piirretty ja 3D menee piirroksen takana.<br>
				<br>
				Kun koneeseen osuu, tulee esimerkiksi siipiin reiki&auml;, jotka heikent&auml;v&auml;t ohjausta. Jos kone saa pahoja osumia, niin kone osumakohdasta riippuen reagoi esimerkiksi l&auml;htem&auml;ll&auml; sy&ouml;ksykierteeseen, jossa sitten voi yh&auml; yritt&auml;&auml; selvit&auml; ehj&auml;n&auml; alas. Erinomaista peliss&auml; on my&ouml;s ett&auml; siihen on lis&auml;tty ep&auml;todenn&auml;k&ouml;isi&auml; tapahtumia, kuten moottoriin osuminen kertalaukauksella, jolloin kone putoaa heti alas, tai lent&auml;j&auml;&auml;n osuminen, jolloin lent&auml;j&auml;&auml; ei siis voi en&auml;&auml; pelastaa.<br>
				<br>
				My&ouml;s hieman useammin tapahtuvia juttuja on paljon. Mik&auml;li maassa on ilmatorjuntaa, voi my&ouml;s ilmatorjunnan k&auml;yd&auml; ampumassa, mik&auml; on todella mukavaa joissain teht&auml;viss&auml;. Jos viholliskone p&auml;&auml;see taaksesi hyviin asemiin, siirtyy kuvakulma viholliskoneen taakse, mink&auml; j&auml;lkeen sinun pit&auml;isi saada vihollinen kannoiltasi. T&auml;llaisessa tilanteessa tulee esiin yksi pelin ep&auml;kohdista, joita peliss&auml; on muutamia mutta jotka pelin vanhuuden takia annetaan anteeksi. Nimitt&auml;in jos olet itse toisen vihollisen kimpussa samanaikaisesti, niin kone ik&auml;&auml;nkuin katoaa. Ainoastaan sin&auml; ja takanasi oleva vihollinen n&auml;kyv&auml;t, kaikki muut ovat kadonneet maailmasta.<br>
 				<br>
				On hienoa, ettei teht&auml;vien vaikeusaste kasva suorassa suhteessa teht&auml;v&auml;n numeroon, vaan v&auml;lill&auml; saattaa tulla todella helppojakin teht&auml;vi&auml;. Eiv&auml;th&auml;n oikeassakaan sodassa sodan loppua kohti automaattisesti teht&auml;v&auml;t vaikeudu. Teht&auml;vi&auml; on monenlaisia, ja aina v&auml;lill&auml; tulee uudenlaisia. Esimerkiksi jossain teht&auml;v&auml;n 40 paikkeilla alkaa jo olla hieman tymp&auml;&auml;ntynyt perinteisiin teht&auml;viin, ja sitten p&auml;&auml;seekin pommittamaan sukellusveneit&auml;. Parikymment&auml; teht&auml;v&auml;&auml; kun kuluu taas lis&auml;&auml;, p&auml;&auml;see ampumaan sotilaita juoksuhaudoissa jne. Teht&auml;v&auml;t ovat aina suht lyhyit&auml; ja toiminnant&auml;yteisi&auml;. Toisin kuin perinteisiss&auml; lentosimulaattoreissa, ei Wingsiss&auml; tarvitse lent&auml;&auml; puolta tuntia p&auml;&auml;st&auml;kseen toiminnan makuun, vaan peliss&auml; aloitetaan aina suoraan toiminnasta, joskus jopa vihollinen valmiiksi takana.<br>
				<br>
				Jos oma lent&auml;j&auml; kuolee jossain teht&auml;v&auml;n 50 j&auml;lkeen, on uudella lent&auml;j&auml;ll&auml; yht&auml; tuskaa lent&auml;&auml;, lent&auml;j&auml;t kun kehittyv&auml;t hiljalleen ampumatarkkuudessa, lentotaidossa, mekaanikkona ja koneen kest&auml;vyydess&auml;. Esimerkiksi loppupuolella olevia yl&auml;viistosta kuvattuja ampumateht&auml;vi&auml; on todella vaikea kest&auml;&auml; loppuun asti edes parhaalla mahdollisella koneella, jolloin aloittelevan lent&auml;j&auml;n kone putoaa heti alussa.<br>
				<br>
				Wingsiss&auml; on paljon kaikkia pikkujuttuja, kuten Top 10 -lent&auml;j&auml;lista, jossa vilahtelee ihan oikeitakin ensimm&auml;isen maailmansodan lent&auml;ji&auml; oikeilla koneiden pudotusm&auml;&auml;rill&auml;&auml;n. Esimerkiksi Punainen Paroni l&ouml;ytyy listalta, ja my&ouml;s h&auml;nen kuolinp&auml;iv&auml;ns&auml; ja kuolintapansa on oikea. My&ouml;s tutka on Wingsiss&auml; erinomaisesti keksitty. Lent&auml;j&auml;n p&auml;&auml; nimitt&auml;in aina katsoo siihen suuntaan, miss&auml; l&auml;hin vihollinen on. Vihollisten teko&auml;lykin on ihan kohtuullinen, sill&auml; ne loppupuolella osaavat laittaa yhden koneen sy&ouml;tiksi, jotta muut p&auml;&auml;sisiv&auml;t sitten hy&ouml;kk&auml;&auml;m&auml;&auml;n sivulta tai takaasi. Hienoa on my&ouml;s se, ett&auml; 3D-teht&auml;viss&auml; l&auml;hes poikkeuksetta on aina sin&auml; ja pari muuta. Loppupuolella on rymin&auml; parhaimmillaan, muistaakseni 8 omaa vastaan 10 vihollista. My&ouml;s sin&auml; yksin seitsem&auml;&auml; vihollista vastaan on yksi teht&auml;v&auml;.<br>
				<br>
				Pieni&auml; k&ouml;mm&auml;hdyksi&auml; Wingsiss&auml; kyll&auml; on. Yhden teht&auml;v&auml;n voittaminen on mahdotonta, koska pit&auml;isi suojella omaa lentokentt&auml;&auml;, pommikoneita on kaksi ja aikaa alasampumiseen arviolta 3-5 sekuntia. Toisen pystyt karkottamaan, mutta koska omasi eiv&auml;t tajua hy&ouml;k&auml;t&auml; toisen kimppuun, on toisen karkottaminen kent&auml;n ylt&auml; ajoissa mahdotonta. Mutta toisaalta - ei oikeassakaan sodassa ole aina mahdollista voittaa. 3D-teht&auml;viss&auml;, joissa olet yksin, saattaa lopuksi tulla "Lone survivor returns...". Periaatteessa kyll&auml; t&auml;ysin oikein, mutta tuon p&auml;tk&auml;n tarkoituksena on tulla silloin, kun kaikki muut kaverisi ammuttiin alas.<br>
				<br>
				Harmillinen puutos peliss&auml; on sodan interaktiivisuuden puuttuminen, sill&auml; vaikka olet Top 1 alasammutuissa koneissa kaksikin kertaa isommalla m&auml;&auml;r&auml;ll&auml; kuin vaikkapa Punainen Paroni, niin silti sin&auml; p&auml;iv&auml;kirjassa ihmettelet, miten Paroni on voinut ampua niin monta konetta alas ja ettei toista yht&auml; hyv&auml;&auml; lent&auml;j&auml;&auml; olekaan jne. Toisaalta kuvaisin kyll&auml; peli&auml; pikemminkin interaktiiviseksi elokuvaksi kuin interaktiiviseksi peliksi.<br>
				<br>
				Musiikkeja en valitettavasti p&auml;&auml;ssyt en&auml;&auml; kuulemaan, sill&auml; musiikit sis&auml;lt&auml;v&auml; tiedosto joutui read/write errorin uhriksi. Peli kyll&auml; toimi muuten, mutta ilman musiikkeja. AGA-tilassa Wings joko toimi tai ei. Tarkoitan sit&auml;, ett&auml; joskus se toimi AGA-tilassa montakin peli&auml; per&auml;kk&auml;in ja joskus taas ei oikein ollenkaan, en tied&auml; mik&auml; sen aiheuttaa, sill&auml; samalla lailla sen kuitenkin aina latasin. Valitsemalla Amigan k&auml;ynnistysvalikosta chip setiksi "Original" Wings sitten toimikin moitteetta.<br>
				<br>
				3D-osuuksien rumuuden takia en usko, ett&auml; Playstation-sukupolvi pelin &auml;&auml;ress&auml; viihtyy, mutta retropeleist&auml; pit&auml;v&auml;t tai A500-pelej&auml; siet&auml;v&auml;t kyll&auml; saavat t&auml;st&auml; viel&auml; paljonkin irti. Vaikea t&auml;t&auml; mist&auml;&auml;n on en&auml;&auml; ainakaan alkuper&auml;isen&auml; l&ouml;yt&auml;&auml;, mutta jos l&ouml;yd&auml;t, niin kyll&auml; t&auml;m&auml; ainakin 50 markan arvoinen on. Copyright peliss&auml; on vuodelta 1990, joten se huomioon ottaen t&auml;m&auml; on todella hieno peli, joka ei harmi kyll&auml; ole saanut ansaitsemaansa mainetta ja kunnioitusta. (&Auml;l&auml; kuitenkaan sekota t&auml;t&auml; Wings of Furyyn, joka taisi tulla vuotta t&auml;t&auml; my&ouml;hemmin - sekin on kyll&auml; my&ouml;s testaamisen arvoinen peli.)<br>
				<br>
				Jos jonkin unohdetun pelifirman pelit ansaitsisivat tulla uudelleen julkaistuiksi, se olisi Cinemawaren. He olisivat todella ansainneet sen.
			</td></tr>
		</table>
		</p>
		<p>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

