<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Pelit</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>W i p e o u t &nbsp; 2 0 9 7</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Markku "Breed" Heikkinen &lt;<a href="mailto:marhete5@hotmail.com">marhete5@hotmail.com</a>&gt;</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				Melkein vuoden p&auml;iv&auml;t ostamani Blizzard PPC ja BVision saivat hyrr&auml;t&auml; melkolailla tyhj&auml;k&auml;ynnill&auml;, vain muutamat PD-ohjelmat tukivat t&auml;t&auml; uutta tekniikkaa. Aluksi oli my&ouml;s vaikeuksia saada konetta edes toimimaan kunnolla. Vihdoinkin kun ensimm&auml;inen oikea kaupallinen PPC-peli, Wipeout 2097 tuli markkinoille, peli ei ainakaan omassa koneessani toiminut ensi yritt&auml;m&auml;ll&auml;.<br>
				<br>
				Peli tukee kaikkia uusimpia standardeja, jotka on suunniteltu PPC-korteille ja grafiikkakorteille, kuten WarpUP, Warp3D ja CyberGraphX, joten t&auml;t&auml; peli&auml; pystyin pit&auml;m&auml;&auml;n koetinkiven&auml; Amigalleni. Jos t&auml;m&auml; peli toimisi kunnolla, todenn&auml;k&ouml;isesti tulevatkin pelit toimisivat, ainakin WarpUPista on tulossa melkeinp&auml; standardi "rajapinta".<br>
				<br>
				Omalla kohdallani ongelmaksi muodostui CyberGraphX v3. Pelin kyll&auml; pit&auml;isi toimia t&auml;ll&auml; vanhemmallakin ajurilla, mutta jotain oli kuitenkin pieless&auml;, ja koska olin jo aikaisemminkin suunnitellut CGX4:n hankkimista, p&auml;&auml;tin tehd&auml; sen mieluummin kuin alkaa vanhan version kanssa tappelemaan, onhan CGX4 paljon kehittyneempikin. P&auml;ivitetty&auml;ni CGX4:n viel&auml; uusimpaan versioon, joka tekee siit&auml; OS 3.5 -yhteensopivan, l&auml;hti peli vihdoinkin toimimaan, ja kaikki "not enough video memory" -ilmoitukset loppuivat.<br>
				<br>
				Ent&auml;p&auml; itse peli? Wipeout on suoraviivainen ajopeli, erikoista on se, ett&auml; pelimaailma lienee jossain kaukana tulevaisuudessa. Toimit er&auml;&auml;nlaisen avaruusaluksen ohjaajana ja kilpailet muita vastaan mit&auml; erikoisimmilla radoilla. Mahdollisuutenasi on my&ouml;s saada ohjuksia yms., joilla voit vaikeuttaa kilpailijoittesi kisasuoritusta eli k&auml;yt&auml;nn&ouml;ss&auml; eliminoida ne kokonaan pois haitolta.<br>
				<br>
				Asennustavan voi valita pienimm&auml;st&auml; mahdollisesta aina t&auml;ysasennukseen eli noin 70 Mt. Romppu sis&auml;lt&auml;&auml; my&ouml;s WarpUP- ja Warp3D-ajurit, joten nekin saa mukavasti sielt&auml; asennettua, ellei niit&auml; viel&auml; ole. Vaihtoehtoina on joko pelaaminen WB:n ikkunassa tai omalla ruudulla. Peli rullaa mukavasti 16-bittisen&auml;, 640x480 osoittautui parhaimmaksi, 800x600 ruudulla on havaittavissa ainakin minulla pienoista nykimist&auml;.<br>
				<br>
				Amigan nopeuden mukaan voit valita sopivat asetukset, ja CD sis&auml;lt&auml;&auml; useita &auml;&auml;niraitoja, jotka mukavasti vauhdittavat peli&auml;. &Auml;&auml;niefektit ovat my&ouml;s muuten hyv&auml;t, paitsi joissain tilanteissa taustalta kuuluu ik&auml;vi&auml; sivu&auml;&auml;ni&auml;, vika saattaa olla AHI:n asetuksissa? Peli tukee my&ouml;s &auml;&auml;nikortteja, joten &auml;&auml;nimaailma olisi mahdollista saada viel&auml; paremmaksi, &auml;&auml;nikortittomana en kuitenkaan p&auml;&auml;ssyt sit&auml; testaamaan. Pelattavuuden kannalta peli ei ainakaan moitteita saa, vaihtoehtoina on joko hiiri/n&auml;pp&auml;imist&ouml;, n&auml;pp&auml;imist&ouml;/joystick tai n&auml;pp&auml;imist&ouml;, eli eik&ouml;h&auml;n sielt&auml; mieleisens&auml; l&ouml;yd&auml;.<br>
				<br>
				Kaiken kaikkiaan Wipeout 2097 on komea peli, tekniselt&auml; tasoltaan jotain aivan uutta Amigalla. Vihdoinkin peli, joka saa koko konehuoneen reservin k&auml;ytt&ouml;&ouml;n! Ainoa kysymysmerkki voi olla pelin kiinnostavuus ajan my&ouml;t&auml;, ratoja on vain kahdeksan ja muutaman aluksen valikoima, kaksinpeli olisi ollut mukava lis&auml;piriste pelille.<br>
				<br>
				Peli voitti juuri Amiga Flamen vuoden 1999 Amiga-peli -&auml;&auml;nestyksen, joten eik&ouml;h&auml;n t&auml;m&auml;kin kerro jotain pelin saamasta suosiosta. Jos siis omistat PPC:n ja grafiikkakortin, voin suositella peli&auml; l&auml;mpim&auml;sti, Amigasi p&auml;&auml;see pelien suhteen ihan uudelle tasolle.
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekij&auml;:</font></td>
				<td width="50%" bgcolor="#d8ecfd">Digital Images</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Julkaisija:</font></td>
				<td width="50%" bgcolor="#d8ecfd">Blittersoft, <a href="http://www.blittersoft.com" target="_top">http://www.blittersoft.com</a></td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
				<td width="50%" bgcolor="#d8ecfd">PPC, 3D-grafiikkakortti, GyberGraphX tai Picasso96, CD-ROM, WB 3.0, 1 Mt kiintolevytilaa, 24 Mt Fast</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
				<td width="50%" bgcolor="#d8ecfd">A1200, PPC 603e/200 MHz, 64 Mt Fast, BVision, OS 3.5</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Grafiikka:</font></td>
				<td width="50%" bgcolor="#d8ecfd">90%</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">&Auml;&auml;net:</font></td>
				<td width="50%" bgcolor="#d8ecfd">80%</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Pelattavuus:</font></td>
				<td width="50%" bgcolor="#d8ecfd">90%</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Yleisarvosana:</font></td>
				<td width="50%" bgcolor="#d8ecfd">90%</td>
			</tr>
		</table>
		</p>
		<p>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

