<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Zwischenruf.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. AMIGA unterst&uuml;tzt Open Content Platform Association (OCPA)</H2>
<P><B>AMIGA, Inc. (<A HREF="http://www.amiga.com" TARGET="_top">http://www.amiga.com</A>) informiert:</B></P>
<P><B>&raquo;Zur sofortigen Ver&ouml;ffentlichung</B></P>
<P>
Amiga schlie&szlig;t sich Tao in seinen Pl&auml;nen an, die Open Content Platform
Association ([ Vereinigung der offenen Inhalte] OCPA) zu unterst&uuml;tzen
</P>
<P><B>Snolqualmie, WA - 13.Juli 2001</B></P>
<P>
Amiga gab heute bekannt, dass sie sich Tao in deren Pl&auml;nen anschlie&szlig;en, die
Open Content Platform Association ([ Vereinigung der offenen Inhalte] OCPA)
zu unterst&uuml;tzen.
</P>
<P>
Die Tao Gruppe, unter anderem mit Sharp, JVC und Kyocera, startete heute
die OCPA, um f&uuml;r eine Kreation, einer flexiblen und offenen Umgebung; die
Hardware-Planern und Programmentwicklern nutzt; zu werben.
</P>
<P>
Die Amiga Entwickler-Gemeinde ist die Gr&ouml;&szlig;te und hat die meiste Erfahrung
in der Entwicklung von Applikationen, gezielt auf die intent(r) Plattform
von Tao. Amiga-Entwickler sind in der Industrie bekannt daf&uuml;r, dass sie
aufregende Multimedia-Applikationen entstehen lassen. Amiga arbeitet mit
einigen Tao-Partnern zusammen, um Spiele und produktive Anwendungen f&uuml;r
die intent(r)-Plattform zu liefern.
</P>
<P>
Bill McEwen, der Pr&auml;sident und CEO von Amiga Inc. sagte: &quot;Die
Standardisierung der intent(r)-Plattform wird der Amiga
Entwickler-Gemeinschaft helfen, eine Unmenge von Hardware-Ger&auml;ten
anzusprechen&quot;, und &quot;Unsere Erfahrung mit intent(r) hat gezeigt, dass es eine
exzellente Plattform f&uuml;r multimediale Applikationen ist. Wir haben mehr als
18 Monate Erfahrungen in der Erstellung von Applikationen, die auf intent(r)
laufen, und wir freuen uns, mit OCPA zusammenarbeiten zu k&ouml;nnen, um diese
Erfahrungen mit Ihnen zu teilen.&quot;
</P>
<P>
Fred Charig, Vorsitzender der Tao Group: &quot;Amiga war bisher ein
hervorragender Partner, mit einer weltweiten Entwickler-Gemeinde, die von
dieser Initiative profitieren wird&quot;; &quot;Amigas Eingaben werden die aktiven
Mitglieder der OCPA bereichern und wir begr&uuml;&szlig;en Ihre Beteiligung.&quot;
</P>
<P>
Amiga offeriert Entwicklern einige Programme und Produkte, die helfen,
Applikationen zu schaffen. Das Amiga SDK (erh&auml;ltlich unter
<A HREF="http://www.amiga.com/" TARGET="_top">http://www.amiga.com/</A>) bietet eine Entwickler-Umgebung und Tools f&uuml;r
Entwickler. Das Amiga-Support-Netzwerk bietet ein Forum zum Diskutieren,
Mailinglisten und andere Infrastruktur f&uuml;r Kommunikation untereinander.
</P>
<P>
Amiga hat au&szlig;erdem eine Vertriebsvereinbarung mit Sharp Corporation
unterzeichnet, die es erlaubt, dass Entwicklungen von Amiga-Entwicklern in
Sharp Space Town angeboten werden. Sharp Space Town versorgt den Sharp
Zaurus und andere Sharp-PDA mit Software. Amiga bietet dar&uuml;ber hinaus auch
noch andere weltweite Vertriebskan&auml;le.&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Thomas Nosutta vom ACBB
(<A HREF="http://acbb.de" TARGET="_top">http://acbb.de</A>) und wurde f&uuml;r unseren Partner amiga-news.de durchgef&uuml;hrt.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Zwischenruf.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
