<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses8.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>7. Neuigkeiten von der Amiga Arena</H2>
<P><B>Amiga Arena (<A HREF="http://online-club.de/~ARENA/" TARGET="_top">http://online-club.de/~ARENA/</A>) informiert:</B></P>
<P>
<H3>&raquo;Amiga Arena News<BR>
(06.07.2001)</H3><BR>
</P>
<P><B>Amiga Arena Vollversion!</B></P>
<P>
In Zusammenarbeit mit Christian Steiner
erm&ouml;glicht die Amiga Arena die Freigabe von
&quot;Sharks Multi Version 1.5 Final&quot;!
</P>
<P>
SHARKS! ist ein Geschicklichkeitsspiel, das sich unter Wasser abspielt.
Unser mutiger Taucher ist unterwegs, um den Meeresgrund nach Sch&auml;tzen
abzusuchen.
</P>
<P>
Das Gebiet in dem er sich befindet ist allerding von Haien &quot;verseucht&quot;....
also : VORSICHT !!!
Bergen Sie so viele Sch&auml;tze wie m&ouml;glich und h&uuml;ten Sie sich vor den Haien!
Aufgrund das zu wenig Feedback der User kam wurde die weiter Entwicklung
eingestellt!
</P>
<P><B>Amiga Arena &quot;File Cutter&quot; Code!</B></P>
<P>
Stefan Berge hat der Amiga Arena den Code von File Cutter
zur verf&uuml;gung gestellt!
File Cutter dient zum zerteilen von Dateien.
</P>
<P>
Man kann damit z.B. eine 8MB gro&szlig;e Datei (Animation, LHA-Archiev) in
mehrere so gro&szlig;e Dateiteile zerschneiden, da&szlig; man diese Datei
bequem auf mehrern Disketten transportieren kann.
</P>
<P>
Auf dem anderen Rechner werden dann diese Dateiteile wieder zu der
kompletten Datei zusammengesetzt.
</P>
<P><B>Amiga Arena Vollversion</B></P>
<P><B>Beneath a Steel Sky:</B></P>
<P>
Mit der Gehnemigung von Revolution Software Ltd.
(Dank an Tony W.) befindet sich auf der Leser CD
der Amiga Future 31 die Orginal Verkaufsversion des
wohl bis heute besten Action Adventure f&uuml;r den Amiga.
Ganz Besonderen Dank an:
J&uuml;rgen B. der mir das Archiv zur verf&uuml;gung gestellt hat.
</P>
<P>
Revolution Software:<BR>
<A HREF="http://www.revolution.co.uk" TARGET="_top">http://www.revolution.co.uk</A><BR>
</P>
<P>
Back to The Roots:<BR>
<A HREF="http://www.back2roots.org/" TARGET="_top">http://www.back2roots.org/</A><BR>
</P>
<P>
Amiga Future:<BR>
<A HREF="http://www.amigafuture.de" TARGET="_top">http://www.amigafuture.de</A>&laquo;<BR>
</P>
<P><B>&raquo;Amiga Arena Vollversion!</B></P>
<P>
Mit der Genehmigung von Mark Ford
erm&ouml;glicht die Amiga Arena die Freigabe von &quot;The Prophet&quot;!
Bei &quot;The Prophet&quot; handelt es sich um einen Rollenspiel
das 1999 von &quot;Alive Media Soft&quot; ver&ouml;ffentlicht wurde!
Leider gab es hier so einige Probleme und somit
waren &uuml;ber ein Jahr an Entwicklerzeit umsonst f&uuml;r Mark F.
 &quot;Amiga Format&quot; bewertete &quot;The Prophet&quot; damals mit 81%.
The Prophet liegt nur in Englischer Sprache vor!
</P>
<P>
einige Features:
</P>
<UL>
<LI> &uuml;ber 200.000 Locations
</LI>
<BR><LI> kein Linearer Spielablauf
</LI>
<BR><LI> HD Version
</LI>
<BR><LI> unterschiedliche Feinde
</LI>
</UL>
<P><B>Amiga Arena Status Report!</B></P>
<P>
Die aktivit&auml;ten lassen zur Zeit etwas nach bedingt durch die Urlaubszeit
und der ungewissen Amiga Zukunft!
In Arbeit ist einiges doch m&ouml;chte ich Euch nicht mit Vorank&uuml;ndigungen
vertr&ouml;sten!
(Das machen leider andere schon zu gen&uuml;ge!) :-(
Sonderpreise f&uuml;r Shareware Software zu erhalten wird auch immer schwerer,
da es kaum noch einen Sharewaremarkt gibt!
F&uuml;r Ideen und Tips bin ich immer Dankbar!
Ebenso suche Ich noch immer jemanden der Texte und Interviews &uuml;bersetzen
w&uuml;rde!&laquo;
</P>
<P>
<H3>&raquo;Amiga Arena News<BR>
(18.07.2001)</H3><BR>
</P>
<P><B>Amiga Arena - Blade Kurzanleitung / Tips!</B></P>
<P>
Der Entwickler Mark Sheeky hat der Amiga Arena eine Kurzanleitung mit Tips
zu dem Spiel &quot;Blade&quot; erstellt! (Bereich Vollversionen)
(Besonderen Dank an Mark S. und Christian B. f&uuml;r die &Uuml;bersetzng!)
</P>
<P><B>Amiga Arena Interview Aktion!</B></P>
<P>
Die Amiga Arena hat Richard Fhager dem Entwickler von
BabeAnoid (Breakout Clone) zum aktuellen stand der Entwicklung
befragt! (Bereich &quot;Aktionen&quot;)&laquo;
</P>
<P>
<H3>&raquo;Amiga Arena News<BR>
(21.07.2001)</H3><BR>
</P>
<P><B>Amiga Arena Vollversion!</B></P>
<P>
In Zusammenarbeit mit Denis Unger
erm&ouml;glicht die Amiga Arena die Freigabe von &quot;Foreign Language Master V2.3&quot;!
FLM ist ein Fremdsprachenprogramm, welches als Woerterbuch,
zum Textuebersetzen und zum Lernen von Vokabeln genutzt werden kann.
FLM beinhaltet einige EnglischDeutsch-Woerterbuecher
(insgesammt ca. 8MB mit ca. 175000 Eintraegen).
Denis Unger entwickelt &quot;FLM&quot; weiter!
F&uuml;r eine neue Version von &quot;FLM&quot; w&uuml;rde sich Denis Unger
&uuml;ber konkrete Verbesserungsvorschl&auml;ge und Feedback freuen!
Weitere Infos und Datenb&auml;nke f&uuml;r &quot;FLM&quot; finden Sie unter:
Homepage: <A HREF="http://www.flmdic.de" TARGET="_top">http://www.flmdic.de</A>
Kontakt: <A HREF="mailto:flmdic@gmx.de">flmdic@gmx.de</A>
</P>
<P><B>Amiga Arena - Kommentar!</B></P>
<P>
Ich benutze &quot;FLM&quot; selber fast t&auml;glich und m&ouml;chte es nicht mehr missen!
Mein Aufruf an Euch - mit einer kurzen Mail an Denis U. w&uuml;rde jeder dazu
beitragen das dieses Tool weiterhin verbessert und gepflegt wird!&laquo;
</P>
<P>
<H3>&raquo;Amiga Arena News<BR>
(29.07.2001)</H3><BR>
</P>
<P><B>Amiga Arena - Sonderpreis Aktion I !</B></P>
<P>
In Zusammenarbeit mit Max Larsson erm&ouml;glicht die Amiga Arena
einen Sonderpreis f&uuml;r Digital Universe CD Rom Version!
Digital Universe ist eine Astronomie Software f&uuml;r Amateur und Profi
Astronomen!
Weitere Informationen finden Sie unter <A HREF="http://www.syz.com/DU/amigacd.html" TARGET="_top">http://www.syz.com/DU/amigacd.html</A>
Amiga Arena Besucher k&ouml;nnen bis zum 31.08.2001 die Digital Universe CD Rom
bei  Max Larsson (Vertrieb f&uuml;r Deutschland) zum Sonderpreis f&uuml;r 99,- DM
erwerben!
(Urspr&uuml;nglicher Preis 289,- DM)
Die Entwickler von Digital Universe haben mir mitgeteilt das die
Entwicklung
nicht eingestellt wurde!
Eine Umfrage zu Digital Universe finden Sie auf der Homepage!
</P>
<P><B>Amiga Arena - Interview Aktion!</B></P>
<P>
Ein ausf&uuml;hrliches Interview mit Frank Reibold dem Entwickler
von Micropaint und Microbase sind Online (Deutsch / Englisch)
Besonderen Dank an Christian B. f&uuml;r die &Uuml;bersetzng!
</P>
<P><B>Amiga Arena - Sonderpreis Aktion II !</B></P>
<P>
In Zusammenarbeit mit Frank Reibold erm&ouml;glicht die Amiga Arena
einen Sonderpreis f&uuml;r die Programme MicroPaint und Microbase.
</P>
<P>
Die wichtigsten Eigenschaften von MicroPaint sind seine Funktionen
(Auszug):
</P>
<P>
zur Bildverarbeitung und die Kompatibilit&auml;t zu Un*x / Linux.
</P>
<UL>
<LI> bis zu 256 Farben auf Rechnern mit AA Chipset
</LI>
<BR><LI> Unterst&uuml;tzung von Intellifonts, Schriftstilen, Drawmodes, Colour Fonts
</LI>
<BR><LI> Unterst&uuml;tzung aller Grafikmodi, die Ihr Computer unterst&uuml;tzt
</LI>
<BR><LI> flexible Spray-Funktion
</LI>
<BR><LI> Multi-Spray: mit Zufallsfarben spr&uuml;hen
</LI>
<BR><LI> Grafiken invertieren und umf&auml;rben
</LI>
<BR><LI> Farben austauschen
</LI>
<BR><LI> ARexx-Port
</LI>
<BR><LI> listet die zuletzt benutzten Dateien im Projekt-Men&uuml; auf
</LI>
</UL>
<P><B>MicroBase bietet Ihnen z. Zt. folgende M&ouml;glichkeiten (Auszug):</B></P>
<UL>
<LI> Import und Export von ASCII-Dateien in den Formaten SuperBase
  Professional 4, BECKERtext III, Documentum 2, ProWrite, TransWrite,
  Personal Write; Anpassung an andere Formate ist m&ouml;glich
</LI>
<BR><LI> Flexible Funktionen zum Suchen und Ersetzen von Feldinhalten, z. B.
  Multiplikation von Feldinhalten mit einer Konstanten
</LI>
<BR><LI> Feldnamen k&ouml;nnen 20 Zeichen lang sein und d&uuml;rfen Leerzeichen enthalten
</LI>
<BR><LI> direkter Zugriff &uuml;ber Datensatznummern
</LI>
<BR><LI> Filterfunktion
</LI>
</UL>
<P><B>Weitere Informationen finden Sie unter <A HREF="http://www.reibold-online.de" TARGET="_top">http://www.reibold-online.de</A></B></P>
<P><B>Amiga Arena - Sonderpreis Aktion III</B></P>
<P><B>Folgende Sonderpreis Aktionen laufen aus!</B></P>
<UL>
<LI> LangTool bis zum 31.07.01
</LI>
<BR><LI> SoundFX bis zum 01.08.01
</LI>
<BR><LI> XadMaster Lib bis zum 14.08.01
</LI>
<BR><LI> GeoWorld bis zum 15.08.01
</LI>
</UL>
<P><B>Amiga Arena Vollversion</B></P>
<P>
Neben weiteren Vollversionen
befindet sich mit der Gehnehmigung von Per B. (Marble Eys)
der Ego Shooter &quot;Genetic Species&quot; auf der Leser CD
der Amiga Future Ausgabe 32!
Weitere Infos zur Ausgabe finden Sie unter www.amigafuture.de!&laquo;
</P>
<P>
<H3>&raquo;Amiga Arena News<BR>
(31.07.2001)</H3><BR>
</P>
<P><B>Amiga Arena - Interview Aktion!</B></P>
<P>
Ein sehr ausf&uuml;hrliches und Interessantes Interview mit R&uuml;diger Hanke dem
Entwickler von Excult und verschiedenen Filtern z.b. f&uuml;r PageStream etc.
ist Online!
(Deutsch / Englisch).
</P>
<P><B>Besonderen Dank an Christian B. f&uuml;r die &Uuml;bersetzung!&laquo;</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses8.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
