<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses7.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>6. StormC wird offizielles Entwicklungssystem (und weitere News)</H2>
<P><B>Haage &amp; Partner (<A HREF="http://www.haage-partner.com" TARGET="_top">http://www.haage-partner.com</A>) informiert:</B></P>
<P><B>&raquo;PRESSEMELDUNG</B></P>
<P>
14 Juli 2001 - Amiga Inc ist erfreut, eine Zusammenarbeit mit der
HAAGE&amp;PARTNER GmbH, Glash&uuml;tten, Deutschland ank&uuml;ndigen zu k&ouml;nnen, die den
Amiga-Entwickler eine erstklassige Entwicklungsumgebung bieten wird.
</P>
<P>
Amiga Inc arbeitet eng mit HAAGE&amp;PARTNER zusammen, so da&szlig; das StormC
Entwicklungspaket das offizielle Amiga-Entwicklungssystem wird. StormC
wird dazu eine transparente, Sprachen-unabh&auml;ngige Unterst&uuml;tzung sowohl f&uuml;r
AmigaOS, als auch f&uuml;r AmigaDE bieten.
</P>
<P>
&quot;Amiga ist bestrebt, die Entwicklung von Anwendungen voranzutreiben, die
unsere neue Architektur unterst&uuml;tzen.&quot; sagt Fleecy Moss, CTO von Amiga
Inc. &quot;Das bedeutet dynamische, persistente Komponenten, systemunabh&auml;ngige
Schnittstellen und eine komplette Trennung des Designs von der
Implementierung. HAAGE&amp;PARTNER haben mehrere Jahre an einem einfachen,
leicht zu bedienenden und dennoch m&auml;chtigen Entwicklungspaket f&uuml;r das
AmigaOS gearbeitet und wir sind froh, mit ihnen zuk&uuml;nftig
zusammenzuarbeiten.
</P>
<P>
&quot;Wir sind sehr erfreut &uuml;ber die Zertifizierung von StormC durch Amiga&quot;,
sagt J&uuml;rgen Haage, Gesch&auml;ftsf&uuml;hrer der HAAGE&amp;PARNER GmbH. &quot;Diese
Zertifizierung ist eine Qualit&auml;tssicherung f&uuml;r Amiga Inc. und garantiert
der Amiga-Entwicklergemeinde eine fortlaufende Weiterentwicklung unseres
StormC Entwicklungssystems.&quot;&laquo;
</P>
<P><B>Weitere News von Haage &amp; Partner zu StormC:</B></P>
<P><B>&raquo;StormC f&uuml;r AmigaDE/Elate</B></P>
<P>
StormC wurde bereits im letzten Jahr auf AmigaDE/Elate portiert und wartet
nun darauf, da&szlig; das neue GUI-System von Amiga Inc. fertiggestellt wird.
Wir sind guter Dinge, da&szlig; dies schon bald der Fall sein wird.&laquo;
</P>
<P><B>&raquo;StormC-Studenten-Version (Update)</B></P>
<P>
Aufgrund der starken Nachfrage bieten wir wieder eine Studenten-Version von
StormC an. Der Preis liegt bei 298 DM. Es handelt sich dabei um eine
Vollversion ohne Einschr&auml;nkungen. Erh&auml;ltlich ist sie f&uuml;r Studenten,
Sch&uuml;ler und Auszubildende, die uns bei der Bestellung einen offiziell
anerkannten Nachweis ihrer Universit&auml;t, Schule oder Firma mitschicken.
</P>
<P>
Aufgrund der Nachfrage von Petra Struck (amiga-news.de), hatten wir schon
Auszubildende zus&auml;tzlich in die Regelung aufgenommen. Nun haben wir auch
f&uuml;r das Update eine spezielle Student-Version f&uuml;r 149 DM im Angebot. Die
Lizenz der Student-Version ist allerdings an den Namen des K&auml;ufers
gebunden und kann nicht &uuml;bertragen werden.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses7.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
