<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses9.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P><B>&Uuml;ber die beeindruckende Zuverl&auml;ssigkeit AMIGAs (von Carsten Schr&ouml;der)</B></P>
<P>
In einem Punkt kann man sich in letzter Zeit auf AMIGA wirklich verlassen:
Auf jeder einigerma&szlig;en wichtigen Messe macht das Unternehmen neue
Ank&uuml;ndigungen, mit denen zuvor niemand gerechnet hat, ohne die bisherigen
Versprechungen auch nur ansatzweise in die Tat umzusetzen. Aber vielleicht
ist genau Letzteres der Grund f&uuml;r die immer wieder neuen Bekanntmachungen:
Mit irgendwelchen positiv klingenden News m&uuml;ssen wir versuchen, die
Anwender bei Laune zu halten, scheint man sich in Snoqualmie zu sagen.
</P>
<P>
Verlassen k&ouml;nnen wir uns aber weiterhin auch auf AMIGAs Kommunikations- und
Informationspolitik: Denn wer bef&uuml;rchtet hatte, dass sich diese &auml;ndern
k&ouml;nnte, kann beruhigt aufatmen. Auch in Zukunft werden wir wohl das
Vergn&uuml;gen haben, nach einer Ank&uuml;ndigung (die nat&uuml;rlich zun&auml;chst mal
m&uuml;ndlich und via Internet-Chat, aber ohne schriftliche Presseerkl&auml;rung
erfolgt) zun&auml;chst einmal zu r&auml;tseln, wie diese &uuml;berhaupt zu verstehen ist.
Und f&uuml;r dieses Gehirntraining m&uuml;ssen wir nicht einmal etwas an AMIGA
zahlen.
</P>
<P>
Ihr merkt sicher bereits, allm&auml;hlich kann ich die Geschehnisse nur noch mit
Humor (oder ist es sogar schon Sarkasmus?) ertragen. Das j&uuml;ngste Beispiel
ist wieder einmal bezeichnend: Als ich am letzten Samstagmorgen ins Internet
schaute, da konnte ich User-Statements wie &quot;x86-Version des AmigaOS in
Entwicklung&quot; und &quot;AmigaOS wird f&uuml;r x86-Rechner portiert&quot; lesen. Aha, dachte
ich da spontan, AMIGA ist zur Vernunft gekommen und hat eingesehen, dass die
in St. Louis bekannt gegebenen Entscheidungen ein Fehler waren. Denn
bekannterma&szlig;en halte ich die Unterst&uuml;tzung der x86-Prozessorreihen aufgrund
deren Marktdominanz f&uuml;r absolut erforderlich, damit eine
Betriebssystemneuentwicklung einer kleinen Firma &uuml;berhaupt Chancen hat, sich
am Markt zu etablieren.
</P>
<P>
Nun ja, wenigstens dauerte es (anders als bei den Ank&uuml;ndigungen in St.
Louis vor einigen Monaten) diesmal nur ein paar Stunden, bis jedermann klar
war, dass es sich bei dem angek&uuml;ndigten &raquo;Amithlon&laquo; um nichts anderes als
einen stark optimierten (daf&uuml;r aber nicht zu jeder Software kompatiblen)
Amiga-Emulator handelt, und nicht um eine native Portierung von AmigaOS 4.0
bis 4.5 f&uuml;r x86-Rechner - aber genau das w&auml;re meiner Einsch&auml;tzung nach
notwendig, um diesem Projekt wenigstens eine kleine potenzielle Chance
einzur&auml;umen, einige Marktanteile zu gewinnen.
</P>
<P>
Zumindest ein wenig Anlass zur Hoffnung geben (mir) die j&uuml;ngsten
Neuigkeiten aber doch: AMIGA hat mit Amithlon einen Schritt in Richtung
x86 gemacht - vielleicht werden weitere folgen. Eines jedenfalls ist sicher:
Die n&auml;chste Amiga-Messe kommt bestimmt...
</P>
<P><B>Damit bis zum n&auml;chsten Monat,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses9.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
