<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. PD-Spieletests</H2>
<P><B>Willkommen zum aktuellen PD-Teil!</B></P>
<P>
Mein Gott, ich mach das jetzt bestimmt schon...puh...ein Jahr?
Nun, es hat sich in diesem Jahr nichts getan. Alles blieb beim alten.
Aber ist das schlimm? Ich finde eigentlich nicht. So viel Platz f&uuml;r
Innovation ist hier eh nicht. Falls jedoch irgendwer eine geniale Idee
f&uuml;r den PD-Teil hat, kann er sie mir nat&uuml;rlich gerne mailen. Nat&uuml;rlich
k&ouml;nnt ihr auch mailen, wenn ihr irgendwelche Fragen habt, egal ob sie sich
direkt auf den Spieleteil beziehen oder nicht. Wir helfen immer gerne
weiter :)
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><A HREF="mailto:games@aakt.de">games@aakt.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
So, nun aber zu den Tests. Heute im Programm:
</P>
<P>
-Sharks!<BR>
-Flat Mates<BR>
-Action Cat<BR>
</P>
<PRE>
-------------
---Sharks!---
-------------
</PRE>
<P>
Wer hat als Kind nicht davon getr&auml;umt, Schatzsucher zu werden? Uralte
Landkarten mit versteckten Hinweisen entziffern, Kisten ausbuddeln und
nach Sch&auml;tzen tauchen. Mit letzterer Disziplin des
Hochleistungsschatzsuchens befasst sich das Spiel &quot;Sharks!&quot;. Ihr spielt
einen Taucher, der von seinem Boot aus auf den Grund des Meeres tauchen
muss (welcher zuf&auml;llig genau 200 Pixel vom Boot entfernt ist), um l&auml;ngst
vergessene Kostbarkeiten an die Wasseroberfl&auml;che zu bringen. Dies klingt
ziemlich einfach, vor allem wenn man bedenkt, dass der Sauerstoffvorrat
ewig zu halten scheint. W&auml;ren da nicht diese fiesen Haie. Die ziehen ihre
Bahnen n&auml;mlich ausgerechnet an eurem Tauchplatz. B&ouml;se sind sie nicht, aber
nur solange ihr ihnen nicht in die Quere kommt. Ber&uuml;hrt ihr sie n&auml;mlich
verschwindet euer Taucher mit einem Happs im Bauch des unliebsamen
Meeresbewohners. Nat&uuml;rlich werden die Haie durch eure l&auml;ngere T&auml;tigkeit
unter Wasser immer mehr angelockt, und so kommen mit der Zeit immer mehr,
bis es schlie&szlig;lich unm&ouml;glich wird, ohne Blessuren zu tauchen. Au&szlig;er den
Haien gesellen sich noch andere Tiere zu euch, h&uuml;bsche, farbenfrohe Fische
wie auch elektrisch geladene Zitteraale. Denen solltet ihr auch lieber aus
dem Weg gehen, denn bei Ber&uuml;hrung werdet ihr ein paar Zentimeter
weggesto&szlig;en, wenn ihr Pech habt, direkt in das Maul eines Haies.
Dieses Spektakel wurde visuell sehr gut umgesetzt. Die Grafik l&auml;sst sich
an jeden Amiga anpassen und ist gut gezeichnet. Auch der Sound kann sich
sehen lassen, neben coolen Musikst&uuml;cken, die zum Thema Unterwasser passen,
gibt es viele Jacques-Cousteau-typische-Soundeffekte, die ein gutes
Unterwasserfeeling wiedergeben.
</P>
<P>
Zu bekommen ist der Spa&szlig; bei der Amiga Arena.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name:&nbsp;</TD><TD VALIGN="TOP">Sharks!&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Autor:&nbsp;</TD><TD VALIGN="TOP">Christian Steiner&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sound:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Steuerung:&nbsp;</TD><TD VALIGN="TOP">7 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spielspa&szlig;:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Gesamtwertung:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<PRE>
----------------
---Flat Mates---
----------------
</PRE>
<P>
Spiele entstehen oft durch Extremsituationen. So gibt es hunderte von
Gangsterspielen, tausende von Kriegsspielen aber kein einziges
Flugzeugabsturzspiel. Mit dieser Marktl&uuml;cke kann man einen Computer, auf
dem es sonst alles gibt, nat&uuml;rlich nicht leben lassen. Deswegen gibt es
jetzt Flat Mates, die erste Flugzeugsabsturzsimulation, die sich mit der
Zeitspanne zwischen dem Crash und der (hoffentlich sanften) Landung der
einzelnen Passagiere besch&auml;ftigt. Nun muss allerdings gesagt werden, dass
die Passagiere, vier an der Zahl, alles Extremsportler sind, die das
Flugzeug absichtlich in die Luft gejagt haben, um beim Sturz ein kleines
Spiel zu spielen: Sie bewerfen sich gegenseitig mit den herunterfallenden
Gep&auml;ckst&uuml;cken. Gewonnen hat, wer am &ouml;ftesten seine Gegner trifft.
Neben Koffern fliegen in Spezialleveln auch so interessante Dinge wie
Bomben, Gewehre oder Steven Hawkins, der Physik-Guru, runter.
</P>
<P>
Soviel zum Spielziel, ihr steuert nat&uuml;rlich einen der Passagiere, wenn ihr
es schafft, drei Freunde davon zu &uuml;berreden, mit euch zu zocken, k&ouml;nnt ihr
&uuml;ber einen 4 Spieleradapter auch zu viert zocken. F&uuml;r ganz harte ist auch
eine 4-Spieler-Version m&ouml;glich, bei der die Tastatur benutzt wird,
allerdings ist die Tastaturbelegung ein wenig umst&auml;ndlich. Alleine macht
das Game allerdings nur halb soviel Spa&szlig;, auch wenn die Computergegner sich
sichtlich M&uuml;he geben, einen zu unterhalten.
</P>
<P>
Wer nebenbei auf Grafik und Sound achtet, wird feststellen, dass sich der
Programmierer einige M&uuml;he gemacht hat, massig Samples und Musikst&uuml;cke zu
rippen und die Grafik ist sehr gut gemalt.
</P>
<P>
Das Spiel ist Curiousware, das hei&szlig;t, wenn es euch gef&auml;llt, solltet ihr
dem Macher irgendetwas interessantes oder komisches schicken. Was das sein
kann, ist in der Anleitung beschrieben (ich werde jedenfalls mein &quot;Spiel&quot;
BreakStuff verschicken).
</P>
<P><B>Download it!</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name:&nbsp;</TD><TD VALIGN="TOP">Flat Mates&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Autor:&nbsp;</TD><TD VALIGN="TOP">Simon Smith&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">9 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sound:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Steuerung:&nbsp;</TD><TD VALIGN="TOP">7 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spielspa&szlig;:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Gesamtwertung:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<PRE>
----------------
---Action Cat---
----------------
</PRE>
<P>
Story? Gibt's heut nich. Action Cat ist mal wieder eines dieser Spiele, die
sich gar nicht erst die M&uuml;he machen, den Spieler durch irgendeine Story vom
Zocken abzuhalten. Man wird direkt ins Spielgeschehen geschmissen, was
einen an die gute alte Zeit von Turrican erinnert (auch wenn es laut
Anleitung ein Ruff'n'Tumble-Clone sein soll). Ihr d&uuml;rft euch durch ein
enges, vertikales Labyrinth k&auml;mpfen, das voll von Monstern (die ebenfalls
nach Turrican aussehen) und fies versteckten Schaltern und Schl&uuml;sseln ist.
Anfangs erscheint die Sache ziemlich unm&ouml;glich, da man nur eine kleine
Popelwaffe hat, die die Gegner nicht wirklich beeindrucken kann. Die
ballern n&auml;mlich munter auf einen drein und lassen die Lebensenergie schnell
gegen Null sinken. Erst wenn man eine bessere Waffe gefunden hat, dreht
sich der Spie&szlig; um, bis dahin d&uuml;rften jedoch nicht wenige Gelegenheitszocker
den Flucht-Knopf gedr&uuml;ckt haben. Alle anderen erwartet dann noch ein
knackiges Game mit einiger Abwechslung.
</P>
<P>
Leider kl&auml;rt die mitgelieferte Anleitung l&auml;ngst nicht alle Fragen, so dass
das Spiel wirklich nur f&uuml;r fortgeschrittene Spieler geeignet ist, die mit
dem Learning-by-Doing-Prinzip bereits vertraut sind.
</P>
<P>
Auf der technischen Seite hingegen gibt es absolut nichts zu bem&auml;ngeln, die
Grafik ist spitze, der Sound okay, aber man sollte doch lieber das Radio
einschalten.
</P>
<P>
Das Spiel gibt es in der Vollversion kostenlos bei der Amiga Arena.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name:&nbsp;</TD><TD VALIGN="TOP">Action Cat&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Autor:&nbsp;</TD><TD VALIGN="TOP">Horst Spierling&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">9 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sound:&nbsp;</TD><TD VALIGN="TOP">7 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Steuerung:&nbsp;</TD><TD VALIGN="TOP">7 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spielspa&szlig;:&nbsp;</TD><TD VALIGN="TOP">6 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Gesamtwertung:&nbsp;</TD><TD VALIGN="TOP">6 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
