<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Sinner: The End Of The Sanctuary</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<h1><CENTER><FONT COLOR="GREEN">Sinner: The End Of The Sanctuary</FONT></CENTER></h1></P>

Nachdem Sinner vor kurzem erst eine Best Of auf den Markt gebracht hatten,
macht die Band um Mat Sinner (der zwischenzeitig mit seinem Nebenprojekt Primal Fear ebenfalls ordentlich abr&#228;umte)
mit ihrem neuen Album nun erneut positive
Schlagzeilen. Eine Steigerrung nach dem genialen &quot;The Nature Of Evil&quot; h&#228;tte
ich nicht unbedingt erwartet, aber &quot;The End Of The Sanctuary&quot; (auf dem
&#252;brigens Helloween Drummer Uli Kusch zu h&#246;ren ist) ist der Beweis daf&#252;r das
es m&#246;glich ist. Und Sinner geben sich auch in neuer Besetzung keine Bl&#246;se
und treten bei St&#252;cken wie dem sehr Primal Fear lastigen Opener &quot;Signed,
Sealed And Delivered&quot; und den beiden Speed Granaten &quot;Blood Relations&quot; und
&quot;Edge Of The Blade&quot; ordentlich auf`s Gaspedal. Hinzu gesellt sich noch eine
zentnerschwere Midtemponummer, die auf den Namen &quot;Pain In Your Neck&quot;
(erinnert teilweise an &#228;ltere Accept St&#252;cke) h&#246;rt sowie die beiden
melodi&#246;sen St&#252;cke &quot;Heavy Duty&quot; und &quot;Night Of The Wolf&quot;. Etwas ungewohnt und
als nicht gerade typisch f&#252;r den Sinner Sound zu bezeichnen sind wohl der
Titeltrack sowie die epische acht min&#252;tige Halbballade &quot;Destiny&quot;. Wie ihr also unschwer
erkennen k&#246;nnt, wird auf &quot;The End Of The Sanctuary&quot; Abwechselung gro&#223;
geschrieben und macht die Scheibe dadurch sehr vielschichtig und &#228;u&#223;erst
kurzweilig und mit &quot;Broken World&quot; ist nur ein St&#252;ck auf der CD zu finden,
welches mich nicht ganz so vom Hocker hauen konnte wie der Rest. Ist aber im
Grunde auch nicht weiter tragisch, da das weitere Songmaterial ohne Probleme
&#252;ber diesen kleineren Ausfall hinwegtr&#246;sten kann. Erfreulich ist auch, da&#223; Sinner sich mit Klischee`s sehr bedeckt gehalten haben und sich in dieser H
insicht wirklich positiv von vielen anderen Bands abheben.
Wie bei
Sinner &#252;blich, ist das ganze mal wieder von einer genialen Produktion von Mat Sinner h&#246;chstpers&#246;nlich
unterlegt, die vor allem die Gitarren richtig fett klingen l&#228;&#223;t. Wer
teutonischen Metal mag, der kommt um &quot;The End Of The Sanctuary&quot; einfach
nicht herum - unn&#246;tig, da&#223; ich darauf hinweise, da&#223; Sinner &amp; Primal Fear
Fans hier blind zugreifen k&#246;nnen!</P>

Fazit: 9 von 10 Punkten</P><CENTER>
<img src="kit.gif"></P>
<img src="cd3.jpg"></P>
<img src="kit.gif"></P></CENTER>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
