<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Stratovarius: Infinite</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<h1><CENTER><FONT COLOR="GREEN">Stratovarius: Infinite</FONT></CENTER></h1></P>

Nachdem die Melodic Power Metaller mit ihrem letzten Album &quot;Destiny&quot; ein
vergleichsweise etwas schw&#228;cheres Album abgeliefert hatten (welches aber
immer noch gen&#252;gend Klasse besa&#223;) und es anschlie&#223;end etwas ruhiger um die
Band geworden war (wenn man mal von der k&#252;rzlich erschienenen &quot;best Of&quot;
absieht), ist nun mit &quot;Infinite&quot; das Nachfolgewerk erschienen, welches auf
der einen Seite einige neue Elemente einf&#252;hrt, aber auf der anderen Seite
auch Fans der Vorg&#228;ngeralben zufrieden stellt. So ist es nicht weiter
verwunderlich, da&#223; sich mit dem Accoustic Track &quot;Celestial Dream&quot; und dem
epischen &quot;Mother Gaia&quot;, welches mit einem Queen (!!) m&#228;&#223;igen Mittelpart
ausgestattet ist, gleich zwei Songs auf &quot;Infinite&quot; befinden, die man
absolut nicht von Stratovarius erwartet h&#228;tte. Aber vielleicht wirkt genau
deswegen die neue CD so abwechselungsreich, denn auch der quasi Titeltrack
&quot;Infinity&quot;, der, wie schon von den beiden letzten Alben bekannt, mal wieder
auf die 10 Minuten zugeht, ist ganz anders gestrickt als es &quot;Visions&quot; oder &quot;Destiny&quot;
auf ihrem jeweiligen Album waren- man muss &quot;Infinity&quot; erst einige male
h&#246;ren, bevor der Track richtig z&#252;ndet. Was man bisher so nett als
musikalische Weiterentwicklung bezeichnen kann, wird einige Fans sicherlich
wundern und es gibt nicht wenige Beispiele aus der Vergangenheit, wo eben
mit
dieser musikalische Weiterentwicklung den Fans kr&#228;ftig vor den Kopf gesto&#223;en
wurde. Dies ist bei Stratovarius ganz anders, denn zum einen sind die
Ver&#228;nderrungen nicht so gewaltig und zum anderen gibt`s auch gen&#252;gend
St&#252;cke, die in der Tradition der &#228;lteren Meistwerke stehen: Neben der
Doubelbass Nummer &quot;Millennium&quot; sind vor allem die beiden Ohrw&#252;rmer &quot;Freedom&quot;
und das sehr Keyboard lastige &quot;Glory Of The World&quot; (welches mich sehr stark
an &quot;Tomorrow&quot; vom &quot;Episode&quot; Album erinnert) zu nennen, die auf Anhieb zu
gefallen wissen und sofort Erinerrungen an das grandiose &quot;Visions&quot; Album
wachrufen. Unantastbares Highlight ist aber der Opener &quot;Hunting High And
Low&quot;, der von vielen schon als der beste &amp; eing&#228;ngigste Song der Band
gehandelt wird - ob dem nun so ist, ist zwar schwer zu beurteilen, da
Stratovarius im Laufe ihrer Karriere schon so viele geniale St&#252;cke
komponiert haben, aber er geh&#246;rt sicherlich mit zu den besten der Band.
Ihr seht also das &quot;Infinite&quot; ein ohne Zweifel sehr gutes Album geworden
ist, welches &quot;Destiny&quot; klar hinter sich l&#228;&#223;t und somit jedem Fan des
Melodischen Power Metals erfreuen wird. Da der Erstauflage zudem noch eine
Bonus CD mit zwei weiteren Tracks samt Multimedia Part beiliegt, gilt f&#252;r
&quot;Infinite&quot; nur eins: Sofort zugreifen!</P>

Fazit: 9.5 von 10 Punkten</P><CENTER>
<img src="kit.gif"></P>
<img src="cd4.jpg"></P>
<img src="kit.gif"></P></CENTER>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
