<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>News</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<h1><CENTER><FONT COLOR="RED">News</FONT></CENTER></h1></P><UL>

<li> Nun ist es offiziell: Die Megaseller <b>Kiss</B> l&#246;sen sich auf! Somit wird die
im M&#228;rz startende Tournee wohl zu einer Abschiedstour der Maskierten
verkommen. Traurig sollte man dennoch nicht sein: Das letzte Album war
ohnehin nicht der erhoffte Erfolg und auch ansonsten schienen sich die
Bandbelange nur um das eine zu drehen: Um`s liebe Geld. Bestes Beispiel: Der
zweite &quot;Kisstory&quot; Walzer kostet inkl. Porto &amp; Verpackung fast 400 DM...</P><BR>

<li> Immer noch keine Klarheiten bei <b>Megadeth</B>: Wie jetzt verlautete ist Al
Pitrelli (<b>Savatage</B>) wohl fest bei <b>Megadeth</B> eingestiegen. Bei <b>Savatage</B>
scheint er aber auch nicht ausgestiegen zu sein - logischer Erkl&#228;rung: Al
Pitrelli tanzt von nun an auf zwei Hochzeiten. Mal sehen wie lange das gut
geht...</P><BR>

<li> Die Ger&#252;chtek&#252;che brodelt bei <b>Van Halen</B> momentan so stark wie selten
zuvor. Schenkt man den ganzen Ger&#252;chten glauben, so steht uns alsbald das
Comeback von David Lee Roth als S&#228;nger bei <b>Van Halen</B> in`s Haus. Offizielle
Statements dazu waren bisher noch nicht zu bekommen, aber da sich einer der
Musiker sehr zweideutig ge&#228;u&#223;erst hat, kann man den Ger&#252;chten ausnahmsweise
mal Glauben schenken.</P><BR>

<li> Gute (?) Nachrichten aus dem Hause <b>HammerFall</B>: Die Jungs scheinen nun
endlich ihr drittes Langeisen in Angriff genommen zu haben und haben sich
daf&#252;r die Dienste von Producer Michael Wagener (u.a. Accept, Ozzy)
gesichert. Grund daf&#252;r: Man m&#246;chte einen etwas massenkompatibeleren (!) Sound
auf dem n&#228;chsten Album pr&#228;sentieren. Eigentlich komisch, denn sowohl das
Debut als auch der Nachfolger &quot;Legacy Of Kings&quot; waren schon derma&#223;en
&quot;Massenkompatibel&quot;, da&#223; zumindest mir &#252;bel wird, bei dem Gedanken an einen
noch kompatibeleren Sound. Erwartet uns demnach eine Backstreet Boys
Coverversion? Wir werden sehen...</P><BR>

<li> Was <b>HammerFall</B> noch planen, haben <b>Sacred Steel</B> teilweise schon in die Tat
umgesetzt: Das neue Album &quot;Bloodlust&quot; soll zum einen wesentlich zug&#228;ngiger
sein (insbesondere was den Gesang betrifft) und zum anderen haben die
Herrschaften zumindest schonmal einige Klischee`s &#252;ber Bord geworfen, was im
allgemeinen True Metal Trend nur als positives Zeichen verstanden werden
kann.</P><BR>

<li>Die angek&#252;ndigte Tour der auferstandenen <b>Armored Saint</B> wurde auf den
Herbst dieses Jahres verschoben; Fans der Band sollten sich die Sommer
Festivals vormerken, bei denen <b>Armored Saint</b> auftreten werden (u.a. Wacken,
Dynamo, Bang Your Head).</P><BR>

<li> Insider wussten es wohl schon vorher: Die abgesagte Tour von <b>Great White</B>,
als offizieller Grund musste eine Erkrankung von Mark Kendall herhalten,
hatte einen anderen Grund: Eben jener Gitarrist ist bei der Hardrock Legende
ausgestiegen. Als Ersatzman wird h&#246;chstwahrscheinlich Matt Johnson
fungieren, der vor einigen Jahren schonmal S&#228;nger Jack Russell bei dessen
Soloalbum behilflich war.</P><BR>

<li> Traurige Nachricht f&#252;r alle <b>Misfits</B> Fans: Die Jungs brachen v&#246;llig
&#252;berraschend Mitte M&#228;rz ihre US Tour ab. Grund daf&#252;r: Die Bandmitglieder
haben sich untereinander hoffnungslos verkracht und an eine Fortsetzung der
Tour sei nicht zu denken. Offizielle Statements sollen folgen...</P><BR>

<li> Endlich gibt`s auch Neues aus dem <b>Iron Maiden</B> Lager zu berichten: Das neue
Album wird &quot;Brave New World&quot; betitelt werden und erscheint gegen Ende Mai
bzw. Anfang Juni. Auf der neuen Scheibe befinden sich insgesamt 10 Songs,
wobei der Opener &quot;The Wicker Man&quot; (komponiert von: Adrian Smith, Steve
Harris &amp; Bruce Dickinson) als Single ausgekoppelt wird, die, angereichert
mit einigen Live Aufnahmen der letztj&#228;hrigen &quot;Ed Hunter Tour&quot;, in der ersten
Mai Woche erscheinen wird. Erste Eindr&#252;cke von diversen Journalisten lassen
auf den erwarteten Kracher schlie&#223;en - aber nichts anderes erwartet man von
den Eisernen Jungfrauen!</P><BR>

<li><b> Six Feet Under</B> wollen ein komplettes Coveralbum aufnehmen, auf dem sich
u.a. Material von Accept, Angel Witch, Venom und Black Sabbath befinden
soll. Das Release der Scheibe, mit dem vorraussichtlichen Titel &quot;Under The
Influence&quot;, wird aber noch bis September / Oktober dauern.</P><BR>

<li> Ruhe im Hause<B> Iced Earth</B> scheint es wohl nicht zu geben: Nach dem k&#252;rzlich
ver&#246;ffentlichten Projekt <B>&quot;Demons &amp; Wizards&quot;</B> (welches sich immerhin auf Platz
13 der Charts festsetzen konnte) von Mastermind / Gitarrist Jon Schaffer,
steht nun schon wieder das Songwriting f&#252;r die n&#228;chste CD an, welches wohl
bis August beendet sein d&#252;rfte. Mal sehen, ob das neue Album das hohe Niveau
der bisher ver&#246;ffentlichten<B> Iced Earth</B> Platten halten kann.</P><BR>

<li> Das <b>Dynamo 2000</B> ist, nach den ent&#228;uschenden letzten beiden Jahren,
deutlich abgespeckt worden: So findet es zum einen nur noch an einem Tag
statt und zum anderen gibt es keine M&#246;glichkeit mehr, vor Ort (Goffertpark
in Nijmegen) zu zelten, da der Park mitten in der Innenstadt liegt und die
Auflagen das zelten verbieten. Die Besetzung ist zwar keineswegs &#252;bel (u.a.
Iron Maiden, Slayer, Rob Halford), aber ob das Festival unter diesen
Umst&#228;nden ein Erfolg wird (zumal der Presi von 78 DM auf einem &#228;hnlichen
Level liegt, wie eine Karte zum Wacken Open Air), darf bezweifelt werden.</P><BR> 

<li> Die Herner Power Metaller <b>Custard</B>, die mit ihrem Album &quot;Kingdoms Of Your Life&quot; 1997 ein hervorragendes, aber leider viel zu wenig beachtetes Album rausgebracht haben, sind nun bei Nuclear Blast unter Vertrag. Das neue Album, welches schon seit Mitte `99 fertig ist und jetzt mit einem neuen S&#228;nger eingesungen wurde, wird mit &quot;Up To The Sky&quot; betitelt sein und wird definitiv ein Highlight des Jahres 2000. Da die Band einige Nummern schon auf lokaler Ebene vorgestellt hat und damit durchweg hervorragende Resonanzen bekommen hat (auch meinerseits), kann mit einem f&#228;higen Label im R&#252;cken nix mehr schiefgehen. Zumindest ich dr&#252;cke den Jungs die Daumen - verdient h&#228;tten sie es allemal...</P><BR></UL>






</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
