<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Oldie Review: Running Wild`s "Death Or Glory"</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<h1><CENTER><FONT COLOR="WHITE">Oldie Review: Running Wild`s &quot;Death Or Glory&quot;</FONT></CENTER></h1></P>

Wenn man vom deutschen Heavy Metal redet, f&#228;llt, neben Helloween, Gamma Ray
oder Blind Guardian, auch immer der Name Running Wild. Das ist auch kein
Wunder, denn immerhin haben die Jungs um Chefdenker, Gitarrist und S&#228;nger
Rolf Kasparek 13 bisher astreine Metal Alben abgeliefert und ihre Fans nie
mit Stilwechseln oder kommerziellen Ausfl&#252;gen verunsichert. Running Wild
z&#228;hlen somit also sicherlich zu den wenigen Bands, die ihr Ding wirklich
konsequent und professionell durchziehen und im Laufe ihrer Karriere ein
bestimmtes Level niemals unterschritten haben. Zu einem ihrer vielen
Highlights geh&#246;rt sicherlich das 1989 ver&#246;ffentlichte Album &quot;Death Or
Glory&quot;, von derren Besetzung heute allerdings nur noch Rolf Kasparek &#252;brig
ist.</P>

Nichtsdestotrotz ist das Songmaterial schlicht und ergreifend hervorragend
und ist ein erstklassiges Beispiel f&#252;r den typischen Running Wild Sound:
Hart, aber gleichzeitig eing&#228;ngig. Ruhige T&#246;ne findet man auf der ganzen CD
zwar nicht, aber daf&#252;r wird umso mehr auf`s Gaspedal getreten, was
insbesondere St&#252;cke wie den Opener &quot;Riding The Storm&quot; und &quot;Bad To The Bone&quot;
zu unsterblichen Klassikern machen. Ordentliche Midetemponummern d&#252;rfen auch
nicht fehlen und von Brettern wie &quot;March On&quot; oder &quot;Tortuga Bay&quot; k&#246;nnten sich
einige der heutigen Bands wirklich eine Scheibe abschneiden. Insbesondere
die rauhe Stimme von Rolf Kasparek verleiht den St&#252;cken einen ganz eigenen
Touch und wirkt zu jedem Zeitpunkt absolut &#252;berzeugend. Dazu gibt`s noch ein ordentliches Instrumental und mit &quot;Marooned&quot; und &quot;Renegade&quot; zwei
Tracks,  die ebenfalls zu den Highlights der CD geh&#246;ren d&#252;rften.</P>

Der Sound der Originalplatte ist f&#252;r damalige Verh&#228;ltnisse auch recht ordentlich,
w&#252;rde heute aber gnadenlos durchfallen. Umso besser ist es da, da&#223; &quot;Death Or
Glory&quot; (sowie einige weiteren CD`s aus dem RW Backkatalog) vor kurzem
Re-releast wurden und dabei vom Chef h&#246;chstpers&#246;nlich neu abgemischt wurden,
was insbesondere den Gitarren gut tat, die nun noch fetter aus den Boxen
dr&#246;hnen. Wer sich also auf der Suche nach hervorragendem , kompromi&#223;losen und zeitlosem
Heavy Metal ist, kommt um &quot;Death Or Glory&quot; zum Verrecken nicht rum. Nur
sollte man tunlichst drauf achten, da&#223; man das Rerelease in seine Finger
kriegt, da dort noch einige gutklassige Bonus Track`s vertreten sind.</P>

Fazit: 10 von 10 Punkten </P><CENTER>
<img src="kit.gif"></P>
<img src="oldie.jpg"></P>
<img src="kit.gif"></P></CENTER>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
