<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - Editorial</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER">Editorial</H1>
<BR>
<P>Entgegen aller Versprechungen nun doch erst ein paar Worte in eigener
Sache:</P><P>
Der AmZeiger feiert <B>Jubil&auml;um!</B> Mit Herausgabe dieser Ausgabe besteht
er bereits ein volles Jahr und hat sich w&auml;hrend dieser Zeit gemausert.
Mittlerweile steht eine Anzahl engagierter Redakteure hinter diesem
Erfolg. Mehr dazu bei <A HREF="intern.htm">Interna</A>.
</P><P>
WICHTIG: Aus diesem Anla&szlig; veranstalten wir dieses Mal ein gro&szlig;es
Preisausschreiben mit attraktiven Software-Gewinnen im Wert von
&uuml;ber 500 DM. Hits wie Final Odyssey und OnEscapee winken.
<P></P>
Wichtigstes Ereignis des letzten Quartals war sicherlich die <B>World of AMIGA '98</B>
in London. Amiga wollte, wie so oft, weltersch&uuml;tternde Neuigkeiten offenbaren. Ob
dem so war, lesen sie <A HREF="woa98.htm">hier</A>.
<P></P>
Jetzt will ich mich kurz einem anderen Thema zuwenden, das in den
meisten einschl&auml;gigen Publikationen, abgesehen von ein paar Postings
in diversen Diskussionsforen der Netze, noch kaum beachtet wurde.
<P></P>
Es geht um <B>ICQ</B>. ICQ (sprich: I seek you [Ich suche Dich]) ist ein
Programmpaket f&uuml;r einige Systeme, wie PC und Apple, das es bei jedem
Aufenthalt im Internet erm&ouml;glicht, zu sehen, welcher der Freunde und
Bekannten gerade online ist und mit ihnen dann kleine eMails
auszutauschen oder zu chatten.
<P></P>
Was hat das aber mit uns zu tun?
<P></P>
Nun, auch viele Amiga-User nutzen das Internet und sie w&uuml;nschen sich
dieselben M&ouml;glichkeiten. Leider hat die israelische Firma Mirabilis,
verantwortlich f&uuml;r ICQ und die Server, &uuml;ber die die Verbindung
aufgebaut wird, keine Entwicklungskapazit&auml;ten f&uuml;r eine Amiga-Version
frei, falls sie denn wirklich eine planen w&uuml;rden.
<P></P>
Brian Gilbert hat auf eigene Faust ein Team zusammengestellt, welches ICQ
nachprogrammiert hat. Die Ergebnisse kann man auf einigen Screenshots
auf der Homepage (<A HREF="http://www.mcmedia.com.au/amigaicq/">http://www.mcmedia.com.au/amigaicq/</A>) begutachten oder sich
zus&auml;tzlich zu den bisher etwa 5.000 Usern in eine Liste eintragen, die
Mirabilis zeigen soll, da&szlig; auch auf dem Amiga genug Interesse f&uuml;r einen
eigenen Port vorhanden ist.
<P></P>
Denn der entscheidende Faktor ist diese Firma, &uuml;ber deren Server der
Kontakt aufgebaut wird. Nicht am Programmiertechnischen scheitert das
Projekt, denn laut der Entwickler dauert die Fertigstellung nach
Offenbarung des geheimen Zugangsprotokolls h&ouml;chstens ein paar Wochen.
<P></P>
Obwohl sich das Team bereiterkl&auml;rt hat den Amiga-Port kostenlos zur
Verf&uuml;gung zu stellen und auch ein NDA zu unterschreiben, was verhindern
w&uuml;rde, da&szlig; sie etwas "ausplaudern", will Mirabilis nicht ran.
<P></P>
Nach widerspr&uuml;chlicher Anfangshaltung haben sie pl&ouml;tzlich auf Stur
geschaltet: Entwicklungen w&uuml;rden nur firmenintern durchgef&uuml;hrt und gegen
zuk&uuml;nftiges illegales Eindringen in ihre Server rechtlich vorgegangen
werden.
<P></P>
Mehr als f&uuml;nf Millionen Personen haben sich bei Mirabilis registriert und
benutzen das Programm - kostenlos. Bis jetzt, denn wilde Ger&uuml;chte sprie&szlig;en,
nach denen zuk&uuml;nftig deftige Geb&uuml;hren erhoben werden sollen. Auf dem WWW-
Server wird das heftig bestritten, etwaige Ma&szlig;nahmen w&uuml;rden aber einen
Monat vorher bekanntgegeben werden.
<P></P>
Doch wieviel User w&uuml;rden ihnen dann bleiben, denn ihr Erfolg basiert auf
der Idee und ihrer fr&uuml;hzeitigen Umsetzung, sowie der dadurch entstandenen
gro&szlig;en User-Zahl, nicht so sehr auf der Einmaligkeit des Programms.
Au&szlig;erdem gibt es &Uuml;bernahmeger&uuml;chte. M&ouml;glicherweise ein lukratives Gesch&auml;ft,
denn ein gro&szlig;er Grundstock f&uuml;r Werbemails w&uuml;rde zur Verf&uuml;gung stehen.
<P></P>
Das Ganze macht Sinn, denn irgendwann werden sie Geld verdienen m&uuml;ssen.
Bleiben die Amiga-User wegen dieser letztlich kommerziellen Interessen
auf der Strecke, obwohl einige der Mirabilis-Gr&uuml;nder urspr&uuml;nglich vom
Amiga kommen?
<P></P>
Der AmZeiger unterst&uuml;tzt die Anstrengungen eines Amiga-Ports von ICQ.
Im Gegensatz &uuml;brigens zum bekannten Web-Directory des CUCUG. In Sachen
Verweise auf Links sind sie DIE Macht im Amiga-Sektor. Auf diese Aktion
wollen sie nicht verweisen (genauso wie auch auf aktuelle Ausgaben dt.
Online-Mags nicht hingewiesen wird, anders dagegen bei englischsprachigen).
<P></P>
Informieren Sie sich auf der Site, wenn Sie die M&ouml;glichkeit haben und
entscheiden auch Sie sich gegebenenfalls zur Unterst&uuml;tzung.
<P></P>
Zugegeben: Im Gesamtma&szlig;stab handelt es sich vielleicht nur um eine
Kleinigkeit, aber wenn man irgendetwas bewegen will, sollte man bei
solchen Dingen ansetzen.
<P></P>
Bleiben Sie uns auch in Zukunft gewogen,

<BR> <BR>
Ihr<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A><BR>
Chefredakteur<BR>

<DIV ALIGN="CENTER">...und unser <A HREF="danke.htm">DANK</A> geht an...<DIV ALIGN="CENTER">

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="main.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="win.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
