<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - Interna Infernale</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN="CENTER"><H1>Interna Infernale</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<H3><U>Interna allgemein</U></H3>

<P><B>Jubel-Jubil&auml;um</B>. Es ist vollbracht - wir haben ein erfolgreiches Jahr
hinter uns gebracht, zumindest was den AmZeiger betrifft. ;) Vor fast
genau einem Jahr kam die erste Ausgabe heraus, damals noch von zwei
Redakteuren zusammengestellt. Von Anfang an bereits wurden zeitgleich
zwei Formate, AmigaGuide und HTML, ver&ouml;ffentlicht und wir waren auch
sofort online.</P><P>
Seitdem sind unsere Ausgaben inhaltlich gewachsen, die HTML-Ausgabe hat
ein eigenes, nicht &uuml;berfrachtetes Design, der AmZeiger ein Maskottchen
und wir bestehen nun nicht zuletzt aus einer Stamm-Mannschaft von f&uuml;nf
Redakteuren.</P><P>
Vielleicht haben sie als Leser unsere Entwicklung (so, wie wir die des
Amiga`s in dieser Zeit) von Anfang an verfolgt, vielleicht sind sie
aber auch erst sp&auml;ter hinzugesto&szlig;en.</P><P>
Auf alle wartet jedoch die Chance auf einen Gewinn in unserem
<A HREF="game.htm">Preisausschreiben</A>. F&uuml;r eine einfache Gewinnchance gen&uuml;gt bereits
ein Leserbrief!!!</P>
<H3><U>Hinweise zu dieser Ausgabe #5</U></H3>
<P>Leider wurde es dieses Mal nichts mit einem <B>Interview</B>, die Urlaubsaison
hat unsere Pl&auml;ne kurzfristig zu Fall gebracht.</P><P>
Die Beitr&auml;ge sprechen f&uuml;r sich selbst. Besonders interessant finde ich
auch den <A HREF="../sw/9806year.htm">Artikel</A> zum Jahr 2000 und was
dies computertechnisch f&uuml;r Probleme aufwirft.</P><P>
Au&szlig;erdem gibt es als weiteren kleinen <A HREF="bin.lha">Bonus</A> ein begonnenes Textadventure
im AmigaGuide-Format (!). Meine Motivation reichte zwar nicht, um es
wirklich fertigzustellen, aber ich denke, auch bei diesem Entwicklungsstand
zeigt sich schon, da&szlig; es m&ouml;glich w&auml;re. Es ist im Bin-Verzeichnis zu finden.
</P><P>Unsere Supportbox in Berlin, die <A HREF="../bbs.htm">BBrandes</A> stellt einen Gro&szlig;teil ihrer
T&auml;tigkeit ein. Trotzdem ist es &uuml;ber zwei verbliebene Ports bis mindestens
Ende des Jahres m&ouml;glich, aktuelle AmZeiger-Ausgaben wie gewohnt zu laden.</P>
<H3><U>Hinweise zur letzten Ausgabe #4</U></H3>
<B>Korrektur zu - Blitzbombers-Test:</B>
<P>Die Webadresse der Entwickler lautet <A HREF="http://www.ldngedge.demon.co.uk">http://www.ldngedge.demon.co.uk/</A></P>
<B>Hinweis zu - HTML-Ausgabe:</B>
Leider hatte sich eine falsche und somit etwas fehlerhafte Main-Seite in das
Archiv geschmuggelt. Dadurch sind die lokalen Ausgaben &auml;lterer Nummern
nicht von dort aus per Knopfdruck erreichbar gewesen. Mit dieser Ausgabe
tritt das Problem nicht mehr auf.
<H3><U>Hinweise zur n&auml;chsten Ausgabe #6</U></H3>
<P>Voraussichtlich wird in der n&auml;chsten Ausgabe ein Test des Geoworld-Updates
sein, ein Foundation-Spieletest, sowie nat&uuml;rlich u.a. die Fortsetzung des
Installer- und des WB-Tuning-Kurses. Nat&uuml;rlich erfolgt auch die Aufl&ouml;sung
unseres Preisausschreibens!</P><P>
Mit W&uuml;nschen, Hinweisen oder sogar eigenen Artikeln, einfach <A HREF="../kontakt.htm">hier</A> melden!
</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="about.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="game.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

