<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - AmPuls</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U><A NAME="Top">Am Puls - Kurzmeldungen:</A></U></H1><P ALIGN="CENTER">
<A HREF="#Software">Software</A> <A HREF="#Hardware">Hardware</A> <A HREF="#Spiele">Spiele</A></P>

<H2 ALIGN="CENTER">Amiga-Allgemein</H2>

<P>Die Entscheidung von <A HREF="http://www.amigainc.com">Amiga Inc.</A> gegen die PPC-CPU-Familie ist gefallen!
N&auml;heres dazu im Beitrag zur <A HREF="woa98.htm">WOA 98</A> in London.</P>
<P>Au&szlig;erdem hat die Entwicklungsfirma Amiga Inc. in den USA jetzt eine
eigene <A HREF="http://www.amiga.com">Internet-Site</A>.</P>

<HR WIDTH="50%">

<P>Als Konsequenz zu den Amiga-Entscheidungen haben sich <A HREF="http://www.phase5.de">Phase5</A> und
<A HREF="http://www.haage-partner.com/">Haage&amp;Partner</A> darauf verst&auml;ndigt in Zukunft bei ihren Entwicklungen
zusammenzuarbeiten.</P>

<HR WIDTH="50%">

<P><A HREF="http://www.maxon.de/">Maxon Computer</A>, die in letzter Zeit haupts&auml;chlich mit ihrem Raytracer
Cinema4D auf dem PC Furore machen, haben offiziell die Einstellung der
Entwicklung f&uuml;r den Amiga bekanntgegeben. Als &quot;Abschiedsgeschenk&quot; wird
in der <A HREF="http://www.amigaplus.de/">Amiga Plus</A>-Ausgabe 8/98 eine Vollversion dieses Programms auf
CD enthalten sein, Kostenpunkt: um die 20 DM.</P>

<HR WIDTH="50%">

<P><A HREF="http://www.softwood.com">Softwood</A>, u.a. verantwortlich f&uuml;r FinalWriter, hat die Amiga-Entwicklung
eingestellt.</P>

<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Software">Software</A></H2>
<P>Mit <B>Mage</B> will <A HREF="http://www.Tornado3D.com">Eyelight</A> einen Nachfolger des
Raytracers <B>Tornado3D</B> schaffen, der auch f&uuml;r andere Systeme als den Amiga erh&auml;ltlich werden soll.
Allerdings wird Mage von einem anderen Entwicklungsteam programmiert, so
da&szlig; die Entwicklung von <B>Tornado3D</B> weitergeht. Mage wird nur auf RISC-
basierten Rechnern herauskommen, so auf Amiga PPC, Apple und Silicon
Graphics. Der Einstandspreis des f&uuml;r den HiEnd-Markt gedachten Produkts,
das im Oktober herauskommen soll, betr&auml;gt 1299 US-Dollar.</P>
<HR WIDTH="50%">
<P>Tats&auml;chlich ist die Entscheidung gefallen. Der u.a auf dem PC verwendete
und dort f&uuml;r seine Schlankheit bekannte Browser <A HREF="http://www.operasoftware.com/">Opera</A> wird auf den Amiga
umgesetzt. Die Entwicklung wird von <B>RamJam Consultants Ltd.</B> aus England
&uuml;bernommen, die bereits zu Weihnachten eine erste Version fertig haben
wollen, die Amiga-OS 3.1 und 4 MB Ram voraussetzen wird.</P>
<HR WIDTH="50%">
<P>Mit <B>EasyWriter</B> will <A HREF="http://www.haage-partner.com/">Haage&amp;Partner</A> den
Amiga-Markt f&uuml;r Textverarbeitungen
aufrollen, was bei den Funktionen und der geringen Konkurrenz m&ouml;glich sein
sollte. Konsequentes WYSIWYG, sowie eine echte End- und Fu&szlig;notenverwaltung,
unz&auml;hlige Funktionen u.a. zur Absatz- und Kapitelbearbeitung, sowie eine
M&ouml;glichkeit Grafiken in Texte einzubinden, sollen &uuml;berzeugen. Auch RTF-
Import ist integriert.</P><P>Voraussetzung ist ein Amiga mit 25 MHz-030, 8 MB RAM und OS 3.0. Der
Einf&uuml;hrungspreis bis 31.08.98 betr&auml;gt 149,- DM, ab dann 198,- DM.
Lieferbar soll es im Juli sein, ein Update auf Version 2.0 ist im
Preis inbegriffen.</P>
<HR WIDTH="50%">
<P>Da der Support des alternativen Filesystems <B>AFS</B> durch den Distributor
Forth Level Development eingestellt wurde, &uuml;bernimmt der Programmautor
diesen wieder selbst. Er nennt seine Firma <B>Great Effect Development</B>
und kehrt auch zum alten Programmnamen <B>PFS</B> zur&uuml;ck. Bald soll eine
neue Version mit zahlreichen Verbesserungen zum Preis von 99,- DM
verf&uuml;gbar sein.</P>

<HR WIDTH="50%">
<P>Die Version 1.2 der <B>Amiga Developer-CD</B> wird vom ICP-Verlag vertrieben.
Der Preis betr&auml;gt 24,80 DM.<BR><A HREF="http://www.amigaplus.de">http://www.amigaplus.de</A>
</P><HR WIDTH="50%">
<P><B>Cloanto</B> hat die <B>Amiga Forever 2.0-CD</B> herausgebracht, die neben
Amiga-Emulatoren (u.a. UAE) auch AmigaOS 1.1-3.0 und komfortable
Netzwerksoftware enth&auml;lt. Der Preis betr&auml;gt 119,- DM, das Update 50,- DM.</P>
<HR WIDTH="50%">
<P>Der bekannte TCP/IP-Stack <A HREF="http://www.nordicglobal.com">Miami</A> ist in seiner Version 3.0 fertiggestellt
und lieferbar. Die neuesten Standards werden unterst&uuml;tzt, incl. SSL, T/TCP
uvm.. Au&szlig;erdem kann man nun auch die Oberfl&auml;che ausw&auml;hlen, vorl&auml;ufig
wird neben MUI auch GadTools angeboten.</P>

<HR WIDTH="100%">
<A NAME="Hardware"><H2 ALIGN=CENTER>Hardware</H2></A>
<P><A HREF="http://www.haage-partner.com/">Haage&amp;Partner</A> und <A HREF="http://www.phase5.de/">Phase5</A> planen ein neues Amiga-kompatibles Rechnersystem,
das auf dem PPC und einem OS-Update (wahrscheinlich OS 3.5) basieren soll.
Es soll noch dieses Jahr auf den Markt kommen.</P>

<HR WIDTH="50%">
<p>Die von <A HREF="http://www.phase5.de">Phase5</A> f&uuml;r ihre Beschleunigerkarten angek&uuml;ndigten Grafikkarten
<B>CybervisionPPC</B> sollen kurz nach erscheinen dieser Ausgabe Anfang Juli
lieferbar sein. Die <B>BlizzardVisionPPC</B> wird kurz darauf folgen.</P>
<HR WIDTH="50%">
<P><A HREF="http://www.cix.co.uk/~index/">Access Innovation Ltd.</A>, verantwortlich f&uuml;r das Amiga-kompatible BoXeR-
Mainboard, entwickelt nach eigenen Angaben ein <B>AA+ - Chipset</B>, das es als
AGA-Chipset der n&auml;chsten Generation anpreist.</P><P>
Es soll auf einem v&ouml;llig neu designten 32-Bit-Kern basieren, der die
16-Bit-Register von AGA emulieren kann. Die ChipRAM-Bandbreite soll
das 20-fache betragen und der 16-Bit-Blitter ebenfalls um das 20-fache
beschleunigt werden, da automatisch in 32 Bit-Operationen &uuml;bersetzt
wird.</P><P>Enthalten sein soll weiterhin ein DRAM-Controller f&uuml;r DIMMs und SIMMs,
ein PCI-Controller, AGA-kompatibilit&auml;t und HD-Laufwerk-Unterst&uuml;tzung.
Zus&auml;tzliche Chunky-Grafikmodi (angesprochen &uuml;ber CyberGraphics/Picasso96)
mit Aufl&ouml;sungen bis zu 1.024x768 bei 16 Bit Farbtiefe, sowie 16-Bit-Sound
d&uuml;rften bei Erscheinen f&uuml;r Freude sorgen.</P>
<HR WIDTH="50%">
<P>F&uuml;r die <B>Delfina</B>-Karte sind 1998 einige Erweiterungsmodule angek&uuml;ndigt.
Z.B. DelfSer mit einer seriellen Schnittstelle, die bis zu 625 kbps
erreichen soll, au&szlig;erdem DelMP3, ein MPEG-Player f&uuml;r die Layer
1-3.</P><P>
Ende August gibt es mit der <B>Delfina 1200</B> auch eine Soundkarte f&uuml;r den
1200 ohne Zorro-II-Board. Sie besitzt dieselben Funktionen, wie die
Delfina Lite. F&uuml;r letztere erscheint im zweiten Halbjahr ein Modul mit
digitalem Ein- und Ausgang.</P><P>
Am Jahresende soll mit der <B>Delfina Pro</B> eine Karte speziell f&uuml;r Profis
erscheinen, die mit mehr RAM und einem neuen, besseren DSP gl&auml;nzen
wird.</P><BR>
Quelle: AmiPoint

<HR WIDTH="50%">
<P><A HREF="http://www.rbm.de/">RBM</A> will ab Ende Juni <B>IOBlix</B> ausliefern. Dabei handelt es sich um eine
Zorro-II-Schnittstellenkarte, die vier serielle RS232-Schnittstellen,
zwei EPP/ECP-Parallelports und zwei Modulports miteinander vereint.
F&uuml;r letztere ist eine AHI-kompatible Soundkarte und ein SANA-II-
kompatibles Ethernetmodul in Vorbereitung. Preis ab 249,- DM.</P>

<HR WIDTH="50%">
<P>Die Erweiterungsmodule (Video-In Paloma IV, Video-Out Pablo IV, Soundmodul
Concierto IV) f&uuml;r die <A HREF="http://www.villagetronic.com/">Picasso IV</A>-Grafikkarte sind fertiggestellt und k&ouml;nnen
ausgeliefert werden.</P>

<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Spiele">Spiele</A></H2>
<P>Das mit viel Vorschu&szlig;lorbeeren bedachte Spiel <A HREF="http://www.sadeness.demon.co.uk/">Foundation</A>, das einige
Spielkonzepte (u.a. Siedler) in sich vereint, ist auf der WOA 98
erschienen. Ein Test folgt in unserer n&auml;chsten Ausgabe.</P>
<HR WIDTH="50%">
<P>Die Entwicklung von <B>Wasted Dreams</B> soll doch nicht eingestellt sein, wie
<A HREF="http://www.vulcan.co.uk/">Vulcan</A> in einer Presseerkl&auml;rung
zuerst mitgeteilt hatte.</P>
<HR WIDTH="50%">
<P><A HREF="http://www.clickboom.com/">clickBOOM</A> l&auml;&szlig;t mit <B>Napalm: The Crimson Crisis</B> einen Command & Conquer-
Klone entwickeln. Ein 68020, 8 MByte FastRAM und 2xCD-ROM werden
Voraussetzung sein.</P><P>
Angeblich wird clickBOOM auch das bekannte Echtzeit-Strategiespiel <B>Z</B> der
Bitmap Brothers herausbringen.</P>
<HR WIDTH="50%">
<P><A HREF="http://homepage.esoterica.pt/~cOntact/index.htm">BlueBlack Solutions</A> programmiert einen weiteren C&C-Klone. <B>CounterStrike</B>
soll neben vielen Zwischensequenzen, Sprachausgabe, TCP/IP-Unterst&uuml;tzung
und Level-Editor bieten. Fr&uuml;her firmierte es das Spiel unter &quot;Diversia&quot;.</P>
<P>Ab 030, 4 MB FastRAM und CD-ROM-Laufwerk wird es, auch auf Grafikkarten,
lauff&auml;hig sein.</P>

<P><CENTER><A HREF="#Top">Zur&uuml;ck zum Anfang</A></CENTER></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="about.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="intern.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
