<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - World of Amiga 98</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>World of Amiga 98 - Kommentar</U></H1><P ALIGN="CENTER">von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></P>

<P>Die WOA`98 in London, um kurz auf das Umfeld einzugehen, ist gegen&uuml;ber dem
Vorjahr geschrumpft; es gab weniger Neuvorstellungen, viele versprochene
&quot;Releases&quot; wurden nicht eingehalten.</P>
<P><B>Amiga Incorporated</B>, die amerikanische Tochterfirma von Gateway, die jetzt
im Grunde f&uuml;r die wesentlichen Entscheidungen zust&auml;ndig ist, machte im
Vorfeld der Messe mit einer geheimnisvollen Ank&uuml;ndigung neugierig. Auf
einer Pressekonferenz w&uuml;rde bekanntgegeben, wohin der Weg des Amiga`s
f&uuml;hren w&uuml;rde und das w&auml;ren nahezu sensationelle Neuigkeiten.</P>
<P>Wer nun glaubte, da&szlig; nun das Bekenntnis zur PowerPC-Technologie erfolgen
w&uuml;rde, der irrte! Sicherlich w&auml;re dies zu einfach und nicht sensationell
genug gewesen. Au&szlig;erdem h&auml;tte es dem entsprochen, was Petro Tyschtschenko,
Gesch&auml;ftsf&uuml;hrer von Amiga International Inc., mehrfach als angeblich
endg&uuml;ltige Entscheidung verk&uuml;ndet hatte. Wer tats&auml;chlich noch ein Indiz
daf&uuml;r brauchte, wer das Sagen in Sachen Amiga hat - da ist es.</P>
<P>Das markante, vielleicht bezeichnende, der dann tats&auml;chlich stattfindenden
<B>Pressekonferenz</B>, waren aber eigentlich nicht die verk&uuml;ndeten Ziele, sondern
ihre erstaunliche <B>Unprofessionalit&auml;t</B>. Der Chef der Amiga Inc., Jeff
Schindler, verbreitete unter den Anwesenden mehr Verwirrung und
Unsicherheit, als Zuversicht oder gar Euphorie, wie es eigentlich
geplant war.</P><P>
Als Folge davon kursierten schon bald wilde Ger&uuml;chte, die aber
diesmal tats&auml;chlich auf dem Bekanntgegebenen fu&szlig;ten und meist aus
nachvollziehbaren Interpretationen bestanden. Die PPC-CPU`s w&auml;ren nicht
die zuk&uuml;nftigen Prozessoren des Amiga, dieser w&uuml;rde perspektivisch auf
Intel-CPU`s basieren. OS 3.5, das Update f&uuml;r die, jetzt als Classic-
Amiga`s heruntergestuften, aktuell existierenden Amiga`s w&auml;re out, jetzt
ginge es gleich mit OS 4.0 weiter, welches aber nicht mehr zu den alten
Betriebssystem-Versionen kompatibel w&auml;re. Danach k&auml;me OS 5.0 auf einem
wirklich neuen Amiga zum Einsatz.</P><P>
Unmut war die nat&uuml;rliche Folge dieses pl&ouml;tzlichen Kurswechsels und der
recht ungenauen Angaben. Phase 5-Gesch&auml;ftsf&uuml;hrer Wolf Dietrich soll
eingeworfen haben, ob Amiga die verbliebenen Hardwarehersteller in den
Ruin treiben wolle (sinngem&auml;&szlig;). Eine aus seiner Sicht verst&auml;ndliche
Schlu&szlig;folgerung.</P><P>
Andere Amiga-Mitarbeiter sahen sich im Nachhinein gen&ouml;tigt einiges zu
korrigieren und zu erg&auml;nzen, manches wesentliche aber auch nicht. Jeff
Schindler h&auml;tte sich nur zu ungenau ausgedr&uuml;ckt, etwas anderes gemeint
- eine schwache K&uuml;r bei einem so wichtigen Auftritt, soviel bleibt in
jedem Fall festzuhalten.</P><P>
<B>Was aber bleibt unterm Strich?</B> Wohin soll die Entwicklung nun tats&auml;chlich
gehen?</P><P>
Ende 1999 soll ein komplett neuer Amiga erscheinen, der mit einem jetzt
noch ungenannten Superchip als Hauptprozessor laufen soll. Dieser Amiga
w&uuml;rde mit OS 5.0 ausgeliefert, das ebenso wie 4.0 (au&szlig;er maximal einem
integrierten Emulator) nicht r&uuml;ckw&auml;rtskompatibel sein wird und faktisch
eine Neuentwicklung ist.</P><P>
OS 4.0 ist die Vorstufe, mit deren Hilfe auf IBM-kompatiblen PC`s
Software f&uuml;r OS 5.0 entwickelt werden soll. Die Classic-Amiga`s (sprich:
die &quot;echten&quot;) werden zuk&uuml;nftig nicht mehr unterst&uuml;tzt werden.</P><P>
Bei dem ungenannten Superchip soll es sich ger&uuml;chteweise um eine
softwaremodifizierbare CPU der Firma Transmeta handeln, deren
Entwicklungen bisher geheim sind und auf die Gateway die Hand halten
soll. Das ist aber reine Spekulation.</P><P>
Alles in allem immer noch ziemlich nebul&ouml;s, auch wenn schon erste Fotos
des Entwickler-PC`s kursieren, die nat&uuml;rlich der Aussagekraft einer
Scheibe Kn&auml;ckebrot entsprechen. Das OS 3.5 scheint &uuml;brigens doch noch
zu erscheinen. Wie Mit-Entwickler Olaf Barthel uns zu verstehen gab, ist
das Projekt nicht eingestelt und Jeff Schindler &auml;u&szlig;erte sich k&uuml;rzlich
auf der Gateway-Amigamesse in den USA &auml;hnlich.</P><P>
Doch was bedeutet das Konzept der <B>Classic Amiga`s</B>, die quasi zum alten
Eisen gestempelt und von den &quot;neuen&quot; lediglich emuliert werden? Es
bedeutet erst einmal den Neubeginn bei Null. Der sanfte &Uuml;bergang zum
PowerPC, einer leistungsf&auml;higen CPU-Linie mit mindestens mittelfristig
gesicherter Weiterentwicklung, ist dahin. Egal wie toll der unbekannte
Chip wird: seine Zukunft und sein Erscheinungstermin sind unsicher.
</P><P>Das <B>Betriebssystem</B> soll ebenfalls bei Null anfangen. Selbst wenn
bedeutende Teile eines anderen, wie z.B. BeOS integriert werden sollten,
wie angedeutet wurde, so fehlt doch ein wesentlicher Punkt f&uuml;r den Erfolg:
eine Basis guter Standardsoftware. Sicherlich ist dies das gr&ouml;&szlig;te Problem
f&uuml;r die wenigen neuen, meist mit einigen Jahren Aufwand entwickelten
Betriebssysteme, die teilweise mit modernen Konzepten gl&auml;nzen, aber sich
aus diesem Grund wahrscheinlich nicht durchsetzen k&ouml;nnen. Wo wird sich
dann ein weiteres neues OS positionieren k&ouml;nnen, das jetzt wahrscheinlich
gerade erst begonnen wird?</P><P>
Noch ein Wort zur <B>Hardware</B>, die auf der WOA mit phantastisch beschrieben
wurde. Wird sie in zwei Jahren der sich ebenfalls weiterentwickelnden PC-
Konkurrenz noch voraus sein? Denn seien wir ehrlich: das Problem der
aktuellen PC`s ist sicher nicht die Leistungsf&auml;higkeit der Hardware.
Eine Integration derselben, unter effizienter Ausnutzung mit einem
verbesserten Amiga-OS, das &uuml;bergangsweise komplett portiert wird, das
w&auml;re eine schnellere und vor allen Dingen greifbarere L&ouml;sung gewesen.
</P><P><B>Denn was bleibt</B> nach den derzeitigen Vorstellungen eigentlich noch vom
Amiga, au&szlig;er dem Namen?</P><P>
Nichts! Total neue Hardware und ein total neues, nicht r&uuml;ckw&auml;rtskompatibles
OS ohne irgendwelche &quot;Amiga&quot;-Software lassen vom Amiga nichts mehr bestehen.
Vielleicht wird es, wenn er denn erscheint, einen Markt f&uuml;r einen solchen
Computer geben; vielleicht wird es eine gelungene Entwickung sein, aber
mit Sicherheit ist es kein Amiga, egal welche Bezeichnung raufgepappt wird.
</P><P><B>Ein Gutes</B> hat die Sache: Phase 5 und Haage&Partner haben sich am Rande
der Messe darauf geeinigt, ihren Zwist zu beenden und die Anstrengungen
zu b&uuml;ndeln.  Zusammen will man einen auf dem PPC basierenden Amiga-
kompatiblen Rechner herausbringen, angeblich noch in diesem Jahr.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="web_adv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../sw/9806yam.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
