<HTML>
<HEAD>
<TITLE>Titel</TITLE>
</HEAD>
<BODY bgcolor=white text=black background="l_bg.gif">
<TABLE BORDER=0>
<TR>
<TD width=110 background="verlauf.png" colspan=1 align=left rowspan=2 valign=top>
<UL><LI><A HREF=#warum>Warum?</A><LI><A HREF=#story>Die Story</A><BR><LI><A HREF=#spiel>Spielprinzip</A><BR><LI><A HREF=#grafik>Die Grafik</A><BR><LI><A HREF=#anim>Anim</A><BR><LI><A HREF=#sound>Sound</A><BR><LI><A HREF=#game>Spielspa&szlig;!</A><BR><LI><A HREF=#wertung>Wertung</A><BR><LI><A HREF=#technik>Die Technik</A><BR><LI><A HREF=#laden>Bezugs Quelle</A><BR><LI><A HREF=#cheat>Cheats</A><BR><LI><A HREF=#ende>Zum Schlu&szlig;</A><BR></UL>
</TD>
<TD>
<IMG SRC="o.gif" ALT="O" width=51 height=55 align=left>
<FONT SIZE=4 FACE="Times" Color=#000000>LDIES but Goldies...ja ja, fr&uuml;her war alles besser. Auch die Spiele. Und da das so ist, m&ouml;chte ich an dieser Stelle ab und zu ein besonders gutes Spiel vorstellen, da&szlig; einige bestimmt noch kennen m&ouml;gen. Die besten Spiele stammen ja aus der Zeit vor `94, als die gro&szlig;en Spielefirmen noch f&uuml;r den Amiga programmiert haben. Eins dieser Spiele ist...<BR></FONT>
</TD>
</TR>
<TR >
<TD>
<BIG><CENTER><IMG SRC="Neu.gif" width=60 height=25 alt="Neu" BORDER=0>Microcosm<IMG SRC="Neu.gif" width=60 height=25 alt="Neu" BORDER=0></CENTER></BIG><BR>
<CENTER><IMG SRC="balken.png" width=450 height=11 alt="" border=0></CENTER><BR>
<CENTER><U>Warum?</U></CENTER><BR>
Naja, in letzter Zeit erscheinen zwar schon einige gute Spiele, aber die Neuerscheinungen sind eben nicht so haufig. Und da sicher viele von euch recht fr&uuml;h zum AMIGA gekommen sind, dachte ich mir man k&ouml;nnte ja mal ein par gute Spiele aus der alten Zeit vorstellen. Ihr habt doch sicher Zuhause auch noch ein par gute Spiele rumliegen oder?<BR>Ich denke da so zum Beispiel an<UL><LI>Another World (Ich denke das nehme ich als n&auml;chstes.)<LI>Dungeon Master<LI>Populus<LI>Mega-Lo-Mania<LI>Prey<LI>Pirates! Gold<LI>Hunter<LI>Gods<LI>Prince of Persia...<BR></UL>Oh Mann, da gerate ich ja richtig ins Schw&auml;rmen. Diese Spiele waren teilweise so genial! Also wenn du noch was gutes hast, stell es vor.<BR>Du kanns schlie&szlig;lich auch irgendwann mal was schreiben, nicht immer nur zulesen. <BR>Aber jetzt (hoffentlich!) viel Spa&szlig; mit diesem Test:<HR width=90% noshade size=2>
<CENTER><U>Story</U></CENTER><BR>Das Spiel spielt auf dem fernen Planeten Bodor, ein &uuml;berbesiedelter verseuchter Planet im Bator-System. Wir schreiben das Jahr 2051...<BR>Die Bev&ouml;lkerung wird zusehends von den gro&szlig;en Industriekonzernen beherscht und ausgebeutet. 82% der Menschen dr&auml;ngen sich auf 2% der Landfl&auml;che zusammen, in Slums in denen Verbrechen, Armut und Krankheiten vorherschen.<BR>Das restliche Land w&auml;hre zwar bewohnbar, doch die herschenden Unternehmen wollen die Bodensch&auml;tze abbauen, und verhindern deshalb die Besiedlung. F&uuml;r die wenigen Auserw&auml;hlten bietet Bodor einen hervoragenden Hintergrund f&uuml;r st&auml;ndige dunkle Machenschaften, und falls dies notwendig w&auml;hre k&ouml;nnten sie jederzeit auf fremde Planeten entkommen. Die breite Bev&ouml;lkerung ist hier jedoch zu einem h&ouml;llischem Leben verdammt, mit nur wenig Schutz gegen die t&ouml;dlichen Ga&szlig;e, denen die mei&szlig;ten hier beinahe st&auml;ndig ausgesetzt sind. An den herschenden Tyrannen vorbei gibt es keine Garantie auf Arbeit, ja noch nicht einmal auf ihr ohnehin elendes Leben...<P></P>In diesem feindlichen Klima k&auml;mpfen zwei gigantische Unternehmen und den ersten Rang, mit der ehrenvollen Bezeichnung "Corp 1". Dieser Kleinkrieg zwischen Cybertech Inc. und Axiom steht schon lange im Mittelpunkt der &ouml;ffentlichen Aufmerksamkeit. Dabei wollte Cybertech diesen Krieg &uuml;berhaupt nicht, sie wurden darin verwickelt, einfach weil sie Corp1 waren...<P></P>Axiom seinerseits h&auml;lt Cybertech f&uuml;r Schuld am Tod ihres fr&uuml;heren Pr&auml;sidenten, obwohl man nie Beweise fand. Um ihren derzeitigen Pr&auml;sidenten aus dem Wege zu r&auml;umen l&auml;&szlig;t Argen Star, der Pr&auml;sident von Axiom, ihm ein hochwirksames Gift spritzen. Es liegt nun an dir s&auml;mtliche Giftkapseln und die Viren im Pr&auml;sidenten zu vernichten, ehe er ummkommt. Zu diesem Zweck wirst du mit deinem Raumschiff auf Blutk&ouml;rperchen-Gr&ouml;&szlig;e geschrumpft, und ihm ebenfalls injeziert. Die Schlacht kann beginnen...<BR>
<CENTER><IMG SRC="line.png" width=400 height=11 alt="" border=0></CENTER><BR>
<A NAME="spiel"></A>
<CENTER><U>Spielprinzip</U></CENTER><BR>
Microcosm ist ein Ballerspiel &auml;hnlich R-Type, nur da&szlig; du hier halt alles 3-dimensional siehst. Ein neueres Spiel dieser Art ist Wendetta, wobei die Wendetta-Grafiken sich mei&szlig;tens wiederholen, und weniger vorberechnet ist. Bei Microcosm z&auml;hlt nur der schnelle Finger am Abzug. Statt Raumschiffen werden hier fiese Viren abgeballert, und das Ziel ist es alle Giftkapseln und den Obervirus zu erledigen. Also vom Prinzip her ein typisches Ballerspiel, aber sehr gut gemacht.<BR>
<CENTER><IMG SRC="line.png" width=400 height=11 alt="" border=0></CENTER><BR>
<A name="grafik"></A>
<CENTER><U>Grafik</U></CENTER><BR>
Die Grafik im Spiel ist hervorragend! F&uuml;r ein Amiga-Spiel sind das Intro und die getraceten Sequenzen (leider) immer noch einzigartig, und das, obwohl das Spiel nun schon &auml;lter als 4 Jahre ist. Statt einem billigen Intro haben die Macher die Story in einen kleinen 8-min&uuml;tigen Film gepackt, der Automatisch abl&auml;uft. Teile davon sind gerendert, Teile sind aufgenommene Filmsequenzen. Klasse!<BR>Dazu ist der ganze Flug in den Venen gerendert, ebenso alle Feinde. Wer auf Grafik steht der sollte sich das echt mal ansehen!<BR>
<CENTER><IMG SRC="line.png" width=400 height=11 alt="" border=0></CENTER><BR>
<A NAME="anim"></A>
<CENTER><U>Animationen</U></CENTER><BR>
Die Animationen im Spiel sind allesamt gerendert, und mit sogar mit kleinen Filmst&uuml;cken aufgewertet. Erstellt wurden diese ganzen Grafiken warscheinlich mit SGIs, und ablgelegt auf der CD wurden sie in einem CDXL Format, das nur die Daten enth&auml;lt. Es kann also mit CDGSXL nichts von der CD gelesen werden :(. Comodore hatte dieses AnimFormat damals entwickelt, damit die Sequenzen mit 300 kb/sec. fl&uuml;&szlig;ig vom CD남 abgespielt werden konnten. Im Aminet gibt es auch ein par Animationen in diesem Format. Jedenfalls laufen alle Anims wahnsinnig fl&uuml;&szlig;ig, und dabei mu&szlig;t du immer bedenken, die Anforderungen waren ein 020`er mit 2MB Ram!<BR>
<CENTER><IMG SRC="line.png" width=400 height=11 alt="" border=0></CENTER><BR>
<A name="sound"></A>
<CENTER><U>Sound</U></CENTER><BR>
Der Sound im Spiel geht Haupts&auml;chlich in Richtung Techno, aber die hammerharte Musik kann echt gefallen. Immerhin handelt es sich bei dem Spiel ja um ein Action-Game, da w&auml;hre eine andere Richtung fehl am Platze. Laut Credits ist f&uuml;r die Musik Kevin Collier verantwortlich, doch als externer Mitarbeiter hat Rike Wakeman die meisten Sounds erstellt. Vileicht kennen die &auml;lteren unter euch ihn noch als Yes-Bandmitglied, doch das ist schon einige Jahrzehnte her. Jedenfalls past die Musik herrlich zum Geschehen, und wurde wie die Grafik komplett vorkomponiert, also nix mit Piept&ouml;nen oder &auml;hnlichem.<BR>
<CENTER><IMG SRC="line.png" width=400 height=11 alt="" border=0></CENTER><BR>
<A name="game"></A>
<CENTER><U>Das wichtigste: Spielspa&szlig;!</U></CENTER><BR>
Obwohl es sich bei Microcosm im Grunde um ein simples Action-Spiel handelt, wei&szlig; es doch erstaunlich lange zu gefallen. Vor allem die Grafik- und Sound-Fetischissten unter euch werden an Microcosm ihre helle Freude haben. Was noch zu erw&auml;hnen w&auml;hre:<BR>Der Schwierigkeitsgrad ist ohne Cheat knallhart! Ich bin nicht gerade der gro&szlig;e Zockerk&ouml;nig, und so hab ich noch nicht mal das erste Level geschafft. Peinlich, peinlich...<BR>Aber wenn es dir gef&auml;llt jeden Level auswendig zu lernen, und dein Joypad umzubringen, dann ist Microcosm das richtige f&uuml;r dich.<BR>
<CENTER><IMG SRC="line.png" width=400 height=11 alt="" border=0></CENTER><BR>
<A NAME="wertung"></A>
<CENTER>
<TABLE border=1 align=center valign=center>
<TR bgcolor=#000000>
<TH colspan=2 Nowrap>
<font color=#FFFF00>Wertungskasten:</FONT>
</TD>
</TR>
<TR bgcolor=#FFFFFF>
<TD><FONT COLOR=#000000>Grafik:</FONT></TD>
<TD><FONT COLOR=#000000>85%</FONT></TD>
</TR>
<TR bgcolor=#FFFFFF>
<TD><FONT COLOR=#000000>Sound:</FONT></TD>
<TD><FONT COLOR=#000000>87%</FONT></TD>
</TR>
<TR bgcolor=#FFFFFF>
<TD><FONT COLOR=#000000>Gameplay:</FONT></TD>
<TD><FONT COLOR=#000000>70%</FONT></TD>
</TR>
<TR bgcolor=#FFFFFF><TD><FONT COLOR=#000000>Motivation:</FONT></TD><TD><FONT COLOR=#000000>69%</FONT></TD></TR>
<TR bgcolor=#FFFFFF><TD><FONT COLOR=#000000>Gesamt:</FONT></TD><TD><FONT COLOR=#000000>82%</FONT></TD></TR>
<TR bgcolor=#FFFFFF><TD><FONT COLOR=#000000>Fazit:</FONT></TD><TD><FONT COLOR=#000000>Klasse Spiel mit super Grafik,<BR>aber leider schwer wie Schei&szlig;e!</FONT></TD></TR>
</TABLE></CENTER>
<FONT COLOR=#FF0000>
Als kleines Extra-Schmankerl habe ich &uuml;brigens noch einen zweiten Wertungskasten erstellt (Buhh!!!), aber einen besonderen (Juhhuu!!!). Die AG-Leser unter euch werden sicher diese alten aber h&uuml;bschen Wertungsk&auml;sten kennen (Roter Streifen). Na ja, lange Rede kurzer Sinn, klick doch einfach mal <A HREF="agtable.html">hier</A>. Am besten sieht er mit Voyager aus!<BR>
</FONT>
<CENTER><IMG SRC="line.png" width=400 height=11 alt="" border=0></CENTER><BR>
<A name="technik"></a>
<CENTER><U>Technische Details</U></CENTER><BR>
<U><FONT COLOR=#FFFF00>Anforderungen:</FONT></U><BR>
Dieses Spiel wurde urspr&uuml;nglich f&uuml;r das CD남 entwickelt, und l&auml;uft daher schon auf einem unbeschleunigtem A1200 mit Doublespeed Laufwerk an. Eine Empfehlung der Hardware kann ich nicht angeben, es sollte eigentlich &uuml;berall fl&uuml;&szlig;ig laufen. Es gibt allerdings etwas zu beachten:<BR>
Erstens l&auml;uft dieses Spiel nur mit einem CD남 Emulator (z.b. aus dem IDE-Fix oder Squirrel Package), und zweitens sollte man f&uuml;r besseres Spielen ein Joypad der Konsole sein eigen nennen. Ein Joystick reicht zwar meistens auch schon, aber Karte und Waffenwechsel wird dan umst&auml;ndlicher.<BR>
Noch was f&uuml;r Besitzer von sehr schnellen Laufwerken (<12 fach):<BR>
Es k&ouml;nnte n&ouml;tig sein, da&szlig; ihr das Laufwerk drosselt (z.b. mit Setatapispeed) damit es nicht mehr so schnell l&auml;uft. Andernfalls f&auml;ngt das Spiel beim Laden an zu ruckeln. H&ouml;rt sich konfus an? Ist es aber nicht!<BR>
Ein schnelles ATAPI-Laufwerk kann schon mal die gesamte CPU-Zeit eines 040`ers auffressen. Beim nachladen der Animationen ist also nicht mehr genug Power vorhanden, um sie abzuspielen. Ein 2 x Laufwerk hat diese Probleme nicht...<BR>
<U>Emulatoren:</U><BR>
Ich benutze den Emulator aus dem IDE-Fix Packet. Es l&auml;uft alles ohne Probleme, und das Joypad emuliert er auch noch gleich. Allerdings kann es zu Problemen mit Sony Laufwerken kommen. Mein 4 x Drive CDU77e lief mit Microcosm nicht zusammen, das Smart 100x lief mit obigen Einschr&auml;nkungen problemlos. Dieses Laufwerk ist meines Wissens auch in den Towerumbauten von Vesalia (Winner) vorhanden.<BR>
Empfohlen wurde mir von <A HREF="mitglieder/Hagen.html">Higgins</A> der Emulator der dem Squirrel Controller beiliegt, dessen Qualit&auml;t ich aber nicht testen konnte.
<CENTER><IMG SRC="line.png" width=400 height=11 alt="" border=0></CENTER><BR>
<A name="laden"></A>
<CENTER><U>Bezugsquellen:</U></CENTER><BR>
Da dieses Spiel nun schon gute 4 Jahre auf dem Buckel hat (es ist trotzdem gut!) ist es nat&uuml;rlich nicht mehr im Handel erh&auml;ltlich. Wenn die Sterne gut stehen &uuml;berlegt sich vileicht irgendein H&auml;ndler eine Neuauflage, bis dahin ist es nur gebraucht zu haben. Ihr k&ouml;nnt also diverse Kleinanzeigen durchforsten oder selber aufgeben, oder ihr fragt bei einem H&auml;ndler nach. Ich habe meine Version (gebraucht) von <A HREF="mailto:ALL-Systems@Datatype.Capella.de">"ALL SYSTEMS, Digital Ideas and Services"</A>, also von <A HREF="mitglieder/Hagen.html">Cord Hagen</A>. Gekostet hat es inklusive Nachnahme + Versand genau 52,- DM. Ach ja, f&uuml;r PC hat er es noch vorr&auml;tig. Bevor ihr jetzt denkt, ich will Werbung f&uuml;r den PC machen oder &auml;hnliches, sei gesagt, da&szlig; die PC-Version schlechter als die CD남 Version ist, und angeblich sogar auf einem 486` noch ruckelt.<BR>
<CENTER><IMG SRC="line.png" width=400 height=11 alt="" border=0></CENTER><BR>
<A name="cheat"></A>
<CENTER><U>Cheats:</U></CENTER><BR>
Ich konnte leider nicht alle Cheats selber ausprobieren, da ich NOCH kein CD남 Joypad besitze. Ich habe trozdem alle aufgelistet, die ich finden konnte.<OL>
<LI>Geht w&auml;hrend des Spiels in den Pausenmodus, und dr&uuml;ckt einen Knopf. Sucht euch die Sequenz von Kn&ouml;pfen heraus, die nur hohe T&ouml;ne ergibt, und versucht sie zuende zu bringen. Kennt ihr Simon? So in etwa l&auml;uft das! Wenn ihr fertig seid ert&ouml;nt ein Tusch, und du bist unverwundbar. Als Preis gehen allerdings die Animationen drauf, sie sind jetzt nur noch Schwarz-weis.<BR>
F&uuml;r alle, die keine Lust auf Kn&ouml;pfchen dr&uuml;cken haben, habe ich hier alle 4 Sequenzen aufgelistet:<BR>
<TABLE border=1><TR width=100% bgcolor=#000000><TD><FONT COLOR=#FFFFFF size=+1>1:</FONT></TD><TD><IMG SRC="gruen.png" border=0 width=18 height=19 alt=""><IMG SRC="rot.png" border=0 width=18 height=19 alt=""><IMG SRC="gelb.png" border=0 width=18 height=19 alt=""><IMG SRC="blau.png" border=0 width=18 height=19 alt=""><IMG SRC="gelb.png" border=0 width=18 height=19 alt=""><IMG SRC="unten.png" width=16 height=38 alt="" border=0><IMG SRC="gruen.png" border=0 width=18 height=19 alt=""><IMG SRC="rechts.png" width=38 height=16 alt="" border=0><IMG SRC="blau.png" border=0 width=18 height=19 alt=""><IMG SRC="oben.png" width=16 height=38 alt="" border=0></TD></TR><TR width=100% bgcolor=#000000><TD><FONT COLOR=#FFFFFF size=+1>2:</FONT></TD><TD><IMG SRC="blau.png" border=0 width=18 height=19 alt=""><IMG SRC="gruen.png" border=0 width=18 height=19 alt=""><IMG SRC="rot.png" border=0 width=18 height=19 alt=""><IMG SRC="gelb.png" border=0 width=18 height=19 alt=""><IMG SRC="unten.png" width=16 height=38 alt="" border=0><IMG SRC="unten.png" width=16 height=38 alt="" border=0><IMG SRC="rot.png" border=0 width=18 height=19 alt=""><IMG SRC="unten.png" width=16 height=38 alt="" border=0><IMG SRC="rechts.png" width=38 height=16 alt="" border=0><IMG SRC="rot.png" border=0 width=18 height=19 alt=""></TD></TR><TR bgcolor=#000000 width=100%><TD><FONT COLOR=#FFFFFF size=+1>3:</FONT></TD><TD><IMG SRC="gelb.png" border=0 width=18 height=19 alt=""><IMG SRC="blau.png" border=0 width=18 height=19 alt=""><IMG SRC="gruen.png" border=0 width=18 height=19 alt=""><IMG SRC="rot.png" border=0 width=18 height=19 alt=""><IMG SRC="oben.png" width=16 height=38 alt="" border=0><IMG SRC="links.png" width=38 height=16 alt="" border=0></TD></TR><TR width=100% bgcolor=#000000><TD><FONT COLOR=#FFFFFF size=+1>4:</FONT></TD><TD><IMG SRC="rot.png" border=0 width=18 height=19 alt=""><IMG SRC="gelb.png" border=0 width=18 height=19 alt=""><IMG SRC="blau.png" border=0 width=18 height=19 alt=""><IMG SRC="gruen.png" border=0 width=18 height=19 alt=""><IMG SRC="rot.png" border=0 width=18 height=19 alt=""><IMG SRC="links.png" width=38 height=16 alt="" border=0></TD></TR></TABLE>
<LI>Wenn du am Anfang (beim Logo) den gr&uuml;nen Knopf dr&uuml;ckst wird das Intro auf Fulscreen vergr&ouml;&szlig;ert. Dabei wird es zwar ein wenig pixelig, aber es sieht immer noch ganz gut aus. Au&szlig;erdem h&ouml;rst du dann Techno-Musik statt den Soundeffekten.<BR>
<LI>Wenn du in der POD-Basis ankommst solltest du nach links dr&uuml;cken, bis du zur Kreuzung kommst. Dann sollen angeblich alle Maps auf dem Kopf stehen.
<LI>Wenn du bei der ersten Zwischensequenz bist, solltest du Pause dr&uuml;cken, und dann alle Kn&ouml;pfe bis auf Pause. Wenn du dabei das Steuerkreuz entgegen dem Uhrzeigersinn drehst, solltest du einen Tusch h&ouml;ren, und unverwundbar sein. Angeblich sollen dabei sogar die Filmsequenzen in Farbe bleiben.
<LI>Bei einigen Kopien der CD soll angeblich Track 2 ungenutzte Musik enthalten. Einfach mal ausprobieren!
</OL>
<HR color=#00FFFF width=80% size=1 noshade>
<A name="ende"></A>Hoffe, da&szlig; (mit &szlig;!) euch dieser Test gefallen hat, n&auml;chsten Monat gibt es wieder einen. Dann h&ouml;chstwarscheinlich von...n&auml;chsten Monat O.K? Ich mu&szlig; mir noch was raussuchen. Verbesserungsvorschl&auml;ge nehme ich auch gerne an!<BR>Du hast doch sicher auch noch ein altes Spiel zu Hause rumliegen, von dem du denks, da&szlig; es klasse ist, oder? W&uuml;rde mich freuen, wenn du auch einen Test schreiben w&uuml;rdest. Bye bye...<BR><CENTER><A HREF="mitglieder/castro.html"><IMG SRC="thesaint.gif" width=142 height=51 alt="The Saint" border=4></A></CENTER><BR><CENTER><FONT SIZE=-6 color=#000000>Markus Castro</FONT></CENTER><A HREF="NoCover.html"><BIG>Inhalt der NoCover 56</BIG></A><BR></TD></TR></TABLE></BODY></HTML>