<HTML>
<HEAD>
<TITLE>APC & TCP</TITLE>
</HEAD>
<BODY background="r.w_hg.jpg" TEXT="#000000" LINK="#0000ff"
<VLINK="#800080" BGCOLOR="#ffffff">
<FONT SIZE=4 COLOR="#888888">
<CENTER><h1><font color="#ff55ff">R I C K Y - W.........P R O B L E M E C K E
</h1>
<HR>
</CENTER>
<font color="#000000">
<H2>

Ich habe mal wieder Probleme und kann sie nicht alleine L&#246;sen und darum bin
ich auf Eure Hilfe angewiesen . Ich habe eine Liste angefertigt und gehe sie dann
einzeln durch.
<BR><HR>
<UL><font color ="#0000ff">
<LI>Fehlermeldung beim Hochfahren!
<LI>Handbuch Blitz Basic
<LI>Raytracing mit Maxon Cinema 4D
<LI>Musik auf CD's brennen
</UL>
<br><HR>
< font color="#ff0000">
Fehlermeldung:<BR><font color ="#000000">
Wenn ich meinen Rechner ( System siehe ganz unten ) hochfahre, erscheint mir
stets dieselbe Fehlermeldung, nur ab und zu &#228;ndert sich die Nummer. Es 
erscheint ein Fenster mit dem Inhalt :<BR><font color ="#880000">
&quot;Programmfehler : #00000004 ist eingetragen<BR>
 Verursacher war : Fehler in EXEC !<BR>
 Es handelt sich um einen Recovery Alert !<BR>< font color ="#000000">
Im C Verzeichnis fand ich eine Schublade mit dem Namen EXEC und deren Inhalt 
ist :<BR><font color="#ff0000">
alerts.h - device.h - errors.h - exec.h - execbase.h - initializer.h - interrupts.h - io.h - 
libraries.h !<BR><font color="#000000">
Im User-Startup beim MUI ist auch der Namen EXEC vorhanden, vielleicht 
k&#246;nnt ihr mit diesen Angaben was anfangen und mir helfen .
Kann es sein da MUI SHAREWARE ist und ich noch nicht mich angemeldet habe 
,diesen Bl&#246;dsinn verursacht, da alles normal l&#228;uft, nur beim Hochfahren 
es erscheint und l&#228;stig ist.<BR><HR><font color ="#ff0000">
  Handbuch f&#252;r Blitz Basic:<br><font color ="#000000">
Ich habe mir die CD Blitz Basic gekauft, da ich in Italien lebe und meine 
Zweitsprache Italienisch ist ( ich bin ein waschechter Tiroler, also mit deutscher
 Muttersprache ), habe ich nie die M&#246;glichkeit ( Schule ) gehabt Englisch zu 
lernen.
Nun habe ich durch Andreas Etzrodt erfahren, da&#223; es ein deutsches 
Handbuch zu-s&#228;tzlich zukaufen gibt. Nun zu meiner Frage, ist da jemand der 
es hat und mir Verkaufen w&#252;rde. Ich mu&#223; noch dazu sagen, ich habe 
einige Versandh&#228;user angerufen ( Telefonnummer aus Amiga-Plus ) und
keiner konnte mir helfen, au&#223;er Eternity Hard&amp;Software bot sich an es 
f&#252;r mich aufzutreiben, aber bis jetzt ohne Erfolg, darum versuche ich es auf 
diesem Weg, sicher ist sicher oder Doppelt h&#228;lt besser .<BR><HR><font color 
="#ff0000">
Raytracing:<BR><font color="#000000">
Ich habe aus der Zeitschrift Amiga Plus die Vollversion Maxon Cinema 4D erworben
und darum habe ich kein deutsches Handbuch ( Wo habe ich so etwas schon 
gelesen ? ) . Beim Animieren habe ich meine Probleme, ich bin soweit das es mir die 
Bilder alle speichert ( aber alle einzeln ) und ich mu&#223; jedes Bild einzeln 
Aufnehmen, es m&#252;&#223;te doch einfacher gehen, sozusagen ich 
m&#246;chte das der Ball von A bis B in 10 Sekunden geht, mit einer Bildanzahl von 
15 Bilder pro Sekunde. <br>
Wie m&#252;&#223;te ich tun, besser wie w&#228;re es in der NoCover einen 
Workshop f&#252;r Schwerverstehende in Cinema 4D  ?????<BR><HR><font 
color="#ff0000">
Musik &amp; CD:<BR><font color ="#000000">
Ich m&#246;chte gerne Musik auf Cd's brennen, was brauch ich da f&#252;r Soft 
&amp; Hardware.<BR>
Was ich habe:<BR>
Amiga 1200<BR>
HD 170 MB ( in Planung SCSI-extern HD 2-4 GB )
<BR>14*CD-Rom SCSI
<BR>2, externes Diskdriver
<BR>Turbokarte Blizzard 1230 mit SCSI Controller und 16 MB sonstiges Ram
<BR>Canon Drucker
<BR>Was ich nicht m&#246;chte, ihn in einem Tower umbauen !
<BR>Also  alles klar, ich warte auf Vorschl&#228ge und  der Preis sollte 
ungef&#228;hr bei die 900 Mark ( Festplatte,CD Brenner und die Soft- und 
Hardware f&#252;r das Simplen ) liegen .
<BR>Ich hoffe ich habe mich klar genug ausgedr&#252;ckt, den wie man bei uns 
pflegt zu sagen DEUTSCHE SPRACHE, SCHWERE SPRACHE .
<BR>Und noch was
<BR><center>Tsch&#252;s</Center>
<BR><center> Euer</center>
<font color ="#Ffff00"><center> Ricky-W aus Burgstall</center>


<font color="#000000">
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639
height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
