<HTML>
<HEAD><TITLE>Heaven</TITLE></HEAD>
<BODY BGCOLOR=#0000FF text=#000000 link=#000000 alink=#FF0000 vlink=#ff00ff background="wolke.jpg">

Hier sind wir wieder mit einer neuen Ausgabe von<BR>
<TABLE border=0 bgcolor=#000000 width=390 align=center>
<TR>
<TD width=390 bgcolor=#000000><IMG SRC="taube.jpg" alt="taube" width=100 border=0 height=85><IMG SRC="himmel.gif" alt="HEAVEN" border=0 width=180 height=40><IMG SRC="taube.jpg" alt="Taube" width=100 height=85 border=0></TD>
</TR>
</TABLE>
Diesmal gibt`s Meldungen f&uuml;r:<P align=center>
<A HREF=#alle><IMG SRC="boing.png" width=22 height=24 alt="O" border=0>Alle (betr. Boxen)</A><BR>
<A HREF=#rolf><IMG SRC="boing.png" width=22 height=24 alt="O" border=0>Rolf N&uuml;nninghoff</A><BR>
<A HREF=#sven><IMG SRC="boing.png" width=22 height=24 alt="O" border=0>Sven Kalus</A><BR>
<A HREF=#cord><IMG SRC="boing.png" width=22 height=24 alt="O" border=0>Cord Hagen</A><BR>
<A HREF=#ara><IMG SRC="boing.png" width=22 height=24 alt="O" border=0>Aragon</A><BR>
<A HREF=#dan><IMG SRC="boing.png" width=22 height=24 alt="O" border=0>Dany</A><BR>
<A HREF=#sax><IMG SRC="boing.png" width=22 height=24 alt="O" border=0>Sax</A><BR>
<A HREF=#top><IMG SRC="boing.png" width=22 height=24 alt="O" border=0>Top 5</A><BR>
</P>
<HR size=2 width=90% color=808080>
<A NAME="alle"></A>
<CENTER><FONT SIZE=+1><U><IMG SRC="haken.gif" width=25 height=25 alt="" border=0>An alle:</U></FONT></CENTER>
<FONT COLOR=#FF0000>Ohhh Shhhittt!!!</FONT><BR>
Das gibt`s doch wohl nicht! Da mach ich mir die M&uuml;he und schuster diese d&auml;mlichen Boxen aus ichweisnich wie vielen Tabellen zusammen, und dann sowas!<BR>
F&uuml;r alle die es immer noch nicht gecheckt haben: Der Artikel "help_boxen.html" stammt von mir. Ich dachte eigentlich, das ihr darauf kommen w&uuml;rdet, die kleinen Pfeile in der Titelleiste zu benutzen. Na gut, waren vileicht ein bischen schlecht zu sehen, blau auf schwarz...<BR>Aber da waren noch 2 Seiten, und auf der 3. mein Signum.<BR>
Das war eigentlich als ein kleiner Witz gedacht, f&uuml;r diejenigen die (wie ich) dem alten MP noch ein wenig hinterhertrauern.<BR>
Auch auf die Gefahr hin gekillt zu werden: Ich habe die Tabellen nochmal verbessert. Einfach mal <A HREF="-boxen.html">ansehen.</A> <BR>
Ach ja, noch was f&uuml;r dR.:<BR>
Die Boxen waren wirklich nur als kleiner Gag gedacht, um zu zeigen was man mit HTML alles machen kann. Also nich gleich aufregen, sondern lachen!<P></P>
<HR size=2 width=90% color=#808080>
<A name="rolf"></A>
<CENTER><U><FONT SIZE=+1><IMG SRC="haken.gif" width=25 height=25 alt="" border=0>An Rolf Nue:</FONT></U></CENTER><BR>
Ja, du hast recht. Der feurige Hintergrund war wirklich ein bischen schlecht, das geb ich zu. Aber ich hatte keinen anderen mehr gefunden, und mit AWEB konnte ich alles lesen, und naja...vergessen wir`s O.K.?<BR>&uuml;brigens, Ich weis, wer die Boxen kreirt hat. Rate mal :)<BR>
Ach ja, ich teste meine Artikel meistens mit IBrowse, weil der noch am meisten M&uuml;ll aus meinen Eigenkreationen (siehe Boxen) schluckt. Und ich finde, wenn ich die Idee habe eine Seite zu kreieren, die cool aussieht, dann versuch ich das einfach mal. Immer noch besser, als wenn da immer nur dieser Einheitsbrei in der NoCover <STRONG>W&auml;HRE</STRONG>. Ich glaub ich red zuviel. Tschau...<BR>P.S.: Nat&uuml;rlich geht die Anrede einfacher. Du darfst mich Markus nennen :=)<BR>(Wo finde ich eigentlich deine Adresse in der Mitglieder-Liste?)<BR>(Wollte dich eigentlich anrufen.)<BR>
<HR SIZE=2 width=90% color=#808080>
<A NAME="sven"></A>
<CENTER><FONT SIZE=+1><IMG SRC="haken.gif" width=25 height=25 alt="" border=0><U>An Roadrunner:</U></FONT></CENTER><BR>
Ich werd noch wahnsinnig heute! Nichts klappt, aber auch gar nichts!<BR>Ich wollte dich eigentlich anrufen, aber dieses bl&ouml;de Telefon meint nur, un ich zitiere, "kein Anschlu&szlig;...".<BR>Also entweder das ist gar nicht deine Nummer(0203/781877), oder unsere Telefone spinnen mal wieder. Na egal, solltest du bisher noch von keinem Kopien erhalten haben, ruf mich an, und ich schick sie dir. So, speichern und...SCHEI**! Heut klappt nichts!<BR>
<FONT SIZE=-1>P.S: Ich w&uuml;rd ganz gern beim Feedback Corner mitmachen. Lie&szlig;e sich das machen? Nach der neuesten Liste w&auml;hre ich wohl irgendwann im Jahr 2000 dran. Na Super!<BR></FONT>
<HR width=80% size=2 color=#808080 noshade>
<A NAME="cord"></A>
<CENTER><U><FONT SIZE=+1>Cord Hagen</FONT></U></CENTER><BR>
Na wie gehts?<BR>Ich hab mir die Progis nochmal angesehen, und eigentlich solltest du mit MakeCD von einem SCSI-Laufwerk auch CDDAImages ziehen k&ouml;nnen. Sollte da&szlig; bei dir mal nich m&ouml;glich sein, auch no Problem. Auf der Meeting Pearls IV im Dir<BR><CENTER>Pearls/CDROM/OptyCDPlayer</CENTER><BR>befindet sich ein feiner kleiner Player f&uuml;r Atapi+SCSI-Laufwerke, der au&szlig;erdem noch auf Pladde saven kann. <BR>Mu&szlig;t du nur alles richtig einstellen, und schon klappt es wunderbar. COOL!<BR>
Ich werd jetzt &uuml;brigens mal versuchen die Spiele von nem anderen Laden zu bekommen (Gr&auml;f Hard-Soft). Die ham ne ganze Menge alter Spiele noch neu vorr&auml;tig (z.B. Bloodnet AGA NEU: 10DM!).<BR>
Warum stehst du eigentlich nicht bei der AAkt in der H&auml;ndlerliste?<BR>
Kann ich eigentlich ein PC-HD Laufwerk auch ohne Squirrel oder
Buddha am Amiga benutzen? Laut HardwareListe soll doch alles au&szlig;er
Panasonic laufen?<BR>
Wu&szlig;test du eigentlich, da&szlig; es im Aminet einen Patch gibt, mit
dem man bei AT-A1200ern 1,44 MB auf ne Disk kriegt?
Das wars eigentlich. Schreib mal wieder...<BR> 
P.S.: Wegen der Workbench habe ich inzwischen einen Laden gefunden der sie ohne Handb&uuml;cher anbietet. Trotzdem danke!
<HR width=77% size=2 color=#808080 noshade>
<A NAME="ara"></A>
<CENTER><U><IMG SRC="haken.gif" width=25 height=25 alt="" border=0><FONT SIZE=+1>An Aragon:</FONT></U></CENTER><BR>
Tja, ich lese hier gerade deinen Hilferuf bez&uuml;glich dem Pr&uuml;fsummenfehler. Einen Workshop kann ich zwar auch nicht aus den Fingern sch&uuml;tteln, aber ich verstehe nicht, wie ihr immer so &uuml;ber Disksalv schimpfen k&ouml;nnt!<BR>Pa&szlig;t mal auf Leute: Da gibt es drei wesentliche Men&uuml;punkte:<OL><LI>Salvage<LI>Repair<LI>Undelete</OL>Der wichtigste der dreien ist wohl Salvage. Bei diesem Punkt ver&auml;ndert Disksalv wirklich NICHTS auf der Platte!<BR>Es versucht dann lediglich soviel wie m&ouml;glich noch zu retten, und auf eine andere Partition abzuspeichern.<BR>Der Repair-Men&uuml;Punkt sollte nur angewendet werden, wenn du die Daten bereits gerettet hast, und nun z.B. den Checksum-error abknallen willst.<BR>Allerdings wirst du hier auch eindringlich von Disksalv gewarnt, das es die Daten direkt ver&auml;ndert. Wenn du also alles richtig machst, wird dir Disksalv bestimmt keine Dateien l&ouml;schen. Mir hat es sogar schon mal eine ganze Partition gerettet, die bei ReOrg abgeschmiert ist (Work:&reg;°gª).<BR>Wollt ich nur mal gesagt haben, weil viele Leute &uuml;ber Disksalv meckern wie einst &uuml;ber den Diskdocktor (dabei hat der mir mal ne Diskette gerettet, die ich mit X-It verschl&uuml;&szlig;elt hatte!).<BR>
<HR width=75% size=2 color=#808080 noshade>
<A NAME="dan"></A>
<CENTER><U><IMG SRC="haken.gif" width=25 height=25 alt="" border=0><FONT SIZE=+1>Dany</FONT></U></CENTER><BR>
Du wolltest doch ein ein feed-back? Hier ist es:<BR>
Also ganz so d&uuml;ster wie du sehe ich den Markt zwar nicht, aber wenn du zum Apfel wechseln willst kann dich ja keiner abhalten. Mir f&auml;llt auf, da&szlig; dein Artikel ein bischen viel Werbung f&uuml;r den Mac enth&auml;lt. Da f&auml;llt mir ein:<BR>Vor Jahren gab es einen NC-Schreiberling (Stefan W.) der ebenfalls zum Mac gewandert ist (siehe NC 17), und dabei den Amiga in den h&ouml;chsten T&ouml;nen den baldigen Untergang gepriesen hat (h&auml;h&auml;h&auml;, es gibt ihn noch :)). Naja, damals war es noch nicht soweit, und ich will mal hoffen, da&szlig; es mit dem Amiga noch eine Zeit so weiter geht, bisher hatte der Amiga ja mehr Gl&uuml;ck als Verstand. Als Ver&auml;ter w&uuml;rde ich dich nicht beschimpfen, auch wenn ich es nat&uuml;rlich traurig finde, wenn sich immer mehr Leute vom Amiga abwenden. Hoffe nur, da&szlig; das jetzt nicht wieder so wird wie damals, als Stefan noch Amiga Leute mitgenommen hatte, den St&uuml;tzpunkt aufl&ouml;&szlig;te, die Sat 1 Seiten auf den Mac umstellte blablabla. Naja, viel Freude mit deinem neuem System, und ich werde noch bis zum verrecken beim Amiga bleiben!<BR>
<HR width=65% size=2 color=#808080 noshade>
<A NAME="sax"></A>
<CENTER><U><FONT SIZE=+1>An Sax:</FONT></U></CENTER><BR>
Na, wat is nu?<BR>L&auml;uft Operation S. jetzt bei dir? Wenn nicht ruf mich an, und ich schick dir die Disk Nr. 1.<BR>K&ouml;nntest du mir dann aber auch bittebitte die letzten beiden Disks schicken? Ich werd noch langsam wahnsinnig mit diesem Game, wenn ich da nicht mal langsam weiterkomme. <BR>Tschau...

<HR width=50% size=2 color=#808080 noshade>
<A NAME="top"></A>
<CENTER><FONT SIZE=+1><u><IMG SRC="haken.gif" width=25 height=25 alt="" border=0>Top 5 der NC 55:</U></CENTER><BR>
<OL>
<LI>Amiga Aktuell, Carsten Schr&ouml;der
<LI>Fenster-Welten von Jochen Lipps
<LI>AmigaMania, Jens Kretzer+Jochen Lipps
<LI>Future World, Jens Kretzer
<LI>Wurml&ouml;cher 9, Lars Philipsen
</OL>
<HR noshade size=1 width=100% color=#000000>
<CENTER><A HREF="mitglieder/castro.html"><IMG SRC="thesaint2.gif" width=142 height=51 alt="The Saint" border=0></A></CENTER><BR><CENTER><SMALL>Markus Castro</SMALL></CENTER><BR>
<A HREF="NoCover.html"><CENTER><IMG SRC="l_hauptinhalt.jpg" alt="Inhalt" border=0 width=550 height=100></CENTER><BR></A>

</BODY>
</HTML>
