<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>WolfZ</title>
</head>

<body background="st_wolfinfo.gif" TEXT=black link=blue alink=red bgcolor="#FFFFCC">
<a name="top"></a>
<p>
<center><font color="#000080" size="7"><b>Wolf's Leserbrief</b></font></center>
<br>
<ul>
<li><a href="#a1"><b>f&uuml;r Sven Kalus</a></b>
</ul></p>
<br><br><center>
<table border="6" width=90%><tr><td bgcolor="#FFFF99">
<p>
<a name="a3"><font size="+2">Gr&uuml;&szlig; Dich Sven</font></p>
<p><font size="+1">
Gehe ich recht in der Annahme, dass Du mit dem langen Absatz an mich <b><i> kein
</i></b> neues Diskussionsthema anzuregen beabsichtigst? Aus diesem Grunde werde
ich ganz kurz antworten, wobei ich nicht auf Deine Ansichten eingehen werde, ob
diese nun richtig oder falsch sind, m&ouml;ge dahingestellt bleiben. Es
st&ouml;rt mich aber gewaltig, dass Du ein Wort wie ein professioneller
Politiker aus dem Zusammenhang rei&szlig;t und noch dazu falsch geschrieben
vollkommen deplaziert interpretierst. Der langen Darstellung der Grundz&uuml;ge
des Parsismus, wo das B&ouml;se gleichgewichtig dem Guten gegen&uuml;ber
gestellt wird, r&uuml;ckbez&uuml;glich auf die Ansichten von Zarathustra als
dieser nach Indien kam, kann ich nicht ganz folgen. Denn in der christlichen
Religion wird das B&ouml;se immer mit Teufel gleichgesetzt und dieser ist im
Endergebnis <b><i> immer </i></b> der Verlierer.</font></p>
<p><font size="+1">
Als ich Deine Ausf&uuml;hrungen las, musste ich sofort an ein Treffen von
Konfuzius mit Laotse denken, als dieser seine 12 Schriften in der Bibliothek
niederlegen wollte. Laotse wollte nicht, also fing Konfuzius einfach an
&uuml;ber den Inhalt seiner Schriften zu erz&auml;hlen. Laotse unterbrach ihn
mitten in seiner Rede und sprach: &quot;Das ist mir zu ausf&uuml;hrlich. Ich
m&ouml;chte die Hauptpunkte h&ouml;ren.&quot; &quot;Die Hauptpunkte sind Liebe
und Pflicht&quot;, antwortete Konfuzius. <br> Du siehst, man kann auch mit
pr&auml;gnaten Worten das Wesentliche meist kurz beschreiben. Obwohl gerade
solche Aussagen b&uuml;cherf&uuml;llende Interpretationen zulassen. Die
Quintesenz dieser Thesen war: Im innersten Herzen alle Wesen ohne Selbstsucht zu
lieben. Laotse hatte diesen Inhalt &uuml;bernommen und seine
Lehrt&auml;tigkeiten eingestellt. </font></p>
<p><font size="+1">
Du beginnst Deine Zeilen an mich mit den Worten, dass Du nicht bibelfest seiest,
sondern nur die Offenbarung Johannes kennen w&uuml;rdest. Das stimmt aber
vordergr&uuml;ndig gesehen nicht ganz mit Deiner Argumentation 
&uuml;berein. Offenbarung kommt von dem griechischen Wort <i> apocalypsis </i>
und Johannes versucht zu beschreiben, wie das derzeitige (damals !!)
schreckliche Zeitalter der Menschengeschichte durch Gott &uuml;berwunden wurde,
der dann eine neue &Auml;ra schuf, aus dem das B&ouml;se verbannt war (nach
&Ouml;ffnung der sieben Siegel). Diese apokalyptischen Visionen wurden noch
vielen bekannten Gestalten der Bibel zugeschrieben, so Adam, Abraham, Mose,
Ezechiel, Daniel, Jesaja, Esra und anderen. Johannes (nicht identisch mit dem
Apostel Johannes) hatte sich damit intensiv befasst und wurde deshalb von Kaiser
Domitian (81-96) auf die kleine griechische Insel Patmos verbannt.</p>
<p><font size="+1">
In Deinem Schlusssatz gibst Du kund, dass Du weiterhin &uuml;ber Religion reden
m&ouml;chtest. Ich bin da der falsche Ansprechpartner. Wenn es aber um
geschichtsm&auml;&szlig;ige Fakten &uuml;ber die Religionsstifter Moses, Jesus,
Mohamed, Zarathustra, Buddha, Konfuzius und Laotse geht, kann ich
einigerma&szlig;en noch mithalten und mitreden, obwohl seit meiner damaligen
&quot;Forschungsphase&quot; ca. 40 Jahre vergangen sind. Aber auch &uuml;ber den
Antichrist in der Buchmalerei (Hortus deliciarum der Herrad von Landsberg) oder
als Begr&uuml;ndung der Prophezeiung der &Auml;btissin Joachim v. Fiore
k&ouml;nnte ich Dir wohl noch manches sagen, aber nicht über Religion als
Religion. </font></p>
<p><font size="+1">
Sven tue mir bitte einen Gefallen, definiere Bill Gates als was Du willst, bitte
aber nicht als Antichrist. Ganz eng gesehen, k&ouml;nnte dies sogar eine
Beleidigung sein und als &uuml;ble Nachrede klassifiziert werden. Um dem zu
entgehen, musst Du Deine S&auml;tze schon in die &quot;ich w&uuml;rde
sagen&quot; Form setzen.</font></p>
<p><font size="+1">
Jetzt schreibe ich doch noch einen Nachsatz. Mir ließ Deine Bemerkung &uuml;ber
einen indischen Tempel des B&ouml;sen keine Ruhe. Das m&uuml;&szlig;te also ein
Guru, eine Sekte oder etwas in dieser Richtung nicht älter als 2000 Jahre sein.
Denn das Wort Tempel kommt aus dem R&ouml;mischen und definiert nichtchristliche
Kultbauten. Indische Kultst&auml;tten &auml;lterer Natur heißen Thupa oder Stupa
(aus dem Sanskrit) und waren Kultst&auml;tten, die auf den Reliquienschreinen
errichtet wurden. Sp&auml;ter nannte man sie Pagoden. Neben den heute
g&uuml;ltigen sechs großen Religionen kenne ich in Indien nur drei kleinere von
wirklich untergeordneter Bedeutung, die aber kastenbezogen ihre Berechtigung
haben. Das sind die ReligionenDschainas, der Sikhs und der Parsen. Dem
B&ouml;sen wird hier aber nicht gehuldigt. Und im Hinduismus, der einzigen
Religion ohne zentrale Authorit&auml;t und ohne einer erkennbaren Hierarchie,
kenne ich keine Gottheit und keinen D&auml;mon, wodurch das B&ouml;se
verk&ouml;rpert wird. Einzig Schiwa als Zerstörer und seine Frau, die viele
Formen hat (als Uma voll weiblicher Grazie, als Durga wild und als Kali
blutrünstig) stehen gegen die Güte von Brahma und Wischnu. Aber ich habe bisher
in keiner Andeutung etwas über einen Kult des B&ouml;sen gelesen.</font></p>
<p><font size="+1">
Meine Ausführungen sind nun aber doch viel umfangreicher ausgefallen, als
urspr&uuml;nglich geplant. Vielleicht ist Dir aber nun klargeworden, warum ich
mich auf Deinen Artikel &quot;Hass&quot; gemeldet hatte und akzeptierst meine
ethische Einstellung. Und hiermit beende ich auch meine Stellungsnahme zu diesem
Thema.<br> Lasse es Dir gut gehen.</font></p>
<p><font size="2"> Gehe &#160; <a href="#top"> zum Anfang</a></font></p>
</td></tr></table><br>
<table border="6" width=90%><tr><td bgcolor="#FFFF99">
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="-1">
Homepage 1: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
</font> &#160; &#160; &#160; <font size="-1"> Homepage 2: kommt noch </font>
<br>
<center>
<a href="NoCover.html"> <img border=0 src="l_hauptinhalt.jpg" width=495 height=75></a>
</center>
</body>
</html>

