<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Bergische Kaffeetafel</title>
</head>

<body background="st_bergland.jpg" TEXT=black link=blue alink=red bgcolor="#FFFFCC">
<br>
<center><font color="#000080" size="7"><b>Bergische Kaffeetafel</b></font><br>
<font color="#000080" size="5"><b>mehr als eine Mahlzeit!</b></font></center>
<blockquote>
<p>
Kaffee zu trinken, ist an sich heutzutage nichts Au&#223;ergew&#246;hnliches,
selbst dann nicht, wenn zum Kaffee allerlei ausgew&#228;hltes Geb&#228;ck
gereicht wird. Ganz anders verh&#228;lt es sich mit der &quot;Bergischen
Kaffeetafel&quot;, der bekanntesten kulinarischen Spezialit&#228;t des
Bergischen Landes. Nicht nur ihre Zusammensetzung macht sie zu etwas Besonderem.
Wie kaum eine andere Mahlzeit stellt sie, indem sie bergische Geschichte und
bergische Wesensart gleicherma&#223;en spiegelt, die Essenz eines Landes dar.</p>
<p>
Darum handelt es sich auch nicht um eine beliebige PR-Ma&#223;nahme, wenn die
Tourist-Information Rheinisch Bergischer Kreis sich das Ziel setzt, den
ortsunkundigen Reisenden mit dieser Landesspezialit&#228;t vertraut zu machen.
Das &quot;Bergische&quot; soll vielmehr in seiner unverwechselbaren Eigenart
erfahrbar werden - und das geht nun mal am besten auf dem Weg &#252;ber die
&quot;Bergische Kaffeetafel&quot;.</p>
<p>
Dies &quot;Kaffedrenken met allem dr&#246;m on draan&quot; unterscheidet sich
zun&#228;chst einmal durch die Zusammenstellung von allen vergleichbaren
Mahlzeiten. Auf einer typischen Kaffeetafel findet man Hefeplatz mit und ohne
Rosinen. Schwarz- und Graubrot. s&#252;&#223;en Brotaufstrich in Form von Honig,
Birnen-, Apfel- oder R&#252;benkraut, Butter, Quark, K&#228;se, Wurst und
Schinken, Zwieback mit und ohne Zuckerguss und Sandkuchen sowie Milchreis mit
Zucker und Zimt, backfrischen Waffeln nebst hei&#223;en Sauerkirschen und
manchmal sogar noch R&#252;hrei. Das Angebot variiert im einzelnen, nur am
folgenden l&#228;&#223;t sich nicht r&#252;tteln. Reichlich muss es sein, und
Reis, Waffeln, Quark, verschiedene Sorten Brot und Aufstrich sowie Kaffee
d&#252;rfen auf keinen Fall fehlen.</p>
<p>
<img src="st_bergland1.jpg" width=194 height=332 border=0 hspace=10 vspace=0 align="left">
Wenn es ganz stilecht zugeht, flie&#223;t das belebende Getr&#228;nk aus dem
Zapfh&#228;hnchen einer zinnernen Kaffeekanne, einer
&quot;Dr&#246;ppelminna&quot;, deren Name an die Zeiten erinnert, in denen
Filtereins&#228;tze noch nicht in Gebrauch und demzufolge die H&#228;hnchen
nicht selten mit Kaffeesatz verstopft waren, was wiederum dazu f&#252;hrte, dass
der Kaffee nur &quot;tr&#246;pfchenweise&quot; zu entnehmen war.</p>
<p>
Auffallend ist bei alledem die Schlichtheit der einzelnen Ingredienzen auf der
einen Seite, die &quot;inhaltsschwere&quot; &#220;ppigkeit sowie die etwas
befremdliche Zusammenstellung auf der anderen Seite. W&#228;hrend die
Schlichtheit der &#252;ber Jahrhunderte herrschenden Armut in dieser
b&#228;uerlich gepr&#228;gten Region entspricht, l&#228;sst die &#220;ppigkeit
R&#252;ckschl&#252;sse auf die Gastfreundschaft der Menschen des Bergischen zu.
Sogar die meisten der selbst erzeugten argrarischen Produkte konnte man sich nur
zu besonderen Anl&#228;ssen leisten. dann n&#228;mlich, wenn Familienfeiern ins
Haus standen oder wenn G&#228;ste erwartet wurden.</p>
<p>
Denen bot man alsbald auch jeden neuen &quot;exotischen&quot; Genuss, der
infolge der Handelsbeziehunggen des Bergisbchen Landes zu den Niederlanden wie
infolge bescheidenen Wirtschaftswachstum im Zuge der Industrialisierung im
letzten Jahrhundert erreichbar wurde.</p>
<p>
Reis und Kaffee, echter Bohnenkaffee wohlgemerkt, avancierten damit in der Mitte
des 19. Jahrhunderts zu festen Bestandteilen jeder Verk&#246;stigung, die man
Freunden, Bekannten und lieben G&#228;sten schlechthin angedeihen lie&#223;.</p>
<p>
<img src="st_bergland2.jpg" width=191 height=179 border=0 hspace=8 vspace=0 align="right">
Den Namen &quot;Bergische Kaffeetafel&quot; erhielt diese Art Mahlzeit jedoch
erst in den drei&#223;iger Jahren unseres Jahrhunderts. Erst als man begann,
Familienfeiern auch au&#223;er Haus, in Restaurants und Gastst&#228;tten, zu
feiern, als zudem verbesserte Verkehrsanbindungen fremde Reisende ins Land
brachten, sah man sich gezwungen, das, was in Jahrhunderten gewachsen, was
selbstverst&#228;ndlich, vertraut und deshalb namenlos war, zu benennen. </p>
<p>
Inzwischen ist die &quot;bergische Kaffeetafel&quot; zwar zu einer festen
Instution geworden und erfreut sich wachsender Beliebtheit, aber nach wie vor
stellt sie alle, die nicht eng mit bergischen Traditionen verbunden sind, vor
die Frage, wie und in welcher Reihenfolge man die einzelnen Zutaten zu sich zu
nehmen hat.</p>
<p>
Dazu nun eine kurze Anleitung:<br>
Zu beginnen ist mit einer Wei&#223;brotschnitte, bestrichen mit Butter und
s&#252;&#223;em Aufstrich und belegt mit einer dicken Reisschicht. Danach
h&#228;lt man sich an die kr&#228;ftigeren Brotsorten und K&#228;se oder Wurst
als Belag. Eine Schnitte mit Butter und Quark beendet die Brotmahlzeit, der man
allenthalben noch Kuchen oder Zwieback folgen l&#228;sst. Die Waffeln werden
zwischendurch verzehrt, auf jeden Fall aber warm, das heisst, sobald sie
serviert werden. Den Abschluss der Mahlzeit sollte ein Korn oder Aufgesetzter
bilden - schon der besseren Vertr&#228;glichkeit wegen.</p>
<p>
Aus eben diesem Grund empfiehlt es sich zudem, den Genuss der &quot;Bergischen
Kaffeetafel&quot; mit einer Wanderung durch das Land zu verbinden. Das dient
nicht nur der Gesundheit und dem Verst&#228;ndnis....... es macht auch einfach
Spa&#223;.</p>
</blockquote>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
</font> 
<br>
<center>
<a href="NoCover.html"> <img border=0 src="l_hauptinhalt.jpg" width=495 height=75></a>
</center></table></center>
</body>
</html>



