<HTML>
<HEAD>
<TITLE>CeBIT Home im Rückspiegel</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#000080">
<FONT COLOR="#ffffff"><H1 ALIGN="CENTER">CeBIT Home im R&uuml;ckspiegel</H1>
</FONT><P ALIGN="CENTER"><IMG SRC="line1.gif" WIDTH=623 HEIGHT=7></P>
<FONT COLOR="#00ffff">
</FONT><B><FONT SIZE=1 COLOR="#00ffff"><P ALIGN="CENTER">Anmerkung : Dieser Artikel wurde NICHT speziell f&uuml;r die NoCover geschrieben. Da es aber kein Problem ist, ihn auch hierf&uuml;r zu nutzen, stelle ich ihn hier und heute zur Verf&uuml;gung.</P>
</B></FONT><FONT COLOR="#00ffff">
<P>Ging es in der Muttermesse "CeBIT 98" noch um den professionellen und gewerblichen Einsatz der modernen Computer- und Kommunikationssysteme, so zielt die abgesetzte CeBIT Home speziell auf den Hobby- und Freizeit-Anwender, der seinen Rechner multimedial und f&uuml;r Spiele einsetzt.</P>

<P>Die ganze Messe schien von Beginn an gut durchorganisiert, - so konnten die gro&szlig;en Messeparkpl&auml;tze genutzt werden und ohne Wartezeiten wurden die Besucher mit Kleinbussen direkt bis vor die Messet&uuml;ren gebracht. </P>

<P>Direkt in der ersten besuchten Halle wurde eines der drei gro&szlig;en Themen der CeBIT Home 98 deutlich. So erfreuen sich die sogenannten "Setop-Boxen" einer wachsenden Beliebtheit. Die kompakten Ger&auml;te sollen k&uuml;nftig die Vorteile des Internet und der &uuml;blichen PC-Anwendungen "wohnzimmertauglich" machen. So k&ouml;nnen Sie sich beispielweise &uuml;ber die Bundesliga-Ergebnisse, B&ouml;rsenkurse oder den Wetterbericht per Internet informieren, oder einem Freund eine EMail schreiben und h&ouml;ren w&auml;hrend dessen Ihre Lieblings-MusikCD. - Sie lassen sich mit einem elektronischem Terminkalender an Omas Geburtstag erinnern, sehen sich einen Videofilm an, oder spielen mit Ihrem j&uuml;ngsten Spro&szlig; ein packendes Adventurespiel .... und das alles im Wohnzimmer mit Ihrem gewohnten Fernseher. Das ist Multimedia total, unzwar ohne dabei einen gro&szlig;en, h&auml;&szlig;lichen PC im Wohnzimmer verstecken zu m&uuml;ssen. Die Setop-Boxen werden zusehens kleiner und sind teilweise bereits auf eine kleine, ergonomisch geformte Tastatur geschrumpft, in der sich alle notwendige Technik platzsparend befindet.</P>

<P>&nbsp;</P>
</FONT><U><FONT COLOR="#ffffff"><H2>Wiederbelebt ....</H2>
</U></FONT><FONT COLOR="#00ffff">
</FONT><P><IMG SRC="image33.jpg" WIDTH=221 HEIGHT=47></P>
<B><FONT SIZE=1 COLOR="#00ffff"><P>Lang ist´s her und dennoch wieder erkannt – Das C64-Logo war aktuell auf der CeBIT Home 98</P>
</B></FONT><FONT COLOR="#00ffff">
</FONT><P><IMG SRC="image32.jpg" WIDTH=300 HEIGHT=150></P>
<B><FONT SIZE=1 COLOR="#00ffff"><P>Ein Commodore64-Nachfolger ? – Web-it bringt alte Zeiten zur&uuml;ck</P>
</B></FONT><FONT COLOR="#00ffff">
<P>Ein Highlight bei diesen kleinen Allesk&ouml;nnern war auf der CeBIT sicherlich die neue Box "Web-it", die unter dem altbekanntem "Commodore 64"-Logo angepriesen wurde. Allein schon dieses Logo, welches in den achtziger Jahren auf den Computermessen dominierte, erregte unter den Computer-Kennern durchaus gro&szlig;e Aufmerksamkeit. "Der C64 ist wieder da ?" – staunten verwundert mehrere Interessenten am Messestand der "Web-it". Die neue Setop-Box hat allerdings nur noch wenig mit dem kleinen Oldtimer unter den Computern zu tun. Lediglich, da&szlig; die gesamte Technik in einem formsch&ouml;nen Tastaturgeh&auml;use steckt, der Rechner nach dem einschalten ohne Ladezeiten nahezu sofort bereit steht und man die "Web-it" an einen ganz normalen Fernseher anschlie&szlig;en kann, sind die Gemeinsamkeiten. Auf das "Commodore64"-Logo hingegen kam man eigentlich nur, weil die "Web-it" au&szlig;er vollst&auml;ndiger Software f&uuml;r das Internet, EMailverkehr und einem Lotus-Softwarepaket (zum Briefe schreiben usw.) auch noch einen eingebauten Commodore64-Emulator und unz&auml;hlige alte Spiele f&uuml;r dieses betagtere System mitbringt.</P>
<P>&nbsp;</P>
</FONT><U><FONT COLOR="#ffffff"><H2>&Uuml;berall Playstation</H2>
</U></FONT><FONT COLOR="#00ffff">
<P>Der gr&ouml;&szlig;te Bereich geh&ouml;rte neben dem Internet und den Messest&auml;nden der diversen Telekommunikationsanbieter vor allem dem Spielebereich. &Uuml;berall auf der CeBIT konnte man sich den brandneusten Spielen hingeben. Regelrecht &uuml;berflutet waren die Hallen mit den Spielkonsolen "Playstation" von Sony, wof&uuml;r auch einige Anbieter diverse Extras vorstellten. So l&auml;&szlig;t sich die Playstation ab sofort auch an den PC-Monitor anschlie&szlig;en, wodurch man eine bislang ungekannte Bildqualit&auml;t bekommt.</P>

<P>&nbsp;</P>
</FONT><U><FONT COLOR="#ffffff"><H2>Brandhei&szlig; und sensationell - BeOS ....</H2>
</U></FONT><FONT COLOR="#00ffff">
</FONT><P><IMG SRC="image34.jpg" WIDTH=124 HEIGHT=169></P>
<FONT COLOR="#00ffff">
<P>Von einem weiteren Highlight m&uuml;ssen wir noch berichten. Das nagelneue Betriebssystem "BeOS" von der amerikanischen Softwareschmiede "Be" stellte auf der CeBIT zum ersten mal eine Betaversion f&uuml;r Standart-PC vor. </P>
<P>Was w&auml;hrend einer Multimediavorstellung dem Besucher pr&auml;sentiert wurde, lie&szlig; den Mund weit offen stehen. Es war kaum zu glauben, da&szlig; man mit diesem neuen 64Bit-OS (Windows98 ist immer noch nicht restlos zum 32Bit-OS herangewachsen und k&auml;mpft mit Altlasten der 16Bit-&Auml;ra) noch derart viel Leistung aus der heutigen StandartPC-Architektur heraus holen kann. </P>

<P>Mindestens ein Dutzend Videofilme lie&szlig;en die Amerikaner gleichzeitig auf der BeOS-Oberfl&auml;che laufen und erkl&auml;rten im Vordergrund diverse &uuml;berzeugende Qualit&auml;ten. Das von den unz&auml;hlig gleichzeitig laufenden Videos und Animationen nicht ein einziges Fenster ruckelte, schien am Be-Stand v&ouml;llig selbstverst&auml;ndlich zu sein. Das neue Betriebssystem ist f&uuml;r den Apple Macintosh soweit fertig und auch die Betaversion f&uuml;r kompatible PCs l&auml;uft bereits &auml;u&szlig;erst stabil und komplett.</P>

</FONT><P><IMG SRC="beos_maxon.jpg" WIDTH=353 HEIGHT=372></P>
<B><FONT SIZE=1 COLOR="#00ffff"><P>Auch die Firma Maxon war am Be-Messestand vertreten und stellte ihr bekanntes Programm "Cinema4D" f&uuml;r das neue Betriebssystem vor.</P>
</B></FONT><FONT COLOR="#00ffff">
<P>Lassen es Euch gut gehen und bis zum n&auml;chsten mal&#9;&#9;&#9;&#9;&#9;Cord Hagen</P></FONT></BODY>
</HTML>
