<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Lars Philipsen">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.05 [de] (Win95; I) [Netscape]">
   <TITLE>Popul&auml;re Irrt&uuml;mer</TITLE>
</HEAD>
<BODY BACKGROUND="sand.jpg">
[Lars Philipsen]
<CENTER><B><I><FONT SIZE=+3>"Die Erde ist eine Kugel", "Jahr Null", "Fast-Food
ist ungesund" und andere popul&auml;re Irrt&uuml;mer (Teil I)</FONT></I></B></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><FONT COLOR="#006600"><FONT SIZE=+1>Hallo Leute! Diesmal ein Artikel
von mir &uuml;ber kapitale Missverst&auml;ndnisse und Irrt&uuml;mer, die
von uns inzwischen gar nicht mehr als Fehler wahrgenommen werden, da sie
zum gr&ouml;&szlig;ten Teil aus jahrelangen &Uuml;berlieferungen bestehen.
Die Informationen zu meinem Artikel habe ich dem Buch "Lexikon der popul&auml;ren
Irrt&uuml;mer" aus dem Bertelsmann-Verlag entnommen. Viel Spa&szlig; beim
Lesen!</FONT></FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><FONT SIZE=+1>-Abendrot verhei&szlig;t sch&ouml;nes Wetter-</FONT></B></CENTER>

<CENTER><FONT SIZE=+1>"Des Abends sprecht ihr: es wird ein sch&ouml;ner
Tag werden, denn der Himmel ist rot", sagt Jesus in der Bibel (Matth&auml;us
16,2; in manchen &Uuml;bersetzungen fehlt die Stelle). Aber das stimmt
nur bedingt. Richtig ist, dass ein schwaches pinkfarbenes Abendrot durch
eine besonders trockene Luft entsteht und dass deshalb die Wahrscheinlichkeit
f&uuml;r Regen sinkt. Ein knallroter Abendhimmel dagegen entsteht oft durch
feuchte Staubpartikel in der Atmosph&auml;re; er k&uuml;ndigt eher Regen
an.</FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><FONT SIZE=+1>-Affen lausen sich-</FONT></B></CENTER>

<CENTER><FONT SIZE=+1>Anders als viele Zoobeobachter glauben, suchen Affen
in den Fellen ihrer Artgenossen nicht nach L&auml;usen. Dieses h&auml;ufige
gegenseitige "Lausen" dient vor allem dem Entfernen von abgestorbenen Hautresten
und Salzkrusten, die durch den Schwei&szlig; entstehen, sowie quasi als
Nebenprodukt auch dem Ein&uuml;ben eines solidarischen Sozialverhaltens
- man "laust" sich, um die "Affenbande" aneinander zu gew&ouml;hnen. [...]
Affen sind im allgemeinen, wenn sie nicht in extrem schmutzigen K&auml;figen
leben, v&ouml;llig frei von allen K&ouml;rperparasiten.</FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><FONT SIZE=+1>-Alkohol w&auml;rmt-</FONT></B></CENTER>

<CENTER><FONT SIZE=+1>Auch wenn wir an nach einem hei&szlig;en Grog an
einem kalten Winterabend anders denken: Alkohol erw&auml;rmt den K&ouml;rper
nicht. Zwar f&uuml;hlen wir subjektiv eine W&auml;rme, die sich so sch&ouml;n
vom Magen &uuml;ber den ganzen K&ouml;rper ausbreitet, aber objektiv gesehen
macht Alkohol die Blutgef&auml;&szlig;e an der K&ouml;rperoberfl&auml;che
weiter; das Blut str&ouml;mt an die Au&szlig;enseite und wird k&uuml;hler,
die Temperatur des K&ouml;rpers sinkt. Auf diese Weise kann Alkohol bei
gro&szlig;er K&auml;lte sogar Erfrierungen erzeugen.</FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><FONT SIZE=+1>-Der Altar ist eine christliche Erfindung-</FONT></B></CENTER>

<CENTER><FONT SIZE=+1>Die ersten Christen kannten keine besonderen Pl&auml;tze
in ihren Versammlungsorten, so wie in modernen Kirchen die Alt&auml;re.
Ja sie wurden sogar, weil sie keine Alt&auml;re hatten, von den anderen
Religionen als Barbaren angegriffen. Der Altar als der besondere Platz,
wo man den G&ouml;ttern opfert, existierte lange vor Jesus Christus in
fast allen Religionen dieser Erde.</FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><FONT SIZE=+1>-Die arabischen Ziffern stammen von den Arabern-</FONT></B></CENTER>

<CENTER><FONT SIZE=+1>Die arabischen Ziffern 1, 2, 3, 4, ... sind keine
Erfindung der Araber - urspr&uuml;nglich stammen sie aus Indien. Von dort
kamen sie dann mit den Arabern &uuml;ber Nordafrika und Spanien nach Europa.
[...]</FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><FONT SIZE=+1>-Big Ben-</FONT></B></CENTER>

<CENTER><FONT SIZE=+1>Dieses Wahrzeichen der englischen Hauptstadt London
ist weder der Turm noch die Uhr in diesem Turm - es sit die Glocke. Sie
wiegt 13 Tonnen und hat ihren Namen von Sir Benjamin Hall, dem Verantwortlichen
f&uuml;r &ouml;ffentliche Bauten zu der Zeit ihrer Entstehung.</FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><FONT SIZE=+1>-Blindschleichen sind Schlangen-</FONT></B></CENTER>

<CENTER><FONT SIZE=+1>Blindschleichen sind Eidechsen mit verk&uuml;mmerten
F&uuml;&szlig;en, keine Schlangen.</FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><FONT SIZE=+1>-Zu jedem Blitz geh&ouml;rt ein Donner-</FONT></B></CENTER>

<CENTER><FONT SIZE=+1>Nicht immer, wenn es blitzt, muss es auch donnern;
rund 40% aller Blitze gehen lautlos &uuml;ber die Weltenb&uuml;hne.</FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><FONT SIZE=+1>-Es ist n&uuml;tzlich, seine Blutgruppe zu kennen-</FONT></B></CENTER>

<CENTER><FONT SIZE=+1>Wenn ein Arzt die Blutgruppe eines Patienten wissen
muss, bestimmt er diese selbst (bzw. l&auml;sst sie von einem Labor bestimmen);
kein Arzt w&uuml;rde sich hier auf die Auskunft des Patienten verlassen.
Deshalb lohnt es sich auch nicht, viel M&uuml;he auf das Auswendiglernen
seiner Blutgruppe zu verwenden. <I>(Anders ist es nat&uuml;rlich, wenn
die eigene Gruppe belegbar ist, wie z.B. beim Blutspendeausweis.)</I></FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><FONT SIZE=+1>-Die Bratwurst hai&szlig;t so, weil sie gebraten
wird-</FONT></B></CENTER>

<CENTER><FONT SIZE=+1>Das Wort "Bratwurst" leitet sich vom altdeutschen
Wort "brat" ab, das hei&szlig;t "weiches, kleingehacktes Fleisch".</FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><FONT SIZE=+1>-Einstein war ein schlechter Sch&uuml;ler-</FONT></B></CENTER>

<CENTER><FONT SIZE=+1>Diese Legende hat schon manchen Sch&uuml;ler &uuml;ber
schlechte Noten weggetr&ouml;stet. Wenn selbst Einstein... In Wahrheit
war Einstein alles andere als ein schlechter Sch&uuml;ler; er war nur an
Sport und Sprachen wenig interessiert, und auch der Umgangston im Unterricht
gefiel im nicht. [...] Aber seine Leistung, insbesondere in seinen Lieblingsf&auml;chern
Physik und Mathematik, war immer Spitzenklasse.</FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><FONT SIZE=+1>-Elefanten haben Angst vor M&auml;usen-</FONT></B></CENTER>

<CENTER><FONT SIZE=+1>Elefanten haben keine besondere Angst vor M&auml;usen;
man sieht sie oft im Zirkusheu oder in Zoogehegen friedlich mit diesen
zusammen. Bei einem von Bernhard Grzimek durchgef&uuml;hrten einschl&auml;gigen
Experiment rannten die Versuchselefanten denn auch keineswegs unter erschreckendem
Trompetenst&ouml;&szlig;en aufgel&ouml;st davon; sie brachten vielmehr
"ihre R&uuml;ssel weit ge&ouml;ffnet ganz dicht an die M&auml;use heran
[...]." Anders bei Grzimeks Versuchen mit Kaninchen und Dackeln: Hier wichen
die Elefanten &auml;ngstlich zur&uuml;ck und bewarfen die anderen Tiere
aus der Ferne mit Sand und Steinen.</FONT></CENTER>

<CENTER>&nbsp;</CENTER>

<CENTER><FONT COLOR="#CC0000"><FONT SIZE=+1>So, das war nun der erste Teil
&uuml;ber dieses doch recht interessante Thema. Man ist sich im t&auml;glichen
Leben gar nicht dar&uuml;ber bewu&szlig;t, wie viele L&uuml;gen und Unwahrheiten
man da so verbreitet und kommentarlos von anderen &uuml;bernimmt.</FONT></FONT></CENTER>

<CENTER><FONT COLOR="#CC0000"><FONT SIZE=+1>Bei entsprechender Resonanz
werde ich einen zweiten Teil &uuml;ber dieses Thema in die NoCover bringen.</FONT></FONT></CENTER>

<CENTER>&nbsp;</CENTER>

<CENTER><FONT COLOR="#3333FF"><FONT SIZE=+1>Bis dann, euer</FONT></FONT></CENTER>

<CENTER><A HREF="mailto:LarsPh@cityweb.de"><IMG SRC="lph.jpg" ALT="E-Mail an Mister L" HEIGHT=109 WIDTH=144></A></CENTER>

</BODY>
</HTML>
