<HTML>
<HEAD>
<TITLE>NoCover_kocht</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#000080">

<I><FONT COLOR="#ffffff"><H1 ALIGN="CENTER">"NoCover" kocht ....</H1>
</I></FONT><P ALIGN="CENTER"><IMG SRC="line1.gif" WIDTH=623 HEIGHT=7></P>
<B><FONT SIZE=1 COLOR="#00ffff">
<P ALIGN="CENTER">Anmerkung : Dieser Artikel wurde NICHT speziell f&uuml;r die NoCover geschrieben. Da es aber kein Problem ist, ihn auch hierf&uuml;r zu nutzen, stelle ich ihn hier und heute zur Verf&uuml;gung.</P>
</B></FONT><FONT COLOR="#00ffff">
<P>Herzlich Willkommen bei ""NoCover kocht". Hier m&ouml;chten wir Ihnen regelm&auml;&szlig;ig ein komplettes Men&uuml; vorstellen, falls Ihnen mal die Ideen ausgehen sollten, was es morgen sch&ouml;nes zu essen gibt.</P>
<P>Unsere Men&uuml;s werden immer komplett mit einer Vorspeise, dem Hauptgang und einem Dessert vorgestellt.</P>
<P>Heute gibt es vorweg eine Original-Leberk&auml;s-Brotsuppe aus der schw&auml;bischen K&uuml;che. Anschlie&szlig;end schieben wir noch einen deftigen Blumenkohlauflauf in die R&ouml;hre und vollenden diesen kulinarischen Genu&szlig; mit einem "Allg&auml;uer F&ouml;rsterfreund".</P>

<P>Wir von der "NoCover" w&uuml;nschen Ihnen einen guten Appetit und hoffen, Ihren Geschmack hiermit getroffen zu haben .....</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
</FONT><I><FONT COLOR="#ffffff"><H2>Vorspeise </H2>
</I></FONT><B><U><FONT SIZE=4 COLOR="#00ffff">
</FONT><FONT SIZE=4 COLOR="#ffffff"><P>Leberk&auml;s-Brotsuppe</P>
</FONT><I><FONT COLOR="#ffffff"><P>Zutaten:</P>
</B></I></U></FONT><FONT COLOR="#00ffff"><P>1 kleine Zwiebel</P>
<P>25 g magerer Rauchspeck</P>
<P>100 g &auml;ltere Schwarz- und Wei&szlig;brotst&uuml;cke</P>
<P>1 Prise K&uuml;mmel</P>
<P>1,5 l leichte Br&uuml;he</P>
<P>Salz</P>
<P>Muskat</P>
<P>1 Ei</P>
<P>50 g Leberkaese</P>
<B><I><U>
</FONT><FONT COLOR="#ffffff"><P>Zubereitung:</P>
</B></I></U></FONT><FONT COLOR="#00ffff"><P>Die Zwiebel hacken und den Speck in W&uuml;rfel schneiden. Beides in einem Topf "blond" anbraten. Das Brot in W&uuml;rfel schneiden und mitr&ouml;sten. Dann den K&uuml;mmel und die Br&uuml;he zugeben und solange unter r&uuml;hren kochen lassen, bis sich eine halbwegs glatte Suppe gebildet hat. Anschlie&szlig;end mit Salz und Muskat abschmecken (Vorsicht, Speck und Brot enthalten schon eine Menge Salz!).</P>
<P>Zum Schlu&szlig; ein Ei in die Suppe gleiten lassen und aufkochen. Gew&uuml;rfelten Leberk&auml;se in der Suppe erw&auml;rmen.</P>
<P>&nbsp;</P>
</FONT><I><FONT COLOR="#ffffff"><H2>Hauptgericht</H2>
</FONT><B><U><FONT SIZE=5 COLOR="#00ffff">
</FONT><FONT SIZE=5 COLOR="#ffffff"><P>Blumenkohlauflauf</P>
</B></I></U></FONT><FONT COLOR="#00ffff">
<B><P>Zutaten f&uuml;r 4 Personen:</P>
</B>
<P>250g Rinderhackfleisch</P>
<P>4 Tomaten</P>
<P>1 eingeweichtes Br&ouml;tchen</P>
<P>1 Zwiebel</P>
<P>1 Ei</P>
<P>Salz, Muskat, Pfeffer</P>
<P>F&uuml;r die So&szlig;e:</P>
<P>40g Butter</P>
<P>40g Mehl</P>
<P>1/2l Milch</P>
<P>100g geriebener Emmentaler</P>
<P>Salz, Muskat</P>
<P>&nbsp;</P>
</FONT><B><I><U><FONT COLOR="#ffffff"><P>Zubereitung :</P>
</B></I></U></FONT><FONT COLOR="#00ffff">
<P>Zun&auml;chst den Blumenkohl putzen und in Salzwasser 10 Minuten kochen. Das Br&ouml;tchen ausdr&uuml;cken, mit dem Hackfleisch, der gew&uuml;rfelten Zwiebel und dem Ei mischen und mit Salz und Pfeffer kr&auml;ftig abschmecken. Nun die Auflaufform einfetten, den abgetropften Blumenkohl hineinlegen und die Hackfleischmasse darum verteilen. Die Tomaten mit hei&szlig;em Wasser &uuml;berbr&uuml;hen, h&auml;uten, die Stengelans&auml;tze herausschneiden und in den Hackfleischteig dr&uuml;cken.</P>
<P>F&uuml;r die So&szlig;e die Butter im Topf erhitzen und dann unter st&auml;ndigem r&uuml;hren das Mehl einstreuen, mit hei&szlig;er Milch abl&ouml;schen und f&uuml;nf Minuten kochen lassen. Die So&szlig;e wird mit Salz und Muskat abgeschmeckt und &uuml;ber dem Blumenkohl und der Hackfleischmasse verteilt. Der geriebene Emmentaler kann jetzt dar&uuml;bergestreut werden.</P>
<P>Das Ganze wird im vorgeheizten Ofen auf mittlerer Schiene 55-60 Minuten gebacken.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
</FONT><I><FONT COLOR="#ffffff"><H2>Dessert</H2>
</FONT><B><U><FONT SIZE=5 COLOR="#00ffff">
</FONT><FONT SIZE=5 COLOR="#ffffff"><P>Allgaeuer Foersterfreund – (mit Camembert gefuellte Birnen)</P>
</B></I></U></FONT><FONT COLOR="#00ffff">
</FONT><FONT COLOR="#ffffff"><P>Zutaten f&uuml;r 4 Personen :</P>
</FONT><FONT COLOR="#00ffff">
<P>1 Camembert</P>
<P>2 EL Butter</P>
<P>2 Birnen</P>
<P>1 Ei</P>
<P>Etwas Paniermehl</P>
<P>Etwas Butter</P>
<P>Etwas Mehl</P>
<P>Etwas Preiselbeeren</P>
<P>&nbsp;</P>
</FONT><B><I><U><FONT COLOR="#ffffff"><P>Zubereitung :</P>
</B></I></U></FONT><FONT COLOR="#00ffff">
<P>Zubereitungszeit: 10 Minuten </P>
<P>Camenbert und Butter mit einer Gabel zerdr&uuml;cken und vermengen. Masse zu einer Kugel formen, Mehl, Ei und Paniermehl auf einem Teller vermischen und die Kugel darin rollen.</P>
<P>Etwas Butter in einer Pfanne erhitzen. Die Birnen halbieren, Kerngeh&auml;use entfernen und an den Schnittfl&auml;chen anbraten. Dann die hei&szlig;en Kugeln in die Mitte der Birnen setzen und mit Preiselbeeren garnieren. Bitte alles hei&szlig; servieren.</P>
<P>&nbsp;</P>
<P>Lassen Sie es sich schmecken ....</P>
<P>&nbsp;</P>
<I><P>Cord Hagen</P></I></FONT></BODY>
</HTML>
