<HTML>
<HEAD>
<TITLE>Tip_Gratis</TITLE>
</HEAD>
<BODY LINK="#0000ff" BGCOLOR="#800000">

<U><FONT COLOR="#ffffff"><H1 ALIGN="CENTER">HIGGINSens kleiner Tip f&uuml;r Schnorrer ....</H1>
</U></FONT><FONT COLOR="#000000"><P>&nbsp;</P>
</FONT><B><FONT SIZE=4 COLOR="#ffff00"><P>Na Ihr stets Gierigen, - auf der Suche nach allem, was kostenlos verschenkt und verschickt wird ....</P>
<P>Ihr braucht Euch nicht sch&auml;men, - mir geht es ja nicht anders ;-)</P>
<P>Daher wollte ich Euch eben dar&uuml;ber informieren, da&szlig; es bei OPEL aktuell drei MultimediaCDs zu verschenken gibt. Ihr m&uuml;&szlig;t lediglich entweder auf die Homepage von Opel gehen : </B></FONT><A HREF="http://www.opel.com/">http://www.opel.com</A><B><FONT SIZE=4 COLOR="#ffff00">  und dort die CDs kostenlos ordern, oder auch anrufen : 0180 / 55510, oder einfach zum n&auml;chsten Opel-H&auml;ndler stapfen, wo Ihr Euch die CDs herausholen oder wenigstens dort bestellen k&ouml;nnt.</P>
<P>Bereits nach nur wenigen Tagen k&ouml;nnt Ihr die CD-ROMs in Eurem Briefkasten finden. Es handelt sich dabei um multimediale Pr&auml;sentations-CD-ROMs zu den Automodellen : Astra / Sintra und Corsa. Die CDs sind interaktiv und zum Teil mit kleinen Spielen versehen. Die "Corsa"-CD hingegen ist ein komplettes Adventurespiel namens "Enrica Corsarella - Das Abenteuerspiel in vier Akten". Enrica ist verschwunden und Eure Aufgabe soll es nun sein, die ber&uuml;hmte Operns&auml;ngerin wiederzufinden.</P>
<P>&nbsp;</P>
</FONT><FONT SIZE=4 COLOR="#ffffff"><P>Ja spinnt jetzt der Higgins ??? - Das sind doch garantiert alles CDs f&uuml;r die kompatiblen Wintel-Rechner ?! .....</P>
<P>Tja, hier wird es aber auch f&uuml;r den Shapeshifter-Nutzer sehr interessant, da die CDs auch f&uuml;r Macintosh-Rechner konzipiert sind.</P>
<P>Die CDs laufen bereits auf : 68030 mit MacOS 7.01 oder h&ouml;her und 8MByte RAM, - und somit auch auf dem Shapeshifter sehr fl&uuml;ssig. Und da man sie GRATIS bekommt, ist es doch ein Versuch wert ;-)</P>
<P>Achja, - Ihr m&uuml;&szlig;t nat&uuml;rlich etwas tun, um die CDs zu bekommen - n&auml;mlich Eure Adresse angeben ;-)</P>
<P>Ist noch mehr Bedarf bei Euch nach Bezugsadressen, wo man etwas GRATIS bekommt ? - Ich kann Euch durchaus weitere Adressen zusammensellen, allerdings habe ich noch nichts weiter finden k&ouml;nnen, was man wie bei diesem mal wenigstens &uuml;ber Umwege auf dem Amiga nutzen kann ;-(</P>
<P>&nbsp;</P>
<P>Viel Spa&szlig; mit den CD-ROMs und bis zum n&auml;chsten mal, - Euer Cord Hagen</P></B></FONT></BODY>
</HTML>
