<html>
<head>
<meta name="description" content="Wolf-INFO">
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="st_wolfinfo.gif" TEXT=black link=blue alink=red bgcolor="#FFFFCC">
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" width="100%" bgcolor="#808080"><font
color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td>
</tr>
</table>

<table border="0" cellpadding="3" cellspacing="3" width="100%">
<tr>
<td valign="top" bgcolor="#C0C0C0"><font color="#000080"><b>Inhalt</b></font>
<p><a href="#a1"><font size="1" face="arial">Magische Quadrate
</font></a></p>
<p><a href="#a2"><font size="1" face="arial">Vierfarbentheorem
</font></a></p>

<p><center> <a href="Mitglieder/zimmer.html">
<img src="st_wolfinfo.jpg" width=90 height=90 border=0></a><br><br><br>
<font size="2"> eMail: </font> <a href="mailto:wozim@t-online.de">
<font size="1" face="arial">wozim@t-online.de</font></a>
</center></p>
<p><a href="NoCover.html"><font size="1" face="arial">Zur&#252;ck zum NoCover-Index
</font></a></p>
</td>
<td valign="top"><a name="a1"><font color="800000" size="7"><center>
<b>Anmerkungen zur Resonanz:<br> Magische Quadrate / Abakus</font></b></a></center><br>
<p>
Es hat mich wirklich &#252;berrascht zu lesen, dass beide Arbeiten doch so gut
angekommen sind. Diese Artikel hatte ich im letzten Herbst als Background f&#252;r
Lehrerinformationen fertiggestellt, aber sie wurden dann doch nicht ben&#246;tigt.
Bei der jetzigen Umsetzung in HTML habe ich den Text in manchen Passagen gek&#252;rzt
und auch abge&#228;ndert. Mit der Ver&#246;ffentlichung dieser Themen habe ich mich von
den physikalischen Erl&#228;uterungen des "Weltraumgeschehens" inspirieren lassen, da
ich feststellen konnte, dass nicht nur das Thema Amiga im Vordergrund stehen
muss. Aber ganz ehrlich, ich war mir nicht sicher, mit welcher Art von Resonanz
ich rechnen konnte bzw. sogar bef&#252;rchten musste.</p>
<p>
<img src="st_wolfinfo2.jpg" width=113 height=160 border=0 hspace=10 vspace=0 align="left">
Wer kann das nebenstehende Quadrat als ein magisches Quadrat erstellen, wobei
die Zahlen 1 bis 7 in Form von R&#246;sselspr&#252;ngen zum Stehen kommen? Die Zahlen 1
und 2 sind schon vorgegeben. Um genau zu sein, es sollte ein diabolisches
Quadrat werden. S&#228;mtliche 4 Waagrechten, 4 Senkrechten, beide Diagonalen, das
Innenquadrat und die 4 Eckpunkte ergeben jeweils in der Summe die Zahl 34. Mailt
mich an, zu gewinnen gibt es nichts. &#220;brigens das Quadrat stammt nicht von mir,
ich habe es aus einem schlauen Mathematikbuch entnommen.</p>
<p>
Als Nachtrag zu den magischen Quadraten sollte nicht unerw&#228;hnt bleiben, dass
analoge Eigenschaften zu den bisher beschriebenen sich auch an anderen
geometrischen Figuren beobachten lassen. F&#252;r einen magischen Stern braucht man die
Zahlen 1 bis 12 und eine aus zwei gleichseitigen Dreiecken bestehende Figur in
Form eines Davidsterns. Die Zahlen sollen so auf die Ecken und Schnittpunkte
verteilt werden, dass alle sechs Seiten der Dreiecke dieselbe Summe bilden. Man
muss schon eine Weile herumprobieren, bis alle Seiten die Summen 26 haben.
Magisch wird es aber erst, wenn nun solange ge&#228;ndert wird, bis auch die Summe
der Spitzen die Zahl 26 ergibt. Wer es nachzeichnen will, die Werte der Spitzen
lauten im Uhrzeiger gelesen: 1, 4, 10, 6, 2 und 3. Die Zahlen zwischen der 1
und der 10 sind 8 und 7, zwischen der 10 und der 2 sind 9 und 5 und zwischen
2 und der 1 sind die Zahlen 12 und 11. Oder anders ausgedr&#252;ckt: die einzelnen
Zahlenquadrupel lauten: 1-8-7-10, 4-7-9-6, 10-9-5-2, 6-5-12-3, 2-12-11-1
und 3-11-8-4. Das soll nun genug des Magischen gewesen sein.
</table></p>
<img src="st_wolfinfo3.jpg" width=210 height=466 border=0 hspace=10 vspace=0 align="right">
<p>
Nun noch ein paar Worte zum Abakus.
Lars ich habe mal f&#252;r Dich im gro&#223;en Brockhaus nachgelesen. Vielleicht hast Du dies
auch zwischenzeitig getan und bist frustriert. Da steht:<br><font size="-1">
<b>Abakus</b>[lat]der,-/-, 1) seit dem Altertum Tafel, Spiel-, Rechenbrett.
2) Deckplatte des S&#228;ulenkapitells.</font><br>
Auch im Dudenlexikon steht nichts anderes. Nur anstelle von Altertum stehen hier
die Griechen und R&#246;mer. In beiden Publikationen gibt es ein unscharfes
Miniaturbild zu bewundern, aber keine Erkl&#228;rungen.Du gibst mir da wohl recht,
weit w&#228;ret ihr damit in der Erkl&#228;rung &#252;ber Funktionen nicht gekommen.</p>
<p>
Das Prinzip des Abakus trifft man heute noch t&#228;glich in der Kneipe. Das Beschriften
der Bierdeckel durch den Kellner ist nichts anderes. F&#252;r jedes Bier wird ein Strich
gemacht, f&#252;r ein Pils meist ein X oder sonst welche Zeichen. Zum Schluss wird der
Preis mit den Anzahl Markierungen multipliziert. Derartige Z&#228;hlmethoden reichen bis
in die mythischen Anf&#228;nge der Mathematik.</p>
<p>
Eine Methode, mittels einfacher Zeichen auch komplexe Operationen darzustellen,
zeigt das Objekt hier rechts. Es handelt sich um eine Art Gesellschaftsvertrag
unter mehreren analphabetischen sizilianischen Hirten. Es wurde in den 50er
Jahren zwischen Catania und Siracusa entdeckt. Seine Kerben markieren f&#252;r jeden
Teilhaber die Anzahl und Art der eingebrachten Tiere, die Zahl der neugeborenen
Tiere, die produzierten K&#228;se und dergleichen. Dieser "Kalender" wurde jedes Jahr
wieder neu beschlossen und galt vom 1. September bis zum 31. August. Dazu baten
die Hirten einen Schreibkundigen, den Stock jedes Besitzers mit dessen Namen zu
versehen.</p>
<p>
W&#228;hrend die Zahl der erwachsenen Tiere im Verlauf eines Jahres beinahe konstant
blieb, schwankte die Menge der K&#228;se und die Zahl der Neugeborenen (m&#228;nnliche
Tiere wurden verkauft, weibliche wurden behalten), so dass das Register einmal
im Monat erg&#228;nzt wurde.</p>
<p>
Offenbar steht bei diesem Instrument die Beziehung zwischen Zeichen und
Gegenst&#228;nden auf einem recht entwickelten Niveau, obwohl seine Benutzer weder
lesen noch schreiben konnten. Obwohl dieses spezielle Objekt nicht besonders alt
ist, steht fest, dass derartige Instrumente den Beginn des logischen und
mathematischen Denkens bilden. </p>
<a name="a2"><font color="800000" size="7"><center>
<b>Das Vierfarbentheorem</font></b></a></center><br>
<p>
<img src="st_wolfinfo4.jpg" width=159 height=175 border=0 hspace=10 vspace=0 align="left">
Es ist &#252;blich, auf einer Landkarte mit mehreren Staaten die benachbarten L&#228;nder
mit verschiedenen Farben darzustellen. Was ist die Mindestanzahl von Farben, mit
der sich jede noch so komplizierte Landkarte kolorieren l&#228;&#223;t? Man hat
herausgefunden, dass es mindestens vier sein m&#252;ssen. Drei Farben sind in manchen
F&#228;llen nicht genug, wie auf unserem nebenstehenden Beispiel ersichtlich ist.</p>
<p>
Die Tatsache, dass vier Farben f&#252;r jede beliebige Karte ausreichen, hat zur
Formulierung des folgenden Theorems gef&#252;hrt:<br> <i>Bei jeder Teilung einer
Ebene in mehrere Gebiete, die sich nicht &#252;berschneiden d&#252;rfen, lassen sich die
Gebiete mit vier Farben in der Weise kolorieren, dass keine zwei benachbarten
Gebiete die gleiche Farbe haben. <br></i>Gebiete sind benachbart, wenn sie eine
gemeinsame Grenze haben, die l&#228;nger als ein Punkt ist. Auf einem Schachbrett
zum Beispiel sind die horizontalen und vertikalen Felder benachbart, die
Diagonalen nicht, denn sie ber&#252;hren sich nur in einem Punkt.</p>
<p>
Ein Theorem aufzustellen ist die eine Sache, es aber zu begr&#252;nden eine ganz
andere. Die Vierfarbentheorie wurde 1852 von einem Engl&#228;nder aufgestellt, aber eine
endg&#252;ltige L&#246;sung erst 1976 formuliert. Dazu waren 1200 Computerstunden an drei
Gro&#223;rechnern an der University of Illinois erforderlich.</p>
<p>
So gibt es eine ganze Reihe von Beispielen, wo jeder sagt, das ist doch klar,
aber mit der hieb- und stichfesten Beweisf&#252;hrung hapert es.</p>


Gehe &#160; <a href="#top"> zum Anfang </a> oder <a href="NoCover.html">
Zum Inhaltsverzeichnis der NoCover</a>.
<hr color="#FF00FF">
</body>
</html>

