<HTML>
<HEAD>
<TITLE>Zimmerpflanzen</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#000080">

<I><FONT COLOR="#ffffff"><H1 ALIGN="CENTER">Der Herbst bl&uuml;ht</H1>
</I></FONT><P ALIGN="CENTER"><IMG SRC="line1.gif" WIDTH=604 HEIGHT=6></P>
<B><FONT SIZE=1 COLOR="#00ffff"><P>Anmerkung : Dieser Artikel wurde NICHT speziell f&uuml;r die NoCover geschrieben. Da es aber kein Problem ist, ihn auch hierf&uuml;r zu nutzen, stelle ich ihn hier und heute zur Verf&uuml;gung.</P>
</B></FONT><FONT COLOR="#00ffff"><P>&nbsp;</P>
<P>Langsam wird es drau&szlig;en wieder etwas grauer, die Tage werden k&uuml;rzer und nach einem ohnehin schon veregnetem Sommer g&ouml;nnt man sich wenigstens in den eigenen vier W&auml;nden eine kleine Oase, um der tristen Jahreszeit ein Schn&auml;ppchen zu schlagen. Damit Sie an Ihren Zimmerpflanzen l&auml;nger Freude haben, m&ouml;chte ich als Zierpflanzeng&auml;rtner Ihnen regelm&auml;&szlig;ig eine zur Jahreszeit passende Zimmerpflanze etwas n&auml;her vorstellen und vielleicht auch einige Tips geben, damit Sie l&auml;nger Freude an Ihren bl&uuml;henden Freunden haben.</P>
<P>In diesem Monat d&uuml;rften sicherlich die Alpenveilchen besonders beliebt sein, - also habe ich f&uuml;r dieses mal diese reich bl&uuml;hende Topfpflanze ausgew&auml;hlt.</P>
</FONT><P><IMG SRC="image35.jpg" WIDTH=227 HEIGHT=313></P>
<B><I><U><FONT SIZE=5 COLOR="#ffffff"><P>Cyclamen Persicum "Alpenveilchen</FONT><FONT COLOR="#ffffff">"</P>
</I></U><P>&nbsp;</P>
<P>Herkunft</P>
</B></FONT><FONT COLOR="#00ffff"><P>Das zur Familie der Primelgew&auml;chse geh&ouml;rende Alpenveilchen kommt urspr&uuml;nglich aus den Gebirgen Mittel- und S&uuml;damerikas und dem Mittelmeergebiet. Diese reich bl&uuml;hende Pflanze hat viele unterschiedliche, zierliche Bl&uuml;ten, die es in vielen verschiedenen Farben und Formen gibt. </P>
<B><P>&nbsp;</P>
</FONT><FONT COLOR="#ffffff"><P>Standort</P>
</B></FONT><FONT COLOR="#00ffff"><P>Von April bis September sollten Sie dem Alpenveilchen einen halbschattigen Standort spendieren und dann im Winter hell und vor allem nicht zu dicht am gut geheiztem Ofen stellen. Direkte Sonne mag das Alpenveilchen ebenfalls weniger gern.</P>
<P>Das Gew&auml;chs ist &auml;u&szlig;erst empfindlich gegen stehende N&auml;sse. Gie&szlig;en Sie im Sommer reichlich mit kalkfreiem, zimmerwarmen Wasser und achten Sie darauf, da&szlig; der Wurzelballen weder zu trocken, noch zu na&szlig; gehalten wird. Erst nach dem verbl&uuml;hen der Pflanze, sollten Sie weniger gie&szlig;en.</P>
<B><P>&nbsp;</P>
</FONT><FONT COLOR="#ffffff"><P>Pflege</P>
</B></FONT><FONT COLOR="#00ffff"><P>Normale Zimmertemperaturen und ab etwa November dann ein k&uuml;hler (ideal w&auml;ren 10°) Standort sind optimale Bedingungen f&uuml;r das ansonsten pflegeleichte Gew&auml;chs. Leider werden die Alpenveilchen oft im warmen Wohnzimmer gehalten, wo sie durch zu hohe Temperaturen nicht so lang bl&uuml;hen k&ouml;nnen.</P>
<P>Bei ganzj&auml;hriger Kultur k&ouml;nnen Sie das Alpenveilchen im Sommer w&ouml;chentlich, und im Winter alle zwei Wochen vorsichtig d&uuml;ngen.</P>
<P>Nach der Bl&uuml;te oder dem Neuaustrieb ist die beste Zeit, um das Alpenveilchen in humose, durchl&auml;ssige Erde zu verpflanzen. Achten Sie aber darauf, da&szlig; der oberste Teil der Knolle nicht mit Erde bedeckt ist.</P>
<P>Ist der Wurzelballen mal besonders ausgetrocknet, so gie&szlig;en Sie nur einmal bis zum Topfrand voll oder noch besser, - nehmen Sie den Topf und baden Sie ihn kurz in einem Eimer kalkfreiem, nicht zu kaltem Wasser. Kleinere Knospen im Inneren der Pflanze sollten keinesfalls mit Wasser benetzt werden.</P>
<P>Wer diese wenigen Tips befolgt, hat auch im n&auml;chsten Jahr wieder viel Freude mit seinem Alpenveilchen. Ihre Blumenl&auml;den halten jetzt aktuell ein gro&szlig;es Sortiment, der unterschiedlichsten Alpenveilchen f&uuml;r Sie bereit.</P>
<P>Viel Freude mit Ihren Pflanzen und lassen Sie es t&uuml;chtig bl&uuml;hen .....</P>
<I><P ALIGN="RIGHT">Cord Hagen</P></I></FONT></BODY>
</HTML>
