
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>PuzzleBOBS Preview</TITLE>
</HEAD>
<BODY TEXT=black background="kback.png" link=red alink=red>

<CENTER><h1><b>PuzzleBOBS Preview</CENTER></H1></B><P>
<hr><CENTER>
<p><img src="pb.jpg"></center></P><BR>

<hr>
<font size="+1,5">
<p>Game Previews hat es in der NC leider seid einiger Zeit nicht mehr gegeben - das ist ziemlich schade, erscheinen doch f&#252;r unseren Amiga nach wie vor tolle Spiele und eine Vielzahl befindet sich zudem noch in Entwicklung. Ein Spiel, das unmittelbar vor der Fertigstellung steht, ist PuzzleBOBS und dieses Teil hat es wirklich in sich.</P>

<p>Wer mit dem Namen PuzzleBOBS bisher nichts anfangen kann, dem sei an dieser Stelle verziehen, gab es doch bisher nur eine Demoversion auf der aktuellen AmigaPlus CD. Bei PuzzleBOBS handelt es sich - stark vereinfacht gesagt - um einen Bust `n` Move Clone. Wer mit dem Namen Bust `n` Move nichts anfangen kann, dem wird vielleicht das vor einiger Zeit erschienene Spiel Bubble Heroes etwas sagen. Gro&#223;e Worte &#252;ber dieses eigentlich bekannte Spielprinzip m&#246;chte ich an dieser Stelle auch nicht verlieren - das werde ich beim ausf&#252;hrlichen Test des Endproduktes in einer der n&#228;chsten Ausgaben nachholen.</P>


<p>Was uns an dieser Stelle vielmehr interessieren sollte, ist die Technik, die dahinter steckt. Es liegt zwar auf der Hand, da&#223; man aus dem an sich simplen Spielprinzip kein aufwendiges Spektakel machen kann, welches auf 3 CD`s ausgeliefert wird, aber es ist schon sehr beachtlich, mit welcher Liebe zum Detail der Programmierer hier vorgegangen ist. So gibt es nicht nur verschiedene Spielmodi (auch mit / gegen einen menschlichen Spieler bzw. Computergegner), Arenen, Sound - und Grafikdateien, sondern auch die M&#246;glichkeit, da&#223; Spiel bis in`s kleinste Detail an das eigene System anzupassen (und das ist wirklich so gemeint - wer glaubt, da&#223; die Konfiguration eines solchen Spiel`s schnell von der Hand gehen sollte, der wird bei PuzzleBOBS umdenken m&#252;ssen!!). Und das ist sogar positiv gemeint, habe ich bisher noch kein vergleichbares Spiel gesehen, da&#223; eine solche F&#252;lle an M&#246;glichkeiten bot.</P> 

<p>Aber das beste habe ich noch gar nicht erw&#228;hnt: Das Spiel - welches sich &#252;brigens seid 1997 in Entwicklung befindet - kann man individuell an die eigene Hardware anpassen. Egal, ob ein nackter A1200 mit AGA Chipset und 68020 CPU oder ein aufgemotzter GraKa Amiga mit 68060 CPU; hier wird wirklich alles unterst&#252;tzt und je besser die Hardware, desto fl&#252;ssiger bzw. grafisch attraktiver l&#228;uft das ganze dann auch ab. Selbst Aufl&#246;sungen wie 800 X 600 sind schon in der Demoversion ohne Probleme machbar und sorgen f&#252;r keinerlei Probleme, womit wir schon beim n&#228;chsten Punkt w&#228;ren: Das in reinem Assembler gecodete Spiel verh&#228;lt sich &#228;usserst systemfreundlich und macht selbst auf schwer &quot;gepatchten&quot; Rechnern keinerlei Probleme.</P>

<p>Bleibt zum Abschluss zu sagen, da&#223; schon die Demoversion absolut s&#252;chtig macht und ich es bis zum endg&#252;ltigen Release durch Funtime World / Amiga Arena (besucht mal <a href="http://www.funtime-world" target="_blank">http://www.funtime-world</A> bzw. <a href="http://online-club.de/~arena" target="_blank">http://online-club.de/~arena</A>) kaum noch abwarten kann. Ein weiterer Pluspunkt ist der konkurrenzlos g&#252;nstige Preis von angepeilten 49 DM. Ich kann Euch eines sagen: Kauft Euch dieses kurzweilige und s&#252;chtig machende Spiel auf jeden Fall! Ich lege meine Hand daf&#252;r in`s Feuer, da&#223; hier ein absoluter Kn&#252;ller auf uns zukommt!</P>
<hr>
<p>Name: PuzzleBOBS</P>

<p>Publisher: Funtime World / Amiga Arena</P>

<p>Release: Sommer 2001 </P>

<p>Preis: vorraussichtlich 49 DM</P>

<p>Anforderrungen: 68020 CPU, 2 MB Ram, Festplatte</P>

<p>Empfohlen: schnellere CPU, mehr Fast Ram und GraKa</P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border=0><p></A>
Kilian<blink> "The Bruce"</BLink> Servais

</CENTER>
</P>
</BODY>
</HTML>
