<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=red alink=red>
<table width=95%>
<p><center><h1><font color="green">Leserbrief von Kilian "The Bruce" Servais</font></center></h1></P><ul>
<li><a href="#rainer.html">An Rainer</A><BR></LI>
<li><a href="#rene.html">An Rene</A><BR></LI>
<li><a href="#top.html">Top 5</A></UL></LI></P>
<hr>
<a name="alle.html">
<p><b>Hi Rainer!</B><br>
Das sind ja gar keine guten Neuigkeiten bezgl. der Fireball - schade, da&#223; die Melanie jetzt auch aufgeh&#246;rt hat. Das das allerdings das vorzeitige Ende der Fireball sein wird, glaube ich nicht. Ich bin mir ziemlich sicher, da&#223; sich die Fireball noch lange halten wird, auch wenn der Verlust von Melanie ohne Frage ein herber ist. Schade, so sinkt die Frauenquote wieder runter....</P>

<p>Was die neue Savatage angeht war ich mir schon sicher, da&#223; sich daran die Geister scheiden werden - schau am besten mal in diverse Internet Foren, wo nicht nur dar&#252;ber heftigst diskutiert wird. Ich finde die 7 Punkte nach wie vor angemessen, ist ein St&#252;ck wie &quot;I Seek Power&quot; doch f&#252;r Savatage Verh&#228;ltnisse fast schon ein Totalausfall. Selbiges gilt auch f&#252;r &quot;Drive&quot; - lediglich im letzten Drittel kann die CD an Qualit&#228;t zulegen, was insbesondere an der Megakomposition &quot;Morphine Child&quot; liegt, die ja auch handwerklich absolute erste Sahne ist. Na ja, trotzdem kann &quot;Poets And Madmen&quot; meiner Meinung nach nicht mit den letzten drei Alben sowie &#228;lteren Hammeralben der Marke &quot;Streets&quot; oder &quot;Gutter Ballet&quot; mithalten. Savatage geh&#246;ren trotzdem nach wie vor zu meinen Lieblingsbands und der neue S&#228;nger scheint echt der Hammer zu sein..... N&#228;here Info`s folgen dann im Nachbericht zum BYH Festival!</P>

<p>Ein Forum hatten wir mal f&#252;r kurze Zeit auf unserer HP, aber wirklich sinnige Diskussionen wurden da eigentlich nicht gef&#252;hrt. Vielmehr wurde da nur rumgebl&#246;delt und alles etwas in`s L&#228;cherliche gezogen. Vielleicht richte ich ein Forum demn&#228;chst nochmal testweise ein, aber wenn das dann nochmals so in die Hose geht, fliegt das Teil gleich wieder raus.</P>

<p>Ach ja, eigentlich wollte ich hierzu nix sagen, aber da Du das Thema im Leserbrief an Wolf schon angeschnitten hast: Mir ist es eigentlich egal, ob jemand Artikel in zwei Mags ver&#246;ffentlicht (mache ich mit der Metal Corner ja auch so!). Aus diesem Grunde hatte ich auf einen Comment zur Brimstone Saga (Kult!!) und dem CD Test zur &quot;Airsoft CD&quot; verzichtet - solange man es nicht mit dieser Wiederverwertung &#252;bertreibt, ist doch alles in Butter. Und immerhin erreicht man so noch einige User mehr, die den Artikel vielleicht noch nicht kennen!</P>

<p>Alles weitere dann in der Fireball! See ya!!</P>
<hr>
<a name="rene.html">
<p><b>Gr&#252;&#223; Dich Rene!</B><br>
Ich wollte nur kurz auf ein Statement Deinerseits in der letzten NC eingehen:</P>

<p><i>&quot;Antwort: Ganz einfach, Amiga und Co. sind nicht bl&#246;de, und wollten mal sehen, wie das verh&#228;ltnis zu den BoingBagdownload und den tats&#228;chlichen verkauften OS 3.9 Versionen verh&#228;lt. Das Ergebnis ist nicht gerade erfreulich!&quot;</P></I>

<p>Mag sich auf den ersten Blick logisch anh&#246;ren, ist es aber alleine schon deswegen nicht, als das das &quot;Boing Bag&quot; auch auf der aktuellen Amiga+ Leser CD zu finden war. Damit gibt Amiga die Kontrolle dar&#252;ber wieder ganz aus der Hand (was ich durchaus begr&#252;&#223;e, ist doch nicht jeder bereit sich 5 MB aus dem Netz zu laden; ganz zu schweigen von den ganzen Usern, die keinen Netz Zugang haben), wobei man jetzt auch so konsequent sein k&#246;nnte und das Teil auch in`s Aminet stellen sollte. Wie habe ich eigentlich den letzten Satz zu verstehen? Kennst du die genauen Daten der Downloadquote und den verkauften Versionen? Spekulativ ist zwar alles, aber ich denke mal, da&#223; Amiga solche Daten eigentlich f&#252;r sich beh&#228;lt....</P>

<p>Bis dann!</P>
<hr>
<a name="top.html">

<p><h2><center><font color="green">Top 5</font></center></h2></P>

<p>1. Alle Artikel von Wolf <br>
2. Kabelkiller von Cord Hagen<br>
3. Frodo von Butcher<br>
4. Land Of Genesis von Andreas Guldner<br>
5. Boing Bag 2 von Saint</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
