<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
<script language="JavaScript">
<!--
//Dieses Skript stammt von Michael Mailer´s JavaScripts
          //URL: http://www.webaid.de/js  --  eMail: mm@webaid.de
          //Bitte   entfernen   Sie   diesen   Vermerk   nicht  !
          function umrech()
          {

          checkform()
          var b=document.form.geld.value;
          var d=1.95583;
          var x = b/d;
          //document.form.euro.value = "";
          var z=Math.round(x*100)/100
          document.form.euro.value = z;
          }

          function checkform ()
          {
          if (document.form.geld.value == "")
          alert ("Betrag eingeben");
          document.form.geld.focus ();
          document.form.geld.select ();
          }

function MM_openBrWindow(theURL,winName,features) { //v2.0
  window.open(theURL,winName,features);
}
//-->
</script>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#c0c0c0">
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Der Euro zum
Dritten</b></font><br> Auszug aus "www.schlafmuenzen.de"</center>

<table width=100% border=0 cellpadding=8> <tr><td>

<p><img src="st_euro3.jpg" width=320 heigth=230 align=left hspace=8>Auf der
neben abgebildeten Homepage "www.schlafmuenzen.de" ist auch eine Seite f&uuml;r
die Kinder eingerichtet, in der (oder hei&szlig;t es: auf der) die Kinder sich
&uuml;ber die Entwicklung des Geldes, den Bargeldumtausch und dessen
Auswirkungen auf das Taschengeld informieren k&ouml;nnen. Und in einem
Spiel k&ouml;nnen sie feststellen, ob sie alle im Kinderzimmer versteckten
Schlafm&uuml;nzen aufst&ouml;bern k&ouml;nnen. <br clear=all></p>

<p>Und das ist der Text, der in obigen gelben Feld steht:
<blockquote>
Am 01. Januar 2002 bekommen wir alle neues Geld. Von da ab wird der Euro
das sein, was bisher die D-Mark war. <br>

Schon jetzt k&ouml;nnt ihr eure Spardosen zur Bank bringen und auf eurem
Sparbuch einzahlen, denn Geld das auf der Bank liegt, wird automatisch
umgetauscht und ihr m&uuml;sst im Januar nicht Schlange stehen.<br>

Wie Geld eigentlich entstanden ist und noch viel wichtiger, was nach der
Bargeld-Umstellung mit eurem Taschengeld passiert, k&ouml;nnt ihr auf
dieser Seite herausfinden. <br> <br>

Au&szlig;erdem gibt es ein witziges Spiel in dem ihr die
&quot;Schlafm&uuml;nzen&quot; einfangen m&uuml;sst.<br>
<u><font color="#0000ff">Probiert es doch mal aus</font></u>
</blockquote></p>

<p>Das Problem Taschengeld wird auch vordergr&uuml;ndig aufgegriffen. <br>

<b>Mein Taschengeld - bald nur noch die H&auml;lfte Wert?</b></p>

<p>Und so wird es ungef&auml;hr dargestellt: <br>

Am 01. Januar 2002 bekommen alle neues Geld. Die DM hei&szlig;t dann
pl&ouml;tzlich Euro und statt 10 Mark wie fr&uuml;her gibt es dann nur noch
5 Euro Taschengeld. Haben alle Kinder etwas angestellt, dass es zu dieser
ungerechten Taschengeldk&uuml;rzung kommt? </p>

<p>Nein, denn wenn man es genau betrachtet ist das Taschengeld gar nicht
gek&uuml;rzt worden! </p>

<p>Wer schon mal mit seinen Eltern im Urlaub war, wei&szlig;, dass die Leute
in Spanien, Frankreich und Italien ganz anderes Geld haben, als wir hier in
Deutschland. Die Spanier zahlen mit Peseten, die Franzosen mit Franc und
die Italiener mit Lire. Ein ziemlicher Wirrwarr von Geld ist da im Umlauf.
</p>

<p>Im Urlaub ist das kein Problem, da f&auml;hrt man dann zwei Wochen da hin
und tauscht danach das &uuml;brig gebliebene Geld wieder um. Aber wenn ihr
jetzt mal im Supermarkt schaut: Da gibt es Wein aus Italien, Gurken und
K&auml;se aus Holland, Blumen aus Belgien und Obst aus Spanien. Wenn der
Chef vom Supermarkt das bestellt, muss er das dem Erzeuger auch immer in
dessen Landesw&auml;hrung zahlen. Das hei&szlig;t, eigentlich muss er
st&auml;ndig 12 verschiedene W&auml;hrungen bei sich tragen um jeden
Lieferanten bezahlen zu k&ouml;nnen. Daher haben die Europ&auml;er
beschlossen, sich alles viel einfacher zu machen, und haben sich eine
einheitliche W&auml;hrung ausgedacht, die f&uuml;r alle gilt. </p>

<p>Schon seit dem 01. Januar 1999 gilt diese W&auml;hrung, hat bisher
blo&szlig; noch niemand gemerkt, weil das alles &uuml;ber die Banken ging.
Da wurde dann immer das Geld, das der K&auml;ufer gegeben hat, in Euro
umgerechnet, dann an den Verk&auml;ufer &uuml;berwiesen und der hat es dann
wieder in seine Landesw&auml;hrung umrechnen k&ouml;nnen. </p>

<p>Und am 01. Januar 2002 ist es dann soweit, da kommt dann der Euro auch ins
Portemonnaie.</p> 

<p>Aber wie war das jetzt mit dem Taschengeld - warum gibt es davon jetzt
weniger?<br>

Langsam! Es wird nicht weniger! Und zwar deswegen: </p>

<p>Wenn man fr&uuml;her im Urlaub nach Italien gefahren ist hat das Eis da
pl&ouml;tzlich 990 Lire gekostet, ziemlich viel sollte man meinen, denn bei
uns in Deutschland kostet das gleiche Eis gerade mal 1 Mark. Wenn ich aber
auf die Bank gehe und meine deutsche Mark in italienische Lire umtausche
bekomme ich f&uuml;r 1 Mark 990 Lire. Also eigentlich kann ich f&uuml;r
eine Mark in Italien und Deutschland genau gleich viel Eis bekommen. Ich
muss nur vorher umtauschen.... und genau das f&auml;llt jetzt mit dem Euro
weg. Wir tauschen jetzt einfach alle zusammen unser Geld in die eine neue
W&auml;hrung um, und m&uuml;ssen dann nie wieder tauschen. </p>

<p>Der Umtauschkurs ist festgelegt, wenn ich einen Euro haben will, muss ich
daf&uuml;r ungef&auml;hr 1,96 Mark geben.</p>
            
<p>Und hier hei&szlig;t es jetzt aufgepasst, denn sonst droht doch noch eine
Taschengeldk&uuml;rzung! </p>

<p>10 DM Taschengeld sind n&auml;mlich nur ungef&auml;hr 5 Euro!! </p>

<p>Genau gerechnet kriegt ihr n&auml;mlich f&uuml;r 10 DM 5 Euro und 11 Cent
(fr&uuml;her Pfennig)! </p>

<p>Vorsicht ist also angesagt. F&uuml;r die 11 Cent gibt es 2 Streifen
Kaugummi, 17 Gummib&auml;rchen oder eine halbe Pok&eacute;mon-Karte!!</p>


<p>Und damit euch beim Euro Umtausch niemand mit dem Taschengeld &uuml;bers
Ohr haut k&ouml;nnt ihr hier ausrechnen, wie viel ihr bekommen
m&uuml;sst.</p>

<p>Einfach euer Taschengeld in die Leiste unten eintragen und auf den
Umrechnen Knopf dr&uuml;cken. Schon k&ouml;nnt ihr genau sehen, wie viel
vom neuen Geld ihr zu kriegen habt! Bitte achtet darauf das Ihr einen Punkt
und kein Komma benutzt, z.B. 10.25 DM und nicht 10,25 DM. </p>


<form name="form">
  <table border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td class="txt">Euer derzeitiges Taschengeld in DM</td>
      <td><img src="../images/1x1.gif" width="15" height="1"></td>
      <td>
        <input type="text" name="geld" size="10" class="form">
      </td>
    </tr>
    <tr>
      <td colspan="3"><img src="../images/1x1.gif" width="1" height="5"></td>
    </tr>
    <tr>
      <td class="txt">Soviel bekommt Ihr in Euro</td>
      <td>&nbsp;</td>
      <td>
        <input type="text" name="euro" size="10" class="form">
      </td>
    </tr>
    <tr>
      <td colspan="3"><img src="../images/1x1.gif" width="1" height="5"></td>
    </tr>
    <tr align="right">
      <td colspan="3">
        <input type="button" value="Umrechnen" name="Umrechnen" onClick="umrech()" class="txt">
        <input type="reset" value="L&ouml;schen" name="reset" class="txt">
      </td>
    </tr>
  </table>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
