<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#c0c0c0">
<a name="top"></a><br>

<center><img src="st_ehome1.gif" width="453" height="46" border="0"><br>
<font size="+1">Auf gut Deutsch = Heimautomatisierung</font></center>
<br>
<table width=100% border=0 cellpadding=8>
<tr><td>

<p>Du bist unterwegs, und es wird schon dunkel. Ob zu Hause wohl alles
stimmt? Mal nachschauen! O.K., Ger&auml;te und Heizung laufen
st&ouml;rungsfrei.</p>

<p> Jetzt also die Jalousien herunterfahren, die Raumtemperatur
erh&ouml;hen und die Au&szlig;enbeleuchtung anschalten. Und das alles
einfach &uuml;ber Handy oder Internet! </p>

<p>eHome Services erm&ouml;glicht &uuml;ber ein personalisiertes
Internetportal, &uuml;ber ein WAP-Portal sowie &uuml;ber eine
sprachgest&uuml;tzte Men&uuml;f&uuml;hrung am Telefon den Zugriff auf
verschiedenste Funktionen im Haus. &Uuml;ber eHome Services k&ouml;nnen zu
jeder Zeit und von jedem Ort Licht, Ger&auml;te, Heizungen etc. gesteuert
werden."</p>

<p><img src="st_ehome1a.gif" width=323 height=402 align=left
hspace=6>Dieses Bild ist gleich auf der Startseite von
<b>"www.eHome-Services.de"</b>, einer Website, die zu RWEavanza dem
hiesigen Energie- Versorgungsriesen geh&ouml;rt. Es ist ein "Spiel", das
aber nur funktioniert, wenn folgende Abfrage positiv beschieden wird:
"Check for Flash version 4 or greater in Netscape". Bevor wir uns nun in
wilde Spekulationen begeben, was das alles eigentlich ist, rufen wir
einfach den Punkt <a href="st_ehome2.html"> <img src="st_ehome1b.gif"
width="85" height="22" border=2> </a> auf und lesen den Punkt, der uns
interessiert. </p>

<p>Wer steckt nun eigentlich dahinter? <br>
<img src="st_ehome1c.gif" width="145" height="22" border=0><br>
Unter dieser Schaltfl&auml;che steht u.a. folgender Text: </p>
 
<p>RWE Powerline GmbH ist eine Tochtergesellschaft der RWE Plus AG. Wir
entwickeln und vermarkten innovative Dienstleistungen in den Bereichen
Kommunikation &uuml;ber das Stromnetz, ferngesteuerte Hausautomation,
Sicherheitsmanagement und zuk&uuml;nftig auch Energiemanagement und
Bild&uuml;bertragung. </p>

<p>Die RWE Powerline GmbH wurde am 27.06.2000 in Essen gegr&uuml;ndet und
besch&auml;ftigt zur Zeit 40 Mitarbeiter. </p>

<p>Chronik der RWE Powerline:<ul>

<li>Seit den 1920er Jahren nutzt RWE die Stromleitungen f&uuml;r den
Datentransport</li>

<li>1997 RWE Energie gr&uuml;ndet die PLC-Projektgruppe, die Zusammenarbeit
mit Ascom beginnt</li>

<li>M&auml;rz 1999 Erster Feldtest der RWE Powerline-Technologie in
Leichlingen mit Internet-Zugang und Telefonie</li>

<li>Februar 2000 Pr&auml;sentation der Vorserienprodukte auf der CeBit
2000</li>

<li>Mai 2000 Start des Markttests f&uuml;r den Internet-Zugang in Essen mit
200 Kunden</li>

<li>Juli 2000 Gr&uuml;ndung der RWE Powerline GmbH</li>

<li>November 2000 Live-Demonstration der RWE Powerline-Produkte auf der
Hauptversammlung der RWE AG</li>

<li>Fr&uuml;hjahr 2001 Marktstart mit Internet, Sicherheit und eHome
Services</li> </ul></p>

<p>Aber nun zum eigentlichen Thema: Online-Fernsteuerung. <br>
<img src="st_ehome1d.gif" width="134" height="18" border="0"><br>
Mit eHome Fernsteuerung ist es Ihnen m&ouml;glich, Anlagen und Ger&auml;te
in Ihrem Haus zu steuern und zu automatisieren. Ob Heizungsregulierung,
Lichtsteuerung oder Ger&auml;teschaltung - auch von au&szlig;erhalb
k&ouml;nnen Sie jetzt jederzeit zentrale Funktionen Ihres Hauses
kontrollieren und steuern! In Zukunft werden weitere Ger&auml;te wie TV-
und Musikanlagen und Haushaltsger&auml;te, etwa Kaffeemaschine,
K&uuml;hlschrank, Gefrierschrank, Wasch- und Sp&uuml;lmaschine,
hinzukommen. Die bange Frage, ob Sie auch wirklich die Kaffeemaschine
ausgeschaltet haben, wird ein f&uuml;r allemal der Vergangenheit
angeh&ouml;ren! </p>

<p>Intelligent einfach<br>
Die Idee ist so einfach wie genial: eHome Services vernetzt die Ger&auml;te
untereinander und mit dem Internet. &Uuml;ber ein personalisiertes Portal,
das Ihre individuellen Daten vorh&auml;lt, haben Sie jederzeit Zugriff auf
Ihre Anlagen und Ger&auml;te. Dabei nutzen wir unsere Internet-Plattform,
um Ihnen einen sicheren und ausbauf&auml;higen Dienst anzubieten. </p>

<p> So k&ouml;nnen Sie die Kontrolle, Steuerung und Automatisierung Ihrer
Anlagen und Ger&auml;te schrittweise um zahlreiche Mehrwertdienste etwa im
Bereich der Energieoptimierung erweitern. </p>

<p> Komfort und mehr: Das &quot;kommunizierende Haus&quot; kann auch
f&uuml;r Sie Wirklichkeit werden! </p>

<p><img src="st_ehome1e.gif" width="105" height="22" border="0"><br>
Security - die sichere Wahl! <br>
        
Mit eHome Security wird die RWE in K&uuml;rze Ihr eHome Services-Angebot
weiter komplettieren. Ihr Heim wurde bislang durch die angebotenen eHome
Services komfortabler - jetzt wird es auch noch sicherer! </p>


<p>eHome Security, das ist Schutz f&uuml;r Ihr Haus, Ihre Wohnung, Ihr
Objekt - rund um die Uhr. Nutzen Sie eHome Security f&uuml;r ein optimales
Ma&szlig; an Sicherheit. Einbruchmelder, Rauchmelder, schlie&szlig;lich
sogar Video&uuml;berwachung - und das alles wird &uuml;ber das Internet
steuerbar! </p>

<p> Dann werden Sie &uuml;ber Mobilfunk, Telefon oder Internet direkt
informiert. Zus&auml;tzlich k&ouml;nnen Sie auch eine Sicherheitszentrale
in Ihr Sicherheitskonzept einbinden.</p>

<p>Einbruch, Brand oder technische St&ouml;rung - eHome Security!

<p><img src="st_ehome1f.gif" width="162" height="22" border="0"><br>

Mit eHome Energiemanagement wird Ihnen die RWE hier in K&uuml;rze eine
Dienstleistung anbieten, die schon aus Tradition eine St&auml;rke des
Unternehmens ist. Ihr Energieverbrauch wird durch eHome Energiemanagement
transparent. </p>

<p> eHome Energiemanagement bietet Ihnen neben dem komfortablen Zugriff auf
die Heizungsanlage eine Menge zus&auml;tzlicher Applikationen rund um das
Thema Energie und Zuhause. Interaktive Energiespartipps und
Modernisierungsratschl&auml;ge zeigen Ihnen, wie Sie auf einfachem Wege
Geld und Energie sparen k&ouml;nnen. An einem Musterhaus k&ouml;nnen Sie
die Modernisierung direkt in die Tat umsetzen und sehen, was es bringt und
was es kostet. Mit dem Energierechner bestimmen Sie anhand weniger Eingaben
Ihr m&ouml;gliches Einsparpotenzial und erfahren, wie Sie im Vergleich zu
anderen liegen. Das Energietagebuch erm&ouml;glicht es Ihnen, Ihre
Verbrauchsdaten, egal ob Strom, Gas oder Wasser, zu dokumentieren und
auszuwerten. </p>

<p>F&uuml;r weitere Informationen bitte selber auf der Homepage nachlesen !
</p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff"> <td>Autor: &nbsp; <a href="Mitglieder/zimmer.html">
<b>Wolf Zimmer</a></b> </td> <td>E-Mail: <a href="mailto:wolf@wozim.de"><b>
wolf@wozim.de</a></b> </td> <td>Homepage:
<a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
