<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#c0c0c0">
<a name="top"></font>

<center><font color="#000080" size="7"><b>FAQ</b></font></center>

<table width=100% border=0 cellpadding=4 cellspacing=1>
<tr><td width=26>&nbsp;<td><dt>&nbsp;</td></tr>
 <tr>
   <td colspan=2> &nbsp; 1. &nbsp;<b><font color="#0000ff"> Was ist unter dem Produkt eHome
   Services zu verstehen?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Das Produkt eHome Services umfa&szlig;t ein Hausautomationssystem und
   Dienstleistungen, die dem Anwender die Steuerung und Automatisierung von
   Heizungsanlagen, Licht, Haushaltsger&auml;ten und Jalousien etc. im Haushalt
   erm&ouml;glichen. Der Nutzer kann von unterwegs aus &uuml;ber das Internet bzw. das
   Telefon die Ger&auml;te in seinem Zuhause steuern sowie wiederkehrende Szenarien
   automatisieren. Dem Kunden wird hierzu ein Hardware-Starterpaket verkauft,
   das aus einer Zentraleinheit (dem Hometronic Manager), mehreren
   Steuermodulen wie intelligenten Heizungsreglern, Schaltern, Dimmern,
   Sensoren etc. besteht. Dar&uuml;ber hinaus erh&auml;lt der Kunde ein Gateway, das die
   Kommunikation mit den Endger&auml;ten &uuml;ber das Internet erm&ouml;glicht. </td>
</tr>

<tr>
   <td colspan=2> &nbsp; 2. &nbsp;<b><font color="#0000ff"> Was umfasst das
   Starterpaket?</font></b></td>
</tr>
<tr><td>&nbsp;</td><td>
   Das Starterpaket besteht aus folgenden Komponenten: <ul>
<li>1 Zentraleinheit (Hometronic Manager) inklusive Netzteil </li>
<li>4 Steuerungsmodule (individuell w&auml;hlbar): </li>
<li>- Heizk&ouml;rperregler zur Einzelraumtemperatursteuerung </li>
<li>- Schaltmodul </li>
<li>- Steckerschaltmodul </li>
<li>1 Gateway mit Netzteil und Transceiver-Modul </li></ul>

   Beschreibung der Komponenten: <ul>

<li> Zentraleinheit (Hometronic Manager) <br>
   Dialogf&auml;hige Zentrale mit gepr&uuml;fter Funktechnologie zur Zeit- und
   Energiesteuerung. Steuerung von 16 Temperaturzonen sowie bis zu 32
   Modulen f&uuml;r Licht, Rolladen, etc. </li>

<li> Hand-Fernbedienung <br>
   Bedieneinheit mit gepr&uuml;fter Funktechnologie zur ortsunabh&auml;ngigen
   Aktivierung der Automatikprogramme bzw. Ansteuerung der Module. </li>

<li> Heizk&ouml;rperregler <br>
   Regler, der anstelle des bestehenden Heizk&ouml;rperventils aufgeschraubt wird.
   Mit batteriebetriebenem Stellmotor f&uuml;r die stetige Regelung der
   Raumtemperatur. Der Regler pa&szlig;t auf Ventiltypen von Braukmann, MNG,
   Heimeier und Danfoss (mittels Adapter). 2 Standardbatterien erm&ouml;glichen den
   Stellantrieb (Batterielebensdauer ca. 2 Jahre). </li>

<li> Schaltmodul <br>
   Schaltet nach Vorgaben des Hometronic Managers Lampen bzw. elektrische
   Hausger&auml;te ein. Zur Aufputzmontage auf die Verteilerdose des betreffenden
   Stromkreises, der gleichzeitig zur 230-Volt-Stromversorgung dient. </li>

<li> Steckerschaltmodul <br>
   Schaltet nach Vorgaben des Hometronic Managers Lampen bzw. elektrische
   Hausger&auml;te ein (analog zum Schaltmodul). Im Gegensatz zum Schaltmodul ist
   keine Montage erforderlich, da das Steckerschaltmodul lediglich auf die
   Steckdose aufgesteckt wird und der Stecker des anzuschlie&szlig;enden Ger&auml;tes in
   das Steckerschaltmodul eingesteckt wird. </li>

<li> Gateway <br>
   Kommunikationsmodul zur Anbindung des Inhouse-Systems (Hometronic
   Manager) an die Telefon Leitung zur Kommunikation &uuml;ber das Internet bzw.
   &uuml;ber das Telefon. </li></ul></td>
</tr>
<tr>
   <td colspan=2> &nbsp; 3. &nbsp;<b><font color="#0000ff"> Welche Funktionen
   beinhaltet das Produkt?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td> Die angebotenen Funktionen sind: </ul>
<li> Heizungssteuerung <br>
   Einzelne Heizk&ouml;rper werden zentral geregelt. Entweder wunschgem&auml;&szlig; nach
   Zeitprogramm oder spontan nach Lifestyle-Programmen (Lifestyle-Programm =
   Anpassung an sich st&auml;ndig wiederholende Situationen, z. B. Kommen, Gehen,
   Urlaub etc.) sowie von unterwegs &uuml;ber das Internet. <br>
   Nach wie vor bleibt jeder Heizk&ouml;rperregler vor Ort individuell einstellbar am
   Stellrad. </li>

<li> Lichtsteuerung <br>
   Schalten und Dimmen von Lampen &uuml;ber die Fernbedienung bzw. durch Anwahl
   vorprogrammierter Szenarien (z. B. Partybeleuchtung, Dinnerbeleuchtung,
   Arbeitsbeleuchtung etc.). Auch bei Abwesenheit durch Zeitprogramme bzw. &uuml;ber
   das Internet steuerbar. </li>

<li> Ger&auml;testeuerung <br>
   Schalten verschiedenster Hausger&auml;te (z. B. Musik beim Betreten der Wohnung,
   B&uuml;geleisen AUS beim Verlassen der Wohnung). </li></ul>
   Neben den Grundmodulen des Starterpakets k&ouml;nnen weitere Komponenten
   erworben werden: <ul>

<li> Jalousiesteuerung <br>
   Die Rolladenmodule empfangen vom Hometronic Manager die Position in Prozent,
   die der Rolladen einnehmen soll (z. B. Wohnzimmer 75% ge&ouml;ffnet). Trotzdem kann
   der Nutzer jederzeit von Hand eingreifen und Schalter zur Auf- oder
   Abw&auml;rtssteuerung bedienen. <br>
   Gegebenenfalls kann mittels eines Helligkeitssensors sichergestellt werden, da&szlig; die
   Roll&auml;den morgens und abends automatisch in Abh&auml;ngigkeit vom Tageslicht bet&auml;tigt
   werden. </li>

<li> Sicherheitsanwendungen <br>
   Geplant ist ein kosteng&uuml;nstiges Alarmsystem und Alarmmanagement, das den
   Bewohner bzw. andere im Vorhinein definierte Personen im Falle eines Einbruchs
   bzw. Sicherheitsproblems per Telefon (Voice-Nachricht oder SMS) oder &uuml;ber das
   Internet benachrichtigt. </li></ul></td>
</tr>
<tr>
   <td colspan=2> &nbsp; 4. &nbsp;<b><font color="#0000ff"> Welche Vorteile /
   Kundennutzen liefert das Produkt?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td><ul>
<li> Erh&ouml;hter Komfort: <br>
   Indem Ger&auml;te im Haus automatisch bzw. von unterwegs &uuml;ber das Internet oder
   Telefon gesteuert werden k&ouml;nnen (z. B. Musik beim Betreten der Wohnung), wird
   der Wohnkomfort gesteigert. </li>

<li> Energieeinsparpotenziale: <br>
   Durch die bed&uuml;rfnisorientierte Steuerung der Heizk&ouml;rper und Ger&auml;te k&ouml;nnen
   Haushalte bis zu 30 Prozent der Energiekosten j&auml;hrlich einsparen. </li>

<li> Erh&ouml;hte Sicherheit: <br>
   Durch die automatische Steuerung bzw. Fernsteuerung von Beleuchtungen,
   Roll&auml;den und weiteren elektrischen Ger&auml;ten kann eine Anwesenheitssimulation
   realisiert werden, die vor unliebsamen G&auml;sten sch&uuml;tzt. </li></ul></td>
</tr>
<tr>
   <td colspan=2> &nbsp; 5. &nbsp;<b><font color="#0000ff"> Mit welchem
   Kostenaufwand ist eHome Services verbunden?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td><ul>
<li> Starterpaket <br>
   Die einmal zu entrichtenden Hardwarekosten f&uuml;r das Starterpaket
   betragen: 1.898 DM (inkl. MwSt). Wenn Sie weitere Schaltmodule
   w&uuml;nschen, k&ouml;nnen sie diese gegen Aufpreis ebenfalls bei RWE Powerline
   erwerben. Die Kosten f&uuml;r die Installation sind aufwandsabh&auml;ngig.
   Erfahrungsgem&auml;&szlig; belaufen sie sich auf ca. 200 bis 400DM. </li>
<li> eHome Service <br>
   Die Kosten f&uuml;r den eHome-Dienst, der die Fernsteuerung der Ger&auml;te &uuml;ber
   das Internet/ Telefon erst erm&ouml;glicht, betragen DM 19,90 pro Monat. Die
   Mindestvertragslaufzeit ist 2 Jahre. <br>
   F&uuml;r die Freischaltung des Dienstes wird eine einmalige Geb&uuml;hr in H&ouml;he
   von 99 DM erhoben. Diese entf&auml;llt jedoch, sofern der Service vor dem
   31.12.2001 bestellt wird. </li>

<li> Erweiterungsmodule <br>
   (Diese lasse ich hier an dieser Stelle einfach weg.) </li></ul></td>
</tr>
<tr>
   <td colspan=2> &nbsp; 6. &nbsp;<b><font color="#0000ff"> Wie funktioniert
   die Technologie?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Nachdem im Haushalt die Hardware installiert worden ist und der Kunde
   im RWE Powerline System f&uuml;r den eHome-Dienst freigeschaltet worden ist,
   k&ouml;nnen &uuml;ber den Hometronic Manager s&auml;mtliche individuellen Programmierungen
   durch den Nutzer vorgenommen werden. Dem Kunden wird ein Nutzerkennwort
   mitgeteilt, so da&szlig; dieser unter Eingabe eines zus&auml;tzlichen Passwortes auf
   ein personalisiertes Portal, welches die individuellen Daten des Kunden
   vorh&auml;lt, &uuml;ber das Internet bzw. das Telefon auf sein Zuhause zugreifen
   kann. Hier&uuml;ber k&ouml;nnen dann die Ger&auml;te von unterwegs gesteuert werden. Die
   Steuerungsdaten werden hierbei &uuml;ber die Server-Plattform der RWE Powerline
   GmbH an das Gateway im Haus bzw. in der Wohnung &uuml;bermittelt, das die
   Weitergabe der Informationen an den Hometronic Manager und schlie&szlig;lich an
   die angeschlossenen Endger&auml;te regelt. Die Kommunikation an die Endger&auml;te
   innerhalb des Hauses erfolgt &uuml;ber Funk. </td>
</tr>
<tr>
   <td colspan=2> &nbsp; 7. &nbsp;<b><font color="#0000ff"> Wie einfach ist
   die Bedienung?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Die Bedienung des Systems ist sehr benutzerfreundlich und nahezu
   selbsterkl&auml;rend. Es werden keinerlei Vorkenntnisse ben&ouml;tigt. Bei aller
   Automatisierung ist der Mensch der Technik nie hilflos ausgeliefert. Alle
   Funktionen k&ouml;nnen per Hand gesteuert und damit spontan an ver&auml;nderte
   Bedingungen angepa&szlig;t werden. Alle Funktionen sind in einer
   Bedienungsanleitung ausf&uuml;hrlich beschrieben. </td>
</tr>
<tr>
   <td colspan=2> &nbsp; 8. &nbsp;<b><font color="#0000ff"> Wie erfolgt die
   Installation?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Die Installation ist unkompliziert und wird durch Installateure
   durchgef&uuml;hrt bzw. kann durch den ge&uuml;bten Heimwerker selbst vorgenommen
   werden. Es m&uuml;ssen keine Kabel verlegt werden, da die Technik drahtlos &uuml;ber
   Funk kommuniziert. Das Bedienger&auml;t (der Hometronic Manager) ben&ouml;tigt
   lediglich einen Netzanschlu&szlig; und wird an der Wand befestigt, kann aber auch
   an jedem anderen Ort aufgestellt werden. Die Heizk&ouml;rperregler werden
   einfach auf die Ventilk&ouml;rper der Radiatoren aufgeschraubt, d. h., es wird
   nicht in den Heizkreislauf eingegriffen (das Rohr bleibt geschlossen). Die
   Schaltermodule werden als Aufputzdose &auml;hnlich dem Anschlu&szlig; einer Steckdose
   montiert. Die Steckerschaltmodule werden einfach nur in die Steckdose
   eingesteckt. Alle Komponenten k&ouml;nnen einfach wieder abgeschraubt und bei
   einem Umzug mitgenommen werden. </td>
</tr>
<tr>
   <td colspan=2> &nbsp; 9. &nbsp;<b><font color="#0000ff"> Wie lange dauert
   die Installation?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Die Installation f&uuml;r das Basispaket dauert weniger als einen halben Tag.</td>
</tr>
<tr>
   <td colspan=2>10. &nbsp;<b><font color="#0000ff"> Wo k&ouml;nnen die Produkte
   bezogen werden?</font></b></td>
</tr>
<tr><td>&nbsp;</td>

   <td>Die Produkte bezieht der Kunde direkt bei der RWE Powerline GmbH. Der
   Kunde kann die Bestellung im Customer Care Center vornehmen (telefonisch)
   oder &uuml;ber das Internet bestellen, indem er das Bestellformular herunterl&auml;dt
   und ausgef&uuml;llt an das Customer Care Center schickt. br>

   Bei Bestellung des Produkts &uuml;ber das Call Center werden Name und Adresse
   des Kunden aufgenommen und die Informationsunterlagen sowie das
   Bestellformular gehen dem Kunden im Anschlu&szlig; per Post zu. Das
   Bestellformular mu&szlig; vom Kunden unterschrieben an die RWE Powerline GmbH
   zur&uuml;ckgeschickt werden. Sobald der Antrag eingegangen ist, wird nach einer
   Pr&uuml;fung der Kundendaten die Hardware durch einen Marktpartner, der f&uuml;r das
   Zielgebiet des jeweiligen Kunden zust&auml;ndig ist, zum Kunden geliefert und
   installiert. Parallel wird der Dienst freigeschaltet. </td>
</tr>
<tr>
   <td colspan=2> 11. &nbsp;<b><font color="#0000ff"> Welche Erweiterungsm&ouml;glichkeiten
   gibt es?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Das System ist modular aufgebaut und kann beliebig um weitere Steuermodule
   erweitert werden. Maximal k&ouml;nnen &uuml;ber einen Hometronic Manager  16
   Temperaturzonen sowie bis zu 32 Module f&uuml;r Licht, Rolladen etc. gesteuert
   werden. </td>
</tr>
<tr>
   <td colspan=2> 12. &nbsp;<b><font color="#0000ff"> Wie sicher ist das
   Produkt? K&ouml;nnen Fremde &uuml;ber den Computer auf mein Zuhause zugreifen?</font></b></td>
</tr>
<tr><td>&nbsp;</td> 
   <td>Das System erf&uuml;llt h&ouml;chste Sicherheitskriterien. Der Zugriff erfolgt
   autorisiert &uuml;ber Firewalls und durch Login mit Passwort auf die eigene
   Homepage. Bei der &Uuml;bermittlung sensibler Daten besteht h&ouml;chste
   Zugriffssicherheit, d.h., es werden dem Home-Banking &auml;hnliche
   Sicherheitsstandards gew&auml;hrleistet. </td>
</tr>
<tr>
   <td colspan=2> 13. &nbsp;<b><font color="#0000ff"> Das System arbeitet
   mit Funk-Technologie. Kann das einen sch&auml;dlichen Einfluss auf die Gesundheit
   haben?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Die Sendeleistung des Systems ist im Bereich von 1 Milliwatt so
   ausgelegt, da&szlig; eine wirklich nur unwesentliche Funkstrahlung vorhanden ist.
   Zum Vergleich: Die Sendeleistung eines D-Netz- Mobiltelefons ist 2.000-mal
   h&ouml;her. </td>
</tr>
<tr>
   <td colspan=2> 14. &nbsp;<b><font color="#0000ff"> Was passiert, wenn mehrere
   Parteien in einem Mehrfamilienhaus das System einsetzen? Entstehen hierbei
   Interferenzen?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Gar nichts, denn die Funkwellen st&ouml;ren sich nicht gegenseitig, es ist
   eine sichere Daten&uuml;bertragung gew&auml;hrleistet. Hierf&uuml;r wurde speziell ein
   ausgekl&uuml;geltes Verfahren entwickelt. Jeder Hometronic Manager verf&uuml;gt &uuml;ber
   eine einmalig vergebene sogenannte "Object ID", die ihn eindeutig
   identifiziert. </td>
</tr>
<tr>
   <td colspan=2> 15. &nbsp;<b><font color="#0000ff"> Wie erfolgt die Anbindung
   ans Internet?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Die Anbindung an das Internet erfolgt &uuml;ber das Gateway, das die
   Kommunikation zwischen der Internetplattform und dem Hometronic Manager im
   Zuhause &uuml;bernimmt. Das Gateway wird hierzu an den Telefonanschlu&szlig;
   angeschlossen. Die Verbindung zwischen Gateway und Hometronic Manager
   erfolgt &uuml;ber Funk. </td>
</tr>
<tr>
   <td colspan=2> 16. &nbsp;<b><font color="#0000ff"> Wird eine spezielle
   Telefonleitung ben&ouml;tigt?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Es wird eine analoge Telefonleitung ben&ouml;tigt, wie sie in fast jedem
   Haushalt derzeit vorliegt. Verf&uuml;gt ein Haushalt &uuml;ber einen ISDN-Anschlu&szlig;,
   so mu&szlig; eine Wandlerbox daran angeschlossen sein, die den Anschlu&szlig; analoger
   Ger&auml;te an den ISDN-Anschlu&szlig; erm&ouml;glicht. In den meisten F&auml;llen verf&uuml;gen
   Haushalte, die einen ISDN Anschlu&szlig; haben, auch &uuml;ber diesen Wandler. </td>
</tr>
<tr>
   <td colspan=2> 17. &nbsp;<b><font color="#0000ff"> Wird ein Computer ben&ouml;tigt?
   </font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Nein, das Starterpaket enth&auml;lt alle ben&ouml;tigten Komponenten. Zentrales
   Bedienelement ist der Hometronic Manager &uuml;ber den alle Funktionen gesteuert
   werden k&ouml;nnen. Auch zum Abrufen des Ger&auml;testatus sowie der Ger&auml;testeuerung
   wird kein Computer ben&ouml;tigt, da eine Steuerung auch &uuml;ber Handy m&ouml;glich ist.
   </td>
</tr>
<tr>
   <td colspan=2> 18. &nbsp;<b><font color="#0000ff"> Wie lange dauert es, bis
   das Produkt und der Dienst geliefert und installiert sind (beginnend vom
   Zeitpunkt der Bestellung)?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Ca. 2-5 Wochen</td>
</tr>
<tr>
   <td colspan=2> 19. &nbsp;<b><font color="#0000ff"> Funktioniert der eHome
   Service mit jedem Online-Dienst?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Ja, d. h., der Nutzer mu&szlig; sich hier&uuml;ber keine Gedanken machen! Beim
   Einloggen auf die Internet-Plattform (d.h. die Strecke vom Computer des
   Nutzers, mit dem er von unterwegs auf sein Zuhause zugreifen m&ouml;chte) spielt
   der Online-Dienst keine Rolle. Die Kommunikation zwischen der RWE Powerline
   Internet-Plattform und dem Gateway des Nutzers wird &uuml;ber einen Partner-ISP
   der RWE Powerline GmbH gew&auml;hrleistet. </td>
</tr>
<tr>
   <td colspan=2> 20. &nbsp;<b><font color="#0000ff"> Werden Kundendaten an
   Dritte weitergegeben?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Nein! </td>
</tr>
<tr>
   <td colspan=2> 21. &nbsp;<b><font color="#0000ff"> Kann die Fernsteuerung nur
   &uuml;ber Internet oder auch &uuml;ber Telefon vorgenommen werden?</font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Die Steuerung ist sowohl &uuml;ber Internet, als auch &uuml;ber Telefon m&ouml;glich. </td>
</tr>
<tr>
   <td colspan=2> 22. &nbsp;<b><font color="#0000ff"> Wann ist der Marktstart?
   </font></b></td>
</tr>
<tr><td>&nbsp;</td>
   <td>Die Produkte werden ab M&auml;rz 2001 im Rahmen eines regionalen Markttests
   im Raum Essen/M&uuml;lheim/Ratingen verf&uuml;gbar sein. Der bundesweite Marktstart
   ist f&uuml;r die zweite Jahresh&auml;lfte 2001 geplant. </td>
</tr>
</table>
<a href="javascript:history.back()"> <b><font size=+1>Zur&uuml;ck </font></b></a>

</body>
</html>
