<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#c0c0c0">
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Der Euro zum Zweiten</b></font><br>
Auszug aus www.aktion-euro.de </center>
<br>
<table width=100% border=0 cellpadding=8>
<tr><td>
<h2>Endlich eine W&auml;hrung, die zu jungen Europ&auml;ern passt. </h2>

<p><img src="st_euro2.jpg" width=260 heigth=130 align=left hspace=6>
 Der Euro ist ein gutes Geld f&uuml;r junge Leute. Schlie&szlig;lich hat
man vieles gemeinsam: Man wird von den &quot;Alten&quot; skeptisch
be&auml;ugt, jeder meint, einem gute Ratschl&auml;ge erteilen zu
m&uuml;ssen und niemand kann den wahren Wert richtig einsch&auml;tzen.
Daf&uuml;r geh&ouml;rt einem die Zukunft und man sieht auch besser aus.
<br><br>Jedenfalls bringt der Euro besonders f&uuml;r Menschen unter 30
viele Vorteile. Es wird leichter, im Ausland zu lernen und zu arbeiten, zu
reisen und Kontakte zu kn&uuml;pfen. </p>

<h2>Deine M&ouml;glichkeiten im Euro-Land </h2>

<p>Ein Aufenthalt im Ausland bringt dir enorm viel: wertvolle
Freundschaften, internationale Kontakte, Selbstbewusstsein,
Sprachkenntnisse, neue Sichtweisen und Toleranz. Dank des Europ&auml;ischen
Binnenmarktes ist garantiert, dass die europ&auml;ischen Zertifikate auch
&uuml;berall anerkannt werden. <br><br>Es hei&szlig;t: Jeder
B&uuml;rger und jede B&uuml;rgerin der EU darf in jedem Mitgliedsland der
Union leben, lernen und arbeiten. Der Binnenmarkt ist auch ein
europ&auml;ischer Arbeitsmarkt. <br><br>Sch&ouml;n! Aber wie
komme ich jetzt zu meinem Auslandsaufenthalt? Informiere dich hier
&uuml;ber deine M&ouml;glichkeiten. </p>

<h2>Bildung ma&szlig;geschneidert </h2>

<p>1. Schritt informieren! (etwa ein Jahr im Voraus, die
Bewerbungsfristen sind langwierig!) Es existieren eine Reihe von staatlich
gef&ouml;rderten F&ouml;rderprogrammen und Austauschprogrammen. <ul>
<li> &quot;LEONARDO II&quot; Ein Programm der EU zur F&ouml;rderung
der beruflichen Bildung </li>
<li> Carl Duisburg Gesellschaft e. V. (CDG) Nationale
Koordinierungsstelle f&uuml;r den Austausch von Jugendlichen in der
Ausbildung </li></ul>
Diese Programme sind an bestimmte Bedingungen gekn&uuml;pft, d. h. Alter,
Art der Ausbildung usw. Sie sind immer Teil der Ausbildung in Deutschland
und werden als solche anerkannt. Sie bieten vor allem finanzielle
Unterst&uuml;tzung und helfen bei der Organisation des Austausches. Dennoch
ist fast immer eure Eigeninitiative gefragt. </p>

<p>2. Schritt - Sich an die Berufsschule oder den Betrieb wenden, die einen
ausl&auml;ndischen Partner suchen, mit dem der Austausch durchgef&uuml;hrt
werden kann bzw. den Antrag zur F&ouml;rderung stellen. Ist die Ausbildung
bereits beendet, bieten diese Programme auch
F&ouml;rderungsm&ouml;glichkeiten f&uuml;r junge Berufst&auml;tige, die
eine nichtakademische Ausbildung bereits abgeschlossen haben. Auch die
Zentralstelle f&uuml;r Arbeitsvermittlung (ZAV) des Arbeitsamts hilft euch
und vermittelt Austauschprogramme, die i. d. R. komplett organisiert werden
(z. B. Unterkunft). Hierzu werden jedoch Vermittlungsgeb&uuml;hren erhoben.
<br><br>3. Schritt &quot;Der EUROPASS&quot; Berufsbildung best&auml;tigt,
dass der Jugendliche einen Teil seiner Ausbildung im Rahmen eines Programms
im europ&auml;ischen Ausland absolviert hat. Ziel ist es, einem
zuk&uuml;nftigen Arbeitgeber die Einsch&auml;tzungen der erworbenen
Kenntnisse zu erleichtern. Formulare gibt es bei der CDG oder ZAV. </p>

<h2>Die tollsten Stars kommen immer noch aus Europa </h2>

<p> O. k., das Wort &quot;Star&quot; mag amerikanisch sein und aus
Kalifornien stammen und vielleicht sind in der amerikanischen Flagge auch
mehr Sterne als in der europ&auml;ischen, aber die &quot;wahren&quot; Stars
kamen schon immer und kommen immer noch aus Europa. </p>

<p>Wer behauptet, gute Musik kommt nur aus USA oder England? Hier eine
sehr kleine Auswahl aus Euro-Land - wer h&auml;tte das gedacht! 
<blockquote>
<b>Eros Ramazzotti</b><br>
<b>HIM</b><br>
<b>No Angels</b><br>
<b>The Corrs</b><br>
<b>Reamonn</b><br>
<b>Gigi D'Agostino</b>
</blockquote>


<h3>Zum Beispiel <br>
Eros Ramazzotti - Schmachten auf italienisch </h3>

<p>Er ist wieder auf Tour - und tausende seiner meist weiblichen Fans werden
allein schon bei seinem Namen schwach: Eros Ramazzotti. Der
Wahl-Mail&auml;nder ist eine der seltenen musikalischen
Ausnahmeerscheinungen unserer Zeit, ein echter Mega-Star. Sich selber sieht
Eros Ramazzotti jedoch als einen erfolgreichen K&uuml;nstler, der auf dem
Teppich geblieben ist. Aufgewachsen ist Eros Ramazotti in einfachen
Verh&auml;ltnissen eines &auml;rmlichen Viertel Roms, und dort er lernte
fr&uuml;h, sich durchzusetzen. Seinen ersten gr&ouml;&szlig;eren
musikalischen Erfolg konnte Eros Ramazotti im Jahr 1981 mit dem Gewinn
eines Talentwettbewerbs in Italien verbuchen.</p>

<p>Startpunkt seines rasanten Aufstiegs in der internationalen Pop-Szene
jedoch war das San-Remo-Festival, bei dem Eros Ramazotti 1983 in der
Kategorie &#132;Emerging Artist&#147; siegte. Seitdem ging und geht es mit
seiner Karriere steil bergauf. Dabei trat Eros Ramazotti in der
Vergangenheit nicht nur als S&auml;nger, sondern auch als Produzent und
Songschreiber f&uuml;r zum Beispiel Joe Cocker und Gianni Morandi in
Erscheinung. Mittlerweile ist sein Name auch jenseits des Atlantiks zum
Inbegriff von sauber produziertem Italo-Pop in Verbindung mit schmalzigen
Texten und dieser unverwechselbaren Stimme geworden. </p>

<h2>Fremdsprachenkenntnisse machen beliebt und erfolgreich </h2>

<p>Und nicht nur das: Sie sind auch Voraussetzung f&uuml;r fast alle
F&ouml;rderprogramme, die sich auf Aus- und Weiterbildung im Ausland
beziehen. Die Berufschancen steigen nicht nur im Ausland. Auch auf dem
deutschen Arbeitsmarkt gilt: Die interessanteren Jobs werden an Leute
gegeben, die sich &uuml;ber Grenzen hinweg problemlos verst&auml;ndigen
k&ouml;nnen. Und was eine Fremdsprache f&uuml;r Freundschaften bringen
kann, ist wohl unermesslich. </p>

<p>Wer durch die Schule ein eher unwilliges Verh&auml;ltnis zum
Spracherwerb hat, sollte sich nicht entmutigen lassen: Es gibt mittlerweile
ein so vielf&auml;ltiges Angebot an unterschiedlichen Schulen, Lehrmethoden
und vor allem: Lehrpersonal, so dass jeder etwas Angenehmes findet. </p>

<h2>Auch mit kleiner Geldb&ouml;rse l&auml;sst sich Euro-Land gut erfahren </h2>

<p>Man muss weder reich sein noch einen F&uuml;hrerschein haben, um in
Europa gut herumzukommen. Und der Euro erleichtert die Urlaubsplanung: Ohne
umst&auml;ndliche Umrechnung wei&szlig; man schon vorher, was
&Uuml;bernachtung und Fortbewegung kosten. </p>

<p> Nun ein paar n&uuml;tzliche Internet-Adressen rund um das Thema Reisen
in Europa und f&uuml;r die, die ihre Sprachkenntnisse auffrischen wollen,
um Europa noch besser kennen lernen zu k&ouml;nnen: </p>


<h3><b>Sch&uuml;ler und Auszubildende:</b></h3>
<p><u><font color="#0000ff">www.eurogate2000.de</font></u><br>
ist eine Initiative der Bundesregierung und informiert &uuml;ber Austausch,
Praktika und Jobvermittlung. &Uuml;ber 30 Partner stellen hier ihre
Angebote zusammen. </p>

<p><u><font color="#0000ff">www.webforum-jugend.de</font></u><br>
JUGEND f&uuml;r Europa. Ein F&ouml;rderprogramm f&uuml;r alle zwischen 15
und 25 Jahren - hier gibt`s Geld f&uuml;r Jugendinitiativen (F&uuml;r alle,
die zusammen mit anderen eine Idee, ein Projekt in ihrer Nachbarschaft
umsetzen wollen und denen es an Geld und Unterst&uuml;tzung mangelt), den
Europ&auml;ischen Freiwilligendienst (Bis zu einem Jahr im Ausland leben
und arbeiten, Taschengeld, Sprachkurs, neue Kontakte und Erfahrungen
inklusive), und f&uuml;r alle, die schon Europ&auml;ische Freiwillige waren
und eine Idee haben, die sie auf die Beine stellen wollen. </p>

<p><u><font color="#0000ff">www.kmk.org</font></u><br>
Informiert &uuml;ber Austauschprogramme im Schulbereich, kann jedoch nicht
von den Sch&uuml;lern, sondern nur von der jeweiligen Schule direkt
beantragt werden. </p>

<p><u><font color="#0000ff">www.deutsche-kultur-international.de</font></u><br>
Informiert &uuml;bersichtlich, &uuml;ber Sch&uuml;ler- und Jugendaustausch,
mit vielen Links zu weiteren interessanten Infos zum Thema. </p>

<p><u><font color="#0000ff">www.eurodesk.org</font></u><br>
Eurodesk ist ein europ&auml;isches Netzwerk zur Verbreitung von
Europa-Information f&uuml;r Jugendliche, Jugendbetreuer und Einrichtungen
in der Jugendarbeit auf nationaler und regionaler Ebene u.a. auch mittels
Telefonservice. </p>

<p><u><font color="#0000ff">www.dfjw.org</font></u><br>
Ein Portal mit vielen anderen Tipps (Sprachkurse, Unterkunft, Chats, etc.)
Deutsch-Franz&ouml;sisches Jungendwerk  -  unterst&uuml;tzt ein- bis
dreimonatige Betriebspraktika in einem franz&ouml;sischen Unternehmen. Auch
Praktika kurz nach Abschlu&szlig; der Ausbildung werden gef&ouml;rdert.
Sowie ein dreimonatiger Sch&uuml;leraustausch f&uuml;r Sch&uuml;ler der 8.
bis 11. Klasse. </p>

<h3><b>Praktika:</b></h3>
<p><u><font color="#0000ff">www.cdg.de</font></u><br>
Carl Duisburg Gesellschaft e.V. Inationale Koordinierungsstelle f&uuml;r
den Austausch von Jugendlichen in der Ausbildung. </p>

<p><u><font color="#0000ff">www.arbeitsamt.de</font></u><br>
Homepage des Arbeitsamt. Bei der Zentralstelle f&uuml;r Arbeitsvermittlung
(ZAV) des Arbeitsamt gibt es unter: <a href="http://195.185.214.164/iv/"
target="x">http://195.185.214.164/iv/</a> Infos zur Vermittlung von
Arbeitspl&auml;tzen und Austauschprogrammen. </p>

<p><u><font color="#0000ff">www.daad.de/info-f-d/index.html</font></u><br>
Infos zu Praktika im Ausland der Homepage vom deutschen Akademischen
Austauschdienst. </p>

<p><u><font color="#0000ff">www.bafoeg.bmbf.de</font></u><br>
Die Homepage des Bafoeg-Amtes </p>

<p><u><font color="#0000ff">www.interswop.de</font></u><br>
Homepage der InterSwop e.V., Vermittlung von Auslandsaufenthalten zur
F&ouml;rderung der internationalen Zusammenarbeit. </p>

<p><u><font color="#0000ff">www.unicum.de</font></u><br>
Einer der gr&ouml;&szlig;ter Internet Portale f&uuml;r Studenten,
mit einer Praktikumsb&ouml;rse und vielen Tipps rund ums Praktikum. </p>

<p><u><font color="#0000ff">www.de.aiesec.org</font></u><br>
Die internationale Studenteninitiative AESIC vermittelt Auslandspraktika
f&uuml;r alle Fachbereiche. Der Schwerpunkt der Studenteninitiative liegt
im Fachbereich Wirtschaftswissenschaften. </p>

<p><u><font color="#0000ff">www.germany.elsa.org</font></u><br>
Die European Law Students' Association ist eine
unabh&auml;nige, politisch neutrale und als gemeinn&uuml;tzig
anerkannte internationale Organisation von Jurastudenten, Rechtsreferendaren
und jungen Juristen. ELSA vermittelt Praktika im Ausland f&uuml;r
Rechtswissenschaftler. </p>

<p><u><font color="#0000ff">praktikum.wifo.uni-mannheim.de</font></u><br>
Die Universität Mannheim bietet eine der gr&ouml;&szlig;ten
Praktikantenb&ouml;rsen im Internet. Kostenlos ist es hier m&ouml;glich
Suchanfragen und auch eigene Gesuche aufzugeben. </p>

<h3><b>Studium:</b></h3>
<p><u><font color="#0000ff">www.fiu.edu/~escotet/web/europa.html</font></u><br>
Sammlung der Internetadressen der Universit&auml;ten in Europa. </p>

<p><u><font color="#0000ff">europa.eu.int/comm/education/socrates-de.html</font></u><br>
Informiert &uuml;ber die SOKRA-TES-Programme der EU. </p>

<p><u><font color="#0000ff">www.sokrates-leonardo.de/</font></u><br>
Die offizielle Website des EU-Bildungsprogrammes SOKRATES. Dieses Programm
f&ouml;rdert mit ERASMUS den Austausch in allen Bereichen der
Hochschulbildung. </p>

<p><u><font color="#0000ff">citizens.eu.int/de/de/destinationchoice.htm</font></u><br>
Tiefgehende Informationen &uuml;ber die nationalen Schul- und
Hochschulsysteme, Anerkennung von Abschl&uuml;ssen, Foren etc. </p>

<p><u><font color="#0000ff">www.e-fellows.net/home</font></u><br>
Das erste Online-Stipendium Europas. </p>

<h3><b>Sprachen:</b></h3>
<p><u><font color="#0000ff">www.daad.de/info-f-d/sprachlernen/index.html</font></u><br>
Links und Tipps f&uuml;r Sprach-kurse von der Akademischen Auslandsstelle. </p>

<p><u><font color="#0000ff">www.fremdsprachenhomepage.de/</font></u><br>
Datenbank f&uuml;r Sprachschulen, mit kurzer Beschreibung der angebenden
Links. </p>

<p><u><font color="#0000ff">www.mentor.de/magazin/sprachreisen/index.html</font></u><br>
Aktion Bildungsinformation gibt Links und Tipps zu Sprachreisen f&uuml;r
Jugendliche und eine umfangreiche Linkliste f&uuml;r sonstige Themen. </p>

<p><u><font color="#0000ff">www.language-learning.net</font></u><br>
Datenbank f&uuml;r Sprachschulen. </p>

<p><u><font color="#0000ff">www.france.diplomatie.fr/venir/languef/formation/</font></u><br>
Amtliches Verzeichnis des Franz&ouml;sischen Ausw&auml;rtigen Amtes aller
universit&auml;ren, staatlichen und privaten, staatlich anerkannten Schulen
des Französischen als Fremdsprache in Frankreich. </p>

<p><u><font color="#0000ff">www.kultur-frankreich.de/lernen/start.html</font></u><br>
PartnerSite zwischen Frankreich und Deutschland zur Ann&auml;herung an die
beiden Sprachen und F&ouml;rderung des Europaverst&auml;ndnisses. </p>

<p><u><font color="#0000ff">www.it-schools.com</font></u><br>
Verzeichnisse f&uuml;r Sprachschulen in Italien, nach Landkarte bzw. Region
ausw&auml;hlbar. </p>

<p><u><font color="#0000ff">www.goethe.de</font></u><br>
Die Homepage des Goethe Instituts, die Sprachkurse in der ganzen Welt
anbieten. </p>

<p><u><font color="#0000ff">www.cdc.de/</font></u><br>
Die Homepage des Carl-Duisburg-Fremdsprachendienstes. </p>

<h3><b>Reisen:</b></h3>
<p><u><font color="#0000ff">www.interrailers.net</font></u><br>
Eine sehr umfassende Website rund ums Interrail-Reisen, die klassische
Urlaubsart von Europa-interessierten Leuten unter 26. </p>

<p><u><font color="#0000ff">www.deutschebahn.de/home/typ_b_files/db_home_angebote_fuer_junioren.shtml </font></u><br>
Hier gibts die Angebote von der Deutschen Bahn f&uuml;r alle unter 26
Jahren, zum Thema Reisen im Euroland. </p>

<p><u><font color="#0000ff">www.hitchhikers.de/</font></u><br>
Eine kostenlose Mitfahrerzentrale f&uuml;r Europa. Wir haben das Angebot
selbst nicht ausprobiert, aber es macht einen recht seri&ouml;sen Eindruck.
Wer Erfahrungen gemacht hat, kann ans Forum schreiben. </p>

<p><u><font color="#0000ff">www.festivalguide.de/2000/fsuche_form.php3</font></u><br>
Hier findet man so ziemlich alle Festivals die in Europa stattfinden. Und
wie man dort hinreisen kann wird auch erkl&auml;rt. </p>

<h3><b>Internationale Jugenherbergsverb&auml;nde: </b></h3>
<p><u><font color="#0000ff">www.djh.de</font></u><br>
&Ouml;sterreich: &nbsp; &nbsp; <u><font color="#0000ff">www.oejhw.or.at</font></u><br>
Finnland: &nbsp; &nbsp; <u><font color="#0000ff">www.eurohostel.fi</font></u><br>
Frankreich: &nbsp; &nbsp; <u><font color="#0000ff">www.fuaj.org</font></u><br>
Irland: &nbsp; &nbsp; <u><font color="#0000ff">www.irelandyha.org</font></u><br>
Italien: &nbsp; &nbsp; <u><font color="#0000ff">www.hostels-aig.org</font></u><br>
Niederlande: &nbsp; &nbsp; <u><font color="#0000ff">www.njhc.org</font></u><br>
Spanien: &nbsp; &nbsp; <u><font color="#0000ff">www.mtas.es/injuve/intercambios/albergues/reaj.html</font></u><br>
</p>

<h3><b>Suchmaschinen f&uuml;r Kinder:</b></h3>
<u><font color="#0000ff">www.blindekuh.de</font></u><br>
Die erste deutschsprachige Suchmaschine speziell
f&uuml;r Kids. &Uuml;bersichtlich nacht Themen vorsortiert
findet ihr alles was euch interessirt - auch zum Euro. </p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
