<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas gefunden</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#c0c0c0">
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Wissen</b></font><br>
<font color="#000080" size="5">wie es nicht im Lexikon steht </font></center>
<table width=100% border=0 cellpadding=8>
<tr><td><hr>
<p><b><font size=+1>Bauchredner</font></b> bilden ihre Stimme nicht im
Bauch. </p>

<p>Wo dann? </p>

<p>Bauchredner beherrschen eine besondere Atemtechnik. Zudem wird durch
Zusammenziehen der Gaumenb&#246;gen, Zur&#252;ckziehen der Zunge und
Verengung des Kehlkopfeingangs eine starke Resonanzminderung erreicht. Da
sich bei alledem kein Gesichts- und Halsmuskel bewegt, scheint die Stimme
aus dem Bauch zu kommen. </p>

<p>Schon die alten Griechen kannten Bauchredner, deren ber&#252;hmtester
der Athener Eurykles war. Sie nannten die Bauchredner auch
"Bauchwahrsager". Mit &#220;bung und richtiger Anleitung kann jeder
Bauchredner werden und sich dann stolz Ventriloquist nennen. <hr></p>

<p><b><font size=+1>Viele Zugv&#246;gel fliegen in V-Formation. Warum?
</font></b></p>

<p>Langstreckenflieger wie Wildenten und -g&#228;nse fliegen in
V-Formation, weil jeder Vogel durch die von seinem Vordermann erzeugte
<b>Luftstr&#246;mung</b> Kraft spart. Die Ausdauer der Gruppe erh&#246;ht
sich dadurch um &#252;ber 70%. </p>

<p>W&#228;hrend der langen Fl&#252;ge wird der Vogel an der Spitze, der ja
von der Luftstr&#246;mung nicht profitieren kann, regelm&#228;&#223;ig
abgel&#246;st: Jeder f&#252;hrt eine Weile. Ein wirklich sch&#246;nes
Modell f&#252;r das Zusammenwirken einer Gemeinschaft! <hr></p>

<p><b><font size=+1>Die russische H&#252;ndin Laika war der erste
Raumfahrtpionier. </font></b> <br>Welche Tiere leisteten &#196;hnliches
f&#252;r die Luftfahrt? </p>

<p><b>Ein Hammel, eine Ente und ein Huhn. </b><br>

Die Br&#252;der Montgolfier schickten sie beim zweiten Aufstieg eines
Hei&#223;luftballons am 19.September 1783 in die Luft. Nach acht Minuten
landete der Ballon und die Tiere waren bis auf den Hahn unversehrt. Der lag
benommen am Boden, weil ihm der aufgeregte Hammel bei der Landung einen
Tritt versetzt hatte. </p>

Nach diesem Experiment konnte am 21.November des gleichen Jahres der erste
von Personen ausgef&#252;hrte freie Flug einer Montgolfiere unter
F&#252;hrung des Ballonpiloten Jean-Fran&#231;ois Pil&#226;tre Rozier
stattfinden. <hr></p>

<p><b><font size=+1>Welchem Lebewesen gelingt es, nur ein bisschen schwanger
zu sein? </font></b></p>

<p>Dem weiblichen <b>G&#252;rteltier</b>. <br>

Nach der Paarung kann es die Entwicklung des Embryos bis zu drei Jahre lang
hinausschieben. Dadurch wird gew&#228;hrleistet, dass die Jungen nicht zu
Zeiten von D&#252;rre und Nahrungsmangel geboren werden. <hr></p>

<p><b><font size=+1>Welcher Vogel kann r&#252;ckw&#228;rts fliegen?
</font></b></p>

<p>Der <b>Kolibri</b>. Seine Flugtechnik unterscheidet sich von der aller
anderen V&#246;gel. Die F&#228;higkeit auch r&#252;ckw&#228;rts fliegen zu
k&#246;nnen bringt er durch seinen Schwirrflug zustande, bei dem er bis zu
80-mal in der Sekunde mit den Fl&#252;geln schl&#228;gt. Um diese
Enegieleistung vollbringen zu k&#246;nnen hat er ein Herz, das rund
1000-mal in der Minute schl&#228;gt. </p>

<p>In Amerika gibt es 327 verschiedene Arten von Kolibris. Die Vielfalt der
bl&#252;tenbesuchenden Schwirrflieger reicht vom Riesenkolibri, der fast so
gro&#223; wie ein Mauersegler ist, bis zur Bienenelfe, dem kleinsten Vogel
&#252;berhaupt. Er wiegt ganze zwei Gramm, so viel wie ein Viertel eines
Bogens eines normalen Briefpapiers. <hr></p>

<p><b><font size=+1>Vogel-Strau&#223;-Politik! </font></b> <br> Stecken
Strau&#223;e eigentlich wirklich ihren Kopf in den Sand? </p>

<p>Es ist ein <b> hartn&#228;ckiges M&#228;rchen</b>, dass Strau&#223;e bei
drohender Gefahr ihren Kopf in den Sand stecken! In jahrzehntelanger
Beobachtung ist noch nicht ein einziger Fall bezeugt, in dem die
flugunf&#228;higen Laufv&#246;gel dergleichen getan h&#228;tten. Zu dem
Missverst&#228;ndnis k&#246;nnte beigetragen haben, dass Strau&#223;e ihren
Kopf &#246;fter zu Boden schwingen um Ger&#228;usche besser identifizieren
zu k&#246;nnen oder auch nur ihre Nackenmuskeln zu entspannen. <hr></p>

<p><b><font size=+1>Sind Schlangen auch mit Heavymetalmusik zu
beschw&#246;ren? </font></b></p>

<p>Warum nicht? Schlangen sind sowieso taub! Der
<b>Schlangenbeschw&#246;rer </b> bringt die Schlange nicht mit seiner
Musik, sondern mit seinen K&#246;rperbewegungen und den Bewegungen seiner
Fl&#246;te zum "Tanzen". Dabei handelt es sich eigentlich um st&#228;ndige
Angriffs- und Abwehrhaltungen der Schlange, die durch das dauernde Reizen
in einen tranceartigen Erm&#252;dungszustand ger&#228;t. </p>

<p>Schlangenbeschw&#246;rer arbeiten meist mit Kobras, denen oft, aber
nicht immer, die Giftz&#228;hne herausgebrochen wurden. <hr></p>

<p><b><font size=+1>Wie viele F&#252;&#223;e haben Tausendf&#252;&#223;ler
denn nun wirklich? </font></b></p>

<p>Kommt darauf an! Die vor allem in feuchten Biotopen lebenden <b>
Gliedertiere </b> sind heute mit &#252;ber 10.000 Arten &#252;ber die ganze
Welt verbreitet. Da gibt es Arten, die bringen es gerade auf neun
Beinpaare. Die gr&#246;&#223;ten Arten werden bis zu 30 cm lang und haben
dann zwar nicht 1000, aber immerhin 680 Beinchen. </p>

<p>Das reicht aus um ins Stolpern zu geraten! </p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
