<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Foundation - Director`s Cut</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<CENTER><img src="foundlog.jpg"></P><BR>
<img src="found2.jpg"></P><BR></CENTER></P><BR>
Vor geraumer Zeit wurde der Siedler Clone &quot;Foundation&quot; vorgestellt und
entwickelte sich prompt zu einem Verkaufsschlager. Dank der flei&#223;igen Arbeit
des Programmierers Paul Burkley erschienen auch in regelm&#228;&#223;igen Abst&#228;nden
Updates f&#252;r &quot;Foundation&quot;. Um der Wahrheit die Ehre zu geben: So viele wie
f&#252;r kaum ein anderes Game auf dem Amiga Sektor. Nachdem allerdings sein
Publisher Konkurs ging wollte er die Arbeiten daran endg&#252;ltig einstellen -
Epic Marketing belehrten ihn aber eines besseren und &#252;berzeugten ihn, den
Nachfolger &quot;Foundation`s Edge&quot; anzugehen. Vorher wurde allerdings nochmal
die Original Version von "Foundation" mit allen Updates auf CD zu einem
g&#252;nstigen Preis (49 DM) wiederver&#246;ffentlicht. Diese Version schimpft sich
nun &quot;Foundation Directors Cut&quot; und wird hier vorgestellt.</P>

<h2><CENTER><FONT COLOR="YELLOW">Das Spielprinzip</FONT></h2></CENTER></P>
Sollte es tats&#228;chlich noch User geben, die mit den Titeln &quot;Siedler&quot; und /
oder &quot;Foundation&quot; nichts anfangen k&#246;nnen? F&#252;r jene, werde ich hier kurz das
Spielprinzip zusammenfassen: Ihr startet mit gewissen Rohstoffen und einer
Reihe von Untergebenen als Gottheit auf einer Insel mit einem Hauptquartier.
Als Gott m&#252;sst ihr daf&#252;r sorgen, da&#223; sich Euer (anfangs kleines) Volk
ausbreiten und vermehren kann und selbstverst&#228;ndlich immer gen&#252;gend
<img src="found1.jpg" align=left>Rohstoffe zur Verf&#252;gung hat. Zu diesem Zwecke k&#246;nnt Ihr weitere Geb&#228;ude
(z.B. Fischerei, Holzf&#228;ller, Minen, Farm, Pumpenhaus etc.) errichten, die in
vielerlei Weise von den anderen abh&#228;ngig sind. Um z.B. eine B&#228;ckerei am
laufen zu halten, muss diese in regelm&#228;&#223;igen Abst&#228;nden mit Weizen und Wasser
versorgt werden, um Brot zu backen. Dieses Brot dient dann als
Nahrungsmittel f&#252;r die Bev&#246;lkerung. Und da wir gerade bei der Bev&#246;lkerung
sind: Diese unterteilt sich in Arbeiter (der z.B. das Land erforschen,
G&#252;ter umhertragen oder auch in den verschiedenen Geb&#228;uden arbeiten kann),
die Jungfrau (die f&#252;r Nachwuchs sorgt), den Zauberer (im Gegensatz zu
&quot;Siedler&quot; baut dieser mittels Magie die Geb&#228;ude - sofern die ben&#246;tigten
Recourcen vorhanden sind), den Wissenschaftler (der die Technologie
weiterentwickelt; z.B. neue Geb&#228;ude oder auch bei ernsten Krankheiten ein
Gegenmittel findet), den Soldaten (ein einfacher Bewacher der Geb&#228;ude), den
Ritter (in Kriegszeiten unerl&#228;&#223;lich) und den schwarzen Ritter (fast
unvewrwundbar und somit die ideale Waffe). Damit liegt nat&#252;rlich ein
weiteres Problem auf der Hand: Man ist auf der Insel nicht alleine, sondern
wird von Computergegnern (in dem Nachfolger &quot;Foundation`s Edge&quot; soll auch das
Antreten gegen einen menschlichen Gegner m&#246;glich sein) umzingelt, die einem
das leben ebenfalls schwer machen und dem Spieler Geb&#228;ude zerst&#246;ren und Land
klauen. Somit muss nat&#252;rlich auch f&#252;r Waffenindustrie gesorgt sein....
Ihr seht also: Es ist alles gar nicht so einfach und anfangs wird man
sicherlich seine Zeit brauchen, bis man das Spielprinzip mit all seinen
Feinheiten kapiert hat, aber dananch erwarten Euch Stunden ungetr&#252;bten
Spielspa&#223;es, den ihr in Foundation in zwei Wegen erreichen k&#246;nnt: Entweder
ihr spielt die Missionen (&#252;ber 50) und lernt Schritt f&#252;r Schritt alles &#252;ber
Foundation und seine Eigenarten oder ihr macht ein individuelles Game, wo
ihr selber das Spielziel, die Anzahl der Gegner und sogar die Landschaft, in
der gespielt wird (z.B. Lava oder Eis), bestimmen k&#246;nnt.</P> 

<h2><CENTER><FONT COLOR="WHITE">Besonderheiten von
Foundation</FONT></CENTER></h2></P>
Auf jedes Feature explizit einzugehen w&#228;re sicherlich etwas langatmig und
f&#252;r den Verfasser dieses Textes auch nur scher machbar. Dennoch hat
Foundation einiges an Besonderheiten zu offerieren, die nat&#252;rlich innerhalb
eines Testes gekl&#228;rt werden sollten. Im Gegensatz zu &quot;Siedler&quot; sterben z.B.
regelm&#228;&#223;ig &#228;ltere Teile euer Bev&#246;lkerung aus Altersschw&#228;che - allerdings
k&#246;nnen Leichen immer noch ins Krematorium gebracht werden, um Magie zu
erzeugen, die eure Zauberer zum Erschaffen von H&#228;usern etc. brauchen.
Insgesamt gibt es in Foundation &#252;ber 20 verschiedene Geb&#228;udearten, die
leider teilweise noch nicht einmal im Online-Handbuch (eine englische HTML
Datei) erw&#228;hnt werden - probieren geht hier also &#252;ber studieren.
Allerdings sind nicht alle Gebäude von Anfang an nutzbar, sondern müssen
erst vom Labor, das für die technische Entwicklung verantwortlich ist,
erfunden werden. 
 Was mir
ebenfalls noch erw&#228;hnenswert erscheint, und nebenbei die Liebe des
Programmierers zum Detail hervorragend verdeutlicht, ist die Tatsache, da&#223;
jede Person in Foundation &#252;ber eine eigene Identit&#228;t, also inkl. Namen und
Bild, verf&#252;gt. Was den Siedler Fan immer schon gest&#246;rt hat, war das Fehlen
einer Funktion, mit der man Handel mit Mitspielern betreiben konnte. So kam
es in Siedler unter Umst&#228;nden vor, da&#223; man Unmengen an Kohle hatte, aber
kein oder nur wenig Eisen, um diese Kohle auch sinnvoll einzusetzen. In
Foundation geh&#246;rt dieses Problem der Vergangenheit an und man kann auf einer
Art Markt Produkte gegeneinander tauschen, um so an dringend ben&#246;tigte
Waaren zu gelangen. Fairerweise sollte man aber auch erw&#228;hnen, da&#223; man zu
diesem Mittel nur in Notsituationen greifen sollte, denn die Tauschwerte
haben es in sich. Eine weitere Besonderheit von Foundation besteht in dem
&quot;Game Speed&quot; Einsteller. Wie der Name schon sagt, kann man hier die
Geschwindigkeit einstellen, um so langwierige Prozesse zu verk&#252;rzen; diese
Option ist zwar nett, aber in der Praxis sollte diese h&#246;chst selten zum
Einsatz kommen, denn normalerweise hat man immer etwas zu tun bzw. zu
regeln. Es gibt noch zahlreiche weitere Besonderheiten an Foundation, aber
da das Spiel derma&#223;en komplex ist, w&#252;rde es den Rahmen des Artikels
sprengen, wenn ich hier alles anf&#252;hren w&#252;rde.... </P>



<h2><CENTER><FONT COLOR="BLUE">Grafik &amp; Sound: </FONT></CENTER></h2></P>
Auch wenn es bei Strategiegames mehr auf das Spielprinzip an sich ankommt,
so i&#223;t das Auge auch hier mit. Und gegen die Grafik von "Foundation" kann man
wirklich nix sagen. War schon Version 1.0 grafisch recht ansprechend, so hat
sie sich in der aktuellen Version 1.25 zu einem wahren optischen
Leckerbissen gemausert. So wurde das ganze mitlerweile f&#252;r Grafikkarten
optimiert, was die Einbindung von Features wie Goroud Shading und Texture
Shading m&#246;glich machte. Aber auch so triviale Dinge wie Schattenw&#252;rfe und
sanfte H&#252;gel wurden fest implementiert, was zusammengenommen einen
hervorragenden Eindruck macht, wie man unschwer auch den Screenshots
entnehmen kann. Nicht verschwiegen werden sollte allerdings auch die
Tatsache, da&#223; die Grafik nur auf gut aufger&#252;steten Rechnern (ich w&#252;rde mal
040 samt GraKa und einer ordentlichen Portion Fast Ram sagen) wirklich
fl&#252;ssig l&#228;uft. F&#252;r AGA-only User bietet das Programm allerdings noch die
M&#246;glichkeit, die neuen Features abzustellen ( =&gt; Geschwindigkeitszuwachs)
sowie, sollte das immer noch nicht ausreichen, die vorhanden, recht gro&#223;en
in-Game Grafiken durch kleinere Versionen zu ersetzen. Ach ja: Die Aufl&#246;sung
kann selbstverst&#228;ndlich auch frei gew&#228;hlt werden - auch das Spielen im
Fenster auf der WB ist m&#246;glich (was aber nur 68060 Besitzern empfohlen sei).
Auch beim Sound gibt`s wahrlich nichts zu kritisieren: Neben einem CD Audio
Track, der perfekt zur Atmosph&#228;re passt und in keinster Weise nervig ist,
gibt`s noch eine (gelungene) Titelmusik sowie die obligatorischen
Spielger&#228;usche, die man auch &#252;ber AHI ausgeben kann. Auch den Sound kann man
im Voreinsteller noch konfigurieren und dort auch abschalten. Da "Foundation" modular aufgebaut
ist, haben Fans schon alternative Soundfiles komponiert, die sich kostenlos im Aminet runterladen lassen und
teilweise echt gut klingen.</P>

<h2><CENTER><FONT COLOR="RED">Systemanforderungen &amp;
Installation</FONT></h2></CENTER></P>
"Foundation" ben&#246;tigt als Minimum einen AGA Amiga mit 6 MB Fast Ram und einem
030er Prozessor. Mit dieser Konfiguration kann man aber bestenfalls das
Spiel in Zeitlupe bewundern - zum spielen wird man damit sicherlich nicht
kommen. Somit sei eine 040er oder 060er CPU sowie mind. 8 MB Fast Ram zum
sinnvollen spielen empfohlen - eine Grafikkarte, egal ob diese unter
CyberGFX oder Picasso96 l&#228;uft, ist, aus meiner Sicht, ebenfalls ein
unabdingbares Muss. Denn "Foundation" macht erst ab 640 X 480 richtig Spa&#223;.
Ein CD Laufwerk ist ebenfalls Pflicht, da das Game nur auf einer
(selbstgebrannten !) CD ausgeliefert wird. Eine Installation auf Festplatte
ist zwar nicht notwendig (das Spiel kann komplett von CD gespielt werden),
kann aber bei Bedarf durchgef&#252;hrt werden (Komplettinstallation belegt etwa
88 MB auf der Platte).</P>

<h1><CENTER><FONT COLOR="GRAY">Fazit</FONT></CENTER></h1></P>
"Foundation" ist f&#252;r mich in dieser Version eines der Highlights des `99
Jahrgangs, was nicht zuletzt an dem konkurrenzlos g&#252;nstigen Preis von 49 DM
(!!) liegt. Strategiefans, die das Original noch nicht besitzen, m&#252;ssen hier
einfach zugreifen - f&#252;r Besitzer des Originals lohnt sich der Kauf nat&#252;rlich
nicht, da man mit den kostenlosen Updates auf die selbe Version wie der
&quot;Director`s Cut&quot; kommt. Das Game an sich macht h&#246;llischen Spa&#223; und vermochte
mich stundenlang vor dem heimischen Amiga zu fesseln - einen Gedanken an
aktuelle PC Spiele wird man nach dem Erwerb von Foundation nicht mehr
verschwenden. Kurz &amp; knapp: Kaufen!</P><BR><CENTER>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Epic Marketing</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>49 DM</TD>
</TR>
<TR>
<TD>Genre</TD>
<TD>Strategiespiel (Siedler Clone)</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>125</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>90 %</TD>
</TR>
</TABLE>




<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
