<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Super Pino oder: welches Jahr haben wir?</TITLE>
</HEAD>
<BODY TEXT=black background="kback.png" link=silver alink=red>
<CENTER><h1><b>Super Pino Preview</CENTER></h1></B></P>
<hr><CENTER>
<img src="sp.jpg"></CENTER>
<hr>
<font size="+1.5">

Manchmal muss man in den Previews auch kritischw erden, in der Hoffnung, da&#223;
die Programmierer ein Einsehen haben und das entsprechende Game nochmals
&#252;berarbeiten.</P>

Ein solcher Fall ist auch &quot;Super Pino&quot;. Bei &quot;Super Pino&quot; handelt es sich um
ein Plattformspiel, wie man sie vor allem aus der Anfagszeit der
Homecomputer kannte und liebte. Man muss von Plattform zu Plattform springen,
ohne dabei in eine Schlucht zu fallen. Da das noch etwas zu eint&#246;nig ist,
gibt`s noch Gegner, mitunter auch mit Sch&#252;ssen ausgestatet, die einem das Leben
schwermachen. Unser Held (Pino) kann nat&#252;rlich auch schie&#223;en, auch wenn ich
bis heute noch nicht herausgefunden habe, was er denn da schie&#223;t.</P> 

Dagegen alleine ist ja noch nichts
einzuwenden, aber die technische Umsetzung in der aktuellen Demo Version ist
einfach nur grauenvoll: Die Grafik ist einfach nur grottenschlecht und
kann sich noch nichtmal mit einem Gro&#223;teil der A500 Games messen. Selbiges
gilt f&#252;r die Bewegungsanimationen der Hauptfigur, wenn man &#252;berhaupt von
Animation reden kann. Auch &#252;ber den Sound sollte man den Mantel des
Schweigens legen, denn das Gekr&#228;chtze ist einfach nur grottenpeinlich und
sollte am besten gleich in den n&#228;chsten M&#252;lleimer wandern.</P>

Ach ja, und was an dem Game, laut beiliegendem &quot;Read Me&quot;, so witzig sein
sollte, konnte ich bisher auch nicht rausfinden. Vielleicht meinten die
Programmierer damit ja das Game an sich, denn dies ist f&#252;r heutige
Verh&#228;ltnisse wirklich lachhaft (ist das britischer Humor?). Nein aber im
Ernst: Irgendwelche &quot;Intel Outside&quot; Logos, die lieblos in die Gegend
&quot;geklatscht&quot; wurden, sind einfach nicht witzig und zeugen vond er
Einfalslosigkeit der Programmierer.</P>

Hoffnung besteht aber noch: Die Vollversion, die man am besten gleich als
Freeware freigibt (denn ansonsten droht ein &#228;hnliches Disaster wie bei dem
&#228;hnlich schwachen &quot;Ph&#246;nix Fighters&quot;), soll komplett &#252;berarbeitete Grafik
bieten und insgesamt 5 Welten mit jeweils 3 Levels beinhalten. Hinzu kommen
noch 3 Bonus Level und diverse &quot;Sub Games&quot;... </P>

<u>Fazit</U></P>
Sollte sich an dem Spiel bis zum V&#214; nicht noch verdammt viel tun (und damit
meine ich verdammt viel!), sehe ich schwarz. Positive Ans&#228;tze konnte ich
nicht ausmachen und insofern w&#228;re es vielleicht sogar noch besser, wenn man
das Projekt komplet streicht und stattdessen irgendetwas sinnvolles
herausbringt. Ich kann mir n&#228;mlich beim besten Willen nicht vorstellen, da&#223;
dieses Game irgendwelche Abnehmer finden wird - im Freewarebereich tummeln
sich dazu noch zahlreiche bessere Vertreter dieses Genres.</P><PRE>
<CENTER><img src="kit.gif"></CENTER></P>

Name          : Super Pino<BR>

Publisher     : ???<BR>

Release       : Erstes oder zweites Quartal 2000 <BR>

Preis         : ???<BR>

Anforderungen : von der Grafik her ein nackter 500er<BR>

Empfohlen     : wahrscheinlich 1 MB Chip Ram :-(((<BR></PRE></P><BR>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
