


<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Diskriminierung?????</TITLE>
</HEAD>
<BODY TEXT=white bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="GREEN">Frank`s ganz pers&#246;nliche Seite
</FONT></h1></CENTER></P>
Erstaunt? Bin ich nicht... Aber vielleicht Du, wenn Du das hier in der
aktuellen Ausgabe lie&#223;t. Mir entgeht halt wenig :-))</P>

Das Du etwas mit Deinem PC machen kannst, war mir schon klar - aber mitunter
gibt`s ja auch Sachen, die Du am Amiga nicht kannst und das, obwohl Du
diesen angeblich sooo oft benutzt (ich sag nur RTG Libs installieren oder
Installer.... :-)) - aber ich glaube auch, da&#223; dieser Kleinkrieg zu keinen
brauchbaren Ergebnissen f&#252;hrt. Jeder von uns hat da so seinen Standpunkt und
meiner ist es halt, da&#223; der Amiga besser ist - und ich denke, da wirst Du
mir wiedersprechen :-))</P>

Was die Logos angeht: Daf&#252;r habe ich mich beim Dark Evil durchaus bedankt
und wenn Du das nicht glaubst, frag ihn selber - mal abgesehen davon: Auch
Ihm ist es aufgefallen, da&#223; Du in letzter Zeit merklich gegen den Amiga
bist; somit musst Du zugeben, da&#223; ich zumindest teilweise recht gehabt haben
muss.</P> 

Und was die Diskriminierung angeht (wenn man mal davon absieht, da&#223; das Wort
ma&#223;los &#252;berzogen und in keinster Weise den Sachverhalt der Diskussion
wiedergibt): Nur weil ich ab und an einen Spruch gegen PC`ler ablasse,
diskriminiere ich keinen. Und wenn Du den Spa&#223;, der hinter einem Spruch wie
&quot;Windows - gesehen, gelacht, gel&#246;scht&quot; steckt, nicht kapierst und Dich davon
noch &quot;diskriminert&quot; f&#252;hlst - ja dann mein lieber Frank ist es, gelinde
gesagt, Pech f&#252;r Dich. Ich jedenfalls werde weiterhin meine PC Spr&#252;che, auch
in Deiner Anwesenheit, ablassen und habe damit kein Problem. Selbiges gilt
auch f&#252;r den Spruch aus der vorletzten NC (&quot;Ist halt ein PC User. Was
erwartest Du da?&quot;) - kapierst Du eigentlich nicht, da&#223; dieser Spruch noch
nichtmal gegen Dich, als vielmehr gegen alle PC User ging? Ich glaube, da
hast Du ma&#223;los &#252;berreagiert und gedankenlos zur&#252;ckgewettert, ohne auch nur
den Versuch zu machen, mal kurz dar&#252;ber nachzudenken. 
F&#252;hle ich mich
denn auch diskriminiert, wenn Du mir sagst, da&#223; der Amiga schei&#223;e ist? Na
siehst Du! Und was der Comment &quot;und nicht &#252;ber die NC&quot; soll (in Deinem Leserbrief in dieser Ausgabe)
, ist mir auch
schleierhaft. Immerhin warst Du derjenige, der sich &#252;ber meinen Joke
aufgeregt hat und sofort alles eingeleitet hat, um in der n&#228;chsten Ausgabe
zur&#252;ckzuflamen und mir noch nichtmal seinen Leserbrief vorher geben wollte -
insofern verstehe ich &#252;berhaupt nicht was Du Dich, lieber Frank, derma&#223;en
aufregst. Diese Reaktion w&#228;re niemals in der NC erschienen, wenn Du auch nix
reingeschrieben h&#228;ttest :-))) </P>

Abschlie&#223;end m&#246;chte ich damit enden, da&#223; Du Deinen Amiga kaum mehr benutzt
(wie Du selber sagtest: 80 % PC, 20 % Amiga) und Du Dir daher den Vorwurf,
da&#223; Du vom Amiga nahezu nichst mehr wissen willst, gefallen lassen musst.
UAE ist ja sch&#246;n und nett, aber nicht alles l&#228;uft darauf und einen Original
Amiga wird es niemals ersetzen k&#246;nnen. Sich aber auf der anderen Seite
aufzuregen, da&#223; Dein Amiga gerade mal eine Aufl&#246;sung von 640 X 256 in Pal
HighRes hat und kein Geld f&#252;r eine GraKa vorhanden ist (aber 2000 DM f&#252;r
`nen PC), und dann noch die Frechheit zu besitzen, da&#223; der PC besser
aussieht (Aufl&#246;sungstechnisch), hat ein kleinen Seitenhieb
verdient.</P>

Aber da ich selbst ja auch auf Dich zugehen m&#246;chte, folgendes Statement:</P><I>

Hiermit entschuldige ich mich offiziell bei Dir, da&#223; ich Deiner Anwesenheit,
PC Spr&#252;che abgelassen habe und Dich damit zutiefst diskriminert habe.
Das war nat&#252;rlich meine volle Absicht und es ist deswegen umso verwerflicher
und kaum entschuldbar. Selbiges gilt &#252;brigens auch f&#252;r den ebenfalls
diskriminierenden Spruch aus der vorletzten NC. Und wo wir gerade dabei
sind: Ich entschuldige mich hiermit bei allen PC Usern auf der Welt, da&#223; ich
diese Majorit&#228;t durch meine v&#246;llig unqualifizierten Aussagen diskriminiert
habe. Ich gelobe feierlich Besserung.</I></P>


Ich glaube, dabei sollten wir es auch bewenden lassen :-))))))</P>


Anmerkung: Ich bin mir ziemlich sicher, daß Du auch diesen Brief an Dich
wieder in den falschen Hals kriegen wirst - aber bevor Du diesesmal wütend
wirst, ließ ihn Dir erstmal nochmal durch und frage Dich, ob da nicht auch
wieder einige "Scherze" drinstehen.</P>

Ach ja, um es mal offiziell zu machen: Hiermit bedanke ich mich bei Frank
Guder dafür, daß er sowohl Daten aus dem Internet zieht und immer
vorbeibringt sowie für die diversen Scans, die er für mich mittels seines
Scanners durchführt(e). Also: Ein Dankeschön von dieser Stelle an "Textman"
alias Frank Guder - und Amiga ist doch besser :-)))






<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
