

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief von Kilian "The Bruce" Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="GREEN">Leserbrief von Kilian &quot;The Bruce&quot; Servais
</FONT></h1></CENTER></P>
<a href="#alle.html">An Alle</A><BR>
<a href="#wolf.html">An Wolf Zimmer</A><BR>
<a href="#tom.html">An Mark Tom </A><BR>
<a href="#rainer.html">An Rainer L&#252;b.</A><BR>
<a href="#top.html">Top 5</A></P>
<hr>
<a name="alle.html">
<b>An Alle:</B><BR>
Angeregt durch Mark Tom`s &quot;kurze &#220;bersicht&quot; &#252;ber die Zukunft des Clubs,
wollte ich dazu auch noch was sagen: Ich habe soeben auch meine
Mitgliedschaft um ein Jahr verl&#228;ngert und werde meinem Amiga auf jeden Fall
treu bleiben, egal was noch passieren wird! Solange es User gibt, wird es
auch die NoCover geben. Ich bitte alle User, doch erstmal noch abzuwarten,
denn mit den G3 und G4 Karten haben wir wieder hervorragende Hardware mit
perfekten Zukunftsaussichten! </P>
<HR>
<a name="wolf.html">
<b>An Wolf:</B><BR>

<i>&quot;Mein Gott, was ist das denn? Ein P&#228;ckchen von Wolf Zimmer? Was der wohl
will?&quot;</I><BR>
So war in etwa meine erste Reaktion, als ich eines Tages aus der Schule kam
und dann Post von Dir auf meinem Scheibtisch erblickte. Vielen Dank erstmal
f&#252;r die Tele Info CD, die ich zwar schon besitze, aber damit evtl. einen
anderen Amiga User gl&#252;cklich machen kann. Auf jeden Fall finde ich es toll
von Dir, da&#223; Du Dich derma&#223;en um die Clubmitglieder k&#252;mmerst. H&#228;tten alle
Dein Engagement, br&#228;uchten wir uns um die Zukunft der NC keine Sorgen zu
machen.</P>

Was das Feedback angeht: Ich habe hier versucht m&#246;glichst subjektiv zu
schreiben (ist immerhin Sinn der Feedback Corner - woher soll ich wissen was
andere denken?) und da mir Deine Workshops lobenswert aufgefallen sind,
geh&#246;rten diese nat&#252;rlich auch in die Feedback Corner - auch wenn diese nicht
meinen Vorstellungen entsprach (durch einen Crash sind leider alle Artikel
f&#252;r die letzte Ausgabe verlorengegangen und ich musste alles nochmal neu
schreiben).</P>

Was Deine NC Guide betrifft: Danke f&#252;r die Zustellung von selbiger; wie
schnell sich doch sowas rumspricht. Was allerdings das erscheinen auf der A+
CD angeht: Ich w&#252;rde begr&#252;&#223;en, wenn der NC Guide auch dort erscheinen w&#252;rde.
Die Leute werden bestimmt etwas damit anfangen k&#246;nnen und es hilft
gleichzeitig dem Markus, etwas &quot;exclusives&quot; f&#252;r seine CD zu bekommen.
Insofern f&#228;nde ich es recht gut, wenn Du ihm im Nachhinein doch noch die
Erlaubniss gibst. Und dazu gibt`s auch ein Lob von meiner Seite: Das Layout
ist schlicht und ergreifend hervorragend und &#252;bersichtlich und der ganze
Guide ist gut durchstruktuiert. &#220;ber die Arbeit, die darin steckt, m&#246;chte
ich erst gar nicht nachdenken. Ist sicherlich `ne Schweinearbeit, die Du Dir
da aufgehalst hast. Umso mehr m&#252;sstest Du von Andy mal eine kleine oder
gro&#223;e Belohnung im Namen aller Clubber bekommen! Eine Mailaddresse habe ich
mitlerweile (nicht die Schule...). W&#252;rde mich also freuen, wenn Du mich in
die monatliche Updateliste eintragen w&#252;rdest (kilianservais@gmx.de); Anlagen
kann ich nat&#252;rlich auch empfangen.</P>

Toll fand ich auch Deine beiden Artikel zu Scan Quix 5 und Fx Paint. Da ich
mir demn&#228;chst einen Scanner holen werde, kamen diese wie gerufen und halfen
mir, noch bestehende Fragen zu kl&#228;ren. Welchen Scanner benutzt Du eigentlich
im Privatbetrieb? Ich werde mir wahrscheinlich einen Epson GT Scanner (7000
oder 9500) kaufen - je nachdem, was es so zu Weihnachten gibt....</P>

Wenn der Klausurstress es zul&#228;&#223;t, habe ich mich evtl. auch schon per Snail
Mail bei Dir gemeldet. Bis dann mal und vielen Dank f&#252;r alles!</P>
<HR>
<a name="tom.html">
<B>An Mark Tom:</B><BR>
Ich habe gar nicht damit gerechnet, da&#223; aus dem Thema &quot;Musik&quot; eine solche
Diskussion wird. Immerhin kriegt man so die NC auch voll :-))</P>

&#220;brigens wusste ich gar nicht, da&#223; DJ Bobo Niveau hat - ich w&#252;rde eher
sagen, die Leute die sich so einen Schrott kaufen, m&#252;ssen irgendwie einen
geistigen Defekt haben. Nichts jetzt gegen diese K&#228;ufergruppe, aber kapieren
die denn nicht, wie die mit gefakter Musik abgezogen werden? Zu &quot;Blue&quot;: Ist
auch absolut nicht mein Ding. Diesen Song haben wir auf unserer Studienfahrt
Ende September in Rom jeden Abend geh&#246;rt und ich muss sagen, da&#223; ich daran
nichts entdecken kann, was den imensen Charterfolg rechtfertigt. Aber wie
gesagt, wenn schon &quot;Maschdrahtzaun&quot; (oder wie immer sich das nennt) in die
Charts einsteigt und derma&#223;en Gewinn einf&#228;hrt, darf man sich &#252;ber gar nichts
mehr beschweren. Ich finde es nur seht deprimierend f&#252;r Bands, die im Proberaum
versauern und vielleicht niemals die Chance bekommen, ihre Musik einem
breiteren Publikum zu pr&#228;sentieren - gen&#252;gend Namen hier aus Herne kann ich
Dir sofort nennen, die es verdient h&#228;tten und derren Musik vor allem eines hat, was einem Groß der heutigen Bands fehlt:
Tiefgang und Potential! </P>

Nun aber zu Deinem Filter CD Test: Natürlich gibt es noch modernen Hardrock,
wenngleich Filter nicht so meinen Geschmack wiedergeben, muss ich denen
gewisses musikalisches Potential zugestehen.  Na ja, unter modernem Hardrock
könnte ich einige Bands nennen und ich denke mal, daß jeder etwas anderes
unter Hardrock versteht; was ist beispielsweise mit Dream Theater? Kann man
nur schwer in eine Schublade packen, aber könnte (!) man auf der anderen
Seite als logische Weiterentwicklungd es Hardrock`s sehen. Na ja, wollte ich
kurz anmerken (für mich sind ohnehin Queen, bes. in ihrer Anfangsphase, die
Götter des Hardrocks).</P>

Jep, die C64 CD war echt gut und ein Kauf lohnt sich, alleine schon aus
Nostalgiegr&#252;nden, auf jeden Fall. Finde ich &#252;brigens gut, da&#223; sich jemand
die M&#252;he macht und auf meine Tests antwortet. Ab und an glaube ich n&#228;mlich,
da&#223; sich keiner meine Tests durchlie&#223;t....</P>

Zum neuen Layout von Fast Food (schau mal in die Metal Corner....): Ist auf
jeden Fall gewöhnungsbedürftig und leider auch etwas zu bunt - wenn man
einen schwachen Monitor hat, bekommt man fast Augenkrebs (bei mir geht`s
noch, aber beim Dark Evil sieht`s echt schlimm aus...).</P>

Man lie&#223;t sich!</P>
<hr>
<a name="rainer.html">
<b>An Rainer:</B><BR>
Ertsmal finde ich es schade, da&#223; Du Deine Amiga Laufbahn beendest. Aber
gerade mit der Begr&#252;ndung, da&#223; es auf dem Amiga im Bereich der Internet
Soft. nicht gut aussieht? Das kann ich kaum nachvollziehen !? </P>

Worum es mir aber ging: Machst Du trotz Deines Systemwechsel die
Mitgliederliste weiter? Ein kurzes Statement dazu w&#228;re nett...</P>
<hr>
<a name="top.html">
<h1><CENTER><FONT COLOR="YELLOW">Top 5</FONT></h1></CENTER></P>

1. FX Scan und Scan Quix 5 von Wolf Zimmer (kam wie gerufen)<BR>

2. Astro Corner von Lars Ph. (w&#252;rde sagen: sehr interessant)<BR>

3. Fast Food von Mark Tom<BR>

4. beide Cinerama Artikel von Jens Kretzer / Fabrian Kruse<BR>

5. Payback von Sax (wie immer genial!)</P>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
