<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Lars Philipsen">
   <meta name="GENERATOR" content="Mozilla/4.6 [de]C-CCK-MCD QXW0321u  (Win98; I) [Netscape]">
   <meta name="Description" content="Quelle: bild der wissenschaft">
   <title>Astro-Corner 10 (Januar 2000)</title>
</head>
<body text="#000000" bgcolor="#CCCCCC" link="#0000EE" vlink="#551A8B" alink="#FF0000" background="rock012.jpg" bgproperties=fixed>

<center><img SRC="ac_titel.jpg" ALT="Astro-Corner 10" BORDER=2 height=59 width=402><font size=+1>10</font>
<br><i><font size=+1>Ausgabe Januar 2000</font></i>
<br>
<hr WIDTH="100%"></center>
<b><u><font size=+1>Hallo NoCover-Leser!</font></u></b>
<p>Diesmal ein etwas l&auml;ngeres Editorial...
<p><b><i><font size=+1>E</font></i></b>s ist geschafft, ein Jubil&auml;um
steht an: Die nunmehr zehnte Ausgabe der <b>Astro-Corner</b> ist erschienen.
Eigentlich hatte ich anfangs gar nicht vor, eine regelm&auml;&szlig;ige
Rubrik zu machen. Ich wollte einfach nur mal einen Artikel &uuml;ber Neuigkeiten
aus den verschiedenen Bereichen der Astronomie bringen. Da allerdings die
Resonanz zu meinem Erstaunen sehr gro&szlig; war und es jeden Monat immer
wieder Neues zu berichten gab, entschloss ich mich, weiter zu machen.
<br>Aus Zeitgr&uuml;nden bin ich leider auch nicht mehr der gro&szlig;e
Artikelschreiber, aber wenn ich mir den allm&auml;hlichen Zerfall der NoCover
ansehe, m&ouml;chte ich doch zumindest mit meiner regelm&auml;&szlig;igen
Rubrik dem etwas entgegen wirken. Amiga-bezogene Artikel werde ich aber
wohl keine mehr verfassen, denn die letztmonatliche Entwicklung ist keineswegs
spurlos an mir vor&uuml;bergezogen.
<p><b><i><font size=+1>I</font></i></b>m Sommer, als alles noch in Ordnung
schien, wollte ich mich endlich wieder mehr mit dem Amiga befassen - mein
damaliger 1200er hatte leider seinen Dienst aufgegeben, so dass ich eine
'Zwangspause' einlegen musste. Ich hatte das Gl&uuml;ck, sehr g&uuml;nstig
an einen "nackten" 1200er heranzukommen. Jedoch kam es kurz nach dem Erwerb
zu den allbekannten Ereignissen in den USA, die ich hier nicht breit treten
und gro&szlig;artig bewerten m&ouml;chte... h&auml;tte ohnehin keinen Sinn.
Jedenfalls verlor ich mit einem Schlag meine Motivation, mir meine Peripherie-Ger&auml;te
- allesamt an Freunde verliehen - wieder zu besorgen und den funktionierenden
12er aufzubauen. Und er steht immer noch in meinem Schrank und da wird
er wohl auch bleiben.
<p><b><i><font size=+1>Z</font></i></b>usammengerechnet habe ich nun knapp
&uuml;ber ein Jahr nicht mehr an einem Amiga gearbeitet. Lange Zeit bezeichnete
ich mich aber trotzdem noch als Amiga-User, hatte ich ja schlie&szlig;lich
vor, mir den MCC bei Erscheinen zu holen, von dem ich mir doch einiges
versprochen hatte. Aber ich muss sagen: Nun ist endg&uuml;ltig Schluss!
Seit dem Sp&auml;tsommer dieses Jahres bin ich "offiziell" <i>kein</i>
Amiga-User mehr. Ich sehe einfach keinen Sinn mehr darin, auch nur eine
Mark&nbsp; in diese Plattform zu stecken. Das mag jetzt f&uuml;r euch sehr
hart klingen. Es ist ja auch so, dass mir dieser Schritt sehr schwer gefallen
ist.
<p><b><i><font size=+1>I</font></i></b>ch m&ouml;chte an dieser Stelle
betonen, dass ich mir nichts sehnlicher w&uuml;nschen w&uuml;rde als eine
(erfolgreiche!) R&uuml;ckkehr des Amiga. Realistisch gesehen kann ich daran
aber nicht mehr glauben. Und es tut mir auch unendlich weh, jetzt mit ansehen
zu m&uuml;ssen, wie alles wie ein Kartenhaus in sich zusammenst&uuml;rzt,
wenn ich bedenke, was der Amiga mir alles gebracht hat. Durch dieses System
habe ich eine Menge neuer Kontakte gekn&uuml;pft und auch den einen oder
anderen Freund gewonnen. Auch habe ich im Jahr 1996 den Weg zum APC&amp;TCP
gefunden, dem ich trotz der momentanen Entwicklung als Mitglied erhalten
bleiben m&ouml;chte. Ich denke, man muss ja nicht unbedingt ein Amiga-User
sein...
<p><b><i><font size=+1>A</font></i></b>ll das bedeutet nicht, dass ich
jetzt <i>der</i> Windows-PC-User schlechthin geworden bin. Klar bin ich
ein PC-User, sonst w&uuml;rdet ihr keine Artikel von mir lesen k&ouml;nnen.
Wickle ich meine Online-Aktivit&auml;ten doch schon von Anfang an am PC
ab, da es hier f&uuml;r mich - ich benutze ISDN - deutlich g&uuml;nstiger
und einfacher war, als ich mich damals zu einem Internet-Zugang entschlossen
hatte. Es ist aber so, dass ich den PC wirklich nur f&uuml;r die Arbeit
benutzt habe... den Amiga allerdings f&uuml;r die Arbeit <i>und</i> den
Spa&szlig;. Und das Benutzen eines PC macht wirklich keinen Spa&szlig;.
Ich w&uuml;rde sagen, dass ich au&szlig;erhalb meinen Online-Aktivit&auml;ten
gar nichts mehr mit dem Computer mache. Den Amiga benutze ich nicht mehr
und am PC machen andere Sachen keinen Spa&szlig;. Also lasse ich es sein.
<p>Tief in Inneren werde ich aber immer ein Amiga-Fan bleiben und hoffen...
<br>Mal sehen, was die Zukunft noch so alles bringt. Und vielleicht wird
die Amiga-Userschaft auch irgendwann einmal wieder anwachsen...
<br>
<hr WIDTH="100%">
<br>So, genug aber jetzt der traurigen Worte, denn schlie&szlig;lich ist
diese <b>Astro-Corner</b> eine Jubil&auml;umsausgabe, der hoffentlich noch
viele weitere folgen werden. Also gibt es ja wohl eher was zu feiern! :-)
<p>Los geht es mit dem obligatorischen Inhalts&uuml;berblick:
<br>&nbsp;
<br>&nbsp;
<center><table COLS=1 WIDTH="79%" BACKGROUND="yllw014.jpg" >
<caption><a NAME="Inhalt"></a><font size=+1>Inhalt dieser Ausgabe:</font></caption>

<tr>
<td>
<center><a href="#Wann">Wann haben im Universum die ersten Sterne geleuchtet?</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Hundert">Hundert aktive Vulkane auf Jupiter-Mond Io</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Interstellare">Interstellare "Hochgeschwindigkeitswolken"
spielen zentrale Rolle bei der Sternenbildung</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Sechs">Sechs neue Planeten au&szlig;erhalb des Sonnensystems
entdeckt</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Galileo">Galileo sendet wieder: Auf 300 Kilometer an
Jupiter-Mond Io herangekommen</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Europäisches">Europ&auml;isches R&ouml;ntgenteleskop
wird ausgesetzt: Beobachtung von "kosmischen Krisenherden"</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Am">Am weitesten entfernte Supernova von Studentin entdeckt</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Jupiter">Jupiter verdr&auml;ngte Uranus und Neptun</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Alte">Alte K&uuml;stenlinie auf dem Mars gefunden</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Komet">Komet Hale-Bopp k&ouml;nnte einen Mond haben</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Planetengeschwister">"Planetengeschwister" im Konkurrenzkampf</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Maschine">Z-Maschine erzeugt Verh&auml;ltnisse wie in
einem Neutronenstern</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Schlangen">Schlangen am Kopf der Hydra</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Tag">Am Tag, als der Sonnenwind verschwand</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Der">Der Mensch ist nicht allein - aber aus dem "gr&uuml;nen
M&auml;nnchen" wird wohl nichts</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Terra">Terra vervollst&auml;ndigt das Bild von der Erde</a></center>
</td>
</tr>
</table></center>

<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Wann"></a><b>Wann haben im Universum die ersten Sterne geleuchtet?</b>
<p>(Meldung vom 22.11.1999)
<p>Diese Frage haben Astronomen immer versucht, anhand optischer Beobachtungen
zu kl&auml;ren. Dabei k&ouml;nnte die Antwort im Infrarotbereich liegen.
Denn Beobachtungen der l&auml;ngeren Wellenl&auml;ngen (W&auml;rmestrahlung)
lassen die Astronomen Jean-Loup Puget und Guilaine Lagache vom Institut
d’Astrophysique Spatiale bei Paris, vermuten, dass Sterne schon in der
ersten Milliarde Jahren nach dem Urknall entstanden sind. Das ist viel
fr&uuml;her in der 12 Milliarden Jahre alten Geschichte des Universums
als bisher vermutet.
<p>W&auml;rmeherde, also H&auml;ufungen im infraroten Gl&uuml;hen, die
aus allen Richtungen des Himmels kommen, f&uuml;hrten die Forscher auf
die F&auml;hrte der fr&uuml;hen Galaxien. Denn die Astronomen glauben,
dass das Gl&uuml;hen von der ersten Generation von Sternen und Galaxien
hervorgerufen wurde, deren Licht von Staubwolken in W&auml;rmestrahlung
umgewandelt wurde.
<p>Der erste Satellit, der die Infrarotstrahlung des Himmels ma&szlig;,
war 1998 der NASA Cosmic Background Explorers (COBE). COBE besass allerdings
noch zu kleine Infrarot-Teleskope, um die H&auml;ufungen entdecken zu k&ouml;nnen.
Puget und Lagache haben f&uuml;r ihre Entdeckung, Daten des Infrared Space
Observatory (ISO) der European Space Agency (ESA) untersucht. Dieser Satellit
hatte 25 mal so starke Ger&auml;te an Bord wie COBE und ma&szlig; drei
Jahre lang Strahlung im Infrarotbereich.
<p>Damit nicht die W&auml;rme der Erde die Ergebnisse verf&auml;lscht,
konzentrierten sich die Forscher bei der Auswertung auf kleine Himmelsteile.
Aber auch nach der Subtraktion der Strahlung aus nahen Galaxien blieben
Unterschiede in der Helligkeit erhalten, die auf ganz fr&uuml;h gebildete
Galaxien hindeuten.
<p>„Was Puget und Lagache pr&auml;sentieren ist sehr &uuml;berzeugend.
Ich habe daran keine Zweifel,“ sagt Dietrich Lemke vom Max-Planck Institut
f&uuml;r Astronomie in Heidelberg, wo die beiden Franzosen vergangene Woche
ihre Ergebnisse pr&auml;sentierten.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Hundert"></a><b>Hundert aktive Vulkane auf Jupiter-Mond Io</b>
<p>(Meldung vom 22.11.1999)
<p>Neue Bilder der Raumsonde Galileo enth&uuml;llen eine gewaltige vulkanische
Aktivit&auml;t auf dem Jupiter-Mond Io: Mehr als hundert Vulkane sind dort
zur Zeit aktiv. Die Lava, die aus dem Mond hervorbricht, ist so heiss wie
auf der Erde seit zwei Milliarden Jahren nicht mehr.
<p>"Es ist wie eine Zeitreise in die Vergangeheit der Erde", sagte Galileo-Wissenschaftler
Torrence Johnson vom Jet Propulsion Laboratory. "Jetzt haben wir die Gelegenheit,
Ph&auml;nomene zu beobachten, die im Rest des Sonnensystems seit langem
tot sind."
<p>Die neuen Daten stammen vom Vorbeiflug von Galileo an Io am 11. Oktober,
als sich die Raumsonde dem Mond bis auf 600 Kilometer n&auml;herte. Die
Wissenschaftler nahmen besonders die drei gr&ouml;&szlig;ten Vulkane auf
Io unter die Lupe: Pele, Loki und Prometheus. Aus Pele scheint st&auml;ndig
extrem heisse Lava hervorzuquellen: Eine Nahaufnahme zeigt, wie ein Teil
des Vulkans im Dunkeln leuchtet. Die fl&uuml;ssige Lava, die h&ouml;chstens
ein paar Minuten alt sein kann, bildet eine d&uuml;nne, kurvige, zehn Kilometer
lange Linie. Wahrscheinlich tritt die Lava aus, wenn die erstarrende Kruste
des Kratersees Spalten bekommt.
<p>&Auml;hnliches passiert auch bei Kraterseen auf Hawaii, die aber hundert
Mal kleiner sind als der von Pele. Loki ist der gr&ouml;&szlig;te Vulkan
des Sonnensystems. Er gibt mehr W&auml;rme ab als alle Vulkane auf der
Erde zusammen. Zwei Instrumente von Galileo konnten jetzt eine detaillierte
Temperaturkarte des Vulkans herstellen. Weitere Aufnahmen enth&uuml;llen,
wie nicht-vulkanische Berge auf Io durch gewaltige Rutschungen zerst&ouml;rt
werden - &auml;hnlich wie der Vulkan Olympus Mons auf dem Mars.
<p>Am 25. November wird Galileo noch n&auml;her an Ios Oberfl&auml;che
herankommen: Bis auf 300 Kilometer. Das Man&ouml;ver ist allerdings nicht
ungef&auml;hrlich, da Io schon innerhalb des Strahlungsg&uuml;rtels von
Jupiter liegt.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Interstellare"></a><b>Interstellare "Hochgeschwindigkeitswolken"
spielen zentrale Rolle bei der Sternenbildung</b>
<p>(Meldung vom 26.11.1999)
<p>Dass es die Hochgeschwindigkeitswolken gibt (High Velocity Clouds HVC)
- Wolken aus atomarem Wasserstoff, die sich sehr schnell bewegen - ist
schon lange bekannt. Dass sie sich in unserer Galaxie befinden erst seit
kurzem und welche Rolle sie in der Neubildung von Sternen spielen, ver&ouml;ffentlichten
Bart Wakker und seine Kollegen von der University of Wisconsin in der j&uuml;ngsten
Ausgabe von Nature: Mit Schauern von Gas beeinflussen sie die Bildung von
schweren Elementen in neuen Sternen.
<p>Jeder einzelne Stern in der Milchstra&szlig;e hat sich vor Millionen
oder Milliarden Jahren aus Gas gebildet. Sie wandeln st&auml;ndig Wasserstoff
in Helium und schwerere Elemente wie Metalle um. Die Metalle verlieren
die Sterne mit fortschreitendem Alter wieder in den interstellaren Raum.
<p>Das w&uuml;rde bedeuten, dass junge Sterne mehr Metalle enthalten m&uuml;ssten
als &Auml;ltere. Allerdings wird beobachtet, dass fast alle Sterne in der
Scheibe, die unsere Milchstra&szlig;e bildet, die gleiche Konzentration
an schwereren Elementen haben - egal wie alt sie sind.
<p>Und an dieser Stelle spielen die HVCs eine Rolle, denn sie beregnen
die Milchstra&szlig;e mit Gasen. "Dieser Schauer aus Gas besteht aus metallarmem
Material, das vorher nie in der Galaxie war und das die Metallproduktion
in den Sternen beeinflussen k&ouml;nnte", sagt Wakker. Die Beobachtungen
des Hubble-Teleskops best&auml;tigen, dass ein kontinuierlicher Strom von
Material in die Galaxie transportiert wird, die die stetige Neubildung
von Sternen und deren chemische Zusammensetzung beeinflusst. Damit verwirft
Wakker eine andere Theorie, die besagt, dass fr&uuml;her die Sterne effektiver
in der Produktion von Metallen waren.
<p>Die neue Theorie erkl&auml;rt auch, warum die Milchstra&szlig;e st&auml;ndig
neue Sterne produzieren kann, ohne je gaslos da zu stehen. Denn die Wolke,
die Wakker beobachtet hat, bringt jedes Jahr 20 Prozent einer Sonnenmasse
in die Galaxie ein. Er stellt fest, dass diese Masse gen&uuml;gen w&uuml;rde,
um jedes Jahr einen neuen Stern zu bilden.
<p>Die HVCs wurden vor 35 Jahren entdeckt und gaben den Astronomen lange
Zeit R&auml;tel auf, weil sie nicht h&uuml;bsch um das Zentrum der Galaxie
rotieren, sondern wild durch den Raum rasen. So konnten die Forscher nie
die exakte Position der HVCs bestimmen und die Sch&auml;tzungen ihrer Lage
variierten zwischen einigen hundert Lichtjahren bis hin zu zehn Millionen
Lichtjahren, womit sie weit au&szlig;erhalb der Milchstra&szlig;e l&auml;gen.
<p>Neue gro&szlig;e Teleskope auf der Erde und das Hubbleteleskop im Raum
haben gemessen, dass die Wolken 20 000 Lichtjahre weit von der Erde entfernt
sind und damit im Halo - dem Au&szlig;enrand - der Milchstra&szlig;e liegen.
Eine Karte der Hochgeschwindigkeitswolken in der Milchstra&szlig;e gibt
heute recht genau deren Standort an.
<p>Alle R&auml;tsel um die HVCs sind aber noch nicht gel&ouml;st. Denn
woher das metallarme Gas kommt, ist unbekannt. Es k&ouml;nnte von der Bildung
der sogenannten Lokalen Gruppe von Galaxien &uuml;brig sein. Zu diesen
Galaxien geh&ouml;rt der Andromedanebel. Es kann aber ebensogut sein, dass
die Milchstra&szlig;e sich immer noch bildet und so Gas von ihren R&auml;ndern
ins Innere ihres Einflussbereichs zieht. Wakker selbst schl&auml;gt vor,
dass das Gas auch von nahe vorbeifliegenden Zwerggalaxien kommen k&ouml;nnte.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Sechs"></a><b>Sechs neue Planeten au&szlig;erhalb des Sonnensystems
entdeckt</b>
<p>(Meldung vom 2.12.1999)
<p>Die Planetenj&auml;ger haben wieder Beute gemacht. Sechs Planeten, die
nahe Sterne umkreisen, haben die Wissenschaftler mithilfe des Hochaufl&ouml;senden
Echelle Spectrographen (HIRES) auf dem Keck I Teleskop auf Hawaii gefunden.
Damit ist die Zahl der Planeten au&szlig;erhalb unseres Sonnensystems auf
28 gestiegen. Au&szlig;erdem haben die Astronomen Hinweise darauf gefunden,
dass zwei vor kurzem entdeckte Sterne weitere Kompagnons haben. Steven
Vogt, Professor f&uuml;r Astronomie und Astrophysik an der University of
California in Santa Cruz, Geoffrey Marcy von der UC Berkeley, Paul Butler
vom Department of Terrestrial Magnetism at the Carnegie Institution of
Washington und Kevin Apps von der Universit&auml;t von Sussex werden ihre
Ergebnisse im Astrophysical Journal ver&ouml;ffentlichen.
<p>In den vergangenen drei Jahren haben die Forscher vom Keck Observatorium
500 nahe Sterne beobachtet, um neue Planeten zu finden. Die sechs neuen
Planeten erh&ouml;hen die Zahl der bekannten, „extrasolaren" Planeten um
25 Prozent. Das biete Astronomen eine gro&szlig;e Menge neuer Informationen
&uuml;ber Planetensysteme, so Vogt. &Uuml;ber einen der Planeten, HD 192263,
berichteten vor Kurzem auch Nun Santos und seine Mitarbeiter in Genf.
<p>Die Sterne, um die die Planeten kreisen, sind in Gr&ouml;&szlig;e, Alter
und Helligkeit der Sonne sehr &auml;hnlich. Der Abstand zur Erde variiert
zwischen 65 und 192 Lichtjahren. Die Gr&ouml;&szlig;e der Himmelsk&ouml;rper
selbst reicht von etwas kleiner bis zu einige Male gr&ouml;&szlig;er als
Jupiter (0,8 bis 6,5 Mal so schwer wie Jupiter). Sie &auml;hneln Jupiter
wahrscheinlich auch in der Zusammensetzung - vor allem riesige Klumpen
aus Helium und Wasserstoff, meint Vogt.
<p>Auf die Spur der Planeten f&uuml;hrte eine leicht Wackelbewegung der
Sterne, da die Schwerkraft der Trabanten den Kurs des Zentralgestirns ein
wenig ver&auml;ndert. Vogt und seine Mitarbeiter haben au&szlig;erdem Variationen
in der Helligkeit der Sterne herangezogen, wenn ein Planet vor ihnen vorbeiflog.
<p>Die Umlaufbahnen der Planten sind - wie fast alle der extrasolaren Planeten
- sehr exzentrisch, d.h. eher oval als rund. Der Planet HD 222582 besitzt
das extravaganteste Orbit, das bisher bekannt ist. Diese Bahn tr&auml;gt
ihn in 576 Tagen einmal um den Stern. Der Minimalabstand von Stern und
Planet ist dabei mit 0,39 astronomische Einheiten (AU) knapp sechs mal
kleiner als der Maximalabstand von 2,31 AU. Eine astronomische Einheit
entspricht dem Abstand zwischen Erde und Sonne. „H&uuml;bsche Kreisbahnen
wie in unserem Sonnensystem scheinen relativ selten zu sein," sagt Vogt.
<p>Interessanterweise befinden sich f&uuml;nf der sechs Planten in den
sogenannten „bewohnbaren Zonen" der Sterne. In dieser Region herrschen
Temperaturen, die Wasser entstehen und in der fl&uuml;ssigen Form existieren
lassen k&ouml;nnten. F&uuml;r die meisten anderen extrasolaren Planeten
trifft das nicht zu. „Die neuen Planeten haben den richtigen Abstand zu
dem Stern. Mit Temperaturen wie an einem hei&szlig;en Tag in Sacramento,"
erkl&auml;rt Vogt.
<p>Planeten, die der Erde &auml;hneln, werden in den entdeckten Systemen
nicht erwartet. Sie w&auml;ren so klein, dass sie Monde von Jupitergro&szlig;en
Planeten werden w&uuml;rden. Diese Monde in der bewohnbaren Zone k&ouml;nnten
dann aber fl&uuml;ssiges Wasser beherbergen und vielleicht auch Leben,
meint Vogt.
<p>Die Beobachtungen lieferten aber mehr als die Entdeckung der neuen Planeten.
&Uuml;ber vier schon Bekannte wurden neue Daten gesammelt. HD 217107 und
HD 187123 scheinen einen weiteren Begleiter zu haben. Diese Begleiter -
vielleicht braune Zwerge - scheinen den Stern in langen Perioden zu umkreisen.
Sie brauchen vielleicht mehrere Jahre f&uuml;r eine Umrundung. Das ist
deshalb wichtig, weil bisher nur das Ypsilon Andromeda System als Mehrplanetensystem
bekannt war. Die Beobachtungen lassen Vogt mehrere Systeme mit vielen Planeten
erwarten. Es gibt also noch viel zu tun f&uuml;r die Planetensucher.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Galileo"></a><b>Galileo sendet wieder: Auf 300 Kilometer an
Jupiter-Mond Io herangekommen</b>
<p>(Meldung vom 2.12.1999)
<p>Die Raumsonde Galileo hat auch das zweite Ann&auml;herungsman&ouml;ver
an Jupiters Vulkanmond Io &uuml;berlebt: Galileo kam bis auf 300 Kilometer
an die Oberfl&auml;che von Io heran.
<p>Allerdings h&auml;tte es beinahe keine Daten von diesem gewagten Man&ouml;ver
gegeben. Nur vier Stunden vor der geplanten Ann&auml;herung am vergangenen
Donnerstag fuhren sich die Computer von Galileo herunter und versetzten
die Sonde in einen Sicherheitsmodus. Schuld daran war vermutlich die heftige
Strahlung in der N&auml;he von Io. "Mit so wenig Zeit w&auml;re es leicht
gewesen, zu sagen, 'Keine Chance, dass wir das wieder hinkriegen'", sagte
Projektmanager Jim Erickson. Doch die Ingenieure vom Jet Propulsion Laboratory
der Nasa gingen sofort ans Werk und sendeten neue Computerbefehle an Galileo.
Der Erfolg: Mit nur vier Minuten Verz&ouml;gerung bez&uuml;glich des urspr&uuml;nglich
geplanten Zeitpunktes nahm Galileo die Arbeit wieder auf, so dass immerhin
die H&auml;lfte der Messungen an Io und seinem Strahlungsg&uuml;rtel durchgef&uuml;hrt
werden konnten.
<p>Die Daten sollen in den n&auml;chsten Wochen zur Erde &uuml;bertragen
werden. Am 10. Oktober hatte sich Galileo Io schon einmal bis auf 600 Kilometer
gen&auml;hert. Dabei hatte es einige kleinere Ausf&auml;lle durch das Strahlenbombardement
gegeben. Diese Erfahrung half den Ingenieuren jetzt, schnell zu reagieren.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Europäisches"></a><b>Europ&auml;isches R&ouml;ntgenteleskop
wird ausgesetzt: Beobachtung von „kosmischen Krisenherden"</b>
<p>(Meldung vom 2.12.1999)
<p>Der gr&ouml;&szlig;te jemals in Europa gebaute wissenschaftliche Satellit,
das R&ouml;ntgenteleskop XMM (X-Ray Multi Mirror), wird bei der ersten
kommerziellen Mission der neuen Ariane 5-Rakete in der n&auml;chsten Woche
auf seine Umlaufbahn gebracht. Das zehn Meter gro&szlig;e XMM ist eines
der Kernprojekte der europ&auml;ischen Raumfahrt-Agentur Esa.
<p>Mit seinen 174 hauchd&uuml;nnen Spiegeln aus Gold und Nickel soll XMM
die energiereiche R&ouml;ntgenstrahlung einfangen, die Ausk&uuml;nfte &uuml;ber
"kosmische Krisenherde" verspricht: R&ouml;ntgenstrahlung wird beispielsweise
von Materie abgegeben, die dabei ist, in ein Schwarzes Loch zu st&uuml;rzen.
Auch "Vampirsterne", die ihre Nachbarn verschlingen, oder Supernovae senden
R&ouml;ntgenlicht aus.
<p>XMM ist dank seiner zahlreichen Spiegel das derzeit empfindlichste R&ouml;ntgenteleskop.
Das amerikanische R&ouml;ntgenteleskop Chandra, seit dem Sommer im Orbit,
hat zwar eine h&ouml;here Aufl&ouml;sung, kann aber nur st&auml;rkere Quellen
entdecken. Das europ&auml;ische Teleskop wird auf einen exzentrischen 48-Stunden
Orbit gebracht: Der erdn&auml;chste Punkt liegt 7000 Kilometer &uuml;ber
dem Boden, der am weitesten entfernte ist 144.000 Kilometer weit von der
Erde weg. Diese Bahn erm&ouml;glicht eine gute Kommunikation, viel Beobachtungszeit
und wenig Zeit in den Strahlungsg&uuml;rteln der Erde, die die empfindlichen
Messger&auml;te von XMM sch&auml;digen k&ouml;nnten.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Am"></a><b>Am weitesten entfernte Supernova von Studentin
gefunden</b>
<p>(Meldung vom 7.12.1999)
<p>Der Studentin Alicia Soderberg von der Universit&auml;t von Maine ist
es im November gelungen, eine Supernova zu finden, die Milliarden Lichtjahre
von der Erde entfernt ist. Sie nahm an einem Projekt der Harvard University
teil, bei dem Astrophysiker solche explodierenden Sterne suchen, die sehr
weit von der Erde entfernt sind. Das Licht dieser Sterne verr&auml;t den
Wissenschaftlern, ob sich die Rate, mit der sich das Universum ausdehnt,
in der Vergangenheit ver&auml;ndert hat. Das vorl&auml;ufige Ergebnis:
Die Ausdehnung des Universums beschleunigt sich, anstatt langsamer zu werden.
<p>Die von Soderberg entdeckte Supernova, die die Forscher Dudley Doright
tauften, hat eine Rotverschiebung von 1,23. Je h&ouml;her die Rotverschiebung,
desto weiter entfernt ist ein Objekt von der Erde. Eine Gruppe von Studenten
half den Forschern bei der Suche - mit Erfolg: Im November kamen 20 neue
Sternexplosionen dazu. Soderberg entdeckte davon allein neun. Ausserdem
sp&uuml;rten die Studenten bei ihren Beobachtungen mit dem Canada-France-Hawaii-Teleskop
auf Hawaii auch noch einige bislang unbekannte Kometen und Objekte aus
dem sogenannten Kuiper-G&uuml;rtel auf.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p><i>Sonnensystem:</i>
<br><a NAME="Jupiter"></a><b>Jupiter verdr&auml;ngte Uranus und Neptun</b>
<p>(Meldung vom 9.12.1999)
<p>Die vier Riesenplaneten des Sonnensystems, Jupiter, Saturn, Uranus und
Neptun, sind vermutlich nahe beieinander entstanden. Erst sp&auml;ter trieb
die starke Gravitationskraft von Jupiter die beiden kleineren Eisplaneten
Uranus und Neptun in abgelegenere Gegenden des Sonnensystems. Das belegen
zwei Forscherteams im Wissenschaftsmagazin Nature. Martin Duncan und Kollegen
von der Queens University in Kingston, Kanada, fanden durch Computersimulationen
heraus, dass Uranus und Neptun nicht da entstanden sein k&ouml;nnen, wo
sie sich heute befinden. Dort gab es in der Geburtsphase des Sonnensystems
nicht genug Gas und Staub, um so riesige Planeten zu formen. Die These,
dass sie in der N&auml;he von Jupiter entstanden sind, wird durch die Arbeit
von Philip Armitage und Brad Hansen von der University of Toronto in Kanada
unterst&uuml;tzt: Ihre Modellrechnungen zeigen, dass ein Riesenplanet wie
Jupiter, wenn er erst einmal entstanden ist, viel Materie in seiner N&auml;he
ansammelt, die sich zusammenklumpt. Sp&auml;ter k&ouml;nnen aus den Klumpen
weitere Gasplaneten entstehen.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Alte"></a><b>Alte K&uuml;stenlinie auf dem Mars gefunden</b>
<p>(Meldung vom 10.12.1999)
<p>&Uuml;ber dem Nordpol des Mars k&ouml;nnte einst ein 1500 Meter tiefer
Ozean gelegen haben. Das best&auml;tigen detaillierte H&ouml;henmessungen
der Raumsonden Mars Global Surveyor, die Wissenschaftler um James Head
von der Brown University im US-Bundesstaat Richmond auswerteten. Wie die
Forscher im Fachblatt Science berichten, konnten sie rund um das n&ouml;rdliche
Tiefland des Mars, das etwa ein Drittel der Marsoberfl&auml;che bedeckt,
eine geschlossene Linie identifizieren, die im wesentlichen auf der gleichen
H&ouml;he liegt wie man es von einer K&uuml;stenlinie erwarten w&uuml;rde.
Innerhalb des Rings ist die Landschaft sehr viel glatter als au&szlig;erhalb.
Das spricht ebenfalls f&uuml;r ein fr&uuml;heres Meer: Das Wasser h&auml;tte
rauhe Strukturen gegl&auml;ttet. Die Wassermenge, die das Becken aufnehmen
kann, entspricht ungef&auml;hr der Menge, die man f&uuml;r den Mars f&uuml;r
wahrscheinlich h&auml;lt. Au&szlig;erdem entdeckten Head und seine Kollegen
in der N&auml;he der K&uuml;stenlinie terassenartige Gebilde. Sie k&ouml;nnten
bei Vorst&ouml;&szlig;en und R&uuml;ckz&uuml;gen des fr&uuml;heren Mars-Ozeans
entstanden sein. Die Raumsonden Viking 1 und 2 landeten unterhalb der m&ouml;glichen
K&uuml;stenlinie, der Mars Pathfinder in der N&auml;he. Die Wissenschaftler
vermuten, dass die ungew&ouml;hnlich hohen Werte von Chlor und Schwefel,
die in den Gesteinen an den Landepl&auml;tzen gemessen wurden, m&ouml;glicherweise
durch einen fr&uuml;heren Ozean erkl&auml;rt werden k&ouml;nnen.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Komet"></a><b>Komet Hale-Bopp k&ouml;nnte einen Mond haben</b>
<p>(Meldung vom 13.12.1999)
<p>Der Komet Hale-Bopp, der Anfang 1997 einige Monate hell am Nachthimmel
leuchtete, k&ouml;nnte von einem Mond umkreist werden. Das Wissenschaftsmagazin
New Scientist berichtet, dass Zdenek Sekanina vom Jet Propulsion Laboratory
der Nasa das aus Aufnahmen des Hubble-Teleskops schlie&szlig;t. Falls Sekaninas
Vermutung, die er in der Fachzeitschrift "Earth, Moon and Planets" (Vol.
77, S. 155) vorstellt, stimmt, w&auml;re Hale-Bopp der erste Komet mit
einem Satelliten und der erste, dessen Masse direkt berechnet werden k&ouml;nnte.
Der Forscher stellte ein mathematisches Modell f&uuml;r die Helligkeit
des Kometenkerns und seiner Staubwolke, der sogenannten Koma, auf. Dieses
Modell verglich er mit sechs Aufnahmen des Weltraumteleskops Hubble. Auf
f&uuml;nf dieser Aufnahmen blieb jeweils ein heller Fleck &uuml;brig, als
Sekanina das Licht des Kerns und der Koma abzog  seiner Meinung nach ein
Mond, der einen Durchmesser von 33 Kilometer besitzt und Hale-Bopp in 200
Kilometern Entfernung umkreist. Andere Forscher sind skeptisch. Sie glauben,
dass Sekanina seine Daten &uuml;berinterpretiert und dass die hellen Flecke
auf den Fotos Staubjets wiedergeben, die der Kometenkern ausgesto&szlig;en
hat. Der Astronom Brian Marsden vom Harvard-Smithsonian Center for Astrophysics
in Cambridge, Massachusetts unterst&uuml;tzt jedoch Sekaninas Idee: Seiner
Meinung nach k&ouml;nnte Hale-Bopp vor 4200 Jahren dem Riesenplaneten Jupiter
so nah gekommen sein, dass er &auml;hnlich wie der Komet Shoemaker-Levy
9 in mehrere Teile zerrissen wurde. Andere Forscher, die Hale-Bopp von
der Erde aus beobachteten, hatten ebenfalls einen Lichtfleck in der N&auml;he
des Kometen entdeckt.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>"<a NAME="Planetengeschwister"></a>Planetengeschwister" im Konkurrenzkampf</b>
<p>(Meldung vom 13.12.1999)
<p>Bei der Entstehung eines Planetensystems beeinflussten sich die fr&uuml;hen
Planeten gegenseitig stark, meinen Philip Armitage und Brad Hansen vom
Canadian Institute of Theoretical Astrophysics der University of Toronto.
Au&szlig;erdem spiele die Masse der Gas- und Staubscheibe, aus denen die
Planeten entstehen, eine Rolle. In der Dezemberausgabe von Nature haben
die beiden die Planetenformation in entstehenden Sonnensystemen unter die
Lupe genommen.
<p>Wenn ein Sonnensystem entsteht, bilden sich Planeten aus Scheiben aus
Staub und Gas. Armitage sagt: "Wir glauben, dass die Masse dieser Scheibe
die Bildung eines Planetensystems beeinflusst." Wenn die Scheibe leicht
ist, entstehen die Planeten nur langsam – in etwa 10 Millionen Jahren –
und das entstehende System &auml;hnelt sp&auml;ter wahrscheinlich unserem
eigenen. Bei einer schweren Scheibe ergeben sich viel gr&ouml;&szlig;ere
Kr&auml;fte, die viel schneller ablaufen und so in ganz anderen Planetensystemen
resultieren k&ouml;nnen.
<p>Diese Ergebnisse haben die beiden Astrophysiker mithilfe Numerischer
Simulationen herausgefunden. Sie haben zum Beispiel getestet, wie ein schwerer
Planet wie der Jupiter mit einer Scheibe zusammenwirken w&uuml;rde. Sie
haben dazu eine Scheibe angenommen, die zehnmal mehr Masse hat, als die,
die als Ausgangspunkt unseres Sonnensystems vermutet wird. Die Berechnungen
ergaben, dass die Schwerkraft des Planeten die Scheibe zum Kollaps bringen
w&uuml;rde. Die Teile w&uuml;rden von den Planeten angezogen werden und
so w&uuml;rde das System weniger aber daf&uuml;r gigantische Planeten beherbergen.
Zudem w&uuml;rden diese Himmelsk&ouml;rper im Gegensatz zur Erde nicht
fest sein, sondern aus vornehmlich Gas bestehen.
<p>Armitage und Hansen halten es f&uuml;r wahrscheinlich, dass es eine
H&ouml;chstzahl an Planeten in einem System gibt. Denn nahe beieinander
entstehende Planeten w&uuml;rden ein instabiles System bilden. Durch die
gro&szlig;en Kr&auml;fte in einem solchen System w&uuml;rden einzelne Planeten
hinaus in den Raum geschleudert werden und die anderen w&uuml;rden mit
sehr exzentrischen Orbits um das Zentralgestirn kreisen.
<p>"Unsere Arbeit bietet ein neues Verst&auml;ndnis, wie sich mehrere Planeten
in einer relativ kurzen Zeit – in der ersten Million Jahren nach der Entstehung
des Sonnensystems – bilden k&ouml;nnten," sagt Hansen. "Die schnelle Bildung
neuer Planeten f&uuml;hrt zu einem Konkurrenzkampf beim Wachstum und erkl&auml;rt
so, warum es eine H&ouml;chstmasse f&uuml;r Planeten zu geben scheint."
Wie sich erd&auml;hnliche Planeten bilden, bleibt ungewiss, r&auml;umen
die Forscher ein. "Verh&auml;ltnisse wie auf der Erde k&ouml;nnten sehr
selten sein," meint Armitage.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Z-<a NAME="Maschine"></a>Maschine erzeugt Verh&auml;ltnisse wie
in einem Neutronenstern</b>
<p>(Meldung vom 14.12.1999)
<p>Eines der spektakul&auml;rsten Ereignisse im Universum ist, wenn ein
Neutronenstern oder ein Schwarzes Loch einem Nachbarstern Materie stiehlt
und das hereinkommende Material stark erhitzt wird, wobei enorme R&ouml;ntgenstrahlen
frei werden (siehe <i>Astro-Corner</i> 8). Diese R&ouml;ntgenstrahlen k&ouml;nnten
Aufschluss &uuml;ber die Zusammensetzung, Temperatur und die wirkenden
Kr&auml;fte bei einem solchen Ereignis geben, wenn die Physiker w&uuml;ssten,
wie die Botschaft zu entschl&uuml;sseln w&auml;re. Dazu haben Wissenschaftler
in den Sandia Laboratories for Pulsed Power Technology die Z-Maschine gebaut.
<p>Die Maschine, die sehr starke R&ouml;ntgenstrahlen erzeugt, nennen Forscher
schlicht Z. (Als Steigerung des englischen X f&uuml;r X-Ray – R&ouml;ntgenstrahlen.)
In Z wird in einem winzigen Augenblick ein Strom von 18 Millionen Ampere
durch eine zylindrische Anordnung von 300 feinen – jeweils nur 10 Mikrometer
dick – Tungsten Dr&auml;hten gejagt. Dieser immense Stromfluss erzeugt
ein magnetisches Feld, das den Draht mit nahezu Lichtgeschwindigkeit in
die Mitte des Zylinders dr&uuml;ckt. Wenn die Dr&auml;hte sich treffen,
l&ouml;sen sie sich in heisses, ionisiertes Gas – oder Plasma – auf, das
120 Terawatt (Ein Terawatt sind eine Milliarde Kilowatt) starke R&ouml;ntgenstrahlenpulse
sendet. Das macht Z zur st&auml;rksten R&ouml;ntgenstrahlenquelle der Welt.
Plasmaphysiker Robert Heeter vom Lawrence Livermore National Laboratory
dr&uuml;ckt das so aus: "Wenn wir Z einschalten, wackelt das ganze Geb&auml;ude
und der Grund und Boden gleich mit. Man kann das einige Hundert Meter weit
in jeder Richtung sp&uuml;ren."
<p>Die Kraft von Z haben Heeter und seine Kollegen auf Eisenfolie wirken
lassen. Eisen kommt im All reichlich vor und steht als Beispiel f&uuml;r
heisses kosmisches Material. Das Spektrum von hochionisiertem Eisen sei
allerdings sehr komplex, sagt Andrew Fabian vom Institute of Astronomy
in Cambridge. Das mache es schwierig, Eisenspektren, die zum Beispiel das
Chandra R&ouml;ntgenstrahlenobservatorium messe, in astrophysikalisches
Know-How umzuwandeln. Wissenschaftler erkennen bestimmte Elemente im Weltraum
durch ihre typischen Licht- oder R&ouml;ntgenspektra. Denn jedes Element
sendet bei Anregung bestimmte, eigene Signale los. Bei dem angesprochenen
Eisen ist die Erkennung jedoch schwierig, denn durch die hohe Ionisation
– aus der Elektronenh&uuml;lle fehlen viele Elektronen – ver&auml;ndert
sich das Spektrum in einer Weise, die auf der Erde bisher nicht nachzuvollziehen
war. Das &uuml;bernimmt jetzt Z mit seinen starken R&ouml;ntgenpulsen.
Die sind so m&auml;chtig, dass sie von den 26 Elektronen der H&uuml;lle
des Eisens 10 bis 16 wegreissen und das Eisen in Plasmagas verwandeln.
Das soll &auml;hnliche Umst&auml;nde wie im Weltraum simulieren.
<p>Fabian glaubt nicht, dass die Eisenspektren alle Geheimnisse der Schwarzen
L&ouml;cher und Neutronensterne l&uuml;ften. Denn die Schwerkraft und die
Bewegung dieser Himmelsk&ouml;rper verzerrt die R&ouml;ntgenstrahlenemissionen.
Aber die Spektren k&ouml;nnten andere Einsichten bringen: "Sie werden f&uuml;r
die Computersimulation von Gas in Ansammlungen von Galaxien und Sternen
wichtig sein." Astronomen w&uuml;rden die R&ouml;ntgenstrahlen, die aus
dem Gas kommen, gerne untersuchen, um zu erkennen, wo Schockwellen das
Gas erhitzen und wo Supernovae explodiert sind.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Schlangen"></a><b>Schlangen am Kopf der Hydra</b>
<p>(Meldung vom 14.12.1999)
<p>Neue Aufnahmen des R&ouml;ntgenteleskops Chandra erlauben einen Blick
in das turbulente Zentrum des 840 Millionen Lichtjahre entfernten Galaxienhaufens
Hydra A. Zum ersten Mal ist dort zu sehen, wie sich extrem heisse Gasstr&ouml;me
wie Schlangen vom Zentrum des Galaxienhaufens nach au&szlig;en winden.
Diese Strukturen zeigen, dass das Gas, das nach Berechnungen von Astronomen
eigentlich zum Zentrum des Haufens flie&szlig;en m&uuml;sste, durch starke
Magnetfelder daran gehindert wird. Galaxienhaufen sind die gr&ouml;&szlig;ten
Objekte im Universum: Sie sind Ansammlungen von mehreren hundert Galaxien,
die durch ihre Anziehungskraft zusammengehalten werden. Sie enthalten Gas,
aus dem noch zahllose weitere Galaxien und Millionen von Sternen entstehen
k&ouml;nnten. Das Schicksal des Gases war Astronomen bislang ein R&auml;tsel.
Eigentlich hatten sie vermutet, dass dieses relativ k&uuml;hle Gas vom
massiven Schwarzen Loch im Zentrum des Galaxienhaufens angezogen werden
w&uuml;rde. "Bei Hydra A sieht man einen ganzen Zyklus", sagt Brian McNamara
vom Harvard Smithsonian Center for Astrophysics an der Harvard University:
"Es gibt heisse Gaswolken, eine Scheibe aus Staub und Gas, die das Schwarze
Loch f&uuml;ttert, und Anzeichen f&uuml;r Explosionen in der N&auml;he
des Schwarzen Lochs, die das heisse Gas herumwirbeln." Die Astronomen wollen
nun R&ouml;ntgen- und Radioastronomie kombinieren, um zu best&auml;tigen,
dass eine Blase aus hochenergetischen Partikeln das heisse Gas beiseite
schiebt und die schlangenf&ouml;rmigen Strukturen erzeugt, die sehr an
die griechische Sagenfigur Hydra erinnern: Das Monster, gegen das Herkules
k&auml;mpfen musste, besa&szlig; einen Kopf, auf dem statt Haaren Schlangen
wuchsen.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Am&nbsp;<a NAME="Tag"></a>Tag, als der Sonnenwind verschwand</b>
<p>(Meldung vom 15.12.1999)
<p>Vom 10. bis zum 12. Mai dieses Jahres verringerte sich der Partikelstrom
von der Sonne, der sogenannte Sonnenwind, auf einen Bruchteil seiner &uuml;blichen
Dichte - die drastischste und l&auml;ngste Abnahme, die man jemals beobachtet
hat. Physiker konnten in dieser Zeit Elektronen beobachten, die in engen
Strahlen direkt von der Sonnenkorona zur Erde flogen. Unter normalen Umst&auml;nden
werden diese Elektronen im interplanetaren Raum abgelenkt und mit anderen
Teilchen vermischt, so dass sie nur schlecht beobachtet werden k&ouml;nnen.
"Unsere normale Sicht auf die Korona ist so, als wenn man die Sonne an
einem bedeckten Tag von der Erde aus beobachtet", sagte Jack Scudder von
der University of Iowa und Mitarbeiter im Team des Nasa-Satelliten Polar.
"Am 11. Mai waren die Wolken weg und wir konnten die Korona klar sehen."
Die Elektronen von der Korona sorgten am Nordpol f&uuml;r ungew&ouml;hnliche
Polarlichter: Der Satellit Polar entdeckte &uuml;ber dem Nordpol ein dauerhaftes
Leuchten im R&ouml;ntgenlicht. Die Magnetosph&auml;re der Erde, die normalerweise
vom Sonnenwind zusammengedr&uuml;ckt wird, dehnte sich am 11. Mai zum f&uuml;nf-
bis sechsfachen ihrer normalen Gr&ouml;&szlig;e aus. Die &auml;u&szlig;eren
Strahlungsg&uuml;rtel der Erde l&ouml;sten sich w&auml;hrend dieses Ereignisses
auf und waren noch einige Monate sp&auml;ter d&uuml;nner als &uuml;blich.
Offenbar ging der Sonnenwind in den beiden Tagen um 98 Prozent zur&uuml;ck.
Vor allem Helium und schwerere Teilchen konnten der Anziehungskraft der
Sonne nicht entkommen.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Der"></a><b>Der Mensch ist nicht allein - aber aus dem "gr&uuml;nen
M&auml;nnchen" wird wohl nichts</b>
<p>(Meldung vom 15.12.1999)
<p>Britische Wissenschaftler versprachen am Anfang dieser Woche auf einem
Forum zur Astrobiologie der &Ouml;ffentlichkeit, dass sie im neuen Jahrtausend
das Universum nach Zeichen au&szlig;erirdischen Lebens durchforsten werden.
Allerdings werden die n&auml;chsten Nachbarn der Erde wohl einfache Organismen
wie Bakterien sein – und keinesfalls die ber&uuml;hmten gr&uuml;nen M&auml;nnchen.
Im neugegr&uuml;ndeten Forum treffen Wissenschaftler aus unterschiedlichsten
Disziplinen wie Biologie, Physik und Geologie zusammen, um ihre Erfahrungen
zu sammeln und f&uuml;r ein Studium der Evolution zur Verf&uuml;gung zu
stellen.
<p>"Die Astrobiologie hat sich zum Ziel gesetzt, Antworten auf eine der
fundamentalsten Fragen zu finden: Sind wir allein?", so der Forum-Sprecher
Don Cowan. "Was wir tun werden, ist nach Leben auf anderen Planeten zu
suchen. Wir werden dabei wohl eher mikrobiologisches Leben entdecken –
etwas, was den Bakterien auf unserem Planeten entspricht."
<p>Das Forum ist nichtstaatlich, aber an das Britain's National Space Center
angegliedert. In der Hoffnung auf finanzielle Unterst&uuml;tzung sind auch
Experimente im Weltall und auf der Erde geplant, um die Geheimnisse der
Evolution zu entr&auml;tseln. Ein geplantes Projekt ist dabei die Landung
einer Sonde auf dem Mars im Jahr 2003. Nach dem Debakel der beiden NASA-Missionen
Mars Climate Orbiter und Mars Polar Lander wollen die britischen Wissenschaftler
sobald wie m&ouml;glich ihr Projekt in die Realit&auml;t umsetzen – allerdings
fehlen ihnen daf&uuml;r noch ca. 40 Millionen Dollar.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Terra"></a><b>Terra vervollst&auml;ndigt das Bild von der
Erde</b>
<p>(Meldung vom 15.12.1999)
<p>Der NASA Satellit Terra wird ab morgen ganz neue Erkenntnisse &uuml;ber
die Atmosph&auml;re, die Ozeane, das Land und ihre Rolle im globalen Klimawechsel
liefern. Der Satellit startet morgen und mit ihm die Instrumente des CERES-Programmes
(Clouds and Earth&acute;s Radiant Energy System – Wolken- und Erdstrahlungs-Energie
System) des NASA Langley Research Center. Dieses internationale Projekt
soll das Bild der Erde als ein vollst&auml;ndiges System erg&auml;nzen.
CERES ist eines von f&uuml;nf Messger&auml;ten, die an Bord des Satelliten
mitfliegen. Das erdbeobachtende System Terra ist eine Zusammenarbeit der
Vereinigten Staaten, Japan und Kanada.
<p>Terra und CERES werden das erste Mal Daten &uuml;ber Wolken, Wasserdampf
und das Strahlungsgleichgewicht der Erde gleichzeitig sammeln. Das Strahlungsgleichgewicht
steht f&uuml;r die hereinkommende Sonnenstrahlung und die Abstrahlung der
Erde in den Weltraum. "Wir erwarten einen neuen Grad an Messgenauigkeit
bei diesen Strahlungsenergiefl&uuml;ssen," sagt Bruce Wielicki, einer der
leitenden Wissenschaftler des CERES-Projekts. "Um diese Genauigkeit zu
erreichen, benutzen wir zwei Ger&auml;te an Bord von Terra." Eines davon
soll die gesamte Erde vom Pol bis zum &Auml;quator scannen. Das andere
soll in verschiedenen Winkeln den Strahlungsfluss der Hemisph&auml;re messen.
Denn der &auml;ndere sich dramatisch mit dem Breitengrad, erkl&auml;rt
Wielicki. Die Energie, die Erde und Sonne ausstrahlen, wird zusammen mit
den Wolken gemessen. Diese Daten bieten die M&ouml;glichkeit Computermodelle
zur globalen Klimavoraussagezu &uuml;berpr&uuml;fen.
<p>Manche Daten werden durch die Kombination der Messungen mehrerer Instrumente
erzeugt. Das erlaubt den Forscherteams einen breiten, wissenschaftlichen
Zugang zu spezifischen Problemen. "Das Terra Observatorium bietet durch
die Kombination mehrerer Instrumente, die zur gleichen Zeit den gleichen
Ort betrachten, v&ouml;llig neue M&ouml;glichkeiten in der Beobachtung
der Erde," sagt Wielicki. CERES misst die Sonnenenergie, die zur&uuml;ck
in den Weltraum gestrahlt wird, und die thermische Energie der Erde. Die
anderen Instrumente werden neue, genauere Messungen der Wolken und Aerosole
(kleiner Teilchen in der Atmosph&auml;re) bringen. Das ist wichtig, weil
diese beiden St&ouml;rgr&ouml;&szlig;en den Energiefluss &auml;ndern. "Das
alles k&ouml;nnte neue Studien &uuml;ber Ursachen und Wirkungsmechanismen
im Klimasystem erm&ouml;glichen," prognostiziert Wielicki.
<p>Die CERES-Daten gehen in die Earth Radiation Budget Satellite (ERBS)
Datenbank ein, die Aufzeichungen &uuml;ber das Klima seit den 80er Jahren
sammelt. Wielicki ist gespannt auf die Weiterf&uuml;hrung der Beobachtungen:
"Die Dokumentation des Klimas ist ein kritisches Ma&szlig; f&uuml;r den
Energiefluss vom und auf den Planeten." Auch an den &Auml;nderungen seit
und bei dem gro&szlig;en El Nino von 1997/1998 ist der Wissenschaftler
interessiert. Auch die Prognosen von Wetter-Katastrophen werden von Daten
aus Satelliten aus gest&uuml;tzt.
<p>Daten, die in das CERES-Programm eingehen, sammelt seit 1997 auch die
Tropical Rainfall Measuring Mission (TRMM) – die Messmission f&uuml;r tropischen
Regen. Diese Messreihe hat den Wissenschaftlern Einblicke in den Strahlungsfluss
in den Tropen geliefert, die neuen Instrumente aber werden diese Beobachtungen
auf den gesamten Globus ausweiten. Auch die Nachfolgeinstrumente der CERES-Mission
von morgen sind schon in Planung. Eine fortlaufende 15-Jahres-Beobachtung
von genauen Strahlungs- und Wolkendaten f&uuml;r Klimaanalysen ist geplant.
<p><a href="#Inhalt">ZURUECK</a>
<p>
<hr WIDTH="100%">
<p>So, das war nun die Jubil&auml;umsausgabe der <b>Astro-Corner</b>. Ich
hoffe, es war wieder etwas f&uuml;r jeden von euch dabei. Ach, bevor ich
es vergesse: Hallo Wolfgang Bauer! Vielen Dank f&uuml;r deine Meinung.
Du warst &uuml;brigens der Einzige. ;-)
<p>Bis zur n&auml;chsten NoCover w&uuml;nsche ich euch allen ein <i>frohes
Weihnachtsfest</i> und einen <i>guten Start ins neue Jahr</i> (welches
&uuml;brigens noch nicht der Beginn des neuen Jahrtausends ist!).
<p>Bis dann...
<br>euer <b>Lars Philipsen</b>
<p><a href="mailto:LarsPh@gmx.de?subject=Astro-Corner">LarsPh@gmx.de</a>
</body>
</html>
