

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Tips & Tricks zu Foundation</TITLE>
</HEAD>
<BODY TEXT=white bgcolor=black link=silver alink=red>
<h1><CENTER><FONT COLOR="GREEN">Tips & Tricks zu
Foundation</FONT></h1></CENTER></P>

Foundation (Test der DC Version in dieser Ausgabe) mach h&#246;llischen Spa&#223; und
auf Dauer s&#252;chtig. F&#252;r die treuen NC Leser habe ich einige Tips
zusammengestellt, damit sich der Erfolg u.U. etwas schneller einstellt:</P>
<ul>
<li> Am Anfang sollte man nichts &#252;berst&#252;rzen, was f&#252;r viele Siedler Fans
sicherlich etwas ungew&#246;hnlich ist. Bei Foundation sollte man nicht schon am
Anfang zu schnell expandieren, da man ansonsten keine Rohstoffe mehr zur
Verf&#252;gung hat. Also: Nichts &#252;berst&#252;rzen! </P><BR>

<li> Noch was, um aus dem Quark zu kommen: Lasst erstmal Eure Bev&#246;lkerung
wachsen und achtet darauf, da&#223; diese auch in Zukunft weiter anw&#228;chst.
</P><BR>
<li> Vermeidet in den Missionen &#252;berfl&#252;ssige Produktion von G&#252;tern. Im Gegensatz
zu Siedler wirkt sich das n&#228;mlich negativ auf das weitere Spielgeschehen
aus, da nach gewisser Zeit nichts mehr transportiert werden kann und keine
Nahrung mehr ankommt, was das Wegsterben von Bev&#246;lkerung zur Folge hat.
</P><BR>
<li> Von einigen Geb&#228;udetypen reicht eines völlig aus: Wenn Ihr z.B. mehr als ein
Krankenhaus ben&#246;tigt, l&#228;uft irgendetwas falsch.</P><BR>

<li> Nicht nur zu wenig Bev&#246;lkerung ist t&#246;dlich, sondern auch zuviel: Bedenkt
immer, da&#223; ihr Eure Bev&#246;lkerung mit Nahrung versorgen m&#252;sst und je gr&#246;&#223;er
diese ist, umso mehr Farmen (mit Arbeitern, die woanders besser einzusetzen
sind), Pumpenh&#228;user etc. m&#252;ssen gebaut werden und umso mehr Waren m&#252;ssen
auch transportiert werden. F&#252;r viele Missionen ist ein Wert von 200-250
Personen angemessen.</P><BR>

<li> Bei einigen Missionen habt Ihr nicht unendlich Zeit um diese zu erf&#252;llen.
Wenn die Order z.B. lautet &quot;Befreit x Gefangene&quot;, dann solltet Ihr Euch etwas
beeilen, da die Gefangenen auch nicht ewig leben. Es ist somit nicht immer
notwendig, erst eine intakte Infrastruktur zu schaffen.</P><BR>

<li> Benutzt niemals die Option &quot;Game Speed&quot;, um die Geschwindigkeit zu erh&#246;hen.
Normalerweise habt Ihr immer genug um die Ohren und in den seltesten F&#228;llen
zu viel Zeit. Die Gefahr bei der Erh&#246;hung der Spielgeschwindigkeit besteht
vor allem darin, da&#223; Ihr den &#220;berblick verliert und Ihr den Gegner aus den
Augen verliert, der dann pl&#246;tzlich an Eurer Grenze steht und angreift.
</P><BR>
<li> Auch Feinde von Statistiken sollten h&#228;ufiger mal in die Rubrik &quot;Best &amp;
Worse&quot; schauen, damit man wei&#223;, an welchen G&#252;tern Mangel herrscht und welche
Produktion man drosseln kann. So helfen Unmengen von Steinen &#252;berhaupt
nichts, wenn man kein Holz hat (ok, ziemlich bl&#246;des
Beispiel...).</P><BR>

<li> Angriffe sollten immer wohl&#252;berlegt sein. So bringen Angriffe ganz am
Anfang i.d.R. (!) ebensowenig wie sp&#228;tere un&#252;berlegte Massenangriffe -
kleinere Attacken k&#246;nnen da wesentlich effizienter sein.</P><BR>

<li> Ach ja: Und wartet mit Angriffen immer, bis Ihr die F&#228;higkeit habt, H&#228;user
niederzubrennen, denn erst das schw&#228;cht den Gegner erheblich. Besonders
strategisch wichtige Geb&#228;ude wie Pumpenh&#228;user &amp; Farmen sollten dabei als
erstes niedergebrannt werden - sobald einmal die Nahrunsgversorgung
unterbrochen ist (und das &#252;ber einen l&#228;ngeren Zeitraum) wird der Gegner von
alleine schwach werden.</P><BR>

<li> Nat&#252;rlich wei&#223; das auch Euer Gegner, also la&#223;t immer gen&#252;gend Wachen im
eigenen Land zur&#252;ck und sichert vor allem die Grenzen gut ab - ist der
Gegner einmal durchgebrochen, wird es schwierig, die Situation wieder unter
Kontrolle zu bekommen.</P><BR>

<li> Und da wir gerade bei der &quot;Verteidigung&quot; sind: Ein &quot;Gun Tower&quot; direkt an
der Grenze mit einem weiteren direkt dahinter, schw&#228;cht / t&#246;tet die Gegner
teilweise recht erheblich und macht es Euch nebenbei einfacher, gezielte
Attacken vorzubereiten.</P><BR>

<li> Ein weiterer abschlie&#223;ender Tip: Achtet immer darauf gen&#252;gend Arbeiter
im Hauptquartier zu haben, da ansonsten keine Waren transportiert werden und
alles zusammenbrechen kann.</P><BR>
</UL>
So, ich hoffe, da&#223; die Tips f&#252;r den einen oder anderen Foundation Anf&#228;nger
hilfreich waren und diese zumindest etwas hilfreich waren. Solltet Ihr auch
noch Tips haben: Vr&#246;ffentlicht diese doch einfach in der NC.</P><BR>


  
 
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
