

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Digital Almanac II - das Astronomieprogramm für den Amiga !?</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<h1><CENTER><FONT COLOR="GREEN">Digital Almanac II</FONT></h1></CENTER></P>
Bei &quot;Digital Almanac II&quot; (Version: 1.7) handelt es sich um ein
Astronomieprogramm f&#252;r unsere Freundin. Damit ist es Ihnen ohne weiteres
m&#246;glich, sich die Sterne- und Planetenpositionen zu jedem beliebigen
Zeitpunkt ansehen zu k&#246;nnen. Daneben bietet das Tool auch noch eine
Datenbank mit &#252;ber 15 Millionen Sternen, &#252;ber 40.000 Galaxien, Nebeln etc.
und 55.000 Asteroiden und Kleinplaneten. Ob sich die Investition von 69 DM
lohnt, soll dieser Test kl&#228;ren.</P>

<h2><CENTER><FONT COLOR="YELLOW">Installation &amp;
Systemanforderungen</FONT></CENTER></H2></P>
Um das auf einer selbst gebrannten CD, deren Icons positiverweise &#252;brigens im neuen
Glow Icon Stil gehalten wurden, ausgelieferte Programm auf einer
Festplatte zu installieren, liegt ein praktisches Installerscript bei,
welches alle ben&#246;tigten Daten (und ggbf. noch weitere) auf die Festplatte
kopiert. Um aber mit dem Inhalt auch was anfangen zu k&#246;nnen, sind folgende
Anforderungen unabdingabr:</P>

<u><B>Minimale Systemkonfiguration:</U></B></P><UL>

<li> OS 3.0 / AGA<BR>
<li> 68020 / 68881<BR>
<li> 6 MB Fast Ram<BR>
<li> Festplatte &amp; CD Rom Laufwerk<BR>
<li> MUI 3.8</P></UL>

<u><B>Empfohlene Systemkonfiguration:</U></B></P><UL>

<li> OS 3.1 / 3.5<BR>
<li> 68040 / 68060<BR>
<li> 16 MB Fast Ram (oder mehr)<BR>
<li> Grafikkarte mit CyberGFX 3.X<BR>
<li> Turboprint f&#252;r verbesserte Druckerausgabe<BR>
<li> ixemul 39 + (MPEG Unterst&#252;tzung)</P></UL>

F&#252;r die Bilder der beiliegenden Bildersammlung sollten ferner noch die
g&#228;ngigen Datatypes installiert werden, welche sich ebenfalls auf der CD
befinden. Digital Almanac arbeitet &#252;brigens auch ganz hervorragend mit dem
Tool &quot;FBlit&quot; aus dem Aminet zusammen, was AGA-only Usern mit 2MB Chip Ram
sicherlich sehr entgegenkommt, da dieses Tool s&#228;mtliche Grafiken in das Fast
Ram kopiert - Chip Ram Probleme geh&#246;ren somit, zumindest teilweise, der
Vergangenheit an.</P>

Leider gestaltete sich der erste Start alles andere als einfach: Hier musste
erst herumkonfiguriert werden und s&#228;mtliche Patches sollten abgeschaltet
werden, falls es zu unerkl&#228;rlichen Abst&#252;rzen kommt. Mit &quot;Picasso 96&quot; scheint
sich Digital Almanac auch nicht zu vertragen, weswegen einige User (und UAE
Benutzer) im Regen stehen d&#252;rften...</P>

<h2><CENTER><FONT COLOR="WHITE">Wilkommen zu Digital Almanac
II</FONT></CENTER></h2></P>
Zu allererst m&#246;chte ich einmal einige Features von &quot;Digital Almanac II&quot;
anf&#252;hren, damit Ihr Euch ein besseres Bild von der Vielschichtigkeit und
Komplexit&#228;t machen k&#246;nnt:</P><UL>

<li> Sternendatenbank mit ca. 500.000 Sternen<BR>
<li> Cross Index f&#252;r SAO, PPM, HD, YBS und GC Kataloge<BR>
<li> Etwa 40.000 Deep-Sky-Objekte (z.B. Messier, NGC, IC, UGC, Abell
etc.)<BR>
<li> Hochgenaue Mond- und Planetenberechnung mittels JPL Integrationstabellen<BR>
<li> Monde vom Jupiter, Saturn &amp; Uranus<BR>
<li> Texturen f&#252;r alle Planeten &amp; Monde<BR>
<li> Milchstra&#223;enstruktur<BR>
<li> Ansicht des Sternenhimmels von jedem beliebigen Objekt des Sonnensystems<BR>
<li> Speichern von Animationen im QT, MPEG oder IFF-Anim Format</P></UL>

Wie Ihr sicherlich schon gemerkt habt, wendet sich dieser Almanac eher an
die Profis unter Euch - ein Laie wird sp&#228;testens bei Begriffen wie &quot;Deep Sky
Objekte&quot; nicht mehr wissen, worum es &#252;berhaupt geht. Macht aber auch nichts,
da alle Features transparent in die sehr aufger&#228;umte und &#252;bersichtliche Oberfl&#228;che, die auf der Systemerweiterung MUI basiert,
integriert sind und somit auch dem Anf&#228;nger in dieser Materie einen leichten
<img src="da1.jpg" align=left>Einsteig garantiert. Um allerdings auch nur so halbwegs sinnvoll mit der
Oberfl&#228;che zu arbeiten, m&#246;chte ich an dieser Stelle nochmals anmerken, da&#223;
eine GraKa absolute Pflicht ist, m&#246;chte man nicht st&#228;ndig Fenster
verschieben oder wegclicken. Das absolute Minimum ist daher einer Aufl&#246;sung
von 640 X 480; empfehlen w&#252;rde ich 1024 X 768. Ach ja: Sollte man wirklich
mal nicht wissen, was sich hinter der einen oder anderen Funktion verbirgt,
kann man imme rnoch auf die gute Sprechblasenhilfe bzw. das beiliegende
AmigaGuide Dokument zur&#252;ckgreifen.</P>

Sp&#228;testens jetzt kann man sich nach Herzenlust in dem Programm austoben und
einen Rundgang durch unser Sonnensystem machen.  Das tolle dabei ist, daß
wir immer nocj
unsagbar viele Einstellungsm&#246;glichkeiten haben: Wie w&#228;re es z.B. mal zu sehen, wie
unser Sonnensystem vor 1 Million Jahren ausgesehen hat? Das ist mit &quot;Digital
Almanac II&quot; &#252;berhaupt kein Problem und zeigt teilweise erstaunliche
Entwicklungen auf. Oder wie w&#228;re es den Flug des Kometen &quot;Hale-Bopp&quot; durch
unser Sonnensystem zu verfolgen? Auch das ist nat&#252;rlich m&#246;glich, wobei man
sogar verschiedene Perspektiven zur Darstellung (entweder aus Sicht des
Kometen oder von einem festgelegten Punkt) w&#228;hlen kann (f&#252;r eine ruckelfreie
Animation ist nat&#252;rlich ein entsprechender Amiga von n&#246;ten). Rect
interessant fand ich auch die Funktion &quot;Spur zeichnen&quot;: Damit ist es
m&#246;glich, die Bewegung eines K&#246;rpers (z.B. eines Kommeten) mit ungew&#246;hnlicher
Flugbahn auf der Karte nachzuzeichnen und diese dann nachzuverfolgen.
Auch so &quot;triviale&quot; Dinge wie Sonnen- und Mondfinsternis sind vollst&#228;ndig in
das Programm integriert und k&#246;nnen jederzeit abgefragt werden. Wer die
letzte Sonnenfinsterniss verschlafen hat, kann diese also nochmals erleben.
Ein weiteres recht n&#252;tzliches Extra ist der &quot;Kalender&quot;, der Informationen
&#252;ber verschiedene Ereignisse des Tages oder Monats enth&#228;lt.
Nat&#252;rlich gibt es noch zahlreiche weitere M&#246;glichkeiten mit &quot;Digital Almanac
II&quot; umzugehen (alleine schon die zahlreichen Sterne bieten zahlreiche
Informationen) und f&#252;r Experten in dieser Materie (von denen ich keiner
bin!!) ist der &quot;Digital Alamanac II&quot; sicherlich mehr als nur ein
Experementierprogram und offeriert jenen eine F&#252;lle von
Informationen.</P>

<h2><CENTER><FONT COLOR="RED">Was war sonst noch? </FONT></CENTER></h2></P>

Lobenswert erw&#228;hnen m&#246;chte ich an dieser Stelle noch die gelungene
Druckerunterst&#252;tzung, die auch den Quasi Standard &quot;Turbo Print&quot; unterst&#252;tzt,
was auch das Drucken von High- und True Color Bildschirmen zul&#228;sst und die
l&#228;stige 256 Farben Beschr&#228;nkung des Commodore &quot;printer.device&quot; aufhebt. Wer keinen Drucker
angeschlossen hat, kann die Karten nat&#252;rlich auch als Bilddatei (IFF, JPG, PPM oder auch als Animation)
abspeichern und diese anschlie&#223;end auf einem anderen Rechner ausdrucken
(auch das Speichern in Graustufen ist m&#246;glich).</P> 

Wie es sich f&#252;r jedes moderne Amiga Programm geh&#246;rt, verf&#252;gt auch &quot;Digital
Almanac II&quot; &#252;ber eine ARexx Schnittstelle mit einigen Makros, die
<img src="da2.jpg" align=right>mitgeliefert werden. In Zukunft kann damit gerechnet werden, da&#223; weitere
Makros von Besitzern geschrieben werden, die sich dann (hoffentlich) im
Aminet runterladen lassen.</P>

Auch beim Texturenhandling ist &quot;Digital Almanac&quot; auf dem aktuellen Stand der
Dinge. War es in der Vergangenheit noch so, da&#223; es weder CyberGFX
Unterst&#252;tzung noch Texturen &#252;ber 32 Farben geben konnte, so k&#246;nnen in der
aktuellen Version die Texturen jede beliebige Gr&#246;&#223;e (auch das war in der
Vergangenheit nicht so) und Farbtiefe (z.B. True Color) haben. Nat&#252;rlich
wird mitlerweile auch CyberGFX direkt unterst&#252;tzt. Somit ist es dem User
jederzeit m&#246;glich, eigene Texturen in das Hauptprogramm
einzubinden.</P>

Als Bonus befinden sich auf der CD noch verschiedene Datatypes (die aber
ohnehin auf jedem System installiert sein sollten), das XPK System in
Version 5.2 (welches f&#252;r das benutzen des IFF-RGFX Format unabdingbar ist)
und das &#228;ltere Astronomieprogramm VWorlds 3.0. Letzteres wird zwar nicht
mehr weiterentwickelt und bietet auch nicht den enormen Funktionsumfang von
&quot;Digital Almanac II&quot;, reicht aber f&#252;r kleinere Aufgaben (z.B.
Milchstra&#223;enstruktur) v&#246;llig aus.</P>

Und last but not least w&#228;ren da die zahlreichen Bilder, die sich ebenfalls
auf der CD befinden und das rundherum gelungene Paket abrunden und
gleichzeitig sehr interessant anzuschauen sind - auch die Qualit&#228;t bewegt
sich in guten bis sehr guten Bereichen, so da&#223; man auf Grafikkarten Bildschirmen meinen
k&#246;nnte, den Planeten zum greifen nahe zu sein. Wie oben schon erw&#228;hnt liegen
die Bilder im PNG Format vor.</P> <CENTER>
<img src="da3.jpg"></CENTER></P><BR>

<h1><CENTER><FONT COLOR="BLUE">Fazit</FONT></CENTER></h1></P>
&quot;Digital Almanac&quot; ist ein einzigartiges Programm auf dem Amiga - ersnthafte
Konkurrenten gibt es in diesem Sektor auf jeden Fall nicht. Trotzdem bietet
das Programmpaket einen enormen Funktionsumfang und ist somit f&#252;r Hobby
Astronomen sehr interessant. Der Preis ist auch &#228;u&#223;erst fair und bel&#228;uft
sich auf 69 DM. Da das Paket konstant weiterentwickelt wird (Version auf der
CD: 1.7), kann man auch in Zukunft mit Updates rechnen, die sich dann
kostenlos aus dem Aminet ziehen lassen und das ganze noch weiter aufwerten.
Fans der Materie m&#252;ssen hier zugreifen!</P><BR><CENTER>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Schatztruhe</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>69 DM</TD>
</TR>
<TR>
<TD>Art</TD>
<TD>Astronomieprogramm</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>352</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>85 %</TD>
</TR>
</TABLE></CENTER></P><bR>


<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
