
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Super View Produrctivity Suite II - Eine lohnenswerte Investition?</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<h1><CENTER><FONT COLOR="GREEN">Super View Productivity Suite
II</FONT></CENTER></h1></P>
<CENTER><img src="svcover.jpg"></CENTER></P><BR>
Auf dem Grafiksektor war der Amiga schon immer unschlagbar - auch, oder
gerade, in den vergangenen Jahren. Neben qualitativ hochwertiger Software
(Art Effect, Image FX, PPaint oder auch das neue fxPaint) trug dazu vor allem
das geniale Datatype System bei, mit dem man so ziemlich alles an Formaten
lesen und weiterbearbeiten kann - und das mit nahezu jeder Anwendung. Eine
Alternative zu den Datatypes stellt die Super View Productivity Suite II von
Andreas Kleinert, der auch schon zahlreiche Datatypes geschrieben hat, dar.
Ob sich der Kauf lohnt, soll dieser Test zeigen.</p>

<h2><CENTER><FONT COLOR="YELLOW">Was wird denn so
geboten?</FONT></CENTER></h2></P>
Zwar ist die CD mit 124 MB nicht gerade voll, aber bei Convertern ist dies
ja durchaus normal (was soll man denn bittesch&#246;n mit einer 300 MB
&quot;Killeraplikation&quot; wie unter Windows, die auch nicht mehr kann?). Im
einzelnen befinden sich folgende Schubladen auf der CD:</P><UL>

<li> SView IV (das Hauptprogram)<BR>
<li> SView PPC Package<BR>
<li> Datatypes<BR>
<li> Wizard Library<BR>
<li> Keyfiles<BR>
<li> Bonus</P>
</UL>
Dazu gibt`s noch ein Readme bzw. eine Liesmich Datei, in der aber lediglich
das selbe, wie schon oben steht. Bevor ich auf das Kernst&#252;ck der CD, SView
IV, eingehe, m&#246;chte ich kurz die restliche Software vorstellen.</P>

<u>Datatypes &amp; Wizard Library:</U><BR>
Wie oben schon kurz angeschnitten, arbeitet der Autor der Super View
Productivity Suite II auch an verschiedenen Datatypes f&#252;r den Amiga, die
sich seit geraumer Zeit in Demo Versionen aus dem Aminet laden lassen und
sich namentechnisch durch das &quot;ak&quot; (Initialen des Autors) vor dem Namen hervorheben. Nat&#252;rlich sind
die wichtigsten auch auf dieser CD vertreten; um genau zu sein sind dies
&quot;akMPEG&quot;, &quot;akJFIF&quot;, &quot;akNAIL&quot;, &quot;akPNG&quot; und &quot;akTIFF&quot; - die wichtigtsen Formate
sind damit abgehandelt (auch wenn diese i.d.R. ohnehin schon auf dem eigenen System
installiert sind). Damit diese Datatypes (bzw. derren Voreinsteller) auch
funktionieren, muss die sog. &quot;Wizard Library&quot; installiert werden. Ohne diese
tut sich n&#228;mlich beim Doppelclick auf das Voreinsteller Piktogram gar
nichts. Falls also noch nicht geschehen, sollte zun&#228;chst eben diese Library
kopiert werden. Es handelt sich bei diesen Datatypes übrigens um die registrierten Module, worauf ich aber unten noch genauer eingehen werde.
</P>

<u>Bonus:</U><BR>
Neben einigen Pics in verschiedenen Formaten, mit denen man die F&#228;higkeiten
von Super View testen kann, ist in diesem Ordner vor allem die zus&#228;tzlich
beigelegte Software von Drittherrstellern interessant, die nat&#252;rlich
hervorragend mit Super View zusammenarbeitet und dadurch noch einige weitere
Formate auf dem Amiga m&#246;glich macht. Aber ich denke mal, da&#223; Tools wie
&quot;Ghost Script&quot; und &quot;Meta View&quot; hinreichend bekannt sind und eine Erl&#228;uterung
an dieser Stelle zuweit f&#252;hren w&#252;rde. Additional sind noch zwei ARexx
Scripte, die die Arbeit zwischen Super View und Dir Opus erleichtern sollen,
in diesem Ordner vorhanden.</P>

<U>Keyfiles:</U><BR>
In diesem Ordner befindet sich ein schlichtes Program (ebenfalls basierend
auf der Wizard Lib.), das, nach Eingabe diverser Daten (u.a. Seriennummer
aus dem Booklett etc.), entsprechende Keyfiles Im S: Verzeichnis erzeugt.
Neben einem Keyfile f&#252;r Super View werden gleich auch welche f&#252;r die
verschiedenen Datatypes erzeugt. Ist zwar ein etwas seltsamer Weg, aber da
alles recht fix und unkompliziert abging, ist dies kein echter Mangel.
Vielleicht integriert man diesen Teil mal in den Installationsprozess? Dann
w&#228;re alles fein....</P>


<h2><CENTER><FONT COLOR="RED">Das Herzst&#252;ck: Super View
IV!</FONT></h2></CENTER></P>
Nachdem ich bisher nur auf den beiliegenden &quot;Schnickschnack&quot; eingegangen
war, folgt nun das Hauptprogram der Suite. Vorweg dazu eine kleine
Anmerkung: Ebenfalls auf der CD sind einige PPC Module f&#252;r eben dieses
Programm vertreten. Aus Mangel an einem PPC Board konnte ich diese nat&#252;rlich
nicht installieren, geschweige denn testen. PPC Karten Besitzer sollten also
nach der Installation noch diese Module installieren - ein
Geschwindigkeitszuwachs ist der Lohn daf&#252;r.</P>

F&#252;r diejenigen, die noch nicht wissen, wof&#252;r Super View &#252;berhaupt gut ist,
m&#246;chte ich an dieser Stelle mal eine kurze Zusammenfasung geben: Super View
ist ein Tool, mit dem man auf einfache &amp; komfortabele Weise alle g&#228;ngigen
(und weniger g&#228;ngigen) Grafikformate anzeigen, konvertieren und in gewissem
<img src="svps1.jpg" align=left>Ma&#223;e auch bearbeiten kann. Durch den modularen Aufbau des Programs wird so
ziemlich alles an Grafikformaten gelsen (insgesamt &#252;ber 50!!), was es
derzeit gibt. Aber nicht nur in dieser Hinsicht ist Super View unschlagbar.
Auch die Unterst&#252;tzung von jeder m&#246;glichen Grafikhardware ist so sicherlich einzigartig.
Neben den
Chips&#228;tzen des Amigas, also ECS &amp; AGA, werden auch Picasso96 und CyberGFX
unterst&#252;tzt. Einige &#228;ltere GraKa`s, die sich nicht &#252;ber eines dieser
Treibersystem ansprechen lassen, verf&#252;gen &#252;ber einen speziellen Treiber.
</P>
&#220;ber die elegante Oberfl&#228;che, in der man sich nach kurzer Eingew&#246;hnungszeit
sehr gut zurecht findet, kann man dann Bilder laden (und nat&#252;rlich auch
anzeigen), um diese zu konvertieren oder zu bearbeiten. An
Bearbeitungsm&#246;glichkeiten stehen dem User auch einige (insgesamt &#252;ber 40)
zur Verf&#252;gung. Diese k&#246;nnen &amp; wollen andere Bearbeitungsprogramme, die sich
auf die Bearbeitung spezialisiert haben, nicht ersetzen oder gar verdr&#228;ngen,
aber f&#252;r kleinere Arbeiten (z.B. das Herunterrechnen von 24 Bit Daten auf
256 Farben etc.), die im allgemeinen anfallen, sind diese
Bearbeitungsm&#246;glichkeiten genau richtig und arbeiten schon auf einem 68040
sehr schnell, so da&#223; lange Wartezeiten vermieden werden k&#246;nnen. Auch
Anf&#228;nger, die nicht mit den g&#228;ngigen Bearbeitungstools umgehen k&#246;nnen (da
diese bestimmtes Wissen vorraussetzen), haben so die M&#246;glichkeit,
interessante Ergebnisse (z.B. Einf&#228;rben von Bildern in Rot, Blau etc.), die
auch professionell aussehen, zu erzielen.</P> 

Und da wir gerade bei der Geschwindigkeit des Programs sind: Auch das
Konvertieren verschiedener Bilder in alle m&#246;glichen Formate geht &#228;u&#223;erst
z&#252;gig vonstatten und l&#228;&#223;t eine ausgezeichnete Programmierung, die dahinter
stecken muss, vermuten. Fehler sind dabei im Test, der zahlreiche Konvertierungsdurchg&#228;nge
beinhaltet, nicht aufgetreten. Wie oben schon erw&#228;hnt kann Super View so ziemlich alles
lesen und konvertieren was es derzeit gibt - und da st&#228;ndig an dem Programm
und seinen Bestandteilen gearbeitet wird, wird sich daran in Zukunft auch
nichts &#228;ndern. Nat&#252;rlich hat man auch die M&#246;glichkeit, beim Konvertieren noch bestimmte Einstellungen
vorzunehmen, die von Format zu Format unterschiedlich sind (z.B. Verschl&#252;sselung, Qualit&#228;t und Farbtiefe).
</P><CENTER>
<img src="svps2.jpg"></CENTER></P><BR>

<h2><CENTER><FONT COLOR="BLUE">Weitere Features</FONT></h2></CENTER></P>
Super View unterst&#252;tzt in der vorliegenden Version auch Drucker, Scanner und
sogar die mitlerweile weit verbreiteten Digital Kameras mittels eigener
Treiber - ein sehr lobenswerter Ansatz, der die Modularit&#228;t nochmals
eindrucksvoll unterstreicht. Nat&#252;rlich ist auch eine ARexx Schnittstelle
vorhanden und f&#252;r selbige finden sich im Aminet schon einige Scripte, derren
Zahl in Zukunft sicherlich noch steigen wird, so da&#223; Super View noch
umfangreicher und umfassender wird. Und wer sich mit ARexx auskennt, kann
sich ja auch eigene Scripte basteln. Ach ja: Auf Wunsch kann sich Super View
auch als Commodity, AppIcon, AppMenu, AppWindow oder ARexx Port in das
System integrieren, was den Komfort deutlich erh&#246;ht. Erw&#228;hnenswert ist
ansonsten noch die umfassende Lokalisierung des Programms, die insgesamt
&#252;ber 10 Sprachen umfasst.</P> 


<CENTER><H2><FONT COLOR="RED">M&#228;ngel = Fehlanzeige?</FONT></CENTER></H2></P>
Kleinigkeiten gibt`s nat&#252;rlich immer zu &#228;ndern und da macht die &quot;Super View
Productivity Suite II&quot; auch keine Ausnahme. Das f&#228;ngt bei absolut
unwichtigen Sachen wie dem Fehlen von ordentlichen New- und Glow Icons an
und h&#246;rt bei der fehlenden Einstellungsm&#246;glichkeit der Bildanzeiger auf
(hier empfehle ich jedem, alternativ das Tool &quot;CyberView&quot; auf die Platte zu
kopieren). Auch die Tatsache, da&#223; nur eine Grafik im Ziwschenspeicher
gehalten werden kann, ist als kleiner Negativpunkt zu nennen. Und last but
not least ist es ja mitlerweile g&#228;ngig geworden, Anleitungen zu den
Produkten, aus Kostengr&#252;nden, nur noch auf die CD zu kopieren. In diesem
Falle liegt leider nur eine Amiga Guide Datei bei; eine HTML Datei w&#228;re
sicherlich anschaulicher und auch bequemer zu lesen. Sei`s drum: Inhatlich
ist das AG Dokument nicht &#252;bel, aber auch nicht als umfassend zu bezeichnen.
Hier k&#246;nnte man sicherlich noch einiges verbessern (aber da das Tool ohnehin
recht einfach zu bedienen ist, kann man diesen Mangel auch fast schon wieder
vernachl&#228;ssigen).</P>


<h1><CENTER><FONT COLOR="WHITE">Fazit:</FONT></h1></CENTER></P>
Die &quot;Super View Productivity Suite&quot; ist ein Muss f&#252;r jeden Amiga User, der mit
Grafiken hantiert und diese konvertieren m&#246;chte; Super View kann man
sicherlich als Quasi Standard in diesem Bereich bezeichnen, der dar&#252;ber
hinaus noch viele weitere Features bietet. Auch die zus&#228;tzlichen Boni
(registrierte Datatypes, PPC Unterst&#252;tzung etc.) werten das Package noch weiter auf und machen
es zu einem Preis von 69 DM unschlagbar g&#252;nstig. Hier kann ich jedem nur
empfehlen: Zugreifen!</P><BR><CENTER>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Schatztruhe</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>69 DM (neu), 49 DM (Update)</TD>
</TR>
<TR>
<TD>Art</TD>
<TD>Grafiktool zum Konvertieren & Bearbeiten</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>125</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>90 %</TD>
</TR>
</TABLE>

 
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
