<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>Festplatten</TITLE>
  </HEAD>

  <BODY text="#ffff00" bgcolor="#000050">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H2 align="center"><FONT color="#ff00ff"><B>Festplattenkiller Dauerbetrieb<BR>
          IDE vs. SCSI</B></FONT></H2>

          <P>Immer weiter dringen die preisg&uuml;nstigen IDE-Festplatten in
          M&auml;rkte vor, wo sie vor noch nicht allzulanger Zeit nichts zu suchen
          hatten. Moderne IDE-Platten bieten mittlerweile recht ordentliche Werte,
          was Zugriffszeiten und Datentransferraten betrifft. Zwar k&ouml;nnen selbst
          in der Geschwindigkeit die neuen IDE-Speicherriesen den aktuellen
          SCSI-Konkurrenten immer noch nicht das Wasser abgraben, aber nicht zuletzt
          spielt der Preis bei der Kaufentscheidung keine unwichtige Rolle und in
          vielen Einsatzgebieten kann man mit etwas weniger Performance gut
          auskommen. SCSI-Festplatten k&ouml;nnen bis zu viermal teurer sein, als
          IDE-Ger&auml;te. Zudem m&uuml;ssen immer noch bei den meisten Computern
          SCSI-Hostadapter extra hinzugekauft werden, was bei vern&uuml;nftiger
          Qualit&auml;t mit weiteren hohen Kosten zubuche schl&auml;gt.</P>

          <P><IMG src="hard_hdd4.jpg" width="262" height="217" alt= "" align="left"
          hspace="6"> Somit finden die preisg&uuml;nstigen IDE-Festplatten auch immer
          h&auml;ufiger in Servern Verwendung, auf denen zum gr&ouml;&szlig;ten Teil
          &auml;u&szlig;erst empfindliche Daten lagern. Nicht zuletzt bei
          Webspaceanbietern fragt man sich oft, wodurch so hohe Preisunterschiede bei
          der privaten oder gesch&auml;ftlichen Webpr&auml;senz zustande kommen. Hier
          wird meistens enorm am Personal, aber auch an zuverl&auml;ssiger Technik
          gespart. Systemausf&auml;lle und das Wegfallen der gehosteten
          Internetauftritte fallen immer wieder vor allem bei den gro&szlig;en
          namhaften Billiganbietern auf.</P>

          <P>Sind die g&uuml;nstigen IDE-Alternativen denn nun wirklich so
          empfehlenswert? Selbstverst&auml;ndlich l&auml;sst sich auch eine
          Festplatte in der Zuverl&auml;ssigkeit messen und diese Daten k&ouml;nnen
          benannt werden. Der Fachmann spricht hier von dem Wert MTBF. Dieser Begriff
          steht f&uuml;r "Mean Time Between Failures". Die mittlere Zeitspanne
          zwischen Fehlern. MTBF dient f&uuml;r die Kennzeichnung der
          Zuverl&auml;ssigkeit eines Ger&auml;ts und ist als Durchschnittswert
          anzusehen.</P>

          <P>Nur weil die SCSI-Festplatten eine MTBF mit einer Millionen Stunden
          h&ouml;here Zuverl&auml;ssigkeit versprichen als die f&uuml;nfhundert
          Tausend einer IDE-Festplatte, zur SCSI zu greifen und deutlich mehr Geld
          auszugeben? Dann verstreichen also statt umgerechnet &uuml;ber einhundert
          Jahre nur gut &uuml;ber f&uuml;nfzig Jahre, bis die Festplatte einem Defekt
          erliegt? Mal ehrlich, wen w&uuml;rde das dann noch interessieren?</P>

          <P>Aber Vorsicht! - Festplattenhersteller geben in ihren Datenbl&auml;ttern
          und Werbebrosch&uuml;ren nicht an, wie die Berechnung dieser extrem hohen
          Zuverl&auml;ssigkeit zu Stande kommt. So wird nat&uuml;rlich gerne
          verschwiegen, dass IDE-Festplatten im Gegensatz zu den SCSI-Laufwerken
          nicht ausdr&uuml;cklich f&uuml;r den Dauerbetrieb konzipiert sind. Laufen
          sie dennoch rund um die Uhr, k&ouml;nnen die IDE-Drives deutlich schneller
          einem Defekt erliegen.</P>

          <P>Der fr&uuml;here Edel-Festplattenhersteller IBM erregte Aufsehen mit der
          Angabe, dass die empfohlene Laufzeit der IDE-Festplatte Deskstar 120GXP
          "nur" etwas &uuml;ber dreihundert Stunden pro Monat sein sollte. Immerhin
          hat ein Monat aber siebenhunderzweiunddrei&szlig;ig Stunden. So ganz
          freiwillig hat IBM diese Spezifikation wohl sicherlich jedoch nicht
          ver&ouml;ffentlicht. Das Vorg&auml;ngermodell, die Deskstar 75GXP, sorgte
          Anfang 2001 durch Ausf&auml;lle bei vielen Anwendern f&uuml;r &Auml;rger.
          IBM erlitt dadurch einen gewaltigen Imageverlust. Auch heute greifen viele
          ehemals &uuml;berzeugte IBM-Fans seltener zur IBM-Festplatte. Der &uuml;ble
          Nachgeschmack und nicht zuletzt der recht unkulante Support seitens IBM
          kostete den Globalplayer r&uuml;ckl&auml;ufige Absatzzahlen, die nun
          m&uuml;hsam zur&uuml;ck erk&auml;mpft werden m&uuml;ssen.</P>

          <TABLE width="100%" border="0" cellpadding="0" summary="">
            <TR>
              <TD align="center"><IMG src="hard_hdd1a.gif" width="107" height="107" alt=""></TD>
              <TD align="center"><IMG src="hard_hdd1b.gif" width="107" height="107" alt=""></TD>
              <TD align="center"><IMG src="hard_hdd1c.gif" width="107" height="107" alt=""></TD>
            </TR>

            <TR>
              <TD align="center"><FONT color="#ff00ff">IBM-SCSI</FONT> </TD>
              <TD align="center"><FONT color="#ff00ff">IBM1</FONT></TD>
              <TD align="center"><FONT color="#ff00ff">IBM2</FONT></TD>
            </TR>
          </TABLE>

          <P>Die 75GXP-Serie hatte mit gravierenden Fertigungsproblemen, sich
          zersetzenden Magnetschichten bis hin zum Hitzetod zu k&auml;mpfen. Je
          h&ouml;her die Laufzeit pro Tag war, desto schneller kam der
          endtg&uuml;ltige Datenverlust. Aber es sei klar erw&auml;hnt, nicht nur
          IBM-Festplatten sind niemals f&uuml;r den zuverl&auml;ssigen Dauerbetrieb
          ausgelegt gewesen.</P>

          <P>Es kam sogar zur Klage gegen IBM. In Kalifornien reichten Privatanwender
          eine Klage gegen IBM ein. In der Anklageschrift hei&szlig;t es, IBM preise
          die Deskstar 75GXP f&auml;lschlicherweise als zuverl&auml;ssiges Laufwerk
          an. Durch einen Designfehler oder durch Fertigungsm&auml;ngel f&uuml;hre
          die Festplatte aber unwiderruflich zum Verlust der Daten und Programme. Die
          Festplatten stellten nach einem lauten Klacken beziehungsweise kratzendem
          Ger&auml;usch den Betrieb g&auml;nzlich ein.</P>

          <P>IDE-Festplatten sind aber keineswegs f&uuml;r den Marathonbetrieb,
          sondern eher f&uuml;r Etappeneins&auml;tze ausgelegt, dokumentierte IBM mit
          der Vorstellung der Deskstar 120GXP. F&uuml;r Diskussionen sorgte eine
          kleine erstmals ver&ouml;ffentlichte Angabe im Datenblatt der Deskstar
          120GXP. Dort hei&szlig;t es neben "designed to protect user data" nun auch
          "recommended power-on hours (monthly) 333". Die neue Deskstar ist also
          explizit f&uuml;r einen Betrieb von 333 Stunden im Monat spezifiziert.
          Umgerechnet sind das 11 Stunden Laufzeit pro Tag - ein Wert, den
          beispielsweise Internetanwender mit Flatrate schnell &uuml;berschreiten.
          Prinzipiell ist IBM aber nur ehrlich. Der Hersteller legt mit der
          333h-Angabe erstmals offen, was der Rest der Plattenindustrie gerne
          verschweigt: IDE-Festplatten sind nicht f&uuml;r den Dauerbetrieb
          ausgelegt. Inzwischen hat IBM die Laufzeit-Spezifikation wieder aus den
          Datenbl&auml;ttern der Deskstar entfernt. Es stellt sich aber noch die
          Frage, ob die Festplatte durch das L&ouml;schen einer Zeile aus dem Da
          tenblatt ausfallsicherer ist.</P>

          <P>Aber nicht nur IBM empfiehlt f&uuml;r seine IDE-Festplatten eine
          bestimmte Nutzungsdauer pro Monat. Auch andere namhaften
          Festplattenspezialisten wie Seagate und Western Digital gehen bei ihren
          IDE-Laufwerken ebenfalls von keinem Dauerbetrieb aus. Angaben finden sich
          allerdings nicht in den Datenbl&auml;ttern der IDE-Laufwerke.</P>

          <TABLE width="100%" border="0" cellpadding="0" summary="">
            <TR>
              <TD align="center"><IMG src="hard_hdd5b.gif" width="107" height="107" alt=""></TD>
              <TD align="center"><IMG src="hard_hdd7.gif" width="107" height="107" alt=""></TD>
            </TR>

            <TR>
              <TD align="center"><FONT color="#ff00ff">Seagate</FONT></TD>
              <TD align="center"><FONT color="#ff00ff">Western Digital</FONT></TD>
            </TR>
          </TABLE>

          <P>Wie Western Digital &ouml;ffentlich angab, basieren die
          Zuverl&auml;ssigkeitsangaben ihrer IDE-Festplatten auf einer Laufzeit von
          sechzig Stunden pro Woche. Im Monat entspricht das nur zweihundertvierzig
          Stunden und somit noch weniger als bei IBM. Seagates IDE-Festplatten werden
          im typischen Betrieb sogar noch weniger genutzt. Zumindest nimmt der
          Hersteller dies bei der Auslegung seiner Festplatten an: Nur acht (!)
          Stunden pro Tag und das dann auch nur noch f&uuml;nf Mal in der Woche.
          Daraus resultiert eine durchschnittliche Laufzeit von
          einhundertdreiundsiebzig Stunden monatlich.</P>

          <P>Aber es scheint auch anders zu gehen. Der Hersteller Maxtor geht von
          voller Stundenzahl pro Monat Betrieb aus. Denn laut Thomas Astheimer,
          Manager Customer Engineering bei Maxtor, gibt es bei deren IDE- und
          SCSI-Festplatten keine qualitativen Unterschiede. Beide Laufwerksgattungen
          sind f&uuml;r den Dauerbetrieb ausgelegt. Ein Blick in die
          Datenbl&auml;tter von Maxtors IDE- und SCSI-Festplatten zeigt allerdings
          doch ein paar Unterschiede. W&auml;hrend das aktuelle SCSI-Modell "Atlas
          10K III" eine Ausfallrate von weniger, als 0,9 Prozent verspricht,
          m&uuml;ssen IDE-Laufwerke mit 1,0 Prozent auskommen.</P>

          <CENTER><IMG src="hard_hdd2.gif" width="480" height="393" alt=""></CENTER>

          <P>Wie ist die Zuverl&auml;ssigkeit der Laufwerke nun eigentlich definiert?
          Die "Lebenserwartung" einer Festplatte spezifiziert der MTBF-Wert. Die Mean
          Time Between Failure ist der Durchschnittswert f&uuml;r die Zeitspanne
          zwischen Ausf&auml;llen des entsprechenden Ger&auml;ts. Der MTBF-Wert hat
          sich industrieweit als anerkanntes Instrument f&uuml;r die
          Fehlerh&auml;ufigkeit etabliert und kommt nicht nur bei Festplatten zum
          Einsatz.</P>

          <P>Bei den SCSI-Festplatten liegt der MTBF-Wert wie schon erw&auml;hnt
          typischerweise bei einer Millionen Betriebsstunden. H&auml;lt das Laufwerk
          somit tats&auml;chlich &uuml;ber einhundert Jahre durch, bevor es auf dem
          Elektroschrott landet? Nein, denn die tats&auml;chliche Lebensdauer von
          Festplatten ist nur auf f&uuml;nf Jahre ausgelegt. Die MTBF ist lediglich
          ein Indiz f&uuml;r die Ausfallwahrscheinlichkeit des Laufwerks. Ein
          Beispiel: Tausend Festplatten mit einer MTBF von je einer Million Stunden
          sind ein Jahr lang im Betrieb. Dann ist auf Grund der MTBF davon
          auszugehen, dass achteinhalb Laufwerke einem Defekt erliegen. Die MTBF
          errechnet sich typischerweise aus der Anzahl von Samples multipliziert mit
          den Betriebsstunden geteilt durch die Ausf&auml;lle in dem Testzeitraum.
          Hat eine Festplatte nun eine MTBF von f&uuml;nfhundert Tausend Stunden, so
          gilt dieser Wert nur, wenn sie innerhalb der vom Hersteller vorgegebenen
          Bedingungen arbeitet. Denn die Zuverl&auml;ssigkeit einer Festplatte
          h&auml;ngt wesentlich von der Belastung und de r Umgebung ab. Hier spielen
          beispielsweise auch K&uuml;hlung der Festplatte und die Fragmentierung der
          Daten eine Rolle.</P>

          <P>Nahezu alle Festplattenhersteller sind sich dar&uuml;ber im klaren, dass
          teure SCSI-Festplatten &uuml;berall dort zum Einsatz kommen, wo sie
          tagt&auml;glich vierundzwanzig Stunden ihren Dienst zu verrichten haben.
          SCSI-Laufwerke sind auf Serverbetrieb ausgelegt. Sie sind daher nicht nur
          immer noch etwas schneller, sondern auch erheblich robuster im
          Dauerbetrieb.</P>

          <P>Generell bestimmen aber nicht nur die Betriebsdauer jeder Festplatte
          &uuml;ber deren Lebensdauer, sondern auch die Umst&auml;nde, in der sie
          arbeiten muss. Je mehr sich deren K&ouml;pfe bewegen, weil die Daten auf
          der Platte stark fragmentiert vorliegen und je h&auml;ufiger Schreib- und
          Lesezugriffe erfolgen, desto k&uuml;rzer lebt die Platte. Wird zudem nicht
          f&uuml;r ausreichende Luftzirkulation im Rechner gesorgt, kommt jede
          Festplatte dem Hitzetod ein St&uuml;ckchen n&auml;her. Das
          Datenrettungsunternehmen Ibas bekommt sehr oft defekte SCSI-Festplatten aus
          Servern zugesendet. Nicht, weil die Platten vielleicht unzuverl&auml;ssig
          sind, im Gegenteil, der Ausfallgrund ist &Uuml;berhitzung durch mangelnde
          K&uuml;hlung. Absolut t&ouml;dlich ist auch die Kondensation, wenn der
          Rechner beispielsweise aus kalter Umgebung in warm wohlm&ouml;glich noch
          feuchte R&auml;ume gebracht und nahezu sofort in Betrieb genommen wird.
          Hier sollte jedes Ger&auml;t mehrere Stunden Zeit zur Aklimatisierung
          bekommen, um sich der neuen Umgebungstemparatur anpassen zu k&ouml;nnen.
          Auch Spannungsversorgung, Schock und Vibration sind potenzielle
          Datenkiller.</P>

          <TABLE width="100%" border="0" cellpadding="0" summary="">
            <TR>
              <TD align="center"><IMG src="hard_hdd3.gif" width="107" height="107" alt=""></TD>
              <TD align="center"><IMG src="hard_hdd6.gif" width="107" height="107" alt=""></TD>
            </TR>

            <TR>
              <TD align="center"><FONT color="#ff00ff">Quantum</FONT></TD>
              <TD align="center"><FONT color="#ff00ff">Toshiba</FONT></TD>
            </TR>
          </TABLE>

          <P>Der preislich starke Unterschied der SCSI-Festplatten gegen&uuml;ber der
          IDE-Konkurrenz ist auch auf Grund hoher Drehzahlen von 10.000 und 15.000
          U/min zu erkl&auml;ren. Hier findet eine aufwendigere Mechanik Einsatz.
          IDE-Festplatten drehen dagegen mit "nur" 5400 und 7200 U/min. Die
          Magnetarmkonstruktionen sind bei SCSI wegen der deutlich k&uuml;rzeren
          Zugriffszeiten straffer ausgelegt. Zur Realisierung der schnellen
          Positionierung ist der Aktuator im Vergleich zu IDE-Ger&auml;ten mit mehr
          Windungen und st&auml;rkeren Magneten ausgestattet. Die hohen Drehzahlen
          fordern bei SCSI-Festplatten st&auml;rkere Motoren. Dieser Aufwand ist
          notw&auml;ndig, um den absoluten Dauerbetrieb bei solch hohen Anforderungen
          zu gew&auml;hrleisten. Im Servermarkt eine unzuverl&auml;ssige Festplatte
          anzubieten kann sich kein namhafter Hersteller leisten. Gewerbliche Daten
          bilden schon in vielen Unternehmen das gesammte Firmenkapital. W&uuml;rden
          solche Daten durch eine unzuverl&auml;ssige Serverfestplatte im Nirvana
          verschwinden, kann ein bis dahin gesundes Unternehmen ohne Backup an den
          Rand des Konkurses kommen. Daten sind auf dem Servermarkt daher sehr viel
          mehr wert, als die teuerste SCSI-Festplatte. Hier sich Sparma&szlig;nahmen
          bei der Hardware zu &uuml;berlegen und auf die billige IDE-Schiene zu
          setzen, von der nicht einmal der Hersteller selbst vom zuverl&auml;ssigen
          Dauerbetrieb ausgeht, kommt dem russischen Roulette schon sehr nahe.</P>

          <P><IMG src="hard_hdd5a.gif" width="204" height="165" alt="" align="left"
          hspace="6"> Das Problem mit den IDE-Festplatten ist keineswegs, dass sie
          unzuverl&auml;ssiger geworden sind. Im Gegenteil, die MTBF stieg in den
          vergangenen Jahren. Ein hoher Anteil der Laufwerke arbeitet aber einfach
          nicht mehr in der Umgebung oder unter den Bedingungen, wie es sich die
          Plattenhersteller urspr&uuml;nglich vorstellten: tags&uuml;ber an und
          nachts aus.</P>

          <P>Festplattenhersteller haben diese Problematik zum Teil schon erkannt und
          arbeiten bereits schon an speziellen Serverversionen von IDE-Festplatten.
          Fujitsu ist bereits einen Schritt weiter gegangen und hat im M&auml;rz
          diesen Jahres eine spezielle 24-7-Version der
          2,5-Zoll-IDE-Festplattenfamilie "MHR2xxxAT" vorgestellt. Die 24-7-Version
          ist f&uuml;r den Dauereinsatz konzipiert und soll prim&auml;r in
          Blade-Servern Einsatz finden. Auch IBM bietet von den Mobile-Festplatten
          Travelstar 40GH und 60GN Versionen f&uuml;r den Dauerbetrieb an.</P>

          <P>Aus aktueller Sicht gibt es bei absolutem Dauerbetrieb bei wichtigem
          Datenbestand keine Alternativen zum zuverl&auml;ssigen SCSI-System. Wer
          hier spart, handelt in dem Moment fahrl&auml;ssig, wenn er nicht wenigstens
          Eigent&uuml;mer solcher Daten ist, wie es beispielsweise bei den
          gro&szlig;en Serverparks unseri&ouml;ser Webspaceanbieter der Fall ist.
          F&uuml;r Privatanwender, die ihren Rechner tats&auml;chlich nicht &uuml;ber
          acht Stunden t&auml;glich eingeschaltet lassen, ist lediglich der Preis
          entscheident. Auf SCSI kann hier wohl mittlerweile verzichtet werden, da
          moderne IDE-Technologie enorm leistungsf&auml;hig geworden ist.</P>

          <P>Doch was tun, wenn die Festplatte doch defekt ist? Was viele Anwender
          gar nicht wissen - fast alle Hersteller geben auf ihre Festplatten mehrere
          Jahre Garantie. Bei SCSI-Laufwerken sind sogar sieben Jahre keine
          Seltenheit. Aber auch bei IDE-Laufwerken findet man oft eine
          Herstellergarantie von drei oder f&uuml;nf Jahren. Eine solche Festplatte
          kann man dann oft zum Hersteller direkt schicken und erh&auml;lt dann
          Ersatz. Schadenersatzanspr&uuml;che f&uuml;r den Datenverlust lassen sich
          in Deutschland jedoch eher unwahrscheinlich durchsetzen. Mancher Hersteller
          gibt auch keine mehrj&auml;hrige Garantie auf sogenannte "OEM"-hergestellte
          Festplatten. Hier ist die Garantiezeit auf die gesetzlich festgelegte Frist
          beschr&auml;nkt. OEM-Festplatten finden in der Regel in fertigen
          Komplettsystemen Verwendung. Die Garantiezeit der Festplatte passt sich
          dadurch der Garantiezeit des kompletten Rechnersystems an.</P>

          <P>Gebt Euren Daten ein sicheres zuhause und vergesst niemals, ein
          aktuelles Backup zu erstellen - dann seit Ihr immer auf der sicheren
          Seite.</P>

          <P>Euer Higgins Cord Hagen</P>

          <P>&Uuml;brigens - wenn Ihr eine g&uuml;nstige neue Festplatte f&uuml;r
          Euren Rechner sucht, vergesst nicht, Euch bei mir ein Angebot abzuholen.
          Mail an info@as-x.de - Wir beraten Euch auch gern und helfen bei der
          richtigen Auswahl. Wir bieten Euch ein komplettes Sortiment aus &uuml;ber
          25000 Artikeln.</P>            
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

