<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<HTML>
  <HEAD>
    <TITLE>Neuer Motorola Prozessor</TITLE>
  </HEAD>

  <BODY background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P><FONT size="-1">Bildschirm zu <A href= "hard_motorola.html"
          target="_top"><B>klein?</B></A> &nbsp; &nbsp; &nbsp; und wieder <A href=
          "javascript:history.back()"><B>r&uuml;ckg&auml;ngig?</B></A> &nbsp; &nbsp;
          &nbsp; oder zur&uuml;ck zur <A href= "index.html"
          target="_top"><B>NoCover?</B></A></FONT></P>

          <P align="center"><FONT color="#000080" size="7"><B>Neuer Motorola
          Prozessor in der Pipeline !</B></FONT></P>

          <P>Es kann gut sein das Ihr schon vom neuen Motorola-Prozessor geh&ouml;rt
          oder gelesen habt! Falls nicht, schreibe ich hier etwas &uuml;ber diesen
          echt geilen und leistungsstarken Prozessor auf. Alle Einzelheiten sind mir
          leider noch nicht bekannt, aber das Wichtigste, die Leistungsmerkmale, sind
          schon an die &Ouml;ffentlichkeit weitergegeben worden, wobei aber gesagt
          werden mu&szlig;: "Die Leistung kann sich noch &auml;ndern, dann aber nach
          oben!"</P>
        </TD>
      </TR>
    </TABLE>

    <TABLE border="0" cellpadding="0" cellspacing="0" summary="">
      <TR>
        <TD><IMG src="hard_motorola.png" width="640" height="480"
        alt="Prozessor"> </TD>
      </TR>
    </TABLE>

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P>Wie auf dem Bild nur unschwer zu erkennen ist, handelt es sich um den
          ersten RUNDEN Prozessor der Welt! Diese Bauform ist zwar auf dem ersten
          Blick etwas merkw&uuml;rdig und kommt einem bl&ouml;d vor, hat aber sehr
          viele Vorteile! Der Prozessor l&auml;&szlig;t sich sehr leicht austauschen
          und wenn die Prozessorh&uuml;lse angefasst wird, kann dem Prozessor nichts
          passieren, nicht durch elektrische Spannungen, die manchmal auftreten wenn
          man &uuml;ber einen Teppich geht und auch nicht durch Schmutz, da der
          Prozessor in der H&uuml;lse gesch&uuml;tzt ist. Die H&uuml;lse soll aus
          verschiedenen Metallen und Keramik bestehen, so das sie nicht
          leitf&auml;hig ist, aber stabil genug ist um vom Tisch zu fallen ohne
          kaputt zu gehen.</P>

          <P>Nun kommen wir zu den technischen Werten: Der Prozessor wird im 0,11
          Mikrometer-Prozess gefertigt, womit eine erhebliche Steigerung der Taktrate
          erzielt werden konnte, zur Zeit laufen Tests mit einem 1700Mhz getakteten
          Prozessor, der alle zur Zeit erh&auml;ltlichen Prozessoren, ob von Intel
          oder AMD, um l&auml;ngen schl&auml;gt! Da sogleich auch die
          Leiterbahnabst&auml;nde verkleinert wurden, ist der Stromverbrauch gesunken
          und der Prozessor wird nicht so warm wie seine Vorg&auml;nger. Und das ist
          sehr gut um ihn in Laptops zu bauen, die Spannung liegt gerade einmal bei
          1,5 Volt.</P>

          <P>Die L2-Cache-Gr&ouml;&szlig;e betr&auml;gt 256kb, die Busbreite liegt
          bei 64bit. Der L1-Befehlscache betr&auml;gt 64kb und auch der L1-Datencache
          hat 64kb. 37 Millionen Transistoren sind auf dem Testexemplar, ob sich das
          noch &auml;ndert bis der Prozessor n&auml;chstes Jahr erscheint, ist nicht
          sicher. Au&szlig;erdem besitzt der Prozessor noch eine 3D-Einheit, wie sie
          schon bei anderen Prozessoren &uuml;blich ist.</P>

          <P>Welcher Steckplatz jetzt benutzt wird, wei&szlig; ich nicht, es kann
          sein das man ein neues Motherboard braucht wenn der neue Proz. zum Einsatz
          kommen soll. Ein neues Motherboard w&auml;re auch das beste, da nur so die
          ganze Leistung ausgenutzt werden kann. Auch soll dann, im Falle eines neuen
          Motherboards, nurnoch 100, 133 und 166Mhz DDR-RAM unterst&uuml;tzt werden,
          ob alle drei Speichertypen oder nur einer davon, steht ebenso in den
          Sternen. Der Preis steht nat&uuml;rlich auch nicht fest, und ob der
          Erscheinungstermin (06.2003) eingehalten werden kann, glaube ich auch
          nicht!</P>

          <P>Ob und wie solch ein Prozessor in dem Amiga verwendet werden kann, liegt
          jetzt ganz allein in den H&auml;nden der wenigen Hardwareentwickler die es
          noch f&uuml;r den Amigamarkt gibt. Sch&ouml;n w&auml;re es schon, so eine
          Power zu haben, aber das alles liegt noch in weiter Ferne! Die beste
          M&ouml;glichkeit w&auml;re, den Prozessor auf eine PCI-Karte zu machen, um
          mit den alten Amigas zumindest ann&auml;hernd die Leistung nutzen zu
          k&ouml;nnen.</P>

          <P>Macht es mal gut, wenn es Neuigkeiten von dem Proz. gibt, werde ich mich
          wieder melden, zumindest werde ich beim n&auml;chsten mal noch etwas dazu
          schreiben:-)</P>

          <P>Poldi</P>

          <P><FONT size="-1">Kein linker Frame? Dann klicke <A href=
          "javascript:history.back()"><B>hier</B></A></FONT></P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

