<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>Interview Nr 4</TITLE>
  </HEAD>

  <BODY background="ncb_bg2.jpg" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="Interview">
      <TR>
        <TD>
          <CENTER>
            <P><FONT color="#000080" size="7"><B>Amiga Arena Interview</B></FONT></P>

            <TABLE width="60%" cellpadding="0" cellspacing="0"
            summary="">
              <TR>
                <TD valign="top">Entwickler:</TD>
                <TD><B>Steffen Nitz</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Software:</TD>
                <TD>SN-M&uuml;nzArchiv</TD>
              </TR>

              <TR>
                <TD valign="top">Homepage:</TD>
                <TD>---</TD>
              </TR>

              <TR>
                <TD valign="top">Email:</TD>
                <TD>Steffen.Nitz@t-online.de</TD>
              </TR>
            </TABLE>
          </CENTER>

          <P><FONT color="#000080"><B>Hallo Steffen,kannst Du bitte einwenig
          &uuml;ber Dich und Deinem Amiga Werdegang erz&auml;hlen?</B></FONT><BR>

          Ich kam ca. 1994 zum Amiga, mit einen 1200-HD Magic-Paket und einer
          Blizzard 1230/50Mz und 6 MB Ram. Mein Bruder besa&szlig; damals einen A500 mit
          8MB Ram und einer 210MB Festplatte. mit dem ich mein meinen ersten
          Amiga-Programmier-Versuch in AmigaBasic startete und dann zu BlitzBasic2
          &uuml;berwechselte kurz bevor ich mir den A1200 holte. Davor besa&szlig; ich
          aber noch einen C64 womit ich kleine Programm in Basic2 und Simpson-Basic
          schrieb, die aber nicht ans Tageslicht kamen.</P>

          <P><FONT color="#000080"><B>Zur Zeit entwickelst Du das Programm
          "SN-M&uuml;nz-Archiv" wobei handelt es sich hier?</B></FONT><BR>

          Es handelt sich um eine umfangreiche M&uuml;nzen-Verwaltung die f&uuml;r
          alle g&auml;ngigen M&uuml;nzen gedacht ist.</P>

          <P><FONT color="#000080"><B>Was hat Dich auf die Idee gebracht,solch ein
          Au&szlig;ergew&ouml;hnlichen Programm zu entwickeln?</B></FONT><BR>

          Ich hatte am 20.05.02 eine komischen Traum, und zwar dass ich einer
          Freundin meine sehr umfangreiche M&uuml;nzen-Sammlung zeigte.:-) Was mich
          auf die Idee brachte M&uuml;nzen zu sammeln und da ich auf den Amiga keine
          mir ausreichende M&ouml;glichkeit fand die M&uuml;nzen zu verwalten kam ich
          auf die Idee einen M&uuml;nzen-Verwaltung zu schreiben.</P>

          <P><FONT color="#000080"><B>Worin siehst Du die Vorteile zu Deiner
          Datenbank im vergleich zu anderen Datenbanken?</B></FONT><BR>

          Ich kenne leider keine derartige Datenbank f&uuml;r den Amiga. Hatte es
          zuerst mit TurboCalc versucht die M&uuml;nzen zu verwalten aber "leider"
          war das nicht das richtige.</P>

          <P><FONT color="#000080"><B>Siehst Du oder gibt es &Uuml;berhaupt noch eine
          Nachfrage an Spezielle Datenbanken f&uuml;r den Amiga?</B></FONT><BR>

          Bis jetzt wurde kaum Interesse gezeigt, was sich aber damit &auml;ndern
          kann wenn die Datenbank auf der Aminet und anderen Cd's erscheint. (Nach
          meinen Erfahrungen)</P>

          <P><FONT color="#000080"><B>Kannst Du uns jetzt schon was &uuml;ber weitere
          geplante Features, Programmversion etc. erz&auml;hlen?</B></FONT><BR>

          Ich habe jetzt alles drin was ich brauche und keine Ideen mehr, daher
          warte ich auf eure Vorschl&auml;ge. In der jetzigen Version ist ein
          St&uuml;cklisten-Fenster hinzugekommen. War es in der
          Vorg&auml;nger-Version nur m&ouml;glich eine Qualit&auml;tsangabe pro
          Eintrag anzugeben, ist es jetzt m&ouml;glich f&uuml;r jeden
          Qualit&auml;tsgrad die Anzahl Kaufpreis und Sammelwert anzugeben.</P>

          <P><FONT color="#000080"><B>"SN-M&uuml;nz-Archiv" ist "Shareware" glaubst
          Du das die User noch bereit sind heute f&uuml;r Datenbanken oder allgemein
          eine Shareware Geb&uuml;hr f&uuml;r Amiga Programme zu
          bezahlen?</B></FONT><BR>

          Ich glaube schon, aber wenn es innerhalb eines Jahres keine
          Registrierungen gibt dann werde ich ein Keyfile freigeben.</P>

          <P><FONT color="#000080"><B>Aus welchen Grund hast Du Dich dazu
          entschlossen es als "Shareware" zu vertreiben?</B></FONT><BR>

          Ich m&ouml;chte meine M&uuml;nzen-Sammlung damit aufstocken :-)</P>

          <P><FONT color="#000080"><B>Hast Du keine bedenken das sich schneller ein
          "Fake Keyfile" in Umlauf befindet und Du die Lust an der weiter Entwicklung
          verlierst oder spielt das keine Rolle f&uuml;r Dich?</B></FONT><BR>

          Das spielt eigentlich keine Rolle da ich das Programm fast aus puren
          Eigennutz geschrieben habe.</P>

          <P><FONT color="#000080"><B>Welche Software verwendest Du zum
          Entwickeln?</B></FONT><BR>

          Im moment AmiBlitz2, StormC4 und GoldED6</P>

          <P><FONT color="#000080"><B>Welches Betriebssystem wirst Du zuk&uuml;nftig
          unterst&uuml;tzen?</B></FONT><BR>

          Ich m&ouml;chte nach M&ouml;glichkeit ganz auf C umsteigen und damit
          alle Versionen ab OS3.5 unterst&uuml;tzen.Nur leider blicke ich nicht bei
          ReAction durch,weshalb das noch nicht geschehen ist dies zu
          unterst&uuml;tzen.Ich hoffe deshalb auf eure Hilfe in Sachen StormC4 GCC
          und ReAction.Ich m&ouml;chte als erstes SN-M&uuml;nzArchiv in ReAction
          sehen.</P>

          <P><FONT color="#000080"><B>Was sind die Gr&uuml;nde um dieses OS zu
          unterst&uuml;zen?</B></FONT><BR>

          Ich denke man sollte auf den aktuellen Stand bleiben.</P>

          <P><FONT color="#000080"><B>Glaubst Du an ein Comeback von
          Amiga?</B></FONT><BR>

          Ein wenig.</P>

          <P><FONT color="#000080"><B>Deine letzten Worte an die
          Leser?</B></FONT><BR>

          Raubkopierer sollte man auf die Finger hauen. Raubkopierei ist mit ein
          Grund, warum es um den Amiga so schlecht steht!!</P>

          <P align=center>-- &copy; Amiga Arena 05/2002 --</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

