<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Metal Corner by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%>
<p><b>Hi!</B><br>
<p><b>Hi Poldi!</B></P>
<p>Erstmal ganz herzlichen Dank f&#252;r die vielen tollen Beitr&#228;ge, die in dieser Ausgabe zu finden sind. Ohne dich und einige andere sehr aktive Schreiberlinge w&#252;rde diese Jubil&#228;umsausgabe leider sehr d&#252;nn ausfallen. Na ja, da ich momentan mal wieder ein wenig Zeit zur Verf&#252;gung habe, wollte ich es mir auch nicht nehmen lassen, mal wieder einige Worte an dich zu richten und auf Deinen Leserbrief in der aktuellen Ausgabe eingehen:</P>

<p><FONT COLOR="#87CEFA"><i>Du scheinst langsam aber sicher die Faxen dicke zu haben, so wie ich Deine letzten Vorworte entziffere. Wenn dem wirklich so sein sollte, kann ich Dich sehr gut verstehen! Da hast Du das ganze Magazin umgekrempelt und daf&#252;r gesorgt, dass es Freeware wird, aber es verbessert sich immer noch nichts. Selbst wenn die NC nur noch zweimonatlich erscheinen sollte, wird sich mit Sicherheit nicht viel &#228;ndern, dann wird jeder nur l&#228;nger warten bis er/sie anf&#228;ngt etwas zu schreiben. Unsereins ist auch schon immer drauf und dran die Texte unn&#246;tig in die L&#228;nge zu ziehen, um wenigstens etwas beitragen zu k&#246;nnen, aber so geht es auch nicht lange:-) Sag das aber keinem weiter;-)))</i></font></P>

<p>Tja, so sieht es leider im Moment aus. Was den zweimonatigen Rhytmus angeht: Ich bin auch kein Fan dieser L&#246;sung, aber sollte es nicht mehr anders gehen, werde ich diese L&#246;sung nehmen m&#252;ssen. Zumal viele User den Aufwand stark untersch&#228;tzen, den man Monat f&#252;r Monat mit der NoCover hat. Wenn das jetzt ein 38 1/2 Stunden Job w&#228;re, k&#246;nnte ich sicherlich mehr daraus machen - gar keine Frage. Aber es scheint einige Intelligenzbacken zu geben, die schlicht und einfach vergessen, dass die NC ein zeitaufwendiges Hobby ist, f&#252;r das ein Teil meiner Freizeit drauf geht. Und da ich noch einige andere Aktivit&#228;ten habe, kann ich einfach nicht mehr die Zeit aufbringen und Artikel schreiben, wie ich es fr&#252;her beispielsweise getan habe - hier bin ich auf andere User angewiesen und hoffe, dass es wieder aufw&#228;rts geht. Ach, wenn doch nur alle ehemaligen Leute der Fireball hier schreiben w&#252;rden :-)))</P>

<p><FONT COLOR="#87CEFA"><i>Dasselbe gab es sehr oft bei den Magazinen im Handel. Einige gingen in die L&#228;den, lasen die Zeitschriften dort und gingen nach Hause ohne die Zeitschriften zu kaufen, als es die Zeitschriften dann nicht mehr gab, waren sie am meckern!</i></font></P>

<p>Tja, so sind die Uer halt. Schau einfach mal in die Kommentare bei Amiga-News.de und du wirst merken, was von der einstigen User Gemeinschaft zu halten ist. Das traurige ist nur, dass diese paar Pappnasen die ganze Community mit ihrem Gemeckere kaputt machen. Mich z.B. regt diese unsachliche Kritik teilweise richtig auf, insbesondere dann wenn man wei&#223;, was wirklich hinter manchen Meldungen steckt. Alleine dieser ganze MorphOS vs. AmigaOS Streit ist ein schlechter Witz....</P>

<p><FONT COLOR="#87CEFA"><i>Mir selbst geht es ja nicht anders (was die Schreiberei betrifft), bis mir einf&#228;llt wor&#252;ber ich &#252;berhaupt noch schreiben kann, ist Ostern und Weihnachten auf einen Tag gefallen!</i></font></P>

<p>Einfach die Aminet Uploads anschauen und Berichte daraus machen :-))) Im Ernst: Da sind so viele Tools, die einen Trestbericht wert w&#228;ren - als Beispiele der j&#252;ngeren Vergangenheit fallen mir spontan Meridian, SM M&#252;nz Archiv, Depth Men&#252; oder Char Map ein. Aber auch die Amiga Arena Vollversionen sind Testberichte wert. Leserbriefe an User oder einfaches Feedback ist nat&#252;rlich auch toll :-))

<p><FONT COLOR="#87CEFA"><i>Jetzt habe ich Dich aber genug bel&#228;stigt, nur eins noch: Wann soll immer der Einsendeschlu&#223; sein? Aber denke daran, dass ich immer nur die reinen ASCII-Texte zu Dir schicke, demnach muss ich die Texte wohl immer etwas fr&#252;her schicken?</i></font></P>

<p>Vorweg: Bel&#228;stigt hat mich noch nie jemand - auch Du nicht. Es reicht, wenn du mir die Texte jeweils so um den 20. zukommen l&#228;sst. Etwas sp&#228;ter ist auch nicht schlimm, aber der 25. sollte am besten nicht &#252;berschritten werden, denn sonst sehe ich wieder schwarz f&#252;r die Beteiligung!</P>

<p>So, bis n&#228;chsten Monat Poldi. See ya,</P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
