<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>Poldis Leserbrief Nr.3</TITLE>
  </HEAD>

  <BODY background="ncb_bg3.gif" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H2><B>Hallo Wolfgang,</B></H2>

          <P>in der NoCover 98 hast Du geschrieben, dass Du Dich &uuml;berzeugen
          lassen w&uuml;rdest, Dich f&uuml;r einen PPC zu entscheiden, wenn es
          jemandem gelingt! Nun m&ouml;chte ich versuchen Dir den PPC etwas
          schmackhaft zu machen.</P>

          <P>Womit fange ich mal an? Ach so, am besten mit dem Anfang! Da ich nur von
          meinen Interessen ausgehen kann, werde ich Dir einige M&ouml;glichkeiten,
          die ich gern nutze, etwas auff&uuml;hren! Nur muss ich Dir schreiben, dass
          es mit einer PPC-Karte allein nicht getan ist, in den meisten F&auml;llen
          wird auch eine Grafikkarte gefordert, was nat&uuml;rlich wieder ins Geld
          geht.</P>

          <P>Eigentlich w&auml;re es sogar besser, wenn ich Dir gleich ein PCI-Board
          ans Herz lege. Egal welches PCI-Board Du Dir kaufen w&uuml;rdest, eine
          PC-Grafikkarte w&uuml;rde Dich nicht soviel kosten wie eine
          PPC-Grafikkarte. Au&szlig;erdem kannst Du dann eine Soundkarte f&uuml;r 25
          - 40 Euro einbauen und h&auml;ttest noch mehr M&ouml;glichkeiten! Da Elbox
          und DCE (jeder f&uuml;r sich) eine PPC-Karte f&uuml;r den PCI-Steckplatz in
          Arbeit haben, k&ouml;nntest Du Dich dann f&uuml;r solch eine Karte
          entscheiden und h&auml;ttest somit einen der schnellsten Amigas der Welt...
          Das AmigaOS 4.0 wird zur Zeit f&uuml;r die PPC-Prozessoren umgesetzt und
          das wird den Amiga in Geschwindigkeitsregionen bringen, wo noch keiner von
          getr&auml;umt hat, wenn dann die neuen PPC-Karten da sind, kann kein PC
          oder Mac dem Amiga das Wasser reichen, da das AmigaOS schon immer schnell
          war.</P>

          <P>Hyperion hatte sogar schon die PPC-Karte von Elbox in der Hand und
          deshalb glaube ich am meisten an diese Karte, au&szlig;erdem schrieb
          Hyperion, dass die PCI-Boards von DCE zu langsam w&auml;ren und sie
          (Hyperion) &Auml;rger mit diesen Boards, bei der Umsetzung vom AmigaOS,
          haben! F&uuml;r was Du Dich entscheidest ist eigentlich egal, nur mit einem
          reinen 68XXXer System wirst Du nicht mehr lange Deine Freude haben, da fast
          alle Spiele die in letzter Zeit erschienen sind und die die noch erscheinen
          werden, einen PPC verlangen.</P>

          <P>Das was mir in letzter Zeit immer mehr Spa&szlig; macht, ist Mpg., Filme
          ansehen und Musik h&ouml;ren. Mit AHIRecord nehme ich die Lieder von CD auf
          und mit Pegasse wandel ich diese CDDA-Dateien in Mpg. um, das wandeln in
          Mpg. dauert nur so lange wie ein Lied dauert. Mit einem 030er Proz.
          brauchte das wandeln "NUR" ungef. 90 Min. Wenn das keine Verbesserung
          darstellt?!</P>

          <P>Die Mpg.-Filme kann ich mit AMP2 in Fullscreen ansehen und der Sound ist
          dabei auf AHI=SB128:16bit Stereo++ 44100Hz gestellt, dabei bleibt alles
          fl&uuml;ssig, auch wenn ich den Film in einem Fenster ansehe,
          nat&uuml;rlich kommt es hin und wieder zu Rucklern, warscheinlich immer
          dann wenn die Qualit&auml;t der Filme zu hoch ist. Aber dann stellt man
          einfach die Audioqualit&auml;t oder etwas anderes nach unten und schon ist
          das Ruckeln weg.</P>

          <P>Die Musikindustrie kann mich mal im Mondschein besuchen, mit dem
          Kopierschutz schneiden sie sich nur ins eigene Fleisch. Aber dank der
          Soundkarte ist es leicht diese gesch&uuml;tzten CD&acute;s auszulesen,
          einfach die Anlage an die Soundkarte anschlie&szlig;en und schon ist diese
          Kacke umgangen!:-) Au&szlig;er die Anlage schafft es nicht die CD&acute;s
          zu lesen, so wie die iBooks von Apple, macht man eine CD mit Kopierschutz
          in das iBook (Slot-in-CD-ROM) und versucht die CD abzuspielen, st&uuml;rzt
          das iBook ab und bootet nicht mehr, die CD kommt auch nicht mehr raus. Dann
          kann man das iBook nurnoch zur Reperatur bringen! Echt geil von der
          Musikindustrie:-)</P>

          <P>Eben hatte ich Besuch von einem "Heini" den ich schon lange kenne, der
          geht auch immer ins Internetcafe und schaut sich dort Mangafilme an, diese
          Filme findet er mei&szlig;t in Mpg.. Nur zur Information: Die PC&acute;s im
          Internetcafe haben einen 500Mhz-Intel-Schrott-Proz. und eine
          16MB-Grafikkarte!</P>

          <P>Um die Filme sehen zu k&ouml;nnen, muss er das Filmfenster ganz klein
          machen und da ruckeln sie immer noch. Also zeigte ich ihm einen Mangafilm
          auf dem Amiga, in "Fullscreen", mit super Sound und ohne Ruckeln, er
          wunderte sich dass das geht, erst wollte er nicht glauben, dass mein PPC
          nur 175Mhz. hat, aber er lie&szlig; sich &uuml;berzeugen! Dass es im
          Internetcafe ruckelt, kann nat&uuml;rlich an der Verbindung ins Internet
          liegen, aber dort haben sie DSL, was eigentlich daf&uuml;r ausreichende
          Geschwindigkeit bieten sollte!!!</P>

          <P>Auch macht es viel mehr Spa&szlig; Grafiken zu bearbeiten, die meisten
          der aktuellen Grafikverarbeitungsprogramme haben sowieso
          PPC-Unterst&uuml;tzung, wenn alle Datatypes ausgetauscht sind und alles
          richtig installiert wurde, wirst Du Deinen Amiga nicht wieder erkennen!
          Alles was Du schon immer mal ausprobieren wolltest, es aber nicht machtest
          weil Dein Amiga zu langsam ist, kannst Du mit einem PPC ruhig mal testen,
          Du wirst Dich wundern was f&uuml;r ein Spa&szlig; es machen kann mit den
          "langsamen" Programmen zu arbeiten, ohne dauernd (vor langer Weile) Kaffee
          zu trinken und auf ewige Ladezeiten zu warten!!!</P>

          <P>Zu guter letzt kommt noch das von Dir schon angesprochene Thema: SPIELE
          Bis jetzt habe ich Heretic-II sehr oft gespielt, zwar ruckelt es auch hin
          und wieder, aber wen juckt das schon? Von Shogo spiele ich gerade dauernd
          das Demo, leider geht bei diesem Demo der Ton nicht, aber das ist drotzdem
          ein super-duper-geiles-Spiel. Demn&auml;chst soll noch das Spiel "Die
          V&ouml;lker" kommen und das wird wieder ein absoluter Hammer. In absehbarer
          Zeit werden die Spielehersteller nurnoch den PPC unterst&uuml;tzen, da eine
          Konvertierung von PC-Spielen nicht anders zu bewerkstelligen ist,
          au&szlig;erdem ist eine Konvertierung nicht so zeitaufwendig wie eine
          Eigenentwicklung! Die meisten Spiele unterst&uuml;tzen mitlerweile auch die
          Grafikkarten, wobei Du wieder sehen kannst, dass ohne Grafikkarte und PPC
          bald nichts mehr geht. Zwar macht es viel Spa&szlig;, alte Spiele spielen
          zu k&ouml;nnen, aber irgendwann wird einem sogar das zu langweilig. Der
          schon oben beschriebene "Heini" war sehr begeistert von Shogo und
          Foundation, mit richtig alten Spielen w&uuml;rde der sich nicht abgeben.
          Daran erkennt man schon einigerma&szlig;en wie und womit man neue Amiganer
          gewinnen kann!</P>

          <P>Wenn ich den PC-lern immer zuh&ouml;re wie sie mit ihren Kisten angeben,
          geht mir bald der nicht vorhandene Hut hoch. Manchmal schaffe ich es auch
          diese Leute zu mir einzuladen um ihnen meinen Amiga zu zeigen, seit diesem
          Jahr waren schon einige bei mir, die sich vorher immer weigerten sich den
          Amiga anzusehen (Angst vor einer Sache die sie immer als schlecht
          bezeichnen). Einer sagte zu mir: "Das ist ja ein richtiger Rechner!" Da
          sagte ich: "Ein Taschenrechner ist auch ein richtiger Rechner!" Er meinte
          eigentlich, dass er sich nicht vorstellen konnte einen Amiga im Tower
          vorzufinden. Hier w&auml;re noch viel Aufkl&auml;rung n&ouml;tig! Wenn Du
          mal einen PPC und eine Grafikkarte haben solltest, solltest Du auch einmal
          die PC-ler einladen um ihnen zu zeigen das der Amiga fast die selben
          M&ouml;glichkeiten bietet wie der PC, nur dass unser OS viel besser und
          leichter zu erlernen ist!</P>

          <P>Du siehst, es lohnt sich in jedem Fall, den Amiga aufzur&uuml;sten, ob
          nun mit einer aktuellen PPC-Karte oder gleich einem PCI-Board mit
          Grafikkarte und eine von den angek&uuml;ndigten PPC-Karten. Zu letzterem
          w&uuml;rde ich Dir raten, da Du dann einen Amiga hast, der kompatibel zu
          den neuen Amigas ist! Einen Tip noch, wenn Du Dich f&uuml;r ein PCI-Board
          entscheiden m&ouml;chtest, solltest Du so lange warten, bis Du mit
          Sicherheit wei&szlig;t welche Firma wirklich eine PPC-Karte auf den Markt
          bringt.</P>

          <P>Nun bin ich fertig mit der Schreiberei und hoffe, dass ich Dir ein wenig
          bei der Entscheidung helfen konnte. Wenn Du wirklich Geld &uuml;brig haben
          solltest, bitte ich Dich, Deinen Amiga aufzur&uuml;sten, nicht nur dass Du
          dann viel mehr Leistung hast, auch unterst&uuml;tzt Du damit den Amigamarkt
          und das hilft uns allen!</P>

          <P>Mach es gut, mfG: Poldi</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

