<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>Poldis Leserbrief Nr.1</TITLE>
  </HEAD>

  <BODY background="ncb_bg3.gif" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><B>Hallodrio Ihr Amiganer,</B></H1>

          <H3 align="center"><B>die 2 Monate sind rum und ich melde mich wieder:-)</B></H3>

          <CENTER>
            <TABLE summary="" border="0" cellspacing="3" cellpadding="3">
              <TR>
                <TD>Jubel, Trubel, Heiterkeit, seid zur Heiterkeit bereit,</TD>
              </TR>

              <TR>
                <TD>die NoCover ist 100 Ausgaben alt und das in dieser Zeit.</TD>
              </TR>

              <TR>
                <TD>Aufw&auml;rts und abw&auml;rts ging es immer wieder mit der NC,</TD>
              </TR>

              <TR>
                <TD>aber der Zusammenhalt ist fast wie eh und je...</TD>
              </TR>

              <TR>
                <TD>Jetzt fehlen nur mehr Texte in jeder Ausgabe,</TD>
              </TR>

              <TR>
                <TD>sonst zwingt Ihr den Kilian zur Aufgabe.</TD>
              </TR>

              <TR>
                <TD>Also ran an den Feind und Texte geschrieben,</TD>
              </TR>

              <TR>
                <TD>am besten bis morgens um Sieben :-)</TD>
              </TR>

              <TR>
                <TD>&nbsp;</TD>
              </TR>

              <TR>
                <TD>(Naja, einen Versuch war es Wert:-))</TD>
              </TR>
            </TABLE>
            <A name="top"></A>
          </CENTER>
          <HR size="4">

          <TABLE border="0" width="100%" summary="">
            <TR>
              <TD>
                <UL type="square">
                  <LI><A href="#a1"><B>An Murmel</B></A></LI>
                  <LI><A href="#a2"><B>An Rolf Nue</B></A></LI> 
                  <LI><A href="#a3"><B>An Andreas</B></A></LI>
                </UL>
              </TD>

              <TD>
                <UL type="square">
                  <LI><A href="#a4"><B>Fragen</B></A></LI>
                  <LI><A href="#a5"><B>Top 6 der NC 98</B></A></LI>
                  <LI><A href="#a6"><B>Top 6 der NC 99</B></A></LI>
                </UL>
              </TD>

              <TD valign="top">
                <UL type="square">
                  <LI><A href="#a7"><B>Spiele</B></A></LI>
                </UL>
              </TD>
            </TR>
          </TABLE>
          <HR size="4">

          <H3><A name="a1">Moin Murmel,</A></H3>

          <P>das mit Deinem Amiga tut mir nat&uuml;rlich leid, kann man den
          L&uuml;fter selbst austauschen oder musst Du die Karte daf&uuml;r zum
          reparieren wegschicken? Aber auch dieses Problem, soweit es eins f&uuml;r
          Dich ist, wirst Du schon geregelt bekommen:-) Den AmigaOne hast Du jetzt
          schon bestellt? Ganz sch&ouml;n fr&uuml;h, ich w&uuml;rde erst warten bis
          ich einige Tests gelesen habe, aber wenn das dann jeder so machen
          w&uuml;rde wie ich, dann k&auml;men nie Tests zustande:-)</P>

          <P>Dir kann ich niemals sauer sein, das wei&szlig;t Du doch?! Aber Gedanken
          mache ich mir immer, wenn Du Dich so lange nicht meldest, aber das schrieb
          ich Dir schon einmal. Es ist halt bl&ouml;d, wenn ich nicht wei&szlig;,
          warum Du Dich nicht meldest, dann glaube ich immer, dass es an mir liegt,
          weil Du Dich nicht meldest, aber Du hast mit Sicherheit mehr um die Ohren
          als ich!!!</P>

          <P>Kann es sein, dass Du mich eventuell falsch verstanden hast? Ich meinte
          mit dem Intel oder AMD nur den Prozessor. Ein normaler Amiga mit einem
          Intel-Proz. als Steckkarte, f&uuml;r PCI oder dem Expansionsport, darauf
          dann das AmigaOS und schon w&auml;re alles beim Alten, nur erheblich
          schneller! Das Umsetzten des OS f&uuml;r Intel oder AMD d&uuml;rfte auch
          nicht viel l&auml;nger dauern als f&uuml;r den PPC.</P>

          <P>Auch habe ich mit den PPC-Prozessoren die gemeint, die in Arbeit sind,
          falls es sie wirklich geben sollte, damit w&auml;ren die neuen und alten
          Amigas gleich schnell, zumindest in der Theorie. Die PPC&acute;s die es
          jetzt f&uuml;r den Amiga gibt sind zwar ganz gut, k&ouml;nnten aber besser
          unterst&uuml;tzt werden!</P>

          <P>Das AmigaOS-4.0 werde ich mir auf jeden Fall kaufen, da ja auch die
          BlizzardPPCKarten unterst&uuml;tzt werden, auch sollen die PCI-Boards
          unterst&uuml;tzt werden, was kann mich da noch davon abhalten das OS-4.0 zu
          kaufen? Der jetzt bekannte Preis st&ouml;rt mich nur, weil vorher ein
          anderer Preis genannt wurde, die h&auml;tten lieber den Preis erst nennen
          sollen als sie wussten wieviel das OS kosten soll! Da wir es schon gewohnt
          sind zu warten, ist der Erscheinungstermin wieder einmal verschoben worden,
          das OS sollte schlie&szlig;lich schon im Februar kommen!</P>

          <P>Da im Internet dauernd dar&uuml;ber gestritten wird welches OS das Beste
          ist, m&ouml;chte ich hier auch noch etwas dar&uuml;ber ablassen, aber
          f&uuml;hle Dich nicht angemacht, es ist eben nur meine Meinung!:</P>

          <P>Wenn es nach mir ginge, w&uuml;rde Amiga INC. die Leute von MorphOS vor
          Gericht schleppen und denen verbieten lassen Ihr OS unter die Leute zu
          bringen!!! Es hat keinen Sinn wenn es mehrere OS&acute; gibt und einige
          Softwarehersteller das AmigaOS unterst&uuml;tzen und andere wiederum das
          MorphOS, es sollte alles in eine Richtung gehen und alle Firmen nur
          f&uuml;r ein OS entwickeln. Ich habe lieber ein OS wo Amiga drauf steht und
          auch Amiga drin ist, MorphOS ist sowieso noch Beta und wer wei&szlig; ob
          die von MorphOS auch die Ausdauer haben &uuml;ber l&auml;ngere Zeit Updates
          und eine Hotline zur Verf&uuml;gung zu stellen. Das Pegasos-Team sollte
          lieber das AmigaOS lizensieren und damit w&auml;re alles in Ordnung.
          Hoffentlich wird das MorphOS niemals fertig, dann erledigt sich dieses
          leidige Thema ganz von allein!</P>

          <P>Das war es f&uuml;r heute, mach es gut: Poldi</P>

          <P>P.S.: Nat&uuml;rlich kannst Du Dich weiterhin Privat bei mir melden:-)))
          Du wei&szlig;t doch, dass ich gerne normale Post bekomme, besser als
          E-Mail, da ich die E-Mails immer l&ouml;sche und die Briefe auf Disketten
          oder Papier hebe ich immer auf.</P>

          <P>Gehe nach <A href="#top">oben</A></P> <HR size="4">

          <H3><A name="a2">Hallo Rolf,</A></H3>

          <P>Wie geht es Dir denn so? Hoffentlich ist alles noch in Ordnung und Du
          hast es geschafft die PC&acute;s miteinander zu verbinden!? Ich schreibe
          Dir nur um Dir noch einen Tipp zu PPaint zu geben. Kann es sein, dass Du
          immer den Screenpromoter startest bevor Du PPaint startest? Vor kurzem habe
          ich mal wieder mit PPaint experimentiert und herausgefunden, dass sich der
          Screenmode einstellen l&auml;&szlig;t, aber nicht &uuml;ber die Funktion
          wie man sie von anderen Progs. her kennt. Gehe auf Projekt/Format und
          stelle dort den Screenmode ein den Du haben m&ouml;chtest, dann gehst Du
          auf Voreinstellungen/Speichern und klickst dort auf den Button "Alle",
          danach auf "Weiter" und schon m&uuml;&szlig;te beim n&auml;chsten mal
          PPaint in den Grafikkartenmodus starten.</P>

          <P>Erst wusste ich nicht, dass man dort den Screenmode einstellen kann und
          daher denke ich, dass Du es vielleicht auch nicht wusstest:-) Zu Deiner
          Frage wegen einem Monitor: Normalerweise m&uuml;sste jeder Monitor, der 31
          Khz.H.Sync. anzeigen kann auch am AGA-Amiga laufen (mit
          MonitorAdapterstecker), ich las einmal, dass die PC-Monitore am AGA-Amiga
          dann nur bestimmte Screenmodes anzeigen k&ouml;nnen, nat&uuml;rlich nicht
          die Pal-Modi. An allen anderen Amigas und dem AGA-Amiga m&uuml;ssten diese
          Monitore mit einem Scandoubler laufen und alle Screenmodes anzeigen. Da Du
          eine Grafikkarte hast, m&uuml;ssten alle Monitore funktionieren. Ich hoffe,
          dass Du noch einige Antworten bekommen hast, dann brauchst Du nicht so viel
          zu testen und kannst gleich den richtigen Monitor kaufen.</P>

          <P>Mach es gut: Poldi</P>

          <P>Gehe nach <A href="#top">oben</A></P>
          <HR size="4">

          <H3><A name="a3">Guten Tag Andreas,</A></H3>

          <P>nach allen &Uuml;berlegungen und vielem hin und her,
          habe ich mich endschieden mir einen Scandoubler zu
          kaufen, nur wei&szlig; ich nicht wann es klappt. Erst
          muss ich mir n&auml;mlich noch das OS-4.0 kaufen und dann
          sehen wir weiter.</P>

          <P>Ob ich mir dann noch so einen Umschalter besorge oder
          den Monitor einfach nur umstecke, wei&szlig; ich noch
          nicht. Nur dass dann beim umstecken die Anschl&uuml;sse
          ausleiern, nervt mich etwas. Ich will einfach nur die
          alten Spiele spielen, die Anwendersoftware st&ouml;rt
          mich nicht, da gibt es genug die mit einer Grafikkarte
          laufen! Du spielst bestimmt auch viel, sonst
          k&ouml;nntest Du ja nicht so viel &uuml;ber Spiele
          schreiben. Es ist einfach sch&ouml;n in eine Spielewelt
          einzutauchen und alles um sich herum zu vergessen, besser
          als D&auml;umchen drehen:-)</P>

          <P>Ach, was kann ich Dir eigentlich noch schreiben?
          Eigentlich nichts mehr, aber ich hoffe doch, dass wir uns
          noch oft schreiben werden ?!</P>

          <P>Gute Zeit noch: Poldi</P>

          <P>Gehe nach <A href="#top">oben</A></P>
          <HR size="4">

          <H3><A name="a4">Fragen</A></H3>

          <P>Kann mir einer von Euch schreiben warum der Ton von
          Shogo nicht geht? Alles was ich einstellen konnte,
          testete ich schon aus, ob &uuml;ber AHI oder Default-
          Sound(DMA), es kommt einfach kein Ton raus. Die
          Sounddateien sind aber da, auch der Aufruf im Spiel ist
          richtig eingestellt, man kann das sehen, wenn im Spiel
          auf den Knopf `~ gedr&uuml;ckt wird. Hatte jemand das
          selbe Problem und konnte es l&ouml;sen? Oder ist dieser
          &Auml;rger in der Vollversion nicht vorhanden?</P>

          <P>Dauernd laufen mir Dateien mit der Endung .mov
          &uuml;ber den Weg, aber bis jetzt wei&szlig; ich nicht
          mit welchem Programm ich diese Filme ansehen kann.
          K&ouml;nnt Ihr mir ein Programm empfehlen, m&ouml;glichst
          ein PD-Prog., das diese Dateien schnell und sauber
          abspielt? Ein Prog. habe ich zwar, aber dieses behauptet
          immer, dass eine Datei mit der Endung .rsrc fehlt. Was
          soll das bedeuten?</P>

          <P>Dann noch die dritte und letzte Frage: Seit langem
          benutze ich Birdie und es ging immer astrein, nun aber
          habe ich mir Birdie-2000 und BirdiePrefs aus dem Internet
          geholt und wieder den Aufruf in die User-Startup
          geschrieben, genau so wie es in der Anleitung steht.
          Leider kommt immer nur die doofe Animation mit dem Vogel
          und sonst passiert nichts. Wenn ich aber BirdiePrefs
          aufrufe und auf benutzen klicke, geht alles. Wenn einer
          wei&szlig;, wie genau der Aufruf in der User-Startup
          lauten muss, w&auml;re ich sehr dankbar f&uuml;r einen
          Hinweis!</P>

          <P>Vielen Dank im Voraus an alle die helfen k&ouml;nnen:
          Poldi</P>

          <P>Gehe nach <A href="#top">oben</A></P>
          <HR size="4">

          <H3><A name="a5">Top 6 der NC 98</A></H3>

          <TABLE border="0" summary="">
            <TR>
              <TD valign="top">1.) &nbsp;</TD>
              <TD>Mitsumi-Brenner von Marc "Zito" Oberst (Von Hardware kann ich nicht
              genug bekommen:-)) Sehr gut zu verstehen, Du hast Dich mit Sicherheit viel
              mit der Hardware besch&auml;ftigt!</TD>
            </TR>

            <TR>
              <TD valign="top">2.) &nbsp;</TD>
              <TD>Spiele W/U von Andreas Guldner (Spiele sind immer gut) Du machst Dir
              viel M&uuml;he mit den Spielen, da&szlig; finde ich sehr gut!</TD>
            </TR>

            <TR>
              <TD valign="top">3.) &nbsp;</TD>
              <TD>SMS-Spr&uuml;che von J.Rudlaff (Coole Sammlung, habe gleich welche
              verschickt:-))</TD>
            </TR>

            <TR>
              <TD valign="top">4.) &nbsp;</TD>
              <TD>Back2Roots von Rainer Wrieden (Meine Lieblingsseite, ich habe schon
              viele Spiele angesammelt, nur leider laufen die mei&szlig;ten nicht mehr,
              wegen der Grafikkarte:-()</TD>
            </TR>

            <TR>
              <TD valign="top">5.) &nbsp;</TD>
              <TD>Dyskalkulie von Wolf Zimmer Das Wort "Dyskalkulie" kannte ich nicht
              einmal, aber solche Kinder kannte ich mal, vor allem ein Kind das
              schwerh&ouml;rig war und die Eltern wu&szlig;ten es mehrere Jahre nicht und
              dachten das Kind sei bl&ouml;d.</TD>
            </TR>

            <TR>
              <TD valign="top">6.) &nbsp;</TD>
              <TD>Alle anderen Texte, obwohl es immer weniger werden:-(</TD>
            </TR>
          </TABLE>

          <P>Gehe nach <A href="#top">oben</A></P>
          <HR size="4">

          <H3><A name="a6">Top 6 der NC 99</A></H3>

          <TABLE border="0" summary="">
            <TR>
              <TD valign="top">1.) &nbsp;</TD>
              <TD>Spiele A-Z von Anreas Guldner Soll das schon das Ende darstellen? Da Du
              schon bei Z angelangt bist, denke ich das es das schon war!</TD>
            </TR>

            <TR>
              <TD valign="top">2.) &nbsp;</TD>
              <TD>RPG-Kampf 10 von Andreas Guldner Schade, schon am Ende, es war sehr
              interessant und informativ gewesen!</TD> </TR>

            <TR>
              <TD valign="top">3.) &nbsp;</TD>
              <TD>Empire von Rainer Wrieden Wo hast Du denn dieses Spiel gefunden?
              L&auml;uft zwar eh nicht auf Grafikkarten, aber das werde ich bald
              &auml;ndern (Scandoubler).</TD>
            </TR>

            <TR>
              <TD valign="top">4.) &nbsp;</TD>
              <TD>Soundsystem von Rainer Wrieden Ob man noch mehr zu Lautsprechern
              schreiben k&ouml;nnte? Eigentlich nicht!</TD>
            </TR>

            <TR>
              <TD valign="top">1.) &nbsp;</TD>
              <TD>Workbench-2000 von Nightshade Bei mir st&uuml;rzt das Prog. immer schon
              beim Start ab:-)</TD>
            </TR>

            <TR>
              <TD valign="top">1.) &nbsp;</TD>
              <TD>Alle anderen Texte, aber es m&uuml;ssen unbedingt mehr werden:-(</TD>
            </TR>
          </TABLE>

          <P>Gehe nach <A href="#top">oben</A></P>
          <HR size="4">

          <H3><A name="a7">Spiele</A></H3>

          <P>Schreibt mal auf welche Spiele mit Grafikkarte oder einem Screenpromoter
          laufen! Dann k&ouml;nnten wir eine Liste erstellen und jeder sieht dann ob
          es sich lohnt ein bestimmtes Spiel zu kaufen oder aus dem Internet zu
          holen. Mir wird es n&auml;mlich langsam echt zu bl&ouml;d alles testen zu
          m&uuml;ssen. Jetzt schreibe ich mal einige Spiele auf die sich umlenken
          lassen, einen Screenmoderequester haben oder auf der Workbench laufen:</P>

          <TABLE summary="" border="0" cellpadding=0, cellspacing=0>
            <TR>
              <TD width="35%">Heretic-2</TD>
              <TD width="40">Grafikkarte</TD>
              <TD width="25%">Kommerziell</TD>
            </TR>

            <TR>
              <TD>Foundation</TD>
              <TD>Grafikkarte</TD> 
              <TD>Kommerziell</TD>
            </TR>

            <TR>
              <TD>Shogo</TD>
              <TD>Grafikkarte</TD> 
              <TD>Kommerziell</TD>
            </TR>

            <TR>
              <TD>Klotz</TD>
              <TD>Auf der Workbench</TD>
              <TD>PD</TD>
            </TR>

            <TR>
              <TD>HBMonopoli</TD>
              <TD>Auf der Workbench</TD>
              <TD>PD</TD>
            </TR>

            <TR>
              <TD>Soliton</TD>
              <TD>Auf der Workbench</TD>
              <TD>PD</TD>
            </TR>

            <TR>
              <TD>4Wins</TD>
              <TD>Auf der Workbench</TD>
              <TD>Shareware</TD>
            </TR>

            <TR>
              <TD>MiniArcanoid</TD>
              <TD>Auf der Workbench</TD>
              <TD>PD</TD>
            </TR>

            <TR>
              <TD>Yarzee</TD>
              <TD>Auf der Workbench</TD>
              <TD>PD</TD>
            </TR>

            <TR>
              <TD>WBWort</TD>
              <TD>Auf der Workbench</TD>
              <TD>Shareware (oder?)</TD>
            </TR>

            <TR>
              <TD>Doom</TD>
              <TD>Auf der Workbench</TD>
              <TD>Shareware ?</TD>
            </TR>

            <TR>
              <TD>Genetic Species</TD>
              <TD>Grafikkarte</TD>      
              <TD>Kommerziell</TD>
            </TR>

            <TR>
              <TD>MAG!!! AGA</TD>
              <TD>Screenpromoter</TD>   
              <TD>Kommerziell</TD>
            </TR>

            <TR>
              <TD>Sim-Ant</TD>
              <TD>Screenpromoter</TD>   
              <TD>Kommerziell (St&uuml;rzt ab)</TD>
            </TR>

            <TR>
              <TD>Sim-Earth</TD>
              <TD>Screenpromoter</TD>   
              <TD>Kommerziell</TD>
            </TR>

            <TR>
              <TD>Sim-Life</TD>
              <TD>Screenpromoter</TD>   
              <TD>Kommerziell</TD>
            </TR>

            <TR>
              <TD>Spaceward Ho</TD>
              <TD>Erst Promoter dann GraKa.</TD>
              <TD>Kommerziell</TD>
            </TR>
          </TABLE>

          <P>Das soll es erst einmal gewesen sein, ich hoffe Ihr macht mit und
          verl&auml;ngert diese Liste, es w&auml;re eine Hilfe f&uuml;r alle,
          schlie&szlig;lich haben die mei&szlig;ten Amiganer eine Grafikkarte (glaube
          ich wenigstens)! Im Falle von Sim-City-2000 und Dune-II kann ich Euch
          sagen: Es l&auml;&szlig;t sich nicht umlenken, auch wenn es in einer alten
          AmigaZeitschrift steht (irgendwo habe ich es auf jeden Fall mal gelesen),
          vielleicht geht es auch nur mal wieder bei mir nicht! Am besten w&auml;re
          es, wenn Ihr die Liste mit den Spielen, die Ihr getestet habt, zu mir
          schickt und ich alles zu einer Liste zusammenf&uuml;ge!</P>

          <P>Macht es gut: Poldi</P>

          <P>Gehe nach <A href="#top">oben</A></P>
          <HR size="4">
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

