<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>0190 - Anti-Dialer</B></FONT></P>

          <P><IMG src="st_0190SAD.jpg" align="left" hspace="6" height="80"
          width="195" alt="SAD-Logo"> Auf der Website der Firma S.A.D. GmbH Ulm gibt
          es viele und n&uuml;tzliche Programme f&uuml;r den professionellen und
          Homecomputer-Bereich zu finden. F&uuml;r alle, die nicht mittels des Amigas
          im Netz surfen, gibt es hier die entsprechende Software zu finden. &nbsp;
          &nbsp; &nbsp; <FONT color="#0000ff"><B>"www.s-a-d.de"</B></FONT><BR clear="all">

          <IMG height="67" width="50" src="st_0190AD.jpg" border="0" align="left"
          hspace="6" alt="0190-AD"> zum Beispiel:<BR>

          <B>Stoppt teure DF&Uuml;-Eingriffe von Dialern!<BR>
          Euro:&nbsp;9.99</B><BR clear="all"> </P>

          <CENTER><HR>Auszug aus dieser Website<HR></CENTER>

          <P>Nimmt Dialern den Schrecken!</P>

          <P>Sch&uuml;tzen Sie sich wirkungsvoll vor Dialer-Angriffen die im Netz lauern!</P>

          <P>Mit dem 0190-Anti-Dialer sind Sie auf der sicheren Seite des Internets.</P>

          <P>Leider finden sich im Internet in letzter Zeit immer mehr Seiten die
          Software-Dialer auf Ihren Rechner installieren. Diese k&ouml;nnen Ihre
          Onlinekosten in unglaubliche H&ouml;hen treiben.<BR>

          Und diese finden sich auch nicht mehr nur auf Internet-Seiten mit
          "problematischen" Content wie Seiten pornografischen Inhalts. Auch
          Webseiten mit scheinbar "normalen" Inhalten, z.B. Spieleseiten bieten
          diesen kostspieligen Service an. Die Sicherheit im Netz ist
          angegriffen.</P>

          <P>Sch&uuml;tzen Sie sich jetzt!<BR>

          Mit dem 0190-Anti-Dialer k&ouml;nnen Sie Ihren Computer schnell und einfach
          gegen diese kostenintensiven Angriffe sch&uuml;tzen.</P>

          <P>Sobald sich eine Internetverbindung aufbaut und der 0190- Anti-Dialer
          eine Rufnummer erkennt die offensichtlich unter das Dialer-Muster
          f&auml;llt, schl&auml;gt die Software Alarm und unterbindet automatisch
          oder auf Wunsch die Verbindung.</P>

          <P>Die Features:<BR>
          &raquo; leicht zu bedienende Oberfl&auml;che<BR>
          &raquo; Startet bei jedem Windows-Start und sch&uuml;tzt Sie so automatisch<BR>
          &raquo; Entfernt DF&Uuml;-Verbindungen zu teuren Rufnummern auf Wunsch<BR>
          &raquo; &Uuml;berwacht neu angelegte DF&Uuml;-Verbindungen<BR>
          &raquo; Meldet Einwahl zu Problem-Rufnummern, trennt diese auf Wunsch
                  immer sofort automatisch<BR>
          &raquo; &Uuml;berwacht &Auml;nderungen an den Rufnummern bestehender
                  DF&Uuml;-Verbindungen<BR>
          &raquo; Warnton bei verd&auml;chtigen Aktionen<BR>
          &raquo; Programmierbare Scan-Engine f&uuml;r das DF&Uuml;-Netzwerk<BR>
          &raquo; Zu sperrende Vorwahlen / Rufnummern k&ouml;nnen selbst festgelegt
                  werden<BR>
          &raquo; Ausnahmen f&uuml;r bestimmte Vorwahlen / Rufnummern definierbar<BR>
          &raquo; Erm&ouml;glicht das Entfernen von Dialern die sich im Autostart
                  festsetzen<BR>
          &raquo; F&uuml;hrt ein Protokoll aller &uuml;berwachten Einwahlen / Einwahlversuche
                  (zur Kostenkontrolle z.B.)</P>

          <CENTER><HR>Ende des Auszuges <HR> </CENTER>

          <P>Mit meinen Ausf&uuml;hrungen will ich keineswegs Reklame f&uuml;r einen
          bestimmten H&auml;ndler machen, aber ich bin der Meinung, dass man trotzdem
          wissen sollte, was so los ist und da ihr im Gro&szlig;teil mit dem PC ins
          Netz geht und auch die vielen "sch&ouml;nen" Werbemails bekommt, wo man
          sich sofort auch wieder aus dem Verteiler austragen lassen kann, man
          braucht ja nur die entsprechende Schaltfl&auml;che anklicken und schon
          werdet ihr &uuml;ber eine 0190er Nummer abgerechnet, wobei dann das
          Zur&uuml;ckschalten auf euren urspr&uuml;nglichen Server einfach vergessen
          wird. Die Ausrede, kostet mich ja nichts mehr, ich habe ja T-DSL, ist nicht
          gut und ihr leistet dem Betrug auf Kosten der Allgemeinheit Vorschub.
          Juristisch seid ihr dann einem Hehler gleichzusetzen und die werden genau
          so bestraft, wie die Diebe.</P>

          <P>Ob das Umschalten auf die teuren Nummern beim Surfen mit dem Amiga
          &uuml;berhaupt funktioniert, wei&szlig; ich nicht, mir ist es wenigstens
          noch nicht untergekommen. Gut, erstens besuche ich keine Sex-Seiten und
          zweitens l&ouml;sche ich Mails mit dubiosen Absender und/oder
          Subject-Angaben meist ungelesen schon vor dem Laden. Mit YAM kann man sehr
          sch&ouml;n eine Vorselektion machen und wenn man doch eine solche Mail
          geholt hat, dann bitte keinesfalls lesen, solange man noch ONLINE ist.</P> 
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8" summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

