<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>meine Urlaubserlebnisse</TITLE>
  </HEAD>

  <BODY background="ncb_bg3.gif" text="#000000" bgcolor="#b0b0b0">
    <BR>

    <CENTER>
      <FONT color="#000080" size="7"><B>mein Urlaub</B></FONT> 

      <TABLE border="0" cellspacing="0" cellpadding="0" summary="">
        <TR>
          <TD nowrap><IMG src="st_cordb34.jpg" width="274" height="189" alt="">
          <IMG src="st_cordb28.jpg" width="274" height="189" alt=""> </TD>
        </TR>
      </TABLE>
      Argeles sur mer - Leben wie Gott in Frankreich
    </CENTER>

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P>Wie Wenige von Euch wissen, war ich k&uuml;rzlich zwei Wochen in Argeles
          sur mer, einem sehr sch&ouml;nem Urlaubsort direkt am Mittelmeer in
          S&uuml;dfrankreich. Da leider viele (vor allem j&uuml;ngere) Menschen
          scheinbar nur noch Mallorca und Co. zu kennen scheinen, wollte ich Allen,
          die zur Abwechslung mal etwas Ruhe, Kultur und Erholung suchen dieses
          wundersch&ouml;ne Fleckchen Erde kurz vorstellen.</P>

          <P>Wie kommt man an das s&uuml;dfranz&ouml;sische Mittelmeer? Wer im
          s&uuml;dlichen Teil unseres Landes lebt, m&uuml;sste eigentlich geteert und
          gefedert werden, wenn er an die Nordseek&uuml;ste f&auml;hrt. Menschen, die
          wie ich aus dem hohen Norden Deutschlands kommen, haben zun&auml;chst eine
          beschwerliche Autoreise &uuml;ber deutschlands Autobahnen senkrecht von
          oben nach unten durch die Kasseler Berge vorbei an Frankfurt, bis es im
          untersten Winkel dann schliesslich fast unbemerkt &uuml;ber die Grenze
          geht. Sofort befindet man sich auf mindestens dreispurigen, hervorragenden
          Autobahnen mit nahezu wenig Verkehr oder h&ouml;chstens vereinzelnd.
          Hektik, Staus, L&auml;rm und Dreck an den Seiten sind in diesem Land eher
          Fremdw&ouml;rter. Warum? Sind die Franzosen etwa die besseren Menschen?
          -Das w&auml;re zwar auch eine M&ouml;glichkeit, aber nach wenigen
          Kilometern wird dieser wunderbare Zustand jedem Autofahrer klar. Automaten
          f&uuml;r jede Fahrspur und eine Schranke versperren den Weg - es muss
          f&uuml;r eine Weiterfahrt ein &raquo;Ticket&laquo; gezogen werden. Dieses
          Ticket &ouml;ffnet nicht nur die Schranken, sondern es kostet nach einer
          gewissen Fahrstrecke bares Geld in Form von Euro. Auf unserer Reise durch
          Frankreich kamen uns vier, solcher Automaten mit entsprechenden Kassen am
          Ende einer solchen Maudzone. Unsere Fahrt f&uuml;hrt an vielen kleinen und
          mittelgro&szlig;en St&auml;dten vorbei, von denen einem manche Stadtnamen
          zumindest ein Begriff ist. In Lion kann es dann gerade zu der Mittagszeit
          etwas enger auf der Autobahn werden. Um die Stadt zu entlasten, f&uuml;hrt
          dieser Teil der Autobahn kostenlos durch Frankreich. Auch durch Frankreich
          geht es pfeilgerade nach unten und immer der Nase nach. Irgendwelche
          Routenplaner braucht es nicht, -ab und zu einen Blick auf einen Autoatlas
          tut es vollkommen.</P>

          <P>Durch Staus und den dadurch hervorgerufenen Stress brauchten wir rund 20
          Stunden, bis wir von Verden (zwischen Bremen und Hannover) dann endlich in
          Argeles sur mer am Mittelmeer ankamen. F&uuml;r die Autobahngeb&uuml;hr
          waren wir knapp &uuml;ber 50 Euro &auml;rmer. Das ist zwar f&uuml;r eine
          Stra&szlig;enmitbenutzung eine Menge Geld, - aber ich glaube, das war es
          uns wert, denn das Fahren auf den Autobahnen in diesem erstklassigen
          Zustand war erm&uuml;dungsfrei und kein Vergleich zu den
          &uuml;berf&uuml;llten, verdreckten, sauerstofflosen Autobahnen in
          Deutschland. Auch an allen Rastst&auml;tten konnte man deutlich merken,
          wof&uuml;r das Geld eingesetzt wurde (im Gegensatz zu unserer
          &raquo;&Ouml;kosteuer&laquo;). </P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="0" cellspacing="0" cellpadding="0" summary="">
        <TR>
          <TD nowrap><IMG src="st_cordb04.jpg" width="274" height="189" alt="">
          <IMG src="st_cordb24.jpg" width="274" height="189" alt=""> </TD>
        </TR>
      </TABLE>
    </CENTER>

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P>Gemietet war f&uuml;r zwei Wochen ein kleiner Bungalow auf R&auml;dern,
          der sehr gro&szlig; und ordentlich war. Er bestand aus vier Zimmern und
          hatte alles, was das kurze angenehme Leben so brauchte - war damit
          eigentlich idealer, als ein kleines Hotelzimmer. Auf dem Platz gab es einen
          riesigen Swimmingpool mit Palmen und gl&uuml;cklicherweise erstaunlich
          wenig Chlor. Ein kleiner Supermarkt war genauso ans&auml;ssig, wie ein gut
          sortierter Kiosk. Ein franz&ouml;sisches, gut aber teures Restaurant
          geh&ouml;rt ebenso dazu, wie ein kleine Kneipe, in denen alle Spiele der
          Fussball-WM live gezeigt wurden. Dem Gebr&uuml;lle nach morgens h&auml;tte
          man meinen k&ouml;nnen, dass einige Urlauber nur hergekommen sind, um alle
          Spiele auch ohne Premiere sehen zu k&ouml;nnen.</P>

          <P>Am Nachmittag waren wir gut angekommen und erkundeten sofort die rund
          100 Meter Weg zum endlosen Sandstrand des Mittelmeeres. Es war herrlich,
          neben uns rakten beeindruckend die Pyren&auml;en in die H&ouml;he - eine
          ganze Bergkolonie, von denen die H&ouml;chsten sogar schneebedeckt in der
          Sonne schimmerten. Diese Berge zu unserer Rechten bildeten gleichzeitig die
          Grenze zu unseren tempor&auml;ren Nachbarn, den Spaniern. Mit einem
          Schnellboot h&auml;tte man in kurzer Zeit einen Abstecher nach Mallorca
          machen k&ouml;nnen, was uns aber nicht ein einziges Mal in den Sinn
          kam.</P>

          <P>Vor uns schwabbte nun das Mittelmeer zur Begr&uuml;&szlig;ung mit
          gro&szlig;en Wellen den nackten F&uuml;&szlig;en entgegen. Der Strand ging
          nach rechts direkt in die Standt von Argeless und das sch&ouml;ne und neu
          gebaute Hafengebiet. Rechts ab ging es dann immer weiter in die Einsamkeit,
          perfekt, wenn man auch noch in der Hauptsaison nicht auf dem Badehandtuch
          des N&auml;chsten liegen m&ouml;chte. Wir nahmen, wie es sich in Frankreich
          so geh&ouml;rt eine gute Flasche Rotwein zur Begr&uuml;&szlig;ung mit und
          schlossen somit an diesem Abend Freundschaft mit diesem idyllischem
          Fleckchen Erde.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="0" cellspacing="0" cellpadding="0" summary="">
        <TR>
          <TD nowrap><IMG src="st_cordb11.jpg" width="276" height="189" alt="">
          <IMG src="st_cordb17.jpg" width="276" height="189" alt=""> </TD>
        </TR>
      </TABLE>
    </CENTER>

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P>Bei offenem Schlafzimmerfenster konnte man nachts ausser den zirpenden
          Grillen noch die Brandung h&ouml;ren. Der Bungalow war mit Moskitonetzen
          versehen, so dass man es sehr gut aushalten konnte. Als allabendlicher
          Schlummertrunk diente ein immer wieder anderer Rotwein aus der breiten
          franz&ouml;sischen Palette und als kleiner Absacker noch ein Ricard mit
          Cola und dicken Eisw&uuml;rfeln. W&auml;re ich l&auml;nger, als zwei Wochen
          in Frankreich geblieben, so h&auml;tte ich heute wahrscheinlich ein
          Alkoholproblem. Absolut fantastisch war jede Malzeit in dieser Gegend - die
          Franzosen wissen wirklich, was schmeckt. Ich habe noch nie in meinem Leben
          so viel, so gut und so verh&auml;ltnism&auml;&szlig;ig g&uuml;nstig
          gegessen. Dinge, die bei uns zu den teureren Leckereien geh&ouml;ren oder
          die man bei uns wegen fehlender Qualit&auml;t und Frisch gar nicht erst
          probieren w&uuml;rde, waren dort ein wahres Kunstwerk. Ein Armeleutessen
          wie hier Pommes und Currywurst, waren dort mit Wein verfeinerte Muscheln.
          Ja, auch ich bin nicht so der Muschelfan, da mir diese zu sehr muffig nach
          Meer schmecken. In Collioure musste ich aber so eine Schale einfach mal
          probieren, da der Kellner unentwegt herumrannte und die meisten G&auml;ste
          damit versorgte. So nahm eine riesige hohe Schale mit Muscheln und einer
          Portion Pommes die komplette Tischbreite ein - nur mein obligatorisches
          Glas Wein passte noch daneben. Die Muscheln schmeckten unbeschreiblich und
          ich war hinterher wirklich satt. Aber auch Scampi, Gamba und andere
          Meeresfr&uuml;chte waren auf der Karte f&uuml;r wenig Geld zu haben. Mein
          reich gef&uuml;lltes Muschelgericht kostete &uuml;brigens 9,- Euro und wenn
          Ihr mal in Collioure seit, dann probiert das einmal aus - auch wenn Ihr
          sonst im Leben nie Muscheln essen w&uuml;rdet!</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="0" cellspacing="0" cellpadding="0" summary="">
        <TR>
          <TD nowrap><IMG src="st_cordb13.jpg" width="189" height="274" alt="">
          <IMG src="st_cordb14.jpg" width="189" height="274" alt=""> </TD>
        </TR>
      </TABLE>
    </CENTER>

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P>Nur eine Autostunde entfernt von Argeless liegt die Burgenstadt
          &raquo;Carcassone&laquo;. Ein Streifzug durch diese mittelalterliche Stadt
          lohnt sich immer. Die kleinen Gassen vermitteln das Leben zu fr&uuml;hen
          Zeiten. Leider wurde auch aus dieser sch&ouml;nen Stadt eine touristische
          Hochburg gemacht mit vielerlei Krimskramsl&auml;den, Cafes und Brasserien.
          Nachmittags f&uuml;llen sich die schmalen Gassen dadurch mit wahnsinnig
          vielen Menschen unter denen ich nur wenig waschechte Franzosen vermutet
          habe. Wo sich Gelegenheit anbietet, lohnt es sich, eine Festungsmauer hoch
          zu klettern, um von oben in die Landschaft rings um die alte Burgenstadt
          &uuml;bersehen zu k&ouml;nnen. Es bot sich uns ein malerisches Bild auf
          verschiedenfarbige Weinfelder und viele &auml;ltere H&auml;user, die von
          sich her Gem&uuml;tlichkeit und etwas Verschlafenes ausstrahlten.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="0" cellspacing="2" cellpadding="4" summary="">
        <TR>
          <TD nowrap><IMG src="st_cordb07.jpg" width="274" height="189" alt=""><BR><BR>
          <IMG src="st_cordb22.jpg" width="276" height="190" alt=""></TD>          
          <TD valign="center">
          <IMG src="st_cordb12.jpg" width="190" height="276" alt=""> </TD>
        </TR>
      </TABLE>
    </CENTER>

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P>Auch den h&ouml;chsten Berg der Pyren&auml;en haben wir versucht zu
          erklimmen, leider kommt man ohne Hilfe nicht einmal die H&auml;lfte der
          &uuml;ber 2000 Meter hoch und diese Hilfe mit Gel&auml;ndewagen scheint man
          erst in der Hauptsaison zu bekommen. Immerhin konnten wir im h&ouml;chsten
          ans&auml;ssigen Dorf noch kurze Rast einlegen und den impulsanten Ausblick
          geniessen. Das kleine Bergdorf hatte die Zivilisation auch scheinbar nicht
          erlebt, - eine alte Pferdetr&auml;nke und die uralte Kirche aus Felssteinen
          waren Zeugen einer sch&ouml;nen Vergangenheit.</P>

          <P>Auch eine riesige Grotte kreuzte unseren Heimweg zum Bungalow. Auch so
          etwas bekommt man hier in dieser Gr&ouml;&szlig;enordnung nie zu Gesicht.
          Umzingelt von farblich beleuchteten Stalagmiten und Stalagtiten schien man
          durch eine v&ouml;llig andere Welt zu tapsen. Manche Stalagmiten hatten den
          Anschein, als w&uuml;rden sie einem ihre ganze Jahrhunderte lange
          Geschichte erz&auml;hlen wollen. Durch die gewaltigen Berggew&ouml;lbe
          halte eine leise einlullende Musik, um den Besuchern das gewaltige
          Klangspektrum zu verdeutlichen. An manchen Tagen finde Konzerte statt. Wir
          haben uns etwas &uuml;ber eine Stunde aufgehalten, um dann der Sommersonne
          drau&szlig;en wieder entgegenzublicken.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="0" cellspacing="0" cellpadding="0" summary="">
        <TR>
          <TD nowrap><IMG src="st_cordb05.jpg" width="274" height="189" alt="">
          <IMG src="st_cordb08.jpg" width="276" height="190" alt=""> </TD>
        </TR>
      </TABLE>
    </CENTER>

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P>S&uuml;dfrankreich hat viel h&uuml;gelige Landschaft, auf der fast nur
          Wein und Oliven w&auml;chst. Das liegt an dem steinigen Boden. So wie wir
          uns Tannen und &auml;hnliches in den Garten pflanzen, kaufen sich dort die
          Menschen Palmen und schneiden sie sich ihren Vorstellungen entsprechend
          zurecht. Schaut man etwas weiter in die franz&ouml;sischen G&auml;rten, so
          stellt man schnell fest, dass viele Menschen auch privat Weinreben,
          Zitronen- und Orangenb&auml;ume, Olivenb&uuml;sche und &auml;hnliches
          anpflanzen, - so wie es bei uns eben Pflaumen, &Auml;pfel und Kirschen
          gibt. Sogar Spargel wird angebaut, &uuml;blicherweise gr&uuml;ner Spargel.
          Der Weisse ist viel seltener und dann teuer zu kaufen.</P>

          <P>Das ganze franz&ouml;sische Leben spielt sich drau&szlig;en auf der
          Strasse ab. Selbst ich habe nicht einen einzigen Gedanken an Computer,
          Fernseher oder Videorecorder verschwendet. Nat&uuml;rlich gibt es auch
          sicherlich in S&uuml;dfrankreich Elektronikfans, aber sie befinden sich
          dort in der Minderheit. &Uuml;berhaupt scheint die Technik im Land erst
          relativ sp&auml;t Einzug gefunden zu haben. An &auml;lteren H&auml;usern
          gehen alle Leitungen und Rohre &uuml;blicherweise au&szlig;en an der Wand
          entlang. Bei uns gar nicht denkbar! Abends sitzen &uuml;berall die
          Franzosen draussen beieinander, trinken etwas, erz&auml;hlen viel oder
          spielen irgendwelche Brettspiele oder bestaunen irgendwelche Touristen.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="0" cellspacing="0" cellpadding="0" summary="">
        <TR>
          <TD nowrap><IMG src="st_cordb30.jpg" width="276" height="190" alt="">
          <IMG src="st_cordb32.jpg" width="276" height="190" alt=""> </TD>
        </TR>
      </TABLE>
    </CENTER>

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>

          <P>Wir fahren durch die Berge erneut zu dem wundersch&ouml;nen Collioure,
          in dem schon Picasso und einige andere ber&uuml;hmte Maler eine Weile
          verbracht haben, um sich neu zu inspirieren. Zum einen war mir gleich klar,
          dass ich hier wunderbare Nachtaufnahmen mit meiner Nikon machen k&ouml;nnte
          und zum anderen wollten wir uns noch weiter in dem kleinen Irrgarten
          schmaler Gassen mit etlichen K&uuml;nstlerateliers aufhalten. In einer
          Kneipenmeile tobte das Leben. Gesch&auml;fte machten erst zu, wenn nichts
          mehr los war und das konnte sp&auml;t werden. Beleuchtete Br&uuml;cken,
          Aussichten direkt in die Hafenbucht und die Felsklippen zur Meerseite
          hinaus liessen den kleinen Ort im Tal umzingelt von den Pyren&auml;en
          malerisch aussehen. Auf den Bergen wacht ein Schloss und auf einem anderen
          Berg daneben eine Windm&uuml;hle &uuml;ber Collioure. Sehr empfehlenswert
          ist das kleine Lokal, deren Hauptgeschehen sich zwischen der wenig
          befahrenen Hauptstrasse und der Hafenbucht abspielte. Hier hatten wir auch
          die Muscheln gegessen. In etwa kann man genauso per Webcam jederzeit direkt
          in den Hafen sehen, wie wir beim essen. Man sitzt etwas weiter rechts unter
          Palmen und es spielte sogar ein franz&ouml;sischer Stra&szlig;enmusikant
          auf seiner Gitarre. Unter folgender Webadresse k&ouml;nnt Ihr unseren
          Ausblick sehen -leider nur einen kleinen Teil.<BR>
          http://www.cg66.com/webcamimg/camcollioure.jpg</P>

          <P>F&auml;hrt man durch Collioure hindurch, so kommt auf der rechten Seite
          bald ein kleiner Friedhof. Einen franz&ouml;sischen Friedhof sollte man
          sich ruhig mal ansehen. Es ist erstaunlich, wie wichtig und wertvoll den
          Franzosen das letzte Lebenskapitel erscheint. Es werden kleine eigene
          Gebetsh&auml;user gebaut und prunkvoll verziert. Fotos und Geschichten von
          den Toten berichten &uuml;ber deren Leben. Auch hundert Jahre alte
          Grabstellen werden scheinbar st&auml;ndig gepflegt. Friedh&ouml;fe haben
          oft eine Lage am Hang mit einem wunderbaren Ausblick.</P>

        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="0" cellspacing="2" cellpadding="4" summary="">
        <TR>
          <TD valign="center" nowrap>
          <IMG src="st_cordb20.jpg" width="189" height="274" alt=""></TD>
          <TD><IMG src="st_cordb15.jpg" width="276" height="190" alt=""><BR><BR>
          <IMG src="st_cordb19.jpg" width="276" height="190" alt=""> </TD>
        </TR>
      </TABLE>
    </CENTER>

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P>Kaum ist man &uuml;ber der spanischen Grenze, erscheinen einem die
          H&auml;user auch gleich ein wenig anders. Sie sind etwas
          zweckm&auml;&szlig;iger und eher schlicht gebaut. An der Hauptstrasse gibt
          es mehrere gro&szlig;e Bootsh&auml;user, in deren
          mehrgesch&ouml;&szlig;igen Schaufenstern vom Rennboot bis zur Luxusjacht
          alles zu haben ist. Man stelle sich unsere Autoh&auml;user vor, nur dass
          statt dessen Boote zu sehen waren.</P>

          <P>Auch bereits Argeless hat eine interessante Stadt, die jedoch leider
          komplett auf Tourismus eingestellt ist. Hier gibt es zwei kleine
          Shoppingstrassen mit allerlei Schnickschnack, Klamotten und Restaurants -
          alles nat&uuml;rlich nur wenige Meter vom Strand entfernt. Der Strand muss
          &uuml;brigens regelm&auml;&szlig;ig gesiebt werden, da das Meer fast nur
          Steine ans Land schwemmt. Es lohnt sich bei einem Bad im Meer etwa 10 Meter
          zu schwimmen, oft kommen dann Sandb&auml;nke, so dass man dort auf weichem
          Sand gehen kann, was stellenweise wegen der Steine nicht m&ouml;glich ist.
          In der Urlaubshauptsaison wird aber viel getan, damit der Strand
          Bilderbuchreif ist.</P>

          <P>Wenn Ihr nicht zu den Weintrinkern geh&ouml;rt - auch das Bier ist sehr
          gut geniessbar. Im Hafen von Argeless gab es sogar Ma&szlig;kr&uuml;ge mit
          herrlich frisch Gezapften. F&uuml;r den kleinen Hunger gibt es an jeder
          Ecke eine Pizzaria. Wenn m&ouml;glich, solltet Ihr aber dennoch die
          Umgebung erkunden, da man in Argeless nicht wirklich franz&ouml;sisches
          Leben vermittelt bekommen kann.</P>

          <P>Abends spielen viele Livebands und Discos gibt es auch gen&uuml;gend -
          es ist f&uuml;r wirklich jeden etwas dabei. Ob zu Pferd im Wasser oder in
          der Luft - alle Sportaktivit&auml;ten sind versammelt. Funbikes und
          Motorr&auml;der k&ouml;nnen g&uuml;nstig gemietet werden.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="0" cellspacing="0" cellpadding="0" summary="">
        <TR>
          <TD nowrap><IMG src="st_cordb25.jpg" width="276" height="190" alt="">
          <IMG src="st_cordb16.jpg" width="274" height="189" alt=""> </TD>
        </TR>
      </TABLE>
    </CENTER>

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P>Eine Delikatesse ist der franz&ouml;sische Kaffee, der anders als bei
          uns in Deutschland nicht aus den billigen Robusta-Bohnen (Coffea canephora)
          zusammengemixt wird, die sch&ouml;n lange haltbar sind und nicht so
          empfindlich bei der R&ouml;stung, sondern aus der edleren
          Arabic&aacute;-Sorte (Coffea Arabic&aacute;). Und diesen gewaltigen
          Unterschied merkt man so gewaltig, dass ich in Deutschland zur&uuml;ck
          sofort im Internet auf Importsuche gegangen bin.</P>

          <P>In der Nacht vor unserer Abreise habe ich dann am Strand im Sand
          schlafen wollen, um den Sonnenaufgang bewaffnet mit Fotoapparat nicht zu
          verpassen. Eine Nacht direkt am Meer, - das habe ich mir auch schon an der
          Ostsee geg&ouml;nnt und ich kann es jedem empfehlen, der gern mit den
          Sternen &uuml;ber sich und der Brandung vor sich einschl&auml;ft - ein
          sch&ouml;nes Erlebnis. Z&uuml;gig war das Auto wieder gepackt bis unter das
          Dach. Zum Gl&uuml;ck hatten wir eine Klimaanlage, die uns unerwartet auch
          in Deutschland gute Dienste leisten musste, als wir am w&auml;rmesten
          Sommertag diesen Jahres zur&uuml;ckfuhren. Diesesmal ohne Stau oder
          sonstige Vorkommnisse und so erreichten wir nun die Heimat fix und fertig
          nach 15 Stunden.</P>

          <P>Aber warum ich &uuml;berhaupt zur&uuml;ck gekommen bin, weiss ich bis
          heute noch nicht genau.</P>

          <P>Und wer jetzt ein wenig auf den Geschmack gekommen ist, dem kann ich
          noch den Link:<BR> http://www.rpsn.de/villa-rosina/<BR> empfehlen. Klickt
          dort auf die Schaltfl&auml;che &raquo;Umgebung&laquo; und Ihr k&ouml;nnt
          Euch viele weitere Fotos ansehen und n&uuml;tzliche Tipps holen.</P>

          <P>Das war mein Urlaub in Argeless sur mer in S&uuml;dfrankreich. Ich
          hoffe, ich konnte Euch f&uuml;r ein paar Minuten mitnehmen. Berichtet doch
          einmal von Eurem Urlaub.</P>

          <P>Erholsame Tage allen, die das noch vor sich haben.
          Euer<BR>
          Cord Hagen<BR>
          HIGGINS<BR>
          CordHagen@as-x.de</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

