<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>Die 100ste Ausgabe der NoCover</TITLE>
  </HEAD>

  <BODY text="#ffff99" bgcolor="#000030">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#ff00ff" size="7">
          <B>Happy Birthday NoCover</B></FONT></P>

          <P>Mal ehrlich, - wer von Euch h&auml;tte das gedacht? Unser ehemalig
          reines Diskettenmagazin, die NoCover kommt nun in der 100ste Ausgabe!</P>

          <P>Ich wei&szlig; noch, wie ich das erste Mal von der NoCover erfuhr. Es
          war seinerzeit eine Information aus dem Videotext von Sat.1 - dort wurde
          auf die NoCover hingewiesen (ja damals wurde &uuml;ber Amiga noch
          ausf&uuml;hrlich im Videotext berichtet). Ich sendete das n&ouml;tige
          Klimpergeld f&uuml;r die beiden DD-Disketten nach &Uuml;bersee zum Andreas
          und wartete gespannt auf das, was da kommt. Ich glaube, es war Ausgabe
          Nummer 4, wenn ich mich nicht t&auml;usche.</P>

          <P>Wenig sp&auml;ter kam dann der Briefumschlag, den Viele von uns
          sicherlich noch gut kennen werden. Die erst Diskette verschwand in meinem
          Amiga600. Doch leider schien mir die Handhabung mit dem alten Anzeiger MP
          zu umst&auml;ndlich. Ich bl&auml;tterte in den ersten Seiten, kam dann oft
          auf ganz andere Seiten, als ich wollte. Die Disketten flogen nach wenigen
          Minuten in die Ecke, da ich auch nichts wirklich Spannendes in dieser
          kurzen Testzeit fand.</P>

          <P>Es vergingen einige Monate und heute wei&szlig; ich gar nicht, was mich
          ein zweites Mal dazu trieb, erneut eine Ausgabe zu ordern. Auch schien ich
          mir etwas mehr Zeit beim zweiten Anlauf genommen zu haben. Schon der
          Titelscreen war in Highres, statt Interlace, wodurch ich auf meinem
          Uraltmonitor das Men&uuml; lesbar vorfand. Ich kam besser zurecht, merkte
          mir die Tastenbelegung zur bequemeren Bedienung. Es waren viele Artikel
          drin und das Magazin war witzig und interessant geschrieben. Viele User
          schienen sich untereinander zu kennen. Schon damals war Andreas am jammern,
          dass die NC ja ein Mitmachmagazin sei und sich neue Leser ja mal vorstellen
          k&ouml;nnten.</P>

          <P>Kurz darauf bestellte ich mein erstes Abo und stellte mich in einem
          Artikel in meiner bekannten Ausf&uuml;hrlichkeit vor. Die Reaktion der
          Anderen darauf verfolgte ich in der Folgeausgabe mit gro&szlig;em
          Interesse. Das Magazin war somit wohl das erste aber auch langsamste
          interaktive Medium, was ich auf dem Amiga kennen lernte.</P>

          <P>Nach und nach habe ich wahnsinnig viele liebe Menschen &uuml;ber eben
          diese NoCover kennen gelernt. &Uuml;ber keine andere M&ouml;glichkeit habe
          ich bis heute hin so viele Gleichgesinnte kennen gelernt. Es waren
          seinerzeit witzige Jahre - wir machten uns gemeinsam &uuml;ber die
          grafikschwachen 386er lustig, schadenfreuten uns &uuml;ber das neue
          Windows95 mit allen Abst&uuml;rzen, die dieses System so mit sich brachte.
          Wir diskutierten und stritten, welches Computersystem nun das Beste sei,
          denn mit dem Commodoreuntergang verlie&szlig;en schon die Ersten das
          m&ouml;glicherweise sinkende Schiff. Ich bin mir nicht sicher, aber ich
          glaube, ich habe in der NC die l&auml;ngsten Artikel abgeliefert - Dank an
          alldiejenigen, die sie immer layouten mussten, weil ich mit MagneticPages
          nie klargekommen bin und einfach auch zu faul war, mich damit zu
          befassen.</P>

          <P>Und auch wenn man es vielleicht nicht direkt damit verbinden kann, -
          seit der NoCover-Umstellung auf HTML wurden die Artikel immer weniger und
          hochwertig-interessante Artikel wurden seltener. Die alten Schreiber erster
          Stunde stiegen auf andere Interessen um und hatten immer weniger Zeit und
          Lust f&uuml;r die NoCover zu schreiben. Sicherlich sah schon damals nicht
          nur ich den Ernst der Lage. Ich versuchte mir immer wieder zu
          &uuml;berlegen, wie man wieder einen Stein zum Rollen bringen k&ouml;nnte.
          So rief ich den R&uuml;ckblick auf die letzte Ausgabe ins Leben, wo
          abwechselnd einige Redakteure noch einmal ihre Eindr&uuml;cke zu der
          Vorausgabe abgaben, - begann eine unendlichwerden sollende Story, an deren
          Teil andere Redakteure ihren Fortsetzungsteil schreiben konnten. Wollte
          Hitparade mit Preisvergabe organisieren, doch es half alles nichts - heute
          halten wir die Ausgabe 100 in den H&auml;nden und noch nie war ein
          Sommerloch so gef&auml;hrlich f&uuml;r die NoCover, wie dieses.</P>

          <P>Als Kilian die NC &uuml;bernahm, hatte ich nur eine Hoffnung -
          hoffentlich l&auml;sst er sich nicht entmutigen! Ich wei&szlig; nur zu gut,
          wie schlimm das ist, etwas durchziehen zu wollen, was nur mit viel
          Unterst&uuml;tzung gelingen kann und dann immer wieder festzustellen, dass
          man mit nur sehr wenig Hilfe auskommen muss. Jetzt kann ich nur hoffen,
          dass Kilian die NC aufrecht h&auml;lt und sie alle zwei Monate erscheinen
          l&auml;sst. Zumindest ich w&uuml;rde es zeitlich dann sicherlich eher
          schaffen, immer wieder mal einige Artikel zu schreiben. Aber auch das hilft
          nur wenig, wenn nicht wieder deutlich mehr Leser auch zu schreiben
          anfangen!</P>

          <P>Ich kann nur sagen, wenn Du hier die NoCover gerne liest, dann schreibe
          doch auch etwas! Dein Artikel muss doch gar nicht lang sein - Du musst ihn
          nicht einmal layouten. Wenn Du Dir nur 10 Minuten Zeit nimmst, kannst Du
          schon Deinen Beitrag leisten. Kennst Du einen guten Witz? Eine interessante
          Internetseite? Hast Du Dir etwas Neues f&uuml;r Deinen Computer gekauft?
          Wie war es in Deinem Urlaub? Erz&auml;hl uns etwas &uuml;ber Deine Hobbys!
          Teile Deine Gedanken &uuml;ber das aktuelle Tagesgespr&auml;ch. Bist Du
          zufrieden mit der deutschen Politik? Kannst Du mir die Faszination des
          Fu&szlig;ballspiels erkl&auml;ren? Welches Handy nutzt Du und warum gerade
          dieses? - Es gibt soviel unz&auml;hlige Themen, zu denen Du einfach einige
          S&auml;tze in Deine Tastatur h&auml;mmern k&ouml;nntest - nur 10 Minuten
          -nicht am Tag, nicht in der Woche - nur 10 Minuten im Monat! Merkst Du, wie
          wenig Aufwand das ist? Zur&uuml;ck bekommst Du wieder ein randvolles
          Magazin mit vielen tollen und interessanten Geschichten,
          Erfahrungsberichten, Hard- und Softwaretests kunterbunt gemischt - so wie
          wir kreativen Amiganer nun einmal sind.</P>

          <P>Ich wei&szlig;, wie unwahrscheinlich es ist, dass die NoCover jemals
          wieder so, wie zu ihren Bestzeiten wird, aber wenn jeder nur den kleinen
          Finger zuckt (und mehr ist zum Bedienen einer Tastatur wirklich nicht
          n&ouml;tig), kann am Ende wieder der Spirit reinkommen, den die NC
          fr&uuml;her hatte und dann schreibt jeder ganz automatisch wieder mehr,
          weil es einfach auch Spa&szlig; macht.</P>

          <P>Liebe gute NoCover, ich w&uuml;nsche Dir und Deiner Redaktion von Herzen
          alles Gute und f&uuml;r Deine Zukunft ein St&uuml;ck gute alte
          Vergangenheit.</P>

          <P>Happy Birthday!</P>

          <P>Cord Hagen<BR>
          HIGGINS<BR>
          CordHagen@as-x.de</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML> 
