<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>www.monster.de</B></FONT></P>

          <P><IMG src="st_monster1.gif" alt="" align="left" hspace= "8"> Dieses Bild
          erscheint auf einer zweiten Seite. Wenn viele Arbeitssuchende diesen
          horrenden Betrag f&uuml;r zwei Monate Anzeige hinbl&auml;ttern d&uuml;rfen,
          dann sollte man annehmen, das lohnt sich bestimmt. Fragt sich nur f&uuml;r
          wen ?!?</P>

          <P>Oder verstehe ich dies mal wieder falsch und es sind nur
          Firmeninserenten gemeint, die einen Job zu vergeben haben? Aber warum
          sollen Firmen f&uuml;r etwas bezahlen, das sie umsonst haben k&ouml;nnten,
          besonders wo doch schon 400.000 qualifizierte Menschen auf den Job hoffen?
          Ganz ehrlich, irgendetwas bekomme ich da wohl nicht so richtig mit.</P>

          <P>Hier ist aber mal die gesamte Seite zu sehen. <A href=
          "st_monster1.html" target="_top"><B>klick!</B></A></P> <BR clear="all">
                     

          <P>Bei dem Riesenwust des Angebotes schauen wir uns nun die Rubrik:
          Karriereberatung an und zwar gleich den ersten Link: Jobs finden. Den nun
          folgenden Text habe ich w&ouml;rtlich entnommen (ob ich dies darf,
          wei&szlig; ich nicht).</P>

          <P><FONT size="+1"><B>Raus aus der Arbeitslosigkeit</B><BR>
          Zuversicht ist durchaus angemessen</FONT><BR>
          <FONT size="-1">Sylvia Ho</FONT></P>

          <P><B>1 Ein neuer Anfang</B><BR>
          Mit Ihrem letzten Job hat es nicht so recht geklappt. Vielleicht hatten Sie
          Probleme mit Ihrem Chef oder Ihren Kollegen. Sie wurden zeitweise beurlaubt
          oder sogar gek&uuml;ndigt? Entspannen Sie sich. Wir helfen Ihnen bei der
          Vorbereitung auf die jetzt auf Sie zukommenden
          Vorstellungsgespr&auml;che.</P>

          <P><B>2 Was ist Ihr gr&ouml;&szlig;tes Handicap?</B><BR>
          Sind es Ihre Arbeitszeugnisse, ein Lebenslauf mit Schwachpunkten oder gar
          Ihr fr&uuml;herer Chef? Nein, vermutlich sind es eher Ihre Einstellung und
          Ihre Vorbereitung, die Ihnen im Magen liegen. Eine positive und
          zukunftsorientierte Einstellung macht Eindruck bei Arbeitgebern,
          w&auml;hrend eine negative Einstellung abschreckend wirkt. Ein Bewerber,
          der sich gut vorbereitet hat - der sich mit dem Unternehmen und dem
          angestrebten Job bereits auseinandergesetzt hat und wei&szlig;, welche
          St&auml;rken er hat, wirkt professionell und kommt dadurch eher f&uuml;r
          die ausgeschriebene Stelle in Frage. Ein unvorbereiteter Bewerber wirkt
          dagegen unorganisiert, unprofessionell und verst&auml;rkt damit alle
          Vorurteile, die man nach dem Lesen eines schlechten Arbeitszeugnisses
          m&ouml;glicherweise bereits hat.</P>

          <P><B>3 Hinweise f&uuml;r die Vorbereitung</B><BR>
          Im Folgenden finden Sie einige Hinweise, wie Sie sich auf Ihren
          Karrierestart vorbereiten und zu einer positiven Einstellung gelangen
          k&ouml;nnen. Dass man sich Sorgen macht, ist ganz normal, doch die meisten
          Menschen wissen aus eigener Erfahrung, wie es ist, wenn es in einem Job mal
          nicht geklappt hat. Sie haben deshalb gute Chancen, dass Ihr
          Gespr&auml;chspartner selbst schon einmal in einer &auml;hnlichen Situation
          war. Wenn Sie zu lange dar&uuml;ber nachgr&uuml;beln, verpulvern Sie nur
          Ihre Energie. Seien Sie stattdessen aktiv und legen Sie sich bereits vor
          dem Vorstellungsgespr&auml;ch Antworten auf die m&ouml;glichen
          Einw&auml;nde zurecht, die ein Arbeitgeber gegen Sie vorbringen
          k&ouml;nnte.</P>

          <P><B>4 Schlechte und gute Zeugnisse</B><BR>
          Handeln Sie fr&uuml;hzeitig, wenn Sie das Gef&uuml;hl haben, Ihr letzter
          Chef k&ouml;nnte Ihnen ein schlechtes Zeugnis ausstellen. Rufen Sie
          fr&uuml;here Arbeitgeber an, die eine gute Meinung von Ihnen hatten, und
          lassen Sie sich von Ihnen Referenzen ausstellen. Je mehr Referenzen Sie
          vorzuweisen haben, desto unbedeutender ist das schlechte Zeugnis. Ein
          Entscheidungstr&auml;ger wird alle ihm vorliegenden Unterlagen in ihrer
          Gesamtheit beurteilen und so zu einem f&uuml;r Sie g&uuml;nstigeren
          Ergebnis kommen.</P>

          <P><B>5 Professioneller Umgang mit unangenehmen Fragen</B><BR>
          Unangenehme Fragen sind Bestandteil jedes Vorstellungsgespr&auml;chs. Deren
          Wirkung auf Sie kann noch unangenehmer sein, wenn es mit dem letzten Job
          nicht geklappt hat. &Uuml;berlegen Sie sich bereits im Vorfeld
          m&ouml;gliche unangenehme Fragen und legen Sie sich entsprechende Antworten
          zurecht. Sprechen Sie mit Ihren Freunden und Verwandten dar&uuml;ber und
          fragen Sie sie nach ihrer Meinung. Es muss Ihnen nicht peinlich sein, einen
          Job aufgegeben zu haben, wenn Sie erkl&auml;ren k&ouml;nnen, warum diese
          Arbeit nicht das Richtige f&uuml;r Sie war und was Sie aus dieser Erfahrung
          gelernt haben.</P>

          <P><B>6 Leistung und Erfahrung z&auml;hlen</B><BR>
          Glauben Sie daran, dass Sie f&uuml;r einen k&uuml;nftigen Arbeitgeber
          wertvoll sind und Ihre F&auml;higkeiten zu seinem Nutzen einbringen
          k&ouml;nnen. Denken Sie ein wenig dar&uuml;ber nach, was Sie in Ihren
          bisherigen Jobs alles erreicht haben. Welche F&auml;higkeiten k&ouml;nnen
          Sie in die Waagschale werfen? Werden diese F&auml;higkeiten von dem
          Unternehmen ben&ouml;tigt? Stellen Sie eine Liste zusammen und gehen Sie
          sie immer wieder durch. Dadurch gewinnen Sie Selbstvertrauen und eine
          positive Einstellung, was sich wiederum g&uuml;nstig auf das
          Vorstellungsgespr&auml;ch auswirken wird.</P>

          <P><B>7 L&uuml;gen haben kurze Beine</B><BR>
          Gesucht werden verantwortungsbewusste Mitarbeiter. Personalchefs m&ouml;gen
          keine Bewerber, die sich in Ausreden fl&uuml;chten. Sprechen Sie lieber
          &uuml;ber Ihre Erfolge statt &uuml;ber negative Aspekte Ihres letzten Jobs.
          Wenn Sie dagegen direkt gefragt werden, was beim letzten Job schief
          gelaufen ist, sollten Sie betonen, was Sie aus dieser Erfahrung gelernt
          haben, und was Sie im n&auml;chsten Job besser machen m&ouml;chten.</P>

          <P><B>8 Den Mut nicht verlieren</B><BR>
          Der Grund, warum Sie einen bestimmten Job nicht bekommen haben, hat unter
          Umst&auml;nden &uuml;berhaupt nichts mit Ihnen pers&ouml;nlich zu tun. Wenn
          Sie abgelehnt wurden, schreiben Sie zun&auml;chst dem verantwortlichen
          Mitarbeiter der Personalabteilung und rufen Sie ihn dann an. Finden Sie
          heraus, warum Sie nicht genommen wurden. Stellen Sie klar, dass Sie nicht
          &uuml;ber die Entscheidung des Unternehmens diskutieren m&ouml;chten,
          sondern lediglich um Informationen bitten, die Ihnen bei Ihrer Jobsuche
          weiterhelfen. Lernen Sie aus jedem Bewerbungsgespr&auml;ch und geben Sie
          die Suche nicht auf. Lassen Sie sich nicht entmutigen!</P>

          <P><FONT size="+1"><B>Unerwartete Absage</B><BR>
          Aus Entt&auml;uschungen lernen</FONT><BR>
          <FONT size="-1">Franz Waizmann</FONT></P>

          <P><B>1 Anforderungen und Qualifikation</B><BR>
          Manchmal bewirbt man sich auf Stellen, die man gerne h&auml;tte, deren
          Anforderungen man jedoch aufgrund der eigenen Qualifikation nur
          unzureichend oder gar nicht erf&uuml;llt. Da reicht es dem Unternehmen
          nicht aus, das Sie der Meinung sind, der ideale Kandidat f&uuml;r die
          Position zu sein. Nutzen Sie Ihre Erkenntnisse, wie Sie sich Ihren Traumjob
          vorstellen dazu, sich weiterzubilden. Erkundigen Sie sich z.B. beim
          Arbeitsamt nach entsprechenden Weiterbildungs- und finanziellen
          F&ouml;rderm&ouml;glichkeiten.</P>

          <P><B>2 Nicht pers&ouml;nlich nehmen</B><BR>
          Und noch was - nehmen Sie Absagen nicht pers&ouml;nlich, reden Sie sich auf
          keinen Fall ein, Sie k&ouml;nnen nichts oder Ihr Wissen ist nicht mehr
          gefragt. Sehen Sie Absagen als Zeichen, an sich zu arbeiten. Wenn Sie eine
          Standardabsage ohne genauere Begr&uuml;ndung erhalten, rufen Sie ruhig noch
          einmal bei dem Unternehmen an und erkundigen Sie sich nach den Details.
          Schreiben Sie sich diese auf und erstellen Sie Ihren ganz pers&ouml;nlichen
          Karriereleitfaden.</P>

          <P><B>3 Absagen hinterfragen</B><BR>
          Wenn man Ihnen sagt, der Grund der Absage war Ihre fehlenden
          Sprachkenntnisse, dann vertiefen Sie Ihre Sprachkenntnisse! Waren es
          beispielsweise Ihre fehlenden Internetkenntnisse, dann machen Sie einen
          Internet Kurs! Sollte hingegen Ihr Alter ausschlaggebend gewesen sein, dann
          Bewerben Sie sich nicht unbedingt bei einer Start up Firma, bei der der
          Chef als &auml;ltester Mitarbeiter gerade seinen 24. Geburtstag gefeiert
          hat! Und vor allen Dingen - geben Sie nie auf, hinterfragen Sie immer und
          arbeiten Sie kontinuierlich an Ihrer beruflichen und pers&ouml;nlichen
          Wertsteigerung.</P>
          <HR>

          <P>Diese beiden Artikel sollten nun ausreichend sein, um mehr Geschmack
          f&uuml;r diese Web-Site zu bekommen. Was nun passiert, wenn man sich
          anmeldet, kann ich beim besten Willen nicht sagen, ich habe es nicht
          ausprobiert.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8" summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

