<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>

    <TITLE>M&ouml;rder-Spiele</TITLE>
  </HEAD>

  <BODY background="ncb_bg3.gif" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7">
          <B>M&ouml;rder-Spiele und -Filme ???</B></FONT></P>

          <P>Wie kann das sein, ein junger Mann (IRRER) geht in die Schule und bringt
          seine Lehrer und Schulkameraden um, die Polizei durchsucht seine Bude und
          findet ein einziges Gewaltspiel unter vielen anderen Spielen!? Nun laufen
          alle durch die Gegend und sagen das dieses Spiel daran Schuld sei! Aber das
          mehrere hunderttausende Menschen auch dieses Spiel gespielt haben, ohne
          Amok zu laufen, interessiert sie nicht. Jetzt stellt Euch mal vor, die
          Polizei h&auml;tte die Wohnung durchsucht und kein Gewaltspiel und kein
          Gewaltvideo gefunden, was h&auml;tten die dann gemacht? W&auml;re die Welt
          f&uuml;r diese Leute untergegangen?</P>

          <P>Mir zumindest h&auml;ngt es langsam zum Hals heraus, dauernd die selben
          Argumente zu h&ouml;ren, k&ouml;nnen die Psychologen nicht akzeptieren dass
          wenn einer Amok laufen will, er das auch macht, ob nun mit oder ohne Spiele
          und Videos. Dieser Kerl hatte diese Morde sowieso vor, nur leider
          orientierte er sich etwas an dem Spiel "Counterstrike", er wollte sich wohl
          einen "guten" Plan zurechtlegen und dabei war ihm dieses Spiel eingefallen!
          Wenn durch so einem die Spiele, in denen geschossen wird, verboten werden,
          dann m&uuml;ssen auch die Nachrichten verboten werden. In den Nachrichten
          die Kriege und die vielen Toden sind echt und stumpfen die Menschheit
          langsam ab!</P>

          <P>Als vor 100 und mehr Jahren einige Menschen Amok liefen lag das wohl
          auch an den Spielen? Ach so, die Steinzeitmenschen hatten ja schon
          Gewaltdarstellungen an den W&auml;nden ihrer H&ouml;hlen und deshalb gingen
          sie immer los und brachten alles um was ihnen vor die Keule kam:-) Wenn man
          diesen "Irren" gut kannte, hat man sicherlich bemerkt, dass an ihm etwas
          nicht stimmte, aber dar&uuml;ber machen sich seine Familie und Bekannten
          erst jetzt Gedanken, aber jetzt ist es zu sp&auml;t.</P>

          <P>Meiner Meinung nach will man der &Ouml;ffentlichkeit so schnell wie
          m&ouml;glich einen S&uuml;ndenbock servieren, die Familie des "Irren" macht
          man nicht verantwortlich, weil die schon genug &Auml;rger und Trauer zu
          verarbeiten haben. Die Politik und die Lehrer wollen auch nicht Schuld
          sein, also nimmt man etwas, was sich nicht wehren kann und das sind nunmal
          Filme, Spiele und nat&uuml;rlich noch die rechte Gesinnung, die ja seit
          einiger Zeit immer dann gebraucht wird, wenn man einen Dummen sucht!</P>

          <P>Wenn unsere Politiker zu doof sind unseren Kindern und Jugendlichen eine
          Zukunftsperspektive zu bieten, dann kann ich denen auch nicht helfen. Da
          der "Irre" ohne Abschluss aus der Schule geworfen wurde, dachte er wohl,
          dass er nie eine Arbeit finden wird, die Anspr&uuml;che unserer
          Gesellschaft sind so hoch, dass kaum einer ohne Schulabschlu&szlig; eine
          Chance hat in seinem Leben zu etwas zu kommen. Die Politiker sollten
          unseren Kindern und Jugendlichen zeigen, dass sie wichtig sind (nicht die
          Politiker), ernst genommen werden und als Deutsche in Deutschland nicht
          daf&uuml;r herhalten m&uuml;ssen, was unsere Ahnen im letzten Krieg
          verschuldet haben. Wenn unsere Nachkommen dauernd daf&uuml;r bestraft
          werden, dass sie Deutsche sind und nicht verstehen, dass sie ohne eigene
          Schuld zur Rechenschaft gezogen werden, m&uuml;ssen sie auch irgendwann
          ausrasten !!! (Dies f&uuml;hre ich mal als einen der vielen Gr&uuml;nde
          auf, die mir immer wieder zu Ohren kommen.) Dann zeigen die Politiker jedem
          Menschen noch, dass sie es sehr gut schaffen durch Betrug und L&uuml;gen zu
          Reichtum und Erfolg zu kommen, das sind echt sehr gute Beispiele f&uuml;r
          unsere Kinder!</P>

          <P>Jemandem zu unterstellen er sei "Rechts", nur weil er nicht die Meinung
          hat wie die meisten anderen Leute, ist auch schon zur Mode geworden,
          haupts&auml;chlich in den Medien. Die Meinung der Medien wird dann von
          Leuten &uuml;bernommen die nicht klug genug sind andere Argumente zu
          &auml;u&szlig;ern, immer wenn denen keine Argumente mehr einfallen, sagen
          sie: "Der muss rechtsradikal sein, da er nicht meine Meinung hat"! Das sind
          aber alles Sachen die unsere Kinder nicht verstehen k&ouml;nnen, aber sie
          werden diese Methoden irgendwann &uuml;bernehmen und ob das gut ist,
          m&ouml;chte ich mal bezweifeln. Auch ist es nur erlaubt &uuml;ber das
          eigene Land und die eigenen Leute zu meckern, &uuml;ber Fremde meckert
          keiner mehr, auch wenn er im Recht w&auml;re, wie soll das noch einer
          verstehen???</P>

          <P>Sehr oft unterhalte ich mich mit Kindern/Jugendlichen und bemerke, dass
          sie sich immer fr&uuml;her &uuml;ber die Politik und ihre eigene Zukunft
          Gedanken machen, auch geben sie sich immer fr&uuml;her auf und sagen solche
          Sachen wie: "Die Rente werde ich doch sowieso nicht erleben!" Oder: "Arbeit
          werde ich bestimmt nicht finden!" Auch merkt man an ihrem Verhalten, dass
          ihnen immer &ouml;fter alles egal ist.</P>

          <P>Zu diesem Thema habe ich mich schonmal im Starmag ausgelassen und ich
          bleibe bei meiner Meinung, die Psychologen sollten entweder ruhig bleiben
          oder den Tatsachen ins Auge schauen. Wenn jemand noch ganz richtig im Kopf
          ist, dann kann er auch zwischen Spielen, Videos und der Realit&auml;t
          unterscheiden, wenn jemand das nicht kann, ist er reif f&uuml;r die
          Klapsm&uuml;hle!!! Oder sehe ich da etwas falsch?</P>

          <P>Stellt Euch mal vor Ihr w&uuml;rdet ein Spiel spielen in dem Ihr Autos
          baut und diese in den Handel bringen m&uuml;sst, wie in "Oldtimer". Nachdem
          Ihr dieses Spiel lange genug gespielt habt, geht Ihr los und sucht Euch
          eine Lehrstelle in einem Autohaus oder Ihr verkauft das Auto Eurer
          Verwandschaft und macht lauter Unfug in dieser Richtung, so wie in dem
          Spiel! Fr&uuml;her oder sp&auml;ter k&auml;men die wei&szlig;en M&auml;nner
          mit der viel zu gro&szlig;en Jacke und w&uuml;rden Euch mitnehmen !!!
          :-)</P>

          <P>Leider k&ouml;nnte ich zu diesem Thema noch viel mehr schreiben, aber
          das lasse ich mal lieber, es w&uuml;rde zu sehr in die Politik eingehen und
          dann w&uuml;rde ich wieder &uuml;berall anecken und das wollen wir doch
          nicht, oder?</P>

          <P>Tsch&uuml;&szlig;: Poldi</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

