<!-- saved from url=(0022)http://internet.e-mail -->
<HTML>
<HEAD>
<TITLE>Die NoCover Story</TITLE>
<meta name="keywords" content="Die NoCover Story">
</HEAD>
<BODY TEXT=black link=blue alink=red bgcolor=white>

<P>
<BR>
<P>
<CENTER>
<H2><B>Die NoCover Story </B></H2>
<SMALL> </SMALL>
</CENTER>
<P>
<BR>
<P>
<CENTER>
<TABLE border=0 width="90%" cellpadding=5><TR><TD>

Ein Jubil&auml;um ist wieder einmal angesagt. Die 100. Ausgabe der NoCover ist erschienen
und langsam ist es einmal an der Zeit, die Geschichte der NoCover zu schreiben. Also halten
wir uns nicht lange mit Vorreden auf und fangen einfach gleich an:
<P>
<B>Am Anfang war ein Club</B>
<P>
Ganz am Anfang der Geschichte steht der TCP Computerclub. Es handelte sich dabei um
einen Amiga/C64 Club, der schon damals auf dem Prinzip "User helfen User" aufgebaut
war und vor mir gegr&uuml;ndet wurde.
<P>
Es dauerte nicht lange und ich machte die Bekanntschaft mit Michael, dem Gr&uuml;nder des APC Clubs.
Ich hab' ehrlich gesagt nicht mehr die geringste Ahnung, wie wir uns kennen gelernt haben, aber
das ist ja auch nicht unbedingt wichtig :) Auf jeden Fall hatten wir irgendwie die gleiche Wellenl&auml;nge
was Amiga-Clubs betraf und so stand einer Zusammenarbeit nichts im Wege.
<P>
Obwohl der APC ein Club mit Hauptthema Amiga und Amstrad war, wurde
nach einigen Treffen eines sehr schnell klar:
<P>
Beide Clubs sollten zusammenarbeiten, um den Usern mehr bieten
zu k&ouml;nnen. So wurde aus dem TCP und APC der APC &amp; TCP Computerclub.
Michael vom APC war auch der Herausgeber der Amiga Fire, welches vor der NoCover-Zeit dann
schnell das Clubmagazin des APC &amp; TCP wurde.
<P>
Michael und ich hatten uns die Arbeit f&uuml;r den Club so gut wie es ging aufgeteilt.
Michael k&uuml;mmerte sich um das Erstellen der Amiga Fire und ich organisierte die Mitgliederverwaltung sowie
das Verschicken des Club-Magazines.
<P>
Es dauerte nicht lange und es kam ein weiterer Club dazu, den Nils S. leitete. Peinlicherweise muss
ich zugeben, dass ich nicht mehr wei&szlig;, wie der Club sich &uuml;berhaupt nannte. Irgendwie ist mir der Name
Chaos-Computerclub in Erinnerung, aber beschw&ouml;ren k&ouml;nnte ich das nicht.
Allerdings haben wir uns relativ schnell wieder von Nils getrennt, da von seiner Seite im Grunde nur hei&szlig;e Luft kam
und einige Sachen abgelaufen sind, die man nicht unbedingt in einer Partnerschaft haben
sollte. Das Ganze hatte dann auch noch einige rechtliche Folgen... aber darauf will ich hier nicht genauer
eingehen. Nils ist dann sowieso spurlos von der Oberfl&auml;che verschwunden.
<P>
Nach kurzer Zeit hatte Michael keine Zeit und Lust mehr an der Clubarbeit und stellte das Magazin
Amiga Fire ein und schied aus dem Club sowie aus der Amiga-Scene aus. Somit stand der APC &amp; TCP erstmal ohne Clubmagazin
und mit mir alleine da. Das sollte allerdings nicht lange der Fall sein. J&uuml;rgen, der SysOp der Mailbox Another World, gr&uuml;ndete zur gleichen
Zeit das Magazin NoLimit, welches genau wie die Amiga Fire und sp&auml;ter auch die NoCover mit dem
genialen Programm Magnetic Pages erstellt wurde.
<P>
<B>Der Vertrieb</B>
<P>
Neben den ganzen "Club-Geschichten" gab es aber auch noch viele andere Ereignisse.
Ich lernte &uuml;ber den Club viele Programmierer kennen, die von diversen Publishern ziemlich
entt&auml;uscht waren. Also habe ich nicht lange nachgedacht und ein Gewerbe mit dem Namen
APC &amp; TCP Vertrieb gegr&uuml;ndet. Wichtig ist, dass der Club und der Vertrieb immer zwei
verschiedene Sachen waren! Es wurde dann auch sehr bald unser erstes Spiel 1990 und
unsere erste Anwendung Databench ver&ouml;ffentlicht. Das Konzept des Vertriebes ist bis heute erfolgreich
und inzwischen wurden weit mehr als 40 kommerzielle Amiga-Titel ver&ouml;ffentlicht.
<P>
<table border=1 align=right bgcolor="#a0a0a0">
<TR><TD>
<CENTER>
S&auml;mtliche Ausgaben der NoCover<BR>
befinden sich auf der<BR>
InfoCD von APC &amp; TCP.<BR>
</CENTER>
</TD></TR></TABLE>
<P>
<B>NoLimit</B>
<P>
Aber zur&uuml;ck zur NoCover-Geschichte: Schnell kamen wir zu einer Einigung, dass die NoLimit zum "unoffiziellen" Clubmag des APC &amp; TCP werden sollte.
Nat&uuml;rlich fingen unsere Clubmitglieder sofort an, Artikel zu schreiben und die erste Ausgabe
der NoLimit war ein voller Erfolg. Nur leider hielt der J&uuml;rgen absolut nichts von P&uuml;nktlichkeit. Nachdem
von uns unz&auml;hlige Artikel f&uuml;r die zweite Ausgabe der NoLimit eingeschickt wurden und nach mehreren
Monaten immer noch keine zweite Ausgabe erschienen ist, habe ich zusammen mit einigen Clubmitgliedern mehr
oder weniger in einer Nacht-und-Nebel-Aktion die NoCover gegr&uuml;ndet. Innerhalb von wenigen Tagen wurde die erste
Ausgabe der NoCover erstellt und an rund 100 Clubmitglieder verschickt. Nat&uuml;rlich wurde sie auch in der
Clubmailbox High Voltage und im eigenen Netz Alcatraz ver&ouml;ffentlicht.
<BR>&Uuml;brigens: Von der NoLimit ist niemals eine zweite Ausgabe erschienen.
<P>
Au&szlig;erdem hatte ich die Schnautze von den so genannten Partnerschaften und Zusammenarbeit absolut voll.
Ich entschloss mich, den Club komplett neu unter dem Namen APC &amp; TCP zu gr&uuml;nden. Auf jede Art von Partnerschaft
verzichtete ich und nahm das Zepter komplett allein in die Hand. Das passte zwar einigen Usern nicht, aber
nach dem, was alles in der Vergangenheit abgelaufen ist, wollte ich mich nicht mehr auf irgendwelche
dubiose Partner einlassen. Nie wieder, war mein Motto und daran habe ich mich bis heute gehalten.
<P>
<B>Die erste NoCover</B>
<P>
Die erste Ausgabe der NoCover erschien dann am 1.2.1994 und damals war es unser Ziel, alle 6 Wochen eine neue Ausgabe
erscheinen zu lassen. Die Resonanz der User war aber so extrem gut, dass bereits nach wenigen Ausgaben die
Erscheinungsweise auf monatlich umgestellt wurde. Aber nicht nur das. Bereits ab der 6. Ausgabe erschien die NoCover
dann auf zwei Disketten. Damals gab es noch so viele "Schreiberlinge", dass wir grunds&auml;tzlich bei jeder Ausgabe Artikel
auf sp&auml;tere Ausgaben verschieben mussten, weil die 2 Disketten einfach voll waren. Ich hatte damals echt das Problem, dass
wir einfach keinen Platz hatten, um alle Artikel zu ver&ouml;ffentlichen. Es gab dann nat&uuml;rlich viele &Uuml;berlegungen, wie man diesen
Umstand verbessern k&ouml;nnte. Es gab &uuml;berlegungen, die NoCover zum Beispiel auf 3 Disks oder sogar auf CD-ROM zu ver&ouml;ffentlichen.
<P>
Aber aus Kostengr&uuml;nden wurde das schnell wieder verworfen. Das Hauptproblem waren dabei nicht einmal unbedingt die Disk- oder
CD-ROM-Kosten, sondern einfach die Portokosten. Das Porto f&uuml;r 2 Disketten kostete damals DM 1,30. F&uuml;r 3 Disketten oder eine CD-ROM
h&auml;tten wir satte DM 3,- f&uuml;r das Porto berappen m&uuml;ssen. Bei 12 Ausgaben im Jahr w&auml;ren das schon allein
satte DM 36,- nur f&uuml;r das Porto gewesen. Dazu noch die Kosten f&uuml;r andere Umschl&auml;ge, Produktionskosten usw. und wir w&auml;ren ganz schnell
auf einen Abopreis von DM 80,- gekommen. Wir waren der Meinung, dass dies ein Preis w&auml;re, den niemand zahlen w&uuml;rde.
Und so blieben wir bei der 2-Disketten-Version.
<P>
<CENTER>
<img src="nocoverstory1.jpg">
<BR>Das Inhaltsverzeichnis der ersten NoCover.
</CENTER>
<P>
Lange Zeit haben wir dann das Anzeige-Programm Magnetic Pages benutzt. Magnetic Pages war ein geniales Anzeige-Prgramm f&uuml;r die NoCover.
Aber leider ist das Erstellen eines DiskMags mit diesem Programm absoluter Horror. Deswegen
habe ich nach rund 40 Ausgaben versucht, ein neues, eigenes Anzeigeprogramm f&uuml;r die NoCover
zu bekommen. Schnell hatte ich auch den Programmierer Markus P&ouml;llmann
(bekannt durch Flyin High, Ph&ouml;nix usw.) &uuml;berredet, uns dabei zu helfen. Aber Markus hatte leider auch
nicht beliebig viel Zeit f&uuml;r die Programmierung und so wurde nach einiger Zeit bechlossen,
dass die NoCover in HTML erscheinen soll. Gesagt, getan. Seit der Ausgabe 50 ist die NoCover
dann in HTML erschienen. Viele User finden noch bis heute, dass diese Ma&szlig;nahme nicht die richtige war.
Aber eine andere Alternative gab es leider nicht. Au&szlig;erdem wurde zu der Zeit das Internet auch immer
popul&auml;rer und nat&uuml;rlich hatten auch wir eine Homepage, wo wir die NoCover anbieten wollten.
Das Internet ist meiner Meinung nach auch der Grund, warum in den letzten 20 Ausgaben der NoCover immer
weniger Artikel erschienen sind.
<P>
Mitte 1996 bin ich dann schwer erkrankt, woran sich bis heute leider nichts Wesentliches ge&auml;ndert hat.
Ich habe zu der Zeit mehr Zeit bei &Auml;rzten und in Krankenh&auml;usern verbracht als zu Hause.
Au&szlig;erdem hatte ich mir das Projekt Amiga Future auferlegt und der Vertrieb kostete mich auch sehr
viel Zeit. Ich hatte einfach zu viele Projekte am Laufen und
nebenbei arbeitete ich auch noch als Redakteur bei der Amiga Games, Amiga Magazin und diversen anderen.
<P>
Die NoCover war ein Projekt, das mich extrem viel Zeit und auch Geld kostete. Gewinn habe ich mit dem
Mag niemals gemacht und da ich meinen eigentlichen Beruf wegen Krankheit auch nicht
mehr aus&uuml;ben konnte, musste eine Entscheidung her.
<P>
<B>Soll die NoCover eingestellt werden?</B>
<P>
Ich hatte die Wahl, die NoCover entweder einzustellen oder an einen f&auml;higen User abzugeben.
Aber die NoCover war, wie man so sch&ouml;n sagt, mein Lieblingskind.
Also habe ich lange gesucht und schlie&szlig;lich Kilian gefunden, der schon lange f&uuml;r die
NoCover sehr gute Artikel geschrieben hat. Ein paar Anrufe und E-Mails sp&auml;ter und ich hatte Kilian
&uuml;berredet, dass er die NoCover weiterf&uuml;hren soll.
<P>
Die Ausgabe 90 war dann die letzte Ausgabe, die von mir erstellt wurde. Mit der Ausgabe 91 &uuml;bernahm
dann Kilian das Kommando &uuml;ber die NoCover.
<P>
<B>Die Gegenwart</B>
<P>
Seit dem Tag gab es von mir eigentlich nichts mehr in der NoCover zu lesen. Das liegt
aber nicht daran, dass ich keine Lust mehr habe oder die NoCover schlecht finde.
Es liegt einfach daran, dass ich weiterhin schwer krank bin und meine Zeit einfach extrem einteilen muss.
Das war auch der Grund, warum der APC &amp; TCP Computerclub am 17.10.2001 aufgel&ouml;st wurde.
Inzwischen k&uuml;mmere ich mich nur noch um den APC &amp; TCP Vertrieb und um die Amiga Future.
<P>
<table border=1 align=right bgcolor="#d0d0d0">
<TR><TD>
<B>Ein paar Fakten:</B>
<BR><UL>
<LI> Erscheinungstermin NoCover #01: 1.2.1994.
<LI> NoCover #90 war meine letzte Ausgabe.
<LI> Ab NoCover #91 &uuml;bernahm Kilian das Steuer.
<LI> Inzwischen sind 100 Ausgaben erschienen.
<LI> Urspr&uuml;ngliches Anzeigeprogramm:<BR>Magnetic Pages
<LI> Ausgabe 1-19 Public Domain.
<LI> Ausgabe 20-90 (c) gesch&uuml;tzt.
<LI> Ausgabe 91 bis jetzt Freeware.
<LI> Am 17.10.2001 wurde der Club aufgel&ouml;st.
<LI> Am 11.5.1992 wurde der Vertrieb gegr&uuml;ndet.
<LI> APC stand f&uuml;r Amiga Power Club.
<LI> TCP stand f&uuml;r The Commodore Pirates.
<LI> Wurde sp&auml;ter umbenannt in<BR>Amiga Personal Computer &amp;<BR>Teamwork Computerclub Programming.
</UL>

</TD></TR></TABLE>
<P>Jetzt ist nun die 100. Ausgabe der NoCover erschienen und ich hoffe, dass noch viele Ausgaben der
NoCover erscheinen werden.
<P>
Ich glaube, man kann die NoCover mit ruhigem Gewissen als einen wesentlichen Teil der Amiga-Geschichte
bezeichnen, da sie gro&szlig;en Einfluss auf den Amiga-Markt und viele Geschehnisse hatte.
Viele ehemalige Redakteure der NoCover schrieben bzw. schreiben bei bekannten Printmedien.
Viele Programmierer wurden erst durch die NoCover bekannt. Und die AmigaAktuell, die wohl
jeder kennen wird, wurde in der NoCover gegr&uuml;ndet. Viele andere Disk- und Online-Magazine haben sich die
NoCover als Vorbild genommen, aber kaum eines hat sich so lange wie dieses Mag auf dem Markt behaupten k&ouml;nnen.
<P>
Es gibt nat&uuml;rlich noch unz&auml;hlige Beispiele, was alles durch die NoCover entstanden ist.
W&auml;re doch eigentlich eine sch&ouml;ne Idee, wenn einmal einige User einen kleinen Artikel
schreiben w&uuml;rden, welchen Einfluss die NoCover auf sie selbst hatte. Das w&auml;re dann auch gleich
eine ganze Menge an Stoff f&uuml;r die n&auml;chsten Ausgaben der NoCover.
<P>
Ich verstehe auch nicht so ganz, warum immer weniger User f&uuml;r ein Mag wie die NoCover schreiben.
Sicher, das Internet ist wesentlich schnelllebiger als ein monatlich erscheinendes Mag. Aber
es ist etwas ganz anderes, in einem Mag etwas zu ver&ouml;ffentlichen als irgendwo auf einer Homepage.
Jeder, der schon einmal aktiv an einem Mag mitgerabeitet hat wei&szlig; was ich meine...
<P>
In der Geschichte der NoCover gab es auch ungew&ouml;hnliche Aktionen.
<P>
Firmen wollten zum Beispiel Testberichte ihrer Proukte verhindern (was niemals gelang) oder PD-H&auml;ndler kamen auf die
Idee, die NoCover f&uuml;r DM 10,- zu verkaufen. Letzteres habe ich dann auf einfache Art und Weise
unterbunden. Die NoCover 19 war die letzte Ausgabe, die als Public Domain erschien. Alle Ausgaben
danach habe ich urheberrechtlich, sprich (c) gesch&uuml;tzt. Das Kopieren und Weiterverbreiten der
NoCover war damit verboten und ich habe auch alle Zuwiderhandlungen strafrechtlich verfolgt.
Nat&uuml;rlich wollte ich kein Geld damit verdienen, sondern nur verhindern, dass sich diverse H&auml;ndler
mit der Arbeit der Redakteure bereichern. Ich vergab dann kostenlose Lizenzen an H&auml;ndler, Mailboxen und
User, die einen vern&uuml;nftigen Verkaufspreis f&uuml;r die Disketten verlangten. Seit der Ausgabe 91 ist die NoCover
wieder Freeware.
<P>
Ich m&ouml;chte mich an dieser Stelle auch bei allen Usern bedanken, die an der NoCover
mitgearbeitet haben. Ohne euch w&auml;re die NoCover niemals so erfolgreich gewesen!!!!
<P>
Ich w&uuml;nsche euch allen viel Spa&szlig; mit der NoCover und hoffe, dass sie uns noch lange erhalten bleiben wird,
<P>
Andreas Magerl
<P>

<P>
<center>
<table border=1 bgcolor="#c0c0c0" cellpadding=5>
<TR>
<TD>
<CENTER>
<BIG>Editorial der NoCover #01</BIG>
<P>
Tja, hier sollte ich eigentlich so 'ne Art Vorwort f&uuml;r die NoCover<BR>
schreiben. Ich hab' blo&szlig;, ehrlich gesagt, nicht die geringste Ahnung,<BR>
was ich da jetzt schreiben soll.<BR>
<P>
Also, die NoCover ist entstanden, weil viele Mitglieder endlich<BR>
ein 100% eigenes Clubmagazin haben wollten. So, Ihr wolltet es haben,<BR>
und hier ist es nun! Ich hoffe, es gef&auml;llt Euch.<BR>
<P>
Mit der NoLimit hatten wir ja das Problem, da&szlig; bis dato noch nicht die<BR>
2. Ausgabe erschienen ist. Warum, d&uuml;rft ihr mich nicht fragen.<BR>
Texte sind ja gen&uuml;gend von Euch eingegangen und ich habe sie<BR>
sofort an den J&uuml;rgen weitergereicht. Naja, als Ersatz haben wir ja jetzt<BR>
die NoCover, die f&uuml;r die NoLimit-Abos herausgeschickt wird.<BR>
<P>
Die NoCover wird 100%(!!) alle 6 Wochen erscheinen.<BR>
Aber dazu brauchen wir nat&uuml;rlich auch Eure Unterst&uuml;tzung.<BR>
Wir brauchen Texte massenweise. Was Ihr da schreibt, ist im Grunde<BR>
eigentlich egal, solange es irgendwie interessant ist.<BR>
<P>
Besonders gute Artikel &uuml;ber Anwendungsprogramme werden von uns noch<BR>
gesucht.<BR>
<P>
Au&szlig;erdem bitten wir alle Grafiker unter Euch, uns doch ein paar Pics<BR>
zu den verschiedenen Rubriken zu zeichnen, damit die NoCover<BR>
auch grafisch etwas besser dasteht. (Bitte max. 16 Farben verwenden.)<BR>
<P>
An dieser Stelle m&ouml;chte ich mich noch einmal bei allen Redakteuren<BR>
bedanken, die teilweise Nachtschichten eigelegt haben, damit die<BR>
1. Ausgabe der NoCover p&uuml;nktlich erscheinen tut.<BR>
<P>
Ich hoffe, da&szlig; sich noch viele Schreiberlinge finden werden, damit wir<BR>
weiterhin auch p&uuml;nktlich die NoCover herausbringen k&ouml;nnen.<BR>
<P>
Und nat&uuml;rlich hab' ich jetzt gleich wieder 'ne gro&szlig;e Frage an Euch.<BR>
Auf den n&auml;chsten 2 Seiten sind ein paar nette Pics. Sollen wir diese<BR>
Bildchen zur Bewertung der Tests verwenden? Sozusagen als Hitstern<BR>
oder so &auml;hnlich??? Schreibt mir doch bitte so schnell wie m&ouml;glich<BR>
Eure Meinung dazu!!<BR>
<P>
So, und das war 'nen wunderbares trockenes Editorial.<BR>
Irgendwie kann ich heute keine guten Texte mehr schreiben. Ist wohl<BR>
schon etwas sp&auml;t und ich sollte lieber mal etwas an der Matratze horchen.<BR>
<P>
Also viel Spa&szlig; bei der ersten Ausgabe der NoCover und erwartet bitte<BR>
nicht zuviel (Aller Anfang ist schwer!),<BR>
<P>
Andreas<BR>
<P>
</CENTER>
</TD></TR></TABLE>
<P>


</CENTER>

</TD></TR></TABLE>
<BR>
<P>
<BR>
</CENTER>
<BR><P>

<HR>
(c) by APC&amp;TCP, Andreas Magerl  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<SMALL>Amiga is a registered trade mark of Amiga Inc.</SMALL>

</BODY>
</HTML>
