<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <!-- Author = Wolf Zimmer -->

    <TITLE>Heute ist der TEURO am drannsten</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Der TEURO</B></FONT></P>

          <P><IMG src="st_teuro1.gif" width="275" height="275" alt= "Teuro"
          align="left" hspace="6"> Heute m&ouml;chte ich einmal etwas &uuml;ber den
          Teuro reden. Das Bild h&auml;tte ich kleiner machen k&ouml;nnen, dann
          w&auml;re es sch&auml;rfer herausgekommen, aber einem gro&szlig;en Thema
          steht auch ein gro&szlig;es Bild zu und dabei hat wohl die Qualit&auml;t
          etwas gelitten und mein Werk mittels PPaint 7 ist mir halt nicht so ganz
          gelungen. Angeregt &uuml;ber dieses Thema zu schreiben wurde ich durch
          diverse TV-Sendungen und zuletzt durch die Website
          <B>"www.focus.de/teuro"</B>. Diese neue M&uuml;nze hatte ich dann
          irgendeinmal auf dem Bildschirm gesehen und so habe ich mir von der Website
          "bankenverband.de" ein Abbild des Euro in der Gr&ouml;&szlig;e 85&times;85
          gezogen und anschlie&szlig;end bearbeitet.</P>

          <P>Wenden wir uns aber dem origin&auml;ren Thema zu. Jeder hat irgendwie
          den Verdacht, dass doch alles teurer geworden ist. Das f&auml;ngt schon
          beim Umrechnen von DM auf EURO an und dann aufrunden, damit wieder eine
          glatte Summe herauskommt. Oder an der Tankstelle, fr&uuml;her ging der
          Preis immer um einen bis drei Pfennige in die H&ouml;he, nun sind es Cent
          im gleichen Umfang also fast das doppelte. Alle angesprochenen Politiker
          erkl&auml;ren kategorisch, dieses stimme nicht. Focus ist dem nun gezielt
          nachgegangen und hat immense Vorkommnisse gefunden, dass es doch so
          ausschaut. Als Beispiele m&ouml;gen diese reichen:<BR clear="all"> </P>
          <HR>

          <P><IMG src="st_teuro2.gif" width="64" height="23" alt= "Focus"
          align="left" hspace="6"> Zwei Euro f&uuml;r eine Salatgurke, drei Euro
          f&uuml;r ein kleines Bier, 50&nbsp;Euro f&uuml;r den Herrenhaarschnitt?
          FOCUS Online sucht alle Abzocker, die bei Einf&uuml;hrung des neuen Geldes
          kr&auml;ftig zugelangt haben. Verraten Sie uns im Fragebogen Ihren
          gr&ouml;&szlig;ten Teuro-&Auml;rger und wie Sie sich gegen die Preistreiber
          wehren.</P>

          <P>Die meisten merken es beim t&auml;glichen Einkauf: <B>Viele H&auml;ndler
          haben die neue W&auml;hrung genutzt, um an der Preisschraube zu
          drehen.</B></P>

          <P>Aber selbst <B>St&auml;dte und
          Gemeinden gehen mit schlechtem Beispiel voran</B>&nbsp;- wie Mainburg in
          der N&auml;he von M&uuml;nchen.<BR> &raquo;Warmduscher m&uuml;ssen
          k&uuml;nftig mehr zahlen&laquo;, meldete die dortige Presse zum
          Jahreswechsel. Der Stadtrat passte die Geb&uuml;hrens&auml;tze im Freibad
          an die neue W&auml;hrung an&nbsp;- mit Folgen beim Duschen: Der Preis stieg
          von vorher 50&nbsp;Pfennig auf 30&nbsp;Cent, genau umgerechnet w&auml;ren
          gut 25&nbsp;Cent herausgekommen. Die Stadtv&auml;ter rechtfertigten den
          Preissprung von &uuml;ber 17&nbsp;Prozent: &raquo;Der Grund hierf&uuml;r
          ist relativ einfach: <B>Es gibt keine 25-Cent-, wohl aber eine
          30-Cent-M&uuml;nze.</B>&laquo; Da hatte der Stadtrat beim neuen Kleingeld
          wohl nicht ganz genau hingesehen&nbsp;...</P>

          <P><B>Informieren auch Sie uns &uuml;ber Ihre &auml;rgerlichsten
          Erfahrungen mit h&ouml;heren Europreisen</B>&nbsp;dazu m&uuml;ssen Sie nur
          den Fragebogen <FONT color="#0000ff">downloaden</FONT> und ihn am PC
          ausf&uuml;llen. Dann auf &raquo;absenden&laquo; klicken - fertig.</P>

          <P>Die <B>meisten Beutelschneider fanden unsere User beim t&auml;glichen
          Einkauf und in der Gastronomie.</B> Doch auch andere &uuml;ben sich in
          &raquo;kreativer&laquo; Preisgestaltung. Ob ein St&uuml;ckchen Kuchen
          f&uuml;r 3,50&nbsp;Euro (auf Sylt) oder eine Hamburger Hafenrundfahrt
          (Anstieg von 15&nbsp;Mark auf neun Euro)&nbsp;- so mancher dreht
          hemmungslos an der Preisschraube. Hier ein paar Beispiele:<BR> Nicht
          L&ouml;wen und Tiger&nbsp;- im Dresdner Zoo strapaziert das Langnese-Eis
          &raquo;Cornetto&laquo; die Nerven der Besucher: Der Preis schoss um
          291&nbsp;Prozent nach oben, von einer Mark auf zwei Euro.</P>

          <P>In Herford m&uuml;ssen sich Bauwillige k&uuml;nftig bescheiden: Die
          Verl&auml;ngerung einer Bauvoranfrage kostet pro Grundst&uuml;ck nicht mehr
          60&nbsp;Mark im Jahr, sondern seit 2002 glatt 50&nbsp;Euro. Begr&uuml;ndung
          f&uuml;r den Aufschlag: Die Landesministerien von Nordrhein-Westfalen
          h&auml;tten die Geb&uuml;hren mit der Euro-Einf&uuml;hrung
          angehoben&nbsp;... In diesem Fall um 63&nbsp;Prozent.</P>

          <P>Wer den Fehler begeht, im Messeparkhaus Stuttgart eine Tageskarte zu
          ziehen, ist mit sechs Euro dabei&nbsp;plus 95,6&nbsp;Prozent zum
          Vorjahrestarif von sechs Mark.</P>

          <P>Ein Besuch im Bad in Krempe (Schleswig-Holstein) sollte gut
          &uuml;berlegt sein: Der Eintritt kletterte von vier Mark auf 2,50&nbsp;Euro
          und sprang damit um 22&nbsp;Prozent nach oben.<BR> Noch toller geht's im
          Seebad von Riegel (Kaiserstuhl) zu: Schwimmer m&uuml;ssen statt fr&uuml;her
          zwei Mark jetzt 1,50&nbsp;Euro berappen&nbsp;47&nbsp;Prozent mehr.</P>

          <P>F&uuml;r das Kilo Tomaten verlangte der Berliner Supermarkt Reichelt vor
          einem Jahr noch 3,99&nbsp;Mark, im Jahr 2002 hat der H&auml;ndler nur die
          W&auml;hrung ausgetauscht: Der Sprung auf 3,99&nbsp;Euro bedeutet
          95,6&nbsp;Prozent Preisanstieg.</P>

          <P> Der Marktkauf Schorndorf hat beim ALWA-Mineralwasser umgestellt: von
          0,7-Liter-Glasflaschen auf Ein-Liter-Mehrwegflaschen. Daf&uuml;r kostet die
          Kiste jetzt vier statt zwei Euro. Angemessen w&auml;re eine Erh&ouml;hung
          auf ca. 2,86&nbsp;Euro, entsprechend dem Mehrinhalt. Das Preisplus von
          1,14&nbsp;Euro bedeutet weitere 39,9&nbsp;Prozent Zuschlag (bezogen auf
          2,86&nbsp;Euro).</P>

          <P>Wei&szlig;kraut bei Edeka in Kirchdorf ist um sage und schreibe
          330&nbsp;Prozent hochgeschnellt: von 2,50&nbsp;Mark auf 5,50&nbsp;Euro.</P>

          <P>Manchen Aral-Autobahn-Tankstellen ist die Halbliterflasche Milch viel
          mehr wert: Der Kunde muss nicht mehr 2,30&nbsp;Mark, sondern 2,30&nbsp;Euro
          berappen. Ein Plus von 95,6&nbsp;Prozent.</P>

          <P> Die Profi-Baum&auml;rkte in Bonn haben ein bisschen geschlampt: Auf
          einer Grillb&uuml;rste f&uuml;r 7,98&nbsp;Euro klebte noch der alte
          D-Mark-Preis&nbsp;er lag bei 9,98&nbsp;Mark und damit um gut
          56&nbsp;Prozent niedriger.</P>

          <P>Die Arbeitsbl&auml;tter f&uuml;r die Unterrichtsmaterialien von
          &raquo;Lernziel K&uuml;ste&laquo; schnellten von vier Mark (im Jahr 2001)
          auf vier Euro (2002) hoch&nbsp;- und bringen dem Klett-Verlag ein sattes
          Plus von 95,6&nbsp;Prozent. Begr&uuml;ndung f&uuml;r diesen
          &raquo;Ausnahmefall&laquo;: Das 35-Seiten-Heft sei &raquo;zu billig
          kalkuliert&laquo; gewesen, man habe die Euro-Einf&uuml;hrung genutzt, um
          dies zu korrigieren. Der Euro selbst sei aber nicht Grund, sondern nur
          Anlass gewesen.</P>

          <P>Das Medikament Ansudor Emulsion 50&nbsp;ml von Hersteller Galderma
          kletterte um 51 Prozent auf 15,44&nbsp;Euro (von 20&nbsp;Mark), Grund: Die
          &raquo;Preise der Lohnhersteller sind gestiegen&nbsp;...&laquo;</P>

          <P> Der s&uuml;ddeutsche Mercedes-Kundendienst Murr verlangt f&uuml;r den
          Austausch einer Sitzheizung im Mercedes E&nbsp;300 statt vorher ca.
          600&nbsp;Mark seit der W&auml;hrungsumstellung 500&nbsp;Euro.

          <IMG src= "st_teuro2.gif" width="64" height="23" alt="Focus" align= "right"></P>

          <HR>

          <P>Um dem Wucher zu entgehen, haben findige Leute herausgefunden, dass man
          auch hier noch gut verdienen kann. So haben sich eine ganze Reihe
          "Anti-Wucher-Sites" etabliert.</P>

          <P>Preisdatenbanken geh&ouml;ren zu den besten Tools f&uuml;r bewusste
          Verbraucher. Online-Preisvergleiche findet man f&uuml;r fast alle Produkte
          und Leistungen: Computer, Audio- und Videoger&auml;te,
          Haushaltsger&auml;te, Tarife f&uuml;r Strom, Telefon und Internet, Reisen,
          Versicherungstarife, Konto- und Kreditkartengeb&uuml;hren. Eine Liste
          verschiedener Preisdatenbanken, nach Produkt- und Servicegruppen sortiert,
          gibt es unter<BR>

          <B>"www.billiger-shopping.de/preisvergleich"</B>,
          <B>"www.guenstiger.de"</B>, <B>"www.preise-suchen.de"</B>,
          <B>"www.kaufenaberwo.de"</B> oder <B>"www.tarifcheck.de"</B>.</P>

          <P>Es gibt aber auch noch die M&ouml;glichkeit Geld zu sparen:
          Schn&auml;ppchenjagd im Netz rentiert sich.

          <UL>
            <LI><B>Rabatte</B> nach Regionen, Branchen und Zielgruppen:
            <B>www.rabatte.de</B></LI>

            <LI><B>Coupons</B> als Verg&uuml;nstigung f&uuml;r Handel und Onlineeinkauf:
            <B>www.raba.tt</B></LI>

            <LI><B>Gratis-Angebote</B>, Warenproben, Gutscheine, Gewinnspiele:
            <B>www.kostenlos.de</B></LI>

            <LI>Links zu Online-Testberichten, die auch &uuml;ber Baugleichheit von
            Marken- und billigeren No-Name-Produkten informieren:
            <B>www.testberichte.de</B></LI>
          </UL></P>

          <P>Dann gibt es noch die Tipps von Profis. Professionelle Preisschn&uuml;ffler
          ermitteln den besten Preis f&uuml;r ein Wunschprodukt, kassieren dabei
          allerdings etwa ein Drittel der Ersoarnisse als Honorar.<BR>

          <B>"www.discountlinks.de"</B>, <B>"www.preisagentur.de"</B>,
          <B>"www.sparpreise.de"</B> und <B>"www.allpreis.de"</B>.</P>

          <P>Es hat sich aber auch schon <B>S&uuml;nderliste</B> der
          Verbraucherzentralen gebildet und zwar anhand von Beschwerden von
          Verbrauchern aus dem gesamten Bundesgebiet, teilweise mit den
          Stellungsnahmen der betroffenden Firmen.<BR>

          <B>"www.preis-wert-forum.de"</B>, <B>"www.vz-nrw.de"</B> und
          <B>"www.vzhh.de"</B>. Aber auch unter <B>"www.stern.de/teuro"</B> und
          <B>"www.bild.t-online.de"</B> gibt es &uuml;ber viele F&auml;lle
          nachzulesen.</P>

        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8" summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

