<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>Mystic-View</TITLE>
  </HEAD>

  <BODY background="ncb_bg3.gif" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Mystic-View V1.04</B></FONT></P>

          <P>Ein absolut hei&szlig;es Bildanzeige-Programm, dieses Teil hatte ich
          schon ewig auf einer AmigaPlus-CD und dachte immer, es w&auml;re nicht so
          besonders, auch weil ich die ganze Zeit Fastview benutzte. Da bei mir aber
          Fastview nicht mit der Grafikkarte zusammenarbeiten will, suchte ich nach
          einem neuen Programm um Bilder einzeln und als Slideshow ansehen zu
          k&ouml;nnen. Gestern am 14.06., als ich die CD-Sammlung
          durchbl&auml;tterte, stie&szlig; ich wieder auf das Programm MysticView und
          diesmal testete ich es richtig, es kann alles was man von einem
          Bildanzeiger erwartet, sogar noch viel mehr!</P>

          <P>Da MysticView mit Datatypes arbeitet, lassen sich alle m&ouml;glichen
          Bilder anzeigen, auch das Speichern der Bilder geht, leider wird dann aber
          nur in dem Format gespeichert, in dem das Bild geladen wurde, in ein
          anderes Format lassen sich die Bilder nicht wandeln.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="0" cellspacing="0" cellpadding="0" summary="">
        <TR>
          <TD><IMG src="tt_mysticview.png" width="521" height="315" alt=""> </TD>
        </TR>
      </TABLE>
    </CENTER>

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P>Wenn ein ganzes Verzeichnis mit Bildern ausgew&auml;hlt wurde, hat man
          die M&ouml;glichkeit mit der Maus auf ein Button vorw&auml;rts zu klicken,
          das Programm so einzustellen, dass man nur auf das aktuelle Bild klicken
          braucht um weiter zu bl&auml;ttern oder eine automatische Slideshow
          ablaufen zu lassen. Auch kann ein Bild in das Fenster gezogen oder auf das
          Appicon geworfen werden. Wollt Ihr eine Slideshow f&uuml;r immer und ewig
          ansehen, dann geht Ihr ins Menu und w&auml;hlt den Punkt "Loop" aus. Ach
          so, f&uuml;r die Slideshow k&ouml;nnt Ihr noch einstellen, wie lange es
          dauern soll bis das n&auml;chste Bild angezeigt wird, zur Auswahl steht:
          None, 0,4 Sec., 1...30 Sec., 1...10 Min.. Die 10 Minuten w&uuml;rde ich
          aber mit Sicherheit nie w&auml;hlen, stellt Euch mal vor Ihr h&auml;ttet
          500 Bilder und die Abst&auml;nde zwischen zwei Bildern w&auml;ren 10 Min.,
          dann w&uuml;rdet Ihr ganze 3,5 Tage brauchen um alle Bilder zu sehen:-)
          Weshalb es dann die M&ouml;glichkeit gibt, 10 Min. einzustellen, ist mir
          schleierhaft, vielleicht h&auml;tte es einen Sinn wenn ein Monitor in einem
          Schaufenster steht und etwas pr&auml;sentiert! </P>
                       

          <P>Die Einstellm&ouml;glichkeiten sind wirklich hervorragend: Das
          Anzeigefenster kann ohne Rahmen im Hintergrund liegen, mit Rahmen im
          Vordergrund, die Gr&ouml;&szlig;e geht von gaaaanz klein bis
          bildschirmf&uuml;llend. Das Fenster l&auml;&szlig;t sich auf einem eigenen
          Screen oder auf der Workbench &ouml;ffnen und f&uuml;r das Aussehen
          k&ouml;nnen die Buttons, die Bild-Infos, die Pfeile, um das Bild zu
          verschieben, wenn es zu gro&szlig; ist und das PIP-Fenster abgestellt
          werden. Das mit dem PIP-Fenster ist ganz lustig, hat aber eigentlich keinen
          Sinn. Wenn man schon das Bild in gro&szlig; sieht, ist es bestimmt nicht
          notwendig es nochmal in klein zu sehen. Wenn dann das Bild geladen wurde,
          kann es horizontal und vertikal verdreht werden, auch kann man es als
          Negativ darstellen lassen.</P>

          <P>Die Buttons, die zur Verf&uuml;gung stehen, falls man sie nicht
          abgestellt hat, bedeuten von links gesehen: Pfeil nach oben = Bild oder
          Verzeichnis laden, Pfeil mit Balken = erstes Bild aus dem Verzeichnis,
          Pfeil nach links = voriges Bild, Pfeil nach rechts = n&auml;chstes Bild,
          dicker Pfeil = Slideshow, Pfeil der sich selbst trifft = Loop, zwei Pfeile
          = Displaymode, Kreuz = Reset. Der Button "Displaymode" ist echt geil, hat
          man ein Bild geladen das zu klein ist, vergr&ouml;&szlig;ert es sich durch
          einen Klick hierauf. Wenn dann das Bild zu gro&szlig; f&uuml;r das Fenster
          ist, erscheinen kleine Pfeile auf dem Bild, damit ersichtlich ist das
          dieses Bild verschoben werden kann!</P>

          <P>Wenn ich jetzt wirklich alles aufz&auml;hlen w&uuml;rde, was mit dem
          Programm machbar ist, sitze ich morgen noch hier und meine Finger
          w&uuml;rden gl&uuml;hen! Aber etwas muss ich noch schreiben, n&auml;mlich
          dass es wirklich schnell beim Laden und anzeigen ist, da der Bildcache von
          klein bis gro&szlig; eingestellt werden kann, brauchen die folgenden Bilder
          nicht so lange um zu erscheinen! Es l&auml;&szlig;t sich auch eine Liste
          der Bildverzeichnisse anfertigen um sie sp&auml;ter laden zu k&ouml;nnen.
          Auf jeden Fall ist dieses Programm ab sofort mein Lieblingprogramm um
          Bilder anzuzeigen!</P>

          <P>Ach du meine G&uuml;te (Ach du Deine G&uuml;te = Ein Schweinchen namens
          Babe), dieses Prog. ist auch schon wieder Shareware und zum Gl&uuml;ck ohne
          Einschr&auml;nkungen oder Nerv-Fenster. Aber hier kann ich nicht sagen ob
          sich eine Registration lohnt, da das Prog. aus dem Jahre 2000 ist und ich
          nie wieder etwas &uuml;ber das Prog. las, falls einer von Euch wei&szlig;
          ob es diesen Timm S."bifat" M&uuml;ller noch gibt und ob er noch Updates
          von MysticView macht, dann sagt mir mal Bescheid. Teuer ist die
          Registrierung nicht, gerade einmal 15DM wollte er zu dieser Zeit und das
          ist dieser "Hammer" wirklich wert...</P>

          <P>Ende und over: Poldi</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

