<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>PCI-Programme</TITLE>
  </HEAD>

  <BODY background="ncb_bg2.jpg" text="#000000" link="#0000ff"  alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <A name="top"></A> 

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P><FONT size="-1">Bildschirm zu <A href= "tt_pciprogs.html"
          target="_top"><B>klein?</B></A> &nbsp; &nbsp; &nbsp; und wieder <A href=
          "javascript:history.back()"><B>r&uuml;ckg&auml;ngig?</B></A> &nbsp; &nbsp;
          &nbsp; oder zur&uuml;ck zur <A href= "index.html"
          target="_top"><B>NoCover?</B></A></FONT></P>

          <P align="center"><FONT color="#000080" size="7">
          <B>PCI-Programme</B></FONT></P>

          <P>Hallo Ihr, ich stelle Euch mal alle PCI-Programme vor, die bei meiner
          Kiste funktionieren. Es gibt leider Programme die zwar f&uuml;r das
          Mediator sind, aber keine Lust haben bei mir zu laufen, die kennen mich
          wohl schon zu gut:-) Da diese Programme meist nur kleine Hilfen im Umgang
          mit der PCI-Hardware darstellen, kann ich leider nicht viel dazu schreiben,
          aber ich hoffe das ich es schaffe das wichtigste zu schreiben. Wenn aber
          noch Fragen offen sein sollten, dann fragt nur und es wird Antworten
          hageln:-) Was Ihr daf&uuml;r braucht, um diese Programme zu nutzen? Einen
          Amiga, TV-Karte, Soundkarte, Grafikkarte und nat&uuml;rlich ein
          Mediator-Board. Viel Speicher und eine schnelle CPU w&auml;ren auch nicht
          schlecht:-)</P>
          <HR size="4">
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="0" summary="">
        <TR>
          <TD>
            <UL type="square">
              <LI><A href="#a1"><B>Medication V1.01</B></A></LI>
              <LI><A href="#a2"><B>Control-TV</B></A></LI>
              <LI><A href="#a3"><B>Remote V.0.04</B></A></LI>
              <LI><A href="#a4"><B>ChannelED</B></A></LI>
            </UL>
          </TD>
          <TD valign="top">
            <UL type="square">
              <LI><A href="#a5"><B>SuperTV V0.4</B></A></LI>
              <LI><A href="#a6"><B>Mixer V1.0</B></A></LI>
              <LI><A href="#a7"><B>VHIStudio-Treiber</B></A></LI>
            </UL>
          </TD>
        </TR>
      </TABLE>
    </CENTER>
    <HR size="4">

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H3 align="center"><A name="a1"><B>Medication V1.01 &nbsp; &nbsp; Author:
          Richard Brooklyn</B></A></H3>

          <P>Dieses Programm ist daf&uuml;r gedacht, alle Einstellungen, die sonst
          &uuml;ber die Tooltypes des Monitortreibers gemacht werden, &uuml;ber eine
          grafische Oberfl&auml;che zu machen. Dadurch das dieses Programm Mui
          benutzt, hat man es Dank der Sprechblasenhilfe leichter die Einstellungen
          zu t&auml;tigen. Es l&auml;sst sich z.B. auch einstellen ob man die
          Grafikkarte &uuml;bertackten m&ouml;chte, wovon ich aber in jedem Fall
          abraten w&uuml;rde, schon allein wegen der gr&ouml;&szlig;eren W&auml;rme
          die dadurch entsteht. Der Frame-Buffer l&auml;sst sich auch einstellen, den
          habe ich meist auf 2 MB stehen, eigentlich kann ich nur schreiben das
          dieses Prog. eine echte Hilfe ist und ich es nicht missen m&ouml;chte, alle
          wichtigen Dinge lassen sich auf einfachste Art einstellen.</P>

          <CENTER> <IMG src="tt_pciprogs1.png" width="504" height="253"
          alt="Medication V1.01"> </CENTER>

          <P>Medication sollte eigentlich noch andere PCI-Karten erkennen, aber bis
          jetzt erkennt es nur die Voodoo Grafikkarten, aber vielleicht &auml;ndert
          sich das noch.</P>

          <P>Gehe nach <A href="#top">oben</A></P>
        </TD>
      </TR>
    </TABLE>
    <HR size="4">

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H3 align="center"><A name= "a2"><B>Control-TV</B></A></H3>

          <P><IMG src="tt_pciprogs2.png" width="156" height="382" alt="Control-TV"
          align="left" hspace="6"> Eigentlich m&uuml;sste dieses Programm "Ami603 TV"
          hei&szlig;en, schlie&szlig;lich steht das im Rahmen des Programms! Leider
          Funktioniert Control-TV nur mit Rexx und wenn ich au&szlig;erhalb des
          Fernsehfensters klicke und dann mit der rechten Maustaste etwas im Menu der
          Workbench ausw&auml;hlen will, verschwindet das Fernsehfenster! Sonst ist
          das Programm ganz gut gemacht, es ist sehr &uuml;bersichtlich und
          funktioniert, bis auf den einen Fehler, sehr gut.</P>

          <P>Um die Sender einstellen zu k&ouml;nnen, muss man das Control-TV-Icon in
          einen Editor laden und dort die Senderzahlen eintragen, was f&uuml;r einen
          Neuling nicht gerade einfach ist, da nicht jeder diese Zahlen kennt! Z.B.:
          ARD = 12148, ZDF = 8052. Gerade bei den Einstellungen sollte an diesem
          Programm noch gearbeitet werden, wie man es richtig macht kann sich der
          Programmierer bei "SuperTV" ansehen. Control-TV wurde schon oft
          &uuml;berarbeitet, ist noch beta und mit etwas Gedult wird alles noch
          besser werden!</P>

          <P>Es ist auch gut das man fast alle Funktionen direkt &uuml;ber Control-TV
          bedienen kann, mit + und - kann das TV-Fenster vergr&ouml;&szlig;ert und
          verkleinert werden, leider geht "Backdrop" nicht richtig, aber mit
          "SuberTV" geht es. Die anderen Funktionen erkl&auml;ren sich eigentlich von
          selbst.</P> <BR clear="all">
           

          <P>Gehe nach <A href="#top">oben</A></P>
        </TD>
      </TR>
    </TABLE>
    <HR size="4">

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H3 align="center"><A name="a3"><B>Remote V.0.04
          &nbsp; &nbsp; Author: Lewis Brunton</B></A></H3>

          <P>Von Remote habe ich die Version 0.04 und sie ist eigentlich ganz gut,
          die Kn&ouml;pfe f&uuml;r die Programme kann man sich selbst malen, mit
          irgendeinem Malprogramm. Bei diesem Prog. werden die Sender in den
          Tooltypes angegeben und m&uuml;ssen die vorgegebenen Namen behalten, wie
          man die Kn&ouml;pfe dann beschreibt, bleibt jedem selbst &uuml;berlassen.
          Das was man noch einstellen kann, ist, wie die Knopfbank angeordnet werden
          soll, entweder horizontal oder vertikal, sonst geht nichts einzustellen!
          Leider ist dieses Prog. nur zum umschalten der Sender gedacht, es hat keine
          weiteren Funktionen, deshalb bin ich hier schon fertig:-(</P>

          <CENTER>
            <IMG src="tt_pciprogs3.png" width="473" height="59" alt="Remote V.0.04">
          </CENTER>

          <P>Gehe nach <A href="#top">oben</A></P>
        </TD>
      </TR>
    </TABLE>
    <HR size="4">

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H3 align="center"><A name="a4"><B>ChannelED</B></A></H3>

          <P>Die Idee dieses Progs. ist nicht schlecht, es benutzt n&auml;mlich
          Skins, aber leider sieht die Oberfl&auml;che so schlecht aus, dass man
          ChannelED lieber keinem zeigt. In den Tooltypes kann eingestellt werden
          welchen Skin man haben m&ouml;chte, welche Farben benutzt werden sollen und
          wie lange es dauern soll bis eine Sprechblase kommt. Beim Start wird
          abgefragt wo sich die Sendereinstellungen befinden und nach einigen
          Sekunden hat man dieses merkw&uuml;rdige Ding auf der Workbench, es
          verunstaltet die ganze Workbench, da mache ich mir immer so viel M&uuml;he
          um die Workbench sch&ouml;n zu haben und dann kommt dieses Teil daher und
          beleidigt die Augen:-)</P>

          <CENTER>
            <IMG src="tt_pciprogs4.png" width="341" height="159" alt="ChannelED">
          </CENTER>

          <P>Die Einstellm&ouml;glichkeiten sind daf&uuml;r super, alles l&auml;sst
          sich einstellen, so z.B.: Audiomode, Signalformat, Fenstergr&ouml;&szlig;e,
          Kontrast, Reset der TV-Karte und so weiter. Da ist auch noch eine digitale
          Anzeige in der man begr&uuml;&szlig;t wird und &uuml;ber alle gemachten
          &Auml;nderungen informiert wird, auch steht beim beenden des Progs. "Good
          bye" dort.</P>

          <P>Gehe nach <A href="#top">oben</A></P>
        </TD>
      </TR>
    </TABLE>
    <HR size="4">

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>

          <H3 align="center"><A name="a5"><B>SuperTV V0.4 &nbsp; &nbsp; Author: Peter
          Gordon</B></A></H3>

          Mein Lieblingsprog., es hei&szlig;t nicht nur SuperTV, das ist es auch! Das
          Beste an diesem Prog. ist die Bedienungsm&ouml;glichkeit direkt am
          Fensterrahmen oder &uuml;ber die Tastatur. Mit den Zahlen schaltet man die
          Programme um, mit p kann man die Pupscreens einstellen, das F ist f&uuml;r
          den Fullscreen gedacht, was hier auch immer gut funktioniert und mit dem ?
          &ouml;ffnet sich das Einstellfenster. Die Einstellungen sind wirklich
          hervorragend, alles l&auml;sst sich einstellen, Brightness, Contrast, Hue,
          Saturation U, Saturation V, Fenstergr&ouml;&szlig;e u.s.w.! Klickt man auf
          einen Sendernamen doppelt, &ouml;ffnet sich ein weiteres Einstellfenster in
          dem der Name, das Formal (PAL, NTSC u.s.w.), die Senderzahl und der
          Audiomode eingestellt werden kann. Mit PLL: + und - hat man die
          M&ouml;glichkeit den Sendersuchlauf zu aktivieren, mit klicken auf + oder -
          wird jeweils die Zahl um 5 h&ouml;her oder niedriger.

        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="0" summary="">
        <TR>
          <TD><IMG src="tt_pciprogs5.png" width="592" height="331" alt="SuperTV V0.4"> </TD>
        </TR>
      </TABLE>
    </CENTER>

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>

          <P>Wenn der Suchlauf benutzt wird, sieht man auch gleich im Fernsehfenster
          das Ergebnis, das gibt es bei keinem anderen Prog. f&uuml;r das Mediator.
          Auch alle anderen Funktionen wirken sich sofort auf das Bild aus, so das
          alles schnell eingestellt werden kann. Jetzt wisst Ihr auch warum es mein
          Lieblingsprog. ist!</P>

          <P>Was jetzt noch fehlt, ist ein Programm mit dem man die M&ouml;glichkeit
          hat alle anderen Sachen auch zu nutzen, so z.B. fehlt mir eine Funktion um
          von Mono auf Stereo zu schalten. Auch Zweikanalton und eine Radiofunktion
          sollte endlich in ein Programm integriert werden. Und zu guter letzt muss
          endlich Videotext unterst&uuml;tzt werden, wof&uuml;r habe ich denn eine so
          gute Karte gekauft, wenn ich nicht einmal die H&auml;lfte der Funktionen
          nutzen kann?!</P>

          <P>Gehe nach <A href="#top">oben</A></P>
        </TD>
      </TR>
    </TABLE>
    <HR size="4">

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H3 align="center"><A name="a6"><B>Mixer
          V1.0</B></A></H3>

          <P>Mixer wird von Elbox auf der Multimedia-CD mitgeliefert, gemacht hat es
          auch der Richard Brooklyn. Mit diesem Prog. stellt man alle Ein- und
          Ausg&auml;nge f&uuml;r die PCI-Karten ein. Unter "Play" werden
          s&auml;mtliche Anschl&uuml;sse gesteuert, unter anderem kann man dort in
          dem Unterpunkt "Microphone" einstellen wie laut das Mikro. sein soll und
          wenn die volle Lautst&auml;rke nicht ausreicht, kann noch der "Mic Boost"
          auf +20db gestellt werden. Alles andere l&auml;sst nur die
          Lautst&auml;rkeregelung zu und noch die M&ouml;glichkeit bestimmte
          Eing&auml;nge aus oder an zu stellen. Die Balance kann man bei beiden
          Men&uuml;s einstellen, nur beim Mikro. ist das zwecklos, da das Mikro.
          sowieso nur in Mono unterst&uuml;tzt wird. Im "Record" Menu wird
          eingestellt wie laut die Ein- und Ausg&auml;nge bei der Aufnahme sein
          sollen und ob sie an oder aus sein sollen! Das war es auch schon mit diesem
          Prog., es ist einfach zu simpel um mehr dar&uuml;ber schreiben zu
          k&ouml;nnen.</P>

          <CENTER>
            <IMG src="tt_pciprogs6.png" width="560" height="399" alt="Mixer V1.0">
          </CENTER>

          <P>Gehe nach <A href="#top">oben</A></P>
        </TD>
      </TR>
    </TABLE>
    <HR size="4">

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H3 align="center"><A name="a7"><B>VHIStudio-Treiber</B></A></H3>

          <P>Seit dem Update 1.12 oder 1.13 gibt es einen VHIStudio-Treiber f&uuml;r
          das Mediator in Verbindung mit einer TV-Karte. Dieser Treiber
          erm&ouml;glicht es von dem TV-Bild einzelne Bilder oder ganze Animationen
          anzufertigen, zwar sind die Bilder nicht so hochaufl&ouml;send wie ich es
          erwartete, aber das soll mal egal sein. Die Animationen werden zwar nicht
          fl&uuml;ssig abgespeichert, sind aber ausreichend um sie im Internet zu
          verwenden. Nachdem eine Animation aufgenommen wurde, kann sie noch in Mpg.
          gewandelt werden, was aber leider so lange dauert, dass es mir keinen
          Spa&szlig; mehr macht! Zur Zeit verwende ich noch die Demoversion,
          schlie&szlig;lich kann ich mich nicht f&uuml;r jedes Prog. registrieren,
          aber sobald ich einige andere Sachen f&uuml;r den Amiga erledigt habe,
          kommt die Registrierung f&uuml;r dieses Prog. dran. Einige
          Einschr&auml;nkungen hat VHIStudio nat&uuml;rlich, sonst w&uuml;rde sich
          keiner registrieren, daher kann es sein das die Qualit&auml;t der Bilder
          nur in der Demo so schlecht ist!</P>

        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="0" summary="">
        <TR>
          <TD><IMG src="tt_pciprogs7.png" width="661" height="373" alt="VHIStudio"> </TD>
        </TR>
      </TABLE>
    </CENTER>

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>

          <P>Sehr gut kenne ich mich noch nicht mit diesem Prog. aus, aber die
          wichtigsten Funktionen kenne ich bereits: Die Bilder lassen sich in
          verschiedenen JPEG Qualit&auml;ten und in verschiedenen Gr&ouml;&szlig;en
          speichern und die Animationen k&ouml;nnen in IFF-Anim, MPEG-I und in
          PPM-Pictures gespeichert werden! Auch k&ouml;nnen die einzelnen Bilder
          einer Animation ver&auml;ndert werden, so das es verschiedene Effekte
          ergibt, z.B.: Nach Schwarz blenden, Disko, &uuml;berblendung und
          &uuml;berflicken. Alles habe ich noch nicht getestet, daf&uuml;r brauche
          ich noch etwas Zeit, da ich dieses Prog. erst seit einigen Tagen auf der
          Platte habe, vorher hatte ich kein Interesse daran!</P>

          <P>Der letzte Fall ist ein gutes Beispiel f&uuml;r alle anderen Firmen:
          Eine Firma wie Elbox schreibt einen Treiber f&uuml;r ein Programm wie
          VHIStudio, die Leute die diesen Treiber nutzen wollen, registrieren sich
          daf&uuml;r und Felix Schwarz bekommt auch etwas Geld. So k&ouml;nnen zwei
          Firmen von ein und der selben Sache einen Vorteil haben, warum machen
          andere Firmen nicht das Selbe? Lieber streiten sie sich und versuchen alles
          im Alleingang, aber sie k&ouml;nnten auch zusammen arbeiten und versuchen
          miteinander dem Amigamarkt ihre Hard- und Software zukommen zu lassen.
          Stellt Euch vor, Elbox, DCE, Haage&amp;Partner, Hyperion und Amiga Inc.
          w&uuml;rden Hand in Hand arbeiten, dann w&auml;re doch alles in Ordnung,
          aber nein, sie bleiben stur und riskieren lieber eine Pleite als eine
          Zusammenarbeit! Ja, Ja, ich wei&szlig; das Amiga Inc. und Hyperion
          zusammenarbeiten, aber das scheint nur das OS4.0 zu beinhalten, Amiga Inc.
          sollten sich f&uuml;r andere Lizensen stark machen, diese Lizensen
          k&ouml;nnten sie dann den anderen Firmen geben und so &uuml;berlebt
          jeder!!!</P>

          <P>Gehe nach <A href="#top">oben</A></P>
        </TD>
      </TR>
    </TABLE>
    <HR size="4">

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>

          <P>Nun bin ich wieder am Ende angelangt, es gab zwar noch ein oder zwei
          Progs., die bei mir funktionierten, aber die kann ich gerade nicht
          finden:-)</P>

          <P>Macht es gut: Poldi</P>

          <P><FONT size="-1">Kein linker Frame? Dann klicke
          <A href="javascript:history.back()"><B>hier</B></A></FONT></P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

