<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>SongPlayer</TITLE>
  </HEAD>

  <BODY background="ncb_bg3.gif" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P><FONT size="-1">Bildschirm zu <A href= "tt_songplayer.html"
          target="_top"><B>klein?</B></A> &nbsp; &nbsp; &nbsp; und wieder <A href=
          "javascript:history.back()"><B>r&uuml;ckg&auml;ngig?</B></A> &nbsp; &nbsp;
          &nbsp; oder zur&uuml;ck zur <A href= "index.html"
          target="_top"><B>NoCover?</B></A></FONT></P>

          <P align="center"><FONT color="#000080" size= "7"><B>SongPlayer
          V1.3</B></FONT><BR> <FONT color="#000080" size="5"><B>Author: Stephane
          Tavenard (Giftware)</B></FONT></P>

          <P>Keine Ahnung ob die Version 1.3 die aktuellste Version ist oder ob
          SongPlayer weiterhin vom Author &uuml;berarbeitet wird, da ich aber schon
          l&auml;ngere Zeit nichts mehr von diesem Progi geh&ouml;rt habe, glaube
          ich, dass die Entwicklung eingestellt wurde. Aber das macht gar nichts,
          denn diese Version, vom Juni 1998, arbeitet hervorragend! Dadurch dass auch
          dieses Progi Mui ben&ouml;tigt, ist der Umgang mit Songplayer und den
          dazugeh&ouml;rigen Einstellungen, sehr einfach.</P>
        </TD>
      </TR>
    </TABLE>
    <CENTER>
    <TABLE border="0" summary="">
      <TR>
        <TD>    
          <IMG src="tt_songplayer.png" width="559" height="331" alt="SongPlayer">
        </TD>
      </TR>
    </TABLE>
    </CENTER>

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P>Was das Ding alles abspielen kann, kaum zu glauben: Von Iff 8SVX,
          &uuml;ber Aiff und AU, bis Wave und Mpeg I,II und III frisst das Teil alles
          was man ihm gibt. Obwohl ich zugeben mu&szlig; das mir das Soundformat "AU"
          unbekannt ist, aber es gibt bestimmt einige die damit etwas anfangen
          k&ouml;nnen! Der 68XXXer und AHI werden verwendet, durch AHI im
          Zusammenhang mit einer Soundkarte, ist die Leistung vollkommen
          ausreichend!</P>

          <P>Zuerst gehen wir einmal in die Einstellungen: Sehr gut ist es das man
          die gesamte Musikdatei in den Ram laden kann, dadurch gibt es keine
          Verz&ouml;gerung beim abspielen. Die Puffergr&ouml;&szlig;e habe ich
          zus&auml;tzlich auf 256Kb gestellt, was zwar nicht notwendig ist, aber es
          ist ja egal:-) Wenn ein Lied geladen wurde, kann man, K&uuml;nstler &amp;
          Album, das Dateiformat und den Dateikommentar anzeigen lassen. Einzelne
          Schalter k&ouml;nnen angezeigt oder weggelassen werden, gerade wie man es
          gerne hat.</P>

          <P>Nat&uuml;rlich sollte auch "AHI benutzen" aktiv sein und der Audiomode
          ausgew&auml;hlt werden, die Puffergr&ouml;&szlig;e bei Audio stellte ich
          auf 6 Sec.. Das Karaoke-Fenster kann auch angezeigt werden, aber ohne den
          Text eines Liedes macht das keinen Sinn. Der Text kann in einem Editor
          geschrieben und abgespeichert werden und mit dem Karaoke-Editor wird der
          Text dann geladen! Die Karaokefunktion habe ich bis jetzt aber noch nie
          richtig genutzt.</P>

          <P>Eine geile Sache ist noch das Indikatorfenster, das an und ausgestellt
          werden kann. In dem Indikatorfenster wird ein VU-Meter, die
          Klangst&auml;rke und ein Spektrum-Analycer angezeigt, wenn nicht einzelne
          Anzeigen abgestellt wurden! Zu guter letzt sollte noch die Qualit&auml;t
          der abgespielten Mpg.-Dateien auf die Erfordernisse eingestellt werden.
          Habt Ihr eine Soundkarte, k&ouml;nnt Ihr alles auf "hohe Qualit&auml;t" und
          "48000Hz Maximalfrequenz" stellen.</P>

          <P>Nun laden wir ein Mpg.-Lied und h&ouml;ren uns die Qualit&auml;t an,
          wenn die Lautst&auml;rke nicht hoch genug ist, habt Ihr die
          M&ouml;glichkeit im Programmfenster auf den Lautsprecherbutton zu klicken
          und dann mit Hilfe des Sliders die Lautst&auml;rke h&ouml;her zu
          stellen.</P>

          <P>Die rechten und linken Lautsprecher k&ouml;nnen mit einem Balanceregler
          eingestellt werden, ganz so wie bei den mei&szlig;ten anderen Progs.!
          W&auml;hrend ein Lied l&auml;uft, hat man die M&ouml;glichkeit die
          Stereoausdehnung und den Audiofilter an- oder auszustellen, zus&auml;tzlich
          kann "Loop" eingestellt werden. Habt Ihr eine ganze Liste an Liedern
          geladen, stehen Euch noch die Funktionen "Zufallswiedergabe" und "Nur
          Introdauer der Lieder abspielen" zur Verf&uuml;gung.</P>

          <P>Ich kann Euch nur empfehlen dieses Progi einmal zu testen, es ist
          wirklich geil, noch geiler w&auml;re aber wenn der PPC auch
          Unterst&uuml;tzung finden w&uuml;rde, aber so ist Songplayer auch schnell
          genug. Die Belastung bei Mpg.II, 160kbps, 44100Hz Stereo, liegt in etwa bei
          50%, bei Mono und weniger kbps liegt die Belastung h&ouml;chstens noch bei
          15 - 25%.</P>

          <P>Da dieses Progi Giftware ist, scheint es dem Author egal zu sein was man
          ihm schickt, dann soll es mir auch egal sein:-)</P>
          <HR>

          <P>Nagut, mir f&auml;llt nichts mehr ein, au&szlig;erdem mu&szlig; ich mit
          diesen Texten bald mal fertig werden, also h&ouml;re ich hier auf und
          w&uuml;nsche Euch alles Gute:<BR>
           Poldi</P>
          <HR>

          <P><FONT size="-1">Kein linker Frame? Dann klicke
          <A href="javascript:history.back()"><B>hier</B></A></FONT></P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

