<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>Workbench-Tools</TITLE>
  </HEAD>

  <BODY background="ncb_bg3.gif" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <A name="top"></A> 

    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Workbench-Tools</B></FONT></P>

          <P>Im Internet und auf Aminet-CD&acute;s finde ich immer mal ein paar gute
          Werkzeuge mit denen man die Workbench versch&ouml;nern kann, die einem
          hilfreich sind oder einfach nur lustig aber "sinnlos" sind! Hier
          m&ouml;chte ich Euch mal ein paar davon vorstellen. Was ich hier noch nie
          schrieb, werde ich aber diesmal schreiben: Bitte seht meine Texte &uuml;ber
          die Programme nie als einen Test an, zwar flie&szlig;t auch meine Meinung
          in die Texte, aber es sollen nur Anregungen f&uuml;r Euch sein diese Progs.
          auch mal anzusehen. Alle Texte &uuml;ber Progs. sollen demnach nur
          Vorstellungen sein, sonst nichts:-)</P>
          Poldi 
          <HR size="4">

          <UL>
            <LI><A href="#a1"><B>Liquid (MacOS X Style)</B></A></LI>
            <LI><A href="#a2"><B>MagicMenu V2.35</B></A></LI>
            <LI><A href="#a3"><B>PicShow V1.4</B></A></LI>
            <LI><A href="#a4"><B>MousoMeter V3.13</B></A></LI>
            <LI><A href="#a5"><B>WB-AnimAL V1.10</B></A></LI>
          </UL>
          <HR size="4">

          <P align="center"><A name="a1"><B>Liquid (MacOS X Style)</B></A></P>

          <P>Und schon wieder fand ich bei Amiga-News.de die Meldung &uuml;ber eine
          Neuerscheinung. Diesmal ist es eine Sammlung von Gadgets f&uuml;r
          Visual-Prefs, Pattern f&uuml;r Birdie, ein Pattern und 2 Prefs f&uuml;r
          MagicMenu, ein Prefs f&uuml;r Titleshadow und zwei Pattern f&uuml;r die
          Workbench.</P>

          <P>F&uuml;r diese Sammlung wird eine Workbench mit vielen Farben empfohlen
          und das Programm "Fullpalette", am besten auch noch einen Font in der
          Gr&ouml;&szlig;e 13! Zuerst sollten alle Programme installiert werden, die
          von dieser Sammlung unterst&uuml;tzt werden. In der beiliegenden
          Readme-Datei steht wie man das Zeug installieren mu&szlig;, ansonsten haben
          die unterst&uuml;tzten Progs. ja auch noch eine Anleitung!</P>

          <P>Diese Zusammenstellung von Pattern, Gadgets und Prefs soll es
          erm&ouml;glichen, die Workbench so aussehen zu lassen wie MacOS-X, leider
          funktioniert das nur teilweise. Die Gadgets f&uuml;r Mui scheinen zu fehlen
          oder sie funktionieren nicht, was aber sehr gut nachgeahmt wird, ist die
          Geschwindigkeit, dank Birdie ist die Workbench so langsam das man wirklich
          glaubt am Mac zu sitzen:-) Ansonsten ist diese Sammlung nicht schlecht,
          au&szlig;er das ein Pattern f&uuml;r die Workbench dabei ist, den ich schon
          seit langem selbst benutze, komische Sache! Zumindest hat mich dieses Zeug
          auf die Idee gebracht, im Internet nach den neuesten Versionen von Birdie
          und MagicMenu zu suchen. Aber obwohl bei Birdie steht das es jetzt auch den
          PPC unterst&uuml;tzt, ist es langsamer als zuvor, nur jetzt hat es ein
          Prefs Programm, was einem die Einstellerei doch ganz sch&ouml;n erleichtert
          und es lassen sich Pattern f&uuml;r das aktive und das inaktive Fenster
          ausw&auml;hlen.</P>

          <P>Gehe nach <A href="#top">oben</A></P>
          <HR size="4">

          <P align="center"><A name="a2"><B>MagicMenu V2.35</B></A></P>

          <P>Dieses MagicMenu soll noch beta sein, aber es funktioniert schon ganz
          gut. Ein Fehler der mir aufgefallen ist: Wenn der Amiga am booten ist und
          schon alles aus der WBStartup geladen hat, aber der Workbench-Hintergrund
          ist noch nicht fertig geladen und genau in dieser Zeit versuche ich aus dem
          Workbench- Menu ein Prog. zu starten, geht nichts mehr. Der Amiga friert
          zwar nicht ein, die Maus l&auml;&szlig;t sich noch bewegen, aber es lassen
          sich keine Schubladen mehr &ouml;ffnen und keine Sachen im Menu
          ausw&auml;hlen! Nur ein Neustart hilft! Ansonsten ist das Prog. mitlerweile
          etwas besser geworden, jetzt lassen sich sogar Hintergrundmuster f&uuml;r
          die Menus ausw&auml;hlen und die M&ouml;glichkeit die Menus transparent zu
          machen funktioniert endlich richtig!</P>

          <P>Eine Sache wundert mich aber doch: Warum braucht das Hintergrundmuster
          bei mir ganze 5MB Fastram? Das ist aber echt zu viel, egal wieviel Speicher
          ich habe, soviel mu&szlig; kein Pattern verbrauchen. Wenn Ihr andere
          Erfahrungen mit diesem Prog. gemacht habt, gerade wegen dem
          Speicherverbrauch, dann sagt mal Bescheid. Ansonsten kann ich nur empfehlen
          diese Version mal zu testen und/oder auf eine noch bessere Version zu
          warten!</P>

          <P>Gehe nach <A href="#top">oben</A></P>
          <HR size="4">

          <P align="center"><A name="a3"><B>PicShow V1.4</B></A></P>

          <P>Das ist cool, PicShow zeigt die Bilder auf der Workbench ohne Rahmen an,
          was echt mal geil aussieht. Es hat zwar keine grafische
          Bedienungsoberfl&auml;che, aber wof&uuml;r denn auch? PicShow wird
          gestartet, ein Bild oder ein ganzes Verzeichnis ausgew&auml;hlt und schon
          wird das erste Bild geladen. Leider ist dieses Prog. sehr langsam, aber
          daf&uuml;r sieht es besser aus wenn die Bilder ohne Rahmen auf der
          Workbench erscheinen. Gesteuert wird alles mit der Tastatur oder Maus, mit
          den Cursortasten (links und rechts) k&ouml;nnen die Bilder vorw&auml;rts
          oder r&uuml;ckw&auml;rts aus dem Verzeichnis angezeigt werden, da&szlig;
          geht auch mit der Maus, mit der rechten Maustaste geklickt und schon steht
          einem das ganze Verzeichnis zur Verf&uuml;gung, leider mu&szlig; man sich
          hier immer die Namen der Bilder merken! Quit geht mit ESC, Q oder einem
          Doppelklick in das Bild. L&auml;&szlig;t man den Mauszeiger auf dem Bild
          und bewegt ihn nicht, bekommt man Infos &uuml;ber das Bild
          (Gr&ouml;&szlig;e und Format). Wenn das Bild zu gro&szlig; f&uuml;r die
          Workbench ist, k&ouml;nnt Ihr es mit der linken Maustaste nehmen und in
          alle Richtungen ziehen.</P>

          <P>Nun gut, wieder einmal kann ich Euch nur empfehlen diesen Anzeiger
          einmal unter die Lupe zu nehmen.</P>

          <P>Gehe nach <A href="#top">oben</A></P>
          <HR size="4">

          <P align="center"><A name="a4"><B>MousoMeter V3.13</B></A></P>

          <P>Eins der unn&ouml;tigsten Programme die es gibt, aber doch ganz lustig!
          Es ist ein Kilometerz&auml;hler f&uuml;r die Maus mit vielen Statistiken.
          Immer wenn ich den PC-lern diesen "Witz" zeige, lachen sie und sagen das es
          so etwas auf dem PC nicht gibt. Finden k&ouml;nnt Ihr dieses Prog. auf den
          alten Aminet-CD&acute;s oder im Aminet. Habt Ihr es gefunden, macht Ihr das
          MausoMeter-Startpiktogramm in die WBStartup-Schublade und schon ist die
          Installation fertig. Dann geht Ihr in das Menu von MausoMeter und
          w&auml;hlt "Kalibrierung" aus, mit einem Lineal vor oder hinter der Maus
          fahrt Ihr, mit gedr&uuml;ckter linker Maustaste, 10cm und in dem daraufhin
          erscheinendem Fenster klickt Ihr auf Reset und danach w&auml;hlt Ihr im
          Menu den Punkt "Kalibrierung speichern"! Von nun an wird jeder Zentimeter
          den Ihr mit der Maus zur&uuml;cklegt gemessen und angezeigt, bei jedem
          vollen Meter wird automatisch gespeichert. Wenn Ihr dann "Info" oder
          "Rekorde" im Menu ausw&auml;hlt, stehen viele Statistiken zur
          Verf&uuml;gung, da steht dann wieviel Kilometer schon gefahren wurden und
          wieviel mal das der Marathondistanz, dem Erdumfang oder einer
          Diskettenumrundung entspricht! Auch die Mausklicks werden gespeichert. Die
          Meter und Mausklicks werden mit allen anderen Tagen verglichen, so das Ihr
          immer wi&szlig;t wann die Maus aktiv war, wie lange sie aktiv war, wieviele
          Meter zur&uuml;ckgelegt wurden und an welchem Tag Ihr einen Rekord
          hattet.</P>

          <P>Nach dem ersten Kilometer geht ein Fenster auf und da steht der Tip, man
          solle doch die Maus &ouml;len, nach weiteren 2 Kilomertern, steht in dem
          Fenster: "Bist Du sicher Deine Maus ge&ouml;lt zu haben?"</P>

          <P>Eigentlich hat dieses Prog. doch einen Sinn, wenn Ihr eine neue Maus
          kauft und genau zu dieser Zeit anfangt MausoMeter laufen zu lassen, dann
          k&ouml;nnt Ihr eine Statistik, &uuml;ber die Durchschnitliche Lebensdauer
          einer solchen Maus, aufstellen.</P>

          <P>Gehe nach <A href="#top">oben</A></P>
          <HR size="4">

          <P align="center"><A name="a5"><B>WB-AnimAL V1.10</B></A></P>

          <P>Also, dieses Progr&auml;mmchen bricht fast alle Rekorde, es ist tatsache
          ein sehr unn&uuml;tzes Teil, aber egal, es sieht doch sehr gut aus wenn ein
          Ball sich auf der Workbench dreht!</P>

          <P>In den Tooltypes wird eingestellt an welcher Stelle auf der Workbench
          sich der Ball befinden soll. Ansonsten hat man noch die M&ouml;glichkeit
          die Geschwindigkeit, mit der sich der Ball drehen soll, zu ver&auml;ndern.
          Weitere M&ouml;glichkeiten, den Ball in irgend einer Art zu beeinflussen,
          stehen nicht zur Verf&uuml;gung. Leider verbraucht der Ball viel Rechenzeit
          und hin und wieder wechdelt er die Farbe, n&auml;mlich dann wenn ein
          anderes Prog. gestartet wird.</P>

          <P>Zu finden ist WB-AnimAL auf den &auml;lteren Aminet-CD&acute;s und im
          Aminet selbst. Da es ein wirklich simples Teil ist, kann ich nicht mehr
          dazu schreiben! Zeigt es mal einem PC-ler, selbst so ein Prog. scheint es
          nicht auf dem PC zu geben...</P>

          <P>Gehe nach <A href="#top">oben</A></P>
          <HR size="4">
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

