<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Amino/AMIGA ver&ouml;ffentlicht Statement zur AMIGA-&Uuml;bernahme

Am 4. Januar hat Amino- (in K&uuml;rze AMIGA-) Pr&auml;sident Bill McEwen ein erstes 
Statement ver&ouml;ffentlicht:

»
EXECUTIVE UPDATE
----------------

3. Januar 2000


YeeHaw und Willkommen im Jahr 2000;

Etwas m&ouml;chte ich von Anfang an klarstellen: Amiga wurde von Gateway wegen
der Patente gekauft. Man war sich nicht einmal der Amiga-Basis oder der
Leute bewu&szlig;t.

Gateway erwarb Amiga wegen der Patente, wir erwarben Amiga wegen der Leute.

Ohne die dahinterstehenden Menschen, die entwickeln, herstellen, kaufen und
nach wie vor an den Amiga glauben, h&auml;tte es f&uuml;r Gateway nie etwas zu
erwerben gegeben. Wir erkennen dies, und wegen euch und wegen dessen, was
ihr unnachgiebig mit Amiga erreicht habt, haben wir die Firma gekauft.

Ich m&ouml;chte sicherstellen, dass jeder wei&szlig; und versteht, was dies f&uuml;r euch -
die wahren Amiganer - bedeutet.

Folgendes erwarben wir von Gateway:

1. Alle Warenzeichen, Logos etc.
2. Das komplette Inventar von Amiga International
3. S&auml;mtliche bestehenden Lizenzen
4. Die Lizenz zu allen Amiga-Patenten (Gateway besitzt die Patente
   weiterhin, aber wir k&ouml;nnen sie nutzen)
5. Alle Websites und registrierten Domain-Namen
6. Das Amiga-OS und alles, was damit in Zusammenhang steht
7. Den Amiga-Betrieb wie er momentan existiert

N&auml;here Details &uuml;ber das Developer-System, OS-Partner und wie jedermann zu
entwickeln beginnen kann, werden in den n&auml;chsten Wochen bekanntgegeben.

Am 8. Januar 2000 werden wir, zusammen mit einem unserer Partner, auf der
CES in Las Vegas eine Bekanntmachung ver&ouml;ffentlichen. Weitere Details
werden dieser Bekanntmachung folgen.

Fleecy, ich, Petro und der Rest des Teams werden keine Versprechen geben
und Pr&auml;sentationen und Demos erstellen. Wir werden Produkte und Services
bieten, und der Rest der Welt wird wissen, was ihr bereits wu&szlig;tet.

Wir werden diese Woche offiziell den Namen von Amino Development
Corporation in Amiga Corporation &auml;ndern und dies in K&uuml;rze bekanntgeben,
sobald es offiziell erledigt sein wird.

Ich m&ouml;chte euch allen f&uuml;r eure unaufh&ouml;rliche Unterst&uuml;tzung danken. Wir
werden Amiga zu dem machen, was es h&auml;tte sein sollen, und - was noch
wichtiger ist - zu dem, was es werden wird.

Keeping the faith,

Bill McEwen President/CEO
Amino Development Corporation«

(Quelle: AMIGA)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
