<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Die Pl&auml;ne von AMIGA - einige Mutma&szlig;ungen

Eines ist klar: AMIGA wird schon sehr bald einen Nachfolger unseres 
Computersystems ank&uuml;ndigen. Was jedoch noch fehlt, sind s&auml;mtliche Hard- und 
Software-Spezifikationen des Ger&auml;ts. Wir wollen an dieser Stelle schon mal 
ein paar Spekulationen anstellen.
Sicher scheint, dass der neue Rechner kein Betriebssystem von QNX verwenden 
wird, dies hatte Fleecy Moss in den letzten Wochen nicht nur einmal 
angedeutet. Als m&ouml;gliche Betriebsumgebung hat er vor kurzem in einem 
Interview HAVi, Jini, Rebol, NextObjects, Inferno und Elate genannt, so 
dass wohl davon auszugehen ist, dass eines davon zum Einsatz kommen wird.
Auf der Amino-Website (http://www.amino1.net) ist im Quelltext zudem der 
Begriff "Linux" enthalten, was darauf schlie&szlig;en l&auml;sst, dass das benutzte 
Betriebssystem auf einem solchen Kernel basieren wird.
Und die Hardware? Verwendet werden sicherlich in erster Linie 
Standardkomponenten, wie etwa PCI. Heutzutage auf Spezialentwicklungen zu 
setzen, w&auml;re nicht nur sehr teuer, sondern auch aus strategischen Gr&uuml;nden 
unvern&uuml;nftig.
Im Gegensatz dazu sollte in Zeiten, in denen bei der Entwicklung eines 
Betriebssystem immer mehr Wert auf m&ouml;glichst einfache Portierbarkeit gelegt 
wird, der anfangs verwendete Hauptprozessor keine allzu gro&szlig;e Rolle 
spielen. Zweifellos werden Bill McEwen und Fleecy Moss aber soviel 
Feingef&uuml;hl besitzen, f&uuml;r den ersten verkaufsfertigen NG-Amiga keine x86-CPU 
auszuw&auml;hlen...

Fazit:

So wie es aussieht, greift AMIGA im Gro&szlig;en und Ganzen die Pl&auml;ne von Jim 
Collas wieder auf, vielleicht mit einem Schuss weniger "Multimedia 
Convergence" und daf&uuml;r etwas mehr "Computer", jedoch sind Parallelen 
eindeutig erkennbar. Diese Kontinuit&auml;t ist, sofern sie tats&auml;chlich 
eintritt, sehr begr&uuml;&szlig;enswert, scheuen sich Bill McEwen und Fleecy Moss doch 
nicht, auch unpopul&auml;re Entscheidungen zu treffen, indem sie beispielsweise 
auf das bei vielen Amiga-Anwendern nicht sehr beliebte Linux setzen. (Warum 
ich pers&ouml;nlich eine solche Wahl f&uuml;r vollkommen richtig halte, habe ich ja 
bereits im Schlusswort von AMIGA aktuell 8/99 erl&auml;utert.)

Und was wird mit dem heutigen AmigaOS passieren? Nun, "rein zuf&auml;llig" 
finden sich im Quelltext der Amino-Website auch die Stichw&ouml;rter "free", 
"open platform" und "open system". Aber auch, wenn das nicht der Fall w&auml;re 
- wer wollte daran zweifeln, dass die Amiga-Fans Bill McEwen und Fleecy 
Moss sich und uns den Gefallen tun, den Quellcode des AmigaOS zum Zweck und 
im Rahmen einer koordinierten Weiterentwicklung freizugeben? Denn welchen 
Grund h&auml;tte es - abgesehen vom traditionsreichen Namen - f&uuml;r den Erwerb der 
Amiga-Rechte sonst noch gegeben?

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
