<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Diverse Amiga-News
------------------

1. Statement zur Zukunft von amigaOS, Amiga Plus und Amiga Future

Der Falke-Verlag informiert:

»Zukunft amigaOS und Amiga plus

Liebe Amiga-Freunde,
Liebe Leser der amiga OS und Amiga plus!

Es wird eine Reihe von Ver&auml;nderungen geben, &uuml;ber die wir Sie nachfolgend 
aufkl&auml;ren m&ouml;chten.
Da die Amiga plus kurz vor einer Einstellung stand, haben wir diese j&uuml;ngst 
vom ICP-Verlag erworben und werden sie wie folgt weiterf&uuml;hren:
Die amigaOS und die Amiga plus werden ab Ende Januar in ein Magazin 
fusioniert, das unter der Leitung von Thomas Raukamp/Nico Barbat mit dem 
Namen "Amiga plus - powered by amigaOS" bundesweit im Handel erscheinen 
wird.
Der Grund f&uuml;r die &Uuml;bernahme des traditionellen Titels des ICP-Verlags ist 
der, da&szlig; wir aus wirtschaftlichen Gr&uuml;nden selbstverst&auml;ndlich den &auml;lteren 
und damit auch bekannteren Titel weiterf&uuml;hren wollen. Inhaltlich wird das 
bew&auml;hrte amigaOS-Redaktionsteam durch qualifizierte Mitarbeiter der 
ICP-Redaktion erg&auml;nzt.

Durch diesen Schritt haben wir das Vertrauen der Amiga-Userschaft gewinnen 
k&ouml;nnen, denn wir haben bewiesen, was wir bei Ersterscheinung ank&uuml;ndigten, 
n&auml;mlich ein Magazin herauszubringen, das in der Lage ist, auch in so 
entscheidenden Zeiten hochwertigen Inhalt zu pr&auml;sentieren und den Lesern 
&uuml;ber viele Jahre treu zu bleiben.

Die Fusion hat nun zur Folge, da&szlig; wir die Leserschaft auf ein Medium 
konzentrieren und unsere Werbekunden auf einen Schlag die gesamte 
Amiga-Gemeinde erreichen. F&uuml;r uns bedeutet dies eine wirtschaftliche 
Sicherheit, die ein Herausgeben der Zeitschrift &uuml;ber viele Jahre hinweg 
garantiert.

Bez&uuml;glich der Heftdiskette m&uuml;ssen wir Ihnen mitteilen, da&szlig; diese k&uuml;nftig 
nur noch an Abonnenten geliefert wird aber nicht mehr im Handel verf&uuml;gbar 
ist.


Ihr Abonnement
Machen Sie sich als Leser der Amiga plus bitte keine Gedanken &uuml;ber Ihr 
Abonnement. Selbstverst&auml;ndlich wird es bei uns, beim Falke Verlag, 
weitergef&uuml;hrt, und wenn Sie bei der Amiga plus und der amigaOS ein 
Abonnement haben sollten, dann werden lediglich die Lieferzeiten addiert, 
so da&szlig; Ihr aktuelles Abo z.B. anstatt von 7 und 8 Monaten k&uuml;nftig noch 15 
Monate bei uns l&auml;uft.


Amiga Future und Amiga plus CD-ROM
Auf diese beiden Titel wurden von unserem Verlag &uuml;bernommen, und wir k&ouml;nnen 
auch hier eine tolle Entwicklung zusichern:
Die Amiga-Future hat eine super Vollversion (erscheint am 22.12.99) namens 
NEMAC IV und wird mit einem komplett umstrukturierten Layout erstellt, 
damit das Heft optisch ansprechender und marktgerechter wird.
Die Amiga plusCD k&ouml;nnte ab kommendem Jahr nicht mehr in der Papp-
Verpackung, sondern mit einem Mini-Heftchen erscheinen, in dem die 
Bildergalerie ausf&uuml;hrlicher abgedruckt und die Vollversion des Monats 
vorgestellt werden.

Wenn Sie Ideen und Vorschl&auml;ge f&uuml;r uns haben, scheuen Sie sich bitte nicht, 
mich zu kontaktieren. (a.goukassian@falke-verlag.de)

Viele Gr&uuml;&szlig;e aus Kiel
A. Goukassian
Verlagsleiter FALKE VERLAG
An der Holsatiam&uuml;hle 1
24149 Kiel
Tel. (04 31) 27 365
Fax (04 31) 27 368«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
