<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Haage&Partner-News

Und hier wieder die neuesten Meldungen des Unternehmens:

»02 Dez 99: Probleme bei Tornado3D, NetConnect, STFax

Leider gibt es mit den aktuellen Versionen Probleme, die aber durch 
Downloads oder kleine &Auml;nderungen behoben werden k&ouml;nnen. Schauen Sie daher 
bitte im Support von Tornado3D, NetConnect oder STFax vorbei.


06 Dez 99: 500.000

Kaum einen Tag nach dem Start des Wettbewerbs war der 500.000 Besucher auch 
schon auf unserer Homepage. Wie schon beim letzten Mal waren es auch 
diesmal wieder mehrere, die die Zahl 500.000 angezeigt bekamen. Wir habe 
daher die beiden ersten Einsender genommen. Gratulation! Wir bedanken uns 
bei allen, die teilgenommen haben. Die n&auml;chste Aktion ist ja schon am 
Laufen... 


06 Dez 99: Zwei Neue :)

Wir freuen uns, da&szlig; wir f&uuml;r die wichtigen Webbereiche PPCWorld und 3DWord 
neue Betreuer gewinnen konnten. Stefan Funke wird ab sofort die PPCWorld 
und Robert Konrad die 3DWorld betreuen. Wir w&uuml;rden uns daher sehr freuen, 
wenn wir tatkr&auml;ftig mit Daten versorgt werden w&uuml;rden um unsere 
Softwarelisten auf den aktuellen Stand bringen zu k&ouml;nnen. 


10 Dez 99: AmigaOS Developer Network

Dieser Dienst wurde eingerichtet um eine Gruppe von Entwicklern mit den 
neuesten Informationen zum AmigaOS zu versorgen. Leider mu&szlig; die Anzahl der 
Teilnehmer recht klein gehalten werden. 


10 Dez 99: Support f&uuml;r ImageFX

Gunnar Gertzen, ImageFX-User seit vielen Jahren, wird ab sofort den E-Mail-
Support f&uuml;r dieses Produkt &uuml;bernehmen. Er arbeitet auch bereits an einer 
deutschen Lokalisierung und einer deutschen Anleitung. N&auml;chere 
Informationen hierzu in K&uuml;rze. 


13 Dez 99: PageStream 4.0

Seit der HEW vor 4 Wochen ist das neue PageStream 4.0 Amiga verf&uuml;gbar. Den 
ersten Patch werden wir Ihnen in K&uuml;rze zur Verf&uuml;gung stellen k&ouml;nnen. 


13 Dez 99: STFax Pro 4.0 Demoversion

Schon seit geraumer Zeit ist zum neuen STFax Pro 4.0 auch eine Demoversion 
erh&auml;ltlich. 


16 Dez 99: NoPiracy News

Dank der Hilfe der Amiga.org ist jetzt ein neues NoPiracy Forum online. Es 
ist offen f&uuml;r alle Diskussionen zum Thema Raubkopien. NoPiracy Forum

Seit einigen Wochen gibt es auch einen Poll zum Thema Raubkopien auf dem 
Amiga und wir haben einige neue Logos und Banner auf die Seite gestellt. 
Schaut doch einmal vorbei und setzt die Logos auf so viel Webseiten wie 
m&ouml;glich. 


16 Dez 99: Neuer STFax Betreuer

Wolfgang Hosemann wird ab sofort den EMail-Support von STFax &uuml;bernehmen. Es 
wird dann in K&uuml;rze auch eine dt. Anleitung dazu geben.


22 Dez 99: Weihnachts-Roll-Out

Ein kurzer Blick in unsere Weihnachtsvorbereitungen ;-) Story ... und noch 
ein nettes Gedicht: Des Admins Heiligabend ... und noch etwas zur 
Rechtschreibreform ... und noch ein sch&ouml;nes Rezept f&uuml;r einen 
Weihnachtsbraten


23 Dez 99: PenPartner-Tabletts wieder lieferbar

Wir haben einen kleinen Restposten des beliebten Wacom PenPartner 
Grafiktabletts erworben, das nicht mehr hergestellt wird. Spezieller 
Weihnachtspreis: 189 DM.«

(Quelle: Haage & Partner)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
