<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
AMIGA-aktuell-Forum
-------------------

In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt 
gef&uuml;hrten - Rubriken "Leserbriefe", "Kleinanzeigen", und "Problemecke" 
zusammengefasst. 

Wenn Ihr einen Beitrag habt, schreibt bitte an:

        Carsten Schr&ouml;der
        Helmoltstra&szlig;e 10
        37081 G&ouml;ttingen

E-Mail: aakt@gmx.de


1. Leserbrief zum Amiga-Niedergang unter Commodore (von Raphael Pilarczyk)

»Leserbrief angeregt von Rainer Bendas "Der Commodore-Untergang aus meiner 
Sicht"

Der Verlauf ist weitgehend bekannt, was waren aber die Gr&uuml;nde?
Misswirtschaft?  Sicherlich, aber 'in welchem Sinne'?

Meiner Meinung nach(!) wusste das Managment &uuml;berhaupt nicht, was nach C64 
passieren soll. Sie haben auf Atari geschaut und Amiga gekauft. Nach A500 
zeichnete sich die Frage aber wiederholt ab: "Was nun?"

Der wichtigste Grund f&uuml;r den Untergang war der eigentliche Stolz der
Firma, die Customchips. Sie veralteten schneller als sie auf dem Waffer
geschnitten werden konnten.
Mit AmigaOS 2.x hat man verschlafen - wie leider auch mit 3.x, aber da war
es schon eh zu sp&auml;t - RTG einzuf&uuml;hren, um die Grafikhardware der x86-
Plattform in das System zu integrieren.
Die Customchips mochten zwar gut mit der Fernsehtechnik zusammenspielen,
aber das ist keine Voraussetzung f&uuml;r einen HomePC, wie man sieht
jedenfalls keine ausreichende.

Der zweite Grund war das OS selbst bzw. die unzureichenden
Entwicklungswerkzeuge samt Entwicklerunterlagen.

Kennt jemand eine Anwendergruppe, die sich nicht ihre eigenen Jokes &uuml;ber
Guru Meditation erz&auml;hlt (hi hi)?  Hier hat Commo die Hausaufgaben
ebenfalls nicht gemacht.

Wegen fehlendem Speicherschutz erlaubt das OS dem Task, eben dank 'shared
memory', ein superschnelles Agieren. Heute ist man aber der Meinung, dass
sich dieses Konzept &uuml;berlebt hat.
Wie man am Win9x und MacOS aber sieht (!), hindert fehlender Speicherschutz
eine HomePC-Plattform keineswegs am Erfolg. AmigaOS fehlten in dieser
Hinsicht einfach die n&ouml;tigen Entwicklerwerkzeuge.

Etwas wie Enforcer - oder der nie fertiggestellte GuardianAngel - sind
f&uuml;r shared memory keineswegs ausreichend. Es ist eine weitgehend
akzeptierte Meinung, dass die meisten Abst&uuml;rze einer Anwendung, und
damit des ganzen Betriebssystems, nicht durch das &Uuml;berschreiben
irgendwelcher "fremden" Daten geschehen, sondern weil die
Betriebssystemaufrufe falsch verwendet werden.

Etwas was man in dieser Richtung als brauchbar bezeichnen kann, kommt als 
OneManShow im Jahre 1999. Gemeint sind hier Thors MuTools und das dazu 
passende PATCHWORK von Richard K&ouml;rber. Leider 11 Jahre zu sp&auml;t.

Andererseits kann ich mir auch die Anmerkung nicht verkneifen, dass die
Hobby- wie auch Profientwickler Commo leider nicht gleich am Anfang der 
Zeit unter Druck gesetzt haben, solche Projekte auf die Beine zu stellen. 
Meiner Meinung nach war die s.g. Community eben zu lange unreif.

Der letzte Grund war Motorola selbst. W&auml;hrend x86 schnell mit neuen 
Features und vor allem(!) mit h&ouml;herem Takt aufwartete, schien man sich bei 
Motorola nicht ganz klar gewesen zu sein, wohin die Reise eigentlich gehen 
sollte.
Die Entwicklung des 68k ging f&uuml;r meine Begriffe ziemlich schleppend. Nach 
68030 mit seinen niedlichen 50 MHz und eingebauter MMU wagte man, sich den 
68k mit 040 neuzudesignen, womit man aber in einer Sackgasse gelandet ist. 
Mit 40 MHz konnte man dem x86 nicht gef&auml;hrlich werden. Der 68060 war dann 
zwar wieder eine CPU mit ausreichend Potential, aber er kam zu sp&auml;t.

Zu sp&auml;t f&uuml;r den Amiga - Commo war zu dem Zeitpunkt schon so gut wie platt - 
wie auch f&uuml;r den Mac. Apple wollte ihn auch gar nicht mehr haben, da der 
neue PowerPC601 von IBM/Motorola auf Anhieb gleich leistungsf&auml;hig
war.

Raphael Pilarczyk	 &lt;PIK@amigo.ping.de&gt;«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
