<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Messebericht
------------

1. Nachbetrachtung der Home Electronics World '99 (von Markus Tillmann)

Markus hat seine Hardwareprobleme gel&ouml;st - und hier ist er wie versprochen: 
Der Bericht von der K&ouml;lner Computermesse.

»Wie schon seit Jahren Tradition, fand auch in diesem November auf dem 
K&ouml;lner Messegel&auml;nde eine Computerausstellung statt, die sich besonders mit 
dem Amiga besch&auml;ftigt.
F&uuml;r viele ist es die Amiga-Messe; daran &auml;nderte auch der neue Name "Home
Electronics World" nichts (vorher Computer xx), genauso wenig, wie die
undurchsichtige Situation bei Amiga Inc. und die Einfrierung des Projekts
AmigaMCC.

Nat&uuml;rlich war das Messegeschehen, wie seit 1995 gewohnt, wieder auf die
Messehalle 11.2 beschr&auml;nkt, aber selbst diese konnte nicht richtig
gef&uuml;llt werden, weder mit Ausstellern, noch mit Besuchern.
Wenigstens war es am Samstag recht voll in der Halle. 

Das Interesse an dieser Veranstaltung hat in den vergangenen Jahren immer 
mehr abgenommen, verst&auml;ndlich, schrumpfte doch auch der Amiga-Markt immer 
weiter zusammen.
Deswegen versuchten es die Veranstalter dieses Jahr mal wieder mit einem 
neuen Konzept und auch dem erw&auml;hnten neuen Namen, sie erweiterten die
Themenbereiche z.B. durch Satellitentechnik und erhofften (?) sich so die
Besucherzahlen zu steigern.

Bereits die offizielle Homepage der HEW war allerdings nur durchschnittlich
besucht und es konnte kaum neues Interesse bei potentiellen Besuchern oder
auch Ausstellern geweckt werden. Auch mit Werbung hielt man sich meiner
Meinung nach dezent zur&uuml;ck.

Als man das Messegel&auml;nde betrat, wirkte vieles unprofessionell, ja, schon 
fast wie ein ungeliebtes Kind.
Dies fing schon mit dem Messekatalog an, der wieder mal um ein paar Seiten
geschrumpft war (12 Seiten DIN A5; 98:12 Seiten DIN A4; 97: 20 Seiten; 96: 
36 Seiten...)...
Die bekannte Umfrage ("Wie sind sie auf die Messe aufmerksam geworden? -
Haben Sie vor, die Messe auch im n&auml;chsten Jahr zu besuchen?..."), in den
letzten Jahren stets verbunden mit einem Gewinnspiel, schenkte man sich
diesmal ganz, einige Fl&auml;chen in der Halle wurden gar nicht benutzt (es sei 
denn, als Sitzfl&auml;che) usw.
Zu wenige Aussteller hatten Interesse an der Messe, vielleicht auch weil 
die Standkosten zu hoch waren; vielleicht ist K&ouml;ln heute einfach nicht mehr 
so geeignet, wie noch vor einigen Jahren, als der Amiga noch einen 
Massenmarkt bediente, denn heute ist Amiga leider nur noch ein 
Nischenprodukt.
Auch die Qualit&auml;t von einigen vorhandenen St&auml;nden war recht d&uuml;rftig, sowohl 
im PC- als auch im Amiga-Bereich.
Selbst PC-User waren mit dem Angebot auf der Messe unzufrieden; konnte man 
in den vergangenen Jahren doch immer zahlreiche hochwertige Schn&auml;ppchen 
machen, war dieses Jahr h&auml;ufig nur minderwertiges zu bekommen.

So konnte man schon nach kurzer Zeit den Eindruck gewinnen, da&szlig; es nicht 
nur die letzte Amigamesse in K&ouml;ln in diesem Jahrtausend war... 

Kommen wir aber nun zum Messegeschehen an sich und k&uuml;mmern uns um 
Neuigkeiten rund um den Amiga:

Nach Verlassen der Rolltreppe durfte man als Amiganer ruhig die vorderen
St&auml;nde links liegen lassen, es sei denn man wollte sich mal kurz 
informieren, welche neuen Spiele es denn gerade f&uuml;r PC's gibt oder sich als 
Lothar Matth&auml;us an der Torwand von Software 2000 probieren.

Die Amigast&auml;nde befanden sich n&auml;mlich alle im hinteren Bereich der Halle.
Also, auf, auf...


Die Aussteller

Ein schneller Rundgang und erst mal informiert, wer denn alles da ist und 
wo man gleich auf jeden Fall hin mu&szlig;...
Ah, der Stand von Amiga! Nicht zu &uuml;bersehen, vor allem der riesige,
aufgeblasene Boing-Ball sieht toll aus! 
Und der ganze Stand wurde von drei Leuten aufgebaut - Respekt, Petro!
Aber hier kommen wir sp&auml;ter noch mal hin.
 
Wo ist denn Vesalia? Leider nicht da. Genauso wenig wie Village Tronic... 
Und auch Micronik, die sich leider vom Amiga-Markt zur&uuml;ckgezogen haben, 
haben die Gelegenheit nicht mehr genutzt, ihre Lagerbest&auml;nde an Amiga Hard- 
und Software zu g&uuml;nstigen Preisen auf der Messe anzubieten.
Da halfen auch alle &Uuml;berredungsk&uuml;nste von Petro vor der Messe nicht mehr,
leider. Denn diese Firmen haben aus meiner Sicht schon ein gro&szlig;es Loch
hinterlassen.
Oberland war auch nicht mehr da, f&uuml;r Eternity lohnte sich ein Messebesuch
aufgrund zu weniger wichtiger Neuerscheinungen nicht, auch Conny Figge, die 
in den letzten Jahren neben vielen Spielen auch immer das ein oder andere
Hardwareschn&auml;ppchen anbot, war nirgends zu finden und hat ebenfalls das
Amiga-Boot verlassen. Auch Phase 5, der wohl wichtigste
Amiga-Hardwarehersteller war nicht vertreten, auch New Generation Software,
die in den letzten Jahren stets interessante Amiga-Software anboten waren
nirgendwo zu finden...

Tja, h&ouml;rt sich nicht gut an, aber woran liegt's???

Sicher, einige der Firmen haben sich vom Amiga-Markt ganz verabschiedet, 
aber den anderern mu&szlig; etwas nicht gepasst haben, was wohl weniger mit der
Anwesenheit von Amiga zu tun hatte (sch&ouml;ner Gru&szlig; an I-Win), sondern eher 
z.B. mit den hohen Standkosten oder auch dem gesamten Konzept. 
Klar ist jedenfalls, da&szlig; die Messe so weder f&uuml;r (die meisten) Aussteller, 
noch f&uuml;r die Besucher optimal ist und viele hoffen nun auf die vom Falke 
Verlag geplante Amiga-Messe im Fr&uuml;hjahr.

Na gut, genug gefrustet, gehen wir doch wieder zur&uuml;ck zum Stand von Amiga
Int.: Hier k&ouml;nnen wir im Amiga Museum einen Blick in die Vergangenheit 
werfen, z.B. den Walker oder einen Amiga 1000 begutachten und unsere 
Hoffnung auf eine bessere Zukunft auffrischen.
Amiga selber bot nat&uuml;rlich wieder die bekannten Merchandisingartikel an, 
und auch das an vielen Rechnern vorgef&uuml;hrte Betriebssystem-Update OS3.5, 
das sich viele Besucher genauer anschauten, wurde verkauft. Obwohl l&auml;ngst 
&uuml;berf&auml;llig und hart erk&auml;mpft, wurde das Update aber l&auml;ngst nicht von allen 
Usern angenommen, vor allem solche, die sich bereits ihre eigene, wohl
funktionierende Workbench zusammengestrickt haben, sahen wenig Sinn in 
einer Anschaffung. 
Bis Mitte Dezember konnten immerhin 12000 OS3.5-Pakete abgesetzt werden und
p&uuml;nktlich zu Weihnachten ist auch ein erstes sinnvolles Update zum Download
angeboten worden. 
Trotz vieler kritischer Stimmen sei aber auch gesagt, da&szlig; das OS3.5 
bestimmt nicht schlecht ist, im Gegenteil, f&uuml;r viele User bestimmt sehr 
n&uuml;tzlich! Die angestrebte Verkaufszahl von 25000 Exemplaren scheint aber 
fraglich.

Petro Tyschtschenko stellte sich auf der Messe bereitwillig allen Fragen 
der teilweise sehr aufgebrachten User und gab Auskunft, wo er nur konnte.
Allerdings wirkte auch er sehr niedergeschlagen, ob der letzten 
Entwicklungen beim amerikanischen Mutterkonzern. Man mu&szlig;te schon Gl&uuml;ck 
haben, um ihn auf der Messe mit einem L&auml;cheln zu sehen; selbst die 
bekannten Er&ouml;ffnungsworte und die bekannte Ank&uuml;ndigung von Annex konnte man 
dieses Jahr in K&ouml;ln nicht von ihm vernehmen.

Aus den USA hatte er vor der Messe &uuml;berhaupt nichts geh&ouml;rt, es bestand
keinerlei Kontakt mehr; Petro ging von einem weiteren Verkauf der
Amiga-Rechte aus und sagte, da&szlig; dann wohl die Amiga-Crew wieder zur&uuml;ck zu
Gateway gehen w&uuml;rde. F&uuml;r viele Amiga-User ist Petro sowas wie die Kultfigur
und von ihm, der Amiga bereits aus zwei Konkursen herausgef&uuml;hrt hat, zu
h&ouml;ren, da&szlig; er bald die Nase gestrichen voll h&auml;tte, stimmte viele Amiganer 
noch nachdenklicher... 

Der gr&ouml;&szlig;te aller St&auml;nde war nat&uuml;rlich auch Anlaufstelle f&uuml;r viele
Unteraussteller, wie zum Beispiel die amigaOS mit Thomas Raukamp, den man
sich erst zweimal ansehen mu&szlig;te, denn die langen Haare (die mir immer
geholfen haben, ihn sofort zu erkennen :-)) waren ab; oder das englische
Magazin AmigActive, das relativ neu auf dem Markt ist und die ersten beiden
Ausgaben zum Verkauf anbot. Die Zeitung ist recht gut, vor allem die
Aufmachung und das Layout gefielen mir. Im Innenteil geht's auf 74 Seiten
recht farbig zu, aber nun sollte man nicht denken, da&szlig; der Schwerpunkt des
Magazins auf Entertainment liegt; die monatlich beigef&uuml;gte CD hinterliess
ebenfalls einen positiven Eindruck, so da&szlig; ich das Magazin auch deutschen
Amiga-Fans nur empfehlen kann. Unbedingt mal ein Probeexemplar bestellen!

Ebenfalls am Amiga-Stand fand man das Amiga Zentrum Th&uuml;ringen; hier konnte
man eine CD mit einer kompletten Linux-PPC-Distribution f&uuml;r DM 25,- 
erwerben, die auch am Stand vorgef&uuml;hrt wurde.

Weiterhin pr&auml;sentierte Tom Neidhardt Easys, seine Workbencherweiterung,
eine weitere Schnittstelle zeigte uns KATO mit der Twister1200NG, die dem
Silversurfer sehr &auml;hnelt, dazu noch eine Fast-Ethernetkarte, die demn&auml;chst
erscheinen soll.
Au&szlig;erdem war noch die Eyetech Group als Unteraussteller anwesend.
  
Neben dem Amiga-Stand war eine Art Internet-Cafe aufgebaut, wo man nach 
Lust und Laune durch's Web surfen konnte und Gr&uuml;&szlig;e in die Amiga-Welt 
schicken konnte. Hier wurden auch einige IRC-Konferenzen, z.B. mit Petro 
abgehalten.

Fast wie das Amen zur Kirche geh&ouml;rt mittlerweile auch Annex zu Amiga!
Diesmal leider nur als Trio, sorgten sie mit ihren Auftritten stets f&uuml;r 
eine angenehme Abwechslung f&uuml;r die zahlreichen Zuschauer und gaben nach 
ihren Auftritten am Amiga-Stand fleissig Autogramme auf den CD-Covern des
Amiga-Songs.
Ger&uuml;chten um eine Aufl&ouml;sung widersprach Daniel Schulz heftig, er w&uuml;rde 
solange weitermachen, wie es auch nur einen atmenden Amiga-User g&auml;be und 
wenn er es selber sei!
Viel Gl&uuml;ck an dieser Stelle f&uuml;r ihr Vorhaben ihren neuen Song "The Spirit"
auch au&szlig;erhalb der Amiga-Welt bekannt zu machen!

Nat&uuml;rlich waren auch andere Firmen mit einem eigenen Stand vertreten, wie 
zum Beispiel:

Haage & Partner: Dieser Stand war f&uuml;r meinen Geschmack eindeutig der
professionellste und mit gr&ouml;&szlig;tem Aufwand und Bem&uuml;hen bedachte Stand auf der
Messe (neben dem von Amiga Int.).
Neben dem Bereich f&uuml;r den Verkauf gab es hier zahlreiche aufgebaute 
Rechner, auf denen H&P ihre Programme durch qualifiziertes Personal, 
Entwickler etc. vorf&uuml;hren lie&szlig; und jedem mit Rat und Tat zur Seite stand. 
Ebenso einen professionellen Eindruck hinterliess J&uuml;rgen Haage, der 
zahlreiche Gespr&auml;che mit Amiga-Usern f&uuml;hrte und sich daf&uuml;r viel Zeit nahm. 
Auf die Frage einer Weiterentwicklung des AmigaOS auch st&auml;rker in Richtung 
PPC sagte er, da&szlig; H&P gerne dazu bereit w&auml;ren, das Problem auch nicht die 
fehlende Motivation, mangelnde Zeit oder Kompetenz w&auml;r, aber man br&auml;uchte 
daf&uuml;r halt Lizenzen von Amiga!

Am Stand von Amiga pr&auml;sentierte H&P eine Entwicklermaschine von IBM mit 
einem G3 Board, welche IBM an alle interessierten Firmen lizensieren m&ouml;chte 
und eine m&ouml;gliche Basis f&uuml;r das angedachte (oder schon mehr?), f&uuml;r
PPC-Plattformen weiterentwickelte AmigaOS darstellt. Es gilt mal wieder
abzuwarten...
 
An Produkten wurde hier nat&uuml;rlich nicht nur das von H&P entwickelte 
AmigaOS3.5 gezeigt und verkauft, sondern auch die neue Developer CD 2.1, 
die das Betriebssystemupdate in den Vordergrund stellt.
Desweiteren zeigte uns das H&P-Team:
NetConnect 3.0,das Internet-Komplettpaket, STFax Pro 4.0, X-DVE 3.5,
Font-Machine 3.2, Amiga-Writer (leider noch nicht in der Version 2.0, an 
der aber nun, nach der Fertigstellung des AmigaOS3.5, intensiv gearbeitet 
werden soll), PageStream 4.0, der Raytracer Tornado3D in Version 3.0, 
ImageFX 4.0, dessen Vertrieb H&P &uuml;bernommen haben, ArtEffect 3.0, Warp3D, 
WarpUp und noch einiges mehr... Wahnsinn!!!
 
Epic:
Am Stand von Epic schlug das Zockerherz h&ouml;her! Hier wurden von Thomas
Steiding und seiner Crew jede Menge Spiele zu Messepreisen angeboten und
einige Neuheiten vorgestellt.
Leider schaffte man es hier jedoch nicht, die f&uuml;r die Messe angek&uuml;ndigten
Spiele Mikro Mortal Tennis und Tales from Heaven fertigzustellen. Bei TfH 
hat sich wegen eines Motorradunfalls von einem der Programmierer der 
Release etwas in die L&auml;nge gezogen (nun Januar) und bei MMT bekam Epic eine 
noch nicht fertige Version von den Programmierern.
Daf&uuml;r wurde nun das Geheimnis um die geplante PC-Konvertierung gel&uuml;ftet, es
handelt sich hierbei, wie mittlerweile alle wissen d&uuml;rften, um Simon the
Sorcerer 2. F&uuml;r eine Umsetzung werden allerdings 500 Vorbestellungen
ben&ouml;tigt, bislang sind bei Epic etwa 160 eingegangen.
Desweiteren konnte man ein Demo des Action-RPG's Dafel:Bloodline von Pagan
Games antesten, das sowohl auf einem Amiga 1200 lief, als auch &uuml;ber Paolo
Cattanis (Virtual GP) Laptop.
Neben Paolo Cattani stand am Epic-Stand auch Paul Burkey (Foundation) Rede 
und Antwort, der auch gleich seinen Foundation Dirctor's Cut mitgebracht 
hatte (hier noch ein Hinweis: vor kurzem las ich, da&szlig; Foundation DC 
Verkaufsrekorde gebrochen h&auml;tte...man ist bei Epic zwar zufrieden mit den 
Verkaufszahlen, sei aber noch einiges vom vierstelligen Bereich entfernt - 
somit kann man wohl (hoffentlich) nicht von Verkaufsrekord sprechen!) und 
munter &uuml;ber den Nachfolger Foundations Edge plauderte.
Au&szlig;erdem wurden am Epic-Stand einige Produkte von KDH Datentechnik 
angeboten, wie zum Beispiel MakeCD, f&uuml;r dessen Vertrieb KDH nun zust&auml;ndig 
ist.

Titan Computer:
Leider blieben an diesem recht gro&szlig;en Stand die Monitore lange schwarz und 
es wurden kaum etwas vorgef&uuml;hrt.
Als es dann aber soweit war ging die Post ab: Staunende Gruppen zog immer
wieder eine Demo von Heretic II an, das am Samstag von den Frieden-Br&uuml;dern
h&ouml;chstpers&ouml;nlich demonstriert wurde und im Januar endlich erh&auml;ltlich sein
soll. Ebenso pr&auml;sentierte Titan ein weiteres Game von Hyperion Software
(Shogo, auch ab Januar erh&auml;ltlich), neue Versionen von BurnIT und Candy
Factory Pro, die st&auml;ndig weiterentwickelt werden, au&szlig;erdem noch Fantastic
Dreams. Dazu konnte man sich an diesen Stand mit etlichen Entwicklern 
dieser Programme unterhalten, wie z.B. Michael Siegel und Axel Deising, den
Programmierern von BurnIT, denen es lieber w&auml;re, Titan w&uuml;rde die
Brennersoftware ein paar Mark g&uuml;nstiger anbieten und dadurch w&uuml;rde es neue
Kunden geben - gesagt - getan, BurnIT wurde in der Version 2.6 gegen&uuml;ber 
der Vorversion um 20,- preiswerter! Lobenswert!
Weitere Spiele wie Evil's Doom SE und Joyride konnten vorbestellt werden,
ebenso wie das neu angek&uuml;digte ReproStudio, ein DTP Programm f&uuml;r 68k und
PowerPC Amigas und ein VideoCD Plugin f&uuml;r BurnIT...

Immer wieder wird ja auch &uuml;ber die Gr&ouml;&szlig;e des Amiga-Marktes diskutiert, &uuml;ber
erhoffte Verkaufszahlen oder Mindestvorbestellungen bei neuen Spielen, beim
OS3.5, bei neuer Hardware, bei gewissen Emulatoren...
Nicht anders ist es bei den Spielen Heretic II und Shogo, die einerseits
zeigen sollen, da&szlig; auch aktuelle PC Games auf dem Amiga machbar sind,
andererseits aber ein neues Terrain betreten mit den sehr hohen
Hardwareanforderungen. Mit Sicherheit werden die Lizenzen f&uuml;r diese Spiele
nicht billig gewesen sein, aber erhoffte Verkaufszahlen von je 3000
Exemplaren der beiden Titel scheinen doch recht unrealistisch.
Daraufhin sprach ich kurz mit Hans-J&ouml;rg Frieden, der meinte, da&szlig; 3000
verkaufte Exemplare noch das Minimum darstellen, d.h. gerade mal die Kosten
decken und es sich ab 5000 erst richtig lohnen w&uuml;rde!!!
Wichtig sei ihnen aber auch (und eigentlich sogar noch wichtiger), da&szlig; die
Spiele nicht raubkopiert werden. Wenn sie lediglich 2000 Exemplare 
verkaufen w&uuml;rden, dann aber keine Raubkopie benutzt w&uuml;rde, w&auml;re das f&uuml;r sie 
immer noch ein Erfolg! Sollten sich die Spiele tats&auml;chlich gut verkaufen, 
will man sich um weitere Umsetzungen k&uuml;mmern (obwohl ja bereits an 4 
gearbeitet wird), denn "man h&auml;ngt ja schlie&szlig;lich am Amiga"! 
Nicht zu vergessen, die Pr&auml;sentation der ersten G3-Karte von met@box!!!
Na ja, fast zumindest...
Auch wenn bereits ein Prototyp gezeigt werden konnte, sah man am Stand von
Titan nur die leere Verpackung der amiJoe1200, Ende Januar sollten die 
Karten verf&uuml;gbar sein, zu einem Preis zwischen 895,- (amiJoe1200 mit 250MHz 
und 512 kb) und 1549,- (400/1Mb), weitere Zusatzmodule sind ebenso geplant, 
wie die amiJoe2000, 3000 und 4000. 

rbm digitaltechnik:
Die Eschweger zeigten uns auf der Messe ihre Towerhawks, die man nun auch 
je nach gew&uuml;nschter Farbe lackieren lassen kann. Desweiteren konnte man 
AmstroNG begutachten, welcher im Falle eines Stromausfalles daf&uuml;r sorgt, 
da&szlig; man noch eine gewisse Zeit weiterarbeiten kann (etwa 30 Minuten) und 
alle wichtigen Daten schnell sichern kann. 
F&uuml;r einige &uuml;berraschend pr&auml;sentierte man auch die neue Version von 
ScanQuix, die mittlerweile die Kennziffer 5 tr&auml;gt und einige Neuerungen 
gegen&uuml;ber den Vorg&auml;ngern bietet (ist eigentlich meistens so...), wie zum 
Beispiel: Bei Bildkorrekturen kann die Echtzeitanzeige ausgeschaltet 
werden--&gt;fl&uuml;ssigeres Arbeiten; volle Unterst&uuml;tzung des ICS-Farbmanagements; 
automatische Plazierung des Auswahlrahmens um das zu scannende Objekt und 
einiges mehr.
Zudem pr&auml;sentierte Felix Schwarz (Innovative) an diesem Stand auch seine
neue Bildbearbeitung fxPAINT, die OS3.5 und auch PPC unterst&uuml;tzt.
Die meisten Betrachter waren recht beeindruckt von diesem Programm.
Zudem wu&szlig;te man hier, wie man sich bei den Besuchern beliebt macht und
verteilte eifrig kleine Chips-T&uuml;ten, mjamm (neben dem netten M&auml;del, das die
T&uuml;ten verteilt hat, eigentlich der einzige Grund, weswegen ich an diesem
Stand vorbeigeschaut habe ;-))!

individual computers:
Jens Sch&ouml;nfeld hatte es sich in einer kleinen Ecke bequem gemacht, um sich 
in aller Ruhe mit den zahlreichen Fragen der Besucher auseinanderzusetzen, 
seine Schnittstellenkarte "Silversurfer" hatte sich besser als erwartet 
verkauft (bereits vor einiger Zeit waren schon 400 St&uuml;ck verkauft), so da&szlig; 
f&uuml;r Jens feststeht, da&szlig; es noch einen Amiga-Markt gibt, f&uuml;r den es sich 
lohnt zu entwickeln.
Somit bringt er uns als n&auml;chstes eine Ethernetkarte mit dem Namen X-Surf 
zum Preis von 189,-, die mittlerweile erh&auml;ltlich sein d&uuml;rfte.
Bitte weitermachen, Herr Sch&ouml;nfeld! 

Amiga Plus:
F&uuml;r mich war der Stand der Amiga Plus eine der gr&ouml;&szlig;ten Entt&auml;uschungen; fand 
sich hier in den letzten Jahren noch der ICP Verlag, beschr&auml;nkte man sich 
dieses Jahr lediglich auf den Verkauf der aktuellen Amiga Plus-Ausgabe und 
den Amiga-Tassen.
Mittlerweile wei&szlig; ja jeder, da&szlig; die Amiga Plus eigentlich nicht mehr
existiert, sondern mit der amigaOS, zumindest teilweise, fusioniert, aber
nachdem ich den Stand auf der Messe gesehen habe, kann mir keiner mehr
erz&auml;hlen, da&szlig; das Aus der A+ nicht schon eine Weile vorher feststand.
Vermisst habe ich am Stand zum Beispiel die CD-Pakete, wie sie fr&uuml;her immer
angeboten wurden, aber auch die Amiga Future, die ja zumindest vom selben
Verlag stammte, h&auml;tte man hier anbieten k&ouml;nnen.
Auf eine Anfrage sagte man mir, man k&ouml;nne ja nicht alles mitschleppen!
Wenn sich jemand den Stapel an A+ Ausgaben angesehen hat, fragt man sich 
eher, ob da jemand nicht eher nichts anderes mitnehmen wollte.
Zur AF sagte man nur, da&szlig; dies ja ausschlie&szlig;lich eine Zeitung f&uuml;r Freaks 
w&auml;re und das man am Samstag schlie&szlig;lich auch 10 Hefte mitgehabt h&auml;tte...
Herzlichen Gl&uuml;ckwunsch, tolle Leistung, was ist daran schlimm, eine
Zeitschrift f&uuml;r Freaks zu verkaufen, wenn man vor allem auch noch Geld 
damit verdient? Und sind nicht alle verbliebenen Amiga-User irgendwie 
Freaks? Na ja, sei's drum, am Ende bleibt lediglich festzuhalten, da&szlig; es 
wieder eine Amiga-Zeitschrift weniger gibt.

APC&TCP:
Der APC&TCP bot an seinem Stand jede Menge Software an, neben einigen neuen 
CD's pr&auml;sentierte man eine neue Wirtschaftssimulation namens Seaside, die 
zum Preis von 65,- erworben werden konnte.
Am interessantesten war aber die Demonstration der Space-Opera Phoenix, 
welche Marcus P&ouml;llmann vorf&uuml;hrte; einen Erscheinungstermin lie&szlig; er sich 
aber trotz einiger Nachfragen nicht entlocken.

Schatztruhe:
Das Highlight an diesem Stand war f&uuml;r mich der Tower von Heinz
Andreolla aus der Schweiz, der seinen Tower in m&uuml;hevoller Arbeit zu einem
absoluten Augenschmaus gemacht hat. Ich hoffe, da&szlig; jeder ein Bild dieses
Towers gesehen hat, denn beschreiben kann man ihn kaum, er sah einfach 
genial aus!
Ansonsten wurde hier nat&uuml;rlich auch wieder jede Menge Software angeboten, 
neu waren ein Astrologieprogramm namens Digital Almanac II und das PPC-
Rennspiel WipeOut 2097 von Digital Images, daneben lag auch Super View 
Productivity Suite als Version 2 vor und einige weitere Programme...
Auch "Mr. Aminet" Urban M&uuml;ller war am Schatztruhe-Stand anzutreffen.

Wer war noch auf der Messe? Der Amiga-Club im BTX und Internet, der Hilfe 
zu allen m&ouml;glichen Themen anbot und nat&uuml;rlich einige H&auml;ndler, n&auml;mlich ACT,
CoolBits, die Vorbestellungen f&uuml;r die G4-Karten von Phase 5 entgegennahmen,
Verkosoft, die sich eigentlich auch bereits vom Amiga verabschiedet haben,
aber noch das eine oder andere Angebot f&uuml;r unsere Freundin bereit hielten,
Elbox Computer und B&uuml;hler Elektronik.
Leider viel zu wenige! Und auch das Angebot war viel zu d&uuml;rftig! 
Grafikkarten oder PPC-Boards waren leider nirgendwo zu finden, ganz zu 
schweigen von wirklich interessanten Neuerscheinungen!
Dennoch waren die meisten Aussteller mit den Einnahmen auf der Messe
zufrieden, einige sogar sehr zufrieden.

Tja, was bleibt festzuhalten? Sicher war die Messe nicht gut, hatte aber 
auch seine positiven Seiten, so konnte man doch viele der Amiga-Freaks 
einmal sehen, die man sonst nur durch Mails o.&auml;. kannte. Bei nicht wenigen, 
die ein Namensschild auf der Brust pappen hatten, schielte ich doch etwas 
genauer drauf und konnte ab und zu ein Schmunzeln nicht verkneifen, deckte 
sich das tats&auml;chliche Erscheinungsbild doch so gar nicht mit meinen 
Vorstellungen...
Vor allem am Freitag, als es etwas leerer war, hatte man auch Gelegenheit 
mit vielen Programmierern, H&auml;ndlern und anderen wichtigen Leuten ein 
pers&ouml;nliches Gespr&auml;ch zu f&uuml;hren, wie es einem nicht oft m&ouml;glich ist.
Au&szlig;erdem konnte man auch wieder einige Schn&auml;ppchen machen; gerade wenn man 
in einem Ort wohnt, der fernab von einem Amiga-H&auml;ndler liegt, ist es 
interessant sich viele Produkte mal aus der N&auml;he anzuzusehen, oder auch die 
Portokosten zu sparen.

Dennoch &uuml;berwog f&uuml;r mich die negative Seite, vielleicht steckt einigen auch
noch die Entt&auml;uschung &uuml;ber die j&uuml;ngsten Entscheidungen bei Amiga Inc. in 
den Knochen, die einfach kein richtiges Wohlbefinden aufkommen lassen 
wollten.
Mit dem OS3.5 ist zumindest ein kleines Zeichen gesetzt worden, nun mu&szlig; 
aber endlich neue Hardware her, die endlich wieder neue und alte User ins
Amiga-Boot zur&uuml;ckholt, denn ansonsten ist der Amiga-Markt schon bald so
klein, da&szlig; weiterhin H&auml;ndler, Entwickler, etc. abspringen und keine
Umsatzm&ouml;glichkeiten mehr existieren. Dann w&auml;re Amiga nur noch ein Hobby.
Ans&auml;tze und M&ouml;glichkeiten gibt es sicher ein paar (Amirage, BoXeR,
PPC-Rechner), aber die bringen keinen weiter, so lange nicht gehandelt wird
und wirklich etwas reales vorgezeigt werden kann!

Ich hoffe, da&szlig; das neue Jahrtausend auch ein Neubeginn f&uuml;r Amiga wird und
w&uuml;nsche allen Lesern ein Frohes Neues Jahr, Gl&uuml;ck und Gesundheit!

F&uuml;r Fehler und Unvollst&auml;ndigleit haftet die Tastatur! 
 
Markus Tillmann«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
