<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
7.5. Reviews
------------

Total Distortion
----------------

Name des Spiels : Total Distortion
Hersteller      : Navigo
Voraussetzungen : 030          8MB Ram
erh&auml;ltlich bei  : Arktis

Grundlage       : (X) Vollversion      ( ) Demo     ( ) Andere:
 
Getestet auf    : ( ) 020/__   ( ) 030/__   (X) 040/40   ( ) 060/__
Grafikkarte     : ( ) Ja       (X) Nein     Welche:________________

Emulator        : (X) Fusion   ( ) ShaShi   ( ) mit Emplant  ( ) echter Mac
Mac-System      : ( ) 6._      ( ) 7._      (X) 8.0
Mac-Rom         : ( ) 128k     ( ) 256k     ( ) 512k     (X) 1MB            
           

Spielbeschreibung :

Total Distortion stellt ein Spiel etwas anderer Art dar, wird es doch in
der Anleitung als "Musikvideo-Adventure" angek&uuml;ndigt.
Drei Introsequenzen f&uuml;hren in die etwas obskure Story ein: Mit Hilfe eines
au&szlig;erirdischen Artefaktes gelingt es der Menschheit, Dinge und Gegenst&auml;nde
zu teleportieren - und zwar nicht nur von Punkt A zu Punkt B, sondern
obendrein zwischen verschiedenen Dimensionen. Diese Parallelwelten bilden,
so die Theorie, Tr&auml;ume von Menschen ab; vor allem die von Kindern, da diese
besonders intensiv tr&auml;umen.
Der Spieler schl&uuml;pft nun in die Rolle eines Musikvideoproduzenten, der sein
letztes Erspartes dazu benutzt hat, sich einen Turm zu bauen, mit dem er in
andere Dimensionen reisen kann, um dort neues und umwerfendes
Material f&uuml;r seine Videos zu finden.
Optisch pr&auml;sentiert sich das Ganze in einer h&uuml;bschen 3D-Welt, in der man
sich schrittweise bewegen und Dinge auf dem Bildschirm anklicken kann.
Ausger&uuml;stet mit einer Videokamera, einer Gitarre (die zum musikalischen
Duell verwendet wird) und einigen anderen n&uuml;tzlichen Dingen, geht es auf in
die Au&szlig;enwelt, um seine Film-Chips mit interessanten Szenen zu bespielen.
Diese kann man sp&auml;ter im Tower zu Videos zusammenschneiden, und an
verschiedene Produzenten schicken, um sich so Geld und Anerkennung zu
verdienen. 

Weitere Infos zum Spiel gibt es im Bilderarchiv auf der Homepage der AAKt,
das eine Herstellerbeschreibung von Total Distortion beinhaltet.


Spielgeschwindigkeit :

Da die Programmierer freundlicherweise auch die schrittweise Bewegung ohne
&Uuml;berblendungen implementiert haben, l&auml;uft das ganze Spiel recht flott.
Nichtsdestotrotz kann man bei einem Grafik-lastigen Adventure keine Wunder
erwarten; wer jedoch keinen gro&szlig;en Wert auf eine ruckelfreie Darstellung
legt, wird sich damit abfinden k&ouml;nnen.


Fazit :

Auch wenn ich nicht die Zeit hatte, das Spiel in seinen Tiefen zu
ergr&uuml;nden, macht es trotz seiner speziellen Thematik einen guten Eindruck.
Da es im Paket mit drei anderen Spielen (Super Spy, Rave Shuttle, Jewels of
the Oracle) angeboten wird, ist es durchaus ein anspielen wert. 



You don`t know Jack
-------------------

Name des Spiels : You don´t know Jack
Hersteller      : BMG Interactive
Voraussetzungen : 040   System 7.1+   6MB Ram     15MB HD-Space
erh&auml;ltlich bei  : Arktis

Grundlage       : (X) Vollversion      ( ) Demo     ( ) Andere:
   
                
Spielbeschreibung :

Wer bei dem Wort "Quizshow" sofort nach dem Ausschalter der Fernbedienung
tastet und bei einer m&ouml;glichen Umsetzung auf den Computer grausame
Erinnerungen an C64-Tage mit "Gl&uuml;cksrad" oder "Riskant" hervorkramt, der
hat noch nicht "You don´t know Jack" gespielt. Denn genau darum handelt es
sich bei dem Spiel: um eine "Interaktive Quizshow" im klassischsten Stil;
der Computer stellt eine Frage und die Spieler m&uuml;ssen per Multiple-Choice
die richtige Antwort geben.
Der besondere Reiz liegt nun nicht etwa in der gigantischen Aufmachung
(optisch macht das Ganze n&auml;mlich nicht viel her) oder in der riesigen
Auswahl an Spielm&ouml;glichen (es gibt etwa vier), sondern in der irrwitzigen
Art, wie Fragen gestellt und Antworten vorgegeben werden. Jede Frage
besitzt eine eigene Kategorie, deren Namensgebung schon alleine irrsinnig
komisch ist.
Noch witziger ist allerdings die eigentliche Fragestellung: oft werden ganz
einfache Sachfragen so gestellt, dass man vor lauter Lachen ganz vergi&szlig;t,
die Antwort zu geben.
Das alles w&auml;re aber nur halb so lustig, wenn das Spiel
einfach nur still &uuml;ber die B&uuml;hne gehen w&uuml;rde. F&uuml;r den n&ouml;tigen
Unterhaltungswert sorgt der Showmoderator Jack, der mit perfekter
Sprachausgabe (&uuml;ber 40 Stunden gesprochener Text) und einer tollen Betonung
Fragen vorliest, Antworten kommentiert und st&auml;ndig andere Anmerkungen von
sich gibt. Auch die sonstige Ger&auml;uschkulisse, sowie das Intro und Extro
vermitteln den Eindruck, man w&uuml;rde sich in einer, wenn auch etwas
skurilen, Gameshow befinden.


Spielgeschwindigkeit :

Dazu ist nicht viel zu sagen. Da sich das Spiel voll und ganz auf den
Inhalt konzentriert und nicht mit &uuml;berfl&uuml;ssigen Grafikspektakeln aufwartet,
l&auml;uft das Ganze nahezu vollkommen fl&uuml;ssig.


Fazit :

Wer einfach mal wieder kurzweiligen Spa&szlig; mit einem Computerspiel haben
m&ouml;chte und vielleicht noch zwei Freunde auftreiben kann, die sich auf das
Wagnis "You don´t know Jack" einlassen m&ouml;chten, der ist mit diesem Spiel
bestens bedient. Auch wenn man Aversionen gegen herk&ouml;mmliche Quizshows hat,
wird man hier voll auf seine Kosten kommen. Und da das Spiel als Hybrid-CD
vorliegt, kann man sich auch auf einem eventuell vorhandenen PC durch die 7
bzw. 21 Fragen k&auml;mpfen. 

Autor  : Andreas Koch
E-Mail : andreas.koch@wirtschaft.uni-giessen.de

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
