<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
13. Hilfe zu Wipeout 2097 (von Kai Eckardt)
-------------------------------------------

WipeOut 2097: Was tun, wenn nichts geht? 

Diese Seite wendet sich besonders an User mit einer CV64/3D, die WipeOut
trotz aller Hilfen noch nicht zum laufen bewegen konnten. Ich selber habe
nach mehreren erfolglosen Versuchen eine neue Partition eingerichtet, das
pure OS3.1 installiert, dann CGFX V4, WarpUp & Warp3D von der WipeOut CD.
Das traurige Ergebnis war, selbst hier brachte WipeOut heftige 
Grafikfehler, vom flimmernden Bildschirm bis zum Absturz. In diesem 
Dokument will ich nun kurz beschreiben, wie ich WipeOut auf folgendem 
Rechner zum laufen bekommen habe: A4000, CyberStormPPC mit 200 MHz, 64MB 
Ram, CV64/3D, CGFX V4, OS3.5

1. - CyberGFX V4 -
Bei den CGFX Tooltypes mu&szlig; BITMAPCACHE aktiviert und DRAGGING deaktiviert
sein, da Warp3D sonst nicht funktioniert. Au&szlig;erdem mu&szlig; HIDE15BIT 
deaktiviert sein, da man sonst keinen Screenmode ausw&auml;hlen kann! Im 
folgenden eine komplette Auflistung meiner Tooltypes & Umgebungsvariablen, 
mit denen WipeOut auf der CV3D funktioniert:

ALERTEMU=Ja, HIRESCRSR=Nein, PLANES2FAST=Nein, SUPERLAYERS=Ja, CPUP2C=nein,
KEEPAMIGAVIDEO=nein, SAVEMEM=nein, USESEMAPHORES=ja, HIDE15BIT=nein,
NOPASSTHROUGH=nein, SUPERGELS=ja, WBPATSPEEDUP=ja

Piktogrammmerkmale:
Hier habe ich lediglich BITMAPCACHE und MULTIMEDIAMEM aktiviert, alles
andere ist deaktiviert. Sie sollten au&szlig;erdem mit dem CGFX-Programm CGXMode
einmal testen, ob ihr 320*240*15 Modus richtig konfiguriert ist und 
&uuml;berhaupt ein Bild darstellt. Klicken sie dazu in CGXMode den Modus an, 
gehen auf Edit und anschlie&szlig;end auf Test. Es gibt bereits Updates zu CGFX 
V4, die Sie sich herunterladen sollten. Das erste Update enth&auml;lt laut 
'Readme' einen Bugfix zu einer Doublebuffering-Routine. Leider kann ich 
keine Aussagen zu CGFX V3 machen, da mir diese Version nicht mehr zur 
Verf&uuml;gung steht.

2. - VideoSpeicher -
Der Videospeicher ist eine wichtige Sache. Wenn ich die Workbench in
800*600*16 lasse und das Hintergrundbild mit WBPattern entferne (Men&uuml;punkt:
Auf Vorgaben zur&uuml;cksetzen), kann ich WipeOut mit 800KB Videospeicher in
320*240*15 bei Doublebuffering starten. Die beste M&ouml;glichkeit den gesamten
Videospeicher freizugeben besteht darin s&auml;mtliche Bildschirme die auf der
CV3D ge&ouml;ffnet sind (also die Workbench) auf PAL umzulenken (mit 
screenmode).
Wer einen A1200 besitzt kann hier gleich den heimischen Fernseher an die
eingebaute Videobuchse anst&ouml;pseln.

3. - Zerst&ouml;rte Grafik, fehlende Logos -
Am meisten Kopfzerbrechen hat mir die kaputte Grafik, Flimmern in Lores und
alles was dazugeh&ouml;rt gemacht. Es gibt eine recht einfache und wirkungsvolle
Methode dieses zu verhindern. In Lores-Aufl&ouml;sung wird das erste Logo bei
mir garnicht angezeigt. Nachdem sie in der Konfig auf Play gedr&uuml;ckt haben,
wird somit h&ouml;chstwahrscheinlich nichts geschehen, au&szlig;er da&szlig; Sie einen
schwarzen Bildschirm erhalten. Dr&uuml;cken sie jetzt einmal auf Return. Der
Amiga wird kurz laden, dann wieder stoppen. Dieses ist der Moment, wo das
2. Logo angezeigt werden sollte. Ist ihr Bildschirm noch immer schwarz,
dr&uuml;cken sie jetzt die Tasten AmigaLinks und N gleichzeitig. Dieses bringt
die Workbench wieder in den Vordergrund. Dr&uuml;cken Sie nun AmigaLinks und M.
Wenn Sie weiter keine Schirme ge&ouml;ffnet haben, sollten Sie wieder auf dem
WipeOut-Schirm gelandet sein. Bei mir wird jetzt das Logo angezeigt, sollte
dieses bei ihnen nicht der Fall sein, haben Sie entweder zu viel 
Videospeicher eingestellt oder es gibt irgendeinen anderen Grund. Sofern 
der Amiga nicht abgest&uuml;rtzt ist dr&uuml;cken Sie jetzt Return. Nachdem die 
HardDisk LED aufh&ouml;rt zu leuchten, dr&uuml;cken Sie erneut Return. Jetzt sollte 
das Menu, m&ouml;glicherweise wieder unvollst&auml;ndig oder flimmernd erscheinen. 
Sollte es so sein, dr&uuml;cken Sie erneut erst LAmiga+N, dann LAmiga+M. Bei mir 
ist das Menu dann perfekt da. Sie k&ouml;nnen dieses hin-und herschalten 
zwischen den Screens auch an anderen Stellen des Prgs probieren, z.B. 
w&auml;hrend des Ladevorganges.

4. - Sonstiges -
Sollte dieses alles nicht geholfen haben, gehen Sie doch noch folgende
Checkliste durch:

*  Sind die PowerUp-libraries inaktiv? machen Sie eine Sicherheitskopie
   von den 2 libraries Libs:ppc.library und Libs:ppcdis.library.            
   Deaktivieren Sie ggf. PPCinstall in der Startup-sequence oder user-      
   startup.

* Schauen Sie sich noch einmal die WipeOut-Mindestanforderungen an. Bei
  knappem Speicher versuchen Sie ohne startup-sequence zu booten, geben Sie
  dann loadwb und endcli ein.

*  Schreiben Sie mir eine EMail an DHA418@T-online.de !

Kai Eckardt &lt;DHA418@T-Online.de&gt;
 
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
