<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 02/98 - Intern</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amint.gif" ALT="Amiga-Aktuell 02/98 - Intern" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=Top>
<A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Kommentar zur Reaktion auf p.OS in Ausgabe 1/98 (von J&ouml;rg Handwerg)</H2>
&#187;Zu dem Brief von Gernod Schomberg &uuml;ber pOS m&ouml;chte ich doch noch einiges
anmerken:<P>
Sicherlich hat Gernod Schomberg recht, wenn er schreibt, da&szlig; es mit ein
paar bunten Bildchen und einem Sound beim &Ouml;ffnen einer Schublade nicht
getan ist.<BR>
Das ist aber auch bei weitem nicht, was pOS zu bieten hat! (Auch wenn das
Pre-Release dies bisher suggeriert und die ziemlich karge Beschreibung
seitens ProDAD diesen Eindruck erwecken kann.) Die "inneren" Werte des
Betriebssystems stellen doch etwas ganz anderes dar. Neben Features wie
echtem "vollem" Multitasking, Multithreading und anderem stellt es intern
die Weichen in Richtung Zukunft. Das AMIGA-Betriebssystem ist in der
heutigen Form zweifelsohne nicht mehr zukunftsf&auml;hig und w&uuml;rde und wird
sicherlich bei einer derartig starken Struktur&uuml;berarbeitung, wie sie
notwendig ist, um es "up-to-date" zu machen, auch durch die Firma AMIGA,
Inc. oder wie immer sie hei&szlig;t, zu Inkompatibilit&auml;ten f&uuml;hren. Diese lassen
sich einfach nicht ganz vermeiden! Man sollte auch einmal bedenken, da&szlig;
auch die Betriebssysteme OS 1.0 bis 3.1 immer wieder leichte
Inkompatibilit&auml;t mit sich brachte. Es ist nat&uuml;rlich richtig, da&szlig; es sehr
teuer und aufwendig f&uuml;r einen User ist, diesen Schritt mitzuvollziehen,
deshalb ist es um so wichtiger, hier vertr&auml;gliche &Uuml;bergangsl&ouml;sungen zu
bieten, wie dies auch auf dem MAC erfolgreich geschehen ist. Allerdings
wird auch Gernod sicher nicht bis in alle Ewigkeit die gleiche Software
benutzen wollen, sondern sich gelegentlich mal eine neue Software
zulegen, und dann sollte er eben zukunftsf&auml;hig investieren. Im &uuml;brigen ist
doch genau das Festhalten wollen an allem "Heutigen", was Innovation
unm&ouml;glich oder eben unsagbar schwer macht, und somit genau das, was man dem
PC immer vorwirft.<BR>
G&uuml;nstige Cross-Updates sollen ja f&uuml;r einige Software zur Verf&uuml;gung stehen,
wie man von ProDAD h&ouml;ren lie&szlig;. Wem das alles noch nicht reichen sollte, der
kann seine alte Software ja immer noch &uuml;ber einen Amiga-Emulator laufen
lassen oder auf einer weiteren Partition das Amiga OS installieren.
Da pOS auch auf anderen Plattformen laufen wird, wird es f&uuml;r
Softwareproduzenten auf jeden Fall sehr interessant, f&uuml;r dieses
Betriebssystem zu entwickeln. Eine Alternative zu pOS sehe ich in
greifbarer Zukunft jedenfalls nicht (erst recht nicht f&uuml;r den PPC).
Empfehlenswert ist, sich diesbez&uuml;glich mal die Seiten im I-NET von ProDAD
(<A HREF="http://www.prodad.de">www.prodad.de</A>) anzusehen.&#171;<P>
Die Meinungen zu p.OS gehen in der AMIGA-Gemeinde bekanntlich weit
auseinander. Gibt es weitere Statements zu dieser Software bzw. den bislang
ver&ouml;ffentlichten Meinungen? Schreibt an:<P>
Carsten Schr&ouml;der<BR>
Helmoltstra&szlig;e 10<BR>
37081 G&ouml;ttingen<P>
E-Mail: <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>

<CENTER><BR><A HREF="0013.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0015.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 02/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int1.gif" ALT="[Intern]" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

