<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 02/98 - Intern</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amint.gif" ALT="Amiga-Aktuell 02/98 - Intern" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=Top>
<A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Kritik an AMIGA aktuell (von Christian Wimmer)</H2>
&#187;[...] SO jetzt noch Verbesserungsvorschl&auml;ge:<P><BR>
Nehmt die Kleinanzeigen raus!<P>
Ich wei&szlig; nicht, aber wenn ich die AmigaAktuell in der Nocover seh, ist das
doch irgendwie komisch...<BR>
Au&szlig;erdem sind Kleinanzeigen wohl in nem Newsmag nich so doll.<P><BR>

<B>CS&gt;</B> <I>Ich pers&ouml;nlich bin anderer Ansicht. Wenn jemand eine Kleinanzeige
aufzugeben hat, wieso soll er das nicht machen?
Die Umfrage vor ein paar Monaten ergab, da&szlig; sich ein Gro&szlig;teil der Leser
den &Uuml;bergang zu einem Vollmagazin w&uuml;nscht, und fast jedes AMIGA-Magazin
(z.B. ja auch die NoCover) enth&auml;lt Kleinanzeigen. Zudem entscheidet ja
immer noch das Interesse: Wenn es keine Kleinanzeigen zu
ver&ouml;ffentlichen gibt, ver&ouml;ffentliche ich auch keine...</I><P>
Na ja, mich st&ouml;rt das Forum sowieso. VIEL Text und keine Info.
Da hat einer 'n Prob und dann kommen seitenlange Infos und Beschreibungen.
Puhh, w&auml;r's nicht cleverer, dem Fragenden die Antworten per E-Mail zu
schicken ? Denn wie viele User hat dieses spezielle DirOpus-Problem
interessiert?<P>
<B>CS&gt;</B> <I>Das ist ein nachdenkenswerter Punkt. Was aber ist, wenn dieses Problem
doch noch jemanden besch&auml;ftigt? Zudem ist es etwas seltsam, wenn in
einem Forum nur Fragen gestellt werden, aber keine Antworten
erscheinen. Dann w&uuml;rde es innerhalb k&uuml;rzester Zeit an Attraktivit&auml;t
verlieren.</I><P>
Ich denke, nur den Fragenden! Auch die Leserbriefe. NA ja.
Viel zu viel des guten. Okay es w&auml;re vielleicht angebracht, die Leserbriefe
zu k&uuml;rzen. Denn sie sind ja doch etwas lang und werden wohl selten von
vielen Leuten gelesen. Vor allem die Verbesserungsvorschl&auml;ge f&uuml;r Amiga
Aktuell. Wenn die gut sind oder evtl. von allgemeinem Interesse sind,
kannste sie ruhig dort lassen. Aber so bl&auml;tter ich eigentlich weiter.<P>
<B>CS&gt;</B> <I>Auch wieder so ein Fall: Leserbriefe k&uuml;rzen. Das habe ich ja bei Deinem
nun getan. Aber oft ist es so, da&szlig; ein Leserbrief sich mit nur ein oder
zwei Themen besch&auml;ftigt, und wo soll ich da k&uuml;rzen?</I><P>
Die Vorank&uuml;ndigungen sind ja nicht schlecht. Doch man sollte vielleicht
nicht alles reinnehmen. Letztes Mal waren einige MUI-Sachen dabei. Viele
Seiten zum &uuml;berbl&auml;tern... Denn mich interessiert das ABSOLUT nicht. Und ich
denke, vielen geht es wie mir!<P>
<B>CS&gt;</B> <I>Wenn ich Produktank&uuml;ndigungen ber&uuml;cksichtige, dann alle. Erwartest Du,
da&szlig; Dir jeder Teil eines Magazins gef&auml;llt? Es gibt auch AMIGA-aktuell-
Leser, die der Auffassung sind, ich solle ruhig Beitr&auml;ge hineinnehmen,
die nicht jeden interessieren, da man diese ja &uuml;berlesen kann. Wenn Du
Dir AMIGA aktuell direkt &uuml;ber den NoCover-Anzeiger anschaust, dann ist
das Deine Sache.</I><P>
Auch finde ich das die AmigaAktuell immer schlechter wird.
Nicht, da&szlig; Du mich falsch verstehst: Sie ist immer noch prima. Aber unter
DER Masse Text findet man die interessanten Sachen nicht mehr so schnell.
Vor allem nerven mich diese ellenlangen "Werbetexte".
Also Pressemitteilungen, Produktank&uuml;ndigungen .... .<P>
<B>CS&gt;</B> <I>Die erw&auml;hnte Umfrage hat aber ergeben, da&szlig; viele Leser diese Info-Texte
interessant finden und sie in AMIGA aktuell sehen wollen.</I><P>
Das war, bzw. ist, auch bei WARPUP/WARPOS vs. PowerUp so.
SEITENLANGES Gefasel wo nur noch Programierer durchblicken.
Das ist es nicht was ich mir von einem NEWS-Mag vorstelle ..<P>
<B>CS&gt;</B> <I>Damit wollte ich deutlich machen, wie sehr die Meinungen zu WarpUp
auseinandergehen. Aber da&szlig; das nicht jedermanns Sache war, sehe ich
ein.</I><P>
Allgemein erkennt man bei Amiga Aktuell eins: Der Textumfang
steigt und steigt und die allgemeine Qualtit&auml;t sinkt :(<P>
<B>CS&gt;</B> <I>Danke f&uuml;r Deine Offenheit. An die anderen AMIGA-aktuell-Leser: Sehr Ihr
das genauso? Sofern Ihr Euch an dieser Diskussion beteiligt (s. u.),
w&auml;re es gut, wenn Ihr zu diesem Punkt Stellung nehmen k&ouml;nntet.
Ich ging bislang davon aus, da&szlig; die inhaltliche Qualit&auml;t in etwa
gleichbleibend ist, aber ich lasse mich gern eines Besseren belehren.
Schlie&szlig;lich ist AMIGA aktuell ein Mag, das ma&szlig;geblich nach den W&uuml;nschen
seiner Leser gestaltet werden soll.</I><P>
Aber bis jetzt ist Amiga Aktuell immer noch eine gute, und vor allem
SCHNELLE Infoquelle. Das ist es, was ich von AmigaAktuell will. Es gibt
doch mittlerweile schon SO viele Diskmags, die man nicht mal alle lesen
kann. Und dann noch eins? Nee mu&szlig; nich sein! Mir hat AmigaAktuell als
Newsmag besser gefallen.<P>
<B>CS&gt;</B> <I>Vielen anderen Lesern offenbar nicht. Es sei denn, sie haben nach der
AMIGA-aktuell-Umfrage ihre Meinung pl&ouml;tzlich ge&auml;ndert.<BR>
Zwar war es da auch schon teilweise " aufgebl&auml;ht ", aber es
hielt sich in Grenzen!<P></I>
Noch was zur NoCover-Verbreitung: Layoutest du selber?
Wenn ja: Splitte doch Amiga Aktuell noch mehr!
Au&szlig;erdem sollte der AGPJ seinen eigenen Link kriegen
oder zumindestens am Anfang stehen. Wenn nein: SORRY!<P>
CS&gt; <I>Doch, ich layoute AMIGA aktuell selbst - leider. Ich finde diese Arbeit
n&auml;mlich gr&auml;&szlig;lich. Da das Layout meinen W&uuml;nschen entsprechen soll,
m&ouml;chte ich es jedoch weiterhin selbst machen.
Ich habe Andy (f&uuml;r nicht NoCover-Leser: Andreas Magerl, Chefredakteur
der NoCover) vor einiger Zeit vorgeschlagen, jeden Monat die
AMIGAGuide-Version von AMIGA aktuell auf die NoCover-Diskette zu
bringen, womit Andy leider nicht einverstanden war.
Das h&auml;tte mir eine Menge Arbeit erspart, und vor allem w&auml;re es f&uuml;r die
NoCover-Leser eine komfortable L&ouml;sung gewesen, um besser zwischen den
einzelnen Artikeln ausw&auml;hlen zu k&ouml;nnen. Auch platzm&auml;&szlig;ig h&auml;tte es keine
Probleme gegeben, wenn das AMIGA-aktuell-Guide mit dem PowerPacker
komprimiert worden w&auml;re (wie das schon im StarMag der Fall ist). Zwar
h&auml;tte dann noch das Programm "ppguide" auf die Diskette gemu&szlig;t, aber
dessen Speicherplatzbelegung w&auml;re durch die im Vergleich zum
MagneticPages-Format geringere Gr&ouml;&szlig;e des AMIGAGuide-Formats in etwa
wieder ausgeglichen worden.
Durch die Verwendung der speicherplatzsparenden Bildformate PNG und
JPEG h&auml;tte es vielleicht sogar ab und zu die M&ouml;glichkeit gegeben,
einen Teil der in der HTML- und AMIGAGuide-Version enthaltenen Grafiken
auf den NoCover-Disketten zu ver&ouml;ffentlichen.</I><P>
Also Ill read your Mag!<P>
Christian Wimmer DOSO@HIGHVOLT.GUN.DE&#171;<P><BR>
Nun folgt mein Aufruf an die &uuml;brigen AMIGAaktuell-Leser: K&ouml;nnt Ihr
Christians Kritikpunkte nachvollziehen, haltet Ihr sie f&uuml;r unbegr&uuml;ndet,
oder habt Ihr andere Kritik vorzubringen? Schreibt mir bitte, z.B. per E-
Mail: <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>
<CENTER><BR><A HREF="0019.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="1100.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 02/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int1.gif" ALT="[Intern]" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

