<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 02/98 - Test</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amite.gif" ALT="Amiga-Aktuell 02/98 - Test" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>

</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Softwaretest: Erdkundeprogramm "Geoworld"</H2>
<B>&Uuml;berblick:</B><P>
Geoworld ist ein neues Erdkundeprogramm von Andr&eacute; und Ronny Beer. Es
ben&ouml;tigt einen AMIGA bzw. -kompatiblen Rechner mit OS 2.0 oder h&ouml;her,
Grafikkarte oder AGA-Chipsatz, 3 MB RAM (davon 1,5 MB Chip-RAM) sowie
<B>Festplatte.</B><BR>
Die Registrierungsgeb&uuml;hr der als Shareware herausgegebenen Software betr&auml;gt
DM 30,- (inkl. gedruckter Anleitung sowie Porto und Verpackung) bzw. DM
25,- bei &Uuml;bertragung per E-Mail.<P><BR>
Die Kontaktadresse zu den Autoren:<P>
Andr&eacute; und Ronny Beer<BR>
Siedlung 6<BR>
09548 Deutscheinsiedel<BR>
Tel. 037362/76934<BR>
E-Mail: <A HREF="mailto:j.beer@abo.freiepresse.de">j.beer@abo.freiepresse.de</A><P>
Eine Demoversion des Programms l&auml;&szlig;t sich von der Homepage
<A HREF="http://www.freiepresse.de/home/jubee/geoworld.html">http://www.freiepresse.de/home/jubee/geoworld.html</A> downloaden.<P><BR>
<B>Der Test:</B><P>
Nach der problemlosen Installation und dem Programmstart pr&auml;sentiert sich
Geoworld mit einer Weltkarte, auf der die einzelnen L&auml;nder durch
unterschiedliche F&auml;rbung voneinander getrennt sind. Die Genauigkeit der
Grenzen ist recht hoch.<P>
Geoworld bietet die M&ouml;glichkeit, Kontinente und sogar einzelne L&auml;nder
bildschirmf&uuml;llend darzustellen (sogar die wichtigsten Fl&uuml;sse und die
Bundesstaaten der USA sind im detailliertesten Format eingezeichnet)
und Informationen zu dem betreffenden Staat abzurufen.
Diese sind in mehrere Bereiche (Allgemeines, Internationale Vereinigungen,
Staatsform - Politik, Naturraum - Klima, Bev&ouml;lkerung, Wirtschaft,
Geschichte, Sonstiges) untergliedert. Auch abh&auml;ngige Gebiete lassen sich
anzeigen. Einige der Daten fehlen in der verwendeten Testversion jedoch
noch.<P>
W&auml;hrend die meisten Angaben keinen Anla&szlig; zur Kritik geben, sollte der
Bereich "Geschichte" doch noch einmal gr&uuml;ndlich &uuml;berarbeitet
- und vor allem erg&auml;nzt - werden. Wichtige Daten fehlen teilweise, w&auml;hrend
weniger bedeutsame enthalten sind. Zwei Beispiele nur:
1. Deutschland: Hier sind zwar mehrere Bundeskanzler aufgef&uuml;hrt, und auch
die Einf&uuml;hrung der Wehrpflicht (1956), die gewaltlose Revolution in der
damaligen DDR (1989) fehlt dagegen v&ouml;llig.
2. Beispiel: T&uuml;rkei. Auch der ber&uuml;hmte Staatsmann und Gr&uuml;nder der
unabh&auml;ngigen T&uuml;rkei Atat&uuml;rk ist nicht aufgef&uuml;hrt.<P>
Zur&uuml;ck zum Positiven: Das Programm kennt &uuml;ber 2000 deutsche und viele
ausl&auml;ndische St&auml;dte. Deren geographische Lage l&auml;&szlig;t sich ebenso anzeigen wie
wichtige Informationen (Allgemeines, Wirtschaft, Infrastruktur, Tourismus,
Geschichte, Sonstiges), wobei auch diese Daten in der vorliegenden Version
noch nicht vollst&auml;ndig implementiert sind. Bislang Fehlendes soll jedoch in
der Vollversion weitgehend enthalten sein bzw. den Usern als kostenloses
Update u.a. &uuml;ber das Aminet und die WWW-Site zug&auml;nglich gemacht werden.
Den Ausdruck der Daten erm&ouml;glicht ein eigenes Druckmen&uuml;, das auch die
Umleitung in eine Datei beherrscht.<BR>
Geoworld bietet eine flexible Sortierfunktion: Die L&auml;nder-Auswahlliste kann
wahlweise ab- oder aufsteigend nach Name, Fl&auml;che, Einwohner,
Bev&ouml;lkerungsdichte oder Autokennzeichen geordnet werden. Bei St&auml;dten gibt
es die Optionen Name, Einwohner, Gr&uuml;ndungsjahr, H&ouml;he, Postleitzahl und Kfz-
Kennzeichen.<BR>
Per eingebauter Suchfunktion lassen sich L&auml;nder und St&auml;dte schnell finden.
Der Nutzer ist dabei nicht auf den Namen angewiesen, denn es gibt acht (bei
St&auml;dten) bzw. zehn (bei L&auml;ndern) weitere Kategorien, nach denen gesucht
werden kann.<BR>
Abgerundet wird das Programm durch ein Quiz, bei dem Multiple-Choice-Fragen
gestellt werden.<BR>
&Uuml;brigens sorgt eine eingebaute Hilfe-Funktion daf&uuml;r, da&szlig; auch Erstbenutzer
gut mit dem Programm zurechtkommen. Durch flexible
Einstellungsm&ouml;glichkeiten l&auml;&szlig;t sich Geoworld an die W&uuml;nsche des Anwenders
anpassen.<BR>
St&ouml;rend bemerkbar machte sich w&auml;hrend des Tests die in der vorliegenden
Version recht hohe Absturzfreudigkeit.<P><BR>
<B>Fazit:</B><P>
Geoworld ist bereits jetzt ein empfehlenswertes Programm. Sobald die
angesprochenen Kritikpunkte beseitigt und der Datenbestand erg&auml;nzt werden,
gibt es f&uuml;r interessierte Anwender kaum einen Grund, sich das Programm
nicht zuzulegen.<BR>
Aber vielleicht hat Geoworld ja auch das Zeug zu "mehr"? Ich denke da
spontan an einen elektronischen Weltaltas, f&uuml;r den z.B. der in Geoworld
eingebaute Datenbestand gut benutzt werden k&ouml;nnte. Ob jedoch die verwendete
Programmiersprache (BlitzBasic) f&uuml;r ein solch anspruchsvolles Projekt
geeignet ist, ist eine andere Frage.
<A HREF="Geoworld.png"><IMG WIDTH=320 HEIGHT=240 SRC="Geoworldsm.gif" ALT="Screenshot - click fuer volle Groesse"></A>
<CENTER><BR><A HREF="0100.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0102.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A>
<BR>
<H3><B>Ausgabe 02/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test1.gif" ALT="[Test]" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

