<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 02/98 - Test</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amite.gif" ALT="Amiga-Aktuell 02/98 - Test" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>

</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Softwaretest: "MysticView" (von Uwe Pannecke)</H2>
&#187;Endlich mal ein Bildanzeiger f&uuml;r meinen Amiga.
Das gab es ja noch nie...<BR>
Es ist zwar der 3425ste Bildanzeiger, aber er hat es in sich.<P>
Um MysticView benutzen zu k&ouml;nnen, ben&ouml;tigt man mindestens OS 3.0, einen
68020-Prozessor, m&ouml;glichst viel RAM (mind. 4 MB) und ein installiertes
Datatypes-System. Nat&uuml;rlich werden auch schnellere Prozessoren und
CybergraphX sowie Picasso96 unterst&uuml;tzt.<P>
Das aktuelle MysticView-Archiv bietet entpackt neben dem Programm f&uuml;r die
verschiedenen 68k-Prozessoren eine Amigaguide-Hilfe in Englisch und eine
Installationshilfe.<BR>
Nach Doppelklick auf das Install-Icon landen die ben&ouml;tigten Bibliotheken im
Verzeichnis LIBS, wird die passende Programmversion und die Amigaguide-
Datei an frei w&auml;hlbarer Stelle auf die Festplatte gebannt.<P><BR>
Und dann kann es losgehen.<P>
Ich habe die 040er-Version unter CybergraphX 2.25 getestet.<P>
MysticView &ouml;ffnet bei erstmaligem Start ein Fenster auf der Workbench.
Von diesem Fenster aus lassen sich s&auml;mtliche Funktionen des Programmes
nutzen. F&uuml;r alle Shell-Fetischisten gibt es nat&uuml;rlich auch die volle
Kontrolle &uuml;bers CLI.<BR>
Dar&uuml;ber hinaus sind viele Parameter auch in den ToolTypes des Icons
speicherbar.<P>
MysticView nutzt f&uuml;r die Anzeige die vorhandene Hardware nach Wunsch
vollst&auml;ndig aus, so da&szlig; unter CyberGfx oder Picasso96 True-Color (also
Millionen von Farben) kein Problem darstellt.
Die Anzeige der Bilder erfolgt in akzeptabler Geschwindigkeit.
CyberView ist etwas schneller, MultiView ben&ouml;tigt etwas mehr Zeit.<P>
MysticView benutzt die Datatypes f&uuml;r die Bildanzeige. Deshalb k&ouml;nnen
s&auml;mtliche Bildformate, f&uuml;r die ein Datatype im System installiert ist,
dargestellt werden.<BR>
Von mir getestete Bildformate:<BR>
IFF-ILBM, GIF, JPEG, PNG, TIFF, EPSF, AMF.<P>
Wenn die simple Anzeige von Bildern schon alles w&auml;re, lohnte es sich kaum,
MysticView zu erw&auml;hnen.<P>
Aber das Programm bietet eine ganze Menge mehr:<BR>
Die Anzeige der Bilder selbst kann auf sehr flexible Art und Weise
beeinflu&szlig;t werden: z.B.
<UL>
<LI>automatische Skalierung des Bildes auf Fenstergr&ouml;&szlig;e,
<LI>1:1-Bildpixeldarstellung, unabh&auml;ngig von Fenstergr&ouml;&szlig;e, wobei das Bild
   mit Hilfe der Maus beliebig im Fenster verschoben werden kann,
<LI>Beibehaltung oder Ignorierung der Seitenproportionen des Bildes,
<LI>horizontales und vertikales Spiegeln,
<LI>Zoomfunktion,
<LI>bei Farbreduzierung Nutzung aufwendiger Render- und Ditheralgorithmen
<LI>Fenster auf Workbench, Public- oder Custom-Screens
<LI>Unterst&uuml;tzung von drag'n drop,
<LI>und noch vieles mehr
</UL>
Dar&uuml;ber hinaus kann auf einfachste Weise eine Dia-Show erzeugt werden.
Einfach die gew&uuml;nschten Bilder eines Verzeichnisses sowie die Zeitspanne
zwischen den Bildwechseln w&auml;hlen - fertig.<BR>
&Uuml;ber ein ListFile, d.h. ein einfaches Textskript l&auml;&szlig;t sich mit etwas mehr
Aufwand auch eine anspruchsvolle Dia-Show veranstalten.<P>
MysticView liegt mir f&uuml;r diesen Test in der Version 0.98a vor.
Und als Beta-Version leistet es schon Erstaunliches.<P>
Wo Licht ist, findet man auch Schatten. So auch bei MysticView.
Das Programm hatte mit einigen meiner JPEG-Bilder erhebliche Probleme und
brachte lediglich ein "error loading xxx.jpg". Erstaunlicherweise hatten
MultiView, VT, CyberView und andere Bildanzeiger unter den gleichen
Systemvoraussetzungen keine Probleme mit diesen Bildern.
An den Datatypes kann es nicht gelegen haben, da MultiView ebenfalls auf
diese zur&uuml;ckgreift. Bei den anderen getesteten Bildformaten gab es keine
Probleme.<BR>
Ein zweiter Schwachpunkt ist die fehlende R&uuml;ckmeldung &uuml;ber den aktuellen
Status des Programmes. Dies macht sich insbesondere bei unbekannten
Bildformaten st&ouml;rend bemerkbar. MysticView ignoriert diskret das Bild.
Der User wei&szlig; insbesondere bei gr&ouml;&szlig;eren Bildern nicht, ob das Programm
eventuell noch intensiv mit Lade- / Umrechnungsalgorithmen zu tun hat oder
stillschweigend auf den n&auml;chsten Befehl wartet. Beim St&ouml;bern in gro&szlig;en CD-
Archiven ohne eindeutige Kenntnis des Bildformates (fehlende Dateiendung)
eine nervenaufreibende Angelegenheit.<BR>
Eine Fortschrittsanzeige w&uuml;rde dieses Problem elegant l&ouml;sen.<P><BR>
<B>Fazit:</B><P>
MysticView ist ein einfach zu benutzender Bildanzeiger mit modernen
Features und einer hohen Flexibilit&auml;t.
Das Programm l&auml;uft stabil und fast fehlerfrei (siehe Problem JPEG).
Sinnvoll w&auml;re f&uuml;r zuk&uuml;nftige Versionen eine Fortschrittsanzeige f&uuml;r Lade-
und Render-/ Ditherfunktionen oder zumindest eine Statusanzeige sowie eine
Unterst&uuml;tzung der Lokalisierung.<P><BR>
<A HREF="MysticView.png"><IMG WIDTH=320 HEIGHT=240 SRC="MysticViewsm.gif" ALT="Screenshot - click fuer volle Groesse"></A>
<B>Quelle:</B><P>
MysticView ist u.a. im Aminet zu finden unter "gfx/show/MysticView".<P>
Das Programm ist Shareware. Bei h&auml;ufigerer Nutzung bittet der Autor
Timm Mueller um Zahlung von 15 DM. Um die Zahlungsmoral anzukurbeln, hat
der Autor zwei (kleine) Einschr&auml;nkungen in die unregistrierte Version
eingebaut:
<UL>
<LI>hin und wieder erscheint im angezeigten Bild
please register",
<LI>die Thumbnail-Funktion ist nicht nutzbar.
</UL>
Uwe Pannecke<BR>
<A HREF="mailto:Uwe.Pannecke@t-online.de">Uwe.Pannecke@t-online.de</A>&#171;

<CENTER><BR><A HREF="0101.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0200.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A>
<BR>
<H3><B>Ausgabe 02/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test1.gif" ALT="[Test]" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

