<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 02/98 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Spiele-News aus aller Welt</H2>
<UL>
<LI><B>Quake kommt !!!</B><P>
<CENTER><A HREF="AmigaQuake.jpg"><IMG WIDTH=320 HEIGHT=240 SRC="AmigaQuakesm.gif" ALT="Screenshot - click fuer volle Groesse!"></A></CENTER>
Nun ist es offiziell. Quake wird f&uuml;r den Amiga umgesetzt. clickBOOM hat
die Rechte f&uuml;r eine Amiga-Version von id Software gekauft und will das
Spiel schon im Februar ver&ouml;ffentlichen. Damit erscheint eine Amiga-
Quake-Version noch bevor Versionen f&uuml;r die Playstation und die Nintendo
64-Konsole herausgekommen sind. Die Amiga-Quake-Version wird alle Features
der PC-Version bieten, also auch die M&ouml;glichkeit Level-Add-ons zu benutzen
und Quake &uuml;ber das Internet zu spielen. Der Weg ist also frei f&uuml;r die
ersten Amiga-Quake-Clans, die durch das Netz streifen und den PC-Clans
das F&uuml;rchten lehren.<BR>
Die minimalen Systemvoraussetzungen sind eine 68020-CPU + FPU, AGA oder
Grafikkarte, 8 MB Fast-RAM, CD-ROM und 35 MB Platz auf der Festplatte.
Allerdings wird das Spiel auf einer solchen Konfiguration allenfalls
laufen, gut spielbar wird es garantiert nicht sein, es sei denn, clickBOOM
vollbringt ein Wunder. Die minimale von clickBOOM empfohlene Konfiguration
ist eine 68040-CPU + FPU, und um in den perfekten Genu&szlig; von Quake zu
kommen, sollte man laut clickBOOM eine 68060- oder PowerPC-CPU und 16 MB
Fast-RAM haben.<BR>
Hier noch die weiteren Features von Quake Amiga:<BR>
<UL>
<LI>100 % identisch zur PC-Version
<LI>JEDES Quake-Add-on nutzbar (also neue Levels, neue Waffen, Total Con-
versions - z.B. James Bond in Tomorrow Never Dies, QuakeRally, AirQuake,
etc.)
<LI>diverse Steuerungsm&ouml;glichkeiten (Tastatur, Maus, Joystick, CD32-Joypad)
<LI>volles Multitasking
<LI>locale-Support
<LI>Men&uuml;s im AMIGA-Stil
<LI>ARexx
<LI>Multiplayer-Spiel:
<UL>
<LI>&uuml;ber Internet, Modem, Null-Modem-Kabel und IPX
</UL>
<LI>Grafik:
<UL>
<LI>AGA / CyberGFX / Picasso 96
<LI>JEDER Screenmode
<LI>8 Bit und 16 Bit Gfx
<LI>Pixelmodi: 1x1, 1x2, 2x2, odd, oddx2
<LI>spielbar auf einem Public Screen in einem gr&ouml;&szlig;enverstellbarem Fenster
<LI>"mmuhack" (verbessert Geschwindigkeit bei 040 und 060-CPUs)
</UL>
<LI>Sound:
<UL>
<LI>AHI und custom sound Routinen
<LI>Frequenz-Einstellungen
<LI>Musik direkt von CD (Musik von Trent Reznor und Nine Inch Nails)
</UL></UL><P>
Da Quake in Deutschland auf dem Index der Bundespr&uuml;fstelle f&uuml;r
jugendgef&auml;hrdende Schriften steht, wird Quake Amiga nicht &uuml;ber den
Versandhandel erh&auml;ltlich sein. Die beste M&ouml;glichkeit, das Spiel zu
bekommen, ist die direkte Bestellung bei clickBOOM f&uuml;r 90 DM.
clickBOOM arbeitet au&szlig;erdem an einem "Quake TNT Pack". Diese CD wird 600MB
an "total conversions", "partial conversions", Filmen, Demos, Levels und
anderen Dateien bieten, die direkt mit Quake zu tun haben. Registrierte
Quake-K&auml;ufer werden 50 % Rabatt auf diese CD bekommen.<BR>
Auch Quakeworld wird von clickBOOM f&uuml;r den AMIGA ver&ouml;ffentlicht. Es handelt
sich hierbei um eine Multi-Player-Version von Quake, die besonders f&uuml;r
langsamere TCP/IP-Verbindungen gedacht ist. K&auml;ufer von Quake erhalten
Quakeworld kostenlos.<P><BR>
<LI><B>Doom ist da !!!</B><P>
Ende Dezember &uuml;berschlugen sich die Ereignisse bez&uuml;glich Doom f&uuml;r den
AMIGA. Kurz nach Freigeben des Source-Codes durch id Software waren
innerhalb k&uuml;rzester Zeit mehrere verschiedene Doom-Portierungen erh&auml;ltlich.
Mittlerweile gibt es X verschiedene Ports mit unterschiedlicher Qualit&auml;t.
Einen kleinen &Uuml;berblick &uuml;ber die verschiedenen Versionen findet Ihr weiter
unten. F&uuml;r alle, die sich noch selbst an einem Port versuchen wollen, kommt
hier die FTP-Adresse des Sourcecodes:<P>
<A HREF="ftp://ftp.idsoftware.com/idstuff/source/doomsrc.zip">ftp://ftp.idsoftware.com/idstuff/source/doomsrc.zip</A><P><BR>
<LI><B>Kein Doom 2 von Alive MediaSoft</B><P>
Nachdem der Doom-Sourcecode freigegeben wurde, hat sich eine Doom- bzw.
Doom2-Version f&uuml;r den Amiga von Alive MediaSoft er&uuml;brigt, zumal die PC-
Versionen der Spiele mit den Amiga-Portierungen spielbar sind. Alive
MediaSoft wollte zwar trotzdem ihre Version von Doom 2 ver&ouml;ffentlichen,
die angeblich besser als die bisherigen Portierungen sein sollte, doch
gibt es inzwischen Schwierigkeiten mit id Software, und das Spiel wird
nicht erscheinen.<P><BR>
<LI>Descent-Sourcecode freigegeben<P>
Nach Doom ist Descent nun der zweite bekannte 3D-Shooter, dessen
Sourcecode freigegeben wurde. Da wird sich doch jemand finden, der einen
AMIGA-Port programmiert... Den Sourcecode gibt's zumindest hier:
<A HREF="http://www.ladder.org/ddr/">http://www.ladder.org/ddr/</A><P><BR>
<LI><B>Genetic Species fast fertig</B><P>
Der 3D-Shooter Genetic Species von Vulcan Software ist nahezu fertig
und wird im Februar erscheinen.<P><BR>
<LI><B>Riven f&uuml;r AMIGA? - Teil 2</B><P>
Ger&uuml;chten zufolge soll der Myst-Nachfolger Riven bereits im Mai auf 7
CD-ROMs bei clickBOOM erscheinen.<P><BR>
<LI><B>neue Spiele von Titan Computer</B><P>
Titan Computer hat zwei neue Spiele angek&uuml;ndigt, die jeweils einen 68040-
oder einen PowerPC-Prozessor voraussetzen. Total Combustion ist ein 3D-
Auto-Kriegs-Rennspiel, dessen Vorbild das PC-Spiel "Carmageddon" ist.
Man zerst&ouml;rt gegnerische Fahrzeuge mit Raketenwerfern, Handgranaten etc.
Titan k&uuml;ndigt Total Combustion mit dem Satz "nie wieder im Stau stecken,
dank dem flexibel einsetzbaren Raketenwerfer" an. Systemvoraussetzungen
sind 68040 oder PPC-Prozessor, 8 MB RAM, CD-ROM-Laufwerk, Grafikkarte
oder AGA. Angeblich soll Total Combustion schon Ende Februar erscheinen.
Claws of the Devil soll eine Mischung aus Tomb Raider und Quake werden.
Man steuert dabei Teri Fletcher durch eine 3D-Engine mit Wasser-, Licht-
und Feuereffekten. Der Spieler kann auch nach oben und unten sehen.
Auch Claws of the Devil ben&ouml;tigt einen 68040- oder PPC-Prozessor, AGA,
ein CD-ROM-Laufwerk, eine Festplatte und 16 MB RAM. Grafikkarten werden
nat&uuml;rlich unterst&uuml;tzt.<BR>
Wenn die beiden Spiele auch nur halbwegs halten, was die Ank&uuml;ndigungen
versprechen, stehen uns hier zwei echte Hits bevor.
Bereits erschienen ist inzwischen das Jump N Run Sword, von dem bereits
in einer vergangenen Ausgabe von AMIGA AGPJ ein Preview zu lesen war.
Die n&auml;chste Ver&ouml;ffentlichung aus dem Hause Titan wird das Spiel Evils Doom
sein, das vor einiger Zeit bereits als Shareware erschien. Die neue
Version des Spiels ist eine Special Edition und erscheint nur auf CD.<P><BR>
<LI><B>BlitzBombers wird als Freeware ver&ouml;ffentlicht</B><P>
Der Bomberman-Clone BlitzBombers wird als Freeware erh&auml;ltlich sein. Die
Programmierer Red When Excited haben sich entschieden, das Spiel nicht
als kommerzielles Spiel oder Shareware zu ver&ouml;ffentlichen, sondern es
in das Aminet zu bringen und so jedem frei zug&auml;nglich zu machen. Das Spiel
ist so gut wie fertig und soll am 1. Februar hochgeladen werden. Zu den
Features geh&ouml;ren 8 verschiedene Level-Designs, 5 Spielm&ouml;glichkeiten, &uuml;ber
80 Level, bis zu 8 Spieler &uuml;ber Serial-Link usw. Das Spiel, das auf
Screenshots hervorragend aussieht, wird sehr wahrscheinlich zu den besten
Spielen geh&ouml;ren, die das Aminet je gesehen hat. Ein Test mit Wertung lest
Ihr nat&uuml;rlich demn&auml;chst in AMIGA AGPJ.<P><BR>
<LI><B>Haunted</B><P>
Das Mystery-Adventure Haunted von Alive MediaSoft soll sich kurz vor der
Fertigstellung befinden. Besonders an den Grafiken und dem Sound (Musik
und Sprachausgabe) wurden noch wichtige Ver&auml;nderungen vorgenommen.<P>
<LI><B>Alien F1</B><P>
Die Formel1-Simulation Alien F1, von der vor einiger Zeit ein erstes Demo
im Aminet auftauchte, wird als Grand Prix Simulator oder Virtua GP
erscheinen. Die aktuellen Screenshots lassen das grafisch beste Formel 1-
Spiel vermuten, das der AMIGA bisher gesehen hat. Ein Publisher steht
noch nicht fest.<P><BR>
<LI><B>fr&uuml;hes fUbAR-Demo ver&ouml;ffentlicht</B><P>
Ein sehr fr&uuml;hes Demo des Spiels fUbAR wurde von den Entwicklern Q-Group
ver&ouml;ffentlicht. fUbAR bedeutet "fucked up beyond all recognition" und
ist eine Mischung aus Civilization, North &amp; South und einigen anderen
Spielen. Das Demo enth&auml;lt ca 20 % des endg&uuml;ltigen Spiels. An allen
Aspekten (Grafik etc.) wird noch gearbeitet. Das Demo steht hier zum
Download bereit: http://homepages.nildram.co.uk/~oondy/fpreview.lha<P><BR>
<LI><B>Aurora Works nimmt Vorbestellungen f&uuml;r H-Bomb entgegen</B><P>
Die Fertigstellung von H-Bomb, dem Bomberman-Clone von Aurora Works steht
unmittelbar bevor. Jeder, der das Spiel jetzt bestellt, bekommt die
Special-Edition des Spiels. H-Bomb wird auf CD erscheinen und auch Spielen
&uuml;ber das Internet erm&ouml;glichen.<P<BR>
<LI><B>Quiet Please Tennis</B><P>
Ein neues Tennis-Spiel wird es von den Spooky Fellows geben. Die Spooky
Fellows waren fr&uuml;her Teil der Szene-Gruppe RAM JAM. Das Spiel wird auf
der ATP-Tour basieren und sogar Diskussionen mit dem Schiedsrichter
erm&ouml;glichen. 4 verschiedene Modi stehen zur Verf&uuml;gung: Exhibition
(normales Match f&uuml;r 2-4 Spieler), Tournament (einzelnes Turnier), Career
(ATP-Tour mit Weltrangliste etc.) und Crazy Tournament (Turnier mit den
besten 7 Spielern der Welt und einigen Spezialschl&auml;gen). Die Spieler werden
in 200 Frames animiert. Animierte Schiedsrichter, Linienrichter und
Balljungen gibt es ebenso wie verschiedene Bodenbel&auml;ge mit den jeweiligen
Charakteristika (Gras schnell, Asche langsam etc.). Quiet Please Tennis
soll in diesem Jahr f&uuml;r AGA-Amigas erscheinen, falls sich ein Publisher
findet.<P><BR>
<LI><B>Darkage Software</B><P>
Alive ist ein neues Shoot Em Up im Stile von R-Type und Project X der
italienischen Programmierer Darkage Software. Es soll zeitgleich 120
Objekte bei 50 Frames pro Sekunde darstellen k&ouml;nnen und bietet einen 2-
Spieler-Parallel-Modus. Systemvoraussetzung ist lediglich ein purer AMIGA
1200. Erscheinungstermin ist M&auml;rz 1998, allerdings wird noch ein Publisher
f&uuml;r das Spiel gesucht. Die n&auml;chsten Titel von Darkage Software stehen
bereits fest: ein Sega-Rallye-Clone und das Spiel Oyup Oyup.<P><BR>
<LI><B>Caveman Species</B><P>
Ein neues Echtzeit-Strategiespiel kommt von Black Flag, einem neuen
Programmierer-Team. Vier Gruppen k&auml;mpfen auf einem Planeten, um die
Herrschaft &uuml;ber die Kontinente zu erlangen. Der Spieler entdeckt 90
Territorien in drei Regionen, baut St&auml;dte und f&uuml;hrt Kriege. Dabei
durchl&auml;uft er einige Evolutionsstufen seines Volkes. Wahrscheinlich wird es
auch einen 2-Spieler-Modus geben, der mittels Kabel oder Modem
funktionieren soll. Besonders auff&auml;llig an Caveman Species ist die Grafik.
256 Farben-Hi-Res-Grafik, gerenderte 3D-Animationen und sehr detaillierte
Charakter-Animationen sollen das Spiel sehenswert machen.
Systemvoraussetzungen sind ein 020-Prozessor, 2 MB Chip-RAM, 4 MB Fast-RAM,
AGA oder CyberGFX und ein 2xCD-ROM-Laufwerk.
Caveman Species soll noch im Fr&uuml;hjahr 1998 erscheinen, obwohl das Spiel
im Moment erst zu 5 % fertiggestellt ist.<P><BR>
<LI><B>Aphasia</B><P>
Aphasia wird ein neues Weltraum-Shoot Em Up aus Italien. Es bietet 6
Levels mit 2 Bonus-Levels, gro&szlig;en Level-Endgegnern, Wasser- und
Lichteffekte. Aphasia soll Ende 1998 erscheinen.<P><BR>
<LI><B>Bubble Heroes</B><P>
Ebenfalls aus Italien kommt das Entwickler-Team Arcadia Developments, das
im Moment das Spiel Bubble Heroes programmiert. Es handelt sich dabei um
einen Puzzle Fighter-Clone. Das Spiel kommt mit 512 Farben und wird einige
gute Grafikeffekte bieten. Das Spielprinzip ist eine Mischung aus Bust-a-
Move, das entfernt an Tetris erinnert und einem Beat Em Up a la Street
Fighter. Das Spiel wird ca. 60 Level und TCP/IP-Support bieten und
wahrscheinlich nur auf CD erscheinen. Man darf also gespannt sein.<P><BR>
<LI><B>Powerball</B><P>
Powerball kommt ebenfalls aus Italien, und zwar von Skywards Software,
die durch Mikro Mortal Tennis bekannt wurden, das hierzulande allerdings
nicht erschienen ist. Bei Powerball mu&szlig; man mit Hilfe eines Balles Objekte
durch Ber&uuml;hrung vom Bildschirm entfernen. Viele kleine Hilfen und
Schwierigkeiten verfeinern dieses Spielprinzip. Erste Screenshots lassen
aber vermuten, da&szlig; das Spiel nicht &uuml;ber Shareware-Niveau hinauskommen wird.<P><BR>
<LI><B>Great Nations</B><P>
Great Nations wird ein Spiel im Stile von FreeCiv, der Civilization-
Version, die auch &uuml;ber das Netz spielbar ist. Great Nations bietet einige
zus&auml;tzliche Features, wie unendlich gro&szlig;e Karten. Grafikkarten werden
unterst&uuml;tzt. Bis zu 7 Spieler sollen Great Nations &uuml;ber das Internet
oder &uuml;ber den seriellen Port spielen k&ouml;nnen. Systemvoraussetzungen
sollen AGA oder Grafikkarte, OS 3.0, 68020 und 6 MB RAM sein. Ein fr&uuml;hes
Demo kann auf der Homepage (<A HREF="http://gn.gameshock.com/">http://gn.gameshock.com/</A>) heruntergeladen
werden.<P><BR>
<LI><B>Lambda</B><P>
Lambda ist ein geplantes 3D-Weltraum-Ballerspiel mit &Auml;hnlichkeiten zu
X-Wing und Wing Commander. Das Spiel wird AGA, CyberGFX und Picasso96
unterst&uuml;tzen. Der Entwickler des Spiels sucht noch 3D-Grafiker.
Interessierte sehen hier nach: <A HREF="http://www.hut.fi/~mkalline/lambda.html">http://www.hut.fi/~mkalline/lambda.html</A>
</UL>
<CENTER><BR><A HREF="0203.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0205.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 02/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

