<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 02/98 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>SPECIAL: SCREENFUN berichtet &uuml;ber AMIGA</H2>
Nun ist es also passiert. Und dies in der Weise, die die meisten wohl
bef&uuml;rchtet haben. Die Zeitschift BRAVO SCREENFUN berichtet in ihrer
Reihe "Spiel &amp; Spar" &uuml;ber den "Commodore Amiga". Geschrieben wurde der
Artikel von Winnie Forster, fr&uuml;her einmal POWER PLAY-Redaktions-Mitglied.
Dies merkt man dem Artikel leider auch an. In der Liste der 10 besten
Amiga-Spiele ("Die mu&szlig;t Du haben!") befinden sich 9 Spiele, die in den
Jahren 1989-1991 herausgekommen sind (Lemmings, Dungeon Master, Populous,
Battle Isle, Blood Money, Xenon 2, Bundesliga Manager Pro, The Killing
Game Show und Turrican 2), sowie ein Spiel, das als eher pr&auml;historisch
bezeichnet werden kann. Nichts gegen Marble Madness, aber das f&uuml;nftbeste
AMIGA-Spiel ist es nun wirklich nicht. Und Bundesliga Manager Pro ???
Ist nicht 1994 der weitaus bessere Nachfolger Bundesliga Manager Hattrick
erschienen?<P>
Was ist denn zum Beispiel mit Spielen wie Speedball 2, Monkey Island,
Lotus 2, Grand Prix (alle 1991); Monkey Island 2, Fire and Ice, Sensible
Soccer, History Line, B.C.Kid (alle 1992); Frontier, Die Siedler,
Lemmings 2, Ambermoon, Turrican 3, Lionheart, Anstoss, Civilization (alle
1993); Bundesliga Manager Hattrick, Sensible World of Soccer, Simon the
Sorcerer (alle 1994); Pinball Illusions, Super Stardust, Alien Breed 3D,
Worms, Colonization (alle 1995); Worms D.C., Capital Punishment, Slam Tilt,
Alien Breed 3D 2 (alle 1996) oder Chaos Engine 2 (1997). Von noch neueren
Titeln wie Myst, Final Odyssey oder onEscapee ganz zu schweigen. Sicher,
auch &uuml;ber diese Titel l&auml;&szlig;t sich streiten. Da&szlig; aber die 10 besten AMIGA-
Titel vor 1991 erschienen sind, das halte ich f&uuml;r ein Ger&uuml;cht.
Die Liste, aber auch der Artikel selbst sehen so aus, als ob der fr&uuml;here
POWER PLAY-Redakteur mal eben beauftragt wurde, etwas &uuml;ber den AMIGA zu
schreiben, weil er ja damals auch &uuml;ber den AMIGA berichtet hat. Tja,
und das kommt nun dabei heraus.<P>
Folgerichtig werden auch in dem Artikel einige Fehler gemacht, auf die
ich aber nicht n&auml;her eingehen m&ouml;chte. Der AMIGA wird weiterhin als
Computer der Software-Diebe bezeichnet, die ein Grund f&uuml;r den Niedergang
gewesen seien (auch hier&uuml;ber l&auml;&szlig;t sich streiten). 1991 seien aber immerhin
noch Wing Commander und die beiden Monkey Islands umgesetzt worden (wenn
auch mit Versp&auml;tung). Auch hier ist eine Klarstellung von N&ouml;ten.
Es stimmt, da&szlig; Wing Commander vom PC auf den AMIGA umgesetzt wurde. Aber
gerade Monkey Island 1 erschien im Januar 1991 zeitgleich mit der PC-
Version. Sieht nicht nach einer Umsetzung des Spiels mit Versp&auml;tung aus,
oder?<P>
Da verwundert es dann auch nicht, da&szlig; davon gesprochen wird, da&szlig; &auml;ltere
AMIGAs eine Kickstart-Diskette ben&ouml;tigen (wer benutzt noch einen solchen
AMIGA?) und da&szlig; die Workbench eine Art Windows sei. Als Malprogramm wird
schlie&szlig;lich Deluxe Paint IV empfohlen (Hallo? Schon mal etwas davon
geh&ouml;rt, da&szlig; es auch eine Version 5 gibt?) und das CDTV wird zeitlich
hinter die AMIGAs 1200, 4000 und das CD32 gesetzt, und sei "der letzte
Sargnagel f&uuml;r einen 1994 schon stark angeschlagenen Computer" gewesen.
Aber, so Forster, es habe ja noch bis 1996 englische Spieleentwickler
gegeben, "die an den 16-Bitter glaubten". Dann sind wohl s&auml;mtliche
Neuerscheinungen aus dem Jahr 1997 und alle f&uuml;r das Jahr 1998 angek&uuml;ndigten
Spiele nur Einbildung oder eine Fata-Morgana...<P>
Angesichts dieses Artikels w&auml;re es wohl besser, die SCREENFUN w&uuml;rde ihre
Berichterstattung bzgl. des AMIGAs einstellen. Solche Artikel braucht
die AMIGA-Welt zumindest NICHT !!!
<CENTER><BR><A HREF="0204.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0206.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 02/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

