<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 02/98 - Amiga-News</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amine.gif" ALT="Amiga-Aktuell 02/98 Amiga-News" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>AMIGA, Inc. entscheidet sich f&uuml;r AMIGA-Hauptprozessor</H2>
Die AMIGA-Entwicklungsabteilung AMIGA, Inc., USA, hat sich mittlerweile f&uuml;r
den zuk&uuml;nftigen Hauptprozessor unserer "Freundin" entschieden. Mit dem
Chip-Hersteller Motorola seien "grundlegende Gespr&auml;che zum Abschlu&szlig;
gebracht" worden, meldet die AMIGA Plus unter Berufung auf Petro
Tyschtschenko, dem Pr&auml;sidenten von AMIGA International. Bis zur endg&uuml;ltigen
Vertragsunterzeichnung sollte die Wahl eigentlich geheim bleiben.<P>
Allerdings hat Joe Torre von AMIGA, Inc. etwa zum selben Zeitpunkt folgende
Information herausgegeben, die &uuml;ber Petro Tyschtschenko zu Martina Jacobs
gelangt ist (vielen Dank an sie f&uuml;r die &Uuml;bersetzung aus dem Englischen):<P><BR>
&#187;18.01.1998 von Joe Torre
Eines Mannes Antworten auf Fragen zur Wahl des Prozessors f&uuml;r zuk&uuml;nftige
Amigas.<P><BR>
<B>Frage:</B> Welche CPU wird in der Zukunft eher im Amiga sein, 68K oder PPC?<P>
<B>Antw.:</B> Beide. Der 68K f&uuml;r die Kompatibilit&auml;t mit bestehender Software, der
PPC f&uuml;r die Geschwindigkeit.  Durch die flexible Architektur des Amiga ist
es m&ouml;glich, den/die PPC-Chip(s) f&uuml;r rechenintensive Tasks, wie Rendering,
Packen und Entpacken, Ver- und Entschl&uuml;sseln usw., hinzuzugewinnen. Der
68K bietet 100%ige Kompatibilit&auml;t f&uuml;r die Software, w&auml;hrend der PPC die
Pferdest&auml;rken liefert. Da immer mehr von uns auf 68K + PPC upgraden, wird
es immer mehr Amiga-Software geben, die die F&auml;higkeiten des PPC ausnutzen.<P><BR>
<B>Frage:</B> Wird die Workbench 3.5 eine PPC-Karte zum Starten ben&ouml;tigen?<P>
<B>Antw.:</B> Ganz sicher nicht. Das OS-Upgrade ist sowohl f&uuml;r bestehende Rechner
als auch f&uuml;r zuk&uuml;nftige. Wir m&ouml;chten die Wertigkeit und Attraktivit&auml;t der
WB3.5 zum Maximum bringen, damit alle User bei der Ver&ouml;ffentlichung darauf
upgraden.<P><BR>
<B>Frage:</B> Eine  Version der WB3.5 in PPC native Code w&auml;re schneller als die
68K-Version. Warum wird sie nur f&uuml;r 68K geschrieben?<P>
<B>Antw.:</B> Um die bestehende Amiga-Gemeinde zu unterst&uuml;tzen. Ganz gleich, auf
welche CPU das AmigaDos portiert w&uuml;rde, es w&auml;re schneller, wenn die CPU
schneller w&auml;re. Ein wichtiger Gesichtspunkt ist die Zeit, die es dauert,
ein Produkt auf den Markt zu bringen. Eine Turbokarte einzubauen dauert
weniger als 20 Min., aber das OS auf PPC zu portieren w&uuml;rde ein Jahr und
l&auml;nger dauern. Das WB3.5-Upgrade ist f&uuml;r die Hunderttausende von 680x0-
Rechner gedacht, die heute in Gebrauch sind, mit oder ohne PPC-Coprozessor.
Von einem fr&uuml;hzeitigen Upgrade f&uuml;r 68K profitieren mehr Amiga-User als von
einem sp&auml;ten Upgrade f&uuml;r PPC, f&uuml;r Hardware die sie nicht besitzen.<P><BR>
<B>Frage:</B> Wird es eine Version des AmigaDos nur f&uuml;r PPC geben?<P>
<B>Antw.:</B> Firmen mit Lizenz f&uuml;r AmigaDos steht es frei, dieses auf Alpha, PPC,
MIPS, usw. zu portieren. Diese CPUs k&ouml;nnten ideal f&uuml;r eingebettete
(non-Amiga-) Applikationen sein, die das AmigaDos &uuml;bertrifft. Wodurch
solche Schnittstellen ohne Zweifel schnell w&auml;ren, besonders im Vergleich zu
den aufgeblasenen Betriebssystemen, die gew&ouml;hnlich auf solchen Rechnern
laufen.<BR>
Obwohl man keine Amiga-Kompatibilit&auml;t erwarten kann, ohne eine Art von
Chipset und 68K-Emulation zu liefern.<P><BR>
<B>Frage:</B> Wie sieht es aus mit der Motorola-ColdFire-Familie als CPU?<P>
Antw: Der ColdFire ist zu weniger als 30 % Code-kompatibel zum 68K, billig
und sehr leistungsf&auml;hig. Der ColdFire besitzt einen reduzierten
Befehlssatz, der ihn sehr schnell macht. Aber ihm fehlen viele der
Bitfield-Operationen, die bei der Arbeit mit AmigaDos kritisch sind. Um den
ColdFire einzusetzen, w&uuml;rde ein komplett neu geschriebenes AmigaDos
gebraucht, und dies w&auml;re nicht mehr kompatibel mit der vorhandenen
kommerziellen Software und dem kompletten tollen Aminet-Archiv.<P><BR>
<B>Frage:</B> Wird Amiga, Inc. neue Amigas bauen?<P>
<B>Antw.:</B> Nein. Amiga, Inc. wird keine neuen Rechner bauen. Neue Rechner
werden von Firmen kommen, die daf&uuml;r eine Lizenz von Amiga International
haben. Petro ist mit der Lizensierung der Amiga-Technologie sehr
erfolgreich. Checke die Amiga-International-Web-Seiten unter
<A HREF="http://www.amiga.de">http://www.amiga.de</A> f&uuml;r die lange Liste der lizensierten Firmen. Schaue
nach den Firmen f&uuml;r neue Amiga-Modelle. Diese Firmen brachten
Verbesserungen f&uuml;r den Amiga, wie RTG, AHI, PPC, WideSCSI und sogar PCI!
Diese Firmen brauchen Euren Feedback dar&uuml;ber, welche Features Ihr f&uuml;r neue
Amiga-Modelle bevorzugt. Sie werden nur die Art von Amigas bauen, die Ihr
kaufen m&ouml;chtet.&#171;<P><BR>
<B>Fazit:</B><BR>
Damit wissen wir also, da&szlig; der in den letzten Wochen vermehrt als m&ouml;glicher
Kandidat genannte ColdFire als neuer Hauptprozessor ausscheidet. Gro&szlig;e
Bedeutung wird sowohl der 68K-Reihe als auch dem PowerPC  zukommen, auch
wenn immer noch nicht bestimmt ist, wann der PowerPC- den 68K-Prozessor
endg&uuml;ltig abl&ouml;sen soll. Da&szlig; dies irgendwann der Fall sein mu&szlig;, ist klar -
sp&auml;testens wenn Motorola die Produktion der 68K-CPUs einstellt.<P>
Unklar ist auch, ob die 68K&amp;PPC-L&ouml;sung von AMIGA, Inc. Software-kompatibel
zu den PowerUp-Karten von phase 5 sein wird. Dies ist zwar sehr
wahrscheinlich, und alles andere w&auml;re aus Sicht der Anwender
unverst&auml;ndlich, aber etwas mehr Klarheit in diesem Punkt w&auml;re w&uuml;nschenswert
gewesen.<P>
Joe Torre hat &uuml;brigens nichts dar&uuml;ber gesagt, ob Motorola die
Weiterentwicklung der 68K-Reihe wieder aufnehmen will, wie manch einer
glaubt.<BR>
Petro Tyschtschenko selbst hatte auf der Computer '97 von einer solchen
M&ouml;glichkeit gesprochen, einem Newsgroup-Posting zufolge habe der Pr&auml;sident
von AMIGA International seine Worte jedoch inzwischen in der Weise
korrigiert, da&szlig; auch er nicht an eine Weiterentwicklung der 68K-Reihe bei
Motorola glaube.<P>
Zugegeben, ich pers&ouml;nlich kann nicht so recht glauben, da&szlig; Gateway 2000
Motorola von einem solchen Schritt &uuml;berzeugen kann. Sollte das Unglaubliche
aber doch Realit&auml;t werden, so mu&szlig; dies zwangsl&auml;ufig als "Geniestreich"
bezeichnet werden (unabh&auml;ngig davon, ob diese Entscheidung letztendlich
eher positive oder negative Konsequenzen h&auml;tte). Dies w&auml;re n&auml;mlich ein
Beweis f&uuml;r den Einflu&szlig;, den Gateway besitzt, und der dem AMIGA noch sehr
hilfreich sein k&ouml;nnte.
<CENTER><BR><A HREF="0300.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0302.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 02/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews1.gif" ALT="[Amiga News]" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

