<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 02/98 - Diverse News</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amidn.gif" ALT="Amiga-Aktuell 02/98 - Diverse News" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>OperaSoftware erw&auml;gt Unterst&uuml;tzung des AMIGA</H2>
OperaSoftware will seinen neuen WWW-Brower "Opera" auf den AMIGA portieren
- sofern bei gen&uuml;gend AMIGA-Anwendern Interesse daf&uuml;r besteht.
Es folgt eine Information des f&uuml;r die AMIGA-Koordinierung zust&auml;ndigen
Mikael Svensson:<P><BR>
&#187;Opera - Project Magic, ein neuer Multi-Plattform-Browser mit
Amiga-Unterst&uuml;tzung<P>
Ein neuer Browser wird demn&auml;chst f&uuml;r die Amiga-Plattform erscheinen.
Er hei&szlig;t Opera und ist im Moment f&uuml;r PC erh&auml;ltlich. In K&uuml;rze werden
Versionen f&uuml;r Mac und OS/2 herauskommen. Versionen f&uuml;r Linux, Unix, BeOS
und AMIGA!!! werden in Betracht gezogen. Es liegt an Euch, ob die Amiga-
Version jemals erscheinen wird.<P>
Der Amiga ist nun schon seit langer Zeit im Internet pr&auml;sent, und wir haben
Applikationen, um die meisten Internet-Services zu nutzen. Z.B. E-Mail-
Programme, Newsgroups-Readers und IRC-Programme sind genauso gut wie die,
die f&uuml;r PC und Mac erh&auml;ltlich sind, um nicht zu sagen besser, und ohne
Zweifel haben wir die besten Telnet-Clients, die es gibt. Nur in zwei
Gebieten hatte der Amiga bis jetzt schlechten oder gar keinen Support, ICQ
und Web-Browser. Versteht mich nicht falsch, nat&uuml;rlich haben wir Browser
f&uuml;r den Amiga. IBrowse, AWeb und Voyager sind alles gut programmierte
Browser, und f&uuml;r manche Seiten sind sie wirklich gut. Das Problem ist
heute, da&szlig; sie Java und CGI-Skripts nicht oder nicht korrekt unterst&uuml;tzen.
Selbst wenn die Programmierer dieser Software wirklich gut sind, haben sie
einen gro&szlig;en Nachteil gegen&uuml;ber den PC- und Mac-Programmierern: Sie k&ouml;nnen
keine neue Technik implementieren, bevor sie auf PC und Mac nicht schon f&uuml;r
eine ganze Weile erh&auml;ltlich war. Deshalb sind Amiga-User auf diesem schnell
wachsenden Gebiet des Internet weit zur&uuml;ck.<P>
Ich glaube, es gibt wohl keinen einzigen Amiga-User im Netz, der nicht
schon einmal eine Seite angetroffen hat, von der es hie&szlig;, sie sei wirklich
gro&szlig;artig, und der dann festgestellt hat, da&szlig; sie auf seinem Amiga nicht
funktioniert. Obwohl unsere Browser sehr effizient programmiert sind,
unterst&uuml;tzen sie nur einen kleinen Teil von dem, was PC- und Mac-Browser
unterst&uuml;tzen.<P>
Der Grund daf&uuml;r ist, da&szlig; die Amiga-Programmierer keinen Zugang zu
fertigen Quelltexten haben, was Browser angeht. Sie m&uuml;ssen die PC-Browser
ansehen und versuchen, da&szlig; ihre eigenen Browser genau dasselbe tun. Das ist
nicht gerade einfach, und Sie werden es sowohl mit AWeb, IBrowse als auch
Voyager sicher schon einmal festgestellt haben. Aber dieses Problem k&ouml;nnte
bald Vergangenheit sein.<P>
Ein neuer Browser wurde vor kurzem f&uuml;r den PC fertiggestellt und wird
demn&auml;chst auch f&uuml;r Mac und OS/2 erscheinen. Die Autoren dieses Browsers
denken auch dar&uuml;ber nach, eine Version f&uuml;r Linux, Unix, BeOS zu machen, und
dank einer Mail, die ich ihnen vor einiger Zeit gesendet habe, auch f&uuml;r den
AMIGA.<P>
Die Programmierer dieses Browsers werden einen Vorteil haben, den kein
Amiga-Browser bisher gehabt hat. Sie werden vollen Zugang zum Quelltext
der PC-Version haben und diesen f&uuml;r den Amiga nur umschreiben m&uuml;ssen.
Wenn etwas Neues im WWW pr&auml;sentiert wird, werden sie Unterst&uuml;tzung von
einer Menge Programmierer auf anderen Plattformen haben. Das bedeutet, da&szlig;
Amiga-User nicht mehr ewig warten m&uuml;ssen, bis die neuesten Entwicklungen im
Netz auch f&uuml;r den Amiga erh&auml;ltlich sind.<P>
Also: Was ist OPERA? Die urspr&uuml;ngliche Idee war, einen Browser zu machen,
der auch noch funktionieren sollte, wenn man zuf&auml;llig nicht den neuesten
und schnellsten Prozessor und Tonnen von Speicherplatz hat. Opera
unterst&uuml;tzt JAVA und Frames und ist wesentlich schneller als Netscape und
Explorer auf dem PC. Es gibt noch eine Menge mehr dar&uuml;ber zu lesen auf
ihrer Homepage:<P>
<A HREF="http://www.operasoftware.com">http://www.operasoftware.com</A><P>
Was k&ouml;nnt Ihr tun, damit eine Version f&uuml;r den AMIGA erscheint? Besucht
einfach Operas Homepage und teilt den Leuten mit, da&szlig; ihr ein Exemplar
dieses Browser f&uuml;r den Amiga haben wollt. Es gibt zu diesem Zweck eine
spezielle E-Mail-Adresse, an die Ihr Eure Bestellung schicken k&ouml;nnt.
Sie lautet: amiga@operasoftware.com . Bitte verge&szlig;t nicht anzugeben, wie
viele Exemplare Ihr ordern wollt.<P>
Wenn sich 3000 Amiga-User finden, wird es ohne Zweifel eine Amiga-Version
geben. F&uuml;r den Mac waren sogar schon 2000 Bestellungen genug, um die
Programmierer davon zu &uuml;berzeugen, eine Mac-Version herauszugeben. Sie
wollen jedoch gerne 3000 Bestellungen, da mit dieser Anzahl verkaufter
Exemplare genug Geld zusammenkommen w&uuml;rde, um die Amiga-Programmierer zu
bezahlen.<P>
Und es sieht nicht schlecht aus: Innerhalb weniger Tage haben sich bereits
1500 AMIGA-Anwender gemeldet, die sich f&uuml;r eine AMIGA-Version von Opera
interessieren.<P>
Gute Amiga-Programmierer mit Erfahrung in C++ oder Assembler, die f&uuml;r ein
kleineres Entgelt bereit w&auml;ren, die Portierung zu &uuml;bernehmen, sollten nicht
z&ouml;gern, sich mit OperaSoftware in Verbindung zu setzen.<P>
Ein letztes Wort an alle Amiga-User da drau&szlig;en. DAS ist Eure Chance zum
Durchbruch, Eure Chance, Qualit&auml;tssoftware und Unterst&uuml;tzung von gro&szlig;en
Softwarefirmen zu bekommen. Wenn Ihr wollt, da&szlig; der Amiga &uuml;berlebt, besucht
unbedingt OperaSoftwares Homepage und schickt ihnen eine Mail. Wenn nicht,
k&ouml;nnt Ihr Euren Amiga genausogut gleich wegschmei&szlig;en und einen PC kaufen.<P>
Mikael Svensson (<A HREF="hotaxid@hem.passagen.se">hotaxid@hem.passagen.se</A>)
Besucht OperaSoftwares Seite jetzt!<P>
<A HREF="http://www.operasoftware.com">http://www.operasoftware.com</A>&#171;<P>
Die &Uuml;bersetzung wurde von Heiko Kuschel durchgef&uuml;hrt und mit freundlicher
Genehmigung von Mikael Svensson durch weitere Informationen erg&auml;nzt.<P>

<CENTER><BR><A HREF="0702.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0704.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 02/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div1.gif" ALT="[diverse News]" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

