<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - Spiderman's Link-Sammlung</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN=CENTER><U>Spiderman's Link-Sammlung</U></H1>
<DIV ALIGN="CENTER">Alle Links aus der Rubrik &quot;Spiderman's Web-Abenteuer&quot; exklusive der aktuellen Ausgabe.</DIV>

<P>Falls einzelne Links sich ge&auml;ndert haben oder nicht mehr zum Ziel f&uuml;hren
oder Sie gute Adressen kennen, schreiben Sie uns bitte!</P>
<P>F&uuml;r genauere Beschreibungen der Sites (deutsch, englisch, Frames ?),
Bewertung etc., schlagen sie bitte in der jeweiligen Ausgabe nach - daf&uuml;r
einfach auf den Ausgabe-Schriftzug dr&uuml;cken.</P>

<H2><A HREF="../amz0697/main.htm">Ausgabe #1</A></H2>

<UL>
<LI><A HREF="http://www.cucug.org/amiga.html">Amiga Web Directory</A> - Die Quelle f&uuml;r Amiga-Links und News</LI>
<LI><A HREF="http://www.phase5.de">Phase 5</A> - Eine der bekanntesten Amiga-Zubeh&ouml;rherstellerfirmen.</LI>
<LI><A HREF="http://www.pios.de">PIOS</A> - Diese Firma wurde von ehemaligen Amiga-Mitarbeitern gegr&uuml;ndet.</LI>
<LI><A HREF="http://www.proDAD.de">proDAD</A> - Bekannte Amiga-Softwarefirma, die u.a. mit pOS ein Betriebssystem herausbringen will.</LI>
<LI><A HREF="http://www.haage-partner.com">Haage &amp; Partner</A> - Wichtiger Amiga-Softwarehersteller und Distributor.</LI>
</UL>

<H2><A HREF="../amz1297/main.htm">Ausgabe #2</A></H2>

<UL>
<LI><A HREF="http://www.amigaworld.com/kompass/">Kompass</A> - Gut designte private Homepage, die auch Webpreise vergibt.</LI>
<LI><A HREF="http://www.kostenlos.de">Kostenlos.de</A> - DIE Quelle f&uuml;r Info's, wo es etwas abzustauben gibt.</LI>
<LI><A HREF="http://www.teleauskunft.de">Teleauskunft</A> - Site der Telekom, zum Nachschlagen und Suchen im Telefonbuch.</LI>
<LI><A HREF="http://www.buchhandel.de">Buchhandel</A> - Hier kann man im VLB (Verzeichnis lieferbarer B&uuml;cher) nachschlagen, in dem ca. 14.000 Verlage enthalten sind.</LI>
</UL>

<H2><A HREF="../amz0398/main.htm">Ausgabe #3</A></H2>

<UL>
<LI><A HREF="http://www.ubl.com">Ultimate Band List</A> - Wer Sites, Tourdaten und mehr seiner Lieblinsgruppe sucht, der ist hier richtig.</LI>
<LI><A HREF="http://allmusic.com/index.html">All Music Guide</A> - Fundierte Info's zu Gruppen, Interpreten, Platten, Musikrichtungen!</LI>
<LI><A HREF="http://www.lyrics.ch">Lyrics</A> - Hier kann man nach Songtexten suchen. &Uuml;ber 60.000 sind schon gespeichert.</LI>
<LI><A HREF="http://homepages.enterprise.net/beej/">Game Music Page</A> - Viele Computerspiel-Musiken, vorrangig des Amiga.</LI>
<LI><A HREF="http://stud1.tuwien.ac.at/index.html">SID-Music</A> - Unz&auml;hlige SID-Files, die die Musik des alten C64 auf aktuelleren Computern wieder zum Leben erwecken.</LI>
</UL>

<H2><A HREF="../amz0698/main.htm">Ausgabe #4</A></H2>

<UL>
<LI><A HREF="http://www.traxxx.de">Tranxxx</A> - Reisenews, Reisef&uuml;hrer, Reisewetter. Alles zum Thema Reise!</LI>
<LI><A HREF="http://www.geo.de">GEO</A> - Pr&auml;sentation der Zeitschrift GEO mit Artikeln zu Wissenschaft und Natur.</LI>
<LI><A HREF="http://www.nananet.de/VZN/">Verbraucher-Zentrale</A> - von Nordrhein-Westfalen. Rechtliche Tips und Hinweise.</LI>
</UL>

<H2><A HREF="../amz0998/main.htm">Ausgabe #5</A></H2>

<UL>
<LI><A HREF="http://www.applausenett.no/~gdwarf/emu/index.html">Amiga Emulators</A> - Download, News und Info's zu Emulatoren mit denen der Amiga andere Computer nachbilden kann.</LI>
<LI><A HREF="http://www.classicgaming.com/aec/">Amiga Emulators Central</A> - &Auml;hnlich dem obigen Link. Hier gibt es auch Wertungen. Wer das Unterverzeichnis im Link wegl&auml;&szlig;t, bekommt auch Emulator-Infos f&uuml;r andere Systeme.</LI>
<LI><A HREF="http://www.wize.dk/solknight/">The Videogames Music Preservation Archive</A> - Zahlreiche Videospiel-Musiken. Ebenfalls sehr Amiga-lastig.</LI>
<LI><A HREF="http://www.geocities.com/Area51/Shadowlands/5440/germfilk.html">Filk</A> - Sie kennen keine SF&Fantasy-Folk-Musik? Diese Site kl&auml;rt Unwissende auf.</LI>
</UL>

<H2><A HREF="../amz1298/main.htm">Ausgabe #6</A></H2>

<UL>
<LI><A HREF="http://members.aol.com/frcom/">fantasticReaderNews</A> - Phantastische Nachrichten aus den Bereichen SF und Fantasy.</LI>
<LI><A HREF="http://members.tripod.com/~fawbuch/index-buch.htm">fawBuch</A> - Rezensionen, Artikel und Verlagsvorschauen f&uuml;r SF-Interessierte.</LI>
<LI><A HREF="http://yi.com/home/faw/">fawInfodienst</A> - Eine weitere Site mit News &uuml;ber SF und Fantasy.</LI>
<LI><A HREF="http://www.muenster.de/~tobiast/b5frame.htm">Dt. Babylon5-Episodenguide</A> - News, ein FAQ, Zusammenfassung der Handlung und Links zur SF-TV-Serie Babylon 5.</LI>
<LI><A HREF="http://www.midwinter.com/lurk/lurker.html">Lurker's Guide</A> - DIE Quelle f&uuml;r Babylon 5-Informationen (Englisch).</LI>
<LI><A HREF="http://surf.to/sfcd/">SFCD</A> - Die Site des Science Fiction Club Deutschland, dem gr&ouml;&szlig;ten allgemeinen SF-Club hierzulande.</LI>
<LI><A HREF="http://www.thule.no/haynie/">Amiga-Projekte</A> - Hier sind einige Dokumente des Ex-CBM-Entwicklers Haynie zu legend&auml;ren Projekten zu finden.</LI>
<LI><A HREF="http://www.tu-bs.de/asta/akuefi.html">Ak&uuml;fi</A> - Eine sehr interessante Liste mit Abk&uuml;rzungen, die im Computerbereich &uuml;blich sind.</LI>
<LI><A HREF="http://search.de/">Search.de</A> - Guter Startpunkt zu Suchmaschinen und Datenbanken in deutschen Landen.</LI>
</UL>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="links.htm">Links</A></FONT></TD>
</TR>
<TR>
    <TD ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

