<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Neuester Stand der AMIGA-Hauptaktivit&auml;ten

»Mai 1999

Aktivit&auml;ten/Pl&auml;ne:
1. Wir planen, aus dem Gateway Geb&auml;ude in San Diego auszuziehen und ein
separates Geb&auml;ude f&uuml;r Amiga zu finden, um dort alle neuen Mitarbeiter
unterzubringen.

Neue Mitarbeiter:
1. Wir haben Dr. Rick LeFaivre als CTO (Chief Technology Officer) und
Senior Vice President of Advanced Technology eingestellt. Dr. LeFaivre hat
als Senior Technology Executive f&uuml;r Apple, Silicon Graphics, Sun und
Inprise gearbeitet. Mehr Informationen stehen auf unserer Website unter
News.
2. Wir haben Tom Schmidt als als COO (Chief Operating Officer) eingestellt.
Tom Schmidt ist ein erfahrener Senior Gesch&auml;ftsf&uuml;hrer von Allied Signal,
ein 30$ Milliarden schweres Unternehmen. Mehr Informationen stehen auf
unserer Website unter News.
3. Vor einigen Wochen haben wir Stellengesuche in bekannten Zeitungen
ver&ouml;ffentlicht mit dem Erfolg, da&szlig; uns eine betr&auml;chtliche Anzahl von
hochqualifizierten Zuschriften zuging, die wir noch pr&uuml;fen.
4. Wir haben eine Vollzeitkraft eingestellt, die unsere gr&ouml;&szlig;er werdenden
Einstellungsbem&uuml;hungen koordiniert.

Hauptentwicklungsprogramme:
1. OS 3.5
Dieses Projekt ist von Haage & Partner, die unter Vertrag mit Amiga stehen,
entwickelt worden. Das angestrebte Verkaufsdatum ist Ende Juli/August 99.
Es laufen Gespr&auml;che mit Amiga Hardware Entwicklerfirmen, um zur
Ver&ouml;ffentlichung des OS 3.5 qualifizierte Hardwareprodukte zu haben. F&uuml;r
die Ver&ouml;ffentlichung des OS 3.5 planen wir, eine empfohlene
Hardwarekonfiguration und einer Liste qualifizierter Amiga Hardware
Produkte herauszugeben.
2. AmigaSoftTM Operating Enviroment (OE)
Wir entwickeln unser OE f&uuml;r die n&auml;chste Generation inklusive Operating
System, User Interface und einigen revolution&auml;ren Softwarestrukturen, die
zu einem sp&auml;teren Zeitpunkt ver&ouml;ffentlicht werden. Die Beta Version wird
zwischen dem 3. Quartal 1999 und Ende 4. Quartal 1999 ver&ouml;ffentlicht. Wir
pr&uuml;fen au&szlig;erdem die M&ouml;glichkeit, das neue AmigaSoftTM (OE) f&uuml;r die
empfohlenen Hardwarekonfigurationen des OS 3.5 portieren zu k&ouml;nnen. Falls
uns dies gelingt, wird es somit m&ouml;glich sein, das neue OE auf spezifischen
Amiga Konfigurationen mit Power PC Karten laufen zu lassen.
3. Die Next Generation Hardware-Architektur
Diese Generation wird als Basis f&uuml;r alle Produkte der n&auml;chsten Amiga
Generation entwickelt werden. Wir werden schon in wenigen Wochen die
Auswahl der geeigneten Komponenten festgelegt haben.
4. AmigaSoftTM Entwicklungssystem
Dies ist f&uuml;r das 3. Quartal 1999 geplant, zusammen mit der Beta
Ver&ouml;ffentlichung des neuen AmigaSoftTM Operating Enviroment.
5. Erster Computer der n&auml;chsten Generation
Wir entwickeln den Computer der n&auml;chsten Generation, der genutzt werden
wird um die Next Generation Systemarchitektur und das OE vorzustellen.
Geplante Vorstellung ist Ende des 4. Quartals 99. Weitere Informationen
dazu stehen im "Offenen Brief an die Amiga Gemeinde".
6. Wir haben Konzept-Designs der n&auml;chsten Amiga Produktgeneration zur
Ver&ouml;ffentlichung an die Amiga Presse weitergegeben.

Veranstaltungen und Gemeindeaktivit&auml;ten:
1. Ich habe Deutschland und England besucht und mich mit Repr&auml;sentanten der
Amiga Gemeinde getroffen. Wir haben Treffen mit Pers&ouml;nlichkeiten aus der
Amiga Gemeinde abgehalten und &uuml;ber Amiga's Zukunftspl&auml;ne gesprochen
2. Wir werden die World of Amiga in London Ende Juli sponsorn und auch
daran teilnehmen.
3. Wir haben ebenfalls vor, die AmiWest Veranstaltung Ende Juli zu
unterst&uuml;tzen.
4. Wir treffen schon jetzt Vorbereitungen f&uuml;r die Veranstaltung im November
in K&ouml;ln und in Las Vegas
5. Um der Amiga Gemeinde zu helfen, entwickeln Petro und Jim Von Holle
Supportprogramme f&uuml;r die Distributoren, die Einzelh&auml;ndler und die Magazine.
Weiterhin arbeiten wir an einigen Punkten zur Verbesserung der
Kommunikation und f&uuml;r den Support von Usergroups.«

(Quelle: AMIGA)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
