<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Neues von AMIGA
---------------

1. Offener Brief von AMIGA-Pr&auml;sident Jim Collas an die Amiga-Gemeinde

»Mai 1999

Liebe Amiganer,

der April war ein sehr tatenreicher Monat f&uuml;r Amiga, mit vielen Aktivit&auml;ten
und guten Fortschritten.
Ich habe &uuml;ber 1200 Emails von Leuten auf der ganzen Welt bekommen, ich habe
mich mit Repr&auml;sentanten der Amiga Gemeinde in Deutschland und in England
getroffen, wir haben unseren Personalbestand bei den leitenden Angestellten
ausgebaut, wir haben Gesch&auml;ftsbeziehungen mit wichtigen Technologiepartnern
aufgebaut und wir haben unsere Produktpl&auml;ne f&uuml;r 1999 ausgearbeitet.

Die Anzahl der Emails, die ich von der Amiga Gemeinde bekommen habe, war
&uuml;berw&auml;ltigend. Die meisten Emails waren motivierend und unterst&uuml;tzend. Ich
bekam viele Ratschl&auml;ge und Vorschl&auml;ge &uuml;ber Technologie und Produkte. Diese
Emails waren einfach toll. Sie sind aufbauend, verst&auml;ndnisvoll, interessant
und vergn&uuml;gend zu lesen. Die Leute in der Amiga Gemeinde haben eine
gro&szlig;artige Pers&ouml;nlichkeit. Viele Emails waren kurz und voller Ermutigungen,
w&auml;hrend fast ebenso viele &uuml;ber mehre Seiten lang waren, mit Listen,
Vorschl&auml;gen, Ideen und Meinungen. Vielen Dank f&uuml;r diese Unterst&uuml;tzung per
Email, die extrem anspornend f&uuml;r das Amiga Team und mich war. Nat&uuml;rlich gab
es auch Emails von Amiganern, die frustriert durch die Situation waren.
Diese Emails waren wertvoll f&uuml;r mich, da sie mir Einblick in Fehler der
Vergangenheit geben, so da&szlig; ich sie auf unserem Weg in die Zukunft
vermeiden kann. Bitte h&ouml;rt nicht auf, Emails zu schreiben. Es tut mir leid,
da&szlig; ich nicht allen antworten kann. Ich habe pers&ouml;nlich auf &uuml;ber 600 Emails
geantwortet, aber mit der Zeit bin ich dem Volumen nicht mehr nachgekommen.
Ich m&ouml;chte versichern, da&szlig; ich jede Email lese, die ich bekomme und da&szlig; sie
eine wichtige Rolle bei der Gestaltung unserer Zukunftspl&auml;ne spielen. Ich
werde weiterhin pers&ouml;nlich auf so viele Emails wie m&ouml;glich antworten.

Dies ist auch schon der Stickpunkt f&uuml;r mein Hauptanliegen in diesem Monat,
n&auml;mlich die Kommunikation. Es ist wichtig, da&szlig; wir eine effektive
Kommunikation mit der Gemeinde aufrechterhalten. Emails und Anfragen f&uuml;r
Gesch&auml;ftstreffen &uuml;berschwemmen zur Zeit unser Team. Diese Menge an
Kommunikation ist sehr aufbauend, aber dennoch m&ouml;chte ich niemanden
demotivieren, weil nicht allen pers&ouml;nlich Antwort gegeben werden kann.

Wir arbeiten derzeit einen Vorschlag aus, wie man die Kommunikation
zwischen Amiga und der Gemeinde noch verbessern kann. Dieser Vorschlag wird
aus vielschichtigen Programmen bestehen, inklusive dem derzeitigen
Executive Update, einem Team, das Emails beantwortet, einem neuen Amiga
Beratungsbeirat, Umfrageb&ouml;gen f&uuml;r unsere zuk&uuml;nftigen Produktmerkmale, einer
monatlichen und besseren Usergroup Kommunikation sowie verbesserte
Kommunikation mit der Amiga Presse. Detaillierte Informationen zu all
diesen Punkten werden in den n&auml;chsten Wochen auf unserer Website zu finden
sein. Um die Gemeinde noch zus&auml;tzlich auf dem neuesten Stand unserer Amiga
Aktivit&auml;ten zu halten, wird das Hauptziel dieser Punkte sein, die Gemeinde
in die Zukunftspl&auml;ne von Amiga aktiv miteinzubeziehen. Wir alle m&uuml;ssen
zusammen daran arbeiten, um sicher zu gehen, da&szlig; die gesteckten Ziele auch
der Gemeinde helfen und es so Amiga erm&ouml;glichen, die n&auml;chste
Computerrevolution einzuleiten.

Eine der geplanten Kommunikationsprogramme ist der neue "Amiga
Beratungsbeirat" oder AAC (Amiga Advisory Council). Die Idee f&uuml;r dieses
Programm entstand durch Gespr&auml;che mit Leuten aus der Amiga Gemeinde. Es ist
zu schwierig, Tausende von Menschen in unseren Planungsproze&szlig;
miteinzubeziehen, und so mu&szlig;ten wir ein besser zu handhabendes Forum
gr&uuml;nden. Wir haben vor, einen Beratungsbeirat zu etablieren, der aus Leuten
besteht, die als "Leiter" in der Amiga Szene angesehen werden. Die
Mitglieder dieses Beirats AAC sollen von der Amiga Gemeinde gew&auml;hlt werden.
Wir arbeiten bereits an den Details dieser Wahlprozedur. Dieser Beirat soll
alle Zugeh&ouml;rigen der Amiga Gemeinde repr&auml;sentieren, so da&szlig; wir eine
vielf&auml;ltige Palette von Bedenken und Vorschl&auml;gen f&uuml;r unsere Zukunftspl&auml;ne
mit dem Amiga bekommen. Wir werden spezielle Messageboards ins Leben rufen
sowie Email-Listen und Treffen, die es den AAC-Mitgliedern erm&ouml;glichen
sollen, effektiv zu kommunizieren. Die Informationen und Entscheidungen
eines solchen AAC Treffens werden mit der Gemeinde geteilt. Also, haltet
auf unserer Website weiterhin Ausschau nach Neuigkeiten zu diesem Programm.
Ebenso werden wir diese Informationen in Amiga Magazinen und Usergroups
ver&ouml;ffentlichen.

Ende April reiste ich nach Deutschland und England, um mich mit
Repr&auml;sentanten von Firmen und Usergroups zu treffen, um gemeinsam die
Zukunftspl&auml;ne des Amigas zu besprechen und die Realisierung diese Pl&auml;ne mit
Hilfe der Gemeinde zu untermauern. Ich m&ouml;chte mich bei den Leuten
entschuldigen, die aufgrund einer n&ouml;tigen &uuml;berschaubaren und daher
begrenzten Teilnehmerzahl keine Gelegenheit hatten, an den Treffen
teilzunehmen. In Deutschland und England waren es ca. 30-40 Teilnehmer, die
Entwickler, H&auml;ndler, Distributoren, Usergroups und die Presse vertreten
haben. Ich denke, da&szlig; diese Treffen sehr produktiv und informativ waren.
Dies macht es mir m&ouml;glich, unsere Zukunftspl&auml;ne zu optimieren und
gleichzeitig die Bed&uuml;rfnisse der Gemeinde kennenzulernen. Zum Beispiel
haben wir enorm viel Zeit verbracht, dar&uuml;ber zu sprechen, wie wir die Amiga
Gemeinde von der jetzigen Plattform zu der n&auml;chsten Generation bringen
k&ouml;nnen. Die derzeitige Amiga Plattform hat noch einige n&uuml;tzliche Jahre vor
sich, doch man investiert nicht darin, weil die n&auml;chste Generation schon
bereitsteht. Ein Vorschlag ist, die Next Generation "AmigaSoft" an das
Operating Enviroment (OE) anzuschlie&szlig;en, so da&szlig; es auf einem derzeitigen
Amiga mit Power-PC Karte l&auml;uft. Dies w&auml;re keine optimale Konfiguration,
aber es w&auml;re eine Lebensverl&auml;ngerung der momentanen PPC-Amigas. Wir werden
&uuml;ber diese M&ouml;glichkeit nachdenken und das Ergebnis bekanntgeben.

F&uuml;r mich pers&ouml;nlich war der Aufenthalt in Deutschland und England
wundervoll. Der Besuch war produktiv und sehr angenehm. Ich habe sehr nette
Leute kennengelernt und sch&ouml;ne Abende mit gutem Essen verbracht. Ich habe
es sehr genossen, mich mit Leuten aus der Amiga Gemeinde zu treffen. Nach
sechs Jahren Arbeit in der PC-Industrie mit leitenden Angestellten ist es
f&uuml;r mich wie eine frische Brise, mit Menschen zu arbeiten, die so
leidenschaftlich und enthusiastisch an ihrem Glauben festhalten. Ganz
besonders habe ich die langen Gespr&auml;che am Abend genossen, die von noch
mehr Kreativit&auml;t und &Uuml;berzeugung geleitet waren. Ich m&ouml;chte allen, die an
diesen Veranstaltungen teilnahmen, danken, da&szlig; sie meinen Aufenthalt so
produktiv und angenehm gemacht haben. F&uuml;r die Neugierigen: es war f&uuml;r mich
auch sehr aufregend, zusammen mit Petro mit 240 Sachen &uuml;ber die Autobahn zu
fegen. Ich danke Gott f&uuml;r die stabilen deutschen Autos und das gute
deutsche Bier.

Bevor ich zum Ende komme, m&ouml;chte ich noch einige Themen ansprechen, die ich
k&uuml;rzlich per Email bekommen habe. Erst einmal m&ouml;chte ich unsere
Hardware-Produktpl&auml;ne klarstellen. Amiga hat vor, zum Ende des 4. Quartals
1999 einen Multimedia-Computer der n&auml;chsten Generation auf den Markt zu
bringen. Dieser Computer wird eine einzigartige Architektur, ein
au&szlig;erordentliches Betriebssystem, eine geniale 3D-Gameperformance und
zukunftsorientierte Multimediabestandteile besitzen. Ich bin sehr
zuversichtlich, da&szlig; diese Computer voll und ganz den Erwartungen der Amiga
Gemeinde an eine n&auml;chste Generation entsprichen. Leider k&ouml;nnen wir noch
keine Details ver&ouml;ffentlichen, da wir mit unseren Partnerfirmen einen
Vertrag geschlossen haben, hier&uuml;ber Stillschweigen zu bewahren. Au&szlig;erdem
m&uuml;ssen wir vorsichtig sein, um nicht vorzeitig unsere Konkurrenz &uuml;ber
unsere Pl&auml;ne zu informieren. Was ich jedoch sagen kann, ist da&szlig; unsere
Technologie-Partner, mit denen wir zusammenarbeiten, extrem begeistert von
unserem Weg und unserer Technologie sind. Es gibt Amiganer in allen gro&szlig;en
Technologie-Unternehmen, und sie sind sofort bereit, bei einer neuen
Computerrevolution mitzuhelfen. Unter diesen Partnern sind gro&szlig;e
Technologie-Firmen und Komponentenhersteller der Computerindustrie. Ich
denke, wir werden auf der World of Amiga und auf der AmiWest Show im Juli
mehr verraten k&ouml;nnen.

Der neue Amiga Multimedia Computer wird ein zu Hause vernetztes
"Information Appliance" Umfeld bedienen. Dies erm&ouml;glicht den vernetzten
Ger&auml;ten den Zugriff auf die Power und auf die Features dieses Computers.
Ich werde den Begriff "Information Appliance" noch einmal genauer
definieren, da dies ein bedeutsamer Ausdruck in der Computerindustrie wird.
"Information Appliances" sind keine digitalen Toaster, K&uuml;hlschr&auml;nke oder
&Ouml;fen mit LCD Displays. Es sind Ger&auml;te wie kabellose LCD Tableaus, Internet
Terminals, Spielger&auml;te und digitale Set-Top Boxen. Diese Ger&auml;te sind durch
ein Netzwerk verbunden und dann in ein einzelnes Betriebssystem (Operating
Enviroment) integriert. Der Grund, warum wir den Begriff "Operating
Enviroment" (kurz "OE") verwenden ist es, damit eher unsere neue Software
zu beschreiben als das Betriebssystem. Denn unsere Software ist viel mehr
als nur das eigentliche Betriebssystem.

Au&szlig;er dem genannten Multimedia-Computer entwickelt Amiga Designs f&uuml;r eine
Vielzahl von "Information Appliances" Ger&auml;ten wie kabellosen LCD Tableaus.
Es ist unser Ziel, ein komplettes Homecomputer-Umfeld zu erm&ouml;glichen,
anstatt nur einen Computer nutzen zu k&ouml;nnen. Wir werden andere Entwickler
ermutigen, Amiga-kompatible Computer und "Information Appliances" zu
entwickeln und auf den Markt zu bringen. Um unsere Absichten der Amiga
Gemeinde ganz klar zu erl&auml;utern, werden wir unser erstes Produktkonzept an
die Amiga Presse weitergeben, das dann in den n&auml;chsten Ausgaben
ver&ouml;ffentlicht wird. Ich hoffe, dies bringt Licht in unsere Produktpl&auml;ne.
Wir werden weitere Details ver&ouml;ffentlichen, sobald es angemessen ist.

Das zweite Thema, das ich noch ansprechen m&ouml;chte, ist der
Entwickler-Support von Amiga. Die Amiga Entwicklergemeinde ist f&uuml;r uns sehr
wichtig und wir werden eine aktive Rolle bei dem Entwickler Support
einnehmen. Wir erstellen Pl&auml;ne f&uuml;r den finanziellen und technischen
Support. Wir werden in den n&auml;chsten 60-90 Tagen mehr dar&uuml;ber sagen k&ouml;nnen,
wenn wir au&szlig;erdem weitere technische Informationen an Entwickler
herausgeben werden.

Au&szlig;erdem habe ich die "Major Activities" Rubrik aktualisiert, um so noch
genauer den Status der Programme von Amiga zu erl&auml;utern. Ihr solltet es
lesen. Zus&auml;tzlich haben wir noch eine "Monthly Questions and Answers" Seite
in der "Executive Update" Rubrik eingerichtet. Diese Seite wird alle Fragen
beantworten, die mir am h&auml;ufigsten per Email geschickt wurden.

Abschlie&szlig;end m&ouml;chte ich noch sagen, da&szlig; ich jetzt mehr als je zuvor von den
M&ouml;glichkeiten f&uuml;r Amiga und f&uuml;r die Gemeinde begeistert bin. Es war eine
lange Durststrecke, aber die Amiga Gemeinde ist immer noch die Beste in der
gesamten Computerindustrie und die Zeit ist reif f&uuml;r eine neue
revolution&auml;re Architektur und Plattform. Ich werde alle &uuml;ber unseren
Fortschritt auf dem Laufenden halten und verspreche, noch mehr Details
preiszugeben, sobald die Zeit gekommen ist.

Alles Gute
Jim Collas
President, AMIGA«

(Quelle: AMIGA)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
