<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Preissenkungen und andere Neuigkeiten von VMC

»   o St. Leon-Rot den 06.05.1999

     Die spinnen die R&ouml;mer... Oder verschenkt VMC HyperCOM's ?

     Mit sofortiger Wirkung werden alle Preise der
     HyperCOM-Schnittstellenkarten drastisch reduziert !

     Dies gilt nat&uuml;rlich auch f&uuml;r alle VMC-Fachh&auml;ndler, was Sie in den
     n&auml;chsten Tagen erfreut auf deren Werbe- und Internetseiten
     feststellen werden.

     Aber keine Bange liebe Kunden, dies ist kein Ausverkauf oder R&uuml;ckzug
     aus dem Amiga-Markt, sondern es beweist Ihnen genau das Gegenteil !
     Mit dieser "vorerst zeitlich begrenzten Aktion", bieten wir Ihnen die
     M&ouml;glichkeit, uns und unseren Fachh&auml;ndlern zu beweisen, dass Sie
     Spitzentechnologie zu St&uuml;ckzahlenpreisen im Amiga-Markt zu sch&auml;tzen
     wissen.

     Es soll Ihnen auch zeigen, dass wir uns nat&uuml;rlich auch bei unseren
     treuen Kunden bedanken wollen, die mit Ihrer Zufriedenheit &uuml;ber
     Qualit&auml;t und Support eines unserer Aush&auml;ngeschilder sind. Erst durch
     diese mittlerweile tausende zufriedener Kunden ist es uns m&ouml;glich, in
     solche Preis-/ Leistungsregionen vorzudringen.

     Sicherlich werden Preise wie 99.- DM f&uuml;r eine Zorro II HyperCOM 3+,
     oder etwa 79.- DM f&uuml;r eine Amiga 1200 HyperCOM 1 dem einen oder
     anderen Konkurrenten ein kleines Magengeschw&uuml;r bereiten, aber es wird
     viele Amiga-Anwender ein St&uuml;ck n&auml;her an den Puls der Zeit r&uuml;cken, das
     Internet...

     Um Ihnen einen schnellen &Uuml;berblick &uuml;ber die neuen Preise zu geben,
     schauen Sie doch einfach mal kurz in unser Amiga-Lieferprogramm.

     In diesem Sinne...Keep your Amiga Happy....

     VMC Harald Frank«


» o St. Leon-Rot den 06.05.1999

     Neue HyperCOM 1 auch mit Uhrenport- Verlängerung !

     Auf vermehrten Wunsch unserer Kunden, bieten wir die HyperCOM
     1-Schnittstellenkarte nun auch in einer zweiten Variante an, die den
     Amiga 1200-Uhrenport zus&auml;tzlich um ca. 10 cm. verl&auml;ngert.

     Mit dieser neuen Version sind keinerlei mechanische Probleme mit
     anderen Erweiterungen wie einer BVision-Grafikkarte oder zu gross
     geratenen Zorro-Boards mehr zu bef&uuml;rchten. Als zus&auml;tzlicher Nutzen
     bietet sich hierdurch auch der Einsatz auf einem BuddaFlash
     Controller von Individual Computers an, welcher auch &uuml;ber einen Amiga
     1200 kompatiblen Uhrenport verf&uuml;gt.

     Somit ist eine HyperCOM 1 auf einem BuddaFlash die derzeit g&uuml;nstigste
     Multi-I/O Karte f&uuml;r Zorro-Amigas. Achten Sie bitte bei einer
     Bestellung auf die korrekte Angabe der von Ihnen gew&uuml;nschten
     Kartenversion !

     Mfg.

     VMC Harald Frank«


»  o St. Leon-Rot den 06.05.1999

     Die Zweite Generation der HyperCOM 3+ ist eingetroffen..

     Endlich sind die neuen HyperCOM 3+-Schnittstellenkarten f&uuml;r Amiga
     1200, BuddaFlash und CatWeasel-Z2 eingetroffen.

     Diese neue Generation bietet absolut alles was Ihrem Amiga 1200 noch
     an Konnektivit&auml;t fehlt. Mit einem absolut unschlagbaren Preis-/
     Leistungsverh&auml;ltnis gibt es eigentlich nichts, was Sie noch davon
     abh&auml;lt, Ihre Kommunikations- und Druckanwendungen endlich mal auf
     Trab zu bringen. Sie werden staunen, wie schnell auf einmal manch ein
     vermeintlich lahmer Drucker werden kann.

     F&uuml;r n&auml;here und genauere Informationen werfen Sie doch einfach mal
     einen Blick auf das detailierte HyperCOM 3+ Datenblatt.

     Den ganz stark Interessierten raten wir, recht schnell bei uns oder
     unseren Fachh&auml;ndlern zu bestellen, da der jetzige Lagerbestand
     aufgrund der hohen Nachfrage nur etwa 1-2 Monate reichen wird !

     Mfg.

     VMC Harald Frank«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
