<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Vorwort
-------

Die Schlagzeilen des Monats Mai: +++ AMIGA stellt Tom Schmidt als Chief 
Operating Officer (COO) ein +++ AMIGA erw&auml;gt, das Betriebssystem des Amigas 
der n&auml;chsten Generation auch f&uuml;r Classic-Rechner mit PowerPC-Karte zu 
entwickeln +++ AMIGA ver&ouml;ffentlicht erste Konzeptskizzen zum AmigaNG +++


Willkommen zur neuen Ausgabe von AMIGA aktuell.

Wie ihr bereits an den 'Schlagzeilen des Monats', ein neuer Bestandteil des 
Vorworts &uuml;brigens, erkennen konntet, hat sich auch im Mai einiges bei AMIGA 
getan. Das l&auml;sst sich jedoch leider nicht auf den Amiga-Markt allgemein 
&uuml;bertragen: Wichtige Neuigkeiten gab es im vergangenen Monat fast &uuml;berhaupt 
nicht, selbst nicht zum Thema G3/G4. M&ouml;glicherweise k&uuml;ndigt sich ja bereits 
die Sommerflaute an.


Die Interna der heutigen Ausgabe:

* Per Torp hat Indizes von AMIGA aktuell und AMIGA aktuell International     
  erstellt. Wer einen bestimmten Artikel einer &auml;lteren Ausgabe sucht,        
  sollte sich das Archiv im Aminet (docs/mags/Mags_txt_index.lha)            
  herunterladen.

* Die AMIGA-aktuell-Specials sind jetzt wieder per Packet-Radio verf&uuml;gbar. 
  Peter Huyoff spielt sie in seine Home-BBS HGWBOX in die Rubrik AMIGA@DEU  
  ein. Von dort aus werden sie im gesamten CB-Funk-BBS-Netz innerhalb       
  Deutschlands verbreitet. Eventuell angeh&auml;ngte Grafiken werden jedoch      
  wegen der geringen Daten&uuml;bertragungsrate nicht ber&uuml;cksichtigt.

* Offenbar ist die Mailbox Soundbox, in der auch AMIGA aktuell zu finden    
  war, geschlossen worden. An sie gerichtete Mails kommen zur&uuml;ck, und die   
  Einwahlnummern sind auch nicht mehr geschaltet.


Zu den regelm&auml;&szlig;igen Aufrufen:

* Wir suchen jemanden, der eine eigenst&auml;ndige AMIGA-aktuell-Rubrik f&uuml;hren   
  will, in der &uuml;ber Software-Updates informiert wird. Monat f&uuml;r Monat       
  erscheinen bekanntlich unz&auml;hlige FD- und kommerzielle AMIGA-Programme in  
  neuen Versionen. Ziel dieser neuen Rubrik ist es, die wichtigsten         
  Verbesserungen von neuen Software-Updates aufzulisten.
  Wer hat Interesse, sich darum zu k&uuml;mmern?
    
* Weiterhin gesucht werden Tester von frei kopierbarer Software. Jeder, der  
  sich f&uuml;r diese Aufgabe bereit erkl&auml;rt, wird in eine spezielle             
  Verteilerliste eingetragen und erh&auml;lt dann in unregelm&auml;&szlig;igen Abst&auml;nden    
  Test-Vorschl&auml;ge, ist aber zu nichts verpflichtet.
  Nat&uuml;rlich freuen wir uns aber genauso &uuml;ber Tests kommerzieller            
  Produkte und nicht &uuml;ber die Verteilerliste vorgeschlagener FD-Software.
  Schreibt an aakt@gmx.de .


Viel Spa&szlig; jetzt bei dieser Ausgabe,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
