<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Workshops / Hintergrundberichte / Buchvorstellungen
---------------------------------------------------

1. Update: So senkt ihr eure Telekom-Rechnung!

Es tun sich wundersame Dinge: Kaum hat Mannesmann Arcor seinen Konkurrenten 
o.tel.o geschluckt, schickt sich diese Firma an, die Tariftabelle zu 
erobern...
Nun ja, 'erobern' ist vielleicht etwas &uuml;bertrieben, aber angesichts der 
Tatsache, dass o.tel.o es bislang nicht geschafft hat, auch nur zu einer 
Zeit g&uuml;nstigster Anbieter zu sein, ist der neue Einfluss auf die 
Gesch&auml;ftspolitik durchaus bemerkenswert. Jetzt n&auml;mlich hat das Unternehmen 
genau dies erreicht. Zwar ist die "Happy Hour" ab 21 Uhr bis Ende Juni 
befristet, jedoch ist davon auszugehen, dass o.tel.o sie danach regul&auml;r 
weiterf&uuml;hrt. Denn erstens w&auml;re andernfalls der Imageschaden gro&szlig;, und 
zweitens wurden solche Sonderpreise in der Vergangenheit nach ihrem 
Auslaufen fast immer zum regul&auml;ren Tarif erhoben.

Damit allerdings d&uuml;rfte der preisliche Spielraum zwischen 21 und 7 Uhr 
jedoch auch nahezu ausgesch&ouml;pft sein. Ich zumindest kann mir nicht 
vorstellen, dass kurzfristig ein Tarif von 3,5 Pfennig oder weniger 
erreichbar ist. Tags&uuml;ber dagegen scheinen mir moderate Preissenkungen 
durchaus noch m&ouml;glich.


Jetzt aber zur aktuellen Tarif&uuml;bersicht:

G&uuml;nstigster Call-by-Call-Anbieter (ohne Anmeldung, Mindestumsatz, etc.):

Wann:    |      Wohin:  Festnetz -&gt; Festnetz      Festnetz -&gt; Mobilfunknetz
===========================================================================
werktags 9-18 Uhr       TelDaFax (01030), 12 Pfg.     3U (01078), 41,9 Pfg.
sa/so/feiert. 9-18 Uhr  TelDaFax (01030), 9 Pfg.   Viatel (01079), 36 Pfg.²

t&auml;glich 18-19 Uhr       TelDaFax (01030), 9 Pfg.    Viatel (01079), 36 Pfg.
t&auml;glich 19-20 Uhr       Mobilcom (01019), 8 Pfg.¹   Viatel (01079), 36 Pfg.
t&auml;glich 20-21 Uhr       3U (01078), 5,9 Pfg.        Viatel (01079), 36 Pfg.
t&auml;glich 21-22 Uhr       o.tel.o (01011), 4 Pfg.     Viatel (01079), 36 Pfg.
t&auml;glich 22-7 Uhr        Talkline (01050), 3,9 Pfg.  Viatel (01079), 36 Pfg.
t&auml;glich 7-8 Uhr         Esprit (01040), 5 Pfg.      Viatel (01079), 36 Pfg.
t&auml;glich 8-9 Uhr         TelDaFax (01030), 9 Pfg.    Viatel (01079), 36 Pfg.

¹: Bei Verbindungen von bis zu etwa 7 Minuten Dauer kann TelDaFax (01030)   
   mit 9 Pfg. g&uuml;nstiger sein (s.u., Geb&uuml;hrenberechnung).
²: An Feiertagen, die nicht aufs Wochenende fallen, ist 3U (01078) mit 41,9  
   Pfg. g&uuml;nstiger (s.u., Geb&uuml;hrenberechnung).


Die Tabelle sollte im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige 
Anmerkungen:

* Angegeben ist jeweils der f&uuml;r 1 Verbindungsminute f&auml;llig werdende Betrag.

* 'Werktags' bedeutet montags bis freitags mit Ausnahme von Feiertagen.

* Bei Ortsgespr&auml;chen hat die Telekom in weiten Teilen Deutschlands noch ein  
  Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften      
  g&uuml;nstige City-Tarife an. In der Regel hei&szlig;t es also bei                  
  Ortsgespr&auml;chen: Weiterhin die Deutsche Telekom benutzen.
  Auf http://www.muc.de/~hm/telefon-tarife/tarifzonen.html k&ouml;nnt ihr        
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte  
  es mal passieren, dass ihr "f&auml;lschlicherweise" einen der alternativen     
  Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom    
  - und damit wom&ouml;glich billiger - zustande kommen k&ouml;nnte.

* Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,      
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass    
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im     
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen     
  l&auml;sst. Mein Favorit: http://www.teltarif.de/db/index.html


Die Anbieter verfahren bei der Geb&uuml;hrenberechnung teilweise 
unterschiedlich:

* TelDafax und 3U rechnen sekundengenau ab, d.h. ihr zahlt hier  
  wirklich nur f&uuml;r die Zeit, die die Verbindung andauert.

* Viatel berechnet bei Verbindungen bis 30 Sekunden Dauer die gesamten 30   
  Sekunden, danach wird exakt abgerechnet. ACHTUNG: An Feiertagen, die      
  nicht aufs Wochenende fallen, rechnet Viatel nach dem Werktags-Tarif ab.

* Mobilcom, o.tel.o, Talkline und Esprit rechnen nach Minuten ab.


F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
