<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,edguy,mandrake">
<title>Edguy:Mandrake</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Edguy: Mandrake</font></h1><BR> (64:31 / AFM)</center></P>

<p>Erst Anfang des Jahres ver&#246;ffentlichte Edguy Vordenker Tobias Sammet mit Avantasia eines der st&#228;rksten Melodic Power Metal Metal Alben der letzten 5 Jahre und nur knapp 9 Monate sp&#228;ter legt er mit seiner Stammband Edguy mal eben ein neues Studioalbum vor, welches qualitativ (nat&#252;rlich?) auf einem &#228;hnlich hohen Niveau angesiedelt ist wie Avantasia. Hervorzuheben ist vor allem die Tatsache, dass &quot;Mandrake&quot; absolut nicht eindimensional, sondern erstaunlich abwechselungsreich klingt, was bei gesch&#228;tzten 90 % der Konkurrenz nicht der Fall ist. Schon der vielschichtige, mit gut sieben Minuten &#252;berlange Opener &quot;Tears Of A Mandrake&quot; zeigt das ganz eindeutig und w&#228;chst mit jedem Durchgang, zumal man bei Edguy eher auf den typischen Speed Kracher am Anfang gerechnet h&#228;tte. Diese gibt es dann aber nat&#252;rlich mit &quot;Golden Dawn&quot;, dem harten &quot;Nailed To The Wheel&quot; (erinnert ein wenig an &quot;No More Foolin`&quot; vom `98er Kracher &quot;Vain Glory Opera&quot;) und &quot;Fallen Angels&quot; im weiteren Verlauf der Platte und ich lege meine Hand daf&#252;r ins Feuer, dass Edguy Fans diese Track schon beim ersten Durchlauf in ihr Herz schlie&#223;en werden. Hervorzuheben ist ansonsten noch das &#252;berlange, f&#252;r Edguy Verh&#228;ltnisse fast schon d&#252;stere &quot;The Pharaoh&quot;, welches wohl mit zu den Highlights in der bisherigen Bandgeschichte geh&#246;ren d&#252;rfte. Abgerundet wird das ganze noch von weiteren Ohrw&#252;rmern wie dem fast schon poppig anmutetenden &quot;Painting On The Wall&quot; und &quot;Jerusalem&quot;, die ebenfalls qualitativ auf einem absolut hohen Niveau stehen. Lediglich mit der Ballade &quot;Wash Away The Poison&quot; konnte ich mich bisher nicht so recht anfreunden, haben Edguy in der Vergangenheit mit &quot;Scarlet Rose&quot; doch gezeigt, dass sie auch in diesem Bereich einiges mehr auf dem Kasten haben. Abgesehen von diesem kleinen Sch&#246;nheitsfehler ist &quot;Mandrake&quot; ein absolut b&#228;renstarkes Album geworden, welches sich weder hinter &quot;Avantasia&quot; noch hinter Klassikern wie &quot;Keeper Of The Seven Keys&quot; aus dem Haus
e Helloween verstecken braucht. Keine Frage: &quot;Mandrake&quot; ist f&#252;r jeden Fan vom melodischem Power Metal ein absoluter Pflichtkauf und d&#252;rfte Edguy endg&#252;ltig in der Champions League dieses Genres neben Acts wie Gamma Ray, Stratovarius oder Helloween etabliert haben. Edguy geh&#246;rt definitiv die Zukunft!</P>  

<p>Fazit: 9.5 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd3.jpg"></P>
<p><img src="kit.gif"></P>
</Center>





<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
