<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,heavenly,sign of the winner">
<title>Heavenly: Sign Of The Winner</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Heavenly: Sign Of The Winner</font></h1><BR> (54:09 / Noise)</center></P>

<p>Nachdem im letzten Jahr das Debut &quot;Coming From The Sky&quot; der blutjungen Franzosen von Heavenly auf den Markt kam und trotz durchschnittlicher Benotungen (auch in der Metal Corner) und geringem Medieninteresse zum bestverkauften Noise Recods Debut seit Jahren avancierte, liegt mit &quot;Sign Of The Winner&quot; gut ein Jahr sp&#228;ter der entsprechende Nachfolger vor. Schon nach dem ersten Durchlauf wird dann auch sofort klar, dass die Jungs ihrer stilistischen Linie aus Gamma Ray, Stratovarius und (old) Helloween Einfl&#252;ssen (immer noch scheint ex-K&#252;rbiskopf Michael Kiske hier mitzutr&#228;llern, was mitnichten der Fall ist) zwar treu geblieben sind, aber auf der anderen Seite auch nicht mehr nur als einfaches Plagiat zu sehen sind - daf&#252;r wird den einzelnen Songs schon zu sehr der eigene Stempel aufgedr&#252;ckt. So legen die Jungs nach dem obligatorischen Intro mit dem Trio &quot;Destiny&quot; (der &#252;bliche speedige Opener), &quot;Sign Of The Winner&quot; und dem super melodischen &quot;The World Will Be Better&quot; (f&#252;r mich das klare Highlight der Platte) auch fulminant los und h&#228;tte man dieses hohe Niveau &#252;ber die gesamte Spielzeit halten k&#246;nnen, st&#252;nde unter diesem Review sicherlich eine 9 oder gar 10. An dieser Formulierung wird aber schon klar, dass den Jungs danach ein wenig die Puste ausgeht und die nachfolgenden Songs weitaus weniger spektakul&#228;r aus den Boxen dr&#246;hnen. Sicherlich: Richtig schlecht ist die weitere Mukke nicht und Speed Fanatiker werden mit Nummern der Marke &quot;Until The End&quot; auch voll auf ihre Kosten kommen, aber mir pers&#246;nlich ist es dann doch etwas zu unspektakul&#228;r. Trotzdem kann man der Band ohne Probleme attestieren, sich nach dem Debutalbum positiv weiterentwickelt zu haben und mit &quot;Sign Of The Winner&quot; ein Album abgeliefert zu haben, welches zwar nicht mit den aktuellen Meisterwerken von Edguy oder Gamma Ray mithalten kann (was ja auch nicht unebdingt einfach ist!), aber sicherlich besser als so manche Konkurrenz aus dem melodischen Power Metal Genre daherkommt. Und wer wei&#223;? Wenn Heavenly ihre St&#228;rken auf dem n&#228;chsten Longplayer konsequent 
ausloten und nur noch Songs der Marke &quot;The World Will Be Better&quot; schreiben, dann steht uns sicherlich ein Kn&#252;lleralbum ins Haus. Somit reicht es f&#252;r &quot;Sign Of The Winner&quot; vorerst nur f&#252;r ein knappes &quot;gut&quot;, wobei ich dazu sagen muss, dass die angesprochene Zielgruppe diese Platte auf jeden Fall antesten sollte!</P>

<p>Fazit: 7 von 10 Punkten </P> 
<center>
<p><img src="kit.gif"></P>
<p><img src="cd4.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
