<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Helloween - Der Split</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="green">Helloween Split - Musste es so kommen?</font></Center></h1></P>

<p>Die History von Helloween ist ohne Frage eine recht interessante: Mitte der 80er als deutsche Anwtort auf Iron Maiden / Judas Priest gestartet, zeichnete sich die Band nicht nur f&#252;r die absolut pr&#228;genden Alben &quot;Keeper Of The Seven Keys - Part I / II&quot; verantwortlich (welche ganze Garnisonen von Bands
beeinflussten - darunter so illustere Act`s wie Edguy und HammerFall) , sondern gleichfalls f&#252;r derbe Line-up Probleme, die seid der Anfangszeit zu Helloween fest dazu geh&#246;rten. Zun&#228;chst erwischte es Kai Hansen Ende der 80er (der daraufhin seine eigene Band Gamma Ray gr&#252;ndete) und 1993 - nachdem die Band sich selber mit rockig ausgerichteten Alben wie &quot;Chameleon&quot; (welches in meinen Augen trotzdem brilliant ist) - Ausnahmes&#228;nger Michael Kiske, der f&#252;r viele heutzutage immer noch zu den besten Metal S&#228;ngern &#252;berhaupt geh&#246;rt. </P>

<p>Tja, mit dem Quasi-Neuanfang 1994 schien es so, als ob Helloween nochmal die Kurve kriegen w&#252;rden: S&#228;nger Andi Deris und Drummer Uli Kusch brachten neuen Schwung in die Band, die ansonsten noch aus Roland Grapow (Gitarre), Markus Grosskopf (Bass) und Michael Weikath (Gitarre) bestand. Das `94er Werk
&quot;Master Of The Rings&quot; zeigte die Band wieder deutlich heavier und die Richtung schien die richtige zu sein. Mit dem `96er Nachfolgealbum &quot;The Time Of The Oath&quot; schaffte man es sogar ein Album zusammenzustellen, welches (erstmals) qualitativ mit den alten Werken mithalten konnte, auch wenn es - logischerweise - musikalische Unterschiede gab, was sich alleine schon durch die v&#246;llig andere Stimme von S&#228;nger Andi Deris erkl&#228;ren l&#228;sst. Trotzdem: Helloween konnten sich die Sympathien der alten Fans langsam wieder erspielen und die Zukunft sah rosig aus - zumindest war ich 1996 der Meinung das Helloween wieder da sind!</P>

<p>Diese Feude sollte allerdings nicht von langer Dauer sein: Das Livealbum &quot;High Live&quot; lassen wir mal aussen vor (hier gehen die Meinungen weit auseinander), aber schon die Soloaktivit&#228;ten von Gitarrist Roland Grapow (&quot;The Four Seasons Of Life&quot;) und S&#228;nger Andi Deris (&quot;Come In From The Rain&quot;), die beide parallel im Sommer `97 ver&#246;ffentlicht wurden, lie&#223;en nichts gutes erahnen - zumindest das Andi Deris Album war zwar gutklassig, aber dies war nur der Anfang zahlreicher Sideprojekte der Bandmitglieder. So versuchten sich ein jeder aus der Band in anderen Projekten (Catch The Rainbow, Shockmachine) bzw. als Gastmusiker auf anderen Platten. Klaro, diese externen Aktivit&#228;ten mussten Einfluss auf die musikalische Qualit&#228;t haben und schon das `98er Album &quot;Better Than Raw&quot; lie&#223; die Klasse des Vorg&#228;ngers &quot;Time Of The Oath&quot; vermissen und z&#228;hlt - trotz einiger Ausnahmen - zu den schlechtesten Werken der Band. Auch 
&#252;ber das `99er Coveralbum &quot;Metal Jukebox&quot; sollte man lieber den Mantel des Schweigens breiten, sind doch selbst viele Helloween Die-Hard Fans (der Verfasser dieser Zeilen eingeschlossen) damit mehr als nur unzufrieden....</P>

<p>Das die Band sp&#228;testens an dieser Stelle auf die Notbremse h&#228;tte treten m&#252;ssen - sprich: alle externen Projekte canceln - war schon damals kein gro&#223;es Geheimniss mehr. Umso unverst&#228;ndlicher, dass im Sommer `99 erst das zweite Soloalbum von Roland Grapow das Licht der Welt erblickte (&quot;Kaleidoscope&quot;), welches str&#228;flich unterbewertet wurde und mir sehr gefallen hatte, und anschlie&#223;en im Fr&#252;hjahr 2000 noch S&#228;nger Andi Deris mit &quot;Done By Mirrors&quot; nachziehen musste. Letzteres war allerdings ein Totalausfall und lie&#223; f&#252;r die Helloween Zukunft nichts positives erahnen....</P>

<p>Wie recht man hatte: Das n&#228;chste und nach wie vor aktuelle Helloween Album &quot;The Dark Ride&quot; (2000) war zwar einerseits eine Steigerrung im Vergleich zum Vorg&#228;nger, enthielt aber andererseits auch wieder einiges an Ausschusswaare - von einem Top Album kann in diesem Zusammenhang also beim besten Willen nicht gesprochen werden. Wie auch, entstanden die Songs doch in verschiedenen Studios (fast alle Bandmitglieder besitzen ein eigenes!) und wurden zwischen den Bandmitgliedern hin und her geschickt. Das da kein &#220;berhammer rauskommt, d&#252;rfte auf der Hand liegen. Wesentlich angebrachter w&#228;re es wohl gewesen, wenn die Band sich mal einige Monate irgendwo eingeschlossen h&#228;tte und dort Songs zusammen (!!) geschrieben h&#228;tte. Wie auch immer: Alleine dieser Umstand macht es doch mehr als deutlich, wie weit es bei Helloween inzwischen gekommen war - um ein richtig intaktes Bandgef&#252;ge handelte es sich augenscheinlich schon damals nicht mehr.</P>

<p>Und wo sind wir heute? Roland Grapow und Uli Kusch sind nicht mehr Bestandteil des seit 1994 existierenden und damit l&#228;ngsten Line-up`s in der Helloween History. Die Gr&#252;nde sind sicherlich vielschichtig, wobei das Fass wahrscheinlich von der Tatsache eines weiteren Sideprojekts in Form eines Prog. Albums von Roland Grapow &amp; Uli Kusch zusammen mit Symphony X S&#228;nger Russel Allen zum &#220;berlaufen gebracht wurde. Wie auch immer: Daran alleine lag es einfach nicht, zumal Roland Grapow immer noch derjenige in Helloween war, der sich auf den letzten Alben f&#252;r die st&#228;rksten Songs verantwortlich zeichnete - ein Herr Weikath ist von Glanztaten wie zu den seligen &quot;Keeper...&quot; Zeiten genauso entfernt wie ein Herr Deris von traumhaft sch&#246;nen Balladen, wie es sie noch auf &quot;The Time Of The Oath&quot; oder &quot;Master Of The Rings&quot; gab. Mutma&#223;ung oder nicht: Ich pers&#246;nlich mache mal wieder Michael Weikath`s bescheuerte Art daf&#252;r verantwortlich, 
warum die beiden letzendlich gehen mussten - mit diesem merkw&#252;rdigen Menschen gut auszukommen, fiele mir pers&#246;nlich wahrscheinlich nicht leicht, aber in einem Bandgef&#252;ge ist es noch viel extremer. &#196;hnliche Spannungen verleiteten ja seinerzeit schon Michael Kiske (der sehr viel mehr Grips hat, als manch anderer....) zum Ausstieg und ich vermute, dass es im Jahr 2001 die selben Spannungen waren, die zum neuerlichen Line-up Problem f&#252;hrten. Wenn man dann auch noch h&#246;rt, dass Uli Kusch niemals richtig in die Band integriert war und mit den Jungs sonst gar nix zu tun hatte, spricht ebenfalls nicht f&#252;r ein intaktes Bandgef&#252;ge. Zwangsl&#228;ufig musste es dann anscheinend so kommen - oder etwa nicht? Wie gesagt: Der Anfang vom Ende geht inzwischen 4 Jahre mit dem Release der ersten Soloplatten zur&#252;ck, da die Combo seitdem nicht mehr viel auf die Reihe gekriegt hat. Folgerichtig l&#228;sst sich das Killeralbum &quot;The Time Of The Oath&quot; dann noch als positiver 
Ausrutscher bewerten, wo alle Bandmitglieder noch mit 100 Prozent bei der Sache waren....</P>
<p>
Bleibt also eine Band aus drei Mitgliedern &#252;brig, die ohne kreative Nachfolger wohl aufgeschmissen sein wird. Weitermachen wollen Helloween aber auf jeden Fall und es scheint gen&#252;gend Fans zu geben, die das auch bef&#252;rworten - ich bin mir aber ziemlich sicher, dass ein Weitermachen nur dann Erfolg hat , wenn zum einen s&#228;mtliche Side- und Soloprojekte eingestellt werden und zum anderen die Band mal wieder zusammen arbeitet. Ich w&#252;rde mir ein neues, gelungenes Helloween Album auf jeden Fall w&#252;nschen. Ein Album mit &quot;Keeper...&quot; Status wird es zwar nicht mehr geben, aber zumindest ein zweites &quot;Time Of The Oath&quot; k&#246;nnte ich mir vorstellen. Bleibt nur zu hoffen, dass die neuen Members sorgf&#228;ltig ausgew&#228;hlt werden und nicht ebenfalls nach einigen Jahren mit Soloalben anfangen, die Band kontinuierlich wieder weiter nach unten zu ziehen....</P> 

<p>Trotz alledem: &quot;We have got the power - we are divine. We have the Guts to follow the sign!&quot;</P>

<p>Pumpkin Metal Rulez!!</P>




<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
