<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Metal Corner</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">

<p><h1><center><font color="green">Gamma Ray &amp; Sonata Arctica &amp; Vanishing Point</font></Center></h1></P>

<p>Wie schon auf der Tour zum letzten Gamma Ray Album &quot;Powerplant&quot; fand auch der Startschuss zur neuen &quot;No Order World Tour&quot; in der Bochumer Zeche statt. Sicherlich nicht das schlechteste, sind die Bands zu diesem fr&#252;hen Zeitpunkt noch absolut toppfit und Erm&#252;dungserscheinungen gibt es auch noch keine. Gut gef&#252;llt war die Zeche an diesem Donnerstag Abend ebenfalls, womit man also insgesamt von guten Bedingungen f&#252;r einen tollen Abend sprechen konnte.</P>

<p>Den Opener Vanishing Point habe ich zwar leider verpasst, aber rechtzeitig zu den finnischen Senkrechtstartern von Sonata Arctica war ich in der Zeche und die sympathische Band zeigte sich wie schon in Wacken von ihrer besten Seite. Die Setlist bestand erwartungsgem&#228;&#223; &#252;berwiegend aus Material des aktuellen Albums &quot;Silence&quot; (&quot;Weballergy&quot;, &quot;Black Sheep&quot;, &quot;Wolf And Raven&quot;, &quot;False News Travel Fast&quot;), aber mit dem &#220;berhammer &quot;Kingdom Of A Heart&quot; und &quot;My Land&quot; kamen auch zwei Nummern vom Debutalbum zum Zuge, die prima in die Setlist passten und beim Publikum dementsprechend gut ankamen. Lediglich der Sound war etwas bescheiden (vom Keyboard war fast nix zu h&#246;ren), was der insgesamt guten Stimmung aber keinen Abbruch antun konnte. Sonata Arctica haben defintiv eine gro&#223;e Zukunft vor sich und wenn die Karriere der Jungs weiterhin so rasant verl&#228;uft, d&#252;rfen wir die Combo nach dem n&#228;chsten Album 
vielleicht schon auf Headlinertour begr&#252;&#223;en...</P>

<p>Und nach einer erfreulich kurzen Umbaupause war es dann soweit: Gamma Ray betraten die Bretter und er&#246;ffneten ihren Set mit dem Intro &quot;Induction&quot; sowie &quot;Deathrone Tyranny&quot; vom aktuellen Longplayer. Erwartunsggem&#228;&#223; kochte die Stimmung, wobei sich wahrscheinlich nicht wenige verwundert die Augen gerieben haben d&#252;rften, wer denn an diesem Abend der Bassist bei Gamma Ray ist: Da der etatm&#228;&#223;ige Gamma Ray Bassist Dirk Schl&#228;chter immer noch im Krankenha
us verweilt, ist kurzerhand Kai Hansens alter Helloween Bandkumpel Markus Grosskopf eingesprungen und machte seine Arbeit an diesem Abend auch wirklich ganz hervorragend - zumindest ich h&#228;tte damit eigentlich nicht gerechnet (bleibt nur zu hoffen, dass Herr Hansen nicht auf die Idee kommt, im Gegenzug auch bei Helloween an der Gitarrenfront auszuhelfen). Unterst&#252;tzt wurden Gamma Ray an den Keyboards zudem von Vanishing Front Tastenmann. Nachdem Gamma Ray also mit dem Opener schonmal routinem&#228;&#223;ig gestartet sind, lie&#223;en sie mit &quot;New World Order&quot; und &quot;Follow Me&quot; zwei weitere neue St&#252;cke folgen, die von den Fans dankbar aufgenommen wurden. Im Anschluss daran ging es dann kreuz und quer durch die Gamma History und mit &quot;Man On A Mission&quot;, &quot;Rebellion In Dreamland&quot;, &quot;Land Of The Free&quot;, &quot;Valley Of The Kings&quot;, &quot;Somewhere Out In Space&quot; und &quot;Short As Hell&quot; wurden zumindest alle Gamma Ray Alben seit 1995 in die 
Setlist mit aufgenommen, auch wenn ich pers&#246;nlich noch gerne die eine oder andere Powerplant Nummer geh&#246;rt h&#228;tte. Na ja, daf&#252;r gab es mit dem Midtempokracher &quot;Fire Below&quot; und dem starken &quot;Eagle&quot; noch zwei weitere Tracks vom neuen Album zu h&#246;ren, auch wenn ich mir nicht erkl&#228;ren kann, warum das supereing&#228;ngige und f&#252;r Live Konzerte geradezu geschaffene &quot;Heaven Or Hell&quot; nicht in der Setlist auftauchte. Ebenso verwunderte mich ein wenig, dass - ausser einer geilen Lightshow und eines transparenten, mit verschiedenen Farben durchleuchteten Gamma Ray Logo - auf Special Effects wie Pyros komplett verzichtet wurde. Na ja, man kann eben nicht alles haben und die Band machte das locker durch absolute Spielfreude und lustigen Ansagen (&quot;Was ist stachelig und kann nicht fliegen? Genau ein Igel / &quot;Eagle&quot;) trotzdem wieder wett, zumal Gamma Ray bodenst&#228;ndig und sympthisch r&#252;berkam wie eh und je. Da verzeit man auch schonmal 
kleine Pannen wie das vertauschen des n&#228;chsten Songs (&quot;So, jetzt kommt &quot;Valley Of The Kings&quot;....ups, nee, erst &quot;Rebellion In Dreamland&quot;). Als kr&#246;nenden Abschluss des Gigs gab es dann sogar noch eine supergeile Version von &quot;Heading For Tomorrow&quot; und nat&#252;rlich den Helloween Smasher &quot;Ride The Sky&quot;, wobei wohl niemand gedacht h&#228;tte, dass Kai Hansen und Markus Grosskopf diesen Klassiker nochmal zusammen runterzocken w&#252;rden. Insgesamt war es also ein ohne Frage geiler Gig einer b&#228;renstarken Band, die eigentlich &#252;berall wo sie auftritt abr&#228;umt. Nicht anders war es an diesem Abend und wer nicht da war, hat sicherlich einen der st&#228;rksten Club Gigs in diesem Jahr verpasst.</P>

<p><u>Setlist Gamma Ray (Reihenfolge nicht ganz korrekt...)</u></P>

<p>1. Induction<BR>
2. Deathrone Tyranny<BR>
3. New World Order<BR>
4. Follow Me<BR>
5. Short As Hell<BR>
6. Land Of The Free<BR>
7. Rebellion in Dreamland<BR>
8. Valley Of The Kings<BR>
9. Fire Below<BR>
10. Man On A Mission<BR>
11. Eagle<BR>
12. Somewhere Out In Space<BR>
13. Heading For Tomorrow<BR>
14. Ride The Sky</P>



<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
