<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="red">Newsflash</font></center></h1></P><ul>

<p><li>Zu <b>Helloween</B> gibt es in dieser Ausgabe auch zum ersten mal in der Geschichte der Metal Corner eine kleine Glosse, in der ich direkt nach der Meldung &#252;ber die neue Situation spekuliert habe - deswegen ist der Text auch nicht mehr auf dem neuesten Stand. Die offizielle Presseerkl&#228;rung besagt dann auch erwartunsggem&#228;&#223;, dass sowohl Uli Kusch und Roland Grapow nur gefeuert wurden, weil sie zu viele externe Aktivit&#228;ten am laufen hatten. Offenbar hatten die verbleibenden drei K&#252;rbisk&#246;pfe erkannt, dass es nur aufw&#228;rts gehen kann, wenn alle sich zu 100 % auf die Band konzentrieren. Momentan werden neue Gitarristen und Drummer getestet und bald sollen auch erste Namen fallen...</LI></P>

<p><li>Derweil arbeiten die beiden ex-K&#252;rbisk&#246;pfe <b>Uli Kusch</B> und <b>Roland Grapow</B> an der Projektscheibe mit Symphony X S&#228;nger Russell Allen, wobei aus dem Projekt auch eine eigenst&#228;ndige Band werden k&#246;nnte. Unter Anleitung von Roy Z (u.a. Dickinson, Halford und Helloween) wird derweil das Songmaterial zusammengestellt und bereits im November soll selbiges auch eingespielt werden - da sind wir ja mal gespannt, ob es sich f&#252;r beide gelohnt hat, daf&#252;r Helloween zu verlassen.</LI></P>

<p><li><b>Running Wild</B> haben wohl mit Peter Pichel einen neuen Bassisten an Bord, mit dem auch das n&#228;chste Studioalbum &quot;The Brotherhood&quot; aufgenommen werden soll. Ver&#246;ffentlicht werden soll der &quot;Victory&quot; Nachfolger Anfang kommenden Jahres. </LI></P>

<p><li><b>Virgin Steele</B> sind endlich der Bitte der Fans nachgekommen und werden bald - p&#252;nktlich zum 20 j&#228;hrigen Bandjubil&#228;um - die besten Songs der beiden ersten Virgin Steele Alben &quot;Virgin Steele I&quot; und &quot;Guardians Of The Flame&quot; erstmals offiziell auf CD ver&#246;ffentlichen - inkl. einiger Bonustracks. Parallel dazu wird auch eine Best Of eben dieser Band mit dem treffenden Titel &quot;Hymns To Victory&quot; erscheinen, die diverse Songs in neu aufgenommenen und neu arrangierten Versionen enthalten soll. Das ganze wird aber nicht wie angek&#252;ndigt im Oktober, sondern erst im Januar erscheinen.</LI></P>

<p><li>Die sympathischen Hanseaten von <b>Gamma Ray</B> planen, auf der aktuellen Tour gen&#252;gend Material f&#252;r eine geplante DVD mitzuschneiden, auf der dann nat&#252;rlich auch &#228;lteres Material zu finden sein wird. Desweiteren wird sp&#228;testens nach dem n&#228;chsten Album auch wieder eine offizielle Live CD folgen. </LI></P>

<p><li>  Neue Besen kehren bekanntlich gut, alte noch besser - haben sich wohl auch <b>Angel Dust</B> gedacht und mit Drummer Dirk Assmuth ein Originalmitglied zur&#252;ck in die Band geholt, nachdem der bisherige Drummer Michael Sticken die Band aus freien St&#252;cken - genau wie vor wenigen Wochen schon Gitarrist Bernd Aufermann - verlassen hat. Die Aufnahmen zum n&#228;chsten Longplayer &quot;Of Human Bondage&quot; sind bereits seid August angelaufen und wenn man sich so die letzten Releases dieser Band anguckt, braucht man sich um die musikalische Klasse eigentlich keine Gedanken machen.</LI></P>

<p><li> Kurzer Nachschlag zum neuen <b>Freedom Call</B> Gitarristen <b>Cedric Dupont</B> (siehe letzte Ausgabe): Dieser wird auch weiterhin bei Symphorce t&#228;tig sein, derren neues Album f&#252;r April / Mai angesetzt ist - allerdings stehen die Jungs momentan ohne Deal dar, nachdem die Zusammenarbeit mit Noise wohl nicht so gut gelaufen war. Na ja, d&#252;rfte f&#252;r die Band aber ein leichtes sein, nach dem hervorragenden &quot;Sinctuary&quot; Album einen neuen Deal einzufahren.</LI></P>

<p><li>Ein unglaubliches Tempo legen <b>At Vance</B> an den Tag, die im letzten Fr&#252;hjhar noch die gutklassige Scheibe &quot;Dragonchaser&quot; vorgelegt hatten, im Januar / Februar aber mit &quot;Only Human&quot; bereits das vierte Geschoss auf die Metal Community loslassen wollen. Das die Jungs zwischendurch mal eben bei einer neuen Plattenfirma - das aufstrebende Label AFM Records machte das Rennen um die Jungs - unterschrieben haben, d&#252;rfte f&#252;r die Fans wohl nur vom sekund&#228;ren Interesse sein...</LI></P>

<p><li>Die NWOBHM Veteranen <b>Holocaust</B> (einigen vielleicht auch von der Gamma Ray Coverversion Heavy Metal Mania bekannt) werkeln momentan an einer Comeback Platte, die mit &quot;Primal&quot; betitelt wird. Bleibt nur zu hoffen, dass es die Jungs immer noch drauf haben und nicht so enden, wie die eine oder andere verkorkste Reunion (Metal Church, Tygers Of Pan Tang...).</LI></P>

<p><li> Nach der Demolition Tour will Judas Priest Gitarrist <b>Glenn Tipton</B> an einem weiteren Sologeschoss arbeiten. H&#228;tte er sich das nicht vor dem schwachen Album &quot;Demolition&quot; &#252;berlegen k&#246;nnen und all das moderne Zeug auf seine eigene Platte packen k&#246;nnen? Immerhin h&#228;tte er damit nach &quot;Jugulator&quot; der Karriere von Judas Priest nicht einen weiteren Schwachpunkt hinzugef&#252;gt.</LI></P>

<p><li><b>Metalium</B> wollen offensichtlich kein Jahr ohne neues Release verstreichen lassen: Nach nunmehr zwei Studioalben, soll im November unter dem Titel &quot;Metalin Attack Live&quot; sowohl eine Live CD als auch Video / DVD erscheinen. Inwiefern es sinnvoll ist, schon nach der zweiten Platte ein Live Album folgenzu lassen, sie mal dahingestellt.</LI></P>

<p><li>Im Januar erscheint das neue <b>Squealer</B> Album &quot;Under The Cross&quot; auf dem erneut Schlagzeuger Mike Terrana zu h&#246;ren seind wird. Veredelt wird der neue Squealer Longplayer sowohl von Tommy Newton (Pretty Maids, Helloween) als auch Andy Sneap (Nevermore, Testament, Kreator, Blaze). Die Songs sollen deutlich straighter r&#252;berkommen als noch auf dem (meiner Meinung nach superben) Vorg&#228;nger &quot;Made For Eternity&quot;. Ich bin schon m&#228;chtig gespannt auf die Scheibe!</LI></P>
       

<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
