<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Vorwort</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><b>Hi Metalheads!</B><br>
Der vergangene Monat war wohl einer der schw&#228;rzesten der letzten Jahre - die Ereignisse in Amerika haben wohl uns alle irgendwo schokiert. Ich m&#246;chte mich an dieser Stelle auch nicht in die Reihe der langen Liste von &quot;Traueraktionen&quot; eintragen, sonder gehe mal davon aus, dass jeder halbwegs intellig
ente Mensch das einordnen kann, was dort passiert ist. Insofern macht es aus meiner Sicht keinen Sinn, an dieser Stelle eine Abhandlung &#252;ber das Geschehene zu schreiben. Ich m&#246;chte halt nur nicht direkt zur Tagesordnung &#252;bergehen, sonder stelle dieser ein kurzes, aber treffendes Zitat eines Songs von Running Wild vorraus (&quot;Demonized&quot;):</P>

<p><i>&quot;The Hell Of War That Rages On, The Law Of Hate That`s Everywhere, Falling Bombs A Billion Tons, Plunge The World Into Despair&quot;</I></P>

<p>Wer das ganze Konzept dieser Triologie kennt, der kann diesen (eigentlich oberfl&#228;chlichen und simpelen Spruch) sicherlich besser einordnen und wird verstehen, dass die (grausamen) Attentate auf Amerika f&#252;r sich genommen ziemlich schlimm und frustrierend sind, man aber auch den (bisher eher stiefm&#252;tt
erlich behandelten) Terror auf der ganzen Welt nicht vergessen darf, gegen den man bisher nichts oder nur wenig getan hat.... selbst in solchen Zeiten darf man den Blick &#252;ber den Tellerrand nicht vergessen und bedenken, dass es &#228;hnlich grausam in anderen L&#228;ndern zugeht - nur in ganz anderen Bereichen....</P>

<p>Und wer die Running Wild Triologie kennt, den verweise ich an dieser Stelle auf &quot;Victory&quot;.</P>

<p>So, viel mehr m&#246;chte ich an dieser Stelle eigentlich auch nicht mehr sagen. Viel Spa&#223; auf jeden Fall mit der vorliegenden Ausgabe der Metal Corner und bis demn&#228;chst,</P>

<p>Kilian<blink> &quot;The Bruce&quot;</blink> Servais</P>


<p>P.S.: Zum ersten mal in der Geschichte der Metal Corner befindet sich ein Kommentar in Form einer kleinen Abhandlung von mir (&#252;ber den Helloween Split) darin. Dieser wurde noch vor der offiziellen Presseerkl&#228;rung geschrieben und ist vielleicht f&#252;r den einen oder anderen ganz nett zu lesen - &#252;ber Feedback diesbezgl. w&#252;rde ich mich nat&#252;rlich freuen.</P>







<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
