<HTML>
<HEAD><TITLE>Forum</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0405.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0407.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>Forum</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H3>6. Leserbrief zur Situation und Zukunft des AMIGAs (von M. Zwerschke)</H3>
<P>
»Die neue Amiga aktuell liegt mir vor, und ich m&ouml;chte meinen Senf dazu
geben.
<P>
<B>Erstens (Situation Amiga)</B>
<P>
Die gegenw&auml;rtigen Irritationen bei G2000 und der Amiga-Gemeinde liegen
eigentlich in einem einfachen Fakt begr&uuml;ndet. Amiga International hat nach
wie vor  k e i n  tragf&auml;higes von der Mutterfirma abgesegnetes Konzept
f&uuml;r einen generellen Neuanfang. Nur so lassen sich die widerspr&uuml;chlichen
Aussagen von Petro T. begr&uuml;nden. Die Monate verrinnen, und noch ist man
sich nicht mal &uuml;ber den Prozessor der Zukunft einig, redet von 200 MHz,
wo man in anderen Bereichen die 1000er anpeilt und 400 bereits vor einem
Jahr erreichte (Intel Alpha). Immer mehr Softwarefirmen legen Ihre Amiga-
Projekte auf Eis (Vulcan, Maxon, SoftWood).
Ich kann Michael Kramer leider nur zustimmen, was seine momentane
Einsch&auml;tzung der Lage betrifft. Insofern habe ich heute nur noch wenig
Hoffnung, was die Aufmischung des Marktes betrifft.
Es kann nur eine L&ouml;sung geben. Der neue Amiga im Jahr 1999 kostet nicht
mehr als 4000.- DM, er hat einen 500 MHz-RISC-Prozessor mit 64 Bit
Bandbreite auf alle Ports und Bausteine, DVD-Schreib/Leselaufwerk, 10GB-
Festplatte, UltraWideSCSI, ISDN integriert, Videoeingang f&uuml;r Bildtelefon,
Videocapturecart mit Audiodigitizer onboard, Emulatoren f&uuml;r PSX,
Modulschacht und Emulator f&uuml;r N64, sowie Workbench 4.0, Softwarepaket mit
24Bit-Malprogramm, Viedeoschnitt- und Gestaltung, Schreibprogramm mit
Browser und HTML/Javascriptf&auml;higem Editor.
Wenn hier einer sagt: "Der spinnt!" Vielleicht - aber fragt Euch mal, wie
weit in zwei Jahren ein PC f&uuml;r diesen Preis ist.
(Wieso zwei Jahre ? 1998 und 1999 sind zwei Jahre.)
<P>
<B>Zweitens (Spiele)</B>
<P>
OnEscape ist sicher kein schlechtes Spiel, doch wer heute nur spielen
will, kauft sich nicht f&uuml;r 1500.- DM eine PowerUp-Karte und f&uuml;r 300.- DM
ein CD-ROM-Laufwerk mit SCSI-Karte, sondern f&uuml;r 300.- DM 'ne PSX oder N64.
Man kann einfach nicht den heutigen Markt mit der guten alten Zeit von
damals vergleichen. Damals war die einzige M&ouml;glichkeit, Computerspiele zu
nutzen, ein C64 oder A500. Den Amiga als Spielecomputer wiederzubeleben
scheint mir verlorene Zeit. Man braucht ein System, das dem PC bei
gleichem Preis &uuml;berlegen ist, erst dann kann man auch wieder Spiele
anbieten. Wie viele PowerUp-Karten wurden bis jetzt eigentlich verkauft 100
oder 1000 ? Interessant wird das ganze doch erst ab einer Million. Vorher
steigt kein gro&szlig;er Spielehersteller mehr ein.
<P>
<B>Drittens ("AmigaMagazin")</B>
<P>
Wer die Sache beim C64er verfolgt hat, wu&szlig;te beim "AmigaMagazin" Bescheid.
Es geht nur darum, einige Leute f&uuml;r PCgo! zu werben. Man kann aber den
Redakteuren keinen Vorwurf machen, da&szlig; sie loyal zu Ihrem Br&ouml;tchengeber
sind - wessen Brot ich ess, dessen Lied ich pfeif. Das war schon immer
so.
<P>
Auch wenn dies alles recht pessimistisch klingt, bin ich kein Amiga-Feind.
Doch geh&ouml;rt eine ehrliche wahre Analyse einfach dazu, um zu wissen, wo
man wirklich steht. Uns helfen keine Wunschtr&auml;ume und Utopien, sondern
nur reale Ans&auml;tze, und die sehen trotz aller W&uuml;nsche nicht sehr gut aus.
Ein paar Schwalben machen eben noch keinen Fr&uuml;hling, auch wenn wir uns
dies alle sehr w&uuml;nschen. In diesem Sinne bleibt kritisch, wenn Petro
Tyschtschenko wieder mal seine &Uuml;berraschungsversprechungskiste &ouml;ffnet.«
<P>

</BODY>
</HTML>
