<HTML>
<HEAD><TITLE>Workshops / Hintergrundberichte</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0410.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0501.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>Workshops / Hintergrundberichte</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H3>1. Generationswechsel: SCSI goes Ultra-Wide (von Marko Koscak)</H3>
<P>
Sp&auml;testens seit Phase 5 seine Turbokartenserie CyberStormPPC mit einem
Ultra-Wide-SCSI-Controller ausgestattet hat, ist dieses Thema nun auch f&uuml;r
uns Amiga-Besitzer interessant geworden. Was mu&szlig; man beachten, wenn man von
SCSI auf Ultra-Wide-SCSI umsteigen will oder mu&szlig;? Laufen noch meine "alten"
Festplatten, CD-Rom-Laufwerke und Scanner? Lohnt es noch, neben dem neuen
SCSI-Controller auch den alten weiter laufen zu lassen?  Grund genug, um
sich mal etwas n&auml;her mit der Materie zu befassen.
<P>
Das SCSI-Bus-System ist bereits vielen Amiga-Anwendern vertraut, und es
wird nicht nur f&uuml;r den Anschlu&szlig; von CD-Brennern und Scannern verwendet. In
den meisten Amigas tun SCSI-Festplatten ihre Arbeit, so selbstverst&auml;ndlich,
wie in den PCs IDE-Platten. Das mag daran liegen, da&szlig; viele Turbokarten f&uuml;r
den Amiga eine Option f&uuml;r einen SCSI-Controller bieten. Deshalb war die
Entscheidung f&uuml;r eine SCSI-Platte f&uuml;r viele auch naheliegend.
So, nun soll also eine neue Turbokarte in den Rechner. Die alte fliegt
'raus, samt des Controllers, und man steht pl&ouml;tzlich vor dem Problem, da&szlig;
der neue SCSI-Hostadapter einen ganz anderen Stecker hat, auf welches das
alte 50-polige Flachbandkabel nicht mehr pa&szlig;t. Dieses ist bis jetzt erst
bei der CyberStormPPC und MK 3 der Fall.
<P>
Was ist nun genau der Unterschied zwischen dem &auml;lteren Fast-SCSI- und dem
Ultra-Wide-SCSI-Standard?
Rein &auml;u&szlig;erlich f&auml;llt zun&auml;chst der kleinere Stecker auf. Wer sich die M&uuml;he
macht und die kleinen Pins abz&auml;hlt, kommt zu dem Schlu&szlig;, da&szlig; sich die
Pinanzahl von 50 auf 68 erh&ouml;ht hat. D. h. mehr auf weniger Raum. Dies macht
es notwendig, da&szlig; die Flachbandkabel anders ausgelegt werden. Dazu sp&auml;ter
mehr.
Technisch hat sich auch einiges ge&auml;ndert. Der Datenbus ist von 8 auf 16 Bit
gewachsen. Dies verdoppelt die Datenrate, die &uuml;ber den Bus geschickt werden
kann. Zus&auml;tzlich wurde das Timing halbiert, womit die Datenrate nochmal
verdoppelt wird. Insgesamt bedeutet das, da&szlig; dieser Hostadapter bis zu 40
MByte/s &uuml;ber seinen Bus scheuchen kann, im Gegensatz zu den max. 10 MByte
eines Fast-SCSI-Controllers. Allerdings beschr&auml;nken die steileren
Signalflanken und das verk&uuml;rzte Timing die L&auml;nge des SCSI-Kabels. M&ouml;chte
man mehr als vier Ger&auml;te (Hostadapter mit drei Devices) an den Strang
klemmen, ist die SCSI-Kabell&auml;nge auf 1,5 Meter begrenzt, ansonsten sind
drei Meter zugelassen. Bei Fast-SCSI sind im "synchronous mode" 3 Meter und
im "asynchronous mode" 6 Meter erlaubt. Die Anzahl der anschlie&szlig;baren
Ger&auml;te bleibt auf sieben beschr&auml;nkt, obwohl die Hostadapter-Elektronik
theoretisch 15 Ger&auml;te ansteuern k&ouml;nnte. Aufgrund der auftretenden
Reflexionen bei neun und mehr SCSI-Einheiten ist kein st&ouml;rungsfreier
Betrieb m&ouml;glich.
Insgesamt sind das doch sch&ouml;ne Aussichten. Man kann leicht erkennen, da&szlig;
Phase 5, als derzeit einziger Anbieter dieser Technologie, dem Amiga
professionelle Leistungsstandards zug&auml;nglich machen m&ouml;chte.
<P>
Werden wir Amiga-User heute dieses Potential, das in dem Ultra-Wide-
Controller steckt, auch wirklich voll aussch&ouml;pfen k&ouml;nnen?
Ich glaube eher nicht. Der Otto-Normal-User hat ein oder zwei Festplatten,
CD-ROM und vielleicht einen CD-Brenner oder einen Scanner. Selbst die etwas
exotischeren Ger&auml;te, wie Zip-Drives, nutzen bei weitem nicht die Bandbreite
von Ultra-Wide-SCSI aus. Ein 32x-CD-ROM schaft "nur" gem&auml;chliche 4,8
MByte/s, und auch die durchaus schnelle 4-GByte-Festplatte von IBM, die
DCAS 34330, bringt einen Spitzenwert von ca. 8 MByte/s. Erst im absoluten
Profilager kann man dieses enorme Potential ausnutzten. Sogenannte Solid-
State-Disks, das sind "Festplatten" aus reinem RAM, oder Harddisk-Arrays,
quasi im Multiplex-Betrieb laufende Festplattenverb&auml;nde, bei denen sich die
einzelnen Spitzentransferwerte addieren, k&ouml;nnen die 40 MByte-Grenze
erreichen und auch &uuml;berschreiten. Wieviel solche Anlagen kosten, kann sich
jeder selbst ausrechnen. Hier stecken also noch "gen&uuml;gend" Reserven f&uuml;r die
n&auml;chsten Jahre.
<P>
Wie kompatibel sind die verschiedenen SCSI-Ger&auml;te-Generationen?
Das gesamte SCSI-System ist durchgehend abw&auml;rts- sowie
aufw&auml;rtskompatibel(!). Bis auf manche, sehr alte, Festplatten laufen alle
&auml;lteren Ger&auml;te anstandslos an einem U-W-Hostadapter. Dabei bremsen sie
nicht die schnelleren am Bus h&auml;ngenden Ger&auml;te aus, wie es bei dem IDE-Bus-
System prinzipiell der Fall ist.
Neue U-W-Platten laufen auch noch unter einem normalen SCSI-Controller,
wobei sie, wenn sie nicht h&ouml;here Datentransferraten als der Controller
besitzen, mit voller Geschwindigkeit arbeiten k&ouml;nnen. Um eine Verbindung
zwischen Fast-SCSI-Ger&auml;ten und einem Ultra-Wide-Bussystem zu erhalten, gibt
es spezielle Adapterstecker, die sich Wide-to-Narrow-Adapter nennen. Diese
steckt man auf die Buchsen der Festplatten, und auf diese dann das U-W-
Kabel. Die Adapter gibt es auch f&uuml;r den umgekehrten Fall, wenn man eine U-
W-Platte an einem Fast-SCSI-Strang anklemmen m&ouml;chte. Hier mu&szlig; man beim Kauf
des Steckers darauf achten, f&uuml;r welchen Fall er ausgelegt sein soll.
Leider ist die Sache mit den Adaptern nicht gerade billig. Etwa 30-50 DM
mu&szlig; man schon f&uuml;r einen Stecker hinbl&auml;ttern. Aber Vorsicht, man mu&szlig; schon
etwas suchen, bis man einen H&auml;ndler findet, der einem die Adapterstecker
besorgen kann. Wer allerdings heute eine gro&szlig;e und schnelle Festplatte
sucht und (noch) keinen U-W-Controller besitzt, sollte sich eine U-W-
Festplatte aussuchen und das Geld f&uuml;r einen Adapter auch noch
zusammenkratzen, weil die U-W-Modelle kaum mehr kosten und dar&uuml;ber hinaus
mit der neuen Controller-Elektronik schneller sind. Sp&auml;ter beim Umstieg hat
man dann keine Anschlu&szlig;probleme.
<P>
Prinzipiell schlie&szlig;t man alle SCSI-Ger&auml;te mittels der erh&auml;ltlichen Adapter
an den U-W-Controller an. Das U-W-SCSI-Kabel l&auml;&szlig;t schon beim ersten Anblick
vermuten, da&szlig; man nicht mehr so einfach zus&auml;tzliche Stecker aufquetschen
kann. Die sehr viel feineren Leitungen und Stecker ben&ouml;tigen spezielle
Quetschwerkzeuge, wenn man eine saubere Verbindung herstellen will. Und
au&szlig;erdem ist es &auml;rgerlich, wenn man ein neues teures Kabel kaufen mu&szlig;.
Durch einen schief aufgesetzten Stecker k&ouml;nnen eine oder mehrere Leitungen
durchtrennt werden. Dann kann man es vergessen, das Kabel noch repariert zu
bekommen. Denn dicke L&ouml;ttropfen k&ouml;nnen zu Reflexionen f&uuml;hren und die
schnelle Daten&uuml;bertragung beeintr&auml;chtigen. Am besten, man kauft sich schon
zu Anfang ein Kabel mit f&uuml;nf oder mehr Steckern. Daf&uuml;r mu&szlig; man allerdings
schon 50-70 DM einkalkulieren. Noch teurer wird es, wenn man externe Ger&auml;te
anschlie&szlig;en m&ouml;chte. Die steileren Signalflanken und das verk&uuml;rzte Timing
des U-W-Busses erfordern speziell abgeschirmte Kabel, selbst dann, wenn man
nur normale Fast-SCSI-Devices anschlie&szlig;en m&ouml;chte. Externe U-W-Kabel erkennt
man daran, da&szlig; sie einen Durchmesser zwischen 1,5 und 2 cm haben und etwas
&uuml;ber 70 DM kosten. Auf die L&auml;nge sollte man auch achten, denn es gilt:
internes + externes Kabel = Gesamtl&auml;nge.
Bei der Terminierung eines U-W-SCSI-Busses mu&szlig; man leider auch einige
Besonderheiten beachten. Es mu&szlig; sichergestellt sein, da&szlig; beide Enden
richtig abgeschlossen werden. D. h. es m&uuml;ssen auch zus&auml;tzlich die oberen 8
Datenleitungen (DB 8 - 15) und die Parity1-Leitung terminiert werden. Wenn
nur U-W-Ger&auml;te an den Bus angeschlossen werden, hat man diesbez&uuml;glich keine
Probleme. In diesem Fall terminieren die beiden Endger&auml;te den U-W-Bus.
Anders sieht es aber aus, wenn man Fast-SCSI-Ger&auml;te anschlie&szlig;t. Diese
k&ouml;nnen n&auml;mlich nicht einen U-W-Bus ordnungsgem&auml;&szlig; terminieren, weil sie nur
den 8Bit-Bus abschlie&szlig;en und von den &uuml;brigen 8 Datenleitungen nichts
"wissen"! Die oberen 8 Bit werden also offengelassen, und das ist verboten.
Fast-SCSI-Ger&auml;te mu&szlig; man also an den mittleren Steckern des Kabels
anschlie&szlig;en. Wenn man nur Fast-SCSI-Ger&auml;te besitzt, mu&szlig; man sich (16Bit-)
Terminatoren kaufen und mit diesen den Bus abschlie&szlig;en. Diese m&uuml;ssen
"aktiv" arbeiten (passive Terminatoren gen&uuml;gen also nicht), weil der
modernere und schnellere U-W-Bus dies erfordert. Aktive Terminatoren f&uuml;r U-
W-SCSI kosten zwischen 60 und 100 DM.
Problematisch wird es bei externen (8Bit-) Fast-SCSI-Ger&auml;ten. Sie haben
zwar immer einen durchgeschliffenen Bus, so da&szlig; man denken k&ouml;nnte, man mu&szlig;
nur einen 16Bit-Terminator ans Ende anschlie&szlig;en. Allerdings sind nur die
unteren 8 Datenleitungen durchgeschliffen, so da&szlig; ein U-W-Terminator nichts
bringt.
<P>
Besitzt man nun eine CyberStormPPC oder MK 3, hat sich mit dem Wechsel der
Turbokarte auch der SCSI-Hostadapter ge&auml;ndert. Wenn man einen Amiga 3000,
eine Zorro-SCSI-Karte oder das Busboard Z3 der Firma MicroniK sein Eigen
nennt, kann man auf diese alternativen Fast-SCSI-Controller ausweichen,
wenn man nicht noch zus&auml;tzlich Geld f&uuml;r Kabel, Adapter und Terminatoren
ausgeben will.
Falls man externe Ger&auml;te betreiben will, sollte man unbedingt, wenn
m&ouml;glich, auf Fast-SCSI-Controller ausweichen. Man spart dadurch nicht nur
Geld, sondern auch Nerven, wenn es um die Terminierung der Ger&auml;te geht. F&uuml;r
alle anderen (vorwiegend Amiga 4000-) Benutzer gibt es diese Alternative
nicht. Hier mu&szlig; man sich &uuml;berlegen, was der bessere Kompromi&szlig; ist, wenn man
noch keine U-W-Ger&auml;te besitzt: eine neue U-W-Festplatte und ein 16Bit-
Terminator oder zwei 16Bit-Terminatoren kaufen. Des weiteren sollte man
darauf bestehen, da&szlig; der H&auml;ndler ein U-W-Kabel kostenlos oder billiger
beilegt. Ansonsten mu&szlig; man es auch noch zus&auml;tzlich kaufen.
Die &auml;lteren 8Bit-Ger&auml;te schlie&szlig;t man dann, wie erw&auml;hnt, zwischen den beiden
16Bit-Endger&auml;ten an. Der U-W-SCSI-Hostadapter, der auf den CyberStormPPC-
und MK3-Turbokarten seinen Dienst verrichtet, kann den SCSI-Bus nicht
terminieren. Deshalb mu&szlig; man mindestens zwei U-W-Ger&auml;te oder Terminatoren
haben.
Um den U-W-Bus auch externen Ger&auml;ten zug&auml;nglich zu machen, braucht man
einen 68-poligen HD-Adapterstecker, den man an der R&uuml;ckwand des Rechners
anbringt und mit einem Ende des U-W-Kabels verbindet. Hierbei mu&szlig; man aber
darauf achten, da&szlig; der externe Bereich immer korrekt terminiert ist. Also
entweder einen aktiven Terminator (als 68-polige HD-Buchse ausgef&uuml;hrt)
aufstecken oder ein terminiertes U-W-Ger&auml;t anschlie&szlig;en.
<P>
Jetzt gibt es nur noch ein Problem: Was macht man, wenn man externe (8Bit-)
Fast-SCSI-Ger&auml;te an den (16Bit-) U-W-Bus anschlie&szlig;en mu&szlig;, weil man keinen
zweiten (einfachen) SCSI-Hostadapter besitzt?
Hier mu&szlig; man sich Terminatoren in Sonderanfertigung bedienen. Sie m&uuml;ssen
die oberen 8 Datenleitungen (DB 8 - 15) und die Parity1-Leitung terminieren
und alle anderen Leitungen durchschleifen. Wo es diese Adapter zu kaufen
gibt und wieviel sie kosten, kann ich nicht sagen. Theoretisch kann man sie
auch selbst basteln. Aber sicherer w&auml;re es, das einem Fachmann zu
&uuml;berlassen. Vielleicht nimmt Phase 5 diese Adapter mit in sein Sortiment
auf?
<P>
Fazit: Mit dem Ultra-Wide-SCSI-Controller findet der Amiga auch in diesem
Bereich wieder zur&uuml;ck zur Spitze. Wenn man einige Regeln beachtet, l&auml;uft
das neue System mindestens genauso gut wie vorher. Letztlich werden auch
professionelle Anwender mit der Leistung, die Phase 5 anbietet, zufrieden
sein.
<P>
von Marko Koscak
<P>
(Informationsquelle: c't 2/98, SCSI 1x1)«
<P>

</BODY>
</HTML>
