<HTML>
<HEAD><TITLE>Testberichte</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0502.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0601.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>Testberichte</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H3>1. Hardwaretest: Blizard603e+/200+25MHz (von Achim Akkermann)</H3>
<P>
»Hier meine ersten Erfahrungen mit der PPC 603e+ Karte von P5.
Voranschicken m&ouml;chte ich an alle Amiga-Experten, mir meine teilweise
Unerfahrenheit zu verzeihen. Ich bin ein purer User und kenne mich mit
Programmierung oder Rendern oder was auch immer nicht sonderlich aus. Meine
Lady nutze ich haupts&auml;chlich zum Tippen (WW6) und f&uuml;r´s Internet.
Trotzdem m&ouml;chte ich hier meine Eindr&uuml;cke wiedergeben, auch wenn ich nicht
zu allen Facts Auskunft geben kann.
<P>
Da liegt sie nun endlich vor mir, die 603e+, mit der "zarten" Seriennummer
005. Heute, am 06.03.98 ist sie endlich bei mir angekommen. Ich wei&szlig; gar
nicht mehr, wie lange ich darauf gewartet habe, eigentlich schon seit ich
den ersten Prototypen auf der Computer '97 gesehen habe.
<P>
Die Karte mit dem PPC200 in Verbindung mit dem 040/25er mit FPU erschien
mir f&uuml;r meine Zwecke vom Preis-/ Leistungsverh&auml;ltnis her am
interessantesten. Gern h&auml;tte ich auch dieselbe Karte mit 060/50er gekauft,
aber DM 999,-- war f&uuml;r mich die absolute Schmerzgrenze. Meine "alte" 1230-
IV habe ich &uuml;brigens nicht "gePower-up´t" (h&auml;tte mir DM 100,-- gebracht),
sondern f&uuml;r 130,-- DM an einen anderen User verkauft...
<P>
Der erste Eindruck ist sehr gut. Das Paket besteht aus der Turbokarte, zwei
Disks, einer CD-ROM und einem Manual. Die Karte ist, wie von P5 gewohnt,
absolut sauber verarbeitet. Den PPC kann man allerdings nicht richtig
sehen, denn ein gro&szlig;er K&uuml;hlk&ouml;rper mit Ventilator verdeckt ihn. Der 040/25
kommt ohne solchen "Schnickschnack" aus. Auf der R&uuml;ckseite befinden sich
die angek&uuml;ndigten zwei RAM-B&auml;nke (autokonfigurierend) f&uuml;r SIMMs oder EDOs
bis maximal insgesamt 128MB, laut Anleitung ist &uuml;brigens auch
Mischbest&uuml;ckung m&ouml;glich. Ohne mindestens ein SIMM oder EDO l&auml;uft die PPC
603e(+) nicht (aber wer hat bei den heutigen RAM-Preisen schon kein
zus&auml;tzliches RAM?).
<BR>
Au&szlig;erdem gibt es nat&uuml;rlich eine akkugepufferte Echtzeituhr und den SCSI-
Anschlu&szlig;, sowie den Port f&uuml;r die Grafikkarte BVisionPPC, die ich bereits
mit Spannung erwarte...
<P>
Der Einbau in meinen Mikronik-Tower verlief ohne Komplikationen. Einfach
Deckel und rechtes Seitenteil ab, und nach ein paar Sekunden steckt die
Karte in ihrem Slot. Zur Zeit betreibe ich sie &uuml;brigens mit einem 16MB-
SIMM, aber bis sp&auml;testens Ende des Jahres werden 2x 32MB EDO-RAM
angeschafft. In einen Standard-Tastatur-A1200 pa&szlig;t die 603e aber auch ohne
Probleme. Der SCSI-Anschlu&szlig; wird dann an dem freien Deckel an der
R&uuml;ckseite herausgef&uuml;hrt.
<P>
Das Booten dauert (zumindest subjektiv) mit der Blizzard 603e+ etwas
l&auml;nger.
<P>
Die Karte l&auml;uft auch ohne Treibersoftware. Soweit ich wei&szlig;, allerdings nur
im 68k-Modus. Damit auch die PowerUp-Programme laufen, mu&szlig; man die Soft von
den Disketten bzw. der CD-ROM installieren. Und die ist anscheinend (wie
von p5 ebenfalls gewohnt) noch nicht so ganz perfekt. Bei mir &auml;u&szlig;ert sich
das folgenderma&szlig;en: Es kann sein, da&szlig; ein Warmstart nicht klappt (blauer
oder hellblauer Bildschirm) oder da&szlig; gebootet wird, aber mein AsimCDFS
nicht gestartet werden kann. Dieses Ph&auml;nomen tritt nur manchmal auf.
Wenn es passiert, hilft nur ein Kaltstart, dann funzt alles ganz normal.
Also ein Bug, der zwar nicht so ganz angenehm ist, aber zu verschmerzen.
Ich hoffe auf Weiterentwicklung der PowerUp-Software.
<P>
Ich habe die Karte bisher zwangsl&auml;ufig fast nur im 68k-Modus betrieben. Im
Vergleich zu meiner 1230-IV ist eine gewisse Geschwindigkeitssteigerung zu
merken. An PowerUP-Software habe ich die ak-Datatypes probiert, und sie
gefallen mir sehr gut. Die Geschwindigkeit des Bildaufbaus ben&ouml;tigt nur
einen Bruchteil der Zeit unter 68k.
<P>
Software gibt's reichlich auf den Disks und der CD-ROM. Die Programme
entsprechen dem Software-Paket, das den 604e-Karten f&uuml;r A3k und A4k
beiliegt. Sofort installiert habe ich das neue CyberGfx f&uuml;r AGA, das nur in
Verbindung mit der PPC-Karte l&auml;uft und u.a. erm&ouml;glicht, mit dem ebenfalls
beiliegenden Software-MPG-Player IsisPPC MPEGs anzuschauen. Mit CyberGfx
AGA dauert das Booten noch ein wenig l&auml;nger. Der Player liefert Filme in
annehmbarer Qualit&auml;t und Geschwindigkeit auch auf "nicht-Graka"-Systemen.
Ich hab mir nat&uuml;rlich gleich das Video aus dem Aminet angeschaut, in dem
Bill Gates eine Torte ins Gesicht bekommt!
<P>
Wenn man CyberGfx AGA installiert hat, kann man leider nicht mehr die
Standard-Bildschirmaufl&ouml;sungen fahren, nur noch die CyberGfx-Modi, die aber
den der WB beiliegenden Modi entsprechen. Welche Vorteile das bringt,
vermag ich nicht zu sagen, irgendwie kommt es mir so vor, als ob der
Bildschirmaufbau unter CGfx schneller ist, das kann aber auch t&auml;uschen.
Wenn ich Mitte des Jahres die BVisionPPC anschaffe, bin ich ja sowieso auf
CGfx angewiesen, so kann ich mich jetzt schon einmal daran gew&ouml;hnen. Ach
ja: CGfx AGA l&auml;uft absolut stabil und vertr&auml;gt sich mit allen Programmen,
die ich benutze. Der einzige Nachteil ist die l&auml;ngere Bootzeit.
<P>
So, mehr f&auml;llt mir f&uuml;rs erste nicht ein. Trotz der oben beschriebenen
kleinen Nachteile bereue ich meinen Kauf nicht und freue mich auf die
BVisionPPC, sowie eine neue Generation von Software und auf die Zukunft des
Amiga.
<P>
Achim Akkermann<BR>
<A HREF="mailto:akkermann@bigfoot.de">akkermann@bigfoot.de</A>«
<P>

</BODY>
</HTML>
