<HTML>
<HEAD><TITLE>Testberichte</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0601.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0700.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>Testberichte</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H3>3. Erfahrungsbericht: A1200-Towergeh&auml;use von Micronik (von Uwe Pannecke)</H3>
<P>
»Der geniale ?! Micronik-Tower
<P>
Vor ein paar Wochen besuchte mich ein Bekannter, der seinem A 1200 ein
gr&ouml;&szlig;eres Geh&auml;use spendieren wollte, um alle im Laufe der Jahre
angesammelten Erweiterungen unterbringen und zuk&uuml;nftige Entwicklungen
m&ouml;glichst nutzen zu k&ouml;nnen. Au&szlig;erdem sollte/wollte ich ihm beim Umbau
helfen.
<P>
Wir diskutierten mehrere Tower-Varianten.
Am Ende fiel die Wahl auf den Micronik-A1200-Tower.
Ausschlaggebend waren die phantastischen Wertungen der einschl&auml;gigen AMIGA-
Magazine. 92% AMIGA Magazin (Gott hab es selig), 98 % (!!!) AMIGA Plus,
"Geniales Konzept" und "beste Tower-L&ouml;sung f&uuml;r den A1200" waren die
Schlagworte in beinahe jedem dieser Testberichte.
Nun, bei diesen Wertungen bleibt schon beim Studieren der Texte kaum ein
Auge trocken.
<P>
Also 'ran ans Telefon und den Tower samt ZorroIII-Board sowie
CyberVision64/3D geordert.
Nach kurzer Zeit stand dann vor dem kleinen A1200 der gro&szlig;e Tower samt
Zubeh&ouml;r. In Null Komma nichts Verpackung entfernt und der Tower nackt vor
uns. Einen Fakt der Testberichte konnten wir schon zu diesem Zeitpunkt
best&auml;tigen: Der Tower sieht schnuckelig aus - ehm, besitzt ein
ansprechendes Design.
<P>
Jetzt gab es nat&uuml;rlich kein Halten mehr - der A1200 sollte alsbald
umziehen. Der Griff nach der Anleitung, einer kleinen Hochglanzbr&ouml;sch&uuml;re
f&uuml;r den Tower und ein fotokopiertes Zettelchen zum ZorroIII-Board, brachte
dann die erste Ern&uuml;chterung.
<P>
Hochglanzpapier f&uuml;r eine Umbauanleitung ist sehr sch&ouml;n.
Eine leere Seite, auf der eigentlich der Anschlu&szlig; des neuen
Tastaturinterfaces an den A1200 beschrieben werden sollte, ist es weniger.
Diese Stelle w&auml;re f&uuml;r einen AMIGA-User ohne Hardwareerfahrung sicher schon
das Ende seiner Umbauversuche.
<P>
Noch besser wurde es, als die Beschreibung des ZorroIII-Boards studiert
wurde: Da waren doch Jumper, DIP-Schalter, Slots und Schaltkreise
abgebildet, die man so auf dem vorliegenden realen Board &uuml;berhaupt nicht
oder an ganz anderer Stelle fand.
Diese Beschreibung war v&ouml;llig unbrauchbar.
Die Gesichter wurden noch l&auml;nger, als auf dem Beschreibungszettelchen zum
ZorroIII-Board zu lesen stand, da&szlig; selbiges ausschlie&szlig;lich mit OS 3.1
funtionieren w&uuml;rde.
<P>
Im vorliegenden A1200 steckten die 3.0-ROMs.
Und in allen uns bekannten Micronik-Anzeigen kein Wort von OS 3.1-
Voraussetzung f&uuml;r ZorroIII!
Nach tiefem Luftholen und leichtem Abklingen des ersten &Auml;rgers der Griff
zum Telefon und Micronik angerufen.
Als ich den mit mir telefonierenden Mitarbeiter der Firma auf die OS3.1-
Voraussetzung ansprach, meinte er doch:
"Ja, in unseren Anzeigen ist das nicht vermerkt, aber der K&auml;ufer h&auml;tte sich
vor dem Erwerb doch die diversen Testberichte in den Magazinen durchlesen
k&ouml;nnen. Dort sei auf diesen Umstand hingewiesen worden. Und &uuml;brigens gibt
es diesen Tower schon seit Jahren. Da h&auml;tten sich die
Betriebsvoraussetzungen doch herumsprechen m&uuml;ssen."
<P>
Diese Antwort befremdete mich doch sehr. Was soll das - mu&szlig; ich als
potentieller Kunde s&auml;mtliche Testberichte lesen, um alle f&uuml;r den Einsatz
notwendigen(!) Informationen zu erfahren?
In einem weiteren Punkt konnte ich die Behauptung des Micronik-
Mitarbeiters nicht nachvollziehen: In keinem der mir vorliegenden
Testberichte wird von einer OS 3.1-Bedingung f&uuml;r das Zorro-Board
gesprochen.
<P>
Auf meine Nachfrage, weshalb am Telefon w&auml;hrend der Bestellung denn nicht
auf diese OS 3.1-Bedingung hingewiesen wurde, kam als Antwort: "Ja, h&auml;tte
man machen k&ouml;nnen, aber man glaubte nicht, da&szlig; es noch A1200 mit OS 3.0
geben w&uuml;rde."
Toll!
<P>
N&auml;chster Versuch: Ich dachte an Kulanz und bat um finanzielle Beteiligung
am nun notwendigen Kauf der 3.1-ROMs.
Denkste, Antwort: "Das machen wir nicht. Sie k&ouml;nnen ja das ZorroIII-Board
zur&uuml;ckschicken."
Das nenne ich Entgegenkommen und Kundenfreundlichkeit!!
<P>
Nun, wenigstens versprach uns ein Micronik-Techniker, f&uuml;r die falsche
ZorroIII-Anleitung in den n&auml;chsten Tagen eine f&uuml;r die gelieferte Board-
Revision passende Beschreibung nebst Jumper zu schicken.
Wieder zwei Tage warten, dann kam der Brief, und der Umbau konnte jetzt
endlich beginnen.
<P>
Nachdem der Tower seiner Seitenverkleidung entledigt war, f&uuml;hrte jede
Ber&uuml;hrung, so beim Einlegen einer Diskette ins Laufwerk, zu einer
erheblichen Verwindung des Geh&auml;uses. Also nur noch mit Samthandschuhen
gearbeitet.
<P>
Der Innenbereich des Geh&auml;uses ist mit einer elektrisch leitf&auml;higen
Beschichtung (sicher zur Abschirmung) versehen. Wer hier meint, am Plastik-
Geh&auml;use kann es zu keinem elektrischen Kurzschlu&szlig; kommen, k&ouml;nnte sehr
schnell sein blaues Wunder erleben.
Stellt sich die Frage, weshalb man nicht von vornherein auf ein
Metallgeh&auml;use (h&ouml;here Stabilit&auml;t bei vergleichbarer Abschirmwirkung)
zur&uuml;ckgegriffen hat.
<P>
Der A1200 wanderte mit 3.1-ROMs flink aus seinem alten Geh&auml;use auf den
Einschubrahmen, der einen schnellen und eleganten Ein- und Ausbau der
A1200-Platine erm&ouml;glicht. Also genial, oder?
Tja, wenn nicht die Kontaktreihen des Tastaturinterfaces der elektrisch
leitf&auml;higen Beschichtung bedenklich nahe kommen w&uuml;rden.
Also sicherheitshalber noch ein Plastikpl&auml;ttchen als Abstandshalter
zwischen Kontakte und Beschichtung geschoben.
Ran an die Montage des ZorroIII-Boards.
<P>
Kein Problem - wenn da nicht die Steckerleiste der Stromversorgung am
Einbaurahmen mit einer gr&ouml;&szlig;eren lackierten Kupferfl&auml;che der Zorro-Platine
direkten Kontakt bekommen w&uuml;rde. Solange der Lack zwischen Kupferbahn und
Stromversorgungsstecker nicht besch&auml;digt ist, wird schon alles gut gehen...
Auch hier zur Sicherheit ein Plastikpl&auml;ttchen eingeschoben.
A1200 mit montierter ZorroIII-Platine eingeschoben und Tower von innen
betrachtet. Oh. Sollte einmal eine A3000/A4000-Turbokarte eingebaut werden,
kann der unterste Einschub f&uuml;r Laufwerke nicht mehr benutzt werden.
<P>
So, jetzt noch Jumper nach neuer Anleitung gesteckt, die CyberVision64 in
einen Zorro-Slot, HDs und CD-ROM angeschlossen,  f&uuml;r Spannung gesorgt und
Test:
Der Rechner bootet ... noch ... nicht.
Reset-Taste am Tower bet&auml;tigt. Aha, jetzt geht's los.
Der SCSI- Hostadapter ist sehr schnell. Da ist schon die Workbench.
CyberGraphX installiert. Wo bleibt die CyberVision?
Reset und ins Amiga Early Startup Control.
Expansion Board Diagnostic meint, es existiert keine CyberVision-Hardware.
Kann nicht sein, habe sie selbst eingesteckt. Der Puls wird wieder einmal
schneller.
Keine Panik, sage ich mir, probier den n&auml;chsten Slot.
Das gleiche Ergebnis.
<P>
Durch Zufall oder besser ausdauerndes Probieren teste ich die
CyberVision in allen, also endlich auch im mittleren Slot.
Man, hab ich ein Gl&uuml;ck - das ist der einzige Slot, der mit der
installierten Blizzard 1230-IV UND CyberVision64 funktioniert. Dabei hei&szlig;t
es, alle Zorro-Slots arbeiten im ZorroII-Modus, solange keine A3000/A4000-
Turbokarte eingebaut ist. Jedenfalls nicht mit der CyberVision64/3D.
Auch dar&uuml;ber findet sich kein Hinweis in der Umbauanleitung.
Aber was soll's, endlich funktioniert alles!!
Und ich kann mir in Ruhe den Schwei&szlig; von der Stirn wischen. Puh.
<P>
<B>Fazit:</B>
<P>
Die gepriesene Genialit&auml;t und die 98% in der Bewertung (AMIGA Plus)
hinterlassen bei mir ein flaues Gef&uuml;hl.
Da war wohl der Wunsch der Vater der Bewertung.
Die mit dem Tower ausgelieferte Dokumentation ist aus o.a. Gr&uuml;nden
praktisch unbrauchbar.
Die Hardware gen&uuml;gt bei sehr wohlwollender Bewertung dem Urteil GUT, die
Beschreibung verdient ein klares MANGELHAFT.
<P>
Jeder Hardware-Laie sollte die Finger von einem selbst&auml;ndigen Umbau lassen.
Wenn es dieser Tower unbedingt sein soll, dann ordert das Ger&auml;t komplett
zusammengebaut von Micronik.
Sitzt der A1200 samt Erweiterungen erst einmal im Tower, hat man ein
ansehnliches Ger&auml;t m&auml;&szlig;iger Stabilit&auml;t und bei entsprechender Ausstattung
durchaus den Wolf im Schafspelz (Stichwort CyberStormPPC).
<P>
Uwe Pannecke
<P>
<A HREF="mailto:Uwe.Pannecke@t-online.de">Uwe.Pannecke@t-online.de</A>«
<P>
Uwe Pannecke hat &uuml;brigens vorgeschlagen, zu einem Towergeh&auml;use-
Vergleichstest aufzurufen, was aus unserer Sicht eine sehr gute Idee ist.
Also: Habt auch Ihr Euren AMIGA in einen Tower umgebaut? Schickt uns Eure
Erfahrungen: <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>

</BODY>
</HTML>
