<HTML>
<HEAD><TITLE>Spieleteil</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0703.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0705.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>Spieleteil</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H3>4. Spiele-News aus aller Welt</H3>
<P>
<H4>Quake-Update</H4>
<P>
<IMG SRC="img/quake.jpg" WIDTH=640 HEIGHT=218>
<P>
Ein erstes Amiga-Quake-Demo ist verf&uuml;gbar. Der QuakePlayer ist nicht
spielbar, sondern zeigt nur selbstablaufende Quake-Demos. Da clickBOOM
best&auml;tigte, da&szlig; die Engine im QuakePlayer zu 99 % identisch mit der im
endg&uuml;ltigen Spiel ist, zeigt der QuakePlayer die wahre Geschwindigkeit
des Spiels. Viele Ger&uuml;chte dazu kursierten in der letzten Zeit, und manch
ein Besitzer von 030- oder 040-Prozessoren hofften heimlich, da&szlig; Quake
auch auf ihren AMIGAs spielbar sein wird. clickBOOM hatte ja schlie&szlig;lich
als Mindestvoraussetzung lediglich einen 020-AMIGA angegeben. Um so
ern&uuml;chternder waren dann auch die Kommentare der ersten Leute, die den
QuakePlayer ausprobiert hatten. Allerh&ouml;chstens auf einem 060-AMIGA ist
Quake spielbar. Die Ergebnisse auf diesen AMIGAs lagen zwischen 10 und 15
Frames pro Sekunde. Bei vielen Gegnern im Bild, kann dieser Wert auch mal
auf ca. 5 Frames pro Sekunde nach unten gehen, sicherlich nicht das, was
viele erhofft hatten. Auf 68040- oder sogar 68030-AMIGAs ist Quake nicht
spielbar und auf 68020-AMIGAs wird sicher nur ein Wert von 2 Sekunden pro
einem Frame erreichbar sein, aber clickBOOM hat ja auch nur gesagt, da&szlig;
Quake auf solchen Rechnern laufen wird, nicht, da&szlig; es auch spielbar ist.
Also machen wir uns nichts vor, Quake ist viel aufwendiger als Doom und
&uuml;berfordert die veralteten 680x0-Prozessoren, und so lange es kein QuakePPC
geben wird, wird AMIGA-Quake leider kein Konkurrent zur PC-Version
sein, und dies liegt sicher nicht an der Umsetzung des Spiels, sondern an
der leider nicht ausreichenden AMIGA-Hardware.
<BR>
clickBOOM hat au&szlig;erdem in einem Interview angemerkt, da&szlig; Grafikkarten
keine gro&szlig;e Geschwindigkeitsverbesserung f&uuml;r Quake bewirken. Man
empfiehlt dagegen den 68060-Prozessor auf 66 Mhz zu &uuml;bertakten.
Zu einer eventuellen PowerPC-Version von Quake merkte clickBOOM an, da&szlig;
diese auf der Priorit&auml;tsliste nicht sehr weit oben stehe, da die PowerUp-
Karten noch nicht so weit verbreitet w&auml;ren, da&szlig; sich gro&szlig;e Investitionen
in diesem Bereich lohnen w&uuml;rden. clickBOOM wolle statt dessen erst einmal
QuakeWorld und QSpy f&uuml;r den AMIGA umsetzen und danach weitere Spiele f&uuml;r
den AMIGA umsetzen. Interessant klingt dagegen die Anmerkung, da&szlig;
clickBOOM in Gespr&auml;chen mit Phase 5 sei, in denen es darum geht, eine
eventuelle Quake-PowerPC-Version in einem Bundle mit den PowerUp-Karten
zu verkaufen.
Quake soll &uuml;brigens in K&uuml;rze erscheinen.
<P>
<H4>clickBOOM zufrieden</H4>
<P>
Die Firma clickBOOM ist zufrieden mit den bisherigen Myst-Verkaufszahlen
und den Vorbestellungen f&uuml;r Quake. Man sieht durchaus noch Potential, im
AMIGA-Sektor Geld zu verdienen und plant, weitere PC-Spiele umzusetzen.
<P>
<H4>Doom-Update</H4>
<P>
ADoom ist inzwischen in der Version 1.2 erh&auml;ltlich. Es ist weiterhin der
beste und ausgereifteste Doom-Port f&uuml;r den AMIGA.
<BR>
Die anderen Ports wurden seit Februar bzw. Januar nicht mehr
weiterentwickelt. DoomAttack befindet sich im Moment bei Version 0.7,
psiDoom bei 0.8. AmiDoom und amigaDoom befinden sich noch bei den Januar-
Versionen 0.7c bzw. 0.6&szlig;.
<BR>
Weiterhin sind mehrere Tools f&uuml;r die Amiga-Doom-Portierungen erschienen.
ADoom GUI 1.1 ist ebenso wie ADooMUI 1.0 ein Grafik-Interface f&uuml;r ADoom.
DoomGate 0.8 Beta und Gui4Doom 1.0 sind dagegen Launchtools f&uuml;r alle
verf&uuml;gbaren Doom-Portierungen.
<BR>
Die beiden Amiga-PPC-Portierungen befinden sich momentan bei den Versionen
0.6 (ZhaDoom) und 0.3 (VDoomPPC).
<P>
<H4>Descent-Update</H4>
<P>
Die beiden Amiga-Descent-Portierungen befinden sich inzwischen bei den
Versionen 0.3 (ADescent) und 0.25 (Descent). Beide Ports laufen jetzt auch
unter AGA. Man ben&ouml;tigt aber auf jeden Fall die kommerzielle Version 1.5
des PC-Descents. Ein Patch von Version 1.0 auf 1.5 kann man im WWW
downloaden.
<P>
<H4>Genetic Species erscheint am 4. Mai</H4>
<P>
<IMG SRC="img/geneticspecies.jpg" WIDTH=640 HEIGHT=512>
<P>
Genetic Species soll nun endg&uuml;ltig am 4. Mai erscheinen. Vulcan Software
machte mit einer sehr langen Presseank&uuml;ndigung auf die Features des Spiels
aufmerksam. Ein H&ouml;hepunkt des 3D-Shooters wird sicherlich die 300 MB gro&szlig;e
Intro-Animation sein. Erste Screenshots aus dem Intro sehen zumindest sehr
gut aus.
<P>
<H4>Wasted Dreams-Entwicklung geht weiter</H4>
<P>
<IMG SRC="img/wasteddreams.jpg" WIDTH=320 HEIGHT=200>
<P>
Die Entwickler des Spiels Wasted Dreams haben beschlossen, ihr Projekt
fortzusetzen. Vulcan Software hatte im letzten Monat verk&uuml;ndet, die
Entwicklung des Spiel sei vorerst gestoppt, bis die Programmierer neue
Impulse im AMIGA-Markt erkennen. Wasted Dreams ist ein Action-Adventure
aus einer isometrischen Perspektive mit einem 2-Spieler-Modus, das
Mystery, Aliens, und viel Gewalt bietet. Im Moment werden 350 MB an
Sprachausgabe aufgenommen, die in das Spiel integriert werden. Wasted
Dreams soll bereits im Mai erscheinen.
<P>
<H4>Desolate</H4>
<P>
Auch Desolate, das Spiel mit sehr gro&szlig;en &Auml;hnlichkeiten zum Bitmap Bros.-
Klassiker Gods soll in K&uuml;rze erscheinen. Auch hier nimmt man noch digitale
Sprachausgabe auf und designt eine Intro-Animation. Man ist im Moment
also flei&szlig;ig bei Vulcan Software. Wollen wir hoffen, da&szlig; die Spiele auch
allesamt gut sind.
<P>
<H4>Worms-Patches erscheinen demn&auml;chst</H4>
<P>
Die bereits in einer fr&uuml;heren AGPJ-Ausgabe angek&uuml;ndigten Worms-Patches
sollen in K&uuml;rze erscheinen. Andy Davidson, Sch&ouml;pfer der Worms-Spiele hat
scheinbar 3 verschiedene Patches programmiert. Der erste Patch ist f&uuml;r
das Original-Worms. Er macht das Spiel stabiler und entfernt den Pa&szlig;wort-
Kopierschutz, da sich viele Spieler &uuml;ber den nervigen Schutzmechanismus
ge&auml;rgert hatten. Das zweite Update betrifft Worms - Director's Cut. Es
enth&auml;lt einige Bugfixes und mehr Kompatibilit&auml;t. Der dritte Patch wird
eine Festplatte und Fast-RAM ben&ouml;tigen, da Worms - Director's Cut durch
ihn zu gro&szlig; wird, um in der urspr&uuml;nglichen Form zu laufen. Der Patch wird
sogar einige Features aus Worms 2 bieten. Alle 3 Updates werden frei im
Aminet verf&uuml;gbar sein.
<P>
<H4>die n&auml;chsten epic-Titel...</H4>
<P>
...sind Mobile Warfare, ein Mix aus North & South, Dune 2 und Risiko,
sowie Virtual Karting 2, das im April erscheinen soll.
<P>
<H4>Software 2000 zur&uuml;ck zum AMIGA?</H4>
<P>
Laut Petro Tyschtschenko steht Amiga International in Kontakt mit Software
2000, und es laufen ernsthafte Gespr&auml;che, nach denen geplant ist,
PC-Software f&uuml;r den AMIGA umzusetzen.
<P>
<H4>Sayonara Software</H4>
<P>
Sayonara Software beobachtet den Amiga-Markt und &uuml;berlegt, einen Nachfolger
f&uuml;r Samba Partie Professional zu ver&ouml;ffentlichen.
<P>
<H4>Evil's Doom Special Edition</H4>
<P>
<IMG SRC="img/EvilsDoom.jpg">
<P>
Der n&auml;chste Titel von Titan Computer wird Evil's Doom Special Edition
sein. Die Originalversion dieses Fantasy-Rollenspiels kam bereits 1996
als Shareware raus. In diesem Sommer soll Evil's Doom nun als Special
Edition kommerziell ver&ouml;ffentlicht werden. Systemvoraussetzungen sind AGA
oder Grafikkarte, 020-Prozessor, 4 MB Fast-RAM, 2x-CD-ROM-Laufwerk und
eine Festplatte mit 30 MB Platz. Eine neue Demoversion soll demn&auml;chst
erscheinen.
<P>
<H4>Wingnuts von Skunkworks</H4>
<P>
Wingnuts ist ein Multiplayer-Action-Spiel, bei dem man seltsame Piloten
in genauso seltsamen Flugzeugen steuert. Das Spiel ist bereits erh&auml;ltlich
und setzt AGA, Festplatte und Fast-RAM voraus. Die Reviews in den
englischen Magazinen waren eher mittelm&auml;&szlig;ig.
<P>
<H4>Cinetech's Pl&auml;ne</H4>
<P>
Cinetech, Programmierer des Adventures Sixth Sense Investigations (Test
in dieser Ausgabe), haben bereits neue Pl&auml;ne. In der Planung sind eine
Fortsetzung des Spiels und ein anderes Adventure. Voraussetzung f&uuml;r diese
Pl&auml;ne sind akzeptable Verkaufszahlen von Sixth Sense Investigations.
<P>
<H4>Hurricane Software geben PowerPC-Support bekannt</H4>
<P>
Hurricane Software gaben bekannt, da&szlig; sie in Zukunft auch PowerPC-AMIGA-
Spiele ver&ouml;ffentlichen werden. Ob es spezielle PowerPC-Versionen der
angek&uuml;ndigten Spiele geben wird, oder komplett neue PowerPC-Spiele, ist
noch nicht klar.
<BR>
Das Fu&szlig;ballspiel Eat the Whistle wird nun &uuml;brigens bei epic herauskommen,
die auch an dem Adventure Escape towards the Unknown interessiert sind.
<P>
<H4>Engine-X</H4>
<P>
Ein besonderes Projekt ist Engine-X. Es handelt sich dabei um ein System,
das es bis zu 8 Spielern erm&ouml;glichen soll, gegeneinander diverse
verschiedene Spiele zu spielen. Der Autor von Engine-X beschreibt es als
eine Art "Olympische Spiele des Computerspiels". 6 verschiedene Spiele
(diverse Shoot Em Ups und Beat Em Ups) m&uuml;ssen nacheinander gespielt werden.
Dies geschieht so, da&szlig; aus jedem der 6 Spiele per Zufallsystem ein Level
ausgesucht wird. Die 6 Spiele wurden durch Spiele wie Double Dragon II,
R-Type, UN Squadron, Ikari Warriors, Forgotten Worlds, Dragon Ninja,
Renegade, Smash TV, Gryzor und Midnight Resistance beeinflu&szlig;t.
Engine-X ben&ouml;tigt einen 060-Prozessor, eine Festplatte und 4 MB Fast-RAM.
Je nach Spielerzahl ben&ouml;tigt man 4-Player-Adapter oder 2 AMIGAs. Noch hat
Engine-X keinen Publisher, aber bei einem so schl&uuml;ssigen Konzept d&uuml;rfte es
nicht schwierig sein, einen zu finden. Die Entwicklung dauert bereits 7
Monate und soll in weiteren 7 fertiggestellt sein.
<P>
<H4>neue Caveman Species-Screenshots</H4>
<P>
<IMG SRC="img/cavemanspecies.jpg">
<P>
Die Programmierer des Echtzeit-Strategiespiels Caveman Species haben neue
Screenshots ver&ouml;ffentlicht, die auf ein hervorragendes Spiel schlie&szlig;en
lassen. Angeblich haben schon mehrere Publisher Interesse bekundet, das
Spiel zu ver&ouml;ffentlichen. Caveman Species wird &uuml;ber 256 Farben, Digital-
Sound, Support f&uuml;r 2 Spieler und evtl. &uuml;ber einen Internet-Link verf&uuml;gen.
Caveman Species ist zu 20 % fertig und soll im Sommer auf CD-ROM
erscheinen.
<P>
<H4>Trauma Zero</H4>
<P>
Die Entwickler des Shoot Em Ups Trauma Zero gaben bekannt, da&szlig; es auch eine
PowerPC-Version des Spiels geben soll. Wir warten unterdessen immer noch
auf die 680x0-Version...
<P>
<H4>neue Lambda-Screenshots</H4>
<P>
<IMG SRC="img/lambda.png">
<P>
Auch vom geplanten 3D-Weltraum-Shoot Em Up Lambda gibt es neue Screenshots.
<P>
<H4>Moonbases von Homegrown Software</H4>
<P>
<IMG SRC="img/moonbases.png">
<P>
Ein weiterer Titel in der langen Liste der angek&uuml;ndigten
Echtzeit-Strategiespiele ist Moonbases von Homegrown Software. Es wird &uuml;ber
diverse Screenmodes bis 640x256, "geraytracte" Grafik und Sprachausgabe
verf&uuml;gen, und f&uuml;r 1 oder 2 Spieler konzipiert sein. Systemvoraussetzungen
sind lediglich AGA, 1 MB Fast-RAM und eine Festplatte. Ein noch ungenannter
Publisher hat angeblich bereits Interesse an dem fast fertigen Spiel
gezeigt, so da&szlig; einem baldigen kommerziellen Release nichts im Wege stehen
sollte.
<P>
<H4>Great Nations-Entwicklung zeigt Fortschritte</H4>
<P>
<IMG SRC="img/greatnations.jpg">
<P>
Great Nations ist ein Strategiespiel im Stile von Civilization. Es wird
&uuml;ber Multiplayer-F&auml;higkeiten verf&uuml;gen. Mehrere Spieler sollen an einem
Computer oder &uuml;ber Netz gegeneinander spielen k&ouml;nnen. Verschiedene
Landschaften, Geb&auml;ude, Einheiten usw. sollen das Spiel ebenso attraktiver
machen wie die Ank&uuml;ndigung, da&szlig; die Gr&ouml;&szlig;e der Karten nur durch den
Speicher des AMIGAs begrenzt wird. Karten sollen mit dem beiliegenden
Map-Editor entworfen werden k&ouml;nnen. Great Nations ben&ouml;tigt AGA oder eine
Grafikkarte, einen 020-Prozessor oder h&ouml;her und 6 MB RAM. Eine Grafikkarte
wird dringend empfohlen. Das Spiel soll nicht kommerziell, sondern als
Shareware erscheinen. Eine Demo-Version ist unter <A HREF="http://gn.gameshock.com/">http://gn.gameshock.com/</A>
erh&auml;ltlich.
<P>
<H4>Shadow of the third Moon 2</H4>
<P>
Ger&uuml;chten zufolge sollen die Programmierer des Spiels Shadow of the third
Moon an einer Fortsetzung arbeiten. Dieses Spiel soll angeblich nur f&uuml;r
PowerPC-AMIGAs erscheinen und fotorealistische Hintergr&uuml;nde bieten.
<P>
<H4>The Rim-Website gestartet</H4>
<P>
Die Entwickler des Diablo-Clones "The Rim" haben eine Website f&uuml;r das Spiel
gestartet, auf der man Informationen &uuml;ber die Entwicklung des Spiels und
den Story-Hintergrund erfahren kann. Die URL ist:
<A HREF="http://members.xoom.com/denan/therim/therim.html">http://members.xoom.com/denan/therim/therim.html</A>
<P>
<H4>offizielle CounterStrike-Website</H4>
<P>
Auch das Spiel CounterStrike hat eine offizielle Website erhalten, die &uuml;ber
den Entwicklungsstand und andere Details des Command&Conquer-Clones
informiert. Wegen rechtlicher Probleme mit dem Namen des Spiels suchen die
Programmierer nun einen neuen Namen. Wer Vorschl&auml;ge hat, gibt sie bitte
hier ab: <A HREF="http://homepages.enterprise.net/dallsopp/">http://homepages.enterprise.net/dallsopp/</A>
<P>
<H4>Ultra Violent Worlds</H4>
<P>
Das Spiel Ultra Violent Worlds, das urspr&uuml;nglich bei Vulcan erscheinen
sollte, soll nun auf einer Multi-Format-CD mit Versionen f&uuml;r AGA-Amiga,
Windows 95, Linux und DOS ver&ouml;ffentlicht werden. Ein Publisher existiert
noch nicht.
<P>
<H4>Bermuda</H4>
<P>
Bermuda soll ein Mix aus Elementen von Myst, Secrets of Luxor und Monkey
Island werden. Das Spiel hat eine Science Fiction-Story mit geraytracten
Animationen. Systemvoraussetzungen sind ein AMIGA 1200 mit 4 MB Fast-RAM
und 2x-CD-ROM-Laufwerk.
<P>
<H4>Daydream</H4>
<P>
<IMG SRC="img/daydream.jpg" WIDTH=540 HEIGHT=195>
<P>
Daydream wird ein Grafik-Adventure im Monkey-Island-Stil von APC & TCP.
Es soll &uuml;ber 100 R&auml;ume verf&uuml;gen und &uuml;ber eine Aufl&ouml;sung von 640x256 und
256 Farben verf&uuml;gen. Es erscheint wahrscheinlich erst 1999. Gesucht werden
noch einige gute Grafiker mit Erfahrungen im Raytracing- oder 2D-Bereich
und Musiker. Wer sich angesprochen f&uuml;hlt, maile an: <A HREF="mailto:Augi@asam.baynet.de">Augi@asam.baynet.de</A>
<P>
<H4>weitere Stellenangebote</H4>
<P>
World Foundry suchen einen 3D-Grafiker f&uuml;r das angek&uuml;ndigte Spiel Maim &
Mangle. Kontakt: <A HREF="mailto:deimos@fundy.net">deimos@fundy.net</A>
<P>
Homegrown Software suchen neue Mitarbeiter (z.B. 3D-Grafiker, 2D-Grafiker,
C-Programmierer,...) f&uuml;r das Spiel Moonbases (<A HREF="mailto:homegrown@eclipse.co.uk">homegrown@eclipse.co.uk</A>).
<P>
2260 Designs suchen Programmierer f&uuml;r das Spiel New Horizons. Kontakt:
<A HREF="mailto:korhonen@zetnet.co.uk">korhonen@zetnet.co.uk</A>
<P>
Fullspeed Creative Development suchen einen Grafiker f&uuml;r das horizontale
Shoot-Em-Up Pulsator. Kontakt: <A HREF="mailto:Fullspeed@t-online.de">Fullspeed@t-online.de</A>
<P>
Earl Enterprises sucht Programmierer f&uuml;r ein Spiel mit &Auml;hnlichkeiten zu
Elite 2, Doom, Breed96, Colonization,...
<P>

</BODY>
</HTML>
