<HTML>
<HEAD><TITLE>AMIGA International, Inc. / AMIGA, Inc.</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0711.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0801.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>AMIGA International, Inc. / AMIGA, Inc.</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H3>1. Sind Haage & Partner und Phase 5 am AMIGA OS 3.5 beteiligt?</H3>
<P>
Nachdem es am 20. M&auml;rz schon ganz so aussah, als ob wir uns auf ein
gemeinschaftlich von AMIGA, Inc., Haage & Partner und Phase 5 digital
products entwickeltes AMIGA OS 3.5 einstellen k&ouml;nnten, steht mittlerweile
wieder ein mehr oder weniger gro&szlig;es Fragezeichen &uuml;ber der Meldung.
<P>
Was war geschehen?
<P>
Im Verlauf des vergangenen Monats wurden die Ger&uuml;chte immer lauter, nach
denen Haage & Partner und/oder Phase 5 digital products an der Entwicklung
der Version 3.5 des AMIGA-Betriebssystems beteiligt seien.
Daraufhin fragte AMIGA aktuell bei den Gesch&auml;ftsf&uuml;hrern von AMIGA, Inc.,
AMIGA International, Inc., Haage & Partner sowie Phase 5 digital products
an, ob denn an den Ger&uuml;chten etwas Wahres dran sei. Petro Tyschtschenko
antwortete als erster, er best&auml;tigte die Meldungen und gab n&auml;here
Informationen, woraufhin AMIGA aktuell sich zur Herausgabe des folgenden
Specials entschlo&szlig;:
<P>
<H4>Haage & Partner und Phase 5 arbeiten am AMIGA OS 3.5 mit</H4>
<P>
Petro Tyschtschenko, Praesident von AMIGA International, Inc., bestaetigte
soeben gegenueber AMIGA aktuell Geruechte, nach denen der
Softwarehersteller Haage & Partner und der Hardwareproduzent Phase 5
digital products an der Entwicklung des AMIGA OS 3.5 beteiligt sind.
Ausserdem arbeiten Olaf Barthel und Fleecy Moss (Mitglied beim Industry
Council for Open AMIGA) mit. Die Regie bei der Weiterentwicklung des
AMIGA-Betriebssystems hat Jeff Schindler, Chef der
AMIGA-Entwicklungsabteilung AMIGA, Inc., USA.
<P>
Mehr dazu in AMIGA aktuell 4/98.
<HR>
Kurz nachdem diese Nachricht in verschiedene AMIGA-Newsgroups gelangt ist,
meldete sich Olaf Barthel mit einem Posting zu Wort und best&auml;tigte darin,
da&szlig; Fleecy Moss und er an der Entwicklung des AMIGA OS 3.5 beteiligt seien.
Dagegen entspr&auml;che die Aussage &uuml;ber eine Beteiligung von Haage & Partner
und Phase 5 "in dieser Form nicht der Wahrheit".
<P>
Etwa zur selben Zeit schrieb mir J&uuml;rgen Haage, Gesch&auml;ftsf&uuml;hrer von Haage &
Partner. Demnach st&uuml;nde das Unternehmen zur Zeit in Verhandlungen mit AMIGA
International, und man sei sehr zuversichtlich, bei zuk&uuml;nftigen OS-
Projekten mitwirken zu d&uuml;rfen. Damit best&auml;tigte er indirekt die Worte Olaf
Barthels.
<HR>
<B>Fazit:</B>
Kaum zu glauben, aber wahr: Erst in der letzten Ausgabe von AMIGA aktuell
habe ich kritisiert, da&szlig; gewisse AMIGA-Mitarbeiter ihre pers&ouml;nlichen
Meinungen in der Form verbreiten, als w&auml;ren sie bereits beschlossene
Tatsachen.
<P>
Ich meine, mit Vorsicht sagen zu k&ouml;nnen, da&szlig; die Anzahl dieser Personen
wohl in erster Linie auf eine einzige zu reduzieren ist. Leider ist es
nicht das erste Mal, da&szlig; die betreffende AMIGA-Kraft unrichtige
Behauptungen aufstellt, insbesondere in den letzten Wochen ist dies
vermehrt vorkommen, ohne da&szlig; ich einen Grund sehe, auf jede falsche Aussage
im einzelnen einzugehen.
<P>
Ich kann nur nochmals appellieren, meinen Kommentar in der letzten Ausgabe
zu Herzen zu nehmen.
<P>
Aber jetzt "Schwamm dr&uuml;ber".
<P>
Positiv ist wenigstens, da&szlig; Haage & Partner mit AMIGA, Inc. in
Verhandlungen &uuml;ber eine Beteiligung an der Entwicklung des AMIGA OS 3.5
steht. Denn so wie es mittlerweile aussieht, kommt die AMIGA-
Entwicklungsabteilung mit der Arbeit nicht so recht voran - insofern w&auml;re
es ganz einfach t&ouml;richt, nicht zu einer &Uuml;bereinkunft mit Haage & Partner
(und vielleicht auch Phase 5) zu kommen. Aber mehr dazu in meinem
Schlu&szlig;wort am Ende dieser Ausgabe.
<P>

</BODY>
</HTML>
