<HTML>
<HEAD><TITLE>PowerUp-to-date</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0901.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0903.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>PowerUp-to-date</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H3>3. Phase 5 k&uuml;ndigt AMIGA-kompatibles Computersystem an</H3>
<P>
Einen Tag nach Bekanntwerden der AMIGA-OS-3.1-Lizensierung meldete sich
Phase 5 digital products mit folgender Ank&uuml;ndigung zu Wort:
<P>
»10. Maerz 1998
<P>
PHASE 5 DIGITAL PRODUCTS K&Uuml;NDIGT DIE ENTWICKLUNG DER PRE\BOX AN,
EINES AUF POWERPC BASIERENDEN COMPUTERSYSTEMS MIT AMIGA OS 3.1
<P>
Neben der Fertigstellung geplanter Produkte, wie z.B. die CyberVisionPPC-
und die BVisionPPC-Grafikkarten, hat PHASE 5 DIGITAL PRODUCTS die
Entwicklung eines neuen Projekts gestartet, n&auml;mlich ein selbst&auml;ndiges
auf PowerPC basierendes Computersystem mit Namen pre\box, welches mit dem
lizensierten AMIGA OS 3.1 und einer weiterentwickelten Version der PowerUP-
Systemsoftware ausgestattet sein wird, um f&uuml;r Amiga-Kompatibilit&auml;t auf
der Ebene von AMIGA OS/Workbench 3.1 unter CyberGraphX V3 zu sorgen.
<P>
"Die Lizenzvereinbarung, die wir mit Amiga International unterzeichnet
haben, erlaubt uns, das Entwicklungprojekt dieser neuen Maschine zu
beginnen, das wir seit einigen Monaten in der Entwurfplanung hatten.
Es ist ein wichtiger Schritt zur Wiederbelebung des Amiga-Marktes, zur
Ermutigung der Entwickler und zum Ausbau eines Marktes, der stark genug
ist, sich selbst zu erhalten", sagt Wolf Dietrich, General Manager von
PHASE 5. In einer gesonderten Ver&ouml;ffentlichung erkl&auml;rt Dietrich, da&szlig; die
A\BOX, das Langzeit-Technologie-Projekt von PHASE 5 DIGITAL PRODUCTS, zwar
zur&uuml;ckgestellt, aber nicht aufgehoben wurde. "Das A\BOX-Projekt wird
weitergef&uuml;hrt mit angepa&szlig;ten Zielen und Eigenschaften und mit erweiterten
Mitteln, die auf der erfolgreichen Einf&uuml;hrung der neuen Produktlinien
beruhen werden". Dietrich weist darauf hin, da&szlig; der Schl&uuml;ssel f&uuml;r das
&Uuml;berleben des Amiga und des Amiga-Markts die fr&uuml;hest m&ouml;gliche Verf&uuml;gbarkeit
neuer herausragender selbst&auml;ndiger Hardware-Produkte ist, ein Ziel, das mit
dem Entwurf der pre\box erreicht werden soll. "Wir brauchen in der n&auml;chsten
Zukunft einen expandierenden Markt, oder die Schlacht ist f&uuml;r das Amiga-
Computersystem verloren", f&uuml;gt er hinzu.
<P>
MIT DEM N&Auml;CHSTEN SCHRITT IN RICHTUNG AUF POWERPC-MULTIPROCESSING STARTET
DIE PRE\BOX IN NEUE LEISTUNGSDIMENSIONEN DURCH.
<P>
Die neuen pre\box-Maschinen zielen auf die mittleren und gehobenen Preis-
Bereiche f&uuml;r PCs oder Personal Workstations, sind aber f&uuml;r unglaubliche
Leistungen entworfen. Alle Systeme erscheinen als Multi-Prozess-Ger&auml;te
mit wenigstens vier eingebauten PowerPC-CPUs, durch die eine extrem hohe
Computerleistung zu einem au&szlig;ergew&ouml;hnlichen Preis/Leistungs-Verh&auml;ltnis
geboten wird. "Multi-Prozessor-Technik war eines der wichtigsten, wenn
nicht gar DAS wichtigste Ziel f&uuml;r die Erzeugnisse von PHASE 5 DIGITAL
PRODUCTS in den letzten 18 Monaten", erkl&auml;rt Wolf Dietrich. "Genau hier
bietet die alternative Technologie Vorteile und &Uuml;berlegenheit &uuml;ber die
&uuml;blichen Produkte auf dem PC-Markt. W&auml;hrend unsere derzeitige PowerUP-
Produktlinie, die aus Aufr&uuml;stungskarten f&uuml;r existierende Maschinen besteht,
dem Anwender hilft, sein System aufzur&uuml;sten und seine Investitionen in
existierender Hard- und Software zu sichern, ist es eine Herausforderung,
neue selbst&auml;ndige Hardware-Produkte zu bauen, die im Preis mit &uuml;blichen
PCs mithalten k&ouml;nnen - besonders unter dem Eindruck, da&szlig; PC-Systeme
regelm&auml;&szlig;ig zu Dumpingpreisen hinausgeworfen werden, und da&szlig; ein heute
gekauftes PC-System in weniger als einem Jahr &uuml;berholt und nahezu wertlos
sein kann". Folgerichtig plant die Gesellschaft nicht die Herstellung
von Einzel-CPU-Systemen, welche mit einem &auml;hnlichen Leistungspegel der
Intel-basierenden Systeme konkurrieren m&uuml;&szlig;ten, sondern will vollst&auml;ndig
die M&ouml;glichkeiten ausn&uuml;tzen, die ihr die Hinwendung zum PowerPC bietet.
"Entwickler, die sich schon heute der PowerPC-Gruppe anschlie&szlig;en, k&ouml;nnen
ihre Produkte recht einfach f&uuml;r das Multiprocessing anpassen. Damit k&ouml;nnen
wir zwei riesige Schritte - vom System mit der einzelnen 68k-CPU zum
Mehrfach-PowerPC-System - innerhalb eines einzigen Jahres machen, ein
eindrucksvoller Fortschritt f&uuml;r die Amiga-Gemeinde, die viele nicht f&uuml;r
m&ouml;glich gehalten haben", f&uuml;gt Wolf Dietrich hinzu.
<P>
Das pre\box-System wird auf einem ATX-Motherboard in Normgr&ouml;&szlig;e entwickelt
und erh&auml;lt ein schnelles auf SDRAM beruhendes Speicher-Subsystem mit
zun&auml;chst bis zu 100 MHz Zugriffsgeschwindigkeit. Abh&auml;ngig von der
Bus-Geschwindigkeit des verwendeten PowerPC-Prozessors l&auml;uft der
Prozessorbus auch mit bis zu 100 MHz. Die vier PowerPC-Prozessoren, die auf
einer getrennten CPU-Karte untergebracht sind, werden mit vorder- oder
r&uuml;ckseitigen (inline or backside) Cache-Speichern ausger&uuml;stet, je nachdem,
welcher Prozessortyp tats&auml;chlich verwendet wird. Da die Software des
PowerUP-Systems eine Software-kontrollierte Cache-Zuteilung (cache
coherency) besitzt, kann die pre\box sogar mit CPUs best&uuml;ckt werden,
die Hardware-seitig das Multiprocessing nicht unterst&uuml;tzen, wie die
PPC603e oder die PPC750 (G3).
<P>
In das pre\box-System ist auch ein 3D-Grafik-Subsystem integriert, welches
&uuml;ber ein 66-MHz-Bussystem PCI 2.1 mit einer Spitzen-&Uuml;bertragungsleistung
von 264 MB/s verbunden ist und acht MB Grafikspeicher aufweist. Mit
diesem Gfx-Subsystem ist ein leistungsf&auml;higer Standard f&uuml;r die Minimal-
Konfiguration geboten, auf die sich Software-Entwickler verlassen k&ouml;nnen.
Aber noch mehr: Auf dem gleichen 66-MHz PCI-Bus ist noch ein besonderer
Steckplatz f&uuml;r eine auf Voodoo2 basierende 3D-Beschleunigerkarte, die
direkt mit dem eingebauten Grafik-Chip verbunden ist. "Wir planen, entweder
selbst oder in Zusammenarbeit mit anderen Herstellern, eine durch Voodoo2
unterst&uuml;tzte L&ouml;sung als m&auml;chtige Aufr&uuml;stungs-Option", kommentiert Wolf
Dietrich. "Wir wollen die Forderungen ernsthafter Spieler nicht vergessen."
Die ausgezeichneten Eigenschaften der Bildschirm-Darstellung werden erg&auml;nzt
durch ein leistungsf&auml;higes Klangsystem in CD-Qualit&auml;t in Stereo mit
weitreichenden Klangsynthese-M&ouml;glichkeiten.
<P>
Gleichfalls als Standard werden ein Ultra-Wide-SCSI-II-Controller und ein
100-Mbit-Ethernet-Controller integriert sein, wodurch die Verwendung der
heutigen leistungsf&auml;higen UW-SCSI-Ger&auml;te und der Anschlu&szlig; an schnelle
Netze m&ouml;glich wird - Eigenschaften, die auch die Konzepte mit verteilten
Multiprozessoren (distributed multiprocessing concepts) von PHASE 5
DIGITAL PRODUCTS unterst&uuml;tzen.
<P>
Um die Verwendung preiswerter Hardware-Erweiterungen zu erm&ouml;glichen, ist
ein Standard-PCI-Bus mit drei Steckpl&auml;tzen integriert. Dieser PCI-Bus
l&auml;uft mit 66 MHz, er akzeptiert aber auch 33-MHz-PCI-Platinen. Durch den
integrierten PCI-Bus ist die Entwicklung bester Hardware-Produkte f&uuml;r
das pre\box-System ganz leicht; und noch mehr: Entwickler k&ouml;nnen vorhandene
PCI-Ger&auml;te verwenden und sie einfach an das pre\box-System anpassen, indem
sie die Software zur Unterst&uuml;tzung schreiben.
<P>
Es ist noch nicht entschieden, ob ein Sockel f&uuml;r eine optionale 68k-CPU
auf der Platine sein wird. "Bei diesem Erzeugnis der n&auml;chsten Generation
ist die Konsequenz f&uuml;r die Verwendung von 68k-Software die Emulation. Wir
ermutigen st&auml;ndig die Amiga-Entwickler, unsere neue MP-Technologie und die
Richtlinien, die wir mit unserer PowerUP-Systemsoftware einf&uuml;hrten, zu
unterst&uuml;tzen, und diejenigen, die diesen Empfehlungen folgen, werden
Anwendungsprogramme liefern k&ouml;nnen, die die ungeheuere Leistungsf&auml;higkeit
unseres entstehenden pre\box-Systems von Anfang an ausn&uuml;tzen. Hier m&uuml;ssen
die Kr&auml;fte jetzt eingesetzt werden", sagt Wolf Dietrich.
<P>
Neben diesen haupts&auml;chlichen Eigenschaften wird die pre\box alle &uuml;blichen
Funktionen bieten, die man heute von einem Computersystem erwartet, wie
schnelle serielle und parallele Schnittstellen, einen USB-Bus und eine
EIDE-Schnittstelle f&uuml;r z.B. billige CD-ROM-Laufwerke oder zus&auml;tzliche
billige Festplatten.
<P>
Die Markteinf&uuml;hrung der pre\box ist vorgesehen f&uuml;r den Anfang des vierten
Quartals 1998. Der zu erwartende Preis f&uuml;r das pre\box-System wurde schon
ermittelt auf der Basis der derzeitigen Preise f&uuml;r PowerPC-Prozessoren.
Derzeit ist geplant, die verschiedenen Versionen der pre\box zu folgenden
empfohlenen Preisen anzubieten:
<P>
<OL><LI>
   pre\box 604/800 mit vier PPC604e-200 MHz CPUs
Empfohlener Einzelhandels-Preis:
DM 3.995,- / US$ 1995.00/ UK£ 1495.00
<P>
</LI><LI>
   pre\box 604/1000 mit vier PPC604r-250 MHz CPUs
Empfohlener Einzelhandels-Preis:
DM 4.995,- / US$ 2495.00/ UK£ 1895.00
<P>
</LI><LI>
   pre\box 604/1200 mit vier PPC604r-300 MHz CPUs
Empfohlener Einzelhandels-Preis:
DM 6.995,- / US$ 3395.00/ UK£ 2595.00
<P>
</LI><LI>
   pre\box 750/1200 mit vier PPC750-300 MHz CPUs,
jede mit 1 MByte Backside Cache
Empfohlener Einzelhandels-Preis:
DM 8.995,- / US$ 4495.00/ UK£ 3395.00
<P>
</LI></OL>
(Deutsche und UK-Preise enthalten Mehrwertsteuer, US-Preise sind ausschl.
&ouml;rtlicher Steuern, alle Preise basieren auf den derzeitigen Wechselkursen.
Technische Daten und Preise der Ger&auml;te k&ouml;nnen ohne vorherige Nachricht
ge&auml;ndert werden.)
<P>
Diese Preise gelten f&uuml;r pre\box-Systeme in einem ATX-Minitower einschl.
Maus und Tastatur sowie des AMIGA OS 3.1 und der PowerUP-Systemsoftware,
ausschl. Speicher, Festplatte und CD-ROM. F&uuml;r eine Anfangs-Konfiguration
mit Speicher, Festplatte und CD-ROM (32MB, 4GB, 24speed) mu&szlig; mit weiteren
DM 750.- (US$ 375.00 oder UK£ 275.00) gerechnet werden. "Nat&uuml;rlich k&ouml;nnen
Preis&auml;nderungen und unterschiedliche Konfigurationen/Geschwindigkeiten
durch Preisanpassungen bei PowerPC-CPUs und die Verf&uuml;gbarkeit neuer
und/oder schnellerer PowerPC-Prozessoren auftreten", f&uuml;gt Wolf Dietrich
hinzu.
<P>
Um Anwender, die PowerUP-Platinen in ihren Amigas haben, zu unterst&uuml;tzen
und sie zu ermutigen, wird PHASE 5 DIGITAL PRODUCTS ihnen betr&auml;chtliche
Nachl&auml;sse beim Kauf von pre\box-Systemen gew&auml;hren. "Wir m&ouml;chten dem
heutigen Anwender Sicherheit f&uuml;r seine Investition bieten. Offensichtlich
m&uuml;ssen Amiga-Anwender und Entwickler heute eine schnell wachsende Basis von
PowerUP-Systemen sehen, um den Entwicklungsfortschritt zu f&ouml;rdern. Wir
wollen die Anwender ermutigen, schon jetzt in die PowerPC-Technologie zu
investieren", meint Wolf Dietrich. Besitzer von PowerUP-Karten, die den
Discount beim Erwerb einer pre\box in Anspruch nehmen, brauchen die Karte
nicht zur&uuml;ckzugeben, sondern k&ouml;nnen ihren PowerUP-Amiga weiterhin als
Einzelger&auml;t verwenden oder sogar seine F&auml;higkeiten von der pre\box aus &uuml;ber
ein Verbindungssystem verwenden, welches Bestandteil der pre\box sein wird,
und mit dem im Netzwerk die Multi-Prozessor-M&ouml;glichkeiten der PowerUP-
Systemsoftware nutzbar gemacht werden k&ouml;nnen.
<P>
Mit diesem neuen Produkt-Fahrplan und einer zu erwartenden Auswahl
m&auml;chtiger und ausgezeichneter Ger&auml;tschaften unterstreicht PHASE 5 DIGITAL
PRODUCTS seine Stellung als f&uuml;hrender Neuentwickler f&uuml;r PowerPC-Hardware
und Systemsoftware auf dem Amiga-Markt. "Wir wollen auch weiterhin den
Amiga-Markt mit diesen Anstrengungen unterst&uuml;tzen", stellt Wolf Dietrich
fest. "Teil unserer Bem&uuml;hungen wird auch die Unterst&uuml;tzung der Entwickler
sein und wir strengen uns an, sie zur Entwicklung f&uuml;r PowerUP zu ermutigen.
Wir wollen alles m&ouml;gliche tun, um die Entwickler beim Amiga zu halten und
versuchen dazu, Entwickler zur&uuml;ckzuholen, die unsere Plattform verlassen
haben oder die ihre Arbeit einstellten. Derzeitig erschienene Ausgaben von
PowerUP-kompatibler Software, die von ihren Entwicklern innerhalb von nur
einigen Wochen realisiert wurden, zeigen, wie leicht und effizient
bestehende Programme portiert werden k&ouml;nnen, um die neue Prozessor- und
Leistungsgeneration zu unterst&uuml;tzen. Um die Software-Entwickler zu
&uuml;berzeugen, m&uuml;ssen wir ihnen auch das Marktpotential und die Aussichten
f&uuml;r die Zukunft zeigen, die wir ihnen bieten. Auch alle Anwender k&ouml;nnen
diese Anstrengungen unterst&uuml;tzen, indem sie sich mit ihren bevorzugten
Software-H&auml;ndlern in Verbindung setzen und PowerUP-Versionen ihrer
Programme verlangen."«
<P>
Die &Uuml;bersetzung stammt von Gernod Schomberg.
(Quelle des Originals: Phase 5 digital products)
<P>
<B>Fazit:</B>
<BR>
Nun plant also auch Phase 5 ein AMIGA-kompatibles Computersystem. Offenbar
ist man mittlerweile zu der korrekten Auffassung gelangt, da&szlig; nur ein
Computer, der auch AMIGA-OS-Kompatibilit&auml;t bietet, von der Mehrzahl der
AMIGA-Anwender akzeptiert wird. Insofern ist der Aufschub der A\Box (siehe
n&auml;chster Artikel), der aus meiner Sicht eher einer Einstellung des Projekts
gleichkommt, ein logischer Schritt. Denn was bringt den Nutzern von AMIGA-
Software die beste Hardware, wenn als Betriebssystem ein Unix-Derivat zum
Einsatz kommt? Nichts - es w&auml;re kein AMIGA mehr.
<P>
Phase 5 bekennt sich in der obigen Erkl&auml;rung eindeutig zum AMIGA OS. Egal,
ob als native Emulation oder durch Verwendung eines 68k-Prozessors, wichtig
ist, da&szlig; nahezu jedes AMIGA-OS-3.1-kompatible Programm  auf der pre\box
lauff&auml;hig ist. Nur so gelingt der &Uuml;bergang zur n&auml;chsten Generation von
AMIGA-Computern. Dabei ist es nicht unbedingt von Nachteil, wenn die
Hersteller unterschiedliche Hardware-Konzepte verfolgen, viel wichtiger
ist, da&szlig; bei jedem Rechner dasselbe Betriebssystem Verwendung findet: das
AMIGA OS.
<P>
Auch die Ger&uuml;chtek&uuml;che macht vor der pre\box nicht halt: Auf einer
Macintosh-Seite im Internet war doch glatt zu lesen, da&szlig; einer verl&auml;&szlig;lichen
Quelle zufolge bereits einige Prototypen des Rechners bei europ&auml;ischen
AMIGA-Anwendern im Einsatz seien. Wer's glaubt, kennt Phase 5 nicht...
<P>
&Uuml;berhaupt scheint die Macintosh-Welt ein Auge auf das Ger&auml;t geworfen zu
haben. Und das ist kein Zufall: Phase 5 verspricht nicht nur ein
Preis/Leistungsverh&auml;ltnis, das jedem PowerMac-Nutzer Tr&auml;nen in die Augen
schie&szlig;en l&auml;&szlig;t, nein, der Hersteller will die von Haus aus nicht Multi-
Prozessor-geeignete G3-Serie des PowerPCs (in diesem Fall den PPC750) eben
mit dieser F&auml;higkeit ausstatten - auf Softwarebasis. Eine solche L&ouml;sung ist
im Macintosh-Bereich derzeit nicht in Sicht.
<P>
Bevor jedoch die pre\box das Stadium der Serienfertigung erreicht, wird
noch viel Zeit vergehen, sicher viel mehr, als uns Phase 5 mit dem
genannten Termin "Anfang des vierten Quartals 1998" Glauben machen will.
Nicht nur aus meiner pers&ouml;nlichen Sicht k&auml;me selbst das Erscheinen der
pre\box in der ersten H&auml;lfte 1999 geradezu einem Wunder gleich. Denn wenn
Phase 5 bereits zwei Jahre ben&ouml;tigt, um ein Projekt wie PowerUp zur
Serienreife zu f&uuml;hren, wie soll es bei vergleichbaren Rahmenbedingungen
m&ouml;glich sein, einen rundherum erneuerten AMIGA innerhalb weniger Monate auf
den Markt zu bringen?
<P>

</BODY>
</HTML>
