<HTML>
<HEAD><TITLE>PowerUp-to-date</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0902.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="0904.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>PowerUp-to-date</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H3>4. Phase 5 legt Projekt A\BOX auf Eis</H3>
<P>
Gleichzeitig mit der Ank&uuml;ndigung der pre/box ver&ouml;ffentlichte Phase 5 
digital products die folgende Erkl&auml;rung:
<P>
»10. M&auml;rz 1998
<P>
MIT BLICK AUF DAS NEUE JAHRTAUSEND
<P>
Die Zukunft des A\BOX-Projekts.
<P>
Gleichlaufend mit der Ank&uuml;ndigung des pre\box-Computers, des kommenden
auf PowerPC basierenden und mit Amiga OS 3.1 kompatiblem Betriebssystem
ausger&uuml;steten Computersystems, ver&ouml;ffentlicht PHASE 5 DIGITAL PRODUCTS
auch eine Mitteilung &uuml;ber den derzeitigen Projekt-Status der A\BOX-
Entwicklung. Das wichtigste in dieser Mitteilung ist, da&szlig;, obwohl das
A\BOX-Projekt zur&uuml;ckgestellt wurde und wesentliche neue Zielvorgaben und
Termine erhielt, es nicht eingestellt wurde. "Zuallererst m&ouml;chten wir allen
Enthusiasten danken, die uns mit ihren positiven Mitteilungen und ihrem
Vertrauen im vergangenen Jahr unterst&uuml;tzt haben", sagt Wolf Dietrich,
General Manager von PHASE 5 DIGITAL PRODUCTS. "Ungl&uuml;cklicherweise k&ouml;nnen
wir diese Unterst&uuml;tzung nicht durch die Ank&uuml;ndigung w&uuml;rdigen, da&szlig; unser
A\BOX-System kurz vor der Auslieferung steht. W&auml;hrend des letzten Jahres
mu&szlig;ten wir bedeutend mehr Kapazit&auml;t in die Entwicklung von PowerUP stecken,
als wir urspr&uuml;nglich geplant hatten, und die Verz&ouml;gerung in der PowerUP-
Entwicklung ebenso wie die allgemein zur&uuml;ckhaltende Entwicklung im 
Amigamarkt erlaubten uns nicht, unsere Entwicklungspl&auml;ne f&uuml;r 1997 
aufrechtzuerhalten." 
W&auml;hrend die Gesellschaft bis weit ins Ende des letzten Jahres vorhatte, die
meisten Entwicklungskapazit&auml;ten nach Fertigstellung der letzten PowerUP-
Platinen und Zusatzger&auml;ten auf die A\BOX anzusetzen, wurde nun entschieden,
zun&auml;chst das pre\box-Computersystem zu realisieren. Dieser Schritt wurde
getan, um ein Komplett-System zur Verf&uuml;gung zu stellen, welches den Markt
und die Ums&auml;tze ausbauen kann und damit eine wirtschaftliche Grundlage f&uuml;r
die Entwicklung des A\BOX-Projekts bereitstellt, ebenso wie es die Basis 
f&uuml;r die Zunahme der Software-Entwicklung und eine wachsende Zahl von 
Anwendern bietet.
<P>
"Wir glauben, da&szlig; gen&uuml;gend Platz f&uuml;r ein Computersystem bleibt, welches
die Ideen in sich vereinigt, die wir im A\BOX-Projekt vorgezeichnet haben",
stellt Wolf Dietrich fest. "Dies ist ein Projekt, das durch Visionen 
getragen wird, die nicht veralten. Die A\BOX bleibt unser Langzeit-
Technologie-Projekt und der wichtigste Beitrag zu den technologischen 
Zielen unserer Gesellschaft. Da wir mehr Kapazit&auml;t in diese Entwicklung 
einbringen m&uuml;ssen, und da wir auch wissen, da&szlig; wir mehr Zeit brauchen, 
wollen wir aus der A\BOX ein Projekt machen, das auf das Jahr 2000 zielt - 
und wir wollen, da&szlig; es die Erwartungen der vielen Menschen erf&uuml;llt, die sie 
in einen Computer setzen, der mit dem Beginn eines neuen Jahrtausends in 
Erscheinung tritt." Inzwischen verwirklicht das pre\box-Projekt ein System, 
das mehr sein wird als nur ein einziger Schritt zur A\BOX.
<P>
Dietrich zeigt auf, da&szlig; die Entwicklung der PowerUP-Ger&auml;te ebenso wie das
neue pre\box-Computersystem Schritt f&uuml;r Schritt Technologien enthalten, die
in der A\BOX Verwendung finden werden. "Heute ist es klar, da&szlig; die A\BOX
gleich von Anfang an als Multi-Prozessor-System verwirklicht wird, eine
Technologie, die schon mit der pre\box eingef&uuml;hrt wird. Das hilft mit,
wesentliche Erfahrungen und Erkenntnisse im Entwurf der MP-Programmierung
auf der Seite der Software-Entwickler zu gewinnen und gibt eine stabile
Software-Grundlage f&uuml;r die A\BOX, wenn sie ausgeliefert wird." Wenn die
A\BOX auf den Markt kommt, werden neue Generationen von PowerPCs mit
integrierten VMX-Multimedia-Treibern den Eingangs-Standard f&uuml;r die A\BOX
darstellen, Diese Entwicklungen m&uuml;ssen auch beim Entwurf des CAIPIRINHA-
Custom-Chips in Betracht gezogen werden, welcher die Funktionen und 
Leistungen dieser Prozessoren der n&auml;chsten Generation verarbeiten k&ouml;nnen
mu&szlig;. Sp&auml;tere Versionen des pre\box-Systems werden solche CPUs schon
enthalten und damit solide Erfahrungen bei der Einrichtung der 
entsprechenden Technologie und ebenso Erfahrungen in anderen technischen 
Bereichen f&uuml;r den Entwurf A\BOX vermitteln.
<P>
PHASE 5 DIGITAL PRODUCTS wird weiterhin die neusten Technologien bewerten -
nicht nur die schon heute am Markt befindlichen, sondern auch die in der
Zukunft erscheinenden - und sie f&uuml;r die A\BOX-Entwicklung ins Auge fassen.
F&uuml;r die Entwurfs-Leistungswerte des CAIPIRINHA-Custom-Chips bedeutet das,
da&szlig; die fortgeschrittenste zur Verf&uuml;gung stehende Technologie in die 
Planung eingehen wird, wenn der CAIPIRINHA in Silizium gegossen wird. 
"W&auml;hrend wir noch vor einem Jahr &uuml;ber 0.35-Micron-Technologie und 200 MHz 
Kern-Frequenz gesprochen haben, sind heute 0.25-Micron-Technologie und 
Kern-Frequenzen von 300 MHz oder mehr die Zielpunkte; wir werden jedoch auf 
der H&ouml;he der der Entwicklung und der Verf&uuml;gbarkeit der neueren und 
schnelleren ASIC-Technologie bleiben", meint Wolf Dietrich. Weitere 
Entwicklungen und Technologien, die f&uuml;r revidierte A\BOX-Leistungen 
beobachtet und bewertet werden, enthalten (sind aber nicht beschr&auml;nkt auf):
<P>
<OL><LI>
   Breitere Datenbusse f&uuml;r die Prozessoren und m&ouml;glicherweise auch f&uuml;r
den Hauptspeicher
</LI><LI>
   H&ouml;here Taktgeschwindigkeit auf den Datenbussen zum Speicher und zu
den Prozessoren
</LI><LI>
   Verwendung neuer Speichertechnologien, wie z.B. DDR-SDRAM, ESDRAM,
SLDRAM oder alternativ RAMBUS und andere Technologien
</LI><LI>
   Lizensierung von DSP und/oder 3D-Kerne der n&auml;chsten Generation f&uuml;r
komplement&auml;re Integration in den angepa&szlig;ten Entwurf
<P>
</LI></OL>
In einem Proze&szlig; der dauernden und umfassenden Bewertung der am weitesten
fortgeschrittenen Technologien und Entwicklungsm&ouml;glichkeiten soll in der
Zukunft garantiert werden, da&szlig; innerhalb des A\BOX-Projekts ein 
Computersystem verwirklicht wird, das &uuml;berragende konzeptionelle und 
technologische Innovationen bietet, selbst im Hinblick auf die schnell 
fortschreitende Technologie der Computer-Industrie.
<P>
Zu Referenzzwecken k&ouml;nnen alle &auml;lteren A\BOX-Ank&uuml;ndigungen im A\BOX-Archiv
eingesehen werden. Bitte beachten Sie aber, da&szlig; diese &auml;lteren Dokumente
Informationen enthalten, die nicht mehr aktuell sind oder revidiert
werden m&uuml;ssen, besonders in Hinblick auf die Freigabe-Termine und die
Entwicklungsplanung, aber auch in bezug auf die technischen Informationen.«
<P>
Die &Uuml;bersetzung stammt von Gernod Schomberg.
(Quelle des Originals: Phase 5 digital products)
<P>

</BODY>
</HTML>
