<HTML>
<HEAD><TITLE>Diverse Neuigkeiten</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="1104.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="1106.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>Diverse Neuigkeiten</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H3>6. Reflections 4.2 erscheint</H3>
<P>
Auch der Raytracer Reflections kommt in diesen Tagen in einer neuen Version
auf den Markt. Der Verkaufspreis f&uuml;r die AMIGA-Version (68k und PPC)
betr&auml;gt 399 Mark (Studenten erhalten gegen Nachweis eine Erm&auml;&szlig;igung von 100
Mark), Updates von &auml;lteren Versionen kosten zwischen 89 Mark (von v4.1) und
349 Mark (von v1 oder v2). F&uuml;r 299 Mark ist ein Cross-Update von einem
anderen AMIGA-Raytracer erh&auml;ltlich.
Im folgenden sind die Verbesserungen im Vergleich zu v4.1 aufgef&uuml;hrt:
<P>
»Die neue Reflections-Version 4.2 bietet eine F&uuml;lle an neuen Funktionen und
umfangreiche neue M&ouml;glichkeiten, die dem Anwender die Erstellung
faszinierender Effekte und umfangreicher Szenen wesentlich vereinfachen.
Dar&uuml;ber hinaus wurden viele Editierfunktionen verbessert und erweitert, so
da&szlig; auch die Erstellung realistisch wirkender, komplexer Objekte einfach
von der Hand geht.
<P>
Die wichtigsten Neuerungen, die wir Ihnen im Detail vorstellen m&ouml;chten in
der &Uuml;bersicht:
<P>
<OL><LI>
   Neue Importformate
</LI><LI>
   Neue interaktive Animations- und Partikel-Effekte, Morphing
</LI><LI>
   Neue Editierfunktionen
</LI><LI>
   Neue Grundk&ouml;rper
</LI><LI>
   Interne Erweiterungen
</LI><LI>
   &Uuml;berarbeitete Hilfe, jetzt auch im HTML-Format
</LI><LI>
   Unterst&uuml;tzung f&uuml;r Software-Entwickler
<P>
</LI></OL>
Als Bonus-FreeWare haben wir der Version 4.2 zus&auml;tzlich folgende FreeWare
beigepackt:
<P>
<OL><LI>
   PlugIns, Skripts und AnimFx von den Entwicklern des REFTools! Teams
</LI><LI>
   und wie immer - vieles vieles mehr...
</LI></OL>
<P>
<B>Neue Importformate</B>
<P>
Reflections 4.2 bietet nun Import-M&ouml;glichkeiten f&uuml;r die wichtigsten 3D-
Dateiformate. Damit ist der Zugriff auf eine Vielzahl der verschiedensten
Objekte und Szenen m&ouml;glich, die z. B. im Internet ( 3D-Café,  Avalon) meist
kostenlos oder zu g&uuml;nstigen Preisen auch auf diversen CDs erh&auml;ltlich sind.
<P>
Ladbar sind:
<P>
<OL><LI>
   LightwaveTM Objektdateien
</LI><LI>
   ImagineTM Objektdateien
</LI><LI>
   VistaProTM DEMLandschaftsdateien
(siehe Zusatz-CD "DEM Collection")
</LI><LI>
   Auto-CADTM DXF und
</LI><LI>
   Cinema 4DTM Szenendateien.
<P>
</LI></OL>
Neu ist auch der DXF-Export von Modellen.
<P>
Zur einfachen Erstellung von Umgebungen, wird die neue mathematische Textur
"Landschaft" mitgeliefert.
<P>
Speziell f&uuml;r die neue Importfunktion f&uuml;r VistaProTM DEM-Dateien haben wir
die Zusatz-CD "DEM Collection" erstellt, die eine Sammlung von ca. 1000
DEM-Landschaftsdateien der USA enth&auml;lt. Alles von Alaska bis Yakima. F&uuml;r
nur 69.- DM sicher eine interessante Erweiterung.
<P>
<B>Neue interaktive Animations- und Partikel-Effekte, Morphing</B>
<P>
Im Bereich Animations- und Partikel-Effekte hat sich sehr viel getan:
<P>
<OL><LI>
   Die neue Morphing-Funktion (Formwandeln) erm&ouml;glicht das Verwandeln
beliebig vieler Objekte. Mit dieser Funktion auch verschiedene Objekt-
Typen kombiniert werden.
<P>
</LI><LI>
   Der neue AnimFX "Schweif" erzeugt einen Schweif von zerst&auml;ubenden
Partikeln hinter einem sich bewegenden Objekt. Ein Mu&szlig; f&uuml;r jede Space-
Opera!
<P>
</LI><LI>
   Der neue AnimFX "PartFall" l&auml;&szlig;t die Partikel eines beliebigen
Partikelobjekts zu Boden fallen und dort auf Wunsch wie Gummib&auml;lle
abprallen.
<P>
</LI><LI>
   Der neue AnimFX "SnowFall" l&auml;&szlig;t aus einer Wolke von Partikeln
"Schneeflocken" herabrieseln, die von Wind verweht und verwirbelt werden
k&ouml;nnen und dann auf ausgew&auml;hlten Objekten liegenbleiben.
Nat&uuml;rlich k&ouml;nnen die Flocken auch schmelzen.
<P>
</LI><LI>
   Eine weitere Partikelfunktion ist die M&ouml;glichkeit, beliebige
Dreiecksobjekte mit Partikeln zu f&uuml;llen.
<P>
</LI><LI>
   Zus&auml;tzlich neu ist das Generieren von Partikelwolken, -zylindern, -
kugeln, -tori, -w&uuml;rfeln, -spiralen wie auch Partikel-Rauch und Partikel-
Dampf.
<P>
</LI><LI>
   Das Erzeugen einer Haut aus Partikeln auf einem beliebigen
Dreiecksobjekt und das Generieren einer Schicht aus Partikeln auf einem
Objekt geh&ouml;ren ebenfalls zu den neuen F&auml;higkeiten der Version 4.2.
<P>
</LI></OL>
Alle Partikeleigenschaften sind interaktiv editierbar und bieten immense
Kombinations- und Effektm&ouml;glichkeiten!
<P>
<B>Neue Editierfunktionen</B>
<P>
Eine Reihe von Editierfunktionen sind ebenfalls neu:
<P>
<OL><LI>
   Erweiterte Funktionen zum Positionieren und Skalieren von Objekten
<P>
</LI><LI>
   Direkte Vergabe von Oberfl&auml;chenmaterialien durch "Bemalen" von Dreiecken
mit der Maus
<P>
</LI><LI>
   Ma&szlig;band zum Abmessen des Abstandes zwischen zwei Punkten
<P>
</LI><LI>
   &Uuml;berf&uuml;hrung von selektierten Punkten eines beliebigen Objekts in ein 3D-
Polygon
<P>
</LI><LI>
   Interaktives Zerknautschen von Objekten
<P>
</LI><LI>
   Automatische Erzeugung von scharfen Kanten bei Objekten mit gerundeten
Dreiecken mittels Angabe eines Winkelwertes
<P>
</LI><LI>
   Direktes Selektieren von Dreiecken durch Anklicken oder durch Ziehen der
Maus &uuml;ber mehrere Dreiecke. Auch das Selektieren von Punkten durch
Anklicken oder F&uuml;hren der Maus &uuml;ber die Punkte bei gedr&uuml;ckter Maustaste.
Der Auswahlradius am Mauszeiger ist frei einstellbar
<P>
</LI><LI>
   Zus&auml;tzliche interaktive Auswahl von Punkten anhand bestimmter
Eigenschaften
<P>
</LI><LI>
   Interaktive Auswahl von Dreiecken anhand bestimmter Materialien
<P>
</LI><LI>
   Erzeugung einer Splinehaut zwischen zwei oder mehreren 3D-Polygonen mit
frei w&auml;hlbarer Aufl&ouml;sung
<P>
</LI><LI>
   Automatische Generierung von Geb&auml;uden anhand einer Textdatei, in der
Eigenschaften wie Grundri&szlig;, Anzahl der Fenster oder T&uuml;ren pro Wand,
Mauerst&auml;rke und die Anzahl der Stockwerke definiert werden k&ouml;nnen. Die
T&uuml;ren und Fenster k&ouml;nnen wahlweise mit Rahmen und Glas erzeugt werden.
Eine ausf&uuml;hrliche Anleitung dieser Funktion finden Sie in der neuen
Reflections HTML-Hilfe.
<P>
</LI></OL>
<P>
<B>Neue Grundk&ouml;rper</B>
<P>
Ab Version 4.2 stehen die folgenden neuen Grundk&ouml;rper zur Verf&uuml;gung:
<P>
<OL><LI>
   Gefaster W&uuml;rfel:
Ein Quader mit abgeschr&auml;gten Kanten (Fasen)
<P>
</LI><LI>
   Gefaster Zylinder:
Ein Zylinder mit Fasen und optionaler W&ouml;lbung
<P>
</LI><LI>
   Fraktale Landschaft:
Ein aus Fraktalen generiertes Terrain mit ver&auml;nderbarer Topologie
<P>
</LI><LI>
   Polygonk&auml;fig:
Ein zylindrisches Grundger&uuml;st aus Polygonen
<P>
</LI><LI>
   Platonische K&ouml;rper:
Die 5 regul&auml;ren Platonischen Grundk&ouml;rper Tetraeder, Hexaeder, Oktaeder,
Dodekaeder und Ikosaeder (20 Fl&auml;chen, 30 Kanten, 12 Ecken, siehe Bild)
und als Zugaben die K&ouml;rper Kristall und Fu&szlig;ball.
Eine ausf&uuml;hrliche Beschreibung der Platonischen K&ouml;rper finden Sie auf
der Web-Site der TU Freiberg
(<A HREF="http://www.mathe.tu-freiberg.de/~hebisch/cafe/platonische.html">http://www.mathe.tu-freiberg.de/~hebisch/cafe/platonische.html</A>).
<P>
</LI></OL>
<P>
<B>Interne Erweiterungen</B>
<P>
Im internen Bereich wurden ebenfalls Erweiterungen vorgenommen.
<P>
<OL><LI>
   Die AVI-Implementation wurde erweitert. Jedes auf Ihrem System
installierte AVI-Format kann nun von REFLECTIONS gelesen und erzeugt
werden.
<P>
</LI><LI>
   Die Nutzung von AVI-Dateien als Animationstexturen ist nun ebenfalls
m&ouml;glich.
<P>
</LI><LI>
   Die Verarbeitung von Szenen mit weit &uuml;ber 1 Mio. Punkte ist nun ohne
Einschr&auml;nkung m&ouml;glich.
<P>
</LI><LI>
   Ab sofort werden Transparenzeigenschaften auch im Solidmodus
dargestellt.
<P>
</LI><LI>
   Zwei neue Antialiasing-Stufen bieten Renderergebnisse in nochmals
verbesserter Qualit&auml;t f&uuml;r h&ouml;chste Anspr&uuml;che.
<P>
</LI><LI>
   Die PlugIn-Schnittstelle wurde weiter ausgebaut, so da&szlig; Sie in naher
Zukunft mit interessanten und kosteng&uuml;nstigen Erweiterungen rechnen oder
auch eigene erstellen k&ouml;nnen. Alle neuen Animationseffekte wurden
bereits in dieser Version als PlugIns realisiert und erreichen somit ein
Vielfaches der Geschwindigkeit bisheriger Effekte.
<P>
</LI></OL>
<P>
<B>&Uuml;berarbeitete Hilfe, nun auch im HTML-Format</B>
<P>
<OL><LI>
   Die Reflections Hilfetexte wurden komplett &uuml;berarbeitet
<P>
</LI><LI>
   Eine Suchfunktion und ein Hilfe-Index erleichtern die Navigation
innerhalb der Hilfe.
<P>
</LI><LI>
   Die komplette Hilfe-Dokumentation liegt jetzt zus&auml;tzlich auch im HTML-
Format vor. Wegen langer Dateinamen ist diese momentan nur unter Windows
95 oder Windows NT 4.0 nutzbar. Eine Version mit kurzen Dateinamen ist
in Arbeit und kann demn&auml;chst kostenlos aus unserem Download-Archiv
geladen werden.
Die aktuelle Online-Version der HTML-Hilfe kann von allen
Betriebssystemen genutzt werden.
<P>
</LI></OL>
<P>
<B>Unterst&uuml;tzung f&uuml;r Software-Entwickler</B>
<P>
<OL><LI>
   Software-Entwickler k&ouml;nnen zur Erstellung eigener PlugIns eine
umfangreiche Dokumentation und Quelldateien sowie fertige
Programmger&uuml;ste anfordern. Schreiben Sie an <A HREF="mailto:ref@oberland.com">ref@oberland.com</A>!
<P>
</LI></OL>
<B>Bonus-FreeWare im Lieferumfang der Version 4.2:</B>
<P>
<OL><LI>
   Von den Entwicklern des REFTools! Teams:
<P>
</LI><LI>
   TextureMagic 3D I und TextureMagic 3D II
f&uuml;r Windows 95 und Windows NT
PlugIn mit jeweils 20 prozeduralen Texturen und einer kleinen Windows-
Hilfedatei. (nur f&uuml;r Reflections-Vollversion!)
<P>
</LI><LI>
   verschiedene n&uuml;tzliche Skripts
<P>
</LI><LI>
   interessante AnimFX-Skripte wie z. B. Plasma-Ring-Explosion oder
flackernde Lichtquelle
<P>
</LI><LI>
   PowerTools PlugIn mit Funktionen zur interaktiven Objektmanipulation
<P>
</LI></OL>
Ausf&uuml;hrliche Infos und Downloads zu diesen und anderen FreeWare-Zus&auml;tzen
finden Sie direkt auf den Seiten des  REFTools! Team
(<A HREF="http://www.duisburg.netsurf.de/~michael.krafzik/ref/reflections.html">http://www.duisburg.netsurf.de/~michael.krafzik/ref/reflections.html</A>).
<P>
<OL><LI>
   und wie immer - vieles vieles mehr...
Den kompletten Umfang des CD-Inhalts der Windows-Version finden Sie auf
einer eigenen Seite!
<P>
</LI></OL>
Anwender der Version 4.0 oder &auml;lter kommen nat&uuml;rlich auch in den Genu&szlig;
aller neuen Features der Version 4.1, die im vorigen Update (Juli 1997)
implementiert wurden.
<P>
Noch Fragen? Schreiben Sie an <A HREF="mailto:ref@oberland.com">ref@oberland.com</A>!«
<P>
(Quelle: Oberland Computer)
<P>

</BODY>
</HTML>
