<HTML>
<HEAD><TITLE>Kurzmeldungen</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<CENTER>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1><TR><TD COLSPAN=2 VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_amiga.gif" WIDTH=58 HEIGHT=20 BORDER=0>
</TD></TR>
<TR><TD VALIGN=TOP ALIGN=LEFT>
  <IMG SRC="../menu/title_aktuell.gif" WIDTH=9 HEIGHT=60 BORDER=0>
</TD><TD VALIGN=TOP ALIGN=CENTER>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=1 BGCOLOR="#000000"><TR>
<TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="../index.html"><IMG SRC="../menu/hauptseite.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="1109.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<A HREF="1300.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
</TD><TD ROWSPAN=3>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD><TD>
<A HREF="index.html"><IMG SRC="../menu/inhalt.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0100.html"><IMG SRC="../menu/vorwort.gif" BORDER=0 WIDTH=47 HEIGHT=15></A>
</TD><TD>
<A HREF="0200.html"><IMG SRC="../menu/intern.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD>
<A HREF="0300.html"><IMG SRC="../menu/gewinnspiel.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0400.html"><IMG SRC="../menu/forum.gif" BORDER=0 WIDTH=37 HEIGHT=15></A>
</TD><TD ROWSPAN=3 VALIGN=TOP>
<IMG SRC="../menu/empty.gif" BORDER=0 WIDTH=19 HEIGHT=15>
</TD></TR>

<TR><TD>
<A HREF="0500.html"><IMG SRC="../menu/workshops.gif" BORDER=0 WIDTH=62 HEIGHT=15></A>
</TD><TD>
<A HREF="0600.html"><IMG SRC="../menu/testberichte.gif" BORDER=0 WIDTH=70 HEIGHT=15></A>
</TD><TD>
<A HREF="0700.html"><IMG SRC="../menu/spieleteil.gif" BORDER=0 WIDTH=55 HEIGHT=15></A>
</TD><TD>
<A HREF="0800.html"><IMG SRC="../menu/amigainc.gif" BORDER=0 WIDTH=87 HEIGHT=15></A>
</TD><TD>
<A HREF="0900.html"><IMG SRC="../menu/poweruptodate.gif" BORDER=0 WIDTH=90 HEIGHT=15></A>
</TD>
</TR><TR>
<TD>
<A HREF="1000.html"><IMG SRC="../menu/produktankuendigungen.gif" BORDER=0 WIDTH=125 HEIGHT=15></A>
</TD><TD>
<A HREF="1100.html"><IMG SRC="../menu/diverses.gif" BORDER=0 WIDTH=50 HEIGHT=15></A>
</TD><TD>
<A HREF="1200.html"><IMG SRC="../menu/kurzmeldungen.gif" BORDER=0 WIDTH=85 HEIGHT=15></A>
</TD><TD>
<A HREF="1300.html"><IMG SRC="../menu/geruechte.gif" BORDER=0 WIDTH=52 HEIGHT=15></A>
</TD><TD>
<A HREF="1400.html"><IMG SRC="../menu/abschliessend.gif" BORDER=0 WIDTH=75 HEIGHT=15></A>
</TD></TR>
<TR><TD BGCOLOR="#EEEEEE" COLSPAN=11>
<H2 ALIGN=CENTER>Kurzmeldungen</H2>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</CENTER>

<P>

<H3>Geh&ouml;rt - notiert</H3>
<H4>AMIGA-Meldungen</H4>
<P>
<OL><LI>
   Die von Index Information geplante AMIGA-kompatible Neuentwicklung mit
Namen "BoXeR" soll gut informierten Kreisen zufolge in zwei bis drei
Monaten zum Preis von etwa 1500 US-Dollar f&uuml;r die 68060-Version auf den
Markt kommen. Genaue Preise sollen in K&uuml;rze bekanntgegeben werden.
<P>
</LI><LI>
   Anti-Gravity plant angeblich einen auf dem "BoXeR" von Index Information
basierenden AMIGA-Clone, bei dem f&uuml;r die PowerPC-Erweiterung jedoch
WarpOS statt der Softwarel&ouml;sung von Phase 5 zum Einsatz kommen soll.
<P>
</LI><LI>
   Das "AMIGA-auf-einer-Karte"-Projekt (AMIGA aktuell berichtete in Ausgabe
2/98) droht zu scheitern. Hersteller HiQ hat offenbar erst von einem
kleinen Teil der Besteller Geld erhalten, mit dem die Entwicklung
finanziert werden soll.
<P>
</LI><LI>
   Virus im Aminet: F&uuml;r etwa elf Stunden befand sich Anfang M&auml;rz eine Datei
im Aminet, die bei Aufruf die Startup-Sequence und User-Startup l&ouml;schte.
Das Programm war im Archiv util/wb/ReOrgIt.lha enthalten.
<P>
</LI><LI>
   Aminet, die zweite: Der FD-Pool beinhaltet neuerdings ein Verzeichnis, in
dem Support-Software von Phase 5 zu finden ist: biz/p5.
<P>
</LI><LI>
   Und Aminet zum dritten: Der Hauptserver in den USA ist schon wieder
ausgefallen. Diesmal hat man jedoch reagiert und einen Ersatz-Hauptserver
<A HREF="http://de.aminet.net/aminet">http://de.aminet.net/aminet</A> eingerichtet. Somit ist gew&auml;hrleistet, da&szlig;
bis zur Wiederaufnahme des Betriebs in den USA (voraussichtlich
Anfang April) weiterhin neue Software in den weltweiten FD-Pool gelangt.
<P>
</LI><LI>
   Bei Haage & Partnber sind die Videoeffekt-Software X-DVE und der
Schriften-Generator FontMachine jeweils in Version 3 erschienen.
Des weiteren ist der Raytracer Tornado 3D nun in der Version 1.5
verf&uuml;gbar, das Update ist kostenlos.
Ein kostenpflichtiges Update auf v3.1 gibt es f&uuml;r den Macintosh-Emulator
Fusion. Der Preis f&uuml;r Besitzer &auml;lterer Fusion-Versionen betr&auml;gt 30 Mark
plus 8 Mark f&uuml;r Porto und Verpackung.
<P>
</LI><LI>
   Nach langem Warten liefert Eagle Computer mittlerweile sein Linux-Paket
aus. Der Verkaufspreis betr&auml;gt 69 Mark. Eine PowerPC-Version ist in
Planung.
<P>
</LI><LI>
   Paul Nolan, Programmierer der bekannten Bildbearbeitungssoftware
Photogenics, deren Vertriebsfirma Almathera vor einer Weile in Konkurs
gegangen ist, arbeitet an einer Neuauflage des Programms.
"Photogenics Ng", so der Projektname, soll ein vollkommen neues Programm
mit einer anderen grafischen Benutzeroberfl&auml;che werden, das keinerlei
Sourcecode des Vorg&auml;ngers enth&auml;lt. N&auml;here Informationen sind auf
<A HREF="http://www.users.dircon.co.uk/~pnolan/photogenics.html">http://www.users.dircon.co.uk/~pnolan/photogenics.html</A> nachzulesen.
<P>
</LI><LI>
   Zum ersten Mal seit &uuml;ber vier Jahren findet an der Westk&uuml;ste der
Vereinigten Staaten wieder eine AMIGA-Messe statt: Die "AmiWest '98" wird
am 11. und 12. Juli in Sacramento, Kalifornien, abgehalten. Vom 10. bis
13. Juli wird zudem eine vom Industry Council for Open AMIGA (ICOA)
organisierte Entwicklerkonferenz veranstaltet. Weitere Informationen gibt
es im Internet unter <A HREF="http://www.sacc.org/amiwest/">http://www.sacc.org/amiwest/</A>
<P>
</LI><LI>
   Nachdem Netscape den Sourcecode seines Navigators voraussichtlich in
diesen Tagen ver&ouml;ffentlicht, wird die Entwicklung (mindestens) einer
AMIGA-Version immer wahrscheinlicher. Mittlerweile haben sich Software-
Programmierer zu Teams zusammengeschlossen, um die Internet-Software f&uuml;r
m&ouml;glichst viele Plattformen zu portieren. Kontaktadresse im Internet ist
<A HREF="http://www.openscape.org">http://www.openscape.org</A>
<P>
</LI><LI>
   Dagegen ist eine AMIGA-Version des WWW-Browsers "Opera" offenbar wieder
in weite Ferne ger&uuml;ckt. Obwohl sich mehrere Tausend AMIGA-Anwender beim
Hersteller Opera Software f&uuml;r eine Portierung stark gemacht hatten - von
f&uuml;nf Plattformen erhielt lediglich eine Macintosh-Portierung gr&ouml;&szlig;eren
Zuspruch -, ist man sich einem offiziellen Statement des Unternehmens
zufolge nicht sicher bez&uuml;glich der Ernsthaftigkeit des Interesses.
<P>
</LI></OL>
<H4>Von DOSen und &Auml;pfeln (sowie weitere Nicht-AMIGA-Meldungen)</H4>
<P>
<OL><LI>
   Der Hildesheimer Computerhersteller Pios vertreibt nun auch
Pentium(II)-Rechner.
<P>
</LI><LI>
   T-Online-Chef Peter Tschenkotysch informierte AMIGA aktuell schon im
Vorfeld &uuml;ber das Ergebnis einer am 29.02. dieses Jahres in Auftrag
gegebenen Untersuchung, die am 01.04. in Berlin-Bad Godesberg
ver&ouml;ffentlicht wird: Demnach ist T-Online der Online-Dienst mit dem
besten Datenschutz. Es sei f&uuml;r Hacker praktisch unm&ouml;glich, Zugangsdaten
von Kunden o.&auml;. an sich zu bringen. Die in Selbstversuchen ermittelte
Wahrscheinlichkeit liege bei ca. 1 : 1.498.000.000.000.000, so
Tschenkotysch weiter. Wem es dennoch gelinge, fremde Daten zu ermitteln,
erhalte als Anerkennung die beliebten "T-Online Power Tools".
</LI></OL>

</BODY>
</HTML>
