<html>
<head>
<!-- author = "Wolf Zimmer"   -->
 
<title>Online-Spiele!</title>
</head>
<body background="wolf1.jpg" text=black link=blue bgcolor=gray>

<p><font size="-1"> Bildschirm zu klein? Dann klicke
<a href="mm_onlinespiele.html" target="_top"> <b>hier</b></a>
&nbsp; &nbsp; &nbsp; und zur&uuml;ck zur NoCover? Dann klicke
<a href="index.html" target="_top"> <b>hier</b></a></font>
<hr></p>

<table border=0 width=100% cellpadding=6><tr><td>
<p align=center><a name="a1"></a>
<b><font color="800000" size="5">Onlinespiele</font></b></p>

<h3><b><a href="http://www.flipside.de">www.flipside.de</a></b></h3>

<p>Auf der Site von Flipside, einer Tochtergesellschaft von Havas
Interactive und ViventiNet, werden Spiele angeboten, bei denen es sogar
etwas zu gewinnen gibt. Das Spielen ist kostenlos - die Besonderheit liegt
im Belohnungssystem: F&uuml;r ihre Aktivit&auml;ten erhalten die Spieler
Flips, die sie gegen Preise eintauschen k&ouml;nnen, beispielsweise gegen
Musik-CDs oder Videospiele. Besonders beliebt sind Casual Games, also die
klassischen Brett- und Kartenspiele. Die gesamte Angebotspalette erstreckt
sich auf rund 50 Games aus den Bereichen Wort-, Karten, Brettspiele, Casino
sowie Hardcore (Action und Simulation). </p>

<p><img src="wz03.gif" width=320 heigth=240 align=left hspace=6>

Wie nebenstehend zu sehen beginnt die Website mit dem Aufzeigen der Spiele,
die derzeit gespielt werden und zwar in der Reihenfolge der momentan
h&auml;ufigsten Einschaltung, aber nach Trennung der Kategorien: Spiele
f&uuml;r den Kopf (Paar f&uuml;r Paar, Dachratten, Wordox, MasterQuiz,
Mindlogik), Brettspiele (Schach, Backgammon, Dame Kniffel u.a.),
Kartenspiele (Romme, Solitaire) und Actionspiele (Flipman, Invaders Attack,
Schneeballschlacht bumbing Metal u.a.). Anschlie&szlig;end kommen noch die
Schaltfl&auml;chem f&uuml;r Flipkonto, Fipside Foren, Flipside Chat,......,
&Uuml;bersicht, Umfragen. <br clear=all></p>

<p><img src="wz01.gif" width=320 heigth=240 align=left hspace=6>

Die eigentliche Website beginnt erst nach dem Aufz&auml;hlen der Spiele
(siehe Scrollbalken!). Die linken oberen Links sind rein
JavaScript-gesteuert und IBrowse 2.2 kommt damit nicht klar. Hier wird zu
den Spielen verzweigt, zu Community (hier werden Gedanken ausgetauscht),
zum Flipshop und zum Magazin. Aber vorher muss man sich anmelden und ein
Flipkonto einrichten lassen, damit die erspielten Flips auch gutgeschrieben
werden k&ouml;nnen. Bevor man weitergeht, kann man schon mal schauen, wie
wieviele Spieler sich derzeit hier pro Spiel tummeln. Am 09.11. um 09.30
Uhr waren 312 Spieler eingeloggt trotz Schulzeit und Kaffepause in den
B&uuml;ros. Auch ist hier zu sehen, bei welchen Spielen Flips
erwirtschaftet werden k&ouml;nnen und wo nicht. Keine Flips gibt es derzeit
f&uuml;r Schach, Dame, Reversi, Rommee, Masterquiz und andere. In
Masterquiz wird die Frage gestellt: (Auszug aus der Hp)

<blockquote>

Bist du schlau genug f&uuml;r Jauch&Co? Finde heraus, ob du das Zeug zum
Schlauberger-Million&auml;r hast. Mit dem neuen <b>Flipside
Master-Quiz-Show-Test</b> kannst du dich selber auf die Probe stellen.
Solltest du diesen Test bestehen, dann ist es Zeit f&uuml;r Jauch, Pilawa
oder Kock am Brink (wenn es denn unbedingt sein muss :-)<br>

Einfach den Link "MasterQuiz" unter Spiele f&uuml;r den Kopf klicken und dann
zeigen was du kannst. Flipside w&uuml;nscht viel Spa&szlig;.
</blockquote></p>

<p><img src="wz02.gif" align=right hspace=6>
Wer also Lust versp&uuml;rt, hier mitzumachen und zu gewinnen, der
klicke einfach hier. <br clear=all>
</p><hr width=80%>

<h3><b><a href="http://www.gcpro.de">www.gcpro.de</a></b></h3>

<p>Das <b>Spiel ohne Grenzen</b> war in der realen Welt ein Klassiker, in
der virtuellen Welt des Internets erf&auml;hrt es neue Dimensionen - Zocker
kennen keine Grenzen. </p>

<p><img src="wz04.gif" width=320 heigth=240 align=left hspace=6> Die Site
von GC-Pro bietet die M&ouml;glichkeit, schnell und einfach &uuml;ber das
Internet eine Vielzahl von Spielern mit anderen oder gegen andere zu
spielen. Bei Multiplayer-Spielen k&ouml;nnen zwei und mehr Spieler welteit
&uuml;ber das Internet in Echtzeit gegeneinander antreten. Zum Spielen
ben&ouml;tigen wir allerdings die Original-Software des Spiels, User-Daten
aus der kostenlosen GC-Pro_Anmeldung und den MatchMaker zum Spielen und
Chatten. Am 5.Dezember 2001 finden in Korea &uuml;brigens die ersten World
Cyber Games statt. Qualifizieren kann man sich &uuml;ber die
GC-Pro-Online-Liga. N&auml;here Informationen gibt es unter <b><font
color="#0000ff"> <a href="http://www.worldcybergames.org">www.worldcybergames.org</a> </font></b> wie z.B. dass 400
Spieler aus 25 L&auml;nder um die Krone der Cyber-Zocker k&auml;mpfen
werden. <br clear=all></p><hr width=80%>

<h3><b><a href="http://www.erotik-spiel.de">www.erotik-spiel.de</a></b></h3>

<p><img src="wz06.gif" width=320 heigth=240 align=left hspace=6>

Zugegeben, es gibt weitaus anspruchsvollere Spiele im Internet. Aber Hand
aufs Herz: Wer denkt beim Anblick draller Blondinen schon an hohe
Anspr&uuml;che? Bei "Gumshot" zum Beispiel haben "Moorhuhn"-erprobte
Hobbyj&auml;ger die Aufgabe, unbenutzte Kondome vom Himmel zu ballern. Und
bei "Sexslot" vermitteln Gl&uuml;ckssymbole im einarmigen Banditen viel
Spielfreude. <br clear=all></p>

<p><img src="wz05.jpg" width=320 heigth=240 align=right hspace=6>
Bevor es aber soweit ist, muss man sich schon durch fast die ganze
Website vom Orion-Versand Flensburg durcharbeiten, bis man einen
klitzekleinen Link auf die Seite der Gratisspiele findet.

<br clear=all></p><hr width=80%>

<h3><b><a href="http://www.k1010.de">www.k1010.de</a></b></h3>

<p>Diese und die folgenden Adressen stelle ich aber nun noch ganz kurz vor.
K1010 geh&ouml;rt zu den beliebtesten Spieleplattformen im Netz. Die
aufwendig und liebevoll animierten Gewinnsoiele verf&uuml;hren zu
zahlreichen Ratestunden vor dem Monitor. Bei "Klick Dich zum Gl&uuml;ck"
und der "Smiley-Show" gibt es jeden Tag tolle Preise zu gewinnen.
Spielvoraussetzung f&uuml;r alle R&auml;tselfreunde ist lediglich die
kostenlose Anmeldung. </p>

<p><font size="+1"><b><a href="http://www.gnarf.com">www.gnarf.com</a></b></font><br>
Eine Art Tamagotchi f&uuml;r Erwachsene. </p>

<p><font size="+1"><b><a href="http://www.lucasart.com">www.lucasart.com</a></b></font><br>
&Uuml;berwiegend Spiele f&uuml;r "Star Wars"-Fans. </p>

<p><font size="+1"><b><a href="http://www.jogames.com">www.jogames.com</a></b></font><br>
Shockwave-Spiele mit kurzer Ladezeit (5 bis 40 Sekunden). </p>

<p><font size="+1"><b><a href="http://home.debitel.net/user/afriedeberg">http://home.debitel.net/user/afriedeberg</a></b></font><br>
Spiele f&uuml;r die eigene Site. </p>

<p><font size="+1"><b><a href="http://www.gportal.net">www.gportal.net</a></b></font><br>
W&ouml;chentlich neue Freeware. </p>

<p><font size="+1"><b><a href="http://www.rinconada.de">www.rinconada.de</a></b></font><br>
&Uuml;ber 160 Spiele garantieren Spielspa&szlig; nonstop. </p>

<p><font size="+1"><b><a href="http://www.easportservice.com">www.easportservice.com</a></b></font><br>
Sportspiele im Abo. </p>
</td></tr></table>


<hr size=4>
</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff"><font color="#0000ff">
<td>Autor: &nbsp; <b><font color="#0000ff">Wolf Zimmer</font></b> </td>
<td>E-Mail: <b><font color="#0000ff"> <a href="mailto:wolf@wozim.de">wolf@wozim.de</a></font></b> </td>
<td>Homepage: <b><font color="#0000ff"><a href="http://www.wozim.de">http://www.wozim.de</a> </font></b>
</td></tr></table></center>
<p>Kein linker Frame? Dann klicke <a href="index.html" target="_top">
<b>hier</b></a> </p>
<br>
</body>
</html>
