<html>
<head>
<title>Interview 4</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><b><font size="+2">Amiga Arena Interview mit James Daniels<br>
dem Entwickler von Payback!</font><br>
&Uuml;bersetzt f&uuml;r die Amiga Arena von Christian B.</p>

<p><font color="#006000">Bitte stelle Dich den Lesern vor! </font><br>

Hi, ich bin James Daniels, der Gr&uuml;nder von Apex Designs. Ich bin 23
Jahre alt und lebe in der N&auml;he von Banbury in England. </p>

<p><font color="#006000">Wann hast Du begonnen, mit dem Amiga zu arbeiten?
</font><br>

Ich habe mein erstes Spiel (6-Tris) 1996 im Internet ver&ouml;ffentlicht.
Es war ein lustiges Public Domain Tetis-Spiel f&uuml;r 6 Spieler, das ich
in AMOS geschrieben hatte. <br>

Ich habe auch andere PD-Spiele wie Frontal Assault und Fire Power
herausgegeben. Tats&auml;chlich hatte ich schon ein paar Jahre davor
begonnen, mit dem Amiga zu arbeiten und viele weitere AMOS-Spiele
geschrieben, aber ehrlich gesagt waren die nicht besonders gut, weshalb ich
sie nicht ver&ouml;ffentlicht habe. Payback, das ich Ende 1998 begonnen
habe, war mein erstes C-Projekt. </p>

<p><font color="#006000">Welches Amiga-Modell besitzt Du? </font><br>

A1200T mit 603e/240, 040/25, BVision, 96 MB RAM und 45 GB Festplattenplatz.
</p>

<p><font color="#006000">Welche Betriebssystemversion l&auml;uft auf Deinem
Computer? </font><br>

OS 3.5 </p>

<p><font color="#006000">Welche Software entwickelst Du? </font><br>

Payback, Frontal Assault, Fire Power, 6-Tris. </p>

<p><font color="#006000">Kannst Du uns sagen, worum es bei Deiner Software
geht? </font><br>

In Payback spielst Du einen Verbrecher und Dein Ziel ist es, genug Geld zu
verdienen um Deinen Boss gen&uuml;gend zu beeindrucken, damit Du in das
n&auml;chste Level kommst. Der Spieler hat komplette Bewegungsfreiheit und
so ist es m&ouml;glich, das Spiel zu beenden, ohne eine einzige Mission
erf&uuml;llt zu haben. Nat&uuml;rlich unterscheiden sich die Missionen
erheblich voneinander (alles vom Diebstahl experimenteller Rakentenautos
bis zur Flucht aus dem Gef&auml;ngnis), es gibt also keinen Grund, ihnen
aus dem Weg gehen zu wollen, aber die M&ouml;glichkeit besteht. Dir steht
auch eine gro&szlig;e Waffenkammer zur Verf&uuml;gung (Flammenwerfer,
Minikanonen, Granaten und mehr) und Du bekommst Boni f&uuml;r die
Durchf&uuml;hrung besonders b&ouml;sartiger Taten -jemanden mit seinem
eigenen Auto zu &uuml;berfahren gibt Dir zum Beispiel den
&quot;Ironie-Bonus&quot;. </p>

<p><font color="#006000">Was hat in Dir die Idee geweckt, Deine Software
weiter zu entwickeln? </font><br>

Ich hatte immer vor, dem Spiel PPC-Unterst&uuml;tzung hinzuzuf&uuml;gen,
was der Hauptgrund war, die Updates zu ver&ouml;ffentlichen. Ich hatte jede
Menge Probleme, an funktionierende PPC-Hardware heranzukommen, und so
f&uuml;gte ich dem Spiel w&auml;hrend der Suche alle m&ouml;glichen neuen
Features hinzu und ver&ouml;ffentlichte mehrere Updates. </p>

<p><font color="#006000">Wie lange hat die Entwicklung bis heute gedauert?
</font><br>

Grob 3 Jahre. </p>

<p><font color="#006000">Welche Software verwendest Du? </font><br>

Haupts&auml;chlich StormC 4 GCC, PhotogenicsNG, GoldED und PPaint. </p>

<p><font color="#006000">F&uuml;r welches System entwickelst Du?
</font><br>

Amiga 68K und PPC. </p>

<p><font color="#006000">W&uuml;rdest Du den &quot;Amiga One&quot;
unterst&uuml;tzen? </font><br>

Nach meinem Verst&auml;ndnis wird jede existierende WarpOS-Software auf dem
AmigaOne problemlos laufen, darum denke ich, da&szlig; es f&uuml;r mich
keinen Grund gibt, ihn zu 'unterst&uuml;tzen'. </p>

<p><font color="#006000">Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen
erwarten? </font><br>

Update 6 wird ein paar kleine aber n&uuml;tzliche Features enthalten, wie
z.B. die M&ouml;glichkeit f&uuml;r den User, Fahrzeuge zu Custom-Karten im
Mehrspieler und Randale-Modus sowie eine Punktetabelle im Randale-Modus
hinzuzuf&uuml;gen. </p>

<p><font color="#006000">Verlierst Du nicht den Spa&szlig; und das
Interesse am Entwickeln, wenn Du die geringe Resonanz und das wenige Geld
siehst, die Du aus dem kleinen Amiga-Markt erh&auml;ltst? </font><br>

Ich erhalte jede Menge Resonanz, aber der Geldmangel ist entmutigend. Ich
kann es mir einfach nicht leisten, weiter auf dem Amiga zu entwickeln, wenn
die Verk&auml;ufe nicht anziehen. :( </p>

<p><font color="#006000">Erh&auml;ltst Du genug Resonanz auf Deine
Software? </font><br>

Ja, reichlich. </p>

<p><font color="#006000">Wann hast Du Deinen Amiga zuletzt benutzt?
</font><br>

Ich benutze ihn jetzt! </p>

<p><font color="#006000">Welche Software hast Du zuletzt f&uuml;r Deinen
Amiga gekauft? </font><br>

Die Software, die ich zuletzt gekauft habe, war StormC 4. </p>

<p><font color="#006000">Welche Software nutzt Du heute noch? </font><br>

Ich k&ouml;nnte unm&ouml;glich jedes St&uuml;ck Software auflisten, das ich
jemals benutzt habe - das sind wahrscheinlich tausende! </p>

<p><font color="#006000">Welche Soft-/Hardware hast Du vor zu kaufen?
</font><br>

Ich k&ouml;nnte einen AmigaOne kaufen, falls er Erfolg hat. </p>

<p><font color="#006000">Glaubst Du an ein Comeback von Amiga? </font><br>

Ich denke AmigaDE wird wahrscheinlich erfolgreich sein, obwohl ich da beim
AmigaOne nicht so sicher bin. Aber hoffe es doch sehr! </p>

<p><font color="#006000">Danke f&uuml;r Deine Antworten! </font></p>

<p>(c) 10/2001 Amiga Arena </b></p>

</td></tr></table>
<br>
</body>
</html>
