<html>
<head>
<title>Interview 1</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><b><font size="+2"> Amiga Arena Interview mit
Sigbj&oslash;rn Skj&aelig;ret, <br> Entwickler der mpega.library - Klon!
</font><br>

&Uuml;bersetzt f&uuml;r die Amiga Arena von Christian B. </p>


<p><font color="#006000">Bitte stelle Dich den Lesern vor! </font><br>

Hi, mein Name ist Sigbj&oslash;rn Skj&aelig;ret, aber da Ihr das
wahrscheinlich nicht mal tippen und noch weniger aussprechen k&ouml;nnt,
nennt mich einfach CISC. ;) </p>

<p><font color="#006000">Wann hast Du begonnen, mit dem Amiga zu arbeiten?
</font><br>

Seit der A500 ver&ouml;ffentlicht wurde (90/91?) und ich einfach einen
besorgen <b>mu&szlig;te</b>. ;) </p>

<p><font color="#006000">Welches Amiga-Modell besitzt Du? </font><br>

Ich besitze 2 A500er (leider nicht mehr in Gebrauch), 2 A4000er (einer ist
tot und wird f&uuml;r Ersatzteile ausgeschlachtet) und 1 A1200... Der A4000
und A1200 haben beide PPC-Karten, und der A4000 hat auch eine CVPPC,
IOBlix, Peggy+ und CV64. ;) </p>

<p><font color="#006000">Welche Betriebssystem-Version l&auml;uft auf
Deinem Computer? </font><br>

3.1 und MorphOS </p>

<p><font color="#006000">Welche Software entwickelst Du?  </font><br>

Mehrere im Laufe der Zeit: <ul>

<li> einen Haufen ARexx</li> <li>Skripten f&uuml;r diverse Sachen... </li>

<li> StreamMP3/RA </li>

<li> RAPlay </li>

<li> LAME (diverse Amiga</li> <li>Kompatibilit&auml;ten und Portierung) </li>

<li> sndfile.library </li>

<li> VCDGear</li> <li>Portierung </li>

<li> vpeg (ein Abspieler f&uuml;r meine Peggy+) </li>

<li> clip </li>

<li> waitx </li>

<li> diverse Portierungen  </li>

<li> MorphOS  </li>

<li> wahrscheinlich einen Haufen andere Sachen, die ich vergessen habe...
;) </li></ul></p>

<p><font color="#006000">Kannst Du uns sagen, worum es bei Deiner Software
geht? </font><br>

Tja, wie Ihr sehen k&ouml;nnt, habe ich einen weiten Bereich, aber meine
aktuellste Ver&ouml;ffentlichung, die ein mpega.library-Klon ist, behandelt
einige der Unzul&auml;nglichkeiten des nicht mehr aktualisierten Originals.
</p>

<p><font color="#006000">Was brachte Dich auf die Idee, Deine Software
weiter zu entwickeln? </font><br>

Ich werde weiter entwickeln solange ich es interessant (f&uuml;r immer? ;)
) und/oder n&uuml;tzlich (f&uuml;r mich reicht schon ;) ) finde... </p>

<p><font color="#006000">Wie lange hat die Entwicklung bis jetzt gedauert?
</font><br>

Nun, der mpega.library-Klon brauchte wirklich nicht so lange... es war eine
Idee, die ich lange mit mir rumgetragen habe, und schlie&szlig;lich begann
ich, daran zu arbeiten, und es war so ziemlich in ein paar Tagen
rausgepr&uuml;gelt (obwohl verteilt, da ich auch noch ein echtes Leben und
das alles habe)... ;) </p>

<p><font color="#006000">Welche Software verwendest Du? </font><br>

He, also, wirklich eine Menge Zeug, aber ich w&uuml;rde sagen, da&szlig;
ich haupts&auml;chlich MorphOS, CEd, DOpus4, Frogger, SoftCinema, AmigaAMP,
THOR, AmIRC und IBrowse verwende... </p>

<p><font color="#006000">F&uuml;r welches System entwickelst Du?
</font><br>

AmigaOS/PowerUp/MorphOS, was die Systeme sind, f&uuml;r die ich
Entwicklungswerkzeuge habe. </p>

<p><font color="#006000">W&uuml;rdest Du den "Amiga One" unterst&uuml;tzen?
</font><br>

Da ich es nicht f&uuml;r wahrscheinlich halte, da&szlig; ich einen bekommen
werde, ist es mehr eine Frage ob die mich unterst&uuml;tzen werden. ;) </p>

<p><font color="#006000">Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen
erwarten? </font><br>

&Auml;hm, Bugfixes (als wenn es da Bugs g&auml;be?! ;)) ), und
nat&uuml;rlich Updates wenn libmad aktualisiert wird... Es gibt da auch
noch ein paar andere Projekte, die bald wieder auftauchen k&ouml;nnten. ;)
&Uuml;brigens, Ich habe ein paar Berichte erhalten, da&szlig; es ein
Problem mit der 68000er-Libary und bestimmten Programmen (wie AMPlifier und
Prayer) g&auml;be. Ich dachte ich h&auml;tte das behoben, aber
offensichtlich nur f&uuml;r PPC. Ich versuche im Moment, das Problem
herauszufinden, also k&ouml;nnt Ihr bald (schon wieder) ein Update
erwarten... </p>

<p><font color="#006000">Verlierst Du nicht den Spa&szlig; und das
Interesse am Entwickeln, wenn Du die geringe Resonanz und das wenige Geld
siehst, das Du aus dem kleinen Amiga-Markt bekommst? </font><br>

Keineswegs, niemals... ich verlange nicht mal Geld... f&uuml;r mich ist
Geld nicht der Zweck... ich tu was ich tu weil ich mag, es zu tun... was
mich aber manchmal abschreckt sind Leute, die sich &uuml;ber Sachen
ausheulen, von denen sie offensichtlich keine Ahnung haben, und erwarten,
da&szlig; du ihnen zuh&ouml;rst, aber ich versuche sie zu ignorieren. </p>

<p><font color="#006000">Erh&auml;ltst Du genug Resonanz f&uuml;r Deine
Software? </font><br>

Das ist unterschiedlich, f&uuml;r manche bekomme ich gar keine, f&uuml;r
andere eine Menge... viele R&uuml;ckmeldungen sagen, da&szlig; dies und das
nicht funktioniert usw. (manche f&uuml;hren es nicht mal weiter aus), aber
manchmal gibt es ein paar nette, die mir zu einer gut ausgef&uuml;hrten
Arbeit gratulieren ... die letzten mag ich am liebsten... ;) </p>

<p><font color="#006000">Wann hast Du Deinen Amiga zuletzt benutzt?
</font><br>

Ich benutze meine/n Amiga/s t&auml;glich. </p>

<p><font color="#006000">Welche Software hast Du zuletzt f&uuml;r Deinen
Amiga gekauft? </font><br>

Hmmm, ich denke das war Shogo. </p>

<p><font color="#006000">Welche Software verwendest Du heute noch?
</font><br>

Dieselbe wie bereits oben aufgef&uuml;hrt. </p>

<p><font color="#006000">Welche Soft-/Hardware hast Du vor zu kaufen?
</font><br>

Nun, das bplan Pegasos-Board scheint ein wahrscheinlicher Kandidat zu sein.
;) </p>

<p><font color="#006000">Glaubst Du an ein Comeback des Amiga? </font><br>

Nicht wirklich als solches... nicht wie viele es sich vorstellen... ich
glaube an das verl&auml;ngerte Leben des &quot;Amiga&quot;, durch Projekte
wie MorphOS und AROS und dergleichen... </p>

<p>(c) 11/2001 Amiga Arena </b></p>

</td></tr></table>
<br>
</body>
</html>
