<html>
<head>
<title>Interview 3</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><b><font size="+2">Amiga Arena Interview mit Massimo
Tantignone, <br>
Entwickler von VPrefs! </font><br>
&Uuml;bersetzt f&uuml;r die Amiga Arena von Christian B.
</p>

<p><font color="#006000">Bitte stelle Dich den Lesern vor! </font><br>

Hallo, ich bin Massimo Tantignone. Ich wurde 1986 Amiga-User als ich einen
A1000 kaufte, einer der allerersten, die Italien erreichten. <br>

Das Ger&auml;t beeindruckte mich tief wegen seiner Grafik- und
Multitasking-F&auml;higkeiten. Ich begann sofort, Software f&uuml;r Amiga
zu entwickeln, zun&auml;chst mit dem beigelegten AmigaBASIC-Interpreter,
dann (seit 1987/88) ausschlie&szlig;lich in C. <br>

Heute liebe ich meinen Amiga zu programmieren sogar mehr als ich anfing,
aber ungl&uuml;cklicherweise finde ich immer weniger freie Zeit, es zu tun;
darum wird meine Software heutzutage so selten aktualisiert. </p>

<p><font color="#006000">Wann hast Du begonnen, mit dem Amiga zu arbeiten?
</font><br>

Wie gesagt, 1986. Ich w&uuml;nschte ich h&auml;tte einen fr&uuml;her
gehabt, aber vor diesem Datum waren sie in Italien nicht erh&auml;ltlich...
</p>

<p><font color="#006000">Welches Amiga-Modell besitzt Du? </font><br>

Einen A3000 Desktop, 1990 gekauft. Ja, dieses Weihnachten hat er seinen 11.
Geburtstag! Er funktioniert immer noch so hervorragend wie damals, als er
neu war (eigentlich besser, weil ich ihn vielf&auml;ltig aufger&uuml;stet
habe). <br>

Ich habe auch noch meinen originalen A1000, und sogar einen Ersatz-A3000
f&uuml;r den Fall, dass das Undenkbare passieren sollte :-) <br>

Weiterhin habe ich einen d'Amiga (Entwicklungsplattform von Amiga Inc. -in
Wirklichkeit nur ein PC), den ich bald &quot;upgraden&quot; werde, indem
ich AmigaOS XL darauf installieren werde. </p>

<p><font color="#006000">Welche Betriebssystem-Version l&auml;uft auf
Deinem Computer? </font><br>

OS 3.1 und OS 3.9 auf verschiedenen Partitionen. </p>

<p><font color="#006000">Welche Software entwickelst Du? </font><br>

Mein Hauptprojekt ist VisualPrefs, eine GUI-Erweiterung. Wann immer ich die
Zeit finde, entwickle ich auch FullPalette, WindowToFront, das
select.gadget und andere kleine Dienstprogramme wie TRAP. <br>

Die komplette Liste meiner Projekte kann man auf meiner Web-Seite finden.
Zus&auml;tzlich zu den genannten habe ich auch bei ein paar kleineren
Teilen von OS 3.9 und seiner ersten Boing Bag geholfen (das 1:1
Seitenverh&auml;ltnis Patch, einige Codebeitr&auml;ge zu ReAction-Klassen
und das titlebar.image). Schlie&szlig;lich erwarte ich, Software f&uuml;r
AmigaOS 4.x zu entwickeln, sobald das ver&ouml;ffentlicht wird, und
f&uuml;r das AmigaDE, das darauf l&auml;uft, sobald mir die Zeit erlaubt,
neue Projekte zu beginnen. </p>

<p><font color="#006000">Kannst Du uns sagen, worum es bei Deiner Software
geht? </font><br>

Tja, ich liebe GUI-bezogene Arbeit, also hat die meiste meiner Software mit
der Erweiterung des Amiga GUI zu tun, sowohl funktionell als auch
&auml;sthetisch. <br>

Ich schreibe auch gerne kleine System-Dienstprogramme, die ich
gew&ouml;hnlich nicht f&uuml;r das breite Publikum ver&ouml;ffentliche,
weil sie zu sehr auf meine eigenen speziellen Bed&uuml;rfnisse
feinabgestimmt sind, um f&uuml;r irgendjemand anders n&uuml;tzlich zu sein.
</p>

<p><font color="#006000">Was hat Dich darauf gebracht, Deine Software
(weiter) zu entwickeln? </font><br>

Nichts, die Idee kam einfach von selbst ;-) </p>

<p><font color="#006000">Wie lang hat die Entwicklung bis heute gedauert?
</font><br>

VisualPrefs-Entwicklung: jetzt ungef&auml;hr 5 Jahre. <br> Amiga-Entwiclung
allgemein: jetzt mehr als 15 Jahre. </p>

<p><font color="#006000">Welche Software verwendest Du? </font><br>

SAS/C, und TurboText als Texteditor. </p>

<p><font color="#006000">F&uuml;r welches System entwickelst Du?
</font><br>

Tja, f&uuml;r den Amiga nat&uuml;rlich, Was sonst? ;-) </p>

<p><font color="#006000">W&uuml;rdest Du den &quot;Amiga One&quot;
unterst&uuml;tzen? </font><br>

Sicher w&uuml;rde ich das. In der Tat werde ich es tun... </p>

<p><font color="#006000">Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen
erwarten? </font><br>

Hmmm, das w&uuml;rde ich auch gerne wissen :) </p>

<p><font color="#006000">Verlierst Du nicht den Spa&szlig; und das
Interesse am Entwickeln, wenn Du die geringe Resonanz und das wenige Geld
siehst, die Du aus dem kleinen Amiga-Markt bekommst? </font><br>

Nein, weil ich es letztendlich nicht f&uuml;r die Resonanz oder das Geld
mache, sondern weil ich das Programmieren im Allgemeinen und f&uuml;r den
Amiga im Speziellen mag. </p>

<p><font color="#006000">Bekommst Du genug Resonanz auf Deine Software?
</font><br>

Lasse es mich so ausdr&uuml;cken, wenn ich allein von
Registrierungsgeb&uuml;hren leben m&uuml;sste, w&auml;re ich schon lange
tot ;-) <br>

Mein einziges Shareware-Produkt ist VisualPrefs und daf&uuml;r habe ich in
4 Jahren weniger als 400 Registrierungen erhalten, also kannst Du sehen,
was ich meine... aber das k&uuml;mmert mich nicht wirklich, weil ich das
nicht f&uuml;r's Geld mache, sondern f&uuml;r den Spa&szlig;, den Amiga zu
programmieren. Die Resonanz ist gut, obwohl sie sich fast
ausschlie&szlig;lich aus Bugreports und Verbesserungsw&uuml;nschen
zusammensetzt. <br>

Aber ich denke, das ist normal, die Leute neigen dazu, still zu bleiben,
wenn sie beretis zufrieden sind :) </p>

<p><font color="#006000">Wann hast Du Deinen Amiga zuletzt benutzt?
</font><br>

Lass mal sehen... so ziemlich genau jetzt, w&uuml;rde ich sagen ;-) </p>

<p><font color="#006000">Welche Software hast Du zuletzt f&uuml;r Deinen
Amiga gekauft? </font><br>

AmigaOS 3.5, Magellan II, CyberGrafX 4 und die letzte Developer-CD. Ich
habe auch das Amiga SDK und das Amiga Party Pack f&uuml;r das AmigaDE
gekauft und ein paar Shareware-Programme registriert. </p>

<p><font color="#006000">Welche Software verwendest Du heute noch?
</font><br>

Nicht viel au&szlig;er den bereits erw&auml;hnten SAS/C und TurboText. <br>

Meine liebsten Internet-Anwendungen sind AWeb und Thor, obwohl ich auch
IBrowse und Voyager gekauft habe. Dann habe ich noch andere Programme wie
Personal Paint, Wordworth, TurboCalc und TypeSmith, aber die verwende ich
kaum, weil mir einfach die Zeit fehlt. <br>

Die einzigen Spiele, die ich in den letzten sechs Jahren gespielt habe: Die
Siedler und Worms :) </p>

<p><font color="#006000">Welche Hard-/Software hast Du vor zu kaufen?
</font><br>

Ich habe gerade AmigaOS XL bestellt, eine neue Tastatur und eine neue Maus
f&uuml;r meinen A3000. Ich habe vor, den AmigaOne zu kaufen, wenn er
verf&uuml;gbar ist, und jede zuk&uuml;nftige Version des AmigaOS. Falls aus
irgend einem Grund aus dem AmigaOne nichts wird (und ich glaube nicht, dass
das passieren wird), werde ich andere AmigaOS-kompatible L&ouml;sungen in
Erw&auml;gung ziehen, da ich irgendwann ein neues Ger&auml;rt kaufen werden
muss. Au&szlig;erdem, obwohl ich AmigaOS 3.9 als Beta-Tester umsonst
bekommen habe, habe ich vor, mir sobald ich kann noch ein Exemplar zu
kaufen, um dem Amiga-Markt etwas Unterst&uuml;tzung zukommen zu lassen.
</p>

<p><font color="#006000">Glaubst Du an ein Comeback von Amiga? </font><br>

Daran habe ich immer geglaubt, und ich werde jetzt sicher nicht damit
aufh&ouml;ren! (... genau wie letztes Jahr ;-) </p>

<p><font color="#006000">Danke f&uuml;r Deine Antworten! </font><br>

Wieder mal keine Ursache :)

<p>Liebe Gr&uuml;&szlig;e, <br>
Massimo Tantignone (tanti@intercom.it) <br>
[http://www.intercom.it/~amigaws] </p>


<p>(c) 11/2001 Amiga Arena </b></p>

</td></tr></table>
<br>
</body>
</html>

