<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Metal Corner by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%><p><h1><center><font color="green">Leserbrief von Kilian Servais</font></center></h1></P>
<p><b>Hi!</B><br>
Hah, als Herausgeber hat man die tolle M&#246;glichkeit direkt auf Briefe eingehen zu k&#246;nnen, als erst einen Monat warten zu m&#252;ssen. Deswegen gibt es mit diesem kleinen Brief auch gleich eine Antwort auf Deine Fragen:</P>

<p><FONT COLOR="#87CEFA"><i>Wann ist Redaktionsschluss f&#252;r die jeweils n&#228;chste NC?</i></font></P>

<p>Also, am liebsten ist es mir, wenn ich die Artikel so fr&#252;h wie m&#246;glcih erhalte. Abgatermin ist eigentlich der 25. eines jeden Monats, aber wie ich bisher festgestellt habe, trudeln auch danach noch Beitr&#228;ge ein, was prinzipiell auch nicht wieter schlimm ist. Aber klar: Je fr&#252;her, desto besser.</P>

<p><FONT COLOR="#87CEFA"><i>K&#246;nnen die Hintergrundbilder nicht alle auf die &quot;nc&quot;- Ebeneoder in eine eigene Lade verschoben werden?</i></font></P>

<p>Das w&#228;re zu &#252;berlegen, wobei ich und vor allem Wolf in den vergangenen Wochen ersteinmal gr&#252;ndlich ausgemistet haben, was an &#252;berfl&#252;ssigen Files da war. In Zukunft ist diese Idee sicherlich zu &#252;berlegen. Ich m&#246;chte allerdings auch keine alzu gro&#223;e Verschachtelung in der NC haben und es wird immer wieder User geben, die eigene Patterns benutzen und diese m&#252;ssten dann in die Hauptschublade.</P>


<p><FONT COLOR="#87CEFA"><i>Werden Diskabonenten mit einer Rechnung auch in Zukunft &quot;begl&#252;ckt&quot;?</i></font></P>

<p>Eigentlich schon, wobei es sich ja nur um einen Unkostenbeitrag handelt. Alles, was mit den Diskabo`s zusammenh&#228;ngt, sollte aber besser mit Wolfgang Haas abgekl&#228;rt werden, der das &#252;bernimmt. Die Addresse steht im <a href="impressum.html">Impressum</A>.</P>

<p><FONT COLOR="#87CEFA"><i>Wird es in Zukunft wieder die NC auf HD-Disketten geben, statt auf DD-Disketten?</i></font></P>

<p>Bei der letzten Ausgabe gab es leider Probleme mit dem HD Installerscript, aber ich hoffe, dass dieses Problem mit der aktuellen Ausagbe ad acta gelegt werden konnte. Da ich die NC gerade erst &#252;bernommen habe, kann es leider immer wieder zu so kleineren Problemen f&#252;hren, aber inwzischen l&#228;uft es ja 
auch recht gut. </P>

<p>Auf jeden Fall vielen Dank f&#252;r Deine Unterst&#252;tzung. Auch danke f&#252;r das Angebot zu helfen. Dazu sei gesagt, dass mir jeder erstmal prinzipiell dadurch am besten hilft, indem er mir Artikel schickt. Insbesondere Amiga spezifische Themen sind immer mehr als wilkommen, denn daran mangelte es in letzter 
Zeit leider ein wenig. Welche Softare setzt ihr ein? Welche Tipps gibt es da? Welche Tools aus dem Aminet sind wichtig? Solche Berichte sind immer interessant zu lesen.</P>

<p>So, das war es auch schon wieder von meiner Seite aus. Besten Dank f&#252;r alles und bis demn&#228;chst,</P>




<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
