<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
       
  <meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
       
  <meta name="author" content="Spitfire">
  <title>...:::Verkaufe:::...</title>
   
</head>
 <body background="amdwall.jpg">
<div align="Center"><br>
<br>
<br>
<h1><font color="#ffffff">Ich verkaufe</font></h1>
<br>
<div align="Left"><br>
</div>
</div>
<font color="#ffffff">Ich habe mir die Geschichte mit meinem Amiga nun lange
genug angesehen, und bin zu dem Schlu&szlig; gekommen, das er &nbsp;tot ist.<br>
Ich glaube nicht, das er es schafen wird, gegen die heutigen Rechner anzutreten.<br>
Ich habe mir nun einen AMD rechner gekauft, mit 512 MB Speicher, 80GB platte,
und einer KYRO II (f&uuml;r meinen 17 z&ouml;ller).<br>
Dazu nat&uuml;rlich noch die normalen Komponenten wie DVD, Brenner, Netzwerk,
Sound.<br>
Ich habe dieses System selbst zusammen gestellt, und daf&uuml;r knapp 2000
DM gezahlt.<br>
(Es war nicht alles neu)<br>
<br>
F&uuml;r dieses Geld h&auml;tte ich zwar meinen AMIGA aufr&uuml;sten k&ouml;nnen,
aber mal ehrlich, was h&auml;tte ich den daf&uuml;r bekommen.<br>
<br>
Damit er jetzt aber nicht bei mir in der Ecke vergammelt, habe ich mir &uuml;berlegt,
ihn zu verkaufen.<br>
<br>
Damit ihr einen &Uuml;berblick habt, habe ich hier noch mal alles aufgelistet.<br>
</font>
<h4><font color="#ffffff">Hardware:</font></h4>
<font color="#ffffff">Amiga 1200<br>
Blizzard 1240/40<br>
Comodore 1084S Monitor<br>
32 MB+2MB Ram<br>
CD-ROM<br>
2'tes Disk-laufwerk,<br>
IOBlix seriell<br>
Eingebaut im Infinitiv Tower<br>
zwei Joysticks<br>
<br>
</font>
<h4><font color="#ffffff">Software:</font></h4>
<font color="#ffffff">Amiga OS 3.5<br>
Amiga OS 3.1<br>
p.OS preRelease<br>
Personal Suite (inkl. PPaint 6.4)<br>
Digital Almanac II V1.7<br>
Maxon Cinema 4D Pro<br>
PSF 3<br>
Foundation Directors Cut<br>
Uropa&sup2;<br>
MYST<br>
sowie diverse Heft CD's und Disketten.<br>
<br>
desweiteren besitze ich noch ein 16 MB Modul, was ich ebenfalls nicht mehr
ben&ouml;tige.<br>
<br>
<br>
<br>
Zum rechner geh&ouml;ren nat&uuml;rlich auch Maus und Tastatur sowie nat&uuml;rlich
auch alle Kabel und Leitungen.<br>
<br>
Ich liefere das Original Geh&auml;use bzw. Netzteil mit, wenn ihr das m&ouml;chtet.<br>
Ich habe ehrlich gesagt keine Ahnung was der ganze Kram noch wert ist, aber
ich denke, das 600 DM doch ein angemessener Preis ist. (Allein die Blizzard
kostet noch 399,- ohne Speicher)<br>
F&uuml;r den 16 MB Speicher braucht ihr mir nur 30 DM zu geben.<br>
<br>
Alle Preise sind noch ohne Porto und verpackung.<br>
<br>
<br>
<br>
P.S.: Ich bin Zeitsoldat, und bin deswegen nur schwer zu erreichen. zumindest
am </font><font color="#ffffff">Tag. Im normalfahl bin ich aber ab 17:00
Uhr gut zu erreichen.<br>
Sollte das einmal nicht der Fall sein, so sprecht mir doch bitte auf meine
Mailbox, oder ruft sp&auml;ter nochmal an.<br>
<br>
Also, bis bald. (Ich werde nat&uuml;rlich das Leben des AMIGA's mit grossem
Interesse verfolgen.)<br>
<br>
Meine Anschrift:<br>
<br>
Uwe Brunen<br>
Friedhofstra&szlig;e 3<br>
49779 Niederlangen-Siedlung<br>
E-Mail: UweBrunen@t-onine.de oder UweBrunen@web.de<br>
Tel.: 0175/2445318<br>
</font><font color="#ffffff"><br>
</font><font color="#ffffff"><br>
</font><br>
</body>
</html>
