<html>
<head>
<!-- Author = Cord Hagen -->
<title>wie Akkus l&auml;nger leben</title>
</head>
<body background="ncb_bg3.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Strom ohne Dose,</font><br>
<font color="#000080" size="5"> - wie Akkus l&auml;nger leben</font></b></p>

<p>Was ist das? - Man begegnet Ihnen wirklich nahezu &uuml;berall und
dennoch denkt man nur bewusst dr&uuml;ber nach, wenn es eigentlich schon zu
sp&auml;t ist. - Jawoll, selbst im tiefsten Urwald versorgen uns die
kleinen Energiespender mit dem n&ouml;tigen Strom ohne dass wir nach einer
Steckdose suchen m&uuml;ssen. Die Rede ist selbstverst&auml;ndllich von den
kleinen &auml;u&szlig;erst wichtigen Akkus. </p>

<p>Im Alltag versch&ouml;nern sie uns vor allen Dingen in Handys, Walk- &amp;
Discmans, Digitalkameras, sogar in Bohrmaschinen, Staubsaugern und nahezu
allem, was zwar mobil genutzt werden m&ouml;chte, aber eben nicht ohne den
n&ouml;tigen Strom funktioniert. Erst ein Akku haucht den etlichen
Ger&auml;ten draussen &uuml;berhaupt erst Leben ein. Meistens werden diese
Ger&auml;te ohne ihren Akku vollig funktionslos und somit d&uuml;rften
Akkus zu den wichtigsten Komponenten &uuml;berhaupt im mobilen Alltag
z&auml;hlen. Und dennoch schenken viele Menschen dieser Komponente viel zu
wenig Beachtung. </p>

<h3><b> Akku-Typen - NiCd, NiMH, Li-Ion,... </b></h3>

<p>Akkus garantieren Mobilit&auml;t und Unabh&auml;ngigkeit und sind unter
anderem in Handys, Laptops, Digitalkameras, Camcordern, Walkys und PDAs im
Einsatz. Wer sich ein Ger&auml;t mit Akku kaufen m&ouml;chte, sollte sich
den verwendeten Akkutypen genauer ansehen - es gibt n&auml;mlich
qualitative aber nat&uuml;rlich auch preisliche Unterschiede. Vier
verschiedene Typen teilen sich zur Zeit haupts&auml;chlich den Markt. </p>

<p>Nickel-Cadmium abgek&uuml;rzt mit "NiCd", Nickel-Metallhydroxid
abgek&uuml;rzt mit "NiMH", die schon wesentlich besseren
Lithium-Ionen-Akkus "Li-Ion" und die Lithium-Polymer-Akkus "Li-Polymer".
Schenken wir den Akus heute doch mal ihre gerechtfertigte Bedeutung und
unsere Aufmerksamkeit und zerlegen sie virtuell in ihre Vor- und Nachteile
im Einzelnen.... </p>

<h3><b> Nickel-Cadmium </b></h3>

<p>Der Nickel-Cadmiumakku geh&ouml;rt zur &auml;lteste Akku-Generation -
abgesehen vom Bleiakku, der aber zum Gl&uuml;ck l&auml;ngst nicht mehr
verwendet wird. </p>

<p> Seine St&auml;rken sind haupts&auml;chlich eine hohe Spannungsabgabe.
Dieser Akku ist gegen &Uuml;berladen nicht anf&auml;llig. Zudem ist er weit
verbreitet, wird oft eingesetzt und liefert bei niedrigen Temperaturen mehr
Energie als das NiMH-System. Sein Hauptvorteil ist aber sein
&auml;u&szlig;erst g&uuml;nstiger Preis, weshalb er wohl auch so weit
verbreitet ist. Der Nickel-Cadmiumakku hat den ber&uuml;hmten
"Memory-Effekt". Die Speicherkapazit&auml;t des Akkus kann an Leistung und
damit an Lebensdauer also stetig verlieren, wenn er vor der
vollst&auml;ndigen Entladung wieder aufgeladen wird. Das Problem taucht
auf, weil sich der Akku den Energiestand vor dem Aufladen "merkt" und daran
die Dauer des Ladevorgangs bemisst. Der Akku hat eine niedrige
Energiedichte und ist alles andere als ein Leichtgewicht, ja sogar der
schwerste Akku-Typ und zudem giftig und daher schlecht zu entsorgen.
Sicherlich wird dieser Akkutyp bald nach und nach vom Markt verschwinden,
da die Nachteile &uuml;berwiegen. </p>


<h3><b> Nickel-Meatallhydroxid, der Akku-Typ der zweiter Generation
</b></h3>

<p>Nickel-Meatallhydroxidakkus haben eine h&ouml;here Energiedichte als
NiCd-Akkus. Im Vergleich ist eine Speicherung der doppelten Energiemenge
m&ouml;glich. Auch eine l&auml;ngere Lebenserwartung und ein
h&auml;ufigeres Aufladen ist m&ouml;glich. Zudem sind diese Akkus
umweltfreundlicher, da auf das hochgiftige Cadmium verzichtet wird. Auch
sind diese Akkus leichter als NiCd-Akkus, was die Einsatzm&ouml;glichkeiten
erweitert. Nat&uuml;rlich gibt es aber auch hier Schw&auml;chen. Dieser
Akku hat ein empfindliches Reagieren auf &Uuml;berladen. Der
"Lazy-Battery-Effekt" tritt auf, der dem Memory-Effekt vergleichbar ist.
Der Leistungsverlust tritt aber nicht so pl&ouml;tzlich, eher verlangsamt
auf. Leider hat dieser Akku zudem eine h&ouml;here Selbstentladung als ein
NiCd-Akku und ist deutlich teurer als NiCd-Akkus. </p>


<h3><b> Der Mercedes unter den Akkus dank Lithium-Ionentechnik </b></h3>

<p>Neben der Polymer-Technologie geh&ouml;ren Lithium-Ionenakkus zur
neusten und besten Akku-Generation. Sie kommen vor allem in
Spitzenprodukten zum Einsatz, wie h&ouml;herwertigen Handys, PDAs und
anderen "Energiefressern". Dieser Akkutyp bietet viele gute Vorteile. Neben
der hohen Energiedichte haben die Akkus nur wenig Verlust an Ladung. Sehr
viele Lade- und Entladezyklen sind m&ouml;glich. Lithium-Ionenakkus haben
die l&auml;ngste Lebensdauer und keinen Memory-Effekt. Lithium-Ionen-Akkus
k&ouml;nnen bei jedem Ladestand voll aufgeladen werden, ohne an Leistung zu
verlieren und sind zudem &auml;u&szlig;erst schnell wieder aufgeladen. Sie
bieten zudem doppelt so hohe Speicherkapazit&auml;t als NiMH-Akkus, haben
einen &Uuml;berladeschutz und sind angenehm bis sehr leicht. </p>


<h3><b> Der Neue - Lithium-Polymer </b></h3>

<p>Eine Neuentwicklung sind die Lithium-Polymerakkus. Dieser Akkutyp kommt
im Kunststoffgeh&auml;use daher, was ihn extrem flexibel einsetzbar macht
und sehr leicht macht. Die Leistung ist mit der Lithium-Ionen-Technologie
vergleichbar. Der Akku wird aufgrund der kleinen Ausma&szlig;e vor allem in
Kleinstger&auml;ten wie Handys und Organizer verwendet, welche ja ebenfalls
st&auml;ndig kleiner werden. </p>

<p> Dieser Akkutyp ist in beliebigen Formen gestaltbar, - sehr flache
Konstruktionen sind m&ouml;glich. Dadurch ist er platzsparend und auf die
Gr&ouml;&szlig;e und Konstruktion der jeweiligen Ger&auml;te abstimmbar.
Der Akku kann sich komplett in jede Geh&auml;useform integrieren. Zudem ist
er sehr leicht und klein. Manche Lithium-Polymer-Akkus sind nur wenige
Millimeter gro&szlig;! Er hat eine sehr hohe Energiedichte und das Laden
ist jederzeit m&ouml;glich. Es tritt kein Memory-Effekt auf und der
&Uuml;berladeschutz ist der Lithium-Ionen-Technik &auml;hnlich. </p>

<p>Auch hier gibt es prinzipiell keine Nachteile. </p>


<h3><b> Die Zukunft ist noch jung </b></h3>

<p>Auch beim Akkumarkt steckt die Entwicklung eigentlich immer noch in den
Kinderschuhen. In ein paar Jahren sollen Mini-Brennstoffzellen auf dem
Markt kommen, die mit einem Wasser- und Sauerstoffgemisch arbeiten und als
Weiterentwicklung der vorgestellten Akku-Typen gedacht sind. Dadurch werden
wieder neue Einsatzm&ouml;glichkeiten erschlossen, was widerum viel
leistungsf&auml;higere, mobile Ger&auml;te mit sich bringen wird.
V&ouml;llig neue Einsatzm&ouml;glichkeiten, die heute noch schwer
vorstellbar sind, k&ouml;nnen dann erschlossen werden. Eine
energiegeladene, mobile Zukunft wartet auf uns. </p>


<h3><b> Und so holt man mehr heraus </b></h3>

<p>Hier noch einige kleine Tipps zum Umgang mit Akkus. Vermeidet Hitze oder
starke Sonneneinstrahlung und K&auml;lte - vor allem Minusgrade. Beides
schadet jedem Akku, - egal wie teuer und gut er war. </p>

<p>Nutzt Nickel-Akkus m&ouml;glichst regelm&auml;&szlig;ig, da sich diese
sonst entladen. Ein h&auml;ufiges Aufladen verringert die Lebensdauer eines
jeden Akkus betr&auml;chtlich. Zumindest Lithium-Ionenakkus sind hier
deutlich robuster. </p>

<p>Eine Faustregel findet bei Nickel-Akkus klare Bedeutung - immer
vollst&auml;ndig laden und entladen, da sonst der ber&uuml;chtigte
Memory-Effekt eintritt. So habt Ihr wesentlich l&auml;nger etwas von Euren
Akkus, spart Geld und schont die Umwelt. &Uuml;berlegt Euch vor dem Kauf
eines mobilen Ger&auml;tes, was Ihr damit vorhabt und wie stark das neue
Ger&auml;t beansprucht werden soll und informiert Euch, welcher Akkutyp
darin zum Einsatz kommt. Das g&uuml;nstigste Ger&auml;t kann ganz schnell
teuer werden, wenn st&auml;ndig der Akku darin ausgetauscht werden muss.
Wenn man sich an wenige Grundregeln h&auml;lt, hat man erheblich
l&auml;nger etwas von seinem Akku und somit mehr Freude an den kleinen
elektrischen Helfern im mobilen Alltag. </p>



<p> Euer <br>

HIGGINS <br>

Cord Hagen </p>

</td></tr></table>
<br>
</body>
</html>
