<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Das leidige Thema Euro</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td><br>

<p align=center><font color="#000080" size="7"><b>Eurogangster</b></font></p>

<p>Der Countdown f&uuml;r die "Neue W&auml;hrung" hat in seiner Endphase
begonnen und schon tauchen in vermehrtem Ma&szlig;e die Geldhaie auf, die
Kasse machen wollen. Es h&auml;ufen sich die Angebote &uuml;ber Telefon mit
s&auml;uselnder Stimme oder per E-Mail mit dem Konsenz: "Wir bieten in
einem superg&uuml;nstigem Angebot harte Schweizer Franken gegen weiche
Euros" oder "Retten Sie sich vor der Weichw&auml;hrung, wir haben harte
Sachwerte wie Diamanten oder Immobilien". </p>

<p>So oder mindestens so &auml;hnlich versuchen derzeit windige
Gesch&auml;ftemacher die letzten DM-Reserven vom Sparbuch oder aus der
Schwarzgeldschatulle zu locken. Es gibt ein Merkmal, das bei allen
schmutzigen Gesch&auml;ften auftaucht, das ist das Angst- und Bangemachen
vor dem Euro. Und hier darf man sich von keinem, aber auch wirklich von
keinem Angebot kirre machen lassen. </p>

<p>Nun ein paar infame und schamlose Beispiele: <ul>

<li> "Vor dem Euro lieber wertbest&auml;ndige Diamanten." Die H&auml;ndler
versprechen unisono f&uuml;r die in Plastik eingeschwei&szlig;ten Steine
steigende Preise sowie R&uuml;ckkaufgarantien. Aber Vorsicht: Es sind meist
St&uuml;cke minderer Qualit&auml;t, die niemand mehr zur&uuml;cknimmt.
</li>

<li> Termingesch&auml;fte, Wetten, Optionsscheine auf den zuk&uuml;nftigen
Kurs des Euros im Vergleich zum "h&auml;rteren Franken" bzw. US-Dollar
werden momentan vermehrt angeboten. Man sollte wissen, die
Verlustm&ouml;glichkeit ist hier teilweise h&ouml;her als die Einsatzsumme.
Und man sollte noch wissen, dass die Provisionsgeb&uuml;hren oft
&uuml;berh&ouml;ht sind und bei eventuellem Gewinn sich je Vertrag bis zu
100% erh&ouml;hen k&ouml;nnen. </li>

<li> Die Citibank wirbt mit Euro-Put-Optionsscheinen mit einer Laufzeit bis
16.09.02. Aber diese Europessimisten werden entt&auml;uscht werden. Denn 80
Milliarden Mark in der T&uuml;rkei und im Ostblock werden zu Beginn 2002
gleich wieder in den Euro umgetauscht und die neue W&auml;hrung
st&auml;rken. Wo bleibt also der Gewinn? </li>

<li> Falschmeldungen in Internet-Foren sollen Euro-Skeptiker in
US-Neuemissionen bzw. in "preiswerte", weil billige Pennystocks locken.
Angeblicher Zusatzgewinn seien die W&auml;hrungsgewinne im Dollar. Hier ist
&auml;u&szlig;erste Vorsicht geboten: Meist sind es hochspekulative
Auslaufmodelle mit &uuml;berh&ouml;hten Provisionen. </li></ul>

<p>Diese Aufz&auml;hlung sollte mal f&uuml;rs erste reichen. Wer nun
trotzdem glaubt, dass er schlauer als die Euro-Haie ist und dann doch
Verlust macht, ist nun selber schuld. Wir werden noch fr&uuml;h genug in
die Falle des Falschgeldes tappen, denn es wurde nicht umsonst der
Gie&szlig;ener Transport &uuml;berfallen und die ersten Einbr&uuml;che in
die Handelsh&auml;user get&auml;tigt. Schlie&szlig;lich braucht man echte
Vorlagen f&uuml;r sie Euro-Bl&uuml;ten, die auch schon am 01.01.02
auftauchen werden. Weiterhin m&uuml;ssen noch die gro&szlig;en
Best&auml;nde der in letzter Zeit aufgetauchten DM-Bl&uuml;ten noch bis zum
28.02. unter die Leute gebracht werden. Wer also nach dem 01.01. noch DM
annimmt, weil man derzeit leider gerade keine Euro dabei hat, ist wirklich
selber schuld und sollte nicht weinen, weil die Bank daf&uuml;r keine Euros
herausr&uuml;ckt. Und wer seine DM's schnell noch nach Luxemburg,
Lichtenstein oder verschiedene Kanalinseln bringen will sollte sich nicht
wundern, wenn der Zoll nachz&auml;hlen m&ouml;chte. </p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
