<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Aktionsgemeinschaft Euro </font><br>
<font color="#000080" size="5">Newsletter www.aktion-euro.de</font></b></p>

<p>Sehr geehrter Herr Zimmer, </p>

<p>der Countdown l&auml;uft. In wenigen Wochen gibt es im gesamten Euroland
nur noch eine W&auml;hrung. Nat&uuml;rlich erwarten Sie auf unseren
Internetseiten gerade jetzt eine Menge aktueller Neuigkeiten. Einen kleinen
Vorgeschmack finden Sie in unserem Newsletter. </p>


<ol>
<li> Weihnachts&uuml;berraschungen:  <br>
   Ab 1. Dezember 2001 unbedingt hineinschauen. </li>
<li> Bargeld lacht: Euro Starter Kits ab 17. Dezember 2001. </li>
<li> Gewinnen mit dem Euro  </li>
<li> Euro in der Schule </li>
<li> Euro-interaktiv </li>
<li> Helsinki - wei&szlig;e Stadt des Nordens </li>
<li> Gesichter Europas: die aktuellen Portraits </li></ol>


<p>Viel Spa&szlig; beim Lesen w&uuml;nscht Ihnen
Ihre Aktionsgemeinschaft Euro


<p><b>+++ 1. Weihnachts&uuml;berraschungen:</b><br>
    Ab 1. Dezember 2001 unbedingt hineinschauen. +++ </p>

<p>Weihnachten n&auml;hert sich mit Riesenschritten. Wir haben f&uuml;r die
Vorweihnachtszeit jede Menge Ueberraschungen f&uuml;r Sie vorbereitet. Ob
jung oder jung geblieben, es ist f&uuml;r jeden etwas dabei: Am 1. Dezember
2001 startet der Euro-Adventskalender. Hier gibts nicht nur jeden Tag ein
neues T&uuml;rchen zu &ouml;ffnen. Wer regelm&auml;&szlig;ig reinklickt,
kann sich am 24. Dezember 2001 vielleicht &uuml;ber ein
Extra-Weihnachtsgeschenk freuen. Dazu gibts tolle e-Cards zum
Weiterversenden. </p>

<p>Der Euro-Adventskalender &ouml;ffnet seine T&uuml;ren unter der Rubrik:
Teens und Twens </p>


<p><b>+++ 2. Bargeld lacht: Euro Starter Kits ab 17. Dezember 2001 +++
</b></p>

<p>Am 17. Dezember 2001 ist es so weit: Die Banken k&ouml;nnen die ersten
Euro-M&uuml;nzen an Privatleute abgeben. <br>
Die begehrten Euro-Starter Kits enthalten 20 M&uuml;nzen im Betrag von
10,23 Euro und werden zu 20 DM geb&uuml;hrenfrei abgegeben. Wer geh&ouml;rt
zu den Ersten, die den Euro in H&auml;nden halten? Wie kommen die neuen
M&uuml;nzen an? Wir berichten aus K&ouml;ln von diesem wichtigen Ereignis.
Denn hier ist am 17. Dezember 2001 die Euro-Zelttour zu Gast. Sie
d&uuml;rfen schon jetzt gespannt sein. </p>

<p>Schauen Sie einfach unter der Rubrik: Euro aktuell nach. </p>


<p><b>+++ 3. Gewinnen mit dem Euro +++</b></p>

<p>Unsere Seiten machen auch den Nachwuchs fit f&uuml;r den Euro. Denn es
lohnt sich, &uuml;ber den Euro Bescheid zu wissen. Bei unserem Gewinnspiel
gilt das gleich doppelt. Hier k&ouml;nnen Kids und Teens ihr Euro-Wissen
unter Beweis stellen. Als Preise werden alle drei Wochen 150 Addy - Der
Euro - CDs verlost. Euro-Ingo, der freche Lots auf unseren Internetseiten
f&uuml;hrt durch das Gewinnspiel. Wer nicht gleich die richtigen Antworten
wei&szlig;, findet auf unseren Seiten nat&uuml;rlich auch alle wichtigen
Informationen. Das Gewinnspiel l&auml;uft noch bis zum Ende dieses Jahres.
</p>

<p>Wer mitmachen m&ouml;chte, findet das Gewinnspiel unter der Rubrik:
Teens und Twens. </p>


<p><b>+++ 4. Euro in der Schule +++ </b></p>

<p>Auch in der Schule ist der Euro ein hei&szlig;es Thema. Gute
Unterrichtsmaterialien sorgen dabei f&uuml;r Spa&szlig; und den richtigen
Lernerfolg. Ganz neu in unserer Rubrik: Euro in der Schule ist die
Materialsammlung In Sachen Euro. Hier finden Lehrer, Sch&uuml;ler und
andere Interessierte Anregungen, Spiele und Informationen rund um den Euro.
Die Unterlagen sind altersgerecht f&uuml;r die Sekundarstufe 1 aufbereitet
und k&ouml;nnen einfach als PDF-Datei heruntergeladen werden. <br>

Weitere Unterrichtsmaterialien sind: Flott rechnen mit dem Euro f&uuml;r
die Grundschule und das Eurospiel mit Lernkarten f&uuml;r die
Sekundarstufe. </p>

<p>Klicken Sie unter der Rubrik Teens und Twens - Euro in der Schule - an.
</p>


<p><b>+++ 5. Euro-interaktiv +++ </b></p>

<p>Wie kann man am 1. Januar 2002 in Parkautomaten bezahlen? Was wird aus
den alten D-Mark-M&uuml;nzen? Wie sicher ist unser neues Geld? Die
Antworten auf diese und viele andere Fragen geben wir Ihnen interaktiv. Auf
einen Klick k&ouml;nnen Sie sich unter der Rubrik Euro-interaktiv
interaktive Audio- und Videofiles abrufen. So erhalten Sie aktuelle
Informationen nicht nur schwarz auf wei&szlig;, sondern auch in Bild und
Ton. </p>

<p>Euro-interaktiv finden Sie in der Rubrik: Euro aktuell. </p>
 

<p><b>+++ 6. Helsinki - wei&szlig;e Stadt des Nordens +++ </b></p>

<p>Helsinki ist die sch&ouml;ne Unbekannte aus dem Norden. Nur wenige
wissen, was die n&ouml;rdlichste Hauptstadt Kontinentaleuropas alles zu
bieten hat. Zu den besonderen Attraktionen geh&ouml;ren die vielen
architektonischen Meisterwerke wie das geschlossene neoklassizistische
Stadtzentrum oder die ber&uuml;hmte Felsenkirche. Naturliebhaber kommen
ebenfalls auf ihre Kosten. Und auch das bunte kulturelle Leben der
quicklebendigen Metropole macht einen Besuch reizvoll. <br>

Lassen Sie sich von unserem Helsinki-Portrait doch einfach inspirieren. Es
lohnt sich. </p>

<p>Einfach in der Rubrik: Euro-Welt Euro-Portraits anklicken. </p>


<p><b>+++ 7. Gesichter Europas: die aktuellen Portraits +++ </b></p>

<p>Europa r&uuml;ckt immer n&auml;her zusammen. Aber kennen Sie die
Menschen, die in Br&uuml;ssel auch politisch die Weichen daf&uuml;r
stellen? Wir stellen Ihnen den Finnen Erkki Liikannen vor. Er ist seit 1999
Mitglied der Europ&auml;ischen Kommission. <br>

Sein Verantwortungsbereich: Unternehmen und Informationsgesellschaft. Lesen
Sie, welche Schwerpunkte der diplomierte Politikwissenschaftler in seinem
Amt setzt. </p>

<p>Au&szlig;erdem stellen wir Ihnen die Menschen vor, die sich in der
Euro-Kampagne f&uuml;r die neue W&auml;hrung stark machen. Neu dabei: die
ZDF-Journalistin Petra Gerster und die 2fache Olympiasiegerin Heike
Drechsler. </p>

<p>Einfach in der Rubrik: Euro-Welt Euro-Portraits anklicken. </p>

<hr>

<p>Kleiner Tipp <br>
Wenn Ihnen der Euro-Newsletter gefallen hat, leiten Sie ihn 
doch einfach an Ihre Freunde, Kollegen und Bekannte weiter!  </p>


<p>Unter www.aktion-euro.de kann man den Newsletter der
Aktionsgemeinschaft Euro abonnieren. </p>

<hr>

<p>Noch Fragen? <br>
Das Euro-B&uuml;rgertelefon erreichen Sie unter 0180 3212002 montags bis
freitags von 9:00 bis 18:00 Uhr und samstags von 10:00 bis 14:00 Uhr (12
Pfennig je angefangene 40 Sekunden) </p>

<hr>

<p>Dieser Newsletter ist ein Service von: <br>

Aktionsgemeinschaft EURO <br>
Poppelsdorfer Allee 44 <br>
53115 Bonn  </p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
