<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf ist genervt</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Gl&uuml;ck</b></font></p>

<p align=center>
<table border=3 bordercolor="#ffffff" cellpadding=8 width=80%><tr><td>
<p>----- Original Message ----- <br>
<b>From:</b><br>
<b>To:</b> <br>
<b>Sent:</b> Monday, November 26, 2001 10:40 PM<br>
<b>Subject:</b> Gl&uuml;ck<br></p>

<p>Dies sind die Worte des Dalai Lama zum Beginn des neuen Jahrtausends am
01.01.2001. Nur ein paar Sekunden sind n&ouml;tig, um sie zu lesen und
&uuml;ber sie nachzudenken. Behalte diese Nachricht nicht. Das Mantra muss
deine H&auml;nde in 96 Stunden verlassen haben. Du wirst eine angenehme
&Uuml;berraschung erleben, selbst wenn du nicht abergl&auml;ubisch bist.
</p>

<p>Empfehlungen des Dalai Lama f&uuml;r das Leben im neuen Jahrtausend <ul>

<li> Beachte, dass grosse Liebe und grosser Erfolg immer mit grossem Risiko
verbunden sind. </li>

<li> Wenn du verlierst, verliere nie die Lektion.</li>

<li> Habe stets Respekt vor dir selbst, Respekt vor anderen und
&uuml;bernimm Verantwortung f&uuml;r deine Taten.</li>

<li> Bedenke: Nicht zu bekommen, was man will, ist manchmal ein
gro&szlig;er Gl&uuml;cksfall.</li>

<li> Lerne die Regeln, damit du sie richtig brechen kannst.</li>

<li> Lasse niemals einen kleinen Disput eine grosse Freundschaft
zerst&ouml;ren.</li>

<li> Wenn du feststellst, dass du einen Fehler gemacht hast, ergreife
sofort Massnahmen, um ihn wieder gut zu machen.</li>

<li> Verbringe jeden Tag einige Zeit allein.</li>

<li> &Ouml;ffne der Ver&auml;nderung deine Arme, aber verliere dabei deine
Werte nicht aus den Augen.</li>

<li> Bedenke, dass Schweigen manchmal die beste Antwort ist.</li>

<li> Lebe ein gutes, ehrbares Leben. Wenn du &auml;lter bist und
zur&uuml;ckdenkst, wirst du es noch einmal geniessen k&ouml;nnen.</li>

<li> Eine liebevolle Atmosph&auml;re in deinem Heim ist das Fundament
f&uuml;r dein Leben.</li>

<li> In Auseinandersetzungen mit deinen Lieben sprich nur &uuml;ber die
aktuelle

Situation. Lasse die Vergangenheit ruhen.</li>

<li> Teile dein Wissen mit anderen. Dies ist eine gute M&ouml;glichkeit,
Unsterblichkeit zu erlangen.</li>

<li> Gehe sorgsam mit der Erde um. Begib dich einmal im Jahr an einen Ort,
an dem du noch nie gewesen bist.</li>

<li> Bedenke, dass die beste Beziehung die ist, in der jeder Partner den
anderen mehr liebt als braucht.</li>

<li> Messe deinen Erfolg daran, was du f&uuml;r ihn aufgeben musstest.</li>

<li> Widme dich der Liebe und dem Kochen mit ganzem Herzen.</li></ul></p>

<p>Behalte diese Nachricht nicht. Das Mantra muss deine H&auml;nde in 96
Stunden verlassen haben. Du wirst eine sehr angenehme &Uuml;berraschung
erleben (selbst wenn du nicht abergl&auml;ubisch bist). Schickst du sie an
0-4 Leute, so wird sich dein Leben leicht verbessern; 5-9 Leute, so wird
sich dein Leben zu deiner Zufriedenheit verbessern; 9-14 Leute, so wirst du
in den n&auml;chsten drei Wochen mindestens f&uuml;nf &Uuml;berraschungen
erleben; 15 und mehr Leute, so wird sich dein Leben drastisch verbessern,
und alles, was du dir je ertr&auml;umt hast, wird Formen annehmen. </p>

<p align=center><IMG alt="" hspace=0 src="st_glueck.jpg" align=baseline
border=0></p>

</td></tr></table></p><hr size=3>

<p>Dies ist eine Mail, wie ich sie in letzter Zeit h&auml;ufiger bekomme.
Das einzige "Vern&uuml;nftige", was ich hier erkennen kann, ist das Sammeln
von Mailadressen, die anschlie&szlig;end wieder mit Werbungen
zugesch&uuml;ttet werden k&ouml;nnen. In obiger Sammel-Mail war mindestens
eine Provideranschrift mit dabei, der die anderen Adressen f&uuml;r seine
Zwecke auswertet. Nun wei&szlig; ich auch, warum ich in letzter Zeit so
verlockende Angebote bekomme, gewisse Websites zu besuchen (f&uuml;r 3,63
DM/min nat&uuml;rlich). Das Bild war in der Mail auch mit dabei, nur
doppelt so gro&szlig;. </p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
