<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf war auf der Messe</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Messebesuch</b></font></p>

<p>Heute m&ouml;chte ich einen kleinen Bericht meines pers&ouml;nlichen
Eindrucks &uuml;ber den Besuch der WOA2001 abgeben. Bitte beachtet, es ist
ganz subjectiv mein ureigenster Eindruck, der mit keiner einzigen anderen
Meinung &uuml;bereinstimmen muss. </p>

<p>Jeder der zum Mediapark kam, wusste genau, wohin er sich wenden musste,
um die WOA2001 zu finden. Aber andere waren gar nicht erst gebeten, denn es
gab keinen Hinweis, kein T&auml;felchen, kein Plakatchen und noch nicht
einmal ein klitzekleiner Flyer, der in Richtung Eingang zeigte. Und dann
war beim Eintritt nur der Schriftzug Atari zu sehen und das wirkte doch
schon wie ein kleiner Schock. Die beiden jungen Damen an der Kasse
beruhigten mich aber und sagten, doch Amiga ist auch hier und zwar im
ersten Stock. Wie beruhigend, dass Amiga <i><b>auch &nbsp;</b></i> da ist.
Sollte es nicht wieder eine reine Amiga-Messe sein? Ich habe wirklich
nichts gegen Atari, die User sind beinahe noch &auml;rmer dran als wir
letzten Amiganer. Aber ein gro&szlig;er Boing-Ball h&auml;tte doch alles
viel mehr freundlicher gestaltet. </p>

<p>Die Messe war meines Erachtens doch recht gut besucht und es gab in
meinen Augen drei Highlights: Software, Hardware und Information. Wie, ihr
hattet eine andere Aufz&auml;hlung erwartet, wie etwa: AmigaOS XL, MorphOS,
G-REX? In dieser Reihenfolge fehlt aber dann die Karte ISDN-Surfer, der
AmiAtlas V6, AmigaFuture und Spiele, die ich aber nicht in Augenschein
genommen hatte. Wie ihr an diesen S&auml;tzen schon ersehen k&ouml;nnt, es
war f&uuml;r jeden etwas dabei. </p>

<p>Nachdem ich mir so alles angeschaut hatte, hier ein paar S&auml;tze
gewechselt, dort ein paar S&auml;tze gewechselt, aber auch l&auml;ngere
Gespr&auml;che gef&uuml;hrt hatte, hatte ich doch ein ganz mulmiges
Gef&uuml;hl in meiner Magengegend. Was ist das Besondere an AmigaOS XL,
MorphOS und G-REX? Um es ganz grob und total vereinfacht auszudr&uuml;cken:
Ein Amigafeeling auf PC-Basis. Und jetzt nennt mir bitte nur einen einzigen
bekloppten Programmierer, der Programme f&uuml;r PC&acute;s schreibt und
diese auch noch f&uuml;r Amiga umsetzt? Seht ihr und da sehe ich momentan
die Zukunft des Amigas. Unsere jetzigen Amigas mit oder ohne PPC laufen
noch hervorragend mit dem was wir schon l&auml;ngst haben, aber Neues ist
nicht mehr in Sicht. Was ist, wenn unsere Maschinen den Geist aufgeben und
ersetzt werden m&uuml;ssen? Nach der jetzigen Lage kommen dann die Produkte
von Haage&Partner und die Umbauten von bplan zum Tragen. </p>

<p>Neues nicht in Sicht? Falsch. Individual Computers, sprich Jens
Sch&ouml;nfeld, hat sich weiterhin den beiden Amigaports gewidmet und nun
ISDN-Surfer Zorro vorgestellt. Eine Karte f&uuml;r diejenigen, die einen
ISDN Anschluss haben, aber nicht das T-DSL nutzen (daf&uuml;r wird dann
eine Netzwerkkarte genommen). Mit dem ISDN-Surfer geht man auf vollkommen
digitalem Weg auf den Datenhighway, denn eine ISDN-Karte erlaubt den
direkten Anschluss an den NTBA der Telefongesellschaft. Es ist kein Modem,
keine Telefonanlage, und keinen Terminal-Adapter im Signalweg, der die
Performance bremsen k&ouml;nnte. Der Amiga ist digital mit der
Vermittlungsstelle verbunden! Detailliertere Angaben m&ouml;chte ich nun
hier nicht machen, am besten ist es, direkt auf die Hompage <b> <font
color="#0000ff"> www.jschoenfeld.com </font></b> zu gehen, und alles im
Einzelnen nachzulesen. An neuer Software wurde ganz gro&szlig; der AmiAtlas
V6 angeboten, jetzt von Gerd Frank erstellt (vormals A.Regul). Ich hoffe
nur, dass er keinen Schiffbruch erleidet, denn gegen die Routenersteller im
Internet muss er dann schon etwas herausragendes vorzeigen. Diese
Informationen fehlen leider bisher. Und warum sollte ich 109,- DM ausgeben,
wenn ich im Jahr ein bis zweimal eine Route errechnet haben muss? </p>

<p>Seit 1991 gehe ich zur Messe nach K&ouml;ln (die WOC&acute;s in
Frankfiurt und der einmalige Ausrutscher in Neuss rechne ich hier nicht
mit) und das jeweils immer am ersten Tag und wenn man dieses Bild dieses
Massenandrangs noch vor Augen hat, ist es fast unverst&auml;ndlich, was aus
dem Amiga geworden ist. Da ich noch alle alten Messekataloge habe (und
dieses Jahr gab es <b>keinen</b>), werde ich versuchen, einen
R&uuml;ckblick zu halten, der selbstverst&auml;ndlich rein subjektiv
ausfallen muss. Dabei werde ich wohl vieles vergessen zu erw&auml;hnen und
manches ganz au&szlig;en vorlassen, wie das Beschreiben der jeweils
aktuellen Spiele. </p>

<p><b><font color="#000080" size=+1>1991:</font></b><br> <b>Amiga &acute;91
K&ouml;ln</b>. Vier Hallen (Halle 5, 6, 7 und 8) waren so voller
St&auml;nde, dass es unheimlich schwer war, sich in den schmalen
G&auml;ngen zu bewegen und sich durch die Menschenmassen zu dr&auml;ngeln.
Commodore hatte einen sehr gro&szlig;en Stand, sie verkauften aber auch
wahnsinnig viel: der neue A500+, das neue OS 2.0 mit ROM-Baustein f&uuml;r
A500 und A2000 und f&uuml;r Gespr&auml;che blieb fast keine Zeit. Andere
Firmen boten Beschleunigerkarten mit dem 68040 f&uuml;r den 2000er f&uuml;r
dreieinhalb Tausend Mark an und wenn ich mich jetzt nicht t&auml;usche, gab
es auch schon die ersten 24-bit Grafikkarten zu sehen. Beim
Durchbl&auml;ttern der alten Quittungs-Ordner stellte ich fest, dass ich
mir damals auf der Messe das ART-Scan und DPaint IV gekauft hatte. Wie doch
die Zeit vergeht. </p>

<p><b><font color="#000080" size=+1>1992:</font></b><br> <b>Amiga &acute;92
K&ouml;ln</b> entwickelte sich besser, als im Vorfeld bef&uuml;rchtet,
schlie&szlig;lich gab es ja kurz vorher in Frankfurt die WOC (World of
Commodore) und dort sollte eigentlich der Ma&szlig;stab gesetzt werden,
Vorstellung der neuen A600, A1200 und A4000. Trotzdem erschien auch hier in
K&ouml;ln das K&uuml;rzel WOC in Verbindung mit Amiga 92. Und der MS-DOS
Bereich war schon etwas gr&ouml;&szlig;er gegen&uuml;ber dem letzten Jahr.
Pers&ouml;nlich fasziniert war ich von der Pr&auml;sentation des
Malprogramms &quot;Brillance&quot;, das speziell f&uuml;r die AA entwickelt
wurde. Meine Erinnerungen weisen doch schon L&uuml;cken auf. In K&ouml;ln
wurde zus&auml;tzlich zu den neuen Amigas auch schon der 68060 vorgestellt
und ein Schwerpunkt war der Streit zwischen Modula2, AMOS, Oberon und Maxon
C++. An der Front Textverarbeitung wollte sich AmiWrite gegen Beckertext3
durchsetzen. Auch gab es schon die erste ISDN-Karte f&uuml;r den A3000 und
A4000. Sehr stark ausgepr&auml;gt war auch dieses Jahr wieder die
Spielefront, nur da hatte ich schon damals keine Ambitionen und so bleibt
bei meinem Res&uuml;mee diese Sparte unber&uuml;hrt. </p>

<p><b><font color="#000080" size=+1>1993:</font></b><br> <b>Amiga &acute;93
K&ouml;ln (WOC) und Computer 93</b>. Es gab sogar drei Embleme,
n&auml;mlich noch das von World of Games. Das erste was auffiel, war, dass
doch nicht mehr soviele Aussteller wie in den Vorjahren da waren, auch der
Platz an Hallenfl&auml;che war extrem kleiner geworden. An Neuheiten war
der CD32 zu kaufen, aber der Messeschwerpunkt lag in diesem Jahr auf dem
Grafik- und Videosektor. Auch APC&TCP war erstmals vertreten und stellte
neben der Datenbank Databench auch das &quot;werde
Bundeskanzler&quot;-Spiel vor. Die PD-Serien fanden rei&szlig;enden Absatz
und es war sehr schwer, an den Stand (Tisch) &uuml;berhaupt heranzukommen,
da doch eine hohe Frequentierung vorlag. IBM war mit einem gro&szlig;en
Stand vertreten und versuchte OS/2 bekannt zu machen. </p>

<p><b><font color="#000080" size=+1>1994:</font></b><br> <b>Computer 94,
Amiga &acute;94 (WOC), World of Games</b>. Der Besucherstrom hatte wieder
zugelegt, schlie&szlig;lich wollte wohl jeder wissen, was ist wirklich mit
Commodore los. Und es war das Jahr, an dem ich meine ersten CD&acute;s
kaufte, sogar mit Autogramm von Fred Fish. Die Aminet3 und 4 gab es
f&uuml;r je 19,- DM, Preise, die man sich ein halbes Jahr vorher noch nicht
vorstellen konnte. Zus&auml;tzlich erwarb ich aber doch sehr viel Software,
wie Maxon Cinema 4D, FinalWriter, FinalCopy, DirOpus, TurboPrint,
verschiedene Grafiksammlungen und und und. Dieses Jahr war echt teuer.
Nat&uuml;rlich schaute ich mir auch den RISC 600 von Acorn an, konnte mich
aber doch nicht daf&uuml;r begeistern. </p>

<p><b><font color="#000080" size=+1>1995:</font></b><br> <b>Computer 95</b>
(dieses Mal ohne weitere Namens-Zus&auml;tze), aber Halle 10 und 11 waren
geblieben. Immer noch hie&szlig; es die gr&ouml;&szlig;te Amiga-Messe, aber
die Gro&szlig;zahl der DOS-St&auml;nde war nicht mehr zu &uuml;bersehen.
Aber was waren meine Highlights? Ich wei&szlig; es einfach nicht mehr. Ach
doch, es war das Jahr, wo ich beim Einkauf am meisten handeln konnte und
die meisten Rabatte bekam. Und es kommt mir im R&uuml;ckblick so vor, dass
in diesem Jahr viel Prominenz aus Politik, Wirtschaft und Entertainment
(RTL-Nacht) aufgefahren wurde. Welche Anstrengung diese Messe f&uuml;r die
Aussteller bedeutete, sieht man daran, dass Village Tronik sich einen
Rolls-Royce als Besprechungsraum in die Halle stellte. Und Petro
Tyschtschenko versprach den Amiga der Zukunft mit Power-PC-Processor in
absehbarer Zeit. </p>

<p><b><font color="#000080" size=+1>1996:</font></b><br> <b>Computer
96</b>, die gro&szlig;e Consumermesse in Halle 10 (Halle 11 war kurzfristig
weggefallen). Dieses Mal aber mit etwas weniger DOS-Anteil und diese an den
W&auml;nden der Halle entlang. Das war das Jahr, als ich mir die PicassoIV
kaufte. Ansonsten sah es mit Hardware gar nicht mehr so &uuml;ppig aus. Der
Konkurs von Commodore machte sich doch bemerkbar. Aber es waren die ersten
Karten mit PPC-Prozessoren bei Phase-5 zu sehen. </p>

<p><b><font color="#000080" size=+1>1997:</font></b><br> <b>Computer
97</b>, die weltgr&ouml;&szlig;te Amigamesse. Die erste Neuigkeit am
zweiten Tag: Amiga geh&ouml;rt jetzt Gateway 2000. Und zum zweiten: Es
wurde das OS 3.5 f&uuml;r das Fr&uuml;hjahr angek&uuml;ndigt. Auf der Messe
stellte proDAT das pOS, DCE den Amiga 5000 vor und bei Micronik gab es den
A1500 PPC zu sehen. Ebenfalls neu war AmigaFuture (11), Gekauft habe ich es
aber nicht, der Zusatz: &quot;Supergeile Vollversion Trapped&quot;
stie&szlig; mich vom Wortlaut ab. Daf&uuml;r legte ich mir aber ArtEffect
2.5 und DirOpus Magellan zu. </p>

<p><b><font color="#000080" size=+1>1998:</font></b><br> <b>Computer
98</b>. Was es nicht gab: OS 3.5 und alle hatten doch so gehofft, dass
etwas daraus wird. Daf&uuml;r machte der DAUG (selbsternanntes Sprachrohr
aller Computerclubs) sehr viel Wirbel und verteilte zigtausende Flyers zum
Unterschreiben. Und was ist daraus geworden? Im Gegensatz zu den bisherigen
Jahren konnte man ab Nachmittag an den meisten St&auml;nden ausgedehnte
Gespr&auml;che f&uuml;hren. Highlights? Entschuldigt bitte, aber mir sind
keine aufgefallen. Meine einzige gr&ouml;&szlig;ere Ausgabe war der
Abschluss eines Abos f&uuml;r amigaOS. </p>

<p><b><font color="#000080" size=+1>1999:</font></b><br> <b>Computer 99,
Home Electronics World 99</b>. OS 3.5 war doch nun da. Ansonsten gab es
bestimmt manch Neues, nur ich habe es leider nicht gesehen. Das Einzige,
was ich mir erworben hatte, war ScanQuix 5 und was mir gefallen hatte, war
das ReproStudioNG von Titan Computer. </p>

<p><b><font color="#000080" size=+1>2000:</font></b><br> <b>WOA 2000</b>,
World of Amiga, die erste reine Amigamesse seit Jahren. Und nicht mehr auf
dem K&ouml;lner Messegel&auml;nde. sondern in dem neu errichteten Mediapark
(fr&uuml;her einmal ein G&uuml;terbahnhofsgel&auml;nde). Im Mittelpunkt
stand wohl AmigaOS 3.9 und die wohlformulierten Statements von Fleecy Moss
ohne etwas Neues zu verraten. Nichts zu sehen war irgendetwas von AmigaOne
oder AmigaDE. Das fand ich sehr schade. Ansonsten hatte ich den Eindruck,
dass &uuml;berall Ausverkauf ge&uuml;bt wurde. </p>


</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
