<html>
<head>
<title>noch ein Artikel von Cord</title>
</head>
<body background="ncb_bg3.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>
<p align=center><font color="#000080"
size="7"><b>M&auml;rchen</b></font></p>

<p> Hier stehen die Inhaltsangaben verschiedener M&auml;rchen! <br>
Nenne den jeweiligen Titel! </p>

<p>1. Ein gekidnapptes P&auml;rchen befreit sich selbst durch Mord an der
Entf&uuml;hrerin und bereichert sich dann unrechtm&auml;&szlig;ig. </p>

<p>2 Eine norddeutsche Beatband erk&auml;mpft sich ein Ferienhaus in
idyllischer, waldreicher Lage. </p>

<p>3. Ein weiblicher Teenager erleidet einen Arbeitsunfall und f&auml;llt
ins Koma. Sie wird von einem wohlhabenden Junggesellen durch Mund zu
Mundbeatmung wieder gerettet. </p>

<p>4. Ein animalischer Verbrecher vernichtet 85,7% des Jungviehbestandes und
kann erst durch Einsatz wertvollen Stra&szlig;enbaumaterials besiegt
werden. </p>

<p>5. Eine flei&szlig;ige Arbeiterkolonne aus einer rheinischen
Gro&szlig;stadt f&auml;llt in der Nachtschicht einer Sabotage zum Opfer und
stellt daraufhin jegliche ehrenamtliche T&auml;tigkeit ein. </p>

<p>6. Ein esoterisch, interessierter Teenager ist einer wohlhabenden
Rentnerin behilflich und kleidet sich schlie&szlig;lich in Edelmetall. </p>

<p>7. Eine junge, ledige S&auml;ngerin bewohnt ein Hochhaus und hebt mit
Hilfe von Spezialstricken ihre Lebensfreude. </p>

<p>8. Eine adelige Hausangestellte mit extrem kleiner Schuhgr&ouml;&szlig;e
arbeitet nachts an ihrer Karriere. </p>

<p>9. Mehrere Handwerkers&ouml;hne erm&ouml;glichen ihrem cholerischen Vater
ein sorgenfreies Rentnerdasein. </p>

<p>10. Ein kleinw&uuml;chsiger Hippie stellt &uuml;berh&ouml;hte
Lohnforderungen und besteht darauf, anonym bleiben zu k&ouml;nnen. </p>

<p>11. Eine Jugendliche, mit s&uuml;dl&auml;ndischem Aussehen zieht in eine
l&auml;ndliche Wohngemeinschaft fernab der Zivilisation. Alsbald werden
drei Mordanschl&auml;ge auf sie ver&uuml;bt, die sie letztendlich doch
&uuml;berlebt. </p>

<p>12. Bei der Aus&uuml;bung einer Dienstt&auml;tigkeit eilt ein
tatkr&auml;ftiger Mann in letzter Sekunde einer Rentnerin zu Hilfe und wird
mit selbsterzeugten Bioprodukten belohnt. </p>

<p>13. Hilfsbereiter Taucher wird schamlos ausgenutzt und verliert nach
brutalem Gemetzel seine Gestalt. </p>

<p>14. Ein modebewu&szlig;ter Aristokrat ordert bei
Nachwuchs-Modesch&ouml;pfern seine Kollektion f&uuml;r die kommende Saison
und ist mit Erledigung des Millionenauftrages sehr unzufrieden. </p>

<p>15. Die sozialen Spannungen innerhalb der Familie machen einen Vegetarier
zum gesellschaftlichen Au&szlig;enseiter, der erst nach der Pubert&auml;t
rehabilitiert wird. </p>

<p>Alles richtig erraten? Falls Fragen sind, einfach <a
href="st_maerchen1.html"> nachschauen</a> </p>.

<p>Ein Internetfundst&uuml;ck <br>
Euer HIGGINS <br>
Cord Hagen </p>

</td></tr></table>
<br>
</body>
</html>
