<html>
<head>
<title>Das hat Cord geschickt</title>
</head>
<body background="ncb_bg3.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="6"><b>Philosophische
Priorit&auml;ten</b></font></p>


<p>Hallo Ihr, <br>
folgende Story fand ich ganz nett und deswegen k&ouml;nnt Ihr sie hier nun
auch lesen.... </p>

<p> &nbsp; </p>

<p>Ein Philosophieprofessor stand vor seinen Studenten und hatte ein paar
Dinge vor sich liegen. Als der Unterricht begann nahm er ein gro&szlig;es
leeres Mayonnaiseglas und f&uuml;llte es bis zum Rand mit gro&szlig;en
Steinen. </p>

<p>Anschlie&szlig;end fragte er seine Studenten ob das Glas voll sei? Sie
stimmten ihm zu. Der Professor nahm eine Schachtel mit Kieselsteinen und
sch&uuml;ttete sie in das Glas und sch&uuml;ttelte es leicht. Die
Kieselsteine rollten nat&uuml;rlich in die Zwischenr&auml;ume der
gr&ouml;&szlig;eren Steine. Dann fragte er seine Studenten erneut ob das
Glas jetzt voll sei? Sie stimmten wieder zu und lachten. </p>

<p>Der Professor seinerseits nahm eine Schachtel mit Sand und
sch&uuml;ttete ihn in das Glas. Nat&uuml;rlich f&uuml;llte der Sand die
letzten Zwischenr&auml;ume im Glas aus. </p>

<p>&acute;Nun&acute;, sagte der Professor zu seinen Studenten, &acute;ich
m&ouml;chte dass sie erkennen, dass dieses Glas wie ihr Leben ist! Die
Steine sind die wichtigen Dinge im Leben: ihre Familie, ihr Partner, ihre
Gesundheit, ihre Kinder. Dinge, die - wenn alles andere wegfiele und nur sie
&uuml;brig blieben - ihr Leben immer noch erf&uuml;llen w&uuml;rden. </p>

<p>Die Kieselsteine sind andere, weniger wichtige Dinge wie z.B. ihre
Arbeit, ihre Wohnung, ihr Haus oder ihr Auto. Der Sand symbolisiert die
ganz kleinen Dinge im Leben. Wenn sie den Sand zuerst in das Glas
f&uuml;llen, bleibt kein Raum f&uuml;r die Kieselsteine oder die
gro&szlig;en Steine. </p>

<p>So ist es auch in ihrem Leben, wenn sie all ihre Energie f&uuml;r die
kleinen Dinge in ihrem Leben aufwenden, haben sie f&uuml;r die gro&szlig;en
keine mehr. Achten sie auf die wichtigen Dinge, nehmen sie sich Zeit
f&uuml;r ihre Kinder oder ihren Partner, achten sie auf ihre Gesundheit. Es
verbleibt noch genug Zeit f&uuml;r Arbeit, Haushalt, Partys usw. </p>

<p>Achten sie zuerst auf die gro&szlig;en Steine, sie sind es die wirklich
z&auml;hlen. Der Rest ist nur Sand.&acute; </p>

<p>Nach dem Unterricht nahm einer der Studenten das Glas mit den
gro&szlig;en Steinen, den Kieseln und dem Sand - bei dem mittlerweile sogar
der Professor zustimmte, dass es voll war - und sch&uuml;ttete ein Glas
Bier hinein. Das Bier f&uuml;llte den noch verbliebenen Raum im Glas aus;
dann war es wirklich voll. </p>

<p>Die Moral von der Geschichte ........ egal wie erf&uuml;llt ihr Leben
ist, es ist immer noch Platz f&uuml;r ein Bier! </p>


<p>Aufgeschnappt im Internet <br>
Euer Higgins <br>
Cord Hagen </p>

</td></tr></table>
<br>
</body>
</html>
