<html>
<head>
<!-- author = "Wolf Zimmer"   -->
 
<title>Die neue Wolf-INFO ist da!</title>
</head>
<body background="wolf1.jpg" text=black link=blue bgcolor=gray>
<a name="top"></a>  

<table border="0" cellpadding="5" width=100%>
<tr><td colspan=2>
<font size="-1"> Bildschirm zu klein? Dann klicke
<a href="st_wolfinfo.html" target="_top"> <b>hier</b></a>
&nbsp; &nbsp; &nbsp; und zur&uuml;ck zur NoCover? Dann klicke
<a href="index.html" target="_top"> <b>hier</b></a></font>
</td></tr>
<tr><td width=260 align=center>
<img src="wolf1.gif" border=0 width=230 heigth=240
alt="mein Logo" align=left></td>
<td><ul><font color=blue><b>I N H A L T </font></b>
<li> <a href="#a1">Eurogefahren </a></li>
<li> <a href="#a2">Xbox </a></li>
<li> <a href="#a3">Parsec </a></li>
<li> <a href="#a4">Harry Potter </a></li>
<li> <a href="#a5">Digitale Dekade </a></li>
<li> <a href="#a6"> Feedback</a></li>
</ul></td>
</tr></table><br clear=all>
<hr>
<table border=0 width=100% cellpadding=6><tr><td>
<p align=center><a name="a1"></a>
<b><font color="800000" size="5">Eurogefahren</font></b></p>

<p>Achtung: Hier lauern Gefahren</p>

<p><font size="+1"><b>Ungebetener Kontakt</b></font><br>

Wenn uns Unbekannte am Telefon oder per E-Mail ungebetene Ratschl&auml;ge
geben: <b>Finger weg!</b> </p>

<p><font size="+1"><b>Zeitdruck</b></font><br>

Wenn uns Anlagenhaie mit Spr&uuml;chen wie &quot;schnelle
Gewinnchance&quot; oder &quot;besondere Situation vor der
Euro-Einf&uuml;hrung&quot; unter Kaufdruck setzen wollen, ist es immer
ratsam ein Dr&uuml;ckeberger zu sein. </p>

<p><font size="+1"><b>Sachwerte</b></font><br>

Betr&uuml;ger sch&uuml;ren die Angst vor der &quot;Weichw&auml;hrung
Euro&quot;. um risikoreiche bzw. renditearme Sachwerte zu verkaufen. </p>

<p><font size="+1"><b>Hohe Rendite</b></font><br>

Wenn Fonds- oder Fremdw&auml;hrungs-Renditen von mehr als 8% versprochen
werden, sollte man tunlichst abwinken. Denn mehr als 6,5% pro Jahr sind
ohne Risiko nirgendwo drin. </p>

<p><font size="+1"><b>Schwarzgeld</b></font><br>

Vorsicht vor Anlageberatern mit Auslandssitz! Die legen unser Schwarzgeld
gern in Steueroasen an und wissen, dass wir sp&auml;ter trotz mieser
Zinsgewinne aus Angst vor dem heimischen Finanzamt nicht klagen werden.
</p>

<p><font size="+1"><b>Bl&uuml;tentr&auml;ume</b></font><br>

F&auml;lscher wollen von dem Unwissen um die neuen Euro-Scheine profitieren
und bringen Bl&uuml;ten in Umlauf. Also auch schon von Anbeginn auf den
Sicherheitsfaden, das Wasserzeichen und das Hologramm achten. </p>

<p>Einen etwas ausf&uuml;hrlicheren Artikel findet ihr zu den
angesprochenen Punkten unter &quot;Eurogangste

r&quot;. </p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>

<p align=center><a name="a2">
<b><font color="800000" size="5">Xbox</font></b></a></p>

<p>Hoch &uuml;ber der C&ocirc;te d&acute;Azur liegt das Pop-Art-Traumhaus
von Pierre Cardin, das Palais Bulles in der N&auml;he von Cannes. Das Haus
besteht aus mit h&ouml;hlenartigen G&auml;ngen verbundenen Kugeln, die mit
futuristischen Sitzm&ouml;beln best&uuml;ckt sind. Austin Powers h&auml;tte
sich in diesem Stein gewordenen Drogenrausch wohl gef&uuml;hlt. Ein
perfekter Ort, um eine Spielkonsole zu pr&auml;sentieren, die die Welt
erobern soll: die Xbox. </p>

<p>Microsoft will mit dem Ger&auml;t in den von Nintendo und Sony
beherrschten Markt vordringen und pr&auml;sentiert eine technisch
eindrucksvolle Konsole: Ein 733 MHz schneller Prozessor und ein
nVidia-Grafikchip mit 233 MHz bringen ungeahnte Rechenleistung in die
Videospielewelt. </p>

<p>&quot;Ein attraktiver Startpreis war wichtig f&uuml;r uns, weil es eines
unserer Ziele ist, mit Xbox den Markt f&uuml;r Videospiele zu
vergr&ouml;&szlig;ern&quot;, erkl&auml;rte Sandy Duncan, der Vice President
Xbox Europa auf der Pressekonferenz in Cannes. Ob Spieler den Preis mit ca.
950 Mark (479 Euro) wirklich attraktiv finden, wird sich ab dem 14.
M&auml;rz 2002 zeigen, denn damit liegt die Konsole deutlich &uuml;ber den
Konkurrenten. Die PlayStation 2 kostet ca. 600 Mark. Nintendo hat den Preis
f&uuml;r den GameCube noch nicht bekannt gegeben, gerechnet wird aber mit
ca. 500 Mark. Auch die Spiele werden mit 140 Mark (69 Euro) deutlich mehr
kosten als die der Konkurrenz (PS2: 120 Mark). </p>

<p>Auf der Seite www.xbox.de konnte ich leider keine Details nachschauen,
Amigabrowser sind bei MSN-Sites leider nicht willkommen. </p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>

<p align=center><a name="a3">
<b><font color="800000" size="5">Parsec, das Weltraumspiel Marke Eigenbau
</font><br>
<font color="#0000ff" size="4">www.parsec.org</font></b></a></p>

<p><img src="st_wzpar0.jpg" width=320 heigth=240 align=left hspace=6>
Spielefans entwickelten das Weltraum-3D-Game "Parsec", dessen Grafik und
Performance locker an Spiele bekannter Entwickler heranreicht. Vorteil von
"Parsec": Es kostet gar nichts. </p>

<p>Wenn "Parsec" Schule macht, d&uuml;rften die gro&szlig;en Firmen
zittern: Der Weltraum-3D-Shooter bietet eine gute Grafik, netten Sound, ist
Betriebssystem-&uuml;bergreifend und kostet nichts. Die Beta-Version steht
jetzt im Web zum Download bereit.</p>

<p> Zu Beginn des Jahres 1996 begann eine Hand voll Studenten des
Computergrafik-Kurses an der Technischen Uni Wien, gemeinsam an Sequenzen
f&uuml;r ein Weltraumspiel zu t&uuml;fteln. Ein halbes Jahr sp&auml;ter
gaben sie ihrer -rein DOS-basierten -Arbeit den Projektnamen "Parsec", ein
Begriff aus der Astronomie, der eine bestimmte galaktische
L&auml;ngeneinheit bezeichnet (<b>Par</b>allaxen-<b>Sek</b>unde, entspricht
der Entfernung eines Sterns, dessen Parallaxe 1 Bogensekunde betr&auml;gt =
ca. 3,3 Lichtjahre). "Parsec" l&auml;uft auf den Betriebssystemen Windows,
Mac und Linux. <br clear=all></p>

<p><b>Die BETA-Version: </b><br>

<img src="st_wzpar1.jpg" width=140 heigth=105 align=left hspace=6>Bereits
ein Jahr sp&auml;ter waren Spezialeffekte und 3D-Welten geschaffen. Da das
Betriebssystem DOS zu dieser Zeit nicht gerade zu den neuesten technischen
Errungenschaften mehr z&auml;hlte, wurde "Parsec" auch f&uuml;r Win32
(95/98/NT), MacOS (PowerMac) und Linux entwickelt. </p>

<p> Mittlerweile steht der Download der BETA-Version online, "Parsec" wurde
Multiplayer-f&auml;hig und begeistert die Spieler. Auf der Site Parsec.org
kann die LAN-Testversion heruntergeladen werden. Sie ist 71 MB gro&szlig;
und erm&ouml;glicht zun&auml;chst nur das Spielen im LAN und einige
Demo-Fl&uuml;ge durchs All. </p>

<p><b>Das Spiel</b><br>

<img src="st_wzpar2.jpg" width=180 heigth=135 align=left hspace=6>"Parsec"
ist eine ziemlich einfach und gut gemachte Multiplayer-Variante bekannter
Arcade-Spiele. Mit dem Raumschiff preschen die Spieler durchs All auf der
Jagd nach Gegnern. Nat&uuml;rlich passiert es schnell, dass der J&auml;ger
selbst zum Gejagten wird. Maximal acht Spieler k&ouml;nnen
Plattform-&uuml;bergreifend in einem Netzwerk gegeneinander antreten.
Ebenso viele Raumschiffe stehen derzeit auf der "Parsec"-Page zur Auswahl.
Sobald die Spieler-Registrierung fertiggestellt ist, werden erbeutete
Punkte in einer zentralen Datenbank gesammelt und in einer Rangliste
ausgewertet.</p>

<p> Die Erfinder des Spiels nennen ihre Arbeit eine "commercial-quality
freeware", und in der Tat reicht die Qualit&auml;t von Grafik und Sound
schon in der BETA-Version an Kaufspiele heran. F&uuml;r ein fl&uuml;ssiges
Spielen empfehlen die Entwickler einen Pentium II mit 300 Mhz oder einen
Apple G3 mit 400 Mhz, 128 MB RAM und Hardware-beschleunigte 3D-Grafik. Man
ben&ouml;tigt also nicht die aktuellste Computerausstattung, um die Jagd
durch die "Parsec"-Galaxien starten zu k&ouml;nnen. <br clear=all></p>

<p><b>Die "Parsec"-Galaxien</b><br>

<img src="st_wzpar3.jpg" width=180 heigth=135 align=left hspace=6>"Parsec"
besteht aus einem Gameserver-Netzwerk, das &uuml;bers Internet miteinander
verbunden ist. Jeder Server stellt eine eigene Galaxie dar. Das Universum
wird durch den "Parsec"-Master-Server zusammengehalten, alle Server werden
dort registriert.<br><br> Die Galaxien des "Parsec"-Alls sind durch
Sternentore miteinander verbunden. Durchfliegt ein Spieler solch ein Tor,
wechselt er damit den Server. F&uuml;hlt sich ein Spieler in einem dieser
Sonnensysteme besonders wohl, kann er sich beim Start des Spiels dort auch
direkt einloggen. Er muss dazu nur die IP-Adresse oder den DNS-Namen des
jeweiligen Sonnensystem-Servers kennen. Die verf&uuml;gbaren Server werden
auf dem "Parsec"-Master-Server aufgelistet. </p>

<p> Der "Parsec"-Kosmos wird st&auml;ndig gr&ouml;&szlig;er:
Server-Verwalter k&ouml;nnen ihr eigenes Sonnensystem gestalten und eigene
Planeten und Monde einsetzen. Nach Anmeldung beim Master-Server geh&ouml;rt
die neue Galaxie zum "Parsec"-Universum. <br clear=all></p>
                 
<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>

<p align=center><a name="a4">
<b><font color="800000" size="5">Harry Potter</font></b></a></p>

<p>Seit Anlauf des ersten Teils als Kinofilm hat eine solch gewaltige
Vermarktungswelle eingesetzt, dass ich sofort meinen Artikel wieder
gel&ouml;scht habe, es gibt nichts, was nicht schon irgendwo 23mal
beschrieben wurde. Und einen Info-Charakter hat mein Artikel keineswegs
mehr. Also keine Zeilen &uuml;ber dieses Thema. </p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>

<p align=center><a name="a5">
<b><font color="800000" size="5">Bill Gates: "Digitale Dekade" steht bevor</font></b></a></p>

<p>Die Computer- und Softwareindustrie wird nach Ansicht von
Microsoft-Mitbegr&uuml;nder Bill Gates das kommende Jahrzehnt st&auml;rker
pr&auml;gen als jemals zuvor - trotz der aktuellen schwierigen Lage. </p>

<p> Zum Auftakt der gr&ouml;&szlig;ten US-Computermesse Comdex in Las Vegas
verwies Gates auf die Absatzschwierigkeiten der Branche und das sinkende
Vertrauen der Verbraucher. &quot;Nun fragen die Leute, ob die Technologie
ausgespielt hat. Ich dagegen kann mich f&uuml;r das kommende Jahrzehnt
begeistern, &uuml;ber die Dinge, die wir bislang noch nicht zustande
gebracht haben&quot;, sagte Gates. &quot;Wir haben von dem, was wir
erreichen k&ouml;nnen, noch nicht einmal die Oberfl&auml;che
angekratzt.&quot;</p>

<p> Der elektronische Handel (E-Commerce) werde im kommenden Jahrzehnt
mindestens um den Faktor 30 wachsen, die Zahl der E-Mail-Adressen werde
sich vervierfachen. &quot;Heute hat jeder zweite Haushalt in den USA einen
PC. Im Jahr 2010 werden es Dreiviertel sein, und viele werden zwei oder
drei haben. In dieser Digitalen Dekade wird Computer- Technologie jeden
Teil unseres Lebens ver&auml;ndern und das Versprechen des wirklich
sicheren und wirklichen pers&ouml;nlichen Computers
einl&ouml;sen.&quot;</p>

<p> In den Augen von Gates werden dabei das neue Betriebssystems
&quot;Windows XP&quot; und die Microsoft-Technologie &quot;.NET&quot;
(Dot-Net) eine Schl&uuml;sselrolle spielen. Nach dem 25. Oktober, dem
Marktstart des &quot;Windows XP&quot;, habe Microsoft bereits sieben
Millionen Exemplare von &quot;Windows XP&quot; &uuml;ber PC-Hersteller und
den Handel absetzen k&ouml;nnen. Damit dementierte Gates Meldungen, wonach
der XP-Verkauf nur schleppend angelaufen sei.</p>

<p> In den kommenden f&uuml;nf Jahren werde der &quot;Tablet PC&quot;, ein
flacher Mobilcomputer in der Gr&ouml;&szlig;e eines Schreibblocks, den
herk&ouml;mmlichen PC als popul&auml;rsten Personal Computer abl&ouml;sen,
sagte der &quot;Chef Software Architekt&quot; von Microsoft voraus. In
seinem Auftritt demonstrierte Gates neue Tablet-PC-Prototypen von Acer,
Compaq Fujitsu und Toshiba, die mit einem Schreibstift bedient werden
k&ouml;nnen und innerhalb eines Jahres in die L&auml;den kommen sollen.
Markt-Beobachter sehen den Markt f&uuml;r &quot;Tablet PCs&quot; jedoch
weniger optimistisch. Todd Kort, Analyst des Marktforschungsunternehmens
Gartner, nannte Gates Vorstellung einen &quot;Wunschtraum&quot;. &quot;Das
ist ein Niemandsland in der Computerlandschaft.&quot; F&uuml;r den
&quot;Tablet PC&quot; gebe es in der Branche keine Begeisterung. </p>
<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>

<p align=center><a name="a6"><font color="800000" size="5">
<b>Feedback </font></b></a></p>
<table border=0 cellpadding=0>
<tr><td colspan=2>
Wie gehabt, alles in alphabetischer Reihenfolge und pro Autor
nur einen Artikel: </td></tr>
<tr><td valign=top><ul><li> Andreas Guldner </li></ul></td>
<td>RPGkampf 4.Teil<br>Teil f&uuml;r Teil wird man in die Geheimnisse der
Materie eingeweiht. </td></tr>
<tr><td valign=top><ul><li> Cord Hagen </li></ul></td>
<td>WindowXP <br>ein offener und ehrlicher Bericht &uuml;ber das
"Konkurrenzbetriebssystem". </td></tr>
<tr><td valign=top><ul><li> Gerd Wolpert </li></ul></td>
<td>Optische T&auml;uschung<br>mal etwas ganz anderes und verbl&uuml;ffend.
</td></tr>
<tr><td valign=top><ul><li> Horst-Uwe Kroll </li></ul></td>
<td>Computerliebe<br>wo die Liebe doch &uuml;berall hinf&auml;llt. </td></tr>
<tr><td valign=top><ul><li> Thomas Weber </li></ul></td>
<td>War of Worlds <br>ein sehr interessanter Mix von Buch-, Muscal- und
Filmbeschreibung. </td></tr>
</table>

<hr size=4>
</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff"><font color="#0000ff">
<td>Autor: &nbsp; <b><font color="#0000ff">Wolf Zimmer</font></b> </td>
<td>E-Mail: <b><font color="#0000ff"> wolf@wozim.de</font></b> </td>
<td>Homepage: <b><font color="#0000ff"> http://www.wozim.de </font></b>
</td></tr></table></center>
<p>Kein linker Frame? Dann klicke <a href="index.html" target="_top">
<b>hier</b></a> </p>
<br>
</body>
</html>
