<html>
<head>
<!-- Author = Cord Hagen -->
<title>Jaja, hier hast Du noch ein Bisserl was :-)</title>
</head>
<body background="ncb_bg3.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Zeitgedanke</b></font></p>

<p>Emulation - Anfang, &Uuml;bergang oder das Ende?  <br>
Was man nicht emulieren kann.... </p>

<p>Da haben wir´s nun. Ein AmigaOS in einem Affenzahn. Es l&auml;uft auf
der aktuellsten Hardware, ohne den Anschluss an moderne Peripherie zu
verlieren. Es ist zwangsl&auml;ufig relativ kompatibel zu systemkonform
programmierter Amigasoftware und wie immer spaltet alles die kleine
Amigagemeinde in zwei Lager. </p>

<p>Was unterscheidet diese Emulation noch von einem echten neuen Amiga? Wer
glaubt denn schon daran, dass neue Hardware extra entwickelt wird? Und
wenn sie es w&uuml;rde, - warum soll man daf&uuml;r dann zwangsl&auml;ufig
viel mehr Geld hinlegen bei &auml;hnlicher Leistungsf&auml;higkeit?
Prinzipiell haben wir somit schon beinahe einen neuen Amiga. </p>

<p>Die Emulation des Amigasystems auf billigster x86-Technik ist zwar
nichts neues, aber Dank immer leistungsf&auml;higerer Intelkompatibler
Prozessoren, Grafikkarten etc. und daf&uuml;r immer weiter optimierterer
Emulatoren. Die Folge ist ein AmigaOS, welches emuliert jede zur Zeit
verf&uuml;gbare echte Amigasystemkonfiguration weit hinter sich l&auml;sst.
</p>

<p>Vielen Amigausern gen&uuml;gt das und es gibt f&uuml;r diese Menschen
kaum noch einen plausiblen Grund, l&auml;nger auf einen echten neuen Amiga
zu warten, bei dem nicht jeder seine Hand ins Feuer legen w&uuml;rde, dass
er kommt und was dann eigentlich genau kommt - von dem &quot;wann&quot; mal
ganz abgesehen. </p>

<p>Da bringen auch zweifellos v&ouml;llig geniale Zukunftspl&auml;ne von
den Amigaentwicklern nicht mehr viel - die Amiganer wollen endlich ein
neues und zeitgem&auml;&szlig;es System haben und nicht mit alter zum Teil
flott gemachter Technik herumd&uuml;mpeln, wie es auf dem Atarimarkt
beispielsweise der Fall ist. </p>

<p>Der Wunsch ist gro&szlig; und so lockt immer mehr die Versuchung, zum
n&auml;chsten Discounter zu laufen und das eigentlich f&uuml;r den neuen
Amiga gesparte Geld in aktuelle PC-Technik zu investieren. Schnell noch
eine Amigaemulation installiert, - geht ja kinderleicht mittlerweile und
schon hat man einen flotten Windows-Rechner mit mittlerweile wenigstens
halbwegs stabilem WindowsXP und sein gewohntes AmigaOS in einer noch nie
gesehenen Geschwindigkeit. </p>

<p>Und dann? </p>

<p>Sch&ouml;n, dass ich mein hei&szlig;geliebtes FinalWriter auf dem
neuen System am laufen habe. Dem Windows lag aber bereits Word bei und
damit kann ich doch noch viel mehr machen. Auch mit PPaint war ich immer
sehr zufrieden, aber GIMP gibts nicht nur f&uuml;r Linux, sondern genauso
kostenlos f&uuml;r Windows und auch da ist die Entwicklung einfach weiter.
Und so geht es immer weiter.... </p>

<p>Irgendwann kommt man dann langsam zur Einsicht, dass nicht nur die
Entwicklung der Amigahardware stehen geblieben ist. Auch bei der Software
klafft mittlerweile eine L&uuml;cke. Ob mir davon nun bisher was fehlte,
habe ich schon wieder vergessen. Was man hat, hat man erstmal - was ich
davon brauche, darum kann ich mich auch sp&auml;ter k&uuml;mmern. </p>

<p>Ja sicherlich stimmt das alles irgendwo, aber muss man diesen ganzen
Wahnsinn eigentlich &uuml;berhaupt mitmachen? Brauche ich einen wenn auch
billigen, neuen PC f&uuml;r nichtsdestotrotz ja immer noch &uuml;ber
tausend Mark? Muss ich denn einen Amiga darauf emulieren und nochmals Geld
daf&uuml;r ausgeben? Es ging doch bisher auch so. Den Brief an Oma kann ich
nach wie vor immer noch ruckzuck mit FinalWriter tippen, EMails mit YAM
oder Microdot beantworten und der gebrannten CD merkt man hinterher auch
nicht an, ob sie nun mit MakeCD, oder Nero gebrannt wurde. Die
Tabellenkalkulation l&auml;uft immer noch auf TurboCalc, denn ein
Jahr2000Problem hat es ja nie gegeben. Und um Fotos etwas aufzuhellen, eine
kleine GIF-Animation zu erstellen oder mal ein bi&szlig;chen herumzupixeln,
- daf&uuml;r brauche ich doch weder GIMP mit zigtausend Funktionen, noch
f&uuml;r viel Geld teure Windowsprogramme. Das alles lief doch bisher
v&ouml;llig problemlos und nun will mir meine Welt einreden, dass ich
alles rundum neu brauche.... </p>

<p>So steht wohl jeder selbst vor der schweren Entscheidung, ob die
Werbewelt nun Recht hat, oder die Zeit doch nicht ganz so kurzlebig ist,
wie sie uns allen gerne pr&auml;sentiert wird. </p>

<p>Ich sitze hier an meinem uralten Amiga vor meinem uralten PolyEd und
freue mich, wie herrlich stabil das System arbeitet, egal wieviel ich damit
arbeite und wie lange. Rechts daneben wird auf dem PC Windows installiert,
- ich wei&szlig; gar nicht mehr, wie oft ich den Installationsbildschirm in
meinem Leben schon gesehen habe. M&uuml;sste ich meinen Amiga neu
installieren, so w&auml;re ich mittlerweile wohl aufgeschmissen. Im
tiefsten Archiv m&uuml;sste ich nach Installationsdisketten suchen und
&uuml;berlegen - &quot;wie ging das nochmal?&quot;. Das System habe ich
irgendwann 1994 mal eingerichtet und seither l&auml;uft es und das
tagt&auml;glich. Es hat viele Umz&uuml;ge hinter sich, -wurde st&auml;ndig
auf neuere und gr&ouml;&szlig;ere Festplatten &uuml;bertragen. Ab und zu
kam eine neue Startpartition dazu, um beispielsweise mal in OS3.9 hinein zu
schnuppern. Manchmal ging der Amiga auch gar nicht nach meinen
Hardwarebastelorgien, aber daf&uuml;r konnte nie das System selbst etwas.
</p>

<p>Ein Amigasystem zu emulieren weckt zwar meine Neugierde und vielleicht
&uuml;berwinde ich sogar mal den Kaufpreis f&uuml;r AmigaXL und Co. Aber
das emulierte System gegen meinen Amiga einzutauschen, der tagt&auml;glich
extrem stabil und zuverl&auml;ssig seinen Dienst erledigt und der sich
meinen Bed&uuml;rfnissen, Ideen und Vorstellungen im Laufe der Jahre
angepasst hat? F&uuml;r mich ist das auch heute noch v&ouml;llig
unvorstellbar. </p>

<p>Ich bin etwas traurig, wenn ich mit ansehen muss, wie der Amigamarkt und
seine kleine Familie st&auml;ndig kleiner wird, - wie sich immer mehr gute
alte Bekannte vor Windows t&uuml;mmeln. Nicht mehr gemeinsam, um wie
fr&uuml;her &uuml;ber ihr System und ihre Erfahrungen fachzusimpeln,
sondern jeder allein mit sich und seiner Windowswelt besch&auml;ftigt. Ich
trauere gern alten Zeiten nach, wo der Computer noch Thema und Hobby einer
Gemeinschaft war und nicht eine &uuml;berall gleich aussehende Maschine,
die eigentlich nur zu funktionieren hat, - dieses aber fast nie komplett
tut. Diese Zeit l&auml;sst sich nicht emulieren.... leider - oder lieber
&quot;gl&uuml;cklicherweise&quot;! </p>

<p>Ich w&uuml;nsche Euch eine sch&ouml;ne Zeit, ein zufriedenes
Weihnachtsfest, - ob nun mit altem Amiga oder neuem PC. Kommt gut ins neue
Jahr und lasst Euch nicht von Eurer Umwelt verr&uuml;ckt machen.
Zufriedenheit l&auml;sst sich nicht kaufen, - die kann nur aus dem Handeln
und denken eines Menschen entstehen, - daf&uuml;r aber auch v&ouml;llig
kostenlos. </p>

 <p>Euer <br>
 HIGGINS <br>
 Cord Hagen </p>

</td></tr></table>
<br>
</body>
</html>
