<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. AMIGA und Hyperion Entertainment geben Kooperation bekannt

»Snoqualmie, Washington, 30. August 2000

AMIGA Inc. und Hyperion Entertainment freuen sich bekanntgeben zu k&ouml;nnen, 
dass sie einen langfristigen Vertrag geschlossen haben, um eine 
eindrucksvolle Liste von ausgezeichneten Spielen von Hyperion auf das 
Amiverse zu &uuml;bertragen.

"Die Spiele von Hyperion sind den hohen Standards gewidmet, die die Amiga-
Gemeinschaft gesetzt hat. Ebenso wie wir f&uuml;r den neuen Amiga, hat Hyperion 
die Messlatte deutlich nach oben gelegt. Wir sind stolz darauf, dass 
Hyperion uns auf unserem Weg in die Zukunft begleitet. Wir sind hoch 
zufrieden zu sehen, wie ein st&auml;ndiger Strom anerkannter Entwickler unsere 
Plattform aufwertet," sagte Randy Hughes, Vizepr&auml;sident f&uuml;r Verkauf und 
Strategische Verbindungen bei AMIGA Inc.

Die erste Liste der f&uuml;r das Amiverse zu entwickelnden Titel enth&auml;lt:

Heretic II: Bereits freigegeben f&uuml;r den klassischen Amiga mit PPC ist 
"Heretic II", ein Ein-Personen-Schie&szlig;spiel im "gothischen" Stil.

Sin: Ein superrealistischer Ego Shooter, das in einer nicht zu fernen 
Zukunft abl&auml;uft und einer verbl&uuml;ffenden Handlung mit vielen Leveln bis zum 
endg&uuml;ltigen "Aufwasch" folgt. "Sin" kann im 3. Quartal 2000 erwartet 
werden.

Shogo: K&auml;mpfen Sie sich mit Ihrem "Mobile Armor Division Mech" (Mech der 
Panzer-Division) durch futuristische St&auml;dte und nat&uuml;rliche Landschaften. 
Stellen Sie sich in diesem ausgezeichneten Ego Shooter, der mit der 
ber&uuml;hmten "LithTech 3D Engine" von Monolith geschrieben ist, einem 
B&uuml;rgerkrieg im Mech- oder Soldaten-Modus. "Shogo" ist ebenfalls f&uuml;r das 3. 
Quartal 2000 geplant.

Freespace: Die Entwicklung hat schon angefangen und wird im 4. Quartal 2000 
beendet sein. Die Weltraumoper "Freespace" bietet viele Raumk&auml;mpfe und 
-missionen zwischen den Sternen und Milchstra&szlig;en. Eine gro&szlig;artige 
Simulation einer gro&szlig;artigen Geschichte des Weltraumkrieges.

Die V&ouml;lker: Die Entwicklung ist im Gange. Im Stil von "Age of Empires II" 
k&ouml;nnen Sie in "Die V&ouml;lker" Ihr Volk f&uuml;hren, um die Angriffe Ihrer Feinde zu 
&uuml;berleben. Leben Sie lange und gl&uuml;cklich in den Levels dieses tollen 
Echtzeit-Strategie-Spiels.

Soldier of Fortune: Der hochger&uuml;hmte Ego-Shooter des Jahres kommt zum 
Amiga. Entworfen mit Hilfe der Mitarbeiter von SEAL ist "SOF" einer der
realistischsten Ego-Shooter. &Uuml;berleben Sie K&auml;mpfe gegen Terroristen und 
Verbrecher, trainieren Sie, um besser zu werden und vergessen Sie nie, als 
erster zu schie&szlig;en.

"Hyperion wird in der nahen Zukunft neue Spiele ank&uuml;ndigen, denn wir 
verhandeln zur Zeit mit neuen Lizenzgebern, unter denen die gr&ouml;&szlig;ten Namen 
der Industrie sind. Wir wollen die hei&szlig;esten und neusten Spiele zum Amiga 
bringen, so wie es in der gro&szlig;en Zeit der Amiga-Spiele der Fall war. Mit 
dem Erscheinen neuer Hardware wie z.B. schnellerer Grafikkarten wird der 
Amiga eine neue Leistungsst&auml;rke erleben, die es ihm erlaubt, mit gr&ouml;&szlig;eren 
und besseren Spielen weiter zu machen. Halten Sie Ihren Amiga auf dem Stand 
der Technik, bleiben Sie auf unserer Welle und springen Sie auf den Zug mit
Namen 'Amiga One'!" sagt Ben Yoris, PR-Manager von Hyperion.

&Uuml;ber Hyperion:

Hyperion Entertainment ist eine Gesellschaft im Privatbesitz in Belgien, 
die im April 1999 gegr&uuml;ndet wurde. Hyperion will Unterhaltungssoftware der 
Spitzenklasse f&uuml;r f&uuml;hrende alternative Plattformen, darunter auch f&uuml;r den 
Amiga, herausbringen. Hyperion Entertainment besitzt Lizenzvereinbarungen 
mit vielen der Top-Namen der Industrie, u.a. Interplay, Activision und 
Monolith, und erwartet, weitere Abschl&uuml;sse bald bekannt geben zu k&ouml;nnen.

W&auml;hrend der Haupteinsatz von Hyperion im Bereich der 3D-Engines (LithTech, 
Quake 2) liegt, hat die Gesellschaft k&uuml;rzlich mit ihrem Vertriebspartner 
Titan (www.titan-computer.com) daran gearbeitet, ihre Bandbreite mit 
Strategie- und Echtzeit-Strategie-Spielen ebenso wie mit RPGs (Roll-Playing 
Games) und Simulatoren zu erweitern. Die Ergebnisse dieser Bem&uuml;hungen 
werden im Laufe der n&auml;chsten Monate bekannt gemacht werden. Hyperion 
Entertainment pr&uuml;ft auch die M&ouml;glichkeit, seine Erfahrungen im Bereich der 
3G-Grafik in Gebiete einzubringen, die nicht mit Unterhaltung verbunden 
sind. Weitere Informationen finden Sie unter www.hyperion-software.com.

&Uuml;ber Amiga:

AMIGA Inc. bietet Entwicklern die Technologie, Anwendungen f&uuml;r das 
Hardware-unabh&auml;ngige Multimedia-Amiga-OS zu schreiben oder zu portieren. 
Auf Amiga basierende Anwendungsprogramme k&ouml;nnen unver&auml;ndert auf Prozessoren 
der Typen x86, PowerPC, M Core, ARM, StrongARM, MIPS R3000, R4000, R5000, 
SH 3, SH4 und NEC V850 laufen. Das Amiga-OS kann aufgesetzt laufen auf 
Linux, Embedded Linux, Windows 95, 98, 2000, NT, CE und QNX 4. Die 
Hauptniederlassung von AMIGA ist in Snoqualmie, Washington, USA,  28 Meilen 
&ouml;stlich von Seattle, und hat weltweit Zweigstellen. AMIGA erreichen Sie 
&uuml;ber (425) 396-5660 oder im Netz &uuml;ber www.amiga.com.«

Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
(Quelle des Originals: AMIGA, Inc.)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
