<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Haage & Partner k&uuml;ndigt StormC v4 an

Haage & Partner (http://www.haage-partner.com) informiert:

»StormC 4

Die neue Dimension des Programmierens

Dolgesheim, den 28.8.2000. Am vergangenen Sonntag wurde in der Zweigstelle
der Firma HAAGE&PARTNER Computer GmbH in Dolgesheim das neue StormC
Entwicklerpaket erstmals im ausgew&auml;hlten Kreis pr&auml;sentiert. Im Rahmen des
allj&auml;hrlichen Sommerfestes wurde viel &uuml;ber Vergangenes und Zuk&uuml;nftiges
diskutiert. Unter den zahlreichen G&auml;sten waren Mitarbeiter der Firma
Hyperion (Heretic II, ...) und ESCENA (PowerPC-Boards), die sich nach der
Pr&auml;sentation begeistert &auml;u&szlig;erten.

Wichtigstes Merkmal am neuen Entwicklungssystem ist der Schritt hin zum
neuen AmigaOS. Noch l&auml;uft zwar alles auf dem Classic Amiga, und so wird er
auch ver&ouml;ffentlicht werden, doch alles wurde mit dem Augenmerk auf leichte
Portierbarkeit neu entwickelt.

Ein gro&szlig;er Schritt zu mehr Professionalit&auml;t wurde durch die Entscheidung
getan, den GNU-Compiler in einer angepa&szlig;ten Version zu unterst&uuml;tzen. Der
aktuelle Storm-Compiler ist zwar nicht weniger professionell, aber leider
nicht einfach auf andere Systeme zu portieren.
Der neue StormGCC ist sehr kompatibel zum Storm-Compiler, unterst&uuml;tzt
bekannte Preprozessorsymbole (z.B. __FUNC__), schreibt sowohl in 68K wie
auch in PPC das Amiga Hunk-Format in Objektdateien und erzeugt das gleiche
Debugdateienformat wie StormC. In der PowerPC-Version unterst&uuml;tzt StormGCC
die PowerOpen/WarpOS-Konventionen.

Im neuen StormC kommt der Netzwerkf&auml;higkeit sehr gro&szlig;e Bedeutung zu. StormC
kann nun problemlos von einem Programmiererteam eingesetzt werden, das
gemeinsam an ein und demselben Projekt arbeitet. Ein wichtiges Hilfsmittel
hierbei ist CVS Concurrent Versions System. Mit Hilfe von CVS k&ouml;nnen
mehrere Entwickler gleichzeitig an einem Projekt oder Quelltext arbeiten
und ihre &Auml;nderungen kontrolliert zusammenf&uuml;hren. StormC zeigt im Projekt
Versionsnummer und Status der Dateien an und markiert problematische
Dateien farblich.

Die Netzwerkeigenschaften werden unterstrichen durch das nun m&ouml;glich
gewordene, verteilte Make. Im Netzwerk k&ouml;nnen mehrere Rechner gleichzeitig
zum Compilieren eines Projekts benutzt werden. StormC ermittelt automatisch
freie Rechner und verlagert Compilieraufgaben auf diese. Eine Make Logdatei
protokolliert s&auml;mtliche Compilieranweisungen, Fehlermeldungen und erlaubt
eine exakte Fehlerdiagnose in komplexen Projekten.

Weitere Neuerungen sind in der Projektverwaltung und im Editor zu finden.
Mit Hilfe der globalen Suche kann das Projekt oder alle Projekte inklusive
hierarchischen Projekten mit Volltextsuche inklusive AmigaDOS Mustern
durchsucht werden. Dabei ist es m&ouml;glich, durch Doppelklicken auf die
Suchergebnisse direkt zu deren Position im jeweiligen Quelltext zu
gelangen.

Der Benutzer kann nun eigene Sektionen anlegen und bestimmen, was f&uuml;r
Dateien dort hineingelegt und wie die Dateien editiert, angezeigt oder
compiliert werden. Sektionen k&ouml;nnen alphabetisch sortiert und
unterschiedlich eingef&auml;rbt werden. Ein Hilfemen&uuml; liefert umfangreiche
Online-Hilfe zu StormC, GCC, AmigaOS Includes und Autodocs. Eine
Sprechblasenhilfe liefert bei Bedarf erste Hilfestellung.

Der neue Editor setzt nun auch CVS-Konflikte, Installer- und
AmigaGuide-Anweisung anhand neuer Lexika farblich vom restlichen Quelltext
ab. Beim Eintippen von Namen bekannter Systemfunktionen wird passend der
entsprechende Prototyp angezeigt, was die weitere Eingabe der Parameter
zur jeweiligen Funktion erheblich vereinfacht. Der Doppelklick auf einen
Dateipfad (z.B. in einer Includeanweisung) l&auml;dt die Datei in ein neues
Editorfenster. Desweiteren ist die Tastaturbelegung frei konfigurierbar.

Neu hinzugekommen ist ein Programm zur Dokumentation. Mit StormDOC erfa&szlig;t
man ToDo-Listen, Bugreports und Programmdokumentationen. Es protokolliert
alle Aktionen des Benutzers, kennt verschiedene Zielgruppen und Zust&auml;nde
der Eintr&auml;ge, die jeweils auch als Suchkriterien einstellbar sind.

Der neue Debugger arbeitet bei 68K- und PPC WarpOS-Programmen mit dem
StormCompiler und StormGCC zusammen. Das Debuggen ist nun nicht mehr nur
auf ein Programm beschr&auml;nkt - auch Tasks und Shared Libraries lassen sich
nun Schritt f&uuml;r Schritt abarbeiten. Bei auftretenden Enforcer-Hits wird
vom Debugger direkt die Quelltextposition des &Uuml;belt&auml;ters gezeigt.

Alles in allem ist StormC 4 ein vollst&auml;ndig &uuml;berarbeitetes und stark
erweitertes Hilfsmittel, das die Software-Entwicklung auf dem Amiga erneut
beschleunigen und qualitativ professioneller gestalten wird.

Die Neuerungen der Version 4 auf einen Blick

     Netzwerkf&auml;higkeit / verteiltes Make
     modifizierter GCC Compiler f&uuml;r 68k und PPC
     CVS Concurrent Versions System
     erweiterter Editor (Anzeigen der Prototypen von Funktionen)
     StormDOC zur Verwaltung von ToDo-Listen, Bugreports usw.
     erweitertere Debugger (auch f&uuml;r GCC)
     debuggen von Tasks und Shared Libraries
     globale Volltextsuche
     umfangreiche Online-Hilfe


Stimmen

Steffen H&auml;user von der Firma Hyperion, verantwortlich f&uuml;r die Umsetzung von
Sxx f&uuml;r den Amiga, &auml;u&szlig;erte sich &uuml;ber die neuen F&auml;higkeiten des Compilers:
Die Kombination aus dem gcc Code Generator mit StormC's Vorteilen wie dem
Debugger, der komfortablen IDE, dem MixedBinary-Support und der
M&ouml;glichkeit, auf einfache Weise Shared Libraries zu erstellen ergeben ein
gutes Compiler-System. Die M&ouml;glichkeit des verteilten make, um die
Compile-Zeit zu reduzieren sowie die Integration von CVS in die IDE sind
willkommene Zus&auml;tze. Wir freuen uns darauf, den neuen StormC bei
zuk&uuml;nftigen Projekten einsetzen zu k&ouml;nnen. Anpassungen eines ersten
Projekts von gcc auf den neuen StormC funktionierten problemlos. Support
von Elate VP Code in einer zuk&uuml;nftigen Version wird f&uuml;r uns auch sehr
interessant sein.


Lieferbarkeit

Der Preis von StormC 4 wird bei ca. 500,- DM anzusiedeln sein. Kunden
&auml;lterer StormC Versionen erhalten ein Update zum Preis von nur 198,- DM.
Das fertige Produkt wird jedoch erst im Oktober 2000 erh&auml;ltlich sein.«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
