<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
8. Kurzmeldungen (von Oliver Tacke)

---------------------------------------------------------------------------
 Software
---------------------------------------------------------------------------

 Die Scanner Farbkalibrierungssoftware ICS ist in Version 1.10 erschienen.
 [http://ftp.wustl.edu/~aminet/aminet/hard/misc/ICS.lha]

 Die Internetsoftware StrICQ ist nun in Version 0.1731 verf&uuml;gbar.
 [http://www.multimania.com/aubioane/programmes/stricq1731.lha]

 Vom Downloadmanager Charon wurde Version 1.4 ver&ouml;ffentlicht.
 [http://tesla.rcub.bg.ac.yu/~antony/Charon/Charon.lha]

 Der umstrittene Napster-Client Amster ist in Version 0.7a erschienen.
 [http://wuarchive.wustle.edu/~aminet/aminet/comm/tcp/Amster.lha

 In Version 2.1 erschienen ist das Initialisations-Programm der Delfina
 Soundkarte.
 [http://www.student.oulo.fi/~jperaaho/software/DelfInit.lha]

 Die Treiber f&uuml;r die IDE-Ports der X-Surf Netzwerkkarte stehen ab sofort
 zum kostenlosen Download bereit.
 [http://www.jschoenfeld.com/xsurfide.lha]

 UnLZX gibt es nun in Version 2.12 und zwar f&uuml;r 68k und PPC.
 [http://home.t-online.de/home/LucyG/UnLZX2.lha]

 Wieder gibt es von der B&ouml;rsensoftware Bonds eine neue Version: V1.75d.
 [http://www.programmed-excellence.de]

 Voyager Benutzer mu&szlig;ten seit dem 01.08. die Meldung "This betarelease
 has timed out!" hinnehmen. Im neuen Update auf V3.2.13 wurde dieser
 Fehler behoben.
 [http://www.vapor.com/download/pub/voyager/v3_3213_beta.lzx]

 Die Gruppe TFA wird den Assembler ASM-One weiterentwickeln. Version 1.44
 ist bereits verf&uuml;gbar.
 [http://www.eurobet.nl/users/ftp/asmonev144.lha]

 Der Treiber f&uuml;r Mustek-Scanner, BetaScanMustek, ist in Version V0.44 -
 1.0.92 downloadbar.
 [http://ftp.wustl.edu/~aminet/aminet/hard/drivr/BetaScanMustek.lha]

 DeliTracker wird nicht mehr weiterentwickelt und ist ab sofort Freeware.
 [http://ftp.wustl.edu/~aminet/aminet/mus/play/DeliTracker232.lha]

 Diverse Updates wurden von PerSuaSIVe SoftWorX herausgegeben:
 akJFIF V44.82, akPNG V44.82, akTIFF V44.82 und SViewIV V9.10.
 [http://www.ar-kleinert.de/]

 Vom MP3-Player AmigaAMP ist die Beta #7 von Version 2.8 erschienen, die
 jetzt via die sndfile.library auch AIFF und WAV unterst&uuml;tzt.
 [http://amigaamp.amiga-software.com/]

 Pagestream ist in Version 4.0.8 erschienen und unterst&uuml;tzt nun korrekt
 den PDF Export.
 [http://www.haage-partner.com]

 WHD-Load, mit dem man viele &auml;ltere Diskettenspiele auf die Festplatte
 bannen kann, ist in Version 12.0 erh&auml;ltlich.
 [http://www.whdload.org/whdload/WHDLoad_12.0_usr.lzx]

 Der AOL-Instant-Messenger Clone namens AmigAIM ist als Betaversion 0.9385
 erschienen.
 [http://www.missingpiece.com/AmigAIM]

 MagicMenu ist in Version 2.30 erschienen und hat jetzt auch seine eigene
 Website.
 [http://www.magicmenu.de]

 Der Virenkiller Safe ist nun in Version V13.9 verf&uuml;gbar.
 [http://www.vht-dk.dk/]

 AMarquee ist mittlerweile zu Version 52.0 aufgestiegen.
 [http://hem.passagen.se/hparting/archive/AMarquee52.lha]

 Der ICQ-Client StrICQ ist nun in Version 0.1732 erh&auml;ltlich.
 [http://www.multimania.com/aubioane/programmes/]

 Erneut gibt es ein Update f&uuml;r Easys, das einige Probleme bei der
 Installation beheben soll. Au&szlig;erdem ist das Servicepack 2 erschienen.
 [http://eternity.amiga-software.com/easys/]

 Vom Zeichen- und Bildbearbeitungsprogramm PerfectPaint ist Version 2.1
 erh&auml;ltlich. Wichtige Neuerungen sind z.B. der Verzicht auf AGA
 Unterst&uuml;tzung sowie mehr ARexx Befehle.
 [http://gothic.fr.free.fr/amiga/index.html]

 F&uuml;r das Programm ProStationAudio sind neue PlugIns ver&ouml;ffentlicht worden:
 DynExpander, RingMod, AutoFilter, L-R, AAM-1, APS-1.
 [http://www.audiolabs/.it]

 Das Finanzprogramm UltraAccounts wurde in Version 5.1 herausgegeben.
 [http://www.cix.co.uk/~rsmedley/amiga/ultraacc.html]

 Als Nebenprodukt zum HTML-Viewer SimpleHTML ist ein HTML.datatype (V0.11)
 erschienen.
 [http://home.t-online.de/home/sebauer/html-dt.lzx]

 Der Assembler ASM-One ist in Version 1.44 Rev433 verf&uuml;gbar und hat
 zahlreiche Fehlerkorrekturen erfahren.
 [http://www.euronet.nl/users/jdm/ftp/asmonev144.lha]

 Digital Almanac Version 3 ist fertiggestellt worden. Die Vollversion
 kostet DM 80,-, ein Update von Version 2 nur DM 50,-.
 [http://members.tripod.de/achimste/]

 Der Webbrowser Voyager ist in Version 3.3 Alpha 35 erschienen.
 [http://v3.vapor.com]

 F&uuml;r CyberGraphX Version 3 existiert ein Treiber f&uuml;r Grafikkarten mit PCI
 Virge Chip, die &uuml;ber das PCI-Board Mediator betrieben werden k&ouml;nnen. Am
 Treiber f&uuml;r Voodoo3-Karten wird bereits gearbeitet.
 [http://www.vgr.com]

 Ein Ersatz f&uuml;r das originale text.datatype ist erschienen und tr&auml;gt die
 Versionsnummer 44.5. Mit diesem ist es m&ouml;glich, Textpassagen zu markieren
 und zu kopieren.
 [http://home.t-online.de/home/sebauer/]

 
---------------------------------------------------------------------------
 Hardware
---------------------------------------------------------------------------

 Laut Elbox befindet sich das angek&uuml;ndigte PCI-Busboard Mediator            
 mittlerweile in Produktion und soll in wenigen Tagen ausgeliefert werden.  
 Das Unternehmen wies unterdessen Ger&uuml;chte, wonach sich nur Grafikkarten    
 mit bis zu 8 MByte Grafikspeicher betreiben lie&szlig;en, als falsch zur&uuml;ck.     
 Vielmehr stelle Mediator 4 GByte Adressraum zur Verf&uuml;gung.

 Der MAS-Player, ein mp3-Player f&uuml;r den Parallelport, ist in der Pro
 Version erh&auml;ltlich. Mit ihm ist es m&ouml;glich, auf einem 68000 Amiga mit
 7MHz eine 192kbps codierte mp3-Datei in h&ouml;chster Qualit&auml;t abzuspielen.
 [http://home.snafu.de/dcr/]

 
---------------------------------------------------------------------------
 Verschiedenes
---------------------------------------------------------------------------

 Bis Ende September ist es noch m&ouml;glich, sich an der Petition f&uuml;r Village
 Tronic zu beteiligen. Ziel ist es, autorisierten Service
 Reparaturbetrieben die Unterlagen f&uuml;r VillageTronic-Produkte zug&auml;nglich
 zu machen.
 [http://www.mc68k.btinternet.co.uk/vt]

 Seitens GP-Software wurde die Erlaubnis erteilt, das offizielle Directory
 Opus4-Handbuch als Amiga-Guide File zum Download anzubieten. Version 4
 war vor einiger Zeit inklusive Quellcode freigegeben worden.
 [http://viper.pl/~opus/files/DopusManual.lha]

 AsimWare stellt entgegen Ger&uuml;chten die Unterst&uuml;tzung des Amiga nicht ein.
 Das AsimCDFS werde zwar nicht mehr weiterentwickelt, wohl aber MasterISO.
 [http://amiga.asimware.com/]

 Crystal Software & Electronics Ltd. stellen Ihre Classic Amiga
 Unterst&uuml;tzung ein und brechen laufende Projekte ab, jedoch verspricht
 die Firma, den neuen Amiga zu unterst&uuml;tzen und versorgt die Amiga User
 mit dem Online Magazin "Amiga Survivor" unter
 http://welcome.to/amigasurvivor.
 [http://www.csande.co.uk/news.html]

 Der Falke-Verlag gibt die Amiga Future an die bisherigen Redakteure unter
 der Leitung von Andreas Magerl ab. Da nun nicht mehr die
 Vertriebskan&auml;le des Verlags zur Verf&uuml;gung stehen, wird die Amiga
 Future zuk&uuml;nftig nur noch im Abo erh&auml;ltlich sein, was allerdings auch
 nur durch eine ausreichende Anzahl von Bestellungen gesichert werden kann.
 [http://www.amigafuture.de]
 
 Wieder gab es in der 3sat Sendung "Neues" einen kurzen Bericht &uuml;ber den
 Amiga, speziell das SDK.
 [http://www.team-init-group.de/]


---------------------------------------------------------------------------
 Ger&uuml;chte
---------------------------------------------------------------------------

 AMIGA soll anl&auml;&szlig;lich der AmiWest 2000 verk&uuml;ndet haben, da&szlig; f&uuml;r OS 3.5
 kein Support mehr geleistet werden soll.

 Das BoXeR-Entwicklerteam um Joe Torre arbeitet angeblich an einem
 Amiga Classic Laptop Design.

 Im AmigaOne soll die n&auml;chste Grafik-Chip Generation von Matrox, der G800,
 werkeln.

 AMIGA will jetzigen Amiga Usern helfen, PPC-Karten zu erwerben, indem sie
 Entwickler (bei der Herstellung?) unterst&uuml;tzen.
 [http://www.myamiga.com/amiga/news/amiwest/amiwest.html]

 An Version 2.3 von IBrowse wird von Stefan Burstroem gearbeitet. AmiSSL
 soll dann wieder unterst&uuml;tzt werden.

 Ger&uuml;chten zufolge soll bereits im Oktober ein weiteres PCI-Busboard        
 erscheinen, das den Namen Predator tr&auml;gt, sich &uuml;ber die Phase5-PowerPC-    
 Karten betreiben l&auml;sst und neben PCI-Slots auch einen AGP-Anschluss sowie  
 einen SD-RAM-Sockel bietet.

Oliver Tacke &lt;O.Tacke@surfway.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
