<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. Neuigkeiten von Schatztruhe

Schatztruhe (http://www.schatztruhe.de) informiert:

»Aminet 38 CD-ROM ist verf&uuml;gbar!
Empfohlener Verkaufspreis DM 25,00 / Euro 12,78
Abo-Preis                 DM 19,80 / Euro 10,12«

»Produktinformation

Die Aminet CD 38 - August 2000 - beinhaltet nahezu ein Gigabyte (ungepackt) 
an Software in Tausenden von Archiven. Seit der Aminet CD 37 sind &uuml;ber 500 
MB an Neuheiten hinzugekommen. Alle Programme sind Deutsch beschrieben; 
viele verf&uuml;gen &uuml;ber eine deutsche Dokumentation. Als besonderes Highlight 
enth&auml;lt die Aminet 38 die Vollversion von Personal Paint 7.1b.

Inhalt der Aminet 38 CD

Verzeichnis  Umfang       Archive    Inhalt

biz           27 MB       37         Gesch&auml;ftssoftware
comm          30 MB       96         Kommunikationssoftware
demo          45 MB       33         Demos
dev           12 MB       62         Entwicklungssoftware
disk           7 MB       15         Harddisk Tools
docs          18 MB       61         Dokumente
game          79 MB       90         Spiele
gfx           23 MB       30         Grafiksoftware
hard           3 MB       13         Rund um Hardware
misc          36 MB       40         Verschiedenes
mods         313 MB       125        Musikmodule
mus            5 MB       30         Musik Software
pix          156 MB       215        Bilder
text          10 MB       23         Texte
util          25 MB       121        Utilities«


»Code Name "Hell Squad" ist verf&uuml;gbar!
Verkaufspreis  DM 89,00 / Euro 45,50«

»Produktinformation Code Name "Hell Squad"

Irgendwo im Universum in einer weit entfernten Galaxie ...

Ein junger und reicher Alien bekommt zu seinem Universit&auml;tsabschlu&szlig; ein 
intergalaktisches Raumschiff als Geschenk von seinen Eltern. Bei dem 
Versuch herauszufinden, wie man seine Freizeit am effektivsten gestaltet, 
entscheidet er sich zu einer Reise zu einem weit entfernten Planeten in 
einer anderen Galaxie, um dort etwas Verg&uuml;gen zu haben ... er landet dabei 
auf der guten alten Erde.

Schnell kann er sehr gut mit dem ganzen High-Tech seines neuen Spielzeugs 
umgehen und hat auch reichlich Spa&szlig; dabei dieses auf dem blauen Planeten 
einzusetzen. Nun, wir Erdenmenschen k&ouml;nnen seinen Enthusiasmus und seinen 
etwas seltsamen Sinn f&uuml;r Humor nicht so recht nachvollziehen.

Nicht in der Lage, die Gr&uuml;nde f&uuml;r all die neuen Umst&auml;nde herauszufinden, 
die die Erdenbev&ouml;lkerung verwirren und &auml;ngstigen, beschlie&szlig;t die 
amerikanische Regierung eine Task Force zu formen mit der Mission, die 
Bedrohung zu finden und zu eliminieren. Diese Einsatztruppe besteht aus den 
vier besten Leuten f&uuml;r diesen Job, die sich schon in &auml;hnlichen Situationen 
bew&auml;hrt haben ...

Als F&uuml;hrer der kleinen Truppe vier verwegener Soldaten (durch umwerfende 
handgezeichnete Hintergr&uuml;nde) ist ihre Mission sehr einfach: &Uuml;berleben! 
Ihre Mission beginnt wie schon viele zuvor, in denen Ihr Team zu einer 
Rettungsmission hinter die feindlichen Linien gesandt wurde. Aber schon bei 
der Landung bemerken Sie, da&szlig; nichts so ist, wie erwartet und es Ihre 
einzige Bestimmung sein wird Ihr Team wieder lebend von diesem seltsamen 
Ort wegzubringen.

Sind Sie gut genug, Ihr Team aus dem Unbekannten zu f&uuml;hren? K&ouml;nnen Sie tief 
im Feindesgebiet &uuml;berleben?

Code Name Hell Squad ist ein Arcade-Abenteuerspiel in einer 
unvorhersehbaren und t&ouml;dlichen Umgebung.

Systemanforderungen:
Minimum: PAL/NTSC-Screen, 3MB Ram (davon 2MB Chip-Ram!), Doublespeed-CD-ROM 
Empfohlen: AGA, mehr Speicher, schnellere CPU, schnelleres CD-ROM«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
