<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
6.2. PD-Tests (von Malte Mende)
-------------------------------

Mahjongg Tiles
--------------

Es ist etwa ein Jahr her, da hab ich endlich kapiert, wie man Mahjongg/
Shanghaii spielt. Seitdem versuche ich mich in diesen verflixt schweren
Spiel...
Ich wette, jeder Mensch (au&szlig;er mir nat&uuml;rlich) kann dieses Spiel, aber f&uuml;r
alle, die einen genauso gro&szlig;en Verstand haben wie ich (nicht pers&ouml;nlich
nehmen ;-)) erkl&auml;re ich es mal:

Das Spielfeld besteht aus einen ganzen Haufen kleiner Steine, die etwa
die gr&ouml;&szlig;e von Domino-Steinen haben und verschiedene Motive haben. Diese
Steinchen sind aufeinander geh&auml;uft. Und man muss wie beim Memory immer
zwei Paare finden (nur das hier die Motive sichtbar sind). Dieses Paar darf
man dann wegnehmen. Ziel ist es, alle Paare zu finden. Allerdings darf man
nicht jeden Stein wegnehmen. Es darf nicht zu beiden Seiten des Steines
Steine liegen (soweit ich das verstanden habe...)
Das klingt zwar einfach, ist aber sauschwer, glaubt mir!

Nun, dieses Programm ist eine Workbench Variente des Spiels.
Das ist dann auch schon das gr&ouml;&szlig;te Problem. Denn es wird die Palette des
WB-Screens genutzt. Und bei mir sind dann die Motive auf den Steinchen kaum
sichtbar. Gl&uuml;cklicherweise gibt es noch andere Motivsets und man kann sich
auch selbst welche Basteln, aber so der Hit in Sachen Optik ist es trotzdem
nicht... Es kann sein, dass das an meinem Amiga liegt, ich weiss es aber 
nicht genau.

Der Sound ist auch recht spartanisch...um nicht zu sagen: Es gibt keinen...

Aber es bringt ne Menge Spa&szlig; und ist ein lustiger Zeitvertreib. Wer eine
bessere Alternative sucht, sollte sich mal das Spiel "Tiles" suchen.
Das ist grafisch auch ein wenig ansprechender.

Fazit: Wer von der Grafik und dem Sound absieht, wird mit dem St&uuml;ck
       Software viel Spa&szlig; haben.

Wertung:

Grafik: 3 von 10 Punkten (zumindest auf meinem Rechner...)
Sound: 1 von 10 Punkten
Spielspa&szlig;: 7 von 10 Punkten
Steuerung: 7 von 10 Punkten

Subjektiver Gesamteindruck: 6 von 10 Punkten


WormWars
--------

Dies ist eines dieser Spiele, von dem man anfangs denkt: Woah, wasn das
f&uuml;rn M&uuml;ll??? Aber nachdem ich erstmal das Spielprinzip verstanden habe, 
machte es irgendwie s&uuml;chtig...
Also: Ihr steuert einen Wurm (so einen, wie in jedem Snake-Spiel), und 
m&uuml;sst in jedem Level einen ganzen Haufen Buchstaben einsammeln (auch wie 
bei Snake), um ein Level weiterzukommen. Gewinner ist der, der am meisten
Punkte hat.

Allerdings wird dir das Leben durch zwei Dinge schwer gemacht:

1. Du hast einen Gegenspieler (was hei&szlig;t einne? Bis zu drei. Je nach
Lust und Laune k&ouml;nnen die auch von Menschen gesteuert werden.)
Ber&uuml;hrt man die Spur, die der gegnerische Wurm hinterl&auml;sst, verliert man
Energiepunkte.

2. Es gibt teils Mauern, an denen man ebenfalls Energie verliert.

Ausserdem gibt es jede Menge Extras, wie Extra Energie, Bomben (sprengen
die Spur weg, die man hinterl&auml;sst), Spurenfresser und so weiter.

Wenn man sich erstmal ein wenig zurechtgefunden hat, ist das Spiel echt
lustig. Wer allerdings auf gute Grafik und super Sound steht, ist hier
falsch.

F&uuml;r kreative K&ouml;pfe gibt es auch einen Leveleditor.

Fazit: Auf die Dauer bringt es Spa&szlig;, man brauch nur seine Zeit, um sich
       an das Spiel zu gew&ouml;hnen, und die Grafik zu akzeptieren...

Wertung:

Grafik: 4 von 10 Punkten
Sound: 4 von 10 Punkten
Spielspa&szlig;: 7 von 10 Punkten
Steuerung: 7 von 10 Punkten

Subjektive Gesamtwertung: 7 von 10 Punkten

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
