<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Workshops / Hintergrundberichte / Buchvorstellungen
---------------------------------------------------

1. Der Commodore-Untergang aus meiner Sicht - Teil 11 (von Rainer Benda)

»Ich bekam noch mit, wie Christoph G&uuml;licher, Mick Hohmann dort anfingen und 
auch lange eine loyale Schiene fuhren. Sie waren auch auf einem Amiga-Club- 
Treffen in Marl und versuchten, den "Walker" zu verargumentieren. Meine 
Versuche, ihnen klarzumachen, da&szlig; sich A.T. auf dem falschen Weg bef&auml;nde, 
wurden anfangs als "Racheakt" aufgefasst und so interpretiert, als w&uuml;rde 
ich alles torpedieren, was von A.T. k&auml;me, da ich ja als "geschm&auml;hter" A.T. 
verlassen musste.

Das empfand ich so nicht und gab das auch zu verstehen. Als A.T. dann samt 
Escom am Ende waren, gab mir Christoph dann doch noch recht, da&szlig; keiner von 
ihnen seitens der Gesch&auml;ftsf&uuml;hrung korrekt behandelt wurden und dass auch 
Sondereins&auml;tze nicht entsprechend gew&uuml;rdigt wurden, es also auch am 
pers&ouml;nlichen Verh&auml;ltnis mangelte und dass ich doch mit meiner Ansicht 
richtig lag, da&szlig; A.T. schon von sich aus auf den Abgrund zusteuerte. Das 
bekam ich auch &uuml;ber Gilles Bourdin zu h&ouml;ren, der nach A.T. wieder nach 
Frankreich ging und einen Job in einer Bank annahm.

"Witzigerweise" rief mich Petro einmal an und teilte mir mit, da&szlig; ich meine 
&Auml;u&szlig;erungen &uuml;ber ihn in den Netzen zur&uuml;ckhalten sollte, da ich sonst damit 
rechnen m&uuml;sste, nicht mehr von A.T. bzw. A.I. beliefert zu werden. Darauf 
ging ich nat&uuml;rlich nicht ein. Vor allem war und bin ich der Ansicht, nur 
Erlebtes in Meinungen umgesetzt zu haben, und das besonders in einer Zeit, 
in der so ziemlich jeder Amiga-User seine Hoffnungen in ihn bzw. die 
Gesch&auml;ftsf&uuml;hrung setzte, da er derjenige sei, der die M&ouml;glichkeit h&auml;tte, 
aus dem Amiga etwas zu machen (so wird es bis heute noch gesehen). Nach 
unserem Gespr&auml;ch in Langen habe ich auch nicht mehr "aktiv" eine Meinung 
zum Amiga ge&auml;u&szlig;ert, da es nichts (wenig) bringt......

Nach meinem Abgang habe ich noch mitbekommen, da&szlig; Petro einen "Mann" neben 
sich hinzubekam, der als zweiter Gesch&auml;ftsf&uuml;hrer eingesetzt wurde (Stefan 
Domeyer, sp&auml;terer Chef von PIOS und nun von Met@box). Meinen Infos nach 
kamen sie nicht miteinander aus und Dohmeyer verlie&szlig; Amiga Tech. und 
startete das Projekt "PIOS One" zusammen mit Dave Haynie und Doc Peter und 
weiteren(?) Personen. Wie wir wissen wurde daraus nicht viel. Wie mir Peter 
mal erz&auml;hlte, f&uuml;hlte er sich in Hildesheim (daf&uuml;r zog er um) nicht sehr 
wohl, da nach seinem Eindruck der Fehlstart "Pios One" haupts&auml;chlich auf 
ihn abgew&auml;lzt wurde und er sich keiner Schuld bewusst war......
Da ich ja aufgrund meiner "Nachforderung" f&uuml;r den Einsatz meines privaten 
Systems noch zu den Gl&auml;ubigern geh&ouml;rte (A.T. wollte einen Vergleich, dem 
ich auch zustimmte - es kam aber zu keiner Auszahlung mehr, da 3 Tage 
vorher Konkurs angemeldet wurde) nahm ich auch an der Gl&auml;ubigerversammlung 
teil. Sie war zwar "nicht &ouml;ffentlich", somit durfte auch nichts nach au&szlig;en 
dringen, allerdings wurde soviel vor den T&uuml;ren "getratscht", da&szlig; es 
eigentlich nichts mehr "Geheimes" gab.

Anwesend waren neben meiner Person verschiedene Banken, Intel, Vertreter 
des Arbeitsamtes und Eagle Computer (Herr Konjevic Senior). Er versuchte, 
mir vor der Veranstaltung noch zu erkl&auml;ren, da&szlig; Eagle Computer die einzige 
Firma sei, die in der Lage w&auml;re, die Amiga-Reste zu &uuml;bernehmen, und dass er 
Erkundigungen zu Viscorp eingeholt habe, die eindeutig zeigen w&uuml;rden, da&szlig; 
Viscorp nicht in der Lage sei, die geforderte Summe auf den Tisch zu legen.

Ich h&ouml;rte mir das kommentarlos an. Herr Konjevic versuchte weiterhin, mir 
eindringlich zu erl&auml;utern, da&szlig; seine Gebote vom Konkursverwalter Hembach 
nicht angenommen worden w&auml;ren und dass er mit ihm dar&uuml;ber nochmal sprechen 
m&uuml;sse.

Das taten sie dann auch (vor allen) und Herr Hembach gab Herrn Konjevic 
eindeutig zu verstehen, da&szlig; Eagle Computer nicht mal 1/3 der geforderten 
Summe -selbst- zur Verf&uuml;gung habe, und wie er dann den Rest aufbringen 
wolle. Herr Konjevic versuchte "verzweifelt" zu argumentieren, da&szlig; das 
nicht stimmen w&uuml;rde und er Bankbest&auml;tigungen habe, die etwas anderes 
aussagen w&uuml;rden und dass Viscorp kein seri&ouml;ser Bieter sei.

Nachdem das so einige Male hin und her ging, brachte Herr Hembach es auf 
den Punkt, da&szlig; die Fa. Eagle Computer neben der Geldfrage schon deshalb 
nicht in die engere Auswahl gelangen werde (und Zitat Hembach: solange ich 
dar&uuml;ber zu entscheiden habe, wird die Fa. Eagle die AmigaT.-Reste auch 
nicht erhalten, Zitat Ende), weil die Fa. Eagle Computer schon einen 
Formfehler beim Antrag gemacht habe, denn die Fa. Eagle Computer d&uuml;rfe sich 
nicht direkt an ihn pers&ouml;nlich zwecks einer &Uuml;bernahme wenden. Schon 
deswegen m&uuml;sse er die Anfragen ablehnen und er werde auch -keine weitere- 
Anfrage seitens Eagle Computer annehmen.

Ich w&uuml;rde sagen, Herr Konjevic war etwas "ent&auml;uscht", und so gingen wir in 
die Sitzung. Es lagen drei dicke Ordner von Gl&auml;ubigern auf dem Tisch 
(seitens der Gesch&auml;ftsleitung von Escom/Amiga T. war niemand anwesend), die 
alle noch Forderungen hatten. Als Ergebnis kam heraus, da&szlig; der Warenbestand 
nicht zur Konkursmasse geh&ouml;re, das Verm&ouml;gen von A.T. selbst auf 25.000 DM 
gesch&auml;tzt werde und es daher nichts zu verteilen gebe, da die Mitarbeiter 
ja noch Vorrang h&auml;tten.

Als wir dann rausgingen, habe ich mich mit der Dame vom Arbeitsamt 
unterhalten, die sich ja um die soziale Frage k&uuml;mmern musste und sich &uuml;ber 
die Vorgehensweise wundere und intern kl&auml;ren m&uuml;sse, ob alles mit rechten 
Dingen zugegangen sei. Ich habe sie einige Wochen sp&auml;ter mal angerufen, ob 
es etwas Neues g&auml;be....eigentlich nur, &uuml;ber die Sache mit den Vertr&auml;gen 
(Viscorp sollte der Nachfolger sein, die Mitarbeiter sollten &uuml;bernommen 
werden, eine Ansprechpartnerin in USA solle bereits existieren, aber hier 
in Deutschland sei niemand zu erreichen, der auch etwas zu sagen 
h&auml;tte....)...und so endeten die Informationen dar&uuml;ber.

Ich ging in der Zwischenzeit wieder meinem Job in meinem Laden nach, mache 
zwar seit rund einem Jahr etwas anderes, bin f&uuml;r Amiga-Sachen aber durchaus 
noch offen, auch wenn ich dem Amiga, so wie wir ihn kennen, keine Zukunft 
mehr einr&auml;ume (auch oder trotz der &Uuml;bernahme durch McEwen und Co.), da ich 
einem AMIGA-OS &auml;hnlichen Betriebssystem auf einem PC, das sich zus&auml;tzlich 
noch gegen vorhandene Betriebssysteme wie Linux "durchsetzen" mu&szlig;, wenig 
bis keine Chancen einr&auml;ume.

Fazit, wenn es denn ein endg&uuml;ltiges Fazit gibt:

F&uuml;r mich pers&ouml;nlich liegt es klar auf der Hand, da&szlig; man gewisse Chancen 
immer verpasst/verspielt hat und trotz der tollen Leistung, ein System so 
lange am Leben zu erhalten, keine M&ouml;glichkeit hat, die verlorene Zeit 
aufzuholen.

Ich verwende meine Amigas solange weiter, bis sie den Geist aufgeben, aber 
die jetzige Variante, sich auf ein OS zu "beschr&auml;nken", entspricht nicht 
meinen "Vorstellungen", sofern ich noch Zeit damit verbringe, mir den x-ten 
Amiga auf dem Papier auszumalen, der in den ganzen Jahren nie verwirklicht 
wurde.

Ich hege auch keine Feindschaft oder Groll gegen Petro, oder andere Teile 
von A.I., oder was/wer auch immer kommt, da es wichtigere Dinge im Leben 
gibt und die Zeit bis zu einem gewissen Teil Wunden heilt. Ich teile nur 
nicht die Ansicht, wenn es um die Frage von Verdiensten, Aufopferung und 
&Auml;hnlichem geht.

Dazu m&uuml;ssten vielleicht ein paar andere Personen einbezogen werden, und ob 
die Vernachl&auml;ssigung des Privatlebens zugunsten eines Computer-Systems und 
"seiner Gemeinde" die Sache wert ist, muss jeder selbst entscheiden, ich 
w&uuml;rde mich daf&uuml;r allerdings nicht auch noch feiern lassen wollen, denn man 
wird nicht dazu gezwungen. Anders w&uuml;rde ich es sehen, wenn man noch so um 
16 Jahre alt w&auml;re und eine gewisse "Blau&auml;ugigkeit" vorhanden ist.

Ob der Amiga-User ein Typ Mensch ist, der sich alles gefallen l&auml;sst, oder 
ob er sich mit seinem Schicksal abgefunden hat und deshalb jeden Strohhalm 
ergreift, kann ich auch nicht abschlie&szlig;end f&uuml;r mich beantworten. Wenn man 
sich vor Augen h&auml;lt, was einem nach Commodore alles erz&auml;hlt wurde, wie weit 
gewisse Projekte schon seien, und dass es jetzt richtig losgehen w&uuml;rde und 
jede neue Unternehmung seitens der "Aufk&auml;ufer" als "die machen es jetzt
richtig, wozu sonst w&uuml;rden sie soviel Geld ausgeben" aufgenommen wurde, 
kann man eigentlich nur mit dem Kopf sch&uuml;tteln.

Profitiert haben davon die Amiga-User sicher nicht, stellt sich die Frage, 
wer dann?

Ein paar Firmen wie Amiga Int. durch den Verkauf von Restbest&auml;nden oder 
Fan-Artikeln, Entwickler/Hersteller kleinerer Zubeh&ouml;rteile f&uuml;r den Amiga, 
oder Gateway?

Was erwartet uns nun durch die &Uuml;bernahme McEwen & Co.?

Doch nur eine weitere Verl&auml;ngerung des Todes, oder der "sanfte" &Uuml;bergang zu 
PC-Hardware mit einer anderen Verpackung?

Ich bezweifle, da&szlig; das vielbeschworene "Amiga-Feeling" durch ein OS am 
Leben erhalten werden kann. Ich z&auml;hle mich nicht zu denjenigen, die auf 
eine OS-Umsetzung so lange gewartet haben, nur um nicht Windows oder Linux 
zu verwenden. Sicher, Amiga-spezifische Hardware zu bauen ist teuer, und es 
geht um Investitionen im sechsstelligen Millionenbereich. Wer aber nicht in 
der Lage ist, ein "neues" Produkt wirklich auf den Markt zu bringen, sollte 
vielleicht besser die Finger davon lassen. Ich kann jedenfalls kein Konzept 
erkennen, das f&uuml;r uns oder andere einen wirklichen Vorteil bringen 
k&ouml;nnte.....«

ENDE.


AMIGA aktuell w&uuml;rde auch in Zukunft gern mehrteilige Stories 
ver&ouml;ffentlichen. Wer diesbez&uuml;glich Vorschl&auml;ge hat, wende sich bitte an mich 
(aakt@gmx.de).

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
