<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Rund um das Internet: Die besten Internetseiten (von Numen Stahl)

Diesmal drehen sich die Homepage Vorstellungen rund um das Thema PowerPC. 
Drei Seiten habe ich dazu herausgesucht und nach Aussehen, &Uuml;bersicht und 
Inhalt bewertet.


Warpgate

Webmaster Andreas Wendorf zeigt sich f&uuml;r diese Seite verantwortlich.
Sie widmet sich voll und ganz dem Thema WarpOS/3D (und hat zus&auml;tzlich
noch einen Teil zum Thema Musik, was hier aber nicht weiter wixchtig
sein soll). Dazu gibt es regelm&auml;&szlig;ige und recht ausf&uuml;hrliche News zu
diesem Thema. Besonders interessant f&uuml;r PPC User d&uuml;rfte allerdings die
Software Liste mit Spielen, Anwendungen und Demos, die PPC ben&ouml;tigen
oder unterst&uuml;tzen, sein. Ein Hilfeforum rundet den ordentlichen
Eindruck ab. Schade nur, dass das Design mit seinem ewigen Blau ein
bisschen sehr langweilig aussieht. Ansonsten aber eine prima Seite.

URL:       http://www.w-9.de/
Sprache:   Englisch

Aussehen:  Befriedigend - Ausreichend
&Uuml;bersicht: Gut - Befriedigend
Inhalt:    Gut

Gesamt:    Gut - Befriedigend


PowerPC World powered by Haage&Partner

Auf der Haage&Partner Homepage befindet sich eine weitere Unterseite,
die sich ausschlie&szlig;lich mit dem Thema PPC befasst. Die News, die man
hier vorfinden kann, sind leider alle schon sehr unaktuell und
berichten auch nur &uuml;ber die wichtigsten Sachen. Interessanter ist da
schon die Liste von PPC Software. Au&szlig;erdem kann man hier auch n&auml;here
Informationen &uuml;ber die Hardware im Allgemeinen bekommen, was Warpgate
leider nicht bietet. Anstatt eines Forums gibt es hier die M&ouml;glichkeit
einer Mailingliste beizutreten. F&uuml;r Zocker h&auml;lt Haage&Partner &uuml;brigens
zus&auml;tzlich noch die "3D-World" bereit, die sich etwas eingehender mit
Spielen besch&auml;ftigt.

Insgesamt eine brauchbare Seite mit &uuml;bersichtlichem und anschaulichen
Design. Schade nur, dass der Newsbereich so entt&auml;uschend ausf&auml;llt.

URL:       http://www.haage-partner.com/ppcworld/
Sprache:   Deutsch und Englisch

Aussehen:  Gut
&Uuml;bersicht: Gut
Inhalt:    Ausreichend

Gesamt:    Befriedigend


Warp PPC Station

Der Schwerpunkt dieser Seite ist schnell erkl&auml;rt: News! Dabei kann
jeder seine PPC Neuigkeiten direkt an den Webmaster schicken, was dem
Ganzen einen &auml;hnlichesn Charakter wie amiga-news.de verleiht, nur eben
mit dem Unterschied, dass sich die PPC Station ausschlie&szlig;lich auf PPC
News beschr&auml;nkt. Die Seitenupdates sind dabei h&auml;ufig genug um den sehr
kargen Newsbereich bei H&P`s PPC World weit hinten liegen zu lassen.
Eine tolle Seite also, schade nur, dass sie ausschlie&szlig;lich auf
Englisch zu lesen ist.

URL:       http://members.tripod.com/ppcstation/
Sprache:   Englisch

Aussehen:  Befriedigend
&Uuml;bersicht: Gut
Inhalt:    Sehr Gut

Gesamt:    Gut


Numen Stahl &lt;Numen@Freenet.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
