<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. Amiga-Emulatoren am PC

In den letzten Wochen gab es vermehrt Anfragen, wie und ob man Amiga-Spiele 
auch am PC spielen kann. Nun, das geht nat&uuml;rlich, jedoch braucht man daf&uuml;r 
ein paar Sachen. 

Im Voraus: Dieser Artikel bezieht sich !nur! auf die legale Nutzung von 
Emulatoren. Tips, wo man illegal Amiga-Spiele herbekommt werde ich 
garantiert weder in Mails noch in diesem Artikel verraten.

Zun&auml;chst ben&ouml;tigen wir f&uuml;r den Spa&szlig;:

-WinUAE, ein Programm, dass euch einen Amiga in den PC zaubert. Es gibt
 noch einige andere Emulatoren (Fellow, Amiga Forever), aber WinUAE ist der 
 bekannteste und verbreitetste.

-Einen Amiga mit mindestens OS 2.x oder einen Internetanschluss. Diesen 
 braucht man, um das Betriebssystemauf den PC zu koprieren.

Mehr ist nicht ben&ouml;tigt. Nat&uuml;rlich werden jetzt einige sagen, man braucht
doch noch ein Spiel! Aber das kann man sich kostenlos und vollkommen legal
besorgen. Doch dazu sp&auml;ter.

Nun, nachdem man WinUAE runtergeladen und installiert hat (das bekommt man
&uuml;brigens zum Beispiel bei www.downloads.com), braucht man noch ein 
Programm, um das Betriebssystem des Amigas in eine Datei zu speichern. Dies 
bekommt man im Aminet (de.aminet.net), zum Beispiel das Programm 
"GrabKick". 

Dieses Programm muss man auf dem Amiga starten, es kopiert dann das AmigaOS 
in eine 512kb gro&szlig;e Datei. Um diese Datei auf den PC zu bekomen gibt es 
mehrere Wege. Am einfachsten ist es, wenn ihr auf dem Amiga das OS 2.x 
habt, da man mit dem auch PC-Disketten formatieren kann. Dann einfach die 
Datei kopieren auf den PC r&uuml;berkopieren.
Wer kein OS 2.x hat, aber einen Internetzugang an PC und Amiga kann auch 
die Datei angeh&auml;ngt an eine Mail an sich selbst abschicken und sie dann mit
dem PC abholen. Wege gibt es viele :)

Habt ihr die OS-Datei dann auf dem PC m&uuml;sst ihr WinUAE starten. In dem 
Optionsfeldern k&ouml;nnt ihr euch den Amiga zusammenstellen, mit dem ihr 
spielen wollt. Bei der Optionstafel mit dem Roms m&uuml;sst ihr bei dem 
Requester eure OS-Datei angeben.

Nun k&ouml;nnt ihr WinUAE starten. Das bringt zun&auml;chst herzlich wenig, da ihr 
noch keine Software f&uuml;r euren Amiga habt. Diese bekommt man kostenlos und 
auch noch vollkommen legal bei www.back2roots.org
Hier k&ouml;nnt ihr euch sehr viele Spiele, Applikationen und viele andere 
Amiga-bezogene Sachen downloaden. Die Dateien, die ihr euch dabei 
runterl&auml;dt, sind sogenannte ADF-Dateien, Amiga Disk File. Diese sind das 
exakte Abbild einer Amiga Diskette. Habt ihr euch euer altes Lieblingsspiel 
runtergeladen, m&uuml;sst ihr in bei WinUAE in den Optionen f&uuml;r die 
Diskettenlaufwerke in dem Requester das runtergeladene Spiel angeben. Nun 
m&uuml;sst ihr nurnoch auf Start dr&uuml;cken, und ihr k&ouml;nnt losspielen.

So, das war's auch schon.

Hier nochmal alle wichtigen URLs:

www.downloads.com, www.winuae.de - f&uuml;r WinUAE
de.aminet.net - F&uuml;r GrabKick oder jeden anderen Rom-Ripper
www-back2roots.org - F&uuml;r Spiele, Anwendungen und alles andere

Falls noch Fragen offen sein sollten, schreibt bitte nicht an Carsten,
sondern an uns, Mac und J&uuml;rgen: games@aakt.de

Malte 'Mac' Mende

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
