<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Review: 3D-Shoot'em'Up »Malice«

Um mir das Warten auf Shogo und Sin zu verk&uuml;rzen, habe ich mir &uuml;berlegt,
welches Actionspiel ich mir bis dahin zulegen k&ouml;nnte. Nachdem ich ja wei&szlig;,
da&szlig; mit der Vollversion von Quake auch alle Conversionen laufen sollen,
habe ich mir mal eine davon zugelegt: Malice! "More than a mission pack. A
whole new game" verspricht die Verpackung und auch die Hintergrundstory
h&ouml;rt sich ganz gut an: Wir schreiben das Jahr 2230 - Waffenfabriken
beherrschen die Industrie. In den Hauptst&auml;dten hat Bestechung und der
wirtschaftliche Druck dazu gef&uuml;hrt, da&szlig; es beinahe kein staatlich
kontrolliertes Rechtssystem mehr gibt. Als Folge daraus haben die meisten
gro&szlig;en Firmen ihre eigene Verteidigungsmethode geschaffen. In dieser Stadt
gibt es zwei Superm&auml;chte: Takahiro Industries - eine massive Cooperation
und das B.O.S.S. Untergrund Verbrechersyndikat. Takahiro stellt eine
elitere Armee von W&auml;chtern und mechanischen Verteidigungsanlagen zusammen.
B.O.S.S. verl&auml;&szlig;t sich auf solide S&ouml;ldner. Sie bezahlen gutes Geld...

...Nat&uuml;rlich arbeitest du f&uuml;r B.O.S.S., und bekommst deine Auftr&auml;ge vom
Obermacker selbst: Colonel Bossman! Du w&auml;rest wirklich ein gl&uuml;cklicher
S&ouml;ldner, wenn er nur mal p&uuml;nktlich bezahlen w&uuml;rde.

Dies ist wirklich der Ausgang f&uuml;r eine coole Actionschlacht! Doch das
beiliegende Booklet verspricht noch mehr: Es gibt keine R&uuml;stung mehr (die
ist Damage zu h&auml;sslich), kein Megahealth (mehr als 100% Gesundheit - wie
soll das gehen) und die ganzen Zaubereien aus Quake (Pentagram of
Protection oder Quad Damage) sind ebenso verschwunden. Man mu&szlig; nach einer
bestimmten Schu&szlig;zahl immer nachladen und regnen tut es auch noch!

Die Installation ist denkbar einfach: man kopiert den Malice-Ordner von der
CD (ca. 70 MB) einfach in den Quake Ordner. Von dort startet man "seine"
Quakeversion (z.B. glquakewos) mit dem Zusatz (-game malice) und schon kann
es losgehen. Mein Test bezieht sich auf die Warp3D unterst&uuml;tzte WOS-Version
von Quake und einen Bildschirmmodus von 640*480. (glquakewos -width 640
-game malice) Anders als bei Quake (oder den Missionpacks) gibt es nicht
die M&ouml;glichkeit aus verschiedenen Schwierigkeitsstufen zu w&auml;hlen. Man
startet direkt im ersten Level: Der Akademy. Hier gibt es keine Gegner,
sondern man hat in Ruhe die M&ouml;glichkeit die in Malice vorkommenen
"Spielsachen" zu testen. So gibt es neben Atemluftger&auml;ten und einem
MiniUBoot auch einen Fallschirm und einen Sender, den man vorausschicken
kann um das Gel&auml;nde zu erkunden. Mein Favorit ist allerdings das
Hoverboard, mit dem man schnell unterwegs ist, gro&szlig;e Spr&uuml;nge machen kann
und so sich nicht direkt das Genick bricht, wenn mal eine etwas tiefere
Schlucht zu &uuml;berwinden ist. Dieses Teil rockt echt!

Screenshot:
<IMG SRC="../extra/malice1.jpg" ALT="Screenshot">

Nach diesem Level geht es dann richtig los: in drei Cutscenes werdet ihr in
die Story eingef&uuml;hrt und dann befindet ihr euch schon in der Schlacht. Die
Cutscenes sind von &auml;hnlicher Qualit&auml;t wie in Heretic II, nur die
Sprachausgabe (englisch) ist an manchen Stellen etwas schlecht zu
verstehen. Aber das Spiel! WOW. Klar sieht man dem Spiel die Quake Engine
an, aber nur entfernt. Wenn beim Schie&szlig;en die Patronenh&uuml;lsen wegfliegen,
oder man pl&ouml;tzlich im Regen steht, merkt man die grafischen Feinheiten
sofort. Hier wurde wirklich was geleistet. Nat&uuml;rlich bleibt es bei so
einfachen R&auml;tseln wie: finde Schl&uuml;ssel A f&uuml;r T&uuml;r A und Schl&uuml;ssel B f&uuml;r T&uuml;r
B und lege s&auml;mtliche Schalter um. Aber alleine durch die neuen Features wie
zB. Fallschirm und MiniUBoot gibt es viel mehr M&oouml;glichkeiten. Und der
durchgehende Handlungsfaden tut den Rest. Aber ich denke mal, es wird
eindeutig klar, da&szlig; Malice mehr ist, als eine Mission Disk. Im &uuml;brigen
kommt n&auml;lich nur ein Charakter von Quake in Malice vor: der Titelheld, in
einer Cutscene (er wird von Damage weggepustet!) Das Spiel l&auml;ft zumindest
in meiner Konfig recht fl&uuml;ssig, aber 3D Graka und PPC werden schon vonn&ouml;ten
sein. Und auch ein weiteres neues Feature wei&szlig; zu gefallen: man kann die
Kamera ein St&uuml;ck weit wegfahren, so da&szlig; aus dem Egoshooter ein 3.Person
Spiel a´la Heretic II oder Tomb Raider wird. Leider tritt genau hierbei bei
mir ein Grafikfehler auf, so da&szlig; der Charakter nur als Pixel (bzw. Polygon)
M&uuml;ll dargestellt wird. Au&szlig;er, er benutzt ein Extra wie zB. das Hoverboard.
Dann sieht man ihn richtig und ich mu&szlig; sagen: erste Sahne!

Screenshot:
<IMG SRC="../extra/malice2.jpg" ALT="Screenshot">

Alles in allem gibt es eigentlich nur die unverh&uuml;llte Darstellung von
Gewalt als Kritikpunkt. Aber da Malice, erst ab 18 freigegeben ist, denke
ich mir, da&szlig; alle potentiellen K&auml;ufer selbst mit sich ausmachen k&ouml;nnen, ob
das was f&uuml;r sie ist. Das Blut spritzt in hohen Font&auml;nen und Damage gibt
manchmal ganz sch&ouml;n abwertende Kommentare von sich, wenn sich gerade ein
Gegner winselnd auf dem Boden befindet. Aber wenn man sich damit abfinden
kann (oder das sogar gut findet) ist Malice genau der richtige Zeitvertreib
zwischen Heretic II und Shogo, bzw. Sin. Malice ist wirklich mehr als ein
Missionpack zu Quake. Es ist wirklich ein total eigenes Spiel, also eher zu
vergleichen mit Heretic II, welches ja auch auf der Q***eII Engine beruht,
aber alles andere als ein Missionpack ist. Ohne die Freigabe der Q***e
Sourcecodes und den damit verbundenen Erscheinen der verschiedenen Quake
Executables f&uuml;r PPC und Warp3D h&auml;tte man sich Malice wirklich schenken
k&ouml;nnen. (schon Quake war ja sogar auf einem 060er schon mehr schlecht als
recht spielbar) Aber Dank der konsequenten Unterst&uuml;tzung dieser
Hardwarekomponenten lohnt sich der Kauf wirklich (zumal Malice ein reines
PC-Produkt ist und durch sein Alter entsprechend billig (meine EBay-Version
hat 5 DM gekostet)). Die Cutscenes bauen eine coole Stimmung auf und
verschiedenen Missionen machen echt Spass. Zwar gibt es an manchen Stellen
(bei mir) den einen oder anderen H&auml;nger und auch ein paar Grafikfehler
fallen auf, aber im gro&szlig;en und ganzen ist Malice wirklich empfehlenswert.
Vor allen diejenigen, die Quake und Heretic II schon durchhaben und nach
neuer 3D Action schielen werden sich &uuml;ber dieses Spiel ganz speziell
freuen. Und auch die M&ouml;glichkeit von Deathmatches &uuml;ber Netzwerk oder
Internet ist (auch gegen PC Gegner) gegeben. Also ich spiele Malice nun
seit 10 Stunden und mu&szlig; echt sagen: Nur euch zuliebe habe ich mein Spiel
unterbrochen (um diesen Test zu schreiben) und ich bin froh, wenn ich
wieder in die Welt von Damage und B.O.S.S. einsteigen kann. Also: wer mit
der Geschwindigkeit von Quake bei sich zufrieden ist, bei dem l&auml;uft auch
Malice! Und wenn ihr immer noch nicht sicher seit: schaut euch mal die
Malice Homepage mit vielen Screenshots an.

J&uuml;rgen Theiner

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
