<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Workshops / Hintergrundberichte / Buchvorstellungen
---------------------------------------------------

1. Nachtrag zu »Dirks Bastelstunde« in AMIGA aktuell 03/01 (von Dirk Wenk)

(AMIGA aktuell 03/2001 - Workshop:
Silversurfer und Express-Adapter im Desktop-A1200)

Warnung! Rauchen gef&auml;.... ups....   Basteleien an ihrer Hardware k&ouml;nnen zu 
erheblichen Besch&auml;digungen und St&ouml;rungen oder sogar zur Beendigung der 
Funktion des Computers f&uuml;hren. Keinerlei Gew&auml;hr, Garantie, 
Haftungs&uuml;bernahmen usw. ... auf den Inhalt des folgenden Artikels!

Hier beschreibe ich eine Modifikation zum Einbau des "IDE-Fix Express" 
Adapters, der mir so besser und stabiler aussieht als in meinem Artikel, 
den ich dar&uuml;ber zuerst geschrieben hatte.

Zuerst sei erw&auml;hnt, dass ich den Express-Adapter nicht richtig zum Laufen 
gebracht habe mit meiner Blizzard 1230 IV.

Wenn der Rechner einen Kaltstart machte, st&uuml;rzte er immer ca. 20 - 30 Mal 
ab, bevor er dann richtig lief. An Patches oder &Auml;hnlichem kann es 
eigentlich nicht liegen, da selbst Befehle wie "Assign" oder "Setpatch" zum 
Absturz f&uuml;hrten.

Wenn nach den ganzen Abst&uuml;rzen das System lief, hatte ich mit dem Express-
Adapter eine &Uuml;bertragungsgeschwindigkeit von 4.9 MB/s.

Nun habe ich mich darangegeben, diese &auml;rgerliche Effekt zu entfernen, den 
die Steckleiste leider produzierte.

Also, man nehme: eine Schere, einen L&ouml;tapparat und etwas Zinn.

Zuerst schneidet man das Kabel durch, mit dem der Express-Adapter an die 4-
fach Platine angeschlossen wird, und zwar nahe am Stecker (nat&uuml;rlich merken 
wir uns vorher, wo welche Signale ankommen). Danach l&ouml;ten wir den 
Steckkontakt auf der Express-Platine aus.

Haben wir das geschafft, l&ouml;ten wir die Adern des Verbindungskabels dort 
ein, wo sie hingeh&ouml;ren (Achtung, nicht verkehrt herum!).

So, jetzt sollten wir an der Platine das Kabel baumeln haben.

Wenn wir jetzt diese Platine einbauen, dann sehen wir, dass das Geh&auml;use 
wieder richtig pa&szlig;t (nur das Loch f&uuml;r den Festplattenrahmen ist noch zu). 
Jetzt brauchen wir auch den Gummiring aus der ersten Anleitung nicht mehr. 
Nur noch das Kabel mit dem 4-fach Adapter verbinden und los geht's!

Das Geh&auml;use pa&szlig;t nun auch wieder. Aber Vorsicht, wir m&uuml;ssen trotzdem mit 
Klebeband die Kontakte isolieren, sonst haben wir wieder Kurzschl&uuml;sse!

Mittlerweile habe ich mir eine Blizzard 1260 zugelegt. Mit dieser Karte 
erreiche ich seltsamer Weise nicht mehr die hohe &Uuml;bertragungsrate wie mit 
der 1230-er. Nun sind es mit dem Express-Adapter nur noch 3.6MB/s anstatt 
4.9MB/s wie mit der 1230.

Trotzdem immer noch besser als die 2,2MB/s ohne den Adapter. Aber das 
Wichtigste ist, dass das System jetzt einwandfrei und ohne St&ouml;rungen 
hochf&auml;hrt!

Dirk Wenk &lt;Dirk@wax7.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
