<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Der Zwischenruf (von Ralf Driesner)
-----------------------------------

Headlines as usual

Wer w&auml;re nicht f&uuml;rs Leben gern mal furchtbar ber&uuml;hmt? Und wenn auch nur ein
paar Augenblicke. Ein Moderator von der "Landeswelle Th&uuml;ringen" hat's
momentan furchtbar schwer. Der Gesch&auml;ftsf&uuml;hrer des Senders, so klagt er
mehrmals am Tag in herzzerei&szlig;endem Ton in einem Spot, wird ihn entlassen,
wenn er nicht bis 30.06. ber&uuml;hmt geworden ist. Die treue H&ouml;rerschaft wird
aufgefordert, Vorschl&auml;ge f&uuml;r eine wahnsinnig bombastische Tat zu machen,
die es ihm (und nat&uuml;rlich dem Sender) erm&ouml;glicht, &uuml;berall ber&uuml;hmt zu 
werden.

Nun, zumindest in AMIGA aktuell scheint er es durch die Erw&auml;hnung in diesem
Zwischenruf geschafft zu haben. Herzlichen Gl&uuml;hstrumpf, J&ouml;rn!!

AMIGA scheint &auml;hnliche Probleme zu haben. In nicht m&uuml;de werdender Weise
werden in regelm&auml;&szlig;igen Abst&auml;nden sogenannte "strategische Partnerschaften"
angek&uuml;ndigt. Egal, worum es sich handelt, wie klein oder gro&szlig; die
Zusammenarbeit auch sein mag. Es f&uuml;llt wieder mal die Seiten der Print- und
Online-Medien des Amiga-Sektors. Die von mir prognostizierte Klobrille mit
Kabelfernsehanschluss scheint schon bald realisierbar zu werden... 
(endlich!!)

Schmalztriefende gegenseitige Bewunderung der Partner beherrscht zwei 
Drittel der Pressemitteilungen. Zu guter Letzt begl&uuml;ckw&uuml;nscht man sich 
gemeinsam wie der Bauleiter, der ein Haus bei der Fertigstellung selbst 
abnimmt und sich mit schwerer Hand auf die Schulter klopft. "Gut gemacht!!"

Tja, wenn schon das Lob aus den Medien und der User-Gemeinschaft ("Ihr seid 
die beste (und einzige) Amiga-Community, die es jemals gab.") f&uuml;r nicht 
realisierte Projekte ausbleibt schiebt man eben schnell mal eine 
Partnerschaftsank&uuml;ndigung nach. Wenn dar&uuml;ber hinaus noch ein Freidenker in
der Amiga-Szene etwas zu frei denkt, kommen auch schon mal gewisse 
&Uuml;bernahmeger&uuml;chte in die &Ouml;ffentlichkeit. Und schon wieder eine (wenn auch 
ungeplante) Headline mehr....ein Hauch von Mystik umgarnt die Nostalgik. 

In den letzten Monaten scheint jedoch aus dem "Outback" Deutschland wieder 
die wirkliche Innovation zu kommen. Das MORPHOS-Team prahlt nicht mit 
zweifelhaften Partnerschaften mit uns unbekannten Firmen. Zun&auml;chst (fast) 
klang- und sanglos wurden mehrere Beta-Versionen des neuen PPC-
Betriebssystems unter das globale Amiga-Volk zum testen gestreut. Immer 
mehr Software wird, man meint fast nebenbei, MORPHOS-nativ umgesetzt. Die 
Firma bPlan, die von ehemaligen Phase5-Mitarbeitern gegr&uuml;ndet wurde, 
schiebt die Ank&uuml;ndigung eines neuen PPC-basierenden Hardwaresystems nach, 
das dem lahmen AmigaOS Beine machen soll.

Zur Erinnerung: Phase 5 war auch damals die Firma, die den Amiga-Markt am 
Leben gehalten hat; bPlan und Morphos k&ouml;nnten jetzt zum alternativen 
Inkubator einer fantastischen Plattform werden. 

Wir bleiben gespannt am Ball und w&uuml;nschen dem Kollegen von der "Landeswelle 
Th&uuml;ringen" viel Erfolg beim "ber&uuml;hmt" werden.

Lebt lang und erfolgreich...

Euer 

Ralf Driesner &lt;global-dries@gmx.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
