<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Picture Digiservice</TITLE>
  </HEAD>

  <BODY text="#0000ff" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=
    "Beitrag" bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="apc7">
            <AREA shape="rect" coords="460,1,550,22" href=
            "apc.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="0" summary=
            "Seitenformat" bgcolor="#c8c887">
              <TR>
                <TD><IMG src="apc.gif" alt="" width="640" height=
                "22" border="0" usemap="#apc7"> </TD>
              </TR>

              <TR>
                <TD>
                  <TABLE border="0" cellpadding="4" summary="Text"
                  align="center">
                    <TR>
                      <TD>
<PRE>
                  &lt;----------------------------------------&gt;
                  | Scanservice f&uuml;r Mitglieder des APC&amp;TCP
                  &lt;----------------------------------------&gt;


Ich, Christian Heitzer, biete hiermit zus&auml;tzlich zum "Audio-Digiservice"
einen Scanservice f&uuml;r Mitglieder des APC&amp;TCP an.


                         Hier die technischen Daten:


Scanner: Cameron Handyscanner Typ 10/II
         (Bewertung in einer Ausgabe des "Amiga Magazins" des Jahres 1992
          mit "Sehr gut")
Farbscann: NEIN
SW-Scan: Ja
Graustufenscann: Nein
Umrechnen in Graustufen: Ja
Anzahl Graufstufen bei Umrechnung: 16
Qualit&auml;t der Graustufenergebnise: Gut (Testergebnis)
Eignung f&uuml;r Strichzeichnungen: Sehr gut
Aufl&ouml;sung: 200 Dpi, 300 Dpi, 400 Dpi.
Scanbreite: 10.5 cm
L&auml;nge des Scanstreifens: 20 cm. Bei Werten dar&uuml;ber kann ich nicht
                         garantieren, da&szlig; sich das gerasterte Bild noch
                         in Graufstufen umrechnen l&auml;&szlig;t, da schon sehr viel
                         Speicher f&uuml;r das gerasterte Bild ben&ouml;tigt wird.
                         Die absolute Obergrenze ist allerdings 30 cm.
                  Beim Scannen eines SW-Bildes (z.B. Strichzeichnungen), darf
                  die L&auml;nge des Scannstreifens durchaus 30 cm &uuml;berschreiten.


                                  Bildgr&ouml;&szlig;e:


Das zu scannende Bild kann entweder maximal 10.5 cm breit, oder 10.5 cm hoch
sein, da sowohl vertical, wie auch horizontal gescannt werden und das Bild
sp&auml;ter um 90&deg; gedreht werden kann.


            Es sind 4 M&ouml;glichkeiten vorhanden, Bilder zu scannen:


         a) SW (Nur f&uuml;r Strichzeichnungen zu empfehlen)
         b) SW-Raster 1  \
         c) SW-Raster 2   &gt; F&uuml;r eine Umrechnung in Graustufen notwendig
         d) SW-Raster 3  /

bei b-d ist eine Aufl&ouml;sung von 400 Dpi absolut empfehlenswert, da die Bilder
bei einer Graustufenumrechnung auf 1/4 der urspr&uuml;nglichen Gr&ouml;&szlig;e reduziert
werden. (Anmerkung: Dpi=Dots per Inch/Punkte pro Zoll)

-&gt; Auf meiner Infodisk sind einige Beispielbilder zum Scanservice enthalten.
   Diese Bilder sind jedoch nicht auf der Infodisk vom APC&amp;TCP zu finden. &lt;-


                     Wenn man etwas gescannt haben will:


Wer ein Bild gescannt haben m&ouml;chte, der schicke mir also das zu scannende
Bild (oder auch mehrere), und 1 bis 2 Disks (je nach Anzahl an Bildern), auf
denen sich irgendwelche n&uuml;tzliche PD-Software, befinden MU&szlig;!!!! Au&szlig;erdem mu&szlig;
Gen&uuml;gend R&uuml;ckporto beiliegen!!!

Ich werde versuchen, die Bilder schnellstm&ouml;glich zu scannen, und sie dann
zur&uuml;ckzuschicken, sofern gen&uuml;gend R&uuml;ckporto beiliegt.

Wer jedoch keine PD-Software auf die Disks kopieren will, der sollte bitte
pro Bild 50 Pf beilegen, was meiner Ansicht nach nicht zuviel ist.

WICHTIG:  Das zu scannende Bild sollte sich m&ouml;glichst gut erreichbar auf einem
-------- Blatt befinden,  und  zwar  sollte  um  das  Bild  ein  Freiraum  von
mindestens 2 cm sein, damit der Scanner gen&uuml;gend Freiraum hat. Au&szlig;erdem sollte
das  Papier,  auf  dem  sich  das Bild befinden sollte, aus einem rutschfesten
Material befinden, damit der Scanner  leicht  und  ruckelfrei  &uuml;ber  das  Bild
gezogen werden kann, was wiederum die Qualit&auml;t der Scanergebnise verbessert.
Zus&auml;tzlich sollte sich unter dem Bild noch gen&uuml;gend Freiraum befinden, damit
der Scanner nicht abrutschen kann (ca. 5 bis 10 cm.)

Es kann/k&ouml;nnte &uuml;brigens etwas l&auml;nger dauern, bis ich die gescannten Bilder
zur&uuml;ckschicken kann, da ich nicht immer Zeit zum Scannen habe, und das
Scannen selbst auch einige Zeit in Anspruch nimmt. Aber: Ich schicke alles,
was ich erhalte, auch wieder 100% zur&uuml;ck (R&Uuml;CKPORTO!).


                    Ach ja, das wichtigste, meine Adresse:


                              Christian Heitzer
                                  Rehwinkl 3
                               93480 Hohenwarth
                               - Kein Telefon -

Bei irgendwelchen Fragen einfach an meine Adresse wenden, und bitte genug
R&uuml;ckporto beilegen.



                      Stand der Ermittlungen: 24.08.1994


</PRE>
                      </TD>
                    </TR>
                  </TABLE>
                </TD>
              </TR>

              <TR>
                <TD><IMG src="apc.gif" alt="" width="640" height=
                "22" border="0" usemap="#apc7"> </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

