<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>APC&amp;amp;TCP-FD</TITLE>
  </HEAD>

  <BODY text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=
    "Beitrag" bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="pdl0">
            <AREA shape="rect" coords="460,1,530,22" href=
            "pdl.html" alt="zur&amp;uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="0" summary=
            "Seitenformat" bgcolor="#878787">
              <TR>
                <TD><IMG src="pdl.gif" alt="" width="640" height=
                "22" border="0" usemap="#pdl0"> </TD>
              </TR>

              <TR>
                <TD>
                  <TABLE border="0" cellpadding="4" summary="Text"
                  width="76%" align="center">
                    <TR>
                      <TD>
<PRE>
 Die APC&amp;TCP-FD-Serie

 Auf dieser FD-Serie befinden sich ausgew&auml;hlte Games sowie n&uuml;tzlichste
 Utilities. Und nat&uuml;rlich stammt ein gro&szlig;er Teil dieser Serie von unseren 
 eigenen Mitgliedern. Also wenn jemand etwas f&uuml;r uns hat nur her damit!
 Au&szlig;erdem findet ihr auf dieser Serie die Demoversionen von unseren eigenen
 Programmen sowie die Demoversionen von der APC&amp;TCP-Shareware-Serie!
 Wir sind zwar bestimmt keine Konkurrenz f&uuml;r Fish oder SaarAG, aber wir
 glauben, das wir hier einige interessante und vor allem wichtige Programme
 auf wenig Disks untergebracht haben.
 Eine aktuelle Inhaltsliste befindet sich immer auf unserer InfoDisk.

 UPDATES zu den jeiweiligen Programmen befinden sich immer auf der
 gleichen Diskette. Die Programme erscheinen also nicht unter
 einer neuen Disknummer!

 Alle Programme sind lauff&auml;hig ab OS 2.0. Bei OS 1.3 oder niedriger
 kann keine Garantie gegeben werden!

 Getestet wurden sie auf einem Amiga 4000 mit 10 MB RAM.


 APC&amp;TCP-FD 01    Diese Disk wurde am 18.7.1994 erstellt/updated!

 KaramalzCup:     Ein Super Eishockey-Simulation gesponsort vom Hersteller
                  des bekannten gleichnamigen Malzbieres nach der WM &acute;93
                  in M&uuml;nchen.
                  Mit vielen Optionen, ausf&uuml;hrlicher (nat&uuml;rlich deutscher)
                  Anleitung und gelungenen Animationen; kurz: f&uuml;r Sport-
                  Simulations-Freaks ein absoluter Leckerbissen!
                  Autoren: H. Akbiyik, I. Mesche, R. Stember
                  Copyright: The Art Department



 APC&amp;TCP-FD 02    Diese Disk wurde am 18.7.1994 erstellt/updated!

 SnackZone:       Action-Adventure deutscher Produktion mit sehr sch&ouml;ner
                  Grafik, witziger Animation und entsprechender Soundun-
                  termalung. Helft Lukas, das Produktionsgeheimnis f&uuml;r
                  die beliebten Bi-Fi Rolls wiederzufinden - sonst wird
                  es bald keine mehr geben...
                  Kleiner Tip: immer sch&ouml;n hilfsbereit sein, dann l&ouml;st Du
                  die Aufgaben bestimmt!
                  Hersteller: The Art Department



 APC&amp;TCP-FD 03    Diese Disk wurde am 18.7.1994 erstellt/updated!

 BackStage:       In diesem Werbespiel vom Live Club geht es darum, in ei-
                  nem Radiowettbewerb f&uuml;nf Aufgaben zu l&ouml;sen, die Deinen
                  Lieblingsstar betreffen. Zur Belohnung kannst Du mit
                  Deinem Idol zum Essen gehen und bei seinem n&auml;chsten Kon-
                  zert darfst Du hautnah dabei sein.
                  Sollte Dir dieses als Erster gelingen, kannst Du an
                  einem weiteren Wettbewerb vom Live Club teilnehmen.
                  Am Ende des gel&ouml;sten Spiels erh&auml;lst Du ein Passwort,
                  das per Postkarte an den Live Club geschickt wird.
                  Mit etwas Gl&uuml;ck kannst Du einen Fiat Cinquecento (500)
                  gewinnen!! - OS 1.3-3.0
                  (Und f&uuml;r alle, die nicht weiterkommen, gibt es nat&uuml;r-
                  lich auf der Helpline #1 eine Komplettl&ouml;sung.)
                  Hersteller: The Art Department



 APC&amp;TCP-FD 04    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Telekommando:    Das Telekommando kehrt zur&uuml;ck! Die Fortsetzung der Aus-
                  bildung geht weiter. Diesmal wurden in dem Unternehmen
                  "Umwelt 2000" von S.T.&Ouml;.R., der skrupellosen Organisa-
                  tion der Kommunikationsgegner, alle technischen Anlagen
                  sabotiert. Da aber eine wichtige Konferenz vor der T&uuml;r
                  steht, ist es nun Deine knifflige Aufgabe alles wieder
                  m&ouml;glichst schnell in Ordnung zu bringen! Denn keiner
                  au&szlig;er Dir kann da noch helfen! Rette die Stiftung "Um-
                  welt 2000"! - OS 1.3-3.0.



 APC&amp;TCP-FD 05    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Mercenary:       Ihr Auftrag ist die Vernichtung eines Trainingslagers 
                  f&uuml;r Terroristen.
                  Sie m&uuml;ssen sich zuerst durch ein vorgelagertes Waldgebiet 
                  k&auml;mpfen. Dann kommen Sie an die Verteidigungsanlagen des 
                  Camps. Nachdem Sie die Wachen ausgeschaltet haben, gelangen 
                  Sie zum Hauptquartier.
                  Demoversion.
                  Vollversion erh&auml;ltlich auf der APC&amp;TCP-Shareware-Serie.



 APC&amp;TCP-FD 06    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Assault Leader
 (Earth Defence2)

  Vor wenigen Monaten erfolgte ein &Uuml;berraschungsangriff auf die Erde, der nur
  knapp durch die hervorragenden Piloten der Verteidigungsstaffel "Earth
  Defence" zur&uuml;ckgeschlagen wurde. Da bisher jegliche Verst&auml;ndigung mit den
  Au&szlig;erirdischen erfolglos blieb, ist mit weiteren Angriffen zu rechnen.
  Fieberhaft wurde seitdem an neuen Waffensystemen zum Schutz der Erde
  gearbeitet, da die bisherigen Raumj&auml;ger nur in einer erdnahen Umlaufbahn
  operieren konnten. Das Ergebnis dieser Forschungen ist ein neuer
  Abfangj&auml;ger, der bisher allerdings nur als Prototyp zur Verf&uuml;gung steht.
  Leider fehlt die Zeit, um den Proto- typ genaueren Tests zu unterziehen.
  Unsere &Uuml;berwachungssatelliten haben eine gegnerische Raumstation geortet,
  die sich mit hoher Geschwindigkeit der Erde n&auml;hert. Nach ersten
  Hochrechnungen kann es sich um eine gewaltige Flotte von mehreren hundert
  Schiffen handeln, die in der Station transportiert werden. Die Station wird
  au&szlig;erdem von zahlreichen J&auml;gern eskortiert. Die einzige Chance gegen eine
  solche &Uuml;bermacht zu bestehen, liegt in einem &uuml;berraschenden Erstschlag.
  Sie, als Leiter der Operation, m&uuml;ssen so schnell wie m&ouml;glich die
  patroullierenden Geschwader ausschalten und ins Innere der Station
  eindringen. In der Enge der Raumstation kann der Gegner den Vorteil seiner
  zahlenm&auml;&szlig;igen &Uuml;berlegenheit nicht voll ausspielen. Demoversion. Vollversion
  erh&auml;ltlich auf der APC&amp;TCP-Shareware-Serie.



 APC&amp;TCP-FD 07    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Warrior of Light:Teuflische Horden haben das Land &uuml;berfallen. Nur mit Ihrer
                  magischen Axt k&ouml;nnen die Bestien besiegt werden. Zuerst
 m&uuml;ssen Sie den Nebelwald durchqueren, dann gelangen Sie zum Friedhof der
 verlorenen Seelen. Dort befindet sich die Quelle allen &Uuml;bels. Demoversion.
 Vollversion erh&auml;ltlich auf der APC&amp;TCP-Shareware-Serie.



 APC&amp;TCP-FD 08    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Hell Racer:      Bei diesem Autorennen gibt es nur ein Ziel: die vorgegebene
 Zeit zu &Uuml;berleben! Es gibt keine Regeln, jeder k&auml;mpft gegen jeden. 8 Level
 sind zu meistern. Vorsicht - einige Ihrer Gegenspieler haben, genau wie Sie
 selbst, Raketenwerfer im Fahrzeug eingebaut. Je nach Fahrzeugtyp verf&uuml;gen
 diese &uuml;ber Einzel- oder Dreifachschu&szlig;. Es gibt allerdings nur ein Fahrzeug,
 das einen Treffer durch eine Rakete &uuml;berstehen kann - n&auml;mlich Ihres.
 Demoversion. Vollversion erh&auml;ltlich auf der APC&amp;TCP-Shareware-Serie.



 APC&amp;TCP-FD 09    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Earth Defence:   Au&szlig;erirdische Angreifer bedrohen die Erde. Sie sind der 
                  Kommandant der Raumj&auml;gerstaffel, der "Earth Defence". Ihr 
                  Auftrag ist die Vernichtung der gegnerischen J&auml;ger und
 Kommandoschiffe. Es warten 5 Level mit jeweils 5 Stages auf Sie. In Stage 5
 jedes Levels treffen Sie auf ein Kommandoschiff des Gegners. Zu Beginn des
 Spiels werden Sie gefragt, auf welche Art Sie Ihre Schutzschirme aktivieren
 m&ouml;chten. Es gibt zwei M&ouml;glichkeiten: durch dr&uuml;cken der Leertaste oder durch
 bewegen des Joysticks nach vorn. Wenn Sie den Joystick bevorzugen, dann
 dr&uuml;cken Sie die Taste &lt;J&gt;, ansonsten die Leertaste. Demoversion.
 Vollversion erh&auml;ltlich auf der APC&amp;TCP-Shareware-Serie.



 APC&amp;TCP-FD 10    Diese Disk wurde am 18.7.1994 erstellt/updated!


 V L - Das Spiel: Ein weiteres "Promotion"-Game der Spitzenklasse in der
                  Art der guten, alten Lucas-Games. Als Privatdetektiv
                  Victor Loomes mu&szlig;t Du einen Diamantenraub aufkl&auml;ren.
                  Dabei f&uuml;hrt die Suche nach Tatverd&auml;chtigenh zun&auml;chst
                  zum Gangsterbo&szlig; Wild Bill...
                  Im B&uuml;ro findest Du alles, was ein guter Detektiv - &agrave; la 
                  Magnum -  so braucht. Viel Erfolg!
                  Herausgeber: LBS



 APC&amp;TCP-FD 11    Diese Disk wurde am 18.7.1994 erstellt/updated!

 HelicopterMission: Das Werbegame von der Bundeswehr.
                    Hier mu&szlig; man mehrere Missionen mit einen Hubschrauber 
                    erfolgreich bestehen.



 APC&amp;TCP-FD 12    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Tricky Quicky:   Ein Werbegame von Nesquik.
                  Ein nettes Jump n Run Game in dem man den bekannten 
                  Hasen steuern mu&szlig; um die verlorenen Rezeptseiten wieder 
                  einzusammeln. Dabei mu&szlig; man etlichen Gegner ausweichen 
                  und sogar unter Wasser mu&szlig; man aktiv sein!



 APC&amp;TCP-FD 13    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Bifi 2:          Action in Hollywood; Die Fortsetzung von dem erfolgreichen 
                  Werbespiel Bifi-Snackzone. Noch erfolgreicher, noch 
                  spannender. Eine spitzen Grafik und ein durchdachtes 
                  Spielprinzip sorgen f&uuml;r viele Stunden Spa&szlig; am Compi.



 APC&amp;TCP-FD 14    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Auf dieser Disk befinden sich diverse Packtools damit die ganzen Daten auf
 der Festplatte nicht mehr so viel Speicherplatz verbrauchen. Packer wie
 LHA oder DMS sind in der DFUE einfach ein MU&szlig; die jeder haben sollte.
 Au&szlig;erdem sind noch einige grafische Oberfl&auml;chen f&uuml;r LHA und DMS auf dieser
 Diskette vorhanden.
 Auf dieser Disk befindet sich:

 DMS 2.01
 LHA 1.51
 ARC
 ZOO,
 Packertool 1.58
 Powerpacker 2.2a (Diese Version ist noch PD!!).



 APC&amp;TCP-FD 15    Diese Disk wurde am 25.10.1994 erstellt/updated!


 Magic Workbench  Der ultimative WB-Enhancer, der auf keinem
                  Amiga fehlen darf. (wem's gefaellt...)
                  Bietet fantastische Patterns!
                  Version 2.0d (Demo), benoetigt AmigaOS 2.0
                  Autor: Martin Huttenloher

 Magic Menu 1.27: Endlich ein richtig gutes Menu auf seinem Amiga.
                  Eine Ideale Erg&auml;nzung zu Magic Workbench.



 APC&amp;TCP-FD 16    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Twilight Zone  : Ein gigantisch guter Screenblanker
 ABackup 4.06   : Eines der besten HD-Backup-Programme.
                  Mit diesem Programm kann man auf einfache Art und Weise
                  eine Sicherheitskopie seiner Festplatte machen!
 Console Lock1.1: Ein Screenblanker mit Pa&szlig;wortabfrage!
 MagicWBHinterg.: Diverse Hintergr&uuml;nde f&uuml;r die Magic Workbench.



 APC&amp;TCP-FD 17    Diese Disk wurde am 18.10.1994 erstellt/updated!

 Auf dieser Disk sind einige ganz interessante Disk-Utilities vorhanden.
 Einige dieser Programme erinnern sehr stark an Directory Opus.

 ABCDir
 DirKing 2.12
 DirWork 1.62
 DiskCat 2.1
 DiskMate 4.3.



 APC&amp;TCP-FD 18    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Auf dieser Disk sind spezielle Programme um Daten zu retten.
 Mit diesen Programmen kann man seine Festplatte oder Disks aufr&auml;umen,
 gel&ouml;schte Daten evtl. wiederherstellen, valedieren usw.
 Programme wie Disksalv sollten zur Standartausr&uuml;stung eines User
 geh&ouml;ren!

 Disksalv2
 FixDisk 1.2
 Undelete
 HD-Menu2.0.



 APC&amp;TCP-FD 19    Diese Disk wurde am 18.10.1994 erstellt/updated!

 Diese Disk haben wir ganz der Musik auf dem Amiga gewidmet, Hier findet
 ihr diverse Player, Editoren f&uuml;r so ziemlich alle Arten von Sounds
 auf dem Amiga. Achja, wenn jemand Soundmodule haben will, braucht
 er nur mal in die "Soundmodule"-Serie von APC&amp;TCP schaun. Da sind
 ma&szlig;enweise Songs vorhanden.

 OctamedPlayer 4.04
 PlaySid 2.2
 PowerPlayer 4.0
 SmallPlayer 1.0a
 SmartPlayer 3.0
 Superplay
 DSound 1.31.



 APC&amp;TCP-FD 20    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Hauptschwerpunkt dieser Disk ist der Bereich DF&Uuml;. Hier findet ihr das
 Pointprogramm MICRODOT 1.6  (Nicht verwechseln mit einem Terminalprogramm)
 als LHA-Archiv. Leider mu&szlig;ten wir das Programm so packen, weil es sonst
 nicht auf die Diskette passen w&uuml;rde. Wie man sich denken kann ben&ouml;tigt
 man also eine Festplatte um das Programm zu starten.

 Au&szlig;erdem befindet sich noch ein ziemlich simples Terminalprogramm
 namens JRComm auf der Disk.

 Und zu guter letzt findet man noch ein Programm mit dem man seine
 Autokosten berechnen kann sowie ein Programm das wenn man die
 Vorwahl der Telefonnummer eintippt den Ortsnamen anzeigt.



 APC&amp;TCP-FD 21 a  Diese Disk wurde am 20.7.1994 erstellt/updated!

 Auf dieser Disk ist das Terminalprogramm TERM 4.0 als LHA Archiv
 abgelegt. Eines der besten Terminalprogramme f&uuml;r den Amiga.
 Leider passt nicht alles auf diese Disk obwohl es mit LHA
 gepackt wurde. Auf der APC&amp;TCP-FD 21 b findet ihr die restlichen
 Files von TERM 4.0
 Eine Festplatte wird ben&ouml;tigt!

 Mit dem Programm SYSINFO 3.22 bekommt man sehr interessante Informationen
 &uuml;ber seinen Amiga und mit dem Programm CONVERTHAM 1.2 kann man, wie der
 Name ja schon sagt, Bilder konvertieren.



 APC&amp;TCP-FD 21 b  Diese Disk wurde am 20.7.1994 erstellt/updated!

 Hier findet ihr die restlichen Files von TERM 4.0!



 APC&amp;TCP-FD 22    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Mit dem Programm VIEWTEK 2.1 kann man so ziemlich jede Art von Pictures
 auf seinen Amiga anschauen.



 APC&amp;TCP-FD 23    Diese Disk wurde am 18.10.1994 erstellt/updated!

 Auch diese Disk ist ganz und gar dem Anzeigen und bearbeiten von Grafiken
 und Texten gewidmet.

 FastGif 1.08:    Zum Anzeigen von GIF-Pictures
 FastJPEG 1.10:   Zum Anzeigen von JPEG-Pictures
 FullView:        Zum Anzeigen von Texten
 Muchmore 4.4:    Zum Anzeigen von Texten
 MoviePlayer:     Zum Abspielen von Animationen.


 Protector 1.7 ist ein Tool das viele Gurus auf dem Amiga abfangen kann
 und evtl. Datenverluste verhindert.



 APC&amp;TCP-FD 24    Diese Disk wurde am 18.10.1994 erstellt/updated!

 DiskPrint:       Ein geniales Programm zum ausdrucken von Diskettenetiketten.
 Freepaint:       Ein Zeichenprogramm das man locker mit DPaint II vergleichen
                  kann.
 Snoopdos3.0:     Zeigt an, was der Amiga gerade so alles macht. Sollte jeder
                  haben, da viele Fehler am besten mit diesem Programm
                  gefunden werden. So kann man z.B. feststellen ob das Programm
                  auch die richtigen Pfade benutzt, was es alles nachladen tut
                  usw.



 APC&amp;TCP-FD 25    Diese Disk wurde am 18.7.1994 erstellt/updated!

 TOOLMANAGER 2.1: Toolmanager ist ein Programm mit dem man ein eigenes Menue 
                  auf der Workbench integrieren kann. Oder ne DOK-Leiste auf 
                  der Workbench gef&auml;llig?
                  Kein Problem, der Toolmanager schafft das ohne Probleme! 
                  Einfach zu installieren. Kein l&auml;stiges suchen mehr auf der 
                  Festplatte um ein Programm zu starten! Hier auf der Disk 
                  ist der erste Teil vom Toolmanager.
                  Auf der APC&amp;TCP-FD 26 befindet sich der zweite Teil!
                  Aber eine Festplatte sollte man schon besitzen ! Ben&ouml;tigt
                  OS2.x



 APC&amp;TCP-FD 26    Diese Disk wurde am 18.7.1994 erstellt/updated!

 TOOLMANAGER 2.1: Zweiter Teil ist auch auf dieser Disk vorhanden.

 SHOW GURU 2.1:   Mit diesem Programm kann man sich die verschiedenen
                  Gurunummern erkl&auml;ren lassen.

 AROUTE:          ARoute ist ein Shareware-Programm mit dem man sich eine 
                  Fahrstrecke von einem Ort zum anderen anzeigen lassen kann. 
                  Nat&uuml;rlich werden auch die Kilometer und die Fahrzeit
 ausgerechnet. 
                  Demoversion.

 FREI:            Mit diesem Programm kann man sich grafisch anzeigen lassen, 
                  wieviel Platz noch auf seiner Festplatte ist.

 NoteIt!:         Ein kleiner sehr n&uuml;tzlicher Notizzettel f&uuml;r alle 
                  vergesslichen Amiga-User:-)

 Weil noch etwas Platz auf der Disk war haben wir noch schnell einen
 Editor auf die Disk geknallt mit dem man die Artikel f&uuml;r die NoCover
 layouten kann. Aber wie gesagt: Nur der Editor+Anleitung. Nicht das
 Anzeigeprogramm!



 APC&amp;TCP-FD 27    Diese Disk wurde am 18.7.1994 erstellt/updated!

 SUPER DUPER 3.1: Eines der besten Kopierprogramme auf dem Amiga.
                  Schnelles kopieren und trotzdem sicher ist f&uuml;r dieses 
                  Programm &uuml;berhaupt kein Problem. Kopieren auf bis zu 4 
                  Laufwerken ist auch aus dem RAM- oder HD-Puffer m&ouml;glich. 
                  Ein Mu&szlig; f&uuml;r jeden Amiga-Freak.
                  Ben&ouml;tigt OS 2.x

 VIDEOTITLER 1.1: Ist eine Demoversion die ein Mitglied von uns geschrieben
 hat. 
                  Eine g&uuml;nstige L&ouml;sung um Videos zu betiteln.



 APC&amp;TCP-FD 28    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Diese Disk ist allen geplagten A600, A1200 und A4000-Usern gewidmet.
 Mit den Programmen auf dieser Disk vekommt man viele (nicht alle)
 Programme und Games wieder auf diesen Compis zum laufen. Also wenn man
 Spiele oder Programme hat die auf diesen Rechner nicht mehr laufen hat
 man mit diesen Tools recht gute Chancen wieder den Joystick zu
 r&uuml;tteln!

 Degrader 1.3
 KillAGA 2.0
 RunIt 1.6
 WbKillAGA 1.0.



 APC&amp;TCP-FD 29    Diese Disk wurde am 18.7.1994 erstellt/updated!

 1990-93er:       Auf dieser Disk ist eine Demoversion von unserem
                  eigenem Spiel 1990-Die 93er Edition. 
                  Immerhin bekamen wir f&uuml;r dieses Game in der Joker
                  74% im Dauerspa&szlig; und in der ASM die Note 9 (gut). 
                  Es handelt sich hierbei um eine Politsimulation, 
                  deren Realismus bis jetzt in diesem Genre noch
                  ungeschlagen ist. Um das zu erreichen mu&szlig;te leider 
                  die Grafik etwas darunter leiden. Aber wie gesagt, 
                  es wurde auf dem Realismus wert gelegt!
                  Ben&ouml;tigt 1 MB RAM.
                  Demoversion.



 APC&amp;TCP-FD 30    Diese Disk wurde am 18.7.1994 erstellt/updated!

 BANGBOO:         Auf dieser Disk ist das nette Ball-Spiel BANGBOO.
                  Es ist noch eine Beta-Demoversion, da das Spiel noch
                  nicht fertig gestellt worden ist. Aber mit dieser Disk
                  k&ouml;nnt ihr schon mal die ersten Eindr&uuml;cke sammeln
                  und nat&uuml;rlich auch Verbesserungsvorschl&auml;ge an uns schicken!
                  Demoversion.



 APC&amp;TCP-FD 31    Diese Disk wurde am 18.7.1994 erstellt/updated!

 TAUTRIX:         Hier findet ihr das gleine aber nette Game TAUTRIX als
                  Demoversion. Es handelt sich hierbei um eine Art
                  Tetrisclone was auch von uns stammt.
                  Aber was schreib ich hier lange rum. Schaut es Euch einfach
                  mal an!
                  Demoversion.


 APC&amp;TCP-FD 32    Diese Disk wurde am 29.10.1994 erstellt/updated!

 DATABENCH:       Hier findet ihr unser gr&ouml;&szlig;test Meisterwerk das uns bis 
                  jetzt gelungen ist. Die DATABENCH! Nat&uuml;rlich nur eine 
                  Demoversion, aber daf&uuml;r nutzbar! Die DATABENCH ist eine 
                  Datenbank wie sie es noch nie in dieser Preisklasse
                  gegeben hat. Und nat&uuml;rlich wird sie immer weiterentwickelt 
                  und verbessert.
                  Updates gibt es kostenlos gegen Originaldisks und R&uuml;ckporto.
                  Demoversion.

 APC&amp;TCP-FD 33    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Auf dieser Disk findet ihr diverse LIBS die man so f&uuml;r den allt&auml;glichen
 Umgang mit PD-Programmen so ben&ouml;tigt.
 AmigaGuide.Library 40.6
 arp.library 39.1
 ATN.library
 color.library
 FileID.library 3.0
 GadTools.Library
 IFF.library 23.2
 MedPlayer.Library
 metaxpr.library
 muimaster.library 7.973
 popper.library
 PowerPacker.Library 35.347
 req.library 2.7
 ReqTools.Library 38.1248
 rexxarplib.library
 rexxextra.library 1.2
 rexxserdev.library
 samp.library
 toolmanager.library 3.0
 vmem.library 1.1
 xpkmaster.library
 xpkRDCN.library
 xprascii.library
 xprbimodem.library
 xprbplus.library
 xprcheatmodem.library
 xpremzmodem.library
 xprjmodem.library
 xprkermit.library
 xprquickb.library
 xprszmodem.library
 xprvms.library
 xprxmodem.library
 xprymodem.library
 xprzedzap.library
 XprZmodem.Library
 xprzvoice.library
 xpkBLZW.library 3.0
 xpkCBR0.library 1.0
 xpkCRMS.library 1.1
 xpkDHUF.library 0.58
 xpkDLTA.library 0.1
 xpkFEAL.library
 xpkHUFF.library 0.62
 xpkIDEA.library 0.99
 xpkIMPL.library 1.0
 xpkNONE.library
 xpkNUKE.library
 xpkRDCN.library
 xpkRLEN.library
 xpkSHRI.library 0.1
 xpkSMPL.library 1.0
 xpkSQSH.library 1.10



 APC&amp;TCP-FD 34-a Diese Disk wurde am 18.7.1994 erstellt/updated!

 Auf dieser Disk findet ihr diverse Druckertreiber. Wir geben keine Garantie
 auf lauff&auml;higkeit, da wir viele von Mitgliedern ohne dok. zugeschickt bekommen
 haben und diese nat&uuml;rlich auch nicht testen k&ouml;nnen! Die Treiber sind als
 LHA-Archiv auf Disk.

 CanonStudio.LHA
 EPSON24PLUS.LHA
 EPSONQPLUS350.LHA
 EpsonQXPlus51.lha
 fujidl900-11.lha
 Fujitsu.DMS
 HP-Druckertreiber.LHA
 hpcolor-374.lzh
 HPTreiber.lha
 HP_550C.LHA
 Star9Plus.lha
 StarSJ144.lha
 Star_24Plus.lha

 APC&amp;TCP-FD 34-b  Diese Disk wurde am 18.7.1994 erstellt/updated!

 Und noch eine Disk mit Druckertreiber!
 ALPHACOM_ALPHAPRO_101
 ALPHACOM_PRO101
 ALPHAPR101.1
 ALPHAPR101.2
 APPLE_PLOTTER
 BROHR15XL.1
 BROHR15XL.2
 BROTHER_HR-15XL
 BROTHER_HR-15XLA
 CALCOMP_COLORMASTER
 CALCOMP_COLORMASTER2
 CANNON
 CANON1080A.1
 CANON1080A.2
 CANON1080A.3
 CANON_PJ-1080A
 CBM_MPS1000
 CBM_MPS2XXX
 CITOH.DRI.CH
 CITOH8510.1
 CITOH8510.2
 CITOH_PROWRITER
 CORONAD300
 DIABLO630.1
 DIABLO630.2
 DIABLO_630
 DIABLO_630A
 DIABLO_ADVANTAGE_D25
 DIABLO_ADV_D25A
 DIABLO_C-150
 DIABLO_C-150A
 EPSON-MX80-DP
 EPSON.1
 EPSON.2
 EPSON0
 EPSON1
 EPSON2
 EPSON3
 EPSONJX80.1
 EPSONJX80.2
 EPSONLQ800
 EPSONQ
 EPSONXOLD
 EPSON_HI80
 EPSON_JX-80
 EPSON_JX-80A
 EPSON_LQ800
 GEMINI.10X
 GEMINI10X
 GEMINI_STAR10
 GENERIC
 GENERIC.1
 GENERIC.2
 HI_DMP_52_MP
 HOWTEK_PIXELMASTER
 HPLASER+.1
 HPLASER+.2
 HPLASERJET.1
 HPLASERJET.2
 HP_7448_COLOR_PRO
 HP_7470A
 HP_DESKJET
 HP_LASERJET
 HP_LASERJETA
 HP_LASERJET_PLUS
 HP_LASERJET_PLUSA
 HP_PAINTJET
 HP_THINKJET
 IBM_COLOURJET
 IMAGEWRITERII
 MANNESMANN_PIXY_3
 MORE
 MPS1000.1
 MPS1000.2
 NEC8025A
 NECP6.1
 NECP6.2
 NECP6.3
 NEC_8025A
 NEC_CP6
 NEC_PINWRITER
 OKIDATA292
 OKIDATA92
 OKIDATA_292
 OKIDATA_293I
 OKIDATA_92
 OKIDATA_ML92
 OKIMATE_20
 OKIMATE_20A
 PANASONIC_KX-P10XX
 PANKX
 PENMAN_PLOTTER
 PLOTDRIVER.DMP52
 PLOTDRIVER.HI80
 PROWRITER
 QUADRAM_QUADJET
 QUME_LETTERPRO_20
 QUME_LTRPRO_20A
 ROLAND.1212A
 ROLAND_CAM3
 ROLAND_DXY_2000
 ROLAND_DXY_800
 ROLAND_DXY_980
 SEIKOSHA_GP700-A
 SMITHCORONA_D300
 STARSG10
 THINKJET
 TOSHIBA_P351C
 TOSHIBA_P351SX
 XEROX_4020


 APC&amp;TCP-FD 34-c Diese Disk wurde am 30.8.1994 erstellt/updated!

 Auf dieser Disk findet ihr noch mehr Druckertreiber:

 CanonBJC
 Canon_PJ-1080
 Diablo
 Alphapr101
 BroHR15XL
 CItohProWriter8510
 CoranaD300
 Ltrpro20
 MPS1000
 Olympia
 Xerox_4045
 EpsonJX80
 EpsonLQ800
 FujitsuDLv3.1
 FujitsuDLv4.0_MUI
 Gemini10X
 HP-III PController
 HP4-Setter
 HP_500C
 HP_Deskjet500
 HP-DeskJet550C
 HP_LJ_4
 NEC8025A
 OKI
 PanasonicPlus
 Panasonic_KX-P10xx
 Star24Plus
 Star9Plus
 StarSG10

 PageStreamTreiber:

 DJ550C
 DJ550CPS
 HPDJ500C
 HPLaser
 HPLJ4



 APC&amp;TCP-FD 35 Diese Disk wurde am 18.7.1994 erstellt/updated!

 Auf dieser Disk findet ihr das gigantische Tool KCOMMODITY 2.1 als
 LHA Archiv. Es handelt sich wirklich um eine Art Multi-Tool!
 Screenblanker, Uhr, Formatierprogramm, Mausbeschleuniger, Alarm, Hotkeys,
 Funktionstastenbelegung, Grafikausdruck und vieles mehr.
 Ein Tool was jeder installiert haben sollte.
 Aber eine Festplatte sollte schon vorhanden sein!

 Mit dem Programm SAG kann man auf einfache Art und Weise ASCII-Texte
 seinem Amiga sprechen(!!) lassen. Nat&uuml;rlich auf DEUTSCH. Naja, nicht
 perfekt, aber ganz lustig!


 APC&amp;TCP-FD 36    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Hier ist ein Terminalprogramm Namens NComm 2.0 installiert. Einfach den
 Compi mit dieser Disk starten und schon kann man endlich sein Modem
 ausprobieren. Die wichtigsten Einstellungen sind schon gemacht, so das
 es selbst f&uuml;r Anf&auml;nger keine Probleme geben d&uuml;rfte.



 APC&amp;TCP-FD 37    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Auf dieser Disk und auf der Disk APC&amp;TCP-FD 38 ist die Demoversion
 der Textverarbeitung TEXTPLUSPROF. 5.01 installiert. Diese Version
 ist NUTZBAR!! Also eine nette L&ouml;sung wenn man schnell mal einen Brief
 oder sogar einen Artikel f&uuml;r die NoCover schreiben will.
 Einfach Disk rein und den Rechner damit starten.



 APC&amp;TCP-FD 38    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Hier sind die ganzen Anleitungen von TEXTPLUS von der Disk
 APC&amp;TCP-FD 38 vorhanden. Gelesen werden sie mit TextPlus.



 APC&amp;TCP-FD 39    Diese Disk wurde am 18.7.1994 erstellt/updated!

 The Dating Game: Eine Animation von Eric Schwartz die 3 MB RAM ben&ouml;tigt.
                  Disk 1 von 2



 APC&amp;TCP-FD 40    Diese Disk wurde am 18.7.1994 erstellt/updated!

 The Dating Game: Disk 2 von 2.



 APC&amp;TCP-FD 41    Diese Disk wurde am 18.7.1994 erstellt/updated!

 At the Movies:   Eine Animation von Eric Schwartz die 2.5 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 42    Diese Disk wurde am 18.7.1994 erstellt/updated!

 At the Movies II:Eine Animation von Eric Schwartz die 1 MB RAM und 
                  2 Laufwerke ben&ouml;tigt.
                  Disk 1 von 4



 APC&amp;TCP-FD 43    Diese Disk wurde am 18.7.1994 erstellt/updated!

 At the Movies II:Disk 2 von 4



 APC&amp;TCP-FD 44    Diese Disk wurde am 18.7.1994 erstellt/updated!

 At the Movies II:Disk 3 von 4



 APC&amp;TCP-FD 45    Diese Disk wurde am 18.7.1994 erstellt/updated!

 At the Movies II:Disk 4 von 4



 APC&amp;TCP-FD 46    Diese Disk wurde am 18.7.1994 erstellt/updated!

 A day at 
 the Beach:       Eine Animation von Eric Schwartz die 3 MB RAM ben&ouml;tigt.
                  Disk 1 von 2.



 APC&amp;TCP-FD 47    Diese Disk wurde am 18.7.1994 erstellt/updated!

 A day at 
 the Beach:       Disk 2 von 2.



 APC&amp;TCP-FD 48    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Quality Time:    Eine Animation von Eric Schwartz die 5 MB RAM ben&ouml;tigt.
                  Disk 1 von 4



 APC&amp;TCP-FD 49    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Quality Time:    Disk 2 von 4



 APC&amp;TCP-FD 50    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Quality Time:    Disk 3 von 4



 APC&amp;TCP-FD 51    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Quality Time:    Disk 4 von 4



 APC&amp;TCP-FD 52    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Amy VS Walker:   Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 53    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Bait Masking:    Eine Animation von Eric Schwartz die 2 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 54    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Pogo:            Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 55    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Unsporting:      Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 56    Diese Disk wurde am 18.7.1994 erstellt/updated!

 VTOL Contest:    Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 57    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Stealthy 
 Manuever II:     Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 58    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Camouflage:      Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 59    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Late Night:      Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 60    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Lemming II Anim: Eine Animation die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 61    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Soviet Soft 
 Landing:         Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 62    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Korean Conflict: Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 63    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Batman:          Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 64    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Coyote 2:        Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 65    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Juggette:        Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 66    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Juggette 2:      Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 67    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Juggler 2:       Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 68    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Navy Aggressor 
 Training:        Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 69    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Shuttle Cock:    Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 70    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Terminal:        Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 71    Diese Disk wurde am 18.7.1994 erstellt/updated!

 The big Sneeze:  Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 72:   Diese Disk wurde am 18.7.1994 erstellt/updated!

 Vietnam Conflict:Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 73    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Amy Jogs:        Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 74    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Lemming VS 
 James Pond:      Eine Animation die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 75    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Back from the 
 beach:           Eine Animation mit den Eric Schwartz Figuren 
                  (stammt aber nicht von ihm).
                  Ben&ouml;tigt 1 MB RAM.



 APC&amp;TCP-FD 76    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Kleine 
 Zeichenschule:   Ein paar Interessante Texte und Bilder um etwas 
                  besser mit der Maus beim malen umgehen zu k&ouml;nnen. 
                  Keine Garantie auf lauff&auml;higkeit!!



 APC&amp;TCP-FD 77    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Swiss F16 Combat:Eine Animation von Eric Schwartz die 1.5 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 78    Diese Disk wurde am 18.7.1994 erstellt/updated!

 ATF Agility:     Eine Animation von Eric Schwartz die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 79    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Gulf Conflict:   Eine Animation von Eric Schwartz die 2.5 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 80    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Juggler:         Eine Animation die 1 MB RAM ben&ouml;tigt.



 APC&amp;TCP-FD 81    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Anti Lemming:    Eine Animation von Eric Schwartz die 2 MB RAM ben&ouml;tigt.
                  Ist als LHA-Archiv auf der Disk vorhanden. Es wird eine 
                  Festplatte oder extrem viel RAM ben&ouml;tigt. Der LHA PAcker 
                  ist auch auf der Disk vorhanden.



 APC&amp;TCP-FD 82    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Lemmings Revenge:Eine Animation mit den Erci Schwartz Figuren die aber 
                  nicht von ihm stammt. Ben&ouml;tigt 2.5 MB RAM, Festplatte 
                  ODER 2 Laufwerke.
                  Disk 1 von 2.



 APC&amp;TCP-FD 83    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Lemmings Revenge:Disk 2 von 2.



 APC&amp;TCP-FD 84    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Coyote:          Eine Animation mit dem ber&uuml;hmten Coyoten aus Roadrunner.
                  Ben&ouml;tigt 1.5 MB RAM.
                  Disk 1 von 2.



 APC&amp;TCP-FD 85    Diese Disk wurde am 18.7.1994 erstellt/updated!

 Coyote:          Disk 2 von 2.



 APC&amp;TCP-FD 86    Diese Disk wurde am 13.8.1994 erstellt/updated!

 Friday the 24th: Es ist eine etwas makabere aber ganz lustige
                  Animation die 1.5 MB RAM ben&ouml;tigt.
                  Disk 1 von 2.



 APC&amp;TCP-FD 87    Diese Disk wurde am 13.8.1994 erstellt/updated!

 Friday the 24th: Disk 2 von 2.



 APC&amp;TCP-FD 88    Diese Disk wurde am 30.8.1994 erstellt/updated!

 STAR WARRIOR:    Star Warrior ist ein Action-Game f&uuml;r 2 Spieler mit 
                  strategischen Elimenten. Ziel des Spiels ist die Eroberung 
                  eines Raumsektors. Dazu stehen verschiedene Raumschiffe, 
                  vom leichten J&auml;ger bis zum Gro&szlig;kampfschiff zur Verf&uuml;gung. 
                  Planeten m&uuml;&szlig;en erobert werden. Diese erwirtschaften Geld 
                  mit dem man die eigene Raumflotte ausbauen kann.
                  Auf dem eroberten Planeten k&ouml;nnen Vorposten errichtet werden, 
                  von denen man Angriffe auf gegnerische Schiffe und Planeten 
                  starten kann.
                  Die Raumschlachten werden im "Archon"-Stil ausgefochten.
                  Die Vollversion ist auf der APC&amp;TCP-Shareware Serie erh&auml;ltlich!



 APC&amp;TCP-FD 89    Diese Disk wurde am 14.10.1994 erstellt/updated!

 KELLOGS:         Ein ganz nettes kleines Jump n Run Game. 
                  Allerdings wohl eher f&uuml;r die j&uuml;ngere Generation gedacht.
                  Werbegame von Kellogs. Nemoetigt 1 MB RAM.



 APC&amp;TCP-FD 90    Diese Disk wurde am 18.10.1994 erstellt/updated!

 DeluxeGalaga v2.3:   Neben Kleinigkeiten wie &uuml;bersichtlichere Menuleiste,
                      neue Grafiken und diverse Extras ist insbesondere der
                      Teammodus hervorzuheben. Auch der Schwierigkeitsgrad
                      ist zun&auml;chst angenehm leicht, wird dann aber rasch
                      "sauschwer" - langer Spielspa&szlig; garantiert.
                      Die "Hintergrundstory" ist altbekannt: In einem kleinen
                      Starfighter fliegt Du Patrouille und mu&szlig;t dabei die Er-
                      de vor feindlichen Angreifern sch&uuml;tzen. Dabei bist Du 
                      zun&auml;chst aber noch nicht darauf vorbereitet. Erst mit
                      erfolgreich abgeschlossenen Aktionen erh&auml;ltst Du bes-
                      sere Waffen, gr&ouml;&szlig;ere Schiffe und andere Extras...
                      Dieses Spitzengame tr&auml;gt den Beinamen DELUXE wirklich
                      zu Recht! Shareware! - OS 1.3-3.0.
                ---&gt;  Die Einstellungen (Chipsatz, Prozessor) k&ouml;nnen abge-
                      speichert werden; die Disk darf dann nicht schreib-
                      gesch&uuml;tzt sein. Au&szlig;erdem k&ouml;nnen eigene Module/Samples
                      (im ProTracker-Format) eingebunden werden!
                      Autor: Edgar M. Vigdal



 APC&amp;TCP-FD 91    Diese Disk wurde am 18.10.1994 erstellt/updated!

 MARBLELOUS:      Marblelous ist ein neues Game aus dem Hause
                  APC&amp;TCP. Ein Spiel was einem nicht mehr so schnell
                  loslaesst. 
                  In diesem Game steuert man eine Kugel und muss mit dieser
                  diverse Poweritems einsammeln bevor man endlich ins
                  sichere Ziel steuert. Aber so ganz einfach wie sich
                  das anhoert ist es nun auch wieder nicht. Denn man steuert
                  die Kugel nicht direkt sondern muss Wegweiser aufstellen
                  die die Rollrichtung der Kugel beeinflussen.
                  Schaut Euch einfach mal die Demoversion an und ihr
                  werdet zum gleichen Ergebnis kommen wie wir:
                  Das Spiel ist eifach gigantisch.
                  Die Vollversion besitzt uebrigends 100 Level.
                  Demoversion. 
                  Vollversion erh&auml;ltlich bei APC&amp;TCP.

</PRE>
                      </TD>
                    </TR>
                  </TABLE>
                  <BR>
                  <IMG src="pdl02.png" alt=""> 
                </TD>
              </TR>

              <TR>
                <TD><IMG src="pdl.gif" alt="" width="640" height=
                "22" border="0" usemap="#pdl0"> </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

