<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>FD-Hitparade</TITLE>
  </HEAD>

  <BODY text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=
    "Beitrag" bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="smt0">
            <AREA shape="rect" coords="460,1,530,22" href=
            "smt.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="0" summary=
            "Seitenformat" bgcolor="#ffff00">
              <TR>
                <TD><IMG src="smt.gif" alt="" width="640" height=
                "22" border="0" usemap="#smt0"> </TD>
              </TR>

              <TR>
                <TD>
                  <TABLE border="0" cellpadding="4" summary="Text"
                  align="center">
                    <TR>
                      <TD>
<PRE>
                                        Die unabh&auml;ngigen FD-Charts des FORUM
F D - H I T P A R A D E  -  Nummer 14   AMIGA, der NAMELESS, POWERBREI sowie
=====================================   der NO COVER, A&amp;M-INFO, von GO! u.a.

Dieses Mal gewonnen hat:
&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;
N I C O   G R I S C H A U       eine Kopie des ENERGIE-MANAGERs

Gratulation !!!

Obwohl meine Disk das letzte Mal Peter H&auml;ndel zu sp&auml;t erreichte, und die FD-
Hitparade somit nicht auf dem FORUM AMIGA 21 erschienen ist, haben mich doch
20 Einsendungen erreicht - nur 3 weniger als das letzte Mal.

Hauptursache daf&uuml;r d&uuml;rfte die starke Zunahme an Einsendungen aus der DF&Uuml;-Sze-
ne sein (weiter so!).
Trotzdem haben es dieses Mal nur recht wenige Neueinsteiger geschafft, gleich
in die Top 15 der FD-Spiele/Anwendungen/Serien einzusteigen. Insgesamt 5 Neue;
das ist nicht allzu viel...

Allerdings gab es &uuml;berall sehr viele Neuvorschl&auml;ge. Mal sehen, ob sich das
n&auml;chste Mal wieder mehr Neue in den jeweiligen Top 15 befinden werden...


Was ist also tun, damit man gewinnen kann?
&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;
Schreibt einfach eine Karte (oder sonstwas) an:
- Stefan Grad, Bahnhofstr. 37, 78588 Denkingen, Deutschland
- oder an eine der Adressen der DiskMag-Herausgeber (siehe unten)
- oder schickt eine E-Mail an eine der unten angegebenen Adressen.

Au&szlig;er Eurer Adresse solltet Ihr noch Eure 5 Lieblings-Spiele, 5 Lieblings-An-
wendungen und 5 Lieblings-FD-Serien sowie die Disk, die Ihr im Falle eines
Gewinnes haben wollt, angeben. Falls die Programme/Serien nicht in den Top 15
enthalten sind, ben&ouml;tige ich auf jeden Fall noch die Autoren/Ersteller sowie
die Diskette, auf der das Programm zu finden ist. Mindestens 2 der oben ge-
nannten Rubriken sollten komplett (also 5 Sachen von 1-5 durchnumeriert) ab-
gedeckt werden (ohne falsche Eintragungen, d.h. kommerzielle Soft oder Demo-
Versionen). Andere Wertungen gehen zwar in die Charts ein, nehmen aber nicht
an der Verlosung teil.
Der Rechtsweg ist nat&uuml;rlich ausgeschlossen.

Ihr k&ouml;nnt selbstverst&auml;ndlich auch den beigef&uuml;gten Vordruck verwenden. Druckt
ihn einfach aus und f&uuml;llt ihn aus. Wenn Ihr neue Sachen vorschlagen wollt,
benutzt die freien Felder unter den jeweiligen Charts. In die 1. Spalte kommt
immer die Wertung, in die 2. der Name des Spiels/Progs/der Serie, in die 3.
der Autor/Ersteller und in die 4. die Disk-Nr. (f&uuml;r alle, die&acute;s noch nicht
kapiert haben).

Zu gewinnen gibt&acute;s immer eine PD-Disk nach Wahl (sorry, aber ich bin weder
ein H&auml;ndler noch in irgendeiner Art reich (Zivi)), aber manchmal spendet ja
noch irgendjemand (ein H&auml;ndler, Club, etc.) was...
Jedes Produkt, das ich von einem H&auml;ndler oder Club zur Verlosung bei der FD-
Hitparade eingeschickt bekomme, wird von mir - sofern erw&uuml;nscht - ausgiebig
vorgestellt und getestet. Herstellernamen und Bezugsquelle werden nat&uuml;rlich
auch angegeben !!!

Seit dieser Ausgabe existiert &uuml;brigens ein ver&auml;ndertes Copyright:
&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;
Diese FD-Hitparade ist ab sofort frei vertreibbar, d.h. sie darf in Disk-Mags
etc. aufgenommen werden, wenn ich von der entsprechenden Disk ein Exemplar
erhalte. Ersteller von Disk-Mags k&ouml;nnen auch immer die aktuelle FD-Hitparade
direkt von mir bekommen, wenn ich jeweils die neuste Ausgabe erhalte.
Die Verbreitung per DF&Uuml; ist erw&uuml;nscht, aber nur erlaubt, wenn f&uuml;r das Saugen
der FD-Hitparade neben den Telefongeb&uuml;hren keine weiteren Geb&uuml;hren genommen
werden.
Auch kostenlose Verbreitung in sonstiger Weise ist erlaubt.

Alle Disk-Mags, die die FD-Hitparade direkt von mir erhalten, werden am Kopf
der FD-Charts angegeben.
Disk-Mags, von denen ich f&uuml;r die FD-Hitparade kein Exemplar der jeweiligen
Serie erhalten habe, werden aus der Titelzeile entfernt und vorerst nicht
weiter mit den FD-Charts versorgt.


Soweit hierzu. - Jetzt aber endlich zu den   H i t l i s t e n:
                                             &macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;
Zun&auml;chst einmal sollte ich die Bedeutung der einzelnen Zeilen erkl&auml;ren:
(A) - Platzierung
(B) - Programm-Name (bei der FD-Serien-Chart der Serien-Name)
(C) - Autor(en) (bei der FD-Serien-Chart der Serien-Ersteller)
(D) - Diskette, auf der das Programm u.a. zu finden ist (bei der FD-Serien-
      Chart eine Kurz-Charaktisierung der Serie)
(E) - Punkte, die das Programm (oder die Serie) erreicht hat
      Zur Punkteverteilung: der 1. Platz einer Wertung bekommt 5 Punkte, der
      2. Platz 4, der 3. Platz 3, der 4. Platz 2 und der 5. Platz 1; zus&auml;tz-
      lich gibt es noch ein paar Bonus-Punkte)
(F) - Platzierung in der vorigen Ausgabe


Und hier sind sie... die FD-Charts Ausgabe 14:


S P I E L E:
~~~~~~~~~~~~
Und wir haben eine neue Nummer 1:

(A) (B)                 (C)                     (D)               (E)   (F)
 1. TRICKY QUIKY        Herausgeber: Nesquik    GPD-Disk 70        34   ( 4)
 2. MEGABALL V3.0 (AGA) Ed Mackey               Spielekiste 418    31   ( 2)
 3. ARMY MINER V1.1     Alain LaFerriere        Spielekiste 329    29   ( 5)
 4. ENERGIE-MANAGER     Her.: Wirtschaftsmin.   Spielekiste 359    28   ( 3)
 5. DELUXE GALAGA (*)   E.M. Vidgal             Spielekiste 445    27   (10)
 6. SNACKZONE           Herausgeber: Bifi       Spielekiste 318    23   ( 1)
 7. JUWELEN DES LICHTS  M.Lampe,R.M&uuml;ller (V2.0) Spielekiste 377ab  20   ( 9)
 8. TELEKOMMANDO II     Herausgeber: Telekom    Spielekiste 406    15   ( 6)
 9. BACKSTAGE           Herausgeber: Liveclub   GPD-Disk 65        14   ( 7)
10. DELUXE PACMAN                               Spielekiste 186    14   ( 8)
11. DOODY               W.G.C.S.                GPD-Disk 56        10   (14)
12. VL                  Herausgeber: LBS        Spielekiste 324    10   (11)
13. TILES                                       Spielekiste 17 (?)  9   (0 )
14. BIFI II             Herausgeber: Bifi                           8   (0 )
15. COLORIX             Volker Stepprath        Spielekiste 331     8   (15)

Wie vorhergesagt hat "Tricky Quiky" also Platz 1 erobert!
Die alte Nr. 1 - "SnackZone" hat hingegen 5 Pl&auml;tze verloren und liegt jetzt
"nur" noch auf Platz 6.
Ansonsten hat sich nicht so arg viel getan... Lediglich 2 "gr&ouml;&szlig;ere" Aufstei-
ger hat&acute;s gegeben - "Deluxe Galaga" auf Platz 5 (von 10) und "Doody", das von
14 auf 11 gestiegen ist.

Wiedermal gibt&acute;s nur 2 Neueinsteiger: "Tiles" auf 13 und "Bifi II" auf 14.
Letzteres wird uns wohl noch einige Ausgaben hindurch begleiten...
Herausgefallen sind daf&uuml;r "Imperial 2.0" (von 12), was &uuml;brigens das letzte
Mal erst eingestiegen war, und "Dynamite Warriors" (13).

Es gab allerdings massenhaft Neuvorschl&auml;ge, die&acute;s nicht ganz in die Top 15
geschafft haben: "Die Gro&szlig;e K&auml;sejagd" auf Platz 19, "UChess 2.78" (20),
"StarWoids" (21), "Super Obliteration" (22), "Dogfight 1.0" (25), "TechnoVen-
ture" (26), "Gravity Force II" (27), mal wieder "Croak" (28), "YahZee" (29),
Oldie "Larn" (31), "DZug" (32), "Squigs" (33) und schlie&szlig;lich noch Oldie
"Bally V" (34).



A N W E N D U N G E N:
~~~~~~~~~~~~~~~~~~~~~~

Die alte Nummer 1 konnte tats&auml;chlich seine F&uuml;hrungsposition halten - und so-
gar ausbauen:

 1. TOOLMANAGER V2.1    Stefan Becker           Time 195           41   ( 1)
 2. SUPER DUPER V3.00   Sebastiano Vigna        GPD-Disk 62        33   ( 2)
 3. VT 2.58             Heiner Schneegold       Time 246           32   ( 3)
 4. KING CON V1.3       David Larsson           Einzeldisk (KCON)  23   ( 7)
 5. PROTRACKER V3.10                            Time 200           21   ( 8)
 6. AZ-EDITOR V1.5      Software Winery         GPD-Disk 40        20   ( 6)
 7. SNOOPDOS V2.0       Eddy Carroll            Time 252           20   ( 4)
 8. GOLD ED                                     Fish 918           19   ( 5)
 9. CURSOR V1.7         J&uuml;rgen Forster          GPD-Disk 69        16   (10)
10. LOOK V3.1           Andr&eacute; Voget             GPD-Disk 71        14   ( 9)
11. TERM V3.1           Olaf "Olsen" Barthel    Fish 831-833       11   (0 )
12. PCQ-PASCAL V1.2b    Patrick Quaid           Purity 6            9   (11)
13. FIXDISK V1.2        Werner G&uuml;nther          GPD-Disk 27         8   (12)
14. DMS V2.04           Parcon Software         Einzeldisk (DMS)    7   (14)
15. XDME                Aaron Digulla           SaarAG 557          7   (15)

Die ersten 3 Pl&auml;tze bleiben unver&auml;ndert, angef&uuml;hrt vom "ToolManager", der ei-
nen stattlichen 8-Punkte-Vorsprung vorweisen kann.
Auch die ersten 10 Positionen sind vollkommen unter sich geblieben - wobei es
allerdings jeweils 2 Auf- und Abseiger um je 3 Pl&auml;tze gab: CON-Ersatz "King-
CON", mit dem man die Shell-Arbeit wesentlich verbessern kann, kletterte von
7 auf 4 und der "Protracker" von 8 auf 5, w&auml;hrend "SnoopDOS" von 4 auf 7 und
"GoldEd" von 5 auf 8 fiel.

Leider gab&acute;s dieses Mal nur 1 Neuzugang - "Term" ist auf Platz 11 eingestie-
gen.
Daf&uuml;r hat uns &uuml;brigens "FreePaint" wieder verlassen.

Und wieder gab&acute;s massenhaft Neuvorschl&auml;ge:
Der "PointManager" auf Platz 17, "FileX 2.0" (18), "DOS-Trace 2.13" - ein
SnoopDOS &auml;hnliches Programm (19), der "VideoLabelMster" - eine Videoverwal-
tung, die &uuml;brigens demn&auml;chst auf der GPD-Serie erscheinen wird (20), das Dir-
Utility "Rush" (21), der "PublicManager" (22), wiedermal der Musikeditor
"Med" (24), "NComm 2.0" (25), "ArcHandler 37.40" (26), das Schriftsatzpro-
gramm "PasTeX" (29), "MagicMenu" (30), "ViewTek 2.1" (31), "JEd 2.05" (32) -
ein weiterer Texteditor, "Graph2D 1.2" (33), Virenchecker "VC 6.41" (34),
"MagicWB" (35), "VirusWorkshop 4.0" (36), "NlC" (37) und "MUI 2.2" (38).

Sind doch einige, oder?! - K&ouml;nnte doch eigentlich n&auml;chstes Mal was von ein-
steigen...



F D - S E R I E N:
~~~~~~~~~~~~~~~~~~
Am wenigsten verschiedene Vorschl&auml;ge gab&acute;s wiedermal bei den Serien. Die er-
sten 5 Pl&auml;tze bleiben &uuml;brigens wieder unter sich, und die Nummer 1 ist auch
die alte...

 1. FORUM AMIGA         Peter H&auml;ndel            Diskettenmagazin   57   ( 1)
 2. SAAR AG             SaarAG                  normale Serie      48   ( 3)
 3. FISH                Fred Fish               bekannte US-Serie  46   ( 2)
 4. SPIELEKISTE         Willi Hillenbrand       Spiele-Serie       35   ( 4)
 5. GPD                 Stefan Grad             deutsche Serie     29   ( 5)
 6. AMIGA MAGAZIN-PD    Markt &amp; Technik         Serie zum Magazin  28   ( 8)
 7. TIME                APS -electronic-        normale Serie      19   ( 6)
 8. NO COVER            APC &amp; TCP               Diskettenmagazin   14   (14)
 9. AMIGA GADGET        Andreas Neumann         Diskettenmagazin   14   (10)
10. A&amp;M-INFO            A&amp;M-Computerclub        Diskettenmagazin   14   ( 7)
11. AMIGA ENERGY                                Diskettenmagazin    7   (13)
12. PURITY              Bernd K&uuml;nnen            Pascal-Serie        7   (11)
13. NORDLICHT-GRAFIK    Gaby &amp; Udo Dr&uuml;ke        Grafik-Serie        7   ( 9)
14. AUGE                A.U.G.E. 4000           deutsche Serie      6   (0 )
15. POWERBREI           Sven Drieling           Diskettenmagazin    6   (0 )

Hat sich ja wieder nicht allzu viel getan... Das "Forum Amiga" ist weiterhin
auf Platz 1, gefolgt von der "SaarAG", die jetzt die "Fish"-Serie &uuml;berholt
hat.
H&ouml;chster Aufsteiger ist die "NoCover", die ganze 6 Pl&auml;tze gutmachen konnte
und jetzt Platz 8 belegt.
H&ouml;chster Absteiger ist die "Nordlicht-Grafik"-Serie, die von 9 auf 13 gefal-
len ist.

Aus den Top 15 der Serien herausgefallen sind &uuml;brigens die "Nameless" (von
12) und "Go!" (von 15).
Nat&uuml;rlich m&uuml;ssen es somit auch 2 neue in die Top 15 geschafft haben, und zwar
sind das "AUGE" und die "Powerbrei" auf den letzten beiden Pl&auml;tzen. Letzteres
Disk-Mag war &uuml;brigens erst das letzte Mal `rausgeflogen. Auf diesem erscheint
die FD-Hitparade &uuml;brigens jetzt auch.

Folgende Neuvorschl&auml;ge haben den Sprung in die Top 15 nicht geschafft:
"Bernd&acute;s PD" (18), "Taifun" (20) und "Nordlicht-Demo" (21).



A B S C H L I E S S E N D:
&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;&macr;
Hier nun meine &uuml;bliche Bitte um Zuschriften. Denn es gilt weiterhin, da&szlig; die-
se FD-Hitparade nur &uuml;berleben kann, wenn ich gen&uuml;gend Wertungen erhalte!

Meine Adresse: Stefan Grad, Bahnhofstr. 37, 78588 Denkingen, Deutschland.

Jetzt k&ouml;nnt Ihr auch an die Ersteller der Diskettenmagazine Eure FD-Hitlisten
schicken. Diese leiten dann die Listen an mich weiter. Dadurch kann sich aber
eine Verz&ouml;gerung ergeben. Die Adressen (alphabet. Reihenfolge):

A&amp;M-Info:         Alain Declercq, Linder Mauspfad 97, 51147 K&ouml;ln
Forum Amiga:      Peter H&auml;ndel, Bismarckstr. 7A, 33615 Bielefeld
Go!:              Philipp Schlee, Claudiusstr. 38, 40668 Meerbusch
Nameless:         Hans-Werner Schmitt, Peterstr. 2, 55278 Uelversheim
No Cover:         APC&amp;TCP, Andreas Magerl, Dorfstr. 17, 83236 &Uuml;bersee

Schlie&szlig;lich noch die E-Mail-Adressen, wo Ihr per DF&Uuml; Eure Wertungen hinschik-
ken k&ouml;nnt:

Andreas Magerl (APC&amp;TCP):   ANDREAS@HIGHVOLT.GUN.DE
Hanns Holger Rutz:          HOLGI@istda.north.de

YGar vom A&amp;M und Burckhard Schmidt von Black &amp; White haben schon zugesagt,
mir Ihre E-Mail-Adressen zu geben. Ab der n&auml;chsten Ausgabe werden hier also
voraussichtlich noch ein paar Adressen mehr zu finden sein!

Ich hoffe, die "Krise" der FD-Hitparade ist nun behoben, und warte nun auf
die Wertungen, die da kommen m&ouml;gen... Zeit habt Ihr bis zum 27. OKTOBER 1994
(Eingang der Listen bei mir). Die Wertungen an die anderen Adressen sollten
m&ouml;glichst schon einige Zeit fr&uuml;her geschickt werden, damit sie noch ausrei-
chend Zeit haben, mir diese zukommen zu lassen.

Die neue Hitparade erscheint dann im FA 23 und der n&auml;chsterreichbaren Ausgabe
der anderen Disk-Mags. Sp&auml;ter eingehende Hitlisten gehen dann in die n&auml;chste
FD-Hitparade ein.

Ein Vordruck f&uuml;r die FD-Hitparade liegt bei (Name: FD-Hitp_14-Vordruck).

&Uuml;brigens: ALLE Programme, die in der FD-Hitparade vertreten sind (ausg. von
denen, die mit (*) gekennzeichnet sind), k&ouml;nnt Ihr bei mir bekommen (teilwei-
se aber auf anderen Serien). Schreibt mir einfach, welche Programme Ihr haben
wollt.
Jede Disk kostet 1,60 DM (ab 10 Disks 1,45 DM) zzgl. 5 DM Versandkosten (Vor-
kasse!). Diese Preise sind Rein-Materialkosten ohne Eigengewinn. Nat&uuml;rlich
k&ouml;nnt Ihr die Disks auch im PD-Tausch bei mir bekommen (nach vorheriger Ab-
sprache).
Ich habe &uuml;brigens diverse PD-Serien komplett oder fast komplett (GPD-SERIEN,
FISH, FORUM AMIGA, PURITY, TIME, SAAR AG, AMIGA-MAGAZIN PD, NO COVER, u.a.).
Diese k&ouml;nnt Ihr nat&uuml;rlich auch &uuml;ber mich beziehen.


Alle Angaben ohne Gew&auml;hr!


 ---------------------------------------------------------------------------
| Zum Schlu&szlig; noch ein paar Sachen, um Unklarheiten zu vermeiden:            |
| 1. Ich bin Privatmann und ermittle die FD-Charts nur "zum Spa&szlig;".          |
| 2. Ich habe KEIN Modem. Ich kenne mich somit in der DF&Uuml; auch nicht aus.   |
| 3. Bis die FD-Charts in dieser Form fertig waren, habe ich &uuml;ber 10 Stun-  |
|    den gebraucht (die Pausen schon abgezogen).                            |
| Bevor also irgendjemand Kritik abl&auml;&szlig;t, sollte er diese Gesichtspunkte be- |
| achten. - Allerdings bin ich f&uuml;r Anregungen und konstruktive Kritik je-   |
| derzeit offen. Aber bitte so, da&szlig; ich diese Kritik auch lesen kann...     |
|                                                                           |
| Diese Ausgabe der FD-Hitparade ist &copy; 9/1994 by Stefan Grad.               |
 ---------------------------------------------------------------------------


Absender:  _______________________________________________________________

An: Stefan Grad, Bahnhofstr. 37, 78588 Denkingen, Deutschland.


Betr.: FD-Hitparade                                  Datum: ___.___.______


Meine 5 Lieblings-FD-Spiele sind (in der richtigen Reihenfolge durchnumme-
riert):

___ BACKSTAGE   ___ TELEKOMMANDO II     ___ TRICKY QUIKY    ___ SNACKZONE

___ VL          ___ ENERGIE-MANAGER     ___ DELUXE GALAGA   ___ DOODY

___ COLORIX     ___ DELUXE PACMAN       ___ ARMY MINER      ___ MEGABALL

___ BIFI II     ___ JUWELEN DES LICHTS  ___ TILES           ___ DOGFIGHT

___ ___________________ von ____________________ auf ____________________

___ ___________________ von ____________________ auf ____________________

___ ___________________ von ____________________ auf ____________________


Meine 5 favorisierten FD-Anwendungen sind (in der richtigen Reihenfolge
durchnummeriert):

___ CURSOR      ___ SUPER DUPER         ___ PROTRACKER      ___ FIXDISK

___ PCQ-PASCAL  ___ KING CON            ___ AZ-EDITOR       ___ GOLD ED

___ SNOOPDOS    ___ LOOK     ___ VT     ___ TOOLMANAGER     ___ XDME

___ DOS-TRACE   ___ TERM     ___ DMS    ___ FILEX 2.0       ___ MED

___ ___________________ von ____________________ auf ____________________

___ ___________________ von ____________________ auf ____________________

___ ___________________ von ____________________ auf ____________________


Meine 5 bevorzugten FD-Serien sind (in der richtigen Reihenfolge durchnum-
meriert):

___ GPD         ___ FORUM AMIGA         ___ SPIELEKISTE     ___ SAAR AG

___ NO COVER    ___ AMIGA MAGAZIN-PD    ___ AMIGA GADGET    ___ A&amp;M-INFO

___ PURITY      ___ NORDLICHT-GRAFIK    ___ POWERBREI       ___ TIME

___ BERND&acute;S PD  ___ FISH     ___ AUGE   ___ AMIGA ENERGY    ___ TAIFUN

___ ___________________ von ____________________ Genres: ________________

___ ___________________ von ____________________ Genres: ________________

___ ___________________ von ____________________ Genres: ________________


Falls ich gewinne h&auml;tte ich gerne folgende PD-Disk: _____________________.


</PRE>
                      </TD>
                    </TR>
                  </TABLE>
                </TD>
              </TR>

              <TR>
                <TD><IMG src="smt.gif" alt="" width="640" height=
                "22" border="0" usemap="#smt0"> </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

