<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses1.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H3>2. Weiteres AMIGA-System der n&auml;chsten Generation angek&uuml;ndigt</H3>
<P>
Kaum zu glauben, aber es sieht ganz so aus, als sei AMIGA, Inc. nicht das
einzige Unternehmen, das einen &quot;AMIGA der n&auml;chsten Generation&quot; auf den
Markt bringen will. Folgende Mitteilung findet sich in englischer Sprache
auf der Homepage des Industry Council Open AMIGA (ICOA):
</P>
<P>
&raquo;Entwickler &quot;Presse&quot; Mitteilung vom 23. November 1998 herausgegeben von IAT
Manufacturing
</P>
<P>
Thema: Impulse Multiprozessor System
Es folgt eine Pressemitteilung betreffend die Enwicklung eines &quot;Amiga
Parallel Processing System&quot;. Diese Informationen sind vorallem f&uuml;r
Entwickler in der Amiga-Gemeinde vorgesehen und enthalten Einzelheiten &uuml;ber
ein Produkt, welches sich noch mitten in der Entwicklungsphase befindet.
Alle Spezifikationen k&ouml;nnen sich noch &auml;ndern. Dieses Projekt l&auml;uft nun
einige Monate, die Hardware ist nahezu fertig.
</P>
<P>
Das Impulse Multiprozessor System ist eine Gemeinschaftsentwicklung von IAT
Manufacturing und Alternate Approach. Letztere &uuml;bernehmen dabei die
Entwicklung des gew&auml;hnlichen Mikro-OS, das die tranparente Einbindung in
das Amiga OS(R) erm&ouml;glicht, welches gegenw&auml;rtig keine Multiprozessoren
unterst&uuml;tzt.
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">IAT Manufacturing entwickelt die Systemhardware, die sich auf Motorola's&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Coldfire Prozessorfamilie st&uuml;tzt. Die Entwicklung der OS l&auml;uft.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Projektziele:&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">i)    &nbsp;</TD><TD VALIGN="TOP">Angebot einer kosteng&uuml;nsitgen Alternative zu anderen Beschleuniger-Systemen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">ii)   &nbsp;</TD><TD VALIGN="TOP">Angebot eines Befehlssatzes &auml;hnlich dem des 68k&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">iii)  &nbsp;</TD><TD VALIGN="TOP">Upgradem&ouml;glichkeit unter Erhaltung der Funktionalit&auml;t zus&auml;tzlich zu den neuen Funktionen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">      &nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Vorteile von Impulse:&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">i)   &nbsp;</TD><TD VALIGN="TOP">Das MODULARE System erlaubt g&uuml;nstige und einfache Erweiterbarkeit&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">ii)  &nbsp;</TD><TD VALIGN="TOP">Ein-Karten-System mit modularen Schnittstellenkarten f&uuml;r alle Systeme,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">d.h. &nbsp;</TD><TD VALIGN="TOP">beiman installiert eine Impulse-Karte auf einem A1200, wenn man das&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">System wechselt, mu&szlig; nur noch die Schnittstellenkarte ausgetauscht werden,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">nicht das gesamte System.&nbsp;</TD></TR>
</TABLE>
<P>
iii) Das System ist idealerweise als echte Multitasking-Umgebung ausgelegt,
die einzelnen Prozessoren k&ouml;nnen verschiedene Tasks bearbeiten; das
reduziert die Anzahl der zu bedienenden Prozesse, Interrupts von
Erweiterungen k&ouml;nnen durch zus&auml;tzliche Adre&szlig;leitungen bedient werden.
</P>
<P>
Spezifikationen:
Diese Daten sind vorl&auml;ufig, werden aber wahrscheinlich in Zukunft nicht
mehr ge&auml;ndert.
</P>
<P>
Die ersten Versionen der Prozessorplatine verwendeten den MCF5307 Prozessor
im Tandembetrieb mit einem 68k, alle Prozessoren arbeiteten selbst&auml;ndig
(kein Co-Prozessor Betrieb). Das Produkt macht von multipler Busausnutzung
ausgiebig Gebrauch, um die Zugriffe auf den Amiga-Bus zu minimieren
(IMultibus(C) Technologie). Sofern dieses Produkt erfolgrecih ist, planen
wir die Einf&uuml;hrung von V4 Coldfire(R) in 1999 mit g&uuml;nstigen 600MIPS
L&ouml;sungen (ohne 68k's).
</P>
<P>
Theoretisch gibt es keine Argumente, die widerlegen k&ouml;nnen, da&szlig; das Impulse
System nicht auch in verbindung mit PPC-Karten l&auml;uft.
</P>
<P>
Warum Coldfire ? Wir haben uns aus verschiedenen Gr&uuml;nden entschlossen, die
Coldfire-Serie zu verwenden. Der wichtigste ist die weitgehende
Kompatibilit&auml;t zu 680xx-Code. Die Coldfire-Serie wird bis heute regelm&auml;&szlig;ig
aktualisiert und die Entwicklungspl&auml;ne reichen gut bis ins n&auml;chste
Jahrtausend. Da der Coldfire (CF) eine RISC &quot;variabler L&auml;nge&quot; ist, sind die
Befehle k&uuml;rzer und ben&ouml;tigen weniger Speicher als bei anderen Systemen.
Au&szlig;erdem erledigt der CF mehr w&auml;hrend einer MIP als konventionelle RISC.
Die Tatsache, da&szlig; der Coldfire g&uuml;nstig ist, erm&ouml;glicht es uns,
Multiprozessorsystem zu bauen, die interessanter sind als ein normales
Einzelprozessorsystem. Der MCF5307, den wir in unseren ersten Boards
verwendeten ist typisch fpr die ColdFire-Architektur; jedes Ger&auml;t hat seine
eigenen Peripherieger&auml;te und Speicher on-board, sowie einen gro&szlig;es Cache.
DSP-Funktionen wurde ebenfalls mit dem ColdFire MAC eingef&uuml;hrt.
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Geplante enthaltene Spezifikationen:&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">i)    &nbsp;</TD><TD VALIGN="TOP">Zwei MCF5307 Prozessoren (jeder 70 MIPS) + 680xx Prozessor&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">ii)   &nbsp;</TD><TD VALIGN="TOP">Zwei vollst&auml;ndige FPU's&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">iii)  &nbsp;</TD><TD VALIGN="TOP">8 megabit SRAM (2-clock-12ns Zugriffszeit)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">iv)   &nbsp;</TD><TD VALIGN="TOP">Drei Serielle Schnittstellen Typ RS232&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">v)    &nbsp;</TD><TD VALIGN="TOP">M-Bus Unterst&uuml;tzung (I2C kompatibel)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">vi)   &nbsp;</TD><TD VALIGN="TOP">normaler Expansionsport mit programmierbarer Chip-Auswahl &amp; DMA controller&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">vii)  &nbsp;</TD><TD VALIGN="TOP">Standard DRAM controller&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">viii) &nbsp;</TD><TD VALIGN="TOP">4 allgemeinn&uuml;tzige Timer&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">      &nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Die Zukunft ?
</P>
<P>
Die Coldfire-Serie ist f&uuml;r multimediale Umgebungen konzipiert, das beweist
die Vielfalt an erh&auml;ltlichen Begleit-IC's von Fremdherstellern
einschlie&szlig;lich Ethernet- und PCI-Karten.
</P>
<P>
IAT Manufacturing plant die Entwicklung von Impulse-Serie weiterzuf&uuml;hren,
um auch in Zukunft kosteng&uuml;nstige und individuelle Beschleuniger-Systeme
anbieten zu k&ouml;nnen. Impulse stellt unser einzigartiges IBus(C)-Interface
zur Verf&uuml;gung, welches eine sehr g&uuml;nstige L&ouml;sung f&uuml;r Peripherieger&auml;te von
Drittherstellern darstellt, mit der M&ouml;glichkeit des Zugriffs auf einen
chipausw&auml;hlbaren multiplen Bus &amp; 2 CF Parallel Ports. Das Zwei-Leitungen
umfa&szlig;ende I2C-Interface des 5307 k&ouml;nnte neue M&ouml;glichkeiten in der
Kommunikation mit Peripherieger&auml;ten er&ouml;ffnen.
</P>
<B>Verf&uuml;gbarkeit:</B>
<P>
Das System befindet sich noch in der Entwicklungsphase, aber die
Ver&ouml;ffentlichung Anfang 1999 steht in realistischer Aussicht. Der Vertrieb
wird von der Firma Blittersoft LTD. &uuml;bernommen.
</P>
<B>Kontakt:</B>
<P>
Entwickler k&ouml;nnen den IAT Manufacturing Projekt-Koordinator D.S. Tarmey
kontaktieren, sollten noch weitergehende Fragen bestehen. Wir sind momentan
recht besch&auml;ftigt, sind jedoch bem&uuml;ht auf alls Anfragen so schnell wie
m&ouml;glich zu antworten.
</P>
<P>
Dieser Text ist nicht als gestaltende Produktbewertung gedacht, die Details
sind so genau wie m&ouml;glich angegeben. Er ist als Entwicklerinformation
einzustufen.
</P>
<B>Best&auml;tigungen:</B>
<P>
All trademarks are &copy; to their respective to their respective owners.
IMultibus, PMultibus and Impulse-5307 are &copy; to IAT Manufacturing
IAT Manufacturing and the IAT MFR. logo are &copy; to IAT Manufacturing&laquo;
</P>
<P>
(Quelle des Originals: Industry Council Open AMIGA)
Die &Uuml;bersetzung aus dem Englischen stammt von Sven Dr&ouml;ge.
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses1.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
