<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses11.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses13.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H3>12. Envoy v3 erh&auml;ltlich</H3>
<P>
&raquo;Envoy V3 ist verf&uuml;gbar!
Empfohlener Verkaufspreis DM 69,00
Update von einer fr&uuml;heren Studio-Version DM 59,00&laquo;
</P>
<P>
&raquo;Amiga Envoy 3
</P>
<P>
Amiga Envoy ist die einzige Netzwerk-Software, die gezielt f&uuml;r den Amiga
entwickelt und auf dessen F&auml;higkeiten abgestimmt wurde. Mit Amiga Envoy
verwenden Sie Dateien und Verzeichnisse anderer Amigas, als w&auml;ren sie auf
einem lokalen Datentr&auml;ger. Dies schlie&szlig;t selbstverst&auml;ndlich auch
Wechselmedien ein. Auch Drucken &uuml;ber das Netzwerk ist kein Problem, sogar
f&uuml;r mehrere Amigas, die gleichzeitig einen einzigen Drucker ansprechen.
</P>
<P>
Die Sicherheits- und Management-Funktionen erm&ouml;glichen es Ihnen,
Zugriffsbeschr&auml;nkungen f&uuml;r verschiedene Benutzer flexibel einzurichten.
</P>
<P>
Amiga Envoy ist einfach zu benutzen und zu konfigurieren und bietet Ihnen
nat&uuml;rlich eine fontsensitive graphische Benutzeroberfl&auml;che an. Anders als
bei herk&ouml;mmlicher Netzwerk-Software m&uuml;ssen Sie nicht jedesmal neu starten,
nachdem Sie irgendeine Einstellung ge&auml;ndert haben.
</P>
<P>
&Uuml;ber die offene Programmierschnittstelle von Amiga Envoy f&uuml;gen Sie
jederzeit eigene oder frei verteilbare Erweiterungen und Services hinzu,
wie zum Beispiel Services zum Abgleich der Echtzeituhr oder zur
Fernsteuerung anderer Amigas. Die gesamte Dokumentation ist mit auf dieser
CD-ROM enthalten.
</P>
<P>
Amiga Envoy ben&ouml;tigt OS 2.04 oder h&ouml;her, mindestens 1MB Speicher und eine
beliebige Netzwerk-Hardware nach SANA-II Standard. Eine Festplatte wird
empfohlen.
</P>
<P>
Viel Spa&szlig; bei der Vernetzung Ihrer Amigas!
</P>
<P>
Heinz Wrobel
</P>
<P>
Mit dem Kauf einer Amiga Envoy CD-ROM erwerben Sie eine Lizenz zum
Vernetzen von zwei Amigas. F&uuml;r weitere Amigas m&uuml;ssen Sie entsprechend
weitere Lizenzen erwerben. Bitte vergessen Sie nie: Raubkopien t&ouml;ten den
Amiga!
</P>
<P>
Copyright (C)1998 by Heinz Wrobel&laquo;
</P>
<P>
(Quelle: Schatztruhe GmbH)
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses11.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses13.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
