<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses8.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses10.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H3>9. Haage &amp; Partner-News</H3>
<P>
Und hier wieder die neuesten Meldungen des Unternehmens:
</P>
<P>
&raquo;05-Nov-98: ESCENA k&uuml;ndigt G3-PPC-Boards an!
Die Firma ESCENA, die bereits seit vielen Jahren Hardware-Entwicklungen
z.B. f&uuml;r DCE und IBH &uuml;bernommen hat, wird auf der Computer '98 den Prototyp
eines G3-PowerPC-Boards vorstellen. Hierbei handelt es sich um ein
G3-ZorroIII-Board (ohne 68k CPU), das im A3000/4000 und A1200 mit
Zorro-Erweiterung eingesetzt werden kann. Das Board ist best&uuml;ckbar mit
Prozessortypen von 233 bis 400 MHz mit 512KB oder 1MB Backside-Cache und
bis zu 512MB SDRAM. Als Treibersystem kommt das WarpUP-Paket und das
68k-Emulatorsystem von Haage&amp;Partner zum Einsatz. Die Prototypenfertigung
wird von der Firma DCE vorgenommen. Weitere Informationen erhalten Sie in
K&uuml;rze auf der Homepage von ESCENA und nat&uuml;rlich auf der Computer '98.
</P>
<P>
05-Nov-98: Sonderaktion Wacom Grafiktabletts
Wir haben noch eine kleine Menge der beliebten ArtPad II-Tabletts auf
Lager. Diese Tabletts werden nicht mehr produziert und durch die neue
Intuos-Reihe ersetzt, die jedoch erheblich teurer ist (offizieller
Verkaufspreis Intuos A6 ohne Amiga-Treiber: 459 DM). Wir k&ouml;nnen das ArtPad
II inkl. Amiga-Treiber f&uuml;r 329 DM anbieten (vorher 379 DM). Auch den
PenPartner inkl. Amiga-Treiber k&ouml;nnen Sie jetzt f&uuml;r 229 DM erwerben.
</P>
<P>
05-Nov-98: AmigaWriter 1.2 Demo
Eine neue Demoversion von AmigaWriter ist auf unserem FTP zu finden. Die
Patches f&uuml;r die Vollversion folgen in K&uuml;rze. Hauptfeatures sind die
Rechtschreibkorrektur und Dokumentvorlagen.
</P>
<P>
09-Nov-98: 3Dfx-Voodoo f&uuml;r PicassoIV?
Mit einer Online-Umfrage wollen die Entwickler von VillageTronic die
Marktchancen eines 3D-Zusatzmoduls f&uuml;r die Grafikkarte Picasso IV ausloten.
</P>
<P>
10-Nov-98: Warp3D und StormMesa in K&ouml;ln
Auf der Computer98 in K&ouml;ln wird Warp3D zum ersten Mal in der &Ouml;ffentlichkeit
pr&auml;sentiert. Als Grafik-Hardware kommt eine CyberVision3D zum Einsatz.
Damit kann endlich einmal gezeigt werden, wozu selbst der im Vergleich zu
aktueller 3D-Hardware schwache Virge f&auml;hig ist.
</P>
<P>
20-Nov-98: Computer'98, QNX, ...
</P>
<P>
Die diesj&auml;hrigen Messee war f&uuml;r uns wieder ein gro&szlig;er Erfolg. Highlights
waren die Pr&auml;sentation des neuen AmigaOS-Kernels QNX, die Ank&uuml;ndigung eines
G3-Boards und einer Voodoo-Grafikkarte, sowie die Vorstellung von Warp3D.
</P>
<P>
20-Nov-98: WDR Computernacht
Wie mir heute vom WDR Computerclub best&auml;tigt wurde, wird im Rahmen der
Computernacht von Samstag, den 05.12.1998 auf Sonntag, den 06.12.1998 auch
das Thema Amiga behandelt.
</P>
<P>
20-Nov-98: AmigaWriter 1.2 Anleitung
Die Anleitung zur aktuellen Version bzw. zum aktuellen Patch kann jetzt von
registrierten Kunden bei uns angefordert werden.
</P>
<P>
24-Nov-98: &quot;Amiga announces alliance with QNX&quot;
Die offizielle Ank&uuml;ndigung der Zusammenarbeit ist jetzt auch auf der
Homepage von QNX.
</P>
<P>
24-Nov-98: ICOA wieder online
F&uuml;r einige Zeit war die Homepage der Entwicklerorganisation ICOA nicht
verf&uuml;gbar. Seit kurzem sind die neuen Seiten unter www.amiga.net
erreichbar.&laquo;
</P>
<P>
(Quelle: Haage &amp; Partner)
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses8.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses10.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
