<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses4.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses6.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H3>5. Statement zur versp&auml;teten BoXeR-Auslieferung</H3>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&raquo;BoXeR - The New Amiga Motherboard!  &nbsp;</TD><TD VALIGN="TOP">BoXeR - Die Neue Amiga-Hauptplatine!&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">                                     &nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
BoXeR Update - 3. November 1998.
</P>
<P>
Blittersoft hat aufmerksam das Interesse verfolgt, welches die neue
BoXeR-Hauptplatine seit ihrer Ank&uuml;ndigung weltweit erregt hat.
Unangenehmerweise entstanden aus einer Anzahl von Gr&uuml;nden, auf die wir
nicht n&auml;her eingehen k&ouml;nnen, einige unerwartete Verz&ouml;gerungen, durch die
die Auslieferung verhindert wurde.
</P>
<P>
Wir m&ouml;chten deshalb mit dieser Mitteilung die derzeitige Lage klarstellen.
</P>
<P>
Die BoXeR-Hauptplatine wird von Access Innovation Ltd. entwickelt. Access
ist dar&uuml;berhinaus noch mit weiteren wichtigen Projekten besch&auml;ftigt, dabei
auch die Inside-Out-Platine, und daf&uuml;r wurde die zur Verf&uuml;gung stehende
Entwicklungszeit entsprechend aufgeteilt. Die Verz&ouml;gerungen erm&ouml;glichten es
aber, einige weitere Verbesserungen an den BoXeR-Entwicklungsvorgaben
vorzunehmen. Diese &Auml;nderungen sind (noch nicht ganz endg&uuml;ltig) im
Folgenden beschrieben:
</P>
<UL>
<LI> 64-Bit-Entwurf f&uuml;r maximale Leistung mit PPC/G3-Prozessorplatinen.
</LI>
<LI> Doppelte unabh&auml;ngige IDE-Anschl&uuml;sse, die die Moden PIO 0-4 und DMA 0-2
   unterst&uuml;tzen und (&uuml;ber Flash) auf UDMA aufr&uuml;stbar sind, wodurch sich
   h&ouml;here &Uuml;bertragungsraten mit niedriger Prozessorbelastung ergeben.
</LI>
<LI> Ersatz des Buster-Chips.
</LI>
<LI> Vollst&auml;ndige Einrichtung des Parallelports (,wodurch die Zahl der dort
   anschlie&szlig;baren Ger&auml;te erh&ouml;ht wird).
</LI>
<LI> Der Platinenentwurf wurde ge&auml;ndert, um an den Video Toaster anzupassen.
</LI>
<LI> Einbau von Verbesserungen, um die Zugriffzeit zum CHIP-RAM zu
   verbessern.
</LI>
</UL>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Eine neue Musterplatine steht kurz vor der Fertigung und wir werden damit&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">die neuesten Eigenschaften und auch schon fr&uuml;her vorgenommene &Auml;nderungen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">pr&uuml;fen k&ouml;nnen. Sobald der Prototyp gebaut ist, werden wir nach den ersten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Tests einen besseren &Uuml;berblick &uuml;ber den Zeitrahmen der Produktion haben und&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">wir werden Sie dar&uuml;ber informieren.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Die BoXeR-Hauptplatine bietet bei vertr&auml;glichen Kosten eine Multimedia-
Computerplatine f&uuml;r Heim- und halbprofessionellen Einsatz, die auf dem
Chipsatz und dem Betriebssystem des Amiga basiert. Damit werden komplette
Maschinen m&ouml;glich, deren Preise sich zwischen denen von A1200 und A4000
bewegen und preiswerte Erweiterungsm&ouml;glichkeiten bieten, w&auml;hrend die
Leistungsf&auml;higkeit des A4000 &uuml;bertroffen wird.
</P>
<P>
Das geplante Lieferdatum f&uuml;r die BoXeR-Hauptplatine liegt im 1. Quartal
1999.&laquo;
<P>
(Quelle des Originals: Blittersoft)
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses6.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
