<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum2.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum4.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H3>3. Leserbrief zum Thema Raubkopieren (von Andreas Schauml&ouml;ffel)</H3>
<P>
&raquo;Hi AmigaAktuell,
</P>
<P>
Dieser Brief richtet sich eigentlich nicht an Euch, sondern an Eure Leser.
Um es genau zu sagen an eine bestimmte Gruppe von Euren &quot;treuen Lesern&quot;,
n&auml;mlich die Raubkopierer.
</P>
<P>
Sagt mal seit Ihr eigentlich noch ganz bei Trost? Scheinbar mangelt es
einigen (vielen) Amiga Besitzern einmal so richtig an Aufkl&auml;rung. Man kann
doch wohl noch erwarten, das es Euch klar sein m&uuml;sste, das dass herstellen
von Raubkopien sowohl strafrechtlich verfolgt werden kann, sowie es auch
den Amiga-(Markt) ungeheuer sch&auml;digt. Der Amiga Markt ist lange nicht mehr
so gro&szlig; dass er eine solche bl&uuml;hende Raubkopierer Szene mal so einfach
wegsteckt. Was meint ihr denn warum Vulcan Software nun auch noch
zus&auml;tzlich Spiele f&uuml;r PC und PlayStation herstellt, und sich villeicht
sogar schon langsam vom Amiga abwendet? Sicher nicht weil sie an Amiga-
Spielen zu viel Geld verdienen. Bei Titan-Computer schaut es doch nicht
anders aus, noch vor einem Jahr hies es das Total Combustion sicher k&auml;me.
Jetzt steht allerdings schon wieder ein dickes Fragezeichen dahinter. Und
warum? Es mangelt an Absatz.
</P>
<P>
Mitlerweile z&auml;hlt doch jedes verkaufte Programm um die Software-Firmen zu
halten.
</P>
<P>
Das Entwicklungen auch finanziell attrktiv sein m&uuml;ssen sollte doch jeden
von euch klar sein. Ansonsten verlieren doch auch noch so treue Amiga-
Spieleentwickler irgendwann einmal den Mut und verlassen den Amiga (was ja
dann irgendwie auch noch verst&auml;ndlich w&auml;hre).
</P>
<P>
Daher bitte ich Euch, all die jenigen User, die auch nur im entferntesten
mit Raubkopien zu tun haben, wendet Euch davon ab und kauft ORIGINALE.
Vernichtet Eure Raubkopien. Es ist mir nat&uuml;rlich auch klar das man sich als
Sch&uuml;ler (wie ich auch  noch einer bin) nicht jeden Monat 5 neue Spiele
kaufen kann. Aber lieber kaufe ich mir jeden Monat 1 Spiel, anstatt mir
jeden Monat 10 zu kopieren und somit die Hersteller zu sch&auml;digen. Wer mit
mir &uuml;ber dieses Thema diskutieren m&ouml;chte, oder mir seine Meinung dazu
schreiben will, macht das &uuml;ber folgende EMail Adresse:
</P>
<P>
<A HREF="mailto:Indiana@bamberg.baynet.de">Indiana@bamberg.baynet.de</A>
</P>
<P>
Und jetzt &uuml;berlegt Euch noch mal genau was Ihr eigentlich macht,
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Andreas  &nbsp;</TD><TD VALIGN="TOP">&quot;Indi&quot; Schauml&ouml;ffel&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">         &nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
PS: Wei&szlig; jemand. wie ich bei Foundation Bogensch&uuml;tzen bekomme?&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Forum2.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum4.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
