<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Geruechte.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H2>Abschlie&szlig;end</H2>
<P>
Es ist schon paradox - 24 Monate nach der fast zeitgleichen Einstellung
zweier deutscher AMIGA-Magazine hat sich unser Zeitschriftenmarkt - wer
h&auml;tte das vor einem Jahr zu hoffen gewagt - wieder erholt: Im Moment sind
sechs redaktionell unabh&auml;ngige Titel unterschiedlichster Couleur in
monatlicher oder zweimonatlicher Erscheinungsweise erh&auml;ltlich: Von der
neuen amigaOS, die sich beinahe ausschlie&szlig;lich an Software-Anwender richtet
und in der Regel ohne Datentr&auml;ger ausgeliefert wird, bis hin zur AMIGA
Future, dem Magazin f&uuml;r Spiele-Fans mit CD-ROM.
</P>
<P>
Ihren Lesern von allem etwas bieten wollen dagegen die AMIGA Plus, die
AMIGA Special und - ebenfalls neu - die AMIGA Fever.
</P>
<P>
Und trotz seiner j&auml;mmerlichen Existenz als Abo-Beilage einer PC-Zeitschrift
sollte das einst glanzvolle AMIGA Magazin nicht vergessen werden. Laut
Redakteur Thomas Fischer werde man auf jeden Fall das gesamte Jahr 1999
weitermachen - na dann prost Mahlzeit. Hat er vielleicht vergessen, dass
der WeKa-Verlag in diesem Punkt auch noch ein W&ouml;rtchen mitzureden hat? Mir
zumindest ist schleierhaft, wie man, wom&ouml;glich &uuml;ber Jahre hinweg, die
Existenz einer kommerziellen Zeitschrift aufrecht erhalten kann, die nach
meiner Sch&auml;tzung kaum die Leserzahl eines guten Online-Magazins erreicht.
Das Schicksal des AMIGA Magazins sollte aber deutlich machen, dass der
scheinbar wieder gefestigte deutsche Zeitschriftenmarkt keineswegs so
stabil ist, wie es momentan vielleicht den Anschein hat. Ganz im Gegenteil:
Auch in Zukunft sind R&uuml;ckschl&auml;ge zu bef&uuml;rchten - alles andere k&auml;me auf
Grund der sehr begrenzten Zahl von AMIGA-Anwendern einem Wunder gleich.
L&auml;ngerfristig kann dem nur ein einziges Mittel entgegenwirken, und dieses
w&uuml;rde gleichzeitig den gesamten AMIGA-Markt weltweit st&uuml;tzen: Ein neuer -
konkurrenzf&auml;higer - AMIGA - mit welchem Prozessor auch immer.
</P>
<P>
Frohe Weihnachten und einen guten Rutsch w&uuml;nscht
</P>
<P>
euer
</P>
<P>
Carsten Schr&ouml;der
</P>
<P ALIGN="RIGHT">
<A HREF="Geruechte.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
