<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Letzte Meldung: Wipeout 2097 kommt f&uuml;r Amiga
</LI>
</UL>
<P>
<A HREF="img/wipeout2097.png"><IMG SRC="thumb/wipeout2097.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Die Verhandlungen mit Psygnosis sind abgeschlossen mit dem
Ergebnis, dass Wipeout 2097 f&uuml;r den Amiga erscheinen wird.
Konvertiert wird das ganze von Digital Images. Eine Angabe von
der Mindestkonfiguration f&uuml;r das Spiel wurde noch nicht
gemacht, aber h&ouml;chstwahrscheinlich wird es nur f&uuml;r PowerPC
erscheinen.
</P>
<UL>
<LI> Tales of the Heaven Demo ver&ouml;ffentlicht
</LI>
</UL>
<P>
<A HREF="img/talesofheaven.png"><IMG SRC="thumb/talesofheaven.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Eine Demo des Super Mario 3D &auml;hnlichem Spiel Tales of the Heaven
wurde ver&ouml;ffentlicht. Die Version macht noch einen recht fr&uuml;hen
Eindruck, ist aber voll spielbar. Auf meinem 68040 l&auml;uft die
Demo zwar nicht fl&uuml;ssig, aber relativ spielbar. Die Entwickler sind
momentan auf der Suche nach einem Distributor f&uuml;r das Spiel,
welches nur f&uuml;r 68k Amigas erscheinen wird, da es zu 100% in
Assembler geschrieben ist. Insgesamt ist die Demo beeindruckend.
</P>
<UL>
<LI> Update zu Eat the Whistle erschienen
</LI>
</UL>
<P>
Ein Update zu Eat the Whistle gibt es im Aminet. Unter anderem
gibt es jetzt eine Golden Goal Option. Au&szlig;erdem gab es wichtige
Bugfixes.
</P>
<UL>
<LI> Paul Burkey plant keine PowerPC Version von Foundation
</LI>
</UL>
<P>
Von dem Strategie Spiel im Stil von Die Siedler 'Foundation'
wird es wohl keine PowerPC Version mehr geben. Zuletzt begr&uuml;ndete
Paul Burkey dies in der Blitz Basic Mailingliste. Das Spiel
sei zu 98% in Blitz Basic und zu 2% in Assembler geschrieben.
</P>
<UL>
<LI> Great Nations Demo ver&ouml;ffentlicht
</LI>
</UL>
<P>
Die Entwickler des Civilisation &auml;hnlichem Spiel Great Nations
haben ein Demo ver&ouml;ffentlicht. Man bittet um Bug-Reports,
Anregungen, Vorschl&auml;ge usw. Die Endversion soll den PowerPC
unterst&uuml;tzen und auch &uuml;ber Netzwerk spielbar sein.
</P>
<UL>
<LI> Marbleous 2 bei APC&amp;TCP erschienen
</LI>
</UL>
<P>
Die schon zur Computer `98 angek&uuml;ndigte Fortsetzung des
Spiels Marbelous ist erschienen. Das dem Rainbow Arts
Klassiker Rock`n Roll &auml;hnelnde Spiel bietet mehrere
hundert Level und au&szlig;erdem einen Leveleditor. Man legt
haupts&auml;chlich auf das Gameplay wert.
</P>
<UL>
<LI> Quake 2 bald auch am Amiga?
</LI>
</UL>
<P>
Dar&uuml;ber denkt man bei Digital Images nach. Hierzu wurden
schon Verhandlungen mit ID Software gef&uuml;hrt. Sollte man sich
einig werden (und das wollen wir hoffen), soll Quake 2 exklusiv
f&uuml;r PowerPC erscheinen, da 68k Amigas einfach nicht die n&ouml;tige
Rechenpower h&auml;tten. Da haben die Jungs wohl recht, denn selbst
Quake 1 ist auf 68k Amigas kein Genuss. Au&szlig;erdem plant man bei
Digital Images noch ein 3D Fussball Spiel sowie ein neuartiges
Kampfspiel.
</P>
<UL>
<LI> Grafikkarten Update f&uuml;r 'Flying High' im Aminet
</LI>
</UL>
<P>
Seit kurzem gibt es ein Update f&uuml;r 'Flying High' von APC&amp;TCP,
welches den Betrieb des Spiels nun auch auf Grafikkarten
erm&ouml;glicht. Unterst&uuml;tzt werden hierbei CyberGraphX und Picasso96.
Allerdings l&auml;uft das Spiel immer noch nur in der Aufl&ouml;sung
320x256 mit 256 Farben, was aber wohl auf die fehlende CPU
Power zur&uuml;ckzuf&uuml;hren ist. Die Grafikkarten Version von 'Flying High'
ben&ouml;tigt au&szlig;erdem 8MB zus&auml;tzlichen Speicher. Leider ist
die Geschwindigkeit des Spieles immer noch relativ langsam.
</P>
<UL>
<LI> The Holy Trinity Team komplett
</LI>
</UL>
<P>
Das The Holy Trinity Entwickler Team ist nun komplett. The Holy
Trinity ist ein 3D Adventure/RPG. Die Endversion soll Myst &auml;hnliche
3D Grafiken enthalten sowie 3D Hintergrund Animationen und mehr.
Die Endversion, die Mitte 1999 erscheinen soll, wird einen 68030
Prozessor sowie 4MB Zusatzspeicher ben&ouml;tigen. Au&szlig;erdem sollen
Grafikkarten unterst&uuml;tzt werden und das Spiel soll nur auf CD-ROM
ausgeliefert werden.
</P>
<UL>
<LI> Titan Computer zeigt Claws of the Devil
</LI>
</UL>
<P>
Schon seit l&auml;ngerem kursieren einige beeindruckende Screenshots
des PPC only Tomb Raider-Clone Claws of the Devil im Internet herum.
Man wartete gespannte auf die Computer `98, wo Titan Computer ein
Demo pr&auml;sentieren wollte. Was man allerdings dort zu sehen bekam,
war wohl nicht ganz das erwartete. Das Demo sah eher aus wie
ein 68k Amiga Grafikdemo. Ob man aus dem PPC nicht mehr herausholen
kann?
</P>
<UL>
<LI> 'Olo Fight' auf der Computer `98 erschienen
</LI>
</UL>
<P>
Die noch eher unbekannte Softwareschmiede 'The Real Ologram'
war gleich mit einem eigenen Stand auf der Messe vertreten,
wo ihr Spiel 'Olo Fight' &uuml;ber den Tisch wanderte. Bei
'Olo Fight' handelt es sich um ein neuartiges Kampfspiel,
mit v&ouml;llig gerenderten Gegnern und mehr als 1000 Farben
gleichzeitig am Bildschirm. Die Demoversion, die seit
einiger Zeit im Aminet liegt, macht einen recht
passablen Eindruck.
</P>
<UL>
<LI> Wet bei New Generation Software erschienen
</LI>
</UL>
<P>
Die erotische Wirtschaftssimulation im 'Biing!' Stil ist nur
auf CD-ROM mit deutscher Sprachausgabe und Anleitung beim
Hersteller zu beziehen. Der Preis bel&auml;uft sich auf 79,- +
Versandkosten. Die Mindestanforderung ist ein 68020,
8MB Fast Ram und 2MB Chip sowie 40MB freier Festplattenplatz,
8x CD-ROM und OS3.0. Grafikkarten werden dabei genauso
unterst&uuml;tzt wie h&ouml;here Prozessoren und mehr Speicher.
Wet war am PC bereits ein Renner, hoffen wir das die Amiga
Version es auch ist. Sollte ich ein Testexemplar erhalten,
gibt`s nat&uuml;rlich einen ausf&uuml;hrlichen Test.
</P>
<UL>
<LI> clickBOOM zieht Konsequenzen wegen illegalem Quake PPC Port
</LI>
</UL>
<P>
Im Aminet war einen Tag lang eine als 'offiziell' getarnte
PowerPC Version von Quake abrufbar. clickBOOM verk&uuml;ndete
darauf, dass es keine Quake PowerPC Umsetzung von clickBOOM
mehr geben wird. In der letzten Zeit wurde eine Umsetzung
immer unrealistischer, da clickBOOM immer wieder verschiedene
Gr&uuml;nde angab, warum sich ein PowerPC nicht rentieren w&uuml;rde.
</P>
<UL>
<LI> Titan Computer setzt 'Die Siedler II' f&uuml;r den Amiga um
</LI>
</UL>
<P>
Nach immer lauter werdenden Ger&uuml;chten bez&uuml;glich einer Amiga
Umsetzung von 'Die Siedler II' best&auml;tigte Titan nun offiziell,
dass ein Lizenzabkommen mit Blue Byte geschlossen wurde.
Auf der Computer `98 konnte man leider noch nichts von der
Umsetzung sehen, obwohl sie bereits Ende Januar ver&ouml;ffentlicht
werden soll. Der erste Teil der Siedler Reihe war eines der
bestverkauften Amiga Titel &uuml;berhaupt. Titan Computer schlie&szlig;t
eine Umsetzung weiterer Blue Byte Titel nicht aus, wenn sich
'Die Siedler II' gut verkauft.
</P>
<UL>
<LI> Vulcan stellt Amiga Spiele Produktion ein
</LI>
</UL>
<P>
Der Spielehersteller Vulcan stellt die Entwicklung von Amiga Spielen
ein. Allerdings will Vulcan immer noch als Publisher in der Amiga Szene
t&auml;tig bleiben. Zu bekannten von Vulcan ver&ouml;ffentlichten Spielen geh&ouml;ren
die Valhalla Serie, Genetic Species, Burn Out, Strangers und einige mehr.
Au&szlig;erdem wurde eine CD-ROM ver&ouml;ffentlicht, die 10 Vulcan Spiele aus
den letzten drei Jahren enth&auml;lt. Folgende Spiele sind auf der
'Vulcanology' CD-ROM: Valhalla 1-4, Timekeepers, Burn Out, Hillsea Lido,
Bograts, Jet Pilot und Tiny Troops. Die CD gibt`s f&uuml;r ca. 45 DM.
</P>
<UL>
<LI> Alive MediaSoft bringt 'The Pulse'
</LI>
</UL>
<P>
Alive MediaSoft ver&ouml;ffentlicht jeden Monat ein kostenloses 8 seitiges
Magazin mit Spiele Reviews, Previews und News rund um den Amiga. Mindestens
14 Reviews sollen in jedem Heft vorhanden sein. In England muss man
Alive MediaSoft nur seine Adresse per email mitteilen und man erh&auml;lt das
Heft kostenlos per Post. Ob sie es auch nach Deutschland verschicken,
weiss ich nicht.
</P>
<UL>
<LI> Sanios Software plant Amiga Umsetzungen
</LI>
</UL>
<P>
Bei Sanios Software versucht man Lizenzen f&uuml;r Guts`n`Garters und
Lunatic Islands, einem Plattform Spiel f&uuml;r Kinder, zu erwerben.
Au&szlig;erdem arbeitet man an Rock dogs, einem klassischen Adventure im
Stil von Kings Quest. Es soll u.a. handgemalte Grafiken und
Animationen sowie Qualit&auml;tsmusik und AGA/RTG Support enthalten.
M&ouml;glicherweise wird es auch PPC unterst&uuml;tzen. Momentan ben&ouml;tigt
es einen 68030 und 8MB Fast Ram. Au&szlig;erdem sucht man einen 3D
Programmierer sowie einen Website Verwalter. Interessierte k&ouml;nnen
sich an <A HREF="mailto:dans@ion.com.au">dans@ion.com.au</A> wenden.
</P>
<UL>
<LI> Bubble Heroes bei Arcadia Development
</LI>
</UL>
<P>
An einer Neuauflage des Spiels Bubble Bobble arbeitet Arcadia
Developments. Einige Features sind zum Beispiel mehrere tausend
Farben am Bildschirm, Transparenzen, viele Special Effects,
&uuml;ber 60 Levels, CD Audio Tracks und alles l&auml;uft mit 50fps.
Das Spiel l&auml;uft auch auf niedrigen Amigas. Das Spiel l&auml;uft
ab einem 68020 mit AGA und 4MB FastRam. Ein 2x CD-ROM muss auch
vorhanden sein.
</P>
<UL>
<LI> Grafiker und Programmierer gesucht
</LI>
</UL>
<P>
Zur Fertigstellung des bereits vor &uuml;ber einem Jahr angek&uuml;ndigten
Battle Isle-Clone Battle wird noch ein guter C/ASM Programmierer
und 2D/3D Grafiker gesucht. Interessierte k&ouml;nnen sich an Marco
Frischkorn (<A HREF="mailto:m_frischkorn@fulda.net">m_frischkorn@fulda.net</A>) wenden.
</P>
<UL>
<LI> Blittersoft vertreibt Space Station 3000
</LI>
</UL>
<P>
Space Station 3000, was noch in diesem Monat erscheinen soll, wird nun
von Blittersoft vertrieben. Die Entwickler des Spiels sind Digital
Images.
</P>
<UL>
<LI> NtT Software Neuigkeiten
</LI>
</UL>
<P>
NtT Software hat momentan zwei Spieleprojekte am laufen. Zum einen
Creepz, eine Mixtur aus Maniac Mansion 2 und The Lost Vikins und zum
anderen Gord, ein Grafikadventure welches mindestens einen 020 Prozessor
und 4MB Fast RAM ben&ouml;tigen wird. Creepz wird momentan f&uuml;r PC entwickelt,
allerdings soll es auch auf den Amiga konvertiert werden.
</P>
<UL>
<LI> Lambda News
</LI>
</UL>
<P>
<A HREF="img/lambda1.png"><IMG SRC="thumb/lambda1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>&nbsp;
<A HREF="img/lambda2.png"><IMG SRC="thumb/lambda2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>&nbsp;
<A HREF="img/lambda3.png"><IMG SRC="thumb/lambda3.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>&nbsp;
</P>
<P>
Vom beeindruckenden Wing Commander-Clone Lambda gibt es neue Screenshots,
die einen mal wieder fast vom Hocker hauen. In der letzten Woche gab es
eine IRC Konferenz mit dem Lambda Team. Der Programmierer erkl&auml;rte, dass
er keine Preview Version von Lambda mehr ver&ouml;ffentlichen werde. Die
n&auml;chste Version w&uuml;rde eine voll spielbare Demoversion. Dabei kann man
mit 25-30fps auf einem 68060 mit ZorroIII Grafikkarte rechnen. Er gab
au&szlig;erdem bekannt, dass es wahrscheinlich keine PowerPC Version von
Lambda geben werde, da ihm die PPC Karten zu teuer w&auml;ren. Wie w&auml;re es
da mal mit einem speziellen Developer Preis? Einen Publisher werde man
erst kontakten, wenn das Spiel 100% fertig sei, da man sich kein
Zeitlimit schaffen wolle. Eine Aussage, wann Lambda erscheint wurde
trotz mehrerer Fragen nicht gemacht. Leider gab der Programmierer
auch bekannt, dass er nicht daran glaubt, dass Amiga jemals wieder
'zur&uuml;ck' kommt. Das vollst&auml;ndige Log der Konferenz kann man auf
<A HREF="http://www.nutts.demon.co.uk/lambdaconf.html" TARGET="_TOP">http://www.nutts.demon.co.uk/lambdaconf.html</A> abrufen.
</P>
<UL>
<LI> Turbo Racer 3D bei V.A.K. Entertainment
</LI>
</UL>
<P>
Ein neues 3D Autorennen mit Texturemapping gibt`s bei V.A.K. Entertainment.
Die Screenshots sehen gar nicht mal so schlecht aus. Das Spiel ben&ouml;tigt
mindestens einen 68020, 4MB Fast Ram und 3MB Festplattenspeicher. Eine
spielbare Demo gibt`s auf der V.A.K. Homepage. Die Grafiken und die
Geschwindigkeit des Spiels sind durchaus in Ordnung, nur leider ist die
Steuerung total daneben. Viele Bugs sind auch noch drin. Aus diesem Spiel
h&auml;tte man doch mehr machen k&ouml;nnen! Es lohnt sich aber trotzdem das Spiel
mal anzusehen!
</P>
<UL>
<LI> Release der Demoversion von Operation: CounterStrike steht kurz bevor
</LI>
</UL>
<P>
Eigentlich sollte die Demo von Operation: CounterStrike schon am 30.
Oktober ver&ouml;ffentlicht werden, also kann es nicht mehr lange dauern. Das
Echtzeit-Kriegs-Strategiespiel ben&ouml;tigt mindestens 68030, 16MB Ram und ein
4x CD-ROM. Man darf gespannt sein.
</P>
<UL>
<LI> Zombie Massacre bei Epic Marketing
</LI>
</UL>
<P>
Der Nachfolger des Spieles 3D Doom-Clone Gloom 3 soll nett animierte
Texturen bieten, &uuml;ber 40 Levels beinhalten, nur auf CD-ROM ausgeliefert
werden und au&szlig;erdem Audio Tracks und FMV Sequenzen enthalten. Das Spiel
ben&ouml;tigt mindestens einen 68030, 6MB Ram und ein CD-ROM. Grafikkarten und
PowerPC werden unterst&uuml;tzt. Die Screenshots erinnern leider sehr stark
an Gloom 3, welches ja nicht gerade ein Renner war. Hoffentlicht
tut sich da noch was.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
