<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele1.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele3.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Aufruf</H2>
<P>
Liebe Leser,
</P>
<P>
wie ihr bestimmt schon gesehen habt, gibt es in dieser Ausgabe k e i n e
Lesercharts. Ich bin mir nicht sicher, ob noch gen&uuml;gend Interesse
f&uuml;r Lesercharts besteht. Jens hat sich fast in jeder Ausgabe dar&uuml;ber
beschwert, dass zu wenige an den Charts teilnehmen. Damit das bei mir
nicht genauso kommt, w&uuml;rde ich ganz gerne wissen, ob Lesercharts
noch gew&uuml;nscht sind. Wenn ja, kommt sie nat&uuml;rlich in die n&auml;chste
Ausgabe wieder mit rein - versprochen! Also schickt mir gleich eine
email mit eurer Meinung &uuml;ber die Lesercharts und eurer Top 10 der Amiga
Spiele. Am AMIGA aktuell Gewinnspiel k&ouml;nnt ihr auch noch gleich
teilnehmen - einfach die Meinungsfrage beantworten. (Die anderen
Fragen k&ouml;nnen nat&uuml;rlich auch noch beantwortet werden. F&uuml;r jede richtige
Antwort gibt es eine Stimme). Jedes Spiel kann in die Top 10 aufgenommen
werden, egal ob Shareware, Freeware, kommerziell usw. Hauptsache es
ist ein Amiga Spiel und macht Spass. Diese Zeitschrift lebt durch eure
Mithilfe, bitte schreibt mir, was ich anders oder eurer Meinung nach
besser machen soll. Aber schreibt mir auch, wenn ihr News zu Spielen habt.
</P>
<P>
Liebe Programmierer und Softwarefirmen,
</P>
<P>
jetzt, da es in Deutschland nur noch wenige geeignete Publikation gibt,
die &uuml;ber AMIGA-Spiele berichtet, ist es umso wichtiger, jede verbliebene
M&ouml;glichkeit zu nutzen, um die treuen AMIGA-Fans mit News, Previews und
Tests zu versorgen. Ich denke AMIGA aktuell ist eine sehr gute dieser
M&ouml;glichkeiten. Mit seinen extrem vielen Verbreitungswegen hat es sicherlich
einige Tausend potentielle Leser. Es liegt an Ihnen, ob Sie mich bei meiner
Arbeit unterst&uuml;tzen, und Ihre Spiele bekannt werden. Bitte schicken Sie mir
News zu Ihren Spielen, aber auch Demoversionen. Auch &uuml;ber das eine oder
andere Testmuster Ihrer Spiele w&uuml;rde ich mich freuen. Dies w&uuml;rde nat&uuml;rlich
mit einem ausf&uuml;hrlichen Test des Spiels gew&uuml;rdigt.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele1.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
