<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Vorwort</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Main.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Intern.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Vorwort
</font>
</TD></tr>
</TABLE>
<BR>
<H2>Vorwort</H2>
<P>
Willkommen zur neuen Ausgabe von AMIGA aktuell.
</P>
<P>
Wann zuletzt gab es einen Monat, in dem so viele spektakul&auml;re Meldungen
rund um den AMIGA eintrafen, wie im abgelaufenen? Abgesehen von der
Computer '98 beherrschten den November in erster Linie folgende Themen:
</P>
<UL>
<LI> die Bekanntgabe des Betriebssystempartners von AMIGA, Inc. zur
  Entwicklung des AMIGA OS 5.0
</LI>
<LI> die Ank&uuml;ndigung von ESCENA, G3-PPC-Karten auf den Markt bringen zu wollen
</LI>
<LI> der Weggang Fleecy Moss' von AMIGA, Inc.
</LI>
<LI> die Meldung, dass Haage &amp; Partner die Koordination der Entwicklung des
  AMIGA OS 3.5 &uuml;bernommen haben soll
</LI>
<LI> die Ank&uuml;ndigung der Entwicklung eines weiteren AMIGA-Systems der n&auml;chsten
  Generation sowie einer neuen Betriebssystemumgebung.
</LI>
</UL>
<P>
Die Interna der heutigen Ausgabe:
</P>
<UL>
<LI> Unser Redaktionsteam hat Zuwachs bekommen: Andreas Falkenhahn k&uuml;mmert
  sich ab sofort um den Spieleteil!
</LI>
<LI> Einen Wechsel gab es beim Posten des Webmasters der AMIGA-aktuell-
  Homepage (<A HREF="http://www.mediaspace.net/amigaaktuell" TARGET="_TOP">http://www.mediaspace.net/amigaaktuell</A>): Aus zeitlichen Gr&uuml;nden
  hat Bastian Frank diese Aufgabe an Stephan Manske weitergegeben.
</LI>
<LI> Harald Frank hat vorgeschlagen, einen Workshop &uuml;ber die RC5-Wettbewerbe
  und speziell die Teilnahmem&ouml;glichkeiten f&uuml;r AMIGA-Anwender zu schreiben.
  Wer k&ouml;nnte das &uuml;bernehmen?
</LI>
<LI> Hat jemand Interesse, eine Rubrik zu gestalten, in der interessante WWW-
  Sites vorgestellt werden?
</LI>
<LI> An der Umfrage in der vorletzten AMIGA-aktuell-Ausgabe haben sich bislang
  etwas &uuml;ber 80 Leser beteiligt. Wir haben beschlossen, noch bis Ende
  Dezember auf &quot;Sp&auml;t-Einsender&quot; zu warten und dann mit der Auswertung zu
  beginnen.
</LI>
</UL>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Zu den regelm&auml;&szlig;igen Aufrufen:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> Wir suchen jemanden, der eine eigenst&auml;ndige AMIGA-aktuell-Rubrik f&uuml;hren
  will, in der &uuml;ber Software-Updates informiert wird. Monat f&uuml;r Monat
  erscheinen bekanntlich unz&auml;hlige FD- und kommerzielle AMIGA-Programme in
  neuen Versionen. Ziel dieser neuen Rubrik ist es, die wichtigsten
  Verbesserungen von neuen Software-Updates aufzulisten.
  Wer hat Interesse, sich darum zu k&uuml;mmern?
</LI>
<LI> Weiterhin gesucht werden Tester von frei kopierbarer Software. Jeder, der
  sich f&uuml;r diese Aufgabe bereit erkl&auml;rt, wird in eine spezielle
  Verteilerliste eingetragen und erh&auml;lt dann in unregelm&auml;&szlig;igen Abst&auml;nden
  Test-Vorschl&auml;ge, ist aber zu nichts verpflichtet.
<P>
  Nat&uuml;rlich freuen wir uns aber genauso &uuml;ber Tests kommerzieller
  Produkte und nicht &uuml;ber die Verteilerliste vorgeschlagener FD-Software.
  Schreibt an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A> .
</P>
</LI>
</UL>
<P>
Viel Spa&szlig; jetzt bei dieser Ausgabe,
</P>
<P>
Euer
</P>
<P>
Carsten Schr&ouml;der
</P>
<P ALIGN="RIGHT">
<A HREF="Main.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Intern.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
