<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H2>Workshops / Hintergrundberichte / Buchvorstellungen</H2>
<H3>1. Erfahrungsbericht: A1200 im Infinitiv-Tower (von Andreas Schauml&ouml;ffel)</H3>
<P>
&raquo;Bei mir fing alles damit an das ich mir im Urlaub einmal den Test vom
infinitiv Tower in der AMIGASpecial durchgelesen habe. Als dort von vielen
weiterungsm&ouml;glichkeiten die Rede war dachte ich mir, wenn der AMIGA einmal
dementsprechend ausgebaut w&auml;re wurden doch bestimmt einmal ein paar PC
(pfui) Usern die Augen rausfallen.
</P>
<P>
Also genau 2 Wochen sp&auml;ter bei Micronik angerufen und den Tower bestellt.
Dort sagte man mir es w&uuml;rde 3 - 5 Tage mit der Lieferung dauern. Also 4
Tage sp&auml;ter klingelte der Postbote bei mir und gab mir gegen 549,50 DM mein
Paket.
</P>
<P>
Nachdem ich meinen 12er auseinandergelegt habe und alle Kabel von der
Hauptplatine abgezogen habe war es soweit, endlich konnte es mit dem Einbau
beginnen. Also zuerst habe ich den Wechselrahmen f&uuml;r die Hauptplatine aus
dem Tower genommen und die Platine festgeschraubt. Womit sich aber auch
schon die ersten Probleme f&uuml;r mich ergaben. Da mein AMIGA noch von
Commodores Zeiten war, und die Platinenhalterung anscheinend nur f&uuml;r
Escom´s AMIGA´s vorgesehen war. Als erstes mu&szlig;te ich feststellen das die
L&ouml;cher f&uuml;r die Schrauben die die Hauptplatine halten nicht &uuml;bereinstimmten,
und dann kam noch hinzu das die &quot;&Ouml;ffnungen&quot; f&uuml;r die Ports nicht passten.
Also holte ich gleich eine Feile (ja ihr habt richtig gelesen) und habe die
&Ouml;ffnungen f&uuml;r die Ports an der R&uuml;ckseite der Platinenhalterung
ausgeschliffen. Und siehe da nun passten auch die L&ouml;cher f&uuml;r die Schrauben,
die die Platine halten mu&szlig;ten.
</P>
<P>
Von nun an ging eigentlich alles recht schnell, nachdem die Platine
festgeschraubt war wurde noch die Festplatte und das Diskettenlaufwerk
eingebaut und alle Kabel angeschlossen. Nun konnten mich nur noch die
Seitenverkleidungen des Towers vor dem dr&uuml;cken des Power Knopfes trennen.
Also schnell noch die Seitenverkleidungen auf den Tower gesteckt und los
gings. Doch was ist jetzt schon wieder ich h&ouml;rte zwar die Festplatte
knacken und das Netzteil rauschen, aber Bild war keines da. Also dachte ich
mir nicht gleich die Panik bekommen und habe es noch einmal mit einem
Tastaturreset  probiert, und siehe da schon lief alles einwandfrei.
</P>
<P>
Fazit
</P>
<P>
Solange man kein Mensch ist der ungeduldig ist kommt man oder Frau mit dem
invinitiv Tower gut zu recht. Auch das Towergeh&auml;use an sich ist trotz
alledem das es nur aus Plastik besteht sehr stabil.
</P>
<P>
Mein System
</P>
<P>
A1200 invinitiv Tower, Blizzard PPC 603e/160 Mhz mit 68lc040/25 Mhz, 64 MB
Ram, 4.0 GB HD,internes HD Laufwerk 1.76 MB, Scandoubler intern, 15&quot; S-VGA
Monitor, 24*CD-Rom, Zip-Laufwerk, Arowana 56K-Modem.
</P>
<P>
Andreas Schauml&ouml;ffel&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
