<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Toimitukselliset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
								<table width="100%">
									<tr>
										<td width="300"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY.</font></td>
										<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">KOKOUSMUISTIO</font></td>
									</tr>
									<tr>
										<td width="300"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">HALLITUS 2000-2001</font></td>
										<td></td>
									</tr>
									<tr>
										<td width="300"></td>
										<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">1.4.2001</font></td>
									</tr>
								</table>
								<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><br>
									
						HALLITUKSEN KOKOUS 4/2000<br>
									<br>
								</font>
								<table width="100%">
									<tr>
										<td valign="top" width="100"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AIKA</font></td>
										<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">1. lokakuuta - 31. joulukuuta</font></td>
									</tr>
									<tr>
										<td valign="top" width="100"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">PAIKKA</font></td>
										<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Internet-postituslista</font></td>
									</tr>
									<tr>
										<td valign="top" width="100"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">L&Auml;SN&Auml;</font></td>
										<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Terho Henriksson<br>
												
									Tomi Jaskari<br>
												
									Timo Kemppaala<br>
												
									Valtteri Murto<br>
												
									Jarmo Piippo<br>
												
									Ville Sarell<br>
												
									Anu Seilonen<br>
												
									Paula-Christiina Wirtanen<br>
											</font></td>
									</tr>
								</table>
								<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><br>
									<b>1</b><br>
									<b>T&auml;st&auml; kokousmuistiosta</b></font>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">T&auml;h&auml;n muistioon on ker&auml;tty Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n hallituksen Internetiss&auml; postituslistallaan ja IRC-kokouksissaan 1.1. - 1.4.2001 k&auml;ym&auml;n keskustelun p&auml;&auml;kohtia. Otteet ovat eritt&auml;in tiiviit&auml; lyhennelmi&auml;, eik&auml; muistion ole edes tarkoitus sis&auml;lt&auml;&auml; selvityst&auml; kaikista k&auml;sitellyist&auml; aiheista, vaan tuoda esille yhdistystoiminnan kannalta merkitt&auml;v&auml;t seikat.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Hallituksen postituslista tavoittaa kaikki hallituksen j&auml;senet, mutta kaikki eiv&auml;t v&auml;ltt&auml;m&auml;tt&auml; ole ottaneet osaa kaikkiin aiheisiin.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>2</b><br>
										<b>K&auml;siteltyj&auml; aiheita</b></font></p>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vuosikokouksen 2000 toteuttamat yhdistyksen s&auml;&auml;nt&ouml;muutokset toimitettiin rekisterimuutoskaavakkeiden v&auml;lityksell&auml; Patentti- ja rekisterihallitukselle, ja uusitut s&auml;&auml;nn&ouml;t kokonaisuudessaan julkaistiin yhdistyksen kotisivuilla ja Saku-lehdess&auml; #36. My&ouml;s tilipankin vaihto etenee suunnitellusti, t&auml;ll&auml; hetkell&auml; meneill&auml;&auml;n on toimenpiteeseen vaadittuihin asiakirjoihin tarvittavien allekirjoitusten hankkiminen ao. henkil&ouml;ilt&auml;.</font></p>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yhdistykselle tarjoutui mahdollisuus j&auml;rjest&auml;&auml; kotisivujensa osaksi kauan toivottu suomenkielinen keskustelupalsta Amiga- ja yhdistysaiheisille asioille, ja tilaisuus p&auml;&auml;tettiin ilman muuta hy&ouml;dynt&auml;&auml; v&auml;litt&ouml;m&auml;sti. Helmikuussa avattu Saku-foorumi her&auml;tti odotetusti sek&auml; my&ouml;nteisi&auml; mielipiteit&auml; ett&auml; liev&auml;&auml; arvostelua, mutta vastaanotto oli valtaosin eritt&auml;in l&auml;mmin ja innostunut. Nopeasti kasvuun l&auml;htenyt viestim&auml;&auml;r&auml; todisti omalta osaltaan keskustelupaikan olleen todellakin odotettu. Saku-foorumiin p&auml;&auml;see yhdistyksen kotisivuilta valitsemalla etusivun Keskustelu-kohdan. Viestien kirjoitusta ja muotoilua opastetaan tarkemmin foorumin kattavissa ohjeissa, joihin kannattaa tutustua, jotta pystyy hy&ouml;dynt&auml;m&auml;&auml;n tarjolla olevia monipuolisia mahdollisuuksia t&auml;ysipainoisesti. Foorumin teknisest&auml; toteutuksesta on vastannut p&auml;&auml;osin Terho Henriksson, mist&auml; suuret kiitokset h&auml;nelle koko yhdistykselt&auml;.</font></p>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku 2001 -tapahtuma pidet&auml;&auml;n alkusyksyst&auml;, mutta tarkkaa p&auml;iv&auml;m&auml;&auml;r&auml;&auml; ei ole viel&auml; voitu p&auml;&auml;tt&auml;&auml;, ennen kuin mahdollisten ulkomaisten n&auml;ytteilleasettajien osallistumishalukkuuden ja suunnitelmien vaikutukset aikatauluun ovat lopullisesti selvill&auml;. Tapahtumavastaava Terho Henriksson pyrkii l&auml;hiaikoina k&auml;ynnist&auml;m&auml;&auml;n aktiivisen yhteydenpidon my&ouml;s mukaan ilmoittautuneiden tapahtuma-avustajien kesken, jotta teht&auml;v&auml;jaon suunnitteluun ja tapahtumasis&auml;ll&ouml;n toteutuksen vaatimaan pohjaty&ouml;h&ouml;n saadaan tuotua riitt&auml;v&auml;sti tehokkuutta ja yhten&auml;isyytt&auml;. Terholle (<a href="mailto:terho.henriksson@kopteri.net">terho.henriksson@kopteri.net</a>) voi edelleen tarjota apuaan, ja ideoita voi esitt&auml;&auml; ja kommentoida my&ouml;s yhdistyksen Saku-foorumiin perustetulla Saku 2001 -keskustelualueella. Merkitt&auml;v&auml;ll&auml; panoksella tapahtuman toteutumista voi auttaa my&ouml;s liittym&auml;ll&auml; yhdistyksen j&auml;seneksi, sill&auml; t&auml;ll&auml; hetkell&auml; yhdistyksell&auml; ei ole viel&auml; koossa taloudellisia resursseja aiempia tapahtumia vastaavan kokoisten tilojen vuokraamiseen tapahtumaa varten. Ajantasaiset liittymisohjeet l&ouml;ytyv&auml;t aina helpoiten yhdistyksen kotisivuilta. Auta Sakua, niin Saku auttaa sinua!</font></p>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Silloin t&auml;ll&ouml;in toivottujen kerhoiltojen pitoon Oulussa n&auml;ytt&auml;isi saatujen ehdotusten perusteella l&ouml;ytyv&auml;n joitakin yhdistyksen k&auml;ytt&ouml;&ouml;n sopivia ilmaisia tiloja. Toistaiseksi ei potentiaalisilla tilaisuuden j&auml;rjest&auml;jill&auml; ole ollut mahdollisuuksia varata tarpeeksi aikaa kerhoillan suunnitteluun ja pit&auml;miseen, mutta tilojen j&auml;rjestymisen my&ouml;t&auml; on ehk&auml; tullut aika yritt&auml;&auml;.</font></p>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Norjalainen Amitopia-lehti p&auml;&auml;tti julkaista lyhyen esittelyn Suomen Amiga k&auml;ytt&auml;j&auml;t ry.:n toiminnasta. Esittelyn kaksikieliseen lehteen (norja ja englanti) kirjoitti lehden toimituksen pyynn&ouml;st&auml; Anu Seilonen.</font></p>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yhdistyksen kotisivuille p&auml;&auml;see t&auml;st&auml; l&auml;htien my&ouml;s AmigaFin.org Amiga-portaaliin avatusta osoitteesta <a href="http://saku.amigafin.org" target="_top">http://saku.amigafin.org</a>, joka todenn&auml;k&ouml;isesti tulee pysym&auml;&auml;n samana vaikka sivujemme varsinainen osoite tai niiden fyysinen sijainti joskus syyst&auml; tai toisesta muuttuisi.</font></p>
							</td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
