<HTML>
<HEAD><TITLE>
Vorwort
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0000.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0200.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Vorwort
</font>
</TD></tr>
</TABLE>


<P>


<H1>
Vorwort
</H1>



Willkommen zur neuen Ausgabe von AMIGA aktuell.
<P>
Bereits am Anfang des vergangenen Monats k&uuml;ndigte sich an, da&szlig; der Mai
einer der spektakul&auml;rsten Monate in der Geschichte des AMIGA werden w&uuml;rde.
Genauso ist es gekommen, wie zumindest die AMIGA-aktuell-Abonnenten unter
Euch aus den versandten Specials erfahren konnten:
<P>
<UL><LI>
   Die AMIGA-Entwicklungsabteilung AMIGA, Inc. hat ihre Pl&auml;ne f&uuml;r die
n&auml;chsten zwei Jahre offengelegt. W&auml;hrend man &uuml;ber die Strategie des
Unternehmens, den AMIGA wieder konkurrenzf&auml;hig zu machen, geteilter
Meinung sein kann, war jedoch die Art und Weise, in der die Informationen
ver&ouml;ffentlicht wurden, alles andere als akzeptabel. Dies &auml;u&szlig;erte sich bei
manchen Usern in einer fast panischen Anti-Intel-Hysterie, die bei etwas
n&auml;herer Betrachtung der Situation (bzw. einer Informationspolitik von
AMIGA, Inc., die diesen Namen auch verdient) v&ouml;llig unbegr&uuml;ndet ist.
Denn: Der "Next-Generation"-AMIGA wird KEINE Intel- oder kompatible CPU
enthalten, sondern auf einer vollkommen neuen Prozessor- und Multimedia-
Architektur basieren.
<P>
</LI></UL>
Das zweite Thema von Wichtigkeit verbla&szlig;t nat&uuml;rlich angesichts der
richtungsweisenden Entscheidungen von AMIGA, Inc:
<P>
<UL><LI>
   Phase 5 und Haage & Partner haben ihre Streitigkeiten &uuml;ber die PowerPC-
Betriebssoftware beigelegt und haben Pl&auml;ne zur Entwicklung eines
gemeinsamen PowerPC-Rechners mit AMIGA-OS-Kompatibilit&auml;t ver&ouml;ffentlicht.
Schon vorher ist bekanntgeworden, da&szlig; Haage & Partner mit der Entwicklung
einer 68k-Emulation f&uuml;r PowerPC besch&auml;ftigt ist.
<P>
</LI></UL>
Alle Einzelheiten zu diesen Top-Themen, und vieles andere, k&ouml;nnt Ihr in
dieser Ausgabe von AMIGA-aktuell lesen.
<P>
Jetzt noch etwas in eigener Sache:
<P>
<UL><LI>
   Der in der letzten Ausgabe von uns vorgeschlagene C-Workshop f&uuml;r
Einsteiger ist auf reges Interesse gesto&szlig;en. Leider hat sich bis jetzt
jedoch noch niemand gemeldet, der bereit ist, einen entsprechenden Kurs
zu verfassen. Deshalb hier noch einmal ausdr&uuml;cklich unser Aufruf:
Wer hat Interesse, einen C-Workshop f&uuml;r Einsteiger zu schreiben?
<P>
</LI></UL>
Viel Spa&szlig; jetzt bei dieser Ausgabe,
<P>
Euer
<P>
Carsten Schr&ouml;der
<P>


<P ALIGN=RIGHT>
<A HREF="0000.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0200.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
