<HTML>
<HEAD><TITLE>
AMIGA-aktuell-Forum
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0404.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0406.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA-aktuell-Forum
</font>
</TD></tr>
</TABLE>


<P>

<H2>5. Leserbrief mit Anmerkungen zu ge&auml;u&szlig;erter Kritik (von Thorsten Blancke)</H2>

<P>
»Ich bin's, Tosh. Ich wurde in den letzten Leserbriefen zweimal rezensiert.
In meinem Leserbrief teilte ich meine Meinung zur Weiterentwicklung des
Amigas mit. Ich m&ouml;chte kurz auf die Rezensierungen zu sprechen kommen. J&ouml;rg
Handwerg &uuml;bersah, da&szlig; es auf der Leserbriefseite zwei Beitr&auml;ge gab. Er
bezieht sich auf den anderen, dessen Inhalt ich auch kritisieren w&uuml;rde.
Tobias Weihmann schrieb:
<P>
<PRE>>>»Sch&ouml;n, da&szlig; es bei der Weiterentwicklung des Amigas voran geht. Jedoch
>>habe ich meine Bedenken, den Zukunfts-Amiga als Multisystem-Rechner
>>herauszubringen. Apple beispielsweise n&auml;hert sich immer mehr dem
>>Windoof-PC-Standard - und gleichzeitig werden immer h&ouml;here Verluste
>>eingefahren.</PRE>
<P>
<PRE>>Apple faehrt in letzter Zeit keineswegs immer hoehere Verluste ein.
>MacOS 8 ist (fuer die angepeilte Benutzer-Gruppe) grandios, und
>Rhapsody (das bereits auf Intel-Rechnern laeuft) sehr vielversprechend.</PRE>
<P>
So ein, sorry, Quatsch! Wer Gewinne aufgrund von Umsatzeinbu&szlig;en von ca.
30% (im Vergleich zum Vorjahr) macht, dem steht das Wasser bis zum Hals.
Apples Strategie ist defensiv, d. h. die Firma verabschiedet sich gerade
endg&uuml;ltig vom Massenmarkt, um &uuml;berhaupt weiterzubestehen.
<P>
<PRE>>>Um eine wirkliche Alternative zum PC zu bieten, mu&szlig; ein Rechnersystem
>>her, das sich durch einfache Assemblerprogrammierung auszeichnet (ohne
>>Millionen Treiber und "Standards").</PRE>
<P>
<PRE>>Und damit Rueckkehr zu den Hardware-abhaengigen Systemen der 80'er???
>Nein, die Zukunft liegt in der Standardisierung und den offenen Systemen.
>Rhapsody fuer Intel / Windows fuer PPCs - ich finde das gut.
>Wer Windows fuer besser haelt als Apple's System, installiert Rhapsody.
>Wer gerne mit einem Amiga-System arbeitet, installiert sich AmigaOS.
>Ueber Schichtenmodelle steht die Hardware dabei jedem installierten
>System offen. Software-Portierung ist ein Kinderspiel.</PRE>
<P>
<PRE>>Ein solches System sollte eigentlich alle Wuensche befriedigen.</PRE>
<P>
Entschuldigung, das ist ausgemachter Bl&ouml;dsinn. Ich kenne keinen stabil
laufenden PC, und das ist eine Grundvoraussetzung.
<P>
So sende ich hiermit ein abschlie&szlig;endes
<BR>XOR    Tobi,Tobi
<BR>betreffs dieses Leserbriefs.
<P>
Aber jetzt mal zu was wirklich Wichtigem, der Zukunft der EDV:
<P>
Der PC verk&ouml;rpert eine Philosophie der komplexer werdenden Verwaltung
f&uuml;r komplexer werdende Aufgaben. Kurz umrissen: Die Hardewareproduzenten
entwickeln immer mehr tautologische Hardware, die mittels Treibern unter
einer Betriebsoberfl&auml;che namens Windows zur Ansteuerung &uuml;ber Schnittstellen
bereitgestellt werden. Parallel hierzu werden von der Softwareseite immer
mehr Applikations-Anwendungen angedacht. Auch diese werden unter Windows
mittels Hochsprachen realisiert. Nun kennt der Computer kein abstraktes
Denken, sondern eigentlich nur die Funktion eines Transistors. Da mit jeder
Transposition (Maschinencode unter Hochsprache generiert unter Windows mit
Treibern appliziert) m&ouml;gliche implementierte Fehlerquellen, die zudem vom
Programmierer der obersten Oberfl&auml;che nicht mehr nachvollziehbar,
geschweige denn ausl&ouml;schbar sind, sich multiplizieren, ist diese
Philosophie der PCs zum Scheitern verurteilt.
<P>
Im Amiga sehe ich die Chance, den Programmierern wieder mehr Kontrolle &uuml;ber
die Hardware zu geben. Systemn&auml;he bedeutet n&auml;mlich Ausmerzung von
Fehlerquellen. Systemn&auml;he bedeutet &uuml;berdies Systemoptimierung. Je n&auml;her der
Maschinencode an die Hardware angepa&szlig;t geschrieben ist, desto h&ouml;her ist die
Systemleistung. Redundanter Code wie auf PCs bremsen das System auf einen
Bruchteil der m&ouml;glichen Leistung ab.
<BR>Wer also sichere, leistungsst&auml;rkere und letzten Endes auch leichter
programmierbare Systeme als PCs haben m&ouml;chte, der hofft auf die Zukunft
des Amigas.
<P>
Ich hoffe, da&szlig; sich bei Computern nicht die Qualit&auml;tsstufe durchsetzt, die
sich z.B. in der Politik durchgesetzt hat.
<P>
Break. Sorry, leider nicht mehr Zeit,
bye, Tosh.«
<P>


<P ALIGN=RIGHT>
<A HREF="0404.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0406.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
