<HTML>
<HEAD><TITLE>
AMIGA-aktuell-Forum
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0405.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0407.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA-aktuell-Forum
</font>
</TD></tr>
</TABLE>


<P>

<H2>6. Themenbeitrag "AMIGA der Zukunft" (von Alexx Riedel)</H2>

<P>
Alexx Riedel hat uns seine Vorstellungen zu einem AMIGA der Zukunft
mitgeteilt:
<P>
»Hardware:
<P>
Es ist immer wieder deprimierend, wenn da hin und wieder Leute Amiga-eigene
Customchips als Vorteil oder gar notwendige Bedingung f&uuml;r ein neues Modell
sehen. Das war ganz sicher vor 10 Jahren so, aber heute mu&szlig; ich mir da nur
an den Kopf langen. Nehmen wir nur das Beispiel Grafikchips (2D/3D):
<P>
Spezialistenfirmen auf dem Gebiet investieren da Unsummen in die
Entwicklung immer neuer Features f&uuml;r solche Bausteine, und entsprechend
leistungsf&auml;hig sind die (BTW &auml;u&szlig;erst preiswert) verf&uuml;gbaren Grafikchips.
Die lassen den Amiga, gerade mit AGA-Chips, in Sachen Multimedia einfach
stehen. Warum sollte solche Technologie nicht f&uuml;r den Amiga genutzt werden?
Ganz zu schweigen davon, da&szlig; Amiga International daf&uuml;r wohl nicht das
notwendige Geld hat - das Chipdesign kostet Zeit! Und genau die hat der
Amiga nicht mehr (eigentlich ist die Zeit f&uuml;r den Amiga hardwaretechnisch
schon vor Jahren abgelaufen, das leistungsf&auml;hige Betriebssystem und einige
eifrige Entwickler und Freaks haben ihn bislang gerettet).
<P>
Oder das Beispiel "Erweiterungsbus": PCI ist &auml;u&szlig;erst leistungsf&auml;hig, bietet
Plug´n´Play, und es gibt jede Menge preiswerte Erweiterungskarten aller Art
daf&uuml;r, f&uuml;r die "nur noch" ein Treiber geschrieben werden mu&szlig;. Warum Zeit
mit der Entwicklung eines neuen Zorro-Systems verplempern?
<P>
Auf Bereiche wie Floppy-Controller, Schnittstellen, AT-Bus, SCSI oder
Kleinigkeiten wie Keyboard und Maus m&ouml;chte ich gar nicht erst eingehen. Da
ist das einzige (allerdings unbedingt notwendige) Zugest&auml;ndnis an Amiga-
eigene Spezialit&auml;ten, da&szlig; die Tastatur statt der "Windoofs"-Tasten
"Amiga"-Tasten bekommt!
<P>
Das Rad mu&szlig; nicht zweimal erfunden werden. Wo Hardware aus dem PC-Bereich
billig und leistungsf&auml;hig in den neuen Amiga integriert werden kann - nur
zu! Und wer solche zwingenden Schritte aus kurzsichtigen Prinzipien ("keine
Wintel-Hardware in meinem Amiga") ablehnt, der sei dran erinnert, da&szlig; auch
Macs und diverse unter Unix laufende Systeme so zur vollen Zufriedenheit
funktionieren.
<P>
Nat&uuml;rlich bin ich nicht aus Prinzip gegen Custom-Hardware - die A/Box h&auml;tte
mir schon hervorragend gefallen. Nur sollten solche Eigenentwicklungen eher
als langfristige Ziele denn als zwingende Notwendigkeit angesehen werden.
<P>
Betriebssystem:
<P>
Ein paar Unix-Spezialit&auml;ten - allen voran Speicherschutz und Resource
Tracking - st&uuml;nden dem Amiga wirklich nicht schlecht zu Gesicht. Wie oft
hat es mich genervt, da&szlig; amoklaufende Programme den ganzen Amiga
mitgerissen haben! Auch die integrierten Netzwerk- und Multiuser-
F&auml;higkeiten eines leistungsf&auml;higen Unix-Kernels w&auml;ren eine Bereicherung f&uuml;r
das AmigaOS. Wobei nat&uuml;rlich die Amiga-Eigenheiten (z.B. Datatypes etc.)
erhalten bleiben m&uuml;&szlig;ten, denn wo w&auml;re sonst der Unterschied zu Linux?
<P>
Weitere Vorschl&auml;ge:
<UL><LI>
   La&szlig;t die neue Workbench doch von Greg Perry (DirOpus) entwickeln!
</LI><LI>
   Ein TCP/IP-Stack á la Miami.
</LI><LI>
   HTML als Erg&auml;nzung/Ersatz f&uuml;r AmigaGuide.
</LI><LI>
   GUI-Gestaltung flexibel und konfigurierbar wie bei MUI (wobei nat&uuml;rlich
Raum f&uuml;r andere GUI-Libraries sein m&uuml;&szlig;te, &auml;hnlich der diversen Toolkits
f&uuml;r X-Windows).
</LI><LI>
   Als Grafik-Subsystem RTG nach Art von CyberGFX, f&uuml;r den Sound halt dann
AHI o.&auml;.
<P>
</LI></UL>
Die meisten dieser m.E. notwendigen Verbesserungen des AmigaOS sind ohnehin
schon in irgendeiner Form vorhanden, es m&uuml;&szlig;te nur noch daf&uuml;r gesorgt
werden, da&szlig; sie sich nahtlos ins Betriebssystem integrieren.
<P>
Wer sehen will, woran sich der neue Amiga heute messen mu&szlig;, der sollte sich
nicht Win95 ansehen, sondern Linux/KDE auf einem Standard-PC f&uuml;r unter
2000.-! Blick &uuml;ber den Tellerrand! Das ist was, was so einigen leitenden
K&ouml;pfen von Amiga International zu fehlen scheint, die da laut dar&uuml;ber
nachgedacht haben, den Amiga der Zukunft mit einem Prozessor einer seit
Jahren eingestellten Prozessorserie zu best&uuml;cken.
<P>
&Uuml;berhaupt, die Vorgehensweise dieser Firma ... aber dazu m&ouml;chte ich mich
gar nicht erst auslassen.
<P>
CU<BR>
Alexx Riedel<BR>
mailto:<A HREF="mailto:riedel@forst.uni-muenchen.de">riedel@forst.uni-muenchen.de</A><BR>
mailto:<A HREF="mailto:101.128890@germany.net">101.128890@germany.net</A>«
<P>


<P ALIGN=RIGHT>
<A HREF="0405.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0407.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
