<HTML>
<HEAD><TITLE>
Special: Erfahrungsberichte zu Tower-Umbauten
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0504.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0600.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Special: Erfahrungsberichte zu Tower-Umbauten
</font>
</TD></tr>
</TABLE>


<P>

<H2>5. Bericht: Eagle-Towergeh&auml;use f&uuml;r A3000 (von Ralf Kaiser)</H2>

<P>
»Leider kann auch ich nur Negatives zu den Towerumbauten von der Firma
Eagle beitragen !!!
<P>
Hier ist mein Leidensweg in Tagebuchform:
<P>
27.11.97<BR>
Habe bei der Firma Eagle einen Towerumbau im Xenon-Design f&uuml;r einen
A3000 bestellt, Preis mit Porto und Versand 650,00 DM.
<P>
03.12.97<BR>
Tower ist angekommen, schlechte Verpackung. Tower ausgepackt, der erste
Eindruck war positiv.
Aber dann der Umbau.....
<BR>Anleitung fehlt !!! Tower ge&ouml;ffnet, alles wackelt und klappert, mu&szlig;te erst
einmal fast alle Schrauben nachziehen, viele Metallteile sind scharfkantig
- hohe Verletzungsgefahr!!! So - jetzt das Motherboard rein, pa&szlig;t nicht,
da s&auml;mtliche Bohrl&ouml;cher falsch gesetzt !!!!
<P>
03.12.97<BR>
Telefongespr&auml;ch mit Eagle. Antwort: Mu&szlig; wohl in der Fertigung ein
4000er-Halterungsblech montiert worden sein, anstatt des 3000er-.
Mu&szlig; Tower auf eigene Kosten zur&uuml;ckschicken, weil die Firma Eagle keine
unfreien Pakete annimmt. Bekomme aber als Ausgleich 2 Amiga-CD-ROMs
<P>
10.12.97<BR>
Der Tower ist wieder da, leider wurde kein neues Blech montiert,
sondern das alte einfach umgebohrt. Leider pa&szlig;t das Board immer noch nicht
- so mu&szlig;te ich 3 Bohrungen versetzen. Jetzt das Daughterboard rein, aber
was soll das mit dem 50,00 DM teuren Original-Daughterboard-
Blechhalterungskit??? Da pa&szlig;t ja rein gar nichts!!! 3 Stunden Basteln und
Feilen, damit es einigerma&szlig;en pa&szlig;t.
Die restlichen Montagearbeiten verliefen reibungslos - bis auf das
Netzteil: Dieses war einfach defekt !!
<P>
14.12.97<BR>
Telefongespr&auml;ch mit Eagle. Antwort: Sie schicken mir sofort ein neues
zu.
<P>
18.12.97<BR>
Neues Netzteil ist da, aber WIEDERUM ist es ein DEFEKTES !!!!
<P>
21.12.97<BR>
Telefongespr&auml;ch mit Eagle. Antwort: Es tut ihnen leid, sie schicken mir
sofort ein neues zu.
<P>
22.12.97<BR>
Ich schicke die 2 defekten Netzteile an Eagle zur&uuml;ck.
<P>
28.12.97<BR>
Das 3. Netzteil ist da - aber - wie sollte es anders sein: DEFEKT !!!
<P>
28.12.97<BR>
Telefongespr&auml;ch mit Eagle. Ergebnis: Nach langem Hin und Her einige ich
mich mit Eagle darauf, da&szlig; ich das 3. defekte Netzteil zur&uuml;ckschicke und
die Fa. Eagle mir einen Scheck &uuml;ber die H&ouml;he des Netzteiles zusendet.
<P>
29.12.97<BR>
Neues Netzteil selbst gekauft, eingebaut, Adapter dran, Stecker rein und -
der Amiga l&auml;uft !!!!
<P>
07.01.98<BR>
Noch immer ist kein Scheck mit dem Differenzbetrag angekommen. Erneutes
Telefonat mit Eagle. Antwort: Der Scheck ist unterwegs.
<P>
Erst nach ca. 15 Telefongespr&auml;chen und unter Androhung von gerichtlichen
Ma&szlig;nahmen bekam ich am 28.01.98 meinen Scheck, zwar 30,00 DM zuwenig -
aber dies war mir dann auch egal!!
<P>
Leider ging mir w&auml;hrend des Umbaus der T&uuml;rschlie&szlig;er des Towers kaputt - f&uuml;r
die Lieferung eines Ersatzschlie&szlig;ers ben&ouml;tigte Eagle 4 Wochen !
Daf&uuml;r war er auch kostenlos (Normalpreis: 80 Pfennige).
<P>
Als Resultat war mein Amiga fast 6 Wochen lahmgelegt, ich hatte fast 50,00
DM an Telefonkosten und etwa 19 Stunden Schrauberei.
<P>
Und zum Schlu&szlig;
<P>
NIE WIEDER EAGLE !!!!!
<P>
Ralf Kaiser«
<P>


<P ALIGN=RIGHT>
<A HREF="0504.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0600.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
