<HTML>
<HEAD><TITLE>
AMIGA ActionGamesPlayerJoker - von Jens Schr&ouml;der (jschroe@gwdg.de)
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0803.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0805.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA ActionGamesPlayerJoker - von Jens Schr&ouml;der (jschroe@gwdg.de)
</font>
</TD></tr>
</TABLE>


<P>

<H2>4. Spiele-News aus aller Welt</H2>


<H3>Z f&uuml;r AMIGA erscheint!</H3>
<P>
Das Echtzeit-Strategiespiel Z von den Bitmap Brothers erscheint nun doch
f&uuml;r den AMIGA. Das Spiel wurde vor einigen Jahren auch f&uuml;r AMIGA
angek&uuml;ndigt, erschien dann wegen zu langsamer AMIGA-Hardware aber nur f&uuml;r
PCs. Laut einer E-Mail der Bitmap Brothers wird clickBOOM das Spiel
ver&ouml;ffentlichen.
<P>
<H3>Foundation erschienen</H3>
<P>
Das von vielen lang erwartete Echtzeit-Strategiespiel Foundation wurde auf
der World of AMIGA ver&ouml;ffentlicht. Ein Test des Spiels mit &Auml;hnlichkeiten
zum AMIGA-Hit "Die Siedler" folgt (hoffentlich) in der n&auml;chsten Ausgabe
von AMIGA AGPJ. Paul Burkey, Programmierer von Foundation hat sich bereits
einem weiteren Projekt zugewendet, &uuml;ber das er jedoch noch keine Details
bekanntgibt. Foundation wird nebenbei verfeinert und verbessert. Der
brillante Support von Paul Burkey wird deutlich, wenn man sieht, da&szlig;
bereits kurz nach Erscheinen des Spiels Updates erh&auml;ltlich waren (u.a. im
Aminet), eine Foundation-Support-Homepage eingerichtet wurde und eine
Foundation-Mailing-List ins Leben gerufen wurde, in der Fans des Spiels
miteinander diskutieren k&ouml;nnen. N&auml;here Informationen gibt es auf der
Foundation-Support-Page: <A HREF="http://www.sneech.demon.co.uk/FoundSupport.html">http://www.sneech.demon.co.uk/FoundSupport.html</A>
<P>
<H3>clickBOOM-Update</H3>
<P>
Quake ist erschienen und wurde bereits an die Besteller ausgeliefert. Ein
Test des Spiels wird (hoffentlich) in der n&auml;chsten Ausgabe von AGPJ folgen.
Die ersten Tests des Spiels ergaben die Wertungen 95 % (CU AMIGA) und 94 %
(AMIGA Format). Alle Interessierten sollten sich allerdings erst den
QuakePlayer ansehen und entscheiden, ob das Spiel auf ihrem Rechner schnell
genug l&auml;uft. Unter einem 060-Prozessor l&auml;uft nahezu nichts.
Wie bereits vermutet, ist das Realtime-Strategiespiel Napalm: The Crimson
Crisis von clickBOOM das Spiel, das seit einiger Zeit von Ablaze
Entertainment entwickelt wird und vorher Diversia hie&szlig;.
<P>
<H3>Vulcan-News</H3>
<P>
Genetic Species ist endlich erschienen. Auf der World of Amiga in London
wurde das Spiel erstmals verkauft. Ein Test folgt in der n&auml;chsten Ausgabe.
Ein Zeichen daf&uuml;r, da&szlig; Vulcan Software keinesfalls in der n&auml;heren Zukunft
dem AMIGA den R&uuml;cken zukehren wird, ist die Meldung, da&szlig; die Firma die
Programmierer Black Flag unter Vertrag genommen hat und deren Echtzeit-
Strategiespiel Caveman Species ver&ouml;ffentlichen wird. Das Spiel findet in
der Steinzeit statt, wo der Spieler verschiedene Aufgaben hat. Er mu&szlig; z.B.
verfeindete St&auml;mme besiegen, bestimmte Entwicklungsstadien erreichen oder
St&auml;dte und unbekannte St&auml;mme entdecken. Das Spiel wird &uuml;ber 300 MB an 3D-
Animationen und 5 Filmsequenzen verf&uuml;gen. Auch ein TCP/IP-Support ist
geplant, mit dem bis zu 4 Spieler &uuml;ber Modems gegeneinander spielen
k&ouml;nnen. Ver&ouml;ffentlicht werden soll Caveman Species im Sommer. Die
Systemvoraussetzungen sind eher gering: 020-Prozessor, 4 MB RAM, AGA,
CyberGFX oder Picasso und CD-ROM-Laufwerk.
<P>
<A HREF="img/CavemanSpecies.jpg">Screenshot</A>
<P>
<H3>Deimos Design stoppt PPC-Support</H3>
<P>
Deimos Design, Entwickler des Command&Conquer-Clones Maim & Mangle, haben
den PPC-Support eingestellt. Als Gr&uuml;nde gaben sie unter anderem die hohen
Kosten der PowerPC-Boards, die fragliche Zukunft der PowerUp-Boards und den
inzwischen beigelegten Streit zwischen Phase 5 und Haage & Partner an.
Das Spiel Maim & Mangle wird nun ausschlie&szlig;lich f&uuml;r die 680x0-Amigas
erscheinen. Deimos Design beschlo&szlig; au&szlig;erdem, aus der Verbindung mehrerer
PPC-Entwickler "The World Foundry" auszusteigen.
<P>
<H3>Golem erscheint bei Power Computing</H3>
<P>
Power Computing, die bereits Breathless und Big Red Adventure
ver&ouml;ffentlicht haben, haben einen weiteren Titel unter Vertrag genommen:
Golem von Underground Software. Golem spielt im Jahr 4096 und enth&auml;lt
diverse einzelne Spiele, ein Beat Em Up, ein Adventure, ein Shoot Em Up
und andere Teilspiele. Golem besteht aus diversen Episoden. Die erste
Episode "Resurrection" erz&auml;hlt die Entstehungsgeschichte des GOLEMs und
l&auml;&szlig;t den Spieler den ersten interaktiven Film auf AMIGAs erleben. Dieser
Film besteht aus Full-Motion-Video-Adventure- Sequenzen, in denen der
Spieler den GOLEM steuert. GOLEM wird auf 2 CDs erscheinen, einen 020-
Prozessor voraussetzen, Fast-RAM und ein 6xCD-ROM-Laufwerk ben&ouml;tigen.
Grafikkarten werden unterst&uuml;tzt.
<P>
<A HREF="img/Golem.jpg">Screenshot</A>
<P>
<H3>Enforce-Demo erh&auml;ltlich</H3>
<P>
Ein Demo des 3D-Rollenspiels Enforce (AGPJ berichtete) ist nun erh&auml;ltlich.
Enforce soll eine &auml;hnliche Engine wie Quake bieten, jedoch schneller sein.
Alle Interessenten k&ouml;nnen sich das Demo entweder auf der Homepage von
Insanity (allerdings nur w&auml;hrend der Abendstunden) oder unter der folgenden
Adresse downloaden: <A HREF="http://www.cadlink.co.uk/files/demo.lha">http://www.cadlink.co.uk/files/demo.lha</A>
Ben&ouml;tigt wird mindestens ein 040-Prozessor. Auf einem 060-Prozessor soll
es sehr fl&uuml;ssig laufen und sogar im High-Res-Modus spielbar sein.
<P>
<H3>Doom/Quake/Descent-Update</H3>
<P>
<B>neue Doom-Portierung-Version:</B><BR>
DoomAttack ist nun in der Version 0.8&szlig;4 erh&auml;ltlich und mausert sich immer
mehr zur besten Amiga-Doom-Portierung.
<P>
<B>neue Doom-Tools:</B><BR>
DEU 5.20 r3 Alpha ist der erste Doom-WAD-Editor-Port f&uuml;r den AMIGA. Obwohl
es noch eine Alpha-Version ist, lassen sich die hervorragenden
M&ouml;glichkeiten bereits erahnen.
<P>
Dptex v1.0 ist ein Fix um fr&uuml;he Versionen des DOOM.WAD-Files auf dem AMIGA
zum Laufen zu bringen. Bei einigen Versionen dieser Datei gab es eine
Fehlermeldung, die mit diesem kleinen Tool behoben wird. Fazit: sehr
empfehlenswert.
<P>
<B>neue DoomPPC-Port-Versionen:</B><BR>
ADoomPPC 1.3,
ZhaDoom 1.1
<P>
<B>neue Descent-Port-Version:</B><BR>
ADescent 0.7 (2-Spieler-Support + Bugfixes)
<P>
<B>QuakeC:</B>
Im Aminet ist jetzt eine Portierung von QuakeC erh&auml;ltlich.
<P>
<H3>Alien Breed 3D II-Version f&uuml;r Grafikkarten</H3>
<P>
F&uuml;r alle Besitzer einer Grafikkarte gibt es jetzt eine Version von Alien
Breed 3D II - The Killing Grounds, die auf ihren Rechnern l&auml;uft. Die
Original-Version des Spiels lief leider nur auf AGA-Rechnern. Die neue
Version, die hier: <A HREF="http://www.uea.ac.uk/~suamiga/rtggames.html">http://www.uea.ac.uk/~suamiga/rtggames.html</A> zu finden
ist, behebt dieses Problem. Die Grafikkarten-Version ben&ouml;tigt die
rtgmaster.library und mindestens 18 MB RAM. Leider l&auml;uft das Programm eher
noch langsamer als die AGA-Version, was aber bei Optimierung noch zu
verbessern sein k&ouml;nnte. (Vielen Dank an Alexx Riedel f&uuml;r diese
Informationen.)
<P>
<H3>Sayonara Software-News</H3>
<P>
Wie bereits in der letzten Ausgabe von AGPJ berichtet, kehrt Sayonara
Software (u.a. Samba Partie, Samba Partie Pro, Flamingo Tours,...) zum
AMIGA zur&uuml;ck. Ob dies allerdings bejubelt werden sollte, l&auml;&szlig;t sich noch
nicht absehen. Scheinbar will man nur noch ein Paar Mark mit alten Titeln
verdienen. Der bereits ver&ouml;ffentlichte Travel-Manager l&auml;&szlig;t dies zumindest
vermuten. Einen Test des Spiels gibt es hier zwar (vorerst) nicht, allen
Besitzern des Spiels Flamingo Tours sei jedoch dringend vom Kauf
abgeraten, da der Travel Manager scheinbar der Vorg&auml;nger dieses Spiels
ist.<P>
Auch die neue Website der Firma l&auml;&szlig;t nichts Gutes erahnen. Werden hier doch
die bisher erschienenen Spiele mit einem "Wertungsdurchschnitt" versehen,
der mit den realen Tests in der AMIGA-Presse nicht viel zu tun hat.
Aber vielleicht straft der angek&uuml;ndigte Titel Samba World Cup mich ja
l&uuml;gen. Erste Screenshots lassen aber auch hier keinen gro&szlig;en Fortschritt
im Vergleich zu Samba Partie Pro vermuten. Zu den Features des Fu&szlig;ball-
Managers sollen aktuelle Ligen und Spielernamen, Sprachausgabe und
Kommentare w&auml;hrend der Spiele, ein umfangreicher Statistikteil,
Meisterschaft in Deutschland und 5 weiteren europ&auml;ischen L&auml;ndern, WM, EM,
Editor, Videorekorder mit Zoomfunktion und vieles mehr geh&ouml;ren. Samba World
Cup soll p&uuml;nktlich zur Fu&szlig;ball-WM im Juni erscheinen. Ein Test des Spiels
folgt (hoffentlich).
<P>
<I>***Kurz vor Redaktionsschlu&szlig; erreichte mich die Meldung, da&szlig; Sayonara den
Travel-Manager scheinbar nur noch verschenken will. Man hat also
eingesehen, da&szlig; dieses Produkt eher eine Frechheit als ein Spiel ist.***</I>
<P>
<H3>Powder erschienen</H3>
<P>
Auch Powder, das Shoot Em Up von Verkosoft ist inzwischen erschienen. Ein
Preview des Spiels gab es in Ausgabe 2/98, ein Test wird (vielleicht)
folgen.
<P>
<H3>Gloom 3: The Director's Cut</H3>
<P>
Im Mai wurden Screenshots des 3D-Shooters Gloom 3: The Director's Cut
ver&ouml;ffentlicht. Der Nachfolger von Gloom 3 sieht auf diesen Screenshots
nicht viel besser aus. Gloom 3: The Director's Cut wird unter anderem ein
20 Minuten langes Full-Motion-Video-Intro, 80 Level, neue Zombies,
komplett neue Grafik und Sound bieten. Besitzer des entt&auml;uschenden Gloom 3
erhalten den Director's Cut zum halben Preis (wenn es &uuml;berhaupt jemand
haben will).
<P>
<A HREF="img/Gloom3TDC.png">Screenshot</A>
<P>
<H3>Operation: CounterStrike</H3>
<P>
Der Command & Conquer-Clone Operation: CounterStrike war vorher als
CounterStrike und Command Strike bekannt. Die Entwickler Blue Black
Solution haben eine Pr&auml;sentation des Spiels f&uuml;r eventuelle Publisher sowie
neue Screenshots ver&ouml;ffentlicht. Aufgrund ausf&uuml;hrlicher Intros und
Zwischensequenzen wird Operation: CounterStrike eventuell das erste
Multi-CD-Spiel f&uuml;r AMIGAs. Die Hintergrundgeschichte des Spiels dreht sich
um einen Konflikt zwischen Ru&szlig;land und Japan. Sprachausgabe, TCP/IP-Support
und ein Level-Editor werden ebenfalls geboten. Systemvoraussetzungen
werden ein 030-Prozessor, AGA oder CyberGFX, 4 MB Fast-RAM und ein 4x-CD-
ROM-Laufwerk sein. Wann das Spiel erscheint, steht noch nicht fest.
<P>
<A HREF="img/Op.CounterStrike.jpg">Screenshot</A>
<P>
<H3>neues Adventure: The Final Step</H3>
<P>
Das Entwicklungsteam TWK Productions programmiert derzeit ein Adventure
namens The Final Step. Es wird ein Grafik-Adventure im Monkey Island-Stil,
bietet jedoch gerenderte Hintergrundgrafiken. Die Charaktere sollen sowohl
aus gemalten Grafiken als auch aus digitalisierten Menschen aus der realen
Welt bestehen (?!?). Die Hintergrundstory dreht sich mal wieder um b&ouml;se
Au&szlig;erirdische, die das Universum dominieren (Kennen wir das nicht schon
aus 3 Fantastilliarden anderen Spielen, und haben wir nicht schon unz&auml;hlige
Male diese Au&szlig;eridischen besiegt, seltsam...). Mal sehen, was aus dem Spiel
wird.
<P>
<H3>Tennis Manager</H3>
<P>
</LI></UL>
Das in der letzten AGPJ-Ausgabe angek&uuml;ndigte Spiel Tennis Manager von New
Generation Software hat in der PC-Version extrem schlechte Wertungen
bekommen (z.B. PC Joker 17 %; Gamestar 16 %). Ob der AMIGA solche Spiele
braucht ???
<P>
<H3>68060-Kompatibilit&auml;tsliste</H3>
<P>
Dirk Wenk hat mich gebeten, auf seine Spiele-Kompatibilit&auml;tslste f&uuml;r
060-Prozessoren aufmerksam zu machen. Hier werden alle Spiele erfa&szlig;t,
die auf 060ern laufen. F&uuml;r Besitzer eines solchen Prozessors also eine
gute Sache. Zu erreichen ist die Liste hier: <A HREF="http://Wax.home.pages.de/">http://Wax.home.pages.de/</A>
<P>
<H3>Championship Manager 2-Patch?</H3>
<P>
Da Eidos keinen Bugfix f&uuml;r das fehlerbehaftete Spiel Championship Manager2
plant, wird scheinbar in nicht allzu ferner Zukunft ein inoffizieller
Patch im Aminet erscheinen.
<P>


<P ALIGN=RIGHT>
<A HREF="0803.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0805.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
