<HTML>
<HEAD><TITLE>
AMIGA ActionGamesPlayerJoker - von Jens Schr&ouml;der (jschroe@gwdg.de)
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0805.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0807.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA ActionGamesPlayerJoker - von Jens Schr&ouml;der (jschroe@gwdg.de)
</font>
</TD></tr>
</TABLE>


<P>

<H2>6. Previews</H2>

<H3>Moonbases (Verkosoft - erscheint im Sommer 1998)</H3>
<P>

Moonbases ist also der erste der unz&auml;hligen angek&uuml;ndigten Command &
Conquer-Clones, von dem eine Demoversion erschienen ist. Das Spiel wird
bei Verkosoft erscheinen, die ja nicht unbedingt f&uuml;r Spiele der Extraklasse
bekannt sind. Auch die Demoversion von Moonbases l&auml;&szlig;t auf kein
Spitzenprodukt schlie&szlig;en. Die Grafik des Spiels k&ouml;nnte auch einem C64
entsprungen sein, und die Optionen des Spiels sind sehr d&uuml;rftig.
Moonbases wird im Sommer bei Verkosoft erscheinen und setzt AGA, OS 3.0,
2 MB Chip-RAM und 1 MB Fast-RAM voraus. Alle Fans von Echtzeit-Kriegs-
Strategiespielen sollten lieber auf Titel wie Napalm warten.
<P>
<H3>Virtual Karting 2 (epic marketing - erh&auml;ltlich ab sofort)</H3>
<P>
Virtual Karting 2 ist der Nachfolger des umstrittenen Spiels Virtual
Karting, das einige Fans hatte, von einigen Leuten aber auch geha&szlig;t wurde.
Der Nachfolger bietet unter anderem 6 neue Tracks (etwas wenig) und l&auml;uft
auch auf nicht erweiterten Amiga 1200ern mit 50 Frames pro Sekunde. Die
3D-Engine bietet zum Beispiel Wasser-Reflektionen. Die ausw&auml;hlbaren Karts
haben 125ccm, bzw. 80ccm. Das unter anderem im Aminet erh&auml;ltliche Demo
l&auml;&szlig;t den Spieler f&uuml;r 3:30 Minuten einen der Tracks befahren.
Auf den ersten Blick f&auml;llt die br&ouml;ckelige Grafik auf, die auch schon im
ersten Teil zu "bewundern" war. Um auf unaufger&uuml;steten AMIGA 1200ern 50
Frames pro Sekunde zu erreichen, kann man nur zwischen 1x2 und 2x2-Pixel-
Modi w&auml;hlen. Ein 1x1-Modus fehlt ! Der im Demo enthaltene Track ist etwas
schwer, aber in der endg&uuml;ltigen Fassung wird es auch leichtere Tracks
geben. Auch der Sound ist eher mittelm&auml;&szlig;ig. In 90 Prozent der Zeit h&ouml;rt
man Reifenquietschen. Abgesehen von diesen technischen Schw&auml;chen erhalten
Fans von Rennspielen aber ein Spiel, das durchaus Spa&szlig; machen kann. Ob sich
ein Kauf auch f&uuml;r Besitzer des ersten Spiels lohnt, m&uuml;ssen diese selbst
wissen, da ich Virtual Karting nicht besitze und deswegen nicht beurteilen
kann, ob das Spiel verbessert wurde.
Virtual Karting 2 ist bereits auf Diskette und CD-ROM erschienen und setzt
AGA voraus.
<P>
<A HREF="img/VirtualKarting2.jpg">Screenshot</A>
<P>


<P ALIGN=RIGHT>
<A HREF="0805.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0807.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
