<HTML>
<HEAD><TITLE>
Interviews
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0901.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="1000.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Interviews
</font>
</TD></tr>
</TABLE>


<P>

<H2>2. Interview mit Felix Schwarz (von Andreas Etzrodt)</H2>


Andreas Etzrodt hat k&uuml;rzlich ein Interview mit Felix Schwarz, dem Autor
mehrerer bekannter AMIGA-Programme, darunter die beliebte
Konvertierungssoftware UltraConv, gef&uuml;hrt, in dem Felix auch seine
zuk&uuml;nftigen AMIGA-Pl&auml;ne erl&auml;utert:
<P>
»Erz&auml;hle uns doch einfach mal, wer Du bist, was Du tust, usw.
<P>
<FONT COLOR="#005555">Ich lebe in Herzogenaurach, einer kleinen Stadt in Franken in der N&auml;he von
Erlangen. Den Gro&szlig;teil meiner freien Zeit widme ich ganz dem AMIGA und der
Weiterentwicklung von Ultraconv und diversen anderen kleineren oder
gr&ouml;&szlig;eren Tools.</FONT>
<P>
Wie bist Du zum Amiga gekommen?
<P>
<FONT COLOR="#005555">Angefangen hat alles, wie bei vielen anderen, mit einem ZX Spectrum, der
aber bald zu unflexibel f&uuml;r meine Anforderungen wurde. Etwa zur gleichen
Zeit brachte Sinclair einen Computer mit 68000, den Sinclair QL auf den
Markt, also stieg auf diesen um. Als dann der Amiga kam, stand ich vor der
Wahl, einen PC oder Amiga zu kaufen. Die Wahl fiel mir angesichts der
vielen multimedialen F&auml;higkeiten des Amiga nicht schwer, und ich kaufte mir
einen Amiga 2000, auf dem ich kleinere Programme schrieb. Richtig
angefangen hat es mit der Programmentwicklung 1992, als ich mir einen Amiga
1200 anschaffte.</FONT>
<P>
> Welche Computer-Ausstattung besitzt Du im Moment?
<P>
<FONT COLOR="#005555">Im Moment entwickle ich auf einem Amiga 4000/060/50+PPC 604e/180 MHz+
54 MB RAM/7.7 GB HD/CyberVision 64/3D/VLab Classic/Oktagon 2008/
Buddha IDE-Controller/17" Monitor, vernetzt mit einem Amiga 1200/030/28
Mhz/6MB RAM/120 MB HD/14" Monitor, der aber meist nur zur zum Testen meiner
Programme unter verschiedenen Umgebungen und Bedingungen dient.</FONT>
<P>
Warum hast Du angefangen zu programmieren? Wie? Welche Sprache benutzt
Du?
<P>
<FONT COLOR="#005555">Ich habe angefangen zu programmieren, um Programme zu erhalten, die auf
meine Bed&uuml;rfnisse und Anforderungen, die manchmal sehr speziell waren/sind,
zugeschnitten sind, oder um so noch nicht existente Programme zu schaffen,
um ein Problem zu l&ouml;sen.
Als Programmiersprache habe ich auf dem ZX Spectrum mit Basic angefangen
und mich nun mittlerweile zu C hochgearbeitet.</FONT>
<P>
UltraConv ist wohl das interessanteste Programm von Dir. Aber bevor wir
dar&uuml;ber reden, erz&auml;hle uns doch etwas &uuml;ber Deine anderen Programme.
<P>
<FONT COLOR="#005555">Die bis jetzt ver&ouml;ffentlichten Programme sind AGM, ein Geb&uuml;hrenz&auml;hler, der
Statistiken zu allen m&ouml;glichen Bereichen bietet, eine ARexx-Schnittstelle
hat und Verbindungsanfang und -ende automatisch erkennt, wenn das Modem am
Amiga-eigenen Port h&auml;ngt, ANIM2GIFANIM, eine Oberfl&auml;che, um per Knopfdruck
IFF-ANIMationen in GIF-Animationen umzuwandeln, HTMLFIX, ein n&uuml;tzliches
Tool, das ganze HTML-Verzeichnisse durchsucht und die Dateinamen den Unix-
Konventionen anpa&szlig;t und gleichzeitig die Gr&ouml;&szlig;e der Bilder auf Wunsch
erg&auml;nzt, ANTCDF, ein wenig beachtetes Programm zum Durchsuchen von Aminet-
CD-Indizes, das auch mehrere Suchbegriffe zul&auml;&szlig;t, Modem-Display, ein
Programm, das die L&auml;mpchen des Modems auf dem Workbench-Screen graphisch
anzeigt, Transfer-Anim-View, das sog. Transfer-Animationen anzeigt, die in
den Browserfenstern verwendet werden und die nervige Installation und evtl.
Deinstallation wegfallen lassen, VLRec, es erlaubt, mit einer vlab.library-
unterst&uuml;tzten VLab-Karte Videos aufzunehmen, wozu keine VLab
Motion ben&ouml;tigt wird, PowerSearch, ein weiteres einfaches Suchprogramm f&uuml;r
Indizes mit PowerUP-Unterst&uuml;tzung, VGB PPC, ein PowerUP-Port des Virtual
GameBoy-Emulators, der Gameboy-Spiele in nie dagewesener Geschwindigkeit
abspielt, AMIgotchy, ein Tamagotchi-Clone mit Internet-Unterst&uuml;tzung und
gerenderten Zwischenanimationen, und demn&auml;chst wird auch noch LiveCam
verf&uuml;gbar sein, eine LiveCam, die &uuml;ber eine VLab-Karte realisiert ist und
es auf einfache Weise erlaubt, laufende Videos mit bis zu 1 f/s ins
Internet zu stellen.</FONT>
<P>
Kann man noch mit weiteren Programmen von Dir rechnen?
<P>
<FONT COLOR="#005555">Nat&uuml;rlich, ein kaufm&auml;nnisches Programm ist bereits in Planung und wird von
mir selbst f&uuml;r meine Registrationen bereits intensiv genutzt; je nach
Bedarf werde ich nat&uuml;rlich auch weiterhin neuartige Programme und
Portierungen von anderen Betriebssystemen schreiben, zudem denke ich z.Zt.
&uuml;ber eine CD mit dem Namen "Black Magic" nach, auf der dann alle meine
Programme zu finden sind, darunter auch jene, die sonst nicht zu haben
sind, wie etwa ein spezielles E-Mail-Programm oder ein Programm, mit dem
der Hintergrund einer 24-Bit-Workbench animiert werden kann.</FONT>
<P>
Wie kamst Du auf die Idee, ein Programm wie UltraConv zu schreiben, wo es
damals doch schon etliche andere Programme mit dem gleichen Sinn gab?
<P>
<FONT COLOR="#005555">Ich hatte keine Lust, mir MainActor zu kaufen, weil ich es f&uuml;r zu teuer
hielt (und nach wie vor halte) und vor dem Problem stand, etwa 2000 HAM8-
Dateien auf doppelte Gr&ouml;&szlig;e zu skalieren, was mit DPaint oder PPaint
schlichtweg nicht in vertretbarer Zeit m&ouml;glich gewesen w&auml;re.
Dann kamen immer mehr Features hinzu, und ich besorgte mir auch noch einen
Internet-Anschlu&szlig;, und Ultraconv wurde Shareware.</FONT>
<P>
Was war der Grund, weshalb Du UConv jetzt kommerziell vertreibst?
Schlechte Erfahrung mit der Zahlungsmoral der User?
<P>
<FONT COLOR="#005555">Nein, es haben sich bisher sehr viele User registriert, aber da die
PowerUP-Version nicht mehr auf 2 Disks gepa&szlig;t h&auml;tte, und wohl auch nicht
auf 3 Disks, w&auml;re der Aufwand zu gro&szlig; geworden. Auf so einer CD-ROM ist
nat&uuml;rlich viel mehr Platz, und einige &Uuml;berraschungen werden dort auch zu
finden sein - vor allem aber massig neue Features!</FONT>
<P>
Wann wird die n&auml;chste Version von UConv erscheinen? Wie bist Du zu RBM
gekommen?
<P>
<FONT COLOR="#005555">Voraussichtlich in der zweiten Juniwoche, also schon sehr bald. Ich habe
UConv mehreren
Anbietern angeboten und bin auf diesem Wege und auch &uuml;ber einen Bekannten
zu RBM gekommen.</FONT>
<P>
Welche Neuerungen kann man erwarten?
<P>
<FONT COLOR="#005555">Vor allem mehr Geschwindigkeit, aber auch ein neues Lade-/Speichermodul-
Konzept, Unterst&uuml;tzung f&uuml;r VLabs, ScanQuix, FLI-Lade- und -Speichermodule,
Realtime-Previews, bessere Grafikkarten-Unterst&uuml;tzung, Anim-Datatype-
Unterst&uuml;tzung, NewIcons-Lade- und Speichermodule, nat&uuml;rlich PowerUP-
Unterst&uuml;tzung, und einige weitere interessante Features, die offen bleiben
und die dann bei Ver&ouml;ffentlichung bekanntgegeben werden.</FONT>
<P>
Welche Features konntest Du aus Zeit-/Geldmangel nicht einbauen?
<P>
<FONT COLOR="#005555">Support f&uuml;r Intel-Indeo-AVIs, aber dieser wird evtl. schon bald &uuml;ber einen
kleinen Trick verf&uuml;gbar sein, hier will ich mich aber nicht festlegen. Die
ToDo-Liste ist noch lang genug und w&auml;chst stetig - es wird also noch einige
Zeit dauern, bis alle geplanten Features implementiert sein werden.</FONT>
<P>
Ist es Dir - Deiner Meinung nach - gelungen, Deine Ideen in UConvNG
einzubauen?
<P>
<FONT COLOR="#005555">Ja, aber an einigen Sachen wird nat&uuml;rlich noch gefeilt werden. Und dann
w&auml;re da noch die ToDo-Liste...</FONT>
<P>
Was ist der Vorteil von UltraConvNG gegen&uuml;ber z.B. SuperView?
Warum sollte man sich also ausgerechnet UltraConv kaufen?
<P>
<FONT COLOR="#005555">Ich will UConv an dieser Stelle nicht mit SuperView vergleichen oder
SuperView abwerten, sondern allgemeine Vorteile gegen&uuml;ber anderen
Konvertern &auml;u&szlig;ern. Da w&auml;re z.B. die Unterst&uuml;tzung sehr vieler Formate,
vor allem aber die gute Animationsunterst&uuml;tzung, die Vielfalt an
M&ouml;glichkeiten und vor allem der Anim-Publisher, der so wohl einzigartig
ist, denn er erlaubt das Zusammensetzen von bis zu 100 Animationen,
Bildern, Effektboxen, Lichteffekten und Feuereffekten mit animierten
Parametern, Transparenzeffekten und nat&uuml;rlich auch Gr&ouml;&szlig;en- und
Positions&auml;nderungen zu einer Gesamtanimation, die Animation im UConvDemo-
Archiv zeigt diese Vielfalt ansatzweise. Es lassen sich aber auch
sogenannte Anim F/X (engl. animierte Effekte) anwenden, die ihre Wirkung
&auml;ndern. UConv ist da sehr flexibel.</FONT>
<P>
Wird UltraConv auf einem PowerUp-Board sehr viel schneller sein? Kannst
Du uns etwas genauere Daten nennen?
<P>
<FONT COLOR="#005555">Ja, erheblich schneller als auf einem 68060, etwa um das 7-14fache
schneller auf einem 604e/180 MHz. So kann man etwa ein 800x600-Bild in
einer halben Sekunde als JPEG speichern oder ein 24Bit(16 Mio. Farben)-
640x480-Bild in 0,4 Sekunden auf 256 Farben herunterrechnen. Auch MPEG-
Filme kann man mit UConv und dem Board in wenigen Sekunden speichern. Ich
denke, da&szlig; diese Werte schon beeindruckend sind. Weitere Werte kann man
unter <A HREF="http://www.amigaworld.com/support/uconv/pupd.html">http://www.amigaworld.com/support/uconv/pupd.html</A> abrufen.</FONT>
<P>
Ist ein PowerUP-Amiga wirklich DIE L&ouml;sung f&uuml;r die Speed-Probleme am
Amiga?
Ich meine, wie war Dein erster Eindruck von der Turbokarte, w&auml;hrend Du an
UltraConvPPC gearbeitet hast? K&ouml;nnte man mit einem modernerem "Chassis"
merkbar mehr Power herausholen?
<P>
<FONT COLOR="#005555">Es g&auml;be bestimmt eine bessere L&ouml;sung, n&auml;mlich rein auf PPC-Basis, aber wenn
der Amiga eine Zukunftschance haben will, dann mu&szlig; der "PowerAMIGA" bald
kommen, und nicht erst 2010, wenn es keine Nachfrage mehr gibt! Die pre\box
geht da wohl in die richtige Richtung, und auch die Entscheidung von Amiga,
Inc., die 68K+PPC-L&ouml;sung als Standard zu definieren,
<I>[Anm.d.Red.: Das Interview wurde vor den j&uuml;ngsten Beschl&uuml;ssen von AMIGA,
Inc. gef&uuml;hrt.]</I>
war wohl richtig, denn als die Entscheidung fiel, waren bereits Programme
f&uuml;r diese L&ouml;sung verf&uuml;gbar, und auch ich h&auml;tte nicht noch einmal eine
solche Investition get&auml;tigt. Alles was noch fehlt, ist eine Entscheidung
zwischen PowerUP oder WarpOS, bzw. eine Verschmelzung, so da&szlig; Programme f&uuml;r
beide Entwicklungen GLEICHZEITIG laufen k&ouml;nnen. PowerUP scheint sich aber
bis jetzt klar herauszukristallisieren. Der erste Eindruck war eine
gewaltige Geschwindigkeitssteigerung, und jeder der die PPC-Version von
UConv sehen wird, wird mir zustimmen, selbst schnellere Pentiums mit
Ph*t*shop k&ouml;nnen da nicht mithalten, wie ein Test ergab.</FONT>
<P>
Welche PPC-Software benutzt Du, die ppc.library von Phase 5 oder das
WarpOS von Haage&Partner? Warum hast Du Dich gerade daf&uuml;r entschieden?
<P>
<FONT COLOR="#005555">Ich benutze die ppc.library von Phase 5, da diese sich wohl als Standard
durchsetzen wird - theoretisch ist aber die PPC-Version von UConv so
konzipiert, da&szlig; durch ein einfaches Recompile die
geschwindigkeitsintensiven Teile genausogut auf WarpOS laufen k&ouml;nnten -
aber vorerst wird es keine WarpOS-Version geben.</FONT>
<P>
Wie m&uuml;&szlig;te, Deiner Meinung nach, ein neuer Amiga ausger&uuml;stet sein, und
was sollte er kosten? So wie die angek&uuml;ndigte pre\box von Phase 5?
Glaubst Du, sie k&ouml;nnen die angegebenen Preise auch nur im entferntesten
realisieren?
<P>
<FONT COLOR="#005555">Die pre\box von Phase 5 geht klar in die richtige Richtung, was aber (mir)
noch fehlt, ist ein Video-Eingang, damit man sp&auml;ter auch Anwendungen wie
Videokonferenzen laufen lassen kann - ob da ein Treiber f&uuml;r eine
entsprechende PCI-Karte kommt, bleibt abzuwarten - daher sollte eine solche
Erweiterung erst gar nicht n&ouml;tig sein.
Auch w&uuml;rde ich eine Low-End-Variante mit 4 x 603e oder 2 x 604e sehr
begr&uuml;&szlig;en, denn nicht jeder kann sich eine 4000 Mark teure Maschine kaufen,
die noch nicht mal Harddisk und RAM hat. Ich werde die Entwicklung
jedenfalls unterst&uuml;tzen und evtl. n&ouml;tige Anpassungen vornehmen.</FONT>
<P>
Kennst Du die AMIGA aktuell? Was h&auml;ltst Du davon?
<P>
<FONT COLOR="#005555">Klar! Ich habe sie ja auch abonniert und bin sehr zufrieden mit der
Versorgung mit aktuellen News. Ich w&uuml;nsche der AMIGA aktuell an dieser
Stelle auch noch alles Gute f&uuml;r die Zukunft, und eine Version 3 von UConv
NG wird bei Erscheinen auch noch bei der AMIGA aktuell eintrudeln und zu
gewinnen sein.</FONT>
<P>
Vielen Dank f&uuml;r dieses ausf&uuml;hrliche Interview und viel Erfolg mit
UltraConvNG-PPC!«
<P>


<P ALIGN=RIGHT>
<A HREF="0901.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="1000.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
