<HTML>
<HEAD><TITLE>
AMIGA International, Inc. / AMIGA, Inc.
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="1100.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="1102.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA International, Inc. / AMIGA, Inc.
</font>
</TD></tr>
</TABLE>


<P>

<H2>1. AMIGA, Inc.: »KICKOFF THE FUTURE WITH AMIGA« - eine Chronik</H2>

<P>
In den letzten Wochen hat die AMIGA-Entwicklungsabteilung AMIGA, Inc. unter
der F&uuml;hrung von Jeff Schindler ihre AMIGA-Marschroute f&uuml;r die n&auml;chsten zwei
Jahre offengelegt. An dieser Stelle folgt eine chronologische Abhandlung
der wichtigsten Ereignisse, die aus gutem Grund nicht erst mit der World of
AMIGA, auf der die Entscheidungen bekanntgegeben wurden, beginnt, sondern
mit dem
<P>
<H3>2. Mai:</H3>
<P>
An diesem Tag fand eine IRC-Konferenz statt, an der wichtige AMIGA-
Pers&ouml;nlichkeiten (darunter Joe Torre, Fleecy Moss und Darreck Lisle von
AMIGA, Inc. sowie Olaf Barthel) teilnahmen. Auf dieser Online-Veranstaltung
wurde bekanntgegeben, da&szlig; Gateway 2000 die Gesch&auml;fts- und Entwicklungspl&auml;ne
von AMIGA, Inc. akzeptiert h&auml;tte, und auf der vom 15. bis 17. Mai in London
stattfindenden "World of AMIGA" sehr wichtige Ank&uuml;ndigungen gemacht w&uuml;rden.
<P>
<H3>5. Mai:</H3>
<P>
Darreck Lisle von AMIGA, Inc. k&uuml;ndigt f&uuml;r den ersten Tag der WoA eine
wichtige Bekanntmachung an.
<P>
<H3>11. Mai:</H3>
<P>
Die britischen Zeitschrift "Computer Trade Weekly" meldet, da&szlig; auf der
"World of AMIGA" ein neuer HighEnd-Computer mit AMIGA- UND PC-
Kompatibilit&auml;t angek&uuml;ndigt wird.
Der neue Rechner k&ouml;nnte demnach innerhalb von 18 Monaten fertiggestellt und
zu einem Preis von umgerechnet etwa 1500 bis 2100 Mark angeboten werden. Er
soll eine offene Architektur und ein enorm verbessertes Betriebssystem
aufweisen.
Ein erstes Modell soll bereits auf der World of AMIGA gezeigt werden, die
Pr&auml;sentation einer funktionst&uuml;chtigen Version sei f&uuml;r die "Computer '98",
die im November dieses Jahres in K&ouml;ln stattfindet, geplant.
<P>
<H3>15. Mai:</H3>
<P>
Um 21.00 Uhr MESZ, drei Stunden fr&uuml;her als zun&auml;chst angek&uuml;ndigt, aktiviert
AMIGA, Inc. seine neue WWW-Homepage <A HREF="http://www.amigainc.com">http://www.amigainc.com</A> (mittlerweile
ist das Unternehmen zus&auml;tzlich auch &uuml;ber <A HREF="http://www.amiga.com">http://www.amiga.com</A> erreichbar).
<P>
Gleichzeitig wird die lang erwartete Bekanntmachung bez&uuml;glich der AMIGA-
Zukunft ver&ouml;ffentlicht. Es folgt die deutsche &Uuml;bersetzung:
<P>
»ZUR SOFORTIGEN VER&Ouml;FFENTLICHUNG
<P>
Amiga Inc. meldet  "KICKOFF THE FUTURE WITH AMIGA®"
("VORSTOSS IN DIE ZUKUNFT MIT AMIGA®")
<P>
Die strategische Ausrichtung und die Pl&auml;ne f&uuml;r die Zukunft enthalten neue
Software-Technologie, System-Verf&uuml;gbarkeit und eine Internet-Adresse
(Web Site).
<P>
London, UK, 15. Mai 1998
Amiga Inc., ein Pionier der Multimedia-Entwicklung, gab heute Pl&auml;ne &uuml;ber
eine neue Software-Architektur bekannt, die der Amiga-Gemeinde gesteigerte
Leistungs- und Anwendungs-Niveaus bieten wird. Amiga wird eine Software-
Technologie entwickeln und lizensieren, die herausragende Multimedia-
L&ouml;sungen f&uuml;r den entstehenden konzentrierten digitalen Markt bieten wird.
<P>
"Amiga hat durch die Festlegung der zu befolgenden Standards die
Gelegenheit, an die Spitze der Industrie zu kommen", sagt Jeff Schindler,
General-Manager von Amiga, Inc. "Durch enge Zusammenarbeit mit Amiga-
Entwicklern und Anwendergruppen haben wir alle die M&ouml;glichkeit, an diesem
aufregenden, wachsenden Markt teilzunehmen."
<P>
Um auf Amigas Anspruch als Multimedia-F&uuml;hrer aufzubauen, k&uuml;ndigte die
Gesellschaft das OS 4.0 an, dessen Freigabe f&uuml;r den November 98 vorgesehen
ist. Amiga OS 4.0 wird eine neues Anwender-Schnittstelle erhalten und die
bisherige Software mit einem integrierten Emulator unterst&uuml;tzen. Hardware-
Entwickler arbeiten bereits an L&ouml;sungen f&uuml;r die Software und die Hardware-
R&uuml;ckw&auml;rts-Kompatibilit&auml;t mit der neuen Amiga-Architektur.
<P>
Amiga, Inc. gab auch Pl&auml;ne bekannt, einen Personal-Computer im Industrie-
Standard vorzustellen. Das neue System wird &uuml;ber eine Br&uuml;cke zur n&auml;chsten
Generation der Amiga-Technologie verf&uuml;gen. Das System wird voraussichtlich
im November erh&auml;ltlich sein, der vorgesehene Verkaufspreis soll US$999
betragen. Diese Ger&auml;te werden durch Amiga International vertrieben werden.
<P>
In naher Zukunft wird Amiga, Inc. auch die Web-Adresse www.amiga.com als
offizielle Nachrichtenquelle f&uuml;r Entwickler-Mitteilungen, Informationen
und sonstige Verbindungen betreuen. Die Web-Adresse www.amiga.de von
Amiga International wird weiterhin der Platz f&uuml;r Amiga-Vertrieb, f&uuml;r
den Vertrieb von eigenen Produkten und die Lizensierung sein.
<P>
&Uuml;ber Amiga
<P>
Amiga, Inc., ist eine Technologie-Gesellschaft, die auf die n&auml;chste
Generation von Anwender-Betriebssystemen hinzielt mit st&auml;ndigem Blick
auf Multimedia. Seit der Einf&uuml;hrung des Amiga A1000 im Jahre 1985 hat
Amiga w&auml;hrend seiner Pionierleistungen bei der industriellen Entwicklung
im Bereich der Multimedia, des 32-Bit-Multitasking und der
Autokonfiguration die Verk&ouml;rperung des wirkungsvollen Einsatzes von
Speicher- und Festplatten-Kapazit&auml;ten dargestellt. Amiga f&uuml;hrte die
Industrie in die Verbindung von Computer-Grafiken, Animation und
Filmsequenzen mit Stereo-Ton, was heute als Multimedia bekannt ist.
<P>
MEDIEN-KONTAKT:<BR>
Bill McEwen<BR>
Amiga Incorporated<BR>
<A HREF="mailto:billm@amigainc.com">billm@amigainc.com</A><BR>
<A HREF="http://www.amigainc.com">http://www.amigainc.com</A>
<P>
Amiga, the Amiga logo, and Amiga OS are trademarks of Amiga, Inc. All other
trademarks are the property of their respective owners.
<P>
Amiga, das Amiga-Logo und Amiga OS sind Warenzeichen von Amiga, Inc. Alle
&uuml;brigen Warenzeichen sind Eigentum den jeweiligen Besitzer.
<P>
© 1998 Amiga, Inc.«
<P>
Die &Uuml;bersetzung stammt von Gernod Schomberg.
(Quelle des Originals: AMIGA, Inc.)
<P>
Des weiteren d&uuml;rften die Biographien der Angestellten von AMIGA, Inc. von
Interesse sein. Auch hier folgt eine deutschsprachige &Uuml;bersetzung:
<P>
»Nehmen Sie mit uns Verbindung auf!
<P>
600 N. Derby Lane<BR>
P.O. Box 1841<BR>
N. Sioux City, SD 57049 USA<BR>
888-25-AMIGA<BR>
605-232-6442<BR>
605-235-1002 FAX<BR>
<A HREF="mailto:general@amigainc.com">general@amigainc.com</A> (e-mail)
<P>
Mitarbeiter von Amiga, Inc.
<P>
Jeff Schindler, Managing Director<BR>
Marilyn Flint, Director of Operations<BR>
Joe Torre, Senior Hardware Engineer<BR>
Bill McEwen, Director of Marketing<BR>
Derrick Lisle, Events Coordinator<BR>
Kelli Newby, Administration<BR>
Allan Havemose, Senior Software Engineer<BR>
Fleecy Moss, Project Management<BR>
<P>
<B>Joe Torre, Senior Hardware Engineer</B>
<P>
Joe Torre war ein K&auml;mpfer f&uuml;r den Amiga in vorderster Front seit Stunde
Null, 1985. Als geschickter Hardware-Ingenieur besteht Joe heute noch
darauf, seine Prototypen eigenh&auml;ndig zusammenzubauen, anstatt diese Dinge
den Techies zu &uuml;berlassen. Mit klarem Wissen &uuml;ber Amigas Geschichte ist
er einmalig qualifiziert, dessen Zukunft zu dienen. Als Mitbegr&uuml;nder und
ehemaliger Pr&auml;sident der Amiga Atlanta User Group war Joe seit 1985 st&auml;ndig
in der Amiga-Hardware-Entwicklung t&auml;tig. Ehe er zu Amiga, Inc., kam, war
er als Ingenieur bei Scientific-Atlanta, einem f&uuml;hrenden IT-Produkte-
Entwickler und Hersteller. Seine breite Erfahrung umfa&szlig;t auch
ingenieurm&auml;&szlig;ige Forschungs- und Entwicklungs-Arbeit bei BellSouth
Telecommunications, Colorgraphic Communications und die Entwicklung von
Video-Spielen bei Health-Science Media. Er war ein erkl&auml;rter "rocket
scientist" (Raketen-Wissenschaftler) in seinen Vor-Amiga-Tagen bei der
Missile Systems Division von Rockwell International. Joe Torre war ein
Champion als Fahrer bei Motorad-Stra&szlig;enrennen; heute macht er weiter als
anerkannter Champion des Amiga.
<P>
<B>Dr. Allan Havemose, Software Development</B>
<P>
Dr. Havemose erhielt seinen Grad als Master of Science und Ph.D (Doktor
der Philosophie) vom Institut f&uuml;r Mathematik an der Technischen Universit&auml;t
von D&auml;nemark. In die Erfahrungen von Dr. Havemose mit dem Amiga gehen die
Gr&uuml;ndung einer Firma "COMPAL" ein, er war Amiga Technical Support Manager
f&uuml;r Commodore ESCO in Frankfurt, Deutschland und Manager der Amiga-
Softwareentwicklung f&uuml;r Commodore International Services Corporation.
1994 schlo&szlig; er sich der Digital Sound Corporation als Vizepr&auml;sident
f&uuml;r Ingenieurtechnik an. Das Jahr 1996 sah Dr. Havemose bei ARK Logic
(eine Gesellschaft von ICS). Er wurde zum Pr&auml;sidenten und CEO ernannt, um
den Umschwung der mit Schwierigkeiten k&auml;mpfenden Gesellschaft f&uuml;r Computer-
Graphik zu schaffen. 1997 stieg er auf in die Gesellschaftsverwaltung von
ICS als Vize-Pr&auml;sident f&uuml;r strategische Planung. 1998 gr&uuml;ndete Dr.
Halvemose die Gesellschaft Viking Analytics. Viking Analytics ist eine
Gesellschaft zur Forschung und Entwicklung f&uuml;r Modelle im Computerhandel
bei Geld-, Aktien- und Warenm&auml;rkten. Dr. Havemose erhielt 1991 gemeinsam
mit J. Justeson, K. Larsen, T. Hoholdt und H.E.Jensen den IEEE Information
Theory Society Prize Paper Award. Er ist auch Inhaber des Patents f&uuml;r
"Cross-interleaved error correcting encoded data" (Kreuzverkoppelte
fehlerkorrigierende codierte Daten). Zur Zeit freut sich Dr. Havemose &uuml;ber
die Sonne in Kalifornien, denn er lebt in San Jose.
<P>
<B>Kelli Newby, Administration Assistent/Bookkeeper</B>
<P>
Kelli Newby schlo&szlig; sich im September 97 Amiga, Inc. als Buchhalterin und
Verwaltungsassistentin an. Ehe sie zu Amiga, Inc. kam, war Kellis gr&ouml;&szlig;te
N&auml;herung an den Amiga der Commodore 64. Seither ist sie vollkommen aus dem
H&auml;uschen &uuml;ber Amiga, und wohin sein Weg f&uuml;hren kann und wird! Sie ist ein
gro&szlig;artiger Cheerleader und sieht in rot und wei&szlig; fabelhaft aus! Kelli lebt
mit ihren drei pr&auml;chtigen, engelsgleichen Kindern in Iowa.
<P>
<B>Darreck Lisle, Usergroup and Events Coordinator</B>
<P>
Darreck Lisle wurde Mitglied der Amiga-Gemeinschaft im Herbst 1987, w&auml;hrend
er als Unteroffizier der Fallschirmj&auml;ger der US-Armee in Darmstadt in
Deutschland stationiert war. Er kaufte seinen ersten Amiga 500 mit 1084S-
Monitor im Post Exchange (Standort-Warenhaus). &Uuml;ber die Jahre besa&szlig; und
verwendete Darreck nahezu jedes Amiga-Modell. Darrecks lebenslanger Traum
war es, ein Polizeibeamter zu sein und einen Wissenschaftsgrad bei der
Polizei zu erhalten. Als er feststellte, da&szlig; Gateway Amiga gekauft hatte
und sich seine Erfahrungen bei der Siouxland Metro User Group ebenso wie
seine Amiga-Kenntnisse zu Nutze machen wollte, konnte er diese Gelegenheit
einfach nicht vor&uuml;bergehen lassen! Darreck wurde in der Gegend des
Siouxlands geboren und wuchs auch dort auf. Er lebt jetzt mit seiner Frau
und seinen beiden jungen S&ouml;hnen in Iowa.
<P>
<B>Fleecy Moss, Projekt Management</B>
<P>
Fleecy Moss bringt Amiga, Inc. eine einzigartige Perspektive mit seinem
Blick in die Zukunft des Amiga. Er ist ein dynamischer, offener Denker
mit Erfahrungen im Projekt-Management und im System-Entwurf. Fleecy geh&ouml;rt
zum Steuerungskommitee des ICOA. Er graduierte 1989 an der Keely-
Universit&auml;t mit einem Ehren-Grad in Computer-Wissenschaft und Psychologie.
Derzeit leben Fleecy und seine entz&uuml;ckende Frau mit ihren zwei wunderbaren
Jungen in Pennsylvania. Sein Ehrgeiz ist es, endlich "Cannon Fodder"
(Kanonenfutter) fertigzuspielen (seit vier Jahren, und immer noch probiert
er es!)
<P>
<B>Marilyn Flint, Operations Manager</B>
<P>
Marilyn arbeitete 7 Jahre bei Adobe Systems, Inc. Sie war Erster Manager
bei Adobe Systems Customer Support (Kundenunterst&uuml;tzung) und Inside Sales
Organization (Interne Verkauforganisation). Sie baute diese Abteilungen bei
Adobe von einer kleinen Gruppe von 12 Personen aus zu 5 strategischen
Kundenbetreuungseinheiten mit zeitweise &uuml;ber 120 Mitarbeitern, die die
Kundenw&uuml;nsche quer &uuml;ber die Abteilungen hinweg bearbeiteten und dadurch
deutlich die Verkaufserl&ouml;se der Gesellschaft steigerten. Seit damals ist
Marilyn unabh&auml;ngige Unternehmerin, die hochtechnologischen Firmen in ihren
Anf&auml;ngen ber&auml;t, damit sie festen Boden unter die F&uuml;&szlig;e bekommen. Marilyn
begann im Juli 1997 ihre Zusammenarbeit mit Amiga, Inc. und unterschrieb
als Mitarbeiterin in diesem Jahr.
<P>
Sie best&auml;tigte ihre Zuneigung zum Amiga dadurch, da&szlig; sie ihr Haus in der
Gegend von Seattle, Washington, verkaufte, um sich in N. Sioux City, South
Dakota, niederzulassen (Also das nennt man Hingabe! ;-) Marilyn besuchte
die Schulen UC Davis, Sacramento City College und Long Beach State
University. Sie hat die Abschl&uuml;sse Psychologie als Hauptfach und Kriminal-
Recht als Nebenfach.
<P>
<B>Jeff Schindler, General Manager</B>
<P>
Jeff Schindler wurde auf direkten Wunsch von Ted Waitt hin Mitte 1997
General-Manager von Amiga, Inc. Schindler hat viele produktive Jahre bei
Gateway 2000 in der Abteilung f&uuml;r tragbare Ger&auml;te zugebracht und wurde auch
wohlbekannt f&uuml;r die Leitung der Entwicklung von Destination, dem ersten TV-
PC, einem Ger&auml;t, welches den Personal-Computer und Fernsehen in einem Ger&auml;t
vereinigt.
<P>
Jeff nahm an den wichtigsten Amiga-Verkaufsmessen teil und spricht auch auf
Entwickler-Konferenzen und Amiga-Ausstellungen. Jeff ist auch
verantwortlich f&uuml;r die Entwicklung der Gesch&auml;ftsstrategien und die
technologische F&uuml;hrung von Amiga, Inc. Er wohnt mit seiner Frau in der
N&auml;he der Amiga-Hauptverwaltung.
<P>
<B>Bill McEwen, Sales & Marketing</B>
<P>
Bill McEwen hat eine &uuml;ber zw&ouml;lfj&auml;hrige Erfahrung im Bereich Verkauf und
Marktforschung, zuletzt bei Atrieva Corporation. &Uuml;ber die Jahre hat er f&uuml;r
mehrere Software-Gesellschaften gearbeitet, darunter auch ConnectSoft,
Inc., genSoft Development Corporation und Bumblebee Software. Seine
tiefgreifenden Erfahrungen in Verkauf, Vermarktung und PR schlie&szlig;en neben
den US auch Europa und internationale OEM-Verk&auml;ufe und Lizensierungen mit
ein. Bill organisierte die Verleihung mehrerer Magazin-Anerkennungspreise
und die "Best of Show" auf der Comdex im Herbst 1994. Er lebt mit seiner
Frau und seinem noch jungen Sohn in Ravensdale, Washington.
<P>
© 1998 Amiga, Inc.«
<P>
Die &Uuml;bersetzung stammt von Gernod Schomberg.<BR>
(Quelle des Originals: AMIGA, Inc.)
<P>
Noch am selben Tag beginnen in Newsgroups, Gespr&auml;chsforen und IRC-Kan&auml;len
heftige Diskussionen &uuml;ber die von der AMIGA-Entwicklungsabteilung
ver&ouml;ffentlichten Beschl&uuml;sse. Die &uuml;berwiegende Mehrheit der sich zu Wort
meldenden AMIGA-Anwender steht diesen negativ gegen&uuml;ber. Mit dazu
beigetragen haben d&uuml;rften auch &Auml;u&szlig;erungen von Mitarbeitern der
Entwicklungsabteilung, wonach Intel-Technologie in dem neuen Rechner
Verwendung finden soll.
Dies wird jedoch sp&auml;ter korrigiert: Festgelegt worden sei lediglich die
Nutzung von Standard-PC-Komponenten, jedoch noch nicht, welche Hersteller
hier zum Zug kommen werden.
<P>
<H3>16. bis 18. Mai:</H3>
<P>
Mittlerweile wird, bewirkt durch &ouml;ffentliche &Auml;u&szlig;erungen von AMIGA-
Mitarbeitern und anderen wichtigen Personen, immer klarer, da&szlig; der in der
offiziellen Bekanntmachung von AMIGA, Inc. angek&uuml;ndigte Rechner lediglich
eine Zwischenl&ouml;sung darstellen wird. Bei dem Ger&auml;t soll es sich im
wesentlichen um einen normalen Standard-PC handeln, der jedoch mit einer
PCI-basierenden "AMIGA auf einer Karte" aufger&uuml;stet sein wird, und der bei
den heutigen 68k-Programmen eine h&ouml;here Geschwindigkeit erreichen soll als
mit den bisherigen AMIGA-Modellen. (Mittlerweile wurde bekannt, da&szlig; es sich
um den geplanten Rechner "Inside Out" von Index Information handeln wird,
m&ouml;glicherweise leicht modifiziert, inklusive einer neuen Version der
"Siamese"-Software.)
Die Schaffung einer solchen Zwischen-Generation ist nach offizieller
Darstellung deshalb n&ouml;tig, weil Software-Simulatoren und -Compiler f&uuml;r den
in Entwicklung befindlichen und 1999 zur Verwendung kommenden neuen
Prozessor- und Multimedia-Chipsatz (s.u.) lediglich f&uuml;r Standard-PCs
verf&uuml;gbar seien.
Dieser "Br&uuml;cken-AMIGA" soll &uuml;ber ein AMIGA OS 4.0 verf&uuml;gen, das
abw&auml;rtskompatibel zur heutigen 68k-Software sein soll. Der
Betriebssystemkern soll von einem Dritthersteller entwickelt werden. Als
Basis k&ouml;nnten _beispielsweise_ BeOS, Linux oder Java in Frage kommen.
Dieses Ger&auml;t ist in erster Linie f&uuml;r Entwickler gedacht, die bereits im
Vorfeld Software (insbesondere das neue Betriebssystem, s.u.) f&uuml;r eine f&uuml;r
1999 geplante neue, weder Software- noch Hardware-kompatible AMIGA-
Generation schreiben wollen. An das im Br&uuml;cken-System zum Einsatz kommende
AMIGA OS 4.0 sollte man somit keine hohen Erwartungen betreffs Stabilit&auml;t
und Umfang stellen.
Noch einmal zur Klarstellung, damit es ganz deutlich wird: Einziger Sinn
und Zweck des Br&uuml;cken-AMIGAs ist die Bereitstellung eines Rechners, um f&uuml;r
die darauffolgende AMIGA-Generation Softwasre zu entwickeln.
<P>
Der eigentliche "NextGeneration"-AMIGA soll &uuml;ber einen vollkommen neuen
Prozessor verf&uuml;gen, dessen Entwicklung selbst erst voraussichtlich Anfang
1999 abgeschlossen sein wird. (Zur Information: Dieser Prozessor wird weder
von AMIGA, Inc. oder in Auftrag der AMIGA-Entwicklungsabteilung
hergestellt, noch wird er exklusiv in AMIGA-Rechnern zum Einsatz kommen.
Durch die Kontakte zum Mutterkonzern Gateway sei man auf die CPU-
Neuentwicklung aufmerksam geworden.)
Nachfolgend einige von AMIGA-Mitarbeitern genannte Leistungsdaten dieser
Multimedia-Grafik-Architektur, f&uuml;r die bislang kein offizieller Name
existiert:
<UL><LI>
   f&uuml;nf- bis zehnmal so schnell wie ein heutiger PentiumII
</LI><LI>
   es sollen sich sehr einfach weitere (Multimedia-) Features implementieren
lassen, ohne da&szlig; aufwendige Design&auml;nderungen zu erwarten sind (eine Art
"direkte Programmierbarkeit")
</LI><LI>
   sehr schneller Speicherzugriff
</LI><LI>
   Verarbeitung von 400 Millionen Pixeln 3D-Daten pro Sekunde
</LI><LI>
   beispielsweise Abspielen mehrerer MPEG-II-Animation gleichzeitig in
Echtzeit
<P>
</LI></UL>
Zwar sind weitere Daten noch nicht bekannt, es soll sich jedoch _nicht_ um
eine der folgenden CPUs handeln: PentiumII, Merced, PowerPC, Alpha,
UltraSPARC, MIPS.
Bei dem Hersteller soll es sich um ein mittelgro&szlig;es, recht bekanntes
Unternehmen handeln, das jedoch bislang noch nicht als Prozessor-Entwickler
in Erscheinung getreten ist.
<P>
Angeblich soll ein LowEnd-Computersystem mit diesem Chipsatz bereits f&uuml;r
etwa 500 US-Dollar erh&auml;ltlich sein, Rechner mit der Leistung von SGI-
Workstations sollen deutlich g&uuml;nstiger angeboten werden k&ouml;nnen als
heutzutage.
<P>
Das AMIGA OS 5.0, das bei dieser Generation zur Verwendung kommen soll,
wird Hardware-unabh&auml;ngig, jedoch _nicht_ kompatibel zur heutigen AMIGA-
Software sein. Zwar wird es wohl eine Art von 68k-Emulation geben, jedoch
handelt es sich faktisch um ein v&ouml;llig neues Computersystem, das mit dem
heutigen AMIGA (und erst recht mit dem von 1985) technisch so gut wie
nichts mehr zu tun hat.
<P>
<B>Fazit:</B><BR>
Wie ich im Editorial bereits andeutete, mu&szlig; die Art und Weise der
Bekanntgabe der Entscheidungen von AMIGA, Inc. als geradezu dilettantisch
bezeichnet werden: Da wird eine Presseerkl&auml;rung herausgegeben, in der von
einem neuen AMIGA, der auf dem Industriestandard basiert, die Rede ist.
V&ouml;llig verschwiegen wird jedoch, da&szlig; dieses System lediglich einen sehr
kurzen Zeitraum, n&auml;mlich etwa ein Jahr, &uuml;berbr&uuml;cken und nur f&uuml;r Entwickler
geschaffen werden soll. H&auml;tte man nicht die &auml;u&szlig;erst wichtige Information
weggelassen, da&szlig; der eigentliche AMIGA der n&auml;chsten Generation &uuml;ber eine
vollkommen andere, neue Hardware-Architektur verf&uuml;gt, w&auml;re es mit gr&ouml;&szlig;ter
Wahrscheinlichkeit nicht zu den Totenges&auml;ngen f&uuml;r den AMIGA, Beschimpfungen
auf AMIGA, Inc., etc. gekommen, zu denen sich nach der Ver&ouml;ffentlichung der
obigen Presseerkl&auml;rung eine Reihe von Anwendern gen&ouml;tigt sahen, man konnte
es ihnen nicht ver&uuml;beln.
AMIGA, Inc. h&auml;tte wissen m&uuml;ssen, da&szlig; die (scheinbare) Hinwendung zum
Industriestandard und zu Intel, das bei vielen Anwendern eine &auml;hnlich
"hohe" Popularit&auml;t genie&szlig;t wie Microsoft, ein Erdbeben ausl&ouml;sen w&uuml;rde. Dies
ist Mitte Mai ja auch geschehen - nur v&ouml;llig unbegr&uuml;ndet, AMIGA, Inc. sei
Dank.
<P>
Bei genauerer Betrachtung des gesamten Informationsmaterials, das den
Anwendern mittlerweile zur Verf&uuml;gung steht, kann das Motto in Richtung
anderer Minderheiten-Computersysteme, als bekanntestes sei ausdr&uuml;cklich der
PowerMac von Apple genannt, wohl nur lauten: "Zieht euch warm an! Wir
kommen wieder!". Sollte die neue Prozessor- und Multimedia-Architektur auch
nur ann&auml;hernd das halten, was den Anwendern versprochen wird, dann k&ouml;nnte
damit eine wahre "H&ouml;llenmaschine" geschaffen werden, die heutigen und
selbst zuk&uuml;nftigen Prozessoren, hei&szlig;en sie nun PowerPC, PentiumII oder
Merced, geh&ouml;rig das F&uuml;rchten beibringen w&uuml;rde. Wenn die f&uuml;r m&ouml;glich
gehaltenen Verkaufspreise, beispielsweise 500 US-Dollar f&uuml;r ein "LowEnd"-
System (das unter heutigen Ma&szlig;st&auml;ben wohl eher unter den Begriff "HighEnd"
fallen w&uuml;rde), auch noch verwirklicht werden k&ouml;nnten, w&uuml;rde dies sogar auf
die Wintel-Welt einen ungeheuren Druck aus&uuml;ben.
<P>
Einen kleinen Haken hat die ganze Sache allerdings doch: Wird die
technische Durchf&uuml;hrung der Entwicklung wirklich so unkompliziert und rasch
vonstatten gehen, wie es sich die Mitarbeiter von AMIGA, Inc. erhoffen?
Das kann wohl nur die Zukunft zeigen, die mit einem Mal gar nicht mehr so
d&uuml;ster aussieht...
<P>
Und was haltet Ihr von den Pl&auml;nen der AMIGA-Entwicklungsabteilung? Schreibt
uns Eure Meinung! E-Mail: <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>
<P>


<P ALIGN=RIGHT>
<A HREF="1100.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="1102.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
