<HTML>
<HEAD><TITLE>
Diverse Neuigkeiten
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="1400.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="1402.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Diverse Neuigkeiten
</font>
</TD></tr>
</TABLE>


<P>

<H2>1. Opera wird f&uuml;r AMIGA entwickelt</H2>

<P>
Die Entscheidung ist gefallen: Es wird eine AMIGA-Version des WWW-Browsers
Opera geben. Im einzelnen informieren die beiden folgenden Bekanntmachungen
von Opera Software:
<P>
»13. Mai 1998
<P>
Opera Software k&uuml;ndigt die Entwicklung einer Amiga-Version an --
Als Folge der au&szlig;erordentlichen Reaktion auf seine Initiative "Project
Magic" k&uuml;ndigt Opera Software AS heute die Entwicklung einer Amiga-Version
seines beliebten Browsers an. Die Entwicklung wird die in Reading, UK,
angesiedelte Ramjam Consultants Ltd. unter der Leitung von Tim Corringham
durchf&uuml;hren.
<P>
"Wir freuen uns, bei der &Uuml;bertragung von Opera auf den Amiga dabeizusein.
Opera besitzt ein Amiga-'Feeling' selbst unter Windows 95, ich habe also
volles Vertrauen, da&szlig; daraus eine hochwertige Amiga-Anwendung wird und
es einen Grad an Gemeinsamkeiten mit Windows 95 bieten wird, die wenige
Anwendungsprogramme erreichen", sagt Corringham.
<P>
"Ich bin selbst seit langer Zeit ein Amiga-Anwender, und es macht mir
gro&szlig;e Freude, offiziell die Entwicklung von Opera f&uuml;r die Amiga-Plattform
ank&uuml;ndigen zu k&ouml;nnen", f&uuml;gt der Business Director von Opera Software, Jon
von Tetzchner hinzu. "Es war eines unserer Ziele, Opera so vielen Internet-
Anwendern wie m&ouml;glich zur Verf&uuml;gung zu stellen, und die M&ouml;glichkeit, eine
Amiga-Version anzubieten, erh&ouml;ht nicht nur die Glaubw&uuml;rdigkeit f&uuml;r Opera
als ein leistungsf&auml;higes und Anwender-freundliches Programm, sondern es
ist auch ein Anschub f&uuml;r die Amiga-Plattform."
<P>
"Dieser Schritt ist nur die logische Folge von Project Magic, wo seit
seinem Beginn einige Tausende Anwender ihre Unterst&uuml;tzung f&uuml;r Opera auf
anderen Plattformen als MS Windows anboten. Die Amiga-Gemeinschaft ist in
voller St&auml;rke angetreten, und wir sind stolz, schon bald ein Produkt
anbieten zu k&ouml;nnen, das so fortschrittlich, leistungsf&auml;hig und gen&uuml;gsam ist
wie das Betriebssystem, auf dem es laufen wird", erkl&auml;rt Helmar Rudolph,
Initiator und Betreuer von Project Magic f&uuml;r Opera Software.
<P>
Beide Gesellschaften streben ein Erscheinungsdatum im Dezember 98 an,
gerade rechtzeitig f&uuml;r die Zeit der Weihnachtseink&auml;ufe, um den vielen
loyalen und nicht kleinzukriegenden Amiga-Anh&auml;ngern eine Quelle der Freude
und Genugtuung zu bieten.
<P>
Opera f&uuml;r den Amiga soll das gleiche Ma&szlig; an Funktionalit&auml;t wie sein
Windows-Gegenspieler bieten und ihn damit in die Spitzengruppe der Browser
f&uuml;r die Amiga-Plattform bringen.
<P>
Der Preis f&uuml;r diese Version ist noch nicht festgelegt, es wird aber
erwartet, da&szlig; er auf gleicher Linie mit der Windows-Version liegen wird.«
<P>
»13. Mai 1998
<P>
Opera Software k&uuml;ndigt Entwicklung einer Amiga Version an -- Nach langen
Verhandlungen ist es uns eine Freude, die Entwicklung von Opera f&uuml;r den
Amiga anzukuendigen. Die Entwicklung wird in Reading, England, von Ramjam
Consultants Ltd. under der Leitung von Tim Corringham vonstatten gehen, und
wir hoffen, da&szlig; wir bis Weihnachten damit fertig sind.
<P>
Einige Insider-Informationen von Tim:
<P>
<UL><LI>
   die erste Amiga-Version wird f&uuml;r die bestehenden Amiga-Modelle
mit Workbench 3.1 und mindestens 4 MByte RAM geeignet sein
<P>
</LI><LI>
   die erste Version soll die Features bestehender Amiga-Browser bieten
<P>
</LI><LI>
   PPC-Version wird folgen - auch sobald wie m&ouml;glich f&uuml;r neue
Amigas (was auch immer am Wochenende vom 15.-17. Mai von Amiga, Inc.
angek&uuml;ndigt wird)
<P>
</LI><LI>
   es werden so viele Opera-Features wie m&ouml;glich integriert, und Amiga-
spezifische Eigenschaften (z.B. ARexx-Port) kommen hinzu
<P>
</LI><LI>
   Amiga Opera wird eine gro&szlig;e Anzahl verschiedener Sprachen unterst&uuml;tzen
<P>
</LI><LI>
   Opera bietet das "Gef&uuml;hl" einer Amiga-Anwendung selbst auf einem PC,
wir sind also sicher, da&szlig; eine herausragende Amiga-Applikation entstehen
wird
<P>
</LI><LI>
   Opera ist st&auml;ndig in Bewegung, aber unser Ziel ist es, sobald wie
m&ouml;glich die neuen Features der W95-Version zu &uuml;bernehmen
<P>
</LI><LI>
   Der Amiga steht vor seiner "Wiedergeburt" mit breiterer Unterst&uuml;tzung
durch die Industrie, als er sie seit vielen Jahren erfahren hatte. Mit
neuer Hardware und neuer Software - inklusive Amiga Opera - wird
er als lebenskr&auml;ftige Alternative zu Wintel-Maschinen besser dastehen
als je zuvor!
<P>
</LI></UL>
So, dann freut Euch mal alle schon, und spart bis Weihnachten! :-)«
<P>


<P ALIGN=RIGHT>
<A HREF="1400.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="1402.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
