<HTML>
<HEAD><TITLE>
Diverse Neuigkeiten
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="1406.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="1408.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Diverse Neuigkeiten
</font>
</TD></tr>
</TABLE>


<P>

<H2>7. Produktvorstellung: EasyWriter</H2>

<P>
»EasyWriter
<P>
<B>Textverarbeitung in h&ouml;chster Vollendung</B>
<P>
Das Schreiben, Nachbearbeiten und Gestalten von Text wird immer eine der
wichtigsten Standardaufgaben am Computer sein. Genauso ist es auch beim
Amiga. Auch wenn mehr und mehr Spracherkennungssysteme eingesetzt werden,
entf&auml;llt dadurch lediglich die Eingabe der Texte per Hand. Das Layouten,
Korrigieren und Ausgeben erfordert weiterhin enorme Leistungen von der
eingesetzten Textverarbeitung.
<P>
"Das Konzept von EW basiert auf Boxen. Dies sind Rechtecke beliebigen
Inhalts."
<P>
<B>Plattform&uuml;bergreifende Standards</B>
<P>
Mit EasyWriter wird erstmals eine auf Amiga Basis entwickelte
Textverarbeitung pr&auml;sentiert, die Konzepte und Eigenschaften von Standard-
Textsystemen anderer Plattformen aufweist. Die durch den Amiga gepr&auml;gte,
flexible Erweiterbarkeit von Applikationen wird auch in Easywriter in
h&ouml;chster Vollendung genutzt und erlaubt somit, das Programm von "au&szlig;en" zu
erweitern. Drittanbieter aber auch PD- und Shareware-Entwickler werden so
innerhalb kurzer Zeit neuartige Lade- und Speicherformate hinzuf&uuml;gen und
EasyWriter um F&auml;higkeiten erweitern, die den Standardapplikationen auf
anderen Plattformen weit &uuml;berlegen sein werden.
<P>
<B>Ergonomie gro&szlig;geschrieben</B>
<P>
Einfachste Aufgaben, wie das Ausw&auml;hlen von Zeichens&auml;tzen oder die
Bestimmung der tats&auml;chlichen Bildschirmaufl&ouml;sung erm&ouml;glicht EasyWriter im
Handumdrehen. Kein langes Suchen in un&uuml;bersichtlichen Dialogen, kein
Mausschrubben, um Absatzformate auszuw&auml;hlen. In Zusammenarbeit mit
erfahrenen Anwendern wurde ein optimales Bedienkonzept erarbeitet und von
unseren Entwicklern konsequent umgesetzt. Dinge wie das WYSIWYG bei der
Fu&szlig;-, Kapitelend- und Endnotendarstellung sind daher selbstverst&auml;ndlich.
<P>
"Boxen sind sehr flexibel. Auch Rand und Hintergrundfarbe lassen sich
setzen."
<P>
"Die Bildschirm-Geometrie kann einfach eingestellt werden."
<P>
<B>Amiga-Eigenschaften konsequent genutzt</B>
<P>
Im Bedienkonzept enthalten ist auch die konsequente Nutzung der Amiga
Multitasking-Eigenschaften. So ist fast jeder Dialog nicht modal, das hei&szlig;t
er kann st&auml;ndig ge&ouml;ffnet bleiben und in Interaktion mit anderen Dialogen
und Einstellfenstern genutzt werden. Besonders deutlich wird dies am
Absatzformat-Dialog. Die Tabulatoreinstellungen k&ouml;nnen beispielsweise per
Eingabe des Wertes oder mit der Maus im horizontalen Lineal des
entsprechenden Dokumentes vorgenommen werden. Ein Feature das keineswegs
selbstverst&auml;ndlich ist. Auch das besonders schnelle Laden und Speichern von
Dokumenten ist eine Eigenschaft, die man in der Hauptsache auf dem Amiga
antrifft.
<P>
<B>100%ige Absatzkontrolle</B>
<P>
Der Absatzformat-Dialog l&auml;&szlig;t Ihnen kaum W&uuml;nsche offen. Als Besonderheiten
im Absatzformat sind die Verbindungsm&ouml;glichkeit mit dem Kapitel-
/Seitenformat und die &uuml;berragende Tabulator Einstellvielfalt zu nennen.
Dadurch, da&szlig; man bereits im Absatzformat ein vorher angelegtes
Kapitelformat angeben kann, wird die Umbruchgestaltung bei vorhandenem
Flie&szlig;text sehr vereinfacht. Beim Anwenden eines Absatzformates werden nicht
nur Schrift und Ausrichtung ver&auml;ndert, sondern auch das Aussehen des
jeweiligen Kapitels eingestellt. Einfacher kann man es nicht
automatisieren.
<P>
"Absatzformate sind die Grundlage f&uuml;r viele leistungsf&auml;hige
Funktionen."
<P>
"Mehrere Grundseitenformate sind mit EW kein Problem."
<P>
<B>Seitenformate und Kapitelmanagement</B>
<P>
Un&uuml;blich f&uuml;r Textverarbeitungen ist die M&ouml;glichkeit, mehrere, verschiedene
Seitenformate vorzugeben, die dann sogar absatzformatbezogen automatisch
anwendbar sind. Ein Anwendungsbeispiel hierf&uuml;r sind einzelne Kapitel eines
Buches, die unterschiedliche Satzspiegel oder vielleicht sogar Textfl&uuml;sse
bekommen sollen. Im Absatzformat f&uuml;r den Kapitelbeginn l&auml;&szlig;t sich somit das
Seitenformat einstellen, das einen anderen Aufbau bekommen kann, als das
Format f&uuml;r das beispielsweise zuvor im Text plazierte Inhaltsverzeichnis.
<P>
<B>Offen f&uuml;r beliebige Grafikformate</B>
<P>
Auch das Einbinden und Ausgeben von Grafiken geh&ouml;rt l&auml;ngst nicht mehr nur
zu den Eigenschaften von DTP-Programmen. In EasyWriter wird hierzu die
flexible Importschnittstelle genutzt. Der Grafik-Importer erm&ouml;glicht das
Laden von Grafiken im Standard IFF- und JPEG-Format. Auch Datatypes werden
nicht ignoriert. So lassen sich auch Bilder im Text plazieren, die in den
exotischsten Formaten vorliegen.
<P>
"Die flexible Kapitelnumerierung eignet sich f&uuml;r jeden Dokumenttyp."
<P>
Preis: 149,- DM Einf&uuml;hrungspreis bis 31.8.98<BR>
Im Preis enthalten ist das Upgrade zu Version 2.0.<BR>
Nach der Einf&uuml;hrungsphase kostet EasyWriter 198,- DM.
<P>
Lieferbar ab Juli 1998«
<P>
(Quelle: Haage & Partner)
<P>
»EasyWriter<BR>
Textverarbeitung in h&ouml;chster Vollendung
<P>
<B>Featureliste</B>
<P>
<B>Einfache Einarbeitung</B>
<P>
Durch die &Auml;hnlichkeit zu verf&uuml;gbaren Standardprogrammen finden Sie sich
sehr schnell im Programm und in allen Einstellern zurecht. Das Nachschlagen
im Handbuch wird zur Seltenheit.
<P>
<B>Fonts</B>
<P>
Unterst&uuml;tzung der Amiga-Fonteigenschaften. Es sind alle Bitmap,
Compugraphic Vektorfonts und Fonts weiterer, im System integrierten Font-
Engines nutzbar (z.B. Truetype, Postscript, etc).
<P>
<B>Fu&szlig;- und Endnoten, Marken</B>
<P>
<UL><LI>
   Fu&szlig;noten
</LI><LI>
   Kapitelendnoten
</LI><LI>
   Textendnoten
</LI><LI>
   Inhaltsverzeichnis
<P>
</LI></UL>
<B>Formateinsteller</B>
<P>
<UL><LI>
   Absatzformateinsteller/-katalog
</LI><LI>
   Zeichenformateinsteller/-katalog
</LI><LI>
   Seitenformateinsteller/-katalog (Musterseiten)
</LI><LI>
   Kapitelformateinsteller/-katalog
</LI><LI>
   Absatzformate und Schriftart/-gr&ouml;&szlig;e direkt per PopUp erreichbar
<P>
</LI></UL>
<B>Umfangreiche Absatzeinstellungen</B>
<P>
<UL><LI>
   Textausrichtung
</LI><LI>
   Einz&uuml;ge
</LI><LI>
   Durchschu&szlig; im Absatz
</LI><LI>
   variabler Durchschu&szlig; vor und nach dem Absatz
</LI><LI>
   N&auml;chstes Format nach Absatzende voreinstellbar
</LI><LI>
   In Inhaltsverzeichnis aufnehmen
</LI><LI>
   Neue Seite erzeugen
</LI><LI>
   Neue Seite mit neuem Kapitelformat (Musterseite) erzeugen
</LI><LI>
   Datums- und Uhrzeitformat absatzformatbezogen voreinstellbar
<P>
</LI></UL>
<B>Einzigartig flexibler Tabulatoreinsteller</B>
<P>
<UL><LI>
   Tabulatorintervall z.B. ab 3cm alle 0,5 cm bis 15cm einen Tab setzen
</LI><LI>
   Dezimaltabulator mit definierbarem Ausrichtungszeichen
</LI><LI>
   definierbare Tabulator-F&uuml;llzeichen
<P>
</LI></UL>
<B>Umfangreiche Schriftmanipulationen</B>
<P>
<UL><LI>
   Breite, Neigung und Kapit&auml;lchen einstellbar
</LI><LI>
   Super-/Subskript Einstellung
</LI><LI>
   Zeichensatzattribute (Hoch-/Tiefgestellt, Fett, Kursiv, Unterstrichen,
doppelt Unterstrichen, Durchgestrichen, Kapit&auml;lchen)
</LI><LI>
   Elektronische Variation von Gr&ouml;&szlig;e, Breite, Neigung und Kapit&auml;lchen
</LI><LI>
   Farbwahl f&uuml;r Text und Unterstreichung
</LI><LI>
   Vorschau f&uuml;r Textattribute und Farbe
</LI><LI>
   Absatz- und Zeichenformate sind tastaturaktivierbar
<P>
</LI></UL>
<B>Boxen- oder Rahmeneinsteller</B>
<P>
<UL><LI>
   Inhalt nicht oder grau anzeigen
</LI><LI>
   Inhalt nicht drucken
</LI><LI>
   Position und Gr&ouml;&szlig;e sperren
</LI><LI>
   Position und Gr&ouml;&szlig;e in den Ma&szlig;einheiten mm, cm, Inch und pt
</LI><LI>
   Textabstand im Rahmen einstellbar
</LI><LI>
   Rahmenlinienst&auml;rke, -farbe und Hintergrundfarbe
</LI><LI>
   Textverdr&auml;ngung f&uuml;r darunterliegende Rahmen einschaltbar
</LI><LI>
   Rahmenreihenfolge (Ebenen) verschiebbar
<P>
</LI></UL>
<B>Kapiteleinsteller</B>
<P>
<UL><LI>
   W&auml;hlbares Seitenformat f&uuml;r Doppelseiten- und Einzelseitendokument
</LI><LI>
   Seitennummerierung kapitelbezogen einstellbar
<P>
</LI></UL>
<B>Seitenformateinsteller</B>
<P>
<UL><LI>
   Anzahl der Textspalten einstellbar
</LI><LI>
   Satzspiegelbegrenzung (Druckr&auml;nder)
</LI><LI>
   Kopf-/Fu&szlig;zeilen-Einsteller
</LI><LI>
   Seitennummerierung (Paginage) f&uuml;r Kopf und Fu&szlig;zeile voreinstellbar
<P>
</LI></UL>
<B>Text-Im-/Exportformate</B>
<P>
<UL><LI>
   EasyWriter (default)
</LI><LI>
   RTF
</LI><LI>
   Text (ASCII)
</LI><LI>
   erweiterbar durch PlugIns
<P>
</LI></UL>
<B>Grafikformate</B>
<P>
<UL><LI>
   Amiga IFF
</LI><LI>
   JPEG
</LI><LI>
   PNG
</LI><LI>
   Datatypes
<P>
</LI></UL>
<B>Systemvoraussetzungen</B>
<P>
<UL><LI>
   AMIGA-Modell mit min. 25Mhz 68030 Prozessor
</LI><LI>
   8 MByte RAM
</LI><LI>
   Festplatte
</LI><LI>
   OS3.0 oder besser.
<P>
</LI></UL>
<B>Neue Features in der Version 2.0*:</B>
<P>
<UL><LI>
   Indexgenerator
</LI><LI>
   Postscript Fontengine
</LI><LI>
   Truetype Fontengine
</LI><LI>
   Rechtschreibpr&uuml;fung
</LI><LI>
   Gedrucktes Handbuch
<P>
</LI></UL>
Da der tats&auml;chliche Lieferumfang nicht genau festgelegt werden kann,
behalten wir uns vor, diesen zur Version 2 auch zu ver&auml;ndern.
<P>
Bereits angek&uuml;ndigte 3rd Party Produkte:
<P>
<UL><LI>
   Formeleditor
</LI><LI>
   Tabelleneditor
</LI><LI>
   Grafikeditor
</LI><LI>
   Synonymw&ouml;rterbuch
</LI><LI>
   MS-WORD Importmodul
<P>
</LI></UL>«
(Quelle: Haage & Partner)
<P>


<P ALIGN=RIGHT>
<A HREF="1406.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="1408.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
