<HTML>
<HEAD><TITLE>
Diverse Neuigkeiten
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="1408.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="1500.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Diverse Neuigkeiten
</font>
</TD></tr>
</TABLE>


<P>

<H2>9. Wahl des ICOA-Anwender-Vertreters</H2>

<P>
»ZUR SOFORTIGEN VER&ouml;FFENTLICHUNG
<P>
Wahl des User Representative (= Vertreters der Anwender) 98
<P>
Das Wahlverfahren
<P>
In Zusammenarbeit mit JMS (= Jay Miner Society), Team AMIGA Worldwide
und dem ICOA.
<P>
Die Zust&auml;ndigkeiten der JMS, von Team AMIGA und des ICOA
<P>
Die Zusatzregeln des Industry Council for Open Amiga fordern, da&szlig; im
Steering Committee (= Lenkungs-Ausschu&szlig;) ein vollwertiger Wahl-Sitz durch
einen Anwender-Vertreter eingenommen wird, der auf eine Art ausgew&auml;hlt
wurde, die der ICOA als die wirksamste zur Bestellung des Anwender-
Vertreters erachtet.
<P>
Deshalb bat das Transitional Steering Committee (TSC) (= &Uuml;bergangs-
Lenkungs-Ausschu&szlig;) des ICOA die gesamte Amiga-Gemeinde um Vorschl&auml;ge
f&uuml;r das Wahlverfahren eines Anwender-Vertreters. Die JMS beantwortete
diese Bitte mit einem Satz von Vorschl&auml;gen und Verfahren, die durch nicht
von ihr verschuldete Verz&ouml;gerungen behindert wurden.
<P>
Als die Wahl &uuml;berpr&uuml;ft wurde, mu&szlig;ten mehrere abgegebene Stimmen wegen
betr&uuml;gerischer Absichten f&uuml;r ung&uuml;ltig erkl&auml;rt werden, und es verblieben
drei Kandidaten fast mit Stimmengleichheit. In Beratungen zwischen den
Kandidaten, der JMS und Team AMIGA stellte sich heraus, da&szlig; Kl&auml;rung
dringend notwendig war.
<P>
Wegen der Zeitbeschr&auml;nkung, Fehlen der erforderlichen &Ouml;ffentlichkeits-
Arbeit und betr&uuml;gerischer Stimmabgaben baten die JMS und Team AMIGA um
Neuansetzung der Wahl mit ausreichender Zeit f&uuml;r Ver&ouml;ffentlichung,
Nominierung und Stimmenabgabe aus einem viel gr&ouml;&szlig;erem Kreis, als er
vorher angesprochen war. Dieser Bitte wurde entsprochen.
<P>
<HR NOSHADE SIZE=1 COLOR="#000000">
Es folgt die Beschreibung des neuen Wahlverfahrens, mit welchem eine
gr&ouml;&szlig;ere W&auml;hlergemeinde erreicht werden soll. Wir fordern jeden von Ihnen
auf, diese Gelegenheit zu nutzen und einen Anwender-Vertreter Ihrer Wahl
zu nominieren und zu w&auml;hlen.
<P>
Die gew&auml;hlte Person wird Ihr Sprecher beim Aufbau einer neuen Zukunft f&uuml;r
den Amiga sein. W&auml;hlen sie weise, aber w&auml;hlen Sie ... «
<P>
<I>[Anm. d. Red.: Die Details zur Kandidaten-Nominierung wurden von uns
absichtlich weggelassen, da deren Frist Ende Mai abgelaufen ist. Angaben
hierzu sind in AMIGA aktuell 5/98 nachzulesen.]</I>
<P>
»Die Liste der g&uuml;ltigen Wahlkandidaten mit Hinweisen zu Ihren Wahlaussagen
wird durch die JMS so bald wie m&ouml;glich nach dem 2. Juni 1998 ver&ouml;ffentlicht
werden.
<P>
<B>WAHLVERFAHREN</B>
<P>
Stimmabgabe kann mit normaler Post, mit Fido Netmail, per E-Mail oder auf
einem Web-Vordruck geschehen und mu&szlig; zwischen Mitternacht (GMT) vor dem
2. Juni 1998 und Mitternacht (GMT) vor dem 20. Juni 1998 eingegangen sein.
Alle W&auml;hler m&uuml;ssen ihren Namen und eine g&uuml;ltige E-Mail-Adresse angeben, und
d&uuml;rfen nicht mehr als eine Stimme abgeben. Wenn mehr als eine Stimme vom
gleichen W&auml;hler, der gleichen E-Mail-Adresse und einer sonstigen Adresse
eingeht, werden alle Stimmen dieses W&auml;hlers disqualifiziert. Wahlhelfer,
Wahlrichter und Sammler von Nominierungen d&uuml;rfen nicht an der Wahl
teilnehmen.
<P>
<B>W&Auml;HLEN MIT NORMALER POST</B>
<P>
Stimmzettel f&uuml;r normale Wahl per Post sind von mehreren Amiga-Magazinen
erh&auml;ltlich. Stimmzettel per Post sind an Andrew Bienhaus unter folgender
Adresse zu senden:
<P>
Andrew Bienhaus
90 Farr Crescent
Cambridge
Ontario N3C 1R6
Canada
<P>
<B>W&Auml;HLEN &Uuml;BER FIDONET</B>
<P>
Wer vom Fidonet aus w&auml;hlen m&ouml;chte, soll eine Netmail an Asha Develder,
Moderator von 1:202/720.5, senden und ein numeriertes Stimmformular
anfordern. Asha sendet mit regul&auml;rer Fido Netmail ein vornumeriertes
Formular an den Anforderer. Sobald das Stimmformular ausgef&uuml;llt ist,
ist es an Asha Develder zur Best&auml;tigung zur&uuml;ckzusenden. Netmail-W&auml;hler-
Adressen werden w&ouml;chentlich in eine Liste im Fidonet Amiga vom Moderator
aufgenommen. Sie werden sp&auml;testens am 20. Juni 1998 an Andrew Bienhaus
&uuml;bersandt.
<P>
<B>W&Auml;HLEN MIT INTERNET-E-MAIL</B>
<P>
Ein offizieller Stimmvordruck wird herausgegeben, sobald die Liste der
Kandidaten endg&uuml;ltig ist. Alle Stimmen &uuml;ber Internet-E-Mail m&uuml;ssen mit
diesem Formular mit nur einem ausgew&auml;hlten Kandidaten abgegeben werden. Sie
m&uuml;ssen an den offiziellen Stimmensammler abgesandt werden, dessen E-Mail-
Adresse bekanntgegeben wird, wenn die Abstimmungsformulare ver&ouml;ffentlicht
werden. Sobald die Stimme eingegangen ist, best&auml;tigt der Stimmensammler
den Erhalt. Wird die Best&auml;tigung wegen einer ung&uuml;ltigen E-Mail-Adresse
zur&uuml;ckgewiesen, wird diese Stimme nicht gez&auml;hlt.
<P>
<B>WAHL MIT WEB-FORMULAR</B>
<P>
Zwei Wahl-Formulare werden auf der Web-Adresse
<A HREF="http://www.amiga.de/diary/user/teamamiga/">http://www.amiga.de/diary/user/teamamiga/</A> w&auml;hrend der Wahlperiode
zur Verf&uuml;gung stehen. W&auml;hler m&uuml;ssen Ihre E-Mail-Adresse auf dem ersten
Formular angeben, um einen eindeutigen Schl&uuml;ssel zu erhalten, der per E-
Mail zugesandt wird. Mit diesem Schl&uuml;ssel kann dann die Wahl auf dem
zweiten Formular durchgef&uuml;hrt werden.
<P>
<B>VER&Ouml;FFENTLICHUNG DER WAHLERGEBNISSE</B>
<P>
Die JMS, Team AMIGA und der ICOA werden gemeinsam die Ergebnisse sobald wie
m&ouml;glich nach Ende der Wahl ver&ouml;ffentlichen. Es wird erwartet, da&szlig; dies
am 22. Juni oder kurz danach geschieht.
<P>
<B>BESCHWERDE-VERFAHREN</B>
<P>
Jeder, der glaubt, die Wahl sei nicht regelgerecht durchgef&uuml;hrt worden,
kann eine offizielle Beschwerde schriftlich entweder an
<P>
Andrew Elia &lt;<A HREF="mailto:andrew@amigasoc.org">andrew@amigasoc.org</A>>, Amiga Society, London
<P>
oder
<P>
Gary Peake &lt;<A HREF="mailto:gpeake@wans.net">gpeake@wans.net</A>>, Team AMIGA
<P>
senden. Diese werden entscheiden, ob die Beschwerde berechtigt ist und,
falls das zutrifft, was zu tun ist, um die Dinge in Ordnung zu bringen.
Die JMS, Team Amiga und der ICOA lehnen jede Verantwortung f&uuml;r M&auml;ngel
beim Wahlverfahren ab, die durch Fehler im Netzwerk oder durch Ger&auml;te,
die von den Service-Providern verwendet werden, entstehen.«
<P>


<P ALIGN=RIGHT>
<A HREF="1408.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="1500.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
