<HTML>
<HEAD><TITLE>
Abschlie&szlig;end
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="1600.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0000.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>


<P>


<H1>
Abschlie&szlig;end
</H1>



Nichts ist unm&ouml;glich - das hat der vergangene Monat ganz deutlich gezeigt.
Da ist seit Monaten ein Betriebssystem-Update f&uuml;r bestehende AMIGAs auf
Version 3.5 angek&uuml;ndigt, Olaf Barthel und andere waren bereits mit den
Vorarbeiten besch&auml;ftigt, und einige technische Details standen auch schon
fest - aber was passiert? Quasi in einer Nacht- und Nebel-Aktion, zumindest
kann man sich als AMIGA-Anwender dieses Eindrucks kaum erwehren, wurden
offenbar die gesamten Pl&auml;ne &uuml;ber den Haufen geworfen. Wie auf der IRC-
Konferenz so sch&ouml;n gesagt wurde: Ein einziges Telefongespr&auml;ch kann alles
&auml;ndern. Tja, und dieses ist ja ganz offensichtlich gef&uuml;hrt worden...
<P>
Abgesehen von der Tatsache, da&szlig; es f&uuml;r die bestehenden Rechner keine neue
Betriebssystem-Version mehr geben wird - zumindest nicht von der AMIGA-
Entwicklungsabteilung -, mit AMIGA OS 3.1 also Schlu&szlig; ist, entsteht den
Nutzern der "Classic-AMIGAs" (die neueste Wortsch&ouml;pfung aus dem Hause
AMIGA, Inc. - gemeint sind die aktuellen Rechner) gl&uuml;cklicherweise kein
Schaden, zumindest kein materieller.
<P>
Dagegen haben die Hardware-Pl&auml;ne der AMIGA-Entwicklungsabteilung f&uuml;r sehr
viel mehr Unruhe und Besorgnis bei einer bestimmten Gruppe von AMIGA-
Anwendern gesorgt: Gemeint sind diejenigen, die sich in gutem Glauben auf
eine AMIGA-PowerPC-Zukunft bereits mit einer PowerUp-Karte eingedeckt
haben. Zwar ist l&auml;ngst noch nicht gesagt, da&szlig; der PowerPC-AMIGA "tot" ist,
wie es am 15. Mai noch ganz den Anschein hatte, dennoch d&uuml;rfte bereits
jetzt feststehen: Die PowerPC-Prozessorreihe wird in der zuk&uuml;nftigen AMIGA-
Geschichte nicht die Hauptrolle spielen.
Es sei denn, AMIGA, Inc. &auml;ndert ein weiteres Mal seine Vorhaben. Damit ist
jedoch kaum zu rechnen, es wird wohl lediglich eine leichte Korrektur
geben, um den auf PowerPC setzenden Firmen (insbesondere Phase 5 und Haage
& Partner) entgegenzukommen, sprich: Support bei der Portierung der
heutigen und zuk&uuml;nftigen AMIGA-OS-Versionen auf den PowerPC.
<P>
Aus meiner (pers&ouml;nlichen) Einsch&auml;tzung der zuk&uuml;nftigen AMIGA-Entwicklung
m&ouml;chte ich jedoch keinen Hehl machen:
Wenn man den vorsichtigen Ank&uuml;ndigungen von AMIGA, Inc. glauben darf,
werden es Haage & Partner und Phase 5 &auml;u&szlig;erst schwer haben, diesen Rechner
zu &uuml;bertreffen. Ob sie es schaffen, sehen wir leider erst in
voraussichtlich 18 Monaten. Gewi&szlig; - insbesondere, wenn der PowerPC-Rechner
fr&uuml;her fertig sein sollte als die von AMIGA, Inc. angek&uuml;ndigte '99er-
Generation (was f&uuml;r mich noch keineswegs feststeht), wird er seine Abnehmer
finden. Und bis dahin wird auch PowerUp nicht "tot" sein.
<P>
Jedoch kann und wird sich erst, wenn beide Konkurrenz-Systeme auf dem Markt
sind, zeigen, wer letztendlich die Nase vorn haben wird. Und das ist ganz
sicher derjenige, der die h&ouml;chste Leistung zum m&ouml;glichst g&uuml;nstigen Preis
bietet. Wenn AMIGA, Inc., das einhalten k&ouml;nnen wird, was angek&uuml;ndigt ist,
steht der Sieger bereits jetzt fest.
<P>
Standard-Kompatibilit&auml;t zum AMIGA OS 3.1 wird in Zukunft &uuml;brigens nur eine
sehr untergeordnete Rolle spielen. Dies leuchtet sp&auml;testens dann ein, wenn
man sich vor Augen f&uuml;hrt, da&szlig; selbst die "Schnecke" UAE auf einem
Hochleistungsprozessor, wie er von AMIGA, Inc. vorgesehen ist, mit einer
durchaus angenehmen Geschwindigkeit betrieben werden kann.
<P>
Damit bis n&auml;chsten Monat,
<P>
Euer
<P>
Carsten Schr&ouml;der

<P ALIGN=RIGHT>
<A HREF="1600.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0000.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
