<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Skidmarks</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="gam0">
<AREA shape="rect" coords="460,1,550,22" href="gam.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#0020AC">
<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>

<TR>
<TD>
<BR>

<H1 align="center"><B><FONT color="#FFFF00">SKIDMARKS</FONT></B></H1>
<BR>

<TABLE border="0" cellpadding="4" summary="" bgcolor="#CACACA" width="80%" align="center">
<TR>
<TD>
<CENTER>
<H3><B>Testbericht zu SKIDMARKS von ACID Software</B><BR>
Geschrieben von Danny Hoffmann und Norman Schlegel</H3>

<H4>Wir testeten die AGA Version des in Blitz Basic geschriebenen
Auto-Ralley-Spiels.</H4>
</CENTER>

<P>Als erstes stellt man sich sein gew&uuml;nschtes Auto ein. Man kann
zwischen Porsche, Buggy, Monster Truck und Jeep w&auml;hlen. Diese haben
alle ihre besonderen Eigenschaften. So ist der Porsche schneller als der
Jeep welcher daf&uuml;r besser in der Kurve liegt. Au&szlig;erdem ist die
Sprungst&auml;rke des Jeeps und des Monster Trucks st&auml;rker als die des
Porsche oder Buggys.</P>

<P>Hat man einen Wagen gew&auml;hlt kann man die Optionen einstellen. Man
kann sich einen der vier Teamnamen aussuchen, den Schwierigkeitsgrad
einstellen, zwischen 2-8 Runden w&auml;hlen und sich aussuchen ob man
Training, Match Race oder Championchip fahren will. Ist alles eingestellt
kann man sich &uuml;berlegen ob man alleine oder zu zweit spielen
m&ouml;chte.</P>

<P>Sp&auml;ter entscheidet man sich f&uuml;r eine der beiden Track
Disketten. Auf beiden sind sechs verschiedene Strecken vorgegeben. Man kann
auf Asphalt und Erde fahren. Die Hintergr&uuml;nde der Strecken reichen von
Schnee- &uuml;ber Strand- bis Naturszenario. Hat man sich f&uuml;r einen
Kurs entschieden geht es los. Die Musik w&auml;hrend den Ladepausen ist
passend wird aber nach einiger Zeit langweilig.</P>

<P>Die Steuerung ist wie bei Super Off Road oder Badlands. Allerdings kann
man hier auch r&uuml;ckw&auml;rtsfahren, was besonderst die Geisterfahrer
freuen d&uuml;rfte. Das Scrolling ist sauber programmiert und wenn man sich
mal l&auml;nger auf der Fahrbahn halten kann kommt man auf wahre
H&ouml;chstgeschwindigkeiten! Besonderst wurde auf Kleinigkeiten geachtet.
So hinterl&auml;st man zB in Kurven Bremsspuren. &Uuml;berhaupt wurde die
Grafik detailreich gestaltet. Besonderen Spa&szlig; machte es uns
r&uuml;ckw&auml;rts &uuml;ber die Rampe auf Track Disk 1/ Runde 3 zu
fahren, da man dadurch fast aus dem Bildschirm geschleudert wird!
Erw&auml;hnenswert ist die Special AGA Car Disk f&uuml;r alle A1200
Besitzer. Da die Autos auf dem A1200 dadurch sehr viel besser aussehen.</P>

<P>Das Spiel ist insgesamt recht gut in Szene gesetzt worden. Mit Track
Disketten und der AGA Car Disk zusammen macht sich das Spiel auf 4
Disketten breit.</P>                               
</TD>
</TR>
</TABLE>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

