<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Die Siedler zum Ersten</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="gam0">
<AREA shape="rect" coords="460,1,550,22" href="gam.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#EE0000">
<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>

<TR>
<TD>
<BR>

<H1 align="center"><B><FONT color="#FFFF00">Die Siedler</FONT></B></H1>

<P align="center"><B><FONT color="#FFFF00">getestet von Martin
Dreisbach</FONT></B></P>
<BR>

<TABLE border="0" cellpadding="4" summary="" bgcolor="#F9BA63" width="80%" align="center">
<TR>
<TD>
<P>Blue Byte, bekannt durch Battle Isle und Historyline, hat mal wieder
zugeschlagen und ein Strategie-Game hingelegt, das seinesgleichen
sucht!</P>

<P>Der bunten Packung liegen drei Disks bei, von denen belegt der Vorspann
alleine schon fast zwei Disks und das eigentliche Spiel befindet sich auf
der dritten Diskette.</P>

<P>In dem Vorspann, der mehrere Minuten lang l&auml;uft und in sch&ouml;ner
Zeichentrickmanier gemacht ist, sieht man einen Ritter (den Spieler!?)
durch eine mittelalterliche Kullisse reiten bis er an ein Schlo&szlig;
angelangt ist. Nach diesem erlebnis bekommt man eine Codeabfrage zu Gesicht
und eine Liste, was dem Spiel an Speicher zur Verf&uuml;gung steht, wieviel
Sounds geladen wurden, bis zu welcher Gr&ouml;&szlig;e das Land generiert
werden kann und...und...und...! Denn, je gr&ouml;&szlig;er der Computer
(mehr Speicher, Koprozessor), desto besser und umfangreicher wird das
Spielgeschehen. Danach erscheint ein Men&uuml;, in dem man folgendes
einstellem kann:</P>

<P>Die Spielgr&ouml;&szlig;e: Je nach zu Verf&uuml;gung stehendem Speicher
kann man die Gr&ouml;&szlig;e der Spielfl&auml;che einstellen. Die kleinste
Gr&ouml;&szlig;e ist die 1. Das Land ist hier relativ klein und man kann
sich nicht `verirren`. Die gr&ouml;&szlig;te Einstellung ist die
Gr&ouml;&szlig;e 9. In den Genu&szlig; dieser Gr&ouml;&szlig;e werden nur
Leute kommen, die &uuml;ber 2 MB Speicher zur Verf&uuml;gung haben, denn
diese Welt ist so gigantisch, da&szlig; man Wochen braucht, um das gesamte
Land zu besiedeln.</P>

<P>Die Missionen: Die Missionen spielen grunds&auml;tzlich in der
Gr&ouml;&szlig;e 3. Von den Missionen gibt es 30 St&uuml;ck, die sich
lediglich in der Anzahl der Computergegner, dem Schwierigkeitsgrad und den
immer anders aussehenden L&auml;ndern unterscheidet. Die einzelnen
Missionen kann man mit Passw&ouml;rtern anw&auml;hlen.</P>

<P>Die Trainingsmissionen: Es gibt deren sechs. Dort sind bestimmte
Aufgaben vorgeschrieben wie z.B.: F&ouml;rdere 5 Einheiten Kohle und Gold
oder vernichte alle gegnerischen Wacheinrichtungen.</P>

<P>Der 2 Spielermodus: Hier kann man zu zweit gegeneinander spielen. Es ist
aber auch m&ouml;glich, noch ein paar Computergegner mitspielen zu lassen.
Der Screen wird dann in zwei H&auml;lften geteilt wie bei Historyline.</P>

<P>Der Teammodus: Eine Neuerung, die es noch bei keinem anderem Spiel gab.
Zwei Spieler spielen miteinander gegen den Computer. Auch hier wird der
Screen geteilt, nur mit dem Unterschied, da&szlig; beide f&uuml;r die
gleiche Siedlung agieren.</P>

<P>Das Demospiel: Hier spielt der Computer gegen sich selbst.</P>

<P>In dem Men&uuml; kann man auch mittels einiger Zahlencodes, &auml;hnlich
wie bei Lotus 3, seine eigenen Welten errechnen lassen. Nat&uuml;rlich kann
man noch mehr einstellen, aber alles wird nicht verraten!</P>

<P>Das Spielfeld betrachtet man aus einer Schr&auml;g-Oben-Sicht (SOS).
Hier sieht man Berge, Fl&uuml;sse, T&auml;ler, Wiesen, W&auml;lder und
vieles mehr.</P>

<P>Als erstes sucht man sich einen Standort f&uuml;r sein Schlo&szlig;
(Hauptquatier) aus. Eine nicht kleine Rolle spielen hierbei die
Bodensch&auml;tze, denn die braucht man nachher um Waffen, Nahrungsmittel
u.s.w. herzustellen. Danach m&uuml;ssen bestimmte H&auml;user plaziert
werden.</P>

<P>Zum Beispiel braucht man anfangs einen Holzf&auml;ller, um Holz zu
bekommen, da das rohe Holz nur zum stochern taugt, mu&szlig; ein
S&auml;gewerk gebaut werden, das das zu Brettern verarbeitet. Damit es aber
nicht dazu kommt, da&szlig; irgendwann der ganze Wald abgeholzt ist,
mu&szlig; ein F&ouml;rsterhaus gebaut werden, der F&ouml;rster k&uuml;mmert
sich dann um den Forstbestand.</P>

<P>So h&auml;ngen alle Geb&auml;ude miteinander zusammen.<BR>
Man mu&szlig; sich auch um die n&ouml;tigen Rohsoffe Golderz, Eisenerz,
Granit u.s.w. k&uuml;mmern, denn ohne Gold sind die Soldaten sp&auml;ter
nicht gerade sehr motiviert einen Feind in Grund und Boden zu stampfen.</P>

<P>Um an diese Rohstoffe zu kommen mu&szlig; man Bergwerke bauen die diese
Materialien abbauen.<BR>
Um Grunde beziehen sich alles darauf, nachher gen&uuml;gen, gut
ausger&uuml;stete und hochmotievierte Ritter zu haben, die das eigene Land
verteitigen, oder neues erobern.</P>

<P>Ingesamt gibt es 24 verschiedene Geb&auml;ude, 26 Rohstoffe und 25
Berufe. Jetzt alle Geb&auml;ude und Berufe zu erkl&auml;ren w&uuml;rde den
Rahmen der NOCOVER sprengen und au&szlig;erdem will ich denjenigen, die
sich dieses geniale Spiel noch zulegen wollen, nicht schon alles vorneweg
erz&auml;hlen.</P>

<P>Nun zur Grafik:<BR>
Diese ist wohl das beste am ganzen Spiel. Die H&auml;user und das Land
sehen wie im Zeichentrick aus und Leute die auf den Stra&szlig;en
herumwusel haben &auml;hnlichkeit mit den Lemmingen. Man sieht die Personen
auch wie sie ihren t&auml;glichen Aufgaben nachgehen: der Holzf&auml;ller
f&auml;llt B&auml;ume, der Schreiner s&auml;gt das Holz, der Schmied
h&auml;mmert wie verr&uuml;ckt auf seinem Ambo&szlig; herumm und so
weiter......</P>

<P>Der Sound:<BR>
Jenachdem wieviel Speicher man zur Verf&uuml;gung hat bekommt man mehr oder
weniger Soundeffekte zu h&ouml;ren. Das Musikst&uuml;ck, welche im
hintergrund l&auml;uft ist auch sehr gut gelungen und h&ouml;rt sich
ziemlich Mittelalterlich an.</P>

<P>Auch die Stragegen unter euch werden nicht zu kurz kommen. Denn man kann
nicht einfach seine Ritter auf jedes x-beliebige Haus hetzen, man mu&szlig;
schon &uuml;berlegen, wo es dem Feind am meisten schmerzt und das ist nich
gerade ein Zuckerschlecken.</P>

<P>Zum Abschlu&szlig;:<BR>
EINFACH GENIAL!!!!!!!!!!!!!!!!!!<BR>

Blue Byte hat ein noch besseres Spiel hingelegt, als es History Line oder
Battle Isle schon waren. Auch wenn sich das Spiel noch so komplex
anh&ouml;rt (was es zwar auch ist), ist es doch sehr schnell zu
erlernen.<BR>
Das Spiel l&auml;uft ab Kick 1.2 auf jedem Amiga und wie schon gesagt, wird
alles unterst&uuml;tzt was den Computer aufpuscht (Coprozessor e.t.c...).
Nur dadurch, da&szlig; sich dieses Spiel bisher so gut verkauft hat,
bekommen wir auch den 2. Teil der Battle Isle Saga zu Gesicht (laut
Bluebyte). Nun zur Prozentualen (schweres Wort) Auswertung:</P>

<CENTER>
<PRE>
*********************************************
*                                           *
*    Produktname  : DIE SIEDLER             *
*                                           *
*    Preis        : ca. 80-90 DM            *
*                                           *
*    Hersteller   : Bluebyte                *
*                                           *
*    Sonstiges    : Festplatte wird         *
*                   unterst&uuml;tzt,            *
*                   Turbokarten und         *
*                   zus&auml;tzlicher Speicher   *
*                   werden akzeptiert.      *
*                                           *
* ----------------------------------------- *
*                                           *
*    Grafik       : 92 %                    *
*                                           *
*    Sound        : 85 %                    *
*                                           *
*    Handhabung   : 95 %                    *
*                                           *
*    Motivation   : 95 %                    *
*                                           *
*    Gesamt       : 92 %                    *
*                                           *
*********************************************


</PRE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

