<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>B A N S H E E</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="gam0">
<AREA shape="rect" coords="460,1,550,22" href="gam.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#008800">
<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>

<TR>
<TD>
<BR>

<H1 align="center"><B><FONT color="#FFFF00">B A N S H E E</FONT></B></H1>
<BR>

<TABLE border="0" cellpadding="4" summary="" bgcolor="#63BACA" width="80%" align="center">
<TR>
<TD>
<P>Was isn Banshee &uuml;berhaupt. Ist es ein Spiel wo man mit Gummifaden
am Bein von ner Br&uuml;cke h&uuml;pfen mu&szlig; ? Was macht man mit dem
Amiga dabei ? Naja ganz so ist es nicht. Bei Banshee handelt es sich um ein
neues Ballerspiel mit recht altem Spielprinzip. Das Spielprinzip
l&auml;&szlig;t sich recht einfach erkl&auml;ren. Die Gegner, in diesem
Fall alles was Fliegen kann, sowie alles m&ouml;gliche am Boden, die von
vorn, von der Seite oder von hinten kommen m&uuml;&szlig;e mittels
Bet&auml;tigung des Feuerknopfes eleminiert werden.</P>

<P>Dem alten Spielprinzip steht jedoch eine Grafik und ein Sound aller
erster G&uuml;te entgegen, denn das Spiel ist "only for AGA" d.h mit 256
Farben und daher nur auf den neuen Amigas mit AGA Chipset
lauff&auml;hig.</P>

<P>Aber nun zum eigentlichen Spiel selbst. Man kann w&auml;hlen zwischen 1
und 2 Spieler die mittels Maus oder Joystick ihr etwas angetagtes Flugzeug
durch die Luft steuern. Bei der 2 Spieleroption fliegen beiden Spieler
zusammen. Schon am Anfang begr&uuml;&szlig;t einen eine sehr gelunge Musik.
N&ouml; nix mit Techno oder so wat -etwas alltert&uuml;mliches richtig gut
umgesetzt bringt hier den Sound zum Game. Leider sind die Schie&szlig;- und
Explodierger&auml;usche nicht zu h&ouml;ren oder nicht vorhanden, das kann
ich nicht sagen da ich nur ne Demo hab. Die Feinde sind vielzahlig. Als
Feinde in der Luft stehten mit Raketen best&uuml;ckte Hubschrauber und
Gro&szlig;raumflugzeuge zu Auswahl, abgesehen von den "kleineren"
Maschienen die dem des eigenen Flugzeugs &auml;hnlich sind. Die kleinen
Flugzeuge kommen oft in Stafeln von 4 bis 6 Flugzeugen die einen
Frontalangriff (oder andere diverse Taktiken) starten und dan mit
wunderbarer Grafik abwechselnd nach links oder rechts abdrehen.
Nat&uuml;rlich ist die Untergrundgrafik nicht umsonst da, denn auch auf dem
Boden befinden sich Feinde aller Art. Da w&auml;ren zu nennen
haupts&auml;chlich gro&szlig;e Fahrzeuge wie LKWs,PKWs und Panzer. Aber
auch die kleinen Soldaten k&ouml;nnen einen ganz sch&ouml;n zu schaffen
machen.</P>

<P>Sie machen einem aber oft nur zu schaffen, wenn man sich nicht beeilt,
denn sie befinden sich oft in solchen Planwagen. Schie&szlig;t man den
Planwagen ab bevor sie herauskommen so explodiert der Wagen und sie kommen
mit brennenden K&ouml;pfen heraus, tja sonst mu&szlig; man eben zu
h&auml;rteren Mitteln greifen und sie mit der Bordkanonen "abs&auml;gen".
Etwas brutal sieht das schon aus wenn die kleinen Soldaten dann Blut
verschmiert am Boden liegen.</P>

<TABLE border="0" width="100%" summary="">
<TR>
<TD valign="top">FAZIT:</TD>

<TD>
<P>F&uuml;r alle Ballerfreaks ist das ein neuer Spielehit. F&uuml;r eine
Umsetzung f&uuml;rs CD32 wei&szlig; ich nichts - die kommt aber bestimmt
noch. Wer sich f&uuml;r die Demoversion interesiert der sollte sich die
Zeitschrift CU Amiga vom Mai hohlen. Da befindet sich Banshee, Octamed 4
und noch 2 andere Spieledemos drauf.</P>

<P align="right">Jens Neubauer</P>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

