<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Gravity Force 2</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="gam0">
<AREA shape="rect" coords="460,1,550,22" href="gam.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#2042BA">
<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>

<TR>
<TD>
<BR>

<H1 align="center"><B><FONT color="#FFFF00">Gravity Force 2</FONT></B></H1>
<BR>

<TABLE border="0" cellpadding="4" summary="" bgcolor="#33ACEE" width="80%"
align="center"> <TR> <TD> <P>Mit Gravity Force 2 ist wiedermal ein
Klassiker neu aufgelegt worden. Diesmal aber haben die Jungs von BiTS das
komplette Gameplay einer Frischzellenkur unterzogen. Das Original, das
irgendwann Mitte der Achtziger von Kingsoft erschienen ist, war damals eine
noch nie dagewesene Spielidee.</P>

<P>Wodrum es geht? Ganz einfach: Zwei Spieler versuchen sich mit einem
Raumgleiter in einer Arena (Seitenansicht) das Blech zu verbeulen. Dabei
spielt die Gravitation eine nicht gerade unwichtige Rolle. Im Men&uuml;, am
Anfang des Spieles, kann man ziemlich viele Dinge einstellen, wie z.B. die
Gravitation, den Luftwiderstand, Spezialwaffen, Anzahl der Leben,
Tournamentmodus, etc.... etc.... etc....</P>

<P>Das Spielfeld scrollt soft noch oben und nach unten, nicht aber zur
Seite. Zur Verteidigung (oder zum Angriff) gibt es eine riesen Auswahl an
Waffen. Zieht man w&auml;hrend des Spieles den Freudenstab nach hinten,
wird ein Special aktiviert, das man am Anfang einstellen konnte. Da
w&auml;re z.B. die zielsuchende Rakete, oder die freifallende Bombe,
Rundumschu&szlig;, extra Treibstoff, Warp-Beschleunigung.... genug Zeug
also um dem Gegenspieler kr&auml;ftig in den Ar... zu treten.</P>

<P>Als Standartwaffe hat man ein MG, das man in mehreren Variationen
einstellen kann: Streufeuer, Halbautomatik oder &uuml;berhaupt keine
Kanone, dann mu&szlig; man den `Feind` durch rammen in ein Hindernis aus
dem Weg r&auml;umen.</P>

<P>Es gibt sechs grafisch verschiedene Welten und von jeder dieser Welten
gibt es mehrere Level. Die Grafik ist wirklich sehr gut gelungen. Leider
hab ich das Original nie gesehen, deshalb kann ich keine Vergleiche
anstellen, aber ich glaube nicht, da&szlig; die Grafik, damals so
sch&ouml;n und detailreich aussah wie sie hier aussieht. Auch der
digitalisierte Sound kann sich h&ouml;ren lassen, so platscht es laut, wenn
man ins Wasser (ja, das gibt es hier auch) taucht, oder man h&ouml;rt die
Sch&uuml;sse in die Wand einschlagen. Bei der Steuerung braucht man erst
etwas Eingew&ouml;hnungszeit, bis man sie perfekt beherscht. Auch wer
keinen Mitspieler findet wird seine Freude an diesem Spiel haben, denn
daf&uuml;r wurde der Racemodus eingebaut, hierbei mu&szlig; man so schnell
wie nur irgend m&ouml;glich um bestimmte Makierungen fliegen.</P>

<P>Nat&uuml;rlich gibt es auch versteckte R&auml;ume und dergleichen. Das
Game ist momentan mein Lieblingsspiel und wird es auch noch l&auml;nger
bleiben, denn soviel Fun gegen einen Mitspieler zu k&auml;mpfen hat mir bis
jetzt noch kein Spiel gemacht. Das Spiel ist frei kopierbar und keine
Shareware. Die Highscores lassen sich abspeichern und das Teil
l&auml;&szlig;t sich problemlos auf eine Festplatte ziehen, au&szlig;erdem
l&auml;uft GRAVITY FORCE 2 auf eigentlich jedem Amiga und &uuml;berhaupt
und sowieso.......</P>

<P>Ihr findet dieses Game auf der Spielekiste Nr. 436 oder bei OBI (oder
vielleicht doch nicht?)</P>

<P>Martin</P>
</TD>
</TR>
</TABLE>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

