<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Hero Quest 2</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="gam0">
<AREA shape="rect" coords="460,1,550,22" href="gam.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#0020AC">
<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>

<TR>
<TD>
<BR>

<TABLE border="0" cellpadding="4" summary="" bgcolor="#CACACA" width="80%" align="center">
<TR>
<TD>
<P align="center"><B>Testbericht zu Hero Quest II oder THE LEGACY OF SORASIL<BR>
Geschrieben von Norman Schlegel</B></P>

<P>Wiedermal gilt es ein Land von einem b&ouml;sen Fluch zu befreien. Dies
kann man in englischer, franz&ouml;sischer oder deutscher Sprache
versuchenn. Versuchen deshalb, weil es ein paar ziemlich schwerwiegende
Einschr&auml;nkungen gibt. So kann man zB nur nach jeder erfolgreich
abgeschlossenen Mission abspeichern, was bei den gro&szlig;en Leveln
Stunden dauern kann! Au&szlig;erdem ist die Musik zwar stimmungsvoll,
f&auml;ngt aber nach l&auml;ngerem Spielen an zu nerven. Auf einem A500
l&auml;uft das Spiel auch ein bissel langsam ab, aber ansonsten hatte ich
nicht viel zu beanstanden.</P>

<P>Zuerst w&auml;hlt man ein Team von bis zu 4 Charakteren aus. Dabei hat
man die Wahl zwischen 8 Charakteren, die vom Waldl&auml;ufer &uuml;ber den
Babar bis hin zur Zauberin reichen. Einige Eigenschaften kann man dann noch
verbessern bevor man im sch&ouml;n annimierten Auswahlbildschirm aufs Start
Icon dr&uuml;ckt.</P>

<P>Danach wird eine Karte des Landes Sorasil angezeigt und die erste der
insgesamt zehn Missionen erkl&auml;rt. Man steuert sein Team aus einer
Schr&auml;g-von-Oben-Perspektive. Die Helden mu&szlig; man hintereinander
steuern, was oft zu Schwierigkeiten f&uuml;hrt, da sie sich zB an
T&uuml;ren gegenseitig im Weg stehen.</P>

<P>Je nach Rasse des Helden hat man eine bestimmte Anzahl von Schritten und
Aktionspunkten. Diese sind immer sehr schnell weg, da man st&auml;ndig nach
Fallen suchen mu&szlig;, und man pro Runde nur zweimal suchen kann.
Au&szlig;er dem Suchen nach Gegenst&auml;nden, Fallen und Geheimt&uuml;ren
hat man noch die M&ouml;glichkeit zu zaubern, eine Karte und einen
Inventory Bildschirm aufzurufen, T&uuml;ren zu &ouml;ffnen und
nat&uuml;rlich zu k&auml;mpfen.</P>

<P>Kommt es zum Kampf kann der Spieler nicht selber eingreifen, da auf
einen Extra Kampfscreen verzichtet wurde. Je nach Energiepunkten, welche im
Bildschirmbereich oben rechts angezeigt wird, und Kraft des Helden
entscheiden sich die K&auml;mpfe. Die Energie und die Aktionspunkte zum
zaubern kann man durch Zaubertr&auml;nke auff&uuml;llen. Diese gibt es
leider sehr selten und so sollte man schon auf die Energie aufpassen. Die
Gegner sind aber eher Opfer! H&ouml;chstens Hauptgegner, wie zB der Vampir
in der ersten Mission, stellen eine etwas gr&ouml;&szlig;ere Gefahr dar. Da
sollte man schon mit einem der &uuml;ber 20 Zauberspr&uuml;che rantrauen.
Stirbt so ein Hauptgegner bekommt man manchmal Bonusgegenst&auml;nde oder
Geld. An Geld kommt man noch durch Zufall oder durch das Ableben eines
Teammitgliedes. Stirbt ein Held kann man diesen nicht wiederbeleben und man
mu&szlig; sich zu dritt durchschlagen. Hat man alle Energiepunkte
verbraucht ist der Computer am Zug. Befinden sich Skelette, Mumien, Geister
oder andere Gegner in der N&auml;he eines Helden kommt es zum Kampf. Dieser
wird wieder durch die Eigenschaften des Helden entschieden.</P>

<P>So l&auml;uft das ganze Spiel weiter. Immer auf der Suche nach
Geheimg&auml;ngen, Fallen, Schl&uuml;sseln und den zwei Talismanen,
k&auml;mpft man sich durch W&auml;lder, S&uuml;mpfe, Schl&ouml;sser und
Gebirge.</P>

<P>Dies alles wird mit guter Grafik, einer perfekten Steuerung, guter Story
und Atmosph&auml;re presentiert. Die Animationen sind gut gelungen und die
Sound-FX kann man auch vertragen. Zudem unterst&uuml;tzt das drei Disketten
fassende Spiel ein Zweitlaufwerk und l&auml;&szlig;t sich auf Festplatte
installieren. Voraussetzung, um dieses wirklich gute Rollenspiel zu
spielen, ist der Speicherbedarf von mind. 1MB und eine Geldb&ouml;rse mit
ca. 70,- DM!</P>
</TD>
</TR>
</TABLE>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

