<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Die Siedler zum Zweiten</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="gam0">
<AREA shape="rect" coords="460,1,550,22" href="gam.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#0000FF">
<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>

<TR>
<TD>
<BR>

<H1 align="center"><B><FONT color="#FFFF00"></FONT></B></H1>
<BR>

<TABLE border="0" cellpadding="4" summary="" bgcolor="#FF63FF" width="80%" align="center">
<TR>
<TD>
<P>Der neue Strategiehit hei&szlig;t seit ca. 4 Monaten<BR>
</P>

<CENTER>
<FONT size="+1"><B>"Die Siedler".</B></FONT>
</CENTER>
<BR>
<BR>
                         

<P>Hinter dem einfachem Namen steckt eines der komplexesten Strategiespiele
&uuml;berhaupt. Das Intro, das sich auf der ersten von insgesamt 3 Disks
befindet ist toll gelungen. Die Grafik ist sauber und der Sound Klasse. Im
Hauptmen&uuml; kann man zwischen Trainings-, Missionen- oder
Freundschaftsspielen entscheiden. Es gibt eine breite Anzahl an
Computergegner, die verschiedene Eigenschaften besitzen. Diese wird man
w&auml;hrend den 30 Leveln herausfinden. Nun zum eigentlichen Spiel: Zu
Beginn findet man eine Landschaft aus Bergen, Wasser, W&uuml;ste und
Gr&uuml;n vor sich.</P>

<P>Nun kann man die &Uuml;bersicht f&uuml;r die Rohstoffvorkommen f&uuml;r
einen bestimmten Teil der Landschaft aufrufen. Der Indikator zeigt an ob,
z.B. viel Gold und wenig Eisen vorhanden ist. Hat man nun einen geeigneten
Platz gefunden, braucht man nur noch einen geeigneten Platz f&uuml;r seine
Hauptburg zu suchen. Hat man die Hauptburg erstellt, gehts erst richtig
los. Nun kann man Bauauftr&auml;ge f&uuml;r die einzelnen Geb&auml;ude im
Land verteilen. Man kann nun Geb&auml;ude bauen, wie: Wachh&uuml;tte,
Wachburg, Steinbruch, Schweinehof, M&uuml;hle, Rohstoffminen, Schmied oder
Lagerhallen und vielem mehr. Insgesamt sind es 36 Geb&auml;udearten und
viele Berufe f&uuml;r die Bev&ouml;lkerung.</P>

<P>Jetzt kann man Wege selbst mit der Maus bauen. Jedes Geb&auml;ude
mu&szlig; verbunden sein. Die Armee setzt sich aus verscheidenen Rittern
zusammen, die man herstellen mu&szlig;. Nach einiger Zeit wimmelt es nur so
von kleinen Leuten, die Waren transportieren, Ritter die k&auml;mpfen oder
Menschen, die ihren Beruf aus&uuml;ben. So sieht man z.B. wie ein Bauer auf
dem Feld erntet oder s&auml;t. Anglern kann man beim Fische fangen zusehen
und den Holf&auml;llern beim B&auml;ume f&auml;llen, wobei der F&ouml;rster
kleine B&auml;ume pflanzt, die auch richtig wachsen. Die Ger&auml;usche der
Arbeitenden sind t&auml;uschend echt. So h&ouml;rt man auch die
Hammerschl&auml;ge des Schmiedes oder Schlossers. Wer genug MB hat, kann
auch den V&ouml;geln beim zwitschern zuh&ouml;ren. Musik gibt es erst ab 2
MB. Je nach Menge des Fast Rams werden auch die Landschaften
gr&ouml;&szlig;er. Das Spiel kann auch zu zweit spielen. Man braucht dazu
zwei M&auml;use. Man kann entweder zu zweit gegeneinander spielen. Oder zu
zweit zusammen gegen die Computergegner.</P>

<P>Bewertung:</P>

<UL>
<LI>Grafik: Kaum besser zu machen!</LI>

<LI>Sound: Erst ab genug MB, aber top!</LI>

<LI>FX: Ein Genu&szlig;!</LI>

<LI>Handbuch: Sehr ausf&uuml;hrlich und verst&auml;ndlich!</LI>

<LI>Spielspa&szlig;: Zu zweit macht das Spiel s&uuml;chtig!</LI>

<LI>Gesamt: Ein w&uuml;rdiges "Spiel des Jahres"!</LI>
</UL>

<P>(Getestet von Andre Martini und Dominik Panten)</P>
</TD>
</TR>
</TABLE>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

