<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Texas Chainsaw</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="gam0">
<AREA shape="rect" coords="460,1,550,22" href="gam.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#9898DB">
<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>

<TR>
<TD>
<BR>

<H1 align="center"><B><FONT color="#FFFF00"></FONT></B></H1>
<BR>

<TABLE border="0" cellpadding="4" summary="" bgcolor="#CA00CA" width="80%" align="center">
<TR>
<TD>
<P align="center"><IMG src="gam10.gif" alt="" width="307" height="93"></P>

<P>Eigentlich br&auml;uchte ich gar keinen Test zu diesem Game schreiben,
den der Name dieses Spieles trifft genau auf das zu, was man dort zu tun
hat.Auf dem komerziellen Markt h&auml;tte dieses Spiel keine Chance, nicht
nur wegen der etwas d&uuml;rftigen Handlung, sondern wegen des blutigen
Inhalts den dieses teil zu bieten hat, w&auml;re es schon l&auml;ngst von
der BPS indiziert worden.</P>

<P>Zum Gameplay ist folgendes zu sagen: Man l&auml;uft mit einem Kerl names
Leatherface &uuml;ber ein Farmgel&auml;nde. Dies w&auml;re ja noch
vertretbar, aber leider hat Leatherface ein leicht gest&ouml;rtes
verh&auml;ltnis zum Farmleben. So l&auml;uft er mit seiner
blutverschmierten Motors&auml;ge &uuml;ber den Hof und m&auml;ht alles
nieder was sich bewegt, zum bedauern der Bewohner dieser Farm.</P>

<P>Doch auch f&uuml;r Leather.. ist das Farmleben nicht ganz einfach, den
der Treibstoffvorrat f&uuml;r seine Motors&auml;ge ist arg begrenzt. Aber
nach jedem f&uuml;nften "KILL" erscheint irgendwo auf dem etwas zu klein
geratenem Spielfeld ein Benzinkanister, so da&szlig; das Gemetzel
weitergehen kann. Da die Personen die dort rumlaufen nicht gerade die
Klugheit mit L&ouml;ffeln gefressen haben, ist es f&uuml;r den Spieler ein
leichtes den BODYCOUNT zu erh&ouml;hen, der am unteren Bildschirmrand neben
der Treibstoffanzeige steht.</P>

<P>Die Grafik ist schlicht und einfach geamacht, aber man kann immer noch
ziemlich gut erkennen, was aus den Leuten nach der begegnung mit der
Motors&auml;ge geworden ist.Das Spielfeld sieht man aus der
Vogelperspektive. Die Steuerung h&auml;tte auch besser geraten k&ouml;nnen,
den die eigene, aber auch die anderen Spielfiguren k&ouml;nnen nur
geradeaus, rechts oder links gehen. Die Soundkulisse ist da schon etwas
realistischer geraten. So h&ouml;rt man deutlich das r&ouml;hren der
Motors&auml;ge, oder das eindringen der selben in "MENSCHLICHES FLEISCH",
oder den Todesschrei der Leute. Dieses Teil ist also nichts f&uuml;r
schwache Nerven, sondern eigentlich nur etwas f&uuml;r HOBBYSADISTEN und
PSYCHOPHATEN.Das Teil findete ihr auf der Spielekiste Extra #18 und ist
&uuml;brigends Shareware!</P>

<P>Martin "CUBE" Dreisbach</P>
</TD>
</TR>
</TABLE>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

