<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Softwarmanager 2</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="gam0">
<AREA shape="rect" coords="460,1,550,22" href="gam.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#00FFBA">
<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>

<TR>
<TD>
<BR>
<BR>

<TABLE border="0" cellpadding="4" summary="" bgcolor="#CADBFF" width="80%" align="center">
<TR>
<TD>
<H3 align="center"><B>Spieletest zu SOFTWARE MANAGER von Kaiko</B><BR>
geschrieben von Norman Schlegel</H3>

<P>Zuerst mu&szlig; man mal positiv erw&auml;hnen, da&szlig; SM
Zusatzspeicher voll unterst&uuml;tzt, was meiner Meinung nach viel zu
wenige Programme tun.</P>

<P>Zuerst kommt ein gut gemachtes Intro, in dem ein junger Mann gerade von
seiner eigenen Software-Firma, einem schnellen Auto und nat&uuml;rlich von
Frauen und Geld tr&auml;umt. Ziel des Spiels ist es n&auml;mlich all diese
Tr&auml;ume war werden zu lassen...</P>

<P>Bis zu vier Leute k&ouml;nnen in diesem Spiel mitspielen. Spielt man mit
weniger Leuten oder gar alleine &uuml;bernimmt der Computer die restlichen
Firmen. Hat man sich einen Firmennamen ausgesucht und den Spielernamen
eingegeben kommt man auf den Hauptmen&uuml;schirm(was f&uuml;r ein Wort).
Hier sieht man, au&szlig;er dem Exit und dem Speichersymbol, noch sieben
andere Ger&auml;tschaften stehen...</P>

<P>Der Computer dient zum kommunizieren. Telefoniert man mit
Irgendjemanden, wird ein Bild des Gegen&uuml;ber, seine F&auml;higkeiten
sowie sein Name und die eventuelle Anstellung bei einer anderen Firma
angezeigt. Im Gespr&auml;ch kann man die begehrte Person
begr&uuml;&szlig;en, kritisieren, beleidigen, loben oder einen Smalltalk
f&uuml;hren. Ziel ist es, den Gegen&uuml;ber zum l&auml;cheln zu bringen
und ihn f&uuml;r sich zu gewinnen. Am Anfang reichen kleine Betr&auml;ge
zum locken, aber sp&auml;ter mu&szlig; man schon viel Kohle hinlegen um
einen Programmierer oder Musiker zu bekommen, besonders wenn er/sie bei
einer anderen Firma angestellt ist.</P>

<P>In der Zeitung, welche je nach Verkaufsmarkt anderst aussieht, findet
man Spieletests, die Top5, Kleinanzeigen, Werbung sowie Telefonnummern von
anderen Programmierern. Diese Telefonnummern werden dann in der...</P>

<P>... Datenbank abgelegt. Von hier aus ruft man Telefonnummern auf und
beginnt so ein Telefongespr&auml;ch. Au&szlig;erdem ist noch ein Kallender
in der Datenbank vorhanden.</P>

<P>Auf der Karte sind die Verkaufsm&auml;rkte angezeigt. Zu jedem Markt
gibt es eine Tabelle, in der angezeigt wird wie hoch die Nachfragen nach
den einzelnen Genres sind.</P>

<P>Auch die liebe Post wurde nicht vergessen. Hier bekommt man Rechnungen
und R&uuml;ckzahlungen von Banken und diversen Firmen. So kann es schonmal
vorkommen, das man eine Rechnung &uuml;ber eine Lieferung von Sexartikeln
bekommt, welche man "nat&uuml;rlich" nie bestellt hat.</P>

<P>Mit das Wichtigste ist das Joystiksymbol. Hier w&auml;hlt man seine
Konzepte aus. Es stehen Rollenspiele, Simmulationen, Strategiespiele sowie
Adventures zur Auswahl. Hat man ein Konzept gew&auml;hlt kann man dieses
auch testen. Am Anfang sind die Grafiken noch simpel und die
Sounduntermalung sieht nur ein paar Piepser vor. Im weiteren Verlauf des
Spiels werden diese Grafiken aber immer besser und sogar richtige
Musikst&uuml;cke kommen dazu. Nachdem man sein Spiel getestet hat, kommt es
zu einer Wertung, die mit einem Daumen und einem kurzen Kommentar
dargestellt ist. Auch hier entwickeln sich die Bewertungen von "Was
f&uuml;r ein Mist" bis zu "Wirklich Spitze". Das h&auml;ngt aber auch vom
Programmiererteam ab, welches man &uuml;ber das Symbol &Uuml;bersichten
einstellen kann.</P>

<P>In den &Uuml;bersichten kann man sich seine Finanzen ansehen, Konzepte
vergeben, L&ouml;hne bestimmen, festlegen welche Arbeiten die Angestellten
&uuml;bernehmen sollen (Musik, Grafik oder Programmierung)und den Vertrieb
regeln. Dort kann man dann bestimmen welche Verpackung und welcher Inhalt,
au&szlig;er dem Spiel, mitgeliefert werden soll. Um den Verkauf zu steigern
sollte, man auch Anzeigen schalten und Spieletest veranlassen. Das
Wichtigste beim Vertrieb stellt wohl die Release Funktion dar. Wenn man
genug Versionen eines Spiels bestellt hat kann man sich aussuchen auf
welchen Markt man das Spiel vertreiben will. Um die Kosten wieder
reinzubekommen sollte man aber auch nicht gerade unter 100DM f&uuml;r das
Spiel verlangen. Zu Begin des Spieles hat man nat&uuml;rlich nur einen
Markt zum Vertrieb frei. Mit dem Wachstum der Firma (und des Geldes
h&auml;, h&auml;) kommen dann aber neue M&auml;rkte dazu. So kann man dann
zB zwischen Gr&ouml;nland, S&uuml;d- und Nordamerika, Asien, Japan oder
Ru&szlig;land w&auml;hlen. Mit dem Aufstieg der Firma wird auch das Haus
gr&ouml;&szlig;er, indem man angefangen hat. Bei gutem Umsatzt hat man dann
einen eigenen Wolkenkratzer!</P>

<P>Ok, damit w&auml;ren eigentlich alles gesagt. Falsch, denn das h&ouml;rt
sich an wie jede beliebige Wirtschaftssimulation. Ist es aber nicht, denn
durch die tolle Grafik, die super Steuerung und die vielen Abwechslungen
wird das Spiel nie langweilig. Abwechslung gibt es reichlich. So kann man
zB den Preis f&uuml;r die beste Simmulation oder das beste Rollenspiel usw
gewinnen. Sind die Angestellten zufrieden mit ihnen, schenken sie ihnen
auch mal einen Porsche, aus der Portokasse. Durch die neuen
Verkaufsm&auml;rkte, die besseren Ergebnisse bei Testspielen und
Zeitungstests und der Anstieg des Bankkontos spurnen immer wieder neu an.
Es wurde zB sehr auf Details geachtet, denn einen annimierten Mauszeiger,
w&auml;hrend l&auml;ngerer Pausen, sieht man doch auch nicht alle Tage.
F&uuml;r Belustigung ist auch gesorgt, wenn man sich mal die Rechnungen
genauer durchliest (Kondome usw) oder ein Computergegner bankrott macht.
Spieletechnisch verbessern sich die Grafiken und Sounds und somit auch die
Testergebnisse. Im sp&auml;teren Verlauf des Spieles kann man sogar
Lizensen kaufen und diese Versoften!</P>

<P>Also dieses Spiel ist ein echter Erfolg f&uuml;r Kaiko! Besonderst die
kurzen Ladezeiten, des immerhin 3 Disketten fassenden Spieles, halten sich
durch Speicher- und Zusatzlaufwerkunterst&uuml;tzung(&lt;BOoohH ey!), sehr
kurz. Auch an die Festplattenbesitzer wurde gedacht.</P>

<P>Fazit: BEDINGUNGSLOS ZU EMPFEHLEN! (f&uuml;r Leute die nicht nur ballern
im Kopf haben!)</P>
</TD>
</TR>
</TABLE>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

