<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Interview</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="inh0">
<AREA shape="rect" coords="460,1,550,22" href="inh.html" alt="zum Inhalt">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#dd1010">
<TR>
<TD><IMG src="inh.gif" alt="" width="640" height="22" border="0" usemap="#inh0"> </TD>
</TR>

<TR>
<TD>
<H1 align="center"><B><FONT color="#ffff00">I n t e r v i e w</FONT></B></H1>

<H3 align="center"><B><FONT color="#ffff00">mit Jan Gei&szlig;ler</FONT></B></H3>
<BR>

<TABLE border="0" cellpadding="4" summary="" bgcolor="#bbbbc0" width="80%" align="center">
<TR>
<TD valign="top"><B>-?-</B></TD>

<TD>Hallo Jan! Wie gehts denn so ?</TD>
</TR>

<TR>
<TD valign="top"><B>Jan</B></TD>

<TD>Danke, gut. Und Dir? Lange nicht mehr gesehen!</TD>
</TR>

<TR>
<TD valign="top"><B>-?-</B></TD>

<TD>Die meisten User kennen Dich ja von Deinem Programm DiskPrint und den
ADM. Wie bist Du eigentlich auf die Idee gekommen, diese Programme zu
schreiben ?</TD>
</TR>

<TR>
<TD valign="top"><B>Jan</B></TD>

<TD>Eine allererste DiskPrint-Version entstand schon auf dem C64, als ich
ein Etikettprogramm f&uuml;r 3.5"-Disks brauchte, um Spielstand Disketten,
die ich immer wieder f&uuml;r "Matches" mit einem benachbarten Amiga-Freak
ben&ouml;tigte, zu etikettieren. Nachdem ich mir dann 1988 endlich den
gro&szlig;en Wunsch - einen A2000 -erf&uuml;llte, wuchs der
Diskettenbestand schnell an, und so war Bedarf f&uuml;r erste
Amiga-Versionen, die ich erst in Amiga-Basic, dann in Assembler
entwickelte.<BR>
<BR>
Als ich 1989 mit DiskPrint begann, gab es zwar schon einige
Etikettprogramme, aber entweder waren die auf einen speziellen Drucker
zugeschnitten, druckten h&auml;&szlig;liche Blockgrafiken oder
st&uuml;rzten st&auml;ndig ab. Au&szlig;erdem &auml;rgerte mich, da&szlig;
ich, wenn ich einem Freund Fishdisks kopierte, die Labels nochmals neu
einlesen mu&szlig;te - daher hatten schon die ersten Versionen von
DiskPrint die M&ouml;glichkeit, Etiketten auf Disk abzulegen.<BR>
<BR>
Die Idee zu AddressMaster (ADM) kam dann durch ab und zu eingehende
Registrierungen f&uuml;r DiskPrint und der Erkenntnis, da&szlig; deren
Verwaltung und der damit entstehende Briefverkehr mit den bis dahin
vorhandenen (Adre&szlig;-)programmen nur sehr umst&auml;ndlich m&ouml;glich
war. 1991 gab es einfach noch keine brauchbare Adre&szlig;verwaltung (oder
ich habe sie nicht entdeckt), die die deutsche Adre&szlig;form
unterst&uuml;tzte - von einem ARexx-Port ganz zu schweigen. Nun, und durch
viel "Feedback", also Vorschl&auml;ge und Bug-Reports, ist ADM zu dem
geworden, was es heute ist. (Was auch f&uuml;r DiskPrint gilt)</TD>
</TR>

<TR>
<TD valign="top"><B>-?-</B></TD>

<TD>Wie lange war eigentlich die
Entwicklungszeit der Programme ?</TD>
</TR>

<TR>
<TD valign="top"><B>Jan</B></TD>

<TD>Ganz schwer zu sagen. Wie gesagt, 1988/89 begann ich mit DiskPrint,
wobei die erste Version 1990/91 erschien. Mit ADM habe ich 1991 angefangen,
und die erste Version erschien Februar 1993. Da das aber keine
kontinuierliche Arbeit war (manchmal geschah einige Wochen gar nichts,
manchmal t&auml;glich 5 Stunden), ist die "Entwicklungszeit" schwer zu
bestimmen. Es stecken auf jeden Fall hunderte von Arbeitsstunden in jedem
der Programme...</TD>
</TR>

<TR>
<TD valign="top"><B>-?-</B></TD>

<TD>Wann kommt eine neue Version von Diskprint ?</TD>
</TR>

<TR>
<TD valign="top"><B>JAN</B></TD>

<TD>Wei&szlig; ich noch nicht. Ich programmiere gerade an einer v&ouml;llig
neu geschriebenen Version (in Oberon &amp; mit MUI), aber ein
Erscheinungstermin ist nicht bekannt, vor allem, weil ich momentan einfach
kaum Zeit zum Programmieren finde.</TD>
</TR>

<TR>
<TD valign="top"><B>-?-</B></TD>

<TD>Wo kann man eine Vollversion beziehen und wieviel SHAREWARE kosten
die?</TD>
</TR>

<TR>
<TD valign="top"><B>JAN</B></TD>

<TD>Die Vollversion gibt es selbstverst&auml;ndlich bei mir (Adresse: Jan
Gei&szlig;ler, Hermann-Rombach-Str. 17, 74321 Bietigheim-Bissingen, Tel.:
(07142) 43604). ADM und DiskPrint kosten jeweils DM 25,inkl. Porto. Wenn
man die Programme ausprobieren will: DiskPrint (V3.59) findet man auf Fish
844, ADM (V1.30) z.B. auf SaarAG 710.</TD>
</TR>

<TR>
<TD valign="top"><B>-?-</B></TD>

<TD>Und in welcher Programmiersprache ?</TD>
</TR>

<TR>
<TD valign="top"><B>JAN</B></TD>

<TD>DiskPrint ist bisher ganz in Assembler geschrieben, aber eine neue
Version in Oberon-2 ist in der Entwicklung. ADM ist in Oberon-2 und
Assembler erstellt.</TD>
</TR>

<TR>
<TD valign="top"><B>-?-</B></TD>

<TD>Hach dazu hab ich gleich mal ne Frage. Wie lernt man am besten
Programmiersprachen ?? Wo kann man dazu B&uuml;cher usw. bekommen ??</TD>
</TR>

<TR>
<TD valign="top"><B>JAN</B></TD>

<TD> Ich selber habe mir die Programmiersprachen selbst und anhand von
Quellcodes, die ich auf FD-Disks fand, beigebracht. Deutsche B&uuml;cher,
die wirklich etwas taugen, habe ich eigentlich nie gefunden. (f&uuml;r die
Assemblerprogrammierung habe ich fr&uuml;her die Intern-Bncher von DB
benutzt, aber von diesen rate ich heute eher ab, da sie viele Fehler
enthalten).<BR> <BR>
                         

<P>Es gibt eigentlich nur folgende "Pflichtlekt&uuml;re" f&uuml;r jeden
ernsthaften Amiga-Programmierer:<BR> </P>

<OL>
<LI>die ROM Kernel Reference Manuals ("RKMs") von Commodore (besonders die
drei RKMs "Libraries", "Devices" und "User Interface Style Guide"</LI>

<LI>das "Amiga Guru Book" von Ralph Babel (im Eigenverlag).</LI>
</OL>
Die B&uuml;cher sind zwar in Englisch, aber leicht verst&auml;ndlich und
f&uuml;r jeden Programmierer ein Mu&szlig;, da dort viele Informationen zur
sauberen Verwendung von Betriebssystemroutinen und Beispielsourcen zu
finden sind. </TD>
</TR>

<TR>
<TD valign="top"><B>-?-</B></TD>

<TD>Wann und wie hast Du angefangen zu programmieren ?</TD>
</TR>

<TR>
<TD valign="top"><B>Jan</B></TD>

<TD>"Trial &amp; Error", d.h. solange ausprobiert und in fremden Quellcodes
abgeschaut, bis es geklappt hat. Zugegebenerma&szlig;en eine harte und
fehleranf&auml;llige Methode... Ich unternahm am Anfang einige Gehversuche
in C, aber da damals kein Compiler unter 450 Mark zu bekommen war (es gab
noch keinen DICE), brachte ich mir Assembler selbst bei. Einige
Assemblerkenntnisse brachte ich schon vom C64 mit, wo ich schon einige
aufwendige Programme, z.B. eine Disco-Lichtanlagensteuerung, in einer
Mixtur aus Basic und Assembler geschrieben hatte.</TD>
</TR>

<TR>
<TD valign="top"><B>-?-</B></TD>

<TD>Was f&uuml;r einen Rechner hast Du jetzt und mit welchen hast Du
angefangen?</TD>
</TR>

<TR>
<TD valign="top"><B>Jan</B></TD>

<TD>Angefangen habe ich 1984 mit einem C64 und Datasette. Es folgte eine
Floppy, dann 1988 ein A2000 mit zwei Laufwerken, und mittlerweile ist
dieser (immer noch derselbe Rechner!) mit einer GForce-040/33 mit 8 MB Ram,
1 MB Chip, einer 340er-Platte, einer Syquest-88MB, einem Flickerfixer &amp;
einer Picasso-II/2, einem Toshiba3401-CD-Laufwerk, einem V32bis-Modem und
und OS3.1 ausger&uuml;stet...</TD>
</TR>

<TR>
<TD valign="top"><B>-?-</B></TD>

<TD>Du hast ja riesigen Erfolg mit Deinen Programmen gehabt und bist ja
noch ziemlich jung. Wie alt bist Du eigentlich und was sind Deine
sp&auml;teren Berufsziele ??</TD>
</TR>

<TR>
<TD valign="top"><B>Jan</B></TD>

<TD>Ich bin jetzt 20 Jahre alt und studiere Betriebswirtschaft im zweiten
Semester. Nach meine Diplom habe ich vor, irgendwo in die Computerindustrie
zu gehen, aber da bis dahin noch eine Menge Zeit ist, kann sich das ja noch
&auml;ndern...</TD>
</TR>

<TR>
<TD valign="top"><B>-?-</B></TD>

<TD>Was h&auml;ltst Du von Commodore ?</TD>
</TR>

<TR>
<TD valign="top"><B>Jan</B></TD>

<TD>Tja, ich bin der Meinung, da&szlig; Commodore eine
au&szlig;erordentlich f&auml;hige, begeisterte Entwicklungscrew aufgebaut
hat, die mit nur wenigen Leuten eines der besten Betriebssysteme im
PC-Bereich erstellt hat - sie haben etwas erschaffen, was Microsoft mit der
zehnfachen Besetzung vergeblich versucht.<BR>
<BR>
Schade nur, da&szlig; durch einige Marketing- und Managements&uuml;nden
vieles vers&auml;umt wurde und dadurch die Akzeptanz des Amigas allgemein
recht schlecht ist. Die Quittung daf&uuml;r liegt ja in der k&uuml;rzlich
bekanntgewordenen Liquidierung der Commodore-Holding vor, und es bleibt nur
zu hoffen, da&szlig; sich ein Investor findet, der Interesse an der
Weiterentwicklung des AmigaOS zeigt und die alte Entwicklungscrew
zusammenh&auml;lt, um das Betriebssystem auf der Basis der fast schon
fertigen AAA-Rechner weiterzuentwickeln und kr&auml;ftige Finanzen f&uuml;r
die Weiterentwicklung und das Marketing mitbringt. Meine gr&ouml;&szlig;te
Bef&uuml;rchtung ist, da&szlig; dieser Investor nur den Low-EndBereich
abdecken will und auf Konsolen abzielt - und damit den High-End-Bereich
fallen l&auml;&szlig;t.<BR>
<BR>
Naja, man wird sehen. Ich sehe jedenfalls der Zukunft positiv entgegen,
denn Commodore Deutschland hat sich im vergangenen Jahr ja gut gemacht, und
das Top-Management kann wirklich nur besser werden als das, was Eggebrecht
und Ali sich geleistet haben...</TD>
</TR>

<TR>
<TD valign="top"><B>-?-</B></TD>

<TD>Ich danke Dir auf jedem Fall mal f&uuml;r  das interessante Gespr&auml;ch.</TD>
</TR>

<TR>
<TD valign="top"><B>Jan</B></TD>

<TD>Vielen Dank auch. Viel Spa&szlig; weiterhin mit dem Amiga - und nicht
aufgeben!</TD>
</TR>
</TABLE>
<BR>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="inh.gif" alt="" width="640" height="22" border="0" usemap="#inh0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

