<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Purity #20 - #26</TITLE>
</HEAD>

<BODY text="#ffffff" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="pdl0">
<AREA shape="rect" coords="460,1,550,22" href="pdl.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#ffffff">
<TR>
<TD><IMG src="pdl.gif" alt="" width="640" height="22" border="0" usemap="#pdl0"> </TD>
</TR>

<TR>
<TD>
<TABLE border="0" cellpadding="4" summary="" bgcolor="#000000">
<TR>
<TD align="center"><IMG src="pdl2.gif" width="420" height="170" alt="Titel"></TD>
</TR>

<TR>
<TH>Purity #20</TH>
</TR>

<TR>
<TD><B>Rrequest:</B><BR>
Ein Includefile/Unit, da&szlig; je nach Betriebssystem und den vorhandenen
Libraries entweder den Arp-Filerequester oder den Asl-File Requester
&ouml;ffnet und wenn erw&uuml;nscht eine Fehlermeldung ausgibt. Der
Programmierer braucht sich um nichts mehr zu k&uuml;mmern.<BR>
Autor: Michael Klein</TD>
</TR>

<TR>
<TD><B>RGBDdecode</B><BR>
Zeigt, wie man die RGB Werte, die sich bei readrgb4 ergeben, in die Werte
decodiert, die man braucht, um sie z.b. mit Setrgb4 wieder zu verwenden.
Die Werte werden entweder aus der Preferencesstruktur, oder im anderen Fall
direkt aus dem Workbenchscreen gelesen und decodiert.<BR>
Autor: Michael Klein</TD>
</TR>

<TR>
<TD><B>Druckertest</B><BR>
Diese Unit bietet eine Routine zum Testen, ob Drucker online ist. {Beugt so
dem nervigen 'Printer Trouble'-Requester vor.}<BR>
Autor: Michael Klein</TD>
</TR>

<TR>
<TD><B>Cycle3</B><BR>
Ein Beispielprogramm, das zeigt, wie man einfacher Cyclegadgets verwaltet.<BR>
Autor: Michael Klein</TD>
</TR>

<TR>
<TD><B>Drucky V2.3</B><BR>
Tja, halt eine neue Version von Drucky, dem ultimativen
Druckeransteuerungsprogramm. ( Ich hab seit der anderen V2.3er Version noch
ein paar kleine Fehler entfernt ;-) {die andere V2.3er Version ist aber
offiziell nicht ver&ouml;ffentlicht worden -Hoffentlich - Michael)<BR>
Autor: Michael Klein</TD>
</TR>

<TR>
<TD><B>Rogerdat V2.25</B><BR>
Lang erwartet, jetzt endlich lieferbar, die neueste Version von Rogerdat
mit Men&uuml;f&uuml;hrung, der M&ouml;glichkeit, Datens&auml;tze zu suchen,
und anderen neuen Verbesserung. L&auml;uft auch unter den alten
Betriebssystemen !!!<BR>
Autor: Michael Klein</TD>
</TR>

<TR>
<TD><B>Gadunit</B><BR>
Eine Unit, die das Programmieren mit den dreidimensionalen Gadgets noch
einfacher macht. Beinhaltet alle n&uuml;tzlichen Funktionen, die man zur
Erstellung von dreidimensionalen Gadgets braucht.<BR>
Autor: Michael Klein</TD>
</TR>

<TR>
<TD><B>ColorCycling</B><BR>
Kleines Beispiel in PCQ-Pascal, wie man mit einfachen Tricks einen netten
Effekt erzielen kann.<BR>
Autor: Andreas Tetzl</TD>
</TR>

<TR>
<TD><B>Reset</B><BR>
Bindet einen in PCQ-Pascal geschriebenen Reset-Handler ein.<BR>
Autor: Andreas Tetzl</TD>
</TR>

<TR>
<TD><B>RevMaker</B><BR>
Ein Shareware-Hilfsprogramm vom PurityMag-Programmierer Bj&ouml;rn Schotte,
um vollautomatisch Revisionsheader f&uuml;r die eigenen Programme zu
erstellen.<BR>
Autor: Bj&ouml;rn Schotte</TD>
</TR>

<TR>
<TD align="right">"Diesel" Bernd K&uuml;nnen, 06.12.1993</TD>
</TR>

<TR>
<TH>Purity #21</TH>
</TR>

<TR>
<TD><B>Mod2Pas:</B><BR>
Mod2Pas konvertiert einfache Modula2-Quelltexte in solche f&uuml;r
Turbopascal. Ist in begrenztem Ma&szlig;e auch f&uuml;r die auf dem Amiga
&uuml;blichen Compiler n&uuml;tzlich.<BR>
Autor: Markus Uhlendahl</TD>
</TR>

<TR>
<TD><B>rAm:</B><BR>
Gibt im CLI die Gr&ouml;&szlig;e des freien Speichers aus und entspricht
damit CBMs avail.<BR>
Autor: Falk Z&uuml;hlsdorff</TD>
</TR>

<TR>
<TD><B>Dreig:</B><BR>
Dreig ist ein Beispiel zur Programmierung von dreieckigen ( oder auch
sonstwie geformten ) Gadgets.<BR>
Autor: Michael Klein</TD>
</TR>

<TR> <TD><B>FollowMouse:</B><BR>
&Ouml;ffnet ein Fenster mit zwei Augen, die die Bewegung des Mauszeiger verfolgen.<BR>
Autor: Kamran Karimi</TD>
</TR>

<TR>
<TD><B>Cheque_v1.0:</B><BR>
Diese Programm dient zum einfachen Bedrucken von Eurocheques. Es ist sehr
einfach gehalten, aber ein brauchbares Erstellen der Eintragungen ist
m&ouml;glich.<BR>
Autor: Falk Z&uuml;hlsdorff</TD>
</TR>

<TR>
<TD><B>RogerDatTools:</B><BR>
Zwei Tools von R&oslash;gers&oslash;ft, die in Verbindung mit dem
Datenbankprogramm 'RogerDat' ( siehe Purity #20 ) sehr n&uuml;tzlich sein
k&ouml;nnen.<BR>
Autor: Michael Klein</TD>
</TR>

<TR>
<TD><B>GadgetWorkshop:</B><BR>
Dieser Workshop setzt sich mit dem prinzipiellen Erstellen und Handhaben
von Gadgets auseinander.<BR>
Autor: Michael Klein</TD>
</TR>

<TR>
<TD><B>PCQ-Dokus:</B><BR>
Hier finden sich eine Kurzreferenz zu Pascal, geschrieben von Andreas
Neumann, sowie zwei von Stefan Grad ins Deutsche &uuml;bersetzte
Dokumentationen f&uuml;r PCQ-Pascal.</TD>
</TR>

<TR>
<TD align="right">"Diesel" Bernd K&uuml;nnen, 12.01.1994</TD>
</TR>

<TR>
<TH>Purity #22</TH>
</TR>

<TR>
<TD><B>Iff2Scr:</B><BR>
Dieses Programm konvertiert IFF/ILBM und ANIM Dateien in Includedateien
f&uuml;r Assembler und C. Diese k&ouml;nnen ohne gro&szlig;en Aufwand
(!!!!) in Pascal-Includes umgewandelt werden. Damit ist es nun ein
leichtes, Graphiken direkt in die eigenen Programe einzubinden. (Das
Programm stammt von einer &auml;lteren Fish.)<BR>
Autor: Jorrit Tyberghein</TD>
</TR>

<TR>
<TD><B>APrint V1.1:</B><BR>
Dieses Programm dient zur Verwaltung von bis zu 50 Anschriften.<BR>
Autor: Falk Z&uuml;hlsdorff</TD>
</TR>

<TR>
<TD><B>ASL (1):</B><BR>
Es handelt sich hierbei um ein kleines Programm welches einen eigenen
Screen &ouml;ffnet und einen ASL-File-Req auf diesem ablegt.<BR>
Autor: Falk Z&uuml;hlsdorff</TD>
</TR>

<TR>
<TD><B>Asl-File-Req (2):</B><BR>
In diesem Verzeichnis findet Ihr einen weiteren, voll
funktionst&uuml;chtigen Asl-Filerequester. Nachdem der von Maxon nicht auf
mein Canceln reagiert hat, hab ich den Fehler ausgebaut. Au&szlig;erdem
befinden sich noch zwei Kommentare im Sourcecode z.B. zum Pattern.<BR>
{ Falk, ich hoffe, das beantwortet Deine noch offene Frage ..?! }<BR>
Autor: Micha Klein</TD>
</TR>

<TR>
<TD><B>Cryptor:</B><BR>
Ein Tool zum Codieren von Dateien. Kann nur vom CLI/von der Shell aus
gestartet werden. Incl. Sourcecode.<BR>
Autor: Bj&ouml;rn Schotte</TD>
</TR>

<TR>
<TD><B>Greet:</B><BR>
Dieses Programm dient dazu, einen der Tageszeit angemessenen Gru&szlig; ins
CLI zu schreiben. Es kann NUR vom CLI aus gestartet werden, und wird mit
dem Parameter &lt;name&gt; aufgerufen:<BR>
Autor: Bj&ouml;rn Schotte</TD>
</TR>

<TR>
<TD><B>MagicBlank:</B><BR>
MagicBlank ist ein Screenblanker mit diversen weiteren N&uuml;tzlichkeiten.
Unter anderem bietet er gleich f&uuml;nf verschiedene Blankermodule an. {
Lines, Stars, Dots, ..}<BR>
Autor: Bj&ouml;rn Schotte</TD>
</TR>

<TR>
<TD><B>PPPclone:</B><BR>
Hier gehts um die powerpacker.library und wie man mit ihr Daten crunched
bzw. decrunched. In diesem Verzeichnis befinden sich zwei Programme: PPdemo
&amp; PPPclone. Ersteres zeigt auf, wie man im eigenen Programm mittels der
powerpacker.library Daten verarbeitet, das zweite ist schon ein
ausgewachsener PoerPacker-Clone, mit allen wichtigen Funktionen.<BR>
Autor: Michael Klein</TD>
</TR>

<TR>
<TD><B>PropGadTest:</B><BR>
Zeigt die Handhabung von Proportionalgadgets auf.<BR>
Autor: Bj&ouml;rn Schotte</TD>
</TR>

<TR>
<TD><B>RemDiskDrive:</B><BR>
Dieses Programm schaltet alle Laufwerke aus, und gibt den Speicher frei,
den sie belegt haben. Bei 2 Laufwerken fast 35 000 Bytes ! { Anm. von
Diesel - es wird nur das trackdisk. device entfernt, der von diesem
verwaltete Speicher bleibt belegt. }<BR>
Autor: Michael Klein</TD>
</TR>

<TR>
<TH>Hier sind noch ein paar Sachen f&uuml;r HiSoft Pascal User, die ich im
auf irgendeinem Server mal aufgetan habe. Leider ist f&uuml;r die
compilierten Programme Kick 3.0 notwendig - der Autor hat beim &ouml;ffnen
der Libraries Version 39 (Kick 3.0) als Papameter angegeben, obwohl 37
(Kick 2.0) oder sogar 34 (Kick 1.3) gereicht h&auml;tte. Die Sourcecodes
sind aber unter jeder Kickstart verwendbar. Ggf. mu&szlig; halt die
Versionsnummer in 34/37 ge&auml;ndert werden.</TH>
</TR>

<TR>
<TD><B>ClockUnit:</B><BR>
Erleichtert die Handhabung der Uhr, also das Auslesen etc.<BR>
Autor: Hans Luyten</TD>
</TR>

<TR>
<TD><B>IntuiWindow:</B><BR>
Demonstriert die Programmierung von Fenstern unter HS-Pascal.<BR>
Autor: Hans Luyten</TD>
</TR>

<TR>
<TD><B>SierPinski:</B><BR>
Demonstriert die Programmierung von einigen IntuitionFunktionen unter HS-Pascal.<BR>
Autor: Hans Luyten</TD>
</TR>

<TR>
<TD align="right">"Diesel" Bernd K&uuml;nnen, 19.01.1994</TD>
</TR>

<TR>
<TH>Purity #23</TH>
</TR>

<TR>
<TD><B>DesignerDemo:</B><BR>
Designer bietet die M&ouml;glichkeit, komplette Intuitionoberfl&auml;chen
zu schaffen und diese dann in Quellcode f&uuml;r wahlweise C oder HS-Pascal
umwandeln zu lassen.<BR>
Autor: Ian OConner</TD>
</TR>

<TR>
<TD><B>MessagePort:</B><BR>
Dieses HS-Pascal Beispiel zeigt die Abfrage von Messageports, z.B. um zu
pr&uuml;fen, ob ein Programm zum zweiten Mal gestartet wurde.<BR>
Autor: Hans Luyten</TD>
</TR>

<TR>
<TD><B>Scroller:</B><BR>
Wieder einmal ein in PCQ-Pascal erstellter Textscroller, um einiges
gegen&uuml;ber den Vorg&auml;nngern verbessert. Wer probiert den
n&auml;chsten ?<BR>
Autor: Andreas Tetzl</TD>
</TR>

<TR>
<TD><B>OS 2 Beispiele:</B><BR>
In diesem Ordner befinden sich ein paar Beispiele in Kickpascal zur
Programmierung von Intuitionoberfl&auml;chen unter Kickstart 2.0 .<BR>
Autor: Bj&ouml;rn Schotte</TD>
</TR>

<TR>
<TD><B>Tools:</B><BR>
Hier befinden sich einige n&uuml;tzliche Sachen vorwiegend f&uuml;r
Kickpascal-Programmierer, z.B. Funktionen zur Zeitabfrage, zur Nutzung der
arp.library etc.<BR>
Autor: Bj&ouml;rn Schotte &amp; Michael Klein</TD>
</TR>

<TR>
<TD align="right">"Diesel" Bernd K&uuml;nnen, 10.02.1994</TD>
</TR>

<TR>
<TH>Purity #24</TH>
</TR>

<TR>
<TD><B>BattClock:</B><BR>
In diesem Ordner befinden sich einige Units und passende Beipsiele zur
Abfrage der Zeitabfrage.<BR>
Autor: Falk Z&uuml;hlsdorff</TD>
</TR>

<TR>
<TD><B>Clouds:</B><BR>
Danny Amor hat eine neue Version von Clouds fertiggestellt. Clods berechnet
zufallsgenerierte Wolkenfelder, welche u.a. auch als iff-Datei
abgespeichert werden k&ouml;nnen.<BR>
Autor: Danny Amor</TD>
</TR>

<TR>
<TD><B>FileReq:</B><BR>
Wieder einmal eine Unit, die diverse Funktionen zur einfachen Handhabung
von FileRequestern bietet.<BR>
Autor: Bj&ouml;rn Schotte</TD>
</TR>

<TR>
<TD><B>DosDemo/ExAll:</B><BR>
Ein kurzes Programm, welches zur Demonstration von ExNext() alle Dateien im
Verzeichnis SYS: auflistet.<BR>
Autor: Andreas Tetzl</TD>
</TR>

<TR>
<TD><B>Giro:</B><BR>
Ein Programm zur Verwaltung des eigenen Kontostandes. Hand aufs Herz - wer
hat da wieder sein Konto &uuml;berzogen ??? =;)<BR>
Autor: Rainer Behrens</TD>
</TR>

<TR>
<TD><B>ScreenModeRequest:</B><BR>
Diese Unit erm&ouml;glicht es Kickpascal-Usern, den ScreenModeRequster der
WB 2.1 zu benutzen.<BR>
Autor: Bj&ouml;rn Schotte</TD>
</TR>

<TR>
<TD><B>SetNoClick:</B><BR>
Der Name sagt alles - dieses Tool schaltet das nervende Klicken der Floppys ab. <BR>
Autor: Bj&ouml;rn Schotte</TD>
</TR>

<TR>
<TD><B>RevMaker:</B><BR>
Die vermutlich letzte Version von RevMaker -dient zum Erstellen von
Copyright-Vermerken in eigenen Programmen. <BR>
Autor: Bj&ouml;rn Schotte</TD>
</TR>

<TR>
<TD><B>OS 2 Kurs:</B><BR>
Dieser Text erl&auml;utert, was es neues bei der Programmierung von
Intuitionoberfl&auml;chen unter Kickstart 2.0 gibt.<BR>
Autor: Bj&ouml;rn Schotte</TD>
</TR>

<TR>
<TD align="right">"Diesel" Bernd K&uuml;nnen, 15.02.1994</TD>
</TR>

<TR>
<TH>Purity #25</TH>
</TR>

<TR>
<TD><B>ChickenDat:</B><BR>
ChickenDat ist ein Beipiel aus der Praxis -eine Datenbank, aufbauend auf
'RogerDat', zur Verwaltung der daten einer H&auml;hnchenbraterei. In der
Anwendung selbst wohl nur f&uuml;r wenige brauchbar, in der Programmierung
aber sicher hilfreich f&uuml;r viele. Guten Appetit !<BR>
Autor: Ralf Behrens</TD>
</TR>

<TR>
<TD><B>Dynamic:</B><BR>
Ein Pascal/HS-Pascal Programm, zur Demonstration dynamischer
Daten/Speicherlisten. Der vorliegende Quellcode l&auml;uft auf der ST-Reihe
und MS-DOS PCs. Die compilierten Versionen f&uuml;r den Amiga laufen zwar,
h&auml;ngen sich aber irgendwann auf. Zur Anschauung ist der Quellcode aber
immer n&uuml;tzlich.<BR>
Autor: Hans Luyten</TD>
</TR>

<TR>
<TD align="right">"Diesel" Bernd K&uuml;nnen, 02.03.1994</TD>
</TR>

<TR>
<TH>Purity #26</TH>
</TR>

<TR>
<TD><B>Drucky V2.4</B><BR>
Drucky ist ein universelles, in KickPascal geschriebenes Druckprogramm mit
einfacher Bedienungsoberfl&auml;che und Nutzung von Steuersequenzen.<BR>
Autor: Michael Klein</TD>
</TR>

<TR>
<TD><B>FileReq</B><BR>
Eine universelle KickPsacal-Unit zur einfachen Handhabung der FileRequester
sowohl von arp.- als auch asl.library.<BR>
Autor: Bj&ouml;rn Schotte</TD>
</TR>

<TR>
<TD><B>MausPos</B><BR>
Eine KickPascal-Unit zur Positionierung des Mauszeigers via Programm.<BR>
Autor: Michael Klein</TD>
</TR>

<TR>
<TD><B>CDTV-Player</B><BR>
Ein in KickPascal geschriebenes Programm zum komfortableren Abspielen von
Audio-CDs auf dem Amiga CDTV. Ich konnte es leider -mangels CDTV - nicht
testen.<BR>
Autor: Daniel Amor</TD>
</TR>

<TR>
<TD><B>GoldEDmacroPCQ</B><BR>
In dieser Schublade befindet sich ein Arexx-Macro zur Verwendung mit dem
GoldED. Damit ist es m&ouml;glich, nach Einbinden in den GoldED direkt aus
dem Editor heraus Sourcecodes mit dem PCQ zu compilieren.</TD>
</TR>

<TR>
<TD align="right">"Diesel" Bernd K&uuml;nnen, 29.03.1994</TD>
</TR>
</TABLE>
</TD>
</TR>

<TR>
<TD><IMG src="pdl.gif" alt="" width="640" height="22" border="0" usemap="#pdl0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

