<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Onkelz</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="smt0">
<AREA shape="rect" coords="460,1,550,22" href="smt.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD><IMG src="smt.gif" alt="" width="640" height="22" border="0" usemap="#smt0"> </TD>
</TR>

<TR>
<TD>
<BR>

<H1 align="center"><B><FONT color="#FFFF00">Onkelz</FONT></B></H1>
<BR>

<TABLE border="0" cellpadding="4" summary="" bgcolor="#ACACBA" width="80%" align="center">
<TR>
<TD>
<P>Die Onkelz haben ein neues Album mit dem Titel "K&ouml;nige f&uuml;r
einen Tag" herausgebracht. Darauf befinden sich allerdings keine neuen
Titel, sondern es handelt sich bei diesem Album mehr um eine Sammlung
&auml;lterer St&uuml;cke.</P>

<P>Allerdings handelt es sich hierbei um KEIN Best-Of-Album! Ein Songs auf
der CD ist allerdings neu und auf keinem anderen Album zu finden, und zwar
"K&ouml;nige f&uuml;r einen Tag".</P>

<P>Hier eine Liste aller Songs, die auf der CD zu finden sind, und die
Angabe, auf welchem Album sie im Original zu finden sind:</P>

<TABLE border="1" summary="" align="center">
<TR>
<TH align="left">Titel</TH>

<TH align="left">Album</TH>
</TR>

<TR>
<TD>Leiden<BR>
Nekrophil<BR>
K&ouml;nige f&uuml;r einen Tag<BR>
Hast du Sehnsucht nach der Nadel<BR>
L&uuml;genmarsch<BR>
Freddy Kr&uuml;ger<BR>
Guten Tag<BR>
Tanz der Teufel<BR>
Religion<BR>
Ein guter Freund</TD>

<TD>Es ist soweit<BR>
Es ist soweit<BR>
-----<BR>
Es ist soweit<BR>
L&uuml;genmarsch<BR>
Kneipenterroristen<BR>
Kneipenterroristen<BR>
Kneipenterroristen<BR>
Kneipenterroristen<BR>
Kneipenterroristen</TD>
</TR>
</TABLE>

<P>Seit Anfang Oktober 1993 sind &uuml;brigens die beiden Platten
"Wei&szlig;es Album" und "Schwarzes Album" auf dem Markt
erh&auml;ltlich.</P>

<P>Wer Schwierigkeiten hat, die Tontr&auml;ger in den L&auml;den zu
bekommen, kann sie bestellen bei:</P>

<P>EMP Merchandising,<BR>
Postfach 1721,<BR>
40787 Lingen,<BR>
Tel: 0591-47982,<BR>
Fax: 0591-53236.</P>

<P>Hier wieder eine Liste aller Songs, die auf diesen beiden Alben zu
finden sind:</P>

<H3 align="center"><B><U>Wei&szlig;es Album:</U></B></H3>

<P>Lieber stehend sterben; Entfache dieses Feuer; Das Wunder der
Pers&ouml;nlichkeit; Fahrt zur H&uuml;lle; Alles F.A.M.; Willkommen;
F&uuml;r immer; Deutschland im Herbst; Es; Sie hat 'nen Motor; Tribute to
Stevie; Sch&ouml;ne neue Welt.</P>

<H3 align="center"><B><U>Schwarzes Album:</U></B></H3>

<P>Erkennen Sie die Melodie; Wenn wir einmal Engel sind; So geht's Dir
(Deine H&ouml;lle); Der Himmel kann warten; Ich bin wie ich bin; Das Messer
und die Wunde; 1000 Fragen; Ich bin Du; Worte der Freiheit; Das R&auml;tsel
des Lebens; Baja (Instrumental).</P>

<H3>Folgende Onkelz-Alben sind schon l&auml;ngere Zeit
erh&auml;ltlich:</H3>

<H3 align="center"><B><U>Onkelz wie wir...:</U></B></H3>

<P>Onkelz wie wir; Von Glas zu Glas; Erinnerungen; Bomberpilot; Dick +
Durstig; Falsche Propheten; Am Morgen danach; Sch&ouml;ner Tag; Heut Nacht;
! (Instrumental).</P>

<H3 align="center"><B><U>Wir ham' noch lange nicht genug:</U></B></H3>

<P>Wir ham' noch lange nicht genug; Eine dieser N&auml;chte; Das ist mein
Leben; Nur die Besten sterben jung; Ganz egal; Zieh' mit den W&ouml;lfen;
Zeig'&nbsp;mir den Weg; Das Erste Blut; Wieder mal 'nen Tag verschenkt;
Ach, Sie suchen Streit; 3'52 (Instrumental); Wir sind immer f&uuml;r euch
da; Wir sind nicht allein; Lt. Stoned (Instrumental).</P>

<H3 align="center"><B><U>Heilige Lieder:</U></B></H3>

<P>Intro Oratorium; Heilige Lieder; Buch der Erinnerung; Nenn' mich wie Du
willst; Ich bin in Dir; Schei&szlig;egal; Diese Lieder...; Gestern war
heute noch morgen; Schlie&szlig;e Deine Augen (und sag mir was Du siehst);
Gehasst, verdammt, verg&ouml;ttert; Ein langer Weg; Noreia; Der Schrei nach
Freiheit; Angst ist nur ein Gef&uuml;hl; Wir schreiben Geschichte.</P>

<H3 align="center"><B><U>B&ouml;se Menschen - B&ouml;se
Lieder:</U></B></H3>

<P>Heute trinken wir richtig; Das Signum des Verrats; Stunde des Siegers;
Was kann ich denn daf&uuml;r; Ein Mensch wie Du und ich; Keiner wusste
wie's geschah; H&auml;sslich, Brutal und Gewaltt&auml;tig; Nennt mich Gott;
7 Tage ohne S&uuml;nde; Hass.</P>

<H3 align="center"> <B><U>Kneipenterroristen:</U></B></H3>

<P>Kneipenterroristen; Religion; Lack + Leder; So sind wir; Tanz der
Teufel; 28 (Instrumental); Guten Tag; Nie wieder; Freddy Kr&uuml;ger; Ein
guter Freund.</P>

<H3 align="center"><B><U>Es ist soweit:</U></B></H3>

<P>10 Jahre; Nekrophil; Wilde Jungs; Nichts ist f&uuml;r die Ewigkeit; Wenn
Du einsam bist; Keine ist wie Du; Hast Du Sehnsucht nach der Nadel;
Paradies; Das Leben ist ein Spiel; Es ist soweit; Leiden.</P>

<H3 align="center"><B><U>Live in Vienna:</U></B></H3>

<P>Intro 3'52 (Instrumental); Wir ham' noch lange nicht genug; 10 Jauhre;
Kneipenterroristen; Signum des Verrats; Interview-Block 1; Wilde Jungs; Das
ist mein Leben; Nie wieder; Interview-Block 2; Zieh'&nbsp;mit den
W&ouml;lfen; Lack und Leder; Mexico; Interview-Block 3; Wieder mal 'nen Tag
verschenkt; Zeig mir den Weg; So sind wir; Ach, Sie suchen Streit; Eine
dieser N&auml;chte; Interview-Block 4; Ich lieb' mich.</P>

<P>Es gibt auch noch einige Onkelz-Alben, die ANGEBLICH rechtsradikale
Texte beinhalten sollen. Da diese indiziert wurden, darf ich hier die
richtigen Titel nicht nennen. Ich wende deshalb hier eine Methode an, wie
sie oft in der "ASM" benutzt wurde. Hier die CD-Titel ein wenig
abge&auml;ndert:</P>

<H3 align="center"><B><U>"Friday Night/Mexico":</U></B></H3>

<P>Hier ein paar Titel (wieder abge&auml;ndert): Germany; Freebeer; Singen
und Tanzen (nicht indiziert); Dance on your Grave; Alcohol (indiziert ?);
Mexico (nicht indiziert).</P>

<H3 align="center"> <B><U>"Ugly":</U></B></H3>

<P>Hier wiederum ein paar Titel, nat&uuml;rlich wieder abge&auml;ndert, da
ich ungerne mit der BPS etwas zu tun haben m&ouml;chte): Football +
Voilence; Girl; Evil Uncles; Ugly.</P>

<P align="right">CHRISTIAN HEITZER</P>
</TD>
</TR>
</TABLE>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="smt.gif" alt="" width="640" height="22" border="0" usemap="#smt0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

