<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Amiga &amp; PC</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="smt0">
<AREA shape="rect" coords="460,1,550,22" href="smt.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#631010">
<TR>
<TD><IMG src="smt.gif" alt="" width="640" height="22" border="0" usemap="#smt0"> </TD>
</TR>

<TR>
<TD>
<BR>

<H1 align="center"><B><FONT color=
"#FFFF00">"Amiga gegen PC" ?</FONT></B></H1>

<H3 align="center"><B><FONT color="#FFFF00">Der riskante Text<BR>
[Axel Melzener]</FONT></B></H3>
<BR>

<TABLE border="0" cellpadding="4" summary=""
bgcolor="#0073AC" width="80%" align="center">
<TR>
<TD>           
<P>In einer der letzten Ausgaben dieses Magazins habe ich die Texte
gelesen, die sich mit dem ewigen Kampf des Amiga gegen den PC
besch&auml;ftigen. Und ich mu&szlig; sagen, da&szlig; die meisten
&Auml;u&szlig;erungen, die hier losgelassen wurden, v&ouml;llig unfundiert
waren.</P>

<P>Ich selbst befinde mich in der Situation, beide Rechnersysteme (Amiga
1200 und i486SX-25) zu besitzen und auch intensiv zu benutzen. Nach
anf&auml;nglichen Problemen mit dem PC habe ich auch diesen Computer
sch&auml;tzen gelernt und denke, er ist in vielen Bereichen weiter als der
Amiga! Die, die mich kennen, wissen, da&szlig; ich mich f&uuml;r den Amiga
und dessen Erhaltung einsetze, aber ich mu&szlig; dem PC der Fairness
halber doch viele Vorteile einr&auml;umen. Er hat sich in den letzten
Jahren sehr gut entwickelt.</P>

<P>Ich m&ouml;chte darauf hinweisen, da&szlig; der folgende, sehr lange
Text, nur meine eigene Meinung wiedergibt und durch und durch subjektiv
ist. Er ist stellenweise sogar absichtlich provokativ, um die Diskussion
anzuheizen. Ich habe aber versucht, weder zu l&uuml;gen, noch anderswie die
Unwahrheit zu sagen, sondern meine Argumentation auf Fakten zu
st&uuml;tzen. Die Sachlichkeit ist also gewahrt.</P>

<P>Es sei mir geg&ouml;nnt, da&szlig; ich hier einmal ganz extrem F&Uuml;R
den PC spreche, da ich mich als eine Art `Anwalt` f&uuml;r ihn sehe, wenn
er in einem Amiga-Mag widerspruchslos und feige `niedergemacht` werden
soll! Es ist also eine Gegendarstellung, die ich so schreiben w&uuml;rde,
wenn ich ein reiner PC-User w&auml;re! Mein Herz schl&auml;gt aber f&uuml;r
den Amiga ;-))</P>

<P>Ich will damit beginnen, ein paar typische Vorurteile gegen den PC
auszur&auml;umen, die meist von gefrusteten Amiga-Usern in die Welt gesetzt
werden. Und bitte, lest erstmal alles durch, denkt dann dar&uuml;ber nach,
und schreibt ERST DANN Eure Meinung. Geht einmal objektiv an das Thema
heran und gestattet dem PC seine Vorteile!</P>

<H3>1. "Der PC ist viel teurer, und der Amiga hat ein viel besseres
Preis/Leistungs-Verh&auml;ltnis."</H3> Das ist nat&uuml;rlich v&ouml;lliger
Unsinn. Sicher. Du kannst Dir einen Amiga 1200 ohne Festplatte,
Zweitlaufwerk, Uhr und Monitor f&uuml;r rund 600 DM kaufen. Die Frage ist
dann blo&szlig;, was Du mit so einem nackten, an sich v&ouml;llig nutzlosen
System machen willst, au&szlig;er Spiele zu zocken!

<P>Rechnen wir mal nach. Das Bild am Fernseher ist zu flimmerig, also
mu&szlig; ein Monitor her. Den bekommt man so je nach Qualit&auml;t
f&uuml;r 400-600 DM. Ach ja, und wenn wir richtig arbeiten wollen, brauchen
wir eine Festplatte, m&ouml;glichst 2"5 IDE, um den 1200er richtig
auszunutzen. Das w&auml;ren f&uuml;r eine 120 MB-Platte dann auch nochmal
etwa 500 DM. Und ein Zweitlaufwerk zum Diskettenkopieren? Na, warum nicht.
Also nochmal 200 DM. Und eine Hardware-Uhr f&uuml;r knapp 40 DM mu&szlig;
auch noch rein, denn die hat Commodore nat&uuml;rlich aus Versehen
vergessen ("Was? Eine Uhr wollen Sie f&uuml;r den Preis auch noch?").</P>

<P>Software mu&szlig; nat&uuml;rlich auch noch sein! Sicher, die Workbench
(mit Arexx) ist schon dabei. Aber das ist ja auch alles. Also, noch 1-2
Spiele, eine Textverarbeitung und ein paar andere Programme kaufen. Das
schl&auml;gt dann nochmal so mit 150 DM f&uuml;r ein "Software-Bundle" zu
Buche, welches nur im Zusammenhang mit dem Kauf des Computers erstanden
werden kann.</P>

<P>Z&auml;hlen wir nun alles zusammen, was eine &gt;echte&lt; Amiga-Anlage
ausmacht, die auch wirklich etwas taugen soll, mit der man auch etwas
anfangen kann, kommen wir im Durchschnitt zu folgendem Ergebnis:</P>

<PRE>
 A 1200             600 DM
 Software-Bundle    150 DM
 120 MB-Festplatte  500 DM
 Uhr                 40 DM
 Monitor            500 DM
 Zweitlaufwerk      200 DM
 -------------------------
                   1990 DM
                   -------

 A 4000            1800 DM
 (Rest)            1290 DM
                   -------
                   3190 DM &lt;- !!!

</PRE>

<P>F&uuml;r diesen stolzen Preis (von wegen, der Amiga ist `billig`)
bekommen wir ein akzeptables Ger&auml;t (1200er) f&uuml;r Heinanwender mit
geringen Anspr&uuml;chen; f&uuml;r 3000 DM die Profi-Anlage. Ich
verf&uuml;ge in etwa &uuml;ber das gleiche System, wie es oben aufgelistet
ist; aber mich hat es noch etwas mehr gekostet, da die Preise in einem Jahr
nat&uuml;rlich ziemlich gefallen sind.</P>

<P>Wenden wir uns nun dem PC zu und betrachten wir eine "DOSe" in dieser
Preisklasse. Mir liegt hier eine Anzeige des US-Discounters "Building
Block" vor, der in Deutschland einen PC in folgender Konfiguration
verkauft:</P>        
<PRE>
 
 i386DX 40 Mhz
 Minitower-Geh&auml;use
 4 MB RAM
 VGA Grafik (1024 x 768)
 3,5" 1,44 MB Floppy
 2 x Seri., 1 x Par, 1 x g:
 MF2 komp. Tastatur
 250 MB Festplatte
 14" Color Monitor (MPR2 Norm)
 --&gt; 1878 ,-
 -----------

</PRE>

<P>Dieser Computer ist genau 112 DM billiger als das oben beschriebene
Amiga-System, und bietet unbestreitbar mehr: Doppelt soviel RAM, mehr als
doppelt soviel Festplattenkapazit&auml;t, einen Prozessor, der
unbestreitbar schneller ist als ein MC 68EC020 (welcher nichtmal &uuml;ber
eine FPU &amp; MMU verf&uuml;gt!), einen strahlungsarmen Monitor und eine
HD-Floppy (die bei allen anderen ernstzunehmenden Computersystemen
<B>Standard</B> ist, nur beim Amiga nicht.)</P>

<P>Man sieht also: Beim PC kriegt man ein Profi-System zu
Anf&auml;nger-Preisen, sogar gemessen am Preis-Standard des Amiga!</P>

<P>Andere Handelsketten wie VOBIS bieten ebenfalls preiswerte PC`s zu
&auml;hnlichen Preisen und legen au&szlig;erdem noch ein beachtliches
St&uuml;ck Software obendrauf. Und dabei sind wir direkt beim n&auml;chsten
Vorurteil.</P>

<H3>2. "Die ganzen PC-Handelsketten wie VOBIS bieten nur Schrottrechner an,
und die Verk&auml;ufer erz&auml;hlen meist nur Unsinn."</H3>

<P>Ein weiteres Vorurteil entt&auml;uschter Amiga-User, die niemals
verwinden konnten da&szlig; Vobis ihren Rechner 1992 aus der Produktpalette
genommen hat, ist obiges.</P>

<P>Leider ist dies mal wieder v&ouml;llig aus der Luft gegriffen! Die
renommierte und traditionsbewu&szlig;te Computerzeitung "CHIP" zeichnete
k&uuml;rzlich 3 Highscreen-PC`s, die bekanntlich von VOBIS vertrieben
werden, als `klassenbeste` gegen Compaq- und Escommodelle aus. VOBIS kommt
die geb&uuml;hrliche Anerkennung zuteil, erstmals einen Pentium-PC unter
die Preisschwelle von 5.000 DM (!) gebracht und somit einem gro&szlig;en
Publikum zug&auml;ngig gemacht zu haben!</P>

<P>Mein 486er ist auch ein "Vobis-Billigteil", und ich hatte bis jetzt noch
niemals Probleme damit. Nichts konnte ich daran finden, was den Preis nicht
gerechtfertigt h&auml;tte! Weder die exzellente 24 Bit-Grafikkarte von
Spea, noch die Conner-Festplatte, noch das HippoCom-Motherboard, noch die
ISA-Systemarchitektur konnten mich verleiten, jemals etwas schlechtes
&uuml;ber VOBIS zu sagen! Alles l&auml;uft so, wie es mu&szlig;, und zwar
ohne die geringste Andeutung einer Fehlfunktion.</P>

<P>Au&szlig;erdem sind die Verk&auml;ufer dort durchaus kompetent, und
keine Trottel, wie sie immer in Amiga-Magazinen hingestellt werden.
Zumindest in unserer &ouml;rtlichen VOBIS-Filiale befinden sich Leute, die
in der Lage sind, dem Einsteiger hilfreiche Tips zu geben; die das
gew&uuml;nschte System wirklich nach den Bed&uuml;rfnissen des Anwenders
und nicht vom Standpunkt des Gewinnes f&uuml;r ihre Firma gestalten, und
sich au&szlig;erdem in Sachen HardwareErweiterungen erstaunlich gut
auskennen!</P>

<P>Um das klarzustellen: Ich werde von VOBIS nicht daf&uuml;r bezahlt,
da&szlig; ich hier solche Meinungen vertrete; ich finde es blo&szlig;
ungerecht, wie diese Handelskette oft von Leuten heruntergemacht wird, die
gar nicht wissen, wovon sie reden.</P>

<H3>3. "Der Amiga ist viel besser f&uuml;r Einsteiger geeignet, da er
weniger Probleme in der Bedienung mit sich bringt."</H3>

<P>Eine der gr&ouml;&szlig;ten L&uuml;gen, die ich jeh geh&ouml;rt habe! In
Sachen Service, Dokumentation und Beratung ist der Amiga f&uuml;r mich das
r&uuml;ckst&auml;ndigste System. Nicht nur, da&szlig; Commodore bei den
Anfang 1993 ausgelieferten 1200ern das DOS- und Arexx-Handbuch `vergessen`
hat, was ja wohl deutlicher als kaum etwas anderes &gt;gegen&lt;
Einsteigerfreundlichkeit spricht; nein, in Sachen Reparatur und
Hilfestellungen hat man auch nichts als &Auml;rger.</P>

<P>Commodore bietet ja nichtmal eine offizielle Hotline, die Fragen zum
Amiga beantwortet! Geschweige denn einen vern&uuml;nftig arbeitenden
Reparaturdienst. Commodore hat es ja eine zeitlang nicht einmal f&uuml;r
n&ouml;tig gehalten, Ersatzteile an seine Fachh&auml;ndler auszuliefern!
Das ist doch wohl nur <B>peinlich</B> und spricht ganz klar GEGEN den Kauf
eines Amigas.</P>

<P>Wenn ich mich selbst frage, was ich tun w&uuml;rde, wenn ein Teil an
meinem Amiga kaputtgehen w&uuml;rde, st&auml;nde ich erstmal ratlos da. Und
was w&uuml;rde ich tun? Den Rechner zu dem Laden bringen, bei dem ich ihn
gekauft habe. Die schicken ihn f&uuml;r viel Geld an Commodore, wenn sie zu
dumm sind, um den Fehler zu finden - und bei Commodore steht das Teil dann
2 Monate rum, man r&uuml;ckt es erst nach mehrmaligem Nachfragen wieder
raus ("Ach, das ist Ihr Rechner? Wir hatten ihre Adresse nicht mehr.")...
Hat es alles schon gegeben.</P>

<P>Umst&auml;ndlicher und r&uuml;ckst&auml;ndiger geht es doch wohl
kaum.</P>

<P>Ganz anders beim PC. PC zur Filiale, Fehler beschreiben. Geringer Preis
f&uuml;r das Ersatzteil, nach wenigen Tagen hole ich das Ding ab, alles
l&auml;uft wieder prima und ich mu&szlig;te weder viel Geld bezahlen, noch
viel Zeit daf&uuml;r opfern. In jedem noch so kleinen Dorf funktioniert
das, denn &uuml;berall hat sich irgendeine PC-Handelskette breitgemacht.
Marktm&auml;&szlig;ig werden die Commodore-L&auml;den von den PC-Discounter
plattgemacht wie die Fliegen! Wer m&ouml;chte das bestreiten???</P>

<P>Oder mal angenommen, ich will meinen Amiga wirklich gut kennenlernen.
Die Handb&uuml;cher bieten mir kaum Infos. Professionelle Amiga-B&uuml;cher
werden nur noch selten im &ouml;rtlichen Fach-Handel verkauft. Also
mu&szlig; ich mir durch Ausprobieren oder Nachfragen bei Bekannten alles
selbst beibringen - auf dem PC werden aber Benutzerkurse, z.B. von der
Volkshochschule, angeboten, wo man lernt, mit seinem Rechner umzugehen.
F&uuml;r den Amiga gibt es solche offiziellen Kurse nicht. Dies beweist,
da&szlig; der Amiga von der Allgemeinheit nicht ernstgenommen und immer
noch als Spielcomputer abgestempelt wird. Und das mu&szlig; ja irgendwo
auch Gr&uuml;nde haben, nicht?</P>

<P>Alle diese Fakten zeigen doch <B>offensichtlich</B> das der Amiga-User
mit seinem System v&ouml;llig alleingelassen wird. Wenn es die ganzen
Zeitschriften und Clubs nicht g&auml;be, die den gefrusteten Usern helfen,
h&auml;tte der Amiga-Benutzer <B>niemanden</B>, an den er sich mit offenen
Fragen wenden k&ouml;nnte! Oder?</P>

<P>Im Kontrast dazu die PC-Handelsketten: Schnell und kompetent werden
Fragen beantwortet, und gekaufte Hardware-Erweiterungen werden gleich als
kostenloser Service eingebaut und konfiguriert. Ein Ersatzteil? Kann in
drei Tagen da sein! Eine 24 h-Hotline f&uuml;r alle Probleme? Gibt es
f&uuml;r alle Systeme, meist von der Herstellerfirma organisiert. Nur bei
Commodore/Amiga ist es nicht so...</P>

<P>Auch die mit dem PC ausgelieferte Dokumentation ist unbestreitbar
aufschlu&szlig;reicher. Bekomme ich beim Amiga gerade mal drei-vier
d&uuml;nne Heftchen, die nur sp&auml;rliche Infos &uuml;ber das System
vermitteln; wird beim PC jede Frage zu MS DOS oder WINDOWS geduldig von den
sehr dicken und gut strukturierten Handb&uuml;chern gekl&auml;rt; die
Hauptplatine wird in allen Einzelheiten beschrieben, in der Anleitung zur
Grafik- und Soundkarte sind sogar umfangreiche Programmiertips und
Hardware-Infos dabei. Wo, bitte sehr, erf&auml;hrt denn der Amiga-User
etwas <B>genaues</B> &uuml;ber sein Grafik-Chipset? Oder gar &uuml;ber
seinen Soundchip? Ich glaube, da&szlig; es gerade dieser von Commodore
verschuldete Mangel an Informationen ist, der viele Leute dazu gebracht
hat, den Amiga als unausgereiftes Spiele-Systemchen zu sehen.</P>

<P>Will man seinen Amiga richtig dokumentiert haben, mu&szlig; man meist
auf dicke und teure W&auml;lzer von Drittautoren zur&uuml;ckgreifen;
vorausgesetzt, man findet &uuml;berhaupt ein Gesch&auml;ft, das
Amiga-B&uuml;cher verkauft...</P>

<P>Also, seid mal ehrlich mit euch: Wenn ihr ein blutiger Anf&auml;nger
w&auml;hret, der sich weder mit Hard- noch mit Software richtig auskennt
und so auf sehr umfangreiche Informationen angewiesen ist, w&uuml;rdet ihr
dann einen Amiga oder einen PC kaufen? Ich glaube, jeder Verk&auml;ufer,
der die Wahl h&auml;tte, dieser Person einen Amiga &gt;oder&lt; PC
anzudrehen, w&uuml;rde zum PC raten, und damit bin ich v&ouml;llig
einverstanden.</P>

<P>Ich behaupte also: Der Amiga ist schlecht dokumentiert, und deshalb ist
der PC ganz klar das System, das f&uuml;r <B>Einsteiger</B> besser geeignet
ist.</P>

<H3>4. "Der PC kann ja noch nicht einmal Multitasking!"</H3>

<P>V&ouml;lliger Fehlschlag. Multitasking wurde sogar auf dem PC erfunden
(!), und zwar unter dem Betriebssystem UNIX (welches erst 1989 mit dem A
3000 U seinen Weg auf den Amiga fand). Multitasking h&auml;ngt in erster
Linie vom verwendeten Prozessor ab, erst in zweiter vom
Betriebssystem!!!!</P>

<P>Richtig ist zwar: Bei WINDOWS klappt das Multitasking mehr schlecht als
recht und MS DOS hat gar keines, aber beim PC hat man (im Gegensatz zum
Amiga) wenigstens die M&ouml;glichkeit, auf andere Betriebssyteme
zur&uuml;ckzugreifen, z.B. OS/2, UNIX, LINUX, SUN-OS, NOVELL DOS und viele
andere, die die sehr ausgereiften aber leider selten genutzen
Multitaskingf&auml;higkeiten des 386/486ers richtig ausnutzen. Und beim
Amiga? Nur AmigaDOS/ Workbench. Eint&ouml;nigkeit pur. Was, bitte, soll
daran toll sein?</P>

<P>Sieht man die professionellen Operating Systems am PC, beispielsweise
das mittlerweile sehr popul&auml;re "LINUX", das &uuml;brigens Shareware
ist, kann man selbst als Amiga-User und Workbench-Fetischist noch staunen.
Virtuelle Bildschirme (am Amiga nicht m&ouml;glich) tummeln sich mit 24
Bit-Hintergrundbildern (Workbench: Max. 256 Farben) ohne
Geschwindigkeitsverlust. Und das auf einem `lahmen` i486SX-25.</P>

<P>Netzwerkf&auml;higkeit, bei der Workbench ein Fremdwort, geh&ouml;rt
hier zum normalen Umgang. "Object Linking and Embeding" und "Automatische
Fileverkn&uuml;pfung" geh&ouml;ren sogar auf dem `schwachen` Windows schon
zum Standard. Nichts dergleichen am Amiga.</P>

<P>Ebenfalls &auml;rgerlich beim Amiga: L&auml;uft ein Programm fehlerhaft,
st&uuml;rzt der ganze Rechner ab; mit allen wertvollen Tasks. Das kennt
sicher jeder von uns. LINUX auf dem PC hingegen ist 99% Crash-Sicher - das
hei&szlig;t, es kann nicht abst&uuml;rzen; ein Programm kann die anderen
nicht zum "Guru" bringen. Schwer vorzustellen, aber laut Linus T.,
Programmierer von LINUX, sollte "jedes moderne 32-Bit-Betriebsystem heute
absturzsicher sein". Auf dem Amiga wohl mal wieder nicht der Fall...</P>

<P>Und die Amigianer denken, die Workbench sei das Ma&szlig; aller Dinge.
Dar&uuml;ber kann man bei genauerem Nachdenken doch nur Lachen! Gut: Das
Multitasking ist tadellos! Aber was wird dar&uuml;ber hinaus geboten?</P>

<H3>5. "Wenigstens auf dem Spielemarkt ist der Amiga dominant!"</H3>

<P>Nat&uuml;rlich auch falsch. Der PC hat den Amiga in Sachen Spiele schon
lange &uuml;berrundet. CD ROM-Games sind hier schon fast Standard - und
f&uuml;r den Amiga 1200/4000 ist &gt;jetzt&lt; erst das CD ROM-Laufwerk
herausgekommen! Leider zu sp&auml;t! Traurig, wie man hier dem PC
hinterherl&auml;uft.</P>

<P>Warum, denkt ihr, setzt LucasArts seine tollen Adventures nicht mehr
f&uuml;r den Amiga um? Einfach aus dem Grund, weil er f&uuml;r dieses
Softwarehaus, und viele andere auch, `gestorben` ist. Schuld daran ist die
tolle `Szene` auf dem Amiga, die von den `Kennern` auch noch hochgejubelt
wird; ohne zu wissen, da&szlig; die ach-so-bewundernswerten `Cracker` den
Untergang dieser Maschine in Sachen Spiele-Konkurrenz herbeigef&uuml;hrt
haben!</P>

<P>"X-Wing", "Rebel Assault", "Day Of The Tentacle", "DOOM" - Namen von
Superspielen, die niemals auf dem Amiga erscheinen werden... Selbst ein
weniger aufwendiges Game wie "Star Trek 25th Anniversary" braucht fast 2
Jahre Konvertierungszeit, ganz abgesehen von der `tollen` Wing
Commander-Umsetzung f&uuml;r den Amiga. Auf dem PC schon l&auml;ngst kein
Thema mehr, fiebert man heute auf dem Amiga immer noch auf die endlich
erschienene 1200er/CD 32-Version. Hier l&auml;uft man ebenfalls der Zeit
hinterher.</P>

<P>Fr&uuml;her wurden Spiele zuerst auf dem Amiga gemacht, dann auf den PC
umgesetzt. Heute ist es umgekehrt. Das sagt doch schon alles!!!</P>

<P>Au&szlig;erdem wurden in letzter Zeit alle technischen Innovationen auf
dem Spielemarkt am PC gemacht: Das Texture-Mapping von DOOM, erfunden im
Game "Wolfenstein" schon vor fast drei Jahren. Jedes PC-3D Spiel l&auml;uft
heute mit dieser Grafik. Auf dem Amiga hingegen gibt es erst zwei Games mit
Grafik dieser Art, Ambermoon und Jurrassic Park. Was beim PC schon lange
Standard war, dar&uuml;ber freuten sich die Amigianer als `technische
Neuerung` wie die K&ouml;nige. R&uuml;ckst&auml;ndigkeit pur.</P>

<P>Man dachte, das CD32 und der 1200er w&uuml;rden dem Amiga-Spielemarkt
Auftrieb geben. Bis Weihnachten `93 sollten 40 Titel erschienen sein.
Pustekuchen: Bis heute sind es nur rund 20... Seht Euch doch die
Spiele-Listen der Versandh&auml;user an! Es geht schon so weit, da&szlig;
Firmen verleugnen, noch etwas f&uuml;r den Amiga zu machen, da sie dann vor
ihren Kollegen/Konkurrenten als `unprofessionell` angesehen werden. Deshalb
traute man sich auch nicht, in der Fernsehwerbung zu T.F.X von Ocean
(ehemals eine Amiga-Hochburg) zuzugeben, da&szlig; das Game auch f&uuml;r
das `alberne kleine` CD 32 herauskommt, weshalb es nur f&uuml;r "PC und CD
ROM" angeboten wird, weil es sich heutzutage einfach `besser macht`.
Au&szlig;erdem waren fast alle Games, die bis jetzt f&uuml;r die Konsole
erschienen sind, Schl&auml;ge unter die G&uuml;rtellinie, sprich
50%-H&uuml;rde der Spielemagazine...</P>

<P>Der PC hat den Spielemarkt fest in der Hand, und zwar in jeder
Beziehung. Immer mehr Kids kaufen sich einen billigen PC zum Spielen, in
allen computerbezogenen Fernsehsendungen ist keine Rede mehr vom Amiga, der
PC ist allgemein angesagt. Das kann jeder, der in letzter Zeit eine
Computersendung sah, best&auml;tigen. Nahezu lachhaft (wenn auch
l&ouml;blich), wie ein Amiga-Besitzer im WDR-Computerclub k&uuml;rzlich
versuchte, den Amiga als Arbeitsger&auml;t zu etablieren - er scheiterte
kl&auml;glich.</P>

<H3>6. "In Sachen Grafik und Sound hat der Amiga doch unbestreitbar mehr
drauf."</H3>

<P>Selten so gelacht. Der modernste Amiga, der A 4000, kann gerade mal
Grafik in 18 Bit-Farbtiefe darstellen. Will man 24 Bit, mu&szlig; man erst
f&uuml;r 400 DM eine spezielle Grafikkarte kaufen... Auf dem PC kosten 24
Bit-GraKas nur noch rund 200 DM und bieten exzellente Leistungen, sogar 32
Bit-Grafik beginnt sich langsam durchzusetzen. Auf dem Amiga undenkbar.
Aufgrund des niedrigen Preises haben fast alle heute verkauften PCs bereits
eine 24 Bit-Grafikkarte... Und der Amiga? Hinkt mal wieder hinterher.</P>

<P>"Aber SeaQuest DSV wurde doch mit dem Amiga gemacht", m&ouml;gen jetzt
manche Leute behaupten. Na sch&ouml;n. Abgesehen davon, da&szlig; die Serie
M&uuml;ll und abgesetzt ist, werden 90% aller Film- und TV-FX auf "Silicon
Graphics"-Rechnern gemacht ("Abyss", "Lawnmower Man", "Star Trek",
"Jurassic Park", "Terminator II"), und nur rund 10% mit dem Videotoaster
auf dem Amiga.</P>

<P>Sound? Da war der Amiga jahrelang ungeschlagen. Sch&ouml;n, von 1985 an
bis heute eine Art Standard in der Computer-Soundchipwelt, das ist eine
gute Leistung. Aber leider wurde auch hier der Fortschritt verpa&szlig;t.
W&auml;hrend sich am PC exzellente 16 Bit-Soundkarten mit Synthesizerchips
von Firmen wie Yamaha oder Roland etablieren, die neben riesig viel
Software auch ein Mikrofon mitgeliefert bekommen, einen Sampler eingebaut
haben, &uuml;ber bis zu 32 Stimmen Musik abspielen k&ouml;nnen ---mu&szlig;
man sich auf dem Amiga mit 4 Stimmen in 8-Bit begn&uuml;gen. Und die ersten
12/16 Bit-Soundkarten f&uuml;r den Amiga, wie die "Toccata", sind bisher
doch wirklich nur Sch... wenn man den Tests glaubhafter Mags Vertrauen
schenken darf.</P>

<P>&Uuml;ber neue Soundtechnologien wie CCITT-Kompression,
Wavetable-Synthese und andere Dinge verf&uuml;gt heute jede gute
PC-Soundkarte, auf dem Amiga hat man den Trend wieder verschlafen; ja,
kennt diese Begriffe nicht einmal! Die PC-Soundboards sind nicht
aufzuhalten, der Amiga hat dem nichts entgegenzusetzen. Und falls
irgendwann mal der 5000er kommt, wird er doch nur auf dem Level arbeiten,
wie es ein guter PC schon heute tut.</P>

<P>Nicht nachmachen; <B>selbst</B> Ma&szlig;t&auml;be setzen ist die
Devise. Commodore konnte das fr&uuml;her sehr gut. Aber nun scheint dem
geldarmen (TV-Werbung wurde aus Kostengr&uuml;nden eingestellt)
Homecomputer-Imperium die Luft auszugehen.</P>

<H3>7. "Die Motorola-Prozessoren des Amiga sind ja viel besser und
schneller als der Intel-M&uuml;ll im PC."</H3>

<P>Auch wieder nur die Halbwahrheit. Richtig ist: Der Amiga mit seiner
Motorola-Reihe bietet gerade Assembler-Programmierern gro&szlig;e Hilfen,
viel Komfort und gute Leistungen. Es kommt aber nicht nur darauf an, wie
gut ein Prozessor zu programmieren ist, sondern auch wie schnell er
ist.</P>

<P>Welcher ist der schnellste Amiga? Na klar, der A4000 in Luxus-Version
mit 68040-25! Da f&uuml;hlt man sich toll, da f&uuml;hlt man sich schnell!
Immerhin schafft dieser Prozessor rund 24 Millionen Befehle pro Sekunde,
ein 486DX-50 nur 19. Also sch&ouml;n, mit einem 486DX2-66 kann es der 68040
im Echtzeit-Vergleich gerade noch aufnehmen. Nicht schlecht.</P>

<P>Aber jetzt ein Stichwort: Pentium. Gut, das Ding war in der PC-Welt eine
Entt&auml;uschung. Aber erstens ist das Ding 64 Bit, und zweitens mit 66,
80, 90 oder 100 Mhz getaktet. Werte und Zahlen, von denen man am Amiga nur
tr&auml;umt. Auf dem PC eine Entt&auml;uschung, auf dem Amiga unerreichbar
- das zeigt, da&szlig; zwischen der Technologie der beiden Systeme Welten
liegen, zu Gunsten des PC`s.</P>

<P>Gibt es einen 64 Bit-Amiga? Oder einen Amiga mit 100 Mhz? Antwort: Nein,
gibt es nicht. Sicher, der Pentium braucht ein Riesen-K&uuml;hlsystem. Aber
warum arbeiten bei Bayer Leverkusen die Netzwerk-Hauptrechner mit einem
Pentium und nicht mit einem 68040? Die Antwort d&uuml;rfte klar sein.
Abgesehen davon gibt es schon PC`s mit Alpha Chip und Power PCCPU, auf dem
Amiga ist nichts dergleichen abzusehen.</P>

<P>Auch in Sachen Prozessortechnologie ist der Amiga also unterlegen.
Ger&uuml;chten zufolge soll der A 5000 einen HP-RISC-Prozessor enthalten?
Guter Witz. Commodore hat schon viel versprochen. Am Ende wird es doch ein
MC 68060-66, und wieder konnte man dem PC nicht das Wasser reichen.</P>

<H3>8. "Auch mit dem Amiga kann man toll im B&uuml;ro arbeiten.
Tabellenkalkulation und Textverarbeitung l&auml;uft auch hier."</H3>

<P>Na Super. Da erscheinen f&uuml;r den Amiga, zugegebenerma&szlig;en
vern&uuml;nftige, Anwenderprogramme wie z.B. "Final Copy II", und schon
f&uuml;hlt man sich dem PC &uuml;berlegen. Machen wir die Probe aufs
Exempel: Nenne, lieber Leser, auf Anhieb eine Textverarbeitung, eine
Tabellenkalkulation, eine Datenbank und ein DTP-Programm f&uuml;r den
Amiga, das es mit seinen PC-Gegenst&uuml;cken aufnehmen kann!</P>

<P>Kannst Du nicht? Hab` ich mir gedacht. Auf dem PC machen grandiose
Programme wie "Lotus 1-2-3", "WinWord" und "Photostyler" die Runde. Tools,
die sich Amiga-Besitzer oft nichtmals in ihren k&uuml;hnsten Tr&auml;umen
vorstellen k&ouml;nnen, was Umfang, M&ouml;glichkeiten und
Funktionalit&auml;t betrifft. Wer jetzt sagt, da&szlig; das nicht stimmt,
best&auml;tigt diese Aussage.</P>

<P>Wirklich `notwendige` Programme wie das DTP-Prog "Quark X-Press" sind
bisher nur f&uuml;r MAC und PC erschienen. Warum wohl nicht f&uuml;r den
Amiga? Etwa, weil es sich nicht lohnt, wirklich professionelle Anwendungen
auf den Markt zu bringen, weil 75% der User sowieso nur spielen? Das klingt
hart, aber fragt Euch doch mal - ist es nicht so???</P>

<P>Ein Wort: Netzwerkf&auml;higkeit. Das, was der PC schon <B>immer
konnte</B>, und das, was die Workbench <B>immer noch nicht kann</B>. Dazu
mu&szlig; ich wohl nichts mehr sagen.</P>

<P>Ein Wort: Malprogramme. Der Amigianer f&uuml;hlt sich mit "Brilliance"
oder "DPaint IV AGA" allen anderen &uuml;berlegen. Wer einmal "Corel Draw
4.0", das wohl kompletteste und leistungsst&auml;rkste Malprogramm aller
Zeiten, auf dem PC gesehen hat, wird einsehen, da&szlig; die
Amiga-Ambivalente nichts anderes sind als harmlose Spielzeuge. Und die ach
so teuren PC-Programme sind mittlerweile sehr preiswert. Corel Draw 4.0 auf
CD ROM ist schon f&uuml;r vergleichsweise schlappe 379 DM zu haben. Die
Amiga-Maler sind zwar 100 DM billiger - aber sind sie auch besser? F&uuml;r
mehr Leistung w&uuml;rde der echte Profi sicher gerne 100 DM mehr
ausgeben.</P>

<H3>9. "Der Amiga ist sehr offen f&uuml;r andere Systeme, was sich durch
die zahlreichen Emulatoren beweist, und dadurch, da&szlig; man Disketten
von anderen Computern lesen kann. Der PC kann das alles nicht."</H3>

<P>Eine gute Ausrede. Vielleicht gibt es gerade deshalb so viele Emulatoren
und PC-Br&uuml;ckenkarten auf dem Amiga, weil man damit Sachen erreicht,
die der Amiga selbst nicht kann? Schonmal dr&uuml;ber nachgedacht? Dies
wird dann geschickt mit dem Schlagwort "Systemoffenheit" getarnt.</P>

<P>"Systemoffenheit" hat der Amiga &uuml;berhaupt nicht. Das zeigt sich
schon darin, da&szlig; er den veralteten und minderleistungsf&auml;higen
IFF-Grafik/Soundstandard verwendet, w&auml;hrend der PC wortlos
Grafikformate wie GIF, JPEG, PCX, BMP, MAC, MPEG und auch IFF/ILBM; und
Soundformate wie WAV, VOC, IFF, 8SVX, schluckt.</P>

<P>Ach ja - ein PC kann Amiga-"MOD"-Files abspielen, mit gutem Programm
sogar absolut fehlerfrei - aber der Amiga kann keine PC-Spezifischen
Musiken abspielen. Systemoffenheit?</P>

<P>Man versucht zwar, mit den "Datatypes" der WB 3.0 mehr Systemoffenheit
auf dem Amiga zu erreichen, aber mal ernsthaft -ausgerechnet die Programme,
von denen man es erwartet, unterst&uuml;tzen diese Datatypes doch gar
nicht!</P>

<P>z.B. DPaint IV AGA, das `tollste` am Amiga. Jeder PC-Maler kann in
mehreren Grafikformaten abspeichern, Dpaint schluckt nur IFF/ILBM. Ein
wahres Armutszeugnis. Noch nichtmal GIF, der aktuelle Grafikstandard, kann
heute auf jedem Amiga angezeigt werden; geschweige denn JPEG, das auf dem
PC gang und gebe ist und sich auf dem grafisch angeblich so
fortschrittlichen Amiga immer noch nicht etabliert hat... Kennt
&uuml;brigens jemand einen guten JPEG-Kompressor f&uuml;r den Amiga? Nein?
Auf dem PC kann heute jeder PD-Grafikkonverter ein JPEG-File
erzeugen...</P>

<P>"Der Amiga kann aber auch PC-Disketten lesen. Umgekehrt geht das nicht."
Einfache Frage: Warum auch? Wieso sollte ein PC Amiga-Disks lesen
k&ouml;nnen? Es besteht einfach kein Bedarf! Sowieso l&auml;cherlich: Auf
jedem Computer sind heute mit 1,44 MB formatierte Disketten &uuml;blich -
auf dem Amiga qu&auml;lt man sich noch immer mit der 856 K-Grenze herum. Da
kann der A 4000 mit seinem HD-Floppy auch nichts mehr herausholen, so ein
Ding m&uuml;&szlig;te in <B>jedem</B> Amiga sein, und da&szlig; es nicht
serienm&auml;&szlig;ig in den 1200er eingebaut wurde, zeigt doch nur,
da&szlig; die Kiste zum Spielen gebaut wurde (die fehlende Hardwareuhr
untermauert dies) und nur m&auml;&szlig;ig zur Anwendung taugt.</P>

<P>Soweit also zum Thema "System-Offenheit" in Sachen Grafik/Soundformate.
Der Amiga ist gnadenlos unterlegen, und wer keinen A 4000 oder einen stark
erweiterten A 2000/3000 hat (und das sicher nicht mehr als 25% <B>aller</B>
Amiga-Besitzer) und zudem &uuml;ber die richtige Software verf&uuml;gt,
soll sich nicht wundern, wenn sein System von PC-Besitzern heruntergemacht
wird.</P>

<TABLE border="0" summary="" cellspacing="0" cellpadding="0">
<TR>

<TD colspan="2"><B><FONT size="+1">Was lernen wir aus diesen
Vergleichen?</FONT></B> </TD>
</TR>

<TR>
<TD valign="top">+</TD>

<TD>Der PC ist sehr preiswert geworden, man bekommt auch gute Rechner
praktisch `hinterhergeworfen` (i486 &lt; 2000 DM)</TD>
</TR>

<TR>
<TD valign="top">-</TD>

<TD>Amigas bieten f&uuml;r den an sich hohen Preis f&uuml;r eine komplette
Anlage im Vergleich zum PC weniger<BR> &nbsp;</TD>
</TR>

<TR>
<TD valign="top">+</TD>

<TD>Der PC ist aufgrund der besseren Dokumentation und der &ouml;fter
vorhandenen PC-Gesch&auml;fte f&uuml;r Reparaturen besser f&uuml;r
Einsteiger.</TD>
</TR>

<TR>
<TD valign="top">-</TD>

<TD>Amiga ist schlecht f&uuml;r Einsteiger, aufgrund mangelnder
(Hand)B&uuml;cher und Hintergrund-Informationen &uuml;ber Hard- und
Software.<BR> &nbsp;</TD>
</TR>

<TR>
<TD valign="top">+</TD>

<TD>So gut wie jeder PC wird heute mit 24 Bit-Grafikkarte ausgeliefert</TD>
</TR>

<TR>
<TD valign="top">-</TD>

<TD>Erst einige Amigas unterst&uuml;tzen bessere Grafik, und nur in 18 Bit
Erweiterungsm&ouml;glichkeiten bei A 500/600/1200 kaum vorhanden.<BR>
&nbsp;</TD>
</TR>

<TR>
<TD valign="top">+</TD>

<TD>Gute PC-Soundkarten f&uuml;r 200-300 DM sind 16 Bit, haben einen
Synthesizer-Chip und bis zu 32 Stimmen, k&ouml;nnen Amiga MODs
abspielen</TD>
</TR>

<TR>
<TD valign="top">-</TD>

<TD>Auf dem Amiga: nur 8 Bit, 4 Stimmen, gute Soundkarten sind eine
Seltenheit, kaum Fremd-Musikformate zu verarbeiten.<BR> &nbsp;</TD>
</TR>

<TR>
<TD valign="top">+</TD>

<TD>F&uuml;r den PC existiert das gr&ouml;&szlig;ere Angebot an
B&uuml;ro-Anwendungen, die sehr umfangreich sind, da sie aus dem
Industrie-Bereich kommen.</TD>
</TR>

<TR>
<TD valign="top">-</TD>

<TD>Auf dem Amiga etablieren sich B&uuml;ro-Anw. nur schwer, da keine oder
kaum Nachfrage vorhanden ist.<BR> &nbsp;</TD>
</TR>

<TR>
<TD valign="top">+</TD>

<TD>Beim PC kann man unter mehreren Betriebssystemen w&auml;hlen</TD>
</TR>

<TR>
<TD valign="top">-</TD>

<TD>Beim Amiga sind 99% der User auf AmigaDOS angewiesen<BR> &nbsp;
</TD>
</TR>

<TR>
<TD valign="top">+</TD>

<TD>Beim PC gibt es mit Pentium/ Alpha Chip/ Power PC schon 64 Bit-Systeme</TD>
</TR>

<TR>
<TD valign="top">-</TD>

<TD>Beim Amiga bliebt die Zeit momentan beim 68040 stehen<BR> &nbsp;</TD>
</TR>

<TR>
<TD valign="top">+</TD>

<TD>F&uuml;r den PC werden alle Spiele zuerst entwickelt,
Game-Ma&szlig;st&auml;be werden auf dem PC gesetzt.</TD>
</TR>

<TR>
<TD valign="top">-</TD>

<TD>Gl&uuml;ck f&uuml;r den Amiga, wenn &uuml;berhaupt noch ein PC-Spiel
f&uuml;r ihn umgesetzt wird, oder etwas anderes, wirklich Vern&uuml;nftiges
erscheint.<BR> &nbsp;</TD>
</TR>

<TR>
<TD valign="top">FAZIT:</TD>

<TD>Der Amiga ist ein schlecht dokumentierter, &uuml;berteuerter und
technisch der Zeit hinterherlaufender Spiele-Computer mit miesem Ruf und
wenig M&ouml;glichkeiten zum professionellen Arbeiten in den Bereichen, auf
die es wirklich ankommt.</TD>
</TR>
</TABLE>

<P>So gesehen hat der Amiga eigentlich nur Nachteile, und wenn man genauer
dar&uuml;ber nachdenkt, fragt man sich doch, warum ein
r&uuml;ckst&auml;ndiges System wie der Amiga eigentlich noch gekauft wird,
wenn doch in jedem Haus ein PC stehen k&ouml;nnte.</P>
</TD>
</TR>
</TABLE>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="smt.gif" alt="" width="640" height="22" border="0" usemap="#smt0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

