<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Scala-Multimedia</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="tls0">
<AREA shape="rect" coords="460,1,550,22" href="tls.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#88CA00">
<TR>
<TD><IMG src="tls.gif" alt="" width="640" height="22" border="0" usemap="#tls0"> </TD>
</TR>

<TR>
<TD>
<BR>

<H1 align="center"><B><FONT color="#FFFF00">Scala-Multimedia</FONT></B></H1>
<BR>

<TABLE border="0" cellpadding="4" summary="" bgcolor="#888888" width="80%" align="center">
<TR>
<TD>
<BR>

<P>Vor einigen Wochen bekam unser Videoclub den Auftrag einen Film
&uuml;ber eine Musikband, die k&uuml;rzlich ihr 10j&auml;hriges
Jubil&auml;um feierte, zu drehen. Nat&uuml;rlich sollten auch Computertitel
und Animationen ins Video eingeblendet werden. Wir beschlossen also ein
neues, besseres Genlock zu kaufen. Auch "DPaint" und "AmigaVision"
gen&uuml;gten nicht mehr den Anspr&uuml;chen an eine gute Titelsoftware.
Also kauften wir "Scala MM 211". Durch das Erscheinen von "Scala MM 300"
wurde diese Software relativ erschwinglich. Doch genug der ein leitenden
Worte, nun zu den ersten Erfahrungen, die ich mit dem fantastischen
Programm "Scala Multimedia 211" in den vergangenen Wochen machte.</P>

<P>Das Programm-Paket wird mit acht Disketten, einem Ringbuch ordner mit
ca. 300 Seiten Handbuch und einem Dongle ausgeliefert. Auf der Festplatte
nimmt Scala dann 12 MByte in Anspruch. Die minimale Hardwarebasis f&uuml;r
"Scala" ist ein Amiga mit Kickstart 1.3 ,68000-Prozessor, 1 MByte Chip-,
2MByte FastRAM. Mehr Speicher, eine Festplatte und ein schnellerer
Prozessor wirken sich nat&uuml;rlich auf die Arbeitsgeschwindigkeit positiv
aus. Das Motto in bezug auf den Speicherausbau kann eigentlich nur "je mehr
desto besser" lauten. Selbst bei meinem A4000 mit insgesamt 6 MByte kam,
wenn auch selten, die Meldung "Nicht gen&uuml;gend RAM". Gerade zwei MByte
ChipRAM sind f&uuml;r einige Effekte dringend n&ouml;tig, da diese an
sonsten nicht richtig und fl&uuml;ssig funktionieren. Auch auf der
Festplatte sollte gen&uuml;gend Speicher frei sein, da im Normalfall bei
SCALA viel mit Animationen gearbeitet wird. Meine 80 MByte Platte erwies
sich jedenfalls w&auml;hrend der Arbeit am Film als viel zu klein.</P>

<P>Die mitgelieferten Demos, "ScalaTime" und "LaScalatore" sind sehr
beeindruckend. Das erste Demo ist eine Art Musikvideo, das aus einzelnen,
aneinandergef&uuml;gten Animationen besteht. Gleichzeitig zu den
Animationen wird eine Techno-Musik abgespielt. Zwei PC-User, denen ich
dieses Demo zeigte, waren von der sehr guten Qualit&auml;t der Musik
(obwohl nur 8Bit!) und den langen und schnellen Animationen erstaunt.</P>

<P>Das Programm h&auml;lt sich zwar nicht an Commodores Style Guide, aber
dennoch ist die Bedienung logisch und einfach. Um einige F&auml;higkeiten
des Programms vorzustellen, werde ich im Folgenden die F&auml;higkeiten des
Programms anhand eines Beispiels einer fiktiven Pr&auml;sentation
schildern:</P>

<P>Nach dem Starten des Programms erscheint ein Hires-nonlace Bildschirm
(Modus l&auml;&szlig;t sich umschalten). Es gibt keine
Pull-down-Men&uuml;s. Alles wird per Maus-Schalter bedient. Doch jetzt
gehts los: Ich dr&uuml;cke den Schalter "Neu" und ein Filerequester
erscheint. Nun mu&szlig; man einen Hintergrund (Bild oder Animation)
ausw&auml;hlen. Ich lade ein zuvor digitalisiertes Bild von der CeBit. Der
Filerequester verschwindet und auf dem Bildschirm erscheint mein
CeBit-Bild. Ich w&auml;hle eine Scriftart aus, und schreibe in die untere
Ecke des Bildes "CEBIT94". Die Schrift kann nachtr&auml;glich
ver&auml;ndert und verschoben werden. Zus&auml;tzlich stehen
Textverarbeitungsfunktionen, wie etwa Tabs und zentrierte Ausrichtung des
Texts, zur Verf&uuml;gung. Die Zeile "CeBit94" kann nun mit einem - wie der
Name schon sagt -Zeileneffekt versehen werden. Als Effekte stehen Lauftext,
Einschieben und andere Einblendeffekte wie etwa "Kreis" oder "Gitter" zur
Verf&uuml;gung .Insgesamt sind es etwa 50 Effekte. Gerade die
Lauftext-Funktion, die einen sehr langen Text von rechts nach links durchs
Bild laufen l&auml;&szlig;t ist beeindruckend, und kann gut f&uuml;r
Abspanne verwendet werden.</P>

<P>Hat man den Titeltext plaziert, k&ouml;nnen Schalter auf dem Bildschirm
definiert werden. Sie dienen dem m&ouml;glichen verzweigen innerhalb einer
Pr&auml;sentation, und machen diese somit interaktiv. So k&ouml;nnte ein
Schalter zu Seite 23 verzweigen und dort dann die neuen CeBit-Produkte, um
bei meinem fiktiven Beispiel zu bleiben, dort vorstellen. Klickt man auf
einen Schalter kann Scala zeitgleich dazu einen digitalisier ten Sound
abspielen. Doch weiter mit unserem Beispiel: Den anderen Schalter belege
ich mit der "Funktion" "Gehe zu Seite 4".</P>

<P>Die Seite 4 besteht aus einer Animation, die zuvor digitalisiert wurde.
Scala bietet dabei mit Hilfe des eingef&uuml;gten Tools "AnimLab" die
M&ouml;glichkeit, Animationen zu verschnellern und/oder von der
Dateigr&ouml;&szlig;e her zu verkleinern. Au&szlig;erdem kann man mit
diesem Programmteil Bilder zu einer Animation zusammensetzten, wobei nicht
unbedingt eine einzige Palette verwendet werden mu&szlig;. Ferner kann
Scala Animatio nen auch direkt von Festplatte abspielen. Zumindest
Animationen aus dem Speicher werden unglaublich schnell abgespielt und sind
auf keinen Fall mehr mit der Geschwindigkeit von DPaint zu vergleichen.</P>

<P>&Uuml;berg&auml;nge zwischen zwei Seiten k&ouml;nnen mit Effekten
versehen werden. Diese Seiteneffekte sind allesamt sehr imposant, und
funktionieren in PAL-Aufl&ouml;sung (nicht DPAL, Euro72) sehr gut
(zumindest auf einem 68030-Prozessor). &Auml;rgerlich ist, da&szlig; man
bei &Uuml;berblendungen keine 256-Farben Bilder benutzten kann, da
wahrscheinlich das Chip-Mem dazu nicht ausreicht (glaube ichtls). Es gibt
etwa 50 verschiedene Effekte. Zum Ton: Scala kann dank des Amigaaudiochips
"Paula" Musik abspielen, ohne dabei laufende Animationen in der
Geschwindigkeit zu beeintr&auml;chigen.</P>

<P align="center">(((Wo ist eigentlich mein Beispiel geblieben ???<BR>
Egal, weiter geht`s ...)))</P>

<P>Ferner erm&ouml;glicht es Scala dem Anwender Musik mit einem Digitizer
aufzunehmen. Das funktioniert sehr gut, da auch Schneide- und
Zoom-Funktionen zur Verf&uuml;gung stehen. Hat man einen
Ton/Musikst&uuml;ck digitalisiert oder aber einen schon vorhabenen IFF-
oder Soundtracker geladen, kann er logischerweise in die Pr&auml;sentation
eingebaut werden. Dabei k&ouml;nnen Lautst&auml;rke, Ein- und
Ausblendungen, Verz&ouml;gerungen, Tonh&ouml;he und Schleifen definiert
werden.</P>

<P>Damit der Anwender beim Erstellen den &Uuml;berblick &uuml;ber seine
Pr&auml;sentation nicht verliert, verkleinert Scala auf Wunsch die
einzelnen Seiten, und man hat einen schnellen &Uuml;berlick &uuml;ber das
erstellte Werk. Doch zur&uuml;ck zum "normalen" Men&uuml;. In der Spalte
"Execute" k&ouml;nnen zu einem bestimmten Zeitpunkt der Pr&auml;sentation
Arexx- oder normale DOS-Programme aufgerufen werden. So k&ouml;nnte man
sich zum Beispiel die Ansteuerung eines Videodigitizer mittels Arexx
vorstellen, der den Benutzer digitalisiert, zwischendurch zur Kontrolle
anzeigt (mit Scala) und anschlie&szlig;end ausdruckt. Ausgedruckt werden
k&ouml;nnen auch die Scripts, wobei die Seiten verkleinert werden.</P>

<P>Scala kann durch sogenannte Ex-Module erweitert werden. So k&ouml;nnen
mit Hilfe dieser Ex-Module z.B. LaserDisk-Player, MIDI-Interface, Genlock,
CDTV, Canons ION-Kamera oder Videorecorder der h&ouml;heren Preisklassen
gesteuert werden. Mit der entsprechenden Ausstattung kann der Scala-User
also ein echtes Multimedia-Meisterwerk schaffen.</P>

<P>So, zum Schlu&szlig; noch was: Gestern war in Bremerhaven (an der Weser)
bei dem relativ jungen Offenen Kanal (ca. 1 Jahr alt). Und siehe da, dort
werden f&uuml;nf Amiga 3000 eingesetzt, auf denen SCALA MM 300 (also die
neueste Version) l&auml;uft. Sie dienen einmal nat&uuml;rlich der
Betitelung von Filmen und Spezial-Effekten (Imagine). Au&szlig;erdem
l&auml;uft rund um die Uhr (wenn kein Programm ausgestrahlt wird) ein
Rechner, der Programmhinweise und Informationen in grafisch ansprechender
Form ins Kabelnetz von Bremerhaven und Nordenham schickt. In mindestens
einem Recher ist auch eine IV24-Karte eingebaut. Zus&auml;tzlich werden
DPaint und AdPro eingesetzt.</P>

<P>Wieder einmal zeigt sich, da&szlig; auch der Amiga mit entsprechender
Software professionell genutzt wird.</P> <BR>
                         
</TD>
</TR>
</TABLE>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="tls.gif" alt="" width="640" height="22" border="0" usemap="#tls0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

