<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Virenkillertest</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="tls0">
<AREA shape="rect" coords="460,1,550,22" href="tls.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#426342">
<TR>
<TD><IMG src="tls.gif" alt="" width="640" height="22" border="0" usemap="#tls0"> </TD>
</TR>

<TR>
<TD>
<BR>

<TABLE border="0" cellpadding="4" summary="" bgcolor="#FFFFFF" width="80%" align="center">
<TR>
<TD>
<P>Test zu Antiviren Proggis geschrieben von NORMAN SCHLEGEL</P>

<P>Fangen wir mit dem Virenkiller an,der als einzieger eine
Musikuntermalung hat.Es handelt sich hierbei um den VIRUSKILLER
PROFESSIONAL in der Version 2.0 Nach einem sch&ouml;n gezeichnete
Titelbild! kommen wir in den Auswahlschirm.Als erstes wird vom Programm aus
der Speicher auf Viren gepr&uuml;ft.Fall sich ein Virus im Speicher
befindet kann man diesen l&ouml;schen. Um den Bootblock einer Diskette zu
pr&uuml;fen kann man zwischen DF0-DF3 als Zielverzeichnis w&auml;hlen.Wenn
der Bootblock als Virus bekannt ist wird dies angezeigt. Mit der Funktion
ASCII Dump darf man sich den Bootblock ansehen.Hat man einen Bootblock
Virus auf der Diskette,ist es m&ouml;glich diese neu installieren.Zum
zus&auml;tzlichen Schutz kann man noch den Bootprotector auf der Diskette
installieren.Leider l&auml;&szlig;t sich die Diskette nicht auf Linkviren
pr&uuml;fen!</P>

<P>Der LINKPROTECTOR liegt mir als Version 2.4 und tiefer vor.Im Laufe der
Zeit hat sich nicht viel ver&auml;ndert. Mit jeder Version kamen neue Viren
dazu die er erkennt und l&ouml;scht.Wenn man den Linkprotector installiert
hat wird dieser automatisch als 1.Programm aufgerufen. Wenn sich der
IRQ,BGS9,Lamer Revenge/Return,Disaster Master,Xeno,CCCP,Jeff I+II,Smily
Cancer oder der Traveling Jack Virus im Speicher befinden zeigt der
Linkprotector dies an und l&ouml;scht diese Viren automatisch aus dem
Speicher.So wird verhindert da&szlig; sich ein Linkvirus auf einer
virusfreien Diskette festsetzt.</P>

<P>Zu den Wohl bekanntesten Virenkillern z&auml;hlt der VIRUS CHECKER.Ich
habe ihn in mehreren Versionen vorliegen,aber heute will ich meine
h&ouml;chste Version, die Version 6.33,testen.In der Configuration kann man
allerlei Dinge einstellen.So z.B. wie gro&szlig; das Anzeigefenster sein
soll oder welche Laufwerke er testen soll.Dort kann man auch bestimmen ob
die Startup Sequence und gepackte Files getestet werden, ob das Programm
sich resident im Hintergrund installiert, ob BB Read Errors ignoriert
werden sollen und einiges mehr!Das alles ist &uuml;bersichtlich und
ordentlich dargestellt und kann abgespeichert werden.&Uuml;ber ein Pull
Down Men&uuml; kann man w&auml;hlen ob man nach File oder Link Viren suchen
will,den Speicher checken oder ob man eine Diskette nach dem Saddam Virus
untersuchen m&ouml;chte. Auch hier kann man sich als Ziellaufwerk DF0-DF3
aussuchen. Wenn man das Programm in den Hintergrund startet f&uuml;rt es
die Anweisungen aus der Configuration aus und checkt danach die eingelegten
Disketten.</P>

<P>Ist der Bootblock einer eingelegten Diskette nicht bekannt wird ein
Kasten angezeigt indem man w&auml;hlen kann. Man kann nun den Bootblock
ansehen,einen neuen Bootblock installieren,den Bootblock ignorieren
oder,wenn es sich um einen harmlosen Booter handelt,diesen vom Programm
lernen lassen.Wenn man nun eine Diskette einlegt deren Bootblock dem
Programm bekannt ist,wird der Bootblock nicht als Fremdbooter angezeigt.Die
leichte Handhabung und die Lernfunktion k&ouml;nnen bei diesem Virenkiller
besonderst &uuml;berzeugen!</P>

<P>Ein nicht ganz so bekannter,aber dennoch sehr guter Virenkiller,ist der
ANTICICLOVIR welcher mir in Version 2.0 vorliegt. Hier mu&szlig; man
besonderst die Info.Dok loben,die sehr umfangreich ist und in der jeder
bekannte Virus sowie seine Wirkungen auf das System beschrieben ist. Anti
Ciclo Vir kennt 126 Bootblockviren,12 Linkviren, 23 Fileviren,5
Diskvalidatorviren,5 Trojanische Pferde und 4 Bomben!Dieses Programm ist am
besten vom CLI aus zu bedienen,obwohl es auch ein Icon besitz! Man kann das
Programm veranlassen einen Speichercheck durchzuf&uuml;hren(auch mit einer
Vektorentabelle),einen Speichercheck und anschliesende Installierung als
Background Task oder als Virenchecker f&uuml;r einzelne Laufwerke oder
sogar einzeln angegebene Verzeichnisse. Leider merkt dieser Virenkiller,wie
auch ein paar andere, nicht wenn er selbst infiziert ist.</P>

<P>Eigentlich wollte ich hier einen Test zum Programm VIRUSZ schreiben,aber
bei mir will dieses Programm einfach nicht seine Arbeit verichten.</P>

<P>Und nun zu einem Virenkiller der zweifelos zu einem der Besten
z&auml;hlt.Ich testete VIRUSCOPE Version 1.6. In einem Grafisch gut
gemachtem Auswahlschirm kann man zwischen Bootkiller,Tools und dem
Linkkiller w&auml;hlen. Im Bootkiller finden sich folgende Funktionen. Ein
Fenster f&uuml;r den Speicher und ein Anzeigefenster f&uuml;r
Disketten.Auch hier wurde wieder,wie &uuml;berall in diesem Programm,auf
Grafik gesetzt. Zu den FunktionentlsSobald ein Virus in den Speicher kommt
oder auf einer Diskette erkannt wird,erscheint im jeweiligen Fenster ein
kleines Bild,welches anzeigt um was f&uuml;r einen Virus oder Bootblock es
sich handelt. Mit der Funktion Clear kann man den Speicher s&auml;ubern.Die
Decode Funktion zeigt einem an ob es sich um einen harmlosen oder
gef&auml;hrlichen Bootblock handelt,obwohl dies schon aus den Bildchen
sichtbar wird!Man kann alle Bootbl&ouml;cke der Disketten in den Laufwerken
DF0-DF3 testen.Mit dem ASCII Dump kann man sich Bootbl&ouml;cke anschauen
und mit der Install Funktion kann man,wie soll es anderst sein?, Disketten
neu installieren.Mit der letzten Funktion namens Protect kann man einen
Schutzbootblock auf Diskette installieren. Wir schalten um zum
Linkkiller.Hier k&ouml;nnen wir zwischen DF1:,DF0:,DH0:,DH1 oder dem System
als Ziel w&auml;hlen. Ist ein Virus im Speicher oder auf Diskette wird dies
wie beim Bootkiller in einem kleinen Fenster angezeigt. Ist der Speicher
belegt kann man auch hier die Clear Funktion anwenden.Die Diskette kann man
mit einem Quick Test oder einem Safety Test durchchecken. Um die Diskette
gegen Linkviren zu sch&uuml;tzen kann man hier den Linkprotector
installieren. Das Beste an dieser Diskette sind aber die Tools. Hier kann
man ein Boot Men&uuml;,einen Bootblock oder einen Bootscroller
erstellen.Mit den Funktionen Load Boot, Save Boot,Read Boot und Write Boot
lassen sich Bootbl&ouml;cke von Diskette oder aus dem Bootblockverzeichnis
von Viruscope laden,mit dem Booteditor bearbeiten und dann auf Diskette neu
installieren.Alle diese Funktionen lassen sich kinderleicht bedienen und
das Bootmen&uuml; sowie der Scroller sehen auch gut aus. Das einzige Manko
an diesem Programm ist,das die Files beim Linkkiller nicht auf Fileviren
wie den IRAK Virus gepr&uuml;ft werden.Ansonsten kann ich dieses Programm,
vor allen Dingen wegen seiner Tools,empfehlen!</P>

<P>Nun ein Test zum NUKE Viruskiller Version 1.4. Der Nuke hat eine simple
aber ausreichende Oberfl&auml;che. Direkt beim Start checkt er den Speicher
ab und falls dieser infiziert sein sollte kann man zwischen einem Reset
oder weitermachen w&auml;hlen.Hat man keinen Virus im Speicher so checkt er
die Disketten in den angeschlossenen Laufwerken auf Viren ab.Leider zeigt
er beim Bootblockcheck alles als m&ouml;glichen Virus an, was nicht dem
Programmeigenen Bootblock entspricht.So mu&szlig; man erstmal den Bootblock
im ASCII Format ansehen und nachschauen ob es sich nicht um einen Bootblock
handelt,den man selber installiert hat,oder der bei Originalprogrammen als
Laderoutine dient!Falls man den vorhandenen Bootblock l&ouml;schen
will,installiert der Nuke den LSD Bootblock.Diesen habe ich im
sp&auml;teren Verlauf getestet!(siehe unten) Au&szlig;erdem pr&uuml;ft der
Nuke noch auf Linkvieren und ein paar Fileviren.Da das Virenverzeichnis
nicht sehr gro&szlig; ist,&uuml;bersieht er einige Virusse.Das
gr&ouml;&szlig;te Problem stellt der Linkcheck dar.Er sieht wahrscheinlich
nur nach dem Disk-Validator und wenn der nicht in Ordnung ist repariert er
die ganze Diskette.Alles sch&ouml;n und gut, aber wenn man keinen
Disk-Validator auf der Diskette hat, macht er einfach weiter und
&uuml;bersieht so z.B. den Irak in den Files,der ja bekanntlich sehr oft
mit dem DV auftritt.Als Zielverzeichnisse f&uuml;r den Virencheck kann man
&uuml;brigends die g&auml;ngigen wie DF0:,DF1: usw. w&auml;hlen. Wir kommen
zum H&ouml;hepunkt des Abends.Meiner Meinung nach der beste Virenkiller zur
Zeit.Wir kommen zu VT SCHUTZ Version 2.60.Die Anleitung und die
Ausf&uuml;hrungen zu den einzelnen Tools sind sehr gut geschrieben.
Ok,sobald man VT gestartet hat wird ein System Check
durchgef&uuml;hrt.Dabei wird angezeigt um was f&uuml;r ein Betriebssystem
es sich handelt und welche Kickstart verwandt wurde.Au&szlig;erdem wird ein
PAL Check durchgef&uuml;hrt. Es werden alle Vektoren angezeigt und bei
Abweichungen handelt das Programm entsprechend.Handelt es sich um Viren
setzt VT die Vektoren zur&uuml;ck und &uuml;berschreibt das Virenprogramm
mit Nullen.So ist kein Reset mehr n&ouml;tig. Dann kommt man in den
eigentlichen Betriebsbildschirm. Man kann nun einzeln einen Bootblock
Check,einen Rootblock Check,`nen Filetest,einen BlockITest machen oder die
Blockkette durchchecken.Dabei kann man jeweils sein Ziellaufwerk
angeben.Bootbl&ouml;cke k&ouml;nnen glaube ich auch gespeichert werden(habs
noch nicht probiert!).Au&szlig;erdem kann man noch die Startup-Sequence
einer beliebigen Diskette ansehen.Wenn man den perfekten Schutz haben will,
macht man all diese einzeln ausf&uuml;hrbaren Virenchecks in einem
Abwasch.Dazu w&auml;hlt man den Disk Check bei dem je nach Wunsch diese
Programme nacheinander ausgef&uuml;hrt werden. Beim Bootblockcheck wird
einem angezeigt,um was f&uuml;r einen Bootblock es sich handelt,soweit er
VT bekannt ist. Durch die intensive &Uuml;berpr&uuml;fung der Files kann
kein Virus &uuml;bersehen werden!Wenn VT eine gepackte File untersucht,
zeigt er auch an mit welchem Cruncher sie gepackt wurde! Zusammenfassend
kann man sagen das dieser Virenkiller durch sein gro&szlig;es
Virenverzeichnis und die intensive Untersuchung der Diskette der beste
Virenkiller zur Zeit ist.</P>

<P>Puh,das w&auml;re geschafft.Ich habe hier aber noch einige Virenkiller
nicht getestet,da sie entweder nur auf einem Amiga 500(z.B. UVK
Viruskiller)laufen oder ich den Zweck der Virenkiller noch nicht
herausgefunden habe(z.B. beim SCHWARZKOPF Ram Killer)!Wenn mein Amiga 500
wieder in Ordnung ist(hat jemand billig ein Netzteil und nen
HF-Modulator???)werde ich diese nat&uuml;rlich nachreichen!</P>

<P>Ich habe noch ein paar Bootbl&ouml;cke getestet die als
(vermeindliche-)Virenkiller im Umlauf sind.</P>

<P>KILL FAST Version 1.0 l&ouml;scht alles was nicht in den Speicher
geh&ouml;rt.</P>

<P>IRQ PROTECTOR Version 2.1 sch&uuml;tz vor dem IRQ Virus.</P>

<P>RAM CLEANER macht einen Reset wenn sich ein Virus im Speicher
befindet.L&auml;uft bei mir nicht unter OS2.0!</P>

<P>BOOT BLANCER scheint auch so ne Art Ram Cleaner zu sein?!</P>

<P>LSD Bootblock Version 1.1 ist ein Utility Bootblock der vom Nuke
Viruskiller installiert wird.Im oberen Teil wird angezeigt ob der Speicher
an oder aus ist und ob die Vektoren ok sind.Mit den F-Tasten kann man den
Speicher an/aus stellen,die externen Laufwerke an/aus schalten,einen Hard
Reset oder einen ReBoot durchf&uuml;hren,den Bildschirm auf 60Hz umstellen
oder den Bootblock auf eine andere Diskette installieren. Sobald ein Virus
im Speicher ist,flimmert der Hintergrund des Bootscreens bunt auf,was den
logischen Menschenverstand veranla&szlig;t einen Reset
durchzuf&uuml;hren.Leider funktioniert dieser Bootblock nur unter OS1.3 und
vieleicht auch tiefer.</P>

<P>SYSTEM Z PROTECTOR Version V3.0 wird bei mir als Virus! angezeigt obwohl
er angeblich als Virenschutz fungieren soll!</P>

<P>Genauso stehts mit dem ASS Virus Protector Version 1.0. Angeblich auch
ein Virenkiller!</P>

<P>Falls ich hier was falsches zu den Bootbl&ouml;cken geschrieben habe
sagt es mir.Die meisten Virenkiller sagen aber an da&szlig; System Z und
der ASS Viren sind!Wenn ihr die "neuesten" Versionen der bekanntesten
PD/Shareware Virenkiller haben wollt,dann schreibt an mich oder an den
APC/TCP.</P>
</TD>
</TR>
</TABLE>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="tls.gif" alt="" width="640" height="22" border="0" usemap="#tls0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

