<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Blitzbasic</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="tls0">
<AREA shape="rect" coords="460,1,550,22" href="tls.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#9810ff">
<TR>
<TD><IMG src="tls.gif" alt="" width="640" height="22" border="0" usemap="#tls0"> </TD>
</TR>

<TR>
<TD>
<BR>

<TABLE border="0" cellpadding="4" summary="" bgcolor="#52AC63" align="center" width="80%">
<TR>
<TD>
<H2 align="center"><B>Blitz Basic 2 Test</B></H2>

<P>Blitz 2 ist eine (noch) nicht sehr verbreitete Programmiersprache. Das
liegt aber nicht etwa an der Qualit&auml;t der language, sondern eher an
der relativ schlechten Vermarktung.</P>

<P>Genug der Umschweife, Blitz 2 besteht eigentlich aus 3 Programmen, dem
Editor (ted), dem Compiler und dem User (tatah-tatah-tataahh ;-). Ok, war
en bl&ouml;der Gag. Der 3.Teil sind die Libs, die Hauptsache einer jeden
Programmiersprache.</P>

<P>Blitz 2 ist sogar in der Lage, auf die Libs des Betriebssystems
zur&uuml;ckzugreifen! Bei den Gadgets f&auml;llt dies besonders gut auf.
Erw&auml;hnenswert sind auch die vielen Hilfsutilities, die Blitz beiligen.
Da w&auml;re zum Bleistift eins, mit dem man Screens, Windows und Gadgets
(also die Oberfl&auml;che eines Proggs) ganz einfach und intuitiv aus einem
Men&uuml; ausw&auml;hlen kann. Danach generiert das Programm auf Wunsch den
Blitz 2 Code daf&uuml;r. Das macht die Einbindung der Oberfl&auml;che in
sein Proggie ganz easy.</P>

<P>(Repeat) Ja sogar C typische Listenstrukturen sind integriert,
sogenannte New Types. Diese vereinfachen das Programmieren von Verwaltungen
erheblich (Ihr k&ouml;nnt Euch wahrscheinlich gar nicht vorstellen wie
untertrieben "erheblich" in diesem Falle ist ;-). Au&szlig;erdem ist noch
der tolle Compiler erw&auml;hnenswert, der die Programme 100%ig in
MASCHINENSPRACHE umwandelt! Einer der vielen Gr&uuml;nde, warum Blitz recht
schnell abgeht!!! Ups, fast h&auml;tte ich noch die Assembler Befehle
vergessen, die man auch noch integrieren kann! Au&szlig;erdem ist
nat&uuml;rlich BASIC mit von der Party, z. B. mit globalen und lokalen
Variablen, mit Prozeduren und Statements, mit Arrays und, und, und...!!!
Alles in allem sollte man Blitz2 aber nicht alls reines BASIC sehen.<BR>
-&gt; (If Verst&auml;ndnis = FALSE THEN GOTO Repeat)</P>

<P>Trotz allem verliert man nicht so leicht die &Uuml;bersicht &uuml;ber
das verbrochene Geschreibsel. Das liegt haupts&auml;chlich an dem
leistungsstarken Editor der z. B. die Befehle gelb hervorhebt.</P>

<P>Eine weitere sehr positive Sache von Blitz ist, das die Libs (also die
"Befehlsgewalt") st&auml;ndig erweitert werden. Es gibt sogar ein eigenes
Mag, das BUM = Blitz User Mag. Zwar is dat nur in schwarz/wei&szlig;,
daf&uuml;r aber nett aufgemacht. Au&szlig;erdem w&auml;re da noch die
Hotline zu erw&auml;hnen. Diese ist besonders f&uuml;r Anf&auml;nger gut
geeignet. Gr&ouml;&szlig;ere Probleme sollte man aber doch lieber
schriftlich schildern. Momentan dauert es zwar recht lange bis man auf dem
Postweg ne Message bekommt. Trotzdem ist dieser Service alles in allem sehr
l&ouml;blich.</P>

<P>So, nu m&ouml;cht ich eine weitere Besonderheit von Blitz Basic 2
ansprechen. Da w&auml;re zum einen, die wirklich <B>fabelhafte</B>
Grafikunterst&uuml;tzung (IFF Format) von Blitz, was aber auch auf den
Sound zutrifft(Mod Dateien). Selbst Anims lassen sich in sein Programm
einbinden!</P>

<P>Jetzt kommen wir zu den Schwachpunkten. Ach herje, dazu kann ich ja
reingarnichts schreiben. &Auml;ehm, leider doch, das Handbuch k&ouml;nnte
gelinde ausgedr&uuml;ckt wirklich besser geschrieben sein. Besonders bei
den Statements und Funktionen kommt man ohne Mathematiklehrer bzw. einem
Mathestudium kaum weiter! Das Handbuch ist wirklich ziemlich in die Hose
gegangen. F&uuml;r Amigianer die schon Programmiererfahrung haben, sollte
das aber eigentlich kein gro&szlig;es Hindernis sein!</P>

<P>Au&szlig;erdem kommt wahrscheinlich bald mein Workshop (Prahl :-) Zu
Blitz 2. Lest Euch hierzu bitte doch mal</P>

<H3 align="center">DAS FILE "UMFRAGE!"</H3>

<P>durch. Da findet Ihr &uuml;brigens auch einen Hinweis auf ein Blitz2
Demo und ein anderes Programm (aufbl&auml;h ;-). Das File f&auml;hrt
wahrscheinlich beim `ToolsTheke` rum.</P>

<P>Hab ich eigentlich schon erw&auml;hnt, da&szlig; mit Blitz 2 z. B. das
Game Skidmarks geschrieben worden ist? Na ja, jetzt wi&szlig;t Ihr auch dat
noch. Skidmarks ist sicherlich ein Beweis daf&uuml;r, was f&uuml;r
professionelle Programme sich mit Blitz2 schreiben lassen. Blitz kennt in
der V1.8 (die Aktuellste) ca. 600 Befehle. Wird allerdings alle ca 2-4
Monate erweitert. Das letzte mal gabs 100(!) neue Befehle.</P>

<P>Allerdings mu&szlig; ich erw&auml;hnen, da&szlig; die M&ouml;glichkeiten
im Anwendungsbereich (NOCH) nicht ganz "perfekt" sind. Ich vermisse
besonders einen Befehl zum alphabetischen und numeren Sortieren von
Strings. Momentan gibt es daf&uuml;r "nur" ne Routine, die man sich auf
Wunsch zuschicken lassen kann. Is aber nach eigenen Angaben des Autors sehr
langsam. Da Blitz jedoch st&auml;ndig verbessert wird, ist das bestimmt
bald Schnee von Gestern!</P>

<P>Blitz verschlingt auch nicht sehr viel Speicher. Wenn man das Programm
von Disk startet, reicht 1 MB Arbeitsspeicher von Fest platte sollten es
aber schon 1,5MB sein. Ich hab mit meinem A1200 jedenfalls noch keine
Speicherprobleme bekommen!</P>

<P>Jetzt bleibt nur noch die Frage nach dem Preis des ganzen
Vergn&uuml;gens. Keine angst, jetzt kommt nicht der gro&szlig;e =8-0, denn
das Progg kostet nur ca. 220DM!!</P>

<P>In dem Preis ist wie schon erw&auml;hnt, das Programm selbst, noch ein
zus&auml;tzlicher Editor mit dem man auch ganz normale ASCII Texte
schreiben kann und auch noch der Hammercompiler drinn!!</P>

<P>Wer det jetz etwa teuer findet, dem is auch net mehr zu helfe!</P>

<P>So, wie Ihr bestimmt gemerkt habt, bin ich restlos von Blitz 2
begeistert. Deshalb kann ich Euch, solange Ihr nicht ein #-( habt, nur
empfehlen, sich dat Megagoile Blitz Basic 2 zu kaufen.</P>

<P>Also dann, holt Euch endlich das Teil. Zum Beispiel bei</P>

<P>Blitz Basic Distribution<BR>
Th-Heuss-Ring 19-21<BR>
50668 K&ouml;ln<BR>
Tel.:0221/7710922</P>

<P>----------------<BR>
Michael Hilscher<BR>
----------------</P>
</TD>
</TR>
</TABLE>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="tls.gif" alt="" width="640" height="22" border="0" usemap="#tls0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

