<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Virus Z</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="tls0">
<AREA shape="rect" coords="460,1,550,22" href="tls.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#424242">
<TR>
<TD><IMG src="tls.gif" alt="" width="640" height="22" border="0" usemap="#tls0"> </TD>
</TR>

<TR>
<TD>
<BR>

<TABLE border="0" cellpadding="4" summary="" bgcolor="#BABABA" width="80%" align="center">
<TR>
<TD>
<H2 align="center">Testbericht zum Virenkiller VIRUS Z</H2>

<H3 align="center">Geschrieben von Norman Schlegel</H3>

<P>Ich testete die Version 3.07 von Virus Z. Komisch da&szlig; das Programm
auf einem A1200 st&auml;ndig irgendwelche Versionen der req.librarys
braucht (+38,+37) und ich es nur zum arbeiten &uuml;berreden konnte wenn
ich mit der Virenkiller Disk Nr.6 bootete und es dann &uuml;ber die
Workbench aufrief?! Naja,ich habs geschafft und nun geht es aber los...</P>

<P>Nach dem Aufruf von Virus Z testet VZ alle Bootbl&ouml;cke der
eingelegten Disketten auf unbekannte Bootbl&ouml;cke oder Viren ab. Ist ein
Bootblock unbekannt hat man die M&ouml;glichkeit in ein Unterprogramm
namens `Bootlab` zu gelangen. Hier kann man sich erstmal ein Laufwerk
aussuchen und den Bootblock nach Belieben bearbeiten. Mit der Funktion
`Read` und der Funktion `Write` kann man sich einen Bootblock ansehen oder
einen neuen Boot-block auf Disk schreiben. Diesen kann man vorher mit
`Load` und `Save` von einer anderen Diskette laden oder aber auch auf eine
beliebige Disk abspeichern. Mit `Install` kann man Disketten neu
installieren.Dabei wird automatisch der OFS Bootblock installiert.Was man
mit `Quite` machen kann d&uuml;rfte jedem bekannt sein, oder?</P>

<P>Neben dem gerade genannten Bootlab kann man aber auch einen `File Check`
durchf&uuml;hren, wobei einzelne Dir`s oder Files auf Viren gepr&uuml;ft
werden. &Auml;hnlich dem Filecheck ist der sog.`Sector Check`. Hierbei wird
allerdings die komplette Diskette auf Viren gepr&uuml;ft. Mit dem `Vector
Check` kann man die System Vektoren &uuml;berpr&uuml;fen und sich die
aktuelle Kickstartversion und einiges mehr anzeigen lassen. `About`
d&uuml;rfte jedem klar sein und au&szlig;erdem kann man noch die
Voreinstellungen ver&auml;ndern. Hier hat man auch noch mal einige
M&ouml;glichkeiten, welche ich aber hier aus Platzgr&uuml;nden nicht alle
aufz&auml;hlen m&ouml;chte. Am besten ihr seht euch noch den n&auml;chsten
Screenshot an! Was die Einstellungen bedeuten m&uuml;&szlig;te auch klar
sein. Alle diese eben genannten Virentests usw. mu&szlig; man
&uuml;brigends &uuml;ber ein Pull-Down-Men&uuml; anw&auml;hlen. Ich kann
Virus Z nur empfehlen.</P>
</TD>
</TR>
</TABLE>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="tls.gif" alt="" width="640" height="22" border="0" usemap="#tls0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

