<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>DPaint IV AGA Teil 5</TITLE>
</HEAD>

<BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
<TR>
<TD>
<MAP name="inh0">
<AREA shape="rect" coords="460,1,550,22" href="inh.html" alt="zum Inhalt">
</MAP> <BR>

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="" bgcolor="#800000">
<TR>
<TD><IMG src="inh.gif" alt="" width="640" height="22" border="0" usemap="#inh0"> </TD>
</TR>

<TR>
<TD>
<H1 align="center"><B><FONT color="#ffff00">Deluxe Paint IV AGA<BR>
5. Teil</FONT></B></H1>
<BR>

<TABLE border="0" cellpadding="4" summary="" bgcolor="#00ffff" width="80%" align="center">
<TR>
<TD>
<P>Ein Hallo zum 5. Teil des DPaint IV AGA Workshops. Nachdem ich den
Schulstre&szlig; hinter mir habe (siehe 4. Teil), kann ich mich heute voll
und ganz dem DPaint Workshop widmen, der diesmal, wie versprochen, etwas
umfangreicher ausf&auml;llt. Ich hoffe, das ist mir gelungen. Auch weiter
freue ich mich &uuml;ber jeden Verbesserungsvorschlag. Wer vergangene
Ausgaben des DPaint Workshops verpa&szlig;t hat, der besorgt sich am besten
die jeweilige Ausgabe der NoCover oder bei mir. Hier meine Adresse:</P>

<TABLE border="0" align="center" summary="">
<TR>
<TD>Stefan&nbsp;Wunner<BR>
Starkenfeldstr. 22<BR>
<BR>
96050 Bamberg<BR>
Tel.: 09 51 / 1 71 26</TD>
</TR>
</TABLE>
<BR>
                         

<P>Also, wie im letzten Teil angek&uuml;ndigt, m&ouml;chte ich diesmal das
Pinsel-Men&uuml; von DPaint vorstellen.</P>

<P>Los geht`s:</P>

<H3><U>Das Pinsel-Men&uuml;</U></H3>

<P>Hier werden jetzt nacheinander alle Men&uuml;punkt aufgelistet. Bei
jedem Men&uuml;punkt steht eine Erkl&auml;rung und/oder ein Beispiel
dazu.</P>

<UL>
<LI><B>Pinsel/Laden:</B><BR>
Dieser Men&uuml;punkt dient zum Laden eines Pinsels.</LI>

<LI><B>Pinsel/Speichern:</B><BR>
Dieser Men&uuml;punkt dient zum Speichern eines Pinsels.</LI>

<LI><B>Pinsel/Kopieren:</B><BR>
Hier wird der Aktuelle Pinsel in den Zwischenspeicher kopiert. Beispiel:
Malen Sie irgendeinen Kreis oder ein Rechteck und nehmen Sie ihn als Pinsel
auf. Dann w&auml;hlen Sie den Men&uuml;punkt Pinsel/Kopieren aus. (Weiter
geht`s beim n&auml;chsten Men&uuml;punkt)</LI>

<LI><B>Pinsel/Einf&uuml;gen:</B><BR>
Wenn Sie sich einen Pinsel in den Zwischenspeicher kopiert haben und ihn
wieder einf&uuml;gen wollen, m&uuml;ssen Sie diesen Men&uuml;punkt
ausw&auml;hlen. Beispiel Fortsetzung: W&auml;hlen Sie irgendeinen anderen
kleinen Pinsel aus (z. B. in der Werkzeugleiste ganz oben den kleinsten
ausw&auml;hlen). Dann w&auml;hlen Sie den Men&uuml;punkt
Pinsel/Einf&uuml;gen aus und der alte Pinsel erscheint wieder, da er ja im
Zwischenspeicher abgelegt wurde und man ihn mit diesem Men&uuml;punkt
wieder holen kann.</LI>

<LI><B>Pinsel/Alter Pinsel:</B><BR>
Damit kann der letzte Anwenderpinsel wiederhergestellt werden.</LI>

<LI><B>Pinsel/2.
Bild/Pinsel&gt;Spare:</B><BR>
Der aktuelle Pinsel wird auf die Position des Extrapinsels versetzt. Der
Extrapinsel ist aber nicht sichtbar.</LI>

<LI><B>Pinsel/2.
Bild/Pinsel&lt;&gt;Spare:</B><BR>
Der aktuelle Pinsel wird mit dem
Extra-Pinsel getauscht.</LI>

<LI><B>Pinsel/2.
Bild/Metamorphose:</B><BR>
Hier wird eine Metamorphose vom aktuellen Pinsel auf den Extra- Pinsel
gemacht. Vorher erscheint noch der Anim-Pinsel-Requester, in den man
eingeben mu&szlig;, wie viele Phasen man erzeugen m&ouml;chte. Die
Ergebnisse mit den Metamorphosen in&nbsp;DPaint sind nicht so gut, wie in
anderen, speziell darauf abgestimmten Programmen, aber mit etwas Geduld
bekommt man doch sch&ouml;ne Ergebnisse.</LI>

<LI><B>Pinsel/Gr&ouml;&szlig;e/Ziehen:</B><BR>
Dieser Men&uuml;punkt dient zum vergr&ouml;&szlig;ern oder verkleinern von
Pinsel in eine beliebige Richtung. Nach Auswahl dieses Men&uuml;punktes
erscheint anstelle des Mauszeigers das Wort "Size". Jetzt m&uuml;ssen Sie
die linke Maustaste gedr&uuml;ckt halten, und den Pinsel beliebig
vergr&ouml;&szlig;ern bzw. verkleinern. Hat der Pinsel die gew&uuml;nschte
Gr&ouml;&szlig;e erreicht, lassen Sie einfach die Maustaste los.</LI>

<LI><B>Pinsel/Gr&ouml;&szlig;e/Halbieren:</B><BR>
Der aktuelle Pinsel wird in beide Richtungen um 50% verkleinert. Beispiel:
Angenommen ein Pinsel hat eine Gr&ouml;&szlig;e von 500x500. Nach Auswahl
dieses Men&uuml;punkts ist der Pinsel dann nur noch 250x250
gro&szlig;.</LI>

<LI><B>Pinsel/Gr&ouml;&szlig;e/Verdoppeln:</B><BR>
Der aktuelle Pinsel wird in beide Richtungen verdoppelt. Wieder ein kleines
Beispiel: Ein Pinsel hat momentan eine Gr&ouml;&szlig;e von 50x50. Nach der
Auswahl dieses Men&uuml;punktes hat der Pinsel dann eine Gr&ouml;&szlig;e
von 100x100.</LI>

<LI><B>Pinsel/Gr&ouml;&szlig;e/Doppel Horiz:</B><BR>
Der Pinsel wird in horizontaler (x-) Richtung verdoppelt.</LI>

<LI><B>Pinsel/Gr&ouml;&szlig;e/Doppel Vert:</B><BR>
Der Pinsel wird in vertikaler (y-) Richtung verdoppelt.</LI>

<LI><B>Pinsel/Kippen/Horiz:</B><BR>
Damit kippt man den aktuellen Pinsel an der horizontalen(x-) Achse.</LI>

<LI><B>Pinsel/Kippen/Vert:</B><BR>
Damit kippt man den aktuellen Pinsel an der vertikalen (y-) Achse.</LI>

<LI><B>Pinsel/Kante/Kontur:</B><BR>
Der Pinsel wird in einer Umri&szlig;lienie (1-Pixel breit) in der aktuellen
Farbe Umrandet. Das macht sich besonders bei Schriftz&uuml;gen gut. Aber
auch bei Kreisen, Rechtecken oder &auml;hnliches schaut das nicht schlecht
aus. Wenn man das &ouml;fters und mit verschiedenen Farben macht, bekommt
man ein sch&ouml;nes Muster. Beispiel: Nehmen Sie irgendein Rot und ziehen
Sie ein nicht ausgef&uuml;lltes Rechteck. W&auml;hlen Sie das Rechteck als
Pinsel auf. Wechseln Sie die Farbe in Gr&uuml;n. Dr&uuml;cken Sie dann die
Taste "o" oder nehmen Sie den Men&uuml;punkt Pinsel/Kante/Kontur. Sie
sehen, es sieht nicht schlecht aus.</LI>
</UL>

<P>Machen Sie das ganz einfach weiter, indem Sie immer eine andere Farbe
w&auml;hlen und dann die Taste "o" dr&uuml;cken bzw. den Men&uuml;punkt
ausw&auml;hlen.</P>

<UL>
<LI><B>Pinsel/Kante/K&uuml;rzen:</B><BR>
Hier wird eine 1-Pixel breite Schicht um den aktuellen Pinsel entfernt.</LI>

<LI><B>Pinsel/Drehen/90 Grad:</B><BR>
Der aktuelle Pinsel wird um 90 Grad gedreht. Pinsel/Drehen/Beliebig:<BR>
Hat man diesen Men&uuml;punkt angew&auml;hlt, kann man den Pinsel beliebig
drehen. Einfach mit dem Mauszeiger herumfahren, bis die Position
stimmt.</LI>

<LI><B>Pinsel/Drehen/Scheren:</B><BR>
Damit kann der Pinsel beliebig verzerrt werden. Ganz Einfach:
Men&uuml;punkt aufrufen und mit dem Mauszeiger herumfahren, bis die
Position stimmt.</LI>

<LI><B>Pinsel/Biegen/Horiz:</B><BR>
Der Pinsel wird in die horizontale Richtung gebogen.</LI>

<LI><B>Pinsel/Biegen/Vert:</B><BR>
Der Pinsel wird in die vertikale Richtung gebogen.</LI>

<LI><B>Pinsel/Griff/Drehen:</B><BR>
Hier kann festgelegt werden, ob der Cursor den Pinsel in der Mitte
h&auml;lt oder an einer der vier Ecken.</LI>

<LI><B>Pinsel/Griff/Plazieren:</B><BR>
Mit Hilfe dieses Men&uuml;punktes kann man den Abstand zum Pinsel
festlegen.</LI>

<LI><B>Pinsel/Frei:</B><BR>
Hier wird der Pinsel aus dem Arbeitsspeicher gel&ouml;scht.</LI>
</UL>

<P>So, da&szlig; w&auml;re geschafft; Ich hoffe, ich konnte Ihnen das
PinselMen&uuml; ein bi&szlig;chen n&auml;her bringen. Dies ist
wahrscheinlich auch der vorletzte Teil des DPaint-Workshops. Das
n&auml;chstes Mal folgt dann der letzte. Es sei denn, es schreiben mich
viele Leser an, die m&ouml;chten, da&szlig; ich den DPaint-Workshop noch
weiterf&uuml;hre. Im n&auml;chsten Teil werde ich einmal das
Farbe-Men&uuml; erkl&auml;ren.</P>

<P>Wer noch Fragen hat kann mich ja anrufen oder anschreiben.</P>

<P>Bis zum n&auml;chsten Mal<BR>
Stefan Wunner</P>
</TD>
</TR>
</TABLE>
<BR>
<BR>
</TD>
</TR>

<TR>
<TD><IMG src="inh.gif" alt="" width="640" height="22" border="0" usemap="#inh0"> </TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

