<html>
<head>
<!-- "author" content="Wolf Zimmer"     -->
<title>EMail-Knigge</title>
</head>
<body background="wolf1.gif" text=black link=blue vlink=blue bgcolor=gray>
<a href="onl_email00.html#inh"> zum Inhaltsverzeichnis </a>
<br>

<h2>Der inhaltliche Zusammenhang</h2>

<p>In einem Gespr&auml;ch gibt es ein gewisse &Uuml;bereinstimmungen und
Gemeinsamkeiten zwischen den Gespr&auml;chsteilnehmern. Man befindet sich
z.B. am selben Ort oder man spricht - am Telefon - zur selben Zeit
miteinander. Bei Texten ergibt sich diese Gemeinsamkeit aus dem Medium, auf
dem er sich befindet, d.h. der Text steht z.B. in den Unterlagen einer
Konferenz, auf einer Geburtstagkarte oder in einem Diktatheft. </p>

<p>Bei Emails wissen Sie nichts &uuml;ber den Wohnort, die Gem&uuml;tslage,
den Beruf, die Hobbys oder die Bedeutung des Absenders f&uuml;r Ihr Leben.
Das bedeutet, dass Sie, neben anderen Dingen, sehr darauf achten
m&uuml;ssen, welche Informationen Sie &uuml;ber den Hintergrund der
Nachricht geben. Dieser Abschnitt wird Ihnen daf&uuml;r einige Strategien
zeigen. </p>

<h3>Sinnvolle Formulierungen in der Betreff-Zeile </h3>

<p><i>(In vielen Programm bezeichnet man &quot;Betreff&quot; als
&quot;Subject&quot;) </i></p>

<p>Ein Betreff-Text, der klar den Inhalt bezeichnet, hilft dem
Empf&auml;nger sich geistig auf den Inhalt der Email einzustellen, ohne sie
zu lesen. Der Betreff-Text sollte kurz (einige Programme k&uuml;rzen lange
Betreff-Texte) sein und einen Hinweis auf den Inhalt der Nachricht geben
(es muss sich nicht um einen grammatikalisch vollst&auml;ndigen Satz
handeln). </p>

<p>Wenn Sie mit Ihrer Nachricht auf eine Email antworten, wird Ihr
Email-Programm in der Regel ein Re: oder RE: (f&uuml;r <i>regarding</i> -
bez&uuml;glich) in Ihre Betreff-Zeile setzen. Sollte Ihr Programm dies
nicht tun, w&auml;re es gut, das Re: per Hand einzusetzen: </p>

<p><tt>Betreff: Re: Deine Email-Anleitung</tt></p>

<p>Wenn Sie eine Nachricht versenden, die nicht besonders wichtig ist und
auf die Sie keine Antwort erwarten, sollten Sie die Betreff-Zeile mit der
Formulierung FYI: (<i>For Your Information</i> -zu Ihrer Information)
einleiten: </p>

<p><tt>Betreff: FYI: Kekse im Aufenthaltsraum</tt></p>

<p>F&uuml;r eilige Nachrichten, sollten sie URGENT (EILT) verwenden
(insbesondere wenn der Empf&auml;nger viele Emails bekommt):</p>

<p><tt>Betreff: URGENT: Treffen mit Chef verlegt</tt></p>

<p>F&uuml;r Anfragen verwenden Sie am besten REQ (<i>Request</i>
-Anfrage):</p>

<p><tt>Betreff: REQ: Aktuelle Umsatzzahlen</tt></p>

<p>Tun Sie sich selbst einen Gefallen und eliminieren Sie das Wort
&quot;Information&quot; aus der Betreff-Zeile (und am besten auch aus dem
Text). Als ich Webmaster der University of Illinois at Urbana-Champaign
war, bekam ich eine Reihe von Emails, die so aussahen:</p>

<p><tt>Betreff: Informationen</tt></p>

<p><tt>Bitte senden Sie mir Informationen &uuml;ber die UIUC.</tt></p>

<p>Solche Emails gaben mir wenige Hinweise darauf, was die Person von mir
wissen wollte: Zulassungsbedingungen? Zahl der Studenten?
Fl&auml;cheninhalt? Anzahl der Geb&auml;ude? Sollte ich diese
&quot;Informationen&quot; per Brief versenden oder URLs angeben? Das
einzige, was ich tun konnte, war nach dem Zusammenhang zu fragen. Emails
wie diese sind da wesentlich besser:</p>

<p><tt>Betreff: Geschichte der UIUC </tt></p>

<p><tt>Gibt es irgendwelche Internet-Seiten &uuml;ber die Geschichte der U
of I?</tt></p>

<hr>

<p><i>Die obengenannten Bezeichnungen entstammen dem englischen
Sprachgebrauch. Da Englisch die Sprache des Internets ist, spricht nichts
dagegen, sie auch in Deutschland zu verwenden (Anm. d. &Uuml;.)</i></p>

<hr>

<h3>Zitate</h3>

<p>Wenn Sie sich auf eine fr&uuml;here Email beziehen, sollten Sie diese
Email zitieren, um den inhaltlichen Zusammenhang herzustellen.</p>

<p>Also nicht so:</p>

<p><tt>Ja!</tt></p>

<p>sondern so:</p>

<p><tt>&gt; Kommst Du zu der Party am Freitag?</tt></p>

<p><tt>Ja!</tt></p>

<p>Das gr&ouml;&szlig;er-als-Zeichen (&gt;) ist die g&auml;ngigste Art, zu
zitieren. Einige Email-Programme verwenden aber auch andere Zeichen. </p>

<p>Auch wenn Sie auf die Email ausf&uuml;hrlich antworten, sollten Sie
zitieren. Stellen Sie sich nur vor, Sie bekommen am Montag diese Antwort
auf eine Email vom Freitag, an die Sie sich schon nicht mehr erinnern.</p>

<p><tt>&gt; Ich habe mit ihnen gesprochen, aber sie
wollten sich noch selbst etwas &uuml;berlegen.</tt></p>

<p>Ihre erste Reaktion w&auml;re sicher ein &quot;Hee???&quot;. Viel
leichter w&auml;re eine Email zu verstehen, die so aussieht:</p>

<p><tt>&gt; Ich habe gerade Hendrik in der Bibliothek
getroffen. Er hat es endlich geschafft, daher feiert<br>
&gt; er am 19.Dezember seine Examens-Party. Ich denke, wir sollten
irgendeine nette Sache<br>
&gt; planen, um ihn zu &uuml;berraschen - vielleicht ein Lied singen oder so.
Frage doch mal Gesche<br>
&gt; und Nils, ob sie mitmachen wollen. </tt></p>

<p><tt>Ich habe mit ihnen gesprochen, aber sie wollten sich noch selbst
etwas &uuml;berlegen. </tt></p>

<p>Dies ist schon wesentlich besser, aber hier ist zuviel zitiert worden.
Die ersten zwei Zeilen haben nichts mit der Frage zu tun, die beantwortet
werden sollte. Sie sollten nur soviel zitieren, dass der Zusammenhang klar
wird -nicht mehr (Peter Kimble, mein Informatik-Lehrer an der High-School,
gibt seinen Sch&uuml;ler den Hinweis, dass mindestens die H&auml;lfte der
Zeilen einer Email-Nachricht von Ihnen sein sollte.) Sie brauchen nur
soviel zu zitieren, um den Zusammenhang klar zu machen:</p>

<p><tt>&gt; Ich denke, wir sollten irgendeine nette
Sache planen, um ihn zu &uuml;berraschen - <br>
&gt; vielleicht ein Lied singen oder so. Frage doch
mal Gesche und Nils, ob sie mitmachen wollen. </tt></p>

<p><tt>Ich habe mit ihnen gesprochen, aber sie wollten sich noch selbst
etwas &uuml;berlegen.</tt></p>

<p>Das ist ausreichend Zusammenhang, aber die Antwort ist immer noch
reichlich knapp. Eine gute Regel ist, sich genau die Pronomen in den ersten
drei S&auml;tzen anzusehen. Wenn sich diese nicht eindeutig auf die
fr&uuml;here Email beziehen, sollte man sie durch konkrete ersetzen.</p>

<p><tt>&gt; Ich denke, wir sollten irgendeine nette
Sache planen, um ihn zu &uuml;berraschen [...] <br>
&gt; Frage doch mal Gesche und Nils, ob sie
mitmachen wollen. </tt></p>

<p><tt>Ich habe mit Nils am Freitag gesprochen. Er fand Deine Idee ziemlich
gut, wollte aber noch Gesche fragen. Am Sonnabend hat er mich dann
angerufen und gesagt, Gesche h&auml;tte sich schon ein Spiel &uuml;berlegt,
dass sie mit Hendrik spielen wollten. Da aber noch nicht ganz klar war, ob
das klappen w&uuml;rde, versprach er, mich n&auml;chste Woche Dienstag
wieder anzurufen.</tt></p>

<p>Nun ist die Antwort klar und eindeutig. Da sich die Antwort klar auf die
vorige Email bezieht und der Zusammenhang eindeutig ist, mu&szlig; auch
nicht mehr soviel Text zitiert werden. Antworten wie diese, bei denen der
Zusammenhang in der Antwort kenntlich wird, sind am einfachsten zu
verstehen. Ungl&uuml;cklicherweise braucht man auch l&auml;nger, um sie zu
schreiben.</p>

<p>Wenn Sie einen Satz zitieren wollen, der in einem Absatz steht,
entfernen Sie alles, was Sie nicht interessiert und ersetzen diesen Teil
mit drei P&uuml;nktchen (wie oben). Sie k&ouml;nnen auch eckige Klammern
verwenden &quot;[]&quot; , um Inhalte zusammenzufassen, z.B.:</p>

<p><tt>Ich denke, wir sollten eine nette Sache planen, [Lied, Spiel]
...</tt></p>

<p>Wenn die Nachricht f&uuml;r Sie nicht wichtig genug ist, um die
entsprechenden Stellen zu zitieren, f&uuml;gen Sie die gesamte Nachricht am
Ende an. Damit braucht der Leser nicht darauf zu sehen, es sei denn, er
versteht den Zusammenhang nicht. </p>

<hr>

<h3>Zusammenfassung</h3>

<p>Sie kennen den Zusammenhang, ihr Leser aber vielleicht nicht. Verwenden
Sie daher, <ul>
<li>sinnvolle Betreff-Zeilen
<li>Vermeiden Sie Pronomen in den ersten drei Zeilen
<li>Zitieren Sie die vorherige Nachricht.
</ul> </p>

<hr>

<p>Weiter zum Thema <a href="onl_email02.html">Textgestaltung</a><br>
zur&uuml;ck zur <a href="onl_email00.html"> Startseite </a><br>
zur&uuml;ck zum <a href="onl_email00.html#inh"> Inhaltsverzeichnis </a> </p>

<hr>
<br>
</body>
</html>



