<html>
 <head>
  <title>Labo&nbsp;: MorphOS 1.4</title>
  <meta name="author" CONTENT="David Brunet obligement@free.fr">
 </head>

<body bgcolor="#000000" text="#cccccc" link="#cccc33" vlink="#aaaa22" alink="#cccccc" marginheight="0" marginwidth="0" topmargin="5" leftmargin="0">

<a name="top">

<map name="ObMap">
  <area shape="rect" coords="0,0,760,82" href="http://obligement.free.fr">
  <area shape="rect" coords="8,87,62,104" href="../index.html" alt="Intro">
  <area shape="rect" coords="80,87,168,104" href="edito.html" alt="Editorial">
  <area shape="rect" coords="186,87,278,104" href="apropos.html" alt="A Propos">
  <area shape="rect" coords="296,87,399,104" href="sommaire.html" alt="Sommaire">
  <area shape="rect" coords="414,87,473,104" href="quizz.html" alt="Quizz">
  <area shape="rect" coords="491,87,589,104" href="musiques.html" alt="Musiques">
  <area shape="rect" coords="607,87,648,104" href="pub.html" alt="Pub">
  <area shape="rect" coords="666,87,756,104" href="archives.html" alt="Archives">
</map>

<table align="center" width="760" height="100%" background="../gfx/fondsommaire.jpg" bgcolor="#113333" cellspacing="0" cellpadding="0">
 <tr>
  <td align="center">
   <img src="../gfx/oblogo.jpg" ismap usemap="#ObMap" border="0" height="108" width="760" alt="Obligement">

   <br><br><br>
   <table align="center" width="75%">
    <tr>
     <td>

<div align="center"><font size="+3">Labo&nbsp;: MorphOS 1.4 </font>par&nbsp;<a href="mailto:niffo@free.fr">Nicolas&nbsp;Gressard</a></div><br><br><br>


<font size="+1" color="#ccbb33">Version 1.4</font><br><br>

Voici, quelques jours apr&egrave;s sa sortie officielle, une pr&eacute;sentation de la nouvelle
version de MorphOS. Nous allons voir ici ses principales nouveautés ainsi que tout ce
qui n'a pas encore été implémenté.<br><br>

<font size="+1" color="#ccbb33">Installation ou mise &agrave; jour</font><br><br>

En ce qui concerne le boot sur le cédé, le
partitionnement et le formatage, cela fonctionne comme avant et je vous
renvoie pour cela au paragraphe "installation from scratch" de
l'article <a href="http://obligement.free.fr/articles/morphos13.php" target="_blank">Morphos 1.3</a>
dans Obligement N&deg;39. Boot sur le cédé, copie
des fichiers, reboot. Personnellement &ccedil;a me fait toujours
p&acirc;lir de voir comment on installe/met &agrave; jour notre
syst&egrave;me compar&eacute; &agrave; n'importe quel autre existant.
Comme dirait l'autre&nbsp;: "pourvu que &ccedil;a dure...". La bonne
surprise est qu'un script d'installation est maintenant disponible vous
permettant de mettre &agrave; jour votre syst&egrave;me sans casser
votre configuration. En effet, il &eacute;tait auparavant fortement
d&eacute;conseill&eacute; de copier les mises &agrave; jour de MorphOS
par dessus une installation existante. L'installation par mise à jour
préserve vos répertoires ENV: et S:, détecte si vous aviez une ancienne
configuration de Poseidon (pour l'effacer et/ou la transformer), préserve
vos anciennes préférences d'Ambient, préserve vos disk.info, etc. Elle ne
prend que quelques petites minutes.<br><br>

<font size="+1" color="#ccbb33">Premi&egrave;re impression</font><br><br>

L'identit&eacute; visuelle a compl&egrave;tement &eacute;t&eacute;
revue avec un skin par d&eacute;faut (subjectivement) beaucoup plus
sobre et s&eacute;rieuse.<br><br>

<div align="center"><img src="../gfx/mos14_1.jpg" title="" alt="Interface par défaut de MorphOS 1.4" width="500" height="375"><br></div><br>

M&ecirc;me le grand papillon bleu s'affichant pendant le boot &agrave;
laiss&eacute; sa place &agrave; un petit papillon beaucoup plus plaisant
et discret. Lors de la premi&egrave;re navigation, une autre chose
saute imm&eacute;diatement aux yeux&nbsp;: la compl&egrave;te
int&eacute;gration de MUI dans MorphOS. A classer dans les
premi&egrave;res impressions &eacute;galement, le sentiment que tout est
beaucoup plus &agrave; sa place. Lorsque l'on a besoin d'une
fonctionnalit&eacute; elle se trouve le plus souvent l&agrave; ou on la
cherche (pr&eacute;f&eacute;rences, menus, etc.). La seule ombre au
tableau est certainement le fonctionnement tr&egrave;s particulier du
nouveau syst&egrave;me ModeEdit/ScreenMode. En effet, au premier boot
nous n'avons pas acc&egrave;s &agrave; des r&eacute;solutions
pr&eacute;configur&eacute;es standard. Il faut changer le moniteur par
d&eacute;faut, bricoler dans ModeEdit, rebooter, bricoler dans ScreenMode
et malgr&eacute; cela, toutes les r&eacute;solutions n'apparaissent pas
dans ScreenMode pour une raison inconnue. Le but de tous ces
changements semble &ecirc;tre l'ajout de la possibilit&eacute;
d'associer un skin &agrave; un &eacute;cran, mais il faut d'urgence
faire quelque chose pour rendre cela accessible &agrave; un
&eacute;ventuel futur grand public. Evidemment, ce problème n'apparaît
que si vous faites une installation complète, la mise à jour n'occasionne
quant à elle aucun trouble.<br><br>

<font size="+1" color="#ccbb33">Les grands retours</font><br><br>

Les deux grands disparus des versions
pr&eacute;c&eacute;dentes pour cause de trop grande instabilit&eacute;
&eacute;taient "Trance" (compilateur JIT) et
l'acc&eacute;l&eacute;ration 3D. Trance est de retour, activ&eacute; par
d&eacute;faut et acc&eacute;l&egrave;re de fa&ccedil;on
ph&eacute;nom&eacute;nale les applications 68K. Selon les logiciels, on
atteint des performances de 50% à 75% de celles d'applications natives PowerPC.<br>
L'acc&eacute;l&eacute;ration 3D est d&eacute;sormais disponible pour
les cartes Voodoo 3 et 4 et accessible &agrave; travers "TinyGL" (une
impl&eacute;mentation GL) et "Goa" (l'&eacute;mulation Warp3D). Pour
l'instant, les cartes &agrave; base de Radeon ou SIS ne peuvent pas
b&eacute;n&eacute;ficier de l'acc&eacute;l&eacute;ration 3D. Lors de nos
tests sur Voodoo 3 3000 AGP, les jeux Warp3D tels que Heretic 2 et Quake 2
ont parfaitement fonctionné sans aucun probl&egrave;me et avec un nombre d'image
par seconde largement suffisant pour &ecirc;tres parfaitement fluides. Freespace, Shogo et Descent sont
&eacute;galement connus pour fonctionner en acc&eacute;l&eacute;ration
3D sous MorphOS 1.4. Seul WipEout 2097 semble avoir des problèmes (dans certains niveaux uniquement).<br>
Enfin, on peut aussi noter le retour de l'émulation PowerUP qui avait été mise entre parenthèse dans la
version 1.3. Cette émulation permet donc d'accroître encore plus le nombre de logiciels compatibles&nbsp;:
parmi eux, Fantastic Dreams et Candy Factory sont les plus célèbres.<br><br>

<font size="+1" color="#ccbb33">Les grands attendus<br><br></font>

Parmi les grands attendus, nous avions&nbsp;:<br><br>

- AmiTCP&nbsp;: la pile TCP/IP est toujours attendue&nbsp;;).<br>
- TurboPrint&nbsp;: ce gestionnaire d'imprimantes est disponible en standard.<br><br>

<div align="center"><img src="../gfx/mos14_2.jpg" title="TurboPrint" alt="" width="407" height="310"><br><br></div>

- Frogger&nbsp;: annul&eacute;. Une version de MPlayer est actuellement en
test et sera disponible prochainement gratuitement. Il permet pour
l'instant de lire bon nombre de formats vid&eacute;o, DivX et DVD avec
sous titres et support de l'overlay.<br>
- Outils SFS&nbsp;: int&eacute;gr&eacute;s aux pr&eacute;f&eacute;rences. On peut y voir, par exemple,
des informations sur les partitions, gérer le cache en profondeur et modifier la longueur des noms
de fichiers.<br><br>

<div align="center"><img src="../gfx/mos14_3.jpg" title="" alt="Préférences pour SFS" width="466" height="318"><br><br></div>

- Pile USB Poseidon&nbsp;: elle &eacute;tait disponible en
t&eacute;l&eacute;chargement pour MorphOS 1.3. Elle est d&eacute;sormais
int&eacute;gr&eacute;e directement au noyau du syst&egrave;me ce qui
permet d'utiliser une souris et/ou un clavier USB d&egrave;s le boot. La
pr&eacute;sence d'une souris PS/2 n'est plus obligatoire. L'application
de pr&eacute;f&eacute;rence "Trident" est maintenant directement
int&eacute;gr&eacute;es aux pr&eacute;f&eacute;rences syst&egrave;me.<br><br>

<div align="center"><img src="../gfx/mos14_4.jpg" title="" alt="Préférences pour l'USB" width="451" height="256"><br><br></div>

- DefIcon&nbsp;: toujours pas de syst&egrave;me permettant de lancer un
fichier avec la bonne application s'il ne poss&egrave;de pas
d'ic&ocirc;ne.<br>
- Listeurs&nbsp;: cette fonction très utile pour la gestion des fichiers avait été aperçue dans
la précédente version mais elle était encore inutilisable. Ici, ils ont carrément disparu
de l'OS, leur retour se fera ultérieurement et surtout dans un état pleinement utilisable.<br><br> 

<font size="+1" color="#ccbb33">Les bonnes surprises</font><br><br>

Ambient, m&ecirc;me s'il n'est pas encore exempt de bogues lors de la
gestion de fichiers ou lors de l'affichage, a fait un &eacute;norme bond
en avant. Il est plus stable, une barre de dock relativement simple mais
parfaitement fonctionnelle a fait son apparition, le lasso de
s&eacute;lection est enfin l&agrave;, la taille des ic&ocirc;ne est
param&eacute;trable, les raccourcis (.backdrop) fonctionnent enfin par
glisser et déposer sur le bureau.<br><br>

Des outils inattendus mais indispensables ont fait leur apparition&nbsp;:<br><br>

- Une calculatrice simple ou scientifique multibase avec les
m&ecirc;mes fonctionnalit&eacute;s que celle de Windows.<br>
- Une loupe permettant de grossir la partie de l'&eacute;cran ou se
prom&egrave;ne la souris.<br>
- Un gestionnaire de t&acirc;ches permettant de terminer un process,
changer sa priorit&eacute; et de visualiser le pourcentage de CPU
utilis&eacute;.<br>
- Un outil affichant des statistique sur le compilateur JIT.<br>
- Kaya&nbsp;: un lecteur OggVorbis et MP3 au look tr&egrave;s Mac.<br>
- FXPaint Lite&nbsp;: un logiciel de dessin/retouche d'image. Les limitations par rapport à la version complète commerciale
porte essentiellement sur le nombre d'effet inférieur, le non-support des appareils numériques, le nombre de formats
reconnus limité et l'impossibilité d'utiliser la couche alpha.<br>
- Un bundle de logiciels commerciaux en cadeau arriv&eacute; quelques
jours avant la sortie de MorphOS 1.4. Outre FxPaint Lite, il comprend pour l'instant
les applications suivantes&nbsp;: FxScan Lite, Pro Station Audio, VHI Studio Lite ainsi que les jeux Feeble
Files, Software Tycoon et Birdie Shoot.<br><br>

<font size="+1" color="#ccbb33">Tout le reste...</font><br><br>

La mise à jour 1.4 est très vaste, de nombreuses autres améliorations ou nouveautés
ont fait leur apparition&nbsp;:<br><br>

- Support des tablettes graphiques.<br>
- Support du port joystick (lowlevel.library).<br>
- Support du DVI (sortie num&eacute;rique) sur les cartes Radeon.<br>
- Support de l'overlay pour la plupart des cartes Radeon (il manque en effet l'overlay pour les 8500 et 9100).<br>
- Nouvelles polices vectorielles.<br>
- 5 nouveaux skin et possibilit&eacute; d'utiliser un skin
diff&eacute;rente par &eacute;cran (les skins ne sont plus compatibles
avec les anciens). Il n'y a plus besoin de rebooter pour changer de
skin.<br>
- Mode autoscroll si la r&eacute;solution s&eacute;lectionn&eacute;e
d&eacute;passe celle de l'&eacute;cran.<br>
- Possibilit&eacute; de rebooter au clavier par CTRL-Win-Win (ou CTRL-Mos-Mos pour ceux qui ont personnalisé leur clavier&nbsp;;-).<br>
- Pr&eacute;sence de datatypes sonores&nbsp;: 8svx, 16sv, aiff, wave, mp3.<br>
- Nombreux bogues influant sur la stabilit&eacute; corrig&eacute;s.<br>
- Am&eacute;lioration de la compatibilit&eacute; Amiga. Plusieurs
logiciels Amiga qui ne fonctionnaient pas avec les versions
ant&eacute;rieures fonctionnent d&eacute;sormais (dont notamment quelques
des logiciels dans le domaine musical : DeliTracker, etc.).<br>
- R&eacute;sistance aux programmes instables accrue (protection de la
rom, ...).<br>
- Impl&eacute;mentation de AREXX beaucoup plus compl&egrave;te,
m&ecirc;me s'il faut toujours utiliser la "rexxsyslib.library" de son
syst&egrave;me Amiga pour &ecirc;tre parfaitement compatible.<br><br>

<font size="+1" color="#ccbb33">Conclusion</font><br><br>

Malgr&eacute; l'incr&eacute;ment du num&eacute;ro de version de
seulement 0.1, on peut consid&eacute;rer cette version de MorphOS comme
une &eacute;volution majeure. Elle apporte presque tout ce que nous
attendions et m&ecirc;me d'autres choses. Sa stabilit&eacute; semble
tr&egrave;s correcte, et &agrave; part quelques bogues d'affichages ou de
fonctionnalit&eacute;s, je n'ai &eacute;t&eacute; victime qu'une seule
fois d'un plantage d'une application syst&egrave;me&nbsp;: l'application des
pr&eacute;f&eacute;rences. MorphOS continue donc son développement d'une manière
rapide et très professionnelle.<br><br><br>


<div align="center"><a href="#top">Retour en haut</a> | <a href="sommaire.html">Retour au sommaire</a></div><br><br> 


     </td>
    </tr>
   </table>
  </td>
 </tr>
</table>


</body>
</html>

