<HTML>
<HEAD>
<TITLE>REFLECTOR 039</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.GIF">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
Vorstellung Objekt-CD</H1></CENTER>
<HR SIZE=5><P>

<FONT SIZE=4><B>Objekt-CD: Dino Collection</B></FONT><P>

Die lang angek&uuml;ndigte Objekt-CD <B>Dino Collection</B> lag nun Anfang Februar in unserem CDROM
Laufwerk. Oberland hat sich endlich mal wieder die M&uuml;he gemacht und alle Objekte mit Namen
benannt (na also, es geht doch). Auch eine Index-Datei &uuml;ber jeden Dino ist vorhanden.
Als kleines Schmankerl sind auch noch Animationen von den Dinos enthalten. Nur sind diese
mit Sicherheit nicht mit <B>REFLECTIONS</B> erstellt worden, aber dennoch sehenswert. Die
Objekte sind sehr detailliert konstruiert, leider aber nicht in Unterk&ouml;rper unterteilt. Wenn
z. B. die Beine und Arme schon definiert w&auml;ren, k&ouml;nnte man diese sch&ouml;n animieren. Es gibt
zwei Versionen der Objekte: einmal im 'Gro&szlig;'-Format f&uuml;r diejenigen Anwender, die &uuml;ber gen&uuml;gend
Speicher verf&uuml;gen und einmal im 'Klein'-Format, bei letzteren ist dann alles nicht so detailliert
aufgebaut. Alles in allem ist die CD sehr gut; man kann sich hiermit seinen eigenen Jurassik Park
aufbauen. Nur laufen wollen die lieben Tierchen in <B>REFLECTIONS</B> noch nicht so recht.<P>

<HR>

<FONT SIZE=4><B>Objekt-CD: Tree Collection</B></FONT><P>

Das ist eine CD f&uuml;r unsere Wald- und Wiesen-Freunde. Die CD beinhaltet eine Vielzahl von
B&auml;umen und B&uuml;schen. Die B&auml;ume liegen nach Gattungen sortiert in Verzeichnissen vor. Wie
z. B. Laubb&auml;ume, Nadelb&auml;ume, Palmen usw. Selbst ein paar sch&ouml;ne Wasserpflanzen sind auf 
der CD zu finden. Auch auf dieser CD sind Index-Dateien f&uuml;r jeden Baum und Strauch zu 
finden, was die suche nach dem richtigen Baum sehr erleichtert. Viel Ram und einen schnellen
Prozessor sollte man schon haben, damit die Renderzeiten im ertr&auml;glichen Rahmen bleiben. Die 
Objekte sind sehr detailliert und somit braucht man gute Hardware um nicht die Lust am
Rendern zu verlieren. Wir meinen: auch diese CD ist zu gebrauchen.<P> 

Ach ja, bekommen kann man die CD bei:<P>

<PRE><B>
        Oberland
        In der Schneithohl 5

        61476 Kronberg
        Tel. 06173-6080
        Internet: <A HREF="http://www.oberland.com">WWW.Oberland.com</A>
</B></PRE><P>

<IMG WIDTH=128 HEIGHT=102 SRC="../BILDER/DINOS.GIF" ALT="[BILD]"> Objekte Dinos</A> &nbsp;&nbsp;
<IMG WIDTH=128 HEIGHT=102 SRC="../BILDER/BAEUME.GIF" ALT="[BILD]"> Objekte B&auml;ume</A><P>

<B><I>Euer REFLECTOR-Team!</I></B><P>
     
<HR SIZE=5>
<B>
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
</B>
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
