<HTML>
<HEAD>
<TITLE>REFLECTOR 039</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.GIF">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A></P>
EDITORIAL</H1></CENTER>
<HR SIZE=5><P>

<FONT SIZE=4><B>REFLECTOR 039</B></FONT><P>

Hallo Raytracing-Freunde, ja es ist wahr: <B>REFLECTOR</B> gibbet noch. Nun stehen wir eine Ausgabe
vor der Vierzig. Fast ein Jubil&auml;um also. Uns wird sicherlich einiges f&uuml;r die n&auml;chste <B>REFLECTOR</B>
einfallen ... wir knobeln was aus. Also la&szlig;t Euch &uuml;berraschen.<P>

Kommen wir zur aktuellen Ausgabe Eures <B>REFLECTIONS-Magazins</B>. Wieder haben wir einige gute
Werke unserer Mitglieder erhalten; wie immer sind diese in der <A HREF="../GALERIE.HTM"> Art-Galerie</A>
zu bestaunen. Anhand der Bilder l&auml;&szlig;t sich leicht erkennen, da&szlig; uns <B>REFLECTIONS</B> durchaus das
Zeug hat professionellen Anspr&uuml;chen gerecht zu werden. Auch hat die <A HREF="../OBJEKTE.HTM">
Objekt-Bibliothek</A> das ein oder andere Leckerchen zu bieten. Ein besonderes Bonbon ist in
unserer <A HREF="../TOOLS.HTM"> Tool-Ecke</A> zu finden: mathematische Texturen als PlugIn vom
inzwischen bekannten <B>REFTools! Team</B>. Leider steht diese Erweiterung nur den PC-Nutzern
von <B>REFLECTIONS</B> zur Verf&uuml;gung :-((<P>

Als Schmankerl gibt es ein Bericht &uuml;ber unseren Besuch bei Grafik-Guru <A HREF="../BESUCH/TEXTE/TRICHTER.HTM">
Tobias Richter</A>. Das ist sicherlich mal einen Blick wert. Abgerundet wird das ganze dann noch
von einer Vorstellung der neuen <A HREF="CDVORSTE.HTM"> Objekt-CDs</A> von <B>Oberland</B>.<P>

Und sonst ? Alles PowerPC und so ! Inzwischen gibt <B>Beams</B> ja auch unter dem PowerPC auf dem
Amiga m&auml;chtig Gas. Da macht das Leben wieder Spa&szlig; (f&uuml;r was zum Teufel habe ich mir nun einen
Pentium 200 geholt ?). Ist wie erwartet schnell, wirklich lecker schnell. Es wird Zeit f&uuml;r den
500 MHz PPC.<P>

<B>REFLECTIONS 4.2</B> hat ja nun offiziell das Licht des Lebens entdeckt und das was da von uns
<B>Carsten Fuchs</B> gebracht wurde ist nicht von schlechten Eltern. Da gibt es nun PlugIns, da
l&auml;&szlig;t man den Playboy oder -girl schon mal in der Ecke liegen. &Uuml;berhaupt scheint <B>REFLECTIONS</B>
in Zukunft nur noch als Plattform f&uuml;r alle m&ouml;glichen PlugIns und Erweiterungen zu dienen. So in
etwa wie der Amiga nur noch als 'Halterung' dient, um den PPC nutzen zu k&ouml;nnen. Uns kann es nur
recht sein.<P>

Nachfolgend mal eine &Uuml;bersicht der neuen Features von <B>REFLECTIONS 4.2</B>:

<UL>
 <LI> neue Importformate, wie Lightwave, Imagine, VistaPro (DEM), AutoCAD und Cinema 4D<P>

 <LI> Exportformat DXF<P>

 <LI> neue Animations- und Partikeleffekte, Morphing<P>

 <LI> neue Editierfunktionen<P>

 <LI> neue Grundk&ouml;rper<P>

 <LI> interne Erweiterungen<P>

 <LI> &uuml;berarbeitete Hilfefunktionen, nun auch im HTML-Format<P>

</UL>
<P>

Dies nur als wirklich grobe &Uuml;bersicht. Besonders die Partikeleffekte haben es in sich. Da kann
man nun Schnee fallen lassen (mit Schmelzfaktor), K&ouml;rper mit Partikel f&uuml;llen oder umh&uuml;llen.
Besonders f&uuml;r Weltraumszenen gedacht bzw. geeignet ist der Effekt 'Schweif'. Sieht irre aus.<P>

Abschlie&szlig;end kann gesagt werden, da&szlig; das Update eine lohneswerte Investition darstellt. Schon
lange war unsereins nicht mehr so begeistert. Also ran an <B>REFLECTIONS 4.2</B>. Ein Info-Blatt
&uuml;ber <B>REF 4.2</B> k&ouml;nnt Ihr direkt bei Oberland anfordern, das Update nat&uuml;rlich auch.<P>

Ansonsten wollen wir Euch jetzt der Lekt&uuml;re des <B>REFLECTOR-Magazins 039</B> &uuml;berlassen.<P>

Viel Spa&szlig; mit dieser Ausgabe.<P>

<B><I>Euer REFLECTOR-Team!</I></B><P>

<HR SIZE=5><P>

<DL>
<DT>Unsere Adressen:<DD><P>

<B>Uwe Sauder<BR>
Aakerf&auml;hrstr. 104<BR>
47058 Duisburg<BR>
Tel.: 0203-338557<P>

Olaf Gr&ouml;ning<BR>
Beckeradstr. 111<BR>
45897 Gelsenkirchen<BR>
Tel.: 0209-598816<BR>
EMail: <A HREF="mailto:OlafGroening@t-online.de">OlafGroening@t-online.de</A><P>

Werner Prass<BR>
Am Feldbusch 40<BR>
45889 Gelsenkirchen<BR>
Tel.: 0209-812029</B><P>
</DL>

<DL>
<DT>Bankverbindung:<DD><P>

<B>Volksbank Gelsenkirchen-Buer, Bankleitzahl: 42260001, Konto: 130 141 100</B><P>
</DL>

<DL>
<DT>Die REFLECTIONS-Mailboxen:<DD><P>

<B>O U Z O N I X - B B S<BR>
offline:  0.00-0.06 + 3.30-4.30 h<BR>
Sysop:  Ioannis Chatziandreou<P>

Fido Line #1 2:2448/1460.0 - Tel. Nr. 0234-9351320 (US-Robotic-DS 1200-36600 Baud)<BR>
Fido Line #2 2:2448/1461.0 - Tel. Nr. 0234-9351321 (ZyXEL U1496EG+ 1200-19200 Baud)<BR>
Fido Line #3 2:2448/1462.0 - Tel. Nr. 0234-9351318 (ISDN)<BR>
UUCP: ouzonix.ruhr.de<P>

D A R K S T A R - B B S<BR>
Sysop: Scarabeus (Andreas Stevens)<P>

Port #0: Tel. Nr. 02451-66999  (Active V.34 + ISDN)<BR>
Port #1: Tel. Nr. 02451- 7918  (ZyXEL V.34 + FAX)<BR>
eMail: Scarabeus@DarkStar.tng.oche.de</B><P>
</DL><P>

Downloads aus den <B>REFLECTIONS</B>-Areas der Mailboxen sind frei !!<P>
<HR> <P>

<H3>WICHTIG WICHTIG WICHTIG WICHTIG WICHTIG WICHTIG WICHTIG</H3> <P>
 Die Archive (bzw. die Disketten) d&#252;rfen nur UNVER&#196;NDERT weitergegeben werden !
 Mailboxen, die sich mit dem Verbreiten von NAZI - Parolen und Hetze gegen
 Ausl&#228;nder und anderen Minderheiten hervortun, ist die Benutzung  von
 <B>REFLECTOR</B>-Disketten (egal ob zum Up- oder Downloaden) im ganzen oder teilweise
 (z. B. einzelne Bilder etc.) bei Strafandrohung (auch gegen User dieser Boxen)
 untersagt. Alle <B>REFLECTOR</B>-Ausgaben und Sonderdisks sind zwar im weitesten Sinne
 PublicDomain-Disks, aber kein Werbetr&#228;ger f&#252;r braune Schei&#223;e. Wir hoffen, das
 war klar und deutlich. Gleiches gilt nat&#252;rlich auch f&#252;r Mailboxen die sich mit
 dem Verbreiten linksradikal ausgerichteter Propaganda hervortun. Bei Fragen zu
 der <B>REFLECTOR</B>-PD-Serie oder zum <B>REFLECTIONS-Club</B> wendet Euch an die weiter oben
 genannten Adressen.<P>

<FONT SIZE=4><B>Copyrights</B></FONT><P>

 sind nicht ganz unwichtige Sachen. Die Bilder, Animationen, Fonts, Objekte
 und Tools usw. auf dem <B>REFLECTOR</B>-Magazin und dessen Sonderausgaben, wie der
 <B>FontBox</B>-, der <B>REFLECTUR</B>- oder <B>REFLECTOR-Objektbibliothek</B> unterliegen zum
 gro&#223;en Teil diesem Copyright. Das hei&#223;t, da&#223; keine Beitr&#228;ge ohne die
 Einwilligung des Autors f&#252;r andere Zwecke, wie z. B. Ver&#246;ffentlichung auf
 anderen PD-Serien, Verkauf oder &#228;hnliches, benutzt werden d&#252;rfen. Vom
 Copyright ausgenommen sind Beitr&#228;ge, bei denen der Autor auf sein Copyright
 verzichtet, bzw. sein Beitrag als PublicDomain, Free- oder Shareware
 deklariert hat. Entsprechende Hinweise sind in den Info-Texten zu finden.
 Das gleiche gilt selbstverst&#228;ndlich auch f&#252;r die auf <B>REFLECTOR</B> und seinen
 Sonderausgaben benutzten Programme. Die Rechte der Programme liegen beim
 jeweiligen Autor. Wenn ein Beitrag vom Autor als Shareware, Giftware oder
 anderes deklariert ist, dann ist, entsprechend den Nutzungsbedingungen des
 Autors, das gew&#252;nschte Entgeld, Geschenk oder &#228;hnliches zu entrichten.<P>
 Wir k&#246;nnen aus eigener Erfahrung sagen,da&#223; jeder Autor, der uns f&#252;r das
 <B>REFLECTOR</B>-Magazin und seinen Sonderausgaben Beitr&#228;ge zur Verf&#252;gung gestellt
 hat, dazu gerne bereit war. Bei Interesse an einer weiteren Verwendung dieser
 Beitr&#228;ge schreibt an den jeweiligen Autor. Schlie&#223;lich freut sich wohl jeder
 &#252;ber Post (wenn´s denn keine Rechnungen sind).<P>
 &#252;brigens gibt es f&#252;r das <B>REFLECTOR</B>-Magazin und seinen Sonderausgaben ebenfalls
 ein Copyright. Wir behalten uns n&#228;mlich das Recht vor, da&#223; <B>REFLECTOR</B> und seine
 Sonderausgaben nur in unver&#228;nderter Form weitergegeben werden d&#252;rfen.<P>

<HR SIZE=5>
<B>
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
</B>
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>