<HTML>
<HEAD>
<TITLE>REFLECTOR 039</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.GIF">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
Leserbriefe</H1></CENTER>
<HR SIZE=5><P>

Dem<B> REFLECTOR-Team</B> liegt viel an Eurer Meinung zu unserem Magazin, zu<B> REFLECTIONS</B> und jeden
anderen Thema. In der Abteilung Leserbriefe kann der Leser des<B> REFLECTOR</B>-Magazins sein
Statement zur Diskussion stellen.<P>

<B>Bevor es nun losgeht, etwas in eigener Sache: Wir bitten Euch uns Eure Zusendungen bzw.
Leserbriefe als ASCII - Text auf Disk zukommen zu lassen. Es ist eine &auml;u&szlig;erst undankbare
Aufgabe, seitenlange Briefe abzutippen. Hinzu kommt, da&szlig; diese meistens sowieso auf einem
Rechner geschrieben und anschlie&szlig;end ausgedruckt wurden. In Zukunft werden wir Leserbriefe,
die nicht  als ASCII-File vorliegen zwar zur Kenntnis nehmen, aber nicht ver&ouml;ffentlichen.</B><P>

<HR><P>

<A NAME="ClausPeterNandelstaedt"></A>
Uns Claus Peter Nandelsteadt aus dem sch&ouml;nen Fellbach wird heute mit einer Zuschrift beginnen. Also dann
man los:<P>

<B>Hallo Uwe.<P>

Anbei noch 2 Texturen f&uuml;r den Zug, da Du mir in 33 Pr&uuml;gel angedroht hast, wenn ich die Szene nicht
r&uuml;berschiebe. Man sollte spa&szlig;eshalber mal nachrechnen aus wieviel Teilen die Szene besteht. Viele
Objekte bestehen aus zig K&ouml;rpern, welche ja auch in Objekte gewandelt werden k&ouml;nnen. Damit d&uuml;rfte dies die
gr&ouml;&szlig;te Objektsammlung sein, welche je eingesandt wurde. Wer sich mal die M&uuml;he macht alles genau anzusehen
und nachzuvollziehen wird da manchen Trick entdecken, vor allem wie der Hintergrund mit Schatten verkn&uuml;pft
wurde.<P></B>

Dr. Reflectus:<BR>
Wir haben die 2 fehlenden Texturen gleich nach Erhalt eingef&uuml;gt. Die Szene ist schon komplett auf der
<B>REFLECTOR</B>-Ausgabe 38 zu finden. Danke f&uuml;r die schnelle Zusendung. Was eine Drohung nicht alles
bewirken kann ....<P>

<B>Du wei&szlig;t ja, da&szlig; ich Objekte nicht erst mache, wenn ich sie brauche, sondern so als Spielerei nebenher
auch schon im Voraus mache. Hier nun den Sanit&auml;ter f&uuml;r Dich. Die Texturen f&uuml;r N5. sind ja schon ver&ouml;ffentlicht
und das Bump Orange im Gips ist ja weit verbreitet kann aber auch weggelassen werden. Meine Zeilen &uuml;ber die
Esc-Taste und der Hirachie kann ich noch auf keinem Reflector finden. Mein letzte Bla Bla war auf 33.<P>

So long<P>

CPN</B><P>

Dr. Reflectus:<BR>
Auch hier ein Sorry, der Text mit dem Tip <B>ESC</B> usw. ist auf der Ausgabe 38 zu finden. Hier die
Anschrift von Claus-Peter:<P>

<PRE><B><P>
        Claus Peter Nandelsteadt
        Grunbacherstr. 3

        70736 Fellbach
        Tel.: 0711-512323
</B></PRE><P> 

<HR><P>

<A NAME="DennisSeibert"></A>
Die n&auml;chste Zuschrift stammt von Dennis Siebert. Diese hat einigen Umfang und einiges wird da so
angesprochen und so und &uuml;berhaupt. Also lassen wir ihn auch sofort zu Wort kommen:<P>


<B>Halli Hallo an alle Reflections User und Clubmitglieder (und die ,die es noch werden wollen).
Jetzt m&ouml;chte ich mich auch mal zu Wort melden.<P>

Ich bin ja nun auch schon fast ein Jahr Mitglied in diesen tollen Club. Wie viele von euch habe
ich meine ersten Schritte auf einem Amiga 500 gemacht. Er hatte damals ja noch mehr Leistung als ein PC.
3D Grafik interessierte mich damals auch schon sehr, aber Reflections 1 Bookware konnte ich mir vom 
Taschengeld noch nich leisten. Ich glaub das die Rechenzeiten damals f&uuml;r ein Bild verdammt hoch gewesen
sein m&uuml;ssen. Ich hab es zwar mit Programmen von der PD-Serie Fred Fish (gibt's glaub ich auch ich mehr)
versucht, aber die wollten nie so recht laufen. Irgendwann stieg ich dann auf einen 386안r mit sage und
schreibe 5 MB Ram um. Zu der Zeit erschien auch Reflections 3 auf den PC. Gleich die Lightversion gekauft
und ausprobiert. Erfolge wollten sich damals &uuml;berhaupt nicht blicken lassen. Als Version 4 kam ging es
richtig los. Nu bin ich stolzer Besitzer eines Pentium 133 mit 96 MB Ram und nat&uuml;rlich der Reflections 4.1
Vollversion (watt f&uuml;r앑 toller Zimmerschmuck diese Packung).<P></B>

Dr. Reflectus:<BR>
STOLZ ??????? AUF 133MHz und 96 MB ?????? Na ja; ...nicht schlecht. Bin mit meinem 150안r incl 64 MB auch
nicht besser dran! Und wat den Zimmerschmuck betrifft: Wat denkste eigentlich, warum REF4 ---> 400.-DM
kostet; h&auml; ??? <P>

<B>Dann m&ouml;chte ich mich bei Markus f&uuml;r Das Lob und die Kritik zu meinem Regula_1 Objekt bedanken. Du hast
vollkommen recht mit der Aussage, das die mit 100 Schritten geplotteten Zylinder vollkommen unn&ouml;tig seien.
Ich hab mir damals nur gedacht das es nichts schlimmeres geben k&ouml;nne als runde Objekte, die sich bei
Gro&szlig;aufnahme als Vieleck zu erkennen geben. Ich hab es mir voll zu Herzen genommen und die Station
umkonstruiert. Trotz noch hinzugekommener Details ist die Zahl der Dreiecke bis jetzt von ca. 60000 auf
38000 geschrumpft. Wenn ich damit fertig bin, werde ich sie dem Reflektor erneut zur Verf&uuml;gung stellen.
Auf den beigef&uuml;gten Bildern der Animation sieht man wie die Station zur Zeit aussieht. Es fehlen aber noch
einige Details.<P></B>

Dr. Reflectus:<BR>
Jetzt verstehe ich deine Speicher-Geilheit !!! Wir saninf gespannt auf die neue Version.<P>
 
<B>Ich kann mich dem Tip von Doktor Reflectus nur anschlie&szlig;en:<BR>
Jungs kauft euch soviel Speicher wie ihr kriegen k&ouml;nnt. Habt ihr schon mal eine gro&szlig;e Bilddatei (ca. 3500
x 3000 Pixel, 24 Bit) mit nur 16 MB Hauptspeicher eingeladen ? Das kann sogar mit einem 200 MHz Rechner
zur echten Lebensbesch&auml;figung werden, vom komfortablem arbeiten mit Reflections ganz zu schweigen. Schon
32 MB k&ouml;nnen wahre Wunder bringen (soviel hatte ich als ich Regula_1 konstruierte). Bei den Speicherpreisen
solltet ihr wirklich zuschlagen. Ich selbst habe richtig viel Spa&szlig; mit meinen 96 MB Ram.<P>

Im November dann dachte ich, ich tr&auml;ume als ich eine Softwarepackung Namens Gold 4 sah; schon auf dem
Titelbild stand auf einem kleinen Button geschrieben: Autodesk 3D-Studio Release 4.<BR>
Wow, f&uuml;r einen Fuffi sollte dieses legend&auml;re Programm in meinen Besitz eingehen. Nach n&auml;herem
ausprobieren entt&auml;uschte mich das Programm doch etwas (l&auml;uft nur unter DOS; alles ist in englisch,
und die Anleitung mu&szlig;te man nachbestellen). Solch ein komplexes Programm ohne Anleitung zu bedienen
ist wie Autofahren mit verbundenen Augen; absolut unm&ouml;glich. Sp&auml;ter las ich in einer Computerzeitschrift,
da&szlig; Autodesk eine Einstweilige Verf&uuml;gung &uuml;ber das Programm gestellt hat, weil Topware anscheinend keine
Lizenz f&uuml;r das Programm hat und die Besitzer diese "Raubkopie" nicht benutzen d&uuml;rfen. Eine riesen Sauerei.
Man kann nur hoffen, da&szlig; sich da noch etwas tut. Zur Zeit gibt es diese Softwarepackung nur in einer
abgespeckten Version. Das genannte Programm fehlt.</B><P>

Dr. Reflectus:<BR>
TOPWARE hat anscheinend wirklich keine Lizenz zum Vertrieb des 3DS4 gehabt;...die Jungs m&uuml;ssen n&auml;mlich
kr&auml;ftig Money bluten an Autodesk! Was die bedienung von 3DS4 angeht, so bin ich der Meinung, gibt es
Schlimmeres. Schau dir mal 3DS MAX an;...ohne Studium geht da nix! Dat Dingen wird nicht umsonst von
Profi-Firmen benutzt;...die schicken ihre Mitarbeiter n&auml;mlich zu ausgedehnten Studien an diversen
Hochschulen! (Kein Scherz!)<P>

<B>Dann hatte ich mir zum Anla&szlig; des Animago 3D Awards 1998 Probeausgaben der digital produktion und das
Video vom 97안r Wettbewerb bestellt. Wahnsinn, f&uuml;r Fuffzich Mark 4 Stunden Animation pur. Da kann man
mit Reflections zur zeit noch nicht mithalten, aber die n&auml;chste Version kommt bestimmt, oder ? Eigentlich
wollte ich an dem Wettbewerb teilnehmen, aber als ich die Einsendungen des Vorjahres sah war es mir klar:
keine Chance. Da waren einfach waschechte Profis am Werk. In einem Heft war da noch eine Markt&uuml;bersicht
aktueller 3D Programme, und Reflections scheint mit dem Bild (T-Rex Skelett im Museum) von Gregor Gerlach
keine schlechten Eindr&uuml;cke hinterlassen zu haben, wo doch sonst nur Programme der gehobenen Preisklasse
(ab ca. 6500 DM) dabei waren.</B><P>

Dr. Reflectus:<BR>
Die DigitalProduction ist eine reine Profi-Publikation speziell f&uuml;r 3D Grafik & Video! Ich beziehe sie
regelm&auml;&szlig;ig und habe nicht schlecht gestaunt, als ich in der Ausgabe 4/97 uns REFLECTIONS entdeckt habe; ...
Und das auf einer Seite neben Alias PowerAnimator!!!  Echt Suuuuper Gregor !!!!<P>

<A HREF="../BILDER/DP4-97.JPG"><IMG WIDTH=128 HEIGHT=51 SRC="../BILDER/DP4-97-1.GIF" ALT="[BILD]">
Ausgabe 4/97</A><P>

<B>Zum Buch "Zaubern mit Reflections" kann ich nur sagen: Empfehlenswert.<P>
Die Objekte die in dem Buch beschrieben sind, sind zwar nicht die besten, ]aber absolut zweckm&auml;&szlig;ig. So
werden Funktionen erkl&auml;rt, die nicht mal im dicken Reflections Handbuch erw&auml;hnt sind. Es wird auf die
Versionen 4.0 und 4.1 eingegangen, wodurch sich die konstruktionsweisen etwas unterscheiden k&ouml;nnen. Nur
der Preis ist etwas zu hoch.<P>

Hey Wolfgang ich geh&ouml;re auch zu den Leuten die ein Problem mit den flc Dateien haben. Ich benutze auch
den Autodesk Animation Player 1.10 und habe die selben Probleme unter Windows 95b. Es mu&szlig; ein Formatfehler
sein. Auch mit den avi Dateien hab ich Probleme wenn ich ein unkomprimiertes 24 Bit Video mit einem 
Videobearbeitungsprogramm komprimieren will. Es wird meist in Falschfarben umgewandelt. Hier half mir
bis jetzt nur eins: von Reflections nur die Bilder berechnen lassen, was die Berechnung auch etwas
beschleunigt, weil Reflections die Animation nicht packen mu&szlig;. Die Animation wird dann mit einem 
Videobearbeitunsprogramm z.B. Videotrope (Shareware) aus den Einzelbildern erstellt. Das funktioniert
wunderbar. Das Programm kann auch avi in flc Dateien Umwandeln und noch vieles mehr. Ich benutze eigentlich
nur das avi Format, weil es mehr Farben als das flc Format zul&auml;&szlig;t.</B><P>

Dr. Reflectus:<BR>
Stimmt! Nix packen;...nur Einzelbilder;...und dann als AVI erstellen! FLIC압 bl&auml;hen sich nur unn&ouml;tigerweise
riesig auf: F&uuml;r fl&uuml;ssiges abspielen einer FLIC gr&ouml;&szlig;er als 320x240 ist eh keine Chance vorhanden!
Videotrope ?? Kenn ich gar nicht! La&szlig; mal n&auml;here h&ouml;ren !! MEDIA STUDIO bietet sich ebenfalls gut f&uuml;r das
Umsetzen einer Bild-Sequenz ins AVI-Format an; ... dabei ist es dem Programm pfurzegal wo die Bildnummerierung
steht! Somit ist wohl auch gleich das n&auml;chste Problem zum Teil beantwortet!<P>

<B>Zum Thema Einzelbildberechnung ist mir bei Reflections ein kleiner Fehler aufgefallen. Wenn ich eine
Animation &uuml;ber 1000 Bilder berechne, und ein "?" im Namen Angebe (z.B. Frame?.tif), gibt es sp&auml;ter mit
Videobearbeitungsprogrammen Probleme mit der Bildreihenfolge. Ein kleines Beispiel. Frame1200.tif,
logischerweise w&uuml;rde jetzt Bild 1201 kommen aber es mogelt sich Frame120.tif dazwischen. Erst jetzt kommt
Frame1201.tif dann Frame1202.tif, usw. Alle Zehn Bilder hat man also ein Bild dazwischen, das da &uuml;berhaupt
nichts zu suchen hat.<BR>
Zur Zeit ist es nur m&ouml;glich alle Bilder von 0 bis 999 einzeln umzubenennen und eine 0 vor den Zahlenwert
zu schreiben. Es geht mit Umbenennungstools zwar ganz gut, kann bei gro&szlig;en Animationen aber tierisch
langweillig werden.  Reflections m&uuml;&szlig;te also von sich aus merken wieviele Stellen einzusetzen sind (bei
Animationen &uuml;ber 1000 Bildern sind es 4 Stellen, &uuml;ber 10000 Bilder 5, usw).<P>
 
Ich m&ouml;chte eine Animation zur Videoaufzeichnung machen. Wer kann mir sagen welche Einstellung ich f&uuml;r
das Anti-Aliasing benutzen soll ? Ist Anti-Aliasing &uuml;berhaupt notwendig ? Ich kann ja nicht alle Einstellungen
ausprobieren weil ich nicht die M&ouml;glichkeit zur Videoaufzeichnung habe. Was f&uuml;r eine Ausr&uuml;stung braucht man
&uuml;berhaupt f&uuml;r Videoaufzeichnungen, und wie ist die Preislage ? Das ein einfacher Videorekorder nicht reicht
ist mir schon klar, wer kann schon hunderte von Bildern einzeln aufzeichnen.</B><P>

Dr. Reflectus:<BR>
AntiAlias ist notwendig;...aber nicht zu hoch! Maximal Stufe 3 ist f&uuml;r das tr&auml;ge Auge des Menschen
vollkommen ausreichend! Bei einer Animation hast du eh wenig Gelegenheit auf das AntiAlias des Objektes
bzw. der Textur zu achten; ... es handelt sich bei einer Video-Aufzeichnung immerhin um 25 Bilder / Sekunde!
Ausr&uuml;stungen zur Video-Aufzeichnung per PC ist wie &uuml;blich abh&auml;ngig von a.)...deinem Geldbeutel (...in dem
wahrscheinlich nicht viel drin ist?...) und b.)...der Ausgabequalit&auml;t die du erwartest!<P>

Also;...Frei nach Beckenbauer: SCHAUN MER MAL! :<P>

M&ouml;glichkeit 1: VHS-MJPEG-Karte (ISA) Typ FAST-MMPro oder MIRO DC-20 ist bereits f&uuml;r unter 500.-DM zu kriegen; ...
mittelm&auml;&szlig;ige Qualit&auml;t inclusive Ruckel-Sequenzen sind dabei kostenlos! Die Dinger arbeiten quasi mit jedem billig
PC der mit einer einfachen IDE-Festplatte ausgestattet ist. Also einfach zu langsam! Auch der Einbau einer
SCSI-Festplatte bringt bei dieser Karte nichts;...die Kompressionsrate ist n&auml;mlich fest voreingestellt; ...
irgendwo im Bereich 1:100 bis 1:21!<P> 

M&ouml;glichkeit 2: S-VHS-MJPEG-Karte (PCI) Typ FAST-AV MASTER ist f&uuml;r ca 1300.-DM zu erwerben. Qualit&auml;t gut; ...
setzt jedoch als minimum eine SCSI-Platte vorraus: Besser noch ULTRA-WIDE SCSI ! Sonst kann es schon mal
vorkommen, das ein AVI schon mal ( selten! ) an einigen Stellen ruckelt!<P>

<B>Hallo Leute vom REFTools-Club,<P>
Toll, da&szlig; es Leute gibt die Skribts f&uuml;r Reflections Schreiben. Auf den Landscape Generator freue ich mich
schon, vielleicht werden dann ja so sch&ouml;ne Bilder wie von Bryce 2 m&ouml;glich (wer das Programm kennt wei&szlig;
wovon ich rede). Wie w&auml;r's denn mit prozeduralen Landschaftstexturen, oder solche phantastischen
Weltraumhintergr&uuml;nde wie in Wing Commander Prophecy ? Die Wunschliste lie&szlig;e sich endlos fortf&uuml;hren, da 
fallen mir denn auch noch prozedurale Texturen zur erzeugung von Saturnringen ein.</B><P>

Dr. Reflectus:<BR>
BRYCE 2 ??? Schon alt !!! Schau dir mal die neue Version, BRYCE 3D genannt, an !!!!!!<P>

<B>Und noch eine Frage an die Chefbesatzung des Reflectors, warum ver&ouml;ffentlicht ihr eigentlich so viele
Bilder, die sich doch schon auf der Reflections Programm CD befinden ? K&ouml;nnte man den beschr&auml;nkten Platz
auf der Diskette nicht f&uuml;r andere Bilder Verwenden ?<BR>
Die Idee mit dem Usertreffen ist SPITZE !</B><P>

Dr. Reflectus:<BR>
Wir w&uuml;rden ja andere Bilder ver&ouml;ffentlichen! WENN NUR GENUG KOMMEN W&Uuml;RDE !!!!!<P>

<B>Na ja, das war's im groben und ganzen, ich mu&szlig; jetzt noch ein Paar Texturen f&uuml;r meine U.S.S. Grissom malen.
Ach Ja, ein paar Bilder hab ich auch noch beigepackt wovon zwei Bilder aus einer Animation stammen, die bei
mir gerade in Arbeit ist.<P>
 
tsch&uuml;&uuml;&uuml;&uuml;&uuml;&uuml;&uuml;&uuml;&uuml;&uuml;&szlig;, euer Dennis</B><P>


Dr. Reflectus:<BR>
Dank an uns Dennis f&uuml;r seinen erhabenen Leserbrief. Hier seine Anschrift:<P>

<PRE><B>
        Dennis Siebert
        Rieckweg 3b

        21502 Geesthacht
        Tel.: 04152-73415
</PRE><P>

<HR><P>

Damit w&auml;ren wir am Ende der Leserbriefe angelangt. Nat&uuml;rlich harren wir
der weiteren Post, die da auf uns zukommen wird. Also ran an die Tasten
und her mit Euren Statements.<P>

<B><I>Euer REFLECTOR-Team!</I></B><P>

<HR SIZE=5>
<B>
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
</B>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
