<HTML>
<HEAD>
<TITLE>REFLECTOR 039</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.GIF">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
T O O L S - P O O L</H1></CENTER>
<HR SIZE=5><P>

<IMG WIDTH=100 HEIGHT=149 SRC="../PIX/REFTOOLS.GIF" ALT="[REFTOOLS-LOGO]">
<B><FONT SIZE=4>EFTools! Team's TexturMagic 3D I</FONT></B><P>

Jo, seit einiger Zeit gibt es ja eine Gruppe von engagierten Programmierern, die es sich zum Ziel
gesetzt haben Tools, PlugIns, Scripts etc. f&uuml;r uns <B>REFLECTIONS</B> zu schreiben. Auf der letzten
Ausgabe des <B>REFLECTOR-Magazins</B> haben wir bereits dar&uuml;ber berichtet und konnten Euch bereits
einige Werke in Form von Scripts pr&auml;sentieren.<P>

F&uuml;r diese Ausgabe haben wir den n&auml;chsten Leckerbissen vom <B>REFTools! Team</B> parat:
<B>TexturMagic 3D I</B>. Hierbei handelt es sich um ein PlugIn, welches weitere und wirklich sehr
gute mathematische Texturen in <B>REFLECTIONS</B> zug&auml;nglich macht. Einziger Wermutstropfen: das
PlugIn steht nur f&uuml;r die PC-Version von <B>REFLECTIONS</B> zur Verf&uuml;gung. Das <B>REFTools! Team</B>
sucht weiterhin nach Amiga-Programmierer, die diese Erweiterungen f&uuml;r diesen Rechner umsetzen k&ouml;nnen
(wir hatten dar&uuml;ber berichtet). Interessierte k&ouml;nnen sich an die unten angegebene Adresse melden.<P>

Hier einige Info's von den Autoren:<P>


<B>TextureMagic 3D I<P>

Copyright (c) 1997 Michael Alexander Krafzik<BR>
EMail: <A HREF="mailto:michael.krafzik@duisburg.netsurf.de">michael.krafzik@duisburg.netsurf.de</A><P>

"TextureMagic 3D I" ist ein Plugin, da&szlig; im Rahmen des REFTools! Projektes entstanden ist. Das
"REFTools! Team" ist eine Gruppe von Programmierern, die Tools f&uuml;r das Raytracingprogramm "Reflections"
((c) Oberland Computer) erstellt.<P>

REFTools! Homepage: <A HREF="http://www.reftools.home.pages.de">www.reftools.home.pages.de</A><P>

Dort sind weitere Infos &uuml;ber REFTools! sowie Programme und Skripts f&uuml;r Reflections erh&auml;ltlich.<P>

TextureMagic 3D I" ist "copyrighted freeware", kann also frei an andere Personen weitergegeben werden. 
Die folgenden Dinge sind dabei zu beachten:<P>

1. Keine der Dateien darf ver&auml;ndert werden.<P>

2. Alle Dateien m&uuml;ssen zusammen weitergegeben werden:<BR>
- TextureMagic 3D I.dll<BR>
- TextureMagic 3D I.inf<BR>
- tm3d1cpy.txt<BR>
- tm3d1.hlp<BR>
- tm3d1.cnt<BR>
Bitte darauf achten, dass die langen Dateinamen beibehalten werden.<P>

3. Das Programm darf nicht verkauft werden. Weitergabe auf CDROM oder Diskette nur nach vorheriger
Absprache mit dem Autor.<P>

4. Im Sinne der vorgesehenen Nutzung als Plugin f&uuml;r "Reflections" darf das Programm frei f&uuml;r beliebige
Arbeiten (auch kommerzieller Natur) verwendet werden.<P>

5. Der Autor haftet nicht f&uuml;r Sch&auml;den, die durch die Nutzung von "TextureMagic 3D I" entstehen.</B><P>

Soweit die Info's dazu. Wir w&uuml;nschen Euch viel Spa&szlig; und erw&auml;hnen nochmals lobend die Arbeit des
<B>REFTools! Teams</B>. Das <B>REFLECTOR-Team</B> bedankt sich auch in Euren Namen f&uuml;r die Erlaubnis
das Material ver&ouml;ffentlichen  zu d&uuml;rfen. Hier noch einige wichtige Bemerkungen und rechtliche
Vorgaben vom <B>REFTools! Team</B>:<P>

<B>Jegliche Programme und Dokumentationen sind Urheberrechtlich gesch&uuml;tzt und nur f&uuml;r den "privaten
Gebrauch" bestimmt. Das Copyright liegt bei den jeweiligen Autoren. Das Vervielf&auml;ltigen und Weiterreichen
(CD, Diskette und/oder Internet), mit der Absicht der Massenverbreitung, ist ausdr&uuml;cklich untersagt,
solange nicht die Zustimmung des jeweiligen Autors vorliegt. Die Autoren &uuml;bernehmen keine Verantwortung
f&uuml;r Sch&auml;den und Folgesch&auml;den, die durch eins der Programme verursacht worden sein k&ouml;nnten.<P>

Das REFLECTOR-Team hat die Erlaubnis der Weitergabe an seine Mitglieder !</B><P>

Soweit zu diesem Thema. Das <B>REFTools! Team</B> Team ist unter folgender Anschrift zu erreichen:<P>

<PRE><B><P>
        Dirk Kamp
        Viehoferplatz 15

        45127 Essen
        Tel.: 0201 / 236582
        EMail: <A HREF="mailto:dirkkamp@cww.de">DirkKamp@cww.de</A> 
</B></PRE><P> 

<A HREF="../TOOLS/TMAGIC.GIF"><IMG WIDTH=128 HEIGHT=102 SRC="../TOOLS/TMAGIC1.GIF" ALT="[BILD]"></A> TexturMagic 3D<P>

<B><I>Euer REFLECTOR-Team!</I></B><P>

<HR SIZE=5>
<B>
<A HREF="../TOOLS.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEIL.GIF" ALT="[HAUPTMENUE]"></A> HAUPTMENUE
</B>
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
