

<HTML>

<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>AmigaOS Leser CD Nr.3</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red><CENTER><img
src="aoslog.png"></CENTER></P>
<h1><CENTER><FONT COLOR="GREEN">AmigaOS Leser CD
Nr.3</FONT></h1></CENTER></P>
Nachdem sich nun auch offiziell die Amiga Special vom Amiga Markt
verabschiedet hat, bleiben dem Amiga User kaum noch Alternativen &#252;brig.
Schaut man sich die Amiga OS an, sieht man aber, da&#223; es durchaus noch
qualitativ hochwertige Magazine f&#252;r den Amiga gibt - ob selbiges auch f&#252;r
die aktuelle Leser CD gilt, wird der Test zeigen.</P>

<h2><CENTER><FONT COLOR="RED">Pro Forma</FONT></h2></CENTER></P>

Der Aufbau der CD hat sich (gl&#252;cklicherweise) nicht ge&#228;ndert: Immer noch
setzt der Verlag auf die neuen Glow Icons, die dem ganzen einen etwas
professionelleren Touch verleihen, als z.B. MagicWB Icons. Neben einem
Assign Script ist auch wieder eine Guide Datei mit an Bord (wahlweise HTML
oder AmigaGuide) und nat&#252;rlich die mit der zweiten CD eingef&#252;hrte FAQ
&quot;AmiPedia&quot;, die erweitert / erg&#228;nzt wurde. Ansonsten hat man etwas an der
Struktur gearbeitet, was schlie&#223;lich in einer etwas &#252;bersichtlicheren
Verzeichnisstruktur endete.</P>


<h2><CENTER><FONT COLOR="YELLOW">Der Inhalt:</FONT></CENTER></h2></P>
Die CD ist in genau 8 Schubalden (AmigaOS, Games, Scene, Online, Tools,
Sound, Demos und CD System) unterteilt, auf die ich folgenden genauer
eingehen werde:</P>

<u>AmigaOS:</U></P>
Am interessantesten ist hier wohl die Vollversion &quot;Storm Wizard&quot;,
die f&#252;r Programmierer sicherlich von Nutzen ist. Aber auch die
Konzeptzeichnungen zum NG Amiga (wenn er denn nach den Ereignissen des
letzten Monats noch kommt) und die verschiedenen Videoclips (z.B. von der
World Of Amiga oder Anti Bill Gates Clips) sind f&#252;r den einen oder anderen
User sicherlich interessant. Geplant ist offenbar auch eine Datenbank
(zumindest ist ein Ordner mit dem Namen &quot;AmigaOS Datenbank&quot; vorhanden), aber
diese ist auf der aktuellen Leser CD noch nicht zu finden. Auch das &quot;Update
Forum&quot; musste diesen Monat leider leer bleiben.</P><CENTER><img
src="aoscd1.jpg"></CENTER></P>

<u>Games:</U></P>
Im Gegensatz zu anderen CD Compilations ist man im Falke Verlag zu der
Erkenntnis gelangt, da&#223; Masse nicht immer Klasse ist. Somit befinden sich
bei den &quot;Games&quot; auch nur Demoversionen von Spielen, die zum einen nicht
schon hundertmal verbraten wurden und zum anderen eine gewisse Qualit&#228;t
haben. So ist z.B. schon eine Demo von &quot;Space Station 3000&quot; auf der CD zu
finden, ebenso wie ein AVI Film zu &quot;Gilbert Goodmate&quot; und eine nicht auf
Grafikkarten lauff&#228;hige DEmo zu &quot;The Last Seal&quot;. Abgerundet wird das ganze
von einigen PPC Games (Hellshot, ADescent und Voxel Race) sowie einem Napalm
Cheater. Quasi als Bonus sind auch noch einige (aktuelle) Emulatoren (MAME,
True Reality, ANes, CoolNES, MasterGear etc.), Patches (nur f&#252;r Shadow Of
The 3rd Moon) und Klassiker (Slam Tilt, Fighting Spirit und Wheelspin) in
den entsprechenden Unterordnern zu finden.</P>

<u>Demos:</U></P>
Hier ist diesesmal leider Di&#228;tkost angesagt: Neben GoldED6 ist hier nur eine
Demo zu STFax zu finden - etwas entt&#228;uschend.</P>

<u>Sound:</U></P>
Die magere Ausbeute bei den Demos wird daf&#252;r mit diesem Ordner wieder
ausgeb&#252;gelt: Neben altbekannten Sound Tools wie AmigaAMP, Samplitude,
DigiBooster und AHI Record sind hier auch einige Abspieler vertreten, die
bisher zwar noch unbekannt(er) sind, aber dennoch einiges auf dem Kasten haben:
Als bestes Beispiel kann ich da Prayer 2.0 anf&#252;hren - ein weiterer MP3
Player, der es in sich hat. Aber auch die mpega.library (auf der die meisten
MP3 Abspieler basieren) befindet sich hier. Aber was n&#252;tzen einem die ganzen
Abspieler, wenn man keine Module hat? Das wird sich auch der Zusammensteller
gedacht haben und hat deswegen noch einige MP3 Songs (u.a. aus dem bald
erscheinenden Game &quot;Space Station 3000&quot;) sowie zahlreiche Module f&#252;r
Digibooster und Protracker dazugepackt, die qualit&#228;tsm&#228;&#223;ig auf jeden Fall im
oberen Drittel anzusiedeln sind.</P>

<u>Online:</U></P>
Auch wenn ich pers&#246;nlich nicht der Online Freak bin, muss ich zugeben, da&#223;
sich hier doch vieles n&#252;tzliches f&#252;r den Internet Surfer findet. Neben der
Pre-Release zu Voyager 3 (eines kann man auf jeden Fall festhalten - die
Jungs von der AmigaOS sind schnell) sind auch Standardtools wie Miami, YAM
2.0, StarGate und BlackIRC vertreten. Auch mir unbekannte Tools wie
&quot;Swatch&quot;, &quot;Lynx&quot; und &quot;WebUP&quot; gibt`s hier zu bestaunen. Lobenswerterweise hat
auch der Ordner &quot;Web Design&quot; wieder einen Platz auf der CD gefunden: Waren
auf der letzten CD noch zahlreiche Anims &amp; Backgrounds (samt
Erstellungstools) Grund genug zum Jubeln, hat man diesesmal lediglich die
beiden Tools &quot;Metal Web 3.0&quot; und &quot;Mapplug1.3&quot; sowie die beste &amp; ausf&#252;hrlichste HTML
Dokumentation &quot;SelfHTML&quot; in dieses Verzeichniss gesteckt.</P>

<U>Scene:</U></P>
Hier dominieren (wen wundert es?) die Demos (u.a. XIII, Mansion, Noxzema), die teilweise auch recht
aktuell sind. Zwar gibt es einige &#220;berschneidungen mit anderen CD`s, aber
das l&#228;&#223;t sich wohl nicht vermeiden. Toll ist es auf jeden Fall, da&#223; man
nicht jedes Billig Demo auf die CD geknallt hat, sondern nur qualit&#228;tsm&#228;&#223;ig
gute genommen hat. Zus&#228;tzlich zu den Demos gibt`s noch zahlreiche Pics
(ebenfalls gute Auswahl) sowie 4 MPG Files von der C98 (die auch auf anderen
CD`s, wie der aktuellen A+ CD, zu finden sind).</P>

<u>Tools:</U></P>
Im Gegensatz zu den beiden Vorg&#228;ngern hat man hier nun alles besser
struktuiert (z.B. in Free- und Shareware). Neben einigen Free- und
Sharewarprogrammen, die allesamt hinreichend bekannt sind (z.B. Mystic Cube,
SimpleHTML etc.), hat man sich diesesmal offenbar den Treibern verschrieben:
Sowohl f&#252;r Scanner als auch f&#252;r Drucker sowie f&#252;r Digital Cameras finden
sich zahlreiche Treiber, die sauber in verschiedene Ordner getrennt sind, so
da&#223; langes Suchen entf&#228;llt. Obendrein hat man noch einige Glow Icons,
aktuelle Datatypes und Virenscanner dazugepackt. Aber auch an die
Programmierer wurde gedacht: Der Bereich &quot;Development&quot; enth&#228;lt z.B. Compiler
und Source Codes (Dice, VBCC etc.). Und last but not least w&#228;re da noch der
PPC Bereich f&#252;r User mit PPC Bord (hier kann ich leider nicht mitreden).</P>
<CENTER><img src="aoscd2.png"></CENTER></P>
<h2><CENTER><FONT COLOR="WHITE">Fazit:</FONT></h2></CENTER></P>
F&#252;r diese CD gilt der Spruch: Klasse statt Masse. Mit 440 MB ist die CD zwar
nicht ganz ausgelastet, enth&#228;lt aber dennoch viele n&#252;tzlihce Sachen. Positiv
hinzu kommt die Aktualit&#228;t der Software (die AmigaOS ist zum Bleistift die
erste CD, die eine Demo zu &quot;Space Station 3000&quot; ver&#246;ffentlicht). Aber auch
die Vollversion sowie die &#252;bersichtliche Gestaltung der CD rechtfertigen den
Kauf allemal. F&#252;r mich pers&#246;nlich ist die AmigaOS CD derzeit die qualitativ beste CD
auf dem Amiga Zeitschriftenmarkt und der Amiga Plus CD allemal
vorzuziehen!</P><BR><CENTER>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Falke Verlag</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>12 (Abo) oder 15 DM</TD>
</TR>
<TR>
<TD>Inhalt</TD>
<TD>Compilation</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>440 MB</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>75 %</TD>
</TR>
</TABLE>











<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
