

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Amiga Plus CD 4/99 (oder sollte ich minus sagen?)</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="GREEN">Amiga Plus CD 4/99</FONT></h1></CENTER></P>

Es ist mal wieder soweit: Eine neue Amiga Plus CD ist erschienen. Und nach
der letzten, absolut mi&#223;ratenen Ausgabe (Test in der vorletzten NC) habe ich
ja (f&#228;lschlicherweise) auf eine qualitative Verbesserung der einstigen
hochkar&#228;tigen CD Reihe gewartet; leider vergebens - wie der Test auch zeigen
wird.</P>

<h2><CENTER><FONT COLOR="YELLOW">Und es geht mal wieder los...</FONT></h2></P></CENTER>

Waren in der letzten Ausgabe noch NewIcons am Start (was wenigstens eine
positive Neuerung war), sind es jetzt wieder die, in meinen Augen,
abscheulichen MWB Icons. Aber das die Icons ja nicht als Ma&#223;stab f&#252;r eine
gute CD gelten (obwohl NewIcons deutlich professioneller aussehen), soll uns
das auch nicht weiter st&#246;ren. Immerhin hat man es f&#252;r diese Ausgabe
geschafft, ein Suchprogram in Form von CD Cat (bekannt von den APC &amp; TCP CD`s)
auf die CD zu bannen, welches aber partrout bei mir nicht zum laufen zu
bewegen war. Ob das nun an meiner Konfiguration oder an der schlampigen
Zusammenstellung der CD lag, kann ich nicht beurteilen und sage dazu mal
nichts weiter.</P>

Nach diesem ersten kleineren Schock, der einen die Erwartungen blitzschnell
vergessen lie&#223;, geht es gleich mal weiter zum Themenschwerpunkt dieser
Ausgabe: Dem versch&#246;nern der Workbench (welch eine originelle Idee - das
gab`s in der Vergangenheit ja noch nie). In dem entsprechenden Ordner
befinden sich neben einigen Datatypes (nicht immer die ganz aktuellen Versionen), auch Bildschrimschoner
(BlitzBlank, GarshneBlanker und Cybermagic in verschiedenen Versionen),
Hintergr&#252;nde (viele f&#252;r MWB und einige, qualitativ nicht ganz so gute f&#252;r
andere Systeme; kann man immerhin f&#252;r die eine oder andere HTML Seite
benutzen) und Unmengen an Icons f&#252;r alle g&#228;ngigen Systeme (NewIcons, MWB,
MegaIcons und FreshIcons). Allerdings muss dazu gesagt werden, da&#223;,
zumindest die NewIcons, allesamt im Aminet zu finden sind und, w&#228;re das nicht
genug, auch auf der Vorg&#228;nger CD vorhanden waren. Das war es schon in dieser
Schublade, die sich ja eigentlich zum Ziel gesetzt hatte, die Workbench zu
versch&#246;nern. Wenn der IPC Verlag wirklich glaubt, da&#223; man damit seine
Workbench auch nur ein kleines bi&#223;chen aufpeppen (und dann noch mit
teilweise solchen miesen Backgrounds) kann, m&#246;chte ich niemals deren WB`s
sehen - mit diesem Ordner kann wahrscheinlich kein User was anfangen....</P>

Weiter geht`s mit &quot;Spielen&quot;, die ja im Grunde wenig auf einer Amiga Plus CD
zu suchen haben (wof&#252;r gibt`s denn schlie&#223;lich die Tochterzeitschrift
Amiga Future?). Genau 20 PD Games befinden sich hier und deren Qualit&#228;t und
Alter ist erstaunlich: Teilweise sind die Games schon 3 oder 4 Jahre alt und
sehen dementsprechend aus. Ich wei&#223; zwar nicht, was solche alten Games auf
einer aktuellen Amiga CD zu suchen haben (oder ist ein Spiel wie &quot;Poing 3&quot;,
&#252;brigens ein Breakout-Clone, so selten auf dem Amiga zu finden, da&#223; man mal
vorsichtshalber eine grafisch absolut desolate Version draufgepackt hat?),
aber Namen wie &quot;Gravity Force&quot;, &quot;Blob&quot; und &quot;FreeCell&quot; werden den meisten
unter Euch wohl was sagen. Auch &#252;ber diesen Ordner breiten wir mal den
Mantel des Schweigens, denn auch hier ist mal wieder gr&#246;&#223;tenteils alles
zweitklassiges und dazu noch veraltetes Aminet Material...</P><CENTER>
<img src="kit.gif"></P>
<img src="apluscd.png"></P>
<img src="kit.gif"></P></CENTER>
Mutig wie ich bin, waage ich mich auch in das Verzeichnis &quot;Anwender&quot; vor,
welches zumindest schonmal gut struktuiert ist (unterteilt in &quot;Text&quot;,
&quot;Grafik&quot;, &quot;N&#252;tzliches&quot;, &quot;Musik&quot;, &quot;Online&quot;, &quot;Datenbanken&quot;, &quot;Anti Virus&quot; und
&quot;Packer&quot;).</P>

<U>Text:</U></P>
&quot;Textloader&quot;, Skriptmanager 1.3&quot;, &quot;GuidEd&quot; und &quot;FW Calender&quot; sind die
Vertreter dieses Genres auf der CD. Ist zum einen sicherlich nicht besonders
viel aus diesem Bereich (wie w&#228;re es mal mit Guides, Add-ons f&#252;r Textverarbeitung etc.) und
zum anderen auch nicht die Creme de la Creme auf dem Amiga....
</P>
<u>Grafik:</U></P>
Wesentlich besser gef&#252;llt ist der Bereich &quot;Grafik&quot;, in dem u.a. so seltene
Programme wie &quot;CyberAVI&quot;, &quot;CyberShow&quot;, &quot;CyberView&quot;, &quot;Fantastic Dreams&quot;
(Demo) oder &quot;ViewTek&quot; zu finden sind. Obwohl all diese Grafiktools ohne
Frage eine hohe Qualit&#228;t haben und sich einen festen Platz im PD Bereich
erk&#228;mpft haben, wundert es mich immer wieder, warum man immer dieselben
Grafik Tools auf den A+ CD`s findet; immerhin waren diese, in den selben
Versionen, auch schon auf der letzten CD zu finden.</P>

<U>N&#252;tzliches:</U></P>
Ob hier alles so N&#252;tzlich ist, mag ich mal in Frage stellen. De facto hat
aber ein Program wie AIBB 6.5 1999 (oder habe ich etwa einen Zeitsprung in
die Vergangenheit gemacht? Dann ist an dieser CD vielleicht doch nicht alles
so schlecht....) nichts mehr auf einer Amiga CD zu suchen. Besonders
&#228;rgerlich finde ich aber, da&#223; man es noch nichtmal geschafft hat, von allen
Programmen aktuelle Versionen auf die CD zu packen; von &quot;VMM&quot; zum Bleistift
ist schon seit l&#228;ngerem eine aktuelle Version zu finden. Ansonsten gilt auch
hier wieder: Alles schonmal dagewesen (&quot;GrabKick&quot;, &quot;SysInfo&quot; (von 1994 !!!), &quot;SnoopDos&quot;
etc.).</P>

<u>Musik:</U></P>
Mit diesem Ordner k&#246;nnen MP3 Fans vielleicht etwas anfangen, da sich zu
diesem Thema hier einiges befindet: Die Abspieler &quot;WarpAMP&quot;, &quot;tmlg&quot; &quot;AMPlifier&quot; und
&quot;AmigaAMP&quot; haben genauso den Weg auf die CD gefunden, wie einige Skins und
zus&#228;tzliche Add-ons. Auch die Standardabspieler &quot;Eagleplayer&quot; und
&quot;Songplayer&quot; (Test in dieser Ausgabe) sucht man nicht vergebens.
Obligatorisch vertreten ist nat&#252;rlich auch &quot;AHI&quot;, was bestimmt noch kein
User installiert hat :-)))</P>

<u>Online:</U></P>
Was soll ich dazu noch gro&#223; sagen? Eine Demo von IBrowse, einige HTML
Editoren (MetalWeb 3.0, HTML Edit) und Netzwerk Stuff (Samba, Parnet). Ok,
mag f&#252;r den einen oder anderen ganz interessant sein, aber da ich kein
Internet Zugang habe und auch kein Netzwerk aufgebaut habe, lass ich diesen
Ordner mal au&#223;en vor bei der Bewertung.</P>

<u>Datenbanken:</U></P>
Auf glatte 4 Eintr&#228;ge bringt`s diese Schubalde: &quot;CD Cat&quot;, &quot;Home Cinema&quot;,
&quot;S-Adress&quot; und &quot;S-Video&quot;. Die Qualit&#228;t der beiden erstgenannten Programme
ist sehr gut, die beiden anderen stammen von dem selben Programmierer, sind
&#228;hnlich aufgebaut und leider nur belangloser Durchschnitt. Auch aus
diesem Themenbereich hätte man sicherlich einiges mehr rausholen können;
immerhin verfügt der Amiga über einiges wirklich hervorragende Datenbanken.
</P>

<u>Anti Virus:</U></P>
&quot;VT Test 3&quot;.... nicht mehr und auch nicht weniger....</P>

<u>Packer:</U></P>
Die Zahl 4 hat`s wohl dem Zusammensteller der CD angetan: &quot;Lhant&quot;, &quot;Lha
1.94&quot;, &quot;DMS Face&quot; und &quot;Unpacker&quot; - so die Namen der Packer. Nix
atemberaubendes bzw. spektakul&#228;res, wie jeder Aminet CD Besitzer schon
l&#228;ngst wei&#223;.</P>

Insgesamt gesehen bietet der Ordner &quot;Anwendungen&quot; so gut wie nichts neues
f&#252;r den normalen User. Wenn man allerdings etwas nostalgisch veranlagt ist,
kann man hier etwas erleben (das war jetzt nicht so positiv gemeint)....</P>

Kommen wir nun zum letzten Teil der CD, der den hoffnungsvollen Namen
&quot;Multimedia&quot; tr&#228;gt. Unterteilt ist die ganze Chose in &quot;Bilder&quot;,
&quot;Animationen&quot;, &quot;Demos&quot; und &quot;Musik&quot;:</P>

<u>Bilder:</U></P>
Workbench Bilder, Workbench Bilder und nochmals Workbench Bilder - das ist
alles was hier zu finden ist. Ich pers&#246;nlich konnte damit absolut nix
anfangen und ich frage mich, wem das was bringen soll. Das Argument der
Platzfüllerei fällt mir in diesem Zusammenhang spontan ein....</P>

<u>Animationen:</U></P>
Alles samt Aminet Material - muss ich dar&#252;ber noch Worte verlieren? Am
interessantesten waren davon immer noch die MPG Videos von der Computer `98.
Irgendwie dr&#228;ngt sich mir hierbei mal wieder der Verdacht auf, da&#223; man nur
Platz schinden wollte und deswegen Animationen auf die CD gepackt hat.
Einmal gesehen - niemehr gestartet...</P>

<u>Demos:</U></P>
F&#252;r Demos ist ja eigentlich der Yonder (bzw. Nagash :-)) verantwortlich, so
da&#223; ich mich hier mal jeden weiteren Kommentar spaare. 7 Demos (XIII,
Universe, Planeta, Noxzema, ukx_solectron, frozen sowie diamondquestppc)
sind zwar nicht viel, aber immerhin kann die Qualit&#228;t daf&#252;r teilweise
entsch&#228;digen.</P>

<u>Musik:</U></P>
Hier ist mal wieder typische Aminet Ware angesagt; ob nun als MP3 oder Mod.
Es kann nat&#252;rlich jetzt an meinem Musikgeschmack liegen, aber anfangen
konnte ich mit dem Krams absolut nichts.</P>

<h1><CENTER><u><FONT COLOR="WHITE">Fazit:</FONT></h1></U></CENTER></P>
Ok, jetzt ist Schluss mit lustig. Habe ich bisher immer noch auf Besserung
in der n&#228;chsten Ausgabe gehofft, kann man nun getrost sagen, da&#223; die Amiga
Plus CD von niemandem mehr ben&#246;tigt wird. So hart es klingen mag, aber diese
CD ist der letzte Schrott und da hilft auch das Argument &quot;630 MB&quot; nicht
mehr. Mag sein, da&#223; ich etwas zu hart mit der CD ins Gericht gezogen bin,
aber so sieht es leider nunmal aus. Und ganz ehrlich: Wer will schon 20 DM
f&#252;r eine CD ausgeben, auf der sich nicht etwas interessantes befindet?
Ich jedenfalls nicht und ich glaube nicht, da&#223; sich diese CD Reihe im
momentanen Zustand lange halten kann. Gegen&#252;ber der Konkurrenz (AmigaOS)
oder den anderen eigenen Produkten (Amiga Future) liegen Galaxien....</P>
<CENTER>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>IPC Verlag</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>19.80 DM</TD>
</TR>
<TR>
<TD>Inhalt</TD>
<TD>Aminet Stuff / veraltetes Material</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>630 MB</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>0 %</TD>
</TR>
</TABLE>







 
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
