

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>The CDS Collection - Eine Compilation mit Stil?</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

                     <h1><CENTER><FONT COLOR="GREEN">CD Test: The CDS Collection</FONT></h1></CENTER></P>
<center><img src="cdslogo.jpg"></CENTER></P>
In den Zeiten, als es dem Amiga spieletechnisch noch gut ging, gab es eine
Firma, die CDS hie&#223; und sich damals richtig engagiert hat, auch wenn ihr der
gro&#223;e Durchbruch niemals gelungen ist (was aber annerhand der auf dieser CD vertretenen Spiele auch nicht weiter verwunderlich ist - soviel kann ich schonmal verraten). Epic Marketing kam nun auf die Idee,
die Spiele von CDS auf eine CD zu kopieren und dann zu vertreiben - mal
sehen, ob die CD was taugt.</P>

<h2><cENTER><FONT COLOR="WHITE">Einige Dinge gleich
vorweg....</FONT></h2></CENTER></P>
Die &quot;CDS Collection&quot; wurde nicht nur f&#252;r den Amiga erstellt, sondern enth&#228;lt
auch alle Games als ADF Files damit man diese auch auf dem PC via UAE benutzen kann; aber diese
Vorgehensweise ist man ja mitlerweile von Epic gewohnt. &#196;rgerlich ist aber
die Tatsache, da&#223; sich nur 60 MB auf der Silberscheibe befinden. Bedenkt man
jetzt, da&#223; alle Games nochmal als ADF und DMS Files vorliegen, bleiben unter
dem Strich nur gut 25 MB an Spielen &#252;brig, was, bei einem Preis von 50 DM,
nicht gerade als &quot;value for money&quot; zu bezeichnen ist. Ebenfalls recht
&#228;rgerlich ist die Tatsache, da&#223; sich viele der Spiele nur mit Degrader
Programmen zum laufen &#252;berreden lassen. Dies ist zwar nicht unbedingt Epic`s Fehler,
aber &#228;rgerlich ist es allemal. Man sollte also den Rechner am besten
gleich ohne irgendwelche Patches hochbooten, da man sich so eine Menge Ärger
ersparen kann.

</P>

<u><B>Die Games:</U></B></P>
Insgesamt befinden sich 11 Spiele auf der CD, die sich direkt starten
lassen. Im einzelnen sind dies:</P><ul>

<li> Deluxe Strip Poker<br>
<li> Sun Crossword<BR>
<li> Times Crossword<br>
<li> Centrefold Squares<br>
<li> Rugby Coach <BR>
<li> World Snooker <BR>
<li> Brave Romeo Delta<BR>
<li> Brave Romeo Delta USA<BR>
<li> White Death<BR>
<li> Colossus Bridge 4<BR>
<li> Jigsaw Puzzle Mania<BR>
</UL>
Zus&#228;tzlich gibt`s noch eine Schublade namens &quot;Codes&quot;, die die
Codewordabfragen einiger Games als schlecht gescannte Grafikdatei enth&#228;lt
(was &#252;brigens sehr sinnvoll ist, da nicht alle Games über Multitasking verfügen) und einen Ordner mit einigen
Handb&#252;chern, damit man wenigstens in etwa wei&#223; worum es geht.</P><BR><CENTER> 


<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
</TR><TR>
<TD>Deluxe Strip Poker</TD>
<TD>Pokerspiel</TD>
</TR>
<TR>
<TD>Sun Crossword</TD>
<TD>Kreuzworträtsel</TD>
</TR>
<TR>
<TD>Times Crosswords</TD>
<TD>Kreuzworträtsel
</TD>
</TR>
<TR>
<TD>Centerfold Squares</TD>
<TD>Denkspiel</TD>
</TR>
<TR>
<TD>Rugby Coach</TD>
<TD>Sportspiel</TD>
</TR>
<TR>
<TD>World Snooker</TD>
<TD>Snooker Umsetzung</TD>
</TR>
<TR>
<TD>Bravo Romeo Delta & Bravo Romeo Delta USA</TD>
<TD>Strategiespiel</TD>
</TR>
<TR>
<TD>White Death</TD>
<TD>war nicht zum laufen zu überreden :-((</TD>
</TR>
<TR>
<TD>Colossus Bridge</TD>
<TD>Kartenspiel</TD>
</TR>
<TR>
<TD>Jigsaw Puuzle Mania</TD>
<TD>Puzzle Spiel (läuft nicht auf jedem Rechner)</TD>
</TR>
</TABLE></CENTER></P><BR>
<CENTER>
<img src="cds1.png"></P>
<img src="cds2.png"></P></CENTER>
Alle Games sind grafisch nicht mehr auf der H&#246;he der Zeit, was wohl ganz
leicht mit dem Alter der Games zu erkl&#228;ren ist. Um es in Jahreszahlen
auszudr&#252;cken: Die Games stammen aus dem Bereich 1987-1992 (jeder kann sich
jetzt ausrechen, wie systemkonform alles ablaufen wird und wie toll die Grafik aussieht).

Aber selbst wenn man die
Grafik mal aussen vor l&#228;&#223;t, kommt man zu keinem besseren Ergebnis. Durch
schlampige Programmierung (sprich: rumkonfigurieren ohne Ende) und total
banaler Umsetzung einiger Genres, will einfach kein richtiger Spielspa&#223;
aufkommen. Die Games sind zum gro&#223;en Teil einfach nur total langweilig (=&gt; keine
Motivation) und somit auch alles andere als fesselnd. Das es auch damals
viel bessere Games aus den selben Genres gab, ist sicherlich schon sehr
aufschlussreich was die Qualit&#228;t betrifft. Ein weiterer Kritikpunkt ist das
Fehlen einiger Handb&#252;cher. Wie oben schon erw&#228;hnt, hat man zu einigen
(wenigen) Games entsprechende Dateien auf die CD kopiert, was auch in
Ordnung ist. Zu den anderen Games bekommt man aber &#252;berhaupt keine Hilfe, so
da&#223; man des l&#228;ngeren bei dem einen oder anderen Game rumprobieren muss,
worum es &#252;berhaupt geht. Besonders bei Kartenspielen ist das ganze doch
recht &#228;rgerlich, denn selbsterkl&#228;rend sind diese f&#252;r den Laien (wie ich es
bin) nicht. Und um gleich bei den Handb&#252;chern zu bleiben: Die vorliegenden
Handb&#252;cher liegen zum einen nur in Englisch vor (was wiederrum einige vor
Probleme stellen d&#252;rfte) und sind zum anderen nicht gerade als ausf&#252;hrlich
zu bezeichnen.</P>  


<u>Aber es geht noch weiter:</u></P> 
Es befinden sich noch einige weitere Games auf der CD (DMS und ADF gepackt),
die Passwordgesch&#252;tzt sind. Die Passw&#246;rter muss man telefonisch (!!) nachfragen und
zwar in England (!!!!). Und das ganze kostet ja auch nur 1 Pfund (= 3 DM)
pro Minute und wer schonmal nach England angerufen hat, wei&#223;, da&#223; es etwas
dauert, bis man durchkommt. Mit allem drum und dran d&#252;rfte ein Anruf dann ca.
5 Minuten dauern, was 5 Pfund (= 15 DM) entsprechen w&#252;rde und f&#252;r diese Art
von Games, die allesamt nicht &#252;ber das Niveau eines schlechten Scerzes
herauskommen, absolut zuviel verlangt ist. Immerhin funktionieren einige der
&quot;zus&#228;tzlichen&quot; Games auch ohne Passwordabfrage (bzw. selbige l&#228;&#223;t sich
umgehen), aber leider ist die Qualit&#228;t immer noch auf unterstem
Niveau.</P>


<h2><CENTER><FONT COLOR="YELLOW">Fazit:</FONT></CENTER></h2></P>
Ich wei&#223; echt nicht, was diese CD soll. Zum einen sind 60 MB an Daten (und
wenn man bedenkt, da&#223; alles doppelt drauf ist) nicht gerade umwerfend viel
und zum anderen ist die Qualit&#228;t der Games absolut ungen&#252;gend. Es ist somit
schon fast als Frechheit anzusehen, sowas auf eine CD zu brennen und dann
f&#252;r 50 DM zu verkaufen. Hinzu kommt noch, da&#223; es eine Unversch&#228;hmtheit
ersten Ranges ist, da&#223; man f&#252;r Passw&#246;rter erst nach England anrufen muss. Die
CD ist, um es unverbl&#252;hmt zu sagen, der letzte Schrott und geh&#246;rt sofort aus
dem Programm genommen, da ansonsten wom&#246;glich noch jemand auf die Idee
kommt, hierf&#252;r Geld zu lassen. Selbst f&#252;r 5 DM w&#252;rde ich mir den Kauf
zweimal &#252;berlegen....</P><BR>
<CENTER>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Epic Marketing</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>49 DM (bei Epic)</TD>
</TR>
<TR>
<TD>Inhalt</TD>
<TD>Vollversionen älterer Games</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>60 MB (25 MB an Spielen, da alles doppelt / dreifach)</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>5 %</TD>
</TR>
</TABLE>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
