


<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>CD Vorstellung: Clubtreffen CD</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="GREEN">Vorstellung: Clubtreffen CD
</FONT></CEnter></h1></P>

Obwohl ich leider nicht beim Clubtreffen war (Urlaub), muss ich mich nunmal
dran machen, eine Vorstellung zur &quot;Clubtreffen CD&quot; zu schreiben. Der Andreas
war so freundlich und hat mir ein Testexemplar zukommen lassen und obwohl
ich noch nie beim Treffen war, versuche ich jetzt mal dar&#252;ber was zu
schreiben (auch wenn ich die Stimmung nicht in diese Vorstellung reinpacken
kann).</P> 

<h2><CENTER><FONT COLOR="YELLOW">&#214;h, wo fangen wir denn nun mal
an?</FONT></CENTER></h2></P>
Nach dem &#246;ffnen der selbstgebrannten CD, erscheinen einige Schubladen im
NewIcons
Stil sowie ein Begr&#252;&#223;ungstext und ein Assign Script. Gut gef&#252;llt ist die CD
auch auf jeden Fall (572 MB), was aber noch keine Aufschl&#252;sse &#252;ber die
Qualit&#228;t zul&#228;&#223;t. Ich will jetzt hier auch keinen gro&#223;en Test schreiben,
sondern nur erl&#228;utern, was alles drauf ist:</P>

<u>NoCover:</u></P>
Klaro, hier befindet sich &quot;unser&quot; Mag wieder. Die Ausgaben 1-65 sind
vertreten und bieten verdammt viel Lesespa&#223;. Es ist nur schade, da&#223; man die
NoCover Guide von Wolf Zimmer nicht auch gleich dazu gepackt hat. Ansonsten muss wohl zur NC nicht mehr
viel gesagt werden, oder?</P>

<u>Multimedia:</u></P>
Neben einigen MP3 und Mod Klamotten (war f&#252;r mich weniger dabei), sind auch
mal wieder Bilder, Demos und Animationen (Anti PC Stuff :-)) an Bord.
Besonders interessant wird der Ordner aber durch die von Thomas Weber und
Oliver Kaminski bereitgestellten Comics &quot;Randa&quot; und &quot;Spacys&quot;, die komplett
vertreten sind. Wer also nicht alle NC Ausgabe durchw&#252;hlen will, f&#252;r den ist
das sicherlich eine gute L&#246;sung. Ansonsten ist hier alles eher
Durchschnittsware, auf die man gut verzichten kann.</P>

<u>Software:</u></P>
An Spielen nat&#252;rlich viele Klassiker des PD Bereiches (Delxue Galaga &amp; Pacman, Space
Taxi etc.) nebst Installern und nat&#252;rlich die Games, die auch auf dem
Clubtreffen gezockt wurden (SitUp etc.). Quasi als Bonus hat sich Snoopy
noch die Vollversion von &quot;Marbelous&quot; gesichert und diese ebenfalls zu den
Spielen geackt. Und obwohl das Spiel nicht der Hammer ist und auch sonst
schon zigmal verbraten wurde, ist es lobenswert, da&#223; der Snoopy sich diese
M&#252;he gemacht hat, um die CD aufzuwerten. 
Der Anwenderteil erinnert mich
verbl&#252;ffend an den der AmigaPlus CD`s (by the way: Snoopy? Machst Du vielleicht
die Amiga Plus CD`s?). Alle Anwendungen kunterbunt gemischt und f&#252;r den
normalen Amiga User gr&#246;&#223;tenteils nutzlos, da bestimmte Standardanwendungen
sowieso schon installiert sind. Aber da die Software bei dieser CD ohnehin
nicht im Vordergrund steht (sonst k&#246;nnte man sich ja gleich die A+ CD`s
kaufen), wollen wir das hier mal einfach so stehen lassen.</P> 

<u>Treffen `98 und `99:</U></P>
Hier wird es dann so richtig interessant: Neben vielen Bildern der
jeweiligen Treffen (die im IFF Format bzw. GIF Format vorliegen) gibt es auch zwei sehr gut gemachte
HTML Dateien (leider haben sich dort einige Rechtschreibfehler eingenistet was bei so umfangreichen Dokumenten aber völlig normal ist) der jeweiligen Treffen, die einen authentischen Eindruck von dem vermitteln, was da alles so abgegangen
ist. Als Bonus gibt es dazu noch die Berichte zu den Treffen aus der NC (die ebenfalls in HTML vorliegen) sowie
diverse weitere &quot;Schmankerl&quot; (z.B. die absolut professionellen Pics des
disj&#228;hrigen Malwettbewerbs), die das ganze noch aufwerten. Dank dieser
beiden Sammlungen an Material kann man sich das ganze recht gut vorstellen
(und will n&#228;chstes Jahr auch mit dabei sein). F&#252;r die, die da waren, wird das
ganze sicherlich ebenfalls recht interessant sein; kann man sich so doch
noch mal an die hoffentlich sch&#246;ne Zeit erinnern, die man dort verbracht

hat.</P><CENTER>
<img src="clubtreffen1.png"></P><BR>
<img src="clubtreffen2.png"></P><BR>
</CENTER>
<u>Index:</U></P>
Genau wie auf den Amiga Plus CD`s, befindet sich auch auf der &quot;Clubtreffen
CD&quot; ein Suchprogram und zwar das allseits bekannte CDCat in Version 3.0. F&#252;r diese CD wird man das
zwar weniger brauchen, aber falls man dochmal was sucht, braucht man nicht
alles per Hand zu durchsuchen.

<h2><CENTER><FONT COLOR="WHITE">Zusammenfassung:</FONT></h2></CENTER></P>
Gegen die Idee, eine Clubtreffen CD herauszubringen, ist grunds&#228;tzlich
nichts einzuwenden. Und zu dem Teil der CD, der sich mit dem
Clubtreffen besch&#228;ftigt, kann man nur sagen, da&#223; dieser gelungen ist. Das
damit keine CD zu f&#252;llen ist, ist schon klar und deswegen befindet sich noch
weiteres Material auf der CD, das sicherlich nicht der Oberhammer ist, aber
eine nette Abrundung darstellt. Die Vollversion wertet das ganze noch weiter
auf. Ich kann somit nur festhalten, da&#223; alle, die auf dem Clubtreffen waren,
bedenkenlos zugreifen k&#246;nnen (sofern sie das noch nicht gemacht haben) und
alle anderen sich den Kauf zumindest &#252;berlegen sollten. Aber: Seid Euch im klarem &#252;ber
die Tatsache, da&#223; der einzig interessante Aspekt auf der CD die Daten zum
Clubtreffen sind; alles andere kann man getrost vergessen bzw. im
Aminet finden. Der Preis f&#252;r die CD betr&#228;gt 15 DM und ist, denke ich mal, im
gro&#223;en und ganzen, angemessen. Zu beziehen ist die CD bei Sascha van Wahnem.</P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
