<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief von Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=green alink=red>
<h1><CENTER><FONT COLOR="YELLOW">Leserbrief von Kilian "The
 Bruce" Servais</FONT></h1></CENTER></P><ul>
<li><a href="#alle.html">An Alle</A><br>
<li><a href="#dark.html">An den schmuggenden Dark</A><br>
<li><a href="#gerd.html">An den mailenden Gerd Wolpert</A><br>
<li><a href="#weber.html">An den Comic zeichnenden Thomas
 Weber</A><br>
<li><a href="#anne.html">An die PageStream interessierte
 Annemarie</A><br>
<li><a href="#hartmund.html">An den Neueinsteiger Hartmund
 R&#246;ber</A><br>
<li><a href="#herwig.html">An den wartenden Benjamin
 Hertwig</A><br>
<li><a href="#top.html">Meine Top 5</A></P><BR></UL>
<a name="alle.html">
<u>An Alle:</U></P>
Erwartet noch jemand eine Antwort von mir? Wenn ja bitte kurz melden; stecke
n&#228;mlich z.Zt. absolut im Stress. Und noch eines: In der n&#228;chsten Ausgabe
werde ich mich wahrscheinlich gar nicht zu Wort melden k&#246;nnen, da ich Anfang
Oktober auf eine zweiw&#246;chige Studienfahrt fahre; u.U. wird es ein bi&#223;chen
von mir geben.</P>
<hr>
<a name="dark.html">
<u>An Dark:</U></P>
Der Artikel &#252;ber Musik kam spontan und war kaum geplant. Irgendwann war ich
einfach so gefrustet von der ganzen Medien-Hyperei, da&#223; ich das mal
loswerden musste. Und sooo lang war der Artikel doch auch
 nicht...</P>

Yep, der Dark Evil wohnt in meiner unmittelbaren N&#228;he (ca. 10 Minuten zu
Fu&#223;) und wir treffen uns auch regelm&#228;&#223;ig (zusammen mit &quot;Textman&quot; Frank
Guder). Wieso &quot;ein Typ der alle schlecht machen muss&quot;? Der Ronald sagt nur
offen seine Meinung und hat auch kein Problem damit. Gew&#246;hnst Du Dich dran
:-)))</P>

Na ja, der zweite Teil des Workshops &#252;ber Farbe war echt ein Griff ins Klo;
der war viel zu kurz, was an Zeitproblemen meinerseits lag. Evtl. kommt
demn&#228;chst noch eine &#220;berarbeitung davon
 raus....</P>

Zu Deiner PD Corner: Finde ich `ne gute Idee und grafisch sieht das ganze
auch echt gut aus. Nur die Tests sind etwas kurz geraten; evtl. beschr&#228;nkst
Du Dich auf 2 Spiele &amp; Anwendungen und stellst diese dann etwas
ausf&#252;hrlicher vor? Ansonsten ist aber alles &quot;schmugge&quot; (wie kommst Du
&#220;berhaupt auf den Namen &quot;Schmugge &amp; Shit&quot;? ; ist ja nicht sehr
gebr&#228;uchlich).</P>

Star Wars habe ich mir auch angesehen, hat mich aber leider total
entt&#228;uscht. Da schaue ich mir lieber nochmal die Triologie an....
</P>
Sorry f&#252;r die kurze Abhandlung, aber ich stecke echt im Stress :-(((
</P>
See ya!
       </P>
<HR>
<a name="gerd.html">
<u>An Gerd Wolpert:</U></P>
Das der zweite Teil &#252;ber Farbe ein Griff ins Klo war, habe ich (im
Nachhinein) selber festgestellt. Wie ich oben schon geschrieben habe, kommt
evtl. demn&#228;chst mal ein Update raus, aber dazu brauche ich noch etwas Zeit.
Deswegen kann ich Deine Kritik zu dem Artikel schon nachvollziehen :-)))
</P>
F&#252;r den Test zur HMG 3.5 bedanke ich mich hiermit nochmals herzlichst; h&#228;tte
nicht erwartet, da&#223; die so gut abschneidet. Aber da das ganze ja eh Freeware
ist, kann sich ja jeder selber ein Bild machen. Aber vielleicht hast Du
jetzt erreicht, da&#223; mal einige User mehr reingucken. Hast einen gut bei mir
:-))</P>

Gut, da&#223; die Links nun auch unter AWeb funken. Aber eine Frage habe ich da
trotzdem: Wieso nimmst Du AWeb ? Ist in meinen Augen der derzeit schw&#228;chste
Amiga Browser. IBrowse &amp; Voyager sind da schon wesentlich weiter. Ausserdem
sieht die GUI von AWeb zum schreien (schlecht) aus :-)))</P>

Thanx f&#252;r Deine letzte NC Hitparade; gleich 5 mal stand da mein Name drin
(das Geld ist bereits unterwegs). Hat mich echt gewundert
 :-)))</P>

Ach ja: Was ist mit Deiner E-Mail Addy los? Da komme ich einfach nicht
durch.... Hast Du evtl. schon eine neue? Und wo war in der letzten Ausgabe
die &quot;Multimedia Ecke&quot;? Hat echt gefehlt :-((( Hoffe mal, da&#223; in dieser
Ausgabe wieder alles beim alten ist.</P>

Mach`s mal gut!</P>
<HR>
<a name="weber.html">
<u>An Thomas Weber:</U></P>
Ich glaube nicht, da&#223; so wenige Leute die Comics lesen; ich gehe sogar davon
aus, da&#223; 90 % aller User zumindest mal reinschauen und so zumindest halbwegs
die Comics verfolgen. Immerhin sind die Comics mitlerweile ein fester
Bestandteil der NC und ich gehe mal davon aus, da&#223; sich viele &#196;rgern w&#252;rden,
wenn es keine Comics mehr geben w&#252;rde. Mach also bitte weiter damit :-))))
</P>
Also weniger mit Musik zu tun? Macht ja nix :-))) Mit Dream Dance kann ich
zwar jetzt nix anfangen, aber Chris H&#252;lsbeck ist mit seinen Kompositionen
immer noch unerreicht; h&#246;re ich mir auch echt gerne an (besonders den
Soundtrack zu &quot;Turrican II&quot;). </P>

Metal schreibt man noch wie vor mit &quot;E&quot;;
 bitte!</P>

Ciau!</P>
<HR>
<a name="anne.html">
<u>An Annemarie:</U></P>
PageStream ist ein DTP Program, also vornehmlich zum Gestalten von Zeitungen
im (semi) professionellen Bereich gedacht. Eine &#228;ltere Vollversion (2.2) gab
es mal auf einer Aminet CD (ich glaube 10 oder so). Falls Du eine aktuelle
Version (mit Handbuch etc.) willst, solltest Du mal die Firma &quot;Haage &amp;
Partner&quot; anschreiben, die f&#252;r den Vertrieb und Support in Deutschland
verantwortlich sind. Sei Dir aber im klaren dar&#252;ber, da&#223; das Program recht
teuer ist (300-400 DM). Bald kommt auch die neue Version 4.0 raus -
vielleicht werden dann die &#228;lteren Versionen auch
 billiger.</P>

Hoffe mal, Dir etwas geholfen zu haben!</P>
<HR>
<a name="hartmund.html">
<U>An Hartmund R&#246;ber:</U></P>
Erstmal wilkommen im Club. Hoffe mal, da&#223; Du h&#228;ufiger was von Dir h&#246;ren l&#228;&#223;t
:-)))</P>

Nun aber zu Deinen Problemen:<br>
1. Bei Monkey Island kann ich Dir leider nicht helfen, da ich nicht im
Besitz des Games bin. Vielleicht hilft da auch mal eine Kleinanzeige in der
AmigaOS Zeitschrift.</P>

2. Databench finde ich pers&#246;nlich nicht so toll und habe seinerzeit auch nur
die Demo angetestet. Wenn Du eine gute Addressverwaltung suchst, kannst Du
zum einen mal im Aminet (bzw. CD`s) nachschauen (Verezichniss: biz) oder das
Program &quot;Organizer&quot; vom 1200er Paket nehmen. Mit letzterem kann man Termine,
Addressen &amp; Erledigungen bequem und sehr einfach verwalten. Das Program ist
&#252;brigens auf Deutsch und lag dem MagicWB Paket des A1200 bei.</P>

3. Bei den Browsern wird es da komplizierter: Ich habe mir noch keinen
gekauft und wei&#223; somit nicht, welchem Browser Handb&#252;cher auf Deutsch beilegen. Ein Tip w&#228;re sicherlich die aktuelle
Release von IBrowse, die auch in Deutsch vorliegt. Dieser ist nat&#252;rlich auch
f&#252;rs Internet zu gebrauchen.</P>

Hoffe mal, Dir zumindest etwas geholfen zu haben. Bei weiteren Fragen stehe
ich gerne zur Verf&#252;gung!</P>

Bis dann.</P>
<HR>
<a name="herwig.html">
<u>An Benjamin:</U></P>
Ich hoffe mal, da&#223; meine E-Mail ohne Probleme bei Dir angekommen bist und Du
Dir keine Sorgen mehr machst. Bei mir dauert das ganze per E-Mail nunmal
etwas l&#228;nger, da ich auf Freunde oder die Schule angewiesen bin, um meine
E-Mails zu lesen. Tja, und daher kann es bei mir schonmal etwas l&#228;nger
dauern, bis eine Antwort eintrudelt. Und erschwerend kommt noch hinzu, da&#223;
ich sowieso z.Zt. eigentlich kaum Zeit finde, all das zu erledigen, was
erledigt werden m&#252;sste....</P>

Hoffe, da&#223; damit erstmal alles gekl&#228;rt ist. Stay
 On Top!</P>

<HR>
<a name="top.html">
<h2><CENTER><FONT COLOR="GREEN">Meine Top
 5</FONT></h2></CENTER></P>

1. Harald Schmidt von Gerd Wolpert<BR>
2. Sax Game Previews von Sax (geil wie immer!)<BR>
3. Cinerama von Jens Kretzer &amp; Fabian Kruse<BR>
4. Amiga Plus von Sieglinde Peters (meine Meinung)<BR>
5. Homepage Gestaltung von Wolf Zimmer</P>

Die letzte Ausgabe war echt gut gelungen; viele verschiedene Artikel aus
allen Bereichen: Genau so soll es sein! Weiter so
 flei&#223;ig!!</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
