


<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Metal Corner by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=red bgcolor=black link=green alink=red>
<CENTER><img src="metalcorner.png">
<P><H1><FONT COLOR="GREEN">Metal Corner 10/99</FONT></H1></P>
 <a href ="#Vorwort.html">Vorwort</A><BR>
 <a href ="#News.html">News</a><BR>
 <a href ="#CDReviews.html">CD Reviews</A><BR>
 <a href ="#konzert.html">Konzertbericht (Savatage & Guests)</A><BR>
 <a href ="#lyrics.html">Interessante Lyrics</A><BR>
 <a href ="#tour.html">Tourdaten</A><BR>
 <a href ="#Top10.html">Top 10</A><BR>
 <a href ="#Outro.html">Abschlieﬂend</A></P>
<hr>
<a name="Vorwort.html"></CENTER>
<h1><CENTER><FONT COLOR="YELLOW">Vorwort</FONT></CENTER></h1><p>

<u>Moin!</U></P>

Auch diesen Monat darf ich Euch wieder zu einer neuen Ausgabe der Metal
Corner begr&#252;&#223;en. Letzten Monat hatte ich etwas wenig Zeit, so da&#223; u.a. der
Konzertbericht nicht so umfangreich ausgefallen ist, wie ich es mir
urspr&#252;nglich gedacht hatte. Ist aber auch egal, denn schlie&#223;lich gibt`s auch
diesen Moant wieder die Vollbedienung mit News, Charts, CD Reviews und noch
vielem mehr. Stay Hard,</P><CENTER>


                     Kilian<blink> &quot;The Bruce&quot;</BLINK>
Servais</P></CENTER>
<hr>
<a name="News.html">
<h1><CENTER><FONT COLOR="BLUE">News</FONT></H1></CENTER><p><ul>

<li>Ersten Judas Priest Angaben zufolge, soll der &quot;Jugulator&quot; Nachfolger
wieder bodenst&#228;ndiger ausfallen. So soll es keine Trendanbiederunge geben,
sondern puren Metal. Erscheinen soll der legitime &quot;Painkiller&quot; Nachfolger
evtl. schon gegen Ende dieses Jahres; im Januar 2000 geht es n&#228;mlich schon
auf Europatournee.</p><BR>

<li>Gar Samuelson (ex-Megadeth) unterlag leider der unheilbaren Krankheit
Hepatitis B. Zuletzt war er mit eigenen Projekten (u.a. Fatal Opera)
besch&#228;ftigt.</P><BR>

<li>Jetzt ist es auch offiziell: Der neue Rage Drummer ist Mike Terrana.
Ebenso offiziell ist deren Rausschmiss bei Metalium. Und mit Jon Osborn (ex-Doctor Butcher), der
der Band schon beim diesj&#228;hrigen Wacken Open Air aushalf, ist bei Metalium
schon der Nachfolger bereit.</P><BR>

<li>Auch bei Royal Hunt hat man einen Nachfolger gefunden: F&#252;r den entlassenen
D.C. Cooper wurde John West (u.a. Artension) verpflichtet. Und der neue
Longplayer wurde von Ihm auch schon komplett eingesungen. Deshalb ist es
nicht weiter erstaunlich, da&#223; die neue CD auch schon im Oktober in die L&#228;den
kommt.</P><BR>

<li>Die neue Dream Theater Langrille, die wieder etwas h&#228;rter ausfallen soll,
wird ebenfalls im Oktober in den Verkaufsregalen stehen. Hoffen wir mal, da&#223;
es nicht wie beim letzten Mal noch zwei Jahre dauert....</P>

<li>&#196;rger gibt`s daf&#252;r bei Max Cavaleras (ex-Sepultura) Soulfly: Drummer Ray
Mayorga verl&#228;&#223;t Soulfly wegen angeblichem &#196;rger mit dem Management. Wie die
US Tour zuende gespielt wird, steht derzeit in den Sternen.</P><BR>

<li>Auch bei den Prog. Metallern Symphony X gibt`s einen Line-up Wechsel: Tom
Miller (Bass) wurde durch Mike LePond ersetzt. Und das n&#228;chste Album,
vorraussichtlich ein Konzeptalbum,  wird ab Ende August eingespielt. Wir
warten schon sehns&#252;chtig....</P><BR>

<li>Bei Cradle Of Filth wurde nun auch ein neuer Drummer an Bord geholt: Mit
Adrian Erlandsson (ex-The Haunted) konnte man die L&#252;cke endlich schlie&#223;en,
die seit Wochen in der Band klafft.</P><BR>

<li>Rhapsody Mastermind und Gitarrist Luca Turilli hat eine Solo CD am Start,
die bereits am 27.9. erschienen ist. Erste H&#246;rproben lassen auch ein sehr
Rhapsody &#228;hnliches Album mit klassischen Arrangements schlie&#223;en. Wie schon
die bisherigen Rhapsody Alben wurde auch &quot;King Of The Nordic Twilight&quot; (so
der Titel des Solo Debuts) von Sascha Peath (Heavens Gate) veredelt.</P><BR>

<li>Bei Iron Savior gibt`s einen Wechsel hinter der Schie&#223;bude: F&#252;r Daniel
Zimmerman (Gamma Ray und Freedom Call), dem das ganze wohl zu stressig
wurde, haben die Mannen um Piet Sielck nun Thomas Nack (ex-Gamma Ray;
Anesthesia) verpflichtet. Besonders witzig: Daniel Zimmerman war seinserzeit
der Nachfolger f&#252;r Thomas Nack bei Gamma Ray. Mit dabei ist immer noch Kai
Hansen (Gamma Ray Boss), dem das Sideprojekt angeblich auch zu stressig sein
soll.</P><BR></UL>


<hr>
<a name="CDReviews.html">
<h1><CENTER><FONT COLOR="GRAY">CD Reviews</FONT></H1></CENTER><p>
<h2><CENTER>Luca Turilli: The Ancient Forest Of Elves</h2></CENTER></P>

Rhapsody Fans werden bei dem Namen &quot;Luca Turilli&quot; aufmerksam aufhorchen;
immerhin ist er der Gitarrist &amp; Songwriter bei den &#228;u&#223;erst erfolgreichen
Fantasy Metallern von Rhapsody. Und mit &quot;The Ancient Forest Of Elves&quot;
pr&#228;sentiert er seine erste eigene Single f&#252;r das bald kommende Album &quot;King
Of The Nordic Twilight&quot;. Und, wie sollte es auch anders sein, schl&#228;gt diese
Single genau in die selbe Kerbe wie Rhapsody. Geboten wird also auf dieser
Single Melodischer Power Metall mit klassischen Intsrumenten der sehr
schnell ins Ohr geht. Als Anhaltspunkte kann man sicherlich die Songs &quot;Emerald Sword&quot;
oder &quot;Warriors Of Ice&quot; (beide von Rhapsody) anf&#252;hren. Die Besetzung ist zwar
eine etwas andere (an den Vocals ist der bisher unbekannte Olaf Hayer, der
einen excellenten Job hingelegt hat, zu h&#246;ren,  Mastermind Luca Turilli zupft nat&#252;rlich die
Gitarre und f&#252;r alles andere ist die Heavens Gate Crew verantwortlich), aber
trotzdem gibt es keinen nennenswerten Unterschied zur musikalischen Richtung
von Rhapsody. Wie oben schon geschrieben sind die 3 Tracks auf dieser Single
Ohrw&#252;rmer in Perfektion (besonders &quot;The Ancient Forest Of Elves&quot;) und
brauchen sich qualit&#228;tsm&#228;&#223;ig nicht hinter Rhapsody zu verstecken. Somit ist
auch das Vorurteil wiederlegt, da&#223; es sich bei der Solokarriere nur um
B-Ware (bzw. Songs) handelt - das kann ich, aufgrund dieser Single, absolut
nicht best&#228;tigen. Jeder Rhapsody Fan muss zugreifen und alle jene, die auf
melodischen Metal (Gamma Ray etc.) stehen sollten unbedingt mal reinh&#246;ren.</P>

Fazit: ---</P><CENTER>
<img src="kit.gif"></P>
<img src="mccov1.jpg"></P>
<img src="kit.gif"></P></CENTER>



<h2><CENTER>HammerFall: I Want Out - Single</h2></CENTER></P>

Um die Wartezeit auf das n&#228;chste Studioalbum zu verk&#252;rzen (erscheint 2000)
haben die Pioniere des True Metals eine neue Single ver&#246;ffentlicht, die drei
Tracks enth&#228;lt:</P>

1. I Want Out</P>

2. At The End Of The Rainbow</P>

3. Man On The Silver Mountain</P>

Special: Multimedia Teil</P>

Aber fangen wir vorne an: Bei I Want Out handelt es sich, wie einige
sicherlich schon erkannt haben, um eine Coverversion des Helloween Krachers,
der seinerzeit auf &quot;Keeper Of The Seven Keys-II&quot; ver&#246;ffentlicht wurde und
von Kai Hansen komponiert wurde. Eben dieser Kai Hansen hilft auch bei
dieser Coverversion an den Vocals und der Gitarre aus, was dem Song eine
etwas eigenst&#228;ndigere Marke verleiht. Die Vorlage wird zwar nicht erreicht,
aber einige nette &#196;nderungen machen diese Coverversion trotzdem h&#246;renswert.
&#220;brigens: Auch Udo Dirkschneider (ex-Accept) steuerte Backing Vocals bei....</P>

Der zweite Track At The End Of The Rainbow stammt vom letzten HammerFall
Album &quot;Legacy Of Kings&quot; und z&#228;hlte meiner Meinung nach nicht zu den
Highlights des Albums.</P>

Und dann w&#228;re noch eine weitere Coverversion des Dio Klassikers &quot;Man On The
Silver Mountain&quot;, der in der selben Form auch auf dem k&#252;rzlich
fertiggestellten Sampler &quot;Holy Dio - A Tribute To Dio&quot; erschienen ist. Eine
ebenfalls gute Coverversion, die &#252;berzeugen kann.
Den Multimediateil kann man sich ebenfalls zu Gem&#252;te f&#252;hen, denn immerhin
befindet sich darauf ein Video zur &#220;berballade &quot;Glory To The Brave&quot; vom
Debutalbum. Dieser Film liegt sowohl in MPG als auch AVI vor, was also auch
das Abspielen auf (schnelleren) Amigas m&#246;glich macht.</P>

Diese Single ist sicherlich nicht &#252;bel. Zwar sind zwei neue Tracks nicht
sonderlich viel und der Multimediateil ist auch nicht der &#220;berflieger, aber im gro&#223;en und
ganzen kann diese Single jedem HammerFall Fan empfohlen werden. Auch &#228;ltere Helloween
Fans sollten wegen der Coverversion f&#252;r 12 DM zugreifen!</P>

Fazit: ---</P><CENTER>
<img src="kit.gif"></P>
<img src="mccov2.jpg"></P>
<img src="kit.gif"></P></CENTER>



<h2><CENTER>Iron Savior: Interlude</h2></CENTER></P>

Das letzte Iron Savior Output &quot;Unification&quot; ist gerade mal 9 Monate alt, da
erscheint mit &quot;Interlude&quot; schon eine weitere CD der Mannen um Piet Sielck.
Wer aber nun glaubt, da&#223; &quot;Interlude&quot; ein komplett neues Studioalbum sei, der
irrt sich gewaltig: Vielmehr stellt &quot;Interlude&quot; eine Compilation aus 5 Live
Tracks, 4 brandneuen Songs, einer Coverversion (Judas Priest`s &quot;Desert
Plains&quot;) und einem Video Clip dar. Bei den Live Versionen handelt es sich
allesamt um Tracks, die vom 1997 erschienenen Debut Album &quot;Iron Savior&quot;
stammen und auf dem letztj&#228;hrigen Wacken Open Air mitgeschnitten wurden;
Selbstverst&#228;ndlich hat man nur die Highlights des ersten Albums Live
gespielt, so da&#223; Fans in den Genuss von kraftvollen Live Versionen von &quot;Iron
Savior&quot;, &quot;Brave New World&quot;, &quot;Watcher In The Sky&quot;, &quot;Riding On Fire&quot; und &quot;For
The World&quot; kommen. Aber auch die 4 neuen Studiotracks, allem voran &quot;The
Hatched Of War&quot;, haben es in sich und stehen auf dem mitlerweile bekannten
hohen Iron Savior Niveau. Aber als ob das noch nicht gen&#252;gend Kaufanreit
w&#228;re, lassen es Iron Savior mit dem Priest Cover &quot;Desert Plains&quot; am Ende
nochmals richtig krachen. Abgerundet wird das ganze von einem Multimedia
Teil f&#252;r PC`s und Mac, der ebenfalls als gelungen zu bezeichnen ist (Amiga
User m&#252;ssen auf einige Extras verzichten). Insgesamt kann man &quot;Interlude&quot;
als Pflicht f&#252;r Fans des Deutschen Power Metals bezeichnen und eines ist
&quot;Interlude&quot; garantiert nicht: Der Versuch, mit m&#246;glichst viel &#252;brig
gebliebenen Material nochmals das Kapital einer Full Price CD zu
schlagen!</P>

Fazit: 10 von 10 Punkten</P><CENTER>
<img src="kit.gif"></P>
<img src="mccov3.jpg"></P>
<img src="kit.gif"></P>
</CENTER>

<hr>
<a name="konzert.html">
<h1><cENTER><FONT COLOR="WHITE">Konzertbericht (Savatage & Guests)</FONT></h1></CENTER></P>

Am 20.8.99 war es soweit: Savatage spielten, anl&#228;&#223;lich des 15 j&#228;hrigen Bestehens von Steamhammer (Label),
ihr einziges Konzert in diesem
Jahr und das in K&#246;ln in der &quot;Live Music Hall&quot;. Ehrensache, da&#223; man sich das
ganze nicht entgehen lassen durfte. Bei str&#246;mendem Regen also mit dem Auto
hin. Aufgrund technischer Probleme musste der Start zwar etwas nach hinten
verlegt werden, aber das tat der Stimmung keinen Abbruch. Durch die
zeitliche Verz&#246;gerung musste lediglich der angek&#252;ndigte &quot;Special Guest&quot;
weichen; wer das war, ist bis heute unklar... </P>

<img src="konzert.jpg" align=right>Die erste Band, Freedom Call, er&#246;ffneten auch recht amtlich und hatten das
Publikum gut im Griff. Besonders der Frontman wirkte sehr agil und meisterte
seine Aufgabe hervorragend. Nat&#252;rlich waren auch die Songs, die allesamt vom
gutklassigen Debut &quot;Stairway To Fairyland&quot; stammten, durchweg gelungen, so
da&#223; der 30 min&#252;tige Auftritt sehr kurzweilig war. Zu erw&#228;hnen sein noch, da&#223;
Dirk Schl&#228;chter (Gamma Ray) der Band an den Keyboards aushalf;
wahrscheinlich weil dessen Bandkollege Dan Zimmermann (normalerweise auch
bei Gamma Ray) hinter der Schie&#223;bude sa&#223;.</P>

Die gute Stimmung wurde aber durch die zweite Band an diesem Abend wieder
ruiniert: Skew Siskin spielten zwar keineswegs &#252;bel, aber passte ihre Rotz
Rock orientierte Musik doch wirklich nicht in diesen Rahmen. Somit war es
auch nicht weiter verwunderlich, da&#223; die Savatage Fans sehr ungehalten waren
und die meisten froh waren, als Skew Siskin wieder von der B&#252;hne gingen. Na
ja, vielleicht h&#228;tte man als zweite Vorband jemanden geholt, der in den
musikalischen Rahmen passte...</P>

Als Savatage dann endlich die Bretter betraten, hielt es die Fans nicht mehr
auf ihren angestammten Pl&#228;tzen und es kam gute Stimmung auf. Auch die Band
war sichtlich in Spiellaune, was nat&#252;rlich nur noch f&#246;rdernd war. Das
einzigste bedauerliche an diesem Abend war, da&#223; einige Songs nur in Meddley
Form angespielt wurden, was aber bei der Masse an hervorragenden Songs auch
verst&#228;ndlich ist. Gleichermasen kamen neue &amp; alte Nummern (Setlist siehe Ende)
zum Zuge; es
wurden sogar zwei brandneue Nummern auf die Fans losgelassen, die auf dem n&#228;chsten Album
erscheinen werden. Aber das wahre Highlight an diesem Abend war keine
Savatage Nummer, sondern eine Coverversion namens &quot;Bohemian Rhapsody&quot; von
Queen (wer kennt diese G&#246;ttergabe nicht??). Als die ersten Akkorde aus den
Boxen dr&#246;hnten, lief es mir warm und kalt &#252;ber den K&#246;rper und anhand er
euphorischen Reaktionen vom Rest des Publikums war ersichtlich, da&#223; es mir
nicht alleine so ging. Durch leichte Improvisation wurde die Nummer noch
besser und man kann sicher sein: Soetwas sieht man nicht alle Tage! Leider
nahte auch bald darauf schon das Ende, aber nat&#252;rlich gab es noch mit &quot;Hall
Of The Mountain King&quot; die gew&#252;nschte Zugabe, die auf keinem Savatage Konzert
fehlen durfte. Als Fazit bleibt festzuhalten, da&#223; Savatage in perfekter Form
waren und auch merhstimmige Nummern a la &quot;Chance&quot; oder &quot;Not What You See&quot;
ohne Probleme hinbekamen. Auch Jon Oliva war wieder einmal zu vielen kleinen
Scherzen aufgelegt und sorgte f&#252;r den einen oder anderen Lacher im Publikum.
Und der Rest der Band war ohnehin voller Spielfreude &amp; Tatendrang, so da&#223;
man voller Aufregung auf das neue Album warten kann. 
Ein toller Gig!</P>

<u>Tracklist von Savatage: (falsche Reihenfolge!)</U></P>


1. Intro von Hall Of The Mountain King <BR>

2 &amp; 3: 2 neue Songs<BR>

4. Legions<BR>

5. Chance<BR>

6. When The Crowds Are Gone<BR>

7. Stare Into The Sun<BR>

8. Dead Winter Dead<BR>

9. The Hourglas<BR>

10. Power Of The Night<BR>

11. Sirens<BR>

12. The Storm <BR>

13. Wake Of Magellan <BR>

14. Edge Of Thorns<Br>

15. Not What You See <BR>

16. In The Dream<BR>

17. Streets <BR>

18. Tonight He Grins Again<BR>

19. New York City Don`t Mean Nothing<br>

20. Christmas Eve<BR>

21. Strange Wings<BR>

22. One Child <BR>

23. Bohemian Rhapsody<BR>

24. Believe <BR>

25. Hall Of The Mountain King</P>

Anmerkung: Einige Songs wurden zu Medleys zusammengefasst, so da&#223; es nicht
25 Songs in voller L&#228;nge waren.</P>


<hr>
<a name="lyrics.html">
<h1><CENTER><FONT COLOR="PURPLE">Interessante Lyrics</FONT></h1><P>

F&#252;r diese Ausgabe habe ich mir den Song &quot;So Sick&quot; vom Debut Soloalbum von
Michael Kiske (ex-Helloween) herausgepickt. &quot;So Sick&quot; l&#228;&#223;t viele
Interpretationsm&#246;glichkeiten offen; auch im Bezug auf Helloween. Aber ich
denke mal, da&#223; die Message recht eindeutig ist. Schaut
selbst:</P><CENTER>

I`m Sick Of Finding There Is No One You Can Trust<BR>
I`m Sick Of Haering Money Making`s A Must<BR>
I`m Tired Of Seeing People Slander Behind Backs<BR>
I Can`t Stand Seeing You Sneaking Up My Arse!</P>

I Get Ill When I See What People Do For Cash<BR>
How Little Love Means And Every Day It Means Less<BR>
Headline-lies To Feed The Hunger For Hate<BR>
Can Anybody Tell Me That It`s Not Too Late?</P>

<u>Chorus:</U><br>
But I See Light - It Shines So Bright <BR>
Can Anybody Say What Is Happening To Me?<BR>
Can Anybody Say?</P>


Even Art Is Sold For The Cheapest Success<BR>
To Express Yourself Means Nothing I Guess ?!<BR>
But I`m Telling You All, There`s Nothing Else That I`ll Do<BR>
`Cause What Keeps Me Goin` Ain`t The Praise From You!</P>

Mr. Smart Is Loud Calling Everybody To Roar<BR>
Calls Himself A Real Friend, The Perfect Friend I`m Wishing For!<BR>
I Know He Just Means Good By Trying To Tell Me How To Play<BR>
It`s Just I Don`t Give A Shit `bout Anything He`ll Say</P>

<U>Refrain</U></P>

This Business`s A Lie - I Dont Believe In It - This Business`s A Lie</P>

Well It`s Hip To Be Stupid - So I Like To Be Smart<BR>
And When They Say It`s All Over - I Like To Give It A Start<BR>
And When It`s Hip To Be Hip - I Give A Hip Hip Shit<BR>
And When They Want Me To Go On - I`m Pretty Sure That I Quit<BR>
I Ain`t Running This Race - It Ain`t Worth A Tear<BR>
I Won`t Sweat For This - To Me Everything Is Clear<BR>
If Now I Didn`t Make A Point - There Is No Point To Make <BR>
I Don`t Want A Piece Of Your Cake!<BR>
It`s All Cheap And Dumb - A Sick After Money Run<BR>
I Didn`t Mean To Wake You Up - But I Slept Too Long</P>

I Won`t Fight With Fools And That Is Really Victory <BR>
There Are Sides To Choose And Only One Will Let Me Be<BR>
I Know I Got Some Friends, But Even If There`s Just A Few<BR>
I Won`t Feed The Blind, No That`s The Last I Wanna Do!</P>

What Means Everythings To Me No One Gives A Damn<BR>
And What`s Nothing In My Eyes Is Held High Up In Their Hands<BR>
Don`t Wanna Please Anyone, Don`t Wanna Give What`s Been Asked<BR>
And What`s The First For You, For Me It`s The Last</P>

</CENTER>
<hr>
<a name="tour.html">
<h1><CENTER><FONT COLOR="GREEN">Tourdaten</FONT></h1></CENTER></P>

<h2><CENTER>Subway To Sally</h2></CENTER></P>

15.10. Biberach, Gigelberg<BR>
16.10. Karlsruhe, Substage<BR>
17.10. Dortmund, Ruh-Rock-Hallen<BR>
18.10. &#220;bach-Palenberg, Rockfabrik<BR>
19.10. Mainz, Kuz                          <BR>
20.10. Braunschweig, FBZ<BR>
21.10. Leer, Zollhaus       <BR>
22.10. Lauterbach, Stadthalle   <BR>
23.10. Erfurt, Centrum<BR>
28.10. Bamberg, Live Club<BR>
29.10. A-Wien, Planet Music<BR>
30.10. A-Wels, Alter Schlachthof<BR>
31.10. A-Graz, Orpheum<BR>
5.11. L-Luxenburg, Festival<BR>
26.12. Neustadt / Orla, Wotufa-Saal<BR>
27.12. Dresden, Alter Schlachthof<BR>
28.12. Offenbach, Hafenbahn<BR>
29.12. Osnabr&#252;ck, Hyde Park<BR>
30.12. Potsdam, Lindenpark</P>

<h2><CENTER>Black Sabbath &amp; Godsmack</h2></CENTER></P>

8.12. Oberhausen, Arena<BR>
16.12. Stuttgart, Schleyerhalle<BR>
17.12. M&#252;nchen, Zenith<BR>
19.12. Leipzig, Messehalle I</P>

<h2><CENTER>Westfalen Festival 1999</h2></CENTER></P>

(19 DM f&#252;r 4 Tage und folgendem Program!):</P>

15.10. Dortmund, FZW: Enola Gay, The Traceelords &amp; Jar</P>

16.10. Bochum, Rockpalast: Iron Savior, Tankard, Smoke Blow</P>

17.10. Dortmund, Ruhr-Rock-Hallen: Subway To Sally, Lefay, Angel Dust,
                                   Sacred Steel, Harrow &amp; Everflow</P>
                                   </CENTER>


<hr>
<a name="Top10.html">
<h1><CENTER>Top 10</H1></CENTER><p>
<CENTER>
<TABLE BORDER="1" WIDTH="50%" BGCOLOR="WHITE">
</TR><TR>
<TD>Gamma Ray</TD>
<TD>Powerplant</TD>
</TR>
<TR>
<TD>Nightwish</TD>
<TD>Oceanborn</TD>
</TR>
<TR>
<TD>Iced Earth</TD>
<TD>Something Wicked This Way Comes</TD>
</TR>
<TR>
<TD>Blind Guardian</TD>
<TD>Nightfall In Middle-Earth</TD>
</TR>
<TR>
<TD>In Flames</TD>
<TD>Colony</TD>
</TR>
<TR>
<TD>Subway To Sally</TD>
<TD>Hochzeit</TD>
</TR>
<TR>
<TD>HammerFall</TD>
<TD>Legacy Of Kings</TD>
</TR>
<TR>
<TD>Testament</TD>
<TD>The Gathering</TD>
</TR>
<TR>
<TD>Anathema</TD>
<TD>Judgment</TD>
</TR>
<TR>
<TD>Children Of Bodom</TD>
<TD>Hatebreader</TD>
</TR>
</TABLE>

Quelle: RockHard
</CENTER>
<hr>
<a name="Outro.html">
<H1><CENTER><u>Abschlieﬂend</U></h1></CENTER><p>

Ihr seid auch schon wieder am Ende der aktuellen Ausgabe der Metal Corner
angelangt, die Euch hoffentlich gefallen hat. F&#252;r die n&#228;chste Ausgabe
verspreche ich Euch mindestens zwei CD Kritiken (Grave Digger`s &quot;Excalibur&quot;
und Helloween`s Coveralbum &quot;Jukebox&quot;) und einen Livebericht zum Iron Maiden
Konzert (jawoll; und nur exclusiv in der Metal Corner) in der Essener
Grugahalle. Was es sonst noch so gibt, wei&#223; ich selber nicht genau. La&#223;t
Euch einfach mal &#252;berraschen - so long!</P>
<CENTER>
                                            Kilian<BLINK> "The Bruce"</BLINK> Servais
<HR>
<CENTER>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><P></A>
</CENTER>
</P>
</BODY>
</HTML>
