<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Lars Philipsen / bdw">
   <meta name="GENERATOR" content="Mozilla/4.51 [de]C-CCK-MCD QXW03200  (Win95; I) [Netscape]">
   <title>Astro-Corner 7 (Oktober 1999)</title>
</head>
<body background="marmor.jpg">
&nbsp;
<center><table COLS=1 WIDTH="44%" BGCOLOR="#FFCC00" >
<tr>
<td>
<center><font size=+2><b>Astro-Corner 7 </b><i>(Oktober '99)</i></font></center>
</td>
</tr>
</table></center>

<p>Hallo NoCover-Leser!
<p>Willkommen zur siebten Ausgabe der <i>Astro-Corner</i>. Seit der letzten
NoCover gibt es wieder einige Neuigkeiten aus den Bereichen Astronomie,
Astrophysik, Sonnensystem und Kosmologie zu berichten.
<p>Ich w&uuml;nsche viel Spa&szlig; beim Lesen!
<p>
<hr WIDTH="100%">
<br>&nbsp;
<center><table COLS=1 WIDTH="54%" BGCOLOR="#FFCC99" >
<caption>
<center><a NAME="Inhalt"></a><b><font size=+1>Inhalt dieser Ausgabe:</font></b></center>
</caption>

<tr>
<td>
<center><a href="#Rätsel">R&auml;tsel um Entstehung der Neptun-Ringe</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Marskrater">Marskrater k&ouml;nnte Leben beherbergt haben</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Tolle">Tolle Bilder von Chandra</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Extraterrestrisches">Extraterrestrisches Wasser &auml;lter
als Sonnensystem?</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Gravitationswellen">Gravitationswellen bremsen Neutronensterne
aus</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Mikrobenmatten">Mikrobenmatten auf dem Mars?</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Doch">Doch kein Wasser auf dem Mond?</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Jupiter">Jupiter-Monde sind von Staub umgeben</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#bei">Gravitationswellen bei verschmelzenden Schwarzen
L&ouml;chern</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Schwarzes">Schwarzes Loch entstand bei Sternenexplosion</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Neue">Neue Hinweise f&uuml;r Wasser auf Europa</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Ist">Sonnensystem aus Glaspartikeln entstanden?</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Zahlreiche">Zahlreiche Mini-Staubst&uuml;rme auf dem
Mars</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Ließ">Lie&szlig; ein Gammablitz die Erde entstehen?</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Alternde">Alternde Sterne werden asymmetrisch</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Magnetfelder">Magnetfelder wichtig f&uuml;r Sternentstehung</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Wissenschaftler">Teleskop auf dem Meeresboden</a></center>
</td>
</tr>

<tr>
<td>
<center><a href="#Rätselhafte">R&auml;tselhafte Supernova-Bilder von Chandra</a></center>
</td>
</tr>
</table></center>

<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Rätsel"></a><b>R&auml;tsel um Entstehung der Neptunringe.
Ringe umgeben Planeten nur vor&uuml;bergehend</b>
<p>(Meldung vom 20.8.1999)
<p>Neue Aufnahmen des Weltraumteleskops Hubble widerlegen eine allgemein
akzeptierte Theorie zur Entstehung der schmalen Ringe des Gasplaneten Neptun.
Das berichten zwei Wissenschaftlerteams unter Leitung von Bruno Sicardy
vom Observatoire de Paris und von Chrsitophe Dumas vom Jet Propulsion Laboratory
in Pasadena im Wissenschaftsjournal Nature.
<p>Die Ringe, die 1984 entdeckt wurden, bestehen aus mehreren voneinander
getrennten B&ouml;gen. Solche B&ouml;gen sollten der Theorie nach nur wenige
Monate stabil bleiben und sich dann in breite, durchgehende Ringe verwandeln
- es sei denn, ein Mond kreist inmitten der B&ouml;gen und ein weiterer
befindet sich in der N&auml;he. Ihre Schwerkraft kann dann sogar L&uuml;cken
in die Ringe rei&szlig;en.
<p>Die Raumsonde Voyager, die 1989 am Neptun vorbei flog, entdeckte tats&auml;chlich
einen passenden Mond, der Galatea genannt wurde. Dank verbesserter Aufnahmetechniken
konnten die B&ouml;gen jetzt erstmals von der Erde aus beobachtet werden.
Es zeigte sich, dass sie an Stellen liegen, die mit der Theorie nicht vereinbar
sind. Galatea allein kann die L&uuml;cken im Ring nicht erkl&auml;ren.
Wahrscheinlich, so schreiben die Forscher, gibt es noch weitere, nur zehn
bis 20 Kilometer gro&szlig;e, noch unentdeckte Monde, die die B&ouml;gen
auf Position halten.
<p>Offensichtlich, so heisst es in Nature, seien Ringe nur vor&uuml;bergehende
Ph&auml;nomene im Leben eines Planeten. Sie entstehen, wenn ein Mond durch
einen Meteoriteneinschlag zerst&ouml;rt wird und d&uuml;nnen mit der Zeit
immer mehr aus.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Marskrater"></a><b>Marskrater k&ouml;nnte Leben beherbergt
haben</b>
<p>(Meldung vom 27.8.1999)
<p>Ein noch namenloser Krater auf dem Mars hat m&ouml;glicherweise in fr&uuml;heren
Epochen ein Tummelplatz f&uuml;r Mikroorganismen gewesen sein. Wie ein
Team von Geowissenschaftlern unter Leitung von Mike Russell, Professor
an der Universit&auml;t von Glasgow, im Fachmagazin "Journal of the Geological
Society" berichtet, k&ouml;nnte eine wei&szlig;e, linsenf&ouml;rmige Fl&auml;che
innerhalb des 90 Kilometer gro&szlig;en Kraters aus Magnesiumkarbonat bestehen.
M&ouml;glicherweise ist dieses Mineral in einem See entstanden, dessen
Wasser verdunstete, wobei sich mit Hilfe photosynthetisierender Mikroben
Magnesiumkarbonat bildet.
<p>Auf der Erde sind &auml;hnliche Prozesse bekannt: Im Salda-See in der
T&uuml;rkei tritt magnesiumreiches Grundwasser aus dem Untergrund in den
See. Durch einen chemischen Prozess, der von Blaualgen und Diatomeen unterst&uuml;tz
wird, bilden sich blumenkohlartige Massen von Hydromagnesit. In Bela Stena,
Serbien, gibt es &auml;hnliche, Millionen Jahre alte Ablagerungen aus einem
See, der heute verschwunden ist. Die Suche nach Leben auf dem Mars, schlagen
die Forscher vor, solle sich auf den 15 mal 18 Kilometer gro&szlig;en wei&szlig;en
K&ouml;rper konzentrieren. Falls dort charakteristische wulstige Strukturen
auftr&auml;ten, w&auml;re das ein ernstzunehmender Hinweis darauf, dass
die Ablagerungen vor 4,6 bis 3,1 Milliarden Jahren durch biologische Prozesse
entstanden sind.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Tolle"></a><b>Tolle Bilder aus dem All. R&ouml;ntgensatellit
Chandra funktioniert hervorragend</b>
<p>(Meldung vom 31.8.1999)
<p>Die &Uuml;berreste einer Supernova und ein weit entfernter Quasar sind
die ersten Objekte, die das amerikanische R&ouml;ntgenteleskop Chandra
beobachtete. Die Nasa ver&ouml;ffentlichte die beiden spektakul&auml;ren
Aufnahmen, die noch in der Kalibrierungsphase des Satelliten entstanden
sind. "Als ich das erste Bild gesehen habe, wusste ich, dass ein Traum
wahr geworden ist", sagte der Projektwissenschaftler Martin Weisskopf vom
Marshall Space Flight Center.
<p>Die Wissenschaftler erhielten eine detailreiche Aufnahme der 300 Jahre
alten Supernova Cassiopeia A. Auf dem Bild ist die Explosionswolke des
Sterns zu sehen, die mit dem umliegenden Gas zusammenst&ouml;&szlig;t.
Das Gas hat sich auf 50 Millionen Grad aufgeheizt und wird von Schockwellen
durchzogen. Schwere Elemente in der Gasblase senden R&ouml;ntgenstrahlen
aus, aus denen die Wissenschaftler auf die genaue Menge der Elemente im
Gas schlie&szlig;en k&ouml;nnen. Besonders erfreut waren die Wissenschaftler
dar&uuml;ber, im Zentrum der Supernova einen hellen Punkt zu sehen - wahrscheinlich
der Neutronenstern oder das Schwarze Loch, das bei der Sternexplosion &uuml;brig
geblieben ist.
<p>Auf der zweiten Aufnahme ist ein heller R&ouml;ntgenblitz zu sehen,
den ein Quasar 200.000 Lichtjahre weit ins All sendet. Die Chandra-Mitarbeiter
hoffen, mit ihren Messungen Einblick in die supermassiven Schwarzen L&ouml;cher
zu gewinnen, die im Zentrum von Quasaren vermutet werden.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Extraterrestrisches"></a><b>Extraterrestrisches Wasser in
Meteoriten gefunden. Ist es &auml;lter als das Sonnensystem?</b>
<p>(Meldung vom 2.9.1999)
<p>Die j&uuml;ngste Ausgabe der Zeitschrift Science berichtet &uuml;ber
einen spektakul&auml;ren Meteoritenfund, der allerdings schon auf das vergangene
Jahr zur&uuml;ckgeht. Damals beobachtete eine Gruppe von Jungen im westlichen
Texas den Niedergang eines Meteoriten am hellichten Tag. Es gelang ihnen
sogar, den kosmischen Brocken zu finden und ihn zum Johnson Space Center
(JSC) zu bringen, wo er eingehend untersucht wurde.
<p>Zu ihrer gro&szlig;en &Uuml;berraschung fanden die Wissenschaftler im
Innern blaue und violette Halit-Kristalle (Steinsalz). Diese waren bis
zu 3 Millimeter gro&szlig; und damit die gr&ouml;&szlig;ten, die jemals
in extraterrestrischem Material gefunden wurden. Die Anwesenheit von Wasser
innerhalb der Kristalle wurde von den Wissenschaftlern durch verschiedene
Analysmethoden nachgewiesen.
<p>Die Farben der Kristalle wurden durch Strahlung, vermutlich vor etwa
4,5 Milliarden Jahren hervorgerufen. Dies bedeutet, da&szlig; das eingeschlossene
Wasser &auml;lter sein k&ouml;nnte als unser Sonnensystem. Die Autoren
des mit dem Titel "Asteroidal Water Within Fluid Inclusion-Bearing Halite
in an H5 Chondrite, Monahans (1998)" erschienenen Artikels nehmen an, da&szlig;
die Salz-Sole entweder w&auml;hrend der Reise des Asteroiden durch der
Weltraum in diesen eindrang oder aber beim Vorbeiflug an einem anderen
kosmischen Objekt, wie zum Beispiel einem Kometen, auf ihn gelangte.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astrophysik:</i>
<br><a NAME="Gravitationswellen"></a><b>Gravitationswellen bremsen Neutronensterne
aus. Suche nach "jugendlichen Rasern" unter den Pulsaren</b>
<p>(Meldung vom 6.9.1999)
<p>Neutronensterne senden w&auml;hrend bestimmter Phasen ihrer Entwicklung
wahrscheinlich gro&szlig;e Energiemengen als Gravitationswellen aus. Das
zeigen jedenfalls Modellrechnungen, die ein internationales Forschungsteam
gemeinsam mit Wissenschaftlern des Max-Planck-Instituts f&uuml;r Gravitationsphysik
(Albert-Einstein-Institut) in Golm bei Potsdam unternommen hat.
<p>Die Ergebnisse lassen erwarten, dass die superdichten Sterne innerhalb
nur eines Jahres nach ihrer Entstehung ein Energie&auml;quivalent von etwa
einem Prozent der Sonnenmasse - das entspricht etwa 5 x 1026 Tonnen - in
der Form von Gravitationswellen abstrahlen.
<p>Neutronensterne entstehen, wenn sehr massereiche Sterne am Ende ihrer
Entwicklung als Supernovae explodieren. Das Zentrum des Sterns wird dabei
so stark zusammengequetscht, dass es im wesentlichen nur noch aus Neutronen
besteht. Solche Stern-&Uuml;berreste haben mit rund 20 Kilometern Durchmesser
die Gr&ouml;&szlig;e einer Kleinstadt.
<p>Weil bei diesem abrupten Schrumpfprozess der Drehimpuls erhalten bleibt,
kann ein neu entstandener Neutronenstern au&szlig;erordentlich schnell
rotieren. Er sendet dabei elektromagnetische Strahlung aus, die wie der
Lichtkegel eines kosmischen Leuchtturms die Erde streifen kann. Astronomen
haben die pulsierende Radiostrahlung von etwa tausend solcher Objekte registriert,
die auch als Pulsare bezeichnet werden.
<p>F&uuml;r Astrophysiker ist es ein R&auml;tsel, warum sich unter den
jungen Neutronensternen kein einziges Exemplar befindet, das weniger als
15 Tausendstel Sekunden f&uuml;r eine Umdrehung um die eigene Achse ben&ouml;tigt.
"Theoretisch sind Rotationszeiten von weniger als einer Tausendstel Sekunde
m&ouml;glich, ohne dass die Fliehkraft die superdichte Neutronenkugel auseinanderrei&szlig;t",
sagt Dr. Kostas Kokkotas von der Aristoteles Universit&auml;t in Thessaloniki.
Er hat zusammen mit Dr. Nils Anderson von der Universit&auml;t Southampton/USA
und Prof. Bernard Schutz vom Max-Planck-Institut f&uuml;r Gravitationsphysik
die Berechnungen gemacht.
<p>Eine m&ouml;gliche Ursache f&uuml;r das Fehlen "jugendlicher Raser"
unter den Pulsaren k&ouml;nnte die Gravitationsstrahlung sein. Sie ist
wenige Wochen und Monate nach dem Kollaps des Supernova-Sterns zu einer
stark komprimierten Kugel aus Neutronen besonders gro&szlig;. Gravitationswellen
verst&auml;rken zus&auml;tzlich Vibrationen des &uuml;ber eine Milliarde
Grad hei&szlig;en Neutronengases - Vibrationen, die vergleichbar mit einem
Wellenph&auml;nomen (Rossby-Wellen) auf den irdischen Weltmeeren sind und
von den Astronomen als r-Moden bezeichnet werden.
<p>Dieser Effekt setzt der Rotationsdauer neuer Neutronensterne Grenzen.
Bereits innerhalb nur eines Jahres kann deshalb die Rotationsperiode von
1000 auf weniger als 100 Umdrehungen pro Sekunde sinken, fand die Arbeitsgruppe
heraus.
<p>Die Forschungsergebnisse bieten eine alternative Erkl&auml;rung zu Modellen,
die den Bremseffekt mit einer Art magnetische Kopplung zwischen dem Kerngebiet
und der Gash&uuml;lle des explodierten Vorl&auml;ufersterns erkl&auml;ren.
<p>"Wahrscheinlich sind auch einige &auml;ltere Neutronensterne vielversprechende
Quellen nachweisbarer Gravitationswellen", meint Dr. Nikolaos Stergioulas
vom Max-Planck-Institut f&uuml;r Gravitationsphysik in Golm. Zusammen mit
Nils Anderson und Kostas Kokkotas analysierte er kompakte Modellsterne,
die Gas von einem nahen Begleitstern aufsaugen. Durch den Aufprall dieser
Materie k&ouml;nnen die Neutronenkugeln einen zus&auml;tzlichen "Kick"
erhalten, der ihre Rotationsperiode beschleunigt. Mehr als ein Dutzend
derartige Objekte haben Astronomen im Universum bereits nachgewiesen.Einige
ben&ouml;tigen f&uuml;r eine Umdrehung kaum mehr als zwei Tausendstel Sekunden.
<p>Die j&uuml;ngsten Modellrechnungen, ver&ouml;ffentlicht im Astrophysical
Journal (Band 516 /1999/ S. 307-314), zeigen, dass aufgrund der "r-Moden"
wahrscheinlich auch diese Neutronensterne bei vergleichsweise niedrigen
Temperaturen von &uuml;ber 200 000 Grad Gravitationswellen ausstrahlen
k&ouml;nnen. Die von dem Begleitstern einfallende Materie heizt diesen
Prozess an und h&auml;lt ihn am Laufen. "Diese Neutronensterne sind f&uuml;r
uns deshalb besonders interessant, weil sie nicht nur &uuml;ber Monate,
sondern &uuml;ber viele Jahre hinweg, Gravitationswellen aussenden. Das
erh&ouml;ht unsere Chancen, sie mit Instrumenten auf der Erde nachzuweisen",
erkl&auml;rt Dr. Kokkotas.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Mikrobenmatten"></a><b>Mikrobenmatten auf dem Mars?</b>
<p>(Meldung vom 8.9.1999)
<p>Ein gewaltiger, 200 qkm umfassender H&uuml;gel auf dem Mars k&ouml;nnte
nach Ansicht von Wissenschaftlern auf die Lebenst&auml;tigkeit von Organismen
zur&uuml;ck zu f&uuml;hren sein.
<p>Der in der N&auml;he des Mars-&Auml;quators befindliche Berg, so Michael
Russell vom Scottish Universities Research and Reactor Centre, habe gro&szlig;e
&Auml;hnlichkeit mit den etwa 3 Milliarden Jahre alten irdischen sogenannten
Stromatolithen.
<p>Stromatolithen sind &uuml;bereinandergestapelte subaquatische Mikrobenmatten
aus Cyanobakterien und/oder anderen photosynthetischen Mikroben, die durch
Kalkausscheidung das in ihnen fixierte Sediment zu einer feinen Calciumkarbonat-Kruste
aush&auml;rten.
<p>Russell und sein Team entdeckten die urzeitlichen Bildungen erst k&uuml;rzlich
in der westlichen T&uuml;rkei. Zu ihrer gro&szlig;en &Uuml;berraschung
stellten die Wissenschaftler fest, da&szlig; diese aus Magnesium- und nicht
- wie &uuml;blicherweise - aus Calcium-Verbindungen aufgebaut waren. Die
M&ouml;glichkeit von Magnesiumhaltigen Stromatolithen auf der Erde l&auml;sst
es durchaus m&ouml;glich erscheinen, dass solche einst auch auf dem Mars
existierten.
<p>Aufgrund ihrer hellen Farbe wurden die marsianischen Strukturen von
den meisten Forschern bisher als aus pr&auml;historischen Meeren ausgef&auml;lltes
Calciumsulfat (Gips) interpretiert.
<p>Die Mars-Sonde Global Surveyor soll im kommenden Jahr eine Spektralaufnahme
von dem Gebiet machen und kl&auml;ren, ob die Gesteine wirklich gr&ouml;&szlig;ere
Anteile an Magnesiumkarbonat enthalten oder nicht.
<p>Eine definitive Antwort nach der Frage, ob dies Spuren marsianischen
Lebens sein k&ouml;nnten, kann jedoch nur vor Ort gegeben werden. Zwar
ist nicht zu erwarten, da&szlig; sich in dem Gestein fossile Mikroben erhalten
haben, doch w&auml;re der (selbst durch eine unbemannte Mission zu erbringende)
Nachweis der typisch feinlaminierten, stromatolithischen Sedimentstrukturen
in Anlehnung an irdische Bildungen ein sehr sicherer Beleg daf&uuml;r,
da&szlig; einst - wie bei uns - Mikroorganismen diese Formationen hervorgebracht
haben.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Doch"></a><b>Doch kein Wasser auf dem Mond?</b>
<p>(Meldung vom 8.9.1999)
<p>Ob beim Aufprall der Raumsonde Lunar Prospector auf dem Mond Wasser
aufgewirbelt wurde oder nicht, steht immer noch nicht fest. Bislang konnten
die Wissenschaftler in ihren Daten keine Hinweise auf die Verbindung finden.
"Wir m&uuml;ssen uns die Daten des Weltraumteleskops Hubble, des McDonald
Observatoriums und des Keck-Teleskops noch genau anschauen", sagte David
Goldstein, Leiter der Arbeitsgruppe an der Universit&auml;t von Texas,
die den Crash der Sonde initiierte. Eine sichtbare Staubwolke wurde bei
dem Aufprall nicht beobachtet - was die Wissenschaftler als gutes Zeichen
deuten: Eine gro&szlig;e Wolke h&auml;tte bedeutet, dass die Sonde nicht
im Krater selbst eingeschlagen w&auml;re, sondern in seinem Rand, wo kein
Wasser vermutet wird. Auch wenn sich in den Daten keinerlei Hinweise auf
Wasser finden lassen, muss das nicht bedeuten, dass es kein Wasser auf
dem Mond gibt: Die Verbindung k&ouml;nnte auch in Mineralien eingebettet
sein und nicht als freies Eis vorliegen. Oder die Eisvorkommen am Kraterboden
k&ouml;nnten fleckenhaft verteilt sein, so dass die Raumsonde eine trockene
Stelle getroffen haben k&ouml;nnte. Endg&uuml;ltige Ergebnisse wollen die
Forscher von der Universit&auml;t Texas in einigen Wochen pr&auml;sentieren.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astrophysik:</i>
<br><a NAME="Jupiter"></a><b>Jupiter-Monde sind von Staub umgeben</b>
<p>(Meldung vom 8.9.1999)
<p>Die Raumsonde Galileo hat feine Stuabwolken um die drei gr&ouml;&szlig;ten
Monde des Riesenplaneten Jupiter entdeckt. Als die Sonde nah an den Monden
Ganymed, Callisto und Europa vorbeiflog, registrierte der Staubdetektor
von Galileo jeweils in der halben Stunde der n&auml;chsten Ann&auml;herung
einen starken Anstieg von Kollisionen mit Partikeln. Die Staubk&ouml;rner
waren weniger als ein Millionstel Meter gro&szlig; und bewegten sich verh&auml;ltnism&auml;&szlig;ig
langsam - nur acht Kilometer pro Sekunde. Das bedeutet, dass sie nicht
aus dem interplanetaren oder gar interstellaren Raum stammen. Die Schwerkraft
oder das Magnetfeld der Monde w&auml;re ohnehin zu schwach, um eine messbare
Menge von Staubk&ouml;rnern einzufangen.
<p>Stattdessen sind die Monde selbst die Quelle der Staubpartikel: Offenbar
werden die winzigen Partikel durch schnelle interplanetare Teilchen von
der Oberfl&auml;che der Trabanten aufgewirbelt. Daf&uuml;r, dass sie aus
Geysiren oder Vulkanen stammen, wie das beim vierten gro&szlig;en Jupiter-Mond
Io der Fall ist, gibt es bei den anderen drei galileischen Monden keine
Anzeichen.
<p>Die meisten der beobachteten Partikeln folgen ballistischen Bahnen.
Das heisst, dass sie nach ein paar Stunden oder Tagen wieder auf die Oberfl&auml;che
des Mondes zur&uuml;ckfallen.
<p>Da st&auml;ndig neue Partikel aufgewirbelt werden, umgibt die Monde
eine zwar d&uuml;nne, aber dauerhafte Wolke. Die Staubwolken sind zu fein,
um optisch aufgesp&uuml;rt zu werden. Allerdings k&ouml;nnen kleinere Monde
durchaus wahrnehmbare Staubringe oder Halos besitzen, die auf die gleiche
Weise entstehen: Das ist bei den Jupiter-Monden Adrastea, Metis, Thebe
und Amalthea und beim Saturn-Mond Enceladus der Fall.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astrophysik:</i>
<br><b>Gravitationswellen&nbsp;<a NAME="bei"></a>bei verschmelzenden Schwarzen
L&ouml;chern</b>
<p>(Meldung vom 9.9.1999)
<p>Bei der Kollision von zwei Schwarzen L&ouml;chern kann eine gro&szlig;e
Menge Energie in Form von Gravitationswellen abgestrahlt werden. Das hat
Bernd Br&uuml;ckmann vom Max Planck-Institut f&uuml;r Gravitationsphysik
(Albert Einstein Institut) durch Modellrechnungen mit einem Supercomputer
herausgefunden.
<p>Br&uuml;ckmann berichtet im International Journal of Modern Physics,
wie die Ereignishorizonte - der Ereignishorizont ist der Ort, von dem selbst
das Licht der Anziehungskraft eines Schwarzen Loches nicht mehr entkommen
kann - der beiden Schwarzen L&ouml;cher wie zwei Wassertropfen verschmelzen.
Dabei nimmt die Ausstrahlung von Gravitationswellen enorm zu.
<p>Wenn zwei Objekte von etwa zehn bis 15 Sonnenmassen sich auf etwa 45
Kilometer ann&auml;hern und dann kollidieren, k&ouml;nnten sie ein Prozent
ihrer Masse als Gravitationswellen abstrahlen. "Das ist tausend Mal soviel
Energie, wie sie die Sonne in den letzten f&uuml;nf Milliarden Jahren abgegeben
hat", sagt Br&uuml;ckmann.
<p>Auf der ganzen Welt arbeiten Wissenschaftler zur Zeit an Instrumenten,
mit denen Gravitationswellen nachgewiesen werden sollen. Unter anderem
entsteht in der N&auml;he von Hannover ein 600 Meter langes Interferometer.
<p>Kollidierende Schwarze L&ouml;cher, aber auch Neutronensterne mit einem
Begleitstern sind gute Kandidaten, um die geheimnisvollen Wellen endlich
zu beobachten.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Schwarzes"></a><b>Schwarzes Loch entstand bei Sternenexplosion</b>
<p>(Meldung vom 10.9.1999)
<p>Zum ersten Mal ist es Wissenschaftlern gelungen, ein Schwarzes Loch
aufzusp&uuml;ren, das aus einer Supernova hervorgegangen ist. Rafael Rebolo
vom Instituto de Astrofisica de Canarias auf Teneriffa hat das Doppelsternsystem
Nova Scorpii 1994 untersucht und festgestellt, dass die Atmosph&auml;re
des sichtbaren Sterns sehr viel Sauerstoff, Magnesium, Silizium und Schwefel
enth&auml;lt.
<p>Diese Elemente k&ouml;nnen nicht so gro&szlig;en Mengen im Innern des
Sterns selbst produziert worden sein, berichtet der Forscher im Wissenschaftsjournal
Science. Rebolo vermutet, dass es sich um Material handelt, das bei der
Supernova-Explosion des jetzt nicht mehr sichtbaren Begleitsterns entstanden
ist.
<p>Aus der H&auml;ufigkeit der Elemente schlie&szlig;t Rebolo, dass der
Stern fr&uuml;her zwischen 25 und 40 Sonnenmassen schwer war. Das bedeutet,
dass das &Uuml;berbleibsel h&ouml;chstwahrscheinlich zu einem Schwarzen
Loch geworden ist. Der Theorie nach sollten Sterne, die mehr als zehn Sonnenmassen
schwer sind, am Ende ihres Lebens entweder als Supernova explodieren oder
durch ihre eigene Schwerkraft kollabieren.
<p>Bei beiden Prozessen kann ein Schwarzes Loch entstehen. Bis jetzt gab
es aber keinen direkten Beweis daf&uuml;r, dass beim Kollaps eines Sterns
tats&auml;chlich ein Schwarzes Loch entsteht.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Neue"></a><b>Neue Hinweise f&uuml;r Wasser auf Jupiter-Mond
Europa</b>
<p>(Meldung vom 10.9.1999)
<p>Neue Bilder von der Raumsonde Galileo zeigen, dass die Oberfl&auml;che
des Jupiter-Mondes Europa vor etwa 50 Millionen Jahren teilweise geschmolzen
war.
<p>Auf den Bildern sind zwei rostfarbene, 80 Kilometer gro&szlig;e Gebiete
zu sehen, die "Thera" und "Thrace" genannt worden sind. Die Oberfl&auml;che
des Mondes sieht an diesen Stellen unordentlich aus, als ob hier Eisschollen
aufeinandergeprallt w&auml;ren.
<p>Die Region "Thera" liegt leicht unter dem Niveau der umgebenden Ebenen.
Offensichtlich ist die Region irgendwann in der Vergangenheit kollabiert.
Aus der Zahl der Krater, die Europa bedecken, l&auml;sst sich schlie&szlig;en,
dass das vor etwa 50 Millionen Jahren - also im Verh&auml;ltnis zum Alter
des Mondes recht kurzer Zeit - geschehen ist.
<p>Eine Wissenschaftlerin der Universit&auml;t von Arizona vergleicht zurzeit
Aufnahmen der Voyager-Sonde mit Galileo-Bildern, um festzustellen, ob sich
die Oberfl&auml;che von Europa in den letzten 20 Jahren ver&auml;ndert
hat. Aus anderen Galileo-Aufnahmen l&auml;sst sich schlie&szlig;en, dass
die Oberfl&auml;che von Europa an einigen Stellen salzig ist. Wahrscheinlich
gibt es zum Beispiel in der Thrace-Region Magnesiumsulfat, auch als Bittersalz
bekannt. Da salziges Wasser bei niedrigeren Temperaturen schmilzt als S&uuml;&szlig;wasser,
k&ouml;nnte das erkl&auml;ren, warum Thrace anscheinend fr&uuml;her einmal
&uuml;berschwemmt teilweise aufgeschmolzen wurde.
<p>Die braune Farbe, vermuten Forscher, k&ouml;nnte von Eisen- oder Schwefelverbindungen
stammen, da Bittersalz nicht braun aussieht. Aufschl&uuml;sse dar&uuml;ber,
ob es unter der Oberfl&auml;che fl&uuml;ssiges Wasser geben k&ouml;nnte,
kann die Kristallform des Eises geben: Wenn Eis aus fl&uuml;ssigem Wasser
entsteht, bildet sich das sogenannte hexagonale Eis, genau wie auf der
Erde. Bei k&auml;lteren Temperaturen entstehen amorphes oder kubisches
Eis.
<p>Falls auf der Oberfl&auml;che von Europa hexagonales Eis vorhanden ist,
m&uuml;sste um den Mond ein Halo zu sehen sein, wenn das Sonnenlicht in
einem bestimmten Winkel auf die Oberfl&auml;che trifft.
<p>Robert Carlson und Kollegen von Jet Propulsion Laboratory der Nasa haben
versucht, den Halo mit dem "Near Infrared Mapping Spektrometer" von Galileo
bei einem Vorbeiflug an Europa aufzunehmen. Noch analysieren die Wissenschaftler
die Daten. Allerdings wird hexagonales Eis durch energiereiche Strahlung,
wie sie sich im Magnetfeld des Jupiter ansammelt, in amorphes Eis umgewandelt.
<p>Die Chancen, tats&auml;chlich hexagonales Eis zu finden, h&auml;ngen
davon ab, wie lange es schon her ist, dass Europa geschmolzen war.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Ist"></a><b>Ist das Sonnensystem aus winzigen Glaspartikeln
entstanden?</b>
<p>(Meldung vom 10.9.1999)
<p>Der Staub, aus dem sich das Sonnensystem bildete, k&ouml;nnte zu einem
erheblichen Teil aus winzigen Glaspartikeln bestanden haben. Wie John Bradley
vom Georgia Institute of Technology in Atlanta und Kollegen im Fachjournal
Science berichten, haben die sogenannten GEMS-Partikel (Glass with Embedded
Metal and Sulfide) ein &auml;hnliches Spektrum wie die Kometen Halley und
Hale-Bopp, wie Silikate in den &auml;u&szlig;eren Schalen mancher jungen
Sterne und wie Silikate in interstellaren Wolken.
<p>Die Partikel sind wenige Milliardstel Meter gro&szlig; und bestehen
aus Silikat, das Metall und Sulfid eingelagert hat. Wissenschaftler haben
solche Partikel in der Stratosph&auml;re, der zweituntersten Schicht der
Atmosph&auml;re, eingesammelt. Sie stammen von Kometen und Asteroiden.
<p>Bradley und seine Kollegen bestrahlten die Partikel mit intensiver Synchrotron-Strahlung,
um ihre Spektrum zu messen. Die Wissenschaftler vermuten, dass solche Silikate
auch in der Wolke vorhanden waren, aus der das Sonnensystem entstand.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Zahlreiche"></a><b>Zahlreiche Mini-Staubst&uuml;rme auf dem
Mars. F&auml;rbten die "Staubteufel" den Planeten rot?</b>
<p>(Meldung vom 13.9.1999)
<p>Miniatur-Staubst&uuml;rme, die sogenannten "Staubteufel", k&ouml;nnten
eine Rolle dabei spielen, die Oberfl&auml;che des Mars mit dem allgegenw&auml;rtigen
roten Staub zu bedecken. Das berichten Forscher um Stephen Metzger von
der University of Nevada in Reno in den Geophysical Research Letters.
<p>Sie untersuchten Aufnahmen der Raumsonde Mars Pathfinder, auf denen
gr&ouml;&szlig;ere Staubst&uuml;rme zu sehen waren. Die Wissenschaftler
filterten die Bilder, so dass sie kleinere Strukturen und Muster aufl&ouml;sen
konnten. Sie entdeckten f&uuml;nf Staub-"Pilze", die ihrer Meinung nach
den Staubteufeln &auml;hneln, wie sie auf der Erde an sonnigen Tagen auf
Feldern oder Stra&szlig;en durch aufgewirbelten Dreck entstehen.
<br>Die Strukturen auf dem Mars waren zwischen 15 und 50 Metern breit und
zwischen 50 und 400 Metern hoch. "M&ouml;glicherweise l&ouml;sen die Staubteufel
die gro&szlig;en Staubst&uuml;rme aus, die den ganzen Planeten umgeben",
schreiben die Forscher. Auch daran, die feinen Partikel in die Atmosph&auml;re
zu bringen, k&ouml;nnten die Staubteufel beteiligt sein.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astrophysik:</i>
<br><a NAME="Ließ"></a><b>Lie&szlig; ein Gammablitz die Erde entstehen?</b>
<p>(Meldung vom 13.9.1999)
<p>Unser Sonnensystem k&ouml;nnte doch ungew&ouml;hnlicher sein als bisher
gedacht: Zwei Astrophysiker aus Irland vermuten, dass ein Gammablitz im
Umkreis von 300 Lichtjahren die Bildung der Planeten beg&uuml;nstigt haben
k&ouml;nnte. Wie das Wissenschaftsmagazin New Scientist berichtet, haben
Brian McBreen und Lorraine Hanlon vom University College in Dublin die
Theorie aufgestellt, dass die energiereiche R&ouml;ntgen- und Gammastrahlung,
die bei einem Gammablitz entsteht, den Staub in der protoplanetaren Wolke
zu sogenannten Chondren verschmolzen hat. (Mehr zu Gammablitz.)
<p>Chondren sind glasartige Gesteinsk&uuml;gelchen, die reich an Eisen
und Silikaten sind. Primitive Steinmeteoriten, die sogenannten Chondrite,
bestehen zum gro&szlig;en Teil aus den Chondren. In einem Artikel, der
f&uuml;r die Fachzeitschrift "Astronomy and Astrophysics" angenommen wurde,
berichten McBreen und Hanlon, dass ein Gammablitz in der N&auml;he des
jungen Sonnensystems genug Energie geliefert h&auml;tte, um den Staub zu
fl&uuml;ssigen Tropfen zu schmelzen, die dann hinterher zu den Chondren
abgek&uuml;hlt w&auml;ren. Aus diesen dichteren Partikeln h&auml;tten sich
die Planeten leichter bilden k&ouml;nnen als aus Staub.
<p>Bislang war es den Astrophysikern ein R&auml;tsel, wie sich die Chondren
geformt haben. Ein unwahrscheinliches Ereignis wie ein Gammablitz in der
N&auml;he als Ursache w&uuml;rde unser Sonnensystem allerdings zu etwas
Besonderem machen.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><a NAME="Alternde"></a><b>Alternde Sterne werden asymmetrisch</b>
<p>(Meldung vom 14.9.1999)
<p>Der Massenverlust bei einigen alternden Sternen l&auml;uft nicht mehr
kugelsymmetrisch ab, wie etwa bei der Sonne durch den Sonnenwind. Das berichtete
Margaret Meixner von der University of Illinois Urbana-Champaign k&uuml;rzlich
auf einer Konferenz am Massachusetts Institute of Technology.
<p>Die Wissenschaftlerin untersuchte eine Reihe sogenannter protoplanetarer
Nebel mit dem Weltraumteleskop Hubble, um festzustellen, ob bei den Nebeln
Helligkeitsvariationen festzustellen sind.
<p>Protoplanetare Nebel bilden sich als Schale von Gas und Staub um einige
alte Sterne, die st&auml;ndig Masse verlieren.
<p>Bis jetzt war es unklar, wieso die meisten planetaren Nebel - das sind
Nebel, aus denen sp&auml;ter Planeten entstehen k&ouml;nnen - eine Achsensymmetrie
aufweisen, w&auml;hrend ihre Vorl&auml;ufer, die protoplanetaren Nebel,
noch kugelsymmetrisch sind. Meixner und ihren Kollegen ist es jetzt offenbar
gelungen, ein &Uuml;bergangsstadium zu beobachten: Die von ihnen beobachteten
Nebel waren entweder wie eine Ellipse geformt oder wiesen eine bipolare
Struktur auf.
<p>Die Wissenschaftlerin vermutet, dass sogenannte stellare Superwinde,
die ein Stern nur in zwei Richtungen ausst&ouml;&szlig;t, f&uuml;r die
l&auml;ngliche Form der Gasnebel verantwortlich sind. "Offenbar tritt die
Achsensymmetrie, die in planetaren Nebeln oft beobachtet wird, schon vor
der protoplanetaren Phase auf", schloss Meixner auf der Konferenz.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astrophysik:</i>
<br><a NAME="Magnetfelder"></a><b>Magnetfelder wichtig f&uuml;r Sternentstehung</b>
<p>(Meldung vom 14.9.1999)
<p>Magnetfelder spielen wahrscheinlich eine wichtige Rolle dabei, molekulare
Wolken, aus denen sich Sterne bilden, vor dem Kollaps zu bewahren. Ausserdem
&uuml;bertragen sie einen Teil des Drehimpulses vom Stern auf den &uuml;brig
gebliebenen Staub. Das berichtet Richard Crutcher von der University of
Illinois Urbana-Champaign in der aktuellen Ausgabe des Astrophysical Journal.
<p>Bislang war es unklar, wie sich eine molekulare Wolke vor dem Kollaps
durch die eigene Schwerkraft sch&uuml;tzt. G&auml;be es keinen Gegendruck,
m&uuml;ssten l&auml;ngst alle Wolken zu Sternen geworden sein. Bei Sternen
liefert dann die Kernfusion im Innern den n&ouml;tigen Gegendruck gegen
die Gravitation.
<p>Crutcher untersuchte die Magnetfelder von 27 interstellaren Wolken verschiedener
Dichte. Er stellte fest, dass die St&auml;rke der Magnetfelder fast ausreichte,
um die Wolke vor dem Zusammenbruch zu sch&uuml;tzen. Ausserdem wirken Turbulenzen
und Wellen im Magnetfeld dem Gravitationsdruck entgegen. Diese Ph&auml;nomene
sorgen zus&auml;tzlich daf&uuml;r, dass ein neu entstehender Stern nicht
durch die Fliehkraft auseinandergerissen wird: Wenn sich die Wolke zu einer
neuen Sonnen zusammenzieht, dreht sie sich immer schneller - wie ein Eisl&auml;ufer,
der eine Pirouette dreht.
<p>Die magnetischen Turbulenzen &uuml;bertragen allerdings einen Teil dieses
Drehimpulses auf das umliegende Gas, aus dem sich sp&auml;ter m&ouml;glicherweise
Planeten bilden. Durch diesen Mechanismus wird die Sternentstehung erst
m&ouml;glich.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Astrophysik:</i>
<br><a NAME="Wissenschaftler"></a><b>Wissenschaftler montieren Teleskop
am Meeresgrund. Ziel: Neues Bild vom Weltall</b>
<p>(Meldung vom 17.9.1999)
<p>Auf der Suche nach den r&auml;tselhafte Neutrinos installiert ein internationales
Forscherteam jetzt ein Observatorium auf dem Meeresboden: Das Antares-Teleskop
soll nicht in den Weltraum schauen, sondern ins Erdinnere, damit jegliche
st&ouml;rende kosmische Strahlung abgeschirmt wird.
<p>F&uuml;r die Neutrinos - subatomare Partikel, die bei manchen Kernreaktionen
entstehen und die nur sehr schwer aufzusp&uuml;ren sind - stellt die Erde
kein Hindernis dar: Sie reagieren nur selten mit Materie und k&ouml;nnen
ganze Planeten durchqueren, als w&auml;ren sie nicht vorhanden.
<p>Falls ein Neutrino doch einmal mit einem Atom zusammenst&ouml;&szlig;t,
entsteht dabei ein Myon, ein anderes, mit dem Elektron verwandtes Elementarteilchen.
Solche Hochenergie-Myonen soll das Antares-Teleskop finden.
<p>Die Wissenschaftler hoffen, dass die Myonen Licht aussenden, wenn sie
durchs Meer fliegen. Neutrinos k&ouml;nnten den Wissenschaftlern ein neues
Bild vom Weltall liefern, da sie manche f&uuml;r Licht undurchdringlichen,
dichten Regionen des Kosmos durchqueren k&ouml;nnen und von Magnetfeldern
nicht abgelenkt werden.
<p>Das Teleskop wird im Mittelmeer gebaut, 40 Kilometer vor Marseille und
2400 Meter unter der Meeresoberfl&auml;che, gaben die Wissenschaftler auf
einer Konferenz in England bekannt.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p><i>Kosmologie:</i>
<br><a NAME="Rätselhafte"></a><b>R&auml;tselhafte Supernova-Bilder von
Chandra</b>
<p>(Meldung vom 17.9.1999)
<p>Die ersten Bilder der hochaufl&ouml;senden Kamera des neuen R&ouml;ntgenteleskops
Chandra haben ungeahnte Details in einem Supernova-&Uuml;berrest in der
Gro&szlig;en Magellanschen Wolke enth&uuml;llt. Das gab die amerikanische
Raumfahrtagentur Nasa jetzt bekannt.
<p>Der Supernova-Rest N132D ist eine Wolke aus zehn Millionen Grad heissem
Gas und misst 80 Lichtjahre im Durchmesser. In der zentralen Region der
Wolke sind einige kleine runde Strukturen zu erkennen, etwas weiter oben
scheint sich ein gro&szlig;er Ring zu befinden. "Wir m&uuml;ssen erst auseinandersortieren,
was dort wirklich passiert", sagte Stephen Murray vom Harvard Smithsonian
Center for Astrophysics, der an dem Projekt teilnimmt. "Vielleicht hat
es dort mehrere Supernovas gegeben, oder es gibt Wolken, die Teile der
Strahlung absorbieren."
<p>Offenbar st&ouml;&szlig;t der Supernova-Rest mit einer riesigen molekularen
Wolke zusammen, wobei eine Schockwelle durch die Wolke l&auml;uft und R&ouml;ntgenstrahlen
ausgesandt werden. Die molekulare Wolke sendet langwelligere Strahlung
aus und kann daher nur mit Radioteleskopen beobachtet werden.
<p><i><a href="#Inhalt">Zur&uuml;ck zum Inhaltsverzeichnis</a></i>
<p>
<hr WIDTH="100%">
<p>So, bis zur n&auml;chsten Ausgabe der <i>Astro-Corner</i> w&uuml;nsche
ich euch alles Gute!
<p>Euer
<br><img SRC="lars.jpg" ALT="Lars" BORDER=2 height=78 width=108>
<br>Philipsen
<p><a href="mailto:LarsPh@cityweb.de?subject=AW: Astro-Corner">LarsPh@cityweb.de</a>
</body>
</html>
