

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Song Player - Mehr als nur ein Sound Abspieler?</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="YELLOW">Test: Song Player
1.53</FONT></h1></CENTER></P>

Song Player ist ein PD Tool, welches, wie der Name schon suggeriert, Songs
(bzw. Sounddateien)
abspielt. Nat&#252;rlich bleibt es nicht nur beim sturen Abspielen von
verschiedenen Formaten, sondern es gibt noch eine ganze Reihe weiterer
Features, die den Song Player &#228;u&#223;erst interessant machen. Interesse
bekommen? Dann ist dieser Test genau richtig !</P>

<h2><CENTER><FONT COLOR="GREEN">Die Features und Anforderungen im &#220;berblick
</FONT></CENTER></h2></P>
Soundabspieler gibt es im Aminet gen&#252;gend, womit die Frage aufkommt, was
denn am Songplayer so besonders ist. Hier eine kleine Auflistung der
wichtigsten Features:</P><ul>

<li>Karaoke Modus<BR>
<li>Playlisten <BR>
<li>Pseudo-Stereo Effekte f&#252;r Mono Sounds<br>
<li>Verschiedene Spektrometer<br>
<li>ARexx Unterst&#252;tzung<br>
<li>Treble &amp; Bass Regler<br>
<li>Audio Datenbank<br>
<li>Alle g&#228;ngigen Formate (inkl. MPEG Layer 1-3) werden unterst&#252;tzt<br>
<li>Komprimierte XPK Files werden gelesen<br>
<li>AHI Unterst&#252;tzung<br>
<li>MUI basierend</P></UL>

Das ganze macht nat&#252;rlich noch kein gutes Program aus, aber auch die
Umsetzung der Features wei&#223; auf jeden Fall zu &#252;berzeugen. Nat&#252;rlich kann man
jetzt &#252;ber den Sinn einer Karaoke Funktion diskutieren, aber wer sie nicht
braucht, kann diese ja ausschalten.</P>

Diese ganzen Features ben&#246;tigen nat&#252;rlich auch einiges an Rechenpower:
Ein Amiga mit mindestens OS 3.0, einem 68020, MUI 3.3 und der mpega.library (für MPEG Dateien)
muss vorhanden sein, denn ansonsten l&#228;uft gar nix. Das man damit nat&#252;rlich
nicht vern&#252;nftig zu arbeiten ist, d&#252;rfte auf der Hand liegen. Deshalb sei
eine ordentliche Portition Fast Ram sowie eine schnellere CPU dringenst
empfohlen; eine Festplatte muss nat&#252;rlich auch vorhanden sein.</P>

<h2><CENTER><FONT COLOR="WHITE">Song Player in der Praxis -
Wow!</FONT></h2></CENTER></P>
Nach der gegl&#252;ckten Installation via Commdore Installer, kann man gleich
loslegen. Zu allererst sollte man das Program aber an seine eigene
Konfiguration bzw. seine pers&#246;nlichen Vorlieben anpassen. Neben einigen
Indikatore, die wahlweise an-oder abgestellt werden k&#246;nnen, sollte vor allem
die Qualit&#228;t f&#252;r alle Sounds &#252;ber AHI eingestellt werden. Auch MPEG Dateien
sollten sinnvoll an das eigene System angepasst werden: Es bringt beileibe
nichts, wenn man eine MP3 Datei in voller Qualit&#228;t h&#246;ren will, aber nur
einen 030er unter der Haube hat - hier sollte man den bestm&#246;glichen
Kompromiss zwischen Qualit&#228;t und Wartezeit finden.</P>

Nun kann es endlich losgehen und es kann wahlweise eine Audio Datei in allen
g&#228;ngigen Formaten (z.B. IFF, Wave etc.) oder auch ein CDDA Track (&quot;normaler&quot;
CD Track von einer herk&#246;mlichen CD) geladen werden, die Song Player dann
&#252;ber die angeschlossenen Boxen ausgibt. Nat&#252;rlich kann man noch diverse
Ver&#228;nderungen vornehmen: Sei es nun Bass &amp; Treble, eine andere Balance oder
auch einfach nur die Lautst&#228;rke - alles l&#228;&#223;t sich beim abspielen frei
konfigurieren &amp; ver&#228;ndern.
Pro Forma sei noch erw&#228;hnt, da&#223; dem User nat&#252;rlich auch der &quot;&#252;bliche&quot; CD
Player Komfort zur Verf&#252;gung steht. Wer also eine eigene Reihenfolge an
Tracks programmieren m&#246;chte oder Songs per Zufallsgenerator ausw&#228;hlen lassen
m&#246;chte kann dies nat&#252;rlich auch per Song Player machen.</P>

Besonders interessant fand ich die Karaoke Funktion, auch wenn diese in der
vorliegenden Version 1.53 noch nicht komplett ausgereift war. Die Karaoke
Funktion beschr&#228;nkte sich vielmehr darauf, den vorher eingegeben Text zum
richtig eingestellten Zeitpunkt in einem Fenster abzuspielen. Das Einstellen
der Zeit ist &#252;brigens denkbar einfach: Nur den Text in Song Player
reinladen, den Song abspielen und nach jeder Reihe einfach nur klicken; die
richtige Zeit berechnet der Song Player dann automatisch. Das Unterdr&#252;cken
der Vocals klappte auch ganz gut, auch wenn diese nicht zu 100 %
rausgefiltert
werden konnten. </P>

Auch die MP2 &amp; 3 Unterst&#252;tzung ist sehr gut umgesetzt worden. Dank der
mpega.library (die von allen MP Abspielern auf dem Amiga genutzt wird)
erreicht der Song Player sehr gute Geschwindigkeits- und Qualit&#228;tsergebnisse
; zumindest auf etwas besser aufger&#252;steten Amigas (was aber bei MPEG Dateien
wohl selbstverst&#228;ndlich ist). Viele User brauchen somit nicht mehr auf
seperate Programme wie AmigaAMP oder Amplifier zur&#252;ckzugreifen.</P>

Da der Song Player in MUI geschrieben ist, kann man das Program
praktischerweise auch iconifizieren und beim abspielen in perfekter
"Multitasking Manier" weiter arbeiten. Da das ganze nur bei MPEG Dateien
(die einiges an Rechnepower brauchen, um kodiert zu werden) etwas schwierig,
wenn auch möglich, ist, kann der Song Player auch all denen empfohlen
werden, die keinen CD Player neben dem Computer stehen haben, aber dennoch
Audio CD`s hören wollen. Zumindest bei meinern Konfiguration klappt das
ganze ohne Probleme.</P> 

<CENTER>
<img src="sp1.png"></CENTER></P> 

<h2><CENTER><FONT COLOR="RED">Gibt`s auch was zu
meckern?</FONT></h2></CENTER></P>
Na ja, lediglich Kleinigkeiten m&#252;ssten beim Song Player noch ver&#228;ndert
werden. Zum einen w&#228;re da sicherlich die &#228;u&#223;erst d&#252;nne Amiga Guide
Anleitung, die nur &#228;u&#223;erst knapp auf die Funktionen eingeht. Auch wenn der
Song Player sehr intuitiv aufgebaut ist, sollte die beiliegende Guide Datei
doch zumindest auf die wichtigsten Features etwas genauer eingehen. Auch die Oberfl&#228;che
ist, trotz der Verwendung von MUI, nicht der sch&#246;nsten einer (wie man
sicherlich auch den Screenshots entnehmen kann). F&#252;r die Zukunft sollte man
mal &#252;ber die Verwendung von &quot;Skins&quot; oder alternativen Buttons nachdenken...</P><CENTER>
<img src="sp2.png"></CENTER></P>
<h2><CENTER><FONT COLOR="BLUE">Money, Money,
Money....</FONT></H2></CENTER></P>
Der Song Player selber ist &quot;Giftware&quot;, was bedeutet, da&#223; man dem
franz&#246;sischen Programmierer etwas schenken sollte, wenn einem das Programm
gef&#228;llt. Was das sein soll, &#252;berl&#228;sst der Autor ganz der Kreativit&#228;t des
Benutzers - aber Geld wird sicherlich immer gerne angenommen :-)))
Song Player ist in keinster Weise eingeschr&#228;nkt und kann deshalb vor der
Registration auf Herz &amp; Nieren gepr&#252;ft werden; zu bekommen ist Song Player
nat&#252;rlich im Aminet sowie auf diversen weiteren CD`s (Amiga Future CD,
AmigaOS CD etc.).</P>

<h2><CENTER><FONT COLOR="GRAY">Future</FONT></CENTER></h2></P>
An dieser Stelle noch schnell die in der Guide aufgef&#252;hrten Pl&#228;ne f&#252;r die
Zukunft:</P><ul>

<li>Unterst&#252;tzung anderer Formate<br>
<li>PPC Unterst&#252;tzung (?)<br>
<li>Mehr Audio Effekte<br>
<li>Echte Karaoke Funktion mit Unterdr&#252;ckung der Stimme (ist schon
implementiert)</P></UL>


<CENTER><B><U><h2>Fazit:</h2></U></B></CENTER></P>
Song Player ist ein hervorragender Sound Abspieler f&#252;r viele Soundformate.
Durch viele Zusatzfeatures l&#228;&#223;t der Song Player seine Konkurrenz teilweise
sehr weit hinter sich und ist damit der ideale Sound Abspieler f&#252;r alle
User, die ein Programm f&#252;r alle Soundformate (inkl. Audio CD) haben wollen,
das entsprechend ausgereift ist. All diesen Usern kann Song Player
bedingungslos empfohlen werden - wer jetzt noch Zweifel hat, der soll selber
im Aminet die aktuelle Version runterladen und sich selbst ein Urteil
bilden.</P> 



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
