<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Page Design</title>
</head>
<body background="wolf1.gif" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#800000" size="7">
<b>Page Design</font></b></p>
<table width=100% border=0><tr><td>
<p>Auch dieser Workshop verdient eine Fortsetzung und heute werden wir uns
detaillierter mit eingebundenen Grafiken befassen. Beginnen wir mit der
Ausgewogenheit der Seiten.</p>

<p>Bei der Gestaltung von Web-Seiten geht es haupts&auml;chlich darum abzuw&auml;gen,
wie sich ihr Aufbau mit Hilfe von Grafiken und beweglichen Bildern im
Verh&auml;ltnis zur Leistungsf&auml;higkeit der unterschiedlichen
Verbindungen verh&auml;lt. Manche Homepages oder Men&uuml;seiten
&auml;hneln in ihrer Funktion eher den Umschlagseiten eines Buches oder eines
Magazins. Es geht jedoch vielmehr darum, den Leser mit einer Kombination
von beschreibendem Text und interessanten Grafiken, die auf die Themen
Bezug nehmen, in die Seiten hineinzuziehen.</p>

<p>Das effizienteste Design f&uuml;r den herk&ouml;mmlichen Internet-Benutzer, der
sich &uuml;ber Modem in das Netz einw&auml;hlt, besteht aus einem sorgf&auml;ltigen Text-
und Link-Layout mit relativ wenigen kleinen Grafiken. Solche Seiten lassen
sich rasch laden, selbst wenn der Zugriff mit einem 28.8 kbps-Modem &uuml;ber
SLIP- oder PPP-Leitungen erfolgt. Trotzdem k&ouml;nnen sie eine gute grafische
Wirkung haben.</p>

<p><img src="work_pgds4.gif" alt="Bildschirmausschnitt einer Webseite"
align=left width="210" height="240" border="0" hspace=10>
Der Bildschirm ist kleiner als eine gedruckte Seite, kleiner als B&uuml;cher
oder Magazine. Dieses Wissen muss unbedingt im Vordergrund stehen. Weiter
soll nicht vergessen werden, dass eine Untersuchung ergeben hat, dass nur 10%
der Websurfer die Seiten weiterscrollen. Ein sehr h&auml;ufiger Fehler in der
Seitengestaltung besteht darin, die Breite der Seitengrafik &uuml;ber den
Bereich hinaus auszudehnen, den die meisten Benutzer auf ihren 14 oder 15
Zoll-Bildschirmen sehen k&ouml;nnen. Grafiken sollten nicht mehr als 535 Pixel
breit und 320 Pixel hoch sein. Selbst wenn in der Regel gro&szlig;e Bildschirme
benutzt werden, weist das typische Browser-Fenster eine normierte
Fenstergr&ouml;&szlig;e auf, die auf kleinere Monitore abgestimmt ist. </p>

<p>
Im letzten Workshop bin ich schon einmal auf die Abmessungen eingegangen
und habe ein Gitternetz als Arbeits-Background beigelegt. Hier also nochmals
die Ma&szlig;e, die gepflegentlich eingehalten werden sollten.
<br><center><img src="work_pgds5.gif" alt="Gr&ouml;&szlig;e einer Webseite"
width="350" height="264" border="0"> </center></p>

<p>Das derzeitige Hypertext Markup Language (HTML) bietet nicht die
Flexibilit&auml;t und die Kontrollm&ouml;glichkeit, die im Allgemeinen von
Seitenlayout-Software oder von konventionellen Multimedia-Werkzeugen
herk&ouml;mmlicherweise erwartet wird. Trotzdem kann die HTML-Sprache bei
sorgf&auml;ltiger Anwendung dazu benutzt werden, komplexe und gleichzeitig hoch
funktionelle Informationssysteme zu erstellen. Bei unsachgem&auml;&szlig;er oder
inkonsequenter Verwendung jedoch k&ouml;nnen die typografischen Steuerungen und
Inline-Grafiken der World Wide Web-Seiten zu einem zersplitterten,
verworrenen Chaos f&uuml;hren, dem jede erkennbare Hierarchie fehlt. Dieser
ungl&uuml;ckliche Patchwork-Effekt eines unzusammenh&auml;ngenden WirrWarrs von
Grafiken und Text f&uuml;hrt zu einer verschlechterten Nutzbarkeit und
Lesbarkeit wie es auch bei gedruckten Dokumenten zu beobachten ist. Ein
sorgf&auml;ltig aufgebautes Design-Gitternetz, das &uuml;ber eine Gruppe von Seiten
hinweg konsequent implementiert wird, hilft den Benutzern, die gew&uuml;nschten
Informationen schnell aufzufinden und st&auml;rkt gleichzeitig die Annahme, eine
mit Bedacht organisierte Sammlung von Informationen vor sich zu haben:<br>
<center><img src="work_pgds6.gif" alt="Gr&ouml;&szlig;e einer Webseite"
width="365" height="337" border="0"> </center></p>

<p>Da gerade erst &uuml;ber Farben auf dem Computer Beitr&auml;ge erschienen waren,
m&ouml;chte ich an dieser Stelle nur noch ein paar Worte &uuml;ber die Grafikformate
verlieren. In der Praxis bevorzugt ein Gro&szlig;teil der User f&uuml;r die
meisten Elemente der Seitengestaltung das GIF-Format, wenn schwarze Striche
und scharfe Kanten gefordert sind. Das JPEG-Format wird haupts&auml;chlich
f&uuml;r Fotos, komplexe fotorealistische Illustrationen usw. verwendet,
bei denen die Kompressionswerkzeuge des JPEG-Prozesses die
Bildqualit&auml;t nicht zu stark beeintr&auml;chtigen.
<br><center>GIF: <img src="work_pgds7.gif" alt="Beispiel f&uuml;r GIF"
width="365" height="52" border="0">
<br><br>JPG: <img src="work_pgds8.gif" alt="Beispiel f&uuml;r JPEG"
width="365" height="52" border="0"> </center></p>

<p>Welche Art des GIF-Formates genommen wird, spielt heute fast keine
Rolle.
Die konventionelle GIF-Grafik l&auml;dt sich Pixel f&uuml;r Pixel.
Die Browser zeigen den schrittweisen Aufbau jeder Zeile des
Bildes auf dem Bildschirm an. Bei Interlaced GIF-Dateien werden die
Bilddaten in einem Format gespeichert, die es den
Interlaced GIFs unterst&uuml;tzenden Browsern erm&ouml;glichen, mit dem
Aufbau einer niedrig aufl&ouml;senden Version des Original-GIF-Bildes auf
dem Bildschirm zu beginnen, w&auml;hrend die Datei noch &uuml;bertragen
wird. Dieser Animationseffekt vom verschwommenen zum scharfen Bild einer
Interlaced GIF-Datei ist optisch sehr ansprechend. Der wichtigste Vorteil
dieses Ineinandergreifens besteht jedoch darin, dass es 
einen schnellen Vorausblick auf den vollen Bildbereich erm&ouml;glicht.
Dieser Ansichtseffekt kann allerdings irref&uuml;hrend sein. Interlaced
GIFs laden sich <B>nicht</B> schneller als herk&ouml;mmliche GIFs. Man hat
nur diesen Eindruck, weil das verschwommene Vorabbild schnell zu sehen
ist.<br>
<center><img src="work_pgds9.gif" alt="Interlaced GIF"
width="365" height="200" border="0"> </center></p>

<p>F&uuml;r dieses Mal sollen meine Ausf&uuml;hrungen mal wieder reichen. Sollten
Fragen auftauchen, meine Anschrift steht unten im Kasten.
</td></tr></table>

<hr size=4>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
<br><br>Bilder und manche Textpassagen sind dem YALE-Web-Style-Guide der Autoren
Patrick Lynch und Sarah Horton entnommen.
</font>
<br>
</td></tr></table>
<br>
        
</body>
</html>
