<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, shadow gallery,legacy">
<title>Shadow Gallery: Legacy</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Shadow Gallery: Legacy</font></h1><BR> (71:57 / Roadrunner)</center></P>

<p>F&#252;r Progressive Metal Fans sind sie wahrscheinlich einer der unterbewertetsten Bands &#252;berhaupt, haben es Shadow Gallery mit ihrer absolut perfekten Mixtur aus neueren Savatage, alten Queen und Dream Theater trotz drei bisher ver&#246;ffentlichter excellenter Alben nicht geschafft, gr&#246;&#223;ere Anerkennung in Form einer Tour oder passabler Abs&#228;tze der bisherigen Longplayer zu bekommen. So blieb es nach dem letzten Geniestreich &quot;Tyranny&quot; erstmal wieder drei Jahre lang ruhig um die Amerikaner und im Jahre 2001 sind Shadow Gallery aus dem nichts wieder mit einem neuen &#220;beralbum da, welches es -soviel muss man einfach schon an dieser Stelle loswerden - qualitativ mit allen bisher erschienen Shadow Gallery Alben locker aufnehmen kann. Etwas anderes h&#228;tten die Fans wohl auch nicht erwartet. Den Anfang auf &quot;Legacy&quot; macht ein St&#252;ck namens &quot;Cliffhanger 2&quot;, welches nat&#252;rlich der Nachfolger des &quot;Carved In Stone&quot; (1995) Klassikers ist und die Trademarks der Band - also m&#228;chtiger Refrain, noch m&#228;chtigerer Ch&#246;re und brillianter Umgang mit den Instrumenten - perfekt in sich vereint. Auch die anderen St&#252;cke wie das abwechselungsreiche, mit Fl&#246;ten versehen &quot;Destination Unknown&quot;, das entspannende &quot;Colors&quot; sowie die beiden G&#246;ttergaben &quot;Society Of The Mind&quot; und &quot;Legacy&quot;, die auch aus dem Fundus von Dream Theater stammen k&#246;nnten, wissen zu begeistern. Tja, und dann ist da nur noch der sechste und zugleich letzte Song namens &quot;First Light&quot;, auf dem die Band in knapp 35 Minuten (!!) s&#228;mtliche Register zieht und den verdutzen H&#246;rer auf eine Reise durch eine akustische Traumwelt mitnimmt, die man in Worten gar nicht ausdr&#252;cken kann. Also nochmal langsam und zum mitschreiben: &quot;Legacy&quot; ist ein absoluter Killer im wahrsten Sinne des Wortes und geh&#246;rt einfach in jede halbwegs gut sortierte Metal / Prog. Sammlung. Wer Bands wie Dream Theater &amp; Savatage verehrt, der wird vor Shadow Gallery auf die Knie fallen und wei&#223; vor Begeisterrung gar nicht mehr, wo er sich gerade befindet. Nur leider sehr schade, da&#223; Shadow Gallery wohl auch mit &quot;Legacy&quot; nicht den breiten Geschmack treffen werden und ihnen die l&#228;ngst verdiente Anerkennung wohl erneut verwehrt bleibt. Das ist halt der Preis f&#252;r aussergew&#246;hnliche Kunst...</P>

<p>Fazit: 10 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd3.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
