<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,wisdom call">
<title>Wisdom Call: Wisdom Call</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Wisdom Call: Wisdom Call</font></h1><BR> (46:28 / Massacre)</center></P>

<p>Tja, was Bandname und Albumcover schon unschwer vermuten lassen, wird schon nach dem anspielen des Openers &quot;Power From The Sky&quot; deutlich: Wisdom Call haben sich - wie schon viele vor ihnen - dem klassischen melodsichem Power Metal verschrieben und legen nun ihr Debutalbum vor. Es handelt sich aber mitnichten um eine v&#246;llig unbekannte Gruppe, ist S&#228;nger und treibende Kraft hinter Wisdom Call Christian Liljegren doch hauptberuflich bei Narnia t&#228;tig und hat seinen Narnia Kumpel Anders Johnasson (Drums) gleich auch noch f&#252;r Wisdom Call mit eingespannt. Desweiteren sind auch noch die beiden Stormwind Members Andreas Olsson (Bass) und Per Hallmann (Keyboards) zu h&#246;ren - alles eindeutig hochkar&#228;tige Musiker, die in ihren Stammbands immer hohe Qualit&#228;t abgeliefert haben. Bei Wisdom Call sieht die Sache da schon anders aus, wirken die 10 Songs doch recht blutleer und wenig spannend und wollen selbst nach dem x-ten Durchlauf keinen bleibenden Eindruck im Geh&#246;rgang hinterlassen. Handwerklich ist zwar alles im gr&#252;nen Bereich und Songs wie der Opener &quot;Power From Tke Sky&quot; oder das halbwegs eing&#228;ngige &quot;15 Years&quot; sind auch gar nichtmal so &#252;bel, aber das restliche Material ist bestenfalls fader Durchschnitt und erweckt den Eindruck, da&#223; hier Material, welches f&#252;r Narnia zu heavy oder zu schwach war, ohne R&#252;cksicht auf Verluste verbraten wurde. Trauriger H&#246;hepunkt dieser Scheibe ist die &#228;u&#223;erst schwache Coverversion des Europe Klassikers &quot;Wings Of Tomorrow&quot;, an der man sich besser erst gar nicht vergriffen h&#228;tte. Somit pl&#228;tschert die ganze Scheibe eine geschlagene dreiviertel Stunde durch die Botanik ohne auch nur ansatzweise Charisma zu verspr&#252;hen. Ich w&#228;re nicht nur den Herren von Wisdom Call dankbar, wenn man solche &#252;berfl&#252;ssigen Sideprojekte besser sofort wieder ad acta legen w&#252;rde und sich stattdessen wieder ganz auf seine Hauptbads konzentrieren w&#252;rde - das ist nicht nur besser f&#252;r den Musiker und die der Hauptbands (wohin tausende von Soloprojekten und Sideprojekten f&#252;hren, haben wir eindrucksvoll an den letzten beiden Helloween Alben gemerkt!), sondern auch f&#252;r die Fans, die bei der massiven &#220;berflutung des Marktes mit CD`s gar nicht mehr wissen, was sie noch kaufen
sollen. Wisdom Call werden also hoffentlich schnell wieder Geschichte sein!</P>

<p>Fazit: 3.5 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd5.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
