<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Neues von AMIGA</H1>
<H2>1. Erkl&auml;rung von AMIGA-Pr&auml;sident Tom Schmidt zum R&uuml;cktritt von Jim Collas</H2>
<P>
&raquo;Liebe Amiganer,
</P>
<P>
ich wollte sicherstellen, da&szlig; jeder wei&szlig;, da&szlig; Jim Collas sich entschieden
hat, Amiga zu verlassen um anderen Interessen und M&ouml;glichkeiten
nachzugehen. Ich m&ouml;chte Jim pers&ouml;nlich f&uuml;r die Leitung und f&uuml;r die
Perspektive danken, die er Amiga und der gesamten Amiga-Gemeinschaft
w&auml;hrend der letzten acht Monate gegeben hat. Wir w&uuml;nschen ihm viel Gl&uuml;ck in
seinen neuen Bestrebungen.
</P>
<P>
Seit April diesen Jahres arbeite ich als Chief Operating Officer bei Amiga
und ich bin nach wie vor begeistert von den Pl&auml;nen und Strategien, an denen
wir in den vergangenen Monaten sehr hart gearbeitet haben. Diese Pl&auml;ne
werden unter der Leitung eines gro&szlig;artigen Gesch&auml;fts- und Technikteams
fortgesetzt, mit Konzentration auf den sich entwickelnden Markt der
Internet-Ger&auml;te. Sobald wir unsere Planungen in diesem Bereich
abgeschlossen haben, werden wir diese der Gemeinschaft mitteilen.
</P>
<P>
Weiterhin m&ouml;chte ich Bill McEwen f&uuml;r seine vielen Beitr&auml;ge f&uuml;r die
Amiga-Gemeinschaft danken und ich w&uuml;nsche ihm viel Gl&uuml;ck in seinen weiteren
Bestrebungen. Bill war eine best&auml;ndige und beruhigende Stimme f&uuml;r die
Gemeinschaft.
</P>
<P>
Gr&uuml;&szlig;e,
</P>
<P>
Thomas J. Schmidt<BR>
Pr&auml;sident&laquo;<BR>
</P>
<P>
(Quelle: AMIGA)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
