<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA1.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA3.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Erster offener Brief von AMIGA-Pr&auml;sident Tom Schmidt an die Anwender</H2>
<P>
&raquo;EXECUTIVE UPDATE<BR>
 ----------------<BR>
14.09.1999<BR>
</P>
<P>
AN: DIE AMIGA GEMEINSCHAFT
</P>
<P>
Danke f&uuml;r Eure Anmerkungen und Kommentare zu unseren Pl&auml;nen f&uuml;r Amiga. In
den letzten paar Wochen haben wir hunderte -- wenn nicht tausende -- von
eMails und Nachrichten von loyalen Amigianern weltweit erhalten, wobei
viele von Euch Sorgen &uuml;ber die Zukunft des Amiga ausdr&uuml;ckten, basierend auf
k&uuml;rzlich erschienenen Mitteilungen in den Medien und vielz&auml;hligen
Chat-Rooms. Ich bin so beeindruckt vom Geist und der Hingabe dieser
gro&szlig;artigen Gemeinschaft, und ich wollte sichergehen, Euch das mitzuteilen.
</P>
<P>
Die Fakten sind... um Mark Twain zu zitieren... die Nachrichten vom Tod des
Amiga sind stark &uuml;bertrieben. In dieser Hinsicht m&ouml;chte ich etwas mehr
Details &uuml;ber unsere Pl&auml;ne f&uuml;r Amiga mitteilen... sowohl als Produkt, als
auch als Firma; und dabei hoffenlich jede existierende Verwirrung zu
kl&auml;ren.
</P>
<P>
Zun&auml;chst hoffe ich, da&szlig; Ihr mir zustimmt, da&szlig; es beim Amiga nie um eine Box
ging. Es ging auch nie um ein Betriebssystem. Sicher waren dies Teile
dessen, was den originalen Amiga gro&szlig;artig gemacht hat, aber im Herzen ging
es beim Amiga einfach um einen besseren Weg. Amiga war seiner Zeit voraus.
Amiga versprach, die Welt zu &auml;ndern. Es lief konventionellem Wissen
zuwieder, und war besser als alles, was es damals dort drau&szlig;en gab.
Tats&auml;chlich k&ouml;nnten wir alle argumentieren, da&szlig; es immer noch besser als
alles andere dort drau&szlig;en ist.
</P>
<P>
Die Ideale und der Geist dieses originalen Amiga sind heute lebendig. Aber
Amiga nur auf eine Box, ein Produkt, ein OS zu beschr&auml;nken, bedeutet, den
Amiga davon abzuhalten, jemals sein volles Potential zu erreichen. Denkt
dar&uuml;ber nach... der originale Amiga hat sein volles Potential niemals
erreicht, trotz seiner technischen Vorteile, und der Vorteile der Kosten
und der einfachen Bedienbarkeit. Warum? Weil er niemals allgegenw&auml;rtig
wurde. Die fr&uuml;he Vision der Firma war vielleicht zu beschr&auml;nkt f&uuml;r das
gewaltige Potential, das der Amiga bot.
</P>
<P>
Beim originalen Amiga ging es um Multimedia, also warum Amiga nicht auf
jedem vorstellbaren Ger&auml;t laufen lassen, auf jedem OS, das es gibt? Das ist
das sch&ouml;ne an Amiga, und wo wir als Industrie stehen. Wir sind mitten in
einer Revolution anders als alles, was die Welt gesehen hat, und Amiga war
nie in einer besseren Position, die Welt zu &auml;ndern und einen gr&ouml;&szlig;eren
Einschlag zu haben. Amiga an diesem Punkt auf nur eine Box und ein OS zu
beschr&auml;nken, w&auml;re wie der Welt ein besseres Pferd samt Fuhrwerk zu bieten,
zu Beginn des automobilen Zeitalters. Amiga und sein revolution&auml;rer Geist
verdienen besseres als das. Amiga wird Software-Technologie herstellen, die
Internet-Dienste auf einer im Entstehen begriffenen Kategorie von Produkten
erm&ouml;glichen wird, die im allgemeinen als &quot;Information Appliances&quot;
bezeichnet werden. Es ist ein aufregender neuer Mega-Trend in der
Industrie, und wir sind begeistert, an vorderster Front dieser n&auml;chsten
gro&szlig;en Welle in der Computergeschichte zu stehen. Zus&auml;tzlich haben wir
entschieden, mit Gesch&auml;ftspartnern zusammenzuarbeiten, die unsere
Software-Technologie auf ihren Systemen ausliefern werden, statt selbst
direkt in das Hardware-Gesch&auml;ft einzusteigen.
</P>
<P>
Also: Lang lebe Amiga, aber wenn Ihr denkt, der Amiga sei nur eine Box,
habt ihr es nicht verstanden. Bei Amiga geht es um einen besseren Weg. In
den kommenden Wochen und Monaten, versprochen, werden wir Euch &uuml;ber
Fortschritte unserer Pl&auml;ne f&uuml;r Amiga auf dem Laufenden halten, und wir
danken Euch f&uuml;r Eure fortgesetzte Unterst&uuml;tzung. La&szlig;t uns zusammenarbeiten,
um Amiga in die Lage zu versetzen, die Industrie zu revolutionieren und die
Welt zu ver&auml;ndern!
</P>
<P>
Lang lebe Amiga,
</P>
<P>
Thomas J. Schmidt<BR>
President &amp; C.E.O.<BR>
</P>
<P>
Vielen Dank an Martin Baute (<A HREF="mailto:solar@baud.de">solar@baud.de</A>) / Amiga News
(<A HREF="http://www.amiga-news.de" TARGET="_TOP">http://www.amiga-news.de</A>) f&uuml;r die &Uuml;bersetzung.&laquo;
</P>
<P>
(Quelle: AMIGA)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA1.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA3.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
