<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Forum</H1>
<P>
In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot;
zusammengefasst.
</P>
<P>
Wenn Ihr einen Beitrag habt, schreibt bitte an:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Carsten Schr&ouml;der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Helmoltstra&szlig;e 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">37081 G&ouml;ttingen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
E-Mail: <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>
</P>
<H2>1. Leserbrief zur Vorbestellungsaktion FusionPPC (von Andreas Volkmann)</H2>
<P>
&raquo;Ich hatte mich damals auch auf der Liste f&uuml;r FusionPPC eingetragen, es
hie&szlig; ja zu dem Zeitpunkt, dass erst in einem anderem Stadium eine
Vorauszahlung zu leisten w&auml;re und dass der Eintrag in der Liste noch nicht
dazu verpflichtete. Aber trotzdem bin ich von der Vorgehensweise von
Microcode Solutions entt&auml;uscht. Ich will es mal so sagen, dass ich es nicht
einsehe, irgentwo eine Vorauszahlung zu leisten, wo dann derjenige mit
meinem Geld arbeiten kann, evt. noch Zinsen kassiert und dann, wenn alles
schlecht l&auml;uft, erz&auml;hlt, das ganze Projekt wird nichts. Ich w&uuml;rde zwar das
Geld zur&uuml;ckbekommen, h&auml;tte nichts verloren, aber das ist ein anders Thema.
Selbst beim Solidarit&auml;tsbeitrag verfuhr ich so.
</P>
<P>
Ich w&uuml;rde sofort einen Kaufvertrag unterschreiben, wo ich best&auml;tige, dass
ich den Artikel kaufe, wenn er lieferbar ist und per Nachnahme bezahle,
selbst wo ich im Moment noch nicht in Besitz einer PPC-Karte bin. Es wird
dann wahrscheinlich immer ein paar schwarze Schafe darunter geben, die ihre
Verpflichtungen nicht einhalten, aber das mu&szlig; man halt riskieren.
Desweiteren kann man zwar im Netz per Karte bezahlen, aber so wie ich das
gesehen habe, wird noch nicht mal darauf hingewiesen, wie es l&auml;uft, wenn
man keine Kreditkarte besitzt. Es kann nat&uuml;rlich auch sein, dass ich das
&uuml;bersehen habe, weil meine Englischkenntnisse doch nicht ganz so gut sind.
Wenn man das ganze jetzt mal von einer anderen Seite sieht, ist das im
Grunde doch nur eine Sache der Taktik. Das Programm mu&szlig; doch eigentlich
fertig sein, da die eigentlichen Betatester ja ihr okay f&uuml;r den Verkauf
gegeben haben m&uuml;&szlig;ten. Der Hersteller hat doch im Grunde soviel Arbeit da
reingesteckt, dass er auf den Verlust auch nicht verzichten will, den es
mit sich bringt, wenn das Programm nicht ausgeliefert wird.
</P>
<P>
Und wenn es gar nicht anders geht, wen hindert es daran, sich LinuxPPC zu
installieren, und dann die PowerMac-Emulation laufen zu lassen, Verlierer
ist eigentlich bei diesem Katz- und Mausspiel der Hersteller. Wobei man
dann im Nachhinein sagen wird, wieder jemand von dem kleinen Amiga-Markt
verschwunden.
</P>
<P>
Aber hat der User dann wirklich Schuld?
Man k&ouml;nnte zwar wieder argumentieren, dass man bei dem PPC-Modul von Fusion
im normalem AmigaOS arbeiten kann und nicht unbedingt ein neues
Betriebssystem auf dem Rechner installieren mu&szlig;, aber wenn ich den PowerMac
zum arbeiten haben und nicht extra einen zweiten Rechner kaufen will, w&auml;re
mir das egal.
</P>
<P>
So, jetzt hab ich mir doch erst mal ordentlich Luft gemacht, aber ich bin
der Meinung, das mu&szlig;te doch erst mal raus.
</P>
<P>
Fazit: Ich stehe immer noch bei meiner Entscheidung, ich kaufe das
FusionPPC-Modul per Rechnung oder per Nachnahme, sobald es lieferbar ist,
nicht vorher. Selbst jetzt, wo ich immer noch auf das Erscheinen der neuen
PPC-Karten und der dazugeh&ouml;rigen SCSI-Controller warte.
</P>
<P>
Andreas Volkmann &lt;<A HREF="mailto:Andreas@flynet.de">Andreas@flynet.de</A>&gt;&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Forum.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
