<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
Am aktuellen Gewinnspiel haben sich 59 Leser beteiligt, damit ist die Zahl
etwas geringer als im Vormonat. Bitte denkt auch diesmal wieder an die
Teilnahme.
</P>
<P>
Nun noch eine Information: Allm&auml;hlich gehen mir die Preise f&uuml;r das AMIGA-
aktuell-Gewinnspiel aus. Wer also einen Preis zur Verf&uuml;gung stellen m&ouml;chte
bzw. jemanden kennt, der dazu bereit ist, sollte sich bei mir melden.
Danke!
</P>
<P>
Jetzt aber zur Aufl&ouml;sung:
</P>
<P>
Standard-Frage: Wie hei&szlig;t der neue Pr&auml;sident von AMIGA?
</P>
<P>
Antwort: Die richtige Antwort lautet nat&uuml;rlich 'Tom Schmidt'.
</P>
<P>
Master-Frage: Worum handelt es sich bei der 'Bluetooth'-Technologie?
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Es handelt sich dabei um einen Standard f&uuml;r drahtlose&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Kommunikation zwischen Mobilger&auml;ten sowie zwischen mobilen und&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">station&auml;ren Ger&auml;ten. N&auml;here Informationen dazu sind in den Technik&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&amp; Net NEWS der vorigen AMIGA-aktuell-Ausgabe enthalten.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Selbstverst&auml;ndlich wurden auch alle anderen Formulierungen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">akzeptiert, die in die richtige Richtung gingen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Meinungsfrage: Wie bewertest du den j&uuml;ngsten Wechsel an der AMIGA-Spitze?
</P>
<P>
Die Auswertung:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">1 (Finde ich sehr gut.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">0&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Finde ich eher gut.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">0&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3 (Finde ich eher schlecht.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">26&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">4 (Finde ich sehr schlecht.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">30&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Zwei Teilnehmer haben die Meinungsfrage nicht beantwortet, ein weiterer
konnte sich nicht zwischen Antwort 2 und 3 entscheiden
</P>
<P>
Einige Einsender haben zu ihrer Beantwortung der Meinungsfrage Stellung
genommen:
</P>
<P>
Timo Bu&szlig;haus merkt an: &raquo;Da man ja noch keine genauen Gr&uuml;nde kennt, warum
sich Jim Collas so entschieden hat, kann ich mir noch keine feste Meinung
bilden, aber ein F&uuml;hrungswechsel in einer solch kritischen Situation kurz
vor Ver&ouml;ffentlichung eines neuen Rechners kann ich nicht positiv finden.&laquo;
</P>
<P>
Mark Buonfrate schreibt: &raquo;Nachdem sich die Amiga-Gemeinde nun halbwegs
damit abgefunden hat, dass sich das Amiga-Hauptlager f&uuml;r den Linux-Kernel
entschieden hat, was anfangs doch sehr ersch&uuml;tternd war, hat Collas es doch
nochmal geschafft, mit seinen Pl&auml;nen durch intensive Aufkl&auml;rung (st&auml;ndige
Statements, etc.) wieder Vertrauen zu gewinnen. Demnach ist es in meinen
Augen nicht gerade ein  Schritt nach vorne, dass es zu einem Wechsel
gekommen ist. Mit Collas hat Amiga einen guten Mann verloren.&laquo;
</P>
<P>
Gunnar Edel ist folgender Auffassung: &raquo;Die ganze Amiga-Geschichte kommt mir
etwas seltsam vor. QNX schraubt an einem OS f&uuml;r NG-Amigas, aber es
existieren keine offiziellen HW-Daten. Wie kann ich &uuml;ber Monate an einem
Betriebssystem rumentwickeln, wenn noch keinerlei HW-Spezifikationen
existieren? Da mu&szlig; es etwas gegeben haben!
Dann kommt ein LINUX-Hype -&gt; prompt wird auf Linux aufgesprungen.
Transmeta, von AI ger&uuml;chteweise als Prozzylieferant kolportiert, sagt,
sie h&auml;tten nie mit AI in irgendwelchen Gesch&auml;ftsbeziehungen
gestanden.....(andere auch).
</P>
<P>
Kaum kommt die Ank&uuml;ndigung von Kleinweich, da&szlig; sie eine Spielekonsole
entwickeln wollen, sagt Gateway: Ja, wir sind dabei! - und killen die
Amigapl&auml;ne sowie Collas. Nun hat aber MS gesagt, da&szlig; sie nicht mit Gateway
zusammenarbeiten. Kommt nun die n&auml;chste Kehrtwende?
Mit Collas und anderen sind Leute mit Visionen gegangen worden. Der f&auml;hige
Rest wird bald von selbst verschwinden.
</P>
<P>
Bleibt zu hoffen, da&szlig; sich ein Firmenkonsortium findet, das einen
NG-Amiga entwickelt und produziert (P5? IWIN? die omin&ouml;sen Holl&auml;nder?).&laquo;
</P>
<P>
Kilian Servais sagt: &raquo;Damit verliert AI endg&uuml;ltig jegliches Vertrauen;
zumindest bei mir. Wenn man dann noch bedenkt, welche Ger&uuml;chte so die Runde
mach(t)en, komme ich mir echt verarscht vor. Jim Collas war jemand der dort
in seinen 8 Monaten mehr bewegt hat, als AI in den letzten 6 Jahren!&laquo;
</P>
<P>
Michael Seibt meint: &raquo;Durch den Wechsel werden mal wieder die User
verunsichert, auf der anderen Seite habe ich das Chaos bei Amiga schon
vermisst. ;-)&laquo;
</P>
<H3>Fazit:</H3>
<P>
Keine Frage, nahezu alle Teilnehmer sehen den j&uuml;ngsten Wechsel an der
Amiga-Spitze negativ bis sehr negativ. Und diese Meinung scheint, wenn man
sich die aktuellen Ereignisse vor Augen f&uuml;hrt, aus meiner Sicht auch
durchaus gerechtfertigt zu sein.
</P>
<P>
Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1 x Schnittstellenkarte &quot;Hypercom 3+&quot;: Sebastian Hermann&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Wildfire 5 PPC (engl. Handbuch): Mark Buonfrate&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Wildfire 5 (engl. Handbuch): Stephan Manske&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;AFiloFaxPro&quot;: Andreas Barth&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;Diamond Caves II&quot;: Markus Castro&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;Sharks!&quot;: Andreas Frank&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Herzlichen Gl&uuml;ckwunsch!
</P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
