<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Techniknews3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
Quo vadis - Amiga?
</P>
<P>
So etwas musste ja passieren, bei dem Ungl&uuml;ck, dem die Amiga-Gemeinde in
den letzten Jahren immer wieder begegnete: Innerhalb eines Monats sind die
bis dato hervorragenden Chancen f&uuml;r einen Amiga der n&auml;chsten Generation auf
nahezu - aber doch nicht ganz - Null gesunken - zumindest von AMIGA/Gateway
k&ouml;nnen wir, so meine ich, kaum noch etwas erwarten.
</P>
<P>
Allerdings - und das soll hier der Vollst&auml;ndigkeit halber nicht au&szlig;er Acht
gelassen werden - sind die Aussagen von Tom Schmidt nicht von allen Usern
so drastisch interpretiert worden. Einige AnwenderInnen sehen n&auml;mlich
keinerlei grundlegende Richtungs&auml;nderung in den j&uuml;ngsten Verlautbarungen.
Lediglich die Produktion der AmigaNG-Hardware wolle AMIGA nun nicht mehr
selbst vornehmen, sondern von Partnerfirmen durchf&uuml;hren lassen.
</P>
<P>
Die &uuml;brigen User, zu denen auch ich mich z&auml;hlen muss, interpretieren die
Aussagen von Tom Schmidt jedoch in der Weise, dass unter dem Namen AMIGA
lediglich eine Betriebssoftware f&uuml;r sogenannte Information Appliances
(abgespeckte Computer f&uuml;r den Zugang zum Internet) auf den Markt gebracht
werden soll. Ich meine, f&uuml;r die Richtigkeit dieser These gibt es im
j&uuml;ngsten offenen Brief von Tom Schmidt zumindest einen Beleg:
Der AMIGA-Pr&auml;sident erkl&auml;rt, Partner finden zu wollen, 'die an der
Entwicklung eines NG-Amiga-Computers und -Betriebssystems interessiert
sind'. Im Umkehrschluss bedeutet dies nichts anderes, als dass AMIGA selbst
kein Computerbetriebssystem entwickeln wird. Wozu auch? Wenn sich das
Unternehmen auf die Entwicklung von Betriebssoftware f&uuml;r Information
Appliances konzentriert, liegt es da nicht nahe, diese Software ganz auf
den geplanten Einsatzbereich, Internetger&auml;te eben, zuzuschneiden? Folglich
stellt sich dann aber doch die Frage, von welchem Nutzen eine solche
Spezialsoftware f&uuml;r ein Computer(system) &uuml;berhaupt w&auml;re, was das
Lizensierungsangebot von AMIGA, zumindest diese Software betreffend, nicht
sehr schl&uuml;ssig erscheinen l&auml;sst.
</P>
<P>
Ganz sicher ist in Tom Schmidts offenen Briefen vieles
Interpretationssache, und vielleicht haben sogar diejenigen Recht, die
behaupten, sie beinhalteten im Prinzip &uuml;berhaupt keine eindeutigen Fakten.
Jedoch kann ich auf der anderen Seite den Optimismus einiger AnwenderInnen,
die sich zu der oben erst genannten Gruppe z&auml;hlen lassen, &uuml;berhaupt nicht
teilen.
</P>
<P>
Allerdings bin ich auch nicht bereit, jetzt (schon?) die Hoffnung
aufzugeben. Neu gegr&uuml;ndete Projekte und Organisationen f&uuml;r Anwender und
Entwickler, wie Amino, Aqua, Phoenix (<A HREF="http://owlnet.net/phoenix/" TARGET="_TOP">http://owlnet.net/phoenix/</A>), IMP
(<A HREF="http://www.amilogic.de/IMP" TARGET="_TOP">http://www.amilogic.de/IMP</A>) und andere, machen sich f&uuml;r den Fortbestand
der Amiga-Plattform bzw. Schaffung eines Nachfolge-Computersystems stark
und k&ouml;nnen zum Teil Unterst&uuml;tzung durch sehr bekannte und einflussreiche
Pers&ouml;nlichkeiten der Amiga-Welt vorweisen.
</P>
<P>
Inwieweit sich diese Gruppen etablieren k&ouml;nnen und ob sie jemals produktive
Ergebnisse hervorbringen, wird die Zukunft zeigen, AMIGA aktuell wird ihnen
jedoch auf jeden Fall Aufmerksamkeit schenken.
</P>
<P>
Damit bis n&auml;chsten Monat,
</P>
<P>
euer
</P>
<P>
Carsten Schr&ouml;der
</P>
<P ALIGN="RIGHT">
<A HREF="Techniknews3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
