<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Vorwort</H2>
<P>
Hi!
</P>
<P>
Herzlich willkommen zum AMIGA aktuell Spieleteil Ausgabe Oktober 1999.
Ein richtiges Highlight gab es diesen Monat im Spielebereich eigentlich
nicht, daf&uuml;r aber durch die Aktivit&auml;ten Gateways viele negative
Meldungen. Da nun selbst Petro Tyschtschenko erkl&auml;rt hat, dass es
keinen AmigaNG mehr geben wird, kann ich die AmigaNG Sparte in der
Release Liste eigentlich streichen. Diesen Monat habe ich sie jedoch
zuerst mal in Klammern gesetzt, da Digital Images, Delsyd Software
und nicht zuletzt Hyperion Software an Spielen f&uuml;r den AmigaNG
arbeiten. Aber angesichts der j&uuml;ngsten &Auml;u&szlig;erungen von Petro, ist
es wohl nur noch eine Frage der Zeit, wann auch diese Spiele
abgebrochen werden, denn wo kein AmigaNG ist, da kann es auch keine
Spiele f&uuml;r diesen geben.
</P>
<P>
Ich selber trauere eigentlich nicht viel &uuml;ber den Gateway
Entschluss, denn der AmigaNG h&auml;tte sowieso nichts mehr mit unserem
Amiga zu tun gehabt. Der Commodore Amiga ist einzigartig, auch
wenn es ihn wohl nie wieder geben wird. Und obwohl seit Jahren
keine Unterst&uuml;tzung mehr von gro&szlig;en Firmen kommt, ist am Amiga
immer noch fast genausoviel m&ouml;glich, wie auch am PC. Dies ist
jetzt nat&uuml;rlich auf Anwendungen bezogen. Amiga ist Multimedia,
dabei bleibt`s. Und wenn Windows irgendwann mal so ausgereift
sein sollte, wie es das AmigaOS ist, ja dann kann man &uuml;ber einen
Wechsel nachdenken. Aber bis dahin wird es wohl noch dauern...
</P>
<P>
Wegen st&auml;ndiger Probleme der Aminet Mailingliste, wurde die
'Neues aus dem Aminet' Rubrik jetzt aus dem Spieleteil gestrichen.
Es macht einfach keinen Sinn, nur einen Auszug aus den
hochgeladenen Sachen zu ver&ouml;ffentlichen, wie ich ihn jeden
Monat bekomme. Mal kommt eine E-Mail, dann wieder nicht. Dann
kommt eine ganze Woche keine usw. Ich denke allerdings, dass
auf diese Rubrik sowieso verzichtet werden kann, da ich
noch keine positives Feedback dazu bekommen habe. Sollte
ich hier irren, dann bitte Feedback an mich.
</P>
<P>
Auch diesen Monat gibt es wieder eine Mac-Ecke von Andreas
Koch, in der Mac-Spiele am Amiga getestet werden.
</P>
<P>
Auf Reviews m&uuml;sst ihr diesen Monat nochmals verzichten,
da mein CD-ROM Problem noch nicht ganz behoben ist. Aber
n&auml;chsten Monat wird`s hoffentlich was...Emulator-News gab
es diesen Monat auch sogut wie keine. Vielleicht ja
eine Sp&auml;tfolge des Sommerlochs! Daf&uuml;r gibt es diesen Monat
aber endlich aktualisierte Charts vom 3. September 1999.
</P>
<P>
So, dann viel Spa&szlig; mit dieser Ausgabe,
</P>
<P>
Andreas<BR>
(<A HREF="mailto:Andreas.Falkenhahn@gmx.de">Andreas.Falkenhahn@gmx.de</A>)<BR>
</P>
<P>
(Andreas Falkenhahn, An der Trift 2, 36132 Eiterfeld-Arzell)
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
