<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Wipeout 2097 anscheinend so gut wie fertig
</LI>
</UL>
<P>
F&uuml;r Wipeout 2097 werden jetzt Vorbestellungen angenommen, au&szlig;erdem
wurden genaue Spezifikationen angegeben, die das Spiel ben&ouml;tigt.
Daraus kann man schlie&szlig;en, dass es kurz vor der Ver&ouml;ffentlichung
steht. Wipeout 2097 ben&ouml;tigt einen PowerPC Prozessor, eine
3D Grafikkarte, 24MB Ram und ein CD-ROM Laufwerk. Au&szlig;erdem werden
einige Sachen unterst&uuml;tzt, wie z.B. das Spielen auf der Workbench.
Damit ist Wipeout 2097 wohl das erste, den PPC richtig
ausnutzende Spiel. F&uuml;r PPC Karten Besitzer also sozusagen ein
Muss. Ein gro&szlig;es Lob an Digital Images, die ihr Versprechen
tats&auml;chlich gehalten haben, auch wenn viele gezweifelt haben.
Digital Images hat es geschafft: Wipeout 2097 kommt. &Uuml;brigens
ist auf der Pianeta Amiga `99 in Italien eine Wipeout Beta
gelaufen und mittlerweile sollen die CD`s schon gepresst werden.
</P>
<UL>
<LI> Digital Images von Gateway offenbar etwas verwirrt
</LI>
</UL>
<P>
Nachdem die Nachrichten von Gateway diesen Monat die Runde
machten, entschloss sich Digital Images pl&ouml;tzlich, alle
AmigaNG Spiele einzustellen. Doch drei Tage sp&auml;ter stellte
man klar, dass die Entwicklung nun doch weitergehe. Nur f&uuml;r
welchen Rechner kommen diese Spiele dann, wenn kein AmigaNG
erscheint? Die Zukunft wird es uns erz&auml;hlen... Au&szlig;erdem ist
die Digital Images Wensite umgezogen: Die neue Homepage ist jetzt
unter <A HREF="http://www.di-games.co.uk/" TARGET="_TOP">http://www.di-games.co.uk/</A> zu erreichen. Auch gibt es
neue E-Mail Adressen: <A HREF="mailto:Info@di-games.co.uk">Info@di-games.co.uk</A> (Information),
<A HREF="mailto:support@di-games.co.uk">support@di-games.co.uk</A> (Technische Unterst&uuml;tzung),
<A HREF="mailto:webmaster@di-games.co.uk">webmaster@di-games.co.uk</A> (Webmaster), <A HREF="mailto:Stuart.Walker@di-games.co.uk">Stuart.Walker@di-games.co.uk</A>
(Stuart Walker).
</P>
<UL>
<LI> Keine AmigaNG Spiele mehr von Darkage Software
</LI>
</UL>
<P>
Darkage Software haben auf ihrer Website bekanntgegeben, dass
die Entwicklung ihres AmigaNG Spiels auf Eis gelegt wurde.
Die Entwicklung werde nur weitergehen, wenn endlich technische
Daten und eine Entwicklermaschine zur Verf&uuml;gung stehen
w&uuml;rden. Bis dahin geht bei Darkage nur die Entwicklung f&uuml;r
68k Amiga Spiele weiter.
</P>
<UL>
<LI> Joyride erscheint bei Titan Computer
</LI>
</UL>
<P>
Das X-Treme-Racing &auml;hnelnde Spiel Joyride erscheint bei Titan
Computer. Joyride bietet &uuml;ber 10 Tracks, 6 verschiedene Autos
wie z.B. einen Porsche, wobei jedes Auto seine Eigenschaften
hat (H&ouml;chstgeschwindigkeit, Beschleunigung....). Die Endversion
ben&ouml;tigt AGA, einen 68030 Prozessor und 8MB Ram. Au&szlig;erdem
erscheint das Spiel nur auf CD-ROM und unterst&uuml;tzt auch
CyberGraphX und Picasso96.
</P>
<UL>
<LI> Between the Lines
</LI>
</UL>
<P>
Dreamsworlds Development hat ein 3D Echtzeit-RPG Adventure mit
dem Namen Between the Lines angek&uuml;ndigt. Der deutsche Untertitel
lautet Zwischen den Fronten. Die fertige Version wird m&ouml;glicherweise
auch Multiplayer via Internet unterst&uuml;tzen. Between the Lines
ben&ouml;tigt einen PowerPC Prozessor, 32MB Ram und l&auml;uft unter
Warp3D. Man plante das Spiel auch f&uuml;r den AmigaNG, aber diese
Sache d&uuml;rfte sich jetzt wohl gegessen haben.
</P>
<P>
<A HREF="img/BetweenTheLines1.jpg"><IMG SRC="thumb/BetweenTheLines1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/BetweenTheLines2.jpg"><IMG SRC="thumb/BetweenTheLines2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> Heretic 2 &amp; Shogo
</LI>
</UL>
<P>
In der Amiga Plus erschien eine Anzeige, in der Heretic 2
und Shogo zur Vorbestellung zum Preis von 89 DM angeboten
wurden. Es kann also nicht mehr lange bis zur Ver&ouml;ffentlichung
dauern.
</P>
<UL>
<LI> Payback von Apex Designs
</LI>
</UL>
<P>
Apex Designs haben ihr erster kommerzielles Spiel mit dem Namen
Payback angek&uuml;ndigt. Payback soll ein Klon des PC-Spiels
Grand Theft Auto werden, bei dem man aus der Vogelperspektive
Autos und andere Vehikel stehlen muss. Am PC macht das ganze
einen Heidenspa&szlig;, man darf also gespannt sein, ob es Apex
gelingt, diesen Spa&szlig; auch auf dem Amiga gut r&uuml;berzubringen.
Payback soll bis Weihnachten fertig sein und umgerechnet etwa
75 DM kosten.
</P>
<UL>
<LI> Virtual GP ver&ouml;ffentlicht
</LI>
</UL>
<P>
Virtual GP ist nun endlich erschienen und im Fachhandel erh&auml;ltlich.
Nachdem die Ver&ouml;ffentlichung durch Probleme im Presswerk um einige
Monate verz&ouml;gert wurde, gibt es die Formel 1 Simulation jetzt
endlich zu kaufen. Ver&ouml;ffentlicht wurde das ganze von Epic Marketing,
&uuml;ber die man das Spiel auch beziehen kann. Au&szlig;erdem wurde
eine endg&uuml;ltige Demo im Aminet ver&ouml;ffentlicht, deren Preview ihr
in dieser Ausgabe lesen k&ouml;nnt.
</P>
<UL>
<LI> Erste Screenshots von Diablo's Land
</LI>
</UL>
<P>
Digital Dreams Entertainment hat erste Screenshots von dem Arcade
Abenteuer Diablo's Land ver&ouml;ffentlicht. Die Entwickler planen ab
jetzt regelm&auml;&szlig;ig Screenshots zu ver&ouml;ffentlichen, damit Amiga Gamer
ihre Kommentare und Meinung abgeben k&ouml;nnen. Dies kann z.B. unter
<A HREF="mailto:contact@dd-ent.com">contact@dd-ent.com</A> getan werden. Au&szlig;erdem k&ouml;nnen &uuml;ber die
Digital Dreams Website jetzt auch Spiele online bestellt werden.
</P>
<P>
<A HREF="img/DiablosLand1.jpg"><IMG SRC="thumb/DiablosLand1.jpg" WIDTH="120" HEIGHT="89" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/DiablosLand2.jpg"><IMG SRC="thumb/DiablosLand2.jpg" WIDTH="120" HEIGHT="89" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> Siberian Sun
</LI>
</UL>
<P>
Markus Holler hat auf seiner Homepage zwei MP3s aus dem Soundtrack
des Strategiespiels Siberian Sun ver&ouml;ffentlicht. Bei MP3s waren
als Audiotracks mit passendem Trailer auf der Amiga Format 44 CD-ROM
ver&ouml;ffentlicht.
</P>
<UL>
<LI> Neues von Alive Mediasoft
</LI>
</UL>
<P>
Alive Mediasoft hat sich mal wieder alte Spiele gesichert: Zum
einen das Spiel Cedric, welches 1996 bei Neo erschien und
zum anderen den Strategiehit Whale's Voyage 2, der ebenfalls
bei Neo erschienen ist. Die &uuml;berarbeitete Goal Version Goal 2000
geht gerade in den Betatest und soll sobald wie m&ouml;glich
erscheinen. Au&szlig;erdem wurde noch ein Shoot`em`up mit dem
Namen Apano Sin angek&uuml;ndigt, welches im Oktober erscheinen
soll.
</P>
<UL>
<LI> Maim &amp; Mangle News
</LI>
</UL>
<P>
Diesen Monat wurden neue Screenshots von Maim &amp; Mangle
ver&ouml;ffentlicht, um zu beweisen, dass die Entwicklung trotz
aller Strapazen weitergeht. Au&szlig;erdem wurde eine Mailingliste
eingerichtet, wo jeder der mag, &uuml;ber das Spiel mit den
Entwicklern diskutieren kann. Wer sich in die Liste eintragen
lassen will, kann dies tun, indem er eine leere E-Mail an
<A HREF="mailto:maimmangle-subscribe@egroups.com">maimmangle-subscribe@egroups.com</A> schickt.
</P>
<UL>
<LI> Neue Phoenix Screenshots
</LI>
</UL>
<P>
Vom Weltraumspektakel Phoenix wurden neue Screenshots
ver&ouml;ffentlicht, die mal wieder beeindruckend aussehen.
Momentan arbeitet man bei FutureTales an der Vollendung
der Engine. Best&auml;tigt wurde auch, dass die Endversion
einen bombastische CD Soundtrack und animierte Szenen
haben wird. Ob es auch Sprachausgabe geben wird, ist
noch nicht sicher.
</P>
<P>
<A HREF="img/Phoenix1.jpg"><IMG SRC="thumb/Phoenix1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Phoenix2.jpg"><IMG SRC="thumb/Phoenix2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> Mitarbeiter f&uuml;r Dafel Bloodline gesucht
</LI>
</UL>
<P>
Pagan Games ist auf der Suche nach 2D Grafikern f&uuml;r
ihre Spiel Dafel: Bloodline. Aber nicht f&uuml;r dieses
Spiel werden Grafiker gesucht, sondern auch f&uuml;r ein
Manga Spiel sucht Pagan Games Animateure. Interessierte
d&uuml;rfen sich an <A HREF="mailto:caradog@pagan-games.com">caradog@pagan-games.com</A> wenden. Au&szlig;erdem
ist die Pagan Games Webseite umgezogen und jetzt
auf <A HREF="http://www.pagan-games.com/" TARGET="_TOP">http://www.pagan-games.com/</A> zu erreichen.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
