<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerPC3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Der Zwischenruf
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Der Zwischenruf</H1>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&quot;O' zapft is'&quot;&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">... der allen M&uuml;nchnern bekannte Schlachtruf hat bereits&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Millionen Besucher auf das M&uuml;nchner Oktoberfest (f&uuml;r die Einheimischen kurz&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&quot;Wies'n&quot;) gelockt.&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Auch der Zwischenrufer hat sich bereits flei&szlig;ig mit der &quot;Materie&quot;
besch&auml;ftigt und hat sich gekonnt seinen Frust &uuml;ber die morgend&auml;mmernden
Amiga-Neuigkeiten von der Seele ges..... (nein, wir bleiben ordentlich hier
!!)
</P>
<P>
Der Kater am n&auml;chsten Morgen hat mit ohrenbet&auml;ubenden L&auml;rm seine Meinung
&uuml;ber die durchzechte Nacht verbreitet (um 5 Uhr Morgens musste Nachbars
Miezekatze feststellen, dass nicht nur Hunde bellen k&ouml;nnen...)
</P>
<P>
Was das alles mit dem Amiga zutun hat? Nun, zun&auml;chst mal gar nichts.
</P>
<P>
Und hier liegt eine kleine Parallele zur Entscheidung von Gateway: was dort
gew&uuml;nscht wurde hatte herzlich wenig mit der guten alten &quot;Tante Amiga&quot;
zutun.
</P>
<P>
Geradezu prophetisch beklagte ich im letzten Zwischenruf die mangelnde
Zukunftsperspektive f&uuml;r die besten User der Welt .... der Amiga-Community.
</P>
<P>
Tom Schmidt will uns im Auftrag Gateways eine quasi Settop-Box mit
Amiga-Logo andrehen. Warum eigentlich keinen Toaster? Kaffeetassen,
T-Shirts, Streichholzbriefchen und Kartenspiele gibts ja auch.
</P>
<P>
War das am Ende J.C.' s Vision?
</P>
<P>
Was bleibt mir als M&uuml;nchner zu w&uuml;nschen &uuml;brig?
</P>
<P>
....vielleicht einen Original-Wiesn'-Ma&szlig;krug mit eingebauten K&uuml;hlaggregat
und Internetanschlu&szlig;. Die Vernetzung bewirkt dann, dass eine 2,4 GHz -
Funkstandleitung zum n&auml;chsten Biercontainer aufgebaut wird (wer glaubt,
dass die Wiesn'-Ma&szlig; noch aus Holzf&auml;ssern gef&uuml;llt wird hat keine Ahnung von
einer Weltstadt). Die Ma&szlig; w&auml;re nie leer .... jedenfalls solange Bill
&quot;Billyboy&quot; Gates seine Finger nicht im Spiel h&auml;tte.
</P>
<P>
Und auf allem prangt dann das Amiga-Logo .... wie romantisch.
</P>
<P>
Zum Wohl ...... und lebt lang und erfolgreich!!
</P>
<P>
Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;
</P>
<P ALIGN="RIGHT">
<A HREF="PowerPC3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
