<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=green alink=red>
<p><h1><center><font color="green">Leserbrief von Kilian Servais</Font></center></h1></P>

<li><a href="#alle.html">An Alle</A><BR></LI>
<li><a href="#yonder.html">An Yonder</A><BR></LI>
<li><a href="#charlie.html">An Charlie</A><BR></LI>
<li><a href="#wolf.html">An Wolf</A><BR></LI>
<li><a href="#top.html">Top 5</A></UL></LI></P>
<hr>
<a name="alle.html">
<p><b>An Alle:</B><br>
In der letzten Ausgabe gab es zu meiner &quot;Metal Corner&quot; leider keine Link. Schade, denn diese war recht umfangreich ausgefallen. Die Dateien sind aber dennoch vorhanden - einfach die Datei &quot;metalcorner.html&quot; aus dem Ordner Metal Corner Oktober in einen Browser laden...</P
<hr>
<a name="yonder.html">
<p><b>Hi Yonder!</B><br>
Den Test zur &quot;Digital Make Up CD&quot; von mir war ja eigentlich keiner - es war ja vielmehr meine pers&#246;nliche Meinung &#252;ber diese CD, die ich hoffentlich auch so halbwegs sinnvoll begr&#252;ndet habe. Ich war der Ansicht, da&#223; Du die CD schon ausf&#252;hrlich getestet hattest, so da&#223; ich den Kram nicht nochmal wiederholen muss...</P>
<p>Tja, umgekehrt hat es Dich dann ja auch erwischt - die Rede ist von der &quot;Amiga Arena CD&quot;. Dar&#252;ber noch gro&#223; Worte zu verlieren, wenn Du eine &#228;hnliche Meinung hast wie ich, ist wohl tats&#228;chlich &#252;berfl&#252;ssig...</P>

<p>Schade, da&#223; der Harald Schmidt Workshop jetzt bald zu Ende ist. Ich habe ihn immer gelesen, auch wenn einige Gags schon etwas &#228;lter sind und finde es cool, da&#223; Du diese jeden monat in die NC gebracht hast, denn so hat man im &quot;Workshops&quot; immerhin einen Artikel im Monat gefunden. Momentan komme auch ich kaum noch dazu, viel f&#252;r die NC zu schreiben, denn die Schule raubt mir auf der einen Seite viel Zeit und zum anderen arbeite ich jetzt auch des&#246;fteren noch an meiner Homepage rum und das kostet auch immer viel Zeit...</P>

<p>Du schreibst also keinen Artikel mehr &#252;ber`s Clubtreffen? Auch sehr bedauerlich, denn mehr Meinungen sind immer sehr interessant. Auch mit etwas Abstand kann ich behaupten, da&#223; es ein wirklich cooles Wochenende war, welches sich auf jeden Fall total gelohnt hat. Ich sag nur : Illuminaten &amp; Verschw&#246;rungstheorien :-)))</P>

<p>See ya!</P>
<hr>
<a name="charlie.html">
<p><b>Hi Charlie!</B><br>
First Of All: Wilkommen im Club&quot;
Oh, Du kannst Dich noch an mich erinnern? Und an die geplante CD von mir auch? Schade, daraus ist tas&#228;chlich nichts mehr geworden, obwohl ich sehr viel Zeit in diese CD investiert habe. Vor einiger Zeit habe ich dann auf Anfrage von Andreas nochmal alle Einverst&#228;ndnisserkl&#228;rungen rausgesucht und ihm diese per Post geschickt. Damals (ist einige Monate her) meinte er, da&#223; er vielleicht jemand anderes daf&#252;r finden k&#246;nnte, aber daraus ist wohl auch leider nichts geworden. Sollte ich durch irgendeinen bl&#246;den Zufall mal an einen Brenner in meinen Amiga bekommen, werde ich das Projekt selber nochmal aufgreifen, denn auch im Nachhinein finde ich die Idee eigentlich nicht schlecht.</P>

<p>Ein Tip: Packe niemals eine Amiga Platte in einen PC - alle Daten w&#228;ren sofort weg, weil ScanDisk das Amiga Filesystem hoffnungslos zerst&#246;rt. Mit brennen ist dann nat&#252;rlich auch nicht mehr viel :-))) Alternative: Formatiere die 1GB Platte von Amiga Seite mit Cross Dos (also auf PC Format) und baue diese dann in den Pc ein; jetzt sollte es keine Probleme geben.</P>

<p>Toll fand ich &#252;brigens von Dir die vielen Artikel in der letzten Ausgabe! Da die NC in den letzten Monaten mit Artikeln nicht so sehr &#252;berschwemmt wurde (um es mal milde auszudr&#252;cken), ist uns jeder Schreiber immer willkommen. Also: Mach weiter so!!</P>

<p>Bis dann!</P>

<p><b>Gr&#252;&#223; Dich Wolf!</B><br>
Ein gro&#223;es Sorry das ich mich solange nicht mehr bei Dir gemeldet habe, aber momentan komme ich einfach zu gar nichts, was Du u.a. ja auch daran erkennst, da&#223; ich bei weitem nicht mehr so viel f&#252;r die NC schreiben kann, wie bisher. Aber irgendwann in der Zukunft wird auch von mir wieder mehr kommen :-)))</P>

<p>Daf&#252;r h&#228;lst Du ja die NC jetzt faktisch am leben, denn wenn Deine Beitr&#228;ge in der letzten NC nicht gewesen w&#228;ren, sehe es hier wirklich sehr schwach aus - besonders Deine Themenvielfalt erstaunt mich immer wieder. Mach also bitte immer weiter so, denn ohne Dich h&#228;tten wir in der NC garantiert keine derartig gro&#223;e Themenvielfalt - besonders cool fand ich Deine Online Beitr&#228;ge und dabei insbesondere den Artikel &quot;Aufgelesen&quot;. Wird das jetzt eine regelm&#228;&#223;ige Serie oder war das einfach mal nur so nebenbei? Ich spiele auch immer noch mit dem Gedanken mir einen I-Net Zugang zu holen, aber auch f&#252;r User ohne Online Zugang waren Deine Online Beitr&#228;ge absolut lesenswert. </P>

<p>So, mir f&#228;llt jetzt erstens nicht mehr ganz so viel ein, was ich schreiben k&#246;nnte und zwotens mangelt es momentan ohnehin an Zeit. Bis demn&#228;chst mal!</P>
<hr>
<a name="top.html">
<p><h1><center><font color="yellow">Top 5</font></center></h1></P>

<p>1. S&#228;mtliche Online Beitr&#228;ge von Wolf Zimmer<br>
2. Digital Make-Up von Higgins (Rechtfertigungen sind nicht n&#246;tig!)<br>
3. Expo von Charly (auch wenn ich die Expo recht schwach fand...)<br>
4. Jupitermonde von Wolf Zimmer<br>
5. Harald Schmidt von Yonder</P>





<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
