<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>WolfZ</title>
</head>
<body background="wolf1.gif" text=black link=blue alink="red" vlink="blue"
bgcolor=gray>
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Wolf&acute;s
Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a1"><b>f&uuml;r Karl-Heinz Bader</a></b></li>
<li><a href="#a2"><b>f&uuml;r Martin Voepel</a></b></li>
</ul>
<hr size=4>
<br>
<table width=100% border=0 cellpadding=6><tr><td>
<h3><a name="a1">Gr&uuml;&szlig; dich Karl-Heinz!</h3>
<p>Wie heisst es doch so richtig, steter Tropfen h&ouml;hlt den Stein. So
habe ich es nun doch endlich geschafft, dich dazu zu bewegen, wieder in der
Amigaszene aktiv zu werden. Und deine Frau freut sich nun, dass du wieder
aktiv wirst, aber dennoch f&uuml;r die Familie mehr Zeit hast. Denn die HAM
monatlich zusammenzustellen und dann leider nur dabei sowenig Fremdartikel
verwenden zu k&ouml;nnen, war doch sehr zeit- und arbeitsintensiv. </p>

<p>F&uuml;r die NoCover war es regelrecht ein Gl&uuml;ck, dass du justament
jetzt im Club eingetreten bist und gleich auch so viele Artikel mitgebracht
hast. Ich habe sie nicht gez&auml;hlt, das macht Gerd schon, wobei er
Leserbriefe und Helps nicht mitz&auml;hlt. Was w&auml;re diese letzte
NoCover ohne Charly, ich mag es mir gar nicht ausdenken. Aber froh bin ich,
dass ich mir einen Beitrag &uuml;ber die Expo gew&uuml;nscht hatte, und der
ist dir vortrefflich gelungen, das m&ouml;chte ich lauthals betonen. </p>

<p>Solltest du tats&auml;chlich alle HAM's auf CD brennen, dann melde ich
mich jetzt schon f&uuml;r ein Exemplar an. Die Disketten habe ich noch alle
und auch das Jubil&auml;umsheft. Hast du noch Kontakt zu den 3 Berlinern?
Und Erwin aus Wien? &Uuml;berhaupt was macht die ganze AMOS-Szene? Gibt es
sie noch? Was mich die ganzen Jahre verwunderte, war die Abstinenz von
Andreas Neumann in der NoCover. Obwohl er von Anfang an dabei war
(Mitgestalter der ersten Outfits) hat er nur einen Artikel in der NC-40
(G&uuml;tersloh 97-Bericht) ver&ouml;ffentlicht. Aber in anderen Magazinen,
wie bei dir in der HAM oder bei Ygar (Alain Declerq) in dessen A&M
(eingestellt am 03/96 - und ich war dann ohne Heimat), hat er seine
Statements z.T. als Leserbriefe abgegeben. Ehrlich mir fehlt seine offene
und teilweise kr&auml;ftig bissige Art zu schreiben. Sein AmigaGadget hat
in letzter Zeit auch immer gr&ouml;&szlig;ere Erscheinungsl&uuml;cken, das
liegt wohl nun mit seiner sehr gering bemessenen Freizeit zusammen. Ob der
geplante Termin Vorweihnacht 2000 f&uuml;r die Nummer 46 eingehalten wird?
Und dabei ist es nicht mehr lange hin, bis die 10 j&auml;hrige
Jubil&auml;umsausgabe herauskommt. Ich wei&szlig; n&auml;mlich nicht wann
die Nummer 1 erschienen ist. Es muss aber so im Sommer 91 gewesen sein.
Leider habe ich diese nie kennengelernt. </p>

<p> Es ist dir voll freigestellt, Html-Vorlagen anderer abzukupfern und mit
eigenen Texten zu versehen. Ich habe &uuml;berhaupt nichts dagegen, wenn du
meine Berichte dazu heranziehst. Ich wei&szlig; n&auml;mlich, wie
m&uuml;hsam es ist, die HTML-Sprache mit den einzelnen Feinheiten optimal
zu nutzen. Und ich behaupte dies von meinen K&uuml;nsten keinesfalls, dass
ich dies im erweiterten Sinne auch kann. <p>

<p>Ich wei&szlig; nicht, welche Schriftgr&ouml;&szlig;en du nun in deinem
Browser eingerichtet hast, denn in deinen Berichten geht nicht genau
hervor, welchen Browser zu bevorzugst. Ich habe bei allen dreien in Prefs
bei IBrowse 2.2, AWeb 3.3 LocalDEMO und Voyager 2.95 DEMO folgende
Einstellungen gew&auml;hlt:
<center>
<table border=1>
<tr><td>Style</td><td>Display font</td><td>Print font</td>
<td bgcolor=#808080> &nbsp; &nbsp; </td>
<td>Style</td><td>Display font</td><td>Print font</td></tr>
<tr><td colspan=3>Normalfont</td><td bgcolor=#808080> &nbsp; &nbsp; </td>
<td colspan=3>fixed font</td></tr>
<tr><td align=center> 1 </td><td>Times/11</td><td>CGTimes/9</td>
<td bgcolor=#808080> &nbsp; &nbsp; </td>
<td align=center> 1 </td><td>Courier/11</td><td>LetterGothic/7</td></tr>
<tr><td align=center> 2 </td><td>Times/13</td><td>CGTimes/11</td>
<td bgcolor=#808080> &nbsp; &nbsp; </td>
<td align=center> 2 </td><td>Courier/11</td><td>LetterGothic/11</td></tr>
<tr><td align=center> 3 </td><td>Times/15</td><td>CGTimes/13</td>
<td bgcolor=#808080> &nbsp; &nbsp; </td>
<td align=center> 3 </td><td>Courier/13</td><td>LetterGothic/13</td></tr>
<tr><td align=center> 4 </td><td>Times/18</td><td>CGTimes/15</td>
<td bgcolor=#808080> &nbsp; &nbsp; </td>
<td align=center> 4 </td><td>Courier/15</td><td>LetterGothic/15</td></tr>
<tr><td align=center> 5 </td><td>Times/24</td><td>CGTimes/18</td>
<td bgcolor=#808080> &nbsp; &nbsp; </td>
<td align=center> 5 </td><td>Courier/18</td><td>LetterGothic/18</td></tr>
<tr><td align=center> 6 </td><td>Times/30</td><td>CGTimes/21</td>
<td bgcolor=#808080> &nbsp; &nbsp; </td>
<td align=center> 6 </td><td>Courier/24</td><td>LetterGothic/21</td></tr>
<tr><td align=center> 7 </td><td>Times/36</td><td>CGTimes/24</td>
<td bgcolor=#808080> &nbsp; &nbsp; </td>
<td align=center> 7 </td><td>Courier/24</td><td>LetterGothic/24</td></tr>
</table></center><br>
Bisher bin ich damit voll zufrieden. Andere User nutzen wahrscheinlich
andere Fonts und andere Gr&ouml;&szlig;en. Ich finde, es ist alles
inviduell zu betrachten. Es gibt aber auch User, die haben einen zu kleinen
size gew&auml;hlt und schreiben dann innerhalb ihrer Texte &lt;font
size=&quot;+2&quot;&gt; und wundern sich, dass wir alle &auml;rgerlich
sind, er selber aber optimal sieht. </p>

<p>Wenn du eine Lernunterlage f&uuml;r HTML ben&ouml;tigst oder mindestens
ein Nachschlagewerk, dann ziehe dir die Datei selfhtml.zip von Stefan
M&uuml;nz. Sie liegt in der Version 7.0 vom 27.04.98 vor und ist wohl so
aktuell, dass kein Update bisher erschienen ist. Die Datei ist so um die 5
MB gro&szlig;, das gedruckte Buch kostet aber 98,- DM. Da ist eine halbe
Stunde Online billiger. </p>

<p>Das mit gekauften Programmen kenne ich. Kommt etwas Neues auf den Markt,
muss man es auch haben, man k&ouml;nnte es ja vielleicht gebrauchen. Von
den 24Bit-Programmen habe ich 3, n&auml;mlich ArtEffect 4.0, fxPaint 1.0
und XiPaint 4.0 und was ist die Quintesenz? Ich beherrsche alle drei nicht
richtig. Habe ich ein gescanntes Bild nachzubearbeiten, mache ich dies
immer noch Pixel f&uuml;r Pixel mit PPaint. DPaint musste ich verschenken,
da mit der PicassoIV das Ende der Fahnenstrange f&uuml;r dieses Programm
erreicht war. Das Umkonvertieren wird nicht mit UltraConv4, sondern immer
noch mit dem alten AdPro 2.5 gemacht, an das ich mich so gew&ouml;hnt habe.
Mit Textverarbeitungen ist es das Gleiche. Derzeit habe ich drei im
Gebrauch, es kommt darauf an, welchen Output ich erzeugen will.
Schnelldruck mit Druckerfonts (WW7) oder Tabellen mit verschieden Fonts und
Querformat (FW97) oder Schreiben, Plakate (AW 2.0), bei denen Fonts und
Bildchen im Vordergrund stehen, meine Auswahl ist festgelegt. Aber mit was
schreibe ich jetzt? Mit GoldEd 6.0 und auf dem zweiten Schirm habe meine
Dummy-Datei und da schaue ich mir dann den Output an. Aber mit den anderen
Programmen geht das gleichfalls so weiter, es w&uuml;rde wohl beinahe den
Rahmen sprengen, alles aufzuz&auml;hlen. </p>
<p>Bis zum n&auml;chsten Mal alles Gute, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
<h3><a name="a2">Gr&uuml;&szlig; dich Martin!</h3>
<p>Vielen Dank f&uuml;r deinen Artikel an mich, denn ich habe mich wahrlich
dar&uuml;ber gefreut, endlich nach langer Zeit wieder ein pers&ouml;nliches
Feedback zu lesen, wobei ich keinesfalls die Kurzmeldungen in den
Feedbacktabellen schm&auml;lern m&ouml;chte. Diese CD-Reihe beschreibe ich
seit Aminet-21 und jedesmal &uuml;berlege ich, welches Programm schaue ich
mir auf die K&uuml;rze an, um etwas dar&uuml;ber zu schreiben. Es ist
schwer, manchmal verflixt schwer und es kommt &ouml;fter vor, dass ich im
Nachherein noch etwas finde, das ich h&auml;tte eher erw&auml;hnen sollen.
Aber das war jetzt nur so am Rande. </p>

<p>Um spezifisch dieses Programm (webPlug) nochmals aufzugreifen,
m&ouml;chte ich dir sagen, dass ich jetzt erst bei genauerem Hinsehen
festgestellt habe, dass bei der Version 1.45 doch eine Dokumentation dabei
ist, sie hat blo&szlig; kein Icon und aus diesem Grunde habe ich dies
&uuml;bersehen. Und nun spreche ich f&uuml;r uns wenigen &uuml;ber 60 Jahre
alte User. Englische Dokumentationen erschweren unser Computerleben
erheblich und Feinheiten k&ouml;nnen wir schon gar nicht mehr feststellen.
Und wenn in einer Dokumentation noch alles als normale Gegebenheit
vorausgesetzt wird und behuf diesen Grundes eine Erl&auml;uterung
&uuml;berfl&uuml;ssig erscheint, dann kann es in unserem Alter schon
kriminell werden. Um unsere Doofheit nicht noch mehr zu untermauern, will
ich gar nicht erst erw&auml;hnen, welche Schwierigkeiten schon gleich nach
dem Start f&uuml;r uns auftreten k&ouml;nnen. </p>

<p>Was h&auml;lst du davon, einen oder zwei ausf&uuml;hrliche Workshops zu
schreiben? Und f&uuml;r uns Alten w&auml;re es sogar am Besten, wenn dies
im Stile von Dr.Oetker gesch&auml;he (nach dem Motto: Man nehme den
Kochl&ouml;ffel in die rechte Hand und .....). Du verstehst was ich meine?
Aber eines habe ich auf die Schnelle nicht ganz mitbekommen, warum muss mit
einem anderen Programm nachgearbeitet werden? Ich pers&ouml;nlich habe mich
daran gew&ouml;hnt, meine HTML-Beitr&auml;ge mit GoldEd zu schreiben und
die notwendigen Tags werden gleich gesetzt und auch die entsprechenden
Formatierung wird gleich vorgenommen. Die Html-Umsetzung der Umlaute wird
dann im Nachherein gemacht (finde und ersetze), alle anderen ASCII-Codes
(160 bis 255) werden gleich beim Schreiben gesetzt, daf&uuml;r habe ich
extra eine Tabelle hier an der Wand h&auml;ngen. Auch setze ich sofort die
Steuerzeichen, die nur zur Ansicht dienen sollen, gleich um. Diese
Arbeitsweise resultiert wahrscheinlich aus einer alten Gewohnheit an meinem
fr&uuml;heren Arbeitsplatz heraus, denn bevor die
Bildschirmarbeitspl&auml;tze eingerichtet wurden, hatte ich meine Abfrage-
und Auswerteprogramme selbst in Lochkarten am Locher &quot;gestanzt&quot;
und gleich im Maschinenraum als Testlauf ausprobiert. Dies ging
n&auml;mlich erheblich schneller, als die Signierbl&auml;tter zu
beschreiben und diese zur Datenerfassung weiterzugeben. Ein Fehler wurde
dann fr&uuml;hestens am n&auml;chsten Tag festgestellt und bis der
R&uuml;cklauf wieder da war, so lange wollte ich nie warten. </p>

<p>Nur habe ich noch keine Ahnung, wie es mal hier weitergehen wird, wenn
wir unsere Arbeiten eventuell mal mit CSS und/oder Javascript formatieren
sollen/m&uuml;ssen/k&ouml;nnen. Dann beginnt die Lernphase wieder von
vorne. Aber so weit ist es noch lange nicht. Vielleicht wird man dann einen
Pool einrichten m&uuml;ssen, der die Formatierungsarbeiten ausf&uuml;hrt
und das Magazin zusammenstellt. Vielleicht schreiben dann auch diejenigen
wieder etwas, die aufgeh&ouml;rt haben Berichte zu verfassen,als das
&quot;MagneticPages Magazin&quot; auf ein &quot;HTML Magazin&quot;
umgestellt wurde. </p>

<p>Jetzt noch ein klitzekleiner Tipp. Wenn du in deinem Beitrag die
Schaltfl&auml;che f&uuml;r Ausblendung des Frames benutzst, dann solltest
du am Ende des Beitrages unbedingt den gegenteiligen Schalter
implementieren. Oder mindestens den Zusatz bringen, dass zum Weiterlesen,
der Retourschalter des Browsers zu bet&auml;tigen ist. Manche Leute
brauchen solch eine Aufforderung, so traurig wie dies auch klingt. </p>
<p>Bis zum n&auml;chsten Mal alles Gute, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
</td></tr></table>

<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr>
<td bgcolor="#a0a0a0">Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td bgcolor="#a0a0a0">E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td bgcolor="#a0a0a0">Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
