<HTML>
<HEAD>
<TITLE>Leserbrief von Charly</TITLE>
</HEAD>
<BODY BACKGROUND="l_bg.gif" TEXT=#000000 LINK="#0000FF" VLINK="#000080" ALINK="#FF0000" BGCOLOR="#FFFFF4">
<a name="top"></a><br>
<center><font color="#000080" size="4">
<b> Charly &acute;s Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a1"><b>an Wolf Zimmer</a></b></li>
<li><a href="#a2"><b>an Martin Voelpel</a></b></li>
</ul>
<table width=100% border=0 cellpadding=6><tr><td>

<P>
Hallo Leserin, Hallo Leser,<br>
</p><p>
als erstes m&ouml;chte ich ganz herzlich die Neuen Mitglieder begr&uuml;ﬂen,
das sind Martin Voelpel und Steffen Nitz.<br>
Und nachtr&auml;glich Alles Gute zum Geburtstag, denjenigen, die im Oktober
Geburtstag hatten.<br>
</p><p>
Das w&auml;ren meinen Informationen nach...<br>
</p><p>
<ul>
<li>Hannes Badrnya </li><p>
<li>Markus Castro Y Castro </li><p>
<li>Christian P&ouml;pper-Niehues </li><p>
<li>Markus Steffan </li><p>
<li>Thomas Steffens </li>
</ul>
</p><p>
Von zwei Personen wurde ich per E-Mail begr&uuml;&szlig;t. Das war Annemie und
Horst-Uwe. Da habe ich mich sehr dr&uuml;ber gefreut.
</p><p>
Alles Gute...<br>
Charly<br>
</p><p>
</p>
<hr>
<a name="a1"><p><br>
<h3>Hallo Wolf,</h3>
<p>
wie immer waren Deine Artikel sehr interessant. Wenn es so kommen w&uuml;rde, wie
in <b> (Auf)gelesen </b> erl&auml;utert, dann k&ouml;nnte ja jeder mit Internet-Anschluss,
die n&ouml;tige Motivation vorausgesetzt, das Abitur machen. Denn ich glaube, es gibt
im Internet wohl die M&ouml;glichkeit, zu jeder Frage eine Antwort zu finden.<br>
Andererseits w&auml;re es sehr bedenklich, denn diese Menschen verfallen dann, wie Dein
n&auml;chster Punkt anzeigt - der Droge <i><b>InterNET</b></i>. Ein Teufelskreis!
</p><p>

Sch&ouml;ne Gr&uuml;&szlig;e aus Hannover von<br>
<br>
<H3><i> Charly </i></H3>
</p>
<a href="#top">zum Anfang</a>
<p>
<hr><br>
<a name="a2"><p><br>
<h3>Hallo Martin,</h3>
<p>
zu Deinen Bericht &uuml;ber <b>Webplug</b> und <b>MetalWEB</b> m&ouml;chte ich schreiben,
daﬂ es meiner Meinung nach eigentlich nicht n&ouml;tig ist, ein solches Programm
zu benutzen. F&uuml;r die NoCover habe ich mir f&uuml;r jede Rubrik ein Grundger&uuml;st
angelegt und kann so ohne Probleme alles gestalten.<br>
Gut, nat&uuml;rlich macht es jeder so, wie es Ihm am besten gef&auml;llt.<br>
Wenn ich mir einige Beitr&auml;ge &uuml;ber meinen ASCII-Editor GoldED ansehe, f&auml;llt
mir auf, das ja auch manche Leute mit <b>MicroSoft-Programmen</b> schreiben,
wo schon die erste Seite nur mit Copyrights und HTML-Anweisungen gef&uuml;llt ist.
Da denke ich, das sind viele unn&uuml;tze Zeichen.<br>
Wenn ich mal Zeit habe, werde ich es mal ausprobieren.

</p>
Alles Gute...<br>
<H3><i> Charly </i></H3> <br>
<p>

<a href="#top">zum Anfang</a></p>
<hr><br>
<center>
<table border="6" width=95%><tr><td>
<center>
Autor:  &nbsp; &nbsp; <a href="Mitglieder/bader.html">Karl-Heinz Bader</a>&nbsp; &nbsp;
E-Mail: <a href="mailto:charly-ham@t-online.de"> charly-ham@t-online.de</a> <br>
</center>
</td></tr></table></center>
<br>
<p>
</font>
</BODY>
</HTML>
