<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Max</title>
</head>
<body background="wolf1.gif" text=black link=blue alink="red" vlink="blue"
bgcolor=gray>
<br>

<center><font color="#000080" size="7"><b>www.max.de </b></font></center></p>
<hr size=4>
<br>
<table width=100% border=0 cellpadding=6><tr><td>

<p>Wer ein Wort sucht, das ein Phänomen beschreiben soll, das alles abdeckt,
gelangt schnell zum Begriff "eierlegende Wollmilchsau". Die Website www.max.de
ist noch viel mehr. Hier gibt es die aktuellsten Szenetipps weltweit, die besten
Bars und Restaurants, heiße Nightlife- und Shoppingtrends ....... </p>

<p>Auf der Max Homepage findet man alles Nähere zu den Themen und Reportagen
des aktuellen Weltgeschehens, Gerüchte und einen Führer für Reisende und
Weltenbummler, die nicht wissen, was man heute abend unternehmen könnte. </p>

<p>Aus diesem reichhaltigen Angebot habe ich zwei unterschiedliche Episoden
ausgewählt, zum Ersten einen Bericht über meine Kreisstadt Siegburg und zum
Zweiten ein Bericht über Boris. </p>


<p><img src="onl_max1.jpg" align=left hspace=6>
<font size="+3"><b>Zur&uuml;ck ins Mittelalter: Siegburg feiert den
Weihnachtsmarkt anders </font></b><br>  

<b>&raquo;H&ouml;rt, h&ouml;rt&laquo; br&uuml;llt der Herold und er&ouml;ffnet den Markt
f&uuml;r einen neuen Handelstag. Auch der Schmied mag's laut und l&auml;sst
seinen Hammer auf den Amboss donnern. Wer Beschaulichkeit und Ruhe sucht,
ist auf dem mittelalterlichen Weihnachtsmarkt zu Siegburg fehl am Platz.
Glitzernden Engelskitsch und perlende Fl&ouml;tenmusik gibt es hier nicht,
stattdessen geht es auf dem zentralen Platz des fast 1 000 Jahre alten
rheinischen St&auml;dtchens derb und deftig zu.</b>
<br>&nbsp;<br>

Dennoch kommt der Siegburger Weihnachtsmarkt, der vom 02. bis 21. Dezember
seine St&auml;nde &ouml;ffnet, gut an. 1999 wurde er von einer Zeitschrift
zu den zehn besten Deutschlands gew&auml;hlt - eine ungewohnte
Aufmerksamkeit f&uuml;r die 40 000 Einwohner z&auml;hlende Kreisstadt im
Schatten der beiden bedeutenderen Nachbarn Bonn und K&ouml;ln.<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dabei ist Siegburg durchaus
eine Reise wert, auch au&szlig;erhalb der Weihnachtszeit. Wahrzeichen ist
eine immer noch genutzte Benediktiner-Abtei, die der K&ouml;lner Erzbischof
Anno II. im elften Jahrhundert auf dem wegen seiner Fernsicht begehrten
Michaelberg gr&uuml;ndete. Der dort oben verkaufte Abteilik&ouml;r ist eine
Spezialit&auml;t. Das Stadtmuseum erinnert an den in Siegburg geborenen
Komponisten Engelbert Humperdinck (1854-1921) und eine Jahrhunderte alte
T&ouml;pfertradition. Gesch&auml;fte und Caf&eacute;s in der
Fu&szlig;g&auml;ngerzone laden zum Bummeln ein.<br>

&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ins Leben gerufen
wurde der &raquo;Mittelalterliche Markt zur Weihnachtszeit&laquo; vor
sieben Jahren, um eine Alternative zur Markt-Routine in deutschen
St&auml;dten zu bieten. Seitdem ist er stark gewachsen: Mehr als zehn
Dutzend Handwerker, H&auml;ndler, Minnes&auml;nger und Spielleute des
Vereins Kramer, Zunft und Kurtzweyl warten inzwischen mit ihren Waren und
Vorf&uuml;hrungen auf Kundschaft. &raquo;Der Einzugsbereich reicht deutlich
&uuml;ber das Ruhrgebiet hinaus&laquo;, sagt Nathalie Niederdrenk vom
Tourismus und Kulturservice
Siegburg.<br>

&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Wer Geschenke zum Fest
sucht, kann sich &raquo;Spezereien aus dem Orient&laquo; einpacken lassen,
einen Auftrag an den L&ouml;ffelschnitzer oder Zinngie&szlig;er erteilen
oder sich von einem talentierten Schreiber eine Urkunde mit dem
G&auml;nsekiel schreiben lassen. Bezahlt wird nicht in Mark oder Euro,
sondern stilecht mit &raquo;Silberlingen&laquo;.<br>

&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Gaukler und Artisten
treiben ihre Scherze mit den Besuchern zwischen engen Budengassen, die nach
Einbruch der Dunkelheit von Kerzen und &Ouml;llichtern erhellt werden.
Hunger und Durst k&ouml;nnen rustikal mit &raquo;Reisfra&szlig; in
Kohlbl&auml;ttern&laquo;, warmem Met und &raquo;mittelalterlichen&laquo;
Schn&auml;psen und Bier gestillt werden. Aber keine Sorge: Auf eine Zutat
des modernen Weihnachtsmarktes wird auch im nostalgischen Siegburg nicht
verzichten - wer ihn unbedingt braucht, bekommt auch Gl&uuml;hwein.<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Informationen: Tourist
Information, Am Markt 46, 53721 Siegburg (Tel.: 02241/969 85 33, Fax:
02241/969 85 31, Internet: www.siegburg.de </p>   
<hr>
<p><img src="onl_max2.jpg" align=left hspace=6>
<font size="+2" color="#666666"><b>Vom Tennis-Gott</font>
 . . . zur Lichtgestalt der New Economy. Nach viel Spott und
H&auml;me fragt sich MAX-Autorin Ulrike Posche: &Uuml;bernimmt sich
&Uuml;berflieger Boris B.?</b><br> <br>

Der Abend war, das muss man sagen, schlicht super! Ursula Prinzessin zu
Hohenlohe hatte f&uuml;r das Modehaus Dior die Sch&ouml;nsten, die
Reichsten, die Nackertsten der Stadt in ein altes Stra&szlig;enbahndepot
geladen. Und das M&uuml;nchner Partyvolk kam in Pashminas und Pantoletten.
Und in Scharen. Als alle schon am Rande des Catwalks sa&szlig;en, erschien
die K&ouml;nigin mit ihrem Gefolge. In einer Jeansjacke von Dior, in
Schuhen von Manolo Blahnik, in einem Pulk von Fotografen zog Deutschlands
wahre First Lady strahlend in die Halle ein: Barbara Becker, 33, das gut
gelaunte Oberhaupt des Glamours, die fotogene Heroine der gelben Presse,
die wundersch&ouml;ne H&auml;lfte des globalen Top-Unternehmens
Boom-Boom Becker. Mein Gott, was f&uuml;r ein Abend! An der
Hand f&uuml;hrte sie wie &uuml;blich Freundin Kim, die Gattin von Steeb.
Carl-Uwe, einst mit Becker Davis-Cup-Sieger, geh&ouml;rt heute zu dessen
Firma wie so viele, die ihn einst massierten oder ihm die Saiten spannten.
Die Kollegen im Becker-Betrieb nennen Charly Steeb und Carlo
Thr&auml;nhardt Beckers Hunde. Nat&uuml;rlich nur hinter
vorgehaltener Hand und nur wegen deren Treue zum Chef. </p>

<p>Mit Kim Steeb also h&uuml;hnerte Babs in die Kameras, machte lustig auf
Hanni und Nanni. Ein Bodyguard trug ihr indes die Dior-Tasche zu Platz 45
an der Mitte des Laufstegs. Dann winkte Frau Becker noch einmal in die
Runde, kramte aus ihrer Tasche Traubenzucker, den sie m&uuml;tterlich nach
links und rechts verteilte. Und endlich begann die Modenschau. In dem
Moment mag Uschi Hohenlohe gewusst haben, dass ihr der Abend als Erfolg
angerechnet w&uuml;rde. Obwohl es nat&uuml;rlich noch sch&ouml;ner gewesen
w&auml;re, wenn auch er noch erschienen w&auml;re. Aber Boris Becker, 32,
der emeritierte Tennis-Gott, hatte Wichtigeres zu tun, als Klamotten zu
bestaunen. Ihr Mann sei in Asien unterwegs, erkl&auml;rte
Barbara Becker. Er mache dort Termine f&uuml;r AOL. Leider,
sagte sie. </p>

<p>Gestern noch beim AOL-Launch in Mexiko-Stadt, morgen bei Mika
H&auml;kkinen in der Formel-1-Box, &uuml;bermorgen beim Posing mit Nelson
Mandela, mit Jacques Chirac, mit Muhammad Ali. Der universale Becker ist
l&auml;ngst nicht mehr unser Bobele. Er ist Big Boris, der Mann mit dem
Goldh&auml;ndchen. Gesch&auml;ftsmann und Manager will er sein,
Internet-Unternehmer (Sportgate), Sportchef (Mercedes-Juniorteam),
Firmenboss mit etwa 150 Angestellten in M&uuml;nchen (BBM), Pf&auml;ffikon/
Schweiz (BBI) und Ribnitz- Damgarten. Ribnitz wo? Ribnitz-Damgarten in
Mecklenburg-Vorpommern. </p>

<p>Dort hat Becker seit Jahren Mercedes-Autoh&auml;user. Er ist nicht mehr
der hechtende Junge am Netz, der mit Preis- und Sponsorengeldern
gesch&auml;tzte 200 Millionen machte. Er macht es jetzt im Net. Und manche
sagen: Der verhebt sich. </p>

<p>Unser fussigblonder Netzwerker aus Leimen ist hoch aufgestiegen. Lebt in
M&uuml;nchen und Miami, in Monaco und Mallorca. Ist zu Gast auf Schloss
Bellevue und Buckingham. Oft sitzt er zur Linken des Kanzlers und pafft
Zigarillos. Von dort soll er zu den Oktober-Festlern und den Oscar-Leuten
von Hollywood kommen. Jeder will ihn, und viele kriegen ihn. Jeder
Veranstaltung gibt er Glanz. Jede Botschaft tr&auml;gt er erregender in die
Welt als andere. Wenn Jacques Chirac und er miteinander reden,
beobachtete die F&uuml;rstin von Thurn und Taxis, dann ist das ein
Gespr&auml;ch unter Gleichen. Vielleicht ist es ihm ein bisschen in
den ingwerfarbenen Kopf gestiegen, dass ihn sein Charisma so in den Himmel
katapultiert hat. Jedenfalls sagen manche bereits: Der ist abgehoben. </p>

<p>Neulich bei einer Anti-Rassismus-Gala, die Innenminister Otto Schily mit
Schnittchen und Sekt in der Berliner Staatsoper Unter den Linden gab,
wollte ein Reporter von Boris Becker einen Satz zum Problem. K&uuml;hl
guckte der Star &uuml;ber ihn hinweg: Haben wir einen Termin? fragte er und
drehte sich um. Ein Boris Becker entscheidet selbst, wem er ein Interview
gibt und wem nicht, erkl&auml;rt Robert L&uuml;benoff, 43, Beckers Sprecher
in M&uuml;nchen. </p>

<p>Zur Buchmesse sollte im Bertelsmann Verlag eine Biografie &uuml;ber den
deutschen Helden erscheinen. Geschrieben von Helmut Sorge, einem
Spiegel-Korrespondenten. Kurz vor Abgabe des Manuskripts zog Becker
zur&uuml;ck, aus privaten Gr&uuml;nden. Alle sind sauer, aber
sie h&auml;tten wissen m&uuml;ssen: Ein Buch ist dann fertig, wenn
ein Boris Becker sagt, dass es fertig ist, so L&uuml;benoff. </p>


<p>P&uuml;nktlich zum Beginn der Champions League sollte Boris Becker
f&uuml;r RTL nicht nur Fu&szlig;ball-Spiele mitmoderieren, sondern auch
Hintergrund-Reportagen liefern, einf&uuml;hlsame Interviews. Von einem
Besuch bei den schillernden Beckhams war die Rede, vom Training mit den
Bayern. Ein Scoop f&uuml;r RTL-Chef Hans Mahr, ein Haufen Kohle f&uuml;r
Super-Boris. </p>

<p>Anfang September spielten der HSV und Bayern M&uuml;nchen, doch Becker
blieb stumm. Dann kam er als Top-Interviewer: Die Nation fragt sich
wie geht's dem Oberschenkel, Oliver? Ein Boris
Becker macht nat&uuml;rlich nicht irgendwas, erkl&auml;rt
L&uuml;benoff, sondern den Highlight-Reporter. </p>

<p>Im Februar erl&auml;uterte der Sportlervermarkter Becker seine
Konzeptidee f&uuml;r den frisch eingekauften Milan-St&uuml;rmer Andrej
Schewtschenko. Wichtiger als das Werbegesch&auml;ft mit dem Kicker aus der
Ukraine sei ihm, so der Sportsfreund, die ganz pers&ouml;nliche
Spielerberatung. Dennoch, Vertr&auml;ge mit Adidas, Nike, Lotto, sogar mit
den noblen Uhrenherstellern TAG Heuer und Cartier seien durchaus drin,
erkl&auml;rte Boris in der VIP-Lounge des Mail&auml;nder Hotels
Carlton einem Bild-Reporter. Insider argw&ouml;hnten schon
damals, dass mit dem unbekannten Russen schwer zu werben sei, schon weil
der nur Ukrainisch und Italienisch spreche. Doch Becker, den die
Spielervermarktung nur peripher interessiert, weil sie keine
Geschichte, keine Wertigkeit hat, lie&szlig; flei&szlig;ig
akquirieren und fand schlie&szlig;lich vor kurzem in Ulm einen
Werbespot-Partner f&uuml;r Schewtschenko: Home Jumper, eine
PC-Reparaturfirma. Mit gro&szlig;em Tamtam feierte der Becker-Clan den
Vier-Millionen-Deal. Im M&uuml;nchner Olympia-Stadion. </p>

<p>Immer klingt es beim Unternehmer Becker ein bisschen gr&ouml;&szlig;er,
als es ist. Seine Berater hie&szlig;en J&uuml;rgen Schrempp und Gerhard
Schr&ouml;der, l&auml;sst er durchblicken. Ja, es stimmt, im
Kanzler-Bungalow war er schon zu Gast. Und auch bei DaimlerChrysler
best&auml;tigt man, dass es gelegentlich Begegnungen zwischen Schrempp und
dem Jungunternehmer gebe am Rande gesellschaftlicher Events wie der
Medienpreisverleihung an Nelson Mandela in Baden-Baden zum Beispiel. Bei
AOL-Chef Steve Case in Virginia g&ouml;nne er sich Anschauungsunterricht,
hie&szlig; es. Das ist f&uuml;r mich Abendschule, sagt er dem Handelsblatt.
Boris kennt Case besser als ich, sekundierte AOL-Deutschland-Mann Uwe
Heddendorp. Die einen sagen so, die anderen so: So schnell wurde
Tennis-Altmeister Boris Becker selten abgefertigt. Kurzes
H&auml;ndesch&uuml;tteln mit Steve Case beim Fototermin, einige Minuten
Small-talk, dann goodbye! beschreibt das Magazin Capital kurz darauf eine
Begegnung zwischen dem Vorstandsvorsitzenden des weltweit f&uuml;hrenden
Internet-Konzerns und dessen Werbe-Onkel. </p>

<p>F&uuml;r AOL-Deutschland habe der Spot mit Becker im Schlafrock 500000
neue User gebracht, hie&szlig; es schwammig, der Bekanntheitsgrad von AOL
sei von 77 Prozent auf satte 85 Prozent gestiegen. Best&auml;tigt wurde
diese Zahl nie. Jedenfalls nicht von den AOL-Chefs. Deren Konkurrent Peter
W&uuml;rtenberger (Yahoo!) glaubt, dass Bin ich schon drin, oder was? dem
Unternehmen AOL kaum neue Nutzer brachte, stattdessen aber das
Internet-Image von BB erfand. So gesehen habe eher AOL Werbung f&uuml;r
Becker gemacht als umgekehrt. Sch&ouml;n f&uuml;r den Mann, der f&uuml;r
seinen Werbeeinsatz noch ein erhebliches Aktienp&auml;ckchen kassiert hat.
</p>

<p>Klar ist, Becker wurde durch den Spot zum Synonym f&uuml;r das Internet,
sagt Ex-RTL-Chef Helmut Thoma. Heute muss sich Becker nur beim Super-Bowl
in Atlanta mit den Sport-Ikonen Wayne Gretzky (Eishockey), John Elway
(Football) und Michael Jordan (Basketball) treffen, schon spekulieren alle,
er bastele an einer Beteiligung an deren Internet-Sportkaufhaus (www.
mvp.com). Dabei ist das Bl&ouml;dsinn. Wenn ein Boris Becker Interesse an
einem Internet-Kaufhaus hat, dann macht er das selbst. </p>

<p>Als Gesch&auml;ftsmann Becker im Juli mit der Basketball-Legende Magic
Johnson und den Schauspielern Salma Hayek und Antonio Banderas den Start
des amerikanischen Internet-Providers AOL in S&uuml;damerika umrankte,
erkl&auml;rte er anschlie&szlig;end in einer Pressekonferenz, er gehe im
Herbst selbst an die B&ouml;rse. Hochinteressant, fanden die Journalisten.
Einer fragte: Womit denn? Das irritierte Mister Becker nur einen blonden
Wimpernschlag lang: Mit meinem Namen. </p>

<p>&Uuml;ber so viel Chuzpe lachen B&ouml;rsenprofis nat&uuml;rlich, aber
man muss Beckers selbstbewusste Naivit&auml;t auch verstehen. Anfang des
Jahres feierte der Verleger Hubert Burda (Focus, Bunte) in M&uuml;nchen
seinen 60. Geburtstag. Anwesend war die Creme der Deutschen Wirtschaft.
Blue Chips wie Heinrich von Pierer (Siemens), J&uuml;rgen Schrempp
(DaimlerChrysler) und Hilmar Kopper (Deutsche Bank) waren im Smoking
angetreten, Leo Kirch, EM-TV-Chef Thomas Haffa, der Filmproduzent Arthur
Cohn. Aber erst als die Beckers den Kaisersaal der Residenz betreten
h&auml;tten, so erz&auml;hlt ein Beobachter, sei die Sonne aufgegangen, ein
Raunen im Saal: Hier kommt das First Couple, die Clintons aus Bogenhausen.
</p>

<p>Selbst Barbara Becker, die den Society-Rummel so perfekt beherrscht,
staunt nach acht Jahren Ehe noch immer &uuml;ber die Pr&auml;senz ihres
sch&ouml;nen Manns: Boah, denke ich, wenn er nur zwei Tage weg war,
boah, ist der toll! Auch wenn er jetzt nicht mehr im Jogging-Anzug
aus dem Haus ginge, so sei er doch noch genau so locker drauf wie
fr&uuml;her, schw&auml;rmt sie. Nur eines habe sich ge&auml;ndert, seit ihr
Mann von der Tennis in die Gesch&auml;ftswelt geflutscht sei: Ich
klatsche nicht mehr, wenn er in den Raum kommt. </p>

<p>Dieser Boris. Nie sind Charisma und Kohle sch&ouml;ner zusammengekommen
als bei ihm, dem letzten Helden der Deutschen. Er ist und bleibt der
gro&szlig;e Sympathietr&auml;ger, ob er sich die Anz&uuml;ge von Armani
sponsern l&auml;sst oder nicht. Ob er stottert, wenn er versucht, einen
geraden Satz herauszubringen, oder nicht. Ob er mit Edmund Stoiber flirtet
oder nicht. Aber l&auml;ngst nicht mehr alle verg&ouml;ttern das Idol. Die
S&uuml;ddeutsche Zeitung geht hart mit ihm ins Gericht. Unter der
&Uuml;berschrift Drin ohne Sinn schreibt Tobias Kniebe am 14.
September im Feuilleton: Der neuen Info-Elite steht ein
Lumpenproletariat des Informationszeitalters gegen&uuml;ber. Aber gerade
nicht die Totalverweigerer, die grunds&auml;tzlich keine Internet-Aktien
kaufen. Die sind in ihrer stillen Gen&uuml;gsamkeit am Ende noch fein
heraus. Die wirklich Ahnungslosen sind die, die erst j&uuml;ngst
dazugekommen sind, &uuml;berall noch mitreden und mitverdienen wollen und
doch rein gar nichts verstanden haben. Ihr Anf&uuml;hrer, Held und
Ph&auml;notyp ist Boris Becker. Seit gestern erst drin, plant er heute
schon selbst einen B&ouml;rsengang. Warum, mit wem und zu welchem Zweck
auch immer. </p>

<p>Ich bin drin! Es war im Sommer 2000 auf dem Boot des Fernseh-Machers
Thomas Haffa, im Hafen von Monte Carlo: Wos willst eigentlich mit deinem
Brand mach'n? fragte Hans Mahr, RTL-Chefredakteur und &Ouml;sterreicher. Da
seien sie auf die Idee mit der Moderation gekommen. Denn: Boris Becker, das
ist ein internationales Trademark wie Coca-Cola, sagt Mahr, der steigt in
Santiago aus dem Auto und muss Autogramme geben, und a Stund sp&auml;ter in
Wladiwostock das Gleiche. Im M&uuml;nchner Restaurant Glockenbach
h&auml;tten sie den Fernseh-Deal sp&auml;ter mit einigen Schn&auml;psen
konkretisiert, so Mahr. Ich brauch von ihm den Glamour, das Door-opening,
das ganz pers&ouml;nliche Know-how. Es sei doch absurd, einen Becker die
Viererabwehrkette erkl&auml;ren zu lassen. Ein Boris Becker geht erst dann
auf den Sender, wenn das Konzept stimmig ist, sagt Herr L&uuml;benoff. </p>

<p>Ich bin keine nationale Gr&ouml;&szlig;e, sondern einer der
bekanntesten Menschen der Welt, hat Becker einmal bescheiden erkannt, und
nun arbeite er eben daran, die Marke BB in Eigenregie zu positionieren.
Doll, staunt die FAZ: Er hat sich schon als Tennisspieler stets als
Unternehmer betrachtet. Daran hat sich nach dem R&uuml;cktritt nichts
ge&auml;ndert, nur die L&auml;nge der Hosen. </p>

<p>Stimmt! Als andere deutsche Tennisstars noch mit Nudeln und Deosticks
rummachten, sa&szlig; Becker schon bei Mercedes im Trockenen. Michael Stich
glaubte an Jessica und Becker an die Deutsche Bank. Als andere sich noch
von Papi am Nasenring durch die Tenniswelt f&uuml;hren lie&szlig;en,
wechselte Boris seine Manager, Trainer und Partner nach Tageslaune. Und
Beckers Papi bewachte derweil die Autoh&auml;user wie auch die Immobilien,
die der Filius sich auf den Tennispl&auml;tzen der Welt
zusammengeschmettert hatte. </p>

<p>Nie hat der es in seiner Karriere vers&auml;umt, zugleich an seinem
charismatischen Image zu basteln. Mit Karen in der Hamburger
Hafenstra&szlig;e, mit Benedicte beim Papst, mit Babs schlie&szlig;lich im
Schnellboot vor Miami, im Standesamt, im Krei&szlig;saal. </p>

<p>Mit Santana hat er gefeiert, mit Elton John und mit Diana. Nein, so
elegant wie Kaiser Franz Beckenbauer mag er als Sportler vielleicht nie
gewesen sein. Immer viel lauter, unb&auml;ndiger, unberechenbarer und
unrasierter. Einer, der einfach mal nach dem Match aus dem Stadion rennt
oder verk&uuml;ndet, sein Traum sei es, Taxifahrer in New York zu sein. Er
habe das moderne Angriffstennis erfunden, sagen seine Fans, nie auf Nummer
sicher gespielt, immer high risk, mit 199,5 und mehr
Stundenkilometern draufgehauen. Und so ungef&auml;hr versucht er es auch
heute im modernen Angriffs-Business: riskanter Aufschlag und gleich an die
B&ouml;rse. &Auml;h&auml;h&auml;h. Becker.de manchmal schl&auml;gt
er dabei auch ins Aus. </p>

<p>Im vergangenen Jahr scheiterte der Azubi am Neuen Markt
(Spiegel) mit dem Versuch, aus den ATP-Turnieren eine Art Tenniszirkus nach
Formel-1-Rezept zu machen. Plausibel erschienen den Turnierdirektoren zwar
die Konzepte des Entrepreneurs f&uuml;r die Vermarktung des Herren-Tennis.
Auch die Aussicht, das Ganze ins Bezahl-fernsehen von Leo Kirch zu stellen,
fanden sie reizvoll. Leider aber entschieden sich die Turnier-Direktoren
dann doch f&uuml;r das Angebot der Schweizer Sportagentur ISL. Die zahlte
1,2 Milliarden Dollar. BB hatte 300 Millionen geboten. </p>

<p>Nach den Olympischen Spielen wird Herr Becker auch vom Partner
DaimlerChrysler gestutzt werden. Das von ihm gef&uuml;hrte, mit Millionen
subventionierte und traurig vor sich hin ploppende
Mercedes-Benz-Junior-Team soll dann n&auml;mlich an den Deutschen Tennis
Bund angebunden werden. Sportlicher Leiter darf sich Becker
dann zwar noch nennen, aber das Sichten neuer Talente wird man ihm wohl
nicht mehr &uuml;berlassen. Eine gl&uuml;ckliche Hand hatte er n&auml;mlich
nicht beim Kobern, auch keine Zeit, sich um die Sch&uuml;tzlinge zu
k&uuml;mmern. Sein Faible f&uuml;r einen 15-J&auml;hrigen endete im
Rausschmiss. Der Baby-Baller hatte sich mit Diebst&auml;hlen hervorgetan
und damit, dass er anderen Prostituierte auf die Hotelzimmer bestellte.
Heute hei&szlig;t es bei DaimlerChrysler, Becker m&uuml;sse aufpassen, dass
er nicht &uuml;berzieht. Hybris und Charisma, falle manchem
ein, wenn er an das Bobele von einst denkt. </p>

<p>Aber was soll's? Gerade ist er mit Paulus Neef von Pixelpark, mit Helmut
Thoma und Manfred von Richthofen vom Deutschen Sportbund in ein Boot
gestiegen, das Sportgate hei&szlig;t. Eine Art
Internet-Vergn&uuml;gungsdampfer f&uuml;r Sportinteressierte soll das sein.
Dressurreiter sollen dereinst dort die Pirouetten und Piaffen aller
Turniere sehen k&ouml;nnen, die ihnen das Fernsehen am Wochenende verwehrt.
Segler ihre Regatten und Minigolfer wie Finanzminister Hans Eichel die
sch&ouml;nsten Pl&auml;tze f&uuml;rs Kleingolf. </p>

<p><img src="onl_max3.jpg" align=left hspace=6>
Welt-Weit-Wichtig-Becker soll dabei wieder einmal junge Menschen an die
Computer locken, seine blauen Augen in die Kameras halten, internationale
Kontakte machen. Mandela, Schr&ouml;der, Muhammad Ali. Ob das Geld bringt,
wei&szlig; heute noch kein Mensch. Doch Helmut Thoma, der
Vorstandsvorsitzende von Sportgate und Hobbytaucher, ist zuversichtlich,
denn noch nie habe die Vorstellung eines Dot-Coms in Deutschland so viel
Aufmerksamkeit erregt, sagt er. Das Spielgeld, das bis zum angepeilten
B&ouml;rsengang im Jahr 2002 verdaddelt werden darf, komme von Neefs Firma
Pixelpark, also von Bertelsmann, dem Mutterhaus. Und mit ein paar
Prozentchen sei auch Becker an Sportgate beteiligt. Am Risiko wohl eher
nicht. </p>

<p>Im Oktober - das Becker-Management hat viel f&uuml;r den Herbst geplant
- soll, geheim, geheim, endlich auch die dritte Stufe der AOL-Werbung
gez&uuml;ndet werden. Da wird er noch einmal abgehen, unser Internet-Held,
wie Indiana Jones. Wenn ein Boris Becker eine solche Kampagne macht,
erkl&auml;rt Herr L&uuml;benoff, dann nat&uuml;rlich nur als strategischer
Partner von AOL. Klar, kein Mensch denkt, dass ein Boris Becker einfach nur
arbeitet oder rummanagt. </p>

<p>Beim Pr&auml;sidenten-Bankett neulich zu Ehren von Jacques Chirac, auf
Schloss Bellevue, ist der FAZ-Kolumnistin Gloria von Thurn und Taxis etwas
Merkw&uuml;rdiges aufgefallen. Der p&auml;pstliche Nuntius, Erzbischof
Giovanni Lajolo, schreibt sie, sei auch da gewesen. Barbara Becker wollte
ihm vorgestellt werden. Und Boris, der nat&uuml;rlich wusste, wer er war,
hat ihn sogleich um einen Segen gebeten. Barbara wollte auch gesegnet
werden, und als Werner Spiess, der Direktor des Centre Pompidou, das sah,
wollte er auch gesegnet werden. Und da er schon einmal dabei war, schreibt
die Regensburger F&uuml;rstin, schloss ich mich an. </p>

<p>Wahrscheinlich war das Massen-Segnen blo&szlig; der Beginn einer
wunderbaren Internet-Verbindung. Der Grundstein f&uuml;r eine neue,
irdische Becker-Firma, in die Gloria ihr Silber einbringt, der Nuntius den
g&ouml;ttlichen Segen, Spiess ein paar Bilder und Boris die Kontakte -
Mandela, Schr&ouml;der, Ali. Aber wer wei&szlig;, vielleicht ist der
&Uuml;ber-Becker l&auml;ngst auf dem Absprung zu H&ouml;herem. Lieber Gott,
was erwartet uns? </p>

<p> Fragen, Reaktionen? <br>
<a href="mailto:uposche@max.de"><b>uposche@max.de</b></a> </p>

</td></tr></table>

<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr>
<td bgcolor="#a0a0a0">Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td bgcolor="#a0a0a0">E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td bgcolor="#a0a0a0">Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
