<html>
<head>
<!--  Autor = Wolf Zimmer   -->
<title>Muellseite</title>
</head>
<body background="wolf1.gif" text=black link=blue bgcolor=gray>
<br>
<p align="center"><font color="#000080" size="7">
<b>Awards</font></b>

<table border="0" width="100%" cellpadding=8>
<tr><td>
<hr color="#800000">
<p><font size="+1"><b>TOMORROW Online gewinnt LeadAward 2000 </font></b></p>

<p>In letzter Zeit hat es sich eingeb&uuml;rgert, Awards zu beantragen und auch
zu erhalten, weil viele von der irrigen Annahme ausgehen, Awards seien
Qualit&auml;tssiegel, die ihre Homepage aus dem &uuml;brigen Angebot im Netz
hervorheben. Teilweise sind sie es, aber ein Gro&szlig;teil, man kann schon
sagen, fast alle Awards, die f&uuml;r Privatuser vergeben werden, sind
Reklamelinks. Es gibt auch "echte" Awards, die werden verliehen ohne
dass man sich darum bem&uuml;ht, bzw man kann sich im Rahmen eines Wettbewerbs
bem&uuml;hen, sie aber nicht beantragen. Dazu geh&ouml;rt der LeadAwards. Den k&ouml;nnen
aber Privatleute ebenso wenig erhalten, wie ein Kraftfahrer, der nur
Filmrollen transportiert, einen Oscar verliehen bekommen wird. </p>

<p><img src="onl_awards.jpg" width="335" height="231" align=left hspace=6>
TOMORROW Online gewinnt den LeadAward 2000 der Akademie Bildsprache als
bestes General-Interest-Angebot. </p>

<p> Die in diesem Jahr zum zehnten Mal
verliehenen "LeadAwards" gelten als die renommierteste und kritischste
Pr&uuml;fung der deutschen Zeitschriftenlandschaft unter gestalterischen und
optischen Gesichtspunkten. Preise wurden in 14 Kategorien vergeben. In
diesem Jahr wurde der Wettbewerb, der sich bislang auf die Bereiche Print
und Werbung beschr&auml;nkte, zum ersten Mal um Online-Angebote erweitert. Hier
wurden Preise in vier Kategorien vergeben:<br clear=all>
<ul><li>TOMORROW Online gewinnt als bestes General-Interest-Angebot</li><br>
<li>www.max.de als bestes Online-Magazin</li><br>
<li>SPIEGEL ONLINE als bestes Nachrichtenangebot</li><br>
<li>Wallstreet Online als bestes Special-Interest-Angebot</li><br></ul>
Zur 13-k&ouml;pfigen Jury geh&ouml;rten unter anderem Lo Breier (Gesch&auml;ftsf&uuml;hrer
P.GmbH), Andrew Gowers (Chefredakteur FTD Deutschland), Dirk Linke (Art
Director), Werner Lippert (Gesch&auml;ftsf&uuml;hrer Projects Corporate Culture
Consultants), Willy Loderhose (Chefredakteur TOMORROW) sowie Prof. Peter
Wippermann (Gesch&auml;ftsf&uuml;hrer Trendb&uuml;ro).
<hr color="#800000"></p>

<p><font size="+1"><b>Microsoft-Chef zeichnet Web-Auftritt von Schulen
aus</font></b></p>

<p>Microsoft-Chef Steve Ballmer hat am Mittwoch die Internet-Seiten von
vier Schulen mit dem &raquo;Road Ahead Prize 2000&laquo; ausgezeichnet.
</p>

<p>Die besten Nachwuchs-Webdesigner kommen demnach vom Gymnasium Ernestinum
im nieders&auml;chsischen Rinteln. Platz zwei belegte das Gymnasium
Laurentianum aus Warendorf in Nordrhein-Westfalen. Beide Schulen
k&uuml;mmern sich in ihren Auftritten um den verantwortungsvollen Umgang
mit der Deutschen Geschichte. </p>

<p>Der dritte Platz ging an die K&auml;the-Kollwitz-Oberschule aus Berlin.
Einen Sonderpreis bekam die Hermann-Gmeiner-Grundschule aus Bergheim bei
K&ouml;ln.</p>

<p>An dem Wettbewerb um die mit insgesamt 60.000 Mark dotierte Auszeichnung
hatten sich nach Angaben des Unternehmens rund 450 Schulen aus ganz
Deutschland mit ihren Internet-Seiten beteiligt. (dpa)
<hr color="#800000"></p>
</td></tr></table></p>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr>
<td bgcolor="#a0a0a0">Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td bgcolor="#a0a0a0">E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td bgcolor="#a0a0a0">Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
