<html>
<head>
<!--  Autor = Wolf Zimmer   -->
<title>Muellseite</title>
</head>
<body background="wolf1.gif" text=black link=blue bgcolor=gray>
<br><font size="-1">
Es ist empfehlenswert, den linken Frame <a href="onl_muell.html" target="_top">
<b>auszublenden </font></a></b>
<p align="center"><font color="#000080" size="7">
<b>www.muellseite.de</font></b><hr color="#800000"></p>

<table border="0" width="100%">
<tr><td>
<p>Diese Seite prangert andere an - und ist selbst so ziemlich das D&uuml;rftigste und
Langweiligste, was das Netz zu bieten hat. Denn wer auf andere zeigt, sollte
wissen, was guter Geschmack ist. </p>
<p>Wenn ihr euch gleich die Seite &uuml;ber den folgenden Link anschauen wollt und ihr
m&ouml;chtet aber den linken Frame der NoCover erhalten, dann kehrt bitte durch
Bet&auml;tigen des Retour-Schalters des Browser hierher zur&uuml;ck und nicht &uuml;ber den
Link am Ende der M&uuml;ll-Seite.
<br>
<center><font size=+1><a href="onl_muell1.html" target="_top">
<b>www.muellseite.de</font></a></b></center><br>
Die Seite wurde so belassen wie im Original, nur die Images wurden umbenannt. Die
Ersteller sagen &uuml;ber sich selbst:
<blockquote><i><b><font color="#006000">
Die Endg&uuml;ltige M&uuml;llseite wird erstellt von einem hochkar&auml;tig
besetzten Expertengremium des "Vorl&auml;ufigen Komitees f&uuml;r
&Auml;sthetik- und Weltbild-Kontrolle in der Datenverarbeitung / Deutsche
Sektion" (VK&Auml;WBKDV/DS). <p> Dem Gremium geh&ouml;ren wichtige
Vertreter/innen aus Politik und Industrie, der Publizistik, dem
Wissenschaftsbetrieb sowie der internationalen Kulturkritik an. Derzeit
sind dies f&uuml;hrende K&ouml;pfe des Personenbef&ouml;rderungsgewerbes,
der Schaustellerei und Marktbeschickung, der B&auml;cker- und
Konditoren-Fachzeitschriften sowie weitere namhafte Personen, die sich
ebenfalls und ausschliesslich mit schwerkulturellen Fragen
besch&auml;ftigen. </font></i></b>
</blockquote>
Ganz ehrlich, vielleicht bin ich doch schon zu alt, um jede versteckte Ironie
richtig deuten zu k&ouml;nnen. Um noch etwas mehr als die Startseite zu zeigen, habe ich
die Seite <a href="onl_muell1a.html" target="_top"><b>16/00 </b></a>auserkoren. Alle Seiten sind
nach dem gleichen Schema und Outfit aufgebaut. Warum M&uuml;ll immer undefinierbar "braun"
sein muss?
<center>
<table border="0" bgcolor="#333333" width=90% cellpadding=8>

<tr>
<td>
<center>
<br><font size="5" color="#C6AD52"><b>Ein Award f&uuml;r<br>Ihre Seite im Internet</b></font>
<br><br>
<font color="#ffffff">
<b>Noch kein Award f&uuml;r Ihre Seite ?<br>Kein Problem !<br>Nehmen Sie diesen hier !</b>
<p>
<img border=0 src="onl_muell1s.gif" width=120 heigth=120 alt="Golden WebSite Award (3,2 KB)">
</center>
<br><br>
Mit diesen Awards ist es wirklich &auml;rgerlich. Die meisten von ihnen
werden willk&uuml;rlich, nach dubiosen Kriterien oder aus Gef&auml;lligkeit
verteilt. Und dann gibt es noch die Awards, die niemand so recht haben
will.
<p>
<b>Nicht mit uns !</b>
<p>
Der <b>Golden WebSite Award</b> ist der erste Award, den jede Webseite bekommen kann.
<p>
Die Vergabekriterien sind denkbar leicht zu erf&uuml;llen. Beantworten Sie
hierzu einfach nur folgende Fragen:

<ul>
<li type=square>Haben Sie eine eigene Seite im Internet ?</li>
<li type=square>Hat diese Seite nach Ihrer Meinung einen Award verdient ?</li>
<li type=square>Sind Sie in der Lage, den unten aufgef&uuml;hrten HTLM-Code
    zu kopieren und in Ihre Seite aufzunehmen ?</li>
</ul>
<br>
Falls Sie dreimal mit "Ja" geantwortet haben, geh&ouml;rt der Golden
WebSite Award jetzt bereits Ihnen.
<br><br>
Kopieren Sie anschliessend den nachfolgend aufgef&uuml;hrten HTML-Code, und
binden Sie ihn dann in Ihre Seitenbeschreibung ein. Nat&uuml;rlich verdient
das gute St&uuml;ck den besten Platz auf Ihrer Seite.
<p>
&lt;a href="http://muellseite.de" target="_top"&gt;&lt;img
src="http://muellseite.de/gwsa.gif" alt="golden website award (3,2 kb)"
height="120" width="120" border=0&gt;&lt;/a&gt;
<p>
Theoretisch k&auml;me auch in Frage, nur einen Teil des HTML-Codes zu
&uuml;bertragen oder die Award-Grafik herunterzuladen und diese dann auf
anderem Weg in Ihre Seite zu integrieren. Wegen der damit verbundenen
unkalkulierbaren Risiken - und weil wir nat&uuml;rlich keine
M&ouml;glichkeit auslassen, Werbung in eigener Sache zu betreiben - raten
wir aber dringend von diesen beiden Verfahren ab. </font>
</td>
</tr>
</table>
<br><b><font size=+1>
Soll ich da nun noch ein Wort darüber verlieren? </font></b>
</td></tr></table>
<hr color="#800000">
<a href="NoCover.html" target="_top"> Zur&uuml;ck zur NoCover </a>
<font size="-1">Falls linker Frame nicht mehr vorhanden. </font>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr>
<td bgcolor="#a0a0a0">Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td bgcolor="#a0a0a0">E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td bgcolor="#a0a0a0">Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
