<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Bill McEwen trifft sich mit Amiga-Usergroups</H2>
<P>
Am Samstag, den 1. April 2000 traf sich bei der Amiga-2k-Show in Saint
Louis Bill McEwen, Pr&auml;sident von Amiga, mit einer Gruppe
offizieller Mitglieder aus Amiga-User-Gruppen. Das Treffen war vom
Users Group Network (UGN = Anwendergruppen-Netz) organisiert worden.
Der vollst&auml;ndige Text ist unter <A HREF="http://www.io.com/~joeobrin/A2KUGN.html" TARGET="_top">http://www.io.com/~joeobrin/A2KUGN.html</A> zu
lesen.
</P>
<P>
Es folgen Ausz&uuml;ge aus den Aussagen von Bill McEwen bei diesem Treffen,
haupts&auml;chlich in Bezug auf die Lage und Zukunft von Amiga. Dabei gab sich
McEwen offen, ehrlich und optimistisch.
</P>
<P>
Die Aussagen selbst sind zum Teil noch unbest&auml;tigt.
</P>
<P>
McEwen sprach dar&uuml;ber, dass Fletcher Haug, fr&uuml;her beim &quot;Amiga Informer&quot;
und beim &quot;Amazing Amiga&quot; nun der Redakteur der &quot;Amiga World&quot; ist. Es ist
nicht die Vielen bekannte &quot;Amiga World&quot; von IDG Communications, sondern
diese Mitteilungen werden die offiziellen Ver&ouml;ffentlichungen der Amiga
Company enthalten. Sie wird sich auf Fakten konzentrieren und keine
Ger&uuml;chte verbreiten. Besonders wird sie Amiga dazu dienen, offiziell
Produkte und Pl&auml;ne bekannt zu geben, aber nicht, um z.B. Tutorials zu
ver&ouml;ffentlichen.
</P>
<P>
Wenn diese Funktion nicht mehr so dringend ben&ouml;tigt wird, werden die
Mitteilungen sich auf die Bed&uuml;rfnisse der au&szlig;en stehenden Entwickler
konzentrieren.
</P>
<P>
&quot;Amiga World&quot; soll &uuml;ber die User-Gruppen und mit jedem verkauften Amiga
verteilt werden. Sie wird online sowohl im HTML- wie auch im druckbaren
Format erh&auml;ltlich sein. Eine Liste aller anderen Amiga-Magazine wird
enthalten sein. &quot;Amiga World&quot; wird nicht mit existierenden Magazinen
konkurrieren, sondern diesen erm&ouml;glichen, nach offiziellen Mitteilungen
wesentlich umfangreichere Einzelheiten dar&uuml;ber zu ver&ouml;ffentlichen.
</P>
<P>
Zwei kleine Brauereien bewerben sich um das Recht, &quot;Boing-Bier&quot;
herstellen zu d&uuml;rfen.
</P>
<P>
Auf die Bitte um M&ouml;glichkeiten, durch finanzielle Unterst&uuml;tzung User-
Gruppen beim &Uuml;berleben zu helfen, zeigt McEwen als Weg an, dass Amiga
Anzeigen in den Klub-Nachrichten plazieren k&ouml;nnte. Er empfahl den
interessierten Redakteuren, eine eMail an <A HREF="mailto:kari@amiga.com">kari@amiga.com</A> mit dem Betreff
&quot;Advertising Request&quot; zu senden. Kari (Anm.d.&Uuml;.: Kari Erickson -
Executive Administration) stellt die Verbindung zu den User-Gruppen
her.
</P>
<P>
Innerhalb eines Vierteljahres soll Amiga 76 Mitarbeiter haben.
</P>
<P>
Das Entwickler-System soll zu einem Preis von $750 (ausschlie&szlig;lich
Monitor) verkauft werden, was unter Amigas Produktionskosten liegt.
</P>
<P>
McEwen erw&auml;hnte kurz, dass Amiga auch bereit ist, Jugend-Sportgruppen
zusammen mit &ouml;rtlichen User-Gruppen zu unterst&uuml;tzen. (Siehe auch: Amiga
aktuell 04/2000 ...AMIGA sponsort Fu&szlig;ballteam ...)
</P>
<P>
Er versprach, etwa im Juni/Juli eine &quot;User-Gruppen-Tour&quot; zu
unternehmen. Ein hochrangiger Vertreter von Amiga, m&ouml;glicherweise
McEwen, Fleecy oder Randy Hughes wird jede der &ouml;rtlichen (local)
User-Gruppen besuchen. (Anm.d.&Uuml;.: Es ist nicht erkenntlich, auf welchen
Bereich sich dieses &quot;local&quot; bezieht.)
</P>
<P>
In Zusammenarbeit mit den H&auml;ndlern will Amiga den A1200 zum Preis von
200 Dollar verkaufen. Ungl&uuml;cklicherweise existieren f&uuml;r diesen Rechner
keine Entwicklerdaten mehr. Wenn der Vorrat an A1200 verkauft ist, wird
es keine neuen mehr geben. 17 000 Ger&auml;te sind noch am Lager, aber nur
1000 sind NTSC.
</P>
<P>
Mit dem Preis von $200 verliert Amiga Geld, aber die Gemeinschaft soll
so stark wie m&ouml;glich gehalten werden. Ein A1200 mit PPC-Beschleuniger
kann mit dem neuen Amiga-OS laufen.
</P>
<P>
McEwen sprach auch &uuml;ber den Mangel an PPC-Beschleunigern. Amiga
arbeitet eng mit MetaBox zusammen, um neue AmiJoe-PPC-Beschleuniger f&uuml;r
den A1200 zu fertigen und dass dieser Beschleuniger mit dem neuen OS
laufen kann. Amiga bem&uuml;ht sich mit MetaBox, einen Preis f&uuml;r den
Beschleuniger unter $200 zu erreichen. Amiga arbeitet wo immer m&ouml;glich
mit Entwicklern auf dritter Seite zusammen, um die Kosten zu dr&uuml;cken.
</P>
<P>
Amiga kooperiert auch eng mit DCE, die die Rechte erwarben, die alten
Entwicklungen von Phase5 weiter zu fertigen. Es ist sicher, dass der
DCE-Beschleuniger mit dem neuen OS arbeiten kann.
</P>
<P>
Wegen der Lage bei den Amiga-Custom-Chips und dem zu erwartenden
Erscheinen neuer Maschinen wird Amiga keine Entwicklung auf der
jetzigen Grundlage mehr durchf&uuml;hren. Aber ein richtig beschleunigter
klassischer Amiga kann mit dem neuen Betriebsystem verwendet werden.
Der Hauptgrund daf&uuml;r, dass das neue OS nicht auf einem 68k laufen wird,
besteht darin, dass Motorola ein Investor bei Tao, Amigas OS-Partner,
ist. Motorola bem&uuml;ht sich, alle seine Kunden von der
68k-Prozessor-Familie abzuziehen und hat Tao veranlasst, ihr OS nicht
f&uuml;r den 68k zu entwickeln.
</P>
<P>
Inoffiziell soll der neue Amiga zum Ende des Sommers 2000 erh&auml;ltlich
sein. Es ist die Zielvorstellung, bei seinem Erscheinen mehr Programme
zur Verf&uuml;gung zu haben als jede andere Rechner-Plattform bei ihrem
Auftritt in der Vergangenheit. Zum Ende des Jahres sollen 127 Programme
f&uuml;r die neue Maschine ver&ouml;ffentlicht sein.
</P>
<P>
McEwen sagte, dass bei der Ank&uuml;ndigung von Suns Partnerschaft mit
Amiga beinahe ein Video mit McNealy (CEO = Chief Executing Officer von
Sun) bereitgestanden h&auml;tte. Das zeigt, wie wichtig Sun die
Zusammnearbeit mit Amiga nimmt.
</P>
<P>
Suns Interesse kann auch in ihrer Mithilfe bei der Herstellung
wichtiger Dokumentationen f&uuml;r die neue Plattform erkannt werden. Wie
schon an anderer Stelle aufgezeigt, wird Java ein Markstein f&uuml;r die
Architektur des neuen Amiga sein. Leute, die an der Java-Entwicklung
beim neuen Amiga interessiert sind, werden sich bald Literatur
beschaffen k&ouml;nnen, die zusammen mit Sun und IDG erstellt wurde.
</P>
<P>
Au&szlig;erdem hat Sun zwei Teilnehmerkarten f&uuml;r die Java1, eine Entwickler-
Konferenz, die in diesem Sommer stattfindet, gestiftet. Diese Karten
werden, wahrscheinlich &uuml;ber die User-Gruppen, in der Amiga-Gemeinschaft
verlost werden. Jede Karte hat einen Wert um $3500.
</P>
<P>
Sun versucht auch den Kontakt ihrer &ouml;rtlichen Repr&auml;sentanten zu Amiga-
User-Gruppen zu vermitteln. Und wie Sun sollen auch Red Hat und Corel
bereit sein, ihre Zusammenarbeit als Amigas Partner zu erkl&auml;ren.
</P>
<P>
F&uuml;r den neuen Amiga wird Scala zur Verf&uuml;gung stehen, ebenso wie Real
Audio, Video und jukebox. Zum Zeitpunkt der Freigabe der neuen Maschine
werden auch Quicktime und andere Multimediaformate als fertig erwartet.
</P>
<P>
Jim Collas hat, um Ihre Neugier zu befriedigen, einen technologischen
Brutkasten an der Westk&uuml;ste, der in keinem Zusammenhang mit Amiga
steht. Bei seinen Partner in diesem Betrieb sind einige, mit denen er
bei Gateway zusammen arbeitete. Zur Zeit ist Collas in *keiner* Weise
mit Amiga verbunden.
</P>
<P>
McEwen gab an, dass er nie einen Wordprozessor oder irgend ein anderes
Anwendungsprogramm machen w&uuml;rde. Er stellte fest, dass Amiga nie in
Konkurrenz mit dritten Amiga-Entwicklern oder der Amiga-Basis treten
w&uuml;rde.
</P>
<P>
McEwen teilte mit, dass er 4,5 Millionen Dollar bezahlt hat, um Amiga
zu kaufen. Dieses Geld wurde spekulativ von Finanzgebern zu Verf&uuml;gung
gestellt, denen nun 30% der Firma geh&ouml;rt. McEwen und seinen Partnern,
Fleecy Moss und Randy Hughes, geh&ouml;ren die &uuml;brigen 70%. Der Wert der
Gesellschaft wurde von Kapital-Analysten auf 250 Millionen Dollar
angesetzt.
</P>
<P>
Auf die Frage, ob diese Pl&auml;ne innerhalb der Gemeinschaft vertraulich
behandelt werden sollten, wie es jemand w&uuml;nschte, der vor Kurzem am
Ruder von Amiga stand, wobei die Frage tats&auml;chlich unsere Sorge wegen
Microsoft betraf, antwortete er: &quot;Ich habe keine Sorgen wegen
Microsoft. Microsoft ist keine Konkurrenz f&uuml;r uns. Wir werden ein
Betriebssystem haben, das auf Allem, vom Handy bis zu einem Server,
laufen kann. Niemand sonst hat so etwas.&quot; McEwen deutete an, dass
Cisco, deren einziges Produkt Internet-Routers sind, heute nach Stand
der ausgegebenen Aktien mehr wert ist als Microsoft. Dies zeige, dass
der PC auf dem absteigenden Ast ist und dass die Zukunft in der
Zusammenf&uuml;hrung von Ger&auml;ten besteht.
</P>
<P>
McEwen sagte zum Schluss, dass jene, die seit langem mit dem Amiga
waren, verst&uuml;nden, was h&auml;tte sein k&ouml;nnen. Und deshalb sind sie
immer noch wertvoll beim Fortschritt des Amiga. Er und seine Partner
seien die ersten Eigner von Amiga, die nichts anderes t&auml;ten als Amiga.
Und er entschuldigte sich bei den Anwendern mit Original-Amigas: &quot;Die
ersten Pioniere sind die, welche den Pfeil in den R&uuml;cken bekommen
haben&quot;.
</P>
<P>
Diese Zusammenfassung wurde von Gernod Schomberg erstellt.
(Quelle des Originaltexts: <A HREF="http://www.io.com/~joeobrin/A2KUGN.html" TARGET="_top">http://www.io.com/~joeobrin/A2KUGN.html</A>)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
