<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Neues von AMIGA</H1>
<H2>1. AMIGA gibt Partnerschaft mit Corel Corp. bekannt</H2>
<P><B>AMIGA informiert:</B></P>
<P>
&raquo;Bill McEwen<BR>
Amiga Incorporated<BR>
425.396.5660<BR>
<A HREF="mailto:bill@amiga.com">bill@amiga.com</A><BR>
</P>
<P><B>Zur sofortigen Ver&ouml;ffentlichung</B></P>
<P>
Amigas Verbindung mit Corel ein gro&szlig;er Erfolg!
</P>
<P>
Snoqualmie, WA, April 1, 2000 - Amiga Incorporated ist erfreut, verk&uuml;nden
zu k&ouml;nnen, da&szlig; unsere neue Multimedia-Benutzerschnittstelle bestens
unterst&uuml;tzt wird von Corel LINUX OS und anderen Corel Programmen
einschlie&szlig;lich des neu ver&ouml;ffentlichten WordPerfect Office 2000 f&uuml;r Linux.
</P>
<P>
Amigas Multimedia-Benutzerschnittstelle l&auml;uft extrem glatt und schnell auf
Corel LINUX OS, und die Kompatibilit&auml;t dieser gro&szlig;artigen Produkte gibt
Linux-Entwicklern eine neue und aufregende M&ouml;glichkeit zur Schaffung
ungaublicher Multimediatitel und Spiele f&uuml;r Linux.
</P>
<P>
&quot;Amiga war der Pionier in Multimedia und einfach zu handhabenden
graphischen Benutzeroberfl&auml;chen vor 20 Jahren, und beginnt heute mit der
Wiedereinf&uuml;hrung einer Legende. Der neue Amiga ist Gesch&ouml;pf und und Tr&auml;ger
f&uuml;hrender Technologien und kombiniert diese mit 20 Jahren Erfahrung in
Multimedia-Entwicklungsumgebungen,&quot; sagt Bill McEwen, Pr&auml;sident von Amiga.
&quot;Corel verf&uuml;gt &uuml;ber f&uuml;hrende Produkte in ihren Kategorien, und wir sind
begeistert &uuml;ber ihre Unterst&uuml;tzung f&uuml;r Amigas Zukunft.&quot;
</P>
<P>
&quot;Linux-Entwickler haben jetzt die Wahl, wenn es um f&uuml;hrende Applikationen
geht,&quot; f&uuml;gt McEwen hinzu.
</P>
<P>
&quot;Corel investiert gro&szlig;e Resourcen in die Entwicklung von Linux, und eine so
positive Best&auml;tigung auf Grund von Amigas Erfahrung mit unseren Produkten
zu erhalten ist gewaltig,&quot; sagt Dr. Michael Cowpland, Pr&auml;sident von Corel
Corporation. &quot;Corel ist stolz darauf, Qualit&auml;tsprodukte zu herzustellen,
und wir sind zittern vor Erregung, unser Corel LINUX OS f&uuml;r Amigas
Weltklasseprodukte zur Verf&uuml;gung zu stellen. Wir freuen uns darauf, mit
Amiga zusammen zu arbeiten an der Entwicklung von Produkten und
Technologien f&uuml;r jetzige und k&uuml;nftige Computer und andere Ger&auml;te, die das
Computer und das Internet zu einem nat&uuml;rlichen Teil des t&auml;glichen Lebens
machen werden.&quot;
</P>
<P>
Corel und Amiga k&uuml;ndigten ihre enge Zusammenarbeit zur St&uuml;tzung des neuen
Amiga Operating Environment erstmals im Juli 1999 an. Die beiden Firmen
formten eine neue Beziehung um sicherzustellen, da&szlig; Corels preisgekr&ouml;nte
Software auf Amigas neuer Produktlinie laufen wird. Corel und Amiga reden
weiter &uuml;ber k&uuml;nftige M&ouml;glichkeiten der Zusammenarbeit.
</P>
<P>
Es wird volle Unterst&uuml;tzung f&uuml;r die installierte Basis bei Amiga-Anwendern
geben, und weitere Ank&uuml;ndigungen werden folgen &uuml;ber heutige Amigas und die
n&auml;chste Generation dieser Maschinen.
</P>
<P><B>Corel Corporation</B></P>
<P>
Corel Corporation ist ein international anerkannter Entwickler von
preisgekr&ouml;nten Gesch&auml;ftproduktivit&auml;ts-, Graphik- und
Betriebssysteml&ouml;sungen auf Windows, Linux, UNIX, Macintosh und Java. Corel
entwickelt ebenfalls marktf&uuml;hrende Web-basierte L&ouml;sungen, darunter
Applikationen, Inhalte, e-Commerce und Onlinedienste. F&uuml;r Zugang zu diesen
Angeboten und mehr Informationen begeben Sie sich auf www.corel.com oder
www.corelcity.com. Corel ist ans&auml;ssig in Ottawa, Canada. Corel Aktien
werden gehandelt im NASDAQ Aktienmarkt unter dem Symbol CORL und an der
Toronto Stock Exchange B&ouml;rse unter dem Symbol COR.
</P>
<P>
Diese Ver&ouml;ffentlichung enth&auml;lt vorw&auml;rtsgerichtete Behauptungen entsprechend
der Definition dieses Begriffs im Gesetz &quot;United States Private Securities
Litigation Reform Act&quot; von 1995. Diese Behauptungen ruhen auf derzeitigen
Erwartungen, die Risiken und Ungewi&szlig;heiten unterliegen. Tats&auml;chliche
Ergebnisse werden davon abweichen auf Grund von Faktoren wie
Verschiebungen der Kundennachfrage, Lieferterminen,
Produktzusammensetzung, konkurrierenden Produkten und Preisen, technischen
Verschiebungen und anderen Unw&auml;gbarkeiten. Leser werden auf Corels jeweils
neueste Berichte an die zust&auml;ndige B&ouml;rsenkommission &quot;Securities and
Exchange Commission&quot; verwiesen.
</P>
<P>
Corel und das &quot;Go further&quot; Logo sind Warenzeichen oder eingetragene
Warenzeichen von Corel Corporation oder Corel Corporation Limited. Linux
ist ein eingetragenes Warenzeichen von Linus Torvalds. Alle anderen
Produkte, Warenzeichen, Schriftarten, Firmennamen und Logos sind
Warenzeichen oder eingetragene Warenzeichen ihrer jeweiligen Eigent&uuml;mer.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
