<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. AMIGA gibt Partnerschaft mit Sun Microsystems Inc. bekannt</H2>
<P><B>AMIGA informiert:</B></P>
<P>
&raquo;Amiga k&uuml;ndigt Plan zur Nutzung von Suns JavaTM-Technologie als
Software-Plattform f&uuml;r kommende neue Amiga-Produkte an.
</P>
<P>
Amiga ist die Heimat einer gro&szlig;en Zahl der weltweit f&uuml;hrenden
Multimedia-Entwickler, K&uuml;nstler und Anwender.
</P>
<P>
Es war immer das Ziel der Amiga-Plattform, die &uuml;berzeugendsten
Multimedia-Titel f&uuml;r Desktop-Computer zu bringen. Die neue Amiga-Plattform
wird diese Tradition auf Desktop-Computern fortsetzen, und sich ebenfalls
an miteinander verbundene digitale Multimedia-Ger&auml;te wie
Internet-Telefone, Digital-TV und WebPads richten. Jetzt k&ouml;nnen die
kreativsten Multimedia-Ingenieure der Welt die JavaTM-Plattform nutzen, um
eine umfangreiche Palette von neuen Produkten und L&ouml;sungen zu erreichen.
</P>
<P>
Die dem Amiga-System zu Grunde liegende Technologie ist eine von Sun
akzeptierte Version von PersonalJava, entwickelt von Tao-Group. Taos
Software ist eine medienreiche Umgebung, die von Grund auf daf&uuml;r entworfen
wurde, auf einer breiten Auswahl von g&uuml;nstigen, in Prozessorleistung und
Speicherkapazit&auml;t eingeschr&auml;nkten Ger&auml;ten mit weitreichenden
Multimedia-F&auml;higkeiten zu funktionieren.
</P>
<P>
In Amigas neuen Zielm&auml;rkten wird die Java-Technologie von mehreren
wichtigen Standardisierungsgruppen aufgegriffen: HAVi, OSGi und DVB sind
drei Beispiele. Amiga nimmt sich der popul&auml;ren Java-Plattform an f&uuml;r
Entwickler von Produkten der neuen Generation, die ebenso auf
Industriestandard-Ger&auml;ten wie Heimnetzwerken und digitalem Fernsehen
genutzt werden k&ouml;nnen. Millionen von Java-Entwicklern werden in die Lage
versetzt, ihre innovativen Inhalte auf einer breiten Auswahl von Produkten
einzusetzen, die die Konsumenten begeistern werden.
</P>
<P>
&quot;Wir sind hocherfreut, einen langj&auml;hrigen Favoriten der
Multimedia-Entwickler die Java-Technologie zur Programmierplattform seiner
Wahl machen zu sehen. Die zutiefst loyale Amiga-Entwicklergemeinde wird in
die Lage versetzt, den Reichtum an Werkzeugen und Unterst&uuml;tzung f&uuml;r
Java-Entwicklungswerkzeuge zu Schaffung neuer, hoch innovativer und
unterhaltsamer Anwendungen zu nutzen. Wir sind ebenfalls erfreut dar&uuml;ber,
da&szlig; Amiga mit Tao zusammenarbeiten wird, einem Unternehmen, welches sich
kompatiblen Implementationen mit medientauglichen F&auml;higkeiten verschrieben
hat&quot;, sagt Curtis Sasaki, Direktor f&uuml;r Produktmarketing in
Konsumententechnologien bei Sun Microsystems, Inc.
</P>
<P>
&quot;Der neue Amiga ist ein frischer Wind f&uuml;r die Industrie, und verf&uuml;gt &uuml;ber
eine Talentreservoir an Entwicklern, die weiterhin die Sch&ouml;pfung
dynamischer Softwareprodukte anf&uuml;hren&quot;, kommentiert Bill McEwen, Pr&auml;sident
von Amiga. &quot;Sun und die Java-Plattform versorgen uns mit hervorragenden
Werkzeugen, einer gro&szlig;en Zahl potentieller neuer Entwickler, einer gut
unterst&uuml;tzten Plattform und Erfahrung in neu entstehenden M&auml;rkten. Die Tao
intentTM Implementation ist einzigartig darin, die Schl&uuml;sseltechnologien zu
liefern, um Java auf mobilen und konsumentenorientierten Produkten zu
betreiben.&quot;
</P>
<P>
Francis Charig, Vorsitzender von Tao Group sagt: &quot;Die Kombination aus der
fortschrittlichsten Gemeinschaft von Multimedia-K&uuml;nstlern und -Ingenieuren
mit dem neuen Software-Industriestandard [Java] ist der nat&uuml;rliche n&auml;chste
Schritt voran. Es ist v&ouml;llig angemessen, da&szlig; Sun, Tao und Amiga eng
zusammenarbeiten, und das Ergebnis wird ein Reichtum an auf Java
Technologie beruhenden Medieninhalten f&uuml;r den Konsumenten und andere
M&auml;rkte sein.&quot;
</P>
<P><B>Hinweise f&uuml;r Redakteure</B></P>
<P><B>Amiga</B></P>
<P>
Amiga widmet sich der Entwicklung, dem Design und der Implementation von
Komponenten, Services und Modellen, die die digitale Erlebniswelt von
morgen tragen. Amiga er&ouml;ffnete die Welt der Multimedia-Erfahrung in den
fr&uuml;hen 80ern, und wird die Welt ins Digital Content Universe der Zukunft
f&uuml;hren.
</P>
<P><B>Tao</B></P>
<P>
Tao Group produziert Software und Ideen f&uuml;r Heim- und Mobilnetze. Gegr&uuml;ndet
1992, verf&uuml;gt die Firma &uuml;ber f&uuml;hrende Produkte f&uuml;r den aufstrebenden Markt
intelligenter Ger&auml;te. Die Firmenphilosophie basiert darauf, den
leistungsf&auml;higen Rahmen f&uuml;r die Nutzung eines breiten Spektrums vernetzter
Ger&auml;te von intelligenten Telefonen bis zum Digitalfernsehen zu bieten, in
den Taos Firmenkunden ihr eigenes Markendesign und zus&auml;tzliche Funktionen
einbauen k&ouml;nnen. Taos Kunden sind unter anderem blue chip
Technologieunternehmen in den USA, Japan und Europa. Motorola und Sony
sind Investoren von Tao Group. Tao ist ans&auml;ssig in Reading, United
Kingdom, mit Vertretungen in Japan und den USA, und die Belegschaft umfa&szlig;t
mehr als f&uuml;nfzig Software-Ingenieure von Weltrang. Tao ist ein Deloitte &amp;
Touche Fast 50 Gewinner und hat eine Reihe von Innovationspreisen gewonnen
f&uuml;r ihr Betriebssystem und ihre JavaTM-Engine.
</P>
<P>
Amiga und AmigaDOS sind Warenzeichen von Amiga Inc. Das Boing Ball Logo,
das Amiga Diamond Logo, und das Amiga Logo sind Warenzeichen von Amiga
Inc. und d&uuml;rfen zu keinem Zweck reproduziert werden. intentTM ist ein
Warenzeichen von Tao Group Limited. Sun, Sun Microsystems und JavaTM sind
Warenzeichen oder eingetragene Warenzeichen von Sun Microsystems, Inc. in
den Vereinigten Staaten (USA) und anderen L&auml;ndern.&laquo;
</P>
<P>
Anmerkung von Gernod Schomberg zu &quot;FAST 50&quot;
(Auszug aus der Pressever&ouml;ffentlichung einer anderen Firma):
</P>
<P>
&raquo;Deloitte &amp; Touche Fast 50 Winner
</P>
<P>
Gesellschaften, die f&uuml;r den Status &quot;Fast 50&quot; ber&uuml;cksichtigt werden sollen,
m&uuml;ssen eine Technologie oder ein Technologie-bezogenes Produkt herstellen,
wobei ein hoher Anteil des Aufwandes der Forschung und der Entwicklung
gewidmet sein mu&szlig;. Der Reihenfolge der Nominierung liegt der prozentuale
Zuwachs des Betriebseinkommens in einer F&uuml;nfjahresperiode zu Grunde, das an
deren Beginn mindestens 50 000 Dollar betragen haben muss.
</P>
<P>
Bob Weaver, Partner der San Diego Technologie-Gruppe Deloitte &amp; Touche,
beschreibt: &quot;Als Fast-50-Gewinner benannt zu werden ist eine Best&auml;tigung
f&uuml;r die herausragende Stellung einer Firma und f&uuml;r ihre F&auml;higkeit, nicht
nur die richtige Entscheidung im richtigen Moment zu treffen, sondern auch
die Weitsicht zu haben, die ein kontinuierliches Wachstum &uuml;ber f&uuml;nf Jahre
gew&auml;hrleistet.&quot;
</P>
<P>
Amiga und AmigaDOS sind Warenzeichen von Amiga Inc. Das Boing-Ball-Logo,
das Amiga-Diamond-Logo und das Amiga-Logo sind Warenzeichen von Amiga Inc.
und d&uuml;rfen nicht reproduziert werden. intent(TM) ist ein Warenzeichen von
Tao Group Limited. Sun, Sun Microsystems, and Java(TM) sind Warenzeichen
oder eingetragene Warenzeichen von Sun Microsystems, Inc. in den
Vereinigten Staaten und anderen L&auml;ndern.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
