<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Neues von Haage &amp; Partner</H2>
<P>
Haage &amp; Partner (<A HREF="http://www.haage-partner.com" TARGET="_top">http://www.haage-partner.com</A>) informiert:
</P>
<P>&raquo;03 Apr 2000: www.classx.it</P>
<P>
Der italienische Videospezialist hat eine neue Internet-Adresse. Mit MoreFX
hat man auch seit einiger Zeit ein neues Produkt im Angebot, da&szlig; komplett
unter Java l&auml;uft und somit auch auf den neuen Amigas laufen sollte.
<A HREF="http://www.classx.it" TARGET="_top">http://www.classx.it</A>
</P>
<P>
03 Apr 2000: Amiga Messen in Neuss (D)
</P>
<P>
Die Messe des Falke Verlags wurde auf den 10.-11. Juni 2000 verschoben. Die
World of Alternatives AMIGA &amp; ATARI-Messe wird in der Stadthalle in Neuss
(bei D&uuml;sseldorf) stattfinden, eine entsprechende Homepage steht zur
Verf&uuml;gung. H&amp;P wird auf dieser Messe die neuen Produkte ArtEffect 4.0,
AmigaWriter 2.0 und StormC 4.0 vorstellen.
<A HREF="http://www.amiga-messe.de" TARGET="_top">http://www.amiga-messe.de</A>
</P>
<P>
06 Apr 2000: St. Louis Show
</P>
<P>
Auch in diesem Jahr war die Amiga Show in St. Louis wieder ein gro&szlig;es
Ereignis. Erstmals war H&amp;P auch als Aussteller dort vertreten. Neben der
Vorstellung von AmigaWriter 2.0 und ArtEffect 4.0 (beide kommen im Mai auf
den Markt) wurde auch ein Workshop zur AmigaOS-Programmierung abgehalten.
Ein paar Bilder der Show findet man hier:
<A HREF="http://www.amiga-planet.de/pictures/stl_2000.htm" TARGET="_top">http://www.amiga-planet.de/pictures/stl_2000.htm</A>
</P>
<P>
07 Apr 2000: H&amp;P Online Shop
</P>
<P>
Seit Anfang Februar ist sind wir mit unserem Shop online. In der
Zwischenzeit haben wir viele Verbesserungen vorgenommen, um den Komfort
weiter zu erh&ouml;hen. Unter anderem sind jetzt Links zu den Produktseiten
vorhanden und &uuml;ber das Cookie-System werden Kunden wiedererkannt (der Shop
funktioniert auch ohne Cookies). Schauen Sie doch einmal vorbei und geben
Sie uns Anregungen.
</P>
<P>
<A HREF="http://www.haage-partner.com/php-bin/shop/" TARGET="_top">http://www.haage-partner.com/php-bin/shop/</A>
</P>
<P>
07 Apr 2000: PageStream 4 Release 5
</P>
<P>
Das n&auml;chste kostenlose Update ist nun verf&uuml;gbar. Bei uns registrierte
Anwender k&ouml;nnen bei uns die Daten f&uuml;r den Download der kompletten Version
(&uuml;ber 7 MB, ohne Online-Hilfe) anfordern.
</P>
<P>
mailto:request@haage-partner.com?subject=PGS4release5
</P>
<P>
07 Apr 2000: Fusion 3.2 Amiga verz&ouml;gert
</P>
<P>
Aufgrund von Verz&ouml;gerungen bei der Beschaffung von 3.5&quot; DD-Disketten kann
Blittersoft das Update nicht ausliefern. Anfang n&auml;chster Woche hofft man
die Disketten zu erhalten.
</P>
<P>
Das Update auf die neue Version 3.2 ist zum Preis von 30 DM im
deutschsprachigen Raum exklusiv bei uns erh&auml;ltlich.
</P>
<P>
11 Apr 2000: Mitchy - die Amiga Suchmaschine
</P>
<P>
Seit ungef&auml;hr drei Wochen ist die Amiga Suchmaschine &quot;Mitchy&quot; der amiga.org
wieder online. Sie enth&auml;lt derzeit rund 1.030 Eintr&auml;ge und es liegt nun an
Ihnen, die Daten zu aktualisieren und zu erweitern - direkt zu Mitchy
Es gibt nun auch ein Bewertungsprogramm, bei dem man eine Webseite bewerten
kann, z.B. unsere hier ;-)
</P>
<P>
20 Apr 2000: Fusion 3.2 Amiga wird ausgeliefert
</P>
<P>
Heute sind endlich die Updates von Fusion 3.2 Amiga eingetroffen und die
Auslieferung kann beginnen.
</P>
<P>
Es wird allerdings ein paar Tage dauern bis alle Vorbestellungen
ausgeliefert sind.
</P>
<P>
Das Update auf die neue Version 3.2 ist zum Preis von 30 DM im
deutschsprachigen Raum exklusiv bei uns erh&auml;ltlich.
</P>
<P>
21 Apr 2000: MiniGL und neue 3D-Spiele
</P>
<P>
Hyperion hat sowohl MiniGL als auch ein Demo von Heretic 2 ver&ouml;ffentlicht.
Au&szlig;erdem wurden zwei neue Warp3D Spiele angek&uuml;ndigt: Drake und Black Sun /
War Machine.
</P>
<P>
25 Apr 2000: AmigaWriter 2.0 kommt im Mai
</P>
<P>
Lange hat es gedauert, doch jetzt ist es bald soweit. Die stark erweitere
Version von AmigaWriter kommt auf den Markt. Highlights sind der Word-
Import, die TrueType-Unterst&uuml;tzung mit Antialiasing und der Brosch&uuml;ren-
Druck.
</P>
<P>
25 Apr 2000: ArtEffect 4.0 erscheint im Mai
</P>
<P>
Die 4. Version des beliebten Grafikprogramms zu Bildbearbeitung und zum
nat&uuml;rlichen Malen bringt wieder eine F&uuml;lle neuer Funktionen und
Verbesserungen. Dabei wurde diesmal besonderes Augenmerk auf die
Ebenenfunktionen gelegt, die jetzt sehr flexibel und leistungsf&auml;hig
geworden sind. Eine neues Handbuch und eine CD-ROM mit Fonts, Cliparts und
Workshops runden das neue Paket ab.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
