<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
Leider war auch im vergangenen Monat die Beteiligung am Gewinnspiel nicht
zufriedenstellend, lediglich 22 Leser haben ihre Antworten eingesandt. Gebt
euch doch mal einen Ruck und macht mit! So schwer sind die Fragen
schlie&szlig;lich nicht, und immerhin gibt es auch etwas zu gewinnen.
</P>
<P>
Denkt dran: Selbst, wenn ihr die Antwort zur Masterfrage nicht wisst, nehmt
ihr an der Verlosung teil, wenn ihr die beiden anderen Fragen beantwortet.
</P>
<P><B>Jetzt aber zur Aufl&ouml;sung:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Standard-Frage:&nbsp;</TD><TD VALIGN="TOP">Mit wieviel MHz ist der im Amiga-Entwicklerger&auml;t zur&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Verwendung kommende AMD-Prozessor getaktet?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Antwort: Die Taktfrequenz betr&auml;gt 500 MHz.
</P>
<P>
Master-Frage: Wof&uuml;r steht die Abk&uuml;rzung AMD &uuml;berhaupt?
</P>
<P>
Antwort: Richtig ist &quot;Advanced Micro Devices&quot;.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Meinungsfrage:&nbsp;</TD><TD VALIGN="TOP">Wie beurteilst du die von AMIGA auf der Amiga 2k in St.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Louis gemachten Ank&uuml;ndigungen?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Die Auswertung:</B></P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">1 (Sehr positiv)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">7&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Eher positiv)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">15&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3 (Eher negativ)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">0&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">4 (Sehr negativ)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">0&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Einige Einsender hatten zu ihrer Beantwortung der Meinungsfrage Stellung
bezogen:
</P>
<P>
Georg Breitsprecher antwortet so: &raquo;Sagen wir mal &quot;eher positiv&quot;... obwohl
ich mir &uuml;ber die st&auml;ndigen neuen Ank&uuml;ndigungen mittlerweile nicht mehr
allzuviele Gedanken mache, warten wir's ab, ob da irgendwann mal was bei
'rumkommt...&laquo;
</P>
<P>
Harald Nilgen schreibt: &raquo;Ich hoffe, der Amiga bekommt nach dem erneuten
Eigent&uuml;merwechsel endlich die Kurve und kann seine Gemeinde vergr&ouml;&szlig;ern. Es
w&auml;re diesem wirklich hervoragendem Computer und der damit verbundenen
Gemeinde zu w&uuml;nschen.&laquo;
</P>
<P>
Christian Aichinger meint: &raquo;Die Wahl der Entwicklerplattform hat schon
einen ganz sch&ouml;n bitteren Nachgeschmack, war aber wohl die einzig richtige
Entscheidung.
</P>
<P>
Wenigstens hatte Bill das Feingef&uuml;hl, in der Maschine keine CPU von Intel
einzusetzen und Elate auch nicht unter Windows laufen zu lassen. Euphorie
hab ich auch keine mehr. Die ist schon lange bei Escom und Gateway
&quot;draufgegangen&quot;.
</P>
<P>
Ich schaue einfach mal, was kommt. Mir ist es ja eigentlich egal, ob ich
Hardware von Amiga bekomme oder nicht. Hauptsache ist doch, da&szlig; die Jungs
(und nat&uuml;rlich M&auml;dels) bei Amiga nicht das zerst&ouml;ren, was ich als Amiga
verstehe: &quot;Das Gef&uuml;hl, in einem wirklich exklusiven Club zu sein&quot; und mit
einem Computer zu arbeiten, der es, trotz seiner technischen &Uuml;beralterung,
immer wieder schafft, mich auf angenehme Weise zu &uuml;berraschen.&laquo;
</P>
<P>
J&ouml;rg Gesen beurteilt die Ank&uuml;ndigungen &raquo;sehr positiv, endlich passiert mal
wieder was. Ob es nun etwas bringt oder nicht, es ist besser, als nichts zu
tun!&laquo;
</P>
<P>
Klaus Moddemann sieht das &auml;hnlich: &raquo;Ich finde, die Ank&uuml;ndigungen, welche
auf der Messe in St. Louis gemacht wurden, zeigen, dass man etwas zu Wege
bringt. Es kann eigentlich nur besser werden, nachdem wir von Gateway &amp; Co.
so verschaukelt wurden. Ich sehe auf jeden Fall positiv in die AMIGA-
Zukunft und hoffe, bald ein neues System hier auf meinem Schreibtisch
stehen zu haben.&laquo;
</P>
<P>
René Thol ist anderer Meinung: &raquo;Leider muss ich sagen, dass die gemachten
Ank&uuml;ndigungen mich in keinster Weise positiv emotional beeindrucken, da die
letzten Jahre (abgesehen von OS3.5, was ich toll finde) nur von
Ank&uuml;ndigungen ohne Taten lebten. Das hat mich eher skeptisch gestimmt!!!!
Au&szlig;erdem vermisse ich auf der neuen Amiga-Homepage eine Kontaktadresse f&uuml;r
die ganz normalen Fragen, also hab ich mir ein paar E-Mail-Adressen
rausgepickt und dorthin gemailt, nun warte ich auf Antwort!
Ich hoffe, dass ich meinen A4000 dieses Jahr noch auf G3 bringen kann, wenn
sich <A HREF="mailto:met@box">met@box</A> ranh&auml;lt!! Leider gibt es da auch noch Unklarheiten
(hinsichtlich 68k-Emulation)!
Zum geplanten neuen Amiga ist meine Frage dieselbe gewesen: Wie wird alte
Software unterst&uuml;tzt (habe nicht vor, wegen einer neuen Kiste alle
Software, die ich besitze, einzustampfen!) [Es soll eine Emulation f&uuml;r die
heutigen Amiga-Programme geben; Anm. d. Red.], bzw. wie sieht die
Unterst&uuml;tzung bisheriger Amiga-Modelle aus?? [Das neue OS soll auch f&uuml;r
heutige Amigas mit PPC-Karte erscheinen; Anm. d. Red.]&laquo;
</P>
<P>
Thomas Mitzschke gibt die Hoffnung auf einen neuen Rechner nicht auf: &raquo;Seit
Jahren hoffe ich auf einen neuen AMIGA, vielleicht zu Weihnachten, wo das
Geld besonders locker sitzt.
</P>
<P>
Naja, auch im letzten Jahr sollte es ein neuer AMIGA sein - wieder eine
Menge Geld gespart.
</P>
<P>
Und dieses Jahr?? Vielleicht haben McEwen und Fleecy Moss mehr Gl&uuml;ck und
verstehen, was die AMIGA-Gemeinde w&uuml;nscht.
</P>
<P>
Ich f&uuml;r meinen Teil habe es langsam satt, mir st&auml;ndig das Gejammere
anzuh&ouml;ren, da&szlig; wieder eine noch so tolle AMIGA-Ank&uuml;ndigung nicht
herausgebracht wird.
</P>
<P>
Weihnachten 2000 - Neuer AMIGA unterm Baum?
Und wenn nicht, mu&szlig; der alte eben noch ein Jahr durchhalten.
</P>
<P>
Ich werde bis zuletzt mit meinem AMIGA arbeiten und werde die Hoffnung
nicht aufgeben.&laquo;
</P>
<P>
Fazit: Die meisten Leser reagieren verhalten optimistisch auf die
Ank&uuml;ndigungen AMIGAs. Eine Minderheit beurteilt sie sogar als sehr positiv,
w&auml;hrend die Pl&auml;ne offenbar von kaum einem Amiga-Anwender von vornherein
abgelehnt werden.
</P>
<P>
Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;AFiloFaxPro&quot;: David Sondermann&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;Kniffel&quot;: Georg Breitsprecher&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x 3x-CD-ROM-Laufwerk (SCSI) inkl. zwei Caddies: Christian Aichinger&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Herzlichen Gl&uuml;ckwunsch!</B></P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
