<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Messebericht</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Tests3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Messebericht
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Messebericht</H1>
<H2>1. Vorabinformationen zur Amiga-Messe &raquo;World of Alternatives&laquo;</H2>
<P>
Wie in der letzten Ausgabe angek&uuml;ndigt, folgen an dieser Stelle weitere
Informationen zur Messe &raquo;World of Alternatives&laquo;, der wahrscheinlich
einzigen deutschen Messe dieses Jahres mit bedeutsamer Amiga-Beteiligung.
Die Daten wurden der offiziellen Messe-Homepage (<A HREF="http://www.amiga-messe.de" TARGET="_top">http://www.amiga-messe.de</A>)
entnommen:
</P>
<P>
&raquo;Ihr Traum wird wahr: Die gro&szlig;e Messe der alternativen Computersysteme
&quot;AMIGA&quot; und &quot;ATARI&quot; findet endlich statt.
</P>
<P>
Termin ist der 10. und 11. Juni 2000 - also schon in K&uuml;rze.
</P>
<P>
Und Sie sollten sich auf diese einmalige Veranstaltung in Neuss freuen.
</P>
<P><B>Die Messehalle</B></P>
<P>
Austragungsort der ersten &quot;Amiga- und Atari-Messe&quot; ist die Stadthalle
Neuss, bew&auml;hrtes Ziel der ATARI-Fangemeinde seit 1996. Neuss hat sich als
Zentrum Europas bew&auml;hrt, denn nahtlos an D&uuml;sseldort &uuml;bergehend gelegen, ist
Neuss sowohl aus dem gesamten deutschen Raum als auch aus den
Beneluxstaaten und Frankreich in K&uuml;rze zu erreichen. In mitten des
Ballungszentrums von Nordrheinwestfahlen ist Neuss idealer Anlaufpunkt f&uuml;r
etliche Tausend Fans der beiden alternativen Computersysteme.
Eine exakte Wegbeschreibung nach Neuss entnehmen Sie bitte der Seite
Anfahrt.
</P>
<P><B>Die Teilnehmer</B></P>
<P>
Amiga- und Atari-Fans aus der gesamten Messe d&uuml;rften sich auf eines der
spannendesten Messe-Ereignisse der letzten Jahre freuen. Eine
Veranstaltung, die so viele Neuheiten verspricht, wie schon viele Jahre
nicht mehr. Und nicht ohne Grund finden sich auf dieser Messe mehr
kommerzielle Aussteller z.B. aus dem Amiga-Markt zusammen, als auch jeder
vergleichbaren Veranstaltung der vergangenen Jahre.
</P>
<P>
Publikumsmagneten der Messe d&uuml;rften die St&auml;nde von Amiga und Milan
Computersystems sein, denn beide Erben des jeweiligen Marktes haben
herausragende Neuheiten im Gep&auml;ck.
</P>
<P>
Amiga wird erstmals in Europa das bislang noch geheim gehaltene,
zukunftsweisende Computersystem der n&auml;chsten Generation vorstellen.
Gemeinsam mit der britischen Softwareschmiede Tao wurde ein vollkommen
neuartiges Betriebssystem-Konzept entwickelt, das in puncto Funktionalit&auml;t
und Bedienbarkeit an die Traditionen Amigas ankn&uuml;pfen, aber bez&uuml;glich der
Leistungsf&auml;higkeit aktuelle Rechner in den Schatten stellen wird. Eine
Vorstellung, auf die die gesamte Amiga-Gemeinde viele Jahre gewartet hat.
</P>
<P>
Der inoffizielle Atari-Nachfolger &quot;Milan-Computersystems&quot; hat f&uuml;r die Messe
in Neuss ebenfalls eine Neuvorstellung angek&uuml;ndigt: Knapp 2 Jahre nach
Erscheinen des Milan 040 wird es nun endlich den Milan II, einen
leistungsf&auml;higen Home-und Office-Computer, geben. Gemeinsam mit den
Partnern von AXRO und Motorola wurde das Konzept des Atari-Nachfolgers
&uuml;berarbeitet und so vielseitig modernisiert, so da&szlig; die Atari-Fans ein
einmalig neues Computer-Kozept erwartet. Die Messe gilt f&uuml;r Milan-
Computersystems als Generalprobe vor der bundesweiten Markteinf&uuml;hrung im
Sp&auml;tsommer 2000.
</P>
<P>
Selbstredend werden neben den beiden Mutterfirmen zahlreiche Aussteller
beider M&auml;rkte erscheinen, die eine Reihe von Neuheiten f&uuml;r die jeweiligen
Kunden angek&uuml;ndigt haben. Werfen Sie hierf&uuml;r bitte einen Blick auf die
Aussteller-Seite.
</P>
<P><B>Auch Sie k&ouml;nnen teilnehmen</B></P>
<P>
Selbstverst&auml;ndlich k&ouml;nnen auch Sie an der Messe in Neuss teilnehmen. Jedes
Hard- und Softwareunternehmen, jeder Shareware- und PD-Soft-Autor sowie
s&auml;mtliche Clubs sind herzlich willkommen, ihr Angebot auf der Messe in
Neuss zu pr&auml;sentieren. Auf der Seite &quot;Anmeldung&quot; erfahren Sie s&auml;mtliche
relevanten Informationen f&uuml;r die Teilnahme.
</P>
<P><B>Vorverkauf</B></P>
<P>
Wir erwarten einen riesigen Ansturm auf die Amiga- und Atari-Messe 2000 in
Neuss. Die Liste der Aussteller ist nicht nur umfangreich, sondern auch so
hochkar&auml;tig, da&szlig; lange Wartezeiten an den Kassen nicht auszuschlie&szlig;en sind.
Daher bieten wir Ihnen auch einen Kartenvorverkaufs-Service an, so da&szlig; Sie
bequem die Halle betreten und unn&ouml;tige Wartezeiten sparen k&ouml;nnen. W&auml;hlen
Sie f&uuml;r weitere Informationen bitte die Seite Vorverkauf.
</P>
<P>
<B>Vortr&auml;ge und mehr ...</B>
</P>
<P>
Selbstverst&auml;ndlich sind wir bem&uuml;ht, die Messehalle nicht mit Ausstellern zu
f&uuml;llen, wir werden auch ein hochweriges Rahmenprogramm bieten. In unseren
Vortragsr&auml;umen werden Entwicker, Spezialisten und Hard- und Softwareh&auml;user
Informationen und Beitr&auml;ge zu allen relevanten und aktuellen Themen
anbieten.
</P>
<P>
Eine Liste der Programmpunkte ist ab dem 1.05.2000 erstmals verf&uuml;gbar und
wird bis zum Beginn der Messe st&auml;ndig aktualisiert. W&auml;hlen Sie bitte
&quot;Programm&quot; f&uuml;r weitere Informationen.
</P>
<P><B>Ihr Vorschlag ist willkommen!</B></P>
<P>
Selbstverst&auml;ndlich sind wir flexibel und gehen - soweit m&ouml;glich - gerne auf
Ihre W&uuml;nsche ein. Wenn Sie Vorschl&auml;ge haben, wie wir dieses Event des
Jahres noch weiter aufwerten k&ouml;nnen, dann teilen Sie uns diese bitte gerne
mit. Senden Sie uns eine eMail an <A HREF="mailto:messe@falke-verlag.de.">messe@falke-verlag.de.</A>&laquo;
</P>
<P><B>&raquo;Amiga-Aussteller</B></P>
Amiga Deutschland mit Vorf&uuml;hrungen des neuen Systems<BR>
Vesalia<BR>
KDH<BR>
Epic Marketing<BR>
Haage &amp; Partner<BR>
Schatztruhe<BR>
Titan Computer<BR>
Individual Computer<BR>
Vertrieb A. Kn&ouml;tig<BR>
DreiEinHalb-Computer<BR>
ACP &amp; TCP<BR>
Falke Verlag<BR>
Eternity<BR>
Verkosoft<BR>
Cool bits<BR>
Peer Schmidt<BR>
Jens Langenberg<BR>
Ronny Bernd<BR>
Amiga-Club *AC# Deutschland und &quot;Amiga-News&quot; mit Petra Struck<BR>
Zellmer Elektronik<BR>
etc...<BR>
<P><B>ATARI-Aussteller:</B></P>
<P>
Milan-Computersystems &amp; AXRO<BR>
Atari-Gebrauchtfachmarkt Peter Denk<BR>
Classic Atari<BR>
Software-Service-Seidel<BR>
EDV-Service S&ouml;nke Diener<BR>
Falke Verlag<BR>
Best Electronics<BR>
ROM logicware<BR>
M.u.C.S.<BR>
</P>
<P>
Video Game Service Gross Softwareentwicklung Patrick Eickhoff RGF-Software
June-Audio
Woller Systeme
Epic Marketing
Portfolio-Club Deutschland
AKA (Anwenderkreis Atari) Freiburg
Run-Software
Zellmer Elektronik
etc...&laquo;
</P>
<P><B>&raquo;Anfahrt</B></P>
<P>
Neuss liegt nahe D&uuml;sseldorf und somit nicht nur im Zentrum Deutschlands,
sondern auch im Herzen Europas. Ob aus den Benelux-Staaten, Frankreich, der
Tschechei oder aus S&uuml;ddeutschland.
</P>
<P>
Die zu &uuml;berbr&uuml;ckende Entfernung zum Mekka der Amiga- und Atari-Welt ist
gering und f&uuml;r jedermann akzeptabel. Somit ist Neuss stets eine Reise wert,
wenn die Amiga- und Atari-Messe dort stattfindet.
</P>
<P>
Neben der Messe haben Neuss und Nachbarst&auml;dte wie z.B. D&uuml;sseldorf eine
Menge an Attraktionen zu bieten. Wenn Sie aus Ihrer Messe-Visite ein
komplettes Familien-Wochenende mit z.B. dem Besuch des modernen 3D-Kinos
von D&uuml;sseldorf machen m&ouml;chten, dann ber&auml;t Sie die Touristen-Information
Neuss gerne:
</P>
Tourist Information Neuss<BR>
Markt 4<BR>
41460 Neuss<BR>
Tel. (02131) 27 32 42<BR>
Fax (02131) 22 25 59&laquo;<BR>
<P><B>&raquo;Eintrittspreise</B></P>
Erwachsene: 18,- DM<BR>
Erm&auml;&szlig;igt: 13,- DM<BR>
Familien (2 Erwachsene + 2 Kinder bis 12 Jahren): 40,- DM<BR>
<P>
&Ouml;ffnungszeiten: t&auml;glich von 10.00 bis 18.00 Uhr
</P>
<P>
Beachten Sie bitte auch unsere Hinweise auf der Seite f&uuml;r den Vorverkauf.&laquo;
</P>
<P><B>&raquo;Vorverkauf</B></P>
<P>
F&uuml;r die Amiga- und Atari-Messe´2000 erwarten wir einen regelrechten
Besucheransturm, denn nicht nur die Mutter-Firmen der jeweiligen M&auml;rkte
haben innovative und auch bahnrechende Neuheiten angek&uuml;ndigt, auch die
Aussteller zeigen sich so aktiv wie schon Jahre nicht mehr.
</P>
<P>
Daher empfehlen wir Ihnen, Gebrauch vom Kartenvorverkauf zu machen, denn so
k&ouml;nnen Sie unn&ouml;tige Wartezeiten an den Kassen vermeiden.
</P>
<P><B>Preise Vorverkauf:</B></P>
Erwachsene 15,- DM<BR>
Kinder unter 12 Jahren 12,- DM.<BR>
<P>
Hinzu kommt pro Sendung (nicht pro Eintrittskarte!) eine pauschale Versand-,
Verpackungs- und Einschreibegeb&uuml;hr von 5,- DM.
</P>
<P><B>Preise Tageskasse:</B></P>
Erwachsene 18,- DM<BR>
Kinder unter 12 Jahren: 13,- DM<BR>
<P><B>Bestellungen &amp; Bezahlung:</B></P>
<P>
Bestellen k&ouml;nnen Sie per Brief, Fax, per eMail oder mit nachfolgendem
Formular.
</P>
<P>
Per Brief haben Sie die M&ouml;glichkeit, uns den Betrag per Scheck (Ausland nur
EC-Scheck!) oder in bar zukommen zu lassen.
</P>
<P>
Bei allen anderen Bestellwegen ist der Versand nur per Lastschrifteinzug
m&ouml;glich. Bitte teilen Sie uns daher Ihre korrekte Bankverdindung mit.
Sollten Sie das Formular dieser Seite nicht nutzen, verwenden Sie bitte
folgenden Satz in Ihrer schriftlichen Bestellung:
&quot;Hiermit erteile ich dem Falke Verlag in Kiel die Erlaubnis, den Betrag zur
Begleichung der in Rechnung gestellten Messe-Eintrittskarten von meinem
folgenden Bankkonto per Lastschrift einzuziehen&quot;
</P>
<P>
Der Lastschrifteinzug ist selbstverst&auml;ndlich auch bei Briefbestellungen
m&ouml;glicht.
</P>
<P>
Bei Bestellung von 5 und mehr Eintrittskarten erm&ouml;glichen wir auch den
Versand per Nachnahme.
</P>
<B>Unsere Anschrift:</B><BR>
FALKE Verlag<BR>
Kartenvorverkauf<BR>
An der Holsatiam&uuml;hle 1<BR>
24149 Kiel<BR>
Fax 0049 - 431 - 27 368&laquo;<BR>
<P>
&raquo;Aussteller (allgemeine Firmen, Softwareh&auml;user, Clubs, Shareware-Autoren)
wenden sich bitte an die Firma:
</P>
J.H.S. Medienagentur<BR>
Herrn Sch&uuml;ler<BR>
Schwentinestr.<BR>
24149 Kiel<BR>
Tel. (04 31) 20 59 330<BR>
Fax (04 31) 20 59 340<BR>
eMail: <A HREF="mailto:j.h.schueler@t-online.de">j.h.schueler@t-online.de</A><BR>
<P>
Kundeninformationen erhalten Sie unter folgender Adresse:
</P>
FALKE Verlag<BR>
An der Holsatiam&uuml;hle 1<BR>
24149 Kiel<BR>
Tel. (04 31) 27 365<BR>
Fax (04 31) 27 368<BR>
eMail: <A HREF="mailto:a.goukassian@falke-verlag.de">a.goukassian@falke-verlag.de</A>&laquo;<BR>
<P><B>&raquo;News</B></P>
<P>
Messe-Promotion rollt an ... (22.04.2000)
</P>
<P>
In den Tagen nach Ostern wird die Bewerbung der gro&szlig;en &quot;World of
Alternatives&quot; ausgeweitet. Ein Presse-B&uuml;ro wird &uuml;ber 400 deutschsprachige
IT-/Computer-Fachzeitschriften sowie die lokale Fachpresse mit
ausf&uuml;hrlichen Informationen zur gro&szlig;en AMIGA- und ATARI-Messe versorgen.
Die Computersendungen von 3SAT und WDR werden in ihren kommenden Ausgaben
ausdr&uuml;cklich auf die Messe hinweisen.
</P>
<P>
Dar&uuml;ber hinaus wird der Veranstalter insgesamt 30.000 aktive AMIGA- und
ATARI-Anwender direkt anschreiben und mit der geplanten Messe-Zeitung
versorgen.
</P>
<P>
Eine englischsprachige Web-Site ist f&uuml;r den Zeitraum 2. Mai-Woche geplant.
Dar&uuml;ber hinaus wird der erste offizielle Messe-Standplan ab dem 5. Mai auf
diesen Web-Sites ver&ouml;ffentlicht.
 
</P>
<P><B>Vortr&auml;ge mit VGA-Projektor (07.04.2000)</B></P>
<P>
In Absprache mit Petro Tyschtschenko von AMIGA Deutschland wird AMIGA f&uuml;r
einen der beiden Vortragsr&auml;ume einen VGA-Projektor zur Verf&uuml;gung stellen.
Wenn Sie als Besucher, Programmautor oder Aussteller Interesse haben,
Pr&auml;sentationen, Workshops etc. auf der Messe anzubieten, dann setzen Sie
sich bitte mit uns in Verbindung.
Weitere Informationen unter Programm.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"> &nbsp;</TD></TR>
<TR><TD VALIGN="TOP">STEmulator 2.0 kommt zur Messe (07.04.2000)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Der Falke Verlag hat angek&uuml;ndigt, zur Amiga- &amp; ATARI-Messe in Neuss die
aktuelle und neueste Version des beliebten Atari-Emulators f&uuml;r PCs direkt
auf der Messe anzubieten. Eine Liste registrierter User wird vorhanden
sein, so da&szlig; Sie vor Ort g&uuml;nstige Updates erwerben k&ouml;nnen. Aktuelle Infos
zum STEmulator erhalten Sie ab dem 20.04.2000 unter www.stemualtor.de.
 
</P>
<P><B>Amiga´s Auftritt (05.04.2000)</B></P>
<P>
W&auml;hrend eines rund einst&uuml;ndigen Gespr&auml;ches mit Petro wurde best&auml;tigt, da&szlig;
Amiga an der Neusser Messe teilnehmen wird! Ein eigener Stand wird sich
insofern noch nicht rentieren, als Amiga auf dieser Messe noch nichts zu
verkaufen hat. Allerdings sind mehrmals t&auml;glich Vorf&uuml;hrungen des neuen
Amiga-Systems in Rahmen von Pressekonferenzen und Workshops geplant.
Voraussichtlich werden neben Petro auch Bill McEwen und Fleecy Moss die
Systeme vorstellen. Parallel hierzu stellen sie sich den Fragen der
Besucher nicht nur im Rahmen der Vorf&uuml;hrungen, sondern auch direkt am Stand
des Falke Verlags. Promotion-Items, Autogramme usw. werden wie immer gern
von Petro und den anderen vergeben. Wir d&uuml;rfen sehr auf die Vorf&uuml;hrungen
gespannt sein.&laquo;
</P>
<P><B>(Quelle: jeweils <A HREF="http://www.amiga-messe.de" TARGET="_top">http://www.amiga-messe.de</A>)</B></P>
<P ALIGN="RIGHT">
<A HREF="Tests3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
