<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Vorwort</H2>
<P><B>Hallo, liebe Leser!</B></P>
<P>
Herzlich willkommen zu einer neuen Ausgabe des AMIGA aktuell
Spieleteils. Die Hauptereignisse des letzten Monats lassen sich in
folgendem Satz zusammenfassen: Heretic II Demoversion wurde
ver&ouml;ffentlicht. Viel mehr ist sonst eigentlich nicht passiert.
Selbstverst&auml;ndlich k&ouml;nnt ihr diesen Monat eine Preview zu Heretic II
in dieser Ausgabe lesen, auch wenn es nur eine Pseudo-Preview ist.
Eine richtige konnte ich n&auml;mlich nicht schreiben, da ich keine
PowerPC Karte besitze. So habe ich mich in diversen Chatr&auml;umen
umgeh&ouml;rt und die Erfahrungen etwas zusammengefasst. Bitte teilt
mir auch eure Erfahrungen zu der Heretic II Demoversion mit. Sie
werden dann in der n&auml;chsten Ausgabe ver&ouml;ffentlicht.
</P>
<P>
Eine weitere interessante Neuigkeit diesen Monat war das von
Hyperion Software gezogene Fazit nach dem ersten Gesch&auml;ftsjahr.
So ist es der Firma gelungen, einige Industriestandards der
PC-Welt auf den Amiga zu portieren, die das Umsetzen weiterer
PC-Spiele unheimlich vereinfachen. Ich halte dies f&uuml;r einen
sehr wichtigen Schritt. Hyperion Software hat also die komplette
Basis f&uuml;r neue Spiele schon geschaffen. Man darf demnach
wirklich gespannt sein.
</P>
<P>
Diesen Monat gibt es endlich mal wieder einen PD-Test von
Heiko Garrelts, diesmal Star Trek. Die Mac-Ecke ist diesen
Monat selbstverst&auml;ndlich auch wieder mit von der Partie,
w&auml;hrend sich die Charts aus dem Spieleteil verabschieden m&uuml;ssen.
Es wird wohl jedem aufgefallen sein, dass sie sich seit
September nicht ver&auml;ndert haben. Das ist allerdings nicht
die Frucht meiner Unaufmerksamkeit, sondern liegt es schlicht
und einfach daran, dass irgendwie keine Charts mehr von GTI
ver&ouml;ffentlicht wurden. Weder auf deren Homepage noch auf
der AmigaPlus Homepage, welche ja jetzt sowieso nur zur
Homepage der AmigaOS f&uuml;hrt. Usercharts m&ouml;chte ich eigentlich
auch nicht einf&uuml;hren, da mir dies dann nur verdeutlichen
w&uuml;rde, wie wenige Menschen den Spieleteil lesen. Auch wenn
die AMIGA aktuell einen relativ hohen Verbreitungsgrad
genie&szlig;t, gehe ich pers&ouml;nlich nicht von mehr als 20 Lesern
des Spieleteils aus. Ich erhalte n&auml;mlich so gut wie gar
kein Feedback; in guten Monaten vielleicht eine Mail. Auch
auf Fragen, Bitten usw. gibt es meistens keine R&uuml;ckmeldung.
Trotz alledem kann ich diese Vorg&auml;nge gut verstehen. Wenn
ich nicht selbst den Spieleteil verfassen w&uuml;rde, w&uuml;rde ich
ihn wahrscheinlich auch nicht lesen, da der Spielemarkt
am Amiga die letzten Jahre &auml;u&szlig;erst unattraktiv war und dies
sich von Monat zu Monat steigert. Traurig, aber war.
</P>
<P>
Trotzdem w&uuml;nsche nun viel Spa&szlig; beim Lesen!
</P>
<P><B>Euer,</B></P>
<P>
Andreas<BR>
(<A HREF="mailto:Andreas.Falkenhahn@gmx.de">Andreas.Falkenhahn@gmx.de</A>)<BR>
</P>
<P>
(Andreas Falkenhahn, An der Trift 2, 36132 Eiterfeld-Arzell)
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
