<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele11.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele13.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H1>7.4. Reviews</H1>
<H2>C&auml;sar II</H2>
<TABLE><TR><TD BGCOLOR="#e0e0e0"><PRE>
Name des Spiels : Caesar II
Hersteller      : Sierra Online
Voraussetzungen : 040      8MB
erh&auml;ltlich bei  :

Grundlage       : ( ) Vollversion      (X) Demo     ( ) Andere:

Getestet auf    : ( ) 020/__   ( ) 030/__   (X) 040/40   ( ) 060/__
Grafikkarte     : ( ) Ja       (X) Nein     Welche:________________

Emulator        : (X) Fusion   ( ) ShaShi   ( ) mit Emplant  ( ) echter Mac
Mac-System      : ( ) 6._      ( ) 7._      (X) 8.0
Mac-Rom         : ( ) 128k     ( ) 256k     ( ) 512k     (X) 1MB
</PRE></TD></TR></TABLE>
<P><B>Einleitung :</B></P>
<P>
Caesar II ist ein Strategical, dass auf den ersten Blick sehr stark an
das Kultspiel Sim City und dessen Nachfolger und Derivate erinnert - nur
dass es, wie der Name schon erahnen l&auml;sst, in den Zeiten des aufstrebenden
Roms angesiedelt ist.
</P>
<P><B>Spielbeschreibung :</B></P>
<P>
Der Spieler hat als r&ouml;mischer Stadthalter die Aufgabe, quasi aus dem Nichts
eine Metropole zu erschaffen, die sowohl wirtschaftlich floriert als auch
kulturell voranschreitet.
</P>
<P>
Um dieses Ziel zu erreichen, stehen dem Bauherren allerhand Geb&auml;ude zur
Verf&uuml;gung. Neben Wohnh&auml;usern und Industrie kann man das Stadtbild bereits
zu Beginn des Spiels mit diversen Bauwerken versch&ouml;nern, die jeweils eigene
Aufgaben erf&uuml;llen; als Beispiele seien hier Arenen, B&auml;der, Tempel oder
Baracken genannt.
</P>
<P>
Dabei ist neben der richtigen Auswahl auch der richtige Standort der
Geb&auml;ude wichtig, da diese nur beschr&auml;nkte Einzugsbereiche besitzen. Mit
Hilfe der Info-Funktion l&auml;&szlig;t sich f&uuml;r jedes Feld feststellen, welche
Bed&uuml;rfnisse, wie Wasserversorgung, Unterhaltung und Sicherheit, erf&uuml;llt
sind. Ferner l&auml;sst sich pr&uuml;fen, ob ein Mangel an solchen das Wachstum und
die Weiterentwicklung des bebauten Feldes behindert.
</P>
<P>
Der eigentliche Bau erfolgt Sim-City-like per click´n drag, der Geb&auml;udetyp
wird im Men&uuml; angew&auml;hlt und kann dann durch Ziehen der Maus beliebig gro&szlig;
auf der Karte positioniert werden. Auf diese Weise lassen sich
beispielsweise auch Stadtmauern sehr bequem aus dem Boden stampfen, da
immer der k&uuml;rzeste Weg zwischen Start- und Zielpunkt bebaut wird.
</P>
<P>
Da auch der engagierteste H&auml;uslebauer irgendwann an die Grenzen seiner
Motivation sto&szlig;en wird, bietet Caesar II neben dem Stadterbauer-Modus auch
noch den Provinzialmodus. Hier k&ouml;nnen St&auml;dte vernetzt, Schlachten gefochten
und gro&szlig;fl&auml;chig expandiert werden. Da sich die Demosversion jedoch auf den
City-only Modus beschr&auml;nkt, kann ich hier nur mutma&szlig;en, dass die Motivation
durch diese Erweiterung einen zus&auml;tzlichen Schub erf&auml;hrt.
</P>
<P>
Die Grafik des Spiels ist sehr ansehnlich, die Geb&auml;ude wissen in ihrer
Vielf&auml;ltigkeit und Darstellung zu gefallen, und auch das restliche
drumherum ist sehr liebevoll gestaltet. Einzig der Sound wirkt in meinen
Ohren etwas eint&ouml;nig, kann allerdings selbstverst&auml;ndlich im Menu
deaktiviert werden.
</P>
<P><B>Spielgeschwindigkeit :</B></P>
<P>
Erfreulicherweise merkt man diesem Spiel kaum an, dass es auf einer
Emulation aufsitzt. Auch wenn ein PPC unterst&uuml;tzt wird, wird dieser
vermutlich haupts&auml;chlich f&uuml;r die animierten Zwischensequenzen ben&ouml;tigt, die
die Vollversion des Spiels bietet. Ansonsten weiss das flotte Gameplay zu
&uuml;berzeugen.
</P>
<P><B>Fazit :</B></P>
<P>
Das Spiel kann bereits in der Demo-Version &uuml;berzeugen. Wer einfach mal
so eine Stadt aus dem Boden stampfen will, wird schnell feststellen, wo die
strategischen T&uuml;cken des Spiels liegen.
</P>
<P>
Wenn das Spiel keine langfristigen Schw&auml;chen aufweist, die im Demo nicht
zu erkennen sind, w&auml;re es durchaus empfehlenswert.
</P>
<H2>The Dig</H2>
<TABLE><TR><TD BGCOLOR="#e0e0e0"><PRE>
Name des Spiels : The Dig
Hersteller      : Lucas Arts
Voraussetzungen : ?
erh&auml;ltlich bei  :

Grundlage       : ( ) Vollversion      (X) Demo     (X) Andere: Mac Magazin
</PRE></TD></TR></TABLE>
<P><B>Einleitung:</B></P>
<P>
Neben Kult-Spielen wie &quot;Day of the Tentacle&quot; oder &quot;Full Throttle&quot; zeichnet
sich Lucas Arts auch f&uuml;r &quot;The Dig&quot; verantwortlich. Vorab sei gesagt, dass
auch dieses Spiel den hohen Erwartungen gerecht wird.
</P>
<P><B>Spielbeschreibung:</B></P>
<P>
Wie der Hersteller bereits vermuten l&auml;sst, handelt es sich bei &quot;The Dig&quot; um
ein point&amp;click-Adventure, bei dem man die Spielfigur mit einfachen
Mausclicks gehen und agieren lassen kann. Das erste, was einem im Vergleich
zu anderen Spielen auff&auml;llt, ist die fehlende Befehlsleiste; diese wird
durch intelligente Aktionen je nach angeklicktem Objekt ersetzt.
</P>
<P>
Zur Geschichte, die nat&uuml;rlich in einem voll animierten und gesprochenen
Intro erz&auml;hlt wird: Ein Asteroid riesigen Ausma&szlig;es befindet sich auf
direktem Kollisionskurs mit der Erde. Mit einem Shuttle und zwei Nuklear-
sprengk&ouml;pfen sollen der NASA-Veteran Brink (dessen Rolle der Spieler
&uuml;bernimmt) und zwei Experten versuchen, diese Gefahr aus dem Weg zu r&auml;umen.
Bei n&auml;herer Untersuchung stellt sich jedoch heraus, dass der Asteroid innen
hohl ist - und die irdischen Eindringlinge nicht die ersten sind, die es
hierher verschlagen hat.
</P>
<P>
Mit dieser Erkenntnis wird der Spieler ins eigentliche Spiel entlassen. Von
dort aus gilt es, in einer sehr sch&ouml;n und atmosph&auml;risch gezeichneten
Landschaft, die Geheimnisse dieses Himmelsk&ouml;rper zu entdecken. Die Handlun
entwickelt sich im Laufe der Zeit sehr spannend und dynamisch, bereits das
kurze Demo macht Lust auf mehr.
</P>
<P>
Vom MacMagazin in h&ouml;chsten T&ouml;nen gelobt wird der pomp&ouml;se Soundtrack des
Spiels. Da dieser allerdings stockend und dr&ouml;hnend abgespielt wird, ist
auf einem langsamen Rechner leider nur das Ausschalten empfehlenswert.
</P>
<P><B>Spielgeschwindigkeit :</B></P>
<P>
Das Spiel ist bereits auf meinem 040/40er ohne Grafikkarte annehmbar
spielbar. Die Filmszenen sollten zwar im kleinen Fenster genossen werden,
und die Musik stottert auch etwas, das Gameplay ist aber ansonsten, von
einem beherzten Ruckeln beim Scrollen abgesehen, durchaus fl&uuml;ssig.
Etwas nervig sind zur Zeit noch die Cursor-Fehler, die in allen alten
Lucas-Arts-Spielen auftreten. Wer diese vermeiden will, sollte demn&auml;chst
auf Fusion V3.2 upgraden.
</P>
<P><B>Fazit :</B></P>
<P>
Das schlechteste an diesem Spiel ist, dass man es aufgrund seines Alters
nur noch auf dem Gebrauchtmarkt finden d&uuml;rfte. Ansonsten w&uuml;rde ich
aber auch noch einige Tacken springen lassen, um an das Orginal
heranzukommen.
</P>
<P>
Wertung im MacMagazin: 5/5 &quot;Spannend, tricky, mit Liebe gemacht.&quot;
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Autor&nbsp;</TD><TD VALIGN="TOP">: Andreas Koch&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">E-Mail&nbsp;</TD><TD VALIGN="TOP">: <A HREF="mailto:andreas.koch@wirtschaft.uni-giessen.de">andreas.koch@wirtschaft.uni-giessen.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P ALIGN="RIGHT">
<A HREF="Spiele11.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele13.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
