<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Workshops / Hintergrundberichte / Buchvorstellungen</H1>
<H2>1. Der Commodore-Untergang aus meiner Sicht - Teil 7 (von Rainer Benda)</H2>
<P>
&raquo;
Hingen die Lieferschwierigkeiten des A4000 auch schon mit dem Untergang von
Commodore zusammen ? Frage von: Andreas Machnitzke, <A HREF="mailto:Rhomtuft@t-online.de">Rhomtuft@t-online.de</A>
===========================================================================
</P>
<P>
Auch wenn ich das Ende schon beschrieben habe :-)......gehen wir einige
Schritte zur&uuml;ck.
</P>
<P>
Der A4000 ist auch nicht so zielstrebig entwickelt und auf den Markt
gebracht worden, wie es vielleicht den Anschein hat.
</P>
<P>
Zum Zeitpunkt des C65 und des Amiga 600 (der ja zuerst A300 heissen
sollte), war Commodore noch nicht in der Lage eine AA-Maschine zu
pr&auml;sentieren. Es fand in Frankfurt ein Entwicklermeeting statt (das waren
Treffen, an denen registrierte Soft- und Hardwareentwickler rund um den
Amiga teilnehmen konnten, um sich Informationen zu beschaffen - soweit
vorhanden - oder allgemein ihre Ansichten zu den Amiga-Geschehnissen
&auml;u&szlig;erten, W&uuml;nsche an den Entwicklersupport richteten usw.).
</P>
<P>
Ich habe selbst an 2 oder 3 dieser Treffen teilgenommen, die in Frankfurt
stattgefunden haben (es gab auch welche au&szlig;erhalb Deutschlands). Eigentlich
war das nicht ganz mein Job (obwohl, eine richtige Definition gab es da
eigentlich nicht mehr, man war Feuerwehr f&uuml;r alles....). An diesem besagten
Tag waren meine Kollegen von ESCO anwesend, sowie Uwe Trebbien
(Entwicklersupport) und meine Wenigkeit (1991).
</P>
<P>
Commodore plante intern (!) den A300 (bevor er in A600 umbenannt wurde),
einen A300+ (sp&auml;tere Bezeichnung A600-HD), sowie zwei Varianten eines
&quot;A1000+&quot;.
</P>
<P>
Wer jetzt meint, dies sollte die Weiterentwicklung des A1000 sein, irrt.
Der Amiga 1000+ sollte als ECS und AA Version in Sparform auf den Markt
kommen.
</P>
<P>
In einem Slimline Desktop Geh&auml;use (Pizzabox), zwar nicht als
Tastaturcomputer so wie wir den A500/600/1200 kennen, aber auch mit keinen
richtigen Aufr&uuml;stm&ouml;glichkeiten, da das Geh&auml;use daf&uuml;r nicht hoch genug war.
Zorro-Karten sollten nicht einsetzbar sein. Das Ger&auml;t h&auml;tte vom Geh&auml;use
Platz gehabt f&uuml;r Diskettenlaufwerk, Festplatte und evtl. Prozessorkarte.
Funktionsf&auml;hige Ger&auml;te haben wir nie zu Gesicht bekommen, auch keine
weiteren technischen Details. Es haben sich in Frankfurt lediglich Blech-
Chassis und ein paar Frontblenden eingefunden.
</P>
<P>
Neben allgemeinen Themen ging es um die Frage seitens der Entwickler, wann
denn mit neuen leistungsst&auml;rkeren Ger&auml;ten zu rechnen sei. Darauf antwortete
man seitens ESCO's, da&szlig; dies noch mind. 12 Monate dauern w&uuml;rde und die
Gesch&auml;ftsleitung am &Uuml;berlegen sei, eine weitere ECS Maschine mit
schnellerem Prozessor, mehr Speicher etc. auf den Markt zu bringen, um die
Wartezeit bis zum AA-Rechner zu verk&uuml;rzen (das sollte dann der A1000+ sein,
in ECS-Version). Dies ist den Anwesenden so aber nicht direkt gesagt
worden.
</P>
<P>
Die Ent&auml;uschung war nat&uuml;rlich gro&szlig;. Man dachte wohl in der Runde, da&szlig;
Commodore schon einige Schritte weiter sei...es entwickelte sich daraus
eine doch recht heftige Diskussion und die Frage nach dem Sinn einer
weiteren ECS-Maschine kam hoch. ESCO versuchte die Zweifel zu verstreuen,
mit dem Vorschlag eine Abstimmung durchzuf&uuml;hren, die auch die
Gesch&auml;ftsleitung vorgelegt bek&auml;me. Es sollte gekl&auml;rt werden, ob noch eine
ECS-Maschine gew&uuml;nscht w&uuml;rde oder nicht.
</P>
<P>
Die Abstimmung fand statt und als Ergebnis kam heraus, da&szlig; man doch lieber
noch eine weitere ECS-Maschine haben wollte, als mind. 12 Monate ohne neues
Ger&auml;t dazustehen.
</P>
<P>
Und dann kam mein Auftritt (wer sonst :-)) ). Das Ergebnis wurde dann
nochmal diskutiert, mit meinem Einwand, da&szlig; bei Entwicklung und Vertrieb
einer neuen ECS-Maschine nur weitere Zeit und Kapazit&auml;ten verlorengehen
w&uuml;rden. Commodore w&uuml;rde nach meiner Einsch&auml;tzung nicht noch zus&auml;tzliches
Personal f&uuml;r &quot;AA&quot; einsetzen und es k&ouml;nnte uns passieren, da&szlig; es erheblich
l&auml;nger dauern w&uuml;rde bis wir einen wirklich neuen Amiga in den H&auml;nden halten
k&ouml;nnen, als es Commodore selbst geplant hatte. Zudem w&auml;re eine Entscheidung
f&uuml;r eine weitere ECS Maschine nur als Argument gegen &quot;AA&quot; gewertet worden,
wenn wir Commodore USA zu verstehen gegeben h&auml;tten, wir k&ouml;nnen auch nochmal
12 Monate ohne neue Technik &uuml;berstehen.
</P>
<P>
Grund f&uuml;r meine Besorgnis war die Aktion um den C65. Hierf&uuml;r wurden ja 8
Leute abgezweigt, die ihre Schaffenskraft besser in den Amiga gesteckt
h&auml;tten (sie konnten ja selbst nichts daf&uuml;r) und ich war &uuml;berzeugt, da&szlig; es
bei &quot;AA&quot; genauso ablaufen w&uuml;rde. Meine Kollegen von ECSO versuchten mich
dann zwar vom Gegenteil zu &uuml;berzeugen, sie schafften es aber nicht.
Vielmehr forderten die anwesenden Entwickler eine neue Abstimmung, diesmal
mit dem Ergebnis, Commodore solle seine Zeit besser f&uuml;r &quot;AA&quot; nutzen und
keine weitere ECS Maschine auf den Markt bringen.
</P>
<P>
Ich war zufrieden (muss ich ehrlich sagen), das interne Papier verschwand
wieder vom Tisch, der A1000+ wurde fallengelassen und wir warteten 12
Monate ab.
</P>
<P>
Die Monate vergingen und irgendwann kamen die AA-Prototypen nach
Deutschland.
</P>
<P>
Sie sahen h&auml;&szlig;lich aus (grins), braunes Geh&auml;use, schwarze Frontblende, aber
sie liefen so wie sie es sollten. Leider hatte Commodore USA in Person von
Bill Sydnes (derjenige welche, der auch meinte, IDE sei viel toller,
bessser, sch&ouml;ner) jemanden, dem sie bis dahin voll vertrauten.
</P>
<P>
Eigentlich ist es ihm zu &quot;verdanken&quot;, da&szlig; wir heute im A4000 nicht
standardm&auml;&szlig;ig SCSI haben, sondern IDE und ein Desktop Geh&auml;use, mit dem
niemand so richtig gl&uuml;cklich war. Der Hauptgrund waren die Kosten. Ich
hatte bei Commodore immer das Gef&uuml;hl, &quot;AA&quot; hat man in Angriff genommen,
ohne es richtig zu wollen. Der AA-Rechner kam in einem PC-Desktop
Spargeh&auml;use, mit IDE-Anschlu&szlig; und bis auf das OS war wieder alles in SMD-
Technik gefertigt. Mein wiederholter Vorschlag, die CIA-8520 Chips endlich
zu sockeln, wurde nicht in die Tat umgesetzt. Zuerst hie&szlig; es, man m&uuml;sse das
Board-Layout daf&uuml;r ver&auml;ndern und das sei nicht mehr machbar, dann lag es an
den Kosten....und &uuml;berhaupt sollten unsere H&auml;ndler ja auch was verdienen
(an Reparaturen). Wie auch immer, sie waren gel&ouml;tet.
</P>
<P>
Commodore wollte den A4000 zuerst in vier Varianten auf den Markt bringen,
als 68020 und 68030 Variante (wer sich mal die 68030 Prozessorkarte aus dem
A4000 von Commodore ansieht, kann dort die damaligen Bezeichnungen der
A4000 Prototypen finden), mit wahlweise 1- oder 2MB CHIP-RAM und als
ECS/AA.
</P>
<P>
Die kleineren ECS-&quot;4000er&quot; sollten dann &quot;A2200/A2400&quot; heissen, kamen aber
zum Gl&uuml;ck nicht.
</P>
<P>
Der A4000 wurde (um ihn wenigstens liefern zu k&ouml;nnen !) mit Super-Buster
Version &quot;09&quot; ausgeliefert (die 12 Monate waren lange rum). Bis zum
damaligen Zeitpunkt auch nicht so kritisch, da es keine Zorro-III Karten
gab. Leider :-) bekam auch die Amiga Plus so ein Ger&auml;t zum Testen und
Ottmar R&ouml;hrig (damals Redakteur bei der A+) schrieb im letzten Absatz, da&szlig;
mit dem &quot;09&quot; Buster kein Z-III DMA m&ouml;glich sei, Commodore die &quot;11&quot; Version
des Buster's aber in Arbeit habe. Schlecht f&uuml;r uns, wenn auch verst&auml;ndlich,
da&szlig; die User, die sich bereits den A4000 gekauft hatten auch den &quot;11er&quot;
Buster haben wollten.
</P>
<P>
Wir nahmen dann &quot;Reklamationen&quot; an und verschickten den Buster bei
Verf&uuml;gbarkeit.
</P>
<P>
Dieser Test :-) hatte Commodore gleich einige Mark extra gekostet. Zweites
&Uuml;bel war dann noch die Tatsache, da&szlig; der Buster anfangs nicht mal gesockelt
war, also f&uuml;r diesen Zweck gleich in die Werkstatt musste. Sp&auml;tere Amiga
4000 bekamen dann einen gesockelten Buster.
</P>
<HR>
<P>
Der A4000 war f&uuml;r Commodore eigentlich auch keine Rettung mehr. Er konnte
zwar mehr, kostete aber auch viel mehr und richtige St&uuml;ckzahlen erreichte
Commodore auch nicht. Dazu noch die Aktion mit dem Buster, die viele Kunden
verunsicherte, ob sie sich &uuml;berhaupt einen A4000 kaufen sollten. In meinen
Augen war &quot;AA&quot; wichtig, denn viele Softwareentwickler machten ihre weitere
T&auml;tigkeit auf dem Amiga davon abh&auml;ngig, da&szlig; sie ihre PC-Spiele mit damals
256 Farben einfach auf den Amiga portieren konnten, ohne alles auf ECS mit
32 Farben (oder HAM) beschr&auml;nken zu m&uuml;ssen. &quot;AAA&quot; hat Commodore leider
nicht mehr erlebt, auch wenn Dave Haynie schon funktionierende Prototypen
davon hatte. Der A4000-Tower war zwar ein sch&ouml;nes Ger&auml;t, aber so richtig
fehlerfrei war er nie und auch &quot;zu teuer&quot;.....er erreichte seine Zielgruppe
nicht.
</P>
<P>
Wir haben sowohl als Abteilung als auch von Entwicklerseite immer &quot;unsere&quot;
Vorstellungen eines Amiga (nach einem A3000) an unsere Gesch&auml;ftsleitung
weitergereicht, immer mit der Hoffnung man w&uuml;rde auf uns h&ouml;ren, leider ohne
Erfolg.
</P>
<P>
Sachen wie RTG (Retargetable Graphics), 24Bit, 16Bit Sound und vieles mehr
kamen einfach nicht zustande. Auch ein Grund, warum ich Aufrufe von den
Amiga-Zeitungen verurteile, in denen die Leser immer wieder aufgerufen
werden doch ihren Wunschamiga zusammenzustellen, in der Hoffnung
irgendjemand w&uuml;rde sie erh&ouml;ren. Sei es zu Commodore-, oder zu Escom/Amiga
Technologies- oder Gateway 2000-Zeiten. Es wird in meinen Augen nicht
passieren, da bis heute keiner der f&uuml;hrenden K&ouml;pfe &quot;DEN&quot; Amiga verstanden
hat.
</P>
<P>
Neben der Unf&auml;higkeit von Commodore, wirklich &quot;innovativ&quot; zu sein, wurde
C= von au&szlig;en und C= von innen einfach &uuml;bersch&auml;tzt. Nach au&szlig;en entstand
immer der Eindruck, Commodore habe Millionen Mitarbeiter in zig L&auml;ndern und
man m&uuml;sse nur mit dem Finger schnippen um ein Produkt zu erhalten.....so
war Commodore nie. Ich w&uuml;rde sie eher in die Kategorie &quot;Konsolen-
Produzenten&quot; eindordnen.....etwas experimentelle Entwicklung mit dem Ziel
nach schnellem Profit ohne langen Atem.
</P>
<P><B>===========================================================================</B></P>
<P>
Mail dazu von Holger Lubitz (<A HREF="mailto:lubitz@linuxservice.de">lubitz@linuxservice.de</A>):
</P>
<P>
Auf Seite 8 schreibst Du:
</P>
<P>
Der A4000 wurde (um ihn wenigstens liefern zu k&ouml;nnen !) mit Super-Buster
Version &quot;09&quot; ausgeliefert (die 12 Monate waren lange rum). Bis zum
damaligen Zeitpunkt auch nicht so kritisch, da es keine Zorro-III Karten
gab. Leider :-) bekam auch die Amiga Plus so ein Ger&auml;t zum Testen und
Ottmar R&ouml;hrig (damals Redakteur bei der A+) schrieb im letzten Absatz, da&szlig;
mit dem &quot;09&quot; Buster kein Z-III DMA m&ouml;glich sei, Commodore die &quot;11&quot; Version
des Buster's aber in Arbeit habe.
</P>
<P>[...]</P>
<P>
Da tr&uuml;gt Dich Deine Erinnerung ein bisschen.
</P>
<P>
Otti hat damals zwar noch f&uuml;r die A+ gearbeitet, aber ich hatte ihn gerade
erfolgreich auf Grafik &amp; Video reduziert. Den Test habe ich mit Mick
Hohmann gemacht (er Software, ich Hardware), der das Ding irgendwie von Uwe
bekommen hatte. Wir hatten den anfangs unter striktem NDA, aber mit der
Andeutung, dass das bald fallen k&ouml;nnte.
</P>
<P>
Ungef&auml;hr einen halben Tag vor Drucktermin kam die Freigabe. Die A+ hatte
den kompletten Kram auf Verdacht gesetzt und so konnte es noch ins Heft.
Wir waren die ersten. (Und wir hatten wirklich die allerbesten Absichten.
So habe ich den A4000 nicht verrissen, trotz der ganzen Unsch&ouml;nheiten,
sondern ihn einfach als Midrange eingeordnet, wo der Preis Kompromisse
erforderlich macht. Der Preis (auf dem Niveau bisheriger 040-Turbokarten)
war ja auch danach. Das DMA-Problem habe ich nicht erw&auml;hnt, da es damals eh
noch keine Z3-Karten gab, und wir nicht wussten, welche Revision &uuml;berhaupt
in die Verkaufsger&auml;te kommt, die Kisten mit der schwarzen Blende hatten
noch -07. Und ich hatte ganz zuf&auml;llig die Planungen f&uuml;r LAN und DSP als
&quot;w&uuml;nschenswert&quot; untergebracht, die wir von der DevCon kannten, die die
&quot;Oben&quot; bei C= aber nicht wollten - um ESCO Argumentationsmaterial zu
liefern, (hat aber ja leider nichts gebracht).
</P>
<P>
Otti hat den Rechner (AFAIR denselben) erst einen Monat sp&auml;ter f&uuml;r die c't
getestet, den hab ich ihm noch selbst in Hamburg vorbeigebracht.
</P>
<P>
Da k&ouml;nnte ich jetzt noch eine Abrechnung mit der Amiga Plus anh&auml;ngen, die
damals gute Leute und schlechtes Management hatte. Es kam wie es kommen
musste: Brandl blieb, Rene, Claus und J&ouml;rg wurden gegangen.
</P>
<P>
Ich dann etwas sp&auml;ter freiwillig mit. Auf die Nachfolger konnte ich
verzichten. Besonders die Redaktionsau&szlig;enstelle, die pl&ouml;tzlich alles
zentral verwalten musste, was wir Freien vorher prima unter uns geregelt
hatten, war heftig. Aber das wuerde zu weit f&uuml;hren.
</P>
<P><B>Holger</B></P>
<P>
(Du darfst das gern als Zitat einf&uuml;gen.)
</P>
<P><B>Mein Kommentar:</B></P>
<P>
Ich glaube mich recht gut erinnern zu k&ouml;nnen, da&szlig; es Otti war, der den Test
&quot;unterschrieben&quot; hatte. Wolfgang Trompetter war seiner Zeit recht &quot;erbost&quot;,
da&szlig; gerade auf die Buster &quot;Probleme&quot; hingewiesen wurde, im letzten Absatz.
Ich kann es allerdings nicht mehr beschw&ouml;ren, da ich die Ausgabe sicherlich
nicht mehr habe, es kann daher auch im Amiga Magazin oder einem anderen
Magazin gewesen sein.
</P>
<HR>
<P>
Mail dazu von Ralph Schmidt (<A HREF="mailto:laire@basis.owl.de">laire@basis.owl.de</A>):
</P>
<P>
Bzgl. deiner neuer Seite stimmen ein paar Sachen nicht:-)
</P>
<P>
Das Amiga Developer Meeting war im Mai 92 (ich war auch anwesend).
</P>
<P>
Bzgl. Abstimmung...es war erschreckend, dass es diverse Leute in der Amiga
Entwickler Szene gab, die noch f&uuml;r einen A2000 ECS Nachfolger pl&auml;dierten,
statt AA.
</P>
<P>
(Ich war strikt gegen ECS - desweiteren kann ich mich hier jetzt nicht
bewusst an ein A1000+ erinnern, sondern nur an einen A2000
&quot;Nachfolger&quot;...glaube A2200 wurde hier als Bezeichnung erw&auml;hnt. A2400 war
dann ja die A4000 Bezeichnung. Das A3640-Billigboard im A4000 kam von der
A2200er Kiste.). Desweiteren wurde auch &uuml;berhaupt nicht der Ernst der Lage
im Spielemarkt gesehen.
</P>
<P>
Kann mich noch genau erinnern, wie Hirsch &amp; Wolf die besorgniserregende
Entwicklung am Spielemarkt verneint hat. Der Amigamarkt ist nicht nur an
der &quot;Dummheit&quot; des CBM Management vor die Hunde gegangen. Die Amiga
&quot;Szene&quot;.....H&auml;ndler, Pseudo-Entwickler und prof. Entwickler haben es selbst
nicht sehen wollen.
</P>
<P>Dann zum A4000</P>
<P>
Der kam Ende September 92...also keine 12 Monate sp&auml;ter. Das mit dem
Buster09 Fehler (der Buster-11 hat wahrscheinlich noch mehr) kam November
92 raus, wegen der Fastlane Entwicklung bei Phase5. Es wurde monatelang
verneint, ignoriert, verharmlost und runtergespielt. Dann wurde pl&ouml;tzlich
&uuml;berraschend auf der Devcon im Feb. 93 der A4091 vorgestellt und man sagte,
dass er nur mit einem neuen Buster laufen w&uuml;rde. Auf der DevCon wurden dann
Buster rev *10* an Phase5 verteilt, die leider nur 30 Minuten Zorro3
aufrechterhalten konnten (wohl ein W&auml;rmeproblem).
</P>
<P>
Wenn ich mich recht erinnere kam dann im Mai der 4091 mit dem rev11, der
aber selber noch massive Bugs hatte. Der DSP im A3000+ starb um Feb. 92,
wenn ich mich recht erinnere. Apropos AAA...es starb Dez. 93.....danach
wurde irgendein svga/rtg projekt f&uuml;r ein paar Monate angefangen.
</P>
<P><B>Ralph Schmidt,<A HREF="mailto:laire@popmail.owl.de">laire@popmail.owl.de</A>(private),NextMail welcome</B></P>
<P><B>Mein Kommentar:</B></P>
<P>
In Anbetracht der verstrichenen Zeit (der ganze Kram ist mir lange genug
mit genauen Zeitabl&auml;ufen durch den Kopf gegangen :-)), versuche ich mich
auf halbwegs passende Zusammenh&auml;nge zu konzentrieren, die inhaltlich noch
ok sind.
</P>
<P>
Ob der A4000 nun 11 oder 13 Monate sp&auml;ter kam, erachte ich nicht mehr als
ausschlaggebend. :-)
</P>
<P>
Der A1000+ im Slimline Geh&auml;use war zu Devcon's vermutlich nichtmal ein
Thema, weil er (siehe Papier) total mega-geheim war und selbst wir
eigentlich nichts davon mitbekommen sollten. War eher eine Ausnahme, da&szlig;
wir es doch wussten.
</P>
<P>
Was den Buster angeht, so ist er in vielen Punkten doch eher eine Hilfe,
auch wenn er selbst als Rev. -11 nicht fehlerfrei ist. Meiner Erinnerung
nach sollte es noch einen -12 geben, den Dave Haynie bearbeiten
wollte/sollte, dazu kam es allerdings nicht mehr.
</P>
<HR>
<P>
Frage(n) von Chris Classen (<A HREF="mailto:Jones@JAMIGA.INSIDER.ORG">Jones@JAMIGA.INSIDER.ORG</A>):
</P>
<UL>
<LI> Hat sich der A3000 wegen des A4000 so schlecht verkauft (alle schienen
</LI>
</UL>
auf den A4000 zu warten) ?
<P><B>Antwort:</B></P>
<P>
Der A3000 und der A3000T sollten zumindest den semiprofessionellen
Anspr&uuml;chen gen&uuml;gen und dementsprechend fiel der Verkaufspreis aus. Der
A3000T kostete bei Einf&uuml;hrung &uuml;ber 10.000 DM. Innerhalb der ersten 6 Monate
ging er auf unter 8.000 DM runter. Man erreichte die Zielgruppe nicht und
wenn man eine fand, war der Preis zwar &quot;professionell&quot; aber der Support
seitens Commodore eher nicht. Klar, ging irgendwo nicht. Ein Unternehmen
kann ich nicht zu einem Amiga-H&auml;ndler schicken, wenn er Unterst&uuml;tzung haben
m&ouml;chte und richtige &quot;Systemh&auml;user&quot; von Commodore gab es auch nicht. Es war
eher ein Versuch, mit einem guten Produkt viel Geld rauszuholen und sich
wiedermal nicht um das &quot;nachher&quot; zu k&uuml;mmern. Zudem kostete ein A3000T etwa
das Doppelte gegen&uuml;ber einem A3000 Desktop. Nur um einen Tower zu erhalten,
der mehr Platz bietet, war jedenfalls nicht gerade verkaufsf&ouml;rdernd.
</P>
<P>
Dem A3000 erging es nicht anders. Flickerfixer onboard....da muss man dem
Kunden auch erstmal klarmachen wof&uuml;r man sowas braucht. Nicht jeder K&auml;ufer
dieser Ger&auml;te hatte schon mal einen Amiga. Sternwarte Hamburg etc. waren
z.B. Kunden der A3000UX (Unix) Ger&auml;te. Um die (und andere) konnte man sich
noch k&uuml;mmern, aber jeder Mehraufwand war von C= direkt eigentlich nicht zu
bew&auml;ltigen.
</P>
<P>
Der A4000 hat damit eigentlich nichts zu tun.&laquo;
</P>
<P>
Fortsetzung folgt...
</P>
<P ALIGN="RIGHT">
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
