<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerPC3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Der Zwischenruf
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Der Zwischenruf</H1>
<P>
Django braucht keinen Fernseher ....
</P>
<P>
Willkommen zum heutigen Zwischenruf. Meckern macht Spa&szlig; .... besonders wenn
man's selbst nicht besser machen kann. Aus diesem Grunde meckere ich heute
mal &uuml;ber ein sehr allt&auml;gliches Problem: Der verdorbene Fernsehabend ....
und ich Beweise, da&szlig; ich etwas dagegen tun konnte.
</P>
<P>
Schuld war mal wieder die Volksmusik. Als verkappter Softrocker bin ich ja
schon angetan, wenn Herbert &quot;Gr&ouml;hli&quot; Gr&ouml;hnemeier seine &quot;Flugzeuge im Bauch&quot;
kreisen l&auml;&szlig;t. Xavier Naidoo mit &quot;Sie sieht mich nicht&quot; h&auml;tte mir auch noch
einen tiefen seufzer entr&uuml;ckt. Aber mu&szlig;ten unbedingt die &quot;Wildecker
Herzbuben&quot; Ihren festlichen Abend mit dem meinigen kreuzen!?
</P>
<P>
Da die Couch zu Beginn des Abendprogramms einer meiner bevorzugten Pl&auml;tze
im 30qm-Appartment ist und die Fernbedienung (aufgrund einer ausgepr&auml;gten
Kurzsichtigkeit) in unerreichbarer (bzw. unsichtbarer) Entfernung ihr
Dasein fristet mu&szlig; ich das wohl oder &uuml;bel ertragen ....
</P>
<P>
Der Frust sitzt aber tief und deshalb machen wir am Besten erst mal eine
Flasche vom mittlerweile bekannten Frankenwein auf; vielleicht l&auml;&szlig;t es sich
danach etwas leichter schmachten.
</P>
<P>
Aber nach dem zweiten Glas ist Schlu&szlig; ... ich raffe mich auf und mach N&auml;gel
mit K&ouml;pfen: Glotze aus !! &quot;Ihr habt es geschafft, ich kapituliere&quot; denk'
ich mir noch so beim ausschalten. Doch kein entrinnen ... mein Nachbar hat
seine Stereoanlage an den Fernseher angeschlossen und qu&auml;lt mich
erbarmungslos mit &quot;Herzilein&quot; in Dolby Souround.
</P>
<P>
Ich &quot;greif&quot; zur Flasche und will mir das dritte Glas einschenken.
Pl&ouml;tzlich &uuml;berkommt mich ein teuflischer Plan .... meinen Nachbarn konnte
ich noch nie leiden. Und wozu braucht ein 68-j&auml;hriger Dolby Souround? Der
h&ouml;rt ja oft noch nicht mal seinen Dreiklang-Gong der T&uuml;rklingel.
</P>
<P>
Mein Blick schweift durch die kleine Wohnung. Wie ein Neandertaler suche
ich nach einem virtuellen Knochen, mit welchem ich meine Territorial-
Anspr&uuml;che gegen&uuml;ber meinem Nachbar und seiner &quot;Herzbuben-Armee&quot; geltend
machen kann. Mein Blick bleibt an einem kleinen elektronischen Ger&auml;t,
welches starke &Auml;hnlichkeiten mit einem Brotkasten hat kleben.
</P>
<P>
Mein A 1200 - Desktop mit Blizzard PPC-Board und einigen anderen
Spielereien strahlt mich heroisch an. Meine Freundin, meine letzte Rettung
... noch nie erschien mir Ihr beiges Kleid so h&uuml;bsch.
</P>
<P>
Netzteil, Monitor und Modem an ... ein sanftes aber teuflisches Surren
durchstr&ouml;mt den Raum und signalisiert mir, dass meine Armee zum
Gegenangriff bl&auml;st.
</P>
<P>
Eilig ziehe ich mir aus dem Aminet ein mir bereits bekanntes, absolut
&auml;tzendes MP3-File. Viel Trash, viel Hardcore-Techno ... aber ein Held mu&szlig;
eben auch leiden k&ouml;nnen. Und provozieren hat man mich noch nie d&uuml;rfen.
</P>
<P>
Mittlerweile bin ich beim vierten und letzten Glas angekommen ... die
Flasche ist leer. Mein Nachbar ist zwischenzeitlich auf Patrick Lindner
umgestiegen ... damit macht er den gr&ouml;&szlig;ten fehler seines Lebens. Er fordert
mich heraus. Das macht der Schlawiner bestimmt mit Absicht!!
</P>
<P>
AmigaAMP ist zwischenzeitlich geladen, meine Stereoanlage (auch Dolby
Surround) ist angest&ouml;pselt. Schwei&szlig;gebadet und mit zitternder rechter Hand
versuche ich den Mauspfeil auf das Play-Zeichen von AMP auszurichten ....
der Zeigefinger dr&uuml;ckt die linke Maustaste zum Abschu&szlig; und .... verdammt
daneben. Stefanie H&auml;rtels Stimme fliegt mittlerweile im Kamikaze-Sturzflug
durchs Zimmer. Ich blicke gescheucht auf mein Glas, mit schmerverzerrtem
Blick greife ich zu ... ich leere es mit einem Zug und greife wieder zur
Maus. Diesmal mu&szlig; es klappen.
</P>
<P>
Klick und ..... aus meiner Stereo-Anlage br&uuml;llt ein ohrenbet&auml;ubender L&auml;rm.
Ich perfektioniere die B&auml;sse .... bumm bummm bumm . Welch erl&ouml;sender
Engelsklang.
</P>
<P>
Nach 5 Minuten ist der Spuk vorbei. Der Song ist aus und ..... ich lausche:
Stille. Wie nach einem Atomschlag; richtig gespenstisch. Meine Muskeln
entkrampfen sich, mein Gesicht erhellt sich. Sollte ich gesiegt haben? Es
scheint wirklich so.
</P>
<P>
Am n&auml;chsten Morgen, ich hatte s&uuml;&szlig;e Tr&auml;ume und einen erholsamen Schlaf,
treffe ich Opi auf der Treppe. Er schaut mich an und fl&uuml;stert mir ins Ohr:
&quot;Sagen Sie mal Herr Driesner, haben Sie gestern Abend auch dieses
eigenartige Ger&auml;usch geh&ouml;rt?&quot; Ich schaue ihn erstaunt an ... sollte er etwa
keinen Verdacht sch&ouml;pfen? Oder testet er nur meien Nerven?
&quot;Nein Herr X. Welches Ger&auml;usch?&quot;.
</P>
<P>
&quot;Sie haben wirklich nichts geh&ouml;rt?&quot;. &quot;Nein. Wirklich nicht!!&quot; beteuerte ich
und setzte einen skeptischen Blick auf. Opi X - peinlich ber&uuml;hrt -
entgegnete &quot;Dann stimmt wohl mit meinem neuen Wohnzimmer-Radio etwas
nicht.&quot; (dieser scheinheilige Hund) &quot;Ich kann's mir nicht anders erkl&auml;ren.
Ach dieses neumodische Zeugs. Teuer und bringt doch nichts, stimmt's?&quot; Ich
blickte ihn etwas nachsichtig an, l&auml;chelte verst&auml;ndnisvoll und sprach nach
einer kleinen Pause &quot;Auf Wiedersehen Herr X, ich mu&szlig; noch in den Keller und
eine Flasche Wein'chen holen f&uuml;r heute Abend&quot;. Ich drehte mich um und ging
die Treppen hinunter.
</P>
<P>
Ja, ja, Opi hat schon recht; dieses neumodische Zeugs bringt nichts. Der
Beweis: Lieber einen sieben Jahre alten Rechner als eine zwei Wochen alte
Stereo-Anlage.
</P>
<P><B>Lebt lang und erfolgreich</B></P>
<P><B>Ralf Driesner &lt;<A HREF="mailto:global.dries@gmx.de">global.dries@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="PowerPC3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
