<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, savior, iron, iron savior, dark assault, sielck, hansen, power melodic">
<title>Iron Savior: Dark Assault</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><h1><font color="#00ff00">Iron Savior: Dark Assault</font></center></h1></P>


<p>Mit Iron Savior ist das schon so eine Sache: 1997 als Sideprojekt von Piet Sielck, Kai Hansen (Gamma Ray) und Thomas Stauch (Blind Guardian) gegr&#252;ndet, entwickelte sich aus dem anf&#228;nglichen Projekt eine richtige Band, die nach dem offiziellen Debut &quot;Iron Savior&quot; (1997) noch ein weiteres Studioalbum namens &quot;Unification&quot; (1999) einspielte und im selben Jahr mit &quot;Interlude&quot; eine weitere CD mit Live St&#252;cken und neuen Track am Start hatte. Sp&#228;testens aber mit dem neuen Album &quot;Dark Assault&quot; sollte aber auch der letzte Kritiker Iron Savior als richtige Band anerkennen und nicht mehr nur, bedingt durch Kai Hansens Mitwirkung, als Gamma Ray Sideprojekt betrachten, zumal auch die musikalische Klasse der Band, die nunmehr als Sextett auftritt, eindeutig f&#252;r sich spricht: &quot;Dark Assault&quot; ist ein wirklich starkes Album geworden, welches man in groben Grundz&#252;gen als Mischung aus dem straighten Debutalbum und dem etwas verspielterem &quot;Unification&quot; betrachten kann und insofern recht ausgewogen daherkommt: So wechseln sich die typischen Iron Savior Uptempogranaten der Marke &quot;Never Say Die&quot;, &quot;I Have Been To Hell&quot; und &quot;Firing The Guns&quot; mit etwas aufwendigeren St&#252;cken wie etwa dem ruhigeren &quot;Dragons Rising&quot; oder dem dramatisch / epischem &quot;Made Of Metal&quot;, bei dem auch orchestrale Parts zum tragen kommen, ab und sorgen somit f&#252;r viel Abwechselung auf &quot;Dark Assault&quot;. Dazu gibt`s mit der Kai Hansen Komposition &quot;Solar Wings&quot; einen Track, den selbst die Jungs von Judas Priest zu ihren besten Zeiten nicht gelungener hingekriegt h&#228;tten. Aprospos Judas Priest: Einige Parallelen zu eben dieser Band lassen sich auch mal wieder musikalisch ausmachen (wenngleich Iron Savior nicht krampfhaft versuchen, diese Legende zu kopieren, sondern sehr eigenst&#228;ndig zu Werke gehen) und gipfeln sich schlie&#223;lich in der abschlie&#223;enden Coverversion des Priest Klassikers &quot;Delivering The Goods&quot;, wenngleich die mitlerweile vierte (!!) Coverversion von Judas Priest in der Karriere von Iron Savior nicht besonders spektakul&#228;r ausgefallen ist und sich sehr nahe am Original bewegt. Macht aber auch nichts, denn die 11 Iron Savior Tracks auf diesem Album sind auch alleine stark genug um locker mit den &#228;lteren Werken der Band mithalten zu k&#246;nnen, wenngleich ich zugeben muss, da&#223; ich mich erst ein wenig in &quot;Dark Assault&quot; reinh&#246;ren musste. Das soll aber nicht negativ gemeint sein, da &quot;Dark Assault&quot; ohne wenn und aber ein w&#252;rdiges dritte Iron Savior Album geworden ist, an dem man eigentlich nicht viel auszusetzen hat. Klaro, da&#223; Iron Savior &amp; Gamma Ray Fans hier blind zugreifen m&#252;ssen und alle Fans vom teutonischen Metal die Scheibe auch nicht links beim CD H&#228;ndler liegen lassen sollten. </P>

<p>Fazit: 9.5 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd2.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
