<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, rob rock, rob, rock, rage of creation ">
<title>Rob Rock: Rage Of Creation</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><h1><font color="#00ff00">Rob Rock: Rage Of Creation</font></center></h1></P>

<p>Als einer der positiven &#220;berraschungen des ausklingenden Jahres 2000 geht der Soloeinstand von Rob Rock durch, seines Zeichens ehemaliger S&#228;nger von Bands wie Axel Rudi Pell, Impelliteri, M.A.R.S und Driver. Mit &quot;Rage Of Creation&quot; hat Rob Rock nun sein erstes Soloalbum am Start, bei dem ihm beim Songwriting, Produktion und technischer Umsetzung niemand geringeres geholfen hat als Roy Z., der unter anderem schon Acts wie Halford, Helloween und nat&#252;rlich Bruce Dickinson unter die Arme gegriffen hat. Schon durch diese Konstellation wird klar, was den geneigten H&#246;rer auf &quot;Rage Of Creation&quot; erwartet: Traditioneller Melodic Metal mit klaren Anleihen an die 80er Jahre, was nicht nur das Songwriting, sondern auch insbesondere die Produktion betrifft. Das das Duo, welches auf der CD &#252;brigens noch von Gastmusiker Jake E. Lee (Ozzy Osbourne, Badlands) unterst&#252;tzt wird, zu wahren H&#246;chsttaten f&#228;hig ist, war zwar irgendwie schon im Vorfeld klar, aber das &quot;Rage Of Creation&quot; ein derma&#223;en &#252;berzeugendes Album wird, hat mich dann doch ein wenig &#252;berrascht. Schon der hypereing&#228;ngige Opener &quot;The Sun Will Rise Again&quot; deutet das hohe musikalische Niveau der Band an und auch weitere Tracks wie etwa der Melodic Rocker &quot;Never Too Late&quot;, das von einem starken Riff getragene &quot;Media Machine&quot; oder auch die abschlie&#223;ende Halbballade &quot;Forever&quot; untermauern nochmals nachhaltig, warum Rob Rock nach wie vor zu einem der f&#228;higsten S&#228;ngern und Songwritern geh&#246;rt, die die Melodic Metal Szene zu offerieren hat. Etwas entt&#228;uscht hat mich lediglich der etwas belanglose Track &quot;In The Night&quot; sowie die Coverversion des Abba Hits &quot;Eagle&quot;, da man sich bei letzterem zu offensichtlich bei Black Sabbaths Meilenstein &quot;Heaven &amp; Hell&quot; bedient hat. Wenn man von diesen beiden Ausnahmen mal absieht (Coverversionen sind ohnehin immer Geschmackssache), bleibt unter dem Strich eine sehr gute Melodic Metal Scheibe &#252;brig, welches Fans dieses Genres blind abgreifen k&#246;nnen und unter Garantie nicht mehr herausgeben wollen. Bleibt nur zu hoffen, da&#223; Rob Rock uns irgendwann 
noch mit einem zweitem Soloausflug begl&#252;ckt, der auf einem &#228;hnlich hohen Niveau angesiedelt ist.</P>

<p>Fazit: 8.5 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd4.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
