<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, grave, digger, grave digger, the reaper">
<title>Oldie Review: Grave Digger`s The Reaper</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><h1><font color="#00ff00">Oldie Review: Grave Digger`s The Reaper</font></center></h1></P>

<p>Eine der Combos, die man in einem Atemzug mit Acts wie Helloween, Gamma Ray und Running Wild nennen muss wenn das Gespr&#228;ch auf deutschen Heavy Metal kommt, sind ohne Frage Grave Digger, die Anfang der 80er Jahre mit &quot;Heavy Metal Breakdown&quot;, &quot;Witch Hunter&quot; und &quot;War Games&quot; drei Meilensteine vorlegten, ehe man sich unter dem Namen &quot;Digger&quot; dem Mainstream Markt widmete und damit 1986 mit dem Album &quot;Stronger Than Ever&quot; eine b&#246;se Pleite erlebt und sich anschlie&#223;end aufl&#246;st.</P>

<p>1993 versuchen die beiden ehemaligen Grave Digger Members Chris Boltendahl (Vocals) und Uwe Lulis (Gitarre) ein Comeback und legen, zusammen mit Bassist Thomas G&#246;ttlich und Schlagzeuger J&#246;rg Michael (u.a. Rage, Stratovarius, Running Wild etc.) die Scheibe &quot;The Reaper&quot; vor, die natlos an alte Glanztaten ankn&#252;pfen kann und aus meiner Sicht immer ein wenig im Schatten der sp&#228;teren grandiosen Werke der Band wie &quot;Tunes Of War&quot; oder &quot;Heart Of Darkness&quot; stand und dadurch etwas in den Hintergrund r&#252;ckte, obwohl es sich um eine wirklich excellente Scheibe handelt. &quot;The Reaper&quot; gl&#228;nzt vor allem durch seine kompromisslose H&#228;rte, die, zusammen mit der kratzigen Stimme von Chris Boltendahl und dem immer vorhandenen Gesp&#252;r f&#252;r eing&#228;ngige Melodien, zwar schon immer ein Trademark von Grave Digger war, aber auf &quot;The Reaper&quot; bis zur Perfektion ausgereizt wird. So wird folgerichtig auch kr&#228;ftig auf`s Gaspedal getreten, was sich insbesondere in Songs wie dem Opener und Grave Digger Klassiker &quot;The Reaper&quot;, das nachfolgende, nicht minder schwache und &#228;u&#223;erst eing&#228;ngige &quot;Ride On&quot; oder auch den Abschluss der CD &quot;Ruler Mr. H.&quot; wiederspiegelt. Mit &quot;Legion Of The Lost - Part II&quot; befindet sich auf &quot;The Reaper&quot; auch noch eine etwas anspruchvollere Komposition, die insbesondere durch die Tempowechsel zu gefallen vermag und eine wohlwollende Abwechselung zu den anderen Speed Nummern darstellt.</P>

<p>Insgesamt ist &quot;The Reaper&quot; also ein wirklich hervorragendes Heavy Metal Album geworden, welches sich in der History von Grave Digger weder hinter den Vorg&#228;ngern noch hinter den beileibe nicht schlechten Nachfolgern eines Kalibers wie etwa &quot;Tunes Of War&quot;, &quot;Excalibur&quot; oder &quot;Heart Of Darkness&quot; verstecken braucht. Da die Scheibe zudem noch amtlich fett produziert ist (hier hatte u.a. Piet Sielck, heute mit seiner Band Iron Savior aktiv, seine Finger 
im Spiel) und keinerlei Aussetzter enth&#228;lt, kann ich &quot;The Reaper&quot; all jenen empfehlen, die aufschn&#246;rkelosen, gradlinigen Heavy Metal stehen, der ansonsten in Deutschland noch von Acts wie beispielsweise Running Wild verk&#246;rpert wird. Geiles Album!</P>

<p>Fazit: 10 von 10 Punkten</P>

<center>
<p><img src="kit.gif"></P>
<p><img src="oldie.jpg"></P>
<p><img src="kit.gif"></P>
</Center>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
