<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Neues zum AmigaNG
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Neues zum AmigaNG</H1>
<H2>1. Neues Executive Update von AMIGA-CEO Bill McEwen</H2>
<P><B>AMIGA, Inc. (<A HREF="http://www.amiga.com" TARGET="_top">http://www.amiga.com</A>) informiert:</B></P>
<P><B>&raquo;Executive Update - AMIGA-Status und Ank&uuml;ndigungen</B></P>
<P><B>Bill McEwen - 22. Februar 2002</B></P>
<P><B>Meine Gr&uuml;&szlig;e an die weltweite Amiga-Familie!</B></P>
<P>
Ja, ich wei&szlig;, es hat l&auml;nger als eine Woche gedauert und, ja, die
Verhandlungen laufen immer noch und, ja, es geht flott vorw&auml;rts mit
uns, wie ich es Ihnen allen weiter unten beschreiben werde.
</P>
<P>
Ich m&ouml;chte pers&ouml;nlich allen unseren Freunden und Familien danken, dass
sie zu uns und unseren Tr&auml;umen gehalten haben, die nun Wirklichkeit
werden sollen.
</P>
<P>
AMIGA entwickelte sich in den vergangenen zwei Jahren, und unsere Pl&auml;ne
mussten nur leichte &Auml;nderungen erfahren, deshalb m&ouml;chte ich jedem Einzelnen
von Ihnen danken f&uuml;r Ihre Geduld und Hoffnung bei unserem Voranstreben.
</P>
<P>
Im Jahre 1999 entschloss sich AMIGA, Inc., einen vollst&auml;ndig anderen Weg
einzuschlagen als den, der zuvor f&uuml;r die Gemeinschaft aufgezeichnet
war. Von einigen wurde er ungl&auml;ubig betrachtet, von den meisten aber mit
der Erwartung, dass ein Pfad geschlagen wird in eine Zukunft, in der
digitale Inhalte von jedem beliebigen digitalen Ger&auml;t in Anspruch genommen
werden k&ouml;nnen. Amiga w&auml;hlte mit der Tao-Group in Reading, England, einen
unbekannten Partner, und ich kann Ihnen versichern, das war die beste
Entscheidung, die wir je getroffen haben.
</P>
<P>
Nie zuvor waren Tao und AMIGA enger in einer wahren Partnerschaft
verbunden als jetzt. Ich m&ouml;chte meinem lieben Freund Francis Charig danken
genau so wie dem Rest des Tao-Teams, da sie uns zu den Erfolgen gef&ouml;rdert
haben, die bald &ouml;ffentlich bekannt gegeben werden.
</P>
<P>
Doch bei allen den gro&szlig;en Pl&auml;nen, die wir hatten, und bei der Entwicklung
der Produkte, die begonnen hatte, bestand immer die Notwendigkeit, die
erforderlichen Mittel daf&uuml;r zur Verf&uuml;gung zu haben, und da war der Zugang
von Frank Wilde als unser Vorsitzender eine erstaunliche Hilfe, und ich
kann sagen, dass AMIGA voran schreitet in einer Weise, die AMIGA auf
neue Ebenen bringen wird und ich k&ouml;nnte nicht gl&uuml;cklicher sein als mit
den Ergebnissen, die nun in Sichtweite sind.
</P>
<P>
Dank an Sie alle, die die Treue halten und die Wahrheit &uuml;ber AMIGA
weitergeben.
</P>
<P>
Ich habe einige Ank&uuml;ndigungen &uuml;ber Dinge zu machen, die hier geschehen
und Sie sollen wissen, dass wir im Jahr 2002 mehr auf Amiga basierende
Produkte ausliefern werden als in den fr&uuml;heren Jahren.
</P>
<UL>
<LI> Unser STB (Set Top Box) Partner - Nokia - und sein neues Media
     Terminal. Ja, das gleiche Nokia, dass Sie alle kennen und lieben.
     Amiga wird auf diesem Produkt vorinstalliert sein und wir werden
     die Auslieferung im Fr&uuml;hsommer dieses Jahres beginnen. Die Ank&uuml;ndigung
     von Nokia wird in den n&auml;chsten Wochen auf deren Website erscheinen,
     aber wir haben den Vortritt und stellen unsere Ver&ouml;ffentlichung
     vor, und danach wird noch eine gemeinsame Erkl&auml;rung folgen.
</LI>
<BR><LI> Ich erhalte oft Mitteilungen mit der Frage, wann wir den Rest der
     Welt von dem, was geschieht, in Kenntnis setzen. Nun, f&uuml;r alle, die
     gefragt haben - AMIGA wird an der Embedded Systems Show in San
     Francisco, Kalifornien, vom 12. bis 15. M&auml;rz teilnehmen. Wir werden
     im Stand 1602 in der S&uuml;dhalle des Moscone Center sein. Wir werden
     die neue Amiga Technologie vorstellen und einige erstaunliche neue
     Eigenschaften zeigen, die bisher noch bei keinem anderen Produkt zu
     sehen waren. Wir werden dort bei der Show mindestens eine weitere
     Ank&uuml;ndigung machen.
</LI>
<BR><LI> Wir haben zwei neue Mitglieder in unser Team aufgenommen, und bald
     werden viele weitere genannt werden. Die ersten Beiden sind Teil
     unser Vertriebsmannschaft. Beide sind voll engagiert und freuen sich,
     bei der Amiga-Familie zu sein. Liz Barnick und David Brott traten im
     Januar zu uns und arbeiten sich schnell ein mit neuen Gesch&auml;ftsideen
     und guten Vorschl&auml;gen. Ich habe Informationen &uuml;ber beide Mitarbeiter
     in einem weiteren Dokument zusammengestellt, das diesem Update
     beigef&uuml;gt ist.
</LI>
<BR><LI> AmigaOS 4.0 macht sch&ouml;ne Fortschritte und ich freue mich sehr &uuml;ber
     Hyperion und die Art und Weise, wie sie die Dinge voran treiben.
     Wir alle werden stolz sein mit dem Ergebnis ihrer Anstrengungen
     und ich wei&szlig;, dass viele von Ihnen anerkennen werden, was da
     geschaffen wurde, und was f&uuml;r ein Produkt da gebaut wird.
</LI>
</UL>
<P>
Ich kann Ihnen versichern, dass unsere Geduld wirklich belohnt wird und
dass nun viele andere lernen, was Sie bereits wissen. Dass n&auml;mlich Amiga
die stabilste, talentierteste und engagierteste Gemeinschaft hat, die
eine Computerplattform jetzt oder in der Zukunft haben kann.
</P>
<P>
Danke f&uuml;r Ihre immerw&auml;hrenden Gebete und Ihre Unterst&uuml;tzung. Sie werden
bald belohnt werden.
</P>
<P><B>Mit meinen besten W&uuml;nschen an alle,</B></P>
<P><B>Bill McEwen und das &uuml;brige AMIGA Team&laquo;</B></P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
