<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Neues zum AmigaNG
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>4. Zusammenfassung der &raquo;AMIGA &amp; Microsoft&laquo;-Ereignisse (von C. Schr&ouml;der)</H2>
<P>
Nachdem AMIGA-CEO Bill McEwen in seinem neuesten Executive Update - ihr
k&ouml;nnt es in dieser Ausgabe nachlesen - versehentlich oder mit Absicht (das
sei einmal dahingestellt) die Nummer des (vermeintlichen AMIGA-)
Messestandes auf der Mitte M&auml;rz in San Francisco stattfindenden &quot;Embedded
Systems Show&quot; ver&ouml;ffentlichte, dauerte es nur Stunden, bis die ersten User
feststellten, dass in der offiziellen Ausstellerliste [1] unter besagter
Nummer (1602) nicht etwa AMIGA, Inc., die Tao-Group oder auch Nokia
eingetragen ist - sondern niemand Geringeres als der weltgr&ouml;&szlig;te
Softwarekonzern Microsoft. Nat&uuml;rlich schossen sofort Ger&uuml;chte ins Kraut -
AMIGA bei Microsoft, konnte da etwas dran sein? Die zu dem Zeitpunkt noch
recht gelassene Stimmung unter den Anwendern deutete jedoch darauf hin,
dass dies kaum jemand f&uuml;r m&ouml;glich hielt.
</P>
<P>
Um all diesen Spekulationen ein Ende zu setzen, entschloss sich wenige Tage
sp&auml;ter Gary Peake, Mitarbeiter von AMIGA, Inc., in der offenen Amiga-
Mailingliste &quot;AMIGEN&quot; folgende Best&auml;tigung zu ver&ouml;ffentlichen:
</P>
<P>
&quot;Yes, Microsoft has asked us to demo DE and some of the developer
applications running on various devices in their booth.&quot;
</P>
<P>
(Auf deutsch: &quot;Ja, Microsoft hat uns gebeten, das AmigaDE und einige
Entwicklerprogramme auf verschiedenen Ger&auml;ten an ihrem Stand vorzuf&uuml;hren.&quot;)
</P>
<P>
Wie jeder wei&szlig; oder sich zumindest denken kann, erreichte er damit das
genaue Gegenteil - alle m&ouml;glichen Ger&uuml;chte machten fortan die Runde, und
die Reaktionen mancher User glichen einem Erdbeben. Das alles, obwohl noch
v&ouml;llig unklar war und auch heute noch ist, was AMIGA, Inc. und Microsoft
auf dieser Messe eigentlich bekanntgeben werden - wenn das &uuml;berhaupt der
Fall ist. Denn bislang hat AMIGA - wenn man die &Auml;u&szlig;erung von Gary Peake als
offiziell betrachtet - lediglich einen einzigen(!) Satz - siehe oben - von
sich gegeben - der zwar Raum f&uuml;r allerlei Spekulationen l&auml;sst, aber extrem
arm an konkreten Informationen ist und nur aussagt, dass die Firma AMIGA,
Inc. auf Einladung von Microsoft an dessen Stand auf verschiedenen Ger&auml;ten
das AmigaDE und einige Entwicklerprogramme pr&auml;sentieren wird - mehr nicht.
Von einer Kooperation ist (noch?) keine Rede. Dass aber das AmigaDE
zuk&uuml;nftig auf einer Vielzahl von Hardwareplattformen, darunter auch
Microsofts PDA-Betriebssystem, lauff&auml;hig sein soll, ist bereits seit einer
Ewigkeit bekannt, und aus diesem Grund, ist auch eine Pr&auml;sentation der
Amiga-Entwicklung an einem Microsoft-Messestand aus meiner Sicht zun&auml;chst
einmal nichts Sensationelles.
<BR>
Unter [2] sind &uuml;brigens Informationen zu Microsofts Messeauftritt inklusive
der Namen der beteiligten Unternehmen - AMIGA, Inc. ist bei weitem nicht
das einzige - zu finden.
</P>
<P>
Ergo: Bevor nicht klar ist, wie sich eine m&ouml;gliche Beziehung zwischen den
beiden Unternehmen konkret gestaltet, sehe ich keinen Grund, mich zu
irgendwelchen Spekulationen hinrei&szlig;en zu lassen. Ich m&ouml;chte an dieser
Stelle lediglich anmerken, dass sich bei einer Kooperation mit Microsoft
f&uuml;r die Firma AMIGA - neben ein paar Risiken (die existieren allerdings bei
jeder Partnerschaft) - eine Vielzahl von Chancen ergeben k&ouml;nnten - in
unterschiedlichsten Bereichen (finanziell, technologisch, die Bekanntheit
AMIGAs bzw. Verbreitung des AmigaDE betreffend, etc.). Lassen wir uns also
von dem &uuml;berraschen, was Mitte M&auml;rz - m&ouml;glicherweise - bekanntgegeben wird.
</P>
<P>
&Uuml;brigens: Viel spekuliert wurde in den letzten Tagen wie gesagt &uuml;ber die
Beziehung zwischen AMIGA und Microsoft - aber nicht &uuml;ber die des neuen
AMIGA-Chairmans Frank Wilde und des CEO Bill McEwen sowie deren
Machtpositionen im Unternehmen.
<BR>
Ich jedenfalls halte es f&uuml;r sehr gut m&ouml;glich, dass die j&uuml;ngsten
Entwicklungen ma&szlig;geblich vom Chairman initiiert worden sind - daf&uuml;r spricht
auch die Berufung von Liz Barnick und David Brott ins Management von AMIGA,
Inc. Denn beide waren zuvor bei der Firma Ravisent t&auml;tig - und bis vor gar
nicht so langer Zeit war deren CEO ein gewisser Frank Wilde...
</P>
[1] <A HREF="http://vbooth.tscentral.com/exhibitorsDynamic.asp?project=CMP_ESCONF_SF0_02&systemAttrs=DrawingInventory.number^Booth&sort=Booth&OpsMode=true&template=SPBoothNameSort" TARGET="_top">http://vbooth.tscentral.com/exhibitorsDynamic.asp?project=CM
P_ESCONF_SF0_02&amp;systemAttrs=DrawingInventory.number^Booth&amp;so
rt=Booth&amp;OpsMode=true&amp;template=SPBoothNameSort</A><BR>
[2] <A HREF="http://www.microsoft.com/windows/embedded/sak/techinfo/events/escwest.asp" TARGET="_top">http://www.microsoft.com/windows/embedded/sak/techinfo/events/escwest.asp</A><BR>
<P><B>Carsten Schr&ouml;der &lt;<A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
