<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Diverse Amiga-News
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>4. Neuigkeiten von der Amiga Arena</H2>
<P><B>Amiga Arena (<A HREF="http://online-club.de/~ARENA/" TARGET="_top">http://online-club.de/~ARENA/</A>) informiert:</B></P>
<P><B>&raquo;Amiga Arena - Interview</B></P>
<P>
Stefan Blixth,vielen von Euch besser unter &quot;OnyxSoft&quot; bekannt,hat bis heute
zahlreiche Tools f&uuml;r den Amiga entwickelt. OnyxBase, QuickNote, Graphica
sind nur einige wobei letzteres sich noch in der Alpha Phase befindet und
noch unver&ouml;ffentlicht ist.
</P>
<P>
Die Amiga Arena sprach mit Stefan Blixth &uuml;ber seine neuen Programme und ein
sehr ausf&uuml;hrlicher Kommentar von Stefan rundet das Interview ab.
</P>
<P><B>PuzzelBOBS News</B></P>
<P>
Auf der PuzzelBobs Support Seite der Amiga Arena liegt das Modul &quot;Rockers
Galore&quot; von  &quot;Up Rough System&quot; zum Download bereit!
Passend zum Puzzel Spiel bietet dieses Modul einen relaxten Dub Sound!
Einfach in das Verzeichniss &quot;Module&quot; von PuzzelBOBS kopieren!
</P>
<P><B>Aural Ilusion V. 3.0 Souce frei!</B></P>
<P>
Der bisher unver&ouml;ffentlichte Souce Code des leider nie erschienenden Sound
Sampler Aural Ilusion V 3.0 von &quot;Blachford Technology&quot; liegt nun zum
Download und zur freien weiterentwicklung bereit!
Nach Angaben von Nicolas Blachford darf dieser frei verwendet werden!
Der Source liegt unter <A HREF="http://blachford.info/blachtech/" TARGET="_top">http://blachford.info/blachtech/</A> zum Download!
Bei Intersse bitte mail an: <A HREF="mailto:nicholas@blachford.info">nicholas@blachford.info</A>&laquo;
</P>
<P><B>&raquo;Amiga Arena - Vollversion &quot;ArtPro 1.20b&quot;</B></P>
<P>
In Zusammenarbeit mit Frank Pagels erm&ouml;glicht die Amiga Arena die
Vollversion von &quot;ArtPRO&quot;!
&Uuml;ber den Grafik Konverter &quot;ArtPRO&quot;
ArtPRO bietet eine Anzahl von verschiedenen File formaten, wie
ILBM,GIF,TIFF, BMP,PCX.
</P>
<P>
Ausserdem k&ouml;nnen mittels Datatype weitere Formate geladen werden.
ArtPRO unterst&uuml;tzt weiterhin einige Raw Formate wie Chunky.
</P>
<P>
Bilder k&ouml;nnen als Bitplane, Chunky oder Truecolor als binary oder Source
gespeichert werden.
</P>
<P>
Dabei hat ArtPRO einen hoch flexible Sourcecodegenerator.
Ausserdem k&ouml;nnen Copperlisten und Sprites generiert werden.
</P>
<P>
ArtPRO bietet eine sehr schnelles runterrechnen von Bildern, und das in
ehr guter Qualit&auml;t. Ausserdem einen Paletteoptimizer und ein Realtime Color
Bias der auch mit Truecolor Bildern funktioniert.
</P>
<P><B>Weiter Entwicklung?</B></P>
<P>
ArtPRO wurde zu 100% in Assembler entwickelt und wer ernsthaft daran
interressiert ist ArtPRO weiter zu entwickeln m&ouml;chte sich bitte mit Frank
Pagels (<A HREF="mailto:copper@coplabs.org">copper@coplabs.org</A>) in Verbindung setzten!
Es w&auml;hre wirklich sch&ouml;n wenn sich jemand daf&uuml;r finden w&uuml;rde!
</P>
<P><B>Amiga Arena - Interview</B></P>
<P>
Die Amiga Arena sprach mit Frank Pagels dem Entwickler von &quot;ArtPro&quot; &uuml;ber
die Entwicklungsgeschichte und wie es dazu kam!&laquo;
</P>
<P><B>&raquo;Amiga Arena - Status Report</B></P>
<P><B>Liest hier (AmigaArenaStatus.txt) zur aktuellen Amiga Arena Situation!</B></P>
<P><B>Amiga Arena - Interview</B></P>
<P>
Die Amiga Arena hat schon vor kurzem auf die Sourcen der Sampler Software
&quot;Aural Illusion&quot; hingewiesen die zur freien weiter Entwicklung frei gegeben
wurden von Nicholas Blachford.
</P>
<P>
Das mit Abstand umfangreichste Interview in der Amiga Arena Geschichte mit
vielen Interressanten Aussagen eines Ex-Amiga Entwicklers ist Online!
(Das Interview ist z.Zeit nur in Englisch Online!)
</P>
<P><B>Amiga Arena - Interview II</B></P>
<P>
Neben Stefan Blixth geh&ouml;rt auch Daniel Westerberg zu &quot;OnyxSoft&quot;.
Programme wie MultiRen, Detris, oder DRemind erfreuen sich grosser
beliebtheit und auch Daniel Westerberg stellte sich den Fragen der Amiga
Arena!
</P>
<PRE>
               (·· Amiga Arena ··)

           .-----------------------.
           | S · T · A · T · U · S |
           `-----------------------'
                 [R·E·P·O·R·T]
</PRE>
<P>
Ende Januar gab Ich bekannt das die
&quot;Amiga Arena&quot; vorerst von mir eingestellt werden w&uuml;rde.
</P>
<P>
Bis zum jetzigen Zeitpunkt konnte ich aber noch einige Interviews
sowie eine weiter Shareware Vollversion erm&ouml;glichen!
Jetzt, wo ich keine weiteren Interviews,Sonderpreise
und Vollversion &quot;in arbeit&quot; habe m&ouml;chte ich Euch einige Gr&uuml;nde
erl&auml;utern wieso Ich mich zu diesem Schritt entschlossen habe!
Zuerst m&ouml;chte ich Euch mitteilen das bis Dato noch kein
Interresse seitens Entwickler bekundet wurde, um &quot;ArtPro&quot; sowie
&quot;Aural Illusion&quot; weiter zu entwickeln!
Mein Ziel war es mit der &quot;Amiga Arena&quot; zwischen Entwicklern und Anwendern
eine &quot;Br&uuml;cke&quot; zu bilden um Vorurteile seitens der Anwender gegen&uuml;ber
Registrationen (Weiterentwicklung etc.) abzubauen, Feedback zu erm&ouml;glichen,
auf Projekte aufmerksam zu machen sowie ein wenig mehr Einblick &uuml;ber die
Personen hinter den Programmen zu erm&ouml;glichen!
F&uuml;r mich galt - jeder User der &uuml;ber die Amiga Arena auf ein Programm
aufmerksam gemacht werden k&ouml;nnte war ein Gewinn f&uuml;r den aktiven Amiga
Markt!
Nun mittlerweile sieht es so aus,das abgesehen davon es kaum noch Shareware
Software gibt,die Angebote nicht mehr angenommen werden!
Die &quot;Sonderpreis Aktion&quot; erwies sich nie als wirklich Erfolgreich und wenn
eine &quot;Handvoll&quot; neu Registrationen erm&ouml;glicht werden konnte war dies schon
als Grosser Erfolg zu bezeichnen!
Gr&uuml;nde daf&uuml;r gibt es mitsicherheit viele,nur lassen sich die Zugriffszahlen
mit dem Endergebnis der Aktionen (Sonderpreise,Aufrufe,Feedback..)
auf kein f&uuml;r mich logiches Ergebniss bringen!
(Die Anwender scheint es ja zu geben!)
Somit macht es zur Zeit keinen Sinn diese Rubrik aufrecht zuerhalten!
(Angebot und Nachfrage!)
</P>
<P>
Die Vollversionen waren immer ein netter Nebeneffekt der sich auf der Suche
nach AKTIVEN Entwicklern ergab!
Es war nie mein Ziel Vollversionen zu erm&ouml;glichen denn jede Vollversion
bedeutete einen Entwickler weniger f&uuml;r den Amiga oder die Einstellung eines
Programmes!
Auch f&uuml;hrten Aufrufe,Appelle etc. nicht auf offenen Ohren sodas das
Feedback weiterhin unerh&ouml;rt seitens der Anwender blieb!
</P>
<P>
Dies bezieht sich Selbstverst&auml;ndlich nur &uuml;ber die Erfahrung und mir
bekannten Werte der Amiga Arena,wobei ich aber von mir behaupten m&ouml;chte das
sich ein grossteil der aktiven Free und Shareware Entwickler mit der Amiga
Arena immer wieder gut zusammengearbeitet hat!
Es gibt nur ganz wenige Ausnahmen die nicht bereit waren in welcher Form
auch immer mit mir eine Aktion durchzuf&uuml;hren!
</P>
<P>
Somit bin ich heute an einem Punkt angelangt wo es f&uuml;r mich immer schwerer
wird die Hoffnung auf weiter Entwicklung von Software oder die
fertigstellung eines Programmes zu unterst&uuml;zen!
(Ich habe daf&uuml;r in den letzten Jahren zu viele Kontakte zu Entwicklern
gehabt deren Entwicklungen aufgegeben wurde oder Sie ganz den Amiga
verlassen haben!)
Es ist auf die dauer nicht motivierend keine Teilerfolge erzielen zu
k&ouml;nnen!
Zu viele Entwicklungen stehen still aufgrund von Demotivation,mangelnder
mitarbeit,feedback ect.!
Ein Sog gegen den Ich auch nicht mehr ankomme!
</P>
<P>
Ich weiss,nicht jeder Amiga Anwender ist ein Grafiker,Sounder oder
Programmierer aber Fakt ist das mittlerweile der Amiga gr&ouml;sstenteils aus
&quot;Einzel K&auml;mpfer&quot; besteht und im laufe der Zeit angestrebte Ziele nicht mehr
erreicht werden!
</P>
<P>
Es gibt zu viele Gr&uuml;nde um Sie hier auch nur ann&auml;hernd zu Ende zu bringen!
Ich hoffe Ihr k&ouml;nnt dies einwenig nachvollziehen!
Ich war sehr ber&uuml;hrt &uuml;ber das viele Feedback was ich erhalten habe und
w&uuml;nsche uns allen die bis heute dabei geblieben sind,das wir Amiga Freunde
wieder eine Gesunde und AKTIVE Anwendergemeinschaft werden!
</P>
<P><B>Bis dahin Euer Olaf K&ouml;bnik - Amiga Arena</B></P>
<P>
Nachtrag:
Ich m&ouml;chte in Zukunft die Amiga Arena weiterf&uuml;hren
und werde nicht ganz die aktivit&auml;ten einstellen!
</P>
<P><B>Vielen dank f&uuml;r Euer Verst&auml;ndniss!</B></P>
<PRE>
 .... __ -- (c) Amiga Arena 16.02.2002 -- __ ....&laquo;
</PRE>
<P>
&raquo;Amiga Arena - Interview Update!
Das Interview mit Nicholas Blachford (&quot;Aural Illusion&quot;) ist nun auch in
Deutsch Online!
Besonderen Dank an Christain Busse f&uuml;r seine Arbeit!&laquo;
</P>
<P><B>&raquo;Amiga Arena - Interview mit &quot;Thilo K&ouml;hler&quot;</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">In k&uuml;rze erscheint das letzte Update zu &quot;Samplemanager&quot;,dem&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Audiobearbeitungsprogramm&nbsp;</TD><TD VALIGN="TOP">mit einmaligen Features wie dem &quot;Autotune&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Effekt&quot;.&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Doch mit &quot;HDRec&quot; ,einen MIDI/Audio Sequencer &auml;hnlich wie Cubase befindet
sich schon der Nachfolger von &quot;Samplemanager&quot; in Entwicklung und es d&uuml;rfte
bald mit der ersten Beta Version zu rechnen sein!
Thilo K&ouml;hler sprach mit der Amiga Arena ausf&uuml;hrlich &uuml;ber sein neues
Programm &quot;HDRec&quot; sowie dem &quot;Samplemanager&quot;!
</P>
<P>
Amiga Arena - Interview mit Nicholas Blachford Update II!
</P>
<P>
Wie mir  Nicholas Blachford mitteilte war er sehr dar&uuml;ber erstaunt das in
einer Woche &uuml;ber 200 Downloads  von &quot;Aural Illusion&quot; gedownloadet wurden -
mehr als er in 5 Jahren verkauft hat!
Die Downloads erfolgten aus 34 verschiedenen L&auml;ndern!
Nachwort
Diese Ausage brauche ich wohl nicht mehr zu Kommentieren!
Das Verh&auml;ltniss Downloadzahlen zu Verkaufszahlen (Registrationen) trifft
leider auch heute genau so zu!&laquo;
</P>
<P><B>&raquo;Amiga Arena - Sonderpreis Aktion News</B></P>
<P>
Bis zum 28.02.2002 k&ouml;nnen noch folgende Programme zum Sonderpreis
registriert werden!
</P>
<UL>
<LI> GeoWorld, das Erdkundeprogramm!
</LI>
<BR><LI> PhotoAlbum/CyberShow, die Bildverwaltung!
</LI>
<BR><LI> DocDatatypes (f&uuml;r MSWord,Wordperfect..)
</LI>
<BR><LI> Siteway, Site und Content managment
</LI>
<BR><LI> AMPlifier, Hardware basierender Dekoder
</LI>
</UL>
<P>
Zum 01.03.2002 stellt die Amiga Arena die Shareware &quot;Sonderpreis Aktion&quot;
ein.
</P>
<P><B>Amiga Arena - Interview mit &quot;Marcin Kielesinski&quot;</B></P>
<P>
Marcin Kielesinski hat mit &quot;Sherman Blanker&quot; einen weiteren ausgefallenen
PC Blanker f&uuml;r den Amiga portiert!
Ein kleines Interview  &uuml;ber die Zukunft seiner Programme und &uuml;ber &quot;Sherman
Blanker&quot; ist Online!&laquo;
</P>
<P><B>&raquo;Amiga Arena - Interview mit &quot;Gareth Griffiths&quot;</B></P>
<P>
Wer seine MP3 Sammlung schnell und Plattform &uuml;bergreifend aufgelistet haben
m&ouml;chte sollte sich einmal das Programm &quot;MP3-2-HTML&quot; von &quot;Gareth Griffiths&quot;
ansehen!
Die gesamten ID3 Informationen werden in einer HTML Liste dargestellt!
&quot;MP3-2-HTML&quot; bietet dazu noch weitere Features und ist wirklich ein sehr
n&uuml;tzliches Tool!
Die Amiga Arena sprach mit dem recht Jungen Entwickler &quot;Gareth Griffiths&quot;
der nebenbei noch an einem PD Spiel namens &quot;Shoot Out&quot; arbeitet!
Wie wichtig Feedback ist und das Ihr regelrecht &quot;Einfluss&quot; auf die weiter
Entwicklung von Software haben k&ouml;nnt,spiegelt auch dieses Interview einmal
mehr wieder!&laquo;
</P>
<P><B>&raquo;Amiga Arena - Interview mit &quot;Volker Grabbe&quot;</B></P>
<P>
Der Mangel an Kommerzieller Software und die dadurch entstandenen L&uuml;cken
sind in den letzten Jahren durch Free und Shareware Programme gerade im
Anwenderbereich gut geschlossen worden!
Allerdings vermissen die meisten Amiga User einen Browser der &quot;up to Date&quot;
ist und ein Office Paket    was auch den Daten austausch zu anderen
Plattformen wirklich erm&ouml;glicht.
</P>
<P>
Gerade im Bereich &quot;Textverarbeitung&quot; ist der Amiga nicht mehr Zeitgem&auml;ss!
Die Amiga Arena sprach mit Volker Grabbe der das Projekt &quot;OpenOffice&quot; ins
Leben gerufen hat und sich zum Ziel gesetzt hat,diesen missstand auf dem
Amiga mit der Open Source Variante von Suns &quot;StarOffice 6&quot; zu beenden!
Da Volker Grabbe solch ein Projekt nicht alleine umsetzten kann,hat er ein
kleines Team gebildet und ist auch weiterhin auf die mithilfe der Amiga
Gemeinde angewiesen die &quot;OpenOffice&quot; unterst&uuml;zen m&ouml;chten.
</P>
<P>
Jeder der an diesem Projekt teilnehmen m&ouml;chte,m&ouml;ge sich bitte mit Volker
Grabbe  (<A HREF="mailto:openoffice@vgrabbe.de">openoffice@vgrabbe.de</A>)  in Verbindung setzten f&uuml;r weitere
Informationen.
Liebe Amiga User,
es w&auml;hre sch&ouml;n wenn sich zahlreiche Entwickler finden
lassen die dieses Ziel umsetzten!
Es ist mir unbegreiflich wie User sich untereinander bek&auml;mpfen!
Wir alle haben einen nutzen von solchen Projekten und sollten uns Gl&uuml;cklich
sch&auml;tzen das es im Amiga Sektor noch Enthusiasten gibt die Ihre Freizeit
f&uuml;r uns und dem Amiga &quot;opfern&quot;!
Ich habe bewust hier keine vergleichbaren Produkte erw&auml;hnt,da es mir hier
in erster Linie um die Aufmerksamkeit f&uuml;r OpenOffice geht!&laquo;
</P>
<P><B>&raquo;Amiga Arena - Interview mit &quot;Costel Mincea&quot;</B></P>
<P>
Vor wenigen Tagen gab das Unternehmen &quot;Remedy Systems&quot; bekannt das neue
Software Produkte auch f&uuml;r den Amiga entwickelt werden.
</P>
<P>
Mit dem Programm &quot;AmiDynDNS&quot; befindet sich zur Zeit ein CLI Client f&uuml;r die
Services von DynDNS.org. in Entwicklung!
Die Amiga Arena sprach mit &quot;Costel Mincea&quot; &uuml;ber die Zukunft und &uuml;ber
weitere m&ouml;gliche Entwicklungen f&uuml;r den Amiga.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
