<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Diverse Amiga-News
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>3. Neuigkeiten von Haage &amp; Partner</H2>
<P><B>Haage &amp; Partner (<A HREF="http://www.haage-partner.com" TARGET="_top">http://www.haage-partner.com</A>) informiert:</B></P>
<P><B>&raquo;OS XL: Offizielles Update f&uuml;r Amithlon und AmigaXL</B></P>
<P>
05. Feb. 2002: Dies ist das erste offizielle AmigaOS XL-Update, welches die
uns bisher bekannten bzw. gemeldeten Probleme behebt. Unter Amithlon wurde
die Sound-Ausgabe ebenso verbessert wie Maus- und Tastaturtreiber sowie
die CPU/FPU-Emulation. Unter Amithlon und AmigaXL l&auml;uft nun die HDToolBox
wieder stabil.
</P>
<P>
OS XL: Running AmigaOS on a PC - Ein Bericht &uuml;ber AmigaOS XL
</P>
<P>
06. Feb. 2002: Mike Bourma hat einen interessanten Bericht &uuml;ber AmigaOS XL
auf OSNews ver&ouml;ffentlicht. Er hat bereits sehr viele Pageviews daf&uuml;r
erhalten und ist schon jetzt der am zweith&auml;ufigsten gelesene Artikel auf
OSNews.
</P>
<P><B>DOpus: GP ernennt H&amp;P zum deutschen Distributor</B></P>
<P>
07. Feb. 2002: Das australische Softwarehaus GP Software ernennt
HAAGE&amp;PARTNER Computer zum Exklusiv-Vertrieb f&uuml;r den deutschen Sprachraum
f&uuml;r das Produkt Directory Opus 6 f&uuml;r Windows.
</P>
<P>
H&amp;P wird zun&auml;chst die englische Version vertreiben und dazu einen
deutschsprachigen Support per E-Mail und Telefon anbieten. Die &Uuml;bersetzung
des Programms folgt in K&uuml;rze. Diese wird den Kunden von H&amp;P dann kostenlos
per Download zur Verf&uuml;gung stehen. Ebenso wird an der &Uuml;bersetzung der
umfangreichen Anleitung gearbeitet.
</P>
<P>
Der Preis der neuen Version 6.1 wurde zudem von vorher 89 Euro auf nur noch
69,95 Euro gesenkt. F&uuml;r registrierte Besitzer der Amiga-Version gibt es
jetzt auch die M&ouml;glichkeit eines Sidegrades.
</P>
<P><B>OS XL: AmigaOS XL-Komplettsystem f&uuml;r 999 Euro</B></P>
<P>
08. Feb. 2002: Jetzt gibt es noch mehr Leistung f&uuml;r weniger Geld. Der
Midi-Tower mit der schnellen Athlon XP 1600+ CPU, GeForce 2-Grafikkarte
und einem schnelleren CD-RW-Brenner kostet jetzt nur noch 999 Euro.
Amithlon und AmigaXL/QNX sind dabei vorinstalliert und k&ouml;nnen &uuml;ber einen
Bootmanager ausgew&auml;hlt werden. Auf Wunsch k&ouml;nnen wir Ihnen auch noch ein
Windows-Betriebssystem vorinstallieren.
</P>
<P><B>Xara: H&amp;P &uuml;bernimmt dt. Vertrieb</B></P>
<P>
Der englische Spezialist f&uuml;r Webgrafik-Software XARA Ltd. ernennt
HAAGE&amp;PARTNER Computer zum Exklusivvertrieb f&uuml;r den deutschen Sprachraum.
</P>
<P>
Die Palette umfasst dabei das Illustrationsprogramm XaraX und die
Webgrafik-Programme Xara Webstyle und Xara3D. Die Produkte von Xara sind
schon seit Jahren f&uuml;r ihre hohe Geschwindigkeit und sehr einfache
Handhabung bekannt.
</P>
<P>
Angebot: Bei uns registrierten Besitzern der Vollversion von DrawStudio 2
oder ArtEffect 4 bieten wir XaraX f&uuml;r 178 Euro (statt 198 Euro) und Xara
Webstyle f&uuml;r 88 Euro (statt 98 Euro) an. Bitte bei der Bestellung die
Seriennummer und den Sonderpreis angeben (im Online-Shop im Feld
&quot;Bemerkungen&quot;).
</P>
<P>
Weitere Informationen und 15-Tage-Demoversionen aller Produkte findet man
unter: xara.haage-partner.de
</P>
<P><B>PageStream 4.13</B></P>
<P>
22. Feb. 2002: Seite einiger Zeit ist nun die Versionen 4.1 f&uuml;r Amiga und
Windows verf&uuml;gbar - genauer gesagt sind dies die Version 4.12 f&uuml;r Windows
und 4.13 f&uuml;r Amiga. Wir haben jedoch von Grasshopper erfahren, dass die
Version 4.13a f&uuml;r Amiga bald erscheinen soll. Daher haben wir die Version
4.13 nicht zum Download angeboten. Wir arbeiten derzeit an den dt. Locales
f&uuml;r die Amiga und die Windows-Version. Auch diese solten bald verf&uuml;gbar
sein. www.pagestream.de
</P>
<P><B>Freespace: Update</B></P>
<P>
22. Feb. 2002: Auf der Homepage von Hyperion-Entertainment gibt es ein
Update f&uuml;r Freespace.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
