<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>3. News</H2>
<P><B>&quot;Tales of Tamar&quot;</B></P>
<P>
Ich selbst kann es kaum noch abwarten, bis das Strategiespiel Tales of
Tamar endlich zu haben ist. F&uuml;r Betatester gibt es mittlerweile wieder eine
neue Betaversion, die die Versionsnummer 0.41R2 tr&auml;gt. Zum Gl&uuml;ck l&auml;sst sich
daraus nicht auf den Grad der Fertigstellung schlie&szlig;en, sonst w&uuml;rde das ja
noch ein paar Jahre dauern.
</P>
<P>
In der Tat ist es laut Aussagen des Programmierers so, dass nur noch einige
St&auml;dte, Armeen und Siedler implementiert werden m&uuml;ssen, und dann w&auml;re das
Basisset auch schon komplett. Ein Erscheinen innerhalb der n&auml;chsten sechs
Monate ist nicht auszuschlie&szlig;en. Hoffen wir das beste!
</P>
<P>[1] <A HREF="http://www.tamar.net" TARGET="_top">http://www.tamar.net</A></P>
<P><B>&quot;ScummVM&quot;</B></P>
<P>
ScummVM ist zwar selbst kein Spiel, daf&uuml;r aber ein Interpreter f&uuml;r die von
Lucasfilm Games (heute LucasArts) geschaffene Skriptsprache, auf der die
legend&auml;ren Adventure-Klassier &quot;Maniac Mansion&quot;, &quot;Zak McKracken&quot;, usw.
beruhen. Ihr kennt sie ja alle.
</P>
<P>
Mittels ScummVM ist es nun m&ouml;glich, auch die Titel zu spielen, die gar
nicht mehr auf dem Amiga ver&ouml;ffentlicht wurden - das PC-Original
vorausgesetzt nat&uuml;rlich. Das funktioniert mit den aktuellsten Versionen des
Programms bereits ziemlich gut, zwar noch nicht f&uuml;r alle Spiele, aber &quot;Day
Of The Tentacle&quot; z.B. l&auml;uft bis auf kleine Grafikfehler einwandfrei.
</P>
<P>
In diesem Monat sind aktualisierte Versionen f&uuml;r MorphOS und WarpUP
erschienen, eine AGA-Version gibt es jedoch auch. Alles zu finden auf der
zugeh&ouml;rigen Website [1].
</P>
<P>[1] <A HREF="http://www.sebelinteractive.de/scummvm/" TARGET="_top">http://www.sebelinteractive.de/scummvm/</A></P>
<P><B>&quot;BrainTeaser&quot;</B></P>
<P>
Kaliko (LastInLine) k&uuml;ndigt drei neue Spiele f&uuml;r das AmigaDE an, die im
Zeitraum zwischen M&auml;rz und Juni erscheinen sollen.
</P>
<P>
Da w&auml;re &quot;BrainTeaser&quot;, das zusammen mit den Machern des Amiga-Adventures
&quot;Sixth Sense Investigations&quot; entsteht. Es handelt sich dabei um ein
Puzzlespiel, bei dem es darum geht, mehrere Bl&ouml;cke mit gleichem Aussehen
zusammenzubringen, damit diese verschwinden. H&ouml;rt sich so &auml;hnlich an wie
Tetris, soll aber ganz anders sein. Bilder gibt es leider noch nicht dazu.
</P>
<P>
Von den anderen beiden Spielen sind nur die Titel bekannt: &quot;Kaliko
Minigolf&quot; und &quot;Pirate's Puzzle&quot;. Was k&ouml;nnte das blo&szlig; sein...
</P>
<P>[1] <A HREF="http://www.kaliko.com" TARGET="_top">http://www.kaliko.com</A></P>
<P><B>&quot;Frontier: Elite II&quot;</B></P>
<P>
Passend zum Elite-TNK-Artikel in dieser Ausgabe wurde auch f&uuml;r den Amiga
die Shareware-Version des Weltraumhandelsspiels ver&ouml;ffentlicht [1]. Sie
kostet gerade einmal f&uuml;nf britische Pfund.
</P>
<P>[1] <A HREF="http://www.eliteclub.co.uk" TARGET="_top">http://www.eliteclub.co.uk</A></P>
<P><B>&quot;Valentinsgr&uuml;&szlig;e von clickBOOM&quot;</B></P>
<P>
Im sogenannten S-File [1] hat die gute Sofia von clickBOOM nach langer
Sendepause ein neues Amiga Spiel angek&uuml;ndigt, an dem gearbeitet werde. Was
genau das sein soll, dar&uuml;ber schweigt sie sich allerdings aus.
</P>
<P>[1] <A HREF="http://clickboom.com/s-files/16.shtml" TARGET="_top">http://clickboom.com/s-files/16.shtml</A></P>
<P><B>&quot;The Feeble Files ist da&quot;</B></P>
<P>
Das Adventure &quot;The Feeble Files&quot; rund um den schrulligen gr&uuml;nen
Au&szlig;erirdischen ist fertiggestellt worden, und die Vorbesteller sollten ihr
P&auml;ckchen bereits erhalten haben.
</P>
<P>[1] <A HREF="http://www.epic-interactive.com" TARGET="_top">http://www.epic-interactive.com</A></P>
<P><B>&quot;Payback&quot;</B></P>
<P>
Das Gangsterspiel, das als Eigenentwicklung f&uuml;r den Amiga eine nette
Abwechslung zu den PC-Konvertierungen bietet, ist bei den AGC Awards 2001
die Nummer 1 vor Earth 2140 und Shogo geworden [1] und liegt auch bei Amiga
Flame's &quot;Best Game of 2001&quot; [2] ganz vorne.
</P>
<P>
Au&szlig;erdem hat Programmierer James Daniels einen Statusbericht zur Portierung
auf das AmigaDE abgegeben und auch erste, beeindruckende Screenshots
ver&ouml;ffentlicht [3]. Er hofft, das Spiel in zwei Monaten fertig zu haben.
</P>
<P>
F&uuml;r das klassische AmigaOS gibt es auch noch etwas, n&auml;mlich zwei brandneue
und drei verbesserte Maps [4].
</P>
<P>
[1] <A HREF="http://agcweb.online.fr/" TARGET="_top">http://agcweb.online.fr/</A><BR>
[2] <A HREF="http://www.amigaflame.demon.co.uk/amitop01.htm" TARGET="_top">http://www.amigaflame.demon.co.uk/amitop01.htm</A><BR>
[3] <A HREF="http://www.apex-designs.net/payback_intent_report.html" TARGET="_top">http://www.apex-designs.net/payback_intent_report.html</A><BR>
[4] <A HREF="http://www.apex-designs.net/payback_maps.html" TARGET="_top">http://www.apex-designs.net/payback_maps.html</A>
</P>
<P><B>&quot;Update f&uuml;r Freespace: The Great War&quot;</B></P>
<P>
F&uuml;r alle Weltraumpiloten, die Hyperions &quot;Freespace&quot; spielen, gibt es ein
Update [1], das diverse neue Explosions-Soundeffekte enth&auml;lt, die
Steuerung verbessert und Voodoo3-Besitzern ein wenig Arbeit beim
Konfigurieren abnimmt.
</P>
<P>[1] <A HREF="http://www.hyperion-entertainment.com" TARGET="_top">http://www.hyperion-entertainment.com</A></P>
<P><B>&quot;Website zu AlienNations online&quot;</B></P>
<P>
Freunde von Aufbaustrategiespielen d&uuml;rfen sich freuen: Zu AlienNations, das
f&uuml;r MorphOS und PPC-angetriebene Amigas programmiert wird, ist die
offizielle Website [1] online gegangen. Viel ist dort allerdings noch nicht
zu finden.
</P>
<P>[1] <A HREF="http://www.titan-computer.com/ami/aliennations/" TARGET="_top">http://www.titan-computer.com/ami/aliennations/</A></P>
<P><B>Oliver Tacke &lt;<A HREF="mailto:oliver@aakt.de">oliver@aakt.de</A>&gt; - schickt mir eure News!</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
