<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele8.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>7. Oldies but Goldies</H2>
<B>---------------------------------------------------------------------------<BR>
Elite<BR>
---------------------------------------------------------------------------</B><BR>
<P>
Wer von den Lesern hatte einen C64 oder Acorn BBC Micro oder TI99
oder...und erinnert sich noch: 1984 (respektive 1985) kam ein Spiel auf den
Markt, das eine Revolution im Bereich der Vektorgrafik darstellte: Elite.
</P>
<P>
Geschrieben von David Braben und Ian Bell, stellte dieses Programm nicht
nur eine Sensation im Homecomputer-Grafikbereich dar, es war auch eine
programmiertechnische Meisterleistung. In einem unglaublich kleinen
Hauptprogramm war ein Spiel versteckt, dessen Spielspa&szlig; und -Tiefe
Millionen Homecomputer-User n&auml;chtelang an den Bildschirm fesselte.
</P>
<P>
Dabei ist die Geschichte des Spiels recht schnell erz&auml;hlt:
</P>
<P>
Der Spieler &uuml;bernimmt die Rolle eines kleinen Handelskapit&auml;ns, der,
ausgestattet mit einem ziemlich kleinen Frachtschiff, sein Gl&uuml;ck in einem
wirklich entlegenen Winkel der Galaxis sucht. Die umliegenden Sonnensysteme
sind allesamt nicht besonders aufregend, wenn man von einer Tatsache
absieht: Jeder der Sterne in diesem Teil der Galaxis hat aus ungekl&auml;rtem
Grund jeweils nur einen Planeten!
</P>
<P>
Das ficht unseren tapferen Handelskapit&auml;n aber nicht an, diese
Merkw&uuml;rdigkeit macht ihm das Leben sogar ein wenig einfacher, da er sich
nur von einem Planeten je Sonnensystem die Besonderheiten merken muss.
</P>
<P>
Sinn des Ganzen ist n&auml;mlich, wie k&ouml;nnte es anders sein, eine m&ouml;glichst
steile Karriere als Raumschiffkapit&auml;n zu machen. Die intergalaktische
Raumfahrtorganisation f&uuml;hrt &uuml;ber jeden Raumfahrer Buch und stuft ihn, je
nach vollbrachten Leistungen und Missetaten, in verschiedene R&auml;nge ein,
deren h&ouml;chster &quot;Elite&quot; ist. Doch bis dahin ist es ein weiter und
gef&auml;hrlicher Weg, denn man ist nicht allein unterwegs im Universum. Da sind
die harten, aber fairen Konkurrenten, es gibt Piraten (und nat&uuml;rlich auch
Polizei!) und man hat in Ger&uuml;chten geh&ouml;rt, dass die gef&uuml;rchteten Thargoiden
nach langer Zeit wieder ihr Unwesen in dieser Galaxis treiben sollen.
</P>
<P>
Tja, da steht man nun, mit seinem kleinen, aber feinen Raumschiff, und
d&uuml;rstet nach Taten. Schnell erkennt man, dass das eigene Schiff eher
sp&auml;rlich ausgestattet ist und das es noch viel Zubeh&ouml;r daf&uuml;r zu kaufen
gibt. Dumm nur, dass man so wenig Geld hat. Es muss noch einiges an Credits
dazukommen, damit man sich allen Komfort f&uuml;r das Schiff leisten kann.
</P>
<P>
Diese zus&auml;tzlichen Credits lassen sich aber auf verh&auml;ltnism&auml;&szlig;ig einfachem
Weg beschaffen: Man wird zum fliegenden H&auml;ndler (im wahrsten Sinne des
Wortes!). Auf jedem St&uuml;tzpunkt, der um einen Planeten kreist, kann man die
verschiedensten Dinge kaufen und auch verkaufen. Was liegt also n&auml;her, als
irgendwo in der Umgebung billig einzukaufen und woanders teuer zu
verkaufen? Mit ein wenig Gl&uuml;ck findet man eine &auml;u&szlig;erst lukrative
Handelsroute, und schon bald hat man genug Credits, um sich gleich ein ganz
neues Schiff zu kaufen!
</P>
<P>
Doch damit nicht genug: Hin und wieder trifft man einen Reisenden, der
einem einen &quot;dringenden&quot; Auftrag zur Erf&uuml;llung antr&auml;gt, nat&uuml;rlich nur gegen
ein entsprechendes Sal&auml;r, versteht sich ;). So ein Auftrag eignet sich
vorz&uuml;glich daf&uuml;r, neben Geld auch noch Rangpunkte zu scheffeln, denn meist
sind diese Auftr&auml;ge alles andere als ungef&auml;hrlich.
</P>
<P>
Doch wer wei&szlig;? Vielleicht liegt einem ein Leben als Pirat doch besser. Kein
Problem, ist halt nur ein wenig gef&auml;hrlicher, schlie&szlig;lich ist die hiesige
Polizei nicht auf Fahrr&auml;dern unterwegs und die Piloten sind keine blutigen
Anf&auml;nger...
</P>
<P>
Soweit ein kleiner Ausschnitt aus der Hintergrundgeschichte zu Elite.
Dieser Ausschnitt zeigt bereits, welche unglaubliche Spieltiefe sich
dahinter verbirgt. An erster Stelle steht hier wohl das Handelssystem von
Elite. Man handelt hier mit den &uuml;blichen und bekannten Waren, wie
Nahrungsmittel, Computer, Waffen aller Art, Edelsteinen etc. etc. Diese
kauft man in einem System ein (billig, versteht sich!) und verkauft sie
woanders wieder (muss ich noch was sagen? ;).
</P>
<P>
 <A HREF="img/elite.png"><IMG SRC="thumb/elite.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Die alten K&auml;mpen werden jetzt schon wieder in Erinnerung schwelgen: Die
geradezu gigantische Lose-Blatt-Sammlung mit Preislisten f&uuml;r Elite... es
macht n&auml;mlich durchaus Sinn, sich die Preise der einzelnen Waren in den
einzelnen Systemen zu merken. Die Preise schwanken zwar leicht, aber es
gibt auch Schwankungen anderer, gr&ouml;&szlig;erer Art: Jedes Sonnensystem hat
n&auml;mlich seine Eigenheiten, die bei der Fauna anfangen und bei der
Regierungsform noch nicht aufh&ouml;ren. Jeder dieser Faktoren hat einen
Einfluss auf die Preise bestimmter G&uuml;ter. So sind zum Beispiel Waffen in
Systemen sehr gefragt, deren Regierungsform die Anarchie ist (ja, klingt
merkw&uuml;rdig, ist aber so im Spiel beschrieben ;). Systeme, die
hochindustrialisiert sind, haben nat&uuml;rlicherweise erh&ouml;hten Bedarf an
nat&uuml;rlichen Ressourcen wie Fr&uuml;chte, Felle und so weiter. Hier ergeben sich
viele M&ouml;glichkeiten, das dicke Geld zu verdienen.
</P>
<P>
Hier kommt &uuml;brigens eine weitere programmtechnische Besonderheit von Elite
ins Spiel: Es bietet eine unglaubliche Anzahl von Planeten, verteilt &uuml;ber
mehrere Galaxien, die alle unterschiedliche Merkmale haben. Es gibt also
reichlich zu handeln!
</P>
<P>
Die n&auml;chste M&ouml;glichkeit, Geld zu verdienen, ist eher sp&auml;rlich ges&auml;t: Ab und
an wird man nach der Landung in einer Station von einem Reisenden oder
einem Regierungsbeauftragten angesprochen, der einem einen Auftrag
anbietet. Es handelt sich dabei um die verschiedensten Missionen.
Angefangen von einem einfachen Terming&uuml;tertransport &uuml;ber die Suche nach
einem bestimmten Gegenstand bis zum gef&auml;hrlichen Geheimauftrag ist alles
dabei. Nach Erf&uuml;llung des Auftrages bekommt man den vereinbarten Lohn und,
je nach dem ob der Auftrag mit Raumk&auml;mpfen verbunden war oder nicht, kann
auch noch eine h&ouml;here Rangeinstufung dazu kommen.
</P>
<P>
Zu guter Letzt gibt es noch die M&ouml;glichkeit, sich als Pirat zu versuchen.
Auch hier kann man gut Geld verdienen, indem man unvorsichtige H&auml;ndler im
Raumkampf besiegt und die verwertbaren &Uuml;berreste des Raumschiffs
einsammelt. Mit ein bisschen Gl&uuml;ck ist eine Rettungskapsel mit dem
ungl&uuml;cklichen Raumfahrer darin unter den Tr&uuml;mmern. Sklaven sind auf vielen
Welten sehr gefragt...
</P>
<P>
Damit sind wir dann auch beim Rangsystem von Elite. Neben der Notwendigkeit
des Geldverdienens gibt es ja noch das Streben nach Ruhm und Ehre (oder
nach Furcht und Unehre, wenn man sein Leben als Pirat leben will ;). Wie
bereits erw&auml;hnt, wird der Spieler im Verlauf des Spiels bewertet, n&auml;mlich
nach fliegerischem K&ouml;nnen und Gesetzestreue. Je mehr Piraten oder andere
Angreifer man besiegt, desto h&ouml;her wird man eingestuft. Diese Rangstufen
laufen von &quot;Harmlos&quot; &uuml;ber &quot;Gef&auml;hrlich&quot; bis &quot;Elite&quot; (mit ein paar Stufen
dazwischen). Zus&auml;tzlich wird in die Bewertung die Zeit eingerechnet, die
man bis zum Sieg &uuml;ber den Gegner ben&ouml;tigt. Der Spieler wird im Laufe des
Spiels n&auml;mlich feststellen, dass unter den Piraten und vor allem den
Thargoiden ziemlich harte Brocken sind, die man nur schwer knacken kann.
Je schneller man diese besiegt (und damit vom fliegerischen K&ouml;nnen her
besser als diese ist), desto mehr Rangpunkte erh&auml;lt man. Allerdings ist das
Programm so gemein (oder so klug), die Rangpunkte im Laufe des Spiels immer
st&auml;rker nach der Zeit bis zum Sieg und der Klassifizierung des Gegners zu
vergeben, so dass ab einem bestimmten Level es nicht mehr ausreicht,
m&ouml;glichst viele (einfache ;)) Gegner zu besiegen.
</P>
<P>
Das Rechtssystem von Elite ist dagegen relativ einfach gestrickt: Greift
man ein Raumschiff an, dass nicht erkennbar ein Pirat ist oder einen selbst
nicht angegriffen hat, verst&ouml;&szlig;t man gegen geltendes Recht, was auch im
Strafregister festgehalten wird. Genauso wird es gehalten, wenn man Waren
in ein Sonnensystem einf&uuml;hrt, die laut Preisliste illegal sind. Je nach
Anzahl und H&ouml;he der Verst&ouml;&szlig;e kann es einem dann recht schnell passieren,
dass man in einem Sonnensystem gleich von der Polizei angegriffen wird,
statt von Piraten ;)
</P>
<P>
Ein Wort zu den Thargoiden: Nach einhelliger Meinung vieler altgedienter
Elite-K&auml;mpfer sind diese au&szlig;ergalaktischen Wesen die h&auml;rtesten Gegner, die
man in Elite zu Gesicht bekommt (mit einer Ausnahme, die hier aber nicht
verraten wird ;).
</P>
<P>
Sie treten eher selten auf, dann aber in Gruppen und immer mit einem gro&szlig;en
Mutterschiff, dass man nur mit den gr&ouml;&szlig;eren Gesch&uuml;tzen kleinkriegt. Eine
kleine Gemeinheit diesbez&uuml;glich ist im Programm eingebaut: Ab und an
versagt das Hypersprung-System des eigenen Raumschiffs und bringt einen in
eine Art Raumblase, wo sich h&auml;ufig Thargoiden versteckt halten. Man kann
sich vorstellen, dass gerade Anf&auml;nger hier oft scheitern, die Profis es
dagegen darauf anlegen, einen missgl&uuml;ckten Hypersprung zu machen...
</P>
<P>
An der L&auml;nge des Artikels merkt man es vielleicht schon: ein wahrer
Klassiker. Und jeder darf ihn selbst testen oder wiederentdecken, denn er
ist frei erh&auml;ltlich auf der Website des Programmierers Ian Bell [1].
</P>
<P>[1] <A HREF="http://www.iancgbell.clara.net/elite/" TARGET="_top">http://www.iancgbell.clara.net/elite/</A></P>
<P><B>Oliver Tacke &lt;<A HREF="mailto:oliver@aakt.de">oliver@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele8.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
