<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Spieleteil (von Oliver Tacke und J&uuml;rgen Theiner)</H1>
<H2>1. Vorwort</H2>
<B>---------------------------------------------------------------------------<BR>
Tanz mit dem Teufel<BR>
---------------------------------------------------------------------------</B><BR>
<P>
Was f&uuml;r ein Monat: lauter Ank&uuml;ndigungen rund um den Amiga! Die
erstaunlichste m&ouml;chte ich hier auch kurz aufgreifen. Aber wirklich nur
kurz, denn dar&uuml;ber zerbrechen sich schon genug Leute den Kopf. Die Rede ist
nat&uuml;rlich von AMIGAs Teilnahme an der Embedded Systems Show am Stand von
Microsoft.
</P>
<P>
Pfui, was machen die denn da? Die Verr&auml;ter! Microsoft wird die ausnehmen,
...moment... Schalten wir mal einen Gang zur&uuml;ck. Erstens wissen wir
(bisher) gar nicht, OB es da &uuml;berhaupt mehr Verbindungen gibt als das blo&szlig;e
Unterausstellerdasein, obwohl das zu vermuten ist. Zweitens gestehe ich den
Jungs von AMIGA, Inc. so viel Grips zu, dass sie wohl wissen, mit wem sie
es zu tun haben.
</P>
<P>
Ich mag Microsoft und besonders deren Gesch&auml;ftsmethoden auch nicht und
geh&ouml;re wohl zu den wenigen merkw&uuml;rdigen Leuten, die keinen PC (&uuml;brigens
auch keinen Mac, und der C64 z&auml;hlt wohl nicht wirklich) neben dem Amiga
stehen haben, aber wenn AMIGA, Inc. durch die Gates-Company Publicity
bekommt und dadurch auch noch Geld in die vermutlich nicht allzu prall
gef&uuml;llten Kassen sp&uuml;len kann, habe ich kein Problem damit. Nur ausnutzen
lassen d&uuml;rfen sie sich halt nicht, und eine best&auml;tigte(!)
Kooperation...hmpf, wirtschaftlich sicherlich vorteilhaft, wenn man sich
nicht &uuml;ber den Tisch ziehen l&auml;sst, aber ideell nat&uuml;rlich unterhalb der
G&uuml;rtellinie.
</P>
<P>
Was das im Spieleteil zu suchen hat? Ist doch ganz klar: AMIGA, Inc. kann
auf der Messe, besonders als Unteraussteller von Microsoft, sicherlich
Firmen f&uuml;r das AmigaDE interessieren, die vorher noch nie davon geh&ouml;rt
haben. Das erh&ouml;ht die Wahrscheinlichkeit, dass mehr Software daf&uuml;r
produziert wird. Na, und Spiele sind auch Software!
</P>
<P>
Jaaa, da gibt's nat&uuml;rlich noch zig Sachen zu er&ouml;rtern: AmigaDE sei nur f&uuml;r
PDAs, PDA-Firmen machen keine Desktop-Sachen, AmigaDE gibt's (noch) nicht
f&uuml;rs AmigaOS, und was wei&szlig; ich noch alles, aber ich habe oben gesagt:
kurz... Und au&szlig;erdem schreibe ich sonst in drei Wochen noch! Das &uuml;berlasse
ich lieber den flei&szlig;igen Kommentareschreibern in den Foren.
</P>
<P>
Aber bevor jetzt alle ihre Tastatur &ouml;len: Schaut doch mal in den aktuellen
Spieleteil, denn dort gibt's auch ein paar interessante Sachen zu
entdecken.
</P>
<P><B>Oliver Tacke &lt;<A HREF="mailto:oliver@aakt.de">oliver@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
