<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>5. Vorabbericht: 3D-Shooter &raquo;Quake 2&laquo;</H2>
<P>
Seit kurzem ist der Quellcode des beliebten First-Person-Shooters Quake 2
(hey, Jugendschutz und Kanzlei Gravenreuth: Ich hab's ausgeschrieben!)
erh&auml;ltlich und die Amiga-Zocker lechzen danach, seitdem ein paar der Jungs
von Hyperion in ihrer Freizeit daran arbeiten. Grund genug also, ein paar
Zeilen dar&uuml;ber zu verlieren. Steffen H&auml;user war so freundlich, mir
Informationen und auch neue Screenshots zu liefern, die kaum ein Mensch je
zuvor gesehen hat.
</P>
<P>
&quot;Obwohl Quake 2 'nur' ein OpenSource-Port ist, legen wir dieselben
Ma&szlig;st&auml;be an wie an unsere anderen Spiele. Insbesondere bedeutet dies, dass
wir ein 'richtiges' Betatesting durchf&uuml;hren. Es bedeutet au&szlig;erdem, dass
Dinge wie eine grafische Oberfl&auml;che zum Starten und ein Installations-
Skript selbstverst&auml;ndlich sind.
</P>
<P>
Die Idee hinter dem Installationsskript ist dabei, dass der User
aufgefordert wird, eine Quake 2 CD f&uuml;r Windows oder Macintosh einzulegen,
und das Skript &uuml;bernimmt dann die komplette Installation, so dass der User
nichts 'von Hand' machen muss (wie bei anderen OpenSource-Ports in der
Vergangenheit, wo man die Datenfiles von der PC CD von Hand umkopieren
musste). Insbesondere werden hierbei auch die PAK-Files ausgepackt, damit
das Spielen auch auf FFS schnell geht.&quot;
</P>
<P>
 <A HREF="img/quake2-1.jpg"><IMG SRC="thumb/quake2-1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Um es noch einmal klarzustellen: es wird zwingend eine Original-PC-Version
des Spiels ben&ouml;tigt. Da sie aber im Handel kaum noch zu finden sein d&uuml;rfte,
wird an einer L&ouml;sung gearbeitet, so dass alle interessierten Gamer das
Prachtst&uuml;ck noch erwerben k&ouml;nnen. Genauere Aussagen waren leider noch nicht
aus Steffen herauszuholen, daf&uuml;r aber noch ein bisschen was zur Technik:
</P>
<P>
&quot;Quake 2 besitzt einen Software-Renderer (in 8 Bit, weshalb er wesentlich
schneller als etwa der Software-Renderer von Heretic II, welcher in 16 Bit
war, ist) und einen Warp3D/MiniGL-Renderer (in 16 Bit). Sound-Support
erfolgt wahlweise &uuml;ber AHI oder &uuml;ber Paula. An Inputger&auml;ten werden
unterst&uuml;tzt: Tastatur, Maus (inkl. Mausrad), CD32-Pad, PSX-Port, PC-Analog-
Joystick (per Spezialadapter, wie bei Freespace).&quot;
</P>
<P>
Zocker mit PPC unter der Haube sollten diesen wenigstens mit 150 MHz
getaktet haben und den Rechner mindestens mit 64 MB RAM ausr&uuml;sten. Einige
MODs (andere Spielversionen, die nur auf dem Spiel basieren, teilweise aber
extrem anders sind - so etwas wie Counterstrike f&uuml;r Halflife) ben&ouml;tigen
allerdings noch ein wenig extra Speicher. F&uuml;r die 603e-PPCs ist au&szlig;erdem
eine 3D-Grafikkarte w&auml;rmstens zu empfehlen, die 604er kommen, je nach
Anspruch, auch ohne aus.
</P>
<P>
Gro&szlig;vater 68k-Amiga guckt leider in die R&ouml;hre, denn das Spiel ist selbst
auf einem 50 MHz 060 zu langsam, um spielbar zu sein. Anders hingegen sieht
es f&uuml;r AmigaXL-Benutzer aus, wenn ihr PC mit etwa 1 GHz getaktet ist. Dort
l&auml;uft die 68k-Version dann flott. Ein Bug im Emulator verhindert allerdings
bisher das Spielen der MODs, aber der k&ouml;nnte bald beseitigt sein. Auf
Amithlon hingegen ist selbiges Problem daf&uuml;r verantwortlich, dass das Spiel
bisher gar nicht l&auml;uft. Der Autor von Amithlon hat aber die n&ouml;tigen
Informationen erhalten, um den Fehler auszumerzen.
</P>
<P>
F&uuml;r echte Amigas gilt, dass Quake 2 langsamer ist als die WarpOS-Version
seines Vorg&auml;ngers, jedoch schneller als Heretic II. Das &quot;Feeling&quot; ist mit
Quake 1 zu vergleichen, aber besonders, wenn eine Menge Lichteffekte ins
Spiel kommen, erinnert die Geschwindigkeit eher an Heretic II. Leuten ohne
3D-Hardware sei aber gesagt, dass der Software-Renderer deutlich schneller
ist als in Heretic II, so dass Quake 2 dann wesentlich angenehmer spielbar
ist.
</P>
<P>
 <A HREF="img/quake2-2.jpg"><IMG SRC="thumb/quake2-2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Damit keine Langeweile aufkommt, gibt's haufenweise MODs. Schau'n wir doch
mal, was Steffen dazu zu sagen hat.
</P>
<P>
&quot;Die 'MOD-Szene' f&uuml;r Quake 2 war schon immer eine der gr&ouml;&szlig;ten. Ein 'MOD'
ist eine Spielvariante, die das Spiel teilweise radikal &auml;ndert. Wir haben
&uuml;ber 50(!) verschiedene MODs auf den Amiga umgesetzt. Die 'Highlights':
</P>
The Weapons Factory<BR>
Devastation Quake 2<BR>
ActionQuake<BR>
Battle of the Sexes<BR>
Annihilation Quake 2<BR>
Headhunters<BR>
ThreeWave CTF<BR>
HolyWars<BR>
Catch the Chicken<BR>
<P>
Im Grunde sind die meisten der 'wichtigen' MODs portiert (und mit einigen
MOD-Teams sind wir noch in Verhandlung betreffs des MOD-Sourcecodes). Nur
einige wenige MOD-Teams haben eine Zusammenarbeit mit 'jemandem, den sie
nicht kennen' rundheraus abgelehnt.&quot;
</P>
<P>
So. Das soll's dann auch gewesen sein. Bleibt zu hoffen, dass das Spiel
bald fertig ist, denn bisher haben die Jungs von Hyperion noch nie
entt&auml;uscht. Es w&auml;re &uuml;brigens prima, wenn ihr ihnen eine kleine Anerkennung
in Form von E-Mails zukommen lassen k&ouml;nntet. Immerhin basteln sie uns in
ihrer Freizeit ein wirkliches Hammerspiel!
</P>
<P>
Oliver Tacke &lt;<A HREF="mailto:oliver@aakt.de">oliver@aakt.de</A>&gt;
...vielen Dank an Steffen H&auml;user f&uuml;r die Informationen und die Screenshot!
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
