<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Vorwort</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Main.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Intern.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Vorwort
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Vorwort</H1>
<P>
+++ AMIGA am Messestand von Microsoft - bahnt sich eine Kooperation an? +++
AMIGA pr&auml;sentiert Nokia als OEM-Partner +++ Eyetech demonstriert lauff&auml;hige
Version des AmigaONE und ver&ouml;ffentlicht Produktdetails +++
</P>
<P>
Willkommen damit zur neuen Ausgabe von AMIGA aktuell.
</P>
<P>
Der vergangene Monat k&ouml;nnte in die Geschichte des Amiga eingehen. Ohne
&Uuml;bertreibung zu einer Nebens&auml;chlichkeit geworden ist die an sich
spektakul&auml;re Meldung, dass der weltgr&ouml;&szlig;te Mobiltelefonhersteller Nokia das
AmigaDE auf seinem neuen Multimediager&auml;t &quot;Mediaterminal&quot; vorinstallieren
wird.
</P>
<P>
Diese und alle anderen Amiga-Neuigkeiten hat jedoch folgender Satz des
AMIGA-Mitarbeiters Gary Peake v&ouml;llig &uuml;berlagert: &quot;Microsoft hat uns
gebeten, das AmigaDE und einige Entwicklerprogramme auf verschiedenen
Ger&auml;ten an ihrem Stand vorzuf&uuml;hren.&quot;
Gemeint ist die Computermesse &quot;Embedded Systems Show&quot;, die Mitte M&auml;rz in
San Francisco stattfindet. Ob sich damit eine Kooperation zwischen den
beiden Unternehmen ank&uuml;ndigt, werden wir wohl erst auf dieser Veranstaltung
erfahren - vielleicht an einem von Amiga-Usern belagerten Microsoft-
Stand...
</P>
<P>
Alle Informationen sowie mehrere Kommentare zu diesem Thema findet
ihr in dieser Ausgabe von AMIGA aktuell.
</P>
<P><B>In eigener Sache:</B></P>
<UL>
<LI> Die Leserzuschriften zu unserer Umfrage &uuml;ber die von euch genutzten
  Betriebssysteme werden wir erst in der n&auml;chsten Ausgabe ver&ouml;ffentlichen.
  Bis dahin k&ouml;nnt ihr noch an dieser Aktion teilnehmen. Schreibt einfach an
  <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A>
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Zu den regelm&auml;&szlig;igen Aufrufen:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> An dieser Stelle eine Bitte: Jeder Artikelschreiber freut sich &uuml;ber
  Lob, aber auch &uuml;ber konstruktive Kritik, und wird durch sie motiviert.
  Scheut euch also bitte nicht, eure Meinung zu den verschiedenen Beitr&auml;gen
  zu &auml;u&szlig;ern, entweder, indem ihr direkt an die Autoren schreibt, oder aber
  an AMIGA aktuell (<A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A>).
</LI>
<BR><LI> Wir suchen st&auml;ndig Mitarbeiter, die regelm&auml;&szlig;ig, unregelm&auml;&szlig;ig oder
  einmalig Beitr&auml;ge zu AMIGA aktuell beisteuern wollen. Inhaltlich sind
  einer Mitarbeit kaum Grenzen gesetzt. Wer Interesse hat, sollte sich
  an <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A> oder <A HREF="mailto:christian@aakt.de">christian@aakt.de</A> wenden.
</LI>
</UL>
<P><B>Viel Spa&szlig; jetzt bei dieser Ausgabe,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Main.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Intern.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
