<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Workshops1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Workshops
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>2. Workshop: Nachbearbeitung von Scans (von Michael Christoph)</H2>
<P>
Wer Bilder in den Computer einscannt, wird das Ergebnis meist
nachbearbeiten m&uuml;ssen, damit eine vern&uuml;nftige Grafik dabei herauskommt.
Dazu existiert auf dem Amiga eine durchaus ansehnliche Anzahl an
Grafikprogrammen:
</P>
  ArtEffect, Haage &amp; Partner<BR>
  fxPaint, Innovative Software<BR>
  ImageFX, Nova Design<BR>
  Perfect Paint, Halvadjian Georges<BR>
  Photogenics, Idruna Software<BR>
<P>
Anhand der &quot;ArtEffect Plugin Collection CD&quot; bzw. deren Filter und Effekte
soll hier die exemplarische Vorgehensweise beschrieben werden.
</P>
<H3>* Das Ausgangsmaterial ist schlecht</H3>
<P>
Als Ausgangsmaterial und Beispiel dient uns eine Grafik von Buffy, die dem
Kalender &quot;Buffy the vampire slayer&quot; (ISBN 0-7683-4484-0) entnommen wurde.
Dabei f&auml;llt n&auml;mlich auch sofort negativ ein Raster- bzw. Moiremuster &uuml;ber
der gescannten Grafik auf. Grund daf&uuml;r ist die Art des Druckes.
</P>
<P>
Unterschieden wird zwischen Rasterdruck und Ditherdruck. Beim Rasterdruck
werden die Farben aus unterschiedlich gro&szlig;en Druckpunkten gebildet, wobei
die Farben in voneinander abweichenden Winkeln aufgebracht werden. Beim
Ditherverfahren hingegen werden nur kleine Farbpunkt verwendet. F&uuml;r
intensive/dunklere Farben werden viele Bildpunkte nebeneinander gedruckt.
Dabei kommt allerdings kein regelm&auml;&szlig;iges Raster zum Einsatz, sondern
unregelm&auml;&szlig;ige Abst&auml;nde.
</P>
<P>
Der Scanner tastet die Vorlage zeilenweise ab, wobei die Zeile aus vielen
nebeneinander liegenden Bildpunkten besteht. Beim Rasterdruck f&uuml;hrt dies
dann zu einem mehr oder weniger stark sichtbarem Raster. Soviel zur
eigentlichen Technik im kurzen.
</P>
<H3>* M&ouml;gliche L&ouml;sungen</H3>
<P>
Es gibt nun verschiedene Arten, wie diese St&ouml;rungen beseitigt werden
k&ouml;nnen.
</P>
<P><B><B>1. Von Hand ausbessern</B></B></P>
<P>
Die aufw&auml;ndigste M&ouml;glichkeit, die mit jedem Programm m&ouml;glich ist, ist die
manuelle Nachbearbeitung von Hand. Diese kann mit der Lupe pixelgenau
geschehen oder grob mit einem gr&ouml;&szlig;eren Pinsel und geringer Deckungskraft.
Da diese Vorgehensweise recht zeitaufw&auml;ndig ist und viel Konzentration und
Fingerspitzengef&uuml;hl erfordert, wird sie wohl nur selten zum Einsatz kommen.
</P>
<P><B><B>2. Weichzeichnen</B></B></P>
<P>
Wesentlich eleganter ist da schon der Effekt &quot;Weichzeichnen&quot; (zu finden im
Men&uuml; &quot;Filter/Weichzeichner/Weichzeichnen&quot;). Dieser vermischt teilweise die
einzelnen Bildpunkte und erzeugt dadurch feinere &Uuml;berg&auml;nge. Dadurch
verlieren die St&ouml;rungspunkte an Deckkraft und vermischen sich besser mit
ihrer Umgebung.
</P>
<P>
Ein entscheidender Nachteil ist allerdings, da&szlig; das komplette Bild
hierdurch leicht unscharf wird. Mehrmaliges Ausf&uuml;hren oder st&auml;rkere
Konzentration f&uuml;hren zu immer unsch&auml;rferen Grafiken. W&auml;hrend dies bei
Grafiken nicht so schnell auff&auml;llt, ist es f&uuml;r Textpassagen &uuml;berhaupt nicht
geeignet, da die Kantensch&auml;rfe der Buchstaben verlorengeht und somit die
Lesbarkeit reduziert und erschwert wird.
</P>
<P><B><B>3. SmartBlur</B></B></P>
<P>
Dieser Effekt (aus dem Men&uuml; &quot;Filter/Weichzeichner/SmartBlur&quot;), der mit der
Collection-CD installiert wurde, ist eine ideale L&ouml;sung f&uuml;r unser Problem.
Er beseitigt die st&ouml;renden Stellen, ohne da&szlig; darunter die Sch&auml;rfe des
Bildes zu stark leiden w&uuml;rde. Er ist daher auch zum Nachbearbeiten von
Textpassagen geeignet. Nat&uuml;rlich kann auch dieser Effekt keine Wunder
bewirken. Am besten ist immer noch eine m&ouml;glichst sauber eingescannte
Grafik.
</P>
<H3>* Scanaufl&ouml;sung</H3>
<P>
Je nachdem, wof&uuml;r die Grafik weiterverwendet werden soll, ist sie in
unterschiedlichen Aufl&ouml;sungen zu scannen. Durchschnittliche Werte sind:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD ALIGN="RIGHT" VALIGN="TOP">75 dpi:&nbsp;</TD><TD VALIGN="TOP">Webgrafiken&nbsp;</TD></TR>
<TR><TD ALIGN="RIGHT" VALIGN="TOP">150 dpi:&nbsp;</TD><TD VALIGN="TOP">normale und zu druckende Grafiken&nbsp;</TD></TR>
<TR><TD ALIGN="RIGHT" VALIGN="TOP">300 dpi:&nbsp;</TD><TD VALIGN="TOP">Fotos&nbsp;</TD></TR>
<TR><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Dabei sollte grunds&auml;tzlich in 24 Bit Farbtiefe gescannt werden. Bei Bedarf
kann die Grafik sp&auml;ter im Malprogramm reduziert werden.
</P>
<P>
Man kann aber auch in h&ouml;heren Aufl&ouml;sungen scannen, das Material
nachbearbeiten und erst dann auf eine geringere Aufl&ouml;sung reduzieren. Auch
hierdurch lassen sich St&ouml;rungen verringern.
</P>
<H3>* Die Vorgehensweise im Einzelnen</H3>
<UL>
<LI> Zuerst wird das gew&uuml;nschte Bild &uuml;ber den Men&uuml;punkt &quot;Projekt/&Ouml;ffnen&quot;
  geladen
</LI>
<BR><LI> Ggf. &uuml;ber &quot;Editieren/Beschneiden&quot; oder &quot;Editieren/Bildgr&ouml;&szlig;e&quot; das Bild
  vorbereiten
</LI>
<BR><LI> Sollen nicht alle Bereiche bearbeitet werden, k&ouml;nnen diese ausmaskiert
  werden. Dazu das Maskenwerkzeug in der Toolbar ausw&auml;hlen und den zu
  sch&uuml;tzenden Bereich mit gedr&uuml;ckter linker Maustaste aufziehen. GGf. mit
  gehaltener ALT-Taste weitere Bereiche hinzunehmen oder mit gehaltener
  linker Amiga-Taste Bereich entfernen.
</LI>
<BR><LI> Aus dem Men&uuml; &quot;Filter/Weichzeichner&quot; das SmartBlur-Einsteller-Fenster
  &ouml;ffnen
</LI>
</UL>
<P>
&Uuml;ber &quot;Edges&quot; wird bestimmt, wie starke Kontraste behandelt werden.
&quot;Hard&quot; sorgt daf&uuml;r, da&szlig; Bildteile mit starken Kontrasten als Kante
betrachtet werden und somit auch nicht ver&auml;ndert werden.
</P>
<P>
&quot;Soft&quot; rechnet je nach Edgethreshold-Einstellung mehr Unsch&auml;rfe in die
gerade behandelten Bildteile ein. Mit Hilfe dieser Einstellung lassen sich
St&ouml;rungen aus beinahe gleichfarbigen Fl&auml;chen einfach entfernen.
Je weniger Kontrast im Bildteil, desto st&auml;rker die Unsch&auml;rfe, die
eingerechnet wird.
</P>
<P>
Je kleiner der &quot;Radius&quot;, desto weniger umliegende Pixel werden untersucht.
Kleinere Radien f&uuml;hren zu besseren Ergebnissen. Je kleiner der Wert bei
&quot;Edgethreshold&quot;, desto unsch&auml;rfer wird das Ergebnis.
</P>
<UL>
<LI> &Uuml;ber &quot;Projekt/Speichern als&quot; die nachbearbeitete Grafik unter einem
  neuen Namen und dem gew&uuml;nschten Dateiformat auf Festplatte sichern.
</LI>
</UL>
<P>
F&uuml;r Grafiken eignet sich am besten das JPEG-Format, das durch
unterschiedliche Komprimierungsraten die sp&auml;tere Dateigr&ouml;&szlig;e bestimmt. Je
kleiner der Qualit&auml;tswert (bzw. je gr&ouml;&szlig;er die Komprimierung), desto
schlechter wird das Ergebnis. Bis zu einem gewissen Grad erm&ouml;glicht es aber
auch das JPEG-Format, die anzuzeigende Grafik leicht zu gl&auml;tten.
Wird die Grafik nur zwischengespeichert, um sie sp&auml;ter noch weiter zu
bearbeiten, eignet sich PNG oder IFF besser, da diese verlustfrei speichern
und so die Originalqualit&auml;t erhalten bleibt.
</P>
<H3>* Muster</H3>
<P>
Die nachfolgenden Grafiken sollten auf einem eigenen Bildschirm im
Echtfarbmodus betrachtet werden, damit die Ergebnisse deutlich sichtbar
werden.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Die Buffy-Grafik mit Weichzeichnen- und SmartBlur-Effekt&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"> <A HREF="img/buffy_weich_blur.jpg"><IMG SRC="thumb/buffy_weich_blur.jpg" WIDTH="120" HEIGHT="58" ALT="Grafik anzeigen"  BORDER="0"></A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Ein Text mit dem Weichzeichnen-, Sch&auml;rfen- und SmartBlur-Effekt&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP"> <A HREF="img/bericht_text.jpg"><IMG SRC="thumb/bericht_text.jpg" WIDTH="120" HEIGHT="94" ALT="Grafik anzeigen"  BORDER="0"></A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">ArtEffect-Programm und Plugin Collection CD&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP"> <A HREF="img/arteffect_prgundcd.jpg"><IMG SRC="thumb/arteffect_prgundcd.jpg" WIDTH="120" HEIGHT="66" ALT="Grafik anzeigen"  BORDER="0"></A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">F&uuml;r Fans das komplette Kalenderblatt&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"> <A HREF="img/buffy_aug2001.jpg"><IMG SRC="thumb/buffy_aug2001.jpg" WIDTH="63" HEIGHT="96" ALT="Grafik anzeigen"  BORDER="0"></A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<H3>* Noch mehr Informationen</H3>
<P>
Grundlagen zu den Scannertypen, zum Scannen selbst und Tipps zur
Nachbearbeitung finden sich auch im aktuellen Amiga Magazin 03/2002 und
04/2002 bzw. k&ouml;nnen online auf meinen Webseiten unter
<A HREF="http://www.meicky-soft.de/amiga-magazin/amindex.html" TARGET="_top">http://www.meicky-soft.de/amiga-magazin/amindex.html</A> gelesen werden (der
zweite Teil aus der Aprilausgabe steht ab etwa Mitte M&auml;rz bereit).
</P>
<P><B>Michael Christoph &lt;<A HREF="mailto:michael@meicky-soft.de">michael@meicky-soft.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
