<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Der Zwischenruf
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Der Zwischenruf (von Ralf Driesner)</H1>
<P>
Ich bin klein. Mein Herz ist rein.
</P>
<P>
Es gibt Tage, an denen man die Welt nicht mehr versteht. Der Kaffee ist
goldblond, obwohl man sich sicher zu sein scheint, keine Milch in die Br&uuml;he
gesch&uuml;ttet zu haben. Man findet d&uuml;nne Fadennudeln in der selbstgebrauten
Nudelsuppe, obwohl man dem unersch&uuml;tterlichen Glauben verfallen war,
Makkaroni-Chips in das mit Pulver gef&auml;rbte Suppenwasser gegeben zu haben.
Und zu guter Letzt liest man, dass ausgerechnet AMIGA ein Gastspiel an
einem Microsoft-Messestand haben soll.
</P>
<P>
Was ist nur los auf dieser kosmischen Kartoffel, in Expertenkreisen auch
Erde genannt? Ein Blick aus dem Fenster zeigt noch dasselbe besch...eidene
Wetter wie am Vortag. Der Nachbar macht auch noch genauso Radau, wie ich es
von ihm gewohnt bin (er beschimpft seinen Hund mit Worten, die wir an
dieser Stelle aus R&uuml;cksicht auf die katholische Kirche nicht wiederholen
wollen). Und das Stadtteil-Werbe-K&auml;seblatt ist - wie immer - ein mit Wasser
durchtr&auml;nkter, trauriger und h&ouml;chst &uuml;belriechender, aus dem Briefkasten
halb heraush&auml;ngender Zellstofflappen.
</P>
<P>
Der astrologisch beeinflusste Teil meines Gro&szlig;hirns scheint also
unbegr&uuml;ndet Alarm geschlagen zu haben. Die Mondphase ist ok. Und wir werden
auch nicht von Aliens unterminiert. Zum Teil scheinen die aktuellen
Ereignisse unter der Karteikarte &quot;Zufall&quot; abgehackt werden zu k&ouml;nnen.
</P>
<P>
Die Story mit Microsoft und AMIGA will mir jedoch nicht ganz aus dem Kopf
gehen. Welche Strategie steckt dahinter? Nun, es gibt verschiedene
Szenarien. Sehen wir uns diese im einzelnen an:
</P>
<P>
1.
</P>
<P>
Microsoft will Amiga(-technologie) auf- oder einkaufen. Das meistverkaufte
Betriebssystem der Welt soll also ausgerechnet an einer nicht in der Praxis
erprobten und bew&auml;hrten Technik ankn&uuml;pfen. Milliarden Dollar
Forschungsgelder werden ausgegeben, um dann ausgerechnet f&uuml;r 'n Appel und
'n Ei den Kniff der Menschheitsgeschichte in Form von AmigaDE-Technologie
zu integrieren? Unwahrscheinlich.
</P>
<P>
2.
</P>
<P>
Ein simpler Schreibfehler, der die ganze Amiga-Welt an den Rand des Herz-,
Hirn- und Ohrinfarkts f&uuml;hrt. An jeder Ecke liegt ein r&ouml;chelndes Etwas mit
einem kleinen BoingBall-Sticker auf der linken Brust. Wie fahrl&auml;ssig....
</P>
<P>
3.
</P>
<P>
Microsoft m&ouml;chte zeigen, wie einfach multiple Anwendungen und Oberfl&auml;chen
auf seinem neuen PDA-Betriebssystem gehostet werden k&ouml;nnen. AMIGA m&ouml;chte
zeigen, dass keine Rechnerplattform, auch kein PDA, mehr vor dem AmigaDE
sicher ist. Simpel und portabel programmiert. Klein und effizient genug, um
es auch den Gro&szlig;en zu zeigen. Clever...!
</P>
<P>
Der treue Zwischenruf-Leser, an die unverf&auml;lschlich einfache Denkweise des
Schreibers gew&ouml;hnt, wird sicher sofort die richtige Antwort herausgefunden
haben. Keine der drei Varianten erscheint sehr realistisch. Obwohl Ziffer 2.
gewisse Bez&uuml;ge zur Realit&auml;t.....na ja, lassen wir das.
</P>
<P>
Zun&auml;chst ist's wie immer im Leben....David k&auml;mpft gegen Goliath. Wir kennen
die Zukunft eben nicht. Und wenn sich die beiden ausgetobt haben wird's bei
einer Ma&szlig; Milch so richtig z&uuml;nftig.
</P>
<P>
Beim Stichwort Milch f&auml;llt mir ein, dass ich die, abgelenkt durch die
K&ouml;ter-Schelte meines Nachbarn, vor dem Kaffe in die Tasse gesch&uuml;ttet habe.
Und Makkaroni-Chips stehen zwar auf der Einkaufsliste aber eindeutig nicht
im K&uuml;chenschrank. Alzheimer sei Dank; die Welt ist doch in Ordnung. Auch
wenn das mit diesem pitschnassen Werbeblatt nun nicht unbedingt notwendig
gewesen w&auml;re.....
</P>
<P><B>Lebt lang und erfolgreich!</B></P>
<P><B>Euer</B></P>
<P><B>Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
