<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - MegaBlast</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Willkommen zur Coder's Corner!</H1>von<BR><A HREF="mailto:C.Jahn@gmx.de">Carsten Jahn</A></DIV>
<P>Was krempelt rum in der Coder's Corner?</P>
<P>F&uuml;r die f&uuml;nfte (diese) Ausgabe des AmZeigers sah es hier erst ziemlich
eng aus, weil ich mich immer recht sp&auml;t zum Tippern "aufraffe" und der
Redaktionsschlu&szlig; schnell n&auml;her r&uuml;ckt (in zweieinhalb Stunden ist es
soweit). Wenn mich der Zivildienst dann noch f&uuml;r sieben Tage am St&uuml;ck
beansprucht, komme ich schnell in Versuchung, bis zur letzten Minute
am Compi zu h&auml;ngen. Abends war ich zu erschossen f&uuml;r geistige
T&auml;tigkeiten... :-)</P><P>
Jedenfalls habe ich einen <A HREF="9806bug.htm">Artikel</A> &uuml;ber Debug-Hilfsprogramme geschrieben,
die beim Programmieren in jeder Sprache hilfreich sind, um Fehler im
Programm zu entdecken und einzugrenzen.</P><p>
In der letzten Windung meines Hirns schwebte dann noch die Vermutung
&uuml;ber einen Gedanken &uuml;ber MUI und GNU-C. Da hatte mir doch mal jemand
die Adresse seiner Homepage mit Infomaterial zugemailt? Die hochbrisanten
Dateien (ge&auml;nderte und angepa&szlig;te MUI-Includes...) sollte sich der geneigte
Leser heimlich selber von Knut S&uuml;berts Seite ziehen. ;-></P><P>
Und einen <A HREF="9806bb.htm">BlitzBasic2-Kurs</A> hatte Thomas Krippner noch &uuml;brig. Nicht
unbedingt f&uuml;r Einsteiger, meint er, aber die sollten sich den Kurs
trotzdem mal ansehen. Ich habe die ersten zwei Teile &uuml;berarbeitet und
hier beigelegt.</P><P>
Was w&auml;re ich ohne Stephan Manske? Der hat sich auf einem Usertreffen
bei mir nach MUI und GNU-C erkundigt, und ich hatte zuf&auml;llig kurz vorher
den o.g. Link erhalten. Weil nun einige Zeit ins Land gegangen ist, habe
ich ihn gebeten, mal was zu diesem Thema zu schreiben. Zu meiner gro&szlig;en
Freude hat er einen <A HREF="9806mui.htm">Artikel</A> produziert, der unbedingt auch noch in diese
Ausgabe mu&szlig;.</P><p>
So zeigt sich, wie wichtig die Mitarbeit Anderer f&uuml;r eine halbwegs volle
Rubrik ist. Autsch, der Zaunpfahl war fast zu gro&szlig; zum Winken...  &Uuml;ber
Programmierer, die die Welt nicht nur mit ihren Programmen sondern auch
mit ihren Artikeln begl&uuml;cken wollen, freue ich mich sehr, das mu&szlig; ich
wohl nicht extra sagen. Siehe <A HREF="../amz0698/wanted.htm">Wanted!</A>
</P><P>
So weit, so gut, bis in drei Monaten (mal sehen, wen ich dann wieder
anbetteln werde),</P>

Euer<BR>
<A HREF="mailto:C.Jahn@gmx.de">Carsten Jahn</A><BR>
 Coder's Corner-Redakteur<BR>

<P>P.S.: Die Sourcecodes der Coder's Corner befinden sich in diesem
<A HREF="../amz0698/bin.lha">Archiv</A>.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../hw/9806hw.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9806bug.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
