<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Roolipelej&auml; Roguen malliin</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Tatu Tamminen &lt;<a href="mailto:tx3@iobox.com">tx3@iobox.com</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Amigalle l&ouml;ytyy monia hyvi&auml; merkkipohjaisia roolipelej&auml;, jotka ovat t&auml;ysin ilmaisia. Jokaisella pelill&auml; on luonnollisesti hyv&auml;t ja huonot puolensa, joten joskus valinta voi olla vaikea. Peleill&auml; on kuitenkin merkitt&auml;vi&auml; eroja toisiinsa n&auml;hden, joten jos ei pid&auml; yhdest&auml;, niin se ei v&auml;ltt&auml;m&auml;tt&auml; tarkoita sit&auml;, ett&auml; kaikki olisivat yht&auml; suuria pettymyksi&auml;. (Tosin saattaa my&ouml;s k&auml;yd&auml; niin, ett&auml; seuraava peli onkin pahempi pettymys... ;-D) Mutta koska kaikki pelit ovat ilmaisia, ei ole v&auml;li&auml; vaikka k&auml;visi hakemassa useita pelej&auml;.
						<p>Valitsin testiin omasta mielest&auml;ni kolme vahvinta ehdokasta: ADOM, Nethack ja Angband. Kaikki t&auml;m&auml;ntyyliset pelit pohjautuvat Rogue- ja Hack-nimisiin peleihin, Moriakin on niit&auml; ensimm&auml;isi&auml;. T&auml;h&auml;n v&auml;liin haluaisinkin sanoa pari sanaa n&auml;ist&auml; merkkipohjaisista peleist&auml;: &auml;l&auml; s&auml;ik&auml;hd&auml; karua ulkoasua, joka ensimm&auml;isen&auml; ruutuun putkahtaa. Kun opit eri merkkien merkityksen, niin pelin hienous alkaa valjeta. Voin sanoa, ettei yksik&auml;&auml;n PC:n 3D-&quot;roolipeli&quot;roska ole mit&auml;&auml;n verrattuna esim. Adomin hienoihin ideoihin, sill&auml; ne eiv&auml;t keskity t&auml;ysill&auml; pelattavuuteen, vaan panostavat paljon my&ouml;s graafiseen ulkoasuun. N&auml;ist&auml; peleist&auml; on my&ouml;s l&auml;hdekoodit levityksess&auml;, joten ei tarvitse surkutella sit&auml;, ettei peli&auml; l&ouml;ydy omalle koneelle.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>ADOM (versio 0.9.9 Gamma 15)</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Ancient Domains Of Mystery eli lyhyesti ADOM on kaikkein monipuolisin. Heti ensimm&auml;ist&auml; hahmoa luodessa huomaa, ett&auml; peliin on laitettu mukavia ideoita mukaan: esimerkiksi eri kuukausina (my&ouml;s p&auml;iv&auml; vaikuttaa) hahmolle tulee erilaisia etuja ja haittoja. Rotuja ja taitoja on mielett&ouml;m&auml;n paljon, ja niist&auml; saa todella monia kombinaatioita. Kaikkiin t&auml;m&auml;nkaltaisiin peleihin p&auml;tee se s&auml;&auml;nt&ouml;, ett&auml; maagilla tai vastaavalla ei kannata aloittelijan aloittaa! Totta kai kannattaa kokeilla, mutta maagi on fyysisesti heikko ja kuolevainen, jolloin pelin alkuosa on vaikea. Joten joku ogre-barbaari voisi olla aloittelijalle sopiva, koska siin&auml; ei tarvitse k&auml;ytt&auml;&auml; aivoja niin paljon... ;)
						<p>&quot;?&quot;-merkill&auml; saa n&auml;kyviin komennot ja muutakin tietoa pelist&auml;. En suosittele t&auml;t&auml; peli&auml; ensimm&auml;ist&auml; kertaa roolipelej&auml; pelaavalle, ellei sitten joku ole neuvomassa. Aloittelijan kannattaa lukea Angbandin arvostelu. Pelist&auml; l&ouml;ytyy PPC-versiokin, se menee periaatteessa mille tahansa ruudulle ja tietenkin moniajaa, joten jotain hyv&auml;&auml; musaa soimaan taustalle. Asennus sujuu jouhevasti Amigan omalla Installerilla, ja k&auml;sinkin asennuksen voi tehd&auml; helposti. Asetuksia varten Amiga-versiossa on oma GUI. Lyhyesti sanottuna peli on helppo saada, asentaa ja sit&auml; p&auml;&auml;see pelaamaan nopeasti.</p>
						<p><a href="http://ftp.sunet.se/pub/aminet/game/role/Adom_68020.lha" target="_blank">68020-versio</a> (1 Mt)<br>
						<a href="http://ftp.sunet.se/pub/aminet/game/role/Adom_68040.lha" target="_blank">68060-versio</a> (1 Mt)<br>
						<a href="http://ftp.sunet.se/pub/aminet/game/role/Adom_PPC.lha" target="_blank">PPC-versio</a> (1,2 Mt)</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Nethack</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Nethack on ehk&auml; tunnetuin merkkipohjainen roolipeli. Itse innostuin juuri t&auml;t&auml; pelaamaan ensimm&auml;isen&auml;, ja j&auml;in koukkuun saman tien. Olin pelannut kyll&auml; muitakin roolipelej&auml; kuten Black Crypt (paras!), Dungeon Master jne., mutta mit&auml;&auml;n t&auml;llaista en ollut ennen pelannut. Pelist&auml; l&ouml;ytyy mielett&ouml;m&auml;sti kaikkea uutta keksitt&auml;v&auml;&auml;! Esim. jos k&auml;&auml;r&ouml;j&auml; lukee k&auml;nniss&auml;, niin vaikutus saattaa olla hyvinkin erilainen... Rotuja l&ouml;ytyy tarpeeksi, esineit&auml; ja hirvi&ouml;it&auml; on vaikka muille jakaa. Ehdottomasti tutustumisen arvoinen peli. Vaikeampi aloittelijalle kuin Angband, mutta helpompi kuin ADOM. Peliin saa my&ouml;s grafiikat ja &auml;&auml;net, jos niit&auml; kaipaa. MorphOSillekin l&ouml;ytyy tuore k&auml;&auml;nn&ouml;s. Pelin k&auml;ynnistys on helppoa; napsautat vain ikonia.
						<p><a href="ftp://ftp.nethack.org/pub/nethack/nh331/binaries/amiga/nh331am000.lha" target="_blank">Nethack 3.3.1, 68000/68010</a> (1,2 Mt)<br>
						<a href="ftp://ftp.nethack.org/pub/nethack/nh331/binaries/amiga/nh331am020.lha" target="_blank">Nethack 3.3.1, 68020+</a> (1,2 Mt)</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Angband</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">T&auml;t&auml; peli&auml; en ole pitk&auml;&auml;n aikaan pelannut, mutta muistaakseni t&auml;m&auml; oli yksinkertaisin kaikista kolmesta. T&auml;ll&auml; on helppo aloittaa roolipelaaminen, tosin peli on aika tyls&auml;. Teht&auml;v&auml;n&auml; taisi olla menn&auml; 100 kerrosta alasp&auml;in luolastossa ja tappaa paha. &Auml;rsytt&auml;v&auml;&auml; peliss&auml; on se, ett&auml; jos kerroksia menee yl&ouml;s ja alas, niin edellinen taso &quot;unohtuu&quot;. Kannattaa kuitenkin kokeilla t&auml;t&auml;kin. Angbandista l&ouml;ytyy modifioituja versioita, kuten ZAngband.
						<p><a href="http://ftp.sunet.se/aminetbin/find?angband" target="_blank">Angband, eri versioita</a></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Yhteenveto</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kokeilemalla eri roolipelej&auml; l&ouml;yt&auml;&auml; varmasti itselleen sopivan, joten ei kannata sokeasti luottaa t&auml;h&auml;n pikku arvosteluun. Jos kysytt&auml;v&auml;&auml; tulee t&auml;st&auml; tai jostain muusta aiheesta, niin laita mailia: <a href="mailto:misc@raa.to">misc@raa.to</a> tai <a href="mailto:tx3@iobox.com">tx3@iobox.com</a>.
						<p>Testikone:<br>
						A1200T, PPC603 200 MHz/68040, BVision, 17&quot; Belinea, Prelude, kiintolevyt jne.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
