<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Virtual GP</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Jarmo Piippo</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kolme Dee -pelitarjonta on viime aikoina kasvanut Amigallakin kiitett&auml;v&auml;&auml;n tahtiin, mutta tekstuurimapatut ajopelit ovat j&auml;&auml;neet soittamaan toista viulua lukuisien r&auml;iskint&auml;rymistelyjen suosion varjoon. Vuosia sitten n&auml;hdyst&auml; AlienF1 -pelidemosta kasvanut Virtual GP paikkaa tehokkaasti kaahauspelivalikoiman aukkoa pirist&auml;v&auml;n tasokkaan toteutuksensa ansiosta.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Sulavasti matkaan</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Ratin takana istumista p&auml;&auml;see kokeilemaan muitta mutkitta k&auml;ynnist&auml;m&auml;ll&auml; pelin suoraan CD:lt&auml;. Pelaamisen aikana Virtual GP ei lataa mit&auml;&auml;n levylt&auml;, joten h&auml;iritsevi&auml; lataustaukoja ei esiinny lainkaan rompultakaan pelatessa. Niinp&auml; p&auml;&auml;tin s&auml;&auml;st&auml;&auml; kiintolevytilaa pelaamalla Virtual GP:t&auml; toistaiseksi vain rompulta. Minimiasennus Installerilla mahdollistaa pelin asetusten tallentamisen kiintolevylle. My&ouml;s t&auml;ysasennus on mahdollinen, mutta datahakemistojen kopiointi on teht&auml;v&auml; k&auml;sin. CD sis&auml;lt&auml;&auml; 420 Mt dataa, josta animaatioita on 365 Mt ja pelidataa 55 Mt.
						<p>Kuvan resoluutiota ei voi muuttaa kesken pelin, joten n&auml;ytt&ouml;tila on valittava aloittamalla peli yhdell&auml; sen kolmesta k&auml;ynnistysikonista. VirtualGP k&auml;ynnist&auml;&auml; pelin 320x256-tilassa, joka on nopea vanhemmillakin prosessoreilla, mutta ainakin VGA-monitorilla hiukan palikkainen.</p>
						<p>VirtualGP.Hi k&auml;ytt&auml;&auml; pystysuunnassa kaksinkertaista tarkkuutta, eik&auml; kuvan laadussa en&auml;&auml; ole moittimista ainakaan omalla 14-tuumaisella monitorillani. T&auml;lle versiolle sopii erinomaisesti n&auml;ytt&ouml;tilaksi DblPAL 320x512, jolloin varsinainen peliruutu on kooltaan 320x440 pistett&auml; 64 v&auml;rill&auml;. Kaikilla grafiikkakorteilla VirtualGP.Hi ei v&auml;ltt&auml;m&auml;tt&auml; toimi, sill&auml; se vaatii kuvasuhteiltaan 1x2-muotoisen n&auml;ytt&ouml;tilan.</p>
						<p>VirtualGP.DB on matalaresoluutioinen (320x256) peli, mutta varustettuna kaksoispuskuroinnilla (Double Buffering). Manuaalin mukaan t&auml;m&auml; tila on tarkoitettu joitakin grafiikkakortteja (esim. BVision) varten, est&auml;m&auml;&auml;n mahdollinen n&auml;yt&ouml;n v&auml;lkynt&auml; pelin aikana.</p>
						<p>Pelimoottori on tehty tuottamaan nopeasti suoraan AGA-piirien k&auml;ytt&auml;m&auml;&auml; planar-grafiikkaa, joten manuaalin mukaan peli toimii AGA:lla useissa tapauksissa jopa nopeammin kuin grafiikkakorteilla. Vaikka vaatimuksena on 68030-prosessori, pelin pit&auml;isi toimia jotenkuten jo 68020:llakin (muttei ilmeisesti kuitenkaan pelattavalla nopeudella).</p>
						<p>Renderoidun HAM8-alkuanimaation (totta kai...) my&ouml;t&auml; p&auml;&auml;st&auml;&auml;n valitsemaan kilpailu- tai harjoittelumoodeja ja rataa, ja pian ollaankin istumassa ikioman Formulan penkiss&auml;.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Lentosimu ilman lent&auml;mist&auml;</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">L&auml;himp&auml;n&auml; vertailukohteena Virtual GP:lle voisi olla ammoinen Microprosen Formula One Grand Prix. Molemmissa voi kilpailla kokonaisen 16 rataa k&auml;sitt&auml;v&auml;n kauden, ja teknisen&auml; tavoitteena on simulaattori, joka mahdollisimman realistisesti mallintaa oikean Formula-auton fysikaaliset ominaisuudet ja ajotuntuman. My&ouml;s auton monipuolinen virittely eri radoille sopivaksi tulosten parantamista varten kuuluu kuvioihin.
						<p>Simulaation realistisuudesta en osaa sanoa Formula-kokemuksen puutteeni takia mit&auml;&auml;n, mutta &quot;riitt&auml;v&auml;n&quot; vaikea ohjaus kyll&auml; ainakin on. Aloitteleva kuski on vakio-asetuksilla hiirell&auml; pelatessaan heti v&auml;h&auml;nkin isommassa vauhdissa yhten&auml;&auml;n t&ouml;rm&auml;ilem&auml;ss&auml; radan laitaan. (Jos laitaan j&auml;&auml; jumiin, auton saa k&auml;&auml;nnetty&auml; takaisin radan suuntaan TAB-n&auml;pp&auml;imell&auml;.)</p>
						<center>
							<p><img height="220" width="320" src="kuvat/vgp1.jpg" border="0" alt=" "></p>
							<p><i>Free Practise on herkkua aloittelijalle.</i></p>
						</center>
						<p>Onneksi peli&auml; voi kuitenkin helpottaa tinkim&auml;ll&auml; hiukan realistisuudesta. Game Options -valikosta l&ouml;ytyvill&auml; Driving Help -valinnoilla auton ohjattavuutta ja k&auml;ytt&auml;ytymist&auml; voi parantaa todellista tilannetta paremmiksi, sek&auml; aktivoida &quot;Yaw angle limiter&quot;-toiminnon, joka rajoittaa auton harmillisen herkk&auml;&auml; taipumusta py&ouml;ri&auml; vimmatusti ymp&auml;ri. :) Lis&auml;ksi voi my&ouml;s est&auml;&auml; auton vahingoittumisen t&ouml;rm&auml;yksiss&auml;.</p>
						<p>Game Options -valikossa sijaitsevat my&ouml;s eritt&auml;in tarpeelliset hiiren herkkyyden s&auml;&auml;t&ouml; ja analogisen joystickin kalibrointi. Mukavana lis&auml;n&auml; my&ouml;s ohjauksen lineaarisuutta voi s&auml;&auml;t&auml;&auml; portaattomasti, joten halutessaan saa ohjauspy&ouml;r&auml;n tarkkuutta keskiasennon l&auml;hell&auml; parannettua ja k&auml;&auml;ntymisen nopeutta &auml;&auml;riasennoissa kasvatettua itselleen sopivampiin arvoihin. Bonuksena l&ouml;ytyy viel&auml; mahdollisuus valita moniajo j&auml;tett&auml;v&auml;ksi p&auml;&auml;lle my&ouml;s ajamisen aikana.</p>
						<p>Peliohjaimeksi k&auml;y hiiri, joystick tai analoginen joystick. Analogisen ohjaimen kanssa voi tosin tulla hankaluuksia joissakin AGA-n&auml;ytt&ouml;tiloissa, koska ohjaimen potentiometrien asentoja lukevat laskurit toimivat t&auml;ll&ouml;in normaalia korkeammilla taajuuksilla. Omaa analogista ohjainta kokeillessani ohjaus ei suostunut kunnolla toimimaan ilmeisesti juuri t&auml;st&auml; syyst&auml;. Hiirell&auml; ohjattaessa oikea nappi kiihdytt&auml;&auml; ja vasen jarruttaa. Analogisen tikun avulla kiihdytys ja jarrutus toimivat tietysti ohjaussauvalla portaattomasti, ja ohjaimen napeilla vaihdetaan vaihteita.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Pilkunviilaus vie voittoon</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Ajettavaksi voi valita joko vain yhden kilpailun yhdell&auml; radalla tai Championship-moodin, jossa kilpaillaan l&auml;pi kaikki 16 rataa. Pelattaessa t&auml;ysimittaista Championshipi&auml; on pelitilanteen tallennus mahdollista. Varikolla ollessa on k&auml;ytett&auml;viss&auml; Car Setup, jossa autoa voi viritell&auml; renkaiden, jousituksen, iskunvaimentimien, jarrujen yms. ominaisuuksia s&auml;&auml;telem&auml;ll&auml;. Tehdyt asetukset voi my&ouml;s tallettaa ratakohtaisesti. Auton huolellinen s&auml;&auml;tely ja useat koeajot lienev&auml;t pakollisia toimenpiteit&auml;, jos mielii saavuttaa voittosijoituksia kilpailuissa.
						<center>
							<p><img height="220" width="320" src="kuvat/vgp2.jpg" border="0" alt=" "></p>
							<p><i>Temmellyskentt&auml;n&auml; on 16 aitoa kilparataa.</i></p>
						</center>
						<p>Aktivoimalla Telemetry -valinnan voi varikon &quot;tietokoneen&quot; laittaa ker&auml;&auml;m&auml;&auml;n ajoaikaisia tietoja nopeudesta, radan jarrutuskohdista, renkaiden kulumisesta, sivuttais- ja kiihtyvyysvoimista ynn&auml; muusta. Saatujen tietojen perusteella voi sitten yritt&auml;&auml; viritt&auml;&auml; autoaan radalle paremmin sopivaksi em. Car Setupin avulla.</p>
						<center>
							<p><img height="220" width="320" src="kuvat/vgp3.jpg" border="0" alt=" "></p>
							<p><i>Tasaista kuin lentokent&auml;ll&auml;.</i></p>
						</center>
						<p>My&ouml;s auton kojelaudan omaan tietokonen&auml;ytt&ouml;&ouml;n voi numeron&auml;pp&auml;imist&ouml;n avulla valita haluamiaan tietoja n&auml;kyviin. Valittavina ovat esim. polttoainemittari, sijoitustilanne, nopeus, edellisen kierroksen keskinopeus ja yhden kierroksen keskim&auml;&auml;r&auml;inen polttoaineenkulutus. Funktion&auml;pp&auml;imill&auml; voi valita n&auml;kym&auml;n ohjaamosta tai kamerakulmia ulkoa, sek&auml; lis&auml;n&auml;ytt&ouml;j&auml; kierrosajasta, sijoituksesta ynn&auml; muusta. Instant replay kuuluu tietysti my&ouml;s pelin toimintovalikoimaan.</p>
						<p>Muokkaamalla pelin ASCII-muotoisia config-tiedostoja voi muuttaa vaikkapa ajajien nimi&auml; ja &quot;taitoja&quot; sek&auml; tiimien autojen ominaisuuksia. Manuaalissa lupaillaan joskus ehk&auml; lis&auml;palikoina tulevan saataville my&ouml;s mahdollisuus moninpeliin, PPC-versio suuremmalla kuvantarkkuudella ja pelieditoreita ratojen, taustamaisemien ja autojen muutteluun. Manuaali itse on harmi kyll&auml; nykyiseen tapaan mukana vain tekstitiedostona rompulla, toisin kuin esim. entisaikojen Formula One Grand Prixin j&auml;ttipaksu 168-sivuinen opus.</p>
						<p>Merkint&ouml;jens&auml; mukaan peliromppu on kopiosuojattu, mik&auml; hieman s&auml;ik&auml;ytti ensi alkuun suojausten kanssa aiemmin ilmenneiden ongelmien takia. Esim. er&auml;st&auml; PC-peli&auml; jotkut asemat eiv&auml;t edes suostuneet lainkaan tunnistamaan CD-levyksi! Virtual GP:n kanssa ei onneksi ainakaan omalla Mitsumillani tullut vastaan mit&auml;&auml;n lukih&auml;iri&ouml;it&auml;, vaan kaikki toimi t&auml;ysin moitteetta.</p>
						<p>Virtual GP on monipuolinen ja taidokkaasti ohjelmoitu AGA-piireill&auml; h&auml;mm&auml;stytt&auml;viin tuloksiin ylt&auml;v&auml; peli, joka sopii s&auml;&auml;t&ouml;varansa ansiosta niin aloittelijan hupiajeluihin kuin uupumattoman Formula-virittelij&auml;n kierrosaikojen viilaukseen. Suositellaan.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Julkaisija:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Islona Entertainment Ltd.</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Edustaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.ge.vip.fi" target="_blank">Gentle Eye Ky</a>, puh. (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">240 markkaa</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Pelityyppi:</font></td>
					<td width="50%" bgcolor="#d8ecfd">3D Formula-ajo</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Kieli:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Englanti</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Amiga AGA tai CGX, 68030/25 MHz, 4 Mt, CD-ROM</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Amiga 1200, 68060/50 MHz, 32 Mt, CD-ROM</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Grafiikka:</font></td>
					<td width="50%" bgcolor="#d8ecfd">88%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">&Auml;&auml;net:</font></td>
					<td width="50%" bgcolor="#d8ecfd">67%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Musiikki</font></td>
					<td width="50%" bgcolor="#d8ecfd">70%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Pelattavuus:</font></td>
					<td width="50%" bgcolor="#d8ecfd">86%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Yleisarvosana:</font></td>
					<td width="50%" bgcolor="#d8ecfd">90%</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
