<html>
<head>
<title>AMIGA Times 05/98 - Fun &amp; Talk</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><img src="../pic/talk.gif"><hr>
<b>Leserbrief von Thomas</b>
</center>
<p>

Der Brief von Thomas war eher ein Form Posting, wobei man zu 90% nur Buttons
anklicken mu&szlig;te, doch er hat auch einiges zur AT geschrieben, was wir unten
aufgef&uuml;hrt haben, doch lest selbst!
<p>
Rubrik=<br> Wie soll ich das sagen wenn deren Umfang solch starken Schwankungen
       ausgesetzt sind &amp; von 0 bis sehr umfangreich. Auch kann ich etwa bei
       Fun &amp; Talk nicht &uuml;ber Ausweitung oder Einschr&auml;nkung sprechen wenn die
       behandelten Themen so unterschiedlich sind. Die Rubrik &quot;Werbung&quot; solltet
       Ihr aber auf alle F&auml;lle weglassen oder habt Ihr schon einmal eine
       Zeitschrift gesehen in dessen Inhaltsverzeichnis steht &quot;Werbung...
       Seite 76&quot;. Das hei&szlig;t dann wohl alle anderen Seiten sind werbefrei 
       au&szlig;erdem wer klickt denn schon einen solchen Button an?
<p>
Verbesserungen=<br> Die Amiga Times ist in meinen Augen noch zu wenig durchdacht
                und unordentlich in ihrer Konzeption. Rubriken etwa die leer
                sind sollten auch gar nicht erst im Inhaltsverzeichnis erscheinen. Eine Zeitschrift die auch nach einem Jahr noch zugeben
                mu&szlig; keine Leserzuschriften zu erhalten macht keinen guten 
                Eindruck und bringt sicher auch keine Anzeigenkunden.
                V&ouml;llig themenfremde Artikel wie Medizin mitaufzunehmen halte
                ich f&uuml;r unsinnig und bestenfalls verspielt. Besonders, wenn
                sich ein Magazin Amiga Times nennt. Insgesamt ist &quot;at&quot; nur
                wenig innovativ im Gegensatz zu anderen Mags. Es fehlt die
                Originalit&auml;t. Ich pers&ouml;nlich werde auch in Zukunft das hervorragende &quot;Amigaaktuell&quot; bevorzugen wenn ich etwas neues
                in bezug auf meinen Amiga wissen m&ouml;chte.&quot;
<p>
Vielen Dank f&uuml;r Deine Mail, zu einigen Punkten m&ouml;chte ich Dir nat&uuml;rlich auch
meinen Standpunkt erkl&auml;utern. An l&auml;ngeren Testberichten arbeiten wir ja und 
sie sind schon gr&ouml;&szlig;er geworden, als fr&uuml;her. Das unser Fun &amp; Talk Bereich gro&szlig;e
Schwankungen erlebt, liegt daran, da&szlig; kaum Leser uns schreiben die uns eventuell Stoff f&uuml;r einen Artikel geben k&ouml;nnten, das fehlt aber. Interviews sind
in diesem Bereich ja wohl angebracht und auch Meinungen sollten in diese
Rubrik ihren Platz finden, da wir aber nicht jeden Monat uns &uuml;ber die Marktlage aufregen wollen oder sonstige abgehakte Themen wiederholen m&ouml;chten, ist
der Inhalt dieser Rubrik sehr unterschiedlich gestaltet, da wird sich so 
schnell auch nichts dran &auml;ndern, es sei denn unsere Leser helfen uns dabei.
Weiterhin fandest Du das mit der Werbung mist, das stimmt, wer klickt sowas
schon an? Da werden wir uns etwas einfallen lassen, was dem Leser zwar auch
nicht so gefallen wird, aber die einzige vern&uuml;nftige L&ouml;sung ist, wir bekommen
unsere Testexemplare ja zu 90% umsonst, und als Gegenleistung gibt es eben
Werbung, au&szlig;erdem finde ich es gut auch in Online Mags &uuml;ber Preise informiert
zu werden, was wir auch etwas ausbauen m&ouml;chten.
<p>
Du schriebst: &quot;Die Amiga Times ist in meinen Augen noch zu wenig durchdacht
und unordentlich in ihrer Konzeption. Rubriken etwa die leer sind sollten
auch gar nicht erst im Inhaltsverzeichnis erscheinen. &quot;
<p>
Erst seit Ausgabe 4/98 hat unser HTML Konvertierer seine eigenes Konzept gemacht, vorher wurde einiges vom alten Design &uuml;bernommen. Jetzt ist es kein
Problem auch Themenbereich rauszulassen, mir gef&auml;llt es auch nicht, zu
schreiben - diesmal leider nichts - und ich spiele schon mit dem Gedanken die
Rubrik &quot;Story&quot; komplett rauszunehmen, da es im Jahr h&ouml;chstens 3 Geschichten
gibt und diese k&ouml;nnen wir ja auch anders einf&uuml;gen. Workshops wird es auch so
schnell nicht mehr geben, hierzu fehlt uns einfach die Zeit. Wir br&auml;uchten
eben mehr Hilfe von den Lesern , wenn die z.B. mal einen Workshop schreiben
w&uuml;rden, w&auml;re niemand sauer, im Gegenteil!
<p>
Eine Zeitschrift die auch nach einem Jahr noch zugeben mu&szlig; keine Leserzuschriften zu erhalten macht keinen guten Eindruck und bringt sicher auch
keine Anzeigenkunden.&quot;
<p>
Das sehe ich anders. Wir haben eine gro&szlig;e Resonanz auf unser Mag, nach meinem
HD Verlust und somit auch dem Verlust aller Abo Adressen, hat es nicht lange
gedauert, bis wir wieder eine vern&uuml;nftige Abonenntenzahl verzeichnen konnten.
Auch so bekommen wir oft Lob oder Kritik Mails, gut und sch&ouml;n... was wir 
brauchen sind aber Hilfen, z.B. Meinungen f&uuml;r Fun &amp; Talk, eventuell eigene
Eindr&uuml;cke oder Test`s, oder Workshops, vielleicht sogar Tips &amp; Tricks, davon
erhalten wir aber nie etwas. Und warum? Keine Ahnung.... ich glaube nicht das
dies an uns liegt, sondern eher an der Faulheit (ich mu&szlig; es so sagen) der 
Leser.  Au&szlig;erdem geht es fa&szlig;t allen Mags so, wenn ich mal die ****** nennen
darf, ****** appeliert auch jede Ausgabe an die User, das sie mithelfen sollen,
aber im Endeffeckt, macht er das Mag allein, weil ihm keiner hilft.
Schade eigentlich!
<p>
themenfremde Artikel wie Medizin mitaufzunehmen halte ich f&uuml;r unsinnig und
bestenfalls verspielt.
<p>
Gut sehe ich ein, aber wir sind eben ein Entertainment Mag und kein pures
Amiga Mag. Man mu&szlig; auch mal etwas anderes bieten, zwar werden wir uns dem-
n&auml;chst nicht mehr auf solche Beitr&auml;ge konzentrieren, aber ab und zu wird
es sowas schon geben.
<p>
Insgesamt ist &quot;at&quot; nur wenig innovativ im Gegensatz zu anderen Mags.
Es fehlt die Originalit&auml;t. Ich pers&ouml;nlich werde auch in Zukunft das hervor-
ragende &quot;Amiga+aktuell&quot; bevorzugen wenn ich etwas neues in bezug auf
meinen Amiga wissen m&ouml;chte.
<p>
Wir m&uuml;ssen und werden noch lange an der AT arbeiten, doch wir br&auml;uchten
mehr Hilfe von den Lesern, die uns fehlt. Vielleicht hast Du ja ein paar
Ideen oder etwas f&uuml;r unser Mag, wenn nicht... auch nicht schlimm. Oben ge-
nannte Punkte werden auf jedenfall ge&auml;ndert, also das mit der Werbung und
den leeren Rubriken, den Rest werden wir uns nach und nach vornehmen.
<p>
Vielen Dank f&uuml;r Deine Meinungen und vielleicht
schaust Du bei und nocheinmal rein.
<p>
<i>-mn- </i>


<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="ai.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="130.html">
</MAP>
</center><hr>
</pre>
</body>
</html>
