<html>
<head>
<title>AMIGA Times 05/98 - Internet &amp; Co.</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">


<center><img src="../pic/inet.gif"><hr>
<b>interessante seiten im web</b>
</center>
<p>
<b>AirSoftware</b>
<p>
AirSoftware ist f&uuml;r den einen oder anderen vielleicht ein Begriff, es
ist eine - wie soll ich sagen - Firma die sehr viel auf dem Freeware
Status macht. Als ich wieder einmal das Aminet durchforstete und nach
dem Rainboot gesucht hatte, fand ich in dem dazugeh&ouml;rigen readme-Text
deren Homepage Adresse und die habe ich sofort aufgerufen, da es ab und
zu m&ouml;glich ist, eine aktuellere Version von der eigentlichen Homepage zu
zeihen, als aus dem Aminet. Nun und dort fand ich noch einiges mehr, unz&auml;hlige Cheater zu allen Spielen, viele HD Installer f&uuml;r alte und neue
Games und auch n&uuml;tzliche Tools f&uuml;r die WB (meist f&uuml;r den Bootvorgang), 
auch Shareware Software wird angeboten, sowie auch AirSoftware`s Spiel
&quot;The3Islands&quot;, welches man als Demo downloaden kann. Also diese Seiten
sollte man sich ansehen und vorallem die Adresse merken, wenn man wirklich
mal einen Installer oder ein Cheater ben&ouml;tigt! URL der Homepage lautet:<br>
<a href="http://home.pages.de/~airsoft">http://home.pages.de/~airsoft</a>
<p>
<b>Die Geschichte des Amiga</b>
<p>
Es ist unglaublich, eigentlich habe ich im Web nach Videoh&auml;ndler gesucht,
doch rausgekommen bin ich ganzwoanders. Das ist das tollle and den Suchmaschinen, man gibt ein Wort ein, und die dollsten Seiten werden einem
aufgelistet, von denen aber nicht eine das gew&uuml;nschte Ziel ist bzw. die
gew&uuml;nschten Informationen enth&auml;lt. Nun, wie gesagt, ich klickte einwenig
rum, bis ich auf einer Seite das wort &quot;AMIGA&quot; las, was mich dort sehr
ins staunen versetzte, schlie&szlig;lich handelten die Seiten zu 90% aus Info`s
zu Videos und Filmen, nun ich klickte also weiter bis, ich neue Links fand,
die da hie&szlig;en: &quot;Die Geschichte des Amiga&quot; und &quot;Programme&quot;. Bei der &quot;Ge-
schichte des AMIGA&quot;, handelt es sich um eine sehr gro&szlig;es Dokument, unterlegt mit vielen Bildern und es wird einem die wahre Geschichte des AMIGAs
erz&auml;hlt, von den Anf&auml;ngen bis Jetzt und das alles mit Fotos von Entwicklern
oder Programmierern, wer z.B. nicht wei&szlig; wie Jay Miner aussieht, dort seht
ihr ein Bild. Also das fand ich echt super, denn dort konnte ich wirklich
mal nachlesen und wer von Euch ebenfalls mal genaueres wissen will, sollte
dort vorbeischauen, es ist wirklich interessant!!! Bei &quot;Programme&quot; erh&auml;lt
man Infos zu Amiga Programmen, ist aber im Gegensatz zur Geschichte des
Amigas f&uuml;r einige sicher nicht so wichtig. Die URL der Homepage lautet:<br>
<a href="http://195.4.12.34/home/neunkirchen/www/amiga/amiga_ger.html">http://195.4.12.34/home/neunkirchen/www/amiga/amiga_ger.html</a>
<p>
<b>Internationale Brieffreundschaften im Web</b>
<p>
Wer l&auml;st sich das denn net ma durch den Kopf gehen - ein eMail-Freund 
oder Freundin in den USA oder Frankreich zu haben ? Bestimmt schon der 
eine oder andere. Hier ist eine Hilfe von uns ! Es gibt im Netz eine 
Adresse, wo ihr Anzeigen lesen k&ouml;nnt von Sch&uuml;ler, Studenten ect. aus 
aller Welt. Ihr k&ouml;nnt auch hier eine eigene Anzeige aufgeben.<br>
<a href="http://maincc.hufs.ac.kr/~mathias/liste.htm">http://maincc.hufs.ac.kr/~mathias/liste.htm</a>     
<p> <img src="../pic/schreiben.gif" alt="bild" width=720 height=564>
<p>
<i>-mn-/-sbh- </i>

<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="120.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="162.html">
</MAP>
</center><hr>
</body>
</html>
