<html>
<head>
<title>AMIGA Times 05/98 - Fun &amp; Talk</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><img src="../pic/talk.gif"><hr>
<b>Win98 -das Ende der Fahnenstange?</b> 
</center>
<p>
Oder geht's noch schlechter? Es ist schon unglaublich. Da bringen die
Faschisten aus Redmond die neueste Windowsversion mit integriertem 
Internet-Explorer raus, und verlangen als update von Win95 knappe 329
DM (Man &uuml;berlege mal, was man sonst so alles f&uuml;r 329DM bekommt!).<p> Was 
bekommt man daf&uuml;r? Weniger als gar nichts. Win98 hat mehr Bugs als sein
Vorg&auml;nger aufzuweisen. Viele Programme m&uuml;ssten neu installiert werden,
und wer einmal ein Windowsprogramm installiert hat, wei&szlig; das das eine
echte Strafe ist. Von der monopolistischen IE Integration m&ouml;chte ich
hier erst gar nicht schreiben. Da schreibt selbst Computer-Bild &quot;ob es
sich lohnt auf Win98 umzusteigen?&quot;. Nat&uuml;rlich nicht.<p> Aber es gibt viele
dumme Leute. Auf der anderen Seite bemerke ich aber immer h&auml;ufiger Computerlaien, die mehr oder weniger unzufrieden, mit der Situation sind.
Sie wissen dank der MS Propaganda nich genau was sie juckt, aber langsam merkt das Volk, das der F&uuml;hrer aus Redmond ein Betr&uuml;ger ist. Ich 
sehe das auch an meiner eigenen Computer-Situation: Mein A1200 ist schon
etwas alt und klapprig geworden, ich br&auml;uchte eigentlich mal was neues.<p>
Aber was? Jedes Angebot, da&szlig; es derzeit auf dem Markt gibt, erf&uuml;llt mir
nur ein Teil meiner W&uuml;nsche: Soll ich einen Apple kaufen? Sch&ouml;ne Maschienen 
bauen die ja, haben auch ein einigerma&szlig;en aktzeptables Betriebssystem, aber Spiele?! Dann doch lieber einen PC? HAHAHAHAHAHAHAAAAA! Ich
benutze so eine Kiste beruflich. Nein, danke! Eine Playstation w&auml;re nicht
schlecht, ist ja auch preiswert. Aber wo bleibt der Internet-Anschluss? <p>
Oder eine vern&uuml;nftige Textverarbeitung? Das sind genau die 4 Schl&uuml;sselpositionen,  
die ein &quot;Volkscomputer&quot; heutzutage besetzen mu&szlig;, um erfolgreich 
zu sein: Internet, Textverarbeitung, Spiele und preiswert. Welcher
aktuelle Computer hat das alles drauf? Keiner. Welcher k&ouml;nnte es locker
drauf haben?<p> Der neue Amiga! Selbst unsere aktuellen Maschienen schaffen
das beinahe (es hapert bischen beim Preiswert und bei den Spielen), aber
k&ouml;nnte es da nicht sein, das der neue Amiga zwangsl&auml;ufig zum Renner wird?<p>
Ganz einfach, weil er den Nagel auf den Kopf trifft? Gateway hat gesagt,
da&szlig; der neue Amiga preiswert wird. Gateway hat au&szlig;erdem gesagt, da&szlig; man
mit einigen Spieleherstellern im Gespr&auml;ch sei. Internet und Textverarbeitung versteht sich von selbst. Und dann werden, ich glaube fest daran, noch
einige spektakul&auml;re und wirklich neue Amiga-Produkte auf den Markt kommen!<p>
Ich denke der neue Amiga wird automatisch zum Erfolg! Was denkt ihr dazu?
Schreibt mir eure Meinungen zum Thema, an die Adresse:<p>
<a href="mailto:kuettner.world@t-online.de">kuettner.world@t-online.de</a><br>
Im Betreff &quot;Amiga Times Forum&quot;.
<p>
<i>-ck- </i>



<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="130.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="160.html">
</MAP>
</center><hr>
</body>
</html>
