<html>
<head>
<title>AMIGA Times 05/98 - Fun &amp; Talk</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><img src="../pic/talk.gif"><hr>
<b>Die Zukunft des Amiga</b>
</center>
<p>
<i>Themen: </i><br>
Vorwort<br>
Die Vergangenheit<br>
Die Gegenwart<br>
Die Zukunft<br>
Aufruf an alle Amiga-User und an alle Programmierer<br>
Impressum<br>
Liste der Empf&auml;nger
<p>

<b>Vorwort:</b><br>
Viel ist &uuml;ber die Zukunft des Amiga geschrieben oder gesagt worden. Alle
m&ouml;glichen Leute haben sich zu diesem Thema zu Wort gemeldet. Diese &Auml;u&szlig;erungen waren entweder eine Aufz&auml;hlungen technischer Einzelheiten, die der
n&auml;chster Amiga &quot;auf jeden Fall&quot; beinhalten sollte, bis hin zu Details und 
den Umfang der zuk&uuml;nftigen Workbench oder die ob nun dieser oder jener
Prozessor der bessere f&uuml;r den Amiga sei. Allerdings haben diese F&uuml;lle von
Nachrichten eher zur Verunsicherung als zu Klarheit gef&uuml;hrt. Auch sind
diese Darstellungen entweder nur sehr kurzfristig gedacht (nur eine Rechnergeneration), einseitig (aus Sicht eines Herstellers) oder verschwommen.
Ein klares und weit reichendes Konzept, welches sich sowohl mit der zuk&uuml;nftigen Hard- und Software, dem Marketing und den &Uuml;berlebensstrategien be-
sch&auml;ftigt, vermisse ich bisher. Diese Seiten sollen die m&ouml;gliche Zukunft
des Amiga aus meiner Sicht darstellen und dabei die Chancen, Tr&auml;ume und
M&ouml;glichkeiten f&uuml;r einen Amiga (-System) in der Zukunft ausloten.
<p>
<b>Die Vergangenheit:</b><br>
Um die m&ouml;gliche Zukunft des Amiga zu skizzieren, ist es notwendig in die
Vergangenheit zu schauen. Nur wer die St&auml;rken und die Schw&auml;chen des Amiga
kennt, kann f&uuml;r die Zukunft erfolgversprechende Pl&auml;ne entwerfen. Der Amiga
war und ist ein Nischenrechner. Ein Nischenrechner im Sinn wie es ein Mac
ist: stark und dominant in Sparten wie DTP, Grafik und Design, aber sonst
ist der Marktanteils eher gering. Genauso wie ein Mac (wahrscheinlich noch
mehr!), ist ein Amiga doch mehr als nur ein Computer; ein Amiga hat einfach
Feeling! Die Tatsache, das es den Amiga noch in der Form wie jetzt gibt, 
spricht B&auml;nde und ist ein Kompliment an alle Amiga-User, H&auml;ndler, Hersteller,
Programmierer, etc... Die Einsatzgebiete waren haupts&auml;chlich Grafik, Video
und Spiele. Dazu kommen in der Zukunft noch das Internet und generell die 
Vernetzung von Computern. Ein Amiga wird wohl nicht den Wintel-PC als &quot;Standard&quot; verdr&auml;ngen. Warum sollte er auch? Eine Besinnung auf die waren Ziele
des Amiga f&uuml;hrt zur Konzentration der Kr&auml;fte und zu besseren Erfolgsaussichten. Jeder Amiga-User kennt die Entstehung des Amiga und die darauf 
folgenden Jahre (f&uuml;r Einzelheiten siehe 1 , 2 oder 3). Ich m&ouml;chte mich hier
nicht &uuml;ber technische Details auslassen, sondern vielmehr aufzeigen was die
St&auml;rken des Amiga waren und wo die Schw&auml;chen liegen.
<p>
<b>Die St&auml;rken der Vergangenheit:</b>
<p>
<b>Grafik:</b><br>
Ein herausragender Vorteil eines Amiga war die unglaubliche Grafik- und 
Videof&auml;higkeit. Das Ball-Demo auf dem A 1000 bei der Erstvorstellung versetzte das Publikum in Erstaunen. Die Custom-Chips sind *die* St&auml;rke des 
Amigas gewesen. Zwar gab es mit den ECS- bzw. AGA-Chips Weiterentwicklungen,
doch inzwischen hat der Rest des Computermarktes die Amiga-Custom-Chips weit
&uuml;berholt. Leistungsstarke Grafikkarten, 3D-Beschleuniger und TV- und Videokarten lassen jeden Amiga alt aussehen. Der einzige Vorteil ist inzwischen
zum Nachteil geworden.
<p>
<b>Sound:</b><br>
Wie die Grafik - so waren auch die Soundf&auml;higkeiten des Amigas beeindruckend
und gingen weit &uuml;ber das markante &quot;Piepsen&quot; eines Standard-PC hinaus. Noch 
heute reichen diese 8-Bit aus, um eine gro&szlig;e Anzahl von Musikern dazu zu er-
muntern, Musik f&uuml;r den Amiga zu machen (siehe im Aminet). Aber auch hier ist
die Entwicklung weit voran geschritten, soda&szlig; Nachholbedarf besteht.
<p>
<b>AmigaOS:</b><br>
Blickt man mal &uuml;ber den Tellerrand hinaus, sieht man, das vielen Betriebssystemen das Multitasking JETZT beigebracht wird (Mac OS X, Windows NT 5).
Mit einem L&auml;cheln denkt man an die preemptiven Multitaskingf&auml;higkeiten des
Amiga, die schon seit &uuml;ber 10 Jahren bestehen. Ein guter Vorteil f&uuml;r die 
Zukunft, auf dem sich aufbauen l&auml;&szlig;t. Aber es gibt immer was zu verbessern:
Multiprozessorf&auml;higkeit, Multitheardf&auml;hig, Speicherschutz, ... (siehe Linux)
Nicht nur Anpassung an den jetzigen Standard, sondern auch Impulse f&uuml;r die
Zukunft m&uuml;ssen gesetzt werden. Das AmigaOS und die Workbench sind f&uuml;r mich
einfach ... genial! Kein Betriebssystem, was ich kenne (MacOS, Windows 9x /
NT, Linux, OS2), l&auml;&szlig;t sich so einfach bedienen, ist so klein und schnell 
(Datatypes, Katalog-Dateien, AmigaGuide-Hilfen, DosDrivers, Installer ....).
<p>
<b>Erweiterbarkeit:</b><br>
Der Amiga ist (zum Teil) mit Zorro-Slots ausger&uuml;stet. So konnte man nach und
nach den Rechner mit zus&auml;tzlicher Hardware aufr&uuml;sten (Grafik-, Sound-, Sch-
nittstellen-, Emulations- und sonstige Karten). Und das Beste daran war und
ist, da&szlig; durch echtes Plug &amp; Play (Autokonfig) die Hardware sofort startklar
war. Das gleiche gilt f&uuml;r den Prozessorslot des Amiga 3000/4000 bzw. 1200.
<p>
<b>Prozessor:</b><br>
Die 68k-Familie des Amiga war leistungsf&auml;hig und flexibel. Im Zusammenspiel
mit den Custom-Chips leistete und leistet heute noch ein Amiga erstaunliche
Dinge. Ein weiterer Vorteil war die Verwendung nicht nur in Amigas, sondern
auch in Macs und Ataris, dadurch waren zum Beispiel Emulationen leicht und
schnell realisierbar.
<p>
<b>Die User:</b><br>
Die engagierten und interessierten Amiga User, Programmierer und Dritther
steller von Amiga Produkten sind die eigentliche St&auml;rke des Amiga. Sie machen
das Feeling des Amigas aus, sie hauchen einer seelenlosen Maschine Geist ein
und sind der Grund, warum der Amiga noch lebt. Darin liegt ein m&auml;chtiges Potential f&uuml;r die Zukunft! Und das alles trotz der vielen Pleiten, die sich der
eigentliche Hersteller des Amigas leistete bzw. sp&auml;ter selbst erlebte. Konkrete Zusammenarbeit von Amiga Int., Drittherstellern und Usern kann dazu 
f&uuml;hren, das ein Amiga System der Zukunft entsteht, welches von den Usern auch
gewollt ist (und nicht diesen wie bei Wintel-Systemen &quot;aufgezwungen&quot; wird).
<p>
<b>Internet &amp; CD-Rom:</b><br>
Weiterhin gibt es noch zwei weitere Gr&uuml;nde, warum der Amiga noch lebt: 
Erstens das Internet und zweitens die CD-Rom. Das Internet macht die Welt
zum globalen Dorf. Besonders f&uuml;r den Amiga-User hei&szlig;t das, da&szlig; er z.B.:
Dank Miami einen leichten und schnellen Zugang zu Software (das Aminet 
ist das gr&ouml;&szlig;te Softwarearchiv im Internet!), zu anderen Amiga-Usern und
zu Amiga-H&auml;ndlern, Programmierern, etc.. hat. Schneller und kosteng&uuml;nstiger
Support und Updateservice sind so m&ouml;glich. Die CD-Rom hat wiederum es dem
Amiga-User erm&ouml;glicht kosteng&uuml;nstig an Software (Aminet-CDs, Meeting Pearls,
etc.) zu kommen. CDs sind in der Produktion billig und dr&uuml;cken so die Herstellungskosten. 
Auch sind bei Programmen wie Textverarbeitungen, Tabellenkalkulationen oder Spielen das Platzproblem von Disketten irrelevant.
<p>
<b>Die Schw&auml;chen der Vergangenheit:</b><br>
Doch wo Licht ist, ist auch viel Schatten: Die Tastaturgeh&auml;use meines Amiga
500 bzw. sp&auml;ter meines Amiga 1200 stellten mich vor etliche Schwierigkeiten
(wie z.B.: das zu schwache Netzteil, das fehlende HD-Diskettenlaufwerk oder
die fehlende M&ouml;glichkeit den Rechner mit Zorro-Karten zu erweitern). Die 
fehlende Weiterentwicklung der Hard- und Software zeigte sehr deutlich, wie
schnell ein Rechner veraltet sein kann. Doch findige Hardware- (gerade f&uuml;r 
den A 1200: Turbokarten, SCSI-Controller, Scandoubler, Schnittstellenkarte)
und Softwarehersteller (MagicWB, Newicons, Datatypes, Miami, DOpus, PPaint)
glichen die eine oder andere Schw&auml;che des Amiga aus. Was mich pers&ouml;nlich 
ziemlich auf die Palme brachte, war die Selbstherrlichkeit von Commodore.
Dritthersteller, Medien und Usern hatten es nie leicht und leider kam auch
keine enge Zusammenarbeit zustande. Auf Messen hatte man das Gef&uuml;hl, nur 
geduldet zu sein. Und dann das caotische bzw. nicht vorhandene Marketing!
Das CDTV war nicht umsonst ein Flop. Statt mit den Herstellern von Hard- 
und Software zusammen zu arbeiten, wurde mit Informationen geknausert. Doch
war sicherlich die gr&ouml;&szlig;te Fehlentscheidung, da&szlig; der Amiga-Zweiges vom Mutterunternehmen nicht ausgelagert wurde, um so den Amiga vor dem drohenden
Konkurs des PC-Zweiges zu retten! Dann kamen, die fast schon peinlichen
Jahre des Hin- und Her des Amiga vom Konkursverwalter zu Escom, zu VisCorp
und dann endlich zu Gateway. Der markanteste Schwachpunkt des Amiga ist die
fehlende Weiterentwicklung der Hard- und Software. Amiga International mu&szlig;
jetzt Ergebnisse oder zumindestes konkrete Pl&auml;ne zum schnellen Vorankommen
offenlegen. Nicht nur um den Markt und die Amiga-User zu beruhigen, sondern
auch um Hersteller Planungssicherheit zu geben. In der Computerbranche ist
viel mit Psychologie zu erreichen, aber auch bei mangelndem Informationsflu&szlig;
ist schnell das gro&szlig;e Fracksausen da. Die vordringlichsten Ziele sind demnach eine offene Informationspolitik von Amiga Int. gegen&uuml;ber Usern und 
Drittherstellern. Das k&ouml;nnte z.B.: durch ein verbessertes Internetangebot
hergestellt werden (Maillinglisten bez&uuml;glich Fragen zu Hard- und Software,
regelm&auml;&szlig;ige Newsletter per Email, Konzeptdarstellung auf den Internetseiten,
etc. ). Eine Enge Zusammenarbeit und Kooperation zwischen Amiga Int., Drittherstellern und Usern kann dazu f&uuml;hren, das es Amigas mit entsprechender 
Software gibt, die auch so gewollt wird. Um es auf den Punkt zu bringen:<br>
Wir haben alle das gleiche Ziel!
<p>
<b>Die Gegenwart:</b><br>
Der Amiga Markt hat seine Schrumpfgrenze erreicht. Weiter bergab darf es 
nicht mehr gehen, da sonst die Grundsubstanz der Amiga Szene aufgefressen
wird und der Absturz in die (kommerzielle) Bedeutungslosigkeit droht. Sicher
haben auch Betriebssystem wie Linux ohne kommerziellen Hintergrund Erfolg.
Doch w&auml;re dies der Anfang vom Ende f&uuml;r den Amiga. Viele Firmen und Entwickler
haben sich aus den unterschiedlichsten Gr&uuml;nden vom Amiga schon getrennt. Zuletzt 
hatte Maxon bekannt gegeben, da&szlig; das Flagschiff &quot;Maxon Cinema 4D&quot; nicht
mehr f&uuml;r den Amiga weiterentwickelt wird. Dies ist besonders schmerzlich, da
&quot;Maxon Cinema 4D&quot; ein Referenzprogramm auf dem Gebiet der 3D-Einzel- bzw. 
Bewegtbildentwicklung ist (war). Was aus einem Programm wie &quot;Maxon Cinema 4D&quot;
auf Basis eines PPC h&auml;tte werden k&ouml;nnen, sieht man auf dem Mac, wo das 
Schwesterprogramm den Markt der 3D-Programme erfolgreich aufgerollt hat. Hier
liegt es laut Aussage von Maxon (auch) an der mangenlden Informationspolitik
und der fehlenden Unterst&uuml;tzung der Programmierer durch Amiga Int.. 
Wenn man sich die Software incl. der Spiele ansieht, die jetzt auf den Amiga
Markt kommen, erkennt man, da&szlig; diese Produkte ein Mindestma&szlig; an Hardware 
(MC 68030/50Mhz, 8 MB Fast Ram, Festplatte, AGA) voraussetzen. Um in den 
vollen Genu&szlig; aller M&ouml;glichkeiten oder um angenehm arbeiten zu k&ouml;nnen bedarf
es schon etwas mehr (MC 68040/25 Mhz, 16 MB Fast Ram, gro&szlig;e Festplatte,
Grafikkarte). Viele User haben (wie ich auch) ihren Amiga mit Turbokarten,
Speicher, Grafikkarten, Festplatten, etc. ...) aufger&uuml;stet. Doch ist jetzt
das Ende der Fahnenstange erreicht! Es verkauft sich kein Spiel mehr, wenn
es (um es gut spielen zu k&ouml;nnen) einen MC 68040/40 Mhz oder MC 68060/50 Mhz
voraussetzt. Die technische Grenze der Amiga-Hardware ist erreicht. Der User
(so auch ich) ist jetzt (sprich 1998/1999) an den Scheidepunkt gekommen.
R&uuml;stet er seinen Amiga mit noch teurer und seltener Hardware (Beispiel:
Die Cyberstrom MKIII mit 060 und SCSI kostet schlappe 1.200,00 DM. Also fast
soviel wie eine CyberstromPPC.) auf oder steigt er um ...(z.B.: IMac inkl.
MacOS 8.x). Neben der Hardware gilt im Prinzip das gleiche Problem f&uuml;r die 
Software. Das AmigaOS 3.x (welches inzwischen wohl zum Standard geworden 
ist) ist eine feine Sache, aber nicht mehr ganz Zeitgem&auml;&szlig;.
<p>
<b>Die Zukunft:</b><br>
Wenn der Amiga in der Zukunft eine Rolle spielen soll, so mu&szlig; sich einiges
&auml;ndern. Vorallem die Hardware hinkt den jetzigen Anforderungen an einen 
modernen Computer weit hinterher. Aber auch die Software ist verbesserungs-
w&uuml;rdig.
<p>
<b>Die Hardware:</b><br>
Hier ist die Anpassung und Nutzung von Wintel-PCI-Hardware (die ja durch die
massenweise Verbreitung der Wintel-PCs zum Standard geworden ist) der einzig
sinnvolle Weg. Der PCI-Bus ist leistungsf&auml;hig und weit verbreitet (neben 
Wintel-PCs auch in Macs). Systembedingte Ber&uuml;hrungs&auml;ngste kann sich ein Amiga
der Zukunft nicht mehr leisten und sind, unter uns gesagt, auch Unsinn. Keine
teuren Eigenentwicklungen (wie z.B.: das von einigen Usern geforderte SuperAGA oder AAA), 
sondern Nutzung von schon vorhandener Hardware wie PCI-Grafikkarten, 
PCI-3D-Beschleuniger und PCI-TV- und -Videokarten. Der Abschied von
den gewohnten Amiga Customchips f&auml;llt sicher schwer, ist aber notwendig und
auch sinnvoll. Ist die alte Grafikkarte zu langsam geworden, wechselt man 
diese mit einem neueren Modell aus. Sicher, entsprechende Treiber m&uuml;&szlig;ten f&uuml;r
den Amiga geschrieben werden. Doch darf man die vielen Free- und Sharewareprogrammierern 
nicht vergessen, die mit gro&szlig;artiger Produktivit&auml;t schon so
manches geniales Programm erstellt haben (z.B.: Miami, AHI, MUI, P96, CyberGrafix). 
Sieht man sich den Mac-Markt an, bemerkt man, das PCI-Hardware aus
dem PC-Markt in diesen Rechnern direkt oder als angepa&szlig;te Version Verwendung
findet. Das ist der Weg, den der Amiga gehen mu&szlig;, um auch eine preislich 
Alternative bei guter Leistung zu sein.<br>
Zusammenfassend kann man sagen, das die Nutzung von Standard-PCI-Hardware 
preislich g&uuml;nstig ist und nebenbei einem die Qual der Wahl zwischen preiswerten low-end und leistungsstarken high-end Produkten l&auml;&szlig;t. Der Amiga mu&szlig;
jeden Synergieeffekt nutzen, den er bekommen kann, ohne seine Einzigartigkeit zu verlieren. Dabei darf man nicht die St&auml;rken des Amiga vergessen und
mu&szlig; entsprechend die Hardware danach ausw&auml;hlen. Die reinen grafischen F&auml;higkeiten leisten heute schon die Standard-PCI-Grafikkarte, f&uuml;r den coolen 
Spielgenu&szlig; sorgt ein 3D-Beschleuniger und f&uuml;r den Sound eine Standard-PCI-
Soundkarte. Ein Problem ergibt sich nat&uuml;rlich: Bleibt die Videof&auml;higkeit des
Amiga dabei nicht auf der Strecke? Ich meine nein. So gibt es f&uuml;r mich zwei
M&ouml;glichkeiten zur L&ouml;sung. Erstens man verwendet weiterhin die AGA-Chips und
einen RGB-Port (w&auml;re auch positiv bez&uuml;glich der Kompatiblit&auml;t) oder zweitens
man verwendet eine Grafikkarte mit Videoausgang (PicassoIV mit Pablo). Die
Gretchenfrage ist sicherlich, welches Herz in zuk&uuml;nftigen Amigas schlagen
soll. Betrachtet man die auf dem Markt vorhandenen Prozessortypen (Intel &amp;
kompatible, PPC, Alpha, etc...), so teilt sich der Markt vorwiegend in Intel
&amp; kompatible und PPC auf. Sicher gibt es noch andere Proessoren, aber zur 
Zeit sind diese beiden Gruppen dominant. Intel &amp; kompatible scheiden f&uuml;r mich
von Angang an aus. Nicht nur aus meiner leidenschaftlichen Abneigung gegen
Intel &amp; Co., sondern auch aus einer realistischen Sichtweise. Intel-Prozessoren sind teurer und leistungs&auml;rmer als PPC-Prozessoren. Wer sich davon 
&uuml;berzeugen will, sollte mal auf der Page von Apple ein wenig st&ouml;beren. Es
kann nur einen geben: PPC! Warum? Der erste Grund ist sicherlich die Leistungsf&auml;higkeit. Ein PPC 604e/200 Mhz hat etwa 350 Mips. Zum Vergleich, meine
Cyberstrom MK II 040/40Mhz bringt etwa 30 Mips auf die Wagschale. Die Weiterentwicklung der PPC 603 von Motorola, der G3 (PPC750) schlagt schon heute
einen Pentium II 300 Mhz durch seine Rechenleistung. Was der G4 (soll im 
Fr&uuml;hjahr von Motorolla auf dem Markt gebracht werden) f&uuml;r Leistungsmerkmale 
hat, davon wage ich nicht zu tr&auml;umen. Selbst ein PPC 603/200 Mhz bringt 
schon eine Wahnsinnsleistung und dennoch ist der Prozessor g&uuml;nstig. Doch 
zur&uuml;ck zum Amiga. Ein G3 macht dem Mac OS 8.x kr&auml;ftig Beine. Wenn man dabei
noch bedenkt, da&szlig; das AmigaOS schlanker und schneller ist, wird klar, was
f&uuml;r Leistungen erreicht werden k&ouml;nnen. Weiterhin ist nicht die enorme Pionierarbeit auf dem Gebiet der PPC-Karten zu vergessen (Phase5, Haage&amp;Part-
ner). Auch sind inzwischen eine ganze Reihe von PPC angepa&szlig;ten Versionen 
beliebter Software entweder im Aminet oder als kommerzielle Produkte erschienen (siehe Liste). Weiterhin kann man auf den Seiten von Haage&amp;Partner
nachlesen, das ein 68k-Emulator f&uuml;r den PPC entwickelt wurde. Hier ergibt 
sich ein K&ouml;nigsweg f&uuml;r den &Uuml;bergang von 68k-Amigas zu reinen PPC-Amigas mit
Zwischenstation &uuml;ber entweder einer PPC-Karte inkl. 68k-Prozessor oder einen
&quot;neuen&quot; Amiga mit PPC &amp; 68k-Prozessor. Schon vorhandene Software und das
AmigaOS kann per Update nach und nach von 68k auf PPC umgestellt werden 
ohne das es einen gro&szlig;en Schnitt gibt. Dieser w&uuml;rde den Usern viel Geld 
kosten durch sofortige Neuanschaffung eines kompletten Rechners und der Neuanschaffung von angepa&szlig;ter Software. Ein wesentlicher Grund ist auch, das
auf PPC-Basis auch Betriebssysteme wie MacOS, Linux und BeOS laufen. Denkt
man logisch weiter, hei&szlig;t das auch, da&szlig; auf diesen Mac-, Linux- oder Be-
Rechnern auch das AmigaOS laufen k&ouml;nnte! Ein nicht zu untersch&auml;tzender Vorteil. User, die diese drei Betriebssysteme nutzen, k&ouml;nnen leicht und ohne
gro&szlig;e Kosten auf das AmigaOS umsteigen oder mehrere Betriebssystem gleichzeitig nutzen. 
Das wiederum hat die Vorteile, da&szlig; das AmigaOS eine weite Verbreitung findet und damit Marktanteile erobert und das Amiga Int. das AmigaOS
verkaufen kann. Apple hat mit dem Mac OS 8 einen echten Verkaufshit gelandet
und die Erl&ouml;se daraus tragen auch dazu bei, das Apple jetzt wieder Gewinne 
erzielt. Voraussetzung ist daf&uuml;r nat&uuml;rlich, das der Amiga ein PCI-Bussystem
erh&auml;lt und Standard-Hardware wie Grafik- und Soundkarten benutzt. Doch das
ist absolute Zukunftsmusik, den ein Amiga braucht (noch!) ein Kickstart-Rom,
von dem aus es booten kann. Sollte das AmigaOS einmal die CHPR-Norm erf&uuml;llen,
st&auml;nden die Chancen daf&uuml;r besser. Verfolgt man diesen Gedanken dann bez&uuml;glich
der Software weiter, ist es doch durch die wesentliche Hardwaregleichheit 
zwischen MacOS, BeOS, Linux- und AmigaOS-Rechnern einfacher, Software f&uuml;r den
Amiga zu schreiben. Entweder, man bringt ein Programm z.B.: f&uuml;r das MacOS und
das AmigaOS heraus und hat dadurch gr&ouml;&szlig;ere Marktchancen oder man pa&szlig;t vorhandene Mac-, Linux- oder BeOS-Software &quot;relativ&quot; leicht f&uuml;r den Amiga an. Ein 
gutes Beispiel daf&uuml;r sind Spiele. Im MagMagazin 8/98 wird im Artikel &quot;The 
Making of Myth - THE FALLEN LORDS&quot; berichtet, da&szlig; das Programmierteam 90% des
Quellcodes palttformunabh&auml;nig (f&uuml;r Mac bzw. Wintel-PC) programmieren konnte
und nur 10% Betriebssystemspezifisch zu schreiben waren. Bedenkt man noch, 
das dann die gleichen Grafik- und Soundkarten verwendet werden, nutzt man so
die weite Verbreitung von PC-Hardware und PC-Software direkt bzw. indirekt 
aus, ohne sich mit Windows 9x abgeben zu m&uuml;ssen. Aber nicht nur Spiele sind
interessant, auch Anwenderprogramme wie die Browser von Netscape, Photoshop,
etc... Vielleicht gibt es dann ja Programme wie den Acrobat Reader auch f&uuml;r
das AmigaOS.... Zu guter Letzt darf man nicht vergessen, da&szlig; der Amiga schon
immer gut im emulieren war. F&uuml;r mich war und ist Shapeshifter eines der genialsten Amiga-Programme. War es doch dadurch m&ouml;glich, f&uuml;r 50 DM einen Mac
zu emulieren. Hat der Amiga nun einen PPC, kann er ohne gro&szlig;e Leistungseinbu&szlig;en einen PPC-Mac emulieren. Da der gleiche Prozessor und mitunter die 
gleiche Grafikhardware benutzt wird, d&uuml;rfte die Emulation einfach und schnell
sein. Und f&uuml;r alle, die es unbedingt wollen, lie&szlig;en sich Programme wie VirtuellPC oder Softwindows9x aus dem Mac Bereich relativ leicht an das AmigaOS
anpassen.
<p>
<b>Die Software:</b><br>
Das AmigaOS der Zukunft sollte ein transparentes Betriebssystem sein, das in
den wesentlichen Hardwarekontakten (Grafik, Sound, I/O, PCI-Bus, etc. ...)
relativ harewareunabh&auml;nig ist (hardware abstrakt layer). Ans&auml;tze daf&uuml;r sind
bereits vorhanden (CyberGFX, AHI). Das AmigaOS, welches portable, modular
erweiterbar ist und dazu noch offene Standards im Hard- und Softwarebereich
unterst&uuml;tzt, ist f&uuml;r die Zukunft gewappnet. Daneben sind nat&uuml;rlich noch 
Leistungsmerkmale wie Multithierdf&auml;hig, Multiporzessorf&auml;hig, Speicherschutz,
Java, Internetintegration, etc. n&ouml;tig und geboten. Bis dahin ist noch ein 
weiter Weg. Aus gehend vom jetzigen AmigaOS w&auml;re der erste Schritt, das System auf einen PPC lauff&auml;hig zu bekommen. Entweder durch Dualprozessorkarten
(wie die von Phase5) oder durch Softwareemulation des 68k-Prozessors (siehe
Haage&amp;Partner). Dabei sollte das OS schon den PPC erkennen und zumindestes 
teilweise nutzen k&ouml;nnen. Das k&ouml;nnte das Version 3.5 enthalten. Der n&auml;chste
Schritt w&auml;re die Lauff&auml;higkeit sowohl auf Dualprozessorkarten als auch auf
reinen (Amiga-) PPC-Rechnern. Noch ist das OS zwar nicht v&ouml;llig PPC-nativ, 
aber die 68k-Teile werden durch Softwareemulation aufgefangen. Das w&auml;re Version 4.x. Das Ziel ist das Version 5.x, welches zu 100% PPC-nativ ist und 
soweit hardware abstrakt ist, das es auch auf anderen PPC-Rechnern (also
nicht nur PPC-Amigas, sondern auch PPC-Macs, etc.) l&auml;uft. Ein weiteres Feature
des PPC ist die Tatsache, das der Prozessor auf einer Prozessorkarte (&auml;hnlich
wie man das schon vom Amiga kennt) sitzt. Durch den Austausch des alten gegen
einen schnelleren Prozessor bleibt die Upgradef&auml;higkeit erhalten. Auch bietet
sich die M&ouml;glichkeit der Multiprozessorkarte f&uuml;r rechenintensive Aufgaben wie
3D-Berechung oder Videoeffekte gerade zu an.
<p>
<b>Die Zusammenfassung:</b><br>
Hier eine Zusammenfassung der technischen Daten eines Amiga-Systems der
Zukunft. Zwei verschiedene Grundmodelle reichen eigentlich aus: ein Amiga
f&uuml;r den Low-End-Bereich und ein Amiga f&uuml;r den High-End-Bereich:
Amiga TNG PPC
<table border=1>
<tr><td>Spezifikation</td><td> Low-End-Bereich</td><td> High-End-Bereich</td></tr>

<tr><td>Geh&auml;use</td><td> Destop</td><td> Tower</td></tr>

<tr><td>Prozessor</td><td> PPC 603 / 200 oder G3</td><td> PPC 604 / 200 oder G4</td></tr>

<tr><td>Cache</td><td> 512 kbyte</td><td> 1024 kbyte</td></tr>

<tr><td>Arbeits-Speicher</td><td> 32 MB SD-Ram</td><td> 64 MB SD-Ram</td></tr>

<tr><td>Anzahlt PCI-Steckpl&auml;tze</td><td> mind. 3</td><td> mind. 6</td></tr>

<tr><td>Grafikkarte</td><td> 4 MB</td><td> 8 MB</td></tr>

<tr><td>Medienanschlu&szlig;</td><td> ATA</td><td> SCSI</td></tr>

<tr><td>Massenspeicher</td><td> 20 x CD-Rom und 1 GB Festplatte</td><td> DVD Rom und 3 GB Festplatte</td></tr>

<tr><td>Sonstiges</td><td> USB</td><td> USB</td></tr></table>
Software
<p>
AmigaOS; Best of Shareware CD; Textverarbeit., Tabellenkalk., Datenbank;
Internetsoftware; Grafikprog. wie Low-End-Bereich, zus&auml;tzlich 3D-Prog., 
DTP-Programm; BeOS, Linux
<p>
<b>Anmerkung:</b><br>
Die Werte sind nur zur Orientierung gedacht und keine genauen Einzelheiten.
Wichtig ist auf jeden Fall die Software: die Shareware-CD kann man leicht 
bis zum Rand f&uuml;llen. Die anderen Programme m&uuml;ssen ja nicht die neusten 
Versionen sein, sondern k&ouml;nnen z.B.: Sondereditionen oder &auml;ltere Versionen
sein.
<p>
<b>Der Aufruf:</b><br>
Ich rufe alle Amiga-User, Programmierer, Hersteller, Vertreiber, Entwickler,
etc. ... auf, an diesem Rechner fest zuhalten. Der Amiga hat eine bewegte 
Vergangenheit hinter sich und wird, davon bin ich &uuml;berzeugt, eine bewegte 
Zukunft noch vor sich haben. Aber ohne Einfallsreichtum, Initiativen, Kreativit&auml;t, Ausdauer und Hartn&auml;ckigkeit wird es keine neue Soft- bzw. Hardware
geben. Da ich selber kein Programmierer bin, kann ich zwar selbst keine neue
Software erstellen, aber ich sorge durch den Kauf von (Original-!!!) Software daf&uuml;r, da&szlig; Programmierer weiter f&uuml;r den Amiga arbeiten. Weiterhin sehe
ich diese Zeilen nicht als die Weisheit letzter Schlu&szlig; an, sondern auch als
Aufruf und als Ermunterung f&uuml;r alle anderen User, Hersteller, Programmierer,
etc.. Wo sind die Experten, die Programmierer, die Kreativen, die Leute die
Einf&auml;lle und L&ouml;sungen rund um den Amiga haben? Wie soll denn die WB 4.x / 5.x aus
sehen??? Her mit euren Meinungen, W&uuml;nschen, Vorschl&auml;gen, Kritiken, Anmerk-
ungen, etc. (Email: b.sommer @in-brb.de) . Diese Zeilen von mir sollen den
Grundstein legen und nach und nach zu einem klaren, detailreichen Zukunftsplan werden. Alle Zuschriften werde ich in diesen Text mit einflie&szlig;en lassen
und regelm&auml;&szlig;ig wird ein Update im Aminet dann ver&ouml;ffentlicht. Jeder kann 
seinen Anteil zur Zukunft des Amiga beitragen. Speziell f&uuml;r die Programmierer
habe ich mir folgenden bekannten Slogan &quot;ausgedacht&quot; (sprich abgewandelt&quot;):
Ihr Programmierer der Welt, schaut auf diesen Rechner!
Zugegeben, etwas pathetisch, aber ich fand ihn sehr treffend und Ernst 
Reuter wird es mir wohl verzeihen.
<p>
<b>Das Impressum:</b><br>
Warum schreibt jemand solch einen Text und nervt damit andere per Email?
Der Grund ist einfach der, das ich meinen Amiga 3000 sehr sch&auml;tze und ihn
f&uuml;r den besten Amiga halte, der je gebaut worden ist. Aber ich merke jeden
Tag, das er schon einige Jahre auf dem Buckel (&auml;h, Prozessor) hat. Egoistisch wie ich nun mal bin, m&ouml;chte ich nun wieder so einen Amiga haben, der
den Rest der Computerwelt einfach in die Tasche steckt. Ich habe einfach 
keine Lust mehr, nur die News und Statements anderer Leute im Internet zu
lesen und will damit nun selbst die Initiative ergreifen. Ich finde, selbst
die Initiative zu ergreifen ist tausendmal besser, als nur abzuwarten, wie 
sich die n&auml;here Zukunft des Amiga entwickelt.
<p>
Wie alles begann...<br>
Mein erster Amiga war ein nackter Amiga 500 mit einem Commodore 1084s - 
Monitor, das war 1992. F&uuml;r den ersten Kontakt mit einem Computer hatte ich
sehr schnell ein erstes Erfolgserlebnis, der gelungene Start der Workbench.
Ich war begeistert von den Disk-Icons und den Menus (obwohl die WB 1.3 nun
wirklich nicht gerade bunt war) und mu&szlig;te alles ausprobieren. Und alles gelang mir ohne fremde Hilfe (nur die Handb&uuml;cher halfen) sofort, Disketten 
formatieren, Programme starten, Texte schreiben, spielen... . Spricht f&uuml;r
den Amiga, oder? Jedenfalls war ich infiziert. Das n&auml;chste, was an Hardware
hermu&szlig;te, war eine Speichererweiterung (512 kbyte + Uhr!) und ein zweites
Disk-Laufwerk. Geniale Programme wie DPaint oder Beckertext, aber auch Spiele
wie Civilzation, Xenon2 oder Alienbreed machten mich zu einem gl&uuml;cklichen
Amiga - User. Der n&auml;chste logische Schritt war der Kauf eines Amiga 1200 mit
WB 3.0 (1994). Was f&uuml;r ein Quantensprung: Lokalisierte Programme, Multiview
+ Datatypes, AGA, etc.... Aufr&uuml;stungen mit einer 80 Mbyte - AT - Festplatte
und einer Blizzard 1230 Turbokarte folgten. Dann Umstieg auf Blizzard 1230IV
inkl. SCSI Controller, SCSI-Festplatte und CD-Rom machten den kleinen Amiga
zum echten Boilden. Schlie&szlig;lich mu&szlig;te dann ein Tower her, denn der Platz und
der Strom reichten nicht mehr aus. Programme wie Wordworth 5, Miami, DOpus5
und Spiele wie Dune 2, History Line und Erben der Erde sind wie Musik in 
meinen Ohren. Doch das war immer noch nicht genug, es war Zeit f&uuml;r eine 
Grafikkarte. Ich kaufte g&uuml;nstig einen Amiga 3000 mit Picasso II, Cyberstrom
040/40 Mhz und MFC III an. Zwar hat der Rechner kein AGA, wodurch ich auf 
einige Spiele verzichten mu&szlig;te, aber die meisten Programme und auch die 
neueren Spiele (Myst, Genetic Species, etc.) laufen ja auch auf Grafikkarte.
Au&szlig;erdem hat ein A 3000 den SCSI-Controller, den Scandoubler und den Flicker-
fixer schon onboard. F&uuml;r die Zukunft hatte ich den Umstieg auf einen neuen
Amiga geplant. Ein Amiga mit Amiga OS 4 oder 5, einem PowerPC, PCI - Bus,
etc, etc.. Was daraus wird, zeigt die Zukunft.
<p>
Hier nun die rein technischen Daten.<br>
Diese Worte wurden mit folgender Hard-und Software erstellt:<br>
Amiga 3000 mit Cyberstorm 040/40 Mhz und 48 MB Fast Ram (Dank an Phase 5)<br>
Picasso II Grafikkarte (Dank an Vilage Tronic)<br>
MFC Schnittstellenkarte<br>
diverser SCSI-Hardware<br>
AmigaOS 3.1 (Dank an Amiga Inc.)<br>
GoldED inkl. WWW-Erweiterung (Dank an Dietmar Eilert)<br>
IBrowse (Dank an omnipresence)<br>
Miami (Dank an Holger Kruse)<br>
MUI (Dank an Stefan Stuntz)<br>
Betatest mit IBrowse 1.22, Voyager 2.95, AWeb 3.1 und Netscape 3 (MAC)<br>
<p>
<i>-bert sommer- </i>

<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="123.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="126.html">
</MAP>
</center><hr>

</body>
</html>
