<html>
<head>
<title>AMIGA Times 05/98 - Software</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
<center><img src="../pic/softw.gif"><hr><img src="../pic/pfs2.gif"></center><p>
<b>Entstehungsgeschichte von PFS2</b>

<p>
Das normale Dateisystem des Amiga (OFS) ist alles andere als schnell.
Commodore hat mehrfach versucht das alte Dateisystem zu verbessern. Mit
Workbench 2.0 kam das Fast File System (FFS) hinzu und Workbench 3.x
brachte schlie&szlig;lich das Fast File System mit Verzeichnis-Pufferung (FFS-DC).
Hierbei wird das Durchsuchen von Verzeichnissen erheblich beschleunigt, doch
sind das Schreiben und Verzeichnisoperationen (L&ouml;schen, Umbenennen usw.)
sogar langsamer als je zuvor.
<p>
Aus diesen Gr&uuml;nden begann Michiel Pelt im Sommer 1993 ein v&ouml;llig
neues Dateisystem f&uuml;r den Amiga zu entwickeln. Ende 1993 wurde das erste
Professional File System als Shareware auf dem Aminet ver&ouml;ffentlicht. Mit
Hilfe der bei dieser Version erworbenen Erfahrung wurde dann ein v&ouml;llig
neues Filesystem entwickelt und von Fourth Level Development im Jahre 1995
ver&ouml;ffentlicht. Sie nannten es Ami-FileSafe (AFS) und es war bis Ende 1996
ein erfolgreiches Produkt.
<p>
Seit April 1998 liegt das Urheberrecht wieder bei Michiel Pelt, dem Autor der
Software, und seiner eigenen Firma Great Effects Development. Dieses ist
nun die erste Ver&ouml;ffentlichung des neuen Professional File System 2 (PFS2).
<p>

<b>Leistungsmerkmale</b>

<p>
PFS2 bietet viele Vorteile gegen&uuml;ber dem Standard Filesystem FFS.
Die herausragendsten Eigenschaften sind:
<p>
<b>Hohe Leistung</b>
<p>
PFS2 wurde entwickelt und hoch optimiert um maximale Leistung f&uuml;r alle Disk
Operationen zur Verf&uuml;gung zu stellen. Die signifikantesten Verbesserungen
gegen&uuml;ber FFS werden beim Lesen und Schreiben von Dateien sowie beim
Durchsuchen von Verzeichnissen erzielt, je nach eingesetztem Laufwerk,
der Anzahl von Puffern und dem verwendeten Prozessor sind Steigerungen
von &uuml;ber 500% keine Seltenheit.
<p>
<b>Disks sind immer g&uuml;ltig</b>
<p>
Ein PFS2 Laufwerk ist immer g&uuml;ltig (validiert), egal was auch geschieht.
Ein Programm st&uuml;rzt ab, der Strom f&auml;llt aus usw., PFS2 wird trotzdem
neu starten als sei nichts geschehen. Detailierte informationen &uuml;ber
diesen Atomic Commit genannten Mechanismus finden Sie bei Bedarf unter
PFS2 Atomic Commit.
<p>
<b>Zuverl&auml;ssigkeit</b>
<p>
PFS2 wurde sorgf&auml;ltig getestet und ist ein extrem zuverl&auml;ssiges und
stabiles Filesystem. Aber das war uns noch nicht genug: PFS2 hat einen
eingebauten Mechanismus um Probleme fr&uuml;hzeitig zu erkennen und zu
beheben. Wenn PFS2 ein Problem erkennt wird es alles tun um Ihre Daten
zu retten. 
<p>
<b>Paralleler Zugriff ohne Leistungsverlust</b>
<p>
FFS bricht zusammen wenn mehrere Zugriffe auf einem Laufwerk stattfinden.
Mit PFS2 werden Sie keinerlei Leistungseinbr&uuml;che feststellen.
<p>
<b>Volle AmigaDos Kompatibilit&auml;t</b>
<p>
<b>Einfaches Retten von Dateien</b>
<p>
Versehentlich gel&ouml;schte oder &uuml;berschriebene Dateien k&ouml;nnen einfach aus dem 
Delete Directory wiedergewonnen werden.
<p>

<b>Compatibilit&auml;t mit Ami-FileSafe</b>
<p>
PFS2 ist voll kompatibel zu Ami-FileSafe, d.h. PFS2 kann Ami-FileSafe
Volumes behandeln als seien es PFS2 Volumes und sogar umgekehrt.
<p>
<b>Automatisches Begrenzen von Logfiles</b>
<p>
PFS2 kann Logfiles oder andere lange Dateien automatisch begrenzen und
somit verhindern, da&szlig; sie unendlich wachsen. 
<p>
<b>Compatibilit&auml;t mit FFS</b>

<p>
PFS2 ist auf Filesystem Level voll kompatibel zu FFS, bis auf ein paar nur
selten benutzte Filesystem Packets. Das hei&szlig;t praktisch alle Tools und
Applikationen, die das Filesystem nutzen funktionieren genauso wie immer.
Auch mit Backup Programmen sind keinerlei Probleme zu erwarten.
<p>
Doch einige Programme versuchen auch direkt, unter Umgehung des Filesystems,
auf den Datentr&auml;ger zuzugreifen und funktionieren deshalb nur auf FFS Medien
korrekt. Beispiele sind Disk Optimiser und einige Reperatur Programme.
Diese Art von Programmen mu&szlig; deshalb speziell auf die Zusammenarbeit mit
PFS2 vorbereitet sein, da PFS2 die Daten v&ouml;llig anders und dabei effizienter
auf dem Datentr&auml;ger ablegt. 
<p>
Das einzige Feature von FFS, da&szlig; nicht von PFS2 unterst&uuml;tzt wird, sind die
sogenannten Record Locks. Uns ist jedoch zur Zeit kein einziges Programm
bekannt welches diese nutzt.

<p>
<b>System Voraussetzungen</b>
<p>

PFS2 arbeitet auf jedem Amiga mit Kickstart 2.04 oder h&ouml;her. Es akzeptiert
DD/HD Disketten Laufwerke und RDB (Rigid Disk Block) Festplatten. Jedes
Ger&auml;t, das mit FFS problemlos funktioniert, wird dies auch mit PFS2 tun.
Der ben&ouml;tigte Speicher h&auml;ngt von der Anzahl der vewendeten Puffer ab, in
einer Minimal Konfiguration sind das weniger als 150K. Wenn mehr freier
Speicher f&uuml;r PFS2 zur Verf&uuml;gung gestellt wird erh&ouml;ht dies die Leistung.
Die Floppy Version ben&ouml;tigt ca. 60K pro Laufwerk.
<p>
Schnellere Prozessoren und h&ouml;here Taktraten k&ouml;nnen die Leistung von PFS2
betr&auml;chtlich erh&ouml;hen, speziell angepa&szlig;te Versionen f&uuml;r praktisch alle
680x0 Prozessoren befinden sich im Lieferumfang. Versionen f&uuml;r PowerPC
Amigas sind f&uuml;r die Zukunft geplant.
<p>


<b>Hinzufügen von Puffer</b>
<p>

Um auf eine Datei zuzugreifen ben&ouml;tigt PFS2 alle Informationen &uuml;ber diese
Datei, welche aus dem Verzeichnis und der Allocation Tables gewonnen werden.
Wenn solche Informationen einmal gelesen wurden, werden sie so lange wie
m&ouml;glich im Speicher gehalten. Dieser Speicher wird durch die Puffer definiert,
wobei jeder einen Block speichern kann.
<p>
Puffern von Bl&ouml;cken erh&ouml;ht die Zugriffsgeschwindigkeit erheblich, da der
Hauptspeicher des Computers um ein vielfaches schneller ist als jede Disk.
Datentr&auml;ger sind speziell bei Seek Operation relativ langsam, weshalb PFS2
versucht diese auf ein Minimum zu beschr&auml;nken und stattdessen die Puffer zu
benutzen. Deshalb sind wirklich hohe &Uuml;bertragungsraten auch nur mit einer
ausreichenden Menge von Puffern zu erzielen.
<p>
Jede PFS2 Partition sollte mindestens &uuml;ber 100 Puffer verf&uuml;gen, empfohlen
sind jedoch zwischen 150 und 250, wobei gr&ouml;&szlig;ere Volumes auch &uuml;ber mehr
zugeordnete Puffer verf&uuml;gen sollten. Wenn eine Partition sehr gro&szlig;e
Verzeichnisse enth&auml;lt (mehr als 2000 Dateien) sollten 250 bis 350 Puffer
benutzt werden.
<p>
PFS2 verf&uuml;gt &uuml;ber eingebaute Kontrollmechanismen um sicherzustellen, da&szlig; die
Anzahl der Puffer zwischen 70 und 500 liegt. Mit weniger als 70 Puffern kann
PFS2 unter Umst&auml;nden nicht richtig arbeiten und bei mehr als 500 Puffern wird
der Verwaltungsaufwand daf&uuml;r ein ernstes Problem.
<p>
Jeder Puffer hat eine Gr&ouml;&szlig;e von 1024 Byte (1K), unabh&auml;ngig von der realen
Blockgr&ouml;&szlig;e.
<p>
<b>Atomic Commit</b>

<p>
Wenn Ihr Amiga w&auml;hrend einer Schreiboperation abst&uuml;rzt werden normale FFS
Volumes 'invalidated' und das System versucht beim n&auml;chsten Neustart diese
automatisch zu reparieren. Danach befindet sich das jeweilige Verzeichnis
im gleichen Zustand wie es vor der Schreiboperation war. Dies ist zwar eine
nette Eigenschaft aber sie hat 3 entscheidende Nachteile:
<p>
1. Validieren kostet viel Zeit, was auf einem gro&szlig;en Volume sehr viel
   Geduld vom Benutzer verlangt.<br>
2. Wenn w&auml;hrend des Absturzes gerade eine Datei &uuml;berschrieben wurde, dann
   verlieren Sie vermutlich sowohl die alte als auch die neue Datei.<br>
3. Diese Methode funktioniert nicht immer!
<p>
PFS2 sorgt daf&uuml;r, da&szlig; alle Strukturen eines Verzeichnisses immer g&uuml;ltig
sind. Selbst wenn der Computer einmal w&auml;hrend einer Schreiboperation
abst&uuml;rzt wird das Volume nach einem Neustart immer fehlerfrei sein, ohne
die Notwendigkeit es zu validieren.
<p>
PFS2 erreicht dies durch eine Technik namens 'Atomic Commit'. Das bedeutet,
der Datentr&auml;ger geht immer direkt von einem g&uuml;ltigen Zustand in den n&auml;chsten
g&uuml;ltigen Zustand &uuml;ber, und zwar durch einen einzigen nicht unterteilbaren
(deshalb 'atomic') Zugriff.
<p>
PFS2 benutzt diesen Mechanismus auf dem gesamten Medium, bei jeder Struktur,
jedem Verzeichnis und jeder Datei. Wenn der Computer also doch einmal bei
einem Schreibzugriff abst&uuml;rzen sollte, dann bleibt die bisherige Datei ohne
jeden Fehler erhalten, als w&auml;re nichts passiert.

<p>
<b>Delete Directory</b>
<p>
Manchmal kann es passieren, da&szlig; Dateien versehentlich gel&ouml;scht werden, das
kann jedem einmal passieren. Und was dann, wenn man in diesem Fall &uuml;ber
kein Backup verf&uuml;gt?
<p>
Mit PFS2 ist dies kein Problem: Schauen Sie einfach in das Delete Directory,
auch <i>deldir</i> genannt, in dem PFS2 alle gel&ouml;schten Dateien speichert.
Es enth&auml;lt immer die letzten 31 gel&ouml;schten Dateien und der Zugriff darauf
ist sehr einfach. 
<p>
Das deldir ist ein verstecktes Verzeichnis und wird nicht im normalen
Verzeichnis einer Partition angezeigt. Man kann nur darauf zugreifen
indem man den kompletten Namen angibt welcher '.deldir' lautet. Es
befindet stets im Ursprungsverzeichnis einer Partition. Jedes Programm
kann darauf zugreifen vorausgesetzt es gibt den exakten Namen an.
<p>
<b>Dateien im deldir</b>
<p>
Jede Datei, die gel&ouml;scht wird, wird tats&auml;chlich zun&auml;chst nur in das
Delete Directory verschoben. Das gleiche gibt f&uuml;r &uuml;berschriebene
Dateien. Wenn also beispielsweise die startup-sequence versehentlich
&uuml;berschrieben wird, finden Sie die &auml;ltere Version im deldir wieder.
<p>
Das deldir hat 31 Pl&auml;tze (Slots), nummeriert von 0 bis 30. Jeder Slot
kann eine Datei aufnehmen, wenn alle Slots voll sind werden die &auml;ltesten
Eintr&auml;ge &uuml;berschrieben.
<p>

<b>Problem Erkennung</b>
<p>

PFS2 tut alles um Ihre Daten sicher aufzubewahren, doch auch ein PFS2
Volume kann ernste Probleme bekommen:<br>
- einzelne Bl&ouml;cke des Datentr&auml;gers weisen Fehler auf<br>
- ein externes Programm zerst&ouml;rt durch PFS2 gepufferte Bl&ouml;cke<br>
- ein externes Programm (wie ein Virus) zerst&ouml;rt Daten
<p>
Wenn solch ein fehler auftritt wird er vermutlich weitere nach sich ziehen.
Das beste w&auml;re in diesem Fall jeden weiteren Schreibzugriff zu unterbinden
und zun&auml;chst einmal ein Backup anzufertigen um so viele Daten wie m&ouml;glich
zu retten.
<p>
PFS2 hat eingebaute Mechanismen um solche Probleme zu erkennen. Wenn PFS2
ein problem erkennt macht es das Volume sofort Read Only und verhindert so
weitere Sch&auml;den.
<p>
Einige der Probleme die PFS2 automatisch erkennt:
<p>
<b>Out of bounds checking</b><br>
Zugriffe au&szlig;erhalb der Partition werden erkannt.
<p>
<b>Block validity checking</b><br>
PFS2 &uuml;berpr&uuml;ft ob Bl&ouml;cke syntaktisch korrekt sind.
<p>
<b>Konfigurations Fehler</b><br>
PFS2 &uuml;berpr&uuml;ft, ob Speicher mit der angegebenen Mask und BufMemType auch
wirklich durch das Device angesprochen werden k&ouml;nnen.
<p><table><tr><td>
<b>Fazit:<b><br> 
Die Geschindigkeits Steigerung ist überweltigend, zum Beispiel geht scan dir mit PFS2 und einem 
Disk Puffer von 200 10mahl schneller als mit FFS und einem Disk Puffer von 30.
Dadurch startet Voyager NG mit PFS2 ohne lange auf die Festplatte zuzugreifen und was es 
heisst das die Disk immer validiert ist brauche ich wohl keinen erzählen .Allerdings hat das setzten 
vom dem Disk Puffer auf 200 bei meinen 5 Partitionen 3 MB Ram gekostet. Das Hohen mass an 
Geschwindigkeit , Sicherheit und Stabilität von PFS2 macht es <b>Emfehlenswert</b>.
</td><td><img src="../pic/atawart.gif" alt="awart" width=111 height=111></td></tr></table>
<p><i>-sk-</i>
<p>
<b>Kontakt</b>
<p>

Great Effects Development:<br><table>
<tr><td>  Michiel Pelt     </td><td>       Autor von PFS2, Programmierer von Kang-FU</td></tr>
<tr><td>  Hugo Hoekstra    </td><td>       Leiter des Games Department, Grafik, PR</td></tr>
<tr><td>  Fred Hoekstra    </td><td>       Berater<tr><td>
<tr><td>  Richard van Meurs</td><td>       zus&auml;tzliche Programmierung und PC-Portierung</td></tr></table>
<p>
Great Effects Development kann erreicht werden &uuml;ber:<br>
eMail:<br><table>
<tr><td>  <a href="mailto:info@greed.nl">info@greed.nl</a>   </td><td>        allgemeine Fragen und Informationen</td></tr>
<tr><td>  <a href="mailto:support@greed.nl">support@greed.nl</a> </td><td>       Kundendienst</td></tr></table>
<p>
www:<a href="http://www.greed.nl">www.greed.nl</a>
<p>
Postanschrift:<br>
  Great Effects Development<br>
  Hofwijckplein 46a<br>
  2515 RL Den Haag<br>
  Niederlande<br>
<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="176.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="141.html">
</MAP>
</center><hr>
</body>
</html>


