<html>
<head>
<title>AMIGA Times 05/98 - Aktuell</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><img src="../pic/aktuell.gif"><hr>
<b>diverse news</b><br>
(Was passierte in den letzten zwei Monaten?)
</center>
<p>


<b>DAUG mit eigener Website</b><br>
Die DAUG (Dachverband der deutschen Amiga User Groups) hat jetzt eine 
eigene Website. Mehr Info &uuml;ber die DAUG gibt es hier!!! <br>
WebSite: <a href="http://www.hp.europe.de/DAUG/">www.hp.europe.de/DAUG/</a>
<p>
<b>Neue Web Adresse des AMIGA Stimmungsbarometers</b><br>
Das AMIGA Stimmungsbarometer ist absofort unter folgender Adresse 
erreichbar: <a href="http://www.netcologne.de/~nc-misicma/">http://www.netcologne.de/~nc-misicma/</a>
<p>
<b>HIGH VOLTAGE ist f&uuml;r immer offline</b><br>
Die Mailbox HIGH VOLTAGE ist offline, wer Kontakt zu ehemaligen Usern der
HIGH VOLTAGE aufnehmen moechte, sollte sich entweder an Andreas Magerl 
(<a href="mailto:andreas@chiemgau.baynet.de">andreas@chiemgau.baynet.de</a>) wenden oder die neue Andresse des jeweiligen
Users nutzen. (Theoretisch aendert sich ja nur alles ab dem @ - Zeichen, 
das Wort bzw. der Name vor dem @ - Zeichen duerfte der selbe bleiben. 
Die HIGH VOLTAGE Adressen sollten nicht mehr genutzt werden!
<p>
<b>AMIGA mit Fernsehwerbung!</b><br>
Okay, so ganz ist es nun doch nicht, aber... als ich am 13.10.1998 das
Infotainment Magazin taff auf Pro7 sah, ging es um einen Fall in den USA,
wo ein Vegetarier eine Fast-Food Kette verklagen wollte, und gerade dieser
Ami, trug ein T-Shirt mit Aufschrift :&quot;Only AMIGA makes it possible&quot;, na 
das ist doch einfach ein sau gute Werbung fuer uns, jetzt muesste  man nur
noch herausbekommen wo man diese Shirts beziehen kann. Das Shirt war mehr-
mals in voller Groe&szlig;e zu sehen und ich fand es schon toll, da&szlig; es Leute 
gibt, die sich offen zum AMIGA-User bekennen!!! (Mario)
<p>
<b>Village Tronic auf der Computer`98 in K&ouml;ln.</b><br>
Auch dieses Jahr l&auml;&szlig;t es sich Village Tronic aus Sarstedt bei Hannover
nicht nehmen, seine Zelte auf der altehrw&uuml;rdigen Amiga Messe, der Computer
98 in K&ouml;ln aufzuschlagen. Wie in den Jahren zuvor wird die aktuelle Produktpalette der Hardwareschmiede vorgstellt werden. Auf gro&szlig;es Interesse d&uuml;rfte
hierbei eine Neuentwicklung sto&szlig;en: Die AriadneII Ethernetkarte, das Nachfolgemodell der bekannten Highspeed-Netzwerkkarte, wird hier voraussichtlich
zu bestaunen und zu kaufen sein - nat&uuml;rlich zu Messepreisen.
Das gleiche gilt f&uuml;r die PicassoIV Grafikkarte, die durch ihre Modularit&auml;t
einen Standart im Amigamarkt gesetzt hat. Das Zusatzmodul Paloma soll mit
einer neuen Zusatzfunktion gezeigt werden und die F&auml;higkeit unter Beweis 
stellen, kleine Animationsseqeunzen im AVI Format abspeichern zu k&ouml;nnen. 
Der Programmierer von PalomAVI wird f&uuml;r Fragen und Antworten zur Verf&uuml;gung
stehen. Am Samstag den 14.11. wird der Entwickler der Picasso IV, Klaus 
Burkert, zwischen 13-16 Uhr ebenfalls mit Rat und Tat zur Verf&uuml;gung stehen.
<p>
<b>amigaOS</b><br>
Das neue Amiga Magazin amigaOS wird die Erstausgabe zur Computer`98 
pr&auml;sentieren. Mit einer St&uuml;ckzahl von 40.000 Exemplaren soll der Markt
erstmal abgedeckt werden. Es gibt schon jetzt viele Leute, die bei dem 
Mag mitmachen und wer jetzt schon einmal wissen will, was ungef&auml;hr in der
Erstausgabe drin stehen wird, sollte mal bei der amigaOS Homepage vorbeischauen, oder einfach abwarten. <a href="http://www.amigaOS.de">http://www.amigaOS.de</a>
<p>
<b>Future Shock 2</b><br>
Future Shock 2 (CD) ist jetzt erh&auml;ltlich von Eric Gieseke. 
Der Preis liegt bei 8 US Dollar und auch hier wurde ausschlie&szlig;lich der
Amiga benutzt, die CD enth&auml;t au&szlig;erdem noch den Soundtrack des Spieles 
Scorch Tanks. Mehr Infos unter <a href="http://www.txdirect.net/~sidewind/fs2.htm.">www.txdirect.net/~sidewind/fs2.htm.</a>
<p>
<b>CD Version von Biing!</b><br>
Verkosoft bietet jetzt eine CD Version von Biing! an, jedoch ist unklar
ob es auch &Auml;nderungen enth&auml;lt, oder nur auf CD gepresst wurde. F&uuml;r 79,90
gibt es die AGA Version und f&uuml;r 69,90 die ECS Version. Mehr unter:
<a href="http://www.verkosoft.de">www.verkosoft.de</a>
<p>
<b>Scalos 1.1 jetzt verf&uuml;gbar</b><br>
Jetzt ist von dem Workbench-Ersatz &quot;Scalos&quot; eine neue Version
im Aminet erschienen.
<p>
&quot;<b>AMIGA - Wiedergeburt einer Legende.</b><br>
M&auml;nnlichen Computerfans wurde er zur 'unsterblichen Geliebten': Der - 
oder vielleicht doch die - AMIGA! Ausgestattet mit Motorola-Prozessoren 
der 68 000 Serie - also der gleichen Baureihe, mit der auch die alten 
Apple-Rechner liefen - konnte das Betriebssystem des AMIGA vor 10 Jahren
schon etwas, was sowohl beim MacOs als auch bei Windows bis heute nicht 
funktioniert: Echtes Multitasking. Doch was hilft schon technische &Uuml;berlegenheit, wenn's mit dem Marketing nicht so recht klappen will und - 
schlimmer noch - beide Mutterfirmen Pleite machen? Doch tot ist der AMIGA
deswegen noch lange nicht: Der amerikanische Computerhersteller Gateway 
hat sich vor einem Jahr die Rechte gesichert und will innerhalb eines 
Jahres den AMIGA wiederbeleben. Gespr&auml;chspartner: Petro Tyschtschenko, 
Amiga-Entwickler (der 'ersten Stunde'), heute: Gesch&auml;ftsf&uuml;hrer der 
AMIGA-Tochtergesellschaft von Gateway Computer.&quot;
Ein Beitrag von Grischa Brower-Rabinowitsch (Quelle:Bayerischer Rundfunk) 
<p>
Der Bayrische Rundfunk f&uuml;hrte mit Petro Tyschtschenko ein Interview,
welches demn&auml;chst auch als Real-Audio Datei verf&uuml;gbar sein wird, auf
der &quot;Bayrischer Rundfunk&quot; Homepage wurde der obige Text dazu ver&ouml;ffent-
licht.
<p>
<b>Mal wieder gute Neuigkeiten von Vulcan</b><br>
Aufgrund des dreij&auml;hrigen Bestehens von Vulcan Software, erscheint 
die erste Compilation CD-Rom. Diese enth&auml;lt 10 Spiele die einen 
Award gewonnen haben. Es ist eine Art Tribut an die guten alten A500-
Floppy-Zeiten. Die genauen Spielnamen und der Preis ist noch nicht be-
kannt.
<p>
<b>Hard Target wird eingestellt</b><br>
Imij Software habt die Entwicklung von dem Spiel Hard Target eingestellt,
Grund ist der gleiche, wie auch bei den Einstellungen anderer Vulcan 
Produkte: man ist nicht von einem Erfolg &uuml;berzeugt, aufgrund der derzeit-
igen Marktlage.
<p>
<b>Neue Amiga Zeitung vom Falke Verlag</b><br>
Auf der Computer`98 wird eine neue Amiga Zeitung erscheinen. Das Mag 
hei&szlig;t &quot;amigaOS&quot; und wird vom Falkeverlag herausgebracht, welche auch 
&quot;St-Computer&quot; (Atari Mag) ver&ouml;ffentlichen. Das Mag wird sich mehr auf
den Anwendungsbereich beziehen. Weiterhin kann man sich noch als Autor
bewerben oder Vorschl&auml;ge mit einbringen, somit w&auml;re es nun schon das 
zweite Mag (neben der AMIGA fever), bei dem User mitmachen k&ouml;nnen. Mehr
Infos gibt es unter <a href="http://www.amigaOS.de.">www.amigaOS.de.</a>
<p>
<b>Neue Version des &quot;Adress Master&quot; erschienen</b><br>
Jetzt erschien eine neue Version des Verwaltungsprogramms &quot;ADM-Adress
master&quot;. Version 3.61 enth&auml;lt jetzt ein Browser Unterst&uuml;tzung (Verwaltung
von WWW Adressen u.a.), die Option Faxnummern ins Clipboard zu kopieren,
weiterhin wird jetzt auch Microdot unterst&uuml;tzt. Es wurden einige Bugs 
behoben und ein paar &Auml;nderungen vorgenommen.<br> 
Web Adresse: <a href="http://hp48.rhein-neckar.de/adm/index.html">http://hp48.rhein-neckar.de/adm/index.html</a>
<p>
<b>Neue GeoWorld Version</b><br>
Demn&auml;chst erscheint eine neue Version des Programms &quot;GeoWorld&quot; (Version 
1.08) auf der Homepage von Beer Production <a href="http://www.freiepresse.de/home/jubee">www.freiepresse.de/home/jubee</a>
/GeoWorld.html.
<p>
<b>AUGS mit neuer Homepage Adresse</b><br>
Die Amiga User Group Schweiz (kurz AUGS) hat jetzt eine neue Homepage und
eMail Adresse. Diese lauten:<br>
Neue WWW-Adresse:<br>
<a href="http://www.augs.ch">www.augs.ch</a><br>
Neue E-Mail Adrese:<br>
<a href="mailto:webmaster@augs.ch">webmaster@augs.ch</a>
<p>
<b>Neue Amiga Zeitung</b><br>
Eine neue Amiga Zeitschrift wird demn&auml;chst erscheinen, der Name lautet
&quot;AMIGA FEVER&quot;. Ein Abo kann man jetzt schon bestellen, obwohl die Erstausgabe noch nicht erschienen ist. Die HTML Seiten des Magazins sehen
schon recht annehmlich aus, eine Bibliothek wird es dort geben, wo man 
schon ins Mag reinlesen kann, weiterhin gibt es die M&ouml;glichkeit an dem
Magazin mitzuhelfen.<br> Das Mag ist im Web unter: <a href="http://www.amigafever.com">http://www.amigafever.com</a><br>
die eMail Adresse lautet: <a href="mailto:kontakt@amigafever.com">kontakt@amigafever.com</a>
<p>
<i>-mn- </i>


<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="122.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="178.html">
</MAP>
</center><hr>
</pre>
</body>
</html>
