<html>
<head>
<title>AMIGA Times 05/98 - Software</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><img src="../pic/softw.gif"><hr>
<b>Studio Professional v2.2</b>
</center>
<p>
Drucken ist die eine Sache, richtig drucken die andere. Es ist nun eben
so, da&szlig; heute ein Drucker allein nicht mehr ausreicht, da braucht man 
schon mehr, erstens vern&uuml;nftige Treiber und zweitens eine gute Textverarbeitung bzw. ein vern&uuml;nftiges Grafikprogramm. Letzteres kann Studio
Professional v2.2 zwar nicht erf&uuml;llen, jedoch ist es eine L&ouml;sung, wenn
es um Treiber und deren richtige Einbindung/Benutzung geht. Studio Pro
(ic k&uuml;rze jetzt mal ab) bekommt man auf CD-Rom, diese enth&auml;lt mehr als
3 MB an gepackten Treibern, &uuml;berwiegend f&uuml;r Epson, Canon und HP Drucker.
Spezielle Treiber f&uuml;r DTP Programme wie PageStream liegen ebenfalls bei.
<p>
<b>Installation</b><br>
Die Installation ist kinderleicht, man klickt einfach nur auf das Install Icon und der Installer startet, wenn irgendetwas vom User ausgew&auml;hlt werden
mu&szlig;, so bekommt dieser es mitgeteilt und kann seine Wahl vornehmen. Also
ganz einfach.
<p>
<b>Die Benutzung</b><br>
Nun, Studio Pro (wenn man das Executeable-File im Prefs Verzeichnis nutzt)
hat kein eigenes Window in dem Sinne, sondern nur ein kleines Fensterlein
auf dem Bildschirm. Es werden ja nur Einstellungen vorgenommen, warum 
sollte man da noch ein Extra Bildschirmfenster &ouml;ffnen. Nun obwohl man 
w&auml;hrend der Installation eigentlich alles eingestellt hat, mu&szlig; oder sollte
man noch einige &Auml;nderungen vornehmen, um keine &Uuml;berraschungen zu erleben. 
Da ich einen Canon Drucker habe, wurde mir Canon Studio installiert, mit
diesem kann man drucken und wenn man es benutzt wird ein neues Window ge&ouml;ffent und man bekommt einige Optionen, wie zum Beispiel eine Papier- oder
Effekteauswahl. Insgesamt gesehen kann man schon daf&uuml;r sorgen, optimale
Ausdr&uuml;cke zu bekommen, da ich aber nur einen Canon (BJC620) habe, kann ich
Euch nur von diesem Treiber und dem Canon Studio berichten, aber ich z&auml;hle
Euch nochmal die genauen Features von Studio Professional v2.2 auf:
<center><table>
<tr><td><img src="../pic/st_1.jpg" alt="bild"></td></tr>
<tr><td><img src="../pic/st_2.jpg" alt="bild"><img src="../pic/st_3.jpg" alt="bild"></td></tr>
<table></center>
<ul>
<li> Hochwertige Druckertreiber f&uuml;r alle DeskJets, LaserJets, alle
  PCL-kompatiblen mit bis zu 1200dpi, Epson Stylus/Photo und
  fast alle 24-Nadel und Tintenstrahl-Drucker
<li> Volle Kontrolle und Ausnutzung des eigenen Druckers
<li> Setup- und Kalibrationssoftware f&uuml;r die LaserJet, Canon,
  Epson und Panasonic Drucker.
<li> Ausgabe in 8-Bit bis 24-Bit-Qualit&auml;t. Intern arbeitet Studio mit bis
  zu 96-Bit
<li> 54 modernste Raster- bzw. Dither-Verfahren.
<li> Das erste professionelle Farbmanagement-System auf dem Amiga sorgt f&uuml;r
  bislang unbekannte Farbtreue im Ausdruck
<li> Einfache Farbkalibrierung des Ausdrucks mittels Scanner oder manuell
<li> Ausgabe von Grafiken der Formate IFF ILBM, TIFF, PNG, JPEG, Workbench
  Datatypes (ab OS 3.0) und viele andere mehr; der Ausdruck erfolgt von
  Disk mit geringem Speicherbedarf
<li> Externe Ausgabemodule z.B. f&uuml;r Canon BJC, Epson, Deskjet, IFF ILBM und
  andere
<li> Volle Multitasking- und ARexx-Unterst&uuml;tzung
<¾ul>
<b>Systemanforderung:</b><br>
Amiga mit Workbench 2.04, 3.0, 3.1 oder h&ouml;her, mindestens 1,5 MB RAM und
CDROM reichen f&uuml;r die Benutzung von Studio professional v2.2 aus.
<p>
<b>Fazit:</b><br> Es ist sicherlich nicht einfach so ein Produkt mit einem
       Fazit zu versehen, da man einen Treiber schlecht einordnen
       kann, aufjedenfalls ist die CD jedem zu empfehlen der oft
       nach Treiber sucht, denn diese CD enth&auml;lt f&uuml;r alle g&auml;ngigen
       Drucker die richtigen Treiber, und es ist eben schon ein
       Unterschied, ob ich die Workbench-Epson-Emulation nutze oder
       einen richtigen Druckertreiber f&uuml;r mein Dr&uuml;ckerlein!
       <i><b>- Gut - </i></b>
<p>
<i>-mn- </i>
<p>
Quelle:<br> Stefan Ossowskis Schatztruhe Gesellschaft f&uuml;r Software mbH<br>
        Veronikastr. 33 - 45131 Essen - Germany<br>
        Phone: ++49-201-788778  Fax ++49-201-798447<br>
        <a href="mailto:stefano@schatztruhe.de">mailto:stefano@schatztruhe.de</a> <a href="http://www.schatztruhe.de/">http://www.schatztruhe.de/</a> 



<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="131.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="175.html">
</MAP>
</center><hr>
</pre>
</body>
</html>
