<html>
<head>
<title>AMIGA Times 05/98 - AT - Spieleteil</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><img src="../pic/games.gif"><hr>
<b>Napalm - The Crimson Crisis</b>
</center>
<p>
clickBOOM gibt nicht auf, obwohl in der letzten Zeit einige
Softwarentwicklungen eingestellt wurden, macht clickBOOM weiter,
getreu dem Motto &quot;die beste Software zu machen, die es gibt&quot;. Mit
den letzten drei Produkten haben sie es ja geschafft und mit
&quot;Napalm - The Crimson Crisis&quot; zeichnet sich einer neuer Stern am
Softwarehimmel ab. Das 6.5 MB gro&szlig;e Demo, welches schon mit einem
Update versorgt wurde, kann man sich derzeit aus dem Aminet oder
direkt von der clickBOOM Homepage (<a href="http://www.clickboom.com">www.clickboom.com</a>) downloaden.
<p>
&quot;Napalm - The Crimson Crisis&quot; ist ein Strategiespiel wie man es
seit &quot;Dune 2 - The Battle of Arakis&quot; nicht mehr gesehen hat. In
einer isometrischen Ansicht oder bessergesagt aus der Vogelpers-
pektive steuert man seine Einheiten, die von Fu&szlig;truppen, &uuml;ber
Raketenpanzer, Jeeps und Hubschraubern alles bietet. Dies ist aber
nur ein geringer Auszug aus der Palette der ganzen Truppen die
einem zur die Missionen bereit stehen.
<p>
Das Ziel<br>
Ziel des Demos ist es, den Feind zu zerst&ouml;ren. Um dies zu erreichen,
hat man einige Einheiten und Geb&auml;ude zur Verf&uuml;gung. Nachdem
die Hauptzentrale gebaut ist, hat man die M&ouml;glichkeit auch andere
Geb&auml;ude zu plazieren. Wie auch in &quot;Dune 2&quot;, mu&szlig; man in &quot;Napalm&quot;
f&uuml;r Geld sorgen, denn das Anfangskapital von 8000 Credits reicht
nicht lange. Um Geld zu bekommen mu&szlig; man Raffinerien bauen und
&Ouml;l f&ouml;rdern, welches dann von Tankern weggeschafft wird. Es gibt
aber nicht &uuml;berall &Ouml;l, sondern nur an einigen bestimmten Flecken
auf der Landkarte.<p> <img src="../pic/napalm2.jpg" alt="bild" width=553 height=431>
<p>
Spielgeschehen<br>
Nachdem man sich auf der Workbenchoberfl&auml;che f&uuml;r den richtigen
Screenmode entschieden hat, startet das Spiel. Wenn das Titelbild
erscheint, ert&ouml;nt aus dem Hintergrund eine englische Frauenstimme
die einem kurz etwas &uuml;ber &quot;Napalm - The Crimson Crisis&quot; berichtet.
Danach kommt man sofort in den Missions-Screen, auch dort wird einem
via Sprachausgabe die Aufgabe Deiner Mission erkl&auml;rt.
Tja, und dann geht es auch gleich los. Dein St&uuml;tzpunkt besteht aus
einer Hauptzentrale und zwei T&uuml;rmen, die f&uuml;r den n&ouml;tigen Strom sorgen
d&uuml;rften. Man hat ca. 20 Einheiten anfangs, das reicht aber in keinster
Weise, so sollte man sich gleich eine Fabrik zur Produktion von
zus&auml;tzlichen Einheiten bauen, ist dies geschehen, kann man anfangen
Panzer und Jeeps herzustellen. Die Einheiten greifen selbstst&auml;ndig Feinde
an, jedoch mu&szlig; man ihnen schon helfen. Hier lernt man die gute Bedienung von 
&quot;Napalm&quot; zu sch&auml;tzen, denn was bei PC Spielen l&auml;ngst Standard
ist, hat man bei diesem Game nun endlich auch eingef&uuml;hrt, es ist die M&ouml;glichkeit einen Rahmen &uuml;ber alle Einheiten zu ziehen und somit alle 
Truppen gemeinsam gegen den Feind k&auml;mpfen zu lassen. Bei &quot;Dune 2&quot; musste
man noch jede Einheit einzeln anklicken und zum Angriff bereit machen, 
was bei 40 Fahrzeugen sehr m&uuml;hsam war. Insgesamt hat man 9 Minuten Zeit,
um den Gegner zu besiegen. <p> <img src="../pic/napalm1.jpg" alt="bild" width=640 height=350>
<p>
Gameplay<br>
Gesteuert wird &quot;Napalm&quot; &uuml;ber die Maus. Klickt man eine Einheit an, wird
ein symbolischer Rahm gezogen und in einem kleinen Balken die Power angezeigt. Ist eine Einheit aktiv (angeklickt) kann man entweder diese
bewegen, d.h. das ein gr&uuml;ner Kreis als Mauspointer erscheint oder eine
feindliche Einheit angreifen, dazu mu&szlig; man mit der Maus auf einen Gegner
gehen und wenn der Mauspfeil rot wird, klicken. Bei Geb&auml;uden ist es fast
gleich, klickt man sie an erscheint ein Rahmen mit Poweranzeige. Ist das
Geb&auml;ude angegriffen worden, sollte man zuerst mit der linken Maustaste
darauf klicken und dann via rechte Maustaste die Reparatur vornehmen.
Dies wird durch einen rotierenden Schraubenschl&uuml;ssel signalisiert.
Auf der rechten Seite des Screens kann man sich aussuchen, welches Geb&auml;ude man bauen m&ouml;chte, hat man eine Fabrik fertiggestellt, sollte man
diese aktivieren und dann auf der linken Seite w&auml;hlen, was hergestellt
werden soll. Oben ist ein Planet zusehen der als Landkarte dient. Hat
man ein Radar, wird anstatt des Planeten die korrekte Karte der Mission
gezeigt, mit allen Einheiten (farblich deutlich getrennt).
<p>
Grafik, Animation &amp; Sound<br>
Grafisch wurde &quot;Napalm&quot; sehr gut in Szene gesetzt, zwar sollte man 
fairerweise sagen, da&szlig; es nur in einer hohen Aufl&ouml;sung (640x512) dem Niveau
eines PC Games gleicht. Aber auch in einer kleineren Aufl&ouml;sung kann
es sich sehen lassen. Ab und zu kommt ein Flugzeug vorbei, welches
Fu&szlig;truppen abwirft, die dann nett animiert mit einem Fallschirm auf der
Erde landen. Aus den Geb&auml;uden kommt Rauch und die Fahrzeuge wie auch die
Bodentruppen hat man grafisch gut gestaltet. Toll sind die Explosionen
geworden, wenn zum Beispiel eine Einheit oder ein &quot;Haus&quot; zerst&ouml;rt
wird, stechen Flammen hervor und es qualmt bis nur noch eine Ruine vorhanden ist. 
Der Sound beschr&auml;nkt sich bis auf die gesprochenen Erkl&auml;rungen 
am Anfang, auf Ger&auml;usche die man aber &uuml;berarbeiten sollte. Nervend
fand ich die Sirene, die kurz vor der Niederlage erscheint.
<p>
Fazit:<br> Also &quot;Napalm - The Crimson Crisis&quot; sieht jetzt schon ziemlich gut
       aus. Wenn man den Sound noch etwas &uuml;berarbeitet, und einige kleine
       Bugs behebt, d&uuml;rfte dem Erfolg nichts mehr im Wege stehen. Man hat
       sich zwar etwas an PC Spielen wie zum Beispiel &quot;Command &amp; Conquer&quot;
       orientiert, aber warum denn nicht. F&uuml;r jeden Strategiefan d&uuml;rfte
       &quot;Napalm&quot; ein Mu&szlig; sein, da seid Monaten (ach, fast schon Jahren)
       kein vergleichbares Spiel f&uuml;r den Amiga, und wer &quot;Dune 2&quot; schon 
       toll fand, wird von &quot;Napalm&quot; begeistert sein.
       &Uuml;brigens, wer sich jetzt schon f&uuml;r &quot;Napalm&quot; entscheidet und es vor bestellt, bekommt kostenlos ein Keyfile f&uuml;r das Demo, mit dem man
       20 Minuten zocken kann, 16000 Credits hat und auf mehr Einheiten
       zur&uuml;ckgreifen kann.
<p>
<i>-mn- </i>



<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="101.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="22.html">
</MAP>
</center><hr>
</body>
</html>
