<html>
<head>
<title>AMIGA Times 05/98 - AT - Spielteil</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><img src="../pic/games.gif"><hr>
<b>Gunbee *F99*</b><br>
Summ... Summ... Summ, Bienchen flog herum!
</center>
<p>
Der Planet Valstyx war jahrelang ein sehr friedlicher Ort im
Universum, da die 5 Kristalle, die f&uuml;r Sicherheit und Ruhe auf
dem Planete sorgten - in guten H&auml;nden waren und keine Gefahr 
ausging. Als aber eines Tages, seltsame Roboter und Truppen von
Lord Khenmir Valstyx &uuml;berfielen. Der k&ouml;nigliche Palast konnte
nicht verteidigt werden, da der Angriff v&ouml;llig &uuml;berraschend kam
und die Soldaten nicht vorbereitet waren. und so konnten sie
auch nicht verhindern, da&szlig; Prinzessin Akiko mit samt den 5 Kristallen
entf&uuml;hrt wurde. Du bist Kiara McGuire und als Pilot der Gunbee
F-99 ist es Deine Aufgabe die Prinzessin zu befreien und die
5 Kristalle zur&uuml;ckzuerobern.
<p>
Diese Geschichte wird in einem kleinen Intro erz&auml;hlt, welches
jedoch weder in Deutsch noch in Englisch ist, sondern in...
ich glaube Peruanisch (da der Autor aus Peru kommt, liegt es nahe).
Aufjedenfall konnte ich es nicht lesen, aber egal, das beiliegene
Guide (&uuml;brigens Deutsch bzw. Englisch) gab Aufschlu&szlig; &uuml;ber das Ziel
und die Geschichte von &quot;Gunbee F-99&quot;.
<p>
Das Intro ist grafisch ein echter Witz, es erinnert an tiefste
ECS Zeiten und deshalb ist es in meinen Augen unverst&auml;ndlich, da&szlig;
ein AGA Amiga mit 4 MB und HD ben&ouml;tigt wird. Der Sound nervt im
Intro total, so da&szlig; man liber gleich auf die Animationen verzichtet und sich gleich dem Spiel witmet.
<p>
Im Optionsmen&uuml; k&ouml;nnen erstmal alle Einstellungen get&auml;tigt werden.
Die Wahl besteht zwischen dem &quot;Honey&quot; und dem &quot;Story&quot; Modus, wobei
man im &quot;Honey&quot;-Modus den Level einstellen kann. Dann kann man
noch die Musik an- oder abstellen, wobei ich es vorgezogen habe,
die Musik abzustellen, doch dazu sp&auml;ter mehr. Ist alles so, wie man
es sich w&uuml;nscht, klickt man einfach auf Start und schon kann man
das Bienenraumschiff nutzen, um sein Ziel zu erf&uuml;llen.
<p>
Die Grafik ist kein besonderer Augenschmau&szlig;, im Gegenteil, f&uuml;r
AGA ist sie schlecht. Man fliegt &uuml;ber H&auml;user und Felder und kam
es vor, als wenn ich nur &uuml;ber irgendwelche Farbfl&auml;chen fliege,
denn Details hat man kaum eingef&uuml;gt. Im Grunde ist &quot;Gunbee&quot; ein
einfaches Shot`em Up mit ein paar Effeckten, wie zum Beispiel
einer Sani-Biene, bei der man sich regenerieren kann. Man mu&szlig;
soviel Punkte machen wie es nur geht und alles zerschie&szlig;en.
Die Musik und der SoundFX sind leider auch nicht motivierend,
eher andersherum, man schaltet die Musik ab, da sie nach einiger
Zeit anf&auml;ngt zu nerven. Einzig und allein die &quot;Game Over&quot; Musik
ist gut geraten und klingt melodisch - was f&uuml;r eine Ironie des
Schicksales.
<p>
Man hat im gesamten Spiel 3 Standardwaffen, die Maschinenpistole,
die Bombe(n) und einen Feuerball, der allerdings in der Anzahl 
begrenzt ist. Im Spiel sollte man eigentlich Dauerfeuer aktiviert
haben, da man sonst einen wunden Finger bekommen k&ouml;nnte. Dadurch
wird ja ununterbrochen auf alles geschossen, was einem in die Quere
kommt. Die Wolken verbergen oftmals Glocken, die man unterschiedlich nutzen sollte, denn sie bewirken einiges, hier die M&ouml;glichkeiten:
<table>
<tr><td>Goldene Glocke </td><td> - Punkte   :</td><td> 500 Punkte</td></tr>
<tr><td>Blaue Glocke   </td><td> - Speed Up :</td><td> Du wirst schneller.</td></tr>
<tr><td>Gr&uuml;ne Glocke</td><td>    - Power Up :</td><td> Verst&auml;rkt die Schu&szlig;kraft und gibt Dir eine neue Waffe.</td></tr>
<tr><td>Wei&szlig;e Glocke </td><td>   - Schild   :</td><td> Schutzschild f&uuml;r ca. 20 Sekunden</td></tr>
<tr><td>Rote Glocke   </td><td>  - Firebeam :</td><td> Du bekommst einen Feuerball</td></tr>
<tr><td>Schwarze Glocke</td><td> - Schaden! :</td><td> Nicht einsammeln, Gunbee verliert seine Arme und kann keine Bomben mehr abwerfen!</td></tr>
</table>
Leider hat man - wenn man mit Dauerfeuer spielt - kaum die M&ouml;glichkeit
die Fraben richtig zu nutzen, da die Glocken schon zu viele Sch&uuml;sse
abbekommen, bevor man sie einsammeln kann. Das Spiel gestaltet sich
smoit recht eint&ouml;nig, versuchen zu &uuml;berleben, Glocken einsammeln und
Gegner zu t&ouml;ten wird halt auf dauer langweilig. Hinzu kommt noch, da&szlig;
die Steuerung recht schwerf&auml;llig ist und man so teilweise Probleme
bekommt den gegnerischen Sch&uuml;ssen auszuweichen. 
<p> <img src="../pic/gun_1.jpg" alt="bild"> <img src="../pic/gun_2.jpg" alt="bild">
<p>
Fazit:<br> Obwohl sich der Autor sicherlich M&uuml;he gegeben hat, ist &quot;Gunbee&quot;
       kein Hit. Der nervende Sound und die einfach Grafik konnten
       mich nicht begeistern. F&uuml;r 49.90 DM kann man einfach mehr verlangen, 
als Shareware Produkt ist &quot;Gunbee&quot; eventuell zu empfehlen, denn im Internet gibt es vergleichbare Spiele in besser
       Qualit&auml;t f&uuml;r weniger Geld. Und wer gibt schon gerne 40 oder 50
       DM f&uuml;r ein Spiel aus, da&szlig; nur kurz fesselt und mit der Zeit
       kaum Abwechslung bietet? Sicherlich niemand!
<p>
<center><table bgcolor=#FFFFFF>
<tr><td>Wertung:</td><td> </td><td> </td></tr>

<tr><td>Gameplay:  </td><td><img src="../pic/70.gif" width=201 height=11></td><td> 72 %</td></tr>
<tr><td>Grafik:    </td><td><img src="../pic/75.gif" width=201 height=11></td><td> 76 %</td></tr>
<tr><td>Sound:     </td><td><img src="../pic/55.gif" width=201 height=11></td><td> 54 %</td></tr>
<tr><td>Motivation:</td><td><img src="../pic/70.gif" width=201 height=11></td><td> 69 %</td></tr>

<tr><td>Gesamt:    </td><td><img src="../pic/70.gif" width=201 height=11></td><td> <b>68 %</b></td></tr>
</table></center>
<p>
<i>-mn- </i>
<p>
Quelle:<br> APC &amp;TCP<br>
        Postfach 59<br>
        83236 &Uuml;bersee<br>
        <a href="mailto:andreas@highvolt.gun.de">andreas@highvolt.gun.de</a><br>
        <a href="http://www.chiemgau.com/apc&tcp">http://www.chiemgau.com/apc&tcp</a>

<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="22.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="502.html">
</MAP>
</center><hr>

</body>
</html>
