<html>
<head>
<title>AMIGA Times 05/98 - Helpline</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><img src="../pic/help.gif"><hr>
<b>RBM Towerhawk ex 2 f&uuml;r A1200/4000</b>
</center>
<p>
Zum RBM Tower haben wir zum Einbau einen A1200, mit CD Rom, 3&frac12; 
Diskettenlaufwerk, und 2.1 GB Festplatte verwendet. Sowie eine
Ramkarte mit 8MB.
<p>
Als erstes mu&szlig; man das Oberteil und die beiden Seitenteile entfernen, nach
dem man sieben gro&szlig;e Schrauben abmontiert. Bevor man jedoch &uuml;berhaupt etwas
einbauen kann, mu&szlig; man die Slotblechhalterung rausschrauben und an der
Einkerbung abbrechen und vor dem Einsetzen um 180&deg; drehen. Der Towerhawk
ist auch f&uuml;r den A4000 geeignet und befindet sich somit in dieser Ausgangsposition. 
<br> <img src="../pic/rbm1.gif" alt="bild"><img src="../pic/rbm2.gif" alt="bild"><br>
Als n&auml;chstes mu&szlig; der A1200 zerlegt werden und wenn dies erledigt ist, kann
man das nackte Motherboard einsetzen. Man mu&szlig; noch vom Maus- und Videoport
die Schrauben heraus drehen. Der A1200 wird mit drei Schrauben befestigt.
<p>
Im n&auml;chsten Schritt kann man auch schon mit dem Einbau des Diskettenlaufwerkes und der Festplatte beginnen. Dazu mu&szlig; man die kleinen Einsch&uuml;be 
herausschrauben. Dann setzt man die Festplatte und das Diskettenlaufwerk
ein. Die daf&uuml;r ben&ouml;tigten Schrauben werden mitgeliefert. Im Tower befinden
sich noch zus&auml;tzlich 5 gro&szlig;e Einsch&uuml;be f&uuml;r CD Roms, Zip Laufwerke usw.
Wenn der Einbau erledigt ist, kann man dann das schon mal mit dem A1200
verbinden. F&uuml;r das Diskettenlaufwerk wird ein verl&auml;ngertes Kabel mitgeliefert. Da der A1200 verschiedene Produktserien durchlief, kann das 
Diskettenlaufwerk unterschiedlich sein (Panasonic, Chinon, Sony...). Dazu
mu&szlig; dann halt der 5&frac14; Zoll Einbaurahmen verwendet werden. <br><img src="../pic/r3.gif" alt="bild">
<p>
Das Tastatureninterface ist eine neue Entwicklung - denn per Tastatur 
l&auml;st sich der Amiga ein und ausschalten. Als erstes mu&szlig; man dabei das
kleine Teil was sich in einer W&uuml;rfel&auml;hnlichen Form befindet abmachen.
Dann findet man in der R&uuml;ckwand die Markierungen f&uuml;r das Interface und
befestigt es mit zwei Schrauben. Nun tut man von dem Interface aus ein
l&auml;ngeres, d&uuml;nnes Flexkabel auf den A1200 feststecken, wo die Amiga 
Tastatur angeschlossen war. Als n&auml;chstes schlie&szlig;t man den dicken Stecker
von dem Netzteil an das Interface an, da er f&uuml;r die Stromversorgung zust&auml;ndig ist. Wenn dies dann alles erledigt ist, nimmt man das kleine
w&uuml;rfel&auml;hnliche Teil und steckt es dorthin, wo es auf dem Interface drauf
war und schlie&szlig;t es zugleich in die Stromversorgungungsbuchse des A1200 an.
<p>
Nun sind wir fast ans Ende angelangt, doch etwas fehlte noch? Das OnBoard
ex ZorroII. Der Einbau hierzu ist das einfachste von allem. Als erstes
steckt man das OnBoardex an die Stelle, wo im A1200 Turbkarten gesteckt
werden und befestigt es dann mit vier Schrauben. Dann nimmt man die beiliegenden P8 u. P9 Kabel und schlie&szlig;t diese an die daf&uuml;r markierte Stelle
des Tastaturinterface`s. Auf dem OnBoard sind auch noch dieselben Anschl&uuml;sse. Somit hat man f&uuml;nf ZorroII Steckpl&auml;tze. Au&szlig;erdem l&auml;st sich weiter-
hin jede PPC Karte nutzen wie wir es hier sehen k&ouml;nnen.<br><img src="../pic/r4.gif" alt="bild">
<p>
Kompatibilit&auml;sliste des ONBoardZII folgt zum sp&auml;teren Zeitpunkt.
<p>
Im Lieferumfang befindet sich noch eine PC Tastatur und f&uuml;r 49.- DM 
Aufschlag gibt es eine A4000 Tastatur.
<p>
RBM Towerhawk 1200ex &#009;        449.- DM
<p>
mit OnBoard&#009;&#009;&#009;699.- DM
<p>
OnBoard alleine&#009;&#009;&#009;299.- DM
<p>
RBM Towerhawk 4000ex<br>
inkl. OnBoard4000&#009;&#009;599.- DM
<p>
<b>Fazit:</b><br>
Der neue RBM Tower ist konkurrenzlos der beste Tower, den es momentan
auf dem Amiga Markt gibt. Mit seinen g&uuml;nstigen Erweitungsm&ouml;glichkeiten
(VideoOn, ZorroIII Aufsatz .....), wird ein A1200 schnell zu einem 
kompatiblen A4000. Jedoch ist der Einbau ist f&uuml;r Anf&auml;nger anfangs etwas
schwer und die Anleitung teilweise unverst&auml;ndlich gewesen. 
Es wird aber alles mitgeliefert, was man f&uuml;r den Einbau ben&ouml;tigt.
Die Erweiterungen liegen laut RBM bei je 150.- DM.<br>
<b><i>- Empfehlenswert - </i></b>
<p>
<i>-sbh- </i>

<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="124.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="107.html">
</MAP>
</center><hr>

</body>
</html>
