<html>
<head>
<title>AMIGA Times 05/98 - Fun &amp; Talk</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><img src="../pic/talk.gif"><hr>
<b>Kommt jetzt die Trendwende?</b>
</center>
<p>
Scheint es jetzt loszugehen? Die vergangenen Tage waren wirklich sehr
ereignisreich, denn einige Entscheidungen wurden zwar noch nicht zu 100%
best&auml;tigt, aber sie r&uuml;cken immer mehr ins Licht und das wird langsam
auch Zeit. Die neuen Info`s zum Amiga OS3.5 und zur eventuellen Version
5.0 sind sch&ouml;n, okay, aber ein neues Betriebssystem macht noch lange
keinen neuen Computer und es ist sogut wie klar, da&szlig; das OS 3.5 eher
mehr ein Update wird. Der f&uuml;r 1999 angek&uuml;ndigte Amiga... wenn er wirklich
erscheinen wird, k&ouml;nnte er unserer Startschu&szlig; in eine neue Zukunft werden?
Es ist auch fraglich, wie lange die User noch bereit sind zu warten, lockt
doch da vor allem der neue Macintosh oder sogar der PC. Wie auch im letzten
Jahr wird die K&ouml;lner Computermesse einiges entscheiden und die eine oder
andere wichtige Information preisgeben, aber was n&uuml;tzen einem Worte, wenn
die Realit&auml;t keine Zeit zum &quot;verarbeiten&quot; dieser l&auml;&szlig;t? Klingt einwenig
komisch, gebe ich zu, aber so ist es doch.
<p>
Neben all diesen fraglichen Dingen und Ger&uuml;chten, gibt es aber auch gutes
zu verk&uuml;nden. Zwei neue Magazin wagen den Start und bringen hoffentlich
etwas Abwechslung und frischen Wind in den eingefahrenen und -man kann
schon sagen- alt eingesessenen Zeitschriftenmarkt, der ja beim Amiga theoretisch nur noch aus 4 Mags besteht. Hier kommt es auch wieder auf Euch an,
denn im Endeffekt entscheidet Ihr mit Eurem Kauf oder Nichkauf &uuml;ber die
Zukunft dieser Publikationen. Wir werden sehen, ich f&uuml;r meinen Teil bin gespannt auf Neuerscheinungen im Herbst und zum Weihnachtsgesch&auml;ft, denn
obwohl einige gute Projekte in der Entstehungsphase eingestellt wurden,
gibt es neue und alte Labels, die uns die Treue halten.
<p>
Dieser Artikel soll Euch nocheinmal nahe bringen, da&szlig; die Computer`98 sehr
wichtig f&uuml;r den Amiga ist und Ihr unbedingt hingehen solltet. Denn wenn die
H&auml;ndler auf ein gutes Ergebnis verweisen k&ouml;nnen, bewei&szlig;t das doch, da&szlig; wir
interesse haben und nicht aufgeben wollen, also wer die Chance hat, sollte
unbedingt bei diesem Event dabei sein.


<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="160.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="177.html">
</MAP>
</center><hr>
</body>
</html>
