<html>
<head>
<title>AMIGA Times 05/98 - Software</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><img src="../pic/softw.gif"><hr>
<b>amiga writer 1.1</b>
</center>
<p>
Wenn ich ehrlich bin, so muss ich sagen, da&szlig; ich mich seit der Ank&uuml;ndigung 
von Amiga Writer auf dessen Erscheinen gefreut habe, wie ein Schulkind. 
Denn Textverarbeitung ist neben den Games meine zweite gro&szlig;e Besch&auml;ftigung 
auf dem Amiga. So waren auch meine Erwartungen sehr hoch
geschraubt, und ich war gespannt ob es eventuell Wordworth, Page Stream
oder Final Writer schlagen k&ouml;nnte. Vor einigen Tagen war es dann soweit,
endlich flatterte unser Testmuster ein. Doch meine Vorfreude wurde schnell
gebremst, denn obwohl Amiga Writer in einer CD Box ausgeliefert wird, umfasst 
das Programm gerade mal 2 Disketten. Dies ist mir vollkommen unverst&auml;ndlich, 
eine Textverarbeitung von `98 m&uuml;&szlig;te eigentlich auf CD erscheinen 
und neben dem Programm, so als Beilage ClipArts und ein Menge Fonts
bieten. Doch weder das eine noch das andere wurde richtig in AmiWriter
gebracht, doch dazu sp&auml;ter mehr.  Startmen&uuml;
<p><img src="../pic/aw_optionen.jpg" alt="bild" width=458 height=264>
<p>
Amiga Writer &ouml;ffnet nach dem Start ein komplett eigenes Window , 
<br><img src="../pic/aw_titelscreen.jpg" alt="bild" width=510 height=441><br>was im Demo
noch nicht der Fall war, dort erschien auf der WB-Oberfl&auml;che das Dokumentfenster 
von Amiga Writer (ab jetzt mit &quot;AW&quot; abgek&uuml;rzt!). Wie bei jeder anderen 
Textanwendung hat man oben die Men&uuml;leiste mit Optionen, wie schneiden,
laden, drucken, &ouml;ffnen, speichern und bei AW steht noch das Einf&uuml;gen diverser 
Textelemente (Uhrzeit, Datum) zur Verf&uuml;gung. Ich klickte auf die Seite
um zu schreiben, der Cursor blinkte und signalisierte mir, das ich loslegen 
k&ouml;nnte. Als ich die ersten Worte geschrieben hatte, nervte mich der
Schriftstil total, denn AW stellt fast in jeder Bildschirmgr&ouml;&szlig;e (also die
Seitengr&ouml;&szlig;e) die Fonts zu pixelig dar, zwar mekrt man davon bei einem guten
Drucker nichts, aber auf dem Screen sieht es nicht gerade toll aus. Nachdem ich ein paar Zeilen verfa&szlig;t hatte, wollte ich diese auch bearbeiten.
W&ouml;rter oder Wortgruppen Kursiv, Fett, Unterstrichen oder anders zu formatieren ist kein Problem, das geht wunderbar und AW bietet hier sogar noch
mehr M&ouml;glichkeiten, doch wenn man den Schriftstil &auml;ndern m&ouml;chte, wird es
ein langer Weg um dies zuerreichen. Standard und sofort w&auml;hlbar sind nur
die Compugraphic Font`s (mei&szlig;t auf 3 begrenzt), m&ouml;chte man mehr einf&uuml;gen,
geht dies nur &uuml;ber das Fontmen&uuml; .
<br><img src="../pic/aw_font-option.jpg" alt="bild" width=490 height=326><br> Hat man es aufgerufen, wird einem die 
komplette Liste aller verf&uuml;gbaren Schriften (die im Workbechn:FONTS/ Verzeichnis drin sind) angezeigt. Nun w&auml;hlt man ein aus, stellt die Gr&ouml;&szlig;e ein
und alle sonstigen Formatierungen. Danach mu&szlig; man &quot;den get&auml;tigten Befehl&quot;
dem Programm &quot;zuweisen&quot;, klingt echt bl&ouml;d und das ist es auch. Wenn man das
nicht getan wird, f&uuml;hrt AW die Ver&auml;nderungen nicht aus, also sowas ist in
keinsterweise benutzerfreundlich, meiner Meinung nach sollte es doch reichen, die &Auml;nderungen auszuf&uuml;hren, auf &quot;Benutzen&quot; oder &quot;Ok&quot; zu klicken und
das Programm f&uuml;hrt die Ver&auml;nderungen aus, aber nein, man mu&szlig; es erst &quot;zu-
weisen&quot;, und egal ob Bild, Text oder sonstige Einstellungen, ohne &quot;zuweisen&quot;, wird so mancher User nicht weit kommen. <u> Grafikimport </u>
<p><img src="../pic/aw_bildverarbeitung.jpg" alt="bild" width=510 height=441>
<p>
Wie Ihr im letzten Bild gesehen habt, ist das Einf&uuml;gen von Grafiken eigentlich recht einfach, klickt man dann zweimal auf das Bild, erscheint das
eben oben gezeigte Men&uuml; und man kann die Gr&ouml;&szlig;e oder die Plazierung &auml;ndern.
Was man allerdings nicht kann und das ist ein eigentlich wichtiger Punkt,
man kann den Hintergrund der Grafik nicht transparent zur Seitenfarbe
machen, d.h. wenn ein Logo, wie das von uns im Hintergrund grau ist, ist
es mit AW nicht m&ouml;glich diesen Hintergrund wegzumachen, so da&szlig; nur noch 
das Logo auf der wei&szlig;en Seite zu sehen ist. Mir unbegreiflich, Wordworth7
bietet da zum Beispiel diese &quot;mit Farbe 0 auff&uuml;llen&quot;-Option, welches einen
Bildhintergrund transparent darstellt. Ob das noch ge&auml;ndert wird wei&szlig; ich
nicht, anzuraten ist es aber auf jedenfall.
<p>
Layout und Texteffeckte! Was bietet Amiga Writer da?
Leicht zubeantworten - kaum etwas! Auch hier ist AW nicht gerade der Favorit, denn Texteffeckte habe ich keine gefunden. Ich konnte weder einen
Satz oder ein Wort als Kreis darstellen oder sonstige &quot;Faxen&quot; mit W&ouml;rtern
anstellen. Andere Programme haben da schon bessere M&ouml;glichkeiten im Angebot, wie zum Beispiel S&auml;tze im Kreis, Bogen, oder schr&auml;g darzustellen.
AW hat sowas &uuml;berhaupt nicht, ich habe weder in der Guide Anleitung etwas
dar&uuml;ber gefunden, noch irgendeinen Befehl im Men&uuml;. Das gleiche mit dem Layout. Obwohl man in der oberen Optionsleiste das Men&uuml; &quot;Layout&quot; eingef&uuml;gt
hat, beschr&auml;nkt sich dies nur auf Text- oder Bildboxen, das ist auch schon
alles, und selbst da kann man kaum etwas in Aktion setzen.  
<p>
Bei all dem meckern, sollte man aber auch ein paar gute Eigenschaften
von AW erw&auml;hnen. AW druckt sehr schnell in einer guten Qualit&auml;t Texte und
Grafiken aus, hier kann man wirklich nichts sagen. Das Anfangsh&auml;ndling, 
welches etwas an PageStream erinnert - das nach dem Start noch kein Textfenster erscheint sondern erstmal ein Men&uuml; - ist keine schlechte Idee und
man kann mit diesem kleinen &quot;Randmen&uuml;&quot; gut arbeiten, aber es m&uuml;&szlig;te erweiterbar sein, man m&uuml;&szlig;te eigene Optionen einf&uuml;gen k&ouml;nnen, geht aber leider
nicht. Ups, ich meckere ja schon wieder, aber Ihr merkt daran, da&szlig; ich
wirklich unzufrieden mit AW bin. Gut ist auch die &quot;Bubble-Help&quot; Funktion,
die in einer &auml;hnlichen Form bei MakeCD wiederzufinden ist. Die Funktion
bewirkt, das ein kleiner Inforahmen erscheint, sobald man die Maus ein paar
Sekunden auf einem Button/Symbol l&auml;&szlig;t, ohne sie zuverschieben. Dadurch
wird ein lesen des &quot;Handbuches&quot; (Online Guide) &uuml;berfl&uuml;ssig, da vieles
erl&auml;utert wird.
<p>
Okay, ich h&ouml;re besser auf, denn auch nach 1500 W&ouml;rtern, w&uuml;rde ich zu keinem
anderen Ergebnis kommen, unten folgend habe ich nochmal schnell die neuen
Funktionen und Verbesserungen aufgelistet.
<p>
Neue F&auml;higkeiten der Version 1.1 umfassen:<br>
&middot;Verbessertes Drucken<br>
&middot;Fontersetzungstabelle<br>
&middot;Multi-Assigns f&uuml;r Fontverzeichnisse<br>
&middot;Bubble-Help Kontrolle<br>
&middot;vollst&auml;ndige Lokalisierung<br>
&middot;verbesserte Anbindung des StormScreenManagers
<p>
 Bug-Fixes und kleinere Verbesserungen
<p>
&middot;Auto-Backup hat das Datei-Icon (.info Datei) falsch behandelt.<br>
&middot;Verbesserung im Busy-Mouse Verhalten insbesondere auf langsameren
 Rechnern.<br>
&middot;Stark verbesserte Speicherverwaltung. Besonders deutlich bemerkbar
 bei Dokumenten mit mehr als 500 Seiten.<br>
&middot;Die neue Speicherverwaltung kl&auml;rt auch einen Bug der zu Stabilit&auml;ts-
 problemen f&uuml;hrte.<br>
&middot;Eingaben von L&auml;ngen/Gr&ouml;&szlig;en/Grad etc. k&ouml;nnen nun auch ohne Einheit
 erfolgen. Es wird die alte Einheit beibehalten und in dieser Einheit
 die Eingabe interpretiert.<br>
&middot;Viel sinnvollere Anwendung des Attributes &quot;Unterstrichen&quot;. Unter-
 streichungen liegen nur noch unter dem Text und gehen nicht mehr
 bis zum linken oder rechten Rand der Box.<br>
&middot;Bislang gingen beim Verschieben eines Tabulators im horizontalen
 Lineal die Einstellungen des Tabulators f&uuml;r das F&uuml;hrungszeichen
 und das Dezimalzeichen verloren. Dieser Fehler ist behoben.<br>
&middot;Dezimaltabulatoren verhalten sich nun viel sinnvoller, wenn das 
 Dezimalzeichen im Text nicht enthalten ist: Der Text wird dann rechtsb&uuml;ndig an den Tabulator formatiert.
<p>
Fazit:<br> Amiga Writer ist in der Version 1.1 nicht das was man von einem
       neuen Programm erwarten kann. Als Betaversion k&ouml;nnte man einige
       Bugs und fehlende Elemente noch etwas verschmerzen, aber bei einer Vollversion nicht. Obwohl ich mit Amiga Writer einiges an
       Texten geschrieben habe und versuchte diese auch zu bearbeiten,
       so mu&szlig;te ich von Zeit zu Zeit feststellen, da&szlig; ich mit Wordworth
       und PageStream zu besseren Ergebnissen komme. Im Gro&szlig;en und Ganzen
       hat es kaum &uuml;berzeugende neue Funktionen, die es von der Masse abhebt und so bleibe ich bis zum Erscheinen der neuen Version bei
       Wordworth und PageStream, die dem User deutlich mehr M&ouml;glichkeiten
       zum Erstellen und Bearbeiten von Texten bieten.<br>
       <i><b>- Befriedigend - </b></i>
<p>
<i>-mn- </i>
<p>
Quelle:<br> Haage &amp; Partner<br>
        <a href="http://www.haage-partner.de">www.haage-partner.de</a>


<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="141.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="ai.html">
</MAP>
</center><hr>

</body>
</html>
