<html>
<head>
<title>AMIGA Times 05/98 - Fun &amp; Talk</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><img src="../pic/talk.gif"><hr>
<b>COOL - in allen Lebenslagen</b><br>
Ein Blitzkurs von Ernst Eisw&uuml;rfel
</center>
<p>     
<b>LEKTION 1: COOL BEIM AUFSTEHEN</b><br>
Easy Baby, ganz easy, null Problemo. Aufstehen ist die einfachste Sache der
Welt. Nur hast Du es bisher garantiert v&ouml;llig falsch angepackt. Ist ja 
logisch, kennst ja den Leitfaden nicht. Macht nix. Lies. Erstmal cool strecken. 
Das hei&szlig;t: Nicht bewegen. Ist n&auml;mlich h&ouml;llisch uncool, sich spastisch
aus dem Bett zu w&auml;lzen. Also: Innerlich strecken, nix anmerken lassen.
Dann: Aufstehen. Aber cool bleiben. Erstmal Sonnenbrille aufsetzen. Wenn die
Gardinen zu sind oder es drau&szlig;en noch dunkel ist, erstmal Licht anmachen. 
Merke: Wirkt uncool, gegen den Kleiderschrank zu laufen. So, schon ganz gut.
Jetzt kommt das Anziehen. Ist auch ganz einfach. Leitsatz: Nicht hingucken. 
Schau irgendwo anders hin und zieh Dich dabei an. Leute, die hingucken,
wenn sie den Rei&szlig;verschluss zumachen, wirken peinlich. Aber Vorsicht: Nichts 
vergessen, wenn Du den Rei&szlig;verschluss zumachst. Du hast es vergessen? Dann 
&uuml;b' es nach der Operation erstmal ohne Sonnenbrille. Bis hierher alles klar?
War ja auch einfach, was, Babe ? Jetzt wird's schwieriger. Pa&szlig; auf. Fr&uuml;hst&uuml;ck 
machen. Wenn Du dabei Fehler machst, kannst Du Dir allerhand verscherzen. 
Die Leute werden Dich nicht mehr ernstnehmen... wer will das schon? Du
nicht. Ich wei&szlig;. Kaffeekochen ist an sich 'ne wahnsinnig uncoole Sache. Es
liegt an Dir, es cool zu machen. Du wirst vermutlich zwei, drei Stunden &uuml;ben
m&uuml;ssen, aber dann sitzt es, und die Frauen werden Dir zu F&uuml;&szlig;en liegen. Du 
wei&szlig;t schon, was ich meine, Honey. Also: Deckel der Kaffeemaschine im Vorbeigehen 
aufmachen, weitergehen zum Kaffeetopf, Kaffeetopf aufmachen, Kaffee
in den Filter kippen (nicht portionieren, am besten gar nicht hinschauen) 
und dann: Filter in die Maschine werfen. Merke hierbei: Je gr&ouml;&szlig;er die Entfernung, 
desto gr&ouml;&szlig;er Deine Coolness. Wenn's klappt. Ansonsten ist es ziemlich 
peinlich. Aber Du packst das schon. Das ganze nennt sich das Erste Eisw&uuml;rflsche Gesetz. 
Wurfweite ist proportional zur Coolness. Entfernung = 0 
Meter, Coolness = 0. Entfernung = 4 Meter, Coolness = unbeschreiblich. 
Wenn's schiefgeht, gilt:  
<p>
<i>Entfernung - 10<br>
--------------------------- = Idiot<br>
potentieller Coolnessfaktor</i>
<p>    
Also: &uuml;ben, &uuml;ben, &uuml;ben. Das hast Du drin, Ich wei&szlig; es. Cool, Baby.  
<p>     
<b>LEKTION 2: COOLNESS IM ALLTAG</b><br>
Aufstehen und den ganzen Quatsch hast Du begriffen. Jetzt raus auf die Stra&szlig;e.  
Alltag. Vielleicht meinst Du, Du bist cool. Lies diesen Ratgeber und Du wei&szlig;t, da&szlig;  
Du l&auml;cherlich gewesen bist. Du warst nichts. Wenn Du dies hier gelesen hast, dann  
bist Du cool...ehrlich echt v&ouml;llig trocken cool. Also: Raus auf die Stra&szlig;e. Und schon  
der erste Fehler: Sonnenbrille beim Gesichtwaschen abgenommen und danach nicht  
wieder aufgesetzt. Wieder zur&uuml;ck, Brille holen, aufsetzen, wieder rausgehen. Du hast  
die Brille beim Gesichtwaschen nicht abgenommen ? Obercool. G&ouml;ttlich. F&uuml;r alles  
gilt jedenfalls: Das Wetter spielt keine Rolle, Brille sogar nachts tragen. Merke:
Ohne Brille ist die Coolness gleich Null. Laufen ist einfach, cool schlendern
nicht. Du mu&szlig;t vermutlich lange &uuml;ben, bis Du es raushast. Deine bisherigen epileptischen 
Bewegungsabl&auml;ufe kannst Du Dir jedenfalls von der Backe wischen. Du musst  
schlendern. V&ouml;llig m&uuml;helos. Darf aber keiner erkennen, da&szlig; Du absichtlich so l&auml;ufst.  
Also: &uuml;ben, &uuml;ben und nochmal &uuml;ben. Jetzt kommen wir zum schwierigsten Teil: Dem  
Umgang mit anderen Menschen. Fangen wir mit dem Busfahrer an. Erstmal in den  
Bus steigen. Dann laut Kaugummi kauen (vor dem Einsteigen zu kauen beginnen,  
sonst wirkt's leicht beknackt). Wichtig: Jetzt lockeren Spruch loslassen. Dir f&auml;llt  
keiner ein? Kein Problem. Geh' in den n&auml;chsten Buchladen und kauf Dir &quot;Lockere  
Spr&uuml;che&quot; von Ernst Eisw&uuml;rfel. Is von mir. Tolles Buch. Selbstredend. Ein Beispiel  
gratis: &quot;Fahren Sie nach Kuba&quot;. Dabei den rechten Zeigefinger auf die Stirn des  
Busfahrers setzen und l&auml;cheln. Dann abdr&uuml;cken und den Rauch vom Finger  
wegblasen. Anschlie&szlig;end zahlen und hinsetzen. Eventuell aufkommenden Applaus  
gelassen hinnehmen oder abwinken. Und: L&auml;cheln, l&auml;cheln, l&auml;cheln. Aber nicht das  
d&auml;mliche L&auml;cheln, das Du sonst draufhast: Cool, Baby, von oben herab, nicht zu breit.  
Noch was: Niemals Geld hinlegen! Das gilt allgemein. Geld immer hochschnippen  
und wieder auffangen. Oder einfach hinwerfen, wenn es jemand haben will: Und zwar  
so, da&szlig; er sich bem&uuml;hen mu&szlig;, um es aufzufangen. Am besten so, da&szlig; er oder sie auf  
dem Boden herumkriechen muss. Du hast schlie&szlig;lich das Recht, anderen Menschen  
zu zeigen, wo ihr Platz ist. Das mit dem Hochwerfen solltest Du vorher zu Hause  
&uuml;ben und dabei immer daran denken, da&szlig; es nur mit M&uuml;nzen funktioniert. Kneipen  
und Cafs. Hier darfst Du keine Fehler machen. Es sehen zu viele Leute zu. Also  
riskier' nichts. Sonnenbrille tr&auml;gst Du sowieso, Geldschnippen hast Du mittlerweile  
auch drauf. Sieht gut aus. Jetzt mu&szlig;t Du sprechen. Das ist schwierig. Du mu&szlig;t  
bestimmte Dinge vermeiden, zum Beispiel: &quot;Bitte&quot; oder andere unterw&uuml;rfige Worte.  
Du bist der Bo&szlig;, alle tanzen nach Deiner Fl&ouml;te, wenn Du wei&szlig;t, was ich meine. Du  
wei&szlig;t es, yeah. Wir verstehen uns. Bisher hast Du gesagt &quot;Eine Cola, bitte&quot;, und das  
ist schlimm. V&ouml;llig falsch, Du redest ja mit der Kellnerin wie mit deinesgleichen.  
V&ouml;llig uncool. Keiner nimmt Dich ernst. Richtig ist: &quot;Coke, Baby&quot;. Zucker, Mann,  
Du machst Dich. La&szlig; Dich nicht durch ihren Blick irritieren. Oder dadurch, da&szlig; sie  
lacht. Sie liebt Dich. Alle Frauen lieben Dich. Und Du wei&szlig;t es. Nun zum  
Kaffeetrinken. Du trinkst Deinen Kaffee mit Milch ? Das ist schlecht. Versuch, Dir  
das abzugew&ouml;hnen. Wenn Du das nicht kannst, beachte folgendes. Es ist  
ausgesprochen uncool, an diesen ekligen Milchd&ouml;schen rumzuzupfen, bis Dir das  
ganze Zeug &uuml;ber die Bundfalte pladdert. Also: Die kleine Plastikmilchdose in die  
Tasse werfen und einmal mit dem L&ouml;ffel reinstechen. Sauber, was? Und cool. Solltest  
Du mit dem Zuckertopf allerdings nicht unbedingt genauso machen. N&auml;chstes Thema.  
Einkaufen. H&ouml;llisch uncool. Es gibt Leute, die keinen haben, der es f&uuml;r sie macht.  
Zum Beispiel Dich. Auch im Supermarkt gilt: Cool bleiben. Man sieht Dich. Also:  
Die Einkaufskarre nicht mit beiden H&auml;nden anfassen und wie Mutter durch den Laden
eiern. Entweder mit einer Hand oder mit dem Fu&szlig; die Karre ab und zu kurz ansto&szlig;en  
oder abstoppen. Aber Vorsicht: Nicht zu heftig. K&ouml;nnte &Auml;rger geben. Die Sachen, die  
Du einkaufst, niemals in den Wagen legen. Immer werfen. Ohne hinzusehen. Wie mit  
der Filtert&uuml;te. Eisw&uuml;rfels Erstes Gesetz gilt auch hier. Vorsicht bei Milcht&uuml;ten,  
Flaschen und Eiern. Feeling, Baby. Zahlen funktioniert wie im Bus. Nur nicht mit  
demselben Spruch. Mach kein' Quatsch. Immer Trinkgeld geben. Cool, Baby!  
<p>   
<b>LEKTION 3: Cool am Abend</b><br>
Die elementarsten Dinge hast Du schon gelernt. Sonnenbrille, Geld hochschnippen,  
nicht reden. Schlendern kannst Du mittlerweile auch. Schon ganz gut. Jetzt kommen  
die &Uuml;bungen f&uuml;r Fortgeschrittene.  
<p>    
1. Stehen: Du glaubst, das ist einfach. Is nich. Ist wahnsinnig schwierig. Du  
stehst ja nicht einfach so rum und wartest auf den Bus. Du wei&szlig;t, was Du bist.  
Zeig's ihnen. Kopf hoch, Brust raus, Bauch rein, Unterk&ouml;rper raus, Beine  
m&ouml;glichst gekreuzt (gespreizt geht notfalls auch). Wenn dich jemand fragt, ob  
Du einen Unfall hattest, einfach ignorieren. Zu Hause dann weiter &uuml;ben.  
<p>   
2. Trinken: Trinken ist einfach. Allerdings solltest Du kein Bier, Wein oder  
andere Proletengetr&auml;nke ordern, sondern irgendwas, was der Barkeeper nicht  
kennt. Schau ihn herablassend an und vergewissere Dich, da&szlig; alles staunt. La&szlig;  
Dich dann zu irgendwas &uuml;berreden, was Du Dir leisten kannst. Also Bier.  
Die Glashaltung ist extrem wichtig. Du kannst das Ding nicht halten wie die  
Senfgl&auml;ser bei Dir zu Hause. Zeige Stil. Halte das Glas so schr&auml;g, da&szlig; das  
Getr&auml;nk fast rausl&auml;uft und gestikuliere wie ein Wahnsinniger. Obercool. Wenn  
es klappt. Wenn nicht, bist Du untendurch und Deine Zuschauer sind na&szlig;.  
Hierbei gilt:  
<p>    
<i> Glasneigung + Gestikulierradius = Coolnessfaktor </i><br>
Wenn irgendjemand na&szlig; wird:<br>
<i>Coolnessfaktor<br>
---------------- = Idiot<br>
Reinigungskosten</i>
<p>       
3. Frauen: Jetzt also das wichtigste Kapitel. Warum seid ihr cool? Eben. Wenn  
ihr euch an die Tips oben haltet, habt ihr schon ganz gute Karten. Aber: Es  
gibt noch speziellere Dinge. Die Frauen lieben Dich, wenn Du cool bist, Baby.  
Und das willst Du. Ich wei&szlig; es. Und es gibt einfache Regeln. Leits&auml;tze. Wenn  
Du wei&szlig;t, was ich meine. Lies.  
<p>    
1. Ansprechen: Ist schwierig. Du solltest nicht reden. Also la&szlig; es. L&auml;chle  
sie an. Wink ihr zu. Nimm sie mit. Wenn keiner in der N&auml;he ist, fang  
an zu reden. Aber nicht zuviel. Du wirkst sonst leicht &ouml;de. Das wei&szlig;t  
Du. Zeig ihr Dein Auto. Wenn Du keins hast, sag, da&szlig; es gerade  
repariert wird und nenn den Preis. Nicht unter 2.000 Mark anfangen.  
Wirkt sonst nicht. Wenn sie sagt, da&szlig; das zu teuer ist: Abwinken.  
lachen. Erz&auml;hl ihr von Deinen letzten Aktienverlusten und da&szlig; es Dir  
egal sein kann. Wirkt totsicher. Wenn nicht: Neue Frau abschleppen.  
<p>      
2. Abschleppchancen: Ganz einfache Regel. Bi&szlig;chen Mathe. Aber nicht  
schwer zu kapieren. Du packst das schon. Die Komponenten sind das  
Alter (A), die Anzahl der Freundinnen (aF) und die Kosten der  
Aufmachung der Braut, die Du abschleppen willst. Dabei gilt :
<p>
(Zweites Eisw&uuml;rfelsches Gesetz):
<p>       
<i>Kosten der Aufmachung<br>
A - aF - --------------------- = X%<br>
100</i>
<p>             
Wenn Du also eine Hundertj&auml;hrige im Tweedkost&uuml;m, die ohne  
Freundinnen daherkommt, abschleppen willst, betragen Deine  
Chancen ungef&auml;hr 100%. Aber das willst Du nicht. Seh' ich Dir an,  
Baby. Du willst junges Blut. Und Fleisch. Und so weiter. Ferkel. Aber  
cool. &Uuml;brigens: Wenn A kleiner oder gleich 13 ist, dann ist X  
automatisch = Idiot.  
<p>       
3. Der weitere Abend: Du kannst lesen. Wenn Du so alt bist wei&szlig;t Du  
auch, was weiter passiert. Ich seh' Dir in die Augen, Kleines. Oh yeah,  
Mann. Ach ja, nimm die Sonnenbrille nicht ab. Du bist cool. Du hast  
es. Relaxed. 
<p>        
Oh, nichts zu danken. Hab' Dir gern'n paar Tips gegeben, Babe. Mach weiter so. Ach
ja. Eins noch: Verleih die Tips nicht. Das ist ausgesprochen oberuncool und macht
mich krank, wenn Du wei&szlig;t, was ich meine. Wahrscheinlich nicht. Du hast noch viel
zu lernen. Aber Du bist auf dem richtigen Weg. Echt ehrlich.
<p>
<i>-rs- </i>


<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="177.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="402.html">
</MAP>
</center><hr>
</body>
</html>
