<html>
<head>
<title>AMIGA Times 05/98 - AT - Intern</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">



<center><img src="../pic/atintern.gif"><hr>
<i><b>An alle Firmen, Distributoren, Computerclubs &amp; Mailboxen!!! </b></i>
</center>
<p>

Sehr geehrte Damen und Herren,
<p>
Sie werden es sicherlich auch schon mitbekommen haben, Amiga Zeitschriften
verlassen nach und nach den Markt und wir User m&uuml;ssen uns notgedrungen neue
Mags am Kiosk suchen, jedoch mu&szlig; man wirklich &uuml;berall suchen, da man AMIGA
Magazine an einer Hand abz&auml;hlen kann. Im Internet sieht dies wieder ganz
anders aus. Hier gibt es allerhand neue und alte Magazine, die gro&szlig;e
Nachfrage bei den Lesern finden. Eines dieser Magazine, ist die &quot;Amiga
Times&quot;, 
<p>
Leider wird es f&uuml;r uns immer schwerer gerade im Anwendungs- und Spielebereich 
zuberichten, da auch wir kaum an neue Software kommen, was einerseits 
daran liegt das wir ein Freeware-Mag sind und somit alle Kosten,
die bei einer Ausgabe entstehen (zwischen 100 DM und 250 DM!!! - Online
Kosten) selber tragen und dadurch kaum noch Geld da ist, um auch noch
die neuste Software zu kaufen. Im Hardwarebereich sieht es da nicht anders
aus. Wir kaufen zwar ab und zu neue Software und Hardware, aber trotzdem
sind wir meist auf Ger&uuml;chte und Demos angewiesen, doch Sie k&ouml;nnen das &auml;ndern.
Unterst&uuml;tzen Sie ein aufstrebendes Magazin, schicken Sie uns Software oder
Harwdware zum Testen und als Gegenleistung bekommen Sie von uns einen ganzen
Link f&uuml;r Ihre Werbung (max. 10 KB Txt, max. 30 KB Grafik (gif)), sowie einen
ausf&uuml;hrlichen Test.
<p>
An die Computerclubs und Mailboxen!
<p>
Sie k&ouml;nnen bei uns kostenlos f&uuml;r Ihre Box/Ihren Club werben und werden
zuk&uuml;nftigt keinen Pfennig bezahlen m&uuml;&szlig;en. Wir w&uuml;rden uns aber
freuen, wenn sich Mailboxen dazu entschlie&szlig;en, f&uuml;r die Amiga Times
ein Support Brett einzurichten, auf welchen dann die bereits bestehenden
und die neusten Ausgaben verf&uuml;gbar sind. Und wenn Computer Clubs vielleicht
auf ihren Club Disketten (wenn es welche gibt) die neuste Ausgabe der
Amiga Times beilegen!
<p>
Ich danke Ihnen f&uuml;r Ihre Aufmerksamkeit.
<p>
Ihr Mario Nitschke


<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="108.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="222.html">
</MAP>
</center><hr>
</body>
</html>
