<html>
<head>
<title>AMIGA Times 05/98 - Fun &amp; Talk</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><img src="../pic/talk.gif"><hr></center>
Eine M&auml;rchenstunde f&uuml;r Informatiker<br>
<b>Rotk&auml;ppchen</b><br>
(wie der Informatiker es seinen Kindern erz&auml;hlt)
<p>
Es war einmal ein kleines s&uuml;&szlig;es M&auml;dchen, das immer ein K&auml;ppchen aus rotem Samt
trug. Aufgrund dieses Attributes erhielt es ein Assign unter dem symbolischen Namen
Rotk&auml;ppchen. Eines Tages sprach die Mutter: &quot;Rotk&auml;ppchen, die Gesundheit deiner
Gro&szlig;mutter hat einen Interrupt bekommen. Wir m&uuml;ssen ein Pflegeprogramm
entwickeln und zur Gro&szlig;mutter bringen, um das Problem zu l&ouml;sen. Verirre dich jedoch
nicht im Wald der alten Sprachen, sondern gehe nur strukturierte Wege. Nutze dabei
immer eine Hochsprache der vierten Generation, dann geht es der Gro&szlig;mutter schnell
wieder gut. Und achte darauf, da&szlig; dein Pflegeprogramm transaktioniert ist, damit es
deine Gro&szlig;mutter nicht noch mehr belastet.&quot; Da der Weg zur Gro&szlig;mutter reentrant
war, traf Rotk&auml;ppchen den Wolf. Er tat sehr benutzerfreundlich, hatte im Background
jedoch schon einen Abbruch programmiert. W&auml;hrend Rotk&auml;ppchen einen GO TO ins
Blumenfeld machte, ging der Wolf im Direktzugriff zur Gro&szlig;mutter und vereinnahmte
sie unverz&uuml;glich durch einen Delete. Ohne zu z&ouml;gern gab er sich den Anschein
kompatible zu sein, und nahm die logische Sicht der Gro&szlig;mutter an. Dann legte er sich
in ihren Speicherplatz.<br>
Kurz danach lokalisierte auch Rotk&auml;ppchen die Adresse der Gro&szlig;mutter und trat in den
Speicherraum. Vor der Installation des Pflegeprogramms machte Rotk&auml;ppchen
sicherheitshalber einen Verify, sie fragte: &quot;Ei Gro&szlig;mutter, warum hast Du so gro&szlig;e
Augen?&quot; - &quot;Weil ich zufriedene Endbenutzer gesehen habe.&quot;  &quot;Ei Gro&szlig;mutter, warum
hast Du so gro&szlig;e Ohren ?&quot; - &quot;Damit ich die W&uuml;nsche der User besser verstehen kann.&quot;
&quot;Ei Gro&szlig;mutter, warum du so ein entsetzlich gro&szlig;es Maul ?&quot; - &quot;Damit ich dich besser
Canceln kann !&quot;<br>
Sprach's und nahm das arme Ding als Input. Nach einem Logoff begab sich der Wolf
zur Ruhe, schlief ein und begann laut zu schnarchen. Als der J&auml;ger auf seinem Loop
durch den Wald am Haus der Gro&szlig;mutter vorbeikam, sah er durch ein Window den
Wolf im Bett liegen. &quot;Finde ich Dich hier, du alter S&uuml;nder&quot;, sprach er, &quot;ich habe Dich
lange gesucht !&quot; Als Kenner der Szene analysierte er sofort, da&szlig; nach den Regeln der
boolschen Algebra die Gro&szlig;mutter nur im Bauch des Wolfes sein konnte. Er nahm sein
Messer, teilte den Bauch des Wolfes in mehrere Sektoren, und machte, welch Freude,
die Gro&szlig;mutter und das Rotk&auml;ppchen wieder zu selbst&auml;ndigen Modulen.
Als Input f&uuml;r den Bauch des Wolfes nahmen sie viele Kilobyte Steine und beendeten
die Operation mit einem Close. Als der Wolf erwachte, verursachte ihm sein derma&szlig;en
aufgebl&auml;hter Hauptspeicher solche Schmerzen, da&szlig; er an einer Storage Violation
j&auml;mmerlich zugrunde ging. Da waren alle vergn&uuml;gt. Das Pflegeprogramm aktivierte die
Gro&szlig;mutter. Rotk&auml;ppchen aber dachte: &quot;Du wirst dein Lebtag nie wieder einen
GoTo machen, sondern nur noch strukturierte Wege gehen, wie dir's die Mutter
geboten hat.&quot;
<p>
<i>-rs- </i>


<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="402.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="101.html">
</MAP>
</center><hr>
</body>
</html>
