<html>
<head>
<title>AMIGA Times 05/98 - Fun &amp; Talk</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><img src="../pic/talk.gif"><hr></center>
<b>Rotk&auml;ppchen auf Amtsdeutsch</b>
<p>
Im Kinderfall unserer Stadtgemeinde ist eine hierorts wohnhafte, noch
unbeschulte Minderj&auml;hrige aktenkundig, welche durch ihre un&uuml;bliche
Kopfbekleidung gewohnheitsrechtlich Rotk&auml;ppchen genannt zu werden pflegte.<br>
Der Mutter besagter R. wurde seitens ihrer Mutter ein Schreiben zustellig
gemacht, in welchem dieselbe Mitteilung ihrer Krankheit und
Pflegebed&uuml;rftigkeit machte, der Grossmutter eine Sendung von Nahrungs- und
Genussmitteln zu Genesungs zwecken zuzustellen. Vor ihrer Inmarschsetzung
wurde die R. seitens ihrer Mutter &uuml;ber das Verbot betreffs Verlassens der
Waldwege auf Kreisebene belehrt. Dieselbe machte sich infolge Nichtbeachtung
dieser Vorschriftstraf f&auml;llig und begegnete beim &Uuml;bertreten des amtlichen
Blumenpfl&uuml;ckverbotes einem polizeilich nicht gemeldeten Wolf ohne festen
Wohnsitz. Dieser verlangte in gesetzeswidriger Amtsanmassung Einsicht in das
zu Transportzwecken von Konsumg&uuml;tern dienende Korbbeh&auml;ltnis und traf in
T&ouml;tungsabsicht die Feststellung, dass die R. zu ihrer verschw&auml;gerten und
verwandten, im Baumbestand angemieteten Grossmutter eilend war.<br> Da
wolfseits Verknappung auf dem Ern&auml;hrungssektor vorherrschend war, fasste er
den Entschluss, bei der Grossmutter der R. unter Vorlage falscher Papiere
vorsprachig zu werden. Weil dieselbe wegen Augenleidens krank geschrieben
war, gelang dem in Fressvorbereitung befindlichen Untier die diesfallsige
T&auml;uschungsabsicht, worauf es unter Verschlingung der Bettl&auml;gerigen einen
strafbaren Mundraub zur Durchf&uuml;hrung brachte. Ferner t&auml;uschte das Tier bei
der sp&auml;ter eintreffenden R. seine Identit&auml;t mit der Grossmutter vor, stellte
ersterer nach und in der Folge durch Zweitverschlingung der R. seinen
T&ouml;tungsvorsatz unter Beweis. Der sich auf einem Dienstgang befindliche und
im Forstwesen zust&auml;ndige Waldbeamte B. vernahm Schnarchger&auml;usche und stellte
deren Urheberschaft seitens des Tiermaules fest.<br> Er reichte bei seiner
vorgesetzten Dienststelle ein T&ouml;tungsgesuch ein, das dortseits zuschl&auml;gig
beschieden und pro Schuss bezuschusst wurde. Nach Beschaffung einer
Pulverschiessvorrichtung zu Jagdzwecken gab er in wahrgenommener Einflussnahme
auf das Raubwesen einen Schuss ab. Dieses wurde in Fortf&uuml;hrung der
Raubtiervernichtungsaktion auf Kreisebene nach Empfangnahme des Geschosses
ablebig.<br> Die gespreitzte Beinhaltung des Totgutes weckte in dem Schussgeber
die Vermutung, dass der Leichnahm Menschenmaterial beinhalte. Zwecks
diesbez&uuml;glicher Feststellung &ouml;ffnete er unter Zuhilfenahme eines Messers den
Kadaver zur Totvermarktung und stiess hierbei auf die noch lebhafte R. nebst
beigehefteter Grossmutter.<br>
Durch die unverhoffte Wiederbelebung bem&auml;chtigte sich beiden Personen ein
gesteigertes, amtlich nicht zul&auml;ssiges Lebensgef&uuml;hl, dem sie durch groben
Unfug, &ouml;ffentliches Aergernis erregenden L&auml;rm und Nichtbeachtung anderer
Polizeiverordungen Ausdruck verliehen, was ihre Haftpflichtigmachung zur
Folge hatte. Der Vorfall wurde von den kultur schaffenden Gebr&uuml;dern Grimm
zu Protokoll genommen und starkbekinderten Familien in M&auml;rchenform
zustellig gemacht.<br>
Wenn die Beteiligten nicht durch Hinschied abgegangen und in Fortfall
gekommen sind, sind dieselben derzeitig noch lebhaft.
<p>
<i>-rs- </i>

<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="191.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="401.html">
</MAP>
</center><hr>
</body>
</html>
