<html>
<head>
<title>AMIGA Times 05/98 - AT - Spieleteil</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0 text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><img src="../pic/games.gif"><hr>
<b>Biing! CD-Version</b>
</center>
<p>
Wer kennt sie eigentlich nicht, die erotischste, witzigste und sardistischste 
Wirtschaftssimulation die es je  f&uuml;r den Amiga gab?! 
Biing! - Sex, Intrigen &amp; Skalpelle erschien 1995 und ist bis heute einzigartig 
geblieben. Ich w&uuml;rde fast sagen, da&szlig; Biing! damals eine kleine
Hardwarerevolution ausgel&ouml;st hat, denn ein Spiel was mindestens 4 MB Ram
und 2 MB Chip Ram, sowie Festplatte ben&ouml;tigt hat, gab es noch nie zuvor.
Ich hatte mir damals die A500 Version gekauft und hatte enorme Probleme,
da ich gerade mal 1 MB Chip Ram hatte. Tja und danach hatte ich aufger&uuml;stet, 
wie vielleicht auch der ein oder andere. Und nach Biing! erschienen 
&ouml;fter Games mit h&ouml;herer Hardwarevoraussetzung, was ich gut fand
und was man heute wieder bei clickBOOM vorfindet. Als ich dann erfahren
habe, da&szlig; Biing! jetzt auch auf CD auf den Markt kommt (von Magic Bytes
schon vor Jahren als CD Version angek&uuml;ndigt), hoffte ich auf neue Features
und einer &Uuml;berarbeitung der Grafik u.v.m.<br>
Leider war dem nicht so, Biing! in der CD Version ist praktisch die &quot;Ur-
Version&quot; einfach auf CD gepresst, was den einzigen Vorteil hat, da&szlig; die
langwierige Installation wegf&auml;llt. Grafik, Sound... einfach alles ist,
wie es 1995 war. Verkosoft hat sich die Lizenz geholt, und (so vermute ich)
eine auf HD installierte Version auf CD gepresst. Ich habe nichts dagegen,
aber da frage ich mich, wer soll das kaufen?
<p>
Was ist Biing! ??? Kenne ich garnicht!<br>
Das soll es auch geben. Nun Biing! ist in erster Linie eine Wirtschaftssimulation. 
Ziel des Spieles ist es ein Krankenhaus zu f&uuml;hren und reichlich
Kohle (im Spiel &quot;L&uuml;mmel&quot; genannt) machen. Man f&auml;ngt von null an, man mu&szlig;
sich Behandlungszimmer mieten oder kaufen, &Auml;rzte aller Art und Krankenschwestern 
einstellen und vieles mehr. Doch bei Biing! l&auml;uft alles ein
wenig anders. Hier z&auml;hlen sardistische Spiele mit den Patienten, &uuml;berteuerte 
Behandlungen und Krankenschwestern mit ein sehr gro&szlig;en Oberweite.
Im K&auml;seblatt (Tagezeitung) stehen dann immer Neuigkeiten von deinem oder
anderen Krankenh&auml;usern, gute Ausstattung oder gro&szlig;e Oberweiten beim weiblichen 
Personal werden ebenfalls erw&auml;hnt und sorgen f&uuml;r einen guten Ansturm von 
Patienten. Biing! ist Spa&szlig; pur, dort ist ein Wechsel von Sardismuss, 
Witz und Erotik an der Tagesordnung, Rennfahrten um Patienten,
Strip im Wartezimmer, Fehlbehandlungen, alles das, was in einem richtigen
Krankenhaus zu Kritik f&uuml;hren w&uuml;rde, bringt bei Biing! den gr&ouml;&szlig;ten Erfolg
und genau darin liegt der Spa&szlig;. Biing! zu zocken ist eine gelungende Abwechslung 
vom Alltag. Schon allein die Krankenbl&auml;tter sind &uuml;berwitzig geschrieben, 
das n&ouml;tige Personal wei&szlig; gerade mal, wie sie sich die Schuhe
zubinden kann. Obwohl Biing! teilweise zu schwer ist, kommt man kaum davon los. 
Neben guten Soundsamples (gest&ouml;hne, schreiende Patienten, lachende &Auml;rzte), 
netten Animationen (teilweise unter der G&uuml;rtellinie) ist 
auch die Grafik nicht zu kurz gekommen. Insgesamt ein tolles Spiel.
<p>
Fazit:<br> An Biing! hat sich ja nichts ver&auml;ndert, man hat im Grunde nur alle
       Disketten auf CD gepresst, die langwierige Installation entf&auml;llt
       somit. Man kann theoretisch sofort spielen, jedoch sollte man die
       20 - 35 MB (ECS/AGA) auf die Festplatte ziehen, damit man einen
       besseren Spielflu&szlig; erlebt. Den Preis von knapp 70 DM f&uuml;r die ECS
       und ungef&auml;hr 80 DM f&uuml;r die AGA Version ist aber nicht gerechtfertigt, 
denn das Spiel ist 3 Jahre alt und unver&auml;ndert. Vergleichsweise 
sollte ich erw&auml;hnen, da&szlig; MaxDesign ihr Spiel Oldtimer ebenfalls 
auf eine CD gepresst haben (schon vor &uuml;ber einem Jahr)
       - ECS &amp; AGA Version - und diese gerade mal f&uuml;r 30 - 40 DM angeboten haben, was in meinen Augen ein fairer Preis ist (habe es 
       sogar schon f&uuml;r 20 DM gesehen). Wer Biing! noch nicht hat, sollte
       zur CD Version greifen, denn das Spiel ist einfach genial, nur der
       Preis sollte um mindestens 20,- DM gesenkt werden, da ich annehme,
       da&szlig; niemand 70 oder 80 DM f&uuml;r ein 3 Jahre altes Spiel ausgibt - 
       Ausnahmen best&auml;tigen die Regel! <i><b>- Gut - </b>
<p>
<i>-mn- </i>
<p>
Quelle:<br> Verkosoft<br>
        <a href="http://www.verkosoft.de">http://www.verkosoft.de</a><br>
        <a href="mailto:vks@verkosoft.de">vks@verkosoft.de</a><br>
        Tel.: 04181 8892


<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="152.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="mag.html">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="161.html">
</MAP>
</center><hr>
</body>
</html>
