<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. AMIGA und Haage &amp; Partner gehen strategische Partnerschaft ein</H2>
<P>
AMIGA und Haage &amp; Partner informieren:
</P>
<P>
&raquo;Amiga Inc. und Haage&amp;Partner k&uuml;ndigen den Weg in die Zukunft an.
</P>
<P>
11. Februar 2000 - Maple Valley, WA Amiga Inc und Haage&amp;Partner sind
erfreut, eine umfangreiche und langfristige strategische Partnerschaft zur
F&ouml;rderung des bestehenden und zuk&uuml;nftigen Amiga bekanntgeben zu k&ouml;nnen.
</P>
<P>
'Diese Ank&uuml;ndigung erfreut uns besonders.' sagt Bill McEwen, CEO und
Pr&auml;sident von Amiga Inc. 'Haage&amp;Partner sind eine der St&uuml;tzen der Amiga-
Gemeinschaft und sie haben in den letzten f&uuml;nf Jahren vieles zu deren
&Uuml;berleben beigetragen. Mit der Partnerschaft k&ouml;nnen wir nicht nur einen
glatten und hoffentlich nahtlosen &Uuml;bergang f&uuml;r die Classic-Gemeinschaft
garantieren, sondern uns letztendlich vorw&auml;rtsbewegen, um die Technologien
von morgen zu nutzen und zu definieren.
</P>
<P>
'Wir sind seit vielen Jahren im Amiga-Bereich, weil es eine wunderbare
Plattform ist.' sagt Markus Nerding, einer der Gesch&auml;ftsf&uuml;hrer von
Haage&amp;Partner. 'Nachdem wir die neuen Pl&auml;ne und Technologien sahen, an
denen Amiga Inc. arbeitet, waren wir beeindruckt, wie sie den Geist des
bestehenden Amiga erfa&szlig;t und weiterentwickelt haben. Wir werden mit ihnen
zusammenarbeiten um die Kompatibilit&auml;t mit der Classic-Software zu
gew&auml;hrleisten und um den Amiga mit aufregenden neuen Softwareprodukten
voranzubringen.'
</P>
<P>
Amiga Incorporated widmet sich der Entwicklung, Design und Implementation
von Komponenten, Diensten und Modellen, die das digitale Erlebnis von
morgen zum Ziel haben. Amiga f&uuml;hrte in den fr&uuml;hen 80er Jahren die Welt in
das Multimedia-Zeitalter und will es jetzt in das digitale Universum
f&uuml;hren. Kontakt unter 425-413-2620 oder via Internet www.Amiga.com und
www.Amiga.de.
</P>
<P>
Haage&amp;Partner ist der f&uuml;hrende Hersteller von Entwicklungssystemen und
Anwendungen f&uuml;r Amiga Computer. Die Storm-Reihe f&uuml;r 68K und PowerPC biete
leistungsstarke Entwicklungswerkzeuge. Ihr Ziel ist es, dem Amiga-Markt die
leistungsf&auml;higsten Werkzeuge und Anwendungen zur Verf&uuml;gung zu stellen.
Kontakt unter HAAGE&amp;PARTNER Computer GmbH, Schlossborner Weg 7, 61479
Glashuetten, Germany, Tel: +49-6174-966100, Fax: +49-6174-966101,
www.haage-partner.com.&laquo;
</P>
<P>
Im Prinzip verbietet es sich, Urteile &uuml;ber Presseerkl&auml;rungen abzugeben,
aber ich frage mich, ob man den Inhalt der vorliegenden nicht auch in ein
bis zwei S&auml;tzen h&auml;tte unterbringen k&ouml;nnen...
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
