<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Neues von AMIGA</H1>
<H2>1. Fleecy Moss nennt Details zu den Amiga-Pl&auml;nen</H2>
<P>
Mit jedem neuen AMIGA-Management hat sich in der Vergangenheit auch die
Informationspolitik des Unternehmens ge&auml;ndert, mal zum Positiven, mal zum
weniger Guten.
</P>
<P>
Von der jetzigen F&uuml;hrung werden ab und zu Presseerkl&auml;rungen herausgegeben,
die interessantesten Informationen kommen aber vor allem bei Internet-Chats
und durch Usenet-Postings ans Licht.
</P>
<P>
Gernod Schomberg hat deshalb die wichtigsten Details zu den Pl&ouml;nen AMIGAs,
die Vizepr&auml;sident Fleecy Moss in den letzten Wochen in zwei Chat-Runden des
Internet-Dienstes AmigaZone preisgegeben hat, zusammengetragen:
</P>
<UL>
<LI> Zur Zeit wird am Entwicklersystem gearbeitet. Die Amiga-Mannschaft
  trainiert bei Tao, Entwurfarbeiten haben begonnen. Mit Hardware-Partnern
  wurden Gespr&auml;che aufgenommen.
</LI>
<BR><LI> Das Entwicklerger&auml;t wird bereits innerhalb der n&auml;chsten Monate
  erscheinen. Damit geht AMIGA ein Risiko ein, denn es wird noch nicht viel
  von AMIE, dem neuen Amiga, zu sehen sein, weil sich dieser ja noch in der
  Entwicklung befindet, aber es wird doch etwas sein, womit man schon
  arbeiten kann.
</LI>
<BR><LI> Das Entwicklersystem kann von jedermann gekauft werden. Eingetragene
  Entwickler erhalten Unterst&uuml;tzung. Ein Termin daf&uuml;r ist vorgesehen, aber
  der wird noch nicht bekannt gegeben.
</LI>
<BR><LI> AMIGA selbst wird keine Hardware herstellen, es ist ein
  Softwareunternehmen. OEM-Partner haben verschiedene M&auml;rkte ins Auge
  gefasst, und jeder hat seine eigenen Vorstellungen. Die Tao-Umgebung
  bietet Unabh&auml;ngigkeit von der Hardware und erm&ouml;glicht es den Herstellern,
  zu entwickeln, was sie wollen.
</LI>
<BR><LI> AMIGA hofft, dass die Endkundenger&auml;te auf x86- und PPC-Basis vor Ende des
  Jahres auf den Markt kommen werden. Es sind Unternehmen interessiert, die
  alle Bereiche abdecken wollen. Angestrebt werden Verkaufspreise ab 499
  US-Dollar.
</LI>
<BR><LI> AMIGA steht in Verbindung mit Herstellern f&uuml;r Grafikkarten, die SH4 und
  ARM in Verbindung mit PVR3 im Auge haben.
  (SH4 - Prozessor von Hitachi;
  ARM - Allzweck-Processor;
  PVR - ein NEC-Videologic-Grafik-Chipsatz, PVR2 ist in Dreamcast
  enthalten. Einzigartiges Design, das Skalierung von niedriger bis
  h&ouml;chster Qualit&auml;t erlaubt.)
</LI>
<BR><LI> AMIE l&auml;uft &uuml;ber Linux, wegen dessen einmaliger F&auml;higkeiten, aber es wird
  ein eigenes natives System sein. Bill McEwen hat mit Corels Pr&auml;sidenten
  gesprochen - sie sind immer noch sehr an einer Zusammenarbeit
  interessiert.
</LI>
<BR><LI> Das verwendete Realtime-OS (Echtzeit-Betriebssystem) hat einen virtuellen
  Prozessor, so dass die Tao-Bin&auml;rcodes auf jeder Umgebung laufff&auml;hig sind,
  wo der virtuelle Prozessor l&auml;uft.
</LI>
<BR><LI> Es bestehen gute Aussichten, dass man bald in den n&auml;chsten Computerladen
  geht und Amiga-Zeug kauft, wenn das gelingt, was AMIGA vorhat. Wenn
  Treiber in Java oder Taos V(irtual)P(rocessor)-Code geschrieben w&uuml;rden,
  h&auml;tten wir diese M&ouml;glichkeit.
</LI>
<BR><LI> Geschwindigkeit wird durch Taos transparentes Multi-Prozessor-System
  geboten. Es wird nach einer Technologie gesucht, die schnelles Internet
  mit voller Interaktivit&auml;t bietet.
</LI>
<BR><LI> Treiber: Das Problem k&ouml;nnte darin bestehen, dass AMIGA mehr Zeit damit
  zubringt, Treiber zu schreiben, als das Kernprodukt zu entwickeln. Was
  ben&ouml;tigt wird, ist ein vereinheitlichtes Treibermodell - AMIGA hofft,
  dass HAVi dies erm&ouml;glichen wird. Schlie&szlig;lich will jeder etwas, auf dem
  alle Anwendungen laufen k&ouml;nnen, gleichg&uuml;ltig f&uuml;r welches OS oder welchen
  Prozessor sie geschrieben wurden.
</LI>
<BR><LI> Es besteht die Absicht, eine Gruppe zusammenzuf&uuml;hren, die einen &quot;Wunder&quot;-
  Emulator schreibt, der direkten Zugriff auf das OS und Chip-Quellen hat.
  Weiterhin laufen Gespr&auml;che mit Haage &amp; Partner &uuml;ber m&ouml;gliche Wege, die
  Abwanderung von Entwicklern wegen Hardware-gebundener APIs zu bremsen und
  schlie&szlig;lich diese APIs in der neuen Maschine zu vereinigen. Dazu bietet
  die BoXeR-Technologie eine einzigartige Gelegenheit, beide Systeme
  nebeneinander laufen zu lassen. Man spricht bereits mit einem Unternehmen
  an der Westk&uuml;ste &uuml;ber ein solches Projekt.
</LI>
<BR><LI> Haage &amp; Partner hat angek&uuml;ndigt, Produkte f&uuml;r den neuen Amiga zu schaffen
  und mit AMIGA bei der Entwicklung eines Classic-Emulators
  zusammenzuarbeiten.
</LI>
<BR><LI> AMIGA hat nun ein Entwicklerteam (etwa ein Dutzend), einen Manager mit
  Mannschaft (14) f&uuml;r die Unterst&uuml;tzung der Entwickler, der AAC (Amiga
  Advisory Council) hat die Arbeit wieder aufgenommen, es wird versucht,
  das ADN (Amiga Dealers Network) wieder in Gang zu bringen, die neue
  Website ist fast fertig, und man arbeitet an etwas sehr Feinem.
</LI>
<BR><LI> Namen werden bekanntgegeben, sobald die neue Website online gegangen ist.
  Der neue Direktor f&uuml;r Entwickler-Unterst&uuml;tzung ist jemand, den alle
  kennen und m&ouml;gen. Mehr kann noch nicht offen gelegt werden. Auf der
  Website werden alle Ver&ouml;ffentlichungen erscheinen.
</LI>
<BR><LI> Es gibt neue B&uuml;ror&auml;ume, ein neuer Vice President of Operations ist im
  Amt, ein wirklich cooler und flotter Typ namens Vince Pfeiffer, und die
  letzte Trainingsrunde in Seattle ist abgeschlossen.
</LI>
<BR><LI> Viele Mitglieder des neu eingestellten Amiga-Teams kennen sich in
  der Gemeinschaft aus, aber au&szlig;er Dean (Dean &quot;DKB&quot; Brown) ist keiner aus
  den alten Tagen dabei (und Dean ist dar&uuml;ber sehr &auml;rgerlich). Warum?
  Zeiten &auml;ndern sich, Pl&auml;ne &auml;ndern sich, Antriebe &auml;ndern sich. Diese Leute
  leben ihr Leben, haben Geld, und es muss weitergehen. Und Dean war vor
  ihnen da und stand ihnen sehr nahe.
</LI>
<BR><LI> Das AMIGA-Team arbeitet an einer formellen Entwicklungs-Pipeline, die als
  Design-by-Contract (DbC) (= Entwurf mit Vertrag) arbeitet.
</LI>
<BR><LI> AMIGA hat eine Liste von Amiga-Entwicklern, die f&uuml;r den Fortschritt als
  strategisch wichtig angesehen werden, angefertigt und will ein Paket
  zusammenstellen, um ihnen zu helfen. Der Manager f&uuml;r Entwickler-Support
  ist eifrig dabei, das Unterst&uuml;tzungsprogramm zum Laufen zu bekommen. Sein
  n&auml;chstes Ziel ist es, mit den Betreffenden in Kontakt zu treten.
</LI>
<BR><LI> Freie Unterst&uuml;tzung geht an komerzielle Amiga-Entwickler, w&auml;hrend Nicht-
  Amiga-Firmen daf&uuml;r bezahlen m&uuml;ssen. Den Amiga-Unternehmen soll geholfen
  werden, wieder auf die Beine zu kommen.
</LI>
<BR><LI> Es wurde bereits eine Amiga-IDe-Gesellschaft mit Tao zusammengebracht,
  um einen vern&uuml;nftigen Compiler zu schaffen. Ihre  V(irtual)P(rogramming)-
  Sprache ist sehr m&auml;chtig. Es w&uuml;rde auch gern eine BlitzBasic-&auml;hnliche
  Sprache gesehen, damit die &quot;Schlafzimmer&quot;-Programmierer und die Demo-
  Szene wiederbelebt werden.
</LI>
<BR><LI> AMIGA wird Entwicklerkonferenzen (DevCons) abhalten.
</LI>
<BR><LI> AMIGA hat Pl&auml;ne f&uuml;r Public Relations, und Leute in hohen Positionen
  sind bereit zur Mithilfe. Aber es sollte zun&auml;chst ein Produkt vorhanden
  sein. Es soll versucht werden, mit dessen Einf&uuml;hrung den Begriff
  &quot;Digitales Leben&quot; zu definieren. Das AMIGA-Team und die Gemeinschaft sind
  ein recht kreativer Haufen. Es mangelt nicht an Ideen. Um diese Ideen
  aber zu verwirklichen und weiterzuentwickeln, werden weitere Talente
  ben&ouml;tigt.
</LI>
<BR><LI> Bill McEwen macht sich gro&szlig;e Sorgen wegen der H&auml;ndler. Die Leute kaufen
  nicht mehr, weil sie abwarten wollen, aber wir m&ouml;chten ihnen klarmachen,
  dass sie durchaus die Software kaufen sollen, weil wir mit Haage &amp;
  Partner zusammen arbeiten, um sicher zu stellen, dass sie auf dem neuen
  Amiga l&auml;uft. Es ist kein hinausgeworfenes Geld!
</LI>
<BR><LI> Es ist derzeit nicht vorgesehen, das AmigaOS nach PPC zu portieren.
</LI>
<BR><LI> Es ist geplant, an die B&ouml;rse zu gehen.
</LI>
</UL>
<P ALIGN="RIGHT">
<A HREF="AMIGA.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
