<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Steuer Profi 99 bei Schatztruhe erh&auml;ltlich</H2>
<P><B>Schatztruhe (<A HREF="http://www.schatztruhe.de" TARGET="_top">http://www.schatztruhe.de</A>) informiert:</B></P>
<P>
&raquo;Steuer Profi 99 ist verf&uuml;gbar!
Empfohlener Verkaufspreis DM 99,00 [Euro 50,62] Update DM 49,00 [Euro
25,05]&laquo;
</P>
<P><B>&raquo;Produktinformation</B></P>
<P>
Der Steuer Profi hat sich als Marktf&uuml;hrer bei den Steuerprogrammen f&uuml;r den
Amiga in den letzten Jahren bestens bew&auml;hrt. Er bietet die Unterst&uuml;tzung,
die man beim Erstellen der Einkommensteuererkl&auml;rung so dringend ben&ouml;tigt.
Nun gibt es endlich die neue, &uuml;berarbeitete Version des Steuer Profis 99
auf CD-ROM.
</P>
<P>
Weiterhin auf der CD: Einkommensteuergesetz und weitere Gesetzestexte zum
schnellen Nachschlagen; Steuerb&ouml;gen, hochaufl&ouml;send als Bilder in
verschiedenen Formaten; die komplette Anleitung zum Steuer Profi 99 im
PowerGuide-Format. Die Eingabe Ihrer Steuerdaten erfolgt bequem am
Bildschirm. Um genau zu verfolgen, wo Ihre Eingaben sp&auml;ter hingelangen,
k&ouml;nnen Sie sich die zugeh&ouml;rigen Stellen in den amtlichen Steuerb&ouml;gen auf
dem Bildschirm anzeigen lassen. Zu jeder Eingabe h&auml;lt die 200 KByte
umfassende Online-Hilfe konkreten Rat parat.
</P>
<P>
Der Steuer Profi verarbeitet Eink&uuml;nfte aus allen sieben Einkunftsarten,
Sonderausgaben und au&szlig;ergew&ouml;hnliche Belastungen, Kinderfreibetr&auml;ge, die
Sonderregelungen in den neuen Bundesl&auml;ndern und in Berlin. Das Programm
ber&uuml;cksichtigt auch die F&ouml;rderung von selbstgenutztem Wohneigentum mit
Erfassung von Baukindergeld sowie viele Spezialf&auml;lle.
</P>
<P>
Die einfache Eingabe erm&ouml;glicht eine einfache und leistungsf&auml;hige
Alternativberechnung f&uuml;r die optimale Aussch&ouml;pfung aller M&ouml;glichkeiten der
Steuerersparnis. Der Kaufpreis ist vollst&auml;ndig steuerlich abzugsf&auml;hig.
</P>
<P>
Der Ausdruck in die amtlichen Steuerb&ouml;gen ist f&uuml;r den Steuer Profi ein
Kinderspiel. Mit den zwei Druckvarianten, dem hervorragenden
HQ-Pr&auml;zisionsdruck sowie dem schnellen Entwurfsmodus, k&ouml;nnen Sie ohne
Vorkenntnisse die B&ouml;gen exakt bedrucken.
</P>
<P>
Weitere Leistungsmerkmale sind die Vorausberechnung von Jahressteuer und
Steuerschuld bzw. Erstattungsbetrag bei der Einkommensteuererkl&auml;rung
sowie Arbeitnehmersparzulage bei verm&ouml;genswirksamen Leistungen mit
ausf&uuml;hrlich dokumentierter Ausgabe der Ergebnisse auf Bildschirm, Drucker
und Diskette.
</P>
<P>
Der Steuer Profi 99 aus Stefan Ossowskis Schatztruhe ist nat&uuml;rlich komplett
an die neue Gesetzeslage angepa&szlig;t und macht Ihre Steuererkl&auml;rung denkbar
einfach.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
