<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Diverse Amiga-News</H1>
<H2>1. Neues zu den Folgen des Insolvenzantrags von Phase 5</H2>
<P>
Amiga News hat vor kurzem mit Thomas Dellert, Gesch&auml;ftsf&uuml;hrer des Phase5-
Lizenznehmers DCE, ein Interview zur Zukunft der Phase5-Produkte gef&uuml;hrt
und es uns freundlicherweise zur Verf&uuml;gung gestellt. Der Artikel l&auml;sst sich
auch unter der URL <A HREF="http://www.amiga-news.de/archiv/0038.shtml" TARGET="_top">http://www.amiga-news.de/archiv/0038.shtml</A> abrufen.
</P>
<P>
&raquo;Interview DCE Thomas Dellert - 11.02.2000
</P>
<P>
<B>amiga news:</B>
</P>
<P>
Viele User machen sich Sorgen, wie und ob Phase5-Produkte weiter verf&uuml;gbar
sein werden. Wie wir wissen, hat DCE einige Lizenzen schon vor einiger
Zeit erworben. Wie sieht das genau aus?
</P>
<P><B>Thomas Dellert:</B></P>
<P>
DCE besitzt die exklusiven Rechte an folgenden Phase5 Produkten:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD ALIGN="RIGHT" VALIGN="TOP">1.&nbsp;</TD><TD VALIGN="TOP">Blizzard 1240&nbsp;</TD></TR>
<TR><TD ALIGN="RIGHT" VALIGN="TOP">2.&nbsp;</TD><TD VALIGN="TOP">Blizzard 1260&nbsp;</TD></TR>
<TR><TD ALIGN="RIGHT" VALIGN="TOP">3.&nbsp;</TD><TD VALIGN="TOP">Blizzard 2040&nbsp;</TD></TR>
<TR><TD ALIGN="RIGHT" VALIGN="TOP">4.&nbsp;</TD><TD VALIGN="TOP">Blizzard 2060&nbsp;</TD></TR>
<TR><TD ALIGN="RIGHT" VALIGN="TOP">5.&nbsp;</TD><TD VALIGN="TOP">Blizzard SCSI IV Kit&nbsp;</TD></TR>
<TR><TD ALIGN="RIGHT" VALIGN="TOP">6.&nbsp;</TD><TD VALIGN="TOP">CV 64 3D&nbsp;</TD></TR>
<TR><TD ALIGN="RIGHT" VALIGN="TOP">7.&nbsp;</TD><TD VALIGN="TOP">CV PPC&nbsp;</TD></TR>
<TR><TD ALIGN="RIGHT" VALIGN="TOP">8.&nbsp;</TD><TD VALIGN="TOP">B-Vision&nbsp;</TD></TR>
<TR><TD ALIGN="RIGHT" VALIGN="TOP">9.&nbsp;</TD><TD VALIGN="TOP">Cyberstorm MK III&nbsp;</TD></TR>
<TR><TD ALIGN="RIGHT" VALIGN="TOP">10.&nbsp;</TD><TD VALIGN="TOP">Cyberstorm PPC&nbsp;</TD></TR>
<TR><TD ALIGN="RIGHT" VALIGN="TOP">11.&nbsp;</TD><TD VALIGN="TOP">Blizzard PPC&nbsp;</TD></TR>
<TR><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Pos. 1-6 sind bereits wieder verf&uuml;gbar.
</P>
<P>
Die Cyberstorm MK III und PPC wird in KW 8 wieder ausgeliefert.
Blizzard PPC in ca. 7 Wochen.
BVison und CV PPC in ca. 2 Wochen.
Der Vertrieb erfolgt &uuml;ber Vesalia Computer.
</P>
<P>
<B>amiga news:</B>
</P>
<P>
Das sind exzellente Nachrichten! Wird DCE auch den Reparatur Service f&uuml;r
diese Produkte &uuml;bernehmen?
</P>
<P><B>Thomas Dellert:</B></P>
<P>
DCE &uuml;bernimmt f&uuml;r diese Produkte den Reparatur Service. Besitzer von
&auml;lteren Karten brauchen sich hier also keine Sorgen zu machen.
</P>
<P>
<B>amiga news:</B>
</P>
<P>
Ist die Lizenzierung und Verf&uuml;gbarkeit der Phase5-Produkte durch den
Insolvenz-Antrag von Phase5 beeintr&auml;chtigt oder in Gefahr?
</P>
<P><B>Thomas Dellert:</B></P>
<P>
Wir haben die exklusiven Rechte an den Produkten schon im April 1999
erworben. Wir zahlen keine Lizenzgeb&uuml;hren an P5. Vielmehr wurden die
Rechte durch eine einmalige Zahlung erworben. Es bestehen einwandfreie
Vertr&auml;ge. Die Verf&uuml;gbarkeit der Produkte ist gesichert.
</P>
<P>
<B>amiga news:</B>
</P>
<P>
Wird es weiterhin Software-Updates f&uuml;r Phase5-Produkte geben? Stehst du
dazu bereits in Kontakt mit Ralph Schmidt?
</P>
<P><B>Thomas Dellert:</B></P>
<P>
Gute und sehr wichtige Frage Petra. Ja, ich habe vor 2 Tagen ein Treffen
mit Ralph Schmidt und Frank Mariak gehabt. Wir sind uns einig, in Zukunft
sehr eng zusammenzuarbeiten. Es wird einen FTP-Server auf unserer Website
geben. Dort werden Treiber Updates zu finden sein.
</P>
<P>
<B>amiga-news.de:</B>
</P>
<P>
Sind auf Basis der phase5-Produkte Neuentwicklungen geplant?
</P>
<P><B>Thomas Dellert:</B></P>
<P>
Es wird sicherlich erst mal die bestehende Hardware gefertigt. Es gibt da
sehr viele Vorbestellungen. Da die Permedia II Chips von TI abgek&uuml;ndigt
worden sind, werden wir wahrscheinlich nur 1200 BVison bzw. CV-PPC Karten
bauen k&ouml;nnen. Deshalb denken wir &uuml;ber eine Permedia III Karte f&uuml;r den
Amiga nach. Sie k&ouml;nnte auf der bestehenden B-Vision bzw. CV-PPC Plattform
aufgesetzt werden. Frank Mariak wird die Software f&uuml;r uns erstellen. Mit
dem gesamten technischen Know How der Fa. Phase5 verf&uuml;gen wir jetzt &uuml;ber
ein m&auml;chtiges Paket. Es wird in Richtung PPC auf jeden Fall etwas
unternommen. Vorerst allerdings nur als Dual-CPU L&ouml;sung.
</P>
<P>
<B>amiga-news.de:</B>
</P>
<P>
Im Speziellen: Wird es die Phase5-G4-Karte von DCE geben und werden bereits
an Phase5 angezahlte Betr&auml;ge daf&uuml;r ber&uuml;cksichtigt? Oder gibt es &auml;hnlich,
wie es Stefan Ossowski's Schatztruhe f&uuml;r alle Euromail-Gesch&auml;digten
(Aminet-CDs f&uuml;r 5 DM, Backsteine geliefert) angeboten hatte, Hardware zu
g&uuml;nstigeren Preisen geben?
</P>
<P><B>Thomas Dellert:</B></P>
<P>
Ich hatte zu diesem Thema bereits ein Treffen mit Wolf Dietrich. Ob wir uns
f&uuml;r ein G4 Projekt entscheiden, kann ich zur Zeit allerdings noch nicht
sagen.
</P>
<P>
<B>amiga-news.de:</B>
</P>
<P>
Hat DCE Zugriff auf Hardware von Phase5-Kunden, die derzeit bei Phase5
liegt, um repariert zu werden?
</P>
<P><B>Thomas Dellert:</B></P>
<P>
Nein.
</P>
<P>
<B>amiga-news.de:</B>
</P>
<P>
Thomas, vielen Dank f&uuml;r die informativen Antworten. Wir sind beruhigt und
erfreut, dass die Produktion weitergeht, und dass Kunden, die Produkte von
Phase5 haben, in DCE einen kompetenten Service f&uuml;r Reparaturen in Anspruch
nehmen k&ouml;nnen.
</P>
<P>
DCE<BR>
<A HREF="mailto:thomas.dellert@dcecom.de">thomas.dellert@dcecom.de</A>&laquo;<BR>
</P>
<BR><HR><BR><BR>
<P>
Au&szlig;erdem hat Amiga News der vorl&auml;ufigen Insolvenzverwalterin einige Fragen
gestellt. Der Text l&auml;sst sich auch unter der URL
<A HREF="http://www.amiga-news.de/archiv/0042.shtml" TARGET="_top">http://www.amiga-news.de/archiv/0042.shtml</A> finden.
</P>
<P>
&raquo;Phase 5 Insolvenzantrag - Diverse Fragen - 15.02.2000
</P>
<P>
Aus dem Insolvenzantrag der Phase5 digital products ergaben sich
verschiedene Fragen, die wir der derzeitigen Insolvenzverwalterin Frau
Angelika Amend per Fax am 10.02.2000 gestellt haben.
</P>
<P>
Hier zun&auml;chst unsere gestellten Fragen:
</P>
<P>
Viele User haben Ger&auml;te (Prozessorkarten u.a.) zur Reparatur an Phase 5
eingeschickt. Es handelt sich teilweise um Garantiereparaturen, aber auch
kostenpflichtige Reparaturen. Was m&uuml;ssen die User tun, um ihre Ger&auml;te
(repariert oder auch unrepariert) schnellstm&ouml;glich zur&uuml;ckzubekommen?
</P>
<P>
Thema Vorauszahlung f&uuml;r bestellte G3/G4 Karten
</P>
<P>
Wenn wir richtig informiert sind, wurden die Vorauszahlungen unter dem
Aspekt geleistet, dass die Vorauszahlung auf ein Treuhandkonto geleistet
wird. Das wurde seinerzeit von Phase 5 so in der Presse verbreitet, denn
damit sollte sicher gestellt werden, dass die Kunden ihr Geld
zur&uuml;ckerhalten, falls die Karten (aus welchem Grund auch immer) nicht
produziert werden. Ist das Geld dieser Kunden tats&auml;chlich auf einem
Treuhandkonto gelandet oder ist es Teil des evtl. folgenden
Insolvenzverfahrens?
</P>
<P>
Aus verschiedenen Quellen h&ouml;rten wir, dass Phase 5 aus zwei Firmen
best&uuml;nde. Eine GmbH (Gesellschafter sind mir nicht bekannt) und eine GBR
zwischen Wolf Dietrich und Gerald Karda. Daraus ergibt sich die Frage,
welche der Firmen den Insolvenzantrag gestellt hat. Aus dem Briefbogen,
auf welchem ich die Pressemitteilung erhielt, ist leider die
Gesellschaftsform nicht ersichtlich.
</P>
<P>
Wie bringt der User in Erfahrung, wann und ob das Insolvenzverfahren
er&ouml;ffnet wurde, damit evtl. Gesch&auml;digte ihre Rechte anmelden k&ouml;nnen?
</P>
<P><B>Antwort vom 15.02.2000</B></P>
<P>
Per Fax erhielten wir heute folgende Antwort, die wir wortw&ouml;rtlich
wiedergeben:
</P>
<P>
Rechtanw&auml;ltin Angelika Amend<BR>
Am Aufstieg 10<BR>
61476 Kronberg im Taunus<BR>
Fax-Nr. 06173/940342<BR>
</P>
<P>
amiga-news.de<BR>
Petra Struck<BR>
</P>
<P>
15. Februar 2000<BR>
aa/gh - phase-006 bitte stets angeben<BR>
</P>
<P>
Insolvenzverfahren Phase 5 digital products
</P>
<P><B>Sehr geehrte Frau Struck,</B></P>
<P>
ich komme zur&uuml;ck auf Ihr Schreiben vom 10.02.2000.
</P>
<P>
Gegenw&auml;rtig k&ouml;nnen die User nur abwarten, ob es zu einer Er&ouml;ffnung des
Insolvenzverfahrens kommt. Aufgrund der eingestellten Gesch&auml;ftst&auml;tigkeit
erfolgen derzeit weder Reparaturen o.&auml;. User sollten lediglich ihre
Anspr&uuml;che bei der Unterzeichneten anzeigen. Ein Treuhandkonto ist der
Unterzeichneten bisher unbekannt.
</P>
<P>
Ein Insolvenzverfahren ist nur &uuml;ber das Verm&ouml;gen der Gesellschaft
b&uuml;rgerlichen Rechts, bestehend aus Wolf Dietrich und Gerald Carda
anh&auml;ngig. Die User sind Gl&auml;ubiger der Gesellschaft, so dass Sie &uuml;ber die
Er&ouml;ffnung des Verfahrens informiert werden.
</P>
<P><B>Mit freundlichen Gr&uuml;&szlig;en</B></P>
Angelika Amend<BR>
Rechtsanw&auml;ltin<BR>
als vorl&auml;ufige Insolvenzverwalterin<BR>
[Unterschrift]&laquo;<BR>
<P ALIGN="RIGHT">
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
