<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Diskussionsansto&szlig; zum 68060-Prozessor (von Thorsten Sch&ouml;lzel)</H2>
<P>
&raquo;Mal eine generelle Frage ist, wer benutzt diesen eigentlich?
Eine andere Frage ist, warum setzen Software-Programmierer ihre Software so
schlecht auf diesen Prozessor um?
</P>
<P>
Ich selbst darf eine Blizzard1260/50MHz mein Eigen nennen und war ziemlich
stolz, als ich mir diese vor einigen Jahren gekauft hatte, in der
Fachpresse wurde gerade dieser Prozessor bzw. Karte hochgelobt, doch wenn
ich Quake spiele, frage ich mich, warum.
</P>
<P>
Die Blizzard 1260 ist mit dem 68060-Prozessor von Motorola, einer internen
FPU und einer MMU ausgestattet. Man kann leistungsm&auml;&szlig;ig einen solchen Amiga
mit einem 586er-PC vergleichen.
</P>
<P>
Warum bekommt man es dann nicht hin, Quake in FullScreen angenehm zum
Laufen zu bekommen? Wozu braucht man denn dann einen 060er-Prozessor, da
k&ouml;nnte man doch gleich zu der billigeren Blizzard1240/40 greifen, oder?
Mich regt das einfach auf, dass ich schon einen schnellen Prozessor habe,
aber die richtige Software fehlt.
</P>
<P>
Es ist nicht damit geschehen, ein paar Befehle in einem Programm
umzuschreiben, dazu geh&ouml;rt viel viel mehr. Einige Szene-Demos machen es
doch vor, welche Leistung in dem Prozessor steckt, es muss doch m&ouml;glich
sein, solches generell umzusetzen.
</P>
<P>
Einige von Euch werden jetzt behaupten, warum ich dann nicht auf PPC
umsteige, dazu m&ouml;chte ich folgendes erl&auml;utern. Der Amiga ist tot und kann
im Moment nur durch Amiga Inc. gerettet werden, dadurch w&auml;re eine weitere
Anschaffung f&uuml;r meinen Classic-Amiga hinausgeschmissenes Geld (bis auf ein
paar Ausnahmen).
</P>
<P>
Sicher ist ein System mit PPC-Turbokarte &amp; PPC-Grafikkarte nicht schlecht,
doch wof&uuml;r, nur um sagen zu k&ouml;nnen, ich hab' einen PPC. Ne, Leute, daf&uuml;r
ist mir das Geld zu schade, au&szlig;erdem reicht mein jetziges System v&ouml;llig
aus, obwohl ich so manche Dinge vermisse, wie sie es auf dem PPC gibt,
allen voran, vern&uuml;nftige MPEG-, Quicktime- und AVI-Player.
</P>
<P>
Bestes Beispiel hierf&uuml;r ist AmiPEG, was bei mir zwar nur im AGA-Mode l&auml;uft,
aber dort wird ein MPEG-Movie in fast FullScreen in Original-
Geschwindigkeit abgespielt. Was w&uuml;rde eine weitere Entwicklung dieses
Players f&uuml;r die Amiga-68k-Reihe bedeuten (Sound &amp; FullScreen-Bild).
Ein Newcomer gef&auml;llt mir aber besonders, sein Name &quot;Frogger&quot;. Es w&auml;re
w&uuml;nschenswert, wenn der oder die Programmierer evtl. vorhandene Soundkarten
unterst&uuml;tzen w&uuml;rden, dann k&ouml;nnte man bestimmt auch mal Sound zu einem MPEG-
Movie h&ouml;ren, eine Unterst&uuml;tzung des MPEGit-Moduls w&auml;re angebracht.
Es w&uuml;rde mich schon freuen, wenn da in n&auml;chster Zeit mal nachgehakt werden
k&ouml;nnte.
</P>
<P>
Es gibt eigentlich so viele Dinge, die ich aufgreifen k&ouml;nnte, um dar&uuml;ber zu
diskutieren, denn dem Amiga fehlt es in jeder Hinsicht an ausgereifter
Software.
</P>
<P>
Leider &auml;ndert sich sowieso nichts, und es wird mit dem Amiga
weiter bergab gehen.
</P>
<P><B>Thorsten Sch&ouml;lzel &lt;<A HREF="mailto:amiga-freak@t-online.de">amiga-freak@t-online.de</A>&gt;&laquo;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
