<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Amiga PowerPC</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerPC.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="PowerPC.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="PowerPC2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Amiga PowerPC
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Amiga PowerPC</H1>
<H2>1. Entwicklung des angek&uuml;ndigten Volltext&uuml;bersetzers warpTrans eingestellt</H2>
<P><B>Andreas Wendorf informiert:</B></P>
<P><B>&raquo;Pressebericht</B></P>
<P><B>Hallo an alle Amiganer!</B></P>
<P>
Nach einer langen Winterpause melden wir uns von Warp9 zur&uuml;ck.
Es gab viel Wirbel in unseren Team, so dass unsere Projekte in Gefahr
gerieten.
</P>
<P>
Besonderes zu erw&auml;hnen w&auml;ren da das warpTrans-Projekt (Translation
Software) und das wARPgATe (News &amp; Information Seite &uuml;ber warpOS &amp; warp3D).
Lange haben wir uns nich getraut die Ergebnisse unserer User-Befragungen
bez&uuml;glich dem warpTrans Projekt bekannzugeben. Dennoch sind wir der Meinung
das es wichtig ist Klarheit zu schaffen und Licht ins Dunkle zu bringen.
Allen voran m&ouml;chten wir noch einmal das warpTrans-Projekt kurz vorstellen.
Nachdem uns eine komplette Translator-Datenbank (Englisch-Deutsch) mit
einem riesigen Wortschatz und Grammatikteil zu Verf&uuml;gung gestellt wurde,
&uuml;bernahm im Auftrag ein niederl&auml;ndisches Programmierteam die Arbeit.
Entstehen sollte das erste professionelle &Uuml;bersetzungsprogramm f&uuml;r den
Amiga. Uns kammen eine Vielzahl von innovativen Ideen, die auch zum
gr&ouml;ssten Teil umgesetzt wurdem.
</P>
<P>
Die Spracherkennung war eines der wichtigsten Teile, die das Team mit
gro&szlig;er Anstrengung portieren konnten. Da ein solches Programm sehr
Rechenintensiv ist, haben wir auch im Vorraus die Vorraussetzungen sehr
hoch angesetzt, was von den Usern fast erschreckend angenommen wurde. Von
den wirklich sehr geringen Feedback (gerade mal 70 Mails) waren auch viele
dabei, die die technischen Voraussetzungen f&uuml;r zu hoch ansahen. Obwohl das
Programm in zahlreichen Pressemitteilungen bekannt gemacht wurde, auf
s&auml;mtlichen Amiga-News Seiten davon zu lesen war und sogar Artikel in der
Amiga-Fachpresse gedruckt wurden, kamen nur die oben genannten 70 E-Mails
und lausige 2 Vorbestellungen bei uns an. Dies f&uuml;hrte zur absoluten
Demotivation unserer Programmierer und schlie&szlig;lich zu den Entschluss das
Programm nicht zu vollenden. So schade es auch ist, k&ouml;nnen wir uns nicht
leisten noch eine Mark in das Projekt zu investieren. Viele h&auml;tten gerne
eine mal wirklich brauchbare Software auf dem PPC-Amiga gesehen. Doch es
sollte nicht sein. Damit haben wir nicht gerechnet - mehr k&ouml;nnen wir dazu
nicht sagen.
</P>
<P>
Weiterhin m&ouml;chten wir uns f&uuml;r die Versp&auml;tung der Wiederer&ouml;ffnung des
wARPgATe entschuldigen. Aus Zeitgr&uuml;nden war dies einfach nicht m&ouml;glich
gewesen. Es w&auml;re unklug weitere Versprechen zu machen. Trotzdem m&ouml;chten wir
versichern das diese Seite nicht tot ist. Sie wird definitiv noch im
Fr&uuml;hjahr weitergef&uuml;hrt werden.
</P>
<P>
Wir bitten schon jetzt alle warpOS&amp;3D-Entwickler uns regelm&auml;ssig
Informationen und News zukommen zu lassen (E-Mail an <A HREF="mailto:news@w-9.de">news@w-9.de</A>). Das neue
Design des wARPgATe ist zu diesen Zeitpunkt schon fertig gestellt. Es geht
also voran.
</P>
<P>
Ein regelm&auml;&szlig;iger Blick auf unsere Internetseite (www.w-9.de) kann also
nicht schaden.
</P>
<P>
Kontakt: <A HREF="mailto:info@w-9.de">info@w-9.de</A>
Besuchen sie auch unsere Webseite www.w-9.de&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="PowerPC.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="PowerPC2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
