<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
F&uuml;r euch und uns alle
</P>
<P>
Vor wenigen Tagen erreichte mich folgende Mail von Thorsten Sch&ouml;lzel:
</P>
<P>
&raquo;Ich habe einen Verbesserungsvorschlag f&uuml;r die Amiga aktuell, k&ouml;nntest Du
nicht auch eine Rubrik einf&uuml;hren, die sich ausschlie&szlig;lich mit Szene-Demos
befasst?&laquo;
</P>
<P>
Solche und &auml;hnliche Anfragen bekomme ich immer wieder, und ich muss sie
bedauerlicherweise regelm&auml;&szlig;ig mit folgenden Worten ablehnen: &raquo;Bislang hat
sich niemand gefunden, der bereit w&auml;re, diese Aufgabe zu &uuml;bernehmen.&laquo; Denn
das ist das Problem - Verbesserungsvorschl&auml;ge f&uuml;r AMIGA aktuell gibt es
viele, Freiwillige, die bereit und in der Lage w&auml;ren, diese in die Tat
umzusetzen, leider nicht.
</P>
<P>
AMIGA aktuell ist ein Magazin, das von der Mithilfe seiner Leser lebt. Wie
ihr sicherlich wisst, erzielen die Macher mit ihm keinerlei Einnahmen,
sondern investieren ihre Zeit &quot;just for fun&quot; in das Projekt - f&uuml;r euch und
uns alle.
</P>
<P>
Um auf den Punkt zu kommen: Leider musste ich in den vergangenen Monaten
feststellen, dass die Beteiligung an unserem Magazin stagniert, in manchen
Bereichen - genannt seien die Hard- und Softwaretests - sogar zur&uuml;ckgeht.
Dass es mit der Motivation in diesen schwierigen Amiga-Zeiten nicht zum
Besten steht, kann ich nachvollziehen, nichts desto trotz w&uuml;rde ich schon
ein st&auml;rkeres Engagement der Leserschaft erwarten - und meine auch erwarten
zu k&ouml;nnen.
</P>
<P>
Bei einem Magazin mit ein paar Dutzend Lesern mag die derzeitige
Beteiligung vielleicht noch als zufriedenstellend gelten, aber f&uuml;r ein
Magazin wie AMIGA aktuell ist das angesichts von allein mehr als 800
Direkt-Abonnenten doch ziemlich d&uuml;rftig, meine ich.
</P>
<P>
M&ouml;glicherweise aber fehlt dem einen oder anderen von euch zur Mitarbeit
auch eine geeignete Kommunikationsplattform. Aus diesem Grund erw&auml;ge ich,
eine &ouml;ffentliche Mailingliste einzurichten, die f&uuml;r s&auml;mtliches AMIGA
aktuell betreffende, seien es nun Vorschl&auml;ge und Anregungen, Fragen, News,
etc., gedacht sein soll. Bitte teilt mir mit, was ihr von dieser Idee
haltet - schreibt an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A> .
</P>
<P><B>Bis n&auml;chsten Monat,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
