<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Elite 3 und Descent 2
</LI>
</UL>
<P>
Alive Mediasoft hat jetzt offiziell mitgeteilt, dass sie Descent 2
und Elite 3 f&uuml;r Amiga ver&ouml;ffentlichen. Die Umsetzung von Descent 2
sei dabei schon so gut wie fertig und an Elite 3 werde weiterhin
gearbeitet.
</P>
<UL>
<LI> Simon the Sorcerer 2 News
</LI>
</UL>
<P>
Die 500 Vorbestellungen, die f&uuml;r eine Umsetzung von Simon the
Sorcerer 2 ben&ouml;tigt wurden, sind jetzt fast erreicht worden.
Auf der Epic Marketing Seite wurden jetzt erste Screenshots und
Infos zum Spiel ver&ouml;ffentlicht.
</P>
<UL>
<LI> Alpha Version von Nightlong
</LI>
</UL>
<P>
Die Alpha-Version von Nightlong wurde von clickBOOM fertiggestellt.
Jetzt geht das Spiel in die Testphase. Beta-Tester k&ouml;nnen sich
bei clickBOOM bewerben; allerdings kann nur jener testen, der
Nightlong schon vorbestellt hat. ClickBOOM wird den Quelltext noch
optimieren und es m&uuml;ssen auch noch einige Probleme gel&ouml;st werden
(z.B. scheinen 3 CD-ROM's f&uuml;r das Spiel noch immer nicht zu reichen).
</P>
<UL>
<LI> Ali Baba
</LI>
</UL>
<P>
Unter dem Namen Ali Baba verbirgt sich ein neues Action Adventure
von den Newcomern von Medici. Auf deren Homepage
(<A HREF="http://www.medici.org.uk/" TARGET="_top">http://www.medici.org.uk/</A>)
lassen sich verschiedene Sachen zum Spiel runterladen, darunter
auch eine Demoversion.
</P>
<UL>
<LI> Demoversion von Foundation DC
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Diesen Monat wurde eine spielbare Demoversion von Foundation -&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">The Directors Cut ver&ouml;ffentlicht. Ein ausf&uuml;hrliches Review war&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">in der letzten AMIGA aktuell Ausgabe zu lesen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> Phantasmagoria kommt von Alive Mediasoft
</LI>
</UL>
<P>
Vor etwa drei Jahren wurde Phantasmagoria erstmals f&uuml;r den
Amiga angek&uuml;ndigt. Seitdem hat man von dem erfolgreichen PC-Spiel
nichts mehr geh&ouml;rt. Alive Mediasoft hat jetzt gegen&uuml;ber
Amiga Flame best&auml;tigt, dass sie Phantasmagoria ver&ouml;ffentlichen.
</P>
<UL>
<LI> Digital Images sucht C++ Programmierer
</LI>
</UL>
<P>
Stuart Walker von Digital Images hat bekanntgegeben, dass die
Firma auf der Suche nach einem C++ Programmierer ist, der
Erfahrung in GUI Programmierung und AI hat. Au&szlig;erdem hat Stuart
best&auml;tigt, dass Digital Images nach Los Angeles (Kalifornien, USA)
umzieht. Der Programmierer w&uuml;rde dort dann seinen Arbeitsplatz
erhalten. Na, wer hat Lust ins sonnige Kalifornien zu ziehen?
Bewerbungen an Stuart Walker &lt;<A HREF="mailto:djstu@byke.com">djstu@byke.com</A>&gt;.
</P>
<UL>
<LI> HomeLand Demoversion erschienen
</LI>
</UL>
<P>
Von dem Command&amp;Conquer Klon HomeLand ist die Demoversion 1.0
erschienen. Das fertige Spiel soll bald erscheinen und wird
von Alive Mediasoft vertrieben.
</P>
<UL>
<LI> Quake 1.09b von Frank Wille erschienen
</LI>
</UL>
<P>
Die neue Beta-Version von Quake 1.09 unterst&uuml;tzt jetzt AGA,
CyberGraphX, die chunkyppc.library (Screen, Public Screen,
WB-Fenster, Double-/Triple-Buffering, P96-PiP), Tastatur,
Maus, Joystick sowie TCP/IP und Sound (&uuml;ber audio.device).
Au&szlig;erdem ist die CD-Audio Wiedergabe m&ouml;glich. Die neue
Quake Version l&auml;sst sich u.a. aus dem Aminet laden.
</P>
<UL>
<LI> Programmierer auch bei Alive Mediasoft gesucht
</LI>
</UL>
<P>
Wer Interesse hat, im Elite 3 oder Phantasmagoria Team
als Programmierer mitzuarbeiten, kann sich bei Alive
Mediasoft &lt;<A HREF="mailto:steve@alive-mediasoft.co.uk">steve@alive-mediasoft.co.uk</A>&gt; melden. Gesucht werden
allerdings nur Programmierer auf Aushilfsbasis.
</P>
<UL>
<LI> Tales of Tamar News
</LI>
</UL>
<P>
Zu Tales of Tamar wurden diesen Monat zwei Updates
ver&ouml;ffentlicht. Auf <A HREF="http://www.tamar.net/" TARGET="_top">http://www.tamar.net/</A> lassen sie sich
laden. Tales of Tamar ist ein Multiplattform und -player
Spiel &uuml;ber das Internet.
</P>
<UL>
<LI> Crystal Software bringt Pokemon f&uuml;r Amiga
</LI>
</UL>
<P>
Der Pokemon Wahnsinn scheint auch auf den Amiga &uuml;berzugreifen:
Crystal Software hat sich die Rechte f&uuml;r die Portierung
der Pokemon Nintendo 64 Version gesichert. Laut Crystal Software
wird das Spiel auf PC, Linux und auch AmigaOS portiert. Die
Amiga-Version wird dabei auf derselben CD-ROM wie die PC-Version
sein und so in den meisten Gesch&auml;ften zu kaufen sein. F&uuml;r
die Amiga-Version werden noch Programmierer, Musiker und
Grafiker gesucht. Interessierte k&ouml;nnen sich an Crystal Software
&lt;<A HREF="mailto:vacancies@crystal-software.com">vacancies@crystal-software.com</A>&gt; wenden.
</P>
<UL>
<LI> Alive Mediasoft sucht Unterst&uuml;tzung f&uuml;r 'The Pulse'
</LI>
</UL>
<P>
Das kostenlose Spielemagazin von Alive Mediasoft, 'The Pulse',
besitzt nun eine Rubrik mit Briefen von Lesern. In dieser
Rubrik soll zuk&uuml;nftig einiges an Meinungen von Lesern gesammelt
sein. Deshalb werden alle Amiga-Benutzer gebeten, sich an
der Diskussion zu beteiligen. Beitr&auml;ge bitte direkt an
<A HREF="mailto:thepulse@alive-mediasoft.co.uk">thepulse@alive-mediasoft.co.uk</A> schicken.
</P>
<UL>
<LI> PowerBall Demo ver&ouml;ffentlicht
</LI>
</UL>
<P>
Darkage Software hat eine spielbare Demoversion von PowerBall
ver&ouml;ffentlicht. PowerBall ist ein einfaches Puzzle Spiel im
Stil von Megaball. Die Demoversion l&auml;sst sich aus dem Aminet
laden.
</P>
<UL>
<LI> Sin f&uuml;r Amiga
</LI>
</UL>
<P>
Ben Hermans von Hyperion Software hat in einem Interview der
Amiga Active bekanntgegeben, dass Hyperion Software das auf
der Heretic 2 und Quake 2 Engine basierende Spiel 'Sin' auf
den Amiga portieren wird. Weitere Details sind noch nicht
bekannt.
</P>
<UL>
<LI> PaganGames sucht Programmierer
</LI>
</UL>
<P>
Die Leute von PaganGames sind immer noch auf der Suche nach
talentierten Programmierern f&uuml;r ihre Projekte.
</P>
<UL>
<LI> The Heretic Fortress
</LI>
</UL>
<P>
Steffen H&auml;user hat bekanntgegeben, dass seine Portierung des
Heretic 2-Addons 'The Heretic Fortress' zu 99% fertig ist.
Screenshots der Amiga-Version von The Heretic Fortress 4.0
k&ouml;nnen auf <A HREF="http://members.tripod.com/ppcstation/" TARGET="_top">http://members.tripod.com/ppcstation/</A> angeschaut
werden.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
