<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Workshops / Hintergrundberichte / Buchvorstellungen</H1>
<H2>1. Der Commodore-Untergang aus meiner Sicht - Teil 5 (von Rainer Benda)</H2>
<H3>&raquo;Warum war Commodore nicht kulanter im Umgang mit seinen Usern (Kunden)?</H3>
<P>
&quot;Man&quot; hatte immer Angst, da&szlig; damit Kosten verbunden seien. Ob man sich
davor f&uuml;rchtete, Fehler zugeben zu m&uuml;ssen ist mir nicht ganz klar, ich
tippe wirklich auf den Kostenfaktor. Bei manchen &quot;Zukaufprodukten&quot; m&uuml;ssen
die Vertr&auml;ge wohl auch keine andere L&ouml;sung erm&ouml;glicht haben (Commodore
Desktop Video Master von Intelligent Memory als Beispiel).
</P>
<P>
Wir mussten uns immer anh&ouml;ren, da&szlig; wir viel zu sozial seien und das unsere
&quot;soziale Einstellung&quot; dem Unternehmen kein Geld bringen w&uuml;rde. Die
Gesch&auml;ftsleitung war allerdings nie davon zu &uuml;berzeugen, da&szlig; man Kulanz
auch werbewirksam zu Gunsten des Unternehmens h&auml;tte einsetzen k&ouml;nnen.
</P>
<P>
So gab es zu meiner Zeit geh&auml;uft Beschwerden zum Amiga 2000-&quot;A&quot;. Viele
Kunden beschwerten sich &uuml;ber die damalige Commodore Aussage, da&szlig; dieses
Ger&auml;t auch in den n&auml;chsten Jahren uneingeschr&auml;nkt aufr&uuml;stbar und
zukunftssicher sei.
</P>
<P>
Wie wir alle wissen, wurde das &quot;A&quot; Modell recht bald ausgemustert und der
&quot;B&quot; Nachfolger (zur Kl&auml;rung: die Bezeichnungen A bis D stammten nie von
Commodore selbst, sondern von drau&szlig;en. Zur besseren Unterscheidung der ein-
zelnen Modelle w&auml;hlten H&auml;ndler wohl diese Bezeichnungen) kam auf den Markt.
</P>
<P>
Meine Mappe zum Thema A2000-A f&uuml;llte sich mehr und mehr und ich fragte H.
Jost, wie Commodore verfahren wolle. Anfangs weigerte er sich in dieser
Sache &uuml;berhaupt etwas zu unternehmen, sp&auml;ter meinte er, jeder Fall sollte
einzeln &quot;bearbeitet&quot; werden.
</P>
<P>
Ich schlug ihm vor, die Sache in einem Aufwasch zu erledigen und legte ihm
in Zusammenarbeit mit Hans Ebrecht (Commodore Braunschweig) eine
Kostenaufstellung vor, in der wir den aktuellen A2000 zum Selbstkostenpreis
unter R&uuml;cknahme der A-Modelle anbieten konnten. Die Frage was mit dem 2000-
A passieren sollte, war auch recht einfach. Entweder Commodore gibt sie an
Firmen wie REX-Datentechnik etc. zum &quot;Kilopreis&quot; ab, die wiederum
&quot;ungepr&uuml;fte&quot; Platinen f&uuml;r xx DM h&auml;tten anbieten k&ouml;nnen, oder ein Teil der
Chips (CIAs etc.) kommen wieder in den Kreislauf zur&uuml;ck.
</P>
<P>
Unterm Strich h&auml;tte Commodore keine Mark draufgelegt. Eine Ver&ouml;ffentlichung
in einer Amiga-Zeitschrift w&auml;re v&ouml;llig ausreichend gewesen und die
betroffenen Amiga-User w&auml;ren sicherlich positiv &uuml;berrrascht gewesen. Doch
leider lehnte H. Jost dies ab, obwohl alles genau aufgef&uuml;hrt wurde. Wir
gingen von max. 3.000 Ger&auml;ten aus, die tats&auml;chlich noch im Einsatz waren.
Davon zogen wir einfach mal die H&auml;lfte ab, denn nicht jeder w&uuml;rde das
Angebot annehmen (es gab ja auch A2000-A Konfigurationen, die problemlos
liefen). L&auml;sst man dann noch defekte Ger&auml;te weg, w&auml;re die Menge
&uuml;berschaubar gewesen. Trotzdem war &quot;man&quot; der Ansicht, Commodore w&uuml;rde das
nur Geld kosten.
</P>
<P>
Ich wies darauf hin, da&szlig; die L&ouml;sung durch &quot;Einzelf&auml;lle&quot; sowieso dazu f&uuml;hren
w&uuml;rde, da&szlig; sich auch andere A2000-A User an dieser Aktion beteiligen,
sp&auml;testens, wenn jemand einen Leserbrief an ein Amiga-Magazin schicken
w&uuml;rde.
</P>
<P>
Es half nichts. Es wurde weiterhin versucht, die Sachen im Einzelfall zu
kl&auml;ren.
</P>
<P>
Ok, da&szlig; habe ich dann auch versucht und habe die Beschwerdeschreiben in
Angriff genommen. Ich habe konkret einen Rechner getauscht, mit dem
Ergebnis, da&szlig; der Kunde einen A2000 erhalten hat, der scheinbar nicht ganz
frisch war (mit &quot;kann passieren&quot; konnte ich mich nicht zufriedengeben).
</P>
<P>
Das konnte ich leider nicht sehen, da das Ger&auml;t nicht von Frankfurt aus
verschickt wurde. Ergebnis war, da&szlig; der &quot;neue&quot; 2000er beim Kunden nach dem
Einschalten in Rauch aufging und er somit keinen 2000er mehr hatte. Die
Platine, bzw. das Ger&auml;t wurde dann zwar nochmal getauscht und lief dann
letztendlich auch, aber erst nachdem sich der Kunde &uuml;ber die Zeit von
mehreren Wochen hartn&auml;ckig darum bem&uuml;hte.
</P>
<P>
Ich ging mit diesem speziellen Fall wieder zur Gesch&auml;ftsleitung und lehnte
die &quot;Einzelfall-Methode&quot; f&uuml;r die Zukunft ab, wenn solche Ergebnisse dabei
herausk&auml;men. Ich empfahl den Betroffenen, die Schreiben direkt an die
Gesch&auml;ftsleitung zu schicken und den Fall zu schildern. Diese Post bekam
ich dann von der GL wieder auf den Tisch. Ich vermerkte das mit dem
Kommentar, da&szlig; eine L&ouml;sung nur &uuml;ber die Gesch&auml;ftsleitung m&ouml;glich sei, die
sich ja weiterhin quer stellte.
</P>
<P>
Als ob das noch nicht genug war, meldeten sich auch die Amiga 1000 User bei
Commodore (mir), die sich ebenfalls verraten und verkauft f&uuml;hlten. Viel
Geld ausgegeben und dann h&auml;ngengelassen.
</P>
<P>
Wilfried H&auml;ring und ich besuchten die &quot;IG-1000&quot; (Interessengemeinschaft der
A1000 User - damals in Neu-Isenburg). Eigentlich mussten wir beide den Kopf
f&uuml;r die Entscheidungen Commodore's hinhalten. Um es kurz zu machen, wir
konnten ihnen nicht helfen, der A1000 war Geschichte. Auch hier versuchten
wir wenigstens &uuml;ber die Gesch&auml;ftsleitung, den A1000 Usern zum
Selbstkostenpreis einen A2000 zu verschaffen, ohne Erfolg.
</P>
<P>
Unterm Strich verlief die Sache im Sande, man zog sich zwar den Zorn der
Betroffenen zu, aber irgendwie schien das v&ouml;llig egal zu sein. Meine
pers&ouml;nliche Frustrationskurve wuchs nach diesem Vorfall und den Aktionen
zum A600, C65 etc. weiter stark an. Man war machtlos und zumindest mir war
klar, da&szlig; es so f&uuml;r Commodore nicht weitergehen konnte.
</P>
<HR>
<P>
Ralph Conway musste sich mit Amiga und Video (Animation, Multimedia
allgemein) auseinandersetzen. Er versuchte den Kampf unteranderem im
Bereich des Desktop Video-Master Pakets, das nachweislich nicht richtig
funktionierte. Das Paket kostete damals rund 1.400 DM und brachte Commodore
mehr &Auml;rger als Vorteile und die Kosten f&uuml;r den Aufwand, Ersatz zu liefern
waren in keinem Verh&auml;ltnis. Bedauerlichweise war im Garantiefall zus&auml;tzlich
Commodore der Ansprechpartner, somit nicht der Hersteller des Produkts.
</P>
<P>
Die Ger&auml;te hatten einfach technische Probleme. In 8 von 10 F&auml;llen kam es
entweder erst gar nicht zu einem Bildsignal, oder die Qualit&auml;t des &quot;Scans&quot;
war einfach nur schlecht. Manche Ger&auml;te konnten erst dann verwendet werden,
wenn sie im eingeschalteten Zustand des Rechners (Parallelport) eingesteckt
wurden (kein weiterer Kommentar n&ouml;tig).
</P>
<P>
In wiederholten Meetings wurde dieses Thema besprochen, aber was soll man
schon dazu sagen, wir waren halt nicht &quot;hart genug&quot; f&uuml;r diese Welt.&laquo;
</P>
<P>
Fortsetzung folgt...
</P>
<P ALIGN="RIGHT">
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
