<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerPC4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Der Zwischenruf
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Der Zwischenruf</H1>
<P>
Big brother und kein Ende...
</P>
<P>
Hoppla .... wir leben in bewegten Zeiten. Altes geht und Neues kommt.
</P>
<P>
Die CeBIT zeigt uns in sch&ouml;nen bunten Bildchen die neue Marschrichtung der
IT-Branche.
</P>
<P>
Da werden die &uuml;blichen Phrasen gedroschen (&quot;Kauft Leute kauft, bald gibts
nichts mehr !!&quot;) und in sehnsuchtsgeschw&auml;ngerter Sph&auml;re werden wir in das
neue Internet-Zeitalter eingef&uuml;hrt.
</P>
<P>
Die eBusiness-Branche sagt uns, da&szlig; wir bald unsere Salatgurke nur noch im
Internet kaufen werden weil sie da viel frischer und gerader ist. Der
Internet-Wein ist viel schmackhafter und bek&ouml;mmlicher als der Boxbeutel im
Supermarkt. Und einen schicken Bastrock aus der Karibik wollte ich schon
immer haben...
</P>
<P>
Herrliche Zeiten str&ouml;men uns entgegen. W&auml;re da nicht .... tja, w&auml;ren da
nicht die immer lauter werdenden Warnungen vor einem neuen Monster genannt
&quot;Echelon&quot;.
</P>
<P>
Echelon ist, kurz gesagt, ein Mega-Lauschapparat des amerikanischen NSA
(National Securitty Agency). F&uuml;r eingefleischte stellt das Internet &uuml;ber
die einschl&auml;gigen Suchmaschinen genug Informationen hierzu zur Verf&uuml;gung.
An dieser Stelle w&auml;ren Details zu erm&uuml;dend. Aber folgendes d&uuml;rfte einige
Menschen aufhorchen lassen:
</P>
<P>
Das Bundesamt f&uuml;r Sicherheit in der Informationstechnologie (BSI) warnte
k&uuml;rzlich in einer Pressemitteilung, dass Otto-Normal-Surfer viel zu achtlos
mit pers&ouml;nlichen Daten umgeht. Sogar das beliebte PGP (Pretty good privacy)
erh&auml;lt schlechte Noten. Zu leicht zu manipulieren und zu einfach f&uuml;r
leistungsstarke Entschl&uuml;sselungsmaschinen. Eine 128-Bit Verschl&uuml;sselung
sollte es demnach schon sein.
</P>
<P>
Bei aller Euphorie in der Internet-Branche zeigt sich eines ganz deutlich:
Bislang vernachl&auml;ssigte Gefahren der globalen Kommunikation und der
st&auml;ndigen Erreichbarkeit, n&auml;mlich die m&ouml;gliche st&auml;ndige &Uuml;berwachung durch
Dritte, treten insbesondere in den letzten Monaten immer mehr in der
&Ouml;ffentlichkeit in Erscheinung.
</P>
<P>
Was hat das alles mit dem Amiga zutun?
</P>
<P>
Wir stehen am Beginn einer neuen Art von Computertechnologie. Diese wird
nicht mehr prim&auml;r durch die Hardware bestimmt sondern durch ausgekl&uuml;gelte
Softwarekonzepte. Dies k&ouml;nnte ein neuer Markt des neuen Amiga werden. Von
der Spielekiste zum HiTech-Data-Security-System.
</P>
<P>
Die Alternativen Linux und Windows k&ouml;nnen auch nur mit der &uuml;blichen
fortschreitenden Computertechnologie auf die Probleme der Datensicherheit
reagieren. Die Karten werden also wieder neu gemischt.
</P>
<P>
Noch nie waren die Chancen f&uuml;r ein gro&szlig;es Comeback des Amigas so gut wie
heute.Vielleicht stehen ja auch schon bald Wurstbr&auml;ter mit
Amiga-Betriebssystem  in Rechenzenten gro&szlig;er Unternehmen. Eine m&ouml;gliche
Alternative auch f&uuml;r besonders Schutzbed&uuml;rftige private Daten ist m&ouml;glich.
</P>
<P>
Wir warten auf Antworten aus Reading und Langen (sorry Fleecy und Bill ...
das liegt einfach n&auml;her bei M&uuml;nchen) ;-)
</P>
<P>
Was werden uns TAO und Amiga Inc. pr&auml;sentieren ..... die Uhr tickt und
andere verdienen Euer Geld. Also RAN an die Zukunft.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Zwischenzeitlich lasse ich es mir (ganz konservativ) mit einer Flasche&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">guten Supermarkt-Boxbeutel gutgehen. Interessierten verrate ich auch die&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Marke .... ohne PGP&nbsp;</TD><TD VALIGN="TOP">;-)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Lebt lang und erfolgreich</B></P>
<P><B>Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="PowerPC4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
