<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - FlashUpdate von p5-PPC-Turbokarten</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>FlashUpdate von p5-PPC-Turbokarten</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>

<P>Wer stolzer Besitzer einer CyberstormPPC- oder BlizzardPPC-Turbokarte
von Phase5 ist und die erste Softwareinstallation durch die der Karte
beigef&uuml;gten CD hinter sich hat, wird fr&uuml;her oder sp&auml;ter Fehlermeldungen
einiger neuer PowerUp-Programme erhalten, die die Meldung ausgeben, da&szlig;
eine &quot;PPC-Library&quot; ben&ouml;tigt wird, die die Versionsnummer '46+' enth&auml;lt.</P>

<P>Nun wird es also <B>Zeit f&uuml;r ein Flashupdate</B> des PPC-Roms!</P>

<P>Da dies einige Schritte beinhaltet, die nicht unbedingt ausf&uuml;hrlich in
den &quot;ReadMe&quot;-Dateien von Phase5 behandelt werden, hoffe ich, hiermit eine
recht ausf&uuml;hrliche Anleitung dazu geben zu k&ouml;nnen. </P>
<P>
Die <B>Installation</B> beinhaltet drei Schritte, die ausgef&uuml;hrt werden m&uuml;ssen: </P>

<UL>
<LI>Besorgen der neuesten Phase5-Libraries und des aktuellen Update-Files. </LI>
<LI>Installation der Software</LI>
<LI>Das FlashRom-Update</LI>
</UL>

<P><B>Schritt 1</B></P>

<P>Kommen wir nun zum ersten Schritt, dem Besorgen der neuesten Phase5-
Libraries und des aktuellen Update-Files.</P>

<P>Die aktuellen erhalten Sie, sofern Sie Internetzugang haben, beim FTP-
Server von Phase5. Dieser ist unter '<A HREF="ftp://ftp.phase5.de/pub/ppc/">ftp://ftp.phase5.de/pub/ppc/</A>'
erreichbar.</P>

<P>Dort downloaden Sie die zum Zeitpunkt dieser Texterstellung aktuellen
Files herunter: '<A HREF="ftp://ftp.phase5.de/pub/ppc/68060-170599.lha">ftp://ftp.phase5.de/pub/ppc/68060-170599.lha</A>' und
'<A HREF="ftp://ftp.phase5.de/pub/ppc/FlashUpdates-300399.lha">ftp://ftp.phase5.de/pub/ppc/FlashUpdates-300399.lha</A>'.</P>

<P>Die Gr&ouml;&szlig;e der Dateien betr&auml;gt 186 KB und 940 KB. Sichern Sie diese dann
auf Ihrer Festplatte.</P>

<P><B>Schritt 2</B></P>

<P>Somit kommen wir zum zweiten Schritt, der Installation der Software.</P>

<UL>
<LI>Entpacken Sie das Archiv 68060-170599.lha in das RAM.
</LI><LI><P>Nun wechseln Sie in das Workbench-Verzeichnis &quot;LIBS&quot; und l&ouml;schen dort
  folgende Dateien:</P>

  68060.library <BR>
  68040.library   <BR>
  68040new.library<BR>
  68040old.library <BR>
  68040dummy.library <BR>

<P>  Da jetzt die neuen, im RAM vorhandenen Libraries umbenannt werden und
  danach in das LIBS-Verzeichnis kopiert werden m&uuml;ssen, sollten Sie, um
  die einfachste und schnellste Methode zu verwenden, nun das CLI aufrufen
  und von dort aus weiterarbeiten.</P>

</LI><LI>Die folgenden Befehle werden nun im CLI eingegeben (nat&uuml;rlich immer mit
  einem abschlie&szlig;endem `Return`):

  CD Ram:<BR>
  copy RAM:Libs/68040.library libs:68040new.library <BR>
  copy RAM:Libs/68040dummy.library libs:68040.library  <BR>
  copy RAM:Libs/68060.library libs:<BR>
  Endcli <BR>

</LI><LI>Damit die neuen Libraries nun auch genutzt werden k&ouml;nnen, rebooten Sie
  jetzt Ihren Amiga.
</UL>

<B>Schritt 3</B>

<P>Nun kommen wir also zum FlashUpdate.</P>

<UL>
<LI><P>Wenn Ihr Amiga wieder gestartet ist, formatieren Sie bitte eine
  bootbare Diskette im Laufwerk DF0, die Sie zum Beispiel &quot;FlashUpdate&quot;
  nennen k&ouml;nnen. </P>

  <P>Via CLI lautet der Aufruf:</P>

  format drive DF0: name Flashupdate<BR>
  install DF0:<BR>
</LI><LI>Danach kopieren Sie das f&uuml;r Ihre Turbokarte notwendige FlashUpDate-File
  auf die Diskette.

<UL>
<LI>Haben Sie eine CyberstormPPC-Turbokarte, kopieren Sie das File
    'RAM:Flashupdates/PPCUpdate' auf die Diskette.

    (via CLI: copy RAM:Flashupdates/PPCUpdate DF0:)
</LI><LI>Haben Sie eine BlizzardPPC68040-Turbokarte, kopieren Sie das File
    'RAM:Flashupdates/BlizzPPC040Update' auf die Diskette.

    (via CLI: copy RAM:Flashupdates/BlizzPPC040Update DF0:)
</LI><LI>Haben Sie eine BlizzardPPC68060-Turbokarte, kopieren Sie das File
    'RAM:Flashupdates/BlizzPPC060Update' auf die Diskette.

    (via CLI: copy RAM:Flashupdates/BlizzPPC060Update DF0:)
</LI><LI>
<P>Nun schalten Sie den Amiga aus und warten mindestens 2 Minuten! </P>
</LI><LI>
<P>Schalten Sie nun den Amiga wieder an und halten Sie die Taste &quot;s&quot;
  und beide Maustasten gedr&uuml;ckt, damit Sie in die &quot;EarlyStartupControl&quot;
  kommen.</P>
</LI><LI>
<P> Dort deaktivieren Sie alle angeschlossen Festplatten-Partitionen.
  (Disable HD0 u.s.w. im &quot;BootMenu&quot;)</P>
</LI><LI>
<P>Klicken sie nun auf &quot;boot with no startup-sequence&quot; und halten Sie
  erneut die Taste &quot;s&quot; gedr&uuml;ckt. Bitte beachten Sie, da&szlig; sich Ihre
  &quot;Flashupdate&quot;- Diskette auch wirklich im Laufwerk DF0 befindet. </P>
</LI><LI>
<P>Nach dem erneuten Booten erscheint nun auf dem Bildschirm ein Shell-
  Fenster mit einem Prompt (&quot;1:&gt; &quot;).</P>

<P>  Nun geben Sie den Namen Ihres Updateprogramms ein (&quot;PPCUpdate&quot;,
  &quot;BlizzPPC040Update&quot; oder &quot;BlizzPPC060Update&quot;) und dr&uuml;cken die
  `Return`-Taste.</P>
</LI><LI>
<P>Sollte eine Fehlermeldung direkt nach der Eingabe des gew&uuml;nschten
  Updateprogramms erscheinen, ist das Ausschalten der Turbokarte durch
  das Niederdr&uuml;cken der Taste &quot;s&quot; fehlgeschlagen. Wiederholen Sie dann
  das Update durch Dr&uuml;cken der &quot;s&quot;-Taste, wenn die Aufforderung dazu
  erscheint.</P>
</LI><LI>
<P>Jetzt f&uuml;hrt der Rechner das Update durch. Sie erkennen dies nach
  kurzer Zeit am Erscheinen von Punkten (&quot;.&quot;) auf dem Bildschirm. </P>
</LI><LI>
<P>Nun warten Sie bis das Update fertiggestellt ist und die Meldung
  `done` erscheint.</P>

<P>  <B>ACHTUNG</B>: F&uuml;hren Sie w&auml;hrend des Updates auf gar keinen Fall einen Reset
           durch oder nehmen Sie den Amiga vom Netz!</P>

           <P>Dies w&uuml;rde die Turbokarte zerst&ouml;ren und Sie k&ouml;nnen dann auch
           nicht mehr booten!</P>
</LI><LI>
<P>Wenn das Update durchgef&uuml;hrt wurde, k&ouml;nnen Sie jetzt rebooten und alles
  sollte einwandfrei funktionieren.</P>

<P>  Wenn Sie einen Blick auf die Versionsnummer der &quot;ppc-library&quot; werfen,
  m&uuml;&szlig;te jetzt die aktuelle Versionsnummer (aktuell V46.25) erscheinen.</P>

</LI></UL></ul>

<P>Unter Umst&auml;nden kann Ihr Workbenchscreen eine andere Aufl&ouml;sung als
zuvor haben. In diesem Fall sollten Sie den Amiga erneut booten und
dabei gleichzeitig die ESC-Taste dr&uuml;cken.</P>

<P>Dann kommen Sie in das Einstellungsmen&uuml; der Turbokarte. Dort stellen Sie
im Men&uuml;punkt &quot;System&quot; den Screenmodus von &quot;31khz Default Screen&quot; in &quot;No
31khz Screen&quot; um.   </P>

<P>Nach einem erneuten Booten sollte der Screen nun wieder wie gewohnt
erscheinen, unter Umst&auml;nden m&uuml;ssen Sie ihn noch mit den Preferences-
Programmen &quot;Overscan&quot; und &quot;ScreenMode&quot; optimal anpassen.  </P>

<P>Nun w&uuml;nsche ich Ihnen ein erfolgreiches Updaten Ihrer PowerPC-Turbokarte!
:-) Sollten irgendwelche Fragen offen sein, k&ouml;nnen Sie sich gerne mit
diesen an mich wenden. </P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906ahis.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906inst.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


