<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Installer-Kurs 6/6</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Installer-Kurs 6/6</H1>von<BR>
<A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></DIV>


<P>Hier eine &Uuml;bersicht &uuml;ber die Inhalte der einzelnen Kursteile:</P>

<OL>
<LI><a href="../kw/9803inst.htm">Einf&uuml;hrung, &Uuml;berblick, Grundlagen</a>          </LI>
<LI><a href="../kw/9806inst.htm">Kommunikation mit dem User, grundlegende Kommandos</a>   </LI>
<LI><a href="../kw/9809inst.htm">Dateioperationen</a>                                     </LI>
<LI><a href="../kw/9812inst.htm">Weiterf&uuml;hrende Funktionen und Statements</a>        </LI>
<LI><a href="../kw/9903inst.htm">Scriptoptimierung, Lokalisierung</a>                     </LI>
<LI><B>Tricks f&uuml;r Fortgeschrittene, Tools</B>       </LI>
</OL>

<P><B>Teil 6:</B></P>

<P>In diesem letzten Kursteil m&ouml;chte ich einfach noch ein paar Zusatztools
f&uuml;r den Installer bzw. zwei alternative Installer, die auf dem Commodore-
Installer-Konzept basieren, vorstellen.</P>

<P>Hier ein kurzer &Uuml;berblick:</P>

<UL>
<LI>Retire           </LI>
<LI>InstallerFX      </LI>
<LI>New Installer    </LI>
<LI>Savage Installer </LI>
</UL>

<P><B>Retire</B> </P>

<P>Retire ist ein unscheinbares kleines Programm, das eine, dem Installer
fehlende, sehr wichtige Funktion ersetzt, die man sonst &uuml;ber ARexx
l&ouml;sen m&uuml;&szlig;te. </P>

<P>Es entfernt vom Installer hinzugef&uuml;gte Eintr&auml;ge aus der User-Startup,
eine Aufgabe, die sehr wichtig wird, wenn man sein Script mit einer
Deinstallations-Routine versehen will. Dazu &uuml;bergibt man lediglich den
Namen der Applikation (mit welchem auch der Eintrag in der User-Startup
vorgenommen wurde), den Rest erledigt Retire.</P>

<P><B>InstallerFX</B></P>

<P>InstallerFX aus dem Hause Triumph Software ist ein AddOn f&uuml;r den
Commodore-Installer, das einfach eine graphische Aufwertung desselben
erm&ouml;glicht. So l&auml;&szlig;t sich ein eigener Screen mit Hintergrundbild erstellen,
auf dem das Installer-Fenster ge&ouml;ffnet wird, die Position des Fensters
kann ver&auml;ndert werden und es k&ouml;nnen zus&auml;tzliche Fenster ge&ouml;ffnet werden,
in denen Bilder anzeigbar sind.  </P>
<P>
Das Programm mu&szlig; dazu dem Software-Paket beigelegt werden und wird vom
Installer-Script aus gesteuert. Das Konzept basiert darauf, da&szlig; mittels
des Scripts Daten f&uuml;r das InstallerFX-Programm bereitgestellt werden
(Prefs-Files, Bilder) und das Programm dann vom Script aus mittels (RUN )
aufgerufen wird. Es interpretiert dann das gefundene Prefs-File und
reagiert entsprechend, d.h. zeigt gegebenenfalls das Bild an oder
verschiebt das Installer-Fenster. Diese Prozedur l&auml;&szlig;t sich nat&uuml;rlich
w&auml;hrend des Scripts beliebig oft wiederholen, so da&szlig; es dem User nie
langweilig zu werden braucht.    </P>

<P>Die Hintergrundbilder f&uuml;r die Screens lassen sich auch als
fl&auml;chendeckendes Muster anzeigen (Tile-Modus).</P>

<P>Das InstallerFX-Programm nimmt etwa 10 KB in Anspruch, um die das
eigentiche Paket vergr&ouml;&szlig;ert wird. Dazu kommen dann noch die Bilder.
Alles in allem stellt InstallerFX eine nette grafische Spielerei dar,
die die M&ouml;glichkeit bietet, seinen Scripts einen Hauch von optischem
Glanz zu verleihen. </P>

<P>Nat&uuml;rlich sind auch ernsthaftere Anwendungen, wie das darstellen von
Screenshots oder das Darstellen von Bildern zur Auswahl derselben w&auml;hrend
der Installation (z.B. von WB-Patterns) denkbar, jedoch ist zu bedenken,
ob das Anwachsen des Umfanges des Softwarepaketes das Resultat
rechtfertigt.    </P>

<P><B>NewInstaller</B></P>

<P>NewInstaller ist ebenfalls ein AddOn zum Original-Commodore-Installer,
jedoch mit einem v&ouml;llig anderen Konzept als InstallerFX.</P>

<P>Was NewInstaller macht, ist - grob gesagt - das automatische Erstellen
eines Installer-Scripts und hilft damit vor allem den Entwicklern. Will
man ein Softwarepaket mit Standard-Dateien wie Programmdateien, Fonts,
Libraries usw. installieren lassen, so braucht man kein eigenes Script
mehr schreiben, sondern nur ein Projekt-Icon mit dem NewInstaller als
Standardprogramm und einigen speziellen Tooltypes seinem Software-Paket
beilegen. Aber selbst das braucht man nicht von Hand machen, sondern kann
sich vom NewInstaller dieses Icon erstellen lassen.  </P>

<P>Zur Installation mu&szlig; dann nur der User den NewInstaller installiert
haben. Dieser liest dann die Tooltypes aus, bekommt durch sie ein paar
&quot;Verhaltensrichtlinien&quot; mitgeteilt und erstellt dann automatisch ein
Installer-Script. Danach ruft er den Installer mit diesem auf und l&auml;&szlig;t
es abarbeiten. Dabei merkt er sich, was er alles schon so installiert
hat und wird ein gleiches Programm noch einmal installiert, so erstellt
er ein Script mit Update-Modus. &Uuml;ber einen Tooltype l&auml;&szlig;t sich sogar das
Anbieten eines 'UnInstall-Modus' aktivieren.    </P>

<P>Damit ist aber der Funktionsumfang noch nicht ersch&ouml;pft. NewInstaller
bietet die M&ouml;glichkeit, Bilder anzuzeigen und Sounds und Module
abzuspielen, sowie die M&ouml;glichkeit, eine Verbindung zur Homepage
herzustellen oder die Software gleich online registrieren zu lassen und
LHA- bzw. LZX-Archive werden bei der Installation automatisch erkannt
und entpackt. F&uuml;r diese Funktionen werden aber die render.library, die
guigfx.library, identify.library, openurl.libray, LHA und LZX ben&ouml;tigt.</P>

<P>Zu guter Letzt bietet der NewInstaller einen Modus, in dem einfach ein
Verzeichnis angew&auml;hlt werden kann, dessen Inhalt er dann sinnvoll zu
installieren versucht.</P>

<P>Der NewInstaller bietet ein beeindruckendes Konzept, basierend auf der
Idee, jedem Entwickler die M&ouml;glichkeit zu geben, sein Paket durch ein
Installer-Script zu bereichern, ohne jedoch selbst eines schreiben zu
m&uuml;ssen.  </P>

<P>Nur geht die Rechnung so ganz dennoch nicht auf. Bei komplizierten
Installationen mu&szlig; doch wieder ein Script geschrieben werden, es gibt
Dinge, die sich nicht nach Schema-F installieren lassen.
                                                         </P>
<P>Des weiteren ist NewInstaller Shareware und die Registrierung kostet
10 DM per EMail bzw. 15 DM per Post. So mu&szlig; sich schonmal jeder Anwender,
der eine Software installieren m&ouml;chte, deren Autor den NewInstaller
benutzt hat, den NewInstaller installieren und registrieren lassen.
Nicht zu vergessen, da&szlig; er sich die entsprechenden Libraries besorgen
mu&szlig;, wenn der Programmierer diese f&uuml;r seine Installation voraussetzt.  </P>

<P>Welcher Autor m&ouml;chte das vom zuk&uuml;nftigen Benutzer seiner Software
verlangen? </P>

<P><B>Savage Installer</B> </P>

<P>Der Savage-Installer pr&auml;sentiert sich als v&ouml;llig eigenst&auml;ndiger Ersatz f&uuml;r
den Commodore-Installer. Bisher existiert er nur in einer Beta-Version,
die mit MUI-Oberfl&auml;che daherkommt. F&uuml;r die Version 1.0 plant der Autor
ein BOOPSI-GUI. Vielleicht l&auml;&szlig;t sich ja auch ein modulares Konzept a la
Miami entwickeln, es soll ja Leute geben, die MUI gar nicht so &uuml;bel
finden.   </P>

<P>Da immer noch in der Entwicklung, ist der Savage-Installer noch nicht in
der Lage, die volle Funktionalit&auml;t des Commodore-Installers zu ersetzen.
Noch nicht implementiert sind die (OPTIONAL )- und (DELOPTS )-Parameter
f&uuml;r die (COPYFILES )- und (COPYLIB )-Funktionen.</P>
<P>
Aber der Savage-Installer hat bereits neben seinem GUI auch sprachlich
neues zu bieten. So gibt es einen eingebauten (REBOOT )-Befehl zum
Resetten des Amigas, eine (DELAY )-, (BEEP )- und (RANDOM )-Funktion.
Zum Auffinden von Erweiterungskarten existiert der Befehl (FINDBOARD ),
das Kommando (DATABASE ) wurde um einige Informationen erweitert, mit
(SIMULATE-ERROR ) lassen sich RunTime-Errors simulieren, mit (COMPARE )
Werte vergleichen, und mit (SETENV ) existiert nun ein Gegenst&uuml;ck zu
(GETENV ). Letzteres ist eigentlich &uuml;berfl&uuml;ssig, da selbiges auch
mittels (TEXTFILE ) realisiert werden konnte.  </P>

<P>Besonders sch&ouml;n sind die Funktionen (CONCURRENT-DO ), mit deren Hilfe es
m&ouml;glich ist, Teile des Scripts gleichzeitig abzuarbeiten, (LET ) zum
Erzeugen lokaler Umgebungen (mit lokalen Variablen) und (SWING ), mit
welcher sich zwischen verschiedenen Installations-Seiten hin und her
schalten l&auml;&szlig;t, &auml;hnlich dem Windows-Setup-Programm.</P>

<P>Dar&uuml;ber hinaus existieren einige neue Tooltypes, Konstanten (f&uuml;r Usermodi
und Wahrheitswerte) und eingebaute Variablen. Die Einschr&auml;nkungen f&uuml;r die
Stringl&auml;nge sind entfallen und das Script kann auch bei Auftreten eines
Fehlers noch fortgesetzt werden. Au&szlig;erdem l&auml;&szlig;t sich der Savage-Installer
als AppIcon starten, auf das dann nur ein Script gezogen werden mu&szlig;, um es
auszuf&uuml;hren, oder man w&auml;hlt das Script per File-Requester aus. </P>

<P>F&uuml;r die Zukunft ist ebenfalls einiges geplant: von grafischen
Erweiterungen, wie Image-Buttons, Backgrounds und Grafikanzeige, &uuml;ber
erweiterte Funktionalit&auml;t wie &quot;Drag&amp;Drop&quot; von Icons ins Installer-Window,
bis zu neuen Funktionen, wie Erzeugen eines Icons und Onlineregistrierung.   </P>

<P>Von den hier vorgestellten ist dieses Freeware-Programm sicherlich das
vielversprechendste. </P>

<P>Die erw&auml;hnten Programme sind auf folgenden Homepages zu finden: </P>

<UL>
<LI><B>InstallerFX</B>     : <A HREF="http://www.triumph.no/">http://www.triumph.no/</A>
<LI><B>NewInstaller</B>    : <A HREF="http://home.pages.de/~Airsoft/">http://home.pages.de/~Airsoft/</A>
<br>(lt. Dokumentation: <A Href="HTTP://www.home.pages.de/~Airsoft">www.home.pages.de/~Airsoft</a>)
<LI><B>Savage Installer</B>: <A HREF="http://www.inf.tu-dresden.de/~jt18/">http://www.inf.tu-dresden.de/~jt18/</A>
</LI></UL>

<B>Retire</B> m&uuml;&szlig;ten Sie sich aus dem Aminet fischen.

<P>Damit m&ouml;chte ich diesen Kurs beenden. Ich hoffe, meine Ausf&uuml;hrungen
konnten Ihnen einen Einblick in die Sprache des Installers geben und
Sie sind nun - und mit dem in K&uuml;rze zus&auml;tzlich ver&ouml;ffentlichten Guide
als Nachschlagewerk - in der Lage, Scripts f&uuml;r Ihre eigenen Publikationen
zu schreiben.</P>

<P>Andr&eacute; Wyrwa
                    </P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906p5.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906netz.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


