<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Die Amiga-Historie</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Die Amiga-Historie</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P><B>Vorbemerkung</B></P>

<P>Sicher hat jeder Amiga-User oder -Veteran schon einiges &uuml;ber die Amiga-
Geschichte geh&ouml;rt. Die folgende Ausarbeitung, aufgeteilt in drei Teile,
hat keinen Anspruch auf Vollst&auml;ndigkeit. Allerdings habe ich den Versuch
unternommen, nach dem Durchforsten zahlreicher Texte und Quellen
m&ouml;glichst viele begr&uuml;ndete Details einzubringen, die teilweise auch
den gr&ouml;&szlig;eren Rahmen verdeutlichen sollen. Das gelegentliche Abschweifen
ist also beabsichtigt. :)</P>

<P>Auch Widerspr&uuml;che sind mir bei der Arbeit an diesem Text in manchen
Quellen gelegentlich aufgefallen und ich habe mich immer bem&uuml;ht, nur
abgesicherte Informationen einfliessen zu lassen. Trotzdem kann ich
keine Garantie f&uuml;r die Richtigkeit aller Angaben geben.</P>

<P>Dies ist mit Sicherheit eine der <B>komplexesten</B> Ver&ouml;ffentlichungen zu
diesem Thema.</P>

<P><B>Die drei Teile in der &Uuml;bersicht:</B></P>

<OL>
<LI>Von den Anf&auml;ngen bis zum Kauf durch Commodore
	<UL>
	<LI>Die Urspr&uuml;nge
</LI><LI>Eine neue Firma entsteht
</LI><LI>Meinungsverschiedenheiten
</LI><LI>Neuorientierung und Geldn&ouml;te
</LI><LI>Commodore - Aufstieg eines Pioniers
</LI><LI>Commodores Einstieg in das Computergesch&auml;ft
</LI><LI>Commodores F&uuml;hrung im Streit
</LI><LI>Atari soll zum Racheschwert werden
</LI><LI>Atari pokert um Amiga - Commodore schnappt zu
</LI><LI>Hat es sich gelohnt?
</LI><LI>Atari punktet mit dem ST</LI></UL>
</LI>
<LI>Vom ersten Amiga bis zu den ersten AGA-Hinweisen
</LI><LI>Vom Amiga 600 bis zur Gateway-&Uuml;bernahme
</LI></OL>
<HR>

<H2 align=center>1. Von den Anf&auml;ngen bis zum Kauf durch Commodore</H2>

<P>
<B>Die Urspr&uuml;nge</B></P>

<P>Anfang der achtziger Jahre gab es einen gro&szlig;en Boom von Spielkonsolen in
den USA. 1982 fanden sich daher mehrere Konstrukteure zusammen, um eine
bahnbrechende, neue Entwicklung durchzuf&uuml;hren. Ganz am Anfang waren dies
Jay Miner, der als einer der f&uuml;hrenden Atari-Hardware-Entwickler u.a.
deren 8-Bit-Computer (Atari 400/800) entwickelt hatte, und Larry Kaplan,
der vor seinem Weggang bei Atari dort als einer besten Softwareentwickler
galt.</P>

<P>Nach der Ver&auml;nderung des Managements von Atari, ausgel&ouml;st durch die
&Uuml;bernahme durch Warner Communications, einem vor allem im Musikgesch&auml;ft
erfolgreichen Konzern, waren die Top-Programmierer mit ihrer Behandlung
und den ver&auml;nderten Arbeitsbedingungen unzufrieden. Larry Kaplan k&uuml;ndigte,
zusammen mit drei anderen und sie gr&uuml;ndeten 1980 'Activison', eine
Spielefirma, die sehr erfolgreich werden sollte. Nun war Larry Kaplan
aber auch bei Activision nicht mehr ganz gl&uuml;cklich und trat bez&uuml;glich
der Neugr&uuml;ndung einer Firma (eigentlich hatte er eine Videospielfirma
im Sinn) an Jay Miner heran.</P>

<P>Bei Jay Miner fiel dieser Vorschlag auf fruchtbaren Boden. Er hatte, seit
seinem Weggang bei Atari, bei zahlreichen kleinen, meist neugegr&uuml;ndeten
Firmen gearbeitet und war nun bei dem Schrittmacherhersteller Xymos
besch&auml;ftigt, an dem er auch Aktienanteile besa&szlig;. Mit diesen wollte er
sich finanziell an der Firmengr&uuml;ndung beteiligen.</P>

<P>Als erster Finanzier konnte &uuml;ber ein angemietetes B&uuml;ro in Santa Clara ein
Million&auml;r aus Texas gewonnen werden, dem die Idee der Videospielfirma
gefiel. Jay Miner &auml;u&szlig;erte dann gegen&uuml;ber Larry Kaplan den Vorschlag, statt
nur einzelne Videospiele, gleich eine ganze Videokonsole, mit dem
Motorolla-Prozessor 68000 als Herz, zu entwickeln, die sich auch zu einem
Computer ausbauen lie&szlig;e. Diese Idee war auch der Grund f&uuml;r seinen Weggang
von Atari gewesen, da sein Vorschlag dort, angesichts der hohen Prozessor-
und Speicherkosten (der 68000 w&uuml;rde mehr RAM voraussetzen, als die
derzeitigen Atari-Heimcomputer), auf keinerlei Gegenliebe stie&szlig;. Als
seine Vorgesetzten ihm dies auch unmi&szlig;verst&auml;ndlich bedeuteten, ging er.</P>

<P><B>Eine neue Firma entsteht</B></P>

<P>Larry Kaplan war mit dem Vorschlag einverstanden und wollte sich um die
Software daf&uuml;r k&uuml;mmern. Den Geldgebern sagte er aber vorl&auml;ufig noch nichts.
Eine Firma namens 'Hi Toro' wurde in Los Gatos gegr&uuml;ndet, deren Pr&auml;sident
David Morse wurde (Larry Kaplan war zwischendurch aus dem Projekt wieder
ausgestiegen). Der Name des zuk&uuml;nftigen Wunderdings lautete 'Lorraine',
nach der Frau des Firmen-Pr&auml;sidenten.</P>

<P>Viele der Entwickler, die nun angeworben wurden, dachten bei Hi Toro im
ersten Moment an eine &auml;hnlich klingende Rasenm&auml;herfirma, so da&szlig; die Firma
schnell umgetauft wurde. Der neue Name sollte mit 'freundlich' assoziiert
werden k&ouml;nnen und so kam man auf 'Amiga' (spanisch: 'Freundin'). Als
positiven Nebeneffekt bekam man so sogar als Amiga Corporation einen
Eintrag vor Apple im Telefonbuch. Jay Miner hielt es anfangs f&uuml;r keine
gute Idee, die Firma mit einem spanischen Wort zu bezeichnen, gab aber
sp&auml;ter zu, da&szlig; er sich geirrt h&auml;tte.</P>

<P><B>Meinungsverschiedenheiten</B></P>

<P>Die Investoren wollten aber im  Gegensatz zu Jay Miner und einigen anderen
Entwicklern, wie Dale Luck und Carl Sassenrath, keinen Computer und keine
Computeroption, sondern eine reine Spielkonsole und hatten als Geldgeber
nat&uuml;rlich (eigentlich) das Sagen. Auch ein paar der Entwickler, wie R.J.
Micals, vertraten zuerst die Auffassung der Investoren, um im Design Geld
zu sparen.</P>

<P>R.J. Micals sollte &uuml;brigens Jahre sp&auml;ter, 1989, zusammen mit David Needle,
der, wie er auch, von 1982-1986 am originalen Amiga beteiligt war, f&uuml;r
Atari die portable, kleine Hand-Spielkonsole 'Lynx' fertigstellen, da
Atari nicht mit dem Abschlu&szlig; des Projektes zurecht kam.  Atari hatte diese
Entwicklung von dem vormals bekannten Spielhersteller Epyx erworben, der
sich in dieses Terrain wagen wollte, aber nicht &uuml;ber gen&uuml;gend Finanzkraft
verf&uuml;gte. Doch dies ist eine ganz andere Geschichte.</P>

<P>Zur&uuml;ck zum Amiga: 'Lorraine' wurde dann trotzdem heimlich so ausgelegt,
da&szlig; sie auch zu einem Computer ausbauf&auml;hig war, denn warum sollten die
neuen, projektierten Sound- und Grafikm&ouml;glichkeiten diesem nicht zugute
kommen?   </P>
<P>
Eigens zur Tarnung wurden Leute angestellt, die Peripherieger&auml;te
entwickelten, verkauften, sowie unter dem Namen Amiga auch u.a. Joysticks
vertrieben. Im Silicon Valley gab es viele neugierige Augen, die
Aktivit&auml;ten neuer Firmen beobachteten und versuchten, unterst&uuml;tzt durch
Ferngl&auml;ser, Geheimnisse auszuspionieren. Joysticks schienen allerdings
nicht sehr verd&auml;chtig und das Interesse legte sich.    </P>

<P><B>Neuorientierung und Geldn&ouml;te</B> </P>
<P>
Die Entwicklung zog sich immer mehr in die L&auml;nge und kostete viel Geld,
au&szlig;erdem brach 1983, wenige Monate nach Gr&uuml;ndung der Firma, der
Konsolenmarkt in den Staaten unvermutet, durch S&auml;ttigung und die starke
neue Computerkonkurrenz, pl&ouml;tzlich ein und der potentielle Markt, f&uuml;r den
man das Ger&auml;t eigentlich entwickelte, war nun nicht mehr vorhanden. Einige
Finanziers zogen sich zur&uuml;ck und hinterlie&szlig;en eine schwierige Situation.
Doch die Voraussicht der Entwickler rettete das Projekt, an das sie
glaubten, da durch die vorgesehenen Computeroption 'Lorraine' als
vollwertiger Computer weiterentwickelt werden konnte. </P>

<P>1984 pfiff die Firma schon aus dem letzten Loch, aber sie hatte auch erste,
noch sehr unf&ouml;rmige Prototypen vorzuweisen, die im Sommer auf der
einschl&auml;gigen amerikanischen Fachmesse CES in abgeschotteten
R&auml;umlichkeiten, Eindruck auf das Business machten (und machen sollten).
U.a. wurde dies mit der bekannten Boing-Demo erreicht, die erst w&auml;hrend
der Messe geschrieben wurde. F&uuml;r das Knallger&auml;usch der Kugel hatte der
Programmierer Bob Parasseau mit einem Schaumstoff-Baseballschl&auml;ger an das
Garagentor von Jay Miner gehauen und es dann mit einem Apple II gesampelt,
sowie auf den Amiga &uuml;bertragen. Man hoffte nat&uuml;rlich potentielle neue
Geldgeber auf der Messe zu finden.  </P>

<P>Dies war nicht ganz erfolglos. Auch die Firma Atari hat, noch unter
Federf&uuml;hrung des Mutterunternehmens Warner, mit 500.000 Dollar einen Teil
der Kosten finanziert, der mit Lizenzgeb&uuml;hren f&uuml;r die Nutzung der zu
entwickelnden Spezialchips verrechnet werden sollte und selbst Commodore
gab sp&auml;ter ein Lohnkostendarlehen. Trotzdem wurde die Finanzsituation
immer schwieriger und die Konstrukteure, die die M&ouml;glichkeit hatten,
mu&szlig;ten Hypotheken auf ihre H&auml;user aufnehmen, um die Firma am Leben zu
erhalten.</P>

<P>Von einer Marktreife war die Entwicklung noch ein St&uuml;ck entfernt, das
Risiko den meisten Firmen somit zu gro&szlig;. Zwei der damals weltweit gr&ouml;&szlig;ten
Mitspieler in diesem Markt, begannen sich aber konkret f&uuml;r Amiga zu
interessieren: 'Atari' und 'Commodore'.  </P>

<P>Das Ringen um die Firma Amiga und deren neue Computerentwicklung und
schlie&szlig;lich die Entscheidung, sollte einen wichtigen Punkt in der
Geschichte beider Unternehmen markieren. Und auch eine pers&ouml;nliche
Rechnung spielte dabei eine entscheidende Rolle.</P>

<P><B>Commodore - Aufstieg eines Pioniers</B></P>
<P>
Die Firma Commodore, deren Urspr&uuml;nge bis in die f&uuml;nfziger Jahre reichen,
als Jack Tramiel eine kleine Werkstatt zur Reparatur von Schreibmaschinen
in New York er&ouml;ffnete, war als Industrieunternehmen 1962 gegr&uuml;ndet worden.
Wenig sp&auml;ter geriet sie durch Jack Tramiels damaligen Investor, einem
dubiosen Risikokapitalanleger namens Paul Morgan, in Schwierigkeiten. Der
war in zahlreiche unlautere Gesch&auml;fte verwickelt und diese betrafen auch
einige der Firmen, an denen er beteiligt war, so da&szlig; schlie&szlig;lich die
kanadische Staatsanwaltschaft ermittelte. Die kanadische, weil die Firma
1956 f&uuml;r eine gewisse Zeit wegen finanzieller Vorteile nach Toronto
umgezogen war. Umz&uuml;ge aus diesen Gr&uuml;nden geh&ouml;rten lange Zeit zum Credo
von Commodore.       </P>
<P>
Jack Tramiel gelang es seine Firma aus den Querelen herauszuhalten,
brauchte aber immer noch zus&auml;tzliches Kapital. Daraufhin unterst&uuml;tzte der
Gesch&auml;ftsmann Irving Gould, ebenfalls kanadischer Risikokapitalanleger,
das Unternehmen und stieg im Gegenzug als Vorstandsvorsitzender in die
Unternehmensspitze auf, da er nun die Mehrheit der Firmenanteile hielt.
Bei unternehmerischen Entscheidungen lie&szlig; er Jack Tramiel f&uuml;r lange Zeit
freie Hand, erst viel sp&auml;ter sollte er die Firmenpolitik, als Vorsitzender
des Aufsichtsrates, wesentlich mitbestimmen, bis zum bitteren Ende.
  </P>  <P>
Anfangs nur Reparatur und sp&auml;ter Vertrieb von Schreibmaschinen, stellte
Commodore bald selbst in gro&szlig;em Ma&szlig;stab eigene her, um dann, im
aufkeimenden elektronischen Zeitalter, als erster amerikanische Hersteller
in die Produktion von Taschenrechnern einzusteigen. Einen der ersten f&uuml;r
die &Ouml;ffentlichkeit erh&auml;ltlichen 'echten' Computer stellte dann der
'Commodore PET' (alias PET 2001) dar, der von Chuck Peddle entwickelt
worden war. Er entwickelte vorher beim Halbleiterhersteller 'MOS
Technology' in Pennsylvania u.a. den legend&auml;ren 6502-Prozessor, die
erste CPU, die frei an alle Interessenten verkauft wurde, als die Firma
im Oktober 1975 von Commodore aufgekauft wurde. </P>

<P><B>Commodores Einstieg in das Computergesch&auml;ft</B></P>
 <P>
Der Grund f&uuml;r den Kauf von Zulieferfirmen und nicht zuletzt von MOS
Technology durch Commodore lag in der Produktion der Taschenrechner. Texas
Instruments war damals Zulieferer von einigen der ben&ouml;tigten Chips. Der
Erfolg, den u.a. Commodore mit diesen Ger&auml;ten erzielte, lie&szlig; aber Texas
Instruments nun eine eigene Produktion und Vermarktung von Taschenrechnern
lukrativ erscheinen. Sie entfesselten einen gewaltigen Preiskrieg, so da&szlig;
die Taschenrechner innerhalb weniger Monate statt 100 Dollar weniger als
10 Dollar kosteten. Commodore machte aus diesem Grund 5 Millionen Dollar
Verlust und wollte zuk&uuml;nftig unabh&auml;ngiger von Halbleiterzulieferern
werden. Jack Tramiel selbst sollte sp&auml;ter, getreu seinem Motto &quot;Business
is War!&quot; (Gesch&auml;ft ist Krieg!) einen Preiskampf anzetteln, dem sich viele
Mitbewerber geschlagen geben mu&szlig;ten, wie z.B. Spielzeugfabrikant Mattel,
Uhrenhersteller Timex, der mit Sinclair kooperierte, und nicht zuletzt
Texas Instruments, die sich aus dem Heimcomputersektor, auf dem sie auch
ihr Gl&uuml;ck versucht hatten, wieder zur&uuml;ckzogen. </P>
<P>
Chuck Peddle hatte bei MOS Technology einen Nachfolger f&uuml;r ein 6502-
Entwicklungssystem (KIM-I) entwickelt, einen echten Computer, aber bisher
noch keinen Interessenten daf&uuml;r gefunden. Nach der &Uuml;bernahme entdeckte
Jack Tramiel das Projekt bei einem Rundgang und war sofort bereit den
Rechner gro&szlig; herauszubringen. Der 'PET' (steht f&uuml;r 'Personal Electronic
Transactor') wurde zwar schon im Dezember 1976 angek&uuml;ndigt, aber durch die
Verz&ouml;gerung der Auslieferung wurde er nach dem Apple II doch nur zweiter
am Markt und f&uuml;r Commodore dennoch ein gro&szlig;er Erfolg. Damit geh&ouml;rte
Commodore, neben RadioShack, Apple und IBM zu den allerersten Pionieren,
die den Markt betraten.   </P>
         <P>
Bereits seit dieser Anfangszeit stellte Commodore auch f&uuml;r den
Firmenbereich Ger&auml;te her, doch lief es hier nach anf&auml;nglich guten Erfolgen,
durch eine Kombination unterschiedlichster Faktoren und Zuf&auml;lle, im
Verlauf der fr&uuml;hen achtziger Jahre f&uuml;r IBM immer besser. Doch im
Heimcomputerbereich, wo sich Anfang der achtziger Jahre zahlreiche
Mitbewerber mit den unterschiedlichsten, zueinander inkompatiblen Ger&auml;ten
tummelten, wurden sie bald zum Marktf&uuml;hrer. VC 20 und sp&auml;ter der legend&auml;re
C 64 rollten den  Markt auf.  </P>

<P><B>Commodores F&uuml;hrung im Streit</B>   </P>
<P>
W&auml;hrend die Firma einen H&ouml;henflug angetreten hatte und Ende 1983/Anfang
1984 als weltweiter Marktf&uuml;hrer im Heim- und Personalcomputergesch&auml;ft
dastand, mit h&ouml;heren Absatzzahlen als IBM, gab es zwischen Gould und
Tramiel an der F&uuml;hrungspitze jedoch Streit. Tramiel verlor ihn und verlie&szlig;
die Firma am 13. Januar 1984, zusammen mit einigen hochrangigen Vertrauten
- nat&uuml;rlich nicht als armer Mann. Der Wert seines Aktienanteils wurde auf
100 Millionen Dollar gesch&auml;tzt, nachdem das Unternehmen einen enormen
H&ouml;henflug hinter sich hatte.   </P>
<P>
1967 hatte Commodores Umsatz noch bei 50 Millionen Dollar gelegen, 1984
&uuml;berstieg er die Milliardengrenze. Der Gewinn betrug 1977 3,4 Millionen
Dollar und kletterte 1984 auf 100 Millionen. Niemand hatte dies
vorausgesehen und demzufolge hatte es auch nie eine Empfehlung zum Kauf
der Aktie gegeben. Die wenigen Investoren, die 1977 trotzdem an der B&ouml;rse
eine Commodore-Aktie erworben hatten, machten innerhalb von 7 Jahren
einen 60fachen Gewinn!            </P>
<P>
Drei Jahre fr&uuml;her hatte Jack Tramiel schon einmal den F&uuml;hrungsposten
ger&auml;umt, war aber, nachdem man mit seinem Nachfolger nicht sehr zufrieden
war, nach einem halben Jahr wieder auf seinen Platz zur&uuml;ckgekehrt. Diesmal
jedoch sollte der Abschied endg&uuml;ltig sein.     </P>

<P><B>Atari soll zum Racheschwert werden</B>    </P>
  <P>
Aus dem Business wollte er sich allerdings noch nicht verabschieden und
gr&uuml;ndete mit 'TTL', der 'Tramiel Technology Limited', eine Firma, die,
unter der F&uuml;hrung von Chiraz Chivji, dem Hauptdesigner des C 64, der
Tramiel von Commodore gefolgt war, einen neuen 16-Bit-Computer entwickeln
sollte. Kurz darauf &uuml;bernahm er vom Warner-Konzern die Consumer-Sparte der
kurz vor dem Bankrott stehenden Firma Atari, die in ihrer Bl&uuml;tezeit, vor
dem gro&szlig;en Spielkonsolen- und Automaten-Markteinbruch zu den Gro&szlig;en in
dieser Branche geh&ouml;rt hatte. Er brauchte keinen einzigen Dollar auszugeben,
sondern unterschrieb lediglich Schuldverschreibungen &uuml;ber 240 Millionen
Dollar, die nach einem bestimmten Modus zur&uuml;ckzuzahlen waren, wenn Atari
wieder die Gewinnzone erreichen sollte. So hatte er also die M&ouml;glichkeit,
den sehr bekannten Markennamen voll zu nutzen, w&auml;hrend die
Spielautomatensparte des Unternehmens als 'Atari Games' beim Warner-
Konzern verblieb.   </P>
 <P>
Nun nahm die Firma, nachdem er als erste Ma&szlig;nahme von 5.000 Besch&auml;ftigten
3.500 entlassen hatte, einen erneuten Aufschwung und sie wurde auf die
winzige Firma Amiga aufmerksam, die auf Messen eifrig um Interesse warb.
Die Entwicklung schien vielversprechend und lie&szlig; alles andere am Markt
dagegen alt aussehen. </P>

<P><B>Atari pokert um Amiga - Commodore schnappt zu</B> </P>
<P>
Doch trotzdem war Atari nicht bereit, viel Geld daf&uuml;r auszugeben. Jack
Tramiel hatte von dem (vor seiner Firmen&uuml;bernahme) von Atari gew&auml;hrten
500.000-Dollar-Darlehen erfahren und der Termin der f&auml;lligen Tilgung
r&uuml;ckte immer n&auml;her. Wenn es keine Einigung gab und Amiga das Geld nicht
zur&uuml;ckzahlen konnte, w&uuml;rde ihm deren Entwicklung in den Scho&szlig; fallen. Die
Situation war g&uuml;nstig, die Amiga-Entwickler verzweifelt. Jedes
Verhandlungsangebot zum Kauf der Amiga-Aktien schlug Atari aus und war
von mal zu mal nur bereit, immer weniger zu bezahlen. F&uuml;r die Amiga-Leute
schien die Situation einen bitteren Ausgang zu nehmen.</P>

<P>Doch Commodore hatte Wind von der Angelegenheit bekommen und die Absicht,
diese, f&uuml;r die Zukunft m&ouml;glicherweise entscheidende Entwicklung, nicht
Atari zu &uuml;berlassen. Aus Angst zu sp&auml;t zu kommen, &uuml;berboten sie, wenige
Tage vor dem f&auml;lligen Termin, das Angebot von Atari (die ja inzwischen
immer weniger boten) mit 27,1 Millionen Dollar um das Vielfache und der
Verkauf war perfekt. Atari hatte geplant lediglich die neue Technologie
zu erwerben, Commodore jedoch &uuml;bernahm die komplette Entwicklercrew.        </P>

<P>Atari war sauer &uuml;ber das geplatzte Gesch&auml;ft und verklagte Amiga Corp. auf
100 Millionen Dollar Schadenersatz, um die Spezialchips doch noch zu
bekommen, deren Entwicklung sie mitfinanziert h&auml;tten und eine eventuelle
Verwendung in zuk&uuml;nftigen Amiga-Rechnern zu untersagen. Commodore
antwortete mit einer Gegenklage, da Atari nur die Amiga-Auslieferung
verz&ouml;gern wolle und au&szlig;erdem Top-Entwickler von Commodore abgeworben
h&auml;tte. Der Rechtstreit dauerte Jahre und konnte erst im M&auml;rz 1987
au&szlig;ergerichtlich beigelegt werden. Eine entscheidende Verz&ouml;gerung der
Amiga-Entwicklung hatte er jedoch nicht bewirkt.    </P>

<P><B>Hat es sich gelohnt?</B>      </P>

<P>Doch was hatte man sich da eigentlich ins Haus geholt? </P>

<P>Der Amiga, denn der Computer wurde schlie&szlig;lich nach der &uuml;bernommenen Firma
benannt, war seiner Zeit meilenweit voraus, in einem Ma&szlig;e, das f&uuml;r uns
heute kaum mehr vorstellbar ist. Er bot bereits in seiner ersten
Verkaufsversion eine, f&uuml;r damalige Verh&auml;ltnisse, riesige Bildaufl&ouml;sung von
640x512 Punkten bei maximal 4096 Farben gleichzeitig, 4-Kanal-Stereo-Sound,
eine hohe Geschwindigkeit und Multitasking - damals fast ein Fremdwort. </P>

<P>Der erste Amiga, der im Juli 1985 in einer Gala-Veranstaltung im New
Yorker Lincoln-Center u.a. von Pop-Art-K&uuml;nstler Andy Warhol und S&auml;ngerin
Debbie Harry (Blondie) vorgestellt wurde und schlie&szlig;lich im September
herauskam, war der Amiga 1000. Mit 1000 wurde er allerdings erst sp&auml;ter
bezeichnet, als weitere Amigas erschienen. Sein Betriebssystem war
noch sehr instabil und mu&szlig;te zu Beginn daher von Diskette geladen werden.
Urspr&uuml;nglich hatten die Amiga-Entwickler ein eigenes Betriebsystem namens
'CAOS' (Commodore Amiga Operating System) entwickelt, aber technische
Probleme verz&ouml;gerten den Abschlu&szlig; und es war absehbar, da&szlig; bei
Fertigstellung der Hardware, das Betriebssystem von einer
Ver&ouml;ffentlichungsf&auml;higkeit noch weit entfernt sein w&uuml;rde. Doch
die Zeit dr&auml;ngte.    </P>
                              <P>
<B>Atari punktet mit dem ST</B>
 </P>
<P>Atari hatte bereits w&auml;hrend der Verhandlungen um die Amiga-Entwicklung ein
eigenes Projekt am Laufen, das nach dem Scheitern des Zukaufs in
vergleichsweise kurzer Zeit zur Marktreife bebracht wurde - den Atari ST
(ST steht &uuml;brigens f&uuml;r SixTeen '16', was sich auf seine 16 Bit
Verarbeitungsbreite bezieht). Er war in vielen Punkten sicher nicht so
revolution&auml;r, wie der Amiga; sein fr&uuml;heres Erscheinen (Premiere im Januar
1985, zu kaufen ab Sommer 85) und sein Preis pr&auml;destinierten ihn aber f&uuml;r
die Rolle des 'Apple Macintosh des kleinen Mannes', da der Preis des
Atari 520 ST mit 512 KB RAM nur etwa ein Drittel eines vergleichbarer
Apples betrug. In Sachen Textverarbeitung, DTP und im Soundeditierbereich
(durch eine serienm&auml;&szlig;ige MIDI-Schnittstelle), gab es bald professionelle
L&ouml;sungen f&uuml;r ihn und f&uuml;r eine lange Zeit wurde er zum sch&auml;rfsten
Konkurrenten des Amiga.      </P>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../cc/9906bb.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906p5.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


