<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Neuigkeiten von Haage &amp; Partner</H2>
<P><B>Haage &amp; Partner (<A HREF="http://www.haage-partner.com" TARGET="_top">http://www.haage-partner.com</A>) informiert:</B></P>
<P>
<H3>&raquo;06. April 2001:<BR>
Boing Bag #1 f&uuml;r OS 3.9</H3>
</P>
<P>
Rechtzeitig zur Gateway Computer Show Amiga 2001 konnten Amiga Inc. und H&amp;P
das Boing Bag #1 f&uuml;r OS 3.9 zur Verf&uuml;gung stellen. Die interessanteste
Funktion ist sicherlich AsyncWB, die das asynchrone Kopieren und L&ouml;schen
von Dateien auf der Workbench erm&ouml;glicht. Zus&auml;tzlich sind enthalten:
neue GenesisPrefs, &uuml;berarbeitete HDToolBox, AMPlifier, ViNCEd, WBRun,
UnArc, RAWBInfo, BenchTrash und einige andere Verbesserungen.
Nachtrag: Mittlerweile gibt es eine neue Version (5.254.174 Bytes) des
Boing Bag #1, die einige kleine &Auml;nderungen enth&auml;lt:
neue Version von Blanker, CrossDOS, Exchange und FKey
&uuml;berarbeitete deutsche Locale f&uuml;r IconEdit
Lesen Sie den vollst&auml;ndigen Text oder laden Sie das Update direkt herunter.
</P>
<P>
<H3>06. April 2001:
H&amp;P auf der Gateway Computer Show 2001</H3>
</P>
<P>
Auch in diesem Jahr war H&amp;P auf der Gateway Computer Show Amiga 2001 in St.
Louis, USA (30. M&auml;rz bis 1. April) vertreten. Haupts&auml;chlich haben wir das
neue StormC 4 Compiler-System vorgestellt und Seminare zu StormC und
AmigaOS 3.9 abgehalten. Ein kurzer Bericht, der f&uuml;r amiga-news.de erstellt
wurde, fa&szlig; die Eindr&uuml;cke zusammen.
</P>
<P>
<H3>06. April 2001:<BR>
PageStream 4.0.9 f&uuml;r Amiga</H3>
</P>
<P>
Seit ein paar Tagen hat Grasshopper LLC die Version 4.0.9 von PageStream
f&uuml;r Amiga und Macintosh fertiggestellt, die Windows-Version ist schon etwas
l&auml;nger erh&auml;ltlich. Die &Auml;nderungen betreffen Korrekturen bei der
Druckausgabe, PDF-Kompression, schnellere Korrekturfunktion und Trennung
und einiges mehr.
</P>
<P>
Die Kunden, die sich bei uns f&uuml;r den Online-Service registriert haben,
haben gestern eine Mail mit den Daten f&uuml;r den Download erhalten. Alle
anderen Kunden k&ouml;nnen sich noch registrieren lassen.
</P>
<P>
<H3>10. April 2001:<BR>
Update Patches f&uuml;r StormC 4</H3>
</P>
<P>
Zu StormC 4 gibt es ein erstes Update, das verschiedene Probleme behebt und
die Unterst&uuml;tzung f&uuml;r Mixed Binaries und Shared Libraries verbessert bzw.
vervollst&auml;ndigt.
</P>
<P>
<H3>17. April 2001:<BR>
STL f&uuml;r StormC 4</H3>
</P>
<P>
Raymond Zarling hat die Standard Template Library (STL) f&uuml;r StormC 4
portiert. Diese Bibliothek ist eine umfangreiche Sammlung von Algorithmen
und Datenstrukturen, die die Erstellung von Programmen sehr erleichtern
kann. Sie ist auch als Teil des aktuellen C++ Standards festgelegt.
Die Amiga-Sourcen findet man im Aminet, die Original-Sourcen sind auf
stlport.org und die Dokumentation findet man auf sgi.com.
</P>
<P>
<H3>20. April 2001:<BR>
C/C++ Kurs</H3>
</P>
<P>
Schon letztes Jahr hat Sven Grempli einen C/C++ Kurs zusammengestellt und
auch ein passendes Forum dazu eingerichtet. Diese ist sicherlich ein guter
Einstieg f&uuml;r Anf&auml;nger.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
