<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="fd-hitparade.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Kommentar zur j&uuml;ngsten Kurskorrektur AMIGAs (von Oliver Tacke)</H2>
<P><B>Meine pers&ouml;nlichen Gedanken zu den letzten Ank&uuml;ndigungen</B></P>
<P>
von Oliver Tacke
</P>
<P>
Jetzt sind sie also raus, die neuen Pl&auml;ne von Amiga, Inc. Und was haben sie
nicht f&uuml;r Wellen geschlagen! Die einen bef&uuml;rworten sie, die anderen lehnen
sie ab, und alle diskutieren mehr oder weniger sachlich dar&uuml;ber.
</P>
<P>
Langj&auml;hrige Amiga Fans, entt&auml;uscht, weil es nicht das ist, was sie erwartet
haben, entsagen nun dem Amiga - oder zumindest den neuen Eignern und ihren
Pl&auml;nen. Verschlimmert wurde die Situation noch dadurch, dass Amiga, Inc. es
anscheinend immer noch nicht verstanden hat, vern&uuml;nftige
Informationspolitik zu betreiben. Die Neuigkeiten musste man sich aus
Newsgroups und von diversen Internetseiten zusammensuchen, und dabei
blieben vielfach Fakten auf der Strecke. Fleecy Moss ist zwar bem&uuml;ht durch
das Richtigstellen in einer Mailingliste die Ger&uuml;chte und falschverstandene
Meldungen den Schaden zu begrenzen, aber Erfolg auf ganzer Linie hat er
damit nicht gehabt.
</P>
<P>
Ich habe in den letzten Tagen hunderte von emails zum Thema gelesen und
hunderte von Postings durchforstet, um mir ein Bild von der Situation zu
machen. Zu welchen Schlussfolgerungen ich gekommen bin, m&ouml;chte ich an
dieser Stelle der Amiga Gemeinde (und nat&uuml;rlich auch allen anderen, die es
interessiert), mitteilen.
</P>
<P>
Gehen wir doch zuerst auf die Frage ein, warum es jetzt doch ein OS 4.0
geben soll, obwohl Amiga, Inc. noch w&auml;hrend der letzten K&ouml;lner Messe gesagt
hat, dass OS 3.9 die letzte Version des AmigaOS sein solle, sofern nicht
mindestens 50.000 Exemplare davon verkauft w&uuml;rden.
</P>
<P>
Damals bestanden noch die Bestrebungen, das AmigaDE unmittelbar in ein
eigenst&auml;ndiges Betriebssystem zu wandeln. Das AmigaOS 4.0 w&auml;re dann ein
zweites Desktopbetriebssystem gewesen, das man h&auml;tte parallel entwickeln
m&uuml;ssen, d.h. man h&auml;tte Entwickler f&uuml;r zwei eigenst&auml;ndige Betriebssysteme
abstellen m&uuml;ssen. Da das AmigaDE nun aber nicht zu einem eigenst&auml;ndigen
Betriebssystem weiterentwickelt wird, ist das AmigaOS 4.x als Host ein
vitaler Bestandteil von Amiga, Inc.s Strategie geworden, denn langfristig
soll das AmigaOS 4.x durch die Integration des AmigaDE zum AmigaOS 5
werden, das auch f&uuml;r andere Prozessoren als den PowerPC zur Verf&uuml;gung
stehen wird, ohne Zweifel auch f&uuml;r die x86 Familie. AmigaOS 5 ist dann das,
was Amiga, Inc. angek&uuml;ndigt hat: ein im Wesentlichen Hardware unabh&auml;ngiges
Betriebssystem.
</P>
<P>
Viele Diskussionen drehten sich auch darum, dass das AmigaOS 4 nicht mehr
auf den jetzigen PowerPC Boards der jetzigen Amigas laufen wird. Das ist
ein Punkt, bei dem ich zwar Amiga, Inc.s Seite verstehen kann, aber dennoch
nicht 100 prozentig damit zufrieden bin. Die jetzigen Amigas mit all ihren
Erweiterungen sind, n&uuml;chtern betrachtet, Flickenschusterei. Das beginnt bei
den vielen total unterschiedlichen Hardware Komponenten, in letzter Zeit
noch bereichert durch mehrere PCI-Bus-Boards basierend auf
unterschiedlichen Ans&auml;tzen, und h&ouml;rt beim Betriebssystem mit zahllosen
Patches und Erweiterungen noch nicht auf.
</P>
<P>
Mit dem AmigaOne bzw. der zico Spezifikation und dem AmigaOS 4 soll es eine
saubere neue Basis geben frei von Hacks und Patches geben. Es ist
sicherlich um ein Vielfaches einfacher, f&uuml;r diese einheitliche Basis
Produkte zu entwickeln als eine Vielzahl von verschiedenen Konfigurationen
zu ber&uuml;cksichtigen. Von einem gr&ouml;&szlig;eren Programm, das momentan auf jeder
Konfiguration einwandfrei l&auml;uft, habe ich in der letzten Zeit nichts
geh&ouml;rt. Au&szlig;erdem kommt irgendwann im Leben einer Hardware der Zeitpunkt, an
dem sie wirklich nicht mehr zeitgem&auml;&szlig; ist. Unsere jetzigen Amigas sind 8
Jahre alt und laufen immer noch prima, was bewundernswert ist, wenn man
sich einmal die Austauschzyklen aus dem PC Bereich ansieht. Irgendwann
einmal werden aber auch sie ihr Leben aushauchen. Ein nagelneuer Amiga ist
also gar nicht so verkehrt, wenn er auch noch oben genannte Vorteile
besitzt.
</P>
<P>
Ich bin mir &uuml;brigens sicher, dass ein neuer Amiga immer noch g&uuml;nstiger sein
wird, als seinen jetzigen noch mit USB, G3/G4, etc. auszur&uuml;sten, um die
zico Spezifikation zu erf&uuml;llen.
</P>
<P>
Von diesem Standpunkt aus gesehen, ist es sicherlich sinnvoll, einen
Schnitt zu machen.
</P>
<P>
Andererseits werden nat&uuml;rlich die User im Regen stehen gelassen, die ihre
jetzigen Amigas hochgez&uuml;chtet haben und darauf neue Programme nicht laufen
lassen k&ouml;nnen. Dass die PPC Boards von phase5 kamen und nicht von Amiga,
Inc. spielt da keine Rolle. Ich hoffe mal, dass da noch nicht das letzte
Wort gesprochen wurde.
</P>
<P>
Im &Uuml;brigen finde ich es w&auml;re besser, wenn sich anstatt nur zu meckern ein
paar f&auml;hige Programmierer zusamment&auml;ten und Amiga, Inc. anb&ouml;ten, einen zico
Layer f&uuml;r die jetzigen Amigas zu programmieren, so dass OS 4.x auch darauf
lauff&auml;hig w&auml;re. Laut Fleecy Moss ist Amiga, Inc. f&uuml;r solche Angebote
jederzeit offen.
</P>
<P>
Im Falle eines Flops des AmigaDE (und damit auch ein wahrscheinlicher Flop
des AmigaOS 4 und ein Aus f&uuml;r AmigaOS 5) ist ein AmigaOne aber nutzlos, da
man ihn dann nur noch f&uuml;r AmigaOS 4 oder vielleicht noch LinuxPPC (oder
MorphOS, falls es darauf l&auml;uft) benutzen kann. Die Situation w&auml;re dann
nicht besser als jetzt, nur w&auml;re man um einige Mark &auml;rmer.
</P>
<P>
Das ist wohl korrekt. All diejenigen, die dieses Risiko nicht eingehen
wollen, k&ouml;nnen sich aber auch einen PC zulegen (falls sie noch keinen
haben) und das AmigaDE gehosted auf Windows oder Linux laufen lassen. Es
besteht laut Fleecy Moss die M&ouml;glichkeit dies sogar so zu machen, dass man
vom Host gar nichts mitbekommt. Floppt das AmigaDE, kann man immer noch
Windows oder Linux benutzen. Floppt das AmigaDE nicht, dann wird es wohl
auch AmigaOS 5 geben, das sp&auml;ter auch nativ auf dem PC laufen wird; dann
kann man immer noch umsteigen.
</P>
<P>
Ein AmigaOne ist also wirklich ein finanzielles Risiko. F&uuml;r die Hardcore
Amiganer, die aber bis jetzt noch immer keinen PC als Zweitrechner haben
(so einer bin ich &uuml;brigens auch und es soll noch einige mehr geben) und
sich auch fragen wie lange ihr Rechner es wohl noch macht, wird ein solcher
Rechner aber wie gerufen kommen. Allen anderen steht obige Alternative
offen.
</P>
<P>
Warum also nicht gleich das AmigaOS 4 auf x86 portieren anstatt auf
PowerPC? Viele Amiga User w&uuml;rden einen PowerPC sicherlich der x86 Familie
vorziehen, die Gr&uuml;nde daf&uuml;r m&ouml;gen vielf&auml;ltig sein. Abgesehen davon d&uuml;rfte
der PPC vielen Amiga Programmierern aber vertrauter sein und Haage&amp;Partner
haben vermutlich schon Vorarbeit geleistet.
</P>
<P>
Einige Leute haben bem&auml;ngelt, dass man das AmigaOS 4 nicht testen kann,
wenn man keinen AmigaOne hat. Das ist korrekt. Andererseits kann man die
neuesten Versionen von Windows oder MacOS auch nicht vorher testen (es sei
denn, man zahlt noch daf&uuml;r und spielt Betatester). Man muss sich wohl auch
auf Testberichte verlassen, sich Vorf&uuml;hrungen auf Messen ansehen oder
jemanden finden, der sich bereits einen AmigaOne zugelegt hat. Ich bin mir
aber sicher, dass es auf einer Messe Demonstrationen geben wird.
Sicherlich ist das nicht zufriedenstellend. Dem muss ich zustimmen. Ich
kann nur wieder an f&auml;hige Programmierer appellieren, Amiga, Inc.
anzubieten, einen zico Layer f&uuml;r jetzige Amigas zu schreiben.
</P>
<P>
Beschuldigt wurde Amiga, Inc. SDK Programmierer an der Nase herumgef&uuml;hrt zu
haben. Durch die angek&uuml;ndigten Partnerschaften mit Sharp und Psion sah es
so aus, als wolle man sich nur noch auf den PDA- oder den Settopbox-Markt
beschr&auml;nken. Die Leute, die sich in der Hoffnung auf ein neues Amiga-
Desktop-OS das SDK zugelegt haben, seien betrogen worden.
</P>
<P>
Dem ist aber nicht so. Mit dem AmigaDE ist es nach wie vor m&ouml;glich,
Applikationen auch f&uuml;r Desktops zu schreiben, denn es l&auml;uft gehosted auf
Windows und Linux und im AmigaOS 5 auch nativ. Die Grenze zwischen PDA- und
Desktop-Software verschwimmt blo&szlig;. Das AmigaDE ist weder f&uuml;r PDAs allein
bestimmt, noch f&uuml;r den Desktop. Es ist eine Content Umgebung. In dieser
Umgebung l&auml;uft alles, wenn die darunter liegende Maschine die Anforderungen
daf&uuml;r erf&uuml;llt. Schreibt man z.B. einen 3D-Shooter f&uuml;r das AmigaDE, ist es
dann eine Desktop Anwendung oder eine f&uuml;r einen PDA? Wenn der PDA genug
Leistung hat, l&auml;uft das Spiel auch darauf. Ich setze jetzt einmal bewusst
H&auml;kchen um das &quot;Desktop&quot;, um diese starre Definition zu markieren: es ist
also nach wie vor m&ouml;glich, auch f&uuml;r den &quot;Desktop&quot; Anwendungen zu
programmieren.
</P>
<P>
Sollte man jetzt Software f&uuml;r das AmigaOS 4 oder f&uuml;r das AmigaDE
entwickeln?
Da das AmigaDE auf AmigaOS 4.2 laufen wird (und auf anderen Plattformen),
ist der Absatzmarkt daf&uuml;r nat&uuml;rlich gr&ouml;&szlig;er und f&uuml;r Hersteller
vielversprechender.
</P>
<P>
Wie soll AmigaOS 4.0 eigentlich im Sommer schon fertig sein, fragt man
sich. Die Entwicklung der Viererreihe des OS wird schrittweise erfolgen,
d.h. neue Features werden nach und nach eingebaut. Es bleibt abzuwarten,
welche neuen Features es ins OS 4.0  schaffen und wie gro&szlig; der Unterschied
zum OS 3.9 sein wird. Ich spekuliere im &Uuml;brigen darauf, dass Haage&amp;Partner
bereits Vorarbeit bez&uuml;glich der PowerPC Portierung geleistet haben, d.h.
dort wurde schon Zeit gespart.
</P>
<P>
Vielfach wurden auch Vorw&uuml;rfe laut, aus AmigaOS 4.0 k&ouml;nnte nichts
Vern&uuml;nftiges werden, wenn Haage&amp;Partner dies &uuml;bern&auml;hmen. Ralph Schmidt sei
mit MorphOS die bessere Wahl gewesen, aber das h&auml;tten Haage&amp;Partner wohl
verhindert.
</P>
<P>
Was die Softwarequalit&auml;t von Haage&amp;Partner Produkten angeht, l&auml;sst sich
sicherlich streiten. Ich habe z.B. MorphOS bei mir auch nicht zum Laufen
bewegen k&ouml;nnen.Aber wie gesagt, &uuml;ber Softwarequalit&auml;t l&auml;sst sich streiten.
Au&szlig;erdem wird Haage&amp;Partner AmigaOS 4.x nicht selbst schreiben, sondern nur
ihren Teil dazu beisteuern. Das AmigaOS 4.x kommt von Amiga, Inc. und muss
auch dort durch die Qualit&auml;tskontrolle.
</P>
<P>
Was die Sache mit der Partnerwahl betrifft: Amiga, Inc. hat vielen Parteien
angeboten, an der Entwicklung des neuen AmigaOS teilzuhaben. Amiga, Inc.
hat aber auch die Bedingungen gestellt. Ralph Schmidt hat abgelehnt, weil
ihm die Konditionen nicht zugesagt haben. Das ist sicherlich kaum
Haage&amp;Partner anzulasten. Alles andere sind f&uuml;r mich nur unhaltbare
Unterstellungen immer noch zur&uuml;ckzuf&uuml;hren auf den Kernel Krieg.
</P>
<P>
Viele Leute bem&auml;ngeln, dass das AmigaOS 5 als Hardware unabh&auml;ngiges
Betriebssystem zu sp&auml;t komme (sicherlich nicht vor 2003). Als ernste
Konkurrenz wird immer Microsofts .net genannt.
</P>
<P>
Diese Kritik ist begr&uuml;ndet. Microsoft ist sicherlich ein harter Konkurrent.
Das AmigaDE wird aber voraussichtlich fr&uuml;her erscheinen, wenn auch nicht
als eigenst&auml;ndiges OS. Es wird vermutlich auf mehr Plattformen lauff&auml;hig
sein als .net (Microsoft beschr&auml;nkt sich vorerst auf Windows Derivate) und
.net ist auch nur ein Aufsatz bzw. eine Produktstrategie. Das AmigaDE
sollte also sowohl einen Zeitvorteil haben und auch sonst noch ein paar
Vorteile bieten.
</P>
<P>
Man sollte aber auch bedenken, dass Amiga, Inc. ein neues Betriebssystem
nicht aus dem Hut zaubern kann.
</P>
<P>
Und warum geht man den Umweg &uuml;ber AmigaOS 4.0 zum AmigaOS 5.0 anstatt das
AmigaDE zum eigenst&auml;ndigen Betriebssystem zu entwickeln?
Amiga, Inc. ist Eigent&uuml;mer des Quellcodes des AmigaOS. Die Rechte am
Quellcode von Elate liegen bei der Tao Group. Letztere ist sicherlich nicht
bereit, diesen einfach so bereitzustellen. Man w&uuml;rde sich diesen sicherlich
teuer bezahlen lassen - und Geld daf&uuml;r d&uuml;rfte Amiga nicht &uuml;brig haben.
Au&szlig;erdem hat man mit dem AmigaOS als DesktopOS bereits Erfahrung, die man
sich bei Elate erst aneignen m&uuml;sste.
</P>
<P>
Aber wie z.B. soll man Speicherschutz nachtr&auml;glich ins AmigaOS einbauen?
Das &quot;Bodyguard&quot; Projekt ist ja damals auch gescheitert.
</P>
<P>
Da sollte man unterscheiden zwischen aufgesetzt/gepatcht (Bodyguard) und
neu geschrieben (AmigaOS 4). Sicherlich ist das beim Neuschreiben immer
noch nicht einfach, aber das scheint Amiga, Inc. auch begriffen zu haben,
denn OS 4.5 (die Version mit Speicherschutz), soll nicht vor Sommer 2002
erscheinen.
</P>
<P>
Im &Uuml;brigen wird es, wenn ich es richtig verstanden habe, auch keinen
Speicherschutz f&uuml;r 68k Programme geben. Diese sollen in einer
Emulationsumgebung laufen und k&ouml;nnen sich nach wie vor gegenseitig
abschie&szlig;en. Nur wird das auf das AmigaOS 4 bzw. Programme daf&uuml;r keinen
Einfluss haben. Diese sollen weiterlaufen und sind nat&uuml;rlich auch
untereinander gesch&uuml;tzt.
</P>
<P>
Amiga, Inc.s Informationspolitik ist grausam, h&ouml;rt man oft.
</P>
<P>
Dem habe ich wirklich nichts entgegen zu setzen, wie ich eingangs ja auch
erw&auml;hnt habe. Es ist ja verst&auml;ndlich, wenn Bill McEwen die Neuigkeiten
zuerst auf der Messe verk&uuml;nden will, aber man sollte doch soviel Weitsicht
aufbringen, dass diese Ank&uuml;ndigungen f&uuml;r Verwirrung sorgen und zu Ger&uuml;chten
f&uuml;hren. Das das alles auf den 1. April fiel, hat es sicherlich nicht besser
gemacht.
</P>
<P>
Warum z.B. hat man nicht kurz darauf eine offizielle Pressemitteilung auf
die Homepage von Amiga, Inc. gestellt? Warum gab es nicht gleich eine
Roadmap mit den wichtigsten Details? All das sind Fragen, auf die ich auch
keine Antwort wei&szlig;. Bleibt zu hoffen, dass sich da bald etwas tut.
</P>
<P>
Komme ich mal zum Schluss: Amiga, Inc. scheint eingesehen zu haben, wenn
vielleicht auch etwas zu sp&auml;t, dass das Ziel eines Hardware unabh&auml;ngigen
Betriebssystems in so kurzer Zeit zu hoch gesteckt war.
</P>
<P>
Es w&auml;re heutzutage ja auch wenig sinnvoll, ohne ein entsprechendes
Softwareangebot ein neues Betriebssystem herauszubringen. Wenn das AmigaDE
kein Flop wird, dann sollte mit der Auslieferung des AmigaOS 5 auch genug
Software zur Verf&uuml;gung stehen.
</P>
<P>
Sicherlich wird auch das liebe Geld eine Rolle gespielt haben. Mit AmigaOS
4 soll sicherlich auch erst einmal ein wenig Geld in die Kasse gebracht
werden, denn keine Firma kann l&auml;ngerfristig ohne ein Produkt &uuml;berleben. Ich
w&uuml;rde lieber ein wenig l&auml;nger auf AmigaOS 5 warten, als dass es gar nicht
erscheint.
</P>
<P>
Sicherlich fu&szlig;t alles, was ich hier geschrieben habe, bis zu einem gewissen
Grade auf Spekulationen und Hoffnung. Das will ich gar nicht leugnen. Es
schmeckt mir eigentlich gar nicht, in dem Ma&szlig;e &uuml;ber ungelegte Eier zu
diskutieren, aber das Thema ist mir zu wichtig, als dass ich einige Sachen
unkommentiert stehen lassen m&ouml;chte.
</P>
<P><B>Oliver Tacke &lt;<A HREF="mailto:oliver@aakt.de">oliver@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
