<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="fd-hitparade.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Kommentar zur j&uuml;ngsten Kurskorrektur AMIGAs (von Gernod Schomberg)</H2>
<P>
Im AMIGA aktuell 0401 schrieb Carsten Schr&ouml;der in seinem Schlusswort:
&quot;AMIGA nimmt einmal mehr einen Kurswechsel vor&quot; und erl&auml;uterte seine
Meinung eingehend. Ich empfand genau so und gab ihm vollkommen recht.
</P>
<P>
Ich habe einen Rechner A4000T, unbeschleunigt und ohne Grafikkarte,
weil f&uuml;r mich vor allem die Videobearbeitung wichtig war, die damals
mit keinem anderen Ger&auml;t in &auml;hnlicher Qualit&auml;t m&ouml;glich war. Da h&auml;tte
die Grafikkarte h&ouml;chstens gest&ouml;rt. Leider ist eine Speicheraufr&uuml;stung
nur bis 16 MBytes m&ouml;glich, aber es gibt nur sehr selten Situationen,
wo das nicht ausreicht. Ein PPC-Board hatte ich nicht gekauft, weil der
PowerUP/WarpUP-Streit mir nicht geheuer war. Einen PC modernerer Bauart
habe ich nicht!
</P>
<P>
Nach der Ank&uuml;ndigung vor einem Jahr, mit dem AmigaDE ein System zu
schaffen, das auf den, man muss es leider sagen, Standardrechnern von
heute, n&auml;mlich x86-PCs, lauff&auml;hig ist, und dass ein Rechner dieser Art
als neuer Amiga von anderen Firmen entwickelt w&uuml;rde, hoffte ich, dieses
Jahr meinen A4000T aufs Altenteil versetzen zu k&ouml;nnen. Man mag Windows
m&ouml;gen oder nicht, Tatsache ist, dass die meisten Programme heute f&uuml;r
dieses System entwickelt werden und man h&auml;tte mit so einem Rechner,
den man mit einem beliebigen System starten kann, Zugang auch zu den
Programmen, die es eben f&uuml;r Amiga in der Art oder Qualit&auml;t (noch) nicht
gibt! Und, wie Carsten schreibt, man h&auml;tte sehr einfach die Benutzer des
anderen Systems von der Einfachheit und Sch&ouml;nheit des AmigaOS &uuml;berzeugen
k&ouml;nnen.
</P>
<P>
Und nun kommt die Mitteilung von Bill McEwen, dass ein Betriebssystem
f&uuml;r eine neue Computerplattform auf PPC-Basis entwickelt wird! Das neue
Betriebssystem l&auml;uft nicht auf meinem Rechner, liefe sicher auch nicht,
wenn ich eine Beschleunigerplatine eingebaut h&auml;tte, also br&auml;uchte ich
einen der neuen Rechner! Gut, das Geld habe ich gespart, weil ich weder
PPC- noch Grafik-Board habe. Aber der Neue k&ouml;nnte eben nur AmigaOS4.0
und ben&ouml;tigt die passenden Programme. Wenn schon f&uuml;r den jetzigen Amiga
nur noch Liebhaber des Systems schreiben, davon aber mit Sicherheit nicht
leben k&ouml;nnen, wieviele Programme kann man dann f&uuml;r die neue Plattform
erwarten? Es bleibt die Emulation zum alten AmigaOS &uuml;brig, aber wie die
laufen wird, ist abzuwarten. Und neue Programme gibt es da erst recht
nicht.
</P>
<P>
Zwar wurde die erste Mitteilung inzwischen etwas relativiert, die
Entwicklung auch f&uuml;r das AmigaDE ginge mit voller Kraft weiter, aber die
M&ouml;glichkeiten von AMIGA sind doch recht beschr&auml;nkt. Ich hatte meinen ersten
Amiga 1989, da war ich 64 Jahre jung. Ich f&uuml;rchte, jetzt geht es AMIGA wie
mir, uns beiden l&auml;uft die Zeit davon! Ich hoffe mit AMIGA Inc., dass wir
einen universellen Rechner mit AmigaDE noch zu unser beider Lebzeiten zu
Gesicht bekommen werden!
</P>
<P><B>Gernod Schomberg &lt;<A HREF="mailto:G.Schomberg@t-online.de">G.Schomberg@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Forum3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
