<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
<b>AMIGA nimmt einmal mehr einen Kurswechsel vor - Teil 2 (von Carsten Schr&ouml;der)</b>
</P>
<P>
Seit der &uuml;berraschenden Kurskorrektur, die AMIGA auf der Messe in St. Louis
bekannt gegeben hat, ist nun ein Monat vergangen, in dem jeder Amiga-
Anwender die M&ouml;glichkeit hatte, sich die Entscheidungen begreiflich zu
machen. Erleichtert wurde dies durch das technische Update, welches das
Unternehmen Mitte April heraus gegeben hat. Dieses verdeutlicht, dass sich
zwar an dem Ziel, ein hardwareunabh&auml;ngiges und skalierbares Betriebssystem
zu schaffen, offenbar nichts ge&auml;ndert hat, der Weg dahin sowie der Zeitplan
wurden jedoch, wie bereits in der letzten Ausgabe berichtet, grundlegend
modifiziert, leider jedoch nicht zum Besseren, wie zumindest einige User,
darunter auch ich, befinden.
</P>
<P>
Aber nicht nur manch Anwender hat Schwierigkeiten mit AMIGAs neuem Kurs -
in einer wahren Zwickm&uuml;hle stecken die Entwickler. Sollen sie nun f&uuml;r das
AmigaOS oder das AmigaDE Programme schreiben? Denn es ist ja zu
ber&uuml;cksichtigen, dass letzteres erst im AmigaOS 4.2, welches f&uuml;r das Ende
dieses Jahres angek&uuml;ndigt ist, enthalten sein soll, daf&uuml;r aber auch in
Versionen f&uuml;r andere Plattformen, insbesondere x86-Rechner, auf den Markt
kommen wird und somit Chancen haben d&uuml;rfte, eine gen&uuml;gend gro&szlig;e Nutzerbasis
zu gewinnen, um sich zu etablieren.
</P>
<P>
Das AmigaOS 4.0 dagegen soll zwar bereits im Sommer erscheinen, aber
ausschlie&szlig;lich f&uuml;r PowerPC-Rechner, wobei es noch nicht einmal sicher ist,
dass auch die PowerUp-Boards von Phase 5 / DCE ber&uuml;cksichtigt werden.
Dementsprechend gering wird die Zahl der potenziellen und tats&auml;chlichen
K&auml;ufer von AmigaOS4.0-Programmen sein, und somit ist die Gefahr gro&szlig;, dass
die kommerziellen Softwarehersteller ein Verlustgesch&auml;ft machen und ihre
ersten AmigaOS4.0-Produkte gleichzeitig ihre letzten sein werden.
Daraus ergibt sich nur eine logische Konsequenz: Auch wenn das AmigaDE
sp&auml;ter erscheint als das AmigaOS 4.0, so macht es unter
Marktgesichtspunkten nur Sinn, f&uuml;r ersteres zu entwickeln.
</P>
<P>
Augenblicklich k&ouml;nnen die Programmierer im &Uuml;brigen f&uuml;r das AmigaOS 4.0
mangels Entwicklertools noch gar nicht, und f&uuml;r das AmigaDE aufgrund
fehlender AmigaSDK-Bestandteile, wie etwa dem immer noch ausstehenden GUI-
Entwicklungssystem, nur eingeschr&auml;nkt Software schreiben. So kann es nicht
verwundern, dass die bereits seit Monaten kaum noch vorhandene kommerzielle
Amiga-Softwareentwicklung nun vollends droht, zusammenzubrechen. Wichtige
Projekte, wie etwa der Wildfire-Nachfolger Taifun oder die Spiele von X-
Cellence, liegen auf Eis, und kommerzielle Firmen wie Titan Computer und
Epic Interactive haben sogar Software f&uuml;r AMIGAs heimlichen
Hauptkontrahenten, dem - wohlgemerkt nichtgewerblichen - MorphOS-Projekt,
angek&uuml;ndigt. Sp&auml;testens zu dem Zeitpunkt h&auml;tten bei AMIGA s&auml;mtliche
Warnlampen aufleuchten m&uuml;ssen, aber der fehlenden Reaktion nach zu urteilen
scheint dies nicht der Fall gewesen zu sein - es sei denn, das Unternehmen
bereitet hinter den Kulissen eine erneute Strategie&auml;nderung vor.
</P>
<P>
Es ist mir wichtig, deutlich zu machen, dass es mir nicht darum geht, aus
ideologischen Gr&uuml;nden ein PowerPC-AmigaOS zu verhindern. AMIGA kann den
AmigaOS-Sourcecode von mir aus gern Haage &amp; Partner oder dem MorphOS-Team
&uuml;berlassen, damit diese auf eigene Faust eine PowerPC-Weiterentwicklung des
AmigaOS vornehmen k&ouml;nnen, jedoch ohne dar&uuml;ber hinaus finanzielle oder
andere Ressourcen beziehungsweise Support zu leisten. In AMIGAs jetziger
Strategie jedoch sehe ich nicht nur eine Gefahr f&uuml;r das Ziel, ein
skalierbares und hardwareunabh&auml;ngiges Betriebssystem zu schaffen, sondern
auch f&uuml;r die Existenz des Unternehmens selbst.
</P>
<P><B>Damit bis zum n&auml;chsten Monat,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
