<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Review: Ego-Shooter &raquo;Shogo&laquo;</H2>
<P>
Darauf haben alle gewartet!
Es ist soweit! Ich halt die Vollversion von Shogo in den H&auml;nden! Nachdem am
Anfang des Monats die Demoversion f&uuml;r Furrore gesorgt hat, war klar: wenn
ein Spiel Heretic II vom Thron des besten Amigaspiels sto&szlig;en kann, dann
Shogo! Deshalb wird der Ver&ouml;ffentlichung dieses St&uuml;cks Software regelrecht
entgegengefiebert. Hans Joerg Frieden war so freundlich mir vorab schon mal
ein Exemplar zukommen zu lassen. Dies ist aber keine letzte Betaversion
oder dergleichen, sondern die fertige Endversion. So kommt Shogo in den
Handel. Wenn ihr das Spiel also bestellt, dauert es noch ein wenig bis ihr
es spielen k&ouml;nnt. Zum Beispiel sind die Verpackungen noch nicht fertig,
somit kann ich meine obligatorische Beschreibung der &Auml;u&szlig;erlichkeiten nur
durch Beschreibungen von Hyperion machen. Das Spiel kommt &auml;hnlich wie
Heretic II in einer Papierh&uuml;lle daher und steckt in einem Pappkarton. Eine
Anleitung soll glaubich auch dabei sein, aber auf der CD gibt es auf jeden
Fall eine im HTML-Format. Ebenso ist auf der CD die letzte Warp3D Version,
AHI und qstat, einem Programm um Server zu &uuml;berpr&uuml;fen. Der Rest wird von
den Musikst&uuml;cken gebraucht. Aber nun auf die Festpatte mit dem Teil, ich
dr&uuml;cke das Installerprogramm. Noch nie war es so sch&ouml;n, ein Spiel auf die
HD zu bannen (deshalb habe ich es gleich zweimal gemacht, weil ich
versehentlich die falsche Seriennummer eingegeben habe). Mit musikalischem
Intro und vor dem Titelbild von Shogo mu&szlig; man die wenig geforderten
Eingaben machen und kann sich dann bequem zur&uuml;cklegen: Shogo belegt fast
400 MByte auf der Platte und somit dauert die Installation mehrere Minuten.
Man kann die Videosequenzen direkt mit installieren (nochmals 20 MB) und
mu&szlig; dies bei einem langsamen CDRom-Laufwerk nicht mehr wie bei Heretic II
im nachhinein per Hand machen. Zus&auml;tzlich kann man noch eine ungef&auml;hre
Voreinstellung des Programms, je nach Rechnerleistung vornehmen und das war
es dann schon: so komfortabel kann Installieren sein, Clickboom.
</P>
<P>
<A HREF="img/shogo1.jpg"><IMG SRC="thumb/shogo1.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Normalerweise schreibe ich an dieser Stelle ja meistens: Ich starte das
Programm und schon kann es losgehen. Nicht so bei Shogo. Noch nie war es so
sch&ouml;n, ein Spiel zu starten. Nach dem Doppelklick auf das Starticon
erscheint n&auml;mlich ( wieder im Klang der Musik, die wir schon vom Installer
her kennen) der Shogo-Launcher (siehe Screenshot). Ich gehe nicht in jedes
Detail, aber wenn es ein Spiel gibt, mit dem man in wenigen Handgriffen die
Einstellungen seiner Konfiguration anpassen kann, dann ist es Shogo. Es
l&auml;&szlig;t sich so ziemlich alles einstellen und durch die praktrische
Bubble-Hilfe (leider nur englisch) ist dies auch ein Kinderspiel. Aber
irgendwann hei&szlig;t es ja doch: los geht´s, oder in diesem Fall: Launch Shogo.
</P>
<P>
Beim ersten Start werde ich noch gefragt in welcher Detailstufe ich starten
m&ouml;chte, dann geht es auch schon los. Leider st&uuml;rtzte das Programm immer
wieder an der selben Stelle ab. Ich schrieb diesen Fehler also Hans Joerg
Frieden und dieser antwortete prompt und ebenso treffend. Der Fehler lag an
Variablen, die iFusion gesetzt hatte (bzw. ich f&uuml;r iFusion) und die
eigentlich nur f&uuml;r Entwickler gedacht sind. Nachdem diese entfernt waren,
lief alles wie geschmiert. (Nochmals DANKE f&uuml;r diesen prompten Support) Das
dieser Test anders ist als andere, habt ihr ja schon bemerkt. Das liegt
Haupts&auml;chlich daran, da&szlig; auch Shogo anders ist als andere Shooter.
Normalerweise w&uuml;rde ich n&auml;mlich jetzt die Hintergrundstory ins Deutsche
&uuml;bersetzten und hier ver&ouml;fftenlichen. Verge&szlig;t es! Die ist so lang, da w&uuml;rde
ich in einer Woche noch dran sitzen. Ich &uuml;bersetzte deshalb lediglich die
Sektion: Your Mission - Deine Mission:
</P>
<P>
<A HREF="img/shogo2.jpg"><IMG SRC="thumb/shogo2.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Du schl&uuml;pfst in die Rolle von Sanjuro Makabe, einem Piloten der MCA (Mobile
Combat Armor) und Kommander in der UCA Security Force. Deine Mission ist
es, einen Rebellenanf&uuml;hrer namens Gabriel zu finden und unsch&auml;dlich zu
machen. Die Handlung spielt entweder auf dem Planeten Cronus oder dem
Raumschiff Leviathan, dem Flakschiff der UCA. Sie steht unter dem Kommando
von Admiral Akkaraju. Cronus ist die einzige bekannte Quelle des biologisch
aktivem Material Kato, einer unglaublichen Energiequelle, welche
interstellare Raumfl&uuml;ge erst m&ouml;glich werden. Obwohl sich dies ja ziemlich
exat wie bei jedem Shooter anh&ouml;rt ist Shogo wirklich anders. Und das liegt
haupts&auml;chlich an der comicartigen Aufmachung im Mangastil. Allein das
Einblenden des Spielnamens entpuppt sich nicht als Animation sondern als
eine Art Vorspann, wie er auch vor einer japanischen Serie a´la Pokemon
laufen k&ouml;nnte. Hier wird direkt eine super Atmosph&auml;re aufgebaut, wenn auch
nicht so ernst wie zB. bei Q***ke oder Heretic II, sondern eher auf der
am&uuml;santen Schiene. Leider wird man nicht mit einem Intro ins Geschehen
eingef&uuml;hrt, sondern mu&szlig; sich tats&auml;chlich das komplette Hintergrundwissen
selbst anlesen. Aber so bleibt man in der &Uuml;bung, denn nach jedem
Levelabschnitt wird die Geschichte weitergef&uuml;hrt und zwar mit
Zwischentexten, aber auch Animationen und Sprachfetzten im Spiel. So wird
der filmische Gesamteindruck perfekt abgerundet. Aber wollen wir einmal auf
das Spiel sebst eingehen. Die ersten Level sind eigentlich ersteinmal dazu
da, sich im Spiel und der Handlung zurechtzufinden. Haupts&auml;chlich steuert
man wie im ersten Level einen sogenannten MCA, eine Art 10 Meter hohen
Mechwarrior. Dies geschieht aus der sogenannten Ego-Perspektive, d.h. man
sieht von sich selbst meist nur die Hand mit der Waffe. Man kann aber auch
auf die Heretic II Ansicht umschalten, aber richtig gut sieht das nicht
aus. Ansonsten schaut das Spiel aber perfekt aus. Gerade in den h&ouml;heren
Detailstufen gibt es viele Nebel und Lichteffekte zu bestaunen, wie man sie
auf dem Amiga noch nie gesehen hat. Es gibt impsante Au&szlig;enlevel (gleich am
Anfang ist man in einer Art Schneelandschaft) und labyrinthartige
Innenr&auml;ume. Dadurch da&szlig; ein MCA so gro&szlig; ist, macht es nat&uuml;rlich optisch
riesigen Spa&szlig; auf die &quot;winzigen&quot; Autos und Soldaten zu ballern. Wenn einem
so ein Jeep um die Ohren fliegt, merkt man richtig, was hier f&uuml;r Arbeit
hinter steckt. Der Schwierigkeitsgrad w&auml;chst von mal zu mal, die
Startschwierigkeit kan man selbst bestimmen. &Uuml;berhaupt l&auml;&szlig;t sich verdammt
viel einstellen, so da&szlig; man bei Rucklern im Spiel durch die Optionen direkt
alles wieder gut machen kann. Cool finde ich auch, da&szlig; es nicht nur darum
geht von Tor A zur T&uuml;r B zu kommen und erst Schl&uuml;&szlig;el C zu finden um mit ihm
Hebel D umzulegen. Oft genug arbeitet man nicht alleine, sondern im Team
(wobei man seine Teammittglieder realstischerweise auch t&ouml;ten kann, also
vorsicht). Leider ist Freund und Feind nicht immer direkt zu unterscheiden.
Aber auch da&szlig; spielt sich ein. Ebenso wie die Steuerung. Dadurch da&szlig; man
alles so einstellen kann, wie man es selbst gerne h&auml;tte, gibt es hier auch
keine Probleme. Der zweite Level startet in meiner Kabine im Mutterschiff
und ich mu&szlig; zum Admiral. Wenn da&szlig; mal kein guter Auftrag ist. Es gilt
niemanden zu t&ouml;ten (denn man ist unter sich), sondern nur den richtigen Weg
zu finden. Nat&uuml;rlich meldet sich der Schiffsf&uuml;herer &ouml;fters &uuml;ber Funk, wo
man denn bleibt. Kurz und knapp: ein toller Geschichtsfaden zieht sich
durch die komplette Story und macht Lust auf mehr. Das Spiel ist einfach zu
erlernen, wird aber nicht langweilig. Und damit dies so bleibt, kann man es
nat&uuml;rlich auch zu mehreren spielen. Hierf&uuml;r braucht man entweder eine
Netzwerkkarte, oder das Internet. Leider habe ich es nicht geschafft diesen
Mehrspielermodus zu testen, aber dies hole ich nach. Was ich &uuml;berpr&uuml;ft
habe, und was auch klappte, war das einrichten eines Servers. Mittels des
Launchers klappt auch das sehr einfach und komfortabel. Man sieht, bei
Shogo stimmt eigentlich alles. Die Grafik ist perfekt. Die CD-Musik und die
Soundeffekte st&ouml;ren niemals irgendwie und durch die ausgekl&uuml;gelte Story,
die witzige Mangavariante und den Unmengen von Waffen und Extras, wie mehr
Leben, Munition oder R&uuml;stungszuwachs wird Shogo zum &Uuml;berhit. Nur eines darf
nat&uuml;rlich nicht vergessen werden: dieses Spiel bleibt einzig und allein den
&quot;Elite-Rechnern&quot; vorbehalten. Aber das sollte die Besitzer dieser PPC und
3D-GraKa Maschinen nicht st&ouml;ren sondern eher freuen und der Rest kann
wenigstens tr&auml;umen. So: und nun st&ouml;rt mich bitte nicht l&auml;nger, ich mu&szlig;
heute diesen Level noch schaffen und gleich wird es hell und die Kinder
werden wach...
</P>
<P>
<A HREF="img/shogo3.jpg"><IMG SRC="thumb/shogo3.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Es ist wirklich eine Unversch&auml;mtheit, mir so ein Spiel zum testen zu
geben!!!. Was haben die Programmierer sich eigentlich dabei gedacht? Wollen
die mich verarschen? Wie ein Verr&uuml;ckter suche ich Nachteile von Shogo,
finde aber nix. Deshalb ziehe ich mich an ein paar Sachen hoch:
Es ist schade, da&szlig; alles (Anleitung, Zwischentexte und Sprachausgabe)
komplett in englisch ist. So gehen ein paar Gags durch mangelnde
Sprachkentnisse verloren. Ansonsten: geniales St&uuml;ck Software. Selten merkte
man einem Spiel die Arbeit, welche dahintersteckt mehr an. Ich hoffe
wirklich, da&szlig; sich diese M&uuml;he lohnt und Shogo auch gekauft wird. Denn
besser wurde die aktuelle Hardware noch nie ausgereift. Und nicht nur Auge
und Ohr erfreuen sich an dem Spiel, auch da&szlig; Gehirn erg&ouml;tzt sich an den
knackigen R&auml;tseln, die Finger ballern mit den verschiedensten Waffen und
der Magen knurrt, weil man es einfach nicht mehr schafft an den K&uuml;hlschrank
zu gehen: die Shogo-Mania hat bei mir eingesetzt! Also, wer &uuml;ber den
passenden Rechner verf&uuml;gt mu&szlig; hier einfach zugreifen. Wer sich aber immer
noch nicht sicher ist, kann sich ja mal die Demo herunterladen.
</P>
<P><B>J&uuml;rgen Theiner</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
