<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Workshops / Hintergrundberichte / Buchvorstellungen</H1>
<H2>1. Workshop: Virtual Network Computing (von Uwe Pannecke)</H2>
<P><B>Der Herr der Fernbedienung</B></P>
<P><B>Der VNC Viewer f&uuml;r Amiga von Denis Spach</B></P>
<H3>0. VNC - eine neue Tierseuche?</H3>
<P>
SPD und CDU kennt (in Deutschland) jeder, BSE inzwischen auch, aber was
verbirgt sich hinter dem K&uuml;rzel VNC? Die AT&amp;T Laboratories Cambridge [1],
die diese freie Software entwickelt haben, verstehen unter VNC ein Virtual
Network Computing. Sehr sch&ouml;n, wird nun mancher Leser sagen, und was hei&szlig;t
das konkret und auch f&uuml;r &quot;Nicht-Engl&auml;nder&quot; verst&auml;ndlich? Hinter VNC
verbirgt sich ein System, das es erlaubt, in einem Netzwerk (egal ob lokal
begrenzt oder weltweit ausgedehnt wie das Internet) die grafische
(Bildschirm-) Ausgabe eines Rechners, also sein &quot;Desktop Environment&quot; (etwa
die Workbench des Amigas oder KDE und GNOME unter Linux), nicht nur auf dem
Rechner selbst, sondern jedem anderen vernetzten Rechner zur Verf&uuml;gung zu
stellen. Dieses Virtual Network Computing bedient sich dabei der Server-
Client-Philosophie:
Der Server-Rechner stellt seine Bildschirmausgabe dem Client-Rechner zur
Verf&uuml;gung einschlie&szlig;lich Tastatur- und Mausunterst&uuml;tzung. So l&auml;&szlig;t sich der
Server-Rechner vom Client aus mit grafischer Oberfl&auml;che bedienen und somit
fernsteuern, auch wenn er tausende Kilometer (oder nur wenige Meter)
entfernt r&auml;umlich unerreichbar vor sich hin summt sollte. Dabei spielt es
kaum eine Rolle, welches Betriebssystem auf den beteiligten Rechnern l&auml;uft.
VNC-Viewer und -Server existieren f&uuml;r unix-artige OS wie etwa Linux, HP/UX
und BSD-Derivate ebnso wie f&uuml;r Windows, DOS, OS/2, BeOS, Geos (z.B. Nokia
9000), PalmOS und Dank mehrerer findiger Programmierer auch f&uuml;r Amiga.
So programmierte Joerg Dietrich sein 'VVA', einen &quot;VNC Viewer for Amiga&quot;,
der von Denis Spach [2] seit Version 0.2 weitergef&uuml;hrt und zum
gegenw&auml;rtigen Zeitpunkt bei Version 0.9.6 angekommen ist. &Uuml;brigens findet
Ihr auf Denis Spachs Homepage auch einen VNC- und X11-Server f&uuml;r den Amiga.
In diesem Text will ich mich aus Platzgr&uuml;nden nur auf Installation und Kon-
figuration des VNC Viewer f&uuml;r Amiga beschr&auml;nken. Es soll gezeigt werden,
wie der Amiga die Bildschirmausgabe von Linux und Windows einfangen und so
die vollst&auml;ndige Kontrolle &uuml;ber die Rechner erlangen kann.
</P>
<H3>1. Systemvoraussetzungen</H3>
<P>
Euer Amiga sollte mindestens 256 Farben f&uuml;r die Bildschirmdarstellung
beherrschen, also entweder &uuml;ber AGA oder besser gleich eine Grafikkarte mit
CyberGraphics oder Picasso96 verf&uuml;gen. Ausserdem muss mindestens eine
MC68020-CPU im Amiga werkeln und AmigaOS 3.0 oder h&ouml;her installiert sein.
F&uuml;r die Kontaktaufnahme mit weiteren Rechnern ben&ouml;tigt Euer Amiga einen
TCP/IP-stack wie Miami, AmiTCP ab V3 oder Genesis. Nat&uuml;rlich muss irgendwo
im erreichbaren Netzwerk ein laufender VNC-Server (weiter unten m&uuml;ssen
daf&uuml;r Linux und Windows98 herhalten) vorhanden sein. Zu guter Letzt ist
eine installierte reqtools.library vonn&ouml;ten.
</P>
<H3>2. Installation</H3>
<H4>2.1 Amiga</H4>
<P>
Nachdem das vva096.lha-Paket auf Eurem Rechner gelandet und in ein
Verzeichnis Eurer Wahl entpackt ist, hat damit gleichzeitig die
Installation ihren Abschlu&szlig; gefunden. Nach einem Doppelklick auf das 'vva'-
Verzeichnis-Icon pr&auml;sentiert sich ein Fenster mit vielen vva-xx-Icons im
MagicWB-Look, hinter denen sich vorkonfigurierte Startoptionen f&uuml;r den VNC-
Viewer verbergen.
</P>
<P>
Ihr habt die Wahl zwischen Grafikausgabe in einem Fenster auf der
Workbench, als Workbench-Hintergrund oder auf einem eigenen Screen in 8, 16
oder 32 Bit Farbtiefe. Entweder, Ihr passt die Tooltypes der Icons an Eure
Gegebenheiten an oder erstellt eigene Projekt-Icons mit den entsprechenden
Eintr&auml;gen.
</P>
<P>
<A HREF="img/vncAmi1.png"><IMG SRC="thumb/vncAmi1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Bevor der VNC-Viewer in Aktion treten kann, muss zuvor erst noch der
passende VNC-Server auf dem fernzusteuernden Rechner installiert werden.
</P>
<H4>2.2 Linux</H4>
<P>
Die geeigneten Pakete findet Ihr auf den VNC-WEB-Seiten der AT&amp;T [3] unter
dem Abschnitt DOWNLOAD. W&auml;hlt die f&uuml;r das Betriebssystem geeigneten Pakete
aus und installiert sie auf dem entsprechenden Rechner. Zuvor lohnt sich
jedoch ein Blick in das meist vorhandene Linux-CD-Set. So bringt etwa
SuSE Linux  aktuelle Pakete sowohl f&uuml;r VNC-Server als auch -Viewer gleich
mit. Sind die Pakete (z.B. mittels RPM oder eines Tools wie etwa YAST bei
SuSE) installiert, wird der VNC-Server per Shell-Eingabe zur Zusammenarbeit
&uuml;berredet. Der Server m&ouml;chte zu Beginn gern ein Passwort wissen, mit dem
sich der Client, also der VNC-Viewer sp&auml;ter beim einloggen authorisieren
muss.
</P>
<P>
<A HREF="img/vncLinux.png"><IMG SRC="thumb/vncLinux.jpg" WIDTH="120" HEIGHT="43" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Sinnvollerweise sollte dem Server zumindest die zu verwendende Display-
Nummer &uuml;bermittelt werden. In unserem Fall soll es das Display Nummer 2
sein. Au&szlig;erdem soll die Bildschirmaufl&ouml;sung 800x800 Pixel betragen, denn so
kann bei einer vorhandenen Workbenchaufl&ouml;sung von 1024x768 Pixel die
Garfikausgabe als Fenster auf der Workbench ge&ouml;ffnet werden. W&auml;hlt Ihr eine
h&ouml;here als die aktuell genutzte Workbenchaufl&ouml;sung, &ouml;ffnet 'vva' einen
eigenen Screen, dessen Daten &uuml;ber einen Screenmode-Requester ausw&auml;hlbar
sind.
</P>
<P>
Soll der VNC-Server seine Arbeit beenden, bef&ouml;rdert die Shell-Eingabe
&quot;vncserver -kill :2&quot; die aktuelle Server-Sitzung ins Daten-Nirvana.
</P>
<H4>2.3 Windows9x</H4>
<P>
Wer eine aktuelle SuSE-Distribution besitzt, kann sich auch f&uuml;r Windows9x
den Download sparen. Auf der ersten CD bzw. der DVD versteckt sich im
Verzeichnis '/dosutils/vnc' neben einem VNC-Server zus&auml;tzlich auch noch ein
VNC-Viewer f&uuml;r Windows9x. Ansonsten kann wiederum die AT&amp;T-Seite [3] als
Anlaufstelle dienen. Eine im Paket enthaltene Installationroutine klinkt
die entsprechenden Daten in das Windows9x-System ein. Vor der ersten
Nutzung sorgt die Anwahl der Eintr&auml;ge &quot;Start/Programme/Vnc/Administrative
Tools/Install Default Registry Settings&quot; und &quot;.../Install WinVNC Service&quot;
f&uuml;r die Pr&auml;paration. Der VNS-Server erfragt beim ersten Start wiederum ein
Passwort. Das gleiche Passwort wird der VNC-Viewer wissen wollen, um so
eine unauthorisierte Fernsteuerung zu unterbinden. Ausserdem ist die Wahl
einer Display-Nummer notwendig. Neben der automatischen Vergabe ist eine
explizite Festlegung m&ouml;glich und soll auch in unserem Beispiel genutzt
werden. Wir legen als Display-Nummer wie schon unter Linux die 2 fest und
klicken auf &quot;OK&quot;.
</P>
<P>
<A HREF="img/vncWin98.jpg"><IMG SRC="thumb/vncWin98.jpg" WIDTH="98" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Ab sofort wartet der VNC-Server im Hintergrund auf Anb&auml;ndelungsversuche
eines VNC-Viewers.
</P>
<H3>3. Kontaktaufnahme</H3>
<P>
Vielf&auml;ltige und auf den ersten Blick kaum &uuml;berschaubare Konfigurations-
m&ouml;glichkeiten k&ouml;nnen realisiert werden. Um dennoch in k&uuml;rzester Zeit zum
Erfolgserlebnis zu kommen, soll an dieser Stelle wieder einmal ein
einfaches Beispiel herhalten. F&uuml;r weitergehende M&ouml;glichkeiten sei auf die
&quot;vva&quot;-Dokumentation und die VNC-Webseite [3] verwiesen. Nehmen wir den
Linux-Rechner:
Er soll unter der IP-ID '192.168.03' oder unter dem Namen 'linux.xwing.de'
erreichbar sein und dessen VNC-Server exportiert die Grafikausgabe, wie
schon konfiguriert, auf das Display 2. Wir wollen die Grafikausgabe des
Rechners in einem Fenster auf unserer Amiga-Workbench, die in 8 Bit
Farbtiefe l&auml;uft, sehen.
</P>
<P>
Um unser Ziel zu erreichen, nutzen wir das von Denis Spach mitgelieferte
&quot;vva-sharepens&quot;-Icon. Lasst Euch also die Informationen zum Icon anzeigen.
Unter &quot;Merkmale:&quot; werden wir jetzt die passenden Eintr&auml;ge vornehmen: Als
Argument f&uuml;r HOST tragen wir die IP-ID oder den Namen des zu steuernden
Rechners ein, also HOST=192.168.0.3 oder HOST=linux.xwing.de. Der PORT
erh&auml;lt als zus&auml;tzliche Angabe die Display-Nummer. Da in unserem Fall
Display 2 benutzt wird, erfolgt der Eintrag PORT=5902. Soll Display 1
Verwendung finden, w&auml;re PORT=5901 der korrekte Eintrag.
</P>
<P>
<A HREF="img/vncAmi2.png"><IMG SRC="thumb/vncAmi2.jpg" WIDTH="120" HEIGHT="65" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Mit SCREENMODE kann auf Wunsch ein zu verwendender Bildschirmmodus f&uuml;r den
Start angegeben werden, wobei grunds&auml;tzlich der Modus in dezimaler Angabe
erfolgen muss. Um die passende Ziffernkombination herauszufinden, liegt dem
'VVA'-Paket das Tool &quot;mid&quot; bei. Ist das SCREENMODE-Merkmal deaktiviert wie
unserem Fall, &ouml;ffnet sich nach dem Start ein Screenmode-Requester.
Die restlichen Angaben in den Icon-Merkmalen belassen wir vorerst im
Ursprungszustand. N&auml;here Informationen zu den weiteren Eintr&auml;gen findet Ihr
in der 'VVA'-Dokumentation. Mit einem beherzten Klick auf das soeben
angepasste Icon werdet Ihr, wie schon angedeutet, mit einer Passwort-
Abfrage konfrontiert.
</P>
<P>
<A HREF="img/vncPasswd.png"><IMG SRC="thumb/vncPasswd.jpg" WIDTH="120" HEIGHT="51" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Tragt hier das zuvor beim Server festgelegte Passwort ein, w&auml;hlt
anschlie&szlig;end den gew&uuml;nschten Bildschirmmodus (wenn kein Fenster auf der
Workbench ge&ouml;ffnet werden kann) und staunt &uuml;ber das sich &ouml;ffnende Fenster
samt Grafikausgabe des soeben &quot;angezapften&quot; Rechners.
</P>
<P>
<A HREF="img/vncWinGra.png"><IMG SRC="thumb/vncWinGra.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<H3>4. Fazit</H3>
<P>
Virtual Network Computing ist eine faszinierende M&ouml;glichkeit, vernetzte
Rechner zu bedienen. Die exportierte Benutzeroberfl&auml;che macht eine
Kontrolle des Remote-Rechners sehr einfach. Viele interessante
Anwendungsf&auml;lle sind so realisierbar.
</P>
<P>
Obwohl das Programm 'vva' erst die Versionsnummer 0.9.6 erreicht hat,
arbeitet es dennoch sehr zuverl&auml;ssig und leistungsstark. Ein weiteres
feines St&uuml;ck Amiga-Software. Sehr empfehlenswert.
</P>
<H3>5. Informationen</H3>
[1] <A HREF="http://www.uk.research.att.com/" TARGET="_top">http://www.uk.research.att.com/</A><BR>
[2] <A HREF="http://dspach.free.fr/amiga/vva/index.html" TARGET="_top">http://dspach.free.fr/amiga/vva/index.html</A><BR>
[3] <A HREF="http://www.uk.research.att.com/vnc/index.html" TARGET="_top">http://www.uk.research.att.com/vnc/index.html</A><BR>
<P><B>Uwe Pannecke &lt;<A HREF="mailto:Uwe.Pannecke@t-online.de">Uwe.Pannecke@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
