<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerPC3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Der Zwischenruf
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Der Zwischenruf (von Ralf Driesner)</H1>
<P>
Ich will so bleiben wie ich bin....
</P>
<P>
Ich stehe vor dem Spiegel. Wirre Gedanken schie&szlig;en mir durch den Kopf. &quot;Wie
konnte das nur passieren? Wie ist das m&ouml;glich? Alles war doch exakt
geplant&quot;
</P>
<P>
Vor wenigen Augenblicken hat mich meine elektronische Personenwaage mit
kasteiender 100-Gramm-Einteilung und 20-Jahre-Dauerbatterie davon in
Kenntnis gesetzt, dass ich &uuml;ber Ostern -diese unscheinbaren, wenigen Tage-
fast drei Kilo zugenommen habe.
</P>
<P>
Der Spiegel verr&auml;t noch mehr. Es sind nicht nur die drei Kilo Neuakquise
&uuml;ber Ostern. Es sind auch die restlichen 7 Kilo, die mich beim Treppen
steigen schnaufen lassen.
</P>
<P>
Dabei hatte ich mir vor Ostern ganz fest vorgenommen, keine Schoki mehr zu
mir zu nehmen. Aber ein Kunde war der Quertreiber. Wieso mu&szlig;te diese gelbe
Knilch auch unbedingt Schoko-Ostereier mitbringen. Einen ganzen Beutel
voll. Das Verh&auml;ngnis nahm seinen Lauf. Die Dinger waren schnell vernichtet,
der Weg zum n&auml;chsten Supermarkt nicht weit und der Wille (einmal auf den
Geschmack gekommen) schnell gebrochen.
</P>
<P>
Es hilft nichts, ich mu&szlig; zur Arbeit. Die Hose spannt ein wenig. Schlanke
weibliche Sch&ouml;nheiten dr&auml;ngen sich in die &uuml;berf&uuml;llte U-Bahn. Wohin das Auge
reicht nur gesunde, vitale Menschen. Und alle scheine mich anzugaffen. Die
ganze U-Bahn hat sich mit dem Gedanken &quot;Ach du gro&szlig;er Gott&quot; gegen mich
verschworen. Sogar die sonst lieb guckenden Omis scheinen mich zu mustern
und virtuell mit dem Kopf zu sch&uuml;tteln. Zorn steigt in mir auf. Ich denke
mir &quot;Guckt nich´ so doof. Wer mit seiner Rentnerkarte schon um 8.50 Uhr in
der U-Bahn steht verst&ouml;&szlig;t gegen die Tarifgegebenheiten des M&uuml;nchner
Verkehrs- und Tarifverbundes (MVV). Die erlaubt euch erst ab neun Uhr die
U-Bahn zu verstopfen. Und &uuml;berhaupt, wer ist denn f&uuml;r &quot;Auffahrunf&auml;lle&quot; am
Ende der Rolltreppe verantwortlich, wenn das Ding mal wieder schneller
l&auml;uft als ihr?&quot;
</P>
<P>
&quot;N&auml;chsta hoid .... Haubtbaanhof ... Umsteigem&ouml;glichkeit zu ...&quot;. Der
U-Bahn-Fahrer br&uuml;llt das erl&ouml;sende Stichwort. Meine Brille ist leicht
beschlagen. Die 10-min&uuml;tige Tour hat mir ganz sch&ouml;n zugesetzt und ich
beschlie&szlig;e, den restlichen Weg zufu&szlig; zu gehen; der Fitness wegen ...
</P>
<P>
Das B&uuml;ro ist erreicht, ich kann mich setzen. Die rechte Hand greift nach
den Taschent&uuml;chern, die linke an den Power-Schalter des PCs. Erst mal
gepflegt schneuzen .... die Festplatte im Rechner macht ein &auml;hnliches,
jedoch deutlich leiseres Ger&auml;usch. Jetzt gehts mir zum ersten Mal wieder
besser an diesem Morgen. Der Rechner bootet, bootet, bootet und bootet.
Tausend unverst&auml;ndliche Befehle werden in einem kleinen Fensterchen
abgearbeitet. Und er bootet, bootet und dann ...... macht er garnichts
mehr. Ein noch kleineres (neckisch anmutendes) Fensterchen teilt mir mit,
dass mit der Netzwerkanbindung etwas nicht stimmt.
</P>
<P>
Ich sitze baff vor dem Redmond-verw&ouml;hnten Rechner, die Spannung steigt
..... und dann flutscht mir ein l&auml;cheln &uuml;ber das Gesicht, dass sich langsam
zu einem breiten Grinsen entwickelt. &quot;Hah, alter Protzer!! Wohl auch
zuviele Schoki-Eier gefuttert, was ?! Das f&auml;llt dir trotz deiner vielen
Megahertz mindestens so schwer wie mir.&quot;
</P>
<P>
Wie sch&ouml;n .... ich bin nicht allein auf dieser Welt.
</P>
<P>
Lebt lang und erfolgreich ...
</P>
<P><B>Euer</B></P>
<P><B>Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="PowerPC3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
