<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Tintenstrahldrucker</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Tintenstrahldrucker am Amiga</H1>von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></DIV>
<P>
<B>Das Sch&ouml;ne an Druckern</B> war eigentlich immer, da&szlig; sie zu der Hardware
z&auml;hlten, die system&uuml;bergreifend verwendbar war. Dies gilt aber f&uuml;r den
Amiga seit einiger Zeit leider nicht mehr, da es den Herstellern
offensichtlich nicht lohnend erscheint, ihren Produkten auch
Druckertreiber f&uuml;r dieses System beizulegen.
</P><P>
Hei&szlig;t das nun also, da&szlig; die Amiga-Gemeinde auf dem Stand von gestern
bleiben und veraltete Drucker benutzen mu&szlig;, weil es nur f&uuml;r diese Treiber
gibt?
</P><P>
Gl&uuml;cklicherweise nicht, denn wie immer wissen sich die Amiga-User selbst
zu helfen. Dieser Artikel soll die Probleme beim Betrieb von modernen
Tintenstrahldruckern am Amiga ein wenig beleuchten und auch ein paar Tips
geben, die die Entscheidung f&uuml;r ein Modell ein wenig erleichtern sollen.
</P><P>
Zun&auml;chst einmal findet man im Bereich der Tintenstrahldrucker vier
Anbieter, die mit einer gr&ouml;&szlig;eren Palette um die Gunst der Kunden werben:
Canon, Epson, Lexmark und Hewlett Packard.
</P><P>
Zwischen den Modellen der ersten drei Firmen und denen der letzteren
besteht in der aktuellen Palette bereits ein <B>Unterschied</B>, der manchem
die Entscheidung leicht machen k&ouml;nnte. Die Drucker der Firma HP sind
n&auml;mlich derzeit die einzigen, die einen Papiereinzug von vorn bieten,
alle anderen und auch das kleinste HP-Modell DeskJet 340 nehmen ihr
Papier aufrecht von oben entgegen, was das Unterbringen des Druckers
in einem Regal oder diversen Computertischen unm&ouml;glich macht.
</P><P>
Dies ist bereits der wesentlichste Unterschied, denn in den sonstigen
Spezifikationen geht die Entwicklung so schnell voran bzw. sind sich
die Kontrahenten gegenseitig so sehr auf den Versen, da&szlig; sich allgemein
keine so gro&szlig;en Differenzen feststellen lassen.
</P><P>
Auff&auml;llig ist, da&szlig; HP mit den maximalen <B>Druckaufl&ouml;sungen</B> etwas hinter
der Konkurrenz hinterher hinkt. W&auml;hrend Epson als erstes Aufl&ouml;sungen von
1440x720 dpi (nur schwarz/wei&szlig;) bot, zogen Lexmark und Canon mit solchen
von 1200x600 dpi nach, w&auml;hrend die HPs bisher &uuml;ber 600x600 dpi nicht
hinauskommen. F&uuml;r den Heimanwender reicht jedoch eine Aufl&ouml;sung von
600 oder 720 dpi v&ouml;llig aus und bis auf die Epsons mu&szlig; man f&uuml;r h&ouml;here
Werte auch immernoch einiges Geld hinlegen.
</P><P>
Diese Werte allein k&ouml;nnen jedoch nicht als Barometer f&uuml;r die
letztendliche Druckqualit&auml;t gelten, da diese auch durch andere Techniken
wie Kantengl&auml;ttungs- und Tintenreduktionsfunktionen beeinflu&szlig;t werden.
Zur Beurteilung der Qualit&auml;t sollte also immer ein Testausdruck zu Rate
gezogen werden.
</P><P>
Grob l&auml;&szlig;t sich eine <B>Preisstaffelung</B> nach Anwendungsgebiet vornehmen. Die
kleinsten Modelle, portable, platzsparende oder Ein-Patronen-Systeme,
kosten in etwa zwischen 200 und 400 DM. Im Bereich von 400 bs 600 DM
schlie&szlig;t sich die Kategorie f&uuml;r den Heimanwender an. Hier bekommt man
Farbdrucker mit Zwei-Patronen-System, die f&uuml;r den gelegentlichen Gebrauch
vollkommen ausreichen. Wer plant, intensive grafische Anwendungen zu
Papier zu bringen, sollte dann dar&uuml;ber nachdenken, mehr Geld auszugeben,
nach oben ist die Grenze ja bekanntlich recht offen.
</P><P>
Aber kommen wir doch endlich zum <B>Zusammenspiel mit dem Amiga</B>.
</P><P>
Wie schon erw&auml;hnt ist der Amiga-Support der Hersteller stark zur&uuml;ckgegangen
bzw. gleich Null. <B>Lediglich Canon</B> supportet seine Drucker, indem sie eine
eingeschr&auml;nkte Version des Studio-Treibersystems regelm&auml;&szlig;ig via Aminet auf
dem laufenden Stand halten. So hat der K&auml;ufer stets einen offiziellen
Treiber f&uuml;r sein Modell.
</P><P>
Schwerer haben es da schon die HP- und Epson-Kunden. Diese k&ouml;nnen nur
hoffen, da&szlig; sich ein pfiffiger Amigianer findet, der einen Treiber f&uuml;r
ihr Modell zusammenzimmert. So erschienen inzwischen Treiber f&uuml;r die
Modelle Stylus300, Stylus800 und StylusII der Epson-Serie, sowie f&uuml;r die
DeskJets 400C, 600C bis 690C und 800C bis 890C, mit Ausnahme des 820CXi.
</P><P>
Wer sich f&uuml;r einen Lexmark entscheidet, kommt nicht um den Kauf einer
kommerziellen Treiberl&ouml;sung herum, die sich allerdings auch f&uuml;r Besitzer
der anderen Modelle durchaus lohnt.
</P><P>
Bevor ich jedoch dazu ein paar Worte verliere, m&ouml;chte ich auf einen
weiteren Umstand aufmerksam machen, n&auml;mlich den, da&szlig; die modernen Drucker
weitestgehend Software-gesteuert sind. Auch dies wird beim PC freilich
&uuml;ber die beigelegten Treiber-Tools gemacht, die es f&uuml;r den Amiga nicht
gibt. Hier wiederum haben aber Epson- und Canon-Kunden einen Vorteil,
denn auch hier haben sich User gefunden, die Tools f&uuml;r diese Drucker
programmiert haben, mit denen sich die K&ouml;pfe justieren, reinigen oder
sonstige Funktionen ausf&uuml;hren lassen, und diese im Aminet anbieten. Alle
anderen m&uuml;ssen wieder Geld ausgeben.
</P><P>
F&uuml;r selbiges bekommt man entweder durch das Studio- oder das TurboPrint-
Paket Abhilfe. Beide Pakete sind f&uuml;r ca. 100 bis 150 DM erh&auml;ltlich und
nehmen sich sicher nicht viel in der Summe ihrer Features und M&auml;ngel.
</P><P>
Ein <A HREF="../sw/9803tp6.htm">TurboPrint-Test</A> befindet sich ebenfalls in dieser Ausgabe. Die Pakete
bieten nat&uuml;rlich &uuml;ber reine Druckertreiber hinaus noch wesentlich mehr,
wie Programme zur komfortablen Gestaltung von Grafikausdrucken, Tools zur
Steuerung bzw. Einstellung der Drucker und Features wie TrueMatch und
&auml;hnliches, so da&szlig; die Investition durchaus nicht zu bereuhen ist.
</P><P>
<B>Problematisch</B> werden nat&uuml;rlich neuerdings erscheinende Kombi-Ger&auml;te, wie
z.B. der OfficeJet von HP oder BJC 4300 und BJC 4650 von Canon, die auch
als Scanner verwendbar sind. Meines Wissens gibt es f&uuml;r deren Scan-
Funktionen noch keine Treiberl&ouml;sungen f&uuml;r den Amiga. Hier bleibt
abzuwarten, was die Zukunft bringt.
</P><P>
G&auml;nzlich <B>unbrauchbar</B> sind reine &quot;Windows-Drucker&quot;, wie z.B. der DeskJet
820CXi von HP. Diese sind nur in Zusammenhang mit MS-Windows betreibbar,
man findet auch in den kommerziellen Treiberpaketen keine L&ouml;sungen f&uuml;r
diese Ger&auml;te. Hier ist beim Kauf also Vorsicht geboten.
</P><P>
<B>Abschlie&szlig;end</B> m&ouml;chte ich noch anmerken, da&szlig; man durch den extrem schnellen
Modellwechsel oft ein Schn&auml;ppchen schlagen kann, wenn man die Augen offen
h&auml;lt, da es im Prinzip st&auml;ndig Auslaufmodelle gibt. Dabei sollte man sich
auch nicht allzu gro&szlig;e Sorgen machen, man k&ouml;nne etwas verpassen, wenn man
nicht das allerneueste Ger&auml;t hat. Vergleicht man beispielsweise einmal die
Modelle DeskJet 660C, 690C und den aktuellen 670C, so kommt man als
Heimanwender schon ins Gr&uuml;beln, was au&szlig;er der Bezeichnung sich ge&auml;ndert hat.
</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../sw/9803one.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9803hw.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
