<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR=#FFFFFF TEXT=#000000 LINK=#0000AA ALINK=#000066 VLINK=#000066>
<TABLE width=100% border=0 cellpadding=3 cellspacing=0>
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA1.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="AMIGA3.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H3>2. Erl&auml;uterungen zum AMIGA-Entwicklersystem</H3><BR>
<BR>
Die bisherige &quot;Null Info&quot;-Politik der AMIGA-Entwicklungsabteilung, AMIGA,
Inc., hat dazu gef&uuml;hrt, dass viele AMIGA-Anwender immer noch nicht konkret
wissen, aus welchen Hard- und Softwarekomponenten das AMIGA-Br&uuml;ckensystem,
welches auf der Computer '98 vorgestellt werden soll, bestehen wird.
Im Folgenden m&ouml;chten wir etwas Klarheit in die Sache bringen, indem wir uns
der Fakten bedienen, die derzeit verf&uuml;gbar sind:<BR>
<BR>
An der Entwicklung des Br&uuml;ckensystems (das im AMIGA, Inc.-Wortschatz
&quot;OS5Dev&quot; genannt wird) sind in erster Linie drei Firmen beteiligt: Zum
einen Access Innovation, das fr&uuml;here Index Information, das den &quot;AMIGA auf
einer Karte&quot; entwickelt. Dabei wird es sich um eine PCI-Karte f&uuml;r
herk&ouml;mmliche PCs handeln, die alle wesentlichen Komponenten des heutigen
AMIGAs, wie etwa AGA-Chipsatz, 68k-Prozessor etc., enth&auml;lt. Somit w&auml;re
(hoffentlich hundertprozentige) Software-Kompatibilit&auml;t zur aktuellen 68k-
AMIGA-Software gew&auml;hrleistet.<BR>
<BR>
Die Entwicklung einer Softwareschnittstelle zwischen AMIGA- und PC-Hardware
&uuml;bernimmt der Hersteller der Siamese-Software, der f&uuml;r diese Aufgabe also
beste Referenzen besitzt. Die zu entwickelnde Softwareschnittstelle d&uuml;rfte
in der Lage sein, PC-Peripherie, wie zum Beispiel Tastatur und Grafikkarte
anzusprechen, was angesichts des meist schlechten Preis-
Leistungsverh&auml;ltnisses AMIGA-spezifischer Hardware ja auch Sinn machen
w&uuml;rde.<BR>
<BR>
Fehlt noch das AMIGA OS 4.0, welches jedoch wohl kein Betriebssystem im
herk&ouml;mmlichen Sinn, sondern eher eine st&auml;ndig weiterzuentwickelnde
Entwicklungsumgebung f&uuml;r Programmierer sein wird. Denn f&uuml;r diese ist ja der
Br&uuml;ckenrechner in erster Linie gedacht: Auf ihm soll Software, insbesondere
das Betriebssystem, f&uuml;r den f&uuml;r 1999 geplanten NextGeneration-AMIGA, dem
AMIGA, Inc. vorl&auml;ufig die Bezeichnung &quot;OS5Prod&quot; gegeben hat, programmiert
werden.<BR>
<BR>
<P ALIGN=RIGHT>
<A HREF="AMIGA1.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="AMIGA3.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
