<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR=#FFFFFF TEXT=#000000 LINK=#0000AA ALINK=#000066 VLINK=#000066>
<TABLE width=100% border=0 cellpadding=3 cellspacing=0>
<tr>
<td bgcolor="#000000">
<A HREF="Diverses3.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="Diverses5.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H3>4. Status des Merapi-Projekts</H3><BR>
<BR>
Bereits vor l&auml;ngerer Zeit hat Haage &amp; Partner eine Java Virtual Machine f&uuml;r
den AMIGA angek&uuml;ndigt. Doch obwohl das Erscheinen von Merapi, so der Name
der Software, bereits f&uuml;r die Computer '97(!) geplant war, hat sich in
diesem Punkt bis jetzt nichts getan.<BR>
<BR>
In der folgenden Stellungnahme meldet sich der Programmierer von Merapi zu
Wort:<BR>
<BR>
&raquo;Seitdem die Existenz unseres Java-Projekts MERAPI bekannt wurde, hat es
sehr viel Interesse daf&uuml;r gegeben und wir haben sehr viele Nachfragen nach
dem Fortschritt des Projekts erhalten. Es gab bisher einige Verz&ouml;gerungen
und diese haben nat&uuml;rlich einige Zweifel an den Amiga-Anwendern
hervorgerufen, die an dem Projekt interessiert sind. Daher wollen wir Euch
hiermit mitteilen, wie die Dinge um MERAPI stehen.<BR>
<BR>
Das Wichtigste zuerst: Das Projekt wurde nicht eingestellt. Wir wollen eine
hoch-qualitative, innovative Java-Implementierung f&uuml;r den Amiga anbieten.
Wir m&uuml;ssen jedoch zugeben, da&szlig; wir den Aufwand zum Erreichen dieses Ziels
sehr stark untersch&auml;tzt haben. Das Projekt ist noch nicht fertig f&uuml;r den
Betatest und es liegt noch einige Arbeit vor uns.<BR>
<BR>
In der Softwareindustrie im allgemeinen kann man sagen, da&szlig; dies ein
normaler, wenn auch ungl&uuml;cklicher Umstand ist. In diesem Fall ist es in
einer Hinsicht jedoch auch eine gute Sache, denn wenn wir fr&uuml;her gewu&szlig;t
h&auml;tten, wie lange diese Arbeit dauern w&uuml;rde, h&auml;tten wir sie vielleicht nie
begonnen. Nun sind wir immer noch froh, da&szlig; wir es getan haben! Bisher hat
sich die Herausforderung, einen speziell f&uuml;r den Amiga zugeschnittenen JIT-
Compiler zu entwickeln, als nicht zu schwierig oder kompliziert
herausgestellt. Das Problem ist vielmehr die knappe Zeit und die knappen
Ressourcen auf unserer Seite und auf Seiten externer Firmen. Zum jetzigen
Zeitpunkt &uuml;bersetzt das Programm korrekt den Java Bytecode in native
Maschinensprache. Es l&auml;dt, linkt und &uuml;berpr&uuml;ft die Classen-Dateien auf
Richtigkeit und Sicherheit (tats&auml;chlich hat dieser Teil eine gro&szlig;e Anzahl
von Bugs in Sun's eigenem JDK aufgedeckt). MERAPI hat GUI-Elemente, die dem
Amiga-typischen Look&amp;Feel sehr &auml;hnlich sind und zudem ein komplettes Amiga-
typisches Men&uuml;system (ein Ersatz war notwendig, weil die Amiga-Standardmen&uuml;s
einige Einschr&auml;nkungen hatten).<BR>
<BR>
Durch all diese Neuentwicklungen und Probleme kam es zu einem relativ
langsamen Entwicklungsproze&szlig;. Konsequenterweise haben wir daher einige
Entscheidungen getroffen. Nachdem es sich als nahezu unm&ouml;glich erwiesen
hat, einen sinnvollen Zeitpunkt f&uuml;r die Fertigstellung von MERAPI zu
nennen, werden wir in der n&auml;chsten Zeit keine Termine mehr nennen, bis die
Details der Lizensierung klar sind und sich MERAPI definitiv vor dem
Abschlu&szlig; befindet. Um weitere Verz&ouml;gerungen zu vermeiden, planen wir eine
schrittweise Ver&ouml;ffentlichung. Dies bedeutet das die erste Version der JVM
nicht alle fortgeschrittenen Funktionen der Standard-Java-Bibliothek bieten
wird, die viele jedoch beim normalen Einsatz auch nicht brauchen werden
oder die mehr kosmetische als funktionale Ziele verfolgen.<BR>
<BR>
Diese Funktionen werden in den folgenden Versionen zur Verf&uuml;gung gestellt.
Dies gibt uns mehr Zeit, um uns auf die Qualit&auml;t und Stabilit&auml;t der ersten
Version zu konzentrieren. Letztendlich k&ouml;nnen solche Funktionen leicht in
das existierende Projekt eingebaut werden, die Qualit&auml;t l&auml;&szlig;t sich
nachtr&auml;glich jedoch nur schwer verbessern, wenn die Grundkonzepte nicht
stimmen. Wir vertrauen darauf, da&szlig; Ihr, die Amiga Anwender, diese Ansicht
der Softwareentwicklung teilt und unseren Standpunkt und die Entscheidungen
versteht.<BR>
<BR>
Danke f&uuml;r Eure Zeit,<BR>
<BR>
Jeroen T. Vermeulen&laquo;<BR>
<BR>
(Quelle: Haage &amp; Partner)<BR>
<BR>
<BR>
Allerdings ist aus anderen Quellen zu vernehmen, dass (auch) die
Lizensierungspraktiken des Java-Eigners Sun Schuld an den Verz&ouml;gerungen
seien. Demnach h&auml;tte Sun Haage &amp; Partner bei der Vergabe einer Lizenz auf
dieselbe Stufe wie Microsoft gestellt, womit Zahlungen in gleicher H&ouml;he zu
leisten w&auml;ren. Angeblich existiert bereits eine lauff&auml;hige Version von
Merapi.<BR>
<BR>
<P ALIGN=RIGHT>
<A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
