<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR=#FFFFFF TEXT=#000000 LINK=#0000AA ALINK=#000066 VLINK=#000066>
<TABLE width=100% border=0 cellpadding=3 cellspacing=0>
<tr>
<td bgcolor="#000000">
<A HREF="Diverses1.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H3>2. CU AMIGA wird eingestellt</H3><BR>
<BR>
Der europ&auml;ische AMIGA-Zeitschriftenmarkt hat erneut einen herben R&uuml;ckschlag
zu verzeichnen: Das bekannte britische Magazin CU AMIGA, das auch in den
Bahnhofsbuchhandlungen vieler deutscher St&auml;dte erh&auml;ltlich ist, wird mit der
Oktoberausgabe eingestellt. Nach Angaben des Chefredakteurs ist die
Zeitschrift nicht mehr profitabel.<BR>
<BR>
Es folgt eine deutsche &Uuml;bersetzung des gesamten Statements:<BR>
<BR>
&raquo;Tut uns leid f&uuml;r unser Dauer-Grinsen. Es passt gar nicht zu dieser
Ank&uuml;ndigung.<BR>
<BR>
<BR>
Mit gro&szlig;em Bedauern m&uuml;ssen wir Ihnen mitteilen, dass die Oktoberausgabe
von CU Amiga die letzte sein wird, die je ver&ouml;ffentlicht wird. Das
Magazin CU Amiga rutschte in der letzten Zeit in einen Zustand der
Unwirtschaftlichkeit ab, aus dem wieder aufzusteigen &auml;u&szlig;erst
unwahrscheinlich ist. Die Entscheidung, die Herausgabe des Magazins
zu beenden, wurde von EMAP im Hinblick auf die gesamte finanzielle Lage
des Magazins und die fehlende Aussicht auf sofortige oder wenigstens
baldige Erholung der Situation getroffen.<BR>
<BR>
Es ist eine Ironie, dass CU Amiga als das Amiga-Magazin mit dem weltbesten
Verkaufserfolg schlie&szlig;en muss, aber jetzt haben seine allgemeinen Unkosten
angefangen, die finanziellen Ertr&auml;ge zu &uuml;bersteigen. W&auml;hrend es &uuml;blich ist
die Kosten zu reduzieren, um die Einstellung einer Zeitschrift zu
verz&ouml;gern, wurde hier entschieden, CU Amiga zu beenden, ohne die
Unw&uuml;rdigkeit zu erleiden, die Seitenzahl zu halbieren und den Rest in
Schwarz auf Wei&szlig; auf Toilettenpapier zu drucken. Auch wird es nicht an eine
andere Gesellschaft verkauft werden, die es dann endg&uuml;ltig zu Grunde
richtet.<BR>
<BR>
Die Redaktion von CU Amiga war verst&auml;ndlicherweise sehr bedr&uuml;ckt, als sie
diese Mitteilung erhielt und m&ouml;chte ihren besten Dank an alle weitergeben,
die mitgeholfen haben, dass CU Amiga in den vielen Jahren so ein Erfolg
wurde, und f&uuml;r die Freude, die wir bei der Arbeit daran hatten.<BR>
<BR>
<BR>
Tony Horgan<BR>
Editor, CU Amiga Magazine<BR>
<BR>
<BR>
<BR>
FAQ's zur Einstellung von CU Amiga<BR>
<BR>
<BR>
F: Warum schlie&szlig;t CU Amiga?<BR>
A: Da die Zeitschrift keinen Gewinn mehr einbringt und deshalb nicht mehr
weiter ver&ouml;ffentlicht werden kann.<BR>
<BR>
F: Wie kann die am besten verkaufte Amiga-Zeitschrift keinen Gewinn
einspielen, w&auml;hrend kleinere Zeitschriften es noch schaffen?<BR>
A: Kleinere Zeitschriften haben andere Einrichtungen f&uuml;r die Publikation,
andere Kostenrahmen und andere Verteilungswege. Viele werden mit geringem
Verlust oder bei Plus-Minus Null von Leuten betrieben, die das als
erweitertes Hobby auffassen. CU Amiga wird von einem gro&szlig;en Zeitschriften-
Verlag (EMAP) vertrieben, und als GmbH (Publicly Limited Company PLC) muss
EMAP seinen Teilhabern gegen&uuml;ber nachweisen, dass ihr Geld Gewinn abwirft,
was bedeutet, dass sie keine Zeitschrift ver&ouml;ffentlichen kann, die Verluste 
einbringt.<BR>
EMAP ist eine mehrere Milliarden Pfund starke internationale Gesellschaft;
sie hat zunm Amiga gehalten, solange sie konnte. Viel kleinere Firmen
zogen sich vor Jahren zur&uuml;ck, wobei sie sagten, der Markt sei zu klein f&uuml;r
sie.<BR>
<BR>
F: Warum wurden nicht die Kosten beschnitten, um das Magazin zu retten?
A: Das w&auml;re nicht der Stil von CU Amiga. Wir haben immer versucht, CU Amiga
als Ma&szlig;stab f&uuml;r Qualit&auml;t zu setzen. Der redaktionelle Stab und unser 
Verleger denken, es sei besser, sich auf einem hohen Standard zu 
verabschieden, als allm&auml;hlich den Umfang des Magazins zu veringern, die 
Disketten wegzulassen, die Mannschaft und Investitionen zu veringern, um es 
ohne R&uuml;cksicht auf Qualit&auml;t am Leben zu erhalten.<BR>
<BR>
F: Aber irgendetwas h&auml;tte man doch tun k&ouml;nnen?<BR>
A: Wir k&ouml;nnten die Zeitschrift auf ein Machwerk niederer Qualit&auml;t 
reduzieren, das mangelhaft recherchiert und geschrieben w&uuml;rde, aber dann 
w&auml;re es nicht die £4.50/£5.50 wert, die zur Kostendeckung verlangt werden 
m&uuml;ssten.<BR>
<BR>
F: Warum verzichten die Redakteure nicht auf einen Teil ihrer Eink&uuml;nfte?
A: W&uuml;rden Sie das tun? Und wo soll das enden?<BR>
<BR>
F: Warum haben Sie uns glauben lassen, das Magazin w&uuml;rde nicht eingestellt?
A: Wir waren immer ehrlich und haben gesagt, dass der Zeitpunkt kommen
k&ouml;nnte (wenn die Lage sich nicht bessert), dass das Magazin keinen Gewinn
erbringen w&uuml;rde. Niemand wusste, wann das eintritt. Bis vor kurzem haben
wir noch Geld verdient - es war eine Sommerflaute zu viel f&uuml;r uns.<BR>
<BR>
F: Ist das ein Versuch, die Amiga-Anwender zum Kauf von PCs zu
veranlassen?<BR>
A: Nein. Der Verleger von CU Amiga hat sowieso keine PC-Zeitschrift.<BR>
<BR>
F: Wird &quot;CU Amiga&quot; sich in &quot;CU PC&quot; verwandeln?
A: Nein.<BR>
<BR>
F: Ich habe ein Abonnement. Was geschieht?<BR>
A: Die fehlenden Ausgaben werden Ihnen zur&uuml;ckverg&uuml;tet. Folgen Sie diesem
Link (<A HREF="mailto:zoe.wharnsby@ecm.emap.com">zoe.wharnsby@ecm.emap.com</A>), um Einzelheiten zu erfahren.<BR>
<BR>
F: Warum wird das Magazin nicht an einen Verlag verkauft, der noch Gewinne
damit machen kann?<BR>
A: Jeder Verlag m&uuml;sste Opfer erbringen, die das Magazin so kompromittieren
w&uuml;rden, dass es damit nicht l&auml;nger das CU Amiga w&auml;re, das Sie kennen. EMAP
hat sich entschlossen, CU auf einem hohen Standard zu beenden und dann den
Namen zu verkaufen, damit er einem anderen Verleger n&uuml;tzlich werden kann.<BR>
<BR>
F: Wird CU Amiga zur&uuml;ckkommen, wenn der neue Super-Amiga erscheint?
A: Das hoffen wir, obwohl wir keine Versprechungen machen k&ouml;nnen. Die
Entscheidung liegt in den H&auml;nden unseres (Ex-)Verlegers (EMAP).<BR>
<BR>
F: Kann ich bei dieser Gelegenheit der ganzen Mannschaft f&uuml;r ihre
Hingabe zum Magazin und zur Amiga-Gemeinschaft danken?<BR>
A: Nat&uuml;rlich k&ouml;nnen Sie das. Wir danken Ihnen!<BR>
<BR>
F: Und was wird aus uns?<BR>
A: Nun, da gibt es immer noch Amiga Format (soviel wir zur Zeit wissen).
Nick und Ben werden sich um Sie k&uuml;mmern. Es tut uns wirklich sehr Leid,
dass wir sie so verlassen m&uuml;ssen. Wir alle w&uuml;rden gern in alle Zukunft
an dem Magazin weiterarbeiten, aber es ist einfach nicht m&ouml;glich. Auf
die eine oder andere Weise werden wir dasein, wenn der Super-Amiga
auftaucht, selbst wenn es h&ouml;chstwahrscheinlich keine Wiedervereinigung
des ganzen Teams im Stile der Class of 98 unter der alten Flagge sein
wird.<BR>
<BR>
F: Damit wird es also Zeit, den Amiga wegzupacken?<BR>
A: Nein! Machen Sie unbedingt weiter und wir werden uns in gl&uuml;cklicheren
Zeiten wiedersehen. Wir waren ein Verbindungspunkt f&uuml;r die Amiga-
Gemeinschaft, aber wir sind nicht der Amiga, nur ein Magazin &uuml;ber ihn.
Neue Erzeugnisse werden weiterhin zu bekommen sein und Ihre alten werden
genauso gut weiterarbeiten, auch wenn CU Amiga nicht mehr bei Ihrem
Zeitschriftenh&auml;ndler ausliegt.<BR>
<BR>
F: Wie kann ich mich mit Ihnen &uuml;ber irgendwelche Dinge in Verbindung
setzen?<BR>
A: Bitte senden Sie uns keine E-Mail mit Kommentaren und Anfragen an
unsere pers&ouml;nlichen E-Mail-Adressen. Wir erwarten eine Menge Post &uuml;ber
dieses Problem und wir haben immer noch eine Ausgabe herzustellen - die
&Uuml;berflutung unserer Mailboxen w&uuml;rde das sehr erschweren. Sie k&ouml;nnen uns
Ihre Mitteilungen an <A HREF="mailto:goodbye@cu-amiga.co.uk">goodbye@cu-amiga.co.uk</A> senden - wir begr&uuml;&szlig;en Ihre
Kommentare und werden eine Auswahl im letzten (Oktober datierten) Heft
drucken.<BR>
<BR>
Die Adressen <A HREF="mailto:general@cu-amiga.co.uk">general@cu-amiga.co.uk</A> und <A HREF="mailto:goodbye@cu-amiga.co.uk">goodbye@cu-amiga.co.uk</A> werden
noch einige Zeit bestehen, aber obwohl wir keine Antworten versprechen
k&ouml;nnen, wird sich jemand um die Postf&auml;cher k&uuml;mmern. Sie werden verstehen,
dass unsere normale diesen Bereich betreffende Post (Q&amp;A, backchat) nicht
mehr betreut werden kann. Bitte senden Sie uns keine technischen Anfragen
mehr, es ist niemand da, der sie beantworten wird.&laquo;<BR>
<BR>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
(Quelle des Originals: CU AMIGA)<BR>
<BR>
<BR>
Eine bei den wichtigsten AMIGA-Firmen privat durchgef&uuml;hrte Umfrage eines 
Anwenders hat &uuml;brigens ergeben, dass die meisten dieser Unternehmen nach 
wie vor positiv in die Zukunft blicken und den AMIGA weierhin unterst&uuml;tzen 
wollen.<BR>
<BR>
<P ALIGN=RIGHT>
<A HREF="Diverses1.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
