<HTML>
<HEAD>
<TITLE>Interviews</TITLE>
</HEAD>
<BODY BGCOLOR=#FFFFFF TEXT=#000000 LINK=#0000AA ALINK=#000066 VLINK=#000066>
<TABLE width=100% border=0 cellpadding=3 cellspacing=0>
<tr>
<td bgcolor="#000000">
<A HREF="Interviews1.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="Interviews3.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Interviews
</font>
</TD></tr>
</TABLE>
<BR>
<H3>2. Interview mit dem Herausgeber des AMIGA Survivor (von Andreas Etzrodt)</H3><BR>
<BR>
&raquo;Diesen Monat begl&uuml;cken wir Euch mit einem Interview mit Robert Iveson,
seines Zeichens Herausgeber des &quot;Amiga Survivor&quot;, eines neuen Amiga-
Magazins aus England. Das Interview wurde in zwei Etappen per E-Mail
in Englisch von Andreas Etzrodt gef&uuml;hrt. Vielen Dank an Thomas Szedlak
und Carsten Schr&ouml;der f&uuml;r Ihre Unterst&uuml;tzung!<BR>
<BR>
AA = Amiga aktuell (Andreas Etzrodt)
RI = Robert Iveson<BR>
<BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>AA:&nbsp;<TD VALIGN=TOP>Hallo Robert, vielen Dank, dass du dir die Zeit genommen hast, uns
<TR><TD><TD VALIGN=TOP>ein paar essentielle Fragen zu beantworten.
</TABLE><BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Hallo, ich hoffe, meine Antworten sind ok... Eines vorweg: Ihr solltet
<TR><TD><TD VALIGN=TOP>wissen, dass der Amiga Survivor KEIN gro&szlig;es Magazin mit gl&auml;nzendem
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Umschlag ist. Es wird nicht 25.000 Leser pro Ausgabe haben (obwohl
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>dies sch&ouml;n w&auml;re!)
</TABLE><BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>AA:&nbsp;<TD VALIGN=TOP>Kein Problem f&uuml;r uns. Stelle dich uns doch mal bitte vor. Wo lebst
<TR><TD><TD VALIGN=TOP>du, wie alt bist du, was hast Du vorher gemacht?
</TABLE><BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Also, mein Name ist Robert Iveson und ich bin der Herausgeber des
<TR><TD><TD VALIGN=TOP>neuen Amiga-Magazins &quot;Amiga Survivor&quot;. Ich bin 23 Jahre alt und
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>lebe in Leeds, einer gro&szlig;en Stadt in Gro&szlig;britannien. Bevor ich mit
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>dem Amiga Survivor begann, arbeitete ich an einem anderen kleinen
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Fanzine namens &quot;the domain&quot;. Es erschienen 11 Ausgaben, bevor ich
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>mich entschloss, in den etwas kommerzielleren Markt zu sto&szlig;en.
</TABLE><BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>AA:&nbsp;<TD VALIGN=TOP>Wie und wann bist du auf die Idee gekommen, eine vollst&auml;ndige Amiga-
<TR><TD><TD VALIGN=TOP>Zeitschrift auf den Markt zu bringen?
</TABLE><BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Vor ungef&auml;hr 3 Jahren entschloss ich mich, zusammen mit einem Freund
<TR><TD><TD VALIGN=TOP>- Keith Elcombe - einen kleinen A4-Newsletter zu erstellen: &quot;the
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>domain&quot;. Darin wurden ein paar Free- und Shareware-Programme
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>vorgestellt, und es war kostenlos f&uuml;r jedermann erh&auml;ltlich. Die Firma
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>&quot;MediaSoft&quot; von David Pettifer sah diesen Newsletter und beschloss,
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>es zu einem vollwertigen Magazin auszubauen. Nach einigen
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Meinungsverschiedenheiten entschloss ich mich, &quot;the domain&quot; selbst als
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Magazin herauszugeben. Elf Ausgaben sp&auml;ter bin ich nun hier mit
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Amiga Survivor - mit etwas Hilfe von Crystal Software International.
</TABLE><BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>AA:&nbsp;<TD VALIGN=TOP>Wie viele Mitarbeiter seid ihr? Ist auch jemand dabei, der in der
<TR><TD><TD VALIGN=TOP>Amiga-Szene bekannt ist?
</TABLE><BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Wir sind nicht viele. Ich schreibe alle News, Vorberichte, einige
<TR><TD><TD VALIGN=TOP>Artikel und ein paar Reviews. Au&szlig;erdem stelle ich das Magazin
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>zusammen. Ein guter Freund von mir - Chris Spicer - bringt etliche
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Reviews und einen Amiga-Comic-Strip &quot;Joe and Ami&quot; mit ein. Ein
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>anderer Freund - Keith Elcombe - schreibt monatlich einen Kommentar
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>zur allgemeinen Computer-Situation, &quot;The Fifth Column&quot;. Wir sind
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>alle seit Jahren Amiga-Fans. Seit &uuml;ber 10 Jahren besitze ich nun
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Amigas und habe keinerlei Absicht, ihn zu verlassen. Au&szlig;erdem bekommen
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>wir noch ein paar Artikel von au&szlig;erhalb (private Anwender und
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Schreiber von anderen Magazinen).
</TABLE><BR>
<BR>
AA: Produziert ihr den Survivor auf dem Amiga? Oder wenigstens teilweise?<BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Ja, das Magazin wird komplett auf dem Amiga erstellt. Wir benutzen
<TR><TD><TD VALIGN=TOP>daf&uuml;r einen A1200 mit 32 MB RAM, einem 68060 und Softlogik's
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Pagestream 3.3a.
</TABLE><BR>
<BR>
AA: Ist das alles? Welche Computer benutzt ihr zu Hause?<BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Ich arbeite zu Hause an dem Magazin (das ist billiger). Der genannte
<TR><TD><TD VALIGN=TOP>Amiga geh&ouml;rt mir. Chris Spicer benutzt seinen Amiga 1200 und Keith
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Elcombe arbeitet an seinem Apple PowerMac.
</TABLE><BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>AA:&nbsp;<TD VALIGN=TOP>Welche Zielgruppe peilt ihr mit dem Magazin an? Die A500/A1200-
<TR><TD><TD VALIGN=TOP>Benutzer oder die Power-User, die bessere Hardware besitzen?
</TABLE><BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Ich unterst&uuml;tze alle Amiga-Computer, f&uuml;r die Software geschrieben
<TR><TD><TD VALIGN=TOP>wird. Ich bevorzuge aber die professionelleren Amigas mit schnellem
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Prozessor o.&auml;. und deren Software. Es scheint der einzige Weg nach
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>vorn zu sein f&uuml;r den Amiga. Es gibt keinen Grund, den A500 besonders
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>zu unterst&uuml;tzen, weil es daf&uuml;r nur noch sehr wenig Benutzer gibt
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>(obwohl ich mich auch irren k&ouml;nnte!).
</TABLE><BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>AA:&nbsp;<TD VALIGN=TOP>Welche Themen werden im Magazin erscheinen? Spielevorstellungen,
<TR><TD><TD VALIGN=TOP>Workshops f&uuml;r professionelle Software, Tips &amp; Tricks, News, und so
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>weiter? Welche mehr?
</TABLE><BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Am Anfang wird Amiga Survivor haupts&auml;chlich als Spiele-Magazin
<TR><TD><TD VALIGN=TOP>gef&uuml;hrt. Wenn Nachfrage nach weiteren Applikationen besteht, werden
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>wir in Zukunft auch dar&uuml;ber nachdenken. Ich finde, dass die anderen
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Magazine ihr Augenmerk zu sehr von den Spielen abwenden. Amiga
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Survivor wurde ins Leben gerufen, um diese Marktl&uuml;cke zu f&uuml;llen.
</TABLE><BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>AA:&nbsp;<TD VALIGN=TOP>Wie sieht es mit Werbung in eurem Magazin aus? Gibt es gen&uuml;gend
<TR><TD><TD VALIGN=TOP>Inserenten?
</TABLE><BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Einige Firmen sind durchaus daran interessiert, Anzeigen im Survivor
<TR><TD><TD VALIGN=TOP>zu schalten. Aber Anzeigen zu bekommen ist nicht unbedingt Priorit&auml;t.
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Wenn ich meine, ich muss mehr Anzeigen im Survivor mit aufnehmen,
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>werde ich aber auf jeden Fall den Umfang des Magazins erh&ouml;hen. Ich
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>will keine Seiten mit Anzeigen verschwenden.
</TABLE><BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>AA:&nbsp;<TD VALIGN=TOP>Was wird das Magazin kosten? Wie viele Seiten wird es haben, und was
<TR><TD><TD VALIGN=TOP>bekommen wir daf&uuml;r (eine Diskette/CD?)?
</TABLE><BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Man kann das Magazin nur auf dem Postweg bekommen. Es kostet 2.95
<TR><TD><TD VALIGN=TOP>Pfund inklusive Versandkosten innerhalb Gro&szlig;britanniens. F&uuml;r das
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>europ&auml;ische Ausland sind - wieder inklusive Versandkosten - 3.95 Pfund
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>f&auml;llig. &Uuml;bersee-Bestellungen kosten 4.95 Pfund. Amiga Survivor wird
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>NICHT mit einer Diskette ausgeliefert, aus mehreren Gr&uuml;nden: Erstens
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>wird es f&uuml;r mich am Anfang zu teuer sein - besonders mit CD, und
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>zweitens denke ich, dass viele meiner Leser KEINE Coverdiskette haben
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>m&ouml;chten. Aber auch hier: Wenn gen&uuml;gend Nachfrage besteht, werde ich
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>mich in Zukunft auch um eine Coverdiskette k&uuml;mmern. Es h&auml;ngt nur davon
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>ab, wie gut sich das Magazin verkauft. Amiga Survivor ist im A5-
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Format, hat 40 Seiten Umfang und einen vollfarbigen Umschlag.
</TABLE><BR>
<BR>
AA: Wird es den Survivor auch in Deutschland geben?<BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Wie gesagt ist der Survivor nur per Post zu bekommen. Jeder auf der
<TR><TD><TD VALIGN=TOP>ganzen Welt kann ihn so bekommen. Wir haben die M&ouml;glichkeit,
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Kreditkarten zum Bezahlen zu akzeptieren (auf unserer Website ist ein
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Bestellformular erh&auml;ltlich). Wir brauchen dringend Distributoren f&uuml;r
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>die ganze Welt. Zur Zeit haben wir einen Distributor in Gro&szlig;britannien
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>- Epic Marketing - und einen in Schweden - Micsam Distribution. Wenn
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>uns jemand helfen m&ouml;chte, kann er sich bei uns melden.
</TABLE><BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>AA:&nbsp;<TD VALIGN=TOP>Wenn nun wirklich jemand dieses Interview liest und daran interessiert
<TR><TD><TD VALIGN=TOP>ist, die Distribution in Deutschland oder anderswo zu &uuml;bernehmen, was
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>m&uuml;sste er wissen?
</TABLE><BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Also, am besten w&auml;re es, er w&uuml;rde mich unter <A HREF="mailto:thedomain@enterprise.net">thedomain@enterprise.net</A>
<TR><TD><TD VALIGN=TOP>kontaktieren. Dann k&ouml;nnten wir uns &uuml;ber die Preise und
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Zahlungsmodalit&auml;ten einigen. Zur Zeit gibt es fixe Preise, und die
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Bezahlungen werden am besten per Bank&uuml;berweisung get&auml;tigt. Wenn also
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>ein deutscher (oder anderer) Distributor dieses hier liest - melden
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Sie sich - Sie k&ouml;nnten etwas daran verdienen!
</TABLE><BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>AA:&nbsp;<TD VALIGN=TOP>Gibt es die M&ouml;glichkeit, ein Abonnement zu bekommen, also j&auml;hrlich zu
<TR><TD><TD VALIGN=TOP>bezahlen?
</TABLE><BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Ja, kein Problem. Andere W&auml;hrungen als Pfund k&ouml;nnen Probleme bereiten,
<TR><TD><TD VALIGN=TOP>deshalb w&auml;re es auch billiger, einen deutschen Distributor zu haben.
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Auf unserer Website wird es aber bald ein Online-Bestellformular
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>geben, so dass jeder per Kreditkarte den Survivor abonnieren kann.
</TABLE><BR>
<BR>
AA: Ist es geplant, 12 Ausgaben pro Jahr zu erstellen?<BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Ja, so gut wie m&ouml;glich. Jede Ausgabe wird etwa in der Mitte des Monats
<TR><TD><TD VALIGN=TOP>erscheinen (zur Zeit gibt es noch keine fixen Termine), es k&ouml;nnte aber
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>ein paar Tage verschoben werden, wenn es wenig Spiele zu testen gibt.
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Aber, ja, ich habe auf jeden Fall das Ziel, 12 Ausgaben pro Jahr
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>herauszugeben.
</TABLE><BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>AA:&nbsp;<TD VALIGN=TOP>Wie sehen die ersten Feedbacks aus? Wie ist der erste Eindruck der
<TR><TD><TD VALIGN=TOP>Leser?
</TABLE><BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Ich hoffe, es wird erfolgreich sein, die ersten Reaktionen vieler
<TR><TD><TD VALIGN=TOP>meiner Leser waren SEHR SEHR positiv. Viele Spielehersteller haben
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>auch ihr gro&szlig;es Interesse bekundet und erkl&auml;rten, der Survivor
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>verdiene einen Erfolg!
</TABLE><BR>
<BR>
AA: Gibt es eine Homepage f&uuml;r den Amiga Survivor?<BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Nat&uuml;rlich: <A HREF="http://www.crystal-software.com" TARGET="_TOP">http://www.crystal-software.com</A>. Hier gibt es Informationen
<TR><TD><TD VALIGN=TOP>&uuml;ber Crystal's kommende Spiele, und man kann dem Link zu den Amiga-
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Survivor-Seiten folgen.
</TABLE><BR>
<BR>
AA: Wirst Du auf der Computer '98 in K&ouml;ln anwesend sein?<BR>
<BR>
RI: Nein, leider nicht. Sorry.<BR>
<BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>AA:&nbsp;<TD VALIGN=TOP>Was h&auml;ltst Du von der aktuellen Situation des Amigas? Die derzeitige
<TR><TD><TD VALIGN=TOP>Politik von Amiga, Inc. und Amiga Int. ist ja, einfach nichts
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>durchsickern zu lassen. W&auml;re der PowerPC nicht die ideale L&ouml;sung? Was
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>sollte in der Zukunft ge&auml;ndert werden?
</TABLE><BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Ich habe immer noch viel Vertrauen in Amiga International. Ich
<TR><TD><TD VALIGN=TOP>glaube, die PowerPC-L&ouml;sung ist sehr gut. Die Technologie, die f&uuml;r den
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Apple Macintosh entwickelt wurde, &uuml;berfl&uuml;gelt zum Beispiel alles, was
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>ich bislang auf Pentium-Basis gesehen habe. Also denke ich, es ist der
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>richtige Schritt f&uuml;r den Amiga.
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Allerdings ist es nicht gut, dass AI und Gateway so wenig &uuml;ber die
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>zuk&uuml;nftigen Amigas preisgeben. Die Anwender wissen einfach nicht, wo
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>sie mit ihrer Maschine zur Zeit sind. Wenn sie jetzt nicht etwas
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Vertrauen bekommen, werden sie den Amiga einfach verlassen. Nur
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>wirkliche Amiga-Freaks werden dann noch bleiben - wie ich. Au&szlig;erdem
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>bete ich, dass AI und Gateway die neuen Amigas richtig bewerben
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>und den PC-Benutzern einen Grund geben, die Maschine zu wechseln. Wenn
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>sie so viel Vertrauen in die neue Technologie und das neue OS haben,
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>sollten sie es einigen gro&szlig;en PC-Zeitschriften vorstellen, um die
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Leute neugierig zu machen - und zwar JETZT. Die PC-Benutzer m&uuml;ssen
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>endlich begreifen, dass der Amiga nicht mehr die 1MB-Spiele-Maschine
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>mit h&ouml;chstens 8-bit-Grafik ist.
</TABLE><BR>
<BR>
AA: Noch ein paar letzte Worte zu unseren Lesern?<BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>Also, ihr wisst es alle. Bleibt bitte beim Amiga! Gebt ihm ein paar
<TR><TD><TD VALIGN=TOP>weitere Jahre und seht, wo wir im Jahr 2000 sein werden. Ihr wisst ja,
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>der Amiga bietet das gleiche wie der PC, also gibt es keinen Grund,
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>die Plattform zu wechseln.
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>Wenn ihr die aktuellen Spiele haben m&ouml;chtet, kauft euch ein N64! Es
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>gibt einfach keinen Grund, Tausende DM in einen neuen PC zu stecken,
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>der nach sp&auml;testens 3 Monaten veraltet sein wird! Aber: Das wusstet
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>ihr ja sowieso. =)
</TABLE><BR>
<BR>
AA: Vielen Dank f&uuml;r das tolle Interview.<BR>
<BR>
RI: Kein Problem - ist es denn schon vorbei?<BR>
<BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>AA:&nbsp;<TD VALIGN=TOP>Ich h&auml;tte ja noch gern ein paar Fragen gestellt, aber mir h&auml;tten noch
<TR><TD><TD VALIGN=TOP>welche einfallen m&uuml;ssen...
</TABLE><BR>
<TABLE CELLPADDING=0 CELLSPACING=0><TR><TD VALIGN=TOP>RI:&nbsp;<TD VALIGN=TOP>War ja auch nur ein Scherz. Ich habe ein Interview mit Mike Hiltunen
<TR><TD><TD VALIGN=TOP>von Prelusion Software f&uuml;r die Ausgabe 2 von Amiga Survivor gef&uuml;hrt
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>und wei&szlig;, wie schwierig es ist, sich Fragen f&uuml;r Interviews einfallen
<TR><TD VALIGN=TOP>    &nbsp;<TD VALIGN=TOP>zu lassen.
</TABLE><BR>
<BR>
AA: Wir w&uuml;nschen dir alles Gute und viel Erfolg!!!<BR>
<BR>
RI: Danke! Und f&uuml;r euch auch!<BR>
<BR>
<BR>
<TABLE CELLPADDING=0 CELLSPACING=0>
<TR><TD><TD VALIGN=TOP>All the best,
</TABLE>
Rob&laquo;<BR>
<BR>
<P ALIGN=RIGHT>
<A HREF="Interviews1.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="Interviews3.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
