<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR=#FFFFFF TEXT=#000000 LINK=#0000AA ALINK=#000066 VLINK=#000066>
<TABLE width=100% border=0 cellpadding=3 cellspacing=0>
<tr>
<td bgcolor="#000000">
<A HREF="Geruechte.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H2>Abschlie&szlig;end</H2><BR>
<BR>
In der letzten Ausgabe habe ich in Zusammenhang mit der (im Wesentlichen
nicht vorhandenen) Informationspolitik von AMIGA, Inc. die Frage gestellt,
ob man blo&szlig; nichts h&ouml;rt, oder sich in der AMIGA-Entwicklungsabteilung
wirklich nichts tut.<BR>
Zwei Dinge, die sich im August ereignet haben, sind bezeichnend f&uuml;r diese
Politik, die offenbar auch von AMIGA, Inc. unterst&uuml;tzenden Organisationen
getragen wird:<BR>
<BR>
1. Da wird einem recht bekannten Amiga-Newsservice eine Mail aus den
Kreisen des Industry Council Open AMIGA (ICOA), der Interessenvertretung
der AMIGA-Entwickler, zugespielt, die einige grunds&auml;tzliche Details des
geplanten AMIGA OS 5.0 enth&auml;lt. Kurz nach der Ver&ouml;ffentlichung der Mail
gehen beim Betreiber dieses Newsservice Beschwerden ein, dass er eine
interne ICOA-Mitteilung, die NDA-Informationen (die nicht weitergegeben
werden d&uuml;rfen) enthalte, verbreitet h&auml;tte. Soweit so gut.<BR>
Was allerdings nachdenklich stimmen muss, ist die Tatsache, dass diese
ICOA-Mitteilung keinerlei Material enth&auml;lt, das auch nur ann&auml;herd als
&quot;brisant&quot; oder sch&uuml;tzenswert einzustufen w&auml;re - im Gegenteil: Die
enthaltenen Informationen waren bereits zuvor mehr oder weniger ausf&uuml;hrlich
in Newsgroups und Magazinen (darunter auch diesem) behandelt worden.
Vermutlich wird der eine oder andere jetzt argumentieren, dass derartige
ICOA-Informationen vielleicht aus Prinzip nicht der &Ouml;ffentlichkeit
zug&auml;nglich gemacht werden sollen.<BR>
Aber muss es angesichts der anhaltenen Krise unseres Computersystems, und
insbesondere der sinkenden Anwenderzahl, nicht Prinzip sein, nur das
geheimzuhalten, was _auf keinen Fall_ ver&ouml;ffentlicht werden darf?
AMIGA, Inc. und der ICOA scheinen leider die gegenteilige Politik zu
verfolgen: Es wird nur das ver&ouml;ffentlicht, was _auf keinen Fall_
geheimgehalten werden muss. Und das ist einfach zuwenig.<BR>
<BR>
2. Noch bezeichnender f&uuml;r die Politik von AMIGA, Inc. ist die
Bereitstellung gewisser Informationen auf der WWW-Site des Unternehmens. Um
diese abrufen zu k&ouml;nnen, muss man seinen Namen und die E-Mail-Adresse
hinterlegen! Gleichzeitig wird man verpflichtet, niemanden - insbesondere
au&szlig;erhalb der AMIGA-Gemeinde - &uuml;ber das Material, das dort zu finden ist,
zu informieren, da die M&ouml;glichkeit best&uuml;nde, dass es &quot;missbraucht&quot; wird.
Brisante Daten also? Keineswegs. All jenes ist den Amiga-Anwendern nicht
unbekannt - im Gegenteil: Eine Zusammenfassung der Informationen war in der
letzten Ausgabe von AMIGA aktuell enthalten! Und bislang hat sich bei uns
noch niemand &uuml;ber die Ver&ouml;ffentlichung beschwert.<BR>
<BR>
Stellt sich also die Frage, aus welchen Gr&uuml;nden AMIGA, Inc. diese &quot;Nebel-
Politik&quot; verfolgt.<BR>
Angeblich seien die Gesch&auml;ftspartner der Entwicklungsabteilung,
insbesondere die Entwickler des vielzitierten neuen Multimedia-Chipsatz,
daran interessiert, alles m&ouml;glichst lang geheimzuhalten.<BR>
Das ist vielleicht dann zu verstehen, wenn es sich um Details neuer
Technologien, die ja im zuk&uuml;nftigen AMIGA verwendet werden sollen, handelt.
Das aber war bei den Beispielen oben &uuml;berhaupt nicht der Fall!<BR>
<BR>
Oder ist &quot;R&uuml;cksichtnahme auf die Partner&quot; wom&ouml;glich nur der vorgeschobene
Grund? Glaubt die Entwicklungsabteilung vielleicht, dass sie mit ihrer
&quot;Null Info&quot;-Politik zu einer Beruhigung der Anwenderschaft beitragen kann,
die doch erst durch die missgl&uuml;ckte Ver&ouml;ffentlichung ihrer AMIGA-Pl&auml;ne
n&ouml;tig wurde? Oder will sie erneute Konfusion vermeiden?<BR>
Was auch immer mit dieser Politik bezweckt wird, letztendlich wird damit
das genaue Gegenteil dessen erreicht: Da es sich gar nicht vermeiden l&auml;sst,
dass ab und zu versehentlich interne Details an die &Ouml;ffentlichkeit gelangen
(das zuerst geschilderte Ereignis ist das beste Beispiel), wird die
Ger&uuml;chtek&uuml;che weiterhin brodeln - und das wohl in zunehmendem Ausma&szlig;.<BR>
<BR>
<BR>
Damit bis n&auml;chsten Monat,<BR>
<BR>
Euer<BR>
<BR>
Carsten Schr&ouml;der
<P ALIGN=RIGHT>
<A HREF="Geruechte.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
