<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR=#FFFFFF TEXT=#000000 LINK=#0000AA ALINK=#000066 VLINK=#000066>
<TABLE width=100% border=0 cellpadding=3 cellspacing=0>
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2><BR>
<BR>
- clickBOOM-Update<BR>
<BR>
<IMG SRC="img/Napalm.jpg" ALT="Screenshot"><BR>
<BR>
Das von vielen AMIGA-Besitzern herbeigesehnte Napalm-Demo ist endlich
ver&ouml;ffentlicht worden. Leider befindet es sich in einem Beta-Status und
l&auml;uft trotz Einhalten der Systemvoraussetzungen nicht auf allen AMIGAs
(leider auch auf meinem nicht - wer mir helfen will, hier mein Problem:
Das Demo l&auml;uft bis zum Titelbild, nach einer bestimmten Ladezeit friert
der Mauszeiger ein und nicht sgeht mehr) - Diejenigen, die das Demo zum
Laufen gebracht haben, sprehcn von einem der besten AMIGA-Spieler aller
Zeiten. Ein AGPJ-Preview folgt (hoffentlich) so schnell wie m&ouml;glich...
Heruntergeladen werden kann die 6.5 MB gro&szlig;e LHA-Datei auf der Homepage
von clickBOOM. Dort gibt es auch einige Tips und Updates f&uuml;r das Demo.
clickBOOM haben auf ihrer Homepage einen Text ver&ouml;ffentlicht, in dem sie
Quake-Besitzer bitten, keine illegalen QuakePPC-Versionen zu nutzen. Je
weiter diese Versionen verbreitet seien, desto geringer ist die Chance auf
eine offizielle QuakePPC-Version. Das Fehlen einer solchen version wird
unter anderem damit begr&uuml;ndet, da&szlig; Amiga Inc. keine offizielle Position
zu den PPC-Prozessoren bezogen hat und da&szlig; die PowerUp-Boards bisher zu
wenig verbreitet sind.<BR>
Weiterhin wurde nun der versprochene 060-Patch f&uuml;r registrierte Quake-
Benutzer ver&ouml;ffentlicht, der das Spiel um 0.5-2 Frames pro Sekunde
schneller machen soll.<BR>
<BR>
- Vulcan Software-Update<BR>
<BR>
Weitere Schritte hin zur PC- und Playstation-Firma hat Vulcan Software
vollzogen. So wurden leider die Spiele Caveman Species und Almagica - 
Scions of a Forgotten World gecancelt, da beide Entwickler-Teams keine
ausreichende wirtschaftliche Kraft mehr im immer kleiner werdenden
AMIGA-Markt sehen. Caveman Species wird nun f&uuml;r PCs weiterentwickelt,
was aus Almagica wird, wissen wohl nur die Entwickler selbst.<BR>
Dazu pa&szlig;t dann auch das folgende Zitat Vulcans an die Abonnenten ihres
Newsletters: &quot;We would also like to thank the Amiga users around the world
who have supported us by purchasing Genetic Species but would like to add,
'there is not many of you left is there?'....&quot;<BR>
Positiv dagegen ist, da&szlig; die Ver&ouml;ffentlichung von Wasted Dreams kurz
bevorsteht, ein Demo des Spiels soll am 1. September erscheinen.
Weiterhin hat Vulcan Software s&auml;mtliche CheatCodes f&uuml;r Genetic Species
ver&ouml;ffentlicht:<BR>
<BR>
<H3>CHEATS</H3>
<TABLE CELLPADDING=0 CELLSPACING=0>
<TR><TD VALIGN=TOP>FrameCount      &nbsp;<TD VALIGN=TOP>Enable FrameCounter.
<TR><TD VALIGN=TOP>DangerZone      &nbsp;<TD VALIGN=TOP>Maximum Weapon Ammo.
<TR><TD VALIGN=TOP>FoxMulder       &nbsp;<TD VALIGN=TOP>Maximum Weapon KillPower.
<TR><TD VALIGN=TOP>Caffeine        &nbsp;<TD VALIGN=TOP>Immortality
<TR><TD VALIGN=TOP>FullCircle      &nbsp;<TD VALIGN=TOP>Remove Player Shot Collision.
<TR><TD VALIGN=TOP>Goldbeer        &nbsp;<TD VALIGN=TOP>Disable Artificial Intelligence.
<TR><TD VALIGN=TOP>Sober           &nbsp;<TD VALIGN=TOP>Enable Artificial Intelligence.
<TR><TD VALIGN=TOP>SatanClaus      &nbsp;<TD VALIGN=TOP>Remove All Weapon NoiseFactors
<TR><TD VALIGN=TOP>Scorpions       &nbsp;<TD VALIGN=TOP>Disable Puzzle Board.
<TR><TD VALIGN=TOP>AlienRace       &nbsp;<TD VALIGN=TOP>Make The Player Invisible To All Enemies.
<TR><TD VALIGN=TOP>Chainsaw        &nbsp;<TD VALIGN=TOP>Change The Death Sequence A Bit.
<TR><TD VALIGN=TOP>JumpingJack     &nbsp;<TD VALIGN=TOP>Enable Jumping Bunny Function.
<TR><TD VALIGN=TOP>HellRaiser      &nbsp;<TD VALIGN=TOP>Reset Weapon Reload Time.
<TR><TD VALIGN=TOP>MindFields      &nbsp;<TD VALIGN=TOP>Unlock All Doors.
<TR><TD VALIGN=TOP>Sissies         &nbsp;<TD VALIGN=TOP>Able To Carry Everything.
<TR><TD VALIGN=TOP>RushHour        &nbsp;<TD VALIGN=TOP>Exstream Enemy Movement Velocity.
<TR><TD VALIGN=TOP>Astronomical    &nbsp;<TD VALIGN=TOP>Enemies Will Never Retreat.
<TR><TD VALIGN=TOP>Elite           &nbsp;<TD VALIGN=TOP>Exstream Enemy Shot Rate.
<TR><TD VALIGN=TOP>Muppet Show     &nbsp;<TD VALIGN=TOP>Set Shade Factor To $D000
</TABLE><BR>
<BR>
<H3>LEVELS</H3>
<TABLE CELLPADDING=0 CELLSPACING=0>
<TR><TD VALIGN=TOP>Retribution     &nbsp;<TD VALIGN=TOP>LevelCode For Stage0
<TR><TD VALIGN=TOP>Dysfunctional   &nbsp;<TD VALIGN=TOP>LevelCode For Stage1
<TR><TD VALIGN=TOP>Antimatter      &nbsp;<TD VALIGN=TOP>LevelCode For Stage2
<TR><TD VALIGN=TOP>EyeOfTheStorm   &nbsp;<TD VALIGN=TOP>LevelCode For Stage3
</TABLE><BR>
<BR>
<H3>WEAPONS</H3>
<TABLE CELLPADDING=0 CELLSPACING=0>
<TR><TD VALIGN=TOP>Ambrosia        &nbsp;<TD VALIGN=TOP>LevelCode For Rocket Launcher
<TR><TD VALIGN=TOP>Cncd            &nbsp;<TD VALIGN=TOP>LevelCode For Plasma Gun
<TR><TD VALIGN=TOP>Iris            &nbsp;<TD VALIGN=TOP>LevelCode For Flechette
<TR><TD VALIGN=TOP>Polka B         &nbsp;<TD VALIGN=TOP>LevelCode For Assault Rifle
<TR><TD VALIGN=TOP>Parallax        &nbsp;<TD VALIGN=TOP>LevelCode For Mini Gun
<TR><TD VALIGN=TOP>SpaceBalls      &nbsp;<TD VALIGN=TOP>LevelCode For Flame Thrower
<TR><TD VALIGN=TOP>3LE             &nbsp;<TD VALIGN=TOP>LevelCode For Tazer
<TR><TD VALIGN=TOP>Stellar         &nbsp;<TD VALIGN=TOP>LevelCode For Ind. Drill
<TR><TD VALIGN=TOP>Puzzle          &nbsp;<TD VALIGN=TOP>LevelCode For Stun G. Launcher
<TR><TD VALIGN=TOP>Kefrens         &nbsp;<TD VALIGN=TOP>LevelCode For Pistol
<TR><TD VALIGN=TOP>Impact          &nbsp;<TD VALIGN=TOP>LevelCode For Sil. Pistol
<TR><TD VALIGN=TOP>Silents         &nbsp;<TD VALIGN=TOP>LevelCode For Fire Axe
<TR><TD VALIGN=TOP>Scoopex         &nbsp;<TD VALIGN=TOP>LevelCode For Aut. Pistol
<TR><TD VALIGN=TOP>Deathrow        &nbsp;<TD VALIGN=TOP>LevelCode For Hugger Acid
<TR><TD VALIGN=TOP>Loonies         &nbsp;<TD VALIGN=TOP>LevelCode For Laser Mine
<TR><TD VALIGN=TOP>Impulse         &nbsp;<TD VALIGN=TOP>LevelCode For Mantis Beam
<TR><TD VALIGN=TOP>Depth           &nbsp;<TD VALIGN=TOP>LevelCode For Laser Rifle
<TR><TD VALIGN=TOP>Floppy          &nbsp;<TD VALIGN=TOP>LevelCode For Hand Grenade
</TABLE><BR>
<BR>
<H3>OBJECTS</H3>
<TABLE CELLPADDING=0 CELLSPACING=0>
<TR><TD VALIGN=TOP>Gods            &nbsp;<TD VALIGN=TOP>LevelCode For Poopie
<TR><TD VALIGN=TOP>Artwork         &nbsp;<TD VALIGN=TOP>LevelCode For Data Disc
<TR><TD VALIGN=TOP>Rage            &nbsp;<TD VALIGN=TOP>LevelCode For Violet Keycard
<TR><TD VALIGN=TOP>C-Lous          &nbsp;<TD VALIGN=TOP>LevelCode For Red Keycard
<TR><TD VALIGN=TOP>Subacid         &nbsp;<TD VALIGN=TOP>LevelCode For Green Keycard
<TR><TD VALIGN=TOP>Balance         &nbsp;<TD VALIGN=TOP>LevelCode For Blue Keycard
<TR><TD VALIGN=TOP>Efreet          &nbsp;<TD VALIGN=TOP>LevelCode For Bio Toxin
<TR><TD VALIGN=TOP>TBL             &nbsp;<TD VALIGN=TOP>LevelCode For Save Game
<TR><TD VALIGN=TOP>VirtualDreams   &nbsp;<TD VALIGN=TOP>LevelCode For Orange Keycard
</TABLE><BR>
<BR>
- neues Trauma Zero-Lebenszeichen<BR>
<BR>
<IMG SRC="img/TraumaZero.jpg" ALT="Screenshot"><BR>
<BR>
Es gibt ein neues Lebenszeichen von Trauma Zero, dem Spiel, das hohe Wellen
schlug, seitdem ein selbstablaufendes Demo im Aminet auftauchte. Nun gibt
es ein neues nicht spielbares Demo, das die ersten Eindr&uuml;cke noch
verst&auml;rkt. Wenn das Spiel auch nur ann&auml;hernd so gut wird, wie das Demo
aussieht, steht uns eines der besten 2D-Shoot Em Ups aller Zeiten ins Haus.
Einige Besonderheiten sind die sehr fl&uuml;ssige und sehr farbenfrohe Grafik,
die perfekte Stereo-Musik, digitalisierte Sprache, ein 2-Spieler-Modus
und Schatteneffekte. Die Demoversion, die &uuml;brigens schon aus dem Jahr
1997 stammt, kann aus dem Aminet (game/demo/TraumazeroP2.lha)
heruntergeladen werden. Wann das Spiel erscheint, steht nicht fest,
hoffentlich bald... Weitere Infos wollen die Programmierer auf der Messe
Pianeta Amiga in Empoli am 26. und 27. September verraten. Man darf
gespannt sein.<BR>
<BR>
- Virtual Grand Prix-Update / weitere Epic-News<BR>
<BR>
<IMG SRC="img/VirtualGrandPrix.jpg" ALT="Screenshot"><BR>
<BR>
Das bald bei Epic erscheinende Spiel Virtual Grand Prix sorgte bereits vor
einigen Monaten f&uuml;r Schlagzeilen, als ein Demo unter dem Namen Alien F1 im
Aminet erschien. Seitdem hat sich das Spiel nat&uuml;rlich weiterentwickelt.
Das Spiel wird die komplette Saison 1998 enthalten, also die 16 Strecken
und 22 Autos. Die 3D-Engine bietet einen Low Res- (320x256) und einen
High Res-Modus (320x512). Weitere Features sind umfassende
Einstellungsm&ouml;glichkeiten am Auto, 6 verschiedene Kameraperspektiven,
Replay-Funktion und Computergegner mit einer hohen k&uuml;nstlichen Intelligenz.
Das Spiel soll trotz der gelungenen Engine recht schnell ablaufen. Auf
einem 25Mhz-030-Prozessor soll es z.B. mit 15-18 Frames pro Sekunde
ablaufen.<BR>
Systemvoraussetzungen sind AGA oder Grafikkarte, 4 MB RAM, 030-Prozessor
und ein CD-ROM-Laufwerk.<BR>
Virtual Grand Prix soll zur Amiga '98 im November erscheinen. Wer das Spiel
jetzt schon bestellt, bezahlt statt 25 englische Pfund nur 20.<BR>
Weiterhin erscheinen bei Epic demn&auml;chst das Fu&szlig;ballspiel Eat the Whistle:
France 98 (Preview in dieser AGPJ-Ausgabe) (August / September 1998) und
zwei Midrange-Spiele: Starfighter (Wing Commander-Clone) und ein
Strategiespiel, dessen Name noch nicht feststeht (beide im Oktober 1998).<BR>
<BR>
- Forgotten Forever-Update<BR>
<BR>
<IMG SRC="img/ForgottenForever.jpg" ALT="Screenshot"><BR>
<BR>
Weitere Details und Screenshots des Command&amp;Conquer-Clones Forgotten
Forever sind an die &Ouml;ffentlichkeit gelangt.<BR>
Forgotten Forever wird &uuml;ber 50-60 Missionen verf&uuml;gen, Mission Disks sind
geplant. Die einzelnen Terrains werden 4064x4064 Pixel gro&szlig; sein (zum
Vergleich: Dune 2 - 1024x1024). Dem Spieler stehen bis zu 50 verschiedene
Fortbewegungsmittel und 30 verschiedene Geb&auml;udetypen zur Verf&uuml;gung.
Besonders interessant d&uuml;rften die verschiedenen Terrain-Typen sein. Sie
reichen von Schnee &uuml;ber W&uuml;sten- und Felsenlandschaften bis zu Missionen,
die in der Nacht spielen. Die Multiplayer-Funktion kann &uuml;ber Nullmodemkabel
oder TCP/IP genutzt werden. Systemvoraussetzungen von Forgotten Forever
sind AGA oder CyberGFX, 020-Prozessor, 1 MB Chip RAM, 4 MB Fast RAM und
ein CD-ROM-Laufwerk. Schnellere AMIGAs werden empfohlen.<BR>
<BR>
- Dafel: Bloodline-Update<BR>
<BR>
Dafel: Bloodline ist der erste Teil einer neuen geplanten Rollenspiel-
Reihe. Der Spieler steuert den Hauptcharakter Dafel, der sich in einem
Religionskonflikt zwischen einer alten und einer neuen Religion in seinem
Land befindet. Das Soundsystem des Spiels FSG sorgt daf&uuml;r, da&szlig; man je
nachdem ob Dafel rechts oder links von einem Objekt steht, den Ton, der
durch das Objekt (z.B. eine Glocke oder ein Vogel) auch aus dem rechten
oder linken Lautsprecher h&ouml;rt. Die Lautst&auml;rke dieses Tons wird durch die
Entfernung Dafels zu dem Objekt bestimmt, je n&auml;her, desto lauter. Im Moment
wird nur der Paula-Chip unterst&uuml;tzt, AHI-Support soll aber noch eingebaut
werden. Zu den Systemvoraussetzungen geh&ouml;ren ein 68030-Prozessor, AGA oder
Grafikkarte, 2x-CD-ROM-Laufwerk und 40 MB freier Festplattenplatz.
Eine fr&uuml;he Demoversion soll demn&auml;chst auf der Homepage von Corruption
Software erscheinen, die Endversion erscheint im Herbst bei Sadeness
Software.<BR>
<BR>
- neue AMIGA-Spielezeitschrift: AMIGA Survivor<BR>
<BR>
Eine neue AMIGA-Spielezeitschrift hat das Licht der Welt erblickt. Amiga
Survivor ist eine englischsprachige Schwarz-Wei&szlig;-Zeitschrift im DIN
A5-Format. Die erste Ausgabe ist 40 Seiten stark und beinhaltet unter
anderem einen sehr ausf&uuml;hrlichen Genetic Species-Test. Weiterhin enth&auml;lt
sie einige Tests verschiedener PD- und Licenceware-Spiele, News, Previews
von Spielen wie Samba World Cup, Olofight und anderen, einen
WOA-Messebericht und vieles mehr. Eine Konkurrenz zu &quot;richtigen&quot; AMIGA-
Zeitschriften ist Amiga Survivor zwar nicht. Da diese aber immer weniger
werden (Rest in Peace, CU AMIGA !), kann AMIGA Survivor unter Spielefans
durchaus einige Anh&auml;nger finden. Das von Crystal Software vertriebene
Magazin kostet 2,95 englische Pfund (in Deutschland 11,45 DM) und kann
&uuml;ber die Crystal Software-Homepage oder &uuml;ber Epic bestellt werden.<BR>
<BR>
- Operation: Counterstrike-Update<BR>
<BR>
Sadeness Software hat nach Forgotten Forever ein weiteres Echtzeit-
Strategiespiel unter Vertrag genommen: Operation: Counterstrike. Das Spiel
wird ein langes Intro und Zwischensequenzen bieten. Jedes der drei Teams
hat seine individuellen Geb&auml;ude und Einheiten. Weiterhin verf&uuml;gt das
Spiel &uuml;ber TCP/IP-Support und einen Level Editor. Systemvoraussetzungen
sind ein 030-Prozessor, AGA oder CyberGFX, 4 MB Fast RAM und ein 4x-CD-
ROM-Laufwerk.<BR>
<BR>
- Tales of Tamar<BR>
<BR>
<IMG SRC="img/TalesOfTamar.jpg" ALT="Screenshot"><BR>
<BR>
Tales of Tamar ist ein neues Spiel, das von Eternity Software entwickelt
wird. Die Besonderheit des Spiels ist, da&szlig; es per e-mail gespielt wird.
Jeder Spieler spielt eine Runde des Spiels, schickt seinen Spielstand dann
per e-mail an den Tales of Tamar-Server, der die Daten aller Spieler
auswertet und dann an jeden einzelnen Mitspieler zur&uuml;ckschickt.
Tales of Tamar spielt in einer Fantasy-Welt mit Dwarfs, Elfs, Orcs und
vielen anderen Gesch&ouml;pfen. Der Spieler hat die Aufgabe, ein Reich
aufzubauen, es gegen b&ouml;se Feinde zu verteidigen.<BR>
Der Nachteil des Spielprinzips ist, da&szlig; einige Zeit dadurch verschwendet
wird, da&szlig; der Spieler seine Daten an den Server schicken mu&szlig;, der die
Daten auswertet und das Ergebnis wieder zur&uuml;ckschickt, aber Freunde von
Spielen, die per Post gespielt werden, sollte das nicht schrecken.
Weitere Features von Tales of Tamar sind gerenderte Animationen, ein
Online Chat-Raum, FTP-Update, ein sehr komplexes Kampfsystem und einiges
mehr. Systemvoraussetzungen von Tales of Tamar sind ein 020-Prozessor,
4 MB RAM, empfohlen werden ein 040-Prozessor und 32 MB RAM. Weiterhin
ben&ouml;tgit man einen AGA- oder Grafikkarten-AMIGA und ein CD-ROM-Laufwerk.
PPC-Support ist ebenfalls geplant.<BR>
Interessant ist auch, da&szlig; es eine PC- und eine AMIGA-Version des Spiels
geben wird, die kompatibel zueinander sind, soda&szlig; einem Spielvergn&uuml;gen
mit vielen Mitspielern nichts im Wege stehen sollte. Geplant ist im
Moment, das Spiel auf der Computer '98-Messe in K&ouml;ln im November
vorzustellen. Weitere Infos gibt es auf der Homepage von Eternity (URL
siehe Bookmarks).<BR>
<BR>
- Ultra Violent Worlds<BR>
<BR>
Ultra Violent Worlds ist ein Shoot Em Up im Stile der Klassiker Xenon 2 und
Battle Squadron. Es stammt von der australischen Softwarefirma Vorlon
Software. UVW war urspr&uuml;nglich als AMIGA-Spiel gedacht, im Laufe der
Entwicklung entschlo&szlig; man sich jedoch dazu, das Spiel f&uuml;r den PC zu
programmieren. Da Vorlon Software die AMIGA-Plattform jedoch am Herzen
liegt, beendete man auch die AMIGA-Version und ver&ouml;ffentlichte sie zusammen
mit der PC-Version auf einer CD-ROM. Das Spiel ist inzwischen erschienen,
die Testversion liegt mir vor, der Test wird demn&auml;chst in AMIGA AGPJ
erscheinen. Ein erster Eindruck l&auml;&szlig;t jedoch vermuten, da&szlig; das Spiel eher
mittelm&auml;&szlig;ig ist.<BR>
<BR>
- Crystal Software<BR>
<BR>
<IMG SRC="img/GilbertGoodmate.jpg" ALT="Screenshot"><BR>
<BR>
Crystal Software hat eine ganze Reihe an Titeln in Vorbereitung. Einer
davon ist Gilbert Goodmate, ein Grafik-Adventure im Stile der Lucasfilm-
Spiele.<BR>
Au&szlig;erdem hat Crystal Software einen Vertrag mit Renaissance Software
abgeschlossen. Renaissance entwickeln derzeitig sage und schreibe 6 Spiele.
Mazza K Racing ist ein 2D-Rennspiel mit &Auml;hnlichkeiten zum Super-Nintendo-Klassiker
Super Mario Kart. Bis zu 4 Spieler k&ouml;nnen gleichzeitig
aus 25 Charakteren w&auml;hlen und auf den bis zu 25 Strecken fahren. 12 Waffen
und 4 verschiedene Rennmodi runden das Spiel ab.<BR>
The Darklore Scriptures wird ein Point'n'click-Horror-Adventure mit viel
Blut und schwarzem Humor.<BR>
9 Lives wird ein weiteres Point'n'Click-Adventure.<BR>
Bei Cherry Elsewhere handelt es sich um ein 3D-Action-Rollenspiel f&uuml;r
PowerPC-Amigas, das als Grundstory voraussetzt, da&szlig; Atlantis niemals
untergegangen ist. Cherry Elsewhere bietet einige interessante Kamerawinkel
und vieles mehr.<BR>
RED ist ein Pseudo-3D-Puzzle/Shoot'em'up mit einem nicht linearen
Spielablauf.<BR>
Empire zu guter letzt ist ein Science Fiction-Spiel mit Anleihen bei
Syndicate.<BR>
<BR>
- Putty Squad<BR>
<BR>
<IMG SRC="img/PuttySquad.jpg" ALT="Screenshot"><BR>
<BR>
Putty Squad sollte bereits 1994 erscheinen, erste Reviews (z.B. CU AMIGA:
94 %; THE ONE: 90 %; AMIGA GAMES 6/96: 72 %) tauchten auf, doch dann
entschlo&szlig; sich System 3 dazu, das Spiel nicht zu ver&ouml;ffentlichen, da der
AMIGA-Markt zu klein geworden war. Das scheinbar fast fertige Spiel lag bis
heute auf Halde, bevor sich Alive Mediasoft entschlo&szlig;, Putty Squad doch
noch zu ver&ouml;ffentlichen. Putty Squad ist der Nachfolger des Spiels Silly
Putty, das bereits mit dem selben Spielprinzip ausgestattet war. Putty
Squad ist ein Jump N Run f&uuml;r AGA-AMIGAs, in dem man ein verformbares,
glibbriges Wesen steuert. Das Spiel wird ca. 45 DM kosten und sollte ab
sofort erh&auml;ltlich sein.<BR>
<BR>
- Virtual Ball Fighters<BR>
<BR>
<IMG SRC="img/VirtualBallFighters.jpg" ALT="Screenshot"><BR>
<BR>
Hurricane Software geh&ouml;ren zu den flei&szlig;igeren AMIGA-Entwicklern. W&auml;hrend
Eat the Whistle demn&auml;chst bei Epic erscheint und au&szlig;erdem am Grafik-
Adventure Escape towards the Unknown gearbeitet wird, wurde bereits der
n&auml;chste Titel von Hurricane angek&uuml;ndigt: Virtual Ball Fighters ist ein
Spiel mit den Grundprinzipien von Tetris. Auch hier fallen Teile von
oben in das Spielfeld, doch mu&szlig; man bei Virtual Ball Fighters Teile mit
gleichen Farben zusammenf&uuml;hren, bevor sie sich aufl&ouml;sen. Die Besonderheit
daran ist der 2 Spieler-Modus, bei dem man gegen einen Gegner antritt und
versucht ihn zu besiegen. Virtual Ball Fighters bietet au&szlig;erdem einen
Grafikkarten-Support, PPC-Support, AHI-Support, ein 5 Minuten langes Intro
und setzt AGA und einen 030-Prozessor voraus. Virtual Ball Fighters wird
au&szlig;erdem f&uuml;r PCs erscheinen.<BR>
<BR>
- Salvage (Homegrown Software)<BR>
<BR>
Bevor das erste von Homegrown Software entwickelte Spiel, Moonbases
erschienen ist, k&uuml;ndigen die Entwickler bereits ihr zweites Projekt an.
Salvage wird ein rundenbasiertes Science-Fiction-Strategiespiel mit, das
&Auml;hnlichkeiten zu UFO: Enemy Unknown aufweist. Salvage wird AGA,
Grafikkarten, AHI und Multiplayerfunktionen unterst&uuml;tzen. Weitere Details
sind noch nicht bekannt.<BR>
<BR>
- Free Jelly Software<BR>
<BR>
Free Jelly Software ist ein neues Entwickler-Team aus Gro&szlig;britannien. Im
Moment arbeiten sie an 2 Spielen.<BR>
Terraces ist ein Fu&szlig;ball-Management-Spiel im Stile von Championship
Manager 2, es wird jedoch spielbarer sein. Weitere Details des Spiels sind
noch nicht an die &Ouml;ffentlichkeit gedrungen. Systemvoraussetzungen sind ein
020-Prozessor, 4 MB RAM und ein 2x-CD-ROM-Laufwerk, empfohlen werden ein
040-Prozessor und 8 MB RAM.<BR>
Das zweite Spiel von Free Jelly Software nennt sich Formula Miggy Racing.
Es ist ein Rennspiel in einer voll &quot;gourade-shaded&quot; Polygon 3D-Umgebung
und soll mit einer sehr guten Geschwindigkeit laufen. F&uuml;r die
Langzeitmotivation sorgen ganze 120 Rennstrecken, die sich in W&uuml;sten,
W&auml;ldern, usw. befinden. Der Spieler hat die Auswahl aus 12 Charakteren, die
Autos, Boote oder Flugzeuge steuern. Mit Hilfe einer Link-Option ist es
m&ouml;glich mit bis zu 12 menschlichen Spielern zu spielen. Systemvoraussetzung
ist ein 030-Prozessor, 8 MB RAM und ein CD-ROM-Laufwerk. Empfohlen werden
ein 040-Prozessor, 16 MB RAM und eine Grafikkarte.<BR>
Beide Spiele verf&uuml;gen &uuml;ber ein neues Soundsystem namens Accu-Speech. Dieses
System sorgt f&uuml;r eine Echtzeit-generierte Sprachausgabe, die nahezu jede
Stimme simulieren k&ouml;nnen soll.<BR>
<BR>
- Networ<BR>
<BR>
<IMG SRC="img/Networ.png" ALT="Screenshot"><BR>
<BR>
Networ ist ein weiteres Echtzeit-Strategiespiel in der langen
Ank&uuml;ndigungsliste dieses Genres. Entwickelt wird es von Atomic Interactive,
da&szlig; aus genau einer Person besteht. Wie auch die anderen Spiele soll auch
Networ nat&uuml;rlich Features beinhalten, die es von allen anderen Titeln
abhebt. Ver&ouml;ffentlicht wird Networ auf CD-ROM mit Support f&uuml;r AGA- und
Grafikkarten-AMIGAs. Da der Autor des Spiels im Moment noch allein an
Networ arbeitet, sucht er Mitarbeiter f&uuml;r den Grafikkarten- und den Story-
und Scenariobereich.<BR>
<BR>
- The Dark Zone<BR>
<BR>
The Dark Zone wird ein neues Action-Rollenspiel, das von Vivid Imagination
entwickelt wird. Angesiedelt ist das Spiel, das sich noch in einer sehr
fr&uuml;hen Entwicklungsphase befindet, in der nahen Zukunft. Der Spieler
steuert 2 Agenten, die eine Entf&uuml;hrung aufdecken m&uuml;ssen. Bei diesen
Ermittlungen geraten die beiden Agenten in eine gro&szlig;e Verschw&ouml;rung. Das
Spiel wird aus einer isometrischen Perspektive, &auml;hnlich wie Syndicate
gespielt. Die komplette Grafik des Spiels wird gerendert. Momentan planen
die Entwickler des Spiels zwei Versionen des Spiels, eine f&uuml;r AGA- und eine
f&uuml;r Grafikkarten-AMIGAs. Au&szlig;erdem sollen optimierte Versionen f&uuml;r 68030-,
68040-, 68060- und PowerPC-Prozessoren erscheinen. Systemvoraussetzungen
sollen ein CD-ROM-Laufwerk, ein 68030/50-Proezessor, 4 MB Fast RAM und AGA
sein. Empfohlen werden ein 68060/50-Prozessor, 8 MB Fast RAM und eine
Grafikkarte. Vivid Imagination suchen noch nach diversen Interessenten, die
in das Projekt einsteigen wollen, unter anderem einen 3D-Grafiker, einen
2D-Grafiker und einen Story-Entwickler. Interessenten schicken eine e-mail
an: <A HREF="mailto:andy@bjuv.mail.teila.com">andy@bjuv.mail.teila.com</A><BR>
<BR>
- Gord<BR>
<BR>
Gord ist ein neues Grafik-Adventure der Entwickler Exotic Software. Im
Moment befindet sich die Entwicklung noch im Anfangsstadium, im Moment
setzt Gord noch ECS voraus, AGA und Grafikkarten-Versionen sollen aber
folgen. Erscheinen wird Gord auf Disketten und CD-ROM. Um die Entwicklung
von Gord zu beschleunigen suchen Exotic Software noch einen Grafiker.
Interessenten melden sich bei: <A HREF="mailto:gord@enti.demon.co.uk">gord@enti.demon.co.uk</A><BR>
<BR>
- FUBAR-Update<BR>
<BR>
FUBAR, entwickelt von Q-Software, ist eine Kriegs-Simulation. Gespielt
werden kann es in zwei verschiedenen Spielmodi, dem Quick-Fire-Modus und
dem Strategie-Modus. Im Quick-Fire-Modus hat der Spieler die Aufgabe,
einige Waffen auszuw&auml;hlen und den Gegner zu besiegen. Im Strategie-Modus
m&uuml;ssen erst St&auml;dte, Fabriken und Armeen aufgebaut werden, bevor in den
Krieg gezogen werden kann. FUBAR bietet &uuml;ber 350 Fahrzeuge und Waffen f&uuml;r
bis zu 16 Spieler, Internet-Support, FMV-Zwischensequenzen.<BR>
Systemvoraussetzungen werden AGA, 030-Prozessor, Fast RAM, 20 MB Platz
auf der Festplatte und ein CD-ROM-Laufwerk. PPC, AHI und Grafikkarten
werden unterst&uuml;tzt. Ein Erscheinungstermin steht noch nicht fest.<BR>
<BR>
- Lambda-Update<BR>
<BR>
<IMG SRC="img/Lambda.jpg" ALT="Screenshot"><BR>
<BR>
Die Entwicklung von Lambda schreitet voran, momentan befindet sich die
Engine des Spiels bei Version 20.81. Zu Testzwecken wurde die Engine nun
f&uuml;r PowerPC-AMIGAs compiliert, was in 70 Frames pro Sekunde auf Cyberstorm
200 Mhz-Rechnern resultierte. Ob der PowerPC-Support erweitert wird, steht
nicht fest.<BR>
<BR>
- Enforce-Update<BR>
<BR>
Enforce wurde seit der Demoversion weiterentwickelt. Neue Features sind
TCP/IP-Support, 3D Stereo-Sound, Virge Support und einiges mehr.<BR>
<BR>
- Sixth Sense Investigations-Patches<BR>
<BR>
Auf der Sixth Sense Investigations-Website (URL siehe Bookmarks) befinden
sich zwei Patches zum Download.<BR>
<BR>
- Samba World Cup-Update<BR>
<BR>
Der von einigen herbei gesehnte Fu&szlig;ball-Manager Samba World Cup von
Sayonara Software ist nun endg&uuml;ltig erschienen (einen ausf&uuml;hrlichen Test
gibt es demn&auml;chst in AMIGA AGPJ). Ein Demo ist jetzt auf der
Sayonara-Homepage erh&auml;ltlich.<BR>
<BR>
- Claws of the Devil-Update<BR>
<BR>
Claws of the Devil, der Tomb Raider-Clone f&uuml;r PowerPC-AMIGAs von Titan
Computer soll nun Weihnachten 1998 oder Januar 1999 erscheinen, Titan's
zweites PPC-Spiel Total Combustion soll im April 1999 fertig sein.<BR>
<BR>
- APC&amp;TCP-Update<BR>
<BR>
APC&amp;TCP hat angek&uuml;ndigt, eine CD-ROM namens Games Attack zu<BR>
ver&ouml;ffentlichen. N&auml;here Infos gibt es bisher nicht. Bereits erschienen sind
Gunbee F-99 (Preview siehe unten), die Flyin' High Daten-Disk 2 und Forest
Dumb Forever.<BR>
<BR>
- Amiga Resident Evil !?!<BR>
<BR>
Im Internet ist eine spielbare Demoversion von Amiga Resident Evil
aufgetaucht. Resident Evil war ein im PC- und Playstation-Bereich sehr
erfolgreiches Spiel. Die (nicht offizielle !!!) Amiga-Version unterscheidet
sich sehr vom Originalspiel. Sie ist weniger Action-orientiert und eher
ein Point'n'Click-Adventure im Stil von Myst. Bis jetzt ist die AMIGA-
Version nicht sehr spektakul&auml;r. Ob sie weiterentwickelt wird, steht in
den Sternen. Wer sich die 3.5 MB gro&szlig;e Datei dennoch herunterladen m&ouml;chte,
kann dies hier tun: <A HREF="http://www.geocities.com/TimesSquare/Arena/1955/" TARGET="_TOP">http://www.geocities.com/TimesSquare/Arena/1955/</A><BR>
<BR>
- Heretic / Hexen-Source Codes<BR>
<BR>
Angeblich sollen demn&auml;chst nach den Sourcecodes von Doom, Descent und
Abuse auch die Sourcen von Heretic und Hexen ver&ouml;ffentlicht werden. Beide
Spiele bieten eine Doom-&auml;hnliche 3D-Engine, soda&szlig; einem Spielvergn&uuml;gen
auf dem AMIGA nicht viel im Wege stehen sollte, jetzt m&uuml;ssen die
Sourcecodes nur noch freigegeben werden...<BR>
<BR>
- Update: Descent / Abuse<BR>
<BR>
Descent I V1.5 r0.57 befindet sich seit Mitte Juli im Aminet
<TABLE CELLPADDING=0 CELLSPACING=0>
<TR><TD><TD VALIGN=TOP>(game/shoot/Descent).
</TABLE><BR>
Abuse 1.3 befindet sich seit Anfang Juli in verschiedenen Versionen f&uuml;r
<TABLE CELLPADDING=0 CELLSPACING=0>
<TR><TD><TD VALIGN=TOP>diverse Prozessoren im Aminet (game/shoot/Abuse...).
</TABLE>
<BR>
- Elite<BR>
<BR>
Der Co-Autor des Spiels Elite hat alle Versionen des Spiels auf seiner
Homepage ( <A HREF="http://people.netcom.co.uk/i.bell/elite" TARGET="_TOP">http://people.netcom.co.uk/i.bell/elite</A> ) zum Download
bereitgestellt. Ob dies die Freigabe als Freeware ist, ist nicht bekannt.<BR>
<BR>
- Exor - The Extreme Ordeal<BR>
<BR>
Exor wird ein sehr komplexes Weltraum-Strategiespiel, das 100 Sterne mit
je 1-6 Planeten bieten wird. Genauere Informationen gibt es noch nicht,
au&szlig;er das es von Duck Productions entwickelt wird, und eine
Ver&ouml;ffentlichung nicht allzu weit in der Zukunft liegt.<BR>
<BR>
- Digital Images will Wipeout 1097 und Tomb Raider 3 f&uuml;r AMIGA umsetzen<BR>
<BR>
Die Entwickler des Spiels Space Station 3000 Digital Images w&uuml;rden gern
die Spiele Wipeout 2097 und Tomb Raider 3 (noch gar nicht erschienen!)
f&uuml;r den AMIGA umsetzen. Deswegen rufen sie alle Interessierten auf,
Psygnosis bzw. Eidos Interactive mit Post zu &uuml;bersch&uuml;tten, in der die
Umsetzung der Spiele gefordert wird. Fraglich ist nicht nur, ob die beiden
Firmen irgendein Interesse an einer Umsetzung haben, sondern ob eine
Umsetzung der beiden Spiele technisch &uuml;berhaupt in einer angemessenen
Qualit&auml;t machbar ist...<BR>
<BR>
- Ger&uuml;chte um Simon the Sorcerer 2 und Die Siedler 2<BR>
<BR>
Verschiedene Ger&uuml;chte um Portierungen der beiden Spiele tauchten immer
weider im Internet auf. Was dran ist... wer wei&szlig;...<BR>
<BR>
- Blade-CD<BR>
<BR>
Das noch nicht sehr alte Rollenspiel Blade wird nun auch auf CD-ROM
ver&ouml;ffentlicht. Die Blade CD-Edition soll bisher nicht ver&ouml;ffentlichtes
Material. wie ein gerendertes Intro enthalten.<BR>
<BR>
<P ALIGN=RIGHT>
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
