<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Test:Amiga Future # 18</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><img src="af2.png">Test: Amiga Future CD # 18<img src="af2.png"></h1></CENTER><p>

Und wieder mal erscheint eine Amiga Future sammt CD. In der Hoffnung, da&#223;
diesemal die CD besser ausf&#228;llt, als das letzte mal, zahle ich meine 19.80
DM und stampfe mit dem Heft nach Hause. Aber hat sich der Kauf &#252;berhaupt
gelohnt?<p>

<h2><u>Die Vollversion:</h2></U>
Als Vollversion liegt dem Mag das 1995 bei Vulcan erschienene &quot;Hillsea
Lido&quot; bei. Bei diesem Game handelt es sich um eine Managersimulation, in der
man versuchen muss, einen Strand mit allem was dazu geh&#246;rt (Eisbuden,
Strandk&#246;rbe etc.) zu managen. Leider ist &quot;Hillsea Lido&quot; alles andere als der
erwartete Kracher, was nicht zuletzt an der miserabelen Grafik liegt. Selbst
&#228;ltere Spiele wie &quot;Theme Park&quot; oder &quot;Ports Of Call&quot; (!) sind &quot;Hillsea Lido&quot;
einen go&#223;en Schritt vorraus; sowohl was Grafik als auch Spielspaﬂ betrifft. Auch die Managersimulation an sich ist alles
andere als langzeitmotivierend; viel zu schnell wird der Spielablauf zu
berechenbar und somit leider auch erm¸dend. Bleibt unter dem Strich eine Vollversion, die eigentlich nur
gestressten Amiga 500 Usern Spa&#223; bringen d&#252;rfte; und selbst da bin ich mir
noch nichtmal sicher....<p><CENTER>
<img src="hill.jpg"></CENTER>
<hr>
<h2><U>Voll, voller, Amiga Future?</h2></U><p>
Da es nat&#252;rlich neben der Vollversion noch andere Archive gibt, ist man ja
mitlerweile gewohnt (w‰re ja auch schlimm, wenn nicht).<p>
<b><u>Demoversionen</B></U> (unterteilt in &quot;Spiele&quot; und &quot;Anwendungen&quot;):<p>
Im Verzeichniss &quot;Spiele&quot; befinden sich mal wieder die altbekannten Demos zu
&quot;Moonbases&quot;, &quot;Napalm&quot;, &quot;Olofight&quot;, &quot;Eat The Whistle&quot; und &quot;Max Ralley&quot;, die
allesamt auch schon auf fr&#252;heren Ausgaben der AF zu finden waren und somit
nichts wirklich interessantes darstellen. Hinzu kommt aber noch eine Demo
zu &quot;Golem&quot;, die aber mit meiner Picasso IV nicht richtig werkelte (oder
waren diese komischen Farbfehler beabsichtigt?). Selbiges gilt auch f&#252;r
die Demo von &quot;Tales From Heaven&quot;, die ebenfalls nicht richtig funktionierte
(zumindest sahen die Screenshots etwas besser aus...). Hinzu kommen noch
&quot;Marbelous2&quot;, &quot;Expansion&quot;, &quot;Racer&quot; und &quot;Enzimas&quot;, die mich allesamt nicht
gerade vom Hocker gehauen haben....<p>

Die Schublade mit den Demoversionen von &quot;Anwendungen&quot; ist diesemal immerhin
besser besetzt, als bei den vorrausgegangenen Ausgaben. Hier finden sich
teilweise sogar recht interessante Sachen, wie z.B. die Demos zu &quot;Cycas1.78&quot;
und &quot;GoldED 5&quot;. Sogar die &quot;Canon Disk&quot; in Version 3.98 ist hier zu finden.
Nat&#252;rlich sind auch wieder einige &#220;berschneidungen mit &#228;lteren Amiga Plus
oder Future CD`s zu finden (Candy Factory, Amiga Writer oder Art Effect
2.6), aber immerhin hat auch das neueste APC &amp; TCP Produkt &quot;Samplitude Opus&quot;
seinen Weg als Demo auf die CD gefunden. Das wahre Highlight dieses Ordners
bildet aber die Demo von &quot;QNX&quot;, dem neuen NG Amiga OS. F&#252;r das starten vom
selbigem ist zwar ein PC n&#246;tig, aber mich hat das Demo (passt auf
eine normale PC HD Disk!) im Grunde begeistert, auch wenn vom Amiga OS
nichts mehr &#252;brig ist...<p>
<hr>
<b><u>PD</B></U> (ebenfalls in &quot;Spiele&quot; und &quot;Anwendungen&quot; unterteilt):<p>
Im Bereich der &quot;Spiele&quot; tummeln sich mal wieder zahlreiche Aminet Games mit
dementsprechend guter bzw. m&#228;&#223;iger Qualit&#228;t. Herausragende Games waren neben
&quot;Soliton&quot; (Test von Genius in einer der letzten Ausgaben) und &quot;FreeCell&quot; vor
allem das nette Plattform Game &quot;FaYoh 2&quot;. Dazu kommen noch einige weitere
interessante Games wie &quot;Wolf Pac&quot; (3 D Pacman; mit PPC Unterst&#252;tzung),
ADescent (Portierung von Descent; hok Files der Version 1.5 ben&#246;tigt) und
&quot;Schlachtfeld&quot;. Ansonsten fanden sich nat&#252;rlich auch wieder einige Ausf&#228;lle
bzw. Games, die sich komplett weigerten, mit meinem System
zusammenzuarbeiten und einen Guru verursachten... <p>

Die Anwendungen standen dieses mal ganz im Zeichen der Emulatoren: Neben der
neuen Version des Mac Emulators &quot;ShapeShifter&quot; (3.10), gaben sich auch
&quot;CoolNES&quot;, &quot;TrueReality&quot; (N64 Emulator!), &quot;ANes&quot;, &quot;vmac&quot;, &quot;AmiTRS80&quot; und
&quot;CBSpeccy&quot; die Ehre; also alles, was das Emulatorherz begehrt. Abgerundet
wird das Verzeichniss von altbekannten Tools wie &quot;AHI&quot;, &quot;PhotoAlbum&quot; oder
auch &quot;CyberShow&quot;. Erw&#228;hnenswert sind daneben auch noch der neue 3D Standard
&quot;Warp 3D&quot; und ein Update f&#252;r die Schnittstellenkarte &quot;IOBlix&quot;, was man
ebenfalls in diesem Ordner finden kann. <p>
<hr>
<b><U>Multimedia</B></U> (unterteilt in &quot;Bilder&quot;, &quot;Musik&quot;, &quot;Demos&quot; und &quot;Screenshots&quot;):<p>
Auf den ersten Blick f&#228;llt sofort aus, da&#223; die mit der letzten Ausgabe
eingef&#252;hrten Icon Sammlungen wieder fehlen; somit ist die CD wieder um ein
herausragendes Feature &#228;rmer.<br>
Na ja, bei den Bildern und bei der Musik
schien mal wieder der Gedanke &quot;Klasse=Masse&quot; mitgespielt zu haben; anders
kann ich mir die &#228;u&#223;erst lieblose Zusammenstellung n&#228;mlich nicht erkl&#228;ren.
Bei den Demos hingegen war Sparsammkeit angesagt: Lediglich zwei (!) Demos
schafften es auf die CD (&quot;Everything Dies&quot; und &quot;Mime&quot;). Auch wenn die
Qualit&#228;t gar nicht mal &#252;bel ist, h&#228;tten mehrere Vertreter dieses Genres der
CD sicherlich nicht geschadet. Last but not least w&#228;ren da noch die
Screenshots, die zwar f&#252;r den einen oder anderen Artikelschreiber hilfreich
sein k&#246;nnten, ansonsten aber wohl eher den Grundgedanken des F&#252;llmaterials
erf&#252;llen... <p>
<hr>
<b><U>Patch:</B></U><p>
Leider finden sich in dem 8 Schubladen enthaltenden Verzeichniss auch wieder
altbekannte Vertreter, so z.B. die neue &quot;SetPatch&quot; Version, der HD
Installer f&#252;r &quot;The Chaos Engine&quot; und ein Patch f&#252;r das Adventure &quot;Myst&quot;.
Dazu kommt noch ein Update f&#252;r &quot;Eat The Whistle&quot; und f&#252;r &quot;Wet&quot;. Abgerundet
wird das ganze von den Add-ons zu Genetic Species (deutsche &amp; englische
Version)  und einem HD Installer zu MadTV (das k&#252;rzlich erst der Amiga
Future beilag und somit keinen HD Installer mehr ben&#246;tigt...). Alles in
allem auch nichts wirklich dolles dabei...<p>
<hr>
<b><u>Forum:</U></B><p>
Wenigstens das Forum ist diesesmal besser gef&#252;llt; glatte 16 Eintr&#228;ge
(immerhin das dreifache der letzten Ausgabe) finden sich hier. Darunter
sogar die NC Ausgaben 55-61 f&#252;r Nichtmitglieder; da hat der Andreas doch
ganze Arbeit geleistet. Auch das bekannte Diskmag &quot;Amiga4ever&quot; kann man
hier wiederfinden. Die restlichen Beitr&#228;ge m&#246;chte ich eigentlich nicht
weiter bewerten, da dies relativ unangemessen w&#228;re.
 Warum man allerdings das in der letzten Ausgabe
eingef&#252;hrte &quot;HTML Forum&quot; wieder herausnahm, kann ich ebenfalls nicht
verstehen (war es doch immerhin einer der wenigen guten
Ans&#228;tze...).<p><CENTER>
<img src="af1.png"></CENTER>
<hr>
<B><U>Fazit:</B></U><p>
Tja, meiner Meinung nach ist diese Ausgabe noch d&#252;rftiger als die
vorrausgegangene. Waren bei Ausgabe # 17 immerhin noch postive Ans&#228;tze zu
verzeichnen (HTML Forum und Iconsammlungen), ist davon bei der aktuellen
CD nichts mehr zu merken. Negativ fiel auch noch auf, daﬂ die Future CD`s
wohl so schlecht gepresst sind, daﬂ schnellere CD Laufwerke (ich habe ein 36
X) st‰ndig am rattern und was weiﬂ ich nicht sind. 
 Insgesamt dr&#228;ngte sich mir mal wieder der
Eindruck nach einer lieblos zusammengestellten CD auf, die eigentlich
niemand braucht. Eine halbwegs vern&#252;nftige Vollversion h&#228;tte zwar noch
einiges rausrei&#223;en k&#246;nnen, aber in der vorliegenden Form ist die CD auf
keinen Fall 10 DM wert und rechtfertigt auf keinen Fall den hohen Preis von
19.80 DM (mit Heft, das zugegebenerma&#223;en richtig gut geworden ist).
Sorry, aber das ist halt mein Eindruck!<p>

<CENTER>
<TABLE BORDER="0" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>IPC Verlag</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>19.80 DM (mit Heft)</TD>
</TR>
<TR>
<TD>Inhalt</TD>
<TD>Demoversionen, Bilder, PD, Musik</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>605</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>15 %</TD>
</TR>
</TABLE>
<p>
<br>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
<HR>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
