<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>WolfZ</title>
</head>

<body background="wol1.jpg" text=black link=blue alink=red bgcolor=gray>
<a name="top"></a>
<p>
<center><font color="#000080" size="7"><b>Wolf's Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a1"><b>f&uuml;r Markus Thomaschewski</a></b></li>
<li><a href="#a2"><b>f&uuml;r Annemarie Kohlm&uuml;ller</a></b></li>
</ul>
<br>

<h3><a name="a1">Gr&uuml;&szlig; Dich Markus</h3> <p> Manchmal, glaube ich,
k&ouml;nnte ich den Eindruck gewinnen, dass Du Gelesenes absichtlich falsch
interpretierst, damit Du etwas Negatives loswerden kannst. Wenn ich schreibe:
&quot;sind in den L&auml;den in Regalen zu bewundern&quot;, heisst dies doch
ganz einwandfrei, dass der erste erwerbbare Produktionsanteil schon weg ist und
der Adhoc-Bedarf abgedeckt wurde. Weiterhin bezog sich mein Artikel auf die
Gruppe der NoCoverleser, also roundabout Jugentliche, die nicht so mal auf die
Schnelle den notwendigen Kaufpreis hinbl&auml;ttern k&ouml;nnen. Weiterhin habe
ich auch mich hier mit eingeschlossen und durchblicken lassen, dass ich nicht
wieder zu denen geh&ouml;ren werde, die sofort kaufen. F&uuml;r meinen 3000er
habe ich 1991 ca. 5000,- DM bezahlt und f&uuml;r den etwas aufger&uuml;steten
4000er 1994 4000,- DM. Wenn Du bei diesen beiden Ger&auml;ten den Preisverfall
nach zwei Jahren gesehen h&auml;ttest, w&uuml;rdest Du meine Zeilen ganz anders
lesen, als nur nach einer Schwachstelle zum L&auml;stern zu suchen.</p>

<p>Auf den anderen Schwachsinn werde ich nicht eingehen, denn diese
Unterstellungen grenzen schon bald an Beleidigung. Da hilft nicht, einfach
voranzustellen, &quot;Du bist doch nicht b&ouml;se?&quot; oder so &auml;hnlich.
Wenn Du einmal soviele Pokale, Bestpreise und Orden wie ich vorweisen kannst,
die sich auf Geisteswissen und nicht auf Muskelkraft beziehen, dann darfst Du zu
mir sagen, ich schreibe ohne nachzudenken. Aber vorher nicht.</p>

<p>Deinen Schreibstil mit provokativem Denken zu umschreiben ist beinahe schon
Sch&ouml;nf&auml;rberei. Ich benutze eigentlich andere Ausdr&uuml;cke
hierf&uuml;r. Ich finde es nicht oportun, ja eigentlich schon geschmacklos, als
Angriffspunkte mit Vorliebe die &auml;ltere Generation heranzuziehen. Ich
wei&szlig;, dass ich nicht mehr Uptodate bin, schlie&szlig;lich gehe ich nun
schon auf die sechzig zu. Und das Aufeinander losgehen und verbal verhauen,
davor hatten wir in der NoCover nun &uuml;ber zwei Jahre Ruhe. Hiermit habe ich
Dir nun meine Meinung gesagt und ich werde mich nicht mehr weiter dazu
&auml;u&szlig;ern.</p>

<p>Aber ich kann auch l&auml;stern. Vor beinahe 30 NoCover Nummern hatte ich
einmal bei einem R&auml;tsel bei Dir gewonnen. Wenn mein Ged&auml;chtnis mich
nicht im Stich l&auml;sst, war dies ein Halbjahres Abo von Zockerz Paradize oder
t&auml;usche ich mich da? Obwohl ich Dir damals anriet, bei Fastfood
weiterzumachen, habe ich von Dir bis auf diese jetzigen Zeilen nichts mehr
geh&ouml;rt. Damals hattest Du meinen Namen noch richtig geschrieben.</p>

<hr>

<h3><a name="a2">Gr&uuml;&szlig; Dich Annemarie</h3>

<p>Dieser Artikel &uuml;ber den Wassertropfen wurde in einer dritten Klasse
Grundschule als &Uuml;bung einer Nacherz&auml;hlung genutzt und am n&auml;chsten Tag
war dies Gegenstand des Sachunterrichts. Deshalb durften in diesem Artikel nur
W&ouml;rter auftauchen, die in der Klasse mindestens schon einmal vorgekommen
und somit nicht fremd waren. Ein weiteres sehr wichtiges Kriterium ist die
L&auml;nge einer Geschichte, die zur inhaltlichen Abarbeit herangezogen wird.
Die Erfahrung zeigt, dass bei 9-J&auml;hrigen die Schallgrenze bei ca. 350
W&ouml;rtern liegt. Des Weiteren ist Technik und Natur kindgerecht zu
erz&auml;hlen ohne die Details zu verniedlichen oder sogar zu verf&auml;lschen.
Das Problem der Wasserressourcen wurde und wird noch in anderen
Arbeitsbl&auml;ttern bearbeitet.</p>

<p>Das Thema Wasser begleitet diese Klasse nun schon seit dem Winter und soll
bis zu den Sommerferien abgeschlossen sein. Eines habe ich ganz fest
vorgenommen, eine globale Zusammenfassung wie seinerzeit bei dem Thema
&quot;Wald&quot; mache ich nicht mehr.</p>

<p>Alles Gute bis zum n&auml;chsten Mal!</p>

<hr>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
</td></tr>
</table>
<br>
</body>
</html>
