<HTML>
<HEAD>
<TITLE>APC & TCP</TITLE>
</HEAD>
<BODY TEXT=black link=blue alink=red "background="l_bg.gif"">
<CENTER>
<P><H2>Leserbriefe:</H2></P>
</CENTER>
<P>

Hallo u. gr&uuml;&szlig; Gott !

Ich habe hier ein paar Zeilen,

<Li><A href="#1.html">1. f&uuml;r den doch noch reagierenden Kilian Servais</A></Li>
<Li><A href="#2.html">2. f&uuml;r den guten "The Saint" - betreffend Hintergr&uuml;nde reagierenden</A></Li>
<Li><A href="#3.html">3. f&uuml;r den der es auch mit den Hintergr&uuml;nden hat Ricky W. </A></Li>
<Li><A href="#4.html">4. f&uuml;r den sehr aufmerksamen Wolf Zimmer</A></Li>
<Li><A href="#5.html">5. f&uuml;r den der den Titel gewählt hat "fEEDBACK^dISKUSSiONEN^COMMENtS"</A></Li>
<Li><A href="#6.html">6. f&uuml;r den der um Meinung zum Nato-Denkmal bittet</A></Li>

<A name="1.html">
<H3> 1. Hallo Kilian !</H3><P>
<P>
M&ouml;chte mich hiermit auch bei Dir entschuldigen, da&szlig; ich eine falsche NC
angegeben habe. Aber Du hast meinen Artikel ja gefunden und reagiert.
daf&uuml;r gilt Dir mein Dank !<P>
Tja, so ist das, vielleicht habe ich mich wieder einmal nicht klar
genug ausgedr&uuml;ckt. Mich wundert doch nur, da&szlig; auf der Homepage der
AMIGA+ soviele private Homepages zu finden sind und davon nur ein
Bruchteil APC&TCP-Club-Mitglieder. Denn ich denke, wenn auch dort
(wo es doch kostenlos ist) viele Club-Mitglieder vertreten sind,
dann w&uuml;rde unser Club auch weiterhin noch wachsen, oder ?<P>
<P>
Nun zu meiner eigenen:<P>
Ich habe mich immer noch nicht entschieden, wohin und ob ich es überhaupt 
machen soll. Hatte zuerst viel Elan, aber da ich nicht wei&szlig; wohin, ist er
mir vergangen. Denn so viel ich wei&szlig;, mu&szlig; sie ja auch gepflegt werden
und da haben wir dann wieder ein Problem, wie macht man das.
Ich denke, ich werde weiter mit meiner Homepage den Browser starten und
weiterhin abwarten, wie sich alles entwickelt.
<P>
Dann:<P>
Schade, ich h&auml;tte Dir gerne per E-Mail einige Fragen gestellt, aber
in der Mitgliederliste ist keine E-Mail-Adresse und in den beiden
Texten "Leserbrief" und "Tools-Shape-Shifter" ebenfalls nicht.
Obwohl Du schreibst, da&szlig; Du ab und zu im Internet bist. Wie ist das
m&ouml;glich und dann keine E-Mail-Adresse ? Merkw&uuml;rdig !
<P>
Dann habe ich Deinen Leserbrief in der Hinsicht korrigiert, da&szlig; Du
bei  "mir" im HTML-Text das ".html" vergessen hattest. Ist ja nicht
gravierend, wenn man sooooviiiieeel Text für die NC schreibt.
Aber ansonsten finde ich alles schon sehr ausgereift mit 19 Jahren.
Toll !<BR>
Wie mir scheint hast Du schon einen Computer in die Wiege gelegt
bekommen. Oder ?
<P>
Nun zu den Fragen !<BR>
Ich m&ouml;chte diese "dummen" Fragen nicht ver&ouml;ffentlich wissen und daher
lasse ich es.
Vielleicht mal als Brief, wenn Du wirklich keine E-Mail-Adresse hast.
<P>
Tschau !<P>
<P>
R.Nue. aus Wue.<BR>
<HR>

<P>
<A name="2.html">
<H3> 2. Kommentar zu Deinen "Beschwerden", lieber Markus !  </H3><BR>
<P>
Ich habe mir zwar nicht mehr die M&uuml;he gemacht, alle Deine Artikel durchzulesen,
um Dir aufzuzeigen, wo es mit den Hintergr&uuml;nden hapert, aber es mu&szlig;ten
ein paar gewesen sein, sonst h&auml;tte ich nicht reagiert.
Jedenfalls hast Du jetzt reagiert und der Leserbrief mit dem Ringordner gefällt mir
ganz gut. Auch die Schrift ist in Ordnung, man kann sie jedenfalls gut lesen.
Also nichts f&uuml;r ungut. Danke !
<P>
R.Nue.aus Wue.<BR>
<HR>

<P>
<A name="3.html">
<H3> 3. Ricky W. und das in "gr&uuml;n" und dann auch noch die Schrift in "gr&uumln" !</H3><BR>
<P>
Bitte lies mal den Text an den guten "The Saint", dann wei&szlig;t Du worauf ich hinaus
will. Ein wenig nachdenken schadet beim "kreieren" (sprich "layouten") nicht. Es war
unmöglich Deinen Text zu lesen. Schade ! Denke beim n&auml;chsten Mal dran.
Versprich Besserung, bitte !
<P>
R.Nue. aus Wue.<BR>
<HR>

<P>
<A name="4.html">
<H3>4. Hallo Wolf ! </H3><BR>
<P>
Wie bereits per E-Mail geantwortet: Ich habe Deine Tips zur Kenntnis genommen und
wie Du siehst jetzt auch entsprechend eingebaut. Danke !<br>
&Uuml;brigens, wo bleibt die Antwort auf meine Fragen in der Mail vom 5.5.99 ?
--<BR>
Dann möchte ich Dich noch fragen, was hast Du an Deinem "Update" zum NC-Guide
geändert ?  Ich habe sie mir am 18.5. von Deiner Homepage gesaugt und festgestellt,
da&szlig; ich sämtliche Daten schon hatte, nach dem entpacken. Du schreibst doch,
da&szlig; Du sie aufgemöbelt hast ?
&Uuml;brigens finde ich die Farben Deiner Homepage sehr schön. Ich habe mich nur
gewundert, da&szlig; so wenig Besucher sich bei Dir verewigen. Hat denn keiner
Interesse an Deiner mühseligen Arbeit mit NC-Guide ? Es ist doch wirklich sehr
praktisch, gleich zu wissen wer, wann welchen Artikel geschrieben hat. Merkw&uuml;rdig!
<P>
R.Nue.aus Wue.<BR>
<HR>

<P>
<A name="5.html">
<H3>5. Tja, wer war derjenige welcher ! </H3><BR>
<P>
Derjenige hat sich nämlich gefragt "Fragt sich nur was" !
<P>
Habe ich mich eigentlich so unpr&auml;szise ausgedr&uuml;ckt, oder habe ich einen so
unverst&auml;ndlichen Schreibstil, da&szlig; so wenige mit meinem Artikel "Meinung"
in der "NC-60", in der Rubrik "Small Talk" etwas anfangen konnten ?<BR>
Ich will doch nur Eure Meinung dazu, wo man seine st&uuml;mperhaften Versuche,
einer eigenen Homepage, am besten installieren sollte ?
Die anderen Zeilen darumherum waren nur der Versuch zu einer Erkenntnis zu kommen,
wieso der größte AMIGA-Club Deutschland`s so wenig Mitglieder-Homepages auf der AMIGA+-Seite
hat. Nun denn, irgendwann wird sich sicher auch das erkl&auml;ren lassen.<BR>
<P>
Derjenige welcher, m&ouml;ge sich bitte mal bei mir melden zum Gedankenaustausch !
Bis denne dann !<BR>
<P>
R.Nue.aus Wue.<BR>
<HR>

<P>
<A name="6..html">
<h3> 6. Meinung zum NATO-Denkmal ! </H3><BR>
<P>
Lieber "Sax", Du fragst nach unserer Meinung zu diesem Denkmal ! Es ist zwar sehr
ungew&ouml;nlich, daß ein noch nicht 18-j&auml;hriger so eine Frage in den Raum stellt,
aber ich finde sie (die Frage) gar nicht so verkehrt. Du hast v&ouml;llig recht, dies
Ding dr&uuml;ckt f&uuml;r mich auch eine sehr d&uuml;stere Grundstimmung aus. Aber so
ist es, die NATO, wie mir scheint ist keine friedenschaffende Institution sondern eine
die auf kriegstreiberei aus ist, damit die Produktion der Kriegswaffen wieder anlaufen
kann und wieder mehr Menschen in den westlichen Ländern zu Arbeit und Brot kommen.<BR>
Das ist meine Meinung !<BR>
<P>
R.Nue.aus Wue.
<HR>
von: &#160;<a href="Mitglieder/nuenninghoff.html">Rolf Nue. aus Wue.</a><br>
E-Mail:<a href="mailto:093113563-0001@t-online.de">
0931136563-0001@t-online.de</a><p>

</P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="klein_hauptinhalt.jpg" width=320
height=58></A>
</CENTER>
</P>
</BODY>
</HTML>
