<html>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=green alink=red>

                <h1><CENTER>  Leserbrief von Kilian "The Bruce"
Servais</h1></CENTER><P>
<ul>
<li> <a href="#dr.html">An den &quot;swappenden&quot; dR.</A><br>
<li> <a href="#thowin.html">An den flei&#223;igen Schreiber
Thowin</A><BR>
<li> <a href="#wolf.html"> An den &quot;up to date&quot; seienden Wolf Zimmer</A><BR>
<li> <a href="#weber.html">An den Grafikkarten suchenden Thomas
Weber</A><BR>
<LI> <a href="#sax.html">An den feedbackenden Sax</A><BR>
<li> <a href="#saint.html">An den Diskletter schreibenden Saint</A><BR>
<li> <a href="#lars.html">An den PNG Ablehner Lars Philipsen</A><BR>
<li> <a href="#ricky.html">An den Schweizer Jung Ricky W</A><BR>
<li> <a href="#yonder.html">An den CD schickenden Yonder </A><BR>
<li> <a href="#top.html">Meine Top5</A><p></UL>
<hr>
<a name="dr.html">
<b>An dR.:</B><P>
Tach auch! Erstmal thanx f&#252;r Dein Lob bezgl. meiner Metal Corner in der
letzten NC. Zwar wei&#223; ich nicht, wie Du darauf kommst, da&#223; ich n&#246;rdlich der
Antarktis wohne, aber auch egal.<br>
Von Hardcore halte ich nicht alzu viel; ich stehe da mehr auf Power / Melodic Metal
und guten (Hard) Rock (Queen, Meat Loaf, Genesis). Progressive ist auch noch voll
ok, aber Hardcore ist nicht ganz so mein Ding. dazu muss ich aber auch
sagen, da&#223; ich keine Bank in Sachen Hardcore bin, sprich, ich kenne mich in
dem Sektor nur sehr ungen&#252;gend aus...<br>
&#196;h, was hei&#223;t denn jetzt &quot;Tapes swappen&quot;? Sorry, aber das sagt mir nun
absolut gar nix... :-(( Wenn Du allerdings Material suchst, kann ich Dir
nat&#252;rlich gerne mal was auf Tape kopieren; musst mir nur sagen was Du haben
willst bzw. welche CD`s Du so besitzt. Wahrscheinlich entspricht das dem
&quot;Tapes swappen&quot; ohnehin:-))<br>
Deine Richtigstellung zum Thema &quot;Metal&quot; in Deiner Feedback Corner fand ich
auch gut; bin auch in meinen Leserbriefen da schon drauf eingegangen,
da mir das etwas zu krass war... <br>
Dein Apocalyptica Special fand ich auch recht geil gemacht; sowohl inhatlich
als auch vom Layout her. Wie darf man eigentlich den Satz &quot;Gib Posern keine
Chance&quot; verstehen? Auf dem Manowar Trip? Oder geht Dir der ganze &quot;True
Metal&quot; auf den Zeiger?<br>
Eigentlich wollte ich mich ja per Post melden, aber ich musste die letzten
Wochen noch einige sehr wichtige Klausuren schreiben, so daß ich dafür keine
Zeit hatte... sorry!<br>
See, ya!<p>

P.S.: Rage kommen &#252;brigens hier aus Herne...<p>
<hr>
<a name="thowin.html">
<b>An Thowin:</B><p>
Moin! Wenn Du was zur Metal Corner beisteuern willst, kannst Du das
nat&#252;rlich gerne tun; n&#246;tig ist es aber wirklich nicht. Ich hatte bisher
nicht vor, gro&#223;artig &quot;Fremdschreiber&quot; einzusetzen, aber Du kannst nat&#252;rlich
gerne was schreiben. Aber da Du ja auch im Stre&#223; stecken d&#252;rftest (so wie
ich...), solltest Du Deine Power erstmal in die STP investieren; so wichtig
ist die Metal Corner nun auch wieder nicht. Nicht das ich Dich jetzt
vergrault habe....<br>
Was das &quot;The&quot; vor meinem Pseudo soll? Na ja, erstens finde ich, da&#223; es sich
besser anh&#246;rt und zweitens haben Grave Digger mal einen Song geschrieben,
der auch &quot;The Bruce&quot; hie&#223;; in Anlehnung an den gro&#223;en schottischen
Freiheitsk&#228;mpfer &quot;The Bruce&quot;. Aus diesem Grunde habe ich mich f&#252;r das &quot;The&quot;
entschieden. Ein genauer Text dazu steht auch im Small Talk...<br>
Die Screenshots habe ich mit &quot;GrabIFF&quot; aus dem Aminet gemacht, da&#223; zwar auch
nicht bei jedem Spiel funktioniert, aber bei Napalm keine Probleme
bereitete.<br>
Und noch was zur &quot;Winbench 98&quot;: Die CD war teilweise gar nicht &#252;bel, aber
eben nur teilweise. Durch einige gute Sachen konnte sich die CD nochmal so
gerade retten, so da&#223; 60 % wohl in Ordnung gehen, auch wenn es immer der
individuelle Geschmack ist, der entscheidet.<br>
Was die Grafiken angeht: Die sind nicht von mir, sondern von einem Kollegen,
der so g&#252;tig war, diese f&#252;r mich zu erstellen (thanx Ronald). Ich will mich
hier ja auch nicht mit fremden Federn schm&#252;cken....<br>
So, mach`s mal gut!
<hr>
<a name="wolf.html">
<b>An Wolf:</B><P>
Gr&#252;&#223; Dich! Ich wollte eigentlich nur auf Deinen letzten Leserbrief
an mich eingehen. Die Lobworte meinerseits fand ich angebracht und ich f&#228;nde
es sehr schade, wenn Du nicht mehr f&#252;r die NC schreiben w&#252;rdest (wie Du es
in dem Leserbrief an Markus in der letzten NC angek&#252;ndigt hast). Ich kann
nur wiederholen, da&#223; Dein Schreibstil nicht antiquitiert ist; ich w&#252;rde ihn
eher als niveauvoll bezeichnen. Sollte dieser einige Leute &#252;berfordern, ist
es ja nicht Dein Fehler :-))<br>
Sch&#246;n, da&#223; Dir meine CD Tests gefallen haben. Sollte es m&#246;glich sein, werde
ich demn&#228;chst noch weitere folgen lassen, aber das h&#228;ngt von vielen Faktoren
ab ;-)) <br>
Eine Picasso IV habe ich bei mir in Betrieb, aber so viele Gurus hat es gar
nicht gegeben; lediglich die A+ CD`s sind ab und an die Ursache f&#252;r einige
Neustarts, aber da kann ich nun nicht sagen, ob das an mir oder der Picasso
IV liegt. Frust hat sich auf jeden Fall noch nicht breitgemacht, so da&#223; ich
sicherlich noch einige Zeit am Ball bleiben werde.<br>
Wie ich gerade sehe, hasst Du auch eine Picasso IV bei Dir in Betrieb; hasst
Du evtl. einige Tips f&#252;r mich zur Picasso IV bereit?
Mach`s mal gut!<P>
<hr>
<a name="weber.html">
<b>An Thomas Weber:</B><p>
Moin!
Hey, Deine Story von Oberland war auch nicht &#252;bel. Ziemlich dumm gelaufen,
was? Na ja, in Zukunft werde ich wohl alles selber machen m&#252;ssen. Nicht
auszudenken, welchen Aufwand es erst bei einem PPC Board geben w&#252;rde....
Du suchst eine GraKa? Moment, ich schau mal kurz nach Deiner Konfig; also
einen 1200er. Ohne Zorro schaut das ganze zwar etwas d&#252;ster aus, aber fangen
wir mal vorne an:<br>
Da w&#228;re zum einen die Pixel64; eine GraKa speziell f&#252;r den 1200er. Daf&#252;r
br&#228;uchtest Du dann einmal den Ateo Bus und nat&#252;rlich die Pixel64, was ca.700
DM kosten w&#252;rde. Ein entsprechender Tower w&#228;re auch nicht &#252;bel, so da&#223; Du
damit bei 1000 DM w&#228;rst.<br>
Zu anderen w&#228;re da die M&#246;glichkeit, da&#223; Du Dir einen Tower (Infinitiv 2, RBM
Towerhawk oder Winner) holst und da ein Zorro Board (nach M&#246;glichkeit Zorro III) reinpackst. Das w&#252;rde dann
ohne entsprechende GraKa auch 1000 DM kosten. Bei Zorro III k&#246;nntest Du
immerhin zwischen Picasso IV (&#252;ber die ich nur gutes berichten kann) und
Cybervision64/3D w&#228;hlen (die ja jetzt von DCE neu aufgelegt wird). Ich w&#252;rde
Dir zur Picasso IV raten, da dieses Teil wirklich genial ist; leider auch im
Preis (600 DM). Und nat&#252;rlich brauchts Du noch einen neuen Monitor (der ab
31 KhZ synchronisiert), der auch nochmal Geld kostet. Die L&#246;sung mit Picasso IV
w&#252;rde also ca. 2000 DM kosten, was immerhin ein ganz sch&#246;ner Batzen Geld
ist. Alternativ w&#228;re da noch die PPC Version; sprich PPC Karte samt BVision.
Da aber auch diese L&#246;sung nur Sinn mit Tower macht (allerdings ohne Zorro
Board), kommst Du auch nicht unter 2000 DM weg (mit etwas Gl&#252;ck vielleicht
mit 1500 DM). Na ja, ich wei&#223; jetzt nicht, ob Dir die Infos geholfen haben,
aber eine GraKa ist nunmal so eine Sache. Solltest Du noch Fragen haben,
stehe ich nat&#252;rlich jederzeit zur Verf&#252;gung. Bis denne....<br>
<hr>
<a name="sax.html">
<b>An Sax:</B><P>
Was meine beiden Napalm Screenshots angeht: Eine Bestechung beim Andreas
kann da Wunder wirken (einfach einen 10 DM Schein beilegen... hehehe ;-)).
Mein Napalm Test war der beste? Im Grunde fand ich Deinen besser als
meinen, aber da ist wohl Objektivit&#228;t gefragt. Es ist immer &#228;u&#223;erst schwer,
eigene Artikel mit denen von anderen Leuten zu vergleichen. Und nochwas:
Irgendwie komisch, da&#223; wir immer &#228;hnliche Artikel bringen, oder? Erst der
Monitor Test (Belinea) von uns beiden, dann der Napalm Test und in Ausgabe
63 dann auch noch Napalm Tricks von uns beiden. Jetzt wei&#223; ich endlich, wer mir immer
hinterher spioniert ;-))))<br>
Meine CD Sammlung w&#228;chst von Woche zu Woche und es vergeht selten ein Monat,
wo ich nicht mindestens zwei neue CD`s kaufe. Dazu kommen nat&#252;rlich noch
&#228;ltere, die aber bisher eher selten in der Metal Corner zu finden waren;
eben Klassiker. Das daf&#252;r einiges an Geld draufgeht, merke ich von Woche zu Woche, aber
so ein Nebenjob ist ja auch was sch&#246;nes ;-)) Inzwischen haben sich knapp
300 Metal und Rock CD`s hier angesammelt, so da&#223; ich erstmal noch 150 Metal
Corners mit &quot;Klassikern&quot; f&#252;llen k&#246;nnte :-))) Wenn Du auf der Suche nach
bestimmten Material bist, kannst Du ja einfach mal nachfragen...<br>
Ach ja: Der Yonder schlug mir vor, da&#223; ich mich auchmal an Game Previews
versuche. F&#252;r die aktuelle Ausgabe habe ich mir mal Deine Layout mehr oder
minder geliehen (nat&#252;rlich anderer Background); ich hoffe mal, da&#223; das so in
Ordnung ist? Wenn nicht musst Du nur kurz bescheid sagen und ich &#228;ndere den
Krams wieder ab.<br>
Man lie&#223;t sich...
<hr>
<a name="saint.html">
<b>An Saint:</B><P>
Greetings! Mitlerweile m&#252;sste ich mich zwar schon wieder bei Dir gemeldet
haben, aber auch auf diesem Wege ein Dankesch&#246;n f&#252;r Deinen Diskletter und
Deine Reaktion/Anregung auf mein Feedback aus NC 63. Ich denke mal, alles
andere habe ich schon per S-Mail gesagt, so da&#223; hier einfach mal mit einem
freundlichen Gru&#223; meinerseits beende...<p>
<hr>
<a name="lars.html"> 
<b>An Lars:</B><P>
Sch&#246;n, da&#223; man von Dir mal wieder was h&#246;rt. Interessant fand ich Deinen
Beitrag zum Thema PNG Dateien, da ich selber meine Artikel nie auf dem PC
teste. Und da ich regelm&#228;&#223;ig PNG Dateien benutze, wollte ich mal testen, was
da dran ist. Bei einem Kollegen habe ich das dann mal ausprobiert und es
klappte ohne Probleme; ob es an einer neueren Version oder einem einfachen
Plug-in lag, kann ich Dir nicht sagen. Na ja, demn&#228;chst werde ich dann mal
meine Grafiken in JPG speichern...<br>
Auf jeden Fall fand ich es gut von Dir, da&#223; Du auf das Problem hingewiesen
hast, anstatt alles unter den Tisch zu kehren!<br>
Genial fand ich auch Deine Einf&#252;hrung der &quot;Astro Corner&quot;! Mach auf jeden
Fall weiter damit; dann haben wir in der NC wieder eine neue &amp; gute Rubrik!<br>
Bis demn&#228;chst mal...
<hr>
<a name="ricky.html">
<b>An Ricky W.:</B><P>
Hey, schade, da&#223; Du Dir jetzt einen PC gekauft hast; genau damit f&#228;ngt es
n&#228;mlich immer an. Erst will man seinen Amiga weiterbenutzen, aber nach einem
halben Jahr gibt man dann eine Kleinazeige auf und vertickt seine
&quot;Freundin&quot;. Tja, so ist das halt...<br>
Ach ja, wenn Du demn&#228;chst nochmal was f&#252;r die NC schreibst (was ich hoffe!),
dann benutze bitte eine andere Farbe f&#252;r den Font. Bei mir war das ganze
unter IBrowse in 800 X 600 in 16 bit nur sehr schwer zu lesen. Nur so `ne
Anregung meinerseits, lass es Dir mal gutgehen.<br>
<hr>
<a name="yonder.html">
<b>An Yonder:</B><P>
Man, da&#223; mit den CD`s ging ja wirklich sauschnell; thanx a lot!! MacOS 7.5
ist wirklich um einiges geiler, als meine alte 7.0 Release; endlich
funktionieren auch noch andere Tools, die sich hier so im Laufe der Jahre
angesammelt haben. Auch Danke f&#252;r die AmigaTimes CD; ein Test folgt in der
n&#228;chsten Ausgabe. Brauchst Du die jetzt wieder? Wenn nicht: Schlag mal was
vor, wie ich mich bei Dir revancieren kann! Wenn Du mir die einfach so
schenkst habe ich im Grunde ein ungutes Gef&#252;hl dabei...
Deine Yonder CD m&#252;sstest Du ja mitlerweile wieder erhalten haben samt einem
Tape aus dem Metalbereich... hoffe mal, da&#223; Dir das Tape gefallen hat; wenn
Du noch Interesse an weiterem Material hast, musst Du nur kurz bescheid
sagen.<br>
Irgendwelche Comments zu &quot;Route 666&quot;? Der Ronald hatte sich da n&#228;mlich
m&#228;chtig M&#252;he mitgegeben und das Resultat ist eiegntlich auch recht
&#252;berzeugend.<BR>
Die Logos entsprechen hoffentlich auch Deinen Erwartungen; wie gesagt, auch
daf&#252;r zeichnet sich der Ronald verantwortlich....<br>
<hr>
<a name="top.html">
<b>Top 5</B><P>
Tja, so voll wie zuletzt habe ich die NC lange nicht mehr gesehen; ein
Grund mehr, seine Top 5 zu veröffentlichen:<p>

1. Alle Artikel, die Feedback enthalten<br>
2. Apocalyptica Special von dR.<br> 
3. Fast Food von Mark Tom<br>
4. Multi-Ecke von Yonder<br>
5. Jan und Jin von Wolf Zimmer<br>
<hr>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
<HR>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
