<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Millenium</title>
</head>
<body background="wol1.jpg" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7"><b>Millenium</font></b></p>

<p>Letztens las ich in einer Illustrierten beim Zahnarzt
folgenden Artikel und er hatte mir gefallen. Er stammte von einer Frau, nur den
Namen habe ich leider vergessen. Ich hoffe, dass ich den Artikel genau wiedergegeben
habe. Die beiden Clips stammen von einer TGV-Amiga-Tools CD.
</p><hr width=80%>

<p>Es ist noch gar nicht so lange her, da waren wir klein und
haben uns immer ausgerechnet, wie alt wir im Jahr 2000 sein w&#252;rden - in
jenem fernen Jahr, in dem uns K&#252;chenroboter in wei&#223;en Sch&#252;rzchen
die Drinks servieren, nachdem wir im Flugauto zu Hause eingeschwebt sind. Nun
ist es pl&#246;tzlich 1999, wir sind in einem Alter, wo man nicht mehr so gerne
&#252;bers Alter spricht, und die Zukunft ist irgendwie immer noch verdammt weit
weg. </p>

<p>Die einzigen, die noch nicht mitgekriegt haben, dass 2000
blo&#223; ein Haufen Nullen ist, sind die Partyveranstalter in aller Welt, die
uns noch einreden wollen, dass Sylvester 1999 die Riesensause des Jahrhunderts,
ach was: des Jahrtausends wird und nicht blo&#223; eine Fete wie jede andere, wo
die Chips zu labbrig sind, der Sekt zu warm und jeder f&#252;nfte Berliner mit
Senf gef&#252;llt ist. </p>

<p>Denn was passiert schon gro&#223; am 31.12.99, Schlag
Mitternacht? Die Uhr macht bong, die Raketen machen bum, die Leute machen prost -
und dann? Dann ist entweder die Welt untergegangen, wie eine Handvoll Sekten
prophezeit, oder es ist immer noch so wie gestern: das &#252;berzogene Konto, die
l&#246;chrigen Socken, das maue Sexleben. Nur dass das alles noch deprimierender
ist als sonst. Weil man ja mal dran geglaubt hat, dass im Jahr 2000 die Welt
eine bessere oder zumindest eine andere sein w&#252;rde. </p>


<p><img border=0 src="st_millenium2.gif" width=240 height=109 align=left alt="2000 zum 1.">
Schon dieses Jahr trifft man auf allen Partys nur Langweiler,
die &quot;Und was habt ihr n&#228;chstes Jahr vor?&quot; fragen, oder
Klugschei&#223;er, die einem vorrechnen, dass erstens das Jahrtausend ja erst am
31.12.2000 abgelaufen sei und dass es zweitens politisch unkorrekt sei, so eine
Riesenfete zu machen, wo doch die armen Juden/Chinesen/Moslems gar nicht
mitfeiern k&#246;nnen wegen anderer Zeitrechnung. Solchen Leuten muss man nur
eine halbe Stunde zuh&#246;ren, und schon findet man, dass der Weltuntergang gar
keine so schlechte Idee ist. </p>

<p>Denn die Alternativen f&#252;r die Nacht der N&#228;chte sind
auch nicht besser. Entweder steht man sich auf einer &#246;den anonymen
Megaparty mit wildfremden Menschen die Beine in den Bauch und wartet auf das
angeblich gr&#246;&#223;te Feuerwerk aller Zeiten, zahlt ein Schweinegeld
f&#252;r einen Tropfen Champagner und wird von Glas zu Glas trauriger. Oder man
war so bl&#246;d und hat einen dieser Angeberfl&#252;ge &#252;ber ein Dutzend
Zeitzonen hinweg gebucht und merkt nach einer Stunde, dass man jetzt noch
weitere 13 Stunden qualvoll eingeklemmt sitzen wird, das Ganze f&#252;r 20.000
Mark. </p>

<p><img border=0 src="st_millenium1.gif" width=173 height=196 align=right alt="2000 zum 2.">
Oder - das allerschlimmste - man macht es sich
gem&#252;tlich. Entweder mit zwei befreundeten Paaren (mit denen man seit Jahren
jeden Donnerstag kegeln geht) sich um einen Fonduetopf hocken, aber diesmal mit
besonders dollem Rinderfilet und Tiefseegarnelen und so, oder in Famillje vor
dem Fernseher mit Knabbermischung und Chantr&#232; ab zw&#246;lf Uhr mittags
zugucken, wie es weltweit 13 schl&#228;gt. Wenn Deutsche es sich gem&#252;tlich
machen, ist das Grauen nicht fern. </p>

<p>Es bleibt also nur eins: Am 31.12.1999 kurz nach der
Tagesschau - gern auch fr&#252;her -drei extrastarke Schlaftabletten einwerfen
und den ganzen Milleniums-Schei&#223; planm&#228;&#223;ig vers&#228;umen.
F&#252;r alle anderen: Weizengrassaft mit einem rohen Eigelb und einem Dutzend
Austern vorm Zubettgehen. Wirkt todsicher gegen den Kater des Jahrtausends.
</p>

<hr>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
</td></tr></table><br>
</body>
</html>
