<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Mein Pseudo....</TITLE>
</HEAD>
<BODY TEXT=red bgcolor=black link=green alink=yellow>

<h1><CENTER><font colour="green">Wie komme ich zu meinem Pseudonym?</FONT></h1></CENTER><P>

Mit diesem Beitrag m&#246;chte ich alle mal dazu auffordern, was &#252;ber ihre
jeweiligen Pseudonyme zu sagen!<p>

Als ich im Januar 1998 in den APC &amp; TCP eingetreten bin, hatte ich f&#252;r mich
pers&#246;nlich festgelegt, da&#223; ich jeden Monat mindestens einen Artikel f&#252;r die
NC schreibe, was mir bis heute auch gelungen ist. Daraus resultierte dann
nat&#252;rlich auch Feedback in irgendeiner Form und nach und nach hatten immer
mehr Leute Probleme, meinen Namen richtig zu schreiben; ein Pseudo musste
also her! <p>

Nachdem ich dir Entscheidung getroffen hatte, mir ein Pseudo zuzulegen,
stand nat&#252;rlich die Frage an, welches es denn sein sollte. Ich hatte einige
&quot;Kandidaten&quot; zur Auswahl, die aber allesamt entweder mich nicht richtig
trafen oder anderweitig unzul&#228;ssig waren....<p>

Schlussendlich entschied ich mich, ein Pseudo zu w&#228;hlen, das irgendwie mit
dem Metalbereich verklinkt ist. Und wie Ihr sicherlich alle wisst, war meine
Entscheidung damals &quot;The Bruce&quot;!<p>

<h2><CENTER><font colour="yellow">Warum &quot;The Bruce&quot;?</FONT></h2></CENTER><P>
F&#252;r &quot;The Bruce&quot; habe ich mich seinerzeit aus zwei Gr&#252;nden entschieden:
Zum einen anlegend an die schottische Geschichte, in deren Verlauf ein K&#246;nig
namens Robert den Beinamen &quot;The Bruce&quot; aufgrund seines Mutes und seiner
Kraft erhielt. Dieser Robert f&#252;hrte nach dem Tod des Rebellen William
Wallace mehrere K&#228;mpfe gegen die Unterdr&#252;cker aus England und siegte 1314
bei Stirling gegen eine Ihm dreifach &#252;berlegende Armee. In der bekannten
Schlacht von Bannockburn schlug &quot;The Bruce&quot; schlie&#223;lich die Engl&#228;nder erneut vernichtend
und befreite Schottland somit von der tyrannischen Herrschaft Englands. Robert &quot;The Bruce&quot; war
der gr&#246;&#223;te Heerf&#252;hrer, den Schottalnd jemals hervorgebracht hat. &quot;The Bruce&quot;
stand damals &#252;brigens f&#252;r &quot;Der L&#246;we&quot;; nur f&#252;r diejenigen, die es
interessiert....<p>

Die Deutsche Metal Combo &quot;Grave Digger&quot; setzten 1996 in Ihrem Album &quot;Tunes
Of War&quot; (geile Scheibe!) die schottische Geschichte musikalisch &#228;u&#223;erst ansprechend um und seitdem
bin ich ein klein wenig von der schottischen Geschichte begeistert;
ansonsten h&#228;tte ich wahrscheinlich nie etwas von &quot;The Bruce&quot; geh&#246;rt und
w&#252;rde heute auch mit einem anderen Pseudo angesprochen werden.<p> 

Der andere Grund, warum meine Wahl auf &quot;The Bruce&quot; fiel, ist der Vorname des
Iron Maiden Lead S&#228;ngers Bruce Dickison; einer der besten Heavy Metal
S&#228;nger, die jemals in der Heavy Metal Szene gesichtet wurden. Schon immer
war ich ein gro&#223;er Fan von Bruce Dickinson und mit meinem Pseudo komme ich
Ihm somit etwas n&#228;her; auch wenn letztgenannter Punkt meine Entscheidung f&#252;r &quot;The
Bruce&quot; lediglich best&#228;rkte!<p>

So, ich hoffe, es hat Euch ein klein wenig gefallen, wie ich Euch mein
Pseudo vorgestellt habe und ich hoffe, da&#223; es mir wenigstens einige gleich
tun.<p>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
<HR>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
