<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="wol1.jpg" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" bgcolor="#808080">
<font color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td></tr></table
<table border="0" cellpadding="5"><tr><td>
<a href="mitglieder/zimmer.html">
<img src="st_wolfinfo.jpg" width=100 height=100 border=0 align=left></a></td>
<td><ul><center><font color=blue> I n h a l t </font></center>
<li> <a href="#a1"> NATO Denkmal </a></li>
<li> <a href="#a2"> Pseudonyme </a></li>
<li> <a href="#a3"> Leserbrief an Rolf Nue aus Wue </a></li>
<li> <a href="#a4"> Feedback </a></li>
</ul></td></tr></table>

<p>
<a name="a1"><font color="800000" size="7"><center>
<b>NATO Denkmal </font></b></a></center><br>
Wenn einer sich das NATO-Denkmal in Graut&ouml;nen betrachtet und der
Hintergrund dabei weggeschnitten ist, dann sieht es wirklich wie ein Monstrum aus
einer unwirklichen Zeit aus. Betrachtet man es aber aus dem Gesichtswinkel eines
&quot;K&uuml;nstlers&quot; und hat die Umgebung mit im Auge, dann kann man die
Ursprungsform, n&auml;mlich die Windrose, welches &uuml;brigens auch der
offizielle Name des Denkmals ist, erahnen. Jeder Gegenstand ist so oder so
darstellbar. Auch ein Porsche 911 kann so verschieden fotografiert werden, dass
er im ersten Bild wie ein Schmusek&auml;tzchen wirkt, aber auf dem zweiten ein
wildes Raubtier vor dem Sprung darstellt. Es ist alles nur relativ.</p>

<p> Bei meiner ersten Recherche nach detaillierteren Informationen wurde ich auf
der Homepage der Bundeswehr (http://bundeswehr.de) f&uuml;ndig. Leider aber nur
als Bildmaterial der Titelseiten der Zeitschrift Bundeswehr Aktuell. Auf den
Seiten der NATO (http://www.nato.int/) ist das Theme Kosovo vorherrschend. Warum
&uuml;berhaupt all die t&auml;glichen Pressekonferenzen? Es steht alles inklusive
Bildmaterial zur Verf&uuml;gung. Nur über die Windrose habe ich nichts gefunden.</p>
<center>
<table border=0><tr><td><center><a href="http://bundeswehr.de/">
<img border=0 src="st_wolfinfo1.jpg" width=128 height=172 alt="BW-Aktuell"></a></center></td>
<td><center><a href="http://www.nato.int/">
<img border=0 src="st_wolfinfo3.gif" width=100 height=81 alt="Windrose"></a><br>
<a href="http://www.nato.int/">
<img border=0 src="st_wolfinfo4.gif" width=150 height=147 alt="Denkmal"></a></center></td>
<td><center><a href="http://bundeswehr.de/">
<img border=0 src="st_wolfinfo2.jpg" width=128 height=172 alt="BW-Aktuell"></a>
</center></td></tr>
<tr><td>Ausgabe16 vom 26.04.99</td><td>&#160;</td><td>Ausgabe17 vom 03.05.99</td>
</tr></table></center>
<p>Bei der Betrachtung des Symbols und der Plastik f&auml;llt doch die
vorherrschend frappierende &Auml;hnlichkeit dieser beiden zueinander auf und ich
pers&ouml;nlich kann beim besten Willen nicht nachempfinden, dass eine negative
oder &quot;b&ouml;se&quot; Ausstrahlung hervorgerufen wird. Wenn man jetzt die
st&auml;hlernen Konstuktionen aus der Filmreihe Kampfstern Galactica vor Augen
hat, dann k&ouml;nnten schon ungute Assoziationen auftreten. Das m&ouml;chte ich
nicht in Abrede stellen. Es ist aber weit hergeholt und solche Gedanken sollte
man bei der Betrachtung dieses Denkmals wirklich au&szlig;er Acht lassen.</p>

<p>Die Fragestellung, &quot;was haltet ihr davon?&quot; war gar nicht so
schlecht. Gerade &uuml;ber Dinge, die man fast t&auml;glich sieht, macht man
sich die wenigsten Gedanken. Aber da scheint auch ein Wissensdefizit
vorzuliegen, denn &uuml;ber alle m&ouml;glichen Monumente, die so in der
Landschaft herumstehen, liest man ellenlange Berichte. Ob der Kaiser Wilhelm
hoch zu Ross, das Niederwalddenkmal, der Herrmann im Teutoburger Wald, der
Beethoven in Bonn, die verschiedenen Leninskulpturen im Osten und was wei&szlig;
ich nicht noch alles, aber &uuml;ber die Windrose habe ich ehrlich gesagt bisher
noch keinen Bericht zu lesen bekommen.</p>

<p>Da ich nichts Schriftliches hier herumliegen habe und auf die Schnelle auch
nicht wei&szlig;, wo ich nachlesen k&ouml;nnte, habe ich mich an die
Pressestelle meiner alten Diensstelle gewandt. Dort konnte man mir leider nicht
sofort weiterhelfen, da keine diesbez&uuml;glichen Informationen vorliegen. Aber
sobald diese Dienststelle etwas von SHAPE (milit&auml;rische Bezeichnung der
Dienststelle der NATO in Europa) zugesandt bekommt, wird dieses Material an mich
weitergeleitet. Vielleicht gibt dieses dann soviel her, dass ich dann nochmals
einen kurzen Artikel mit entsprechender Erl&auml;uterung (der offiziellen
Lesart) daraus machen kann. </p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p>
<a name="a2"><font color="800000" size="7"><center>
<b>Pseudonyme </font></b></a></center><br>
In der Dezember-97 Ausgabe, also in NoCover-41, hatte ich einen Artikel
&uuml;ber den Gebrauch und auch Missbrauch von Pseudonymen ver&ouml;ffentlicht.
Dieser hat auch heute noch seine G&uuml;ltigkeit und deshalb bringe ich diesen
hier in verk&uuml;rzter Ausfertigung noch einmal. Der Titel lautete:
Meckerecke.</p>

<blockquote>
<p>Beim R&uuml;ckbl&auml;ttern in &auml;lteren NoCover fand ich teilweise gute
Beitr&auml;ge, die mir gefielen und informativ waren. Aber in diesem
Zusammenhang fiel mir auch eine Unart auf. Manch einer zeichnet den Beitrag mit
seinem Pseudonym und glaubt, alle Welt wei&szlig;, wer damit gemeint ist, andere
vergessen ihren Namen ganz.</p>

<p>Pseudonym hat heute die Bedeutung von K&uuml;nstlername oder Deckname,
genie&szlig;t das Recht des Namensschutzes und unterliegt vollst&auml;ndig dem
Urheberrecht. Dies kann aber doch nur dann wirksam werden, wenn Pseudonym nicht
mit Anonym verwechselt wird. In der DFUe, wo ja gar nichts mehr geheim ist, ist
ein Deckname manchmal von Vorteil, wenn ihn nur Eingeweihte kennen. Aber in der
Beziehung zu Artikeln in der NoCover sollten es doch K&uuml;nstlernamen
sein.</p>

<p>Am sch&ouml;nsten finde ich es immer noch, wenn beim Pseudonym (=
K&uuml;nstlername) immer in Klarschrift der Tauf- und Familienname steht. Es
gibt bestimmt niemanden unter uns, der sich seines Namens sch&auml;men
m&uuml;&szlig;te oder dieses sogar tut.</p>

<p>Alle, die bisher mit meinen Zeilen nicht einverstanden sind, haben f&uuml;r
das Ph&auml;nomen des Pseudonyms und dessen Bedeutung eine andere
Interpretation. In verschiedenen Sportarten gibt es Kampfnamen, im Freundes-
oder Bekanntenkreis kennt man den Spitzname, Spottname, &Uuml;bername oder
Schimpfname. Aber dies hat alles nichts mit einem Pseudonym zu tun. Das sind
alles Bezeichnungen, die man von Drittem verliehen bzw. angeh&auml;ngt
bekommt.</p>

<p>Der APC&TCP ist kein Sportclub, demgem&auml;&szlig; sind Kampfnamen hier fehl
am Platze. Verbleibt also der Begriff &quot;Freundeskreis&quot;. Wer also einen
Namen verliehen bekam, hat einen Spitznamen. Wer sich selbst einen Namen
zugelegt hat, hat ein Pseudonym. Alle anderen Bezeichnungen lassen wir
au&szlig;en vor.</p>

<p>Die NoCover ist das Kommunikationsmittel innerhalb unseres Clubs. Und damit
sich jeder mit jedem vern&uuml;nftig unterhalten kann, sollte das Pseudonym oder
der Spitzname nicht zum Geheimname werden. Wenn mit der Zeit also nur noch die
&quot;Decknamen&quot; genutzt werden, ist bald jeder ein Anonymus. Woher sollen
die neuen Mitglieder mitbekommen, wer sich hinter diesen Namen versteckt?</p>

<p>Bekommt ein Gastleser die NoCover Nr. 6 zu Gesicht und liest einen Namen wie
Syntax Terror, der mu&szlig; doch an seinem Verstand zweifeln und glauben, wo
bin hier nur gelandet? Er wird sich mehrfach &uuml;berlegen, ob er Mitglied
werden wird. Andere haben erkannt, da&szlig; ihre Pseudonyme zu sehr wie
Kampfnamen klingen und haben sich wohlklingendere Namen erdacht und zugelegt.
Das finde ich sehr gut und bin auch &uuml;berzeugt, da&szlig; mir hier mehrere
zustimmen. Allgemein legen sich K&uuml;nstler gerne exotische, aber sprechbare
Namen zu. Die k&uuml;nstlichen Namen sind in diesem Metier weniger
gel&auml;ufig. Bei uns in der Computersparte sind sie sogar angebracht, da diese
irgendwie typisch und auch passend hierf&uuml;r sind.</p>

<p>Symtomatisch f&uuml;r den Gebrauch des Pseudonyms m&ouml;chte ich an dieser
Stelle nur Marc Tom erw&auml;hnen. Er hat vor einiger Zeit <i>(Sommer 97) </i>
ganz deutlich geschrieben, da&szlig; er nur noch sein Pseudonym verwenden
w&uuml;rde. Dieses sehe ich vollst&auml;ndig ein, er hat auch einen
verh&auml;lnism&auml;&szlig;ig langen Namen. Aber auch er schreibt seinen Namen
in Klarschrift, sobald er pers&ouml;nlich ein Feedback erwartet. Fr&uuml;her hat
er seinen Namen beim Layouten versteckt, dieser kam aber zum Vorschein, wenn man
seine Texte als ASCII-Files abspeicherte, inclusive Hilfen bei seinen damaligen
R&auml;tseln. Aber wer speichert schon Texte zus&auml;tzlich ab.</p>

<p>Wer sich also selbst einen Spitznamen (und kein Pseudonym) zugelegt hat und
auch nur damit unterschreibt, eventuell um Antwort bittet ohne auf seinen Namen
und Anschrift hinzuweisen, den finde ich gelinde gesagt arrogant, da dieser nur
eine kleine Clique anspricht und die Neuen und auch die Unwissenden absichtlich
au&szlig;en vorl&auml;&szlig;t.</p>
</blockquote>
<a name="platz1"></a> <br>
<p>Viele der &auml;lteren Mitglieder kennen bestimmt noch diesen Artikel und die
seinerzeit Angesprochenen hatten sich gebessert und sich auch daran gehalten,
den eigenen Namen mit hinzuzuf&uuml;gen, wenn sie wieder einen Artikel
geschrieben hatten. Selbstverst&auml;ndlich kann es noch vorkommen, dass beim
Layouten die Unterschrift komplett vergessen wird, besonders wenn man diese
separat als Baustein irgendwo zwischengespeichert hat. Aber heute reist es
wieder ein, nur noch das Pseudonym als Absender zu verwenden. Und wenn ich
wissen will, wer nun dahinter steckt, bin ich gezwungen in meiner
Tabelle <a href="st_wolfinfo1.html"> Pseudonyme </a> nachzuschauen, was ich gar
nicht so optimal finde.</p>

<p>Gerade heute, wo wir die Artikel nicht mehr f&uuml;r den Anzeiger Magnetic
Pages wandeln m&uuml;ssen, sondern die viel pflegeleichtere M&ouml;glichkeit von
HTML haben, ist es kein Problem, in seine Artikel gespeicherte Bausteine
einzuf&uuml;gen. Es muss ja nicht immer gleich ein Riesen LOGO sein, welches
viel Speicherplatz ben&ouml;tigt, aber jeder wahrt sich damit seine
Individualit&auml;t und seine Einzigartigkeit.</p>
                                                      
Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p>
<a name="a3"><font color="800000" size="7"><center>
<b>Leserbrief an Rolf Nue aus Wue </font></b></a></center>

<h3>Gr&uuml;&szlig; Dich Rolf</h3>

<p>Diesen Beitrag hatte ich leider in meinem Leserbrief vergessen. Aus diesem
Grunde bekommst Du jetzt hier einmal einen Platz zugewiesen.</p>

<p>Den Aspekt &uuml;ber mein Wissen in Zusammenhang mit Internet habe ich Dir
wohl ausf&uuml;hrlich in der pers&ouml;nlichen E-Mail dargestellt. In den beiden
letzten Abs&auml;tzen batest Du um &ouml;ffentliche Diskussion und da
m&ouml;chte ich hier ankn&uuml;pfen.</p>

<p>Meine Meinung, die NoCover in Form von Bausteinen zu ver&ouml;ffentlichen,
hatte ich in meinem Beitrag an Uwe Brunen deutlich zum Ausdruck gebracht und an
dieser Einstellung hat sich bis dato noch nichts ge&auml;ndert. Deine Frage nach
Empfang von E-Mails &uuml;ber dieses Thema muss ich mit &quot;Nein&quot;
beantworten. Oder soll ich sagen: &quot;Leider nein&quot;? Nur meine Meinung zur
Anregung, die NoCover mit Frames zu versehen, hat sich durch den Aufruf von
Andreas zwangsl&auml;ufig gewandelt. Ich habe mich hingesetzt, ein Beispiel
entworfen und an Andreas geschickt. Es kann sein, dass diese NC-Ausgabe nach
diesem Muster aufgebaut wurde.</p>

<p>Frames in der NoCover haben aber immer noch einen Nachteil f&uuml;r
diejenigen, die mit einer Minimalkonfiguration arbeiten, wie z.B. mit einem 13&quot;
Monitor, Aufl&ouml;sungen wie PAL/HighRes oder sogar PAL/LowRes, mit 16 Farben-WB
oder mit einer immens veralteten Demoversion des Browsers. Weiterer Schwachpunkt ist
die Verwendung des Links zur Hauptseite aus den einzelnen Beitr&auml;gen heraus.
Ist dies nicht richtig geschrieben, wird Frame in Frame aufgebaut und bei
Verwendung von AWeb muss der Schalter Neuladen des Browsers bet&auml;tigt
werden, bei den anderen beiden Browser gen&uuml;gt das Anklicken des
Kopf-Frames. Auch wird es gleich wieder viele Vorschl&auml;ge f&uuml;r
Verbesserungen geben, wie das Verwenden von GIF-Schaltfl&auml;chen im linken
Frame. Dass dies alles Ladezeitenverz&ouml;gerungen nach sich zieht, wird wohl
absichtlich &uuml;bersehen. Aber vielleicht gibt es jemand, der einen Banner
f&uuml;r den Kopf-Frame entwickelt und die entsprechenden GIF-Schaltfl&auml;chen
f&uuml;r den linken Haupt-Frame dazu bastelt. Es muss halt nur darauf geachtet
werden, dass auch alle alten Browser diese richtig umsetzen.</p>

<p>Zum letzten Absatz &auml;u&szlig;ere ich mich aber nicht. Da ich keinen
Wintel-PC habe und auch keinen haben werde, w&auml;ren meine
&Auml;u&szlig;erungen nur auf Mutma&szlig;ungen und Emotionen aufgebaut und das
ist nicht mein Stil. Also lasse ich es ganz.</p>
<p>Alles Gute bis zum n&auml;chsten Mal!</p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p>
<a name="a4"><font color="800000" size="7"><center>
<b>Feedback </font></b></a></center><br>
Folgende Artikel habe ich dieses Mal in meinem Feedback in alphabetischer
Reihenfolge der Titel ber&#252;cksichtigt. Ein Autor erscheint bei mir nur
einmal, auch wenn mehrere Beitr&#228;ge lobenswert sind: </p>
<ul>
<li> <b>Astro Corner</b> von Lars Philipsen</li>
<li> <b>DOpus Kurztest</b> von Fabian Kruse</li>
<li> <b>Internet Provider</b> von Tobias Kaatz</li>
<li> <b>MCP</b> von Markus Castro</li>
<li> <b>Opty CD Player</b> von Kilian Servais</li>
</ul>
<p>Auf meinem Schmierzettel standen erst eine ganze Reihe mehr Titel, leider
musste ich mich aber dann entscheiden, da ich an der Zahl 5 festhalten m&ouml;chte.</p>
<hr>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
</td></tr></table>
<br>
</body>
</html>
