<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Test: ModePro</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CenTER><b><U><font colour="green">Test: ModePro</FONT></U></h2></CENTER></b><p>

Grafikkartenuser kennen das Problem: Da hat man sich gerade eine neue GraKa samt Monitor
geholt und m&#246;chte nun auch alle Programme in beispielsweise 800 X 600 laufen
lassen, aber die Software unterstützt das nicht. Moderne Software verf&#252;gt zwar meistens &#252;ber einen Requester, wo man
die Aufl&#246;sung einstellen kann, aber ein Gro&#223;teil der &#228;lteren Software will
partrout nicht in der neuen Aufl&#246;sung laufen. ModePro verspricht hier
Abhilfe; der Test wird zeigen, ob es halten kann, was es verspricht.<p>

<h2><CenTER><font colour="grey">Moment mal! Anforderungen und Instalation:</FONT></h2></CENTER><p>
ModePro verlangt im Grunde nur AmigaOS 2.1 oder h&#246;her. Wer noch OS 2.04
installiert hat, braucht noch Version 38 der ASL Library um ModePro zum
laufen zu bewegen. Um in den vollen Genuss der Funktionen zu kommen, ist
nat&#252;rlich eine Grafikkarte sinnvoll, aber auch auf einem stinknormalen AGA
Amiga macht ModePro (begrenzt) Sinn. Die Installation geht dank &quot;Installer&quot;
sehr einfach und ohne Probleme &#252;ber die B&#252;hne, so da&#223; man gleich loslegen
kann.<p>

<h2><CENTER><FONT COLOUR="white">Hey...? Was kann das denn nun?</FONT></h2></CENTER><p>

ModePro ist weitaus mehr als ein einfacher Schirmumlenker (auch als
&quot;Promoter&quot; bezeichnet), auch wenn das umlenken der Bildschirmmodi die
Hauptaufgabe von ModePro ist. Das Promoten kann man sich in etwa so
vorstellen: Irgendein Program will ganz normal seinen Bildschirm &#246;ffnen
(z.B. Pal:HighRes). F&#252;r AGA User mag das ja noch aktzeptabel sein, aber f&#252;r
Grafikkartenuser ist es absolut bl&#246;d, da sich zum einen nicht jede GraKa mit
HighRes Programmen vertr&#228;gt und zum anderen der Monitor (z.B. ein 17&quot;
Monitor) nicht ausgenutzt wird. Mit ModePro kann man nun versuchen, da&#223;
entsprechende Program umzulenken; z.B. auf einen 640 X 480 oder 800 X 600
Screen. Dies geschieht wahlweise &#252;ber eine Liste der Programme, Namen der
Screens oder &#252;ber die Modi. Letzteres ist in der Praxis am effektivsten,
kann man so doch alles automatisieren. Will man z.B. einen HighRes Screen
immer in 800 X 600 auf der WB haben, muss man das so nur noch in ModePro
eintragen. Nat&#252;rlich besteht auch die M&#246;glichkeit, nur bestimmte Programme
zu promoten oder gar &#246;ffentliche Bildschirme zu manipulieren; hier sind dem
User im Grunde keine Grenzen gesetzt.<p><CENTER>
<img src="mode2.png"></CENTER>
<hr>
<h2><CENTER><font colour="red">Besonderheiten:</FONT></h2></CENTER><p>
Bis jetzt bietet ModePro also nichts, was andere Tools dieser Gattung nicht
auch k&#246;nnten. Aber nat&#252;rlich bietet ModePro noch einige weitere Funktionen,
die vor allem f&#252;r erfahrene User sehr n&#252;tzlich sind. ModePro kann f&#252;r jeden
Modus noch einige zus&#228;tzliche Optionen aktivieren, als da w&#228;ren:
&quot;Automatisches Rollen&quot; (aktiviert Autoscroll), &quot;Interleave&quot; (beschleunigt Grafikaufbau, aber vertr&#228;gt sich nicht immer mit jedem
Program), "Bildschirm nach hinten" (der neue Bildschrim wird hinter allen anderen ge&#246;ffnet)
, Schwarzer Rahmen (mit dieser Option wird der Overscan Bereich geschw&#228;rtzt)
und "Erzwinge Planar" (wenn ein Program die Standard Amiga Grafik Routinen w&#252;nscht, kann man mit dieser
Option, bei Grafikkartensystemen, eine Umlenkung erst m&#246;glich machen).
Auch die Zentrierung kann wahlweise noch
eingestellt werden, was sich als sinnvoll herausgestellt hat. Man sollte es
aber tunlichst lassen, mit den Optionen rumzuspielen, wenn man nicht wei&#223;,
was man tut, da es ansonsten zu unerkl&#228;rlichen Abst&#252;rzen kommen kann.<p> 

Ferner kann man den Screens noch den WB 2+ &quot;3 D Look&quot; geben und Hintergr&#252;nde
definieren (letzteres l&#228;&#223;t sich nat&#252;rlich auch weiterhin mit dem &quot;normalen&quot;
WB Pattern Voreinsteller machen). Wer &quot;Public Screens&quot; (&#214;ffentliche
Bildschirme) bevorzugt, kann dies mit der Option &quot;&#246;ffentlich machen&quot;
bewerkstelligen. Last but not least kann man noch einen Hot Key eintragen,
so da&#223; der Bildschirm bei einer bestimmten Tastenkombination in den
Vordergrund geholt wird (wie man es auch von den verschiedenen Commodities
her kennt).<p>

ModePro kann somit auch als Public Screen Manager bezeichnet werden, womit auch
&quot;normale&quot; AGA User einen Nutzen aus diesem Tool ziehen k&#246;nnen. Wer also
h&#228;ufiger mal mit Public Screens etwas zu tun hat, kann ja mal dieses Tool
antesten.<p> 

<h2><CENTER><FONT COLOUR="yellow">Einschr&#228;nkungen:</FONT></h2></CENTER><p>
ModePro kann nur Programme umlenken, die das AmigaOS zum &#246;ffnen des
Bildschirms nutzen. Vor allem &#228;ltere Spiele (auch die eine oder andere
Anwendung) benutzen eigene Routinen, womit ein Umlenken unm&#246;glich wird.
Man sollte auch immer im Hinterkopf haben, da&#223; ModePro nichts anderes als ein Hack ist, der vielleicht
nicht mit jedem St&#252;ck Software zusammenarbeitet. Evtl. kann man noch mit der einen oder anderen Option etwas
erreichen, aber mitunter kommt es schon mal vor, da&#223; sich ein Program nicht
umlenken l&#228;sst. Selbiges gilt auch f&#252;r Grafikfehler, die auf dem Screen erscheinen k&#246;nnen.
<p>
<h2><CENTER><FONT COLOUR="ff1599">Stop!</FONT></h2></CENTER><p>
ModePro ist &quot;Donationware&quot;; d.h., da&#223; man dem in den USA lebenden Autor
etwas schenken soll, auch wenn die frei verteilbare Aminet Version in
keinster Weise eingeschr&#228;nkt ist. Die aktuelle Version ist  4.61 und ist im
Aminet bzw. auf Aminet CD 29 zu finden. Ach ja: Auch wenn auf den
Screenshots deutsche Texte zu lesen sind, muss ich sagen, da&#223; die Guide
leider in English verfasst wurde und auch nicht ganz astrein ist. Na ja,
&#252;ber diese kleine Unebenheit kann man wohl hinwegsehen....<p>

<h2><CENTER><FONT COLOUR="purple">Fazit:</FONT></h2></CENTER><p>
ModePro (an dem &#252;brigens seit 1994 gearbeitet wird) ist ein ausgereiftes
Tool, da&#223; seinen Dienst weitestgehend einwandfrei erf&#252;llt. Zus&#228;tzlich bietet
es einige Extraoptionen, die andere vergleichbare Programme nicht bieten und
wird somit zur ersten Wahl f&#252;r gestresste Grafikkartenuser. Dank
systemkonformer Einbindung kann auch der unerfahrene User schnell alles
n&#246;tige konfigurieren und muss sich nicht erst lange rum&#228;rgern. Eine runde
Sache!




<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
<HR>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
