<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n lukijakysely 2000</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Jarmo Piippo</font></td>
				</tr>
			</table>
			</p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Amiga-maailmaa parina viime vuonna ravistelleet enemm&auml;n ja v&auml;hemm&auml;n dramaattiset tapahtumat ovat osaltaan vaikuttaneet my&ouml;s kotimaisen harrastajajoukon tilanteen kehityssuuntiin. Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. p&auml;&auml;tti viime syksyn&auml; ryhty&auml; j&auml;lleen lukijakyselyn avulla selvitt&auml;m&auml;&auml;n, miss&auml; menn&auml;&auml;n.</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Patterisammakko jaksaa</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kysely julkaistiin 15. lokakuuta ilmestyneen Saku-lehden lis&auml;ksi my&ouml;s yhdistyksen kotisivuilla ja Sakunetiss&auml;. Vastausaikaa oli vain marraskuun loppuun, mutta lyhyest&auml; ajasta huolimatta haaviin ehti kerty&auml; per&auml;ti 169 vastausta. Vaikkei vuoden 1999 kyselyn huimaan 297 vastauksen saaliiseen yllettyk&auml;&auml;n, saatiin siis kuitenkin kaikkien aikojen toiseksi pulskin Saku-lehden lukijakysely kasaan. Jo pelk&auml;n vastausinnokkuuden perusteella voidaan todeta, ett&auml; Saku on yh&auml; t&auml;ynn&auml; vakaata menoa henkiv&auml;&auml; voimaa!
						<p>Pitk&auml;&auml;n jatkunut uuden Amiga-malliston odotus ja Classic-koneiden k&auml;ytt&auml;j&auml;kunnan tasainen supistuminen ovat kuitenkin vaatineet veronsa my&ouml;s pohjoisessa kotomaassamme. N&auml;kyvin muutos yhdistyksen n&auml;k&ouml;kulmasta katsoen on j&auml;senm&auml;&auml;r&auml;n lasku, joka ei onneksi sent&auml;&auml;n ole ollut niin vakavaa kuin olisi voinut markkinatilanteen valossa kuvitella.</p>
						<p>Yksi asia on joka tapauksessa varmaa: amigistitkin ovat jo kauan sitten siirtyneet t&auml;ysipainoisesti nauttimaan s&auml;hk&ouml;isen tiedonv&auml;lityksen eduista. Edellisen kyselyn tapaan kotisivujen palautekaavake oli j&auml;lleen ylivoimaisesti suosituin vastausmuoto, s&auml;hk&ouml;postilla v&auml;litettiin muutama kaavake eik&auml; kirjeitse ainuttakaan.</p>
						<center>
							<p><img height="124" width="420" src="kuvat/lukijakysely_00.gif" border="0" alt=" "></p>
						</center>
						<p>Hyv&auml;ksi koetun k&auml;yt&auml;nn&ouml;n mukaan kyselyn tulokset ilmoitetaan prosenttiarvoina kunkin vastausvaihtoehdon valinneiden m&auml;&auml;r&auml;st&auml; suhteessa kaikkien kyselyyn vastanneiden m&auml;&auml;r&auml;&auml;n, ja luvut on py&ouml;ristetty yhden desimaalin tarkkuuteen. Poikkeuksena k&auml;yt&auml;nt&ouml;&ouml;n on 7. kysymys, jonka laskentaperiaate selvitet&auml;&auml;n omassa kohdassaan tarkemmin.</p>
						<p>Vastausten yhteenlasketut prosenttiarvot eiv&auml;t aina ole yhteens&auml; 100, koska osassa kaavakkeita ei ollut vastattu kaikkiin kysymyksiin. Lis&auml;ksi on syyt&auml; j&auml;lleen pit&auml;&auml; mieless&auml;, ettei t&auml;ll&auml; tavoin toteutettu kysely ole tilastotieteellisesti p&auml;tev&auml;, joten tulokset ovat parhaimmillaankin vain suuntaa-antavia arvioita lukijakunnan tilasta.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">1. Sukupuolesi?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<center>
							<p><img height="100" width="416" src="kuvat/lukijakysely_01.gif" border="0" alt=" "></p>
						</center>
						<p>Kuten odotettavissa oli, lukijakunnan miesvaltaisuus ei edelleenk&auml;&auml;n ole merkitt&auml;v&auml;ss&auml; m&auml;&auml;rin hellitt&auml;nyt. Viime lukijakyselyn vastaajista naisia oli kolme (1,1 prosenttia), nyt viisi. Toisaalta voidaan t&auml;ss&auml; nyt edes hiukan lohduttautua sill&auml;, ett&auml; naisten prosenttiosuus on kasvanut l&auml;hes kolminkertaiseksi. :)</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">2. Ik&auml;si?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<center>
							<p><img height="231" width="420" src="kuvat/lukijakysely_02.gif" border="0" alt=" "></p>
						</center>
						<p>Amigistien valtaosa on nuoria aikuisia, ja ik&auml;haarukka vaikuttaisi olevan hiukan kapenemaan p&auml;in. Jo reilun vuoden aikav&auml;li edelliseen kyselyyn on riitt&auml;nyt tekem&auml;&auml;n havaittavan eron jakaumaan kuten my&ouml;s vastanneiden keski-ik&auml;&auml;n, joka taitaa piakkoin olla l&auml;hemp&auml;n&auml; kolmen kuin kahden kympin rajaa. Kovin suuria muutokset eiv&auml;t kuitenkaan ole, joten ne voivat osittain johtua my&ouml;s k&auml;ytetyn tilastointimenetelm&auml;n ep&auml;tarkkuuksista.</p>
						<p>Vaikkei tarkkaa ik&auml;&auml; kysyttyk&auml;&auml;n, p&auml;&auml;tti yksi vastaaja silti varmuuden vuoksi j&auml;tt&auml;&auml; t&auml;m&auml;n kohdan tyhj&auml;ksi.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">3. Oletko Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n j&auml;sen (2000)?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<center>
							<p><img height="124" width="420" src="kuvat/lukijakysely_03.gif" border="0" alt=" "></p>
						</center>
						<p>Ei-j&auml;senten vastausm&auml;&auml;r&auml; oli viime kyselyss&auml; l&auml;hes 60 prosenttia, nyt en&auml;&auml; noin 45. M&auml;&auml;r&auml;n putoaminen selittynee osittain &quot;suuren yleis&ouml;n&quot; kiinnostuksen v&auml;henemisell&auml; Amiga-asiaan. Yhdistyksen 80 j&auml;senest&auml; 55 (eli 69 prosenttia!) osallistui kyselyyn, joten ilmeisesti aktiivisimmat j&auml;senet ovat pysyneet toiminnassa mukana keskim&auml;&auml;rin parhaiten. Jos jotain positiivista tuloksista on haettava, niin amigistit lienev&auml;t nyt ainakin jossakin mieless&auml; tiiviimpi ryhm&auml; kuin koskaan aiemmin...</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">4. Aiotko uusia j&auml;senyytesi/liitty&auml; j&auml;seneksi?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<center>
							<p><img height="100" width="419" src="kuvat/lukijakysely_04.gif"></p>
						</center>
						<p>Melko tarkasti samann&auml;k&ouml;inen tulos kuin edellisess&auml; kyselyss&auml;. Noin sata vastaajaa ilmoitti j&auml;senyyden kuuluvan suunnitelmiinsa. Mik&auml;li kaikki &quot;pit&auml;isiv&auml;t sanansa&quot;, voisi yhdistyksen j&auml;senm&auml;&auml;r&auml;n siis odottaa hieman kasvavan, mik&auml; edist&auml;isi vuosikokouksessakin asetettua sadan j&auml;senen tavoitetta vuodelle 2001.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">5. Miksi liityt/et liity j&auml;seneksi?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<p>Kuten viimeksikin, yhdistyksen ja Amiga-toiminnan tukeminen olivat suosituimmat syyt j&auml;senyyteen ja omasta Amigasta luopuminen merkitt&auml;vin syy eroamiseen. Kysymykseen oli vastattu 72,2 prosentissa lomakkeista. N&auml;ppituntumalta sanottuna syiden jakauma vastannee kohtalaisen hyvin edellisen kyselyn vastaavaa kohtaa (ks. Saku #30.)</p>
						<p>Tavan mukaan joitakin esimerkkikommentteja:</p>
						<ul>
							<li>&quot;Ei kehtaa olla maksamatta j&auml;senmaksua... ;-)&quot;
							<li>&quot;Saku on Suomen paras (ja ainoa) Amiga-lehti! Tukeakseni Sakun toimintaa ja varmistaakseni ett&auml; Sakulla olisi hyv&auml; tulevaisuus.&quot;
							<li>&quot;En en&auml;&auml; ole aktiivinen Amigisti ja luen vain aniharvoin lehte&auml;nne. Mutta silti, aina v&auml;lill&auml;, on mukava palata muistelemaan vanhoja hyvi&auml; aikoja ja rakasta Amigaa. Onnea ja menestyst&auml; kaikille Amigan yst&auml;ville!&quot;
							<li>&quot;J&auml;rkytt&auml;v&auml;n rahapulan takia olen toistaiseksi karsinut kaikki menot, jotka eiv&auml;t aivan v&auml;ltt&auml;m&auml;tt&ouml;mi&auml; ole. Mutta heti kun voin liityn kyll&auml;, koska toki haluan tukea Saku-toimintaa ja olla osa sit&auml;. Niiss&auml; tapahtumissa miss&auml; olen ollut (Sakut, vuosikokoukset, pikkujoulut) on ollut kivaa, ja toivoisin ett&auml; vastaavia voidaan j&auml;rjest&auml;&auml; jatkossakin.&quot;
							<li>&quot;Koska te olette Suomen paras yhdistys!&quot;
							<li>&quot;Ei ole aikaa nauttia j&auml;senyyden eduista.&quot;
							<li>&quot;Koska en ole vakuuttunut yhdistyksen parantavasta vaikutuksesta ja koska en todellakaan ehdi seuraamaan tapahtumia tarpeeksi aktiivisesti.&quot;
							<li>&quot;Kiihke&auml;n&auml; amigistina vaihtoehtoja ei juuri ole =)&quot;
							<li>&quot;Amiga-asenne on se joka porskuttaa!&quot;
							<li>&quot;No liittyminen on ihan muistista kiinni. Kun on jo niiin vanha ett&auml; alshaimeri&quot;
							<li>&quot;Siin&auml; olisi ryhtymisen makua.&quot;
							<li>&quot;Ei ole varaa, eik&auml; j&auml;seneksi liittymisest&auml; ole edelleenk&auml;&auml;n mit&auml;&auml;n hy&ouml;ty&auml;... (no j&auml;rjestet&auml;&auml;nh&auml;n niit&auml; tapahtumia, mutta niihin on jotain 500 km matkaa)&quot;
							<li>&quot;Amiga on osa el&auml;m&auml;&auml;ni ja n&auml;in voin tukea ja olla osa suomalaista Amiga-perhett&auml;.&quot;
							<li>&quot;Kokonaisuus on enemm&auml;n kuin osiensa summa. Pienten ryhmien on pidett&auml;v&auml; huoli omista asioistaan, suuret ryhmittym&auml;t pyrkiv&auml;t tasap&auml;ist&auml;m&auml;&auml;n joukkoa joskus diktaattorimaisinkin keinoin.&quot;
							<li>&quot;Aina nyt sen verran t&auml;ytyy tukea t&auml;t&auml; riutuvaa Amiga-toimintaa.&quot;
							<li>&quot;Amiga-laitteistoni alkaa ker&auml;&auml;m&auml;&auml;n yh&auml; enemm&auml;n p&ouml;ly&auml;, tiedostojen sijaan.&quot;
							<li>&quot;Totta kai tuen toimintaa - onhan se hyv&auml;, ett&auml; meill&auml; on jotain t&auml;llaista kuin oma, kansallinen k&auml;ytt&auml;j&auml;yhdistys.&quot;
						</ul>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">6. Aiotko osallistua yhdistyksen tuleviin tapahtumiin?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<center>
							<p><img height="125" width="420" src="kuvat/lukijakysely_06.gif" border="0" alt=" "></p>
						</center>
						<p>Kuten aiemminkin, suuret tapahtumat innostavat useampia l&auml;htem&auml;&auml;n mukaan kuin pienet, ja uudelle Saku-tapahtumalle on selke&auml; tilaus. Noin 20 prosenttia ei ole suunnitellut osallistuvansa tapahtumiin lainkaan. Mielenkiintoisena yksityiskohtana mainittakoon, ett&auml; muutama vastaaja, joka ei ollut j&auml;sen koska ei mielest&auml;&auml;n saavuttaisi j&auml;senyydell&auml; yht&auml;&auml;n mit&auml;&auml;n etua, oli kuitenkin varsin kiinnostunut osallistumaan Saku 2001 -tapahtumaan. Pardon me, mutta eik&ouml;s se tapahtuma ole etu? ;-)</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">7. Millaisia artikkeleita luet mieluiten Saku-lehdest&auml;?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<center>
							<p><img height="202" width="420" src="kuvat/lukijakysely_07.gif" border="0" alt=" "></p>
						</center>
						<p>Erojen esiin saamiseksi muotoilimme kysymyksen siten, ett&auml; aiheista pyydettiin valitsemaan kolme kiinnostavinta paremmuusj&auml;rjestyksess&auml;. Tulokset laskettiin pisteytt&auml;m&auml;ll&auml; valinnat siten, ett&auml; kiinnostavin sai kolme pistett&auml;, toinen kaksi ja kolmas yhden. Aihealueiden v&auml;linen pistesaalisjakauma saatiin laskemalla niiden saamien pisteiden osuudet prosentteina suhteessa yhteenlaskettuihin kokonaispisteisiin. T&auml;llainen menetelm&auml; valittiin, koska pyyt&auml;m&auml;ll&auml; lukijaa vain rastittamaan h&auml;nt&auml; kiinnostavat kohdat olisi lopputuloksena saattanut olla tasajakauma.</p>
						<p>Amiga-maailmassa tapahtuu nyt enemm&auml;n kuin pitkiin aikoihin, joten ajankohtaisten aiheiden kiinnostavuus on ymm&auml;rrett&auml;v&auml;&auml;. Terho Henrikssonin toteuttama uutispalstareformi on toivottavasti sekin saanut lukijat kiinnostumaan Amiga- ja IT-maailman ajankohtaisista aiheista. Testit kiinnostavat eniten, mutta vaikka kaikenlaista uutta on ohjelmisto- ja laitteistopuolella viime aikoinakin julkaistu, niist&auml; tarjotaan juttuja valitettavan v&auml;h&auml;n.</p>
						<p>Muut-kohdan valinneet olivat kirjoittaneet kiinnostaviksi aiheiksi esimerkiksi seuraavia: kolumnit, demo/partyjutut, evvk, j&auml;nn&auml;&auml; tietoa kaikesta, itse kirjoittamani, oudot ja hullut, osto/myyntipalsta, Amiga ammattik&auml;yt&ouml;ss&auml;.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">8. Haluaisitko kirjoittaa artikkeleita Saku-lehteen?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<center>
							<p><img height="100" width="420" src="kuvat/lukijakysely_08.gif" border="0" alt=" "></p>
						</center>
						<p>L&auml;hes puolet vastaajista haluaisi kirjoittaa, mutta lehteen k&auml;yt&auml;nn&ouml;ss&auml; tulevien juttujen m&auml;&auml;r&auml;st&auml; p&auml;&auml;tellen useimmilla ei tunnu mielest&auml;&auml;n olevan lehteen sopivaa aihetta tai tarpeeksi taitoa, aikaa ja innostusta artikkelin kasaamiseen. Toivottavasti kaikki halukkaat kuitenkin p&auml;&auml;sev&auml;t eroon rimakauhustaan, sill&auml; Saku-artikkelien kirjoittaminen ei ole mik&auml;&auml;n kilpailutilanne, vaan jokaisen panos on t&auml;rke&auml;!</p>
						<p>Kommenteissa pyydettiinkin juttua artikkeleiden kirjoittamisesta Sakuun, mutta melko hyv&auml; ohjenuora on lueskella muutamia aikaisempia lehti&auml;. Artikkeleita on yht&auml; monenn&auml;k&ouml;isi&auml; kuin on kirjoittajiakin. Aiempia juttuja silm&auml;ilem&auml;ll&auml; saa hieman osviittaa siit&auml;, mihin suuntaan lehteen tarjottavia artikkeleita voi muokata. Liian kriittinen ei kannata omia juttujaan kohtaan olla; aina kannattaa mieluummin tarjota juttua lehteen kuin ajatella, ettei se ole &quot;tarpeeksi hyv&auml; lehteen&quot;.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">9. Luetko HTML-Sakua mieluummin suoraan yhdistyksen kotisivuilta Internetiss&auml; vaiko pakattua versiota off-line-tilassa?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<center>
							<p><img height="100" width="420" src="kuvat/lukijakysely_09.gif" border="0" alt=" "></p>
						</center>
						<p>Melkein puolet Sakun lukijoista selailee lehte&auml;&auml;n off-line, mik&auml; selittynee modeemik&auml;ytt&auml;jien suhteellisen suurella osuudella vastaajista (yli puolet). Lehden helppo saatavuus my&ouml;s pakattuna versiona on siis jatkossakin edelleen t&auml;rke&auml;&auml;.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">10. Mit&auml; selainta k&auml;yt&auml;t kaikkein useimmin Sakun lukemiseen?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<center>
							<p><img height="221" width="420" src="kuvat/lukijakysely_10.gif" border="0" alt=" "></p>
						</center>
						<p>Suurin osa vastauksista jakautui muutaman yleisimm&auml;n selaimen kesken. Jos vastaaja oli maininnut useamman ohjelman, valittiin se jota h&auml;n ilmoitti k&auml;ytt&auml;v&auml;ns&auml; eniten tai joka oli mainittu ensimm&auml;isen&auml;. Muut-kohtaan sijoitettiin esimerkiksi Mozilla- ja Lynx-k&auml;ytt&auml;j&auml;t sek&auml; ne vastaukset, joissa selainta ei ollut ilmoitettu. Tuloksista n&auml;hd&auml;&auml;n ainakin se, ett&auml; kotisivujen ja lehden suunnittelu toimimaan kaikilla selaimilla on todellakin tarpeen.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">11. Oletko suositellut Saku-lehte&auml; yst&auml;villesi?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<center>
							<p><img height="100" width="420" src="kuvat/lukijakysely_11.gif" border="0" alt=" "></p>
						</center>
						<p>Lehden alkuajoista asti on yksi tehokkaimpia levikin kasvattajia ollut viidakkorumpujen jytin&auml;. Tyytyv&auml;inen asiakas on aina paras mainos.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">12. Omistatko uuden Amiga Software Development Kitin?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<center>
							<p><img height="150" width="420" src="kuvat/lukijakysely_12.gif" border="0" alt=" "></p>
						</center>
						<p>Suurimmalle osalle k&auml;ytt&auml;jist&auml; sovelluskehitin on ymm&auml;rrett&auml;v&auml;sti turhan tuhti hankinta, eik&auml; ohjelmointi harrastuksenakaan liene en&auml;&auml; yht&auml; suosittua kuin ennen muinoin. Joskus k&auml;y kuitenkin toisinkin p&auml;in: yksi vastaaja ilmoitti omistavansa jo SDK:n, muttei kuitenkaan aio hankkia AmigaOne-tietokonetta! (Lieneek&ouml; ollut kovin tosissaan. :)</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">13. Aiotko ostaa alkuvuodesta julkaistavan AmigaOne-tietokoneen?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<center>
							<p><img height="141" width="420" src="kuvat/lukijakysely_13.gif" border="0" alt=" "></p>
						</center>
						<p>Useimmat ovat selke&auml;sti odottavalla kannalla. Amigistien pitk&auml;n historian tyhjien lupausten saajana voi aistia t&auml;st&auml;kin vastausjakaumasta:&nbsp;vaikka Amiga onkin monelle mieluinen kone ja moni toivoo tarulle jatkoa, alkaa perusasenne silti olla &quot;uskon kun n&auml;en&quot;, mik&auml; toisaalta voi olla aivan tervett&auml;kin. Ehk&auml;-vastausten osuus on suurin piirtein sama kuin seuraavan kysymyksen &quot;Kyll&auml;, toistaiseksi&quot; -vastausten osuus. Kansainv&auml;lisill&auml; postituslistoilla ja uutisryhmiss&auml; on moni Classic Amigan k&auml;ytt&auml;j&auml; sanonut odottavansa uutta konetta ja k&auml;ytt&auml;v&auml;ns&auml; Classiciaan, kunnes jotain uutta tulee, ja jotain samansuuntaista n&auml;ist&auml;kin vastauksista voisi p&auml;&auml;tell&auml;.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">14. K&auml;yt&auml;tk&ouml; Classic Amigaasi aktiivisesti?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<center>
							<p><img height="141" width="420" src="kuvat/lukijakysely_14.gif" border="0" alt=" "></p>
						</center>
						<p>Yksi kyselyn yll&auml;tt&auml;vimpi&auml; tuloksia; l&auml;hes puolet vastaajista kertoo olevansa vannoutuneita ikuisuuksiin harrastustaan jatkavia amigisteja. Tai ehk&auml;p&auml; palkintojen Amiga-aiheisuus vain rajoitti satunnaisten ohikulkijoiden ja v&auml;hemm&auml;n innokkaiden harrastajien kiinnostusta vastata kyselyyn?</p>
						<p>T&auml;ss&auml; kyselyss&auml; p&auml;&auml;timme j&auml;tt&auml;&auml; vastaajien Classic Amiga -kokoonpanojen ja lis&auml;laitteiden tarkan selvittelyn v&auml;liin, sill&auml; totesimme ettei tilanne liene kovin merkitt&auml;v&auml;sti muuttunut viime lukijakyselyn ja Saku 99:n k&auml;vij&auml;kyselyn mukaisesta. Seuraavassa kyselyss&auml; saattaa kuitenkin olla jo aika toteuttaa j&auml;lleen uusi seuranta, ja mik&auml;li laiteuutiset ja -lupaukset toteutuvat, voi markkinoilla silloin olla monia mielenkiintoisia laitteita ja konekokoonpanoja...</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">15. K&auml;yt&auml;tk&ouml; Classic Amiga -emulaattoria?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<center>
							<p><img height="100" width="420" src="kuvat/lukijakysely_15.gif" border="0" alt=" "></p>
						</center>
						<p>Viime vuosina ovat Amigastaan luopuneet k&auml;ytt&auml;j&auml;t siirtyneet sankoin joukoin jatkamaan harrastustaan emulaattorien &auml;&auml;relle. Useimmille heist&auml; se on tainnut samalla merkit&auml; eroon kasvamista Amiga-yhteis&ouml;st&auml;, mutta niin ei tarvitse olla - kaikki ovat ihan yht&auml; tervetulleita kuin aina ennenkin. Classic-koneiden yll&auml;pito on t&auml;t&auml; nyky&auml; niin paljon aikaa ja vankkaa tietotaitoa vaativa harrastus, ettei sellaisen vaatiminen kaikilta Amigasta pit&auml;vilt&auml; olisi kohtuullista, vai mit&auml;?</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">16. Millainen Internet-yhteys k&auml;yt&ouml;ss&auml;si on?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<center>
							<p><img height="146" width="420" src="kuvat/lukijakysely_16.gif" border="0" alt=" "></p>
						</center>
						<p>Nopeat liittym&auml;t eiv&auml;t viel&auml;k&auml;&auml;n ole levinneet joka niemeen, notkoon ja saarelmaan, mutta kasvuvauhti n&auml;ytt&auml;&auml; hurjalta. Joka nelj&auml;s vastaaja on jo kiinte&auml;n piuhan p&auml;&auml;ss&auml;! Vaikka modeemi on yh&auml; yleisin ratkaisu, on ISDN sent&auml;&auml;n jo aika selv&auml;sti j&auml;&auml;nyt kiinte&auml;n liittym&auml;n jalkoihin. Kiinteill&auml; ilta- ja viikonlopputaksoilla markkinoitu ISDN-yhteys saattaa kuitenkin jatkossa sy&ouml;d&auml; prosentteja modeemien osuudesta.</p>
						<p>Muut-kohdasta l&ouml;ytyi esimerkiksi seuraavia yhteyskeinoja: T3, nettiliittym&auml;(?), &auml;ij&auml;-piuha, kaapelimodeemi, koulu/ty&ouml;/kirjasto.</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Sitkeys palkitaan</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Suuret kiitokset kaikille kyselyyn vastanneille arvokkaasta ja innostavasta osallistumisestanne!
						<p>Vastanneiden kesken arvottiin Virtual GP -romppupeli, jonka voitti Janne Per&auml;aho Oulusta, sek&auml; toisena palkintona Max Rally -levykepeli, jonka voitti Ari Typp&ouml; Oulusta. Palkinnot on postitettu voittajille. Onnea!</p>
						<p>Lopuksi viel&auml; valikoima lukijakyselyyn vastanneiden kirjoittamia lis&auml;kommentteja:</p>
						<ul>
							<li>&quot;M&auml; en itse en&auml;&auml; juuri ole ajan tasalla Amigan tapahtumista, selaan joskus Czech Amiga newsi&auml; ja sfnet.atk.amigaa, joten Sakun pit&auml;s panostaa just tollaseen ku toi tuore Amiga SDK-testi... jaksoin jopa lukea koko jutun duunista k&auml;sin! :)...pelit kiinnostaa ehk&auml; v&auml;hiten, mut se on kai makuasia.&quot;
							<li>&quot;On se tekij&auml;porukan kannalta hyv&auml; ettei sit&auml; levyke-Sakua en&auml;&auml; julkaista, koska sen tekeminen on ollut varmasti raskasta jo esim. 16 v&auml;rin/640x256-tilan rajoitusten takia.&quot;
							<li>&quot;Jipii, kysely! N&auml;it&auml; n&auml;kee ihan liian harvoin, joten enh&auml;n min&auml; malttanut t&auml;st&auml;k&auml;&auml;n pit&auml;&auml; n&auml;ppej&auml;ni erossa kauempaa kuin yhden ty&ouml;p&auml;iv&auml;n verran! :-) Eli ollos hyv&auml;, t&auml;ss&auml; yksi pieni &auml;&auml;ni toivottavasti suuren joukon jatkoksi!&quot;
							<li>&quot;Ihme ett&auml; Saku on viel&auml; hengiss&auml;...&quot;
							<li>&quot;Hyv&auml;&auml; ty&ouml;t&auml; teette Amigan eteen... jatkakaa samaan malliin.&quot;
							<li>&quot;Toivottavasti tarkistusarvontaa ei tarvita. :-)&quot;
							<li>&quot;Kaikkea hyv&auml;&auml; sakulaisille! Odotan jo innolla Saku 2001:t&auml;.&quot;
							<li>&quot;Koska kirjottajien m&auml;&auml;r&auml; selv&auml;sti laskee, tekisi mieli osallistua, mutta kun ei sit&auml; tied&auml; mist&auml;&auml;n mit&auml;&auml;n niin mink&auml;s tekee...&quot;
							<li>&quot;Windows on mammutti, samoin Linux - vaikkakin huomattavasti siedett&auml;v&auml;mpi, mutta toiveena olisi kone (mieluiten Amiga-merkill&auml; varustettu), jonka resurssien ja teknologian k&auml;ytt&ouml; olisi yht&auml; ihailtavasti toteutettu kuin Amiga OS:ss&auml;. Ja kone ei saa olla n&auml;in aataminaikaisen vanhan rajoitteinen kuin PC-teknologia t&auml;n&auml;&auml;n on... Terveisi&auml; toimitukselle ja tsemppi&auml;... emmeh&auml;n ole yksin... :)&quot;
							<li>&quot;e-e-e-e-en-ko-ko-kommentoi&quot;
							<li>&quot;Jeze!!....jatkakaa samaan malliin... :)&quot;
							<li>&quot;Saku rules! Kannattaisiko fonttia suurentaa ja grafiikkaa v&auml;h&auml;n &quot;pehment&auml;&auml;&quot; rauhallisemmaksi = eteerisemm&auml;ksi? :? No, se on makuasia.. Onnea ja mahdollisimman pitk&auml;&auml; jatkoa Sakulle!!! Pit&auml;k&auml;&auml;h&auml;n hauskat Amiga-pikkujoulut, olette sen ansainneet. :-P&quot;
							<li>&quot;Ehk&auml; noista vastauksista saa sellaisen kuvan ettei paljoakaan kiinnostaisi mutta min&auml; vaan olen t&auml;mm&ouml;inen hiljaisempi sielu jolla on ollut (ja tulee olemaan) Amiga jo pitk&auml;&auml;n. Itse asiassa aika montakin (500, 2000, 1200). A4000 pit&auml;s saada.. Ei kai t&auml;ss&auml; muuta.&quot;
							<li>&quot;Ohjelmointis&auml;l&auml;&auml;, jos joku vaan viittis kirjottaa. :) Saku rulettaa.&quot;
							<li>&quot;Olisi kiva jos Sakussa olisi juttuja aiheesta Amiga ja kuvank&auml;sittely, esim. ImageFX:st&auml;.&quot;
							<li>&quot;Lehdess&auml; tulee sitten varmasti valitusta siit&auml; ett&auml; min&auml;kin laitoin rastin artikkelin kirjoituksen kohdalle, ja sitten ei mit&auml;&auml;n juttuja vaan kuulu. Ei sit&auml; aikaa vaan tahdo l&ouml;yty&auml;, eik&auml; motivaatiota/inspiraatiota jutun viimeistelyyn.. Heimo Laukkanen kirjoitteli joskus hyvi&auml; juttuja yhteiskunnasta yms. T&auml;m&auml;ntyyppisi&auml; juttuja lukisin mielest&auml;ni Sakusta (tietoyhteiskunta jne. jne.). Sakussahan keskustelu ei nimitt&auml;in ollut mit&auml;&auml;n paskanjauhantaa, kuten se t&auml;llaisista asioista keskusteltaessa yleens&auml; on. Tilannehan muuttuu kun kirjoittaja ei esitt&auml;ydy alan asiantuntijana, joka toteaa muutamia itsest&auml;&auml;nselvyyksi&auml;, vaan tavallisena henkil&ouml;n&auml;, joka esitt&auml;&auml; mielipiteens&auml; asiantuntevasti pohtien asian tilaa ja ennen kaikkea asiasta k&auml;yt&auml;v&auml;&auml; keskustelua. Mit&auml; yrit&auml;n selitt&auml;&auml;? Oivalluksellinen teksti on loistavaa luettavaa. On hyv&auml; kun kirjoittaja osaa perustella oivalluksen.&quot;
							<li>&quot;Tuetaan Amigaa kun se on mahdollista. Ainakin laitejuttuja on kiva lukea 'kansanomaistettuna' suomeksi; ovat muuten v&auml;h&auml;n turhan ylimenev&auml;&auml; teksti&auml; netist&auml; haettuna. Mieluusti kokemuksia PCI:st&auml;; ohjelmien/n&auml;ytt&ouml;korttien yhteensopivuus yms.&quot;
							<li>&quot;Sir&eacute;nin Jyrki-visiitti oli cool juttu!!!&quot;
							<li>&quot;HYV&Auml;!! Jatkakaa samaa rataa :)&quot;
							<li>&quot;Kyselyihin on aina kiva vastata. Joku voisi mielest&auml;ni kirjoittaa artikkelin aiheesta artikkelin tekeminen Sakuun... Miten on, haluttaisiinko Saku-lehteen runoja? Jatkuvasti tai v&auml;lillisesti, voisin l&auml;hett&auml;&auml;, jos kiinnostusta on...&quot;<br>
							<i>[No mik&auml; ettei! Sakun pitk&auml;t perinteet my&ouml;s ruumiin ja mielen virkist&auml;j&auml;n&auml; kaipaavat jatkoa. Ruokaohjeiden, juomavinkkien ja Saku Trekien jatkoksi sopisivat runot aivan mainiosti pienin&auml; kerta-annoksina. - P&auml;&auml;toimittaja] </i>
							<li>&quot;Ei muuta kuin tsemppi&auml;!!! Hyv&auml;&auml; ty&ouml;t&auml;.&quot;
							<li>&quot;J&auml;rjest&auml;k&auml;&auml; sellainen kysely/kilpailu web-sivullanne, jossa k&auml;ytt&auml;j&auml;t esittelee omia konekokoonpanojaan kuvien kera.&quot;
							<li>&quot;Yll&auml;tyin kun huomasin ett&auml; Saku on saatavilla my&ouml;s Zipiss&auml;, satuin olemaan Winill&auml; verkossa kun Sakun ilmestymisest&auml; kuulin. T&auml;m&auml; on ihan upea nyt vaikka katsookin 'v&auml;&auml;r&auml;ss&auml; koneessa'.&quot;
							<li>&quot;Uutta Sakua aina odottaa innolla :)&quot;
							<li>&quot;Mielest&auml;ni Saku-poppoo tekee todella arvokasta ty&ouml;t&auml; Amigan ja jopa itse tietotekniikan hyv&auml;ksi, kiitos siit&auml;!&quot;
							<li>&quot;Jatkakaa korvaamattoman arvokasta toimintaanne samaan malliin. Levyke-Sakun loppuminen oli kyll&auml; s&auml;&auml;li...&quot;
							<li>&quot;Toivottavasti vuodelle 2001 saadaan j&auml;rjestetty&auml; Suomeen taas jokin Amiga-tapahtuma. Lis&auml;ksi Saku voisi ehk&auml; olla enemm&auml;n esill&auml; esim. scene-tapahtumissa tms.&quot;
							<li>&quot;Parasta ei voi enemp&auml;&auml; kehua!&quot;
							<li>&quot;Hyv&auml;&auml; ty&ouml;t&auml; alusta asti. On aivan loistavaa, ett&auml; tietokonemaailmassa on viel&auml; jokin paikka, joka ei ole pelkk&auml;&auml; Linuhjaketta ja Windossia, tai noiden kahden sotimista. Saku on pelk&auml;ll&auml; olemassaolollaan ollut t&auml;rke&auml; tekij&auml; amigistien keskuudessa, vaikkei jokainen sit&auml; ehtisi aina edes lukea. Toivottavasti Sakua riitt&auml;&auml; v&auml;hint&auml;&auml;n yht&auml; pitk&auml;lle kuin A3000:ssani toimivia piirej&auml;...&quot;
							<li>&quot;poksista rallalla pit&auml;k&auml;&auml; lippu korkeella&quot;
							<li>&quot;Lopussa kiitos seisoo. Niin nytkin: kiitos.&quot;
						</ul>
					</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. on monivaiheisen historiansa aikana j&auml;rjest&auml;nyt useita erilaisia kyselyit&auml; kartoittaakseen Suomen Amiga-k&auml;ytt&auml;jien tilannetta ja toiveita. Lis&auml;&auml; n&auml;ist&auml; historiallisista kyselyist&auml; voitte lukea n&auml;ist&auml; Saku-lehden numeroista:
						<p>
						<table border="0" cellpadding="0" cellspacing="2">
							<tr>
								<td valign="top">Saku #8 (4/94)</td>
								<td valign="top">- Ensimm&auml;inen lukijakysely</td>
							</tr>
							<tr>
								<td valign="top">Saku #9 (5/94)</td>
								<td valign="top">- Ensimm&auml;isen lukijakyselyn tulokset (vastanneita 77)</td>
							</tr>
							<tr>
								<td valign="top">Saku #12 (3/95)</td>
								<td valign="top">- Toinen lukijakysely</td>
							</tr>
							<tr>
								<td valign="top">Saku #13 (4/95)</td>
								<td valign="top">- Toinen lukijakysely (toistoa)</td>
							</tr>
							<tr>
								<td valign="top">Saku #14 (5/95)</td>
								<td valign="top">- Toisen lukijakyselyn tulokset (vastanneita 142)</td>
							</tr>
							<tr>
								<td valign="top">Saku #23 (4/97)</td>
								<td valign="top">- Saku 97 -vierailijakyselyn tulokset (vastanneita 61)</td>
							</tr>
							<tr>
								<td valign="top">Saku #25 (2/98)</td>
								<td valign="top">- Saku 98 -vierailijakyselyn tulokset (vastanneita 210)</td>
							</tr>
							<tr>
								<td valign="top">Saku #27 (1/99)</td>
								<td valign="top">- Pikkujoulujen vierailijakyselyn tulokset (vastanneita 23)</td>
							</tr>
							<tr>
								<td valign="top">Saku #29 (3/99)</td>
								<td valign="top">- Kolmas lukijakysely</td>
							</tr>
							<tr>
								<td valign="top">Saku #30 (4/99)</td>
								<td valign="top">- Kolmannen lukijakyselyn tulokset (vastanneita 297)</td>
							</tr>
							<tr>
								<td valign="top">Saku #30 (4/99)</td>
								<td valign="top">- Saku 99 -vierailijakyselyn tulokset (vastanneita 227)</td>
							</tr>
							<tr>
								<td valign="top">Saku #34 (4/2000)</td>
								<td valign="top">- Nelj&auml;s lukijakysely</td>
							</tr>
							<tr>
								<td valign="top">Saku #35 (1/2001)</td>
								<td valign="top">- Nelj&auml;nnen lukijakyselyn tulokset (vastanneita 169)</td>
							</tr>
						</table>
					</td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
