<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Zwischenruf.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Neues zum AmigaNG
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Neues zum AmigaNG</H1>
<H2>1. Eyetech k&uuml;ndigt weitere AmigaOne-Version inkl. Upgrade-M&ouml;glichkeit an</H2>
<P><B>Eyetech (<A HREF="http://www.eyetech.co.uk" TARGET="_top">http://www.eyetech.co.uk</A>) informiert:</B></P>
<P><B>&raquo;AmigaOne Update</B></P>
<P><B>Der AmigaOneG3-SE</B></P>
<P>
Das erste Modell in unserer AmigaOne-Reihe ist der AmigaOneG3-SE.
</P>
<P>
Tats&auml;chlich wird dies ein 600-MHz-G3-Amiga mit eingebauten 10/100-Ethernet-
Anschluss, USB- sowie PCI/AGP-Schnittstellen und Speicher-Steckpl&auml;tzen f&uuml;r
bis zu 2 GB SDRAM sein. Er wird um ein Vielfaches leistungsf&auml;higer und (f&uuml;r
UKP350/USD500/Euro600*) nur etwa halb so teuer sein wie der bisher
schnellste Amiga-Beschleuniger (der phase 5 Cyberstorm PPC604/240MHz).
</P>
<P>
Tats&auml;chlich kann man den AmigaOneG3-SE ansehen als einen
Hochleistungsbeschleuniger, der mit einem gratis eingebauten Computer
geliefert wird! Das bedeutet, dass man nicht l&auml;nger einen angeh&auml;ngten A1200
oder ein spezielles Tower-Geh&auml;use braucht, wenn man nur &quot;retargetable&quot;
(also nicht auf die Amiga-Chips&auml;tze bestehende; Anm. d. &Uuml;bersetzers)
Anwendungen laufen lassen will. (F&uuml;r Programme, die auf die alte Hardware
zugreifen, wird eine PCI-Interface-Karte von Escena zur Verf&uuml;gung stehen,
mit der man ein Amiga-1200-Motherboard mit dem A1G3-SE verbinden kann.) Der
A1G3-SE enth&auml;lt auch eine volle Ausstattung mit angepassten
Betriebsmitteln, und zus&auml;tzlich zum neuen PPC-only-OS4 k&ouml;nnen PPC-Linux
(und PPC-UAE) nativ darauf laufen.
</P>
<P>
Der AmigaOneG3-SE wird an Endkunden erst ausgeliefert werden, wenn das OS4
fertig ist, aber die Computerplatinen werden von OS4-Entwicklern und
Betatestern schon ben&uuml;tzt. AMIGA, Inc., Hyperion und auch wir haben
entschieden, das OS4 gemeinsam mit den Platinen als Paket an die H&auml;ndler
auszuliefern, haupts&auml;chlich, um Liefer- und Bearbeitungskosten zu senken -
und dadurch haben wir eine kleine Preisreduzierung f&uuml;r den Endkunden
erreicht, n&auml;mlich A1G3-SE + OS4 im Paket f&uuml;r 382.94* britische Pfund. Auch
f&uuml;r die Dollar- und Euro-Preise treten gleichwertige Erm&auml;&szlig;igungen ein, das
Paket f&uuml;r 550 US-Dollar oder 652.50 Euro.
</P>
<P>
Schlie&szlig;lich ist es wichtig zu bedenken, dass der AmigaOneG3-SE von AMIGA,
Inc. eine vollst&auml;ndige Qualit&auml;tssicherung und die Lizenzierung erhielt, um
darauf OS4 zu betreiben, wobei alle Lizenzgeb&uuml;hren und -abgaben bezahlt
sind. Die Lizenzbedingungen von AI geben auch vor, dass alle
Computerplatinen, auf denen OS4 laufen kann, mit einer OEM-Version des OS4
ausgeliefert werden und einen eingebauten Hardware-Schutzmechanismus
besitzen m&uuml;ssen, um die OS4-Piraterie auf ein Minimum zu beschr&auml;nken, und
dieser Schutzmechanismus wurde im AmigaOneG3-SE von Beginn an eingeplant
und eingebaut.
</P>
<P>
Eine Liste von H&auml;ndlern, die schon Demonstrations/Kennenlern-Platinen
bestellt haben, ist auf unserer Website
(<A HREF="http://www.eyetech.co.uk/amigaone/dealers.php" TARGET="_top">http://www.eyetech.co.uk/amigaone/dealers.php</A>) zu finden. Wundern Sie sich
nicht, wenn ihr bevorzugter H&auml;ndler nicht dabei ist - einige haben den
Bestelltermin verpasst, andere wollen warten, bis die endg&uuml;ltigen Platinen
und das OS4 geliefert werden k&ouml;nnen. Diese H&auml;ndler werden der Liste
hinzugef&uuml;gt, wenn sie die Endverbraucher-Platinen bei uns bestellen.
</P>
<P>
Obwohl wir den A1G3-SE in der Werbung als Einstiegsmaschine bezeichnen,
haben wir keine Zweifel daran, dass er mit installiertem OS4 tats&auml;chlich
&quot;fliegen&quot; wird. Die 600MHz-CPU 750CXe, die mit ihm ausgeliefert wird, ist
wirklich die schnellste G3-CPU, die allgemein erh&auml;ltlich ist, und einige
Fachleute erwarten, dass ihre Leistung Anwendungen mehrere hundertmal
schneller laufen l&auml;sst, als dies mit einem 030/50 m&ouml;glich ist.
</P>
<P><B>Planung f&uuml;r den n&auml;chsten AmigaOne - der AmigaOne-XE</B></P>
<P>
Wir haben immer gesagt, dass der AmigaOneG3-SE die erste, die
Einstiegslevel-Computerplatine, in einer Reihe von AmigaOne-Platinen sein
soll, die wir in der Produkt-Planung haben. Wir wurden von vielen Seiten
gebeten, darzulegen, was wir f&uuml;r die sp&auml;teren Platinen dieser Serie
vorgesehen haben. Hier sollen Sie einen Vorgeschmack bekommen!
</P>
<P>
Die n&auml;chste AmigaOne-Platine in der Planung ist f&uuml;r ein h&ouml;heres
Marktsegment (das hei&szlig;t flexibler, aber auch teurer) vorgesehen. Weitere
Einzelheiten werden hier und in der AmigaOne-Mailinglist bei Yahoogroups zu
gegebener Zeit ver&ouml;ffentlicht werden (aber nicht fr&uuml;her!).
</P>
<P>
Eine der Hauptforderungen ist es, ein gesockeltes CPU-Modul vorzusehen,
damit Leistungsverbesserungen durch den Benutzer ausgef&uuml;hrt werden k&ouml;nnen,
wenn schnellere und komplexere Chips - und Betriebssystem-Erweiterungen,
die sie anwenden k&ouml;nnen - zur Verf&uuml;gung stehen. Unsere Ingenieure glauben
nicht, dass der Intel-Slot-1-Sockel (wie f&uuml;r den originalen AmigaOne-1200
vorgesehen) wirklich geeignet ist, aufgrund der Notwendigkeit, Leiterbahnen
zwischen CPU und SD-RAM-Speicher bei h&ouml;heren Taktraten so kurz wie m&ouml;glich
zu halten. Au&szlig;erdem sind sowohl der Intel-Slot-1-Sockel wie auch der Apple-
ZIF-CPU-Sockel inzwischen veraltet und sind deshalb f&uuml;r ein Produkt in
Planung keine geeignete Wahl.
</P>
<P>
Deshalb haben wir uns f&uuml;r die n&auml;chste Version des AmigaOne, den AmigaOne-
XE, die neueste CPU-Sockel-Technologie von Apple ausgeborgt, den
zweckbezogenen 'Megarray'-Sockel. Das bedeutet, dass wir preisg&uuml;nstige, eng
gekoppelte CPU-Module, die jeweils die Technologien der G3, G4, Dual-G4
(und m&ouml;glicherweise G5 - aber Informationen &uuml;ber den G5 sind noch sehr
mager) f&uuml;r den Einsatz auf der gleichen AmigaOne-XE-Platine benutzen
k&ouml;nnen. Erh&ouml;hung der CPU-Leistung erfolgt damit einfach durch Modulwechsel.
Die gesockelte Prototyp-Platine f&uuml;r den AmigaOne-XE und die zugeh&ouml;rigen
Steckmodule f&uuml;r G3 und G4 wurden schon gebaut und gepr&uuml;ft. Aber ehe sie
jetzt losrennen und ihren AmigaOneG3-SE-Auftrag stornieren, um statt dessen
den AmigaOne-XE zu kaufen, denken Sie daran, dass diese Extra-Flexibilit&auml;t
ihren Preis haben wird, und bis OS4 den Altivec-Coprozessor des G4
unterst&uuml;tzt, wird es kaum eine wesentliche Leistungsverbesserung geben.
Au&szlig;erdem sind zur Zeit, wenn Sie nicht Apple selbst sind, f&uuml;r Sie G4-CPUs
sehr knapp, und das bedeutet, dass noch mehrere Monate vergehen werden,
bevor jemand anderes als Apple sie zu einem vern&uuml;nftigen Preis bekommen
wird. Im Augenblick liegt die Preisvorstellung f&uuml;r die AmigaOne-XE-Platine
mit einem Einzel-G4-700MHz-Modul ungef&auml;hr UKP200/USD300/Euro350* &uuml;ber dem
Preis f&uuml;r den AmigaOneG3-SE - m&ouml;glicherweise weniger, falls Apples Bedarf
sich bedeutend verringert, sobald der G5 ausgeliefert wird.
</P>
<P>
Bedeutet das, Sie sollten Ihren bestehenden Auftrag f&uuml;r einen AmigaOne-G3
stornieren und noch ein paar Monate abwarten? Aber nein! Wir erwarten einen
recht hohen Wiederverkaufswert f&uuml;r gebrauchte AmigaOneG3-SE-Platinen, aber
um die Unsicherheit aus diesem Prozess zu nehmen, unterschreiben wir und
die meisten der anderen AmigaOne-H&auml;ndler einen R&uuml;cknahmevertrag f&uuml;r Ihren
AmigaOneG3-SE in einem Zeitraum von 6 bis 12 Monaten nach dem Kauf, wenn
Sie einen neuen AmigaOne-XE mit Einzel-G4-CPU-Modul kaufen (es bleibt Ihnen
nat&uuml;rlich unbenommen, die Platine privat zu einem h&ouml;heren Preis zu
verkaufen).
</P>
<P>
Dieser R&uuml;ckkauf wird erfolgen zu 75% des g&uuml;ltigen Einzelhandelspreises
eines A1G3-SE sechs Monate nach dem Kauf und f&auml;llt je Monat um 1% auf 69%
nach zw&ouml;lf Monaten nach Kauf. Die Platine muss an den H&auml;ndler, der sie
verkauft hat, durch den urspr&uuml;nglichen K&auml;ufer zur&uuml;ck gegeben werden, sie
muss voll betriebsf&auml;hig sein, und sie muss als Teilzahlung f&uuml;r einen
AmigaOne-XE mit Einzel-G4-CPU-Modul verwendet werden. Die einzelnen H&auml;ndler
k&ouml;nnen auch ihre eigenen Umtauschbedingungen festlegen, deshalb pr&uuml;fen Sie
das bitte bei Ihrem ersten Einkauf. Schlie&szlig;lich gilt dieses Angebot nicht
zusammen mit irgendeinem anderen Rabattangebot, wie es zum Beispiel bei den
A1G3-SE-Entwicklerplatinen zum Tragen kam. Wenn Sie unschl&uuml;ssig waren, ob
Sie einen A1G3-SE kaufen oder lieber auf einen aufr&uuml;stbaren G4-AmigaOne
warten sollten, k&ouml;nnen Sie nun das Beste beider Welten haben. Bestellen Sie
jetzt einen neuen, billigen A1G3-SE und r&uuml;sten Sie innerhalb von 12 Monaten
auf. Auf was warten Sie noch?
</P>
<P>* Angegebene Preise sind ausschlie&szlig;lich &ouml;rtlicher Steuern und
Lieferkosten.&laquo;</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Zwischenruf.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
