<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Schluss.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Diverse Amiga-News
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>2. Neuigkeiten von IOSPIRIT</H2>
<P><B>IOSPIRIT (<A HREF="http://www.iospirit.de" TARGET="_top">http://www.iospirit.de</A>) informiert:</B></P>
<H3>&raquo;15.05.2002 fxSCAN 4.0 mit stark verbesserter OCR-Engine und PDF-Export</H3>
<P>
Es freut uns, Ihnen Version 4.0 unserer m&auml;chtigen Scannersuite fxSCAN
ank&uuml;ndigen zu k&ouml;nnen.
</P>
<P>
Zu den zahlreichen Neuerungen z&auml;hlen unter anderem eine stark
verbesserte und beschleunigte OCR-Engine (basierend auf gocr 0.3.5,
jetzt auch PPC-nativ und mit der M&ouml;glichkeit zum HTML-Export mit
Bildern), der neu hinzugekommene PDF-Export, eine verbesserte
Kopierfunktion mit Vorschau und Korrekturm&ouml;glichkeiten, Unterst&uuml;tzung
f&uuml;r Turboprint® sowie eine komplett neue, bebilderte Dokumentation
(auf Deutsch und Englisch) in einer HTML- und PDF-Version.
</P>
<P>
Eine detailierte Liste aller Neuerungen, erste Screenshots, eine Liste
der unterst&uuml;tzten Scanner und vieles mehr finden Sie auf der fxSCAN-
Homepage (<A HREF="http://www.iospirit.de/fxscan/" TARGET="_top">http://www.iospirit.de/fxscan/</A>).
</P>
<P>
fxSCAN 4.0 ist ab Ende Juni auf CD-ROM und als Downloadversion
verf&uuml;gbar und kann ab sofort &uuml;ber unsere Website vorbestellt werden!
Geh&ouml;ren Sie zu den Ersten, die dieses aufregende Produkt in H&auml;nden
halten! Die Abrechnung von Kreditkartenbetr&auml;gen findet erst kurz vor
Auslieferung statt.&laquo;
</P>
<H3>&raquo;27.05.2002 Scannen wie die Profis! Kalibrationstargets f&uuml;r fxSCAN 4.0 und ICS</H3>
<P>
Ab sofort k&ouml;nnen Sie professionelle Kalibrationstargets zum absoluten
Kn&uuml;llerpreis bestellen, die zusammen mit fxSCAN 4.0 und dem
Kalibrationssystem ICS f&uuml;r beste Scanergebnisse sorgen.
</P>
<P>
Dieses hochqualitative Target aus dem Profibereich erm&ouml;glicht Ihnen
beste Ergebnisse mit Ihrem Scanner und der im Lieferumfang von fxSCAN
enthaltenen Kalibrationssoftware ICS von Wolf Faust.
</P>
<P>
Und dabei ist es auch noch ganz einfach einzusetzen! Scannen Sie einfach
das Target mit Ihrem Scanner ein und lassen Sie vom Ergebnis ein Profil
durch ICS erstellen. Von nun an k&ouml;nnen Sie mit dem ICS-Filter in fxSCAN
automatisiert ein optimiertes Ergebnis erzielen! Dieses kommt der
Vorlage sehr nahe und ist meist nicht davon zu unterscheiden!
</P>
<UL>
<LI> Gnadenlos g&uuml;nstig trotz Topqualit&auml;t!
</LI>
<BR><LI> Entspricht dem IT 8.7/2 und ISO 12641 Standard.
</LI>
<BR><LI> Hoher Farbumfang.
</LI>
<BR><LI> Gedruckt auf hochwertigen Kodak(R) Professional Papier.
</LI>
<BR><LI> Erf&uuml;llt die vom Standard geforderten Fehlergrenzen. Gefordert werden
  Abweichungen von maximal dE 5 f&uuml;r Referenzdateien und maximal dE 2 von
  CIE Lab f&uuml;r Calibrated Targets. Dieses Target erreicht in der
  Produktion einen mittleren Wert von dE 0,3!!
</LI>
<BR><LI> zus&auml;tzliche Referenzdateien f&uuml;r Scanner mit hellem Bildhintergrund im
  Lieferumfang. Der Standard fordert nur Referenzdateien f&uuml;r schwarzen
  Hintergrund.
</LI>
<BR><LI> Ideal und empfohlen auch f&uuml;r Besitzer &auml;lterer Targets, die eventuell
  nach Jahren Farbfehler aufweisen k&ouml;nnen!&laquo;
</LI>
</UL>
<H3>&raquo;29.05.2002 IOSPIRIT bringt USB-Scanner auf den AMIGA®!</H3>
<P>
Im Zuge der rasanten Weiterentwicklung von fxSCAN 4.0 wird es mit
Erscheinen der neuen Version nun auch m&ouml;glich sein, aktuelle,
preislich und technisch sehr interessante USB Scanner am AMIGA zu
betreiben!
</P>
<P>
Die dazu n&ouml;tigen Treiber werden mit Erscheinen von fxSCAN im &quot;IOUSB
Scanner Package&quot; (IOUSB SP) verf&uuml;gbar gemacht werden. Durch Nutzung
der IOUSB Technolgie wird es m&ouml;glich sein, die Treiber sowohl mit dem
Poseidon Stack (Highway®, Subway®, MorphOS) als auch mit dem Stack von
AmigaOS® 4.0 zu nutzen.
</P>
<P>
Als Erstes werden Modelle der Firma Epson® unterst&uuml;tzt. Welche Ger&auml;te
genau, entnehmen Sie bitte der USB Scannerliste auf den fxSCAN- oder
IOUSB SP-Unterseiten.
</P>
<P>
++ Sonderaktion! ++ Sonderaktion! ++
Alle Vorbesteller von fxSCAN 4.0 (egal ob Update oder Vollversion)
erhalten das IOUSB Scanner Package gratis dazu!! Jetzt vorbestellen
und 10 EUR sparen!! Die Sonderaktion gilt automatisch auch f&uuml;r alle
schon existierenen Vorbestellungen!
++ Sonderaktion! ++ Sonderaktion! ++
</P>
<P>
Au&szlig;erdem unterst&uuml;tzt fxSCAN 4.0 nun bei Verwendung von
Betascan-Treibern auch eventuell von diesen unterst&uuml;tzte,
scannerspezifische Einstellungen wie Scanquelle (z.B.
Durchlichtaufsatz oder automatischer Dokumenteneinzug) und
scannerinterne Kontrast-, Helligkeit-, Gamma- und
Schwarzwei&szlig;muster-Werte. Des weiteren wird nun auch PNG als
Speicherformat unterst&uuml;tzt.
</P>
<P>
Neue Bildschirmfotos und eine aktualisierte &quot;NEU in V4!&quot;-Liste finden
Sie auf den fxSCAN-Unterseiten.
</P>
<P>
Die Auslieferung von fxSCAN 4.0 kann sich aufgrund der Neuerungen und
dadurch notwendigen Tests um maximal (wenn &uuml;berhaupt!) zwei Wochen
nach hinten verschieben. fxSCAN wird also sp&auml;testens in der ersten
Juli-H&auml;lfte ausgeliefert. Vielen Dank f&uuml;r Ihr Verst&auml;ndnis!&laquo;
</P>
<P>
&raquo;IOSPIRIT Felix Schwarz<BR>
Am Gr&uuml;ndla 3<BR>
D-91074 Herzogenaurach<BR>
Germany<BR>
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">EMail:&nbsp;</TD><TD VALIGN="TOP"><A HREF="mailto:info@iospirit.de">info@iospirit.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">WWW:&nbsp;</TD><TD VALIGN="TOP"><A HREF="http://www.iospirit.de/" TARGET="_top">http://www.iospirit.de/</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Phone:&nbsp;</TD><TD VALIGN="TOP">+(0)049 (0)9132/732844&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Fax:&nbsp;</TD><TD VALIGN="TOP">+(0)049 (0)9132/732843&laquo;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P ALIGN="RIGHT">
<A HREF="Diverses1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Schluss.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
