<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Diverse Amiga-News
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Diverse Amiga-News</H1>
<H2>1. Neuigkeiten von der Amiga Arena</H2>
<P><B>Amiga Arena (<A HREF="http://online-club.de/~ARENA/" TARGET="_top">http://online-club.de/~ARENA/</A>) informiert:</B></P>
<P><B>&raquo;*Amiga Arena - Interview mit &quot;Stefan Kost&quot;*</B></P>
<P>
Das der Amiga f&uuml;r Musiker immer noch von Interresse ist,zeigen die
zahlreichen Programme die heute noch gepflegt und weiter entwickelt werden.
Mit &quot;Sound FX&quot; steht dem Musikbegeisterten Anwender,eines der wenigen,noch
verf&uuml;gbaren und stetig in Entwicklung befindlichen Sharware Programm zur
Verf&uuml;gung.
</P>
<P>
&quot;Sound FX&quot; bietet gerade f&uuml;r experimentierfreudige Anwender eine vielzahl
von m&ouml;glichkeiten um Sounds Nachzubearbeiten,mit Effekten zu versehen und
das Speichern in verschiedene Dateiformate.
</P>
<P>
&quot;Stefan Kost&quot; sprach mit der Amiga Arena &uuml;ber die Version 4.2, die bald
erscheinen wird und welchen Weg &quot;SoundFX&quot; in Zukunft gehen wird.&laquo;
</P>
<P><B>&raquo;*Amiga Arena - Vollversion &quot;LOG!C&quot;*</B></P>
<P>
Mit der Genehmigung von &quot;Jochen Heizmann&quot;, ([<A HREF="http://heizmann.mp3recordz.de" TARGET="_top">http://heizmann.mp3recordz.de</A>] -
Homepage) einigen von Euch bekannt von Spielen wie Samba Partie,Flyin
High,T-Zero oder Space Station 3000 zu denen er die Musik geschrieben
hat,erm&ouml;glich die &quot;Amiga Arena&quot; die Freigabe des Puzzel / Mind Spieles
&quot;LOG!C&quot;.
</P>
<P>
Das Spielfeld von &quot;LOG!C&quot; besteht aus einem 14*14 Feld.
Am rechten Rand erscheinen Steine in einem 3*3 Feld.
</P>
<P>
Der jeweilige Spieler mu&szlig; versuchen dieses Feld auf dem gro&szlig;en Feld
nachzubauen und gleichzeitig versuchen, da&szlig; dies dem Gegner nicht gelingt.
Sind alle Steine verbraucht,ist die Zeit abgelaufen oder sind keine Figuren
mehr m&ouml;glich, so wird das Spiel abgebrochen und der Gewinner ermittelt.
Das Spiel wurde von APC/TCP vertrieben und besonderen Dank an Andreas
Magerl der die Vollversion zur Verf&uuml;gung gestellt hat.
</P>
<P>
Das Spielprinzip macht einfach Spass und vielleicht setzt jemand das Spiel
mit Zeitgem&auml;sser Grafik neu um!&laquo;
</P>
<P><B>&raquo;*Amiga Arena - Interview mit &quot;Marius Schwarz&quot;*</B></P>
<P>
Mit &quot;BenderIRC&quot; erschien vor kurzem ein neuer IRC Client,der durch eine
frei gestaltbare Oberfl&auml;che und einem Plugin System,sich schon seit dem
ersten Release,von seinen Konkurrenten &quot;AmIRC&quot; und &quot;BlackIRC&quot; abhebt.
&quot;Marius Schwarz&quot; alias &quot;Cyborg&quot; sprach mit der &quot;Amiga Arena&quot; wie es zu der
Entwicklung von &quot;BenderIRC&quot; kam,&uuml;ber IRC Kan&auml;le,Amiga und  was Wir in
Zukunft noch erwarten d&uuml;rfen!
*Amiga Arena Kommentar:*
Ich habe zum Teil die Kommentare in Bezug auf &quot;BenderIRC&quot; in den Foren
gelesen und m&ouml;chte an Euch appelieren,das es letzendlich an uns liegt wie
sich neue Programme weiter entwickeln!
Programmierer sind auf Bug Reports und Verbesserungsvorschl&auml;ge angewiesen!
Die k&ouml;nnen nur Wir,die Anwender geben.
</P>
<P>
Wer Spass oder Interresse an einem Programm hat sollte dies mit einer
kleinen Mail gerne dem Entwickler mitteilen,denn sonst    kann es ganz
schnell passieren das aufgrund mangelnder Resonanz, Software eingestellt
wird.
</P>
<P>
Verfallt bitte nicht den Trugschluss,es w&uuml;rde schon jemand anderes Feedback
geben,dazu ist der Amiga Entwickler Kreis einfach zu klein um das Wir uns
das Erlauben k&ouml;nnen.
</P>
<P>Olaf K. - Amiga Arena&laquo;</P>
<P><B>&raquo;*Amiga Arena - Interview mit &quot;Mauro Fontana&quot;*</B></P>
<P>
&quot;Back from dead&quot; - &quot;Mauro Fontana&quot; haucht dem schon l&auml;ngst totgelaubten
Editor &quot;BlacksEditor&quot; wieder Leben ein!
&quot;BlacksEditor&quot; seinerzeit von &quot;Marco Negri&quot; entwickelt und als Shareware
vertrieben wurde sp&auml;ter von &quot;Paul Schifferer&quot; weiter entwickelt und ist
seit dem &quot;BlacksEditor Upgrade Pack 1&quot; von &quot;Mauro Fontana&quot; Cardware.
&quot;BlacksEditor&quot; d&uuml;rfte mit zu den besten Editoren geh&ouml;ren und die &quot;Amiga
Arena&quot; f&uuml;hrte ein sehr ausf&uuml;hrliches Interview mit dem jetzigen Entwickler
&quot;Mauro Fontana&quot;.
</P>
<P>
Einmal mehr liegt es an den Anwendern,in wie weit &quot;BlacksEditor&quot; mit neuen
features aufwarten kann und ob wir in Zukunft ein weiteres &quot;piece of
Software&quot; den Amiga bereichert!&laquo;
</P>
<P><B>&raquo;*Amiga Arena - Interview mit &quot;Mark Reynolds&quot;*</B></P>
<P>
Neben &quot;BlacksEditor&quot; (Siehe Interview mit Mauro Fontana)
wurde vor kurzem im Aminet genau so &Uuml;berraschend,der
bis dato,sehr gute  &quot;Gravity Force&quot; Clone &quot;Roketz&quot; in der Vollversion frei
gegeben und auch &quot;Roketz&quot; soll in Zukunft weiter Entwickelt werden!
Die &quot;Amiga Arena&quot; sprach mit &quot;Mauro Fontana&quot; &uuml;ber die Vergangenheit und
Zukunft von &quot;Roketz&quot;!
</P>
<P><B>*In Eigener Sache:*</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Bei den Interviews der &quot;Amiga Arena&quot;&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">handelt es sich nicht mehr um die&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Standartfragen, die in der Vergangenheit ver&ouml;ffentlicht wurden.&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Nachdem die Interview Serie unter Kritik stand,wurden alle Interviews seit
Mai &Uuml;berarbeitet und Individuell gef&uuml;hrt!&laquo;
</P>
<P><B>&raquo;*Amiga Arena - Vollversion &quot;DangerDogg&quot;*</B></P>
<P>
Mit &quot;DangerDogg&quot; liegt ein weiteres Sharware Spiel von &quot;Jochen Heizmann&quot;
zum Download bereit.
</P>
<P>
Bei &quot;DangerDogg&quot; handelt es sich um ein &quot;Jump n Run&quot; im klassischen stiel.
Das Spiel wurde vom APC/TCP vertrieben und besonderen Dank an Andreas
Magerl der die Vollversion zur Verf&uuml;gung gestellt hat.&laquo;
</P>
<P><B>&raquo;*Amiga Arena - Interview mit &quot;Jah&quot; (AmiSAT)*</B></P>
<P>
Hinter dem Namen &quot;Jah&quot; verbirgt sich der Entwickler von &quot;AmiSAt&quot;.
AmiSAT ist die Amiga-Portierung von OpenAG, welches ein Open Source
Audiogalaxy-Client ist.
</P>
<P>
Im Interview mit der &quot;Amiga Arena&quot; spricht &quot;Jah&quot; &uuml;ber zuk&uuml;nftige
Versionen,welches OS er unterst&uuml;zen wird und wie er die Zukunft sieht.&laquo;
</P>
<P><B>&raquo;*Amiga Arena - Interview mit &quot;Felix Schwarz&quot; (IOSPIRIT)*</B></P>
<P>
Nachdem es im letzten Jahr um die Softwareschmiede &quot;Innovative&quot; etwas ruhig
geworden war, &uuml;berraschte es umso mehr,das der Chef Entwickler &quot;Felix
Schwarz&quot; im April diesen Jahres sich mit seinem neu gegr&uuml;ndetem Unternehmen
&quot;IOSPIRIT&quot; und neuen Software Produkten erfreulicher Weise zur&uuml;ckmeldete!
Sollte sich hier eine Trendwende am so geschw&auml;schten bez. brach liegendem
Amiga Markt abzeichnen?
Im Interview mit der &quot;Amiga Arena&quot; spricht &quot;Felix Schwarz&quot; &uuml;ber seine
Beweggr&uuml;nde weiterhin f&uuml;r den Amiga zu entwickeln,&uuml;ber seine neuen Software
Produkte so wie weitere neu Entwicklungen.
</P>
<P>
Desweiteren wie er f&uuml;r sich eine L&ouml;sung gefunden hat Zeitgleich
AmigaOS,MorphOS oder Emulatoren zu unterst&uuml;zen und mit welchen Mitteln er
gegen die leider immer noch weitverbreitete Raupkopiererei am Amiga
gegenwirken wird.
</P>
<P>
Ich kann mich dem Motto von &quot;Felix Schwarz&quot; nur anschliessen,&quot;Negative
Signale, negativer Effekt - positives Denken und  gute Produkte, positives
Echo. Packen wirs an!
Letzendlich liegt es aber in der Hand der User ob Sie mit dem Kauf von
Amiga Produkten Signale setzen und es somit erm&ouml;glichen das weitere
Entwicklungen statt finden.&laquo;
</P>
<P><B>&raquo;*Amiga Arena - Vollversion &quot;Samba Partie AGA/ECS&quot;*</B></P>
<P>
Mit der Genehmigung von Jo Seitz (Sayonara Software) erm&ouml;glicht die &quot;Amiga
Arena&quot; die Vollversion des Fussballmanagers &quot;Samba Partie AGA/ECS&quot;.
Hierbei handelt es sich um den ersten Teil der &quot;Samba&quot; Serie.
</P>
<P>
Der Fussballmanager verf&uuml;gt neben zahlreichen features auch einen &quot;Action
Teil&quot; in dem Sie aktiv mit Ihrer Manschaft spielen k&ouml;nnen.
</P>
<P>
Die &quot;Amiga Arena&quot; darf in Zukunft weitere Spiele von &quot;Sayonara Software&quot;
freigeben,daf&uuml;r brauchen Wir aber Ihre Mithilfe,da uns nicht alle Spiele
zur Verf&uuml;gung stehen!
</P>
<P><B>*Folgende Software Titel werden gesucht:*</B></P>
<UL>
<LI> Diego - Fussballmanager
</LI>
<BR><LI> WHLM - Eishockeymanager
</LI>
<BR><LI> Samba Partie prof.  - Fussballmanager mit Actionteil
</LI>
<BR><LI> Travel-Manager - Reisesimulation
</LI>
<BR><LI> Hollywood Pictures - Manager
</LI>
<BR><LI> Samba World Cup - Fussballmanager mit Actionteil
</LI>
</UL>
<P>
Bitte wenden Sie sich an: <A HREF="mailto:olaf.koebnik@online-club.de">olaf.koebnik@online-club.de</A> - Olaf K&ouml;bnik
</P>
<P><B>*Amiga Arena - &quot;Fullversion&quot; Redesign*</B></P>
<P>
Die &quot;Amiga Arena Vollversionen&quot; wurden in neue Bereiche gegliedert.
Neben den bekannten Downloadm&ouml;glichkeiten von Kommerziellen und Sharware
Programmen wurden die Bereiche neu gegliedert und mit
&quot;Applaud Software&quot;,&quot;Sayonara Software&quot; und &quot;Vulcan Software&quot;
drei weitere Bereiche dazugef&uuml;gt.
</P>
<P>
Hier finden Sie neben den bekannten Spielen der Software H&auml;user weiterhin
Levelcodes,Cheats,Screenshots sowie Reviews der einzelnen Produkte.
Weitehrin wird das Siel &quot;DNA&quot; von &quot;Applaud Software&quot; gesucht!
Viel Spass mit dem Angebot w&uuml;nscht die &quot;Amiga Arena&quot;.&laquo;
</P>
<P><B>&raquo;*Amiga Arena - Interview mit &quot;Kuno Naumann&quot; (Bekuna)*</B></P>
<P>
&quot;Boot Tools&quot; die den System Start erweitern gibt es zahlreich f&uuml;r den
Amiga.
</P>
<P>
Die meisten Programme,allerdings haben sich Nachhaltig immer Negativ bei
einem &quot;System Absturz&quot; oder dem booten ohne &quot;Startup-Sequence&quot; erwiesen!
&quot;Bekuna&quot; ein Begr&uuml;ssungs Programm was komplett in ARexx geschrieben ist
(ReAction Gui durch &quot;AWNPipe&quot;) erweist sich als unauff&auml;lliges aber
effektives Boot Programm mit vielen features.
</P>
<P>
Im Interview mit der &quot;Amiga Arena&quot; erz&auml;hlte mir &quot;Kuno Naumann&quot; wie es zu
der Entwicklung von &quot;Bekuna&quot; kam.&laquo;
</P>
<P><B>&raquo;Amiga Arena - PuzzelBOBS Review!</B></P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Mit freundlicher Genehmigung der Zeitschrift [<A HREF="http://www.amigaplus.de" TARGET="_top">http://www.amigaplus.de</A>]&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">AMIGAplus ver&ouml;ffentlicht die &quot;Amiga Arena&quot;&nbsp;</TD><TD VALIGN="TOP">den Testbericht der Ausgabe&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">01/2002 zu &quot;PuzzelBOBS&quot;.&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Ein weitere Testbericht ist auf [<A HREF="http://www.amiworld.it" TARGET="_top">http://www.amiworld.it</A>] AmiWorld neu
Online!&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
