<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Forum1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Forum
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>2. Leserbrief zum Workshop &raquo;Anti-Spam mit YAM&laquo; (von Wolf Zimmer)</H2>
<P>
Diesen Workshop von Christian Aichinger finde ich gut, ich m&ouml;chte sogar
sagen, sehr gut - und das hier nun erwartete &quot;ABER&quot; kommt einfach nicht.
Denn es gibt kein &quot;ABER&quot;. Vor allem werden hier wohl die Kunden von T-
Online mitf&uuml;hlen, denn diese sind ja die Geplagten. Und alle haben beim
Lesen dieses Workshops gesagt: Genau wie bei mir.
</P>
<P>
Nur habe ich die Bef&uuml;rchtung, der Remote-Filter ist beinahe wirkungslos, da
die Absender meist kein zweites Mal auftauchen, und die Betreffzeile l&auml;sst
auch nicht immer einen eindeutigen Hinweis vermuten.
</P>
<P>
Firmenwerbungen werden hiermit aber einfach und schnell abgeblockt und
k&ouml;nnen im Vorfeld meist eliminiert werden. Gegen die Sex-Anbieter ist der
Filter meist wirkungslos, da auch diese Absender die Filtersoftware kennen
und versuchen, diese zu umgehen. Deswegen auch die Doppel- oder Dreifach-
Eing&auml;nge, denn einer wird schon durchkommen.
</P>
<P>
Ich wei&szlig; nicht, ob YAM langsamer wird, wenn der Remote-Filter zu gro&szlig; wird.
Aus diesem Grund habe ich es nun unterlassen, alle bisherigen Eing&auml;nge zu
&quot;dokumentieren&quot; und habe in der Rubrik &quot;Neue Post&quot; das Feld &quot;Vorauswahl&quot;
auf &quot;immer&quot; und &quot;Transferfenster&quot; auf &quot;immer zeigen&quot; gestellt und bei
&quot;Duplikate vermeiden&quot; und &quot;Status aktualisieren&quot; einen Haken gesetzt.
</P>
<P>
Wenn nun wieder eine Mail von Steffi oder Konsorten zu sehen ist, kann
diese nun vor dem Runterladen gel&ouml;scht werden. Weiter habe ich mir zur
festen Gewohnheit werden lassen, nie eine Mail zu &ouml;ffnen, wenn ich noch
online bin. Meine Tochter wollte mir einreden, dass dies alles nichts
nutzen w&uuml;rde, sie k&ouml;nne trotzdem feststellen, ob ich die Mail angenommen
h&auml;tte. So ist es aber nicht. Sie arbeitet in einer Bank und kann wirklich
nicht herausbekommen, ob ihre Mail nun angekommen ist oder ob sie auf dem
Server nun die 30 Tage vor sich hinschmort oder ob ich sie ungelesen
gel&ouml;scht habe. Da sie eine funktionierende Reply-Adresse angibt, w&uuml;rde sie
aber sehen, wenn mein Account geschlossen oder inaktiv w&auml;re. Steffi benutzt
aber eine imagin&auml;re Reply und erh&auml;lt demgem&auml;&szlig; keine R&uuml;ckmeldung.
</P>
<P>
Anfangs habe ich mich bei den Providern der Absender beschwert, hatte aber
in den meisten F&auml;llen keinen Erfolg, also habe ich es sein lassen.
Ausgenommen, ich kann erkennen, hier war ein Kunde von T-Online am Werk. Da
werde ich aktiv. Das Abuse-Team arbeitet in diesen F&auml;llen sehr effizient.
Von Susanne und Claudia habe ich nie wieder etwas geh&ouml;rt.
</P>
<P>
Eines m&ouml;chte ich zum Abschluss noch sagen, ich bleibe bei T-Online, auch
wenn hier irgendjemand meine Adresse weiterverkauft. Wenn ich diesen jedoch
einmal ermitteln kann, bekommt er eine Anzeige von mir.
</P>
<P><B>Wolf Zimmer &lt;<A HREF="mailto:wozim@t-online.de">wozim@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Forum3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
