<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Abschlie&szlig;end
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
<B>Wann erscheint Pegasos - oder ist er schon da?! (von Carsten Schr&ouml;der)</B>
</P>
<P>
Dass Produkte erst viel sp&auml;ter erscheinen als angek&uuml;ndigt, ist f&uuml;r uns
Amiga-User nichts Neues. Dass aber der Beginn der Auslieferung einer neuen
Hardware bekannt gegeben wird, diese aber niemand zu Gesicht bekommt,
beweist, dass im Amiga-Bereich nichts unm&ouml;glich ist...
</P>
<P>
Wir schreiben den 30. Mai. Das Unternehmen Thendic France, welches von der
bplan GmbH mit dem Vertrieb von Pegasos betraut wurde, hat an diesem Tag
bekannt gegeben, dass die ersten PPC-Mainboards inklusive installiertem
MorphOS-Betriebssystem ausgeliefert worden seien.
</P>
<P>
Auf der Website der Pegasos-Entwicklerfirma bplan hingegen wurde diese
Nachricht nicht ver&ouml;ffentlicht (was immer das zu bedeuten hat), gleiches
galt f&uuml;r jene Meldung, die Thendic France eine Woche sp&auml;ter verbreitete:
Demnach w&auml;re bereits die zweite Produktionscharge des Mainboards (im
Voraus) ausverkauft, wobei ein Teil der Boards f&uuml;r befreundete Entwickler
bestimmt sei. Im Juli w&uuml;rden dann weitere Exemplare der Hardware produziert
werden.
</P>
<P>
Als die Verwirrung unter den Anwendern &uuml;berhand nahm, sah sich Thendic dazu
veranlasst, in einem Posting auf der Website des Newsdienstes ann.lu
konkretere Angaben zu machen: In diesem Monat sollen (lediglich) 50 Boards
(die angesprochene zweite Charge) produziert werden, von denen ein
(vermutlich gr&ouml;&szlig;erer) Teil wie oben erl&auml;utert an befreundete Entwickler
geliefert werden wird. Der Rest gehe an Amiga-H&auml;ndler - wobei aufgrund der
geringen Produktionsmenge wohl nicht auszuschlie&szlig;en ist, dass auch diese
Lieferung nicht den Weg zu den Amiga-Anwendern findet, sondern als
Vorf&uuml;hrmodelle o.&Auml;. bei den H&auml;ndlern verbleibt.
</P>
<P>
Im Juli schlie&szlig;lich sollen nochmals bis zu 500 Pegasos-Boards gefertigt
werden. Sofern dieser Termin eingehalten werden kann (wir wissen ja alle,
wie unsicher dies gerade im Amiga-Bereich ist), w&auml;re damit aber noch l&auml;ngst
nicht sichergestellt, dass diese Ladung endlich an die Amiga-User geht.
Denn vor einiger Zeit hat bplan erkl&auml;rt, dass eine nicht geringe Zahl von
Bestellungen aus dem industriellen Bereich vorl&auml;ge, wobei hier als
Betriebssystem wohl ausschlie&szlig;lich Linux zum Einsatz kommen d&uuml;rfte.
</P>
<P>
Apropos Betriebssystem: So wie es aussieht, wird MorphOS nun doch nicht
(zwingend) mit Pegasos ausgeliefert werden, sondern sich auf der Website des
Programmiererteams herunterladen lassen. Angeblich liegt es momentan in
der Version 0.5 vor, wobei v&ouml;llig unklar ist, was diese zu bieten hat.
Denn w&auml;hrend die wichtigsten technischen Spezifikationen des Pegasos-
Mainboards schon seit langem bekannt sind, liegen zu dem Amiga-&auml;hnlichen
OS so gut wie keine aktuellen Informationen vor, lediglich eine anderthalb
Jahre alte Version 0.4 f&uuml;r die PowerUp-Erweiterungskarten ist offiziell
verf&uuml;gbar. Wie MorphOS-Insider jedoch in der j&uuml;ngeren Vergangenheit stets
betonten, sei diese kaum mit der eigentlichen Endanwenderversion des
Betriebssystems vergleichbar.
</P>
<P>
Doch es stellt sich noch eine weitere Frage: In der angesprochenen Erl&auml;uterung
von Thendic France wird auch erw&auml;hnt, dass bislang noch keinerlei(!)
Bestellungen des Pegasos-Mainboards durch Amiga-H&auml;ndler erfolgt seien.
Somit bleibt festzustellen: Nichts Genaues wei&szlig; man nicht... Wir k&ouml;nnen nur
mutma&szlig;en, wann die ersten Pegasos-Boards in der Amiga-Welt ankommen -
und hoffen, dass Thendic France seine derzeit sehr ungl&uuml;ckliche
Informationspolitik schnellstm&ouml;glich grundlegend verbessert. Aber dasselbe
haben wir uns in der Vergangenheit schon von anderen Amiga-Firmen
gew&uuml;nscht - leider gr&ouml;&szlig;tenteils vergebens.
</P>
<P><B>Damit bis zur n&auml;chsten Ausgabe,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
