<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>4. Test: Puzzle Bobs</H2>
<P>
Es muss nicht immer 3D-Grafik und CD-Sound sein. Der Spielspa&szlig; ist der
entscheidende Faktor. Ein Spiel, das nach diesem Grundsatz lebt, ist Puzzle
Bobs. Ein Clone der allseits beliebten Spiele wie Puzzle Bobble oder Bust a
move.
</P>
<P>
F&uuml;r diejenigen, die sich jetzt immer noch kein Bild machen k&ouml;nnen: Gleich
kommt eine Erkl&auml;rung. ;-) Puzzle Bobs erscheint auf einem selbst gebrannten
Rohling ohne Aufkleber. Im Slim-Case steckt ein gedrucktes Titelbild, kein
Booklet, keine Anleitung. Es ist schon schade, dass die Absatzzahlen so
gering sind, dass sogar an solchen Sachen gespart werden muss. Andererseits
habe ich es ja eingangs schon erw&auml;hnt: Puzzle Bobs m&ouml;chte einzig durch das
Spiel bestechen, ohne irgendwelchen Schnickschnack. Das Spiel l&auml;sst sich
problemlos per Installer auf die Festplatte bannen. Ab und zu ist es
m&ouml;glich, dass die Mods nicht mitinstalliert werden, aber dies l&auml;sst sich
durch
</P>
<PRE>
copy puzzlebobscd:modules woimmer:dasspiel/ist/puzzlebobs/modules
</PRE>
<P>
schnell selbst von Hand erledigen.
</P>
<P>
Aber nun soll es endlich losgehen:
Nun, was soll ich sagen: Das Spiel lief anfangs nicht. Ich bekam nur
Grafikm&uuml;ll. Toll, dachte ich mir, ganz wunderbar.
</P>
<P>
Ein kurzer E-Mail-Wechsel mit dem Programmierer brachte die L&ouml;sung ans
Licht und hat mich zu einem totalen Fan dieses Spieles gemacht. PuzzleBobs
l&auml;uft in der Tat auf nahezu jeder Konfiguration. M&ouml;glich wird dies durch
ein spezielles System. Es gibt verschiedene Konfigurationen f&uuml;r alle
m&ouml;glichen Bildschirmaufl&ouml;sungen. Nun begab es sich, dass f&uuml;r meine Voodoo
noch keine dabei war, aber ich habe jetzt welche, und sie werden bestimmt
bald zum Download angeboten bzw. euch per E-Mail zugeschickt.
</P>
<P>
 <A HREF="img/puzzlebobs1.png"><IMG SRC="thumb/puzzlebobs1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Beim ersten Start muss man den passenden Bildschirmmodus ausw&auml;hlen. Dann
erscheinen die obligatorischen Einblendungen und das Titelbild. Hier kann
man das ganze Spiel seinen W&uuml;nschen entsprechend anpassen. Es lassen sich
verschiedene Hintergr&uuml;nde ausw&auml;hlen, und das auch noch an dem bevorzugten
Bildschirmmodus angepasst. Es lassen sich die Samples und die
Hintergrundmusik ver&auml;ndern, und sogar die AI ist auswechselbar. Mit ein
bisschen Geschick lassen sich sogar eigene Hintergr&uuml;nde, B&auml;lle und Levels
kreieren. Und jedes beliebige Mod ist als Hintergrundmusik abspielbar. Da
ist es klar, dass man am Anfang ein bisschen was zu basteln hat, aber das
Ergebnis kann sich sehen lassen (probiert mal den &quot;Pool-Hintergrund&quot;!).
</P>
<P>
Das Spielprinzip an sich ist relativ einfach: Ihr schie&szlig;t mit farbigen
B&auml;llen auf solche, die sich auf dem Bildschirm befinden. Ziel ist es, den
Bildschirm komplett leer zu r&auml;umen. Dies geht dadurch, dass die Blasen
platzen, sobald sich drei gleichfarbige ber&uuml;hren. Sollten an diesen noch
andere h&auml;ngen, fallen die nat&uuml;rlich herunter und platzen auch, wenn unter
ihnen kein Ball mehr ist. Das Spielfeld wird mit der Zeit immer kleiner, so
dass der Abstand zwischen den B&auml;llen und dem Boden abnimmt. Irgendwann
ber&uuml;hrt also mal ein Ball den Boden, und das Spiel ist aus! Soweit das
ganze Game in Kurzfassung. Nat&uuml;rlich kommen noch so Sachen wie Zeitlimit
hinzu, aber ansonsten ist das Spiel so einfach. Und gerade das macht es ja
so genial. Hinzu kommen noch verschiedene Varianten.
</P>
<P>
 <A HREF="img/puzzlebobs2.png"><IMG SRC="thumb/puzzlebobs2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Am simpelsten ist nat&uuml;rlich das Spiel allein. Die verschiedenen Level
werden abger&auml;umt, bis irgendwann einmal die B&auml;lle den Boden ber&uuml;hren. Je
schneller man ein Feld abr&auml;umt, desto mehr Bonuspunkte bekommt man. Ebenso
gibt es Punkte f&uuml;r alle zerplatzten B&auml;lle. Die Gesamtpunktzahl wird in
einer Highscore-Liste festgehalten (wenn man will). Das alles klingt
simpel, aber versucht es mal: Es macht s&uuml;chtig!
</P>
<P>
Richtig interessant wird es nat&uuml;rlich bei zwei Spielern. Hier kann mal
gegen- oder miteinander spielen. Spielt man im Kooperationsmodus, gelten
eigentlich dieselben Regeln wie beim Spiel allein. Versucht das mal.
Gegeneinander wird es dann etwas schwerer. Alle Blasen, die auf der einen
Seite zerplatzen, tauchen auf der anderen Seite wieder auf. Somit wird es
echt kompliziert. Eingangs stellt man die Anzahl der Gewinns&auml;tze ein, und
schon kann es losgehen. Nat&uuml;rlich kann man den zweiten Spieler auch vom
Computer steuern lassen. Hierzu gibt es verschiedene Arten von k&uuml;nstlicher
Intelligenz, und auch der Grundschwierigkeitsgrad ist variabel. Und wer
trotzdem manchmal nicht weiterkommt: Durch Dr&uuml;cken von F10 wird f&uuml;r kurze
Zeit eine Hilfslinie eingeblendet, so dass die Schussbahn genauer
einzustellen ist.
</P>
<P>
Ein weiteres von meinen Lieblingsfeatures ist der sogenannte &quot;Schlaf-
Modus&quot;. Sollte ein Programm im Hintergrund auf einmal aktiv werden, weil
zum Beispiel eine E-Mail gekommen ist oder dergleichen, &quot;schl&auml;ft&quot; Puzzle
Bobs ein. Alle Soundkan&auml;le werden freigegeben, und es kann sofort auf der
Workbench gearbeitet und sp&auml;ter das Spiel genau an dieser Stelle
fortgesetzt werden. Genial.
</P>
<P>
 <A HREF="img/puzzlebobs3.png"><IMG SRC="thumb/puzzlebobs3.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Und trotzdem gibt es Leute, die dieses Spiel hassen werden! N&auml;mlich die
Partner der Leute, die wie gebannt vor dem Screen h&auml;ngen und rufen: &quot;Nur
noch f&uuml;nf Minuten, Schatz!&quot; Puzzle Bobs macht s&uuml;chtig. Und dadurch, dass es
wirklich auf fast alle Bed&uuml;rfnisse zugeschnitten werden kann, kommt jeder
in den Genuss, und es wird auch nicht langweilig. Hoffentlich kommt der
sogenannte GFX-Guide bald auf deutsch. Denn wie gesagt: Es lassen sich auch
Level selbst gestalten, und dies ist die Anleitung dazu. Da die aber auf
englisch ist, habe ich mich noch nicht herangewagt.
</P>
<P>
Denn hier ist das bisher einzige Manko: Es gibt nur einen Levelset. Dieser
setzt sich zwar aus mehreren Bildschirmen zusammen, aber wenn man mal alle
durchhat, fehlt halt Nachschub. Aber der wird bestimmt bald in Form von
selbstgestalteten Levels kommen.
</P>
<P>
Lange Rede, kurzer Sinn: Der Kauf des Spieles lohnt sich f&uuml;r alle, die ein
gutes Gameplay zu sch&auml;tzen wissen und eh nicht viel von Schlaf oder
zwischenmenschlichen Beziehungen halten (denn davon wird es in n&auml;chster
Zeit nicht allzu viel geben). Und wer immer noch nicht sicher ist, kann
sich ja mal das Demo herunterladen.
</P>
<P>
Aber gerade nach der letzten Preiserm&auml;&szlig;igung meine ich, dass es schon drin
w&auml;re, den Amiga-Spielemarkt durch den Erwerb dieser Vollversion zu
unterst&uuml;tzen. ;-)
</P>
<P><B>J&uuml;rgen Theiner &lt;<A HREF="mailto:Juergen.Theiner@t-online.de">Juergen.Theiner@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
