<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>5. Preview: Software Tycoon</H2>
<P>
Es ist das Jahr 1980. Die Computerspielefirmen schie&szlig;en wie Pilze aus dem
Boden. Um sich einen Teil des Kuchen zu sichern, entschlie&szlig;en Sie sich,
eine Softwarefirma zu gr&uuml;nden. Anf&auml;nglich nur mit wenig Kapital und einem
kleinen Team entwickeln sie dann Ihre ersten Spiele. Die Konkurrenz wird
von Jahr zu Jahr immer st&auml;rker, so dass Ihnen nichts anderes &uuml;brig bleibt,
als Ihr Team mit Programmierern, Grafikern und Musikern zu vergr&ouml;&szlig;ern.
Gutes Personal ist jedoch nur mit Gl&uuml;ck zu finden.
</P>
<P>
Die Spiele werden immer besser und die Anspr&uuml;che der Spieler an Grafik und
Sound w&auml;chst. Haben Sie das Wissen, um gute Spiele zu entwickeln, und sind
Sie raffiniert genug, um Ihre Konkurrenz auszuschalten, oder verstauben
Ihre Spiele in den Regalen der L&auml;den?
</P>
<P>
 <A HREF="img/software1.jpg"><IMG SRC="thumb/software1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Soviel zu der &quot;Hintergrundstory&quot;. Bei Software Tycoon handelt es sich um
eine Wirtschaftssimulation. Dieses Genre feierte mit Hits wie Pizza
Connection, MAG, Der Produzent und Software Manager (ein Spiel mit
demselben Hintergrund wie Software Tycoon) gro&szlig;e Erfolge. Nachdem Epic
Interactive f&uuml;r die Bereiche RTS (Earth2140) und Adventure (The Feeble
Files, Simon II) bereits Tophits geliefert haben, versuchen sie dies mit
Software Tycoon im Genre der Simulation. Und ich als Tester muss zum ersten
Mal in meinem Leben ein Spiel selbst produzieren um dann nach wochenlanger
Arbeit in einer Spielezeitschrift eine vernichtende Kritik zu lesen. ;-(
Das Leben ist eines der h&auml;rtesten!
</P>
<P>
Aber immer der Reihe nach: Dieser Test richtet sich an die Besitzer von
HighEnd-Amigas, denn Software Tycoon wird aller Voraussicht nach f&uuml;r diese
erscheinen. Und auch eine Grafikkarte wird Pflicht sein. Nach der
Installation und dem Doppelklick auf das coole ST-GlowIcon muss man erst
einmal einen passenden 800*600*8-Bildschirmmodus ausw&auml;hlen. &quot;8 Bit?&quot; wird
sich nun der Kenner der PC-Version fragen. Dort war das Spiel doch mit
16Bit-Grafiken eine wahre Augenweide. Nun, ich war selbst Betatester und
muss leider sagen: Die 16Bit-Version war wirklich unspielbar. Aber wenn
alles gut l&auml;uft, wird es f&uuml;r die neuen Amigas eine 16Bit-Version geben.
</P>
<P>
Nach dem obligatorischen Einblenden der Logos kann man nun zwischen einer
englischen und deutschen Version w&auml;hlen. Danach gibt es noch die
M&ouml;glichkeit, Sound/Musik auszustellen oder ein bereits gespeichertes Spiel
zu laden. Wir starten komplett neu:
Zuerst suchen wir uns einen (m&ouml;glichst originellen Namen) aus, w&auml;hlen ein
Firmenlogo und den gew&uuml;nschten Schwierigkeitsgrad (leicht, mittel oder
schwer). Dann kann es losgehen. Es gibt viele verschiedene Missionen, von
denen anf&auml;nglich aber nicht alle verf&uuml;gbar sind. Wir haben die Wahl
zwischen &quot;Der Einstieg&quot; (erh&ouml;hen Sie Ihr Kapital innerhalb von zwei Jahren
auf 500.000 $) oder &quot;Der erste Erfolg&quot; (produzieren sie innerhalb von drei
Jahren ein Spiel mit einer Gesamtspa&szlig;wertung von mindestens 80%). Wer kein
Freund von festen Regeln ist, kann das &quot;freie Spiel&quot; w&auml;hlen. Hier hat man
ein Startkapital von 200.000 $ und bis 2005 Zeit. Was man da macht, bleibt
einem selbst &uuml;berlassen.
</P>
<P>
 <A HREF="img/software2.jpg"><IMG SRC="thumb/software2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Das Spielprinzip ist relativ leicht: Man hat ein B&uuml;ro und eine
Entwicklungsabteilung. Es wird ein Konzept erstellt, Leute engagiert und
das Konzept umgesetzt. Nat&uuml;rlich kann man auch Filmlizenzen erwerben, die
in das Spiel einflie&szlig;en. Auch der technische Entwicklungsstand &auml;ndert sich
mit der Zeit. In einer Forschungsabteilung kann man immer neue Genres,
Grafik- und Soundm&ouml;glichkeiten sowie Programmierungstechniken erforschen
(kostet nat&uuml;rlich Zeit und Geld). Hat man dann ein Spiel fertig, sucht man
sich eine Verpackung aus und produziert ein paar tausend St&uuml;ck. Dann bringt
man das Spiel in Umlauf und hofft, dass es viele Leute kaufen und auch die
unversch&auml;mten Spieletester vielleicht ein positives Urteil zustandebringen.
Zur Not gibt es noch die M&ouml;glichkeit, durch Werbekampagnen den Verkauf
anzukurbeln. Von dem verdienten Geld produziert man dann ein neues
(besseres?) Spiel, und so weiter und so fort, bis entweder das Missionsziel
erf&uuml;llt oder die Zeit abgelaufen ist. Die Konkurrenz in Form von zwei
weiteren Softwareschmieden machen dies nat&uuml;rlich nicht gerade leichter. Aus
diesem Grund kann man bei der Mafia verschiedene Sabotageaktionen in
Auftrag geben. Das klingt relativ simpel, ist aber in der Praxis gar nicht
so einfach. Mein erster Versuch endete damit, dass ich nach einem Jahr
schon Pleite war. :)
</P>
<P>
Technisch funktioniert das ganze so, dass man seine Spielfigur durch eine
sch&ouml;n gestaltete vertikal scrollende Stadt bewegt. Vom B&uuml;ro zum
Softwareladen, zum Labor und wieder zur&uuml;ck. Auch laufen hier die
potenziellen K&auml;ufer eurer Spiele herum, es lohnt sich also schon mal, diese
auf ihre W&uuml;nsche hin zu befragen. Durch die 800*600-Aufl&ouml;sung ist die
Grafik wirklich sehr detailreich, und auch die 8Bit-Aufl&ouml;sung tut dem
ganzen keinen gro&szlig;en Abbruch, ganz im Gegenteil: Einige Grafiken wurden im
Vergleich zur PC-Version sogar aufgewertet. Wirtschaftssimulationen haben
ja an sich den Ruf, irgendwann einmal langweilig zu sein. Was mache ich
zum Beispiel, w&auml;hrend ein Spiel gerade entwickelt wird? Nun, zum einen sind
die Grafiken wirklich so gut, dass sich ein &quot;Spaziergang&quot; in der Stadt
immer mal lohnt. Aber es wurden auch einige ziemlich coole Gags eingebaut.
So gibt es immer mal wieder Ereignisse, die einen schmunzeln lassen
(versucht zum Beispiel mal den Colaautomaten im B&uuml;rogeb&auml;ude: Man h&ouml;rt ein
paar kr&auml;ftige Schlucke und ein lautes R&uuml;lpsen! Aber auch die Tatsache, dass
man die Pause durch den Starkstromschalter der Stadt aktiviert, hat was f&uuml;r
sich). Einzig die auf Dauer etwas nervende Hintergrundmusik ist dem Thema
&quot;keine Langeweile&quot; nicht gerade dienlich, aber die l&auml;sst sich ja abstellen.
;-)
</P>
<P>
 <A HREF="img/software3.jpg"><IMG SRC="thumb/software3.jpg" WIDTH="120" HEIGHT="89" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Das ist ja mal wieder ein Hammer, was Epic Interactive hier abliefern.
Gerade die Tatsache, dass das Spiel so schnell verf&uuml;gbar sein wird
(wahrscheinlich werden wir in den Sommerferien schon flei&szlig;ig Spiele
entwickeln k&ouml;nnen), spricht f&uuml;r deren Konzept, PC-Spiele zu konvertieren
anstatt aufwendige Eigenproduktionen zu entwickeln. Software Tycoon ist
aber auch genau die richtige Mischung zwischen knallharter
Wirtschaftssimulation und Adventure. Der Spa&szlig; kommt nicht zu kurz, und
durch die vielen verschiedenen Missionen kommt auch so schnell keine
Langeweile auf.
</P>
<P>
Bleibt nur zu hoffen, dass sich der Einsatz lohnt und dieses Spiel nicht
(so wie mein erstes) in den Regalen vergammelt.
</P>
<P><B>J&uuml;rgen Theiner &lt;<A HREF="mailto:Juergen.Theiner@t-online.de">Juergen.Theiner@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
