<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele7.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>6. Oldies but Goldies: Mega lo Mania (von Christian Aichinger)</H2>
<P>
1991 brachte Imageworks eines meiner absoluten Lieblingsspiele f&uuml;r den
Amiga heraus: Mega Lo Mania, programmiert von Sensible Software, brachte
mich dazu, ganze Tage und N&auml;chte vor dem Rechner zu verbringen und alles um
mich herum zu vergessen. Liebevoll gepixelte Grafiken, atmosph&auml;rische
Musikst&uuml;cke, glasklare Sprachausgabe und nicht zuletzt das s&uuml;chtig machende
Spielprinzip hatten mich in ihren Bann gezogen. Ich entwickelte mich
innerhalb von wenigen Tagen zum &quot;Megalomanic&quot;.
</P>
<P>
 <A HREF="img/megalomania1.jpg"><IMG SRC="thumb/megalomania1.jpg" WIDTH="120" HEIGHT="94" ALT="Screenshot"  BORDER="0"></A>
</P>
<P><B>Die Story:</B></P>
<P>
Die Hintergrundgeschichte ist zugegebenerma&szlig;en etwas w&uuml;st: Es geht darum,
dass vier M&ouml;chtegern-G&ouml;tter um ihre Bef&ouml;rderung als ewige Gottheit spielen.
Dieses Spiel nennt sich nun Mega lo Mania und wird in der &quot;gigantischen
Glaskugel an der Spitze des Universums, in der alle neuen Planeten
geschaffen und betreut werden&quot; ausgetragen. Mhm, ich frage mich gerade,
welche Drogen solche Hintergrund-Stories verursachen? ;-) Egal, die Rolle
eines dieser Semi-G&ouml;tter &uuml;bernimmt der Spieler.
</P>
<P><B>Das Spiel:</B></P>
<P>
Mega lo Mania ist ein Echtzeit-Strategiespiel, in dem neue Technologien
entdeckt, Bodensch&auml;tze ab- und Geb&auml;ude (Mine, Labor, Fabrik, etc.)
aufgebaut werden m&uuml;ssen, um letztendlich bewaffnete Einheiten,
Verteidigungsvorrichtungen oder Reparatureinheiten zu kreieren, mit deren
Hilfe alle anderen Computergegner ausgel&ouml;scht werden m&uuml;ssen.
</P>
<P>
Das Spiel besteht aus insgesamt zehn zeitlichen Epochen (Epoche = Level).
Angefangen von der Steinzeit, &uuml;ber das Mittelalter bis zur Gegenwart und
Zukunft ist so ziemlich alles vertreten und durch das sich st&auml;ndig
wandelnde Waffenarsenal als auch die unterschiedlichen Architekturen in
jeder Epoche durchweg spannend.
</P>
<P>
Jede dieser Epochen, ausgenommen der letzten, wird aus 3 Inseln gebildet,
die vom Spieler allesamt erobert werden m&uuml;ssen, um das Passwort f&uuml;r die
nachfolgende Epoche zu bekommen.
</P>
<P>
Die letzte Epoche bildet eine Ausnahme, doch dazu mehr, weiter unten im
Text.
</P>
<P>
Eine Insel besteht aus verschieden vielen Feldern, die entweder der Spieler
oder die Gegner erobern k&ouml;nnen, um dort weitere Bodensch&auml;tze abzubauen und
folglich mehr bewaffnete Einheiten zu erstellen.
</P>
<P>
 <A HREF="img/megalomania2.jpg"><IMG SRC="thumb/megalomania2.jpg" WIDTH="120" HEIGHT="94" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Wurden alle Gegner auf einer Insel vernichtet, hat man die Insel erobert
und kann das Spiel auf einer weiteren Insel fortsetzen, solange bis alle
Inseln einer Epoche erobert wurden.
</P>
<P>
Alle die oben genannten T&auml;tigkeiten m&uuml;ssen mit der gr&ouml;&szlig;tm&ouml;glichen
Geschwindigkeit ausgef&uuml;hrt werden, um gegen&uuml;ber den Computergegnern (also
den anderen Gott-Anw&auml;rtern) immer einen technologischen als auch - in
Sachen &quot;Waffenarsenal&quot; - quantitativen Vorsprung zu haben. Die
Geschwindigkeit der technologischen Entwicklung, des Abbaus von
Bodensch&auml;tzen als auch der Produktion von Gegenst&auml;nden wird durch die Gr&ouml;&szlig;e
der eingesetzten Bev&ouml;lkerung bestimmt. 100 Menschen bekommt jeder Spieler
pro Epoche gratis.
</P>
<P>
Man kann nun Teile des Bev&ouml;lkerungs-Reservoirs auf einer Insel einsetzen,
um diese zu erobern. Wurden zum Beispiel 20 Menschen auf eine Insel
gesetzt, k&ouml;nnen 5 Menschen auf dieser Insel neue Technologien entdecken und
weitere 5 irgendwelche Bodensch&auml;tze abbauen. Haben die restlichen 10
Menschen nichts weiter zu tun, fangen sie an, sich zu vermehren. Die daraus
resultierenden Nachkommen k&ouml;nnen nun wieder an der Entdeckung neuer
Technologien, zur Bewachung des eigenen Geb&auml;udes, der Produktion, zum Abbau
von Bodensch&auml;tzen oder der Eroberung leerer oder feindlicher Felder
eingesetzt werden.
</P>
<P>
Beteiligen sich mehrere Computergegner am Kampf um eine Insel, kann man
versuchen, mit diesen ein B&uuml;ndnis einzugehen. Nat&uuml;rlich k&ouml;nnen sich auch
die Computergegner gegen den Spieler verb&uuml;nden, was den Sieg nicht gerade
vereinfacht. Wurde eine Insel erobert, verbleibt die dort eingesetzte
Bev&ouml;lkerung inklusive deren Nachkommen auf dieser, und man muss f&uuml;r die
n&auml;chste Insel wieder auf sein Bev&ouml;lkerungs-Reservoire zugreifen. Wurden
aber f&uuml;r eine gesamte Epoche beispielsweise nur 60 Menschen ben&ouml;tigt (z.B.
20 Menschen pro Insel), werden die restlichen 40 in der n&auml;chsten Epoche zu
den geschenkten 100 dazu addiert. Der Spieler hat dann also 140 Menschen
zur Verf&uuml;gung, um die n&auml;chste Epoche (oder die n&auml;chsten 3 Inseln) zu
meistern. Man sollte also durchaus mit den pro Insel eingesetzten Menschen
knausern, da sp&auml;tere Epochen teilweise enorme Mengen &quot;Manpower&quot; ben&ouml;tigen.
Wird der Spieler auf einer Insel geschlagen, kann der Kampf um dieselbe
Insel so oft wiederholt werden, bis sie endg&uuml;ltig erobert wurde.
</P>
<P><B>Ziel:</B></P>
<P>
Das Spielziel ist die Eroberung der letzten Insel &quot;Mega lo Mania&quot;. Diese
Insel ist die einzige, die es in der 10. und damit letzten Epoche gibt. Um
allerdings &uuml;berhaupt auf dieser Insel spielen zu d&uuml;rfen, muss in vorherigen
Epochen ein Teil der Bev&ouml;lkerung f&uuml;r diesen letzten Kampf reserviert
werden. Dies geschieht, indem die Bev&ouml;lkerung auf einem Spielfeld
kurzerhand eingefroren wird. Besitzt der Spieler z.B. auf einer Insel
mehrere Spielfelder, und ist der Feind gnadenlos unterlegen, kann ein
Spielfeld in einen Gefrierschrank verwandelt werden.
</P>
<P>
Spieler als auch Gegner k&ouml;nnen dann nichts mehr mit diesem &quot;Gefrierschrank-
Spielfeld&quot; anfangen. Es kann weder erobert noch vernichtet werden.
Voraussetzung ist allerdings, dass sich auf dem entsprechenden Spielfeld
keine weiteren Technologien mehr entwickeln lassen und dass das Einfrieren
durch die m&ouml;glichen Technologien der zeitlichen Epoche &uuml;berhaupt
gew&auml;hrleistet ist. F&uuml;r einen Neandertaler oder Ritter d&uuml;rfte Kryotechnik
wohl kaum ein Begriff sein. ;-) So ist es erst ab etwa der 6. oder 7.
Epoche &uuml;berhaupt m&ouml;glich, K&auml;mpfer f&uuml;r Mega lo Mania zu bunkern. Auf Mega lo
Mania selbst k&ouml;nnen keine weiteren Technologien mehr entwickelt werden.
Jeder K&auml;mpfer erh&auml;lt eine kleine Laserpistole, mit der er gegen den Feind
antreten muss. Wenn der Spieler Gl&uuml;ck hatte, haben die Computergegner in
fr&uuml;heren Epochen &quot;vergessen&quot;, K&auml;mpfer f&uuml;r die letzte Insel zu reservieren,
und Mega lo Mania f&auml;llt widerstandslos in die H&auml;nde des Spielers.
</P>
<P><B>Systemvoraussetzungen/Installation:</B></P>
<P>
Das Spiel wurde f&uuml;r die damals &uuml;blichen Rechner entwickelt, auf zwei
kopiergesch&uuml;tzten Trackloader-Disketten ausgeliefert und hat demzufolge
gewisse Probleme mit &quot;modernen&quot; Amigas. Die originale Diskettenversion
l&auml;sst sich mit Einschr&auml;nkungen auf einem Amiga mit OCS und 512 KByte Chip-
RAM spielen. Auf einem 1MByte-OCS-Rechner k&ouml;nnen zus&auml;tzliche Soundeffekte
verwendet werden. Eine Festplatteninstallation ist aufgrund des Disketten-
Trackloaders nicht ohne weiteres m&ouml;glich. Auch eine Sicherungskopie der
beiden Originaldisketten ist ohne zus&auml;tzliche Hardware unm&ouml;glich. Unter [1]
l&auml;sst sich aber ein WHDLoad-Installer downloaden, der es erm&ouml;glicht, Mega
lo Mania auf Festplatte zu installieren. Allerdings ben&ouml;tigt man daf&uuml;r
einen Amiga, der kein Problem mit Trackloader-Disketten hat, sprich: Ein
A1200 aus Escom-Produktion ohne entsprechenden Floppyfix ist f&uuml;r die
Installation ungeeignet. Wurde die H&uuml;rde der Festplatteninstallation
gemeistert, kann das nun auf Festplatte gespeicherte &quot;MegaLoMania&quot;-
Verzeichnis auch unter WinUAE verwendet werden. Wichtig bei Verwendung
unter WinUAE ist, dass die Amiga-Soundemulation eingeschaltet ist. Ist sie
es nicht, bleibt das Spiel kurz nach dem Intro h&auml;ngen. Dank WHDLoad kann
das Spiel dann aber immer noch mit einem entsprechenden Quit-Key restlos
aus dem Speicher entfernt werden. Die WHDLoad-Version ben&ouml;tigt mindestens 1
MByte Chip-RAM. Mega Lo Mania wurde &uuml;brigens auch in einer Version f&uuml;r
Atari ST und MS-DOS-PCs ver&ouml;ffentlicht.
</P>
<P><B>Bezugsquelle:</B></P>
<P>
Aufgrund des Alters wird man Mega lo Mania nur noch auf dem Flohmarkt oder
bei diversen Internet-Auktionsh&auml;usern finden. Sicherlich l&auml;sst sich auch
auf einschl&auml;gigen &quot;Abandonware&quot;-Seiten eine entsprechende Version finden,
doch d&uuml;rfte das nicht legal sein, da mir bisher noch keine Information zu
Ohren gekommen ist, dass Mega lo Mania von Imageworks oder Sensible
Software zum kostenlosen Download freigegeben wurde. Ach, und meine
deutsche Original-Version ist &uuml;brigens unverk&auml;uflich. ;-)
</P>
<P>[1] <A HREF="http://www.whdload.de" TARGET="_top">http://www.whdload.de</A></P>
<P><B>Christian Aichinger &lt;<A HREF="mailto:christian@aakt.de">christian@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele7.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
