<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele7.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele9.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>8. AmigaOS vs. Amiga Anywhere vs. MorphOS: Das meint Martin Wolf/Eternity</H2>
<P>
Sicherlich werde ich mit meiner Meinung wieder einigen Usern auf den
Schlips treten. Ich sehe gewisse Dinge einfach aus einem wirtschaftlichen
Standpunkt heraus, und dies muss logischerweise nicht immer dem
entsprechen, was ich mir w&uuml;nsche.
</P>
<P>
Das Thema AmigaOS vs. AmigaDE vs. MorphOS bewegt zurzeit ja viele User. Um
beurteilen zu k&ouml;nnen, welches System uns nun wirklich in eine bessere
Amiga-Zukunft bringen k&ouml;nnte, muss man zun&auml;chst die Ausgangssituation klar
beschreiben und dann eben das gew&uuml;nschte Ziel festlegen.
</P>
<P>
Die aktuelle Situation ist klar. Der Amiga-Markt ist zusammengebrochen, die
Infrastruktur f&uuml;r einen kleinen Nischenmarkt nur noch in Ans&auml;tzen
vorhanden, und es sind zu wenige User vorhanden, die zu wenig Hard- und
Software kaufen. Daraus resultiert wiederum keine signifikante neue
Produktion von Hard- und Software. Das ganze ist also ein Teufelskreis. Der
Amiga-Markt stirbt mit jedem Monat, der ins Land zieht.
</P>
<P>
Das Ziel aller drei Systeme ist nun die Wiederbelebung eines Marktes. Dazu
geh&ouml;ren mindestens 10.000-15.000 aktive User in einem Land wie Deutschland.
Au&szlig;erdem z&auml;hle ich dazu H&auml;ndler, die untereinander Konkurrenz aus&uuml;ben,
mindestens drei Zeitschriften, die den Markt bedienen und eben diverse
kleine Hard- und Software-Produzenten, die den Markt mit neuester Software
von *guter* Qualit&auml;t beliefern.
</P>
<P><B>Welches der Systeme kann nun dieses Ziel erreichen?</B></P>
<P>
Ehrlich gesagt glaube ich pers&ouml;nlich nicht mehr daran, dass eines der
System es schaffen kann. Fangen wir mal an mit AmigaDE.
</P>
<P>
AmigaDE, seinerzeit gedacht als plattformunabh&auml;ngiges Betriebssystem, ist
aktuell nur eine Spielebox, in der man eben kleine Spielchen laufen lassen
kann. Man mag mich gern eines besseren belehren, aber die aktuelle
Vermarktungsstrategie von AMIGA, Inc. ist IMHO gleichzeitig eine
Offenbarung der Tatsache, dass man ein komplettes Betriebssystem wohl nie
erreichen wird.
</P>
<P>
Ich habe es vor Jahren behauptet und behaupte es wieder: Wenn Firmen wie
Microsoft es nicht schaffen, mit WindowsCE eine Dominanz am PDA-Markt zu
erreichen, wie soll es dann AMIGA, Inc. mit seinen sehr knappen Ressourcen
gelingen? Insofern kann man AmigaDE auch nicht mit Betriebssystemen wie
AmigaOS 4 oder MorphOS vergleichen. AmigaDE ist eine Spielebox, mehr nicht.
F&uuml;r ein komplettes modernes Betriebssystem geh&ouml;rt noch so viel mehr dazu,
dass der Platz in AMIGA aktuell dazu nicht ausreicht, um alle Komponenten
zu listen, die hier noch fehlen. Punkt. AMIGA, Inc. kreide ich an, dass man
wieder zwei Jahre verplempert hat, ohne wirklich etwas zu erreichen.
</P>
<P>
MorphOS kenne ich leider nur in Form der letzten &ouml;ffentlichen Betaversion.
Ich gehe mal davon aus, dass es seitdem erheblich weiterentwickelt wurde
und es sich nun durchaus 'Betriebssystem' schimpfen darf. Tatsache ist
jedenfalls, dass es sehr mit AmigaOS verwandt ist und durchaus eine
Alternative f&uuml;r den Amiga-Anwender w&auml;re. Ein Problem jedoch sehe ich im
Vermarktungskonzept und in der Zuverl&auml;ssigkeit der Hersteller. MorphOS soll
nur auf Pegasos-Rechnern oder eben auf alten Phase-5-Karten laufen. Damit
wird der potenzielle Markt schon von allein auf maximal 5.000 User
eingeschr&auml;nkt. Denn leider sind gerade die aktuellen Ex-Phase-5-Kunden
genau die User, die sich ein solches System als erstes zulegen w&uuml;rden. Und
ohne die Unterst&uuml;tzung neuer Software-Produzenten wird sich an dieser
Sachlage auch nicht viel &auml;ndern. Wenn bplan gleichzeitig das Board an
Linux-User verkauft, hilft das dem Amiga-Markt herzlich wenig, es hilft
lediglich einigen H&auml;ndlern und eben bplan. Die Situation der Software auf
einem MorphOS-System w&auml;re also die gleiche, wie die eines aktuellen PPC-
Systems.
</P>
<P>
Lustigerweise w&auml;ren MorphOS-User dann trotzdem auf Spiele z.B. von Hyperion
angewiesen (&uuml;ber die WarpUp-Emulation), weil sie sonst ein System benutzen,
auf dem noch weniger Spiele laufen.
</P>
<P>
Sieht man sich nun in Gedanken einen Pegasos-Rechner an, so sehe ich
trotzdem keine rosige Zukunft. Man hat zwar einen recht modernen Rechner
vor sich stehen, kann aber damit kaum etwas modernes machen. Insofern w&auml;re
diese L&ouml;sung f&uuml;r Neueinsteiger eh uninteressant. Java? Flash? Browser? 3D-
Raytracer? Moderne Tabellenkalkulation? Modernes Datenbanksystem? Anbindung
an den Rest der Welt in Punkto Datenkompatibilit&auml;t?
Alles Dinge, die fehlen! Bitte verstehen Sie mich nicht falsch. Ich sch&auml;tze
die Leistung der Firma bplan und ihrer Mitarbeiter, aber als Weg in die
richtige Amiga-Zukunft ist auch dieser Rechner einfach nicht genug.
</P>
<P>
Nun zu AmigaOS. Wir alle kennen es seit langem und haben es &uuml;ber die Jahre
lieben gelernt. Leider ist es mittlerweile veraltet und M&ouml;rtel br&ouml;ckelt an
vielen Stellen im System. AmigaOS 4 von Hyperion ist sicherlich, ebenso wie
MorphOS, eine sinnvolle Sache.
</P>
<P>
Endlich will man bestimmte Dinge ppc-nativ nachreichen und somit den
Weg ebenen f&uuml;r einen sanften &Uuml;bergang zu einem reinen PPC-Rechner. Aber
auch hier treffen wir wieder auf die gleiche Problematik wie unter MorphOS.
Da wird eine (nach PC-Ma&szlig;st&auml;ben) kleine englische Firma beauftragt, ein
neues Motherboard zu entwickeln. Nachdem man dies &uuml;ber zwei Jahre nicht
hinbekommt, nimmt man sich dann ein PPC-Mainboard aus Fernost, klebt einmal
Amiga darauf und will dieses Board dann mit Linux unter den Amiga-Usern
verkaufen! Ehrlich gesagt wird mir bei dem Gedanken schlecht. Ich betrachte
mich nun mal auch als potenziellen Endkunden und muss wirklich sagen:
Sorry, aber so was will ich nicht kaufen.
</P>
<P>
AmigaOS 4 soll nun irgendwann auf diesem Mainboard laufen. Gehen wir mal
davon aus, dass es am Tag X wirklich gelingt und das ganze vorgef&uuml;hrt wird,
dann stehen wir trotzdem vor demselben Problem. Wer kauft dieses Board?
Da es keine weitere zus&auml;tzliche Softwareentwicklung gibt, wird der Amiga-
Markt nicht gr&ouml;&szlig;er werden und auch die Kundenzahl wird somit nicht
ansteigen. Ich sch&auml;tze nat&uuml;rlich auch die Arbeit von Hyperion und wei&szlig;,
dass die Entwickler dort absolut &uuml;berzeugt sind von Ihrem Weg.
</P>
<P>
PPC ist das einzig Wahre und die einzige Chance f&uuml;r unsere Markt, sagt man.
Leider stimme ich dem nicht zu, denn wenn dem automatisch so w&auml;re, wenn
also wirklich die Kunden uns die T&uuml;re einrennen w&uuml;rden, nur weil wir
PPC-Mainboards verkaufen, warum ist dann eine Firma namens Phase 5
&uuml;berhaupt pleite gegangen?
</P>
<P>
Heute ist es wei&szlig; Gott nicht mehr damit getan, einen besseren Benoit auf
seinem Rechner zu haben. Es ist auch nicht damit getan, ein Quake zu
besitzen, das eventuell f&uuml;r f&uuml;nf Monate (bis dahin haben die PCs den
technischen Vorsprung eh wett gemacht) schneller l&auml;uft als auf dem
schnellsten PC.
</P>
<P><B>Die Frage ist also:</B></P>
<P>
Was leisten diese Systeme? Die Antwort: Zu wenig, um den Massenmarkt zu
erreichen.
</P>
<P>
Was kosten diese Systeme? Die Antwort: Zu viel, um den Massenmarkt zu
erreichen.
</P>
<P>
Wir leben in einer Zeit, in der hochmoderne Spielekonsolen, wie die X-Box
oder die Playstation 2, miteinander konkurrieren, in der Betriebssysteme
wie Windows XP durchaus gut aussehen und auch funktionieren, in der MacOS X
bereits jeden Alternativ-Anspruch vollst&auml;ndig abdeckt. Wo ist hier noch
Platz f&uuml;r ein AmigaOS?
</P>
<P>
Die Antwort ist simpel. So simpel, dass sie keiner h&ouml;ren m&ouml;chte. ES GIBT
KEINEN PLATZ F&Uuml;R DAS DERZEITIGE AMIGAOS. Amiga bietet keine sinnvolle
Alternative mehr!
</P>
<P>
Um nun trotzdem wieder Marktpr&auml;senz zu erreichen und unseren geliebten
Rechner wenigstens ein Nischendasein zu sichern, w&auml;ren meiner Meinung nach
folgende Dinge notwendig:
</P>
<UL>
<LI> Alle Amiga-OS Versionen d&uuml;rfen frei miteinander konkurrieren
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Es ist egal, wie das AmigaOS aussieht. Ob es MorphOS ist oder Amithlon. Ob&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">es AmigaOS 4 oder AmigaXL ist. Selbst WinUAE bietet eine Amiga-Oberfl&auml;che&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">und k&ouml;nnte, bei entsprechender Software, Amiga-User zur&uuml;ckholen. Das&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">traurige ist, dass, wenn es niemanden g&auml;be, der die Rechte am Source von&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">AmigaOS h&auml;tte, es dem Markt wahrscheinlich besser gehen w&uuml;rde.&nbsp;</TD></TR>
</TABLE>
<P>
Da aber der Zug f&uuml;r ein 'eigenst&auml;ndiges &Uuml;berleben' eines der obigen System
eh abgefahren ist, besteht kein Grund mehr auf Exklusivit&auml;t. Die aktuellen
Debatten zwischen den Firmen ergeben sich IMHO nur aus den bestehenden
Vertr&auml;gen und der Angst, eventuell die Felle davon schwimmen zu sehen. Dass
man damit dem Amiga-Markt in zweiter Instanz mehr schadet als hilft, ist
anscheinend nicht mehr wichtig, und so schadet man in Wirklichkeit der
eigenen Firma. Traurig aber wahr.
</P>
<P>
Die Pflicht von AMIGA, Inc. w&auml;re es, hier die Legislative zu spielen und
daf&uuml;r zu sorgen, dass sich alle Systeme in die richtige Richtung
entwickeln. Ja, ich fordere AMIGA, Inc. sogar auf, die verschiedenen
AmigaOS-Versionen offiziell f&uuml;r den Verkauf freizugeben und sich lediglich
um die Rahmenbedingungen eines jeden Systems zu k&uuml;mmern. Die Aufgabe von
Amiga, Inc. sollte vielmehr darin bestehen, die *globale* Richtung f&uuml;r
AmigaOS vorzugeben und bei bestimmten fehlenden Dingen punktuell
nachzubessern. Im &uuml;brigen braucht man dazu nicht viel Geld, nur viel Flei&szlig;.
</P>
<UL>
<LI> Die Entwickler am Amiga-Markt m&uuml;ssen endlich zusammenfinden
</LI>
</UL>
<P>
Nur durch die *Zusammenarbeit* der verschiedenen Hersteller k&ouml;nnte man
Synergieeffekte erzielen, die wiederum die Kosten f&uuml;r die verschiedenen
Systeme reduzieren w&uuml;rden. Ein Beispiel sind aktuell die USB-Stacks.
Jahrelang wurde nichts entwickelt, und derzeit sitzen auf einmal drei oder
mehr Entwickler daran. Wieso?
</P>
<P>
Ein weiteres Beispiel sind die Grafikkarten-  und Soundkartentreiber f&uuml;r
PCI-Boards. Ich m&ouml;chte mal wetten, dass es weder Elbox noch DCE genutzt
haben kann, hier auf Exklusivit&auml;t zu setzen. Wer gewinnt durch solch eine
Vorgehensweise?
Niemand. Der Markt wird gespalten, die User kloppen sich auf amiga-news.de,
und die Firmen bringen kein Geld nach Hause, um weiterhin f&uuml;r Amiga
Hardware zu entwickeln. Und wenn es denn so ist, dass man tats&auml;chlich nur
teurere Hardware als ein Konkurrent herstellen kann, sollte man es
vielleicht einfach lassen und das Geld in andere Dinge stecken.
</P>
<P>
Ich fordere AMIGA, Inc. auf, hier punktuell nachzubessern! Angeblich soll
ja jetzt ausreichend Geld vorhanden sein. Dann bitte... Man schaue im
Linux-Markt nach, hole sich die entsprechenden Quellcodes f&uuml;r Software,
suche bestimmte Entwickler, die als Freizeitprogrammierer f&uuml;r die
Fertigstellung dieser Software einen Shareware-Mindestsatz von 1000 Euro
bekommen, und schon hat man mit wenig Geld einen Software-Markt belebt.
Nat&uuml;rlich sprie&szlig;t nicht &uuml;berall direkt ein Pfl&auml;nzchen, nur weil man Samen
auss&auml;ht. Aber hier und da wird es funktionieren, und die Situation wird
sich verbessern.
</P>
<UL>
<LI> Solange auf Emulationsbasis arbeiten, wie der Markt zu klein ist
</LI>
</UL>
<P>
Jedes der obigen Systeme hat allein leider keine Existenzm&ouml;glichkeit. Alle
Systeme zusammen genommen k&ouml;nnten jedoch durchaus genug User erreichen,
damit es sich in Zukunft wieder lohnt, Software f&uuml;r den Amiga zu erstellen.
Wie gesagt, 10.000-15.000 User w&auml;ren das Minimum, um zu &uuml;berleben. Als
Folge bedeutet das nat&uuml;rlich, dass man Software entwickeln muss, die auf
allen Systemen einwandfrei funktioniert. Fakt ist genauso, dass alle
Systeme mehr oder weniger auf Emulationen basieren. WinUAE mehr, AmigaOS 4
weniger, usw... Somit hei&szlig;t die derzeitig einzige Alternative 68k-Programm
mit WarpUp-Routinen. Ich verlange ja nicht, dass die Entwickler nun keine
MorphOS-spezifischen Routinen mehr verwenden sollen, um noch mehr Leistung
herauszukitzeln, sondern ich sage nur, dass die Bandbreite der Amiga-
Systeme trotzdem genutzt werden sollte. Wer nicht viel Leistung ben&ouml;tigt,
kann weiterhin in 68k programmieren. Wer Leistung ben&ouml;tigt, programmiert in
C neben der 68k-Version eben eine eigene schnellere Routine, vorzugsweise
WarpUp, da diese noch von den meisten System unterst&uuml;tzt wird. Ein Programm
wie MakeCD ben&ouml;tigt keine schnelleren Unterroutinen, es sei denn f&uuml;r
mp3-Onthefly. Wenn diese Routine gleichzeitig in WarpUp vorliegt,
profitieren alle System davon, bis auf reine 68k-Systeme, die aber im
Falle einer Emulation eh wieder schnell genug sind. Hier kreide ich es
AMIGA, Inc. an, nicht klare Ziele definiert zu haben und dem interessierten
Shareware-Entwickler keine Hilfe zu geben.
</P>
<P>
Ich fordere AMIGA, Inc. also auf, klar zu definieren wie die Zukunft f&uuml;r
einen Entwickler aussieht. Welchen Compiler sollte man benutzen? Wie
kompiliere ich x86-nativ, wie kompiliere ich f&uuml;r MorphOS nativ, wie f&uuml;r
AmigaOS 4? Und ich fordere AMIGA, Inc. auf, zur Emulation zu stehen,
solange es anders nicht machbar ist. Die heutigen Prozessoren sind schnell
genug, da interessiert es mich nicht die Bohne, ob meine Mails in zehn
Sekunden oder zw&ouml;lf Sekunden gelesen werden. Wichtig ist viel eher, dass
ich die Software zur Hand bekomme.
</P>
<UL>
<LI> AMIGA, Inc. m&uuml;sste die Betreuung des Marktes &uuml;bernehmen
</LI>
</UL>
<P>
Manchen m&ouml;gen meine Vorstellungen etwas radikal erscheinen, aber
aussichtslose Situationen erfordern radikale Einschnitte, wenn man noch
etwas retten will. Die heutigen User wissen doch gar nicht mehr, dass es
Amiga noch gibt. Wenn sich tats&auml;chlich mal jemand &uuml;ber Amiga informieren
will, bekommt er eventuell von Google www.amiga.com und www.amiga-news.de
zu sehen. Auf www.amiga.com steht praktisch nichts Brauchbares f&uuml;r
interessierte Neueinsteiger, und auf www.amiga-news.de erf&auml;hrt man derzeit
nur von Streitigkeiten unter den Amiga-Usern. Der potenzielle Kunde wird
allein durch diese Dinge schon abgeschreckt. Sp&auml;testens wenn er dann einen
der H&auml;ndler anruft und sich &uuml;ber den Preis informiert, f&auml;llt er aus allen
Wolken, denn das Preis/Leistungs-Verh&auml;ltnis stimmt einfach nicht. Das
Resultat ist nat&uuml;rlich, dass der Kunde dann doch lieber bei seinem alten
System bleibt.
</P>
<P>
Ich fordere AMIGA, Inc. also auf, dem interessierten Neueinsteiger im
Internet eine Informationsplattform zu bieten, die dar&uuml;ber Auskunft gibt,
was wo von welchem Hersteller existiert, bestimmte Dinge ausf&uuml;hrlich mit
Bild zu beschreiben und die zuk&uuml;nftigen Entwicklungen, auch der
Dritthersteller, zu benennen, so dass der potenzielle Kunde sich f&uuml;r ein
System entscheiden kann und somit zum Amiga-User wird.
</P>
<P>
Es gibt immer noch Punkte beim Amiga, die auf anderen Systemen so nicht
existieren und deshalb daf&uuml;r pr&auml;destiniert sind, auf einer solchen Seite
genannt zu werden. Dazu z&auml;hle ich z.B. Rexx und die F&auml;higkeit des Amiga,
fast alle Programme miteinander kommunizieren zu lassen.
</P>
<P>
Der potenzielle User muss einen Einblick dar&uuml;ber bekommen, WAS er mit einem
Amiga machen kann, und was nicht.
</P>
<UL>
<LI> Die Amiga-User m&uuml;ssen wieder liberaler (auch untereinander) werden
</LI>
</UL>
<P>
Ich wei&szlig;, dass dies weh tut. Vor zwei Jahren habe ich ein Umdenken von euch
gefordert, und nun tue ich es wieder. Die alten Amiga-Tage sind vorbei.
H&ouml;rt auf, euren Amiga-Nachbar f&uuml;r verr&uuml;ckt zu erkl&auml;ren, nur weil er eine
andere Amiga-Emulation benutzt oder tats&auml;chlich noch mit einem 030er-
Prozessor arbeitet. Das ist Unsinn! Viel wichtiger w&auml;re es, die Entwickler
darauf hinzuweisen, dass dieses oder jenes auf dem eigenen Lieblingssystem
nicht funktioniert und ihnen somit zu zeigen, dass es tats&auml;chlich Amithlon-
Kunden (Beispiel!) f&uuml;r Frogger oder MakeCD gibt. Gebt den Entwicklern auch
Feedback, lobt sie f&uuml;r teilweise unbezahlte Arbeit.
</P>
<P>
Kritisiert aber auch unn&ouml;tige Abzocke und warnt andere User vor derselben
Falle. Wir sitzen nun mal alle in einem Boot. Amen. :-)
</P>
<P>
So, mir fallen zwar noch diverse andere Punkte zu diesem Streitthema um das
richtige OS ein, aber ich belasse es erst mal bei den genannten Punkten,
sonst werde ich wieder nicht fertig mit ToT. :-)
</P>
<P><B>Martin Wolf &lt;<A HREF="mailto:Eternity@Pride.de">Eternity@Pride.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele7.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele9.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
