<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele8.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>7. AmigaOS vs. Amiga Anywhere vs. MorphOS: Das meinen die Spielehersteller</H2>
<P>
Da bekommen wir Zocker nun quasi drei Systeme, die wir zuk&uuml;nftig zum
Spielen nutzen k&ouml;nnten, wenn es denn blo&szlig; Spiele daf&uuml;r g&auml;be. Wir haben
uns bei diversen Spieleherstellern einmal umgeh&ouml;rt und sie zu dem Thema
gefragt...
</P>
<BR><BR>
<P>
Paul Burkey, bekannt durch z.B. &quot;Foundation&quot; oder die Portierung von
&quot;Simon The Sorcerer 2&quot;, ist es prinzipiell egal, f&uuml;r welches System
er seine Spiele schreibt. Er richtet sich da einfach nach den W&uuml;nschen
der Anwender. Seine Programmentwicklung nutzt eine Software-Abstraktions-
Schicht und erlaubt grunds&auml;tzlich die Portierung auf beliebige Systeme -
solange die n&ouml;tige Hardwareleistung vorhanden ist.
</P>
<P>
Zum Thema AmigaOS vs. MorphOS m&ouml;chte er sich nicht &auml;u&szlig;ern, da ihm eine
entsprechende Informationsgrundlage fehlt.
</P>
<BR><BR>
<P>
&Auml;hnlich sieht es auch James Daniels, Autor des preisgekr&ouml;nten Spiels
&quot;Payback&quot;. Zum Thema AmigaOS vs. MorphOS m&ouml;chte er sich nicht &auml;u&szlig;ern,
da es von einigen Leuten sehr emotional angegangen wird und er sich
nicht in Debatten verstricken m&ouml;chte.
</P>
<P>
Das Amiga Anywhere passt seiner Ansicht nach nicht in diese Liste, da es
seines Wissens nach mit dem AmigaOS verschmolzen werden soll.
</P>
<BR><BR>
<P>
Steffen H&auml;user gesteht, dass er hinsichtlich der Betriebssystemfrage
nat&uuml;rlich nicht neutral ist, er aber seine ehrliche Meinung kundtun
m&ouml;chte.
</P>
<P>
Seiner Ansicht nach ist AmigaOS 4 der einzige zukunftstr&auml;chtige Weg f&uuml;r
Amiga-Spiele. Sollte sich OS4 gut verkaufen, w&auml;ren sogar &quot;OS4 only&quot;-Spiele
interessant, sofern es PPC-Spiele betrifft.
</P>
<P>
Konkret sieht er bei OS4 folgende Gr&uuml;nde, warum es f&uuml;r Spiele geeignet
ist:
</P>
<UL>
<LI> zeitgem&auml;&szlig;e APIs, die den Spieleentwickler unterst&uuml;tzen, z.B. ein
  Lowlevel-3D-API, MesaGL und AmigaInput
</LI>
<BR><LI> Unterst&uuml;tzung leistungsf&auml;higer Hardware
</LI>
</UL>
<P>
Au&szlig;erdem sei der Name &quot;Amiga&quot; immer noch eine Art Zugpferd und AmigaOne,
und AmigaOS 4 ernten auch au&szlig;erhalb der Amiga-Gemeinde Interesse. Er
rechnet damit, dass einige ehemalige Amiga-User zur&uuml;ckkommen werden.
Wichtig w&auml;re auch, dass der AmigaOne eine von professioneller Hand
entwickelte Hardware ist, die garantiert kommt.
</P>
<P>
Bez&uuml;glich MorphOS hat er neben politischen Interessen auch technische
Kritikpunkte. Im Fall der Spieleprogrammierung seien dies schlichtweg
fehlende APIs, die die Hersteller bei der Erstellung unterst&uuml;tzen. Am
schmerzlichsten sei dies sicherlich im 3D-Bereich.
</P>
<P>
Zum Amiga Anywhere gibt Steffen zu bedenken, dass er sich mit der Thematik
noch nicht eingehend befasst h&auml;tte. Die Entwicklung an sich, besonders im
PDA-Bereich, f&auml;nde er aber sehr interessant.
</P>
<BR><BR>
<P>
Michael Garlich von Titan Computer sieht das ganze ein wenig anders. Man
habe sich auf MorphOS konzentriert, weil es derzeit schon auf der neuen
Hardware lauff&auml;hig sei und man einen ausgezeichneten Developer-Support
genie&szlig;e. Von AMIGA, Inc. habe man hingegen zum AmigaOS 4 bisher nicht die
geringsten Informationen erhalten.
</P>
<P>
Hinsichtlich des Amiga Anywhere denkt er, dass es im PDA-Bereich besser
aufgehoben ist als im Desktop-Markt. Titan Computer bezweifle, dass es
jemals den Weg zu einem Desktop-OS finden werde. Dennoch habe man bisher
bereits drei Spiele daf&uuml;r herausgegeben.
</P>
<BR><BR>
<P>
Timo Kloss von Inutilis h&auml;tte es hingegen am liebsten, wenn das Amiga
Anywhere zu einem eigenst&auml;ndigen Betriebssystem entwickelt w&uuml;rde, das eine
AmigaOS-Emulation enth&auml;lt. Es w&auml;re eine Chance, Altlasten loszuwerden und
das gute Grundkonzept zur Geltung zu bringen.
</P>
<P>
OS4 h&auml;lt er f&uuml;r eine gute Weiterentwicklung, er vermisse aber die
Innovation. Dem Plan, sp&auml;ter das Amiga Anywhere zu integrieren, steht er
sehr skeptisch gegen&uuml;ber. Es sei zu vermuten, dass dadurch die Kompaktheit
und &Uuml;bersichtlichkeit verloren gehe.
</P>
<P>
Mit MorphOS habe er sich nicht n&auml;her besch&auml;ftigt, und deshalb m&ouml;chte er
sich nicht dazu &auml;u&szlig;ern.
</P>
<P>
H&auml;tte er einen &quot;kompatiblen Rechner&quot;, w&uuml;rde Timo vermutlich f&uuml;r das
Amiga Anywhere entwickeln, eher noch als f&uuml;r AmigaOS 4. Da er aber nur
einen 68k-Amiga habe, er&uuml;brige sich die Frage. Dennoch werde &quot;Ermentrud&quot;
auch auf dem Amiga Anywhere laufen, da Computer City die Adventure-Engine
&quot;Inga&quot; portiere.
</P>
<BR><BR>
<P>
Last but not least die Meinung von Stefan Schulze (Dreamworlds): Zum
AmigaOS 4 denkt er, dass es durch den &quot;bekannten&quot; Namen einen leichten
Vorteil h&auml;tte, es im Endeffekt aber mangels Interesse seitens Nicht-Amiga-
Usern und der Treiber-Problematik zum Scheitern verurteilt sei.
</P>
<P>
MorphOS war seiner Meinung nach bereits tot, als es angefangen wurde - aus
denselben Gr&uuml;nden. Au&szlig;erdem fehle hier der Namensvorteil, der nicht durch
ausreichend Marketing wettgemacht werde.
</P>
<P>
Einzig dem Amiga Anywhere gibt er eine kleine Chance, wenn die Programme
wirklich den PDA- und Desktop-Markt abdeckten. Im Endeffekt sei aber zu
vermuten, dass es nie interessante Software geben werde.
</P>
<BR><BR>
<P>
In der n&auml;chsten Ausgabe werdet ihr noch weitere Meinungen finden k&ouml;nnen.
</P>
<P><B>Oliver Tacke &lt;<A HREF="mailto:oliver@aakt.de">oliver@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele8.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
