<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Workshops2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Workshops
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>3. Workshop: AFPL Ghostscript 6.50 - Teil 2 (von Uwe Pannecke)</H2>
<P><B>Crash-Kurs durch die Ghostscript-Untiefen</B></P>
<H3>1. Der Zug der (Amiga-) Zeit</H3>
<P>
Obwohl am Ende des ersten Teils in der Februarausgabe 2002 bereits f&uuml;r das
nachfolgende M&auml;rz-Magazin dieses Jahres angek&uuml;ndigt, lie&szlig; die
Fertigstellung der Fortsetzung doch noch einige Monate auf sich warten.
Damit reiht sich dieser Workshop in das allgemeine Gebaren rund um den
Amiga nahtlos ein und geh&ouml;rt dennoch trotz seiner dreimonatigen Versp&auml;tung
zu den blitzschnellen Ver&ouml;ffentlichungen auf dem Amiga-Markt... Damit genug
der Rechtfertigungsversuche.
</P>
<P>
Tauchen wir lieber ein in die kryptische, aber dennoch interessante
Ghostscript-Welt. Wie bereits im ersten Teil, muss auch f&uuml;r alle
nachfolgenden Ausf&uuml;hrungen als Versuchskaninchen wieder das Amiga-Release 2
des Interpreters von R&uuml;diger Hanke [1] herhalten. Wir gehen deshalb davon
aus, Ghostscript entsprechend des ersten Teiles installiert in eurem Amiga-
System vorzufinden.
</P>
<H3>2. Jammertal</H3>
<P>
So leistungsf&auml;hig der freie Postscript-Interpreter auch ist, so spr&ouml;de
zeigt er sich in der Bedienung. Keine grafische Oberfl&auml;che verw&ouml;hnt den
Amiganer, Ghostscript besteht auf Tuchf&uuml;hlung, beinahe hautengen Kontakt
&uuml;ber die Kommandozeile. Auch wenn dem Maus-Fetischisten bei dieser Aussicht
die Haare zu Berge stehen sollten, kann so doch die Shell wieder einmal
ihre Daseinsberechtigung unter Beweis stellen. Und dem Amiganer bietet sich
eine gute Gelegenheit, mit dem Traktieren der Tastatur zumindest kurzzeitig
Ablenkung finden und seinen Geist &uuml;ber das Jammertal der aktuellen Amiga-
Situation erheben zu k&ouml;nnen.
</P>
<H3>3. Geborgen in der Muschel</H3>
<P>
Auch wenn wir den gesamten zweiten Teil des Workshops in der Shell
verbringen, l&auml;sst sich mit dem dargelegten am Ende des Kurses (vielleicht
noch in diesem Jahr ;) ) recht einfach eine mausgesteuerte Bedienung des
Interpreters selbst zusammenbasteln.
</P>
<P>
Doch jetzt ab in die sch&uuml;tzende H&uuml;lle der Shell:
</P>
<H4>3.1 Geisterbeschw&ouml;rung</H4>
<P>
Mit &quot;CD Ghostscript:&quot; landen wir umgehend im Heimatverzeichnis des
Postscript-Interpreters. Bevor wir den dienstbaren Geist aus seiner Flasche
entlassen, m&uuml;ssen wir ihm ausreichend Bewegungsfreiheit verschaffen. Die
Kommandofolge &quot;Stack 200000&quot; setzt den Stapelspeicher auf die erforderliche
H&ouml;he und beugt unvermittelten Abst&uuml;rzen des Programms vor. Wir bitten
Ghostscript mit &quot;gs --help&quot;, sich uns vorzustellen.
</P>
<P>
 <A HREF="img/gs650II_help.png"><IMG SRC="thumb/gs650II_help.jpg" WIDTH="120" HEIGHT="81" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Neben seinem Namen, der Version und seinen Sch&ouml;pfern verr&auml;t uns der
Interpreter einiges &uuml;ber seine Bedienung, indem er uns die prinzipiellen
Aufrufoptionen mitteilt. Anschlie&szlig;end kann er es sich nicht verkneifen, mit
seinen erstaunlichen F&auml;higkeiten zu protzen, und teilt uns unter &quot;Available
devices&quot; die ihm zur Verf&uuml;gung stehenden 'Ger&auml;te' oder Treiber f&uuml;r die
Manipulation der Postscript- oder PDF-Dateien mit.
</P>
<P>
Eine wichtige Information steckt im unteren Drittel der Fensterausgabe: Mit
den Angaben hinter &quot;Search path&quot; informiert uns das Programm, wo es nach
Initialisierungsdateien und Schriften f&uuml;r die Interpretation der
&uuml;bergebenen Dateien suchen wird. In der Standard-Installation wird
Ghostscript die passenden Daten in den Verzeichnissen &quot;Ghostscript:lib&quot;
und &quot;Ghostscript:fonts&quot; finden. Solltet ihr zus&auml;tzliche Schriften oder
spezielle Initialisierungsdateien in separaten Verzeichnissen abgelegt
haben (oder sp&auml;ter einmal ablegen), k&ouml;nnt ihr mit &quot;SetEnv GS_LIB
Pfadangabe(n)&quot; diese dem Interpreter bekannt machen.
</P>
<H4>3.2 Dokumentenschau</H4>
<P>
Eine zentrale Aufgabe Ghostscripts ist die Pr&auml;sentation von Postscript- und
PDF-Dateien. Wollt ihr als Ausgabeger&auml;t den Workbench-Bildschirm nutzen,
reicht es v&ouml;llig aus, dem Programm lediglich den Dateinamen einschlie&szlig;lich
komplettem Pfad zu &uuml;bergeben. Im &quot;Examples&quot;-Verzeichnis finden wir eine
Reihe gut geeigneter Dateien f&uuml;r unsere Tests.
</P>
<P>
Die Eingabe &quot;gs examples/tiger.ps&quot; pr&auml;sentiert nach kurzer Zeit den
wohlbekannten Tigerkopf in einem Workbench-Fenster.
</P>
<P>
Wird wie im gerade angef&uuml;hrten Fall kein Device explizit an Ghostscript
&uuml;bermittelt, verwendet das Programm das &quot;amiga&quot;-Ger&auml;t und damit die
Workbench als Ausgabemedium. Das gleiche Ergebnis h&auml;tte die Eingabe
&quot;gs sDEVICE=amiga examples/tiger.ps&quot; verursacht. Und mit letzterem wird
auch der Weg aufgezeigt, alle weiteren unterst&uuml;tzen Ausgabeger&auml;te
einzubinden. So sorgt etwa &quot;gs sDEVICE=amiga_custom examples/tiger.ps&quot; f&uuml;r
die Nutzung eines eigenen Bildschirms, der &uuml;ber einen Bildschirm-Requester
aus der vorhandenen Palette ausgew&auml;hlt werden kann.
</P>
<P>
 <A HREF="img/gs650II_req.png"><IMG SRC="thumb/gs650II_req.jpg" WIDTH="46" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Wollt ihr bei der Bildschirmausgabe die Gr&ouml;&szlig;e des Fensters definieren,
stehen euch die Optionen &quot;-dDEVICEWIDTH=Wert1&quot; f&uuml;r die Bildschirmbreite und
&quot;-dDEVICEHEIGHT=Wert2&quot; f&uuml;r die Bildschirmh&ouml;he zur Verf&uuml;gung. Alternativ
kann der Schreibfaule auch &quot;-gWert1xWert2&quot; verwenden. Mit &quot;gs sDEVICE=amiga
-dDEVICEHEIGHT=640 -dDEVICEWIDTH=480 examples/tiger.ps&quot; etwa ist die
maximale Fenstergr&ouml;&szlig;e auf der Workbench mit 640x480 Pixel festgelegt.
Da die Seitengr&ouml;&szlig;e im Dokument nicht automatisch an die Fenstergr&ouml;&szlig;e
angepasst wird, ist bei Beschr&auml;nkung der Fenstergr&ouml;&szlig;e in vielen F&auml;llen nur
noch ein Teil des Seiteninhalts zu sehen. Dem k&ouml;nnt ihr in diesem und
&auml;hnlich gelagerten F&auml;llen mit einer Vorgabe zur darzustellenden Aufl&ouml;sung
begegnen. Die Option &quot;-dDEVICEXRESOLUTION=WertX&quot; legt die horizontale
Ger&auml;teaufl&ouml;sung und &quot;-dDEVICEYRESOLUTION=WertY&quot; entsprechend die vertikale
Aufl&ouml;sung fest. Wieder haben Schreibfaule Gl&uuml;ck: Die Optionen lassen sich
mit &quot;-rWertXxWertY&quot; deutlich abgek&uuml;rzt gleichberechtigt verwenden.
Wird lediglich mit einem Wert die Aufl&ouml;sung bestimmt, bleiben auf jeden
Fall die Proportionen der urspr&uuml;nglichen Seite erhalten.
</P>
<P>
 <A HREF="img/gs650II_view.png"><IMG SRC="thumb/gs650II_view.jpg" WIDTH="92" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Mit entsprechend gew&auml;hlten Werten k&ouml;nnt ihr nat&uuml;rlich auch die
Seitenproportionen nach euren W&uuml;nschen beinahe beliebig verzerren. Dies
gilt gleicherma&szlig;en f&uuml;r die Druckausgabe.
</P>
<P>
Apropos Druckausgabe: Wer die Datei lieber Schwarz auf Wei&szlig; oder gar farbig
in den H&auml;nden halten m&ouml;chte, kann aus einer ganzen Reihe von Druckger&auml;ten
ausw&auml;hlen. Da w&auml;re zuallererst das Device &quot;amiga_printer&quot; zu nennen, das
f&uuml;r eine Ausgabe &uuml;ber den eingestellten Workbench-Druckertreiber zust&auml;ndig
ist. Dar&uuml;ber hinaus stehen diverse Laser- und Deskjet-Treiber als
dienstbare Ger&auml;tetreiber parat. Und alle Turboprint-Freunde werden sich
&uuml;ber einen eigens f&uuml;r das Druckprogramm mitgelieferten Treiber
einschlie&szlig;lich Dokumentation freuen.
</P>
<H3>4. Eine endlose Geschichte</H3>
<P>
Im n&auml;chsten Teil, diesmal tats&auml;chlich auch in der n&auml;chsten AMIGA-aktuell-
Ausgabe, wenden wir uns u.a. den Konvertierungsm&ouml;glichkeiten des
Interpreters zu.
</P>
<P><B>[1] im Aminet unter <A HREF="http://de.aminet.net/aminetbin/find?gfx+conv+GS650-+.lha">/gfx/conv/GS650-xxx.lha</A></B></P>
<P><B>Uwe Pannecke &lt;<A HREF="mailto:Uwe.Pannecke@t-online.de">Uwe.Pannecke@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
