<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, custrda, for, my, king">
<title>Custard: For My King</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><h1><font color="green">Custard: For My King</Font></center></h1></P>

<p>Schon seit &#252;ber einem Jahr ist der neue Longplayer der Herner Power Metaller angek&#252;ndigt - jetzt ist er endlich in For von &quot;For My King&quot; erschienen und das lange warten hat sich gelohnt. Custard pr&#228;sentieren sich auf dem neuen Album deutlich gereift, was auch an dem neuen S&#228;nger Guido Briecke liegen mag, der in die Michael Kiske (ex-Helloween) Richtung geht, womit die musikalische Marschrichtung eigentlich klar sein d&#252;rfte: Wie schon auf dem letzten (ebenfalls gutem) Longplayer &quot;Kingdoms Of Your Life&quot; (1997) spielen die Jungs melodischen Power Metal mit klaren Anleihen an die alten Helloween und Blind Guardian Scheiben - als modernere Vergleiche fallen mir sponaten HammerFall und Edguy ein. Allerdings kopieren Custard diese Bands nicht schamlos, sondern gehen sehr eigenst&#228;dnig und zudem abwechselungsreich zu Werke, was &quot;For My King&quot; zu einem wahren Highlight werden l&#228;sst: Neben dem Opener &quot;Up To The Sky&quot;, k&#246;nnen vor allem die 
Hymnen &quot;I Know You&quot;, &quot;Signs&quot; und &quot;Freedom For All&quot;, welches in der Machart mit 
vielen Anspielungen auf &#228;ltere Custard Tracks an Manowar`s &quot;Blood Of The Kings&quot; erinnert, &#252;berzeugen und sind Killer im wahrsten Sinne des Wortes - wer von den neuen HammerFall und Helloween Alben entt&#228;uscht ist, wird mit diesen 4 Kompositionen mehr als nur entsch&#228;digt. Dazu gibt`s mit &quot;Charon`s Call&quot; ein deutlich gem&#228;&#223;igteres St&#252;ck sowie mit &quot;Deliver Me&quot; eine reinrassige Ballade mit G&#228;nsehautfaktor, die durchaus an die Klasse von &quot;Fading Memories&quot; vom Vorg&#228;ngeralbum heranreichen kann. Und f&#252;r Die-Hard Custard Fans, die die Band schon seit Jahren verfolgen, hat die Band &quot;Trees Of Hope&quot; von der selbst produzierten Mini EP (erschienen 1994) komplett neu eingespielt und wie zu erwarten war, hat diese schleppende Hymne auch anno 2000 nichts von ihrem Charme verloren. Ihr habt es sicherlich schon gemerkt: Die neue Custard CD hat mich komplett &#252;berzeugt und entsch&#228;digt f&#252;r die lange Wartezeit. Hier 
ist wirklich eine Band am Start, die nicht erst seit dem Erfolg von HammerFall auf der melodischen Power Metal Schiene 
f&#228;hrt, sondern dies seit Jahren tut - man merkt deutlich, da&#223; &quot;For My King&quot; deutlich ausgereifter ist, als diverse Releases der letzten Monate in diesem Bereich. Lange Redem kurzer Sinn: Lasst &quot;For My King&quot;, trotz des platten Covers, nicht links liegen, sofern Ihr auf Acts wie (alte) Helloween, HammerFall oder auch Gamma Ray steht - Ihr werdet es garantiert nicht bereuen!</P>

<p>Fazit: 10 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd2.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
