<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, grave, digger, konzert">
<title>Konzertbericht: Grave Digger</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="yellow">Konzertbericht: Grave Digger</Font></center></h1></P>


<p>Grave Digger luden zum 20 j&#228;hrigen Bandjubil&#228;um in die Bochumer Zeche ein und das dieser Abend etwas ganz besonderes werden w&#252;rde, war irgendwie schon im Vorfeld klar. Schade nur, da&#223; das angek&#252;ndigte Live Album / Video, welches man im Januar ebenfalls in der Bochumer Zeche mitgeschnitten hatte, an diesem Abend nicht ver&#246;ffentlicht wurde. </P>

<p>Daf&#252;r haben sich Grave Digger f&#252;r den Konzertteil des Abends einiges einfallen lassen: Da man auf eine Vorgruppe verzichtet hat, hatte man gleich viel mehr Zeit zur Verf&#252;gung, die die Band auch ausgiebig nutzte: So hat man extra f&#252;r diesen Abend zwei Sets aus dem Boden gestampft: Das erste Set enthielt ausschlie&#223;lich Rarit&#228;ten sowie St&#252;cke, die man ansonsten noch nie Live gepsielt hatte, wobei sogar ein Song aus der unbekannten Digger &#196;ra (&quot;Stand Up And Rock&quot;) sowie eine absolute Rarit&#228;t, die nur auf einer Maxi CD im Jahre `85 als B-Seite verbraten wurde, Live von der Band runtergezockt wurde. S&#228;nger Chris Boltendahl lie&#223; es sich zudem nicht nehmen, die einzelnen Songs zu kommentieren und auch ausf&#252;hrlicher auf die History von Grave Digger einzugehen. Aber auch aktuellere St&#252;cke wie etwa &quot;The Bruce&quot; (vom `96er Hammer Album &quot;Tunes Of War&quot;), &quot;Assasins&quot; (vom `98er Album &quot;Knights Of The Cross&quot;) sowie &quot;The Spell&quot; vom nach wie vor aktuellen Album &quot;Excalibur&quot; fanden sich im ersten Set wieder. Somit war das erste 
Set insbesondere f&#252;r langj&#228;hrige Fans dieser Kapelle interessant, denn es enthielt wirklich Songs, die man nun wirklich nicht erwartet h&#228;tte. Zudem spaarte die Band auch nicht an optischen Feinheiten, so da&#223; des h&#228;ufigeren Pyros gez&#252;ndet wurden. Verst&#228;ndlich, da&#223; die Meute in der ausverkauften Zeche von den ersten T&#246;nen an total begeistert mitging, obwohl ich mir sicher bin, da&#223; nur sehr, sehr wenige wirklich alle Songs aus diesem ersten Set kannten. </P>

<p>Der &#220;bergang zum zweiten Set war flie&#223;end - sprich: es fand keinerlei Pause oder &#228;hnlicher Schnickschnack statt. Im zweiten Set wurden dann die zahlreichen Klassiker der Band gespielt, die von &quot;The Reaper&quot;, &quot;Headbanging Man&quot;, &quot;Rebellion&quot;, &quot;Knights Of The Cross&quot; bis hin zum kr&#246;nenden Abschluss &quot;Heavy Metal Breakdown&quot; reichten und die Fans vor der B&#252;hne in wahre Extase trieb. Neben den optischen Spielereien wurde das zweite Set insbesondere durch die zahlreichen Gastmusiker, die sich an diesem Abend die Ehre gaben, interessant: Die wohl Prominentesten d&#252;rften Markus Grosskopf und Michael Weikath von Helloween gewesen sein - zum ersten Mal in der History von Grave Digger waren zwei Gitarristen und zwei Bassisten auf der B&#252;hne, auch wenn ich sagen muss, da&#223; ich Michael Weikath aufgrund seiner total bescheuerten Art am liebsten zum Mond geschossen h&#228;tte (gilt auch f&#252;r Helloween Konzerte, von denen ich gro&#223;er Fan bin). Nicht weniger prominent d&#252;rften auch Peavy Wagner und Victor Smolski von Rage gewesen sein, die 
Grave Digger ebenfalls tatkr&#228;ftig unter die Arme griffen. Ansonsten gaben sich an diesem Abend noch die Jungs von Brimstone sowie Andreas &quot;Piesel&quot; K&#252;stner (neuer Gitarrist von Iron Savior) die Ehre. Ach ja, beinahe h&#228;tte ich vergessen, da&#223; bei &quot;Heavy Metal Breakdown&quot; noch der allererste Grave Digger Drummer (bitte fragt jetzt nicht nach dem Namen) hinter der Schie&#223;bude sa&#223;. Aber selbst in diesen megageilen zweieinhalb Stunden hat es die Combo nicht geschafft, s&#228;mtliche Highlights der bisherigen Karriere unterzubringen: So fehlten mir z.B. Songs wie &quot;The Dark Of The Sun&quot; oder auch &quot;The Battle Of Bannockborn&quot;, was den geilen Abend aber nicht wirklich schm&#228;lern konnte, denn auch die Performance der Band war erwartunsgem&#228;&#223; astrein und man merkte deutlich, da&#223; sich die Band auf diesen Abend gefreut hatte. So waage ich auch schlie&#223;lich die These, da&#223; dieser Gig der bisher beste in diesem Jahr war und sogar noch &#252;ber dem von Iron Maiden (der f&#252;nf Tage vorher stattfand) anzusiedeln ist. Selbst wenn man nur einen Bruchteil des Materials dieser Band kannte, konnte man den Abend wirklich genie&#223;en und seinen Spa&#223; haben. An dieser Stelle Greetings an die junge Dame vor mir, die sich doch tats&#228;chlich &#252;ber die Tatsache beschwerte, von hinten ein wenig gedr&#252;ckt zu werden (das ist bei Metal Konzerten in den ersten Reihen nunmal so...) und an all die Idioten, die meinen, in der Zeche unbedingt Crowdsurfing betreiben zu m&#252;ssen (Leute, Leute - bei Hallen in der Gr&#246;&#223;e der Grugahalle ist das ja voll in Ordnung, aber in der recht kleinen Zeche ist das nur noch nervig). Wer diesen Gig verpasst hat, der hat aus meiner Sicht, wohl DAS Konzert im Jahre 2000 verpasst. Yup!  </P>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
