<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<TITLE>Verschiedenes</TITLE>
</HEAD>

<BODY background="images/bga.gif" text="#000000" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="Seitenlayout mit Rand">
<TR>
<TD>
<A name="top"></A> 

<P align="center"><FONT color="#000080" size="7"><B>Verschiedenes</B></FONT></P>

<H3>Inhalt:</H3>

<UL>
<LI><A href="#a01">650 Millionen-Defizit der Pflegeversicherung</A></LI>

<LI><A href="#a02">Gleiche Rechte und Chancen in Frankreich</A></LI>

<LI><A href="#a03">Parkpl&auml;tze sind die gr&ouml;&szlig;ten "Problemzonen"</A></LI>

<LI><A href="#a04">Sie kosten die Gesellschaft mehr als Sie einbringen</A></LI>

<LI><A href="#a05">Peer Counseling - Kurs in Linz</A></LI>

<LI><A href="#a06">Grammy f&uuml;r den kleinen S&auml;nger mit gro&szlig;er Stimme</A></LI>

<LI><A href="#a07">Keine &Uuml;bernahme der Praxisgeb&uuml;hren durch Sozialamt</A></LI>

<LI><A href="#a08">Handlungsfelder und Ziele gesellschaftlicher Teilhabe</A></LI>

<LI><A href="#a09">Barrierefreier Zugang zu neuen Medien</A></LI>

<LI><A href="#a10">Ombudsmann f&uuml;r Autofahrer</A></LI>

<LI><A href="#a11">Systemwechsel in der Pflege gefordert</A></LI>

<LI><A href="#a12">Barrierefreiheit, Verkehr und keine Zielvereinbarung</A></LI>

<LI><A href="#a13">Barrierefreie Internetangebote</A></LI>

<LI><A href="#a14">Kein Geld mehr f&uuml;r Berliner Telebuszentrale</A></LI>

<LI><A href="#a15">ORF: &laquo;TV-Angebot ist unterdurchschnittlich&raquo;</A></LI>

<LI><A href="#a16">Berliner Gespr&auml;che zur Digitalen Integration</A></LI>

<LI><A href="#a17">Aufregung &uuml;ber &laquo;Gesundheitsreform&raquo; l&auml;sst nicht nach</A></LI>

<LI><A href="#a18">Kritik an Bundespr&auml;sident Rau</A></LI>

<LI><A href="#a19">Clowns im Krankenhaus</A></LI>
</UL>
<HR>
<A name="a01"></A> 

<H3>650 Millionen-Defizit der Pflegeversicherung</H3>

<P>Berlin (kobinet) Das Defizit in der Pflegeversicherung war im
vergangenen Jahr mit 650 Millionen Euro so hoch wie nie. Nach aktuellen
Presseberichten liegt das Minus damit um 70 Prozent h&ouml;her als im Jahr
2002, zu diesem Zeitpunkt lag das Defizit bei 380 Millionen Euro.</P>

<P>In den ersten drei Quartalen 2003 habe die Pflegeversicherung nach
Berechnungen des Verbands der Angestellten Krankenkassen (VdAK) ein Defizit
von 673 Millionen Euro angeh&auml;uft. Durch die besseren Einnahmen im
vierten Quartal (Weihnachtsgeld) werde das Defizit voraussichtlich auf rund
650 Millionen Euro sinken. Noch im vergangenen Herbst war der VdAK von
einem Minus von 450 bis 500 Millionen Euro f&uuml;r 2003 ausgegangen. Seit
1999 verzeichnet die Pflegeversicherung einen Ausgaben&uuml;berhang. Mit
den Verlusten aus dem Jahr 2003 w&uuml;rde sich die R&uuml;cklage der
Pflegeversicherung auf 4,28 Milliarden Euro verringern. hjr</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a02"></A> 

<H3>Gleiche Rechte und Chancen in Frankreich</H3>

<P>Von Fran&ccedil;oise Letroite Paris (kobinet) Der Entwurf eines
Gleichstellungsgesetzes f&uuml;r behinderte Menschen ist nach l&auml;ngerer
Diskussion mit den Verb&auml;nden der Betroffenen in Frankreich von
Staatssekret&auml;rin Marie-Th&eacute;r&egrave;se Boisseau vorgestellt
worden. Im Kabinett von Premierminister Jean-Pierre Raffarin hat sich die
Staatssekret&auml;rin f&uuml;r behinderte Menschen daf&uuml;r stark
gemacht, dass ihr Amt nicht als enge Ressortangelegenheit betrachtet wird.
Am 28. Januar hat sie den Gesetzentwurf f&uuml;r die Rechts- und
Chancengleichheit, die Teilnahme und die B&uuml;rgerrechte der behinderten
Menschen vorgelegt. In den zur&uuml;ckliegenden 18 Monaten seiner
Ausarbeitung hat es ein breites Zusammenwirken mit
Betroffenenverb&auml;nden und Sozialpartnern gegeben. </P>
          
Wie die Francophilen auf der Website des Premierministers nachlesen
k&ouml;nnen, stehen drei Dinge im Vordergrund:

<UL>
<LI>den behinderten Menschen ist eine Kompensation f&uuml;r die Folgen
ihrer Behinderung zu gew&auml;hrleisten</LI>

<LI>eine effektive Teilnahme der behinderten Menschen am gesellschaftlichen
Leben ist zu erm&ouml;glichen</LI>

<LI>modernisierte und zug&auml;ngliche Dienstleistungen sind behinderten
Menschen zur Verf&uuml;gung zu stellen</LI>
</UL>

<P>Es geht darum, behinderte Menschen in Schule und Arbeit besser zu
integrieren. Das f&auml;ngt damit an, dass bei einer wirklichen schulischen
Integration behinderter Kinder prinzipiell die n&auml;chste Einrichtung
erm&ouml;glicht wird, wo Unterricht zusammen mit nicht behinderten
Mitsch&uuml;lern m&ouml;glich ist. Medizinisch-Soziale Dienste
erg&auml;nzen Bildungsangebote f&uuml;r alle.</P>

<P>Priorit&auml;t im Besch&auml;ftigungsbereich sollte - wenn immer es
m&ouml;glich ist - die T&auml;tigkeit auf dem ersten Arbeitsmarkt haben.
Dazu m&uuml;ssen die Unternehmer mobilisiert und st&auml;rker
verantwortlich gemacht werden. Damit die Anstrengungen in beispielhafter
Weise geteilt werden, soll der &ouml;ffentliche Sektor einen Fonds f&uuml;r
die Anstellung behinderter Menschen einrichten.</P>

<P>Die Staatssekret&auml;rin hat im vergangenen Europ&auml;ischen Jahr der
Menschen mit Behinderungen um Anh&auml;nger f&uuml;r den Gesetzentwurf
geworben. Ob auf Veranstaltungen oder im Chat mit Interessenten aus der
Internet-Gemeinde war die 63-J&auml;hrige aus der Bretagne aktiv. Bedenken
&uuml;ber die Finanzierbarkeit des neuen Gesetzes wurden schon von
Sozialkassen angemeldet. Mme Boisseau wird noch zu k&auml;mpfen haben,
damit das Gesetz durchkommt. Sie scheint, dazu entschlossen zu sein.
sch</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a03"></A> 

<H3>Parkpl&auml;tze sind die gr&ouml;&szlig;ten "Problemzonen"</H3>

<P>Wien (kobinet) Eine Umfrage unter den Leserinnen und Leser des
ARB&Ouml;-Klubjournals "Freie Fahrt" ergab: Parkpl&auml;tze,
Parkpl&auml;tze, Parkpl&auml;tze - dies ist mit Abstand das
gr&ouml;&szlig;te Problem, &uuml;ber welches sich Autofahrer mit
K&ouml;rperbehinderung am meisten &auml;rgern m&uuml;ssen.</P>

<P>"Die zahlreichen Reaktionen zeigen, dass vieles im Argen liegt", meint
dazu ARB&Ouml;-Behindertenberater Roland Hirtl.</P>

<P>Die Ergebnisse im Detail: 71 Prozent aller Beschwerden und Anregungen
drehten sich um das Thema Parkplatz. In erster Linie wird bem&auml;ngelt,
dass Behindertenparkpl&auml;tze oft von nichtbehinderten Menschen belegt
werden.</P>

<P>Viele Betroffene st&ouml;rt weiters, dass Behindertenparkpl&auml;tze
nicht in den Stadtpl&auml;nen aufscheinen. "N&uuml;tzliche Hinweise auf
diversen Internet-Homepages w&auml;ren eine Notl&ouml;sung", regt Roland
Hirtl an.</P>

<P>14 Prozent aller Beschwerden betreffen Tankstellen: So fehlen
Verzeichnisse &uuml;ber Tankstellen mit Bedienung, denn nicht immer sind
k&ouml;rperbehinderte Autofahrer in der Lage, Selbstbedienungstankstellen
zu nutzen: zu hohe Zapfs&auml;ulen, zu schwere Schl&auml;uche oder auch die
Stufen auf dem Weg zur Kasse erweisen sich als hinderlich.</P>

<P>"F&uuml;r die Tankstellenketten sollte es eigentlich nicht schwer sein,
Listen zur Verf&uuml;gung zu stellen - in Papierform oder im Internet",
meint dazu der ARB&Ouml;-Behindertenberater abschlie&szlig;end. lad</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a04"></A> 

<H3>Sie kosten die Gesellschaft mehr als Sie einbringen</H3>

<P>Hagen (kobinet) Rollstuhlbenutzerin Barbara Kuhlenbeck f&uuml;hlt sich
vom SPD-Abgeordneten Stiegler in einem Telefonat gedem&uuml;tigt.</P>

<P>In der WDR-Fernsehsendung "Hart aber Fair" (Mittwoch 4. Februar 20:15
Uhr) ging es um das Thema "Murks in Germany - Pannen im Reformlabor" Darin
wurde &uuml;ber die Folgen der Gesundheitsreform diskutiert. An der
Diskussionsrunde nahm unter anderem der SPD-Bundestagsabgeordnete Ludwig
Stiegler (59) teil.</P>

<P>Die schwer behinderte Barbara Kuhlenbeck aus Hagen, die die Sendung
verfolgt hatte, bat Stiegler daraufhin per Fax um einen telefonischen
R&uuml;ckruf. "Heute Morgen rief er mich tats&auml;chlich an", berichtet
Kuhlenbeck. "Ich war erst mal verbl&uuml;fft, dass &uuml;berhaupt eine
Reaktion kam. Das Gespr&auml;ch dauerte etwa 10 Minuten. Irgendwie hat es
mich noch zorniger gemacht, als ich sowieso schon war".</P>

<P>Sie habe Stiegler, der unter anderem Mitglied im Vermittlungsausschuss
des Bundestages ist, versucht ihre Situation zu erkl&auml;ren. "Ich muss
von 237 Euro im Monat leben. Davon muss ich die Praxisgeb&uuml;hr bezahlen,
die Medikamentenzuzahlungen und den Anteil an der Krankengymnastik.
Daraufhin sagte er zu mir, ich solle doch froh sein, dass ich durch das
Sozialamt abgesichert bin. Bis vor einigen Jahren w&auml;re die Absicherung
noch nicht so gut gewesen wie jetzt". Dann habe sie ihm versucht zu
verdeutlichen, dass die Gesundheitsreform die Menschen, die am meisten
Hilfe brauchen w&uuml;rden, auch am heftigsten tr&auml;fe. "Herr Stiegler
hat daraufhin gesagt, ich w&uuml;rde den Staat doch mehr Geld kosten, als
ich einbringe. F&uuml;r solche Leute wie mich w&auml;re die
Gesundheitsreform ins Leben gerufen worden, damit alle anderen Menschen
nicht soviel zahlen m&uuml;ssten." Nach dieser Aussage sei ihr die
sprichw&ouml;rtliche Spucke weg geblieben. Kuhlenbeck entt&auml;uscht: "Ich
kann nicht nachvollziehen, dass ein Abgeordneter einer angeblich sozialen
Partei mich so diskriminiert. Wie soll ich so jemanden noch w&auml;hlen?"
elba</P>

<H3>Bundestagsabgeordneter Stiegler f&uuml;hlt sich missverstanden</H3>

<P>Der Bundestagsabgeordnete Ludwig Stiegler reagiert mit einem Brief auf
die kobinet-Meldung &uuml;ber sein Telefonat mit der schwer behinderten
Barbara Kuhlenbeck. (Der Brief liegt leider nicht vor.)</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a05"></A> 

<H3>Peer Counseling - Kurs in Linz</H3>

<P>Linz (kobinet) Die Selbstbestimmt Leben Initiative in Linz l&auml;dt zu
einem Peer Counseling -Seminar vom 26. bis 28. M&auml;rz ein. Die
Veranstaltung findet unter dem Titel " Peer Counseling - Ein genauer Blick
auf eine partnerschaftliche Methode" statt.</P>

<P>Ein wichtiger Teil des Seminars sei die Selbsterfahrung, so die
Veranstalter. Sich selbst gut zu kennen, respektvoll zu behandeln und mit
Wertsch&auml;tzung zu begegnen seien Grundvoraussetzungen f&uuml;r die
Beratung von anderen. "Selbsterfahrung gibt aber auch ein Gef&uuml;hl, dass
gemachte Erfahrungen zwar gleich sein k&ouml;nnen, aber gleichzeitig immer
unterschiedlich erlebt werden. Die Probleml&ouml;sungen sind auch von den
vorhandenen M&ouml;glichkeiten abh&auml;ngig", erkl&auml;rt Klaudia
Karoliny.</P>

<P>Der zweite Teil des Seminars setzt sich mit dem Wissen und den
M&ouml;glichkeiten von Peer Counseling auseinander. Geplant sein auch
Rollenspiele zur Erprobung praktischer Beispiele. Seminarleiter ist der
behinderte Psychotherapeut Kurt Schneider aus Wien.</P>

<P>Die Veranstaltung findet im barrierefreien Volkshaus/Restaurant
Ebelsberg, 4030 Linz, in Kremsm&uuml;nsterer Str. 1 - 3, Saal 2 (Tel. 0732
309394) statt. Die Teilnahmegeb&uuml;hr betr&auml;gt 25 Euro.
Anmeldungsschluss ist der 5. M&auml;rz 2004 bei Klaudia Karoliny, Email
sli-linz@gmx.at sowie Tel. 0732 304433 bzw. dienstags, mittwochs und
freitags unter 0732 7720-15219. Dort gibt es auch weiter gehende
Informationen. elba</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a06"></A> 

<H3>Grammy f&uuml;r den kleinen S&auml;nger mit gro&szlig;er Stimme</H3>
Von Guntram Hoffmann 

<P>Wei&szlig;enfels (kobinet) Professor Thomas Quasthoff erhielt in Los
Angeles den Klassik - Grammy f&uuml;r die beste klassische
Gesangsdarbietung.</P>

<P>Der Applaus des Publikums und die Meinung von Menschen, die ihm nahe
stehen, sind Professor Thomas Quasthoff wichtiger als Auszeichnungen.
Trotzdem freue er sich nat&uuml;rlich &uuml;ber Preise, sagte der
Bassbariton, der 1999 f&uuml;r eine Aufnahme von Gustav-Mahler-Liedern den
Grammy bekam, sp&auml;ter in einem Interview. Au&szlig;erdem finde er den
Grammy " . so ein goldenes Grammophon auf einem Holzsockel" - auch "ganz
sch&ouml;n", verriet Quasthoff damals. Gl&uuml;ck f&uuml;r ihn - denn nun
kann der 44-J&auml;hrige erneut solch ein goldenes Grammophon in sein
Troph&auml;enregal stellen. Am Sonntag wurde der deutsche S&auml;nger in
Los Angeles mit einem Grammy-Award der Kategorie beste klassische
Gesangsdarbietung ausgezeichnet. Pr&auml;miert wurde Quasthoffs Leistung
bei der 46. Verleihung der "Oscars der Musikindustrie" gemeinsam mit der
aus Schweden stammenden Mezzosopranistin Anne Sofie von Otter.</P>

<P>Thomas Quasthoff wurde 1959 in Hildesheim geboren. Bereits als
13-J&auml;hriger studierte er Gesang, Musiktheorie und -geschichte. Seine
berufliche Laufbahn begann er als Sprecher beim Norddeutschen Rundfunk -
wechselte aber schon bald in die Kunst.</P>

<P>Auf eine Opernkarriere verzichtete der mit den Folgen des Medikaments
Contergan lebende, nur 1,34 Meter gro&szlig;e S&auml;nger zun&auml;chst.
Als Konzert-, Lied,- und Oratoriens&auml;nger machte er jedoch schnell
Karriere. In Europa konzertierte er unter anderen mit den Berliner und
Wiener Philharmoniker, dem Londoner Philharmonic Orchestra und dem London
Symphony Orchestra. Er arbeitete mit Dirigenten wie Daniel Barenboim, Kurt
Masur und Christian Thielemann. Ber&uuml;hmt wurde er dabei vor allem mit
seinen Schubert- und Bachinterpretationen. 1995 gab Quasthoff sein
Amerikadeb&uuml;t und ist seither regelm&auml;&szlig;iger Gast der
gro&szlig;en US-Klangk&ouml;rper und der wichtigsten Festivals.</P>

<P>Bei den Salzburger Osterfestspielen 2003 sang Quasthoff unter dem
Dirigat von Sir Simon Rattle in "Fidelio" erstmals auch einen Opernpart.
Au&szlig;erdem ist der vielseitige S&auml;nger in Jazz-Formationen zu
h&ouml;ren. elba</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a07"></A> 

<H3>Keine &Uuml;bernahme der Praxisgeb&uuml;hren durch Sozialamt</H3>

<P>Neustadt/Weinstra&szlig;e (kobinet) Im Rahmen einer Eilentscheidung
(Az.: 4 L 441/04.NW) hat das Verwaltungsgericht Neustadt am 20. Februar
beschlossen, dass das Sozialamt nicht f&uuml;r die Praxisgeb&uuml;hren und
Medikamentenzuzahlungen aufkommen muss. Geklagt hatte eine
Sozialhilfeempf&auml;ngerin, deren Kosten vor der Gesundheitsreform vom
Sozialamt getragen wurden.</P>

<P>Die Richter verwiesen darauf, dass seit Einf&uuml;hrung der
Gesundheitsreform auch Sozialhilfeempf&auml;nger bis zur Erreichung der
jeweiligen &Uuml;berforderungsklausel (zwei Prozent, bzw. ein Prozent bei
Vorliegen einer chronischen Erkrankung) selbst f&uuml;r die Zuzahlungen
aufkommen m&uuml;ssen. Erst wenn dieser Betrag &uuml;berschritten
w&uuml;rde, m&uuml;ssten die Kassen leisten.</P>

<P>Die Hilfeempf&auml;ngerin kann gegen den Beschluss Beschwerde beim
Oberverwaltungsgericht Rheinland-Pfalz einlegen. elba</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a08"></A> 

<H3>Handlungsfelder und Ziele gesellschaftlicher Teilhabe</H3>
Von kobinet-Korrespondent Franz Schmahl 

<P>Berlin (kobinet) Mit einer Diskussionsrunde von Politikern aller
Bundestagsparteien ging heute in Berlin die Bilanzveranstaltung zum
Europ&auml;ischen Jahr der Menschen mit Behinderungen zu Ende. Die Tagung
stand unter dem Motto &laquo;Teilhabe gestalten&raquo;. Teilnehmer wie
Matthias Vernaldi warnten davor, dass Selbstbestimmung und Gleichstellung
durch eine Politik sozialen Kahlschlags gef&auml;hrdet sind.</P>

<P>Nachdem am ersten Tag Reden und Statements die Tagesordnung teilweise
&uuml;ber Geb&uuml;hr belasteten, waren heute in parallelen Workshops
Handlungsfelder und Ziele gesellschaftlicher Teilhabe zu umrei&szlig;en. Zu
Ausbildung und Besch&auml;ftigung, Krankheit und Gesundheit, Assistenz und
Budget, Diskriminierung und Gleichstellung, Barrierefreiheit und Verkehr
sowie Ethik und Behinderung wurde keineswegs konfliktscheu und auch
kontrovers diskutiert. Bei der abschlie&szlig;enden Diskussionsrunde
&laquo;Wie steht die Politik zu den Vorschl&auml;gen?&raquo; war der
ehemalige Bundestagsabgeordnete Dr. Ilja Seifert der einzige
Behinderte.</P>

<P>Nicht auf diese Runde gem&uuml;nzt, sondern speziell den Auftritt des
vom Bundesjustizministeriums zu dieser Tagung Gesandten kritisierend, hatte
Gisela Hermes bemerkt: &laquo;Ziemlich unverfroren, was uns Politiker hier
aufgetischt haben.&raquo; Hermes vom Bildungs- und Forschungsinstitut zum
selbstbestimmten Leben Behinderter, die mit Swantje K&ouml;bsell in Bremen
die Sommeruni &laquo;Disability Studies in Deutschland - Behinderung neu
denken!&raquo; koordiniert hatte, fand den Vorschlag eines nationalen
Kompetenzzentrums interessant, in dem zum Beispiel Sachverstand zum Thema
Barrierefreiheit geb&uuml;ndelt werden k&ouml;nnte.</P>

<P>Barrierefreiheit war auf der Veranstaltung im Berliner Maritim Hotel in
der Friedrichstra&szlig;e auch ganz praktisch zum Thema geworden. Der
Aufzug am Bahnhof Friedrichstra&szlig;e war seit Wochenbeginn mal wieder
defekt. Teilnehmerinnen und Teilnehmer mussten sich auf abenteuerliche
Weise vom Bahnsteig herunter tragen lassen oder weitere Umwege machen.
&laquo;Diesen Treppenwitz habe ich zum Wettbewerb eingereicht, zu dem
Behindertenbeauftragter Haack aufgerufen hat&raquo;, sagte die Berlinerin
Brigitte Wosnitza. Wegen eines fehlenden Ersatzteils sei mit einer
Reparatur erst nach Konferenzende zu rechnen. Nach mehreren Beschwerden
wurde ein Hinweis am Lift angebracht: Leider defekt! &laquo;Das ist doch
schon ein Fortschritt&raquo;, kommentierte sarkastisch Dr. Irina
Pf&uuml;tzenreuter, die fr&uuml;here Projektleiterin des abgewickelten
Movado-Projekts &laquo;Barrierefreies Berlin&raquo;. Die Bahn bedauert
immerhin die H&uuml;rde, die sie f&uuml;r Reisende auf einem wichtigen
Hauptstadt-Bahnhof zu verantworten hat.</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a09"></A> 

<H3>Berliner Gespr&auml;che: Barrierefreier Zugang zu neuen Medien</H3>

<P>Zu Berliner Gespr&auml;chen &uuml;ber den barrierefreien Zugang zu neuen
Medien hat die Stiftung Digitale Chancen am 24. Februar in das Museum
f&uuml;r Kommunikationn eingeladen. Es geht bei dieser Inititiative um den
barrierefreien Zugang zu Arbeitsmarktangeboten und
Verwaltungsdienstleistungen, um das Behindertengleichstellungsgesetz und
die entsprechende Verordnung BIT-V.</P>

<P>Die Berliner Gespr&auml;che zur Digitalen Integration werden vom
Bundesministerium f&uuml;r Wirtschaft und Arbeit veranstaltet und von der
Stiftung Digitale Chancen inhaltlich und organisatorisch betreut. Mit der
Einrichtung dieses Arbeits- und Dialogkreises sollen
Bev&ouml;lkerungsgruppen, die bisher noch keinen Zugang gefunden haben,
f&uuml;r die Chancen des Internet interessiert werden.</P>

<P>In der &ouml;ffentlichen Diskussion wird die Frage der Digitalen
Integration nur noch wenig wahrgenommen. Auch die Medien befassen sich eher
mit den Risiken als mit den Chancen der Nutzung des Internet. Von der
Politik werden in den jeweiligen Ressorts die verschiedenen Aspekte der
Problematik behandelt, w&auml;hrend die Wissenschaft versucht, die
Erkenntnisse um die sozialen, &ouml;konomischen oder bildungspolitischen
Ursachen des Ph&auml;nomens zu vertiefen. Unternehmen engagieren sich in
Public-Private-Partnerships.</P>

<P>Die Berliner Gespr&auml;che dienen als runder Tisch, an dem die offenen
Fragen gemeinsam diskutiert und L&ouml;sungen gefunden werden k&ouml;nnen.
Mit dabei kobinet-Redaktionsmitglied Hubertus Thomasius. sch</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a10"></A> 

<H3>Ombudsmann f&uuml;r Autofahrer</H3>

<P>F&uuml;r gehandicapte Autofahrer in Deutschland gibt es jetzt einen
Ombudsmann, wurde diese Woche aus Baden-W&uuml;rttemberg bekannt: Oliver
Raach ist von der Handwerkskammer Reutlingen als Sachverst&auml;ndiger
f&uuml;r die Versorgung K&ouml;rperbehinderter &ouml;ffentlich bestellt und
vereidigt worden. Bei strittigen Fragen zur Umr&uuml;stung eines Autos
steht er bundesweit als Ansprechpartner (Telefon 07388/999566) zur
Verf&uuml;gung.</P>

<P>Der 39-j&auml;hrige Kfz-Meister arbeitet als Diplom-Betriebswirt
f&uuml;r Paravan, eine Umr&uuml;sterfirma in Aichelau. Das
mittelst&auml;ndische Unternehmen auf der Schw&auml;bischen Alb betreut mit
einem Netz von Vertragspartnern Kunden in Deutschland, &Ouml;sterreich und
der Schweiz. Oliver Raach ist f&uuml;r das Marketing zust&auml;ndig. In
seiner Freizeit dirigiert er ein Blasorchester, die Melchinger
Lauchertmusikanten.</P>

<P>In seinem Betrieb werden im Jahr rund 500 Autos umger&uuml;stet. Ein
spezielles Pr&uuml;f- und Messfahrzeug erm&ouml;glicht dem Kunden im
Vorfeld, an einer ma&szlig;geschneiderten L&ouml;sung mitzuwirken. Es
k&ouml;nnen Kr&auml;ftemessungen und Pr&uuml;fungen der
Bewegungsabl&auml;ufe durch ein kompatibles Lenk- und Bremssystem mit
austauschbaren Bedienelementen wie beispielsweise einem Joystick oder einem
Minilenkrad vorgenommen werden. sch</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a11"></A> 

<H3>Systemwechsel in der Pflege gefordert</H3>

<P>Berlin (kobinet) Angesichts des neuerlichen Rekorddefizits in der
Pflegeversicherung fordert der Parit&auml;tische Wohlfahrtsverband, die
Pflegeversicherung durch ein steuerfinanziertes Bundesleistungsgesetz zu
ersetzen. &laquo;Wir k&ouml;nnen uns das Ausbleiben notwendiger Reformen
nicht leisten, w&auml;hrend ein ganzer Sozialversicherungszweig gegen die
Wand f&auml;hrt&raquo;, so Barbara Stolterfoht, Vorsitzende des Verbandes
und ehemaliges Mitglied der R&uuml;rup-Kommission.</P>

<P>Trotz der enormen Defizite der Pflegeversicherung (kobinet 3.02.04)
seien deren Leistungen ungen&uuml;gend. Ursache daf&uuml;r sei die
mangelnde Ber&uuml;cksichtigung von Altersdemenz und die fehlende
Dynamisierung der Leistungen. Barbara Stolterfoht forderte deshalb einen
radikalen Systemwechsel: &laquo;T&auml;glich erweist sich aufs Neue, dass
die Defizite in der Pflege nicht innerhalb des Systems gel&ouml;st werden
k&ouml;nnen. Wir brauchen deshalb einen Systemwechsel, von einer
Teilkaskoversicherung hin zu einem steuerfinanzierten
Bundesleistungsgesetz.&raquo;</P>

<P>Dem Konzept des Parit&auml;tischen Wohlfahrtsverbandes zufolge soll die
Pflege k&uuml;nftig f&uuml;r eine Mehrheit der Pflegebed&uuml;rftigen
vollst&auml;ndig aus Steuermitteln finanziert werden. Die administrative
Umsetzung soll dagegen bei St&auml;dten und Gemeinden liegen. Daf&uuml;r
sollen diejenigen, die es sich leisten k&ouml;nnen, anders als jetzt bei
der Pflegeversicherung k&uuml;nftig vorrangig zur Finanzierung herangezogen
werden. &laquo;Ein solches Konzept entlastet Versicherte, Arbeitgeber und
Kommungen und verhindert, dass Pflegebed&uuml;rftige in die Sozialhilfe
fallen. Gleichzeitig ist eine Finanzierung aus einer Hand effizient. Die
Pflegeversicherung hat sich zu einem b&uuml;rokratischen Monster
entwickelt, deshalb m&uuml;ssen wir eine Alternative an ihre Stelle
setzen&raquo;, so Stolterfoht.</P>

<P>Eine generationengerechte Finanzierung eines
Bundespflegeleistungsgesetzes k&ouml;nnte durch die vom
Bundesverfassungsgericht geforderte Neuregelung der Erbschaftssteuer
gew&auml;hrleistet werden. &laquo;Die Kehrseite des demographischen
Problems der Sozialversicherungen ist, dass immer gr&ouml;&szlig;ere und
zahlreichere Erbschaften auf immer weniger Nachkommen entfallen. Eine
modernisierte Erbschaftssteuer w&auml;re deshalb als Gegenfinanzierung
eines Bundesleistungsgesetzes hervorragend geeignet&raquo;, sagte
Stolterfoht. sch</P>

<P>Sven Dosch</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a12"></A> 

<H3>Barrierefreiheit, Verkehr und keine Zielvereinbarung</H3>

<P>Behinderte wollen nicht um Reisen k&auml;mpfen, schreibt heute die
S&uuml;ddeutsche Zeitung und zitiert die Berliner Journalistin Sigrid
Arnade mit ihren Negativerfahrungen am Flugschalter. &laquo;Sigrid Arnade
muss oft um ihre Flugreisen k&auml;mpfen. Viele Gesellschaften weisen die
Rollstuhlfahrerin ab, weil sie keine Begleitperson hat oder weil sie einen
medizinischen Fragebogen nicht ausf&uuml;llen will. Einmal wurde die
Journalistin erst mitgenommen, als sie am Check-In um ein Telefon bat, um
ihren Auftritt im Fernsehmagazin Panorama abzusagen&raquo;, schreibt das
Blatt in einem Bericht &uuml;ber die Berliner Bilanz- und Perspektivtagung
der Bundesregierung zum abgelaufenen europ&auml;ischen Jahr der Menschen
mit Behinderungen.</P>

<P>In einem von der Journalistin moderierten Workshop &uuml;ber
Barrierefreiheit und Verkehr war mehrfach von solchen Erschwernissen
berichtet worden. Die Belange behinderter Menschen k&ouml;nnten durch
Zielvereinbarungen zwischen ihren Verb&auml;nden und den
Luftverkehrsgesellschaften geregelt werden, hei&szlig;t es im
Behindertengleichstellungsgesetz (BGG). Doch im Flugverkehr wie bei der
Bahn ist dieses Instrument bisher nicht wirksam geworden. sch</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a13"></A> 

<H3>Barrierefreie Internetangebote</H3>
Von Guntram Hoffmann 

<P>Wei&szlig;enfels (kobinet) Internet- und CD-Rom-Angebote der
Bundesregierung werden schrittweise barrierefrei gestaltet.</P>

<P>Neue oder wesentlich ver&auml;nderte Internet- und Intranet-Angebote des
Bundes sowie Internet-Angebote, die sich speziell an behinderte Menschen
richten, sind nach den Regeln der barrierefreien Informationsverordnung
(BITV) vom Juli 2002 inzwischen &laquo;barrierefrei&raquo; gestaltet.</P>

<P>Dies erkl&auml;rt die Bundesregierung in der Antwort
(Bt.-Drucks.15/2493) auf eine Kleine Anfrage der CDU/CSU . Es wird
dargelegt, die barrierefreie Gestaltung von Internet-Angeboten sei aufgrund
st&auml;ndig wechselnder Inhalte kein einmaliger Vorgang, sondern ein
fortdauernder Prozess.</P>

<P>Deshalb sei eine schrittweise Umsetzung und &Uuml;bergangsfristen zur
Erreichung der Standards in der BITV vorgesehen. In Wahrnehmung der Belange
behinderter Menschen seien in Zusammenarbeit mit dem Aktionsb&uuml;ndnis
f&uuml;r barrierefreie Informationstechnik (Abi) und dem Projekt des
Bundesverwaltungsamtes &laquo;Barrierefrei Informieren und
Kommunizieren&raquo; (BIK) Schulungen und Seminare sowie Tests und
Beratungen angeboten worden, um eine qualifizierte Hilfestellung zu bieten.
So seien grafische Programmoberfl&auml;chen fast ausschlie&szlig;lich CDs,
die seit in Kraft treten der BITV barrierefrei gestaltet werden.</P>

<P>Sowohl die CeBIT-CD als auch die offline-Version des
Wissenschaftsmanagementsystems seien gem&auml;&szlig; BITV barrierefrei
umgesetzt worden. Zur Vermittlung der BITV-Inhalte habe man mit mehreren
Informationsveranstaltungen die Voraussetzungen daf&uuml;r geschaffen, dass
die f&uuml;r Beh&ouml;rden geltenden Standards auch im gewerblichen Bereich
Anwendung finden.</P>

<P>Dies ergebe sich durch den Abschluss von Zielvereinbarungen oder bereits
durch die Erkenntnis, dass ein entsprechender Markt f&uuml;r barrierefreie
Produkte und Dienstleistungen bestehe. Die Bundesregierung verzeichnet laut
Antwort bei der Umsetzung deutliche Fortschritte.</P>

<P>Sie erkl&auml;rt aber, der Prozess m&uuml;sse weiterhin unterst&uuml;tzt
werden. In Bezug auf die barrierefreie Ausgestaltung von
Arbeitspl&auml;tzen f&uuml;r schwerbehinderte Menschen sieht die Regierung
keinen &uuml;ber das geltende Recht des Sozialgesetzbuches hinausgehenden
Regelungsbedarf.</P>

<P>Nutzer k&ouml;nnen ihre Meinung zu den Seiten des Bundes im Internet
abgeben. elba</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a14"></A> 

<H3>Kein Geld mehr f&uuml;r Berliner Telebuszentrale</H3>

<P>Berlin (kobinet) Besch&auml;ftigte und Nutzer des
Behinderten-Fahrdienstes Telebus in Berlin sind heute weiter verunsichert
worden. Auf einer Betriebsversammlung wurde mitgeteilt, dass ab 2005 der
Berliner Zentralausschuss f&uuml;r soziale Aufgaben (BZA), der die
Fahrtw&uuml;nsche der Behinderten entgegennimmt, kein Geld mehr vom Senat
erh&auml;lt. Das bisherige System k&ouml;nne in seiner Struktur und dem
&laquo;quasi unbegrenzten Bef&ouml;rderungsangebot angesichts der
prek&auml;ren Haushaltslage nicht fortgef&uuml;hrt werden&raquo;, teilte
Sozialsenatorin Heidi Knake-Werner (PDS) laut Berliner Zeitung (Ausgabe vom
11. 2.) mit. Bis 31. M&auml;rz wolle sie ein neues Konzept vorlegen.</P>

<P>Wie in der RBB-Abendschau mitgeteilt wurde, sollen die Berliner
Verkehrsbetriebe (BVG) in Zukunft mehr Behinderte als heute bef&ouml;rdern
und auch den Sonderfahrdienst &uuml;bernehmen. Die BZA-Belegschaft
bef&uuml;rchtet eine &laquo;generalstabsm&auml;&szlig;ige Zerschlagung des
Telebusses in seiner bisherigen Gestalt&raquo;. Bisher ist kein Konzept
bekannt geworden, wie die BVG den Fahrdienst organisieren will. Vertreter
der Betroffenen selbst f&uuml;hlen sich nicht richtig in die
Entscheidungsfindung einbezogen. Der Telebus als Sonderfahrdienst f&uuml;r
Behinderte wurde 1979 gegr&uuml;ndet und galt damals als ein Pilotprojekt
f&uuml;r die Bundesrepublik. sch</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>
<A name="a15"></A> 

<H3>ORF: &laquo;TV-Angebot ist unterdurchschnittlich&raquo;</H3>
&Ouml;sterreichischer Geh&ouml;rlosenbund ver&auml;rgert 

<P>Wien (kobinet) Die Pr&auml;sidentin des &Ouml;sterreichischen
Geh&ouml;rlosenbundes (&Ouml;GLB), Mag. Helene Jarmer, zeigt sich &uuml;ber
den ORF ver&auml;rgert und fordert gleichberechtigtes Angebot ein.</P>

<P>Seit J&auml;nner 2004 gibt es keine Grundgeb&uuml;hrenbefreiung f&uuml;r
behinderte Menschen beim ORF. Das Angebot f&uuml;r behinderte Menschen ist
aber unterdurchschnittlich, betont Jarmer.</P>

<P>Statt der langj&auml;hrigen Forderung nach deutlicher Erh&ouml;hung der
Untertiltelungsquote und der Ausstrahlung von Einblendungen in
&Ouml;sterreichischer Geb&auml;rdensprache sollen &laquo;wir erst einmal
zahlen; f&uuml;r nahezu kaum ein Angebot&raquo;, zeigt sich Jarmer
ver&auml;rgert.</P>

<P>&laquo;Es ist ein Skandal, dass geh&ouml;rlose Menschen die gleiche
Geb&uuml;hr bezahlen wie H&ouml;rende&raquo;, obwohl nur 210 der knapp 1500
Stunden gesendetes Programm des ORF untertitelt werden. Dies entspricht nur
knapp 15 % des Programms.</P>

<P>Der &Ouml;sterreichische Geh&ouml;rlosenbund zeigt sich auch
entt&auml;uscht dar&uuml;ber, dass die zahlreichen Proteste &laquo;bisher
leider nur leere Versprechungen&raquo; zur Folge hatten. Jarmer fordert
keine Reduktion der Geb&uuml;hren f&uuml;r geh&ouml;rlose Menschen. Doch
die Bezahlung der vollen Geb&uuml;hren muss einhergehen mit vollem Angebot,
so der &Ouml;GLB.</P>

<P>&laquo;Also 100 % Untertitelung und Fernseh-Angebote f&uuml;r
geh&ouml;rlose Kinder und Erwachsene in der &Ouml;sterreichischen
Geb&auml;rdensprache&raquo; so Jarmer abschlie&szlig;end. lad</P>
<A href="#top">zum Inhaltsverzeichnis</A> 
<HR>

<A name="a16"></A>
<H3>Berliner Gespr&auml;che zur Digitalen Integration</H3>

<P>Der barrierefreie Zugang zu neuen Medien war gestern Abend Thema der
Berliner Gespr&auml;che zur Digitalen Integration. Prof. Dr. Jo Groebel vom
Europ&auml;ischen Medieninstitut moderierte eine Podiumsdiskussion mit
Prof. Dr. Christian B&uuml;hler vom Forschungsinstitut Technologie
Behindertenhilfe Volmarstein, Dr. Karl-Heinz Weirich von IBM Deutschland,
Wolfgang Tigges von der Bundesarbeitsgemeinschaft Hilfe f&uuml;r
Behinderte, J&ouml;rg Porath vom Berufsbildungswerk Neckargem&uuml;nd gGmbH
und Thomas H&auml;nsgen vom Technischen Jugendfreizeit- und Bildungsverein
(tjfbv) Berlin. </P>

<P>&laquo;Die offizielle Teilnehmerliste war 87 Personen lang, aber deutlich mehr
waren dann doch anwesend. Eine sehr rege Diskussion zu den Vortr&auml;gen
war vielseitig und facettenreich, wobei der Schwerpunkt auf
Barrierefreiheit im Internet gelegt wurde. &Ouml;ffentlichkeitsarbeit ist
dazu weiter n&ouml;tig. Die Wirtschaft reagiert und es werden zunehmend
Hilfen und Technik angeboten. Die Wirtschaft hat sich der BITV angenommen
und benutzt diese zur Umsetzung der Idee der Barrierefreiheit, so wie es
die &Ouml;ffentlichen zunehmend tun. Es ist an herausragenden Beispielen
der Prozess nachvollziehbar, aber das reicht in der Breite &uuml;berhaupt
nicht aus&raquo;, berichtete Hubertus Thomasius, der sich an der Aussprache
beteiligte. Die Diskussion wurde aufgezeichnet und wird bei
www.digitale-chancen dokumentiert. sch </P>
<A href="#top">zum Inhaltsverzeichnis</A>
<HR>

<A name="a17"></A>
<H3>Aufregung &uuml;ber &laquo;Gesundheitsreform&raquo; l&auml;sst nicht nach</H3>

<P>Berlin (kobinet) Seit Wochen treffen in der Bundesgesch&auml;ftsstelle
der Volkssolidarit&auml;t Beschwerden und Proteste von Mitgliedern und
Ortsgruppen gegen die unsoziale Elemente der
&laquo;Gesundheitsreform&raquo; ein, gibt der Verband heute bekannt.
Angesichts dieser Situation und der, wie es hei&szlig;t, mangelnden
Bereitschaft, Konstruktionsfehler der &laquo;Gesundheitsreform&raquo; zu
korrigieren, fordert die Volkssolidarit&auml;t dazu auf, die Beschwerden
insbesondere an den Petitionsausschuss des Deutschen Bundestages zu
richten. </P>

<P>&laquo;Viele beklagen die zunehmende B&uuml;rokratisierung. Das Sammeln von
Belegen ist f&uuml;r pflegebed&uuml;rftige, chronisch kranke und behinderte
Menschen eine unglaubliche Zumutung und entw&uuml;rdigend. Nur so kann aber
nach den bisherigen Regelungen das Erreichen der Belastungsgrenze von 2
Prozent (1 Prozent f&uuml;r chronisch Kranke) nachgewiesen werden. In
Einrichtungen der Altenhilfe und Pflege fallen dadurch zus&auml;tzliche
Aufgaben an, die das Personal von ihrer Arbeit am und f&uuml;r die Menschen
eher abhalten. Viele sp&uuml;ren, dass diese 'Reform' mit hei&szlig;er
Nadel gestrickt wurde&raquo;, erkl&auml;rte dazu der
Bundesgesch&auml;ftsf&uuml;hrer der Volkssolidarit&auml;t, Dr. Bernd
Niederland. </P>

<P>Nach Artikel 17 Grundgesetz habe jeder das verfassungsm&auml;&szlig;ige
Grundrecht, &laquo;sich einzeln oder in Gemeinschaft mit anderen
schriftlich mit Bitten oder Beschwerden an die zust&auml;ndigen Stellen und
an die Volksvertretung zu wenden&raquo;. Beschwerden an den
Petitionsausschuss des Bundestages sollten konkrete Forderungen nach
&Auml;nderungen in der Gesetzgebung enthalten. Bei der
&laquo;Gesundheitsreform&raquo; gehe es speziell um die Regelungen des
GKV-Modernisierungsgesetzes (GMG), die den gesetzlich Versicherten
h&ouml;here Belastungen aufb&uuml;rden. &laquo;Wenn es gelingt, durch eine
Vielzahl von Petitionen die soziale Schieflage der 'Gesundheitsreform' zu
thematisieren, sollte der Petitionsausschuss nicht z&ouml;gern, diese
'Reform' in einer Anh&ouml;rung auf den Pr&uuml;fstand zu stellen und
Korrekturen einzufordern&raquo;, sagte Niederland. hjr </P>
<A href="#top">zum Inhaltsverzeichnis</A>
<HR>

<A name="a18"></A>
<H3>Kritik an Bundespr&auml;sident Rau</H3>
von kobinet-Korrespondent Keyvan Dahesch

<P>Bonn (kobinet) Behinderte Menschen haben ein mangelndes Engagement von
Bundespr&auml;sident Johannes Rau f&uuml;r ihre Belange beklagt. Obwohl
behinderte Menschen auch im Jahr 2003 viele Diskriminierungen erlitten
h&auml;tten, habe es keine Stellungnahme von Rau gegeben, sagte der
Pressesprecher des Netzwerk Artikel 3, Ottmar Miles-Paul, am Mittwoch in
Bonn. So f&uuml;hlten sich die von diversen Reiseveranstaltern, Theatern,
Kinos und Fluggesellschaften abgewiesenen gel&auml;hmten, h&ouml;r- und
sehbehinderten Menschen vom Staatsoberhaupt im Stich gelassen. </P>

<P>Alt-Bundespr&auml;sident Richard von Weizs&auml;cker habe 1993 in Bonn
bislang die beste Rede &uuml;ber die Situation und L&ouml;sung der Probleme
behinderter Menschen in der Bundesrepublik gehalten. Auch sein Nachfolger
Roman Herzog habe mit der &Uuml;bernahme der Schirmherrschaft der von
&uuml;ber 100 Organisationen getragenen &laquo;Aktion Grundgesetz&raquo;
1997 engagiert die Verwirklichung des Benachteiligungsverbotes der Menschen
wegen ihrer Behinderung angemahnt. </P>

<P>&laquo;Dieses ermutigende Engagement haben wir im vergangenen Jahr bei
Johannes Rau vermisst&raquo;, sagte Miles-Paul. Eine Gruppe, deren Zahl allein
schon durch das &Auml;lterwerden der Menschen st&auml;ndig zunehme, brauche
Schutz vor Diskriminierungen. </P>
<A href="#top">zum Inhaltsverzeichnis</A>
<HR>

<A name="a19"></A>
<H3>Clowns im Krankenhaus (CLiK e.V.)</H3> 
 
Von kobinet-Korrespondent Franz Schmahl

<P>Berlin (kobinet) Vor zehn Jahren haben Berliner Clowns die Idee
aufgegriffen, eine Sprechstunde im Krankenhaus abzuhalten. &Ouml;sterreichs
ROTE NASEN Clowndoctors besuchen seit 1994 kranke Kinder im Spital. Die
Klinik-Clowns kamen Ende der 80er Jahre in den USA auf. Werden sie sich in
der Pleite-Stadt Berlin behaupten k&ouml;nnen? </P>

<P>In Berlin waren es &laquo;Klecksi&raquo; und &laquo;Daniel&raquo;, die
zuerst Feuer und Flamme waren, als sie 1994 von einem Klinikprojekt in
Wiesbaden h&ouml;rten. Sie schrieben mehrere Krankenh&auml;user an. In
einer Klinik f&uuml;r chronisch kranke Kinder und Jugendliche in
Berlin-Buch wurden bald die ersten Sprechstunden der Spa&szlig;macher
erm&ouml;glicht. Inzwischen ist daraus der gemeinn&uuml;tzige Verein
&laquo;CliK - Clowns im Krankenhaus&raquo; entstanden. </P>

<P>Die Clowns sind in vielen therapeutischen Einrichtungen in Berlin und
Brandenburg gefragt, um Trost und Lachen ans Krankenbett zu bringen. Dr.
Joachim Meincke, damals Krankenhaus-Psychologe, der die Clown-Sprechstunde
nach Kr&auml;ften f&ouml;rderte, ist jetzt Therapeut in eigener
Niederlassung und Vorsitzender des CliK-Vereins. &laquo;Klecksi&raquo; und
&laquo;Daniel&raquo; haben weitere Kolleginnen und Kollegen bekommen. Ein
halbes Dutzend professioneller Spa&szlig;macher offeriert die Website des
Vereins. </P>

<P>Die Berliner Klinik-Clowns sind mit den ROTE NASEN Clowndoctors in Wien
verbunden, die mit einer privaten Stiftung ein europ&auml;isches Netz
kn&uuml;pfen wollen. In &Ouml;sterreich werden j&auml;hrlich &uuml;ber
50.000 kranke Kinder von Clownteams besucht und k&ouml;nnen so Schmerz,
Angst und Traurigkeit leichter &uuml;berwinden. Auch in Ungarn und
Tschechien sind Clowns aktiv, um Widerstandskraft und Lebenswillen der
kleinen Patienten zu st&auml;rken. Vorbereitet werden Initiativen in
Slowenien und der Slowakei. </P>

<P>Unter dem Motto &laquo;Mehr Clowns in die Krankenh&auml;user&raquo;
haben die Berliner im Herbst 1999 erstmals alle, die das Lachen lieben, zur
1. Laugh Parade aufgerufen. Da die Clownarbeit allein durch private und
&ouml;ffentliche Spenden finanziert wird, trommelten sie f&uuml;r die
Unterst&uuml;tzung ihres Anliegens. Clowns, Narren, Humortologen und
Lachnasen waren auch in den folgenden Jahren aufgerufen, sich zu dieser
Parade zu versammeln. Wer sich eine rote Nase aufsetzen wollte, war
willkommen. </P>

<P>Angesichts leerer Kassen in Berlin muss auch in diesem Jahr wieder stark
getrommelt werden, damit sich gen&uuml;gend Spender und Sponsoren f&uuml;r
die Clowns im Krankenhaus finden. Die werden vielerorts schon
sehns&uuml;chtig erwartet - bei krebskranken Kindern oder auch auf
geriatrischen Stationen. </P>
<A href="#top">zum Inhaltsverzeichnis</A>
<HR>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

