<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>Autorenvorstellung aus dem Forum
    [B&Uuml;CHERWURM]</TITLE>
  </HEAD>

  <BODY background="images/bga.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <A name="top"></A> 

          <P align="center"><FONT color="#000080" size=
          "7"><B>Autorenvorstellung</B></FONT></P>

          <H3>Inhalt:</H3>

          <UL>
            <LI><A href="#a01">Joanne K. Rowling</A></LI>

            <LI><A href="#a02">John Ronald Reuel Tolkien</A></LI>

            <LI><A href="#a03">Liza Marklund</A></LI>

            <LI><A href="#a04">Catherine Gaskin</A></LI>

            <LI><A href="#a05"></A></LI>

            <LI><A href="#a06"></A></LI>

            <LI><A href="#a07"></A></LI>

            <LI><A href="#a08"></A></LI>

            <LI><A href="#a09"></A></LI>

            <LI><A href="#a10"></A></LI>
          </UL>
          <HR>
          <A name="a01"></A> 

          <H3>Name: Rowling<BR>
          Vorname: Joanne Kathleen<BR>
          Vorgestellt von: Rothaut<BR>
          Geburtsdatum: --.7.1965<BR>
          Sterbedatum:</H3>

          <P><B>Biografie:</B></P>

          <P><B>Fr&uuml;he 60er</B><BR>
           In einem Zug, der vom Londoner Bahnhof KING'S CROSS
          abf&auml;hrt, lernt J. K. Rowlings Vater Peter, ein
          Manager bei Rolls-Royce, Joannes Mutter Anne, eine
          halb-franz&ouml;sische, halb-schottische Laborantin,
          kennen.</P>

          <P><B>Juli 1965</B><BR>
           Joanne Kathleen Rowling wird im General Hospital in
          Chipping Sodbury, Gloucestershire, geboren.</P>

          <P><B>1971</B><BR>
           Im Alter von sechs Jahren schreibt Rowling ihre erste
          Geschichte &uuml;ber Rabbit, ein Kaninchen, das Masern
          bekommt und von seinen Freunden besucht wird, u.a. von
          einer gro&szlig;en Biene namens Miss Bee. Die Familie
          zieht von Yate nach Winterbourne, auf der anderen Seite
          von Bristol, wo Joanne im Alter von neun Jahren zusammen
          mit ihrer j&uuml;ngeren Schwester Di und Nachbarskindern
          spielt, darunter ein Junge und ein M&auml;dchen namens
          POTTER.</P>

          <P>Ian Potter spielt gerne Streiche - er dekoriert
          Picknick-Teller mit Schnecken und manipuliert die
          St&uuml;tzr&auml;der am Fahrrad seiner Schwester Vikki.
          Einmal bringt er Jo, Di und Vikki sogar dazu, &uuml;ber
          frischen Zement zu laufen. Die M&auml;dchen lieben es,
          sich als HEXEN zu verkleiden.</P>

          <P><B>1974</B><BR>
           Die Familie zieht nach Tutshill in Wales, nahe Chepstow.
          Rowling hasst ihre neue Schule. Sie liest B&uuml;cher von
          E. Nesbit und Noel Streatfield, "Manxmouse" von Paul
          Gallico, C.S. Lewis' "Narnia"-B&auml;nde und Elizabeth
          Goudges "Little White Horse". Und sie schreibt eine
          Geschichte &uuml;ber sieben verwunschene Diamanten.</P>

          <P><B>1976</B><BR>
           Einschulung in Wyedean Comprehensive (Gesamtschule). Der
          beste und &auml;lteste ihrer engsten Freunde ist Sean
          Harris (Vorbild f&uuml;r RON WEASLEY). In der
          Mittagspause erz&auml;hlt sie ihren Freunden lange
          Geschichten. Sp&auml;ter erz&auml;hlt sie &uuml;ber sich,
          da&szlig; sie ein sch&uuml;chternes, puddinggesichtiges
          Kind mit Brille war, und eine "verbissene kleine
          Streberin". Einen Teil von ihr findet man in HERMINE
          wieder. Sie wird ein gro&szlig;er Jane-Austen-Fan.</P>

          <P><B>1982</B><BR>
          Im letzten Schuljahr wird Rowling "Head Girl"
          (Schulsprecherin) in Wyedean Comprehensive.</P>

          <P><B>1983</B><BR>
          An der Universit&auml;t von Exeter studiert sie
          Franz&ouml;sisch und Altphilologie. Sie beginnt eifrig,
          alte Namen zu sammeln.</P>

          <P><B>1985</B><BR>
          W&auml;hrend ihres Studiums verbringt sie als Teaching
          Assistant ein Jahr in Paris.</P>

          <P><B>1987</B><BR>
          Rowling arbeitet kurzzeitig als Recherche-Assistentin
          f&uuml;r Amnesty International und wohnt in einem
          WG-Zimmer in Clapham, South London. W&auml;hrend der
          Mittagspausen schreibt sie in Pubs und Caf&eacute;s.
          Mindestens zwei Romane f&uuml;r Erwachsene werden in
          dieser Zeit konzipiert.</P>

          <P><B>1988</B><BR>
          In Manchester arbeitet Rowling als Sekret&auml;rin. Der
          Job liegt ihr nicht - sie bezeichnet sich als
          "schlechteste Sekret&auml;rin aller Zeiten". In Sitzungen
          kritzelt sie Romanentw&uuml;rfe auf das Protokoll; den
          Computer nutzt sie, um ihre Geschichten
          abzuschreiben.</P>

          <P><B>1989</B><BR>
          Auf einer versp&auml;teten Zugreise von Manchester nach
          KING'S CROSS in London purzeln Harry Potter und seine
          Charaktere "ausgeformt" in ihren Kopf. Sie beginnt, die
          ganze Welt der Hogwarts-Schule f&uuml;r Hexerei und
          Zauberei um Harry herum zu erfinden. Leider hat sie weder
          Stift noch Papier dabei, so dass sie alles im
          Ged&auml;chtnis behalten mu&szlig;.</P>

          <P><B>1990</B><BR>
          Ihre Mutter stirbt im Alter von 45 Jahren an Multipler
          Sklerose.</P>

          <P><B>1991</B><BR>
          Mit 26 geht Rowling nach Oporto (Portugal), um Englisch
          als Fremdsprache zu unterrichten. Nachmittags schreibt
          sie. Vom ersten Kapitel zu "Harry Potter und der Stein
          der Weisen" entwirft sie zehn Versionen.</P>

          <P><B>1992</B><BR>
          Sie heiratet einen portugiesischen
          Fernsehjournalisten.</P>

          <P><B>1993</B><BR>
          Joannes Tochter wird geboren. Rowling nennt sie nach
          ihrem Idol, der Journalistin, Autorin und politischen
          Aktivistin Jessica Mitford (1917-1996).</P>

          <P><B>Weihnachten 1993</B><BR>
          Scheidung und R&uuml;ckkehr nach Gro&szlig;britannien mit
          ihrem Baby. Rowling f&auml;hrt mit einem halben Koffer
          voller Harry-Potter-Geschichten nach Edinburgh, zu ihrer
          Schwester, die Jura studiert hat.</P>

          <P><B>1994</B><BR>
          Joanne erz&auml;hlt ihrer Schwester die Geschichte von
          Harry Potter, die von der Story begeistert ist. Rowling
          befindet sich in der klassischen Armutsfalle: sie wohnt
          in einer Ein-Zimmer-Wohnung, bekommt f&uuml;r ihre
          Tochter keinen Platz in der staatlichen Kinderbetreuung,
          kann aber ohne Job auch keine private Tagesmutter
          bezahlen. Sie lebt von Sozialhilfe und bekommt &pound; 69
          pro Woche. Rowling schreibt Harry Potter auf
          Notizbl&ouml;cken in Caf&eacute;s um Edinburgh, in denen
          sie gelegentlich einen Espresso trinkt, w&auml;hrend ihre
          Tochter im Buggy schl&auml;ft. Abends schreibt sie
          weiter. "Ich schrieb das Buch wirklich f&uuml;r mich
          selbst", sagt sie in einem Interview.</P>

          <P><B>1995</B><BR>
          Sie schreibt "Harry Potter" auf einer alten
          Schreibmaschine zu Ende - und tippt es immer wieder ab:
          Kopien kann sie nicht bezahlen. In der Bibliothek sucht
          sie sich die Namen von Agenten und Verlegern heraus. Sie
          schickt das Manuskript an zwei Agenten und mehrere
          Verlage.</P>

          <P><B>1996</B><BR>
          W&auml;hrend sie auf Reaktionen zu ihrem Manuskript
          wartet, arbeitet sie als Franz&ouml;sischlehrerin. Obwohl
          das Manuskript mit 320 Seiten den meisten Verlegern zu
          lang war, findet Rowlings Agent Christopher Little den
          richtigen Verlag f&uuml;r "Harry Potter": Bloomsbury.</P>

          <P><B>Februar 1997</B><BR>
          Der Scottish Arts Council gibt Rowling das bisher
          h&ouml;chstdotierte Stipendium f&uuml;r
          Kinderbuchautoren, &pound; 8.000. Rowling kauft sich
          einen Computer, um das zweite Buch zu schreiben.</P>

          <P><B>Juni 1997</B><BR>
          "Harry Potter and the Philosopher's Stone" wird in
          Gro&szlig;britannien ver&ouml;ffentlicht.</P>

          <P><B>8. Juli 2000</B><BR>
          Das vierte Buch erscheint gleichzeitig in
          Gro&szlig;britannien und in den USA. Der englische Verlag
          druckt eine Erstauflage von einer Million Exemplare. In
          den USA verkauft allein Steve Kloves, Regisseur der
          "Fabelhaften Baker Boys", beginnt mit dem Drehbuch
          f&uuml;r den Harry-Potter-Film.</P>

          <P><B>14. Juli 2000</B><BR>
          Ihr wird die Ehrendoktorw&uuml;rde der Universit&auml;t
          von Exeter verliehen.</P>

          <P><B>2. M&auml;rz 2001</B><BR>
          Joanne K. Rowling ist in den Buckingham Palace zur Queen
          eingeladen, als Auszeichnung f&uuml;r besondere
          Verdienste um die Kinderliteratur.</P>

          <P><B>18. M&auml;rz 2001</B><BR>
          Auch in Deutschland erscheinen "Phantastische Tierwesen
          und wo sie zu finden sind" sowie "Quidditch im Wandel der
          Zeiten". Sie sind Harry Potters Lieblingsschulb&uuml;cher
          - aber wirklich verfasst hat sie Joanne K. Rowling. Sie
          verzichtet dabei auf jedes Honorar. Ihr gleich tun es
          &Uuml;bersetzer, Verlage und der Handel - alle zugunsten
          der englischen Organisation COMIC RELIEF, die mit diesem
          Geld Hilfsprojekte in der ganzen Welt finanziert.</P>

          <P><B>26. Dezember 2001</B><BR>
          J.K. Rowling heiratet den schottischen Arzt Neil
          Murray.</P>

          <P><B>14. November 2002</B><BR>
          Kinostart des zweiten Filma, "Harry Potter und die Kammer
          des Schreckens".</P>

          <P><B>8. November 2003</B><BR>
          "Harry Potter und der Orden des Ph&ouml;nix" erscheint in
          einer Startauflage von 2 Millionen Exemplaren.</P>

          <P><B>Quelle:</B><BR>
          http://www.carlsen-harrypotter.de/basic1/author.rowling/autorin.biographie/content.html</P>

          <P><B>Erstes Buch:</B><BR>
          Harry Potter und der Stein der Weisen</P>

          <P><B>Letztes Buch:</B><BR>
          Harry Potter und der Orden des Ph&ouml;nix</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a02"></A> 

          <H3>Name: Tolkien<BR>
           Vorname: John Ronald Reuel<BR>
           Vorgestellt von: Eowyn<BR>
           Geburtsdatum: 03.01.1892<BR>
           Sterbedatum: 02.09.1973</H3>

          <P><B>Biografie:</B><BR>
          1892 am 3. Januar wird John Ronald Reuel Tolkien in
          Bloemfontein geboren.</P>

          <P>Tolkiens Mutter Mabel f&auml;hrt mit ihren beiden
          S&ouml;hnen im Fr&uuml;hjahr 1895 nach England; Arthur
          Tolkien, ihr Ehemann, bleibt in S&uuml;dafrika. 1896
          stirbt Tolkiens Vater noch in S&uuml;dafrika an
          Rheumatischem Fieber Im Sommer des gleichen Jahres mietet
          Mabel ein Haus in Sarehole Mill bei Birmingham, wo sie
          mit ihren S&ouml;hnen f&uuml;r vier Jahre lebt. Tolkien
          selbst betrachtet diese Phase als eine der Zeiten in
          seinem Leben, die ihn am meisten gepr&auml;gt hat. Dieses
          Haus ist sehr l&auml;ndlich gelegen und hier lernt
          Tolkien bereits in fr&uuml;hen Jahren die Natur zu
          lieben. Sp&auml;ter, als seine Mutter stirbt, wird diese
          Natur ein Sinnbild f&uuml;r die - wie er selbst sagt -
          gl&uuml;cklichste Zeit seiner Kindheit. Er verbindet die
          l&auml;ndliche Natur auf Lebenszeit mit ihr, und die
          Liebe zu ihr zieht sich auch sp&auml;ter durch all seine
          Werke. Im Jahre 1900 wechselt die bis dahin
          protestantische Mabel in die katholische Kirche.</P>

          <P>Im gleichen Jahr verl&auml;sst sie ihr Haus auf dem
          Land und zieht mit ihren S&ouml;hnen nach Moseley, einem
          Vorort von Birmingham. Bereits ein Jahr sp&auml;ter folgt
          der Umzug nach King's Heath.</P>

          <P>Tolkiens gesamte Kindheit ist von derartigen
          Umz&uuml;gen gepr&auml;gt, sodass er nie die
          M&ouml;glichkeit hat, sich tats&auml;chlich irgendwo
          niederzulassen, denn auch die Schulen wechselt er mit
          fast jedem Umzug. Das &auml;ndert sich auch nicht, als
          Mabel Tolkien 1904 im November an Diabetes stirbt.</P>

          <P>Ab 1905 ziehen die Jungen f&uuml;r eine Weile ins Haus
          ihrer Tante Beatrice. Drei Jahre sp&auml;ter dann zu
          einer Bekannten - Mrs. Faulkner - in deren Haus Ronald
          Edith Bratt, seine einzige Liebe und sp&auml;tere Ehefrau
          kennenlernt. Diese ist selbst nicht berufst&auml;tig und
          hat auch keine Ausbildung genossen. Allein das
          Klavierspielen beherrscht sie, vernachl&auml;ssigt dies
          aber schlie&szlig;lich auch. Die beiden verlieben sich
          recht schnell ineinander, doch da Tolkien sich in dieser
          Zeit schon zu einem guten Studenten mit den ersten
          Anzeichen f&uuml;r eine hohe Begabung zur Philologie
          entwickelt hat, st&ouml;&szlig;t eine Liebschaft bei
          seinen Lehrern und G&ouml;nnern auf Wiederstand. Sich
          haupts&auml;chlich auf die Junge Frau konzentrierend,
          vernachl&auml;ssigt er auch seine Studien, was dazu
          f&uuml;hrt, dass der Versuch, 1909 ein Stipendium
          f&uuml;r das College in Oxford zu erlangen, misslingt.
          Auch der Umzug der beiden Tolkien-Br&uuml;der 1910 kann
          nichts an der Liebschaft zwischen den beiden &auml;ndern,
          auch wenn Ronald inzwischen jeglicher Kontakt mit der
          jungen Frau verboten worden ist. Im M&auml;rz des
          gleichen Jahres zieht allerdings Edith nach Cheltenham
          und der Kontakt bricht weitgehend ab. Dies l&auml;sst
          Ronald allerdings wieder Zeit f&uuml;r seine Studien und
          so erlangt er schlie&szlig;lich ein Stipendium f&uuml;r
          das Exeter College in Oxford. Nach dieser Zeit
          entschlie&szlig;t er sich an der Fakult&auml;t f&uuml;r
          englische Sprache und Literatur zu studieren. Edith, die
          inzwischen offiziell mit Ronald verlobt ist, tritt in die
          katholische Kirche ein.</P>

          <P>Bei Ausbruch des Krieges kehrt Ronald nach Oxford
          zur&uuml;ck um dort seine Studien zu beenden und tritt
          schlie&szlig;lich in den Kriegsdienst. So reist er durch
          das Land und seine Frau folgt ihm st&auml;ndig.
          W&auml;hrend er im Krieg beginnt, an einer Krankheit zu
          leiden, die weithin als Grabenfieber bekannt ist und
          daher zu einem Genesungsurlaub nach Haus
          zur&uuml;ckkehrt, beginnt er "The Book Of Lost Tales"
          (Das Buch der verschollenen Geschichten) zu schreiben,
          aus dem jedoch sp&auml;ter das Silmarillion werden soll.
          Die ersten Aufzeichnungen tragen das Jahr 1917.</P>

          <P>Nach Vereinbarung des Waffenstillstandes kehrt er mit
          seiner Frau und dem inzwischen geborenen Sohn John nach
          Oxford zur&uuml;ck, wo er beginnt am "New English
          Dictionary" (neu englischen W&ouml;rterbuch"
          mitzuarbeiten. In dieser zeit arbeitet er auch als
          privater Tutor und wird zum Lektor f&uuml;r englische
          Sprache an der Universit&auml;t Leeds. Bald wird sein
          zweiter Sohn Michael geboren.</P>

          <P>1924 wird Tolkien schlie&szlig;lich zum Professor
          f&uuml;r englische Sprache in Leeds und sein dritter Sohn
          Christopher, der gerade im Bezug auf seine Werke in
          seinem sp&auml;teren Leben noch eine gro&szlig;e Rolle
          spielen wird, wird geboren.</P>

          <P>1925 wird Tolkien zum Rawlinson- und
          Bosworth-Professor f&uuml;r Angels&auml;chsisch in Oxford
          gew&auml;hlt, eine Stelle, die er im Herbst des gleichen
          Jahres antritt.</P>

          <P>1929 wird das letzte Kind geboren, Tolkiens Tochter
          Priscilla. Ein Jahr sp&auml;ter, nach einem neuerlichen
          Umzug, bei dem die Familie allerdings in Oxford bleibt,
          beginnt Ronald "Der kleine Hobbit" zu schreiben,
          l&auml;sst ihn derzeit aber unabgeschlossen liegen.</P>

          <P>1936 liest Susan Dagnall vom Verlag Allen &amp; Unwin
          das Manuskript des kleinen Hobbits und Tolkien schreibt
          auf ihre Bitten dieses Buch zuende.</P>

          <P>1937 erscheint im Herbst "The Hobbit" und auf Anfrage
          von Stanley Unwin macht Ronald sich an eine Fortsetzung
          zu diesem Buch, welches einen durchschlagenden Erfolg
          hatte. Die Fortsetzung soll sich schlie&szlig;lich zum
          Herren der Ringe entwickeln.</P>

          <P><B>Anmerkung:</B><BR>
           &Uuml;ber die ganze Zeit war Tolkien mit dem
          besch&auml;ftigt, was in vielen Jahren als "Das
          Silmarillion" erscheinen sollte.</P>

          <P>Er entwickelte eine komplette Mythologie um das Reich
          Mittelerde, die von dessen Entstehen &uuml;ber insgesamt
          drei Zeitalter reicht.</P>

          <P>Eine Mythologie mit einem Gott, den
          engels&auml;hnlichen Wesen - den Valar - bis hin zu
          verschiedenen V&ouml;lkern, den Noldor - dem Volke
          Galadriels - den Zwergen, Elben und Menschen.</P>

          <P>Nicht nur, dass er die Geschichten dieser V&ouml;lker
          in der gro&szlig;en Geschichte Mittelerdes entwarf, nein
          er begann f&uuml;r verschiedene V&ouml;lker
          tats&auml;chlich Sprachen zu entwickeln, f&uuml;r die
          heute noch unterschiedliche Alphabete existieren.</P>

          <P>Tolkien selbst begann bereits in seinen fr&uuml;hen
          Jahren sein Tagebuch in Sindarin, der Sprache der Elben
          zu f&uuml;hren, und dies tat er bis an sein
          Lebensende.</P>

          <P>Alphabet und Sprache waren, solang Tolkien lebte - in
          einer st&auml;ndigen Entwicklung begriffen und er Formte
          sie, bis hin zu den Lautverschiebungen die sich in jeder
          Sprache durch vergehen von Jahrhunderten und
          Jahrtausenden ergeben.</P>

          <P>Er lie&szlig; sich von anderen Sprachen inspirieren.
          so war das Altfinnische sein Vorbild f&uuml;r die Sprache
          der Hochelben.</P>

          <P>Auch wenn es eigenartig scheint, so war "Der Herr der
          Ringe" nie das f&uuml;r Tolkien wichtigste Werk seines
          Lebens.</P>

          <P>Erst hatte es tats&auml;chlich ein reines
          Weiterspinnen der Geschichte des Bilbo beutlin sein
          sollen, doch die Geschichte schien sich unter Tolkiens
          H&auml;nden zu verselbstst&auml;ndigen und so wurde es
          weniger eine Fortsetzung des kleinen Hobbits, als eher
          eine &Uuml;berleitung zu dem, was Tolkien immer als sein
          Lebenswerk angesehen hatte: Das Silmarillion mit seiner
          Geschichte, seinen Sprachen und der sorgf&auml;ltigen
          Ausarbeitung bis hin zu Landkarten eines jeden Landes von
          Mittelerde.</P>

          <P>Jedoch war John Ronald Reuel Tolkien nie ein
          Konsequenter Mensch, der eine angefangene Arbeit auch
          immer sofort zum Abschluss brachte.</P>

          <P>So wurde das Buch erst 1949 fertig und er bot es dem
          ersten Verlag zur Ver&ouml;ffentlichung an.</P>

          <P>Nicht, dass die Geschichte kein Wohlwollen erregt
          h&auml;tte, doch wem er es auch Anbot, jedem Verlag
          schien das Manuskript zu lang, da das, was wir heute als
          drei B&uuml;cher kennen damals als ein einziges
          ver&ouml;ffentlicht werden sollte.</P>

          <P>1954 erscheinen schlie&szlig;lich die ersten beiden
          B&auml;nde des Herren der Ringe, herausgebracht vom
          gleichen Verlag, der schon den kleinen Hobbit
          ver&ouml;ffentlichte.</P>

          <P>Man ist &uuml;bereingekommen, dass es ratsam
          w&auml;re, das eine Buch in letztlich drei B&auml;nde
          aufzuteilen und diese nacheinander herauszubringen.</P>

          <P>1955 erscheint dann der dritte band und alle
          B&uuml;cher haben schnell einen gro&szlig;en Erfolg.</P>

          <P>1959 wird Tolkien pensioniert.</P>

          <P>1965, kurz vor dem Abschluss eines Vertrages f&uuml;r
          einen Amerikanischen Taschenbuchverlag, bringt Ace Books
          in den USA unautorisiert eine Taschenbuchauflage heraus,
          die preiswerter verkauft werden kann, als die
          geplante.</P>

          <P>Tolkien war jedoch immer ein flei&szlig;iger
          Beantworter von Leserbriefen gewesen und hatte daher
          schon eine gro&szlig;e Fangemeinde in den USA.</P>

          <P>So gelingt es ihm, daf&uuml;r zu sorgen, dass die
          unautorisierten Taschenb&uuml;cher nicht nur nicht
          gekauft werden, sondern auch einige Studenten teils
          handgreiflich daf&uuml;r Sorge tragen, dass
          Buchh&auml;ndler diese Ausgabe aus ihren Regalen
          entfernen.</P>

          <P>Das ist der Beginn des Kultes um den Herren der
          Ringe.</P>

          <P>1971 Stirbt seine Frau Edith und so lebt er ab 1972 in
          R&auml;umlichkeiten, die ihm in Oxford zur Verf&uuml;gung
          gestellt werden.</P>

          <P>In diesem Jahr erh&auml;lt er von der K&ouml;nigin
          einen Orden und von der Universit&auml;t Oxford ein
          Ehrendoktorat der Literaturwissenschaft.</P>

          <P>Am 28.08. 1973 f&auml;hrt er nach Bournemouth, um dort
          Freunde zu besuchen.</P>

          <P>Dort wird er krank und stirbt in einer Klinik am
          02.09. des gleichen Jahres im Alter von 81 Jahren.</P>

          <P>Sein Sohn Christopher Tolkien nimmt sich daraufhin der
          Aufzeichnungen seines Vaters an, beginnt sie zu ordnen,
          einige Landkarten noch einmal zu zeichnen und
          schlie&szlig;lich die kleinen und gro&szlig;en
          Geschichten, die zu Lebenszeiten Tolkiens nie
          ver&ouml;ffentlicht wurden, zusammenzufassen und zu
          ver&ouml;ffentlichen.</P>

          <P>Und so erschien endlich auch Tolkiens liebstes Werk,
          das Silmarillion.</P>

          <P><B>B&uuml;cher:</B><BR>
           <B>Erstes Buch:</B> Der Kleine Hobbit<BR>
           <B>Letztes Buch:</B> Die Abenteuer des Tom Bombadil</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a03"></A> 

          <H3>Name: Marklund<BR>
          Vorname: Liza<BR>
          Vorgestellt von: nathalie<BR>
          Geburtsdatum: 09.09.1962<BR>
          Sterbedatum:</H3>

          <P><B>Biografie:</B><BR>
          Liza Marklund wurde im September 1962 in
          Pite&aring;/Schweden geboren. Bereits mit 16
          verlie&szlig; sie vorzeitig die Schule und schlug sich
          zeitweise eher schlecht als recht durch. Es hielt sie
          nicht in Schweden, so dass sie quer durch die ganze Welt
          reiste. Beispielsweise arbeitete sie als
          Orangenpfl&uuml;ckerin in Israel, kellnerte in London,
          wurde in Griechenland als Landstreicherin verhaftet,
          &uuml;bernahm Statistenrollen in Hollywood und
          schmuggelte mit ihrem amerikanischen Freund zusammen
          gestohlene Autos &uuml;ber die
          US-amerikanisch-mexikanische Grenze. Mittlerweile lebt
          sie in Stockholm. Sie ist verheiratet und hat drei Kinder
          und arbeitet erfolgreich als Reporterin.</P>

          <P>Schon als Kind dachte sie sich immer Geschichten aus,
          in denen eine Heldin eine gro&szlig;e Rolle spielte:
          Annika!</P>

          <P>Mit ihrem Erstlingswerk "Olympisches Feuer" eroberte
          Liza Marklund die Bestsellerlisten, obwohl sie keinen
          gro&szlig;en Verlag an der Hand hatte und auch keine
          gro&szlig;e Werbetrommel f&uuml;r sie ger&uuml;hrt
          wurde.</P>

          <P>Liza Marklund &uuml;ber ihre B&uuml;cher: "Meine
          B&uuml;cher sind gut, denn sie sind
          glaubw&uuml;rdig."</P>

          <P><B>B&uuml;cher:<BR>
           Erstes Buch:</B><BR>
          Olympisches Feuer</P>

          <P><B>Letztes Buch:</B><BR>
          The Red Wolf</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a04"></A> 

          <H3>Name: Gaskin<BR>
          Vorname: Catherine<BR>
           Vorgestellt von: Rothaut<BR>
          Geburtsdatum: 1929<BR>
          Sterbedatum:</H3>

          <P><B>Biografie:</B><BR>
          Catherine Gaskin wurde 1929 in County Louth/Irland
          geboren und wuchs in Australien auf. Mit 15 Jahren
          schrieb sie ihren ersten erfolgreichen Roman. Nach
          langj&auml;hrigen Aufenthalten in England und den USA
          lebt sie heute auf der Isle of Man.<BR>
           Quelle: www.amazon.de</P>

          <P><B>B&uuml;cher:<BR>
          Erstes Buch:</B><BR>
          </P>

          <P><B>Letztes Buch:</B></P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a05"></A> 

          <P></P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

