<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>Buchbesprechungen/ -vorstellungen</TITLE>
  </HEAD>

  <BODY background="images/bga.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <A name="top"></A> 

          <P align="center"><FONT color="#000080" size=
          "6"><B>Buchbesprechungen/ -vorstellungen</B></FONT></P>

          <H3>Inhalt:</H3>

          <UL>
            <LI><A href="#a01">Das Haus zwischen den
            Welten</A></LI>

            <LI><A href="#a02">Durchs wilde Kurdistan</A></LI>

            <LI><A href="#a03">In den Schluchten des
            Balkan</A></LI>

            <LI><A href="#a04">Von Bagdad nach Stambul</A></LI>

            <LI><A href="#a05">Landung auf Darkover</A></LI>

            <LI><A href="#a06">Die Bruderschaft</A></LI>

            <LI><A href="#a07">Oppenheimer &amp; die Bombe</A></LI>

            <LI><A href="#a08">Matilda</A></LI>

            <LI><A href="#a09">Die Stunde der Wahrheit</A></LI>

            <LI><A href="#a10">Munie - ein Reportage-Roman</A></LI>
          </UL>
          <HR>
          <A name="a01"></A> 

          <H3>Buchtitel: Das Haus zwischen den Welten<BR>
          Autor: Zimmer Bradley Marion<BR>
          Vorgestellt von: Eowyn<BR>
          Verlag: Bastei-Verlag Gustav H. L&uuml;bbe GmbH &amp;
          Co.,<BR>
          Erscheinungsjahr: 1983<BR>
          Gesamtseitenzahl: 332<BR>
          ISBN: 3-404-28112-8<BR>
          Format: Digital</H3>

          <P><B>Inhalt:</B><BR>
           Cameron Fenton nimmt als Parapsychologe an einem
          Experiment mit dem Mittel Antaril teil.</P>

          <P>Nach der Injektion verliert sein K&ouml;rper das
          Bewusstsein und sein "Geist" verl&auml;sst zuerst ihn und
          schlie&szlig;lich auch das
          Universit&auml;tsgeb&auml;ude.</P>

          <P>Er wandert &uuml;ber das Gel&auml;nde und findet sich
          pl&ouml;tzlich und unvermittelt in der schneebedeckten
          Landschaft einer v&ouml;llig anderen Welt wieder.</P>

          <P>So stellt Fenton fest, dass das Antaril die
          M&ouml;glichkeit bietet, die eigene Welt zu verlassen und
          in andere Welten vorzudringen, jedoch nur k&ouml;rperlos,
          als "Zwischenmensch".</P>

          <P>Beim ersten Mal gelangt er in die Welt der Feen und
          wird Zeuge, wie deren K&ouml;nigin von kleinen dunklen
          Wesen angegriffen und verschleppt wird.</P>

          <P>Sie k&auml;mpfen mit Eisen, das von den Feen nicht
          ber&uuml;hrt werden kann, sie verbrennt und sogar durch
          blo&szlig;e Ber&uuml;hrung t&ouml;ten kann.</P>

          <P>Er wird gewahr, dass der Anf&uuml;hrer dieser Wesen
          ein Mensch ist, der sich immer wieder unbefugt Zugang zu
          der Feenwelt verschafft, um das sch&ouml;ne Volk mit
          Krieg und Tod zu &uuml;berziehen.</P>

          <P>Nach seiner R&uuml;ckkehr findet er nat&uuml;rlich bei
          niemandem Geh&ouml;r f&uuml;r seine unglaubliche
          Geschichte. Erst als der erste Mord stattfindet, ein
          M&auml;dchen aus der Universit&auml;t, das ebenfalls am
          Antaril-Experiment teilgenommen hat von den brutalen
          Eisenwesen verst&uuml;mmelt und get&ouml;tet wird,
          gelingt es ihm, die Aufmerksamkeit eines Professors und
          seiner Freundin Sally zu erregen.</P>

          <P>Gemeinsam beschlie&szlig;en sie, gegen die Eisenwesen
          und ihren Anf&uuml;hrer vorzugehen und sie sollen
          feststellen, dass nicht nur Antaril ein Tor zu fremden
          Welten ist.</P>

          <P><B>Anmerkungen:</B><BR>
           Marion Zimmer Bradley hat hier ein fesselndes Werk
          geschaffen, in dem der Leser sich tats&auml;chlich in
          eine Welt versetzen kann, die nicht allein und
          verschlossen ist.</P>

          <P>Immer wieder wird gezeigt, wie leicht es sein kann,
          von einer faszinierenden Welt in die andere
          &uuml;berzutreten, wozu allein das alte Wissen n&ouml;tig
          ist, und was ebenfalls nur vom richtigen Stand der Sonne
          und des Mondes abh&auml;ngt.</P>

          <P>Fenton st&ouml;&szlig;t auch in anderen Welten auf
          Wesen, die denen, die er aus seiner Welt kennt
          unglaublich &auml;hnlich ist.</P>

          <P>Immer wieder wird deutlich, wie selbst das Schicksal
          v&ouml;llig fremder Welten miteinander verwoben ist.</P>

          <P>In der Andersartigkeit mancher Umgebungen, in die
          Fenton ger&auml;t, kann sich der Leser verlieren und hat
          genug Spielraum f&uuml;r die eigene Phantasie.</P>

          <P><B>Empfehlung:</B><BR>
          Wer Phantasy gern liest, wird an diesem Buch viel Freude
          haben.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a02"></A> 

          <H3>Buchtitel: Durchs wilde Kurdistan<BR>
           Autor: Karl May<BR>
           Vorgestellt von: Rothaut<BR>
           Verlag: Karl-May-Verlag<BR>
           Erscheinungsjahr: 1951<BR>
           Gesamtseitenzahl: 563<BR>
           ISBN: 3780200023<BR>
           Format: Schwarzdruck/digital Ascii</H3>

          <P><B>Inhalt:</B><BR>
          Durchs wilde Kurdistan setzt Kara Ben Nemsi zusammen mit
          Halef und dem spleenigen Sir David Lindsay seine
          Orientreise fort. Bei den allseits verachteten
          "Teufelsanbetern" gibt es weitere Abenteuer: Amad el
          Ghandur, der Sohn von Scheik Mohammed Emin, ihrem
          Gastfreund, soll aus der Festung in Amadije befreit
          werden...<BR>
          Quelle: www.amazon.de</P>

          <P><B>Anmerkungen:</B><BR>
          Die Personen- und Charakterbeschreibungen sowie
          Verkn&uuml;pfung von spannender Handlung und
          Weltanschauung faszinieren mich immer wieder.</P>

          <P><B>Empfehlung:</B><BR>
          Ich kann den 6b&auml;ndigen Zyklus nur w&auml;rmstens
          empfehlen. Man f&uuml;hlt sich in eine Welt versetzt, die
          doch sehr viel Bezug zur Realit&auml;t besitzt, doch aber
          aus Tr&auml;umen und Phantasien besteht.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a03"></A> 

          <H3>Buchtitel: In den Schluchten des Balkan<BR>
          Autor: May, Karl<BR>
           Vorgestellt von: Rothaut<BR>
          Verlag: Hafmansverlag, Z&uuml;rich<BR>
           Erscheinungsjahr: 1992<BR>
          Gesamtseitenzahl: 519<BR>
           ISBN:<BR>
           Format: Digital</H3>

          <P><B>Inhalt:</B><BR>
           In Stambul begegnen Kara Ben Nemsi und Halef einem alten
          Freund, dem jungen Araber Omar Ben Sadek und erfahren
          durch ihn von einer Verbrecherbande, die den ganzen
          Balkan in Angst und Schrecken versetzt, und deren
          Anf&uuml;hrer ein geheimnisvoller Mann ist, den alle nur
          Schut nennen, den jedoch noch nie jemand zu Gesicht
          bekommen hat. Statt nun voneinander Abschied zu nehmen,
          beschlie&szlig;en die Freunde noch weiter
          zusammenzubleiben, um gemeinsam mit Omar und Osko, einem
          alten Montenegriner, diese Bande aufzudecken und ihr das
          Handwerk zu legen.</P>

          <P>Durch den Rosenz&uuml;chter Jafis erfahren die
          Gef&auml;hrten schon mehr &uuml;ber die Anh&auml;nger des
          Schut und die Koptscha, einem Geheimzeichen unter den
          Verb&uuml;ndeten.</P>

          <P>Da es diesen nicht verborgen geblieben ist, da&szlig;
          Kara Ben Nemsi sie aufsp&uuml;ren will, stellen sie ihm
          schon bald eine Falle. Deselim, der Schwager des Schut
          und M&uuml;barek, ein falscher Heiliger, der in der Maske
          eines Bettlers f&uuml;r den Schut t&auml;tig ist, locken
          Kara Ben Nemsi in eine Waldh&uuml;tte und &uuml;berfallen
          ihn dort. Halef gelingt es, Kara Ben Nemsi zu befreien,
          Deselim aber, der auf Rih, dem Wunderpferd Kara Ben
          Nemsis entfliehen wollte, kommt dabei um.</P>

          <P>Da Kara Ben Nemsi sich nun durch die Koptscha
          ausweist, die er Deselim abgenommen hat, wird er von
          dessen Bruder in Ismilan gastlich aufgenommen und
          erf&auml;hrt von einer Schluchth&uuml;tte, in der sich
          der Schut oft aufhalte.</P>

          <P>In Melnik fallen die Gef&auml;hrten den Anh&auml;ngern
          des Schut fast in die H&auml;nde, doch gelingt es ihnen,
          zu entfliehen. In den Ruinen von Ostromdscha, einem
          geheimen Ort der Bande, fassen sie M&uuml;barek und
          &uuml;bergeben ihn den H&uuml;tern des Gesetzes. Dann
          brechen die Freunde nach Shiganzy auf, dem Ort, in dessen
          N&auml;he sich die Schluchth&uuml;tte befindet, in der
          sie dem Schut zu begegnen hoffen.</P>

          <P><B>Quelle:</B><BR>
          http://www.europa-vinyl.de/balkan.php3</P>

          <P><B>Anmerkungen:</B><BR>
          Auch dieses Buch ist gepr&auml;gt von h&ouml;chster
          Spannung und tiefster Menschlichkeit.</P>

          <P><B>Empfehlung:</B><BR>
          Das Buch legst du nicht aus der Hand, bis es zu Ende
          gelesen wurde.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a04"></A> 

          <H3>Buchtitel: Von Bagdad nach Stambul<BR>
          Autor: Karl May<BR>
           Vorgestellt von: Rothaut<BR>
          Verlag: Karl-May-Verlag<BR>
           Erscheinungsjahr: 1951<BR>
          Gesamtseitenzahl: 562<BR>
           ISBN: 3780200031<BR>
           Format: Digital/schwarzdruck</H3>
           <B>Inhalt:</B> <BR>
           Auf dem R&uuml;ckweg zu den Weidegr&uuml;nden des
          Araberstammes der Haddedihn ger&auml;t Kara Ben Nemsi mit
          seinen Gef&auml;hrten noch in einen Kampf mit den
          r&auml;uberischen Bebbeh-Kurden, die eine reiche
          persische Familie &uuml;berfallen haben. Es gelingt
          ihnen, die persische Familie zu retten, doch f&auml;llt
          im Kampf der alte Scheik Mohammed Emin. 

          <UL>
            <LI>Hoch oben im kurdischen Gebirge errichten die
            Freunde ihm ein Grabmal. Amad el Ghandur, seinen Sohn,
            aber treibt es daraufhin zur&uuml;ck, den Bebbeh-Kurden
            nach, um den Vater zu r&auml;chen.</LI>

            <LI>Hassan schlie&szlig;t sich dann der Todeskarawane
            an, in der Pilger ihre verstorbenen Angeh&ouml;rigen
            nach der heiligen Stadt Nedschef bringen, um dort den
            Feiertag der Schiiten - wie eine Glaubensrichtung der
            Mohammedaner genannt wird - zu begehen.</LI>

            <LI>Durch den Verrat seines stummen Dieners Saduk und
            seines Vertrauten, Mirsa Selim, wird Hassan mit seiner
            Familie nicht weit von den Ruinen des alten Babylon
            &uuml;berfallen. Die Hilfe Kara Ben Nemsis und Halefs
            kommt zu sp&auml;t...</LI>

            <LI>Dann erkranken Kara Ben Nemsi und Halef an der
            Pest, w&auml;hrend Sir David Lindsay in den Ruinen von
            Babylon spurlos verschwindet...</LI>

            <LI>Wie durch ein Wunder &uuml;berstehen beide Freunde
            die Pest. Bevor sie jedoch die Weidegr&uuml;nde der
            Haddedihn wieder erreichen, verlieren sie in einem
            Kampf mit W&uuml;stenr&auml;ubern ihren treuen Hund
            Dojan, das Geschenk eines Missuri-Kurden.</LI>

            <LI>Bei den Haddedihn erwarten sie dagegen freudige
            &Uuml;berraschungen...</LI>

            <LI>Nach ein paar erholsamen Wochen bei den Haddedihn
            beschlie&szlig;en die Freunde gemeinsam nach Stambul
            aufzubrechen, wo wieder Gefahren und weitere Abenteuer
            auf sie warten.</LI>
          </UL>

          <P><B>Quelle:</B><BR>
          http://www.europa-vinyl.de/bagdad.php3</P>

          <P><B>Anmerkungen:</B><BR>
          Wie alle b&uuml;cher dieser Serie l&auml;sst auch dieses
          Werk einem alles rundum vergessen und man versinkt in die
          spannende Welt von Kara ben Nemsi und Hadschi Halef Omar.
          Ich hatte beim Lesen das Gef&uuml;hl, als w&auml;re ich
          mit ihnen unterwegs, ritte Auf Rih durch die Landschaft,
          empfand die Trauer um Mohammed Emin, die Ohnmacht der
          schweren Krankheit, das Gef&uuml;hl der Verzweiflung,
          nichts gegen die M&ouml;rder unternehmen zu
          k&ouml;nnen.</P>

          <P><B>Empfehlung:</B><BR>
          Ich empfehle dieses Buch, weil es einmal mehr die
          Sch&ouml;pferkraft und Phantasie des Autors unter Beweis
          stellt.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a05"></A> 

          <H3>Buchtitel: Landung auf Darkover<BR>
          Autor: Zimmer Bradley Marion<BR>
           Vorgestellt von: Eowyn<BR>
           Verlag: Moewig<BR>
           Erscheinungsjahr: 1995<BR>
           Gesamtseitenzahl: 187<BR>
           ISBN: 3811829084<BR>
           Format: Digital</H3>

          <P><B>Inhalt:</B><BR>
           Besch&auml;digt durch einen Gravitationssturm landet ein
          Sternenschiff auf einem v&ouml;llig unbekannten Planeten.
          Er unterscheidet sich stark von der Erde mit seiner
          niedrigen Gravitation, einer tiefroten Sonne und den vier
          Monden die nachts am Himmel stehen.</P>

          <P>Ein gro&szlig;er Teil der Besatzung ist tot, das
          Schiff so schwer besch&auml;digt, dass es ohne weiteres
          nicht wieder wird starten k&ouml;nnen.</P>

          <P>Der Captain, seine Besatzung und die Passagiere,
          welche urspr&uuml;nglich zur Kolonialisierung eines
          anderen Planeten auf diese Reise mitgekommen waren,
          beginnen nun, zu erforschen, ob ein &Uuml;berleben in
          dieser fremdem Umgebung m&ouml;glich ist.</P>

          <P>Das Fehlen von Rohstoffen wie &Ouml;l oder Metallen
          machen ihnen bald klar, dass das Erhalten und Entwickeln
          von Technologie hier fast unm&ouml;glich sein wird,
          ebenso wie Energiegewinnung nicht auf normalem Wege zu
          bewerkstelligen ist.</P>

          <P>Die Wetterbedingungen sind unwirklich und nachts wird
          der Planet bereits im Sommer von Regeng&uuml;ssen und in
          den h&ouml;heren Regionen von Schneest&uuml;rmen
          heimgesucht.</P>

          <P>Setzt jedoch der Regen f&uuml;r nur eine einzige Nacht
          aus, so &ouml;ffnen weiter in den bergen sch&ouml;ne
          blaue Blumen ihre Bl&uuml;ten und str&ouml;men Staub aus,
          der die Menschen in eine Art Wahn versetzt, der sich bei
          jedem unterschiedlich &auml;u&szlig;ert, bei einem in
          unbegr&uuml;ndetem Hass, beim anderen in Hysterie und
          Trauer, bei den meisten jedoch in einem regelrecht
          ungesteuerten sexuellen verlangen.</P>

          <P>In einer dieser Perioden des Wahns l&ouml;scht jemand
          die wichtigsten Programme des bis dahin noch halbwegs
          intakten Schiffscomputers.</P>

          <P><B>Anmerkungen:</B><BR>
          Aus dem Buch:<BR>
           "Mit ihrem DARKOVER-Zyklus hat die Autorin Marion Zimmer
          Bradley nicht nur Weltruhm erlangt, sie begr&uuml;ndete
          damit auch einen Kult.</P>

          <P>In den USA gab es selten ein so komplexes SF-Werk, das
          so viele begeisterte Anh&auml;nger fand und in immer noch
          wachsender Zahl an sich bindet.</P>

          <P>Der vorliegende Roman schildert, wie alles begann.
          Terranische Raumfahrer werden auf den Planeten der
          blutroten Sonne verschlagen und m&uuml;ssen, um zu
          &uuml;berleben, sich dem Planeten anpassen. Sie
          begr&uuml;nden eine eigenst&auml;ndige Kultur, die von
          ihrem terranischen Erbe ebenso gepr&auml;gt ist wie von
          den besonderen Kr&auml;ften, die sich langsam von ihrer
          neuen Umwelt auf sie &uuml;bertragen.</P>

          <P><B>Empfehlung:</B><BR>
          In diesem buch, ebenso wie in allen, die darauf folgen,
          schafft bradley eine Welt, die sich von unserer so stark
          unterscheidet, dass es tats&auml;chlich fesselnd ist. Wer
          glaubt, hier eine SF-Buchreihe zu finden, die aus
          Raumschiffen, Lasern und h&ouml;chster Technologie
          besteht, wird entt&auml;uscht werden. Es lohnt sich auf
          jeden Fall.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a06"></A> 

          <H3>Buchtitel: Die Bruderschaft<BR>
          Autor: Grisham, John<BR>
           Vorgestellt von: Bitschreck<BR>
          Verlag: Heyne<BR>
           Erscheinungsjahr: 2002<BR>
          Gesamtseitenzahl: 447<BR>
           ISBN: 3453210697<BR>
           Format: H&ouml;rbuch</H3>

          <P><B>Inhalt:</B><BR>
           In diesem Roman wird der Wahlkampf eines
          Pr&auml;sidentschaftskandidaten mit viel Spannung
          erz&auml;hlt. Lobbyisten und der CIA mischen kr&auml;ftig
          mit.</P>

          <P>Drei ehemalige Richter, die jetzt selbst im
          Gef&auml;ngnis sitzen, geben in einer Zeitschrift
          Anzeigen auf, in denen ein junger Mann die N&auml;he von
          reiferen Herren sucht. Es werden Herren ausgesucht, die
          ihre homosexuellen Neigungen verbergen. Ist der
          Briefkontakt fortgeschritten, erpressen die drei
          H&auml;ftlinge von ihren Opfern Geld. Auch der
          Pr&auml;sidentschaftskandidat hatte auf eine dieser
          Anzeigen geantwortet, bevor er zur Kandidatur
          &uuml;berredet wurde.</P>

          <P>Die Geschichte nimmt ihren lauf.</P>

          <P><B>Anmerkungen:</B><BR>
           Werden so Pr&auml;sidenten gemacht?</P>

          <P>Diese Frage stellte ich mir mehrfach. Einige
          Parallelen zur j&uuml;ngsten Vergangenheit konnte man
          schon erkennen.</P>

          <P><B>Empfehlung:</B><BR>
           Dieses Buch brachte mich oft zum lachen. Wegen der
          Parallelen zur realen Politik, kann man aber auch schon
          mal nachdenklich werden.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a07"></A> 

          <H3>Buchtitel: Oppenheimer &amp; die Bombe<BR>
          Autor: Strathern, Paul<BR>
           Vorgestellt von: Heiko<BR>
           Verlag: Fischer TB Verlag / Braille Press
          Z&uuml;rich<BR>
          Erscheinungsjahr: 2000<BR>
           Gesamtseitenzahl: 77<BR>
           ISBN: 3-596-14119-2<BR>
           Format: Punktschrift</H3>

          <P><B>Inhalt:</B><BR>
           In diesem Sachbuch wird die Lebensgeschichte des
          Physikers J. Robert Oppenheimer erz&auml;hlt. Der zweite
          Strang, dem Paul Strathern nachgeht, ist die Entwicklung
          der Atomphysik in der ersten H&auml;lfte des 20.
          Jahrhunderts. Oppenheimers Werdegang wie auch die
          Forschung mit der Kernspaltung f&uuml;hren den Leser nach
          Los Alamos, wo der geniale Wissenschaftler ein Team
          leitete, in dem er mit einer Reihe weiterer Forscher von
          Weltrang die erste Atombombe in der Menschheitsgeschichte
          entwickelte und zur Explosion brachte.</P>

          <P><B>Anmerkungen:</B><BR>
           Das Buch selbst ist nicht sehr bemerkenswert, die Figur
          J. Robert Oppenheimer und die Atombombe sind es sehr
          wohl. So trug der ber&uuml;hmte Wissenschaftler
          f&uuml;hrend dazu bei, dass der zweite Weltkrieg durch
          den Einsatz der Atombomben in Hiroshima und Nagasaki
          beendet wurde, wobei Hunderttausende Menschen ihr Leben
          verloren. Gleichzeitig war das gegenseitige
          Wettr&uuml;sten mit Atomwaffen pr&auml;gend f&uuml;r die
          Zeit des Kalten Krieges. Und heute bedrohen eine Vielzahl
          von Staaten - und bald wohl auch terroristischer Gruppen
          - die gesamte Weltbev&ouml;lkerung mit der
          vollst&auml;ndigen Zerst&ouml;rung ihrer Umwelt durch
          Atomkrieg und die Verseuchung durch Strahlung. Somit ist
          es spannend, einmal den Anf&auml;ngen dieser Entwicklung
          nachzugehen.</P>

          <P>Die Darstellung Paul Stratherns ist sehr knapp
          gehalten. Darunter leidet nat&uuml;rlich die Genauigkeit.
          Komplexe Prozesse wie die Erforschung der Atome und die
          Entdeckung der Kernspaltung werden hier auf nicht einmal
          80 Punktschriftseiten er&ouml;rtert. Dazu versucht der
          Autor auch noch mit einigen - nicht immer sehr
          interessanten - Anekdoten die Pers&ouml;nlichkeit
          Oppenheimers und seiner Freunde und Widersacher zu
          durchleuchten. Beides bleibt oberfl&auml;chlich.</P>

          <P>Andererseits liefert Strathern dem Leser eine grobe
          Skizze der historisch so gewichtigen Entwicklung der
          Atombombe und ordnet ihren Bau historisch ein.
          Gleichzeitig vermittelt er eine Ahnung davon, welche
          inneren Prozesse in Wissenschaftlern stattfinden
          m&uuml;ssen, die vor allem nach Erkenntnis streben, die
          nur noch das Gelingen des Projekts vor Augen haben und
          die sich erst viel sp&auml;ter eingestehen m&uuml;ssen,
          dass ihre Arbeit der Menschheit viel Ungl&uuml;ck
          gebracht hat.</P>

          <P><B>Empfehlung:</B><BR>
          "Oppenheimer &amp; die Bombe" ist empfehlenswert f&uuml;r
          Leser, die sich ohne Vorkenntnisse leicht
          verst&auml;ndlich und kurzweilig &uuml;ber die
          Entwicklung der Atombombe und &uuml;ber ihren Erfinder J.
          Robert Oppenheimer informieren wollen. F&uuml;r Leser mit
          guten Physikkenntnissen oder f&uuml;r diejenigen, die
          differenzierte Hintergrundinformationen zum Leben
          Oppenheimers w&uuml;nschen, ist dieses Buch zu
          oberfl&auml;chlich.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a08"></A> 

          <H3>Buchtitel: Matilda<BR>
           Autor: Dahl, Roald<BR>
           Vorgestellt von: Coni<BR>
          Verlag: London, Jonathan Cape Ltd<BR>
          Erscheinungsjahr: 1988<BR>
          Gesamtseitenzahl: 240<BR>
           ISBN: 0-224-02572-4<BR>
           Format: digital</H3>

          <P><B>Inhalt:</B><BR>
          Matilda ist ein hochbegabtes Kind. Mit drei Jahren bringt
          sie sich selbst das Lesen bei und liest seitdem alles,
          was sie in die Finger bekommt. Doch ihre Eltern sind sehr
          ignorant und behandeln sie wie den letzten Dreck.
          Daf&uuml;r bekommt Matilda, als sie in die Schule kommt,
          eine Lehrerin, die sich r&uuml;hrend um sie k&uuml;mmert.
          Doch bald stellt sich heraus, dass die Lehrerin sehr arm
          ist und obendrein noch die Nichte der Direktorin, die ihr
          ihr Gehalt vorenth&auml;lt und obendrein noch ihr Erbe.
          Matilda f&auml;ngt an Pl&auml;ne zu schmieden, um ihrer
          Lehrerin zu helfen...</P>

          <P><B>Anmerkungen:</B><BR>
          Interessant und am&uuml;sant, aber teils auch etwas
          langatmig, v. a. wahrscheinlich f&uuml;r den, der den
          Film dazu gesehen hat.</P>

          <P><B>Empfehlung:</B><BR>
          Lesenswert f&uuml;r lange Wintertage</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a09"></A> 

          <H3>Buchtitel: Die Stunde der Wahrheit<BR>
          Autor: Gaskin, Catherine<BR>
           Vorgestellt von: Rothaut<BR>
          Verlag: DTV<BR>
           Erscheinungsjahr: 1999<BR>
          Gesamtseitenzahl: 590<BR>
           ISBN: 3423202513<BR>
           Format: digital (ascii)</H3>

          <P><B>Inhalt:</B><BR>
          Ganz zuf&auml;llig begegnen sich Dena Pentrose aus einer
          amerikanischen Industriellen-Dynastie und Geraldine
          Clayton, die Frau eines englischen Diplomaten, im
          Londoner St.-James-Park.</P>

          <P>Die beiden schlie&szlig;en enge Freundschaft. Ihre
          Familien sind in allen Hauptst&auml;dten der Welt zu
          Hause, eine Heimat jedoch finden sie in einem alten
          Schloss an der K&uuml;ste Cornwalls. Dort lebt auch die
          junge Waise Livy. Als sie Alex, den Sohn Denas, heiratet,
          scheint ihr Gl&uuml;ck vollkommen. Aber dann werden
          Treue, Freundschaft und Loyalit&auml;t auf eine harte
          Probe gestellt ... Ein Roman um Liebe und um Vertrauen,
          das alle Anfechtungen &uuml;berdauert.<BR>
           Quelle: http://www.buecheronline.at</P>

          <P><B>Anmerkungen:</B><BR>
          Ein Buch voll W&auml;rme, ohne kitschig zu wirken, ein
          Buch voller &Uuml;berraschungen.</P>

          <P><B>Empfehlung:</B><BR>
          Ich mag dieses Buch, weil es au&szlig;er Spannung so
          vielschichtige menschliche Komponenten enth&auml;lt.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a10"></A> 

          <H3>Buchtitel: Munie - ein Reportage-Roman <BR>
          Autor: Iben Melbye <BR>                        
          Vorgestellt von: Gonda <BR>                    
          Verlag: Sauerl&auml;nder, Ffm <BR>
          Erscheinungsjahr: 1994 <BR>                    
          Gesamtseitenzahl: 298 <BR>                     
          ISBN: 3794132335 <BR>                          
          Format: digital </H3>

          <P><B>Inhalt:</B><BR>

          Das Buch erz&auml;hlt ein Einzelschicksal von Michael, einem Jugendlichen aus
          D&auml;nemark, der bei einem Urlaub in den USA in die Mun-Bewegung - einer Sekte
          - hinein ger&auml;t. In dieser Sekte wird seine Pers&ouml;nlichkeit fast vollkommen
          ausgel&ouml;scht. Au&szlig;erdem werden seine alten Familien- und Freundesbindungen zu
          trennen versucht. Dem versuchen seine Eltern und seine Freundin, die aus
          D&auml;nemark in die USA einreist und dort den Kontakt mit (dem neuen) Michael
          sucht, entgegen zu wirken. </P>

          <P><B>Anmerkungen:</B><BR>

          Bei diesem Buch handelt es sich um einen Tatsachenbericht, durch den die
          Gefahr einer Sekte - als Studentenbewegung getarnt - (also einem Wolf im
          Schafspelz) dargestellt wird. Die Mun-Sekte nennt sich in der
          Bundesrepublik "Vereinigungskirche e.V.". Sie hat in Deutschland rund 1500
          Anh&auml;nger. Ihr Gr&uuml;nder, der Koreaner San Myung Mun, wurde 1920 im heutigen
          Nord-Korea geboren. Er ist noch am Leben. Die in diesem Buch geschilderten
          Arbeitsweisen einer Sekte zur Mitgliederwerbung und zum Geldscheffeln
          stehen sicherlich exemplarisch f&uuml;r viele Sekten. Gepaart mit der
          Beschreibung von Pers&ouml;nlichkeitsempfindungen und -konflikten ist dieses
          Buch jedoch lesenswert. </P>

          <P><B>Empfehlung:</B></P>  
          
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

