<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
    <!-- Author =  Mathias Klingner -->

    <TITLE>Bl&uuml;tenzauber im Winter</TITLE>
  </HEAD>

  <BODY background="images/bga.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" summary="">
      <TR>
        <TD>
          <CENTER>
            <TABLE border="1" summary="Formatierung" width="740"
            cellpadding="6">
              <TR>
                <TD>
                  <A href="mm_mmx.html"><FONT size="+1"><B>zur&uuml;ck</B></FONT></A>

                  <P align="center"><FONT color="#000080" size= "7"><B>Bl&uuml;tenzauber im
                  Winter</B></FONT><BR> Fotografische Eindr&uuml;cke aus den
                  Gew&auml;chsh&auml;usern<BR> des Botanischen Garten Berlin-Dahlem</P>

                  <P>Ende Januar besuchte ich den Botanischen Garten Berlin-Dahlem. Er ist
                  mit seinen mehr als 18 000 Pflanzenarten der gr&ouml;&szlig;te in Europa
                  und wurde 1897-1903 unter der Leitung von Adolf Engler angelegt.</P>

                  <TABLE border="0" summary="Text" width="100%">
                    <TR>
                      <TD>
                        <TABLE border="1" summary="Bild1" vspace="6">
                          <TR>
                            <TD><IMG src="images/bg01.jpg" width="240" height="360" alt="Bild01"><BR>
                             01: Gew&auml;chshaus Mittelmeer und Kanarische Inseln</TD>
                          </TR>
                        </TABLE>
                      </TD>

                      <TD valign="top">
                      <P>Der Botanische Garten hat 16 Gew&auml;chsh&auml;user mit tropischen und
                      subtropischen Pflanzen. Das gro&szlig;e Tropenhaus ist 60 m lang, 30 m
                      breit und 25 m hoch. Bei hoher Luftfeuchtigkeit und W&auml;rme wachsen hier
                      z.B. der Riesenbambus und auch ausgefallene Arten von Orchideen,
                      fleischfressenden Pflanzen, Kakteen und Seerosen. Am Nordeingang befindet
                      sich noch das Botanische Museum mit einer interessanten Sammlung von
                      pr&auml;parierten Pflanzen und eine Fachbibliothek.</P>

                      <P>Zur gleichen Zeit, als ich meinen Besuch machte, fand im Neuen Glashaus
                      eine Sonderschau: "Bl&uuml;tenzauber im Winter -Gestaltete Pracht"
                      statt.</P>

                      <P>Diese Sonderschau war im Neuen Glashaus in drei Ebenen angelegt. In der
                      unteren Ebene wurde ein kleiner Ausschnitt des italienischen Gartens mit
                      Narzissen und Tulpen aber auch mit Wild-Fliederprimeln gezeigt. In diesem
                      Teil waren auch gr&ouml;&szlig;ere Vogelk&auml;fige mit V&ouml;geln die mit
                      ihrem Gezwitscher etwas Fr&uuml;hling in das Gew&auml;chshaus holten.</P>

                      <P>In der mittleren Ebene wurden Kulturpflanzen gezeigt die fr&uuml;her
                      einmal in "Mode" waren. Es wurden dort Pflanzen gezeigt, die wahrscheinlich
                      nur noch die &auml;lteren Leser kennen. So wurden z.B. die Zimmerlinde, die
                      Zimmertanne und der Zimmerhopfen gezeigt.</P>

                      <P>In der oberen Ebene wurden um eine gr&ouml;&szlig;ere Wasserfl&auml;che
                      herum die verschiedensten tropischen Pflanzen, Zitrusstr&auml;ucher,
                      Azaleen, Schl&uuml;sselblumen, Rittersterne, Kamelienstr&auml;ucher u.a.
                      Pflanzen gruppiert (Bilder 02-08).</P>
                      </TD>
                    </TR>
                  </TABLE>

                  <TABLE border="1" summary="Bild2-7" width="100%">
                    <TR>
                      <TD align="center"><IMG src="images/bg02.jpg" width="360" height="240"
                      alt="Bild02"><BR>
                      02: heimatliche und tropische Pflanzenwelt</TD>

                      <TD align="center"><IMG src="images/bg03.jpg" width="360" height="240"
                      alt="Bild03"><BR>
                      03: Rhododendron simsii Hybride</TD>
                    </TR>

                    <TR>
                      <TD align="center"><IMG src="images/bg04.jpg" width="360" height="240"
                      alt="Bild04"><BR>
                      04: Rhododendron-sim "Alpenrose"</TD>

                      <TD align="center"><IMG src="images/bg06.jpg" width="360" height="240"
                      alt="Bild06"><BR>
                      06: Apfelsinenbaum</TD>
                    </TR>

                    <TR>
                      <TD align="center"><IMG src="images/bg05.jpg" width="240" height="360"
                      alt="Bild05"><BR>
                      05: Azalee</TD>

                      <TD align="center"><IMG src="images/bg07.jpg" width="240" height="360"
                      alt="Bild07"><BR>
                      07: im Hintergrund Bananenstauden</TD>
                    </TR>
                  </TABLE>

                  <P>Bei meinem Gang durch die Gew&auml;chsh&auml;user gelangte ich auch zu
                  dem gr&ouml;&szlig;ten, welches ich oben schon erw&auml;hnte. Dort wuchsen
                  Palmen und der Riesenbambus. (Bilder 09-11). In diesem befand sich auch ein
                  Wasserfall und ein kleiner Teich, in denen Zierkarpfen und
                  Schildkr&ouml;ten lebten (Bild 12).</P>

                  <TABLE border="1" summary="Bild9-12" width="100%">
                    <TR>
                      <TD align="center"><IMG src="images/bg09.jpg" width="240" height="360"
                      alt="Bild09"><BR>
                      09: Palme</TD>

                      <TD align="center"><IMG src="images/bg10.jpg" width="240" height="360"
                      alt="Bild10"><BR>
                      10: Detail des Palmenstammes</TD>
                    </TR>

                    <TR>
                      <TD align="center"><IMG src="images/bg11.jpg" width="240" height="360"
                      alt="Bild11"><BR>
                      11: Bambus</TD>

                      <TD align="center"><IMG src="images/bg12.jpg" width="240" height="360"
                      alt="Bild12"><BR>
                      12: Teich mit Zierkarpfen</TD>
                    </TR>
                  </TABLE>

                  <P>In seitlich angebauten, durch eine T&uuml;r abgetrennten R&auml;umen des
                  Gew&auml;chshauses, konnte man z.B. Kannenpflanzen sehen. Diese wachsen in
                  lockeren, lichten W&auml;ldern auf ausgewaschenen B&ouml;den in
                  regenreichen Gebieten der Tropen. Sie sind aber auch auf vern&auml;ssten,
                  moorigen B&ouml;den, in den inneren Randbereichen der Mangrovenzone und an
                  Felsen zu finden. Durch die Zusatznahrung k&ouml;nnen die Kannenpflanzen
                  auch besonders n&auml;hrstoffarme Gegenden besiedeln. Die von Linn&eacute;
                  1753 aufgestellte Gattung Nepenthes umfasst zur Zeit 82 Arten.</P>

                  <P>Die Kannenpflanzen sind von Madagaskar bis nach Neukaledonien
                  verbreitet. Die gr&ouml;&szlig;te Artenvielfalt ist in Indonesien, Malaysia
                  und auf den Philippinen zu finden.</P>

                  <P>Die Beutetiere der Kannenpflanzen sind in erster Linie Ameisen, aber
                  auch in geringerem Umfang Insekten wie Schaben, Hundertf&uuml;&szlig;ler,
                  Fliegen, K&auml;fer und Schmetterlinge. Seltener werden Schnecken oder
                  kleine Eidechse, Geckos oder Fr&ouml;sche zu Opfern dieser Pflanze. Nicht
                  alle in den Kannen gefundene Tiere sind auch Beutetiere. Einige spezielle
                  Insekten wie z.B. Krabbenspinnen leben auch in Symbiose mit den
                  Kannenpflanzen. Die Nephenthes-Kannen sind somit also nicht nur
                  Todesfallen, sondern in manchen F&auml;llen auch Orte spezieller
                  Lebensgemeinschaften (Bilder 13 und 14).</P>

                  <P>Im Gew&auml;chshaus Mittelmeer und Kanarische Inseln entdeckte ich die
                  in Deutschland unter dem Namen "L&ouml;wenmaul" bekannte Pflanze (Bild
                  16).</P>

                  <TABLE border="1" summary="Bild13-16" width=
                  "100%">
                    <TR>
                      <TD align="center"><IMG src="images/bg13.jpg" width="240" height="360"
                      alt="Bild13"><BR>
                      13: Kannenpflanze</TD>

                      <TD align="center"><IMG src="images/bg15.jpg" width="240" height="360"
                      alt="Bild15"><BR>
                      15: Banskia prionotes Lindl</TD>
                    </TR>

                    <TR>
                      <TD align="center"><IMG src="images/bg14.jpg" width="360" height="240"
                      alt="Bild14"><BR>
                      14: Kannenpflanze mit hakenf&ouml;rmigen
                      Moosfarn</TD>

                      <TD align="center"><IMG src="images/bg16.jpg" width="360" height="240"
                      alt="Bild16"><BR>
                      16: "L&ouml;wenmaul"</TD>
                    </TR>
                  </TABLE>

                  <P>In Bild 18 sieht man Aeonium nobile Praeger der Gattung Greenovia. Die
                  Gattung Greenovia besteht aus nur 4 Arten (Greenovia aizoon, Greenovia
                  aurea, Greenovia diplocycla und Greenovia dodrentalis), von denen alleine 3
                  auf Tenerife gefunden werden k&ouml;nnen. Sie wachsen mehrheitlich auf der
                  Nordseite in Felsspalten in den "Barrancos" (typische tief eingeschnittene
                  Schluchten, besonders auf den westlichen Inseln und Gran Canaria
                  vorhanden). Durch ihre dichten Rosetten und hellen blaugr&uuml;nen
                  Bl&auml;tter werden sie von den Einheimischen auch "rosas del monte"
                  (Bergrosen) genannt.</P>

                  <TABLE border="1" summary="Bild17-20" width="100%">
                    <TR>
                      <TD align="center"><IMG src="images/bg17.jpg" width="360" height="240"
                      alt="Bild17"><BR>
                      17: Paradiesvogelblume</TD>

                      <TD align="center"><IMG src="images/bg18.jpg" width="360" height="240"
                      alt="Bild18"><BR>
                      18: Aeonium nobile Praeger, Gattung:Greenovia</TD>
                    </TR>

                    <TR>
                      <TD align="center"><IMG src="images/bg19.jpg" width="360" height="240"
                      alt="Bild19"><BR>
                      19: Goldkugelkaktus aus Mexiko</TD>

                      <TD align="center"><IMG src="images/bg20.jpg" width="360" height="240"
                      alt="Bild20"><BR>
                      20: und drau&szlig;en ist es Winter</TD>
                    </TR>
                  </TABLE>

                  <P>Zuletzt sah ich auf meinem Rundgang durch die Gew&auml;chsh&auml;user
                  diese sch&ouml;nen Kugelkakteen aus Mexiko. Sie haben ca. einen Durchmesser
                  von 60-70 cm. Im gleichen Gew&auml;chshaus hatte man vom oberen Teil aus
                  einen sch&ouml;nen &Uuml;berblick und einen Ausblick nach drau&szlig;en, wo
                  man einen Blick auf die winterliche Umgebung werfen konnte (Bild 19 und
                  20).</P>

                  <P>Es hat mir in den Gew&auml;chsh&auml;usern des Botanischen Gartens
                  Berlin-Dahlem gut gefallen. Ich habe eine Menge neue Dinge sehen und
                  erfahren k&ouml;nnen. Der n&auml;chste Besuch ist im Fr&uuml;hling oder
                  Sommer schon eingeplant. Dann werde ich die sch&ouml;n gestalteten
                  Au&szlig;enanlagen aufsuchen und davon berichten.</P>

                  <P>Mathias Klingner<BR>
                  E-Mail: Tschandru.Shing@Berlin.de</P>
                  <BR>
                  <A href="mm_mmx.html"><FONT size="+1"><B>zur&uuml;ck</B></FONT></A> 
                </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

