<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
    <META name="Author" content="Wolfgang Haas">

    <TITLE>BW-SEX</TITLE>
  </HEAD>

  <BODY bgcolor="#fffff0">
    Home | Themen | Recht | Bundeswehr | F&uuml;hrungshilfe der
    Bundeswehr: Sexualit&auml;t 

    <H2>Bundesministerium der Verteidigung</H2>
    Generalinspekteur der Bundeswehr <BR>
    F&uuml; S l 4 - Az 35-04-09 <BR>
    Berlin, 20. Dezember 2000 

    <P>Ich erlasse die F&uuml;hrungshilfe f&uuml;r Vorgesetzte<BR>
    <B>Umgang mit Sexualit&auml;t</B><BR>
    Harald Kujat<BR>
    General</P>

    <H3><B>Vorbemerkung</B></H3>

    <P>Vor dem Hintergrund der weiteren &Ouml;ffnung der
    Streitkr&auml;fte f&uuml;r Frauen, der &Auml;nderung der
    bisherigen Haltung der Bundeswehr gegen&uuml;ber Soldatinnen
    und Soldaten mit gleichgeschlechtlicher Orientierung und den
    Problemen der Soldatinnen und Soldaten im Einsatz mit dem Thema
    "Umgang mit Sexualit&auml;t" soll diese F&uuml;hrungshilfe zum
    Abbau von Verhaltensunsicherheiten beitragen. Im folgenden Text
    werden die Begriffe "Soldat", "Vorgesetzter" und "Untergebener"
    funktionsbezogen verwendet und sind geschlechtsneutral zu
    verstehen. Grunds&auml;tzlich sind M&auml;nner und Frauen in
    gleicher Weise angesprochen, da in der Zukunft immer mehr
    Frauen Vorgesetzte sein werden.</P>

    <H3><B>Umgang mit Sexualit&auml;t</B></H3>

    <P><B>(1) Einf&uuml;hrung</B></P>
    F&uuml;r die Streitkr&auml;fte gelten die folgenden
    Rechtsgrunds&auml;tze. 

    <OL>
      <LI>Der Intim- und Sexualbereich des Menschen steht als Teil
      seiner Privatsph&auml;re unter dem verfassungsrechtlichen
      Schutz des Art. 2 Abs. 1 in Verbindung mit Art. 1 Abs. 1
      Grundgesetz (GG)<BR>
       - Jeder Mensch hat das Recht auf sexuelle
      Selbstbestimmung<BR>
      - Auch nach Art. 8 der Europ&auml;ischen Konvention zum
      Schutz der Menschenrechte und Grundfreiheiten (EMRK) ist die
      Privatsph&auml;re ausdr&uuml;cklich gesch&uuml;tzt</LI>

      <LI>Art. 3 Abs. 1 GG3 sch&uuml;tzt vor Ungleichbehandlungen
      wegen sexueller Orientierungen. Durch Art. 14 EMRK4 ist das
      Diskriminierungsverbot im europ&auml;ischen Recht verankert
      und f&uuml;r die Bundesrepublik Deutschland bindendes
      Recht.</LI>

      <LI>Inhalt und Grenzen der Sexualit&auml;t ergeben sich aus
      dem allgemeinen Pers&ouml;nlichkeitsrecht. Der Schutz der
      sexuellen Selbstbestimmung wird dadurch gew&auml;hrleistet,
      dass Verhaltensweisen, die die sexuelle Selbstbestimmung
      verletzen, unter Strafe gestellt sind.</LI>

      <LI>An das Verhalten von Soldatinnen und Soldaten sind im
      Umgang mit Sexualit&auml;t besondere Ma&szlig;stabe
      anzulegen. Diese ergeben sich besonders aus der Pflicht zur
      Kameradschaft (&sect; 12 Soldatengesetz - SG)5, aus der
      allgemeinen Verhaltenspflicht als Soldat (&sect; 17 SG)6 und
      aus der Pflicht der Vorgesetzten zu beispielhaftem Verhalten
      (&sect; 10 SG)7. Aus diesen Grunds&auml;tzen erg&auml;ben
      sich die folgenden Regeln, deren Kern vor allem Toleranz und
      gegenseitiger Respekt bilden.</LI>
    </OL>

    <P><B>(2) Allgemeine Verhaltensregeln</B></P>
    Sexualit&auml;t ist grunds&auml;tzlich Privatangelegenheit, die
    eigene wie die fremde Sexualit&auml;t haben jedoch Einfluss auf
    das Zusammenleben der Menschen in den unterschiedlichen
    Lebensbereichen, auch im beruflichen bzw. dienstlichen Umfeld.
    Aus dem Pflichtenkatalog des Soldatengesetzes sind deshalb
    besondere Forderungen an den Soldaten abzuleiten: 

    <UL>
      <LI><B>(a) Zur&uuml;ckhaltung</B><BR>
      Auf Grund unterschiedlicher Einstellungen zur Sexualit&auml;t
      kann es zu Irritationen und negativen Reaktionen in einer
      Gruppe kommen. Deshalb ist auf die Gef&uuml;hle und
      &Uuml;berzeugungen anderer R&uuml;cksicht zu nehmen. Ein
      sensibler Umgang sowohl mit der eigenen wie mit der
      Sexualit&auml;t anderer ist ein Gebot der Kameradschaft.
      &Uuml;berzogene Thematisierung sexueller Erfahrungen und
      Partnerschaften, provozierendes Verhalten sowie das
      "Ausleben" von Sexualit&auml;t jeglicher Orientierung sind
      daher innerhalb der milit&auml;rischen Liegenschaft zu
      unterlassen. Auch au&szlig;er Dienst und au&szlig;erhalb
      dienstlicher Unterk&uuml;nfte und Anlagen hat sich der Soldat
      so zu verhalten, dass er das Ansehen der Bundeswehr nicht
      ernstlich beeintr&auml;chtigt.</LI>

      <LI>
        <B>(b) Verbot sexueller Bel&auml;stigung</B><BR>
        Im Dienst wie au&szlig;erhalb des Dienstes ist die sexuelle
        Integrit&auml;t einer Person zu achten und zu wahren. Das
        Besch&auml;ftigtenschutzgesetz (VMB1 1995 S 272) gilt
        uneingeschr&auml;nkt auch f&uuml;r den milit&auml;rischen
        Bereich. Ebenso findet das Recht zur Beschwerde nach der
        WBO uneingeschr&auml;nkt Anwendung. Ein schuldhafter
        Versto&szlig; stellt zugleich ein Dienstvergehen nach
        &sect; 23 Abs l SG dar 8. Sexuelle Bel&auml;stigung am
        Arbeitsplatz ist danach jedes vors&auml;tzliche, sexuell
        bestimmte Verhalten, das die W&uuml;rde von
        Besch&auml;ftigten am Arbeitsplatz verletzt. Die
        milit&auml;rische Gemeinschaftsunterkunft gilt im Sinne
        dieses Gesetzes in und au&szlig;er Dienst ah Arbeitsplatz.
        &Uuml;ber sexuelle Handlungen und Verhaltensweisen, die
        unter Strafe gestellt sind, hinaus umfasst sexuelle
        Bel&auml;stigung auch 

        <UL>
          <LI>Aufforderungen zu sexuellen Handlungen und
          Verhaltensweisen, die nach strafgesetzlichen Vorschriften
          unter Strafe gestellt sind,</LI>

          <LI>sexuell bestimmte k&ouml;rperliche
          Ber&uuml;hrungen,</LI>

          <LI>Bemerkungen sexuellen Inhalts,</LI>

          <LI>Zeigen und sichtbares Anbringen pornographischer
          Darstellungen, die von den Betroffenen erkennbar
          abgelehnt werden</LI>

          <LI style="list-style: none"><BR>
          </LI>
        </UL>
      </LI>

      <LI><B>(c) Wahrung des Zusammenhalts</B><BR>
      Ein vorurteilsfreier Umgang mit nicht strafbewehrten
      sexuellen Orientierungen verhindert, dass es zu
      Ger&uuml;chten, &uuml;bler Nachrede oder zu Mobbing-Verhalten
      kommt und dadurch die Rechte Einzelner verletzt und der
      Zusammenhalt in einer milit&auml;rischen Gruppe gest&ouml;rt
      werden Der Soldat darf den kameradschaftlichen Zusammenhalt
      nicht durch Neid, Eifersucht oder demonstrative Ablehnung
      einer bestimmten sexuellen Orientierung st&ouml;ren. Einem
      derartigen Verhalten und einer Ausgrenzung Einzelner ist im
      Kameradenkreis energisch entgegenzuwirken.</LI>

      <LI><B>(d) Respektieren von Partnerschaften</B><BR>
      Bestehende Partnerschaften sind stets zu achten. Der Respekt
      gegen&uuml;ber Partnerschaften - auch &uuml;ber den
      unmittelbaren Dienstalltag hinaus - ist wesentliche Grundlage
      f&uuml;r das Vertrauen der Soldaten untereinander. Ihm kommt
      daher eine wesentliche Rolle f&uuml;r den Zusammenhalt
      zu.</LI>

      <LI><B>(e) Achtung der Privatsph&auml;re</B><BR>
      Das enge Zusammenleben in der milit&auml;rischen Gemeinschaft
      zwingt zu besonderer R&uuml;cksichtnahme. Die
      Privatsph&auml;re ist auch und gerade im milit&auml;rischen
      Bereich zu respektieren und zu gew&auml;hrleisten Deshalb
      verbietet sich sowohl die Blo&szlig;stellung des Anderen wie
      auch eine Verletzung seiner Intimsph&auml;re.</LI>

      <LI><B>(f) Toleranz</B><BR>
      Die Verpflichtung zur Kameradschaft gebietet Toleranz
      gegen&uuml;ber anderen nicht strafbewehrten sexuellen
      Orientierungen, dementsprechend auch f&uuml;r
      gleichgeschlechtlich veranlagte Soldatinnen und Soldaten. Die
      eigenen Lebensentw&uuml;rfe d&uuml;rfen nicht zum
      Ma&szlig;stab f&uuml;r andere gemacht werden. Unabh&auml;ngig
      davon, welche moralische Einstellung der Einzelne hat, muss
      von ihm die Toleranz erwartet werden, Kameraden ein anderes
      als das eigene Sexualverhalten zuzugestehen, solange dadurch
      Ausbildung und Einsatz nicht gef&auml;hrdet werden.</LI>
    </UL>

    <P><B>(3) Pflichten und Aufgaben von Vorgesetzten</B></P>
    Bei allem Bem&uuml;hen, den dienstlichen Bereich von Problemen
    frei zu halten, die sich aus pers&ouml;nlichen Beziehungen oder
    sexuell orientiertem Verhalten ergeben, darf der Vorgesetzte
    sexuelle Beziehungen in seinem unterstellten Bereich nicht
    grunds&auml;tzlich negativ bewerten. Sexualit&auml;t ist ein
    wesentlicher Teil menschlicher Gesamtpers&ouml;nlichkeit.
    Sofern sich daraus keine St&ouml;rung des Dienstbetriebes
    ergibt, unterliegt Sexualit&auml;t daher nicht der Bewertung
    durch den Vorgesetzten. Im Umgang mit Sexualit&auml;t
    tr&auml;gt der Vorgesetzte jedoch eine besondere Verantwortung.
    

    <UL>
      <LI><B>(a) Beispielhaftes Verhalten</B><BR>
       Auch Vorgesetzte sind nicht immun gegen&uuml;ber sexuellen
      Reizen. Damit steht der Vorgesetzte im nat&uuml;rlichen
      Spannungsfeld zwischen dienstlichen Erfordernissen einerseits
      und seinen Bed&uuml;rfnissen andererseits wie jeder seiner
      Soldaten. Es gilt nicht nur, dieses Spannungsverh&auml;ltnis
      im Sinne seines Auftrages und seiner Rolle als Vorgesetzter
      zu bew&auml;ltigen, sondern auch immer wieder sein Verhalten
      und seine Entscheidungen dahingehend zu pr&uuml;fen, ob sie
      durch Zu- oder Abneigung gegen&uuml;ber anderen Soldaten
      (mit-) bestimmt sind. Sensibilit&auml;t gegen&uuml;ber der
      eigenen Sexualit&auml;t und Toleranz gegen&uuml;ber der
      Sexualit&auml;t anderer, soweit sich diese nicht als
      St&ouml;rfaktor im dienstlichen Bereich darstellt, sind daher
      wesentliche Voraussetzungen daf&uuml;r, der Aufgabe als
      Vorgesetzter gerecht zu werden und glaubw&uuml;rdig ein den
      Bedingungen des milit&auml;rischen Dienstes angemessenes
      Verhalten von anderen zu fordern. Dass der Vorgesetzte auf
      keinen Fall seine dienstliche Stellung gegen&uuml;ber
      Untergebenen missbrauchen darf, ist selbstverst&auml;ndlich.
      Er muss jedoch damit rechnen, dass Untergebene versuchen
      k&ouml;nnten, sich durch gezielte Ann&auml;herung
      pers&ouml;nliche Vorteile zu verschaffen oder von
      Au&szlig;enstehenden eine Beziehung so eingesch&auml;tzt
      wird. Pers&ouml;nliche Beziehungen &uuml;ber Hierarchieebenen
      hinweg sind deshalb in der Regel immer Ausl&ouml;ser
      vielf&auml;ltiger Probleme. Sofern sich eine solche Beziehung
      abzeichnet, muss der Vorgesetzte von sich aus eine
      dienstliche Trennung herbeif&uuml;hren, um eine
      Beeintr&auml;chtigung seiner Achtungs- und
      Vertrauensw&uuml;rdigkeit zu vermeiden. Entsprechender
      Handlungsbedarf ist ebenso gegeben, wenn der Vorgesetzte in
      seinem unterstellten Bereich eine solche
      hierarchie&uuml;bergreifende Beziehung feststellt. Soweit in
      der Folge oder im Zusammenhang mit der Anbahnung einer
      sexuellen Beziehung
      Unregelm&auml;&szlig;igkeiten/St&ouml;rungen im Dienstbetrieb
      - etwa durch ungerechtfertigte Bevorzugung/Benachteiligung -
      auftreten, sind diese unverz&uuml;glich zu unterbinden</LI>

      <LI><B>(b) Vorbeugung</B><BR>
       Eine wichtige Aufgabe des Vorgesetzten ist es, den Einfluss
      sexuell bestimmten Verhaltens auf den Zusammenhalt und das
      innere Gef&uuml;ge zu erl&auml;utern und die Notwendigkeit
      der Beachtung allgemeiner Verhaltensregeln f&uuml;r das
      Zusammenleben in der milit&auml;rischen Gemeinschaft zu
      verdeutlichen. Der Vorgesetzte muss sensibel f&uuml;r sexuell
      motivierte Spannungen und St&ouml;rungen des Zusammenhalts im
      unterstellten Bereich sein und fr&uuml;hzeitig, z.B. durch
      Herbeif &uuml;hren eines Gespr&auml;chs mit den Beteiligten,
      den Abbau derartiger Spannungen einleiten. Dabei darf er
      nicht grunds&auml;tzlich davon ausgehen, dass
      partnerschaftliche Beziehungen bzw. die betroffenen Partner
      die Ausl&ouml;ser dieser Spannungen sind. Vielmehr ist der
      Einzelfall genau zu pr&uuml;fen. Die Betroffenen und ihre
      Beziehung sind ggf. vor Neid, Missgunst und &uuml;bler
      Nachrede zu sch&uuml;tzen. Dar&uuml;ber hinaus gilt es
      insbesondere, Toleranz gegen&uuml;ber einer anderen
      geschlechtlichen Orientierung einzufordern. Der Vorgesetzte
      muss dabei beachten, dass es z.B. gegen&uuml;ber der
      Homosexualit&auml;t in der Gesellschaft zum Teil noch
      tiefsitzende Vorurteile gibt, die bis zu einer fundamentalen
      Ablehnung reichen. Es gilt daher ein Bewusstsein daf&uuml;r
      zu schaffen, dass sich die Qualit&auml;t der
      milit&auml;rischen Aufgabenerf&uuml;llung nicht an der
      sexuellen Orientierung eines Soldaten misst und Rechte und
      Pflichten nach dem Soldatengesetz sowie die Grunds&auml;tze
      der Inneren F&uuml;hrung f&uuml;r heterosexuelle und
      homosexuelle Soldaten in gleicher Weise gelten.</LI>

      <LI>
        <B>(c) Durchsetzen</B><BR>
         Dort, wo die Erziehung zur Toleranz im Einzelteil wegen
        besonders tiefgehender Ablehnung an ihre Grenzen
        st&ouml;&szlig;t, ist der Vorgesetzte aufgefordert, die
        Situation im Sinne der Einsatzbereitschaft, z.B. durch
        Ver&auml;nderungen der Personalzusammensetzung, zu
        l&ouml;sen. Dies soll m&ouml;glichst einvernehmlich und
        ohne Schuldzuweisungen erfolgen. Die Beteiligungsrechte
        sind zu beachten. Verschwiegenheit &uuml;ber Ursachen und
        Hintergr&uuml;nde sind selbstverst&auml;ndlich Ebenso, wie
        der Vorgesetzte jeder Diskriminierung energisch
        entgegentreten muss, hat er die Verhaltensregeln
        durchzusetzen und daf&uuml;r zu sorgen, dass eine Kultur
        der Zur&uuml;ckhaltung im Hinblick auf sexuell orientiertes
        Verhalten im dienstlichen Bereich zur Normalit&auml;t wird.
        Jedes Verhalten, das den Zusammenhalt st&ouml;rt, die
        Regeln der Kameradschaft verletzt und den Einzelnen ins
        Abseits stellt, ist bereits im Ansatz zu unterbinden Dies
        gilt insbesondere im Hinblick auf sexuelle
        Bel&auml;stigungen oder &Uuml;bergriffe. Durch Bekanntgabe
        der Verhaltensregeln f&uuml;r das Zusammenleben und
        -arbeiten im dienstlichen Bereich kann der Vorgesetzte hier
        zus&auml;tzlich Vorbeugung leisten. Um die
        Verhaltenssicherheit der Vorgesetzten im Umgang mit
        Dienstvergehen im Zusammenhang mit sexuell bestimmtem
        Verhalten und sexuellen Beziehungen unter Soldaten zu
        erh&ouml;hen, wird in den Anlagenteil zur
        Wehrdisziplinarordnung (ZDv 14/3) eine Darstellung der
        disziplinarrechtlichen, dienstrechtlichen und
        strafrechtlichen Relevanz beispielhaft&laquo; Fallgruppen
        aufgenommen. 

        <OL>
          <LI>Art. 1 Abs. 1 GG: Die W&uuml;rde des Menschen ist
          unantastbar. Sie zu achten und zu sch&uuml;tzen ist
          Verpflichtung aller staatlichen Gewalt. Art 2 Abs. 1 GG:
          Jeder hat das Recht auf die freie Entfaltung seiner
          Pers&ouml;nlichkeit, soweit er nicht die Rechte anderer
          verletzt und nicht gegen die verfassungsm&auml;&szlig;ige
          Ordnung oder das Sittengesetz verst&ouml;&szlig;t.</LI>

          <LI>Art. 8 EMRK: (1) Jede Person hat das Recht auf
          Achtung ihres Privat- und Familienlebens, ihrer Wohnung
          und Ihrer Korrespondenz.<BR>
          (2)Eine Beh&ouml;rde darf in die Aus&uuml;bung dieses
          Rechtes nur eingreifen, soweit der Eingriff gesetzlich
          vorgesehen und in einer demokratischen Gesellschaft
          notwendig ist f&uuml;r die nationale oder
          &ouml;ffentliche Sicherheit, ... zur Aufrechterhaltung
          der Ordnung, zur Verh&uuml;tung von Straftaten, zum
          Schutz ... der Moral oder zum Schutz der Rechte und
          Freiheiten anderer.</LI>

          <LI>Art. 3 Abs. 1 GG: Alle Menschen sind vor dem Gesetz
          gleich.</LI>

          <LI>Art. 14 EMRK: Der Genuss der in dieser Konvention
          anerkannten Rechte und Freiheiten ist ohne
          Diskriminierung insbesondere wegen des Geschlechts, der
          Rasse, der Hautfarbe, der Sprache, der Religion, der
          politischen oder sonstigen Anschauung, der nationalen,
          oder sozialen Herkunft, der Zugeh&ouml;rigkeit zu einer
          nationalen Minderheit, des Verm&ouml;gens, der Geburt
          oder eines sonstigen Status zu gew&auml;hrleisten.</LI>

          <LI>&sect; 12 SG: Der Zusammenhalt der Bundeswehr beruht
          wesentlich auf Kameradschaft. Sie verpflichtet alle
          Soldaten, die W&uuml;rde, die Ehre und die Rechte des
          Kameraden zu achten ... Das schlie&szlig;t gegenseitige
          Anerkennung, R&uuml;cksicht und Achtung fremder
          Anschauungen ein.</LI>

          <LI>&sect; 17 SG:<BR>
          (1) Der Soldat hat Disziplin zu wahren und die
          dienstliche Stellung des Vorgesetzten in seiner Person
          auch au&szlig;erhalb des Dienstes zu achten.<BR>
           (2) Sein Verhalten muss dem Ansehen der Bundeswehr sowie
          der Achtung und dem Vertrauen gerecht werden, die sein
          Dienst als Soldat erfordert.<BR>
           (3) ...<BR>
           (4) Der Soldat hat alles in seinen Kr&auml;ften Stehende
          zu tun, um seine Gesundheit zu erhalten oder wieder
          herzustellen. Er darf seine Gesundheit nicht
          vors&auml;tzlich oder grob fahrl&auml;ssig
          beeintr&auml;chtigen.</LI>

          <LI>&sect; 10 SG:<BR>
          (1) Der Vorgesetzte soll in seiner Haltung und
          Pflichterf&uuml;llung ein Beispiel geben.<BR>
           (2) Er hat die Pflicht zur Dienstaufsicht und ist
          f&uuml;r die Disziplin seiner Untergebenen
          verantwortlich.<BR>
           (3) Er hat f&uuml;r seine Untergebenen zu sorgen.<BR>
           (4) Er darf Befehle nur zu dienstlichen Zwecken und nur
          unter Beachtung der Regel des V&ouml;lkerrechts, der
          Gesetze und der Dienstvorschriften erteilen.<BR>
           (5) Er tr&auml;gt f&uuml;r seine Befehle die
          Verantwortung. Befehle hat er in der den Umst&auml;nden
          angemessenen Weise durchzusetzen.<BR>
           (6) Offizier und Unteroffiziere haben innerhalb und
          au&szlig;erhalb des Dienstes bei ihren
          &Auml;u&szlig;erungen die Zur&uuml;ckhaltung zu wahren,
          die erforderlich ist, um das Vertrauen als Vorgesetzte zu
          erhalten.</LI>

          <LI>Der Soldat begeht ein Dienstvergehen, wenn er
          schuldhaft seine Pflichten verletzt.<BR>
          </LI>
        </OL>
      </LI>
    </UL>
    <HR>
    Eingesandt: Wolfgang Haas <BR>
  </BODY>
</HTML>

