<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>L&ouml;sung f&uuml;r Dragonflight</TITLE>
  </HEAD>

  <BODY background="images/bg2.jpg">
    <TABLE width="100%" cellpadding="10">
      <TR align="CENTER">
        <TD>
          <H2><FONT face="" color="#008000">Komplettl&ouml;sung
          f&uuml;r Dragonflight</FONT></H2>
        </TD>
      </TR>

      <TR>
        <TD>
          <P title="" align="JUSTIFY">Hallo Leute,<BR>
          <BR>
          heute habe ich eine Komplettl&ouml;sung zu dem
          Rollenspiel Dragonflight von Thalion f&uuml;r euch.<BR>
          <BR>
          Hier erstmal einige hilfreiche Tips zum Spiel:<BR>
          <BR>
          </P>

          <TABLE border="1" cellspacing="0" cellpadding="5" align=
          "RIGHT" bordercolor="#FF0000">
            <TR>
              <TD colspan="2" align="CENTER"><B>Fundorte Der
              Landkartenteile in den Dungeons</B></TD>
            </TR>

            <TR>
              <TD>Stockwerk 8</TD>

              <TD>bei Port Pylon</TD>
            </TR>

            <TR>
              <TD>Stockwerk 10</TD>

              <TD>bei Port Pylon</TD>
            </TR>

            <TR>
              <TD>Stockwerk 2</TD>

              <TD>&ouml;stlich von Pegana</TD>
            </TR>

            <TR>
              <TD>Stockwerk 3</TD>

              <TD>&ouml;stlich von Pegana</TD>
            </TR>

            <TR>
              <TD>Stockwerk 3</TD>

              <TD>westlich von Pegana</TD>
            </TR>

            <TR>
              <TD>Stockwerk 5</TD>

              <TD>westlich von Pegana</TD>
            </TR>

            <TR>
              <TD>Stockwerk 9</TD>

              <TD>an der Westk&uuml;ste des Hauptkontinents</TD>
            </TR>

            <TR>
              <TD>Stockwerk 10</TD>

              <TD>an der Westk&uuml;ste des Hauptkontinents</TD>
            </TR>
          </TABLE>
          Wenn man alle Teile der magischen Landkarte besitzt,
          erkennt man den Hauptkontinent in Form eines Drachens.
          Deshalb beziehen sich die Ortsangaben im Spiel auf einen
          Drachen. In der Stadt Drombul erh&auml;lt man gegen einen
          Heiltrank ein Kartenteil bei Hausnummer 5. In der Stadt
          Scatterbone erh&auml;lt man gegen 2000 Geldst&uuml;cke
          zwei Kartenteile bei Hausnummer 21. Im Haus dem Mann die
          Kartte zeigen. F&uuml;r die Eisw&uuml;ste sollte man im
          Gemischtwarenladen M&auml;ntel besorgen und unbedingt
          anziehen. ABOLDYK und KOLBRALON sind nur mit dem Schiff
          erreichbar. Im ersten Stockwerk im Dungeon an der
          Westk&uuml;ste ben&ouml;tigt man das Passwort DRACHEN. Im
          f&uuml;nften Stockwerk probiert man ALARKAZAM. F&uuml;r
          den W&uuml;stendungeon empfiehlt sich im neunten
          Stockwerk ELTAM.<BR>
          <BR>
          <BR>
          <BR>
          Und hier die L&ouml;sung:<BR>

          <TABLE border="1" cellspacing="0" cellpadding="5" align=
          "RIGHT" bordercolor="#FF0000">
            <TR>
              <TD colspan="2" align="CENTER"><B>Passw. zum
              &Ouml;ffnen der Dungeons mit R&auml;tselmund</B></TD>
            </TR>

            <TR>
              <TD>ELDOLON</TD>

              <TD>In der W&uuml;ste des Hauptkontinents</TD>
            </TR>

            <TR>
              <TD>MASTYK</TD>

              <TD>Auf der Insel Dorithannon im Norden</TD>
            </TR>

            <TR>
              <TD>MORTYK</TD>

              <TD>Auf der Insel Dorithannon im S&uuml;den</TD>
            </TR>

            <TR>
              <TD>ABOLTYK</TD>

              <TD>Auf der Insel zwischen den Klauen</TD>
            </TR>

            <TR>
              <TD>KOLBRALON</TD>

              <TD>Auf der Insel mit der Eisw&uuml;ste</TD>
            </TR>
          </TABLE>
          <BR>
          <BR>
           

          <P title="" align="JUSTIFY">Im Ork-Dorf sollte man sich
          zuerst den Friedensvertrag holen und in Brindil-Bun, Port
          Pylon sowie in Nimraviel unterschreiben lassen. Auch den
          Brief an Gredak sollte man in Luthag (ganz im Nordwesten
          des Hauptkontinents) von Sonok abholen. Im Dungeon beim
          Ork-Dorf befindet sich im neunten Stockwerk ein Trank
          gegen den Qu&auml;lgeist von Scatterbone (Passwort:
          FLASCHE ROSINENLIK&Ouml;R). Die Wachen macht man mit dem
          Branntwein betrunken, dann verlassen sie torkelnd ihre
          Stellung. Das magische Wurfbeil gibt es gegen einen
          Diamanten im Palast der Stadt Brindil-Bun, die man
          &uuml;ber die geheime Passage n&ouml;rdlich von Pegana
          mit dem Passwort ZOFINUR erreichen kann. In Brindil-Bun
          erh&auml;lt man bei Hausnummer 30 gegen drei
          Heiltr&auml;nke ein Eltam-Teil. In Bagnol auf Dorithannon
          bekommt man bei Hausnummer 21 gegen einen Heiltrank zwei
          Diamanten. Nicht vergessen den in Luthag abgeholten Brief
          bei Hausnummer 7 abzugeben. Im Palast tauscht man vier
          Diamanten gegen eine Kristallklinge und zwei magische
          Kettenhemden ein.<BR>
          <BR>
          </P>

          <TABLE border="1" cellspacing="0" cellpadding="5" align=
          "RIGHT" bordercolor="#FF0000">
            <TR>
              <TD colspan="2" align="CENTER"><B>Die Namen der
              Tempel</B></TD>
            </TR>

            <TR>
              <TD>CLEARLIGHT</TD>

              <TD>westlich von Nimraviel</TD>
            </TR>

            <TR>
              <TD>GEMSHINE</TD>

              <TD>&ouml;stlich von Pegana</TD>
            </TR>

            <TR>
              <TD>STORMWIND</TD>

              <TD>s&uuml;dlich von Luthag</TD>
            </TR>

            <TR>
              <TD>DARKMOON</TD>

              <TD>in der N&auml;he des versteckten Dungeons</TD>
            </TR>

            <TR>
              <TD>FAROUT</TD>

              <TD>auf einer Binneninsel</TD>
            </TR>

            <TR>
              <TD>DEEPSEA</TD>

              <TD>auf der Insel mit dem Drachental</TD>
            </TR>

            <TR>
              <TD>THUNDERROAR</TD>

              <TD>auf der Insel Dorithannon</TD>
            </TR>
          </TABLE>
          <BR>
          <BR>
           

          <P title="" align="JUSTIFY">Im Palast von Nimraviel
          erh&auml;lt man den Auftrag die sogenannte Ratssh&auml;re
          zu suchen. Diese befindet sich in einem versteckten
          Dungeon des Schattens "in den Bergen an des Halses
          Kr&uuml;mmung". Man findet ihn durch anklicken des
          "Untersuchen"-Icons am n&ouml;rdlichen Ende der
          Bergkette. Zwei weitere Fl&uuml;sse liegen in
          unmittelbarer N&auml;he. Wenn man dann in Nimraviel die
          Sph&auml;re abliefert, gibt es daf&uuml;r ein Eltamteil
          und einen Elbenbogen. Das dritte Eltamteil besorgt man
          sich durch Befreien des Qu&auml;lgeistes. Das vierte
          Eltamteil ist im neunten Stockwerk des Dungeons in der
          W&uuml;ste versteckt. Nun ist das Eltam komplett und
          einsatzbereit. Es gibt drei Eltamkombinationen mit
          unterschiedlicher Wirkung (siehe Kasten). Drachenringe
          sind der einzige Schutz gegen die Kristallw&auml;chter.
          Man findet sie im Dorithannon S&uuml;d im zw&ouml;lften
          Stockwerk, dem Dungeon in der Eisw&uuml;ste im elften
          Stock und im versteckten Dungeon im achten Stockwerk. In
          Port Pylon s ollte man ein Schiff kaufen und aus dem
          zweiten Dungeon des Schattens den Steinstab holen, der
          eine wirksame Waffe gegen die hier auftauchenden
          Kristallw&auml;chter und Statuen ist. Der Dungeon
          befindet sich auf einer Insel "am Ende des Schweifes",
          also auf einer der Inseln, die den Schwanz des Drachen
          bilden. Wenn man schon mal in der Gegend ist, sollte man
          noch das P&auml;ckchen von Gredak in Luthag bei Sonok
          abliefern. Ausserdem geh&ouml;rt der unterzeichnete
          Vertrag zum Ork-H&auml;uptling.<BR>
          <BR>
          </P>

          <TABLE border="1" cellspacing="0" cellpadding="5" align=
          "RIGHT" bordercolor="#FF0000">
            <TR>
              <TD colspan="2" align="CENTER"><B>M&ouml;gliche
              Eltamkombinationen</B></TD>
            </TR>

            <TR>
              <TD>Einsatz einer Waffe</TD>

              <TD>ADBC</TD>
            </TR>

            <TR>
              <TD>&Ouml;ffnen verschlossener T&uuml;ren</TD>

              <TD>BCDA</TD>
            </TR>

            <TR>
              <TD>Auffrischen der Hitpoints</TD>

              <TD>CABD</TD>
            </TR>

            <TR>
              <TD colspan="2">A = Eltamteil mit zwei paralellen
              senkrechten Strichen<BR>
              B = Eltamteil mit zwei waagerechten Strichen<BR>
              C = Eltamteil mit Dreieck auf dem Kopf<BR>
              D = Eltamteil mit normalem Dreieck</TD>
            </TR>
          </TABLE>
          Im Dungeon auf der Insel "zwischen den Klauen" beim
          Hauptkontinent wartet im achten Stockwerk eine Phiole.
          Wenn man aus ihr Pilze isst, erscheint der versteckte
          Dungeon, sofern sich die Gruppe beim "Kiefer des
          Drachens" ganz im S&uuml;dwesten des Drachenkopfs
          befindet. Im 14. Stockwerk des versteckten Dungeons
          findet man den Splitter, der den Kristall zerst&ouml;rt
          und damit das verzauberte Einhorn befreit. Dadurch
          &ouml;ffnet sich der Zugang zum Drachental, in dessen
          N&auml;he sich auch eine magisch verschlossene T&uuml;r
          befindet. Diese T&uuml;r bekommt man ohne Hilfsmittel
          allerdings nicht auf. Deshalb muss man sich im Dungeon in
          der Eisw&uuml;ste im 13. Stockwerk Netaldurs Zettel
          besorgen. Mit diesem Zettel geht es nach Trolian. Diese
          Stadt befindet sich auf einer in etwa der Mitte der
          Weltkarte gelegenen Insel. Hier trohnt im Wassergarten
          der Magier Netaldur. Zu seinem Haus erh&auml;lt man
          allerdings nur dann Zutritt, wenn man gen&uuml;gend
          Charakterpunkte gesammelt hat. Die Grup pe sollte
          zusammen so um die 3000 Punkte haben. Charakterpunkte
          erh&auml;lt man durch das L&ouml;sen von Aufgaben, sowie
          durch das Abliefern von Schriftrollen in der magischen
          Fakult&auml;t in Pegana. Auch Geldspenden an Bettler
          lohnen sich. Hat man nun Zugang zu Netaldurs Haus,
          erh&auml;lt man gegen den Zettel aus der Eisw&uuml;ste
          das Buch der Weisheit. Jetzt stehen den Charakteren
          schwarze und weisse Zauberspr&uuml;che auch direkt
          nacheinander zur Verf&uuml;gung. Ausserdem schenkt einem
          der Magier einen Zauber zum &Ouml;ffnen der magischen
          T&uuml;r im Drachental, hinter der sich eine riesige
          Halle befindet. In dieser Halle spricht man nacheinander
          die Zauberformeln "Heiltrance", "Namenloser Spruch",
          "Furcht" und "Blitz". Die Drachen fliegen
          &uuml;bergl&uuml;cklich in die langersehnte Freiheit.<BR>
          <BR>
          Original von Markus Idler f&uuml;r das Magazin TOS<BR>
          <BR>
           
        </TD>
      </TR>
    </TABLE>

    <TABLE border="5" cellspacing="1" cellpadding="5" align=
    "CENTER">
      <TR>
        <TD>Rainer Wrieden</TD>

        <TD>E-Mail: <A href=
        "mailto:spezis@terra.es">spezis@terra.es</A></TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

