<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">
<HTML>
<HEAD>
<META NAME="AUTHOR" CONTENT="M.Puch">
<TITLE>Sags der Mutter, sags dem Kinde, sags dem Bruder und dem Rinde.</TITLE>
<BASEFONT SIZE="3">
</HEAD>
<BODY BACKGROUND="gfx/back2.jpg">
<H2 align="CENTER">Verbreitung</H2>
<HR noshade color="000000">
</P>
Da <A HREF="credit.html">wir</A> mit der Zusammenstellung dieser Liste das Ziel verfolgen, m&ouml;glichst jedem interessierten Amigabenutzer eine soweit wie m&ouml;glich vollst&auml;ndige &Uuml;bersicht &uuml;ber alle Amiga Hard- und Softwareh&auml;ndler im deutschsprachigen Raum in die Hand zu geben, ist die Weitergabe dieser Liste nicht nur erlaubt, sondern geradezu ausdr&uuml;cklich gew&uuml;nscht und erbeten.</P>
Nur wenn jeder Leser dieser Liste die Liste an alle Personen weitergibt, die seiner Meinung nach Verwendung daf&uuml;r haben k&ouml;nnten, hat diese Liste wirklich einen Sinn.<BR> 
Dabei ist es nat&uuml;rlich v&ouml;llig egal, ob es sich nun um den amigabegeisterten Nachbarn ohne Netzzugang handelt oder um den Arbeitskollegen, der noch einen alten Amiga zu Hause hat aber keine Software daf&uuml;r auftreiben kann, oder auch um den Studienkollegen, der UAE auf seinem PC nutzt und nach legalen Bezugsquellen f&uuml;r die klassischen Spiele von aus der "guten alten Zeit" sucht.</p>
Insbesondere wird darum gebeten, diese Liste in lokale und regionale Mailboxen upzuloaden, um Usern, die (aus welchen Gr&uuml;nden auch immer) keinen direkten Zugriff auf das Aminet haben, die M&ouml;glichkeit zu geben, diese Liste in die Finger zu bekommen.</P>
Kurz gesagt: <strong> Spread the word <u>and</u> the disk</strong>.<br>
Mit einer kleinen Einschr&auml;nkung, wohlgemerkt: Bitte nehmen Sie keinerlei &Auml;nderungen an dieser Liste vor, bevor Sie sie weitergeben. Wenn Sie der Meinung sind, da&szlig; diese Liste hier und dort einige &Auml;nderungen oder Verbesserungen n&ouml;tig h&auml;tte, teilen Sie dies bitte den <A HREF="credit.html">Autoren</A> mit. Dadurch kann die Liste auf den neuesten Stand gebracht werden und die &Auml;nderungen kommen dann auch allen interessierten Usern zugute.</P>
<HR size=1 color="000000" WIDTH="80%"><BR>
<H2 align="CENTER">Bezugsquellen</H2></P>


Die Amigaguide&reg;-Version dieser Liste k&ouml;nnen Sie auch regelm&auml;&szlig;ig in dem Online-Magazin <A HREF="http://www.mediaspace.net/amigaaktuell" TARGET="_top">Amiga Aktuell</A> sowie dem AmigaGuide&reg;-Magazin <FONT COLOR="#FF99FF">Amiga News</FONT> finden.</P>


<CENTER>
Beide Magazine k&ouml;nnen Sie <EM>kostenlos</EM> per EMail-Abo beziehen:<BR>
<A HREF="mailto:aakt.gmxde?subject=Email Abo AMIGA Aktuell"><IMG SRC="gfx/gomail.gif" BORDER="0" HSPACE="4">Amiga Aktuell</A>
<A HREF="mailto:stefan1200@gmx.net?subject=Amiga News Email-Abo"><IMG SRC="gfx/gomail.gif" BORDER="0" HSPACE="4">Amiga News</A></CENTER></P>
Desweiteren wird nat&uuml;rlich stets eine aktuelle Version dieser Liste im <A HREF="http://ftp.wustl.edu/aminet/">Aminet</A> zu finden sein, und zwar unter <A HREF="ftp://ftp.wustl.edu/pub/aminet/docs/lists/AmigaShopsD.lha">docs/lists/AmigaShopsD.lha</A><BR>
Die jeweils aktuelle Version wird jeweils gegen Ende jeden Monats ver&ouml;ffentlicht werden.
<HR color="000000" noshade>

</BODY>
</HTML>