<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Neues zum AmigaNG
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>3. Hyperion ver&ouml;ffentlicht erste AmigaOS4.0-Screenshots</H2>
<P>
Der mit der Leitung der AmigaOS4.0-Entwicklung betraute Softwarehersteller
Hyperion Entertainment hat vor wenigen Wochen erste Screenshots des in
Entwicklung befindlichen PowerPC-Betriebssystems ver&ouml;ffentlicht, die sich
unter der URL <A HREF="http://www.os4.hyperion-software.com" TARGET="_top">http://www.os4.hyperion-software.com</A> abrufen lassen. Unser
Partner amiga-news.de schreibt dazu:
</P>
<P>
&raquo;Unter dem Titellink sind die ersten &ouml;ffentlichen Screenshots zur neuen GUI
von AmigaOS 4 zu sehen, die Bill McEwen mit herzlichen Gr&uuml;&szlig;en an die Amiga-
Gemeinde ver&ouml;ffentlicht. Diese Shots zeigen nur einige wenige der neuen
Features, z.B. die konfigurierbaren Slider, Menus und System-Images. Neu
ist auch die M&ouml;glichkeit, Fenster teilweise aus dem Bildschirm zu bewegen
(durch Dr&uuml;cken der Shift-Taste beim Bewegen l&auml;sst sich das unterbinden).
</P>
<P>
Nat&uuml;rlich werden alle neuen Features nach belieben mit einem Preferences-
Programm konfigurierbar sein.
</P>
<P>
Weitere Screenshots folgen in K&uuml;rze. Diese werden dann weitere
Einstellm&ouml;glichkeiten demonstrieren. Am Ende wird jeder User selbst
bestimmen k&ouml;nnen, wie &quot;sein&quot; Intuition aussieht.
</P>
<P><B>GUI: Vorl&auml;ufige Screenshots der AmigaOS 4 GUI</B></P>
<P>
Diese Screenshots sind als vorl&auml;ufig zu betrachten und sollten nicht - auf
keinen Fall - als das endg&uuml;ltige Erscheinungsbild der AmigaOS 4.0 GUI
angesehen werden. Die Arbeit schreitet immer noch voran, und es wird eine
Menge an Verbesserungen geben, einschlie&szlig;lich der M&ouml;glichkeit f&uuml;r den User,
fast alles konfigurieren zu k&ouml;nnen.
</P>
<P>
Der Gro&szlig;teil der Arbeit an Intuition der &quot;unter der Motorhaube&quot;-&Auml;nderungen
ist hier nicht zu sehen...
</P>
<P>
Was hier zu sehen ist, sind nur einige wenige Elemente, die vielleicht
(oder auch nicht) Teil des AmigaOS-&quot;Default&quot;-Looks werden. Wichtiger ist
jedoch der Grad an Konfigurierbarkeit, der hier auf diesen (zugegeben
kleinen) Beispielen zu sehen ist, die sich durch alle Stufen von Intuition
erstreckt.
</P>
<P>
In den kommenden Wochen werden wir mehr Screenshots zur Verf&uuml;gung stellen,
die weitere Verbesserungen im Standarderscheinungsbild von Intuition
zeigen, und die zus&auml;tzliche Konfigurierbarkeit demonstrieren.
</P>
<P>
Im Endeffekt sind Sie es, die entscheiden, wie AmigaOS 4.0 aussehen wird...
</P>
<P><B>Men&uuml;: Preview der AmigaOS 4 Men&uuml;s</B></P>
<P>
Dies ist kein MagicMenu, oder irgendein anderer Patch; dies ist Intuition
und seine eigenen Men&uuml;s, f&uuml;r AmigaOS 4.0 aufgearbeitet. Im Augenblick wird
immer noch daran gearbeitet, und weitere Verbesserungen werden hinzugef&uuml;gt,
einschlie&szlig;lich der M&ouml;glichkeit, die Grafiken f&uuml;r die Men&uuml;-Symbole
auszutauschen.
</P>
<P>
&Auml;hnliche Verbesserungen sind auch in anderen Bereichen der AmigaOS 4.0 GUI
zu erwarten...
</P>
<P><B>Nachtrag 25.04.2002:</B></P>
<P>
Ben Hermans von Hyperion postet auf ANN, dass das Interesse an den OS4
Bildern so gro&szlig; war, dass innerhalb von 48 Stunden deren Server von 50.000
Besuchern besucht wurde, die insgesamt 9.000.000 Pageviews, 2,2 Millionen
Dateien abgerufen und 17,67 GB Traffic verursacht haben.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
