<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Forum.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Forum
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Forum</H1>
<P>
In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot;
zusammengefasst.
</P>
<P><B>Wenn Ihr einen Beitrag habt, schreibt bitte an:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Carsten Schr&ouml;der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Helmoltstra&szlig;e 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">37081 G&ouml;ttingen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>E-Mail: <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A></B></P>
<H2>1. Die Frage des Monats - wir m&ouml;chten eure Meinung erfahren</H2>
<P>
Jeden Monat stellen wir euch in dieser Rubrik eine Amiga-bezogene Frage
oder machen eine provokante Bemerkung (die &uuml;brigens nicht unbedingt unsere
Meinung wiedergeben muss), in der Hoffnung, dass ihr euch m&ouml;glichst
zahlreich mit Kommentaren zu Wort meldet. Wir werden eure Beitr&auml;ge in der
jeweils folgenden Ausgabe ver&ouml;ffentlichen. Schickt sie an <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A>
</P>
<P><B>Die Frage des letzten Monats lautete:</B></P>
<P>
<B>&raquo;Wie stehst du zu folgender These: Ein Rechner mit AmigaOS, aber ohne 68k-
Prozessor und Customchips ist kein Amiga!&laquo;</B>
</P>
<P>
Erfreulicherweise war die Beteiligung diesmal sehr rege - hoffentlich
handelte es sich nicht nur um eine Eintagsfliege. Nahezu alle Statements
besitzen ein und denselben Tenor: Der Amiga wird nicht oder kaum durch
seinen 68k-Prozessor bzw. die Customchips definiert - vielmehr ist das
Betriebssystem das Entscheidende.
</P>
<P>
Hier sind alle Zuschriften, die uns erreicht haben (im Anschluss daran
folgen noch drei zu sp&auml;t eingegangene Stellungnahmen zur Frage des Monats
der Aprilausgabe):
</P>
<P>
<B>Bernd Gau&szlig;mann</B> urteilt so: &raquo;Das stimmt nat&uuml;rlich einerseits, wenn man auf
das klassische Amiga-Design abstellt. Andererseits hat dieses Konzept
allerdings, technisch gesehen, schon ein paar J&auml;hrchen &quot;auf dem Buckel&quot;.
Erwartet man auch auf einem Amiga-Computer Software in einer Qualit&auml;t wie
sie auf anderen Plattformen zu finden ist (z.B. aufw&auml;ndige 3D-Spiele), hat
AMIGA, Inc. mit seiner Firmenpolitik einen Weg eingeschlagen, der meiner
Meinung nach der richtige ist.
</P>
<P>
Ein nativ auf PowerPC-Basis laufendes AmigaOS und neue Hardware (Pegasos,
AmigaOne G3/G4) ist ein wichtiger Schritt in eine m&ouml;gliche Zukunft und
bietet zudem Leistungsreserven f&uuml;r modernere Software. Hinzu kommen
zeitgem&auml;&szlig;e Schnittstellen - auch nicht zu verachten.
</P>
<P>
Etwas verunsichert wird man allerdings durch die zwei angek&uuml;ndigten
PowerPC-L&ouml;sungen, die (noch) auf unterschiedliche Betriebssysteme zu setzen
scheinen (MorphOS/AmigaOS4.0).
</P>
<P>
Ein Amiga-Emulator, der auf einem AMD-Rechner l&auml;uft, ist meiner Meinung
nach keine ad&auml;quate L&ouml;sung f&uuml;r die Zukunft des Amiga.&laquo;
</P>
<P>
<B>Wolfgang Haas</B> meint: &raquo;Das ist eine Grundsatzfrage. Wann ist ein Amiga ein
Amiga? Seit ich unter Linux meine Shell aussuchen kann, wandelt sich auch
das Amiga-Bild. Ich habe auch Amithlon und AmigaOS XL. W&uuml;rde eine Firma
einen Amiga auf den Markt werfen, der auch die Amiga-Disketten verarbeiten
kann, w&auml;re ich schon bereit, meinen 2000er und 4000er abzugeben. Letztlich
haben Athlons mit 1 GHz derart viel Power, dass eine gesamte 68000-Umgebung
emuliert werden kann. Ich selbst programmiere nicht auf dem Amiga, sondern
nutze nur fertige Softwarepakete. Ich kann mir aber vorstellen, dass es
durchaus Probleme mit der Programmstrukturumsetzung gibt.&laquo;
</P>
<P>
<B>Cord Hagen</B> ist dieser Ansicht: &raquo;Wir alle kennen das sogenannte Amiga-
Feeling, wenn wir mit den Classic-Systemen arbeiten und spielen. Ob dieses
typische Arbeitsgef&uuml;hl tats&auml;chlich auf derart andere Hardware portiert
werden kann, ist tats&auml;chlich fraglich. Ich w&uuml;rde da aber &uuml;ber ungelegte
Eier gar nicht weiter nachdenken wollen - ich will mich dann, wenn es
soweit ist, lieber selbst davon &uuml;berzeugen. Ich habe auch nie zu den
Amiganern geh&ouml;rt, die bei der blo&szlig;en Ank&uuml;ndigung eines neuen Systems gleich
gerufen habe &quot;Will ich haben, muss ich haben, wo kann ich es
vorbestellen?&quot;. Wie kann man ein Produkt kaufen, welches man nicht im
geringsten kennt, das noch nicht mal in der Praxis existiert und wozu es ja
noch nicht mal Erfahrungsberichte gibt? Nur weil ein Amiga-Aufkleber am
Geh&auml;use angebracht ist? Nun, wer es sich leisten kann, ein solch teures
&Uuml;berraschungspaket zu kaufen, warum nicht? Ich geh&ouml;re leider nicht dazu.
Wenn der neue auf dem Markt ist und mich &uuml;berzeugt, dann kaufe ich das
System auch - gleich, mit welcher Hardware es arbeitet - es hat mich dann
ja scheinbar &uuml;berzeugen k&ouml;nnen.
</P>
<P>
Rein marketing-technisch finde ich den A1.5 nicht ganz so optimal. Trotz
der nicht mehr zeitgem&auml;&szlig;en Hardware kann da nur noch der Gesamteindruck zur
Kaufentscheidung f&uuml;hren. Von den technischen Daten her, wird dieses System
aber leider nicht f&uuml;r Aufmerksamkeit bei Fremd-Usern sorgen k&ouml;nnen. Am
Jahresende werden die Windows-User die 3GHz-Schallmauer durchbrechen und
ich bef&uuml;rchte, dass wir dann immer noch auf 600MHz-CPUs hocken werden, und
das zu weit h&ouml;heren Preisen. F&uuml;r Amiga-Fans alles kein Thema - wir wissen,
dass nicht allein eine hochgetaktete CPU das ganze System ausmacht. F&uuml;r den
Amiga-Markt wird das neue System ein guter Schritt sein, aber ob der
restliche Markt darauf aufmerksam wird?
Ich pers&ouml;nlich w&auml;re auch f&uuml;r das Motto &quot;Weniger ist oft mehr&quot; gewesen.
Lieber weg mit den PS/2-Anschl&uuml;ssen und daf&uuml;r mehr USB2.0-Slots!
Diskettenlaufwerk raus und CDRW als Standard rein! Serialports weg und
vielleicht FireWire rein. So irrsinnig sich das erst mal anh&ouml;rt, aber
allein durch das Weglassen v&ouml;llig veralteter Technologien, die eigentlich
&uuml;berfl&uuml;ssig geworden sind, wirkt ein System schon moderner. Firmen wie IBM
und Co. versuchen schon lange Zeit, die alten Komponenten aus dem Standard
zu hebeln, und ich meine, auf serielle- und PS2-Anschl&uuml;sse kann man
wirklich verzichten, und Diskettenlaufwerke nutzt heute auch kaum noch
jemand, sofern CDRW-Nutzung in optimalem Umfang im OS integriert ist, ich
also die CDRW auch wie eine Diskette nutzen kann, ohne extra Programme
aufrufen zu m&uuml;ssen.
</P>
<P>
Hier h&auml;tte die neue Amiga-Plattform den richtigen Schritt gehen k&ouml;nnen und
sich von vornherein von altem Ballast befreien k&ouml;nnen.&laquo;
</P>
<P>
<B>Kai Eckardts</B> Antwort lautet wie folgt: &raquo;Zur Frage, ob ein Amiga Chipset und
68k-CPU haben muss, denke ich: Nein, muss er nicht. Wichtig ist ein
Betriebssystem, das durchschaubar ist. Allerdings halte ich nicht viel vom
x86-Prozessor. Der ist zu kompliziert, da muss man wissen, welcher Befehl
mit welchem Register verwendet werden darf. D&uuml;rfte den meisten Usern egal
sein, aber mich interessiert so was schon.&laquo;
</P>
<P>
<B>Jens Bache</B> ist dieser Auffassung: &raquo;Ein Computer mit AmigaOS aber ohne
Customchips und 68k-CPU ist zwar kein Amiga, wie er es eigentlich im
Original ist, ich finde aber, dass es kein Problem ist, wenn eine andere
Hardware zum Einsatz kommt. Solange das AmigaOS darauf nativ l&auml;uft,
bezeichne ich es als Amiga.&laquo;
</P>
<P>
<B>Andreas Riefe</B> schreibt: &raquo;Heutzutage w&auml;re ein Amiga mit 68k-CPU &uuml;berhaupt
nicht mehr lebensf&auml;hig. Ich bin seit 1993 begeisterter Amiganer und habe
ein CD32, A600 und A1200 mit PPC-Board. Es ist mir immer noch ein Spa&szlig;, mit
Final Writer zu arbeiten, obwohl ich auch mit Office XP arbeiten k&ouml;nnte.
Schlecht w&auml;re, ein PC mit einem Amiga-Ball zu versehen, weil der Amiga
immer eine Alternative zum PC dargestellt hat.
</P>
<P>
Ein 68k-Prozessor darf es heute nicht mehr sein, aber es sollte auf keinen
Fall eine auf Intel basierende Maschine werden. Ich k&ouml;nnte mich mit AMD
anfreunden!!
Das Amiga-OS in sinnvoller Weiterentwicklung und einem guten Preis-
Leistungsverh&auml;ltnis, aber trotzdem IBM-kompatibel, w&auml;re ein prima System.&laquo;
</P>
<P>
<B>Achim Stegemann</B> f&uuml;hrt aus: &raquo;F&uuml;r mich gilt: Generell ist nicht die Hardware
entscheidend f&uuml;r das &quot;Gewisse Etwas&quot;, das ein Betriebssystem ausmacht, egal
ob das nun Windows, MacOS, Linux und eben auch AmigaOS ist.
</P>
<P>
Was doch jeder Benutzer am Amiga sch&auml;tzt, ist seine Benutzerfreundlichkeit,
Einfachheit und hohe Effizienz der Rechnerleistung. Das alles h&auml;ngt aber
mit dem Betriebssystem zusammen und nicht mit der Hardware.
</P>
<P>
Daher gilt f&uuml;r mich, dass, egal ob nun ein 68k, PPC oder gar x86 (Puristen
m&ouml;gen mir verzeihen) als Herz schl&auml;gt, egal ob ich auf einem Original-
Amiga, UAE oder Amithlon &quot;meinen&quot; Amiga bediene, dort wo Amiga-Software
l&auml;uft, auch ein Amiga ist.
</P>
<P>
Ich wei&szlig;, dass viele &quot;Hardcore&quot;-Amiganer Amithlon und UAE als Verrat
ansehen. Aber sie vergessen, dass unsere geliebte Hardware alt wird. Was
also machen, wenn man auf seinen Amiga nicht verzichten will, wenn einem
der Amiga kaputt geht? Wenig Alternativen, die g&uuml;nstig sind, gibt es nicht.
</P>
<P>
Was die Customchips betrifft: Ich benutze schon seit langem keine
Customchips mehr. AGA ist auf meinem 4000er verbannt. Ich benutze nur noch
Software, die auch auf Grafikarten lauff&auml;hig ist. Wenn ich mal wirklich
Lust auf ein AGA-Spiel bekomme (oder gar noch &auml;lter), dann benutze ich
WinUAE. Tats&auml;chlich ist WinUAE kompatibler zu &auml;lteren Spielen als es mein
4000er mit CybervisionPPC und einem PPC604e je gewesen ist. Auch hier sieht
man doch deutlich, dass selbst ein Original-Amiga nicht unbedingt DER Amiga
sein muss.
</P>
<P>
Schmerzlicher wird es beim Soundchip. Zwar haben mittlerweile die meisten
Anwender eine Grafikkarte, aber eine Soundkarte eher die wenigsten im
Amiga. Aber auch hier gilt bei Emulationen: AHI ist Standard, und Paula
wird ebenfalls von allen Emulatoren emuliert.
</P>
<P>
Fazit f&uuml;r die Frage des Monats: Auch ein AmigaOS ohne 68k und Customchips
ist ein Amiga. Denn das Innenleben ist doch uninteressant. Das was der
Benutzer tun kann und wie er es tun kann, das ist das Entscheidende f&uuml;r
mich, was das Amiga-Feeling angeht.&laquo;
</P>
<P>
<B>Kai</B>, mit Nachnamen ebenfalls Stegemann meint: &raquo;Heutzutage geht das schon in
Ordnung. Man kann sogar soweit gehen, dass auch ein Rechner ein Amiga sein
kann, ohne dass der Name draufgepappt ist. Im Umkehrschluss kann auch ein
Computer kein Amiga sein, obwohl Amiga draufsteht.
</P>
<P>
Aber f&uuml;r mich kann ein x86-basierter Rechner kein Amiga sein.&laquo;
</P>
<P>
<B>Hans Happe</B> formuliert: &raquo;Die Aussage kann ich so nicht unterst&uuml;tzen. Amiga
ist f&uuml;r mich alles, was mit (relativ) durchschaubarem Betriebssystem, dem
AmigaOS, zu tun hat. Wie das dann mit welchen Prozessoren berechnet wird,
ist doch v&ouml;llig uninteressant. Die Technik bleibt ja nicht stehen, heute
wird doch auch nicht mehr auf dem Kohleofen das Essen bereitet, sondern auf
dem Elektroherd. Es kommt doch auf die Zutaten und den Koch an, wie das
Essen dann letztlich schmeckt, und da schmeckt mir halt die Amiga-Kost
immer noch sehr gut, obwohl, es besteht schon Bedarf an neuen
Kochb&uuml;chern... ;-)&laquo;
</P>
<P>
<B>Mathias Klingner</B> sieht die Sache so: &raquo;Ich besitze zwei A1200 und einen
A600, alle mit 030/50MHz-Prozessor und Fast-RAM (16 bis 32 MB). Mit diesen
Computern, die auch alle drei im Einsatz sind, erledige ich vom Drucken bis
zum Scannen, einfache Bildbearbeitung und Textverarbeitung mit
Bildeinbindung sowie das Surfen im Internet und E-Mails alles, was so zu
Hause anf&auml;llt.
</P>
<P>
Wenn ich jetzt z.B. einen Amithlon-Rechner mit der Amiga-Emulation und
dieser alle meine oben beschriebenen Dinge mit meinen jetzt zur Verf&uuml;gung
stehenden Programmen ebenso flott oder noch schneller verrichten w&uuml;rde,
dann w&uuml;rde ich sagen, dass es ein Amiga ist. Er m&uuml;sste allerdings in der
Handhabung ebenso wie meine jetzigen Rechner sein. Eventuell noch ein
besseres Betriebssystem, mit dem es auch m&ouml;glich ist, z.B. auf die
Internetseite von &quot;Pro 7&quot; zu gelangen, MPEG-Musik abzuspielen und alle PDF-
Dokumente anzuzeigen.
</P>
<P>
Das typische am Amiga ist ja meiner Meinung nach nicht der in die Jahre
gekommene Prozessor, sondern die ansprechende Arbeitsumgebung, mit der das
Arbeiten am Rechner zu Hause zur Freude wird und nicht so steril wie auf
einem Windows-Rechner mit seinen Programmen abl&auml;uft. Bestes Beispiel ist
das Mail-Programm &quot;YAM&quot;, in welches ich gerade diesen Text eingebe.&laquo;
</P>
<P>
<B>Axel Knabe</B> fasst sich kurz: &raquo;Ein AMIGA ist f&uuml;r mich ein Rechner, der vom
Hersteller gebaut worden ist, um darauf AmigaOS/MorphOS laufen zu lassen.
</P>
<P>
Dumme Dosen mit Emulatoren sind f&uuml;r mich keine AMIGAs. 68k-Prozessor und
Customchips sind kein Muss f&uuml;r einen AMIGA. Es sind nur
Ausstattungsmerkmale.&laquo;
</P>
<P>
<B>Dominic J.</B> erl&auml;utert ausf&uuml;hrlich: &raquo;Leute, die im Jahre 2002 noch immer
denken, dass ein 68k bzw. Paula und Co. einen Amiga ausmachen, die werden
mit diesem heutzutage nicht mehr weit kommen. Ich bin der Meinung, dass der
Amiga mit dem OS 4.0 (PowerPC-nativ) und der PowerPC-CPU (G3/G4) gut
bedient sind. Der PowerPC ist nur eine Weiterentwicklung des 68k auf Risc-
Basis. Nat&uuml;rlich ist es nicht sonderlich erfreulich, dass es Commodore,
Amiga Technologies oder AMIGA, Inc. nicht geschafft haben, den Zorro-Bus
mit Hilfe von Dritten zum Standard zu entwickeln.
</P>
<P>
Das gleiche gilt in meinen Augen f&uuml;r das Customchipset. Aus dem einstigen
(theoretischen) technischen Vorsprung, den Commodore damals mit dem AGA
bzw. AAA-Chipset gegen&uuml;ber den IBM-kompatiblen PCs hatte, h&auml;tte heute DER
Ma&szlig;stab f&uuml;r Grafikkartenchips&auml;tze werden k&ouml;nnen. Der neue Amiga wird mit
den momentanen Spezifikationen ann&auml;hernd marktf&auml;hig sein. Es kommt nur
darauf an, wie lange Eyetech braucht, um ihn auszuliefern und wie viel er
dann kostet. In solch schwierigen Zeiten muss der Amiga(-User) eben mit dem
zufrieden sein, was er bekommt, und allzu sehr mit PC-Komponenten ist er
auch nicht zugestopft. Immerhin wurde ein neues Mainboard designt (erstmals
seit dem des A4000T 1994). F&uuml;r mehr Neuentwicklungen ist im Moment kein
Geld und keine Zeit. Wenn AMIGA und/oder Drittfirmen wieder Geld durch die
Verk&auml;ufe in den Kassen haben, werden auch sie nicht davor zur&uuml;ckschrecken,
spezielle f&uuml;r den Amiga zugeschnittene Hardware zu entwickeln. Alles auf
einmal geht nicht. Ein Schritt in die Zukunft ist getan, und allm&auml;hlich
lernt der Amiga wieder laufen - das nur (hoffentlich) schneller als beim
letzten Mal...&laquo;
</P>
<P>
<B>Piscitello Giancarlo</B> meint: &raquo;Amiga ist das, was wir daraus machen oder
sehen. Wenn das Ger&auml;t von AMIGA &amp; Co. kommt, dann w&auml;re sinnvoll, es als
&quot;echten&quot; Amiga-Nachfolger zu betrachten.
</P>
<P>
Dass leider die Eigenschaften des Classic-Amiga &uuml;berholt sind, ist jedem
klar. Also, es lebe Amiga!&laquo;
</P>
<P>
<B>Martin</B> (Nachname unbekannt) hat folgendes Statement abgegeben: &raquo;Die Frage
erscheint generell &uuml;berfl&uuml;ssig - so finde ich jedenfalls -, da auch der
Amiga schon vor 10 Jahren in Richtung PCI-Steckkarten und erweiterbarer
Module gehen sollte. W&auml;re Escom oder Commodore nicht pleite gegangen, w&auml;re
nach dem AAA-Chipset der n&auml;chste Schritt ein Amiga mit Grafikkarte,
Soundkarte, etc. gewesen - nat&uuml;rlich um einiges besser als ein
entsprechender Wintel-PC.
</P>
<P>
Ein leistungsstarker Prozessor, wie der G3-PowerPC/600 MHz, in Verbindung
mit z.B. einer ATI Radeon 8500 macht die Frage nach Customchips hinf&auml;llig.
Von entscheidender Bedeutung wird vielmehr das Betriebssystem im
Zusammenspiel mit der &quot;neuen Hardware&quot; sowie die Treiberunterst&uuml;tzung sein.
</P>
<P>
Ein Amiga ist in dem Moment ein Amiga, wo der Individualismus in jeglicher
Form dem Monopolisten und der Masse die Stirn bietet. Und wer sich f&uuml;r ca.
1000 Euro und mehr ein System mit AmigaOS 4 kauft und, ich betone, keine
PS2 oder X-Box oder Gamecube etc., der kann nur mehr ein Amigafan sein...
</P>
<P>
Amiga lebt durch den Glauben an das Einzigartige, und dieser Gedanke lebt
in jedem St&uuml;ck Amiga-Software, oder wenn man so will auch Hardware, die f&uuml;r
den Amiga eingesetzt wird, und nicht im Einheitsbrei.
</P>
<P>
Wenn es einen G3-Rechner mit OS 4 tats&auml;chlich zu kaufen gibt und ich das
notwendige Geld habe, werde ich mir sicher einen solchen, vielleicht auch
Pegasos, kaufen.
</P>
<P>
P.S. Ein Amiga definiert sich durch Einzigartigkeit, Durchhalteverm&ouml;gen
(meiner l&auml;uft seit &uuml;ber 12 Jahren) und Ausbruch aus der PC-Mist in
kommerzieller Form.&laquo;
</P>
<P>
<B>Astrid</B> (Nachname unbekannt) antwortet: &raquo;Wenn nicht bis Mitte des Jahres
G3/G4-CPUs ab 600 MHz mit AmigaOS 4.0 als Komplettsystem erh&auml;ltlich sein
werden, dann war's das komplett. So lange warte ich noch, aber dann war's
das. Solange es eine PowerPC-orientierte Risc-CPU ist und AmigaOS darauf
l&auml;uft, ist es in gewissem Sinne ein Amiga!!! 68k-CPUs sind tolle
Prozessoren, keine Frage, jedoch nicht mehr ganz zeitgem&auml;&szlig;. Die einzige
Chance f&uuml;r AMIGA ist ein Komplettsystem oder dergleichen mit pr&auml;emptivem
Multitasking, sprich AmigaOS 4.0 mit aktuellen Komponenten. Der Prozessor
ist ein PowerPC-G3, ist ja wohl klar, somit ist die Prozessorfrage generell
&uuml;berfl&uuml;ssig. Sch&ouml;ne Gr&uuml;&szlig;e an alle, die ihren A1200 genauso hoch sch&auml;tzen
wie ich und auf den &quot;neuen&quot; warten.&laquo;
</P>
<P>
<B>J&uuml;rgen Lange</B> teilt mit: &raquo;Auf die Leistung mancher Customchips verzichte ich
schon seit dem Einsatz einer Grafikkarte (Picasso IV). Und dass der 68k-
Prozessor auch nicht das Ma&szlig; der Dinge sein kann, zeigen die diversen
Schritte Richtung PPC uns x86.
</P>
<P>
Ja, ich bezeichne meinen PC mit Amithlon als Amiga.&laquo;
</P>
<P>
<B>Klaus Moddemann</B> schreibt: &raquo;Ich finde, es ist kein Amiga, wie wir ihn bis
heute kennen und liebgewonnen haben, der neue wird aber auch nie so sein.
Der neue Rechner, Amiga will ich an dieser Stelle noch nicht sagen, darf
aber auch nicht so sein, da er in der Entwicklung und Produktion zu teuer
werden w&uuml;rde, weil wir nicht davon ausgehen k&ouml;nnen, gleich zigtausend St&uuml;ck
davon abzusetzen. Deshalb ist es erst mal ratsamer, auf g&uuml;nstige
Standardkomponenten, unter anderem, zur&uuml;ckzugreifen.
</P>
<P>
Was den Amiga ausmachte, war aber nicht nur die Hardware, die ihn von
seinen Konkurrenten unterschied, es war ja auch die Software, das AmigaOS,
das wir alle kennen und sch&auml;tzen, trotz seiner zahlreichen Macken.
An dieser Stelle ist der neue Rechner wieder ein &quot;echter&quot; Amiga, weil er
sich, geringf&uuml;gig zwar, in der Hardware als auch in der Software
unterscheidet. Ich habe mir schon einen Pegasos bestellt, weil ich keine
Lust habe, mich weiter mit Wintel-Mist herumzuschlagen. Auch wenn er keinen
MC68k und Customchips mehr hat, es ist ein eigenst&auml;ndiges System, das neue
Wege geht, sich von den anderen abhebt, ein AmigaOS besitzt/benutzt,
deswegen ist es ein Amiga - der neue Amiga - f&uuml;r mich.&laquo;
</P>
<P>
<B>Michael Schulz</B> hat sich diese Frage &raquo;[...} auch schon oft gestellt. Was
macht eigentlich den Amiga aus? Das Betriebssystem, die CPU, die
technischen Besonderheiten, wie etwa die ROMs, oder etwa alles zusammen?
Jede Plattform entwickelt sich weiter. Einen 68060 in einem neu geplanten
AmigaOne zu verwenden, so gut er auch ist, w&auml;re reine Nostalgie. Viele neue
M&ouml;glichkeiten, wie 3D-Spiele, DVD usw. blieben ihm verwehrt. Ich finde,
dass sich ein Amiga durch das Betriebssystem AmigaOS auszeichnet, welches
zu 100% abw&auml;rtskompatibel sein muss.&laquo;
</P>
<P>
<B>Matthias Schrameyer</B> hat uns folgende Zeilen geschickt: &raquo;Ich bin der
Meinung, dass diese These nicht stimmt. Fr&uuml;her war der Amiga dem PC ja
durch seine Grafikf&auml;higkeit haushoch &uuml;berlegen. Ob das nun Customchips oder
'ne Grafikkarte gewesen w&auml;re, h&auml;tte doch wohl keine Rolle gespielt. Nun ist
die Entwicklung aber doch weiter gegangen und nicht mehr auf Chips stehen
geblieben. Es ist doch gut, wenn man sich, nach dem was man machen will,
die anderen Bausteine aussuchen kann, damit der Rechner in dem Preisrahmen
liegt, den man anpeilt. Au&szlig;erdem merkt man doch als Anwender nicht, ob das
nun ein Intel, AMD, 68k oder was wei&szlig; ich noch ist. Ich denke, dass das OS
der Faktor ist! Es w&auml;re aber auch nicht schlecht, wenn man sagen w&uuml;rde,
damit alles gut l&auml;uft, sollte man das und das mindestens drin haben. So in
der Art wie Apple das mit ihren Macs machen. Da l&auml;uft das OS halt super und
es gibt dann auch weniger Probleme. Allerdings sollte man beim Amiga die
Wahl haben, welches Modell ich mir denn nun kaufe, so dass der untere
Standard halt &quot;bekannt&quot; ist.
</P>
<P>
Und dann kann man sich seinen Amiga zusammenstellen und hat dann dank des
AmigaOS einen echten Amiga!&laquo;
</P>
<P>
<B>Peter Dorn</B> antwortet: &raquo;Ganz einfach, die Technik des Amiga Classic ist weit
&uuml;berholt. Deshalb muss ein Wechsel stattfinden, weil sonst der Anschluss
gar nicht mehr stattfinden kann. Der Classic-Amiga ist ja sowieso ein Oldie
in der Computerbranche. Oldies k&ouml;nnen ja eines Tages sehr wertvoll werden,
stimmt es?&laquo;
</P>
<P>
Last but not least hat <B>Dieter Groppé</B> nachstehende Zeilen verfasst: &raquo;Ich
finde nicht, dass der Amiga durch den 68k-Prozessor oder gar die
Customchips zu dem wird, was er ist. O.K., die Chips sowie teilweise
&uuml;berhaupt die Hardwarearchitektur waren damals etwas Besonderes, aber
leider heute nicht mehr. Vielmehr empfinde ich die &quot;Ebenenstruktur&quot;, wenn
ich es mal so nennen darf, als das absolut Besondere.
</P>
<P>
So war es f&uuml;r einen Programmierer (und letztlich auch f&uuml;r den User) immer
relativ simpel, einfache Dinge zu tun, und zwar relativ hardwareunabh&auml;ngig.
Oder zu sagen, ich will etwas ganz Spezielles mit einer bestimmten Hardware
machen, ist kein Problem, auch das l&auml;sst sich systemkonform tun.
</P>
<P>
H&ouml;rt sich jetzt etwas kompliziert an, daher mal an einem Beispiel erkl&auml;rt:
Will ich irgendetwas schreiben, so kann mir egal sein, wohin letztlich
geschrieben wird, einfach die &quot;Schreib&quot;-Funktion der Library aufgerufen,
und schon erledigt alles andere der Amiga.
</P>
<P>
Will ich aber lieber direkt auf Diskette in einem besonderem Format
schreiben, so bin ich etwas mehr hardwareabh&auml;ngig und kann trotzdem &uuml;ber
ein Device ohne direkten Hardwarezugriff arbeiten.
</P>
<P>
Also diese besondere Struktur, Library f&uuml;r allgemeine Funktionen, daf&uuml;r
absolut ausgabeunabh&auml;ngig, das Device nur f&uuml;r das spezielle Ger&auml;te, aber
dort sehr flexibel.
</P>
<P>
Und wem das nicht reicht, der kann auch noch einen Handler schreiben, der
wieder eine Zwischenebene darstellt, und mir somit erm&ouml;glicht, meine
spezielle Hardwareschreibweise &uuml;ber die Library zu erm&ouml;glichen.
</P>
<P>
Das ist au&szlig;erdem noch sehr flexibel; wie man im Amiga-Leben sieht, kommen
immer wieder einfach nur neue Devices f&uuml;r eine neue Hardware, und schon ist
der grunds&auml;tzliche Zugriff m&ouml;glich.
</P>
<P>
Ich finde, dass dies ein wichtiger Punkt des sogenannten Amiga-Geistes ist,
und nicht der Prozessor.&laquo;
</P>
<BR><BR>
<P>
<B>Dar&uuml;ber hinaus haben uns noch drei Stellungnahmen zur Frage des Monats der
Aprilausgabe (&raquo;Wie beurteilst du die Ann&auml;herung von AMIGA, Inc. und
Microsoft prinzipiell?&laquo;) erreicht:</B>
</P>
<P>
<B>Wolfgang Haas</B> schreibt: &raquo;Ich arbeite vorzugsweise mit Linux. Bin zwar kein
genereller Microsoft-Gegner, halte mich aber strikt zur&uuml;ck. Mit Windows
2000 ist schon stabil zu arbeiten, ich lobe aber NT 4.0. Amiga im Netzwerk
muss naturgem&auml;&szlig; viele H&uuml;rden nehmen, hat man seine DIN-A4-Seiten-
Bemerkungen abgearbeitet, ziehe ich den Amiga mit OS 3.1 oder 3.5 dem
Windows 95 allemal vor.&laquo;
</P>
<P>
<B>G&uuml;nter Raab</B> antwortet: &raquo;Allen Unkenrufen so mancher Amiganer zum Trotz
finde ich, dass eine Ann&auml;herung von AMIGA, Inc. an Microsoft mehr als
notwendig ist.
</P>
<P>
In meiner letzten Lesermail im M&auml;rz bekrittelte ich die immer noch sehr
mangelhaften M&ouml;glichkeiten zum direkten Datenaustausch von Amiga und PC,
insbesondere in der B&uuml;rosoftware.
</P>
<P>
Es ist nun einmal Tatsache, dass MS Word und Excel zu den unbestrittenen
Marktf&uuml;hrern geh&ouml;ren. Und dies nicht zu Unrecht. Auch Apple Macintosh hatte
die Zeichen der Zeit erkannt und das MS-Office-Paket auf das MacOS
portiert. Und zwar rechtzeitig!
</P>
<P>
Auch f&uuml;r den Amiga ist dieser Schritt unausweichlich, wenn unser Computer
&uuml;berleben soll. Viele ehemalige Amiganer mussten einfach zum PC wechseln,
haupts&auml;chlich aus beruflichen Gr&uuml;nden, aber auch im privaten Bereich hatten
viele es einfach satt, gewisse Dateien nicht 1:1 austauschen zu k&ouml;nnen.
</P>
<P>
Wozu aber das Rad neu erfinden? Wenn die M&ouml;glichkeit besteht,
weitverbreitete Spitzenprogramme (Word, Excel, Internetbrowser) in das
Amiga-System einzubauen, so sollte keine Zeit mehr verloren werden!
</P>
<P>
H&uuml;ten sollte sich aber AMIGA, Inc. davor, das OS an Microsoft anzugleichen.
Das w&auml;re wohl unverzeihlich! Der Grund, warum (nicht nur) ich nicht l&auml;ngst
auf einen PC wechselte, ist Windows - das mit Abstand aufgeblasenste und
l&auml;hmenste Betriebsystem. Aber auch das MacOS ist nicht unbedingt das
berauschenste.
</P>
<P>
Seit einigen Wochen besitze ich auch einen G3-Mac, er kann aber meinen
Amiga in Sachen Bedienungskomfort nicht das Wasser reichen.
</P>
<P>
Geschwindigkeitsm&auml;&szlig;ig hat er trotz 350 Mhz (gegen&uuml;ber 68060/66) schon etwas
mehr drauf. Allein das w&auml;re mit einem PowerPC auf dem Amiga mehr als wett
zu machen - wenn ich einen kaufen k&ouml;nnte...
</P>
<P>
Jedoch l&auml;uft auf dem Mac eben das MS-Office, das f&uuml;r meine Frau wichtig
ist, und ich kann endlich im Internet ohne nervige Javascript-Fehler
surfen!
</P>
<P>
Den allergr&ouml;&szlig;ten Teil meiner Arbeiten erledige ich aber immer noch mit dem
Amiga. Sollte endlich der AmigaONE kommen und das neue OS die
Versprechungen halten, dann wird wohl der Mac dem neuen Amiga Platz machen
m&uuml;ssen.&laquo;
</P>
<P>
<B>Jens Bache</B> meint: &raquo;Ich finde eine Partnerschaft zwischen Amiga und
Microsoft zwar gar nicht gut, aber dadurch bekommt Amiga wieder etwas Geld
in die Kassen.&laquo;
</P>
<BR><BR>
<P><B>Nun zur aktuellen Frage des Monats:</B></P>
<P>
&raquo;W&uuml;rdest du ein favorisiertes Hard- oder Softwareprodukt auch dann kaufen,
wenn es nachweislich von gewaltverherrlichenden Extremisten entwickelt
wurde? Warum beziehungsweise warum nicht?&laquo;
</P>
<P><B>Schickt eure Beitr&auml;ge bitte an <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A></B></P>
<P ALIGN="RIGHT">
<A HREF="Forum.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
