<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Abschlie&szlig;end
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
<H2>Verh&auml;rtete PowerPC-Fronten - und m&ouml;gliche Folgen (von Carsten Schr&ouml;der)</H2>
</P>
<P>
In den letzten Wochen hat sich mein Eindruck verst&auml;rkt, dass eine
Kooperation zwischen der &quot;PowerPC-Koalition A&quot; (AMIGA/Eyetech/Hyperion) und
der &quot;PowerPC-Koalition B&quot; (bplan/Thendic/MorphOS-Team) nicht nur eine
Illusion ist, sondern wohl auf absehbare Zeit auch eine bleiben wird.
Hauptgrund ist - wieder einmal -, dass jeder der Kontrahenten auf seinen
Standpunkten beharrt und keinen Millimeter nachzugeben bereit ist. Auf den
ersten Blick ist das sogar verst&auml;ndlich, denn allen Seiten geht es
nat&uuml;rlich prim&auml;r nicht um den Amiga oder die User, sondern um das liebe
Geld. Wahrscheinlich denkt sich jeder: Die anderen haben gegen uns sowieso
keine Chance - weshalb sollten wir sie mit ins Boot nehmen und den Gewinn
teilen?
</P>
<P>
Es soll User gegeben haben und vielleicht sogar noch geben, die dieses
Verhalten &quot;Microsoft-Mentalit&auml;t&quot; nennen, ich dagegen w&uuml;rde es eher als
&quot;Amiga-Syndrom&quot; bezeichnen, oder auch als &quot;die bekannte Amiga-
Kooperationsunf&auml;higkeit&quot;, die sp&auml;testens nach der Commodore-Pleite, wie
eine Krankheit, immer mehr um sich gegriffen hat.
<BR>
Auf anderen M&auml;rkten hat sich l&auml;ngst herumgesprochen, dass Kooperationen in
aller Regel mittelfristig zu einem h&ouml;heren Gewinn f&uuml;hren - und zwar f&uuml;r
alle Beteiligten. In einem so winzigen Markt wie unserem kommt noch hinzu,
dass dort oftmals sogar das &Uuml;berleben der betreffenden Firmen davon
abh&auml;ngt, ob es zu einer Zusammenarbeit kommt oder nicht. Konkret auf den
Amiga-Bereich bezogen hei&szlig;t das: Die Gefahr ist sehr gro&szlig;, dass am Ende
beide Seiten (und mit ihnen die Anwender) verlieren, weil sich sowohl
AmigaOS als auch MorphOS nicht einmal oft genug absetzen lassen, um
zumindest die Softwareentwicklungskosten zu decken.
</P>
<P>
Aber ich mache mir wie gesagt keine Illusionen. Zu einer Kooperation der
Kontrahenten wird es allenfalls zu einem Zeitpunkt kommen, wenn beide
Seiten endg&uuml;ltig am Abgrund stehen - und dann ist es zu sp&auml;t. Vorher wird
niemand die St&auml;rke aufbringen, &uuml;ber seinen eigenen Schatten zu springen,
zumal in unserem Fall nicht einmal nur unternehmerische Dickk&ouml;pfigkeit eine
Rolle spielt, sondern - und dies d&uuml;rfte sogar ausschlaggebend sein - auch
pers&ouml;nliche Animosit&auml;ten. Die beiden Lager beziehungsweise einige wichtige
Entwickler sind sich sprichw&ouml;rtlich spinnefeind, und daran tr&auml;gt der
jahrelange Konflikt PowerUp versus WarpOS beziehungsweise Phase 5 digital
products versus Haage &amp; Partner eine nicht geringe Schuld.
</P>
<P>
Was mich aber besonders nachdenklich stimmt: Seit Monaten muss ich zur
Kenntnis nehmen, dass sich diese Zerstrittenheit nicht mehr nur auf
Manager, Entwickler und ihre Wortf&uuml;hrer beschr&auml;nkt, sondern allm&auml;hlich auch
auf die Anwender &uuml;bergreift. Zwar ist die &uuml;berwiegende Mehrheit momentan
noch so vern&uuml;nftig, sich nicht vorab f&uuml;r das AmigaOS 4.0 oder MorphOS zu
entscheiden, und das ist auch die einzig sinnvolle Verhaltensweise, denn
bis jetzt ist es ja noch v&ouml;llig offen, wann die Betriebssysteme in
Endanwenderversionen erh&auml;ltlich sein werden und welches von ihnen
qualitativ und quantitativ besser abschneiden wird - von den rechtlichen
Fragen einmal ganz abgesehen. Nichtsdestotrotz steigt die Zahl derjenigen
User stetig, die sich bereits vorab festlegen und in den Amiga-Foren
kr&auml;ftig die Werbetrommel f&uuml;r &quot;ihr&quot; OS r&uuml;hren. Ich sehe darin ein er(n)stes
Anzeichen einer echten Spaltung der Amiga-Anwenderschaft, hin zu zwei auf
PowerPC-Ebene nicht kompatiblen Betriebssystemen.
</P>
<P>
Und dieser Konflikt wird sich weiter versch&auml;rfen - zumindest dann, wenn
tats&auml;chlich beide Entwicklungen, AmigaOS und MorphOS, etwa zur selben Zeit
erscheinen und das Erstgenannte nicht der eindeutige Favorit der User ist.
In dem Fall rechne ich fest damit, dass AMIGA, Inc. juristisch gegen
MorphOS vorgehen wird. Sollte es Bill McEwen und Co. gelingen, die
Vermarktung der Konkurrenzentwicklung rasch zu stoppen, dann w&uuml;rde auf
diese Weise eine Spaltung des Amiga-PowerPC-Bereichs quasi in letzter
Minute verhindert.
</P>
<P>
K&auml;me AMIGA, Inc. aber vor Gericht nicht durch und g&auml;be das Unternehmen im
Anschluss daran auch nicht klein bei, w&auml;re das Projekt &quot;PowerPC-Amiga&quot;
gescheitert - aus einem simplen Grund: Um auch zuk&uuml;nftig s&auml;mtliche Amiga-
User (inklusive den immer zahlreicher werdenden Nutzern von x86-
Emulationen) ansprechen zu k&ouml;nnen, w&uuml;rden die allermeisten
Softwareentwickler weiterhin auf die Schiene AmigaOS 3.x/68k setzen und von
der jeweiligen PowerPC-Funktionalit&auml;t der beiden Betriebssysteme entweder
gar keinen Gebrauch machen oder diese nur optional unterst&uuml;tzen. Denn von
der Geschwindigkeit her werden die im AmigaOS 4.0 und MorphOS enthaltenen
68k-Emulationen bei Nutzung aktueller PowerPC-Hardware einen 68060 mit
Sicherheit deutlich &uuml;berfl&uuml;geln (und die 68k-Performance nimmt nat&uuml;rlich
mit jedem neuen PowerPC-Prozessor weiter zu), so dass es nur wenige
Anwendungsbereiche geben wird, in denen unbedingt native PowerPC-Leistung
vonn&ouml;ten ist.
<BR>
Die Ver&ouml;ffentlichung der PowerPC-only-Betriebssysteme AmigaOS 4.0 und
MorphOS k&ouml;nnte also paradoxerweise zu einer St&auml;rkung der Amiga-68k-Plattform auf Kosten der Amiga-PowerPC-Plattform f&uuml;hren.
</P>
<P><B>Damit bis zur n&auml;chsten Ausgabe,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
