<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>4. Preview: Die V&ouml;lker</H2>
<P><B>Gro&szlig;e Ereignisse werfen ihre Schatten voraus</B></P>
<P>
Auf dem Amiga (Mindestvoraussetzungen am Schluss) soll bald &quot;Alien
Nations&quot;, bei uns besser als &quot;Die V&ouml;lker&quot; bekannt, erscheinen. Also habe
ich meinen Bruder beauftragt, sich das Game mal auf dem PC f&uuml;r mich
anzuschauen. Lest, was er zu diesem Spiel sagt:
</P>
<P>
 <A HREF="img/voelker1.jpg"><IMG SRC="thumb/voelker1.jpg" WIDTH="120" HEIGHT="66" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
&raquo;Da ich einen PC habe, musste ich mal wieder f&uuml;r einen kleinen Test
herhalten. Ich habe &quot;Die V&ouml;lker&quot; fr&uuml;her immer gerne gespielt und spiele
jetzt sehr gerne den zweiten Teil. Um mich an den ersten Teil zu erinnern
(3 Jahre her), habe ich mir das Spiel noch mal installiert.
</P>
<P>
Worum geht es? Die V&ouml;lker ist ein Aufbaustrategiespiel á la &quot;Die Siedler&quot;.
Zwar kommen im weiteren Spiel auch Kampfelemente, aber der Aufbau nimmt den
gr&ouml;&szlig;ten Teil ein.
</P>
<P>
Das Spiel beginnt mit einem sehr lustigen Intro. 2 Weltraumst&ouml;rche sollen
drei Babys verschiedener Rassen auf 3 Planeten absetzen. Da sie aber total
besoffen sind und lieber noch einen heben m&ouml;chten, setzen sie die drei
Babys auf 1 Planeten ab.
</P>
<P>
So entwickeln sich drei unterschiedliche Rassen auf einem Planeten:
</P>
<UL>
<LI> Die Pimmons, blaue Steinzeitwesen.
</LI>
<BR><LI> Die Amazonen, wirklich schnuckelige Frauen.
</LI>
<BR><LI> Die Sajikis, eine sehr aggresive Insektenrasse.
</LI>
</UL>
<P>
 <A HREF="img/voelker2.jpg"><IMG SRC="thumb/voelker2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Bevor man in die 20 Missionen pro Rasse einsteigt, gibt es 5
Tutorialmissionen, die einen in das Spiel einweisen.
</P>
<P>
Und hier entdeckt man direkt die beiden St&auml;rken von &quot;Die V&ouml;lker&quot;: Eine
wirklich atemberaubende Grafik, zwar im Comicstil, aber alles bewegt sich,
super Farben und wirklich zum Knuddeln s&uuml;&szlig;e Animationen der Bewohner, und
zum anderen die perfekte Steuerung. Trotz der Tatsache, dass jedes Geb&auml;ude
(und davon gibt es 75!) und jeder Spieler (auch mal &uuml;ber 1000) ausw&auml;hlbar
und mit Optionen belegbar ist, wei&szlig; man immer, welche M&ouml;glichkeiten man
hat.
</P>
<P>
Der Einstieg in das Spiel ist wirklich kinderleicht. Die ersten Missionen
(pro Rasse) auch noch. Dann wird der Schwierigkeitsgrad angezogen. Aber
langsam und ausgewogen. Auch das gef&auml;llt mir sehr gut.
</P>
<P>
 <A HREF="img/voelker3.jpg"><IMG SRC="thumb/voelker3.jpg" WIDTH="120" HEIGHT="89" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
In &quot;Die V&ouml;lker&quot; m&uuml;sst ihr mit strategischem Weitblick dem eigenen Volk
gr&ouml;&szlig;tm&ouml;glichen Wohlstand sichern, die dazu n&ouml;tigen Ressourcen
erwirtschaften und eure Siedlungen gegen feindliche &Uuml;bergriffe verteidigen.
Zahlreiche Bau- und Entwicklungsoptionen stehen daf&uuml;r zur Verf&uuml;gung.
Von J&auml;gern und Sammlern kann euer Volk zu flei&szlig;igen Ackerb&uuml;rgern gemacht
werden, Forschung im volkseigenen Labor erm&ouml;glicht den Bau neuer Einheiten
und Geb&auml;ude, und geschickter Handel mit befreundeten Nachbarn bietet
lukrative Einnahmequellen. Was richtig Spa&szlig; macht, ist der gro&szlig;e
Forschungsteil. Nur so erfindet man neue H&auml;user und Erweiterungen. Auch
Arbeiter wachsen nicht (wie noch bei &quot;Die Siedler&quot;) an den B&auml;umen, sondern
m&uuml;ssen von teuer bezahlten Lehrern ausgebildet werden. Das ist manchmal gar
nicht so einfach, da die Schule nur ein paar Leuten Platz gew&auml;hrt und die
Ausbildung Zeit braucht.
</P>
<P>
Eure V&ouml;lker entwickeln ein Eigenleben. Mit fortschreitendem Wachstum
verlangen sie nach Wirtsh&auml;usern, Zeitungen, Theatern und anderem Luxus.
Solide Finanzplanung ist hier von N&ouml;ten, denn jedes Geb&auml;ude hat nat&uuml;rlich
Betriebskosten.
</P>
<P>
Unterschiede im Verbrauch von Ressourcen, in der Forschungsgeschwindigkeit
und bei den Kampfeinheiten machen f&uuml;r jede Rasse andere Vorgehensweisen
notwendig.
</P>
<P>
 <A HREF="img/voelker4.jpg"><IMG SRC="thumb/voelker4.jpg" WIDTH="120" HEIGHT="93" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Mein pers&ouml;nliches Fazit: Das Spiel ist jetzt nat&uuml;rlich nicht mehr auf dem
neusten Stand. Aber davon abgesehen ist es ein sehr ausgewogenes Spiel, das
niemals Langeweile aufkommen l&auml;sst. Es verf&uuml;gt &uuml;ber sehr gute Missionen und
eine wirklich &uuml;beraus gelungene Steuerung.
</P>
<P>
Von mir gibt es eine klare Kaufempfehlung. Und ich hoffe f&uuml;r alle Amiga-
User, dass der zweite Teil auch noch umgesetzt wird.
</P>
<P><B>Ansgar&laquo;</B></P>
<P>
So, dass h&ouml;rt sich ja schon mal ganz vielversprechend an. Im Anschluss gibt
es nochmals die komplette Featureliste, die laut Titan auch bis auf eine
kleine Einschr&auml;nkung im Multiplayermodus (keine Vernetzung mit PC, daf&uuml;r
aber mit Amiga und MAC &uuml;ber TCP oder LAN) 1:1 umgesetzt werden soll:
</P>
<UL>
<LI> riesige 3D-Landschaft
</LI>
<BR><LI> drei unterschiedliche V&ouml;lker
</LI>
<BR><LI> 75 unterschiedliche Geb&auml;ude und 85 Berufe
</LI>
<BR><LI> Spielfeld stufenlos zoombar
</LI>
<BR><LI> Forschung mit 100 Erfindungen
</LI>
<BR><LI> &quot;Lebendige&quot; Welt mit Wildtieren und Bewohnern, die ihrem Tagwerk
  nachgehen
</LI>
<BR><LI> Schulsystem zur Ausbildung von Bewohnern
</LI>
<BR><LI> Erfahrungssystem bei Kampfeinheiten
</LI>
<BR><LI> Hoher Wuselfaktor
</LI>
<BR><LI> Leichte Zug&auml;nglichkeit
</LI>
<BR><LI> Kampagnen mit 20 Einzelmissionen pro Volk
</LI>
<BR><LI> Multiplayer-Modus
</LI>
<BR><LI> 3D-Karten werden unterst&uuml;tzt
</LI>
<BR><LI> Hervorragende und detailreiche Grafik mit liebevollen Animationen
</LI>
<BR><LI> Diplomatiesystem
</LI>
</UL>
<P>
Und nun zu der alles entscheidenden Frage: Wird das Spiel auch f&uuml;r den
&quot;Classic-Amiga&quot; erscheinen? Auf der Homepage steht dort &quot;noch&quot; ein JA (PPC
und massig Speicher vorausgesetzt), aber gerade dieser Speicherverbrauch
stellt ein Problem dar. Originalton Michael Garlich (Titan): &raquo;Tja, und die
Amiga-Umsetzung macht heftigste Probleme: Der Speicher reicht hinten und
vorne nicht. Sieht schwer nach einer MorphOS/OS4-only-Geschichte aus, denn
wir bekommen den Speicherverbrauch ohne VM nicht unter 128 MB.&laquo;
</P>
<P><B>J&uuml;rgen Theiner &lt;<A HREF="mailto:Juergen.Theiner@t-online.de">Juergen.Theiner@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
