<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Workshops1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Workshops
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>2. Hintergrundbericht: Das Handbuch (von Michael Christoph)</H2>
<P>
Bereits in der letzten Ausgabe war im Zwischenruf ein recht lustiger,
aber auch interessanter Text ver&ouml;ffentlicht. Sicher hat jeder erraten,
worum es dabei ging: um das leidige Thema Handbuch.
</P>
<P>
Wird es von den Computerzeitschriften in den Bewertungen immer noch
bem&auml;ngelt, wenn es fehlt, landet es bei den meisten Benutzern unbeachtet
in einer Ecke. Dabei k&ouml;nnte der Benutzer durchaus Interessantes erfahren.
Aber auch im PC-Markt ist es heutzutage nicht mehr &uuml;blich, eine gedruckte
Anleitung beizulegen. Also sollten auch einmal die Redakteure umdenken
und ein &quot;Disketten-Handbuch&quot; gleichwertig beurteilen.
</P>
<P>
Zwar sollte sich ein Programm immer selbst erkl&auml;ren und intuitiv zu
bedienen sein, aber nur wenige Programme sind so klein, dass sich dieses
Ziel erreichen l&auml;sst. Oftmals sind bereits die M&ouml;glichkeiten des Programms
so umfangreich, dass diese nur durch das Lesen des Handbuches bekannt
werden.
</P>
<P>
Aber bereits die F&auml;higkeiten der Benutzer werfen scheinbar un&uuml;berbr&uuml;ckbare
Konflikte auf. So ist grob zwischen Anf&auml;ngern (oft auch fehlende Erfahrung
im Umgang mit dem Computer im Allgemeinen), Fortgeschrittenen (f&uuml;r sie ist
lediglich das Produkt neu) und Expertern (sie kennen bereits &auml;hnliche
Produkte) zu unterscheiden.
</P>
<P>
W&auml;hrend also ein Einsteiger erwartet, dass er jeden einzelnen Maus- und
Tastendruck einzeln erkl&auml;rt bekommt, erwarten Fortgeschrittene und Experten
lediglich eine schnelle Funktionserkl&auml;rung zum Produkt. Sie wollen sich
nicht durch zig Zeilen lesen m&uuml;ssen, nur um zu erfahren, wie beispielsweise
neue Daten erfasst werden k&ouml;nnen.
</P>
<P>
Ein eigenes Kapitel &uuml;ber die Benutzeroberfl&auml;che und deren Bedienung im
Speziellen hilft dem Einsteiger, sich im Programm zurechtzufinden. Hier
muss noch ausschweifend jeder Maus- und Tastendruck vorgegeben werden.
Ein Trainingsteil kommt dann allen Benutzergruppen zu gute. Dort sollten
anhand verschiedener Szenarien die Bedienung und typische Arbeitsabl&auml;ufe
erkl&auml;rt werden. Dabei sollte nur noch beschrieben sein, &uuml;ber welchen
Men&uuml;punkt sich die Funktion ausl&ouml;sen l&auml;sst, nicht jedoch, wie ein Men&uuml;
ausgew&auml;hlt wird.
</P>
<P>
Ein abschlie&szlig;ender Referenzteil hilft, auch sp&auml;ter noch durch einfaches
Nachschlagen einzelne Programmfunktionen nachlesen zu k&ouml;nnen. Hier ist
das Augenmerk auf eine umfangreiche Beschreibung der Funktionalit&auml;t und
M&ouml;glichkeiten zu legen. Verweise auf den Trainingsteil reichen aus, um
die Benutzung der Funktion nachzuschlagen.
</P>
<P>
Ein Stichwortverzeichnis bzw. Index sollte das Handbuch abschlie&szlig;en, um
schnell die gew&uuml;nschte Information auffinden zu k&ouml;nnen.
</P>
<BR>
Erstellt der Handbuch-Autor ein gutes Handbuch, dann sparen Hunderte
oder Tausende Benutzer eine Menge Zeit und Nerven!
<P>
Umgekehrt muss aber auch gesagt werden, liest jeder Benutzer das Handbuch,
bekommt er/sie einen &Uuml;berblick &uuml;ber die F&auml;higkeit des Programms und all
seiner M&ouml;glichkeiten. Zus&auml;tzlich wird man mit dem neuen Programm schnell
Erfolgserlebnisse erfahren.
</P>
<P>
In der Regel wird man heute lediglich noch eine gedruckte
Installationsanleitung vorfinden. Das Handbuch selber liegt dann auf
Festplatte vor.
</P>
<P>
Beim Amiga ist dabei das eigene AmigaGuide-Format geeignet, aber auch
immer mehr HTML-Anleitungen sind anzutreffen. Dieses Format erm&ouml;glicht
eine bessere Formatierung und auch das direkte Einbinden von Grafiken.
Es erfordert aber auch einen Browser zum Anzeigen.
</P>
<P>
Auch f&uuml;r ein &quot;digitales Handbuch&quot; gelten dieselben Punkte wie oben
angesprochen. Zus&auml;tzlich besteht noch die M&ouml;glichkeit, Verweise als Links
zu realisieren, wodurch mit einem einfachen Mausklick an die Verweisstelle
gesprungen werden kann. Dabei sollten aber nicht zu viele Links vorhanden
sein, da sonst der Leser gerne zum &quot;Springen&quot; zwischen den Seiten neigt,
jedoch nicht mehr den (vollst&auml;ndigen) Inhalt wahrnimmt.
</P>
<P>
Liegen die Anleitungen (evtl. zus&auml;tzlich) im modernen PDF-Format vor,
k&ouml;nnen sie nicht nur am Bildschirm gelesen werden, sondern auch identisch
ausgedruckt werden.
</P>
<P>
Verstehen sollte man aber auch im Speziellen die Softwareentwickler im
Amiga-Bereich. Hier wird meist der Autor des Produkts zum Schreiben des
Handbuches herangezogen oder zumindest f&uuml;r ein Funktionsger&uuml;st.
Gedruckte Handb&uuml;cher erfordern dar&uuml;ber hinaus das Layouten (Setzen) des
Textes sowie (evtl. mehrere) Probedrucke und auch Korrektuhrlesen erfordert
seine Zeit. Verst&auml;ndlich, dass bei den geringen Auflagen im Amiga-Markt
diese Zusatzkosten gerne eingespart werden.
</P>
<P>
Dagegen w&auml;re auch nichts zu sagen, wenn das Handbuch die oben
angesprochenen Punkte erf&uuml;llen w&uuml;rde. Viele Handb&uuml;cher enthalten aber
leider nur das Notwendigste. Und dieses &quot;wenige&quot; ist oft auch noch recht
technisch (also aus Programmierersicht) geschrieben, was vom Anwender daher
oft nur schwer verstanden wird. Kein Wunder also, wenn dieser lieber die
Hotline &quot;terrorisiert&quot;, als stundenlang das Handbuch zu w&auml;lzen.
</P>
<P>
Bleibt abschlie&szlig;end also nur noch der Wunsch, dass die Handb&uuml;cher
sorgf&auml;ltig erstellt werden und die Benutzer sie auch lesen.
</P>
<P><B>Michael Christoph &lt;<A HREF="mailto:michael@meicky-soft.de">michael@meicky-soft.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
