<html>
<head>
  <title>Gewinnspiel</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="intern4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="gewinnspiel2.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

Das AMIGA-aktuell-Gewinnspiel
-----------------------------

1. Ergebnisse des letzten Gewinnspiels

Beim letzten Gewinnspiel war mit 63 Einsendungen eine Rekordbeteiligung zu 
verzeichnen. Bleibt zu hoffen, dass diese H&ouml;he in den n&auml;chsten Monaten 
zumindest gehalten werden kann.


Zur Aufl&ouml;sung:


Standard-Frage: Wie hei&szlig;t die neue kommerzielle AMIGA-Textverarbeitung, die  
                im August auf den Markt gekommen ist?

Antwort: Gesucht war das Programm &quot;AMIGA Writer&quot; von Haage &amp; Partner.       
         Die Software sollte urspr&uuml;nglich &quot;Easy Writer&quot; hei&szlig;en, dieser Plan  
         wurde jedoch kurz vor Erscheinen aufgegeben, was wir in der        
         letzten Ausgabe von AMIGA aktuell auch bekanntgemacht haben.       
         Deshalb konnten wir die Antwort &quot;Easy Writer&quot;, die vereinzelt      
         genannt wurde, nicht als korrekt akzeptieren.
       
                  
Master-Frage: Wof&uuml;r steht im DF&Uuml;-Bereich die Abk&uuml;rzung &quot;TCP/IP&quot;? (Gesucht  
              sind die W&ouml;rter, die sich hinter der Abk&uuml;rzung verbergen,     
              KEINE Begriffserkl&auml;rung.)

Antwort: Diesmal hat die Mehrzahl der Teilnehmer auch die L&ouml;sung der        
         Master-Frage gewusst: Sie lautet &quot;Transmission Control Protocol /  
         Internet Protocol&quot;.

             
Meinungsfrage: Wie beurteilst du die bisherige Informationspoliik der       
               AMIGA-Entwicklungsabteilung AMIGA, Inc.?


Die Auswertung:

Antwort                                                Anzahl der Nennungen
---------------------------------------------------------------------------

1 (Ich bin mit der Informationspolitik sehr zufrieden.)                   0
2 (Ich bin mit der Informationspolitik eher zufrieden.)                   4
3 (Ich bin mit der Informationspolitik eher unzufrieden.)                24
4 (Ich bin mit der Informationspolitik &uuml;berhaupt nicht zufrieden.)       33

Zwei Teilnehmer haben mit &quot;5&quot; geantwortet (was das hei&szlig;en soll, d&uuml;rfte klar 
sein).


Fazit:
------

Ich glaube, es wird niemanden verwundern, dass mich dieses Ergebnis nicht 
im Geringsten &uuml;berrascht. Es zeigt in bedenklichem Umfang, wie ablehnend 
der gr&ouml;&szlig;te Teil der Anwenderschaft der (Des-)Informationspolitik von AMIGA, 
Inc. gegen&uuml;bersteht.
Auf der n&auml;chsten Monat in K&ouml;ln stattfindenden Computer '98 hat das 
Unternehmen die gro&szlig;e Chance, dies durch eigene Taten zu &auml;ndern. Aber ob es 
die nutzen wird?


Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:

1 x Vollversion von &quot;Diamond Caves II&quot;: Thomas Purtzel
1 x Vollversion von &quot;AFiloFaxPro&quot;: Gernot M&ouml;sch
1 x Vollversion von &quot;NewInstaller&quot;: Slobodan Todorovic
1 x f&uuml;r ein Jahr 5 MB Webspace: J&uuml;rgen Schneeberger
1 x acht AMIGA-FD- und -Cover-CDs: Axel Teichmann


Herzlichen Gl&uuml;ckwunsch!

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="intern4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="gewinnspiel2.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
