<html>
<head>
  <title>Vorwort</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="main.html"><img src="prev.gif" alt="PREV" border=0></a><a href="intern1.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

Vorwort
-------

Willkommen zur neuen Ausgabe von AMIGA aktuell.

Nachdem in den letzten Tagen f&uuml;r die meisten von uns wohl eher die 
politischen Ereignisse, genauer: das Ende der &Auml;ra Kohl, in den Vordergrund 
getreten war, m&ouml;chte ich eure Aufmerksamkeit nun wieder zum AMIGA lenken. 
Politik ist aber ein gutes Stichwort: Erwartungsgem&auml;&szlig; ist ein Gro&szlig;teil von 
euch mit der Informationspolitik von AMIGA, Inc. alles andere als zufrieden 
und w&uuml;nscht hier grundlegende &Auml;nderungen. Mehr dazu in der Gewinnspiel-
Rubrik.

Zum Leserbrief von Jens Illigen (E-Mail: <a href="mailto:asgard@eifel-net.net">asgard@eifel-net.net</a>) in der 
letzten Ausgabe haben sich mehrere Leser positiv ge&auml;u&szlig;ert und ihre 
Unterst&uuml;tzung angeboten, siehe Forum. Nun ist es wohl an der Zeit, dass die 
an dieser Aktion Interessierten Kontakt miteinander aufnehmen, zu diesem 
Zweck enth&auml;lt jeder Leserbrief die E-Mail-Adresse des jeweiligen Autors. 

 
Zu den internen Angelegenheiten:

* Es ist mal wieder Zeit f&uuml;r eine Umfrage! Diesmal wollen wir von euch      
  (fast) &quot;nur&quot; die Systemausstattung erfahren, die ihr verwendet. Wir       
  bitten um rege Beteiligung! Jeder Einsender nimmt mit einer zus&auml;tzlichen  
  Stimme an der aktuellen Ausgabe des Gewinnspiels teil.

* Immer wieder erreichen uns Anfragen aus dem Ausland, ob es denn keine     
  englischsprachige Version von AMIGA aktuell gibt. Wie ihr wohl wisst,     
  lautet die Antwort &quot;Nein&quot;. Aber das k&ouml;nnte sich m&ouml;glicherweise bald       
  &auml;ndern, und zwar f&uuml;r den Fall, dass sich jemand findet, der als ein       
  Hauptverantwortlicher f&uuml;r &quot;AMIGA aktuell International&quot; zu unserem        
  Redaktionsteam sto&szlig;en m&ouml;chte.
  Die Hauptaufgabe best&uuml;nde im &Uuml;bersetzen der deutschen Ausgabe ins         
  Englische, das allein reichte aber nicht: Ebenso notwendig w&auml;re es,       
  Beitr&auml;ge, die allein f&uuml;r den deutschsprachigen Raum interessant sind, zu  
  entfernen, und daf&uuml;r Meldungen, die andere L&auml;nder betreffen, zu            
  integrieren.
  Wir suchen also jemanden, der &uuml;ber gute Englisch-Kenntnisse verf&uuml;gt und   
  einen ebenso guten &Uuml;berblick &uuml;ber das Internet (insbesondere bezogen auf   
  Websites in Gro&szlig;britannien, den USA und Australien) hat. Schreibt an:     
  <a href="mailto:aakt@gmx.de">aakt@gmx.de</a>

* Gunter Hinrichsen hat einen Wettbewerb zur Erstellung eines AMIGA-        
  aktuell-Piktogramms f&uuml;r die Guide-Version vorgeschlagen. Die genauen      
  Modalit&auml;ten dieser Aktion sind noch festzulegen, aber ihr k&ouml;nnt uns ja    
  schon mal mitteilen, was ihr von Gunters Idee haltet. 

* Ein Leser hat sich bei uns nach einem PGP-Kurs erkundigt: Klaus G.        
  Schmitt aus Nepal w&uuml;rde vor allem gern mehr &uuml;ber den Umgang mit den       
  Schl&uuml;sseln, insbesondere das Hinzuf&uuml;gen &ouml;ffentlicher (sicherer) Schl&uuml;ssel  
  bzw. die richtige Weitergabe der Schl&uuml;ssel erfahren.
  Seinen Wunsch geben wir an euch weiter: Ist jemand bereit und in der      
  Lage, einen entsprechenden Workshop zu schreiben? Damit dieses            
  Unterfangen nicht genauso endet wie der vor einigen Monaten               
  vorgeschlagene C-Kurs, bitte ich dar&uuml;ber hinaus JEDEN, der an der         
  Ver&ouml;ffentlichung eines PGP-Workshops in AMIGA aktuell interessiert ist,   
  sich zu melden.

* Weiterhin gesucht werden Tester von frei kopierbarer Software. Jeder, der  
  sich f&uuml;r diese Aufgabe bereit erkl&auml;rt, wird in eine spezielle             
  Verteilerliste eingetragen und erh&auml;lt dann in unregelm&auml;&szlig;igen Abst&auml;nden    
  Test-Vorschl&auml;ge, ist aber zu nichts verpflichtet.
  Nat&uuml;rlich freuen wir uns aber genauso &uuml;ber Tests kommerzieller            
  Produkte und nicht &uuml;ber die Verteilerliste vorgeschlagener FD-Software.
  Schreibt an <a href="mailto:aakt@gmx.de">aakt@gmx.de</a> .


Viel Spa&szlig; jetzt bei dieser Ausgabe,

Euer

Carsten Schr&ouml;der

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="main.html"><img src="prev.gif" alt="PREV" border=0></a><a href="intern1.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
