<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Zweites neues Executive Update von AMIGA-Pr&auml;sident Bill McEwen</H2>
<P><B>&raquo;Executive Update: 3-Juni-2000</B></P>
<P><B>Hallo Welt:</B></P>
<P>
Heute ist der 3. Juni 2000, das Sechs-Monats-Jubil&auml;um des Tages, an dem
wir die Arbeit als stolze Besitzer von Amiga begannen.
</P>
<P>
Als wir mit Amiga in Verbindung kam, war es mit der klaren Zuversicht und
dem Ziel, die Computerei f&uuml;r immer zu ver&auml;ndern.
</P>
<P>
Dass wir ein Betriebssystem erschaffen k&ouml;nnten, welches anpassbar war und
auf den verschiedenen Plattformen laufen w&uuml;rde.
</P>
<P>
Dass Hardware sich so schnell wie m&ouml;glich weiterentwickeln k&ouml;nnte und dies
zum Vorteil des Amiga, ohne ihn einzuschr&auml;nken.
</P>
<P>
Ich wollte langfristige Partnerschaften mit Entwicklern und OEMs (Original
Equipment Manufacturer = Hersteller f&uuml;r Original-Ausr&uuml;stung) begr&uuml;nden, in
denen wir wirklich Partner und nicht Konkurrenten sein w&uuml;rden. Das wurde
erreicht, weil wir logische Ideen mit gesunden Menschenverstand in die Tat
umsetzen und hart daran arbeiten, zu diesem Ziel zu gelangen.
</P>
<P>
Nach interessantem Verlauf der Ereignisse sind wir nun hier. Und alles,
was oben gesagt wurde, liegt im Bereich des M&ouml;glichen.
</P>
<P>
Viele unter Ihnen glaubten nicht, das wir das schaffen w&uuml;rden :), und
&uuml;berfl&uuml;ssig zu erw&auml;hnen, dass wir hier sind, um auch lange zu bleiben.
Es dauert seine Zeit, um die Welt zu &uuml;bernehmen, wir planen, jeden Kunden
f&uuml;r sich &uuml;berzeugen. Nein, besser: Wir wollen jedes Mal ein Mitglied f&uuml;r
die Amiga-Familie dazu gewinnen.
</P>
<P>
Wie Viele unter Ihnen bereits wissen, bekomme ich manchmal deprimierende
und unvorteilhafte eMails und k&uuml;rzlich war so ein Morgen, als mich hunderte
negativer Nachrichten &uuml;berschwemmten.
</P>
<P>
Irgendwelche Mitglieder der Gemeinschaft f&uuml;hlten sich wohl falsch behandelt
und brachten ihren Mi&szlig;mut an die &Ouml;ffentlichkeit. Ich f&uuml;hlte mich ziemlich
schlecht, denn was immer ich auch sagte oder tat, es wurde falsch
verstanden.
</P>
<P>
Mit diesem schlechten Gef&uuml;hl nahm ich an einem kurzfristig angesetzten
Treffen mit einige Besuchern teil, die von japanischen Gesellschaften f&uuml;r
Verbraucher-Elektronik kamen.
</P>
<P>
Ich hatte sie nie vorher getroffen, aber sie hatten davon geh&ouml;rt was wir
vorhaben und sie hatten freundliche Erinnerungen an den Amiga. Nach unser
Pr&auml;sentation lehnte sich einer der Herren zur&uuml;ck und informierte mich,
dass das, was er gerade geh&ouml;rt und gesehen hatte, die erstaunlichste
M&ouml;glichkeit darstellt, die er in den letzten Jahren erfahren hatte und
dass wir genau die richtige Gesellschaft w&auml;ren, um mit ihnen zusammen zu
arbeiten. Bis dahin hatten sie uns noch nicht gesagt, dass sie, die drei
Herren, tats&auml;chlich eine Gruppe von mehr als 50 Gesellschaften f&uuml;r
Verbraucher-Elektronik repr&auml;sentieren, und dass sie nach einem Partner
f&uuml;r eine Langzeit-Bindung suchten! Ich darf sagen, sie mochten, was sie
sahen und h&ouml;rten.
</P>
<P>
Ich ging aus der Besprechung mit einer anderen Einstellung. &quot;Gib niemals
auf&quot; und &quot;Gib niemals klein bei&quot;! Halt mal, ich glaube, das hat schon
einer gesagt. Ok, was auch immer, ich werde mich nie mehr f&uuml;r den Amiga
entschuldigen. Und ebenso wenig sollte es einer von Ihnen. Es braucht uns
nicht leid zu tun, dass wir besser sind.
</P>
<P>
Wir k&ouml;nnen nicht immer die Dinge so tun, wie andere es f&uuml;r richtig halten
und wir k&ouml;nnen es auch nicht immer beim ersten Mal richtig treffen, aber
wir entwickeln uns mit unseren Pl&auml;nen und wir werden Erfolg haben!!
</P>
<P>
Wenn Sie Freunde haben, die fr&uuml;her zu Ihren User-Gruppen-Treffen kamen,
rufen Sie sie an. Wenn Sie einen &uuml;brigen Amiga bei sich stehen haben, den
Sie nicht verwenden, lassen Sie einen Freund damit erste Erfahrungen
sammeln. Wenn Sie einen Ort in Ihrer Gesellschaft haben, an dem sie damit
gl&auml;nzen k&ouml;nnen, dann tun Sie es.
</P>
<P>
Der Amiga ver&auml;nderte die Computerwelt vollst&auml;ndig mit dem Erscheinen des
A1000.
</P>
<P>
Das wollen wir wieder tun!
</P>
<P>
Heute geben wir die Herausgabe unseres ersten Produkts seit der &Uuml;bernahme
der Gesellschaft bekannt, das &quot;Amiga Software Developers Kit&quot; (Software-
Entwickler-Paket) SDK. Das ist der erste Schritt zur Schaffung der Amiga-
Welt und von Anwendungsprogrammen, die die Art, wie die Menschen zum
Computer stehen, ver&auml;ndern werden. Sie sind sich im Klaren, dass das,
wor&uuml;ber wir sprechen, weit dar&uuml;ber hinausgeht, einen Computer einzuschalten
und zu warten, warten, warten, oh @X!X, Neustart, warten, warten, und dann
mit unserem entt&auml;uschenden Programm anzufangen.
</P>
<P>
Nein, wor&uuml;ber wir reden, ist die Erschaffung einer neuen und erregenden
Rechner-Umgebung, in der Sie die Maschine einschalten und, was glauben Sie
wohl? Sie l&auml;uft!
</P>
<P>
Die Umgebung umsorgt den Anwender, anstatt dass der Anwender gezwungen ist,
eine ganz bestimmte Abfolge von Handgriffen zu tun. Und bei all diesem
bleiben wir dem Amiga treu! Wie mir immer wieder gesagt wurde, der Amiga
hat es genau richtig gemacht. Und nun wollen wir diese Verpflichtung
einl&ouml;sen.
</P>
<P>
Um keine Zweifel aufkommen zu lassen, dieses neue Produkt ist nur f&uuml;r die
Entwickler bestimmt. Es ist nicht f&uuml;r Leute, die die n&auml;chste Version des
Amiga erwarten. Es ist ein Entwickler-Paket, welches die Hilfsmittel
enth&auml;lt und den Entwickler die Starthilfe gibt bei ihrer Ausbildung
zum Schreiben des VP-(Virtual Processor)Codes und von Java.
</P>
<P>
Es ist ein Bezugssystem, um anzufangen, und in den n&auml;chsten Monaten
werden weitere Ausgaben des SDK folgen, so wie wir neue Eigenschaften
hinzu f&uuml;gen und das AmiVersum erweitern.
</P>
<P>
Falls Sie es noch nicht bemerkt haben sollten, dies ist eine &Auml;nderung
gegen&uuml;ber unserer Ank&uuml;ndigung in St. Louis am 1. April 2000. Wir hatten
urspr&uuml;nglich geplant, nur eine zusammengefasste Hardware- und Software-
L&ouml;sung zu heraus zu geben, aber wir erhielten so viele Kommentare und
eMails, dass wir auf Sie h&ouml;rten und uns entschlossen, die Zeit zu nehmen,
die Software-Version des Entwickler-Pakets f&uuml;r sich frei zu geben. Jawohl,
wir h&ouml;rten zu!
</P>
<P>
Wir haben auch unsere Pl&auml;ne bez&uuml;glich des Hardware-Teils der Ank&uuml;ndigung
ge&auml;ndert. Wir hatten vor, die alleinige Quelle der Entwickler-Box zu
sein, aber innerhalb weniger Stunden bei der St.-Louis-Show meldeten
sich zahlreiche Gesellschaften mit der Mitteilung, sie k&ouml;nnten die
Entwickler-Ger&auml;te billiger bauen. Wir h&ouml;rten auch hier auf vern&uuml;nftige
Argumente und &auml;nderten unsere Pl&auml;ne.
</P>
<P>
Wir haben uns f&uuml;r eine regionale Aufteilung entschieden und stellen gerade
eine Liste der Amiga-Dev-Box-Gesellschaften zusammen, die zum Verkauf eines
anerkannten Systems berechtigt sind.
</P>
<P>
Das sind &ouml;rtliche Gesellschaften jeweils in Ihren Bereichen und damit
sollten auch die Support- und Garantie-Angelegenheiten gekl&auml;rt sein.
</P>
<P>
Fleecy hat sich sehr angestrengt und eine ausgezeichnete Schrift verfasst,
die einen Einblick in das SDK und die M&ouml;glichkeiten bietet, wie die
Entwickler in k&uuml;rzester Zeit das Beste daraus machen k&ouml;nnen.
</P>
<P>
Sie k&ouml;nnen diese Schrift in der Amiga World oder in der Developers Support
Area (Bereich zur Entwickler-Unterst&uuml;tzung) der Website lesen.
</P>
<P>
Diejenigen, die glauben, wir sitzen nur herum, bitte ich um Aufmerksamkeit:
</P>
<P>
Zur Zeit sind mehr als eine viertel Million Programmzeilen f&uuml;r die neue
Version von Boopsi geschrieben.
</P>
<P>
Wir nennen es BOOPS. Es wird gerade getestet und optimiert und es sollte
bald zur Ver&ouml;ffentlichung bereit sein.
</P>
<P>
Wir arbeiten auch sehr intensiv an einer neuen Skript-Sprache, die AREXX
sehr &auml;hnlich ist, und wir wissen, dass jeder daran seine Freude haben
wird. Teile sind im Test und auch &uuml;ber diese Entwicklung wird in den
kommenden Wochen mehr zu erfahren sein.
</P>
<P>
Ich freue mich auch mitteilen zu k&ouml;nnen, dass Dean Brown unser Angebot
akzeptiert hat und er uns als Vollzeit-Kraft zur Verf&uuml;gung steht. Er
ist dabei, mit seiner Familie in den &quot;gro&szlig;en wei&szlig;en Norden&quot; zu ziehen,
ein weiterer positiver Zug.
</P>
<P>
Wir haben auch noch weitere talentierte Leute, aber ich darf deren Namen
erst nach der ersten Juli-Woche nennen.
</P>
<P>
Wir bereiten mit einigen Freunden eine spezielle Ver&ouml;ffentlichung zur
Java One in der n&auml;chsten Woche vor und ich denke, Sie werden Sich alle
freuen, dann mehr dar&uuml;ber zu sehen und zu h&ouml;ren.
</P>
<P>
Ich bin auch ganz begeistert &uuml;ber den neuen AmigaTainment-Bereich der
Website, der diese Woche eingef&uuml;hrt wird. Dort k&ouml;nnen Sie die Fortschritte
der Arbeiten an den Amiga-Titeln erfahren. Das sind alles Produkte, die
f&uuml;r das neue Amiga-OS entwickelt werden, und sie werden fast so schnell
fertig, wie wir es auch sind.
</P>
<P>
Die Amiga-H&auml;ndler, die sich gemeldet haben und das neue SDK ans Lager
nehmen wollen, finden Sie aufgelistet in der Dealer Section (H&auml;ndler-
Abteilung) der Website. Bitte unterst&uuml;tzen Sie sie, denn sie haben immer
den Amiga unterst&uuml;tzt.
</P>
<P>
Wir &uuml;bernahmen Amiga am 3. Januar 2000 und sechs Monate sp&auml;ter haben Sie,
wie wir Ihnen versprachen, eine neue Entwickler-Plattform.
</P>
<P>
In den n&auml;chsten Monaten gibt es weitere Ank&uuml;ndigungen, neue
Partnerschaften, &Auml;nderungen auf der Website und Entwickler-Updates.
</P>
<P>
Ich wei&szlig;, das unser Schweigen &auml;u&szlig;erst frustrierend sein kann und es
bestimmte Leute gibt, die daraus ihre Vorteile zu ziehen versuchen,
aber ich will keine Vorank&uuml;ndigungen machen und falsche Hoffnungen und
Erwartungen wecken.
</P>
<P>
Davon gab es in der Vergangenheit viel zu viel und wir k&ouml;nnen es uns nicht
leisten, f&uuml;r diese S&uuml;nden immer noch zu b&uuml;&szlig;en. Wir wollen uns gemeinsam
auf den vor uns liegenden Weg machen.
</P>
<P>
So, meine Freunde, heute bin ich 38 Jahre alt. Es ist mein Geburtstag und
ich w&uuml;sste keine bessere M&ouml;glichkeit ihn mit Euch zu feiern als eben so.
Nun, tats&auml;chlich gibt es welche, aber die haben mit Amiga nichts zu tun!
</P>
<P>
Ich danke Gott daf&uuml;r, dass wir es bis hierhin geschafft haben, aber das
ist tats&auml;chlich nur ein kleiner Ausblick auf das, was noch kommen wird,
wir haben uns noch viel gr&ouml;&szlig;ere Ziele gesetzt.
</P>
<P><B>Mit besten Gr&uuml;&szlig;en,</B></P>
<P>
Bill McEwen und das Amiga Team.
</P>
&gt;&lt;&gt; Bill McEwen &gt;&lt;&gt;<BR>
President/CEO<BR>
Amiga Incorporated<BR>
Tel 425-396-5660<BR>
Fax 425-396-5671<BR>
<A HREF="mailto:bill@amiga.com">bill@amiga.com</A>&laquo;<BR>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</p><p>
(Quelle des Originals: AMIGA Inc.)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
