<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Neues von AMIGA</H1>
<H2>1. Erstes neues Executive Update von AMIGA-Pr&auml;sident Bill McEwen</H2>
<P>
Ende Mai wandte sich AMIGA-Pr&auml;sident Bill McEwen mit einem neuen Executive
Update an die Anwender. Es folgt eine deutsche &Uuml;bersetzung, die uns
freundlicherweise von Amiga-News.de zur Verf&uuml;gung gestellt wurde und unter
der URL <A HREF="http://www.amiga-news.de/archiv/000531.shtml" TARGET="_top">http://www.amiga-news.de/archiv/000531.shtml</A> vorliegt:
</P>
<P>
&raquo;Original: <A HREF="http://www.amiga.com/corporate/053000-mcewen.shtml" TARGET="_top">http://www.amiga.com/corporate/053000-mcewen.shtml</A>
&Uuml;bersetzung: Martina Jacobs
</P>
<P>
Executive Update, 30. Mai 2000
</P>
<P><B>Freunde:</B></P>
<P>
Viele Leute schrieben mich k&uuml;rzlich an und erinnerten mich daran, dass sich
bei den Updates sehr wenig getan hat. Da dies hier nicht als offizelles
Executive Udate gedacht ist, m&ouml;chte ich nur jedem versichern, dass es bei
Amiga seit der Amiga 2k Show in St. Louis vor ein paar Monaten wirklich
sehr viele Aktivit&auml;ten gegeben hat. Wie gew&ouml;hnlich gibt es Dinge &uuml;ber die
wir noch nicht sprechen k&ouml;nnen, aber missdeuten Sie unser Schweigen
niemals als &quot;Schlafen&quot;.
</P>
<P>
&Ouml;ffentlich k&ouml;nnen sie unsere Amiga.com-Seite f&uuml;r das neue Executive Update,
neue Informationen f&uuml;r Entwickler und zu Applikationen beobachten, sowie
f&uuml;r verschiedene andere Updates, die am 3. Juni 2000 ver&ouml;ffentlicht
werden.
</P>
<P>
F&uuml;r das n&auml;chste Update k&ouml;nnen Sie sehr viel mehr Informationen und
Einzelheiten &uuml;ber unsere unmittelbaren Pl&auml;ne erwarten, als in dieser
Meldung zu finden sind. W&auml;hrend wir auf dieses Update noch so etwa eine
Woche warten k&ouml;nnten, dachte ich, die Gemeinde muss von uns etwas h&ouml;ren,
um zu erfahren, was wir momentan sagen k&ouml;nnen und um Sie um noch ein wenig
Geduld zu bitten.
</P>
<P>
Ein kritischer Punkt, der gerade jetzt angesprochen werden muss, ist der
Name Amiga, Warenzeichen, Logos und geistiges Eigentum. Viele von Ihnen
schickten mir Hinweise und baten darum, etwas gegen die zu unternehmen,
die illegale Kopien unserer Software herstellen, solche verwenden oder
unseren Namen ohne unsere Zustimmung nutzen und unser geistiges Eigentum
ohne unser Wissen und unser Einverst&auml;ndnis vertreiben.
</P>
<P>
Obwohl dies f&uuml;r viele als negativ erscheinen mag, so ist es doch zwingend
notwendig, dass Amiga unsere Warenzeichen und unser geistiges Eigentum
rechtlich genau verteidigt. Um es geradeheraus zu sagen und auf den Punkt
zu bringen, wenn Sie den Namen Amiga bzw. Amiga-Logos verwenden oder unser
geistiges Eigentum ohne Lizenz vertreiben, so m&uuml;ssen Sie diese Aktivit&auml;ten
sofort einstellen. Amiga Incorporated ist im Bestitz der oben erw&auml;hnten
Gegenst&auml;nde und aller darin enthaltenen Rechte. Einige versuchten sogar
den Namen Amiga zur F&ouml;rderung ihrer eigenen Produkte und Ziele
einzusetzen. Deshalb und aufgrund internationaler Warenzeichengesetze,
m&uuml;ssen wir sicherstellen, dass jeder, der unseren Namen, unsere Logos bzw.
Warenzeichen in irgendeiner Weise verwendet, durch uns ordnungsgem&auml;ss
lizensiert ist.
</P>
<P>
Okay, nachdem wir das gesagt haben, ist da noch das Amiga SDK (Software
Developers' Kit)!
</P>
<P>
Auf der Amiga 2k Show k&uuml;ndigte Amiga am 1. April 2000 die Entwicklerbox und
unsere Partnerschaft mit der TAO Group in England an. Um ganz ehrlich zu
sein, die Anzahl der Entwickler, die auf der Show und kurz danach auf uns
zukamen und das Software Developer Kit (SDK) getrennt von der Hardware
kaufen wollten, um dieses auf ihren eigenen Rechnern laufen zu lassen, hat
uns v&ouml;llig &uuml;berrascht.
</P>
<P>
Nun, wir haben zugeh&ouml;rt und werden in nur wenigen Tagen die Herstellung des
neuen Amiga SDK in Gang bringen.
</P>
<P>
Mehr Informationen dazu wird es am Wochenende des 3. Juni auf der Seite
geben.
</P>
<P>
Bitte notieren Sie sich, dass das SDK zum Preis von 99,- US-Dollar verkauft
werden wird. Das SDK wird bei Ihrem Amiga-H&auml;ndler und anderen Quellen
erhl&auml;ltlich sein, die bald genannt werden.
</P>
<P>
Es passiert wirklich was bei Amiga. Es gibt neue Applikationen, neue
Mitarbeiter, neue Partnerschaften und neue Produkte.
</P>
<P>
Das Jahr 2000 ist dabei eine wirklich aufregende Zeit zu werden. Ich freue
mich darauf, in den kommenden Monaten viele von Ihnen auf den
verschiedenen Verkaufsmessen, bei Veranstaltungen, am Telefon, per Fax und
Emails zu treffen. Ich kann Ihnen versprechen, mit Erscheinen des SDK
werden Sie sehen, wie Amiga sehr viel aggressiver wird, und sich sehr viel
schneller in Richtung Zukunft bewegt.
</P>
<P>
Nochmals Danke f&uuml;r die fortw&auml;hrende Unterst&uuml;tzung und besuchen Sie ganz
bestimmt die Amiga.com Seite am Wochenende des 3. Juni.
</P>
<P>
Ergebenst,<BR>
Bill McEwen und der Rest des Amiga-Teams&laquo;<BR>
</P>
<P>
(Quelle des Originals: AMIGA Inc.)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
