<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Neuigkeiten von APC&amp;TCP</H2>
<P><B>APC&amp;TCP (<A HREF="http://www.apc-tcp.de" TARGET="_top">http://www.apc-tcp.de</A>) informiert:</B></P>
<P>
&raquo;APC&amp;TCP wird die APC&amp;TCP-CD-Volume-3 die lange Zeit ausverkauft war auf
der Messe in Neuss zum ersten mal seit l&auml;ngerer Zeit wieder anbieten.&laquo;
</P>
<P>
&raquo;APC&amp;TCP wird auf der Messe in Neuss ein weiteres neues Produkt f&uuml;r den
Amiga ver&ouml;ffentlichen. Es handelt sich dabei um die neue CD-ROM aus der
Reihe Scene Archives. The Scene Archives 10 ist wie immer randvoll mit
Scene-Material f&uuml;r den Amiga gef&uuml;llt. Dieses mal befindet sich auch das
Programm SASU mit auf der CD-ROM. Erh&auml;ltlich ist diese CD-ROM f&uuml;r DM 29.95
ab der Messe Neuss bei APC&amp;TCP. Sp&auml;ter nat&uuml;rlich auch im Fachhandel.
Vorbestellungen k&ouml;nnen entgegen genommen werden.
</P>
APC&amp;TCP<BR>
Postfach 83<BR>
D-83236 &Uuml;bersee<BR>
<A HREF="mailto:Andreas@apc-tcp.de">Andreas@apc-tcp.de</A><BR>
<A HREF="http://www.apc-tcp.de" TARGET="_top">http://www.apc-tcp.de</A>&laquo;<BR>
<P>
&raquo;P&uuml;nktlich zur Amiga-Messe in Neuss pr&auml;sentiert APC&amp;TCP eine weitere neue
CD-ROM mit den wunderbaren Namen Faces of Mars 2001:
</P>
<P>
Faces of Mars 2001 ist die CD-ROM-Collection der Faces of Mars-PD-Serie,
sie beinhaltet das Beste der mehr als 500 Disketten. Alle Programme sind
unter OS 3.5 getestet worden. The Spiele, Tools, Bilder, Animationen, Mods
und Texte k&ouml;nnen unter den folgenden Hauptarchiven gefunden werden: 1982
(Spieleklassiker), Babylon 5, Esotherik, Fantasy, Faces of Mars, Games,
History, Jokes, Mathematics, Misc, Science, Science Fiction, Space, Star
Trek und Star Wars.
</P>
<P>
Also Bonus f&uuml;r Internetuser gibt es weiteres, wie eine kostenlose
Internetadresse, einen Link zur Homepage, sowie The Portal, der Startseite
f&uuml;r das Web, inkl. EMail, Suchmaschine, Nachrichten, Webcards und E-
Commerce.
</P>
<P>
Zwei Audiotracks k&ouml;nnen auf einem normalen CD-Player abgespielt werden:
fom2001 und They came from Outer Space!
</P>
<P>
Weitere Informationen auf unserer Homepage <A HREF="http://www.apc-tcp.de" TARGET="_top">http://www.apc-tcp.de</A> oder bei
<A HREF="mailto:Andreas@apc-tcp.de">Andreas@apc-tcp.de</A>&laquo;
</P>
<P>
&raquo;APC&amp;TCP senkt zur Messe in Neuss von vielen Produkten die empfohlenen
Verkaufspreise. Ausf&uuml;hrliche Informationen hierzu findet man im Support-
Bereich der APC&amp;TCP-Homepage.
</P>
Databench inkl. Relation DM 39.95 --&gt; DM 29.95<BR>
Digi Booster Pro DM 99.95 --&gt; DM 89.95<BR>
1990-93er Edition DM 39.95 --DM 29.95<BR>
1990-94er Edition (PC) DM 39.95 --&gt; DM 29.95<BR>
95er Datendisk DM 14.95 --&gt; DM 9.95<BR>
GTT DM 19.95 --&gt; DM 4.95<BR>
Marblelous 1 DM 9.95 --&gt; DM 4.95<BR>
Marblelous 2 DM 39.95 --&gt; DM 29.95<BR>
Jaktar DM 39.95 --&gt; DM 29.95<BR>
Testament DM 39.95 --&gt; DM 29.95<BR>
Flyin High CD or Disk DM 69.95 --&gt; DM 59.95<BR>
Flyin High Data 1 or 2 DM 29.95 --&gt; DM 24.95<BR>
GunBee F99 DM 49.95 --&gt; DM 39.95<BR>
Games Attack CD DM 39.95 --&gt; DM 29.95<BR>
Pinball Brain Damage CD or Disk DM 69.95 --&gt; DM 59.95<BR>
<P>
Achtung! Epic UK (nicht Epic Deutschland!!) wird seit ca. einem jahr nicht
mehr von uns beliefert und bekommt auch von Zwischenh&auml;ndlern keine Software
aus unserem Hause. Epic UK ist somit nicht in der Lage auf legale Art und
Weise Software aus dem Hause APC&amp;TCP anzubieten und zu verkaufen.
Evtl. Lagerbest&auml;nde unserer Software die Epic evtl. noch besitzen sollte
(was nach dieser Zeit allerdings unm&ouml;glich ist) sind nicht bezahlt und
somit nicht Eigentum von Epic UK.
</P>
<P>
Wir bitten alle User auf gar keinen Fall Software bei Epic UK zu kaufen!
Unsere Software ist im England &uuml;ber GTI &uuml;berall im Handel erh&auml;ltlich.
Au&szlig;erdem findet man auf unserer Homepage eine (nicht vollst&auml;ndige) Liste
von H&auml;ndlern die unsere Software verkaufen.
</P>
<P>
User die die letzten 6 Monate Software von usn bei Epic UK gekauft haben
sollen sich doch bitte bei APC&amp;TCP melden.
</P>
<P>
Bitte nicht verwechseln: Epic Deutschland hat mit dieser Sache nichts zu
tun. Es handelt sich hier rein um Epic UK!!&laquo;
</P>
<P>
&raquo;APC&amp;TCP ver&ouml;ffentlicht auf der Amiga-Messe in Neuss eine weitere CD-ROM.
Weitere Informationen sind auf unserer Honepage oder direkt bei uns
erh&auml;ltlich. Nach der Messe wird diese CD-ROM wie alle unsere Produkte im
Handel sein:
</P>
<P>
Willkommen im Kleiderschrank Ihrer neuen Workbench.
Die neue &quot;Digital Make-Up&quot; CD ist eine Add-On-CD mit einer
thematisch sortierten Ladung von Tools und Utilities zum
Versch&ouml;nern und tunen des Amiga-Betriebssystems.
Hier sind nicht nur m&auml;chtige Werkzeuge versammelt, die
das AmigaOS so richtig in Fahrt bringen und die t&auml;gliche
Arbeit stark vereinfachen, - es wurde auch an Grafikmaterial
f&uuml;r die alltagsgraue Workbench gedacht. Zus&auml;tzlich
gibt es Software, um Sprachausgabe zu realisieren.
Entsprechende Sprach- und Soundsamples in unterschiedlichen
Formaten fehlen selbstverst&auml;ndlich ebenfalls nicht.
Viele Datatypes, aktuelle Librarys, moderne Schriftarten,
neue Befehle f&uuml;r das C-Verzeichnis und unz&auml;hlige andere
Systemerweiterungen bringen jedes Amigasystem auf
den richtigen Kurs. Neue tolle Bildschirmschoner und
viele Iconsets f&uuml;r das NewIconsystem, oder auch
brandneue GlowIcons verpassen der Workbench ein
modernes Aussehen. Zum Teil bisher unver&ouml;ffentlichte
Software finden Sie erstmals auf dieser CD-ROM.
Dem neuen AmigaOS Version 3.5 haben wir ein
Extraverzeichnis spendiert, wo die neusten
Tools zur aktuellen Version zu finden sind.
</P>
<P>
Einen Doppelklick auf &quot;Quickstart&quot; und schon sind Sie
mitten drin - in der &quot;Digital Make-Up CD&quot; !
</P>
<P>
Die &quot;Digital Make-Up CD&quot; ist optimiert f&uuml;r
das AmigaOS Version 3.0 bis 3.5. Der Gro&szlig;teil der
Software auf dieser CD-ROM l&auml;&szlig;t sich direkt aufrufen.
</P>
<P>
Systemanforderungen:
Amiga mit 68020-Prozessor, 2 MByte ChipRAM, Festplatte,
CD-ROM-Laufwerk, AmigaOS ab Version 2.05
</P>
<P>
Empfehlungen:
Amiga mit 68040-Prozessor + PPC-Prozessor, 2 MByte ChipRAM,
4 MByte FastRAM, Festplatte, CD-ROM-Laufwerk,
AGA-Grafik-Chipsatz oder Grafikkarte, Soundkarte,
AmigaOS Version 3.5&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
