<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
26 Leser hatten das letzte Mal bei unserem Gewinnspiel mitgemacht. Bitte
denkt auch diesmal wieder an die Teilnahme. Ihr wisst ja, dass man auch
schon mit zwei Antworten gewinnen kann.
</P>
<P><B>Jetzt aber zur Aufl&ouml;sung:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Standard-Frage:&nbsp;</TD><TD VALIGN="TOP">Wie hei&szlig;t das von AMIGA herausgegebene Online-Magazin,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">dessen Erstausgabe im April erschienen ist?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Antwort: Der richtige Name lautet &raquo;Amiga World&laquo;
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Master-Frage:&nbsp;</TD><TD VALIGN="TOP">Nenne zwei NICHT x86-kompatible Prozessorreihen, auf denen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">das Betriebssystem des Amiga der n&auml;chsten Generation&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">nach Angaben AMIGAs lauff&auml;hig sein wird.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Hier waren mehrere Antwort-Kombinationen m&ouml;glich, beispielsweise&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">MIPS und PowerPC.&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Meinungsfrage:&nbsp;</TD><TD VALIGN="TOP">Wie beurteilst du, dass das neue Amiga-Betriebssystem auch&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">auf x86-Systemen lauff&auml;hig sein wird?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Die Auswertung:</B></P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">1 (Positiv.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">19&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Negativ.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">4&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3 Leser konnten sich nicht zwischen 1 und 2 entscheiden bzw. haben die&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Meinungsfrage nicht beantwortet.&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Einige Einsender hatten zu ihrer Beantwortung der Meinungsfrage Stellung
bezogen:
</P>
<P>
Rainer Traub hat mit Antwort &quot;1 - Positiv&quot; gestimmt: &raquo;Ich finde es gut,
dass das neue Amiga-Betriebssystem auch auf x86-Systemen lauff&auml;hig sein
wird, da es dadurch sicher schnell eine gro&szlig;e Verbreitung findet.
Schlie&szlig;lich benutzt doch heutzutage schon fast jeder einen PC, und wenn er
von ALDI ist...&laquo;
</P>
<P>
Thomas K&ouml;lsch betont, dass man nicht auf einen x86-Prozessor angewiesen
sein wird: &raquo;Ich habe zwar immer noch eine Abneigung gegen x86, aber da ich
diesen ja nicht benutzen mu&szlig;, ist es mir egal. Hauptsache, es werden neue
User und Developer dadurch gewonnen.&laquo;
</P>
<P>
Klaus Moddemann ist f&uuml;r x86 und sieht die Chancen des AmigaNG durch die
j&uuml;ngsten Virenangriffe erh&ouml;ht: &raquo;Ich denke, es ist positiv, dass das neue OS
auch auf x86-Hardware laufen wird, da Amiga so mehr Anwender erreichen
kann. Die neuerlichen Virusattacken auf Windowssysteme erh&ouml;hen die Chancen
auf einen Erfolg, denn wer m&ouml;chte schon ein System, auf das es sehr viele
Virenprogrammierer abgesehen haben.&laquo;
</P>
<P>
Auch Volker Grabbe stimmt der Unterst&uuml;tzung von x86-Hardware zu: &raquo;AmigaNG
auf x86?
Ja, die gute Verf&uuml;gbarkeit von Komponenten wie aktuellen Motherboards und
damit bedingte Unterst&uuml;tzung der neuesten Entwicklungen (DDR-RAM etc. )
sorgt f&uuml;r einwandfreie Systeme. Zumal man heute nicht unbedingt Intel
verwenden mu&szlig;. Als CPU-Hersteller ebenfalls sehr gut (momentan was die
Lieferf&auml;higkeit angeht sogar weitaus besser als Intel) ist AMD und vor
allem im Low-Cost-Bereich mit seinen neuen DURON-CPUs erste Wahl. Als
Chipsatzhersteller gibt es dort nur die Firma VIA, ebenfalls ein Intel-
Mitbewerber, der aber auch mit einer eigenen CPU aufwarten kann (Cyrix
III), diese aber dem Duron und selbst dem Intel Celeron nicht das Wasser
reichen kann.
</P>
<P>
Vor allem kann man dann seine Zusatzhardware wieder im Laden um die Ecke
kaufen!&laquo;
</P>
<P>
André K&ouml;hler ist unschl&uuml;ssig: &raquo;Bei der Meinungsumfrage kann ich mich nicht
entscheiden, da die Vorteile (weite Verbreitung des x86-System) und die
Nachteile (BIOS - Festplattenerkennung, usw.) sich aufheben.&laquo;
</P>
<P>
Gernod Schomberg meint: &raquo;Schon vor 10 Jahren, als ein Computer-Freund von
mir voll auf PC abgefahren war, hatte ich ihm gesagt, gegen einen PC als
Rechner h&auml;tte ich gar nichts, wenn nur das Betriebssystem etwas &auml;hnliches
w&auml;re wie AmigaOS. Und diese Meinung verst&auml;rkte sich immer mehr mit dem
Aufkommen von Windows.
</P>
<P>
Es ist ja nicht der Prozessor, der aus dem PC so ein unhandliches Ger&auml;t
macht, sondern das unf&ouml;rmige Windows-Betriebssystem. Bis Windows 3.1 konnte
man noch selbst etwas tun, auch wenn es schon &uuml;ber 10 MBytes brauchte, um
&uuml;berhaupt laufen zu k&ouml;nnen, aber wenn ich bei meinem Freund erlebe, dass er
nach Einsetzen einer &quot;Plug'n Play&quot;-Soundkarte und Win95 erst mal von der CD
zig MB herunter laden mu&szlig;, weil sein Rechner nicht mehr arbeiten will, dann
kann ich das nicht mehr als brauchbares System ansehen. Beispiele lie&szlig;en
sich noch beliebig bringen, aber auch &quot;ILOVEYOU&quot; war doch nur m&ouml;glich, weil
Micro$oft in ihren Internet-Programmen die M&ouml;glichkeit zum Zugriff auf den
Rechner eingebaut hat!
Die x86er Prozessoren bringen durchaus ihre Leistung. Die Custom-Chips, die
dem Amiga zu den damals einmaligen F&auml;higkeiten verholfen haben, sind jetzt
auf den Grafik- und Ton-Platinen auch gut aufgehoben. Und ein schlankes
AmigaNG-Betriebssystem wird von den Geschwindigkeiten, zu denen diese
Prozessoren getrieben wurden, um Windows9x &uuml;berhaupt m&ouml;glich zu machen,
auch nur profitieren.&laquo;
</P>
<P>
Fritz Trampnau tr&auml;umt von einem &quot;68200-Amiga&quot;: &raquo;Nun ja, was soll
Man(n)/Frau machen? Der&quot; Wintel-Prozi&quot;, ist nun mal einer der billigsten,
au&szlig;erdem auch noch schnell, aber eben halt kein AMIGA.  Das wirklich
schlimme daran ist, da&szlig; die neuen &quot;AMIGAs&quot;, fortan in jeder &quot;Dosen-Kiste&quot;,
laufen werden! (Schauder) Mir w&auml;re ein echter &quot;68ooo-er&quot;, auch lieber
gewesen (z.b. 682oo mit 800 MHz) - gibt's aber nicht, wie bekannt war bei
68o6o &quot;Schlu&szlig;&quot;! Da hilft kein Jammern - schau'n wir 'mal, was kommt - wie's
ausgeht!&laquo;
</P>
<P>
Daniel Pisanec schreibt: &raquo;Ich finde es eher &quot;positiv&quot;, dass das neue
AmigaOS auch auf x86-Systemen laufen wird, und zwar aus dem ganz einfachen
und triftigen Grund:
Dadurch kann Amiga eine SEHR VIEL BREITERE Masse ansprechen. Dadurch
bekommen wir viel mehr K&auml;ufer, da diese nicht noch teure Hardware kaufen
m&uuml;ssen.
</P>
<P>
Mit anderen Worten: Amiga wird durch die Portierung zu x86 erfolgreicher!&laquo;
</P>
<P>
Oliver Tacke ist geteilter Meinung: &raquo;Das mit der Lauff&auml;higkeit auf x86
Prozessoren ist so eine Sache. Amiga wird selbst keine Hardware herstellen.
Entschlie&szlig;t sich aber ein Drittentwickler, einen Desktop-Rechner auf nicht-
x86-Basis zu bauen, so mu&szlig; er zwangsweise irgendwie den Leuten klarmachen,
dass dieser mit den preislich billigen x86 konkurrieren kann. Nicht ganz
einfach. Andererseits er&ouml;ffnet die x86-Lauff&auml;higkeit nat&uuml;rlich einen gro&szlig;en
potentiellen Kundenkreis im Desktopmarkt.&laquo;
</P>
<P>
Holger Biehl sieht die Sache positiv: &raquo;F&uuml;r die meisten gegenw&auml;rtigen Amiga-
User sind andere Prozessorfamilien als die x86er-Reihe wahrscheinlich
interessanter, aber die x86er ist wahrscheinlich die einzige M&ouml;glichkeit,
schnell neue User und Entwickler zu erreichen (denn kaum einer w&uuml;rde sich
einen komplett neuen Rechner kaufen, auf dem bis auf ein Betriebssystem,
f&uuml;r das es (noch) kaum Software gibt, nichts l&auml;uft).
</P>
<P>
Aber da das neue System ja komplett plattformunabh&auml;ngig (&uuml;ber einen
virtuellen Prozessor) l&auml;uft, kann sich jeder den Prozessor nehmen, der
ihm gef&auml;llt.&laquo;
</P>
<P>
Jean Holzammer kritisiert: &raquo;Blo&szlig; zwei Auswahlm&ouml;glichkeiten f&uuml;r die
Masterfrage? Ich denke, die Lauff&auml;higkeit auf x86 neben einer Vielzahl von
anderen Plattformen hat weder besonders positive noch besonders negative
Auswirkungen auf Erfolg/Mi&szlig;erfolg des Produkts.&laquo;
</P>
<P>
Dieter Klingschat fasst seine Meinung in einen Satz: &raquo;Ich glaube, da&szlig; in
der x86-Hardwareplattform mehr drinsteckt, als das veraltete und &uuml;berladene
WINDOWS dort herausholt (Beweis: BeOS)!&laquo;
</P>
<P>
Christian Aichinger hat eine gute Begr&uuml;ndung f&uuml;r seine Zustimmung: &raquo;Das
finde ich ganz gut. Da bekommen die armen PC-User endlich mal ein richtiges
Betriebssystem in die H&auml;nde ;).&laquo;
</P>
<P>
Thomas Mitzschke fand die Frage offenbar nicht sehr interessant, da sein
Statement sich mit einem anderen Thema besch&auml;ftigt: &raquo;Ich glaube, da&szlig; die
AMIGA-Gemeinde in letzter Zeit sehr zur&uuml;ckhaltend auf Neuank&uuml;ndigungen
reagiert.
</P>
<P>
Ein Grund sehe ich in den Ank&uuml;ndigungen der letzten Zeit, besonders im
Hardware-Bereich, die mehr oder weniger in Schall und Rauch aufgegangen
sind.
</P>
<P>
Auch die Art und Weise, wie man neue Produkte vermarktet - erst Geld und
dann wird vielleicht hergestellt, liegt mir pers&ouml;nlich gar nicht, besonders
wenn diese Firma dann vor dem AUS steht und das eingezahlte Geld futsch
ist.
</P>
<P>
Ich habe mich entschieden, an meinem jetzigem System nicht mehr so viel zu
investieren und mein Geld lieber in ein neues AMIGA-Hardware-System zu
stecken.&laquo;
</P>
<P><B>Fazit:</B></P>
<P>
Das Ergebnis ist eindeutig. Eine gro&szlig;e Mehrheit stimmt der Unterst&uuml;tzung
der x86-Prozessorreihe zu. Vorteile werden vor allem aufgrund der gro&szlig;en
Verbreitung dieser CPUs gesehen.
</P>
<P>
Zwar gibt es zum Teil auch kritische Stimmen, der oftmals vermutete &quot;x86-
Hass&quot; scheint unter den Amiga-Anwendern jedoch so gut wie nicht zu
existieren.
</P>
<P>
Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;CDCat&quot;: Fritz Trampnau&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;Future Drive Accelerator&quot;: Klaus Moddemann&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Texterkennungssoftware &quot;Migraph OCR&quot;: Sascha van Wahnem&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Herzlichen Gl&uuml;ckwunsch!</B></P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
