<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses11.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
Entwicklerkit und Markenschutz - zwei wichtige Amiga-Themen dieser Tage
</P>
<P>
In diesen Tagen macht AMIGA seine Ank&uuml;ndigung vom 1. April wahr und liefert
das Developerkit aus. Damit ist ein wichtiger Schritt hin zum Amiga der
n&auml;chsten Generation getan: Ab sofort kann jeder Entwickler seine Software
f&uuml;r das neue System portieren oder auch v&ouml;llig neue Programme schreiben.
Bereits am Anfang stellt das Developerkit mehrere Programmiersprachen zur
Verf&uuml;gung - und mit der Zeit werden immer mehr Implementierungen
hinzukommen.
</P>
<P>
AMIGA ist dabei, eine Reihe von Support-Strukturen zu schaffen, um
Programmierern zum einen mit Rat zur Seite zu stehen und zum anderen das
notwendige Ma&szlig; an Koordination der Entwicklungsbem&uuml;hungen zu gew&auml;hrleisten.
Jetzt sind die vielen Coder gefragt, die f&uuml;r den bisherigen Amiga Software
geschrieben haben und das zum Teil immer noch tun: Je mehr Programmierer
bereits vor Erscheinen des AmigaNG f&uuml;r ihn entwickeln, desto gr&ouml;&szlig;er wird
der strategische Vorteil sein, der ihm im Vergleich zu anderen
Betriebssystemneuentwicklungen daraus erw&auml;chst. Denn oftmals scheitert ein -
von der Qualit&auml;t nicht selten gutes - neues OS an der selbst nach Monaten
noch sehr d&uuml;rftigen Softwareauswahl. Und das darf beim neuen Amiga-
Betriebssystem auf keinen Fall passieren.
</P>
<P>
Ein zweites Thema, das in den letzten Wochen aktuell geworden ist und nicht
wenige Amiga-Anwender ver&auml;rgert hat, ist die Markenschutz-Politik von
AMIGA. Um es kurz zu machen: Das Unternehmen hat keine andere Wahl, als
penibel auf die Einhaltung seiner Markenrechte zu achten. Andernfalls
besteht n&auml;mlich aufgrund der US-Gesetzgebung die Gefahr, dass der
Gesellschaft der alleinige Anspruch auf die Marke &quot;Amiga&quot; aberkannt wird,
fortan also auch ein vollkommen anderes Produkt eines beliebigen
Herstellers unter dieser Bezeichnung auf den Markt gebracht werden d&uuml;rfte -
der Schaden f&uuml;r AMIGA w&auml;re immens, nicht umsonst hat das Unternehmen
Millionen US-Dollar haupts&auml;chlich f&uuml;r die gleichnamige Marke ausgegeben.
&Uuml;brigens gab es auch in anderen L&auml;ndern schon solche und &auml;hnliche F&auml;lle: In
Deutschland beispielsweise war &quot;Selters&quot; fr&uuml;her eine gesch&uuml;tzte Marke, bis
der Name allm&auml;hlich immer mehr zum Synonym f&uuml;r &quot;Mineralwasser&quot; wurde.
Daraufhin wurde der Markenschutz gegen den Widerstand des
Getr&auml;nkeherstellers gerichtlich aufgehoben.
</P>
<P>
Nach diesem Abstecher aber wieder zur&uuml;ck zu AMIGA. Wer dessen Markennamen
oder Logo f&uuml;r ein eigenes Projekt verwendet oder verwenden will, muss dazu
das Einverst&auml;ndnis des Unternehmens einholen. Entsprechende Mails sind mit
dem Betreff &quot;Trademark&quot; an <A HREF="mailto:gary@amiga.com">gary@amiga.com</A> zu richten.
</P>
<P>
AMIGA aktuell hat das &uuml;brigens bereits getan, und die Erlaubnis zur Nutzung
von Logo und Markenname wurde schnell und unb&uuml;rokratisch gegeben.
</P>
<P>
In eigener Sache weise ich zum Schluss auf eine kleine, f&uuml;r die Zukunft
dieses Magazins aber sehr wichtige, Umfrage hin, die wir in dieser Ausgabe
durchf&uuml;hren. Ich bitte euch ALLE, die paar Minuten zu investieren und an
ihr teilzunehmen. Danke.
</P>
<P><B>Bis n&auml;chsten Monat,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses11.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
