<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. Nachtrag zum Heretic II-Preview (von Steffen H&auml;user)</H2>
<P>
Einige n&auml;here Details zur Geschwindigkeit... wobei man nat&uuml;rlich
immer sagen muss, dass was &quot;fl&uuml;ssig&quot; ist, immer sehr subjektiv ist.
Meine eigene Vorstellung von &quot;fl&uuml;ssig&quot; ist hierbei eine fps von
mindestens 15 fps, besser 25 fps, und zwar *unabh&auml;ngig von der derzeitigen
&quot;Stelle&quot; im Spiel, also &uuml;berall !!!
</P>
<P>
Es sollte auch erw&auml;hnt werden, dass das Spiel auf AGA ganz klar auf
320x256 eingeschr&auml;nkt ist. AGA im HAM8 Modus ist einfach nicht schnell
genug, um etwas h&ouml;heres als 320x256 hinzukriegen (in 320x256 kriege ich
hier jedoch etwa 21 fps wenn ich das Spiel unter AGA laufen lasse...
in einer &quot;durchschnittlichen&quot;  Szene...)
</P>
<P>
320x256 fl&uuml;ssig im AAKT Artikel =&gt; Das bezieht sich klar auf den
Softwarerenderer. Auf sehr schnellen PPC (200 MHz 604e oder schneller)
l&auml;uft es zweifelsfrei auch in 400x300 sehr fl&uuml;ssig. Manche Leute finden
durchaus auch 640x480 hier noch fl&uuml;ssig.  (Aber ich habe nur eine 150 MHz
Karte, daher mach ich bei mir kein 640x480...)
</P>
<P>
Der Hardware-Renderer l&auml;uft in 400x300 fl&uuml;ssig, auf sehr flotten Systemen
auch in 640x480. Und ich habe durchaus auch schon Leute geh&ouml;rt, die meinten
es liefe in 800x600 im Hardware-Renderer fl&uuml;ssig... alles sehr subjektiv,
welche fps Rate man fl&uuml;ssig nennt.
</P>
<P>
Zum Hardware-Renderer sei auch noch angemerkt, das au&szlig;er der
durchschnittlichen Framerate auch die MINDEST-Framerate sich verbessert
(was schwer zu messen ist, aber deutlich auf das &quot;Fl&uuml;ssig-Gef&uuml;hl&quot;
einwirkt). Au&szlig;erdem sieht der Hardwarerenderer wesentlich besser aus.
</P>
<P>
Es sollte angemerkt werden, dass 640x480 16 Bit so ziemlich das
Maximum ist, was der Permedia 2 vern&uuml;nftig hinkriegt. F&uuml;r mehr is der
Chip zu lahm. Eine modernere Grafikkarte w&uuml;rde da Wunder wirken.
</P>
<P>
Aber wie gesagt: Was &quot;Fl&uuml;ssig&quot; ist, ist sehr abh&auml;ngig vom pers&ouml;nlichen
Empfinden. Ich etwa spiele Heretic II in 400x300, obwohl ich nur eine
150 MHz Karte habe (aber 604e). Im Netzwerkmodus gehe ich dann aber auf
Lowres, um jede noch so geringe Chance gegen meinen unschlagbaren kleinen
Bruder (er ist wirklich gut in 3D Shootern :) ) rauszuholen.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
