<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Wichtige AMIGA-aktuell-Umfrage
</LI>
</UL>
<P>
In eigener Sache weise ich auf eine kleine, f&uuml;r die Zukunft dieses Magazins
aber sehr wichtige, Umfrage hin, die wir in dieser Ausgabe von AMIGA
aktuell durchf&uuml;hren. Ich bitte euch ALLE, die paar Minuten zu investieren
und an ihr teilzunehmen. Danke.
</P>
<UL>
<LI> Alive Mediasoft im Schussfeuer
</LI>
</UL>
<P>
Diesen Monat eskalierte die Situation um Alive Mediasoft: W&auml;hrend
sich die Ger&uuml;chte verh&auml;rteten, dass Alive Mediasoft alte Amiga
Spiele einfach ohne Lizenz neuver&ouml;ffentlichte, wurde von einem
Amiga-User auf der Goal 2000 CD-ROM ein Cracker-Intro von Quartex
gefunden, welche eindeutig das Spiel Goal von 1993 knackten. So
scheint es sich bei Goal 2000 nicht nur um das alte Goal zu handeln,
sondern dazu noch um ein geknacktes Goal, welches sicherlich nicht
lizenziert wurde. Erste Konsequenzen sind schon gefolgt: So hat
z.B. KDH Datentechnik den Vertrieb von Alive Mediasoft Spielen
bis auf weiteres eingestellt. Von Alive Mediasoft wurde zu diesem
Thema noch keine Stellung bezogen. Wenn die Firma dies allerdings
nicht bald tut, d&uuml;rfte das Vertrauen dahin sein.
</P>
<P>
Nachtrag: Mittlerweile hat Alive Mediasoft eine Pressemitteilung
ver&ouml;ffentlicht, in der Steven Flowers allgemeines Unverst&auml;ndnis
gegen&uuml;ber der Amiga-Gemeinde &auml;u&szlig;ert. Zum Streitpunkt um Goal
2000 schreibt er, dass es sich um eine alte, noch nicht ver&ouml;ffentlichte
Goal-Version handele und dass es leider nur eine Version mit
Cracker-Intro davon g&auml;be. Dies scheint mir allerdings mehr als
schleierhaft. Weiterhin gibt er bekannt, dass der deutsche Verteiler
GTI keine Zweifel an der Qualit&auml;t der Alive Mediasoft Produkte
habe.
</P>
<P>
Desweiteren haben Darkage Software den Vertrag zum Vertrieb
ihres Programmes &quot;Extreme - The Visual FX Generator&quot; mit Alive
Mediasoft gek&uuml;ndigt, da sie nicht bezahlt wurden. Nach
mehrmaligem Nachfragen gab Steven Flowers dann bekannt, dass
er Darkage nicht bezahlen k&ouml;nne, wenn er selbst von anderen
Verteilern kein Geld erhalte. Extreme wird jetzt &uuml;brigens
von Epic Marketing vertrieben.
</P>
<P>
Au&szlig;erdem wurde auf Amiga Network News eine Meldung von Steven
Flowers ver&ouml;ffentlicht, in der er schrieb, dass Alive Mediasoft
bald schlie&szlig;en w&uuml;rde.
</P>
<UL>
<LI> clickBOOM News
</LI>
</UL>
<P>
Laut clickBOOM geht Nightlong jetzt in die letzte Testphase. Mit einer
Ver&ouml;ffentlichung kann noch diesen Monat gerechnet werden. Die
Portierung von Z ist zu ca. 50% abgeschlossen, macht aber guten
Fortschritt. Das Problem bei Z sei, dass es komplett in x86 Assembler
geschrieben sei.
</P>
<UL>
<LI> Sharks! CD32 fertig
</LI>
</UL>
<P>
Mit Sharks! erscheint seit zwei Jahren mal wieder ein CD32 Spiel.
Auch wenn es sich hier nicht um eine kommerzielle Ver&ouml;ffentlichung
handelt, hielt ich das Thema f&uuml;r so interessant, dieses Spiel
mal genauer unter die Lupe zu nehmen. Deshalb k&ouml;nnt ihr in dieser
Ausgabe ein Review des Spiels lesen.
</P>
<P>
<A HREF="img/Sharks1.jpg"><IMG SRC="thumb/Sharks1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Sharks2.jpg"><IMG SRC="thumb/Sharks2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Sharks3.jpg"><IMG SRC="thumb/Sharks3.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Sharks4.jpg"><IMG SRC="thumb/Sharks4.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> Lambda
</LI>
</UL>
<P>
Man mag es kaum glauben, aber die Entwicklung von Lambda geht weiter.
So ist dem neuen Status-Report zu entnehmen, dass der Autor nun
den Grundstein f&uuml;r die Lambda Virtual Machine gelegt hat. Vielleicht
erscheint das Spiel ja doch noch irgendwann.
</P>
<UL>
<LI> Heretic II
</LI>
</UL>
<P>
Laut Hyperion Software wird Heretic II endg&uuml;ltig ab 5.6.2000 lieferbar
sein. Steffen H&auml;user hat angek&uuml;ndigt, dass seine Portierung des Heretic
Addons &quot;The Heretic Fortress&quot; zeitgleich mit Heretic II erscheinen
wird. Dieses Addon ben&ouml;tigt nat&uuml;rlich eine Vollversion von Heretic II.
Weiterhin hat Hyperion Software bekanntgegeben, dass sie das Spiel
Alien Nations (zu Deutsch: Die V&ouml;lker) portieren werden. Dieses wurde
dann auch bei Titan Computer unter Vertrag genommen.
</P>
<UL>
<LI> Interview mit Thomas Frieden
</LI>
</UL>
<P>
Ein interessantes Interview mit Thomas Frieden von Hyperion Software
ist auf <A HREF="http://www.amigaflame.co.uk/" TARGET="_top">http://www.amigaflame.co.uk/</A> zu finden. Dort gibt er z.B.
Auskunft &uuml;ber die Zusammenarbeit zwischen TAO und Hyperion und wie
man Lizenzen von solch gro&szlig;en Firmen wie z.B. Activision erh&auml;lt.
</P>
<UL>
<LI> CS&amp;E bringt Carmageddon f&uuml;r den Amiga
</LI>
</UL>
<P>
Eine weitere Portierung wurde diesen Monat angek&uuml;ndigt: CS&amp;E m&ouml;chte
das etwas andere Autorenner Carmageddon der britischen Softwareschmiede
SCi auf den Amiga portieren. Die Lizenzen wurden auch schon vergeben.
</P>
<UL>
<LI> Simon the Sorcerer II
</LI>
</UL>
<P>
Die letzten Wochen grasierten einige Ger&uuml;chte um Simon the Sorcerer
II. Allerdings ist weder korrekt, dass Simon the Sorcerer II nur 1000
mal verkauft werden darf noch dass es sich schon im Presswerk
befinde. Laut Epic-Marketing strebt man eine Ver&ouml;ffentlichung auf
der World of Alternatives Messe in Neuss an.
</P>
<UL>
<LI> Update f&uuml;r Virtual GP
</LI>
</UL>
<P>
Epic Marketing hat ein letztes Update f&uuml;r die Formel 1-Simulation
Virtual GP ver&ouml;ffentlicht. Das Update l&auml;sst sich von der Website
<A HREF="http://www.epic-marketing.de/" TARGET="_top">http://www.epic-marketing.de/</A> herunterladen und bietet neben
Fehlerbereinigungen auch einen Arcade Modus.
</P>
<UL>
<LI> Amiga classiX 2
</LI>
</UL>
<P>
Epic Marketing hat diesen Monat die zweite CD-ROM der Amiga
classiX Reihe ver&ouml;ffentlicht. Auf dieser CD-ROM befinden sich
&uuml;ber 250 Spiele, darunter 30 kommerzielle Spiele. Zu den Highlights
der kommerziellen Spiele geh&ouml;ren sicherlich Beneath a Steel Sky
und Hannibal. Die CD-ROM wird &uuml;brigens auch in Filialen der
Weltbild Gruppe zu erhalten sein.
</P>
<UL>
<LI> Neue Demoversion von Homeland ver&ouml;ffentlicht
</LI>
</UL>
<P>
Von der Demoversion des Spieles Homeland wurde eine neuere Version
ver&ouml;ffentlicht, die allerdings nur einen kleinen Fehler behebt.
Sie kann unter <A HREF="http://www.dahlsgaards.dk/homeland/" TARGET="_top">http://www.dahlsgaards.dk/homeland/</A> heruntergeladen
werden.
</P>
<UL>
<LI> Neues von Titan Computer
</LI>
</UL>
<P>
Bei Titan Computer hat man mal wieder zwei Spiele unter Vertrag
genommen: Einmal das Spiel &quot;Die V&ouml;lker&quot;, welches von Hyperion
Software auf den Amiga portiert wird, und das Spiel Exodus. Bei
beiden Spielen handelt es sich um Strategiespiele. Das Spiel
&quot;Die V&ouml;lker&quot; &auml;hnelt ein wenig dem Klassiker &quot;Die Siedler&quot;.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
