<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Vorwort</H2>
<P><B>Hallo, liebe Leser!</B></P>
<P>
Vor euch liegt nun der Spieleteil der AMIGA aktuell des Monats Juni
im Jahre 2000. Dieser Monat passierte eigentlich nichts besonderes,
au&szlig;er dem Trubel um Alive Mediasoft, dem die Firma hoffentlich bald
ein Ende bereitet, in dem sie endlich mal klar Stellung bezieht.
Sehr interessant fand ich diesen Monat auch die Meldung, dass es
jetzt Amiga-Produkte &uuml;ber den Weltbild Konzern zu kaufen gibt (so
sollen Produkte von Haage&amp;Partner sogar im Weltbild-Katalog angeboten
werden). Auch Epic Marketing bietet z.B. die Amiga classiX 2 CD-ROM
&uuml;ber Weltbild an. Ich bin schon mal gespannt, wie die Resonanz
auf diese sicherlich seit Jahren einmalige Aktion ist.
</P>
<P>
Zur&uuml;ck zum Spieleteil: Diesen Monat k&ouml;nnt ihr hier im Spieleteil
zwei Reviews von dem Shareware-Spiel Sharks! lesen, welches vor
Kurzem exklusiv f&uuml;r das CD32 erschienen ist. Ein Review wurde
von mir verfasst, der andere von der CD32 Allianz, die sich vor
geraumer Zeit formiert hat. Au&szlig;erdem gibt es wie jeden Monat
die Mac-Ecke von Andreas Koch. Bei dieser Gelegenheit m&ouml;chte ich
Andreas nochmal ein gro&szlig;es Lob aussprechen, f&uuml;r die Kontinuit&auml;t
mit der er die Mac-Ecke durchf&uuml;hrt. W&auml;hrend andere Rubriken
&ouml;fters mal ausfallen, wie diesen Monat mal wieder die PD-Berichte
aus dem Aminet, war die Mac-Ecke bisher immer mit von der Partie.
Eigentlich war f&uuml;r diesen Monat auch eine Preview des Spieles
JumpingAround geplant, leider st&uuml;rzte dieses aber auf meinem
System nur gnadenlos ab.
</P>
<P>
Jetzt m&ouml;chte ich abschlie&szlig;end noch ein paar, wenige Worte &uuml;ber
das Vorwort vom letzten Monat verlieren: Ich sch&auml;tze die Leserzahl
nicht so gering ein, weil die AMIGA aktuell oder der Spieleteil
schlecht sind, sondern weil die Spielesituation am Amiga &uuml;ber
das letzte Jahr derma&szlig;en uninteressant geworden ist, dass es
sich ja fast nicht lohnt, etwas dar&uuml;ber zu lesen. Und die meisten
Spiele, die erscheinen (au&szlig;er die Spiele von 1 bis 2 Firmen),
kann man sowieso getrost vergessen. Und wer will schon jeden
Monat von tollen Spielen, mit allem nur Ertr&auml;umbaren lesen, die
dann am Ende doch nicht erscheinen? Immerhin habe ich diesen
Monat drei E-Mails (einschlie&szlig;lich die von Carsten Schr&ouml;der)
zu diesem Thema bekommen. Auch dies spricht f&uuml;r meine Vermutung
der Leserzahl von etwa 20. Aber ich m&ouml;chte hier nat&uuml;rlich keinem
auf den Fu&szlig; treten, geschweige denn irgendwelche Trauerstimmung
verbreiten. Vielleicht wird die Situation ja nochmal besser!
</P>
<P>
Nun w&uuml;nsche ich viel Spa&szlig; beim Lesen!
</P>
<P><B>Euer,</B></P>
<P>
Andreas<BR>
(<A HREF="mailto:Andreas.Falkenhahn@gmx.de">Andreas.Falkenhahn@gmx.de</A>)<BR>
</P>
<P>
(Andreas Falkenhahn, An der Trift 2, 36132 Eiterfeld-Arzell)
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
