<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Vorwort</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Main.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Intern.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Vorwort
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Vorwort (mit R&uuml;ckblick auf den vergangenen Monat)</H1>
<P>
+++ AMIGA gibt Erscheinen des Software-Developerkits bekannt +++ Neues
AmigaOS vorerst ohne Memory Protection +++ Intern: Wichtige AMIGA-aktuell-
Umfrage in dieser Ausgabe +++
</P>
<P>
Willkommen damit zur neuen Ausgabe von AMIGA aktuell.
</P>
<P>
W&auml;hrend es bis Ende Mai ziemlich ruhig zuging, &auml;nderte sich das
anschlie&szlig;end, da AMIGA in den letzten Tagen das Erscheinen der
Entwicklersoftware bekannt gab und zus&auml;tzlich mit weiteren Neuigkeiten
aufwartete.
</P>
<P>
So ist beispielsweise nicht geplant, das neue Amiga-Betriebssystem sofort
mit Memory Protection auszustatten - mehr dazu in den AMIGA-Kurzmeldungen.
</P>
<P>
Zu einer f&uuml;r AMIGA aktuell sehr erfreulichen Meldung: Aus einer Online-
Umfrage der deutschen Spielezeitschrift Amiga Future, an der 230 User
teilgenommen hatten, geht hervor, dass AMIGA aktuell zumindest bei den
Einsendern mit gro&szlig;em Abstand das meistgelesene Online-Magazin ist. Alle
Ergebnisse k&ouml;nnt ihr unter <A HREF="http://www.amigafuture.de" TARGET="_top">http://www.amigafuture.de</A> im Bereich &quot;Aktion&quot;
nachlesen.
</P>
<P>
Ebenfalls in eigener Sache weise ich auf eine kleine, f&uuml;r die Zukunft
dieses Magazins aber sehr wichtige, Umfrage hin, die wir in dieser Ausgabe
durchf&uuml;hren. Ich bitte euch ALLE, die paar Minuten zu investieren und an
ihr teilzunehmen. Danke.
</P>
<P>
Die Interna der heutigen Ausgabe:
</P>
<UL>
<LI> Ist jemandem von euch bekannt, ob die &raquo;AA&laquo;-Diskette von Berlin PD noch
  erscheint?
</LI>
<BR><LI> Existiert die Essener Mailbox Empire noch?
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Zu den regelm&auml;&szlig;igen Aufrufen:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> An dieser Stelle eine Bitte: Jeder Artikelschreiber freut sich &uuml;ber
  Lob, aber auch &uuml;ber konstruktive Kritik, und wird durch sie motiviert.
  Scheut euch also bitte nicht, eure Meinung zu den verschiedenen Beitr&auml;gen
  zu &auml;u&szlig;ern, entweder, indem ihr direkt an die Autoren schreibt, oder aber
  an AMIGA aktuell (<A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>).
</LI>
<BR><LI> Wir suchen st&auml;ndig Mitarbeiter, die regelm&auml;&szlig;ig, unregelm&auml;&szlig;ig oder
  einmalig Beitr&auml;ge zu AMIGA aktuell beisteuern wollen. Inhaltlich sind
  einer Mitarbeit kaum Grenzen gesetzt. Wer Interesse hat, sollte sich
  an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A> wenden.
</LI>
</UL>
<P>
Viel Spa&szlig; jetzt bei dieser Ausgabe,
</P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Main.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Intern.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
