<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Der Commodore-Untergang aus meiner Sicht - Teil 8 (von Rainer Benda)</H2>
<H3>&raquo;Und dann war(en) da noch......</H3>
<P>
.....der A3000T/040. Ein A3000T ohne 68030/68882 CPU/FPU onboard, daf&uuml;r mit
der Commodore A3640 (68040/25MHz) CPU-Karte. Bedauerlicherweise in der
Version 3.0, ohne aktuellem Super-DMAC und ohne aktuellem Ramsey.
</P>
<P>
Dazu noch mit Kickstart 2.04 und &quot;falschen&quot; ZIP-RAM's und dem damals
verf&uuml;gbaren SCSI-Chip von WD in der Version &quot;02&quot; oder &quot;04&quot;. Das hatte zur
Folge, da&szlig; der Rechner v&ouml;llig instabil war. Wenn er mal l&auml;nger als 15
Minuten lief, ohne Dateien beim Speichern zu zerst&uuml;ckeln oder einfach
abzuschmieren, war das schon ein Erfolg.
</P>
<P>
Das Problem konnte damals auch nicht gefixt werden, da es (noch) keine
Updates f&uuml;r die CPU-Karte gab. Manche Schwierigkeiten konnten sich durch
nachtr&auml;glichen Einbau eines -11 Buster's zwar beheben lassen (siehe dazu
die Einbauanleitung zur A3640 im A3000D und A3000T), jedoch bestritt Dave
Haynie immer, da&szlig; es einen direkten Zusammenhang g&auml;be. Er meinte immer,
egal mit welchem Buster in Verbindung der A3640 w&uuml;rde der Rechner starten.
Wir haben uns zu dem Thema teilweise heftig auseinandergesetzt, so richtig
erkl&auml;ren warum der Buster trotz Einbau nicht der Grund f&uuml;r die Verbesserung
sei, habe ich eigentlich bis heute nicht erhalten.
</P>
<P>
Wie dem auch sei.....der 3000T/040 war so nicht verkaufbar. Es gab intern
1-2 &quot;Prototypen&quot; davon, die irgendwann zur&uuml;ck nach Braunschweig gingen, da
man sie nicht sinnvoll benutzen konnte (zudem erfuhren wir vorher gar
nicht, da&szlig; es eine A3000T Platine ohne 68030/882 gab).
</P>
<P>
Helmut Jost spielte dennoch mit dem Gedanken diesen Rechner zur Commodore
Messe in Frankfurt zu verkaufen. Bei einem kleinen Meeting der Amiga-/PC-
/Marketing Abteilung (vor der Messe) versprach er mir, den A3000T/040 nicht
verkaufen zu wollen, da ich ihn darauf hinwies sich automatisch den &Auml;rger
der K&auml;ufer einzuhandeln.
</P>
<P>
Ich hatte damals zus&auml;tzlich vorgeschlagen eine Techniker-Ecke einzurichten,
um den Usern auch mal direkt helfen zu k&ouml;nnen. Leider waren wir im Falle
des A3000T/040 auch gleich die Pr&uuml;gelknaben, denn die Kiste wurde direkt
gegen&uuml;ber des C= Stands dann doch von ROTSTIFT verkauft (Preis ca. 4.700
DM).
</P>
<P>
Ca. 2 Stunden sp&auml;ter kamen die ersten Reklamationen. Mir war das zu bl&ouml;d
und ich verwies als Ansprechpartner direkt an Helmut Jost. Auf meine Frage,
warum die Teile doch in den Verkauf gelangten, meinte er nur, da&szlig; ja nicht
Commodore sie verkaufe, sondern ROTSTIFT. Und der Deal war dann der, da&szlig;
ROTSTIFT nicht bei C= reklamieren konnte, die Probleme also abgew&auml;lzt
wurden. Klar sind die Leute dann zwar zu ROTSTIFT gegangen, nur kamen sie
dann zu uns, weil wir ja der Hersteller des Ger&auml;ts waren.
</P>
<P>
H. Jost war das ziemlich wurscht und er lachte noch dr&uuml;ber und meinte auch
noch ein tolles Gesch&auml;ft gemacht zu haben. An dem Tag hab ich dann wieder
gedacht, da&szlig; ich langsam abdrehe.
</P>
<HR>
<P>
.....die Commodore-Ansteckpins. 4 St&uuml;ck davon ergaben ein Set. Commodore
wollte damit seinen Usern einen Gefallen tun und sie zur Messe in Frankfurt
verschenken. Als man dann merkte, da&szlig; die Teile (30.000 St&uuml;ck von jedem
wurden produziert = 120.000 St.) und sich die Kosten auf einen 6-stelligen
Betrag summierten, kam die tolle Idee die Pins doch zu verkaufen. Am Besten
im Set und wenn einzeln dann f&uuml;r 5 DM/St&uuml;ck.
</P>
<P>
Die netten M&auml;dels am Info-Schalter durften das tun und Strichlisten &uuml;ber
die verkauften Pins f&uuml;hren.....es gab nicht sehr viele Striche....klar,
geschenkt w&auml;ren sie wohl alle weg gewesen, aber kaufen.....
</P>
<P>
So wurden sie eingebunkert, verteilt, anderweitig verkauft oder wie auch
immer.
</P>
<P>
Den gew&uuml;nschten Effekt hatten sie nicht, daf&uuml;r aber ne Menge Geld gekostet.
</P>
<HR>
<P>
....das generelle Problem, unserer Marketing-Abteilung in Verbindung mit
der Gesch&auml;ftsleitung gewisse Systemkonfigurationen zu &quot;erkl&auml;ren&quot;, die
notwendig sind, um sie &uuml;berhaupt sinnvoll verkaufen zu k&ouml;nnen. So z.B. die
Sache mit dem KAWAI Funlab Keyboard, das mit einem A500 und 512KB RAM
ausgeliefert werden sollte, obwohl f&uuml;r die Inbetriebnahme schon 1MB
notwendig war, da sich mit weniger Speicher einfach nichts tat.
</P>
<P>
Man wollte es dem Kunden &uuml;berlassen, sich die Speichererweiterung zu
kaufen, um einen angedachten Paketpreis nicht zu &uuml;bersteigen. Da&szlig; das
System aber gar nicht erst lief, schien den beteiligten v&ouml;llig egal zu
sein.
</P>
<HR>
<P>
....die Umtauschaktion des A500 gegen ein &quot;Amiga-&quot; CDTV gegen Aufpreis.
Leider wurde die CDTV-Kombination als vollwertiger AMIGA-Ersatz beworben
und hat uns auch eine Menge Probleme bereitet.
</P>
<P>
Das ging teilweise soweit, da&szlig; Kunden ihren &quot;eingetauschten&quot; Amiga 500
wiederhaben wollten. Das ging nat&uuml;rlich nicht, weil die &quot;zur&uuml;ckgenommenen&quot;
Ger&auml;te in Richtung Osten weiterverkauft wurden, oder zum Kilo-Preis im
Inland verscherbelt wurden.
</P>
<P>
Die Problematik lag darin, da&szlig; niemand die Unterschiede zwischen den
Ger&auml;ten erw&auml;hnte. So waren viele Kunden der (berechtigten) Ansicht, die
CDTV-Kombination w&uuml;rde sich 1:1 wie ein Amiga verhalten. Als die Aktion
bereits auf Hochtouren lief, schaltete man uns ein, um diese Punkte zu
kl&auml;ren.
</P>
<P>
Nat&uuml;rlich wieder zu sp&auml;t. Die meisten Beschwerden kamen wegen der
schlechten Erweiterbarkeit des CDTV's gegen&uuml;ber einem A500 und die nicht
vorhandene 100% Kompatibilit&auml;t zu den vorhandenen Programmen. Es war alles
zuviel auf Optionen ausgerichtet (&quot;sie k&ouml;nnen eine HD anschliessen&quot;, &quot;sie
k&ouml;nnen auch eine Turbokarte einbauen&quot;, &quot;sobald diese Artikel verf&uuml;gbar
sind&quot;). Das waren sie lange Zeit nicht und dann zu Preisen, die kaum jemand
zahlen wollte.
</P>
<P>
Die Aktion lief nicht sehr lang, weil es einfach zuviele Schwierigkeiten
damit gab. Der Hintergedanke, damit den Verkauf des CDTV's zu F&ouml;rdern war
sicher in Ordnung, nur wurde erneut der falsche Weg eingeschlagen.
</P>
<HR>
<P>
....die Unentschlossenheit, welche Produkte man selbst produzieren und
vermarkten wollte und welche man dem &quot;Handel&quot; &uuml;berlassen sollte. Als
Beispiel hier die A2630 Turbokarte f&uuml;r den A2000. Verkaufte sich blendend,
als C= den Preis daf&uuml;r deutlich senkte. Lt. Helmut Jost sei dies erst
m&ouml;glich geworden, weil die Karte aus dem Sortiment fliegen sollte und
deswegen schleunigst abverkauft werden &quot;musste&quot;.
</P>
<P>
Ich denke dar&uuml;ber anders, denn es gab damals nicht sehr viele CPU-Karten,
die so kompatibel zum System waren wie die A2630 und eine angepasste
Preissenkung h&auml;tte dem Verkauf sicher auch gut getan. Naja, war halt wieder
anders. Eine schnellere/andere CPU-Karte wollte &quot;er&quot; auch nicht mehr
produzieren lassen.
</P>
<P>
Dies sei Aufgabe der anderen Hersteller, so seine Auffassung. Leider hat er
diese Ansicht nicht auf Dauer vertreten und nicht bei allen Produkten, bei
denen diese &quot;Entscheidung&quot; auch wirklich Sinn gemacht h&auml;tte.&laquo;
</P>
<P>
Fortsetzung folgt...
</P>
<P ALIGN="RIGHT">
<A HREF="Workshops1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
