<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Workshops / Hintergrundberichte / Buchvorstellungen</H1>
<H2>1. Workshop: Aufbau eines Netzwerks mit AmigaOS und Linux (v. Uwe Pannecke)</H2>
<P><B>&raquo;Beam me up, terminal</B></P>
<P><B>Ein Mini-Netzwerk</B></P>
<H3>1. Datenaustausch im Rechnerverbund</H3>
<P>
Die Zeiten, in denen nur in jedem 50. bundesdeutschen Haushalt ein Rechner
sein Dasein fristete, scheint nach j&uuml;ngsten statistischen Erhebungen
endg&uuml;ltig vorbei zu sein. Ebenso findet man gar nicht mehr so selten mehr
als einen Computer in einer Wohnung. Nicht mal so selten summt der Rechner
des/der Alten, nur durch eine Zimmerwand getrennt vom Computer des Steppkes
oder der Steppkeline vor sich hin. Und egal, welches Betriebssystem auf den
einzelnen Rechnern f&uuml;r die Abst&uuml;rze sorgt, viele Daten, ob nun Bilder,
Texte, Musikst&uuml;cke oder was auch immer, h&auml;tte man gern schnell einmal
ausgetauscht, ohne deshalb gleich einen Kurzlehrgang als Diskjockey
absolvieren zu m&uuml;ssen. Da liegt es nat&uuml;rlich nahe, an eine Rechnerkopplung
zu denken. Die sicher universellste L&ouml;sung w&auml;re ein Verbund &uuml;ber
Netzwerkkarten. F&uuml;r den Wintel-PC sind selbige an beinahe jeder Ecke f&uuml;r
eine Apfel und ein Ei zu ergattern, f&uuml;r den Amiga sieht es da nicht ganz so
rosig aus. Zwei Amiga-Netzwerkkarten f&uuml;r die Amiga-Kopplung st&uuml;rzen so
manchen User in leichte bis schwere finanzielle N&ouml;te.
Sollen nicht unbedingt gigabyte-weise Daten in m&ouml;glichst hoher
Geschwindigkeit transferiert werden, kann auch mit einfachsten Mitteln ein
Mini-Netzwerk &uuml;ber die parallele oder serielle Schnittstelle eingerichtet
werden.
</P>
<P>
Im folgenden soll ein Beispiel in Form einer Nullmodem-Verbindung mit Hilfe
zweier Terminal-Programme zwischen  AmigaOS und Linux beschrieben werden.
Gleicherma&szlig;en l&auml;&szlig;t sich die Vorgehensweise auch auf beliebige weitere
Betriebssysteme &uuml;bertragen.
</P>
<H3>2. Hardware</H3>
<P>
Je nach gew&uuml;nschter Verbindungsstelle wird ein sogenanntes Nullmodem-Kabel
entweder f&uuml;r die parallele oder die serielle Schnittstelle ben&ouml;tigt. Die
parallele Schnittstelle bietet zwar eine deutlich h&ouml;here Geschwindigkeit,
da aber oftmals an selbiger bereits ein Drucker angeschlossen ist, soll in
diesem Beitrag eine serielle Verbindung der beiden Rechner betrachtet
werden. Die erste H&uuml;rde, die es zu nehmen gilt, ist das Nullmodem-Kabel f&uuml;r
die seriellen Schnittstellen. Wenn Euch nicht unbekannt ist, an welcher
Seite ein L&ouml;tkolben warm wird, k&ouml;nnt Ihr dieses Kabel selbst
zusammenbasteln. In diversen Programmpaketen zur Par- und SerNet-Verbindung
zweier Amigas im Aminet finden sich oft recht ausf&uuml;hrliche Anleitungen.
Eine sehr gut geeignete, weil ausf&uuml;hrlich und in deutscher Sprache
verfasste Anleitung findet Ihr unter [1]. Dort sind die zu verbindenden
Kontakte der beiden seriellen Stecker detailliert beschrieben. Neben den
beiden Steckern wird ein zumindest sieben-adriges Kabel, das bis zu etwa 4
bis 5 m lang sein kann, ben&ouml;tigt.
</P>
<P>
Ist Euch die Sache mit der eigenh&auml;ndigen L&ouml;tarbeit zu windig und die CIA-
Chips f&uuml;r Selbstversuche zu schade, bietet jedes gr&ouml;&szlig;ere Kaufhaus ein
passendes Kabel f&uuml;r ca. 20 DM zum Kauf an. Achtet beim Kauf unbedingt
darauf, da&szlig; es sich tats&auml;chlich um ein Nullmodem-Kabel f&uuml;r die
Daten&uuml;bertragung &uuml;ber die serielle Schnittstelle handelt. Dies muss
deutlich auf der Verpackung zu lesen sein. Da diese Kabel zumeist mit 9-
poligen Steckverbindern angeboten werden, der Amiga aber nur &uuml;ber eine
eingebaute 25-polige Buchse verf&uuml;gt, ist zus&auml;tzlich noch ein Adapter von 9-
auf 25-polig vonn&ouml;ten. Sollte in Eurem Amiga eine I/O-Erweiterung wie etwa
die MultifaceCard f&uuml;r zus&auml;tzlichen Stromverbrauch sorgen, steht meist
bereits ein neunpoliger Anschlu&szlig; auf diesen Karten zur Verf&uuml;gung und ihr
k&ouml;nnt auf den Adapter verzichten.
</P>
<H3>3. Software</H3>
<P>
Die beste elektrische Verbindung zwischen den beiden Rechnern n&uuml;tzt nicht
allzu viel, wenn keine Software den Datenaustausch organisiert. Eine f&uuml;r
diese Zwecke gut geeignete Programm-Kategorie sind die Terminal-Programme,
welche f&uuml;r die jeweiligen Betriebssysteme oft in gro&szlig;er Auswahl zur
Verf&uuml;gung stehen. Beispielhaft sind nachfolgend zwei Programme aus dem
Terminal-Pool herausgegriffen.
</P>
<H4>3.1 AmigaOS</H4>
<P>
Seit einer ganzen Reihe von Jahren tummelt sich auf dem Amiga ein, oder
wohl besser DAS Terminalprogramm, vom keinem geringeren als Olaf Barthel
erstellt und mit viel Phantasie als &quot;Term&quot; bezeichnet. Term ist Giftware,
d.h. Olaf Barthel erwartet bei intensivem Gebrauch seines Programmes ein
wenig Gift, &auml;hm Mitgift, also irgendein kleines Geschenk. Ihr findet Term
u.a. im Aminet [2] in der Version 4.7. F&uuml;r eine vollst&auml;ndige Installation
ben&ouml;tigt Ihr die Pakete &quot;term_main.lha&quot;, &quot;term_libs.lha&quot;, &quot;term_extras.lha&quot;
und &quot;term_locale.lha&quot;.
</P>
<P>
Mit &quot;term_deutsch.lha&quot; steht Euch eine sehr ausf&uuml;hrliche und vor allem
lesenswerte deutsche Dokumentation zur Verf&uuml;gung, das Paket &quot;term_030.lha&quot;
enth&auml;lt eine f&uuml;r 68030-CPU optimierte Programmversion. Sind alle
Programmpakete entpackt und Term in einer Schublade Eurer Amiga-Festplatte
installiert, kommt der entscheidende Teil: die Konfiguration. L&auml;&szlig;t man das
erste mal die Maus &uuml;ber die einzelnen Men&uuml;-Punkte wandern, wird man von der
fast un&uuml;berschaubaren Vielzahl an Einstellm&ouml;glichkeiten, gerade auch im
Konfigurationsmenu, f&ouml;rmlich erschlagen.
</P>
<P>
<A HREF="img/Term1.png"><IMG SRC="thumb/Term1.jpg" WIDTH="120" HEIGHT="79" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Lasst Euch davon nicht abschrecken, sondern schreitet mutig zur Tat. Ein
elementarer Men&uuml;-Punkt ist &quot;Einst./Schnittstelle...&quot;. Neben der Baudrate,
also der &Uuml;bertragungsgeschwindigkeit, die bei eingebauter serieller
Schnittstelle und einer 68030-CPU aufw&auml;rts wohl gerade noch mit maximal
57600 bps reibungslos funktionieren d&uuml;rfte, bei zus&auml;tzlicher
Schnittstellen-Karte (im vorliegenden Fall eine MultiFaceCard III) und
gleicher CPU durchaus auch noch 115200 bps verkraftet, m&uuml;ssen die
&uuml;bertragenen Bits pro Zeichen (hier 8), die verwendete &Uuml;bertragungsparit&auml;t
(hier Keine), eingesetzte Stoppbits (hier 1) und das
Daten&uuml;bermittlungsprotokoll (hier RTS/CTS/pr&uuml;fe DSR) in der Karteikarte
&quot;Parameter&quot; mindestens eingestellt bzw. notiert werden. Denn das auf dem
zweiten Rechner arbeitende Terminalprogramm braucht diese Informationen, um
sich mit seinem Gegen&uuml;ber verst&auml;ndigen zu k&ouml;nnen.
</P>
<P>
<A HREF="img/Term2.png"><IMG SRC="thumb/Term2.jpg" WIDTH="120" HEIGHT="79" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Unter dem Karteireiter &quot;Schnittstelle&quot; ist selbige passend einzustellen.
Die interne serielle Schnittstelle wird standardm&auml;&szlig;ig &uuml;ber &quot;serial.device&quot;
angesprochen. Da im vorliegenden Fall eine MultifaceCard zum Einsatz kommt,
ist hier der passende Schnittstellentreiber das &quot;duart.device&quot;. Die
Treibernummer w&auml;re bei der amigaeigenen seriellen Schnittstelle die &quot;0&quot;,
bei zus&auml;tzlichen Schnittstellenkarten sind hier unterschiedliche Werte, je
nach Anzahl und gerade verwendeter Schnittstelle (hier &quot;1&quot; f&uuml;r die zweite
serielle Schnittstelle der MultiFacecard III) einzustellen.
</P>
<P>
<A HREF="img/Term3.png"><IMG SRC="thumb/Term3.jpg" WIDTH="115" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Die Modemeinstellungen unter &quot;Einst./Modem...&quot; k&ouml;nnen oft unver&auml;ndert
bleiben. Sinnvoll ist vor einem ersten Test die Wahl geeigneter
Verzeichnisse, aus denen Daten gesendet oder empfangene Daten abgespeichert
werden sollen. Der Men&uuml;-Punkt &quot;Einst./Dateipfade...&quot; bietet die passenden
Wahlm&ouml;glichkeiten.
</P>
<P>
<A HREF="img/Term4.png"><IMG SRC="thumb/Term4.jpg" WIDTH="120" HEIGHT="80" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Jetzt sollten die get&auml;tigten Einstellungen noch f&uuml;r eine dauerhafte Nutzung
abgespeichert werden. &quot;Term&quot; ist nun f&uuml;r seinen ersten Einsatz pr&auml;pariert.
</P>
<H4>3.2 Linux</H4>
<P>
Ein f&uuml;r unsere Zwecke gut geeignetes und wohl jeder Distribution
beiliegendes Terminalprogramm ist &quot;Minicom&quot; [3], welches &uuml;ber Jahre von
verschiedenen Autoren wie Miquel van Smoorenburg und Jukka Lathinen
entwickelt bzww. verbessert wurde. Die Bedienung dieses Programmes erfolgt
komplett &uuml;ber die Tastatur. Was f&uuml;r den Amigianer auf den ersten Blick wie
Anachronismus erscheint, geht wider Erwarten nach kurzer Eingew&ouml;hnungsphase
flott von der Hand.
</P>
<P>
Vor der ersten Benutzung &quot;Minicoms&quot; steht nat&uuml;rlich ebenso die
Konfiguration. Mit der Eingabe &quot;minicom -s&quot; in z.B ein XTerm-Fenster wird
die Konfiguration gestartet.
</P>
<P>
<A HREF="img/Minicom1.png"><IMG SRC="thumb/Minicom1.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Als erstes legen wir die Verzeichnisse fest, in den empfangene Daten
abgespeichert und zu sendende Daten gesucht werden.
</P>
<P>
<A HREF="img/Minicom2.png"><IMG SRC="thumb/Minicom2.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Der Menu-Punkt &quot;File transfer protocols&quot; kann unver&auml;ndert bleiben,
unbedingt notwendig jedoch ist &quot;Serial port setup&quot;. Nach Eingabe eines &quot;A&quot;
l&auml;&szlig;t sich die seriellen Schnittstelle w&auml;hlen, wobei &quot;/dev/ttyS0&quot; f&uuml;r die
erste, &quot;/dev/ttyS1&quot; f&uuml;r die zweite Schnittstelle steht. Mit &quot;E&quot; kann dann
die passende Schnittstellen-Geschwindigkeit, Parit&auml;t und die Bits per
Zeichen entsprechend der bei &quot;Term&quot; getroffenen Wahl angepasst werden. Da
&quot;Term&quot; mit 115200 Bps und 8 Datenbits ohne Parit&auml;t konfiguriert wurde,
sorgt die Tastenkombination &quot;H&quot; und &quot;O&quot; f&uuml;r die ad&auml;quaten Werte bei
&quot;minicom&quot;.
</P>
<P>
<A HREF="img/Minicom3.png"><IMG SRC="thumb/Minicom3.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Die Anwahl des Punktes &quot;Save setup as dfl&quot; veranla&szlig;t Minicom, die
get&auml;tigten Einstellungen als Default-Werte abzuspeichern. Beim n&auml;chsten
Start reicht dann die Eingabe &quot;minicom&quot;, um das Terminalprogramm
arbeitsbereit zu haben.
</P>
<H3>4. Datentranfer</H3>
<P>
Jetzt wird es spannend.  Der erste Datentransfer soll vom Amiga zum Linux-
Rechner laufen. Wir starten &quot;minicom&quot; durch die Eingabe seines Namens in
einem XTerm- oder Rxvt-Fenster. Jetzt ist es an der Zeit, &quot;Term&quot; mit einem
Doppelklick auf sein Icon in einen arbeitsf&auml;higen Zustand zu versetzen.
Nach einer kurzen Initialisierungsphase kann die Daten&uuml;bertragung starten:
Die Anwahl des Men&uuml;-Punktes &quot;&Uuml;bertr./Bin&auml;r-Datei(en) senden...&quot; &ouml;ffnet
einen Datei-Requester, in dem eine zu &uuml;bertragende Datei gew&auml;hlt wird. Ein
Klick auf &quot;OK&quot; veranla&szlig;t nun &quot;Term&quot;, die Daten auf die Reise zu schicken.
&quot;Minicom&quot; erkennt selbst&auml;ndig, da&szlig; ihm jemand Daten schickt und nimmt
selbige in Empfang.
</P>
<P>
<A HREF="img/DatenempfangMinicom.png"><IMG SRC="thumb/DatenempfangMinicom.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Sollen Daten vom Linux-Rechner &uuml;ber &quot;minicom&quot; verschickt werden, sorgt die
Tastenkombination &quot;Alt&quot; + &quot;s&quot; im &quot;minicom&quot;-Fenster f&uuml;r die Wahlm&ouml;glichkeit
eines &Uuml;bertragungsprotokolls. Getrost kann das voreingestellte ZModem-
Protokoll mit ENTER best&auml;tigt werden. Sofort bietet &quot;minicom&quot; die im zuvor
festgelegten Upload-Verzeichnis befindlichen Daten zur Selektion an. Hat
man seine Wahl (mit den Cursortasten scrollend, die eigntliche Auswahl mit
der Space-Taste) getroffen, sorgt wiederum ein ENTER f&uuml;r eine Datenstrom in
Richtung Amiga.
</P>
<P>
<A HREF="img/DatenempfangTerm.png"><IMG SRC="thumb/DatenempfangTerm.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
In beiden Terminalprogrammen kann der Datentransfer anschaulich mitverfolgt
werden.
</P>
<H3>5. Fazit</H3>
<P>
Ohne gro&szlig;en finanziellen und baulichen Aufwand lassen sich zwei Rechner
beliebiger Betriebssysteme &uuml;ber die serielle Schnittstelle verbinden. Mit
einem Terminalprogramm auf jeder Seite ist schon nach wenigen Minuten eine
stabile und zuverl&auml;ssige, wenn auch der Schnittstelle entsprechend
gem&auml;chliche Datenreise zwischen den Rechnern realisiert.
</P>
[1] im Aminet unter /comm/net/ProNET34.lha<BR>
[2] im Aminet unter /comm/term/term_xxx.lha<BR>
[3] <A HREF="http://www.freshmeat.net/" TARGET="_top">http://www.freshmeat.net/</A><BR>
<P><B>Uwe Pannecke &lt;<A HREF="mailto:Uwe.Pannecke@t-online.de">Uwe.Pannecke@t-online.de</A>&gt;&laquo;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
