<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerPC3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Der Zwischenruf
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Der Zwischenruf</H1>
<P>
He he he ........
</P>
<P>
Als ich noch klein war, konnte ich die ganze Familie mit einem etwas
eigenen &quot;J.R. Ewing&quot; lachen begeistern.
</P>
<P>
Auch wenn ich nie so ganz begriffen habe, wieso man Erwachsene mit einem so
billigen Joke zum lachen bringen kann (so wie Cremetorte ins Gesicht
schmieren) ... es hat immer gewirkt. Heute bin ich erwachsen und ein
f&uuml;rchterlicher Zyniker geworden. Woran das liegt? Mmmmhhh .... keine
Ahnung.
</P>
<P>
Vielleicht liegt es daran, dass mir - wie anderen Menschen auch - h&auml;ufig
nur Schrott verkauft wird. Das verschimmelte Brot im Supermarkt (nat&uuml;rlich
in knallgelber Verpackung um den Inhalt zu tarnen), der tolle Fernseher mit
100 Gigaherz-BildTechnik und 1 Mhz-digitalem-Ton; Lebensdauer p&uuml;nktlich 6
Monate, danach versagt eine simple Kupferbr&uuml;cke, die den gewachsenen
Anspr&uuml;chen von mittlerweile t&auml;glich drei Stunden fernsehen nicht mehr
standh&auml;lt. Nicht zu vergessen, die s&uuml;ndhaft teure Stereoanlage, welche
meinem armen Nachbarn in fortgeschrittenem Alter (wie im letzten
Zwischenruf berichtet) zum Verh&auml;ngnis geworden ist .....   ;-)
</P>
<P>
Aber zum Gl&uuml;ck gibts ja wenigstens noch unsere Amiga; teure, standhafte
Freundin.
</P>
<P>
Bald soll sie einen neuen Namen bekommen: Ami (Fleecy benutzte in der
offenen Maillinglist von Amiga Inc. den Namen AMIE!)
</P>
<P>
Das soll, wie der eine oder andere vielleicht vermuten k&ouml;nnte, nicht auf
die Nationalit&auml;t des neuen Rechners hinweisen sondern hei&szlig;t &uuml;bersetzt ins
Deutsche Freundin. Quasi eine amerikanisierte Amiga.
</P>
<P>
Au&szlig;erdem spricht man vom AmiVerse. Was zum Henker hei&szlig;t das nun?
Freundliches Universum? Naja, an dieser Stelle la&szlig; ich mal meine Kenntnisse
der englischen Sprache im Raum stehen; schlie&szlig;lich will ich die n&auml;chste
Woche noch &uuml;berleben ...
</P>
<P>
Was aber will uns Amiga da verkaufen? Nun, nach einigen Wochen bin ich
genauso schlau wie vorher: Etwas unglaublich M&auml;chtiges (AmigaOS-Neu) soll
uns mit seiner wahnsinnigen Freundlichkeit (AMI) in ein neues Zeitalter
(AmiVerse) f&uuml;hren.
</P>
<P>
M&auml;chtig, m&auml;chtig .... fast so toll wie die Einf&uuml;hrung der Kartoffel in
Europa. Die hat n&auml;mlich den Hunger bek&auml;mpft.
</P>
<P>
Bis es soweit ist und ich meine alte Lady in Rente schicken kann, mu&szlig; wohl
noch viel Volksmusik bek&auml;mpft werden. Denn ganz so glatt, wie es sich der
eine oder andere vorstellt, wird die ganze Revolution von Bill und Fleecy
nicht werden. Zuviele Machtspielereien umk&auml;mpfen den Computermarkt. Die
Margen steigen wegen der teilweisen Bauteile-Knappheit und des hohen
Dollar-Kurses wieder. Und wer will sich diese gro&szlig;e Zocke schon entgehen
lassen. Mit aller Macht werden die hemds&auml;rmeligen Macher von Amiga bek&auml;mpft
werden.
</P>
<P>
Einzige Chance von Amiga Inc.: Qualit&auml;t
</P>
<P>
Nur dann werde ich der einzige Zyniker mit J.R.-Lachen auf dieser Welt
bleiben (wehe es macht mir einer nach!!) und weiterhin arme, Volksmusik
liebende Rentner ver&auml;ppeln d&uuml;rfen.
</P>
<P>
Machts gut f&uuml;r diesen Monat,
</P>
<P ALIGN="RIGHT">... lebt lang und erfolgreich</P>
<P><B>Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">P.S.: Bei dieser Gelegenheit sei mir ein Hinweis auf eine wichtige Sache&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">gew&auml;hrt. Auch als Zyniker hat man ein Herz f&uuml;r arme Seelen&nbsp;</TD><TD VALIGN="TOP">.....&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
<A HREF="http://www.thehungersite.com" TARGET="_top">http://www.thehungersite.com</A>
</P>
<P ALIGN="RIGHT">
<A HREF="PowerPC3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
