<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Neues zum AmigaNG
-----------------

1. Informationen und Kommentar zum AmigaDE-Player (von Oliver Tacke)

Am 25. August gab Amiga Inc. bekannt, dass der Vorverkauf f&uuml;r den AmigaDE-
Player f&uuml;r Windows und Linux er&ouml;ffnet sei. F&uuml;r $14.95, also rund 35 DM
(sp&auml;ter $19.95, rund 45 DM), erh&auml;lt man den Player, mit dem man AmigaDE
Programme auch unter Windows oder Linux nutzen kann. Dem Paket beiliegen
sollen neben diversen Spielen wie Reversi oder Tic Tac Toe auch einige
Anwendungen. Was f&uuml;r Anwendungen dies sind, wurde nicht bekanntgegeben.

Vertrieben wird der AmigaDE-Player &uuml;ber den neuen AmigaDE Shop
(http://de.amiga.com), in dem man k&uuml;nftig auch AmigaDE-Programme beziehen
k&ouml;nnen soll.

In der Amiga eigenen Mailinglist AmiOpen (open@lists.amiga.com) wurden
einige weitere Details preisgegeben: Wer das Software-Distribution
Agreement (SDA) unterschreibt, kann seine Programme ebenfalls &uuml;ber den
AmigaDE-Shop verkaufen.
Weiterhin werde intern &uuml;ber einen kostenlosen "Light" Player und einen
kostenpflichtigen "Full"-Player mit mehr Features diskutiert. Eine
Entscheidung diesbez&uuml;glich sei jedoch noch nicht in Sicht.

Diverse offene Fragen bleiben, so z.B.: "Wird der AmigaDE-Player das neue
GUI nutzen?" oder "Welche Hardware- und Software-Anforderungen stellt der
Player?".


Pers&ouml;nliche Meinung:

"Es tut sich was." Das war das erste, was mir in den Sinn kam, als ich
h&ouml;rte, Amiga werde in K&uuml;rze den AmigaDE-Player f&uuml;r Windows und Linux
ver&ouml;ffentlichen. Schon bald stellte sich aber ein wenig Ern&uuml;chterung ein.
$19.95 sollte der Spa&szlig; kosten, $14.95, wenn man vorbestellt. "Na ja, wenn
man dann &uuml;berall seine AmigaDE Programme laufen lassen kann... Und Geld
einnehmen, um Lizenzen zu zahlen, m&uuml;ssen sie ja auch irgendwie..." tickerte
es durch mein Gehirn - noch einmal bes&auml;nftigt. Aber Moment, was war denn
das da am Seitenrand? Nur Screenshots von Spielen f&uuml;r Zwischendurch. H&auml;?
Also den Text dazu durchgelesen, der da in groben Z&uuml;gen lautete:

"Amiga Inc. ist wieder einmal begeistert uns etwas zu pr&auml;sentieren (oder
besser: anzuk&uuml;ndigen). Mit dem AmigaDE-Player werde es m&ouml;glich sein, alle
AmigaDE Programme jetzt schon auf Desktops laufen zu lassen. Diverse
Anwendungen und Spiele w&uuml;rden dem AmigaDE-Player gleich beiliegen."

Ich bin der festen &Uuml;berzeugung, dass der AmigaDE-Player in K&uuml;rze erscheint,
aber wozu? Warum sollte sich jemand diesen f&uuml;r einige kleine Spielchen
zulegen, von denen es mehr kostenlose Exemplare f&uuml;r Windows und sicherlich
auch Linux gibt als ich z&auml;hlen kann? F&uuml;r die 100. Tetris-Variante?
F&uuml;r diverse Anwendungen w&auml;re es sicherlich interessant. Ein und denselben
E-Mail-Client f&uuml;r einen PDA und den Desktop: w&auml;r doch was. Da braucht man
sich nicht in mehrere Programme einarbeiten und kann sicher sein, dass man
seine Desktop-Daten auch auf dem PDA nutzen kann - und umgekehrt. Wenn die
Java-Virtual-Machine von Tao wirklich so schnell ist, wie behauptet wird,
k&ouml;nnte man das AmigaDE auch f&uuml;r Java-Anwendungen benutzen. Aber von solchen
sinnvollen Programmen fehlt jede Spur.

Die Grundidee, ein Programm &uuml;berall lauff&auml;hig zu haben, ist unbestritten
sehr interessant. Gleiche Programme &uuml;berall, auch wenn man mal das
Betriebssystem oder die Hardware wechselt. Es scheitert aber meiner Meinung
nach an der Umsetzung. Wer ist schon bereit, rund 35 DM bzw. 45 DM zu
investieren, wenn er daf&uuml;r nur die M&ouml;glichkeit erh&auml;lt, Spielchen von seinem
PDA auch auf dem Desktop zu spielen. Sicherlich muss man abwarten, was das
denn f&uuml;r Applikationen sind, von denen bei Amiga Inc. gesprochen wird. Mit
den richtigen Programmen k&ouml;nnte die Sache richtig an Fahrt gewinnen. Aber
da gibt's ja noch das bekannte Problem der Informations- und
Marketingpolitik seitens Amiga Inc, auf die ich jetzt gar nicht n&auml;her
eingehen will.

Ich f&uuml;rchte, es hei&szlig;t mal wieder: abwarten.

Oliver Tacke &lt;oliver@aakt.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
