<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Leserbrief zur allgemeinen Kritik an AMIGA, Inc. (von Marco Miljak)

Nichts f&uuml;r ungut, aber mittlerweile geht mir das Geheule rund um Amiga,
Inc. und deren ach so furchtbares Management bzw. ihre angeblich so
miserablen Leistungen geh&ouml;rig auf den Keks. Ja, zugegeben, die
Informationspolitik ist nicht gerade berauschend, die ExUp's von McEwen
strotzen vor gezwungener Euphorie w&auml;hrend Fakten Mangelware und die
Formulierungen zu Mi&szlig;verst&auml;ndnissen pr&auml;destiniert sind. Ich habe in letzter
Zeit einen Haufen Kommentare von Usern zu diesem Thema gelesen, und fast
durch die Bank hindurch wird Amiga, Inc. vorgeworfen, sie w&uuml;rden nichts,
aber auch gar nichts hinbekommen. Das ist schlicht und einfach falsch! Da
sei zun&auml;chst mal das AmigaDE/SDK inklusive des aktuellen Updates 1.1
genannt, welches ich (als Programmierer) f&uuml;r ein geniales St&uuml;ck Software
halte. Ferner die Ank&uuml;ndigung und Herstellung des AmigaOne (zwar durch eine
Partnerfirma, aber das ist doch letzten Endes egal), die Kooperation mit
SHARP und die Herstellung von Software f&uuml;r den Zaurus, eine ganze handvoll
anderer Partnerschaften, u.a. mit H&P, die Entwicklung von SHEEP, die
Entwicklung von OS 4.0 und, und, und. F&uuml;r eine Firma, die noch vor etwa 19
Monaten im totalen Nirvana schwebte und Gefahr lief, f&uuml;r immer in der
Versenkung zu verschwinden (die Home Electronics World anno 1999 in K&ouml;ln
war echt toll, stimmt's?) ist das eine betr&auml;chtliche Leistung.

Was manche User zu vergessen scheinen, ist, da&szlig; Amiga, Inc. eine winzige,
kleine, fast unbedeutende Firma ist und bei weitem nicht &uuml;ber die
Ressourcen (sowohl finanzielle als auch personelle) verf&uuml;gt, um mal "gerade
eben" in zwei oder drei Monaten ein brandneues Computersystem inklusive
Hardware, OS und Softwarebundle (nach M&ouml;glichkeit 3D-Ballerspiele der
neuesten Generation und ein Office-Paket a la M$) herzustellen. Von diesem
Standpunkt aus gesehen halte ich die Aktivit&auml;ten von McEwen und Co. f&uuml;r
sinnvoll und produktiv. Sie beschr&auml;nken sich nicht (ausschlie&szlig;lich) auf ein
Desktop-System, wie es wohl die meisten gerne h&auml;tten, sondern strecken die
F&uuml;hler in alle interessanten Richtungen aus. Die Kooperation mit SHARP
beispielsweise ist f&uuml;r viele "Ich will einen Desktop-Amiga"-User eine
langweilige, unbedeutende Angelegenheit, Amiga, Inc. hat dadurch aber einen
Kunden, der Geld in die Kassen sp&uuml;lt, und eine Publicity, die im Endeffekt
auch andere Firmen auf die Leute in Snoqualmie aufmerksam macht. Amiga ist
wieder in den Schlagzeilen, und nach langen Jahren endlich mal mit echten
Produkten und nicht nur mit Seifenblasen und Luftschl&ouml;ssern.

In letzter Konsequenz, erdreiste ich mich jetzt einfach mal zu behaupten,
leidet die Amiga-Gemeinde nicht zentral an der schlechten
Informationspolitik oder Unf&auml;higkeit seitens Amiga, Inc., sondern an zwei
ganz anderen Krankheiten. Erstens mal: Egal, was aus Snoqualmie f&uuml;r
Ank&uuml;ndigungen kommen, sie werden grunds&auml;tzlich von Heerscharen von Usern in
"Unendlichkeits-Threads" in der Luft zerrissen und als totaler Quatsch
abgestempelt. Vor noch nicht allzu langer Zeit wurde gezetert und geflucht,
man m&ouml;ge doch bitte einen PPC-Amiga mit PPC-nativem AmigaOS rausbringen.
Nun passiert genau das und pl&ouml;tzlich hei&szlig;t es, da&szlig; PPC v&ouml;lliger Unsinn sei
und man sich doch besser auf x86 konzentrieren sollte. Vor nicht allzu
langer Zeit wurde gefordert, Amiga, Inc. solle endlich mit der Tradition
der 68x-Rechner ("Classic"-Amigas) brechen und eine v&ouml;llig neue Technologie
auf den Markt bringen. Nun passiert genau das, und wieder geht das Geschrei
los, da&szlig; man doch bittesch&ouml;n die Abw&auml;rtskompatibilit&auml;t wahren solle, und
&uuml;berhaupt, die aktuellen PPC-Boards von anno dunnemals m&uuml;&szlig;ten auch
unterst&uuml;tzt werden. Ich glaube, selbst wenn McEwen in einem ExUp behaupten
w&uuml;rde, die Erde sei rund, g&auml;be es noch ausreichend Leute, die das als
Unsinn verschreien w&uuml;rden. Jeder meint, er habe viel bessere und
produktivere Ideen als Amiga, Inc., jeder denkt, er w&uuml;&szlig;te den ultimativen
Weg zur Rettung des Amigas. Und damit kommen wir dann auch zur zweiten
Krankheit im Amiga-Lager: Es gibt &uuml;berhaupt keine Einheit mehr! Jeder kocht
sein eigenes S&uuml;ppchen, jeder bastelt seinen eigenen Zukunfts-Amiga, jeder
programmiert sein eigenes Next-Generation-AmigaOS. Und um das Theater
vollst&auml;ndig zu machen, wird gleichzeitig auch noch lauthals geschrien und
protestiert, da&szlig; es zu viele Einzelprojekte im Amiga-Sektor gibt. Ja, es
wird sogar Amiga, Inc. selbst vorgeworfen, sie w&uuml;rden zu viel auf einmal
machen wollen.

Fakt ist und bleibt aber: Amiga, Inc. braucht Geld. Und Geld verdient man
mit Produkten. Diese sind in Arbeit oder schon auf dem Markt. Wer nun
meint, er m&uuml;sse es "denen da" in Snoqualmie "zeigen" und den AmigaOne oder
sonst was boykottieren, der soll es eben tun und sich gl&uuml;cklich f&uuml;hlen. Wer
mit den Pl&auml;nen von Amiga, Inc. nicht zufrieden ist, der hat gen&uuml;gend
Alternativen im EDV-Bereich. Den Next-Generation-Amiga wird es geben,
soviel ist schon mal sicher. Und es mag zwar schnippisch klingen, aber bei
einer potentiellen Abnehmerschaft f&uuml;r den AmigaOne (d.h. bei einem
potentiellen Kundenstamm) wie der momentanen Amiga-Community tut Amiga,
Inc. wirklich mehr als gut daran, ihre Existenz und finanzielle Sicherheit
nicht allein an diese zu h&auml;ngen. Ich habe schon mehr als ein halbes Dutzend
mal den Satz gelesen: "Amiga, Inc. soll sich mehr um uns k&uuml;mmern, wir sind
schlie&szlig;lich die K&auml;ufer des AmigaOne". Tatsache ist aber: Egal, was Amiga,
Inc. machen w&uuml;rde, ob PPC- oder x86-OS, ob nativ oder
plattform&uuml;bergreifend, ob AmigaOS4/5+DE oder DE-only, die Amiga-Userschaft
w&uuml;rde sich weiterhin in unz&auml;hlige Lager teilen und jeweils die Hard- und
Software fordern, die kontr&auml;r zu den Pl&auml;nen aus Snoqualmie stehen w&uuml;rde.

Letzten Endes finde ich es irgendwie l&auml;cherlich, da&szlig; in der Amiga-Gemeinde
mittlerweile eine ganze Reihe von Leuten zu denken scheint, in ihnen
schlummere ein kleiner Betriebswirtschaftler und Firmenmanager und sie
w&uuml;rden ja so viel besser wissen, wie man den Amiga an die Weltspitze der
EDV-Welt bringen k&ouml;nnte (ob er jemals dorthin kommen wird, sei mal
dahingestellt). Sicher ist aber folgendes: Weder Fleecy noch McEwen noch
sonst wer bei Amiga, Inc. machen ihre Arbeit aus purer
Menschenfreundlichkeit oder aus einer fanatisch-religi&ouml;s anmutenden
Begeisterung f&uuml;r den Amiga, sie wollen Geld damit verdienen. Auch opfern
sie nicht hin und wieder mal ein paar Stunden ihrer Freizeit, um am DE oder
an sonstigen Pl&auml;nen herumzufeilen, sie machen es hauptberuflich. Damit ist
schon mal gesichert, da&szlig; sie ein echtes Interesse an der Weiterentwicklung
und Vermarktung dieser Maschine haben (ganz im Gegensatz zu Gateway & Co.,
die ein festes Standbein im PC-Markt hatten und daher in keinster Weise auf
den Erfolg von Amiga angewiesen waren!), ebenso auch an einer Vergr&ouml;&szlig;erung
des Kundenstammes. Manch einer nennt das "Community" oder "Amiga-Family",
aber meiner pers&ouml;nlichen Meinung nach geh&ouml;ren diese Begriffe langsam in die
Mottenkiste. Denn "Amiga-Spirit" hin oder her, Amiga, Inc. braucht keine
"Community" sondern Kunden. Ein Herr X oder eine Frau Y, die irgendwo mit
ihrem Zaurus PDA herumsitzen und die von Amiga, Inc. hergestellte Software
benutzen, werden sich ganz bestimmt nicht als "Amiga-Freaks" oder
Mitglieder der "Community" bezeichnen, aber es sind Kunden, die Amiga, Inc.
Geld bringen.

Damit will ich dieses Statement auch abschlie&szlig;en. Ich bin mir sicher, da&szlig;
so manch einer mit meinen Aussagen nicht einverstanden sein wird. In diesem
Zusammenhang will ich klarstellen, da&szlig; ich hier nicht noch eine von diesen
uns&auml;glichen Endlos-Diskussionen vom Zaun brechen will. Es war mir ein
Bed&uuml;rfnis, einfach mal einen Kommentar zu den mittlerweile &uuml;berhand zu
nehmen scheinenden Unkenrufen im Bezug auf Amiga, Inc. zu verfassen. Ich
pers&ouml;nlich bin der Meinung, da&szlig; jeder, der ein echtes Interesse an Amiga
hat, einfach mal abwarten und der Dinge harren sollte, die da noch kommen
werden. Mit Boykottierungen und Protestwellen gegen jede noch so kleine
Idee aus Snoqualmie wird Amiga auf jeden Fall und ganz bestimmt nicht sehr
weit kommen. Einmal abgesehen davon, da&szlig; sich die restliche EDV-Welt &uuml;ber
uns schlapp lacht.....

In diesem Sinne,

Marco Miljak &lt;marco.miljak@it-m.de&gt;


[Anm. d. leit. Red.: Vielen Dank, Marco, f&uuml;r deinen ausf&uuml;hrlichen
Leserbrief! Ich m&ouml;chte kurz etwas anmerken: AMIGAs Zukunftskonzept(?) ist
die eine Sache - dar&uuml;ber l&auml;sst sich, wie du selbst schreibst, heftig
diskutieren. Ich selbst habe den vor einigen Monaten eingeschlagenen Weg
mehrfach kritisiert, und zwar nicht, weil ich nichts anderes zu tun h&auml;tte,
sondern weil ich ihn schlichtweg f&uuml;r falsch halte und die
Erfolgswahrscheinlichkeit dieses Konzepts als sehr niedrig erachte
(beispielsweise im Gegensatz zu der vorher verfolgten "reinen" AmigaDE-
Strategie). Jedoch ma&szlig;e ich mir auf der anderen Seite nicht an, zu
behaupten, dass ich mit dieser Einsch&auml;tzung zu hundertprozentiger
Sicherheit richtig liegen werde - auch ich kann mich mal irren.
Das aber nur am Rande. Grund meiner Anmerkung ist es, eines deutlich zu
machen: F&uuml;r mich pers&ouml;nlich hat es den Anschein, dass viele Anwender auch
deshalb - untertrieben formuliert - nicht gut auf AMIGA, Inc. zu sprechen
sind, weil sie den Eindruck haben, dass sie vom Management nicht ernst
genommen werden:
1. Wenn ein neu gegr&uuml;ndetes Unternehmen anfangs Fehler auf diesem in der
Tat schwierigen Gebiet macht, ist das in den Medien kaum eine Erw&auml;hnung
wert.
2. Wenn die Firma nach mehr als einem Jahr immer noch dieselben
gravierenden Fehler macht, dann braucht sich deren F&uuml;hrung jedoch nicht
dar&uuml;ber zu wundern, wenn sie daf&uuml;r in der &Ouml;ffentlichkeit massiv kritisiert
wird.
3. Wenn das Unternehmen auf diese Kritik nicht nur nicht im positiven Sinne
reagiert, sondern die &Ouml;ffentlichkeit sogar den Eindruck gewinnt, dass die
Kommunikationspolitik eher noch schlechter wird, dann erkennt die F&uuml;hrung
diese Kritik entweder nicht oder sie ist ihr egal. Beides jedoch zeugt von
extremer Unprofessionalit&auml;t, ganz davon zu schweigen, dass sich AMIGA, Inc.
mit diesem Verhalten im Endeffekt selbst schadet.]

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
