<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Messebericht
------------

1. Internationale Funkausstellung (IFA) Berlin (von Thomas Nosutta / ACBB)

In seiner Keynote zur St. Louis-Show erw&auml;hnte Bill McEwen, dass Amiga, Inc.
auf der diesj&auml;hrigen Internationalen Funkausstellung (IFA) bei Sharp
vertreten w&auml;ren. In dem Zusammenhang sei das AmigaDE auf dem SL5000
(Codename "Zaurus") zu sehen. Da der Amiga Club Berlin&Brandenburg direkt
vor Ort ist, wurde ein gemeinsamer Besuch der IFA beschlossen.

Am 26.08.2001 um 11.00 Uhr trafen sich drei Mitglieder des ACBB (A4k, Trion
und Gojira) zur Erst&uuml;rmung des Sharp-Standes auf der IFA. Bei einer Tasse
Kaffee (wie immer zum sagenhaft g&uuml;nstigen Messepreis von nur 5,-) wurde
beschlossen, nicht eher zu weichen, bis wir den SL5000 (Zaurus) sehen
durften.

Bei Sharp (Halle 3.2a) waren wir &uuml;berrascht, dass nicht nur einer zu sehen
war sonder gleich sechs! Leider lief auf vielen nur die Standardsoftware
{Kalender, Adressen, Memo usw.), made by Sharp, auf einem ein Routenplaner
(Made in Germany), und es war noch einer da, auf dem MP3 vorgef&uuml;hrt wurde.
Da es verh&auml;ltnism&auml;&szlig;ig leer war, konnten wir dem Personal einige Fragen zum
Ger&auml;t stellen. Auf unsere Nachfrage, wo denn die AmigaDE-Software sei, kam
als Antwort "Amiga???"! (Also irgendwie kam da bei mir der Wunsch auf, dass
die studentischen Aushilfskr&auml;fte vielleicht doch besser geschult werden
sollten... :-) ) Davon, dass irgendwelche Amiga-Software auf dem SL5000
laufen solle, wisse er nichts! Auch die Frage, ob es denn irgendwer w&uuml;&szlig;te
und wo denn Amiga Inc. sei, wurde mit hilflosem Kopfsch&uuml;tteln beantwortet.
Frustriert zogen wir uns erst mal zu einer Lagebesprechung zur&uuml;ck. Was tun,
hatten wir uns doch fest vorgenommen, nicht eher zu weichen... Weit und
breit nicht ein Hinweis auf Amiga, Inc., das entt&auml;uschte uns nun sehr. :-(

Also auf zur Information f&uuml;r H&auml;ndler und Presse! Einen Versuch war es wert.
Dort schnell nach einem kompetenten Gespr&auml;chspartner f&uuml;r den SL5000
gefragt, und siehe da, Frau Boxberg (Produktmanagerin Sharp Deutschland)
stand vor uns und war sehr erfreut, uns kennenzulernen!
Schon die ersten S&auml;tze zeigten uns, diese Frau wusste wovon sie sprach,
"Amiga" schien f&uuml;r Sie kein Fremdwort zu sein. :-) : Nat&uuml;rlich w&auml;re ein
SL5000 mit AmigaDE vor Ort, und selbstverst&auml;ndlich k&ouml;nnen wir ihn auch
sehen und anfassen.

Sie sagte uns auch, dass Sharp an einer Kontaktaufnahme mit deutschen
(europ&auml;ischen) Amiga-Programmierern interessiert sei! Da f&auml;llt dem Amiga-
Freak eigentlich nur amiga-news.de (da in vielen Sprachen &uuml;bersetzt) als
erste Adresse ein!
Danach f&uuml;hrte sie uns zum Geheimnis des Tages: Einem Prototypen des SL5000,
auf dem diverse AmigaDE-Spiele liefen (Linea und Batty von Titan Computer,
Boxikon von Epic, Convex von NeoNeo und Sol [genauere Beschreibung und
Screenshots der Spiele im AmigaDE-Bereich auf http://www.amiga.com]).
Kurzer Blick auf die Elate-Shell, und wir sind &uuml;berzeugt, dass alles, was
Amiga, Inc. versprochen hat, der Wahrheit entspricht. Der Zaurus lebt und
ist greifbar! (Leider lie&szlig; die Enge, drei Mann und ein PDA, und die
Tatsache, dass der SL5000 nur mit Netzanschlu&szlig; lief, einen genaueren Test
nicht zu.)

Unsere Frage, warum Amiga, Inc. nicht hier sei, beantwortete Frau Boxberg
mit Terminschwierigkeiten, betonte aber, dass sie schon des&ouml;fteren mit
Amiga, Inc. telefoniert habe. F&uuml;r mich entstand der Eindruck, dass Sharp
nicht genau wusste, wo und wie sie Amiga einordnen sollten (Pressepolitik
Amiga, Inc.???).

Der SL5000 selbst liegt gut in der Hand und auch die Tastatur ist bequem zu
bedienen. Da wir aber speziell nur wegen AmigaDE gekommen waren, wurden
sonstige SL5000-Spezifikationen vernachl&auml;ssigt.

Im Laufe des Gespr&auml;chs stand pl&ouml;tzlich jemand hinter mir - und was musste
ich sehen: Einen BoingBall auf dem Hemd! :-)) Es war Sanjay Menon (Vice
President Engineering) von Amiga, Inc. (VK auf der Webgalerie ACBB)! Er war
begeistert, dass sich Amiga-User diese M&uuml;he machen und &uuml;berrascht, dass wir
so interessiert sind. Auf unsere Fragen antwortete er genauso kompetent und
sachlich wie Frau Boxberg. Au&szlig;erdem zeigte er uns seinen pers&ouml;nlichen
SL5000, auf dem noch ein weiteres Spiel, eine Slotmachine, lief.
Alles in allem waren wir sehr zufrieden und verabschiedeten uns artig. Nur
eines mu&szlig;ten wir noch loswerden: "Schade, dass Sharp keine Reklame f&uuml;r
Amiga macht, von einem eigenen Amiga-Stand ganz zu schweigen." Frau Boxberg
antwortete: Man sei dabei, dieses in Angriff zu nehmen, kann es uns aber
f&uuml;r die IFA nicht versprechen.

Leider hat die Auswahl der Programme nur einen Bruchteil dessen gezeigt,
was m&ouml;glich ist. Aber wenn man das, was wir sahen, auf den Desktop
&uuml;bertr&auml;gt, dann steht uns eine rosige Zukunft bevor.
Wir, der ACBB, sind zufrieden und stolz, als erster deutscher Amiga-Club
den SL5000 mit AmigaDE gesehen zu haben.

Also seien wir auf die CeBIT 2002 gespannt, dann hoffentlich mit dem Sharp
SL5000 (powered by AmigaDE)!

Thomas Nosutta &lt;Nosutta@t-online.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
