<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Abschlie&szlig;end
------------

Murphys Gesetz (von Christian Aichinger)

Oder: Wenn etwas schiefgehen kann, dann wird es auch schiefgehen

Mal ganz abgesehen davon, da&szlig; fast jeder Computer-Besitzer dieses Gesetz
schon mehr als einmal am eigenen Leib erfahren durfte, k&ouml;nnte man diesmal
auch die Geschehnisse rund um die diesj&auml;hrig geplante AMIGA WORLD [1] gut
umschreiben. Die maxpo 2001 [2] f&auml;llt aufgrund mangelnden Interesses der im
Apple-Segment vertretenen Firmen, und nicht zuletzt Apple Deutschland
selbst, aus.

Nur was hat die maxpo mit Amiga zutun? Ganz einfach: Der Falke-Media-
Verlag, der Amiga-Usern mit der Publikation AMIGA Plus bekannt sein d&uuml;rfte
und der desweiteren auch zwei andere Nischensysteme mit Lesestoff (Apple
Macintosh mit der "mac life" und Atari-Anwender mit der "ST-Computer")
versorgt, wollte auf der genannten Apple-Messe, sicherlich nicht ganz
uneigenn&uuml;tzig, die AMIGA WORLD 2001 austragen. Mit gro&szlig;er
Wahrscheinlichkeit w&auml;re auch das Gros der im Amiga-Markt etablierten Hard-
und Software-Hersteller, wie auch H&auml;ndler, mit dieser L&ouml;sung recht
zufrieden gewesen, da mittlerweile die meisten, aufgrund der schlechten
Situation des Amiga-Marktes, ein Standbein in die "Obstschale" gestellt
haben, um nicht umzufallen. F&uuml;r jene H&auml;ndler, die in ihrem Internet-Angebot
neben dem Boingball neuerdings auch einen angebissenen Apfel zur Schau
stellen, w&auml;re dies sicherlich eine gute Chance gewesen, ihre Leistungen
auch Mac-Usern schmackhaft zu machen, und auch die PowerMac-Emulation
"iFUSION" w&auml;re sicherlich f&uuml;r einige, wenn auch nicht unbedingt viele, Mac-
User nicht ganz uninteressant gewesen.

Nur wo bleibt bei diesem Sachverhalt "Amiga", um den es bei der AMIGA WORLD
schlie&szlig;lich gehen sollte? Schaut man sich die letzten drei vergangenen
Quartale dieses Jahres mal genauer an, gibt es eigentlich nichts, f&uuml;r das
sich Amiga wirklich r&uuml;hmen oder was eine Amiga-Messe legitimieren k&ouml;nnte.
Das Meiste, wie die Auslieferung verschiedenster PCI-Erweiterungen oder die
Beendigung der Odyssee "iFUSION", kommt viel zu sp&auml;t, um einen ernsthaften
Mac-User aus den Stiefeln zu hauen, geschweige denn den "Classic-Amiga"
noch einmal ins Rampenlicht stellen zu k&ouml;nnen. iFUSION kann einen PowerMac
h&ouml;chstens mit einer kastrierten G3-CPU nachahmen, was einen Mac-User
bestimmt nicht sehr beeindrucken d&uuml;rfte - eher im Gegenteil: Bei Nennung
der Anschaffungskosten f&uuml;r so ein Vehikel (Amiga + PPC + iFUSION + ...)
w&uuml;rde dieser ziemlich schnell das Weite suchen. PCI ist auf der Apple-
Plattform seit Jahren Quasi-Standard, und sogar so etwas heutzutage ganz
Normales wie USB sucht man auf der Amiga-Plattform vergebens. Selbst die
Fortschritte oder besser gesagt die Ank&uuml;ndigungen, die Mr. McEwen und Mr.
Moss in diesem Jahr zu Wege gebracht haben, haben mit Macintosh-Rechnern
rein gar nichts zu tun und sind auf einer Apple/Amiga-Messe herzlich
deplatziert. Oder gibt es schon ein AmigaDE, das unter MacOS X l&auml;uft? Ich
habe davon jedenfalls noch nichts vernommen.

Meiner Meinung nach sollte eine Messe in erster Linie dazu dienen, die
neuesten technologischen Fortschritte eines bestimmten Produktes so gut wie
m&ouml;glich darzustellen. Amiga-Messen erinnerten in den letzten Jahren aber
immer mehr an Tr&ouml;delm&auml;rkte und Verkaufs-Shows, bei denen Technologien zur
Schau gestellt bzw. verkauft wurden, die nur dazu dienten, wenigstens die
schlimmsten Mankos der leider immer noch aktuellen "Classic-Amiga"-
Generation zu eliminieren. F&uuml;r die F&uuml;hrungsriege in Snoqualmie waren solche
Messen zus&auml;tzlich auch immer ein guter Anla&szlig;, alle vorher angek&uuml;ndigten
Roadmaps zu kippen, um damit Amiga-Firmen und User mehr und mehr zu
verunsichern. Dass die Amiga-Gemeinschaft mit solch einem Gebaren im
Vergleich zu anderen Plattformen nie auch nur ansatzweise deren
technologischen Stand erreichen kann, ist klar. Die "AMIGA WORLD" braucht
dringend etwas Neues. Bevor es aber von diesem "Neuen" nicht mehr als
absturzfreudige Prototypen (oder leere Papp-Geh&auml;use mit angest&ouml;pselten TFT-
Bildschirmen) und Beta- oder sogar nur Alpha-Versionen gibt, kann eine
Amiga-Pr&auml;sentation auf einer Apple-Messe nur als Witz bezeichnet werden.

Um auf Murphys Gesetz zur&uuml;ckzukommen: Ist es wirklich so schlimm, wenn mal
etwas schief geht? Ich denke nein. Eine um ein paar Monate verlegte AMIGA
WORLD, k&ouml;nnte Amiga eine Menge &Auml;rger und den letzten treuen Anh&auml;ngern eine
Menge Spot ersparen.


In diesem Sinne bis zur n&auml;chsten Ausgabe,
Christian Aichinger

[1] http://www.amiga-messe.de
[2] http://www.maxpo2001.de

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
