<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. Neuigkeiten von der Amiga Arena

Amiga Arena (http://online-club.de/~ARENA/) informiert:

틻miga Arena News
(06.06.2001)

Amiga Arena - The Boss Update!
Nachdem einige User Probleme mit dem Keyfile hatten,
wurde von Frederic Laboureu die Programm Datei &uuml;berarbeitet!
Alle User die Probleme mit dem Keyfile haben bitte ich erneut das
Archiv Down zu loaden!
Besonderen Dank an Harald N. f&uuml;r den Hinweis und  Frederic L.
f&uuml;r das schnelle Update!


틻miga Arena News
(12.06.2001)

Amiga Arena Vollversion!
Mit der Genehmigung von Stefan Berge erm&ouml;glicht,
die Amiga Arena die Vollversion von "FileCutter"
"File Cutter" erm&ouml;glicht es Ihnen Dateien beliebiger L&auml;nge
in soviel kleine Teile zu zerteilen wie sie m&ouml;chten.
Dadurch ist es Ihnen nun auch m&ouml;glich eine z.B. 4MB gro&szlig;e Datei, die Sie
nicht mehr packen k&ouml;nnen, verteilt auf 5 Disketten (720 KB) zu
transportieren. 
In der neusten Version  geht das dann sogar mit Dateien die mit den
NortonCommander auf dem PC geteilt wurden.
Zum Beispiel kann man so ein riesiges Verzeichnis mit dem LHA-Packer packen
und die  entstandene Datei anschlie&szlig;end mit Hilfe des 'FileCutter' in
Diskettengro&szlig;e Dateiteile  zerschneiden. Diese Dateiteile nutzt die 
Diskettenkapazit&auml;t optimal und es ist ein  problemloser Transport der Datei 
&uuml;ber Disketten m&ouml;glich.
Ein weiteres Beispiele w&auml;hre z.B. eine riesige Animationen die man sonst 
nur auf Massenspeichern wie Wechselplatten oder MO-Laufwerken weitergeben
k&ouml;nnte.
Mit dem 'FileCutter' k&ouml;nnen Sie diese Datei nun in Diskettengro&szlig;e Dateien
zerteilen und so transportieren.

Dank an Andreas Magerl der die Vollversion zur verf&uuml;gung gestellt hat!
 

틻miga Arena News
(12.06.2001)

Amiga Arena Sonderpreis Aktion!
In Zusammenarbeit mit Nemeth Miklos erm&ouml;glicht
die Amiga Arena einen Sonderpreis f&uuml;r "LangTools"
Mit "LangTools" lassen sich Texte einfach &uuml;bersetzen!
Es wird einfach ein Text eingeladen und gleichzeitig kann man
in einem Editor den Text &Uuml;bersetzen!
Verschiedene Sprachen stehen zur Auswahl und weitere werden folgen.
LangTools befindet sich noch in der Entwicklung und
der Author Nemeth freut sich &uuml;ber Ihr Feedback!

Amiga Arena Interview Aktion!
Zeitgleich zur Sonderpreis Aktion ist ein Interview mit Nemeth Miklos
dem Entwickler von "LangTools" Online!


틻miga Arena News
(12.06.2001)

Amiga Arena Prerelease!
Das beliebte WB Spiel "ArTKanoid" (Breakout Clone) von Thilo K&ouml;hler
ist in der Version 1.2 exklusiv bevor Aminet Online!

Amiga Arena Updates!
"Blade" das Action RPG Spiel von Mark Sheeky liegt in der HD Version zum
Download bereit.  Exclusiv in der Deutschen Version!

Amiga Arena - "The Boss" Deutsche Locale!
Die Deutsche Locale f&uuml;r "The Boss" wurde von Richard Kapp erstellt
und befindet sich im Archiv!


틻miga Arena News
(18.06.2001)

Amiga Arena Interview Aktion!
Zeitgleich zur Sonderpreis Aktion ist ein Interview mit Stefan Kost
dem Entwickler von "SoundFX" Online!


틻miga Arena News
(22.06.2001)

Amiga Arena Vollversion
Mit der Genehmigung von Carsten Magerkurth und Andreas Magerl
erm&ouml;glicht die Amiga Arena die Freigabe von Offensive  COLOURS!
Offensive COLOURS ist die spannende Synthese aus Tetris und Breakout. Sie
steuern ein kleines Raumschiff in der Mitte des Bildschirms; farbige Bl&ouml;cke 
wachsen von den Bildschirmr&auml;ndern heraus auf Sie zu. Um sie aufzuhalten, 
sind Sie mit einer farbigen Scheibe bewaffnet, die Sie auf die Bl&ouml;cke 
schie&szlig;en k&ouml;nnen.
Falls die Farben der Scheibe und des beschossenen Blocks &uuml;bereinstimmen,
w&auml;chst Ihre Punktzahl und der Block verschwindet. Falls nicht, wird die
Scheibe zu Ihnen zur&uuml;ckgeworfen, wobei die Farben des Blocks und der 
Scheibe ausgetauscht werden. Die neue Farbe der Scheibe erm&ouml;glicht dann 
vielleicht die Eliminierung eines anderen Blocks.
Wenn Ihre Scheibe auf eine Reihe von Bl&ouml;cken trifft, die die gleiche Farbe
besitzen, verschwindet die gesamte Reihe. Der erste Block bedeutet einen
Standard-Scoregewinn, jeder weitere die zweifache Punktzahl.
Das Spiel endet, wenn die Bl&ouml;cke Sie erreicht haben.

Amiga Arena Vollversion!
Mit der Genehmigung von Wayne Ashworth liegt das 
Action Spiel "Renegarde" zum Download bereit.
(Hierbei handelt es sich um ein Freeware Spiel!)
"Renegarde" ist ein "Alien Breed" Clone f&uuml;r 2 Spieler!
Spielespass und das gelungene Design sprechen f&uuml;r sich!


틻miga Arena News
(23.06.2001)

Amiga Arena Sonderpreis Aktion!
In zusammenarbeit mit Andre Beer erm&ouml;glicht die Amiga Arena einen
Sonderpreis f&uuml;r GeoWorld!
GeoWorld ist das einzige Erdkunde Programm f&uuml;r den Amiga das noch
weiterentwickelt wird!
F&uuml;r weitere Informationen besuchen sie bitte die
GeoWorld Homepage - http://GeoWorld.AmigaSoft.de   
Amiga Arena - GeoWorld Aufruf!
GeoWorld ist eines der ganz wenigen Programme die sich von der &uuml;blichen
Amiga Software abhebt!
Die Entwickler haben eine Vielzahl von Informationen und Daten
zusammengetragen um GeoWorld so umfangreich wie m&ouml;glich zu gestalten.
Dennoch "lebt" solch ein Programm von seinem aktuellen Daten bestand.
Um schnellere Updates zu erm&ouml;glichen und weiterhin ein vielesitiges 
Programm anbieten zu k&ouml;nnen,    brauchen die Entwickler Eure mithilfe!
Folgende Aufgaben stehen zur Verf&uuml;gung!
Weiterf&uuml;hrung der bereits begonnenen Neuerfassung der Naturdaten zu den
L&auml;ndern.
Eine Mitarbeit an den Informationsdaten von GeoWorld w&uuml;rde demzufolge
erfordern,    die zur Verf&uuml;gung gestellten QuellTexte    (abgescannte
Lexika-Seiten, Html-/Text-Dateien aus dem Internet, z.T. auch in Englisch)  
gedanklich zu verarbeiten und selbst&auml;ndig in entsprechende Texte (z.B.
Beschreibung des    Naturraumes eines Landes) zu fassen.
Eine kostenlose Vollversion wird nat&uuml;rlich jeweils zur Verf&uuml;gung gestellt.
Weitergehende Verg&uuml;tungen - sprich Umsatzbeteiligung - bei entsprechend
umfangreicher    Mitarbeit sind m&ouml;glich, allerdings sind hier keine Wunder
zu erwarten...
Wer Interesse hat bitte mail an: Andre Beer - AndreBeer@addcom.de 
Amiga Arena Nachwort   
Sicherlich fragen sich viele warum das ganze?
Informationsquellen bietet das Internet und zahlreiche Programme f&uuml;r den PC
sicherlich genau so!
Ich aber geh&ouml;re zu den wenigen Amiga Usern die "Amiga only" sind und ich
pers&ouml;hnlich es f&uuml;r sehr wertvoll halte    das solche Programme auf dem 
Amiga weiterhin entwickelt werden!
Zudem macht es mir um so mehr spass Informationsquellen auf dem Amiga zu
nutzen!
Ich kann Euch nur darum bitten Programme wie AmiAtlas und Geoworld mit
Feedback etc. zu unterst&uuml;zen!
Olaf K. - Amiga Arena


틻miga Arena News
(24.06.2001)

Amiga Arena Vollversion!
Mit der Genehmigung von Carsten Magerkurth und Andreas Magerl
erm&ouml;glicht die Amiga Arena die Freigabe von "Coulours Professional"!
Dies ist eine weitere Version des Puzzel Spiels "Offensive Colours"!
"Colours Pro" ist die spannende Synthese aus Tetris und Breakout!


틻miga Arena News
(28.06.2001)

Amiga Arena Vollversion
Mit der Genehmigung von Michael Taupitz und Andreas Magerl
erm&ouml;glicht die Amiga Arena die Freigabe von "Tautrix"!
Bei "Tautrix" handelt es sich um ein Tetris &auml;hnliches Puzzel Spiel!

Kurzbeschreibung:
---------------
Bausteine m&uuml;ssen auf dem Spielfeld farbig sortiert abgelegt werden und 
m&ouml;glichst ohne L&uuml;cken!
Wenn dabei ein Quarder (4x4) ensteht,so verschwindet dieser vom Spielfeld
und man hat wieder mehr Platz.
Da allerdings nur der Quarder verschwindet ist es nicht einfach die
&uuml;berstehenden Teile zu umwandern!


틻miga Arena News
(02.07.2001)

Amiga Arena Vollversion!
Mit der Genehmigung von Damir Arh
erm&ouml;glicht die Amiga Arena die Freigabe von "StopMen&uuml;"!

StopMen&uuml; ist ein Start Bar Programm mit vielen Features!
 
- Startet Installierte Programme!
- Controll System f&uuml;r Commodities!
- Direkter Zugriff auf Prefs Programme ( Ersatz f&uuml;r Exchange)
- Screen Kontrolle mit Snapshots in IFF!
- Fenster Kontrolle auf der WB!
- Glow ode New Icon Stil!   

Amiga Arena Nachtrag!
Der Download von "OffColours" ist nun wieder m&ouml;glich!

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
