<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. Vorstellung: Quake-Conversions (Battle-Chess, Airquake und QuakeRally)

Was tun, wenn man Lust auf Computerspiele hat, aber nichts wirklich
interessantes ver&ouml;ffentlicht wird? Wenn man Schach spielen m&ouml;chte, da&szlig; alte
Battle Chess aber viel zu angestaubt ist? Wenn man gerne mal ein
spektakul&auml;res 3D-Autorennen zocken will, aber nix geeignetes zur Hand ist,
oder es einen mehr zu Actionshootern wie Zeewolf oder Coala zieht, diese
aber m&ouml;glicherweise bereits drei mal durchgespielt hat? Gleich drei W&uuml;nsche
auf einmal also und die einzige Neuank&uuml;ndigung f&uuml;r diesen Monat ist Aqua?
Ach: und Geld hat man auch so gut wie keins? Aussichtslos? - Mittnichten.
Man braucht nur Quake. F&uuml;r dieses Spiel gibt es n&auml;mlich sogenannte
"Conversions". Das sind Programme, die die Quake-Engine nutzen und sonst 
nix mit dem Egoshooter gemein haben. Da diese auch mit allen Executables 
(PPC, GL...) zusammenarbeiten, lohnt sich doch mal einen Blick drauf. 
Vielleicht schlummert dort ja die eine oder andere Perle und wartet nur 
darauf entdeckt zu werden. Ich habe alle drei auf der CD zur CU 25. 

Fangen wir direkt mit der wohl au&szlig;ergew&ouml;hnlichsten Conversion an: Quake-
Battle-Chess! Die Installation ist denkbar einfach: man entpackt das .zip 
File in ein Unterverzeichniss (in diesem Beispiel QBC) im Quake-Ordner. 
Quake Battle Chess ist ein reines Internetspiel, das hei&szlig;t man braucht 
einen zweiten menschlichen Gegner. Einer der beiden startet als Server, der 
andere als Client:

als Client: -game QBC +map chess ~connect 129.21.106.161 (oder so)
als Server: -game QBC +map chess -listen 16 +teamplay 1 +deathmatch 1

Screenshot:
<IMG SRC="../extra/chess.jpg" ALT="Screenshot">

Also starten wir einfach einmal Quake-Battle-Chess und schauen, was uns da
erwartet. Es erscheint beim Laden ein (nicht ganz so berauschendes)
Hintergrundbild und QBC f&auml;hrt hoch. Dann habe ich die Wahl zwischen Braun,
Rot und der Zuschauerrolle zu entscheiden. Die beiden Kontrahenten stehen
sich gegen&uuml;ber, da&szlig; Schachbrett in der Mitte. Dort sind synonym zum
klassischen Schach die Figuren (hier nat&uuml;rlich Monster mit schwerer
Bewaffnung angeordnet). Die Regeln bleiben die gleichen, die Steuerung ist
diesselbe wie bei Quake. Zuerst nimmt man eine Figur, indem man den Blick
auf diese richtet und dann RETURN dr&uuml;ckt. Sofort schaut man aus der Sicht
dieser Figur und geht seine Felder. Dann dr&uuml;ckt man wieder RETURN um die
Figur abzustellen. Der Computer ist so intelligent zu entscheiden, ob ein
Zug legal war oder nicht und erkennt auch Schachmatt (warum also nicht
gleich eine Einspielerfunktion einbauen?). Treffen zwei Spielfiguren
aufeinander, erfolgt ein erbitterter Kampf. Hier macht es noch Spa&szlig;, seine
Bauern zu opfern: Fazit: Eine Funktion f&uuml;r einen Spieler w&auml;re der absolute
Hammer gewesen. So leider nur Mittelma&szlig;.


Der Start von Airquake verl&auml;uft &auml;hnlich wie beim Battle Chess. Man entpackt 
die Daten in einen Ordner im Quake-Verzeichniss (zB. Air). Da es hier eine 
Einspielerfunktion gibt, lassen wir den Client/Server-Start einmal weg und 
beginnen direkt damit:

quake -game air

Screenshot:
<IMG SRC="../extra/air.jpg" ALT="Screenshot">

In der Konsole tippt man dann map air1 (bis 3) oder aircity und hat so auch
noch verschiedene Level zur Auswahl. Wie alle Flugsimulatoren ist auch
Airquake ein bisschen komplizierter, deshalb gibt es hier nur einen kurzen
&Uuml;berblick. Es ist eine Kurzanleitung um das feindliche Radar im 3. Level zu
zerst&ouml;ren. Die Musterl&ouml;sung gibt es als Demo, also braucht man sich dieses
nur anzuschauen, wenn es Probleme geben sollte. Aber nun weiter zu unserem
QuickStart: In der Konsole startet man mit map air3 den dritten Level. Nun
w&auml;hlt man per Nummerntastatur seine Maschine. Wir nehmen den Stealth 
Fighter mit der "3". (1:DogFighter; 2:Bomber; 4:A-10 5: X-29 
6:Kampfhubschrauber 7:Mobiles SAM Fahrzeug 8:Kampfpanzer 9:gepanzerter 
Wagen 10:Hovercraft).
 
Nachdem man mit RETURN best&auml;tigt befindet man sich an Bord des Stealth´s.
Automatisch wird die Erlaubnis zum Start erbeten (Dies erfolgt mittels 
eines gesampelten Funkspruches, hiervon gibt es jede Menge im Spiel). Mit 
der "8" werden die Maschinen hochgefahren. Man f&auml;hrt auf das Rollfeld und 
wendet sich nach rechts. Nun mu&szlig; man die "8" immer wieder schnell 
hintereinander dr&uuml;cken um zu beschleunigen. Sp&auml;testens hier wird klar, da&szlig; 
die Steuerung nicht ganz einfach ist, man auf manche Tastenkombinationen 
einfach nicht von alleine kommt. Hier gilt es die Anleitung genau zu 
studieren (nat&uuml;rlich englisch). Man hebt ein bisschen die Nase (des 
Fliegers! indem man nach "oben" schaut) und am Ende der Startbahn hebt man 
dann ab! Nun steigt man, bis man die Decke erreicht (es gibt in der Tat 
eine obere Begrenzung: die Erde ist keine Scheibe, sie ist eine Schachtel). 
Es kommen ein paar Gegner, die k&ouml;nnen allerdings ignoriert werden, da man 
genug Panzerung hat. Wenn man in den oberen H&ouml;henlagen ist, wendet man sich 
den drei wei&szlig;en Objekten auf einem H&uuml;gel an der K&uuml;ste zu - das feindliche 
Radar. Mit der "3" w&auml;hlen wir nun als Waffe die "Pavewaybomb" (was immer 
das ist). Wenn man die rechte Maustaste dr&uuml;ckt (und gedr&uuml;ckt h&auml;lt) gibt es 
eine "Bombensicht". Mit "W" fliegen wir auch bewaffnet gerade auf das Ziel 
zu. Mit der Maus gilt es nun den roten Kasten (welcher nun erschienen ist) 
exakt auf das Radar zu zentrieren. Feuer mit der linken Maustaste. Rechte 
Maustaste l&ouml;sen, abdrehen, rechte Taste und "W" wieder dr&uuml;cken, mit der "9" 
sehen ob die Bombe einschl&auml;gt, zur Not vorgang wiederholen. Nachdem nun das 
Radar in die Luft geflogen ist (oder man keine Munition mehr hat) mu&szlig; man 
landen. Mit der "7" reduzieren wir unseren Schub auf ca. 75% und tauchen in 
tiefere Regionen. Wir kreise &uuml;ber dem Flugzeugtr&auml;ger, bis die 
Geschwindigkeit zur&uuml;ckgegangen ist und fliegen in einem Winkel von ungef&auml;hr 
10&#176 an. Kurz bevor wir aufsetzen gilt es durch dr&uuml;cken der "7" schnell 
hintereinander den Fighter zum stehen zu bringen (sollte man das nicht 
schaffen, schnell mit der "8" wieder beschleunigen und es nochmals 
versuchen) Steht man endlich, setzten wir den Schub wieder auf 25% und 
rollen gem&uuml;tlich zum Lager, wo die Maschine repariert und aufgeladen wird.

Fazit: das klingt nicht gerade einfach - ist es auch nicht. Und erschwerend 
kommt hinzu, da&szlig; auch die Geschwindigkeit nicht ann&auml;hernd an die originale 
heranreicht. Da ich mich &uuml;berhaupt nicht mit dem ganzen anfreunden konnte: 
negativ


Last but not least gibt es auch noch ein Autorennen f&uuml;r Quake. Den Start 
d&uuml;rfte jetzt keinen mehr &uuml;berraschen:

quake -game rally +map start

Screenshot:
<IMG SRC="../extra/rally.jpg" ALT="Screenshot">

&Auml;hnlich wie bei Quake befinden wir uns am Anfang im Auswahlbildschirm. Es
gibt 3 verschiedenen M&ouml;glichkeiten (Practice-&Uuml;ben) und Time Trial (einmal
normal und einmal als Nighttime Nightmare). Ausw&auml;hlen tue ich, indem ich in
die daf&uuml;r vorgesehene Box einfahre. Die Steuerung ist eigentlich ganz
einfach, bedarf aber etwas &Uuml;bung. Denn wenn ich die Maus nach links bewege,
geht nicht der Wagen nach links, sondern der Blick. Der Wagen folgt dann 
dem Blick. Wenn man allerdings das ganze zu ruckartig macht, kann es 
schonmal zu dem einen oder anderen Crash kommen. Ansonsten gibt es nicht 
viel neues zu lernen. Wenn man sich auf der &Uuml;bungsstrecke ausgetobt hat, 
geht es zum Time-Trial. Die Strecken sind identisch, der Unterschied ist, 
da&szlig; die Nightmare-Variante nachts spielt. Als Lichtquelle hat man nur seine
Scheinwerfer. Das Ziel ist ziemlich einfach: man mu&szlig; den Kurs abgefahren
haben, bevor der Wagen explodiert oder die Zeit um ist. Dies bedarf zwar
einiger &Uuml;bung macht aber ungeheuer viel Laune. Die Geschwindigkeit ist
akzeptabel, will hei&szlig;en identisch mit dem Original-Quake). Es gibt vier
verschiedenen Tracks, nach bestandener Runde jeweils einen neuen. Und 
sollte man die schaffen (ich noch nicht), verspricht die Anleitung einen 
ganz speziellen Bonus: Ein Extralevel mit dem Namen "Cult". Es geht darum 
Duke Nukem zu verhaften! Leider habe ich es nicht geschafft (zeitlich) die
Hintergrundstory hierzu zu &uuml;bersetzten, werde dies aber bald nachholen,
sobald ich in diesen Level vorgedrungen bin. Solange m&uuml;sst ihr mit dem
Original-Plot zurechtkommen:

    Long time annoyed at being dethroned as king of the first-person
    gaming genre, Duke Nukem took refuge in an abandoned farmyard
    deep in the Australian outback. Over the period of a year, Duke
    collected together like-minded comrades from around the world
    to form the 'Duke Cult' - their intention was to somehow take
    revenge on the Quake soldiers of the world, and regain the
    position he should never have lost. They devised a cunning plan..

    The cults solution was simple; resurrect the first episode
    Quake boss. The giant red demon was the only beast to really
    bring fear to the hearts of Quake soldiers, yet this time around
    they would need to be careful not to place him near any
    electrical equipment..

    The plan was perfect. As a cult, and being a game plot, they were
    easily able to summon the demon back into living form - located
    this time in a much safer place - then they would lay low long
    enough to allow the demon to regain the strength he lost
    being motionless in the death void for a year. *cue spooky music*

    Quake Headquarters operatives become aware of Duke's hideous
    plans after hearing bizarre stories about kangaroo populations
    in central Australia dropping considerably. There had also been
    numerous sightings of "an obnoxious blond guy" in the otherwise
    quiet outback towns. Reconnaissance proved the fears of an
    attempted Duke revival to be true!

    Time was of uttermost importance - whatever the cult's plan was,
    there was no way to tell how far evolved it was. With just
    5 specialised Quake Soldiers stationed across outback Australia,
    the mission was going to be a tough one. The soldiers were
    oredered to immediately travel to the abandoned farmyard and
    engage the enemy on arrival.

    Intelligence showed 20 cult members stationed at the farm,
    although it was impossible to identify which member was Duke
    himself. The mission: arrest Duke at all costs.


Nat&uuml;rlich l&auml;&szlig;t sich QuakeRally auch im Internet zocken und hier macht es
erst richtig Spass, wenn man mit mehreren Freunden &uuml;ber die Tracks 
brettert. Es gibt nat&uuml;rlich auch verschiedene Fahrzeuge.

Fazit: QuakeRally ist mein absoluter Favorit. Die Soundeffekte machen echt 
Spa&szlig;, die Grafik ist flott: unbedingt antesten.


Diese (und viele andere) Conversionen sind auf jeden Fall eine 
Bereicherung. Vor allem, da sie nichts kosten bieten sie f&uuml;r jeden 
Geschmack etwas. Es ist schon erstaunlich, wie vielseitig einsetzbar die 
Quake-Engine ist. Nat&uuml;rlich haben sich das auch andere zu Nutzen gemacht 
und es gibt einen haufen kommerzieller Konversionen. Eine davon, Malice 
habe ich bereits getestet, andere werden noch folgen. Denn eins ist schon 
mal sicher: Obwohl es wenig neue Spiele gibt, wird das "Futter" auf dem 
Amiga noch lange nicht ausgehen. In diesem Sinne w&uuml;nsche ich euch angenehme 
Schachabende bzw. Auto-/Flugrennen.

J&uuml;rgen Theiner

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
