<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Vorwort
-------

+++ K&ouml;lner Amiga-Messe vom 20. bis 22. September +++ Erscheinen des Amiga 
One verz&ouml;gert sich voraussichtlich bis Oktober +++ Verkauf des AmigaOS 4.0 
beginnt wahrscheinlich etwa zur selben Zeit +++

Willkommen damit zur neuen Ausgabe von AMIGA aktuell.

An dieser Stelle m&uuml;ssen wir eine schlechte Nachricht in eigener Sache 
bekannt geben: In den letzten Monaten ist bei den Hard- und 
Softwarentwicklern bzw. -h&auml;ndlern die Bereitschaft, Preise f&uuml;r das AMIGA-
aktuell-Gewinnspiel zu stiften, leider immer mehr zur&uuml;ckgegangen. Zwar ist 
dies zweifellos vor allem in der katastrophalen Amiga-Situation begr&uuml;ndet, 
nichtsdestotrotz macht ein Gewinnspiel ohne Preise keinen Sinn.
Aus diesem Grund haben wir uns nach einiger Diskussion dazu entschlossen, 
das AMIGA-aktuell-Gewinnspiel vorerst auszusetzen. Sowie uns jedoch wieder 
gen&uuml;gend Preise f&uuml;r mindestens vier Ausgaben zur Verf&uuml;gung stehen, werden 
wir die Rubrik wiederbeleben.

In der Zwischenzeit werdet ihr aber dennoch nicht auf die Meinungsfrage 
verzichten m&uuml;ssen, sie wird von nun an in leicht ver&auml;nderter Form und 
nat&uuml;rlich ohne Gewinnm&ouml;glichkeit in der Rubrik "Forum" gestellt. Bitte 
meldet euch auch weiterhin mit euren Kommentaren zu Wort!
 

Zu den regelm&auml;&szlig;igen Aufrufen:
    
* An dieser Stelle eine Bitte: Jeder Artikelschreiber freut sich &uuml;ber       
  Lob, aber auch &uuml;ber konstruktive Kritik, und wird durch sie motiviert.    
  Scheut euch also bitte nicht, eure Meinung zu den verschiedenen Beitr&auml;gen  
  zu &auml;u&szlig;ern, entweder, indem ihr direkt an die Autoren schreibt, oder aber  
  an AMIGA aktuell (aakt@aakt.de).

* Wir suchen st&auml;ndig Mitarbeiter, die regelm&auml;&szlig;ig, unregelm&auml;&szlig;ig oder         
  einmalig Beitr&auml;ge zu AMIGA aktuell beisteuern wollen. Inhaltlich sind     
  einer Mitarbeit kaum Grenzen gesetzt. Wer Interesse hat, sollte sich      
  an aakt@aakt.de oder christian@aakt.de wenden.


Viel Spa&szlig; jetzt bei dieser Ausgabe,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
