<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Editorial der NoCover</TITLE>
  </HEAD>

  <BODY background="int_bg.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD width="70">&nbsp;</TD>
        <TD>
          <BR> 
          <CENTER>
            <IMG src="edito.gif" width="275" height="85" alt=""><BR>

            <H2><B>zur NoCover #106 (01.01.2003)</B></H2>
          </CENTER>

          <P>Liebe Leser(Innen) !</P>

          <P>Tjaaa, wie fange ich nun an? Nat&uuml;rlich, erst einmal ein
          kr&auml;ftiges <B>Prosit Neujahr !</B> Schlie&szlig;lich hatten wir gerade
          Jahreswechsel und das nun schon zum dritten Male in diesem Jahrtausend. Ich
          hoffe all eure stillen und lauten W&uuml;nsche gehen wohlwollend zu eurer
          vollen Zufriedenheit in Erf&uuml;llung. Aber alles kann man auch nicht
          bekommen, deshalb seid nicht traurig, wenn der eine oder andere Wunsch
          einfach auf der Strecke bleibt und sich nicht erf&uuml;llen will.</P>

          <P>Gl&uuml;cklicherweise erreichte mich vorgestern noch der Messebericht
          von Markus Castro. Ich hatte schon "bangig Angst" selbst schnell ein paar
          Zeilen schreiben zu m&uuml;ssen. Das hat sich nun gl&uuml;cklicherweise
          er&uuml;brigt, denn ich h&auml;tte in meinem Bericht mehr die vorhandene
          Wohnzimmerathmosph&auml;re hervorgehoben, um den gravierenden Unterschied
          zu vergangenen Amigamessen aufzuzeigen. Und der eigentliche Messecharakter
          w&auml;re dann vielleicht auf der Strecke geblieben. Aber noch ein Wort zu
          der gigantischen Demonstration des Pegasos. Der ganze Raum wurde dominiert
          von den 30 Rechnern mittig im Raum im langen Karree angeordnet. Alle
          Ger&auml;te in einem stahlmattblauen Desktopgeh&auml;use (etwas gewaltiger
          als ein A4000-Desktop) und 15-Zoll Flatscreen, einer (Mini)Tastatur und
          einer Maus mit sehr kleiner Aufl&ouml;sung, denn die Cursorstrecke war
          bestimmt 20mal l&auml;nger gegen&uuml;ber einer gleichen
          Amiga-Mausbewegung. Ich muss sagen - sehr gew&ouml;hnungsbed&uuml;rftig.
          Aber lest bitte den Messebericht von Markus, er ist entschieden objektiver.
          </P>

          <P>Jetzt ein paar Worte an die CD-Empf&auml;nger der NoCover. Es ist
          wirklich kein Hinderungsgrund auch aktiv an der Gestaltung der NoCover
          teilzunehmen. Schickt mir einfach eure Beitr&auml;ge auf Disketten oder CD.
          Sie m&uuml;ssen auch nicht schon html-m&auml;&szlig;ig aufbereitet sein,
          das kann ich schon f&uuml;r euch &uuml;bernehmen. Ihr k&ouml;nnt aber auch
          zu einem Freund/Bekannten gehen und lasst eure Beitr&auml;ge von denen an
          mich per Mail senden. Wer willig ist findet auch einen Weg. Es besteht
          wirklich keinen Grund, dass ihr im Hintergrund bleiben m&uuml;sst.</P>

          <P>Nun viel Spa&szlig; mit der diesmal etwas d&uuml;nn geratenen
          NoCover<BR>

          Wolf.<BR>
          </P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

