<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Richtlinien in der NoCover</TITLE>
  </HEAD>

  <BODY background="int_bg.gif" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD width="70">&nbsp;</TD>

        <TD>
          <center>
          <img src="int_richtlinien.gif" width=310 height=70 alt="">
          </center>
          <H3><B>Wie schreibe ich einen Artikel/Beitrag f&uuml;r
          die NoCover?</B></H3>

          <P>Eigentlich ist das ganz einfach. du brauchst dir nur ein Thema
          auszusuchen, das dich sehr interessiert oder wo du dich gut auskennst. Dann
          schnappst du dir irgendeinen Texteditor oder eine Textverarbeitung und
          tippst einfach drauf los.</P>

          <P>Da wir ein gutes Erscheinungsbild haben wollen und vor allem ein gutes
          Magazin erstellen wollen, sind hier einige Richtlinien, die unbedingt
          beachtet und eingehalten werden m&uuml;ssen:</P>

          <UL>
          <LI>Erst &uuml;berlegen, dann schreiben!!!</LI>

          <LI>Texte bitte in Deutsch und wenn m&ouml;glich bitte ohne gro&szlig;e
          Mundartf&auml;rbungen, damit ein Holsteiner auch lesen kann, was ein Bayer
          geschrieben hat und umgekehrt. Texte mit Beleidigungen, Schimpfw&ouml;rtern
          und &auml;hnlichem (damit ist auch die F&auml;kalsprache gemeint) werden
          nicht ver&ouml;ffentlicht!</LI>

          <LI>Keine Streitereien unter den Autoren! Wenn jemand den anderen
          kritisieren will, dann bitte in einen vern&uuml;ftigen Ton und wenn
          m&ouml;glich mit Begr&uuml;ndung!</LI>

          <LI><B>Beitr&auml;ge d&uuml;rfen keine Copyrightsverletzungen, keine
          Gesetzes&uuml;bertretungen oder Aufforderung zu solchen, keine Pornographie
          (Text und/oder Bild), keine wohlwollende oder verherrlichende
          Erw&auml;hnung &uuml;ber indizierte Spiele und keine absichtliche
          Falschmeldungen aufweisen. Testberichte &uuml;ber indizierte Spiele werden
          generell nicht ver&ouml;ffentlicht.</B></LI>

          <LI>Am Ende des Artikels steht der Realname des Autors. Bitte keine
          K&uuml;rzel oder sonst irgendwas. Dies kann meinetwegen zus&auml;tzlich
          drinnestehen, aber der Realname <B>MUSS</B> am Ende des Artikels stehen.
          Bitte nicht am Anfang des Artikels. Alleine schon wegen der
          <B>&Uuml;bersicht</B> und des <B>Copyrights</B>.</LI>

          <LI>Der Beitrag sollte als HTML-Datei nach dem HTML-Standard 3.2 layoutet
          sein. Beim Layouten bitte an die Regeln halten. Nicht layoutete
          Beitr&auml;ge werden mittels der Dummydatei ohne weitere detaillierte
          Aufbereitung ver&ouml;ffentlicht. Dies kann leicht zu ungewollten Effekten
          f&uuml;hren.<BR> Es ist aber wirklich kein Weltuntergang wenn jemand einen
          Text einschickt der nicht layoutet ist!</LI>

          <LI>Mache dir immer eine Kopie von deinen Beitr&auml;gen, bevor du diese 
          abschickst. Internet und Post geben keine Garantie &uuml;ber Verluste.</LI>

          <LI>Im Beitrag eingebundene Bilder nur als JPG, PNG oder als GIF verwenden.
          Dabei ist aber auf eine vern&uuml;nftige Gr&ouml;&szlig;e und Farbzahl zu
          achten. 8-bit Bilder sehen meist genau so gut aus, wie 24-bit Bilder,
          ben&ouml;tigen aber viel weniger Speicherraum.</LI>

          <LI>Texte wie "(c) by" oder "layouted by" sind unn&ouml;tig. Das © steht
          eindeutig im Impressum. Es ist also nicht n&ouml;tig dies nochmals in den
          Artikeln zu wiederholen.</LI>

          <LI> Damit die Artikel einer Rubrik zugeordnet werden k&ouml;nnen, ist das
          entsprechende Merkmal dem Namen mit Unterstrich voranzustellen (dient nur der
          &Uuml;bersichtlichkeit, ist nicht zwingend vorgeschrieben). Zur Zeit
          gibt es folgende Rubriken:

           <CENTER>
             <TABLE border="0" summary="">
               <TR>
                 <TH align="left">Rubrik</TH>
                 <TH align="left">Dateiname</TH>
                 <TH width="30">|</TH>
                 <TH align="left">Rubrik</TH> 
                 <TH align="left">Dateiname</TH>
               </TR>

               <TR>
                 <TD colspan="5">
                   <HR size="1">
                 </TD>
               </TR>

               <TR>
                 <TD>Workshops</TD>           
                 <TD>wk_name.html</TD>      
                 <TD align="center">|</TD>    
                 <TD>Tools</TD>               
                 <TD>tl_name.html</TD>
               </TR>

               <TR>
                 <TD>Hardware</TD>            
                 <TD>hw_name.html</TD>      
                 <TD align="center">|</TD>    
                 <TD>Games</TD>               
                 <TD>gt_name.html</TD>
               </TR>

               <TR>
                 <TD>MultiMedia</TD>          
                 <TD>mm_name.html</TD>        
                 <TD align="center">|</TD>    
                 <TD>Diskussionen</TD>        
                 <TD>dk_name.html</TD>
               </TR>

               <TR>
                 <TD>Lesebriefe</TD>
                 <TD>lb_name.html</TD>  
                 <TD align="center">|</TD>
                 <TD>Small Talk</TD>       
                 <TD>st_name.html</TD>
               </TR>

               <TR>
                 <TD>Helpline</TD>
                 <TD>hl_name.html</TD>   
                 <TD align="center">|</TD>
                 <TD>Tipps &amp; Tricks</TD>
                 <TD>tt_name.html</TD>
               </TR>

               <TR>
                 <TD colspan="5">
                   <HR size="1">
                 </TD>
               </TR>
             </TABLE>
           </CENTER>
           <BR>
         </LI>

         <LI>Die Rubrik "NC-Talk" wurde wieder in Diskussionen umbenannt. Und aus
         der Rubrik CD habe ich Leserbriefe gemacht.</LI>
          </UL>
          <BR>
          <BR>
           

          <P>So ich hoffe ich konnte hier einigen bereitwilligen Schreiberlingen
          helfen. Wenn jemand noch Vorschl&auml;ge hat, was ich hier erkl&auml;ren
          sollte, dann nur her damit. Dieser Text wird in Zukunft immer erweitert und
          modifiziert. Also bitte immer mal schnell den Text lesen, bevor du einen
          neuen Artikel schreibst.</P> Danke !!!!!
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

