<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">

    <TITLE>Mail von Zaquarta</TITLE>
  </HEAD>

  <BODY background="wolf1.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Zaquarta's Mail</B></FONT></P>

          <P>Hallo Wolf!</P>

          <P>Erstmal meine Bewunderung f&uuml;r den mutigen Entschlu&szlig;, die
          NoCover weiterzuf&uuml;hren. Alle Achtung. Aber eines begreife ich nicht:
          Da motzt Cord Hagen &uuml;ber die rot-gr&uuml;ne Regierung und glaubt allen
          Ernstes, unter schwarz-gelb w&auml;re es besser gewesen. Na gut, Thema
          f&uuml;r sich. Aber als "Alternativen" stellst Du die Violetten und die PBC
          vor -beide nicht w&auml;hlbar, da gebe ich Dir recht. Wieso Du aber
          ausgerechnet diesen Parteien so viel Platz einr&auml;umst, ist mir ein
          R&auml;tsel. Es gibt in Deutschland auch durchaus vern&uuml;nftige kleine
          Parteien wie z.B. die &Ouml;DP (www.oedp.de) oder die LD
          (www.liberale-demokraten.de) - die mir allemal lieber sind als diese
          schwarzrotgr&uuml;ngelbe Einheitsunionspartei. Auch wenn Cord Hagen da ja
          viele Unterschiede auszumachen scheint, w&uuml;rde ich gerne mal wissen,
          wieso ich eine Partei w&auml;hlen sollte, die mir vor der Wahl nicht sagt,
          wof&uuml;r sie eigentlich steht, und positionslos waren ja nicht nur die
          Roten, sondern auch &Auml;h-Stoiber (&Auml;h, Irak, das m&uuml;ssen wir
          dann pr&uuml;fen, wenn es soweit ist) und Spa&szlig;welle Guido (18% - nur
          WOF&Uuml;R wollten sie die eigentlich haben ?).</P>

          <P>Und eine Partei, die so stolz ist auf ihr "C" im Namen... naja,
          Christliche Mitte, CPD, PBC... haben auch alle ein C drin, also vielen
          Dank, ich w&auml;hl was anderes!</P>

          <P>Viele Gr&uuml;&szlig;e<BR>
          Zaquarta</P>
          <HR>

          <P><B>Meine Antwort:</B><BR>
          Vielen Dank f&uuml;r die aufmunternden Worte zu Beginn. Zum zweiten Teil
          &uuml;ber das F&uuml;r und Wider der vergangenen Wahl habe ich einen
          treffenden Text auf einem Kalenderblatt gefunden:<BR>

          <I><B>Die Torheit der B&uuml;rger in Wahljahren wird nur noch
          &uuml;bertroffen von der Dreistigkeit jener, die gew&auml;hlt werden
          m&ouml;chten. [Raoul Loubet]</B></I></P>

          <P>Der Vorwurf der L&auml;nge &uuml;ber nichtw&auml;hlbare Parteien finde
          ich nicht ganz gerecht, denn je l&auml;nger man &uuml;ber einen
          Bl&ouml;dsinn liest, je tiefer bleibt er haften und man begreift, dass
          alles Bl&ouml;dsinn ist.<BR>  
          Wolf</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

