<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 4.01//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="AUTHOR" content="Thomas Nawroth">
    <META name="DESCRIPTION" content=
    "Ein Computer-Magazin von 1984">

    <TITLE>Happy Computer</TITLE>
  </HEAD>

  <BODY background="wolf1.gif">
    <TABLE border="0" width="100%" cellpadding="10" summary="">
      <TR>
        <TD>
          <BR>
           

          <CENTER>
            <IMG src="mm_hc03a.gif" alt="">
          </CENTER>

          <P>In dieser Reihe m&ouml;chte ich Euch in die Gute Alte
          Zeit entf&uuml;hren. Dem aktuellen Trend folgend, geht es
          auch hier zur&uuml;ck in die 80`er. Dies mit Hilfe eines
          Computer-Magazins, mit dem Titel "Happy Computer". Ich
          besitze die Oktober-Ausgabe aus dem Jahre 1984. Dieses
          Mal ein Bericht &uuml;ber das Adventure "Mask of the Sun
          f&uuml;r Atari, Commodore 64 und Apple-Computer. Er ist
          in der Gegenwartsform gehalten, da er meinerseits aus dem
          Heft abgeschrieben wurde. Der Autor ist am Schluss
          angef&uuml;hrt.</P>
          <HR>
          <BR>
           

          <P>Die Maske der Sonne besteht aus purem Gold und wartet
          irgendwo in Zentralamerika darauf, entdeckt zu werden.
          Alle sind hinter jenem geheimnisumwitterten Relikt her,
          doch Mac Steele mu&szlig; es finden: Denn nur die Maske
          der Sonne kann ihn von dem Fluch befreien, der sein Leben
          bedroht. Also macht er sich auf den Weg durch
          unerforschte Azteken-Ruinen, in denen es von Gefahren und
          R&auml;tseln nur so wimmelt.</P>

          <CENTER>
            <IMG src="mm_hc03b.gif" alt=""><BR>
             <IMG src="mm_hc03bb.gif" alt="">
          </CENTER>
          <BR>
           <BR>
           

          <P>Soweit die ausgesprochen stimmungsvolle Vorgeschichte
          zu "The Mask of the sun", einem weiteren Vertreter der
          grassierenden Adventure-Welle, der durch ausgefeilte
          Grafik, hohen Spielwitz und ungeheure Komplexit&auml;t
          besticht. Die getestete Atari-Version, von der auch die
          Bilder stammen, beansprucht gleich zwei doppelseitig
          bespielte Disketten! Es deutet also alles auf einen
          Leckerbissen f&uuml;r eingefleischte Adventure-Fans hin,
          die in diesem Programm so manche Nu&szlig; zu knacken
          haben.</P>

          <CENTER>
            <IMG src="mm_hc03g.gif" width="231" height="170"
            hspace="5" vspace="5" alt=""> <IMG src="mm_hc03f.gif"
            width="231" height="170" hspace="5" vspace="5" alt="">
          </CENTER>
          <BR>
           <BR>
           

          <P>Das Spiel beginnt an einem Flughafen im s&uuml;dlichen
          Mexico, wo Professor de Perez unserem Mac einen wichtigen
          Fund in die Hand dr&uuml;ckt: Eine Karte, die
          Aufschlu&szlig; &uuml;ber unerforschte Azteken-Pyramiden
          gibt. Und damit wir nicht unn&ouml;tig durch den
          Dschungel joggen m&uuml;ssen, erhalten wir noch einen
          Jeep samt Ausr&uuml;stung. Als Zugabe gesellt sich Raoul
          zu uns, der Assistent von Professor de Perez. Die Suche
          beginnt.</P>

          <CENTER>
            <IMG src="mm_hc03d.gif" width="231" height="170"
            hspace="5" vspace="5" alt=""> <IMG src="mm_hc03c.gif"
            width="231" height="170" hspace="5" vspace="5" alt="">
          </CENTER>
          <BR>
           <BR>
           

          <P>Grafisch z&auml;hlt "Mask of the sun" auf jeden Fall
          zur Elite der Abenteuer-Spiele. Die vielen Bilder
          verw&ouml;hnen das Auge des Zuschauers durch
          geschmackvolle Formen und Farben. Wenn der Jeep durch die
          Landschaft f&auml;hrt oder wenn durch finstere Katakomben
          gewandert wird, gibt es sogar zeichentrick-&auml;hnliche
          Animation zu bewundern. Das Programm bietet hier und da
          auch mal einen kleinen Ger&auml;uscheffekt, was bei
          Adventures aber nicht so wesentlich ist und unter
          schm&uuml;ckendes Beiwerk f&auml;llt.</P>

          <CENTER>
            <IMG src="mm_hc03e.gif" width="231" height="170"
            hspace="5" vspace="5" alt="">
          </CENTER>

          <P>"Mask of the sun" ist, wie gesagt komplex und nicht
          gerade einfach. Zum Gl&uuml;ck kann man auch ohne
          gro&szlig;es Adventure-Talent viel von der Gegend sehen.
          Dringt man aber erst einmal tiefer in die diversen
          Gem&auml;uer ein, wird`s schwierig bis frustig - man wird
          hart gefordert. Leider l&auml;&szlig;t sich nur ein
          Spielstand auf Diskette speichern, was
          unverst&auml;ndlich lange dauert. Hier darf also
          geg&auml;hnt werden. Die beiliegende Spielbeschreibung
          ist sehr gut, sie macht Anf&auml;ngern mit den
          Grundregeln eines Adventures vertraut und informiert
          &uuml;ber die wichtigsten Befehle. Ein vollst&auml;ndiges
          W&ouml;rterbuch ist nicht abgedruckt, was zur
          Schwierigkeit des Programms beitr&auml;gt.</P>

          <P>Gerade bei "Mask of the sun" empfiehlt es sich,
          &ouml;fters mal ein paar schriftliche Notizen zu machen.
          Vor allem die Pyramiden-Kammern sind weit verzweigt und
          man verl&auml;uft sich leicht in ihnen. Dieses Adventure
          zeichnet sich neben der sch&ouml;nen Grafik durch
          Atmosph&auml;re und hohe Spielmotivation aus. Wie bei
          allen englischen Adventure-Spielen sollte man ein
          W&ouml;rterbuch bereit halten. Das Spiel kostet um die
          129 Mark und bietet daf&uuml;r eine Menge Abwechslung.
          Ein sicherer Tip f&uuml;r Adventure-Fans und solche, die
          es werden wollen.</P>

          <P>(Heinrich Lenhardt)</P>
          <HR>

          <P>In der n&auml;chsten NoCover gibt es einen Bericht
          &uuml;ber den CPC 464 von Schneider.</P>

          <TABLE align="CENTER" border="3">
            <TR bgcolor="#ffffff">
              <TD><A href="mailto:">Thomas Nawroth</A></TD>
            </TR>
          </TABLE>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

