<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Markus Castro -->

    <TITLE>Messe zu Aachen</TITLE>
  </HEAD>

  <BODY background="wolf1.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <BR>
           

          <P>Mann ist das lange her, dass ich hier etwas
          geschrieben habe...damals dachte ich, an meinen
          monatlichen Artikeln w&uuml;rde sich nie was &auml;ndern,
          schlie&szlig;lich hab ich doch alle Zeit der Welt. Wie
          man sich t&auml;uschen kann...inzwischen ist es schon
          &uuml;ber ein Jahr her, oder sinds zwei? Egal, ich habs
          dem Wolf versprochen also lest ihr diesmal auch mal
          wieder einen Artikel von mir, und zwar &uuml;ber die</P>

          <H1 align="center">Amiga und Retro Con 2002</H1>

          <P>In diesem Jahr hatten wir Jens Sch&ouml;nfeldt von
          Individual Computers die Organisation der traditionellen
          Amiga Messe, auch wenn er sich nicht f&uuml;r den
          Traditionsstandort K&ouml;ln, sondern f&uuml;r seine
          Heimatstadt Aachen entschieden hat. Amiga Messe bleibt
          Amiga Messe, und besonders weil es jedes Jahr wieder die
          Letzte sein k&ouml;nnte, ist f&uuml;r mich die
          Anwesenheit eigentlich Pflicht.</P>

          <P>Von Wesselburen nach Aachen, dass sind etwa 600km
          Autofahrt. Da stellt sich nat&uuml;rlich die Frage, ob es
          sich dieser weite Weg gelohnt hat. Um mein Fazit
          vorwegzunehmen, ich bin der Meinung es hat sich gelohnt,
          auch wenn vieles besser h&auml;tte laufen k&ouml;nnen.
          Aber der Reihe nach.</P>

          <P>Losgefahren bin ich Freitag nacht um 4:30 Uhr,
          zusammen mit einem AmigaUser aus Husum, damit die
          Benzinkosten nicht ganz so reinhauen. Nachts
          Autobahnfahren ist zwar immer wieder angenehm (kaum
          Verkehr, man kommt wunderbar fl&uuml;ssig durch), aber
          nach knapp 5 Stunden war ich dann schon froh, endlich in
          H&uuml;rth angekommen zu sein. Da befindet sich zwar
          nicht die Messe, daf&uuml;r wohnt dort Fabian Kruse, den
          ich auch noch mitgenommen hab. Nachdem er uns noch auf
          eine Tasse Kaffee eingeladen hat, ging es dann weiter,
          das letzte St&uuml;ckchen Autobahn Richtung Aachen...und
          dann nochmal fast so lange Aachener Innenstadt, bis wir
          durch den dichten Verkehr endlich das Eurogress gefunden
          hatten.</P>

          <P>Endlich im Konferenzraum 1 angekommen wollte ich
          eigentlich gleich einen Pegasos ausprobieren, aber
          Pustekuchen: Durch eine Verkettung ungl&uuml;cklicher
          Umst&auml;nde war die Crew von Genesi den ganzen
          Vormittag damit besch&auml;ftigt die Rechner startklar zu
          machen, und bis etwa 12:30 glich der Genesi Stand einem
          heillosen Durcheinander. Aber auch wenn es auf vielen
          Fotos so aussieht, Genesi waren zum Gl&uuml;ck nicht die
          einzigen auf der Messe. Im Uhrzeigersinn waren folgende
          Firmen vertreten:</P>

          <UL>
            <LI>Indivual Computers<BR>
             Jens Sch&ouml;nfeld war nicht nur als Organisator der
            Messe anwesend, sondern bildete mit seinem Stand auch
            das "Retro" Element. Hier konnte man den Commodore One
            bestaunen, ein Mainboard dass altes
            (C64-Kompatibilit&auml;t) und neues (PCI-Slots,
            SD-RAM...) kombinierte und viele in Erinnerungen
            schwelgen lies.</LI>

            <LI>IO-Spirit<BR>
             Einen Stand weiter demonstrierte Felix Schwarz seine
            fx Produktpalette. Neben fxScan und VHI-Studio konnte
            man hier auch das nagelneue fxPaint 2.0 auf einem
            Amithlon und einem Pegasos begutachten. Der Amithlon
            Rechner lief leider wesentlich stabiler als der Pegasos
            unter MorphOS, aber an solchen Problemen arbeitet die
            Genesi Crew hoffentlich, sodass die Endkundenversoin
            davon bereinigt sein sollte. Hoffen darf man ja
            immerhin.</LI>

            <LI>Eternity<BR>
             Das Mega Multiplayer Spiel Tales of Tamar wurde hier
            ebenfalls auf engstem Raum gleich an zwei Rechnern von
            einer wandelnden Blechdose vorgef&uuml;hrt ;)<BR>
            <BR>
             Das Spiel l&auml;uft offenbar ohne Probleme auf
            Amithlon, aber auch der Amiga 4000 direkt daneben hatte
            keinen Grund, sich zu beschweren. Tales of Tamar war
            eine der Lichtblicke dieses Amiga-Jahres, und so
            tummelten sich hier auch teilweise 10 oder mehr Leute
            auf 2 Quadratmetern um Infos oder Blicke aufs Spiel zu
            ergattern. Zusammen mit dem tapferen Ritter (im Raum
            war es teilweise unertr&auml;glich stickig, in seiner
            R&uuml;stung muss LordFox schon im eigenen Saft
            gebraten worden sein...) hatten sich auch noch Thomas
            und Steffen Schulze mit ihrem A4000 in die Box
            gequetscht um ihr endlich fertig gewordenes Spiel
            Crossfire 2 vorzuf&uuml;hren.<BR>
            <BR>
             Das Spiel l&auml;uft zwar komplett in Lowres ab
            (Grafikkarten werden nat&uuml;rlich unterst&uuml;tzt),
            aber dennoch kitzelte es noch das letzte aus ihrem
            Amiga raus. So ein Grafikfeuerwerk hat man bei einem 2D
            Spiel selten gesehen. Selbst mit einer PPC Karte reicht
            die Leistung laut Auskunft der Programmierer nicht aus,
            um die Aufl&ouml;sung h&ouml;herzuschrauben, da die KI
            und die Effektroutinen so aufwendig sind. Daf&uuml;r
            k&ouml;nnen PPC Besitzer das Spiel in 16bit
            genie&szlig;en. Als dritte im Bunde hatten sich noch
            Psyria und Oehmmes mit einem A1200T in diese Box
            gequetscht um Digibooster vorzuf&uuml;hren. Noch
            ein-zwei Rechner mehr und wir h&auml;tten hier das
            Entstehen einer wundersch&ouml;nen Singularit&auml;t
            bewundern k&ouml;nnen...Platz zum Atmen blieb
            jedenfalls kaum noch ;-)<BR>
            <BR>
             Daf&uuml;r konnte man Psyria live bei der Arbeit
            bewundern, und wer bisher noch MP3s Modulen vorgezogen
            hat, dem wurde hier gezeigt, was ein Trackerformat noch
            alles zu bieten hat.</LI>

            <LI>Direkt angegliedert war die andere H&auml;lfte vom
            Stand vom APC&amp;TCP und der AmigaFuture, vertreten
            durch Andreas Magerl und Georg B. vertreten. Hier
            konnte man sich gleich die aktuelle Amiga Future
            mitnehmen, die es trotz diverser Schwierigkeiten doch
            noch geschafft hat, zu erscheinen. Au&szlig;erdem
            konnte man hier Abos abschlie&szlig;en, seine Sammlung
            an Future Heften oder Fanartikeln komplettieren, sowie
            die Palette an APC&amp;TCP Produkten kaufen, allen
            voran nat&uuml;rlich Crossfire 2 und Digibooster
            Pro.</LI>

            <LI>Der n&auml;chste Stand war der von Vesalia, und
            nat&uuml;rlich hatten sie auch sie noch ein paar
            G&auml;ste am Stand. Steffen H&auml;user und Timothy de
            Groothe zeigten hier einen AmigaOne auf dem Linux lief,
            und so zumindest schonmal die Existenz funktionierender
            Hardware bewies. Ausk&uuml;nfte zu OS4.0 konnte Steffen
            H&auml;user leider keine geben, da er als Privatperson
            auf die Messe gekommen war. Sehr schade, dass Hyperion
            hier nicht ein bisschen mehr bieten konnte.
            Au&szlig;erdem hatten sich Elbox am Stand von Vesalia
            einquartiert und zeigten hier ihre Produktreihe von PCI
            Erweiterungen. Richtig interessant w&auml;ren diese
            Bussysteme meiner Meinung nur, wenn sie
            tats&auml;chlich die lange versprochene Shark PPC G3
            Karte f&uuml;r Classic Systeme liefern w&uuml;rden.
            Aber die Hoffnung hierauf habe ich schon lange
            aufgegeben, besonders weil sie nur etwas bringen
            w&uuml;rde, wenn sie von MorphOS und/oder OS4.0
            unterst&uuml;tzt werden w&uuml;rde. Zumindest die
            MorphOS Unterst&uuml;tzung wurde schon vor Jahren bei
            der Ank&uuml;ndigung dieser Karte verneint, da es sich
            nicht lohnen w&uuml;rde. Insgesamt sehe ich
            hierf&uuml;r also keine gro&szlig;e Hoffnung.</LI>

            <LI>Direkt daneben hatte sich Epic einen Stand
            gemietet, an dem man das neue Strategie Spiel
            Knights&amp;Merchants betrachten durfte. F&uuml;r
            diesen Stand habe ich mich kaum interessiert, deswegen
            kann ich hierzu auch nichts weiter schreiben. Einen
            Meter weiter hatte die AmigaPlus einen (im Vergleich
            zur AmigaFuture erb&auml;rmlich kleinen...) Messestand
            aufgebaut, wo man s&auml;mtliche AmigaPlus Ausgaben
            kaufen konnte, nat&uuml;rlich auch die neueste.
            Au&szlig;erdem wurde ein neues Magazin f&uuml;r
            Digitalkameras vorgestellt, das f&uuml;r mich
            allerdings in etwa genauso interessant war wie der eBay
            Stand eine Ecke weiter...</LI>

            <LI>Dazwischen gab es allerdings noch Funtime World, um
            genau so ein Sebastian Brylka, der FroggerNG
            vorf&uuml;hrte und verkaufte. Dieses Programm hat sich
            wirklich gemausert, war es in der alten Version IMHO
            noch ziemlich unbenutzbar und langsam, so ist es nun in
            der NG Version in der Lage so ziemlich alles
            abzuspielen was Ton und Bilder hat. Was die
            Geschwindigkeit angeht kann ich leider f&uuml;r Classic
            Rechner keine Aussagen machen, allerdings d&uuml;rfte
            hier AMP2 noch immer die Nase vorn haben wenn es um
            MPGs geht, Moovid bei AVI und Quicktime Formaten. Beide
            versagen allerdings wegen dem einen oder anderen Detail
            auf dem Pegasos ihren Dienst (AMP2 kommt mit den neuen
            Screenmodes nicht zurecht, Moovid unterst&uuml;zt noch
            kein AHI), sodass hier FroggerNG die allererste Wahl
            ist. Das haben &uuml;brigens auch Genesi erkannt, und
            FroggerNG kurzerhand f&uuml;r das System lizenziert, so
            dass jeder K&auml;ufer in den Genuss eines Multimedia
            Players kommt. Schade nur, dass FroggerNG noch keine
            verschl&uuml;sselten DVDs abspielen kann, und dies nach
            Auskunft des Autors wohl auch niemals k&ouml;nnen wird.
            Aber man soll ja die Hoffnung nicht aufgeben, auf einen
            Divx Player konnte man vor nicht allzu langer Zeit ja
            auch noch nicht hoffen.</LI>

            <LI>Airbrush Tingler und AmigaNews.de hatten den
            n&auml;chsten Stand in Beschlag genommen. Hier konnte
            man den Designkiller schlechthin bewundern, den Walker.
            &Uuml;berraschend war, dass der Prototyp sogar
            lauff&auml;hig war. Ebenso lauff&auml;hig stand auch
            hier ein AmigaOne, wiederum mit Linux. Lauff&auml;hig,
            aber IMHO nicht sehr interessant. Die M&ouml;glichkeit,
            sich Handys, M&auml;use und alles andere airbrushen zu
            lassen (ein paar Freaks lie&szlig;en sich sogar
            Boingb&auml;lle auf die Hansapilsdosen brushen) war
            hier schon sehr viel interessanter. Auch der Preis
            konnte sich sehen lassen, f&uuml;r schlappe 10 Euro hab
            ich mir ein schmuckes Boingball und MorphOS Logo auf
            meine Towerfront brushen lassen. Beim n&auml;chsten Mal
            werd ich noch ein bisschen mehr mitschleppen, es sieht
            wirklich einfach nur geil aus!</LI>

            <LI>Ultron waren direkt nebenan und boten hier
            Lautsprecher, Towergeh&auml;use und TFT-Bildschirme an.
            Die Preise waren zwar recht ok, aber insgesamt schienen
            die Besucher hier nichts kaufen zu wollen...sei`s drum,
            Rezesion trifft jeden.</LI>

            <LI>Den einzigen Shareware Stand hatte Guido Meersman
            gemietet, der hier Amithlon TV und seinen Tastatur
            Adapter vorstellte. Beides sehr beeindruckend, leider
            konnte man den Adapter hier nicht kaufen. An dieser
            Stelle aber ein Riesen Dankesch&ouml;n an Guido, er war
            so freundlich mir meinen Tastatur Adapter zu tauschen,
            da er bei mir nach einem Reset immer hing. Das nenne
            ich wirklich zuvorkommenden Service, und das obwohl er
            an diesen Teilen eigentlich &uuml;berhaupt nichts
            verdient. Daran k&ouml;nnten sich andere Hersteller
            eine Scheibe abschneiden.</LI>

            <LI>Der Letzte gr&ouml;&szlig;ere Stand geh&ouml;rt
            KDH-Datentechnik. Auch hier konnte man einen AmigaOne
            mit Linux bestaunen, der von Computer City
            vorgef&uuml;hrt wurde. Das Pegasos Board gef&auml;llt
            mir rein subjektiv allerdings sehr viel besser, es ist
            kleiner, wirkt sauberer und aufger&auml;umter. Die
            beste L&ouml;sung w&auml;hre meiner Meinung nach das
            OS4.0 auch auf Pegasos Rechner lauff&auml;hig zu
            machen, da diese nicht nur mehr bieten als der AmigaOne
            (Firewire, Sound, Gameport), sondern auch billiger sind
            und wenigstens von einer Firma hergestellt werden, die
            ihre Wurzeln im Amiga Markt hat. Aber ob es jemals
            soweit kommen wird, steht leider in den Sternen, da
            sich erstmal eine Firma bzw. ein Distributor finden
            m&uuml;sste, der das OS4.0 lizenziert, und die
            Bedingungen von AmigaInc. sollen nicht grade die
            freundlichsten sein...<BR>
            <BR>
             Michael B&ouml;hmer von E3B f&uuml;hrte am KDH Stand
            au&szlig;erdem noch seine Reihe von USB Karten f&uuml;r
            Classic Amigas vor. Mit der Highway und der Subway kann
            man endlich auch USB Kameras, M&auml;use und Tastaturen
            am Amiga anschlie&szlig;en. Als USB Stack dient dabei
            Poseidon, der auch beim Pegasos zum Einsatz kommt,
            allerdings nicht unter OS4.0 wenn ich recht informiert
            bin. Das ist leider sehr schade, da dadurch wiedermal
            der Ansatz zu einem genialen Standart zunichte gemacht
            wird, von denen, die eigentlich besonders diesen
            Standart f&ouml;rdern sollten.</LI>
          </UL>

          <P>Das war ein kurzer Rundgang &uuml;ber die leider von
          Jahr zu Jahr schrumpfende Messe. Den gr&ouml;&szlig;ten
          Stand hab ich bisher allerdings kaum erw&auml;hnt,
          n&auml;mlich den von Genesi. Nachdem die Probleme
          einigerma&szlig;en beseitigt wurden, standen den
          Messebesuchern sage und schreibe 30 Pegasos Rechner zum
          Ausprobieren und Spielen zur Verf&uuml;gung. Gespielt
          werden konnte an allen Rechnern u.A. Quake2, das zwar im
          Software Renderer lief, aber dennoch verdammt schnell
          war, au&szlig;erdem Software Tycoon, bei dem die kleinen
          Figuren trotz G3 noch einzuschlafen drohen, und der
          nagelneue Moorhuhn clone Birdie Shot von Epic. Die Spiele
          liefen zwar allesamt wunderbar, aber leider gab es sonst
          nicht besonders viel, was man h&auml;tte ausprobieren
          k&ouml;nnen. Die Internet Verbindung kam leider nicht
          zustande, da irgendwer den Router gekillt hatte, daher
          konnte man auch mit Voyager nicht viel anfangen. Videos
          waren leider auch keine vorhanden, die man mit FroggerNG
          h&auml;tte testen k&ouml;nnen. Zum Gl&uuml;ck hatte ich
          eine CD mit ein paar MPGs dabei, die mit FroggerNG
          wirklich wunderbar liefen. Nach dem 5. offenen Fenster
          waren dann allerdings doch Verz&ouml;gerungen zu
          erkennen. Divx schafft Frogger auf dem Pegasos
          &uuml;brigens in 640x480 mit etwa 38fps, man wird also
          schwer ein Video finden, das noch ruckelt.</P>

          <P>Nichtsdestotrotz h&auml;tte hier einiges besser
          organisiert werden k&ouml;nnen, zum Beispiel indem ein
          paar der Mannen zum Demonstrieren des Systems abgestellt
          worden w&auml;ren. Leider fielen aufgrund des allgemeinen
          Chaos auch die von Genesi geplanten Demonstrationen am
          Nachmittag aus, erst um 17:00 Uhr haben sie eine
          Vorstellung des Boards und der Zukunftspl&auml;ne
          &uuml;ber den Beamer gegeben.</P>

          <P>Was gibts sonst zu sagen? Sehr entt&auml;uschend war
          leider, dass sich die Ank&uuml;ndigung von Genesi, den
          Pegasos auf der Messe zu verkaufen, nicht best&auml;tigt
          hat. Aufgrund von Lieferengp&auml;ssen bei April Chip
          Bauteilen konnten sie lediglich 50 Boards herstellen, die
          nicht in den Verkauf gingen, sondern zum Austausch von
          Betatester Boards dienten. Deswegen, und wegen der
          mangelnden Organisation waren viele Leute
          entt&auml;uscht. Au&szlig;erdem wurde bem&auml;ngelt,
          dass MorphOS noch sehr unfertig wirkt. Was mich viel eher
          st&ouml;rte, war, dass ich viele Leute einfach nicht
          gefunden habe, mit denen ich mich gerne unterhalten
          h&auml;tte. F&uuml;rs n&auml;chste Jahr werde ich mir auf
          jeden Fall ein Namensschild basteln, denn viele Leute aus
          dem Chat waren zwar da wie ich sp&auml;ter erfuhr, doch
          liefen wir wahrscheinlich aneinander vorbei, weil wir
          nicht wussten, wie wir aussehen....&auml;rgerlich. Aber
          im Endeffekt hat die Messe eigentlich Spa&szlig; gemacht,
          im Anschluss haben sich wieder Gr&uuml;ppchen gebildet
          die durch Aachen gezogen sind, und zusammen mit Fabian,
          Georg und den Crossfire Programmierern Thomas und Steffen
          wurde es noch ein sehr lustiger Abend. Es g&auml;be
          bestimmt noch viel zu schreiben, aber inzwischen haben
          wir den 29.12. und das meiste f&auml;llt mir schon nicht
          mehr ein...</P>

          <P>Bleibt eigentlich nur zu hoffen, dass dieses Jahr
          wieder eine Messe stattfindet. Auch wenn es traurig ist,
          mit anzusehen, wie der Amiga Markt immer kleiner wird, so
          gibt es doch immerhin einige Dinge, an denen man
          festhalten kann. Dazu geh&ouml;ren das Aminet, die
          j&auml;hrliche Messe aber auch Printmagazine. Diese Dinge
          sind IMHO einfach wichtig, wenn man sich einreden will,
          doch nicht der einzige Amiga User im Universum zu
          sein...</P>

          <P>In diesem Sinne, kauft die AmigaFuture #40 mit dem
          ersten Bericht &uuml;ber den Pegasos und haltet dem Amiga
          weiterhin die Treue - in welcher Form auch immer!</P>

          <P>Markus Castro - Saint</P>
          <HR>
          <P>Nun noch 5 Schnappsch&uuml;sse:</P>
          <CENTER>
          <img src="mm_messe1.jpg" width="384" height="256" alt=""><BR>
          <img src="mm_messe2.jpg" width="384" height="256" alt=""><BR>
          <img src="mm_messe3.jpg" width="384" height="256" alt=""><BR>
          <img src="mm_messe4.jpg" width="384" height="256" alt=""><BR>
          <img src="mm_messe5.jpg" width="384" height="256" alt=""><BR>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

