<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Luther Teil 1</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>95 Thesen des
          Theologen Dr. Martin Luther</B></FONT></H1>

          <P>Aus Liebe und rechtem Flei&szlig;, die Wahrheit an den
          Tag zu bringen, wird unter dem Vorsitz des
          Ehrw&uuml;rdigen Vaters Martin Luther, der freien
          K&uuml;nste und heiligen Theologie Magister und
          derselbigen ordentlichen Lehrers, zu Wittenberg &uuml;ber
          folgende S&auml;tze disputiert werden. Darum bittet er,
          da&szlig; diejenigen, so gegenw&auml;rtig sich mit uns
          davon nicht unterreden k&ouml;nnen, solches abwesend
          durch Schrift tun m&ouml;gen. Im Namen unseres Herrn Jesu
          Christi. Amen.</P>

          <P>1.<BR>
          Da unser Herr und Meister Jesus Christus spricht: Tut
          Bu&szlig;e etc., will er, da&szlig; das ganze Leben
          seiner Gl&auml;ubigen auf Erden eine (stete) Bu&szlig;e
          sei.</P>

          <P>2.<BR>
          Und kann noch mag das Wort Bu&szlig;e nicht vom Sakrament
          der Bu&szlig;e, das ist, von der Beichte und Genugtuung,
          so durch der Priester Amt ge&uuml;bet wird, verstanden
          werden.</P>

          <P>3.<BR>
          Jedoch will er nicht allein verstanden haben die
          innerliche Bu&szlig;e; ja die innerliche Bu&szlig;e ist
          nichtig und keine Bu&szlig;e, wo sie nicht
          &auml;u&szlig;erlich allerlei T&ouml;tung des Fleisches
          wirket.</P>

          <P>4.<BR>
          W&auml;hret derhalben Reue und Leid, das ist wahre
          Bu&szlig;e, so lange einer Mi&szlig;fallen an sich selber
          hat, n&auml;mlich bis zum Eintritt aus diesem in das
          ewige Leben.</P>

          <P>5.<BR>
          Der Papst will noch kann nicht irgend andere Strafe
          erlassen au&szlig;er der, welche er nach seinem Gefallen
          oder laut der Canones, das ist der p&auml;pstlichen
          Satzungen, auferlegt hat.</P>

          <P>6.<BR>
          Der Papst kann keine Schuld vergeben als allein sofern,
          da&szlig; er erkl&auml;re und best&auml;tige, was von
          Gott vergeben sei, oder aber, da&szlig; er es tue in den
          F&auml;llen, die er sich vorbehalten hat, und wenn dies
          verachtet w&uuml;rde, so bliebe die Schuld ganz und gar
          unaufgehoben.</P>

          <P>7.<BR>
          Gott vergibt keinem die Schuld, den er nicht zugleich
          durchaus wohl gedem&uuml;tigt dem Priester, seinem
          Statthalter, unterwerfe.</P>

          <P>8.<BR>
          Canones poenitentiales, das ist, die Satzungen, wie man
          beichten und b&uuml;&szlig;en soll, sind allein den
          Lebendigen aufgelegt und sollen laut derselben Satzungen
          den jetzt Sterbenden nicht aufgelegt werden.</P>

          <P>9.<BR>
          Daher tut uns der heilige Geist wohl am Papst, da&szlig;
          der Papst allewege in seinen Dekreten ausnimmt den
          Artikel des Todes und die &auml;u&szlig;erste Not.</P>

          <P>10.<BR>
          Die Priester handeln unverst&auml;ndig und &uuml;bel, die
          den sterbenden Menschen Poenitentias canonica, das ist
          auferlegte Bu&szlig;e ins Fegefeuer, daselbst denselben
          genug zu tun, sparen und behalten.</P>

          <P>11.<BR>
          Dieses Unkraut, da&szlig; man die Bu&szlig;e oder
          Genugtuung, so durch die Canones oder Satzungen auferlegt
          ist, in des Fegefeuers Bu&szlig;e oder Pein sollte
          verwandeln, ist ges&auml;et worden, da die Bisch&ouml;fe
          geschlafen haben.</P>

          <P>12.<BR>
          Vor Zeiten wurden Canonicae poenae, das ist auferlegte
          Bu&szlig;e oder Genugtuung f&uuml;r begangene S&uuml;nden
          nicht nach, sondern vor der Absolution auferlegt, dabei
          zu pr&uuml;fen, ob Reue und Leid rechtschaffen
          w&auml;re.</P>

          <P>13.<BR>
          Die Sterbenden tun durch ihren Tod oder Absterben
          f&uuml;r alles genug und sind dem Rechte der Canones oder
          Satzungen abgestorben und also billig von Auflegung
          derselben entbunden.</P>

          <P>14.<BR>
          Unvollkommene Fr&ouml;mmigkeit oder Liebe des Sterbenden
          bringt notwendig gro&szlig;e Furcht mit sich; ja diese
          ist um so gr&ouml;&szlig;er, je geringer jene ist.</P>

          <P>15.<BR>
          Diese Furcht und Schrecken, da&szlig; ich anderer Dinge
          schweige, gen&uuml;gt an sich selber, da&szlig; sie des
          Fegefeuers Pein anrichte, dieweil sie der Angst der
          Verzweiflung ganz nahe ist.</P>

          <P>16.<BR>
          H&ouml;lle, Fegefeuer und Himmel scheinen also von
          einander verschieden zu sein wie die rechte Verzweiflung,
          unvollkommene Verzweiflung und Sicherheit.</P>

          <P>17.<BR>
          Es scheint, als m&uuml;sse im Fegefeuer, gleichwie die
          Angst an den Seelen abnimmt, also auch die Liebe an ihnen
          zunehmen.</P>

          <P>18.<BR>
          Es scheint unerwiesen zu sein, weder durch Gr&uuml;nde
          noch durch die Schrift, da&szlig; sie au&szlig;er dem
          Stande des Verdienstes oder des Zunehmens an der Liebe
          seien.</P>

          <P>19.<BR>
          Es scheint auch dies unerwiesen zu sein, da&szlig; sie
          ihrer Seligkeit gewi&szlig; und unbek&uuml;mmert seien,
          ob wir schon des ganz gewi&szlig; sind.</P>

          <P>20.<BR>
          Derhalben versteht der Papst unter der vollkommenen
          Vergebung aller Strafen nicht, da&szlig; insgeheim alle
          Strafe vergeben werden, sondern nur die, so er selbst
          aufgelegt hat.</P>

          <P>21.<BR>
          Daher irren die Abla&szlig;prediger, die da sagen,
          da&szlig; durch des Papstes Abla&szlig; der Mensch von
          aller Strafe los und selig werde.</P>

          <P>22.<BR>
          Ja, der Papst erl&auml;&szlig;t den Seelen im Fegefeuer
          keine Strafe, die sie h&auml;tten in diesem Leben laut
          der Canones b&uuml;&szlig;en und bezahlen
          m&uuml;ssen.</P>

          <P>23.<BR>
          Wenn einem irgend eine Vergebung aller Strafe gegeben
          werden kann, so ist's gewi&szlig;, da&szlig; sie allein
          den Vollkommensten, das ist gar wenigen, gegeben
          werde.</P>

          <P>24.<BR>
          Darum mu&szlig; der gr&ouml;&szlig;te Teil unter den
          Leuten betrogen werden durch die pr&auml;chtige
          Verhei&szlig;ung von der bezahlten Strafe, wobei gar kein
          Unterschied gemacht wird.</P>

          <P>25.<BR>
          Gleiche Gewalt, wie der Papst hat &uuml;ber das Fegefeuer
          insgemein, haben auch ein jeder Bischof und Seelsorger in
          seinem Bistum und seiner Pfarrei insbesondere.</P>

          <P>26.<BR>
          Der Papst tut sehr wohl daran, da&szlig; er nicht aus
          Gewalt des Schl&uuml;ssels (den er nicht hat), sondern
          durch Hilfe und f&uuml;rbittweise den Seelen Vergebung
          schenkt.</P>

          <P>27.<BR>
          Die predigen Menschentand, die da vorgeben, sobald der
          Groschen im Kasten klinge, f&uuml;hre die Seele von Stund
          an aus dem Fegefeuer.</P>

          <P>28.<BR>
          Das ist gewi&szlig;, sobald der Groschen im Kasten
          klingt, da&szlig; Gewinn und Geiz kommen, zunehmen und
          gr&ouml;&szlig;er werden; die Hilfe aber und
          F&uuml;rbitte der Kirche steht allein in Gottes Willen
          und Wohlgefallen.</P>

          <P>29.<BR>
          Wer wei&szlig; auch, ob alle Seelen im Fegefeuer also
          wollen erl&ouml;st sein, wie es mit St. Severin und
          Paschalis soll zugegangen sein.</P>

          <P>30.<BR>
          Niemand ist des gewi&szlig;, da&szlig; er wahre Reue
          genug habe; viel weniger kann er gewi&szlig; sein, ob er
          vollkommene Vergebung der S&uuml;nden bekommen habe.</P>

          <P>31.<BR>
          Wie selten einer ist, der wahrhaftige Reue und Leid habe,
          so selten ist auch der, der wahrhaftig Abla&szlig;
          l&ouml;st, das ist, es ist gar selten einer zu
          finden.</P>

          <P>32.<BR>
          Die werden samt ihren Meistern in die ewige Verdammnis
          fahren, die da vermeinen, durch Abla&szlig;briefe ihrer
          Seligkeit gewi&szlig; zu sein.</P>

          <P>33.<BR>
          Vor denen soll man sich sehr wohl h&uuml;ten und
          vorsehen, die da sagen, des Papstes Abla&szlig; sei die
          h&ouml;chste und werteste Gottesgnade und Geschenk,
          dadurch der Mensch mit Gott vers&ouml;hnt wird.</P>

          <P>34.<BR>
          Denn die Abla&szlig;gnade bezieht sich allein auf die
          Strafe der Genugtuung, welche von Menschen geordnet
          worden ist.</P>

          <P>35.<BR>
          Die lehren unchristlich, welche vorgeben, da&szlig; die,
          so da Seelen aus dem Fegefeuer oder Beichtbriefe
          l&ouml;sen wollen, keiner Reue noch Leides
          bed&uuml;rfen.</P>

          <P>36.<BR>
          Ein jeder Christ, der wahre Reue und Leid hat &uuml;ber
          seine S&uuml;nden, der hat v&ouml;llige Vergebung von
          Strafe und Schuld, die ihm auch ohne Abla&szlig;brief
          geh&ouml;rt.</P>

          <P>37.<BR>
          Ein jeder wahrhaftige Christ, er sei lebendig oder schon
          gestorben, ist teilhaftig aller G&uuml;ter Christi und
          der Kirche, aus Gottes Geschenk, auch ohne
          Abla&szlig;briefe.</P>

          <P>38.<BR>
          Doch ist des Papstes Vergebung und Austeilung mit nichten
          zu verachten; denn wie ich gesagt habe, ist seine
          Erkl&auml;rung eine Erkl&auml;rung g&ouml;ttlicher
          Vergebung.</P>

          <P>39.<BR>
          Es ist &uuml;ber die Ma&szlig;en schwer, auch f&uuml;r
          die allgelehrtesten Theologen, zugleich den gro&szlig;en
          Reichtum des Ablasses und dagegen die wahre Reue und Leid
          vor dem Volke zu r&uuml;hmen.</P>

          <P>40.<BR>
          Wahre Reue und Zerknirschung sucht und liebt die Strafe,
          aber die Mildigkeit des Ablasses entbindet der Strafe und
          macht, da&szlig; man sie ha&szlig;t, wenigstens bei
          Gelegenheit.</P>

          <P>41.<BR>
          Vorsichtiglich soll man von dem p&auml;pstlichen
          Abla&szlig; predigen, damit der gemeine Mann nicht
          f&auml;lschlich daf&uuml;r halte, da&szlig; er den
          anderen Werken der Liebe vorgezogen oder besser geachtet
          werde.</P>

          <P>42.<BR>
          Man soll die Christen lehren, es sei mit nichten des
          Papstes Meinung, da&szlig; Abla&szlig;l&ouml;sen einem
          Werke der Barmherzigkeit irgendwie zu vergleichen
          sei.</P>

          <P>43.<BR>
          Man soll die Christen lehren, da&szlig;, wer den Armen
          gibt oder leiht dem D&uuml;rftigen, besser tue, als wenn
          er Abla&szlig; l&ouml;st.</P>

          <P>44.<BR>
          Denn durch das Werk der Liebe w&auml;chst die Liebe und
          der Mensch wird besser; durch den Abla&szlig; aber wird
          er nicht besser, sondern nur sicherer und freier von
          Strafe.</P>

          <P>45.<BR>
          Man soll die Christen lehren, da&szlig; der, so seinen
          N&auml;chsten darben sieht und dessen ungeachtet
          Abla&szlig; l&ouml;st, der l&ouml;st nicht des Papstes
          Abla&szlig;, sondern ladet auf sich Gottes Ungnade.</P>

          <P>46.<BR>
          Man soll die Christen lehren, da&szlig; sie, wo sie nicht
          &uuml;brig reich sind, schuldig sind, was zur Notdurft
          geh&ouml;rt, f&uuml;r ihr Haus zu behalten und mit
          nichten f&uuml;r Abla&szlig; zu verschwenden.</P>

          <P>47.<BR>
          Man soll die Christen lehren, da&szlig; das
          Abla&szlig;l&ouml;sen ein frei Ding sei und nicht
          geboten.</P>

          <P>48.<BR>
          Man soll die Christen lehren, da&szlig; der Papst, wie er
          eines and&auml;chtigen Gebetes f&uuml;r sich mehr bedarf,
          also desselben mehr begehre denn des Geldes, wenn er
          Abla&szlig; austeilt.</P>

          <P>49.<BR>
          Man soll die Christen lehren, da&szlig; des Papstes
          Abla&szlig; gut sei, sofern man sein Vertrauen nicht
          darauf setzt, dagegen aber nicht Sch&auml;dlicheres, als
          wenn man dadurch Gottesfurcht verliert.</P>

          <P>50.<BR>
          Man soll die Christen lehren, da&szlig; der Papst, wenn
          er w&uuml;&szlig;te der Abla&szlig;prediger Schinderei,
          wollte er lieber, da&szlig; St. Peters M&uuml;nster zu
          Pulver verbrannt w&uuml;rde, denn da&szlig; es mit Haut,
          Fleisch und Bein seiner Schafe erbaut werde.</P>

          <P>51.<BR>
          Man soll die Christen lehren, da&szlig; der Papst, wie er
          schuld ist, also auch willig w&auml;re, von seinem
          eigenen Gold - und sollte gleich St. Peters M&uuml;nster
          dazu verkauft werden - den Leuten auszuteilen, denen
          zumeist etliche Abla&szlig;prediger das Geld
          abdringen.</P>

          <P>52.<BR>
          Durch Abla&szlig;briefe vertrauen selig zu werden ist ein
          nichtig und erlogen Ding, wenn gleich der Commissarius
          oder der Abla&szlig;vogt, ja der Papst selbst seine Seele
          wollte zu Pfande setzen.</P>

          <P>53.<BR>
          Das sind Feinde Christi und des Papstes, die von wegen
          der Abla&szlig;predigt das Wort Gottes in andern Kirchen
          zu predigen ganz und gar Schweigen verbieten.</P>

          <P>54.<BR>
          Es geschieht dem Worte Gottes unrecht, wenn man in
          Predigt eben so viel oder mehr Zeit aufwendet, den
          Abla&szlig; zu verk&uuml;ndigen, als auf das Wort des
          Evangeliums.</P>

          <P>55.<BR>
          Des Papstes Meinung kann nicht anders sein, als, wenn man
          den Abla&szlig; (was das Geringste ist) mit Einer Glocke,
          Einer Prozession und Ceremonien begeht so m&uuml;sse man
          dagegen das Evangelium (was das H&ouml;chste ist) mit
          hundert Glocken, hundert Prozessionen und hundert
          Ceremonien feiern.</P>

          <P>56.<BR>
          Die Sch&auml;tze der Kirche, davon der Papst den
          Abla&szlig; austeilt, sind weder genugsam genannt noch
          bekannt bei der Gemeinde Christi.</P>

          <P>57.<BR>
          Denn da&szlig; es nicht leibliche, zeitliche G&uuml;ter
          sind, ist daher offenbar, weil viele Prediger diese nicht
          so leichtlich hingeben, sondern vielmehr aufsammeln.</P>

          <P>58.<BR>
          Es sind auch nicht die Verdienste Christi und der
          Heiligen; denn diese wirken allezeit, ohne des Papstes
          Zutun, Gnade des innerlichen Menschen und Kreuz, Tod und
          H&ouml;lle des &auml;u&szlig;erlichen Menschen.</P>

          <P>59.<BR>
          St. Laurenzius hat die Armen der Gemeinde genannt die
          Sch&auml;tze der Gemeinde oder Kirche, aber er hat das
          W&ouml;rtlein genommen, wie es zu seiner Zeit
          gebr&auml;uchlich war.</P>

          <P>60.<BR>
          Wir sagen aus gutem Grunde, ohne Vorwitz, da&szlig;
          dieser Schatz seien die Schl&uuml;ssel der Kirche, durch
          das Verdienst Christi der Kirche geschenkt.</P>

          <P>61.<BR>
          Denn es ist klar, da&szlig; zur Vergebung der Strafe und
          vorbehaltener F&auml;lle allein des Papstes Gewalt genug
          sei.</P>

          <P>62.<BR>
          Der rechte wahre Schatz der Kirche ist das allerheiligste
          Evangelium der Herrlichkeit und Gnade Gottes.</P>

          <P>63.<BR>
          Dieser Schatz ist aber billig der allerverha&szlig;teste;
          denn er macht, da&szlig; die Ersten die Letzten
          werden.</P>

          <P>64.<BR>
          Aber der Abla&szlig;schatz ist billig der
          allerangenehmste, denn er macht aus den Letzten die
          Ersten.</P>

          <P>65.<BR>
          Derhalben sind die Sch&auml;tze des Evangelii Netze, mit
          denen man vor Zeiten die Leute des Mammons fischte.</P>

          <P>66.<BR>
          Die Sch&auml;tze des Ablasses aber sind Netze, womit man
          in jetziger Zeit den Mammon der Leute fischet.</P>

          <P>67.<BR>
          Der Abla&szlig;, den die Prediger f&uuml;r die
          gr&ouml;&szlig;te Gnade ausrufen, ist freilich f&uuml;r
          gro&szlig;e Gnade zu halten, insofern er gro&szlig;en
          Gewinn tr&auml;gt.</P>

          <P>68.<BR>
          Und doch ist solcher Abla&szlig; wahrhaftig die
          allergeringste Gnade, wenn man ihn mit der Gnade Gottes
          und des Kreuzes Gottseligkeit vergleicht.</P>

          <P>69.<BR>
          Es sind die Bisch&ouml;fe und Seelsorger schuldig, die
          Commissarien des apostolischen Ablasses mit aller
          Ehrerbietung zuzulassen.</P>

          <P>70.<BR>
          Aber vielmehr sind die schuldig, mit Augen und Ohren
          aufzumerken, da&szlig; diese Commissarien nicht statt
          p&auml;pstlichen Befehls ihre eigenen Tr&auml;ume
          predigen.</P>

          <P>71.<BR>
          Wer wider die Wahrheit des apostolischen Ablasses redet,
          der sei Anathema und vermaledeit.</P>

          <P>72.<BR>
          Wer aber wider des Abla&szlig;predigers mutwillige und
          freche Worte Sorge tr&auml;gt und sich bek&uuml;mmert,
          der sei gebenedeit.</P>

          <P>73.<BR>
          Wie der Papst diejenigen billig mit Ungnade und Bann
          schl&auml;gt, die zu Nachteil des
          Abla&szlig;gesch&auml;fts irgendwie betr&uuml;glich
          handeln;</P>

          <P>74.<BR>
          So viel mehr trachtet er, diejenigen mit Ungnade und Bann
          zu schlagen, die unter dem Vorwand des Ablasses zum
          Nachteil der heiligen Liebe und Wahrheit handeln.</P>

          <P>75.<BR>
          Des Papstes Abla&szlig; so hoch halten, da&szlig; er
          einen Menschen absolvieren oder von S&uuml;nden los
          machen k&ouml;nnte, wenn er gleich (unm&ouml;glicher
          Weise zu reden) die Mutter Gottes geschw&auml;cht
          h&auml;tte, ist rasend und unsinnig sein.</P>

          <P>76.<BR>
          Dagegen sagen wir, da&szlig; des Papstes Abla&szlig;
          nicht die allergeringste t&auml;gliche S&uuml;nde
          hinwegnehmen k&ouml;nnte, so viel die Schuld derselben
          belangt.</P>

          <P>77.<BR>
          Da&szlig; man sagt, St. Peter, wenn er jetzt Papst
          w&auml;re, verm&ouml;chte nicht gr&ouml;&szlig;eren
          Abla&szlig; zu geben, ist eine L&auml;sterung wider St.
          Petrum und den Papst.</P>

          <P>78.<BR>
          Dawider sagen wir, da&szlig; auch dieser und ein jeder
          Papst gr&ouml;&szlig;eren Abla&szlig; hat, n&auml;mlich
          das Evangelium, Kr&auml;fte, Gaben, gesund zu machen
          u.s.w. 1. Korinther 12,6,9.</P>

          <P>79.<BR>
          Sagen, das Kreuz, mit des Papstes Wappen herrlich
          aufgerichtet, verm&ouml;ge so viel als das Kreuz Christi,
          ist eine Gottesl&auml;sterung.</P>

          <P>80.<BR>
          Die Bisch&ouml;fe, Seelsorger und Theologen, die da
          leiden, da&szlig; man solche Reden vors Volk bringen
          darf, werden daf&uuml;r einst Rechenschaft geben
          m&uuml;ssen.</P>

          <P>81.<BR>
          Solche freche und unversch&auml;mte Predigt und Ruhm vom
          Abla&szlig; macht, da&szlig; es selbst den Gelehrten
          schwer wird, des Papstes Ehre und W&uuml;rde gegen die
          Verleumdung oder doch vor den scharfen listigen Fragen
          des gemeinen Mannes zu verteidigen.</P>

          <P>82.<BR>
          Als zum Beispiel: Warum entledigt der Papst nicht alle
          Seelen zugleich aus dem Fegefeuer um der allerheiligsten
          Liebe willen und von wegen der h&ouml;chsten Not der
          Seelen, welches doch die allerwichtigste Ursache ist,
          w&auml;hrend er unz&auml;hlig viel Seelen erl&ouml;st um
          des elenden Geldes willen f&uuml;r St. Petrus
          M&uuml;nster, welches doch die geringf&uuml;gigste
          Ursache ist?</P>

          <P>83.<BR>
          Item: Warum bleiben die Beg&auml;ngnis- und Jahrzeit der
          Verstorbenen stehn, und warum gibt er nicht wieder oder
          verg&ouml;nnt zur&uuml;ckzunehmen die Pfr&uuml;nden, die
          den Toten zu gut gestiftet sind, da es nunmehr doch
          unrecht ist, f&uuml;r die schon Erl&ouml;sten zu
          beten?</P>

          <P>84.<BR>
          Item: Was ist das f&uuml;r eine neue Heiligkeit Gottes
          und des Papstes, da&szlig; sie den Gottlosen und dem
          Feind um des Geldes willen verg&ouml;nnen, eine fromme
          und gottgetreue Seele zu erl&ouml;sen, und wollen doch
          nicht vielmehr um der gro&szlig;en Not derselben
          gottesf&uuml;rchtigen und geliebten Seele willen sie aus
          Liebe umsonst erl&ouml;sen?</P>

          <P>85.<BR>
          Item: Warum werden die Satzungen von der Bu&szlig;e, die
          nun l&auml;ngst in ihnen selbst mit der Tat und durch
          ihren Nicht-Gebrauch abgetan und tot sind, noch mit Geld
          gel&ouml;st durch Verg&ouml;nnung des Ablasses, als
          w&auml;ren sie noch in Kraft und lebendig?</P>

          <P>86.<BR>
          Item: Warum baut jetzt der Papst nicht lieber St. Peters
          M&uuml;nster von seinem eigenen Gelde als von der armen
          Christen Gelde, weil doch sein Verm&ouml;gen sich
          h&ouml;her erstreckt, als des reichsten Crassus
          G&uuml;ter?</P>

          <P>87.<BR>
          Item: Was erl&auml;&szlig;t oder teilt der Papst durch
          seinen Abla&szlig; diesem mit, welche durch vollkommene
          Reue schon zu einer vollst&auml;ndigen Vergebung und
          Abla&szlig; berechtigt sind?</P>

          <P>88.<BR>
          Item: Was k&ouml;nnte der Kirche Besseres widerfahren,
          als wenn der Papst, wie er's jetzt nur einmal tut, also
          hundertmal im Tage jedem Gl&auml;ubigen diese Vergebung
          und Abla&szlig; schenkte?</P>

          <P>89.<BR>
          Wenn der Papst der Seelen Seligkeit mehr durch
          Abla&szlig; denn durchs Geld sucht, warum hebt er denn
          vormals gegebene Abla&szlig;briefe auf und erkl&auml;rt
          sie au&szlig;er Kraft, so sie doch gleich kr&auml;ftig
          sind?</P>

          <P>90.<BR>
          Diese sehr spitzigen Fragen der Laien blo&szlig; mit
          Gewalt d&auml;mpfen und nicht durch angezeigten Grund und
          Ursach aufl&ouml;sen wollen, hei&szlig;t die Kirche und
          den Papst den Feinden zum Spott und die Christen unselig
          machen.</P>

          <P>91.<BR>
          Darum, wenn der Abla&szlig; nach des Papstes Sinn und
          Meinung gepredigt w&uuml;rde, w&auml;ren diese Einreden
          leichtlich zu verantworten, ja sie w&auml;ren nie
          vorgefallen.</P>

          <P>92.<BR>
          M&ouml;gen daher alle Propheten hinfahren, die da sagen
          zu der Gemeinde Christi: Friede, Friede! und ist doch
          kein Friede (Hes. 13,10,16.)</P>

          <P>93.<BR>
          Aber wohl alle den Propheten, die da sagen zu der
          Gemeinde Christi: Kreuz, Kreuz! und ist doch kein
          Kreuz.</P>

          <P>94.<BR>
          Man soll die Christen ermahnen, da&szlig; sie Christo,
          ihrem Haupte, durch Kreuz, Tor und H&ouml;lle
          nachzufolgen sich beflei&szlig;igen.</P>

          <P>95.<BR>
          Und also mehr durch viel Tr&uuml;bsal als durch falschen
          Frieden ins Himmelreich einzugehen sich
          getr&ouml;sten.</P>

          <P>Allerheiligen Abend 1517</P>

          <P>Fundst&uuml;ck von<BR>
          Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

