<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Der Schwarzseher Teil 2</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>Von der
          Freiheit eines Christenmenschen</B></FONT></H1>

          <H3 align="center"><FONT color="#ffff00"><B>Martin
          Luther</B></FONT></H3>

          <P>Erstens, da&szlig; wir gr&uuml;ndlich m&ouml;gen
          erkennen, was ein Christenmensch ist und wie es mit der
          Freiheit bestellt ist, die ihm Christus erworben und
          gegeben hat, wovon St. Paulus viel schreibt, will ich
          setzen diese zwei Beschl&uuml;sse:</P>

          <P>Ein Christenmensch ist ein freier Herr &uuml;ber alle
          Dinge und niemand untertan. Ein Christenmensch ist ein
          dienstbarer Knecht aller Dinge und jedermann
          untertan.Diese zwei S&auml;tze stehen klar bei St. Paulus
          1. Kor 9,19: &raquo;Ich bin frei in allen Dingen und habe
          mich eines jeden Knecht gemacht.&laquo; Ferner R&ouml;m
          13,8: &raquo;Ihr sollt niemand in etwas verpflichtet
          sein, au&szlig;er da&szlig; ihr euch einander
          liebet.&laquo; Liebe aber, die ist dem dienstbar und
          untertan, was sie lieb hat; so hei&szlig;t es auch von
          Christus Gal 4,4: &raquo;Gott hat seinen Sohn ausgesandt,
          von einem Weib geboren und dem Gesetze untertan
          gemacht.&laquo;</P>

          <P>zum Andern, um diese zwei sich widersprechenden
          S&auml;tze von der Freiheit und der Dienstbarkeit zu
          verstehen, sollen wir gedenken, da&szlig; ein jeglicher
          Christenmensch ist zweierlei Natur, geistlicher und
          leiblicher. Nach der Seele wird er ein geistlicher,
          neuer, innerlicher Mensch genannt;nach dem Fleisch und
          Blut wird er ein leiblicher, alter und
          &auml;u&szlig;erlicher Mensch genannt. Und um dieses
          Unterschiedes willen wird von ihm gesagt in der Schrift,
          in den Stellen, die da stracks wider einander sind, wie
          ich jetzt gesagt, von der Freiheit und Dienstbarkeit.</P>

          <P>Drittens, so wir betrachten den inwendigen,
          geistlichen Menschen, zu sehen, was dazu geh&ouml;re,
          da&szlig; er ein rechter, freier Christenmensch sei und
          hei&szlig;e, so ist's offenbar, da&szlig; kein
          &auml;u&szlig;erliches Ding ihn kann frei und fromm
          machen, wie es immer genannt werden mag, als seine
          Frommheit und Freiheit; widerum sind seine B&ouml;sheit
          und Gebundenheit leiblich und &auml;u&szlig;erlich.Was
          hilft's der Seele, da&szlig; der Leib ungefangen, frisch
          und gesund ist, i&szlig;t, trinkt, lebt, wie er will?
          widerum, was schadet das der Seele, da&szlig; der Leib
          gefangen, krank und matt ist, hungert, d&uuml;rstet und
          leidet, wie ungern er auch wollte? Dieser Dinge reichet
          keines bis an die Seele, sie zu befreien oder zu fangen,
          gerecht oder b&ouml;se zu machen.</P>

          <P>Viertens. Also hilft es der Seele nichts, wenn der
          Leib heilige Kleider anlegt, wie die Priester und
          Geistlichen tun, auch nicht, wenn er in den Kirchen und
          heiligen St&auml;tten ist, auch nicht wenn er mit
          heiligen Dingen umgeht, auch nicht wenn er leibliche
          Gebete, Fasten, Wallfahrten und alle guten Werke tut, die
          durch und in dem Leibe geschehen m&ouml;chten ewiglich.
          Es mu&szlig; noch ganz etwas anderes sein, was der Seele
          Frommheit und Freiheit bringt und gibt.Denn alle diese
          obengenannten St&uuml;cke, Werke und Weisen kann auch ein
          b&ouml;ser Mensch, ein Glei&szlig;ner (= Blender) und
          Heuchler an sich haben und &uuml;ben. Auch wird durch
          solch Wesen kein ander Volk denn eitel Glei&szlig;ner.
          widerum schadet es der Seele nichts, wenn der Leib
          unheilige Kleider tr&auml;gt, an unheiligen Orten weilt,
          i&szlig;t, trinkt, waltet, betet nicht und
          l&auml;&szlig;t alle die Werke anstehen, die die
          obengenannten Glei&szlig;ner tun.</P>

          <P>F&uuml;nftens hat die Seele kein ander Ding, weder im
          Himmel noch auf Erden, darin sie lebe, fromm, frei und
          christlich sei, denn das heilige Evangelium, das Wort
          Gottes, von Christus gepredigt, wie er selbst sagt, Joh
          11,25: &raquo;Ich bin das Leben und die Auferstehung; wer
          da an mich glaubt der lebet ewiglich.&laquo; Ferner Joh
          14,6: &raquo;Ich bin der Weg, die Wahrheit und das
          Leben.&laquo; Ferner Matth 4,4: &raquo;Der Mensch lebt
          nicht vom Brot allein, sondern von allen Worten, die
          gehen von dem Mund Gottes.&laquo; So m&uuml;ssen wir nun
          gewi&szlig; sein, da&szlig; die Seele kann aller Dinge
          entbehren au&szlig;er dem Wort Gottes, und ohne das Wort
          Gottes ist ihr mit keinem Ding geholfen. Wo sie aber das
          Wort hat, bedarf sie auch keines andern Dinges mehr,
          sondern sie hat an dem Wort genug Speise, Freude,
          Frieden, Licht, Kunst, Gerechtigkeit, Wahrheit, Weisheit,
          Freiheit und alles Gut &uuml;berschw&auml;nglich.Also
          lesen wir im Psalter, besonders im 119. Psalm, da&szlig;
          der Prophet nicht mehr schreiet denn nach dem Wort
          Gottes. Und in der Schrift (Amos 8,11 ff) wird es
          f&uuml;r die allerh&ouml;chste Plage und den
          allerh&ouml;chsten Zorn Gottes gehalten, so er sein Wort
          von den Menschen nimmt; widerum f&uuml;r keine
          gr&ouml;&szlig;ere Gnade, als wo er sein Wort hinsendet,
          wie Psalm 107,20 steht: &raquo;Er hat sein Wort
          ausgesandt; damit hat er ihnen geholfen.&laquo; Und
          Christus um keines andern Amts willen gekommen ist, als
          um das Wort Gottes zu predigen. Auch alle Apostel,
          Bisch&ouml;fe, Priester und der ganze geistliche Stand
          allein um des Wortes willen ist berufen und eingesetzt,
          wiewohl es nun leider anders geht.</P>

          <P>Sechstens. Fragst du aber: Welches ist denn das Wort,
          das solche gro&szlig;e Gnade gibt, und wie soll ich's
          gebrauchen? Antwort: Es ist nichts anderes denn die
          Predigt, von Christus geschehen, wie sie das Evangelium
          enth&auml;lt, welches soll sein und ist also angetan,
          da&szlig; du h&ouml;rest deinen Gott zu dir reden, wie
          all dein Leben und Werk nichts sei vor Gott, sondern wie
          du m&uuml;ssest mit Allem dem, was in dir ist, ewiglich
          verderben. Wenn du dies, wie du schuldig bist, recht
          glaubst, so mu&szlig;t du an dir selbst verzweifeln und
          glauben, da&szlig; wahr sei der Spruch Hoseas (13,9): Oh
          Israel, in dir ist nichts als dein Verderben; allein in
          mir aber steht deine Hilfe.&laquo;Da&szlig; du aber aus
          dir und von dir, d.h. aus deinem Verderben, kommen
          m&ouml;gest, so setzt er dir vor seinen lieben Sohn Jesus
          Christus, und l&auml;&szlig;t dir durch sein lebendiges,
          tr&ouml;stliches Wort sagen: "Du sollst in denselben mit
          festem Glauben dich ergeben und frisch auf ihn vertrauen,
          so sollen dir um desselben Glaubens willen alle deine
          S&uuml;nden vergeben, all dein Verderbten &uuml;berwunden
          sein, und du gerecht, wahrhaftig, befriedet, fromm und
          alle Gebote erf&uuml;llt sein, von allen Dingen frei
          sein, wie St. Paulus R&ouml;m 1,17 sagt: &raquo;Ein
          rechtfertiger Christ lebt nur von seinem Glauben&laquo;,
          und R&ouml;m 10,4: &raquo;Christus ist das Ende und die
          F&uuml;lle aller Gebote denen, die an ihn
          glauben.&laquo;</P>

          <P>Siebtens. Darum sollte das billig aller Christen
          einziges Werk und &Uuml;bung sein, da&szlig; sie das Wort
          und Christum recht in sich bildeten, solchen Glauben
          stetig &uuml;bten und st&auml;rkten. Denn kein ander Werk
          kann einen Christen machen, wie Christus Joh 6,28 zu den
          Juden sagte, da sie ihn fragten, was sie f&uuml;r Werk
          tun sollten, da&szlig; sie g&ouml;ttlich und christlich
          Werk t&auml;ten. Er sprach: &raquo;Das ist das einzige
          g&ouml;ttliche Werk, da&szlig; ihr glaubt an den, den
          Gott gesandt hat,&laquo; welchen Gott, der Vater, dazu
          auch allein verordnet hat. Darum ist ein gar
          &uuml;berschw&auml;nglicher Reichtum ein rechter Glaube
          an Christus, denn er bringet mit sich alle Seligkeit und
          nimmt ab alle Unseligkeit,wie Markus am letzten (16,16)
          sagt: &raquo;Wer da glaubt und getauft ist, der wird
          selig; wer nicht glaubt, der wird verdammt.&laquo; Darum
          der Prophet Jesaja (10,22) den Reichtum desselben
          Glaubens ansah und sprach: &raquo;Gott wird eine kurze
          Summe machen auf Erden und in die kurze Summe wird wie
          Sintflut einflie&szlig;en die Gerechtigkeit;&laquo; das
          hei&szlig;t: der Glaube, darin ganz kurz aller Gebote
          Erf&uuml;llung steht, wird im &Uuml;berflusse
          rechtfertigen alle, die ihn haben, da&szlig; sie nichts
          mehr bed&uuml;rfen, da&szlig; sie gerecht und fromm
          seien. Also sagt St. Paulus R&ouml;m 10, 10:
          &raquo;Da&szlig; man von Herzen glaubt, das macht einen
          gerecht und fromm.&laquo;</P>

          <P>Achtens. Wie geht es aber zu, da&szlig; der Glaube
          allein kann fromm machen, und ohne alle Werke so
          &uuml;berschw&auml;nglichen Reichtum geben, so doch viel
          Gesetze, Gebote, Werke und Weisen uns vorgeschrieben sind
          in der Schrift? Hier ist flei&szlig;ig zu merken und auch
          mit Ernst zu behalten, da&szlig; allein der Glaube ohne
          alle Werke fromm, frei und selig machet, wie wir hernach
          noch h&ouml;ren werden, und ist zu wissen, da&szlig; die
          ganze Heilige Schrift wird in zweierlei Worte geteilet,
          welche sind: Gebot oder Gesetz Gottes und Verhei&szlig;en
          oder Zusagung. Die Gebote lehren und schreiben uns
          mancherlei gute Werke vor, aber damit sind sie noch nicht
          geschehen.Sie weisen wohl, sie helfen aber nicht, lehren,
          was man tun soll, geben aber keine St&auml;rke dazu.Darum
          sind sie nur dazu geordnet, da&szlig; der Mensch darinnen
          sehe sein Unverm&ouml;gen zu dem Guten und lerne an sich
          selbst verzweifeln. Und darum hei&szlig;en sie auch das
          Alte Testament und geh&ouml;ren alle in's Alte Testament.
          Wie das Gebot: &raquo;Du sollst nicht b&ouml;se Begierde
          haben&laquo; (2 Mose 20,17) beweiset, da&szlig; wir
          allesamt S&uuml;nder sind und kein Mensch vermag zu sein
          ohne b&ouml;se Begierde, er tue, was er will, woraus er
          lernet an sich selbst verzagen und anderswo zu suchen
          Hilfe, da&szlig; er ohne b&ouml;se Begierde sei und also
          das Gebot erf&uuml;lle durch einen andern, was er aus
          sich selbst nicht vermag - also sind auch alle andern
          Gebote uns unm&ouml;glich.</P>

          <P>Neuntens. Wenn nun der Mensch aus den Geboten sein
          Unverm&ouml;gen gelernet und empfunden hat, so soll ihm
          Angst werden, wie er dem Gebot genug tun m&ouml;ge,
          sintemal das Gebot mu&szlig; erf&uuml;llt sein, oder er
          mu&szlig; verdammt sein. So ist er recht gedem&uuml;tigt
          und zunichte worden in seinen Augen, findet nichts in
          sich, damit er k&ouml;nne fromm werden. Dann kommt das
          andere Wort, die g&ouml;ttliche Verhei&szlig;ung und
          Zusagung, und spricht: Willst du alle Gebote
          erf&uuml;llen, deine b&ouml;se Begierde und S&uuml;nde
          loswerden, wie die Gebote zwinge und fordern, siehe da,
          glaube an Christus, in welchem ich dir zusage alle Gnade,
          Gerechtigkeit, Frieden und Freiheit; glaubst du, so hast
          du, glaubst du nicht, so hast du nicht.Denn was dir
          unm&ouml;glich ist mit allen Werken der Gebote, deren
          viel sein m&uuml;ssen und doch keins n&uuml;tze ist, das
          wird dir leicht und kurz durch den Glauben. Denn ich habe
          kurz in den Glauben gestellet alle Dinge, da&szlig;, wer
          ihn hat, haben soll alle Dinge und selig sein; wer ihn
          nicht hat, soll nichts haben. Also geben die Zusagungen
          Gottes, was die Gebote erfordern, und vollbringen, was
          die Gebote hei&szlig;en, auf da&szlig; es alles Gottes
          Eigen sei, Gebot und Erf&uuml;llung. Er hei&szlig;et
          allein, er erf&uuml;llt auch allein. Darum sind die
          Zusagungen Gottes Worte des Neuen Testaments und
          geh&ouml;ren auch ins Neue Testament.</P>

          <P>Zehntens. Nun sind diese und alle Worte Gottes heilig,
          wahrhaftig, gerecht, friedsam, frei und aller G&uuml;te
          voll; darum, wer ihnen mit einem rechten Glauben anhangt,
          de&szlig; Seele wird mit ihm vereinigt so ganz und gar,
          da&szlig; alle Tugenden des Wortes auch Eigen werden der
          Seele und also durch den Glauben die Seele von dem
          Gotteswort heilig, gerecht, wahrhaftig, friedsam, frei
          und aller G&uuml;te voll, ein wahrhaftiges Kind Gottes
          wird, wie Johannes 1,12 sagt: &raquo;Er hat ihnen Macht
          gegeben, da&szlig; sie m&ouml;gen Kinder Gottes werden,
          alle die in seinem Namen glauben.&laquo; Hieraus
          leichtlich zu merken ist, warum der Glaube so viel
          vermag, und da&szlig; keine guten Werke ihm gleich sein
          k&ouml;nnen. Denn kein gut Werk hanget an dem
          g&ouml;ttlichen Wort wie der Glaube, kann auch nicht in
          der Seele sein, sondern allein das Wort und der Glaube
          regieren in der Seele.Wie das Wort ist, so wird auch die
          Seele von ihm, gleich wie das Eisen wird glutrot wie das
          Feuer aus der Vereinigung mit dem Feuer. Also sehen wir,
          da&szlig; in dem Glauben ein Christenmensch genug hat; er
          bedarf keines Werks, da&szlig; er fromm sei. Bedarf er
          denn keines Werks mehr, so ist er gewi&szlig;lich
          entbunden von allen Geboten und Gesetzen; ist er
          entbunden, so ist er gewi&szlig;lich frei. Das ist die
          christliche Freiheit, der einzige Glaube, der da macht,
          nicht da&szlig; wir m&uuml;&szlig;ig gehen oder &uuml;bel
          tun k&ouml;nnen, sondern da&szlig; wir keines Werks
          bed&uuml;rfen, zur Frommheit und Seligkeit zu gelangen,
          wovon wir hernach mehr sagen wollen.</P>

          <P>Elftens. Weiter ist's mit dem Glauben also getan,
          da&szlig;, welcher dem andern glaubt, ihm darum glaubt,
          weil er ihn f&uuml;r einen frommen, wahrhaftigen Mann
          achtet, welches die gr&ouml;&szlig;te Ehre ist, die ein
          Mensch dem andern tun kann, wie es widerum die
          gr&ouml;&szlig;te Schmach ist, so er ihn f&uuml;r einen
          losen, l&uuml;genhaftigen, leichtfertigen Mann achtet.
          Also auch, wenn die Seele Gottes Wort festiglich glaubt,
          so h&auml;lt sie ihn f&uuml;r wahrhaftig, fromm und
          gerecht, womit sie ihm tut die allergr&ouml;&szlig;te
          Ehre, die sie ihm tun kann. Denn da gibt sie ihm Recht,
          da l&auml;&szlig;t sie ihm Recht, da ehret sie seinen
          Namen und l&auml;&szlig;t mit sich handeln, wie er will,
          denn sie zweifelt nicht, er sei fromm, wahrhaftig in
          allen seinen Worten. widerum kann man Gott keine
          gr&ouml;&szlig;ere Unehre antun, als ihm nicht
          glauben,womit die Seele ihn f&uuml;r einen
          Unt&uuml;chtigen, L&uuml;genhaftigen, Leichtfertigen
          h&auml;lt und, soviel an ihr ist, ihn verleugnet mit
          solchem Unglauben und einen Abgott ihres eigenen Sinns im
          Herzen wider Gott aufrichtet, als wollte sie es besser
          wissen denn er. - Wenn dann Gott siehet, da&szlig; ihm
          die Seele Wahrheit gibt und ihn also ehret durch ihren
          Glauben, so ehret er sie wiederum und h&auml;lt sie auch
          f&uuml;r fromm und wahrhaftig durch solchen Glaubens.
          Denn da&szlig; man Gott die Wahrheit und Frommheit gebe,
          das ist Recht und Wahrheit und macht recht und
          wahrhaftig, welches die nicht tun, die nicht glauben und
          sich doch mit vielen guten Werken treiben und
          m&uuml;hen.</P>

          <P>Zw&ouml;lftens. Nicht allein gibt der Glaube so viel,
          da&szlig; die Seele dem g&ouml;ttlichen Wort gleich wird,
          aller Gnade voll, frei und selig; sondern er vereinigt
          auch die Seele mit Christus wie eine Braut mit ihrem
          Br&auml;utigam, aus welcher Ehe folget, wie St. Paulus
          (Eph 5,30) sagt, da&szlig; Christus und die Seele ein
          Leib werden; ebenso werden auch beider . So werden auch
          Beider G&uuml;ter, Fall, Unfall und alle Dinge gemein, so
          da&szlig;, was Christus hat, auch Eigen ist der
          gl&auml;ubigen Seele; was die Seele hat, wird Eigen
          Christi. Nun hat Christus alle G&uuml;ter und Seligkeit:
          die sind der Seele Eigen; nun hat die Seele alle Untugend
          und S&uuml;nde auf sich: die werden Christi Eigen. Hier
          erhebt sich nun der fr&ouml;hliche Wechsel und Streit.
          Dieweil Christus ist Gott und Mensch, welcher noch nie
          ges&uuml;ndigt hat, und seine Frommheit
          un&uuml;berwindlich, ewig und allm&auml;chtig ist, so er
          denn der gl&auml;ubigen Seele S&uuml;nde durch ihren
          Brautring, das ist den Glauben, sich selbst zu eigen
          macht und nicht anders tut, als h&auml;tte er sie getan,
          so m&uuml;ssen die S&uuml;nden in ihm verschlungen und
          ers&auml;uft werden.Denn seine un&uuml;berwindliche
          Gerechtigkeit ist allen S&uuml;nden zu stark. Also wird
          die Seele von allen ihren S&uuml;nden gel&auml;utert
          durch ihren Mahlschatz (= Brautschatz, Brautring), das
          ist des Glaubens halber, und wird ledig und frei und
          begabt mit der ewigen Gerechtigkeit ihres Br&auml;utigams
          Christus. Ist das nicht eine fr&ouml;hliche Wirtschaft,
          da&szlig; der reiche, edle, fromme Br&auml;utigam
          Christus das arme, verachtete, b&ouml;se H&uuml;rlein zur
          Ehe nimmt und sie entledigt von allem &Uuml;bel, zieret
          mit allen G&uuml;tern? So ist's nicht m&ouml;glich,
          da&szlig; die S&uuml;nden sie verdammen, denn sie liegen
          nun auf Christus und sind in ihm verschlungen. Auf diese
          Weise hat sie so eine reiche Gerechtigkeit in ihrem
          Br&auml;utigam, da&szlig; sie abermals wider alle
          S&uuml;nden bestehen kann, ob sie schon auf ihr
          l&auml;gen. Davon sagt Paulus 1. Korinther 15,57:
          &raquo;Gott sei Lob und Dank, der uns hat gegeben eine
          solche &Uuml;berwindung in Christo Jesu, in welcher
          verschlungen ist der Tod mit der S&uuml;nde.&laquo;</P>

          <P>Dreizehntens. Hier siehst du aber, aus welchem Grund
          dem Glauben billig so viel zugeschrieben wird, da&szlig;
          er alle Gebote erf&uuml;llet und ohne alle andern Werke
          fromm macht. Denn du siehst hier, da&szlig; er das erste
          Gebot erf&uuml;llet alleine, wo geboten wird: &raquo;Du
          sollst deinen Gott ehren.&laquo; Wenn du nun eitel gut
          Werk w&auml;rest bis auf die Fersen, so w&auml;rest du
          dennoch nicht fromm und g&auml;best Gott noch keine Ehre,
          und also erf&uuml;lltest du das allererste Gebot nicht.
          Denn Gott kann nicht geehret werden, ihm werde denn
          Wahrheit und alles Gute zugeschrieben, wie er denn
          wahrlich ist. Das tun aber keine guten Werke, sondern
          allein der Glaube des Herzens. Darum ist er allein die
          Gerechtigkeit des Menschen und aller Gebote
          Erf&uuml;llung.Denn wer das erste Hauptgebot
          erf&uuml;llet, der erf&uuml;llet gewi&szlig;lich und
          leichtlich auch alle andern Gebote. Die Werke aber sind
          tote Dinge, k&ouml;nnen nicht ehren noch loben Gott,
          wiewohl sie m&ouml;gen geschehenlassen sich tun, Gott zu
          Ehren und Lobe. Aber wir suchen hier den, der nicht getan
          wird wie die Werke, sondern den Selbstt&auml;ter und
          Werkmeister, der Gott ehret und die Werke tut. Das ist
          niemand denn der Glaube des Herzens: der ist das Haupt
          und das ganze Wesen der Frommheit. Darum es eine
          gef&auml;hrliche, finstere Rede ist, wenn man lehret, die
          Gebote Gottes mit Werken zu erf&uuml;llen, w&auml;hrend
          die Erf&uuml;llung vor allen Werken durch den Glauben
          mu&szlig; geschehen sein und die Werke folgen nach der
          Erf&uuml;llung, wie wir h&ouml;ren werden.</P>

          <P>Vierzehntens ist weiter zu sehen, was wir in Christo
          haben und wie gro&szlig; Gut sei ein rechter Glaube. Es
          ist zu wissen, da&szlig; vor und in dem alten Testament
          Gott sich auszog (=ausw&auml;hlte) und vorbehielt alle
          erste m&auml;nnliche Geburt, von Menschen und Tieren (2
          Mose 13,2 u. 4 Mose 8,17); und die erste Geburt war
          k&ouml;stlich und hatte zwei gro&szlig;e Vorteile vor
          allen andern Kindern, n&auml;mlich die Herrschaft und
          Priesterschaft oder K&ouml;nigreich und Priestertum, also
          da&szlig; auf Erden das erste geborene Kn&auml;blein war
          ein Herr &uuml;ber alle seine Br&uuml;der und ein Pfaffe
          oder Papst vor Gott. Durch dieses Gleichnis wird bedeutet
          Jesus Christus, der eigentlich dieselbe erste
          m&auml;nnliche Geburt ist Gottes, des Vaters, von der
          Jungfrau Maria. Darum ist er ein K&ouml;nig und Priester,
          doch geistlich, denn sein Reich ist nicht irdisch noch in
          irdischen, sondern in geistlichen G&uuml;tern, als da
          sind Wahrheit, Weisheit, Friede, Freude, Seligkeit
          usw.Damit aber ist nicht ausgenommen zeitlich Gut, denn
          es sind ihm alle Dinge unterworfen im Himmel, Erde und
          H&ouml;lle, wiewohl man ihn nicht sieht, das macht, weil
          er geistlich, unsichtbar regiert.</P>

          <P>Also auch sein Priestertum nicht in den
          &auml;u&szlig;erlichen Geb&auml;rden und Kleidern
          besteht, wie wir bei den Menschen sehen, sondern es
          besteht im Geist unsichtbar also, da&szlig; er vor Gottes
          Augen ohne Unterla&szlig; f&uuml;r die Seinen steht und
          sich selbst opfert und alles tut, was ein frommer
          Priester tun soll. &raquo;Er bittet f&uuml;r uns&laquo;,
          wie St. Paulus R&ouml;mer 8,34 sagt; ebenso lehret er uns
          inwendig im Herzen, welches sind zwei eigentliche, rechte
          &Auml;mter eines Priesters, denn also bitten und lehren
          auch &auml;u&szlig;erliche, menschliche, zeitliche
          Priester.</P>

          <P>F&uuml;nfzehntens. Wie nun Christus die erste Geburt
          hat mit ihrer Ehre und W&uuml;rdigkeit, also teilet er
          sie mit allen seinen Christen, da&szlig; dieselben durch
          den Glauben auch alle m&uuml;ssen K&ouml;nige und
          Priester sein mit Christo, wie St. Petrus (1 Petr 2,9)
          sagt: &raquo;Ihr seid ein priesterlich K&ouml;nigreich
          und ein k&ouml;niglich Priestertum.&laquo; Und das geht
          also zu, da&szlig; ein Christenmensch durch den Glauben
          so hoch erhoben wird &uuml;ber alle Dinge, da&szlig; er
          aller Dinge geistlich Herr wird, denn es kann ihm kein
          Ding nicht schaden zur Seligkeit. Ja, es mu&szlig; ihm
          alles untertan sein und helfen zur Seligkeit, wie St.
          Paulus R&ouml;m 8,28 lehret: &raquo;Alle Dinge
          m&uuml;ssen helfen den Auserw&auml;hlten zu ihrem
          Besten&laquo;, es sei Leben, Sterben, S&uuml;nde,
          Frommheit, Gutes oder B&ouml;ses, wie es auch
          hei&szlig;en mag; ferner 1. Kor 3,21 f: &raquo;Alle Dinge
          sind euer, es sei das Leben oder der Tod,
          gegenw&auml;rtig oder zuk&uuml;nftig usw.&laquo;</P>

          <P>Nicht, da&szlig; wir aller Dinge leiblich m&auml;chtig
          sind, sie zu besitzen oder zu brauchen, wie die Menschen
          auf Erden,denn wir m&uuml;ssen sterben leiblich und kann
          niemand dem Tod entfliehen; ebenso m&uuml;ssen wir auch
          viel andern Dingen unterliegen, wie wir an Christo und
          seinen Heiligen sehen. Denn dies ist eine geistliche
          Herrschaft, die da regieret in der leiblichen
          Unterdr&uuml;ckung, das sit, ich kann mich an allen
          Dingen bessern nach der Seele, da&szlig; auch der Tod und
          Leiden mir m&uuml;ssen dienen zur Seligkeit. Das ist eine
          gar hohe, herrliche W&uuml;rdigkeit und eine rechte,
          allm&auml;chtige Herrschaft, ein geistlich
          K&ouml;nigreich, da kein Ding ist so gut, so b&ouml;se,
          es mu&szlig; mir dienen zum Guten, so ich glaube, und ich
          bedarf sein doch nicht, sondern mein Glaube ist mir
          genugsam. Siehe, wie ist das eine k&ouml;stliche Freiheit
          und Gewalt der Christen!</P>

          <P>Sechzehntens. &Uuml;berdies sind wir Priester, das ist
          noch viel mehr denn K&ouml;nig sein, darum, weil das
          Priestertum uns w&uuml;rdig macht, vor Gott zu treten und
          f&uuml;r andere zu bitten. Denn vor Gottes Augen zu stehn
          und zu bitten, geb&uuml;hrt niemand denn den Priestern.
          Also hat uns Christus ausgewirkt (= f&uuml;r uns
          erwirkt), da&szlig; wir k&ouml;nnen geistlich vor
          einander treten und bitten, wie ein Priester vor das Volk
          leiblich tritt und bittet. Wer aber nicht glaubt an
          Christum, dem dient kein Ding zum Guten: er ist ein
          Knecht aller Dinge, mu&szlig; sich aller Dinge
          &auml;rgern. Dazu ist sein Gebet nicht angenehm, kommt
          auch nicht vor Gottes Augen. Wer mag nun ausdenken die
          Ehre und H&ouml;he eines Christenmenschen? Durch sein
          K&ouml;nigreich ist er aller Dinge m&auml;chtig, durch
          sein Priestertum ist er Gottes m&auml;chtig, denn Gott
          tut, was er bittet und will, wie da steht geschrieben im
          Psalter (Psalm 145,19):&raquo;Gott tut den Willen derer,
          die ihn f&uuml;rchten, und erh&ouml;ret ihr Gebet&laquo;,
          zu welchen Ehren sie nur allein durch den Glauben und
          durch kein Werk kommen. Daraus sieht man klar, wie ein
          Christenmensch frei ist von allen Dingen und &uuml;ber
          alle Dinge, also da&szlig; er keiner guten Werke dazu
          bedarf, da&szlig; er fromm und selig sei; sondern der
          Glaube bringt's ihm alles &uuml;berfl&uuml;ssig. Und wo
          er so t&ouml;richt w&auml;re und meinte, durch ein gutes
          Werk fromm, frei, selig oder Christ zu werden, so
          verl&ouml;re er den Glauben mit allen Dingen, gleichwie
          der Hund, der ein St&uuml;ck Fleisch im Mund trug und
          nach dem Schemen (= Schatten, Trugbild) im Wasser
          schnappte, damit Fleisch und Schemen verlor.</P>

          <P>Siebzehntens. Fragst du, was ist denn f&uuml;r ein
          Unterschied zwischen den Priestern und Laien in der
          Christenheit, so sie alle Priester sind? Antwort: Es ist
          dem W&ouml;rtlein Priester, Pfaffe, geistlich und
          desgleichen Unrecht geschehen, da&szlig; sie von dem
          gemeinen Haufen sind gezogen auf den kleinen Haufen, den
          man jetzt nennet geistlichen Stand. Die Heilige Schrift
          gibt keinen andern Unterschied, denn da&szlig; sie die
          Gelehreten und Geweiheten nennet ministros, servos,
          oeconomos nennt, das ist Diener, Knechte, Schaffner (=
          Verwalter), die da sollen den andern Christum, Glauben
          und christliche Freiheit predigen. Denn obwohl wir alle
          gleich Priester sind, so k&ouml;nnen wir doch nicht alle
          dienen oder schaffen (= verwalten) und predigen.Also sagt
          St. Paulus 1. Kor. 4,1: &raquo;Wir wollen f&uuml;r nichts
          mehr von den Leuten gehalten sein denn Christi Diener und
          Schaffner des Evangelii.&laquo; Aber nun ist aus der
          Schaffnerei geworden eine solch weltliche,
          &auml;u&szlig;erliche, pr&auml;chtige, furchtsame
          Herrschaft und Gewalt, da&szlig; ihr die rechte weltliche
          Macht in keinem Wege kann gleichen, gerade als w&auml;ren
          die Laien etwas anderes als Christenleute, womit
          hin(weg)genommen ist der ganze Sinn christlicher Gnade,
          Freiheit, Glaubens und alles, was wir von Christo haben,
          und Christus selbst; wir haben daf&uuml;r &uuml;berkommen
          viel Menschen-Gesetz und -Werk, sind ganz Knechte
          geworden der allerunt&uuml;chtigsten Leute auf Erden.</P>

          <P>Achtzehntens. Aus dem allem lernen wir, da&szlig; es
          nicht genug sei gepredigt, wenn man Christus' Leben und
          Werk obenhin und nur als eine Historie und
          Chronikengeschichte predigt, geschweige denn, so man sein
          gar schweigt und das geistliche Recht oder andere
          Menschen-Gesetze und -Lehren predigt. Es sind auch viele,
          die Christum also predigen und lesen, da&szlig; sie ein
          Mitleiden &uuml;ber ihn haben, mit den Juden z&uuml;rnen
          oder sonst mehr kindische Weise darinnen &uuml;ben. Aber
          er soll und mu&szlig; also gepredigt sein, da&szlig; mir
          und dir der Glaube draus erwachse und erhalten werde,
          welcher Glaube dadurch erw&auml;chst und erhalten wird,
          wenn mir gesagt wird, warum Christus gekommen sei, wie
          man sein brauchen und genie&szlig;en soll, was er mir
          gebracht und gegeben hat: das geschieht dort, wo man
          recht auslegt die christliche Freiheit, die wir von ihm
          haben, und wie wir K&ouml;nige und Priester sind, aller
          Dinge m&auml;chtig. Und alles, was wir tun, das sei vor
          Gottes Augen angenehm und erh&ouml;ret, wie ich bisher
          gesagt habe.Denn wo ein Herz also Christum h&ouml;ret,
          das mu&szlig; fr&ouml;hlich werden von ganzem Grunde,
          Trost empfangen und s&uuml;&szlig; werden gegen Christus,
          ihn wiederum lieb zu haben. Dahin es nimmermehr mit
          Gesetzen oder Werken kommen kann. Denn wer will einem
          solchen Herzen Schaden tun oder es erschrecken?
          F&auml;llt die S&uuml;nde und der Tod daher, so glaubt
          es, Christus' Frommheit sei sein, und seine S&uuml;nden
          seien nimmer sein, sondern Christi: so mu&szlig; die
          S&uuml;nde verschwinden vor Christus' Frommheit in dem
          Glauben, wie droben gesagt ist, und das Herz lernet, mit
          dem Apostel (1. Kor. 15,55 ff) dem Tod und der S&uuml;nde
          Trotz zu bieten und sagen: &raquo;Wo ist nun, du Tod,
          dein Sieg? Wo ist nun, Tod, dein Spie&szlig;? Dein
          Spie&szlig; ist die S&uuml;nde. Aber Gott sei Lob und
          Dank, der uns hat gegeben den Sieg durch Jesum Christum,
          unsern Herrn. Und der Tod ist ers&auml;uft in seinem Sieg
          usw.&laquo;</P>

          <P>Neunzehntens. Das sei nun genug gesagt von dem
          innerlichen Menschen, von seiner Freiheit und der
          Hauptgerechtigkeit, welche keines Gesetzes noch guten
          Werks bedarf; ja es ist ihr sch&auml;dlich, so jemand
          dadurch gerechtfertigt zu werden sich wollte vermessen.
          Nun kommen wir auf's andere Teil, auf den
          &auml;u&szlig;erlichen Menschen. Hier wollen wir
          antworten allen denen, die sich &auml;rgern aus den
          vorigen Reden und pflegen zu sprechen: &raquo;Ei, so denn
          der Glaube alle Dinge ist und gilt allein genugsam, um
          fromm zu machen, warum sind denn die guten Werke geboten?
          So wollen wir guter Dinge sein und nichts
          tun!&laquo;Nein, lieber Mensch, nicht also! Es w&auml;re
          wohl also, wenn du ganz allein ein innerlicher Mensch
          w&auml;rest und ganz geistlich und innerlich geworden,
          welches nicht geschieht bis am j&uuml;ngsten Tag. Es ist
          und bleibt auf Erden nur ein Anheben und Zunehmen,
          welches wird in jener Welt vollbracht. Daher
          hei&szlig;t's der Apostel (R&ouml;mer 8,23) primitias
          spiritus, das sind die ersten Fr&uuml;chte des Geistes;
          darum geh&ouml;rt hierher, was droben gesagt ist:
          &raquo;Ein Christenmensch ist ein dienstbarer Knecht und
          jedermann untertan&laquo;; das ist so vile wie: Wo er
          frei ist, darf er nichts tun, wo er Knecht ist, mu&szlig;
          er allerlei tun. Wie das zugehe, wollen wir sehen.</P>

          <P>Zwanzigstens. Obwohl der Mensch innwendig, nach der
          Seele hin, durch den Glauben genugsam gerechtfertigt und
          alles hat, was er haben soll, ohne da&szlig; derselbe
          Glaube und das Genug mu&szlig; immer zunehmen bis in
          jenes Leben, so bleibt er doch noch in diesem leiblichen
          Leben auf Erden und mu&szlig; seinen eigenen Leib
          regieren und mit Leuten umgehen. Da heben sich nun die
          Werke an. Hier mu&szlig; er nicht m&uuml;&szlig;ig gehn,
          da mu&szlig; f&uuml;rwahr der Leib mit Fasten, Wachen,
          Arbeiten und in allem m&auml;&szlig;ige Zucht getrieben
          und ge&uuml;bt sein, da&szlig; er dem innerlichen
          Menschen und dem Glauben gehorsam und gleichf&ouml;rmig
          werde, nicht hindere noch widerstrebe, wie seine Art ist,
          wo er nicht gezwungen wird. Denn der innerliche Mensch
          ist mit Gott eins, fr&ouml;hlich und lustig um Christus'
          willen, der ihm so viel getan hat, und besteht alle seine
          Lust darin, da&szlig; er widerum Gott auch umsonst
          m&ouml;chte dienen in freier Liebe.Doch findet er in
          seinem Fleisch einen widerspenstigen Willen, der will der
          Welt dienen und suchen, was ihn gel&uuml;stet. Das mag
          der Glaube nicht leiden und legt sich mit Lust an seinen
          Hals, ihn zu d&auml;mpfen und ihm zu wehren, wie St.
          Paulus sagt, R&ouml;mer 7,22 f: &raquo;Ich habe eine Lust
          zu Gottes Willen nach meinem innern Menschen, doch finde
          ich einen andern Willen in meinem Fleisch, der will mich
          mit S&uuml;nden gefangen nehmen.&laquo; Ferner 1. Kor.
          9,27: &raquo;Ich z&uuml;chtige meinen Leib und treibe ihn
          zu Gehorsam, damit ich nicht selbst verwerflich werde,
          der ich die andern lehren soll.&laquo; Ferner Gal. 5,24:
          &raquo;Alle, die Christo angeh&ouml;ren, die kreuzigen
          ihr Fleisch mit seinen b&ouml;sen L&uuml;sten.&laquo;</P>

          <P>Einundzwanzigstens. Aber dieselben Werke m&uuml;ssen
          nicht geschehen in der Meinung, da&szlig; dadurch der
          Mensch fromm werde vor Gott, denn die falsche Meinung
          kann der Glaube nicht leiden, der allein ist und sein
          mu&szlig; die Frommheit vor Gott; sondern nur in der
          Meinung, da&szlig; der Leib gehorsam werde und gereinigt
          von seinen b&ouml;sen L&uuml;sten und das Auge nur sehe
          auf die b&ouml;sen L&uuml;ste, sie auszutreiben. Denn
          dieweil die Seele durch den Glauben rein ist und Gott
          liebet, wollte sie gern, da&szlig; auch alle Dinge rein
          w&auml;ren, besonders ihr eigener Leib, und jedermann
          Gott mit ihr liebte und lobte. So geschieht's, da&szlig;
          der Mensch seines eigenen Leibes halben nicht kann
          m&uuml;&szlig;ig gehen und mu&szlig; viel guter Werke
          darob &uuml;ben, da&szlig; er ihn zwinge; und doch sind
          die Werke nicht das rechte Gutsein, davon er fromm und
          gerecht sei vor Gott, sondern er tue sie aus freier Liebe
          umsonst, Gott zu gefallen,und suche darin und sehe auf
          nichts anderes, denn da&szlig; es Gott also gef&auml;llt,
          dessen Willen er gerne t&auml;te auf's allerbeste. Daraus
          denn ein jeglicher kann selbst nehmen Ma&szlig; und
          Bescheidenheit, den Leib zu kasteien, denn er fastet,
          wachet, arbeitet so viel, wie er sieht, da&szlig; dem
          Leib Not (= n&ouml;tig) ist, seinen Mutwillen zu
          d&auml;mpfen. Die andern aber, die da meinen, mit Werken
          fromm zu werden, haben keine Acht auf die Kasteiung,
          sondern sehen nur auf die Werke und meinen, wenn sie
          derselben nur viele und gro&szlig;e tun, so sei es wohl
          getan und sie w&uuml;rden fromm; sie zerbrechen zuweilen
          die K&ouml;pfe und verderben ihre Leiber dar&uuml;ber.
          Das ist eine gro&szlig;e Torheit und Unverstand
          christlichen Lebens, da&szlig; sie ohne Glauben durch
          Werke fromm und selig werden wollen.</P>

          <P>Zweiundzwanzigstens. Da&szlig; wir davon etliche
          Gleichnisse geben, soll man die Werke eines
          Christenmenschen, der durch seinen Glauben und aus reinen
          Gnaden Gottes umsonst ist gerechtfertigt und selig
          worden, nicht anders achten, als wie die Werke Adams und
          Ev&auml; im Paradies gewesen w&auml;ren, davon 1. Mose
          21,15 steht geschrieben, da&szlig; Gott den geschaffenen
          Menschen setzte in's Paradies, das er dasselbe bearbeiten
          und h&uuml;ten sollte. Nun war Adam von Gott fromm und
          wohl geschaffen, ohne S&uuml;nde, da&szlig; er durch sein
          Arbeiten und H&uuml;ten nicht brauchte fromm und
          gerechtfertigt zu werden; doch da&szlig; er nicht
          m&uuml;&szlig;ig ginge, gab ihm Gott zu schaffen, das
          Paradies zu pflanzen, zu bauen und bewahren. Diese
          w&auml;ren eitel freie Werke gewesen, um keines Dings
          willen getan, denn allein Gott zu gefallen, und nicht um
          Frommheit zu erlangen, die er zuvor hatte, welche uns
          auch allen nat&uuml;rlich w&auml;re angeboren
          gewesen.Also auch eines gl&auml;ubigen Menschen Werk,
          welcher durch seinen Glauben ist wiederum in's Paradies
          gesetzt und von neuem geschaffen: er bedarf keiner Werke,
          fromm zu werden, sondern da&szlig; er nicht
          m&uuml;&szlig;ig gehe und seinen Leib anstrenge und
          bewahre, darum allein sind ihm solche freien Werke zu tun
          befohlen, und damit er Gott gefalle. Ebenso, gleichwie
          einen geweiheten Bischof, wenn er Kirchen weihet, firmt
          oder sonst seines Amtes Werk &uuml;bet, dieselben Werke
          nicht zu einem Bischof machen - ja, wenn er nicht zuvor
          zum Bischof geweihet w&auml;re, so taugte derselben Werke
          keines und w&auml;re eitel Narrenwerk -; also wird ein
          Christ, der, durch den Glauben geweihet, gute Werke tut,
          durch dieselben nicht besser oder mehr geweihet (was
          nichts denn des Glaubens Mehrung tut) zu einem Christen;
          ja wenn er nicht zuvor glaubte und Christ w&auml;re, so
          g&auml;lten alle seine Werke nichts, sondern w&auml;ren
          eitel n&auml;rrische, str&auml;fliche, verdammliche
          S&uuml;nde.</P>

          <P>Dreiundzwanzigstens. Drum sind die zwei Spr&uuml;che
          wahr: &raquo;Gute, fromme Werke machen nimmermehr einen
          guten, frommen Mann, sondern ein guter, frommer Mann
          macht gute, fromme Werke;&laquo; &raquo;b&ouml;se Werke
          machen nimmermehr einen b&ouml;sen Mann, sondern ein
          b&ouml;ser Mann macht b&ouml;se Werke,&laquo; also
          da&szlig; allerwegen zuerst die Person mu&szlig; gut und
          fromm sein vor allen guten Werken, und gute Werke folgen
          und ausgehen von der frommen, guten Person, gleichwie
          Christus sagt (Matth. 7,18): &raquo;Ein b&ouml;ser Baum
          tr&auml;gt keine gute Frucht, ein guter Baum tr&auml;gt
          keine b&ouml;se Frucht.&laquo; Nun ist's offenbar,
          da&szlig; die Fr&uuml;chte nicht den Baum tragen, so
          wachsen auch die B&auml;ume nicht auf den Fr&uuml;chten,
          sondern widerum die B&auml;ume tragen die Fr&uuml;chte
          und die Fr&uuml;chte wachsen auf den B&auml;umen. Wie nun
          die B&auml;ume m&uuml;ssen f&uuml;her sein denn die
          Fr&uuml;chte und die Fr&uuml;chte die B&auml;ume nicht zu
          guten oder b&ouml;sen machen, sondern die B&auml;ume
          machen die Fr&uuml;chte, also mu&szlig; der Mensch in der
          Person zuvor fromm oder b&ouml;se sein, ehe er gute oder
          b&ouml;se Werke tut, und seine Werke machen ihn nicht gut
          oder b&ouml;se, sondern er macht gute oder b&ouml;se
          Werke. Desgleichen sehen wir in allen Handwerken.Ein
          gutes oder b&ouml;ses Haus macht keinen guten oder
          b&ouml;sen Zimmermann, sondern ein guter oder b&ouml;ser
          Zimmermann macht ein gutes oder b&ouml;ses Haus;kein Werk
          macht einen Meister, darnach das Werk ist, sondern wie
          der Meister ist, darnach ist sein Werk auch. Also sind
          die Werke des Menschen auch: wie es mit ihm steht im
          Glauben oder Unglauben darnach sind seine Werke gut oder
          b&ouml;se, und nicht widerum, wie seine Werke stehn,
          darnach sei er fromm oder gl&auml;ubig. Die Werke gleich
          wie sie nicht gl&auml;ubig machen, so machen sie auch
          nicht fromm; aber der Glaube, gleich wie er fromm macht,
          so macht er auch gute Werke. So denn die Werke niemand
          fromm machen und der Mensch zuvor mu&szlig; fromm sein,
          ehe er Werke tut, so ist offenbar, da&szlig; allein der
          Glaube aus lauter Gnaden durch Christum und sein Wort die
          Person genugsam fromm und selig machet und da&szlig; kein
          Werk, kein Gebot einem Christen not sei zur Seligkeit,
          sondern er frei ist von allen Geboten und aus lauter
          Freiheit umsonst tut, was er tut,ohne damit zu suchen
          seinen Nutz oder Seligkeit (denn er ist schon satt und
          selig durch seinen Glauben und Gottes Gnaden), sondern
          nur um Gott darinnen zu gefallen.</P>

          <P>Vierundzwanzigstens. Widerum dem, der ohne Glauben
          ist, ist kein gut Werk f&ouml;rderlich zur Frommheit und
          Seligkeit; widerum keine b&ouml;sen Werke ihn b&ouml;se
          und verdammt machen, sondern der Unglaube, der die Person
          und den Baum b&ouml;se macht, der tut b&ouml;se und
          verdammte Werke. Darum, wenn man fromm oder b&ouml;se
          wird, hebet sich's nicht an den Werken an, sondern an dem
          Glauben, wie der weise Mann (Sirach 10,14 ff) sagt:
          &raquo;Anfang aller S&uuml;nde ist von Gott weichen und
          ihm nicht trauen.&laquo; Also lehret auch Christus, wie
          man nicht an den Werken mu&szlig; anheben, und sagt
          (Matth. 12,33): &raquo;Entweder macht den Baum gut und
          seine Fr&uuml;chte gut, oder macht den Baum b&ouml;se und
          seine Fr&uuml;chte b&ouml;se,&laquo; ebenso sollte er
          sagen: wer gute Fr&uuml;chte haben will, mu&szlig; zuvor
          den Baum anheben und denselben gut setzen. Also, wer da
          will gute Werke tun, mu&szlig; nicht an den Werken
          anheben, sondern an der Person, die Werke tun soll. Die
          Person aber macht niemand gut denn allein der Glaube, und
          niemand macht sie b&ouml;se denn allein der Unglaube. Das
          ist wohl wahr, die Werke machen einen fromm oder
          b&ouml;se vor den Menschen, das ist, sie zeigen
          &auml;u&szlig;erlich an, wer fromm oder b&ouml;se sei,
          wie Christus (Matth. 7,20) sagt: &raquo;Aus ihren
          Fr&uuml;chten sollt ihr sie erkennen.&laquo;Aber das ist
          alles im Schein und &auml;u&szlig;erlich, welches Ansehen
          irre macht viel Leute, die da schreiben und lehren, wie
          man gute Werke tun soll und fromm werden, so sie doch des
          Glaubens nimmer gedenken; sie gehn dahin und es
          f&uuml;hret immer ein Blinder den andern, martern sich
          mit vielen Werken und kommen doch nimmer zu der rechten
          Frommheit, von welchen St. Paulus sagt (2 Tim 3,5 ff):
          &raquo;Sie haben einen Schein der Frommheit, aber der
          Grund ist nicht da, gehn hin und lernen immer und immer,
          und kommen doch nimmer zur Erkenntnis der wahren
          Frommheit.&laquo; Wer nun mit denselben Blinden nicht
          will irren, mu&szlig; weiter sehen denn in die Werke,
          Gebote oder Lehre der Werke: er mu&szlig; in die Person
          sehen vor allen Dingen, wie die fromm werde. Die wird
          aber nicht durch Gebot und Werk, sondern durch Gottes
          Wort (das ist, durch seine Verhei&szlig;ung der Gnade)
          und den Glauben fromm und selig, auf da&szlig; bestehe
          seine g&ouml;ttliche Ehre, da&szlig; er uns nicht durch
          unser Werk, sondern durch sein gn&auml;diges Wort umsonst
          und aus lauter Barmherzigkeit selig mache.</P>

          <P>F&uuml;nfundzwanzigstens. Aus diesem allem ist
          leichtlich zu verstehen, wie gute Werke zu verwerfen und
          nicht zu verwerfen sind, und wie man alle Lehren verstehn
          soll, die gute Werke lehren. Denn wo der falsche Anhang
          und die verkehrte Meinung drin ist, da&szlig; durch die
          Werke wir fromm und selig werden wollen, sind sie schon
          nicht gut und ganz verdammlich, denn sie sind nicht frei
          und schm&auml;hen die Gnade Gottes, die allein durch den
          Glauben fromm und selig macht, welches die Werke nicht
          verm&ouml;gen; und sie nehmen es sich doch vor, zu tun
          und greifen damit der Gnade in ihr Werk und ihre Ehre.
          Darum verwerfen wir die guten Werke nicht um ihrer selbst
          willen, sondern um desselben b&ouml;sen Zusatzes und
          falscher, verkehrter Meinung willen, welche macht,
          da&szlig; sie nur gut scheinen, und sind doch nicht gut;
          sie betr&uuml;gen sich und jedermann damit gleich wie die
          rei&szlig;enden W&ouml;lfe in Schafskleidern. Aber
          derselbe b&ouml;se Zusatz und die verkehrte Meinung in
          den Werken ist un&uuml;berwindlich, wo der Glaube nicht
          ist. Er mu&szlig; sein in demselben Werkheiligen, bis der
          Glaube kommt und zerst&ouml;re ihn; die Natur vermag ihn
          von sich selbst nicht auszutreiben, ja, auch nicht zu
          erkennen, sondern sie h&auml;lt ihn f&uuml;r ein
          k&ouml;stlich selig Ding, drum werden ihrer auch so viel
          dadurch verf&uuml;hret.Derhalben, obwohl es gut ist, von
          Reue, Beichte, Genugtuung zu schreiben und zu predigen,
          sind es gewi&szlig;lich, so man nicht weiter f&auml;hret
          bis zum Glauben, eitel teuflische, verf&uuml;hrerische
          Lehren. Man mu&szlig; nicht einerlei allein predigen,
          sondern alle beide, das Wort Gottes und die Gebote, soll
          man predigen, die S&uuml;nder zu erschrecken und ihre
          S&uuml;nde zu offenbaren, da&szlig; sie Reue haben und
          sich bekehren. Aber da soll es nicht bleiben, man
          mu&szlig; das andere Wort, die Zusagung der Gnaden auch
          predigen, um den Glauben zu lehren, ohne welchen die
          Gebote, Reue und alles andere vergebens geschieht. Es
          sind wohl noch geblieben Prediger, welche Reue der
          S&uuml;nde und Gnade predigen, aber sie heben die Gebote
          und Zusagung Gottes nicht heraus, da&szlig; man lerne,
          woher und wie die Reue und Gnade komme. Denn die Reue
          flie&szlig;t aus den Geboten, der Glaube aus den
          Zusagungen Gottes, und also wird der Mensch durch den
          Glauben g&ouml;ttlicher Worte gerechtfertiget und
          erhoben, der durch die Furcht vor dem Gebote Gottes
          gedem&uuml;tiget und in seine Erkenntnis gekommen
          ist.</P>

          <P>Sechsundzwanzigstens. Das sei von den Werken gesagt
          insgemein und von denen, die ein Christenmensch gegen
          seinen eigenen Leibe &uuml;ben soll. Nun wollen wir von
          mehr Werken sagen, die er gegen andere Menschen tut. Denn
          der Mensch lebt nicht allein, in seinem Leibe, sondern
          auch unter andern Menschen auf Erden. Darum kann er nicht
          ohne Werke sein gegen dieselben, er mu&szlig; doch mit
          ihnen zu reden und zu schaffen haben, wiewohl ihm
          derselben Werke keines not ist zur Frommheit und
          Seligkeit. Darum soll seine Meinung in allen Werken frei
          und nur dahin gerichtet sein, da&szlig; er andern Leuten
          damit diene und n&uuml;tze sei, nicht anderes sich
          vorbilde,denn was den andern not ist. Das hei&szlig;t
          denn ein wahrhaftig Christenleben, und da geht der Glaube
          mit Lust und Liebe in's Werk, wie St. Paulus lehret die
          Galater (Gal. 5,6). Auch zu den Philippern (Phil. 2,1
          ff), da er sie gelehrt hatte, wie sie alle Gnade und
          Gen&uuml;ge h&auml;tten durch ihren Glauben in Christo,
          lehret er sie weiter und sagt: &raquo;Ich vermahne euch
          allen Trostes, den ihr in Christo habt, und allen
          Trostes, den ihr habt von unserer Liebe zu euch, und
          aller Gemeinschaft, die ihr habt mit allen geistlichen,
          frommen Christen, ihr wollt mein Herz erfreuen
          vollk&ouml;mmlich, und das damit, da&szlig; ihr hinfort
          wollet eines Sinnes sein, einer gegen den andern Liebe
          erzeigen, einer dem andern dienen, und ein jeglicher Acht
          haben nicht auf sich noch auf das Seine, sondern auf den
          andern und was dem andern not sei.&laquo; Siehe, da hat
          Paulus kl&auml;rlich ein christlich Leben dahingestellet,
          da&szlig; alle Werke sollen gerichtet sein dem
          N&auml;chsten zu gute, dieweil ein jeglicher f&uuml;r
          sich selbst genug hat an seinem Glauben, und alle andern
          Werke und Leben ihm &uuml;brig sind, seinem N&auml;chsten
          damit aus freier Liebe zu dienen. Darzu f&uuml;hret er
          Christum zu einem Exempel an und sagt (Phil. 2,5 ff):
          &raquo;Seid also gesinnet, wie ihr's seht in Christo,
          welcher, obwohl er voll g&ouml;ttlicher Form war, war und
          f&uuml;r sich selber genug hatte und ihm sein Leben,
          Wirken und Leiden nicht not war, da&szlig; er damit fromm
          oder selig w&uuml;rde, dennoch sich alles dessen
          ent&auml;u&szlig;ert hat und geb&auml;rdet wie ein
          Knecht, allerlei getan und gelitten, nichts angesehen
          denn unser Bestes und also, obwohl er frei war, doch um
          unsretwillen ein Knecht geworden.&laquo;</P>

          <P>Siebenundzwanzigstens. Also soll auch ein
          Christenmensch wie Christus, sein Haupt, sich voll und
          satt sich auch begn&uuml;gen lassen anseinem Glauben,
          denselben immer mehren, welcher sein Leben, Frommheit und
          Seligkeit ist, der ihm gibt alles, was Christus und Gott
          hat, wie droben gesagt ist und St. Paulus, Gal 2,20.
          spricht: &raquo;Was ich noch in dem K&ouml;rper lebe, das
          lebe ich in dem Glauben Christi, Gottes Sohn.&laquo; Und
          ob er nun ganz frei ist, soll er sich widerum willig zu
          einem Diener machen, seinem N&auml;chsten zu helfen, mit
          ihm fahren und handeln, wie Gott mit ihm durch Christum
          gehandelt hat, und das alles umsonst, nichts darinnen
          suchen denn g&ouml;ttliches Wohlgefallen und also denken:
          wohlan, mein Gott hat mir unw&uuml;rdigem und verdammtem
          Menschen ohne alle Verdienste rein umsonst und aus eitel
          Barmherzigkeit gegeben durch und in Christo vollen
          Reichtum aller Frommheit und Seligkeit, da&szlig; ich
          hinfort nichts mehr bedarf denn glauben, es sei also.Ei,
          so will ich solchem Vater, der mich mit seinen
          &uuml;berschw&auml;nglichen G&uuml;tern also
          &uuml;bersch&uuml;ttet hat, widerum frei, fr&ouml;hlich
          und umsonst tun, was ihm wohl gef&auml;llet, und gegen
          meinen N&auml;chsten auch werden ein Christ, wie Christus
          mir geworden ist, und mehr tun, denn was ich nur sehe,
          da&szlig; ihm not, n&uuml;tzlich und seliglich sei,
          dieweil ich doch durch meinen Glauben aller Dinge in
          Christo genug habe. - Siehe, also fleu&szlig;et aus dem
          Glauben die Liebe und Lust zu Gott und aus der Liebe ein
          frei, willig, fr&ouml;hlich Leben, dem N&auml;chsten zu
          dienen umsonst. Denn ebenso wie unser N&auml;chster Not
          leidet und unseres &Uuml;brigen bedarf, also haben wir
          vor Gott Not gelitten und seiner Gnaden bedurft. Darum,
          wie und Gott hat durch Christum umsonst geholfen, also
          sollen wir durch den Leib und seine Werke nur immer dem
          N&auml;chsten helfen. Also sehen wir, wie ein hochedles
          Leben sei um ein christlich Leben, das leider nun in
          aller Welt nicht allein darniederliegt, sondern auch
          nicht mehr bekannt ist und gepredigt wird.</P>

          <P>Achtundzwanzigstens. Also lesen wir Luk 2,22 ff,
          da&szlig; die Jungfrau Maria zur Kirche ging nach den
          sechs Wochen und lie&szlig; sich reinigen nach dem Gesetz
          wie alle andern Weiber, w&auml;hrend sie doch nicht
          gleich mit ihnen unrein war, noch schuldig derselben
          Reinigung, ihrer auch nicht bedurfte. Aber sie tat's aus
          freier Liebe, da&szlig; sie die andern Weiber nicht
          verachtete, sondern mit dem Haufen bliebe. Also
          lie&szlig; St. Paulus St. Timotheum beschneiden, nicht
          da&szlig; es not w&auml;re, sondern da&szlig; er den
          schwachgl&auml;ubigen Juden nicht Ursache g&auml;be zu
          b&ouml;sen Gedanken, w&auml;hrend er doch widerum Titum
          nicht wollte lassen beschneiden, da man darauf dringen
          wollte, er m&uuml;&szlig;te beschnitten sein und es
          w&auml;re not zur Seligkeit. Und Christus, Matth. 17,24,
          da von seinen J&uuml;ngern ward der Zinspfennig
          gefordert, disputierte er mit St. Peter, ob nicht
          K&ouml;nigskinder frei (davon) w&auml;ren, Zins zu geben.
          Und als St. Petrus ja sagte, hie&szlig; er ihn doch
          hingehen an das Meer und sprach: &raquo;Auf da&szlig; wir
          sie nicht &auml;rgern, so geh' hin; den ersten Fisch, den
          du f&auml;ngst, den nimm und in seinem Maul wirst du
          finden einen Pfennig, den gib f&uuml;r mich und
          dich.&laquo; Das ist ein fein Exempel zu dieser Lehre, da
          Christus sich und die Seinen freie K&ouml;nigskinder
          nennet, die keines Dings bed&uuml;rfen, und doch sich
          unterwirft williglich, dienet und gibt Zins. Wie viel nun
          das Werk Christo not war und gedient hat zu seiner
          Frommheit oder Seligkeit, so viel sind alle sein andern
          und seiner Christen Werke not zur Seligkeit, es sind eben
          alles freie Dienste zu Willen und Besserung der
          andern.Also sollten auch aller Priester, Kl&ouml;ster und
          Stifter Werke getan sein, da&szlig; ein jeglicher seines
          Standes und Ordens Werk allein darum t&auml;te, den
          andern zu willfahren und seinen Leib zu regieren, den
          anderen Exempel zu geben, auch also zu tun, die auch
          bed&uuml;rfen, ihre Leiber zu zwingen; doch mu&szlig; man
          sich allezeit vorsehen, da&szlig; man sich nicht
          vornehme, dadurch fromm und selig zu werden, welches
          allein des Glaubens Verm&ouml;gen ist. Auf diese Weise
          gebeut auch St. Paulus R&ouml;m. 13,1 ff und Tit. 3,1,
          da&szlig; sie sollen weltlicher Gewalt untertan und beret
          sein, nicht da&szlig; sie dadurch fromm werden sollen,
          sondern da&szlig; sie den anderen und der Obrigkeit frei
          dieneten und ihren Willen t&auml;ten aus Liebe und
          Freiheit. Wer diesen Verstand h&auml;tte, der k&ouml;nnte
          leichtlich sich richten in die unz&auml;hligen Gebote und
          Gesetze des Papstes, der Bisch&ouml;fe, der Kl&ouml;ster,
          der Stifter, der F&uuml;rsten und Herren, die etliche
          tolle Pr&auml;laten also treiben, als w&auml;ren sie not
          zur Seligkeit, und hei&szlig;en es Gebote der Kirche,
          wiewohl unrecht. Denn ein freier Christ spricht also: Ich
          will fasten, beten, dies und das tun, was geboten ist,
          nicht weil ich's bedarf oder dadurch wollte fromm oder
          selig werden, sondern ich will's dem Papst, dem Bischof,
          der Gemeine oder meinem Mitbruder, Herrn zu willen,
          Exempel und Dienst tun und leiden, gleichwie mir Christus
          viel gr&ouml;&szlig;ere Dinge getan und gelitten hat,
          wozu ihm viel weniger not war. Und obschon die Tyrannen
          Unrecht tun, solches zu fordern, so schadet's mir doch
          nicht, dieweil es nicht wider Gott ist.&laquo;</P>

          <P>Neunundzwanzigstens. Hieraus mag ein jeglicher ein
          gewi&szlig; Urteil und Unterscheidung nehmen unter allen
          Werken und Geboten, auch welches blinde, tolle oder
          rechte, verst&auml;ndige Pr&auml;laten sind. Denn wenn
          das Werk nicht dahinaus gerichtet ist, dem andern zu
          dienen oder seinen Willen zu leiden, sofern er nicht
          zwingt, wider Gott zu tun, so ist's nicht ein gut
          christlich Werk. Daher kommt's, da&szlig; ich sorge, es
          seien wenig Stifter, Kirchen, Kl&ouml;ster, Alt&auml;re,
          Messen, Testamente christlich, dazu auch die Fasten und
          Gebet zu etlichen Heiligen sonderlich angetan. Denn ich
          f&uuml;rchte, da&szlig; in dem allesamt ein jeglicher nur
          das Seine sucht, damit seine S&uuml;nde zu
          b&uuml;&szlig;en und selig zu werden, welches alles kommt
          aus Unwissenheit des Glaubens und christlicher Freiheit;
          und etliche blinde Pr&auml;laten die Leute dahin treiben
          und solch Wesen preisen, mit Abla&szlig; schm&uuml;cken
          und den Glauben nimmermehr lehren. Ich rate dir
          aber,willst du etwas stiften, beten, fasten, so tu's
          nicht der Meinung, du wollest dir etwas Gutes tun,
          sondern gib's dahin frei, da&szlig; andere Leute
          desselben genie&szlig;en m&ouml;gen, und tu' es ihnen
          zugute, so bist du ein rechter Christ.Was sollen dir
          deine G&uuml;ter und guten Werke, die dir &uuml;brig
          sind, deinen Leib zu regieren und zu versorgen, so du
          genug hast am Glauben, darin dir Gott alle Dinge gegeben
          hat?</P>

          <P>Siehe, also m&uuml;ssen Gottes G&uuml;ter
          flie&szlig;enaus einem in den andern, da&szlig; ein
          jeglicher sich seines N&auml;chsten ann&auml;hme, als
          w&auml;re er's selbst. Aus Christo flie&szlig;en sie in
          uns, der sich unser hat angenommen in seinem Leben, als
          w&auml;re er das gewesen, was wir sind. Aus uns sollen
          sie flie&szlig;en, in die, so ihrer bed&uuml;rfen, auch
          so ganz, da&szlig; ich mu&szlig; auch meinen Glauben und
          Gerechtigkeit f&uuml;r meinen N&auml;chsten setzen vor
          Gott, seine S&uuml;nden zu decken, sie auf mich nehmen
          und nicht anders tun, als w&auml;ren sie mein Eigen, eben
          wie Christus uns allen getan hat. Siehe, das ist die
          Natur der Liebe, wo sie wahrhaftig ist. Da ist sie aber
          wahrhaftig, wo der Glaube wahrhaftig ist. Darum gibt der
          heilige Apostel der Liebe zu eigen, 1. Kor. 13,5,
          da&szlig; sie nicht sucht das Ihre, sondern was des
          N&auml;chsten ist.</P>

          <P>Drei&szlig;igstens. Aus dem allem folget der
          Beschlu&szlig;, da&szlig; ein Christenmensch lebt nicht
          in sich selbst, sondern in Christo und seinem
          N&auml;chsten; in Christo durch den Glauben, im
          N&auml;chsten durch die Liebe; durch den Glauben
          f&auml;hret er &uuml;ber sich in Gott, aus Gott
          f&auml;hret er wieder unter sich durch die Liebe, und
          bleibt doch immer in Gott und g&ouml;ttlicher Liebe,
          gleich wie Christus Joh. 1,51 sagt:&raquo;Ihr werdet noch
          sehen den Himmel offen und die Engel auf- und absteigen
          &uuml;ber den Sohn des Menschen.&laquo; Siehe, das ist
          die rechte, geistliche, christliche Freiheit, die das
          Herz frei macht von allen S&uuml;nden, Gesetzen und
          Geboten, welche alle andere Freiheit &uuml;bertrifft wie
          der Himmel die Erde. Gott gebe uns, da&szlig; wir diese
          Freiheit recht verstehen und behalten,<BR>
           Amen.</P>

          <P>Fundst&uuml;ck von<BR>
          Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

