<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Luther Teil 2</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>Martin Luther
          Verteidigungsrede auf dem Reichstag zu
          Worms</B></FONT></H1>

          <P>Allergn&auml;digster Herr und Kaiser!<BR>
           Durchlauchtigste F&uuml;rsten! Gn&auml;digste Herrn!<BR>
           Ich erscheine gehorsam zu dem Zeitpunkt, der mir gestern
          abend bestimmt worden ist, und bitte die
          allergn&auml;digste Majest&auml;t und die
          durchlauchtigsten F&uuml;rsten und Herren um Gottes
          Barmherzigkeit wollen, sie m&ouml;chten meine Sache, die
          hoffe ich, gerecht und wahrhaftig ist, in Gnaden
          anh&ouml;ren. Und wenn ich aus Unkenntnis irgend jemand
          nicht in der richtigen Form anreden oder sonst in
          irgendeiner Weise gegen h&ouml;fischen Brauch und
          Benehmen versto&szlig;en sollte, so bitte ich, mir dies
          freundlich zu verzeihen; denn ich bin nicht bei Hofe,
          sondern im engen m&ouml;nchischen Winkel aufgewachsen und
          kann von mir nur dies sagen, da&szlig; ich bis auf diesen
          Tag mit meinen Lehren und Schriften einzig Gottes Ruhm
          und die redliche Unterweisung der Christen
          einf&auml;ltigen Herzens erstrebt habe.</P>

          <P>Allergn&auml;digster Kaiser, durchlauchtigste
          F&uuml;rsten! Mir waren gestern durch Eure
          allergn&auml;digste Majest&auml;t zwei Fragen vorgelegt
          worden, n&auml;mlich ob ich die genannten, unter meinem
          Namen ver&ouml;ffentlichten B&uuml;cher als meine
          B&uuml;cher anerkennen wollte, und ob ich dabei bleiben
          wollte, sie zu verteidigen, oder bereit sei, sie zu
          widerrufen. Zu dem ersten Punkt habe ich sofort eine
          unverhohlene Antwort gegeben, zu der ich noch stehe und
          in Ewigkeit stehen werde: Es sind meine B&uuml;cher, die
          ich selbst unter meinem Namen ver&ouml;ffentlicht habe,
          vorausgesetzt, da&szlig; die T&uuml;cke meiner Feinde
          oder eine unzeitige Klugheit darin nicht etwa
          nachtr&auml;glich etwas ge&auml;ndert oder
          f&auml;lschlich gestrichen hat. Denn ich erkenne
          schlechterdings nur das an, was allein mein eigen und von
          mir allein geschrieben ist, aber keine weisen Auslegungen
          von anderer Seite. Hinsichtlich der zweiten Frage bitte
          ich aber Euer allergn&auml;digste Majest&auml;t und
          f&uuml;rstliche Gnaden dies beachten zu wollen, da&szlig;
          meine B&uuml;cher nicht alle den gleichen Charakter
          tragen.</P>

          <P>Die erste Gruppe umfa&szlig;t die Schriften, in denen
          ich &uuml;ber den rechten Glauben und rechtes Leben so
          schlicht und evangelisch gehandelt habe, da&szlig; sogar
          meine Gegner zugeben m&uuml;ssen, sie seien
          n&uuml;tzlich, ungef&auml;hrlich und durchaus lesenswert
          f&uuml;r einen Christen. Ja, auch die Bulle erkl&auml;rt
          ihrer wilden Gegnerschaft zum Trotz einige meiner
          B&uuml;cher f&uuml;r unsch&auml;dlich, obschon sie sie
          dann in einem abenteuerlichen Urteil dennoch verdammt.
          Wollte ich also anfangen, diese B&uuml;cher zu widerrufen
          - wohin, frag ich, sollte das f&uuml;hren? Ich w&auml;re
          dann der einzige Sterbliche, der eine Wahrheit verdammte,
          die Freund und Feind gleicherma&szlig;en bekennen, der
          einzige, der sich gegen das einm&uuml;tige Bekenntnis
          aller Welt stellen w&uuml;rde!</P>

          <P>Die zweite Gruppe greift das Papsttum und die Taten
          seiner Anh&auml;nger an, weil ihre Lehren und ihr
          schlechtes Beispiel die ganze Christenheit sowohl
          geistlich wie leiblich verst&ouml;rt hat. Das kann
          niemand leugnen oder &uuml;bersehen wollen. Denn
          jedermann macht die Erfahrung, und die allgemeine
          Unzufriedenheit kann es bezeugen, da&szlig;
          p&auml;pstliche Gesetze und Menschenlehren die Gewissen
          der Gl&auml;ubigen aufs j&auml;mmerlichste verstrickt,
          beschwert und gequ&auml;lt haben, da&szlig; aber die
          unglaubliche Tyrannei auch Hab und Gut verschlungen hat
          und fort und fort auf emp&ouml;rende Weise weiter
          verschlingt, ganz besonders in unserer hochber&uuml;hmten
          deutschen Nation. Und doch sehen sie in ihren Dekreten
          selbst vor, wie Distinctio 9 und 25, quaestio 1 und 9, zu
          lesen steht: P&auml;pstliche Gesetze, die der Lehre des
          Evangeliums und den S&auml;tzen des Evangeliums und den
          S&auml;tzen der Kirchenv&auml;ter widerspr&auml;chen,
          seien f&uuml;r irrig und ung&uuml;ltig anzusehen. Wollte
          ich also diese B&uuml;cher widerrufen, so w&uuml;rde ich
          die Tyrannei damit geradezu kr&auml;ftigen und
          st&uuml;tzen, ich w&uuml;rde dieser Gottlosigkeit
          f&uuml;r ihr Zerst&ouml;rungswerk nicht mehr ein kleines
          Fenster, sondern T&uuml;r und Tor auftun, weiter und
          bequemer, als sie es bisher je vermocht hat. So
          w&uuml;rde mein Widerruf ihrer grenzenlosen, schamlosen
          Bosheit zugute kommen, und ihre Herrschaft w&uuml;rde das
          arme Volk noch unertr&auml;glicher bedr&uuml;cken, und
          nun erst recht gesichert und gegr&uuml;ndet sein, und das
          um so mehr, als man prahlen wird, ich h&auml;tte das auf
          Wunsch Eurer allergn&auml;digsten Majest&auml;t getan und
          des ganzen R&ouml;mischen Reiches. Guter Gott, wie
          w&uuml;rde ich da aller Bosheit und Tyrannei zur Deckung
          dienen!</P>

          <P>Die dritte Gruppe sind die B&uuml;cher, die ich gegen
          einige sozusagen f&uuml;r sich stehende Einzelpersonen
          geschrieben habe, die den Versuch machten, die
          r&ouml;mische Tyrannei zu sch&uuml;tzen und das
          Christentum, wie ich es lehre, zu ersch&uuml;ttern. Ich
          bekenne, da&szlig; ich gegen diese Leute heftiger
          vorgegangen bin, als in Sachen des Glaubens und bei
          meinem Stande schicklich war. Denn ich mache mich nicht
          zu einem Heiligen und trete hier nicht f&uuml;r meinen
          Lebenswandel ein, sondern f&uuml;r die Lehre Christi.
          Trotzdem w&auml;re mein Widerruf auch f&uuml;r diese
          B&uuml;cher nicht statthaft; denn er w&uuml;rde wieder
          die Folge haben, da&szlig; sich die gottlose Tyrannei auf
          mich berufen k&ouml;nnte und das Volk so grausamer
          beherrschen und mi&szlig;handeln w&uuml;rde denn je
          zuvor.</P>

          <P>Aber ich bin ein Mensch und nicht Gott. So kann ich
          meinen Schriften auch nicht anders beistehen, als wie
          mein Herr Christus selbst seiner Lehre beigestanden hat.
          Als ihn Hannas nach seiner Lehre fragte und der Diener
          ihm einen Backenstreich gegeben hatte, sprach er:
          &laquo;Habe ich &uuml;bel geredet, so beweise, da&szlig;
          es b&ouml;se gewesen sei.&raquo; Der Herr selbst, der
          doch wu&szlig;te, da&szlig; er nicht irren k&ouml;nnte,
          hat also nicht verschm&auml;ht, einen Beweis wider seine
          Lehre anzuh&ouml;ren, dazu noch von einem elenden Knecht.
          Wieviel mehr mu&szlig; ich erb&auml;rmlicher Mensch, der
          nur irren kann, da bereit sein, jedes Zeugnis wider meine
          Lehre, das sich vorbringen l&auml;&szlig;t, zu erbitten
          und zu erwarten. Darum bitte ich um der g&ouml;ttlichen
          Barmherzigkeit willen, Eure allergn&auml;digste
          Majest&auml;t, durchlauchtigste f&uuml;rstliche Gnaden
          oder wer es sonst vermag, er sei h&ouml;chsten oder
          niedersten Standes, m&ouml;chte mir Beweise vorlegen,
          mich des Irrtums &uuml;berf&uuml;hren und mich durch das
          Zeugnis der prophetischen oder evangelischen Schriften
          &uuml;berwinden. Ich werde v&ouml;llig bereit sein, jeden
          Irrtum, den man mir nachweisen wird, zu widerrufen, ja,
          werde der erste sein, der meine Schriften ins Feuer
          wirft.</P>

          <P>Es wird hiernach klar sein, da&szlig; ich die
          N&ouml;te und Gefahren, die Unruhe und Zwietracht, die
          sich um meiner Lehre willen in aller Welt erhoben haben,
          und die man mir gestern hier mit Ernst und Nachdruck
          vorgehalten hat, sorgsam genug bedacht und erwogen habe.
          F&uuml;r mich ist es ein denkbar erfreulicher Anblick, zu
          sehen, wie um Gottes Wort Unruhe und Zwietracht entsteht.
          Denn das ist der Lauf, Weg und Erfolg, den Gottes Wort zu
          nehmen pflegt, wie Christus spricht: &laquo;Ich bin nicht
          gekommen, Frieden zu senden, sondern das Schwer; denn ich
          bin gekommen, den Menschen zu erregen wider seinen Vater
          usw.&raquo; Darum m&uuml;ssen wir bedenken, wie Gott
          wunderbar und schrecklich ist in seinen
          Ratschl&uuml;ssen, da&szlig; nicht am Ende das, was wir
          ins Werk setzen, um der Unruhe zu steuern, damit
          anf&auml;ngt, da&szlig; wir Gottes Wort verdammen, und so
          viel mehr einer neuen Sintflut ganz unertr&auml;gliche
          Leiden zustrebt. Wir m&uuml;ssen sagen, da&szlig; die
          Regierung unseres jungen, vortrefflichen Kaisers Karl,
          auf dem n&auml;chst Gott die meisten Hoffnungen ruhen,
          nicht eine unselige, verh&auml;ngnisvolle Wendung nehme.
          Ich k&ouml;nnte es hier mit vielen Beispielen aus der
          Schrift vom Pharao, vom K&ouml;nig Babylons und den
          K&ouml;nigen Israels veranschaulichen, wie sich gerade
          dann am sichersten zugrunde richteten, wenn sie mit
          besonders klugen Pl&auml;nen darauf ausgingen, Ruhe und
          Ordnung in ihren Reichen zu behaupten. Denn er, Gott,
          f&auml;ngt die Schlauen in ihrer Schlauheit und kehret
          die Berge um, ehe sie es inne waren. Darum ist's die
          Furcht Gottes, deren wir bed&uuml;rfen. Ich sage das
          nicht in der Meinung, so hohe H&auml;upter h&auml;tten
          meine Belehrung oder Ermahnung n&ouml;tig, sondern weil
          ich meinem lieben Deutschland den Dienst nicht versagen
          wollte, den ich ihm schuldig bin. Hiermit will ich mich
          Euer allergn&auml;digsten kaiserlichen Majest&auml;t und
          f&uuml;rstlichen Gnaden dem&uuml;tig befohlen und gebeten
          haben, sie wollten sich von meinen eifrigen Widersachern
          nicht ohne Grund gegen mich einnehmen lassen. Ich bin zu
          Ende ...</P>

          <P>Weil denn Eure allergn&auml;digste Majest&auml;t und
          f&uuml;rstlichen Gnaden eine einfache Antwort verlangen,
          will ich sie ohne Spitzfindigkeiten und
          unverf&auml;nglich erteilen, n&auml;mlich so: Wenn ich
          nicht mit Zeugnissen der Schrift oder mit offenbaren
          Vernunftgr&uuml;nden besiegt werde, so bleibe ich von den
          Schriftstellen besiegt, die ich angef&uuml;hrt habe, und
          mein Gewissen bleibt gefangen in Gottes Wort. Denn ich
          glaube weder dem Papst noch den Konzilien allein, weil es
          offenkundig ist, da&szlig; sie &ouml;fters geirrt und
          sich selbst widersprochen haben. Widerrufen kann und will
          ich nichts, weil es weder sicher noch geraten ist, etwas
          gegen sein Gewissen zu tun.<BR>
           Gott helfe mir, Amen.</P>

          <P>Fundst&uuml;ck von<BR>
          Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

