<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Gibt es einen Santa Claus?</TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
  </HEAD>

  <BODY background="st_sc.gif" text="#000000" link="#0000ff" vlink=
  "#ff0000" alink="#ff9900">
  <TABLE border=0 width=100% cellpadding=8 summary=""><TR><TD>
    <H1 align="center"><FONT color="#FF6633" size="+7"><B>Gibt es
    einen Santa Claus?</B></FONT></H1>
    <BR>

    <P><FONT size="4">Bis jetzt ist keine Rentier-Gattung bekannt,
    die fliegen kann.<BR>
     Aber es existieren ca. 300.000 Gattungen lebender Organismen,
    die noch klassifiziert werden m&uuml;ssen.<BR>
     Obwohl die meisten davon Insekten und Bakterien sind,
    schlie&szlig;t das nicht v&ouml;llig aus, da&szlig; es darunter
    fliegende Rentiere gibt, die nur Santa jemals gesehen hat.<BR>
     Auf der Welt gibt es zwei Milliarden Kinder (Personen unter
    18). Da Santa (anscheinend) nicht die muslimischen,
    hinduistischen, j&uuml;dischen und buddistischen Kinder
    betreut, reduziert das sein Arbeitsaufkommen auf 15 % der
    Gesamtzahl. Bleiben, nach Z&auml;hlung der UNO, 378 Millionen
    Kinder.<BR>
     Bei einem (bewu&szlig;t hoch) gesch&auml;tzten Durchschnitt
    von 3,5 Kinder pro Haushalt ergeben sich 91,8 Millionen
    Haushalte. Anzunehmen ist, da&szlig; es zumindest ein "artiges"
    Kind in jedem Haushalt gibt, dem Santa einen Besuch abstatten
    mu&szlig;.<BR>
     Santa hat Heiligabend Dank der verschiedenen Zeitzonen und der
    Erdrotation 31 Stunden Zeit, sofern man annimmt, da&szlig; er
    von Osten nach Westen reist (was logisch erscheint). Dies
    ergibt 822,6 Besuche pro Sekunde. Das bedeutet, da&szlig; Santa
    f&uuml;r jeden christlichen Haushalt mit "artigen" Kindern gut
    1/1000 Sekunde zur Verf&uuml;gung hat, um zu parken, aus dem
    Schlitten zu springen, den Kamin hinabzurutschen, die
    Str&uuml;mpfe zu f&uuml;llen, die verbleibenden Geschenke unter
    dem Tannenbaum zu verteilen, die hingestellten Snacks zu essen,
    den Kamin wieder raufzuklettern, in den Schlitten
    zur&uuml;ckzukommen und sich zum n&auml;chsten Haus
    aufzumachen.<BR>
    <BR>
    </FONT></P>

    <DIV align="center">
      <IMG src="st_SantaClaus.gif" width="400" height="214" alt="SantaClaus">
    </DIV>
    <BR>
    <P><FONT size="4">
    Nimmt man an, da&szlig; jede dieser 91,8 Millionen
    Anlaufstellen gleichm&auml;&szlig;ig &uuml;ber die gesamte Erde
    verteilt sind (was nat&uuml;rlich eine falsche Annahme ist, die
    wir aber f&uuml;r die Zwecke unserer Kalkulation akzeptieren),
    sprechen wir von 1,25 Kilometer pro Haushalt, einer gesamten
    Strecke von 120 Millionen Kilometern, nicht die kurzen Stops
    mitgerechnet, um das zu tun, was jeder von uns mindestens alle
    31 Stunden tun mu&szlig;, plus F&uuml;ttern der Rentiere etc.
    <BR>
    Das bedeutet, da&szlig; sich Santas Schlitten mit 1045
    Kilometern pro Sekunde fortbewegt, 3.000 mal schneller als die
    Schallgeschwindigkeit. <BR>
    Zum Vergleich, das schnellste vom Menschen entwickelte Vehikel
    auf der Erde, die Raumsonde Ulysses, bewegt sich mit knappen 44
    Kilometern pro Sekunde - ein gew&ouml;hnliches Rentier schafft
    maximal 25 Kilometer pro Stunde. <BR>
    Die Packlast des Schlittens stellt ein weiteres interessantes
    Problem dar. <BR>
    Nimmt man an, da&szlig; jedes Kind nicht mehr erh&auml;lt als
    ein Lego-Set von mittlerer Gr&ouml;&szlig;e (900 Gramm),
    tr&auml;gt der Schlitten knapp 340.000 Tonnen, Santa nicht
    eingerechnet, der &uuml;bereinstimmend als &uuml;bergewichtig
    beschrieben wird. Auf dem Land kann jedes gew&ouml;hnliche
    Rentier nicht mehr als 150 Kilogramm ziehen. Sogar wenn man
    einem "fliegenden Rentier" zugesteht, eine zehnmal
    gr&ouml;&szlig;ere Last ziehen zu k&ouml;nnen, ist es uns
    unm&ouml;glich, die Aufgabe mit acht oder sogar neun Tieren zu
    bew&auml;ltigen. <BR>
    Wir brauchen ca. 226.000 Rentiere. Das erh&ouml;ht die
    Gesamtlast - das Gewicht des Schlittens immer noch au&szlig;er
    acht lassend - auf rund 353.000 Tonnen. </FONT></P>
    <BR>

    <DIV align="center">
      <IMG src="st_SantaClaus2.jpg" width="221" height="145" alt="SantaClaus2">
    </DIV>
    <BR>
    <P><FONT size="4">
    Noch einmal zum Vergleich - das ist das Gewicht des
    Luxusdampfers "Queen Elizabeth" mal vier. 353.000 Tonnen, die
    sich mit mehr als 1.000 Kilometern pro Sekunde fortbewegen,
    schaffen einen enormen Luftwiderstand - dabei wird ein Rentier
    auf die gleiche Weise erhitzt wie ein Raumschiff beim
    Wiedereintritt in die Erdatmosph&auml;re. <BR>
    Das f&uuml;hrende Rentier-P&auml;rchen absorbiert 14,3
    Quintillionen Joules an Energie. Pro Sekunde! <BR>
    Jedes Rentier! <BR>
    Um es kurz zu machen: Die beiden werden so gut wie
    augenblicklich in Flammen aufgehen, die Rentiere hinter ihnen
    der Hitze aussetzen und w&auml;hrend ihrer Totenwache,
    ohrenbet&auml;ubende Knaller wie beim Durchbrechen der
    Schallmauer bewirken. Das gesamte Rentier-Gespann wird
    innerhalb einer 4,26 Tausendstel Sekunde verdampft sein. Durch
    die Zentrifugalkr&auml;fte wird Santa unterdessen 17.500 mal
    schwerer als normal. <BR>
    Ein 150 Kilo schwerer Santa (was l&auml;cherlich schlank
    erscheint), w&uuml;rde von einer Kraft von rund 2.600 Tonnen in
    den hinteren Teil des Schlittens gepre&szlig;t. </P>

    <P align="center">Zusammengefa&szlig;t:</P>

    <P align="center"><B>Wenn Santa Claus
    tats&auml;chlich jemals Geschenke am Heiligabend ausgetragen
    hat, ist er jetzt tot.</B></FONT></P>
    <BR>
    <HR>
    <BR>

    <CENTER>
      Diese doch be&auml;ngstigende Geschichte
      stammt aus der Homepage von <A href=
      "http://www.tkboese.de">Thomas + Katja</A><BR>
      <BR>
       In ein winterliches Outfit verpackt von
    </CENTER>
    <BR>
    <BR>
    <HR>

    <CENTER>
      <TABLE border>
        <TR>
          <TH bgcolor="#CCCCCC" align="left">
            <CENTER>
              J&uuml;rgen Sperling
            </CENTER>
          </TH>
        </TR>

        <TR>
          <TH bgcolor="#FFFFCC" align="left">
          sperlingbergen@freenet.de</TH>
        </TR>
      </TABLE>
      </TD></TR></TABLE>
    </CENTER>
  </BODY>
</HTML>

