<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf erz&auml;hlt &uuml;ber Tee</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink=
  "#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Tee
          zum ersten</B></FONT></P>

          <CENTER>
            <IMG src="st_tee01a.jpg" width="500" height="100" alt=
            "logo"><BR>
            <B>www.quarks.de</B> ist die Quelle des folgenden
            Artikels.
          </CENTER>

          <P>&Uuml;berall da, wo Tee getrunken wird, haben sich im
          Laufe der Geschichte eigene Tee-Zeremonien entwickelt:
          vom "komplizierten Weg" - der chinesischen Tee-Zeremonie
          - bis zur einfachen amerikanischen L&ouml;sung: Eistee
          aus der Dose.</P>

          <P><FONT size="+2"><B>Aromatisierte Tees</B></FONT><BR>
          <IMG src="st_tee01b.jpg" width="245" height="175" alt=""
          align="left" hspace="6">Der bekannteste und auch
          &auml;lteste aromatisierte Tee ist der Earl Grey. Die
          Legende besagt, dass ein Earl - namens Charles Grey -
          dieses Tee-Rezept aus China mitgebracht hat. Bis heute
          wird der Earl Grey auf die gleiche Weise hergestellt:
          Schwarzer Tee wird parf&uuml;miert mit dem &Ouml;l aus
          der Schale einer Zitrusfrucht - der Bergamotte. Will man
          einen Earl Grey trinken, der tats&auml;chlich mit echtem
          Bergamotten&ouml;l parf&uuml;miert ist, muss man die
          Inhaltsstoffe auf der Teepackung genau studieren. Dort
          muss "nat&uuml;rliche Aromastoffe" zu lesen sein. Steht
          auf der Packung "k&uuml;nstliche oder naturidentische
          Aromastoffe", dann ist der Tee eben nicht mit
          Bergamotten&ouml;l, sondern mit k&uuml;nstlichen Aromen
          parf&uuml;miert.<BR clear="all">
          </P>

          <P><FONT size="+2"><B>Gr&uuml;ner und schwarzer
          Tee</B></FONT><BR>
          Beide Teesorten kommen von dem selben Teestrauch. Der
          botanische Name der Gattung lautet: Camellia sinensis.
          Der Unterschied zwischen gr&uuml;n und schwarz entsteht
          erst in der Verarbeitung. Schwarzer Tee wird durch die im
          Blatt vorhandenen Enzyme "fermentiert". (Es ist
          allerdings keine echte Fermentation, weil an diesem
          Prozess keine Bakterien beteiligt sind.) Dabei entstehen
          bestimmte fl&uuml;chtige Substanzen, die den schwarzen
          Tee blumig und karamellartig schmecken lassen. Bei
          gr&uuml;nem Tee wird die "Fermentation" durch Hitze
          verhindert; deswegen bleibt das Blatt gr&uuml;n.
          &Uuml;ber 700 fl&uuml;chtige Substanzen wurden in ihm
          bisher gefunden. Ob sie alle f&uuml;r das Aroma
          verantwortlich sind, wissen die Tee-Experten allerdings
          noch nicht. Im Gegensatz zum schwarzen Tee schmeckt
          gr&uuml;ner Tee ein wenig wie Heu und gr&uuml;ne
          Bl&auml;tter.</P>

          <P><FONT size="+2"><B>Herkunft der
          Teesorten</B></FONT><BR>
          Gr&uuml;ne Tees werden haupts&auml;chlich in China und
          Japan produziert und getrunken. Die Teesorten, die in
          Deutschland am h&auml;ufigsten getrunken oder zu
          Mischungen weiterverarbeitet werden, kommen aus Indien
          und Sri Lanka. Der Darjeeling-Tee w&auml;chst in Indien
          am Fu&szlig;e des Himalajas und hat ein zartes, leicht
          s&uuml;&szlig;liches Aroma. Der Assam-Tee kommt aus dem
          Nordosten Indiens: Es ist ein kr&auml;ftiger und malziger
          Tee, der den Hauptbestandteil der Ostfriesenmischung
          ausmacht. Ceylon-Tee aus Sri Lanka schmeckt frisch und
          spritzig.</P>

          <P><FONT size="+2"><B>Die Sortierung</B></FONT><BR>
          Bevor der Tee in den Verkauf gelangt, wird er sortiert.
          Und zwar nach Blattgr&ouml;&szlig;en: Blatt-Tee,
          Broken-Tee, Fannings und Dust. Fannings und Dust sind die
          kleinsten Aussiebungen, die dann im Teebeutel landen.
          Teebeutel-Tee muss nicht grunds&auml;tzlich schlechter
          sein als Blatt-Tee. Allerdings werden die Inhaltsstoffe
          aus den kleinen Blattst&uuml;ckchen viel schneller
          herausgel&ouml;st als aus Blatt-Tee. Deswegen wird er so
          schnell kr&auml;ftig und bitter. Das kann das Aroma
          &uuml;berdecken, das von den &auml;therischen &Ouml;len
          gebildet wird.</P>

          <P>Trotzdem: Die Blattgr&ouml;&szlig;en sagen
          zun&auml;chst nichts &uuml;ber die Qualit&auml;t eines
          Tees aus. Auch die verschiedenen Bezeichnungen auf der
          Verpackung - wie zum Beispiel FTGFOP (Finest Tippy Golden
          Flowery Orange Pekoe) - sagen nur etwas &uuml;ber die
          Blattgr&ouml;&szlig;e und die Zusammensetzung des Tees
          aus. Sie bezeichnen weitere Sortierungsschritte und nicht
          die Qualit&auml;t. Die richtet sich n&auml;mlich nach
          Klima, Lage und Verarbeitung des Tees.</P>

          <P><FONT size="+2"><B>Drei- oder f&uuml;nf
          Minuten?</B></FONT><BR>
           "Anregend drei Minuten, beruhigend f&uuml;nf Minuten",
          hei&szlig;t es oft. Als Grund daf&uuml;r wird angegeben,
          das Coffein l&ouml;se sich schnell aus den Bl&auml;ttern
          - die Gerbstoffe dagegen nur langsam. Zieht ein Tee nur
          drei Minuten, so ist ein Gro&szlig;teil des Coffeins
          schon im Getr&auml;nk gel&ouml;st; jedoch sind in dieser
          kurzen Zeit erst wenig Gerbstoffe im Tee. Bei einem
          F&uuml;nf-Minuten-Tee ist noch mehr Coffein gel&ouml;st -
          vor allem aber enth&auml;lt der Tee viel mehr Gerbstoffe.
          Weitverbreitet ist die Annahme, dass die Gerbstoffe
          zun&auml;chst einen Teil von dem Coffein binden und dann
          erst langsam im K&ouml;rper wieder freigeben. Ob das
          wirklich so ist, dar&uuml;ber streiten sich die Experten.
          Fest steht allerdings, dass die Formel: "Anregend drei
          Minuten, beruhigend f&uuml;nf Minuten", nicht stimmt. Ein
          F&uuml;nf-Minuten-Tee kann nicht beruhigen, sondern
          h&ouml;chstens nicht in dem gleichen Ma&szlig;e anregen
          wie ein Drei-Minuten-Tee. Denn Coffein ist auf jeden Fall
          im Tee und das macht auf keinen Fall m&uuml;de - im
          Gegenteil. Die Gerbstoffe eines F&uuml;nf-Minuten-Tees
          wirken allerdings leicht antibakteriell, beruhigen also
          im weitesten Sinne den Magen- und Darmtrakt.</P>

          <H1 align="center"><B>Von der Pflanze in die
          Tasse</B></H1>

          <P><FONT size="+2"><B>Was ist drin in der
          Ostfriesenmischung?</B></FONT><BR>
          <IMG src="st_tee01c.jpg" width="115" height="86" alt=""
          align="left" hspace="6"> An kalten Wintertagen eine echte
          Wohltat: Eine Tasse kr&auml;ftiger Ostfriesentee, nur
          original mit Kandiszucker ("Kluntjes" genannt) und Sahne.
          Die Ostfriesenmischung ist in Deutschland eine der
          bekanntesten Teemischungen. Und es waren tats&auml;chlich
          die Ostfriesen, die diese Mischung erfunden haben - kein
          Wunder, bei der oft kalten und ungem&uuml;tlichen
          Witterung im hohen Norden. Aber was ist in dieser
          Mischung genau drin? Wir machen uns auf die Weg, dieses
          Geheimnis zu l&uuml;ften.<BR clear="all">
          </P>

          <P><FONT size="+2"><B>Die Suche f&uuml;hrt zum
          Hersteller</B></FONT><BR>
          <IMG src="st_tee01d.jpg" width="115" height="86" alt=""
          align="left" hspace="6"> Im Paket an der Ladentheke ist
          die Ostfriesenmischung schon fertig gemixt. Nicht einmal
          ein Experte k&ouml;nnte von der Mischung aus der
          T&uuml;te auf deren genaue Inhaltsstoffe und das
          Mischungsverh&auml;ltnis schlie&szlig;en. Wir m&uuml;ssen
          also den Teehersteller aufsuchen, um das Geheimnis des
          Ostfriesentees weiter zu entschl&uuml;sseln.<BR clear=
          "all">
          </P>

          <P><FONT size="+2"><B>Ein R&auml;tsel: Die
          Mischung</B></FONT><BR>
          <IMG src="st_tee01e.jpg" width="115" height="86" alt=""
          align="left" hspace="6"> Als erstes schauen wir uns die
          Abf&uuml;llmaschinen an; aber auch hier erfahren wir
          nichts Neues: Nat&uuml;rlich kommt der Tee als fertige
          Mischung in die T&uuml;te. Also m&uuml;ssen wir weiter
          suchen. Vor der Abf&uuml;llung wird der Ostfriesentee in
          riesigen Trommeln und m&auml;chtigen R&uuml;ttelmaschinen
          gemischt. Dazu werden die unterschiedlichen Teesorten aus
          verschiedenen Alucontainern in die Trommeln
          gesch&uuml;ttet.<BR clear="all">
          </P>

          <P><FONT size="+2"><B>Erste Gewissheit:
          DieTees&auml;cke</B></FONT><BR>
          <IMG src="st_tee01f.jpg" width="115" height="86" alt=""
          align="left" hspace="6"> Aber wo kommt der Tee her, der
          sich in den Containern befindet? Riesige Tees&auml;cke,
          jeder einzelne mit einem Aufdruck, der Sorte und
          Herkunftsland bezeichnet, bef&uuml;llen die Alucontainer.
          Unsere Ostfriesenmischung kommt also aus Indien, das
          steht jedenfalls auf den Tees&auml;cken. Und
          au&szlig;erdem k&ouml;nnen wir dort lesen: Assam
          (Bundesstaat im Nordosten von Indien der an die
          L&auml;nder Nepa, China, Bhutan, Myanmar und Bangladesh
          grenzt) und Darjeeling Tee (ist eine Stadt im Nordosten
          von Indien, genauer in Westbengalen nahe der Grenze zu
          Nepal im unteren Himalaja). Das sind also die Teesorten,
          aus denen unser Tee gemischt ist. Jetzt m&uuml;ssen wir
          nur noch das Geheimnis des genauen
          Mischungsverh&auml;ltnisses l&uuml;ften.</P>

          <P><FONT size="+2"><B>Der Teeverkoster h&uuml;tet das
          Geheimnis</B></FONT><BR>
          <IMG src="st_tee01g.jpg" width="115" height="86" alt=""
          align="left" hspace="6"> Die ganz genaue Mischung kennt
          der wichtigste Mann des Teeherstellers: der Teeverkoster.
          Er pr&uuml;ft jedes Jahr aufs Neue die aktuellen
          Tee-Ernten. Erst danach legt er fest, welche Mischung in
          die Packung kommt, damit der Tee tats&auml;chlich in der
          erw&uuml;nschten Geschmacksrichtung auf dem Markt
          erscheint. Der Geschmack h&auml;ngt n&auml;mlich nicht
          nur von der Teesorte ab. &Auml;hnlich wie beim Wein
          f&auml;llt auch beim Tee je nach Witterung die
          Erntequalit&auml;t immer ein klein wenig anders aus.
          Deshalb muss auch eine Ostfriesenmischung jedes Jahr
          wieder neu gemixt werden. Immerhin best&auml;tigt uns der
          Teeverkoster: In unserer Ostfriesenmischung ist
          haupts&auml;chlich kr&auml;ftiger Assamtee, veredelt mit
          einer kleinen Portion feinem Darjeeling. Aber dann die
          Entt&auml;uschung: Das genaue Mischungsverh&auml;ltnis
          erfahren wir von ihm nicht: Firmengeheimnis!</P>

          <P><FONT size="+2"><B>Der Weg f&uuml;hrt nach
          Indien</B></FONT><BR>
          <IMG src="st_tee01h.jpg" width="115" height="86" alt=""
          align="left" hspace="6"> Immerhin wissen wir, woher
          unsere Ostfriesenmischung stammt: aus dem Norden Indiens.
          Dort liegen die Flachlandplantagen des kr&auml;ftigen
          Assamtees, der die unverzichtbare Grundlage jeder
          Ostfriesenmischung ist. Im nordindischen Hochland
          hingegen w&auml;chst auf Steilh&auml;ngen der edle
          Darjeeling. Der ist f&uuml;r eine Ostfriesenmischung
          jedoch kein Muss; andere Hersteller mischen dem Assam
          andere Sorten aus Sri Lanka oder Sumatra zu. Deshalb
          schmecken Ostfriesenmischungen unterschiedlicher
          Hersteller auch immer etwas anders.</P>

          <P>Nicht immer muss man eine solche Reise wie wir machen,
          um das Geheimnis einer Ostfriesenmischung zu l&uuml;ften.
          Wenn man Gl&uuml;ck hat, stehen die Ursprungs-Sorten der
          Mischung ganz einfach auf dem Packungsbeutel.</P>

          <H1 align="center"><B>Wunderdroge Gr&uuml;ner
          Tee?</B></H1>

          <P><FONT size="+2"><B>Das Modegetr&auml;nk</B></FONT><BR>
           Der gr&uuml;ne Tee avancierte in den 90er Jahren zum
          Modegetr&auml;nk: Von 1990 bis 1999 stieg sein Verbrauch
          in Deutschland von 85 auf 6.000 Tonnen an. Inzwischen
          gehen die Einfuhrzahlen zwar leicht zur&uuml;ck, doch
          parallel dazu tauchen immer mehr Produkte auf dem Markt
          auf, die mit gr&uuml;nem Tee angereichert sind:
          Apfelsaftschorle, Joghurt und sogar Lakritz. Was sich die
          Hersteller davon versprechen, ist klar: Der Verbraucher
          soll das Produkt f&uuml;r gesund halten - im Zweifel
          f&uuml;r ges&uuml;nder als das der Konkurrenz. Aber ist
          gr&uuml;ner Tee wirklich so gesund? Und ist er
          tats&auml;chlich ges&uuml;nder als sein schwarzer
          Verwandter?</P>

          <P><FONT size="+2"><B>Das
          Wundergetr&auml;nk?</B></FONT><BR>
          </P>

          <P>Seit einigen Jahrzehnten beobachten Wissenschaftler,
          dass Menschen, die Tee trinken, oft ges&uuml;nder sind,
          als Menschen, die Kaffee oder andere Getr&auml;nke
          regelm&auml;&szlig;ig trinken. Sie bekommen seltener
          Herz-Kreislauf-Erkrankungen und einige Krebsarten treffen
          Teetrinker anscheinend seltener als Nicht-Teetrinker. Sie
          haben weniger Karies und die Augenkrankheit Gr&uuml;ner
          Star tritt ebenfalls seltener auf.</P>

          <P>Allerdings sind das lediglich die Ergebnisse von
          wissenschaftlichen Beobachtungen; das hei&szlig;t:
          Feldforscher haben Menschen nach ihren Trink- und
          Lebensgewohnheiten sowie ihren Erkrankungen befragt. Die
          Beobachtungen sind zwar interessant, aber noch keineswegs
          wissenschaftlich bewiesen. Es k&ouml;nnte auch sein, dass
          Teetrinker sowieso ges&uuml;nder leben als
          Nicht-Teetrinker, dass sie weniger rauchen, mehr Sport
          treiben usw.</P>

          <P>Um zu beweisen, dass Tee - und im besonderen
          gr&uuml;ner Tee - gesund macht, muss man das
          fern&ouml;stliche Getr&auml;nk genauer unter die Lupe
          nehmen.</P>

          <P><FONT size="+2"><B>Was ist drin?</B></FONT><BR>
           Welche Inhaltsstoffe hat der gr&uuml;ne Tee denn
          &uuml;berhaupt? In geringen Mengen weist er die Vitamine
          A, B, B2 und B12 auf. Dazu birgt er einige Mineralstoffe
          wie Kalzium, Kalium, Magnesium und Fluorid.
          Au&szlig;erdem sind im gr&uuml;nen Tee einige
          Spurenelemente enthalten wie Kupfer, Nickel, Zink und der
          Muntermacher Coffein. Alles in allem ein gesunder
          Cocktail.<BR>
          <BR>
           Zu den interessantesten Inhaltsstoffen des gr&uuml;nen
          Tees geh&ouml;ren die Flavonoide, eine Untergruppe der
          Polyphenole. Bis zu ein Drittel der Trockenmasse des Tees
          besteht aus Polyphenolen. Innerhalb der Flavonoide gelten
          die Catechine als eine besonders wichtige Stoffgruppe und
          auch Catechine sind im Tee enthalten.</P>

          <P><FONT size="+2"><B>Was sind Flavonoide?</B></FONT><BR>
           Die heilende und gesunderhaltende Wirkung der Flavonoide
          haben die Wissenschaftler erst in den letzten 20 Jahren
          entdeckt, obwohl diese in der Natur sehr weit verbreitet
          sind. In vielen Lebensmitteln sind Catechine und andere
          Flavonoide enthalten, so zum Beispiel in &Auml;pfeln,
          Aprikosen, Trauben, Schokolade und Rotwein. Der Vorteil
          des Tees: Man kann ihn in gro&szlig;en Mengen ohne
          Kalorien und Alkohol zu sich nehmen.</P>

          <P>Es gibt &uuml;ber 1.000 Verbindungen, die zu den
          Flavonoiden z&auml;hlen. Etwa 50-100 davon vermuten
          Experten in den unterschiedlichen Teesorten.</P>

          <P><FONT size="+2"><B>Wie wirken
          Flavonoide?</B></FONT><BR>
           Die wohl wichtigste Eigenschaft der Flavonoide ist ihre
          so genannte antioxidative Wirkung. Sie verhindern, dass
          f&uuml;r Oxidation empfindliche Stoffe durch freie
          Radikale zerst&ouml;rt werden. Flavonoide sch&uuml;tzen
          diese Stoffe, indem sie die freien Radikale abfangen.<BR>
          <BR>
           Jedes einzelne Flavonoid hat eine andere Wirksamkeit.
          Deshalb unterscheiden sich die einzelnen Teesorten je
          nach Flavonoidmuster auch in ihrer potentiellen
          Wirksamkeit.</P>

          <P>Im K&ouml;rper k&ouml;nnten die Flavonoide an mehreren
          Stellen helfen: Zum Beispiel k&ouml;nnten sie die
          f&uuml;r die Gef&auml;&szlig;e so gef&auml;hrliche
          Oxidation einiger Lipoproteine verhindern. Wenn sie durch
          Radikale oxidiert werden, f&uuml;hrt das am Ende zur
          Verengung oder gar Verstopfung der Gef&auml;&szlig;e.</P>

          <P>Auch Krebs entsteht zum Teil durch unkontrollierte
          Oxidation, z. B. des Erbgutes.</P>

          <P>Ist also die antioxidative "Kraft" der Flavonoide der
          Schl&uuml;ssel f&uuml;r die Gesundheit der
          Teetrinker?</P>

          <P><FONT size="+2"><B>Flavonoide im
          Menschen</B></FONT><BR>
           Bis heute gibt es jedoch keinen Beweis daf&uuml;r, dass
          die Flavonoide aus gr&uuml;nem Tee &uuml;berhaupt ins
          Blut &uuml;bergehen. Die Hinweise auf eine Heilwirkung
          stammen fast alle aus Reagenzglas-, Zellkultur- oder
          Tierversuchen - Versuche dazu mit Menschen gibt es
          bislang nicht. Und nicht selten wurden bei den Versuchen
          unnat&uuml;rlich gro&szlig;e Flavonoidmengen
          eingesetzt.</P>

          <P>Eine kleine Studie aus Jena zeigt das Dilemma:
          Probanden haben einen halben Liter normal
          aufgebr&uuml;hten gr&uuml;nen Tee getrunken und mussten
          in regelm&auml;&szlig;igen Abst&auml;nden Blut- und
          Urinproben abgeben. Das Ergebnis: Im Urin fanden die
          Jenaer Forscher die antioxidative Wirkung der Flavonoide
          wieder. Im Blut hingegen nicht. Was geschieht also mit
          den Polyphenolen im menschlichen K&ouml;rper? Wie und wo
          werden sie aufgenommen? Wie werden sie ver&auml;ndert?
          Wie abgebaut? All diese Fragen sind noch offen und die
          heilende Wirkung von schwarzem und gr&uuml;nem Tee ist
          weiterhin nicht bewiesen.</P>

          <P><FONT size="+2"><B>Ist Schwarzer Tee
          schlechter?</B></FONT><BR>
           Immer mehr Experten gehen davon aus, dass der schwarze
          Tee &auml;hnliche Eigenschaften hat wie der gr&uuml;ne.
          Auch in ihm sind antioxidativ wirkende Flavonoide
          enthalten, allerdings andere als im gr&uuml;nen Tee. Das
          liegt an der Fermentation: Durch sie verbinden sich
          einige Flavonoide miteinander. Erst im K&ouml;rper werden
          diese Verbindungen zum Teil wieder gel&ouml;st, so dass
          letztlich mit dem schwarzen Tee die gleichen Flavonoide
          wie mit gr&uuml;nem Tee in unsere K&ouml;rper
          gelangen.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf
          Zimmer</B></FONT> </TD>

          <TD>E-Mail: <FONT color=
          "#0000ff"><B>wolf@wozim.de</B></FONT> </TD>

          <TD>Homepage: <FONT color=
          "#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

