<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf erz&auml;hlt noch etwas &uuml;ber Tee</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink=
  "#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Tee
          zum zweiten</B></FONT></P>

          <H2 align="center"><B>Gr&uuml;ner Tee - der &auml;lteste
          Tee der Welt</B></H2>

          <P><IMG src="st_tee02a.jpg" width="170" height="272" alt=
          "" align="left" hspace="6">Gr&uuml;ner Tee ist der
          &auml;lteste Tee der Welt. Doch die westliche Welt
          entdeckt erst jetzt seine Vorz&uuml;ge. Von 1990 bis 1997
          hat sich der Konsum des frischen Aufgusses in Deutschland
          verzehnfacht. Mit seinen wertvollen Inhaltsstoffen passt
          er hervorragend zum gestiegenen Bewusstsein f&uuml;r
          gesunde Ern&auml;hrung. Daneben er&ouml;ffnet der
          gr&uuml;ne Klassiker f&uuml;r Genie&szlig;er ein
          spannendes und fast unergr&uuml;ndliches Entdeckungsfeld.
          Gr&uuml;ner Tee - das ist Aroma und Abwechslung ohne
          Ende, denn kaum ein anderes Getr&auml;nk bietet eine
          solche Sortenvielfalt.</P>

          <P>In China hat der gr&uuml;ne Aufguss eine fast 5000
          Jahre alte Tradition. In dieser langen Zeit hat man sich
          hier mit den gr&uuml;nen Bl&auml;ttern vieles einfallen
          lassen, mit den Teeherstellungsarten experimentiert.
          Hunderte von Sorten und einzigartigen
          Teespezialit&auml;ten kamen dabei heraus. Die
          Aromavielfalt des chinesischen Gr&uuml;ntees reicht von
          blumig-edel bis herb-verwegen. Es gibt bis heute niemand,
          der einen vollst&auml;ndigen &Uuml;berblick &uuml;ber die
          unermessliche Sortenf&uuml;lle hat. Auch Japan und
          Formosa steuern noch gut ein Dutzend
          Gr&uuml;nteeklassiker und Rarit&auml;ten bei. Mit der
          Vielseitigkeit des gr&uuml;nen Tees kann ansonsten nur
          noch Wein mithalten.</P>

          <P>Dass gr&uuml;ner Tee bitter schmeckt, ist ein
          Vorurteil, das noch aus den Zeiten stammt, als in
          Deutschland nur ein oder zwei Gr&uuml;nteesorten in den
          Regalen der Teel&auml;den verstaubten. Jetzt warten neue,
          frische Sorten auf den Teeliebhaber. Nebenbrei spendet
          der gr&uuml;ne Aufguss auch noch W&auml;rme und
          Behaglichkeit und entfaltet mit jedem Schluck seine
          sanfte Heilwirkung. Da er Bakterien, Viren und einige
          andere Krankheitserreger bek&auml;mpft, kann man mit ihm
          auch viele Beschwerden genussvoll kurieren.</P>

          <P>Dies war in blumigen Worten eine Kurzfassung. Wer sich
          nun f&uuml;r weitere Details interessiert, darf ruhig
          weiterlesen. Und wie w&uuml;rde ein dickes Buch
          beginnen?</P>

          <P>Am Anfang war der gr&uuml;ne Tee. Der schwarze
          entstand aus dem gr&uuml;nen. Er war das Ergebnis von
          vielen chinesischen Experimenten mit der Teeverarbeitung.
          Nach einer Legende soll der chinesische Kaiser Chen Nung
          den gr&uuml;nen Aufguss bereits 2737 Jahre vor Christus
          entdeckt haben, als ein Blatt von einem wildwachsenden
          Teestrauch in eine Schale mit hei&szlig;em Wasser
          fiel.</P>

          <P>Zuerst war gr&uuml;ner Tee ausschlie&szlig;lich
          Heilmittel. Die Chinesen kurierten damit Kopfschmerzen,
          M&uuml;digkeit, Rheuma, Konzentrations- und leichte
          Sehschw&auml;chen. Es dauerte ein paar Jahrhunderte, bis
          man zum gem&uuml;tlichen Teil des Tees &uuml;berging und
          ihn als Genussmittel entdeckte. Die ersten bescheidenen
          Vorformen der Teestunde gab es zu Zeiten des gro&szlig;en
          Gelehrten Laotse, also 400 Jahre vor Christi Geburt.
          Damals war es in einigen Gegenden &uuml;blich,
          G&auml;sten Tee anzubieten. Bis ganz China diese Sitte
          &uuml;bernahm, vergingen noch einmal 1000 Jahre. In der
          Tang-Dynastie (618-906) bl&uuml;hten die K&uuml;nste, die
          Sitten verfeinerten sich und das Teetrinken wurde Teil
          der Alltagskultur. In dieser Periode erscheint auch das
          erste Buch &uuml;ber Tee. In seinem "Ch'a-King", "Der
          Heiligen Schrift vom Tee", trug der Schriftsteller Luh
          Y&uuml; (728-804) alles &uuml;ber Geschichte, Botanik,
          Anbau, Herstellung, Heilwirkung und Zubereitung des
          Bl&auml;ttertrankes zusammen. Luh Y&uuml; gilt heute noch
          als Schutzpatron des Tees, sein Werk entwickelte sich zu
          einem Klassiker und wurde gut 1100 Jahre nach der ersten
          Publikation sogar noch ins Englische &uuml;bersetzt.</P>

          <P>Als der Tee immer popul&auml;rer wurde, entdeckte ihn
          die chinesische Regierung als Einnahmequelle und erhob
          Ende des 9.Jahrhunderts die erste Teesteuer.</P>

          <P>Gr&uuml;ner Tee - das sind nach unserer Erfahrung
          getrocknete lose Bl&auml;tter. Doch das war nicht immer
          so. Das Erscheinungsbild des Tees sowie seine
          Herstellungs- und Zubereitungsart haben sich im Laufe der
          Jahrhunderte immer ver&auml;ndert. In der Tang-Zeit
          (618-906) wurden die ged&auml;mpften Bl&auml;tter in
          einem M&ouml;rser zersto&szlig;en und zu Ziegeln
          gepresst. Mit einer Reibe schabte man ein St&uuml;ck von
          diesem gro&szlig;en Riegel ab und kochte es h&auml;ufig
          mit verschiedenen Beigaben wie Ingwer und Orangenschalen.
          Oft wurde Salz in den Tee gegeben. Luh Y&uuml; lehnte
          sp&auml;ter in seiner "Heiligen Schrift vom Tee" jegliche
          Beigaben ab. Der pure, oft bittere Gr&uuml;nteegeschmack
          war pl&ouml;tzlich gefragt und wurde zu einem Symbol
          f&uuml;r das Einfache und Ma&szlig;volle. Wan Yu Cheng
          meinte, dass ihn die zarte Bitterkeit des Tees an nden
          Nachgeschmack eines guten Rates erinnere. In der
          Sung-Dynastie (960-1279) kam der Pulvertee auf. Die
          Bl&auml;tter wurden in einer Steinm&uuml;hle zerrieben
          und das gewonnene Pulver mit einem Bambusbesen in einer
          Teeschale mit hei&szlig;em Wasser aufgesch&auml;umt, so
          wie es in der japanischen Teezeremonie heute noch
          &uuml;blich ist. Erst w&auml;hrend der Ming-Dynastie
          (1368-1644) wurden die getrockneten Teebl&auml;tter mit
          kochendem Wasser &uuml;bergossen, so wie wir es heute
          noch kennen. "Der Grund, weshalb der westlichen Welt die
          &auml;ltere Art des Teetrinkens unbekannt geblieben ist,
          liegt darin, dass Europa den Tee erst am Ende der
          Ming-Dynastie kennenlernte," schreibt Okakuro Kakuzo in
          seinem "Buch vom Tee", Und er hat Recht. Denn den ersten
          gr&uuml;nen Tee brachten die Holl&auml;nder erst um 1610
          nach Europa.</P>
          <HR>
          Der vorgegangene Text ist der Anfang des Buches
          "Gr&uuml;ner Tee" von Cornelia Teufl, erschienen im
          Falken-Verlag und kostete DM 14,90.
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf
          Zimmer</B></FONT> </TD>

          <TD>E-Mail: <FONT color=
          "#0000ff"><B>wolf@wozim.de</B></FONT> </TD>

          <TD>Homepage: <FONT color=
          "#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

