<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Wei&szlig;e Weihnachten</TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
  </HEAD>

  <BODY background="st_sc.gif" text="#000000" link="#0000ff" vlink=
  "#ff0000" alink="#ff9900">
    <TABLE width="98%" align="center" border="0" cellspacing="0"
    cellpadding="8">
      <TR>
        <TD>
          <H1 align="center">Wei&szlig;e Weihnachten</H1>

          <P>Es hat angefangen zu schneien, der erste Schnee in
          diesem Jahr.<BR>
          Meine Frau und ich haben unsere Cocktails genommen und
          stundenlang am Fenster gesessen und zugesehen wie
          riesige, wei&szlig;e Flocken vom Himmel herunter
          schweben. Es sah aus wie im M&auml;rchen. Wie romantisch.
          Wir f&uuml;hlten uns wie frisch verheirat.<BR>
          <BR>
           <B>8. Dezember</B><BR>
           Wei&szlig;e Weihnacht. Als wir wach wurden, hatte eine
          riesige, wundersch&ouml;ne Decke aus wei&szlig;em Schnee
          jeden Zentimeter der Landschaft zugedeckt. Was f&uuml;r
          ein phantastischer Anblick!<BR>
          Kann es einen sch&ouml;neren Platz auf der Welt
          geben?</P>

          <P><IMG src="st_chalet.jpg" width="207" height="263"
          border="0" hspace="6" vspace="0" align="left"> Hierher zu
          ziehen war die beste Idee, die ich je in meinem Leben
          hatte. Habe zum ersten mal Schnee geschaufelt und
          f&uuml;hle mich wieder wie ein kleiner Junge. Habe die
          Einfahrt und den B&uuml;rgersteig freigeschaufelt. Heute
          nachmittag kam der Schneepflug vorbei und hat den
          B&uuml;rgersteig und die Einfahrt wieder zugeschoben,
          also holte ich die Schaufel wieder raus. Was f&uuml;r ein
          tolles Leben!<BR>
          <BR>
          <B>12. Dezember</B><BR>
          Die Sonne hat unseren ganzen sch&ouml;nen Schnee
          geschmolzen. Was f&uuml;r eine Entt&auml;uschung. Mein
          Nachbar sagt, dass ich mir keine Sorgen machen soll, wir
          werden definitiv eine wei&szlig;e Weihnacht haben. Kein
          Schnee zu Weihnachten w&auml;re schrecklich!<BR>
          Bob sagt, dass wir bis zum Jahresende so viel Schnee
          haben werden, dass ich nie wieder Schnee sehen will. Ich
          glaube nicht, dass das m&ouml;glich ist. Bob ist sehr
          nett und ich bin froh, dass er unser Nachbar ist.<BR>
          <BR>
          <B>14. Dezember</B><BR>
          Schnee, wundervoller Schnee!<BR>
          30cm letzte Nacht. Die Temperatur ist auf 20 Grad
          gesunken. Die K&auml;lte l&auml;sst alles glitzern. Der
          Wind nahm mir den Atem, aber ich habe mich beim Schaufeln
          aufgew&auml;rmt.<BR>
          Das ist das Leben!<BR>
          Der Schneepflug kam heute nachmittag zur&uuml;ck und hat
          wieder alles zugeschoben. Mir war nicht klar, dass ich
          soviel w&uuml;rde schaufeln m&uuml;ssen, aber so komme
          ich wieder in Form. W&uuml;nschte ich w&uuml;rde nicht so
          pusten beim Schaufeln.<BR>
          <BR>
          <B>15. Dezember</B><BR>
          60cm Vorhersage. Habe meinen Kombi verscheuert und einen
          Gel&auml;ndewagen gekauft. Und Winterreifen f&uuml;r das
          Auto meiner Frau und zwei extra Schaufeln. Habe den
          K&uuml;hlschrank aufgef&uuml;llt. Meine Frau will einen
          Holzofen, falls der Strom ausf&auml;llt. Das ist
          l&auml;cherlich, schlie&szlig;lich sind wir nicht in
          Alaska.<BR>
          <BR>
          <B>16. Dezember</B><BR>
          Eissturm heute Morgen.<BR>
          Bin in der Einfahrt auf den Arsch gefallen, als ich Salz
          streuen wollte. Tut h&ouml;llisch weh. Meine Frau hat
          eine Stunde lang gelacht. Das finde ich ziemlich
          grausam.<BR>
          <BR>
          <B>17. Dezember</B><BR>
          Immer noch weit unter Null. Die Strassen sind zu vereist,
          um irgendwohin zu kommen. Der Strom war 5 Stunden weg.
          Musste mich in Decken wickeln, um nicht zu erfrieren.
          Kein Fernseher. Nichts zu tun als meine Frau anzustarren
          und zu versuchen sie zu irritieren. Glaube wir
          h&auml;tten einen Holzofen kaufen sollen, w&uuml;rde das
          aber nie zugeben. Ich hasse es, wenn sie recht hat! Ich
          hasse es in meinem eigenen Wohnzimmer zu erfrieren!<BR>
          <BR>
          <B>20. Dezember</B><BR>
          Der Strom ist wieder da, aber noch mal 40cm von dem
          verdammten wei&szlig;en Zeug letzte Nacht!<BR>
          Noch mehr schaufeln. Hat den ganzen Tag gedauert. Der
          beschissene Schneepflug kam zweimal vorbei. Habe versucht
          eines der Nachbarskinder zum Schaufeln zu&uuml;berreden.
          Aber die sagen, sie h&auml;tten keine Zeit, weil sie
          Hockey spielen m&uuml;ssen. Ich glaube, dass die
          l&uuml;gen.<BR>
          Wollte eine Schneefr&auml;se im Baumarkt kaufen. Die
          hatten keine mehr. Kriegen erst im M&auml;rz wieder
          welche rein. Ich glaube, dass die l&uuml;gen. Bob sagt,
          dass ich schaufeln muss oder die Stadt macht es und
          schickt mir die Rechnung. Ich glaube, dass er
          l&uuml;gt.<BR>
          <BR>
          <B>22. Dezember</B><BR>
           Bob hat recht mit wei&szlig;er Weihnacht, weil heut
          Nacht noch mal 30cm von dem wei&szlig;en Zeug gefallen
          ist und es ist so kalt, dass es bis August nicht
          schmelzen wird. Es hat 45 Minuten gedauert, bis ich
          fertig angezogen war zum Schaufeln und dann musste ich
          pinkeln. Als ich mich schlie&szlig;lich ausgezogen,
          gepinkelt und wieder angezogen hatte, war ich zu
          m&uuml;de zum Schaufeln. Habe versucht f&uuml;r den Rest
          des Winters Bob anzuheuern, der eine Schneefr&auml;se an
          seinem Lastwagen hat, aber er sagt, dass er zu viel zu
          tun hat. Ich glaube dass der Bl&ouml;dmann l&uuml;gt!<BR>
          <B>23. Dezember</B><BR>
          <BR>
          Nur 10cm Schnee heute.<BR>
          Und es hat sich auf Null Grad erw&auml;rmt. Meine Frau
          wollte, dass ich heut das Haus dekoriere. Ist die
          bekloppt? Ich habe keine Zeit, ich muss SCHAUFELN!!!
          Warum hat sie es mir nicht schon vor einem Monat gesagt?
          Sie sag, sie hat, aber ich glaube, dass sie
          l&uuml;gt.</P>

          <P><IMG src="st_Baum.jpg" width="250" height="320"
          border="0" hspace="6" vspace="0" align="right"> <B>24.
          Dezember</B><BR>
          20 Zentimeter. Der Schnee vom Schneepflug ist so fest
          zusammengeschoben, dass ich die Schaufel abgebrochen
          habe. Dachte ich kriege einen Herzanfall. Falls ich
          jemals den Arsch kriege, der den Schneepflug f&auml;hrt,
          ziehe ich ihn an seinen Haaren durch den Schnee. Ich
          wei&szlig; genau, dass er sich hinter der Ecke versteckt
          und wartet bis ich mit dem Schaufeln fertig bin. Und dann
          kommt er mit 150 km/h die Strasse runtergerast und wirft
          tonnenweise Schnee auf die Stelle, wo ich gerade war.<BR>
          Heute Nacht wollte meine Frau mit mir Weihnachtslieder
          singen und Geschenke auspacken, aber ich hatte keine
          Zeit.<BR>
          Musste nach dem Schneepflug Ausschau halten.<BR>
          <BR>
          <B>25. Dezember</B><BR>
          Frohe Weihnachten. 60 Zentimeter mehr von dem !@*?#
          $.<BR>
          Eingeschneit!!!<BR>
          Der Gedanke an Schneeschaufeln l&auml;sst mein Blut
          kochen. Gott, ich hasse Schnee! Dann kam der
          Schneepflugfahrer vorbei und hat nach einer Spende
          gefragt. Ich habe ihm meine Schaufel &uuml;ber den Kopf
          gezogen. Meine Frau sagt, dass ich schlechte Manieren
          habe. Ich glaube, dass sie eine Idiotin ist. Wenn ich mir
          noch einmal Wolfgang Petry anh&ouml;ren muss, werde ich
          sie umbringen.<BR>
          <BR>
          <B>26. Dezember</B><BR>
          Immer noch eingeschneit.<BR>
          Warum um alles in der Welt sind wir hierher gezogen? Es
          war alles IHRE Idee. Sie geht mir echt auf die
          Nerven.<BR>
          <BR>
          <B>27. Dezember</B><BR>
          Die Temperatur ist auf 30 Grad gefallen und die
          Wasserrohre sind eingefroren.<BR>
          <BR>
          <B>28. Dezember</B><BR>
          Es hat sich auf 5 Grad erw&auml;rmt.<BR>
          Immer noch eingeschneit.<BR>
          DIE ALTE MACHT MICH VERR&Uuml;CKT!!!<BR>
          <BR>
          <B>29. Dezember</B><BR>
          Noch mal 30 Zentimeter.<BR>
          Bob sagt, dass ich das Dach freischaufeln muss, oder es
          wird einst&uuml;rzen. Das ist das D&auml;mlichste was ich
          je geh&ouml;rt habe. F&uuml;r wie bl&ouml;d h&auml;lt der
          mich eigentlich??<BR>
          <BR>
          <B>30. Dezember</B><BR>
          Das Dach ist eingest&uuml;rzt. Der Schneepflugfahrer
          verklagt mich auf 50.000 Euro Schmerzensgeld.<BR>
          Meine Frau ist zu ihrer Mutter gefahren. 25 Zentimeter
          vorhergesagt.<BR>
          <B>31. Dezember</B><BR>
          Habe den Rest vom Haus angesteckt.<BR>
          Nie mehr Schaufeln.<BR>
          <BR>
          <B>8. Januar</B><BR>
          Mir geht es gut. Ich mag die kleinen Pillen, die sie mir
          dauernd geben.<BR>
          Warum bin ich ans Bett gefesselt?<BR>
          <BR>
          <BR>
          </P>
          <HR>
          <BR>
          <BR>
          <BR>

          <CENTER>
            <TABLE border>
              <TR>
                <TH bgcolor="#CCCCCC" align="left">
                  <CENTER>
                    J&uuml;rgen Sperling
                  </CENTER>
                </TH>
              </TR>

              <TR>
                <TH bgcolor="#FFFFCC" align="left">
                sperlingbergen@freenet.de</TH>
              </TR>
            </TABLE>
          </CENTER>
          <BR>
          <BR>
           
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

