<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Yang und Yin</TITLE>
    <!-- author="Gerd Schoettler" -->
  </HEAD>

  <BODY background="nc_bg2.jpg" text="#000000">
    <TABLE width="100%" cellpadding="10" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="green">Yang und Yin</FONT></H1>

          <P>Hallo Leute!</P>

          <P><IMG src="st_yang.gif" width="75" height="75" border= "0" align="right"
          alt="">Ich kann es nicht lassen. Heute m&ouml;chte ich noch einmal etwas
          philosophieren. Gestern habe ich mit Rainer die letzte NoCover gelesen und
          wir haben uns k&ouml;stlich &uuml;ber die herrlichen Frauenwitze
          am&uuml;siert. Danach fuhr ich heim und ich bemerkte, wie mich ein
          seltsames Gef&uuml;hl beschlich. Irgendwie hatten wir so etwas gerade von
          einem Spanier geh&ouml;rt. Er hatte es wie folgt ausgedr&uuml;ckt: Frauen
          sind nur f&uuml;r die K&uuml;che und das Bett gut. Ich &uuml;berlegte nun,
          was denn all diese Aussagen zu bedeuten haben und ich m&ouml;chte hier ganz
          klar hervorheben, dass ich niemanden mit meinen &Uuml;berlegungen
          kritisieren m&ouml;chte, vielmehr m&ouml;chte ich dazu anregen,die Dinge
          einmal unter einem anderen Aspekt zu sehen. Ich habe mich von meinen
          Gef&uuml;hlen leiten lassen, denn ich habe mir abgew&ouml;hnt, diese als
          gut oder schlecht zu bezeichnen. In den 33 Jahren meiner Ehe h&auml;tte ich
          eigentlich viel von meiner Frau lernen k&ouml;nnen, sind doch die Frauen
          anders als wir. Da stellt sich die Frage, ob an diesem Anderssein etwas
          Falsches sein k&ouml;nnte? Es gibt im ganzen Universum nur eine Kraft und
          unser Verstand spaltet diese polar auf und nennt den einen Teil gut und den
          anderen b&ouml;se, anders ausgedr&uuml;ckt: hell und dunkel, m&auml;nnlich
          und weiblich, yang und yin. Nun zeigt uns dieses Yin und Yang-Symbol, dass
          beide Teile zusammengeh&ouml;ren und zusammen das Eine, das Ganze bilden.
          Hier wird sogleich klar, wo der Denkfehler liegt: das Helle soll gar nicht
          wie das Dunkle sein, das M&auml;nnliche nicht so wie das Weibliche, denn
          beide bilden erst durch Erg&auml;nzung das Ganze und das eine kann ohne das
          andere nicht existieren. Wie also kann es sein, dass wir von der Frau
          erwarten, sie m&ouml;ge so denken, f&uuml;hlen und handeln wie wir? Liegt
          nicht gerade die k&ouml;stliche Spannung darin, dass das Weibliche anders
          ist als das M&auml;nnliche? Hier liegt doch das eigentliche Geheimnis des
          gemeinsamen Lebensweges: 2 Wesen, die verschieden f&uuml;hlen, denken und
          handeln versuchen gemeinsam den Lebensweg zu beschreiten und jeder
          k&ouml;nnte dem anderen etwas geben, wenn wir uns nur mehr Zeit f&uuml;r
          die Beziehung lie&szlig;en. In der Erwartung aber, dass der/die andere so
          handeln m&uuml;sste wie ich, liegt schon das Ende der Beziehung
          begr&uuml;ndet. Das Wunder liegt gerade in der Verschiedenheit, sie macht
          eine Beziehung erst zum Abenteuer. Vielleicht liegt das Problem auch darin
          begr&uuml;ndet, dass ich mich selber nicht akzeptieren kann und deshalb dem
          anderen auch nicht die Freiheit zugestehen will, so zu sein, wie er/sie
          eben ist. Es ist ein Wunder, dass jeder Mesnch verschieden ist, es ist ein
          Wunder, dass 2 verschiedene Wesen eine Beziehung aufnehmen und unterhalten
          k&ouml;nnen. Wir k&ouml;nnten das Spiel des Lebens vielmehr genie&szlig;en,
          wenn wir verstehen w&uuml;rden, dass gerade die Verschiedenheit die
          Grundlage des Lebens ist. In dieser Erkenntnis k&ouml;nnten wir
          aufh&ouml;ren, das Andersartige zu verurteilen. Wenn ich nun die Frage
          stelle, ob das M&auml;nnliche oder das Weibliche besser sei, dann
          dr&uuml;cke ich durch diese Haltung aus, dass ich nicht verstanden habe,
          dass beide Teile durch Erg&auml;nzung zur Ganzheit f&uuml;hren. Wie sagt
          doch Laotse: Wer das M&auml;nnliche kennt und doch das Weibliche tut, der
          wird zu einem Kanal f&uuml;r die ganze Welt. Hei&szlig;t das nicht, dass
          wir beide Teile zulassen sollten, wenn wir einen wirklichen Beitrag zur
          Welt leisten wollen? Oder sollte sich der gro&szlig;e Meister etwas geirrt
          haben? </P>

          <P>Euer Gerd.</P>
        </TD>
      </TR>
    </TABLE>
    <BR>

    <TABLE border="5" cellspacing="1" cellpadding="5" align="CENTER" summary="">
      <TR>
        <TD>Gerd Sch&ouml;ttler</TD>
        <TD>E-Mail: <A href="mailto:goischoetttler@terra.es">goischoettler@terra.es</A></TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

