<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Aminet26</title>
</head>
<body background="amin26.gif" text=black link=blue alink=red bgcolor="#FFFFCC"><br>
<font color="#800000" size="7">
<center><b>WILLKOMMEN ZUR AMINET CD 26</b></font></center><br>
<p>
Bei der letzten Aminet CD hatte ich gehofft, auf der jetzt vorliegenden CD wieder
ein tolles Highlight vorzufinden.</p>
<p>
Nun die CD beginnt mit folgender Einleitung:<br>
Diesmal gibt's etwas weniger Neuheiten, da Aminet f&#252;r eine Woche ausfiel,
aber die kommerzielle Software gleicht das aus. Der Inhalt:<br>
920 MB &#160; &#160; neue Software erschienen zwischen CD 25 und dem 1. Juli<br>
&#160; 30 MB &#160; &#160; kommerzielle Software: Xi Paint 4</p>
<p>
F&#252;r die folgenden Datentypen gibt es spezielle Pr&#228;sentationen:
<table border="0" cellpadding="3" cellspacing="3" width="100%">
<tr><td width=150> Spiele </td>
 <td> Eine Liste aller direkt startbaren Spiele </td></tr>
<tr><td> Demos </td>
 <td> Ein Index der besten Demos </td></tr>
<tr><td> Bilder </td>
 <td> Eine Datenbank mit verkleinerten Versionen </td></tr>
<tr><td> Mods </td>
 <td> Eine Liste aller Mods, sortiert nach Stil und Bewertung </td></tr></table>

Weitere Informationen gibt es zu:
<table border="0" cellpadding="3" cellspacing="3" width="100%">
<tr><td width=150> Neuigkeiten </td>
 <td> Was sich seit der letzten CD ge&#228;ndert hat </td></tr>
<tr><td> Zugriffssoftware </td>
 <td> Find, Prefs, und die ganzen anderen Werkzeuge </td></tr>
<tr><td> Pers&#246;nliche CD </td>
 <td> Wie man den Inhalt nach seinem Geschmack arrangiert </td></tr>
<tr><td> Probleml&#246;sungen </td>
 <td> &#220;bliche Probleme mit der CD und ihre L&#246;sungen
<tr><td> Was ist Aminet </td>
 <td> Das gr&#246;sste Amiga-Archiv der Welt
<tr><td> Aminet-Zugang </td>
 <td> Wo kann ich direkt auf Aminet zugreifen?
<tr><td> Beisteuern </td>
 <td> Wie krieg ich meine Software aufs Aminet? Frei-CDs!
<tr><td> Bestellen </td>
 <td> Wo man an Aminet CDs und Aminet Abos kommt
<tr><td> Rechtliches </td>
 <td> Viruswarnung, Sharewarenotiz </td></tr></table>

<p>
N&#228;chster Schritt ist das Lesen der &quot;Lies Mich&quot; im Ordner XiPaint<br><br>
<u>
Sehr geehrter XiPaint-User!</u></p>
<p>
Vielen Dank, da&#223; Sie sich f&#252;r dieses Produkt entschieden haben.
XiPaint 4.0 bietet viele Neuerungen - und es wird immer weiter
entwickelt. Damit Sie zu dem Werkzeug auch die richtige Umgebung
haben, habe ich mich schon bei der Version 3.2 dazu entschlossen,
eine CD herauszubringen.</p>
<p>
Viele werden nun meinen, da&#223; ein Malprogramm gerade am Amiga doch
nie eine CD f&#252;llen kann. Richtig. Es ist aber nicht nur ein
Programm, was XiPaint ausmacht. Es sind eine F&#252;lle von Ein- und
Ausgabemodule, Hilfsmittel und zu guter Letzt Bilder, die die
CD f&#252;llen. Und noch etwas: das Handbuch. Um Ihnen das Produkt
kosteng&#252;nstig anbieten zu k&#246;nnen, wurde die CD ohne Handbuch
auf Papier geliefert.<br>
.<br>
.<br>
.<br>
.</p>
<p>
Richtig, dies ist die Original LiesMich-Datei von der Xi-Paint 4.0 CD, die heute
noch f&#252;r 69,- DM verkauft wird.</p>
<p>
Da bisher in der NoCover noch nie ein Workshop, eine Besprechung in ToolsTheke
oder eine Vorstellung in CD-Theke erschienen ist, werden viele dieses Programm
nur in etwas nebul&#246;ser Vorstellung kennen. Und jetzt den richtigen Anfang zu
finden, ist gar nicht so leicht.</p>
<br><img src="cd_aminet26a.jpg" width=256 height=192 border=0 align=left hspace=10 vspace=10>
<p>
Was ist Xi-Paint ?<br>
Begonnen hat alles damit, da&#223; ein hervorragender AmigaEntwickler einen
Framebuffer mit dem Namen VD2001 auf den Markt brachte. Diese Erweiterung war in
der Lage, Videobilder in Echtzeit zu digitalisieren und mit 24 Bit darzustellen.</p>
<p>
Doch die beste Hardware n&#252;tzt nichts, wenn die zugeh&#246;rige Software fehlt. Aus
diesem Grund beschlossen die Autoren des heutigen Xi-Paint, ein Malprogramm f&#252;r
die VD2001-Erweiterung zu programmieren. Um einen Bezug zum Produktnamen
herzustellen, wurden die ersten beiden Buchstaben &#252;bernommen - somit war VDPaint
geboren.</p>
<p>
In der Zwischenzeit gab es neue Entwicklungen am Amiga-Markt und eine zum
damaligen Zeitpunkt unschlagbar g&#252;nstige 24-BitGrafikkarte schickte sich an,
diesen Markt zu erobern. Doch auch hier suchte man verzweifelt nach einem
Malprogramm, denn eine Grafikkarte ohne Software l&#228;&#223;t sich nur schwer verkaufen.</p>
<p>
Sehr schnell stellte sich heraus, da&#223; Retina und VD-Paint durchaus ein
interessantes Gespann sein k&#246;nnten. Aus diesem Grund einigte man sich &#252;ber eine
entsprechende Umsetzung und Anpassung an die Grafikkarte. Das Ergebnis, immer
noch unter dem Namen VDPaint, wurde der Retina kostenlos beigelegt.</p>
<p>
Im Herbst 1992 wagten die Autoren schlie&#223;lich einen Sprung in unbekannte
Gew&#228;sser. VD-Paint wurde f&#252;r den HAM-Modus des Amiga umgesetzt! Das bedeutete,
da&#223; jeder Amiga-Besitzer, auch ohne Grafikkarte, 24-Bit-Bilder erstellen und
bearbeiten konnte, denn intern arbeitete diese Version weiterhin mit 16,7
Millionen Farben.</p>
<p>
Aus VD-Paint wurde Xi-Paint. Die erste Pr&#228;sentation auf der Messe in K&#246;ln im
Herbst 1993 lie&#223; viele Besucher staunen. Und die endg&#252;ltige Version lag dann im
Sommer 1994 vor. Doch was auch dem einstmals tastaturorientierten VD-Paint
geworden ist, kann sich, ohne &#220;bertreibung, sehen lassen. Xi-Paint stellt heute
mit Sicherheit, auch Plattform&#252;bergreifend, eines der besten und
leistungsf&#228;higsten 24-Bit Malprogramme dar, die am Markt erh&#228;ltlich sind.</p>
<br>
<p>
24 Bit, was ist das?<br>
Ausdr&#252;cke wie &quot;True-Color&quot;, &quot;24 Bit&quot;, &quot;16,8 Millionen Farben&quot; bedeuten &#252;brigens
ein und dasselbe, n&#228;mlich, da&#223; zum Arbeiten am Bildschirm die besagten 16,8
Millionen Farben zur Verf&#252;gung stehen. Diese etwas willk&#252;rlich aussehende Zahl
ergibt sich aufgrund des internen Aufbaus von Computern.</p>
<p>
Ein Computer kennt, wie allgemein bekannt ist, lediglich zwei Zust&#228;nde, n&#228;mlich
&quot;0&quot; und &quot;1&quot; (Strom flie&#223;t/Strom flie&#223;t nicht). Wir bezeichnen dies als 1 Bit.
Ein Bit kann ausschlie&#223;lich zwei Zust&#228;nde annehmen. F&#252;r eine Grafik bedeutet
dies, da&#223; ein Punkt entweder schwarz oder wei&#223; ist. Mit zwei Bit k&#246;nnen bereits
vier verschiedene M&#246;glichkeiten dargestellt werden (00, 01, 10, 11), wodurch
auch ein Bild bereits vier verschiedene Farben enthalten kann.</p>
<p>
Bei der Verwendung von 8 Bit (= 1 Byte) stehen bereits 256 verschiedene Farbt&#246;ne
zur Verf&#252;gung. Das Ergebnis von 256 erh&#228;lt man, indem man die Zahl 2 (die f&#252;r
die beiden Erscheinungsformen eines Bits steht) mit der Anzahl der zur Verf&#252;gung
stehenden Bits potenziert: 2hoch8 = 256 . Mit 16 Bit sind es 65.536 Farben (2hoch16)
und, wie Sie nun wahrscheinlich selbst &#252;berpr&#252;fen k&#246;nnen, mit 24 Bit 16.777.216
also ungef&#228;hr 16,8 Millionen M&#246;glichkeiten.</p>
<p>
Es stellt sich nun die Frage, wie der Computer wei&#223;, welches Aussehen eine
bestimmte Farbe hat. Schlie&#223;lich &quot; wei&#223;&quot; er lediglich die Nummer der zu
verwendenden Farbe. Hierzu kommt die additive Farbmischung zum Einsatz, die auf
den drei Grundfarben Rot, Gr&#252;n und Blau aufbaut. Aus diesem Grund wird diese
Methode auch RGB-Mischung genannt. So ist es m&#246;glich, durch die Kombination von
Rot-, Gr&#252;n- und Blaut&#246;nen jede beliebige Farbe zu erzeugen.</p>
<p>
Bei 24 Bit stehen nun f&#252;r jede der drei Grundfarben 8 Bit zur Verf&#252;gung. Das
hei&#223;t, es k&#246;nnen jeweils 256 Rot-, Gr&#252;n- und Blauabstufungen erzeugt werden,
wobei 0 gleichbedeutend mit &quot;keine Intensit&#228;t&quot; ist und der Wert 255 &quot;volle
Intensit&#228;t&quot; bedeutet. Insgesamt k&#246;nnen also 256*256*256 = 16.777.216
verschiedene Farbt&#246;ne erzeugt werden.</p>
<p>
Diese Farbanzahl hat sich bisher als ausreichend erwiesen, da das menschliche
Auge nicht in der Lage ist, noch feinere Abstufungen wahr zu nehmen. Trotzdem
gibt es einige Sonderf&#228;lle, in denen auch 16,8 Millionen Farben nicht
ausreichen. Das Paradebeispiel, das von Kritikern immer wieder verwendet wird,
ist ein einfacher Farbverlauf.</p>
<p>
Angenommen es soll auf einem Arbeitsblatt, das 800x600 Punkte gro&#223; ist, ein
vertikaler Farbverlauf von Schwarz nach Rot dargestellt werden. Auf den ersten
Blick erscheint dies kein Problem, da ja sowieso &#252;ber 16 Millionen
Farbabstufungen existieren.</p>
<p>
Man darf jedoch nicht vergessen, da&#223; in diesem Fall ausschlie&#223;lich Rott&#246;ne zur
Anwendung gelangen. Wie bereits oben erw&#228;hnt, stehen jedoch nur 256 davon zur
Verf&#252;gung. Das bedeutet, es ist nicht m&#246;glich, allen 600 Zeilen des
Arbeitsblattes eine eigene Farbe zuzuweisen.</p>
<p>
Stattdessen m&#252;ssen gleiche Farben wiederholt werden. Doch stellt eine solche
Situation eine Ausnahme dar und es erscheint derzeit kaum sinnvoll, eine noch
h&#246;here Farbanzahl zu verwenden, da dadurch auch die Rechenzeiten und die
Anforderungen an die Hardware stark zunehmen w&#252;rden.</p>
<p>
Obwohl zur Darstellung der 16,8 Millionen Farben 24 Bit v&#246;llig ausreichen,
verwaltet Xi-Paint die Bilder intern mit 32 Bit. Die &#252;brigen 8 Bit werden als
Alpha-Kanal verwendet und werden von vielen Funktionen ben&#246;tigt. Als Anwender
merkt man zwar, einmal abgesehen vom h&#246;heren Speicherverbrauch, nichts vom
Vorhandensein des Alpha-Kanals. Trotzdem wird er bei der Arbeit laufend
verwendet.</p>
<p>
Um beispielsweise einen Pinsel auszuschneiden und diesen zu maskieren, soda&#223; der
Hintergrund (die Farbe 0) durchsichtig wirkt, wird bereits auf den Alpha-Kanal
zur&#252;ckgegriffen. Schlie&#223;lich mu&#223; der Computer von irgendwoher die Informationen
holen, ob ein gewisser Punkt des Pinsels durchsichtig ist (die Farbe 0 hat) oder
gezeichnet werden soll.</p>
<p>
Es w&#228;re nun nahezu unm&#246;glich, bei jeder Pinselbewegung diese Maskierung erneut
zu berechnen. Stattdessen wird sie einmal durchgef&#252;hrt und die Informationen
werden im Alpha-Buffer abgelegt.</p>
<p>
Dasselbe geschieht auch bei der Maskierung eines ganzes Bildes oder Sperrung
bestimmter Farben. Dar&#252;ber hinaus wird der Alpha-Kanal auch f&#252;r eine ganze Reihe
von Spezialeffekten herangezogen, die ohne ihn nicht m&#246;glich w&#228;ren.</p>
<p>
Die Grundprinzipien, erste Schritte, mit Farben arbeiten, Pinsel erstellen und
verwalten, Arbeiten mit Pinseln, Zyklus und Verlauf in der Praxis,
Spezialeffekte mit Pinseln, mit Schriften gestalten, Masken, Bildkomposition mit
Layern und so weiter. So lauten die Titel der einzelnen Kapitel des Handbuches.
Jetzt hier detailliert darauf einzugehen, ist der falsche Ort.</p>
<p>
<img src="cd_aminet26b.jpg" width=119 height=119 border=0 align=left hspace=10 vspace=10>
Wer also die CD nicht sein Eigen nennt und das Programm von der Aminet-CD
installiert (Deutsch oder Englisch), sollte keinesfalls vergessen, die beiden
Ordner Pics (8 MB) und Manual_D (4,1 MB) nachtr&#228;glich zu kopieren. Sie werden
durch das Install-Script nicht angesprochen. Angesprochen wird aber die eigene
Konfiguration und w&#228;hlt dann entsprechend entweder 68000, 68020+ oder 68040, FPU
ja/nein und Grafikkarte ja/nein aus. Ebenso kann auch gleich der Bildschirmmodus
festgelegt werden. Ansonsten gilt es vor dem ersten Start einige wichtige
Parameter festzulegen, um das Programm auf die Computerkonfiguration anzupassen.
Dazu dient das Programm mit dem Namen &quot;Xi-Prefs&quot;. Dieses erm&#246;glicht, &#228;hnlich wie
die Preferences der Workbench, eine Festlegung der wichtigsten
Grundeinstellungen.</p>
<p>
Eines darf nun nicht vergessen werden. Das Malprogramm ist nun uneingeschr&#228;nkt
nutzbar und braucht nicht mehr &quot;upgedatet&quot; werden. Auf der o.a. CD sind nat&#252;rlich
noch viele Programme (Shareware), Bilder, Animationen, Schriften und und und
enthalten. Schlie&#223;lich sind dies 620 MB Daten, dagegen wurde auf der Festpatte nach
der Installation von der Aminet-CD gerade 17 MB Platz ben&#246;tigt.</p>
<p>
Diese Ausf&#252;hrungen sollten zu dem mitgelieferten Highlight reichen.</p>
<br>
<hr noshade size="1" width="90%">
<p>
Da in letzter Zeit die Inhaltsverzeichnisse der Aminet-CD's in der NoCover nicht
mehr aufgelistet wurden, werde ich diesmal den gesamten Index mitliefern. Diesmal
ist es wirklich nicht leicht, einen Schwerpunkt hervorzuheben. In allen Sparten
sind Neuheiten enthalten.</p>
<p>
In biz/cloan f&#228;llt als erstes auf, dass sowohl die Vollversion von PPaint 6.4 wie auch
eine Demoversion von PPaint 7.1 enthalten ist. Auch wenn der Update Preis immer noch
nicht gesenkt ist, mu&#223; davon ausgegangen werden, dass das neue PPaint kurz vor der
Ver&#246;ffentlichung steht. Neu ist das kostenlose Update von AExplorer auf Version 2.02.
DirDiff 5.1 war schon auf Aminet Set 6 enthalten.</p>
<p>
Vielversprechend und interessant scheint in biz/comm  MiniSQL Database engine zu sein.
SQL ist eine m&#228;chtige Query Sprache, mit der relationale Datenbanken verglichen, ausgewertet
und eventuell neu struktuiert werden k&#246;nnen.</p>
<p>
Wie schon erw&#228;hnt, es ist schwierig, alles zu erw&#228;hnen. So mu&#223; schon jeder in die Sparte
reinschauen, f&#252;r die er sich interessiert. Vielleicht sucht jemand ganz dringend
einen Printspooler. In text/print wird er mit prtman39.lha  Printmanager for AmigaOS3 (39.10)
schon f&#252;ndig.</p>

Diesmal hei&#223;t es, selber suchen macht gl&#252;cklich.<br>
<a name=a1>Rubriken:</a><br><center>
<table border="2" cellpadding="3" cellspacing="3" width="80%">
<tr><td> <a href=amin26a.html#a1> &quot; biz  &quot; </a></td>
<td> Business software </td><td align="right"> 20,7 MB </td><td>&#160;</td></tr>
<tr><td> <a href=amin26a.html#a2> &quot; comm &quot; </a></td>
<td> Communications </td><td align="right"> 21,6 MB </td><td>&#160;</td></tr>
<tr><td> &quot; demo &quot; </td>
<td> Gfx and sound demos </td><td align="right"> 64,4 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=amin26a.html#a3> &quot; dev  &quot; </a></td>
<td> Development software </td><td align="right"> 17,5 MB </td><td>&#160;</td></tr>
<tr><td> <a href=amin26a.html#a4> &quot; disk &quot; </a></td>
<td> Disk/Harddisk tools </td><td align="right">  6,3 MB </td><td>&#160;</td></tr>
<tr><td> <a href=amin26a.html#a5> &quot; docs &quot; </a></td>
<td> Text documents </td><td align="right"> 32,2 MB </td><td>&#160;</td></tr>
<tr><td> &quot; game &quot; </td>
<td> Games </td><td align="right"> 75,7 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=amin26a.html#a6> &quot; gfx  &quot; </a></td>
<td> Graphics </td><td align="right"> 21,1 MB </td><td>&#160;</td></tr>
<tr><td> <a href=amin26a.html#a7> &quot; hard &quot; </a></td>
<td> Hardware </td><td align="right"> 2,0 MB </td><td>&#160;</td></tr>
<tr><td> <a href=amin26a.html#a8> &quot; misc &quot; </a></td>
<td> Miscellaneous </td><td align="right"> 25,4 MB </td><td>&#160;</td></tr>
<tr><td> &quot; mods &quot; </td>
<td> Music modules </td><td align="right"> 155,3 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=amin26a.html#a9> &quot; mus  &quot; </a></td>
<td> Musical software </td><td align="right"> 12,1 MB </td><td>&#160;</td></tr>
<tr><td> &quot; pix  &quot; </td>
<td> Pictures </td><td align="right"> 60,9 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=amin26a.html#a10> &quot; text &quot; </a></td>
<td> Text related </td><td align="right"> 5,3 MB </td><td>&#160;</td></tr>
<tr><td> <a href=amin26a.html#a11> &quot; util &quot; </a></td>
<td> Utilities </td><td align="right"> 16,9 MB </td><td>&#160;</td></tr></table></center>

<br>
Wolf Zimmer
<hr noshade>
<center>
<a href="../nocover.html"><img border=0 src="../l_hauptinhalt.jpg" width=600 height=99></a>
</center>

</BODY>
</HTLM>
