<HTML>
<HEAD>
<TITLE>
Diskussion um die Pläne von Amiga, Inc.</TITLE>
</HEAD>
<BODY TEXT=white link=blue alink=black background="indypattern.jpg">
<H3><B>Hallo Mark Tom!</B></H3>
Eine Frage: Bist Du wirklich  bereit Deinen &quot;Classic Amiga&quot; einfachso zu entsorgen?<BR>
Mit all seiner nicht weiterverwendbaren HardWare und dem Geld was Du investiert hast? <BR>
Willst Du allen ernstes Deinen Amiga bis ins Jahr 2000 nicht mehr aufr&uuml;sten? <BR>
Ich hatte eigentlich nicht vor, bis ins Jahr 2000 mit einem Prozessor aus den 
Achtzigern zuarbeiten und ein Betriebssystem von 1993 zufahren. <BR>
Will sagen: 2 Jahre sind einfach eine zulange Zeit f&uuml;r die Computer Industrie.
Bis dahin kann man den Amiga Markt nicht einfach so brach liegen lassen. Es w&auml;ren dann schon 
&uuml;ber 7 Jahre OHNE neues OS und neuerer Hardware. <BR>
Und sehen wir die Sache mal ganz negativ: Was ist wenn bis dahin Gateway in Konkurs geht?<BR>
Dann haben wir wieder nichts...<BR>
<BR>
Das mit dem PPC keine gro&szlig;en Spr&uuml;nge in Sachen &quot;Amiga an die Spitze&quot; gemacht werden k&ouml;nnen
ist zwar richtig, aber Du vergi&szlig;t das damit dem Markt wieder eine einigerma&szlig;en Leistungs
f&auml;hige und stabile Hardwarebasis gegeben werden w&uuml;rde. Und die hat der Amiga bitter n&ouml;tig!!<BR>
<BR>
Wie w&auml;re es eigentlich wenn man die PPC Turbokarte in den neuen Amigas wieder verwenden k&ouml;nnte?<BR>
Als CoProzessor sozusagen. Dann h&auml;tten doch eigentlich alle etwas gewonnen, oder?<BR>
<BR>
Phase5 w&uuml;rde seine PPC Turbokarten los...<BR>
Die User die bereits PPC Turbokarten besitzen w&uuml;rden auch mal wieder lachen...<BR>
Amiga, Inc. h&auml;tte ein paar ver&auml;rgerte User weniger...<BR>
Softwareentwickler h&auml;tten eine einigerma&szlig;en Leistungsstarke Hardware Basis bis die neuen Amigas<BR>
endlich erscheinen...<BR>
Die User ohne PPC-Turbokarte k&ouml;nnte sich ein solche kaufen OHNE ihr Geld zum Fenster<BR>
herrauszuschmei&szlig;en...<BR>
<BR>
<HR>
<BR>
<BR>
Den Br&uuml;cken Amiga hatte ich da in der Tat im Hinterkopf...<BR>
<BR>
Das mit den 2MB Ram und dem 68000 war so gemeint:<BR>
Jeder von uns hat bestimmt ein paar Tools im Hintergrund der Workbench laufen. Diese verbrauchen
dann bekannter Weise auch Speicher und Prozessorleistung. Bei mir gehen dadurch z.B. 6% Prozessor
leistung und ca. 2 bis 3 MB Ram weg.<BR>
Wenn man nun mehr und mehr Tools installiert, um das OS weiterhin up to date zu halten,
so ben&ouml;tigen auch diese wieder Speicher und Prozessorleistung - bis man irgendwann so viele im Hintergrund
laufen hat, das man meint keinen 68030 sondern einen 68000 Prozessor zubesitzen und aus den 16MB RAM
2 MB werden...<BR>
(Alles klar??)<BR>
<BR>
<I>
Ciao,<BR>
</I>
Christian Schmidt<BR>
<BR>
<HR>
<BR>
<BR>
P.S. Heute (12. August 1998) habe ich etwas sehr merkwürdiges in der Amiga+ gelesen... Sagt mir mal bitte
jemand, das das <H1> <B>nicht wahr</H1></B> ist?! (Der Chefredakteur hatte wohl einen Sonnenstich als er
das geschrieben hatte - jaja die b&ouml;se Sonne... )
</P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=597 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
