<HTML>
<HEAD>
<TITLE> Amiga-Leistung </TITLE>
</HEAD>
<BODY BACKGROUND=htmlbg.png TEXT=black link=blue alink=red bgcolor=white>

<P><CENTER><H1> So sieht's im APC&TCP aus: </H1></CENTER>
<P>
Angespornt durch die Diskussion &quot;HTML oder MP&quot;, bei
der das Argument A500-User gegen HTML verwendet wurde, habe
ich mal mit Hilfe der Rainers Mitgliederliste nachgeforscht,
was die Computer der Clubber denn so leisten.
<P>
Vorweg noch etwas zur Diskussion selbst: <BR>
Ich bin &uuml;ber die Umstellung auf HTML SEHR froh!<BR>
Wieso? <BR>
<UL>
<LI> keine Farbbegrenzung f&uuml;r High-End-Amigas
<LI> PPC-Unterst&uuml;tzung (z.B. durch das akJFIF-Datatype,
das wirklich sehr zu empfehlen ist!)
<LI> man hat sehr viel mehr M&ouml;glichkeiten die Seite zu layouten und
der User kann sich trotzdem alles nach seinem Geschmack einstellen
<LI> sehr viel schnelleres Browsen
<LI> auf der CUCD24 ist eine Version von AWeb3.1 drauf, deren EINZIGE
Beschr&auml;nkung es ist, da&szlig; sie nur zum Offline-Browsen
verwendet werden kann (kein Nervrequester, keine Zeitbeschr&auml;nkung)
</UL>
<P>
Unterteilt man die Amigas nach Typen, so erh&auml;lt man folgendes
Bild:<BR>
Hierbei sind, wie in den nachfolgenden Tabellen auch nur die Erstamigas
gez&auml;hlt. Bei ungenauen Angaben ging ich vom schlechtm&ouml;glichsten
Fall aus) <BR>
<P>
<IMG SRC=typ.png WIDTH=481 HEIGHT=385 ALT="Ich hoffe, jeder sieht das Bild!">
<P>
Diese Amigas sind aber zu &uuml;ber 90% aufger&uuml;stet.<BR>
Deshalb sagen die Typen kaum noch etwas aus.
<P>
Um ersteinmal einen kleinen &Uuml;berblick zu verschaffen, m&ouml;chte
ich erst KickROM, RAM, CPU usw. getrennt darstellen:
<P>
Die verwendeten CPUs (bei PPC-Boards sind beide gewertet):
<P>
<IMG SRC=cpu.png WIDTH=387 HEIGHT=375 ALT="Wer sieht das PNG-Bild nicht?">
<P>
KickROMs
<P>
<IMG SRC=kicks.png WIDTH=455 HEIGHT=341 ALT="96,74% haben die KickROMs
3.x drin">
<P>
AGA / kein AGA (evtl. vorhandene Gfx-Karte wurde nicht ber&uuml;cksichtigt)
<P>
<IMG SRC=aga.png WIDTH=455 HEIGHT=341 ALT="91,3% der Rechner haben AGA">
<P>
RAM:<BR>
Jede S&auml;ule steht f&uuml;r einen User. Die L&auml;nge der
S&auml;ule gibt seinen RAM in MB an. Der Durchschnittsuser hat
statistisch gesehen 20 MB RAM.
<P>
<IMG SRC=ram.png WIDTH=640 HEIGHT=512 ALT="Falls die anderen Bilder angezeigt wurden und dieses nicht, ist Euer RAM voll."
<P>
Zum Abschlu&szlig; folgt nun der Versuch einer Einteilung der Amigas,
wie HTML-tauglich sie sind:
<P>
<TABLE BORDER BORDER=3 CELLSPACING=2>
<TR> <TH> Kommentar <TH> Mindestanforderung <TH> wie viele? </TR>
<TR> <TH> SUPER!!!  <TD> 603e, OS 3.0, 34 MB RAM, AGA  <TD ALIGN=RIGHT> 6,5 %  </TR>
<TR> <TH> sehr gut  <TD> 68060, OS 3.0, 12 MB RAM, AGA <TD ALIGN=RIGHT> 10,9 % </TR>
<TR> <TH> gut       <TD> 68040, OS 3.0, 8 MB RAM, AGA  <TD ALIGN=RIGHT> 13,0 % </TR>
<TR> <TH> besser    <TD> 68030, OS 3.0, 6 MB RAM, AGA  <TD ALIGN=RIGHT> 45,7 % </TR>
<TR> <TH> schlecht  <TD> 68000, OS 3.0, 2 MB RAM       <TD ALIGN=RIGHT> 19,6 % </TR>
<TR> <TH> NEIN!     <TD> keine                         <TD ALIGN=RIGHT> 4,3 %  </TR>
</TABLE>
<P>
Nach dieser Aufstellung fallen nur 4,3 % der Amigas durch. Mit 19,6%
der Amigas ist HTML m&ouml;glich, aber MP w&auml;re f&uuml;r sie besser.
F&uuml;r 45,7 % ist HTML besser als MP, wenn auch gleichschnell. Auf
30,4 % (fast ein Drittel) l&auml;uft HTML garantiert viel schneller
als MP.
<P>
Und nun mal ehrlich: <BR>
Wer h&auml;tte diesen Artikel so sch&ouml;n in MP hinbekommen?
<P ALIGN=RIGHT>
<A HREF="mitglieder/steffens.html">
<IMG SRC=umo.gif WIDTH=84 HEIGHT=41 ALT="UMO - Thomas Steffens"> </RIGHT>
</A>


<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
