<HTML>
<HEAD>
<TITLE> Squirrel-SCSI und Zip-Drive</TITLE>
</HEAD>
<BODY BACKGROUND=umozip.png TEXT=black link=blue alink=red bgcolor=white>

<P><CENTER><H1> Das Eichh&ouml;rnchen und das Zip-Laufwerk </H1></CENTER>
<P>
Ich besitze einen A1200, der in einem infinitiv-Tower seine Arbeit
verrichtet. Damit das ganze etwas schneller geht habe ich dazu noch
eine PPC-Karte OHNE SCSI eingebaut.
<P>
<H2> Wieso ohne SCSI? </H2><BR>
Ganz einfach! Wenn ein Programm mit der Karte nicht zurechtkommt, kann
man die Karte ganz einfach abschalten. W&auml;ren nun die SCSI-Ger&auml;te auch
&uuml;ber die Karte angeschlossen, so w&auml;ren sie nun nicht mehr verf&uuml;gbar.
<P>
Und was ist, wenn die Karte kaputt ginge? Dann m&uuml;&szlig;te ich den
SCSI-Hostadapter mit einschicken bzw. bei Neukauf mir einen neuen
Adapter mitkaufen. Ist das wirklich das wahre? Ich glaube nicht!
<P>
<H2> Squirrel-SCSI </H2> <BR>
Als Alternative gibt es f&uuml;r den A1200 und den A600 einen
SCSI-Hostadapter f&uuml;r den PCMCIA-Port. Diesen Hostadapter gibt es in
zwei Versionen, einmal mit und einmal ohne serieller Schnittstelle.
<P>
Ich habe mich f&uuml;r die Version ohne serieller Schnittstelle
entschieden, da ich es bis jetzt noch nie in die Situation kam, da&szlig;
die Amiga-interne Schnittstelle zu langsam war. Sie verkraftet bei mir
problemlos die Einstellung 115200 bps - und mehr sind bei meinem 33600er
Modem nicht drin.
<P>
<H3> Der Einbau </H3> <BR>
Wenn man wie ich einen Tower sein eigen nennt, ben&ouml;tigt man als erstes
einen PCMCIA-Winkeladapter. Und nun kommt die zweite H&uuml;rde: <BR>
Do you speak english? oder bist Du ein NESP? (NESP= No english
speaking person) <BR>
Falls das zweite zutrifft hast Du ein Problem, denn die gesamte
ausf&uuml;hrliche 60-seitige Anleitung ist in englisch geschrieben.
<P>
Aber auch wenn man englisch kann stellt sich die Frage: <BR>
Wierum kommt es denn nun rein? <BR>
In der Anleitung ist das n&auml;mlich nicht erw&auml;hnt! Hier hilft nur
probieren oder weiterlesen, denn die Aufl&ouml;sung ist:<BR>
Das Kabel mu&szlig; nach hinten zeigen.
<P>
Apropos Kabel: Es ist ein 50pol. Centronicskabel. Man ben&ouml;tigt also
einen Adapter, wenn man interne Ger&auml;te anschlie&szlig;en will. Aber auch f&uuml;r
externe Ger&auml;te wird evtl. ein Adapter ben&ouml;tigt, da es extern auch den
25pol. SubD-Stecker gibt.
<P>
<H3> Die Softwareinstallation </H3> <BR>
Sie l&auml;uft &uuml;ber den Standard-Installer. Wobei man unbedingt "Profi"
angeben mu&szlig;. Die anderen beiden Installationsarten laufen n&auml;mlich
nicht korrekt. <BR>
Dieses Installationsskript hat es in sich. Man kan n&auml;mlich w&auml;hlen, was
man neben der einfachen SCSI-Installation noch so braucht. So stehen
sechs Checkboxes zur Auswahl: <BR>
<UL>
<LI> SCSI-Software installieren
<LI> CD32-Emulation installieren
<LI> Boot-Disk f&uuml;r CDs und CD32 erzeugen
<LI> Boot-Disk f&uuml;r CDs erzeugen
<LI> Boot-Disk f&uuml;r SCSI-HDDs erzeugen
<LI> eine SCSI-HDD f&uuml;r die Benutzung mit einer Bootdisk einrichten
</UL>
<P>
Da ich nur ein Zip-Laufwerk anschlie&szlig;en m&ouml;chte und der Rest sich
sp&auml;ter noch genausogut allein installieren l&auml;&szlig;t, habe ich nur den
ersten Punkt angew&auml;hlt - oder schreibe ich besser das erste K&auml;stchen
abgehakt ?!?
<P>
<H3> Plug&Play </H3> <BR>
Hier wurde Plug&Play in bester Weise eingesetzt! Man kann das
SCSI-Interface w&auml;hrend der Computer l&auml;uft einstecken und erst dann
wird das SquirrelSCSI-Device aktiv. Man kann es auch einfach w&auml;hrend
der Computer l&auml;uft wieder entfernen und das SCSI-Device und s&auml;mtliche
SCSI-Ger&auml;te verschwinden wieder. Doch Vorsicht! Es kann fatal sein,
wenn Ihr es herauszieht, w&auml;hrend auf eine SCSI-Platte geschrieben
wird. Warum d&uuml;rfte klar sein. <P>

<H2> Das Zip-Laufwerk </H2> <BR>
Die Softwareinstallation war extrem einfach. Auf irgendeiner CDROM
habe ich Mount-Files f&uuml;r PC-Zip-Disx und Mac-Zip-Disx gefunden. Ich
mu&szlig;te nur noch in der Mountdatei f&uuml;r die PC-Zips das Device &auml;ndern und
schon konnte ich PC-formatierte ZipDisx lesen und beschreiben. <BR>
Auf einer weiteren CDROM (oder war es die gleiche?) fand ich dann noch
ein Cardware-Programm namens ZipTool. Damit ist es mir m&ouml;glich einen
Pa&szlig;wortschutz einzurichten, zu &auml;ndern und &auml;hnliches. Somit habe ich
das 40 DM teure ZipTools-Programm gespart, dessen Vertrieb sowieso
eingestellt wurde. Falls die Ger&uuml;chte stimmen. <P>
<STRONG> Amiga-formatierte ZipDisx </STRONG> sind noch einfacher zu
erstellen. Man mu&szlig; einfach nur HDToolbox aufrufen und sie wie eine
Festplatte einrichten und fertig.
<P>
<H3> Probleme ? </H3>
Leider ja! Snoopy kann meine ZipDisx nicht lesen und ich kann seine
nicht lesen. Sein Zip-Laufwerk kam NICHT mit den vorformatierten
PC-Zip-Disx zurecht nachdem ich mit meinem ZipDrive Daten darauf
geschrieben habe. Ich habe daf&uuml;r keine Erkl&auml;rung!
<P ALIGN=RIGHT>
<A HREF="mitglieder/steffens.html">
<IMG SRC=umo.gif WIDTH=84 HEIGHT=41 ALT="UMO - Thomas Steffens"> </RIGHT>
</A>
<P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
