<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>WolfZ</title>
</head>

<body background="st_wolfinfo.gif" TEXT=black link=blue alink=red bgcolor="#FFFFCC">
<a name="top"></a>
<p>
<center><font color="#000080" size="7"><b>Wolf's Leserbrief</b></font></center>
<br>
<ul>
<li><a href="#a1"><b>f&uuml;r Sieglinde Peters</a></b>
<li><a href="#a2"><b>f&uuml;r Rolf N&uuml;nninghoff</a></b>
<li><a href="#a3"><b>f&uuml;r Fabian Kruse</a></b>
</ul></p>
<br><br><center>
<table border="6" width=90%><tr><td bgcolor="#FFFF99">
<p>
<a name="a1"><h3>Gr&uuml;&szlig; Dich Sieglinde!</h3></p>
Vielen Dank f&uuml;r Deinen Brief inkl. der Anlage mit der Antwort von Fa.
Schatztruhe betreffs der Differenz von Schaltfl&auml;chen auf den Aminet-CD's
zwischen Index und Guides/Deutsch. Die Aussage, dass in Guides/Deutsch nur die
Programme erscheinen, die eine deutsche Dokumentation haben, stimmt so nicht.
Es h&auml;tte dann auch dabei stehen sollen, dass Programme und vor allem Bilder nur von
deutschen Programmieren enthalten sind.</p>
<p>
Aber auch das stimmt so nicht. Sieh Dir als Beispiel docs/hyper an. Es sind 25
Programme, von denen 9 einen deutschen Text mit aufweisen. Diese sind mit einem
Bindestrich vor ihrem Titel gekennzeichnet.</p>
<p>
Dieses Thema werde ich adacta legen und nicht mehr erw&auml;hnen. Wenn aber da steht,
es seien 900 MB Neuheiten enthalten und ich kann nur Updates finden, dann sage ich
es auch weiterhin.</p>

Gehe &#160; <a href="#top"> zum Anfang</a>
</td></tr></table><br>
<table border="6" width=90%><tr><td bgcolor="#FFFF99">
<p>
<a name="a2"><h3>Gr&uuml;&szlig; Dich Rolf</h3></p>
<p>
Um Dir im Einzelnen zu antworten, werde ich Deine Aussage nochmals mit auff&uuml;hren,
wie bei einer eMail nur in blauer Schrift.</p>
<p><font color="#000080">
&gt; Der W&uuml;rzburger m&ouml;chte Dir &uuml;ber diesen Weg ein gro&szlig;es Lob aussprechen !</font><br>
Wenn ich solche S&auml;tze lese, dann werde ich unsicher.</p>
<p><font color="#000080">
&gt; Deine Artikel in der NoCover zeugen von einer sehr aufmerksamen
und vielseitigen Arbeit.</font><br>
Es freut mich, wenn Du dies so siehst. Ein bisschen M&uuml;he gebe ich mir schon.</p>
<p><font color="#000080">
&gt; Ich bin immer wieder &uuml;berrascht, mit welchen Themen Du Dich
besch&auml;ftigst. Und wie professionell Du an die Dinge herangehst.</font><br>
Professionell ist bei mir garnichts. Das hie&szlig;e berufm&auml;&szlig;ig und das ist es beileibe
nicht.</p>
<p><font color="#000080">
&gt; Wieviele Stunden verbringst Du an der Tastatur Deines Computers ?</font><br>
So viel ist nun auch wieder nicht. Zeitangaben sind aber sehr schwierig anzugeben,
da ich zur Zeit gr&ouml;&szlig;tenteils an meinem Index arbeite und das nur vormittags.</p>
<p><font color="#000080">
&gt; Und wo kommen die ganzen Informationen her, die Du benutzt ?</font><br>
Lesen - Denken - Zuh&ouml;ren.</p>
<p><font color="#000080">
&gt; Jedenfalls lese ich immer begeistert Deine Artikel !</font><br>
Vielen Dank !  Letztens wurde in einer Feedback (in NC-49) gesagt, dass ich mit meinen
CD-Tests ganz alleine da stehen w&uuml;rde.</p>
<p><font color="#000080">
&gt; Auch das Du auf das Thema "HTML" in dieser Form eingehst.</font><br>
Das sind einfach nur Erfahrungswerte, die ich gesammelt habe. Und diese gebe ich dann gerne
weiter. Wie ich auch Dir sagen kann, dass Du bei der Angabe des Backgroundes ein
Hochkomma zuviel gesetzt hast und deshalb das Hintergrundbild nicht gebildet werden kann.
Weiter m&ouml;chte ich Dir raten, Farbangaben mit Dezimalzahlen und nicht mit Klartext zu
definieren. Wenn dann GRAY anstelle von GREY geschrieben wird, ensteht pl&ouml;tzlich
anstelle eines grauen Hintergrundes ein tiefblauer Bildschirm, sodass eine schwarze Schrift
nicht mehr zu lesen ist.</p>
<p><font color="#000080">
&gt; Wundere mich allerdings, was Dir in der Richtung nicht gel&auml;ufig sein soll, denn Deine
Artikel strotzen doch nur so von "eingebauten" Fachbegriffen ?</font><br>
Das ist aber etwas, was ich mit Vehemenz abstreite. Mein oberstes Streben ist stets
gewesen, Sachst&auml;nde mit m&ouml;glichst einfachen Worten, aber gezielt beschrieben darzustellen.
Mein Fehler besteht vielleicht darin, dass ich zu kurz und zu intensiv beschreibe, so dass
vielleicht manches &uuml;berlesen wird.</p>
Gehe &#160; <a href="#top"> zum Anfang</a>
</td></tr></table><br>
<table border="6" width=90%><tr><td bgcolor="#FFFF99">
<p>
<a name="a3"><h3>Gr&uuml;&szlig; Dich Fabian</h3></p>
<p>
Du brauchst Dir keinerlei Gedanken dar&uuml;ber machen, dass es in Vellmar zu Missverst&auml;ndnissen
h&auml;tte kommen k&ouml;nnen. Wirklich nicht.<br>
Der NoCover-Index wird kontinuierlich fortgeschrieben und erh&auml;lt keine Versionsnummern.
Das habe ich in der Amigaguideform schon nicht gemacht.</p>

Gehe &#160; <a href="#top"> zum Anfang</a>
</td></tr></table><br>
<table border="6" width=90%><tr><td bgcolor="#FFFF99">
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a><br>
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a></p>
<center>
<a href="NoCover.html"> <img border=0 src="l_hauptinhalt.jpg" width=500 height=75></a>
</center>
</body>
</html>

