<HTML>
<HEAD>
<TITLE> Indys Leserbriefe
</TITLE>
</HEAD>
<BODY TEXT=white link=blue alink=black background="indypattern.jpg">
<H2>Servus alle miteinander!</H2>
 Zu lesen gibt es hier etwas f&uuml;r...<BR>
<BR>
<BR>

...Christian Wimmer.....................-- DOSO<BR>
...Dietmar Kretlow<BR>
...Henning Wolf Knopp.................-- SAX <BR>
...Makers of the Mitgliederliste...-- Rainer und Sascha<BR>
<BR>
<CENTER><I>and last but not least</I></CENTER><BR>
...Jens Kretzer...............................-- Hightower<BR>
<BR>
<HR>
<BR>
<BR>
<B><H3>
Hallo DOSO!!<BR>
</B></H3>
Wer, Wie, Was, Wo, Wann, Warum, Wieso, weshalb PC???? <BR>
Hast Du Dir echt einen PC gekauft?? Ich hoffe Du hast wenigstens einen AMD Prozessor und Linux
als Betriebssystem!!<BR>
Naja, irgendwie Verst&auml;ndlich bei dem <B>Schei&szlig;</B> der da von Amiga, Inc. kommt... ;-(((<BR>
Wei&szlig;t Du was mich dabei sooooo aufregt? <BR>
<BR>
Ich werds Dir sagen (ob Du willst oder nicht ;-)):<BR>
Das wir alle unsere Amigas praktisch in die Tonne treten k&ouml;nnen (wie Sieglinde es so sch&ouml;n 
formulierte).<BR>
Will sagen: Wir haben jahrelang in unsere Computer investiert, und gehofft das sich das irgend
wann einmal bezahlt macht. Schei&szlig;e is! Wir bekommen von  Amiga klipp und klar gesagt
das unsere Amigas das letzte sind und deshalb neue her m&uuml;ssen.<BR>
Und das ist es was mich so sauer macht! Wir h&auml;ngen jetzt 2 verdammt lange Jahre &quot;in der Luft&quot;.<BR>
<BR>
Wir haben nichts halbes und nichts ganzes... <BR>
<BR>
Mir w&uuml;rde es am besten gefallen wenn Amiga, Inc den PPC vorerst weiter als Hauptprozessor deklarieren
w&uuml;rde. Und der sp&auml;ter als so eine Art CoProzessor in den neuen Amigas weitergenutzt werden kann.
Das h&auml;tte doch viele Vorteile, oder?<BR>
Zum Beispiel h&auml;tten die Softwareentwickler vorerst eine stabile Hardwarebasis (zumindest beim Pro
zessor) auf der sie entwickeln k&ouml;nnen. Nat&uuml;rlich m&uuml;sste die Software sp&auml;ter auch auf dem &quot;Phantom 
Amiga&quot; laufen - das k&ouml;nnte dann durch den &quot;PPC CoProzessor&quot; erreicht werden. Dieser steckt nat&uuml;rlich 
auf einer Phase5 PPC-Turbokarte, die es ja bekanntlich schon jetzt zukaufen gibt.<BR>
Und wir Amiga User k&ouml;nnten unsere Amigas jetzt mit den PPC aufr&uuml;sten und so einen enormen Leistungsschub erziehlen OHNE Geld zum Fenster herrausgeschmissen zu haben...<BR>
Was meinst Du?<BR>
<BR>
<B>
Thema Modem:<BR>
</B>
Also das ist so: Mein Zimmer ist, um es vereinfacht zusagen, auf der falschen Seite des Hauses.<BR>
Der Telefonanschluss liegt genau gegen &uuml;ber. Und wenn ich nun eine Leitung legen
w&uuml;rde, m&uuml;sste ich mich durch das ganze Haus bohren, was ein sehr gro&szlig;er Aufwand w&auml;re...<BR>
(Alles klar??)<BR>
<BR>
<B>
Thema CD:<BR>
</B>
Wurde umgetauscht, das R&uuml;ckporto hab&acute; ich aber nicht zur&uuml;ck bekommen. Obwohl man&acute;s mir versprochen
hatte! Wein, heul...<BR>
<BR>
(Wirklich b&ouml;ses Vesalia ;-))<BR>
<BR>
Wie gehts Deinem Auto? Was hast Du eigentlich f&uuml;r eins?<BR>
<BR>
Danke f&uuml;r die HelpLine Antwort! Kurz und knapp... ;-))<BR>
<BR>
<I>
Bis dem n&auml;xt!<BR>
</I>
<BR>
<HR>
<BR>
<BR>
<H3>
<B><H3>
Tach auch Dietmar!<BR>
</B></H3>
Danke f&uuml;r die Addresse. Wie hast Du die vom Andreas bekommen? Ich hab&acute; ihn schon mehrmals danach <BR>
gefragt, hatte aber nie eine Antwort bekommen...<BR>
<BR>
Deine Amiga Depression kann ich nur zu gut nachvollziehen...<BR>
<BR>
Jetzt zu der erfreulicheren Seite:<BR>
Tja, mit dem &quot;Devices&quot; habe ich mich ehrlich gesagt noch &Uuml;berhaupt nicht besch&auml;ftigt, daf&uuml;r aber
mit dem &quot;Message-System&quot; (Ich nehme mal an Du meinst damit IDCMP). Au&szlig;erdem besch&auml;ftige ich mich viel
mit Intuition und jetzt auch der Graphics Library. Hast Du dir schon mal BOOPSI angeschaut?<BR>
Ich habs endlich (nach 2 Wochen) einigerma&szlig;en kapiert. Allerdings wei&szlig; ich nicht was daran so toll
sein soll...<BR>
Was hast Du da denn f&uuml;r ein Buch? Ich benutzte als Nachschlagewerk das &quot;Amiga C Manual&quot;, war auf 
der CUAmiga CD 15 drauf. Ist eigentlich total veraltet, aber es erkl&auml;rt die Grundlagen von 
Fenster, Screens, Gadgets usw. sehr verst&auml;ndlich.<BR>
Eine Frage:<BR>
Du wei&szlig;t nicht zuf&auml;llig wie man einen CyberGraphX Screen aufmacht, oder? Z.z. kopiere ich einfach 
den Workbench Screen (&quot;SA_LikeWorkbench&quot;).<BR>
<BR>
Warum Du so wichtig bist?<BR>
Naja, es ist halt jeder wichtig, vorallem in dieser Zeit, wo so viele User den Amiga verlassen...<BR>
<BR>
&Ouml;hh, was ich Dich mal fragen wollte: hast Du Lust mal etwas mit mir zu programmieren? (wenn Du
mal wieder etwas mehr Zeit hast)<BR>
<BR>
<I>
Tsch&uuml;ss, und schreib auch mal wieder!<BR>
</I>
<BR>
P.S. Wei&szlig;t Du was es mit dem &quot;RAW&quot;-Format auf sich hat?<BR>
<BR>
<HR>
<BR>
<BR>
<H3><b>
Hi SAX!<BR>
</H3></B>
Wieso 13&quot; Flatscreens. Zwei 14 Zoller sind das...<BR>
... aber leider keine Flatscreens, sondern nur ein alter, schon langsam Schimmel ansetzender
1085S und ein Multiscanner (das Geld f&uuml;r das Ding hab ich echt in den Sand gesetzt ;-(. Aber was
solls...).<BR>
<BR>
Meine n&auml;chste Anschaffung wird wohl ein neues CD-ROM Laufwerk sein. Ich pendel da allerdings 
zwischen einem normalen und einem CD-Writer (evtl. sogar CD-Rewriteable). Mal sehen wie sich
die Preise entwickeln. Vor der WoA hatte ich ja noch in Richtung PPC geschielt, was aber
durch Amiga, Inc. und Pl&auml;ne vorbei ist, seufz...<BR>
<BR>
Sag mal, was hast Du eigentlich f&uuml;r ein CD-ROM Laufwerk, und wie ist es mit Deinem Amiga
verbunden? (SCSI, ATAPI, IDE, PCMCIA usw.) <BR>
<BR>
Thanx for your answer in the HelpLine!<BR>
<BR>
<I>
I Read you!<BR>
</I>
<BR>
P.S Kann es sein das Du auch ein leidgeplagter CV64 User bist?<BR>
<BR>
<HR>
<BR>
<BR>
<H3><B>
Hallo ihr!!
</H3></B>
&auml;hm, Ihr d&uuml;rft mich Christian nennen... ;-)))<BR>
<BR>
<I>
Good bye!
</I>
<BR>
<HR>
<BR>
<BR>
<h3><B>
Gr&uuml;&szlig; dich Jens!<BR>
</H3></B>
Danke f&uuml;r Dein Buchvorschlag, werds mir demn&auml;chst mal kaufen/bestellen!<BR>
<BR>
<I>
Ciao!<BR>
</I>
<BR>
<HR>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=495 height=99></A>
&lt;&lt; La&szlig; mich raus!!
</P>
</BODY>
</HTML>
