<HTML>
<HEAD>
   <TITLE>Leserbrief von Yonder</TITLE>
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#DDDDDD" LINK="#0000FF" ALINK="#FF0000" BACKGROUND="l_bg.gif">

<CENTER>
<H1>
<FONT COLOR="#000000"><FONT SIZE=+4>Hallo Leute !!!</FONT></FONT></H1></CENTER>
Nach einigen Monaten Abstinenz aus den Leserbriefseiten, habe ich mir mal
gedacht, das Sommerloch der NoCover ein bi&szlig;chen mit ein paar Nachrichten
an einige Clubber zu f&uuml;llen.

<P>Messages gehen an:

<P><B><FONT COLOR="#FF0000">SAX</FONT></B>

<P><B><FONT COLOR="#FF0000">Higgins</FONT></B>

<P>
<HR WIDTH="100%">

<P>Hi SAX !

<P>Zu Deiner Frage in einer der letzten NoCovers:
<BR>Meine Rolle im StoryGameTNG finde ich genau richtig ;-)

<P>In der No Cover #52 im Leserbrief an den tob habe ich gelesen, da&szlig;
Du mal ein paar Highscores von Slamtilt haben m&ouml;chtest. Ich habe es
zwar schon eine ganze Weile nicht mehr gespielt, aber f&uuml;r Dich schaue
ich mal kurz in die Highscore-Tables (raschel, bl&auml;tter, such... &auml;h
falsch... klick, dr&uuml;ck, aufschreib :-))

<P>Mean Machines: 11.293.064.110
<BR>The Pirat: 3.663.141.050
<BR>Ace of Space: 7.695.376.900
<BR>Night of the Demon: 2.341.500.000

<P>Alle Scores wurden nat&uuml;rlich mit nur 3 Kugeln und ohne sonstige
Cheats erspielt!

<P>Slamtilt ist im Gegensatz zu Pinball Dreams, Fantasies und Illusions
eine ganze Ecke einfacher, deshalb diese ziemlich hohen Scores. Beim Highscore
von Mean Machines habe ich zig Extra-Balls bekommen und habe mindestens
&uuml;ber 1,5 Stunden gespielt. Bei den anderen Tischen liefs ungef&auml;hr
genauso ab.

<P>La&szlig; mal Deine Scores sehen!

<P>Ciao

<P>
<HR WIDTH="100%">

<P>Servus Higgins,

<P>ich habe mir mal ein paar Gedanken zu Deiner Idee mit dem Aufzeichnen
der Mausbewegungen bei einem Programm gemacht (zwecks Anleitung f&uuml;r
komplizierte Funktionen in einem Programm).

<P>Besser w&auml;re es wohl, eine Online-Anleitung in eine Animation zu
verpacken: Man br&auml;uchte doch "nur" einen Screengrabber, welcher, sagen
wir mal, alle 1/25 Sekunde ein Bild macht und dieses in eine Animation
oder in Einzelbilder abspeichert. Die ganzen Bilder f&uuml;gt man dann
zu einer Anim zusammen, die dann bei Bedarf abgespielt werden kann.

<P>Okay, ich wei&szlig; nicht ob das mit der Rechenpower eines 68k-Proz
zu machen ist, aber ich denke doch mal, da&szlig; man mit 'nem 040er oder
060er in diesen kurzen Zeitabst&auml;nden Bilder grabben k&ouml;nnte. Viel
Speicher w&uuml;rde die Animation auch nicht verbrauchen, da ja normalerweise
bei einem Anwenderprogramm sich nicht alle paar Sekunden ein komplett neues
Bild aufbaut.

<P>Also, ich hoffe mal, Du verstehst meine Theorie.

<P>Zus&auml;tzlich k&ouml;nnte man noch im Hintergrund Sprachausgabe bringen,
welche die gezeigten Aktionen kommentiert.

<P>H&ouml;rt sich doch garnicht so schlecht an, oder? Du muﬂt halt nur jemand
finden, der sowas programmieren kann.

<P>Tsch&ouml; und machet jut

<P><FONT SIZE=+1><A HREF="MITGLIEDER/WOLPERT.HTML">YONDER&nbsp; ---&nbsp;
Gerd Wolpert</A></FONT>

<P>E-Mail:<A HREF="mailto:gerd_wolpert@t-online.de?subject=Leserbrief">gerd_wolpert@t-online.de</A>
<BR>&nbsp;

<P>
<HR>
<CENTER><A HREF="NoCover.html"><IMG SRC="l_hauptinhalt.jpg" BORDER=0 HEIGHT=99 WIDTH=639></A></CENTER>

</BODY>
</HTML>