<HTML>
<HEAD>
<TITLE>Roadrunners Leserbriefstunde</TITLE>
</HEAD>
<BODY background="l_bg.gif" TEXT=black link=blue alink=red bgcolor="#dddddd">
<a href="#mehr">Was noch auﬂer diesem Text in dieser NoCover von mir steht</a>
<HR>
<NOBR>Herzlich Willkommen bei&#160;<IMG SRC="sklbox.jpg" ALT="Svens Letterbox" ALIGN=middle></NOBR><BR clear=all>
<BR>
Diesmal gibbet Leserbriefe an:<br>
<a href="leser_svenk.html#alle">Alle und noch ein paar mehr...</a><br>
<a href="leser_svenk.html#Higgins">den &uuml;berbesch&auml;ftigten Higgins</a><BR>
<a href="leser_svenk.html#wolf">den hoffentlich diskusionsfreudigen Wolf Zimmer</a><BR>
<a href="leser_svenk.html#nagash">den organisierten Nagash</a><BR>
<a href="leser_svenk.html#snoopy">den fahrenden Hund namens Snoopy</a><BR>
<a href="leser_svenk.html#dr">den pfuschenden dR.</a><BR>
<a href="leser_svenk.html#Ziel">Text f&uuml;r Verweis</a><BR>
<br>
Sowie meinen Pers&ouml;nlichen Top 5 der NC #54, Welche ich einfach mal<br>
<a href="leser_svenk.html#rr5t"><CENTER>Roadrunners 5 Tons</CENTER></a>
genannt habe.<br>
<hr width=95% size=4 color=red noshad>
<br>
<a name="alle">An Alle</a><br>
<br>
Tja, nach 2 Monatiger Pause in der NoCover bin ich auch schon wieder zur&uuml;ck. Leider habe ich ein kleines (aber dringendes) Problem. Ich br&auml;uchte dringend die Beschreibung (vor allem die Jumperbelegung!) vom Randy Rom, da mir diese abhanden gekommen ist. Selbstverst&auml;ndlich bekommt ihr die Kosten f&uuml;r Kopie&Porto von mir zur&uuml;ck. Desweiteren bin ich auf der Suche nach einem <B>Emerald Mine Leveleditor</B> sowie Nachschub an Emerald-Mine Spielen, welche allerdings von Diskette startbar sein m&uuml;ssen.<br>
<br>
<br>
<a name="Higgins">An Higgins:</a><br>
<br>
Hall&ouml;chen lieber Cord. <br>
Leider hat es ja in der letzten Ausgabe mit dem FC-Manager nicht geklappt. In dieser Ausgabe sollte derselbe aber endlich wieder vorhanden sein. Ich denke, da&szlig; ich es ab dieser Ausgabe auch wieder schaffen werde regelm&auml;ssig in der NC vertreten zu sein, so da&szlig; einem regelm&auml;ssigem Manager eigentlich nichts im wege stehen sollte. Allerdings fand ich es nicht so nett, da&szlig; Du mich einfach mit in die Liste der FC-Schreiber gesetzt hast, aber egal. Ist ja nur alle paar Monate, und das werde ich auch noch auf die Reihe kriegen. :)<br>
P.S: hast Du auch den <a href="leser_svenk.html#alle">Brief an alle</a> gelesen? ;)<br>
<br>
<br>
<a name="wolf">An Wolf Zimmer:</a><br>
<br>
Hall&ouml;chen Wolf.<br>
<br>
Wie ich extra gesagt hatte, bin ich wirklich (noch) nicht sehr Bibelfest, da ich bisher eigentlich fast nur die Offenbarung Johannes¥ kenne. Ich habe auch in der Schule nur zwei Jahre Religion gehabt, was mitlerweile auch schon ca. 11-12 Jahre her ist. Allerdings versuche ich dennoch zur Zeit viel &uuml;ber das Christentum, Buddhismus, Islam etc. zu lernen. Dies schliesst auch die sogenannten "Naturv&ouml;lkerglauben" wie z.B. der Glaube der Aborigines ein. Daher <B>glaube</B> ich zwar nicht soviel spezielles &uuml;ber die einzelnen Religionen zu wissen, aber daf&uuml;r einen guten &uuml;berblick zu haben. Dies nur zur Erkl&auml;rung. Zu meinem Artikel "Hass" muss ich sagen, da&szlig; ich da nur ein bisschen meinen Gedanken freien lauf gelassen habe, und dies eigentlich garnicht in die NC setzten wollte. Doch dann war ich doch Neugierig ob, und welche, Reaktionen kommen. Das einigen Leuten dieser Artikel ziemlich aufstossen bereiten w&uuml;rde habe ich mir von Anfang an Gedacht, und da&szlig; es jemanden geben w&uuml;rde, dem es nicht passen w&uuml;rde das ich, wie Du es sagst "Bill Gates und die Bibel in ein Verh&auml;ltnis bringe". Da&szlig; Du nichts geschrieben h&auml;ttest, wenn ich die Prophezeihungen des Nostradamus benutzt h&auml;tte finde ich eigentlich recht schade, und macht mich andererseits froh, da&szlig; ich die Bibel gew&auml;hlt habe. Schliesslich besteht die Bibel auch zu einem Teil aus Prophezeihungen, und kein guter Christ w&uuml;rde an ihnen zweifeln. Doch frage ich mich, ob es sowas wie einen guten Christen &uuml;berhaupt noch gibt. Zum Beispiel lautet meines Wissens das zweite Gebot Sinngem&auml;s "Du sollst Dir kein Bildnis Gottes machen." Dies bedeutet f&uuml;r mich ein guter Christ soll 1. kein G&ouml;tzenbild oder &Auml;hnliches von Gott besitzen, aber auch 2. sich kein "Gedankenbild" von Gott machen. Nur werden heutzutage die Kinder dazu erzogen sich Gott als "lieben Gott" das hei&szlig;t als alten Mann mit Bart usw. vorzustellen, was alleine schon meiner Meinung nach nicht stimmt. Es gibt meiner Meinung nach keinen "lieben Gott". Es mag zwar einen gerechten Gott geben, &uuml;ber dessen Existens oder Nichtexistens ich mir erst garkein Urteil bilden m&ouml;chte. Ein weiterer Irrglaube ist meiner Meinung nach sich Gott als "Besch&uuml;tzer in allen Lebenslagen" vorzustellen. Der Glaube an Gott mag zwar helfen f&uuml;r sich den richtigen Weg zu finden, aber Gott wird nur in den wenigsten F&auml;llen, sei es pers&ouml;nlich oder sei es durch Engel etc., erscheinen um einem aus der Patsche zu helfen. Daher ist es meiner Ansicht nach besser Gott als Vater zu sehen, der seine Kinder zwar "Ratschl&auml;ge" in Form der zehn Gebote und der Bibel gegeben hat, aber letzten Endes muss jeder Mensch seinen Weg alleine finden. Ich wiederhole nochmal: Der Glaube an Gott/Jesus/Allah etc. vermag zu helfen, das will ich garnicht abstreiten, aber was f&uuml;r Hinz gut ist muss f&uuml;r Kunz noch lange nicht gut sein. Will sagen: Es gibt Leute, die k&ouml;nnen mit Hilfe eines Gebetes alle oder einige ihrer Probleme l&ouml;sen, aber es gibt auch Leute (wie mich) die k&ouml;nnen zum Beispiel mit dem Christentum nicht viel Anfangen. Was den Satz "[...]Bill Gates der Antichrist, oder zumindest einer seiner "Untergebenen".[...]" angeht, muss ich Dir sagen, da&szlig; ich den Ausdruck "Antichrist" gebraucht habe, weil mir nichts passenderes in dieser Richtung eingefallen ist. Deswegen habe ich auch "oder einer seiner "Untergebenen"" hinzugef&uuml;gt, um anzuzeigen, welche Richtung ich meine. Sicher h&auml;tte ich auch schreiben k&ouml;nnen "einer von den B&ouml;sen" etc. aber mir kam es nicht auf den Begriff an, sondern darauf, zu zeigen "auf welcher Seite" Bill Gates damit st&auml;nde.<br>
Soweit so gut. Was mich allerdings an Deinem Brief st&ouml;rt:<br>
Wie kann es laut Bibel &uuml;berhaupt etwas "wiederg&ouml;ttliches" geben?<br>
Steht nicht in der Sch&ouml;pfungsgeschichte, da&szlig; Gott alles geschaffen hat?<br>
Doch wenn Gott alles geschaffen hat, dann muss er doch auch "das B&ouml;se" geschaffen haben?<br>
Jetzt wirst Du vielleicht fragen "Aber warum sollte Gott das B&ouml;se erschaffen?"<br>
Nun, meine Antwort auf diese Frage w&uuml;rde lauten:
<CENTER><B>Kannst Du das Gute erkennen, ohne &uuml;ber das B&ouml;se bescheid zu wissen?<br>
Wie soll es etwas sch&ouml;nes geben, wenn man nicht weis was h&auml;&szlig;lich ist?<br>
W&uuml;rdest Du wissen wo Rechts ist, wenn Du nicht wei&szlig;t wo links ist?</B></CENTER>
Wie Du siehst leben wir in einer Welt der Bipolarit&auml;t, wo es das eine ohne das andere nicht geben k&ouml;nnte. So mag es zwar l&ouml;blich sein das schlechte zu bek&auml;mpfen, aber f&uuml;r mich ist es mehr als fraglich ob jemand dieses Ziel erreichen kann.Das f&uuml;hrt mich zu dem Schluss wie ich mir "unseren Chef" Vorzustellen habe. Das optimale Zeichen daf&uuml;r ist meiner meinung nach das Yin-Yang, was wohl jeder kennen wird. Auf unser Thema konkretisiert heisst das f&uuml;r mich folgendes:<br>
<UL>
<LI>Das Gesamtgebilde ist gleichzusetzen mit Gott.<br></LI>
<LI>Eine H&auml;lfte (meinetwegen die weisse, um das Christlich/Westliche Denkschema zu benutzen) ist gleichzusetzen mit "dem Guten" (Jesus etc.)</LI>
<LI>Die andere H&auml;lfte ist gleichzusetzen mit "dem B&ouml;sen" (Antichrist etc.)</LI>
</UL>
Zumindest f&uuml;r mich ergibt diese Sichtweise sehr viel mehr Sinn, und wiederspricht auch nicht den (zugegebenermassen wenigen) Teilen der Bibel die ich kenne. Auch ist dem nicht so, da&szlig; ich mit dieser Vorstellung alleine w&auml;re. Es gibt zum Beispiel in Indien extra Tempel f&uuml;r deren "b&ouml;sen" (leider ist mir der Name entfallen), wo aus eben diesen Gr&uuml;nden ganz offiziell "das B&ouml;se" angebetet wird.<br>
So, nun aber erstmal gut f&uuml;r heute, sonst ist ja kein Platz mehr f&uuml;r andere Texte. :)<br>
Ich hoffe mich diesmal etwas klarer Ausgedr&uuml;ckt zu haben, und hoffe da&szlig; Du meinen Argumenten wenigstens ein paar Gedanken schenkst. Und zwar nicht, weil ich missionieren m&ouml;chte, wie es das Christentum n&ouml;tig hatte, sondern weil ich hoffe noch ein bisschen diskutieren zu k&ouml;nnen. :)<br>
Bis dann, Sven Kalus<br>
<br>
<br>
<a name="nagash">An Nagash</a><br>
<br>
Sei gegr&uuml;&szlig;t ehrw&uuml;rdiger Nagash.<br>
Ich wollte mich nur mal kurz bei Dir bedanken, f&uuml;r das wunderbare Treffen. Ich hoffe da&szlig; auch im n&auml;chsten Jahr eins stattfindet, und werde dann auf jeden Fall wieder dabei sein. Aber da&szlig; habe ich Dir ja auch schon alles gesagt. Btw. Ich habe gerade nochmal in der NC #53 rumgest&ouml;bert, und habe entdeckt, da&szlig; Du meinen Diskussionsbeitrag "Hass" als No. One der NC #52 gew&auml;hlt hast. Dem entnehme ich, da&szlig; dieser Dir gefallen hat. :)<br>
Tja, und nun habe ich mich gefragt, ob ich Dich mal fragen sollte, ob Dich weitere Artikel in dieser Richtung interessieren w&uuml;rden, worauf ich mir gedacht habe "Tu¥s einfach mal".<br>
Und deshalb hier jetzt meine Frage an Dich: W&uuml;rden Dir weitere Artikel im Bereich Esoterik/Religion/meine Sichtweise der Dinge interessieren?<br>
Wenn Du diese Frage mit ja beantworten kannst/willst/musst/etc. dann z&ouml;gere nicht mir einfach mal so zum Spass oder auch Ernst in der n&auml;chsten/&uuml;bern&auml;chsten oder irgendeiner NoCover zu antworten. (Oh man, ich sollte wirklich mal aufh&ouml;hren meine Texte f&uuml;r die NC zwischen 2 und 6 Uhr nachts zu schreiben... :))<br>
Achja, noch etwas: Falls/Wenn die CD zum Clubtreffen rauskommt bitte sofort Nachricht an meinereiner. :)<br>
W&auml;re auch gut wenn ihr in das Tool-Verzeichnis nen guten Pic-Katalogisierer reint&auml;tet. Ich komme mit dem Aussortieren absolut nicht weiter. :)<br>
<br>
<br>
<a name="snoopy">An Snoopy</a><br>
<br>
Tachchen Snoopy so mal eben von Vogel zu Hund. :)<br>
Hast Du noch gut nach Hause gefunden? Ich nehme es einfach mal an, schliesslich hast Du ja auch den Weg zu mir hin gut gefunden. :)<br>
Auch an Dich noch mal ein Dankesch&ouml;n f&uuml;r Organisation des, sowie Fahrt zum Clubtreffen.<br>
Wo wir schonmal bei "Strassen" sind. War das Netzteil das richtige f&uuml;rs Modem? Und hast Du es wieder in Ordnung bringen k&ouml;nnen?<br>
<br>
P.S: Die 30 DM sollten inzwischen angekommen sein.<br>
<br>
<br>
<a name="dr">An dR.</a><br>
<br>
Tag Onkel Doc.<br>
Heute schon jemandes Gesundheit ruiniert? ;)<br>
Der Diskletter sollte eigentlich bis Du diese Zeilen hier liest (hoffentlich/endlich) zusammen mit den 10 DM da sein.<br>
Und sei mir nicht B&ouml;se wegen dem <a href="story_storygamesk.html">Story Game</a>. Ich kann ja auch nichts daf&uuml;r das ausgerechnet Du das Storygame.guide verfasst. Ich hoffe Du hast ein gutes HTML->AG konvertierungsproggie, welches die Links aufs entsprechende AG Equivalent umm&uuml;nzt. :)<br>
Wenn nicht bleibt mir nur noch Dir viel Spa&szlig; zu w&uuml;nschen. ;)<br>
Wenn wir gerade schonmal beim Thema sind: Ich hoffe Du machst mit den BG-Patterns vom Storygame.guide noch etwas. Teilweise sind die n&auml;mlich so schlecht gew&auml;hlt, da&szlig; zumindest ich die Texte kaum noch entziffern kann, wenn ich die Hintergr&uuml;nde nicht ausschalte.<br>
Aber ansonsten eine Geniale Idee. Hast Du vielleicht interesse das ganze noch in HTML rauszubringen?
K&ouml;nnte man dann noch mehr draus machen, imho. Ich w&uuml;rde Dir evtl. auch bei helfen.<br>
Naja, lassen wirs erstmal gut sein.<br>
ried ja<br>
<br>
<br>
<a name="Ziel">An NAME</a><br>
<br>
<br>
<a name="rr5t"></H3 align="CENTER">Roadrunners Five Tons</H3></a>
Auf Platz Nummero 5:
<CENTER>Story Game TNG - Von ???</CENTER>
Grosser Kritikpunkt: Wo steht der Name des Schreibers???<br>
<br>
Auf Platz 4 diese Woche im Angebot:
<CENTER>Magisch - Von Wolf Zimmer</CENTER>
Dazu kann ich nur sagen: Faszinierend. Hast Du noch mehr solcher Sachen auf Lager?<br>
<br>
Auf Platz 3 sitzt diesen Monat:
<CENTER>Abakus - Von Wolf Zimmer</CENTER>
Interessante Einf&uuml;hrung in die Geschichte und Matematik der wahrscheinlich &auml;ltesten "Computer" der Welt.<br>
<br>
Auf Platz 2 schmeisst sich:
<CENTER>Panik - Von Cord Hagen</CENTER>
Ein, meiner Meinung nach, gut &uuml;berlegter und einleuchternder Diskussionsbeitrag, zu dem ich erstmal nichts hinzuzuf&uuml;gen habe.<br>
<br>
Uuuund auf Platz 1 (Trommelwirbel):
<CENTER>AmigaLinux - Von Jan (Wo versteckt sich der Nachname? Such...Such..&Auml;hm, k&ouml;nnte es Britsch sein?)</CENTER>
Meiner Meinung nach ein sehr interessanter Artikel. Einziger Kritikpunkt bisher: WO IS DER VOLLST&Auml;NDIGE NAME? Wie soll man auf nen Artikel antworten, wenn nicht der Name beisteht? Muss ich jetzt extra ins I-Net Cafe um Dir eine Antwort zu schicken?<br>
<br>
<a href="mitglieder/kalus.html" target="mainFrame"><CENTER><IMG SRC="turr.jpg" ALT="the unbelivable Roadrunner" align=bottom>&#160;Sven Kalus</CENTER></a>
<HR>
<a name="mehr">Weitere Texte in dieser NoCover von mir:</a><BR>
<CENTER><a href="cd_hupdemocd.html">Die Haage+Paartner Demo-CD im Kurztest</a></Center>      
<CENTER><a href="help_cprogsk.html">Meinereiner braucht Hilfe, wer kann helfen?</a></Center>      
<CENTER><a href="story_storygamesk.html">Ein neuer Beitrag zum Geschichten-Spiel von eurem lieben R.R.</a></Center> 
<CENTER><a href="story_storygamesk1.html">Ein zweiter Story-Game Beitrag</a></Center>
<CENTER><a href="st_fc-manager.html">Feedback-Corner-Manager. Das neue Spiel von Roadrunner Inc. ;)</a></Center>
<CENTER><a href="st_gedicht.html">Ein kleines st&uuml;ckchen Lyrik in Gedichtform</a></Center>           
<CENTER><a href="st_liedtext.html">Der Text von "Wind of Change" nur f&uuml;r euch.</a></Center>          
<CENTER><a href="st_vorstsk.html">Eine Aktualisierte Vorstellung f&uuml;r die Mitgliederliste.</a></Center>           
<CENTER><a href="tips_biingcheat.html">Probleme mit Biing? Hiernach nichtmehr!</a></Center>      
<CENTER><a href="tips_hollypics.html">F&uuml;r jeden, dem Hollywood Pictures zu schwer ist...</a></Center>       
<CENTER><a href="tips_installhollypics.html">Hollywood Pictures will von Festplatte nicht laufen? Schau mal hier rein!</a></Center>
<CENTER><a href="tips_ncverteiler.html">Schau der Einfachheit halber mal rein.</a></Center>     
<BR>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</BODY>
</HTML>
