<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.05 [de] (Win95; I) [Netscape]">
   <META NAME="AUTHOR" CONTENT="Lars Philipsen">
   <META NAME="CREATED" CONTENT="19980803;21410488">
   <META NAME="CHANGEDBY" CONTENT="Lars Philipsen">
   <META NAME="CHANGED" CONTENT="19980803;21410488">
   <TITLE>Star Trek-FAQ</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" BACKGROUND="paper.jpg">
<FONT COLOR="#000000"><FONT SIZE=-1>[Lars Philipsen]</FONT></FONT>
<CENTER><BLINK><FONT COLOR="#000000"><FONT SIZE=+2>Star Trek-FAQ</FONT></FONT></BLINK><BR>
<BR></CENTER>

<CENTER><FONT COLOR="#000000"><FONT SIZE=+1>Hallo Trekkies und Nicht-Trekkies!
Mit diesem Artikel wollte ich einmal im Trek-Universum h&auml;ufig gestellte
Fragen und deren Antworten pr&auml;sentieren. Viel Spa&szlig; beim Schm&ouml;kern!</FONT></FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><I><FONT COLOR="#000000"><FONT SIZE=+0>Wie kommt es, dass man
w&auml;hrend eines Programms auf dem Holodeck nicht gegen eine Wand l&auml;uft?</FONT></FONT></I></B></CENTER>

<CENTER><FONT COLOR="#000000"><FONT SIZE=+0>W&auml;hrend einer Holodeck-Simulation
bewegt man sich zwischen holographischen Abbildungen und tats&auml;chlich
replizierten Objekten. Ein Kraftfeld auf dem Boden verhindert eine wirkliche
Fortbewegung. W&auml;hrend man geht, ver&auml;ndert sich die simulierte
Umgebung entsprechend. So wird ein Eindruck von Bewegung vermittelt.</FONT></FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><I><FONT COLOR="#000000"><FONT SIZE=+0>Warum haben die Klingonen
aus der Original-Serie nicht die ausgepr&auml;gte Stirn, die sie in den
Kinofilmen und den neuen Serien haben?</FONT></FONT></I></B></CENTER>

<CENTER><FONT COLOR="#000000"><FONT SIZE=+0>Leider gelang es nicht, einen
Klingonen um eine Stellungname zu bewegen. Wie Worf schon in der DS9-Folge
„Immer die Last mit den Tribbles“ sagte, er&ouml;rtern Klingonen dieses
Thema nicht mit Au&szlig;enstehenden. Tats&auml;chlich aber lag es an den
damaligen Budgetbeschr&auml;nkungen, die die Produzenten zwang, bei der
Maske kostenm&auml;&szlig;ig auf dem „Teppich zu bleiben“. Au&szlig;erdem
w&auml;re das Fernsehpublikum der 60-er Jahre mit zu viel Maskerade '&uuml;berfordert'
gewesen.</FONT></FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><I><FONT COLOR="#000000"><FONT SIZE=+0>Wie hei&szlig;t der Schauspieler,
der Spocks Vater Sarek spielte und in welchen Episoden tauchte er auf?</FONT></FONT></I></B></CENTER>

<CENTER><FONT COLOR="#000000"><FONT SIZE=+0>Spocks Vater, der vulkanische
Botschafter Sarek, wurde von Mark Lenard gespielt. Zuerst war in der Original-Episode
„Reise nach Babel“ als Sarek zu sehen, danach trat er im dritten, vierten
und sechsten Kinofilm auf. In den TNG-Folgen "Botschafter Sarek" und "Wiedervereinigung?,
Teil 1" kehrte er zur&uuml;ck. Mark Lenard war aber auch in anderen Rollen
zu sehen: Er spielte den ersten Romulaner, der je in Star Trek zu sehen
war (Original-Folge "Spock unter Verdacht"). Des weiteren verk&ouml;rperte
er einen klingonischen Commander im ersten Kinofilm. Leider erlag Mark
Lenard im November 1996 den Folgen eines Krebsleidens.</FONT></FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><I>Auf welcher Grundlage basiert die klingonische Sprache?</I></B></CENTER>

<CENTER>Zuesrt gab es kein konkretes Konzept, lediglich der charakteristische
kehlige Klang wurde schon gepr&auml;gt. Diese Laute wurden von James Doohan
(Montgomery Scott/'Scotty'). In TNG bediente man sich dann bereits der
komplett von Marc Okrand entwickelten Sprache. Zahlreiche Werke wurden
schon ins Klingonische &uuml;bersetzt (z.B. Hamlet; an der &Uuml;bersetzung
der Bibel und Macbeth wird zur Zeit gearbeitet. Das offizielle W&ouml;rterbuch
Klingonisch-Deutsch/Deutsch-Klingonisch von Marc Okrand (ISBN 3-89365-544-1)
ist im Handel erh&auml;ltlich.</CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<CENTER><B><I>Wie viele Raumschiffe mit dem Namen Enterprise gab es?</I></B></CENTER>

<CENTER>Bisher gab es sechs Raumschiffe mit dem Namen Enterprise. Die NCC-1701,
bekannt aus der Original-Serie, nahm 2245 ihren Dienst auf. F&uuml;r die
Kinofilme wurde sie &uuml;berarbeitet und 2285 von James T. Kirk zerst&ouml;rt
(Star Trek III), um die &Uuml;bernahme durch die Klingonen zu verhindern.
Die Enterprise NCC-1701-A lief 2286 vom Stapel und kam in den Kinofilmen
IV,V und VI vor. In "Treffen der Generationen" wurde die Enterprise B eingef&uuml;hrt
(2293). &Uuml;ber die NCC-1701-C ist nicht viel bekannt, sie wurde bei
der Verteidigung eines klingonischen Au&szlig;enpostens im Jahr 2344 zerst&ouml;rt
(TNG-Episode "Die alte Enterprise"). 2363 wurde die aus TNG bekannte Enterprise
D in Dienst gestellt, welche dann im Kinofilm "Treffen der Generationen"
zerst&ouml;rt wurde. Die aktuelle NCC-1701-E wurde im Kinofilm "Der erste
Kontakt" eingef&uuml;hrt.<BR>
<BR>
<B>Bis dann...euer</B></CENTER>

<CENTER><A HREF="mailto:LarsPh@cityweb.de"><IMG SRC="Lph.jpg" HEIGHT=80 WIDTH=144></A></CENTER>

</BODY>
</HTML>
