<html>
<head>
<meta name="description" content="Wolf-INFO">
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="st_wolfinfo.gif" TEXT=black link=blue alink=red bgcolor="#FFFFCC">
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO Nachtrag</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" width="100%" bgcolor="#808080"><font
color="#0000FF" size="3" face="arial"><b>
nur ein Nachtrag
</b></font></td>
</tr>
</table>

<table border="0" cellpadding="3" cellspacing="3" width="100%">
<tr>
<td valign="top" bgcolor="#C0C0C0"><font color="#000080"><b>Inhalt</b></font>
<p><a href="#a4"><font size="1" face="arial">Meine Homepage
</font></a></p>
<p><a href="#a5"><font size="1" face="arial">Erg&auml;nzung
</font></a></p>

<p><center> <a href="Mitglieder/zimmer.html">
<img src="st_wolfinfo.jpg" width=90 height=90 border=0></a><br><br><br>
<font size="2"> eMail: </font> <a href="mailto:wozim@t-online.de">
<font size="1" face="arial">wozim@t-online.de</font></a>
</center></p><br>
<p><a href="NoCover.html"><font size="1" face="arial">Zurück zum NoCover-Index
</font></a></p>
</td>
<td valign="top">
<a name="a4"><font color="800000" size="7"><center>
<b>Meine Homepage</font></b></a></center></p>
<p>
Seit Mitte August habe ich meine eigene Homepage installiert und nun warte ich
auf eine rege Besucherschaft, die sich auch im G&auml;stebuch verewigen darf.
Aber dies ist beileibe keine Pflicht. Aber &uuml;ber ein paar nette Worte freue
ich mich immer. Die Adresse:<br><br> <center><font color="800000"
size="+2">&lt;http://home.t-online.de/home/wozim/&gt;</font></center></p>
<p>
Hier habe ich das Grundgerüst des NoCover Indexes vorgestellt und damit der
weitere Aufbau ersichtlich ist, habe ich die CD-Theke komplett (siehe Stichtag)
belassen. Weiter sind in der Rubrik &quot;Autoren&quot; nur die Daten &uuml;ber
meine Person enthalten. Das Gesamtwerk umfasst derzeit ein Volumen von 2,25 MB
ungepackt und ist noch nicht in allen Kapiteln fertig.</p>
<p>
Als zweite Guide ist &quot;Der Wald&quot; als HTML-Datei aufgezeigt. Der Text
ist komplett, nur alle Bilder habe ich aus Platzgr&uuml;nden weggelassen. Sie
sind in der Originaldatei nochmals seitenf&uuml;llend zu betrachten. Aus diesem
Grunde betr&auml;gt der Gesamtumfang dieser Arbeit auch 2.45 MB. Eine Homepage
bei T-Online ist bis zu 1 MB im Preis für den Internetzugang mit enthalten und
somit kostenlos. Erst dar&uuml;ber wird eine monatliche Miete f&auml;llig.</p>
<p>
Es ist auch eine Rubrik &quot;Links&quot; vorhanden. Hier nehme ich aber nur
private Homepages auf und auch nur solche, die die Erlaubnis hierf&uuml;r geben.
Also wer hier mit aufgenommen werden will, mu&szlig; sich schon bei mir mittels
eMail melden.</p></td></tr></table>

Gehe &#160; <a href="#top"> zum Anfang </a>
<hr color="#FF00FF" size="1" width=75%>

<p><a name="a5"><font color="800000" size="7"><center>
<b>Ergänzung zu meinem Aufruf<br>(HTML-Layout)</font></b></a></center></p>
<p>
In meinem Beispiel habe ich nur den Aspekt der Meta-Angabe berücksichtigt ohne
auf die Möglichkeit eines Kommentars einzugehen. In Meta-Angaben k&ouml;nnen
n&auml;mlich verschiedene n&uuml;tzliche Anweisungen f&uuml;r WWW-Server,
WWW-Browser und automatische Suchprogramme im Internet angegeben werden. Diese
sind <b>nicht</b> f&uuml;r pers&ouml;nliche Anmerkungen oder Kommentare zum
Quelltext der HTML-Datei gedacht. F&uuml;r solche Angaben gibt es
die M&ouml;glichkeit, einen <b>Kommentar</b> zu definieren. Und das sieht
folgenderma&szlig; aus.</p>
<p>
<h3>Beispiel 1:</h3><center>
<table width=80% cellpadding=3>
<tr><td bgcolor=#FFFFE0><pre>
     &lt;!-- Dieser Text ist ein Kommentar --&gt;
<br></pre></td></tr></table></p></center><br>
<p>
<h3>Beispiel 2:</h3><center>
<table width=80% cellpadding=3>
<tr><td bgcolor=#FFFFE0><pre>
     &lt;!-- Erste Zeile eines mehrzeiligen Kommentars
     Letzte Zeile des Kommentars //--&gt;
<br></pre></td></tr></table></p></center><br>
<p>
<h3 class="xpl">Erl&auml;uterung:</h3>
Kommentare werden durch die Zeichenfolge <font color="#FF000"><b> &lt;!-- </b>
</font> eingeleitet. Dahinter folgt beliebig langer Kommentartext. Ein
einzeiliger Kommentarbereich durch die Zeichenfolge <font color="#FF000"><b>
--&gt; </b></font> beendet, ein mehrzeiliger Kommentarbereich durch <font
color="#FF000"><b> //--&gt; </b></font>. <br> Kommentare werden von WWW-Browsern
ignoriert, d.h. bei der Pr&auml;sentation nicht angezeigt.</p>
<p>
<h3>Tip:</h3>
W&auml;hrend an einer Datei gebastelt wird, werden h&auml;ufig verschiedene
HTML-Befehle, Farbangaben usw. getestet und ausprobiert. Dabei ist es hilfreich,
bisherige L&ouml;sungen vor dem Ausprobieren einer neuen L&ouml;sung nicht
einfach zu &uuml;berschreiben, sondern in einen Kommentar-Befehl zu setzen. So
muss sich keiner &auml;rgern, wenn etwas &uuml;berschrieben wurde, was
eigentlich doch besser war als das, womit es &uuml;berschrieben wurde.</p>

Gehe &#160; <a href="#top"> zum Anfang </a> oder <a href="NoCover.html">
Zum Inhaltsverzeichnis der NoCover</a>.
<hr color="#FF00FF">
</body>
</html>

