<html>
<head>
<meta name="description" content="Wolf-INFO">
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="st_wolfinfo.gif" TEXT=black link=blue alink=red bgcolor="#FFFFCC">
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" width="100%" bgcolor="#808080"><font
color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td>
</tr>
</table>

<table border="0" cellpadding="3" cellspacing="3" width="100%">
<tr>
<td valign="top" bgcolor="#C0C0C0"><font color="#000080"><b>Inhalt</b></font>
<p><a href="#a1"><font size="1" face="arial">LINUX-Artikel
</font></a></p>
<p><a href="#a3"><font size="1" face="arial">CompuServ-Urteil
</font></a></p>
<p><a href="#a2"><font size="1" face="arial">Anliegen
</font></a></p>

<p><center> <a href="Mitglieder/zimmer.html">
<img src="st_wolfinfo.jpg" width=90 height=90 border=0></a><br><br><br>
<font size="2"> eMail: </font> <a href="mailto:wozim@t-online.de">
<font size="1" face="arial">wozim@t-online.de</font></a>
</center></p><br>
<p><a href="NoCover.html"><font size="1" face="arial">Zurück zum NoCover-Index
</font></a></p>
</td>
<td valign="top"><a name="a1"><font color="800000" size="7"><center>
<b>Anmerkungen zum Artikel:<br> LINUX und die Zukunft des Amiga</font></b></a></center><br>
<p>
Seit Bestehen der NoCover wird teils qualifiziert, aber gr&#246;&#223;erenteils
unqualifiziert auf dem Thema Amiga gegen PC herumgeritten, sodass diese Artikel
schon nicht mehr lesbar sind. Mit zunehmender Ungewissheit &#252;ber die Zukunft des
Amiga ist ein klein wenig Ruhe an dieser Front eingekehrt, trotzdem flackert hin
und wieder das Feuer mit Durchhalteparolen auf. Nun hat sich ein reinrassiger
PC-User zu diesem Thema gemeldet und zeigt aus seiner Sicht eine M&#246;glichkeit
auf, dem Amiga in die Zukunft zu verhelfen.</p>
<p>
Der Autor Jan Andres (seinen Namen habe ich &#252;ber eMail erfahren) hat sich gro&#223;e
M&#252;he gegeben, das Thema Linux auf der Amigaplattform zu erl&#228;utern und dies als
Alternative zum reinen Amiga-OS anzupreisen. Er bat mich folgenden Passus in
meinem Statement mit aufzunehmen:</p>
<p>
...... ich wollte mich noch mal f&#252;r meine &#196;u&#223;erung zum Thema p5's PPC-Karten in
dem Artikel entschuldigen (von wegen da&#223; die Software nicht ohne den 68k-Task
auskommt), bin inzwischen eines besseren belehrt worden...... </p>
<p>
Wenn ich mich nicht t&#228;usche, wurde schon 1991 dar&#252;ber berichtet, wie der Amiga
als UNIX-Plattform zu nutzen ist. Warum bisher dieses Thema nicht in gr&#246;&#223;erem
Ma&#223;stab aufbereitet wurde, wei&#223; ich nicht. Dazu bin ich viel zu wenig Inseiter
und habe mich selbst bisher mit dieser M&#246;glichkeit nie befasst. Deshalb sehe ich
mich auch au&#223;er Stande, den Inhalt dieses Artikels zu bewerten. Mir gefiel nur,
wie ein Nichtamiganer den Amigauser aufzeigt, seinen Frust &#252;ber die Zukunft
des Amiga nicht nur in Platit&#252;ten abzulassen, sondern konkrete und durchdachte
Vorstellungen zu definieren, ob richtig oder falsch spielt hier &#252;berhaupt keine
Rolle.</p></td></tr></table>
<p>
Bisher sind zwei Artikel in der NoCover erschienen<br>
<ul>
<li> Unix am Amiga (NC-04 Tools Theke)
<li> Unix Workshop (NC-39 Workshop)
</ul></p>
<p>
Der Artikel in NoCover-04 von Axel Melzener ist eine Umsetzung des Artikels von
Markus Illenseer erschienen in Amiga Plus-Magazin 4/94, (c) 1994 ICP-Verlag
und lautete: Das Betriebssystem NetBSD: UNIX-MASCHINE AMIGA?</p>
<p>
Der Workshop in NoCover-39 von Michael Thaler ist leider bei dem Teil 1
geblieben. Sein Schlusssatz lautet:</p>
<p>
So, damit w&#228;ren wir auch schon am Ende des ersten Teils meines UNIX-Kurses
angelangt. Diesmal habe ich &#252;ber die Hardware, auf der UNIX l&#228;uft, geschrieben
und n&#228;chsten Monat werde ich etwas &#252;ber die Geschichte des Betriebssystems UNIX
selbst schreiben.</p>
<p>
Und mit diesen Grundlagen gehts dann in der &#252;bern&#228;chsten NoCover ans eingemachte
und ich werde etwas &#252;ber die UNIX-Befehle, ihre Anwendung und die Parameter
schreiben. Wirklich festgelegt habe ich mich aber mit der Reihenfolge noch
nicht, wenn ich es f&#252;r n&#246;tig halte, werde ich sie einfach &#228;ndern.</p>
<p>
Und das hat Michael Thaler leider auch getan. Er hat beide Artikel nicht mehr
ver&#246;ffentlicht. Was ich sehr sehr schade fand.</p>
Gehe &#160; <a href="#top"> zum Anfang </a>
<hr color="#FF00FF" size="1" width=75%>

<p><a name="a3"><font color="800000" size="7"><center>
<b>CompuServ-Urteil liegt vor</font></b></a></center><br>
<p>
Zur Erg&#228;nzung der Wolf-INFO in NoCover 53 einen Auszug aus den Medien-News des
deutschen Jornalisten Forums vom 03.08.98:<br>
Die mit Spannung erwartete Begr&#252;ndung zum Urteil gegen den ehemaligen
Gesch&#228;ftsf&#252;hrer von CompuServe Deutschland, Felix Somm, liegt jetzt vor. Das
Amtsgericht M&#252;nchen hatte Felix Somm im Mai f&#252;r die strafbare Verbreitung von
pornographischem Material verantwortlich gemacht und zu einer Freiheitsstrafe
von zwei Jahren auf Bew&#228;hrung verurteilt. Das Urteil des Amtsgerichts M&#252;nchen
(Az.: 8340 Ds 465 Js 173158/95) steht im Volltext in der Bibliothek &quot;Ethik
&amp; Recht&quot; des <a href="http://forum.compuserve.de/dtjournal">
<font size="2">Deutsche Journalisten Forums</font></a>,
au&#223;erdem eine Stellungnahme der Verteidigung.</p>
<p>Gelinde gesagt verwundert es mich etwas. dass ich in der NoCover-54 keinerlei
Feedback &#252;ber diesen doch gravierenden Vorgang gelesen habe.</p>
Gehe &#160; <a href="#top"> zum Anfang </a>
<hr color="#FF00FF" size="1" width=75%>

<p><a name="a2"><font color="800000" size="7"><center>
<b>Anliegen an die Autoren</font></b></a></center><br>
<p>
Aus gegebenen Anlass nochmals meinen Aufruf!<br>
Wie es sich wohl herumgesprochen haben wird, bin ich zur Zeit dabei, einen Index
f&#252;r die NoCover Ausgaben in HTML zu erstellen. Dabei mu&#223; ich leider feststellen,
dass in letzter Zeit &#246;fter ein Artikel oder Test keinem Autor zugeschrieben
werden kann. Dies ist bestimmt keine b&#246;se Absicht. Ich nehme an, dies ist eher
ein unbeabsichtigtes Versehen, als ein vors&#228;tzliches Vergessen. Dies kann aber
sehr leicht gel&#246;st werden. Wenn im Kopf der Dummydatei der Autor sich verewigt
hat, wird dies in all seinen Artikeln mit &#252;bernommen. Ich schlage vor, so wie
im folgenden Beispiel zu verfahren und schon gibt es keinerlei Schwierigkeiten
mehr.</p>
&lt;html&gt;<br>
&lt;head&gt;<br>
&lt;meta name=&quot;description&quot; content=&quot;Wolf-INFO&quot;&gt;<br>
&lt;meta name=&quot;author&quot; content=&quot;Wolf Zimmer&quot;&gt;<br>
&lt;titel&gt;Wolf-INFO&lt;/title&gt;<br>
&lt;/head&gt;<br>
&lt;body&gt; &#160;  und so weiter</p>


Gehe &#160; <a href="#top"> zum Anfang </a> oder <a href="NoCover.html">
Zum Inhaltsverzeichnis der NoCover</a>.
<hr color="#FF00FF">
</body>
</html>

