<HTML>
<HEAD>
<TITLE>Roadrunners Story-Gamestunde</TITLE>
</HEAD>
<BODY background="l_bg.gif" TEXT=black link=blue alink=red bgcolor="#dddddd">
<a href="#mehr">Was noch auﬂer diesem Text in dieser NoCover von mir steht</a>
<HR>
<BR>
Und, weils so sch&ouml;n ist, hier mal wieder ein neuer Teil des Story-Games. Fortsetzten werde ich den Teil <B>Das B&ouml;se</B> von <a href="mitglider/kruse.html" target="mainFrame">dR.</a>, welches in der NoCover #50 erschienen ist.<BR>
Dieser Teil tr&auml;gt den Namen:<BR>
<H2 align=center>Die Apokalypse</H2><BR>
<HR noshade width=90% size=5 color=silver>
<BR>
<H3 align=right> Teil I: Die Flucht</H3><BR>
Langsam wurde es wieder heller und ich konnte wieder etwas sehen. Oder gew&ouml;hnten sich blos meine Augen an die hier fast alles beherschende Dunkelheit? Egal, dachte ich mir, und schob diesen Gedanken beiseite. Was jetzt wichtig war, war das ich meine Lage auskundschafften musste. Wo war ich hier? Was ist das f&uuml;r ein gl&uuml;hen dort am Horizont? Und wie kam ich wieder hier weg? Als ich so weit mit meinen Gedanken war, merkte ich, da&szlig; das gl&uuml;hen auf mich zukam, und immer gr&ouml;&szlig;er wurde. Aber komischerweise wurde das Licht nicht heller, sondern wurde eher schw&auml;cher, je n&auml;her es kam. Ich sp&uuml;rte langsam Panik in mir aufsteigen, welche langsam das gef&uuml;hl des absolut b&ouml;sen beiseite schob. &quot;Reiss Dich zusammen,&quot; sagte ich in Gedanken zu mir.&quot;Was soll Dir schon passieren, dies hier ist wahrscheinlich nur ein besonders schlechter Alptraum&quot; versuchte ich mir einzureden, was mir aber nicht gelang. Irgendetwas sagte mir, da&szlig dies hier absolut real war. Mittlerweile war das Licht schon auf ca. 200 Meter herangekommen, soweit ich das in dieser d&auml;mmerung sehen konnte. Nun ergriff die Panik vollends Besitz von mir, und ich rannte scheiend davon. Doch seltsamerweise konnte ich nicht einen laut h&ouml;hren. Es war so, als w&uuml;rde die Dunkelheit jegliches Ger&auml;usch schlucken. Nachdem ich einige Zeit gerannt war, mir kams vor wie 2 Stunden, obwohl es wahrscheinlich nur 2-3 Minuten gewesen waren, blickte ich nach hinten, und sah, da&szlig; das Licht mitlerweile nur noch h&ouml;chstens 10 Meter entfernt war. In panischer Angst versuchte ich einen Haken zu schlagen, schlug aber gegen eine Art unsichtbarer Mauer, wodurch ich zu Boden st&uuml;rtzte. Ich lag kaum auf den Boden, da war das Licht auch heran, und ich wurde mit unvorstellbarer Wucht davongeschleudert. Dann verlor ich das Bewusstsein.<BR>
<BR>
<H3 align=right>Teil II: Die Heilung</H3>
<BR>
Als ich wieder zu mir kam, merkte ich, da&szlig; ich mich nichtmehr Bewegen konnte. Das schien allerdings nicht daran zu liegen, da&szlig; ich gel&auml;hmt war, wie ich im ersten Schreck glaubte, sondern es schien als h&auml;tte man mich in einen Stahlklotz eingegossen. Verst&auml;rkt wurde dieser Eindruck dadurch, da&szlig; ich immernoch nichts sehen konnte. Allerdings konnte ich wieder h&ouml;hren, und das erste was ich wahrnehmen konnte, war eine art Musik. Allerdings war es mehr so etwas wie eine Symphonie aus h&ouml;nischem Gel&auml;chter, schrecklichen, disharmonischen Fl&ouml;tenlauten und einer grausam lauten Dudelsack Komposition, was wohl nur von jemandem geschrieben sein konnte, der dem Wahnsinn verfallen war. Hinzu kamen mehrere verschiedene Stimmen, die alle durcheinander zu sprechen schienen. Das einzige was ich immer wieder raush&ouml;hren konnte waren die Worte Pentagramm, Hexen und Antichrist. Pl&ouml;tzlich verstummten alle Ger&auml;usche, und ein Schatten trat neben mein Lager, oder zumindest das, was dieses darstellen sollte. Dann konnte ich eine tiefe, rauchige Stimme vernehmen, welche zu mir sagte: &quot;Sieh einer an. Unser Gast ist wieder bei Bewustsein. Ich hoffe Dir geht es wieder einigermassen gut, wir brauchen Dich n&auml;mlich noch. Nein, keine Fragen, daf&uuml;r ist es noch zu fr&uuml;h. Du musst vorher noch gesund werden, also schlaf jetzt noch etwas.&quot; Bevor ich auch nur den Versuch machen konnte meinen Mund zu &ouml;ffnen um eine Frage zu stellen, verlor ich auch schon wieder das Bewusstsein. Das n&auml;chste, was ich mitbekommen hatte, ich hatte mitlerweile nichtmehr die geringste Ahnung, wieviel Zeit inzwischen verstrichen war, war das ich in einer Art H&ouml;hle wach wurde, und mich sowohl wieder bewegen konnte, als auch wieder sehen konnte. Ich f&uuml;hlte mich sogar eigenartig stark, viel st&auml;rker als je zuvor in meinem Leben.
Ausserdem nahm ich s&auml;mtliche Farben in einer eigent&uuml;mlich intensiven weise wahr, und um jeden Gegenstand den ich erkennen konnte lag ein seltsamer weisslicher Nebel, der unm&ouml;glich von den Gegenst&auml;nden selber ausgehen konnte.
Kaum hatte ich mich grob Orientiert, Kam auch schon eine eigenartige Gestalt in mein Blickfeld. Er sah aus wie eine Mischung zwichen Gott und Teufel. Auf einem K&ouml;rper, der aussah wie der von Satan pers&ouml;nlich steckte ein Kopf, der eigentlich nur mit wahrhaft g&ouml;ttlich beschrieben werden konnte. Dann fing die Gestalt mit einer sehr wohlklingenden, sonoren Stimme an zu sprechen.<BR>
<BR>
<H3 align=right>Teil III: Die Aufkl&auml;rung</H3>
<BR>
&quot; Hallo mein Freund. Wie ich sehe bist Du wieder gesundet. Jetzt ist es an der Zeit Dich Aufzukl&auml;ren. Ich weiss Du wirst viele Fragen haben, doch warte mit diesen bis ich ausgesprochen habe. Doch eines vorweg: Du bist der Held auf den wir gewartet haben. seit fast 2000 Jahren bist Du der erste, der das schaffen kann, woran Dein Vorg&auml;nger gescheitert ist. Darum streube Dich nicht, sonst werden wir endg&uuml;ltig verlieren, und Deine Welt wird dem gr&ouml;&szlig;tem Schwindler den es je gab zum Opfer fallen. Das meisste wird Dir wohl Verr&uuml;ckt vorkommen, da es gegen das verst&ouml;sst, was euch Menschen seit Jahrtausenden gelehrt wird. Doch Du wirst Dich davon &uuml;berzeugen k&ouml;nnen, da&szlig; unsere Sache die richtige ist. Doch nun zur versprochenen Aufkl&auml;rung. Wir sind ein Geheimorden, der schon seit &uuml;ber 3000 Jahren existiert. Unsere Aufgabe ist es, Eure Welt wieder von den L&uuml;gen unserer wiedersacher zu befreien, in die ihr schon seit anbeginn eurer Erschaffung hineingeboren werdet. Das was bei Euch als Gott bezeichnet wird ist niemand anderes als das Wahre b&ouml;hse, welches es durch t&auml;uschung und l&uuml;gen leider immer wieder schafft seine wahre identit&auml;t zu leugnen. Da&szlig;, was Du erlebt hast, bevor wir Dich hierhin geholt haben, war nur ein kleiner Vorgeschmack auf da&szlig;, was kommen wird, falls unsere Sache scheitern sollte, was sie bestimmt wird, wenn Du uns nicht hilfst. Doch genug f&uuml;r heute, Du solltest jetzt erstmal &uuml;ber das bisher erz&auml;hlte nachdenken. Daf&uuml;r werden wir Dich in Deine Welt zur&uuml;ckschicken. Wenn Du zu einer Entscheidung gekommen bist. Doch gib acht! Der Gegner wird sich garantiert bei Dir melden, und Dich weiterhin mit seinen L&uuml;gen &uuml;berfluten, damit Du nicht zum Nachdenken kommen kannst.&quot;<BR>
<BR>
<H3 align=right>Teil IV: Der W&auml;chter</H3>
<BR>
Gustav Bremerkamp stand, wie immer, morgens um 5 mit den H&uuml;hnern auf. Er war in der, f&uuml;r die meisten Menschen beneidenswerten, Lage in einem 200 Seelendorf in einer sehr reizvollen Landschafft, zu wohnen, was er pers&ouml;hnlich aber ehr als eine pers&ouml;hnliche Strafe ansah, da in dieser Gegend so gut wie nichts passierte. Aber leider kam er hier nicht weg. Gustav hatte es schon mehrfach versucht, allerdings war er immer wieder durch irgendwelche Umst&auml;nde in diesem Kaff gelandet. Doch diesmal hatte er sich gen&uuml;gend vorbereitet, und war fest entschlossen diesmal nicht wiederzur&uuml;ck zukommen. Eigentlich wollte er auch schon l&auml;ngst abgereist sein, allerdings hatte er das Gef&uuml;hl noch irgendetwas vor seiner abreise erledigen zu m&uuml;ssen. Er wusste nur nicht was.
<BR>
<HR noshade width=90% size=5 color=silver>
<BR>
Ich  hoffe einem von Euch f&auml;llt dazu eine Fortsetzung ein, Ich, f&uuml;r meinen Teil, nehme mir hier auf jeden Fall die Freiheit einfach so hier Schlu&szlig; zu machen. :)<BR>
<BR>
Also viel Spass beim Schreiben,
<a href="mitglieder/kalus.html" target="mainFrame"><CENTER><IMG SRC="turr.jpg" ALT="the unbelivable Roadrunner" align=bottom>&#160;Sven Kalus</CENTER></a>
<HR>
<a name="mehr">Weitere Texte in dieser NoCover von mir:</a><BR>
<CENTER><a href="cd_hupdemocd.html">Die Haage+Paartner Demo-CD im Kurztest</a></Center>      
<CENTER><a href="help_cprogsk.html">Meinereiner braucht Hilfe, wer kann helfen?</a></Center>      
<CENTER><a href="leser_svenk.html">Meine kleine, aber feine Leserbriefecke.</a></Center>       
<CENTER><a href="story_storygamesk.html">Ein neuer Beitrag zum Geschichten-Spiel von eurem lieben R.R.</a></Center> 
<CENTER><a href="st_fc-manager.html">Feedback-Corner-Manager. Das neue Spiel von Roadrunner Inc. ;)</a></Center>
<CENTER><a href="st_gedicht.html">Ein kleines st&uuml;ckchen Lyrik in Gedichtform</a></Center>           
<CENTER><a href="st_liedtext.html">Der Text von "Wind of Change" nur f&uuml;r euch.</a></Center>          
<CENTER><a href="st_vorstsk.html">Eine Aktualisierte Vorstellung f&uuml;r die Mitgliederliste.</a></Center>           
<CENTER><a href="tips_biingcheat.html">Probleme mit Biing? Hiernach nichtmehr!</a></Center>      
<CENTER><a href="tips_hollypics.html">F&uuml;r jeden, dem Hollywood Pictures zu schwer ist...</a></Center>       
<CENTER><a href="tips_installhollypics.html">Hollywood Pictures will von Festplatte nicht laufen? Schau mal hier rein!</a></Center>
<CENTER><a href="tips_ncverteiler.html">Schau der Einfachheit halber mal rein.</a></Center>     
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</BODY>
</HTML>
