<HTML>
<HEAD>
<TITLE>Roadrunners Manipulationsstunde</TITLE>
</HEAD>
<BODY background="l_bg.gif" TEXT=black link=blue alink=red bgcolor="#dddddd">
<a href="#mehr">Was noch au▀er diesem Text in dieser NoCover von mir steht</a>
<HR>
<BR>
Hall&ouml;chen.<BR>
Heute habe ich was ganz besonderes f&uuml;r Euch. Ich werde Euch n&auml;mlich verraten, wie man Biing! so modifizieren kann, da&szlig; s&auml;mtliche Geb&auml;udeeinheiten nichts kosten, und keine Parzellen mehr verbrauchen.<BR>
Dazu braucht man als allererstes mal einen Hex-Editor. Ich verwende dazu <B>HexED</B>von <B>Nicola Salmoria</B>, welches zwar schon etwas &auml;lter ist, mir jedoch bisher am besten zusagt.<BR>
Danach solltet ihr eine Sicherheits-Kopie der Datei <B>bipro</B> machen, welche sich im Biing! Hauptverzeichnis befindet, damit falls ihr einen Fehler macht ihr nicht direkt das ganze Spiel neu installieren m&uuml;sst.<BR>
Wenn Ihr die Sicherheitskopie gemacht habt, startet ihr Euren Hex-Editor und ladet die Datei <B>bipro</B>. Dann geht ihr zur Position <B>53BCE</B> oder sucht nach <B>Kli_nik</B> bzw. dem Hexadezimalem &Auml;quivalent <B>4B6C695F6E696B</B> (siehe auch Tabelle 1.). Dort sollte man folgendes sehen:
<TABLE align=center>
<TR>
<TH colspan=5><B>Tabelle 1. - Vorher:</B>
</TR>
<TR>
<TD colspan=4 align=center><B><U>Hex-Werte</U></B></TD>
<TD align=right><B><U>ASCII-Zeichen</U></B></D>
</TR>
<TR>
<TD></TD>
<TD></TD>
<TD></TD>
<TD align=right><TT>4B6C</TT></TD>
<TD align=right width=175><TT>Kl</TT></TD>
</TR>
<TR>
<TD><TT>695F6E69</TT></TD>
<TD><TT>6B2D4772</TT></TD>
<TD><TT>756E645F</TT></TD>
<TD><TT>65696E5F</TT></TD>
<TD align=right><TT>i_nik-Grund_ein_</TT></TD>
</TR>
<TR>
<TD><TT>68656974</TT></TD>
<TD><TT>24242424</TT></TD>
<TD><TT>24242424</TT></TD>
<TD><TT>00<B>32</B><U>01F4</U></TT></TD>
<TD align=right><TT>heit$$$$$$$$и<B>2</B><U>иЗ</U></TT></TD>
</TR>
<TR>
<TD><TT>00000000</TT></TD>
<TD><TT><I>03</I>FF0000</TT></TD>
<TD><TT>01010004</TT></TD>
<TD><TT>00050000</TT></TD>
<TD align=right><TT>ииии<I>и</I> ииииииииии</TT></TD>
</TR>
<TR>
<TD><TT>00000000</TT></TD>
<TD><TT>00000000</TT></TD>
<TD><TT>0000</TT></TD>
<TD></TD>
<TD align=right><TT>ииииииииии&#160;&#160;&#160;&#160;&#160;&#160;</TT></TD>
</TR>
</TABLE>
<BR>
In dieser Tabelle habe ich ein paar Stellen unterschiedlich markiert. Und das sind auch die stellen, auf die es uns ankommt. Das <B>Fett</B> markierte ist der Mietpreis, das <U>Unterstrichen</U> markierte ist der Kaufpreis und das <I>Invertiert</I> markierte ist die anzahl der Parzellen, die die Geb&auml;udeeinheit kostet/ben&ouml;tigt. Die befinden sich bei allen Geb&auml;udeeinheiten an der selben stelle. Also der Mietpreis jeweils an <B>2.</B> Stelle nach den $-Zeichen, der Kaufpreis jeweils an <B>3.-4.</B> Stelle hinter den $-Zeichen und die Anzahl der ben&ouml;tigten Parzellen jeweils an <B>9.</B> Stelle hinter den $-Zeichen.Nun k&ouml;nnen wir anfangen die Datei zu manipulieren. Wir Tragen einfach anstelle der bisherigen Zeichen jeweils im <B>Hex-Bereich <U>00</U></B> ein, so wie es in <B>Tabelle 2.</B> zu sehen ist. Dies k&ouml;nnen wir nun bei allen gew&uuml;nschten Geb&auml;deeinheiten wiederholen. Ich w&uuml;rde allerdings empfehlen nicht s&auml;mtliche Einheiten zu &auml;ndern, sondern nur die Luxus-Einheiten, weil man sich so die h&auml;lfte der Arbeit sparen kann.<BR>
Dadurch erreihen wir, wie schon gesagt, das diese sowohl beim Mieten, als auch beim Kaufen kostenlos sind und auch keine Parzellen mehr ben&ouml;tigen.<BR>
<BR>
<TABLE align=center>
<TR>
<TH colspan=5><B>Tabelle 2. - Nachher:</B>
</TR>
<TR>
<TD colspan=4 align=center><B><U>Hex-Werte</U></B></TD>
<TD align=right><B><U>ASCII-Zeichen</U></B></D>
</TR>
<TR>
<TD></TD>
<TD></TD>
<TD></TD>
<TD align=right><TT>4B6C</TT></TD>
<TD align=right width=175><TT>Kl</TT></TD>
</TR>
<TR>
<TD><TT>695F6E69</TT></TD>
<TD><TT>6B2D4772</TT></TD>
<TD><TT>756E645F</TT></TD>
<TD><TT>65696E5F</TT></TD>
<TD align=right><TT>i_nik-Grund_ein_</TT></TD>
</TR>
<TR>
<TD><TT>68656974</TT></TD>
<TD><TT>24242424</TT></TD>
<TD><TT>24242424</TT></TD>
<TD><TT>00<B>00</B><U>0000</U></TT></TD>
<TD align=right><TT>heit$$$$$$$$и<B>и</B><U>ии</U></TT></TD>
</TR>
<TR>
<TD><TT>00000000</TT></TD>
<TD><TT><I>00</I>FF0000</TT></TD>
<TD><TT>01010004</TT></TD>
<TD><TT>00050000</TT></TD>
<TD align=right><TT>ииии<I>и</I> ииииииииии</TT></TD>
</TR>
<TR>
<TD><TT>00000000</TT></TD>
<TD><TT>00000000</TT></TD>
<TD><TT>0000</TT></TD>
<TD></TD>
<TD align=right><TT>ииииииииии&#160;&#160;&#160;&#160;&#160;&#160;</TT></TD>
</TR>
</TABLE>
<BR>
Dieser Cheat hat noch einen weiteren, wenn auch von mir eigentlich nicht beabsichtigten Nebeneffekt. Wenn man nun z.B. mehrere Wartezimmer hat, und eines verkauft, kriegt man daf&uuml;r ca. 65.000 L&uuml;mmel. Allerdings kann man auch h&ouml;chstens ein Wartezimmer verkaufen.<BR>
Wer sich jetzt nicht traut mit nem Hex-Editor in seinen Dateien Rumzupfuschen, kann mir die Datei auch zuschicken, und mir mitteilen, welche Geb&auml;udeeinheiten er manipuliert haben m&ouml;chte. Aber bitte vergesst nicht das R&uuml;ckporto beizulegen, weil ihr ansonsten nicht auf eine Antwort zu warten braucht. :)<BR>
Achja, eins noch:<BR>
<CENTER><B>Ich &uuml;bernehme KEINE Verantwortung f&uuml;r eventuelle Fehler in dieser Anleitung und daraus entstehender Besch&auml;digungen an Soft- und Hardware sowie jeglichen anderen Sch&auml;den, wie z.B. verst&auml;rktem Spieltrieb oder Schlaflose N&auml;chte. Wer diesen Cheat anwendet tut dies auf eigene Gefahr und Verantwortung ;)</B></CENTER>
<BR>
<a href="mitglieder/kalus.html" target="mainFrame"><CENTER><IMG SRC="turr.jpg" ALT="the unbelivable Roadrunner" align=bottom>&#160;Sven Kalus</CENTER></a>
<HR>
<a name="mehr">Weitere Texte in dieser NoCover von mir:</a><BR>
<CENTER><a href="cd_hupdemocd.html">Die Haage+Paartner Demo-CD im Kurztest</a></Center>      
<CENTER><a href="help_cprogsk.html">Meinereiner braucht Hilfe, wer kann helfen?</a></Center>      
<CENTER><a href="leser_svenk.html">Meine kleine, aber feine Leserbriefecke.</a></Center>       
<CENTER><a href="story_storygamesk.html">Ein neuer Beitrag zum Geschichten-Spiel von eurem lieben R.R.</a></Center> 
<CENTER><a href="story_storygamesk1.html">Ein zweiter Story-Game Beitrag</a></Center>
<CENTER><a href="st_fc-manager.html">Feedback-Corner-Manager. Das neue Spiel von Roadrunner Inc. ;)</a></Center>
<CENTER><a href="st_gedicht.html">Ein kleines st&uuml;ckchen Lyrik in Gedichtform</a></Center>           
<CENTER><a href="st_liedtext.html">Der Text von "Wind of Change" nur f&uuml;r euch.</a></Center>          
<CENTER><a href="st_vorstsk.html">Eine Aktualisierte Vorstellung f&uuml;r die Mitgliederliste.</a></Center>           
<CENTER><a href="tips_hollypics.html">F&uuml;r jeden, dem Hollywood Pictures zu schwer ist...</a></Center>       
<CENTER><a href="tips_installhollypics.html">Hollywood Pictures will von Festplatte nicht laufen? Schau mal hier rein!</a></Center>
<CENTER><a href="tips_ncverteiler.html">Schau der Einfachheit halber mal rein.</a></Center>     
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</BODY>
</HTML>
