<HTML><HEAD>
    <TITLE>AmZeiger 08-09/97 - CD-Test</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<CENTER><H1><U>CD-Test</U></H1><BR>von<BR><A HREF="mailto:G.Franz@BBrandes.in-brb.de">Gregor Franz</A></CENTER>
<P><B>In</B> diesem CD-Brennpunkt teste ich die APC&amp;TCP-CDs 1-3, sowie die Amiga
CD-Sensations `Golden Games` und `Demos Are Forever` von Schatztruhe.</P>
<P>Gigabytes an Daten warteten darauf, durchforstet zu werden.</P>
<P>Die <B>APC&amp;TCP-CD`s</B> sind nicht etwa nur Clubmitgliedern vorbehalten, sondern
wenden sich an eine gr&ouml;&szlig;ere Zielgruppe und sind somit auch im Fachhandel
erh&auml;ltlich. Bei der Ersten handelt es sich um eine Misch-CD, bei der
Zweiten liegt der Schwerpunkt auf Bildern und die Dritte widmet sich
PD-Spielen. Daher bietet sich ein Vergleich mit der `Golden Games`
geradezu an.</P>
<P>Bei den <B>CD-Sensations</B> handelt es sich urspr&uuml;nglich um eine Reihe, die im
Zeitschriftenhandel verkauft wurden. Die dort nicht abgesetzten, werden
jetzt von Schatztruhe zum halben Preis verkauft.</P>
<HR WIDTH=50%>
<P><CENTER><B>Die APC&amp;TCP-CD Volume 1.</B></CENTER></P>
<P>Doch nun erst einmal zur APC&amp;TCP-CD Volume 1 - eine typische Misch-Masch-CD,
die wahrscheinlich jedem etwas bietet.</P>
<P>Mit Klicks auf den jeweiligen Icons l&auml;&szlig;t sich per Handumdrehen der, f&uuml;r die
CD optimale Screenmodus, die Palette und einige wichtige Assigns aufrufen.
Die Daten auf ihr sind alle ungepackt.</P>
<P>In zwei Verzeichnissen stehen f&uuml;r <B>Info-Junkies</B> zahlreiche gesammelte
Ausgaben der Diskettenmagazine AmigaGadget und NoCover (das Club-Magazin)
zur Verf&uuml;gung. Lesestoff, an dem man mit Sicherheit lange zu knabbern
haben wird.</P>
<P>Zus&auml;tzlich gibt es aber noch ein Extra-Verzeichnis, in dem noch so einiges
an unterschiedlichsten Texten und Amiga-Guides zusammengesammelt wurde.
Ganz interessant fand ich hier z.B. auch den Guide zur japanischen
Umgangssprache inklusive Vorsprechen der Eintr&auml;ge! Auch in eine (engl.) Anleitung
f&uuml;r HTML 3.0 kann man sich hier vertiefen.</P>
<P>In <B>Tools</B> gibt es unter `Printers` zahlreiche unterschiedliche
WB-Druckertreiber. Bei den Datatypes ist eine gutsortierte Sammlung derselben zu
finden. Schlie&szlig;lich gibt es hier auch mehr als 200 unterschiedliche
Tools. Eine bunte Mischung vieler n&uuml;tzlicher Programme, die man, da auch
hier nur eine alphabetische Ordnung herrscht, systematisch durchgehen mu&szlig;.</P>
<P>An <B>Games</B> sind, au&szlig;er einer Vollversion des kommerziellen APC&amp;TCP-Spieles
Marblelous und einigen Demo-Versionen anderer Spiele, auch einige PD-Spiele
enthalten.</P>
<P>Bei <B>Multimedia</B> tut sich eine weitere Schatzkammer f&uuml;r den Sammler auf. Hier
gibt es neben Musikmodulen, Grafiken und Workbench-Versch&ouml;nerungspaketen
auch einge ausgew&auml;hlte Demos.</P>
<P>Besonders hervorzuheben ist hier die direkt startbare Version der legend&auml;ren
Odyssey-Demo von Alcatraz.</P>
<P>Beim Grafik- und Musikbereich sind sebstverst&auml;ndlich auch jeweils die Werke
von Clubmitgliedern enthalten. Naturgem&auml;&szlig; mit ziemlich gemischter Qualit&auml;t.</P>
<P>Im allgemeinen <B>Mods</B>-Verzeichnis (`Others`), mu&szlig; ich allerdings ehrlich
zugeben, entsprach das Gros nicht meinem Geschmack. Hier befinden sich zwar
zahlreiche Mods mit Gr&ouml;&szlig;en von 300 bis 700 KB, doch kommt es bei ihnen oft
nur auf Riesen-Sprachsamples an, die Melodie spielt erst die zweite Geige.
Schwerpunkt liegt auf den Stilrichtungen Acid, Trance und Techno.</P>
<P>Im <B>Pictures</B>-Verzeichnis liegt mitten unter den Verzeichnissen der APC&amp;TCP-
Mitglieder ebenfalls ein `Others`-Verzeichnis, in dem f&uuml;r jeden Geschmack
etwas dabei sein sollte.</P>
<P>Ob geraytraced, gescannt oder handgepixelt. Ob IFF, GIF oder JPEG - hier
liegt eine Menge unterschiedlichster Bilder. Die Qualit&auml;t ist auch hier
teilweise durchwachsen und was wirklich st&ouml;rend ist: ohne eine wirkliche
Ordnung.</P>
<P>Die Verzeichnisse teilen die Bilder wieder lediglich alphabetisch ein, was,
auf Grund der oft wenig aussagekr&auml;ftigen Namen, wenig bringt. Die
Kennzeichnung der Grafikformate im Dateinamen ist nur sporadisch. Auch doppelte
Dateien kommen vor, so z.B. ein Grundri&szlig; der Startrek-F&auml;hre als Pod und als
Shuttelepod, aber all dies ist angesichts der gewaltigen Kapazit&auml;t der
Scheibe sicher zu verschmerzen.</P>
<P>Eine bessere Pflege dieses Bestandes lie&szlig; der APC&amp;TCP der zweiten CD-Ausgabe
angedeihen.</P>
<P>Als wahre Fundgrube entpuppt sich der <B>Workbench-Bereich</B> in dem zahlreiche
Icon- und Pattern-Sammlungen, Hintergrundbilder und vieles mehr zum 
Versch&ouml;nern der Workbench zusammengesammelt wurde.</P>
<P>Braucht man diese CD?</P>
<P>Als regelm&auml;&szlig;iger Sammler von Aminet-CD`s ist ihr Nutzen sicher nur begrenzt,
haupts&auml;chlich die gesammelten NoCover-und AmigaGadget-Ausgaben k&ouml;nnten einen
Anreiz bieten. Ansonsten stellen gerade Bereiche, wie das Datatype-Verzeichnis
oder die Workbench-Sammlung ein wertvolles Archiv dar.</P>
<P>Gerade f&uuml;r Leute, die sich ihr CD-ROM-Laufwerk erst frisch angeschafft haben,
ist diese CD ideal als Einstieg. Sie bietet eine Menge und das durchforsten
lohnt.</P>
<BR>
<TABLE BORDER=1 ALIGN=CENTER>
<TR><TH>Produkt:</TH><TD>APC&amp;TCP-CD Volume 1</TD><TH>Hersteller:</TH><TD>APC&amp;TCP</TD></TR>
<TR><TH>Art:</TH><TD>Daten-CD</TD><TH>Version:</TH><TD>--</TD></TR>
<TR><TH>Preis:</TH><TD>19.95 DM</TD><TH>Bez.Quelle:</TH><TD>APC&amp;TCP</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2>Gesamt:</TH><TH ALIGN=CENTER>2</TH><TD ALIGN=CENTER><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=4>APC&amp;TCP, Andreas Magerl, Dorfstr. 17, 83236 &Uuml;bersee</TD></TR>
</TABLE>
<HR WIDTH=50%>
<CENTER><B>Die APC&amp;TCP-CD Volume 2.</B></CENTER>
<P>Volume 2 kann mit 1.500 gesammelten Bildern aufwarten.</P>
<P>Sie sind in folgenden Verzeichnissen organisiert: <B>Art</B> (handgepixelte Bilder),
<B>Digi</B> (gescannte Bilder), <B>Trace</B> (geraytracte Bilder), sowie <B>Club</B> (Bilder von
Clubmitgliedern).</P>

<P>Zus&auml;tzlich liegen in <B>Tools</B> einige der wichtigsten Anzeigerprogramme und mit
PicView auch ein Katalogisierprogramm, mit dem man Thumbnails erstellen kann.
(Vorgefertigte Thumbnail-Dateien der CD w&auml;ren ein nettes Gimmick gewesen).</P>
<P>Innerhalb dieser Hauptverzeichnisse sind die Bilder in verschiedenen
Unterverzeichnissen nach dem Grafikformat (IFF, GIF bzw. JPEG) eingeordnet.</P>
<P>Dann folgt leider keine weitere sinnvolle Unterteilung in z.B. Art/GIF/Natur,
sondern lediglich `Buchstaben`-Unterverzeichnisse.</P>
<P>Daraus folgt, da&szlig; die Bilder selbst also bunt gemischt mit unterschiedlichsten
Inhalten auftreten. Gelegentlich auch doppelt, was besonders direkt
hintereinander nicht h&auml;tte passieren m&uuml;ssen, so z.B. bei Art/IFF/C "Cheatmode.256"
und "Cheatmode.iff", beide mit derselben Dateigr&ouml;&szlig;e oder "FaceOfNature.iff"
und "FaceOfTheNature.iff".</P>
<P>Die Digis nehmen mit etwas &uuml;ber 13 MByte den wenigsten Platz auf der CD ein.
Art und Club zusammen etwa 97 MByte und die Traces den L&ouml;wenanteil, zumindest
vom Umfang her, mit &uuml;ber 524 MByte.</P>
<P>Es l&auml;&szlig;t sich aber in jedem Fall sagen, da&szlig; die Bilder schon einmal wesentlich
besser organisiert sind, als bei Volume 1. Direkt nach Art, Grafikformat
und alphabetisch. Der Bestand aus Ausgabe 1 wurde eingearbeitet.</P>
<P>Die <B>Qualit&auml;t</B> der Bilder ist wieder recht bunt gemischt, aber bei der Anzahl
d&uuml;rften die meisten Geschm&auml;cker voll bedient werden.</P>
<BR>
<TABLE BORDER=1 ALIGN=CENTER>
<TR><TH>Produkt:</TH><TD>APC&amp;TCP-CD Volume 2</TD><TH>Hersteller:</TH><TD>APC&amp;TCP</TD></TR>
<TR><TH>Art:</TH><TD>Daten-CD</TD><TH>Version:</TH><TD>--</TD></TR>
<TR><TH>Preis:</TH><TD>19.95 DM</TD><TH>Bez.Quelle:</TH><TD>APC&amp;TCP</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2>Gesamt:</TH><TH ALIGN=CENTER>2</TH><TD ALIGN=CENTER><IMG SRC="../images/note2.gif" ALIGN=CENTER WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=4>APC&amp;TCP, Andreas Magerl, Dorfstr. 17, 83236 &Uuml;bersee</TD></TR>
</TABLE>
<HR WIDTH=50%>
<CENTER><B>Demos Are Forever</B></CENTER>
<P>Nun kurz zur CD `Demos Are Forever` aus Stefan Ossowskis Schatztruhe.</P>
<P>Mehr als 620 MByte an Demos, Slideshows und Musikdemos sind hier zumindest
langfristig gespeichert. Wohl nicht f&uuml;r immer, denn auch CD`s sollen ja
irgendwann ihre Daten `verlieren`. ;)</P>
<P>F&uuml;r diese gro&szlig;e Anzahl an Daten ist die CD sogar <B>relativ gut organisiert</B>.
Die Hauptverzeichnisse sind `AGA only`, `Big Bunch` (der gr&ouml;&szlig;te Teil der CD
mit &uuml;ber 223 MByte), `Diskstuff` (noch weiter sortierte DMS-Files), `Hear Me`
(Musikdemos), `Intros`, `Mags`, `Minis`, `Party Time` (unterteilt in mehrere
Party-Verzeichnisse die etwa 1992-95 abdecken), `See Me` (Slideshows). Als
Abrundung gibt es noch ein Toolsverzeichnis mit ein paar Standardbild- und
Text-Anzeigern, sowie einigen Degradern.</P>
<P>Als n&auml;chste Unterverzeichnisse erwarten einen nun zumeist die Buchstaben des
Alphabets, hinter denen sich wiederum die Gruppennamen verbergen. Je nach
Gruppe kann man dann manchmal unter mehreren Demos ausw&auml;hlen und hoffen, da&szlig;
etwas Gutes folgen m&ouml;ge.</P>
<P>Denn das ist wie zu erwarten <B>der Knackpunkt</B>, den einem keine noch so gute
Organisation ersparen kann: Die Qualit&auml;t ist sehr gemischt und selten
vorhersehbar. Da die meisten Demos nicht sauber zu beenden sind, sind zahlreiche
Resets vorprogrammiert, nach denen man wieder hochbooten und weiterprobieren
mu&szlig;.</P>
<P>Amhaltspunkte sind dank der Ordnung aber die bekannteren Gruppen, die zwar
auch nicht immer Garanten f&uuml;r Qualit&auml;t sind, aber doch in vielen F&auml;llen.</P>
<P>Viele <B>Schmuckst&uuml;cke</B> verbergen sich aber auch hinter den unbekannten
Produktionen. Man sollte also nicht zu schnell die Flinte ins Korn werfen.</P>
<P>Einfach zu starten sind einige Grundeinstellungen, wie Assigns, Farben und
Aufl&ouml;sung per Doppelklick auf die jeweiligen Icons.</P>
<P>Die meisten Demos (naturgem&auml;&szlig; bis auf Diskstuff) sind per Doppelklick startbar.
Jedoch sollte man mit <B>Vorsicht</B> zu Werke gehen, denn vielfach ist die Benutzung
von Degradern anzuraten, um vor dem meist unvermeidlichen Reset wenigstens
noch einen Blick auf das Kunstwerk zu erhaschen und etwas weniger gefrustet
zu booten.</P>
<P><B>Alles in allem</B> also eine recht gut sortierte Mischung aus den meisten Demos
einiger Jahre Amiga-&Auml;ra. Ob man sich da durchw&uuml;hlen will, sollte man sich
allerdings vor dem Kauf &uuml;berlegen.</P>
<P>Der Kampfpreis und die aufwendige Zusammenstellung rechtfertigen eine
Bestnote.</P>
<BR>
<TABLE BORDER=1 ALIGN=CENTER>
<TR><TH>Produkt:</TH><TD>Demos Are Forever</TD><TH>Hersteller:</TH><TD><A HREF="http://www.schatztruhe.de">Schatztruhe</A></TD></TR>
<TR><TH>Art:</TH><TD>Daten-CD</TD><TH>Version:</TH><TD>--</TD></TR>
<TR><TH>Preis:</TH><TD>9.95 DM</TD><TH>Bez.Quelle:</TH><TD>Schatztruhe GmbH</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2>Gesamt:</TH><TH ALIGN=CENTER>1</TH><TD ALIGN=CENTER><IMG SRC="../images/note1.gif" ALIGN=CENTER WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=4>Stefan Ossowskis Schatztruhe GmbH, Veronikastr. 33, 45131 Essen</TD></TR>
</TABLE>
<CENTER><B>Golden Games versus APC&amp;TCP-CD Volume 3</B></CENTER>
<P>Die zweite CD-Sensation von Schatztruhe hei&szlig;t `Golden Games` und stellt, wie
die APC&amp;TCP-CD Volume 3, an die 1.000 PD-und Shareware-Spiele auf geringsten
Raum gepre&szlig;t, zur Verf&uuml;gung.</P>
<P>Der APC&amp;TCP machte es sich aber etwas zu einfach mit der Unterteilung.</P>

<P>Alle Spiele wurden lediglich in die Verzeichnisse ihres Anfangsbuchstabens
verfrachtet. Wie bei den APC&amp;TCP-CD`s &uuml;blich, kann man auch hier vorher
einige Grundeinstellungen und Assigns per Klick auf spezielle Icons vornehmen.</P>
<P>Doch dann hei&szlig;t es: <B>suchen, suchen, suchen!</B> Denn gute Spiele sind zwar
vorhanden, doch versteckt unter einer Masse von, zum Teil schon als grottenschlecht 
zu bezeichnenden Vertretern ihres Genres.</P>
<P>Die Namen sagen einem meistens nichts. So probiert man es also und nach so
mancher Entt&auml;uschung in Bezug auf die Spielqualit&auml;t, kommt noch der Frust der
sehr h&auml;ufigen Bootnotwendigkeit hinzu, da ein sauberes Spielbeenden eher eine
Ausnahme, als die Regel darstellt.</P>
<P>Neben den PD-Spielen gibt es auf der APC&amp;TCP CD 3 auch ein umfangreiches
<B>Preview-Verzeichnis</B> mit Demos der unterschiedlichsten kommerziellen und
Shareware-Games. Hier gibt es viele gute Spiele zum Antesten, darunter
einige Klassiker.</P>
<P>Bei der `Golden Games` gibt es eine einfache Zusammenstellung zumindest nach
der Art des Spieles, also z.B. nach Adventures, Shoot`em Up oder Jump`n`Run.</P>
<P>Unter <B>Archive</B> sind einige Gagprogramme, Spieleditoren, Patches und HD-
Installer, sowie auch einige Spiele, die, da nur von Disk spielbar, als
DMS-Files vorliegen.</P>
<P>Das <B>Tools</B>-Verzeichnis entspricht dem, der `Demos Are Forever` und ist, genau
wie dort, n&uuml;tzlich.</P>
<P>Allerdings ist auch diese aufwendigere Einteilung <B>nicht unfehlbar</B>. So liegt
z.B. "Dr.Mario" bei Jump`n`Run, obwohl es sich um ein Spiel in der Tradition
von Tetris handelt und eigentlich nach `Brain Activity` geh&ouml;ren w&uuml;rde. Die
Assoziation mit den SuperMario-Jump`n`Runs war offensichtlich &uuml;berm&auml;chtig. ;)</P>
<P>Diese Probleme stellen sich folglich der APC&amp;TCP-CD-Rom nicht. :)</P>
<P><B>Der Inhalt selbst &uuml;berschneidet sich</B>, wie zu erwarten, in gro&szlig;en Teilen.
Sehr viele Spiele sind auf beiden CD`s enthalten.</P>
<P>Einige der <B>Highlights</B> sind "UsNThem", "UChess", "VChess", "KlondikeAGA",
"Breed96", "DeluxeGalaga" und "DeluxePacman", "Dr.Mario", "Plato" und
"Trailblazer" (nur auf der `Golden Games`).</P>
<P><B>Lohnt</B> sich so ein PD-Spiel-Pool &uuml;berhaupt?</P>
<P>Das mu&szlig; jeder f&uuml;r sich entscheiden. Wenn man schlechten Zugriff auf das
Aminet hat oder keine Lust, ziellose Download-Orgien zu starten, dann sind
diese CD`s einen Blick wert, denn hier kann man in aller Seelenruhe testen,
was den pers&ouml;nlichen Geschmack trifft.</P>
<P><B>Das Problem</B>, das einem auf der Suche nach guten Spielen eine Menge Schrott
unterkommt und zahlreiche Resets notwendig werden, ist beiden CD`s gleich.</P>
<P>Die APC&amp;TCP-CD kann f&uuml;r sich ein umfangreiches und gutes Verzeichnis mit
Spieldemos verbuchen. F&uuml;r das, was man allerdings netto an Gegenwert bekommt,
finde ich, bei dieser nicht besonders liebevollen Zusammenstellung, den Preis
allerdings zu hoch!</P>
<P>Dem steht die bessere Unterteilung der `Golden Games` und ihr wesentlich
g&uuml;nstigerer Preis gegen&uuml;ber, der, das sei fairerweise nochmals erw&auml;hnt, aus
dem Sonderangebot resultiert.</P>
<P>(<B>Anmerkung</B>: Zum Zeitpunkt dieses Tests sind die CD-Sensations bei
Schatztruhe noch erh&auml;ltlich.)</P>
<BR>
<TABLE BORDER=1 ALIGN=CENTER>
<TR><TH>Produkt:</TH><TD>APC&amp;TCP-CD Volume 3</TD><TH>Hersteller:</TH><TD>APC&amp;TCP</TD>
<TD ROWSPAN=6></TD><TH>Produkt:</TH><TD>Golden Games</TD><TH>Hersteller:</TH><TD><A HREF="http://www.schatztruhe.de">Schatztruhe</A></TD>
</TR>
<TR><TH>Art:</TH><TD>Daten-CD</TD><TH>Version:</TH><TD>--</TD>
<TH>Art:</TH><TD>Daten-CD</TD><TH>Version:</TH><TD>--</TD>
</TR>
<TR><TH>Preis:</TH><TD>24.95 DM</TD><TH>Bez.Quelle:</TH><TD>APC&amp;TCP</TD>
<TH>Preis:</TH><TD>9.95 DM</TD><TH>Bez.Quelle:</TH><TD>Schatztruhe GmbH</TD>
</TR>
<TR><TD COLSPAN=4></TD><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2>Gesamt:</TH><TH ALIGN=CENTER>4</TH><TD ALIGN=CENTER><IMG SRC="../images/note4.gif" WIDTH="32" HEIGHT="52"></TD>
<TH COLSPAN=2>Gesamt:</TH><TH ALIGN=CENTER>2</TH><TD ALIGN=CENTER><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD>
</TR>
<TR><TD COLSPAN=4>APC&amp;TCP, Andreas Magerl, Dorfstr. 17, 83236 &Uuml;bersee</TD>
<TD COLSPAN=4>Stefan Ossowskis Schatztruhe GmbH, Veronikastr. 33, 45131 Essen</TD>
</TR>
</TABLE>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../amz0997/apctcp.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0997/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9709dom.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

