<HTML><HEAD>
    <TITLE>AmZeiger 09/97 - EuraTools</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<CENTER><H1><U>EuraTools</U></H1><BR>von<BR><A HREF="mailto:A.Schlick@BBrands.in-brb.de">Andreas Schlick</A></CENTER>
<P><B>ISDN</B> verbreitet sich auch bei Privatpersonen immer weiter. Da aber der Umstieg
von Analog auf Digital meist nicht gleich 100%ig geschieht (wozu sollte man sein
altes Telefon wegschmei&szlig;en, insbesondere, da ISDN-Telefone noch recht teuer
sind), besteht auch Bedarf an den sogenannten TK-Anlagen.</P>
<P>Diese Anlagen beinhalten meist auch a/d-Wandler, so da&szlig; alte Analogger&auml;te,
wie Telefone, Anrufbeantworter, Modems, Fax-Ger&auml;te etc., auch am ISDN-Anschlu&szlig;
benutzt werden k&ouml;nnen.</P>
<P>Mit bestimmten Tastenkombinationen k&ouml;nnen dann meist auch die weiteren
Dienstleistungen des ISDN genutzt werden, ohne da&szlig; man sich gleich ein neues,
teureres ISDN-Telefon kaufen mu&szlig;.</P>
<P>Es gibt mehrere TK-Anlagen auf dem Markt, wie z.B. die Istec oder die EuraCom,
um nur zwei zu nennen. Neben dem Funktionen und Ausstattungen der Anlagen, ist
auch die Benutzerfreundlichkeit ein wichtiges Kriterium beim Kauf.</P>
<P>Eine komplexe Anlage nur per Telefon zu konfigurieren (dazu werden meist
bestimmte Tastenkombinationen verwendet) ist auch f&uuml;r eine einmalige
Konfiguration etwas umst&auml;ndlich und un&uuml;bersichtlich. Vielen TK-Anlagen liegen
daher Konfigurations-Tools bei, um die Anlage, die meist per seriellem Kabel mit
dem Computer verbunden ist, komfortabel einzustellen.</P>
<P>Leider sind die meisten der Programme nur f&uuml;r den IBM-kompatiblen PC und nicht
f&uuml;r den Amiga. :-(</P>
<P>F&uuml;r die <B>EuraCom</B> von Ackermann hat sich jedoch jemand gefunden, der es, trotz
schlechten Supports von Seiten Ackermanns, durch viel Probiererei und
Puzzlearbeit, geschafft hat, ein Konfig-Tool zu programmieren, mit dem es
m&ouml;glich ist, die EuraCom (und baugleiche Anlagen) auch mit dem Amiga zu
konfigurieren.</P>
<P>Sein Programmpaket nennt sich <B>EuraTools</B> und beinhaltet neben dem
Konfigurationstool <B>EuraConfig</B>, noch <B>EuraCall</B> zur Geb&uuml;hrenauswertung
mit dem Geb&uuml;hrenkit 1000 und <B>PassCall</B>, ein Hilfsprogramm zur Geb&uuml;hrenauswertung,
wenn das Geb&uuml;hrenkit 1000 nicht vorhanden ist.</P>

<P>Alle drei Tools verwenden MUI und bieten eine durchdachte Oberfl&auml;che.</P>

<P>EuraTools ist <B>Shareware</B> und der Autor verlangt mit 30DM f&uuml;r seine Arbeit auch
nicht zu viel. Vor allem ist dabei zu bedenken, da&szlig; er das Tool nicht im Auftrag
von Ackermann geschrieben und nur minimale Hilfestellung von ihrer Seite
bekommen hat, was die Implementierung des Protokolls zur Konfiguration erheblich
erschwerte.</P>
<P>Die EuraCom wird mit einem 9-poligen seriellen Kabel ausgeliefert. Falls keine
entsprechende Schnittstellenkarte vorhanden ist, mu&szlig; zus&auml;tzlich noch ein Adapter
besorgt werden, um das Kabel an der normalen seriellen Schnittstelle des Amigas
anzuschlie&szlig;en, zum Beispiel ein &quot;25pol-Buchse zu 9pol-Stecker&quot;.</P>
<P>Bei mir konnte ich das Kabel an die serielle Schnittstelle meiner GVP G-Force
anschlie&szlig;en. Da das zu verwendende Device in EuraTools einstellbar ist, gab es
damit auch keinerlei Probleme.</P>
<P>Die Installation erfolgt mit dem Standard-Installer problemlos, so da&szlig; man recht
schnell los legen kann. :) Ben&ouml;tigt wird als Minimal-Konfiguration OS2.04,
MUI3.6, 1MB RAM und eine Aufl&ouml;sung von 640x256 (bei quervernetzten Anlagen
mindestens 640x300) laut Anleitung. Getestet wurde EuraTools auf OS3.1 mit 68040.</P>
<P><B>EuraConfig</B> ist &uuml;bersichtlich gestaltet und unterteilt die Einstellung in acht
Bereiche.</P>
<P>Die <B>erste Seite</B> dient zur <B>Information</B> welche Version verwendet wird und ob
diese registriert ist.</P>
<P>Die <B>zweite Seite</B> &quot;Globales&quot; ist wiederum unterteilt. Bei dem Unterpunkt
&quot;Konfiguration&quot; l&auml;&szlig;t sich z.B. der Anlagentyp (Einzelanlage bzw. vernetzt), der
Geheimcode f&uuml;r die Raum&uuml;berwachung bzw. den Alarm einstellen. Desweiteren kann
man noch die Landes- und Ortskennung &uuml;berpr&uuml;fen.</P>
<P>Im zweite Unterpunkt &quot;Geb&uuml;hren&quot; kann man einstellen, welche Anrufe
protokolliert werden, welchen Grundpreis eine Einheit und welche Frequenz
der Geb&uuml;hrenimpuls hat.</P>
<P>Im letzten Unterpunkt &quot;Verschiedenes&quot; lassen sich diverse weitere Einstellungen
vornehmen, wie z.B. welche Wartemusik benutzt werden soll oder die automatische
Amtsholung.</P>
<P>Die <B>dritte Hauptseite</B> konfiguriert die S0-Ports. Bei der EuraCom 180 ist nur
ein S0-Port vorhanden. Dieser mu&szlig; folglich (bei normalem Heimanwender) auf
&quot;Externer Mehrger&auml;tsanschlu&szlig; (PTMP)&quot; konfiguriert sein, dann m&uuml;ssen die MSNs nur
noch eingetragen werden. Bei der EuraCom 181/2 gibt es noch weitere S0-Ports, die
dann dementsprechend auch eingestellt werden k&ouml;nnen.</P>
<P>Die <B>vierte Hauptseite</B> ist den Teilnehmern gewidmet. In einer Liste k&ouml;nnen
dann die Teilnehmer eingegeben werden. Es l&auml;&szlig;t sich jedem Teilnehmer ein Name
zuweisen, der zwar auf die Anlage bezogen keine Bedeutung hat, aber es
vereinfacht, sich die Zuweisungen zumerken.</P>
<P>Dem Teilnehmer wird dann eine interne Rufnummer zugewiesen und eingestellt,
welche Art von ISDN Ger&auml;t sich dort befindet (z.B. Modem, Anrufbeantworter,
Telefon). Falls der Teilnehmer auch von "au&szlig;en" erreichbar sein soll, mu&szlig; ihm
noch eine MSN zu gewiesen werden. Die weiteren Einstellungen bestimmen die
Eigenschaften des Teilnehmers, ob er z.B. eine Masterberechtigung hat oder ob
der Aufschaltschutz aktiviert ist etc. etc.</P>
<P>Auf der <B>f&uuml;nften Seite</B> lassen sich die Alarmfunktionen der EuraCom einstellen:
Wann dieser aktiv ist, wie der Aktor angesteuert wird, welche Rufnummern im
Alarmfall angerufen werden sollen.</P>
<P>Die <B>sechste Seite</B> ist den Kurzwahlzielen gewidmet. Dort lassen sich die 200
Kurzwahl-Ziele konfigurieren, die in die Anlage gespeichert werden sollen.
Dadurch braucht man sich nicht mehr eine sieben- oder achtstellige Nummer zu
merken, sondern nur noch eine dreistellige.</P>
<P>Auf der <B>siebenten und achten Seite</B> lassen sich der Nahbereich bzw. der
Sperrbereich definieren, also die Vorwahlen, die zum Nahbereich geh&ouml;ren, bzw.
die, die v&ouml;llig gesperrt sein sollen (z.B. 0190). Es l&auml;&szlig;t sich je Teilnehmer
n&auml;mlich noch die Amtsberechtigung konfigurieren, die entscheidet, ob der
Teilnehmer nur Intern-, Orts-, Nahbereichs-, Inlandsgespr&auml;che f&uuml;hren darf
oder keinen Beschr&auml;nkungen unterliegt. Dadurch kann verhindert werden, da&szlig; z.B.
Kinder aus Versehen teure Ferngespr&auml;che f&uuml;hren.</P>
<P>EuraConfig unterst&uuml;tzt die EuraCom (und baugleiche Anlagen) bis zur Firmware
V1.11. Die angek&uuml;ndigte Firmware 2.0 soll ebenfalls unterst&uuml;tzt werden.
Allerdings h&auml;ngt dies haupts&auml;chlich davon ab, ob der Autor das
&Uuml;bertragungsprotokoll entschl&uuml;sseln kann. Eine verbindliche Zusage m&ouml;chte
er jedenfalls noch nicht geben.</P>
<P>Alle Tools des EuraTools-Pakets sind sauber programmiert und f&uuml;hrten bis her
noch nie zu einem Absturz. Ein ARexx-Port ist auch Standard und es werden auch
gleich ein paar Beispielscripte mitgeliefert. Die Anleitung ist ausf&uuml;hrlich und
gut durchdacht.</P>
<P>Mangels des Geb&uuml;hrenkit 1000 konnte EuraCall nicht richtig getestet werden,
desweiteren konnte auch PassCall nur bedingt getestet werden, da mein Rechner
nicht 24 Stunden am Tag l&auml;uft.</P>
<P>EuraTools liegt noch ein Registrierungstool bei, mit dem man komfortabel seine
Bestellung aufgeben kann. Als Besonderheit bietet Richard K&ouml;rber noch die
M&ouml;glichkeit, den Key, au&szlig;er auf einer DD oder HD Diskette oder per eMail (nur
mit PGP), auch auf einer IOmega ZIP-Diskette zu bekommen (Kostenzuschlag: 35DM).</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR><TD><B>Produkt:</B></TD><TD>EuraTools</TD><TD><B>Hersteller:</B></TD><TD><A HREF="http://www.is-koeln.de/einwohner/shred/euratools/main.html">Richard K&ouml;rber</A></TD></TR>
<TR><TD><B>Art:</B></TD><TD>Konfigurationstool (EuraCom)</TD><TD><B>Version:</B></TD><TD>Release 5</TD></TR>
<TR><TD><B>Preis:</B></TD><TD>ca. 30 DM</TD><TD><B>Bez.Quelle:</B></TD><TD>Richard K&ouml;rber</A></TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>1</TD><TD ALIGN=CENTER ROWSPAN=4><IMG SRC="../images/note1.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Adresse:</B></TD><TD COLSPAN=2 ALIGN=CENTER>
<A HREF="mailto:shred@chessy.aworld.de">Richard K&ouml;rber</A>, Hornstr. 20, 51465 Bergisch-Gladbach</TD></TR>
</TABLE></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../sw/9709fh.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0997/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../hw/9709maus.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

