<HTML><HEAD>
    <TITLE>AmZeiger 09/97 - DOpus Magellan Update</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<CENTER><H1><U>DOpus Magellan / Update</U></H1><BR>von<BR><A HREF="mailto:A.Schlick@BBrands.in-brb.de">Andreas Schlick</A></CENTER>
<P><B>Und</B> nun zum Update.</P>
<P>Ich hatte das Update, noch bevor ich die offizielle Benachrichtigung
erhalten hatte, bestellt und es kam auch sehr schnell an.</P>
<P>Wie bereits erwartet, bekam ich nur eine CD ohne irgendein Handbuch.</P>
<P>Beim &Ouml;ffnen kam jedoch die erste <B>&Uuml;berraschung</B> in Form einer Diskette,
die mich, im Gegensatz zur CD, anpurzelte. Ich dachte zwar gleich an
ein `last minute update', aber auf der Diskette befand sich lediglich
ein Installer-Script, das auch mit AmiCDROM bzw. CacheCDFS funktioniert.</P>
<P>Es trat n&auml;mlich bereits bei DOpus5.5 das <B>Problem</B> auf, da&szlig; die Installation
nicht korrekt ablief, wenn eines der beiden oben erw&auml;hnten CD-Filesysteme
verwendet wurde. Das auf der CD befindlich Installer-Script lief mit dem
von mir verwendeten AsimCDFS einwandfrei. Warum jedoch nicht gleich ein
kompatibles Script auf die CD gebrannt wurde, insbesondere da das Problem
ja nun wirklich bekannt war, ist mir <B>unverst&auml;ndlich</B>.</P>
<P>Nach der problemlosen Installation ist mir <B>positiv</B> aufgefallen, da&szlig; es
nicht mehr f&uuml;r n&ouml;tig gehalten wurde, das reine DOpus-System LhA zu packen.</P>
<P>Bei DOpus5.5 wurden noch die reinen DOpus-Dateien gepackt. Es lohnte sich
wirklich, die Daten zu ca. 2.2 MB zusammenzupacken, wenn eine CD nur 650MB
umfa&szlig;t und insgesamt etwa 13,3MB belegt sind. ;-)</P>
<P>Die <B>Installation</B> lief daher auch um einiges flotter. Nach einem Reset des
Rechners mu&szlig;te ich auf bekannte Weise DOpus wieder registrieren, ansonsten
lief alles wie gew&ouml;hnlich.</P>
<P>Mit gro&szlig;er Gespanntheit wollte ich nun nat&uuml;rlich wissen, was f&uuml;r tolle,
neue Features ich f&uuml;r 69DM + Versand und Portokosten erstanden hatte.</P>
<P>Die <B>Anleitung</B> wurde wieder im AmigaGuide-, PowerGuide- und Wordworth-
Format mitgeliefert. Das Lesen selbiger erbrachte jedoch sehr schnell
Ern&uuml;chterung. </P>
<P>Das eine LiesMich.Magellan-Datei f&uuml;r Last-Minute-&Auml;nderungen dabei ist,
habe ich ja erwartet, aber das sogar noch die LiesMich.55 von DOpus5.5
mitgeliefert wird, &uuml;berraschte mich (wenn auch nicht ungemein positiv).</P>
<P>In der Einleitung der Anleitung gab`s dann einen Punkt &quot;Erg&auml;nzungen zu
Opus Magellan&quot;. Aber warum sollte mich Kapitel Eins mit dem Titel &quot;Was
ist neu an Opus 5.5&quot; in die Geheimnisse von DOpus5.5 einweisen!?</P>
<P>Die &quot;Erg&auml;nzungen zu Opus Magellan&quot; stellten sich dann als kleiner Guide
zur Erkl&auml;rung des neuen Magellans heraus. Die restliche Anleitung hat
sich von Version 5.5 her inhaltlich nicht ver&auml;ndert.</P>
<P>Angek&uuml;ndigt ist eine &quot;v&ouml;llig &uuml;berarbeitete DOpus Magellan&quot;-Version &quot;nach
12 Monaten intensiver Entwicklungsarbeit&quot;. &quot;Viele Anwenderw&uuml;nsche wurden
bei dieser neuen Version ber&uuml;cksichtigt, ...&quot;</P>
<P>Nach etwas neugierigen Gesuche fand ich dann auch tats&auml;chlich eine
Neuerung und zwar die <B>Piktogrammpositionierung</B>. Es lassen sich auf dem
DOpus-Bildschirm nun Bereiche definieren, in denen bestimmte Iconarten
plaziert werden.</P>
<P>Man kann so z.B. einen Bereich definieren, in dem nur die AppIcons
plaziert werden, w&auml;hrend in einem andere Bereich die Festplatten/
Disketten-Icons auftauchen. Das Ganze l&auml;&szlig;t sich dann noch durch
Priorit&auml;ten beeinflussen. Die Funktion finde ich sehr n&uuml;tzlich.</P>
<P><B>Start-Men&uuml;s:</B></P>
<P>Als weitere Neuerung fiel mir ein Menupunkt `Kn&ouml;pfe/Neu/Start-Men&uuml;...'
bzw. `Kn&ouml;pfe/Start-Men&uuml; laden..' auf. Dieses Feature wurde auch schon
als &quot;Neuartiges System von Start-Men&uuml;s&quot; angek&uuml;ndigt. Sie erm&ouml;glicht
eine Start-Leiste, &auml;hnlich der von Windows95, zu erstellen. Leider
wurde sie nicht 100% kopiert, so da&szlig; es z.B. leider nur m&ouml;glich ist f&uuml;r
den Hauptbutton ein Icon zu definieren und nicht f&uuml;r die weiteren Unterpunkte.
F&uuml;r dieses &quot;neuartige System&quot; gab es auch einen Abschnitt aus
&quot;Erg&auml;nzungen zu Opus Magellan&quot;, der mich &uuml;ber die Neuartigkeit dieser
Funktion aufkl&auml;rte:</P>

<BLOCKQUOTE>&quot;In Opus 5.5 war es m&ouml;glich einen einzelnen Knopf zu erzeugen, der eine
Anzahl dazugeh&ouml;riger Popup-Men&uuml;s enthielt. Allerdings war dies nicht ganz
einfach und diese Funktion war auch etwas versteckt... Opus Magellan
bietet *nun* direkten Zugriff auf diese Start-Men&uuml;s.&quot;</BLOCKQUOTE>

<P><B>NewIcons:</B></P>
<P>Ein weiteres interessantes Feature ist die direkte Unterst&uuml;tzung von
NewIcons.</P>
<P>In dem &quot;Umgebungs&quot;-Einstellfenster l&auml;&szlig;t sich unter &quot;Pikt.farben&quot; das
Verhalten von Opus zu NewIcons einstellen. Neben dem gew&ouml;hnlichen An-
und Abschalten von NewIcons gibt es noch Dithering und den Punkt
&quot;NewIcons einschr&auml;nken&quot;.</P>
<P>Unter letzterem Punkt konnte ich mir nicht viel vorstellen und dr&uuml;ckte
daher hoffnungsvoll die Help-Taste. Ich wurde darauf zwar mit der
Anleitung begl&uuml;ckt, aber es war nur die Inhaltsseite, so da&szlig; ich mich
erstmal durch den langen Index w&uuml;hlen mu&szlig;te.</P>
<P>Die Erkl&auml;rung war sehr vielversprechend und zwar sollten mit dieser
Funktion nur NewIcons verwendet werden, wenn kein Standard-Icon sondern
nur diese kleinen &quot;Knopficons&quot; vorhanden sind.</P>
<P>Da ich pers&ouml;nlich NewIcons nicht so mag, empfand ich die Funktion als
ideal. Der folgende Test brachte (wie so oft) eine schnelle <B>Ern&uuml;chterung</B>.
In der Anleitung steht, da&szlig; die Icons kleiner als 5x5 Pixel sein m&uuml;ssen,
damit DOpus das NewIcon benutzt.</P>
<P>Ein Test mit zwei verschiedenen Iconeditoren f&uuml;hrte zu der Erkenntnis,
<B>da&szlig; DOpus Magellan nicht bis F&uuml;nf z&auml;hlen kann</B>. :(</P>
<P>Denn sowohl die 5x5 Pixel gro&szlig;en Icons, wie auch bei 4x4 Pixel, zeigte
mir DOpus mit beharrlicher Ausdauer diese kleinen Standard-Icons. Erst
eine weitere Verkleinerung auf 4x3 Pixel (Achtung: 3x4 Pixel klappten
wiederum nicht!) brachten den erw&uuml;nschten Erfolg.</P>
<P>Damit hat mich die Funktion wirklich &uuml;berzeugt, ich werde mich nat&uuml;rlich
sofort daran machen, alle Nur-NewIcons-Piktogramme umzumalen, damit DOpus
zeigen kann, was es (nicht) kann. :-((</P>
<P><B>Desktop-Ordner:</B></P>
<P>Das n&auml;chste Feature, der `neuartige Desktop-Ordner', f&uuml;hrt ein neues
System ein. Man kann jetzt Dateien, statt sie auszulagern, in den
Desktop-Ordner kopieren/verschieben.</P>
<P>Alle, sich im Desktop-Ordner befindlichen Dateien werden wie ausgelagerte
Dateien im Hauptfenster von DOpus angezeigt. Es soll (laut Anleitung)
<BLOCKQUOTE>&quot;eine n&uuml;tzliche Methode sein, um auf tempor&auml;re Dateien schnell zuzugreifen
und ist zudem ein Platz, an dem man h&auml;ufig genutzte Programme ablegen kann.&quot;</BLOCKQUOTE></P>
<P>Das kann man dann durch normales Kopieren oder Verschieben machen oder man
l&auml;&szlig;t sich beim Auslagern ein Popup-Men&uuml; &ouml;ffnen, in dem man die gew&uuml;nschte
Funktion (normales Auslagern, in Desktop kopieren, in Desktop verschieben)
ausw&auml;hlt.</P>
<P>Vielleicht ist dieses Konzept zu neuartig oder ich vielleicht zu
konservativ, aber sie bietet f&uuml;r mich einfach kein brauchbares Ergebnis.</P>
<P>Das Verschieben von Programmen in den Desktop-Ordner f&uuml;hrt dazu, da&szlig;
Programme, die im aktiven Verzeichnis nach weiteren Daten suchen, diese
nicht mehr finden, da das Programm ja aus dem Desktop-Ordner heraus
gestartet wurde und nicht aus seinem eigenen Verzeichnis.</P>
<P>Und was es mir (au&szlig;er eine beschleunigte Defragmentierung der Festplatte :)
bringt, tempor&auml;re Files oder Projekt-Files in den Desktop-Ordner zu
kopieren/verschieben, wei&szlig; ich auch nicht, da DOpus sich ja auch nicht
das urspr&uuml;ngliche Verzeichnis merkt, um es sp&auml;ter z.B. per Popup-Men&uuml;
wieder zur&uuml;ckzubewegen.</P>
<P>Vielleicht soll es es erm&ouml;glichen, wieder die Icons auszulagern, ohne da&szlig;
DOpus einen kleinen Pfeil an die Ecke des Icons malt. (Dieses Verhalten
beim normalen Auslagern wurde meiner Auffassung nach dummerweise von Win95
kopiert.)</P>
<P>Zwar ist der Punkt &quot;<B>Verbesserte Kompatibilit&auml;t</B> mit MUI, DataTypes, MCP
und einer Anzahl anderer Programme&quot; nach meiner Meinung wahr, da mein
System jetzt auch wieder mit dem MacSnd-Datatype zusammenarbeit, ohne das
Fehler auftreten.</P>
<P>Allerdings will ich mich lieber meiner Meinung &uuml;ber den Programmierstil
enthalten, wenn es (als logische Konsequenz dieses `Features') sogar
mit MUI inkompatibel war... Allerdings h&auml;lt, bei Verwendung des mitgelieferten (!) Module-Filetyps, basierend auf der (ebenfalls
beiliegenden) inovamusic.library, DOpus das HDToolBox Programm der Workbench
f&uuml;r ein Musik-Modul und will es abspielen. Beim Schlie&szlig;en des Playerfenster
kommt es dabei zu einem <B>Systemabsturz</B>. Soviel zur eigenen Kompatibilit&auml;t...</P>
<P>DOpus ist zwar lokalisiert und die deutschen Locale-Dateien werden
nat&uuml;rlich auch mitgeliefert, aber es wird wohl davon ausgegangen, da&szlig; man
keine deutsche Tastaturbelegung verwendet, da der, bereits bei DOpus5.5
gemeldete Bug, immer noch vorhanden ist.</P>
<P>Und zwar kann man mit dt. Tastaturbelegung die Lister nicht in den
PiktogrammPlus- (Icon-Action) Modus schalten, da dazu ein Sonderzeichen ben&ouml;tigt
wird, das nur &uuml;ber eine Tastenkombination zu erreichen ist, die dann von
DOpus nicht akzeptiert wird.</P>
<P>Bei dem Versuch diesen Mangel durch ein ARexx-Script zu beseitigen, fiel
mir noch auf, da&szlig; es nicht m&ouml;glich ist, den aktiven (!) Lister anzusprechen.
Ich kann zwar den Quell- und Ziellister manipulieren, aber es gibt keine
Chance an den gerade aktiven Lister zu gelangen, was die Funktionalit&auml;t
des <A HREF="../amz0997/uhl.htm#Script">Scripts</A> stark beeintr&auml;chtigt und auch generell eine starke
Einschr&auml;nkung darstellt.</P>
<P><B>Fazit:</B> (Update von DOpus5.5 auf DOpus5.61 Magellan)</P>
<P><B>DirectoryOpus</B> ist zwar um einiges stabiler als zuvor, aber das Update
erscheint mir mehr ein gr&ouml;&szlig;erer Bugfix zu sein, als ein wirkliches Update.</P>
<P>Das Update wird zwar mit vielversprechenden Worten angek&uuml;ndigt, wie z.B.
`... ist mehr, als ein einfaches Update', aber bei einem Updatepreis von
DM69,- plus Porto&Verpackung erwarte ich noch mehr.</P>
<P>Das Update ist nur f&uuml;r jemanden geeignet, bei dem DOpus5.5 &uuml;berhaupt
nicht stabil l&auml;uft und der nicht DOpus5.x verzichten will.</P>
<P>Insbesondere mit der Entwicklung von Scalos wird st&auml;rkere Konkurrenz
auftreten, die hoffentlich zu besseren Updatepreisen f&uuml;hrt. Zwar ben&ouml;tigt
Scalos noch ein paar Zusatztools, um in etwa die gleichen Funktionen zu
bieten, wie DOpus Magellan, aber diese Tools sind dann meist kostenlos
(z.B. Toolmanager) und Scalos liegt mit dem geplanten Preis von DM30,-
erheblich unter dem von DOpus.</P>
<P>Wer mit DOpus5.5 arbeiten kann, sollte dieses Update vielleicht besser
&uuml;berspringen und erst beim n&auml;chsten wieder zuschlagen. Denn wenn auch das
n&auml;chste Update wieder DM69,- kostet, h&auml;tte man selbst mit einem Neukauf
noch Geld gespart. :)</P>
<P><B>Anmerkung:</B></P>
<P>Ich m&ouml;chte betonen, da&szlig; sich meine Beurteilung auf das Update in
Verbindung speziell der deutschen Version im Vertrieb von Schatztruhe
bezieht. Meine Meinung zu DOpus 5.6 als komplettes Software-Paket ist
im Magellan-Test zu finden.</P>
<P><B>Die folgende Bewertung</B> bezieht sich also nur auf das Update von DOpus5.5
auf Magellan. Ich habe dabei auf eine spezifische Auflistung verzichtet,
da diese sich bei der Beurteilung von Magellan als Neukauf befindet.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR><TD><B>Produkt:</B></TD><TD>DOpus Magellan Update</TD><TD><B>Hersteller:</B></TD><TD><A HREF="http://www.gpsoft.com.au/index.html">Jonathan Potter/GPSoft</A></TD></TR>
<TR><TD><B>Art:</B></TD><TD>Dateimanager (WB-Ersatz)</TD><TD><B>Version:</B></TD><TD>5.61/62</TD></TR>
<TR><TD><B>Preis:</B></TD><TD>ca. 69 DM zzgl. Versandk.</TD><TD><B>Bez.Quelle:</B></TD><TD><A HREF="http://www.schatztruhe.de">Schatztruhe GmbH</A></TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD ALIGN=CENTER>4</TD><TD><CENTER>Unser AmZeigerchen meint daher:<BR><IMG SRC="../images/note4.gif" WIDTH="32" HEIGHT="52"></CENTER></TR>
</TABLE></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../sw/9709don.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0997/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../sw/9709scal.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

