<HTML>
<HEAD><TITLE>AmZeiger 09/97 - Preview: Scalos</TITLE></HEAD>
<BODY BACKGROUND="../images/bg.gif">
<CENTER><H1>PreView: Scalos</H1><BR>Bericht: <A HREF="mailto:A.Schlick@BBrandes.in-brb.de">Andreas Schlick</A></CENTER>
<P>F&uuml;r diesen Bericht wurde uns freundlicherweise eine Preview-Version von Scalos
zur Verf&uuml;gung gestellt. Ich m&ouml;chte mich daf&uuml;r bei Aliendesign (Stefan Sommerfeld
und Michael Knoke) herzlich bedanken.</P>

<P><B>Was ist Scalos?</B></P>
<P>Scalos geht es an, die nun langsam auch alt werdende Workbench zu ersetzen.
Es wird jedoch kein v&ouml;llig neues Prinzip wie bei DOpus5 sein, sondern Scalos
stellt alle alt gewohnten Funktionen der Workbench zur Verf&uuml;gung und erweitert
sie an entscheidenden Stellen. Dadurch gibt es auch auf den ersten Blick auch
keinen Unterschied zwischen der Workbench und Scalos.</P>
<P>Die Kompatibilit&auml;t ist sehr gut, so da&szlig; Scalos im Gegensatz zu DOpus5 auch
die Parameter&uuml;bergabe durch Multiselekt beherrscht.</P>
<P><B>Was bringt Scalos dann?</B></P>
<P>Erstmal unterst&uuml;tzt Scalos das Multitasking, so da&szlig; die Oberfl&auml;che nicht durch
einen einzelnen Vorgang angehalten wird. Das geschieht, indem jedes Fenster von
Scalos ein eigener Task ist.</P>
<P>Dadurch lassen sich auch mehrere Dateioperationen gleichzeitig ausf&uuml;hren. Jedes
der Fenster hat auch ein Gadget zum Ikonifizieren.</P>
<P>Ebenso wie DOpus5.62 unterst&uuml;tzt Scalos auch NewIcons direkt. Es lassen sich
bei Scalos auch s&auml;mtliche Men&uuml;s konfigurieren, so da&szlig; jeder Benutzer sich ein
eigenes, ihm am besten gefallendes Men&uuml; zusammenstellen kann.</P>
<P>Der Version lag jedoch eine Voreinstellung der Men&uuml;s bei, die in etwa den
Men&uuml;s der originalen Workbench entspricht, so da&szlig; man nicht gezwungen ist,
sofort eine v&ouml;llig eigene Version zu erstellen.</P>
<P>Ansonsten verfeinert Scalos die Workbench noch, indem z.B. auch MagicWB-Icons
verwendet werden k&ouml;nnen, ohne das ein entsprechender Patch l&auml;uft. (Dieses
Feature konnte ich jedoch nicht direkt verifizieren :(</P>
<P>Es lassen sich auch die Beschriftungen der Fenster v&ouml;llig frei konfigurieren.
Diese Einstellung l&auml;uft &uuml;ber diverse Platzhalter. Scalos bietet davon eine
Vielzahl, von der Anzahl der laufenden Tasks, &uuml;ber den Pfad des dargestellten
Verzeichnisses, &uuml;ber die Kickstart Version oder &uuml;ber die Anzahl der
Libraries, bis hin zum freien Speicher.</P>
<P>Scalos f&uuml;hrt nicht direkt ein neues Konzept ein, sondern erweitert nur an
bestimmten Stellen die alte Workbench. Vor Allem ist es nicht so ein
erschlagendes All-In-One Programm, wie DOpus5. So beinhaltet es z.B. nicht
die Buttonleisten. Die so fehlenden Zusatzfeatures k&ouml;nnen jedoch &uuml;ber
zus&auml;tzliche Tools, wie z.B. Toolmanager3, MagicMen&uuml; etc.
&quot;nachger&uuml;stet&quot; werden. Scalos besitzt auch eine API, so da&szlig; es sich auch
um fehlende Features leicht erweitern l&auml;&szlig;t.
<P>Man wird aber halt nicht gezwungen, sie zu benutzen. Interessant an Scalos
ist auch die Handhabung der Backgroundpatterns, die sich sehr stark
konfigurieren lassen. Zum Beispiel k&ouml;nnen sie f&uuml;r die verschiedenen Fenster
auch verschieden konfiguriert werden und sich syncron zu den Icons bewegen,
d.h. wenn man im Fenster hin- und herscrollt, bewegt sich der Hintergrund
mit.</P>
<P>Die Version, die wir erhalten haben, lief zwar noch nicht stabil und st&uuml;rzte
gelegentlich ab, aber hinterlie&szlig; bei mir schon einen guten Eindruck. Die
Vollversion von Scalos soll DM30 kosten, was ich als sehr guten Preis empfinde.
Unserer Version mangelte es zwar an einer Anleitung, so da&szlig; ich vielleicht
etwas falsch konfiguriert habe, aber ich hoffe doch stark, da&szlig; die Vollversion
eine Dokumentation hat. :-)</P>

<BR>
<TABLE ALIGN=CENTER BORDER=1>
<TR><TH>Produkt:</TH><TD><A HREF="http://user.cs.tu-berlin.de/~remuss/scalos/scalos.html">Scalos</A></TD><TH>Programmierer:</TH><TD><A HREF="http://user.cs.tu-berlin.de/~zerocom/aliendesign.html">Aliendesign</A></TD></TR>
<TR><TH>Preis:</TH><TD>ca. 30DM</TD><TH>Version:</TH><TD>k.A.</TD>
</TABLE>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9709dou.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0997/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9709fh.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
