<HTML><HEAD>
    <TITLE>AmZeiger 09/97 - DOpus Magellan Neukauf</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<CENTER><H1><U>DOpus Magellan / Neukauf</U></H1><BR>von<BR><A HREF="mailto:A.Schlick@BBrands.in-brb.de">Andreas Schlick</A></CENTER>
<P><B>Haben</B> Sie sich nicht schonmal ge&auml;rgert, da&szlig; die Workbench, trotz des
Multitaskings des Amigas, allein durch einen Kopiervorgang v&ouml;llig zum
Stillstand kommt?</P>

<P>Oder, da&szlig; Sie f&uuml;r komfortables Dateimanagement immer noch ein anderes
Programm starten mu&szlig;ten, wie z.B. DosControl, DOpus4 oder DiskMaster?</P>
<P>Dann ist vielleicht DOpus5 vielleicht das Richtige f&uuml;r Sie.</P>
<P>F&uuml;r die, die DOpus5 noch nicht kennen, werde ich erstmal versuchen, zu
beschreiben, wie die neue Philosophie von DOpus5.x aussieht. Als Referenz
beziehe ich mich auf DOpus4 bzw. &auml;hnliche Dateimanager (z.B. DosControl).</P>
<P>Es ist jedoch kaum m&ouml;glich das gesamte Spektrum von Einsatzm&ouml;glichkeiten
aufzuz&auml;hlen, f&uuml;r die DOpus5 sich eignet, zumindest, wenn man sich die Zeit
nimmt, sich mit dem Konzept vertraut zu machen.</P>
<P><B>DOpus4</B> basierte auf einem Zwei-Lister-Aufbau und einer sich darunter
befindlichen Knopfbank. In den Listern konnten verschiedene Verzeichnisse/
Files etc. angezeigt und markiert und mit der frei definierbaren Knopfbank
dann Operationen ausgef&uuml;hrt werden.</P>
<P>DOpus4 bot dabei fast das Maximum an Konfigurierbarkeit an. Von den
Kn&ouml;pfen &uuml;ber die Men&uuml;s, bis hin zu der Pixelbreite der Scrollgadget war
alles einzustellen. Dabei blieben jedoch die zwei Lister immer erhalten.</P>
<P><B>Mit DOpus5 wird nun eine andere Philosophie verfolgt.</B> DOpus5 kann nun zwar,
wie bisher, als eigenst&auml;ndiges Programm (mit zwei Listern) laufen und sich
dabei fast so wie DOpus4 verhalten, aber seine Leistungsf&auml;higkeit wird kaum
ausgereizt.</P>
<P>DOpus5.x soll eigentlich die Workbench ersetzen, d.h. der LoadWB-Befehl
der Workbench wird durch einen neuen ersetzt, so da&szlig; DOpus5 dann sich als
normaler Workbench-Screen &ouml;ffnet. Es ist jedoch auch weiterhin m&ouml;glich
DOpus getrennt auf einem eigenen Screen laufen zu lassen. Beim WB-Ersatz
wird der alte LoadWB-Befehl auch nicht gel&ouml;scht, sondern nur umbenannt.
Dieser wird dann unterst&uuml;tzt, indem man beim Booten die Shift-Taste
gedr&uuml;ckt h&auml;lt und dann statt DOpus5 automatisch die alte Workbench
geladen wird.</P>
<P>DOpus5 kann jetzt beliebig viele Lister &ouml;ffnen (ok, wenn der RAM voll ist,
nat&uuml;rlich nicht mehr :) Der Aufbau ist erstmal der Workbench &auml;hnlich, man
hat also einen Hintergrund-Screen/Fenster, auf dem sich die Festplatten-,
Diskettenicons etc. befinden.</P>
<P>Aber beim &Ouml;ffnen eines Laufwerks wird ein Dateilister ge&ouml;ffnet, der sich
in einem von drei verschiedenen Modi befindet und zwar Text, Piktogramm
oder PiktogrammPlus. Das Umschalten zwischen den Modi geschieht einfach
per Hotkey (das Umschalten in den PiktogrammPlus Modus geschieht bei
deutscher Tastaturbelegung leider nicht, aufgrund eines Bugs) oder per
Men&uuml;.</P>
<P>Im <B>einfachen <A NAME="Icon">Piktogramm</A>-Modus</B> sieht der Lister (fast) wie ein normales
Workbenchfenster aus.</P>
<P>Der <A NAME="Textmodus">Textmodus</A> bietet noch weitere Funktionen. In diesem Modus wird die
Verzeichnisstruktur, wie bei DOpus4, als Text dargestellt, aber es lassen
sich die dargestellten Informationen direkt im Lister ver&auml;ndern. Zum Bei-
spiel kann man im Dateilister auf eine Datei klicken, bis ein Cursor
erscheint, mit dem man dann den Filenamen per Tastatur direkt editieren
kann, ohne dazu eine spezielle Funktion aufrufen zu m&uuml;ssen. Das gleiche
gilt auch f&uuml;r die Schutzbits, Datum oder Kommentar.</P>
<P>Beim <B>Text- und <A NAME="IconAction">PiktogrammPlus</A>-Modus</B> wird das Fenster noch um eine konfi-
gurierbare Iconleiste erweitert, die schnellen Zugriff auf wichtige Datei-
operationen bietet, wie z.B. Umbennen, Kopieren, L&ouml;schen, Anzeigen etc.</P>
<P>Diese <A NAME="Toolbar"><B>Buttonleiste</B></A> ist auch konfigurierbar, was Funktion und die Icons
betrifft, so da&szlig; jeder sich seine eigene Umgebung zusammenstellen kann.
Jedoch ist die Kompatibilit&auml;t des Piktogramm (Plus) Modus zur Workbench
nicht v&ouml;llig gegeben. Bei der Workbench kann man durch Anw&auml;hlen eines
Programms und folgendem Multiselect per Shift-Taste weitere Projekte/
Dateien anw&auml;hlen und beim endg&uuml;ltigen Doppelklick wird dann das Programm
gestartet und die anderen Dateien werden gleich mitge&ouml;ffnet. Dies
funktioniert unter DOpus leider nicht mehr.</P>
<P>Von den Knopfb&auml;nken oder sogenannten <B>Startmen&uuml;s</B> k&ouml;nnen ebenso beliebig
viele erstellt werden. Die Konfigurierbarkeit der Startmen&uuml;s und der
normalen Knopfb&auml;nke ist, genau wie bei DOpus4, sehr umfassend und bietet
viele M&ouml;glichkeiten.</P>
<P>Desweiteren gibt es noch <B><A NAME="PopUp">PopUp</A>-Men&uuml;s</B>, die sich abh&auml;ngig vom Filetype noch
speziell erweitern lassen. Die <B>Filetypen</B> werden (&auml;hnlich zu DOpus4) in
einem eigenen Konfigfenster eingestellt. Die Erkennung kann &uuml;ber spezielle
Bytecodierungen der Datei selbst erfolgen oder einfach durch ein Patternmuster &uuml;ber
den Dateinamen. Als weitere Kriterien sind auch der Dateikommentar, die Schutzbits oder
das Erstellungsdatum etc. m&ouml;glich. Die diversen Auswahlkriterien lassen sich dann
noch als einfach Logik-Elemente per &quot;und&quot; bzw. &quot;oder&quot; verkn&uuml;pfen.</P>
<P>W&auml;hrend es bei DOpus4 definitiv war, wie Dateioperationen, die ein Quell-
und ein Zielverzeichnis ben&ouml;tigen, ablaufen (da z.B. f&uuml;r das Kopieren der
eine Lister automatisch das Quellverzeichnis ist und der andere das Ziel),
ist das bei DOpus5 nicht mehr gegeben, da ja nun mehrere Dateilister
gleichzeitig ge&ouml;ffnet werden k&ouml;nnen. Da die Zuordnung nicht mehr eindeutig
sein mu&szlig;, haben die Dateilister im PiktogrammPlus- und Text-Modus noch
eine Einstellung, ob sie als Quell- oder Zielverzeichnis verwendet werden
sollen, bzw. deaktiviert sind.</P>
<P>Um nun einen bestimmten Dateilister &uuml;ber z.B. ein ARexx-Script ansprechen
zu k&ouml;nnen, hat jeder Dateilister einen speziellen, eigenen ListerHandler.
Dabei fiel mir allerdings negativ auf, da&szlig; es nur m&ouml;glich ist, den
ListerHandler des Quell- oder Ziellister zu bekommen. Es besteht keine
M&ouml;glichkeit den aktiven Dateilister zu manipulieren (wenn es nicht gerade
der Quell/Ziellister ist).</P>
<P>Nachdem ich mehr schlecht als recht versucht habe, das Prinzip von DOpus5
zu erkl&auml;ren, gehe ich nun noch auf ein paar spezielle Punkte ein:</P>
<P><B><A NAME="PiktoPos">Piktogrammpositionierungssystem</A></B></P>
<P>Mit dem neuen Positionierungssystem k&ouml;nnen Bereiche auf dem Hintergrundfenster
definiert werden, in dem dann nur bestimmte Icons automatisch
abgelegt werden. Dadurch kommt endlich Ordung auf den Screen. :)</P>
<P>Man definiert dabei einen Bereich und stellt dann ein, welche Art von Icon
dort abgelegt werden soll. Unterschieden wird nach AppIcons, Disk, Lister/
Kn&ouml;pfe, Gruppen und ausgelagerten Icons. Danach werden dann z.B. alle neuen
DiskIcons nur an den Rand abgelegt, w&auml;hrend die AppIcons und Lister/Kn&ouml;pfe
sich in eine andere Ecke dr&auml;ngeln. Das System wird dann noch durch eine
Priorit&auml;tseinstellung verfeinert.</P>
<P><B>Konfiguration</B></P>
<P>DOpus Magellan l&auml;&szlig;t sich auch sehr stark an die W&uuml;nsche der User anpassen.
Leider wurden dabei im Vergleich zu DOpus4 auch Abstriche gemacht.</P>
<P>So l&auml;&szlig;t sich das WB-Men&uuml;, genau wie auch die meisten Popup-Men&uuml;s, zwar um
weitere Punkte erweitern, aber das vorgegebene Standardmen&uuml; l&auml;&szlig;t sich nicht
ver&auml;ndern.</P>
<P>Es lassen sich jedoch beliebig viele Filetypen erstellen, die DOpus dann
erkennt und je nach Aktion verschieden darauf reagiert. Desweiteren lassen
sich beliebig viele Dateilister und Knopfb&auml;nke &ouml;ffnen etc. etc.</P>
<P>Es mu&szlig; jedoch <B>gr&ouml;&szlig;te Vorsicht</B> bei der Verwendung des mitgelieferten
(Musik-)Module-Filetypes angeraten werden! Dieser Filetype benutzt die
ebenfalls mitgelieferte &quot;inovamusic.library&quot;.</P>
<P>Durch diesen Filetype kam es auf meinem Rechner zu h&auml;ufigen Abst&uuml;rzen, da
einige Programme als &quot;Module&quot; erkannt wurden und abgespielt werden sollten.
Beim Schlie&szlig;en des Player-Fenster von DOpus kam es dann zum Crash.</P>
<P>Jedoch lassen sich leider nicht alle Optionen mehr oder weniger komfortabel
per GUI einstellen. So gibt es z.B. noch eine ganze Reihe von Environment-
Variablen, die bestimmte Eigenschaften definieren. Meiner Meinung nach
leider auch nicht immer mit einer korrekten Beschreibung.</P>
<P>Es w&auml;re zwar meines Erachtens m&ouml;glich, f&uuml;r die Env-Variablen eine
Knopfbank mitzuliefern, aber darauf wurde verzichtet.</P>
<P><B>NewIcons-Unterst&uuml;tzung</B></P>
<P>Die NewIcons-Unterst&uuml;tzung wird in dem <A HREF="9708dou.htm">Updatebericht</A> beschrieben.</P>
<P><B>FTP-Modul</B></P>
<P>Seit Version 5.5 wird DOpus mit einem FTP-Modul ausgeliefert, das es erm&ouml;glicht,
mit den normalen Dateilistern auch FTP-Server zu benutzen. Daf&uuml;r
mu&szlig; aber nat&uuml;rlich ein TCP/IP Stack laufen, der online ist.</P>
<P>Das FTP-Modul wurde v&ouml;llig &uuml;berarbeitet. So lassen sich die FTP-Addressen
nun &uuml;ber ein ein Addressbuch mit GUI verwalten.</P>
<P>Leider bietet das FTP-Modul <B>kein ADT</B> (Aminet Download Tool), so da&szlig; man
beim Aminet-FTP-Server selber nach neuen Uploads suchen mu&szlig;. :(</P>
<P>F&uuml;r Standard-Anwendungen, wie Anonymous-FTP oder zum einfachen Uploaden,
ist das FTP-Modul sicher geeignet. F&uuml;r spezielle Anwendungen, die z.B. die
Eingabe von RAW-Commands erfordert, ist das FTP-Modul nicht geeignet.</P>
<P>Die Eingabe des FTP-Servers ist bei dem FTP-Modul gut gel&ouml;st. So kann man
einen Server entweder gleich &uuml;ber das Addressbuch eingeben und die
Verbindung starten oder man gibt in einem Dateilister als Verzeichnis die
Addresse des FTP-Servers ein, in der Form `FTP://ftp.foo.bar'. Ein
einfacher Connect-Befehl, der ein kleines Fenster zum Eingeben der
Adresse &ouml;ffnet, ist ebenfalls vorhanden.</P>
<P>Inwieweit das FTP-Modul wirklich benutzt wird, h&auml;ngt aber endg&uuml;ltig vom
Geschmak des Users ab. Es wird vermutlich den meisten das Benutzen eines
speziellen FTP-Tools, wie z.B. AmFTP oder AmiFTP, n&auml;her liegen, als das
FTP-Modul von DOpus.</P>
<P><B>Lha/Lzx/-Unterst&uuml;tzung</B></P>
<P>Auch DOpus 5.6 Magellan unterst&uuml;tzt die Archiver nicht direkt. Es wird
zwar ein Script-Paket mitgeliefert, das daf&uuml;r sorgt, da&szlig; man auch Lha/Lzx-
Archive wie normale Verzeichnisse benutzen kann und es l&auml;uft soweit auch
recht gut. Es sind jedoch nicht alle der Standard-DOpus-Funktionen
implementiert.</P>
<P>Es lassen sich damit z.B. keine Dateien in oder aus Archiven verschieben
oder Umbenennen oder mit CopyAs kopieren. Diese Funktionen lassen sich
zwar meist auch per Hand machen, so ist das Verschieben ja eigentlich nur
Kopieren und L&ouml;schen, aber es w&auml;re doch w&uuml;nschenswert auch solche
Annehmlichkeiten unterst&uuml;tzt zu wissen.</P>
<P><B>Dokumentation</B></P>
<P>Auch das neue DOpus wird wieder <B>ohne ein gedrucktes Handbuch</B> ausgeliefert.
Die Anleitung befindet sich auf der CD im AmigaGuide-, PowerGuide und
Wordworth-Format.</P>
<P>Aber selbst, wenn man von dem Fehlen des Handbuches absieht, ist es alles
andere als gut. Die Anleitung hat sich grundlegend seit Version5.5 nicht
ge&auml;ndert, so da&szlig; das Kapitel &quot;Einleitung&quot; den Abschnitt &quot;Erg&auml;nzungen f&uuml;r
Opus Magellan&quot; enth&auml;lt, das als eigenes File dabei liegt.<BR>
Dazu kommt dann noch die &quot;Liesmich.55&quot; von DOpus5.5 und &quot;Liesmich.Magellan&quot;.</P>
<P>Um also einen vollst&auml;ndigen &Uuml;berblick &uuml;ber DOpus Magellan zu bekommen, mu&szlig;
man die Anleitung von DOpus5.5 lesen, dann die Last-Minute-&Auml;nderung der
V5.5, dann die Erg&auml;nzung zu Magellan und dann zu guter Letzt auch nochmal
die Last-Minute &Auml;nderung der Magellan Version. :-(</P>
<P>Desweiteren existiert auch nicht zu jedem Fenster eine OnlineHilfe, so da&szlig;
das Suchen der Erkl&auml;rung zu einer Funktion zu einer rechten Qual ausarten
kann.</P>
<P><B>Fazit:</B></P>
<P><B>DOpus Magellan</B> ist eine sehr gute Software geworden. Vielleicht werden die
meisten von dem neuen Konzept etwas verwirrt sein, aber wenn man sich erstmal damit
vertraut gemacht hat, will man es nicht mehr missen. So
beinhaltet auch DOpus5.62/65 noch ein paar kleinere M&auml;ngel, die jedoch
meist nicht so auffallen.</P>
<P>Wer &uuml;ber den Kauf von DOpus Magellan nachdenkt, braucht zwar als Minimum
OS2.0, eine Festplatte, CD-ROM-LW und 2 MB RAM, aber mit einer solchen
Konfiguration wird die Arbeit mit DOpus kaum eine Freude werden. Vor allem
eine schnelle CPU und mehr RAM sollten f&uuml;r bequemes Arbeiten
vorhanden sein.</P>
<P>Falls es m&ouml;glich ist, sollte man sich vorher bei einem Freund oder
Bekannten das Prinzip von DOpus5 erstmal zeigen und erkl&auml;ren lassen, damit
man nachher nicht dasteht und nicht weiter wei&szlig;.</P>
<P>Mich pers&ouml;nlich hat DOpus5.x &uuml;berzeugt und ich will nicht mehr ohne
arbeiten, allerdings empfinde ich die von Schatztruhe gelieferte Support/
Updatepolitik etwas mager.</P>
<P><B>Features:</B></P>
<UL>
<LI>WB-Emulationsmodus</LI>
<LI>asynchrone Arbeitsweise</LI>
<LI>Start-Men&uuml;s, Buttonleisten</LI>
<LI>Filetyp-Erkennung</LI>
<LI>kontextsensitive PopUp-Men&uuml;s</LI>
<LI>Piktogramm-Positionierungssystem</LI>
<LI>weitgehend frei konfigurierbar (au&szlig;er Men&uuml;s)</LI>
<LI>FTP Modul</LI>
<LI>direkte NewIcons-Unterst&uuml;tzung</LI>
<LI>u.v.m.</LI>
</UL>
<P><B>Einschr&auml;nkungen/Bugs:</B></P>
<UL>
<LI>keine v&ouml;llig frei definierbaren Men&uuml;s, wie bei DOpus4</LI>
<LI>keine direkte Lha/Lzx/.. Unterst&uuml;tzung</LI>
<LI>umst&auml;ndliches <A HREF="../amz0997/uhl.htm#piktoplus">Umschalten</A> der Dateilister in den PiktogrammPlus-Modus per HotKey bei dt. Tastaturbelegung</LI>
<LI>Musikmodul-Erkennung per invomusic.library bugbehaftet</LI>
<LI>kein gedrucktes Handbuch</LI>
<LI>keine 100% Onlinehilfe</LI>
<LI>nicht 100% absturzfrei</LI>
<LI>keine Parameter&uuml;bergabe per Multiselect im Piktogramm(Plus)-Modus</LI>
</UL>
<BR>

<TABLE ALIGN=CENTER BORDER=1>
<TR><TD><B>Produkt:</B></TD><TD>DOpus Magellan</TD><TD><B>Hersteller:</B></TD><TD><A HREF="http://www.gpsoft.com.au/index.html">Jonathan Potter/GPSoft</A></TD></TR>
<TR><TD><B>Art:</B></TD><TD>Dateimanager (WB-Ersatz)</TD><TD><B>Version:</B></TD><TD>5.61/62</TD></TR>
<TR><TD><B>Preis:</B></TD><TD>ca. 99 DM zzgl. Versandk.</TD><TD><B>Bez.Quelle:</B></TD><TD><A HREF="http://www.schatztruhe.de">Schatztruhe GmbH</A></TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>1</TD><TD ALIGN=CENTER ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>4</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../sw/9709dom.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0997/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9709dou.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

