<HTML><HEAD>
    <TITLE>AmZeiger 09/97 - Flyin`High V1.0</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<CENTER><H1><U>Flyin`High 1.0</U></H1><BR>von<BR><A HREF="mailto:G.Franz@BBrands.in-brb.de">Gregor Franz</A></CENTER>

<P><CENTER><A HREF="../amz0997/sshots.htm#FH">Screenshots</A></CENTER></P>

<P><B>Selten</B> habe ich bei der Beurteilung eines Spieles in meiner Meinung so
geschwankt und dann festgestellt, da&szlig; Flyin` High einem die Sache nicht
zu leicht macht. Doch davon sp&auml;ter mehr.</P>
<P>Flyin`High kommt auf acht Disketten mit einer recht guten gedruckten
Anleitung, die (englisch und deutsch) das notwendige an Informationen zum
Spiel liefert. Eine identische CD-Version ist aber ebenfalls erh&auml;ltlich.</P>
<P>Die <B>Installation</B> gestaltet sich, dank der Nutzung des Standard-Installers,
problemlos. Als netter Gag &ouml;ffnet sich auf der Workbench nebenbei auch
noch ein kleiner Smiley, der einen mit einem Scrolltext schon auf das
Spiel einstimmt. Nachdem die Disketten vom Installer kopiert sind, werden
die Archive erst einmal entpackt, was etwas dauern kann.</P>
<P>An Festplattenplatz wird laut dem deutschen Teil der Anleitung 30 MByte
und laut dem englischen 18 MByte ben&ouml;tigt, was schon Spekulationen in
Bezug auf die deutschen Bildschirmtexte aufkommen lie&szlig; ;)</P>
<P>Es sind dann aber tats&auml;chlich etwa 16 MByte. Die <B>Mindestvoraussetzungen</B>
sind ansonsten ein Amiga 1200 mit 4 MByte FastRAM. `St&auml;rkere` Prozessoren
bis hin zum 68060 werden unterst&uuml;tzt und sind auch anzuraten.</P>
<P>Nun kann man <B>vor dem Spielstart</B> entweder mittels eines kleinen Prefs-
Programmes oder per Tooltypes einige Merkmale konfigurieren.</P>
<P>Da w&auml;re zum einen die M&ouml;glichkeit, das Spiel im DoublePAL-Modus laufen
zu lassen, die WB aus Speichergr&uuml;nden beim Spielstart zu schlie&szlig;en oder
einen alternativen Pfad zum Speichern der Einstellungen, Highscores usw.
anzugeben. Das Prefs-Programm hat hierbei Vorrang vor den Tooltypes.</P>
<P>Nach einer gutgelungenen bombastischen Intro erwartet einen ein
`Garagen-B&uuml;ro`. Hier kann man am `Computer` die Aufl&ouml;sung, Sichtweite
und Steuerungssensitivit&auml;t ver&auml;ndern. Das Multitasking bleibt &uuml;brigens
aktiv.</P>
<P>An <B>Aufl&ouml;sungen</B> stehen drei zur Verf&uuml;gung: 160 x 128 Pixel (entspricht
einem Viertel des Bildschirms mit 1x1 Pixel), 320 x 256 (voller Bildschirm mit 1x1) und 160 x 128 / Doppelte Gr&ouml;sse (also voller Bildschirm
mit 2x2). Beim letzten Modus wird das Multitasking ausgeschaltet.</P>
<P>Die <B>Sichtweite</B> hat f&uuml;nf Stufen von `Sehr Kurz` bis `Sehr Weit`. Die
<B>Steuerungssensitivit&auml;t</B> kann ebenfalls in f&uuml;nf Stufen von `Sehr Niedrig`
bis `Sehr Hoch` ver&auml;ndert werden.</P>
<P>Am Aktenschrank dient ein Schubfach zum Laden eines alten Spielstands
und eines zum Starten eines neuen Spiels.</P>
<P>Hier kann man den <B>Flyin`High-Cup</B>, den <B>Speed-Cup</B> oder den `<B>Teste Strecke</B>`-
Modus ausw&auml;hlen. Dann noch die Anzahl der Spieler (bis zu vier), der
Name des Spiels (zum Abbrechen und sp&auml;ter Wiedereinladen), sowie die
Namen der einzelnen Spieler.</P>
<P>Negativ f&auml;llt auf, das die Einstellungen nicht gepuffert werden. Wenn
man wieder aus der `Schublade` raus ist und sich pl&ouml;tzlich &uuml;berlegt,
das man z.B. doch einen anderen Cup fahren m&ouml;chte, so sind alle Einstellungen, wie Spiel- und Spielernamen erneut einzugeben, da die
entsprechenden Felder wieder gel&ouml;scht sind.</P>
<P>Am Kalender kann man sich noch die Highscores anschauen und per T&uuml;r ist
ein sauberer Ausstieg zur Workbench m&ouml;glich.</P>
<P>Das Spiel ist am ge&ouml;ffneten Garagentor zu starten. Wenn man den `Teste
Strecke`-Modus ausgew&auml;hlt hatte, so mu&szlig; man jetzt eine anw&auml;hlen.</P>
<P>Es handelt sich um jeweils f&uuml;nf Streckenabschnitte aus den `Welten`
<B>City, Forrest, Jungle und Snow</B>.</P>
<P>Der einzige Unterschied zwischen dem Flyin`High-Cup und dem Speed-Cup
ist der, da&szlig; beim ersteren die Punkte und Siegpr&auml;mien (&auml;hnlich wie bei
XtremeRacing) nach der erreichten Position vergeben werden und beim
Speedcup nach den schnellsten Rundenzeiten. Wer hier z.B. als letzter
ins Ziel kommt, aber die schnellste Runde im Rennen gefahren ist, hat
trotzdem gewonnen.</P>
<P>Echter <B>Kritikpunkt</B> ist die Gleichf&ouml;rmigkeit der Cups. Bei beiden f&auml;hrt
man erst hintereinander die f&uuml;nf Strecken der ersten Welt ab, dann die
der n&auml;chsten usw. Obwohl die Streckenabschnitte innerhalb einer Welt
erfreulicherweise ziemlich differieren k&ouml;nnen, also neue Elemente
einbringen, so ist doch das Fahren von nacheinander 25 Runden in ein
und derselben Welt ziemlich langwierig, bis man endlich eine andere
erreicht. Denn:</P>
<P>Egal welchen Cup bzw. Modus man f&auml;hrt: Immer m&uuml;ssen 5 Runden absolviert
werden. Schade, da&szlig; man das nicht ver&auml;ndern kann.</P>
<P>Vielleicht wurde bei der Spielentwicklung gedacht, da&szlig; es ja Unsinn sei,
z.B. von der Stadt direkt in den Dschungel und von dort wieder in den
Schnee zu fahren, aber ein zus&auml;tzlicher abwechsungsreicherer Cup w&uuml;rde
dem Spiel guttun.</P>
<P>Neben diesen ganzen, eher technischen Daten, z&auml;hlt aber insbesondere die
Grafik w&auml;hrend des Spiels und die Spielbarkeit. <B>Wie sieht es damit aus?</B></P>
<P>Man steuert einen Buggy mit der altbekannten Lotus-Perspektive gegen
sieben andere bis man die Ziellinie erreicht. Die Steuerm&ouml;glichkeiten
des Buggys sind auch sehr &auml;hnlich zu Lotus, man kann also z.B. nicht
pl&ouml;tzlich wenden und zur&uuml;ckfahren.</P>
<P>Etwas seltsam am Start, sind die zur Ampel unsynchronen ablaufenden
Sprachsamples, nach denen man sich nicht richten sollte. Die SoundFX bleibt
ansonsten lediglich im normalen Standardbereich.</P>
<P><B>Die Grafik</B> ist gut bis sehr gut, je nach Modus. Im 1x1-Modus sucht sie
auf dem Amiga und in dieser Geschwindigkeit teilweise ihresgleichen.
Das aber wurde mir erst nach intensivem Testen der Einstellm&ouml;glichkeiten
klar. Denn am Anfang war ich schwer entt&auml;uscht.</P>
<P>Der 302x256 - 1x1 Pixel-Vollbildmodus ist viel zu langsam auf einem
68030-25MHz und auch einer mit 50 MHz reicht nicht zum ordentlichen Spielen.
Das aber selbst der 2x2-Vollbildmodus auch etwas z&auml;h war, was die
Steuerbarkeit betrifft und das man auch kaum Chancen hatte, mal vor dem Siebenten
durchs Ziel zu kommen, das schlug sich doch etwas auf den Spielspa&szlig; nieder.
</P><P>Dabei hatte ich die `Steuerungssensitivit&auml;t` schon auf das maximale
eingestellt. (Wof&uuml;r die Abstufungen n&ouml;tig sind, ist mir nicht ganz klar,
aber vielleicht ist das auf einem 68060 ja n&uuml;tzlich ;)</P>
<P>Der kleine 1x1-Modus mit 160x128 Pixeln und relativ flotter
Geschwindigkeit, bei sehr detaillierter und wirklich sch&ouml;ner Grafik, machte das wieder
etwas wett, konnte aber nicht meine Chancen erh&ouml;hen. Jetzt kann man nat&uuml;rlich
l&auml;stern... :)</P>
<P>Tats&auml;chlich zeigten sich aber mit neuen Einstellungen &Auml;nderungen. Es ist
klar: je h&ouml;her die Sichtweite, umso h&ouml;her auch die CPU-Belastung, deshalb
hatte ich auch die goldene Mitte gew&auml;hlt, denn man m&ouml;chte ja noch ungef&auml;hr
erkennen, wo man hinfahren mu&szlig;.</P>
<P>Das gen&uuml;gte aber nicht auf meinem System, denn zum Beispiel bei `Sehr
Kurzer` Sicht geht alles wesentlich flotter und insbesondere, was ich
nicht vermutete, ist der Buggy auch deutlich sp&uuml;rbar besser steuerbar
geworden.</P>
<P>Im Spiel kann man gelegentlich auch etwas <B>einsammeln</B>, z.B. Raketen,
Turbos und Geld. Nach dem man eine Strecke absolviert hat, kann man das
Geld auch in Raketen, Turbos und neue, bessere Reifen investieren. Die
Reifen gelten aber leider nur f&uuml;r den n&auml;chsten Abschnitt.</P>
<P>Umst&auml;ndlich ist das Aktivieren gel&ouml;st. Mitten im angespannten Fahren soll
man die Return-Taste zum Anw&auml;hlen (gegebenfalls mehrmals) bet&auml;tigen und
dann zum Ausl&ouml;sen Feuer am Joystick dr&uuml;cken. Lustig wirds bei mehreren
Spielern mit ihren jeweiligen Tasten.</P>
<P>Das `gehemmte` Fahren liegt aber nicht nur an den Einstellungen, sondern
auch an einigen Merkmalen des Streckendesigns. Oft kann man die Geschwindigkeit des
Fahrzeuges (und der Grafik-Engine) gar nicht ausfahren, weil
es nicht gen&uuml;gend lange gerade Stra&szlig;enabschnitte gibt oder st&auml;ndig diverse
<B>Hindernisse</B> im Weg sind.</P>
<P>Denn die haben es in sich: Wenn man auf ein Hindernis f&auml;hrt, ja es auch
nur streift, so dreht sich der Buggy um sich selbst und wird auf fast
Null abgebremst. Das &Auml;rgerlichste ist aber, da&szlig; man teilweise vor einem
neuen Hindernis `abgesetzt` wird und dank der eingeschr&auml;nkten
Steuerungsf&auml;higkeiten des Buggys nicht ausweichen kann, sondern beim Anfahren
gezwungen ist, dagegenzufahren, sich dann wieder um sich selbst zu drehen
usw.</P>
<P>Ja es gibt Stellen, an denen man beim normalen Fahren nicht allen
Hindernissen ausweichen kann und dann von einem `Rammbock` zum n&auml;chsten
durchgereicht wird, was den Spielflu&szlig; ungemein st&ouml;rt und Siegchancen
veringert. Weniger w&auml;re hier mehr!</P>
<P>Wenn der Buggy nicht so &uuml;berreagieren w&uuml;rde, so w&auml;re am Leveldesign
ansonsten sicherlich nicht soviel auszusetzen. Doch die Kombination ist
manchmal ungl&uuml;cklich.</P>
<P>Ansonsten gibt es aber auch viel <B>positive Details</B>, wie z.B. ein kr&auml;ftiger
Bullenf&auml;nger am Bug, aufleuchtende Bremslichter, Funken beim Schaben an
W&auml;nden, Staubwolken und Aufb&auml;umen beim Start, Schatten unter dem Fahrzeug
etc.</P>
<P><B>Die Strecken</B> wirken sehr dreidimensional, mit H&uuml;geln und Bergen, so da&szlig;
der Buggy auch h&auml;ufig vom Boden abhebt. Wenn man durch Tunnel f&auml;hrt, so
wird der Filter zugeschaltet, so da&szlig; die Musik dumpfer klingt. Einfach,
aber wirkungsvoll.</P>
<P>Leider ein kleiner Wermutstropfen: Obwohl die Musik nicht schlecht ist,
kann es doch passieren, da&szlig; sie mit der Zeit nervt. Abschalten kann man
sie aber nicht.</P>
<P>Zwischen den Welten stimmen gerenderte Animationen guter Qualit&auml;t auf den
n&auml;chsten Abschnitt ein.</P>
<P>Oftmals hat man leider auch gro&szlig;e Probleme die Zwischenergebnisse zu
erkennen, da der (vergr&ouml;&szlig;erte) Zeichensatz, der sie anzeigt, zu allem
&Uuml;berflu&szlig; auch noch multicoloriert wurde (mehrfarbig ist), so da&szlig; er
einfach zu br&ouml;selig wirkt.</P>
<P>Noch zum <B>Mehrspielermodus</B>: Flyin`High unterst&uuml;tzt einen 4-Spieler-Adapter
und splittet die Screens nicht wie meist &uuml;blich, sondern bietet jedem
Spieler (s)einen Viertel-Screen. Nat&uuml;rlich h&auml;ngt die Geschwindigkeit vom
verwendeten System und der Anzahl der Mitspieler ab.</P>
<P><B>Welches Fazit</B> kann ich ziehen? Flyin`High hat es mir, wie erw&auml;hnt, nicht
leicht gemacht. Eine gute und leistungsf&auml;hige Grafikengine, die man durch
intensives Testen der Einstellungen auf sein System (das nicht zu gering
dimensioniert sein sollte) anpassen mu&szlig; und aufwendigem, sehr guten Design,
steht eine doch etwas eingeschr&auml;nkte Spielbarkeit gegen&uuml;ber, die
Geschmackssache ist und sich auf schnelleren Systemen etwas steigert.</P><P>
Wer die M&ouml;glichkeit hat, sollte vor einem Kauf probespielen.</P>

<P>
<TABLE ALIGN=CENTER BORDER=1>
<TR><TD><B>Produkt:</B></TD><TD>Flyin`High</TD><TD><B>Hersteller:</B></TD><TD>P.U.R.E.-Design</TD></TR>
<TR><TD><B>Art:</B></TD><TD>Autorennen</TD><TD><B>Version:</B></TD><TD>1.0</TD></TR>
<TR><TD><B>Preis:</B></TD><TD>69.95 DM (CD oder Disk)</TD><TD><B>Bez.Quelle:</B></TD><TD>APC&amp;TCP</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2>Festplattenspielbar?</TH><TD COLSPAN=2 ALIGN=CENTER>Ja</TD></TR>
<TR><TH COLSPAN=2>Exit zur Workbench?</TH><TD COLSPAN=2 ALIGN=CENTER>Ja</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Grafik:</B></TD><TD ALIGN=CENTER>1</TD><TD ALIGN=CENTER ROWSPAN=6><IMG SRC="../images/note3.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>SoundFX:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Musik:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Spielbarkeit:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Spielspa&szlig;:</B></TD><TD ALIGN=CENTER>4</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TH COLSPAN=2 ALIGN=CENTER>3</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2>Vertrieb:</TD><TD COLSPAN=2>APC&TCP, Dorfstra&szlig;e 17, 83236 &Uuml;bersee</TD></TR>
</TABLE>
</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../sw/9709scal.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0997/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9709eura.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

