<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Aminet27</title>
</head>
<body background="cd_aminet27.jpg" text=black link=blue alink=red bgcolor="#FFFFCC"><br>
<font color="#800000" size="7">
<center><b>WILLKOMMEN ZUR AMINET CD 27</b></font></center><br>
<p>
<img hspace=10 vspace=4 src="cd_aminet27a.jpg" alt="[ CDROM Cover ]" width=228 height=233 align=right>
Wie auf dem Disklabel sehr gut zu sehen ist, ist diesmal das Spiel Kangfu als
Bonbon dabei. Es handelt sich nat&uuml;rlich nur um eine Demoversion von 12,8 MB
Gr&ouml;&szlig;e ohne eine Einstellm&ouml;glichkeit des Schwierigkeitsgrades und nur eine Welt.
Zum Kennenlernen und Geschmackbekommen dieses Spieles ist dies aber eine sehr
gute Wahl. Es ist mir leider nicht bewu&szlig;t, ob in der NoCover jemals eine
Vorstellung oder Besprechung dieses Spieles war. Wenn dies noch nie geschah,
irgendwann wird dies bestimmt von kompetentere Seite als von mir noch
vorgenommen werden.</p>
<p>
Sehen wir uns also die Daten an. Da ich &uuml;ber meine Aufbereitung der Aminet26
keinerlei Echo bekommen habe, nehme ich an, dass diese Art der Vorstellung etwas
ungl&uuml;cklich war und vereinfache diesmal die Komplettinhaltsangabe. Es kann
sehr leicht vorkommen, dass ich eine wirkliche Neuheit, die ich einfach
&uuml;bersehen habe, nicht ausreichend und w&uuml;rdigend erw&auml;hne.</p>
<p>
In biz/dbase ist z.Zt. viel los. So gibt es MUI Ligamaster, eine Datenbank f&uuml;r
Sportergebnisse, besonders f&uuml;r Fu&szlig;ball. Das Programm Worldcup98 ben&ouml;tigt diese.
Weiter ist auch die deutsche Dokumentation (in AmigaGuide und TeX DVI) inklusive
dem Hauptprogramm f&uuml;r Fiasco 2.2 da. Wer aber MicroBase 4.0.0 sich anschauen
m&ouml;chte, muss etwas vorsichtig sein. Die Daten bank wird auf dem Bildschirm
in der Gr&ouml;&szlig;e 640*256 dargestellt. Auf 800*600 sieht dies schrecklich aus.
Fast alle Beispiel-IFFs sind gleicher Gr&ouml;&szlig;e, aber es gibt auch Ausnahmen, wie
z.B. 640*512 (wenige) und 600*425. Das Programm ist nicht auf den eigenen
Schirm anzugleichen und irgendwo ist noch ein Bug, denn Abmeldung war nur noch mit
dem Affengriff m&ouml;glich. Bei der Installation wird die eigene Libs-Datei ohne
Vorwarnung mit Rexxmathlib mit Version 1.31 &uuml;berschrieben. Vielleicht sogar
noch mehr, was ich vielleicht nicht mitbekommen habe.</p>
<p>
Die neueste Version von AWeb-II-3.2 ist als Demo in biz/demo vorhanden. Was ich
aber vermisse, ist das genaue Herausstellen des Unterschiedes zur Version 3.1
und so kann ich nicht beurteilen, ob hier etwas gravierend Neues erschienen ist,
oder ob nur Bugs beseitigt wurden.</p>
<p>
<a href="cd_aminet27b.jpg" target="_top"> <img hspace=10 vspace=4
src="cd_aminet27b.jpg" alt="[ STFax Pro ]" width=276 height=128 align=left></a>
Weiterhin ist die neueste Version als Demo von STFax Pro 3.3 vorhanden, nach
meinem Daf&uuml;rhalten das beste FAX Programm f&uuml;r den Amiga. Auch ist es jetzt
verh&auml;ltnism&auml;&szlig;ig leicht, dieses Programm als Telefonbeantworter fungieren zu
lassen. Leider liegen nur eine englische Dokumentation (Guide und HTML) und ein
italienische Catalog vor. Aber nach erstem Eindruck ist diese Version gegen&uuml;ber
V3.0 nicht mehr so absturzfreudig. Diese Demoversion ist die Vollversion, aber
nur mit einer Betriebsdauer von jeweils h&ouml;chstens zwei Stunden &uuml;ber 30 Tage. Da
dies f&uuml;r viele kein Hinderungsgrund ist, steht aber auf jeder FAX-Seite, dass
dies mittels der Demo-Version gesendet wurde. Ein Upgrade f&uuml;r 29,95 engl. Pfund
hebt diese Beschr&auml;nkungen auf. Da jetzt nur eine englische Bezugsadresse
angegeben ist, scheint der deutsche Distributor nicht mehr aktuell zu sein.
Vielleicht hat sich f&uuml;r viele aber das Problem FAX erledigt, da in zunehmender
Weise e-Mails salonf&auml;higer werden. Um das Bild genauer betrachten zu k&ouml;nnen, es
einfach anklicken. Wie man denken und sehen kann, MUI3.8 wird vorausgesetzt.</p>
<p>
In docs/lists finden wir neuerdings eine AmigaGuide &uuml;ber alle (??) Amigah&auml;ndler,
aufgeteilt nach 1. Stelle der Postleitzahlen. Die beiden jungen Autoren bitten
aber inst&auml;ndig darum, &uuml;ber neue Erkenntnisse und Ver&auml;nderungen unterrichtet zu
werden.</p>
<p>
In misc/math ist ein Abacus. Bei Hinschauen ist es ein Rechner in Form
eines Taschenrechners, bzw in Abwandlung des WB-Kalkulators. Er hat mehrere
Memoryfunktionen, aber der Doc-Text ist nur in polnisch gehalten.<br>
Ebenfalls unter misc/math gibt es ein Programm "TelekomRechnung". Dies ist
eine Abrechnungsm&ouml;glichkeit f&uuml;r eine Wohngemeinschaft (WG) und ben&ouml;tigt das
Programm TurboCalc 2.0 oder neuer.</p>
<p>
In biz/misc gibt es ein Haushaltsbuch, nennt sich Buchhaltung und ist f&uuml;r einen
PAL/Hires Screen ausgelegt. Trotzdem kann man es sich ja mal anschauen. Getestet
habe ich es aber nicht. Deswegen keine Aussage &uuml;ber die Funktionalit&auml;t.</p>
<p>
Dies war nun ein ganz kleiner Querschnitt und ohne Wertigkeit &uuml;ber das Gesamtwerk.
Es lohnt sich bestimmt wieder genauer hinzuschauen. Auch der Ordner Pix ist
diesmal sehr gro&szlig; ausgefallen.</p>
<p>
<a name=a1>Hier eine globale &Uuml;bersicht &uuml;ber Aminet27:</a><br><center>
<table border="2" cellpadding="3" cellspacing="3" width="80%">
<tr><td> <a href=cd_aminet27a.html#a1> &quot; biz  &quot; </a></td>
<td> Business software </td><td align="right"> 26,6 MB </td><td>&#160;</td></tr>
<tr><td> <a href=cd_aminet27a.html#a2> &quot; comm &quot; </a></td>
<td> Communications </td><td align="right"> 20,6 MB </td><td>&#160;</td></tr>
<tr><td> &quot; demo &quot; </td>
<td> Gfx and sound demos </td><td align="right"> 87,9 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet27a.html#a3> &quot; dev  &quot; </a></td>
<td> Development software </td><td align="right"> 17,6 MB </td><td>&#160;</td></tr>
<tr><td> <a href=cd_aminet27a.html#a4> &quot; disk &quot; </a></td>
<td> Disk/Harddisk tools </td><td align="right">  2,2 MB </td><td>&#160;</td></tr>
<tr><td> <a href=cd_aminet27a.html#a5> &quot; docs &quot; </a></td>
<td> Text documents </td><td align="right"> 31,6 MB </td><td>&#160;</td></tr>
<tr><td> &quot; game &quot; </td>
<td> Games </td><td align="right"> 47,5 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet27a.html#a6> &quot; gfx  &quot; </a></td>
<td> Graphics </td><td align="right"> 13,3 MB </td><td>&#160;</td></tr>
<tr><td> <a href=cd_aminet27a.html#a7> &quot; hard &quot; </a></td>
<td> Hardware </td><td align="right"> 2,4 MB </td><td>&#160;</td></tr>
<tr><td> <a href=cd_aminet27a.html#a8> &quot; misc &quot; </a></td>
<td> Miscellaneous </td><td align="right"> 40,1 MB </td><td>&#160;</td></tr>
<tr><td> &quot; mods &quot; </td>
<td> Music modules </td><td align="right"> 83,1 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet27a.html#a9> &quot; mus  &quot; </a></td>
<td> Musical software </td><td align="right"> 20,9 MB </td><td>&#160;</td></tr>
<tr><td> &quot; pix  &quot; </td>
<td> Pictures </td><td align="right"> 130,0 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet27a.html#a10> &quot; text &quot; </a></td>
<td> Text related </td><td align="right"> 3,5 MB </td><td>&#160;</td></tr>
<tr><td> <a href=cd_aminet27a.html#a11> &quot; util &quot; </a></td>
<td> Utilities </td><td align="right"> 24,6 MB </td><td>&#160;</td></tr></table></center>
</p>

<br><br><center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://home.chiemgau.com/amagerl/members/wolf/index.htm"> http://home.chiemgau.com/amagerl/members/wolf </a>
</font>
<br>
<center>
<a href="NoCover.html"> <img border=0 src="l_hauptinhalt.jpg" width=495 height=75></a>
</center></table></center></center>
</BODY>
</HTLM>
