<HTML>

<HEAD>

<TITLE>Datatype</TITLE>

</HEAD>

<BODY LINK="#0000ff" VLINK="#800080" BACKGROUND="dthg.jpg">



<FONT COLOR="#000000"><P>&nbsp;</P>

</FONT><FONT COLOR="#ffffff"><H1 ALIGN="CENTER">Welcome in the</H1>

</FONT><P ALIGN="CENTER"><IMG SRC="logo.gif" WIDTH=385 HEIGHT=185></P>

<I><FONT COLOR="#ffffff"><H1 ALIGN="CENTER">Verden</H1>

</I></FONT><P ALIGN="CENTER"></P>

<B><FONT COLOR="#00ffff"><P ALIGN="CENTER">Wie mittlerweile ja sicherlich nahezu alle Mitglieder es schon mitbekommen haben, hat sich unsere Club-Mailbox, die HIGHVOLTAGE in &Uuml;bersee leider in Rauch und Asche aufgel&ouml;st.</P>

<P ALIGN="CENTER">&nbsp;</P>

<P ALIGN="CENTER">Daher weist der </FONT><FONT COLOR="#ffffff">APC &amp; TCP - Verden</FONT><FONT COLOR="#00ffff"> an dieser Stelle noch einmal darauf hin, da&szlig; wir allen Mitgliedern vom APC&amp;TCP einen kostenlosen Point mit EMail-Adresse in unserer Service-Support-Mailbox, </FONT><FONT COLOR="#ffffff">der Datatype BBS Verden</FONT><FONT COLOR="#00ffff"> zur freien Verf&uuml;gung stellen.</P>

<P ALIGN="CENTER">&nbsp;</P>

<P ALIGN="CENTER">Starte also JETZT Dein Terminal-Programm und logge Dich direkt in der</P>

</B></FONT><FONT COLOR="#ffffff"><H1 ALIGN="CENTER">Datatype BBS Verden</H1>

</FONT><B><FONT COLOR="#00ffff"><P ALIGN="CENTER">ein. Dort kannst Du direkt einen Userantrag ausf&uuml;llen und erh&auml;ltst v&ouml;llig unb&uuml;rokratisch und innerhalb von 24 Stunden einen Point eingerichtet. Deine k&uuml;nftige EMail-Adresse ist dann .....</P>

</FONT><FONT COLOR="#ffffff"><P ALIGN="CENTER">Dein Name @ Datatype.Capella.de</P>

</FONT><FONT COLOR="#00ffff"><P ALIGN="CENTER">.... wobei "DeinName" nat&uuml;rlich frei w&auml;hlbar ist ;-)</P>

<P ALIGN="CENTER">F&uuml;r ALLE, die sich f&uuml;r die DF&Uuml; &uuml;berhaupt noch nicht begeistern konnten : nichts geht so schnell, einfach und kosteng&uuml;nstig, wie die Kommunikation per EMail. Ihr ben&ouml;tigt lediglich ein Modem und zB. unsere Service-Support-Mailbox, - die Datatype BBS Verden und dann noch ein Terminalprogramm aus dem riesigen PD-Amigamarkt, wie zB. "Term" oder "NComm" - und schon kann es losgehen.</P>

<P ALIGN="CENTER">Hilfreich zur Seite stehen Euch die freundlichen CoSysOps und der SysOp der Datatype BBS Verden - </P>

</FONT><FONT COLOR="#ffffff"><P ALIGN="CENTER">Frank Mackowiak</FONT><FONT COLOR="#00ffff"> !</P>

<P ALIGN="CENTER">Falls Du schon eine EMailadresse hast, aber gerne noch sicherheitshalber ein zweites Postfach eingerichtet haben m&ouml;chtest, ist das auch kein Problem. N&auml;here Informationen kannst Du beim SysOp Frank unter der EMailadresse : </B></FONT><A HREF="mailto:Rudi@Datatype.Capella.de">Rudi@Datatype.Capella.de</A></P>

<B><FONT COLOR="#00ffff"><P ALIGN="CENTER">oder auch beim CoSysOp Cord : </B></FONT><A HREF="mailto:Higgins@Datatype.Capella.de">Higgins@Datatype.Capella.de</A></P>

<B><FONT COLOR="#00ffff"><P ALIGN="CENTER">bekommen.</P>

<P ALIGN="CENTER">Die Datatype hat sehr viel mehr zu bieten, als so manch andere Mailbox. Es gibt nicht nur Hunderte von verschiedenen "Brettern" thematisch geordnet, sondern zB. auch demn&auml;chst ein direkter Anschlu&szlig; zum Aminet, wodurch Ihr jederzeit auf die aktuellste Amiga-PD-Software Zugriff habt. Au&szlig;erdem haben wir eine, der gr&ouml;&szlig;ten Festplattendatenbanken in unserer Datatype und viele hundert Druckertreiber f&uuml;r den Amiga. Und Shapeshifter- sowie PC-Task-Freunde finden ebenfalls jede Menge PD-Software f&uuml;r Macintosh und PC.</P>

<P ALIGN="CENTER">Auch die Firma </FONT><FONT SIZE=5 COLOR="#ff0000">ALL SYSTEMS</FONT><FONT COLOR="#00ffff"> ist in der Datatype BBS Verden zuhause und bietet dort viele Katalogseiten mit unz&auml;hligen Angeboten f&uuml;r alle Computerbegeisterte an. Ob nun Zubeh&ouml;r oder Komplettsysteme (Multimedia-PC bereits UNTER tausend Mark !), da ist immer mal ein Schn&auml;ppchen zu machen.</P>

<P ALIGN="CENTER">Zus&auml;tzlich werden alle Datatype-User regelm&auml;&szlig;ig mit aktuellen News der Computerszene (nat&uuml;rlich auch beim Amigasystem) versorgt und weitere Informationen kann man dann in ausf&uuml;hrlicher Form kostenlos dazu bestellen. Und wer Linux installiert hat, wird sich &uuml;ber dieverse Linux-Bretter sicher freuen.</P>

<P ALIGN="CENTER">Auch der APC&amp;TCP hat in der Datatype seinen eigenen Bereich und bietet die NoCover stets aktuell zum Download an, - &uuml;brigens genauso, wie die "Amiga Aktuell" und weitere Online-Magazine.</P>

<P ALIGN="CENTER">Leider habe ich kaum Zeit, unsere Datatype noch genauer vorzustellen, was ich zu gegebener Zeit gerne nachholen werde. Also macht doch einfach mal einen Besuch in unserer zweiten Club-Mailbox und schaut Euch selbst ein wenig dort um. Wir freuen uns hier &uuml;ber jeden Gast.</P>

<P ALIGN="CENTER">Worauf wartest Du denn jetzt noch ???</P>

<P ALIGN="CENTER">Komm in die ....</P>

</B></FONT><P ALIGN="CENTER"><IMG SRC="logo.gif" WIDTH=385 HEIGHT=185></P>

<I><FONT COLOR="#ffffff"><H1 ALIGN="CENTER">Verden</H1>

</I></FONT><P ALIGN="CENTER">&nbsp;</P>

<FONT COLOR="#ffffff"><H2 ALIGN="CENTER">Line 1 (24h online bis 33.600 bps) : 04232 / 3045</H2>

<H2 ALIGN="CENTER">Line 2 (00:oo - 06:oo Uhr bis 33.600 bps) : 04232 / 7362</H2>

<FONT COLOR="#00ffff"><P ALIGN="RIGHT">Cord Hagen</P></FONT></BODY>

</HTML>

