-<HTML>
<HEAD>
<TITLE> Feedback-Corner zur NoCover 56 </TITLE>
</HEAD>
<BODY BACKGROUND=fcbg.png TEXT=black link=blue alink=red bgcolor=white>

<P><CENTER> <IMG SRC=fctitle.gif WIDTH=506 HEIGHT=35 ALT=FEEDBACK-CORNER>
</CENTER> </P>
<DL>
<LH></LH>
<DT><STRONG>  Interview
</STRONG><DD> Super gemacht! Mir gef&auml;llt die Fragestellung, bei der
man gleich einige Hintergrundinfos mitgeliefert bekommt sehr gut. Das
Layout gef&aumllt mir auch sehr, da es durch das Farbspiel sehr
&uuml;bersichtlich ist und auch die anderen Features von HTML
(variable Schriftgr&ouml;&szlig;e, &quot;ungeordnete Listen&quot;, ...)
sinnvoll eingesetzt wurden ohne alles zu &uuml;berf&uuml;llen. Der
einzige Kritikpunkt sind die Antworten von Petro (mit dem unaussprechlichen
Nachnamen) Tyschtschenko, die nat&uuml;rlich mal wieder sehr ausweichend
sind. Aber daran kannst du ja leider nichts &auml;ndern Jochen.

<DT><STRONG> Amiga Aktuell
</STRONG><DD> Wie immer ver&ouml;ffentlicht Carsten Schr&ouml;der hier
die aktuellsten Infos. Das Layout? Dar&uuml;ber sollte man hinwegsehen
bei diesem Umfang an Daten. Ich kann jedem den E-Mailservice empfehlen!
Ihr findet n&auml;mlich wichtige Infos schon in eurem Postfach, bevor
Carsten sie in der Amiga Aktuell ver&ouml;ffentlicht.

<DT><STRONG> Mitgliederliste
</STRONG><DD> EIN einziges Mitglied fehlt noch bis zur 100. In dieser
NoCover hoffe ich doch, dass Rainer es endlich geschafft hat und bei
hundert angekommen ist. <BR>
F&uuml;r mich ist die Mitgliederliste ein wichtiger Bestandteil der
NoCover geworden. Wenn ich mal eine E-Mailadresse suche, oder wissen
will ob ich jemanden eine HD-Disk schicken kann schaue ich in dieser
Liste nach. Auch der Artikel MP-HTML aus der NC55 wurde erst durch
diese Liste m&ouml;glich. <BR>
Einziger Kritikpunk: Ich finde das t&uuml;rkis unter AWeb3.1
h&auml;sslich, mit Voyager sieht es einigerma&szlig;en aus und nur
unter IBrowse gef&auml;llt mir diese Farbe (wenn nicht Voyager
gleichzeitig l&auml;t). Eine kleine Hintergrundgrafik stattdessen
w&auml;re vielleicht nicht schlecht.

<DT><STRONG> FD-Hitparade
</STRONG><DD> Auf den ersten Pl&auml;tzen bleibt immer alles gleich,
deshalb schaue ich dort kaum noch rein. Dem Layout sieht man an, dass
sich hier jemand viel M&uuml;he gegeben hat. Ein kleiner Tip: Bei dem
Sponsor ist so ein hervorstechender Rahmen drum, der signalisiert, dass
es ein Link ist. Stefan, f&uuml;ge doch einfach auch dort BORDER=0 in
die den IMG-Befehl ein.

<DT><STRONG> Championchip 2
</STRONG><DD> Gute Idee! Ich habe nur leider das Spiel nicht.

<DT><STRONG> Lambda Info
</STRONG><DD> Was ist das? Werbung vom Autor des Spiels? Der Text mutet
mich mit dem englisch-deutsch-Kuddelmuddel ziemlich seltsam an. Es
au&szlig;er dem Autornamen auch der Link zum Hauptverzeichnis.

<DT><STRONG> Moonbases
</STRONG><DD> Hallo SAX! Du h&auml;lst nich viel von einem Link zum
Hauptverzeichnis?

<DT><STRONG> Oldies
</STRONG><DD> The Saint hat ein sehr sch&ouml;nes Layout hingelegt.
Der text liest sich auch wunderbar. Aber &quot;Sankt Markus&quot; du
scheinst den Test in Eile geschrieben zu haben, denn mir sind einige
Fehler aufgefallen: <UL>
<LI> sehr einfallsreiche Titelzeile: Titel
<LI> Text entspricht teilweise weder der alten noch der neuen
     Rechtschreibung
<LI> Die gelbe &Uuml;berchrift ist kaum lesbar
<LI> ein 100x CDROM ???, das schnellste ist ein 40x
</UL>

<DT><STRONG> CybervisionPPC
</STRONG><DD> Andreas, warum ben&ouml;tige ich als Mindestaustattung
die CGFX-Software, wenn sie zum Lieferumfang geh&ouml;rt? 

<DT><STRONG> Sinner
</STRONG><DD> An den Schreiber: Der Text ist doch gut, da k&ouml;nntest
du ruhig deinen Namen druntersetzen.

<DT><STRONG> Leserbrief von Nagash  - sponsort by Bl&uuml;mchen :-)
</STRONG><DD> Den Tip mit dem Hidden Track auf der &quot;13&quot; habe
ich sofort ausprobiert. Danke! Guter Tip!


<DT><STRONG> Leserbrief von Lars Philipsen
</STRONG><DD> Toller Hintergrund! Und danke f&uuml;r das Lob!

<DT><STRONG> Leserbrief von The Saint
</STRONG><DD> Das beste Layout dieser NoCover! Noch einen Tick besser
wird es unter AWeb (unter Voyager und IBrowse bringt es nichts), wenn
du bei Boing statt des PNG-Formats das GIF-Format w&auml;hlst (wie beim
Haken). Beim PNG-Format wird unter Aweb die Hintergrundfarbe n&auml;mlich
nicht durchsichtig.

<DT><STRONG> Bergische Kaffeetafel
</STRONG><DD> Nanu, was ist denn jetzt los? <BR>
Oh interessant! <BR>
Der Text kann doch nur von ... <BR>
Ja, er ist von Wolf Zimmer! <BR>
Das waren ungef&auml;hr die Gedanken, die ich beim ersten Lesen des Texts
hatte. Was soll ich zu dem Text noch schreiben? Es ist doch inzwischen
bekannt, dass Wolf sehr gut lesbare Artikel schreibt, die jede Menge
Infos enthalten. Mir gefallen sie gut, auch wenn sie nichts mit Computern
zu tun haben. <BR>
Was ganz anderes: Ist es eigentlich Zufall, dass der Bildhintergrund beider
Bilder so gut zum Hintergrundbild passt? <BR>
Ein kleiner Kritikpunkt: Was bringt dir Blockquote, au&szlig;er, dass es
unter AWeb durch die voreingestellte Kursivschrift schwerer lesbar wird.
Unter Voyager (was du ja benutzt) sowie unter IBrowse konnte ich keinen
Vorteil feststellen. <BR>
Auch das erste Mal, dass sich jemand die M&uuml;he gemacht hat und den
Inhalts-Link in ein anderes Licht gesetzt hat.

<DT><STRONG> Die NoCover l&auml;ft &uuml;ber
</STRONG><DD> Werner Kolb beschwert sich hier &uuml;ber zu viele Grafiken,
die dadurch zuviel Platz wegnehmen. <BR>
<UL>
<LH> Meine Meinung:
<LI> Hintergr&uuml;nde ja, aber man kann ja kleine Grafiken nehmen und
     den Hintergrund f&uuml;r mehrere Artikel nehmen
<LI> Als Format f&uuml;r Hintergrundgrafiken kann man JPEG nehmen und
     eine ziemlich starke Kompression einstellen. Der
     Qualit&auml;tsverlust f&auml;llt bei Hintergrundbildern gar nicht
     so sehr auf.
<LI> F&uuml;r andere Bilder: Nach M&ouml;glichkeit PNG in st&auml;rkster
     Kompression verwenden (es entstehen keine Qualit&auml;tsverluste).
     Alternativ kann auch JPEG verwendet werden (bitte aber nicht mit
     100%). GIF erzeugt im Vergleich zu PNG teilweise 3-5 mal so
     gro&szlig;e Dateien. Verzichtet also darauf.<BR>
     Ausnahme: Grafiken, deren Hintergrund auch unter AWeb transparent
     dargestellt werden soll.
<LI> Bei PNG sollte bei kleinen Grafiken auf schnelles Rohbild
verzichtet werden. Bei gro&szlig;en Grafiken kann man darauf eigentlich
auch verzichten.
</UL>

<DT><STRONG> Irrt&uuml;mer
</STRONG><DD> Lars Philipsen beschreibt hier die ber&uuml;hmtesten
Irrt&uuml;mer. Ich fand den Artikel sehr interessant. Er ist auch sehr
gut geschrieben: Kurze, pr&auml;gnante, klare Abschnitte. <BR>
Der Hintergrund ist auch gut gew&auml;hlt. Das Layout ist auch sehr
&uuml;bersichtlich und trotzdem nicht &uuml;berf&uuml;llt.

<DT><STRONG> Mentalwar
</STRONG><DD> Der Artikel geht mir eigentlich beim Lesen nur auf die
Nerven, sonst nichts. Er enth&auml;lt kaum Fakten sondern fast nur
gegenseitige Angriffe.

<DT><STRONG> WolfInfo
</STRONG><DD> Apropos Magische Quadrate: In der NoCover 54 hast du bei
D&uuml;rers Magischen Quadrat etwas &uuml;bersehen. Die vier kleinen
Quadrate in den Ecken ergeben auch 34. <BR>
Bei deinem R&aumltsel gibt es nur eine richtige L&ouml;sung und zwar: <BR>
<TABLE BORDER BORDER=2>
<TR><TH>1<TH>8<TH>13<TH>12</TR>
<TR><TH>16<TH>11<TH>2<TH>5</TR>
<TR><TH>3<TH>6<TH>15<TH>10</TR>
<TR><TH>14<TH>9<TH>4<TH>7</TR>
</TABLE>
Ich bin das ganze Informatiker-like angegangen und habe deine Angaben
in ein kleines ARexx-Programm &uuml;bersetzt. <BR>
Der Artikel WolfInfo ist, wie alle Artikel von Wolf hochinteressant und
sinnvoll bebildert.

<DT><STRONG> The Dark Zone
</STRONG><DD> Sehr gut Nagash, du machst J.R.R. Tolkien Konkurrenz!
Das Layout ist auch super und passend und vergesse bitte
Butterbl&uuml;mleinhizzar.

<DT><STRONG> Das Tier
</STRONG><DD> Huhuhu, schauriges Layout! Suuuper!
<P ALIGN=RIGHT>
<A HREF="mitglieder/steffens.html">
<IMG SRC=umo.gif WIDTH=84 HEIGHT=41 BORDER=0 ALT="UMO - Thomas Steffens"> </RIGHT>
</A> </P>
<P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>

