<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>PFS2</title>
</head>
<body background="tt_pfs2a.jpg" text=black link=blue alink=red bgcolor="#ffffcc">
<br>
<center><font color="#000080" size="7"><b>P F S 2</b></font><br>
<font color="#000080" size="4"><b>the best Filesystem of your Amiga</b></font></center>
<hr>
<i>Dies ist ein Auszug aus der Homepage von Schatztruhe: </i><br>
<p>
<img hspace=10 vspace=4 src="tt_pfs2b.jpg" alt="[ CDROM Cover ]" width=256 height=193 align=right>
<b>Verbesserungen gegen&uuml;ber Ami-FileSafe</b><br>
<ul>
<li>g&uuml;nstiger Preis f&uuml;r registrierte AFS Benutzer.
<li>68000, 68020, 68040 und 68060 Versionen.
<li>Eingebautes Interface f&uuml;r Optimiser, das es erm&ouml;glicht
  einen Datentr&auml;ger im normalen Betrieb zu optimieren. Bei Zugriff
  w&auml;hrend der Optimierung wartet der Optimiser bis die Operation
  abgeschlossen ist und arbeitet dann normal weiter. Die M&ouml;glichkeit der
  automatischen Benachrichtigung des Optimisers in solchen F&auml;llen
  macht die Optimierung vollst&auml;ndig transparent.
<li>neue verbesserte Testprozeduren machen PFS2 stabiler und zuverl&auml;ssiger
  als jemals zuvor.
<li>erweiterte Dokumentation inklusive Entwickler Informationen (Strukturen und Packets).
<li>neue Versionen aller Hilfsprogramme (viele Fehler wurden korrigiert), pfsls, diskvalid usw.
<li>Kundendienst mit Disk Reparatur Service.
<li>Ami-FileSafe kompatibel.
<li>die neuartige Problem Fr&uuml;herkennung beseitigt Fehler bereits vor einem
  kritischen Stadium, dies garantiert optimalen Schutz Ihrer Daten.
<li>erweiterte Disk Strukturen um Reparaturen zu erleichtern.
<li>Lieferung auf CD.
<li>Und als Bonus: Das preisgekr&ouml;nte Spiel Kang Fu, jetzt mit zus&auml;tzlichen Leveln!
</ul>

<b>Plus alle Vorteile, die Ami-FileSafe bereits hatte</b><br>
<ul>
<li>&uuml;berragende Performance. Bis zu 500% besser als FFS!
<li>Datentr&auml;ger sind immer validiert.
<li>Zuverl&auml;ssigkeit
<li>gleichzeitiger Zugriff durch mehrere Anwendungen ohne Performance Einbr&uuml;che.
<li>Einfaches Retten gel&ouml;schter Dateien durch das Delete Verzeichnis.
<li>automatisches Begrenzen langer Dateien (Logfiles usw.).
</ul>
<hr> <br>
<p>
<img hspace=10 vspace=4 src="tt_pfs2c.jpg" alt="[ CDROM R&uuml;ckseite ]" width=293 height=237 align=right>
PFS2 ist auf CD bei Schatztruhe f&uuml;r 99.- DM als Vollversion oder als Update
von AFS f&uuml;r 39,- DM zu erhalten.</p>
<p>
Schauen wir uns die CD einmal etwas genauer an. Es sind folgende Directories enthalten:
<blockquote><table border="0">
<tr><td>-</td><td> c </td><td> &#160; &#160; 0,02 MB </td></tr>
<tr><td>-</td><td> deutsch </td><td> &#160; &#160; 1,24 MB </td></tr>
<tr><td>-</td><td> englisch </td><td> &#160; &#160; 1,24 MB </td></tr>
<tr><td>-</td><td> franz&ouml;sisch </td><td> &#160; &#160; 1,24 MB </td></tr>
<tr><td>-</td><td> greed </td><td> &#160; 67,79 MB </td></tr>
<tr><td>-</td><td> patch </td><td> &#160; &#160; 0,02 MB </td></tr>
<tr><td>-</td><td> pfs2_images </td><td> &#160; &#160; 0,12 MB </td></tr>
<tr><td>-</td><td> tools </td><td> &#160; &#160; 0,10 MB </td></tr>
</table>
</blockquote><br>
Der gr&ouml;&szlig;te Teil dieser CD wird vom Spiel Kangfu (directory = greed) eingenommen
und FPS liegt dreimal vor, n&auml;mlich in den Sprachen deutsch, englisch und
franz&ouml;sisch.</p>
<p>
An dieser Stelle erwartet wohl niemand, dass ich mich &uuml;ber das Spiel auslasse.
Separat gekauft, kostet es nach meiner Information ca 25.- DM bei Coolbits in
K&ouml;ln.</p>
<p>
PFS2 (Professional File System 2) verbessert die Leistung des Systems und bietet
zudem eine h&ouml;here Zuverl&auml;ssigkeit als jedes andere Dateisystem. Weitere
Leistungsmerkmale wie Rollover Files und das Delete Verzeichnis vervollst&auml;ndigen
das Produkt. Nur PFS2 kann Harddisks bis 200 Gigabyte ansprechen. So die S&auml;tze
auf dem Coverumschlag der CD. Das schauen wir uns aber nun genauer an.</p>
<p>
Im Odner "Deutsch" ist nun das Programm enthalten und f&uuml;nf gut gestaltetete
Guides <br>
<ul>
<li> pfs2.guide (deutsch)
<li> pfs2tools.guide (deutsch)
<li> pfs2ls (englisch)
<li> pfs2packets (englisch)
<li> diskvalid (englisch)
</ul><br>
Als erstes ist zu lesen, dass die Texte nicht weiter ver&ouml;ffentlicht werden
d&uuml;rfen und dass keine weiteren &Uuml;bersetzungen angefertigt und ohne
ausdr&uuml;ckliche Genehmigung des Autors verbreitet werden d&uuml;rfen.
Trotzdem werde ich in meiner Besprechung auf Passagen und Bilder des Autors
zur&uuml;ckgreifen. Schlie&szlig;lich will er Geld verdienen und nicht ich.</p>
<p>
Die zweite, aber andersartig gelagerte Einschr&auml;nkung werde ich
w&ouml;rtlich wiedergeben:<blockquote> Die Software wird mit
Einzelcomputerlizenz bereitgestellt, das hei&szlig;t, f&uuml;r jeden Computer,
den die Software kontrollieren soll, ist ein gesondertes Exemplar zu erwerben.
Der Erwerber der Software ist daf&uuml;r verantwortlich, da&szlig; Kopien von
PFS2 Dritten nicht zug&auml;nglich gemacht werden, und da&szlig; von Dritten
keine Raubkopien hergestellt werden.</blockquote></p>
<p>
Als Begr&uuml;ndung f&uuml;r die Entstehungsgeschichte gibt Michiel Pelt (Autor)
an, dass das normale Dateisystem des Amiga (OFS) alles andere als schnell ist
und dass mit Workbench 2.0 das Fast File System (FFS) und Workbench 3.x
schlie&szlig;lich das Fast File System mit Verzeichnis-Pufferung (FFS-DC)
hinzukam, wobei durch letzteres das Durchsuchen von Verzeichnissen erheblich
beschleunigt wird, doch sind das Schreiben und Verzeichnisoperationen
(L&ouml;schen, Umbenennen usw.) sogar langsamer als je zuvor.</p>
<p>
Aus diesen Gr&uuml;nden begann Michiel Pelt im Sommer 1993 ein v&ouml;llig neues
Dateisystem f&uuml;r den Amiga zu entwickeln. Ende 1993 wurde das erste
Professional File System als Shareware auf dem Aminet ver&ouml;ffentlicht. Mit
Hilfe der bei dieser Version erworbenen Erfahrung wurde dann ein v&ouml;llig
neues Filesystem entwickelt und von Fourth Level Development im Jahre 1995
ver&ouml;ffentlicht. Sie nannten es Ami-FileSafe (AFS).</p>
<p>
Seit April 1998 (mit Ver&ouml;ffentlichung des neuen Professional File System 2
[PFS2]) liegt das Urheberrecht wieder bei dem Autor der Software, und seiner
eigenen Firma Great Effects Development.</p>
<p>
Vor der genaueren Betrachtung des Produktes noch ein paar Worte des Autors &uuml;ber
die Leistungsmerkmale:<br>

PFS2 bietet viele Vorteile gegen&uuml;ber dem Standard Filesystem FFS.
Die herausragendsten Eigenschaften sind:
<ul>
<li> Hohe Leistung <blockquote>
PFS2 wurde entwickelt und hoch optimiert um maximale Leistung f&uuml;r alle Disk
Operationen zur Verf&uuml;gung zu stellen. Die signifikantesten Verbesserungen
gegen&uuml;ber FFS werden beim Lesen und Schreiben von Dateien sowie beim
Durchsuchen von Verzeichnissen erzielt, je nach eingesetztem Laufwerk,
der Anzahl von Puffern und dem verwendeten Prozessor sind Steigerungen
von &uuml;ber 500% keine Seltenheit.</blockquote>
<li> Disks sind immer g&uuml;ltig <blockquote>
Ein PFS2 Laufwerk ist immer g&uuml;ltig (validiert), egal was auch geschieht.
Ein Programm st&uuml;rzt ab, der Strom f&auml;llt aus usw., PFS2 wird trotzdem
neu starten als sei nichts geschehen. </blockquote>
<li> Zuverl&auml;ssigkeit <blockquote>
PFS2 wurde sorgf&auml;ltig getestet und ist ein extrem zuverl&auml;ssiges und
stabiles Filesystem. Aber das war uns noch nicht genug: PFS2 hat einen
eingebauten Mechanismus um Probleme fr&uuml;hzeitig zu erkennen und zu
beheben. Wenn PFS2 ein Problem erkennt wird es alles tun um die Daten
zu retten. </blockquote>
<li> Paralleler Zugriff ohne Leistungsverlust <blockquote>
FFS bricht zusammen wenn mehrere Zugriffe auf einem Laufwerk stattfinden.
Mit PFS2 wird man keinerlei Leistungseinbr&uuml;che feststellen. </blockquote>
<li> Volle AmigaDos Kompatibilit&auml;t
<li> Einfaches Retten von Dateien <blockquote>
Versehentlich gel&ouml;schte oder &uuml;berschriebene Dateien k&ouml;nnen einfach aus dem
Delete Directory wiedergewonnen werden. </blockquote>
<li> Automatisches Begrenzen von Logfiles <blockquote>
PFS2 kann Logfiles oder andere lange Dateien automatisch begrenzen und
somit verhindern, da&szlig; sie unendlich wachsen. </blockquote>
</ul></p>
<p>
Und zu den Systemvoraussetzungen sagt der Autor:<blockquote>
PFS2 arbeitet auf jedem Amiga mit Kickstart 2.04 oder h&ouml;her. Es akzeptiert
DD/HD Disketten Laufwerke und RDB (Rigid Disk Block) Festplatten. Jedes
Ger&auml;t, das mit FFS problemlos funktioniert, wird dies auch mit PFS2 tun.
Der ben&ouml;tigte Speicher h&auml;ngt von der Anzahl der vewendeten Puffer ab,
in einer Minimal Konfiguration sind das weniger als 150K. Wenn mehr freier
Speicher f&uuml;r PFS2 zur Verf&uuml;gung gestellt wird erh&ouml;ht dies die
Leistung. Die Floppy Version ben&ouml;tigt ca. 60K pro Laufwerk.</p>
<p>
Schnellere Prozessoren und h&ouml;here Taktraten k&ouml;nnen die Leistung von
PFS2 betr&auml;chtlich erh&ouml;hen, speziell angepa&szlig;te Versionen f&uuml;r
praktisch alle 680x0 Prozessoren befinden sich im Lieferumfang. Versionen
f&uuml;r PowerPC Amigas sind f&uuml;r die Zukunft geplant. </blockquote></p>
<p>
Bevor PFS2 installiert wird muss man schon ausw&auml;hlen, welche Version und
Option ben&ouml;tigt wird.</p>
<p><ul>
<li> Multiuser Option <blockquote>
Nur falls das Multiuser Filesystem von Geert Uytterhoeven verwendet wird, ist
auch die Multiuser Version von PFS2 zu installieren. Diese Option macht PFS2 zu
einem vollwertigen muFS Ersatz. Es funktioniert jedoch nur, wenn das Multiuser
Paket (muFS) bereits installiert ist. Zu finden ist dieses auf dem Aminet.
</blockquote>
<li> Direct SCSI Option <blockquote>
Normalerweise benutzt PFS2 das Standard Devicedriver Interface um ein Laufwerk
anzusprechen. Falls der benutzte Treiber ein SCSI Device ist, besteht die
M&ouml;glichkeit, die normale Schnittstelle zu umgehen und Direct SCSI Befehle an das
Laufwerk zu senden. Genau das macht die Direct SCSI Version. Sie kann mit jedem
SCSI Device benutzt werden, der Vorteil liegt in der m&ouml;glichen Umgehung Device
spezifischer Probleme und Einschr&auml;nkungen.</p>
<p>
Die Benutzung von Direct SCSI erm&ouml;glicht die Nutzung von Speichermedien,
die gr&ouml;&szlig;er als 4GB sind, denn einige Device Treiber haben bereits Probleme
mit Laufwerken &uuml;ber 2GB.</blockquote></ul></p>
<p>
Trotzdem sollte beachtet werden, dass das Standard Interface jedes Device
Treibers sicher die beste und systemkonformste M&ouml;glichkeit ein Laufwerk
anzusprechen ist, da es die Fehler und Schw&auml;chen des jeweiligen Systems kennt.
Deshalb sollte die Direct SCSI Version nur benutzt werden wenn es unbedingt
n&ouml;tig ist.</p>
<p>
Im Lieferumfang befinden sich Versionen f&uuml;r praktisch alle verf&uuml;gbaren 680x0
Prozessoren. Normalerweise w&auml;hlt man die Version, die f&uuml;r das eigene System
vorliegt. Bei Wechselmedien und im RDB sollte aber die Version installiert
werden, die auf allen Systemen, auf denen der Datentr&auml;ger verwendet werden soll,
lauff&auml;hig ist.</p>
<p>
Zur Installation von PFS2 ist einfach das 'Install' Icon doppelzuklicken und
den Instruktionen zu folgen. Aber bitte step by step und nur nicht nerv&ouml;s werden
und die Installation beschleunigen zu wollen. Dabei ist aber zu wissen, Installation
ist gleichbedeutend mit Formatierung. Die vorhandenen Daten sind weg. Also unbedingt
vorher ein Update machen.</p>
Die Installation ist einfach und sehr genau beschrieben und fast jeder Schritt
ist zus&auml;tzlich anhand eines Bildes erkl&auml;rt. Dies ist eine Auswahl von vier
Beispielen von 10 Bildern, wobei Nr. 3 durch direktes Anklicken nochmals in
Originalgr&ouml;&szlig;e zu sehen ist.</p>
<p><center>
<table border="0">
<tr><td>
<img src="tt_pfs2dk.jpg" width=256 height=153 border=3 hspace=10 vspace=0></td><td>
<img src="tt_pfs2ek.jpg" width=256 height=153 border=3 hspace=10 vspace=0></td>
</tr></table>
<table border="0">
<tr><td>
<a href="tt_pfs2f.jpg" target="_top">
<img src="tt_pfs2fk.jpg" width=256 height=153 border=3 hspace=10 vspace=0></a></td><td>
<img src="tt_pfs2gk.jpg" width=256 height=153 border=3 hspace=10 vspace=0></td>
</tr></table>
</center></p>
<p>
Es gibt zwei grunds&auml;tzliche Arten der Installation:
<ul>
<li>Floppy PFS2 wird &uuml;ber Mountlisten eingebunden, wohingegen die Harddisk
Version normalerweise auf dem RDB installiert wird. Trotzdem kann letzteres
ebenfalls &uuml;ber Mountlisten erfolgen, was in einigen Sonderf&auml;llen Vorteile hat.
<li>Der RigidDiskBlock (RDB) ist ein Bereich der Festplatte, in dem Daten &uuml;ber
die auf der Festplatte vorhandenen Partitionen und auch das Filesystem selbst
gespeichert werden. Normalerweise belegt dieser die ersten zwei Tracks einer
jeden Festplatte. Durch diesen Mechanismus werden alle Partitionen einer Platte
automatisch gemountet wenn das System startet. Durch Installation von PFS2 auf
dem RDB ist es deshalb auch m&ouml;glich eine PFS2-Partition direkt zu starten. Die
RDB Routinen im Kickstart stellen dabei sicher, da&szlig; das richtige Filesystem
verwendet wird. Es ist m&ouml;glich jede beliebige Kombination von Filesystemen zu
verwenden, inklusive FFS und PFS2, man kann aber auch PFS2 auf Partitionen
verwenden und dadurch FFS komplett von der Festplatte verbannen.<br>
PFS2 kann nat&uuml;rlich mit jedem beliebigen RDB-Install-Programm installiert
werden, am einfachsten ist es aber &uuml;ber die HDToolbox.
</ul></p>
<p>
Das Mounten und Volume Management von PFS2 ist identisch mit FFS. Wenn PFS2 auf
einer Partition (Volume) installiert ist, wird es w&auml;hrend des Systemstarts
automatisch gemountet, durch das Dr&uuml;cken beider Maustasten w&auml;hrend des
Systemstarts kann dieses unterboten werden.</p>
<p>
Durch Mountlisten eingebundene Volumes werden erst sp&auml;ter w&auml;hrend des
Bootens der Workbench gemountet. Dazu m&uuml;ssen entsprechende Eintr&auml;ge im
DEVS:DosDrivers Verzeichnis enthalten sein. Um ein solches Volume nicht
einzubinden, muss der entsprechende Mounteintrag aus diesem Verzeichnis entfernt
oder verschoben werden, z.B. nach Storage/DosDrivers. Manuell k&ouml;nnen solche
Eintr&auml;ge durch einen Doppelklick auf ihr Icon jederzeit auch sp&auml;ter
noch gemountet werden.</p>
<p>
Falls es sich um ein Wechselmedium handelt, erkennt PFS2 automatisch wenn der
Datentr&auml;ger entfernt wird und das Volume Icon verschwindet von der
Workbench. Falls jedoch noch Dateien von diesem Medium benutzt werden, wird man
von PFS2 eventuell sp&auml;ter wieder auffordert, dieses Volume einzulegen. Wird
daraufhin ein falscher Datentr&auml;ger eingelegt wird PFS2 erneut das
ben&ouml;tigte Volume anfordern.</p>
<p>
Ein PFS2 Volume wird genauso formatiert wie ein FFS Volume. Sogar die 'Quick'
Option kann selbst dann benutzt werden, wenn das Volume vorher noch FFS
formatiert war. Allerdings hinterl&auml;&szlig;t ein Formatieren mit der 'Quick'
Option eine Menge Datenm&uuml;ll auf dem Medium, was im Normalfall kein Problem
darstellt. Sollte das Volume jedoch bei einem Datenverlust repariert werden
m&uuml;ssen, erschwert dies die Suche nach den gew&uuml;nschten Daten unter
Umst&auml;nden erheblich.</p>
<p>
Eingangs erw&auml;hnte ich, dass es auch ein Delete Directory vorhanden ist.
Dies ist ein Backup, welches die 31 letzten gel&ouml;schten, bzw. auch
ge&auml;nderten (&uuml;berschriebenen) Dateien speichert, sodass &uuml;ber
AmigaShell oder einem Programm (z.B. DOpus) wieder restauriert werden kann. Um
die genauene Auswirkungen zu sehen, nochmals etwas genauer.</p>
<p>
Das deldir ist ein verstecktes Verzeichnis und wird nicht im normalen
Verzeichnis einer Partition angezeigt. Man kann nur darauf zugreifen indem man
den kompletten Namen angibt welcher '.deldir' lautet. Es befindet stets im
Ursprungsverzeichnis einer Partition. Jede Datei, die gel&ouml;scht wird, wird
tats&auml;chlich zun&auml;chst nur in das Delete Directory verschoben. Das
gleiche gilt f&uuml;r &uuml;berschriebene Dateien. Wenn also beispielsweise die
startup-sequence versehentlich &uuml;berschrieben wird, findet man die
&auml;ltere Version im deldir wieder.</p>
<p>
Die Dateien im deldir haben spezielle Namen wie 'foo\@027'. Hierbei ist 'foo'
der eigentliche Dateiname und '027' die Slot Nummer, welche zwischen 000 und 030
betragen kann. Ben&ouml;tigt wird letztere, um Dateien gleichen Namens zu
unterscheiden. Wenn also 'foo' schon zweimal &uuml;berschrieben wurde, dann
findet man beide &auml;lteren Versionen mit verschiedenen Slot Nummern im deldir
wieder. Es kann nur aus dem deldir gelesen werden, ein Schreiben in dieses
Verzeichnis ist nicht m&ouml;glich. Deshalb sind auch alle Dateien darin Read
Only.</p>
<p>
Wer also eine Datei auf seinem Speichermedium l&ouml;schen will, um Platz zu
gewinnen, muss eine Kleinstdatei hinterher drei&szlig;igmal
l&ouml;schen/&auml;ndern, bis dieser Platz nicht mehr reserviert ist und
f&uuml;r eine neue &Uuml;berschreibung freigestellt wurde.</p>
<p>
Zu rettende Dateien k&ouml;nnen einfach aus dem deldir herauskopiert werden, als
Ziel wird jedoch empfohlen, einen anderen Datentr&auml;ger zu verwenden, um
andere gel&ouml;schte Dateien vor einer m&ouml;glichen endg&uuml;ltigen
Zerst&ouml;rung zu bewahren. Nach dem Kopieren m&uuml;ssen die Slotnummer durch
Umbenennen der Datei entfernt und die Schutzbits wieder in ihren
urspr&uuml;nglichen Zustand versetzt werden. Man sollte noch wissen, dass lange
Dateinamen im deldir auf 17 Zeichen gek&uuml;rzt wurden und dass Kommentare und
Schutzbits verloren gegangen sind.</p>
<p>
Als letzten Punkt erw&auml;hnte ich bei der Vorstellung den Rollover File.
Einige Programme protokollieren ihre Aktivit&auml;ten in sogenannten Logfiles.
Diese Dateien k&ouml;nnen unter Umst&auml;nden unendlich wachsen und m&uuml;ssen
von Zeit zu Zeit gel&ouml;scht oder umst&auml;ndlich von Hand gek&uuml;rzt
werden. PFS2 kann dieses automatisch erledigen, alles was zu tun ist, ist die
Datei in ein Rollover File zu verwandeln und eine Maximall&auml;nge (auch
Rollover Size) festzulegen. Ein solches Rollover File wird sich v&ouml;llig
normal verhalten bis die einmal festgelegte Maximalgr&ouml;&szlig;e erreicht
wird. Dann wird sie jedoch am Dateibeginn immer entsprechend gek&uuml;rzt,
sobald am Dateiende etwas hinzugrf&uuml;gt wird. Die neuesten Informationen
bleiben daher immer erhalten. Also haupts&auml;chlich etwas f&uuml;r
Programmierer.</p>
<p>
F&uuml;r eine Globalvorstellung von PFS2 sollten meine Ausf&uuml;hrungen
ausreichend sein. Wer aber mehr wissen will, sollte einen Blick auf die
entsprechende Webseite 'www.greed.nl' riskieren. Sie enth&auml;lt immer die
neusten Informationen &uuml;ber PFS2 und erlaubt registrierten Anwendern auch
Fragen zu stellen und Probleme mitzuteilen.</p>
<p>
Wer eine defekte Diskette hat, die in Verdacht steht durch PFS2 besch&auml;digt
worden zu sein, wird als besonderer Service angeboten, diese zwecks Rettung
einzusenden. Kostenlos! Porto&Verpackung sind aber zu &uuml;bernehmen. Der
Kundendienst hat folgende eMail Adresse 'support@greed.nl'.</p>

<p>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://home.chiemgau.com/amagerl/members/wolf/index.htm"> http://home.chiemgau.com/amagerl/members/wolf/index.htm </a>
</font>
<br>
<center>
<a href="NoCover.html"> <img border=0 src="l_hauptinhalt.jpg" width=495 height=75></a>
</center></table></center>
</body>
</html>
