<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Studio V2.2</title>
</head>

<body background="tt_studio1.jpg" TEXT=black link=blue alink=red bgcolor="#FFFFCC">
<br>
<center><font color="#000080" size="7"><b>Studio Professional v2.20</b></font></center>
<hr>
<i>Dies ist ein Auszug aus der Homepage von Schatztruhe: </i><br>
<p>
Mit Studio v2 erhalten Sie bislang unerreichte Ausdrucke von Ihrem
Drucker. Studio enth&auml;lt nicht nur besonders leistungsstarke
Workbench-Druckertreiber f&uuml;r Ihre normale Anwendung; zus&auml;tzlich
enthalten ist ein Programm zur Ausgabe von Grafiken in 8-Bit bzw.
24-Bit-Qualit&auml;t. Dank direkter Unterst&uuml;tzung der meisten
Druckerhersteller enth&auml;lt Studio immer Treiber f&uuml;r die neusten Drucker.</p>
<p>
Mit Studio v2 wird erstmalig auf dem Amiga ein professionelles
Farbmanagement-System eingef&uuml;hrt, welches Sie bef&auml;higt, Bilder
farbgetreu auszudrucken. Die Entwicklung dieses Farbsystems ben&ouml;tigte
mehrere Mannjahre. Ihr Monitor oder jedes andere Ausgabeger&auml;t l&auml;&szlig;t sich
einfach darauf justieren.</p>
<p>
Das enthaltene Druckprogramm erlaubt das Drucken von beliebig gro&szlig;en
Bildern ohne viel Speicher. Fast alle g&auml;ngigen Bildformate werden
unterst&uuml;tzt: IFF ILBM, JPEG, TIFF, PNG, GIF, Workbench Datatypes (ab OS 3.0)
und viele andere.</p>
<p>
W&auml;hlen Sie zwischen 54 der besten Rastermethoden beim Ausdruck. Eine
automatische Kontrastregelung, Sch&auml;rfenkontrolle und eine m&ouml;gliche
Spiegelung sind nur einige der zur Verf&uuml;gung stehenden
Bearbeitungsfunktionen.</p>
<p>
<b>Eigenschaften:</b>
<ul>
<li>Hochwertige Druckertreiber f&uuml;r alle DeskJets, LaserJets, alle
    PCL-kompatiblen mit bis zu 1200dpi, Epson Stylus/Photo und
    fast alle 24-Nadel und Tintenstrahl-Drucker.
<li>Volle Kontrolle und Ausnutzung des eigenen Druckers.
<li>Setup- und Kalibrationssoftware f&uuml;r die LaserJet, Canon,
    Epson und Panasonic Drucker.
<li>Ausgabe in 8-Bit bis 24-Bit-Qualit&auml;t. Intern arbeitet Studio mit bis
    zu 96-Bit.
<li>54 modernste Raster- bzw. Dither-Verfahren.
<li>Das erste professionelle Farbmanagement-System auf dem Amiga sorgt f&uuml;r
    bislang unbekannte Farbtreue im Ausdruck.
<li>Einfache Farbkalibrierung des Ausdrucks mittels Scanner oder manuell.
<li>Ausgabe von Grafiken der Formate IFF ILBM, TIFF, PNG, JPEG, Workbench
    Datatypes (ab OS 3.0) und viele andere mehr; der Ausdruck erfolgt von
    Disk mit geringem Speicherbedarf.
<li>Externe Ausgabemodule z.B. f&uuml;r Canon BJC, Epson, Deskjet, IFF ILBM und
    andere.
<li>Volle Multitasking- und ARexx-Unterst&uuml;tzung.
<li>Und vieles mehr...
</ul></p>
<p>
<b>Systemanforderungen:</b>
<ul>
<li>Amiga mit Workbench 2.04, 3.0, 3.1 oder h&ouml;her
<li>mindestens 1,5 MB RAM
<li>CDROM Laufwerk
</ul></p>
<i>Soweit der Auszug </i><hr><br>
<p>
<img hspace=10 vspace=4 src="tt_studio2.jpg" alt="[ CDROM Cover ]" align=right>
Studio Professional V2.2 (genau: Version 2.20 vom 15.06.1998) von Wolf Faust ist
bei Schatztruhe f&uuml;r 69.- DM zu erhalten. Ein fantastisches Preis- /
Leistungsverh&auml;ltnis. Update- und Cross-Updatepreise sind den Anzeigen zu
entnehmen.</p>
<p>
Schauen wir uns die CD einmal etwas genauer an. Es sind folgende Directories enthalten:
<blockquote><table border="0">
<tr><td>-</td><td> AmiCDFS2 </td><td> &#160; &#160; 0,3 MB </td></tr>
<tr><td>-</td><td> Freeware </td><td> &#160; &#160; 3,1 MB </td></tr>
<tr><td>-</td><td> PageStream_V3.x_Filter </td><td> &#160; &#160; 0,5 MB </td></tr>
<tr><td>-</td><td> Pictures </td><td> &#160; 184 MB </td></tr>
<tr><td>-</td><td> Studio </td><td> &#160; 335 MB </td></tr></table>
</blockquote><br>
Insgesamt sind dies 523 MB. Und nun etwas mehr im Detail:<br>
<p>
<i><b>AmiCDFS </b></i>(AmiCDROM) 2.40 (14.12.97) von Martin Berndt ist Shareware und die
Geb&uuml;hr betr&auml;gt 20,- DM. Die beiden beiliegenden Guides sind nur in
englisch. Aber es wird wohl niemanden mehr geben, dem ich dieses Produkt hier
und jetzt erkl&auml;ren m&uuml;sste.</p>
<p>
<i><b>Freeware </b></i><br>
Diese Schublade enth&auml;lt Software die evtl. von Interesse ist. Es handelt
sich hierbei um Druckersoftware, wie sie von verschiedenen Herstellern f&uuml;r
den Amiga vertrieben wird. Wolf Faust gibt keinerlei Garantie, Support o.&auml;.
f&uuml;r die Software in diesem Verzeichnis. Bei Problemen muss man sich an die
entsprechenden Adressen, die in der jeweiligen Softwaredokumentation
erw&auml;hnt werden, wenden.</p>
<p>
Einige der bei der Software enthaltenen Druckertreiber sind f&uuml;r spezielle
Druckermodelle geschrieben, und sind damit manchmal den mehr universell
geschriebenen Studio Treibern vorzuziehen. Dies gilt besonders f&uuml;r:</p>
<ul>
<li> Star SJ 144 Drucker. Der entsprechende Treiber von Star nutzt
     den kompletten Druckkopf des Druckers aus. Dies spart nicht nur
     Zeit, sondern auch Kosten f&uuml;r das Farbband.
<li> Verschiedene Workbench Treiber f&uuml;r 9 Nadeldrucker sind vorhanden.
     Studio selbst enth&auml;lt keine Treiber f&uuml;r &auml;ltere 9 Nadeldrucker.
<li> Canon CaPSL Emulation und alte Canon BJ 130 Druckertreiber.
</ul>
<p>
<i><b>PageStream_V3.x_Filter </b></i><br>
Wolf Faust schreibt dazu:
<blockquote>
Einf&uuml;hrung
<p>
Der 'Universal' erlaubt das Laden vieler zus&auml;tzlicher Grafikformate mit dem
PageStream V3.x DTP Programm. Weiter wird das Laden auch schon unterst&uuml;tzter
Formate teilweise erheblich beschleunigt. Alleine der Geschwindigkeitsgewinn bei
IFF ILBM 24 Bit d&uuml;rfte wohl im Durchschinitt bei ca. 200-300% liegen.
Interessiert?</p>
<p>
Der Universal Filter ist Teil der CanonStudio CDROM und ist ansonsten online f&uuml;r
alle CanonStudio V2.x und Studio V2.1x Benutzer kostenlos verf&uuml;gbar.</p>
<p>
Sollten Sie CanonStudio oder Studio nicht kennen: es handelt sich hierbei um
Software f&uuml;r Drucker auf dem Amiga. Die Software enth&auml;lt neben diverse
Druckertreiber und Anwendungen auch einen speziellen PageStream Druckertreiber,
der die Qualit&auml;t des 24 Bit Ausdrucks von PageStream erheblich erh&ouml;ht und
zus&auml;tzliche Funktionen bietet. Nicht umsonst wird diese Software von SoftLogik
f&uuml;r diverse Drucker trotz eigener Treiber f&uuml;r PageStream empfohlen. Z.B. liegt
die Druckqualit&auml;t auf Epson, Canon oder HP Druckern DEUTLICH &uuml;ber der denen der
PageStream Treiber.</p>
<p>
Voraussetzungen<br>
<ul>
<li> PageStream V3.1, V3.2, V3.3 oder neuer
<li> Sie m&uuml;ssen legaler Besitzer der CanonStudio oder Studio
     Software sein. Zur Benutzung des Universal Filters
     mu&szlig; aber CanonStudio oder Studio selbst nicht installiert sein.
</ul></p>
<p>
Funktionen des Filters <br>
Der Universal Filter erlaubt das Laden s&auml;mtlicher Grafikformate, wie sie auch
von CanonStudio bzw. Studio unterst&uuml;tzt werden. Dies bedeuted, da&szlig; neben vielen
neuen Formaten f&uuml;r PageStream auch einige schon von PageStream unterst&uuml;zte
Formate neu hinzukommen. Doch der Universal Filter ist hier meistens nicht nur
deutlich schneller als die original Filter (ca. 300% schneller bei IFF ILBM).
Oft kann der Universal Filter auch Exoten eines Formats laden. Z.B. kann
Universal fast alle Arten von TIFF Bilder laden, w&auml;hrend der PageStream TIFF
Filter nur sehr eingeschr&auml;nkt ist.</p>
</blockquote>
<p>
<i><b>Pictures </b></i><br>
Wolf Faust schreibt dazu:
<blockquote>
Lieber Benutzer,<br><br>

diese Schublade enth&auml;lt ein paar (Urlaubs)-Bilder zum Probedrucken (ich bin kein
Profi, bitte also keine zu hohen Qualit&auml;tsanspr&uuml;che stellen ;-). Die Bilder sind
von hoher Aufl&ouml;sung und demonstrieren, dass auch gro&szlig;e Bilder von dem Studio
Druckprogramm mit wenig Speicher gedruckt werden k&ouml;nnen. Bei den Bildern handelt
es sich um das IFF ILBM 24 Bit Format. Beachten Sie bitte, da&szlig; normal Programme
ca. 19 MByte an freien Speicher alleine zum Laden der Bilder brauchen.</p>
</blockquote>
<p>
<i><b>Studio </b></i><br><br>

Hier sind nun alle Programme und Programmteile enthalten, um das Programm installieren
zu k&ouml;nnen und zwar wahlweise in deutsch oder englisch. Sollten Probleme bei der
Installation auftreten, in der LIESMICH-Datei heisst es dazu:<br>
<blockquote>
Bei besonders ausgefallenen Systemzeichens&auml;tzen kann es zu St&ouml;rungen in dem
Commodore Installationsprogramm kommen. Wir haben versucht, das
Installationsprogramm m&ouml;glichst von Problemen fernzuhalten. Sollte dennoch bei
der Installation Text nicht sichtbar sein, schalten Sie bitte kurzzeitig Ihren
Systemzeichensatz auf den normalen Topaz 8 zur&uuml;ck. </p>
<p>
Weiter kann es zu Abst&uuml;rzen bei des Installationsprogramms durch fehlerhafte
Devices/Filesysteme kommen. Bitte entfernen Sie derartige Software von Ihrem
Rechner, da Sie mit h&ouml;chster Wahrscheinlichkeit nicht nur das Commodore
Installationsprogramm zum Absturz bringen k&ouml;nnen. Diese Warnung richtet sich
besonders an Benutzer des Macintosh Emulators Emplant. Zur Kontrolle k&ouml;nnen Sie
das Studio Programm installieren, nachdem Sie Ihren Rechner von einer orig.
Commodore Workbench Diskette gebootet haben.</p>
<p>
Sollte nach der Installation und Einstellung des MonitorGamma-Wertes das Studio
Druckprogramm zu dunkel drucken, pr&uuml;fen Sie bitte erneut den Gamma-Wert. Stellen
Sie ihn so lange niedriger ein, bis der Ausdruck die richtige Helligkeit hat.<br>

Ursache: Es ist zu beachten, da&szlig; der Gamma-Wert immer f&uuml;r den entsprechenden
Bildschirm und Bildschirmmodus(!!!!) zu ermitteln ist. Haben Sie also z.B. ein
Bild im HAM-Modus auf Ihrem Monitor erstellt, dann ist meistens der mit der
Gamma-Fenster in Studio ermittelte Wert zu hoch, da dieser in der Regel mit dem
h&ouml;her aufl&ouml;senden Workbench Bildschirmmodus ermittelt wurde.</p>
</blockquote>
<p>
Aber bevor wir installieren, schauen wir in alle Verzeichnisse und lesen die
entsprechenden dazugeh&ouml;rigen Texte. So sehen wir, dass neben fast f&uuml;r alle
g&auml;ngigen Druckermodellen auch Treibersoftware f&uuml;r die Programme PageStream 3.x
und ImageFX 2.x vorhanden ist. Dies sind Druckertreiber zum direkten Drucken
aus diesen Programmen heraus ohne durch das Amiga printer.device beschr&auml;nkt
zu werden. Angleichen an das jeweilige Farbmanagement und Drucken im
Hintergrund also kein Problem mehr.</p>
<p>
Eine Aufz&auml;hlung aller unterst&uuml;tzten Druckermodelle w&uuml;rde hier den Rahmen sprengen.
Sie k&ouml;nnen aber auf der Homepage der Fa. Schatztruhe nachgelesen werden. Auch
erscheinen laufend Updates im Internet. Im n&auml;chsten Update werden z.B. die
Software f&uuml;r die Epson/Canon 5000er und 7000er Reihe enthalten sein.</p>
<p>
Wenden wir uns nun dem Handbuch zu. Oha 330 MB von den 335 MB entfallen auf die
beiden Handb&uuml;cher, je zur H&auml;lfte auf das deutsche und das englische. Das r&uuml;hrt
daher, dass die Texte nicht als Texte (.txt, .asc, .html oder in &auml;hnlicher Form)
vorliegen, sondern als direkt druckbare Emulations- und als 1-bit ILBM-Dateien.
Und das in beiden Sprachen f&uuml;nfmal,
<br><blockqote>
- eine Canon_Emulation, <br>
- eine Deskjet_Emulation, <br>
- eine Epson_Esc-P2_Emulation, <br>
- eine Laserjet_Emulation und <br>
- ein Handbuch_Anzeigen.<br></blockqote>
Das Handbuch hat einen Umfang von 168 Seiten und das Ausdrucken auf meinem HP
550C dauerte im einseitigen Druck genau 2½ Stunden. Im letztgenannten
Handbuch_Anzeigen liegen die einzelnen Seiten zweimal vor. Einmal in den
Gr&ouml;&szlig;en 1950*3245 und 650*1081. N&auml;mlich einmal zum Ausdrucken
einer einzelnen Seite, und zum anderen zum Anschauen auf dem Bildschirm. Und wie
auch auf der CD gleich beschrieben, sollte man das Handbuch drucken, da es
nunmal wesentlich besser lesbar ist. Wer liest ein 168 Seiten Manual on Screen?
Das Anzeigeprogramm ist wirklich nur eine Notl&ouml;sung und dient zum
Nachschauen... weniger zum ersten lesen. Der Vorteil der jetzigen L&ouml;sung ist
vor allem die sehr gute Ausdrucksqualit&auml;t gegen&uuml;ber HTML/Guide.</p>
<p>
Zum Problem Handbuch schrieb mir Wolf Faust folgenden E-Mail:
<blockquote>
Ja, das Handbuch ist ein echtes Problem auf dem Amiga. Das Problem ist, dass
MultiView extrem buggy ist und auch nicht fuer V2.04 zur Verfuegung steht Ein
HTML Browser haette ich lizensieren koennen, aber da haetten mich dann auch
nicht wenige User gekillt, da Sie zuerst MUI haetten installieren muessen. Das
birgt dann auch wieder nicht wenige Fehlerquellen in sich...</p>
<p>
Wie also das grosse Handbuch auf die CD bringen? Es fehlt hier auf dem Amiga
wirklich wichtige Software, die eigentlich MultiView haette sein sollen, aber
die Fehler in MultiView sind nicht tolerierbar und man kann derzeit Mulitiview
nur fuer kleinere Handbuecher oder Nachschlagewerke benutzen. Drucken von
Dokumenten aus MultiView ist schon so gut wie unmoeglich...
</blockquote></p>
<p>
Das Handbuch ist sehr gut gegliedert und enth&auml;lt auch allgemeine Erkl&auml;rungen,
wie z.B. die Darstellung, was ein Druckertreiber ist und wie er arbeitet. Sehr
viele Beschreibungen sind mit Bildern und Tabellen untermauert. Als weiteres
Beispiel greifen wir einfach die Erl&auml;uterung der Mischalgorithmen heraus. Jeder
wei&szlig; was dies ist, aber spezifisch nachgefragt, kommt man doch in sehr starke
eingeschr&auml;nkte Formulierungsschwierigkeiten. Aber nach dem Studium dieses
Kapitels wei&szlig; man, dass man vorher verflixt wenig wusste. Aber nach 11 Seiten
und 18 dreigeteilten Bildern d&uuml;rfte es keine Schwierigkeit mehr geben, einen
Erkl&auml;rungsnotstand zu haben.</p>
<p>
Auch die Kapitel <i> Tips &amp; Tricks </i> und <i> Fehler &amp; Probleme </i>
sind sehr umfangreich. Dass s&auml;mtliche Softwareeinstellungsvariationen wirklich
effektiv und reichbebildert dargestellt sind, bedarf wohl keiner besonderen
Erw&auml;hnung mehr. Das ist bei diesem Programm selbstverst&auml;ndlich und auch gut
durchdacht.</p>
<p>
<img border="0" src="tt_studio4.jpg" width=261 height=259 hspace=10 vspace=4 align=right>
Auf eines m&ouml;chte ich aber doch noch etwas n&auml;her eingehen. Das ist das Studio
Farbmanagementsystem. Es ist entscheidend f&uuml;r die Ausdrucksqualit&auml;t, dass die
Bedeutung des Farbmanagementsystems auch verstanden wurde. Um es ganz kurz zu sagen:
Der Druck soll so ausschauen, wie das Bild auf dem Bildschirm leuchtet. Das
Bild rechts zeigt eine Gammafunktion des Monitors. Theoretisch sollte die Helligkeit
eines Bildes mit der Eingangsspannung linear steigen. In der Praxis sieht dies
aber etwas anders aus. So muss man einen dunklen Farbwert erst deutlich
aufhellen, bis dieser auch wirklich heller dargestellt wird. Aber allzu detailliert
m&ouml;chte ich hier nicht einsteigen, das Handbuch ben&ouml;tigt sieben Seiten zu
Erl&auml;uterung und da wurde noch nicht &uuml;ber die Einstellungen im Detail gesprochen.
Aber keine Angst, es ist alles einfach und sehr einleuchtend beschrieben.</p>
<p>
Wer also ganz faul ist und keinen gesteigerten Wert auf seine Druckergebnisse
legt, sollte den Gamma Regler auf 1,0 stellen, d.h. linear. In den meisten F&auml;llen
will man aber ein Bild so ausdrucken, wie es auf dem Monitor dargestellt ist.
Die Farben des Ausdrucks sollten dabei denen des Originals m&ouml;glichst nahe kommen.
Jeder Monitor ist aber verschieden und es ist daher letztlich dem Programm
unm&ouml;glich, ohne Angaben &uuml;ber den verwendeten Monitor einen ordentlichen Ausdruck
zu erreichen.</p>
<p>
<img border="0" src="tt_studio3.jpg" width=327 height=202 align=left>
Nach dem ersten Start von Studio sollte daher erst das Programm auf den
verwendeten Monitor kalibriert werden. Dies erfolgt &uuml;ber das <i>Monitor-
</i>Fenster Unterpunkt <i>Source/Monitor </i>. Das erscheinende Fenster ist in
einen linken und rechten Teil geteilt. Jetzt interessiert uns nur der rechte
Teil. Dieser Teil kalibriert Studio f&uuml;r den verwendeten Monitor. Die Regler
erlauben leichte Farbstiche oder die Helligkeit anzugeben. Sollte der Monitor
keinen Farbfehler haben, dann sind alle Farbregler auf 0 zu stellen und nur die
Helligkeit bzw. die Gamma-Funktion des Monitors einzustellen.</p>
<p>
Es ist auf den Schalter <i> Calibrate </i> zu klicken und es erscheint ein
Fenster mit einem grauen (gerasterten) Rechteck und innenliegend ein kleineres
wei&szlig;es Rechteck. Nun sind mit Hilfe des Schiebereglers die beiden Rechtecke so
einzustellen, dass deren beider Helligkeit als gleich empfunden wird. Hierbei
hilft es, die Augen soweit zu schlie&szlig;en, bis das Raster des gr&ouml;&szlig;eren Rechtecks
nur noch als Fl&auml;che gesehen wird. Nach Bet&auml;tigen von <i> Use </i> gelangt man
wieder zur&uuml;ck und oben steht der tats&auml;chliche Gammawert des Monitors im
Anzeigefeld. In der Regel ist dies ein Wert zwischen 1,4 bis 2,8.</p>
<p>
Aber aufgepasst, die Gammafunktion kann sich mit der Betriebsdauer etwas ver&auml;ndern.
Auch die Beleuchtungs- und W&auml;rmeverh&auml;ltnisse des Aufstellungraumes k&ouml;nnen Auswirkungen
haben und Ver&auml;nderungen herbeif&uuml;hren. Nachdem die Bilddaten des Monitors korrigiert
sind, werden im n&auml;chsten Schritt die Bilddaten f&uuml;r den Drucker korrigiert. Aber
so weit m&ouml;chte ich an dieser Stelle nicht ausholen. Ich will hiermit nur aufzeigen, dass
dieses Programm eine ganze Menge bietet und nicht nur ein einfacher Druckertreiber ist,
damit alles schneller und effizienter geht.</p>
<p>
&Uuml;ber das Ausdruckverhalten von Farbbildern in 24 Bit Qualit&auml;t oder in 8 Bit
Graustufen erz&auml;hle ich nichts. Das muss man einfach erlebt haben. Es ist &uuml;berhaupt
kein Problem (nachdem alles richtig eingestellt ist) Bilder von 20 MB Gr&ouml;&szlig;e zu
drucken. Es werden immer nur ein Spooler-Puffer voll Daten herangezogen und nicht
das ganze Bild. W&auml;hrend des Druckens kann man sich andersweitig besch&auml;ftigen. Aber
es ist Vorsicht dabei geboten. Geht lieber Kaffeetrinken oder liest nochmals einen
Artikel in einer Amigazeitschrift. Stellt Euch vor, Ihr seit mit dem Druck zu
80% fertig und verursacht durch eine Unachtsamkeit einen Guru. Die Fl&uuml;che kann ich
bis hierher h&ouml;ren.</p>
<p>
So nun habe ich keine Zeit mehr weiterzuschreiben, ich will mich nun am Posterdruck
versuchen.</p>

<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://home.chiemgau.com/amagerl/members/wolf/index.htm"> http://home.chiemgau.com/amagerl/members/wolf/index.htm </a>
</font> 
<br>
<center>
<a href="NoCover.html"> <img border=0 src="l_hauptinhalt.jpg" width=495 height=75></a>
</center></table></center>
</body>
</html>



