<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
7. Haage & Partner-News

Und hier wieder die neuesten Meldungen des Unternehmens:

»02 April 99: &Uuml;berarbeiteter Support-Bereich

Die jeweiligen Supportbereiche wurden aktualisiert und &uuml;berarbeitet. Zu
fast allen Bereichen gibt es jetzt auch eine spezielle FAQ-Seite mit
Antworten auf die h&auml;ufigsten Fragen.
http://www.haage-partner.com/support-d.htm


02 April 99: 350.000ster Zugriff auf die Homepage

Unsere Homepage erfreut sich immer gr&ouml;&szlig;erer Beliebtheit - derzeit greifen
t&auml;glich rund 850 Benutzer zu. Wir freuen uns daher auch &uuml;ber alle
Verbesserungsw&uuml;nsche: Umfrage 99
http://www.haage-partner.com/survey99-d.htm


09 April 99: Erste Ergebnisse der Umfrage 99

Wie man schon an dieser Seite sieht (keinen dunklen Hintergrund, keinen
blinkenden Text, keine "service"-Animation), haben wir schon erste
Konsequenzen aus den Vorschl&auml;gen gezogen. Wer noch nicht teilgenommen hat,
der sollte die Change nun nutzen: Umfrage 99 Danke!


12 April 99: Neuerungen auf der Homepage

Wie schon in der letzten News angek&uuml;ndigt, haben wir auch am Wochenende
wieder einige optische und inhaltliche &Auml;nderungen an unserer Homepage
vorgenommen. Die neuen Icons sind sicherlich jedem aufgefallen, ansonsten
haben wir fast alle FAQ-Bereiche &uuml;berarbeitet und auf eine Datenbank
umgestellt. An der Umfrage 99 haben sich jetzt schon &uuml;ber 400 Amiganer
beteiligt - vielen Dank daf&uuml;r...


Hint: If you are interested in AmigaOS 3.5 Beta-testing, then have a look
at www.amiga.de


12 April 99: Starbirds - Update

F&uuml;r BlizzardPPC-Systemen gibt es jetzt einen Update-Patch im Download-
Bereich.


19 April 99: ArtEffect 3 in 3 weiteren Sprachen

F&uuml;r ArtEffect 3.0 gibt es jetzt Lokalisierungen in Tschechisch, D&auml;nisch und
Franz&ouml;sisch. Die Dateien sind im ArtEffect FTP-Bereich.


19 April 99: Auswertung der Umfrage99

&Uuml;ber 650 Amiga Fans haben letztlich an der Umfrage teilgenommen, wof&uuml;r wir
uns sehr bedanken. Die Auswertung zeigt, da&szlig; man recht zufrieden mit dem
Inhalt und der Gestaltung ist. Viele Kommentare geben uns weitere
Anregungen f&uuml;r Verbesserungen. Eine ganze Reihe von &Auml;nderungen wurden
daraufhin schon in den vergangenen Tagen umgesetzt.


21 April 99: AUGS-Meeting in Zofingen

Am 17. und 18. April hatte das diesj&auml;hrige Amiga User Group Switzerland
Meeting in Zofingen stattgefunden. Haage&Partner pr&auml;sentierte dort eine
fr&uuml;he Vorversion von OS3.5.


22 April 99: WarpUP Release 4

Nach intensiver Arbeit und unz&auml;hligen Tests liegt nun die neues Version von
WarpUP vor. Der Text beschreibt die Neuerungen und die Tools. Im
Supportbereich geht es zum Download.


23 April 99: Tornado3D v2.0 SE

Die Spezialversion von Tornado3D bietet alles, was man f&uuml;r die Erzeugung
atemberaubender 3D-Grafiken und Animationen ben&ouml;tigt zum kleinen Preis und
mit Upgrade-Option. Inklusive PowerPC- und Virge3D-Support. Dieses
au&szlig;ergew&ouml;hnliche 3D-Paket gibt es jetzt f&uuml;r nur 199 DM.

Hier eine Liste der wichtigsten Features von Tornado3D 2.0 SE:

* Volumetrisches Licht
* PowerPC-Unterst&uuml;tzung &uuml;ber spezielle optimierte Module f&uuml;r 603e und 604e
* Real-time 3D-Preview in Farbe
* Interaktives Real-time Rendering
* Virge3D-Support
* Splines
* Automorphing
* Projektionslicht
* Schlagschatten, Clipmapped Schatten
* Selektives Raytracing f&uuml;r Reflektionen, Brechung und Schatten
* Kubische Reflektionen und Brechungen
* Additive und normale Transparenz
* Pose-Manager
* Lens Flares (Linseneffekt)
* Import von Postscript(tm)-Fonts
* Import von Lightwave-Objekten
* DXF-Import und Export
* Import von Imagine-Objekten und Gruppen
* Metameshing mit einstellbarere Kantenspannung
* Prozedural Texturen
* Mehrfache Shader (matt, tr&uuml;b, Plastik, Metall, Glas)
* Unbegrenzte Anzahl von Maps und Texturen je Oberfl&auml;che
* Ruhiger und bewegter 3D-Nebel
* Lineare, fr&uuml;he, sp&auml;te und benutzerdefinierte Nebelarten
* Punkt-, Spotstrahl-, ged&auml;mpfte und entfernte Lichtquellen
* Animierbare volumetrisches Hyper-Texturen
* Extrusion, Drehk&ouml;rper, Replication und Arraying
* Spline-Modellierung
* Nurbs-Polygoniaation
* Interactive Animations-Einstellung
* Interactives Bewegen, Skalieren, Rotieren, Verbiegen, Drehen, Scheren,
  Einebenen, ...
* Inverse Kinematik
* Interpoliertes Schattenerzeugung
* Weiche Schatten
* Hochwerte Schatten mit Clipping f&uuml;r Rotoscoping
* Unterteilen, Fraktalisieren, Triangulieren, Normalisieren, Verfeinern
* Grafikkartenunterst&uuml;tzung
* Datatype V43-Support
* Interne Lade- und Speichermodule f&uuml;r IFF, TGA, JPEG und RAW
* ...und vieles mehr


29 April 99: wARPgATe

Die sehr aktuelle wARPgATe Homepage hat jetzt eine eigene
Domain www.w-9.de. Der WarpUP/Warp3D-Bereich ist auch direkt erreichbar.


29 April 99: "Best Features"-Auszeichnung

Eine Aktion der Trogladite Software hat uns mit dem "Best
Features"-Preis f&uuml;r unsere Homepage ausgezeichnet. Wir
danken Neil Bullock von Trogsoft und den Teilnehmern f&uuml;r
diese Auszeichnung :)


30 April 99: Unsere neue Werbung

Um unsere Begeisterung f&uuml;r den Amiga auch einmal zu
zeigen, haben wir eine neue Anzeige entwerfen lassen, die
wir niemanden vorenthalten wollen :) Wie freuen uns &uuml;ber 
Kommentare.«

(Quelle: Haage & Partner)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
