<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
9. Betriebssystem-Bundle verf&uuml;gbar
                                           
»Das gro&szlig;e OS Bundle ist verf&uuml;gbar!
Empfohlener Verkaufspreis DM 59,00«

»Produktinformation

OS Bundle

Drei alternative Betriebssysteme f&uuml;r Ihren Amiga zu einem Preis:

1. Das inoffizielle RedHat Linux5.1
-----------------------------------
Ab sofort pr&auml;sentieren wir Ihnen eine superg&uuml;nstige LINUX-CD f&uuml;r Ihren 
Amiga.
Dabei handelt es sich um die "unofficial RedHat 5.1 version" portiert von 
Jes Sorensen.

Nutzen auch Sie jetzt die Gelegenheit, in das Profi-Betriebssystem Linux
hineinzuschnuppern. Selbstverst&auml;ndlich bieten wir Ihnen auch zu diesem
Produkt telefonischen Support. Ein st&auml;ndig aktualisierte &Uuml;bersicht der
unterst&uuml;tzen Amiga-Hardware finden Sie auf unserer Homepage.

Zur Nutzung dieser CD sind Englischkenntnisse erforderlich!


2. NetBSD (gateway! Vol.3)
--------------------------
Mit Erscheinen von NetBSD in der Version 1.3.2 wurde ein Meilenstein in der
Geschichte der freien UNIX-&auml;hnlichen Betriebssysteme gesetzt.

Die vorliegende Version Gateway! Volume 3 enth&auml;lt NetBSD 1.3.2 in vollem
Umfang:

   o Installationsdateien f&uuml;r alle 16 unterst&uuml;tzten Plattformen
   o X-Window
   o alle Sourcen in gepackter Form
   o Bin&auml;rdistributionen f&uuml;r m68k

Als kleines Extra k&ouml;nnen Sie von dieser CD direkt booten und installieren

Diese CD ist ein Mu&szlig; f&uuml;r jeden UNIX-Kenner und f&uuml;r jeden, der mehr als nur
eine Plattform sein eigen nennt, richtet sich aber auch an den weniger
fortgeschrittenen Nutzer.

Mehr zur CD auch im Internet unter: http://core.de/


3. p.OS (Prerelease)
--------------------
Hiermit erh&auml;lt nun jeder interessierte Anwender mit Sinn f&uuml;r Innovation die
M&ouml;glichkeit zum Einblick in die Philosophie von p.OS - dem Operating System
f&uuml;r unterschiedlichste Plattformen - nat&uuml;rlich vorab f&uuml;r den AMIGA !

Die PreRelease (Vorabversion) ist ein nahezu vollst&auml;ndiges Betriebssystem, 
zu einem stark reduzierten Preis! 

Ein Auszug der Leistungsmerkmale dieser PreRelease (CD-ROM-Version):

   o Vollst&auml;ndige p.OS Workbench
   o Leistungsf&auml;hige p.OS Shell
   o EasyToUse "p.OS-Filer"
   o incl. pOS-DOS
   o incl. Demos

---------------------------------------------------------------------

Die Summe der Einzelpreise von ...
   o Das inoffizielle RedHat Linux5.1
   o NetBSD (Gateway! Vol.3)
   o p.OS (Prerelease)
                     ... betr&auml;gt DM 107,90.

ab sofort als OS Bundle lieferbar f&uuml;r nur DM 59,-«

(Quelle: Schatztruhe GmbH)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
