<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
AMIGA-aktuell-Forum
-------------------

In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt 
gef&uuml;hrten - Rubriken "Leserbriefe", "Kleinanzeigen", und "Problemecke" 
zusammengefasst. 

Wenn Ihr einen Beitrag habt, schreibt bitte an:

        Carsten Schr&ouml;der
        Helmoltstra&szlig;e 10
        37081 G&ouml;ttingen

E-Mail: aakt@gmx.de


1. Erfahrungsbericht &uuml;ber Eagle Computer (von Stefan Schindler)

»Zum Thema EAGLE-Computer kann ich die negativen Erfahrungen nur 
best&auml;tigen.
Mein A4000-Towergeh&auml;use kam mit dreimonatiger Versp&auml;tung und erst nach 
mehrmaligen Anrufen, wobei sich die Entschuldigungen f&uuml;r die Versp&auml;tung
gegenseitig wiedersprachen. (Es kam auch vor, dass mir ein Mitarbeiter
erkl&auml;rte, mich nach einer Stunde zur&uuml;ckrufen zu wollen, sich dann aber gar
nicht mehr meldete.)

Das 250W-Netzteil zu dem Tower wurde mir am Telefon f&uuml;r 60.- DM 
versprochen, erschien aber statt dessen auf der Rechnung mit 60.- DM 
Aufpreis. Die hinteren Aussparungen waren falsch ausgeschnitten, so dass
ein Slotausgang gar nicht erreichbar war. Die Befestigungsschrauben f&uuml;r das 
Motherboard waren nicht vormontiert. Es fehlten einige wichtige Schrauben 
und die F&uuml;&szlig;e des Towers. Meine Cyberstorm MKII passte nicht (bzw. erst nach 
l&auml;ngerem S&auml;gen und Feilen), weil sie von einem Blechst&uuml;ck behindert wurde.  
Am Telefon erfuhr ich, dass Eagle das Problem bekannt war. Darauf haette 
EAGLE eigentlich VOR der Bestellung hinweisen m&uuml;ssen.
Der 3.5"-K&auml;fig passte nach Einbau der Prozessorkarte gar nicht mehr und 
wurde au&szlig;erdem von den viel zu kurzen Stromkabeln behindert. Das Netzteil 
war nicht mit dem An/Aus-Schalter verdrahtet und es gab auch keine 
Anleitung hierzu. Die Verdrahtung konnte also nur mit einem Messger&auml;t 
bewerkstelligt werden.

Als ich die Firma anrief und auf die o.g. Probleme ansprach, entgegnete man
mir mit dem Satz: "Und was sollen wir da jetzt tun?" Als ich erkl&auml;rte, dass
ich nicht sehe, dass EAGLE seine Vertragsverplichtungen eingehalten hatte,
versprach man mir als Entsch&auml;digung eine Amigamaus und diverse CDs im Paket
(mit den fehlenden Towerf&uuml;&szlig;en!) zu schicken. Auf dieses Paket warte ich bis
heute seit Februar..

Also, man kann es auch k&uuml;rzer Ausdr&uuml;cken: EAGLE pfuscht und wer bei EAGLE
bestellt, ist selbst schuld.

Stefan Schindler &lt;schindler@gmx.de&gt;«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
