<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Spiele-News aus aller Welt
-----------------------------

- Die Siedler 2 kommt doch nicht f&uuml;r den Amiga

Tja, so schlimm es auch klingt: Die Siedler f&uuml;r den Amiga scheint
geplatzt. Die Grund daf&uuml;r scheint Blue Byte zu sein, anscheinend
ist es 'zuviel Arbeit' die Grafiken und Sounds an Titan zu geben.
Titan Computer hat also jetzt die Engine fertig, und es fehlen nur
die Grafiken und Sounds. Das ist &auml;rgerlich. Kurz nach dem Bekanntwerden
dieser Fakten wurde eine Initiative gestartet, die Blue Byte
umstimmen soll. Man kann auf http://www.angusm.demon.co.uk/AGDB/Sett2.html
seine Stimme abgeben.

- Neue Version von WarpHexen

Steffen H&auml;user, Portierer des Spiels Hexen f&uuml;r WarpUp, hat
mitgeteilt, dass die neue Version auch endlich Sound unterst&uuml;tzt.
Au&szlig;erdem gab es wesentliche Bugfixes.
 
- Alive Mediasoft &ouml;ffnet eigene Website

Alive Mediasoft hat jetzt endlich eine eigene Webseite ge&ouml;ffnet.
Interessierte k&ouml;nnen auf http://www.innotts.co.uk/alive-mediasoft/
sich &uuml;ber die umfangreiche Produktpalette des Unternehmens
informieren.

- Evils Doom Special Edition fast fertig

Diesen Monat wurden neue Screenshots von der Special Edition
des Spiels Evils Doom ver&ouml;ffentlicht. Evils Doom SE ist ein
neuartiges RPG Spiel mit vielen Grafiken, FMV Sequenzen und
Charakteren. Au&szlig;erdem gibt es deutsche und englische Sprachausgabe.
Evils Doom SE ben&ouml;tigt mindestens einen Amiga mit 68030, AGA
oder Grafikkarte, 8MB Ram und 50MB HD Platz.

- Eat the Whistle PPC Patch ver&ouml;ffentlicht

Die Autoren des Spiels Eat the Whistle haben einen frei
verf&uuml;gbaren Patch bereitgestellt, der es erm&ouml;glicht, Eat
the Whistle mit Unterst&uuml;tzung eines PPC zu spielen. Es
gibt au&szlig;erdem bessere Grafiken, mehr und fl&uuml;ssigere
Animationen zu bestaunen. Der Patch l&auml;sst sich unter anderem
von der Hurricane Studios Webseite laden.

- Neue Screenshots von Gilbert Goodmate ver&ouml;ffentlicht

Neue, beeindruckende Screenshots von Gilbert Goodmate wurden
diesen Monat ver&ouml;ffentlicht. Laut Prelusion arbeitet ein
Grafiker des Teams auch f&uuml;r Disney, welches den hohen 
Grafikstandard des Spiels rechtfertigen w&uuml;rde.

Screenshot:
<IMG SRC="../extra/GilbertGoodmate1.jpg" ALT="Screenshot">
Screenshot:
<IMG SRC="../extra/GilbertGoodmate2.jpg" ALT="Screenshot">

- GoAD News

Das GoAD (Gathering of Amiga Developers) Team wurde im Februar
gegr&uuml;ndet und m&ouml;chte Amiga Entwicklern die M&ouml;glichkeit geben,
miteinander Erfahrungen, Ideen etc. auszutauschen und somit
den Standart der Amiga Software endlich wieder heraufsetzen.
Au&szlig;erdem arbeitet GoAD an einem Remake des C64 Klassikers
'Cauldron'. Das Remake soll, wenn es fertig ist, frei verf&uuml;gbar
gemacht werden, also Public Domain. Man braucht allerdings
noch talentierte PowerPC C/C++ Programmierer, die Lust haben,
an einem solchen Projekt mitzuarbeiten. Interessierte k&ouml;nnen
sich an Michael Flaherty &lt;michaelf@bakakaba.demon.co.uk&gt; wenden.
   
- Hired Guns Leveleditor ver&ouml;ffentlicht

F&uuml;r das bekannte Amiga Spiel Hired Guns, was 1993 von Psygnosis
ver&ouml;ffentlicht wurde, hat Steve Hammond nach harten Nachforschungen
einen Leveleditor auf seiner Homepage zur Verf&uuml;gung gestellt.
Der Leveleditor soll dem Spiel neues Leben einhauchen. Jeder k&ouml;nnte
nun seine eigene Levels erstellen. Der Editor stammt wahrscheinlich
von Psygnosis und wurde von den Programmierern der Firma damals
geschrieben. Steve Hammond schrieb &uuml;brigens die Story zu Hired
Guns. Der Editor kann von seiner Hired Guns Seite geladen werden:
http://www.tincan.demon.co.uk/Special1HGEd.htm.

- Moonbases ben&ouml;tigt neuen Publisher

Moonbases, das schon seit einigen Monaten im fertigen Zustand
auf die Ver&ouml;ffentlichung wartet, ben&ouml;tigt einen neuen Publisher.
Der alte Publisher hat kurzfristig beschlossen, den Amiga Markt
zu verlassen. Sollte sich kein Publisher finden, will Homegrown
Software Moonbases auf Shareware Ebene vertreiben. Interessierte
Publisher k&ouml;nnen sich an James Marshall &lt;homegrown@eclipse.co.uk&gt;
wenden.

- The Prophet ver&ouml;ffentlicht

Alive Mediasoft hat 'The Prophet', ein Spiel im Stil von Dungeon
Master ver&ouml;ffentlicht. Es soll &uuml;ber 200.000 verschiedene Orte
geben, z.B. in der Stadt, im Tempel, am Friedhof etc. Au&szlig;erdem
soll es keine feste Route geben, d.h., man kann hingehen, wohin
man will. 'The Prophet' ist auf Disk und CD-ROM verf&uuml;gbar und
kostet etwa 60 DM. 

- Arbeit an ACSYS wird fortgesetzt

&Uuml;berraschend sind diesen Monat neue Screenshots von dem f&uuml;r
totgeglaubten Turrican Clone ACSYS aufgetaucht. In der Endversion
soll es bis zu 7 Waffen geben, mit denen in 360&#176 geschossen
werden kann. Au&szlig;erdem soll es coole Sound FX, multidirektionelles
Parallax Scrolling sowie animierte Zwischensequenzen geben.
Momentan ben&ouml;tigt das Spiel 4MB Ram und ein 4x CD-ROM. Unique
sucht &uuml;brigens noch einen Musiker, der ihnen hilft. Interessierte
wenden sich an Christian Sobotta &lt;christian.sobotta@rz.tu-ilmenau.de&gt;.

Screenshot:
<IMG SRC="../extra/ACSYS1.jpg" ALT="Screenshot">
Screenshot:
<IMG SRC="../extra/ACSYS2.jpg" ALT="Screenshot">
Screenshot:
<IMG SRC="../extra/ACSYS3.jpg" ALT="Screenshot">

- Digital Images News

Nach langer Zeit wurde endlich die Webseite von Digital Images
aktualisiert. Und so gibt es einige Neuigkeiten zu vermelden: Space
Station 3000 ist sogut wie fertig und ein Demo sollte bald
ver&ouml;ffentlicht werden. Au&szlig;erdem wird auch mal die Genetic Species
3D Engine zum Zuge kommen, das w&uuml;rde eine tolle Abwechslung f&uuml;r
das Strategiespiel bedeuten. Die Arbeit an Wipe Out 2097
verl&auml;uft gut und Screenshots sollen in ca. 2 Wochen ver&ouml;ffentlicht
werden. Eine Demo soll danach auch bald folgen. Au&szlig;erdem
scheint Digital Images Zeewolf 3 zu planen. Man verhandelt gerade
mit den Originalprogrammierern Binary Asylum, was sehr gut
verlaufen soll. Auch steht Digital Images in Verhandlung mit
den Entwicklern einiger popul&auml;rer PC Spiele (Heretic 2, Quake 2
& F22: Air Dominance Fighters) zwecks Umsetzung auf den Amiga.
Und Digital Images arbeitet nat&uuml;rlich auch weiterhin an einigen
AmigaNG only Spielen, von denen auch bald Screenshots ver&ouml;ffentlicht
werden sollen.

- Seaside von APC&TCP

Seaside von APC&TCP ist ein Spiel im Stil von Theme Park, nur das
hier, wie der Name schon sagt, eine Art Ferienort am Strand gemanaget
werden muss. Die Spielfeatures h&ouml;ren sich bombastisch an: Es soll
&uuml;ber 100 verschiedene Landtypen geben, 1000 verschiedene Dekorationen
und 250 verschiedene Strandtypen. Au&szlig;erdem soll sich die Umgebung st&auml;ndig
&auml;ndern. Ein Releasedatum wurde noch nicht genannt.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
