<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Vorwort
-------

Willkommen zur neuen Ausgabe von AMIGA aktuell.

Auch im April hat AMIGA f&uuml;r Schlagzeilen gesorgt. Beispielsweise 
besch&auml;ftigt das Unternehmen nun einen Chief Technology Officer (CTO), der 
zuvor bei den bekanntesten Computerunternehmen der Welt in leitender 
Position t&auml;tig war. Zu nennen sind hier vor allem Apple, Borland, Silicon 
Graphics und Sun.

Im PowerPC-Hardware-Bereich gab es ebenfalls interessante Ank&uuml;ndigungen: 

* Nun wollen auch Titan Computer, der Turbokartenhersteller ACT sowie Haage  
  & Partner eine gemeinsame G3-Karte f&uuml;r den Amiga auf den Markt bringen. 

* Ebenfalls G3-Karten plant der Hardwarehersteller GVP-M

Negatives ist dagegen vom deutschen Zeitschriftenmarkt zu vermelden: Es 
gibt leider ein Amiga-Magazin weniger. Nachdem bereits im Vorfeld Ger&uuml;chte 
aufgekommen waren, dass die Amiga Fever vor ihrer Einstellung steht, wurde 
Ende April bekannt gegeben, dass die Zeitschrift mit sofortiger Wirkung in 
die amigaOS integriert wird.


Die Interna der heutigen Ausgabe:

* Ab sofort erscheint, in der Regel jeweils am letzten Tag des Monats, eine  
  'Express-HTML-Version' von AMIGA aktuell, die auf
  http://www-users.rwth-aachen.de/Marko.Koscak/aakt/index.html              
  abgerufen werden kann. Dies ist als Service f&uuml;r Abonnenten der HTML-       
  Ausgabe gedacht, die AMIGA aktuell sofort nach Fertigstellung lesen       
  m&ouml;chten.

* AMIGA aktuell ist jetzt auch per Fax erreichbar. Die Faxnummer lautet     
  089/66617-31176.

* Die Mailbox Big Planet, in der auch AMIGA aktuell abrufbar war, hat ihren  
  Betrieb aufgegeben.

* Aus gegebenem Anlass m&ouml;chte ich nun noch auf zwei Dinge aufmerksam        
  machen:

 - Briefe, die per "Schneckenpost" bei mir eingehen, k&ouml;nnen leider nur dann  
   beantwortet werden, wenn gen&uuml;gend R&uuml;ckporto beigelegt ist. Ich meine,    
   es ist allgemein nachvollziehbar, dass der Herausgeber eines kostenlosen  
   nicht-kommerziellen Magazins neben der Menge an Arbeitsstunden und       
   Internet-Kosten, die seine Mitarbeiter und er jeden Monat darin          
   investieren, nicht auch noch f&uuml;r Portokosten aufkommen kann. Ich hoffe   
   auf euer Verst&auml;ndnis.

 - Beitr&auml;ge, die per "Schneckenpost" auf Papier oder per Fax bei mir        
   eingehen, werden nur in Ausnahmef&auml;llen f&uuml;r eine Ver&ouml;ffentlichung         
   ber&uuml;cksichtigt. Ich meine, der Herausgeber eines elektronischen          
   Magazins darf erwarten k&ouml;nnen, dass auch die Beitr&auml;ge elektronisch, d.h.  
   per E-Mail oder auf Diskette, zugeschickt werden. Man kann es sicher     
   niemandem zumuten, l&auml;ngere Texte per Hand einzutippen. Ich hoffe auch    
   hier auf euer Verst&auml;ndnis.

Zu den regelm&auml;&szlig;igen Aufrufen:

* Wir suchen jemanden, der eine eigenst&auml;ndige AMIGA-aktuell-Rubrik f&uuml;hren   
  will, in der &uuml;ber Software-Updates informiert wird. Monat f&uuml;r Monat       
  erscheinen bekanntlich unz&auml;hlige FD- und kommerzielle AMIGA-Programme in  
  neuen Versionen. Ziel dieser neuen Rubrik ist es, die wichtigsten         
  Verbesserungen von neuen Software-Updates aufzulisten.
  Wer hat Interesse, sich darum zu k&uuml;mmern?
    
* Weiterhin gesucht werden Tester von frei kopierbarer Software. Jeder, der  
  sich f&uuml;r diese Aufgabe bereit erkl&auml;rt, wird in eine spezielle             
  Verteilerliste eingetragen und erh&auml;lt dann in unregelm&auml;&szlig;igen Abst&auml;nden    
  Test-Vorschl&auml;ge, ist aber zu nichts verpflichtet.
  Nat&uuml;rlich freuen wir uns aber genauso &uuml;ber Tests kommerzieller            
  Produkte und nicht &uuml;ber die Verteilerliste vorgeschlagener FD-Software.
  Schreibt an aakt@gmx.de .


Viel Spa&szlig; jetzt bei dieser Ausgabe,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
