<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Update: So senkt ihr eure Telekom-Rechnung!

Das Telefonieren wird von Monat zu Monat billiger. Wer die aktuelle 
Tariftabelle einmal mit der ersten in AMIGA aktuell 8/98 ver&ouml;ffentlichten 
vergleicht, wird feststellen, dass die Minutenpreise zu allen Zeiten, 
sowohl bei Gespr&auml;chen ins Festnetz als auch in die Mobilfunknetze deutlich, 
teilweise sogar drastisch, gesunken sind. Angesichts des knochenharten 
Konkurrenzkampfs, der momentan tobt, ist davon auszugehen, dass es in den 
n&auml;chsten Monaten zu weiteren Tarifsenkungen kommen wird.
Und l&auml;ngerfristig wohl nicht nur im Fernbereich: Eine Umfrage unter den 
lokalen Telefonfirmen Deutschlands ergab, dass eine deutliche Mehrheit von 
&uuml;ber 60 Prozent mit der Einf&uuml;hrung eines pauschalen Ortstarifs, verbunden 
mit der Abschaffung von Gespr&auml;chskosten, rechnet, 35 Prozent sogar 
innerhalb eines Jahres.

Eine Kurzmeldung:

* Praktisch mit dem Erscheinen der Aprilausgabe wurde bekannt, dass Arcor   
  seinen Konkurrenten o.tel.o &uuml;bernimmt. Zuvor ist Mobilcom als Favorit     
  gehandelt worden, aber bekanntlich kommt es oft anders als die meisten    
  denken...


Jetzt aber zur aktuellen Tarif&uuml;bersicht:

G&uuml;nstigster Call-by-Call-Anbieter (ohne Anmeldung, Mindestumsatz, etc.):

Wann:    |      Wohin:  Festnetz -&gt; Festnetz      Festnetz -&gt; Mobilfunknetz
===========================================================================
werktags 9-18 Uhr       TelDaFax (01030), 12 Pfg.     3U (01078), 41,9 Pfg.
sa/so/feiert. 9-18 Uhr  TelDaFax (01030), 9 Pfg.   Viatel (01079), 36 Pfg.²

t&auml;glich 18-19 Uhr       TelDaFax (01030), 9 Pfg.    Viatel (01079), 36 Pfg.
t&auml;glich 19-20 Uhr       Mobilcom (01019), 8 Pfg.¹   Viatel (01079), 36 Pfg.
t&auml;glich 20-21 Uhr       3U (01078), 5,9 Pfg.        Viatel (01079), 36 Pfg.
t&auml;glich 21-22 Uhr     Viag Interkom (01090), 5 Pfg. Viatel (01079), 36 Pfg.
t&auml;glich 22-7 Uhr        Mobilcom (01019), 4 Pfg.    Viatel (01079), 36 Pfg.
t&auml;glich 7-8 Uhr         3U (01078), 5,9 Pfg.        Viatel (01079), 36 Pfg.
t&auml;glich 8-9 Uhr         TelDaFax (01030), 9 Pfg.    Viatel (01079), 36 Pfg.

¹: Bei Verbindungen von bis zu etwa 7 Minuten Dauer kann TelDaFax (01030)   
   mit 9 Pfg. g&uuml;nstiger sein (s.u., Geb&uuml;hrenberechnung).
²: An Feiertagen, die nicht aufs Wochenende fallen, ist 3U (01078) mit 41,9  
   Pfg. g&uuml;nstiger (s.u., Geb&uuml;hrenberechnung).


Die Tabelle sollte im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige 
Anmerkungen:

* Angegeben ist jeweils der f&uuml;r 1 Verbindungsminute f&auml;llig werdende Betrag.

* 'Werktags' bedeutet montags bis freitags mit Ausnahme von Feiertagen.

* Bei Ortsgespr&auml;chen hat die Telekom in weiten Teilen Deutschlands noch ein  
  Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften      
  g&uuml;nstige City-Tarife an. In der Regel hei&szlig;t es also bei                  
  Ortsgespr&auml;chen: Weiterhin die Deutsche Telekom benutzen.
  Auf http://www.muc.de/~hm/telefon-tarife/tarifzonen.html k&ouml;nnt ihr        
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte  
  es mal passieren, dass ihr "f&auml;lschlicherweise" einen der alternativen     
  Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom    
  - und damit wom&ouml;glich billiger - zustande kommen k&ouml;nnte.

* Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,      
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass    
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im     
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen     
  l&auml;sst. Mein Favorit: http://www.teltarif.de/db/index.html


Die Anbieter verfahren bei der Geb&uuml;hrenberechnung teilweise 
unterschiedlich:

* TelDafax und 3U rechnen sekundengenau ab, d.h. ihr zahlt hier  
  wirklich nur f&uuml;r die Zeit, die die Verbindung andauert.

* Viatel berechnet bei Verbindungen bis 30 Sekunden Dauer die gesamten 30   
  Sekunden, danach wird exakt abgerechnet. ACHTUNG: An Feiertagen, die      
  nicht aufs Wochenende fallen, rechnet Viatel nach dem Werktags-Tarif ab.

* Mobilcom und Viag Interkom rechnen nach Minuten ab.


F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
