<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Workshops / Hintergrundberichte / Buchvorstellungen
---------------------------------------------------

1. Installation und Nutzung von RedHat-Linux (von Martin Steigerwald)

»Ich besch&auml;ftige mich seit einiger Zeit mit Linux auf dem Amiga und habe
auch schon mehrere Berichte dazu im Amiga-Magazin geschrieben. In einer
der letzten Ausgaben von Amiga-Aktuell kam dann die Nachfrage nach einem
Linux-Bericht und ich bot an, einen solchen zu schreiben. Nach Absprache
mit Carsten berichte ich nun erst einmal &uuml;ber RedHat Linux 5.1 f&uuml;r den
Amiga.

In Zukunft m&ouml;chte ich im Rahmen einer kleinen "Linux-Ecke" in der
Amiga-Aktuell weitere Berichte zum Thema Linux bringen. Das h&auml;ngt aber
auch von eurem Feedback ab, denn ich schreibe nicht gerne irgendwas, wenn
es doch keiner liest. Aber dazu mehr am Ende dieses Berichts.

&Uuml;ber RedHat Linux berichtete ich auch schon im Amiga-Magazin, aber
nat&uuml;rlich ist dies ein v&ouml;llig neu geschriebener Bericht nur f&uuml;r die
Amiga-Aktuell. ;-)


Was ist es?

RedHat Linux f&uuml;r Amiga ist eine inoffizielle Portierung von RedHat Linux
von Jes Sorensen. Inoffiziell bedeutet, da&szlig; RedHat f&uuml;r diese Distribution
keinen Support leistet. Auch Jes Sorensen steht f&uuml;r Support-Anfragen nicht
direkt zur Verf&uuml;gung. Daf&uuml;r jedoch gibt es ein sehr gutes
Installations-FAQ im HTML-Format - leider nur in englischer Sprache - und
eine RedHat m68k-Mailingliste, auf der man Fragen stellen kann. Im
Installations-FAQ ist dazu ein Bereich "References", der einen guten
&Uuml;berblick &uuml;ber Internet-Resourcen zum Thema Linux m68k bietet und auch die
Mailinglisten-Adresse angibt. Empfehlenswert ist auch die deutschsprachige
Newsgruppe de.comp.sys.amiga.unix zu lesen.

In meinem ersten Bericht m&ouml;chte ich erst mal meinen Eindruck von RedHat
Linux wiedergeben. Ich werde auch meine Installationserfahrungen
schildern. Allerdings ist dieser Bericht keine
Schritt-f&uuml;r-Schritt-Installationsanleitung. Wenn ihr sowas haben m&ouml;chtet,
meldet euch.


Woher bekomme ich es?

RedHat Linux bekommt man bei Schatztruhe (http://www.schatztruhe.de) f&uuml;r
39,- oder im OS-Bundle zusammen mit NetBSD und p.OS prerelease f&uuml;r 59,-.
Auch delix Computer GmbH bietet RedHat f&uuml;r Amiga (bzw. m68k) an. delix
Computer GmbH (http://www.delix.de) vertreibt die Rough Cuts
CD-ROM-Sammlung von RedHat. Diese enth&auml;lt die RedHat-Linux Distribution
f&uuml;r PowerPC - nein leider nicht so ohne weiteres auf Amiga mit
PowerPC-Karten lauff&auml;hig ;( - f&uuml;r MIPS, Sparc und schlie&szlig;lich auch f&uuml;r
m68k.

Ein gedrucktes Handbuch liefert weder Schatztruhe noch delix mit. Daf&uuml;r
ist jedoch die hervorragende Installations-FAQ auf der CD enthalten. Auf
der Schatztruhe-CD in einer etwas neueren Version als auf der Rough Cuts
CD-ROM, die ich hier liegen habe. Schatztruhe bietet dazu noch eine
Telefon-Hotline mit deutschsprachigem Installationssupport.

Wer m&ouml;chte kann sich RedHat Linux f&uuml;r Amiga auch &uuml;bers Internet &uuml;ber eine
der vielen RedHat-Mirror FTP-Sites besorgen:
http://www.redhat.com/mirrors.html.

Vor dem Kauf einer Linux-CD-ROM sollte man jedoch erstmal schauen, ob
Linux auf der eigenen Amiga-Konfiguration &uuml;berhaupt l&auml;uft. Der eigene
Amiga braucht auf jeden Fall eine MMU - eine Speicherverwaltungs-Einheit,
mindestens 8MB RAM und einen unterst&uuml;tzten IDE- oder SCSI-Controller sowie
ein unterst&uuml;tztes CD-ROM-Laufwerk. Wie man herausfinden kann, ob Linux auf
dem eigenen Komputer l&auml;uft beschreibe ich in einer der n&auml;chsten Folgen.


Die Installation

Ich installierte RedHat-Linux auf einem Amiga 4000 Desktop mit einer
CyberStorm MK II 040/40 mit CyberSCSI MK II Controller und 48MB Fast RAM
sowie zwei Festplatten mit zusammen 1,5GB Kapazit&auml;t sowie einer
CyberVision 64-Grafikkarte mit 2 MB Video-RAM. Eine Konfiguration, die
keine Probleme machen sollte. Alles Bestandteile, die schon relativ lange
von Linux m68k unterst&uuml;tzt werden.

Ich legte als die RedHat-Linux CD von Schatztruhe ein und dachte, ganz
einfach, mal kurz das FAQ gelesen und dann die Installationsroutine
gestartet. Ich las also das FAQ und erfuhr, wie sich die Installation
direkt von CD-ROM starten l&auml;&szlig;t. Leider gibts daf&uuml;r keine Piktogramme wie
bei Eagle-Linux m68k Amiga, also &ouml;ffnete ich eine Shell und gab die im FAQ
angegebene Kommandozeile an. Damit startete ich "amiboot", das dann den
Linux-Kernel von CD-ROM lud. Dabei richtet es f&uuml;r Linux eine RAM-Disk ein
und l&auml;dt ein einfaches komprimiertes, aber bootbares Linux-System in diese
RAM-Disk. Der Kernel bootet dann, entpackt das Linux-System in der
RAM-Disk und bootet es.

Die Installationsroutine startet und pr&auml;sentiert sich mit einem Men&uuml;, in
dem man ausw&auml;hlen kann, von welchem Installationsmedium man Linux
installieren m&ouml;chte. Ich w&auml;hlte CD-ROM und ab da funktionierte nichts
mehr. Eine Nachfrage ergab dann, da&szlig; die CD-ROM einen Fehler enth&auml;lt: Die
Installationsroutine aus der RAM-Disk m&ouml;chte Linux-Befehle direkt von der
CD-ROM ausf&uuml;hren. Diese haben allerdings haben aber die falschen
Protection-Bits gesetzt. Das "x"-Bit, das unter Linux markiert, ob eine
Datei ausf&uuml;hrbar ist, ist nicht gesetzt. So kann die Installationsroutine
die Linux-Befehle nicht ausf&uuml;hren.

Es gab also nur die M&ouml;glichkeit, eine gepatchte Installations-RAM-Disk
abzuwarten, die dieses Problem umgeht, alle Dateien der CD vorher auf eine
Amiga-Partition zu kopieren - wozu mir der Platz fehlte -, oder eine
andere CD zu verwenden, die diesen Fehler nicht hat. Gl&uuml;cklicherweise
bekam ich von Jes Sorensen umgehend eine Ausgabe der RedHat Rough
Cuts-CD-ROM-Sammlung zugeschickt.

Mit dieser klappte es dann. Allerdings wurde auch dann die CD-ROM nicht
immer beim ersten Versuch erkannt. Wenn man den entsprechenden Schritt in
der Installationsroutine nochmal vollzog, klappte es dann aber in der
Regel. Immerhin ein Fortschritt, fr&uuml;here Linux-Kernel haben mein Pioneer
24-fach Slot-In-CD-ROM-Laufwerk gar nicht erkannt.

Mittlerweile m&uuml;&szlig;te auch Schatztruhe einen Patch f&uuml;r die
Installations-RAM-Disk bzw. gleich eine fehlerbereinigte Version der
CD-ROM im Angebot haben. Leider bekam ich auf eine sp&auml;tere Anfrage
diesbez&uuml;glich keine Antwort, deshalb kann ich das nicht mit Sicherheit
sagen.

Nachdem die CD-ROM erkannt wird, kann man in Bereichen - es gibt welche
f&uuml;r gebr&auml;uchliche Internet-Clients wie Email, FTP etc., X11, X11-Spiele,
Drucker-Unterst&uuml;tzung, zus&auml;tzliche Dokumentation etc. - ausw&auml;hlen, welche
Softwarepakete man installieren will oder man installiert gleich alles.
Wer m&ouml;chte kann danach jedoch auch noch einzeln Pakete an oder abw&auml;hlen.

Ich w&auml;hlte eine Installation mit X11, allen wichtigen Standardprogrammen,
aber ohne die meisten Entwickler-Tools, um alles noch auf eine
260MB-Partition unterzubringen. Zus&auml;tzlich gab ich noch an, auf welcher
Partition das root-Dateisystem angelegt werden soll. Als Swap-Partition
gab ich keine an, da ich zur Zeit keine Partition daf&uuml;r frei habe.
&Uuml;blicherweise ist es jedoch besser, eine anzugeben - wie ich sp&auml;ter auch
erfuhr, als XView einen Screenshot wegen Speichermangel nicht mehr im
PNG-Format abspeichern wollte. ;-)

Nachdem das alles erledigt war, fing die Installationsroutine an, die
Softwarepakete zu installieren und ich staunte nicht schlecht. Die
Gemächlichkeit der Paketverwaltung von Debian Linux gew&ouml;hnt, haute es mich
doch ziemlich von den Socken zu sehen, mit welch berauschender
Geschwindigkeit hier die rpm-Pakete installiert wurden. In 16 Minuten war
alles fertig, waren &uuml;ber 200MB an Softwarepaketen installiert.

Hierzu vielleicht aber noch ein kleiner erkl&auml;render Exkurs zur
Paketverwaltung unter Linux: Viele Linux-Distributionen bieten eine
Paketverwaltung an. Das hei&szlig;t die zu installierende Software ist in
Archiven organisiert. Aber anders als lha- oder lzx-Archive auf dem Amiga
beeinhalten diese Archive auch noch Informationen &uuml;ber das Was und das Wie
der Installation. Das Paket enth&auml;lt Informationen dar&uuml;ber, welche andere
Pakete installiert werden m&uuml;ssen, damit die betreffende Software laufen
kann - sogenannte Paket-Abh&auml;ngigkeiten. Zudem enth&auml;lt es die Information,
welche Dateien wo installiert werden, evtl. ein Installationsskript usw.

Dieses System macht es einfach, bereits installierte Softwarepakete wieder
zu deinstallieren, da eine zentrale Datenbank jederzeit weiss, welche
Dateien zu welchem Softwarepaket geh&ouml;ren. Es gibt zwei verschiedene
Paket-Management-System bei Linux: Das Debian-Paketmanagement-System der
Debian-Distribution und das RedHat-Paketmanagement-System von Redhat.
Offenbar ist das RedHat-System deutlich schneller, wie die Installation
hier zeigt.

Danach fragte die Installationsroutine noch eine Angaben ab, wie Maus,
Netzwerk (LAN), Zeitzone, welche Systemdienste wie z.B. inetd automatisch
gestartet werden sollen, und welche Drucker unterst&uuml;tzt werden sollen.
Dann musste man ein Passwort f&uuml;r den Benutzer "root" festlegen. Daraufhin
war die Installation fertig, das System wurde neu gestartet.

Nach dem Booten kann man dann vom AmigaOS aus direkt den Linux-Kernel von
der gerade installierten Linux-root-Partition hochfahren. Das klappte hier
auch anstandslos, mit der entsprechenden Kernel-Option auch gleich auf
einem 1024x768x8 Screen auf meiner CyberVision - dazu auch in einer der
n&auml;chsten Folgen mehr. Root-Passwort eingegeben, und dann "startx" und
schon hatte ich eine grafische Oberfl&auml;che mit einem netten Startmen&uuml; und
einem Konfigurationstool.

Allerdings war die Tastaturbelegung noch eine englische. Das wurde in der
Installationsroutine leider nicht abgefragt. Aber ich fand schnell den
passenden Befehl, um die Tastaturbelegung einzustellen: "kbdconfig". Als
Tastatur "amiga-de" ausgew&auml;hlt und das wars. Man kann auch das Programm
"setup" starten. Von dort aus kann man andere Konfigurationsprogramme wie
z.B. Maus- und Tastatureinsteller aufrufen.

Screenshot:
<IMG SRC="../extra/Redhat1.png" ALT="Screenshot">

Leider steht diese Information nicht im FAQ. Das FAQ enth&auml;lt jedoch
Angaben zu einigen kleineren Dingen, die man noch manuell anpassen sollte,
weil die Installationsroutine da noch etwas &uuml;bersieht. So ist z.B. ein
Fehler in »etc/resolv.con« und »etc/fstab«, das - wie beim Amiga die Datei
DEVS:Mountlist oder die Dateien in DEVS:DOSDrivers - Angaben dazu enth&auml;lt,
welche Laufwerke gemountet werden sollen, enth&auml;lt leider auch nicht alle
Laufwerke, die man im Installationsskript konfigurierte. Nur das
Root-Laufwerk steht drinnen, alles andere mu&szlig; man per Editor von Hand
nachtragen.


Was bietet mir RedHat Linux m68k 5.1?

Was habe ich nun nach der Installation? Naja, im Prinzip hat man nun
erstmal ein voll lauff&auml;higes Linux-System mit allen wichtigen Programmen
;-). Mit der graphischen Konfigurationsoberfl&auml;che kann man die
Drucker-Unterst&uuml;tzung anpassen, die Zeit setzen, den Bootprozess, das
Modem und das Netzwerk konfigurieren. Die Installationsroutine selbst kann
nur die Konfiguration eines lokalen Netzwerks &uuml;bernehmen. Wer sich mit
Linux ins Internet einw&auml;hlen m&ouml;chte, kann im "Network Configurator" ein
neues "Interface" mit "PPP"-Protokoll definieren. Wenn der eigene Provider
dann die Authentifizierung mittels PAP/CHAP macht, sollte es keine
gr&ouml;&szlig;eren Probleme geben. Getestet habe ich das jedoch bislang noch nicht.

Screenshot:
<IMG SRC="../extra/Redhat2.png" ALT="Screenshot">

Das Konfigtool ist ganz praktisch, jedoch recht langsam, kein Wunder sind
es doch offenbar Python-Skripte die via gtk - dem GUI-Toolkit von GIMP
- zum Teil recht komplexe Oberfl&auml;chen aufbauen. Wer aber jetzt andere
Programme startet, merkt recht schnell, dass im auf einem 256 Farben
Bildschirm die Farben ausgehen. So startet einige Programme wie »gimp«
- ein tolles Bildbearbeitungsprogramm - dann sogar gar nicht mehr, weil sie
nicht gen&uuml;gend eigene Farben belegen k&ouml;nnen. Und wenn man sie von dem
sch&ouml;nen Startmen&uuml; aus aufruft, erh&auml;lt man nicht mal eine Fehlermeldung, da
die an eine Console geht, die man aber leider gerade nicht sieht.

Screenshot:
<IMG SRC="../extra/Redhat4.png" ALT="Screenshot">

Verantwortlich f&uuml;r den Farbenklau ist eben jenes Konfigurationstool, das
offenbar f&uuml;r seine Symbole, mit denen man die einzelnen
Konfigurationsprogramme aufrufen kann, einige Farben braucht. Es ist also
besser, es nach Abschlu&szlig; der Konfiguration einfach zu beenden.

Nun lassen sich fast alle Programme vom Startmen&uuml; aus starten. XEMacs,
GIMP, XView, GhostView alles funktioniert wie es sollte. Und viele
Programme laufen auch auf einem 68040er noch in annehmbarer
Geschwindigkeit. Hier seht ihr ein zwei Screenshots:

Im ersten sehr ihr XView in Aktion. Mit dem Programm erstellte ich die
Screenshots. Auf dem Screenshot k&ouml;nnt ihr in klein im Bildfenster von
XView Gimp sehen. Gimp ist ein tolles Bildbeartungsprogramm da&szlig; auf der
gtk-, der gimp toolkit-Oberfl&auml;che aufbaut. Leider habe ich den Screenshot
von Gimp nicht mehr in gro&szlig;. Ich hatte das Fenster von XView verkleinert
und XView hat dann dummerweise das Bild auch verkleinert gespeichert. Da
hat es mich ziemlich ausgetrickst ;-).

Screenshot:
<IMG SRC="../extra/Redhat3.png" ALT="Screenshot">

Im zweiten Bild seht ihr Emacs in Aktion. Und ihr seht auch den xfm, den
X11 File Manager, unten im Bild. Ist zwar nicht so sch&ouml;n wie die Workbench
oder gar Directory Opus, aber KDE ist ja nicht auf der CD und der
Gnome-Desktop auf der CD hat noch keinen Filemanager.

Screenshot:
<IMG SRC="../extra/Redhat5.png" ALT="Screenshot">

Leider funktionieren dann aber doch nicht alle Programme: glint - eine
graphische Oberfl&auml;che zum Pakete installieren und deinstallieren,
linuxconf - eine graphische Oberfl&auml;che zum Konfigurieren von Linux brechen
mit Fehlermeldungen ab. Auch ist das installierte Gnome-System
(http://www.gnome.org) relativ alt. Ich fand ausser der
Konfigurationsoberfl&auml;che kaum brauchbare Gnome-Programme. Die
Gnome-Oberfl&auml;che ist auf freien Sourcen basierende Equivalent zu KDE.
RedHat unterst&uuml;tzt Gnome seit einiger Zeit durch eigene Programmierer.
Leider ist hier der Stand auf Intel- und PowerPC-Systemen - leider nicht
PowerAmiga - weit aktueller als bei Linux m68k. Wie bei KDE gibt es
einfach keine aktuellen m68k-Binary-Archive f&uuml;r Gnome. Mit &auml;hnlichen
Problemen hat aber auch Debian m68k zu k&auml;mpfen. Wer mag, kann sich aber
mal die SRPM's zu Gnome runterladen und Gnome selber kompilieren. Aber ich
denke, da braucht es schon etwas Geduld. Ich hab das hier nicht getestet,
die Linux-Platte war schon zu voll.

RedHat Linux enth&auml;lt alles, was ein gutes Linux braucht - nur leider in
nicht mehr so aktuellen Versionen! Es sind auch die Source-Pakete (SRPM's)
mit auf der CD-ROM. Damit ist dann die CD auch schon voll. Hier h&auml;tte sich
vielleicht eine zweite CD-ROM noch gelohnt, um eine gr&ouml;&szlig;ere Auswahl an
Software zu bieten.


Fazit

RedHat Linux ist ein gut funktionierendes und leicht zu installierendes
Linux f&uuml;r den Amiga. Es sind alle wichtigen Programme enthalten, um sofort
loszulegen. Allerdings ist nicht mehr alles auf dem aktuellsten Stand und
auch die Auswahl an Softwarepaketen k&ouml;nnte noch etwas gr&ouml;&szlig;er sein - daf&uuml;r
jedoch erh&auml;lt man eine stabile Linux-Distribution ohne gro&szlig;e Probleme.

Sch&ouml;n w&auml;re eine RedHat-CD, bei der sich die Installationsroutine direkt
mit einem Doppelklick auf ein Icon starten lie&szlig;e, wie bei der Eagle Linux
Update CD.

Jes Sorensen hat in der Zwischenzeit schon RedHat 5.2 - auf den getesteten
CDs ist Version 5.1 - auf den Amiga portiert und eine &ouml;ffentliche
Betaversion verf&uuml;gbar gemacht. Diese gibts aber zun&auml;chst nur im Internet
auf:

ftp://SunSITE.auc.dk/pub/os/linux/680x0/redhat/beta/redhat-5.2

Ich bin gespannt auf die n&auml;chste RedHat Linux-CD von Jes Sorensen. Dann
wird auch die Schatztruhe-CD den Protection-Bit-Bug wohl nicht mehr haben.


Wie geht es weiter?

So, nun an alle, die bis hierher gelesen haben noch eine Frage. Wie
gesagt, m&ouml;chte ich gerne in der Amiga-Aktuell eine kleine Linux-Ecke
anbieten. Ich kann nicht garantieren, da&szlig; ich jeden Monat einen Artikel
schreiben kann - aber ich kann mir weitere Artikel &uuml;ber Amiga und Linux
vorstellen. Welche Themen interessieren euch denn so? Mir fallen da mal
folgende ein:

1. Schritt-f&uuml;r-Schritt-Installationsanleitung f&uuml;r RedHat oder Debian oder
Eagle. Zumindest f&uuml;r RedHat halte ich das aber nicht so f&uuml;r notwendig.

2. Installationshilfen. Wie partitioniere ich meine Festplatte in
HDToolBox? Welche Fallstricke habe ich bei einer Linux-Installation zu
beachten?

3. Eagle Linux Update CD inkl. KDE (&auml;lter als 1.0) und QtScape 5 beta

4. F&uuml;r RedHat: Mozilla und KDE 1.0

5. Das RedHat 5.2 Updatevom Internet saugen und installieren. Wenn mir das
nicht zu lange dauert ;-)

Ich wei&szlig; nicht, was euch interessiert. Also meldet euch mal. Ich freue
mich nat&uuml;rlich auch &uuml;ber Feedback &uuml;ber diesen Artikel. Es ist immer gut zu
wissen, ob das, was ich verzapfe auch gelesen wird - ich brauch das, was
ich schreibe ja nicht mehr lesen, das ist f&uuml;r euch! ;-)

Martin Steigerwald &lt;steigerw@stud.uni-frankfurt.de&gt;«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
