<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, halford, live, live insurrection">
<title>Halford: Live Insurrection</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Halford: Live Insurrection - Doppel CD</font></h1><BR> (63:03 &amp; 50:21 / Metal-Is)</center></P>

<p>&#220;ber den Sinn oder Unsinn dieses Live Album`s kann man sicherlich streiten, denn nach nur einer Soloalbum unter dem Banner Halford ein Live Album rauszubringen, riecht schon arg nach Geldmacherei. Na ja, immerhin wird dieses Doppealbum zum Preis einer Einzel CD vertickt was zusammen mit der Setlist 
durchaus wieder vers&#246;hnlich stimmt, denn die insgesamt 27 Tracks (plus Intro) lesen sich recht interessant: Vom Material des neuen Album`s (&quot;Resurrection&quot;, &quot;Made In Hell&quot;, &quot;Cyber World&quot;, &quot;The One You Love To Hate&quot;, &quot;Silent Screams&quot;) &#252;ber einige Fight Klamotten (&quot;Into The Pit&quot;, &quot;Nailed To The Gun&quot;) bis hin zu alten Priest Klassikern (&quot;Stained Class&quot;, &quot;Running Wild&quot;, &quot;Jawbreaker&quot;, &quot;Breaking The Law&quot; - um nur einige zu nenen) ist wirklich alles vorhanden. Dazu gibt es noch die beiden Japan Bonus Tracks &quot;Hell`s Last Survivor&quot; und &quot;Sad Wings&quot; sowie drei neue Songs, die teilweise noch aus dem Judas Priest Fundus stammten. Eigentlich m&#252;sste das Live Album ein Killer par excellence sein. Eigentlich, denn der Eindruck, da&#223; diese Live Platte im Studio kr&#228;ftig nachpoliert und nachtr&#228;glich aufgepeppt wurde, d&#252;rfte nicht von ungef&#228;hr kommen. So frage ich mich zum Bleistift, wo bittesch&#246;n die beiden Japan Bonus Tracks Live gespielt wurden und bei welchen Shows die Fans lauter waren als der Meister und seine Band - das d&#252;rfte eigentlich &#228;u&#223;erst selten vorgekommen sein und war bei seinem Auftritt in der Essener Grugahalle definitiv nicht der Fall. Zudem trifft Rob Halford nahezu perfekt jeden Ton, was eigentlich recht verwunderlich anmutet, konnte er doch bei l&#228;ngst nicht allen Shows restlos &#252;berzeugen. L&#228;sst man diesen Kritikpunkt mal aussen vor - teilweise f&#252;hlt man sich hier an das Judas Priest &quot;Live&quot; Album &quot;Unleashed In The East&quot; erinnert, das ebenfalls kr&#228;ftig im Studio nachbearbeitet wurde - bekommt man einen guten Querschnitt &#252;ber das bisherige Schaffen des &quot;Metal Gott&quot;. Vor allem die alten Priest Klassiker sind eine gute Idee gewesen, war ein Song wie &quot;Stained Class&quot; doch bisher auf keinem (offiziellen) Priest Album vertreten und hat vor allem auch heute nichts von seinem Charme verloren. Die drei neuen, qualitativ hochwertigen Tracks werten diese Scheibe nochmals nachhaltig auf und machen diese eigentlich unverzichtbar f&#252;r alle Judas Priest &amp; Halford Fans. W&#228;re da nicht der fade Beigschmack der &quot;Nachproduktion&quot; - wer aber damit leben kann, greift sich &quot;Live Insurrection&quot; ohne zu z&#246;gern ab, denn das es hier &quot;Value For Money&quot; gibt, steht ausser Frage...</P>

<p>Fazit: ---</P> 
<center>
<p><img src="kit.gif"></P>
<p><img src="cd4.jpg"></P>
<p><img src="kit.gif"></P>
</Center>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
