<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sekalaiset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<font size="2"><a name="top"></a></font>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Ajankohtaiset</a>&nbsp;&nbsp;&nbsp;</font><font size="2"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>AmigaOS 4 - askel kohti Amiga Inc.:n visiota</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Terho Henriksson &lt;<a href="mailto:terho.henriksson@kopteri.net">terho.henriksson@kopteri.net</a>&gt;</font></td>
				</tr>
			</table>
			<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Noin vuosi sitten Saku 2001 -tapahtumassa n&auml;htiin ensiv&auml;l&auml;yksi&auml; Amiga Inc.:n uudesta ohjelmistosta, Amiga DE:st&auml;. Amiga DE on sittemmin selkiytynyt Amiga Anywhereksi, ja AmigaOS-k&auml;ytt&ouml;j&auml;rjestelm&auml;n kehitys Hyperion Entertainmentin johdossa on edennyt kohti julkaisuhetke&auml;, yhdess&auml; Eyetechin suunnitteleman AmigaOne-emolevyn kanssa.<br>
								<br>
								AmigaOS 4 on sit&auml; mit&auml; Amiga-k&auml;ytt&auml;j&auml;t ovat odottaneet jo vuosikymmenen ajan. Moderni k&auml;ytt&ouml;j&auml;rjestelm&auml;, joka sis&auml;lt&auml;&auml; natiivin tuen tehokkaalle PowerPC-prosessorille ja my&ouml;s roppakaupalla parannuksia. AmigaOS4.0 sis&auml;lt&auml;&auml; mm. aivan uuden kernelin ja monia osia on mietitty ja ohjelmoitu uudelleen vastaamaan nykyk&auml;ytt&auml;j&auml;n vaatimuksia. AmigaOS 4 on nopeasti vilkaistuna PowerPC-versio Amigan k&auml;ytt&ouml;j&auml;rjestelm&auml;st&auml; Amiga Anywhere -teknologialla ryyditettyn&auml;. Se on kuitenkin paljon enemm&auml;n - nimitt&auml;in alusta niiden visioiden toteuttamiselle, joita Amiga Inc.:ll&auml; on kehitteill&auml; tuotteen tuleviin versioihin.<br>
								<br>
								T&auml;ss&auml; artikkelissa luodaan katsaus uusiin ominaisuuksiin, joita AmigaOS 4 tuo tullessaan. Uusia ominaisuuksia kommentoi Amigan tekninen johtaja Fleecy Moss ja my&ouml;s Hyperion Entertainmentin AmigaOS-ohjelmoija Hans-Joerg Frieden. Lis&auml;ksi luodaan lyhyt katsaus tulevaan, mihin AmigaOS:n kehitys suuntautuu t&auml;st&auml; eteenp&auml;in. </b></font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<font size="2"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica">AmigaOS 4 - merkitt&auml;vimm&auml;t parannukset</font></b></font></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Prosessoritekniikan kehittyess&auml; Motorolan 68k-sarja on v&auml;istynyt uuden teholuokan PowerPC-prosessorien tielt&auml;. Amigassa on n&auml;hty useita erilaisia kiihdytinkorttiin pohjautuvia PowerPC-ratkaisuja, mutta nyky-Amigoiden vanhentunut arkkitehtuuri on vaatinut tehoja sy&ouml;v&auml;&auml; kikkailua, jotta on voitu py&ouml;ritt&auml;&auml; samanaikaisesti sek&auml; PowerPC- ett&auml; 68k-prosessoreille tarkoitettuja ohjelmia. Jotta kaikki teho saataisiin k&auml;ytt&ouml;&ouml;n, uusi AmigaOS 4 toimii t&auml;ss&auml; vaiheessa ainoastaan PowerPC-pohjaisessa raudassa.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">AmigaOS on paineista huolimatta s&auml;ilytt&auml;nyt k&auml;ytt&ouml;j&auml;rjestelmien kehityskilvassa sille ominaisen kompaktin ja selke&auml;n rakenteen. Amiga Inc.:n Fleecy Mossin mukaan AmigaOS tulee edelleen erottumaan massasta nopeudellaan ja kyvyll&auml; suorittaa useita aikakriittisi&auml; teht&auml;vi&auml; moniajossa. Amiga Inc. on panostanut siihen, ett&auml; k&auml;ytt&ouml;j&auml;rjestelm&auml;n toimivat elementit, &quot;Amiga-filosofia&quot;, pyrit&auml;&auml;n s&auml;ilytt&auml;m&auml;&auml;n muuttumattomana. &quot;Uskomme lujasti siihen, ett&auml; jos jokin toimii, sit&auml; ei kannata muuttaa. Amigan suhteen se teht&auml;v&auml; on ollut helppo&quot;, sanoo Fleecy Moss.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td rowspan="2" valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/kuva_1.jpg" alt="" height="300" width="400" border="0"></font></div>
								</td>
								<td rowspan="2" valign="top" width="50%"></td>
							</tr>
							<tr>
								<td valign="top">
									<div align="left">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Lopullisessa AmigaOS 4 -versiossa GUI:n ulkon&auml;k&ouml; on k&auml;ytt&auml;j&auml;n t&auml;ysin muokattavissa. Kuvassa toiminnassa uusi Intuition-menu.</font></div>
								</td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Fleecy jatkaa:<br>
							<br>
							&quot;</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">T&auml;rkeimm&auml;t elementit AmigaOS 4.0:ssa ovat asiat joita ei voi n&auml;hd&auml; tai jotka voit kokea vain ep&auml;suorasti. Execin (AmigaOS:n moniajava kerneli) ohjelmoiminen uudelleen ExecSG:ksi (Second Generation) ja sen saaminen toimimaan sekoitettujen bin&auml;&auml;rien kanssa on suuri saavutus. Lis&auml;ksi ty&ouml;n alla on ammattilaistason 68k-emulaattori, jota ilman menett&auml;isimme paljon vanhoja ohjelmia.&quot;<br>
							<br>
							&quot;</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Monin paikoin on tarvittu uudelleen ohjelmoimista, kuten Intuitionin, RTG:n ja RTA:n saattaminen toimimaan t&auml;ydell&auml; teholla uuden prosessorityypin kanssa. Monet nykyisist&auml; AmigaOS-ratkaisuista on jouduttu toteuttamaan siten, ett&auml; ne toimivat erilaisien kolmansien osapuolien laitteistoratkaisujen kanssa. Nyt kun meill&auml; on AmigaOne ja yksi ainoa laitteistopohja, voimme p&auml;&auml;st&auml; t&auml;st&auml; ongelmasta eroon.&quot;<br>
							<br>
							&quot;</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ei voi kuitenkaan sanoa, etteik&ouml; AmigaOS:ss&auml; ole jotain uuttakin: virtuaalimuisti-j&auml;rjestelm&auml; uusille ohjelmille, integroitu 3D Ami3D:n ja Mesan (OpenGL-yhteensopiva) kautta. Integroitu ja kokonaan uudelleen ohjelmoitu TCP/IP-ratkaisu. Lis&auml;ksi paljon ty&ouml;t&auml; tehd&auml;&auml;n Workbenchin parantamiseksi ja kaunistamiseksi samalla kun mahdollistetaan tehokkaat r&auml;&auml;t&auml;l&ouml;intiominaisuudet. Ja tietysti paljon ty&ouml;t&auml; tehd&auml;&auml;n 'pinnan alla', n&auml;in tehd&auml;&auml;n tilaa uusille ominaisuuksille, jotka lis&auml;t&auml;&auml;n tulevissa k&auml;ytt&ouml;j&auml;rjestelm&auml;n versioissa.&quot;</font></td>
				</tr>
			</table>
			<font size="2"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<font size="2"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica">AmigaOS - ohjelmoijan ja k&auml;ytt&auml;j&auml;n n&auml;k&ouml;kulmasta</font></b></font></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Amiga Inc. ulkoisti AmigaOS 4:n ohjelmointity&ouml;n saksalais-belgialaiselle Hyperion Entertainmentille. Yritys tunnetaan Amiga-maailmassa mm. pelik&auml;&auml;nn&ouml;ksist&auml;&auml;n (Esim. Freespace, Heretic II ja Shogo). Hyperion on my&ouml;s vastannut 3D-teknologian kehitt&auml;misest&auml; Amiga Anywhere -pohjaisiin laitteisiin.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hans-Joerg Frieden:<br>
								<br>
								&quot;</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Workbench itsess&auml;&auml;n ei muutu AmigaOS 4:&auml;&auml;n merkitt&auml;v&auml;sti, paitsi ett&auml; tarjoamme Directory Opuksen k&auml;ytt&ouml;liittym&auml;n korvaajana. Intuition ja ReAction sen sijaan saavat huomattavan kasvojen kohotuksen. T&auml;ll&auml; hetkell&auml; tavoite on saada t&auml;ydellinen pinnoitteiden (skin) ja mukautettavuuden tuki Intuitionin ytimeen. Kuinka paljon t&auml;st&auml; tavoitteesta saadaan toteutettua AmigaOS 4:&auml;&auml;n on viel&auml; ep&auml;varmaa, mutta paljon ty&ouml;t&auml; on jo investoitu projektiin.&quot; </font>
							<table width="100%" border="0" cellspacing="2" cellpadding="0">
								<tr>
									<td colspan="3" valign="top">&nbsp;</td>
								</tr>
								<tr>
									<td rowspan="2" valign="top" width="50%"></td>
									<td valign="top">
										<div align="center">
											<img src="kuvat/kuva_2.gif" alt="" height="300" width="400" border="0"></div>
									</td>
									<td rowspan="2" valign="top" width="50%"></td>
								</tr>
								<tr>
									<td valign="top">
										<div align="left">
											<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">L&auml;hikuvassa Intuition-valikko. Valikot ovat saaneet Multiview-tyylisen toiminnallisuuden. Hiiren osoittimen kohdalle avautuvassa valikossa on mm. py&ouml;ristetyt reunat, pinnoitteet ja varjo.</font></div>
									</td>
								</tr>
								<tr>
									<td colspan="3" valign="top">&nbsp;</td>
								</tr>
							</table>
							&quot;<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kuvaruutukaappaukset eiv&auml;t ole vedoksia lopullisesta tuotteesta, vaan n&auml;ytt&auml;v&auml;t milt&auml; AmigaOS n&auml;ytt&auml;&auml; koneillamme t&auml;ll&auml; hetkell&auml; (no, minulla on k&auml;yt&ouml;ss&auml; erilaiset v&auml;rit, mutta siin&auml; se :-).&quot;<br>
								<br>
								&quot;</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Olemme lis&auml;nneet paljon uusia ominaisuuksia jotka tekev&auml;t ohjelmoinnista mukavampaa. Meill&auml; on jo uudet API:t ja t&auml;ysin uusi kerneli. Vanha koodi voidaan suorittaa joko emulaation l&auml;pi (mink&auml; nopeus jo vastaa 68060 prosessoria low-end BlizzardPPC:ll&auml;, ja on huomattavasti nopeampi kuin 68040) tai se voidaan uudelleen k&auml;&auml;nt&auml;&auml; AmigaOS 4:lle, joka vaatii ainoastaan minimaalisia muutoksia ohjelmakoodiin.&quot;</font></div>
					</td>
				</tr>
			</table>
			<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<font size="2"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica">Amiga Anywhere - Amiga miss&auml; vain</font></b></font></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Amiga Anywhere on alusta, joka mahdollistaa saman ohjelmakoodin ajamisen eri k&auml;ytt&ouml;j&auml;rjestelmiss&auml; ja prosessoreissa. Alustalle kehitet&auml;&auml;n jatkuvasti uusia sovelluksia ja pelej&auml;. Amiga Anywheren ensimm&auml;inen pelipaketti on julkaistu ainakin PocketPC-PDA-laitteille. Teknologia tulee my&ouml;s liitettyn&auml; AmigaOS 4.0:aan. Tuoko Amiga Anywhere sitten jotakin uutta k&auml;ytt&ouml;kokemukseen jatkossa?<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Fleecy Moss:<br>
								<br>
								&quot;</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Amiga Anywhere toimii AmigaOS 4.0:n p&auml;&auml;ll&auml; aivan kuten Linuxissa ja Windowsissa, tarjoten siten oman k&auml;ytt&ouml;ymp&auml;rist&ouml;n. Tulevissa versioissa teknologia integroidaan kasvavassa m&auml;&auml;rin k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml;n, joten k&auml;ytt&auml;j&auml; voi lopulta k&auml;ynnist&auml;&auml; ohjelman tai palvelun tiet&auml;m&auml;tt&auml; onko kyseess&auml; AmigaOS- vai Amiga Anywhere -ohjelma. Molemmat k&auml;ytt&ouml;ymp&auml;rist&ouml;t ovat saumattomassa yhteydess&auml; toisiinsa.&quot;<br>
								<br>
								&quot;</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Amiga Anywhere antaa AmigaOS:iin v&auml;litt&ouml;m&auml;sti yksil&ouml;llisen Java-ratkaisun. Se tarkoittaa sit&auml;, ett&auml; suurin huolenaiheemme, nimitt&auml;in uuden materiaalin saaminen AmigaOS 4.0:lle, on ratkaistu. AmigaOS 4 -k&auml;ytt&auml;j&auml;ll&auml; on mahdollisuus k&auml;ytt&auml;&auml; Java-sis&auml;lt&ouml;&auml;, mutta my&ouml;s jatkuvasti lis&auml;&auml;ntyv&auml;&auml; Amiga Anywhere -sis&auml;lt&ouml;&auml;. Moni on ilkkunut Amiga Anywhere&auml; lelutuotteeksi, mutta p&ouml;yt&auml;koneessa se kykenee vaivatta kokoruudun peleihin ja lis&auml;ksi hy&ouml;ty- ja kommunikointiohjelmiin.&quot;<br>
								<br>
								&quot;</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kun Amiga-tietokone kontrolloi is&auml;nt&auml;-k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml; (AmigaOS) ja Amiga Anywhere&auml;, se tarkoittaa ett&auml; voimme hienos&auml;&auml;t&auml;&auml; rajapinnan n&auml;iden kahden v&auml;lill&auml;, jolloin Amiga Anywhere toimii nopeammin AmigaOS:ll&auml; kuin miss&auml;&auml;n muussa is&auml;nt&auml;-k&auml;ytt&ouml;j&auml;rjestelm&auml;ss&auml; (esim. Windows ja Linux).&quot;</font></div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<font size="2"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica">Amiga Anywhere - Amiga miss&auml; vain</font></b></font></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">AmigaOS 4 sis&auml;lt&auml;&auml; nerokkaan ratkaisun, jonka avulla voidaan v&auml;hent&auml;&auml; piratismia ja my&ouml;s est&auml;&auml; k&auml;ytt&ouml;j&auml;rjestelm&auml;n toiminta muissa kuin Amiga Inc.:n hyv&auml;ksymiss&auml; emolevyiss&auml;. AmigaOS 4 vaatii ROM-piireill&auml; sijaitsevan erityisen ohjelmakoodin, mit&auml; ilman se ei k&auml;ynnisty. T&auml;m&auml; ominaisuus on saanut aikaan kritisointia Amiga-maailmassa (ks. <a href="http://www.petitiononline.com/amigaos/" target="_blank">http://www.petitiononline.com/amigaos/</a>). </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">
								<table width="100%" border="0" cellspacing="2" cellpadding="0">
									<tr>
										<td colspan="3" valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
									</tr>
									<tr>
										<td rowspan="2" valign="top" width="50%"></td>
										<td valign="top">
											<div align="center">
												<font face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/kuva_3.jpg" alt="" height="254" width="383" border="0"></font></div>
										</td>
										<td rowspan="2" valign="top" width="50%"></td>
									</tr>
									<tr>
										<td valign="top">
											<div align="left">
												<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kovalevyn k&auml;ytt&ouml;&ouml;nottoon ja osiointiin on tarjolla &quot;HD Prep Util&quot;, joka tukee my&ouml;s eri tiedostoj&auml;rjestelmi&auml;.</font></div>
										</td>
									</tr>
									<tr>
										<td colspan="3" valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
									</tr>
								</table>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Fleecy Moss:<br>
								<br>
								&quot;AmigaOS 4 on suunniteltu toimimaan parhaiten AmigaOne:ssa ja muissa puhtaissa PPC-ratkaisuissa, joille Amiga Inc. on antanut virallisen sertifioinnin. Amiga Inc. esitt&auml;&auml; sertifiointij&auml;rjestelm&auml;n, jotta voidaan varmistaa, ett&auml; vain laatutuotteita julkaistaan, ja siksi AmigaOS 4:n voi hankkia ainoastaan uuden ja Amiga Inc.:n sertifioiman tuotteen kanssa. Jos siis haluat k&auml;ytt&auml;&auml; AmigaOS 4:&auml;&auml; uudessa PowerPC-koneessa, osta ainoastaan Amiga Inc.:n sertifioima tuote, tai voit joutua pettym&auml;&auml;n.&quot;<br>
								<br>
								Koska kuitenkin tied&auml;mme, ett&auml; monet Amiga-k&auml;ytt&auml;j&auml;t ovat investoineet PowerPC-kiihdytinkortteihin, enimm&auml;kseen Blizzardiin ja Cyberstormiin, me teemme kovasti ty&ouml;t&auml; niiden AmigaOS 4:n versioiden eteen, jotka toimivat my&ouml;s n&auml;iss&auml; korteissa.<br>
								<br>
							</font>
							<table width="100%" border="0" cellspacing="0" cellpadding="3" bgcolor="#fff8dc">
								<tr>
									<td bgcolor="#f0f8ff">
										<div align="center">
											<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b><font color="#000099">AmigaOne-laitteiston spesifikaatio (voi muuttua)</font></b></font></div>
									</td>
								</tr>
							</table>
							<br>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">CPU: mik&auml; tahansa G3/G4-prosessori<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Muisti: 2 x 133 MHz SDRAM-paikkaa, maksimi 2 Gt<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Grafiikkakorttipaikat: 2x AGP + 66MHz PCI-v&auml;yl&auml;<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Laajennuskorttipaikat: 4 PCI-paikkaa<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Haluttaessa laajennuskortin avulla liit&auml;nt&auml; Classic Amiga laitteistolle.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Lis&auml;ksi:</font>
							<ul>
								<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Levyasema</font>
								<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Sarjaportti- ja rinnakkaisporttiliit&auml;nn&auml;t </font>
								<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">PS2-n&auml;pp&auml;imist&ouml; ja -hiiri </font>
								<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Integroitujen j&auml;rjestelmien tuki</font>
								<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kaksi USB-liit&auml;nt&auml;&auml; ja kaksi 10/100 Mbit -Ethernet-liit&auml;nt&auml;&auml;</font>
								<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">AC97 (&auml;&auml;ni)</font>
								<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">MC97 (Data/Fax/Modeemi)</font>
								<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">UDMA 100/ATAPI - 2 kanavaa (4 laitetta)</font>
							</ul>
						</div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<font size="2"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica">AmigaOS ja tulevaisuus</font></b></font></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">AmigaOS 4 sis&auml;lt&auml;&auml; roppakaupalla ns. pakollisia p&auml;ivityksi&auml;, jotta on voitu siirty&auml; uuteen rautateknologiaan. Katse tulevaisuuteen: mik&auml; on Amiga Inc:n tavoite tulevaisuudessa ja millaisia visioita on AmigaOS 5:st&auml;?<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Fleecy Moss:<br>
								<br>
								&quot;</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">T&auml;rkein tarkoitus AmigaOnella ja AmigaOS 4.0:lla on siirt&auml;&auml; Amiga-yhteis&ouml; kohti uutta, avointa ja tekniikan nykytilaa vastaavaa laitteistoa, aloittaen AmigaOnesta. Siksi AmigaOS 4 on siirtym&auml;ajan tuote, joka tarjoaa taaksep&auml;in yhteensopivuuden suurelle m&auml;&auml;r&auml;lle nykyisi&auml; ja uusia AmigaOS 4 -ohjelmia sek&auml; lupauksen AmigaOS 5:sta. AmigaOS 4 on jatkoa tuotteen vuonna 1985 alkaneelle kehitykselle.&quot;<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">AmigaOS 5 tulee olemaan jotain vallankumouksellista. Se esitt&auml;&auml; oppimista menneist&auml;, katsomista tulevaan ja kaikkeen, mit&auml; olemme halunneet tehd&auml; mutta joka on ollut mahdotonta laitteiston rajoituksien vuoksi tai pelosta menn&auml; hyv&auml;ksyttyjen normien ohitse. T&auml;m&auml; voi kuulostaa oudolta, mutta se on sen tosiasian hyv&auml;ksymist&auml;, ett&auml; tietokonemaailma puskee kohti seini&auml; ja esteit&auml;, aiheuttaen kitkaa ja konflikteja. Hyvin paljon saman tyyppist&auml; tapahtui 80-luvun alussa, ja sen tuloksena ensimm&auml;inen Amiga syntyi. Vaikka emme voikaan mahtipontisesti sanoa, ett&auml; tulemme saavuttamaan sen mit&auml; Jay, Carl, Dale ja muut tekiv&auml;t, sit&auml; aiomme kuitenkin yritt&auml;&auml;.&quot;<br>
								<br>
								&quot;</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Mit&auml; se sitten tarkoittaa tosiasiassa? Universaaleja koneita, suoraviivaista jatkuvuutta, semanttisia verkkoja, turvallisia ohjelmointikieli&auml;, aistinkartoitusta fyysisest&auml; digitaaliseen ja takaisin, objektimerta. Paljon siit&auml; mit&auml; teemme on edelleen tutkivaa eik&auml; v&auml;ltt&auml;m&auml;tt&auml; koskaan n&auml;e p&auml;iv&auml;nvaloa. Meid&auml;n pit&auml;&auml; vet&auml;&auml; viiva sen v&auml;liin mik&auml; on mahdollista ja mik&auml; on tuottavaa</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">. Tapahtui sitten mit&auml; vain, AmigaOS 5 tulee olemaan t&auml;ysin erilainen verrattuna muihin k&auml;ytt&ouml;j&auml;rjestelmiin. Seikkailu jatkuu. 8-)&quot;</font></div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<font size="2"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica">Loppup&auml;&auml;telmi&auml;</font></b></font></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">AmigaOS 4:n kehitys on loppusuoralla ja kyseess&auml; on t&auml;h&auml;n menness&auml; merkitt&auml;vin uudistus tuotteen koko elinkaaren aikana. Tehdyt parannukset kuulostavat vakuuttavilta, ja kun ne on toteutettu osaavan Hyperion Entertainmentin tiimin johdossa, on saatu paljon aikaan pieness&auml; ajassa. Sill&auml; aikaa Amiga Inc. on voinut rauhassa keskitty&auml; jatkoon sek&auml; uusien tuotteiden suunnitteluun ja kehitt&auml;miseen.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">AmigaOS 4:n j&auml;lkeen k&auml;ytt&ouml;j&auml;rjestelm&auml;n kehitt&auml;jill&auml; on huomattavasti helpompaa edet&auml;, kun on standardi laitteisto ja nykyaikainen natiivin PPC-tuen omaava kerneli kehityksen pohjana. Potentiaalisesti asemat ovat paremmat kuin kell&auml;&auml;n muulla Amigan edellisist&auml; omistajista. Viel&auml; on paljon teht&auml;v&auml;&auml;, mutta kun uusi AmigaOne saadaan kaupan hyllyille AmigaOS 4:ll&auml; varustettuna, voidaan puhua uuden ja merkitt&auml;v&auml;n lehden k&auml;&auml;nt&auml;misest&auml; Amiga-merkin historiassa.<br>
								<br>
							</font>
							<table width="100%" border="0" cellspacing="0" cellpadding="3" bgcolor="#fff8dc">
								<tr>
									<td bgcolor="#f0f8ff">
										<div align="center">
											<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b><font color="#000099">AmigaOS 4 - t&auml;rkeimpi&auml; uusia ja p&auml;ivitettyj&auml; ominaisuuksia</font></b></font></div>
									</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Exec SG (second generation)</b><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Uudet ominaisuudet:<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">1. Hardware Abstraction Layer (HAL)<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">2. Virtuaalimuisti<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">3. Uusi library-rajapinta<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">4. Resurssien seuranta ja hallinta<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">5. Optiona muistin suojaus<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">6. Alasp&auml;in yhteensopiva WarpOS:n kanssa<br>
							</font><br>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>68k-emulaatio</b><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Viimeisimpi&auml; JIT (Just in time) -tekniikoita k&auml;ytt&auml;v&auml; emulaattori 68k prosessorin-ohjelmia varten.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>PPC-natiivit verkko-ominaisuudet</b><br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>PPC natiivi Amiga File System (FFS)</b><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tukee yli 4 Gt:n kovalevyj&auml; ja my&ouml;s 108 merkki&auml; pitki&auml; tiedostonimi&auml;.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>PPC-natiivi CD File System</b><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Joliet-, RockRidge-, CDDA-, multi-session- ja VideoCD-tuki. Tuki on tulossa my&ouml;s sekoitetulle audio/data-CD:lle ja HSF- sek&auml; HSF+ -tiedostoj&auml;rjestelmille (Applen k&auml;ytt&auml;m&auml;).<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>PPC-natiivi RTG</b><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Picasso96-ohjelmiston luojien projekti. Seuraavat kortit tuettuna t&auml;ll&auml; hetkell&auml; (lis&auml;&auml; tulossa):<br>
								1. Permedia 2 / 3<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">2. Voodoo 3<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">3. Matrox G450/G550<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">4. ATI Radeon<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Ami3D</b><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Huipputehokas ja optimoitu 3D-ratkaisu nopeaan 3D-grafiikkaan.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>OpenGL 1.3 -tuki (Mesa 4.0)</b><br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>PPC-natiivi RTA</b><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">AHI-yhteensopiva &auml;&auml;nikorttituki. Tuki suurimmalle osalle markkinoilla olevista Amigan &auml;&auml;nikorteista ja my&ouml;s Soundblaster Live sek&auml; Soundblaster 128 -&auml;&auml;nikorteille.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>PPC-natiivi CLI</b><br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>SCSI-rajapinta</b><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tuki my&ouml;s uusille SCRIPTS-kontrolleria k&auml;ytt&auml;ville laitteille.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>AmigaInput</b><br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>USB-tuki</b><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Aluksi n&auml;pp&auml;imist&ouml;lle ja hiirelle. Skannerituki tulossa seuraavaksi.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>PPC-datatyypit</b><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Laajennettu toimimaan my&ouml;s Amiga Anywhere-ymp&auml;rist&ouml;ss&auml;.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>PPC Storage Toolbox</b><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Uusia toimintoja erilaisten massamuistilaitteiden hallintaan.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>PPC&nbsp;Font Engine</b><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">T&auml;ysin uusittu fonttimoottori, joka tukee True Type ja Open Type -fontteja. Lis&auml;ksi Agfan kanssa on tehty sopimus 12 Truetype-fontin toimittamisesta AmigaOS:n mukana.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>PPC-natiivi OEM-versio Irowse 2.3:sta</b><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>PPC-natiivi versio MUI:sta</b><br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>PPC-natiivi versio Audio Evolution -ohjelmistosta</b></font></div>
					</td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Ajankohtaiset</a></font><font size="2">&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font><font size="2">&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a></font></td>
				</tr>
			</table>
		</center>
	</body>

</html>