<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Toimitukselliset</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../ajankohtaiset/hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<table width="100%">
							<tr>
								<td width="300">SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY.</td>
								<td>KOKOUSMUISTIO</td>
							</tr>
							<tr>
								<td width="300">HALLITUS 1999-2000</td>
								<td></td>
							</tr>
							<tr>
								<td width="300"></td>
								<td>30.9.2000</td>
							</tr>
						</table>
						<br>
						HALLITUKSEN KOKOUS 3/2000<br>
						<br>
						<table width="100%">
							<tr>
								<td valign="top" width="100">AIKA</td>
								<td>10. hein&auml;kuuta - 30. syyskuuta</td>
							</tr>
							<tr>
								<td valign="top" width="100">PAIKKA</td>
								<td>Internet-postituslista</td>
							</tr>
							<tr>
								<td valign="top" width="100">L&Auml;SN&Auml;</td>
								<td>Terho Henriksson<br>
									Tomi Jaskari<br>
									Timo Kemppaala<br>
									Oliver Kruusi<br>
									Valtteri Murto<br>
									Jarmo Piippo<br>
									Janne Pikkarainen<br>
									Anu Seilonen<br>
									Tapani Tanskanen<br>
									Paula-Christiina Wirtanen</td>
							</tr>
						</table>
						<br>
						<b>1</b><br>
						<b>T&auml;st&auml; kokousmuistiosta</b>
						<p>T&auml;h&auml;n muistioon on ker&auml;tty Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n hallituksen Internetiss&auml; postituslistallaan ja IRC-kokouksissaan 10.7. - 30.9.2000 k&auml;ym&auml;n keskustelun p&auml;&auml;kohtia. Otteet ovat eritt&auml;in tiiviit&auml; lyhennelmi&auml;, eik&auml; muistion ole edes tarkoitus sis&auml;lt&auml;&auml; selvityst&auml; kaikista k&auml;sitellyist&auml; aiheista, vaan tuoda esille yhdistystoiminnan kannalta merkitt&auml;v&auml;t seikat.</p>
						<p>Hallituksen postituslista tavoittaa kaikki hallituksen j&auml;senet, mutta kaikki eiv&auml;t v&auml;ltt&auml;m&auml;tt&auml; ole ottaneet osaa kaikkiin aiheisiin.</p>
						<p><b>2</b><br>
						<b>K&auml;siteltyj&auml; aiheita</b></p>
						<p>S&auml;&auml;nt&ouml;m&auml;&auml;r&auml;isen vuosikokouksen j&auml;rjest&auml;minen on ollut hallituksen 1999-2000 loppukauden mittavin teht&auml;v&auml;. Kokouksessa k&auml;sitelt&auml;v&auml;ksi valmisteltiin useita muutoksia yhdistyksen s&auml;&auml;nt&ouml;ihin, vuosikertomus, toimintasuunnitelma, ehdokkaat seuraavaan hallitukseen, raportti tilinhoidon etenemisest&auml; sek&auml; muita asioita. Kokouksen p&ouml;yt&auml;kirja liitteineen julkaistaan normaaliin tapaan Saku-lehdess&auml; ja yhdistyksen kotisivuilla. Vanha hallitus p&auml;&auml;tt&auml;&auml; toimintansa 30. syyskuuta, ja kauden 2000-2001 uusi hallitus aloittaa teht&auml;v&auml;ns&auml; 1. lokakuuta.</p>
						<p>Vuosikokoustapahtuman yhteyteen p&auml;&auml;tettiin liitt&auml;&auml; my&ouml;s Amiga-k&auml;ytt&auml;j&auml;tapaaminen, jossa esitelt&auml;v&auml;ksi j&auml;rjestettiin uusi Amiga Software Development Kit asennettuna k&auml;ytt&ouml;kuntoon Linux-k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml;n. Hallitus kiitt&auml;&auml; Janne Sir&eacute;ni&auml; esittelylaitteiston ja kokouksen Internet-yhteyksien j&auml;rjest&auml;misest&auml; ja Anu Seilosta SDK:n lainaamisesta esittelyk&auml;ytt&ouml;&ouml;n. Hallitus kiitt&auml;&auml; my&ouml;s Amiga-j&auml;lleenmyyj&auml; Gentle Eye Ky:t&auml; tapahtumaan osallistumisesta.</p>
						<p>Kokousj&auml;rjestelyjen yhteydess&auml; todettiin, ett&auml; viranomaisten antamien tietojen mukaan n&auml;in pienimuotoisista tapaamisista rajallisella osallistujam&auml;&auml;r&auml;ll&auml; ja t&auml;llaisella tapahtuman sis&auml;ll&ouml;ll&auml; ei tarvitse tehd&auml; kirjallista ilmoitusta poliisille. M&auml;&auml;r&auml;yksen ydinajatus on siin&auml;, onko kyseess&auml; luonteeltaan tai sis&auml;ll&ouml;lt&auml;&auml;n sellainen tapahtuma, joka voisi vaatia alueen poliisilta erityisi&auml; toimia tai valmistautumista. Todettiin, ett&auml; ilmoituspakon poisj&auml;&auml;minen saattaa osaltaan helpottaa my&ouml;s mahdollisten kerhoiltojen j&auml;rjest&auml;mist&auml;.</p>
						<p>Esitettiin, ett&auml; yhdistyksen tulisi pyrki&auml; mahdollisuuksien mukaan julkaisemaan toiminnastaan my&ouml;s kansainv&auml;lisi&auml; tiedotteita ulkomaisissa uutispalveluissa ja tiedotuskanavissa, sill&auml; niiden avulla saadaan ker&auml;tty&auml; n&auml;kyvyytt&auml; ja uskottavuutta ulkomaisten Amiga-yritysten ja k&auml;ytt&auml;j&auml;yhteis&ouml;n silmiss&auml;.</p>
						<p>Vuodelle 2001 suunnitellun uuden Saku-tapahtuman ennakkovalmistelut etenev&auml;t. Tiedotuksen ansiosta yhdistyksen tapahtumavastaava <a href="mailto:terho.henriksson@kopteri.net">Terho Henriksson</a> on saanut hankittua useita tapahtuma-avustajia lis&auml;&auml;, ja h&auml;nelle on esitetty runsaasti erinomaisia ideoita avuntarjouksineen. Uudet yhteydenotot tapahtuma-asioissa ovat edelleen tervetulleita.</p>
						<p>Yhdistyksen kotisivuille on ehdotettu keskustelupalstaa useilla muilla sivuilla olevien &quot;chattien&quot; tapaan. Samoista syist&auml; kuin taannoin ehdotetun osto- ja myyntipalstan perustaminen kotisivuille, ei keskustelupalstankaan j&auml;rjest&auml;minen toistaiseksi ole kuitenkaan mahdollista. Todettiin, ett&auml; jo nykyisell&auml;&auml;n esimerkiksi DOT:n Amiga-postituslista, uutisryhm&auml;t ja Sakunet tarjoavat riitt&auml;v&auml;sti mahdollisuuksia Amiga-aiheiselle keskustelulle. Kuten ennenkin, vaikkei uusien suuria resursseja vaativien palvelujen j&auml;rjest&auml;mist&auml; voida itse toteuttaa, ollaan tietysti aina valmiita ottamaan huomioon tarjouksia asiallisesti toimivien valmiiden sivujen lis&auml;&auml;misest&auml; yhdistyksen sivujen linkkivalikoimaan.</p>
						<p>Muistion kokosi ja kirjoitti Jarmo Piippo. Oikoluvusta kiitos Anu Seiloselle.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../ajankohtaiset/hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
