<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Toimitukselliset</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n tiedotteita</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Jarmo Piippo</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">T&auml;m&auml; on yhteenveto yhdistyksen viime Sakun j&auml;lkeen julkaisemista tiedotteista.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>6.8.2000 - SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY. ON VIRALLINEN AMIGA-K&Auml;YTT&Auml;J&Auml;RYHM&Auml;</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Tunnustuksena Amiga-k&auml;ytt&auml;j&auml;yhteis&ouml;n tukena toimimisesta Amiga Inc. on my&ouml;nt&auml;nyt Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:lle luvan k&auml;ytt&auml;&auml; &quot;Amiga Recognized User Organization&quot; -merkki&auml; yhdistyksen web-sivuilla. T&auml;h&auml;n liittyen Amiga on tarkastanut ja hyv&auml;ksynyt yhdistyksen web-sivuston sis&auml;ll&ouml;n. Saimme Amigalta my&ouml;s kiitokset pitk&auml;&auml;n jatkuneesta Amiga-yhteis&ouml;n tuesta.
						<p>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. otti eritt&auml;in kiitollisena vastaan tunnustuksen. Jatkamme nyt virallisena Amiga-k&auml;ytt&auml;j&auml;ryhm&auml;n&auml; kohti Amiga-markkinoiden tuomia uusia haasteita, ja tarkoituksenamme on jatkossakin s&auml;ilytt&auml;&auml; toimivat yhteydet Amiga Inc.:iin.</p>
						<p>Hallitus,<br>
						Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>6.8.2000 - SAKU-TAPAHTUMILLE TULOSSA JATKOA</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Suomen suurin Amiga-aiheinen tapahtuma on her&auml;tt&auml;nyt paljon kiinnostusta Suomen Amiga-k&auml;ytt&auml;jien keskuudessa. Kahdessa viimeisimm&auml;ss&auml; Saku-tapahtumassa on vieraillut yhteens&auml; noin 1000 atk-harrastajaa Suomesta ja my&ouml;s kansainv&auml;lisi&auml; vieraita. Olemme saaneet runsaasti palautetta koskien seuraavan Saku-tapahtuman j&auml;rjest&auml;mist&auml;.
						<p>Amiga-markkinoiden ja my&ouml;s yhdistyksen j&auml;senm&auml;&auml;r&auml;n kehitys ovat olleet ratkaisevat tekij&auml;t pohtiessamme tilaisuuden ajankohtaa ja tapahtumalle asetettavia tavoitteita. Huolellisen pohdinnan j&auml;lkeen hallitus on p&auml;&auml;tt&auml;nyt ajoittaa seuraavan Saku-tapahtuman alustavasti vuoden 2001 puolelle. Tavoitteenamme on ensisijaisesti s&auml;ilytt&auml;&auml; Saku-tapahtumien laatutaso ja el&auml;myksellisyys.</p>
						<p>Saku-tapahtuma on eritt&auml;in iso projekti, ja se on aina vaatinut kymmenien henkil&ouml;iden yhteisty&ouml;t&auml;. Voit osaltasi tukea t&auml;t&auml; arvokasta tapahtumaa liittym&auml;ll&auml; yhdistyksen j&auml;seneksi tai hankkimalla Saku-CD-ROMin. Voit my&ouml;s auttaa laajemmin tapahtuman j&auml;rjestelyiss&auml; ilmoittautumalla tapahtuma-avustajaksi tai n&auml;ytteilleasettajaksi.</p>
						<p>Saku-tapahtumalla on t&auml;rke&auml; osa uuden Amiga-teknologian tunnettavuuden lis&auml;&auml;misess&auml; Suomessa. Tutkimme muuttuvien Amiga-markkinoiden tilannetta edelleen ja pyrimme hy&ouml;dynt&auml;m&auml;&auml;n sen tuomia uusia mahdollisuuksia. N&auml;in voimme varmistaa sen, ett&auml; odotettavissa on j&auml;lleen mielenkiintoinen ja onnistunut tapahtuma.</p>
						<p>Saku-tapahtumaa koskevat tiedustelut, ideat ja palautteen voit l&auml;hett&auml;&auml; tapahtumavastaavalle: Terho Henriksson, <a href="mailto:terho.henriksson@kopteri.net">terho.henriksson@kopteri.net</a>.</p>
						<p>Tapahtumaterveisin,</p>
						<p>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.<br>
						Hallitus</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>21.9.2000 - SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY. J&Auml;RJEST&Auml;&Auml; 30.9. AMIGA-K&Auml;YTT&Auml;J&Auml;TAPAAMISEN</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">ESPOO, FINLAND - September 21, 2000 - Finnish Amiga Users Group will host its annual user group meeting on Saturday September 30th from 14:00 to 17:45 in Espoo, Finland. The event will start with a formal meeting, and an informal part will follow after 15:30 o'clock.
						<p>An Amiga dealer will be present with various Amiga items for sale. The user group will also demonstrate the Amiga Software Development Kit on Linux. Other highlights include various Amiga magazines for reading, demonstration of licensed Amiga mobile phone covers and plenty of good company. Admission is free of charge and free soft drinks will be available.</p>
						<p>Please visit http://batman.jytol.fi/~saku/ or our mirror site http://tzimmola.tky.hut.fi/saku/ for instructions on how to get there, latest news, IRC coverage, webcam and more. E-mail inquiries may be sent to Anu Seilonen (thoriel@sci.fi).</p>
						<p>About Finnish Amiga Users Group</p>
						<p>Finnish Amiga Users Group (Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.) is a non-profit organization for promoting Amiga computing and helping Amiga users in Finland. Also known as Saku, after its e-zine, the group is trying to accomplish its goals by organizing meetings and by publishing an e-zine. Since 1993 the Finnish Amiga Users Group and its predecessors have released over thirty issues of the magazine and held several public gatherings. Other accomplishments include the Web site and Sakunet, a national Fidonet style network of Amiga related bulletin board systems.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Finnish Amiga Users Group Announces User Group Meeting</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">ESPOO, FINLAND - September 21, 2000 - Finnish Amiga Users Group will host its annual user group meeting on Saturday September 30th from 14:00 to 17:45 in Espoo, Finland. The event will start with a formal meeting, and an informal part will follow after 15:30 o'clock.
						<p>An Amiga dealer will be present with various Amiga items for sale. The user group will also demonstrate the Amiga Software Development Kit on Linux. Other highlights include various Amiga magazines for reading, demonstration of licensed Amiga mobile phone covers and plenty of good company. Admission is free of charge and free soft drinks will be available.</p>
						<p>Please visit http://batman.jytol.fi/~saku/ or our mirror site http://tzimmola.tky.hut.fi/saku/ for instructions on how to get there, latest news, IRC coverage, webcam and more. E-mail inquiries may be sent to Anu Seilonen (thoriel@sci.fi).</p>
						<p>About Finnish Amiga Users Group</p>
						<p>Finnish Amiga Users Group (Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.) is a non-profit organization for promoting Amiga computing and helping Amiga users in Finland. Also known as Saku, after its e-zine, the group is trying to accomplish its goals by organizing meetings and by publishing an e-zine. Since 1993 the Finnish Amiga Users Group and its predecessors have released over thirty issues of the magazine and held several public gatherings. Other accomplishments include the Web site and Sakunet, a national Fidonet style network of Amiga related bulletin board systems.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular" color="#191970">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
