<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Toimitukselliset</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../ajankohtaiset/hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<table width="100%">
							<tr>
								<td width="300">SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY.</td>
								<td>P&Ouml;YT&Auml;KIRJA</td>
							</tr>
							<tr>
								<td width="300">HALLITUS 1999-2000</td>
								<td></td>
							</tr>
							<tr>
								<td width="300"></td>
								<td>5.10.2000</td>
							</tr>
						</table>
						<br>
						YHDISTYKSEN VUOSIKOKOUS 2000<br>
						<br>
						<table width="100%">
							<tr>
								<td valign="top" width="100">AIKA</td>
								<td>30. syyskuuta kello 14.00 - 15.20</td>
							</tr>
							<tr>
								<td valign="top" width="100">PAIKKA</td>
								<td>Espoon keskus, taloyhti&ouml;n kerhotila<br>
									Kaivomestarinkatu 8, Espoo</td>
							</tr>
							<tr>
								<td valign="top" width="100">L&Auml;SN&Auml;</td>
								<td>Tomi Jaskari, puheenjohtaja<br>
									Jarmo Piippo, sihteeri<br>
									20 j&auml;sent&auml; ja kokousvierasta (<a href="#liite1" target="_self">liite 1</a>)<br>
								</td>
							</tr>
						</table>
						<br>
						<b>1</b><br>
						<b>Kokouksen avaus</b>
						<p>Tomi Jaskari avasi kokouksen kello 14.00.</p>
						<p><b>2</b><br>
						<b>Valitaan kokouksen puheenjohtaja, sihteeri, kaksi p&ouml;yt&auml;kirjantarkistajaa ja tarvittaessa kaksi &auml;&auml;ntenlaskijaa</b></p>
						<p>Valittiin kokouksen puheenjohtajaksi Tomi Jaskari, sihteeriksi Jarmo Piippo sek&auml; p&ouml;yt&auml;kirjantarkistajiksi Ville Sarell, Anu Seilonen ja Paula-Christiina Wirtanen. &Auml;&auml;ntenlaskijoita ei tarvittu eik&auml; valittu.</p>
						<p><b>3<br>
						Todetaan kokouksen laillisuus ja p&auml;&auml;t&ouml;svaltaisuus</b></p>
						<p>Kokouskutsut (<a href="#liite2" target="_self">liite 2</a>) on l&auml;hetetty ajoissa ja l&auml;sn&auml; on vaadittu m&auml;&auml;r&auml; henkil&ouml;it&auml; (<a href="#liite1" target="_self">liite 1</a>). Todettiin kokous lailliseksi ja p&auml;&auml;t&ouml;svaltaiseksi.</p>
						<p><b>4</b><br>
						<b>Hyv&auml;ksyt&auml;&auml;n kokouksen ty&ouml;j&auml;rjestys</b></p>
						<p>Hyv&auml;ksyttiin kokouksen ty&ouml;j&auml;rjestys kokouskutsun (<a href="#liite2" target="_self">liite 2</a>) mukaisena.</p>
						<p><b>5<br>
						Esitet&auml;&auml;n tilinp&auml;&auml;t&ouml;s, vuosikertomus ja tilintarkastajien lausunto</b></p>
						<p>Tomi Jaskari esitti kirjanpit&auml;j&auml;n raportin <a href="#liite3" target="_self">(liite 3</a>), jonka mukaisesti todettiin, ettei tilikauden 1999-2000 kirjanpitoa ole voitu viel&auml; saattaa asianmukaiseen tilinp&auml;&auml;t&ouml;skuntoon, sill&auml; tilinhoitoj&auml;rjestelm&auml;n uusiminen ja aiempien kausien tilinp&auml;&auml;t&ouml;sten valmistelu on viel&auml; kesken. Tomi Jaskari esitti yhdistyksen vuosikertomuksen (<a href="#liite4" target="_self">liite 4</a>). Raportti ja vuosikertomus ovat tilintarkastajien Janne Lardotin ja Pasi Lagerroosin hyv&auml;ksymi&auml;.</p>
						<p><b>6<br>
						P&auml;&auml;tet&auml;&auml;n tilinp&auml;&auml;t&ouml;ksen vahvistamisesta ja vastuuvapauden my&ouml;nt&auml;misest&auml;</b></p>
						<p>Kirjanpit&auml;j&auml;n raportin (<a href="#liite3" target="_self">liite 3</a>) mukaisesti lyk&auml;ttiin tilinp&auml;&auml;t&ouml;sten vahvistaminen ja vastuuvapauden my&ouml;nt&auml;minen aiemmille hallituksille teht&auml;v&auml;ksi my&ouml;hemmin j&auml;rjestett&auml;v&auml;ss&auml; ylim&auml;&auml;r&auml;isess&auml; yhdistyskokouksessa.</p>
						<p><b>7<br>
						Vahvistetaan toimintasuunnitelma, tulo- ja menoarvio sek&auml; liittymis- ja j&auml;senmaksun suuruus</b></p>
						<p>Tulo- ja menoarvion osalta todettiin, ett&auml; j&auml;sentavoite kaudelle on 100, ja jos tavoite saavutetaan, se merkitsee varainhankinnassa parhaimmassa tapauksessa noin 6000 markan tuloja. T&auml;ll&ouml;in kaudella olisi toimintaan k&auml;ytett&auml;viss&auml; yhteens&auml; noin 10000 markkaa, kun edellisen kauden s&auml;&auml;st&ouml;t lasketaan mukaan. Tulojen kertyminen jakautuu kuitenkin niin pitk&auml;lle ajalle, ettei kerralla k&auml;ytett&auml;viss&auml; oleva summa todenn&auml;k&ouml;isesti tule olemaan kuin arviolta korkeintaan kolme nelj&auml;sosaa kokonaissummasta.</p>
						<p>Jarmo Piippo esitti yhdistyksen toimintasuunnitelman (<a href="#liite5" target="_self">liite 5</a>), joka vahvistettiin.</p>
						<p>J&auml;senmaksuksi vuodelle 2001 ehdotettiin joko 60 markkaa (10 euroa) tai 70 markkaa (11 euroa). Kokous valitsi k&auml;si&auml;&auml;nestyksen avulla &auml;&auml;nin 7-9 n&auml;ist&auml; j&auml;lkimm&auml;isen ehdotuksen, joten j&auml;senmaksuksi p&auml;&auml;tettiin 70 markkaa (11 euroa). Erillist&auml; liittymismaksua yhdistykselle ei edelleenk&auml;&auml;n asetettu. Lis&auml;ksi ehdotettiin perustettavaksi uusi, normaalia j&auml;senmaksua hiukan halvempi opiskelijaj&auml;senluokka, mutta ehdotusta ei kannatettu, joten se hyl&auml;ttiin.</p>
						<p><b>8<br>
						Valitaan hallituksen puheenjohtaja ja muut j&auml;senet</b></p>
						<p>Ehdotettiin yhdistyksen s&auml;&auml;nt&ouml;jen nelj&auml;s pyk&auml;l&auml; muutettavaksi muotoon, jossa hallituksen j&auml;senm&auml;&auml;r&auml; olisi liukuva, siten ett&auml; varsinaisia j&auml;seni&auml; valitaan vuosikokouksissa aina kullekin kaudelle 3-5 ja varaj&auml;seni&auml; 2-5. Muutoksen avulla voidaan jatkossa v&auml;ltty&auml; hankalalta teht&auml;v&auml;lt&auml; yritt&auml;&auml; haalia kiinte&auml;sti m&auml;&auml;r&auml;tty j&auml;senm&auml;&auml;r&auml; t&auml;yteen. Ehdotus hyv&auml;ksyttiin.</p>
						<p>Lis&auml;ksi todettiin, ett&auml; kaikki vuosikokouksessa tehdyt s&auml;&auml;nt&ouml;jen muutokset on aina p&auml;&auml;ttyv&auml;n kauden puheenjohtajan ilmoitettava yhdistysrekisteriin. Todettiin my&ouml;s, ett&auml; yhten&auml; uusien puheenjohtajien valinnan perusteena on heid&auml;n kotipaikkakuntansa sijainti, jotta p&auml;&auml;t&ouml;svaltaisten kokousten j&auml;rjest&auml;minen olisi mahdollisimman helppoa sek&auml; Etel&auml;- ett&auml; Pohjois-Suomessa.</p>
						<p>Valittiin uusi hallitus (<a href="#liite6" target="_self">liite 6</a>) paikalla olevista sek&auml; etuk&auml;teen suostumuksensa antaneista henkil&ouml;ist&auml;.</p>
						<p><b>9<br>
						Valitaan tilintarkastaja ja h&auml;nelle yksi varamies</b></p>
						<p>Tilintarkastajaksi valittiin Janne Lardot ja varamieheksi Pasi Lagerroos. Molemmat ovat antaneet suostumuksensa teht&auml;v&auml;&auml;n ennen kokousta.</p>
						<p><b>10<br>
						K&auml;sitell&auml;&auml;n muut esille tulevat asiat</b></p>
						<p>Ehdotettiin yhdistyksen s&auml;&auml;nt&ouml;jen seitsem&auml;s pyk&auml;l&auml; muutettavaksi siten, ett&auml; kohta, jossa mainitaan Fidonet ja Internet mahdollisina kokouksen koollekutsumiskanavina, muutetaan muotoon: &quot;Jos mahdollista, koollekutsu julkaistaan my&ouml;s kulloinkin sopivia elektronisia kanavia k&auml;ytt&auml;en.&quot; Ehdotus hyv&auml;ksyttiin.</p>
						<p>Ehdotettiin yhdistyksen s&auml;&auml;nt&ouml;jen kolmanteen pyk&auml;l&auml;&auml;n muutos, jossa mainintaan yhdistyksest&auml; eroamisesta lis&auml;t&auml;&auml;n, ett&auml; my&ouml;s j&auml;senmaksun maksamatta j&auml;tt&auml;minen katsotaan yhdistyksest&auml; eroamiseksi. Muutoksen tarkoituksena on saada s&auml;&auml;nt&ouml;jen kirjallinen muoto vastaamaan k&auml;yt&auml;nn&ouml;ksi muodostunutta yleist&auml; toimintatapaa. Ehdotus hyv&auml;ksyttiin.</p>
						<p>Ehdotettiin Saku-lehden kotiinkanto ja levykelehden julkaisu lopetettavaksi vuoden 2000 viimeisen numeron j&auml;lkeen sek&auml; lehden kotiinkantomaksu poistettavaksi k&auml;yt&ouml;st&auml; vuoden 2001 j&auml;senmaksusta alkaen. Toimintasuunnitelman (<a href="#liite5" target="_self">liite 5</a>) mukaisesti vuoden 2001 alusta l&auml;htien lehden HTML-painos on ainoa julkaisumuoto, jotta voimavarat voidaan keskitt&auml;&auml; yhden tasokkaan lehtiformaatin kehitt&auml;miseen. Ehdotus hyv&auml;ksyttiin.</p>
						<p>Ilmoitettiin, ett&auml; aktiivisesta uuden logon etsimisest&auml; yhdistykselle on toistaiseksi luovuttu. Nykyinen sammakkologo on jo vakiintunut k&auml;ytt&ouml;&ouml;n ja muodostunut kaikille j&auml;senille tutuksi.</p>
						<p>Ehdotettiin purettavaksi vuonna 1995 tehty p&auml;&auml;t&ouml;s yrityksille tarkoitetun tukij&auml;senluokan perustamisesta, koska luokkaa ei ole koskaan k&auml;yt&auml;nn&ouml;ss&auml; toteutettu ja yhdistyksen tukeminen ilman sit&auml;kin on mahdollista mm. lahjoitusten avulla. Ehdotus hyv&auml;ksyttiin.</p>
						<p>Ehdotettiin k&auml;ytett&auml;v&auml;ksi hyv&auml;ksi mahdollisuutta yhdistyksen tilin yhdist&auml;miseen yksityisen henkil&ouml;tilin palvelusopimukseen, jotta nykyiset kohtuuttoman suuret kulut pankkipalvelumaksuihin saadaan laskemaan. Lis&auml;ksi ehdotettiin yhdistyksen tilin siirtoa tarvittaessa eri pankkiin, mik&auml;li mahdollinen tilinhoitajan vaihdos niin k&auml;yt&auml;nn&ouml;ss&auml; vaatii. Ehdotukset hyv&auml;ksyttiin.</p>
						<p>Ehdotettiin paperisten tiliotteiden k&auml;yt&ouml;n lopettamista tilitapahtumien seurannassa, koska s&auml;hk&ouml;isess&auml; muodossa toimitettaviin tiliotteisiin siirtyminen voisi mahdollistaa hiukan pienemm&auml;t kulut. Ehdotus kuitenkin hyl&auml;ttiin, koska paperisia tiliotteita tarvitaan kirjanpidon virallisen todentamisen helpottamiseksi.</p>
						<p>Ehdotettiin tarjouskilpailun j&auml;rjest&auml;mist&auml; pankeille edullisimmat palvelumaksut tarjoavan tiliratkaisun l&ouml;yt&auml;miseksi. Kilpailua j&auml;rjest&auml;m&auml;&auml;n ei kuitenkaan l&ouml;ytynyt riitt&auml;v&auml;sti osaamista tai aikaa omaavaa henkil&ouml;&auml;, joten ehdotus hyl&auml;ttiin.</p>
						<p>Kokouspaikkana usein toiminut taloyhti&ouml;n kerhotila ei todenn&auml;k&ouml;isesti tule olemaan en&auml;&auml; jatkossa yhdistyksen k&auml;ytett&auml;viss&auml;, joten edess&auml; on uuden kokouspaikan valinta. Ehdotettiin, ett&auml; paikka voisi olla p&auml;&auml;kaupunkiseudun ulkopuolellakin, esimerkiksi Oulussa, ellei sopivia tiloja kohtuullisella vaivalla muuten j&auml;rjesty. Ehdotus hyv&auml;ksyttiin.</p>
						<p>Puheenjohtaja esitteli tapahtumavastaavan lausunnon (<a href="#liite7" target="_self">liite 7</a>). Todettiin hallituksen tukevan lausunnossa esitettyj&auml; mielipiteit&auml; ja suunnitelmia.</p>
						<p>Ehdotettiin Saku-lehden julkaisutiheyden nostamista siten, ett&auml; lehti ilmestyisi esimerkiksi kahden kuukauden v&auml;lein. Todettiin, ettei nykyinen artikkelimateriaalin kertymisnopeus tai toimituksen resurssien m&auml;&auml;r&auml; ainakaan toistaiseksi n&auml;yt&auml; mahdollistavan nykyist&auml; tihe&auml;mp&auml;&auml; julkaisurytmi&auml;. Mik&auml;li tilanne olennaisesti muuttuu, julkaisutiheyden nostamista voidaan harkita uudelleen.</p>
						<p><b>11<br>
						Kokouksen p&auml;&auml;tt&auml;minen</b></p>
						<p>Puheenjohtaja p&auml;&auml;tti kokouksen kello 15.20.</p>
						<p>
						<table border="0" cellpadding="4" cellspacing="0">
							<tr>
								<td>Tomi Jaskari</td>
								<td>Jarmo Piippo</td>
							</tr>
							<tr>
								<td>puheenjohtaja</td>
								<td>sihteeri</td>
							</tr>
						</table>
						</p>
						<p><b>12<br>
						P&ouml;yt&auml;kirjan tarkistus</b></p>
						<p>Olemme tarkistaneet p&ouml;yt&auml;kirjan ja todenneet sen vastaavan kokouksen kulkua.</p>
						<p>
						<table border="0" cellpadding="4" cellspacing="0">
							<tr>
								<td>Ville Sarell</td>
								<td>Anu Seilonen</td>
								<td>Paula-Christiina Wirtanen</td>
							</tr>
							<tr>
								<td>p&ouml;yt&auml;kirjantarkistaja</td>
								<td>p&ouml;yt&auml;kirjantarkistaja</td>
								<td>p&ouml;yt&auml;kirjantarkistaja</td>
							</tr>
						</table>
						</p>
						<p><b>13<br>
						Liitteet</b></p>
						<p><font size="2"><b><a name="liite1"></a>Liite 1 - osallistujat</b></font></p>
						<p>Arsi Koutaniemi, Patrik Wikstr&ouml;m, Tomi Jaskari, Jarmo Piippo, Janne Pikkarainen, Ville Sarell, Anu Seilonen, Ari Latvaniemi, Boogie/Gentle Eye Ky, Tommi Nieminen, Sami Yl&ouml;nen, Janne Sir&eacute;n, Paula-Christiina Wirtanen, Pasi Piippo, Timo Kemppaala, Teemu K&auml;rkk&auml;inen, Petri Koistinen, Tuomas Ilkka, Jarmo Salminen, Jarle Eidet, Mika Hanhij&auml;rvi, Marko Lustim&auml;ki.</p>
						<p><font size="2"><b><a name="liite2"></a>Liite 2 - Kokouskutsu</b></font></p>
						<pre>SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY.                                 VUOSIKOKOUSKUTSU

                                                           17.9.2000


Hyv&auml; Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n j&auml;sen,

Kutsumme teid&auml;t yhdistyksen s&auml;&auml;nt&ouml;m&auml;&auml;r&auml;iseen vuosikokoukseen, joka
j&auml;rjestet&auml;&auml;n Espoossa lauantaina 30. syyskuuta kello 14 alkaen. Kokouksesta
on sen keston ajan, noin kello 14-15, IRC-yhteys kanavalla #saku, ja webcam
osoitteessa http://batman.jytol.fi/~saku/ v&auml;litt&auml;&auml; kokouksesta kuvia.
Kokous on avoinna kaikille, ja paikan p&auml;&auml;ll&auml; on tarjolla virvoitusjuomia ja
leppoisaa seuraa. Kokous etenee oheisen esityslistan mukaisesti.

Muihin kokouksessa k&auml;sitelt&auml;viin asioihin kuuluvat mm. seuraavat muutokset
yhdistyksen s&auml;&auml;nt&ouml;ihin: hallituksen j&auml;senm&auml;&auml;r&auml; esitet&auml;&auml;n muutettavaksi
liukuvaksi, ja maininta Fidonetist&auml; kokouksen koollekutsumiskanavana
korvataan Amiga-postituslistalla ja Sakunetill&auml;. Lis&auml;ksi p&auml;&auml;tet&auml;&auml;n
levyke-Sakun lopettamisesta vuoden viimeiseen numeroon sek&auml; siihen liittyen
kotiinkantomaksusta luopumisesta. Esityksen mukaan voimavarat olisi
tarkoitus keskitt&auml;&auml; jatkuvasti kehittyv&auml;n HTML-version toimittamiseen.

1. Kokouksen avaus.
2. Valitaan kokouksen puheenjohtaja, sihteeri, kaksi p&ouml;yt&auml;kirjantarkistajaa
   ja tarvittaessa kaksi &auml;&auml;ntenlaskijaa.
3. Todetaan kokouksen laillisuus ja p&auml;&auml;t&ouml;svaltaisuus.
4. Hyv&auml;ksyt&auml;&auml;n kokouksen ty&ouml;j&auml;rjestys.
5. Esitet&auml;&auml;n tilinp&auml;&auml;t&ouml;s, vuosikertomus ja tilintarkastajien lausunto.
6. P&auml;&auml;tet&auml;&auml;n tilinp&auml;&auml;t&ouml;ksen vahvistamisesta ja vastuuvapauden my&ouml;nt&auml;misest&auml;.
7. Vahvistetaan toimintasuunnitelma, tulo- ja menoarvio sek&auml; liittymis- ja
   j&auml;senmaksun suuruus.
8. Valitaan hallituksen puheenjohtaja ja muut j&auml;senet.
9. Valitaan tilintarkastaja ja h&auml;nelle yksi (1) varamies, tilintarkastajan
   toimikausi on 1.10. - 30.9.
10. K&auml;sitell&auml;&auml;n muut esille tulevat asiat.
11. Kokouksen p&auml;&auml;tt&auml;minen.

Kokouksen j&auml;lkeen, arviolta kello 15-16 alkaen, on kokeiltavissa uusi Amiga
SDK (Software Development Kit), jonka avulla seuraavan sukupolven
laiteriippumattoman Amiga-j&auml;rjestelm&auml;n sovelluksia parhaillaan kehitet&auml;&auml;n.

Tarjolla on my&ouml;s mahdollisuus tutustua AmigActive-lehden ja Amiga Inc.:n
Amiga World -lehden irtonumeroihin, saksalaisen AmigaOS-lehden joulukuun
numerossaan julkaisemaan juttuun Saku 99 -tapahtumasta sek&auml; suomalaisen
Meriitti-lehden numeroon 2/2000, jossa oli laaja artikkeli Suomen
Amiga-k&auml;ytt&auml;j&auml;t ry:n toiminnasta. Ensi vuoden j&auml;senmaksun voi maksaa
kokouksessa, ja lis&auml;ksi myymme pois Saku-CD-ROMin toisen painoksen j&auml;ljell&auml;
olevat levyt 40 markan kappalehintaan.

Vuosikokous j&auml;rjestet&auml;&auml;n edellisen vuoden tapaan Kirkkoj&auml;rvell&auml;, Espoon
keskuksessa. Kokouspaikka on Kaivomestarinkatu 8, taloyhti&ouml;n kerhotila.
Kaivomestarinkatu on lyhyen k&auml;velymatkan p&auml;&auml;ss&auml; Espoon juna-asemalta
(Helsingist&auml; l&auml;hijunat E, L, S) ja se sijaitsee hotelli Kuninkaantiest&auml;
katsoen Kirkkokadun vastakkaisella puolella. L&auml;helt&auml; kulkee l&auml;hiliikenteen
linja-autoja ja henkil&ouml;autoille on maksutonta pys&auml;k&ouml;intitilaa.

Tarkemmat saapumisohjeet kokouspaikalle l&ouml;ytyv&auml;t yhdistyksen kotisivulta
osoitteesta http://batman.jytol.fi/~saku/, ja sinne p&auml;ivitet&auml;&auml;n
tarvittaessa my&ouml;s lis&auml;tietoja kokouksesta. Puhelimitse lis&auml;tietoja antaa
Janne Sir&eacute;n, 050 522 3690, ja s&auml;hk&ouml;postitse lis&auml;tietoja saa Anu Seiloselta
(thoriel@sci.fi).</pre>
						<p><font size="2"><b><a name="liite3"></a>Liite 3 - Kirjanpit&auml;j&auml;n raportti</b></font></p>
						<p>Tiedoksi Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n tilintarkastajalle, ja liitett&auml;v&auml;ksi osaksi yhdistyksen vuoden 2000 vuosikokouksen p&ouml;yt&auml;kirjaa:</p>
						<p>Yhdistyksen aikaisemman talousvastaavan, hallituksen puheenjohtaja Tomi Jaskarin ep&auml;onnistuttua yhdistyksen kirjanpidon vaadituntasoisessa hoitamisessa, siirrettiin teht&auml;v&auml; vuoden 2000 kev&auml;&auml;ll&auml; allekirjoittaneelle, yhdistyksen j&auml;sen Janne Sir&eacute;nille. Olen luvannut hoitaa kuntoon puuttuvan kirjanpidon vuosilta 1994-1999 tilintarkastajan vuoden 1999 vuosikokoukselle esitt&auml;m&auml;n huomautuksen mukaisesti. K&auml;yt&auml;nn&ouml;ss&auml; kirjoitan siis vaaditut asiakirjat olemassaolevien tositteiden pohjalta tilintarkastusta varten.</p>
						<p>Kirjanpidon heikko tila oli v&auml;&auml;rinymm&auml;rrysten, henkil&ouml;kohtaisten vaikeuksien ja tietotaidon puutteen summa. Ongelma oli tiedostettu jo pitk&auml;&auml;n, mutta sen varsinainen laajuuden ja vakavuuden k&auml;ydess&auml; ilmeiseksi, oli my&ouml;s ratkaisua vaikea l&ouml;yt&auml;&auml;. Uskon, ett&auml; onnistumme kuitenkin viimein k&auml;&auml;nt&auml;m&auml;&auml;n kelkan.</p>
						<p>Koska kirjanpitoon liittyvien asioiden opiskelu vie aikansa ja hoitamatta olevien tilikausien m&auml;&auml;r&auml; on suuri, ei ty&ouml;t&auml; ole saatu p&auml;&auml;t&ouml;kseen vuoden 2000 vuosikokoukseen menness&auml;, eik&auml; t&auml;ten my&ouml;sk&auml;&auml;n ole ollut edellytyksi&auml; saattaa tilikauden 1999-2000 kirjanpitoa asianmukaiseen tilinp&auml;&auml;t&ouml;skuntoon. Aikaisemmat tilikaudet on ensin saatava kirjoihin ja kansiin lain vaatimalla tavalla. T&auml;m&auml; ty&ouml; on aloitettu ja tilikaudet 1994-1995 ja 1995-1996 ovat tilikartan ja p&auml;iv&auml;kirjan osalta valmiit.</p>
						<p>Viel&auml; puuttuvat tilinp&auml;&auml;t&ouml;kset kyseisilt&auml; tilikausilta sek&auml; tilikausien 1996-1997, 1997-1998 ja 1998-1999 kirjanpito. Kun allekirjoittanut on, mahdollisimman pian, saanut t&auml;m&auml;n ty&ouml;n p&auml;&auml;t&ouml;kseen, ja tilikaudet on tarkastettu sek&auml; ylim&auml;&auml;r&auml;isess&auml; kokouksessa hyv&auml;ksytetty, siirtyy tilikauden 1999-2000 kirjanpidon hoitaminen hallituksen j&auml;sen Jarmo Piipolle, joka on teht&auml;v&auml;&auml;n lupautunut. Tavoitteena tilikauden 1999-2000 tilinp&auml;&auml;t&ouml;ksen hyv&auml;ksyminen ylim&auml;&auml;r&auml;isess&auml; kokouksessa ennen vuoden 2001 vuosikokousta ja s&auml;&auml;nt&ouml;jen mukaisen kirjanpitoaikataulun tavoittaminen viimein vuoden 2001 vuosikokouksessa.</p>
						<p>Tavoitteena on my&ouml;s, ett&auml; vuoden 2001 vuosikokoukseen menness&auml; kaikille aikaisemmille hallituksille voidaan asianmukaisesti my&ouml;nt&auml;&auml; vastuuvapaus. On ensiarvoisen t&auml;rke&auml;&auml;, ett&auml; yhdistyksen moitteeton toimintamoraali saadaan heijastumaan my&ouml;s vastuullisesti hoidettuun kirjanpitoon.</p>
						<p>Yhdistyksen tositemateriaali ja muu kirjanpitoaineisto on t&auml;ll&auml; hetkell&auml; hallussani, lukuunottamatta kev&auml;&auml;n j&auml;lkeen tulleita tiliotteita ja tositteita, jotka Tomi Jaskari ker&auml;&auml; talteen ty&ouml;t&auml;ni seuraavan Jarmo Piipon urakkaa varten.</p>
						<p>Tilintarkastajan n&auml;ht&auml;v&auml;ksi olen liitt&auml;nyt t&auml;m&auml;n lausunnon oheen mainittujen tilinp&auml;&auml;t&ouml;st&auml; vaille valmiiden tilikausien p&auml;iv&auml;kirjat ja tilikartat, mik&auml;li tilintarkastaja haluaa niit&auml; ep&auml;virallisesti kommentoida. Koska tilinp&auml;&auml;t&ouml;kset puuttuvat, ei kyseisi&auml; tilikausia anneta viel&auml; tarkastettavaksi. Huomattakoon my&ouml;s, ett&auml; kyseisten tilikausien tarkastajaksi on aikanaan valittu nykyisest&auml; tilintarkastajasta poikkeava henkil&ouml;. Ilmeisesti lienee kuitenkin mahdollista aikanaan tarkastuttaa n&auml;m&auml; tilikaudet nykyisell&auml; tilintarkastajalla.</p>
						<p>Pit&auml;isin eritt&auml;in toivottavana, ett&auml; nykyinen tilintarkastajamme pystyisi jatkamaan teht&auml;v&auml;ss&auml;&auml;n ainakin seuraavan tilikauden ja hoitamaan my&ouml;s r&auml;stiin j&auml;&auml;neiden tilikausien tarkastamisen, niiden valmistuessa. N&auml;in yhdistys p&auml;&auml;sisi aloittamaan vuoden 2001 kokouksesta l&auml;htien aikataulunmukaisen kirjanpidon. Ehdotukseni on tietysti hallituksen, tilintarkastajien ja vuosikokouksen viel&auml; hyv&auml;ksytt&auml;v&auml;.</p>
						<p>Yhdistyksen puolesta pahoittelen retuper&auml;ll&auml; ollutta kirjanpitoa ja toivon, ett&auml; t&auml;m&auml; henkil&ouml;kohtainen panostukseni sek&auml; uuden hallituksen mukanaan tuoma lis&auml;energia ja osaaminen auttavat viimein nostamaan kirjanpitomme vaaditulle tasolle.</p>
						<p>Espoossa 7. syyskuuta 2000,</p>
						<p>Janne Sir&eacute;n</p>
						<p><font size="2"><b><a name="liite4"></a>Liite 4 - Vuosikertomus 1999-2000</b></font></p>
						<p>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n vuosikertomus 1999-2000</p>
						<p>Menestyksek&auml;s Saku 99 -tapahtuma pidettiin hallituksen 1998-1999 j&auml;rjest&auml;m&auml;n&auml; tiedekeskus Heurekassa 4. syyskuuta 1999. Tilaisuudessa julkistettiin Saku-CD-ROM-levyn toinen painos. Tapahtumasta kirjoitti Saku-lehden ohella my&ouml;s saksalainen AmigaOS-lehti joulukuun numerossaan, jossa julkaistiin aukeaman kokoinen juttu kuvineen kaikkineen.</p>
						<p>Vuosikokouksen 1999 p&auml;&auml;t&ouml;ksen mukaisesti kauden 1999-2000 uusi hallitus aloitti toimintansa vasta Saku 99 -tapahtuman j&auml;lkeen, 20. syyskuuta 1999. Edellisen hallituksen varapuheenjohtaja Janne Sir&eacute;n antoi uusille hallitusj&auml;senille konsultointiapua sek&auml; opastusta teht&auml;vien hoitoon.</p>
						<p>Saku-lehden julkaisurytmi pystyttiin pit&auml;m&auml;&auml;n suunnitellun mukaisena. Lehden HTML-painoksen t&auml;ysin uusittu rakenne ja ulkon&auml;k&ouml; antoivat lehdelle entist&auml; ammattitasoisemman ilmeen ja ker&auml;siv&auml;t runsain mitoin kehuja lukijoilta. Lehden AmigaGuide-version julkaisusta luovuttiin numeron 30 ilmestymisen j&auml;lkeen. Levykelehden julkaisua ja kotiinkantoa jatkettiin normaalisti.</p>
						<p>Joulukuussa j&auml;rjestetyt pikkujoulut 1999 kokosivat pienen mutta tyytyv&auml;isen joukon j&auml;seni&auml; juhlistamaan vanhan vuosituhannen viimeist&auml; joulunaikaa.</p>
						<p>Yhdistyksen kotisivut Internetiss&auml; jatkoivat toimintaansa yhdistyksen julkisivuna ja Saku-lehden p&auml;&auml;asiallisena levityskanavana. Amiga my&ouml;nsi yhdistykselle oikeuden Amiga Recognized User Organization -merkin k&auml;ytt&ouml;&ouml;n kotisivuilla.</p>
						<p>Suomen Nuorkauppakamarien j&auml;sen- ja sidosryhm&auml;lehti Meriitti kirjoitti numerossa 2/2000 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n toiminnasta (Saku-tapahtumat, Saku-lehti) ja lyhyesti Amigan historiasta ja tulevaisuuden suunnitelmista. Meriitin painos on 6000 kpl, ja kyseisen numeron teemana oli yhteisty&ouml;.</p>
						<p>Kev&auml;&auml;ll&auml; j&auml;rjestettiin Saku-CD-ROM-levyn 2. painoksen j&auml;ljell&auml; olevan er&auml;n myynti postitse.</p>
						<p>Aloitettiin yhdistyksen kirjanpitoj&auml;rjestelm&auml;n uusiminen ja yhten&auml;ist&auml;minen yhdistyksen koko historian ajalta. Uuden mallin mukainen j&auml;rjestelm&auml; mahdollistaa seuraavien kausien tilinp&auml;&auml;t&ouml;sten valmistumisen aikataulussa.</p>
						<p>J&auml;sentavoitetta ei saavutettu, sill&auml; j&auml;senm&auml;&auml;r&auml; j&auml;i alle sadan.</p>
						<p>Yhdistyksen varallisuus j&auml;i alentuneiden j&auml;senmaksutulojen takia aiempia vuosia merkitt&auml;v&auml;sti heikommaksi, joten uuden Saku-tapahtuman j&auml;rjest&auml;minen p&auml;&auml;tettiin siirt&auml;&auml; seuraavaan vuoteen. Tapahtuman alustavat j&auml;rjestelyt aloitettiin kuitenkin jo kev&auml;&auml;ll&auml;.</p>
						<p>Vuosikokous 2000 j&auml;rjestettiin syyskuussa.</p>
						<p><font size="2"><b><a name="liite5"></a>Liite 5 - Toimintasuunnitelma 2000-2001</b></font></p>
						<p>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n toimintasuunnitelma vuodelle 2000-2001</p>
						<p>Yhdistys jatkaa toimintaansa perusajatuksenaan tukea suomalaisia Amiga-k&auml;ytt&auml;ji&auml; ja edist&auml;&auml; Amiga-tietouden tuntemusta. Ensisijaisena tavoitteena n&auml;ilt&auml; osin on seuraavan sukupolven Amiga-teknologian tuntemuksen ja n&auml;kyvyyden lis&auml;&auml;minen sek&auml; j&auml;senten keskuudessa yhdistyksen omia tiedotuskanavia k&auml;ytt&auml;en, ett&auml; mahdollisuuksien salliessa my&ouml;s muiden julkisten medioiden avulla suuremmallekin yleis&ouml;lle.</p>
						<p>Yhdistys pyrkii seuraamaan uudistuvien Amiga-markkinoiden tilanteen kehittymist&auml; ja etsim&auml;&auml;n tilaisuuksia tuoda j&auml;senten n&auml;ht&auml;ville tuoreimpia saatavissa olevia ohjelmisto- ja laiteratkaisuja. Tavoitteen saavuttamiseksi jatketaan suorien yhteyksien yll&auml;pitoa ulkomaille ja Amiga-yhti&ouml;&ouml;n.</p>
						<p>Classic Amigan markkinaosuuden pienuuden ja tukipalveluiden heikon saatavuuden takia on entist&auml; t&auml;rke&auml;mp&auml;&auml;, ett&auml; yhdistys jatkaa totuttuun tapaan aktiivista toimintaansa my&ouml;s Classic-laitekannan k&auml;ytt&auml;jien keskin&auml;isen yhteydenpidon ja avunannon kanavana.</p>
						<p>Yhdistyksen perustoimintojen yll&auml;pitoa jatketaan, yhdistystoiminnan lakis&auml;&auml;teisi&auml; velvoitteita noudattaen. Aiempien tilikausien tekeill&auml; olevien, kirjanpitouudistuksen mukaisesti laadittujen tilinp&auml;&auml;t&ouml;sten valmistuttua j&auml;rjestet&auml;&auml;n ylim&auml;&auml;r&auml;inen yhdistyskokous, jossa my&ouml;nnet&auml;&auml;n vastuuvapaus aiemmille hallituksille.</p>
						<p>S&auml;&auml;nt&ouml;m&auml;&auml;r&auml;inen vuosikokous j&auml;rjestet&auml;&auml;n elo-syyskuussa 2001. Vuosikokouksesta 2001 l&auml;htien tilinp&auml;&auml;t&ouml;sten valmistuminen ja tarkastaminen tapahtuu aikataulun mukaisesti kokoukseen menness&auml;.</p>
						<p>Saku-lehden julkaisua jatketaan. Vuoden 2001 alusta l&auml;htien lehden HTML-painos on ainoa julkaisumuoto. Lehti on entiseen tapaan luettavissa yhdistyksen kotisivuilla sek&auml; saatavissa my&ouml;s pakattuna versiona offline-tilassa lukemista varten. Lehti ilmestyy nelj&auml;nnesvuosittain toimituksen erikseen m&auml;&auml;r&auml;&auml;min&auml; julkaisup&auml;ivin&auml;.</p>
						<p>Edellisen kauden hallitus jatkaa aktiivisten j&auml;sentens&auml; osalta l&auml;hes samanlaisena, mutta teht&auml;v&auml;jaon suhteen hieman uusitussa kokoonpanossa. Hallitus julkaisee kokouksistaan ja keskusteluistaan sek&auml; yhdistyksen kokouksista muistioita ja p&ouml;yt&auml;kirjoja kotisivuilla ja Saku-lehdess&auml;.</p>
						<p>Yhdistys j&auml;rjest&auml;&auml; uuden Saku-tapahtuman vuoden 2001 aikana. Lis&auml;ksi pienimuotoisten k&auml;ytt&auml;j&auml;tapaamisten j&auml;rjest&auml;mist&auml; pyrit&auml;&auml;n laajentamaan mahdollisuuksien rajoissa my&ouml;s p&auml;&auml;kaupunkiseudun ulkopuolelle.</p>
						<p><font size="2"><b><a name="liite6"></a>Liite 6 - Yhdistyksen hallitus 2000-2001</b></font></p>
						<p>Varsinaiset j&auml;senet:</p>
						<p>Anu Seilonen, puheenjohtaja<br>
						Terho Henriksson, varapuheenjohtaja<br>
						Jarmo Piippo, sihteeri<br>
						Timo Kemppaala<br>
						Tomi Jaskari</p>
						<p>Varaj&auml;senet:</p>
						<p>Valtteri Murto<br>
						Ville Sarell<br>
						Paula-Christiina Wirtanen</p>
						<p><font size="2"><b><a name="liite7"></a>Liite 7 - Tapahtumavastaavan lausunto</b></font></p>
						<p>Tapahtumavastaavan lausunto</p>
						<p>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:lle tulevaisuus on ty&ouml;nt&auml;yteist&auml; ja haasteellista aikaa. Uusi Amiga-teknologia tekee tuloaan tietokonemarkkinoille ja my&ouml;s Saku-tapahtuman suunnittelu on jatkuvasti k&auml;ynniss&auml;.</p>
						<p>Haluamme olla valmiita, kun uuden sukupolven Amiga-laitteita on saatavilla. Seuraavan Saku-tapahtuman yhten&auml; tavoitteena on uuden Amiga-teknologian esittely yleis&ouml;lle. T&auml;m&auml;n p&auml;&auml;m&auml;&auml;r&auml;n saavuttamiseen tarvitaan yhteisty&ouml;n ja kommunikoinnin lis&auml;&auml;mist&auml; Amigan kanssa ja my&ouml;s yhteyksien luomista ohjelmistovalmistajiin.</p>
						<p>N&auml;kyminen mediassa on my&ouml;s t&auml;rke&auml; osa-alue toimintaamme ja t&auml;h&auml;n pyrit&auml;&auml;n panostamaan Saku-tapahtuman yhteydess&auml; yh&auml; enemm&auml;n. Onnistunut mediatiedotus takaa yhdistykselle runsaasti positiivista julkisuutta.</p>
						<p>Saku-tapahtuma on laaja projekti ja tavoitteemme ovat korkealla. Jos tunnet, ett&auml; voisit olla mukana seuraavan Saku-tapahtuman j&auml;rjestelyiss&auml;, ota yhteytt&auml; tapahtumavastaavaan s&auml;hk&ouml;postitse: <a href="mailto:terho.henriksson@kopteri.net">terho.henriksson@kopteri.net</a></p>
						<p>Tapahtumaterveisin,</p>
						<p>Terho Henriksson<br>
						Tapahtumavastaava<br>
						Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</p>
						<p>Muistion kokosi ja kirjoitti Jarmo Piippo. Oikoluvusta kiitos Anu Seiloselle.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../ajankohtaiset/hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
