<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n vuosikokous 2000</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;<br>
						Kuvat:&nbsp;Anu&nbsp;Seilonen</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. kokoontui vuotuiseen, s&auml;&auml;nt&ouml;m&auml;&auml;r&auml;iseen vuosikokoukseensa lauantaina 30. syyskuuta. Totuttuun tapaan kokouksen yhteyteen oli j&auml;rjestetty my&ouml;s muuta ohjelmaa, ja iltap&auml;iv&auml;st&auml; kehkeytyikin mukava reilun parinkymmenen amigistin tapaaminen Espoon keskuksen kupeessa. Virallisen osuuden lis&auml;ksi n&auml;ytill&auml; oli Amigan uusi Software Development Kit sek&auml; joukko Amiga-lehti&auml;. My&ouml;s Amiga-j&auml;lleenmyyj&auml; Gentle Eye Ky tuotteineen oli rahdattu paikalle ja limsatarjoilu kruunasi rennon tunnelman.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Uuden hallituksen ensimm&auml;inen</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Yhdistyksen hallitus koki vuosi sitten melko suuria muutoksia, jos ei nimellisesti, niin ainakin k&auml;yt&auml;nn&ouml;ss&auml;. Vaikka moni vanha nimi j&auml;ikin hallitukseen, siirtyi vastuu selv&auml;sti uusille yritt&auml;jille. T&auml;m&auml;nvuotinen vuosikokous olikin ensimm&auml;inen tapahtumanpoikainen uudelle hallitukselle, ja omat haasteensa j&auml;rjestelyihin toi aktiivij&auml;senten maantieteellinen sijainti. Etel&auml;ss&auml; autettiin mink&auml; ehdittiin, mutta varsinaisen uroty&ouml;n tekiv&auml;t Anu Seilonen ja Jarmo Piippo tukijoukkoineen ajamalla paikalle Oulusta saakka yhdistyksen uutta, uljaampaa tulevaisuutta petaamaan. He my&ouml;s poimivat matkan varrelta mukaan Gentle Eye Ky:n.
						<center>
							<p><img height="192" width="256" src="kuvat/pieni_vuosi2000_24.jpg" border="0" alt=" "></p>
						</center>
						<p>Virallinen kokous sujuikin erinomaisesti, ja pieneen taloyhti&ouml;n kerhotilaan ahtautui enn&auml;tysm&auml;&auml;r&auml; v&auml;ke&auml;. Itse kokoukseen osallistui per&auml;ti 22 henkil&ouml;&auml;, mik&auml; ylitt&auml;&auml; vuoden 1998 kokousosanoton yhdell&auml; ja peittoaa muut kokousosanotot Saku 97:n yhteydess&auml; j&auml;rjestetty&auml; kokousta lukuunottamatta. Paljon t&auml;rkeit&auml; asioita p&auml;&auml;tettiin, kuten sovittiin joustavuutta lis&auml;&auml;vist&auml; s&auml;&auml;nt&ouml;muutoksista, valittiin uusi hallitus, jossa menneisyyden painolastia karsittiin entisest&auml;&auml;n, ja nimettiin pitk&auml;aikainen Saku-lehden p&auml;&auml;toimittaja Anu Seilonen uudeksi puheenjohtajaksi. Samalla p&auml;&auml;ttyi Tomi Jaskarin yhdistyksen alusta saakka jatkunut puheenjohtajuus, Tomi jatkaa kuitenkin hallituksen rivij&auml;senen&auml;. Tomille kiitos pitk&auml;st&auml; urakasta!</p>
						<p>Kokouksessa luettiin my&ouml;s vuosikertomus, tapahtumavastaavan lausunto sek&auml; kirjanpit&auml;j&auml;n tilannekatsaus tileihimme, joiden kirjanpitotilanteen korjaus on jo edennyt merkitt&auml;v&auml;sti ensimm&auml;isten kahden tilikauden osalta. Tavoitteena on viimein saavuttaa s&auml;&auml;nt&ouml;jen mukainen kirjanpitorytmi vuoden 2001 vuosikokoukseen menness&auml;. Tapahtumavastaava Terho Henriksson, joka ei valitettavasti p&auml;&auml;ssyt paikalle, puolestaan kertoi lausunnossaan suunnitelmista Saku 2001 -tapahtumalle ja rohkaisi kaikkia avustamisesta kiinnostuneita ottamaan h&auml;neen yhteytt&auml;. P&auml;&auml;tettiin my&ouml;s, hieman haikein mielin, j&auml;tt&auml;&auml; levyke-Saku viimeinkin historiaan kotiinkannon kera ja keskitty&auml; tekem&auml;&auml;n entist&auml; laadukkaampaa HTML-lehte&auml;.</p>
						<p>Yhdistyksen taloudellinen tilanne aiheutti jonkin verran keskustelua, sill&auml; sadan henkil&ouml;n j&auml;sentavoitteesta oli j&auml;&auml;ty noin kahdellakymmenell&auml;, ja Saku 99 oli muutenkin verottanut yhdistyksen tili&auml; rajusti. Taloudellisia ongelmia yhdistyksell&auml; ei sin&auml;ns&auml; ole, mutta Saku 2000:n j&auml;rjest&auml;miseen eiv&auml;t rahat olisi kunnolla riitt&auml;neet. Saku 2000 tosin j&auml;i v&auml;liin my&ouml;s muista syist&auml;, joita yhdistyksen loppukes&auml;n tiedotteissa syv&auml;luodattiin. Kaiken lis&auml;ksi pankki veloittaa jatkuvasti suuria palvelumaksuja. Ratkaisuksi nostettiin pitk&auml;&auml;n alhaisena pysynytt&auml; j&auml;senmaksua 50 markasta 70 markkaan (tai 11 euroon) ja p&auml;&auml;tettiin siirt&auml;&auml; yhdistyksen tili edullisempaan kokonaisratkaisuun, jonka uusi hallitus selvitt&auml;&auml;. Vaihtoehtoja ovat mm. pankin ja tilink&auml;ytt&ouml;palveluiden vaihtaminen.</p>
						<p>Vuosikokouksesta oli GSM-puhelimen v&auml;lityksell&auml; yhteys Internetiin. Puhelinyhteyden sponsoroi Janne Sir&eacute;n, joten yhdistyksen rajallisia rahavaroja ei GSM-laskuihin poltettu. Kokoustunnelmaa v&auml;litettiin reaaliaikaisesti web-kameran ja IRC-yhteyden voimin my&ouml;s niille, jotka eiv&auml;t paikalle p&auml;&auml;sseet. Tarkemmin ja virallisemmin voitte lukea kokouksen p&auml;&auml;t&ouml;ksist&auml; p&ouml;yt&auml;kirjasta, joka l&ouml;ytyy toisaalta lehdest&auml;.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Kokouksen sulattelua SDK:n &auml;&auml;ress&auml;</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Virallisen osuuden j&auml;lkeen kokousvieraat p&auml;&auml;siv&auml;t kokeilemaan seuraavan sukupolven Amigan ohjelmistokehitysymp&auml;rist&ouml;&auml;, Software Development Kiti&auml;, jota demonstroitiin Linux-PC:ll&auml;. Koneelle oli SDK:n lis&auml;ksi asennettu useita uudelle Amiga-ymp&auml;rist&ouml;lle kyh&auml;iltyj&auml; ohjelmia aina Quakesta Juggleriin ja monenlaisiin pikkudemoihin. My&ouml;s Amiga SDK:n paketti tuhteine ohjekirjoineen oli hypistelt&auml;v&auml;n&auml;, ja kokousvieraat saivat mukaansa SDK:sta kertovan esitteen. Luettavana oli lis&auml;ksi runsaasti Amigan julkaisemaa pressimateriaalia ja Amiga World -tiedotelehden numerot. Monelle selvisiv&auml;tkin ensi kertaa uuden Amigan taustalla piilev&auml;t konseptit, ja aiheesta virisi runsaasti keskustelua.
						<p>Amiga SDK:ta tehd&auml;&auml;n tarkemmin tutuksi <a href="../testit/sdk.html" target="_self">t&auml;m&auml;n lehden testiss&auml;</a>. Lis&auml;ksi voitte tutustua useisiin kokouksessakin n&auml;htyihin ohjelmiin Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n kotisivuilla, jossa julkaistaan loppuvuoden ajan viikon namupaloina pieni&auml; ohjelmaesittelyit&auml;. Joka viikko sivuilla esitell&auml;&auml;n yksi SDK:lla kehitetty ohjelma tai peli. Osoite on vanha tuttu: <a href="http://batman.jytol.fi/~saku/" target="_blank">http://batman.jytol.fi/~saku/</a> tai <a href="http://tzimmola.tky.hut.fi/saku/" target="_blank">http://tzimmola.tky.hut.fi/saku/</a>.</p>
						<p>Esill&auml; olivat my&ouml;s viralliset, lisensoidut <a href="../sekalaiset/kannykkakuoret.html" target="_self">Amiga-k&auml;nnykk&auml;kuoret</a> Nokia 3210:lle, pino yhdistyksest&auml;mme kertovan artikkelin sis&auml;lt&auml;nytt&auml; Meriitti-lehte&auml;, saksalainen AmigaOS-lehti, jossa oli juttu Saku 99 -tapahtumasta, sek&auml; l&auml;hes kaikki uuden englantilaisen AmigActive-lehden numerot. Luonnollisesti Gentle Eye Ky:n myyntip&ouml;yt&auml;kin ker&auml;si kiinnostuneita katseita. Kaupan oli t&auml;ll&auml; kertaa mm. uusi Hyperion Softwaren Amiga-porttaus Quake 2 -engineen pohjautuvasta Heretic II -pelist&auml;.</p>
						<center>
							<p><img height="192" width="256" src="kuvat/pieni_vuosi2000_05.jpg" border="0" alt=" "></p>
						</center>
						<p>Kokouksessa saattoi maksaa my&ouml;s yhdistyksen seuraavan vuoden j&auml;senmaksun, ja olipa Saku-rompun kakkospainostakin edelleen kaupan.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Loppuhuipennus pizzeriassa</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Amiga-aiheisen ajanvieton lis&auml;ksi osa porukasta suuntasi vaihtamaan kuulumisia l&auml;heiseen pizzeriaan. Maukkaan ja edullisen italialaisen &auml;&auml;ress&auml; olikin j&auml;lleen kerran mukava todeta, ett&auml; teknologia on kivaa, mutta ihmiset ne loppujen lopuksi ovat yhdistystoiminnan paras puoli. Kiitos kaikille osallistuneille!
						<p>Kokousj&auml;rjestelyist&auml; erityinen kiitos seuraaville henkil&ouml;ille (aakkosj&auml;rjestyksess&auml;): Terho Henriksson, Tomi Jaskari, Marko Lustim&auml;ki, Jarmo Piippo, Janne Pikkarainen, Anu Seilonen ja Janne Sir&eacute;n.</p>
						<p><a href="vuosikokousmuistio.html" target="_self">Kokousmuistio</a> l&ouml;ytyy toisaalta t&auml;st&auml; lehdest&auml;. Tutustu my&ouml;s yhdistyksen kotisivulla olevaan <a href="http://batman.jytol.fi/~saku/yhdistys/tapahtumat/vuosi2000/kuvat/index_1.html" target="_blank">vuosikokouksen valokuvaraporttiin</a>!</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
