<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0F - Maestro Paula</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0118.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
					<A HREF="../english/0x0118.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__english.gif" ALT="[ english ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0117.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0119.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=148 HEIGHT=25 SRC="../images/_hardware_.gif" ALT="[Hardware]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0118.html">Maestro Paula</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0114.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0115.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0116.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0117.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0118.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0119.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x011F.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x0121.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0122.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0123.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0124.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Maestro Paula - Die alte Dame und der Meister</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Alt, aber gut? Oder alt und verstaubt? Rieseln die
alten Knochen oder kann sich die alte Dame immer noch gegen den
gro&szlig;en Maestro behaupten?</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Nun, es ist wohl an sich unfair, eine Paula, der bei sch&ouml;nen
Kl&auml;ngen das Herz h&ouml;her schl&auml;gt, mit einem MaestroPro zu
vergleichen, der zwinkernd im hellen Schein seiner Rotlichtbeleuchtung
sitzt.<BR>

<BR>Was hat es an sich, da&szlig; viele immer noch den guten, alten,
mitunter ein wenig verraucht, um nicht zu sagen: verrucht, klingenden Klang
einer Paula, dem des Maestros vorzuziehen, der nun von sich beansprucht,
mit seinen optischen (TOSLINK, bitte nicht mit DOSlink zu vergleichen, auch
wenn einen so manch H&auml;ndler Gegenteiliges einreden m&ouml;chte...)
Schnittstellen CD-Qualit&auml;t liefern zu k&ouml;nnen?<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Kontaktaufnahme</B></H3>&nbsp;

<BR>Was die Paula mit der kritischen Au&szlig;enwelt verbindet, sind ein
wenig Elektronik und zwei lapidare Cinch-Buchsen, an die ein guter
Verst&auml;rker angeschlossen werden will. Spricht man von Qualit&auml;t,
so mu&szlig; man aufgrund sp&auml;t-Commodoresker Bauteilwahl diese Buchsen
wohl als Verschlei&szlig;material z&auml;hlen, mittlerweile sollten wohl
bei fast jedem alten Amiga diese Buchsen zerfallen sein...<BR>

<BR>Auch die ehemals als verwechslungssicher(!!) gepriesenen
unf&ouml;rmigen Stecker zeichnen sich nicht gerade durch
Professionalit&auml;t aus, aber vielleicht gerade deshalb kommt dieser
unverwechselbare Sound zustande, der nun bei meinem Test-4000er mit gerade
neu eingel&ouml;teten Buchsen irgendwie, hmmm, reiner zu klingen scheint.
Aber wer wei&szlig; schon, was seine Freundin gerade so vorhat, vielleicht
will sie auch ihre alte, liebgewonnene Hardware wieder zur&uuml;ck.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Der MaestroPro dagegen mutet mit seinen simplen rechteckigen Buchsen,
die zu den den CD-, LD-, MD- und sonstigen-D-Playern mitgelieferten
Optokabeln passen, richtig futuristisch an. Sie sind aber an sich auch
empfindlicher, denn ein wenig Staub in ungesch&uuml;tzte Buchsen und nichts
geht mehr. Ein kr&auml;ftiger, nicht zu feuchter Puster hilft da aber wahre
Wunder.<BR>

<BR>Als Zorro-II-Karte f&uuml;hlt sich der Maestro naturgem&auml;&szlig;
schon etwas weniger in einem Amiga zu Hause, als die gute Dame von vorhin.
Nichtsdestotrotz ist nat&uuml;rlich sein Platz wie f&uuml;r ihn geschaffen
und nur die Wahl des Orchesters, sprich, des Amigas, steht dem geneigten
Leser noch offen, oder zur Qual.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Probeaufnahmen</B></H3>&nbsp;

<BR>Die Paula anzusprechen ist nicht sonderlich aufwendig: im Aminet finden
sich gen&uuml;gend AudioPlayer, und die k&ouml;nnen mit der r&uuml;stigen
Dame gef&uuml;hlvoll umgehen, bzw. bedienen sich dieser neumodischen
Dienstleistung, namens AHI, die nat&uuml;rlich auch was kostet, das nennt
sich dann Prozessorleistung. Und um was h&ouml;ren zu k&ouml;nnen, ist es
wohl ratsam, externe Krach-Geber anzuschlie&szlig;en. In dieser Ausgabe
findet sich sicher der eine oder andere Tip dazu :-)<BR>

<BR>Der Maestro zeigt da schon mehr Star-All&uuml;ren, denn an diese
komischen viereckigen Dinger will partout kein herk&ouml;mmlicher
Audio-Stecker passen. Wie auch? Was dort rauskommt f&uuml;hrt
allerh&ouml;chstens zu einem Weh im Ohr. Diese seine digitalen Daten auf
Leuchtsrtahlen will der Maestro nat&uuml;rlich ganz besonders behandelt
wissen, bzw. sie eigens aufbereitet bekommen.<BR>

<BR>Um Daten dem Herrn anpreisen zu k&ouml;nnen, kommen sie wohl im
einfachsten Falle direkt von der CD, ein AD-Wandler im MiniDisc- oder
DAT-Deck geht aber nat&uuml;rlich auch. Umgekehrt herum gibt es nur sehr
vereinzelt CD-Player, die digitale Daten annehmen und dann analog ausgeben
k&ouml;nnen (was aber sicher einmal ein interessantes Umbauprojekt
w&auml;re, bei der F&uuml;lle an D/A-Wandlern durch die in fast jedem
Zimmer stehenden CD-Player), bei anderen Decks ist das nicht der Fall, auch
gibt es eigene HighEnd-DA-Wandler, die die Eigenarten des werten Herren
auch dem Fu&szlig;volk verst&auml;ndlich machen, ein Laut-Sprecher
sozusagen...<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Unsere nette Freundin von nebenan gibt aber vor, nichts &uuml;ber den
sonorigen Herrn zu wissen, der des &ouml;fteren zu ihr auf Besuch kommt,
also bedienen wir uns wieder der schon bekannten Dienstleistung, die wieder
gutes Geld kostet. &Auml;h, Klartext: Der MaestroPro im Amiga meldet sich
klarerweise per AutoConfig an, tut dann aber nichts mehr, au&szlig;er das
AudioSignal von einer Buchse zur anderen durchzuschleifen.<BR>

<BR>Richtig aufgeheizt wird er erst durch Programme, die sich ihm per
Dolmetscher verst&auml;ndlich machen, AHI, bzw. Maestix.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Einbindung ins Ensemble</B></H3>&nbsp;

<BR>AHI, als hardwareunabh&auml;ngiges AudioSubSystem gedacht, mittlerweile
wohl genauso bekannt und verbreitet wie Picasso96 oder CyberGrafX, nun geht
mit dem Maestro genauso um, wie mit der Paula, auf beiden kann Laut gegeben
werden. Tondaten in den Amiga samplen geht aber nat&uuml;rlich nur per
MaestroPro, der nicht mit seinem AmateurNamensvettern namens Maestro
verwechselt werden will, aber beide sind leider l&auml;ngst nicht mehr im
Gesch&auml;ft...<BR>

<BR>Ein Samplen mit 44.1kHz ist damit ohne weiteres m&ouml;glich, auch wenn
es kein guter alter 2000er sein darf, der das Grundsystem bildet. Aufgrund
von Design-Schw&auml;chen bei der Interruptbehandlung dauert es in so einem
Amiga, besonders wenn, wie es sich geh&ouml;rt, alle Slots belegt sind, zu
lange, bis die Anforderung vom MaestroPro beantwortet wird und binnen
k&uuml;rzester Zeit ist der (viel zu klein bemessene) interne
Zwischenspeicher der Maestro &uuml;bergelaufen und sie braucht erst wieder
einen Reset, um weiterarbeiten zu wollen.<BR>

<BR>In anderen Amigas (wie auch solchen, denen man Zorro erst beibringen
mu&szlig;), ist es aber absolut kein Problem f&uuml;r den Herrn, mit seinen
F&auml;higkeiten zu gl&auml;nzen, die unter anderem nicht von der Karte
selber, sondern eher vom Eingangssignal abh&auml;ngen, denn ob nun in
32kHz, 44.1kHz oder 48kHz gesampelt werden soll, entscheidet allein das die
Daten ausgebende Ger&auml;t, genauso kann aber auch ein MaestroPro seine
Daten in diesen drei Raten liefern.<BR>

<BR>Unterst&uuml;tzt ein Programm AHI, so kann es auch die MaestroPro
ansprechen, wenn nicht, kann man sich das imemr noch selber programmieren,
denn im Aminet gibt es ein feines Packerl namens Maestix, mittlerweile in
Version 41.30, das eine Library bereitstellt, mit der man den guten Maestro
ganz selbst f&uuml;r sich allein unter seine Fittiche nehmen und zu
H&ouml;chstleistungen anspornen kann. Ein paar Demoanwendungen sind
kompiliert als auch im Source dabei, soda&szlig; gleich ersichtlich ist,
wie damit programmiert werden kann.<BR>

<BR>Damit ist nat&uuml;rlich feines AudioDatenSchaufeln m&ouml;glich, es
hat in diesem Sinne aber nichts amigatypisches mehr im Klang, denn das
Equipment mit einer einigermassen schnellen Platte und (wichtiger) einem
ordentlich dicken Prozessor (unter einem 30er geht einmal gar nix mit AHI)
verleitet schon dazu, sich ganze Tracks einfach mal so reinzusamplen, auch
wenn sie mal 50MB verschnupfen. Aber was ist das heutzutage schon noch?<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die Paula dagegen kommt ja auch schon mit 512KB und &quot;ohne&quot;
Prozessor aus, denn wie sonst g&auml;be es das typische &quot;Boing&quot;
im Boing-Ball-Demo? Als nativer Chip im Amiga hat r&uuml;stige Dame
nat&uuml;rlich ein ihr nicht abstreitbares Vorrecht, was Krachmachen
betrifft. Das kann sie auch gut, denn auch wenn die Dynamik wohl etwas zu
w&uuml;nschen &uuml;berl&auml;&szlig;t und 14bit nicht state-of-the-art
sind, so ist sie doch f&uuml;r ihre mittlerweile ca. 15 Jahre (hey,
n&auml;chstes Jubil&auml;um!!!) erstaunlich klar im Kopf.<BR>

<BR>Was ist es, was sie so eigens klingen l&auml;&szlig;t? Meine eigene
Vernarrtheit in unser aller liebste Freundin, oder h&ouml;rt man im
Blindtest auch einen Unterschied? No-na, denn wozu kann man denn seine
PowerLED dimmen, &auml;h, den AudioFilter zu- und abschalten?<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>konzertant</B></H3>&nbsp;

<BR>F&uuml;r mich ist auch eine Paula als AusgabeDevice nach wie vor noch
gut genug, und mit einem wenig Nachhelfen in der Ausgangsverst&auml;rkung
kann sie sich auch pegelm&auml;ssig mit den anderen viel, viel neueren
Ger&auml;ten in der Audiokette messen.<BR>

<BR>Ein MaestroPro wird von sich aus selber nie wirklich Laut geben
k&ouml;nnen, er wird immer auf andere angewiesen sein, aber daf&uuml;r hat
er auch den Anspruch an Qualit&auml;t gestellt.<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>La&szlig;t mir also beides und ich werde gl&uuml;cklich sein, denn, um
wieder klischeehaft zu werden: welcher PC-ler kann schon mehrere
AudioKarten in seinem Rechner gleichzeitig betreiben. Mit mehreren Maestros
ist es doch m&ouml;glich, auch live aus mehreren digitalen (und mit anderen
Audiokarten nat&uuml;rlich auch analogen) Quellen auf rein digitaler Basis
zu mischen und &uuml;berzublenden. Die Software dazu ist nat&uuml;rlich,
als &uuml;bliches &Uuml;bel, nicht wirklich vorhanden, aber mit Maestix
w&auml;re auch sie kein gr&ouml;beres Problem. So sind die beiden
ungleichen Herrschaften durchaus vergleichbar, denn in so einem Gemisch
k&ouml;nnte die Paula auch brav ihre Rolle spielen.<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0118.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>
					<A HREF="as-redax.html#stevebow"><I>Steve Bowman</I></A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../english/0x0118.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__english.gif" ALT="[ english ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Aminet:<A HREF="http://ftp.uni-paderborn.de/pub/aminet/mus/misc/ahiusr.lha">mus/misc/ahiusr.lha</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Aminet:<A HREF="http://ftp.uni-paderborn.de/pub/aminet/util/libs/Maestix.lha">util/libs/Maestix.lha</A><BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0117.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0119.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
