<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0F - PacMan'96</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0121.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
					<A HREF="../english/0x0121.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__english.gif" ALT="[ english ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0120.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0122.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=79 HEIGHT=25 SRC="../images/_spiele_.gif" ALT="[Spiele]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0121.html">PacMan'96</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0114.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0115.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0116.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0117.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0118.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0119.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x011F.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x0121.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0122.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0123.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0124.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>PacMan'96 - der gelbe Geisterj&auml;ger ist wieder da!</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Es war einmal ein kleiner Junge. Dieser Junge spazierte
mit seinem Bruder und seiner Mutter an einem See entlang. Die sommerlichen
Temperaturen h&auml;tten seinen Kopf wohl beinahe zum Gl&uuml;hen gebracht,
wenn er nicht dieses K&auml;ppchen tr&uuml;ge, welches zwar peinlich
aussah, aber immerhin seinen Zweck erf&uuml;llte. Am See herrschte reges
Leben: es wimmelte von Menschen, die teils im Wasser schwammen, teils mit
Booten fuhren; zu Lande fr&ouml;nten sie den Gen&uuml;ssen k&ouml;stlicher
Eissorten und schattiger Sitzpl&auml;tze. Und unter einem dieser
schattigen, &uuml;berdachten Orte erblickte der Junge ein Ding, welches ihn
auf Anhieb faszinierte und auch weiterhin immer wieder faszinieren sollte:
einen Spielautomat, auf welchem ein Videospiel lief, das sich <B>PacMan</B>
nannte...</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<A HREF="../images_0F/coolegrafik.gif"><IMG WIDTH=160 HEIGHT=128 ALT="[Intro Picture]" SRC="../images_0F/coolegrafiktn.gif" ALIGN=RIGHT HSPACE=15 VSPACE=15 BORDER=0></A>

<BR>Damals verstand ich nat&uuml;rlich nichts von Computern und schon gar
nicht von der Programmierung irgendwelcher Spiele, und ich besa&szlig; auch
nicht die F&auml;higkeit, die Qualit&auml;t eines solchen Spieles zu
beurteilen. Ich sah einfach nur etwas Neues und befand es auf Anhieb
f&uuml;r genial. Wie ich mich beim ersten R&uuml;tteln an einem Joystick
anstellte, daran kann ich mich gottseidank nicht mehr erinnern, aber
peinlich war es ganz bestimmt. Immerhin durchschaute ich - im Gegensatz zu
nicht n&auml;her genannten Familienangeh&ouml;rigen - einigerma&szlig;en
das Konzept hinter <I>PacMan</I>. (unsere M&uuml;tter &amp; Tanten, Jahre
danach, beim Betrachten von <I>Lemmings</I>: &quot;Da f&auml;llt ja
&uuml;berall was runter!&quot; - naja, was soll man dazu noch sagen?)<BR>

<BR>Nun stellt sich aber die Frage: wozu ein Spiel testen, das schon weit
&uuml;ber 15 Jahre auf dem Buckel hat, das jeder kennt, das total simpel
aufgebaut ist und eigentlich kaum noch irgendwen interessiert?
Nat&uuml;rlich nur, weil mich mein Bruder dazu gezwungen hat. - Nein,
Scherz beiseite: auch Klassiker haben ein Recht auf neue Versionen und die
haben ganz gewi&szlig; ein Recht auf Testberichte. Und so geschehe es nun
mit <B>PacMan&acute;96</B> ... ist zwar auch schon alt, aber immer noch
gut!<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>ungeheuer wichtig: die Anleitung ;-)</B></H3>&nbsp;

<BR><B>PacMan&acute;96</B> ist schnell aus dem <A
HREF="http://ftp.uni-paderborn.de/aminetbin/find?pacman96">Aminet</A> als
Lha-File geladen und entpackt, wobei alle Files auch auf eine DD-Diskette
passen. Ein besonderes Schmankerl dabei ist das File <B>X-Mas96</B>: ein
Doppelklick f&uuml;hrt uns zu einer lustigen Grafik von Tom, unserem
unerm&uuml;dlichen Zeichner und Verursacher von so manchem genialen
AmigaScene-Titelbild. Dazu ert&ouml;nt ein kurzes Sample, das mich sehr an
Peter Steele`s Beschreibung des kommenden <I>Type 0 Negative</I>-Albums
erinnert (&quot;die neuen St&uuml;cke werden so klingen, als w&uuml;rden
Black Sabbath betrunken 10 Minuten lang r&uuml;ckw&auml;rts spielen&quot;).
Vermutlich erkennt man, wenn man das Sample r&uuml;ckw&auml;rts
anh&ouml;rt, irgendwelche satanischen Botschaften oder einen Aufruf zu
Gewalt und Suizid; alternativ k&ouml;nnte auch eine Art &quot;Merry X-Mas
bla bla&quot; dahinterstecken. Sei`s drum: der Gag gef&auml;llt mir
allemal!<BR>

<BR>Englisch oder Deutsch stehen bei den AmigaGuide-Files f&uuml;r die
Anleitung zur Auswahl. Selbige macht deutlich, da&szlig; an
<B>PacMan&acute;96</B> vor allem Andreas Oberdorfer schuld ist, einer der
Programmierer der legend&auml;ren <B>Alcatraz</B> (von b&ouml;sen Zungen
auch gerne &quot;Alk-Matratz&quot; genannt), die das Gesamtkunstwerk
vollbracht haben, obwohl sie laut Guide aus lauter versoffenen Seppeln
bestehen, aber immerhin keine lebendigen Tiere als Geschenke annehmen
w&uuml;rden. &Uuml;berhaupt mu&szlig; an dieser Stelle gesagt werden,
da&szlig; sich niemand die ganzen eingebauten Gags entgehen lassen darf und
daher ein jeder Mensch die komplette Anleitung lesen sollte.<BR>

<BR>Der eben erw&auml;hnte Andi war schwer frustriert &uuml;ber die
Tatsache, da&szlig; sein sch&ouml;ner Amiga 4000/40 zwar eine tolle Kiste
ist, aber die Zusammenarbeit mit alten <I>PacMan</I>-Versionen
regelm&auml;&szlig;ig und begeistert verweigerte. Also versuchte er, eine
neue Version zu erschaffen, welche sich an alle sinnvollen und sinnlosen
Konfigurationen und Schn&ouml;rkel anpa&szlig;t und sich vor allem mit dem
OS gut versteht. Mittels C++ und Assembler gelang es ihm und
<I>Alcatraz</I>, das Spiel so zu programmieren, da&szlig; es wunderbar im
Multitasking l&auml;uft, jeden Screenmodus verwenden kann,
treiberunabh&auml;ngig auf allen Grafikkarten funktioniert und sogar im
Fenster auf der Workbench gespielt werden kann. Letzteres funktioniert aber
nur bei Verwendung eines 256-Farben-Screens (8-Bit), was &uuml;brigens auch
f&uuml;r die Grafikkarten-Screenmodi gilt.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Der gelbe Fri&szlig;ling und die Geister</B></H3>&nbsp;

<BR>Wunderbar an <B>PacMan&acute;96</B> ist, da&szlig; es in der Tat
problemlos im Multitasking und auf jedem Screen l&auml;uft. Da es so
systemkonform geschrieben ist, ben&ouml;tigt es unglaubliche 400 KB Chip-
und 500 KB FastRam und l&auml;&uuml;ft erst ab einem 68020er unter OS 2.0,
was heutzutage aber kaum noch ein Problem f&uuml;r die Amigianer sein
d&uuml;rfte. Nicht unwesentlich ist aber das Faktum, da&szlig; eine
schwache Rechen- und Grafikleistung das Spiel bei Verwendung von manchen
Screens zum Ruckeln und Dahinkriechen bringt. Auf meinem 68030/50 (jetzt
wissen&acute;s die Leser bald auswendig) greift eine Productivity-Workbench
sehr verlangsamend ins Spielgeschehen ein. Diese nette
&quot;Zeitlupenfunktion&quot; senkt immerhin den Schwierigkeitsgrad
erheblich, aber im Endeffekt ist es wohl sinnvoller, einen schnelleren
Screenmodus zu verwenden. Wenn <B>PacMan&acute;96</B> auf einem eigenen
Screen l&auml;uft, dann ist z.B. PAL naturgem&auml;&szlig; ein wenig
langsamer als NTSC. Voreingestellt ist DblPAL:LowRes.<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=320 HEIGHT=256 ALT="[Got Me!]" SRC="../images_0F/as-gotme.gif"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=320>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Jetzt sitzt er in der Falle.
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Die Optionen lassen sich glorreicherweise neu abspeichern: Steuerung,
Musik, Lautst&auml;rke von Musik und Spiel-FX, Taskpriorit&auml;t und
Screenmodus bzw. Verwendung von WB-Screen. In einem Editor kann man leicht
neue Levels erstellen, speichern und ganz nach Lust und Laune wieder laden.
W&auml;hrend des Spieles selbst lassen sich im Pause-Modus auch noch
Ver&auml;nderungen am Sound vornehmen. Und selbstverst&auml;ndlich gibt es
eine Top-10-Highscoreliste. Alles in allem mu&szlig; ich die gesamte
Steuerung und Bedienung als sehr einfach und komfortabel beschreiben - war
zwar prinzipiell kein gro&szlig;es Wunder, ist aber dennoch erfreulich!<BR>

<BR>Was gibts zu Grafik und Sound zu sagen? Naturgem&auml;&szlig; ist die
Grafik eines <I>PacMan</I>-Clones eher schlicht - zumindest ist es nicht
notwendig, hier mit tausend Animationen und tollen Hintergr&uuml;nden zu
protzen und damit h&ouml;chstens vom Spielgeschehen abzulenken.
Au&szlig;erdem finde ich es aus nostalgischen Gr&uuml;nden besser, dem
Original hier ein wenig die Treue zu halten und auf Schnickschnack zu
verzichten. Wenn jemand lieber was f&uuml;rs Auge hat, kann er oder sie ja
ein <I>Quake</I>-&auml;hnliches 3D-<I>PacMan</I> auf die Beine stellen, mit
sich drehenden Fraktalen an den Wandfl&auml;chen oder so. Ganz nett ist
aber, wohlgemerkt, die lustige Hintergrundgrafik des Highscore-Bildschirms.
Was den Sound betrifft, so scheint mir irgendeine audio.library zu fehlen,
was mich um den Genu&szlig; von genialen Soundtracks bringt (argl!) und das
Hauptaugenmerk auf die originalgetreuen (und damit andererseits
durchschnittlichen) FX lenkt. So wie schon beim Original geht es also auch
hier nicht um technische Spielereien oder eine ph&auml;nomenale
Pr&auml;sentation, sondern fast ausschlie&szlig;lich um die Spielidee.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>dasselbe nochmal, aber diesmal bitte mit Alkohol!</B></H3>&nbsp;

<BR>(und ich verwende diese Zeile wirklich nur deshalb, weil mir nichts
besseres einf&auml;llt, ich Depp)<BR>

<BR>Da, wie an obigem Satz deutlich zu sehen ist, meine Kreativit&auml;t
eklatante Schw&auml;chen aufzuweisen im Begriffe ist, ergo stark
nachl&auml;&szlig;t, komme ich nun zum Finale dieses Berichtes. Der
Gesamteindruck von <B>PacMan&acute;96</B> ist derjenige, da&szlig; ich es
hier mit einem sehr sauber und effizient programmierten Spiel zu tun habe,
das sich vor allem durch seine Stabilit&auml;t und Flexibilit&auml;t
auszeichnet. Es h&auml;lt sich sehr stark an die Vorlage und verwendet
keine nennenswerten neuen Features, also z.B. keinen
2-Spieler-Simultanmodus. Dadurch wirkt es auf den ersten Blick nicht weiter
besonders, sondern eher f&uuml;r heutige Standards &quot;grindig&quot;.
Jedoch bin ich der Meinung, da&szlig; es nicht nur ganz bewu&szlig;t so und
nicht anders umgesetzt wurde, sondern da&szlig; das auch ganz gut so ist.
Ein klassischer Wolfi-Vergleich, um zu verdeutlichen, auf was f&uuml;r
bescheuerte Gedanken ich st&auml;ndig komme: wenn man die <I>Mona Lisa</I>
&quot;nachzeichnen&quot; will und ihr dabei Lippenstift, farbige Linsen,
eine andere Frisur und am Ende gar ein verf&uuml;hrerisches
Dekollet&eacute; verpa&szlig;t, dann wird der <I>urspr&uuml;ngliche</I>
Reiz dahin sein. (es sei dahingestellt, ob dieser Vergleich in irgendeiner
Weise sinnvoll ist)<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=320 HEIGHT=256 ALT="[Level One]" SRC="../images_0F/pac_level1-1.gif"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=320>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Der erste Level - wer kennt ihn nicht?
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR><B>PacMan&acute;96</B> ist <I>AnyWare</I>. Das bedeutet, da&szlig; die
Programmierer nicht nur Geld, sondern auch andere kreative Geschenke
annehmen werden. &quot;Es gilt dabei: je verr&uuml;ck desto gut.&quot;
Allerdings sind, wie bereits erw&auml;hnt, lebendige Tiere davon
ausgenommen, was vor allem die Tierschutzaktivisten unter den Lesern
aufatmen lassen wird. Und wie schon gesagt ist das Game im <A
HREF="http://ftp.uni-paderborn.de/aminetbin/find?pacman96">Aminet</A> zu
finden.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Nun zum schwierigsten Teil des Abends: die Bewertungsbox!<BR>

<BR>In der Tat ist eine Bewertung eines Spieles, bei dem es ja geradezu
darauf ankommt, dem Original zu entsprechen und dabei lediglich vom
programmiertechnischen Standpunkt aus neue Wege zu beschreiten, eine
&auml;u&szlig;erst diffizile Angelegenheit. Einerseits sind z.B. die
Animationen relativ originalgetreu, andererseits aber sparsam und technisch
simpel. Das Geschickteste wird wohl sein, wenn ich mich zu einem
Kompromi&szlig; durchringen kann, der beide Seiten ber&uuml;cksichtigt.
Daher sei die Bewertung mit Vorsicht zu genie&szlig;en (genauso wie das
Spiel selbst, da f&uuml;r Folgesch&auml;den ausdr&uuml;cklich nicht die
geringste Haftung &uuml;bernommen wird). Nixdestotrotz stelle ich hiermit
eines klar: <I>PacMan</I> geh&ouml;rt prinzipiell in jeden guten Haushalt
und ist wichtiger als das Telefon. <B>PacMan&acute;96</B> sollte die erste
Wahl bei <I>PacMan</I>-Clones sein. Und unser Parlament sollte wirklich
einmal etwas sinnvolles tun und alle Menschen per Gesetz zum Besitz und
t&auml;glichen Gebrauch von <B>PacMan&acute;96</B> verpflichten. Damit der
kleine gelbe Fresser dasselbe tun kann, was Pinky und Brain jeden Abend
tun. :-)<BR>

<BR>Und um wieder auf den Boden der Realit&auml;t und Vernunft
zur&uuml;ckzukommen: <B>PacMan&acute;96</B> von <I>Alcatraz Entertainment
Software</I> ist ganz einfach sehr zu empfehlen. Get it!<BR>

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Grafik</TD>          <TD><IMG SRC="../images/_box_red.gif" WIDTH=50 HEIGHT=10 ALT="[50]"><IMG SRC="../images/_box_black.gif" WIDTH=50 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Animation</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=20 HEIGHT=10 ALT="[20]"><IMG SRC="../images/_box_black.gif" WIDTH=80 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>SFX</TD>             <TD><IMG SRC="../images/_box_red.gif" WIDTH=30 HEIGHT=10 ALT="[30]"><IMG SRC="../images/_box_black.gif" WIDTH=70 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Music</TD>           <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Gameplay</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dauerspa&szlig;</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=85 HEIGHT=10 ALT="[85]"><IMG SRC="../images/_box_black.gif" WIDTH=15 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>OS-Friendly</TD>     <TD><IMG SRC="../images/_box_red.gif" WIDTH=95 HEIGHT=10 ALT="[95]"><IMG SRC="../images/_box_black.gif" WIDTH=5 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=66 HEIGHT=10 ALT="[66]"><IMG SRC="../images/_box_black.gif" WIDTH=34 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

<BR>(Bemerkung: der &quot;Gesamt&quot;-Wert ist das arithmetische Mittel
der &uuml;brigen 7 Werte. Ich pers&ouml;nlich find das Game recht genial
und h&auml;tte von mir aus auch etwas mehr gegeben.)<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#wolfi">Wolfgang Lukas</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0121.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>
					<A HREF="as-redax.html#wolfi"><I>Wolfgang Lukas</I></A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../english/0x0121.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__english.gif" ALT="[ english ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0F/pac_as-1.gif">AmigaScene 1</A> (GIF; 6K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0F/pac_as-2.gif">AmigaScene 2</A> (GIF; 6K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0F/pac_as-done.gif">AmigaScene done</A> (GIF; 5K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0F/pac_editor-1.gif">Editor 1</A> (GIF; 5K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0F/pac_editor-as.gif">Editor AmigaScene</A> (GIF; 6K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0F/pac_hiscore.gif">HiScore</A> (GIF; 16K)<BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0F/pac_level2-1.gif">Level 2</A> (GIF; 6K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0F/pac_smile-catchmeifyoucan.gif">Smile</A> (GIF; 5K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0F/pac_title.gif">Intro Screen</A> (GIF; 3K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0F/coolegrafik.gif">Cool Graphics</A> (GIF; 14K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0F/as-gotme.gif">Got Me!</A> (GIF; 6K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0F/pac_level1-1.gif">Level One</A> (GIF; 6K)<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0120.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0122.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
