<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0F - ArtEffect 3.0</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x011C.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
					<A HREF="../english/0x011C.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__english.gif" ALT="[ english ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x011B.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x011D.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0119.html">DigiBoosterPro</A> | <A HREF="0x011A.html">SongPlayer</A> | <A HREF="0x011B.html">GroovyPlayer</A> | <A HREF="0x011C.html">ArtEffect 3.0</A> | <A HREF="0x011D.html">CyberGFX 4.0 &amp; Update 4.1</A> | <A HREF="0x011E.html">AmigaAMP 2.5</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0114.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0115.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0116.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0117.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0118.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0119.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x011F.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x0121.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0122.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0123.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0124.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>ArtEffect 3.0 - Aller guten Dinge sind drei...</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">So, das ist jetzt schon der dritte Artikel &uuml;ber
ArtEffect in der AmigaScene. Hervorgerufen durch immer wieder neue
Versionen dieses beliebten Bildbearbeitungsprogramms auf dem Amiga. Das ist
nat&uuml;rlich &uuml;beraus positiv zu bewerten, in einer Zeit, in der man
bei den Amiga Programmen immer &ouml;fter bangen mu&szlig;, ob es
&uuml;berhaupt noch eine n&auml;chste Version geben wird.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Diesmal geht es um die Version 3.0, die gegen&uuml;ber dem
Vorg&auml;nger 2.6 zwar keine revolution&auml;ren &Auml;nderungen oder
Erweiterungen erfahren hat, aber doch mit einigen brauchbaren und
n&uuml;tzlichen Neuigkeiten aufwartet und genau mit diesen wollen wir uns
in diesem Artikel n&auml;her befassen. Die Installation der vier Disketten,
auf denen das Programm ausgeliefert wird, ist diesmal problemlos
durchzuf&uuml;hren. Als Handbuch dient immer noch das der Version 1.1. Alle
zus&auml;tzlichen Funktionen werden ausschlie&szlig;lich in der
mitinstallierten AmigaGuide-Datei erkl&auml;rt. Leider gibt es noch immer
keine Online-Hilfe im Programm selbst und so verwaist die Help-Taste am
Rechner. Jedoch gibt es jetzt diese Sprechblasen, die einem kurze Hinweise
&uuml;ber die verschiedenen Werkzeuge im Werkzeugfenster beim
Dar&uuml;berfahren mit der Maus anzeigen.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Ein kleiner &Uuml;berblick &uuml;ber die Bildbearbeitung</B></H3>&nbsp;

<BR>Obwohl wir hier nicht eine ersch&ouml;pfende Einf&uuml;hrung in die
Bildbearbeitung am Amiga oder im speziellen mit ArtEffect geben k&ouml;nnen
und wollen, soll dem interessierten, aber mit Bildbearbeitungssoftware noch
nicht so vertrauten, Leser eine kurze Erl&auml;uterung dieses Themas
geboten werden.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die herk&ouml;mmlichen Pixel-Malprogramme -- das bekannteste darunter
sicherlich DPaint -- sind wohl jedem Amiga-Anwender ein Begriff. Mit
solchen Programmen werden haupts&auml;chlich Bilder gezeichnet oder gemalt.
Zur Bl&uuml;tezeit dieser Programme war auch eine Eigenschaft, die aber
haupts&auml;chlich auf die Unzul&auml;nglichkeiten der fr&uuml;her
verwendeten Hardware zur&uuml;ckzuf&uuml;hren ist, immer mit im Spiel, das
ist die recht beschr&auml;nkte Anzahl an gleichzeitig in einem Bild
verwendbarer Farben. Trotz dieses Mangels konnten und k&ouml;nnen
talentierte Grafiker aber durch geschickte Farbauswahl und -kombination mit
solchen Programmen recht erstaunliche Ergebnisse erzielen.<BR>

<BR>Sp&auml;ter, als diese Farbbeschr&auml;nkungen mit verbesserten
Grafikkarten und gr&ouml;&szlig;erer Speicherausstattung der Rechner
langsam fielen, entstanden dann Malprogramme mit denen auch sogenannte
Echtfarbbilder (TrueColor), also Bilder mit f&uuml;nfundsechzigtausend oder
16 Millionen Farben erstellt werden konnten. Im Gegensatz zu den
TrueColor-Malprogrammen nennt man die anderen palettenbasierte Programme,
weil sie mit einer sogenannten Farbpalette arbeiten, die eine Auswahl aus
den insgesamt verf&uuml;gbaren Farben darstellt.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>War aber einmal die Farbbeschr&auml;nkung aufgehoben, so ergaben sich
noch weitere Einsatzgebiete. Man war nicht mehr so sehr darauf angewiesen,
alles von Hand zu zeichnen, sondern konnte pl&ouml;tzlich recht einfach
Fotografien ohne erheblichen Qualtit&auml;tsverlust in den Rechner
&uuml;bertragen. Nat&uuml;rlich ergaben sich daraus ungeahnte
M&ouml;glichkeiten. Nat&uuml;rliche Bilder konnten nachtr&auml;glich ganz
einfach mit TrueColor-Malprogrammen ver&auml;ndert werden. Mit
Echtfarbbildern kann man jedoch noch ganz andere Operationen im Rechner
anstellen, als nur ein bi&szlig;chen darin herumzumalen. So m&ouml;chte man
z.B. bestimmte Bildteile farblich korrigieren, aufhellen, abdunkeln,
retouschieren usw. All das, was man fr&uuml;her nur in einem Fotolabor
anstellen konnte, und noch viel mehr wird heute von den
Bildbearbeitungsprogrammen geleistet. Und hiermit sind wir auch schon beim
Thema. Bildbearbeitungsprogramme sind haupts&auml;chlich auf die
Manipulation von bereits existierenden Bildern spezialisiert. Zwar kann man
mit ihnen auch weiterhin noch frei malen, aber meist werden Bilder aus
anderen Quellen wie eingescannte oder mit einer Digitalkamera aufgenommene
Fotos oder gerenderte k&uuml;nstlich erzeugte Bilder als Ausgangsmaterial
herangezogen. Man kann dann beispielsweise M&auml;ngel in Fotos
nachtr&auml;glich ausgleichen oder Elemente von mehreren Bildern zu einer
neuen Komposition zusammenstellen.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Sollten Sie jetzt pl&ouml;tzlich draufgekommen sein, da&szlig; so ein
Bildbearbeitungsprogramm ganau das ist, was sie schon die l&auml;ngste Zeit
brauchen, oder vielleicht einmal selbst ausprobieren wollen, was der Autor
in den vorangegangenen schwindligen Abs&auml;tzen versucht hat zu
erl&auml;utern, dann laden Sie sich doch einfach einmal die Demo-Version
von ArtEffect von der Haage &amp; Partner Homepage <A
HREF="http://www.haage-partner.com">http://www.haage-partner.com</A>.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Unterst&uuml;tzung f&uuml;r palettenbasierte Bilder</B></H3>&nbsp;

<BR>Neu in ArtEffect 3.0 aufgenommen wurde die Funktion, Echtfarbbilder in
graustufen- oder palettenbasierte Bilder von 2 bis 256 Farben
herunterzurechnen. Dabei kann optional eine Floyd-Steinberg-Rasterung zur
Qualit&auml;tssteigerung herangezogen werden. Andere Rasterverfahren werden
jedoch nicht unterst&uuml;tzt. Solche palettenbasierte Bilder k&ouml;nnen
dann in ArtEffect auch noch eingeschr&auml;nkt weiterbearbeitet werden.
Einfache Operationen wie Spiegeln, Skalieren und Rotieren sind weiterhin
m&ouml;glich. Auch k&ouml;nnen die meisten Malwerkzeuge in recht
eingeschr&auml;nkter Form mit solchen Bildern verwendet werden. Die Arbeit
mit Masken ist jedoch bei graustufen- und palettenbasierten Bildern nicht
m&ouml;glich.<BR>

<BR>Besonders n&uuml;tzlich ist diese Funktionalit&auml;t, wenn man Bilder
f&uuml;rs Internet braucht. Denn solche palettenbasierte Bilder k&ouml;nnen
jetzt auch im GIF-Format von 1 bis 8 Bit Farbtiefe abgespeichert werden.
Dabei wird auch Transparenz unterst&uuml;tzt.<BR>

<BR>Ebenfalls k&ouml;nnen diese im ILBM(IFF)- oder PNG-Format gespeichert
werden. Hierbei werden aber immer 8 Bit Farbtiefe verwendet, was nicht
unbedingt sinnvoll erscheint. So will man ein Bild, das man z.B. auf 4
Farben heruntergerechnet hat, dann auch als ILBM mit 2 Bit Farbtiefe
(entspricht 4 Farben) speichern. Hier w&auml;re also f&uuml;r die
n&auml;chste Version noch etwas zu tun. Derzeit mu&szlig; man da noch mit
einem externen Programm nachbessern.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Erweiterte M&ouml;glichkeiten bei den Ebenen (Layers)</B></H3>&nbsp;

<BR>Ebenen sind eine sehr n&uuml;tzliche Eigenschaft. Man kann sie sich wie
Klarsichtfolien vorstellen, die in einer bestimmte Reihenfolge
&uuml;bereinander liegen. Zeichnungselemente in dar&uuml;berliegenden
Ebenen verdecken Teile, die darunter liegen. Jedoch mu&szlig; es sich
hierbei nicht um eine vollst&auml;ndige Verdeckung handeln, da einerseits
die Ebenen selbst und andererseits die auf der Ebene aufgetragene Farbe
eine bestimmte einstellbare Deckkraft besitzen. Jede Ebene kann
unabh&auml;ngig von den anderen modifiziert und bemalt werden. Bei der
Anzahl der verwendbaren Ebenen gibt es jetzt keine k&uuml;nstliche
Beschr&auml;nkung mehr. Jedoch wird nat&uuml;rlich der Speicherbedarf
f&uuml;r jede zus&auml;tzliche Ebene gr&ouml;&szlig;er. Au&szlig;erdem
steigt auch der Rechenaufwand an. Weiters ist es jetzt m&ouml;glich,
da&szlig; die Zeichnungselemente dar&uuml;berliegender Ebenen auf den
darunterliegenden Schatten werfen. Diese Schatten werden automatisch
berechnet und lassen sich jederzeit ein und ausschalten. Die Deckkraft und
der Versatz des Schattens l&auml;&szlig;t sich hierbei einstellen. Weiters
k&ouml;nnen die Ebenen gegeneinander verschoben werden. So ist ein
nachtr&auml;gliches Einpassen oder Umplazieren von Bildelementen, die auf
verschiedenen Ebenen liegen, jederzeit m&ouml;glich.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Die Pinselspitzen haben ein paar zus&auml;tzliche M&ouml;glichkeiten bekommen</B></H3>&nbsp;

<BR>Einerseits l&auml;&szlig;t sich die Gr&ouml;&szlig;e der Spitze
abh&auml;ngig vom Druck (besonders f&uuml;r drucksensitive Grafiktabletts
interessant) oder zuf&auml;llig w&auml;hrend des Zeichnens variieren. Dabei
ist die definierte Gr&ouml;&szlig;e die Maximalgr&ouml;&szlig;e, die zum
Beispiel bei nachlassendem Druck immer mehr verkleinert wird. Die minimale
Gr&ouml;&szlig;e kann dabei in Prozent zur maximalen Gr&ouml;&szlig;e
(100%) eingestellt werden, was somit die St&auml;rke der Variation
bestimmt.<BR>

<BR>Ein weiterer Effekt der neuen Pinselspitzen ist die M&ouml;glichkeit,
ein gewisses Streuverhalten einzustellen. Dabei werden dann die farbigen
Punkte nicht unbedingt direkt unter der Spitze des Mauszeigers gesetzt, wie
es normalerweise geschieht, sondern innerhalb eines einstellbaren Radius
nach dem Zufallsprinzip um diese herum. Dies ist der gleiche Effekt, der im
Malprogramm DPaint bei der Spr&uuml;hdose zur Anwendung kommt.<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Neues bei den Filtern</B></H3>&nbsp;

<BR>Nat&uuml;rlich wurden auch die Filtermodule, mit denen man die
verschiedensten Effekte und Manipulationen am Bild durchf&uuml;hren kann,
erweitert und verbessert. Neu hinzugekommen ist der Deinterlace-Filter.
Wenn man aus einem Video-Film die zwei Halbbilder herausholt um ein
Standbild zu bekommen, dann erh&auml;lt man bei bewegten Szenen oft zwei
versetzte Bilder und damit nur eine sehr verschmierte Szene. Dieser Umstand
l&auml;&szlig;t sich durch das Interlace-Verfahren, das beim Fernsehen
angewandt wird, erkl&auml;ren. Dabei werden abwechselnd immer nur die
geraden oder ungeraden Rasterzeilen dargestellt. Jede zweite Zeile bleibt
frei. Da sich jedoch durch die Bewegung der abgebildeten Objekte deren
Position am Bildschirm zwischen diesen zwei Halbbildern schon wieder
ver&auml;ndert hat, erh&auml;lt man somit zwei versetzte Bilder
&uuml;bereinander. Der Deinterlace-Filter in ArtEffect bewirkt jetzt,
da&szlig; bei einem solchen Bild ausgehend von den geraden oder ungeraden
Rasterzeilen ein neues Bild ohne diesen Schmiereffekt berechnet wird. Dabei
wird jedoch nicht nur einfach jede zweite Zeile ausgelassen und durch die
benachbarte ersetzt, sondern es wird eine gewisse Interpolation zwischen
den beiden Halbbildern durchgef&uuml;hrt.<BR>

<BR>Weiters erfuhren die Kariakatur-Filter und Gauss-Filter eine
Geschwindigkeitssteigerung und neue Einstellm&ouml;glichkeiten.<BR>

<BR><CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Verbesserung bei Farbverl&auml;ufen</B></H3>&nbsp;

<BR>Mit ArtEffect lassen sich jetzt sehr sch&ouml;ne Farbverl&auml;ufe
definieren. Dabei k&ouml;nnen sowohl die Farbwerte als auch die Transparenz
festgelegt werden. Grunds&auml;tzlich geht man dabei so vor, da&szlig; man
in einem Balken, der den gesamten Verlauf repr&auml;sentiert, an
verschiedenen Stellen St&uuml;tzpunkte definiert, die einen bestimmten
Farbwert zugewiesen bekommen. Ein Beispiel f&uuml;r einen solchen Verlauf
wurde bei ArtEffect mitgeliefert: Der Regenbogen. Dieser wurde mit den
St&uuml;tzfarben Rot, Gelb, Gr&uuml;n, Cyan, Blau und Magenta erschaffen.
Die Position der St&uuml;tzpunkte l&auml;&szlig;t sich jederzeit
ver&auml;ndern und auch eine numerische Positionsangabe ist vorgesehen.<BR>

<BR>Die Transparenz kann nach dem selben Verfahren auf einem alternativen
Balken festgelegt werden.<BR>

<BR><CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Interne Verbesserungen in der Version 3.0</B></H3>&nbsp;

<BR>Es kamen mit der Version 3.0 nicht nur neue Funktionalit&auml;ten
hinzu, sondern es wurden auch programminterne Verbesserungen
durchgef&uuml;hrt. Dazu geh&ouml;rt ein reduzierter Speicherbedarf, der
insbesondere bei Verwendung von mehreren Layers entscheidend sein kann.
Auch das Refresh-Verhalten wurde abge&auml;ndert und erfolgt asynchron zum
Zeichnen.<BR>

<BR><CENTER><A NAME="12" HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Fazit</B></H3>&nbsp;

<BR>Das Programm macht insgesamt einen recht stabilen und brauchbaren
Eindruck. Jedoch f&uuml;hrte bei meinen Tests das Skalieren eines
Graustufenbildes manchmal zu einer endlosen Operation.<BR>

<BR>F&uuml;r einigerma&szlig;en vern&uuml;nftiges Arbeiten mu&szlig; man
einen Rechner mit MC68060 Prozessor und ausreichend Speicher besitzen. Auch
eine schnelle Festplatte ist anzuraten, da das Programm durch die
prinzipbedingt hohen Speicheranforderungen mit einer virtuellen
Speicherverwaltung arbeitet, wobei die Daten immer zwischen Festplatte und
Hauptspeicher ausgetauscht werden m&uuml;ssen.<BR>

<BR><CENTER><A NAME="13" HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Bedienung</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=95 HEIGHT=10 ALT="[95]"><IMG SRC="../images/_box_black.gif" WIDTH=5 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Features</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=80 HEIGHT=10 ALT="[80]"><IMG SRC="../images/_box_black.gif" WIDTH=20 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Qualit&auml;t</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Preis/Leistung</TD>  <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Stabilit&auml;t</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dokumentation</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=60 HEIGHT=10 ALT="[60]"><IMG SRC="../images/_box_black.gif" WIDTH=40 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#thomas">Thomas &Ouml;llinger</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x011C.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>
					<A HREF="as-redax.html#stevebow"><I>Steve Bowman</I></A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../english/0x011C.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__english.gif" ALT="[ english ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0F/ae_bildschirm.gif">ArtEffect Bildschirm</A> (GIF; 105K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0F/ae_farbverlauf.gif">Farbverlaufs-Manager</A> (GIF; 8K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0F/ae_pinseleinsteller.gif">Pinsel-Einsteller</A> (GIF; 6K)<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x011B.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x011D.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
