<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Frodo</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Markku Heikkinen &lt;<a href="mailto:marhete5@hotmail.com">marhete5@hotmail.com</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<img height="62" width="133" src="kuvat/commodore.jpg" border="0" alt=" "></center>
						<p>T&auml;t&auml; voidaan pit&auml;&auml; jatkona aikoinaan kirjoittamalleni jutulle, jossa kerroin SID-musiikista ja sen soittamisesta Amigalla. Lienenk&ouml; ihan nostalgiahullu vanha h&ouml;per&ouml;, mutta aina ajoittain tulee sellainen kutina, ett&auml; vanhoja Commodore 64 -klassikkoja olisi mukava p&auml;&auml;st&auml; pelaamaan tai sitten demoja ihmettelem&auml;&auml;n.</p>
						<p>Koska tunnustan olevani mukavuudenhaluinen ja sen verran laiska, ett&auml; joka kerta ei kehtaisi alkaa kaivaa sit&auml; vanhaa uskollista ratsua sielt&auml; jostain hyllyjen uumenista (vaikka my&ouml;nnett&auml;k&ouml;&ouml;n, ettei ole alkuper&auml;isen Nepan voittanutta), innostuin tutustumaan Frodoon, C64-emulaattoriin. Ilokseni se oli saanut p&auml;ivityksen, jossa PPC-kortitkin p&auml;&auml;siv&auml;t oikeuksiinsa. Emulointi on siit&auml; veike&auml;&auml; toimintaa, ett&auml; konetehoja se vaatii, joten otin mielihyvin vastaan t&auml;m&auml;n uuden prossatuen. Frodon uuden p&auml;ivityksen takana on ruotsalainen Mathias &quot;Amidog&quot; Roslund, joka on kunnostautunut muutenkin Amiga-ohjelmillaan kuten AMP (videoplayeri), SOPE (Playstation-emulaattori) jne.</p>
						<p>Asennus ei tarvitse suuria kikkoja, kunhan kopioit ohjelman jonnekin, varaat pinoa 100k ja k&auml;ynnist&auml;t sen shell-ikkunasta, WarpOS on vaatimus ohjelman toimimiselle. Valittavanasi on kolme eri versiota, jotka toimivat hieman eri tavoin, joten luultavasti jollain versiolla suurin osa ohjelmista l&auml;htee toimimaan. K&auml;ynnistyksen yhteydess&auml; on mahdollista m&auml;&auml;ritt&auml;&auml; lis&auml;optioilla ilotikut, Nepan levyasemat ja n&auml;ytt&ouml;tilat. Ohjelman k&auml;ynnistytty&auml; ei muuta kuin ohjelmia lataamaan, kaikki Nepan n&auml;pp&auml;imet l&ouml;ytyv&auml;t Runstopista Restoreen.</p>
						<p>Itse ohjelma toimii kuin junan vessa, en ole kohdannut kaatumisia tai muita ik&auml;vi&auml; juttuja ja nopeuskin on ollut kohdallaan. Ainoa mainittavan arvoinen miinus on Nepan demojen toimivuus: osa toimii jotenkin, osa ei ollenkaan eiv&auml;tk&auml; efektit aina n&auml;yt&auml; silt&auml; milt&auml; ne aikanaan Nepalla n&auml;yttiv&auml;t. Olisivatkohan koodarit k&auml;ytt&auml;neet muinoin hieman eksoottista koodia parhaitten tulosten aikaansaamiseksi?</p>
						<p>Mist&auml; sitten itse ohjelmia? Internet on t&auml;ss&auml;kin suhteessa ehtym&auml;t&ouml;n varasto, Nepalle ja emulaattoreille omistautuneita sivuja on lukemattomia, t&auml;ss&auml; muutamia, joissa itse usein vierailen:</p>
						<p><a href="http://www.c64.org" target="_blank">http://www.c64.org</a><br>
						<a href="http://www.c64.com" target="_blank">http://www.c64.com</a><br>
						<a href="http://www.c64audio.com" target="_blank">http://www.c64audio.com</a></p>
						<p>Jos siis nostalgiak&auml;rp&auml;nen p&auml;&auml;see puraisemaan, yksi vaihtoehto ovat emulaattorit ja Amigalla Frodo, toimii hyvin ja ohjelmia on saatavilla Internetist&auml; tuhansia ja taas tuhansia.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekij&auml;:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="mailto:frodo@amidog.com">Mathias &quot;Amidog&quot; Roslund</a>, <a href="http://www.amidog.com" target="_blank">http://www.amidog.com</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Amiga + PowerPC, AGA tai CGFX, 8 Mt muistia, OS 3.0, WarpOS v4.0, lowlevel.library joystick-tuelle</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Download:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="ftp://ftp.amidog.com/pub/emu/Frodo.lha" target="_blank">310 kt</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Yleisrvosana:</font></td>
					<td width="50%" bgcolor="#d8ecfd">8/10</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
