<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Amiga Software Development Kit 1.0</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;<br>
						Valokuvat:&nbsp;Anu Seilonen</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<img height="266" width="350" src="kuvat/sdk_kaytossa.jpg" alt=" " border="0"></center>
						<p>Uusi Amiga Inc. julkaisi ensimm&auml;isen tuotteensa, Amiga SDK:n, kev&auml;&auml;ll&auml;. Kyseess&auml; on uuden Amiga-k&auml;ytt&ouml;j&auml;rjestelm&auml;n perusta ja alustava kehitysymp&auml;rist&ouml;. Tutustuimme sen tarjontaan ja esittelimme sit&auml; suomalaisille amigisteille <a href="../toimitukselliset/vuosikokous.html" target="_self">kokouksessamme syyskuussa</a>. Kerromme nyt kokemuksistamme, annamme vinkkej&auml; asennusongelmiin ja raotamme verhoa seuraavan sukupolven Amigan pukuhuoneeseen...</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>SDK Suomeen</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. on kunnostautunut viime vuosina tuomalla Suomessa esille monenlaista maailmalla n&auml;hty&auml; Amiga-uutuutta. Viimeisimpin&auml; muistetaan AmigaOS 3.5, ja olisihan se Amiga MCC:n kotelomallikin saapunut Petro Tyschtschenkon mukana, ellei h&auml;n olisi joutunut perumaan Saku 99 -vierailuaan. Kun sitten Amigan uusin inkarnaatio sai kev&auml;&auml;ll&auml; putkautettua ulos ensimm&auml;isen uuden tuotteen, Amiga Software Development Kitin eli lyhyemmin SDK:n, her&auml;si luonnollisesti uteliaisuutemme esitell&auml; sit&auml; Suomen amigisteille.
						<p>T&auml;ll&auml; kertaa Amiga Inc.:st&auml; ei valitettavasti ollut apua, sill&auml; he ilmoittivat, etteiv&auml;t toistaiseksi lainaa SDK:ta esittelyk&auml;ytt&ouml;&ouml;n (tai muutenkaan lainaa). Vuosikokous olisi mukava paikka esitell&auml; uutuutta, mutta ensin sellainen - sek&auml; sen tarvitsema Linux-ymp&auml;rist&ouml; - olisi hankittava jostain. Lainaaminen paikalliselta j&auml;lleenmyyj&auml;lt&auml; ei oikein k&auml;ynyt p&auml;ins&auml;, kun tuote oli varustettu pakollisella nettirekister&ouml;innill&auml; ja sen mukanaan tuomilla yksil&ouml;idyill&auml; asennuskoodeilla. Eik&auml; SDK:n omistajiakaan tuntunut puissa n&auml;ill&auml; kulmilla kasvavan.</p>
						<p>Yksi Amiga SDK l&ouml;ytyi kuitenkin kotimaisen Gentle Eye Ky:n varastosta, joten pelastavaksi enkeliksi p&auml;&auml;tti ryhty&auml; p&auml;&auml;toimittajamme Anu Seilonen, joka iski tiskiin tarvittavat 850 markkaa, ett&auml; p&auml;&auml;sisimme ihmettelem&auml;&auml;n uutuutta. Kiitos, Anu! Aina yht&auml; avulias Gentle Eye tuki projektia osaltaan kattamalla postikulut, ja niinp&auml; p&auml;&auml;simme sorvaamaan systeemi&auml; PC-laitteistoon, johon allekirjoittanut hankki juuri sopivasti uuden kiintolevyn, verkkokortin ja RedHat Linuxin. Seikkailu p&auml;&auml;si alkamaan...</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Tuhti paketti purtavaa</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Amiga SDK toimitetaan punaisessa, varsin tuhdissa, 19x25x4 cm pahvilaatikossa, jota koristaa kannessa keskener&auml;inen Boing-pallo rakennusnostureineen ja k&auml;&auml;nt&ouml;puolella kehikosta harmaas&auml;vyjen kautta punav&auml;reihin kasvava Boing. Sanat Amiga, Software Development Kit sek&auml; So The World May Know -iskulause ovat my&ouml;s n&auml;kyv&auml;sti esill&auml;. Takakannen lyhyen myyntipuheen p&auml;&auml;tt&auml;v&auml;t sanat &quot;Today, you can help shape the Amiga of tomorrow.&quot; Paketin yleisilme on v&auml;reist&auml; huolimatta aika synkk&auml; ja yksityiskohdaton, ja Amiga lupaileekin seuraavan version tulevan kirkkaammissa s&auml;vyiss&auml;.
						<center>
							<p><img height="281" width="350" src="kuvat/sdk.jpg" border="0" alt=" "></p>
						</center>
						<p>Paketin yksityiskohtainen kuvaileminen suotakoon anteeksi, onhan viime vuosina tottunut siihen, ett&auml; kaikki miss&auml; lukee Amiga on l&auml;hinn&auml; puettu p&auml;&auml;lle, juotu tai muuten vain el&auml;nyt ulkoisilla meriiteill&auml;&auml;n. :-) T&auml;ll&auml; kertaa sis&auml;lt&auml; l&ouml;ytyy kuitenkin jotain muutakin kuin vain ilmaa tai rompun puolikas. Nimitt&auml;in &quot;pakollisen&quot;, ylisuuren Get Boinged -tarran, parin referenssilapun ja yhden CD-ROM-levyn lis&auml;ksi SDK toimitetaan tukevan 300-sivuisen ohjekirjan kera. Paksun manuskan psykologinen vaikutus on yll&auml;tt&auml;v&auml;, jotenkin tuo paperi tuntuu niin paljon heppoisia PDF-tiedostoja konkreettisemmalta. Eip&auml; silti, on manuskan jatkeena niit&auml; online-dokumenttejakin.</p>
						<p>Ohjekirja on alkutekstien mukaan kirjoitettu kokonaan Amigalla, mm. Final Writerin, Ghostscriptin ja Deluxe Paintin avulla. Eip&auml; siin&auml; mit&auml;&auml;n, valitettavasti vain bittikarttakuvia tuottavan ohjelman j&auml;lki n&auml;kyy kirjan kaaviokuvituksessa amat&ouml;&ouml;rim&auml;isen&auml; piksel&ouml;itymisen&auml;. Muuten v&auml;rikk&auml;isiin kansiin k&auml;&auml;ritty ohjekirja t&auml;ytt&auml;&auml; ulkoiset mittavaatimukset, ja sis&auml;lt&ouml;kin tuntuu olevan p&auml;&auml;asiassa asiaa, mit&auml; nyt muutamat pakolliset painovirheet ovat kiireess&auml; p&auml;&auml;sseet mukaan. Muutamia Classic Amiga -viitteit&auml; lukuunottamatta ohjekirja keskittyy p&auml;&auml;asiassa Taon toimittaman teknologian ylimalkaiseen selitt&auml;miseen. Puutteista huolimatta on eritt&auml;in positiivista, ett&auml; mukaan mahtui oikea ohjekirja.</p>
						<p>Kaiken kaikkiaan SDK 1.0 on ulkoisesti sangen onnistunut, etenkin muutaman kuukauden ik&auml;isen yrityksen tuotokseksi. Kyll&auml; sen kelpaa hyllyyns&auml; nostaa ja kaverillekin n&auml;ytt&auml;&auml;. Get Boinged -tarra on liian iso koneen etupaneeliin, sill&auml; voisi peitt&auml;&auml; melkein puolet pienest&auml; n&auml;yt&ouml;st&auml;, joten ehk&auml;p&auml; se on tarkoitettu kookkaan jenkkiauton takapuskuriin. Tai jotain. Jos tarrasta jotain t&auml;ytyy p&auml;&auml;tell&auml;, niin selv&auml;sti sill&auml; on yritetty hieman kosiskella promokr&auml;&auml;s&auml;&auml; rakastavaa Amiga-yhteis&ouml;&auml;... sill&auml; mit&auml; olisikaan nyky-Amiga ilman tarroja? :-)</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Rakennusalustana PC</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Amiga SDK piti alkujaan julkaista osana Amigan developer-konetta, johon se olisi ollut valmiiksi asennettuna. Kev&auml;&auml;ll&auml; Amiga-yhteis&ouml;n paine pakotti kuitenkin Amigan muuttamaan suunnitelmaa - liian monella oli jo valmis laitteisto, eik&auml; porukka halunnut ostaa uutta. Niinp&auml; SDK julkaistiin ensiksi rompulla, ja vasta sittemmin Amigan yhteisty&ouml;kumppanit ovat alkaneet valmistaa d'Amiga-nimell&auml; kulkevia kehitysty&ouml;asemia, jotka k&auml;yt&auml;nn&ouml;ss&auml; ovat tietyt Amigan m&auml;&auml;rittelem&auml;t speksit t&auml;ytt&auml;vi&auml; Linux-PC-laitteita SDK:lla ja Amigan kehittelij&auml;tuella varustettuna.
						<p>Erillisen&auml; toimitettava Amiga SDK asentuu siis &quot;mihin tahansa&quot; x86-pohjaiseen Linux-mikroon, joka t&auml;ytt&auml;&auml; seuraavat vaatimukset: RedHat Linux 6.1 ja Xfree86 (tulee RedHatin mukana), 32 Mt muistia (suositus 64 Mt), 100 Mt kiintolevytilaa ja verkkokortti. K&auml;yt&auml;nn&ouml;ss&auml; ensin mainitussa vaatimuksessa voi joustaa kikkailemalla (kuten mekin jouduimme tekem&auml;&auml;n), mutta esimerkiksi verkkokortti koneessa t&auml;ytyy olla asennuksen aikana, vaikka varsinaista verkkoyhteytt&auml; ei oikeasti tarvitakaan.</p>
						<p>d'Amiga-kehityskoneet toimitetaan 500 megahertsin AMD K6-2 -suorittimella, Matroxin G400-n&auml;yt&ouml;nohjaimella ja 128 megatavun muistilla. Oma asennusymp&auml;rist&ouml;mme oli hieman vanhempi, 333 megahertsinen K6-2, jossa Creativen Riva TNT -n&auml;yt&ouml;nohjain ja 128 Mt muistia. Mik&auml;&auml;n erityinen vaatimus AMD:n suoritin ei tietenk&auml;&auml;n ole, vaan SDK:n pit&auml;isi kyll&auml; asentua melkein miss&auml; tahansa modernissa PC:ss&auml;, jossa ohjelmistopuoli on vaaditulla tolalla. Jatkoa ja p&auml;ivityksi&auml; ajatellen Amigan yhteisty&ouml; Matroxin kanssa voi tosin suosia Matroxin n&auml;yt&ouml;nohjainten omistajia, mutta toistaiseksi sill&auml; ei ole v&auml;li&auml;.</p>
						<p>Alleviivattakoon kuitenkin viel&auml; t&auml;t&auml; faktaa: Amiga SDK on kehitysymp&auml;rist&ouml; seuraavan sukupolven Amiga-k&auml;ytt&ouml;j&auml;rjestelm&auml;lle, ja tuo kehitysymp&auml;rist&ouml; toimii PC-laitteistolla - vanhaan Amigaan sit&auml; ei voi (ainakaan ilman emulaattoreita) asentaa. Tilannetta voi jokseenkin rinnastaa siihen, ett&auml; alkuper&auml;isen Amigan k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml; kehitettiin Sun-ty&ouml;asemilla. Syy kehitysymp&auml;rist&ouml;n osalta PC:n valmintaan on edullinen hinta, yleisyys ja Linuxin kohdalla taas ty&ouml;kalujen saatavuus. SDK:sta on tosin tulossa my&ouml;s Windowsin p&auml;&auml;ll&auml; py&ouml;riv&auml; versio nyt lokakuussa.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Asennusten kautta voittoon</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Testikoneeseemme, jota py&ouml;ritti tavalliseen tapaan Windows 98, asennettiin Windowsin rinnalle RedHat Linux 6.2 -k&auml;ytt&ouml;j&auml;rjestelm&auml;. Linuxeja voi kopioida ilmaiseksi netist&auml;, ja niit&auml; kaupitellaan v&auml;h&auml;n joka kaupan hyllyll&auml; R-kioskeja ja ruokakauppojen lehtipisteit&auml; my&ouml;ten. Amiga SDK:n laitteistovaatimuksissa vaadittiin RedHatin versiota 6.1, mutta koska osuvasti oli paikallisesta lehtihyllyst&auml; tarttunut mukaan Linux-k&auml;ytt&auml;j&auml;-lehti ja sen mukana RedHat 6.2, p&auml;&auml;dyimme k&auml;ytt&auml;m&auml;&auml;n varoituksista huolimatta p&auml;ivitetty&auml; versiota.
						<p>Osasimme odottaa ongelmia, mutta apua tuli sangen yll&auml;tt&auml;v&auml;lt&auml; taholta - nimitt&auml;in IBM:n DeveloperWorks julkaisi pari artikkelia aiheesta ja itse asiassa kehaisi SDK:ta muutamaan otteeseen (ks. URL-viitteet artikkelin lopussa). Yksi n&auml;ist&auml; Daniel Robbinsin kirjoittamista artikkeleista sis&auml;lsi my&ouml;s asennusohjeita, jotka ohjaisivat meid&auml;t pahimpien karikoiden ohitse. Ensin oli kuitenkin selvitett&auml;v&auml; Amigan kryptinen rekister&ouml;intiprosessi: kannattaa lukea huolella SDK:n mukana tuleva Installation Guide -lappunen, jonka avulla saa tarvittavat asennuskoodit. Varsinaiset koodit ovat pitki&auml;, joten &auml;l&auml; turhaa tuhlaa meid&auml;n tapaamme aikaasi yritt&auml;m&auml;ll&auml; sy&ouml;tt&auml;&auml;&auml; asennusohjelmaan ensin saamaasi lyhytt&auml; numerosarjaa.</p>
						<p>Koodeja kertyy yhteens&auml; vaiheittain kolme parikymmenmerkkist&auml;, mutta onneksi niiden hankkiminen ja rekister&ouml;inti voitiin tehd&auml; webist&auml; irrallaan asennuksesta, sill&auml; emme saaneet Interneti&auml; toimimaan Linuxista. Sen sijaan verkkokortin t&auml;ytyy olla asennettuna, vaikka siihen ei mit&auml;&auml;n olisikaan kytketty - asennusohjelma nimitt&auml;in luo yhden asennuskoodeista verkkokortin jotakuinkin yksil&ouml;llisen tunnisteosoitteen mukaan. Meid&auml;n tapauksessamme halpa D-Linkin DE-528CT riitti tarkoitukseen, ja sittemmin se voitiin irroittaa koneesta SDK:n asiasta h&auml;iriintym&auml;tt&auml;. My&ouml;hemmin koneeseen itse asiassa vaihdettiin tehokkaampi verkkokortti, jota Linux ei tunnistanut, mutta SDK ei jo asennettuna ollut asiasta en&auml;&auml; kiinnostunut.</p>
						<center>
							<p><img height="181" width="380" src="kuvat/setup.jpg" border="0" alt=" "></p>
						</center>
						<p>Asennusohjelma ei my&ouml;sk&auml;&auml;n tyk&auml;nnyt k&auml;ynnisty&auml; oikein KDE-desktopilta (joka oli RedHatiimme valittu), vaan kadotti kuvat ja lisenssitekstit. Ongelma korjaantui k&auml;ynnist&auml;m&auml;ll&auml; ohjelma shellist&auml;. Helpotus oli melkoinen, kun rekister&ouml;intirumban ja Linuxin viilaamisen j&auml;lkeen asennusohjelma sitten sutjakasti alkoi kopioida tiedostoja paikoilleen ja mukisematta sek&auml; yll&auml;tt&auml;v&auml;n nopeasti suoriutui teht&auml;v&auml;st&auml;&auml;n. Eip&auml; tosin CD:ll&auml; hirve&auml;sti kopioitavaa ollutkaan - koko levylle on painettu vain 27 megatavun edest&auml; dataa.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>S&auml;&auml;t&auml;j&auml;n unelma-asennus?</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Seuraavat asennustekniset yksityiskohdat kannattaa ohittaa, mik&auml;li ei itse painiskele niiden kanssa. Pureudumme SDK:hon yleisemm&auml;ll&auml; tasolla niiden j&auml;lkeen. Toisaalta jos kaipaat tarkempaa teknist&auml; selvityst&auml; seuraaviin vinkkeihin, kannattaa lukea niiden alkuper&auml;isl&auml;hde, Daniel Robbinsin SDK-artikkeli IBM DeveloperWorks-saitilta, sek&auml; tutustua ep&auml;viralliseen Amiga SDK -sivustoon osoitteessa <a href="http://www.amigasdk.com" target="_blank">http://www.amigasdk.com</a>.
						<p>Mainitsimme edell&auml; asennusongelmat, joita laitteistovaatimuksia kiert&auml;v&auml; v&auml;ist&auml;m&auml;tt&auml; kohtaa. Muutama kikkakolmonen tuli meill&auml;kin tarpeeseen. T&auml;rkein ongelma koskee RedHat 6.2:n k&auml;ytt&auml;m&auml;&auml; ncurses-kirjaston versiota, jonka kanssa SDK on ep&auml;yhteensopiva ja kaatuu k&auml;ynnistysyritykseen. Ratkaisu on hakea FTP:ll&auml; osoitteesta ftp.gnu.org tiedosto &quot;pub/gnu/ncurses/ncurses-4.2.tar.gz&quot; ja purkaa se Linuxissa komennolla &quot;tar xzvf ncurses-4.2.tar.gz&quot;. T&auml;m&auml;n j&auml;lkeen tulee siirty&auml; ncursesin hakemistoon ja suorittaa seuraavat komennot, yksi kerrallaan: &quot;./configure --with-shared --prefix=/usr/amiga&quot;, &quot;make&quot; ja lopuksi &quot;make install&quot;.</p>
						<p>Edell&auml; mainittu Daniel Robbinsin suosittelema komentosarja asentaa RedHatin ncursesin rinnalle standardin mukaisen ncurses-kirjaston. Jotta SDK k&auml;ytt&auml;isi sit&auml;, pit&auml;&auml; viel&auml; joka kerta ennen sen k&auml;ynnist&auml;mist&auml; naputella k&auml;ynnistysshelliin komento &quot;export LD_LIBRARY_PATH=/usr/amiga/lib&quot;. T&auml;m&auml;n j&auml;lkeen Amiga-ymp&auml;rist&ouml;n k&auml;ynnist&auml;v&auml;t &quot;intent_media&quot; ja &quot;intent_shell&quot; todistettavasti toimivat my&ouml;s RedHat 6.2:lla. Ja pitih&auml;n sit&auml; kokeilla ilmankin - ei toiminut. RedHat 6.1:t&auml; emme ole testanneet, mutta ilmeisesti sill&auml; ongelmaa ei ilmene.</p>
						<p>Toinen ongelma koski graafista terminaalia, etermi&auml;, joka ei yksinkertaisesti toiminut - t&auml;ll&auml; kertaa ihan Amigan skriptausvirheen vuoksi. Robbinsilla oli l&auml;&auml;ke my&ouml;s t&auml;h&auml;n vaivaan: Amiga-ymp&auml;rist&ouml;n shelliss&auml; naputeltiin komennot &quot;cd /dev/ave/dsk/eterm&quot; ja &quot;touch rc&quot; sek&auml; sen j&auml;lkeen k&auml;ynnistettiin editori &quot;jove rc&quot;, poistettiin seuraavat rivit ja tallennettiin tiedosto. T&auml;m&auml;n j&auml;lkeen, taas kerran todistettavasti, my&ouml;s eterm l&auml;hti toimimaan moitteetta.</p>
						<pre>	case -- ${!hostparms command!c} ~
		{0} {</pre>
						<p>ja lopusta</p>
						<pre>		} ~
		{*}
			eval -- ${!hostparms command}
		}</pre>
						<p>Robbinsin mukaan RedHat ei oikeasti ole vaatimus SDK:n asentamiselle, vaan my&ouml;s muut Linuxit kelpaavat kehitysymp&auml;rist&ouml;n alustaksi. Internetist&auml; onkin kantautunut tietoja esim. SuSE Linuxin onnistuneesta k&auml;yt&ouml;st&auml; SDK:n kanssa. Mik&auml;li asennus kuitenkin t&ouml;kkii, voi seuraavasta olla apua: Keskeyt&auml; asennusohjelma Ctrl-Z:lla (terminaalissa josta k&auml;ynnistit ohjelman) sen j&auml;lkeen kun se on dekryptannut SDK:n RPM-paketit kiintolevylle. Kopioi sitten .rpm-tiedostot /tmp-hakemistosta sopivaan paikkaan ja suorita kullekin komento &quot;rpm -i --nodeps tiedosto.rpm&quot;. T&auml;m&auml;n j&auml;lkeen voit jatkaa asennusohjelman suoritusta ja asennuksen pit&auml;isi sujua mallikkaasti loppuun. T&auml;t&auml; vinkki&auml; emme kuitenkaan joutuneet kokeilemaan.</p>
						<p>SDK:n pit&auml;isi toimia RedHat Linux 7.0:n kanssa ilman edell&auml; mainittuja ncurses-ongelmia, mutta RedHat seiskan kanssa ilmenee kuitenkin grafiikan sekoamisongelmia, kun Elate-ikkunan p&auml;&auml;lle siirret&auml;&auml;n jokin muu Linux-ikkuna. Ongelman syy on rinnastettavissa Classic Amigan simple ja smart refresh -virkistyksiin. Pulma ratkeaa k&auml;ynnist&auml;m&auml;ll&auml; X-palvelin komennolla &quot;startx -- +bs&quot;. Jos taas j&auml;rjestelm&auml;si k&auml;ynnist&auml;&auml; suoraan X Window Systemiin, kokeile muuttaa tiedostosta &quot;/etc/X11/gdm/gdm.conf&quot; rivi &quot;0=/usr/bin/X11/X&quot; muotoon &quot;0=/usr/bin/X11/X +bs&quot; (vain super-user voi p&auml;ivitt&auml;&auml; tiedostoa). Vastaavaan ongelmaan voi t&ouml;rm&auml;t&auml; my&ouml;s SuSE Linuxin kanssa, jossa se ratkaistaan lis&auml;&auml;m&auml;ll&auml; &quot;+bs&quot; tiedoston &quot;/etc/X11/xdm/Xservers&quot; rivin &quot;:0 local /usr/X11R6/bin/X :0 vt07&quot; loppuun.</p>
						<p><a href="http://www.amigasdk.com" target="_blank">www.amigasdk.com</a>:ssa on asennusohjeita my&ouml;s Linux Mandrakelle ja Debianille.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Ensikosketus uuteen Amigaan</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Ehdimme edell&auml; kiireht&auml;&auml; jo hieman asioiden edelle, mutta vuosien odottelun j&auml;lkeen oli kova hoppu p&auml;&auml;st&auml; tutustumaan uuden Amigan sielunel&auml;m&auml;&auml;n. Asennuksen j&auml;lkeen komennolla &quot;intent_media&quot; k&auml;ynnistyy uusi &quot;AmigaOS&quot; sellaisena kuin se SDK:n mukana toimitetaan. Linuxin ty&ouml;p&ouml;yd&auml;lle aukeaa kirkass&auml;vyinen ikkuna, johon putkahtelee muutamalla valikon vedolla Boing-palloja, v&auml;riefektej&auml; ja monenlaista graafista kilkett&auml;.
						<center>
							<p><a href="kuvat/elate_iso.jpg" target="_blank"><img height="295" width="380" src="kuvat/elate.jpg" border="0" alt=" "></a></p>
						</center>
						<p>Nopeasti k&auml;y kuitenkin ilmeiseksi, ett&auml; uusitun Boing-demon ja muiden hilavitkuttimien merkitys j&auml;&auml; sangen v&auml;h&auml;iseksi. Mink&auml;&auml;nlaista seuraavan sukupolven k&auml;ytt&ouml;liittym&auml;&auml; tai ty&ouml;p&ouml;yt&auml;&auml; ei viel&auml; ole tarjolla, vaan SDK 1.0 perustuu l&auml;hinn&auml; englantilaisen Tao Groupin toimittamaan Amiga Foundation Layeriin eli Elate-reaaliaikak&auml;ytt&ouml;j&auml;rjestelm&auml;n ja Intent-kirjastojen ja viimeksi mainitun J-Engine-Java-virtuaalikoneen tarjoamaan perustaan. (Jotta nimisotku olisi t&auml;ydellinen, yhdess&auml; Elatea ja Intenti&auml; kutsutaan my&ouml;s nimell&auml; Intent Java Technology Edition).</p>
						<p>Elaten ja Intentin vahvuudet, ja uuden Amigan peruskivet, ovat virtuaaliprosessori, jolla samaa ohjelmakoodia voidaan ajaa useilla eri suorittimilla, sek&auml; huippunopea Java-virtuaalikone, jonka v&auml;itet&auml;&auml;n peittoavan kaikki muut ja joka sekin tarjoaa alustan laitteistoriippumattomille ohjelmille.</p>
						<p>Vaikka ohjekirjassa onkin korvattu suurin osa Elate-sanoista Amigalla, t&ouml;rm&auml;&auml; nimeen Elate kuitenkin viel&auml; joka paikassa. Hyvin paljon SDK 1.0:sta on siis tullut suoraan Taolta. My&ouml;s online-dokumentaatio, yli tuhat sivua PDF-tiedostoja, puhuu pelk&auml;st&auml;&auml;n Elatesta.</p>
						<center>
							<p><img height="341" width="400" src="kuvat/manuals.gif" border="0" alt=" "></p>
						</center>
						<p>Tarjolla ovat siis uuden Amigan peruspalikat Intent JTE:n muodossa ja Taon toimittamat k&auml;ytt&ouml;liittym&auml;elementit (Amigan oma, seuraavan sukupolven BOOPSI, ty&ouml;nimelt&auml;&auml;n BOOPS, on tulossa), jotka j&auml;&auml;v&auml;t l&auml;hinn&auml; kehitysymp&auml;rist&ouml;n apuv&auml;lineiksi - edes 3D-kirjastoja tai kunnollista &auml;&auml;nitukea ei viel&auml; ole tarjolla, tulossa kyll&auml;kin. Todellinen SDK:n arvo piilee toistaiseksi nimenomaan mahdollisuudessa tutustua uuden AmigaOS:n (eli Elaten) perusperiaatteisiin, eli virtuaaliprosessoriin ja sen suomiin mahdollisuuksiin. Linuxin p&auml;&auml;ll&auml; py&ouml;riv&auml; kehitysymp&auml;rist&ouml; antaa my&ouml;s esimakua j&auml;rjestelm&auml;n joustavuudesta: uutta Amigaa voidaan tulevaisuudessa paitsi k&auml;ytt&auml;&auml; monella eri koneella, my&ouml;s natiivik&auml;yt&ouml;n lis&auml;ksi ajaa Linuxin tai Windowsin p&auml;&auml;ll&auml;.</p>
						<p>Eik&auml; uusi SDK pelkk&auml; lelu ole, sill&auml; kyll&auml; siit&auml; on ihan vakavaankin ohjelmistokehitykseen. Mukana toimitetaan ty&ouml;kalut niin C/C++ -, Java- kuin uuden Amigan virtuaaliprosessorin assembler-ohjelmointiinkin. Ohjekirja k&auml;sittelee kaikkia n&auml;it&auml; kolmea aihetta ja tarjoaa selityksi&auml; my&ouml;s valinnanvaraan: C/C++ ovat omiaan olemassaolevien ohjelmien porttaamiseen, Java on alati kasvava laitteistoriipumaton standardi ja parhaisiin nopeustuloksiin p&auml;&auml;st&auml;&auml;n ohjelmoimalla suoraan Amigan (eli Taon) virtuaaliprosessoria.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Juju on virtuaaliprosessorissa</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Vaikka Java vilahtelee jatkuvasti Amigan tiedotteissa ja suunnitelmissa, alkaa hiljalleen vaikuttaa silt&auml;, ett&auml; se todellinen vallankumouksellisuus uudessa Amigassa piilee kuitenkin sen laitteistoriippumattomassa virtuaaliprosessorissa ja laitteistoabstraktiossa. Kaikkia uudelle Amigalle tehtyj&auml; ohjelmia voidaan teoriassa ajaa mill&auml; tahansa koneella, pienell&auml; tai suurella. Eip&auml; siis ihme, ett&auml; Amiga on demonnut systeemi&auml;&auml;n jo monenlaisilla taskulaitteilla, pelikonsoleilla ja kotimikroilla. Jopa PowerPC-pohjaisia Classic Amigoita tullaan mahdollisesti tukemaan - t&auml;ss&auml; auttanee yhteisty&ouml;kumppani Haage &amp; Partner.
						<p>Amiga SDK 1.0 antaa mahdollisuuden p&auml;&auml;st&auml; ohjelmoimaan n&auml;it&auml; laitteistoriippumattomia ohjelmia ensimm&auml;isten joukossa. Kehitysymp&auml;rist&ouml;&auml; tullaan p&auml;ivitt&auml;m&auml;&auml;n sit&auml; mukaa kuin Amigan suunnitelmat valmistuvat, mutta jo nyt on Internetiss&auml; lukuisia pieni&auml; ohjelmia, joita on k&auml;&auml;nnetty uudelle Amigalle. Jahka ensimm&auml;iset varsinaiset seuraavan sukupolven Amiga-laitteistot ilmestyv&auml;t, liikkuu ohjelmien m&auml;&auml;r&auml; varmasti jo kymmeniss&auml;, ellei sadoissa. Monet Classic Amigan kehittelij&auml;t ovat hyp&auml;nneet kelkkaan SDK:n my&ouml;t&auml;, esim. Wildfire&auml; k&auml;&auml;nnet&auml;&auml;n uudelle Amigalle nimell&auml; Taifun, ja pelivalmistaja Hyperion on yksi Amigan t&auml;rkeimmist&auml; yhteisty&ouml;kumppaneista.</p>
						<p>Uuden Amigan menestys riippuu tietysti paitsi ohjelmistokehitt&auml;jien tuesta, my&ouml;s siit&auml;, kuinka onnistunut virtuaaliprosessori k&auml;yt&auml;nn&ouml;ss&auml; on. Amigalta vakuutellaan sen nopeutta ja loistavuutta, ohjelmakoodi kun k&auml;&auml;nnet&auml;&auml;n tulkkaamisen sijaan jo latausvaiheessa k&auml;ytetyn prosessorin natiivikoodiksi ja laitteistoabstraktiota voidaan t&auml;ydent&auml;&auml; laitespesifisill&auml; ajureilla, mutta vain aika n&auml;ytt&auml;&auml;. Toistaiseksi SDK:n mukana toimitetut demot tuntuivat py&ouml;riv&auml;n kohtuullisesti, ajettiinhan niit&auml; Linuxin p&auml;&auml;ll&auml; ja ilman 3D-kiihdytyst&auml;, mutta viel&auml; lopullisesta vauhdista on mahdoton esitt&auml;&auml; arvioita.</p>
						<p>SDK:n omaavat voivat vertailla oman laitteistonsa benchmark-tuloksia seuraaviin SDK:n speed-komennon testikoneellamme antamiin tulosteisiin:</p>
						<p>Amiga 1.0:/$ speed<br>
						VP MIOPS = 415.119007<br>
						VP MLOPS = 74.703084<br>
						VP MFOPS = 25.349671<br>
						VP MDOPS = 21.904094<br>
						Amiga 1.0:/$ speed<br>
						VP MIOPS = 414.470022<br>
						VP MLOPS = 74.558401<br>
						VP MFOPS = 25.440361<br>
						VP MDOPS = 21.888292</p>
						<p>Luvut vaihtelivat hieman ajokerrasta rippuen. Tietysti jos samaan aikaan ajoi jotain muita ohjelmia, tulokset romahtivat radikaalisti.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Ent&auml; kulissien takana?</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Pomppivien Boing-pallojen ja visuaalisten efektien alta paljastuu muutaman kymmenen megan edest&auml; raakaa dataa ja karuja kehitysty&ouml;kaluja. On ep&auml;selv&auml;&auml;, kuinka hyvin SDK:n hakemistorakenne kuvastelee lopullista uuden Amigan hakemistorakennetta (voi olla ettei niill&auml; ole paljoakaan yhteist&auml; tai sitten on), mutta SDK:n tiedostoj&auml;rjestelm&auml; on jaoteltu seuraavasti:
						<p>
						<table border="0" cellpadding="4" cellspacing="0" width="100%">
							<tr>
								<td valign="top">app/</td>
								<td>sovellusohjelmat</td>
							</tr>
							<tr>
								<td valign="top">ave/</td>
								<td>multimediaty&ouml;kalut (Audio Visual Environment tai Amiga Multimedia Toolkit)</td>
							</tr>
							<tr>
								<td valign="top">com/</td>
								<td>Java-luokat, k&auml;ytt&auml;en standardia Javan pakettien nimiavaruutta</td>
							</tr>
							<tr>
								<td valign="top">demo/</td>
								<td>esimerkkiohjelmat</td>
							</tr>
							<tr>
								<td valign="top">dev/</td>
								<td>laiteajurit</td>
							</tr>
							<tr>
								<td valign="top">etc/</td>
								<td>TCP/IP-verkko ja verkkoasetukset</td>
							</tr>
							<tr>
								<td valign="top">fonts/</td>
								<td>TrueType- ja PostScript 1 -kirjasimet</td>
							</tr>
							<tr>
								<td valign="top">home/</td>
								<td>k&auml;ytt&auml;j&auml;n kotihakemisto</td>
							</tr>
							<tr>
								<td valign="top">java/</td>
								<td>Java-kirjastot</td>
							</tr>
							<tr>
								<td valign="top">lang/</td>
								<td>ohjelmointikielet</td>
							</tr>
							<tr>
								<td valign="top">lib/</td>
								<td>yleiset kirjastot</td>
							</tr>
							<tr>
								<td valign="top">sounds/</td>
								<td>&auml;&auml;nij&auml;rjestelm&auml;</td>
							</tr>
							<tr>
								<td valign="top">sys/</td>
								<td>j&auml;rjestelm&auml;hakemisto</td>
							</tr>
						</table>
						</p>
						<p>Amigan mahtipontisessa kielenk&auml;yt&ouml;ss&auml; he puhuvat uudesta digitaalisen tiedon maailmankaikkeudesta, Amiversest&auml;, jossa ei perinteisi&auml; tiedostoja en&auml;&auml; kaivata ollenkaan, mutta kovasti tiedostopohjaiselta alusta ainakin vaikuttaa. Itse asiassa tiedostojen sijoittelu on ohjelmia asennettaessa tarkkaa puuhaa: komponenttien sijainti on usein kiinnitetty, ja ne toimivat vain juuri oikeasta paikasta. Amigan oma tiedostoj&auml;rjestelm&auml; latautuu SDK:n tapauksessa Linuxin k&auml;ynnistyshakemiston p&auml;&auml;lle. T&auml;ten ko. hakemiston sis&auml;lt&ouml; ja alihakemistot ovat k&auml;ytett&auml;viss&auml; Amigalta, ja sinne tallentuvat my&ouml;s Amigan tiedostoj&auml;rjestelm&auml;&auml;n tallennetut muutokset.</p>
						<p>Ohjelmien k&auml;ynnistystapa oli perinteiseen Amiga-tapaan tottuneelle hieman erikoinen. Ajettavat tiedostot on nimetty .00-p&auml;&auml;tteell&auml;, esim. boing.00, mutta ne k&auml;ynnistet&auml;&auml;n ilman tuota p&auml;&auml;tett&auml; - hieman kuten Windows/MS-DOS-ymp&auml;rist&ouml;ss&auml; EXE-p&auml;&auml;tett&auml; ei tarvitse antaa. Erikoisen p&auml;&auml;tteen merkitys paljastuu arkkitehtuuria tutkiskeltaessa: 00 ilmaisee koodin olevan virtuaaliprosessorin koodia, kun taas jokin suurempi numero ilmaisi ohjelmakomponentista l&ouml;ytyv&auml;n my&ouml;s prosessorinatiivin version, jota j&auml;rjestelm&auml; automaattisesti k&auml;ytt&auml;isi ao. prosessorilla. Esimerkiksi p&auml;&auml;te .24 tarkoittaisi Pentium II:lle optimoitua koodia.</p>
						<p>Itse asiassa Taon tarjoaman pohjakerroksen tapa k&auml;sitell&auml; ohjelmakomponentteja on sangen elegantti: siin&auml; miss&auml; normaalisti esimerkiksi ohjelman luokka ladataan muistiin, se ladataan kokonaan riippumatta siit&auml;, kuinka suurta osaa siit&auml; k&auml;ytet&auml;&auml;n. (Amigalta esitettiin 80-20-s&auml;&auml;nt&ouml;&auml;: yleens&auml; luokasta k&auml;ytet&auml;&auml;n vain 20% ja 80% ladataan muistiin ihan turhaan.) Uusi Amiga paloittelee kaikki ohjelmakomponentit ty&ouml;kaluiksi (tools), joita sitten ladataan vain tarpeen mukaan. Ja koska jokaisesta ty&ouml;kalusta voi olla virtuaaliprosessoriversion lis&auml;ksi natiivi prosessori/lis&auml;laitekohtainen versio, voidaan nopeutta hioa hyvin yksityiskohtaisella tasolla mutta taata silti perusyhteensopivuus kaikkien laitteiden kanssa.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Ohjelmointiymp&auml;rist&ouml;t</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Vaikka Amiga SDK on ensikurkistus uuden Amigan sielunel&auml;m&auml;&auml;n ja sellaisenaan mielenkiintoinen kiertoajelu ihan Amigasta yleens&auml;kin kiinnostuneelle, sek&auml; hy&ouml;dyllinen teknologiaesittely asiaan vihkiytyneille, niin ohjelmointiinhan se kuitenkin ensisijaisesti on tarkoitettu. Vaikka ty&ouml;kalut ja ymp&auml;rist&ouml; ovat viel&auml; pohjamutia lukuunottamatta hyvin keskener&auml;isi&auml;, t&auml;ll&auml; paketilla ja sen seuraajilla on tarkoitus taata, ettei seuraavan sukupolven Amiga ilmesty markkinoille ilman runsasta ohjelmistotukea.
						<p>Kuten edell&auml; jo ohimennen mainittiin, kehitysty&ouml;kalut jakautuvat kolmeen ryhm&auml;&auml;n: C/C++ -k&auml;&auml;nt&auml;j&auml; perinteisten ohjelmien porttaamiseen ja yleiseen kehitysty&ouml;h&ouml;n, Java-ymp&auml;rist&ouml; Java-pohjaiseen laitteistoriippumattomaan ohjelmointiin ja VP-assembleri virtuaaliprosessorin pilkuntarkkaan ja nopeaan viilaamiseen. Modernit, integroidut ohjelmointiymp&auml;rist&ouml;t ovat vasta ty&ouml;n alla, mutta hardcore-kooderi ja Unix-guru tuntee olonsa varmasti kotoisaksi.</p>
						<p>C/C++ -ymp&auml;rist&ouml; perustuu GNU:n GCC-projektiin ja tuottaa virtuaaliprosessorin assemblerin ymm&auml;rt&auml;m&auml;&auml; koodia, joka sitten k&auml;&auml;nnet&auml;&auml;n virtuaalibin&auml;&auml;riksi. Ainoa ongelma t&auml;ss&auml; on, ett&auml; koko C/C++ -ohjelma k&auml;&auml;ntyy vakiona yhdeksi edell&auml; mainituksi ty&ouml;kaluksi, joten parasta mahdollista j&auml;rjestelm&auml;n tarjoamaa nopeusetua ei suoraan saavuteta. Ongelma voidaan kuitenkin ratkaista tekem&auml;ll&auml; itse C/C++:lla uusia ty&ouml;kaluja. Tarjolla on my&ouml;s yli 6500 valmista ty&ouml;kalua, mm. ANSI/C-kutsut. C/C++ -koodin sekaan voi toki ymp&auml;t&auml; my&ouml;s assembleria - menetelm&auml;, joka lienee monille Classic Amiga -kooderillekin sangen tuttu.</p>
						<p>Java-ymp&auml;rist&ouml; on Taon kehitt&auml;m&auml; ja tukee edell&auml; mainittua ty&ouml;kalumallia siten, ett&auml; kaikista metodeista tehd&auml;&auml;n omia ty&ouml;kalujaan. T&auml;m&auml; lienee yksi perustavanlaatuinen syy siihen, ett&auml; Java-koodi todellakin py&ouml;rii j&auml;rjestelm&auml;ll&auml; sangen vikkel&auml;sti. Komentorivipohjainen Java-k&auml;&auml;nt&auml;j&auml; on syntaksiltaan identtinen Sunin SDK:n kanssa, joten perinteisill&auml; Java-ty&ouml;kaluilla ohjelmoineet p&auml;&auml;sev&auml;t alkuun ilman sen suurempaa ihmettely&auml;. Mukana on my&ouml;s oma versio Applet Viewerist&auml;.</p>
						<p>Kolmantena kehitysymp&auml;rist&ouml;n&auml; on virtuaaliprosessorin VP-nimell&auml; kulkevaa assembler-kielt&auml; ymm&auml;rt&auml;v&auml; k&auml;&auml;nt&auml;j&auml;. VP:ll&auml; voidaan rakentaa uusia ty&ouml;kaluja esimerkiksi C-ohjelmien k&auml;ytt&ouml;&ouml;n tai sill&auml; voidaan tehd&auml; kokonaisia ohjelmia, joista SDK:n mukana toimitetaankin muutamia esimerkkej&auml;.</p>
						<center>
							<p><a href="kuvat/jove_iso.jpg" target="_blank"><img height="204" width="380" src="kuvat/jove.jpg" border="0" alt=" "></a></p>
							<p><img height="194" width="196" src="kuvat/start.jpg" border="0" alt=" "></p>
						</center>
						<p>K&auml;ytt&ouml;ymp&auml;rist&ouml;ksi SDK:n mukana tarjotaan uutta Amiga Shelli&auml;, joka on toiminnallisesti Unixin zsh:ta vastaava. Ohjelmien k&auml;ynnist&auml;mist&auml; varten &quot;ty&ouml;p&ouml;yd&auml;ll&auml;&quot; on lis&auml;ksi Windowsin K&auml;ynnist&auml;-valikon (Start) yksinkertainen vastine. Tekstieditoreiksi tarjotaan komentorivi-edi&auml; sek&auml; Emacs-tyylist&auml; Jovea. Tietysti koodia voi v&auml;&auml;nt&auml;&auml; Linux-puolella mill&auml; tahansa editorilla.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Mit&auml; SDK:lla sitten voi tehd&auml;?</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Selke&auml;st&auml; ja avoimesti my&ouml;nnetyst&auml; keskener&auml;isyydest&auml;&auml;n huolimatta Amiga Software Development Kit 1.0 osoittautui ehdottomasti postiiviseksi kokemukseksi. Virtuaaliprosessori ja AVE ovat jo siin&auml; vaiheessa, ett&auml; ohjelmoinnissa p&auml;&auml;see hyv&auml;&auml;n alkuun, ja j&auml;rjestelm&auml;n uudet k&auml;sitteet kuten ty&ouml;kalut tulevat tutuiksi. Toisaalta jos haluaa olla etunen&auml;ss&auml; kokeilemassa uudelle Amigalla kehiteltyj&auml; ohjelmia, on SDK toistaiseksi ainoa tapa.
						<p>Internetiin onkin jo ilmestynyt useita ohjelmia, joita SDK:lla on parsittu kasaan. Seuraamme Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n kotisivuilla uuden Amigan orastavaa ilmaisohjelmatarjontaa kokeiluluontoisesti vuoden loppuun saakka viikon namupalojen muodossa. Esittelemme siis joka viikko yhden Amiga SDK:lla kehitetyn ilmaisohjelman osoitteessa <a href="http://batman.jytol.fi/~saku/" target="_blank">http://batman.jytol.fi/~saku/</a> tai <a href="http://tzimmola.tky.hut.fi/saku/" target="_blank">http://tzimmola.tky.hut.fi/saku/</a>.</p>
						<center>
							<p><a href="kuvat/ohjelmia_iso.jpg" target="_blank"><img height="295" width="380" src="kuvat/ohjelmia.jpg" border="0" alt=" "></a></p>
						</center>
						<p>Amiga SDK:n mukana tulee my&ouml;s Intentin J-Engine, eritt&auml;in nopea Java-virtuaalikone, jolla sopii py&ouml;ritell&auml; Java-sovelluksia ja -sovelmia lupausten mukaan kiitett&auml;v&auml;ll&auml; nopeudella. Amiga onkin mukana devicetop.com-portaalihankkeessa, joka tarjoaa levityskanavia ja foorumeita Java-ohjelmille ja -ohjelmoinnille. Amiga SDK:sta pit&auml;isi siis Java-ohjelmienkin saada uutta potkua. Muutamat kokeilut sovelmien (applet) kanssa tuottivat tosin l&auml;hinn&auml; harmaita hiuksia: ne eiv&auml;t suostuneet k&auml;ynnistym&auml;&auml;n.</p>
						<p>Mainittakoon lopuksi viel&auml; Amigan jo useita kertoja ilmoittama virhe SDK:n lisenssiehdoissa: Amigalle ei tarvitse maksaa rojalteja ohjelmien tekemisest&auml; tai myynnist&auml;, vaikka lisenssiehdoissa n&auml;in virheellisesti sanotaankin. Sen sijaan Amiga tulee aikanaan tarjoamaan vapaaehtoista, maksullista &quot;Amigan tukema ohjelma&quot; -markkinointikampanjaa. Vastaaviahan on Microsoftilla ja monilla muilla, tosin Amiga lupailee ehtojensa olevan reilumpia. Korjattu lisenssiteksti l&ouml;ytyy osoitteesta: <a href="http://www.amigadev.net/index.php?sid=&subpage=home&function=legal" target="_blank">http://www.amigadev.net/index.php?sid=&amp;subpage=home&amp;function=legal</a></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Nimien taikaa</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Joka tapauksessa toivoa sopii, ett&auml; lopullisen uuden AmigaOS:n (tai miksi sit&auml; sitten kutsutaankaan) ilmestyess&auml; teknologian ja tuotemerkkien nime&auml;minen on kiinnitetty ja yhten&auml;istetty. P&auml;&auml; menee py&ouml;r&auml;lle jo pelk&auml;st&auml; nimilistojen tavailusta, kun Taolla on tuotteilleen monta, osin p&auml;&auml;llekk&auml;ist&auml; nime&auml;, Amigalla on samoille nimille synonyymit, ja sitten on viel&auml; joukko uusia ja vanhoja tuotenimi&auml;.
						<p>Yritet&auml;&auml;n viel&auml; kerran saada jotain selkoa t&auml;st&auml;: Uusi Amigan k&auml;ytt&ouml;j&auml;rjestelm&auml; ja sen ymp&auml;r&ouml;im&auml; digitaalisen tiedon ja saumattoman laitteiston yhteispelin nimi on Amiga DE eli Amiga Digital Environment, koodinimelt&auml;&auml;n Ami, joka lausutaan Amie. Amiga DE:n pohjalla laitteiston p&auml;&auml;ll&auml; on Amiga Foundation Layer eli Tao Groupin Intent Java Technology Edition, joka siis sis&auml;lt&auml;&auml; Intent-kirjastot (jotka sis&auml;lt&auml;v&auml;t J-Engine-Java-virtuaalikoneen) ja Elate-reaaliaikak&auml;ytt&ouml;j&auml;rjestelm&auml;n.</p>
						<p>Osa Amiga Foundation Layeria (AFL) on AVE eli Audio Visual Environment eli Amiga Multimedia Toolkit, ja Amiga kehitt&auml;&auml; uusia osia t&auml;h&auml;n kerrokseen, mm. AOM eli Amiga Object Model. BOOPS taas on Classic Amigalta portattujen BOOPSI-k&auml;ytt&ouml;liittym&auml;kirjastojen koodinimi. AFL:n p&auml;&auml;ll&auml; on Amiverse Layer, lyhyesti vain Amiverse, eli digitaalisen tiedon kerros, joka on Amiga DE -piirakan t&auml;ysin laitteistosta ja tiedon teknisest&auml; luonteesta piittaamaton digitaalisen informaation leikkikentt&auml;kerros.</p>
						<p>AmigaOne sitten on ensi vuoden ensimm&auml;isell&auml; nelj&auml;nneksell&auml; julkaistava Amiga DE:hen perustuva tietokone. Ja Amiga SDK (Software Development Kit), kuten lienee jo selv&auml;&auml;, on t&auml;m&auml;n nimih&auml;ss&auml;k&auml;n ohjelmistojen t&auml;m&auml;nhetkinen kehitysymp&auml;rist&ouml;. d'Amiga taas on SDK:ta varten ker&auml;tyn spesifikaation mukaan rakennettu Linux-PC, joka sis&auml;lt&auml;&auml; SDK:n.</p>
						<p>Nimityst&auml; AmigaOS ei uudesta Amiga-k&auml;ytt&ouml;j&auml;rjestelm&auml;st&auml; kenties k&auml;ytet&auml; lainkaan. My&ouml;s Gatewayn ajoilta tuttua AmigaOE-nimityst&auml; (Operating Environment) on v&auml;l&auml;ytelty erin&auml;isiss&auml; foorumeissa, mutta Amiga DE lienee sen korvaava ilmaus.</p>
						<p>Kysytt&auml;v&auml;&auml;?</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Linkkivinkkej&auml;</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Ep&auml;viralliselta Amiga SDK -sivustolta l&ouml;yd&auml;t paljon lis&auml;tietoa, linkkej&auml;, yms.: <a href="http://www.amigasdk.com" target="_blank">http://www.amigasdk.com</a>
						<p>Amigan virallinen Amiga World -lehtinen valottaa taustoja muutaman kuukauden v&auml;lein:<br>
						<a href="http://www.amiga.com/press/zine/" target="_blank">http://www.amiga.com/press/zine/</a></p>
						<center>
							<p><img height="176" width="298" src="kuvat/ibm.gif" border="0" alt=" "></p>
						</center>
						<p>IBM DeveloperWorksin Amiga SDK -artikkeli kertoo yksityiskohtia ja auttaa asennuksessa:<br>
						<a href="http://www-4.ibm.com/software/developer/library/amiga2/index.html?dwzone=linux" target="_blank">http://www-4.ibm.com/software/developer/library/amiga2/index.html?dwzone=linux</a></p>
						<p>Open Amiga -postituslista on keskustelufoorumi uudesta Amigasta kiinnostuneille:<br>
						s&auml;hk&ouml;postia osoitteeseen <a href="mailto:open-request@amiga.com">open-request@amiga.com</a>, viestiin sana subscribe</p>
						<p>My&ouml;s devicetop.comin Amiga-foorumit sis&auml;lt&auml;v&auml;t keskustelua Amiga SDK:sta:<br>
						<a href="http://www.devicetop.com/dt/main" target="_blank">http://www.devicetop.com/dt/main</a></p>
						<p>Valmiita vastauksia erin&auml;isiin SDK:ta koskeviin kysymyksiin l&ouml;ytyy Amigan FAQ:sta:<br>
						<a href="http://www.amiga.com/faq.html" target="_blank">http://www.amiga.com/faq.html</a></p>
						<p>Erityisen hy&ouml;dyllinen poiminta SDK:n FAQ:sta sis&auml;lt&auml;&auml; ohjekirjan virheiden korjauksia:<br>
						<a href="http://www.amiga.com/cgi-bin/fom.cgi?file=54&step=mainMenu" target="_blank">http://www.amiga.com/cgi-bin/fom.cgi?file=54&amp;step=mainMenu</a></p>
						<p>Amiga SDK:n tuotekuvaus:<br>
						<a href="http://www.amiga.com/products/SDK.shtml" target="_blank">http://www.amiga.com/products/SDK.shtml</a></p>
						<p>Amigan virallinen developer-sivusto tarjoaa SDK:n omistajille tukea ja ohjelmia:<br>
						<a href="http://www.amigadev.net" target="_blank">http://www.amigadev.net</a></p>
						<p>Tao Group, uuden AmigaOS:n perustan luojat l&ouml;ytyv&auml;t osoitteesta:<br>
						<a href="http://www.tao-group.com" target="_blank">http://www.tao-group.com</a></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.amiga.com" target="_blank">Amiga Inc.</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Edustaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.ge.vip.fi" target="_blank">Gentle Eye Ky</a>, puh. (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">850 markkaa</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Testattu: AMD K6-2 333 MHz, RedHat Linux 6.2, 128 Mt muistia, 47 Gt kiintolevytilaa, Creative Labs Graphics Blaster Riva TNT -n&auml;yt&ouml;nohjain, D-Link DE-528CT-verkkokortti, Nokia Multigraph 449M -n&auml;ytt&ouml;.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
