<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Vakiot</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Vakiot</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Posti</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Kirjeit&auml; toimitukselle</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Aikalis&auml; artikkelien kirjoittamiseen<br>
							<br>
							Alkuinnostuksen j&auml;lkeen sai taas huomata, ett&auml; kev&auml;t kiireineen sai ajan siivilleen, eik&auml; t&auml;ss&auml; kerke&auml; kunnon artikkeleita kirjoittelemaan eik&auml; etenk&auml;&auml;n viimeistelem&auml;&auml;n.<br>
							<br>
							Jonkin verran olen kerinnyt OS 3.9:st&auml; nautiskella, mutta en mit&auml;&auml;n isompaa tekem&auml;&auml;n. Todella miellytt&auml;v&auml;&auml; vaihtelua Windows-maailmalle kuitenkin. Ja OS 3.9 on todellakin stabiilimpi kuin aikaisemmin k&auml;ytt&auml;m&auml;ni OS 3.5. Toisaalta mukana on joitain hassuja bugeja, joita 90-luvun alkupuolella ei Amigan k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml;n olisi p&auml;&auml;ssyt lipsahtamaan.<br>
							<br>
							OS 3.9:n laajentaminen t&auml;yteen vireeseen ja sovellusten asentaminen t&ouml;kkii. Ja t&ouml;kkiminen johtuu siit&auml;, ett&auml; paappa on kuin onkin unohtanut paljon asioita. Vaatii huomattavan paljon tietoa ett&auml; saa koneen kasattua, k&auml;ytt&ouml;j&auml;rjestelm&auml;n asennettua sek&auml; jonkin sovelluksen asennettua. Viimeksi miltei meni hermot, kun k&auml;mmenkonetta varten asensin Spitfire -ohjelmiston. Seh&auml;n alkoi vaatia MUI 3.8:aa eik&auml; senk&auml;&auml;n asennuksen j&auml;lkeen viel&auml; toiminut. Kokeilen uudestaan joku toinen p&auml;iv&auml;. Ei siis ole j&auml;rin kummallinen n&auml;ky, jos joku joskus Amigan foorumeilla &quot;iskee hanskat tiskiin&quot; ja valitsee helpomman harrasteen, kuten XBOX:lla pelaamisen. ;-)<br>
							<br>
							AmigaOS:iin liittyvien artikkeleiden kirjoittaminen saa kyll&auml; jatkoa aikanaan. Muutoksia systeemiini tulee siit&auml; ett&auml; muutan uudelleen koneeni konfiguraatiota: en j&auml;t&auml;k&auml;&auml;n Amiga 4000 -koneeseeni 20 gigatavun kovalevy&auml;, vaan siirr&auml;n sen verkkoserveriini. Lis&auml;ksi vaihdan 50x-romppuaseman tilalle hitaamman ja hiljaisemman. Kunhan virittelen Amiga 4000:n partitiot uuteen j&auml;rjestykseen, palaan kirjoittamaan tarkennuksia ja lis&auml;yksi&auml; AmigaOS 3.9 -juttuuni. Voi toki k&auml;yd&auml; niinkin, ett&auml; kun AmigaOS 4 ja AmigaOne saapuvat minulle, kirjoittelen sitten niist&auml; ja OS 3.9 unohtuu... Toivottavasti AmigaOS 4 sis&auml;lt&auml;&auml; kuitenkin mahdollisimman paljon tuttuja ja hyv&auml;ksi koettuja AmigaOS 3.x -ominaisuuksia.<br>
							<br>
							Ja tottahan niit&auml; muitakin harrasteita olla pit&auml;&auml;. Itse kun ryydyn pitk&auml;t viikot Windows-koneen &auml;&auml;ress&auml; t&ouml;iss&auml;, saan hermolepoa ja mielen virkeytt&auml; Amigaa r&auml;pl&auml;&auml;m&auml;ll&auml;, mutta se ei yksin riit&auml;. Jotta jaksaa heilua ne pitk&auml;t ty&ouml;p&auml;iv&auml;t ja viikot, t&auml;ytyy huolehtia my&ouml;s fysiikastaan, ei saa unohtua h&ouml;rh&ouml;ilem&auml;&auml;n kaiket ajat tietokoneen &auml;&auml;ress&auml;. Siin&auml; alkaa ennen pitk&auml;&auml; iso hihna luistaa.<br>
							<br>
							N&auml;in kes&auml;n tullen suosittelen l&auml;mm&ouml;ll&auml; py&ouml;r&auml;ily&auml; tai lenkkeily&auml; ep&auml;m&auml;&auml;r&auml;isill&auml; mets&auml;reiteill&auml;. Edullinen, monipuolinen ja hauska harrastus n&auml;ytt&auml;isi olevan my&ouml;s kanoottimelonta. Varmaan kaikista v&auml;h&auml;nk&auml;&auml;n isommista kaupungeista l&ouml;ytyy melontaseuroja, joilta saa lainata kalusteita todella edullisesti, jopa ilmaiseksi. Lis&auml;ksi seurat j&auml;rjest&auml;v&auml;t upeita retki&auml; luonnon keskelle. Kolme viikkoa sitten vaimon kanssa liityttiin oululaiseen <a href="http://www.kc.fi/" target="_blank">K&amp;C-seuraan</a>. Pari kertaa harjoiteltiin melontaa, ja viime lauantaina laskettiin Kutujokea ja 11 koskea!!! Upeaa, kerta kaikkiaan.<br>
							<br>
							Nyt kun AmigaOne ja AmigaOS 4 eiv&auml;t ole viel&auml; saapuneet kauppoihin, on erinomainen hetki nautiskella kes&auml;st&auml; ja katsoa el&auml;m&auml;&auml; Amiga-harrasteen ulkopuolella. Syksyn ja uusien Amiga-vehkeiden my&ouml;t&auml; ei sitten en&auml;&auml; ehk&auml; ihan heti huomaa edes ikkunasta ulos katsoa...<br>
							<br>
						</font>
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Kimmo Kannala, aboxb@nic.fi</b><br>
								<br>
							</font></p>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">
							<hr>
							<br>Kiitos pitk&auml;st&auml; viestist&auml;si. Amiga-rintama tosiaan el&auml;&auml; nyt odottavaa vaihetta, kun yksi ja toinen uusi tuote pit&auml;isi olla juuri tulollaan hetken&auml; min&auml; hyv&auml;ns&auml;, mutta mit&auml;&auml;n vain ei n&auml;yt&auml; tapahtuvan. Odotettuhan t&auml;ss&auml; toisaalta on jo vuosikymmen, mutta ensimm&auml;ist&auml; kertaa tuotteista on olemassa jo muutakin kuin pelk&auml;t kuoret tai lupauksia. Yhdistys odottaa uutuuksia v&auml;hint&auml;&auml;n yht&auml; kiihke&auml;sti kuin j&auml;senetkin - olisihan meill&auml; sitten taas esitelt&auml;v&auml;&auml; mahdollisessa uudessa Saku-tapaamisessa.<br>
							<br>
							Odotellen,<br>
							<br>
							<b>Anu&nbsp;Seilonen</b></font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Posti-palstalla julkaistaan lukijoiden </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">kirjeit&auml; ja vastataan niihin. Voit l&auml;hett&auml;&auml; toimitukseen postia seuraaviin </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">osoitteisiin.<br>
							<br>
							
							Saku<br>
							
							c/o Anu Seilonen<br>
							
							Sammaltie 51<br>
							
							90650 Oulu<br>
							<br>
							
							Internet: <a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a><br>
							
							Sakunet: 65:10/6.0 (Anu Seilonen)<br>
							
							BBS: Amiga Zone, (017) 611 015 (24h)</font></td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Vakiot</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a></font></td>
				</tr>
			</table>
		</center>
	</body>

</html>