<HTML>
<HEAD>
<TITLE>APC & TCP</TITLE>
</HEAD>
<BODY TEXT=black link=blue alink=red bgcolor=white>
<CENTER>
</CENTER>

<P><H1>Antworten f&uuml;r die Helpline</H1></P>


 Viel kann ich ja nicht beantworten, aber ich gebe mir M&uuml;he...<P>

 <FONT COLOR ="#FF0000" SIZE=+1>Antwort f&uuml;r Bejamin Denke:</FONT><P>

 Qu*ke wird es sehr warscheinlich auch in Deutschland geben! Nat&uuml;rlich
 nicht im freien Verkauf/Handel, sondern nur unter der Ladentheke. Ich
 habe z.B. mal bei Oberland angefragt.  Diese  wollen  Qu*ke  auch  in
 Deutschland   verkaufen   -   gegen   Altersnachweis  in  Form  einer
 Ausweiskopie! Ich war n&auml;mlich auch schon kurz davor, mir das Spiel in
 Kanada  vorzubestellen,  aber  das war mir zu kompliziert und so habe
 ich mich eben um eine Alternative gek&uuml;mmert.<P>

 Hoffe, geholfen zu haben.<P>

 <HR><BR>
 <FONT COLOR ="FF0000" SIZE=+1>Antwort f&uuml;r Marcus Castro Y Castro:</FONT><P>

 3.  Du  kannst  PC-Diskettenlaufwerke  mit  dem  Catweazle  am  Amiga
 benutzen.  Eine  andere  M&ouml;glichkeit  ist mir nicht bekannt. Getestet
 habe ich den Catweazle pers&ouml;nlich auch noch nicht, deshalb  kann  ich
 Dir  nicht sagen, ob es da Probleme mit Trackloadern gibt -> aber ich
 gehe mal davon aus, DASS es Probleme geben wird!<P>

 4. Du kannst den Nescape Navigator mit einem &quot;Shift-Klick&quot; &uuml;berreden,
 lha-Dateien   im   Bin&auml;rformat   runterzuladen.   Also  einfach  eine
 Shift-Taste gedr&uuml;ckt halten, w&auml;hrend Du  auf  den  Link  (die  Datei)
 klickst.<P>

 5. Die HD-Toolbox ist sehr  &quot;handy&quot;  (=unerl&auml;sslich),  wenn  Du  eine
 PC-Festplatte im Amiga benutzen willst... Bist Du sicher, da&szlig; sie bei
 Dir nicht dabei war? Hast Du schon s&auml;mtliche Disketten  (WB,  Extras,
 Install,  Storage,  Fonts,  Locale)  durchsucht?  Da  ist sie n&auml;mlich
 normalerweise dabei.<P>

 Hoffe, geholfen zu haben.<P>

 <HR><BR>
 <FONT COLOR ="#FF0000" SIZE=+1>Antwort f&uuml;r Sieglinde Peters:</FONT><P>

 Du  kannst  z.B.  auch  die  Monitor-Treiber   Euro72:Multiscan   und
 Multiscan:Productivity beim 1438 benutzen. M:P hat eine Aufl&ouml;sung von
 640X480 bei ca. 60Hz. E:M hat eine Aufl&ouml;sung  von  640X400  bei  etwa
 70Hz. Beser als die PAL-Treiber sind beide auf jeden Fall. Da Du vorher mit
 PAL und deshalb mit 50Hz gearbeitet hast, gehe ich mal davon aus, da&szlig;
 Dir die 60Hz von M:P reichen. Dann hast Du n&auml;mlich auch eine  relativ
 gro&szlig;e   Workbench.   Ich   f&uuml;r  meinen  Teil  bevorzuge  eine  h&ouml;here
 Wiederholfrequenz, also E:M mit 70Hz, weil ich  von  der  Grafikkarte
 sehr verw&ouml;hnt (100Hz non-interlaced bei 800X600) worden bin...<P>

 Ach ja, Du solltest auch mal testen, den VGA-only  Treiber  mit  nach
 Devs:Monitors  zu kopieren. Auf meinem 1438 (den ja jetzt ein anderes
 Clubmitglied besitzt)  hatte  ich  dadurch  viel  schmalere  schwarze
 Streifen an den R&auml;ndern. Mu&szlig;t Du einfach mal testen.<P>

 Hoffe, geholfen zu haben.<P>

 <HR><BR>
 <a href=&quot;mitglieder/etzrodt.html&quot;>Andreas Etzrodt </a> <BR>
 <a href=&quot;mailto:shark@nwn.de&quot;>  E-Mail: shark@nwn.de</a><P>


</P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
