<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<TITLE>Amiga-Club im BTX und Internet - Bericht vom Clubtreffen</TITLE>
<!-- Page created by Sigmar Tode -->
</HEAD>
<BODY TEXT="black" LINK="blue" ALINK="red" VLINK="purple"  BACKGROUND="st_actreffen.gif">

<BR>
<BR>
<CENTER><B><FONT SIZE=+2>Clubtreffen 1998 in Friedrichroda</FONT></B></CENTER>
<P><BR>


Einige werden es mitbekommen haben, vom 27. - 29. M&auml;rz fand das Clubtreffen der "Konkurrenz",
des <A HREF="http://www.amiga-club.de/">"Amiga-Club im BTX und Internet"</A>, in Friedrichroda / Th&uuml;ringen, statt.<P>

Friedrichroda liegt unweit von<A HREF="http://www.erfurt.de/"> Erfurt</A>. 2 km vom
Veranstaltungsort entfernt, befindet sich die wundersch&ouml;ne Marienglash&ouml;hle. Also Kultur inklusive.
<P>
Freitag Mittag fanden sich die ersten Amiga-Begeisterten ein. Bis zum Abend f&uuml;llte sich der Saal auf
ca. 20 - 25 Amigas und knapp 30 Clubbies. Trotz der gro&szlig;en Mitgliedszahl hat sich die Anzahl derer,
die die M&uuml;hen, ihr Equipement aus dem ganzen Bundesgebiet zum jeweiligen Veranstaltungsort zu bugsieren,
nicht scheuen, auf diesem Wert eingepegelt.<BR>
Neben einem regen Erfahrungsaustausch, dieses Mal haupts&auml;chlich zum Thema Internet, hielten auch einige
Clubbies interessante Vortr&auml;ge bzw. Workshops.<BR>

Clubbie Kalle erkl&auml;rte die Konfiguration des WB-Ersatzes <A HREF="http://www.aliendesign.net/programs/scalos">Scalos</A>
und verkaufte bei Bedarf auch gleich die Keys.<BR>
Talleyr f&uuml;hrte ihr Architekturprogramm <A HREF="http://cycas.core.de/"> Cycas </A>vor, mit dem sie den deutsch-
&ouml;stereichischen Hochschulpreis gewann und bewies damit, wie leicht es ist, ein Haus mit dem Amiga zu bauen.<BR>

Vincent erl&auml;uterte, wie und warum alle im Internet verbundenen Computer verbissen versuchen, den <A HREF="http://rc5.distributed.net/">
RC5-64-Key</A> zu knacken.
<P>
Desweiteren wurde die erste Club-CD vorgestellt. Ja, ich wei&szlig; der APC&TCP ist da weiter, hat aber auch andere
Schwerpunkte.
<P>
W&auml;hrend des Treffens in Friedrichroda wurde das j&uuml;ngste Kind des Clublebens der &Ouml;ffentlichkeit vorgestellt: <A HREF="http://www.amiga-club.de/aida/index.html">AIDA</A>
(Aktuelle Informationen in Deutsch zum Amiga). AIDA hat sich zum Ziel gesetzt, Informationen, die von den Amiga Inc. - Mitarbeitern
in Englisch herausgegeben werden, ins Deutsche zu &uuml;bersetzen. Der Anfang wurde mit der &Uuml;bersetzung der Rede
Jeff Schindlers, anl&auml;&szlig;lich der "Gateway Amiga 98", in St. Louis, gemacht.
<P>
Am Samstag besuchten uns einige Mitglieder des <A HREF="http://www.rz.tu-ilmenau.de/~stoetzer/azt/">Amiga Zentrums Th&uuml;ringen</A> und
stellten auch noch einige Preise f&uuml;r die Tombola zur Verf&uuml;gung.<BR>
Au&szlig;erdem freuten wir uns &uuml;ber den Besuch von <A HREF="http://www.owi.de/">Olaf Winkler</A>, derselbe welcher f&uuml;r die
Computer-Seiten im VIVA-Text, sowie etliche Berichte in der Amiga-Plus verantwortlich zeichnet. Dank seiner fotografischen
K&uuml;nste, wird sicher das eine oder andere Konterfei, in einer der n&auml;chsten Ausgaben der A-Plus zu bewundern sein.<P>

Samstag Abend fand dann die Verlosung statt. Viele Sponsoren hatten sich dankenswerterweise dazu durchgerungen, Sachpreise
zur Verf&uuml;gung zu stellen. So z.B. Ossowski, Eagle, SiegfriedSoft, Haage usw.. Der Hauptgewinn war &uuml;brigens ArtEffekt 2.5.<BR>
Bis auf einen, lie&szlig;en sich die Sponsoren nicht lumpen. In einem wahnwitzigen Anfall von Spendierwut, stellte uns
Phase5 2 T-Shirts zur Verf&uuml;gung...<P>

Der Veranstaltungsort war &uuml;brigens eine Jugendherberge, in der wir auch hervorragend verpflegt wurden. Am Sonntag fand
noch ein gemeinsames Mittagessen in einer Gastst&auml;tte statt, bevor schlie&szlig;lich alle den Heimweg antraten.<br>
Es ist doch jedesmal interessant Leute kennenzulernen, denen man sonst nur per Tastatur "begegnet".
<p>

Siggi<p>


 Sigmar Tode<br>
 phone: +49 (0) 34 91 41 17 69<br>
 e-mail: STLuWiSaAn@t-online.de   <br>
 homepage (Blondinenwitze):           <br>
 http://home.t-online.de/home/STLuWiSaAn/<br>
 Mitglied im AmigaClub im BTX: Ayvalik       <br>

</FONT>
</CENTER>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</BODY>
</HTML>
