<HTML>
<HEAD>
<TITLE>APC & TCP</TITLE>
</HEAD>
<BODY TEXT=black link=blue alink=red bgcolor=white>
<CENTER>
</CENTER>

<P><H1><FONT COLOR ="#FF0000">Damals - vor 14 Jahren</FONT></H1><P>


 Diesen Monat m&ouml;chte ich eine  neue  Rubrik  einf&uuml;hren.  Als  ich  vor
 kurzem  in meinem Zimmer etwas aufr&auml;umen und die alten &quot;Chip&quot;, &quot;C't&quot; und
 PC-Direkt" wegschmei&szlig;en wollte,  sind  mir  doch
 tats&auml;chlich  noch  uralte &quot;Happy Computer&quot; in die H&auml;nde gefallen, die
 ich  schon  l&auml;ngst  vergessen  hatte...  Uralt  ist   hierbei   nicht
 &uuml;bertrieben,  da  die &auml;lteste Zeitschrift von Juli 1984 stammt - also
 fast 14 Jahre alt ist! Im Computerbereich sind 14 Jahre  ja  wirklich
 eine Ewigkeit. Ich wette, da&szlig; viele NC-Leser von den meisten Computer
 noch nie etwas geh&ouml;rt haben, &uuml;ber die in der Happy Computer vom  Juli
 1984  berichtet  wird. Nat&uuml;rlich kenne auch ich nicht jeden Computer,
 aber praktische Erfahrung habe  ich  zumindest  auch  mit  einem  <FONT COLOR ="#0000FF">C64</FONT>
 (klar,  oder?),  einem  <FONT COLOR ="#0000FF">Texas Instruments TI99/4A</FONT> und einem <FONT COLOR ="#0000FF">Schneider
 CPC664</FONT>. Au&szlig;erdem sind  mir  die  meisten  Computer  aus  dieser  Zeit
 wenigstens  vom  Namen  her ein Begriff. Wer kennt denn z.B. noch den
 <FONT COLOR ="#0000FF">Dragon 32 oder 64</FONT>? Oder den <FONT COLOR ="#0000FF">Sinclair ZX81 oder Spectrum?</FONT> <P>

 Was ich also vorhabe? Ich m&ouml;chte Euch einen kleinen  R&uuml;ckblick  geben
 auf die gute alte Homecomputer-Zeit, wo PCs noch keinerlei Konkurrenz
 f&uuml;r die damals aktuellen "Microcomputer" waren. So versuche  ich,  in
 jeder  Ausgabe der NC einen kleinen Bericht zur Lage der Homecomputer
 in den 80ern zu verfassen. Pro Ausgabe der NC kommt eine Ausgabe  der
 Happy  Computer  zum  Zuge.  So  k&ouml;nnt Ihr Euch in dieser Ausgabe auf
 einen Bericht &uuml;ber die heile Computerwelt von 1984 freuen. Als erstes
 werde  ich  wohl  ein  paar  W&ouml;rter &uuml;ber die damals &uuml;blichen Computer
 loslassen.  Dann  sollten   noch   die   damals   aktuellen   Preise,
 Anwendungsprogramme   und  nat&uuml;rlich  Spiele genannt werden. Einen kleinen Scan der Titelseite  der  Ausgabe  7/84
 habe  ich  beigelegt.  Mal  sehen, ob er mit in die NC findet. Leider
 sind meine Quellen nicht l&uuml;ckenlos:<P>

 So habe ich aus dem Jahre 1984 nur die  Juli-Ausgabe  (7).  Aus  1985
 habe  ich  nur die Mai-Ausgabe (5). Von 1986 besitze ich die Ausgaben
 M&auml;rz, April und Mai (3-5). Dann kommt  eine  gr&ouml;&szlig;ere  L&uuml;cke  bis  zum
 Jahre  1988, wovon ich die Ausgaben f&uuml;r August, November und Dezember
 mein Eigen nennen darf.  Den  Jahrgang  1989  besitze  ich  komplett.
 Leider  wurde  dann  die  Happy  Computer  eingestellt  und daf&uuml;r die
 Computer  Live  eingef&uuml;hrt,  die  sich  fast   nur   noch   mit   PCs
 besch&auml;ftigte.

 <P><HR><BR>



 <H2><FONT COLOR ="#FF0000">Happy Computer vom Juli 1984</FONT></H2><P>

 <IMG SRC="st_damals.jpg" WIDTH=160 HEIGHT=220 ALIGN=left HSPACE=15 VSPACE=15>
 1984 kostete die Welt (der Computer) noch l&auml;cherliche  5,-  DM.  Dies
 sollte  sich  aber  bis  zur  n&auml;chsten  Ausgabe  -  bzw. zur n&auml;chsten
 Ausgabe, die  ich  besitze  -  &auml;ndern.  Daf&uuml;r  bekam  man  dann  eine
 vollst&auml;ndig in Farbe gedruckte Zeitschrift mit 184 Seiten Umfang.<P>

 Die damals aktuellen Computer habe ich eigentlich oben schon genannt:
 das  waren  vor  allem  der  seit  etwa  einem  Jahr  in  Deutschland
 erh&auml;ltliche <FONT COLOR ="#0000FF">Commodore 64</FONT>, dessen Vorg&auml;nger <FONT COLOR ="#0000FF">VC20</FONT>, der <FONT COLOR ="#0000FF">Apple II</FONT> und der
 <FONT COLOR ="#0000FF">Sinclair  Spectrum</FONT>. Soweit ich mich erinnere war dem <FONT COLOR ="#0000FF">TI 99/4A</FONT> nie der
 rechte Erfolg beschieden. Der <FONT COLOR ="#0000FF">ZX81</FONT> wurde zu  dieser  Zeit  schon  als
 Bausatz f&uuml;r 98,-DM (inklusive Z80A-Prozessor, 8kb ROM und sagenhaften
 1kb RAM) angeboten. Andere Computerhersteller, wie z.B. Sharp mit dem
 <FONT COLOR ="#0000FF">MZ700</FONT>,  Sinclair  mit dem <FONT COLOR ="#0000FF">QL</FONT>, Apple mit dem <FONT COLOR ="#0000FF">IIc</FONT>, <FONT COLOR ="#0000FF">Aquarius</FONT>, Tatung mit
 dem <FONT COLOR ="#0000FF">Einstein</FONT>, der <FONT COLOR ="#0000FF">Genie III</FONT>, der  <FONT COLOR ="#0000FF">Oric  Atmos</FONT>,  der  <FONT COLOR ="#0000FF">Enterprise</FONT>,  der
 <FONT COLOR ="#0000FF">Laser  310</FONT>  oder  Dragon  mit  dem  <FONT COLOR ="#0000FF">Dragon  32 oder 64</FONT> hatten weniger
 Erfolg. Ja, selbst die heutzutage so erfolgreiche Firma  Sony  erlitt
 mit  ihrem <FONT COLOR ="#0000FF">MSX</FONT>-Computer (wie alle MSX-Hersteller) in Deutschland eine
 Bauchlandung. Daf&uuml;r war auch damals schon Atari mit dem <FONT COLOR ="#0000FF">600  und  800</FONT>
 auf  dem  Markt.<P>

 Der <FONT COLOR ="#0000FF">Schneider CPC 464</FONT>  war  mit  seinem  mitgelieferten  Monitor  und
 eingebautem  "Tapestreamer"  (ok,  es  war  ein Massenspeicher, der -
 genau wie beim <FONT COLOR ="#0000FF">C64</FONT> die Datasette - irre langsam war) schon fast  eine
 Ausnahme, wo doch so gut wie alle Computer am Fernseher anzuschlie&szlig;en
 waren. Doch war dieser Computer weit  verbreitet,  weil  er  in  sehr
 gutes Basic hatte. Im Gegensatz zum eher leistungsschwachen <FONT COLOR ="#0000FF">C64</FONT>-Basic
 V2.0 hatte das "Locomotive Basic" (oder  so  &auml;hnlich)  des  Schneider
 einige  Vorz&uuml;ge,  wie mehr und bessere Befehle. Das war auch fast der
 einzige  Grund,  weshalb  dieser  nicht  sofort  in  der   Versenkung
 verschwand.<P>

 <HR><BR>
 Das Titelthema dieser Ausgabe  ist  der  Test  des  "Hochleistungs  -
 Heimcomputers"  <FONT COLOR ="#0000FF">Dragon  64</FONT>.  Die Ausstattung dieses Computers war wie
 folgt:<P>

 <UL>

 <LI>CPU 6809E, eine CPU, die extern mit 8Bit und intern mit  16Bit  arbeitete
 und normalerweise nur in Industrieger&auml;ten Einsatz fand.<P>

 <LI>RAM 64 kByte, wovon f&uuml;r BASIC-Programme ca. 46  kByte  zur  Verf&uuml;gung
 standen.  Eine  unsch&ouml;ne  Eigenart war, da&szlig; der <FONT COLOR ="#0000FF">Dragon 64</FONT> die gleiche
 Speichereinteilung wie sein Vorg&auml;nger, der <FONT COLOR ="#0000FF">Dragon  32</FONT>  hatte.  Wollte
 man auf die h&ouml;heren 32kB im Speicher zugreifen, mu&szlig;te man umst&auml;ndlich den
 Befehl "EXEC 48000" eingeben, wodurch man aber das  Diskettenlaufwerk
 nicht mehr benutzen konnte...<P>

 <LI>Betriebssystem  OS9,  einer  UNIX-Variante  (es  lebe
 LINUX!),  die  es  laut  Hersteller  durch Multiuserf&auml;higkeiten sogar
 erlauben sollte, ein Mehrplatzsystem  aufzubauen.  Man  bedenke:  wir
 schrieben das Jahr 1984! Als Programmiersprachen wurden damals BASIC
 (wie ja bei fast jedem damaligen Computer), Pascal und - man h&ouml;re und
 staune - C mitgeliefert. Somit schien der <FONT COLOR ="#0000FF">Dragon 64</FONT> seiner Zeit weit
 (zu weit) voraus.<P>

 <LI>Leider war er in der Grafikaufl&ouml;sung nicht sehr  fortschrittlich.  Er
 kannte  3  Aufl&ouml;sungsmodi.  Der  erste Modus hatte eine Aufl&ouml;sung von
 128X96 bei 9 Farben. Der zweite Modus hatte 192X128. Der dritte Modus
 konnte  nur  noch  2 Farben darstellen, hatte aber eine Aufl&ouml;sung von
 256X192 Punkten.<P>

 <LI>Soundm&auml;&szlig;ig war  er  auch  nur  unterer  Durchschnitt  mit  nur  einem
 Soundkanal.<P>

 <LI>Preis 1290,-DM mit OS9-Diskette und Anleitung<P>

 <LI>Eine "Diskettenstation"  mit  184kb  Kapazit&auml;t  konnte  man  f&uuml;r  den
 l&auml;cherlichen Betrag von nochmalig 1290,- DM dazukaufen.<P>

 </UL>

 Als Fazit des Tests war zu  lesen:  "Zusammenfassend  kann  man  aber
 sagen,  da&szlig;  die  Zukunft  des  <FONT COLOR ="#0000FF">Dragon  64</FONT>  weniger  im  Bereich  der
 hobbym&auml;&szlig;igen Anwendung mit Basic liegen d&uuml;rfte, sondern  vielmehr  im
 eher kommerziellen Sektor und als Einstieg f&uuml;r Unix-interessierte."<P>

 <HR><BR>
 Als weitere Newcomer wurden der <FONT COLOR ="#0000FF">C264</FONT> (hie&szlig; er  nicht  sp&auml;ter  Plus4?)
 und der <FONT COLOR ="#0000FF">C16</FONT> von Commodore vorgestellt. Um es einfach zu sagen: beides
 waren Flops hoch 10, obwohl  beide  eine  bessere  Tastatur  und  ein
 besseres BASIC als der <FONT COLOR ="#0000FF">C64</FONT> hatten.<P>

 <HR><BR>

 Der n&auml;chste Test war der des <FONT COLOR ="#0000FF">Apple IIc</FONT>.  Dieser  Computer  sollte  im
 Bereich der professionellen Heimcomputer seine K&auml;ufer finden.<P>

 Ausstattung:<P>

<UL>

<LI> Prozessor 6502 mit 1MHz<P>

<LI> ROM 16 kByte<P>

<LI> RAM 128 kByte<P>

<LI> Betriebssystem CP/M<P>

<LI> Gewicht 3,5KG<P>

<LI> eingebautes Diskettenlaufwerk (5,25" mit 143kb Kapazit&auml;t)<P>

<LI> Aufl&ouml;sung 40X48, 260X192 und 520X192 bei h&ouml;chstens 16 Farben<P>

<LI> Soundkan&auml;le 1<P>

<LI> Der Preis  ohne  Monitor  lag  bei  4.249,92DM.  Zusammen  mit  einem
 9"-Monitor mu&szlig;te man 4.889,46DM hinbl&auml;ttern.<P>

</UL>

 Fazit:  Der  <FONT COLOR ="#0000FF">Apple  IIc</FONT>  wird  seinen  Bruder  <FONT COLOR ="#0000FF">IIe</FONT>  nicht  vom  Markt
 verdr&auml;ngen.   Er   kann   gro&szlig;e  Teile  der  Software  des  <FONT COLOR ="#0000FF">Apple  II</FONT>
 verarbeiten, aber Programme,  die  Zusatzplatinen  ben&ouml;tigen,  k&ouml;nnen
 nicht  benutzt  werden.  F&uuml;r  alle, die sich ein bedienerfreundliches
 Ger&auml;t mit umfangreichem Software-Angeobt w&uuml;nsche, ist der  <FONT COLOR ="#0000FF">Apple  IIc</FONT>
 empfehlenswert.  So  mobil,  wie  er  immer  dargestellt wird, ist er
 nicht, solange man noch eine Steckdose  und  einen  Monitor/Fernseher
 braucht.<P>

 <HR><BR>

<FONT COLOR ="#FF0000" SIZE=+1>Beispiel-Preisliste:</FONT><P>

<TABLE BORDER=10  BORDERCOLORDARK=black BORDERCOLORLIGHT=grey ALIGN=CENTER HEIGHT="100%"
<TR ALIGN=CENTER><TD ALIGN=CENTER Colspan=2 >Preisliste Juli 1984</TH></TR>
<TR><TH ALIGN=LEFT>5,25" Slimeline Diskettenlaufwerk einseitig, einfache Dichte </TH><TH ALIGN=RIGHT>575,- DM </TH></TR>
<TR><TH ALIGN=LEFT>32 kByte RAM-Erweiterung f&uuml;r VC20 </TH><TH ALIGN=RIGHT>179,- DM </TH></TR>
<TR><TH ALIGN=LEFT>Commodore SX64 (hei&szlig;begehrtes Sammlerst&uuml;ck!) </TH><TH ALIGN=RIGHT>2998,- DM </TH></TR>
<TR><TH ALIGN=LEFT>Commodore 64 </TH><TH ALIGN=RIGHT>748,- DM </TH></TR>
<TR><TH ALIGN=LEFT>1541 Floppy f&uuml;r C64 </TH><TH ALIGN=RIGHT>748,- DM </TH></TR>
<TR><TH ALIGN=LEFT BG=green>5,25" Disketten einseitig, doppelte Dichte 10 St&uuml;ck </TH><TH ALIGN=RIGHT>59,- DM </TH></TR>
<TR><TH ALIGN=LEFT>Sinclair Spectrum </TH><TH  ALIGN=RIGHT>389,- DM </TH></TR>
<TR><TH ALIGN=LEFT>Tandy Akustikkoppler AC3 Vollduplex 300 Baud </TH><TH  ALIGN=RIGHT>348,- DM </TH></TR>
<TR><TH ALIGN=LEFT>TA Typenraddrucker (20 Zeichen/Sekunde) </TH><TH  ALIGN=RIGHT>1590,- DM </TH></TR>
</TABLE>
<P>

<HR><BR>

<FONT COLOR ="#FF0000" SIZE=+1>Aktuelle Spielehits:</FONT><P>

 House of  Usher,  Pogo  Joe,  Ultima  2,  Miner  2049er,  Bruce  Lee,
 Encounter,  Quest  for  Tires (eines meiner Lieblingsspiele auf C64),
 PSSST, Manic Miner und Jet Set Willy.<P>

<HR><BR>

 So, das war es diesmal mit meiner R&uuml;ckblende auf das Jahr  1984.  Ich
 hoffe,  es  hat  Euch gefallen. Nat&uuml;rlich bin ich jederzeit offen f&uuml;r
 Anregungen und Verbesserungsvorschl&auml;ge. Schlie&szlig;lich ist dies erst die
 erste  Ausgabe. Bis zum n&auml;chsten Monat mit der Ausgabe 5/85 von Happy
 Computer.<P>

Ciao,<P>

 <HR><BR>
 <a href="mitglieder/etzrodt.html">Andreas Etzrodt </a> <BR>
 <a href="mailto:shark@nwn.de">  E-Mail: shark@nwn.de</a><P>


</P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>

