<HTML>
<HEAD>
<TITLE>APC & TCP</TITLE>
</HEAD>
<BODY TEXT=black link=blue alink=red bgcolor=white>
<CENTER>
</CENTER>

<P><H1>Vorstellung von <FONT COLOR ="#0000FF">HTML-HAI</FONT></H1></P>


Nachdem ich nun die ersten Texte f&uuml;r die HTML-NoCover fertig hatte, merkte
ich sofort, da&szlig; die Methode, Sonderzeichen zu &quot;beschreiben&quot; (z.B. ein &auml;
als &amp;auml;) sehr langweilig ist. Mit &quot;langweilig&quot; meine ich: wer hat schon
Lust, jedes Sonderzeichen in der HTML-Form zu schreiben? Aber auch die M&ouml;glichkeit,
es per &quot;Suchen und ersetzen...&quot; vom Texteditor erledigen zu lassen, konnte
mich nicht bannen - denn bei 11 Sonderzeichen (&auml;,&Auml;,&ouml;,&Ouml;,&uuml;,&Uuml;,&szlig;,&lt;,&gt;,&amp;,&quot;)
mu&szlig; man auch 11mal die Funktion aufrufen.<P>

Also habe ich auf meinen Aminet-CDs nach einem geeigneten Programm gesucht,
das mir die Arbeit abnehmen kann. Ich mu&szlig; zugeben, da&szlig; ich nicht sehr gr&uuml;ndlich
gesucht habe, aber auch meine &quot;oberfl&auml;chliche&quot; Suche brachte kein Programm,
dessen Funktion mir geholfen h&auml;tte.<P>

Kurzerhand habe ich mich also an die Arbeit gemacht und selber ein kleines
aber feines (nur knapp 17kb gro&szlig;es) Programm erstellt, das mir die oben genannte
Arbeit abnimmt. Nach knapp einer halben Stunde (und einem Fehlschlag - aber
das ist eine andere Geschichte :-) war es dann soweit: HTML-SHARK. Der Name
ist nicht gerade ein Hit, aber eine Anlehnung an SHARKsort, dessen Grundger&uuml;st
ich &quot;mi&szlig;braucht&quot; hatte... Dann fiehl mir ein, da&szlig; es ja sowieso zumeist f&uuml;r
deutsche Angelegenheiten genutzt werden wird. Und so entstand &quot;<FONT COLOR ="#0000FF">HTML-HAI</FONT>&quot;. OK,
meine Phantasie (was ist das?) ist nicht gerade mit mir durchgegangen, aber
eine korrekte &Uuml;bersetzung ist es doch, oder? ;-)<P>

<FONT COLOR ="#0000FF">HTML-HAI</FONT> (es ist &uuml;brigens ein SHELL-Befehl - ich k&ouml;nnte aber mit Leichtigkeit
auch eine Version mit Requestern erstellen) checkt also eine angegebene Datei,
ob o.g. Sonderzeichen enthalten sind. Wenn dies so ist, werden die Zeichen
durch die jeweilige HTML-Beschreibung ersetzt. So mu&szlig; man nur noch den Text
normal eintippen, <FONT COLOR ="#0000FF">HTML-HAI</FONT> dar&uuml;ber laufen lassen und (HINTERHER!) die Tags
usw. einf&uuml;gen.<P>

F&uuml;r mich ist <FONT COLOR ="#0000FF">HTML-HAI</FONT> eine gro&szlig;e Arbeitserleichterung. Wenn Ihr auch daran
interessiert seid, schreibt mir einfach eine E-Mail und ich schicke es Euch
zu. Alternativ k&ouml;nnt Ihr <FONT COLOR ="#0000FF">HTML-HAI</FONT> auch auf Diskette bekommen. Daf&uuml;r braucht
Ihr mir nur 2,- DM in Briefmarken zu schicken (keine Diskette erforderlich!)
und ich schicke Euch das Programm auf einer (normalerweise vollen) Diskette
zu. <FONT COLOR ="#0000FF">HTML-HAI</FONT> ist &uuml;brigens, wie fast alle meiner Programme, CARDWARE. Das hei&szlig;t,
wenn es euch gef&auml;llt m&uuml;&szlig;t Ihr mir eine Ansichtskarte von Eurem Ort (oder besser
noch: aus dem Urlaub) schicken. Ich habe mit dieser Art von &quot;Ware&quot; gute
Erfahrung gemacht und hoffe, da&szlig; ich auch f&uuml;r <FONT COLOR ="#0000FF">HTML-HAI</FONT> genug Postkarten
bekomme.<P>

Meine Adresse:<P>

Andreas Etzrodt<BR>
Hauptstr. 15   <BR>
49835 Wietmarschen <BR>




 <HR><BR>
 <a href="mitglieder/etzrodt.html">Andreas Etzrodt </a> <BR>
 <a href="mailto:shark@nwn.de">  E-Mail: shark@nwn.de</a><P>


</P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
