<HTML>
<HEAD>
<TITLE>Beispiele</TITLE>
</HEAD>
<BODY BGCOLOR=#FFFFFF background="granit.jpg" text=#000000 link=#0000ff>
<H1>Tabellen</H1>
<H2>Beispiele f&uuml;r Tables</H2>
<H3>Teil 1</H1>
Wenn du das hier jetzt liest, dann solltest du entweder meine kleine Anleitung zu diesem Thema durchgegangen sein, oder anderweitig &uuml;ber gen&uuml;gend Kentnisse in Bezug auf HTML und Tabellen verf&uuml;gen. Hier m&ouml;chte ich lediglich aufzeigen, was man mit Hilfe der Tabellen so alles machen kann.<BR>
<HR>
Kommen wir zu Nr.1:<BR>
F&uuml;r diejenigen die eifrig am Storygame schreiben k&ouml;nnte das recht n&uuml;tzlich sein. Die Sprache soll dabei ja meistens direkt neben dem Namen erscheinen, damit man wei&szlig;, wer nun was gesagt hat. Da ich &lt;PRE&gt; absolut zum kotzen finde, hier nun meine Version mit Tabellen:<PRE>
Uups, nu hab ich doch &lt;PRE&gt; aktiviert. Schande :-(
&lt;TABLE BORDER=0 bgcolor=#000000 width=100%&gt;
	&lt;TR&gt;
		&lt;TD VALIGN=TOP&gt;
			&lt;FONT COLOR=red&gt;Commander:&lt;/FONT&gt;
		&lt;/TD&gt;
		&lt;TD NOWRAP&gt; &lt;!--NOWRAP mu&szlig; NICHT unbedingt aktiviert sein!--&gt;
			&lt;FONT COLOR=red&gt;Bla bla bla bla bla bla bla bla bla&lt;BR&gt;
			bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla&lt;BR&gt;
			bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla&lt;BR&gt;&lt;/FONT&gt;
		&lt;/TD&gt;
	&lt;/TR&gt;
&lt;/TABLE&gt;
</PRE>
Wie ich schon sagte, NOWRAP mu&szlig; nicht unbedingt aktiviert sein. Es sorgt lediglich daf&uuml;r, da&szlig; der Zeilenumbruch erst bei &lt;BR&gt; erfolgt, ist also an sich schon eine Art &lt;PRE&gt;-formattierter Text. Wenn du nun NOWRAP abstellst wird der Text automatisch auf die Zelle verteilt wie Platz ist, halt ganz normal. Das Attribut VALIGN solltest du &uuml;brigens stehen lassen, da es daf&uuml;r sorgt, das «Commander» oben steht, und nicht Zentriert wird. Wenn du nun ganz viele verschiedene Leute sprechen lassen willst, und damit nat&uuml;rlich auch sehr viele Zeilen &ouml;ffnen mu&szlig;t, empfiehlt es sich den ganzen Kram durch eine Buchstabenkombi, z.B. Doppel-x zu ersetzen, und hinter durch den Editor einzusetzen. Ach ja, so sieht es dann aus:<BR><TABLE BORDER=0 BGCOLOR=#000000 width=100% cellspacing=0 cellpadding=0><TR><TD VALIGN=TOP><FONT COLOR=#FF0000>Commander:</FONT></TD><TD nowrap><FONT COLOR=#FF0000>Bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla<BR>bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla<BR>bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla</FONT><BR></TD></TR></TABLE><BR>Und ohne NOWRAP oder Zeilenumbruch (empfohlen!):<BR><TABLE BORDER=0 BGCOLOR=#000000 width=100% cellspacing=0 cellpadding=0><TR><TD VALIGN=TOP><FONT COLOR=#FF0000>Commander:</FONT></TD><TD><FONT COLOR=#FF0000>Bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla</FONT><BR></TD></TR></TABLE><BR>Kommen wir nun zum n&auml;chsten Beispiel:<BR><HR>
In HTML wird der Text leider in wenig ansprechendem Flie&szlig;text angezeigt. Aus Zeitschriften ist man es ja mei&szlig;t gewohnt, da&szlig; der Text in Spalten aufbereitet wird. Wie ereicht man dies also in HTML?<BR>
Ganz einfach: 
Als erstes wird eine Tabelle mit 2-3 Spalten und einer Zeile ge&ouml;ffnet. Dann wird die &lt;TABLE&gt; auf 100% Breite ausgedehnt, und jede Spalte bekommt etwa 30% davon. Dann mu&szlig;t du nur noch den Text aufteilen, und dort rein setzen.<BR>Puhh, da&szlig; machen wir jetzt erstmal:
<PRE>
&lt;CENTER&gt;
&lt;TABLE CELLSPACING=5 BGCOLOR=white width=95% cellspacing=3 border=0 VALIGN=TOP&gt; 
   &lt;TR&gt;
      &lt;TD width=30% align=left valign=top&gt;
      Dein Text...
      &lt;/TD&gt;
      &lt;TD width=30 align=left valign=top&gt;
         Dein Text...
      &lt;/TD&gt;
      &lt;TD width=30% align=left valign=top &gt;
         Dein Text...
      &lt;/TD&gt;
   &lt;/TR&gt;
&lt;/TABLE&gt;
&lt;/CENTER&gt;
</PRE>
Und so in etwa sieht es dann aus:<BR>
<CENTER><TABLE border=0 bgcolor=white width=95% cellspacing=5 CELLPADDING=0 <TR><TD width=30% align=left valign=top>In HTML wird der Text leider in wenig ansprechendem Flie&szlig;text angezeigt. Aus Zeitschriften ist man es ja mei&szlig;t gewohnt, da&szlig; der Text in Spalten aufbereitet wird. Wie ereicht man dies also in HTML?<BR></TD><TD align=left width=30% valign=top>Ganz einfach: Als erstes wird eine Tabelle mit 2-3 Spalten und einer Zeile ge&ouml;ffnet. Dann wird die &lt;TABLE&gt; auf 100% Breite ausgedehnt, und jede Spalte bekommt etwa 30% davon.<BR></TD><TD width=30% align=left valign=top> Dann mu&szlig;t du nur noch den Text aufteilen, und dort rein setzen.<BR>Puhh, da&szlig; machen wir jetzt erstmal:<BR></TD></TR></TABLE></CENTER><BR>
Na, schon ein bischen besser oder?
Nat&uuml;rlich hat diese Methode sowohl Vor- als auch Nachteile, womit wir beim n&auml;chsten Beispiel w&auml;hren.<BR><HR>
Diesmal ist es etwas einfacher. Wir wollen einfach eine Tabelle kreieren, die die PROs und CONTRAs einander gegen&uuml;berstellt. Dabei brauchen wir zwei Spalten, und einige Zeilen (nochmal zur Erinnerung: Spalten gehen von links nach rechts, Zeilen sind...Zeilen eben!). Nun aber zum Beispiel:
<PRE>
&lt;CENTER&gt;
&lt;TABLE BORDER=0 width=50% cellspacing=0 cellpadding=0&gt; &lt;!--&ouml;ffnet eine einfache--&gt;
                                                         &lt;!--Tabelle ohne Rand.--&gt;
	&lt;TR&gt;
		&lt;TH&gt;
			Vorteile:
		&lt;/TH&gt;
	&lt;TH&gt;
		Nachteile:
	&lt;/TH&gt;
	&lt;/TR&gt;
	&lt;TR&gt;
		&lt;TD width=50% valign=top&gt; &lt;!--Valign sorgt daf&uuml;r, da&szlig; der Text--&gt;
		                          &lt;!--nach oben ausgerichtet wird.--&gt;
			&lt;UL&gt;
				&lt;LI&gt;Punkt eins...
			&lt;/UL&gt;
		&lt;/TD&gt;
		&lt;TD widht=50% valign=top&gt;
			&lt;UL&gt;
				&lt;LI&gt;Kontra Punkt eins...
			&lt;/UL&gt;
		&lt;/TD&gt;
	&lt;/TR&gt;
	&lt;TR&gt;
		&lt;TD width=50% valign=top&gt;
			&lt;UL&gt;
				&lt;LI&gt;Punkt Zwei...
			&lt;/UL&gt;
		&lt;/TD&gt;
		&lt;TD valign=top&gt;
			&lt;UL&gt;
				&lt;LI&gt;Kontra Punkt Zwei...
			&lt;/UL&gt;
		&lt;/TD&gt;
	&lt;/TR&gt;
&lt;/TABLE&gt;
&lt;/CENTER&gt;
</PRE>
Und das sieht dann in etwa so aus:<BR>
<CENTER><TABLE border=0 cellspacing=0 cellpadding=0 width=50%><TR width=100%><TH WIDTH=50%>Vorteile:</TH><TH width=50%>Nachteile:</TH></TR><TR width=100%><TD width=50% valign=top><UL><LI>Der Text sieht ansprechender aus, wird in kleineren H&auml;ppchen serviert.</UL></TD><TD width=50% valign=top><UL><LI>Es pa&szlig;t nicht mehr soviel auf eine Seite, da durch HTML keine Silbentrennung erfolgt.</UL></TD></TR><TR width=100%><TD valign=top width=50%><UL><LI>Der Benutzer ist diese Art des Lesens eher gew&ouml;hnt, die Augen m&uuml;&szlig;en nicht mehr sooft wandern.</UL></TD><TD width=50% valign=top><UL><LI>F&uuml;r den Programmierer wird es komplizierter, der Benutzer mu&szlig; evtl. nach oben/unten scroolen.</UL></TD></TR></TABLE></CENTER>
<br>
Nat&uuml;rlich mu&szlig;t du nicht f&uuml;r jeden Punkt eine neue Zeile &ouml;ffnen, es w&uuml;rde schon reichen wenn du lediglich eine &ouml;ffnest. Die obige Methode ist haupts&auml;chlich von Nutzen, wenn du immer zwei zusammengeh&ouml;rige Argumente nebeneinander stellen willst. Als n&auml;chstes hab ich mir gedacht, zeig ich mal ein sehr praxisbezogenes Beispiel, und zwar werde ich die Highscore-Tabellen von Slamtitlt in Tabellen-form übersetzen.<BR>
<A HREF="-tablework3.html">Klick mich für den nächsten Teil!</A><BR>
<A HREF="workshop_tables.html">Oder mich für den Inhalt!</A><BR><A HREF="NoCover.html">Oder mich für die NC!</A><BR><CENTER><A HREF="mitglieder/castro.html"><IMG SRC="SaintGranit.png" BORDER=0 width=144 height=52 alt="TheSaint Logo, PNG, Größe ca. 7 KB, 144x52, Link zur Mitgliederliste"></A></CENTER><BR>
</BODY>
</HTML>