<HTML>
<HEAD><TITLE>Liste der TABLE-Befehle</TITLE></HEAD>
<BODY BGCOLOR=#FFFFFF background="granit.jpg" text=#000000 link=#0000ff>
<CENTER>
<TABLE width=90% border=5 bordercolordark=#aaaaaa bordercolorlight=#dddddd bgcolor=#ffff99>
<TR>
<TD>
<oL>
<A HREF=#table><LI>&lt;TABLE&gt;</A><UL><LI>BORDER<LI>BGCOLOR<LI>WIDTH<LI>BACKGROUND<LI>CELLSPACING<LI>CELLPADDING<LI>ALIGN<LI>VALIGN<LI>BORDERCOLOR<LI>BORDERCOLORDARK<LI>BORDERCOLORLIGHT</UL>
<A HREF=#caption><LI>&lt;CAPTION&gt;</A><UL><LI>ALIGN</UL>
<A HREF=#tr><LI>&lt;TR&gt;</A><UL><LI>BGCOLOR<LI>BACKGROUND<LI>ALIGN<LI>VALIGN</UL>
<A HREF=#td><LI>&lt;TD&gt;</A><UL><LI>BGCOLOR<LI>BACKGROUND<LI>WIDTH<LI>HEIGHT<LI>COLSPAN<LI>ROWSPAN<LI>ALIGN<LI>VALIGN<NOWRAP</UL>
<A HREF=#th><LI>&lt;TH&gt;</A><UL><LI>BGCOLOR<LI>BACKGROUND<LI>WIDTH<LI>HEIGHT<LI>COLSPAN<LI>ROWSPAN<LI>ALIGN<LI>VALIGN<NOWRAP</UL>
</oL>
<HR width=85% color=#FF0000>
Erkl&auml;rungen der Befehle:
<BR>
<A name="table"></A>
<STRONG><FONT COLOR=#ff0000>&lt;TABLE&gt;:</FONT></STRONG>Mit diesem Befehl wird die Tabelle ge&ouml;ffnet.<BR>
<STRONG><FONT COLOR=#ff0000>BORDER:</FONT></STRONG> Hier kannst du eine Zahl angeben, die der Dicke der Tabelle in Pixel entsprechen soll. Soll sie keinen Rand besitzen kannst du sie auf 0 setzen.
<BR><STRONG><FONT COLOR=#ff0000>BGCOLOR:</FONT></STRONG> Damit gibst du die Hintergrundfarbe der Tabelle an. Dies l&auml;uft genau wie bei BODY, im Format #rrggbb. Siehe auch den Workshop von Higgins in der NC 53.
<BR><STRONG><FONT COLOR=#ff0000>WIDTH:</FONT></STRONG> Hier kannst du die Breite der Tabelle in Pixel oder Prozent angeben. Sollte der Inhalt der Tabelle (z.B. ein Bild) dar&uuml;ber hinaus gehen, so wird dieser Wert mei&szlig;tens nicht beachtet.
<BR><STRONG><FONT COLOR=#ff0000>BACKGROUND:</FONT></STRONG> Genau wie in &lt;BODY&gt;. Das Hintergrundbild wird in der ganzen Tabelle gezeigt, wird jedoch z.B. bei AWeb von der Farbe einer Reihe &uuml;berpinselt.
<BR><STRONG><FONT COLOR=#ff0000>CELLSPACING:</FONT></STRONG> Hier gibst du den Abstand der Zellen in Pixeln vonaneinander an. Praktisch soetwas wie BORDER, nur genauer bestimmbar.
<BR><STRONG><FONT COLOR=#ff0000>CELLPADDING:</FONT></STRONG> Hier gibst du an, wieviele Pixel Abstand der Text vom Zellenrand haben soll.
<BR><STRONG><FONT COLOR=#ff0000>ALIGN:</FONT></STRONG> Hier kannst du die Ausrichtung der Tabelle w&auml;hlen:<UL>
<LI>LEFT<LI>RIGHT<LI>CENTER<LI>TOP<LI>BOTTOM<LI>MIDDLE</UL>Wof&uuml;r TOP,BOTTOM und MIDDLE stehen wei&szlig; ich allerdings nicht, schlie&szlig;lich ist die Ausrichtung nur in der Horizontalen gedacht.
<BR><STRONG><FONT COLOR=#ff0000>BORDERCOLOR: </FONT></STRONG>Wenn du bei Border einen Wert &gt;=1 angegeben hast, so kannst du mit diesem Attribut die Farbe des ganzen Rahmens bestimmen, also ohne Schattierung. Wie immer rrggbb.
<BR><STRONG><FONT COLOR=#ff0000>BORDERCOLORDARK: </FONT></STRONG>Hier kannst du die Farbe des dunkel schattierten Rahmens angeben.
<BR><STRONG><FONT COLOR=#ff0000>BORDERCOLORLIGHT: </FONT></STRONG>Hier kannst du bestimmen, welche Farbe der helle Rand haben soll.
<BR><STRONG><FONT COLOR=#ff0000>VALIGN:</FONT></STRONG> Siehe ALIGN, jedoch diesmal nicht Horizontal sondern es ist diesmal die <STRONG>V</STRONG>ertikale Ausrichtung
<HR>
<A NAME="caption"></A>
<STRONG><FONT COLOR=#ff0000>&lt;CAPTION&gt;:</FONT></STRONG> Hier kannst du einen Titel f&uuml;r die Tabelle eingeben. Es ist egal wo &lt;CAPTION&gt; in der Tabelle steht, es wird immer nach oben oder unten gestellt (siehe ALIGN), und es ist KEINE einzelne Spalte (TD). Daher kann es auch keine Hintergrundfarbe haben.
<BR><STRONG><FONT COLOR=#ff0000>ALIGN:</FONT></STRONG> BOTTOM oder TOP. Dieser Wert bestimmt, wo der Titel angebracht werden soll, oben oder unten.
<HR>
<A NAME="tr"></A>
<STRONG><FONT COLOR=#ff0000>&lt;TR&gt;:</FONT></STRONG> Table Row oder Tabellen Zeile. In etwa dasselbe wie &lt;BR&gt;, nur wird hier keine neue Textzeile angefangen, sondern eine Tabellen-Zeile.
<BR><STRONG><FONT COLOR=#ff0000>BGCOLOR:</FONT></STRONG> Hier kannst du wieder eine Hintergrundfarbe angeben, die in der TabellenZeile verwendet wird. Die Farbe wird dabei von jeder Spalte angenommen, die keine eigene Farbe hat.
<BR><STRONG><FONT COLOR=#ff0000>BACKGROUND:</FONT></STRONG> Und wiedermal: Ein Hintergrundbild, diesmal halt f&uuml;r die Zeile.
<BR><STRONG><FONT COLOR=#ff0000>ALIGN:</FONT></STRONG> Wiedermal die Ausrichtung, diesmal die der Zeile. Wird nur benutzt, wenn in der Tabelle noch gen&uuml;gend Platz vorhanden ist.
<BR><STRONG><FONT COLOR=#ff0000>VALIGN:</FONT></STRONG> Dasselbe wie ALIGN, nur halt diesmal VERTIKAL gesehen, also von oben nach unten.
<HR>
<A NAME="td"></A>
<STRONG><FONT COLOR=#ff0000>&lt;TD:&gt;</FONT></STRONG> 
<BR><STRONG><FONT COLOR=#ff0000>BGCOLOR: </FONT></STRONG>Mal wieder: die Hintergrundfarbe der Spalte. Hast du bei dem <BR><STRONG><FONT COLOR=#ff0000>&lt;TABLE&gt;</FONT></STRONG> Tag ein Pattern f&uuml;r den Hintergrund eingestellt, so wird es ja nach Browser meist von der Hintergrundfarbe &uuml;bermalt.
<BR><STRONG><FONT COLOR=#ff0000>BACKGROUND: </FONT></STRONG>Hier kannst du ein Hintergrundbild f&uuml;r die Spalte w&auml;hlen.
<BR><STRONG><FONT COLOR=#ff0000>WIDTH: </FONT></STRONG>Hier kannst du wieder die Breite der Spalte angeben. Entweder in Prozent oder in Pixel, wobei du bei den Prozenten beachten mu&szlig;t, da&szlig; diese relativ zur Breite gemessen werden, die du in <BR><STRONG><FONT COLOR=#ff0000>&lt;TR&gt;</FONT></STRONG> angegeben hast. Wenn du also bei &lt;TR&gt; WIDTH=150 geschrieben hast, so wird die Zeile auch nur 150 Pixel breit. Gibst du nun bei &lt;TD&gt; WIDTH=90% an, so wird dies nicht zur Breite der ganzen Seite gemessen, sondern zur Zeile, in diesem Fall sind das also 135 Pixel Breite.
<BR><STRONG><FONT COLOR=#ff0000>HEGIHT: </FONT></STRONG>Hier kannst du die H&ouml;he der Spalte in Pixel angeben. Ist allerdings nicht sehr genau, da du z.B. bei Text nie genau weist, ob er nicht doch weiter nach unten geht. Ist dem so, wird HEIGHT mei&szlig;tens ignoriert, und die Spalte wird l&auml;nger (nach unten) als hier angegeben.
<BR><STRONG><FONT COLOR=#ff0000>COLSPAN: </FONT></STRONG>Normalerweise sind die einzelnen Spalten der Tabelle immer senkrecht untereinander angeordnet, haben also alle die selbe Breite. Mit <BR><STRONG><FONT COLOR=#ff0000>COLSPAN</FONT></STRONG> kannst du das &auml;ndern. Hier kannst du nun n&auml;hmlich einen Wert angeben, der angibt, wie viele Spalten breit dein TD sein soll. Im Klartext: Du kannst zum Beispiel mit einem Wert von 2 erreichen, da&szlig; die Spalte sich &uuml;ber zwei dar&uuml;ber oder darunter liegende Spalten ausdehnt. Das kann zum Beispiel f&uuml;r eine Titelzeile n&uuml;tzlich sein, die alle anderen Spalten umfassen soll.
<BR><STRONG><FONT COLOR=#ff0000>ROWSPAN: </FONT></STRONG>Hier kannst du angeben, &uuml;ber wieviele Zeilen sich die Spalte vertikal erstrecken soll.
<BR><STRONG><FONT COLOR=#ff0000>ALIGN: </FONT></STRONG>ALIGN beschreibt die Ausrichtung der Spalte innerhalb der Zeile. Wenn du also ALIGN=Right schreibst wird diese Spalte nach rechts ger&uuml;ckt. N&uuml;tzt nat&uuml;rlich nur dann etwas, wenn die Zeile breiter ist als die Spalte (Wenn beide gleich breit sind, ist es ja egal ob left, right oder center).
<BR><STRONG><FONT COLOR=#ff0000>VALIGN: </FONT></STRONG>Valign ist &auml;hnlich wie ALIGN, nur halt wieder in der Vertikalen (Von oben nach unten). Zul&auml;ssige Werte sind z.B. Top, Bottom, Middle, Center...<BR>Dies wird meines Wissens bisher nur von AWeb unterst&uuml;tzt.
<BR><STRONG><FONT COLOR=#ff0000>NOWRAP: </FONT></STRONG>Wenn du das angibst, fungiert es &auml;hnlich wie &lt;PRE&gt;:<BR>Der Zeilenumbruch kommt erst dann, wenn du auch wirklich &lt;BR&gt; angibst.
<HR>
<A NAME="th"></A>
<STRONG><FONT COLOR=#FF0000>&lt;TH&gt;</FONT></STRONG>
F&uuml;r &lt;TH&gt; gelten die selben Einstellungen wie bei &lt;TD&gt;. Die Schrift wird lediglich voreingestellt fett und zentriert dargestellt.
</TD></TR>
</TABLE></CENTER>
<A HREF="workshop_tables.html">Zur&uuml;ck zum Inhalt</A><BR>
<A HREF="NoCover.html">Zur&uuml;ck zur NC</A><BR>
</BODY>
</CENTER>