<HTML>
<HEAD><TITLE>Frontalcrash</TITLE></HEAD>
<BODY BACKGROUND="granit.jpg" bgcolor=#FFFFFF text=#000000 link=#0000ff alink=#000000>
<CENTER>
<TABLE BORDER=0 width=90% align=left height=100%>
<TR><TD>
<H1>FRONTAL: Die Antwort</H1>
Dieser Artikel bezieht sich auf Mark Toms »Frontal« aus der letzten NC. Lets start:<BR>
<P>&raquo;<I><FONT COLOR=BLUE>...Ich kann mich an kein einziges Versprechen seitens AI erinnern, welches sie gebrochen haben!</FONT></I>&laquo;</P>
Ach wie schade! Jetzt wollte ich gerade anf&uuml;hren, da&szlig; Petro den PPC als neuen Prozessor deklariert hatte, aber halt! Petro Tyschtschenko hat ja nichts mit Amiga Inc. zu tun. Aber deinen Satz kann man auch umdrehen:<BR><STRONG>"Ich bin mir nicht eines Versprechens seitens AI bewu&szlig;t das sie gemacht h&auml;tten!"</STRONG><BR>Na gut, das war jetzt &uuml;bertrieben. Aber die Sache ist halt die: Viel ist bisher nicht gekommen. Die Entwickler haben kaum Unterst&uuml;tzung erhalten, das PPC-Projekt wurde beinahe schon "abgew&uuml;rgt", und was die Lizensierungen betrifft:<BR>Sieh dich doch einmal um! Ein par Scandoubler und die Micronik Tower. Mehr nicht. Die Idee hinter den Lizenzen war die, da&szlig; wie beim PC-Markt jeder einen solchen Rechner zusammenschrauben darf, und ihm seinen Namen geben. Und beinahe alle Amiga-Clones die bisher angek&uuml;ndigt wurden, wurden auch wieder lahmgelegt. Klar, die Schuld daran liegt nicht bei AI, sondern bei den Herstellern. Aber der Amiga ist auf dem besten Wege die Lizenz-Politik auf dem selben Wege zu verfolgen wie Apple:<BR>Er f&auml;llt tierisch auf die Schnauze. Das der neue Amiga nicht mehr kompatibel sein wird finde ich gar nicht so schlimm. Der PPC war es ja auch nicht. Aber soll ich dir sagen, was man bisher &uuml;ber den Mystic-Amiga wei&szlig;? Nichts, Null, Nada, Rien, Nothing! Ich m&ouml;chte an dieser Stelle zwischen 3 Informationsarten unterscheiden:<OL><LI>Ger&uuml;chte<LI>Pressemeldungen<LI>FAKTEN</OL> <UL><LI>Ger&uuml;cht war, da&szlig; es einen Amiga auf Intelbasis geben w&uuml;rde, sp&auml;ter wurde etwas von einem Super-Chipset gemurmelt.<LI>Presseberichten zufolge, sollte ein wahnsinnig schneller neuer Compi mit dem Namen Amiga erscheinen. Sp&auml;ter wurde vereinzelt etwas von dem Celeron berichtet, von AI jedoch dementiert.<LI>Fakt ist: Bisher noch gar nichts. F&uuml;r mich wird etwas dann zum Faktum, wenn ich es selber sehe. Zeig mir ein reales UFO, und ich werde an Aliens glauben. So einfach ist das!</UL>Reg dich jetzt bitte nicht zusehr auf, ja? Es kann ja sein, da&szlig; die Entwickler schon sehr flei&szlig;ig an irgendwas arbeiten. Aber das hat man damals auch von Commo/Escom gesagt (Ich sage nur: AAA-Chipset!). Soll nicht hei&szlig;en, da&szlig; nichts getan wird. Soll aber auch nicht hei&szlig;en, DA&szlig; etwas getan wird. Was getan wurde k&ouml;nnen wir Normalsterbliche wohl erst Mitte 2000 sehen. Wollen wir mal hoffen, das die Entwickler auch wirklich was tun.
<P>&raquo;<I><FONT COLOR=BLUE>Es ging ja darum, ob man einen "High-End"-AMIGA f&uuml;r schlappe 1500,- DM realisieren kann.</FONT></I>&laquo;</P>
Was soll eigentlich dieses ganze Gerede &uuml;ber Konsolen? Ein Computer wird nie mit einer guten Konsole vergleichbar sein. Oder willst du, da&szlig; AI in den neuen AMIGA einen Modulschacht bauen, und f&uuml;r jedes Shareware Progi eine Lizenz-Geb&uuml;hr fordern? Siehst du! Sie werden warscheinlich versuchen, ihn so billig wie m&ouml;glich zu machen, aber er wird NIE "High-End" sein. "High-End" w&uuml;rde wie bei der Konsole bedeuten, da&szlig; er alles abdeckt, was man sich w&uuml;nscht. Und willst du vileicht ein Komplettpaket mit Scanner, Genlock, Monitor, und Laserdrucker kaufen, wenn du das gar nicht brauchst? Nein, ein Computer mu&szlig; immer unvollst&auml;ndig aber erweiterbar sein.<BR>Ach ja, nochwas: beim Mystic AMIGA werden im Endeffekt auch drei-vier Parteien dran verdienen:<OL><LI>Der Hersteller des Chipset<LI>Diverse Zulieferer (Glaubst du, AI w&uuml;rde die CD-ROMs selber bauen?)<LI>AI<LI>Der Versandhandel, schlie&szlig;lich wirst du ihn wohl kaum bei AI direkt kaufen. Also, hoffen wir, da&szlig; er zu diesem Preis angeboten wird. Aber ich w&uuml;rde ihn mir auch f&uuml;r 2500 noch kaufen.</OL>
<P>&raquo;<I><FONT COLOR=BLUE>Das der Amiga ein eigenes Grafikformat hat (IFF, CDXL) ist jetzt auch nicht so wahnsinnig genial und innovativ.</FONT></I>&laquo;</P>
Ach ja, und warum nicht? Zun&auml;chst ist IFF nicht nur ein Grafikformat (Was du meinst ist ILBM -Interleaved Bitmap) sondern ein Format f&uuml;r beinahe alles, und zweitens waren diese beiden Formate 1993 genial. Ein ILBM-Bild beispielsweise ist so aufgebaut, da&szlig; es zum Entpacken praktisch kaum Rechenzeit ben&ouml;tigt. Und ein CDXL-Film...naja, f&uuml;r damals war er schon sehr gut. Denn &uuml;berleg mal: Welche anderen Formate h&auml;tte Commodore z.B. f&uuml;r das CD³² zur Wah&ouml; gehabt? MPEG f&uuml;r die Sequenzen? MPEG ist dank der Kompriemirung sicherlich besser, aber damals hat ein MPEG-Modul noch gute 500-1500 Piepen gekostet. Und die Bilder? JPEG? Das w&uuml;rde mit einem CD³² ewig dauern! Und was ARexx betrifft:<BR>Stimmt, es ist lediglich eine Portierung. Rexx wurde vor &uuml;ber 35 Jahren von IBM entwickelt. Aber dennoch: Hat ein Pentium etwa soetwas? N&ouml;! Und wenn ich mir die PCs so ansehe, w&uuml;rde ich als User ein Datatype-System schmerzlichst vermissen. Das der A500+ und der A600 der letzte Bullshirt sind wei&szlig; jawohl jeder. Und zu guter Letzt m&ouml;chte ich sagen:<BR>H&ouml;rt endlich auf Commodore fertig zu machen. Commodore ist Tot, seht in die Zukunft. Sogar in der Bibel steht, da&szlig; alle S&uuml;nden mit dem Tod zunichte gemacht werden.
<P>&raquo;<I><FONT COLOR=BLUE>W&auml;hr es nicht korrekt, wenn man AI auch gen&uuml;gend Zeit geben w&uuml;rde...</FONT></I>&laquo;</P>
Bitte sehr, meine Zeit haben sie. Aber am Ende mu&szlig; auch etwas rauskommen! Wenn wir Ende 2000 haben, und von AI w&uuml;rden immer noch lediglich Versprechungen kommen, was glaubst du wieviele User der Amiga dann noch h&auml;tte? 
<P>&raquo;<I><FONT COLOR=BLUE>Wieso sollte AI jetzt noch gro&szlig; an OS-Updates f&uuml;r Classic-Amigas arbeiten und unn&ouml;tig Resourcen und Manpower vergeuden?</FONT></I>&laquo;</P>
Komisch, komisch...Jetzt machen sie es auf einmal doch?! Sowas von inkonsequent...<BR>Und was die von mir angesprochenen Gimmicks betrifft betrifft, so w&uuml;rde ich es doch sehr begr&uuml;&szlig;en, wenn diese irgendwann nicht mehr nur als Hack und Patch im OS rumpfuschen w&uuml;rden, sondern fest eingebaut w&auml;hren. Dann w&uuml;rde VMEM n&auml;hmlich nicht immer abst&uuml;rzen, es g&auml;be keine Gurus mehr, und MCP w&uuml;rde auch keine Probleme mehr machen.
<P>&raquo;<I><FONT COLOR=BLUE>Eine &uuml;bergangsl&ouml;sung f&uuml;r 12 Monate?</FONT></I>&laquo;</P>
Also zun&auml;chst mal glaubst du doch wohl selber nicht, da&szlig; der neue Amiga p&uuml;nktlich rauskommt (Deadlines werden und wurden NIE eingehalten), und zweitens:<BR>Stell dir mal vor (rein hypothetisch (auweia, schweres Wort :) gesprochen) PPC w&auml;hre von AI als Finale L&ouml;sung akzeptiert worden. Du und viele andere h&auml;tten sich wohl eine PPC-Karte gekauft, uuuund dann? In 12-15 Monaten ist doch selbst der 604 veraltet (wenn nicht jetzt schon)! Wenn du dir heute einen PC f&uuml;r 3000 Mark kaufst (einen GUTEN, keinen hogetakteten ALDI-M&uuml;ll), dann wirst du ihn auch nicht ewig behalten wollen. Nach maximal 2-3 Jahren kommt ein neuer, wenn nicht fr&uuml;her. Und was willst du sonst als &uuml;bergangsl&ouml;sung? Mein 030 keucht aus allen Rohren und schreit nach der Rente! Ich habe nicht vor das n&auml;chste Jahr noch mit 4 MB Ram zu verbringen. Ende des Jahres hol ich mir nen PPC mit ordentlich RAM, und in ein bis zwei Jahren dann den Mystic AMIGA. Problem gel&ouml;st, oder?<BR>
<I>Amiga rulz- ob nun Mystic oder PPC!</I><BR>
<HR>
<CENTER><A HREF="mitglieder/castro.html"><IMG SRC="SaintGranit.png" width=144 height=51 border=0 alt="The Saint Logo, Gif, 141x52 Gr&ouml;&szlig;e ca. 7 KB"></A><BR>
<SMALL><FONT COLOR=#000000>Markus Castro</FONT></SMALL></CENTER><P></P>
<CENTER><A HREF="NoCover.html"><IMG SRC="l_hauptinhalt.jpg" border=0 width=320 height=70 alt="Link zum Inhalt, Bild=Hauptinhalt, JPG, 639x99, Gr&ouml;&szlig;e ca. 29.1 KB"></A><BR></CENTER>
PS: "feiern" ist ein VERB(!) und kein Adjektiv mein lieber Mark. Ich glaub das lernen die Kids schon in Klasse 1. Wie peinlich :)
</TD></TR></TABLE></CENTER>
</BODY>
</HTML>