<HTML>
<HEAD><TITLE>Thema: &uuml;berf&uuml;llte NoCover</TITLE></HEAD>
<BODY BGCOLOR=#ffffff text=#000000 link=#0000ff alink=#00ff00 vlink=#ff0000 background=granit.jpg>
<H1>NoCover &uuml;berf&uuml;llt?</H1>
Tja, die NC l&auml;uft &uuml;ber. Was soll man dagegen machen? Also als <STRONG>erstes</STRONG> mal das Allheilmittel: Weniger Bilder. Damit meine ich weniger dieser 800x600 Pixel gro&szlig;en Screenshots (Napalm...), und keine riesigen, von HTML verkleinerten Bilder mehr.  So riesige Bilder m&uuml;&szlig;en nicht sein, wirklich. Einfach mal UltraConv anwerfen, und um die H&auml;lfte skalieren. Damit sehen die Bilder immer noch gut aus, nehmen aber 3-mal weniger Platz ein, und lassen sich auch unter niedrigeren Aufl&ouml;&szlig;ungen noch gut betrachten. Und wenn ihr euch Hintergr&uuml;nde von irgendwelchen CDs oder aus dem Internet holt, auch skalieren. Man merkt es kaum, aber sie haben nur noch die H&auml;lfte an Gewicht.<BR><STRONG>Zweitens:</STRONG>Achtet auf das Format der Bilder. Nicht immer sind Bilder in JPG am kleinsten. Kleinere Pics haben oft in PNG oder sogar in GIF ein par KBs weniger, und sehen immer noch perfekt aus.<BR><STRONG>Drittens:</STRONG>Wenn du z.B. das Bild vom Inhaltsverzeichnis skalierst, dann lass es den Browser erledigen. Mit ImageFX oder &auml;hnlichem mag es zwar besser aussehen, braucht aber auch zus&auml;tzlichen Platz auf der Disk. Dann haben wir bald 10 Hauptinhaltsbilder auf der Disk :(<BR><STRONG>Viertens:</STRONG>Was haltet ihr eigentlich von folgendem Vorschlag: Ihr fertigt zwei Versionen der Grafiken an, einmal eine kleinere f&uuml;r die Disks, und dann eine in Original-Gr&ouml;&szlig;e f&uuml;r die OnlineVersion. Klar, das w&auml;hre dann etwas zus&auml;tzliche Arbeit f&uuml;r uns alle, aber daf&uuml;r m&uuml;&szlig;te keiner um eine wichtige Grafik f&uuml;rchten, weil sie keinen Platz mehr auf der Disk findet.<BR><STRONG>Und f&uuml;nftens:</STRONG>Ihr kennt doch sicher alle Diskspare. Im Aminet tummeln sich seit l&auml;ngerer Zeit BetaVersionen eines &auml;hnlichen Projekts, dem floppi.device. Damit pa&szlig;t auf eine Diskette 1149 KB. Ohne Kompression. D&auml;mmerts was ich vorschlagen will? Der Andi k&ouml;nnte doch wenigstens eine der Disks auf diese Art formatieren, und auf die andere das floppi.device (ca. 10-20KB) packen. Damit k&ouml;nnte jeder die zweite Disk lesen, und auf der Disk w&auml;hren etwa 250 KB mehr Speicher vorhanden. Bei zwei Disks nat&uuml;rlich ca. 500KB. Und wenn sie dann auch noch auf HD formatiert werden...Aber ich schweife ab. Was haltet ihr von dem Vorschlag? Und du, Andreas? Nun kommt schon antwortet! Oder wollt ihr bald nur noch 3 riesige Bilder auf den Disks bekommen, und sonst nix :( ?<BR>Ich habe fertig...<BR><CENTER><A HREF="mitglieder/castro.html"><IMG SRC="SaintGranit.png" width=144 height=52 alt="The Saint Logo, PNG, 144x52, Gr&ouml;&szlig;e ca. 7KB, Link zur Mitgliederliste" border=0></A></CENTER><BR><SMALL><CENTER>Markus Castro</CENTER></SMALL><BR>
<BR>
<CENTER><A HREF="NoCover.html"><IMG SRC="l_hauptinhalt.jpg" border=0 alt="Link zum NC Inhalt, Hauptinhalt, Gr&ouml;&szlig;e ca. 30 KB, 639x99, JPG" width=500 height=80></A></CENTER>
<BR>
<FONT SIZE=-1>PS.:Habt ihr schon das von dem CocaCola-Mitarbeiter geh&ouml;rt, der in Getr&auml;nke Bottich gefallen ist? Angeblich wurden in halb Frankreich Flaschen mit seinen aufgel&ouml;&szlig;ten Innereien auf den Markt gebracht. Igittigitt...Cola mit Z&auml;hnen als Extra Gimmick :)<BR></FONT>




</BODY>
</HTML>