<HTML>
<HEAD><TITLE>Another World</TITLE></HEAD>
<FRAMESET COLS=128,*>
<FRAME SRC="-gt_oldiesInhalt.html" NAME="Frame1">
<FRAME SRC="-gt_oldies2.html" NAME="FRAME2">
</FRAMESET>
<BODY BGCOLOR=#FFFFFF text=#000000 link=#ff0000 background="granit.jpg">
Heute hab ich f&uuml;r die Oldie-Reihe ein ganz besonderes altes Spiel aufgetrieben:<H1>
Another World 1</H1>
Und trotz seines Alters kann ich mit Recht behaupten, da&szlig; es genial ist! Aber gut, los gehts...
<HR WIDTH=90% color=#FF0000 noshade size=2>
Zur Story:<P>
In diesem Delphin-Spiel &uuml;bernimmst du die Rolle des jungen Wissentschaftlers Lester Chaykins. Dein Hobby ist es in deinem Labor ein par Kernreaktionen zu verursachen, wie andere Leute eine Cola trinken. Bei einem dieser Experimente kommt es dann zur Katastrophe:<BR>
Ein Blitz kracht in das Labor, verkracht sich mit dem Atom, beide krachen in dich rein, und du krachst in eine andere Dimension. Cool!<BR>
Jetzt bist du jedenfalls erstmal auf dich allein gestellt, und mu&szlig;t versuchen zu &uuml;berleben. Andernfalls bist du tot, ist ja klar :).<BR>
<HR WIDTH=90% color=#FF0000 noshade size=2>Zum Spiel:<P>
Dieses Game ist der Vorfahr von solchen Plattformern wie Flashback oder onEscapee. Im Gegensatz zu Flashback hast du hier keine begrenzten Handlungsm&ouml;glichkeiten, und auch die Anleitung schweigt sich &uuml;ber dein K&ouml;nnen weitesgehendst aus. Du mu&szlig;t selbst herausfinden, was du kannst (und was nicht :). Die Spielfigur ist nicht nur in feste Bewegungsmuster eingebaut, wie z.B. nur Laufen und Ballern. Vielmehr kannst du in diesem Spiel Tauchen, Lianenschwingen, an Stalagmiten klettern, kriechen, einen Computer steuern und und und. Es macht einfach unheimlich Bock dieses Spiel zu Zocken. Dieses Spiel ist eines der besten Actiongames aller Zeiten, weswegen ich es hier vorstellen m&ouml;chte.
Die Grafik:
Bei der Grafik kann man geteilter Meinung sein. Die eigentlichen Spielegrafiken wirken ein bischen bla&szlig; und bieten kaum mehr als 8-16 Farben. Jedoch k&ouml;nnen die Zwischensequenzen voll &uuml;berzeugen. Das Intro beispielsweise dauert mehr als 2 Minuten, und im Spiel kommen des &ouml;fteren diese Zwischensequenzen zum Vorschein, und erz&auml;hlen die Story weiter. Wenn man sich das Spiel ansieht, mu&szlig; man sich nat&uuml;rlich vor Augen halten, da&szlig; es ca. 7-8 Jahre alt, und somit Grafisch nicht mit onEscapee mithalten kann. Denoch kann man der Grafik das Pr&auml;dikat: Gut nicht absprechen.
<HR WIDTH=90% color=#FF0000 noshade size=2>Der Sound:<P>
Also hier kann man echt nicht meckern. Im Spiel sind zwar fast nur Effekte zu h&ouml;ren, aber ab und zu spielt schon eine kleine Musik, und Intro und Extro wurden auch vertont. Die Musik verleiht dem Spiel eine ganz eigene Athmosph&auml;re, und l&auml;&szlig;t vielerorts auch richtig Spannung auftauchen. 
<HR WIDTH=90% color=#FF0000 noshade size=2>Gameplay:<P>
Genial! Was hier an Handlungsm&ouml;glichkeiten im ganzen Spiel geboten wird, da k&ouml;nnte sich so manches neues Game eine Scheibe von abschneiden. Du kannst laufen, schwimmen, springen, ballern, robben, an Stalaktiten klettern, ein Au&szlig;erirdisches Gef&auml;hrt benutzen und, und, und...<P>Bei neueren Spielen wie z.B. Flashback kommt es in erster Linie darauf an, R&auml;tsel zu l&ouml;&szlig;en. Bei diesem Spiel geht es mehr ums &uuml;berleben, aber auch hier kommt man ohne Taktik und nur mit Ballern nicht sehr weit. An einigen Stellen hilft dir sogar dein au&szlig;erirdischer Freund, der im zweiten Level mit dir eingespertt wurde. Das Spiel ist zwar stellenweise sehr schwer, aber mit den Levelcodes kann man ja die schwierigen Passagen &uuml;berbr&uuml;cken. Um es in einem Satz zu sagen: Dieses Spiel macht tierisch Bock!
<HR WIDTH=90% color=#FF0000 noshade size=2>Wertung:<P>
In Anbetracht seines Alters kriegt dieses Spiel von mir eine glatte 1. O.K., man kann sich dar&uuml;ber streiten, aber meiner Meinung nach ist dieses Spiel einfach geil.<BR>
<A HREF="-agtable.html">Hier nochmal der Wertungskasten.</A>
<HR WIDTH=90% color=#FF0000 noshade size=2>Bezugsquelle:<P>
Tja, ich hab es mir schon vor einigen Jahren geholt, ob es jetzt noch erh&auml;ltlich ist wage ich zu bezweifeln. Guck doch einfach mal bei einem Gebraucht-Spiele-H&auml;ndler nach!
<HR WIDTH=90% color=#FF0000 noshade size=2>Cheats:<P>
Tja, Cheats gibts leider keine, aber die Levelcodes hab ich parat:
<TABLE BORDER=1 bgcolor=#FFFFFF>
<TR><TD> EDJ</TD><TD> HICI</TD><TD> FLLD</TD></TR>
<TR><TD> EDIL</TD><TD> LIBC</TD><TD> CCAL</TD></TR>
<TR><TD> KCIJ</TD><TD> FIE</TD><TD> ICAH</TD></TR>
<TR><TD> LDIJ</TD><TD> LDCI</TD><TD> GABK</TD></TR>
<TR><TD> LALD</TD><TD> KJIA</TD><TD> LFEK</TD></TR>
</TABLE>
<HR WIDTH=90% color=#FF0000 noshade size=2>Abschlie&szlig;end:<P>
Zum Ende m&ouml;chte ich noch sagen, da&szlig; dieses Spiel wirklich super ist. Trotz seines Alters kann es noch locker mithalten, wenn es um Spielspa&szlig; geht. Nachdem ich letzten Monat nicht die Zeit fand, irgendetwas zu schreiben, hoffe ich, da&szlig; dir zumindest dieser zweite Teil Hunger auf mehr machte. N&auml;chstesmal gibt es wahrscheinlich wieder einen Oldie-Test, und ich w&uuml;rde mich sehr freuen, wenn meiner nicht der einzige ist!<BR>CU...<P>
<CENTER><A HREF="mitglieder/castro.html"><IMG SRC="SaintGranit.png" width=144 height=52 border=1 alt="TheSaint Logo, PNG, 144x52, link zur Mitgliederliste, Gr&ouml;&szlig;e ca. 7KB"></A></CENTER><BR><FONT COLOR=#FFFF00 size=1><CENTER>Markus Castro</CENTER></FONT><BR>
<CENTER><A HREF="NoCover.html" TARGET=NEW><IMG SRC="l_hauptinhalt.jpg" border=0 width=320 height=50 alt="Zum Inhalt!"></A></CENTER><BR>
</BODY>
</HTML>
