<HTML>
<HEAD><TITLE>Heaven</TITLE></HEAD>
<BODY BGCOLOR=#0000FF text=#000000 link=#000000 alink=#FF0000 vlink=#ff00ff background="wolke.jpg">
<CENTER>
Hier sind wir wieder mit einer neuen Ausgabe von<BR>
<TABLE border=0 bgcolor=#000000 width=390 >
<TR><CENTER>
<TD width=390 bgcolor=#000000><IMG SRC="taube.jpg" alt="taube" width=100 border=0 height=85><IMG SRC="himmel.gif" alt="HEAVEN" border=0 width=180 height=40><IMG SRC="taube.jpg" alt="Taube" width=100 height=85 border=0></TD>
</CENTER>
</TR>
</TABLE>
Jo, der Saint hat mal wieder was abzulassen, diesmal f&uuml;r:<P align=center>
<A HREF=#umo><IMG SRC="boing.png" width=22 height=24 border=0 alt="Boingball, GIF, 22x24, Gr&ouml;&szlig;e ca. 1,3 KB">Thomas Steffens<BR></A>
<A HREF=#dan><IMG SRC="boing.png" width=22 height=24 border=0 alt="Boingball, GIF, 22x24, Gr&ouml;&szlig;e ca. 1,3 KB">Daniel Stein<BR></A>
<A HREF=#tom><IMG SRC="boing.png" width=22 height=24 border=0 alt="Boingball, GIF, 22x24, Gr&ouml;&szlig;e ca. 1,3 KB">Mark Tom<BR></A>
<HR width=80% color=#d00505
<A NAME="umo"></A>
<CENTER><IMG SRC="boing.png" width=22 height=24 border=0 alt="Boingball, GIF, 22x24, Gr&ouml;&szlig;e ca. 1,3 KB">An UMO:<BR></CENTER>
Jo, nett da&szlig; dir meine Artikel gefallen haben, freut mich immer zu h&ouml;ren. Nun zu der Kritik:<OL>
<LI>Den Titel habe ich tats&auml;chlich vergessen zu ersetzen, sorry! Wenn ich einen Artikel schreibe l&auml;uft das meistens so ab:<BR>Ich &uuml;berlege mir was das werden soll (Layout, Thema...) schreibe dann den Anfang des Artikels, und stricke dann das HTML-Ger&uuml;st drumherum. Dann schreibe ich den Artikel fertig, und bringe den Code zu Ende. Da k&ouml;nnen sich schon mal Fehler einschleichen, insbesondere da ich immer an min. 5 Artikeln gleichzeitig schreibe, und ich oft nicht mehr wei&szlig;, wo oben und unten ist. Kommen wir zu Punkt<LI>&ouml;hhhm...Was f&uuml;r ne gelbe &uuml;berschrift? H&ouml;chstens im Wertungskasten, oder? Hhhmmm???...<LI>Meine Rechtsschreibung lesst leiter oft &szlig;ehr su wunschen &uuml;brig, ich weiss :)<BR>Aber da bin ich nicht der einzige im Club, im Gegenteil, ich versuche meistens so wenig Fehler wie m&ouml;glich zu machen.<LI>Smart 100X deswegen, weil dieses CD-Laufwerk so hei&szlig;t. Ist in Wirklichkeit nat&uuml;rlich ein stinknormales 24x, wird vom Hersteller aber mit PC-Soft ausgeliefert, die die gesamte CD auf Pladde zieht, und dann von dort sehr viel schneller laden soll. Finde ich zwar auch schwachsinnig, ist aber kein Fehler von mir.</UL>Nun noch was zu<FONT COLOR=#ff0000>PNG</FONT>: Wenn ich mal versuche selber was zu Pixeln/tracen dann bearbeite ich es meist mit PPaint (6.4 Aminet SET 5), und PPaint unterst&uuml;tzt nun mal PNG direkt.<BR>Bei GIFs mu&szlig;te ich immer umkonvertieren, und beim einlesen &uuml;ber die Datatypes gehen. Das ist mir jetzt ein bischen zu langwierig, deshalb ab sofort nur noch PNG oder JPG. Ach ja noch was:<BR>Im Aminet gibt es ein Add on f&uuml;r PPaint, das es erlaubt Piktogramme zu lesen. Installiert es euch NICHT!<BR>Ich habe es mir installiert, und wann immer ich nun ein Datatype-Bild direkt laden will (Toolsmen&uuml;), l&auml;dt PPaint es als Icon. Das kann ganz sch&ouml;n nerven!<BR>
<HR width=75% color=#d00505>
<A name="dan"></A>
<CENTER><IMG SRC="boing.png" width=22 height=24 border=0 alt="Boingball, GIF, 22x24, Gr&ouml;&szlig;e ca. 1,3 KB">An Nagash:<BR></CENTER>
Dies betrifft deinen Artikel an Roadrunner (zuf&auml;llig mitgelesen):<BR>
Also ich seh schon wie Wolf Z. dich innerlich verflucht und seinen Texteditor anwirft. Aber das wollte ich gar nicht sagen, sondern das: Zun&auml;chst mal war der "erste Engel" nicht der Teufel/Antichrist sondern ganz im Gegenteil der Christus! Das halte ich schon f&uuml;r ein wichtiges Detail.<BR>Zweitens sollen laut der Bibel nicht nur 144000 &uuml;berleben, sondern eine "Gro&szlig;e Volksmenge die kein Mensch zu z&auml;hlen vermochte" (siehe Offenbarung 7:9). Die 144000 die das Zeichen Gottes auf der Stirn tragen, stehen lediglich "vor dem Lamm" in dem Sinne, da&szlig; sie sp&auml;ter einmal zu himmlischen Leben auferweckt worden werden wurden sollen sein. Alle anderen Christen sollten ewig in einem Paradies auf der Erde leben. Au&szlig;erdem meine ich in der Bibel nicht ein einziges Mal den Ausdruck "Antichrist" geh&ouml;rt zu haben. Wei&szlig; einer woher der Ausdruck kommt?<BR>----------»BREAK«----------<BR>Auhauahauaha, da währe mir jetzt beinahe ein Riesenschnitzer unterlaufen. Wie ich gerade merke gibt es den Ausdruck "Antichrist" in der Bibel doch. Er wird in vier Passagen erwähnt:<OL><LI>1. Johannes 2:18<LI>1 Johannes 2:22<LI>1. Johannes 4:3<LI>Und 2. Johannes Vers 7</OL>In diesen Stellen weist das Wort "Anitchrist" allerdings auf Personen hin, die die Existenz des Christus leugnen, und seine Lehren verwerfen. Sofern Billy jetzt also nicht noch schnell eine eigene satanische Sekte gründet, darf man ihn (leider) nicht als Antichristen bezeichnen. Nichstsdestotroz bleibt er prädestiniert für den Titel »Satan auf Erden, das inkarnierte Böse und das schlechte in Menschengestalt«.<BR>----------»BREAK«----------<BR>Naja, das war`s so in etwa. Also als Gedankenspiel habe ich auch schon einiges in diese Richtung gesponnen, aber man sollte halt aufpassen, da&szlig; man das alles nicht ernst nimmt.
<BR>
<FONT SIZE=-1>PS: Sag mal spinn ich jetzt, oder sind die Geschichten "Dark Zone" aus der NC 57 und 56 absolut identisch?</FONT><BR>
Tschau...
<HR width=70% color=#ff0000>
<A name="tom"></A>
<CENTER><IMG SRC="boing.png" width=22 height=24 border=0 alt="Boingball, GIF, 22x24, Gr&ouml;&szlig;e ca. 1,3 KB">An Markus Thomarkscg...Tomschew...Mark Tom:<BR></CENTER>
Nett das dir der Test gefallen hat. Ich finde zwar Spiele wie Genetic Species nicht durchgehend schlecht, bin aber wie du der Meinung, da&szlig; man es noch sehr viel besser machen k&ouml;nnte, wenn man nur k&ouml;nnte :)<BR>Ich bin eigentlich nicht der Typ f&uuml;r knallharte Kritiken, irgentetwas gutes hat ein Spiel immer. Und ich kann zwar eine Playstation nicht beurteilen, aber wer immer mit ihr gl&uuml;cklich wird soll ruhig zugreifen. Aber eines wollte ich an dieser Stelle nochmal sagen:<BR><U>Wenn ihr ein Spiel wie z.B. onEscapee gut findet dann kauft es euch!</U> Ich wei&szlig; nicht inwieweit die Amigascene derzeit von Raubkopien beherscht wird, aber ich finde es traurig!<BR>Ich habe bis vor wenigen Jahren auch noch kopiert wie ein Berserker, und auch heute habe ich nicht alle alten Raubkopien aus meinem Schrank vernichtet, das gebe ich offen zu. Aber von neueren Spielen wie onEscapee w&uuml;rde ich mir niemals eine Raubkopie holen (Ich w&uuml;&szlig;te auch nicht woher...). Und wenn clickBOOM bei einem Spiel wie Quake &uuml;ber Verluste klagen, und diese nicht damit zu erkl&auml;ren sind, da&szlig; nicht gen&uuml;gend User einen 060 haben, dann finde ich sollten sich einige User da drau&szlig;en wirklich sch&auml;men :(((((((.<BR>
<HR noshade size=1 width=100% color=#000000>
<CENTER><A HREF="mitglieder/castro.html"><IMG SRC="thesaint2.gif" width=142 height=51 alt="The SaintLogo, GIF, 142x51, Größe ca. 2.7KB, Link zur Mitgliederliste" border=0></A></CENTER><BR><CENTER><SMALL>Markus Castro</SMALL></CENTER><BR>
<A HREF="NoCover.html"><CENTER><IMG SRC="l_hauptinhalt.jpg" alt="Inhalt" border=0 width=320 height=50></CENTER><BR></A>
</CENTER>
</BODY>
</HTML>
