<HTML>
<HEAD><TITLE>Viren: Ist die Kreativität am Ende?</TITLE>
</HEAD>
<BODY bgcolor=#000000 text=#FFFF00 link=#00ff00>
<H1>Viren</H1>Tja, es ist kalt drau&szlig;en, ich hab nichts zum Zocken, und dieses Thema geht mir nun schon seit einiger Zeit durch den Kopf. Also schreib ich mal was zu diesem Thema.<BR>Jeder kennt sie und jeder ha&szlig;t sie. Wirklich l&auml;&szlig;tig wenn sie sich in der Uhr einnisten und nach und nach die Festplatte und den Monitor zerst&ouml;ren. Halt, das war nat&uuml;rlich nur Quatsch. Wie jeder halbwegs normale Amiga-User wei&szlig; k&ouml;nnen Viren das nicht. Aber versucht mal das ein par PC-Usern zu sagen. Die fressen euch buchst&auml;blich aus der Hand. Wovon ich eigentlich schreiben wollte ist die Entwicklung der Viren. Anscheinend hat sie sich auf dem Amiga totgelaufen (das ist auch gut so!); meines Wissens kommen kaum noch richtig ernstzunehmende Viren auf dem Amiga raus.<BR>Klar, ab und zu mal ein Trojaner oder ein harmloser Linker. Aber diese wiederlichen Gesch&ouml;pfe in der Art von Lamer und Saddam sind kaum noch zu finden. Dagegen boomt die Virenindustrie auf dem PC. L&auml;ngst hat man dort die sogenannten Makro-Viren entdeckt, und so schreiben heute 10-j&auml;hrige die ersten primitiven Viren. Klar, da&szlig; dabei h&ouml;chstens etwas wie "Format C:" rauskommen kann. Aber auch die richtig guten Viren auf dem PC mehren sich. Dem Norton Commander sollen inzwischen &uuml;ber 12000 Viren bekannt sein.<BR>Auf die Frage, wer denn pro Monat ein par hundert schreiben kann, meinen die Firmen, es m&uuml;&szlig;e sich um russische Hacker handeln, Programmierer ohne Arbeit. Viel sinn- aber auch sorgenvoller erscheint da die Erkentniss, da&szlig; die Virenfirmen selbst die Viren produzieren, um als erste ein Heilmittel parat zu haben.<BR>Was mich aber wundert, ist die Einfallslosigkeit, mit der die heutigen Hacker zu Werke gehen. Entweder werden auf Windows irgendwelche .ini oder .bak Dateien gel&ouml;scht, oder es wird versucht die Festplatte zu formatieren. Wow! Ich glaube mir fallen auf Anhieb mindestens 3 neue Arten von Viren ein die es auf dem PC und auch auf dem Amiga noch nicht gibt.<BR>Als erstes w&auml;hre ein Virus denkbar, der den Inhalt der FlashROM auf den PPC-Karten leert. Da wird sich ein jeder User freuen, hat er doch jetzt ein par KB mehr RAM :)<BR>Dasselbe k&ouml;nnte man doch auch mit den Ramkarten der Digitalkameras machen. Du schlie&szlig;t die Kamera an den PC an, und schon sind die Bilder futsch. Dann habn mehr wieder Platz f&uuml;r neue :)<BR>Drittens: Erinnerst du dich noch an die sogenannten Mailbox-Viren? Wurden sie auf dem Rechner des SysOps aktiv, l&ouml;schten sie ihm entweder die Pladde mit dem User-Verzeichnis, oder noch viel gemeiner: Sie meldeten einen neuen User an (z.B. Horst Maier) der SysOp-Status geno&szlig;. Dann haben die Hacker monatlich mal einen Check durch die Boxen unternommen, und wenn sie reinkamen...Friede &uuml;ber des MailBox Asche. Das gleiche lie&szlig;e sich doch auch mit Server-Viren machen. Wird der Virus aktiv, f&auml;hrt die Firewall runter, oder die Seite wird aus dem Netz genommen, oder oder oder. Am genialsten w&auml;hre noch ein Aussperren des eigentlichen SysOps, dann kann er an seine eigenen Server nicht mehr ran :)<BR>Mir f&auml;llt gerade noch eine vierte M&ouml;glichkeit ein: Ein Virus, der auf das einlegen einer CD in einen Brenner wartet. Schwups ist sie drin f&auml;ngt er an auf sie zu schreiben. Einfach som an zuf&auml;lligen Stellen zuf&auml;llige Bytefolgen. Ein evtl. Brennen auf diesen Rohling w&uuml;rde dadurch unm&ouml;glich werden. Resultat: Weniger Raubkopien (und weniger Backups :-)).<BR>Eigentlich wollte ich gar nicht so sehr &uuml;ber neue Virentypen schreiben, mir ist lediglich aufgefallen, da&szlig; den Programmierern, und zwar s&auml;mtlichen, jegliche Art von Kreativit&auml;t verloren gegangen zu sein scheint. Ich meine heute kommt f&uuml;r den PC und leider leider auch f&uuml;r den Amiga kaum noch ein innovatives Game oder Progi heraus. St&auml;ndig nur noch der x-te Doom/Tomb Raider oder Formel 1 Clone. Da sind die Viren nat&uuml;rlich ein gutes Beispiel.<BR>Ich denke ich sollte an dieser Stelle das Schreiben abbrechen, sonst werde ich noch f&uuml;r die neue Viren-Generation verantwortlich gemacht. Um eins mal klarzustellen:<BR>Ich ha&szlig;e Viren auf dem Amiga, und w&uuml;rde den Saddam-Coder am liebsten erw&uuml;rgen. Aber auf dem PC hab ich nichts dagegen, wenn dadurch ein par User zum Amiga wechseln w&uuml;rden...<BR>In diesem Sinne, tschau und bis bald...<BR><CENTER><A HREF="mitglieder/castro.html"><IMG SRC="thesaint.gif" width=142 height=51 border=0 ALT="The Saint Logo, Link zur Mitgliederliste, GIF, 142x51, Größe ca. 2.5 KB"></A><BR><SMALL>Markus Castro</SMALL></CENTER><BR><A HREF="NoCover.html"><IMG SRC="l_hauptinhalt.jpg" BORDER=0 width=600 height=85 alt="Link zum NC-Inhalt, Hauptinhalt, JPG, 639x99, Gr&ouml;&szlig;e ca. 29 KB."></A><BR></BODY></HTML>