<html>
<head>
<meta name="description" content="Wolf-INFO">
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="st_wolfinfo.gif" TEXT=black link=blue alink=red bgcolor="#FFFFCC">
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" width="100%" bgcolor="#808080"><font
color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td>
</tr>
</table>

<table border="0" cellpadding="3" cellspacing="3" width="100%">
<tr>
<td valign="top" bgcolor="#C0C0C0"><font color="#000080"><b>Inhalt</b></font>
<p><a href="#a1"><font size="1" face="arial">Hausfrauen-Report
</font></a></p>
<p><a href="#a2"><font size="1" face="arial">Comic Reihe
</font></a></p>
<p><a href="#a3"><font size="1" face="arial">Messe Nachlese
</font></a></p>

<p><center> <a href="mitglieder/zimmer.html">
<img src="st_wolfinfo.jpg" width=90 height=90 border=0></a><br><br><br>
<font size="2"> eMail: </font> <a href="mailto:wozim@t-online.de">
<font size="1" face="arial">wozim@t-online.de</font></a>
</center></p>
<p><a href="NoCover.html"><font size="1" face="arial">Zur&#252;ck zum NoCover-Index
</font></a></p>
</td>
<td valign="top"><a name="a1"><font color="800000" size="7"><center>
<b>Die NoCover - <br> ein Hausfrauenmagazin</font></b></a></center><br>
<p><font size="+1">
Auszug aus einer E-Mail an Gerd Wolpert:</font>
<blockquote>
Nach der Messe setze ich mich mal hin und &#252;berlege intensiv, ob ich nicht
doch eine Erwiederung auf Deinen Diskussionsartikel schreiben werde. Dies ist
beileibe noch keine Zusage, denn vordergr&#252;ndig wird es dann f&#252;r einen
Dritten so ausschauen, dass ich &#252;ber Deinen Artikel beleidigt bin und nur
deshalb antworte. Dann werde ich aber auch ganz deutlich zum Ausdruck bringen,
dass wenn Du die Allgemeinheit anfeuern wolltest, dies auch h&#228;ttest so
formulieren sollen.
</blockquote><blockquote>
Wenn ich den Artikel schreibe, dann sage ich aber auch, dass der Artikel
&#252;ber den Heimatbrauch &quot;Bergische Kaffeetafel&quot; das
unwirtschaftlichste aller denkbaren Rezepte f&#252;r eine Hausfrau ist.
</blockquote></p>
<p><font size="+1">
Das waren meine S&#228;tze in der E-Mail an Gerd Wolpert auf grund seines Artikels
in der Diskussionsrubrik &quot;NoCover - ein Hausfrauenmagazin?&quot; Und wie
nun unschwer zu sehen ist, werde ich mich auch &#246;ffentlich zu diesem
Diskussionsthema &#228;u&#223;ern.</p>
<p>
Als erstes m&#246;chte ich aber klarstellen, dass ich nicht beleidigt bin, einen
Artikel f&#252;r ein &quot;Hausfrauenmagazin&quot; geschrieben zu haben. Mich
st&#246;rte nur die Art und Weise, wie argumentiert wird, dass unser Clubmagazin
zu wenig amigaspezifische Artikel bringe. An einem Biertisch wird auch nicht nur
&#252;ber Bier gesprochen. Und wenn Gerd Wolpert eigentlich nur anregen wollte,
dass wieder vermehrt die alten Schreiberlinge ihren Griffel spitzen und
Beitr&#228;ge &#252;ber unsere Freundin bringen, dann h&#228;tte er es auch
sagen sollen. L&#228;stern und dann mit einem PS-Nachsatz die Spitze nehmen zu
wollen, reicht nicht aus, um jemanden aus seiner Lethargie aufzur&#252;tteln.
Wer am Biertisch einschl&#228;ft, schl&#228;ft fest und den r&#252;ttelt auch
ein spitzer Satz nicht auf.</p></font></td></tr></table>
<p><font size="+1">
Apropos Themen wie Putzmittel und anderes kann doch interessieren, besonders
denjenigen, der seine alten Disketten vom alten Label befreien will, wenn der
F&#246;hn versagt und einem nach der mechanischen Bearbeitung der alte Kleister
so unsch&#246;n und klebrig entgegengl&#228;nzt. In diesem Zusammenhang
f&#228;llt mir ein alter Werbespruch ein. Als seinerzeit Pril auf den Markt kam,
prangte auf den ersten Plakaten: &quot;Drei Spritzer ins Becken und die Hausfrau
jubelt&quot;. Seht ihr, jetzt habt ihr auch gelacht und dies war nicht
amigaspezifisch. &#220;brigens dieser Werbespruch wurde gleich in der ersten
Woche wieder sofort vom Markt genommen und die Plakate hatten einen Seltenheits-
und hohen Sammlerwert.</p>
<p>
Unter amigaspezifischen Artikel verstehe ich aber keinesfalls wieder das
Aufflammen des leidlichen Themas &quot;Amiga the best - PC grrrrrr&quot;. Und
was soll ein armer User nun &#252;ber einen Computer schreiben, der
zwischenzeitig in die Jahre gekommen ist? Durchhalteparolen und &#228;hnliches
ist so abgedroschen wie das eben erw&#228;hnte Thema. Und die Tips und Tricks
sind auch alle schon mindestens dreimal beschrieben worden.</p>
<p>
Also lasst uns doch uns &#252;ber alles m&#246;gliche nachdenken und
unterhalten, denn Lesen will jeder, besonders wenn es neu und vielleicht auch
ein bisschen wissenswert ist. Mit Bla-Bla ist keinem geholfen und die Gefahr der
Lustlosigkeit wird einziehen und sich potenzieren. Dem muss wahrhaftig
entgegengesteuert werden. Und wie ich in der gleichen o.a. Mail geschrieben
habe, die NoCover ist nach meiner Kenntnis das einzigste Magazin, das fast
ausschlie&#223;lich nur von den Beitr&#228;gen seiner Clubmitglieder lebt und
nicht von einem Oberguru erstellt und dann mit einzelnen Beitr&#228;gen
aufgef&#252;llt wird.</p>
<p>
Und wenn der Eindruck entstanden ist, dass eine Einseitigkeit in der NoCover
eingezogen ist und wenn versucht werden soll, die alten Schreiberlinge wieder zu
aktivieren, dann sagt dies doch auch glasklar und startet meinerthalben einen
entsprechenden Aufruf. Mailt die einzelnen an und fragt nach, warum man sich
zur&#252;ckgezogen hat. Oder schreibt einen netten Brief. Ein entsprechender
Aufruf in der NoCover bezweckt hundertprozentig das Gegenteil. Und mit 100%ig
meine ich wirklich absolut und nicht, es k&#246;nnte doch vielleicht oder auch
eventuell oder was was ich sein.</p>
<p>
Einen Nachsatz &#252;ber die Bergische Kaffetafel lasse ich doch bleiben. Nur
soviel, wer sie einmal probieren m&#246;chte muss sich am besten mit einer
Gruppe in einem Ausflugslokal anmelden (mindestens 5 Personen) und kann dann mit
einem Obulus von ca 18.- DM rechnen. In einer gr&#246;&#223;eren Gruppe (30
Personen) gibt dies einen Heidenspass.
</font></p>
<p>
<a name="a2"><font color="800000" size="7"><center>
<b>Comic Reihe</font></b></a></center></p>
<p><font size="+1">
Nur weil wie in der NoCover &#252;blich kein Feedback zu einem Artikel
r&#252;berkommt, sollte man die Flinte keinesfalls vorzeitig wegwerfen. Von der
gesamten NoCover Leserschaft gibt es bestimmt nur sehr wenige, die Eure Cartoons
nicht anschauen. Ein paar mehr werden es sein, die die Texte nicht lesen, weil
sie eventuell gem&#228;&#223; der eigenen Konfiguration nicht richtig angezeigt
werden, oder man hat einen falschen oder zu alten Browser, womit das Betrachten
keinen allzu gro&#223;en Spa&#223; macht.</p>
<p>
Aber ich kann euch beiden, Oliver und Thomas, ehrlich sagen, dass die Comic
- Reihe keinesfalls eingestellt werden sollte. Und schon w&#252;sste ich nicht,
wie es trotz des gerissenen Seils weitergehen wird. Denn dieses als Grund
heranzuziehen, um hier ein Ende zu machen, finde ich gar nicht so gut und ist
auch ein wenig einfallslos. Nat&#252;rlich ist irgendwann einmal eine Geschichte
zu Ende, aber das ist doch kein Grund, keine neue zu beginnen.</p>
<p>
Eine Anmerkung h&#228;tte ich aber und das ist die Fotogr&#246;&#223;e. 420*522
und das im Programm auf 100*100 dargestellt, ist reine Platzvergeudung. Die
verwendeten 123 KB k&#246;nnen durch Reduzieren auf eine Bildgr&#246;&#223;e von
210*260 (= 50 %) auf 18 KB verringert werden. Und als Passbild in der Gr&#246;&#223;e
105*130 (= 25 %) sind es blo&#223; noch 6 KB Speicherbedarf. Das solltet ihr schon ein
wenig ber&#252;cksichtigen.</font></p>
<p>
<a name="a3"><font color="800000" size="7"><center>
<b>Messe Nachlese</font></b></a></center></p>
<p><font size="+1">
Als treuer Messeg&#228;nger habe ich den Aufstieg und den langsamen und sicheren
Untergang der K&#246;lner Messe miterlebt. Mit dem Verschwinden von Commodore nahmen
trotz Anstrengungen auch die Zahl der Messebesucher seit 1994 kontinuierlich ab.
Man versuchte mit &quot;Action&quot; wie Ballspiele, Klettern und Kraft&#252;bungen im Jahre
1996 nochmals die Wende zu erzwingen. Die Messe im vergangenen Jahr hatte
wirklich den Eindruck eines Ausverkaufs aufkommen lassen. Und dieses Jahr?</p>
<p>
Als Resumee kann man dies ehrlich so oder so sehen. Pessimisten gibt es &#252;berall.
So versuche ich nun das drei Tage lange Messetreiben mit wohlwollenden Augen zu
betrachten. Schlie&#223;lich war ich an zwei Tagen von morgens bis zum sp&#228;ten
Nachmittag da und darf mit Fug behaupten, ich kann etwas mitreden. Ob ich den
richtigen und wahren Durchblick besitze, wage ich selbst zu bezweifeln, denn ich
versuche mit gro&#223;er Anstrengung ein paar wohlwollende Worte zu finden.</p>
<p>
Zu den Ger&#252;chten anl&#228;sslich der abendlichen Pressekonferenz vom Freitag, die
ganz pl&#246;tzlich und vehement schon am Samstag kursierten, werde ich mich nicht
&#228;u&#223;ern. Erstens habe ich das Originalstatement nicht geh&#246;rt und zweitens sind
meine Englischkenntnisse wahrscheinlich nicht ausreichend, um den tats&#228;chlichen
Trent erkennen zu k&#246;nnen. Wir wissen doch alle, dass solche Erstank&#252;ndigungen
immer sehr vorsichtig und vor allem zwischen den Zeilen durchleuchtet werden
m&#252;ssen. Und diesen Sachverstand traue ich mir nicht zu. Das hei&#223;t nicht, dass
ich keine eigene Meinung h&#228;tte, nur die sieht nicht ganz so rosarot aus, wie
alle jetzigen und eingefleischten Amigauser &#252;ber die &quot;Classik&quot;-Zukunft lesen und
h&#246;ren m&#246;chten. Eines ist jetzt aber schon sonnenklar, wer bisher nicht etwas
aufger&#252;stet hatte und nicht auf OS 3.x f&#228;hrt, der hat in Zukunft &#252;berhaupt keine
Chance mehr. Die einzigste Zukunft, die ich noch sehe, ist Turbo, Turbo und nochmals Turbo
und dann reichlich RAM. Anschlie&#223;end ist zu &#252;berlegen, seinen Geldbeutel zu befragen  und 
dann eventuell auf OS 3.5 zu gehen und dann abzuwarten. Erst zwei Jahre bis zur Einf&#252;hrung
des neuen Amiga mit seiner &quot;offenen Architektur&quot; und wenn dies wirklich was ist,
dann vielleicht zwei weitere Jahre warten, bis die Preise fallen. Wenn das alles
ein Trugschluss war, dann trete ich dem kleinen sich neu etablierenden Fan-Club
bei, der sich wie die anderen, wie f&#252;r C64, Atari und andere, gegr&#252;ndet haben
wird. &#220;brigens als OS 3.0 User werde ich warten, bis ein Bundle von OS 3.5 und
OS 3.1 ROM angeboten wird und nicht vorher schon umsteigen, um aufw&#228;rtskompatibel
zu werden. Schlie&#223;lich wollen die Entwickler bestimmt etwas verdienen und da
k&#246;nnen sie sich nicht nur auf die OS 3.1 Anwender verlassen. Andere m&#252;ssen auch
gewonnen werden. Warum also jetzt zweimal Geld ausgeben?</p>
<p>
Dieser Artikel sollte eine kleine Messenachlese werden und keine schwarze
Zukunftsprognose. Aber die Zukunft ist halt mal das Thema Nummer Eins. Auch bei
den Treffen unserer Mitglieder, sich sich in Gruppen zusammensetzten und
flei&#223;ig diskutierten.</p>
<p>
Am APC&amp;TCP-Stand war immer viel los, und wenn sich dort die Senioren trafen.<br>
<nobr><center>
<img src="st_wolfinfo1.jpg" width=288 height=198 border=0>
<img src="st_wolfinfo2.jpg" width=288 height=198 border=0>
</nobr></center></p>
<p>
Aber auch jugendliche Mitglieder trafen sich und diskutierten.<br>
<nobr><center>
<img src="st_wolfinfo3.jpg" width=288 height=198 border=0>
<img src="st_wolfinfo4.jpg" width=288 height=198 border=0>
</nobr></center><br>
(Anmerkung: Die Fotos habe ich aus Platzgr&#252;nden so klein belassen. Eine Normalgr&#246;&#223;e
ben&#246;tigt über 100 KB.)
</p>

<p>
Ein pers&#246;nlicher H&#246;hepunkt der Messe f&#252;r mich war die lange und sehr ergiebige
Unterhaltung mit Dr. Greg Perry &#252;ber das neue Magellan II, das er mir dabei
auch vorf&#252;hrte. Meine Augen waren bestimmt so gro&#223; wie Untertassen, so habe ich
gestaunt, was man alles damit anfangen kann. Man liest zwar die Dokumentation,
versteht die H&#228;lfte und setzt vielleicht ein Zehntel um und glaubt, was f&#252;r
ein toller Hecht man ist. Ich habe wirklich nur gestaunt und wenn ich wenigstens
ein Viertel nur behalten h&#228;tte, w&#228;re meine Konfiguration schon ein supergalaluxus
Rolls-Royce gegen&#252;ber dem jetzigen Zustand. Aber nun werde ich mich anstrengen
und hoffentlich habe ich bald ein DirOpus auf meinem Rechner, dass ich nur noch
selber staunen kann.
</font></p>
<center>
<table border="0" width=100% bgcolor="#808080"><tr><td>
<br>
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://home.chiemgau.com/amagerl/members/wolf"> http://home.chiemgau.com/amagerl/members/wolf </a>
<br><br>Gehe &#160; <a href="#top"> zum Anfang </a><br>
</table></center><br>
</body>
</html>

