<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>IOBlix v1.3 - sarja- ja rinnakkaislaajennus</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><a href="http://www.saunalahti.fi/halmej/" target="_blank">Joni Halme</a> &lt;<a href="mailto:halmej@saunalahti.fi">halmej@saunalahti.fi</a>&gt;</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vanha 56k-modeemini py&ouml;ri hyvin nettik&auml;yt&ouml;ss&auml; Amigan sis&auml;isell&auml; sarjaportilla. Kun vaihdoin kiinte&auml;&auml;n 128k-ISDN-yhteyteen, tuli vanhasta sarjaportista seuraava nopeuden pullonkaula. Tarvittiin nopeampi sarjaportti, joka pysyisi ISDN:n mukana ja veisi rasitusta prosessorilta. Rinnakkaisportissa oli sama ongelma. Tulostus sis&auml;isen rinnakkaisportin l&auml;pi oli hidasta ja s&ouml;i prosessoriaikaa aivan liikaa. Tulostan paljon valokuvia, joista monet ovat isoja. A4-valokuvaan meni aikaa noin 85 minuuttia. En odottanut laajennuksen nopeuttavan tulostusta, mutta odotin sen poistavan rasituksen prosessorilta, ja se riitti. Otin yhteytt&auml; Gentle Eye:hin ja kysyin, mik&auml; on paras vaihtoehto Zorro-koneelle. Boogie vastasi selv&auml;sti, ett&auml; IOBlix on sarja- ja rinnakkaislaajennuskorttien Rolls Royce. Yksi sellainen, kiitos.</font></p>
						<div align="center">
							<p><img src="kuvat/ioblix.gif" width="400" height="161" border="0"></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">IOBlix on ZorroII-kortti, ja se sopii Amiga 2/3/4000 -malleihin sek&auml; Zorro-laajennuksella varustettuihin Amiga 1200 -malleihin. Kortissa on nelj&auml; nopeaa 9-pin-sarjaporttia ja kaksi ECP/EPP-rinnakkaisporttia. Sarjaportit sis&auml;lt&auml;v&auml;t 64 tavun FIFO:n ja rinnakkaisportit 16 tavun FIFO:n. Sis&auml;inen FIFO voidaan p&auml;ivitt&auml;&auml; 8 kilotavuun. Sarjaportin nopeus on teoriassa 1,5 Mbps, mutta todellisuudessa saadaan vain 460 kbps, mik&auml; on kyll&auml; enemm&auml;n kuin tarpeeksi. Rinnakkaisportit tukevat uni- ja bidirectional-tiloja ja ovat yhteensopivia kaikkien tulostimien kanssa (muka... t&auml;st&auml; lis&auml;&auml; j&auml;ljemp&auml;n&auml;). EPP/ECP-tila sallii skannereiden, ZIP-asemien yms. k&auml;yt&ouml;n.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kortilla on my&ouml;s laajennusliitin, joka tukee IOBlix-Ethernet-korttia. Ty&ouml;n alla on my&ouml;s AHI-yhteensopiva &auml;&auml;nikortti. Saamani kortti oli kumminkin vanhempaa versiota, ja jos Ethernet-korttia olisi siihen halunnut, olisi kortti pit&auml;nyt p&auml;ivitt&auml;&auml; valmistajalla. T&auml;h&auml;n ruljanssiin en ryhtynyt, koska omistan jo toimivan verkkokortin. Laajennuksesta voit k&auml;yd&auml; katsomassa lis&auml;&auml; tietoa valmistajan kotisivuilla. Kortti sis&auml;lt&auml;&auml; my&ouml;s IrDA-portin infrapunalaitteille. Ohjeissa t&auml;lle luvataan ohjelmistoa, mutta itse en ole sellaisia n&auml;hnyt.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kortti tulee koolleen sopivassa hyvin pehmustetussa laatikossa, ja sis&auml;lt&auml; l&ouml;ytyy itse kortti, ajurilevyke, muutaman A4-sivun k&auml;sitt&auml;v&auml; manuaali, seitsem&auml;n takalevy&auml;, nelj&auml; sarjaportin johtoa sek&auml; yksi rinnakkaisportin johto. Asennus k&auml;vi suhteellisen vaivattomasti: kone auki, vanha MultiFaceCard III pois ja IOBlix tilalle. Asensin lis&auml;ksi yhden takalevyn, jossa on paikka yhdelle sarja- ja yhdelle rinnakkaisportille. Johdot kiinni, kansi kiinni ja kone p&auml;&auml;lle.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Koska levyasemani oli telakalla, olin hakenut etuk&auml;teen Aminetista uusimman version ajureista ja ohjelmista. Installer asensi ajurit koneelle hetkess&auml;. DEVS:-kansioon laitettiin IOBlixser- ja IOBlixpar-devicet sek&auml; Storage/dosdrivers-kansioon SER00- ja PAR00-mountit. User-startupia viel&auml; muokattiin siten, ett&auml; k&auml;ynnistyksen yhteydess&auml; ajetaan SetupIOBlix, joka aktivoi kortin. Softassa on my&ouml;s mukana QueryIOBlix-ohjelma, joka tutkailee kortin sielunel&auml;m&auml;&auml;. Ajoin sen ja sain tulokseksi pitk&auml; listan teknist&auml; tietoa, jonka lopputulos oli ett&auml; kortti toimii. Ohjelma l&ouml;ysi jopa tulostimeni ja antoi tiedot siit&auml;kin.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">(Huom! Muistutan viel&auml; kerran: Ota koneesta virta pois, ennen kuin kun aloitat laitteiden kytkemisen!) Kun ajurit olivat kunnossa ja kortissa oli ISDN kiinni, konfiguroin Miamin k&auml;ytt&auml;m&auml;&auml;n sis&auml;isen sarjaportin sijaan IOBlixin porttia. Nopeuden nostin heti 115 kbps:st&auml; 230 kbps:&auml;&auml;n. Kokeilin my&ouml;s 460 kbps:&auml;&auml;, mutta silloin ei ISDN-modeemi en&auml;&auml; vastannut. Klikkasin linjoille ja huokaisin helpotuksesta, kun en ollut onnistunut rikkomaan mit&auml;&auml;n asennuksen aikana, ja Miami meni linjoille.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Totta kai halusin heti p&auml;&auml;st&auml; testaamaan vauhtia, ja l&auml;hdin surffailemaan Voyagerilla. Surffaillessa ei nopeuseroa huomaa, joten p&auml;&auml;tin l&auml;hte&auml; imuttamaan ohjelmistoa FTP:ll&auml;. Sitten nopeuseron kyll&auml; huomasi. Maksimi siirtonopeus oli kasvanut 10280 cps:st&auml; 14000 cps:&auml;&auml;n, eli ero oli huomattava. T&auml;ss&auml; vaiheessa mainostan kaikille FTP-ohjelmaksi AmiTradeCenter-nimist&auml; ohjelmaa, jonka l&ouml;yd&auml;t Aminetista ja joka on ilmainen. Parasta siin&auml; on, ett&auml; voit halutessasi saada tiedonsiirrosta kaiken haluamasi tiedon. Siirron aikana voit seurata pariakymment&auml; eri edistysmittaria siirrosta.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Sitten kokeilemaan toista t&auml;rke&auml;&auml;, eli rinnakkaisporttia. Laitoin Epson Stylus Photo 750:n kiinni korttiin, laitoin sormet ristiin ja klikkasin &quot;tulosta&quot;. Ensimm&auml;inen ongelma tuli eteen: pieni&auml; kuvia tulostettaessa tulostin sotkee kuvia, ja valokuvat tulevat pihalle ASCII-m&ouml;ss&ouml;n&auml;. Kokeilin muuttaa TurboPrint 7:n asetuksia, mutta siit&auml; ei ollut apua. Kokeilin WB:n ajureita, ei sittenk&auml;&auml;n. Varmistin kaikki johdot, liittimet jne., eik&auml; mik&auml;&auml;n auttanut. Nyt otti p&auml;&auml;h&auml;n. L&auml;hetin postia RBM:lle, ja arvaahan sen, ettei heilt&auml; kuulunut mit&auml;&auml;n... Milt&auml; firmalta nyt kuuluisi. Hain RBM:n kotisivuilta viel&auml; varmuuden vuoksi varmasti uusimman version ajureista, mutta sek&auml;&auml;n ei auttanut.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yksinkertaisen tekstin ja pienten tulostusten tuuppaus onnistuu ongelmitta, mutta v&auml;h&auml;nkin vaativampi tulostus ja homma menee keturalleen. Seuraavaksi otin yhteytt&auml; TurboPrintin tekij&auml;&auml;n. T&auml;h&auml;n ongelmaan en l&ouml;yt&auml;nyt ratkaisua ennen Sakun julkaisup&auml;iv&auml;&auml;, mutta pidet&auml;&auml;n peukut pystyss&auml;. Jos joku teist&auml; tiet&auml;&auml; ongelman syyn, niin laita ihmeess&auml; minulle postia.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yhteenvetona sanoisin, ett&auml; jos tuo tulostusongelma onkin vain minun koneessani, niin IOBlix on IO-korttien Rolls Royce. Se n&auml;kyy ik&auml;v&auml; kyll&auml; sitten hinnassakin.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.shoprouter.de/shop.asp?shop=13" target="_blank"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">rbm-datentechnik</font></a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Edustaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://www.ge.vip.fi" target="_blank">Gentle Eye Ky</a>, puh. (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a></font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">950 mk (elokuu 2001)</font></td>
				</tr>
			</table>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<center></center>
		</center>
	</body>

</html>