<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Nokia Communicator 9210</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><a href="http://www.saunalahti.fi/halmej/" target="_blank">Joni Halme</a> &lt;<a href="mailto:halmej@saunalahti.fi">halmej@saunalahti.fi</a>&gt;</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kes&auml;kuussa 2000 p&auml;&auml;tin ostaa ensimm&auml;isen k&auml;nnykk&auml;ni. Armeijakin odotti, ja siell&auml; puhelin on kova sana. Halusin ehdottomasti sellaisen, jolla voisin lukea s&auml;hk&ouml;postit, ja jos mahdollista, my&ouml;s k&auml;yd&auml; lukemassa uusimmat Amiga-uutiset. En my&ouml;sk&auml;&auml;n halunnut mit&auml;&auml;n parin sadan tusinak&auml;nnykk&auml;&auml;. L&ouml;in tiskille tukun seteleit&auml;, yksi Communicator, kiitos. Silloinen uusin malli 9110 oli hieno, ja siin&auml; oli kaikki mit&auml; halusin. Ominaisuuksille ei n&auml;kynyt loppua. Nyt 10 kuukauden j&auml;lkeen tuli markkinoille uusi Communicator 9210, joka edustaa k&auml;nnyk&ouml;iden uutta kuninkuusluokkaa. Enp&auml; halunnut j&auml;&auml;d&auml; pois kehityksen k&auml;rjest&auml; - yksi 9210, kiitos.</font></p>
						<div align="center">
							<p><img src="kuvat/9210_pose.jpg" width="400" height="349" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">9210-kommunikaattoria on odoteltukin jo pitk&auml;&auml;n. Itse p&auml;&auml;sin ottamaan puhelimeen ensikosketuksen samana p&auml;iv&auml;n&auml;, kun ensimm&auml;iset yksil&ouml;t saapuivat puhelinyhti&ouml;lle. 9210 hohkaa luksusta jo muotoilullaan. Vanha tumma on v&auml;istynyt tyylikk&auml;&auml;n harmaan ja hopean tielt&auml;. Kulmia on py&ouml;ristetty lis&auml;&auml;. Puhelimen koko on s&auml;ilynyt suunnilleen samana kuin 9110:ssa, mutta paino on pudonnut huomattavasti. Puhelimen n&auml;ytt&ouml; on hieman pienempi, vaikka teksti&auml;h&auml;n siihen mahtuu yht&auml; silti yht&auml; paljon, ja n&auml;ytt&ouml; valaistuu nyt valkoisena vihre&auml;n sijaan. Ja nyt my&ouml;s kommunikaattorissa on turhat animaatiot valikoissa. :)</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kaikkihan sen tiet&auml;v&auml;t, ett&auml; kommunikaattorit ovat isoja. 158 mm x 56 mm x 27 mm on reilusti, mutta puhelin on siltikin mukava k&auml;ytt&auml;&auml;, ja minusta puhelimen onkin oltava kookas eik&auml; mik&auml;&auml;n &quot;hitut&ouml;tter&ouml;&quot;. K&auml;teen puhelin menee kivasti, kuljettaminen on ik&auml;v&auml;&auml; esim. taskussa. Vy&ouml;laukku on mielest&auml;ni ainoa j&auml;rkev&auml; vaihtoehto. Onhan kommunikaattori aikamoinen &quot;pippelinjatke&quot;, joten ihan mielell&auml;&auml;n sit&auml; vy&ouml;ll&auml; kuljettaakin... :) Vy&ouml;laukku minulla olikin jo ennest&auml;&auml;n. Hintaa moisella on kolmatta sataa, mutta on pakkohankinta.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Avasin puhelimen tieturiosan. N&auml;ky oli vaikuttava: tieturi tervehti minua isolla Nokian tutulla &quot;k&auml;det&quot;-kuvalla. Harmaa v&auml;ritys jatkui tieturissakin, ja n&auml;pp&auml;imist&ouml; on kasvanut huomattavasti entisest&auml;. N&auml;pp&auml;imet my&ouml;s erottuvat nyt paremmin. N&auml;pp&auml;imist&ouml;n voi jakaa karkeasti kolmeen osaan: perusn&auml;pp&auml;imist&ouml; eli aakkoset, numerot, vaihto-, enter- yms.; sovellusn&auml;pp&auml;imet, jotka l&ouml;yt&auml;v&auml;t perusn&auml;pp&auml;imist&ouml;n yl&auml;puolelta eli desk, telephone, messaging, Internet, contacts, calendar, office ja extras sek&auml; kolmanneksi n&auml;yt&ouml;n vieress&auml; olevat nelj&auml; painiketta, joiden tarkoitus vaihtelee ohjelmasta ja paikasta riippuen.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Entist&auml; 9110:n k&auml;ytt&auml;j&auml;&auml; h&auml;iritsee pari asiaa: hieman muuttunut n&auml;pp&auml;inkartta ja herk&auml;t nuolin&auml;pp&auml;imet. Aina kun haluan pisteen, painankin vahingossa help-n&auml;pp&auml;int&auml;, ja tieturi latailee ohjetekstin n&auml;kyviin. Nuolin&auml;pp&auml;imet ovat todella herk&auml;t ja tahtovat menn&auml; aina v&auml;&auml;r&auml;&auml;n suuntaan. Minusta 9210 on edellist&auml; mallia paljon monimutkaisempi k&auml;ytt&auml;&auml;; jokin tietty asetus voi olla kymmenen alavalikon takana, yhteen tiettyyn asiaan voi olla kymmenen lyhennett&auml; jne. T&auml;m&auml; taitaa kuitenkin olla v&auml;ltt&auml;m&auml;t&ouml;n paha ja siedett&auml;viss&auml;. Suomenkielinen k&auml;ytt&ouml;liittym&auml; ja n&auml;pp&auml;imen painalluksen takana oleva ohjeteksti auttavat k&auml;yt&ouml;ss&auml;.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ensiksi tieturi kyselee henkil&ouml;tietojasi, aikaa ja maantieteellist&auml; sijaintiasi. Annettuasi tiedot aukeaa tieturin ty&ouml;p&ouml;yt&auml;. Ty&ouml;p&ouml;yd&auml;ll&auml; on oma taustakuvansa ja muutama ikoni. Kuten vanhoissakin kommunikaattoreissa, n&auml;yt&ouml;n vasemmassa laidassa n&auml;kyy kellonaika, verkko ja akun lataus. Oikealla laidalla on n&auml;yt&ouml;n nelj&auml;n n&auml;pp&auml;imen kulloinenkin tarkoitus. Aiemman kommunikaattorin omistajalle ohjelmissa liikkuminen tulee kuin vanhastaan, mutta uudellekin k&auml;ytt&auml;j&auml;lle, jolla on v&auml;h&auml;nkin p&auml;&auml;ttelykyky&auml;, tieturi on helppo k&auml;ytt&auml;&auml;. N&auml;yt&ouml;ll&auml; liikut paikasta toiseen nuolin&auml;pp&auml;imill&auml; ja valinnat suoritat enterill&auml;. Menu-painikkeesta saat auki tietokonemaisen yl&auml;valikon, josta l&ouml;ytyy paljon lis&auml;&auml; vaihtoehtoja ohjelmalle. Tietokoneesta tuttuja toimintoja ovat mm. tulosta, esikatselu, leikkaa, liit&auml; ja kopioi.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kun olin tehnyt sinunkaupat 9210:n kanssa, aloin muokata asetuksia. Muokkasin k&auml;ytt&ouml;liittym&auml;&auml; haluamakseni. K&auml;ytt&ouml;liittym&auml;ll&auml; tarkoitan taustakuviointia, k&auml;ytt&ouml;liittym&auml;n v&auml;ri&auml; sek&auml; kirkkaus- ja kontrastiasetuksia. Ty&ouml;p&ouml;yd&auml;n taustakuvankin voi muuttaa, kunhan l&ouml;yt&auml;&auml; jostain sopivan. Tein Internet-yhteyden ja kolme s&auml;hk&ouml;postitili&auml;. Muokkasin kalenteria haluamakseni. Muokkasin profiileja ja leikin soitto&auml;&auml;nill&auml;. Siirsin infrapunalla vanhasta 9110:stani osoitekortit, tiedostoja ja soitto&auml;&auml;ni&auml; 9210:een. &Auml;&auml;nist&auml; sen verran, ett&auml; kommunikaattoreissa soitto&auml;&auml;ni on hieman erilainen kuin &quot;tavallisissa&quot; puhelimissa. 9110:ssa &auml;&auml;ni oli matala ja pehme&auml;, mutta k&auml;rsi korkeammissa &auml;&auml;niss&auml;. 9210:ss&auml; &auml;&auml;ni on taas paljon kirkkaampi. Mutta kukapa sellaisia k&auml;ytt&auml;&auml;, kun voi laittaa soitto&auml;&auml;neksi WAV-biisej&auml;... Soitto&auml;&auml;ni&auml; voit asentaa niin paljon kuin sielu siet&auml;&auml;.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kun k&auml;yt&auml;t kommunikaattoria pidemp&auml;&auml;n, l&ouml;yd&auml;t siit&auml; koko ajan hienompia ominaisuuksia. Monet niist&auml; huomaa vasta pidemm&auml;n k&auml;yt&ouml;n j&auml;lkeen. Kommunikaattori on aivan eri luokkaa muiden puhelimien kanssa. Se on enemm&auml;nkin tietokone, jossa on k&auml;nnykk&auml;. Kaikki soitto&auml;&auml;net, tekstiviestit, faksit, kuvat yms. py&ouml;riv&auml;t k&auml;siss&auml;si tiedostoina. Voit muokata hakemistorakenteita ja selailla muistia tiedostonhallintaohjelmalla. Puhelimessa on my&ouml;s nauhuri johon 9210:n vakiomuistilla voi jutustella noin 10 minuuttia. Tekstiviestin pituus ei ole rajoitettu 160 merkkiin tai mihink&auml;&auml;n tiettyyn lukuun, vaan voit kirjoittaa tekstiviesti&auml; niin paljon kun muistia riitt&auml;&auml;. 9110:lla testasin leikkaa/liimaa-toiminnon avulla tekstiviestin pituudeksi 30 000 merkki&auml;, ja se on paljon se. Pitk&auml; tekstiviestih&auml;n menee vastaanottajalle p&auml;tkittyn&auml; 160 merkin tekstiviesteihin... Laskua tulisi aika ik&auml;v&auml;sti, mutta olisi se aika hienoa, kun kaverille alkaa tulla tekstiviestej&auml; loputtomasti ja puhelin huutaa hoosiannaa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Puhelin ja tieturi k&auml;ytt&auml;v&auml;t samoja kommunikaattorin muistista saatavia tietoja, eiv&auml;tk&auml; siis ole erillisi&auml; laitteita. Esim. kannen puhelin osaa k&auml;ytt&auml;&auml; nimi&auml; ja numeroita tieturin osoitekirjasta, ja tieturi k&auml;ytt&auml;&auml; puhelinta &auml;&auml;ni- ja dataviestint&auml;&auml;n. Puhelimen valikkosysteemi on paljon yksinkertaisempi kuin muissa k&auml;nnyk&ouml;iss&auml; johtuen siit&auml;, ett&auml; paljon toimista tehd&auml;&auml;n tieturin puolella. Yksi uutuus 9110:een verrattuna on mahdollisuus kirjoittaa tekstiviestej&auml; my&ouml;s puhelimella. 9110:lla tekstiviestit kirjoitettiin aina tieturilla.</font></p>
						<div align="center">
							<p><img src="kuvat/9210_czech.jpg" width="400" height="154" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Sitten oli aika kokeilla nettiominaisuuksia. 9210 tukee nopeuksia aina 43,2 kbps:&auml;&auml;n asti - pienoinen parannus edelliseen 14,4 kbps:&auml;&auml;n verrattuna. Testasin netti&auml; kahdella nettiliittym&auml;ll&auml; ja Radiolinjan ja DNA:n liittymill&auml;. P&auml;&auml;sin vain analogisella 28,8k nopeuteen, ISDN-ominaisuudella p&auml;&auml;sisi 33,6k- ja 43,2k-nopeuksiin. Iitse en viel&auml; saanut niit&auml; toimimaan. Kun p&auml;&auml;sin nettiin, en uskonut silmi&auml;ni, kun olin aiemmin k&auml;ytt&auml;nyt 9110:n selainta. Sivut n&auml;kyiv&auml;t juuri kuin tietokoneen selaimellakin, taulukot, kehykset, kuvat ja muotoilut. Selaimesta ei ollut mit&auml;&auml;n valittamista.</font></p>
						<div align="center">
							<p><img src="kuvat/9210_wap.jpg" width="400" height="193" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">WAP-selainkin k&auml;nnyst&auml; luonnollisesti l&ouml;ytyy. Wappia varten jouduin luomaan uuden nettiyhteyden, ja t&auml;h&auml;n testasin DNA:n wappia. Kuten varmaan arvaattekin, on wappailu ihan eri luokkaa kuin pienell&auml; n&auml;yt&ouml;ll&auml;. Testasin nopeasti Amigan WAP-uutisia ja paria muuta sivua. Jos oikein k&auml;sitin, voit wappailla my&ouml;s puhelimen n&auml;yt&ouml;ll&auml;, mutta sit&auml; en testannut. DNA:n liittym&auml;ll&auml; saat puhelimen puolelle my&ouml;s DNA-lis&auml;valikon, josta p&auml;&auml;see WAP-palveluihin ja muuttamaan omaa DNA-sivuaan, mutta sit&auml;k&auml;&auml;n en testannut.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tarkoituksenani oli alkaa asentaa puhelimeen muutama kymmenen soitto&auml;&auml;nt&auml;, WAVeja, taustakuvia yms., ja pelej&auml;kin k&auml;vin hakemassa. Mutta kun tiedonsiirto-ohjelma on tehty Windowsille, niin totta kai se kaatui, kun yritin ty&ouml;paikan PC:lle moista asentaa - t&auml;m&auml;n melkein jo arvasikin. Asensin ohjelman toiselle koneelle, ja sitten sainkin tieturiin kasan korttipelej&auml;, matopelin ja triplepopin. 9210:n CD:ll&auml; tulee nelj&auml; peli&auml;, mutta Club Nokian kautta l&ouml;ytyy lis&auml;&auml;. Pelit olivat ihan asiallisia. Jos jostain pit&auml;isi valittaa, niin pasianssia on ik&auml;v&auml; pelata, kun kortit ovat liian pieni&auml; ja pelin k&auml;ytt&ouml;liittym&auml; on huono. T&auml;t&auml; kirjoittaessa 9210:lle l&ouml;ytyy 7-8 peli&auml;, joista viisi on ilmaisia - parhaat tietenkin maksavat.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">My&ouml;s ohjelmia on jo tehtyn&auml;, mainittakoon esim. Realplayer, joka soittaa Realaudio- ja -mediatiedostoja. En viel&auml; &auml;ehtinyt testailemaan 9210:n video-ominaisuuksia. </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Muutaman p&auml;iv&auml;n k&auml;yt&ouml;n j&auml;lkeen olen saanut tieturin kaatumaan jo kaksi kertaa, tosin nekin kyll&auml; testaillessa ominaisuuksia, ja ehk&auml; roplasin jotain, jota ei olisi pit&auml;nyt roplata. Mutta ettei vain Nokia olisi ottanut liikaa mallia Microsoftilta... ;)</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.nokia.fi" target="_blank"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Nokia</font></a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Linkkej&auml;:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.nokia.fi/9210/etusivu0.html" target="_blank"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Nokia 9210:n kotisivu<br>
							</font></a><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://www.nokia.fi/matkapuhelimet/9210.html" target="_blank">Tietopaketti 9210:st&auml;</a></font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">6900 mk (hein&auml;kuu 2001)</font></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ruusuja:</font></td>
					<td width="50%" bgcolor="#d8ecfd">
						<ul>
							<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&auml;lytt&ouml;m&auml;n tyylik&auml;s</font>
							<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">kookas v&auml;rin&auml;ytt&ouml; ja tehokas prosessori</font>
							<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Internet-ominaisuudet</font>
							<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Java-tuki</font>
							<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">HSCSD-tuki</font>
							<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">mukava k&auml;ytt&ouml;liittym&auml; ja iso n&auml;pp&auml;imist&ouml;</font>
							<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">loputtomat ominaisuudet</font>
						</ul>
					</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Risuja:</font></td>
					<td width="50%" bgcolor="#d8ecfd">
						<ul>
							<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">sikakallis</font>
							<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">suuri koko (vy&ouml;laukku on pakkohankinta)</font>
						</ul>
					</td>
				</tr>
			</table>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>