<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN"-->
<HTML>
<HEAD>
    <TITLE>AmZeiger - InfoNetz-Mailingliste</TITLE>
    <META NAME="keywords"    CONTENT="Amiga,Online,Magazin,Computer,Zeitschrift,AmZeiger">
    <META NAME="author"      CONTENT="Gregor Franz">
    <META NAME="description" CONTENT="Der AmZeiger - Deutschsprachige Amiga Online Zeitschrift">
</HEAD>
<BODY BACKGROUND="images/bg.gif">

<H2 ALIGN=CENTER><U>Die AmZeiger InfoNetz-Mailingliste</U></H2>

<CENTER>
<FONT SIZE=2> <A HREF="#kurz">KURZ&Uuml;BERBLICK<BR>
<A HREF="#ueber">&Uuml;ber</A> / <A HREF="#anm">Anmeldung</A> / <A HREF="#abl">Ablauf</A> / <A HREF="#ben">Benutzung</A></FONT>
</CENTER>

<HR WIDTH=70% ALIGN=CENTER>

<a name="kurz"><u><h3 align=center>KURZ&Uuml;BERBLICK</h3></u></a>
<ul>
<p><li>Bevor sie weitermachen, <a href="#ueber">informieren</a> Sie sich &uuml;ber diese Liste!</li>
<li>Sollte die Registrierung auf der dementsprechenden <a href="infml.htm">Seite</a> nicht klappen oder
wenn Sie sich per eMail anmelden wollen, so senden Sie eine eMail an: 
<a href="mailto:AmZInfo-subscribe@listbot.com">AmZInfo-subscribe@listbot.com</a>.</li>
<li><b>Beachten</b> Sie bitte, daﬂ Sie keine <a href="#uml">Umleitadresse</a> verwenden d&uuml;rfen, damit
der Service funktioniert, Sie k&ouml;nnen ansonsten nicht als Urheber eigener
Beitr&auml;ge identifiziert werden.</li>
<li>Nach einer Registrierung erhalten Sie eine eMail, die Sie replien m&uuml;ssen.</li>
<li>Nun sind Sie Mitglied!</li>
<li>Was Sie tun m&uuml;ssen, um sich <a href="#aus">auszutragen</a>, Ihren <a href="#acc">Listbot-Account</a> zu ver&auml;ndern
oder was Sie zur <a href="#ben">Benutzung</a> des InfoNetzes beachten m&uuml;ssen, erfahren Sie ausf&uuml;hrlich
im untenstehenden Text!</li>
</ul>

<hr width=50% align=center>

<a name="ueber"><u><h3 align=center>&Uuml;ber das AmZeiger-Infonetz:</h3></u></a>

<p><b>Das Infonetz ist eine Mailingliste</b>, die in erster Linie zur <b>Diskussion</b> 
zwischen Lesern und Redakteuren des AmZeigers, sowie zwischen Lesern und 
Amiga-Benutzern untereinander gedacht ist.</p> 

<p>Leser k&ouml;nnen W&uuml;nsche zu Testberichten und Schwerpunkten &auml;u&szlig;ern, Fragen
stellen und Interessierte auf Updates und Probleml&ouml;sungen hinweisen.</p>

<p>Wir suchen den <b>direkten Kontakt</b> zu den Lesern und hoffen auf rege
Beteiligung. Das verbreiten von Neuigkeiten ist nicht der Sinn dieser
Mailingliste, auch wenn die eine oder andere Meldung sicher ihren Weg 
hineinfinden wird, aber grunds&auml;tzlich gibt es gen&uuml;gend andere Quellen
daf&uuml;r.</p>

<p>Auch wird es hier <b>keine Flame-Kriege</b>, Dispute &uuml;ber Footer oder &uuml;ber 
physische bzw. psychische Eigenschaften der Mitglieder geben, denn 
wir sind einfach eine Gemeinschaft netter :), am Amiga interessierter 
Leute.</p>

<p>
--<br>
<b>Wenn Sie Mitglied werden wollen, lesen Sie bitte die folgenden Hinweise
aufmerksam durch und heben Sie sich diesen Text auf, wenn Sie den AmZeiger 
nicht installiert haben!</b><br>
--</p>

<a name="anm"><u><h3 align=center>Wie melde ich mich an?</h3></u></a>

<p>Gehen Sie wieder auf die <a href="infml.htm">Seite</a> mit der Eingabezeile und geben Sie dort
Ihre eMail-Adresse an, danach dr&uuml;cken Sie auf den nebenstehenden
Knopf, der die Daten an Listbot, den Mailinglisten-Server, absendet. 
Daf&uuml;r m&uuml;ssen Sie nat&uuml;rlich online bzw. im Internet sein.</p>

<p>Alternativ k&ouml;nnen Sie sich auch direkt auf der Support-Seite bei Listbot 
anmelden und zwar unter: <a href="http://AmZInfo.listbot.com/">http://AmZInfo.listbot.com/</a></p>

<p>Danach gelangen Sie auf eine Seite, auf der Sie Ihr Listbot-Mitglieds-Pa&szlig;wort, 
sowie Ihren vollen Namen eingeben m&uuml;ssen. (Ihr Browser mu&szlig; Cookies
unterst&uuml;tzen.)</p>

<p>Wenn Sie keinen Internet-Zugriff haben oder es online nicht funktioniert hat,
senden Sie bitte eine eMail an  <a href="mailto:AmZInfo-subscribe@listbot.com">AmZInfo-subscribe@listbot.com</a>.

<a name="abl"><u><h3 align=center>Der anschlie&szlig;ende Ablauf:</h3></u></a>

<p>Nun erhalten Sie (oft schon nach Sekunden) eine <b>Einladungs-eMail</b>, deren
Funktion es ist, festzustellen, ob Sie auch wirklich selbst den Antrag 
gestellt haben und Willens sind, aufgenommen zu werden.</p>
 
<p>Ein einfaches <b>Reply</b> mit einer leeren Nachricht gen&uuml;gt als Best&auml;tigung
und Sie werden aufgenommen.</p>

<u><h3 align=center>Nach der Aufnahme:</h3></u>

<p>...erhalten Sie eine <b>Best&auml;tigungsmeldung</b> mit der Information &uuml;ber Ihren 
<a name="acc"><b>Account</b></a>, d.h. Ihr Benutzerkonto bei Listbot, dem Anbieter dieses Services.</p>

<p>Sie haben die M&ouml;glichkeit, Ihren Account gegebenenfalls zu ver&auml;ndern, 
z.B. k&ouml;nnen mehrere Listbot-Listen, bei denen Sie m&ouml;glicherweise Mitglied 
sind, verwaltet werden oder Sie k&ouml;nnen sich als Mitglied  austragen.</p>
  
<p>Dies ist nur online im Internet unter folgender Adresse m&ouml;glich (der Browser mu&szlig;
Cookies unterst&uuml;tzen): <a href="http://www.listbot.com/cgi-bin/subscriber">
http://www.listbot.com/cgi-bin/subscriber</a></p>

<p>Um aus der Liste <a name="aus"><b>ausgetragen</b></a> zu werden, gen&uuml;gt auch eine eMail an:
<a href="mailto:AmZInfo-unsubscribe@listbot.com">AmZInfo-unsubscribe@listbot.com</a></p>

<p>Bei Problemen im direkten Zusammenhang mit der InfoNetz-Liste, wenden Sie sich bitte an die 
Adresse: <a href="mailto:AmZeiger@gmx.de">AmZeiger@gmx.de</a></p>

<a name="uml"><p><b>WICHTIG!</b>: Sollten Sie eine <b>Umleitungsadresse</b></a> verwenden, so stellen 
Sie  sicher, da&szlig; Sie unter Ihrem Account bei Listbot Ihre derzeitige 'wirkliche' 
Adresse als Alias eingeben, da Sie m&ouml;glicherweise sonst als nicht 
autorisiert abgelehnt werden oder geben Sie gleich bei der Anmeldung 
die Adresse an, von der aus Sie direkt senden.</p>

<p>Beachten Sie bitte <b>Adre&szlig;&auml;nderungen</b> auch unter Ihrem Listbot-Account 
umzustellen!</p>

<a name="ben"><u><h3 align=center>Zur Benutzung der Mailingliste:</h3></u></a>

<p>Es sind nur Nachrichten <b>bis zu 10 KByte</b> zul&auml;ssig, was aber ausreichen
sollte.</p>

<p>Nachrichten bitte an: <a href="mailto:AmZInfo@listbot.com">AmZInfo@listbot.com</a>
senden.</p>

<p>Alle Teilnehmer erhalten die Meldung und k&ouml;nnen per Reply an die eben
genannte Adresse antworten.</p>

<p>Das <b>Nachrichten-Archiv</b> ist entweder unter ihrem Mitglieds-Account oder
auf unserer <a href="infml.htm">Anmeldungsseite</a> einzusehen.</p>

<p>
--<br><b>
Bitte heben Sie sich diesen Text, zusammen mit der Listbot-Best&auml;tigung 
auf!</b><br>
--</p>

<p>Viel Vergn&uuml;gen beim Lesen des AmZeigers und dieser Liste w&uuml;nscht
die <b>AmZeiger-Redaktion</b>.</p>  

<p align=center><a href="#kurz">KURZ&Uuml;BERBLICK</a></p>

<center>
<HR WIDTH=90%>
<FONT SIZE=2>&copy; 1999 Der AmZeiger (<A HREF="mailto:AmZeiger@gmx.de">Gregor Franz</A>).
</FONT></CENTER>
</BODY>
</HTML>
