<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Etusivu</title>
		<meta name="generator" content="Handmade in Finland">
		<meta name="keywords" content="http://batman.jypoly.fi/~saku/">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><a name="top"></a></font>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../etusivu.html" target="_self">Etusivulle</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<img src="kuvat/thoriel.jpg" alt="Anu" height="193" width="187" border="1"></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Rakkaat yhdistyksen j&auml;senet ja uskolliset Sakun lukijat.<br>
							<br>
							&quot;Siunatkoon, mit&auml; tunteellista puppaa... Nyt se p&auml;&auml;toimittajaparka on hukannut viimeisetkin kuulansa ja otteensa todellisuudesta.&quot; No, l&auml;hestulkoon. T&auml;m&auml;n Sakun my&ouml;t&auml; k&auml;ynnistyy nimitt&auml;in jo lehden yhdestoista vuosikerta.<br>
							<br>
							Yksin&auml;isess&auml; p&auml;&auml;toimittajan roolissani olen usein miettinyt, mik&auml; ihme minut saa tekem&auml;&auml;n t&auml;t&auml; hommaa. Tai no, yksin&auml;isess&auml; ja yksin&auml;isess&auml; - onhan minulla kaikki artikkelien kirjoittajat, yhdistyksen j&auml;senet ja muut yhteis&ouml;n&auml;ni... Mutta silti - olen nyky&auml;&auml;n lehtemme p&auml;&auml;toimittaja, uutistoimittaja ja oikolukija. Sen lis&auml;ksi olen yhdistyksemme puheenjohtaja, rahastovastaava ja t&auml;m&auml;n vuoden alusta my&ouml;s webmaster. Lis&auml;ksi moderoin tarvittaessa Saku-keskustelufoorumiamme yhdess&auml; parin muun henkil&ouml;n kanssa. Kuulostaako teist&auml;kin silt&auml;, ett&auml; yhden ihmisen harteille olisi ehk&auml; kertynyt liikaa teht&auml;vi&auml;? Mitenk&auml;h&auml;n k&auml;visi, jos meteoriitti (&copy; Fleecy) napsahtaisi otsaani jonain kauniina p&auml;iv&auml;n&auml; - l&ouml;ytyisik&ouml; teht&auml;viini jatkajia?<br>
							<br>
							Totta, olemme varsin &quot;helppohoitoinen&quot; yhdistys siin&auml; mieless&auml;, ett&auml; olemme varsin pieni, yleishy&ouml;dyllinen (emme ole verovelvollisia) ja pitk&auml;ik&auml;inen yhdistys. Meill&auml; on kuitenkin jo vuosikymmenen kattava perinne Suomen Amiga-k&auml;ytt&auml;jien etuj&auml;rjest&ouml;n&auml;, ja se rooli on viime vuosina laajentunut entisest&auml;&auml;n, kun j&auml;lleenmyyjien ja muiden edustajien m&auml;&auml;r&auml; on supistunut minimiin. Osittain saan syytt&auml;&auml; vain itse&auml;ni ja luonnettani siit&auml;, ett&auml; teht&auml;vi&auml; on kertynyt n&auml;in paljon; olen sen luonteinen ihminen, ett&auml; jos kukaan muu ei tee, otan ja teen itse, mik&auml;li tekem&auml;tt&auml; j&auml;tt&auml;misell&auml; olisi huonoja seuraamuksia. Siin&auml; emme eroa muista pienist&auml; yhdistyksist&auml; mitenk&auml;&auml;n, ett&auml; uusia yhdistysaktiiveja on kovin vaikea saada, ja vanhojen motivoiminen toimintaan on joskus hankalaa.<br>
							<br>
							T&auml;ll&auml; hetkell&auml; homma rullaa aika lailla omalla painollaan, ja tapahtumien yhteydess&auml; olemme kerta toisensa j&auml;lkeen n&auml;hneet, ett&auml; loppupeleiss&auml; l&ouml;ytyy aina niit&auml;, jotka tulevat ja tekev&auml;t pyyteett&ouml;m&auml;sti ja syd&auml;mell&auml;. Viimeiset esimerkit t&auml;st&auml; ovat Alternative Party 2003, jossa viime metreill&auml; esittelykoneen ja sen j&auml;rjestelyt hoitanut tehotiimimme esitteli Pegasosta partykansalle, sek&auml; t&auml;m&auml; Saku. Kun viimeisen tilannekatsauksen artikkeliosio pari viikkoa ennen julkaisua loisti tyhjyytt&auml;&auml;n, pelk&auml;sin jo pahinta - edess&auml; olisi nolo startti lehden 11. vuosikerralle. Viel&auml; mit&auml;. Deadlinen l&auml;hestyess&auml; juttuja alkoi kuin alkoikin ropista. Ei mit&auml;&auml;n kaatosadetta, mutta mukavasti pisaroita ainakin pieneksi puroksi asti. Joukossa on uusiakin kirjoittajia. T&auml;st&auml; on hyv&auml; jatkaa. (En voi kuitenkaan t&auml;ss&auml; yhteydess&auml; olla j&auml;lleen haikailematta sen pitk&auml;&auml;n mets&auml;st&auml;m&auml;ni uutistoimittajan per&auml;&auml;n - halukkaat voivat edelleen ilmoittautua allekirjoittaneelle... :)<br>
							<br>
							Jos kaikki menee hyvin, seuraavaan Sakuun voimme odottaa useita juttuja Pegasoksesta. <a href="http://www.phinixi.com" target="_blank">Phoenix Developer Consortium</a> j&auml;rjesti yhdess&auml; Genesin kanssa tarjouksen, jossa halukkaille kehitt&auml;jille sek&auml; joillekin k&auml;ytt&auml;j&auml;ryhmille tarjottiin mahdollisuutta ostaa G3-Pegasos 299 dollarin nimellishintaan (&quot;normaalihinta&quot; on 200 taalaa kovempi - vaikka joudummekin ehk&auml; Saksan ALV:n tuohon p&auml;&auml;lle, on se silti varsin edukas tarjous). Yhdistyksemme oli yksi edunsaajista, joten v&auml;litin halukkaiden tiedot eteenp&auml;in Phinixille, ja n&auml;ill&auml; n&auml;kymin toistakymment&auml; Pegasosta matkaa aikanaan Suomeen. Pitk&auml;st&auml; aikaa syd&auml;nalan valtasi mukava odotuksen kutina ja j&auml;nnitys, jota ei t&auml;ss&auml; touhussa ole liian usein viime aikoina saanut tuntea, kun kaikki ja joka puolella tuntuu viiv&auml;styv&auml;n ja venyv&auml;n.<br>
							<br>
							Yhdistyksen puheenjohtajana en kenties ole siit&auml; n&auml;kyvimm&auml;st&auml; tai &auml;&auml;nekk&auml;imm&auml;st&auml; p&auml;&auml;st&auml; julkisuudessa. Seuraan paljon asioita er&auml;&auml;nlaisena sivustakatsojana, tarkkailen taustalla. Ehk&auml; se on huono tapa hoitaa pesti&auml;, ehk&auml; ei, mutta se on yksi keino varmistaa, ett&auml; maineemme maailmalla puolueettomana ja avoimena yhdistyksen&auml; s&auml;ilyy. Ulkomaiset keskustelufoorumit viime aikoina vallannutta loanheittoa katsellessa olen ollut aina vain enemm&auml;n sit&auml; mielt&auml;, ett&auml; olen tehnyt yhdistyksen kannalta oikean ratkaisun. Esimerkiksi Amiga Inc.:n touhua seuraavat ovat varmasti n&auml;hneet, kuinka vaikeaa on voittaa yhteis&ouml;n luottamus sen j&auml;lkeen kun sen on kerran omien toimiensa seurauksena menett&auml;nyt. Sellaisen kuran poistossa ei auta edes Omo-info. Yksil&ouml;tasolla kaikilla on varmasti asiasta mielipide, emmek&auml; yhdistyksen&auml;k&auml;&auml;n rupea mink&auml;&auml;n tahon s&auml;tkynukeksi tai k&auml;skyl&auml;iseksi, mutta yhdistyksen ja sen j&auml;senten etujen kannalta pid&auml;n parempana sit&auml;, ett&auml; kaikesta tapahtuneesta huolimatta pid&auml;mme ovet avoinna ja sillat ehjin&auml; kaikkiin suuntiin.<br>
							<br>
							Sivusta tarkkailu ei suinkaan ole pelkk&auml;&auml; tuskaisaa touhua. Saku-foorumissamme keskustelu hyrr&auml;&auml; laidasta laitaan, ja viimeist&auml;&auml;n nyt foorumi on todistanut arvonsa Amigasta ja siihen liittyvist&auml; asioista kiinnostuneiden kohtauspaikkana. H&ouml;yryp&auml;inen kiihkoilu, josta takavuosina amigisteja mielell&auml;&auml;n syytettiin, loistaa l&auml;hes t&auml;ysin poissaoloaan. J&auml;ljell&auml; oleva &quot;vanha kaarti&quot; on varsin avointa ja asiallista, pilke silm&auml;kulmassa touhuun suhtautuvaa, ja Amigasta aikanaan luopuneet paluumuuttajatkin ovat ilokseni l&ouml;yt&auml;neet foorumille. Totta, hiljattain perustetulla Vapaa sana -alueella voi p&auml;&auml;st&auml;&auml; kaikenlaista h&ouml;yry&auml;, mutta sekin on lopulta aika hyv&auml;ntahtoista heittely&auml;. Klisee tai ei, mutta kyll&auml; se pieni yhteis&ouml;sammakko meiss&auml; kaikissa tuntuu tavalla tai toisella asuvan. Turha v&auml;itt&auml;&auml; vastaan, kurnutuksen kuulee t&auml;nne asti.<br>
							<br>
							Kaiken kaikkiaan kuluneet 10 vuotta Sakun parissa ovat olleet antoisia, vaikka v&auml;lill&auml; on pit&auml;nyt v&auml;h&auml;n suossakin r&auml;mpi&auml;. Kanaemoa minusta ei saa edes h&ouml;yheniss&auml; kieritt&auml;m&auml;ll&auml; ja hametta olen tainnut pit&auml;&auml; viimeksi ala-asteen kolmannen luokan kev&auml;tjuhlassa, mutta jonkinlainen &auml;idillinen tunne minut silti valtaa katsellessani tapahtumien kulkua. Se sama tunne, joka v&auml;ist&auml;m&auml;tt&auml; jokaisessa tapahtumassamme pienimpi&auml;kin kokouksia my&ouml;ten tulee - ett&auml; kaikista vastoink&auml;ymisist&auml;kin huolimatta t&auml;t&auml; hommaa kannattaa tehd&auml;. Siisp&auml; jatkan tarkkailuani ja ehk&auml;p&auml; tanssahdan pari askelta 10-vuotisjuhlavuoden kunniaksi t&auml;&auml;ll&auml; taustalla... Jonkinlainen h&ouml;pp&auml;n&auml;h&auml;n t&auml;h&auml;n touhuun pit&auml;&auml; olla, mutta hei, h&ouml;pp&auml;nyys yhdist&auml;&auml;!<br>
							<br>
							<i>&quot;Standing on the bridge that crosses<br>
								The river that goes out to the sea<br>
								The wind is full of a thousand voices<br>
								They pass by the bridge and me.<br>
								<br>
								I can see the lights in the distance<br>
								Trembling in the dark cloak of night<br>
								Candles and lanterns are dancing, dancing<br>
								A waltz on All Souls Night.&quot;</i><br>
							<br>
							-- Loreena McKennitt: All Souls Night<br>
							<br>
							Anu Seilonen<br>
							P&auml;&auml;toimittaja</font></td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../etusivu.html" target="_self">Etusivulle</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../sivukartta.html" target="_self">Sivukartta</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</font></td>
				</tr>
			</table>
		</center>
	</body>

</html>