<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Etusivu</title>
		<meta name="generator" content="Handmade in Finland">
		<meta name="keywords" content="http://batman.jypoly.fi/~saku/">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><a name="top"></a></font>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../etusivu.html" target="_self">Etusivulle</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:janne.siren@helsinki.fi">janne.siren@helsinki.fi</a>&gt;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<img src="kuvat/janne.jpg" alt="Janne" height="150" width="346" border="1"></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">T&auml;m&auml; tarina liittyy Amigaan, tavallaan...<br>
							<br>
							Vuonna 1969 Ken Thompson, Dennis Ritchie ja joukko muita aloittivat ohjelmistoprojektin AT&amp;T:n Bell-laboratoriossa. T&auml;st&auml; ohjelmistoprojektista tuli aikanaan UNIX-k&auml;ytt&ouml;j&auml;rjestelm&auml;. Kehitys jatkui yksist&auml;&auml;n AT&amp;T:n hoteissa kuutisen vuotta, kunnes vuonna 1975 j&auml;rjestelm&auml; vapautui Kalifornian yliopiston tutkittavaksi.<br>
							<br>
							AT&amp;T jatkoi kuitenkin UNIXin kehitt&auml;mist&auml; aina 80-luvun loppuun saakka. Samanaikaisesti Kalifornian yliopistolla AT&amp;T:n luovuttamaa l&auml;hdekoodia oli sorkittu ankarasti. Yliopiston Berkeley Standard Distributionista (BSD) tuli toinen UNIX-variantti. Vuonna 1984 Richard Stallman aloitti ty&ouml;t vapaan UNIX-kloonin parissa. T&auml;m&auml; projekti kulki nimell&auml; GNU.<br>
							<br>
							90-luvulle tultaessa UNIX-tavaramerkki ja l&auml;hdekoodioikeudet olivat levinneet useammalle suunnalle, ensin Novellille ja siit&auml; eteenp&auml;in. Kaikki UNIXit perustuivat kuitenkin edelleen suojattuun l&auml;hdekoodilisenssiin. Pian Kalifornian yliopistolla oli kuitenkin saatu heid&auml;n BSD-varianttinsa UNIXista l&auml;hes t&auml;ysin uudelleenkirjoitettua.<br>
							<br>
							William ja Lynne Jolitz sek&auml; kumppanit tempaisivat loppuryk&auml;yksen ja vapauttivat BSD:n UNIX-l&auml;hdekoodista ja siten lisenssivaateista 386BSD:ll&auml; vuonna 1992. T&auml;st&auml; seurasivat aikanaan avoimen l&auml;hdekoodin k&auml;ytt&ouml;j&auml;rjestelm&auml;t NetBSD, FreeBSD ja OpenBSD. Samanaikaisesti toisaalla, Richard Stallmanin GNU-projekti oli edennyt pitk&auml;lle...<br>
							<br>
							Helsingin yliopistolla Linus Torvalds -niminen heppu oli tutustunut UNIXin tyyliseen Minix-k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml;n ja p&auml;&auml;tti pist&auml;&auml; paremmaksi. Syntyi avoimeen l&auml;hdekoodiin perustuva k&auml;ytt&ouml;j&auml;rjestelm&auml;n ydin, kernel, nimelt&auml; Linux, jonka ensiversio julkaistiin vuonna 1994. Kun Linus sitten l&ouml;i hynttyyt yhteen Richard Stallmanin GNU-projektin kanssa, oli uusi ilmainen UNIX-klooni syntynyt. GNU/Linux tunnetaan my&ouml;s levityspakettiensa nimell&auml;, kuten Red Hat ja Debian Linux.<br>
							<br>
							N&auml;in 2000-luvulla alun perin kaupallinen ja suljettu UNIX el&auml;&auml; monessa eri variantissa: NetBSD, OpenBSD, Red Hat Linux, Debian, jne. My&ouml;s alkuper&auml;ist&auml; UNIXia lisensoidaan edelleen. Siihen perustuu esimerkiksi Sun Microsystemsin Solaris-k&auml;ytt&ouml;j&auml;rjestelm&auml;. Eri UNIX-kloonit ovat l&auml;hdekooditasolla melko yhteensopivia, ja niiss&auml; py&ouml;riv&auml;t p&auml;&auml;asiassa samat ohjelmat.<br>
							<br>
							Samaan aikaan toisaalla...<br>
							<br>
							Vuosi 1985 n&auml;ki yhden kotimikrohistorian suosituimman tietokoneen julkistuksen: Amiga n&auml;ki p&auml;iv&auml;nvalon ja sen mukana AmigaOS-moniajok&auml;ytt&ouml;j&auml;rjestelm&auml;. Sek&auml; itse laite ett&auml; sen k&auml;ytt&ouml;j&auml;rjestelm&auml; pysyiv&auml;t visusti valmistajan, Commodoren, valvonnassa aina yrityksen konkurssiin saakka - vuoteen 1994.<br>
							<br>
							Vuonna 1993 Amigan tilanne alkoi n&auml;ytt&auml;&auml; niin kurjalta, ett&auml; joukko harrastelijoita p&auml;&auml;tti tarttua h&auml;rk&auml;&auml; sarvista ja luoda korvaavan k&auml;ytt&ouml;j&auml;rjestelm&auml;n AmigaOS:lle. Projekti kulki alkuun nimell&auml; AOS, kunnes vuonna 1995 Aaron Digulla formalisoi ryhm&auml;n tavoitteeksi tehd&auml; AmigaOS 3.1:n kanssa l&auml;hdekoodiyhteensopiva k&auml;ytt&ouml;j&auml;rjestelm&auml;. T&auml;t&auml; systeemi&auml; alettiin kutsua nimell&auml; AROS, Amiga Research Operating System.<br>
							<br>
							Vapaaehtoisvoimin puuhattu AROS antoi kuitenkin odottaa itse&auml;&auml;n, ja AmigaOS:n l&auml;hdekoodit ja oikeudet niihin seikkailivat 90-luvun loppupuoliskolla konkurssipes&auml;lt&auml; ja ostajakandidaatilta toiselle. Vuonna 1995 silloinen omistaja ESCOM oli kuitenkin Amiga Technologies -tyt&auml;ryhti&ouml;ns&auml; v&auml;lityksell&auml; sys&auml;nnyt kiven liikkeelle toisaalla. Amiga Technologies suunnitteli tuovansa Amiga-lis&auml;laitevalmistaja Phase 5:n kanssa PowerPC-ratkaisun Amiga-koneille.<br>
							<br>
							Amiga Technologies ja ESCOM meniv&auml;t kuitenkin nurin omia aikojaan, ja PowerPC-ratkaisun toimittaminen Amiga-markkinoille j&auml;i yksin Phase 5:n harteille. Phase 5:n yhteisty&ouml;kumppani Ralph Schmidt vastasi ohjelmistotuesta n&auml;ille PowerUp-nimell&auml; kulkeneille korteille, ja kaavailipa Phase 5 kokonaisia PowerPC-tietokoneitakin. Niin kuitenkin k&auml;vi, ett&auml; Phase 5 kaatui markkinoiden kuihtuessa ja t&auml;m&auml;kin kehitys lamaantui.<br>
							<br>
							Amiga-markkinoilla elettiin 90-luvun loppuvuodet hiljaisissa ja odottavissa tunnelmissa. Emoyhti&ouml;t vaihtuivat ja lupaukset muuttuivat, mutta mit&auml;&auml;n konkreettista ei tapahtunut. Ralph Schmidt oli kuitenkin jatkanut Phase 5:n kanssa aloittamaansa ty&ouml;t&auml;, ja kun Amigan viralliset omistajat, kuka milloinkin, eiv&auml;t osoittaneet mielenkiintoa p&auml;ivitt&auml;&auml; AmigaOS:&auml;&auml; PowerPC-aikaan, ryhtyi h&auml;n siihen itse. MorphOS sai alkunsa.<br>
							<br>
							MorphOS:n tarkoitus oli olla sek&auml; l&auml;hdekoodi- ett&auml; bin&auml;&auml;ritasolla yhteensopiva AmigaOS:n kanssa. Se olisi PowerPC-natiivi ja vanhoja 68k-ohjelmia ajettaisiin prosessoriemulaation avulla. Ensimm&auml;iset vuonna 2001 julkaistut MorphOS:n beta-versiot vaativat AmigaOS-asennuksen MorphOS:n p&auml;&auml;lle, sill&auml; ne eiv&auml;t sis&auml;lt&auml;neet kaikkea toiminnallisuutta itsess&auml;&auml;n.<br>
							<br>
							T&auml;h&auml;n menness&auml; Amigan nykyinen emoyhti&ouml; Amiga Inc. oli kuitenkin taas vaiheeksi kiinnostunut AmigaOS:st&auml;, ja kun neuvottelut sen p&auml;ivitt&auml;misest&auml; MorphOS:n pohjalta kariutuivat, joutuivat Ralph Schmidt ja kumppanit t&auml;ydent&auml;m&auml;&auml;n k&auml;ytt&ouml;j&auml;rjestelm&auml;ns&auml; loppuun itse. Apua he saivat kuitenkin yll&auml;tt&auml;v&auml;lt&auml; taholta...<br>
							<br>
							Aivan kuten Linux ja GNU konsanaan, AROS-projekti oli kuin olikin kaikessa hiljaisuudessa p&auml;&auml;ssyt AmigaOS:n uudelleenkirjoittamisessa niin pitk&auml;lle, ett&auml; he pystyiv&auml;t toimittamaan osia MorphOS-k&auml;ytt&ouml;j&auml;rjestelm&auml;n AmigaOS-yhteensopivuuskirjastoista. Vastaavasti MorphOS:n tekij&auml;t toimittivat parannuksia AROSiin. Vuoteen 2002 menness&auml; sek&auml; AROS ett&auml; MorphOS olivat l&auml;hes t&auml;ysin l&auml;hdekoodiyhteensopivia AmigaOS 3.1:n kanssa.<br>
							<br>
							Samanaikaisesti virallisen AmigaOS:n kehityst&auml; jatkoi Hyperion Entertainment, joka lupailee julkistaa uuden PowerPC-pohjaisen AmigaOS:n vuoden 2003 aikana.<br>
							<br>
							Taas UNIX-maailmassa...<br>
							<br>
							Kuluneen yli kolmenkymmenen vuoden aikana UNIX on saanut monet kasvot. Siit&auml; on kaupallista ja vapaata varianttia, on pient&auml;, suurta, kaunista ja rumaa. Eri versiot ovat toistensa kanssa yleens&auml; l&auml;hdekooditasolla jotenkuten yhteensopivia ja niiss&auml; py&ouml;riv&auml;t yleens&auml; samat ohjelmat. My&ouml;s monet standardit ja tekniikat ovat samanlaisia.<br>
							<br>
							Periaatteessa, ja puristit jaksavat t&auml;st&auml; muistuttaa, vain UNIX-l&auml;hdekoodilisenssiin ja tavaramerkkiin perustuvat k&auml;ytt&ouml;j&auml;rjestelm&auml;t, jotka on UNIXiksi sertifioitu, saavat tuota nime&auml; kantaa. Tavallisten mikroharrastajien suussa kaikki n&auml;m&auml; variantit ovat kuitenkin UNIXeja, Linuxia my&ouml;ten. Syykin on kokolailla ilmeinen, kuten Seth T. Ross UNIX-m&auml;&auml;ritelm&auml;ss&auml;&auml;n muotoilee:<br>
							<br>
							&quot;Jos se n&auml;ytt&auml;&auml; UNIXilta, toimii kuin UNIX, suorittaa yleisi&auml; UNIX-ohjelmia ja on kehitetty UNIX-mallina, se on UNIX.&quot;<br>
							<br>
							Niin maallikolle kuin satunnaiselle ohjelmoijalle, esimerkiksi UNIX ja Linux eiv&auml;t juuri toisistaan poikkea, ennen kuin eroavaisuuksia aletaan syyn&auml;&auml;m&auml;&auml;n tarkemmin.<br>
							<br>
							Kun taas Amiga-maailmassa...<br>
							<br>
							Vuosituhannen vaihde on tuonut Amiga-yhteis&ouml;lle pulmallisen mutta toisaalta lupaavan tilanteen. Ensi kertaa lempik&auml;ytt&ouml;j&auml;rjestelm&auml;st&auml;mme on markkinoilla kaksikin toimivaa kloonia: AROS ja MorphOS. Toinen niist&auml; perustuu avoimeen l&auml;hdekoodiin Linuxin tapaan, toinen taas on kaupallinen tuote. Mutta mik&auml; on AmigaOS? Onko AROS AmigaOS? Ent&auml; onko MorphOS? Jopa viimeksi mainittujen relevanttiudesta Amiga-yhteis&ouml;lle on kinasteltu viimevuodet.<br>
							<br>
							Ilmeisestikin on olemassa vain yksi ja oikea AmigaOS, sill&auml; tavaramerkit ja l&auml;hdekoodit on laeilla suojattu. Mutta toisaalta on olemassa toinen k&auml;yt&auml;nn&ouml;n totuus, jonka kanssa UNIX-maailmassa on saatu v&auml;&auml;nt&auml;&auml; peist&auml; jo paljon meit&auml; kauemmin. Ehk&auml; se pilkunviilaaminen ei sittenk&auml;&auml;n ole niin mielek&auml;st&auml;. Mikrokansan syv&auml;t rivit ovat vet&auml;neet johtop&auml;&auml;t&ouml;ksens&auml;. Kenties voisinkin lainata Seth T. Rossia ja h&auml;nen m&auml;&auml;ritelm&auml;&auml;ns&auml; UNIXista hieman soveltaen:<br>
							<br>
							&quot;Jos se n&auml;ytt&auml;&auml; AmigaOS:lta, toimii kuin AmigaOS, suorittaa yleisi&auml; AmigaOS-ohjelmia, ja on kehitetty AmigaOS-mallina, se on AmigaOS.&quot;<br>
							<br>
							UNIXilla on takanaan monipuolinen ja rikas historia. Voimme oppia sielt&auml; paljon.<br>
							<br>
							Janne Sir&eacute;n</font></td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../etusivu.html" target="_self">Etusivulle</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../sivukartta.html" target="_self">Sivukartta</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</font></td>
				</tr>
			</table>
		</center>
	</body>

</html>