<html>
<head>
<title> Isidor von Sevilla </title>
</head>
<body background="wolf1.jpg" text=black link=blue bgcolor=gray>

<table border=0 cellpadding=8><tr><td>
<h2 align=center>Isidor von Sevilla</h2>


<center><p><b><font size=+2>Biographisch-Bibliographisches Kirchenlexikon.
Bd. 2. Herzberg 1990. Sp. 1374-1379:</font></b></p>
(kleiner Auszug)</center>

<p> <b>ISIDOR</b>, Erzbischof von Sevilla, Heiliger, * um 560 in Cartagena,
+ 4 .4 . 636 in Sevilla. - I. entstammte einer vornehmen Familie, die in
der Mitte des 6. Jahrhunderts aus Cartagena (S&uuml;dostspanien) nach
Sevilla &uuml;bersiedelte; wahrscheinlich erfolgte die Ausweisung auf Veran
lassung byzantinischer Beh&ouml;rden. I.s &auml;lterer Bruder Leander war
Bischof im westgotischen Sevilla, sein zweiter Bruder Fulgentius Bischof
von Astigi, seine Schwester Florentina wurde Nonne. Als Nachfolger seines
Bruders Leander wurde I.um 599/601 Metropolit von Sevilla. Bis zu seinem
Tod f&ouml;rderte I. die asketische und wissenschaftliche Ausbildung der
Geistlichen und die Gr&uuml;ndung entsprechender bisch&ouml;flichen Schulen
(in Sevilla, Toledo, Saragossa u. a.), die er mit reichen Bibliotheken
ausstattete. Des weiteren beeinflu&szlig;te er die spanische Geschichte
ma&szlig;geblich; sein Vorsitz beim 4. Reichskonzil zu Toledo (633) gibt
davon ein eindrucksvolles Zeugnis. Vor allem aber erreichte I. mit seinem
umfangreichen schriftstellerischen Schaffen eine
au&szlig;ergew&ouml;hnliche Bedeutung. In seinen Werken - &uuml;berliefert
in &uuml;ber tausend Handschriften und zahlreichen Drucken - behandelt I.
naturwissenschaftliche, grammatische, historische und theologische Themen.
Die bedeutendste Schrift in der Reihe der naturwissenschaftlichen Werke ist
die f&uuml;r K&ouml;nig Sisebut geschriebene &quot;Etymologiae&quot; (auch
&quot;Origines&quot; genannt; um 630 abgeschlossen), die I.s Sch&uuml;ler
und Freund Braulio in zwanzig B&uuml;cher einteilte und herausgab. Diese
&quot;Etymologiae&quot; fassen als eine Realenzyklop&auml;die das gesamte
weltliche und geistliche Wissen der Zeit zusammen; sie bieten die
systematische Aufarbeitung der septem artes liberales und einen Abri&szlig;
der bis dahin bekannten Weltgeschichte. Das &quot;Grundbuch des ganzen
Mittelalters&quot; (E. R. Curtius), aus vielerlei Vorlagen kompiliert,
erl&auml;utert Naturph&auml;nomene wie Sonnen- und Mondfinsternis, Tag und
Nacht, Erdbeben usw. und bietet Erkl&auml;rungen f&uuml;r nahezu alle
Bereiche der menschlichen Existenz, wie etwa Sprache und Grammatik, Rechte
und Pflichten. Aber auch auf Entlegeneres [Sp. 1375] weitet I. das
Blickfeld aus: so verurteilt er z. B. strengstens das Theaterwesen. Wie in
den &quot;Etymologiae&quot; nimmt I. auch in der Sisebut dedizierten
Schrift &quot;De natura rerum&quot; eine knappe Darstellung der
Naturereignisse vor. In gewisser Hinsicht wird diese Arbeit erg&auml;nzt
durch &quot;De ordine creaturarum&quot;, ein Werk, das ebenfalls
ausf&uuml;hrlich auf die Welt des Geistigen und der materiellen Sprache
eingeht. Dabei wird allerdings das Naturwissenschaftliche zugunsten des
Lebens nach dem Tod (Fegefeuer, Paradies, J&uuml;ngstes Gericht) eher
marginal behandelt. Anhand der Methode der Begriffsherleitung ist I. den
Sinngehalt wichtiger, zentraler Begriffe klarzulegen bem&uuml;ht. In der
Etymologie sieht I. eine der Lehrweisen, um &uuml;ber die Sprache den Weg
zur Erkenntnis zu finden. Diesen Ansatz w&auml;hlte I. auch f&uuml;r das
grammatische Werk &quot;Differentiae&quot;, dessen Buch I und II in
alphabetischer Folge eine Gruppe von Wortarten zum entsprechenden Begriff
stellt. Anders als der Titel &quot;Synonyma&quot; vermuten l&auml;&szlig;t,
werden hier nicht Lexeme subsummiert; vielmehr beklagt eine s&uuml;ndige
Seele das menschliche Elend, und zwar in jeder Redeeinheit mit synonymen
Ausdr&uuml;cken. Dieses zweib&auml;ndige, weitgehend philologisch
orientierte Werk verbindet - unter h&auml;ufigen zeitkritischen
Einsch&uuml;ben - das P&auml;dagogisch-Philologische mit dem
Ethisch-Religi&ouml;sen. In den geschichtlich ausgerichteten Schriften
stellt I. historische Pers&ouml;nlichkeiten vor. So wird in &quot;De viris
illustribus&quot; biographisches und hagiographisches Material &uuml;ber
vornehmlich afrikanische und spanische Schriftsteller des 6.- 7.
Jahrhunderts geboten. F&uuml;r diese fr&uuml;he christliche
Literaturgeschichte benutzte I. als Quelle das gleichnamige Werk von
Hieronymus und Gennodius von Marseille; manches aber erhielt er auch von
Papst Gregor den Gro&szlig;en, den I. als &quot;papa Romanae sedis
apostolicae praesul&quot; (De viris, cap. 40) w&uuml;rdigt. &Uuml;ber die
Herrscher dreier V&ouml;lker seit dem 4. Jahrhundert berichtet I. in der
&quot;Historia de regibus Gothorum, Vandalorum et Sueborum&quot;, wobei
sich alleine 70 der in 92 Kapitel eingeteilten Schrift auf die Goten
beziehen. In der Weltchronik, der &quot;Chronika maiora&quot;, weist I. in
Anlehnung an die Augustinische Lehre von den sechs Weltzeitaltern warnend
auf das &quot;residuum saeculi tempus&quot; hin. In erster Linie aber
schreibt I. als Theologe. Mit seinen dogmatischen und exegetischen Werken
beein- flu&szlig;te I. ma&szlig;geblich die Glaubensund Sittenlehre bis in
sp&auml;te Mittelalter. Sein theologisches Hauptwerk, die als Handbuch
konzipierte, moraltheologisch ausgerichtete Schrift &quot;Sententiarum
libri tres&quot;, befa&szlig;t sich mit der Kirchenlehre, [Sp. 1376:] dem
christlichen, ethischen Handeln und der kirchlichen Organisation. Besonders
stellt sie die karitative Aufgabe des Klerikers in den Vordergrund (Gebot
der N&auml;chstenliebe). Als Vorlage fungierten hier die &quot;Moralia in
Job&quot; Gregors des Gro&szlig;en. Der kirchlichen Lehre und Praxis widmen
sich die Schriften &quot;De haeresibus&quot; und &quot;Indiculus de
haeresibus&quot;. Juden und Heiden, die vom christlichen Glauben
Abgewichenen, werden streng verurteilt, doch die Anwendung physischer
Gewalt zur Zwangsbekehrung lehnt I. entschieden ab. Weiterhin geh&ouml;ren
zu den Schriften, die die praktische Theologie beinhalten, die zwei
B&auml;nde &quot;De ecclesiasticis offlciis&quot; (neben Klerikern wird
auch Jungfrauen, Witwen und Verehelichten besondere Aufmerksamkeit
geschenkt) und die M&ouml;nchsregel &quot;Regula monachorum&quot;. I. nimmt
darin eine augenf&auml;llige Einschr&auml;nkung vor. M&ouml;nche haben
ungeachtet ihrer klerikalen Aufgabe auch Handarbeit zu verrichten, hingegen
sei die grobe Arbeit von Klostersklaven zu leisten. Ihnen wiederum wird
aus- dr&uuml;cklich die wirtschaftliche Versorgung im Monasterium
zugesichert. Eine Exegese biblischer Texte unternimmt I. in den
&quot;Questiones in vetus testamentum&quot;; ein Lehrer stellt Fragen zu
biblischen Gegenst&auml;nden. Dabei orientiert sich I. vornehmlich an
Autorit&auml;ten wie Origines und besonders an Gregor den Gro&szlig;en.
Biographisches Material zu 86 Personen der Bibel stellt I. in der Arbeit
&quot;De ortu et obitu patrum&quot; zusammen, wobei I. f&uuml;r die
Hauptgestalten des Alten Testaments die M&ouml;glichkeIten ihrer typologi-
schen Deutung aufzuzeigen beabsichtigt. Die Schrift &quot;De flde catholica
ex veteri et novo testamento contra Judaeos&quot;, der Schwester Florentina
gewidmet, weist in den Texten des Alten Testaments typologische
Entsprechungen Christi nach. Diese Arbeit I.s ist - um nun kurz die
Wirkungsgeschichte zu umrei&szlig;en - bereits im 8. Jahrhundert ins
Althochdeutsche &uuml;bertragen worden. Bei der &Uuml;bersetzung, die in
zwei Handschriften vorliegt (Bibl. Nat, Paris; Nationalbibl. Wien) handelt
es sich um Ab- bzw . Um- schriften von bilinguen Vorlagen; die Schriften
dieser sogenannten &quot;Isidor-Gruppe&quot;&quot; sind die „&auml;ltesten
Zeugnisse einer theologischen &Uuml;bersetzungsliteratur in deutscher
Sprache aus dem 8./9. Jahrhundert. Der (unbekannte) &Uuml;bersetzer ist im
Kreis um Alkuin zu vermuten; der Dialekt l&auml;&szlig;t sich nicht exakt
bestimmen, man bezeichnet ihn daher als &quot;Isidorsprache&quot;. I. hat
auf die folgenden Jahrhunderte eine immense Wirkung ausge&uuml;bt. Seine
Leistungen als &quot;letzter abendl&auml;ndischer Kirchenvater&quot; sowie
seine Ausstrahlung auf die Welt des Mittelalters sind ohne [1377:] Zweifel
von nicht zu untersch&auml;tzender Bedeutung. In Anerkennung seiner
Verdienste um die Festigung der Macht der spanischen K&ouml;nige und um die
Einigkeit der fr&uuml;hchristlichen Kirche pries bereits das 8.Toletanum
(653) I.als &quot;nostri saeculi doctor egregius, catholicae ecclesiae
novissimum decus&quot; (s. v. Schubert, 183). I.s Schriften fanden schon
fr&uuml;h Verbreitung. In Irland wird um 650 die Benutzung seiner Werke
bezeugt. Von hier aus ging ein gro&szlig;er Teil des isidorischen oeuvres
ins &uuml;brige Europa. In der Zeit des 15./16. Jahrhunderts klang dann das
Interesse an I.s Schriften ab. - Ferdinand von Kastilien und L&eacute;on
(1035-1065) lie&szlig; I.s Reliquien von Sevilla nach L&eacute;on
(Nordspanien) &uuml;berf&uuml;hren; sp&auml;ter wurde hier die Stiftskirche
San Isidore errichtet. Zusammenfassend kann I.s Wirken und Bedeutung wie
folgt umrissen werden: er verkn&uuml;pfte das fr&uuml;he Mittelalter mit
der Bibelwissenschaft und der Theologie der Patristik; er hat zum
Verst&auml;ndnis der antiken &Uuml;berlieferung erheblich beigetragen und
schlie&szlig;lich hat er erfolgreich das System der septem artes liberales
tradiert. - I. wurde 1598 heilig gesprochen und 1722 zum Kirchenlehrer
ernannt. Er wird dargestellt als Bischof in wei&szlig;em Gewand mit Buch
und Federkiel.</p>

</td></tr></table>
<p align=center><big><a href="st_wolfinfo.html#a1"> ZUR&Uuml;CK </a></big></p><br>

</body>
</html>
