<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, kamelot, karma">
<title>Kamelot: Karma</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Kamelot: Karma</font></h1><BR> (55:55 / Noise Records)</center></P>

<p>Wenn es um Bands geht, die bisher absolut unterbewertet ihr dasein fristen, dann m&#252;sste man alsbald auch auf die Amerikaner Kamelot sto&#223;en. Obwohl die Band seit Beginn ihrer Karriere ausschlie&#223;lich excellente Scheiben vorgelegt hat - der bisherige H&#246;hepunkt d&#252;rfte ohne Frage das letztj&#228;hrige Werk &quot;The Fourth Judgement&quot; gewesen sein - war die Beachtung der Band bisher bei weitem nicht so gro&#223; wie bei &#228;hnlich gearteten Act`s der Marke HammerFall oder Gamma Ray. Trotzdem ver&#246;ffentlichen Kamelot nach wie vor regelm&#228;&#223;ig neue Platten und auch das neue Langeisen &quot;Karma&quot; d&#252;rfte sich in die Liste erstklassiger Kamelot Alben m&#252;helos einreihen. Erneut pr&#228;sentieren Kamelot eine ausgewogene Mischung von flotten Ohrw&#252;rmern (&quot;Forever&quot;, &quot;Wings Of Despair&quot;, &quot;Across The Highlands&quot;), getrageneren St&#252;cken (&quot;The Spell&quot;, &quot;The Light I Shine On You&quot;) und leicht progressiv angehauchten Nummern (&quot;Karma&quot;). Dazu gibt`s mit &quot;Don`t You Cry&quot; zwar nur eine durchschnittliche Ballade, aber daf&#252;r entsch&#228;digt uns die Band mit dem abschlie&#223;enden, in drei Teile gesplitteten geschichtlichen Epos &quot;Elizabeth&quot;, der von der Band wirklich gut umgesetzt wurde und zu begeistern wei&#223;. Etwas erstaunlich ist lediglich die Tatsache, da&#223; die Band immer mehr die europ&#228;ische Schine - sprich: insbesondere Fans des melodischen Speed Metal`s aus Germany sollten sich von Kamelot angesprochen f&#252;hlen - f&#228;hrt, wenngleich die Band eigentlich aus den USA kommt. Einen nicht unwesentlichen Anteil daran d&#252;rfte auch das Wolfsburger Produzenten Erfolgs Duo Sascha Paeth / Miro (beide Heavens Gate) gehabt haben, die der astreinen und druckvollen Produktion mal wieder ihren unverkennlichen Stempel aufgedr&#252;ckt haben. Was soll man also noch gro&#223;e Worte verlieren? Wer Kamelot bisher mochte, wird auch von &quot;Karma&quot; unter Garantie nicht entt&#228;uscht sein - wer der Band bisher keine Beachtung geschenkt hat und auf melodischen Power / Speed Metal steht, der sollte jetzt schle
unigst in den n&#228;chsten Plattenladen rennen, und sich das neue Album zulegen. Ansonsten droht im n&#228;chsten Leben ein schlechtes &quot;Karma&quot;....</P>

<p>Fazit: 9 von 10 Punkten</P>  
<center>
<p><img src="kit.gif"></P>
<p><img src="cd2.jpg"></P>
<p><img src="kit.gif"></P>
</Center>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
