<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,wasp,unholy terror">
<title>W.A.S.P.: Unholy Terror</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">W.A.S.P.: Unholy Terror</font></h1><BR> (47:15 / Metal-is)</center></P>

<p>W.A.S.P. sind eine Band, die man als Metal Head einfach kennen muss: Sei es nun aus den ungest&#252;men Anfangstagen mit dem Image der Schockrocker oder den Anfang der `90er folgenden tiefgr&#252;ndigeren Alben &quot;Headless Children&quot; und &quot;The Crimson Idol&quot;. Nun liegt endlich das neue Album &quot;Unholy Terror&quot; vor, welches die R&#252;ckbesinnung auf alte Tugenden, die schon auf dem letzten Werk &quot;Helldorado&quot; andeutungsweise zu h&#246;ren war, weiterf&#252;hrt und den aus meiner Sicht eher misslungenen Ausflug in Industrial Gefilde mit &quot;Kill, Fuck, Die&quot; gl&#252;cklicherweise wieder vergessen macht. Musikalisch orientieren sich W.A.S.P. endlich wieder an ihren Fr&#252;hwerken und streuen noch eine Prise &quot;Headless Children&quot; hinzu, was eine ziemlich geile Mischung ergibt. Schon der Uptempo Opener &quot;Let It Roar&quot; und die typischen W.A.S.P. Nackenbrecher &quot;Whoy Slayed Baby Jane&quot; (bei dem sich Bruce Dickinson / Halford Weggef&#228;hrte Roy Z. an
der Klampfe die Ehre gibt) und &quot;Loco-Motive Man&quot; lassen erst gar keinen Zweifel an der Klasse dieses Silberlings aufkommen. Auch das klar an Black Sabbath angelehnte &quot;Euphoria&quot; wei&#223; zu gefallen und pr&#228;sentiert die Band in absoluter Topform. Aber auch die lyrische Seite von &quot;Unholy Terror&quot; wei&#223; zu gefallen: Wie man realtiv schnell schon am Albumtitel - und sp&#228;testens am Coverartwork - erkennt, besch&#228;ftigt sich &quot;Unholy Terror&quot; kritisch mit verschiedenen Religionen, ohne dabei aber in plumpe Blasphemie zu verfallen. Wer sich ein Meisterwerk wie &quot;The Crimson Idol&quot; anh&#246;rt, wird schon wissen, was langwierig ausgedachte Lyrics bewegen k&#246;nnen. Von diesem Standpunkt aus betrachtet, ist noch der Smasher &quot;Charisma&quot; hervorhebenswert, der sich mit der nagtiven Seite von Charisma besch&#228;ftigt und dabei auch einige Pers&#246;nlichkeiten auff&#252;hrt, die als Negativbeispiele in die Geschichte eingegangen sind. Bleibt unter dem Strich ein superbens W.A.S.P. Album &#252;brig, das endlich wieder komplett musikalisch &#252;berzeugen kann und zudem auch lyrisch 
zu gefallen wei&#223;. Also: Was will man mehr von Blackie und seinen Kumpanen? Klare Kaufempfehlung!</P>

<p>Fazit: 10 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd6.jpg"></P>
<p><img src="kit.gif"></P>
</Center>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
