<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="red">Newsflash</font></center></h1></P><ul>
<p><li> Nachdem die sympathischen True Metaller von <b>HammerFall</B> gerade mit &quot;Always Will Be&quot; ihre zweite Single - auf der auch die Judas Priest Coverversion &quot;Breaking The Law&quot; zu finden ist - aus dem aktuellen &quot;Renegade&quot; Album ausgekoppelt haben, steht f&#252;r die n&#228;chsten Monate das Release des ersten offiziellen Live Albums an.  Macht aus verkaufstechnischer Hinsciht auf jeden Fall Sinn....</LI></P>

<p><li> Die von <b>Gamma Ray</B> angek&#252;ndigte Single zum neuen Album mit drei Studitracks und einer zus&#228;tzlichen Thin Lizzy Coverversion wurde ersatzlos gestrichen. Das neue Album erscheint aber wie geplant Anfang September und sollte mitlerweile so gut wie fertig sein.</LI></P> 

<p><li> Nachdem <b>Edguy</B> in den letzten Wochen aufgrund von <b>Avantasia</B> - der Metal Oper von Edguy Mastermind Tobias Sammett - auf Spaarflamme liefen, setzen die Fulderaner Jungs nun zum n&#228;chsten Schlag an: Zum ersten mal in der Bandgeschichte wird es eine Vorab Single zu einem Album geben - die Single erscheint gegen Ende August und der vollst&#228;ndige Longplayer, der vorraussichlich mit &quot;Mandrake&quot; betitelt wird, begl&#252;ckt uns dann gegen Ende September.</LI></P>

<p><li> Nochmal <b>Avantasia</B>: Der zweite Teil der Rockoper ist mitlerweile fertig gestellt und wird gegen Ende des Jahres soundtechnisch veredelt. Nat&#252;rlich werden erneut prominente Gastmusiker dabei sein - u.a. geben sich Eric Singer (Kiss) und Bob Catley (ex-Magnum) darauf die Ehre. Wenn die Scheibe auch nur halbwegs an die Qualit&#228;t des Debut`s herankommt, steht uns sicherlich f&#252;r 2002 (vorher wird die Scheibe nicht erscheinen) ein absolutes Highlight in`s Haus. </LI></P>

<p><li> Die hessische Metal Formation <b>Squealer</B> arbeitet momentan an dem Nachfolger zum superben 2000er Album &quot;Made For Eternity&quot;. Das ganze soll allerdings deutlich rifforientierter und erdiger ausfallen, wenngleich die bombastischen Ch&#246;re nat&#252;rlich nicht vollst&#228;ndig aus dem Sound verschwinden werden - Spannung ist also schon jetzt angesagt!</LI></P>

<p><li> Das R&#228;tselraaten bei <b>Savatage</B> hat ein Ende: Neben dem neuen Gitarristen <b>Jack Frost</B> (Metalium; siehe News in der letzten Ausgabe) ist nun auch endlich ein neuer Lead S&#228;nger gefunden, der auf den Namen <b>Damond Jiniya</B> h&#246;rt. Der bisher so ziemlich unbekannte S&#228;nger, der vorher bei der Band Diet Of Worms besch&#228;ftigt war, mit denen er auch zwei Alben in Eigenregie herausbrachte, scheint dabei genauso durchgeknallt sein, wie der Rest aus dem Savatage Camp und soll &#252;ber ein beachtliches Stimmenvolumen verf&#252;gen. Lassen wir uns auf den Sommerfestivals mal vom neuen Line-up &#252;berraschen!</LI></P>

<p><li> Reunions, Reunions - und kein Ende: Nun soll auch eine der kultigsten US Truppen aus den `80ern, n&#228;mlich <b>Warlord</B>, auferstehen - eingef&#228;delt haben das die ehemaligen Members Mark Zonder (Fates Warning; Drums) und William Tsamis (Lordian Guard; Gitarrist). Als S&#228;nger wird wohl niemand geringeres als <b>HammerFall</B> S&#228;nger <b>Joacim Cans</B> zum Einsatz kommen, der ja selber beinharter Warlord Fan ist - HammerFall waren es auch, die auf ihrem Debutalbum &quot;Glory To The Brave&quot; mit &quot;Child Of The Damned&quot; eine astreine Coverversion des Warlord Klassikers hinlegten. An der Reunion beteiligt sein wird ebenfalls Keyboarderin Diane Kornarens, die damals unter dem kultigen Pseudonym &quot;The Sentinel&quot; ebenfalls schon im Warlord Boot sa&#223;.</LI></P>

<p><li> Gerade noch im Vorprogramm von Helloween, jetzt schon wieder im Studio: Ex-Iron Maiden Frontmann Blaze Bayley arbeitet mit seiner Combo <b>Blaze</B> schon wieder flei&#223;ig an Material f&#252;r den zweiten Soloschlag. Zurechtger&#252;ckt wird der Silberteller erneut von Andy Sneap, der auch schon den Vorg&#228;nger &quot;Silicon Messiah&quot; in ein gutes Soundgewand gekleidet hat.</LI></P>

<p><li> Im Hause <b>Rhapsdoy</B> hat der Tag wohl nicht nur 24 Stunden, sondern gleich 48: Neben den beiden Soloalben von Gitarrist Luca Turilli und Keyboarder Alex Staropoli, sind die Jungs anscheinend auch wieder im Studio, um den vierten Teil der &quot;Emerald Saga&quot; in trockene T&#252;cher zu packen. Erscheinen wird das Teil zwar erst im Laufe des n&#228;chsten Jahres (vorher gibt`s die Soloprojekte), aber den Arbeitseifer, den die Band an den Tag legt, ist schon bewundernswert.</LI></P>

<p><li> Geht es noch? Im Hause <b>Black Sabbath</B> will man, nach dem bereits zum hundernsten mal verk&#252;ndeten Split und dem obligatorischen anschlie&#223;enden Wiederruf vom selbigen (der allerdings erst immer nach der endg&#252;ltig letzten &quot;Abschiedstour&quot; kam), jetzt wohl doch nochmal N&#228;gel mit K&#246;pfen machen: Nachdem man eigentlich plante, sich zun&#228;chst &quot;nur&quot; f&#252;r`s Ozzfest Festival zu reformieren, befindet man sich nun sogar im Studio und arbeitet an neuen St&#252;cken. Ach ja: Parallel dazu arbeitet S&#228;nger <b<Ozzy Osbourne</B> an seiner neuen Studioscheibe, die im Sommer kurz nach dem Black Sabbath Album spruchrreif sein soll.</LI></P>

<p><li> Die Gothic Metaller von <b>Crematory</B> haben sich nach rund 10 Jahren aufgel&#246;st. Im Sommer sollen noch einige Abschiedsgigs geplant und ebenso soll es f&#252;r alle treuen Fans noch eine Doppel Live CD nebst Video im VHS / DVD Format geben. </LI></P>

<p><li><b>Dream Theater</B> zum 129.: In Sachen DVD ist die Band wohl f&#252;r die n&#228;chsten Jahre bedient! Erst musste die englische Version wegen eines Synchronisationsfehlers eingestampft werden, nun erwischt es auch noch die deutsche Fassung. Auch hier muss die erste Auflage eingestampft werden, um nachzukorrigieren. Und leider wird die neue Fassung wohl erst im September spruchreif sein. Tja, Sachen gibt es....</LI></P>

<p><li> Auch andere Bands mussten feststellen, da&#223; Termine nicht immer eingehalten werden k&#246;nnen: Das neue <b>Jag Panzer</B> Album, welches mitlerweile mit &quot;Mechanized Warfare&quot; betitelt wurde und eigentlich Ende Mai / Anfang Juni erscheinen sollte, wurde auf Ende August verlegt. Auch die Labelkollegen Iced Earth haben das neue Album nach hinten verschoben. Der neue Termin f&#252;r &quot;Horror Show&quot; ist der 18.Juni. </LI></P>

<p><li> Die Veranstalter des <b<Dynamo Open Air`s</B> sind wahrlich nicht zu beneiden: Nachdem es in den letzten beiden Jahren nicht wirklich rund gelaufen ist, sollte in diesem Jahr eigentlich alles anders werden. Und bisher sah es auhc wirklich gut aus, w&#228;re da nicht die aktuelle MKS Krise, die die Verantstalter zwingt, da&#223; Festival zu verlegen. Ob das so kurzfristig noch m&#246;glich ist wird sich wohl erst noch herausstellen m&#252;ssen. </LI></P>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
