<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Etusivu</title>
		<meta name="generator" content="Handmade in Finland">
		<meta name="keywords" content="http://saku.amigafin.org">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><i><img src="kuvat/thoriel.jpg" width="187" height="193" alt="Anu" border="1"><br>
									P&auml;&auml; on t&auml;ss&auml; ja jalat maassa.<br>
									L&ouml;yd&auml;tk&ouml; loput toimittajasta t&auml;st&auml; lehdest&auml;?</i></font></center>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vuoden odotetuin Amiga-tapahtuma maailmalla, St. Louisin Amiga 2001 -messut ovat sitten ohitse. Mit&auml; j&auml;i k&auml;teen? Kuten Janne Sir&eacute;n hienossa ja kattavassa <a href="../ajankohtaiset/amiga2001.html" target="_self">messuraportissaan</a> toteaa, messuilla oli paljon ja kaikenlaista tarjontaa, mutta pakka tuntui j&auml;&auml;v&auml;n viel&auml;kin hieman sekaisin. J&auml;lleen on kuitenkin saatu lis&auml;&auml; toivoa tulevasta, PPC-natiivi AmigaOS tulee kaikista ennakkopelotteluista huolimatta ja niit&auml; uusia koneitakin jonain p&auml;iv&auml;n&auml; ehk&auml; voimme ihailla. Liikaan leijumiseen ei viel&auml;k&auml;&auml;n ole aihetta, vaan odotamme tiiviisti, mit&auml; tuleman pit&auml;&auml;.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Laitteistorintamalla on jo tapahtunutkin. Kauan odotettu Mediator -PCI-laajennus n&auml;ki viimein p&auml;iv&auml;nvalon, ja ensimm&auml;iset raportit A1200-versiosta vaikuttavat lupaavilta. Lue lis&auml;&auml; Mediatorista  <a href="../testit/hakemisto.html" target="_self">Testit-osastolta</a> kahden artikkelin voimin, mukana menossa my&ouml;s Voodoo-grafiikkakortit. My&ouml;s uusia pelej&auml; ja tulevien pelien demoversioita on ilmestynyt. T&auml;m&auml;n Sakun <a href="../pelit/hakemisto.html" target="_self">Pelit-osasto</a> on t&auml;ydempi kuin aikoihin, sill&auml; artikkelien lukum&auml;&auml;r&auml;ll&auml; laskettuna siit&auml; tuli pullein osasto heti Vakioiden j&auml;lkeen! Syyniss&auml; Payback, Simon the Sorcerer 2, Earth 2140, esivilkaisussa Shogo ja naposteltavana my&ouml;s muutamia muita pelej&auml;.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yhdistyksen osalta py&ouml;r&auml;t py&ouml;riv&auml;t hitaasti mutta varmasti eteenp&auml;in. Vuosikokouksessa p&auml;&auml;tetyt s&auml;&auml;nt&ouml;muutokset on toimitettu Patentti- ja rekisterihallitukseen, ja uusitut s&auml;&auml;nn&ouml;t l&ouml;ytyv&auml;t paitsi yhdistyksen kotisivuilta, my&ouml;s t&auml;st&auml; lehdest&auml;. P&ouml;yt&auml;kirjat pankkitilin siirtoa varten ovat valmiina, joten l&auml;hiviikkoina p&auml;&auml;semme hoitamaan senkin asian pois p&auml;iv&auml;j&auml;rjestyksest&auml;. Sitten kaikki alkaisi olla valmista Saku 2001:n t&auml;ysipainoista suunnittelua varten.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Odotimme St. Louisin messuja kovasti, jotta p&auml;&auml;sisimme n&auml;kem&auml;&auml;n, mit&auml; uutta Amigalla on tarjolla, sill&auml; t&auml;m&auml;n Sakun julkaisun j&auml;lkeen alamme t&auml;ydell&auml; painolla ajaa ja suunnitella omaa Saku 2001 -tapahtumaamme. Haluamme tarjota j&auml;senillemme ja kaikille Suomen amigisteille tapahtuman, jonne kannattaa tulla kauempaakin ja jossa voi tutustua uusimpiin Amiga-maailman tuotteisiin. Hiljattain perustetussa <a href="http://saku.amigafin.org/keskustelu/index.html" target="_top">Saku-keskustelufoorumissa</a> on avattu oma osasto Saku 2001 -keskustelulle, johon kaikki voivat ottaa osaa. Tulkaa kanssamme ideoimaan tapahtumaa! Syksyll&auml; boingahtaa!</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Viimeisimp&auml;n&auml; mutta varmasti kauimmin odotettuna uudistuksena olemme vihdoin saaneet uuden, helposti muistettavan kotisivuosoitteen. Kiitos t&auml;st&auml; kuuluu pitk&auml;n linjan amigistille ja vapaus.com/amiga-uutispalvelun kehitt&auml;j&auml;lle <i>Jari Ristirannalle</i>, joka rekister&ouml;i amigafin.org-domainin. Yhdistyksen sivut l&ouml;ytyv&auml;t nyt helpon ja ytimekk&auml;&auml;n redirectin <a href="http://saku.amigafin.org" target="_top">http://saku.amigafin.org</a> takaa. Ottakaa k&auml;ytt&ouml;&ouml;n ja kertokaa kaverille! Vanhatkin osoitteet toki toimivat edelleen. K&auml;yk&auml;&auml; tutustumassa my&ouml;s <a href="http://www.amigafin.org" target="_blank">amigafin.org-portaalin</a> palveluihin.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Anu&nbsp;Seilonen, &lt;<a href="mailto:thoriel@amigafin.org">thoriel@amigafin.org</a>&gt;<br>
								Suomen Amiga-k&auml;ytt&auml;j&auml;t ry., <a href="http://saku.amigafin.org" target="_top">http://saku.amigafin.org</a></font>
					</td>
				</tr>
			</table>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p></center>
	</body>

</html>