<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>DARKSEED</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=""
    bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="tut0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "tut.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="10" summary=
            "" bgcolor="#fffff4">
              <TR>
                <TD>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                  <HR>

                  <H2 align="center"><B>DARKSEED</B></H2>

                  <P>Man sollte grunds&auml;tzlich alles anschauen
                  und alle T&uuml;ren in der Hellen Welt
                  &ouml;ffnen, da sonst die T&uuml;ren auch in der
                  Dunklen Welt verschlossen sind.</P>

                  <H3>1.Tag</H3>

                  <P>Zun&auml;chst nehmt Ihr ein Asperin aus den
                  Badezimmerschr&auml;nkchen und stellt Euch unter
                  die Dusche. Danach wird der im Nebenraum
                  h&auml;ngende Mantel zweimal mit dem
                  Ausrufezeichen untersucht und dann der
                  B&uuml;chereizettel genommen. Im Erdgescho&szlig;
                  geht man sofort ins Arbeitszimmer, nimmt dort die
                  Blaupause auf und studiert diese. Nach getaner
                  Arbeit &ouml;ffnet man den Geheimgang auf der
                  rechten Seite und betritt selbigen. Die T&uuml;r
                  m&uuml;&szlig;tr Ihr hinter Euch wieder
                  &ouml;ffnen, da sie von selber wieder
                  zuf&auml;llt. Man klettert die Leiter hoch,
                  steckt das Seil ein und verl&auml;&szlig;t den
                  Geheimraum ins Schlafzimmer. Danach mu&szlig; man
                  nochmal zur&uuml;ck, um die zugefallene T&uuml;r
                  wieder zu &ouml;ffnen. Wenn das Telefon klingelt
                  geht Ihr dran. Dort erfahrt Ihr von Susan,
                  da&szlig; sie in der B&uuml;cherei ein Buch
                  f&uuml;r Euch hat. Doch zun&auml;chst wartet man,
                  bis es 10.00 Uhr ist, dann kommt n&auml;mlich der
                  Postbote und bringt ein P&auml;ckchen. Danach
                  gehts ab in die Garage, wo Ihr in dem Kofferraum
                  eine Brechstange und im Handschufach eben ein
                  Paar alte Handschuhe findet. Dann geht ihr in die
                  Stadt zum H&auml;ndler. Dort gebt Ihr Ihm Geld
                  und nehmt die Flasche Scotch, woraufhin Euer
                  Nachbar Delbert erscheint, Euch seine
                  Visitenkarte gibt (mit der man aus dem
                  Gef&auml;ngnis freikommt) und sich mit Euch am
                  n&auml;chsten Tag um 18.00 verabredet. Weiter
                  gehts in die Bibliothek, wo man Susan die
                  B&uuml;cherkarte aus dem Inventar gibt, woraufhin
                  man erf&auml;hrt, da&szlig; das gesuchte buch in
                  Reihe C im unteren Regal zu finden ist. In dem
                  Buch ist ein Zettel zu finden, den man sich
                  sorgsam durchlesen sollte. Danach nehmt Ihr noch
                  die Haarnadel auf, die sich irgendo vor Susans
                  Schreibtisch befinden sollte. Jetzt geht man zur
                  Gruft des alten Tuttle, &ouml;ffnet diese mit der
                  Links-Oben-Rechts Kombination (einfach die Steine
                  anklicken) und geht hinein. Man geht weiter in
                  den n&auml;chsten Raum und &ouml;ffnet die Urne
                  unten links, in der sich ein kleiner
                  Schl&uuml;ssel befindet. Zur&uuml;ck ins Haus,
                  die Standuhr im Wohnzimmer mittels Schl&uuml;ssel
                  aufschlie&szlig;en und die Plakette durchlesen.
                  Dann geht man auf den Dachboden (Leiter im
                  Treppenhaus), schiebt die rechte Kiste zweimal
                  zur Seite und nimmt die Uhr (irgendwo im
                  Pixelgewirr). Nachdem man selbige aufgezogen hat,
                  &ouml;ffnet man die Truhe mittels Brechstange und
                  liest das darin enthaltene Tagebuch. Man geht auf
                  die Terasse und bindet das Seil um die
                  d&auml;monenvertreibende Figur. danach k&ouml;nnt
                  Ihr Euch getrost schlafen legen.</P>

                  <H3>2.Tag</H3>

                  <P>Zun&auml;chst nimmt man wieder ein Asperin,
                  duscht sich und stellt seine Taschenuhr nach der
                  gro&szlig;en Standuhr im Wohnzimmer. Jetzt wartet
                  Ihr, bis es 10.00 uhr ist, dann bringt
                  n&auml;mlich der Postbote die fehlende
                  Spiegelscherbe. Man setzt sie in den Spiegel ein
                  und kann nunmehr in die Dunkle Welt eintreten.
                  Dort angekommen nehmen wir die rechte T&uuml;r
                  und gehen dann nach links. Dort schauen wir uns
                  die Pl&auml;ne der Au&szlig;erirdischen an.
                  Weiter gehts nach rechts. Benutzt den Teleporter
                  und geht dann weiter nach links, woraufhin Ihr
                  euch dann auf einer Art Terasse befindet. Mit dem
                  Fernrohr l&auml;&szlig;t sich die Landschaft
                  beobachten. Ihr zieht die Handschuhe an und
                  benutzt den Hebel an der rechten Wand zwischen
                  den beiden T&uuml;ren, woraufhin sich die
                  T&uuml;r im Raum mit dem Sch&auml;del
                  &ouml;ffnet. Zu diueser geht man auch jetzt
                  zur&uuml;ck und gelangt durch sie in die
                  Au&szlig;enwelt. Nachdem Ihr zweimal links
                  abgebogen seid, gelangt Ihr zu den H&ouml;hlen,
                  wo Ihr einen Schaufel findet. Sofort zur&uuml;ck
                  und in die helle Welt. Falls es in der
                  Mittagszeit ist, k&ouml;nnt Ihr euch einige Tips
                  von Susan aus dem Autoradio holen. Danach schnell
                  zum Friedhof und das Grab von McKeegan ausgraben,
                  in dem Ihr einen weiteren Zettel findet, den Ihr
                  Euch sorgsam zu Gem&uuml;te f&uuml;hren solltet.
                  Man geht zur&uuml;ck zum Haus und l&auml;&szlig;t
                  sich von dem Polizisten verhaftet. In der Zelle
                  versteckt man die Haarnadel, die Handschuhe und
                  das Geld unter dem Kopfkissen. Dann schl&auml;gt
                  man mit dem Metallbecher gegen die
                  Eisenst&auml;be und gibt dem kommenden Bullen
                  Delberts Visiten-Karte. Beim Rausgehen nehmt Ihr
                  noch den Revolver von der Wand. Ihr benutzt das
                  Seil um ins Haus zugelangen (Achtung: Von jetzt
                  an immer das Seil benutzen) und wartet bis es 18
                  Uhr ist. Dann seilt man sich ab und folgt Delbert
                  in den Garten, wo er uns ein Kunstst&uuml;ckchen
                  mit seinem Hund zeigt. Ihr gebt ihm die Flasche
                  Scotch, woraufhin er und der Hund verscwinden.
                  Ihr nehmt den Stock, steigt am Seildes Hauses
                  hoch und gelangt mittels Spiegel in die dunkle
                  Welt. Dort gehen wir sofort in die
                  Au&szlig;enwelt . Jetzt zweimal geradeaus zur
                  zentralen Energieversorgung. Dort entdeckt Ihr
                  auf der linken Seite ein kleines Loch, in das Ihr
                  den Stein steckt. Dann bastelt man sich aus
                  Schaft und Stein eine Axt und geht wieder in die
                  helle Welt. Ihr seilt Euch wieder ab und geht in
                  die Garage. Dort f&uuml;llt Ihr den Scotch in den
                  Tank und startet den Wagen. Ab jetzt alles so
                  schnell wie m&ouml;glich machen. In die dunkle
                  Welt, dort nach links wo Ihr hinter einen kleinen
                  Zugang seht. Diesen benutzt Ihr und zieht im
                  n&auml;chstem Raum mittels den Handschuhen den
                  Hebel links hinten vom Schiff. Die Zeitbombe
                  tickt, Ihr rast in die helle Welt und
                  zerst&ouml;rt mit der Axt den Spiegel, bevor Euer
                  dunkles Ebenbild in EUre Welt gelangten kann. Und
                  das wars dann auch schon.</P>
                  <HR>
                  <BR>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

