<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>LURE OF THE TEMPTRESS</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=""
    bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="tut0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "tut.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="10" summary=
            "" bgcolor="#fffff4">
              <TR>
                <TD>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                  <HR>

                  <H2 align="center">LURE OF THE TEMPTRESS</H2>

                  <P>Zun&auml;chst zieht man solange an der Fackel,
                  bis sie in das benachbarte Bett f&auml;llt und
                  dieses in Brand setzt. Wenige Sekunden
                  sp&auml;ter betritt ein schlechtgelaunter
                  Skrolw&auml;chter die Bildfl&auml;che, an dem man
                  nat&uuml;rlich geradewegs vorbeistolziert. Vor
                  der Zelle versperrt und verriegelt man nun die
                  T&uuml;r, damit der Skorl gar erst nicht auf
                  Dumme Gedanken kommt. Im n&auml;chsten Raum
                  l&auml;&szlig;t man das Messer (auf dem
                  Fa&szlig;) und die Flasche (vor dem Sack)
                  mitgehen. Jetzt nach rechts zum Gefangenen und
                  die Lederfesseln mit Hilfe des gefundenen
                  Schneideger&auml;ts zertrennen.
                  Anschlie&szlig;end wieder das Fa&szlig;
                  betrachten. Ratpouch gibt man nun die Flasche,
                  die er umgehend mit dem Hahn benutzt. Den edlen
                  Honigwein (Met) &uuml;berl&auml;&szlig;t man nun
                  dem H&auml;ftling, der vor der Zelle an der Wand
                  h&auml;ngt. Das Getr&auml;nk macht ihn sogleich
                  gespr&auml;chig und er verr&auml;t mit
                  gel&ouml;ster Zunge, da&szlig; sich die
                  gegen&uuml;berliegende Wand mit Ratpouchs Hilfe
                  bestimmt eindr&uuml;cken l&auml;&szlig;t. Nach
                  dieser Aktion findet man sich in der stinkenden
                  Kanalisation und kurze Zeit sp&auml;ter sogar in
                  Turnvale wieder. Die erste Unterhaltung sollte
                  man mit Luther, dem Schmied f&uuml;hren. Danach
                  macht man sich auf die Suche nach Mallin, der
                  nach einigen &Uuml;berzeugungsversuchen
                  schlie&szlig;lich bereit ist, seinen kostbaren,
                  goldenen Metallbarren zu entbehren. Diesen bringt
                  man zum Kr&auml;mer Ewan, der sein kleines
                  Gesch&auml;ft am Marktplatz er&ouml;ffnet hat.
                  F&uuml;r den Goldbarren erh&auml;lt man nun eine
                  Silberkette, die f&uuml;r Nelli in der
                  Elsterschenke von unsch&auml;tzbaren Wert ist.
                  Als Zeichen ihrer Dankbarkeit bekommt man von ihr
                  eine mysteri&ouml;se Flasche. Diese bringt man
                  nat&uuml;rlich sofort zum Schmid, der den
                  k&ouml;stlichen Inhalt gierig verschlingt.
                  Anschlie&szlig;end macht man sich zu den
                  hinterh&auml;ltigen Morkus (Elsterschenke) auf,
                  aus dem sich nur durch Korruption wertvolle
                  Informationen herauspressen lassen. Luther ist
                  nun auch viel kooperativer, denn er verr&auml;t
                  nun ein wichtiges Codewort, das man Grub (der
                  unscheinbare Penner) mitteilt. Den nun erhaltenes
                  Dietrich gibt man Ratpouch und danach
                  l&auml;&szlig;t man ihn die T&uuml;r am
                  Marktplatz &ouml;ffnen (erst betrachten!). Der
                  n&auml;chste Schritt f&uuml;hrt zu der
                  zwielichtigen Kneipe ZUM HENKER und man
                  f&uuml;hrt ein ungezwungenes Gespr&auml;ch mit
                  der Wirtin auf Taidght an. Daraufhin kramt sie
                  sein Tagesbuch heraus, das man sofort unter die
                  Lupe nehmen sollte. In der Schmiede verbleibt man
                  nun das Pulverfa&szlig; seinem Inventar ein und
                  kehrt zur&uuml;ck zu Taidghts Haus. Hier erweist
                  sich Ratpouch wieder einmal als hilfreicher
                  T&uuml;rknacker und man kann seelenruhig die
                  Apparatur in Augenschein nehmen. Beim genaueren
                  Hinsehen entdeckt man einen &Ouml;lbrenner, den
                  man mit dem Pulverfa&szlig; entz&uuml;ndet.
                  Danach stellt man die Flasche unter den Hahn und
                  sobald man die Fl&uuml;ssigkeit abgef&uuml;llt
                  hat, kratzt man besser die Kurve. Nun schnell zur
                  Mittelstra&szlig;e und den Zaubertrank
                  herunterkippen. Man nimmt nun das Aussehen von
                  Selena an und kann ungecshoren die Wachen
                  passieren. Danach erteilt man den W&auml;chter
                  den Befehl, Goewin freizulassen. Jetzt wieder die
                  Beine in die Hand nehmen und bl&ouml;dsinnig in
                  der Gegend herumlaufen. Nachdem man sich
                  zur&uuml;ckverwandelt hat, sollte man mit Goewin
                  in der Apotheke Kontakt aufnehmen. Ist dieses
                  informative GEspr&auml;ch beendet, so kann man
                  sich anderen Aufgaben widmen und sich auf die
                  Suche nach Mallin machen. Er zeigt sich von der
                  spendablen Seite. Man erh&auml;lt von ihm einen
                  uralten Schinken mit dem M&ouml;nche mehr
                  anfangen k&ouml;nnen, als der diebische Morkus.
                  Toby packt nun die au&szlig;ergew&ouml;hnlichsten
                  Geschichten aus, die sich vorwiegend um einen
                  drachen und ein Zaubermittel drehen. Das Rezept
                  f&uuml;r dieses Getr&auml;nk sollte man sich
                  unbedingt merken. Also ab zur Apotheke und Geowin
                  um die Zubereitung des Tranks bitten. Da aber das
                  h&ouml;chstgiftige Kuhkraut fehlt, kann man
                  ersteinmal den Schmied einen Besuch abstatten.
                  Von der alten Quasselstrippe verlangt man nun das
                  unn&uuml;tze Gew&auml;chs, das man sich
                  schlie&szlig;lich und endlich aus dem Vorgarten
                  stehlen mu&szlig;. Das Kuhkraut vertraut man nun
                  Goewin an und geht danach zu Ultra in die
                  Gastst&auml;tte zum Henker. Ein kleines
                  Gespr&auml;ch w&auml;re jetzt angebracht. In der
                  Zwischenzeit hat Goewin den Zaubertrank
                  zusammengemixt und man kann ihn dankend
                  entgegennehmen. Ultra verr&auml;t nun bei einer
                  zweiten Unterhaltung die Namen der beiden
                  Wasserspeier. Wenn man mit einem dieser nassen
                  Gesellen spricht, erf&auml;hrt man, da&szlig; das
                  Wehrtor nur mit Hilfe einer Frau zu &ouml;ffnen
                  ist. Kein Problem, denn Goewin steht ohnehin noch
                  tief in der Schuld des unfreiwilligen Heldens..
                  Man verabredet sich mit ihr bei den Wasserspeiern
                  und soricht mit der ahnungslosen Dame. Das Tor
                  &ouml;ffnet sich. In der Eingangshalle zieht man
                  an beiden Sch&auml;deln und die n&auml;chste
                  T&uuml;r ist ge&ouml;ffnet. In der gr&uuml;nen
                  H&ouml;hle angekommen, gibt man Goewin den
                  Befehl, in die Eingangshalle zu gehen und an den
                  linken Sch&auml;del zu ziehen. In der blauen
                  H&ouml;hle soll sie sich zuerst am rechten
                  Sch&auml;del und dann am linken Sch&auml;del zu
                  schaffen machen. Jetzt soll Goewin die gr&uuml;ne
                  H&ouml;hle betreten und den rechten Sch&auml;del
                  bearbeiten. Nun w&auml;re es ratsam,
                  abzuspeichern, da eine Actionsequenz folgen wird.
                  In der n&auml;chsten H&ouml;hle k&auml;mpft man
                  mit dem W&auml;chter und nachdem ihr ihn
                  schlie&szlig;lich besiegt habt, trifft man links
                  auf den Drachen. Jetzt sollte man den Trank
                  benutzen und mit ihm in Befehlsform sprechen. Man
                  erh&auml;lt von ihm das Auge von Gethryn. Auf den
                  R&uuml;ckweg einfach immer am linken Sch&auml;del
                  ziehen. Auf diesem Weg kann man das Labyrinth
                  bald hinter sich lassen und Mallin besuchen, der
                  &uuml;ber ads seltsame Verhalten einer Wache
                  berichtet. Nun betritt man Ewans Kr&auml;merladen
                  und wartet darauf, da&szlig; die besagte Wache
                  erscheint. Wenn der Skorl schlie&szlig;lich
                  auftaucht, schaut man durch das Fenster und
                  lauscht and&auml;chtig der skurrilen
                  Unterhaltung. Danach spricht man wieder mit Ewan
                  und darf an seiner Stelle in das Fa&szlig;, das
                  eine Freikarte ins Schlo&szlig; darstellt. Dort
                  angekommen speichert man wieder sicherheitshalber
                  ab. In der K&uuml;che kann man sich durch den
                  ekligen Kadaver geh&ouml;rig den Appetit
                  verderben. Totzdem sollte man das Fett und die
                  danebenh&auml;ngende Zange an sich nehmen. Nach
                  einem ausgiebigen Gespr&auml;ch mit dem Diener
                  Minnow, kann man ihn davon &uuml;berzeugen,
                  da&szlig; er dem W&auml;chter eine entscheidene
                  Information zukommen lassen soll (es befindet
                  sich jemand im Keller!) Jetzt mu&szlig; man
                  schnell das linke, obere Fa&szlig; anschauen und
                  die Zange mit Spundzapfen benutzen.
                  Anschlie&szlig;end rasch hinter dem rechten
                  Pfeiler verstecken. Dort wartet man darauf,
                  da&szlig; sich der gierige W&auml;chter unter den
                  Weinstrahl wirft. Nun geht man in die Halle der
                  Skorls und dann ganz nach rechts in den Raum mit
                  der Winde. Hier benutzt man das Fett mit dem
                  Hebel und gibt Minnow den Befehl ebenfalls in den
                  Raum zu kommen und an dem Hebel zu ziehen. In der
                  Zwischenzeit bet&auml;tigt man die Winde und die
                  Zugbr&uuml;cke wird heruntergelassen. Auf in den
                  Raum zwischen Halle und K&uuml;che. Dort geht man
                  zuerst nach oben und danach nach rechts. Hier
                  nocheinmal zwischenspeichern. Die n&auml;chste
                  Treppe, die nach oben f&uuml;hrt, zieht einen
                  Kampf mit einem W&auml;chter nach sich und im
                  letzten Raum spielt sich praktisch alles
                  automatisch ab. Geschafft!</P>
                  <HR>
                  <BR>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

