<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Etusivu</title>
		<meta name="generator" content="Handmade in Finland">
		<meta name="keywords" content="http://saku.amigafin.org">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><a name="top"></a></font>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../etusivu.html" target="_self">Etusivulle</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/thoriel.jpg" alt="Anu" height="193" width="187" border="1"></font></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Saku-lehden puolen vuoden &quot;virkavapaa&quot; on ohitse. Lehden osalta meno jatkuu taas ennallaan, mutta my&ouml;s jotain pieni&auml; uudistuksia on tehty. Layoutia on j&auml;lleen hieman uudistettu, ja uutistoimittajien perinteit&auml; jatkamaan ilmoittautui Joni Halme, joka vastaa t&auml;m&auml;n lehden uutisten p&auml;ivityspalstasta. Lis&auml;ksi mukana on pitk&auml;&auml;n kaivattu juttu Amigan ja PC:n verkottamisesta Samballa. Kiitokset kaikille kirjoittajille - vaikka Amiga-uutuuksien osalta on ollut hiljaista, saimme kuitenkin varsin mukavan lehden aikaiseksi.<br>
							<br>
							Yhdistyksen osaltakin puolessa vuodessa on p&auml;&auml;sty eteenp&auml;in. Vuoden p&auml;iv&auml;t Patentti- ja rekisterihallituksessa ollut yhdistysrekisterimuutoksemme hyv&auml;ksyttiin viimeinkin virallisesti helmikuun alussa, kuten <a href="http://193.229.70.49/ryhaku.htx?reknro=165.774&sb_reknrohaku=Hae" target="_blank">yhdistysrekisterihaku</a> kertoo. Saman tien laitoimme yhdistyksen pankkiasiat kuntoon, ja tilimme saatiin siirretty&auml; palvelumaksuiltaan kalliista Meritasta Oulun Osuuspankkiin, jossa tilimme palvelumaksut ovat nyt minimiss&auml;&auml;n. N&auml;in emme joudu en&auml;&auml; pit&auml;m&auml;&auml;n pit&auml;m&auml;&auml;n j&auml;senmaksuilla yll&auml; pankkitili&auml;, vaan l&auml;hes kaikki varat voidaan k&auml;ytt&auml;&auml; varsinaiseen yhdistystoimintaan. Uudet tilinumerot ja j&auml;senmaksuohjeet l&ouml;ytyv&auml;t my&ouml;s t&auml;m&auml;n lehden <a href="../toimitukselliset/yhdistys.html" target="_self">Yhdistys-osuudesta</a>.<br>
							<br>
							Uutta Saku-tapahtumaa kysell&auml;&auml;n edelleen kovasti. Saku 2001 j&auml;tti Amiga-harrastajiin j&auml;lkeens&auml; n&auml;l&auml;n, jota entisest&auml;&auml;n ruokkivat tulemaisillaan olevat Amiga-uutuudet. Haluamme mahdollisuuksien mukaan j&auml;rjest&auml;&auml; uuden Saku-tapaamisen, mutta emme vanhojen r&auml;&auml;ppi&auml;isi&auml;, vaan esitell&auml;ksemme uusia Amiga-tuotteita. Paljon siis riippuu siit&auml;, mill&auml; aikataululla n&auml;m&auml; lukuisat uutuudet - AmigaOne,&nbsp;Pegasos, AmigaOS 4, MorphOS - ilmestyv&auml;t markkinoille. Odottavan aika on pitk&auml;, ja odottamistahan meill&auml; on riitt&auml;nyt vuosikymmenen verran, mutta ensimm&auml;ist&auml; kertaa tuntuu silt&auml;, ett&auml; n&auml;ist&auml; tuotteista voisi tullakin jotain.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">N&auml;ill&auml; n&auml;kymin kuitenkin ensisijainen tavoite on s&auml;&auml;nt&ouml;m&auml;&auml;r&auml;inen vuosikokous ja sen j&auml;rjestelyt. Niinp&auml; niin - vuosi on taas kohta vier&auml;ht&auml;nyt. Kokous on s&auml;&auml;nt&ouml;jen mukaan j&auml;rjestett&auml;v&auml; hein&auml;-syyskuun aikana, mutta hein&auml;kuu on jo liian l&auml;hell&auml;. Elokuun alussa on Assembly 2002 -tapahtuma, ja itse olen elokuun lopulla reissussa. N&auml;ytt&auml;&auml; siis j&auml;lleen silt&auml;, ett&auml; syyskuulle t&auml;m&auml; j&auml;sentapaaminen j&auml;lleen j&auml;&auml;. Ehdotuksia pitopaikoista ja j&auml;rjestelyihin tarjokkaita otetaan vastaan.&nbsp;Viime vuoden vuosikokoushan pidettiin ensimm&auml;ist&auml; kertaa Oulussa - ehk&auml; nyt olisi jonkin muun paikkakunnan vuoro? Toiminnan laajentaminen muuallekin maahan palvelisi sek&auml; yhdistyst&auml; ett&auml; Suomen Amiga-harrastajia.<br>
							<br>
							Yhdistyksen kotisivuilla on ollut yli 10000 k&auml;vij&auml;&auml; t&auml;m&auml;n puolen vuoden aikana - laskuri lis&auml;ttiin tammikuun alussa. Kiitokset siit&auml; teille kaikille, ja viett&auml;k&auml;&auml; leppoisaa kes&auml;&auml;!<br>
							<br>
							<b>Anu Seilonen</b><br>
							
							
							
						
							Saku-lehden p&auml;&auml;toimittaja</font></td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../etusivu.html" target="_self">Etusivulle</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../sivukartta.html" target="_self">Sivukartta</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</font></td>
				</tr>
			</table>
		</center>
	</body>

</html>