<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>A 2 0 0 0 &nbsp; &amp; &nbsp; D e l f i n a &nbsp; L i t e</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Esa Lyttinen</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				Ostin noin vuosi sitten Delfina-&auml;&auml;nikortin A2000:een, jossa oli GVP:n 40 MHz:n 68030-turbo. Ensimm&auml;isten k&auml;ytt&ouml;kertojen aikana huomasin, etteiv&auml;t Amigani ja Delfina pystyneet tallentamaan &auml;&auml;niraitaa kunnolla, vaan nyppyj&auml; tuli joka kerta kiintolevyn valon vilkahtaessa, jopa pelk&auml;n soiton aikana. Nopea diagnoosi oli, ettei Amigani kyennyt tarpeeksi nopeaan tallennukseen. Kuten tied&auml;tte, FFS tekee tallennuksen kahdessa osassa, eli HD-valo v&auml;l&auml;ht&auml;&auml; kaksi kertaa per&auml;kk&auml;in silloin kun tallennetaan pitk&auml;&auml; tiedostoa, luettaessa n&auml;in k&auml;y vain kerran. T&auml;m&auml; kyseinen toinen kerta oli liikaa!<br>
				<br>
				Sakunetiss&auml; Esa Heikkinen neuvoi k&auml;ytt&auml;m&auml;&auml;n levyll&auml; isompaa blokkikokoa (4096 tai suurempaa). T&auml;st&auml; ei kuitenkaan ollut apua, tosin er&auml;&auml;t levyoperaatiot nopeutuivat tuntuvasti, esim. tiedostojen tuhoaminen on noin 1000x nopeampaa (eik&auml; IBrowsen cache jumita en&auml;&auml;). 600 Mt:n tiedosto katoaa noin sekunnissa, muuten sen poistamiseen kuluu ikuisuus. Vaikutus alkaa 4096 blokeilla, ja 8192 on periaatteessa maksimiarvo, jonka j&auml;lkeen ei tavoiteta en&auml;&auml; mit&auml;&auml;n n&auml;kyv&auml;&auml; etua. SCSI-levyll&auml; nopeutta tullee paljon enemm&auml;n kuin IDE:ll&auml;.<br>
				<br>
				Addbuffers-komentoa tuli testattua useampaan kertaan. Er&auml;&auml;ss&auml; v&auml;liss&auml; Gentle Eye kehotti testaamaan v&auml;yl&auml;nopeuden A2000:n ja Delfinan v&auml;lill&auml;. Testin kommentti oli tyly: "pahin mahdolinen yhdistelm&auml;". T&auml;ss&auml; vaiheessa uskoni t&auml;m&auml;n kaksikon yhdess&auml;oloon oli loppua. P&auml;&auml;tin kuitenkin viel&auml; jatkaa kokeiluitani: etsin AFS:n demon vanhoilta levyilt&auml;ni ja k&auml;&auml;nsin kiintolevyn osiot kyseiseen formaattiin. Operaatiosta oli selv&auml;sti apua, mutta se ei kuitenkaan t&auml;ysin poistanut ongelmaa. T&auml;ll&ouml;in osaltaan homma ratkesi, kun &auml;lysin lis&auml;t&auml; viel&auml; PowerCachen.<br>
				<br>
				Jonkin aikaa olin taas tyytyv&auml;inen, kunnes sain todellista hommaa Delfinalle: piti heitt&auml;&auml; er&auml;&auml;n b&auml;ndin keikkanauhat CD:lle. Koska kyseiset nauhat heitettiin suoraan kiintolevylle, oli t&auml;m&auml; vaativampi teht&auml;v&auml; kuin satunnaisen yhden kappaleen tallentaminen. T&auml;m&auml;n yhteydess&auml; havaitsin PowerCachen lakkaavan toimimasta noin 20 minuutin kuluttua startista (demoversio). Oli pakko taas alkaa etsi&auml; uudelleen ongelmaan ratkaisua. AFS sai my&ouml;s l&auml;hte&auml; er&auml;iden varsin v-m&auml;isten levyvirheiden ym. takia. Olin kuitenkin varsin positiivisella mielell&auml;, koska olin jo kerran todennut systeemin toimivan, joten olin hyv&auml;ss&auml; uskossa, ett&auml; sen saisi toimimaan my&ouml;s FFS:n kanssa.<br>
				<br>
				Taas oli tuttua addbuffersin ja blokkikokojen kanssa nutaamista edess&auml;. Muutama viikko turhauttavaa hommaa - toden totta - koska mik&auml;&auml;n ei tuntunut vaikuttavan mihink&auml;&auml;n! Projektin hauduttua viikkojen ajan lueskelin er&auml;st&auml; Amiga-aiheista kirjasta, jossa puhuttin HDToolsista (GVP:n kirja). Erityisesti kiinnitin huomiota kohtaan "mask", joka tarkoittaa k&auml;ytett&auml;v&auml;&auml; muistialuetta kiintolevyjen kanssa. T&auml;st&auml; sain kimmokkeen hieman nuuskia kyseisen maskin tilannetta A2000:n kiintolevylt&auml; - jospa olisi k&auml;ynyt niin, ett&auml; koneeni k&auml;ytt&auml;isi siirtoon vain Chip-muistia, joka olisi huomattavasti hitaampaa kuin turbolta l&ouml;ytyv&auml; 32-bittinen Fast.<br>
				<br>
				Intoni kuitenkin laantui nopeasti, koska Fast OLI k&auml;yt&ouml;ss&auml;. Kokeilumieless&auml; kuitenkin kokeilin Chip-asetusta. H&auml;mm&auml;stykseni oli suuri, koska t&auml;m&auml;n j&auml;lkeen systeemi toimi melkein kuten AFS ilman PowerCachea. Nopea vilkaisu HDToolsilla ja blokkikokoa suurentamaan 4096:sta 8192:een, ja homma oli pulkassa: Delfina tallensi ja toisti puhtaasti 30 minuuttia yht&auml; kyyti&auml;. Pitk&auml;n aikaa kortin ja Amigani yhteiselo oli sopuisaa, kunnes taas...<br>
				<br>
				Olin muutamia viikkoja sitten ostanut turbooni 030/50 MHz prosessorin, johon minulla ei viel&auml; ollut kidett&auml; hankittuna. Jo alikellotettuna (40 MHz) mutta MMU:lla varustettuna sain selv&auml;sti enemm&auml;n ryki&auml; koneeseeni, koska k&auml;yttis yms. lymyiliv&auml;t Fastissa MMU:lla suojattuna. Edellisess&auml; prossassa ei MMU:ta ollut, joten Fastiin siirto ei siksi ollut kovinkaan onnistunutta. Ajattelin Delfinan k&auml;yt&ouml;n olevan t&auml;ydellist&auml; koneen lis&auml;tehon suhteen, mutta eip&auml;s vain ollutkaan. P&auml;tkiminen oli entist&auml; hirve&auml;mp&auml;&auml;, edes soitosta ei meinannut tulla mit&auml;&auml;n. Muutamien tuntien &auml;herryksen tuloksena l&ouml;ysin ratkaisun: CpuControlilla MMU pois ja ROM pois Fast-muistista, niin taas toimi.<br>
				<br>
				Lopullinen lista teht&auml;vist&auml; t&ouml;ist&auml; on seuraavanlainen (A2000:n kanssa, soveltaen muihinkin malleihin):<br>
				<br>
				Kiintolevyosiolla, jolla &auml;&auml;nt&auml; k&auml;sittelet, pit&auml;&auml; olla seuraavat asiat:<br>
				<ul>
					<li>FastFileSystem</li>
					<li>blokkikoko 8192 (tai enemm&auml;n)</li>
					<li>mask 0x7ffffffc (vain Chip)</li>
				</ul><br>
				Amigasta:
				<ul>
					<li>MMU pois</li>
					<li>ROM alkuper&auml;isen&auml;, ei Fastissa</li>
				</ul><br>
				<br>
				Ohjelmia:<br>
				<ul>
					<li>CpuControl (prosessorin kontrollointiin)<br>
					<font size="2"><b>Aminet (parikin ohjelmaa):</b> <a href="http://ftp.sunet.se/aminetbin/find?cpucontrol" target="_top">http://ftp.sunet.se/aminetbin/find?cpucontrol</a></font></li>
					<li>DelfInit (kuten DelfMEM mutta varmempi)<br>
					<font size="2"><b>Aminet:</b> <a href="http://ftp.sunet.se/pub/aminet/util/misc/DelfInit.lha">http://ftp.sunet.se/pub/aminet/util/misc/DelfInit.lha</a> (14 kt)</font></li>
					<li>DelfAIFF (soittaa AIFF-tiedostot komeasti DSP:ll&auml;)<br>
					<font size="2"><b>Aminet:</b> <a href="http://ftp.sunet.se/pub/aminet/mus/play/DelfAIFF.lha">http://ftp.sunet.se/pub/aminet/mus/play/DelfAIFF.lha</a> (23 kt)</font></li>
					<li>DelfMPEG (MP2:t soivat DSP:ll&auml; 44,1 kHz stereona)<br>
					<font size="2"><b>Aminet:</b> <a href="http://ftp.sunet.se/pub/aminet/mus/play/DelfMPEG.lha">http://ftp.sunet.se/pub/aminet/mus/play/DelfMPEG.lha</a> (49 kt)</font></li>
				</ul>
			</td></tr>
		</table>
		</p>
		<p>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

