<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Litte&auml; n&auml;ytt&ouml; Amigaan?</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Tapani Tanskanen &lt;<a href="mailto:thitansk@cc.helsinki.fi">thitansk@cc.helsinki.fi</a>&gt;</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				Kukapa voisi kielt&auml;yty&auml; tarjouksesta: litte&auml; 15" n&auml;ytt&ouml; koek&auml;ytt&ouml;&ouml;n viikonlopuksi. N&auml;ytt&ouml; oli hieman vanhempi ViewSonicin 15,1" TFT-n&auml;ytt&ouml;, jota ei en&auml;&auml; varmasti mist&auml;&auml;n saa. Oli kuitenkin mielenkiintoista testata, kuinka helposti tuollaisen kapineen saa pelaamaan Amigan kanssa.<br>
				<br>
				<center><img src="kuvat/vsonic.jpg" width="250" height="258" alt="Viewsonic"></center><br>
				Heti ensimm&auml;isell&auml; kokeilulla n&auml;ytt&ouml; vaikutti toimivan vallan mainiosti ilman mit&auml;&auml;n s&auml;&auml;t&auml;mist&auml;. T&auml;ll&ouml;in k&auml;ytt&auml;m&auml;ni tila oli 1024x768. Eritt&auml;in lupaavaa.
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Ei aivan ongelmatonta</b></font>
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				Heti pienemp&auml;&auml; n&auml;ytt&ouml;tilaa kokeillessani n&auml;ytt&ouml; j&auml;i vain pime&auml;ksi. N&auml;ytt&ouml; ei siis tahdistu ihan mihin tahansa signaaleihin, joten t&auml;ytyy tiet&auml;&auml;, mitk&auml; taajuudet ovat n&auml;yt&ouml;lle optimaaliset ja s&auml;&auml;t&auml;&auml; sitten omat n&auml;ytt&ouml;tilat vastaaviksi. Optimaalisinta ei suinkaan usein ole paras virkistystaajuus, koska TFT-n&auml;ytt&ouml; ei toimi lainkaan samalla tavalla kuin perinteinen kuvaputki. N&auml;ytt&ouml; muuttaa kuvan analogisesta digitaaliseksi, joten siin&auml; ei voida ajatella olevan mit&auml;&auml;n tietty&auml; virkistystaajuutta eik&auml; kuva siis vilku pienill&auml;k&auml;&auml;n virkistystaajuuksilla. Parhaaksi mahdolliseksi kuvanlaatu saadaan, kun n&auml;ytt&ouml;signaalia ei miss&auml;&auml;n vaiheessa muuteta analogiseksi; t&auml;m&auml; vaatii tietysti erityisen n&auml;yt&ouml;nohjaimen ja n&auml;yt&ouml;n.<br>
				<br>
				Litteiss&auml; n&auml;yt&ouml;iss&auml; kannattaa ottaa huomioon niiden ominainen resoluutio: n&auml;ytt&ouml; on rakennettu toistamaan tarkalleen tietyn m&auml;&auml;r&auml;n pikseleit&auml; (15" malleissa 1024x768). Pienempi tai suurempi m&auml;&auml;r&auml; skaalataan (automaattisesti) n&auml;kym&auml;&auml;n koko kuva-alalla. T&auml;llainen skaalaaminen kuitenkin huonontaa kuvanlaatua olennaisesti, joten n&auml;yt&ouml;ss&auml; on syyt&auml; k&auml;ytt&auml;&auml; sen ominaista resoluutiota aina kun mahdollista. Skaalausten laaduissa on eroja melko paljon eri n&auml;ytt&ouml;jen v&auml;lill&auml;. Uudet n&auml;yt&ouml;t osaavat yleens&auml; pehment&auml;&auml; kuvan melko hyv&auml;ksi, kun taas testaamassani mallissa 1024x768:sta poikkeavat tilat olivat melko hirve&auml;&auml; katsottavaa.<br>
				<br>
				Litteiden n&auml;ytt&ouml;jen hinnat tulevat alasp&auml;in koko ajan samalla kun tekniikka kehittyy. N&auml;ytt&ouml;&auml; valittaessa kannattaa katsoa kuvanlaatua omin silmin my&ouml;s skaalatuilla tiloilla, koska varsinkin amigisteilla eri resoluutiot tulevat usein kysymykseen. Hintataso on t&auml;ll&auml; hetkell&auml; suunnilleen t&auml;t&auml; luokkaa:<br>
				<br>
				14,1" = alle 6 000 mk<br>
				15,1" = alle 10 000 mk<br>
				18,1" = yli 20 000 mk<br>
				<br>
				Kokoja ei voi suoraan verrata tavalliseen kuvaputkin&auml;ytt&ouml;&ouml;n, sill&auml; litte&auml; n&auml;ytt&ouml; vastaa aina suurempaa kuvaputkin&auml;ytt&ouml;&auml;.
			</td></tr>
		</table>
		</p>
		<p>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

