<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>HyperCOM 3</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Petteri Bamberg &lt;<a href="mailto:piibii@hotmail.com">piibii@hotmail.com</a>&gt;</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				Viime Sakussa (#30, 4/99) Tuomo M&auml;mmel&auml; kirjoitti HyperCOM1-sarjaportista. Artikkelin luettuani her&auml;si mieless&auml;ni ajatus. Koska koneestani oli yli vuosi sitten k&auml;r&auml;ht&auml;nyt hiiriportti ja jouduin pakosta uhraamaan koneen ainoan sarjaportin PC:n sarjahiirelle, olisi toinen sarjaportti kuin taivaan lahja. Sarjahiirt&auml; kun ei voinut modeemisessioiden aikana k&auml;ytt&auml;&auml;, ja osoittimen liikutteleminen n&auml;ppist&auml; paukuttamalla alkoi pitemm&auml;n p&auml;&auml;lle kyrsi&auml;.<br>
				<br>
				Seuraavana p&auml;iv&auml;n&auml; selailin lukion atk-luokassa Amiga-j&auml;lleenmyyjien kotisivuja, ja Amigatorin hinnastosta l&ouml;ytyi l&auml;j&auml; HyperCOM-tuotteita. HyperCOM1 (yksi nopea sarjaportti) maksoi vaivaiset 120 markkaa! Suurempi malli, HyperCOM3, jossa on kaksi nopeaa sarjaporttia ja yksi rinnakkaisliit&auml;nt&auml; (nopea sekin), maksoi sitten 330 markkaa.<br>
				<br>
				Aluksi aioin tilata HyperCOM1:n, mutta sitten muistin, ett&auml; koneestani oli my&ouml;s rinnakkaisportti hajonnut, niin ett&auml; se jumitti koneen aina kun yritin tulostaa jotain matriisikirjoittimellani (tosin &auml;&auml;nendigitoijani toimi siin&auml; aivan asiallisesti). Valitettavasti silloiset rahavarani eiv&auml;t riitt&auml;neet HyperCOM3:een, joten j&auml;tin asian hautumaan. Onneksi kuitenkin varovainen tiedustelu is&auml;lt&auml;ni paljasti, ett&auml; h&auml;n suostuisi maksamaan puolet kortista, joten seuraavana p&auml;iv&auml;n&auml; k&auml;vin Amigatorin kotisivuilta tilaamassa kortin itselleni ja j&auml;in odottelemaan.
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="#b0c4de" align="center">
				<font color="black"><b>Asennuksen ihmeit&auml;</b></font>
			</td></tr>
			<tr><td width="50%" bgcolor="#d8ecfd">
				Viikon odottelun j&auml;lkeen postilaatikkoon kolahti postiennakkolappu. K&auml;vin hakemassa paketin ja ajoin kotiin tarkastelemaan l&auml;hemmin ostostani. Paketista paljastui kirjekuori sek&auml; punertava muovipussi, jossa oli pieni, tuskin k&auml;mmenen kokoinen kortti. Kortista l&auml;hti kolme johtoa: kaksi sarjaporttia, joista toinen oli tavallinen 25-napainen ja toinen 9-napainen, sek&auml; yksi normaali rinnakkaisportti. Liittimet olivat jo valmiiksi kiinni asennusraudoissaan, joten metalliseen tornikoteloon ne saisi kytketty&auml; aivan plug'n'play-tyyliin.<br>
				<br>
				Koska oma tornini on tehty puusta, oli asentaminen aluksi hiukan ongelmallista. Lopulta nappasin tornistani takalevyn irti ja hakkasin taltalla siihen sopivan kokoiset rei&auml;t, joihin sain tungettua liittimet rautoineen. Lopuksi porasin viel&auml; levyyn tekemieni kolojen yl&auml;- ja alapuolille rei&auml;t, joista kiinnitin asennusraudat rautalangalla tukevasti takalevyyn. Kauniimminkin tuon olisi voinut tehd&auml;, mutta t&auml;ss&auml; vaiheessa kyseinen ratkaisu riitti minulle.<br>
				<br>
				Kun sitten tuli itse kortin asentamisen vuoro, syntyikin ongelma numero kaksi. Miten p&auml;in kortti tulisi asentaa kelloportin nastoihin? Kirjekuoressa olleesta lappusesta, joka oli luultavasti asennusohje, ei ollut apua, koska se oli saksankielinen. Pieni maalaisj&auml;rjell&auml; p&auml;hk&auml;ily osoitti, ett&auml; kortti mahtuisi paikoilleen vain yhdell&auml; tavalla, koska muuten Kickstart-piirit tulisivat kortin tielle. Kortti kiinni emolevyyn, koneen kuoret kiinni (poissa n&auml;kyvist&auml;, poissa mielest&auml; :) ja testaamaan!
 			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="#b0c4de" align="center">
				<font color="black"><b>Virtaa piireihin</b></font>
			</td></tr>
			<tr><td width="50%" bgcolor="#d8ecfd">
				K&auml;ynnistett&auml;ess&auml; kone n&auml;ytti toimivan kuten pitikin ja boottasi normaalisti aina Workbenchiin asti. Hyv&auml; niin. Virrat pois ja portteja testaamaan. Kytkin modeemin ja sarjahiiren portteihin kiinni ja boottasin koneen. Laitoin kirjekuoressa tulleen levykkeen asemaan ja asensin ajurit Install-ohjelmalla. Sitten k&auml;ynnistin Jr-Commin ja asetin deviceksi hyperCOM3.devicen sek&auml; unit-numeroksi ykk&ouml;sen (1). Modeemiini syttyi TR-valo, mik&auml; oli merkki siit&auml;, ett&auml; kone oli yhteydess&auml; siihen. N&auml;pyttelin terminaaliin ATZ, ja sain vastauksen OK - kaikki kunnossa.<br>
				<br>
				Sitten sarjahiiren kimppuun. SerMouse-ajurille voi antaa parametriksi my&ouml;s devicen ja unit-numeron, joten se on yhteensopiva HyperCOMien kanssa. Ja vot, sarjahiirikin rupesi pelitt&auml;m&auml;&auml;n. Fiilis oli mahtava, kun hiiri ja modeemi toimivat yht&auml; aikaa sulassa sovussa. Rinnakkaisportin kanssa tuli sitten ongelmia. Mik&auml;&auml;n omistamani ohjelma ei nimitt&auml;in antanut valita k&auml;ytett&auml;v&auml;&auml; rinnakkaisporttia, joten ainoa vaihtoehto oli mets&auml;st&auml;&auml; ohjelma, joka huijaisi vanhoja ohjelmia k&auml;ytt&auml;m&auml;&auml;n muuta kuin parallel.device&auml;. Aminetist&auml; varmasti l&ouml;ytyy, t&auml;ytyyp&auml; katsella...<br>
				<br>
				En tied&auml;, onko vika kortissa vai omassa koneessani, mutta my&ouml;hemmin k&auml;vi ilmi, ett&auml; korttia k&auml;ytt&auml;v&auml;t ohjelmat sekoilevat melkoisesti, ellei kone ole ensin l&auml;mmennyt muutaman minuutin verran. L&auml;mpenemisen j&auml;lkeen ongelmaa ei esiinny, vaan ainoastaan sitten kun kone on ollut pidemm&auml;n aikaa k&auml;ytt&auml;m&auml;tt&ouml;m&auml;n&auml;.
 			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="#b0c4de" align="center">
				<font color="black"><b>Loppusanat</b></font>
			</td></tr>
			<tr><td width="50%" bgcolor="#d8ecfd">
				Ylim&auml;&auml;r&auml;isist&auml;, nopeista sarjaporteista haikaileville HyperCOM3 on kannattava ostos. Sit&auml; paitsi, saapahan kaupan p&auml;&auml;llisiksi viel&auml; nopean rinnakkaisportinkin. Esim. monilinjaisen boksin omistavalle SysOpille useammat sarjaportit ovat v&auml;ltt&auml;m&auml;tt&ouml;mi&auml;. Nopean modeemin omistajat saavat lis&auml;&auml; puhtia tiedonsiirtoon, kun koneen sis&auml;inen sarjaportti ei ole en&auml;&auml; pullonkaulana.
 			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Valmistaja:</font></td>
				<td width="50%" bgcolor="#d8ecfd">VMC, <a href="http://www.vmc.de" target="_top">http://www.vmc.de</a>, <a href="mailto:info@vmc.de">info@vmc.de</a></td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Myyj&auml;:</font></td>
				<td width="50%" bgcolor="#d8ecfd">Amigator, <a href="http://www.vtoy.fi/~aho/" target="_top">http://www.vtoy.fi/~aho/</a>, <a href="mailto:aho@sip.fi">aho@sip.fi</a></td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
				<td width="50%" bgcolor="#d8ecfd">330 mk (HyperCOM1 120 mk)</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
				<td width="50%" bgcolor="#d8ecfd">A1200, jossa kelloportti vapaana</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
				<td width="50%" bgcolor="#d8ecfd">A1200, 4 Mt Fast, 85 Mt kiintolevy, 8x CD-ROM</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekniikkaa:</font></td>
				<td width="50%" bgcolor="#d8ecfd"><ul>
					<li>kaksi nopeaa 460 kbps nopeuteen pystyv&auml;&auml; sarjaporttia (toinen 25- ja toinen 9-napaisella liittimell&auml;)</li>
					<li>32 tavun puskuri (Amigan sis&auml;isess&auml; portissa on vain YHDEN tavun puskuri)</li>
					<li>yksi nopea rinnakkaisportti</li>
					<li>liitet&auml;&auml;n A1200:n kelloporttiin</li>
				</ul></td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Plussaa:</font></td>
				<td width="50%" bgcolor="#d8ecfd"><ul>
					<li>eritt&auml;in nopeat portit</li>
					<li>helppo asentaa</li>
					<li>hyv&auml; yhteensopivuus ohjelmien kanssa</li>
				</ul></td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Miinusta:</font></td>
				<td width="50%" bgcolor="#d8ecfd"><ul>
					<li>l&auml;mp&ouml;ongelmat? (omalla koneellani ainakin)</li>
					<li>vain saksankielinen asennusohje</li>
				</ul></td>
			</tr>
		</table>
		</p>
		<p>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

