<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>A m i g a O S &nbsp; 3 . 5</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Roni Ij&auml;s &lt;<a href="mailto:rNx@nic.fi">rNx@nic.fi</a>&gt;</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				<center><img src="kuvat/os35_3.jpg" width="229" height="125" alt=""></center>
				<br>
				T&auml;t&auml; on odotettu kuin kuuta nousevaa, eik&auml; suotta, sill&auml; uusi AmigaOS 3.5 kyll&auml; lunastaa kaikki odotukset. AmigaOS 3.5 tulee pahvisessa laatikossa, jota koristaa Boing-pallo ja teksti "OS 3.5". Laatikossa sis&auml;ll&auml; on OS3.5 CD, asennusohje ja rekister&ouml;intikortti.<br>
				<br>
				Kun CD:n laittaa asemaan, ruudulle tulee kaksi ikonia: AmigaOS3.5 ja Emergency-Boot. CD:lt&auml; l&ouml;ytyy my&ouml;s nelj&auml;megainen manuaali HTML-formaatissa sek&auml; OS 3.1, joka on asennettava ennen OS 3.5:t&auml;. Klikkaamalla OS3.5-Installation-ikonia asennusohjelma avaa oman ruudun, jonka taustalla on liukuv&auml;ri punaisesta keltaiseen. Asennus hoituu viidess&auml; osassa: PRE, MAIN, Internet-ohjelmistot, PPC-tuki ja CD-ROM-tuki. Lis&auml;n&auml; on my&ouml;s h&auml;t&auml;levykkeen tekeminen ja uuden kielen lis&auml;&auml;minen.<br>
				<br>
				PRE-asennuksessa kiintolevylle kopioidaan tiedostot, jotka tarvitaan asennuksen jatkamiseksi: uudet komennot C:hen, uudet datatyypit, ROM update DEVS:-hakemistoon ja muutama uusi library. T&auml;m&auml;n j&auml;lkeen kone k&auml;ynnistet&auml;&auml;n uudelleen, ja siirryt&auml;&auml;n seuraavaan asennukseen. MAIN-osiossa asennetaan itse k&auml;ytt&ouml;j&auml;rjestelm&auml;. Asennuksen aikana SYS:-osion ikonit k&auml;yd&auml;&auml;n l&auml;pi ja vaihdetaan uusiin.<br>
				<br>
				Muita asennuksia ei tarvitse v&auml;ltt&auml;m&auml;tt&auml; tehd&auml;, vaan uusi k&auml;ytt&ouml;j&auml;rjestelm&auml; on jo nyt k&auml;ytt&ouml;valmis. Asennuksen aikana MultiView avaa ruudulle kuvia, jotka kertovat tietoja k&auml;ytt&ouml;j&auml;rjestelm&auml;st&auml; ja kehottavat k&auml;ytt&auml;j&auml;&auml; l&auml;hett&auml;m&auml;&auml;n rekister&ouml;intikortin. T&auml;m&auml; on tuttua jo PC-maailmasta, esimerkiksi Windowsin asennuksesta, tosin t&auml;ss&auml; niiden tarkoitus ei ole est&auml;&auml; asentajaa pitk&auml;stym&auml;st&auml;.<br>
				<br>
				PPC-tuen asennuksessa kiintolevylle kopioidaan PowerPC-prosessorin k&auml;ytt&ouml;&ouml;n tarvittavat tiedostot. Internet-tukeen kuuluvat Miami 3.2b second edition, AWeb ja AmigaMail. Miamin OEM-versio ei ehtinyt mukaan, mutta sen on luvattu tulla my&ouml;hemmin saataville <a href="http://www.amiga.com" target="_top">http://www.amiga.com</a>:iin. CD-ROM-tuki on suurin piirtein samanlainen systeemin kuin IDEfix. Tosin AmigaOS 3.5 ei tue 4way-adapteria, ennen kuin on asennettu Amigan kotisivulta saatava ensimm&auml;isen virallinen p&auml;ivitys, joten CD-asemaa k&auml;ytet&auml;&auml;n atapi.devicen sijasta scsi.devicell&auml;.<br>
				<br>
				H&auml;t&auml;levykkeell&auml; koneen saa k&auml;ynnistetty&auml;, JOS se menee ns. paaliin. OS 3.5:ss&auml; skripti kopioi kiintolevylt&auml; tarpeelliset tiedostot, kuten t&auml;rkeimm&auml;t laiteajurit ja komennot, tavalliselle DD-levykkeelle. Asettamalla levykkeen ja OS 3.5 CD:n asemaan levyke lataa k&auml;ytt&ouml;j&auml;rjestelm&auml;n suoraan CD:lt&auml;. N&auml;in voit k&auml;tev&auml;sti setvi&auml; syyt&auml; koneen paalautumiseen. Taustakuvana on jopa hieno palava Boing-pallo.
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>No onko siin&auml; mit&auml;&auml;n uutta?</b></font>
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				Uutta on ja paljon! Kaikki oleellinen on p&auml;ivitetty ja paljon uusia ohjelmia lis&auml;tty. Hyv&auml;n&auml; esimerkkin&auml; toimii EditPad, OS 3.5:n tekstieditori, joka ajaa asiansa hyvin. Mit&auml;&auml;n GoldEdi&auml; siit&auml; ei ole l&auml;hdetty tekem&auml;&auml;n, mutta kyll&auml; se aina MicroEmacsin voittaa. Kaikki Prefsit k&auml;ytt&auml;v&auml;t GUInaan ohjelmaa nimelt&auml; Reaction. Periaatteessa se on vain ClassAct uudella nimell&auml;. GUIlla voi prefs-ikkunoihin s&auml;&auml;t&auml;&auml; mm. oman kirjasintyylin, painikkeiden tyylin, taustakuvan ja tilank&auml;yt&ouml;n (spacing).<br>
				<br>
				<center><img src="kuvat/os35_1.jpg" width="398" height="220" alt=""></center>
				<br>
				Ikonit OS 3.5:ss&auml; ovat aivan uutta formaattia, ne ovat palettimapattuja ja siisti&auml; GlowIcons-tyyli&auml;. OS 3.5 tajuaa my&ouml;s vanhat ikonit, NewIconit ja MagicWB-ikonit. MagicWB-ikonien v&auml;rit eiv&auml;t ole oikein, mutta t&auml;h&auml;n l&ouml;ytyy apu vaikkapa Aminetist&auml;, mm. TragicWB hoitaa ongelman kuntoon. Ikoneita liikutettaessa paikasta toiseen ne muuttuvat l&auml;pin&auml;kyviksi.<br>
				<br>
				<center><img src="kuvat/os35_2.jpg" width="379" height="243" alt=""></center>
				<br>
				My&ouml;s kopiointia on paranneltu. Se on nyt nopeampaa, ja kopioidessa dataa paikasta toiseen tulee ruudulle "progress indicator", joka n&auml;ytt&auml;&auml; montako prosenttia kopioinnista on kulunut. Taustakuviksi voi OS 3.5:ss&auml; ladata my&ouml;s JPEG-muotoisia kuvia.
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Loppusanat</b></font>
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				Suosittelen l&auml;mpim&auml;sti kaikille! T&auml;h&auml;n juttuun en saanut l&auml;hesk&auml;&auml;n kaikkea uutta ja mainitsemisen arvoista kirjoitettua, mutta s&auml;hk&ouml;postiosoitteeseeni <a href="mailto:rNx@nic.fi">rNx@nic.fi</a> voi l&auml;hett&auml;&auml; OS 3.5:tt&auml; koskevia kysymyksi&auml;, joihin kaivataan vastausta.<br>
				<br>
				Ensimm&auml;inen p&auml;ivityspakettikin, Boing Bag 1, on jo saatavana:<br>
				<a href="http://www.amiga.de/amigaos35/download/boingbag1.lzx">http://www.amiga.de/amigaos35/download/boingbag1.lzx</a> (3,6 Mt) tai
				<a href="http://www.amiga.de/amigaos35/download/boingbag1.lha">http://www.amiga.de/amigaos35/download/boingbag1.lha</a> (5,2 Mt)
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">AmigaOS 3.5</font></td>
				<td width="50%" bgcolor="#d8ecfd"><font size="2"><a href="http://www.amiga.de/amigaos35/index-e.html" target="_top">http://www.amiga.de/amigaos35/index-e.html</a></font></td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
				<td width="50%" bgcolor="#d8ecfd">68020, CD-ROM, 20 Mt kiintolevy, 8 Mt muistia</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Suositus:</font></td>
				<td width="50%" bgcolor="#d8ecfd">68040, CD-ROM, 80+ Mt kiintolevy, 32+ Mt muistia, grafiikkakortti</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
				<td width="50%" bgcolor="#d8ecfd">A1200, PPC 603e/240 MHz + 68060/50 MHz, 15,2 Gt kiintolevy, 64 Mt muistia, 48x CD-ROM BVisionPPC</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Myyj&auml;:</font></td>
				<td width="50%" bgcolor="#d8ecfd">Gentle Eye Ky, puh. (03) 363 0048<br><font size="2"><a href="mailto:ge@vip.fi">ge@vip.fi</a>, <a href="http://www.ge.vip.fi/" target="_top">http://www.ge.vip.fi/</a></font></td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
				<td width="50%" bgcolor="#d8ecfd">370 mk (2.1.2000)</td>
			</tr>
		</table>
		</p>
		<p>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

