<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>V N C &nbsp; - &nbsp; V i r t u a l &nbsp; N e t w o r k &nbsp; C o m p u t i n g</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Risto M&auml;ki-Pet&auml;ys &lt;<a href="mailto:basscade7@hotmail.com">basscade7@hotmail.com</a>&gt;</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				Hankittuani toisen koneen tuli tarve monitorinvaihtajalle. Toiseen monitoriin ei ollut varaa eik&auml; p&ouml;yd&auml;ll&auml; olisi moiselle ollut tilaakaan. Pikaisena h&auml;t&auml;keinona toimi n&auml;ytt&ouml;kortin AGA-tilojen l&auml;pivientiliittimen hy&ouml;dynt&auml;minen, mutta AGA-tilatkin oli tarkoitus saada n&auml;kym&auml;&auml;n. Hieman ennen monitorinvaihtajaa onnistuin asentamaan l&auml;hiverkon ja VNC:n. Kyseinen ohjelmisto mahdollistaa koneen graafisen k&auml;yt&ouml;n IP-verkon yli. Ohjelmisto on ilmainen ja l&ouml;ytyy mm. Amigalle, Windowsille, Macille ja UNIXille. Eri k&auml;&auml;nn&ouml;kset ovat kesken&auml;&auml;n yhteensopivia.<br>
				<br>
				<center><img src="kuvat/vnc.jpg" width="320" height="320" alt=""></center>
				<br>
				Ohjelma yll&auml;tti toimimalla heti ensimm&auml;isell&auml; yrityksell&auml;, toisin kuin testaamani Samba- ja FTP-palvelimet. Turvallisuussyist&auml; (vaikka koneet ovat kiinni vain toistensa v&auml;lisess&auml; verkossa) palvelin velvoittaa salasanaa toimiakseen, mutta se voi olla yksinkertainenkin, toisin kuin UNIX-tunnuksissa. Amiga Foreverin tekij&auml; v&auml;itti, ettei Amigan teho riit&auml; PC:n ohjelmien k&auml;ytt&ouml;&ouml;n verkon yli, mutta VNC:p&auml; todisti v&auml;itteen v&auml;&auml;r&auml;ksi. K&auml;ytt&ouml; on CyberVision64:lla 1024x768x16bit-tilassa hieman tahmeaa mutta toimivaa - yht&auml; nopea kuin koulun Pentium II:illa testatessani, ja suurimpana pullonkaulana on verkkoyhteys. Protokolla ei n&auml;yt&auml; k&auml;ytt&auml;v&auml;n mit&auml;&auml;n virheenkorjausta tarkistussumman lis&auml;ksi, sill&auml; t&auml;ydell&auml; tehonkulutuksella n&auml;yt&ouml;lle ilmestyy tyhji&auml; neli&ouml;it&auml;. Pyyhkim&auml;ll&auml; niit&auml; hiirell&auml; ne kuitenkin korjaantuvat.<br>
				<br>
				K&auml;ytin VNC:t&auml; alun perin koaksiaalikaapeliverkolla, jolloin nopeus oli 150-300 kt luokkaa. Yritin nopeuttaa toimintaa hankkimalla pari RJ-45-kaapelia ja hubin, mutta nopeus on edelleen sama. Hitaus saattaa johtua PC:ss&auml; olevasta ISA-pohjaisesta verkkokortista, sill&auml; Amigalla olen parhaimmillani saanut toista megaa sekunnissa. Nopeus riitt&auml;&auml; kuitenkin tiedostojen hallintaan ja koneen yksinkertaiseen k&auml;ytt&ouml;&ouml;n. Animaatiot eiv&auml;t oikein py&ouml;ri verkon yli, ja joidenkin harvojen ohjelmien kanssa tulee ongelmia (esim. piilotettu k&auml;ynnistysvalikko ei ilmesty esille toisen koneen hiirell&auml;). Hallintaohjelman (client) saa Amigalla n&auml;kym&auml;&auml;n omalla n&auml;yt&ouml;ll&auml;&auml;n tai ikkunassa. Ikkunoidusta versiosta on eri kokoonpanoille (mm. paletillinen, 16-bittinen, 32-bittinen, PIP) optimoidut versiot.<br>
 				<br>
				Parhaillaan VNC sopii niille, joilla on kaksi tai useampaa konetta ja yksi monitori tai koneet sijaitsevat toisistaan kaukana. Jos on erillinen CD-polttokone, voi n&auml;pp&auml;r&auml;sti hakea sen kiintolevylle tarvittavat tiedostot ja laittaa CD:n palamaan ilman ett&auml; tarvitsee poistua paikaltaan. Ongelmana on viel&auml; CD-kelkan sulkeminen, joka ei ohjelmallisesti Windowsissa onnistu helposti. Periaatteessa VNC:t&auml; voi k&auml;ytt&auml;&auml; et&auml;verkonkin yli, mutta se on modeemivauhdilla liian hidasta. Parasta VNC:ss&auml; on mielest&auml;ni ilmaisuus ja toimivuus. Vaikka n&auml;yt&ouml;lle v&auml;list&auml; ilmestyy roskaa, VNC ei ole kertaakaan kaatanut kumpaakaan konetta ja on toiminut moitteetta my&ouml;s koulun Windows NT -koneilla. Amigan hallintaohjelman (VVA) mukana tulee l&auml;hdekoodi, ja se on saatavilla my&ouml;s alkuper&auml;isest&auml; palvelinohjelmasta.
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekij&auml;:</font></td>
				<td width="50%" bgcolor="#d8ecfd">Joerg Dietrich, <a href="mailto:dspach@altern.org">dspach@altern.org</a> (Client)<br>St&eacute;phane Guillard, <a href="mailto:stephane.guillard@steria.fr">stephane.guillard@steria.fr</a> (Server)</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
				<td width="50%" bgcolor="#d8ecfd">TCP/IP-verkko, AGA tai n&auml;ytt&ouml;kortti, AmigaOS 3.0</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Suositus:</font></td>
				<td width="50%" bgcolor="#d8ecfd">nopea TCP/IP-verkko, n&auml;ytt&ouml;kortti, Fast-muistia, AmigaOS 3.1</td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
				<td width="50%" bgcolor="#d8ecfd">A4000/040, CV64, Ariadne 2 ja<br>P200, 3COM Etherlink III 3c509B</td>
			</tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				<font size="2"><b>Aminet:</b><br>
				<a href="http://se.aminet.net/pub/aminet/comm/tcp/AmiVNC.lha">http://se.aminet.net/pub/aminet/comm/tcp/AmiVNC.lha</a> (Server)<br>
				<br>
				<b>WWW:</b><br>
				<a href="http://www.uk.research.att.com/vnc" target="_top">http://www.uk.research.att.com/vnc</a><br>
				<a href="http://altern.org/dspach/sub-amiga/vva-vnc/vva095.lha">http://altern.org/dspach/sub-amiga/vva-vnc/vva095.lha</a> (Client)</font>
			</td></tr>
		</table>
		</p>
		<p>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

