<html>
<head>
<!-- "author" content="Wolf Zimmer"     -->
<title>EMail-Knigge</title>
</head>
<body background="wolf1.gif" text=black link=blue vlink=blue bgcolor=gray>
<a href="onl_email00.html">zur&uuml;ck zur Hauptseite </a>
<br>

<h3>Wer steht hinter dieser Seite?</h3>

<p>Mein Name ist Thorsten Scheffner. Im Juli 1999 habe ich mein
Studium (Mathematik und Chemie auf Lehramt) an der Universit&auml;t Hamburg
abgeschlossen. Einer meiner Schwerpunkte im Studium war der Bereich
&quot;Medienp&auml;dagogik&quot;, daher auch mein Interesse am Medium
&quot;Internet&quot; und seinen einzelnen Diensten. </p>

<p>Da Deutschland immer noch ein Entwicklungsland im Einsatz des Internets
ist, hielt ich es f&uuml;r eine gute Idee, klassische amerikanische Texte
zum Thema &quot;Internet&quot; zu &uuml;bersetzen. Der Email-Guide war der
erste und bisher einzige Schritt dazu. In Zukunft sollen aber noch weitere
Texte hinzukommen (wer Vorschl&auml;ge oder gar selber einen guten Text
&uuml;bersetzt bzw. geschrieben hat, ist herzlich eingeladen, diesen hier
abzulegen). Ein Projekt, das gerade auf meiner Festplatte ruht, ist ein
Ratgeber f&uuml;r Eltern: Wie sollen Kinder an das Internet
herangef&uuml;hrt werden? - Wenn jemand Interesse hat, &uuml;berlasse ich
auch gern oder arbeite mit.</p>

<p>Meine weiteren Leidenschaften - neben dem Internet - sind der <a
href="#web">Mac</a>, Kino, Radfahren und <a href="Nelda.html">Katzen.
</a></p>

<p>&Uuml;brigens: wenn jemand einen Job f&uuml;r mich hat, der mit
Internet, <a href="#web">Website-Gestaltung</a> oder Weiterbildung zu tun
hat, bitte unbedingt <a
href="mailto:Scheffner@gmx.de?subject=Job-Angebot">mailen</a>!</p>

<h3>Warum dieses Design?</h3>

<p>Das Ziel war es, einen HTML-Code zu schreiben, der auf m&ouml;glichst
allen Computern gleich aussieht, schnell geladen wird und korrekt ist (das
war das Schwerste ;-). &quot;Spielereien&quot; wie z.B. Java, Java-Script usw. sind
manchmal zwar sch&ouml;n anzusehen - es macht aber keinen Sinn, sie auf
einer Seite einzusetzen, deren Schwerpunkt die reine
Informationsvermittlung ist. Wer anderer Meinung ist, ist eingeladen, mich
zu &uuml;berzeugen ;-)</p>

<h3>Wie ist das Copyright zu verstehen?</h3>

<p>Es gibt eine einfache Formel - wer kein Geld damit verdienen m&ouml;chte
(z.B. in Schulen, Universitäten, als Erg&auml;nzung auf der eigenen
Internetseite oder in nicht kommerziellen Seminaren) darf diese Seiten
kostenlos und ohne Einschr&auml;nkungen nutzen und anpassen. Wer damit Geld
verdienen will, muss uns fragen. Ich freue mich aber, &uuml;ber eine
Nachricht, wo das Material eingesetzt wurde und wie es ankam.</p>

<h3>Welche &Auml;nderungen gibt es in dieser Version?</h3>

<p>In der Version 1.5.1 gibt es folgende &Auml;nderungen:
<ul>
<li>Einige Fehler und Unklarheiten wurden beseitigt und
<li>die Schrift und Schriftgr&ouml;&szlig;e auf Wunsch einiger
Nutzer ver&auml;ndert
</ul></p>

<h3>Wie soll es mit dieser Seite weitergehen?</h3>

<p>Wie schon gesagt - diese Seite soll wachsen! Meine
Bem&uuml;hungen gehen im Augenblick noch in Richtung Email: Geschichte und
Technisches (u.a. Clients f&uuml;r verschiedene Betriebssysteme etc.). Ich
stehe auch schon mit einigen Leuten in Kontakt - wenn ich mehr wei&szlig;,
sage ich rechtzeitig Bescheid.</p>

<h3><a name="web"></a>Gibt es noch mehr
Seiten von / mit Dir?</h3>

<p>JA! Z.Zt. arbeite ich mehr oder minder regelm&auml;&szlig;ig bei: <ul>
<li><a href="http://www.macnews.de">macnews.de</a> (insbesondere bei
AppleCube),
<li>der <a href="http://mayworld.de/apfeltasche">Apfeltasche</a>
(Mac-Wochenr&uuml;ckblick) und
<li>den <a href="http://www.macguardians.de">MacGuardians</a> (Redaktion:
MacReview).
</ul></p>

<p>Weitere Dinge ruhen im Augenblick oder entwickeln sich erst (gell,
Nils).</p><h3>Noch Fragen?</h3><p>Don't hesitate to <a
href="mailto:Scheffner@gmx.de?subject=Frage an Tosse">mail</a>!</p>
<a href="onl_email00.html">zur&uuml;ck zur Hauptseite </a><br>
</body>
</html>

