<HTML>
<HEAD><TITLE>AmZeiger 06/97 - IBrowse V1.11</TITLE>
<META NAME="keywords"    CONTENT="Amiga,WWW,IBrowse,Browser,Magazin,Computer">
<META NAME="author"      CONTENT="Andreas Schlick">
</HEAD>
<BODY BACKGROUND="../images/BG.gif"><CENTER>
<H1><U>IBrowse V1.11</U></H1>von<BR><A HREF="mailto:A.Schlick@gmx.de">Andreas Schlick</A><P></CENTER>

<p>
<B>IBrowse</B> benutzt, wie auch <A HREF="9706voy.htm">Voyager</A>, <A HREF="http://www.sasg.com">MUI</A> (erforderlich ist MUI 3.8).
Ohne jetzt &uuml;ber MUI im allgemeinen zu urteilen, macht <B>IBrowse</B> erst mal
einen guten Eindruck, was die Oberfl&auml;che betrifft. Die F&auml;higkeiten von
MUI werden ausgereizt und man kann sich daher die Oberfl&auml;che beinahe beliebig
zusammenstellen.</p> 

<p>
Die Standard-Einstellung ist an Netscape angelehnt, es k&ouml;nnen jedoch die einzelnen 
Elemente (Fastlinks-, Navigationsbuttons, Transferanim etc.) gegeneinander ausgetauscht 
oder abgeschaltet werden. Wenn man also z.B. die Buttonleisten lieber am unteren Rand 
des Fenster haben will, so stellt das kein Problem dar (einfaches `Drag&amp;Drop' 
gen&uuml;gt :) Oder wer nur eine geringe Aufl&ouml;sung hat, kann die nicht ben&ouml;tigten 
Elemente ausschalten, bzw. durch einfachen Text ersetzen lassen. Die Buttonimages und
die Transferanim lassen sich selbstverst&auml;ndlich gegen andere austauschen.
Das Drag&amp;Drop ist recht konsequent durchgezogen, so da&szlig; auch HTML-Addressen
aus dem Cachebrowser in z.B. die Hotlist &uuml;bertragen werden k&ouml;nnen.</p>
<P>
<B>Images:</B>
<p>
<B>IBrowse</B> verwendet entweder seine internen Routinen oder greift auf externe
zur&uuml;ck. Wenn man jedoch externe Routinen verwendet, so k&ouml;nnen keine
GIF-Animationen mehr dargestellt werden. Im Gegensatz zu Voyager ist jedoch 
ausw&auml;hlbar, wann die GIF-Anims abgespielt werden sollen (immer, wenn IBrowse
aktiv/wenn Fenster aktiv/nie), da sie einiges an Rechenzeit verbrauchen.
Bei der Palettenberechnung kann zwischen verschiedenen Qualit&auml;tsstufen gew&auml;hlt
werden. An Dithering-Optionen stehen 'nur' keine oder Floyd-Steinberg zur Verf&uuml;gung.
</P>
<B>F&auml;higkeiten:</B>

<p><B>IBrowse</B> stellt den HTML-Code immer noch am besten von allen Amiga-Browsern
dar. Seit der Version 1.10 unterst&uuml;tzt IBrowse auch Frames und hat damit den
Vorsprung von Voyager wieder eingeholt. <B>IBrowse</B> stellt Tabellen und Frames fast
v&ouml;llig korrekt dar - selbst Tabellen in Tabellen, womit Voyager noch gewaltige 
Probleme hat.</p>

<p>Insgesamt wird der gr&ouml;&szlig;te Teil von
HTML 3.2 (+ Frames und <A HREF="#Anmerk">Cookies</A>) unterst&uuml;tzt. An anderen Protokollen
versteht <B>IBrowse</B>: FTP, Gopher und EMail (interner oder externer Mailer). Für Telnet kann
ein externer Befehl angegeben werden.</p>
<p>
Ein besonders nettes Features ist das editierbare Sourcecode-Fenster. Man
kann also kleinere Fehler gleich im Sourcecode &auml;ndern und sich die Ver&auml;nderung
anschauen oder bei lokalen Files auch speichern. Eine &Uuml;bergabe an einen Editor ist 
ebenfalls m&ouml;glich.</p>
<p>
IBrowse bietet auch das von <A HREF="9706awb.htm"><B>AWeb</B></A> bekannte NetStatus-Fenster,
in dem angezeigt wird, welche Dateien gerade geladen werden, bzw. requestet sind und wie
weit die &Uuml;bertragung fortgeschritten ist.</p>

<B>ein paar Features als &Uuml;bersicht:</B><BR>
<UL>
<LI>Frames-Unterst&uuml;tzung (auch abschaltbar!)</LI>
<LI>Cookie-Unterst&uuml;tzung</LI>
<LI>Unterst&uuml;tzt Background-Sound (Datatype)</LI>
<LI>NetStat-Window</LI>
<LI>Drag&amp;Drop</LI>
<LI>sehr frei konfigurierbare Oberfl&auml;che</LI>
<LI>u.v.m.</LI>
</UL>

<B>Stabilit&auml;t:</B>
<p>
Bei mir l&auml;uft <B>IBrowse V1.11</B> (mal wieder :) recht stabil. Es kann jedoch je nach System
auch zu Abst&uuml;rzen kommen. :(</P>

<B>Bugs:</B>
<p>
<UL><LI>Durch bestimmte Forms kann es passieren,  da&szlig; die restliche Seite 
nicht dargestellt wird.</LI></UL>
</P>
<B>Allgemeine Beurteilung:</B>
<p>
Mein allgemeiner Eindruck von <B>IBrowse</B> ist gut, da er die meisten
HTML-Befehle versteht. Leider ist IBrowse recht speicherhungrig, so da&szlig; ich es
f&uuml;r kleinere Systeme nicht empfehlen w&uuml;rde. Wer jedoch eine schnellere
CPU und genug RAM hat, dem w&uuml;rde ich IBrowse gegen&uuml;ber den anderen Browsern
sofort nahelegen. Eine Demo-Version von IBrowse V1.11 ist leider momentan
nicht erh&auml;ltlich.</p>

<B>Weitere Entwicklung:</B>

<p>
Auf lange Sicht ist auch eine Unterst&uuml;tzung f&uuml;r Java geplant, wobei es
sich jedoch um eine eigene Entwicklung handeln soll und nicht um die
Verwendung eines anderen Java-Systems.</P>

<A NAME="Anmerk"><B>Anmerkung:</B></A>
<p>
Die Cookies k&ouml;nnen wahlweise immer, nach einmaliger
Nachfrage, nach immer wiederkehrender Nachfrage oder nie akzeptiert werden.
Des weiteren m&ouml;chte ich noch zu dem Thema allgemein sagen, da&szlig; Cookies es
nicht erleichtern, den Rechner auszuspionieren! In einem Cookie sind
z.B. userdefinierte Daten abspeicherbar, die bei einem erneuten
Anw&auml;hlen der Seite gleich eine Ver&auml;nderung bewirken. Z.B. k&ouml;nnte 
in einem Cookie abgespeichert werden, wonach man das letzte Mal bei einer
Search-Engine gesucht hat, so da&szlig; man dann gleich weitersuchen kann, o.&auml;..</p>
<P>
<TABLE ALIGN=CENTER BORDER=1>
<TR><TD><B>Produkt:</B></TD><TD>IBrowse</TD><TD><B>Hersteller:</B></TD><TD><A HREF="http://www.omnipresence.com">Omnipresence</A></TD></TR>
<TR><TD><B>Art:</B></TD><TD>Web-Browser</TD><TD><B>Version:</B></TD><TD>1.11</TD></TR>
<TR><TD><B>Preis:</B></TD><TD>ca. 100 DM zzgl. Versandk.</TD><TD><B>Bez.Quelle:</B></TD><TD><A HREF="http://www.maxon.de">Maxon Computer</A></TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>2</TD><TD ALIGN=CENTER ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD  ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE>
<P><HR>
<TABLE WIDTH=100%>
<TR><TD ALIGN=LEFT><A HREF="../SW/AWBT0697.htm"><FONT SIZE=2>Prev</FONT></A></TD>
<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../AmZ0697/main.htm">Inhaltsverzeichnis</A></FONT></TD><TD ALIGN=RIGHT><A HREF="../SW/Voy0697.htm"><FONT SIZE=2>Next</FONT></A></TD></TR>
<TR><TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de"> Der AmZeiger</A></FONT></TD></TR></TABLE>
</BODY></HTML>
