<HTML><HEAD>
<TITLE>AmZeiger 06/97 - Voyager V2.88</TITLE>
<META NAME="keywords"    CONTENT="Amiga,WWW,IBrowse,Browser,Magazin,Computer">
<META NAME="author"      CONTENT="Andreas Schlick">
</HEAD>
<BODY BACKGROUND="../images/BG.gif"><CENTER>
<H1><U>Voyager V2.88</U></H1>von<BR><A HREF="mailto:A.Schlick@gmx.de">Andreas Schlick</A><P></CENTER>

Oliver Wagner benutzt, wie bei allen seinen neueren Projekten <A HREF="http://www.sasg.com">MUI</A>. Jedoch kann die
Oberfl&auml;che nicht so frei gestaltet werden, wie bei <A HREF="../SW/9706ib.htm">IBrowse</A>. Die Navigationsbuttons
sind nicht einmal ausschaltbar. Die Auswahl beschr&auml;nkt sich auf 'Icons & Text', 'Icons only' und 'Text only'. 
Die Aufteilung des Fensters ist standardm&auml;ssig und bietet nichts Neues.<P>

<B>Images:</B>

<p>
<B>Voyager</B> benutzt seine internen Routinen zum Image-Decoding. Zur Farbreduzierung
stehen zwei Qualit&auml;tsstufen zur Verf&uuml;gung, plus ein abschaltbares Dithering.
Als Ditheringverfahren kann man Floyd-Steinberg und Ordered auswählen,
w&auml;hrend IBrowse nur Floyd-Steinberg und die AWeb-II-Demo kein Dithering
unterst&uuml;tzt. Die Decodierungsroutinen lieferten auf meiner Retina wesentlich
bessere Ergebnisse als die von IBrowse (damals noch V1.02). Momentan
scheinen beide Routinen auf meiner <A HREF="../HW/picasso4.htm">PicassoIV</A> gleich
gute Qualit&auml;t zu bieten, wobei ich mir jedoch nie sicher bin, ob nicht die
Picasso96-SW noch etwas dazwischenpfuscht.
Im Gegensatz zu fr&uuml;heren Versionen sind Voyagers Routinen erheblich weniger 
bugbehaftet und st&uuml;rzen nicht mehr so h&auml;ufig ab (im allgemeinen konnten 
jedoch noch  wichtige Daten gesichert werden).
<P>
<B>F&auml;higkeiten:</B>

<p>
Es wird zwar ein gro&szlig;er Teil der HTML 3.2-Konvention unterst&uuml;tzt, teilweise wurde
jedoch nur 'halbherzig' programmiert. Zum Beispiel stellt Voyager Tabellen in Tabellen 
nicht immer korrekt dar, was auch f&uuml;r Bilder in Tabellen gilt.</P>

<p>
Als einziger Amiga-Webbrowser besitzt <B>Voyager</B> ein Interface f&uuml;r PlugIns. Bisher
gibt es allerdings nur das Search-Plugin, das einen Suchbegriff zu vier verschiedenen 
Search-Engines schickt, so da&szlig; der Gebrauch von sogenannten Meta-Search-Engines 
entfallen kann.</p>
<p>
Etwas st&ouml;rend ist, da&szlig; Voyager nur in der Lage ist, eine Gruppe aus der Hotlist im 
Men&uuml; darzustellen, so da&szlig; erst einmal eine Obergruppe erstellt werden mu&szlig;, 
wenn man mehrere Untermen&uuml;s anzeigen lassen will. Das st&ouml;rt besonders, wenn man die Hotlist
von anderen Browsern konvertiert.</p>
<p>
Besonders gelungen ist der neue Cachebrowser. Der Cachebrowser listet die gecachten
Web-Seiten alle sortiert entweder nach Typ (z.B. gif, jpeg, html, ...), Alter oder URL auf.
Angezeigt wird dabei die URL, Typ, Gr&ouml;&szlig;e, Alter und der Dateiname des Files im 
Cache-Dir. Die angew&auml;hlten Seiten k&ouml;nnen dann verschoben, kopiert oder gel&ouml;scht 
werden. Des weiteren sind auch bestimmte Seiten versteckbar, damit auch lange Listen 
&uuml;bersichtlicher werden. Eine Selection per Pattern ist ebenso m&ouml;glich. Negativ 
ist mir dabei aufgefallen, da&szlig; der Button "View" die Files einfach nur auf die 
Festplatte kopierte.</p>
<P>
<B>ein paar Features als &Uuml;bersicht:</B><BR>
<UL>
<LI>SSL-Unterst&uuml;tzung</LI>
<LI>Frames-Unterst&uuml;tzung (inkl. kleinem Bug)</LI>
<LI>Cookie-Unterst&uuml;tzung</LI>
<LI>NetStat-Window</LI>
<LI>PNG support</LI>
<LI>u.v.m.</LI>
</UL>

<B>Stabilit&auml;t:</B>
<p>
Meiner Meinung nach ist die Stabilit&auml;t (besonders die der alten Version) sehr 
systemabh&auml;ngig. W&auml;hrend ich h&auml;ufiger Abst&uuml;rze des Imagedecoding-Tasks 
und beim FTP hatte, l&auml;uft es bei einem Freund sehr stabil.
</P>

<B>Bugs:</B>

<UL>
<LI>Wenn einzelne Frame-Inhalte ge&auml;ndert werden, w&auml;hrend die Location gleich bleibt, 
springt Voyager beim Ver&auml;ndern der Gr&ouml;&szlig;e des Fensters zur Locationseite 
zur&uuml;ck. Obwohl ich den Bug schon bei einer der fr&uuml;hesten
Beta-Versionen gemeldet hatte, wurde er bis zur V2.88 leider nicht behoben. :(
<LI>Der Cachebrowser kopiert beim Klick auf &quot;View&quot; die Files einfach nur auf 
die Festplatte.
</UL>

<B>Allgemeine Beurteilung:</B>
<p>
<B>Voyager</B> ist zwar noch nicht v&ouml;llig ausgereift, jedoch hat sich besonders in der
letzten Version einiges getan, gerade was die Stabilit&auml;t betrifft. Wer nicht
gleich das Geld f&uuml;r IBrowse ausgeben will, der ist mit <B>Voyager</B> gut beraten,
da er nicht soviel kostet. F&uuml;r den durchschnittlichen Anwender reicht Voyager aus. Er hat
zwar noch ein paar Macken, die aber hoffentlich bald behoben werden. IBrowse bietet
jedoch immer noch eine gr&ouml;&szlig;ere Kompatiblit&auml;t.<P>
</P>
<B>Weitere Entwicklung:</B>
<p>
F&uuml;r <B>Voyager</B> ist ein JavaScript-PlugIn in Arbeit. Weitere Informationen dazu
lagen bei Redaktionschlu&szlig; leider nicht vor.<P>

<TABLE ALIGN=CENTER BORDER=1>
<TR><TD><B>Produkt:</B></TD><TD>Voyager</TD><TD><B>Hersteller:</B></TD><TD>Oliver Wagner</TD></TR>
<TR><TD><B>Art:</B></TD><TD>Web-Browser</TD><TD><B>Version:</B></TD><TD>2.88</TD></TR>
<TR><TD><B>Preis:</B></TD><TD>40 DM (per EMail) / 45 DM (per Post)</TD><TD><B>Bez.Quelle:</B></TD><TD><A HREF="http://www.vapor.com">Vapor</A></TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>2</TD><TD ALIGN=CENTER ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD  ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD  ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER><b>2</b></TD></TR>
</TABLE>

<P><HR>
<TABLE WIDTH=100%>
<TR><TD ALIGN=LEFT><A HREF="../SW/IB0697.htm"><FONT SIZE=2>Prev</FONT></A></TD>
<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../AmZ0697/main.htm">Inhaltsverzeichnis</A></FONT></TD><TD ALIGN=RIGHT><A HREF="../SW/AWB0697.htm"><FONT SIZE=2>Next</FONT></A></TD></TR>
<TR><TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de"> Der AmZeiger</FONT></A></TD></TR></TABLE>
</BODY></HTML>
