<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - GeoWorld 1.1-Update</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>GeoWorld 1.1-Update</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A>
</DIV>

<P>
<B>Wie die Zeit vergeht</B>
</P><P>
Schon einige Zeit begleiten wir die Entwicklung der Erdkunde- bzw.
Geografie-Software f&uuml;r den Amiga. Nach den Tests der <a href="../sw/9803geow.htm">Version 1.04</a> in
Ausgabe 4 (M&auml;rz 98) und des <a href="../sw/9809geo.htm">Updates auf die 1.08</a> in #6 (September 98)
werfen wir nun also einen Blick auf die Version 1.1.
</P><P>
<B>Wie kommt's?</B>
</P><P>
Das Programm wird entweder per Post auf drei Disketten, zusammen mit
einer gedruckten Anleitung, oder per E-Mail (drei DMS-Archive) inkl.
Keyfile versandt, was ein paar Mark g&uuml;nstiger kommt und zus&auml;tzlich
Porto- und Versandkosten spart. Einen ersten Eindruck kann man sich
auch mit Hilfe der im Aminet erh&auml;ltlichen Demoversion verschaffen.
</P><P>
<B>Ohne Festplatte l&auml;uft nichts</B>
</P><P>
Die Installation der Disketten (oder DMS-Archive) l&auml;uft dank des
Installers problemlos ab. Gegebenenfalls wird auch die Reqtools-Library
kopiert, die auf &uuml;blichen Systemen aber schon vorhanden sein sollte.
</P><P>
<B>Was es braucht</B>
</P><P>
Voraussetzung ist nicht nur ein Amiga ;), sondern auch OS 2.0 aufw&auml;rts,
3 MByte RAM, sowie AGA oder eine Grafikkarte.
</P><P>
<B>Souffleuse</B>
</P><P>
Die AmigaGuide-Anleitung ist sehr ausf&uuml;hrlich und geht auch auf
Hintergr&uuml;nde zur Entwicklung ein. Im Programm selbst erkl&auml;rt nach
Druck auf die Help-Taste eine Online-Hilfe die wichtigsten Funktionen
und Begriffe.
</P><P>
<B>Weltenbummler</B>
</P><P>
Nach dem Start erscheint eine Fortschrittsanzeige, die allm&auml;hlich
hochz&auml;hlt. Ein darauf folgender Einstell-Requester fordert nun die
Wahl des Bildschirmmodus und der Farbtiefe. Grafikkarten werden, wie
bei Voraussetzungen erw&auml;hnt, unterst&uuml;tzt. Allerdings traten bei mir
(Cybervision 64 und CGFX) gelegentlich merkw&uuml;rdige Farbverf&auml;lschungen
auf, die erst nach einem provozierten Refresh der Anzeige (laden einer
anderen Landkarte) wieder verschwanden.
</P><P>
Im GeoWorld-Screen erwartet den User eine gro&szlig;e farbige Weltkarte, in
der man L&auml;nder und Regionen mit der Maus ausw&auml;hlen kann, um eine
detailliertere Ansicht zu ihnen aufzurufen. Zus&auml;tzlich erscheint ein
Informationsfenster, das verschiedene Angaben enth&auml;lt, auf die ich
gleich komme.
</P><P>
<B>Navigation durchs Weltmeer</B>
</P><P>
Der untere Bildschirmrand wird von einem Kontrollfenster eingenommen,
das einen schnellen Zugriff auf h&auml;ufig ben&ouml;tigte Funktionen, wie die
Suche und die Navigationskn&ouml;pfe, bietet.
</P><P>
Diese sind leider schon auf dem Startschirm n&ouml;tig, wenn man eine
Aufl&ouml;sung kleiner 1.024x768 gew&auml;hlt hat, da die Weltkarte (gilt f&uuml;r
alle Karten) nicht skaliert, also an die Gr&ouml;&szlig;enverh&auml;ltnisse angepa&szlig;t
wird und somit ein Teil von ihr etwas &uuml;ber den sichtbaren Bereich
hinausragt. Immerhin mu&szlig; man nicht auf die Kn&ouml;pfe zur&uuml;ckgreifen, da
auch per Tastatur gescrollt werden kann.
</P><P>
<B>Wissensflut</B>
</P><P>
Die gebotenen Informationen sind teilweise recht ausf&uuml;hrlich, soweit
es in dem Rahmen eines solch umfassenden Programmes m&ouml;glich ist. Das
Fenster f&uuml;r L&auml;nder beispielsweise, zeigt u.a. Landessprache, die Fl&auml;che,
die meistverbreiteten Religionen, Einwohner insgesamt und pro
Quadratkilometer, sowie W&auml;hrung und Bruttosozialprodukt an. &Uuml;ber ein
Cycle-Men&uuml; kann man sich weitere Daten anzeigen lassen, z.B. n&auml;heres
zu Bev&ouml;lkerung, Natur, Wirtschaft oder Politik. Es ist einiges zu
entdecken.
</P><P>
Hier und da gibt es sicher noch L&uuml;cken in den Eintr&auml;gen oder kleinere
Ungereimheiten, z.B. soll EG f&uuml;r Europ&auml;ische Gemeinschaft<B>en</B> stehen.
Die Autoren ackern aber st&auml;ndig, um Verbesserungen und Erg&auml;nzungen
einzubringen und haben schon jetzt eine beeindruckende Menge
Wissenswertes zusammengetragen. So sind &uuml;ber 190 L&auml;nder verzeichnet,
&uuml;ber 6.000 gr&ouml;&szlig;ere St&auml;dte (und n&auml;here Informationen zu ihnen), sowie
mehr als 200 Landkarten k&ouml;nnen angezeigt werden.
</P><P>
Etwas &auml;rgerlich ist die Tatsache, da&szlig; man nicht erkennen kann, ob die
Unterpunkte, die &uuml;ber das Cycle-Men&uuml; erreichbar sind, weitere Daten
enthalten. So werden viele Klicks umsonst gemacht, wenn sich
herausstellt, da&szlig; dem nicht so war.
</P><P>
<B>Bunte Bilder</B>
</P><P>
Alle Grafiken sind selbst erstellt, so da&szlig; sich f&uuml;r die Autoren dadurch
keine rechtlichen Probleme ergeben. Die Karten sind zweckm&auml;&szlig;ig und
enthalten kaum keine feineren Strukturen. Das ist aber f&uuml;r zuk&uuml;nfige
Versionen geplant. Die gerade angezeigten Landkarten lassen sich als
IFF-Bilder abspeichern. Ein Einsatz spezieller Sreenshot-Programme
entf&auml;llt somit.
</P><P>
<B>Mehrwert</B>
</P><P>
Sehr gelungen ist die neue Maxi-Suche, die den gesamten Datenbestand
&auml;u&szlig;erst flott nach bestimmten Vorgaben durchforstet. Au&szlig;erdem ist der
W&auml;hrungsrechner eine klevere Idee, der das einfache Umrechnen von
Geldbetr&auml;gen aus einer von unglaublich vielen W&auml;hrungen in eine
beliebige andere, m&ouml;glich macht.
</P><P>
Eine sehr gute Abrundung stellt das Quiz dar, in dem nach dem Multiple
Choice-Prinzip Fragen zur Geografie gestellt werden, z.B. welche von
drei genannten St&auml;dten die meisten Einwohner hat, usw.. Eine Highscore-
Liste darf da nat&uuml;rlich nicht fehlen.
</P><P>
<B>Insgesamt</B>
</P><P>
GeoWorld entwickelt sich allm&auml;hlich zu einem leistungsf&auml;higen Erdkunde-
Programm. Gerade f&uuml;r Sch&uuml;ler kann es recht n&uuml;tzlich sein, aber auch
an der Welt Interessierte werden hier so einiges erfahren. Kleinere
technische Probleme und Neckigkeiten in der Bedienung tr&uuml;ben das
Gesamtbild noch ein wenig - im Vergleich zu den Vorg&auml;ngerversionen
ist aber bereits eine Menge bewegt worden. Den Negativpunkten stehen
au&szlig;erdem zus&auml;tzlich eine sehr aktive Weiterentwicklung und kostenlose
Updates entgegen.
</P><P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>GeoWorld</TD>
    <TD><B>Hersteller:</B></TD>
    <TD>BEER Productions</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>geogr. Datenbank</TD>
    <TD><B>Version:</B></TD>
    <TD>1.1</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>29,90 DM zzgl.Vers.¹</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD><A HREF="http://www.freiepresse.de/home/jubee">Homepage</a></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>2</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE></P>

<P>
¹) Der Preis bei E-Mail-Versand betr&auml;gt 24,90 ohne zus&auml;tzliche
   Versandkosten.
</P><P>
Adresse : André &amp; Ronny Beer, Siedlung 6, 09548 Deutscheinsiedel<br>
Internet: <A HREF="http://www.freiepresse.de/home/jubee">http://www.freiepresse.de/home/jubee</A><br>
E-Mail  : <a href="mailto:j.beer@abo.freiepresse.de">j.beer@abo.freiepresse.de</a>
</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../amz1299/iv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../sw/9912ib.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
