<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - IBrowse 2.1</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>IBrowse 2.1</H1>von<BR><A HREF="mailto:uridium@t-online.de">Peter Fischer</A>
</DIV><P>
<B>Vorwort</B>
</P><P>
Auf der Messe &quot;World of Amiga&quot; im Juli 1999 wurde es endlich vorgestellt:
IBrowse 2. Allerdings war die neue Version des beliebten Internet-Browsers
so sehr mit Fehlern behaftet, da&szlig; eine &ouml;ffentliche Demoversion nie
erschien. Seit Anfang September ist nun IBrowse 2.1 im Handel erh&auml;ltlich.
</P><P>
<B>Keine Demoversion?</B>
</P><P>
Die <B>Schwierigkeiten</B> beginnen schon, wenn man lediglich die Demoversion
beziehen will, da dies eigentlich nur m&ouml;glich ist, wenn man eine
Bestellung aufgibt (dazu gleich mehr).
</P><P>
Der K&auml;ufer soll praktisch &quot;die Katze im Sack kaufen&quot;, ohne vorher einen
Blick auf das Programm zu werfen. Ein direkter Link zur Demoversion ist
auf der Hisoft-Homepage nicht vorhanden.
</P><P>
Findige Leute fanden aber dann doch eine Bezugsquelle:
<A HREF="http://www.ibrowse2.freeserve.co.uk/periwinkle.lha">http://www.ibrowse2.freeserve.co.uk/periwinkle.lha</A>
</P><P>
Allerdings l&auml;&szlig;t die Qualit&auml;t der Demoversion doch arg zu w&uuml;nschen &uuml;brig,
so da&szlig; die Haltung von Hisoft etwas verst&auml;ndlicher wird. ;-(
</P><P>
<B>Bestellung</B>
</P><P>
Hier gilt es weitere Klippen zu umschiffen.
</P><P>
Auf der Homepage von <A HREF="http://www.hisoft.co.uk/">Hisoft</a> besteht die
M&ouml;glichkeit, ein Update einer 1.xx-Version oder die Vollversion zu
ordern. Allerdings ist die Bestellung  nur m&ouml;glich, wenn man Besitzer
einer <B>Kreditkarte</B> ist!
</P><P>
W&auml;hrend die Vollversion auch bei deutschen H&auml;ndlern erh&auml;ltlich ist, sind
Updates <B>ausschlie&szlig;lich</B> &uuml;ber die Homepage von Hisoft (also lediglich per
Kreditkarte) m&ouml;glich. Hier stellt sich mir die Frage, ob Hisoft wirklich
davon ausgeht, da&szlig; jeder Amiga-User so bonit&auml;r ist und eine solche
besitzt.
</P><P>
Zirka zwei Wochen nach der Erstver&ouml;ffentlichung lockerte Hisoft die
Zahlungsmodalit&auml;ten etwas (vermutlich nach gen&uuml;gend Anfragen von Usern)
und es werden nun auch Euro-Checks f&uuml;r das Updaten akzeptiert, die
allerdings direkt zur Firma nach England gesandt werden m&uuml;ssen.
</P><P>
Nachdem ich schlie&szlig;lich im Besitz der Demoversion war, wurde mir
best&auml;tigt, da&szlig; ich das Keyfile f&uuml;r die Vollversion zwei Tage sp&auml;ter
per eMail erhalten w&uuml;rde. Leider wartete ich vergebens und erst ein
erneuter Besuch der Hisoft-Homepage offenbarte mir pl&ouml;tzlich, da&szlig; man
dort auch das Keyfile extra abfordern mu&szlig;.
</P><P>
Ich gehe jetzt davon aus, da&szlig; ich die Orginalverpackung noch per Post
erhalte.
</P><P>
</P><P>
Nun aber endlich zur Vorstellung der IBrowse 2.1-Vollversion:
</P><P>
<B>Systemvoraussetzungen</B>
</P><P>
Wie schon die vorherigen Versionen, setzt IBrowse MUI f&uuml;r die
Oberfl&auml;chendarstellung und einen AmiTCP-kompatiblen Stack, wie z.B.
&quot;Miami&quot;, als Online-Zugangssoftware voraus.
</P><P>
Hardwareseitig wird ein 68020-Prozessor, 3 MB Speicher und eine Festplatte
ben&ouml;tigt.
</P><P>
<B>Installation</B>
</P><P>
Diese geht mittels des beigef&uuml;gten Installerskripts schnell und bequem
vonstatten und bereitet keinerlei Probleme.
</P><P>
<B>Was kann IBrowse? Was ist neu?</B>
</P><P>
Nachdem IBrowse 2.1 das erste Mal gestartet wurde, stellt man <B>optisch</B>
fast keinerlei Unterschiede gegen&uuml;ber den Vorg&auml;ngerversionen fest. Sobald
aber die Menues aktiviert werden, bemerkt man doch eine ganze Menge neu
hinzugekommener Funktionen. Vor dem ersten Ausflug in das World Wide Web
sollten diese aber erstmal konfiguriert werden.
</P><P>
Besitzer einer &auml;lteren Version k&ouml;nnen die <B>Preferences</B> &uuml;bernehmen und
sie als &quot;Default-Setting&quot; setzen. Leider wird IB 2.1 ohne eine deutsche
Lokalisation geliefert, was das Konfigurieren zum Teil etwas erschwert.
Die Einstellungen bieten schier unersch&ouml;pfliche M&ouml;glichkeiten und
machen es m&ouml;glich, das Programm komplett auf die eigenen Bed&uuml;rfnisse
zuzuschneiden.
</P><P>
Hierf&uuml;r ein gro&szlig;es Lob an IBrowse, ebenso f&uuml;r die komfortable <B>Bedienung</B>,
die z.B. auch Drag &amp; Drop-Aktionen unterst&uuml;tzt und die wichtigsten
Funktionen schnell per Tastendruck nutzbar macht. Erw&auml;hnenswert ist auch
die elegante Bookmark-Verwaltung, die eine Gruppenunterteilung der
wichtigsten Links bietet.
</P><P>
Das <B>Handbuch</B>, das man auch im Online-Angebot herunterladen kann,
ist englischsprachig und besteht aus einigen HTML-Zusatzseiten zur
Version 1.xx.
</P><P>
IBrowse 2.1 unterst&uuml;tzt nun auch <B>HTML 4.0</B>-Befehle, Java-Script (dazu komme
ich sp&auml;ter noch) und eine <B>Pa&szlig;wort-Verwaltung</B> - sehr n&uuml;tzlich, denn es gibt
immer mehr Seiten im WWW, die eine User- und Pa&szlig;wort-Eingabe ben&ouml;tigen.
Diese Eingaben k&ouml;nnen nun vollkommen automatisch vom Passwort-Manager
&uuml;bernommen werden, wof&uuml;r allerdings die jeweiligen Seiten-Cookis vorher
gesichert werden m&uuml;ssen, was ja nicht bei jedem Nutzer Wohlgefallen
ausl&ouml;st.
</P><P>
Eine weitere willkommene Neuerung von IBrowse 2.1, ist die Verwendung von
'<B>http-resume</B>'. Diese Funktion erm&ouml;glicht es, unterbrochene Datentransfers
sp&auml;ter wieder fortzusetzen. Von den mir bekannten Amiga-Browsern ist es
IBrowse als erstem m&ouml;glich, einzelnen Internet-Seiten eigene Schriftarten
zuzuweisen.
</P><P>
Keine Neuerung, aber dennoch einer Erw&auml;hnung wert, ist, da&szlig; <B>ARexx</B>-
Programme unterst&uuml;tzt werden.
</P><P>
<B>Der t&auml;gliche Betrieb</B>
</P><P>
Nachdem IBrowse auf meinen 68040-Amiga online ging, f&auml;llt die Optimierung
der <B>Lademodule</B> auf, die einen rasanten Text- und Grafikaufbau garantieren.
Das wird durch interne Grafikanzeiger erreicht, es k&ouml;nnen aber alternativ
auch Datatypes genutzt werden. Zur Zeit gibt es wohl keinen schnelleren
Amiga-Browser.
</P><P>
Der Hersteller Omnipresence versprach im Vorfeld der Ver&ouml;ffentlichung <B>PPC</B>-
optimierte Lademodule. Sie sind aber leider in der aktuellen Version nicht
dabei und ein Hinweis auf ihr Erscheinen ist nirgends zu entnehmen.
</P><P>
In der aktuellen Version vermisse ich die deutsche <B>Lokalisation</B>. Zwar
sind die englischsprachen Befehle von IBrowse auch f&uuml;r den nur m&auml;&szlig;ig
Englischkundigen leicht verst&auml;ndlich, aber bei Tastaturk&uuml;rzeln bestehen
diverse Unterschiede zwischen der deutschen und englischen Version,
die anfangs zu Verwechslungen f&uuml;hren. Zum Beispiel ist in der deutschen
Vorg&auml;ngerversion der Buchstabe 'B' dem Befehl 'Bilder laden' zugewiesen,
in der englischen Version dieses Tests jedoch dem Befehl &quot;Back&quot; (=eine
Seite zur&uuml;ck).
</P><P>
<B>Nun dazu, wie IB 2.1 mit Java-Skripten umgeht:</B>
</P><P>
IB unterst&uuml;tzt den Standard 'Java-Skript ECMA-262' (jetzt ISO-16262).
Ich habe mehrere Tests in dieser Hinsicht durchgef&uuml;hrt und ca. 80
Prozent der Skripte funktionierten erfreulicherweise einwandfrei.
Trotzdem empfiehlt es sich f&uuml;r Online-Sitzungen Java-Skript zu
deaktivieren und nur anzuwenden, wenn eine Seite explizit Java
verlangt.
</P><P>
Der Grund hierf&uuml;r ist: des &ouml;fteren wird durch die Integration von
Java-Skripten ein zweites Fenster ge&ouml;ffnet, das fast immer mit Werbung
des jeweiligen Seitenproviders gef&uuml;llt ist. Das ist allerdings kein
Fehler von IBrowse, sondern zur&uuml;ckzuf&uuml;hren auf den Mi&szlig;brauch von
Java-Skripten.
</P><P>
Bei manchen Frameseiten, die Java beinhalten, kommt es zu Endlosscheifen
im Seitenaufbau, was zum einen mehr als l&auml;stig ist, und zum anderen den
Browser fr&uuml;her oder sp&auml;ter zum Absturz zwingt. Hier ist eine
Beispielseite: <A HREF="http://www.sportline.de/nfv/">http://www.sportline.de/nfv/</A>
</P><P>
<B>Einige Probleme</B>
</P><P>
Nun sind wir auch schon mitten beim Thema der Instabilit&auml;t und Fehler
von IB, die die Eingangs genannten und &auml;u&szlig;erst beeindruckenden
F&auml;higkeiten dieses Browsers mit einen Schlag ins Wanken bringen.
</P><P>
IB 2.1 ist zur Zeit extrem instabil.  Zu h&auml;ufig erscheinen Fehlerrequester
ohne ersichtliche Gr&uuml;nde, die dann IB 2.1 zum Absturz bwingen und gleich
das ganze System aufh&auml;ngen. Es gibt auch einige Seiten im WWW, bei deren
Aufruf IBrowse umgehend abst&uuml;rzt. Als Beispiel hierf&uuml;r sei nur folgende
Adresse genannt: <A HREF="http://www.psxcover.de">http://www.psxcover.de</A>
</P><P>
An und wann kommt es auch zu Fehlern in der Darstellung der Bilder, aber
ein nochmaliges Laden zeigt sie dann korrekt an.
</P><P>
Ein weiterer Fehler l&auml;&szlig;t sich jederzeit reproduzieren, indem man dem
Cache-Browser ein nicht existentes Verzeichnis zuweist. Dies quittiert
IB 2.1 erst mit einer Menge von Fehlermeldungen, dann werden die Cache-
Daten (ohne Nachfrage) auf der Workbench gesichert. Gleichzeitig
wird mit dem Fehler &quot;Workbench hat einen Pr&uuml;fsummenfehler auf Block -1&quot;
(!) abgebrochen. Danach darf man dann seine Workbench aufr&auml;umen/reparieren!
</P><P>
<B>Fazit</B>
</P><P>
Die ersten Versionen von IBrowse fielen durch v&ouml;llige Instabilit&auml;t auf.
Seit Erscheinen der Version 1.22 dachte man, das w&uuml;rde der Vergangenheit
angeh&ouml;ren. Leider bringt die 'Verj&uuml;ngung' auf die Version 2.1 auch wieder
die anf&auml;nglichen Kinderkrankheiten mit sich und l&auml;&szlig;t ein kontinuerliches
Websurfen nicht zu, so da&szlig; man doch gezwungen ist, auf die Version 1.22
zur&uuml;ckzugreifen.
</P><P>
Negativ sind die bem&auml;ngelten Bestell- bzw. Update-M&ouml;glichkeiten und
Zweifel kommen mir auch hinsichtlich des offenbar ungen&uuml;genden Betatestens
des Programmes. E-Mails meinerseits mit Hinweisen auf bestehende M&auml;ngel
blieben vom IBrowse-Supportteam unbeantwortet, w&auml;hrend eine Nachfrage zur
Bestellung des Programms an einem Sonntag innerhalb von 20 Minuten
pers&ouml;nlich beantwortet wurde.
</P><P>
Um es zusammenzufassen: IBrowse 2.1 bietet einen wirklich faszinierenden
Funktionsumfang, der im Moment alle Amiga-Browser-Konkurrenten weit hinter
sich l&auml;&szlig;t und eine Entwicklung zu einem ausgereiften Top-Browser m&ouml;glich
machen k&ouml;nnte.
</P><P>
Die im Text aufgef&uuml;hrten und sehr h&auml;ufig auftretenden gravieren M&auml;ngel
f&uuml;hren aber zu einem bitteren Punkteabzug und machen IB zur Zeit leider
nicht empfehlenswert.
</P><P>
Sobald Updates zur Beseitung der Fehler erscheinen, werde ich es Sie hier
im AmZeiger wissen lassen.
</P><P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>IBrowse 2</TD>
    <TD><B>Hersteller:</B></TD>
    <TD>Hisoft / Omnipr.</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Web-Browser</TD>
    <TD><B>Version:</B></TD>
    <TD>2.1</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>ca. 99,- DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Hisoft+Fachh.(¹)</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>4</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note3.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>3</TD></TR>
</TABLE></P>

<P>
(¹) - Im Fachhandel ist nur der Bezug der Vollversion m&ouml;glich.
</P><P>
Internet : <A HREF="http://www.hisoft.co.uk/">http://www.hisoft.co.uk/</A><br>
E-Mail   : <a href="mailto:ibrowse-support@hisoft.co.uk">ibrowse-support@hisoft.co.uk</a>
</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../sw/9912geo.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../sw/9912phot.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
