<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - Photogenics</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>Photogenics 4.2</H1>von<BR><A HREF="mailto:T.Heinrich@amzeiger.de">Thomas Heinrich</A>
</DIV><P>
<B>Tradition</B>
</P><P>
Photogenics ist ein vergleichsweise altes Bildbearbeitungsprogramm
f&uuml;r den Amiga und von Anfang an bekannt f&uuml;r seine einmalige
Bearbeitungsphilosophie, das &quot;Malen&quot; mit Effekten. Und gleicherma&szlig;en
auch f&uuml;r seine Absturzfreudigkeit. Nach diversen OEM-Versionen z.B.
f&uuml;r die Cybervision64 oder das Magic-Paket von Amiga unter Escom's
Leitung, liegt jetzt die brandneue Version 4.2 von Paul Nolan vor.
</P><P>
<B>Version</B>
</P><P>
Gekauft habe ich die Version 4.0, auch auf der Verpackung, die aus
einer Weichkunststoffh&uuml;lle und einem &quot;Registrierungszettel&quot; besteht,
steht 4.0, es ist aber tats&auml;chlich die Version 4.1 auf der kaum
gef&uuml;llten CD. Gerade mal 12 MB sind auf der cyanfarbenen Disk belegt
(von Oberland selbstgebrannt, oder rechnet Paul Nolan mit so wenig
Nachfrage, da&szlig; er selbst brennt?). 5 MB davon sind ein LhA-Archiv des
CD-Inhalts, 7 MB die Schublade Photogenics. Eine etwas gr&ouml;&szlig;ere
Bildgalerie w&auml;re w&uuml;nschenswert gewesen oder eine mehrsprachige
Dokumentation, um den Platz besser zu f&uuml;llen.
</P><P>
<B>Ortswechsel</B>
</P><P>
Photogenics l&auml;&szlig;t sich problemlos von der CD starten. Nur werden dann auch
die Voreinstellungen auf CD geschrieben und da bleibt es nat&uuml;rlich bei
dem Versuch - au&szlig;er man benutzt einen Patch f&uuml;r CDs, der Schreibzugriffe
auf die Festplatte umleitet.
</P><P>
Zur Installation liest man im Installationshinweis: Einfach die Schublade
nehmen und an einen genehmen Ort auf der Festplatte ziehen. Einfach,
praktisch und schmerzlos - sofern noch 7 MB auf der Platte frei sind.
</P><P>
Unn&ouml;tigerweise kopiert man so auch noch die Demoversionen von IBrowse und
AWeb mit, die f&uuml;r die Onlinehilfe ben&ouml;tigt werden. Jeder andere Browser
funktioniert aber auch, so da&szlig; man die Schublade &quot;Browsers&quot; im Photogenics-
Verzeichnis l&ouml;schen kann und beispielsweise eine schon vorhandene
Vollversion von AWeb als Hilfe-Browser benutzen kann.
</P><P>
<B>Help?</B>
</P><P>
Die Hilfe ist komplett in deutsch, die auf der Homepage erh&auml;ltlichen
Updates dazu jedoch durchweg Englisch. Kommt ein neuer Effekt hinzu und
man installiert das Anleitungsupdate, sind alle Texte pl&ouml;tzlich englisch.
Schade, denn in der sehr detaillierten Beschreibung finden sich auch
n&uuml;tzliche Tricks und Hinweise zum Erzielen besonderer Bildeffekte.
</P><P>
Gut gelungen ist das Tutorial. Leider wird hier nur der Fire-Effekt
beschrieben, aber man erh&auml;lt einen guten Einblick, wie simpel ein netter
Effekt erzeugt werden kann.
</P><P>
Die Version 4.2 hat au&szlig;erdem endlich ToolTips, jene kleinen
Hilfezettelchen, die bei MUI BubbleHelp hei&szlig;en.
</P><P>
<B>Hardwareanforderungen</B>
</P><P>
Besondere Anforderungen stellt Photogenics an die Hardware. OS 3.0 mit
MC68020 und 8 MB RAM sind die Mindestanforderungen, aber auch mit der
empfohlenen Konfiguration (MC68060, 16 MB, Grafikkarte) sind manche
Effekte noch kriechend langsam. Das w&auml;re akzeptabel, wenn wenigstens
eine Verlaufsanzeige erscheinen w&uuml;rde, aber die gibt es nur beim Laden
oder Speichern von Bildern.
</P><P>
Vorsichtig sein sollte man auch mit der Anzahl der Undo-Schritte.
Leichtsinnigerweise dachte ich, f&uuml;nf w&auml;re ganz gut, aber schon mit einem
(allerdings ziemlich gro&szlig;en) geladenen Bild schrumpfte der freie Speicher
von 60 MB auf 7 MB RAM...
</P><P>
<B>Handling</B>
</P><P>
Zum Undo ist zu sagen, da&szlig; es zuerst wie bei allen Photogenicsversionen
abl&auml;uft. Solange man den &quot;Fix&quot;-Knopf nicht bet&auml;tigt, werden die aktuellen
&Auml;nderungen nicht ber&uuml;cksichtigt. Eine R&uuml;cknahme ist so immer m&ouml;glich. Aber
auch die bereits fixierten &Auml;nderungen k&ouml;nnen jetzt durch ein komfortables
Undo-Redo-Men&uuml; zur&uuml;ckgenommen werden. Leider nicht beim Symmetrie-Werkzeug,
aber man hofft ja auf Updates.
</P><P>
Die neuesten Versionen (4.1 und 4.2) habe ich gleich von der Photogenics-
Homepage gezogen, denn die Ausschnittsfunktion veranla&szlig;te meinen Amiga zu
einem kommentarlosen Neustart, wenn ein Schnittbereich au&szlig;erhalb des
angezeigten Bildes lag. Nach dem problemlosen Update auf 4.1, das auch
eine Sicherung der alten Version anlegt, war der Defekt behoben. Auf jeden
Fall war das alte Photogenics-Feeling durch den Absturz wieder voll da.
Auf manche Sachen kann man sich eben verlassen.
</P><P>
Insgesamt konnte ich jedoch nur zwei Abst&uuml;rze und einen H&auml;nger verbuchen,
bei dem ich mir nicht sicher bin, ob es nicht doch eher ein langsamer
Effekt war... Vorsicht ist jedenfalls mit den Fonts geboten, wenn Sie
ein Bild mit Text verzieren wollen. Bei mir war dieser Effekt mit am
beh&auml;bigsten. Um &uuml;berhaupt Text zu sehen, m&uuml;ssen Sie bei gew&auml;hltem Text-
Werkzeug ein Rechteck ziehen, in das Sie den Text eingeben k&ouml;nnen. Es
gen&uuml;gt nicht, einfach in das Bild zu klicken, wie das alle anderen
Programme erlauben.
</P><P>
Daf&uuml;r ist das Bearbeiten von Bildern wirklich intuitiv. Mit einem Werkzeug
(Airbrush, Schwamm, Bleistift, ...) kann man einen Effekt ganz gezielt und
freih&auml;ndig auf bestimmte Bildteile anwenden. Bei anderen Programmen m&uuml;&szlig;te
man erst aufwendig eine Maske erstellen, den Effekt anwenden, zur&uuml;cknehmen,
&auml;ndern, wieder neu probieren. Bei Photogenics sieht man die Auswirkungen
direkt und kann sogar in Echtzeit mit den Effekteinstellungen spielen.
</P><P>
<B>Aussicht</B>
</P><P>
Das Layout der Arbeitsfl&auml;che ist &uuml;bersichtlich aufgebaut. Eine Leiste am
oberen Rand enth&auml;lt oft gebrauchte Funktionen und Effekte, am linken Rand
befindet sich ein Multifunktionsfenster f&uuml;r Bilder, Masken, Werkzeuge und
deren Optionen, sowie den Bilddateiformaten. Hakelig zu bedienen erscheint
mir die Zoom-Funktion, mit der ich am Anfang nur schrittweise in den
gew&uuml;nschten Ausschnitt &quot;hineineiern&quot; konnte. Statt wie &uuml;blich ein Rechteck
zu ziehen, legt man den Zielpunkt fest und zoomt mittels Mausbewegung
hinein oder hinaus. Unterl&auml;&szlig;t man die Mausbewegung, zentriert sich der
angeklickte Punkt, wodurch man recht angenehm durch das Bild wandern kann.
Pr&auml;dikat: &quot;gew&ouml;hnungsbed&uuml;rftig&quot;.
</P><P>
<B>Inventar</B>
</P><P>
Alle Effekte aufzuz&auml;hlen ist langweilig - viel interessanter ist das, was
fehlt. Zur Foto-Nachbearbeitung vermi&szlig;te ich unter 4.1 schmerzlich eine
Gamma-Korrektur, 4.2 hat diese bereits. Zum Erzeugen von Webgrafiken fehlt
das GIF-Bildformat. GIF und TIFF fallen unter das LZW-Patent von Unisys
und sind (noch) nicht f&uuml;r Photogenics erh&auml;ltlich. So ist man dann doch
wieder auf Grafikkonverter oder andere Bearbeitungsprogramme angewiesen,
nur weil ein kleines, aber ben&ouml;tigtes Detail fehlt.
</P><P>
Ein nettes Detail dagegen, ist die absolut r&uuml;ckstandsfreie (De-)
Installation. Keine Assigns in der User-Startup, keine ENV-Variablen,
alle (und das sind sehr viele) Einstellungsdateien im ASCII-Format
werden gel&ouml;scht.
</P><P>
<B>Fazit</B>
</P><P>
Photogenics kann von allen Grafikprogrammen etwas, aber leider nicht alles.
Trotzdem habe ich noch kein Programm gesehen, mit dem sich so intuitiv
arbeiten l&auml;&szlig;t und dabei so professionelle Resultate zu erzielen sind. Wenn
nur die Abst&uuml;rze nicht w&auml;ren. Das kurz vor Redaktionsschlu&szlig; erh&auml;ltliche
Update auf Version 4.2 funktionierte bei mir leider nur mit dem englischen
Sprachenkatalog (data/lingua/Photogenics.etf). Das Backup, das dabei von
der Version 4.1 angelegt wurde, war aber noch voll lauff&auml;hig.
</P><P>
Fehlen noch eine aktuelle, deutsche Anleitung, etwas mehr Stabilit&auml;t und
Photogenics w&auml;re f&uuml;r den Augenblick das perfekte Bildbearbeitungs- und
Malprogramm.
</P><P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Photogenics</TD>
    <TD><B>Hersteller:</B></TD>
    <TD>Paul Nolan Ltd.</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Bildbearbeitung</TD>
    <TD><B>Version:</B></TD>
    <TD>4.2</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>169 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Oberland Computer</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>2</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE></P>

<P>
Adresse : Paul Nolan Limited, 37 Somervell Road,
          South Harrow, Middlesex, HA2 8TY, England<br>
Internet: <A HREF="http://www.PaulNolan.com">http://www.PaulNolan.com</A><br>
E-Mail  : <a href="mailto:pnolan@cix.co.uk">pnolan@cix.co.uk</a>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../sw/9912ib.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../sw/9912tzer.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
