<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - Superfrog</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>Superfrog</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A>
</DIV>

<P>
<B>1993</B>: Superfrog ist da, ein Spiel von &quot;Team17&quot;, ausgeliefert auf drei
      Disketten!
</P><P>
<B>1994</B>: Superfrog ist da, ein Spiel von &quot;Team17&quot;, nun erh&auml;ltlich als
      CD32-Version!
</P><P>
<B>1999</B>: Superfrog ist da ... WAS? Schon wieder???
</P><P>
Ja wirklich!
</P><P>
Die Software-Firma &quot;Islona Entertainment&quot; kaufte sich die Rechte von
&quot;Team17&quot; und gestaltete eine Neuauflage des Jump'n'Run-Spiels als CD-
Version, welche durch &quot;Epic Marketing&quot; vertrieben wird.
</P><P>
Bevor ich n&auml;her auf das Spiel eingehe, beschreibe ich allen, die
&quot;Superfrog&quot; bereits kennen, was sich gegen&uuml;ber der CD32-Version
ge&auml;ndert hat:
</P><P>
Eigentlich fast gar nichts!
</P><P>
Das Spiel wurde wirklich zu 100 Prozent &uuml;bernommen (gl&uuml;cklicherweise! ;-),
die Unterschiede bestehen eigentlich nur darin, da&szlig; sich nun im Inlay der
CD-H&uuml;lle eine gedruckte Anleitung befindet und sich selbige nun auch als
ASCII-Datei nebst den Levelcodes und einem &quot;Assign CD&quot;-Skript auf der CD
verewigt findet.
</P><P>
<B>Systemvoraussetzungen</B>
</P><P>
Da &quot;Superfrog&quot; bereits 1994 erschien, sind die Vorausetzungen an die
Hardware dementsprechend moderat:
</P><P>
Ein AGA-Amiga mit 2 MB RAM, OS 3.x und ein CD-ROM-Laufwerk reichen
vollkommen aus, um den Superfrosch h&uuml;pfen zu lassen.
</P><P>
<B>Installation</B>
</P><P>
Diese ist nicht vorgesehen und auch nicht notwendig, da das Spiel
komplett von der CD aus spielbar ist.
</P><P>
<B>Das Spiel</B>
</P><P>
Alle Leser, die es noch nicht kennen, bitte ich nun, weiterzulesen.
Alle Leser, die es kennen aber auch. ;-)
</P><P>
Nach dem Starten des Programms, erwartet uns zuerst ein knapp
dreimin&uuml;tiges Intro des begnadeten Animationsk&uuml;nstlers Erik Schwartz.
Diese Intro, welches die altbekannte Geschichte &quot;Hexe entf&uuml;hrt die
Prinzessin, der Held macht sich auf zur Rettung&quot; ist aufgrund seines
fr&ouml;hlichen Humors eine der ganz wenigen, die man sich des &ouml;fteren
anschauen kann!
</P><P>
Danach wartet ein kleines Optionsmen&uuml;, in dem man zwischen zwei
Schwierigkeitsgraden (&quot;Easy&quot; und &quot;Hard&quot;) sowie der Anzahl der
Froschleben (3, 5 oder 7) w&auml;hlen kann.
</P><P>
Dann auf &quot;Start&quot; gedr&uuml;ckt, landet Superfrog in der ersten der insgesamt
f&uuml;nf Welten, welche sehr abwechsungsreich ausgefallen sind:
</P><P>
Wald-, Schlo&szlig;-, Pyramiden-, Zirkus- und Eiswelt. Zus&auml;tzlich gibt es noch
einen Extralevel, der das Pendant zum Team17-Spiel &quot;Project X&quot; ist. Hier
k&auml;mpft sich anstelle eines Raumschiffes der Held des Spiel durch das
Weltall!
</P><P>
Jede Welt ist nochmal in jeweils vier Unterlevel aufgegliedert, die zum
Teil sehr gro&szlig; und umfangreich ausgefallen sind.
</P><P>
Man erkennt am Spiel deutlich, da&szlig; es sich teilweise sehr an dem Spiel
&quot;Sonic&quot; orientiert hat, welches zu jener Zeit (Anfang der 90er) das
Vorzeigespiel des Genres war.
</P><P>
Mit etwas Anlauf l&auml;uft Superfrog genausoschnell wie sein stacheliges
Igelvorbild &quot;Sonic&quot; durch die Gegend. Die Grafiken sind wirklich sehr
gelungen und liebevoll gezeichnet. Viele detaillierte Animationen, wie
zum Beispiel B&auml;ume, deren Augen die Spielfigur verfolgen, peppen das
Spiel auf und sorgen f&uuml;r viel Spa&szlig;.
</P><P>
Die Gegner, die der jeweiligen Welt angepa&szlig;t sind (z.B. Bienen, Geister
oder Pharaonen) sind ebenso knuffelig, aber mit Vorsicht zu genie&szlig;en, da
ein jeder Kontakt mit Ihnen ein wenig Lebensenergie kostet. Fallen, wie
Abgr&uuml;nde, t&uuml;ckische Eisfl&auml;chen, Feuerspucker und die stetig ablaufende
Spielzeit, erschweren ebenfalls die Rettungsaktion.
</P><P>
Anf&auml;nglich kann sich Superfrog nur mit einen Sprung auf die K&ouml;pfe der
Gegner zur Wehr setzen, sp&auml;ter finden sich im Spiel Extras wie z.B.
&quot;Spud&quot;, ein gr&uuml;ner Ball der wie ein Boomerang zu Superfrog zur&uuml;ckfliegt
und vorher die Gegner au&szlig;er Gefecht setzt. Wenn Superfrog Fl&uuml;gel findet,
so dienen diese als Propeller und er kann mit ihnen vorher hohe und nicht
erreichbare Plattformen ansteuern.
</P><P>
Alle Level verbergen geheime Wege, die man h&auml;ufig nur durch Zufall endeckt.
Hier sollte man wirklich versuchen jeden Winkel der Levels zu erkunden, um
alle Goldst&uuml;ckchen zu sammeln, deren Komplettierung dann den Levelausgang
&ouml;ffnet.
</P><P>
Das einzige Manko an Superfrog ist, da&szlig; manche Level doch ein wenig zu
gro&szlig; geraten sind und da&szlig; dadurch vielleicht Erm&uuml;dungserscheinungen beim
Spieler auftreten k&ouml;nnten.
</P><P>
Die Spielst&auml;nde lassen sich nicht abspeichern, stattdessen erm&ouml;glicht die
Eingabe von Levelcodes das (Weiter-)Spielen in sp&auml;teren Welten.
</P><P>
Wie schon die gelungene Grafik ist auch der Sound und die Hintergrundmusik
von sehr hoher Qualit&auml;t und passen hervorragend zum Spielgeschehen.
</P><P>
Die exakte Steuerung ist ebenfalls vorbildlich und l&auml;&szlig;t auch den
unerfahrenen Spieler zumindestens erst einmal das dritte Level erreichen.
</P><P>
Ein weiteres Schmankerl des Spiels erreicht man jeweils nach Absolvierung
eines Levels, denn nun bekommt der Spieler die M&ouml;glichkeit, seine
erreichten Punkte bei einem &quot;einarmigen Banditen&quot; zu erh&ouml;hen oder
dort Levelcodes zu ergattern.
</P><P>
Dieses Spiel erinnert ungemein an einen Zeichentrickfilm, ist deswegen
auch ideal f&uuml;r Kinder oder auch Ihre Freundin, womit sie den Vorwurf
&quot;Warum sitzt Du immer vor dem Computer?&quot; charmant entkr&auml;ftigen k&ouml;nnen!
</P><P>
Das Spiel l&auml;uft im allgemeinen stabil, dennoch sollten Sie darauf achten,
eventuell im Hintergrund laufende Workbench-Programme zu schlie&szlig;en, da
diese zum Teil Komplikationen herbeif&uuml;hren k&ouml;nnen, wie z.B. das &quot;Aufh&auml;ngen&quot;
des Spiels w&auml;hrend der n&auml;chste Level geladen wird.
</P><P>
<B>Fazit:</B>
</P><P>
Auch sechs Jahre nach der Erstver&ouml;ffentlichung hat Superfrog nichts von
seinem Charme und seiner Qualit&auml;t verloren, so da&szlig; ich ich dieses Spiel
allen bedingungslos empfehlen kann, die es noch nicht besitzen.
</P><P>
Durch die erstklassige Steuerung und das gelungene Gameplay k&ouml;nnen
Spieler, die noch kaum mit dem Genre Jump'n'Run vertraut sind, hier
einen attraktiven Einstieg finden.
</P><P>
Der einzige Kritikpunkt besteht eigentlich in der Preisgestaltung, denn
49,- DM f&uuml;r ein &quot;recyceltes&quot; Spiel zu verlangen, finde ich doch ein wenig
happig. Hier sollte sich der K&auml;ufer vorher doch mal auf dem Amiga-Software-
Gebrauchtmarkt umsehen, denn hier habe ich die CD32-Version bereits f&uuml;r
10,- DM gesehen.
</P><P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Superfrog</TD>
    <TD><B>Hersteller:</B></TD>
    <TD>Islona / Epic</TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Jump'n'Run</TD>
    <TD><B>Version:</B></TD>
    <TD>1999</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>49,00 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Festplattenspielbar?</B></TD><TD COLSPAN=2 ALIGN=CENTER>NEIN</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Exit zur Workbench?</B></TD><TD COLSPAN=2 ALIGN=CENTER>NEIN</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Grafik:</B></TD><TD ALIGN=CENTER>1</TD><TD ALIGN="CENTER" ROWSPAN=6><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>SoundFX:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Musik:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Spielbarkeit:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Spielspa&szlig;:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE></P>
<P>
E-Mail: <a href="mailto:epic@swol.de">epic@swol.de</a><br>
Web   : <A HREF="http://www.epicmarketing.ltd.net">http://www.epicmarketing.ltd.net</A>
</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../sw/9912wast.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../pd/9912box.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
