<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - T-Zer0</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>T-Zer0</H1>von<BR><A HREF="mailto:uridium@t-online.de">Peter Fischer</A>
</DIV>
<P>
<B>1988-1994:</B>
</P><P>
Ende der 80er Jahre wurde der Amiga mit einer Reihe von vertikal
scrollenden Shoot'em'up-Spielen begl&uuml;ckt, von denen noch heute viele
nichts von ihrer Klasse verloren haben. Als Beispiel hierf&uuml;r seien
nur &quot;Katakis&quot;, &quot;R-Type&quot; und sp&auml;ter dann &quot;Project X&quot; und &quot;Disposable
Hero&quot; genannt!
</P><P>
<B>1997:</B>
</P><P>
Im Sommer 1997 kam ein beeindruckendes Rolling-Demo namens &quot;Trauma Zero&quot;
in die Szene, das von einer italienischen Gruppe programmiert wurde.
Nachdem etwas sp&auml;ter ein weiteres Demo erschien, h&ouml;rte man lange Zeit
nichts mehr von diesem Projekt, so da&szlig; man bef&uuml;rchten mu&szlig;te, es sei
eingestellt. Doch gl&uuml;cklicherweise kam es anders...
</P><P>
<B>1999:</B>
</P><P>
clickBOOM, bekannt durch &quot;Capital Punishment&quot;, &quot;Myst&quot;, &quot;Quake&quot; und
&quot;Napalm&quot;, ver&ouml;ffentlicht dieses Spiel unter seinem Label mit dem Namen
&quot;T-Zero&quot; und will laut eigener Aussage &quot;Das Jahrtausend mit dem
explosivsten Shoot'em'up, das je jemand auf dem Amiga sah, beschlie&szlig;en&quot;.
</P><P>
Ob dieses Versprechen eingel&ouml;st wurde, verr&auml;t Ihnen nun dieser Test.
</P><P>
<B>Voraussetzungen</B>
</P><P>
Es wird ein AGA-Amiga mit CD-Laufwerk, 68030-Prozessor und 8 MB RAM
ben&ouml;tigt um T-Zer0 spielen zu k&ouml;nnen. Im Gegensatz zu &quot;Napalm&quot; sind
dies ja minimale Voraussetzungen f&uuml;r ein Spiel von clickBOOM, allerdings
sei hier die mangelnde Grafikkartenunterst&uuml;tzung nicht unerw&auml;hnt!
</P><P>
<B>Inhalt</B>
</P><P>
Das Spiel wird auf einer CD ausgeliefert und diese ist mit 255 MB Daten
gut gef&uuml;llt. Neben dem Hauptspiel gibt es noch ca. 200 MB an Animationen,
einen Editor zum Erstellen eigener Level, das Programm &quot;Custom_TZer0&quot;,
mit dem man die eigenen Levels spielen kann und das Erstlingsspiel
von clickBOOM &quot;Capital Punishment&quot;.
</P><P>
Dieses Spiel ist allerdings durch einen Kopierschutz blockiert, aber f&uuml;r
nur umgerechnet 11,- DM kann man das Handbuch - indem die Kopierschutz-
Codes aufgef&uuml;hrt sind - bei clickBOOM abfordern.
</P><P>
Der CD liegt neben der Registrationskarte ein 20-seitiges Handbuch in
englischer Sprache bei, das ausf&uuml;hrlich die Bedienung des Spiels erkl&auml;rt.
</P><P>
Die Registration - welche auch online m&ouml;glich ist - sollte man unbedingt
vornehmen, da man ansonsten keine Unterst&uuml;tzung (z.B. den Bezug von
Updates) von Seiten clickBOOMs erh&auml;lt.
</P><P>
Des weiteren befinden sich noch 13 Audio-St&uuml;cke im Techno-Stil auf der
CD, die gelungen sind und bestens zum Spiel passen.
</P><P>
<B>Installation</B>
</P><P>
T-Zero l&auml;&szlig;t sich komplett von CD spielen, was allerdings kein Abspeichern
der High-Scores, Einstellungen und Spielst&auml;nde zul&auml;&szlig;t. Aus diesem Grunde
sollte man doch eine Installation vornehmen, welche bequem per Installer
m&ouml;glich ist, der einem f&uuml;nf verschiedenen M&ouml;glichkeiten anbietet - vom
ausschlie&szlig;lichen Abspeichern der Einstellungen bis zur Komplett-
Installation (255 MB Daten).
</P><P>
Zum Genu&szlig; der Audio-St&uuml;cke mu&szlig; logischerweise die CD im Laufwerk
verbleiben. Hierbei gibt es Komplikationen mit dem CD-Filesystem
&quot;IDEfix&quot;. Hierf&uuml;r bietet clickBOOM allerdings einen Patch auf der
Homepage an.
</P><P>
<B>Start</B>
</P><P>
Der mi&szlig;lingt meist beim allerersten Mal, denn T-Zero fordert ca. 1,9 MB
freien Chip-Ram! Da dieser wohl bei den meisten Usern nicht frei ist,
mu&szlig; man z.B. die Farbanzahl der Workbench drastisch reduzieren oder aber
das Spiel im Boot-Men&uuml; via CLI starten.
</P><P>
Hat man diese Klippe &uuml;berwunden, so erscheint das Titelbild und eine
erste Animation, die sich im gehobenen Qualit&auml;tsstandard befindet.
</P><P>
Danach folgt das Hauptmen&uuml;, welches mit Konfigurationsm&ouml;glichkeiten
aufwartet, die f&uuml;r ein Spiel dieser Art noch nie dagewesen sind.
Allerdings sind meines Erachtens die meisten davon nur schmuckes
Beiwerk, wie z.B. die Transparenz-Farbdarstellung.
</P><P>
Dieses erm&ouml;glicht die farbliche Ver&auml;nderung (Blau, Gelb, Violett usw.)
der Explosionen!
</P><P>
Wichtiger sind aber folgende Einstellungsm&ouml;glichkeiten:
</P><P>
<ul>
<li>Story/Arcarde Mode: Die Story-Mode ist hier eindeutig zu bevorzugen,
  denn hier werden einem alle Level geboten (in denen man auch bestimmte
  Aufgaben erf&uuml;llen mu&szlig;), w&auml;hrend der Arcarde-Mode nur eine reduzierte
  Levelanzahl bietet.</li>
<li>1/2 Players: Sch&ouml;n, denn neben dem Einzelspiel kann man hier auch
  simultan einen 2. Spieler einbinden.</li>
<li>Difficulty Easy/Hard: Der Schwierigkeitsgrad im Spiel &auml;ndert sich nicht,
  der Unterschied ist, da&szlig; man im &quot;Easy&quot;-Level die erworbenen Extra-Waffen
  nicht verliert und daf&uuml;r aber die High-Scores nicht gespeichert werden.</li>
</ul>

Weiterhin gibt es noch Einstellungen zum automatischen Dauerfeuer, der
Sensibilit&auml;t der Steuerung, Animationsfilme zwischen den Levels - Ja/Nein,
Anzeige der Hintergrund-Animationen (eine Reduzierung ist bei 68030-
Prozessoren anzuraten, damit der Spielablauf nicht zu stockend wird)
und weitere zu t&auml;tigen.
</P><P>
Sobald alles eingestellt ist, geht es endlich zum Spiel, zwischendurch
wird man noch vor die Wahl gestellt, welches der drei angebotenen
Raumschiffe man nehmen m&ouml;chte, die sich durch unterschiedliche Waffen
und Geschwindigkeiten unterscheiden.
</P><P>
Im ersten Level geht es durch ein &quot;bio-mechanisches&quot; Gel&auml;nde und hier
wird die Gelegenheit geboten, sich an das Spiel langsam zu gew&ouml;hnen, da
die Gegnerzahl sich noch einigerma&szlig;en in Grenzen h&auml;lt. Jedes Level besteht
aus insgesamt vier Abschnitten, von denen man drei immer durchfliegt:
</P><P>
Der Eingangsabschnitt, auf den danach entweder Route A (wenn weniger als
vier verschiedenfarbige Edelsteine im Spiel gesammelt wurden) oder Route
B folgt (bei vier oder f&uuml;nf Edelsteinen). Danach kommt der obligatorische
Endgegner.
</P><P>
Die Grafik ist &auml;u&szlig;erst detailliert und mit grandiosen Hintergrund-
Animationen versehen, allerdings geht mein Prozessor (68040) bei der
besten Grafik ein wenig in die Knie, sobald ein erh&ouml;htes Spriteaufkommen
auf dem Bildschirm f&uuml;r Action sorgt. Sobald mal kein Gegner in Sicht ist
(was selten vorkommt), fliegt das Raumschiff gleich ein ganz sch&ouml;nes
St&uuml;ck schneller.
</P><P>
Dies ist zum Teil etwas irritierend und stellt trotz der feinen Technik
des Spiels ein kleines Manko dar.
</P><P>
Der Sound ist dem Spielgeschehen angepa&szlig;t und besteht demzufolge
haupts&auml;chtlich aus Explosionsger&auml;uschen.
</P><P>
Zur&uuml;ck zum Spiel: Die Steuerung wei&szlig; zu &uuml;berzeugen und das ist auch
notwendig, denn schnell kommt es zu un&uuml;bersichtlichen Situationen, wenn
man auf einmal einer Vielzahl von Gegnern gegen&uuml;bersteht. Ganz besonders
zu beachten sind hier kleine &quot;Walker&quot;, die Mini-Home-Missiles auf einen
schiessen, welche aufgrund ihrer Winzigkeit schwer zu erkennen sind. Neben
den normalen Gegnern, gilt es auch immer den Boden und die Decke im Auge
zu behalten, denn eine Ber&uuml;hrung mit diesen kostet gleich ein Heldenleben.
</P><P>
Das ganze Spiel hat einen hohen Schwierigkeitsgrad, so da&szlig; es nur mit
100prozentiger Konzentration zu bew&auml;ltigen ist. Die Endgegner sind, ganz
in der Tradition der klassischen Shoot'em'ups, sehr harte Gegner, aber
ein jeder von ihnen ist mit einer bestimmten Taktik, welche es
herauszufinden gilt, zu besiegen.
</P><P>
<B>M&auml;ngel</B>
</P><P>
Trotz der technischen Finessen und des motivierenden Schwierigkeitsgrades
gibt es einige M&auml;ngel zu erw&auml;hnen, wovon der gr&ouml;&szlig;te im grafischen
Leveldesign liegt.
</P><P>
Alle f&uuml;nf Welten sind optisch sehr &auml;hnlich. Hier h&auml;tte ich mir mehr
Abwechselungen gew&uuml;nscht, ein Musterbeispiel ist z.B. &quot;Project X&quot;, dessen
Spielgeschehen im Weltraum, in Wasser, in Lava und in einer Eisw&uuml;ste
stattfindet. Ein kleines Bonusspiel, wie z.B. ein &quot;Fast-Speed-Tunnel&quot;
zum Aufsammeln von Extras (ebenfalls &quot;Project X&quot;) h&auml;tte T-Zer0 ebenfalls
sehr gut zu Gesicht gestanden.
</P><P>
Und nach l&auml;ngerem &Uuml;berlegungen stellte ich endlich fest, was T-Zer0 auch
noch fehlt:
</P><P>
Das &ouml;fter schon erw&auml;hnte Spiel &quot;Project X&quot; oder auch der Klassiker
&quot;Uridium 2&quot; erzeugten oft einen derma&szlig;en Spannungsmoment, da&szlig; ich beim
Spielen des &ouml;fteren schwei&szlig;nasse H&auml;nden bekam. Diesen Adrenalinkick konnte
ich bei T-Zer0 leider nicht in dieser Art feststellen.
</P><P>
<B>Und sonst</B>
</P><P>
Leider l&auml;uft T-Zer0 nicht im Multitasking, was sich zum Beispiel negativ
bemerkmar macht, wenn bei der R&uuml;ckkehr zur Workbench auff&auml;llt, da&szlig; sich
die Systemuhr w&auml;hrend des Programmbetriebs deaktiviert hatte.
</P><P>
Das Programm ist relativ stabil, allerdings kam es w&auml;hrend des Level-
Ladens &ouml;fter zum Einfrieren des Spiel, wenn vorher ein TCP-IP-Stack in
Betrieb war.
</P><P>
Einen kurzen Blick habe ich noch auf den Leveleditor geworfen, indem man
die Hintergrundgrafiken der ersten vier Welten laden und die Gegner per
Cut'n'Paste einbauen kann. Die so kreierten eigenen Level lassen sich dann
mit dem Programm &quot;Custom_TZer0&quot; austesten. Leider verweigerte dieses
Programm an und wann beim den Betrieb.
</P><P>
<B>Fazit</B>
</P><P>
T-Zer0 ist ein Spiel, das man wirklich alles Fans des Genres empfehlen
kann. Aber eine Spielerevolution ist clickBOOM mit T-Zer0 entgegen ihrem
Versprechen nicht gelungen, die abwechslungsreicheren Klassiker &quot;R-Type&quot;
und &quot;Project X&quot; sind trotz Ihres Alters immer noch ein wenig besser.
</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>T-Zer0</TD>
    <TD><B>Hersteller:</B></TD>
    <TD>clickBOOM</TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Shoot'em'up</TD>
    <TD><B>Version:</B></TD>
    <TD>1.0</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>ca. 89,00 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Festplattenspielbar?</B></TD><TD COLSPAN=2 ALIGN=CENTER>JA</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Exit zur Workbench?</B></TD><TD COLSPAN=2 ALIGN=CENTER>JA</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Grafik:</B></TD><TD ALIGN=CENTER>2</TD><TD ALIGN="CENTER" ROWSPAN=6><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>SoundFX:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Musik:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Spielbarkeit:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Spielspa&szlig;:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE></P>

<P>
Web   : <A HREF="http://www.clickboom.com/">http://www.clickboom.com/</A><br>
E-Mail: <a href="mailto:info@clickboom.com">info@clickboom.com</a>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../sw/9912phot.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../sw/9912wast.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
