<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - Wasted Dreams</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>Wasted Dreams</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A>
</DIV>

<BR><TABLE BGCOLOR="#DADADA" ALIGN="CENTER" BORDER="1">
<TR><TD>
Das nachfolgend getestete Produkt wurde uns freundlicherweise von
der Firma <a href="../amz1299/ferstad.htm">&quot;Ferst Computer&quot;</a>, K&ouml;penicker Stra&szlig;e 11, 15537 Gosen,
(<A HREF="http://www.ferst.de">http://www.ferst.de</A>/<A HREF="mailto:ferst@t-online.de">ferst@t-online.de</A>) leihweise zur Verf&uuml;gung gestellt.
 <a href="../amz1299/ferstad.htm">&lt;Information&gt;</a>
</TD></TR></TABLE>

<P>
<B>Die Wartezeit</B>
</P><P>
Nach einer langen Zeit des Wartens, w&auml;hrend der der urspr&uuml;ngliche Publisher
(Vulcan) sich inzwischen vom Amiga zur&uuml;ckgezogen hat, das Spiel um- und
wieder zur&uuml;ckbenannt wurde und unz&auml;hligen Verschiebungen, ist es nun
endlich so weit: 'Wasted Dreams' wird im AmZeiger vorgestellt!
</P><P>
<B>Die CD</B>
</P><P>
<B>Digital Dreams</B> erstes Werk wird auf einer CD-ROM ausgeliefert, deren
H&uuml;llen-Design mit einem gerenderten Raumgleiter auf dem Cover durchaus
das Auge erfreut. Der Text auf der R&uuml;ckseite hebt sich vor dem Motiv
mehrerer Explosionen kaum ab und ist so schwer erkennbar. Das gilt auch
f&uuml;r die darunter abgebildeten Screenshots, die etwas zu dunkel geraten
sind, aber sowieso nur Szenen aus der Intro zeigen. Im kleinen Booklet
steckt eine englische Kurzanleitung.
</P><P>
<B>Die Intro</B>
</P><P>
Mit der beginnt dann nat&uuml;rlich das Spiel. Der Vorspann ist einige Minuten
lang und zeigt, in einer f&uuml;r Amiga-Verh&auml;ltnisse ungew&ouml;hnlich hohen Qualit&auml;t,
wie alles begann. Die vollst&auml;ndig gerenderten Animationen kommentiert
dabei der (Haupt-)Protagonist Johanson in deutlichem Englisch.
</P><P>
<B>Die Story</B>
</P><P>
Die Erde ist im Jahre 2057 von &Uuml;berbev&ouml;lkerung und einer hohen
Verbrechensrate geplagt. Expeditionen ins All, die neue besiedlungsf&auml;hige
Welten entdecken sollen, k&ouml;nnten Abhilfe schaffen. Die 'ExplorerFX 2',
mit ihrer 500 Mann starken Besatzung zieht aus, um... Jedenfalls wird
tats&auml;chlich ein geeigneter Planet entdeckt, der gute Lebensbedingungen
bietet: 'Agillera'.
</P><P>
Sechs Monate lang hat die Besatzung mit der Errichtung und dem Ausbau
eines Basis-Camps zugebracht und bisher keinerlei Spuren von fremdem
intelligenten Leben ausgemacht. Es wird beschlossen, die Erde von der
Entdeckung zu unterrichten, was einen R&uuml;ckflug notwendig macht. Ein
F&uuml;nftel der Besatzung meldet sich daf&uuml;r freiwillig. Johanson und
sein Kumpel Harper, sie geh&ouml;ren zu den Sicherheitsleuten, sind dabei.
</P><P>
Doch kurz nach dem Start geht die 'ExplorerFX' in einem Feuerball auf.
Die beiden Freunde konnten sich noch im letzten Moment mit einem Flucht-
Shuttle retten und machen irgendwo auf Agillera eine Bruchlandung.
</P><P>
<B>Die Voraussetzungen und die Installation</B>
</P><P>
Voraussetzung ist der ECS-Chipsatz. F&uuml;r Grafikkarten ist ein Patch
geplant. Eine Installation ist nicht n&ouml;tig (und auch nicht m&ouml;glich).
</P><P>
<B>Die Optionen</B>
</P><P>
Zwei Spieler k&ouml;nnen 'Wasted Dreams' gleichzeitig angehen. Wenn man den
Ein-Spieler-Modus ausw&auml;hlt, hat es Harper schon bei der Landung zerledert
und Johanson mu&szlig; sich alleine durch des fremden Planeten wilde Weiten
schlagen.
</P><P>
Mit der Escape-Taste wird ein Men&uuml; aufgerufen, von dem aus die Sprache
(eine von 16 verschiedenen) eingestellt werden kann. Hier sind auch die
Credits anzeigbar und Spielst&auml;nde k&ouml;nnen geladen oder gespeichert werden.
Bei 'Steuerung' ist w&auml;hlbar, welcher Spieler welches Eingabeger&auml;t
verwendet.
</P><P>
Der letzte offene Punkt, neben der Spiel-Beendigung, sind die 'Optionen'.
Spielerzahl, ein oder zwei Spieler, PAL oder NTSC und einige weitere
Einstellungen sind hier einstellbar.
</P><P>
<B>Die Spielperspektive</B>
</P><P>
Die Helden sieht man als kleine Figuren, die man auf dem Planeten
herumf&uuml;hren kann. &Uuml;ber mehrere Bildschirme wird gescrollt, an manchen
Stellen verl&auml;&szlig;t man den einen und betritt einen anderen.
</P><P>
Am unteren Rand der Spielgrafik sind die <B>Statusanzeigen</B> der beiden
oder gegebenenfalls des einen Protagonisten zu sehen. Ein Balken
zeigt die Lebensenergie, ein weiterer darunter die Waffenkapazit&auml;t an.
Rechts von beiden zeigen Animationen in einem icongro&szlig;en Feld derzeit
m&ouml;gliche Aktionen der Helden an - ausgenommen das Schie&szlig;en, welches,
nach Aufnahme der Waffe an der Absturzstelle, immer m&ouml;glich ist.
</P><P>
Ein blinkerndes Auge zeigt z.B. an, da&szlig; eine Stelle oder ein Gegenstand
genauer betrachtet werden kann; eine Hand, die einen Gegenstand greift,
l&auml;&szlig;t Johanson oder Harper den Gegenstand aufnehmen; ein sich &ouml;ffnender
Mund zeigt die M&ouml;glichkeit von Gesp&auml;chen an, usw..
</P><P>
Unter den Balken und dem Aktionsfeld erscheint die Inventarliste, in der
man mit der sogenannten &quot;Rucksack-Taste&quot;, das ist bei Johanson die linke
Alt- oder Amiga-Taste, und gleichzeitiger Bet&auml;tigung von Links oder Rechts
auch herumscrollen kann.
</P><P>
<B>Die Action</B>
</P><P>
Dann geht es auch schon los. Johanson, dessen Partner Harper es im
Einspieler-Modus schon an der Absturzstelle erwischt hat, untersucht
das Shuttle-Wrack und findet, dank der aktiven Mithilfe des steuernden
Spielers, bald ein paar n&uuml;tzliche Gegenst&auml;nde. Vor allem die Laserpistole
wird er schon bald ben&ouml;tigen, denn in unmittelbarer N&auml;he treiben sich, den
fr&uuml;heren Forschungsergebnissen zum Hohn, zahlreiche Au&szlig;erirdische herum
- viele von ihnen noch dazu sind ausgesprochen schie&szlig;w&uuml;tig.
</P><P>
Von einem verletzten Alien bekommt Johanson, nachdem er ihn mit einem
Medi-Pack verarztet hat, ein paar wichtige Hinweise und ein Werkzeug.
Nun schl&auml;gt er sich weiter durch, betritt H&ouml;hlen, &uuml;berquert schwimmend
einen Flu&szlig;, l&ouml;st zahlreiche knifflige R&auml;tsel, unterh&auml;lt sich mit ein
paar Au&szlig;erirdischen und einigen Menschen, die er trifft (offenbar
kollaborieren viele mit den Au&szlig;erirdischen und sind vielleicht sogar
in die &quot;Havarie&quot; der ExplorerFX verwickelt? - das wird aber noch nicht
verraten! ;). Und nicht zuletzt ist er auch gezwungen, zu <B>ballern,
was das Zeug h&auml;lt</B>.
</P><P>
Nur verlieren kann auf Dauer derjenige, der sich jedem Kampf stellt.
Einigen Konflikten kann man aus dem Weg gehen, wenn man schleunigst das
Weite sucht, da die Au&szlig;erirdischen oftmals mit Beeren- oder Erzsammeln
besch&auml;ftigt sind.
</P><P>
H&auml;ufig sind K&auml;mpfe allerdings nicht zu vermeiden. Ein warnender Summton
zeigt an, da&szlig; auf Johanson gezielt wird. Mit einem kleinen Fadenkreuz,
das man ungef&auml;hr in die Richtung des Gegners bringen mu&szlig;, erkennt man die
von der Waffe ins Visier genommene Stelle. Wichtig ist es auch, auf den
Munitionsvorrat zu achten. Einige get&ouml;tete Au&szlig;erirdische lassen Magazine
fallen, die man aufsammeln sollte. Auch vor automatischen Fallen oder
Energiew&auml;nden gilt es, sich in acht zu nehmen.
</P><P>
<B>Die Grafik</B>
</P><P>
...ist sehr gelungen. Die Animationen der Figuren sind aufwendig, z.B.
ber&uuml;hrt Johanson mit den F&uuml;&szlig;en erst vorsichtig die Wasseroberfl&auml;che,
bevor er dann richtig eintaucht, um zu schwimmen.
</P><P>
Das Wasser bewegt sich an den Ufern, ein kleiner Bach pl&auml;tschert als
Wasserfall &uuml;ber Felsen und m&uuml;ndet dann in den Flu&szlig;. Auf automatischen
Laufb&auml;ndern werden Erze verarbeitet, geheimnisvolle Geb&auml;ude und Maschinen
sind auf dem Gel&auml;nde verteilt. Ein Mechaniker werkelt sogar emsig an
coolen Weltraum-Kampfgleitern - am Boden versteht sich.
</P><P>
Das zur Verdeutlichung einiger liebevoller Details. Da die Figuren nur
fingerkuppengro&szlig; sind, darf man nat&uuml;rlich keine Gesichtsmimik erwarten.
F&uuml;r das Genre und die HighRes-Aufl&ouml;sung wurde aber das Optimale
herausgeholt.
</P><P>
<B>Die Kl&auml;nge</B>
</P><P>
...sind gut. In der N&auml;he des Flu&szlig;es h&ouml;rt man das Wasser rauschen, am
kleinen Wasserfall gurgelt es. Au&szlig;erirdische h&auml;mmern lautstark auf der
Suche nach Erz, gewarnt kann man vorsichtig die Stelle umgehen. Im
Hintergrund zwitschern derweil V&ouml;gel.
</P><P>
Musik gibt es dagegen kaum. Im Vorspann hier und da etwas unaufdringliche
und auch an manchen speziellen Stellen im Spiel ert&ouml;nen sph&auml;rische Kl&auml;nge.
</P><P>
<B>Der Clou</B> sind mit Sicherheit die gesprochenen S&auml;tze. 'Johanson' spricht
in sehr deutlichem Englisch und noch dazu gut betont - also nicht laienhaft
lahm, wie auf dem Amiga auch schon geh&ouml;rt. Au&szlig;erirdische haben einen
effektvollen Zusatzklang in ihrer Stimme. Gl&uuml;cklicherweise sprechen sie
aber auch Englisch, das zumindest dem Deutschen eher verwandt ist, als
Agilleranisch (vermutlich ;).
</P><P>
Gespr&auml;che laufen allerdings nach einem vorgegebenen Schema ab, der
Verlauf kann h&ouml;chstens durch die &Uuml;bergabe von Gegenst&auml;nden beeinflu&szlig;t
werden.
</P><P>
<B>Die &Uuml;bersetzung</B>
</P><P>
Gleichzeitig wird das Gesprochene auch gut lesbar eingeblendet. Die Amiga
Translation Organization (A.T.O.) hat, wie j&uuml;ngst sogar f&uuml;r das Amiga-OS
3.5, f&uuml;r die &Uuml;bersetzung gesorgt.
</P><P>
Die Qualit&auml;t der deutschen Version ist ausgesprochen gut.
</P><P>
<B>Die Anleitung</B>
</P><P>
Neben der (englischen) Kurzanleitung im Booklet, finden sich auf der CD
auch komplette Anleitungen in zahlreichen Sprachen als Text-Dateien.
</P><P>
Die Hintergrund-Story ist hier noch einmal nachlesbar. Au&szlig;erdem werden
die Steuer-M&ouml;glichkeiten und alles weitere n&ouml;tige erkl&auml;rt.
</P><P>
Nicht sch&ouml;n, aber f&uuml;r den Zweck ausreichend.
</P><P>
<B>Die Idee</B>
</P><P>
Waffenhaltung der Helden und auch einige andere Elemente des Spiels,
erinnern an &quot;Flashback&quot;. Grafisch (mal abgesehen vom Stil) und vom
Zwei-Spieler-Modus her, gibt es aber auch viele Ber&uuml;hrungspunkte mit
&quot;The Chaos Engine&quot;.
</P><P>
Auch &quot;Alien Breed - Tower Assault&quot; stand in gewisser Weise Pate f&uuml;r
'Wasted Dreams', da dort gelungen das reine Ballerspiel mit einer sich
nebenher entwickelnden Hintergrund-Story verbunden wurde (ein Ansatz,
den Team17 sp&auml;ter bei den Alien Breed 3D-Varianten unverst&auml;ndlicherweise
nicht mehr weiterverfolgte).
</P><P>
W&auml;hrend bei &quot;Flashback&quot; das Puzzle- und Geschicklichkeitselement stark
betont war, bei &quot;Chaos Engine&quot; die Action das Ma&szlig; aller Dinge darstellte
und f&uuml;r &quot;Tower Assault&quot; der Adventure-Teil nur nettes Beiwerk war, so
bietet 'Wasted Dreams' eine gelungene, attraktive Mischung irgendwo
dazwischen. Auch hier k&ouml;nnen zwei Spieler sich gleichzeitig durch
die feindliche Umwelt k&auml;mpfen und m&uuml;ssen z.B. darauf achten, wer das
dringend ben&ouml;tigte, eben von einem Gegner fallengelassene, Waffenmagazin
n&ouml;tiger braucht.
</P><P>
'Wasted Dreams' ist ein echtes Adventure UND ein echtes Ballerspiel.
</P><P>
<B>Die Zusammenfassung</B>
</P><P>
Ein Amiga-Spiel in dieser Qualit&auml;t ist mir schon lange nicht mehr
untergekommen. 'Wasted Dreams' kann man problemlos in einem Atemzug
mit den erw&auml;hnten Hits nennen. Das Gute ist: dieses Spiel ist kein
Plagiat, sondern etwas Neues!
</P><P>
Spielprinzip, Steuerung, Story, Grafik und Sound - alles wirkt
gelungen und gut abgestimmt. Das bringt dann auch echte Spielfreude.
</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Wasted Dreams</TD>
    <TD><B>Hersteller:</B></TD>
    <TD>Digital Dreams</TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Action Adventure</TD>
    <TD><B>Version:</B></TD>
    <TD>-</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>79,- DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Festplattenspielbar?</B></TD><TD COLSPAN=2 ALIGN=CENTER>NEIN</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Exit zur Workbench?</B></TD><TD COLSPAN=2 ALIGN=CENTER>JA</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Grafik:</B></TD><TD ALIGN=CENTER>1</TD><TD ALIGN="CENTER" ROWSPAN=6><IMG SRC="../images/note1.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>SoundFX:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Musik:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Spielbarkeit:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Spielspa&szlig;:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>1</TD></TR>
</TABLE></P>

<P>
Digital Dreams Entertainment<br>
E-Mail: <a href="mailto:contact@dd-ent.com">contact@dd-ent.com</a>
</P><P>
c/o<br>
Chris Seward, 10 Scafell Close,<br>
Eastham, Merseyside,<br>
L62 9EU, England
</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../sw/9912tzer.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../sw/9912frog.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
