<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Marblelous 2</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Marblelous 2</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Marblelous 2 befindet sich auf zwei DD-Disketten. Ob normalerweise eine
irgendwie geartete Verpackung dazugeh&ouml;rig ist, wei&szlig; ich nicht. Beim
Testexemplar jedenfalls stand keine zur Verf&uuml;gung.</P>

<P>Nach einem Blick auf die erste Disk ist man im ersten Moment etwas
verwundert, da sich keinerlei Dokumentation oder Installationsskript
anfindet. Aber man ahnt es schon, auf der zweiten Diskette ist beides
enthalten.</P>

<h3>Dokumentation</h3>

<P>Die Dokumentation gibt es sogar auf Englisch und Deutsch, ist man versucht
zu sagen, aber letztere enth&auml;lt lediglich ein `a` (wirklich!). Das soll
uns aber nicht weiter interessieren, vielleicht &auml;ndert sich in dieser
Hinsicht ja etwas in den, f&uuml;r den ausl&auml;ndischen Markt bestimmten
Verkaufsversionen.</P>

<P>Die Anleitung in Form eines AmigaGuides gibt die wichtigsten Hinweise zum
Spiel allgemein und zur Bedienung im Speziellen.</P>

<h3>Installation</h3>

<P>Die Installation auf Festplatte klappt dank Installer reibungslos. Neben
einer Version auch f&uuml;r die Standard-Amiga-Grafik, gibt es auch spezielle
AGA-Grafik und eine Version f&uuml;r Grafikkarten.</P>

<h3>Die Versionen</h3>

<P>Die <B>Grafikkartenversion</B> nutzt ebenfalls die 256-Farbgrafik der AGA-
Version, sollte aber mit einem 256-Zeilen-Bildschirmmodus gespielt werden,
da ansonsten pl&ouml;tzlich mehrere synchrone Marblelous-Spiele den restlichen
Platz ausf&uuml;llen, anstatt zum Beispiel einem schwarzen Rand. Je nach der
ansonsten verwendeten Aufl&ouml;sung wird das Spiel auf dem Public Screen
eventuell zu klein und macht dann so wenig Sinn.</P>

<P>Ich beziehe mich also auf die ansonsten identische <B>AGA-Version</B>. Los
geht es mit einem netten Bild mit dem Spiellogo, auf das dann das Men&uuml;
eingeblendet wird, sowie einer markig klingenden Musik im Hintergrund,
die zu einem spannenden Action-Spiel passen w&uuml;rde.</P>

<P>Das <B>Men&uuml;</B> besteht lediglich aus Start, Pa&szlig;wort-Eingabe, Highscore-Liste,
Musik An/Aus und Quit. Negativ f&auml;llt die schlechte Farbwahl des
Zeichensatzes auf, was die Lesbarkeit verringert. Zu den Eintr&auml;gen
selbst er&uuml;brigen sich zus&auml;tzliche Worte zur Funktion.</P>

<h3>Das Spiel</h3>

<P>Im Spiel selbst sieht man mehr oder weniger nur bunte Kl&ouml;tzchen in der
Draufsicht. Irgendwo auf dem Spielfeld wird eine kleine Kugel gestartet,
die sich unabl&auml;&szlig;ig in eine Richtung bewegt. Ziel des Spiels ist es,
diverse verstreute Objekte einzusammeln, damit man an einem Farbkreis
in den n&auml;chsten Level wechseln kann. Allerdings kann man die Kugel nicht
selbst steuern, sondern man setzt im Spielfeld Marken mit Richtungspfeilen
oder ein Pausezeichen. Es steht aber nur eine gewisse Zeit als Stopp zur
Verf&uuml;gung, die man an Hand eines Balkens an der rechten Bildschirmseite
verfolgen kann, wo auch ein paar andere Angaben erscheinen, z.B. wieviel
Objekte noch einzusammeln sind. Richtungsmarken kann man unbegrenzt setzen,
gelegentlich steht einem aber nur eine vorgegebene Zeit zur Verf&uuml;gung in
der man die Aufgabe l&ouml;sen mu&szlig;. Wenn die Kugel an einer Wand landet, ist
eines der `Leben` verwirkt.</P>

<P>Nat&uuml;rlich ist dies nicht alles. Energiebarrieren, `feindliche` graue
Kugeln, vorgegebene Richtungspfeile, Schalter, L&ouml;cher und auch zus&auml;tzlich
(insgesamt bis zu drei) Kugeln, die man teilweise gleichzeitig
kontrollieren mu&szlig;, machen einem auf dem Spielfeld zu schaffen.</P>

<h3>Schwierigkeitsgrad</h3>

<P>Der Schwierigkeitsgrad steigert sich allm&auml;hlich, man wird behutsam mit
neuen Elementen vertraut gemacht und kennt die Prinzipien dann im n&auml;chsten
Level. Es gibt teilweise auch reine, an Labyrinthe erinnernde Spielfelder,
in denen man sich sein Ziel suchen mu&szlig;, ohne in eine Falle zu geraten. Wenn
dies geschieht, mu&szlig; man mit Return eines seiner Leben opfern.</P>

<h3>Steuerung</h3>

<P>Die Steuerung erfolgt mit der Maus, in dem man mit der linken Maustaste
auf die gew&uuml;nschte Stelle dr&uuml;ckt und sie dann in eine Richtung bewegt
und losl&auml;&szlig;t. Gelegentlich passiert es schon, da&szlig; die Marke dann nicht
ganz exakt bzw. mit der gew&uuml;nschten Richtungsangabe gesetzt wird, aber
insgesamt kann man mit der Steuerung sicher gut leben.</P>

<h3>Grafik</h3> 

<P>Die Grafik des Spiels ist trotz der 256 Farben etwas br&ouml;selig und beim
besten Willen nicht als sch&ouml;n zu bezeichnen. Sie ist zweckm&auml;&szlig;ig und
gen&uuml;gt den Anforderungen insgesamt. St&ouml;rend f&auml;llt auf, da&szlig; sich, nach dem
man alle notwendigen Objekte aufgesammelt hat, um das Level verlassen zu
k&ouml;nnen (es m&uuml;ssen also nicht immer alle verteilten Objekte eingesammelt
werden), sich der Zielkreis in keiner Weise ver&auml;ndert, z.B. &ouml;ffnet.</P>

<P>Au&szlig;erdem k&ouml;nnen Marken auch auf Objekte oder den Zielpunkt gesetzt
werden, bzw. ist dies manchmal sogar notwendig - allerdings nicht in
W&auml;nde, was seltsamerweise auch m&ouml;glich ist. Leider kann man in diesen
F&auml;llen h&auml;ufig nicht erkennen, in welche Richtung die Marken zeigen, oder
ob dort &uuml;berhaupt Marken plaziert sind. Angesichts dessen, da&szlig; man viele
Strecken weit im voraus planen mu&szlig; und der angesprochenen leichten
Steuerungsunsicherheiten, kann dies ein Problem und manchmal auch
eine Murmel weniger nach sich ziehen.</P>

<P>Das bringt mich darauf, da&szlig; man Pa&szlig;w&ouml;rter nur in bestimmten Levels erh&auml;lt,
wenn man dort ein rotierendes `C` einsammelt.</P>

<h3>Sound</h3>

<P>Die Soundeffekte fallen nicht besonders auf und sind nur durchschnittlich.
Die passende und nicht so schnell nervende Musik, die im Hintergrund l&auml;uft,
wei&szlig;, wie auch die anderen Melodien, zu gefallen.</P>

<P>Als Bonus enthalten die Disketten auch einen Editor, mit dem man bei Bedarf
selbst Level entwerfen kann.</P>

<h3>Fazit</h3>

<P>Marblelous 2 ist f&uuml;r Liebhaber von kniffligen Denk- und
Geschicklichkeitsspielen interessant, denn beide F&auml;higkeiten werden hier
gebraucht. Wer knackige Effekte und/oder Action erwartet, wird entt&auml;uscht,
aber in seinem Bereich ist das Spiel sicher nicht schlecht. F&uuml;r Kenner
des ersten Teiles d&uuml;rfte der Nutzwert geringer sein.</P>

<P>Vom technischen Standpunkt und insbesondere der grafischen Umsetzung her,
lie&szlig;e sich sicher noch mehr herausholen, aber Editor sowie grunds&auml;tzliche
Grafikkartentauglichkeit, stellen eine gewisse Aufwertung dar. Ob dies
auch f&uuml;r den jeweiligen Spieler bzw. potentiellen K&auml;ufer zutrifft, mu&szlig;
dieser selbst einsch&auml;tzen - das wesentliche bleibt aber das Spiel selbst.
Ein Probespiel ist auf jeden Fall empfehlenswert, insbesondere, da auch
Demoversionen erh&auml;ltlich sind.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Marblelous 2</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="">APC&amp;TCP</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Knobelspiel</TD>
    <TD><B>Version:</B></TD>
    <TD>-</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>39,95 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>APC&amp;TCP</A></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Festplattenspielbar?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Exit zur Workbench?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Grafik:</TH><TD ALIGN=CENTER>3</TD><TD ALIGN=CENTER ROWSPAN=6><IMG SRC="../images/note3.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">SoundFX:</TH><TD ALIGN=CENTER>3</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Musik:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielbarkeit:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielspa&szlig;:</TH><TD ALIGN=CENTER>3</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Preis-/Leistung:</TH><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TH><TH COLSPAN=2 ALIGN=CENTER>3</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
</TABLE></P><BR>
APC&amp;TCP, Postfach 59, D-83236 &Uuml;bersee

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903cd2.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../pd/9903box.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


