<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - DEKUBI</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>DEKUBI</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>DEKUBI klang f&uuml;r mich beim ersten Mal recht mysteri&ouml;s, da ich vorher noch
nie etwas davon geh&ouml;rt hatte.</P>

<h3>Was bedeutet DEKUBI?</h3>

<P>DEKUBI steht f&uuml;r <B>Deutsche Kultur Bilder</B> und es handelt sich dabei um eine
CD im Vertrieb des APC&TCP, die eher eine multimediale Geschichtslektion
darstellen soll, als nur eine Bildersammlung, mit dem Anspruch vom
Mittelalter bis zum Zeitalter der Technik deutsche Geschichte spannend zu
vermitteln.</P>

<P>Der erste Eindruck, der durch ein gutgestaltetes Cover gewonnen wird,
tr&uuml;ben unterirdische Schreibfehler der hintenstehenden Erl&auml;uterung, die
ein schn&ouml;des Korrekturlesen eliniert h&auml;tte - vor dem Druck.</P>

<h3>Voraussetzungen</h3>

<P>An Systemvoraussetzungen werden neben dem obligatorischen CD-Rom-Laufwerk,
Amiga-OS ab 2.0, sowie 2 MByte Speicher abverlangt.</P>

<P>Zw&ouml;lf Epochen werden als Icons angeboten, plus einer Einf&uuml;hrungs- und
Endsequenz. Nachdem eines dieser Kapitel durchgelaufen ist, beginnt es
wieder von vorne und man mu&szlig; es mit Escape abbrechen und das n&auml;chste
Starten - sehr unkomfortabel, gelinde gesagt. Einen Hinweis innerhalb
des &quot;Programmes&quot; auf die Ersteller gibt es nicht - aber in einem kleinen
Readme, das &uuml;brigens mit keiner Silbe den APC&TCP erw&auml;hnt, ist zu lesen,
da&szlig; die Gebr&uuml;der J. und H. J&uuml;lich aus K&ouml;ln die Inhalte der CD erstellt
haben.</P>

<h3>Anleitung?</h3>

<P>Nur in diesem Readme ist ein kleiner Hinweis zur Bedienung zu finden,
n&auml;mlich, da&szlig; man bei ChipMem-Problemen die linke Maustaste zum wiederholten
Laden der aktuellen Seite dr&uuml;cken soll.</P>

<h3>Es geht los</h3>

<P>Der nachfolgend beschriebene Ablauf ist f&uuml;r jedes Kapitel so ziemlich
&auml;quivalent. Los geht es mit einer kleinen Animation der Autorenk&uuml;rzel,
der Anzeige der Hauptthematik &quot;Deutsches Leben in f&uuml;nf Jahrhunderten&quot;
und der jeweiligen &Uuml;berschrift, zusammen mit einer kurzen Dudeldei-
Musik aus irgendeinem C64-Spiel. Danach erscheinen diverse Seiten mit
Text auf schwarzem Grund. Der Zeichensatz ist etwas br&ouml;selig, aber daf&uuml;r
wenigstens recht gro&szlig;.</P>

<h3>Der Amiga spricht</h3>

<P>Eine Sprecherin liest den Text vor. Mit der rechten Maustaste kommt man
zur n&auml;chsten Seite (nachdem man es durch Probieren herausgefunden hat).
So geht es einige Seiten weiter. Beim Inhalt handelt es sich um eine
allgemeine Einf&uuml;hrung zur behandelten Epoche, die meist wirklich sehr
allgemein gehalten ist und h&auml;ufig nichts bietet, was man nicht schon dem
Geschichtsunterricht w&auml;hrend einer durchschnittlichen Schulbildung
entnommen h&auml;tte.</P>

<P>Nun zum Gesprochenen: Die Frau, die diese Aufgabe &uuml;bernommen hat, kann
gut lesen, spricht Hochdeutsch ;) und deutlich. Das waren die positiven
Punkte.</P>

<P>Leider sind es nicht die entscheidenden! Denn die Qualit&auml;t der Aufzeichnung
l&auml;&szlig;t sehr zu w&uuml;nschen &uuml;brig und ist generell nie als gut zu bezeichnen. Sie
ist sehr schwankend, teilweise sind die Samples verrauscht oder mit
gelegentlichen Hintergrundger&auml;uschen (Gardine wird gezogen) versetzt und
manchmal klingt es eher nach &quot;Geschichten aus der Gruft&quot;.</P>

<P>Sehr deutlich erkennbar wird daran, da&szlig; auch im selben Kapitel viele
Unterbrechungen w&auml;hrend der Aufnahme stattgefunden haben.</P>

<P>Das ist ein negativer Punkt. Ein zweiter w&auml;re, da&szlig; die Dame sehr, sehr
monoton spricht und damit leider eher die Wirkung einer Schlaftablette
vermittelt, statt der versprochenen Spannung. Au&szlig;erdem sind die relativ
zahlreich im Text vorkommenden 'Kirchen' beim besten Willen nicht mit
Kirschen zu verwechseln. ;)</P>

<P>Nun sind die reinen Textseiten schon recht trocken, aber die
Gesamtwirkung ist so leider motivationst&ouml;tend.</P>

<h3>Die versprochenen Bilder</h3>

<P>Nach dieser Einf&uuml;hrung erscheinen jeweils Seiten mit einer Grafik auf der
linken Bildschirmh&auml;lfte und einem, das Bild erl&auml;uternden, Text auf der
rechten Seite. Diesmal werden die Texte nicht etwa vorgelesen, damit man
sich voll auf die Bilder konzentrieren kann, sondern nur diverse Musiken
sehr unterschiedlicher Couleur, sorgen f&uuml;r klangliche Untermalung, wobei
besonders zu bem&auml;ngeln ist, da&szlig; Techno-Musik z.B. nur schlecht zum
Mittelalter pa&szlig;t.</P>

<P>Die Bilder weisen durchweg eine gute Qualit&auml;t auf. Die Motive sind
anschaulich gezeichnet, stimmig und mit 256 Farben auch farbenfroh. Ein
paar wenige und auch sehr kurze Animationen sollen auflockern. Sie
vergehen in den zw&ouml;lf Epochen aber wie Butter in der Sonne. Hier
steckt keine W&uuml;rze in der K&uuml;rze.</P>

<h3>...aber der Text?</h3>

<P>Zum Text: Die Satzkonstruktionen wirken gelegentlich etwas ungelenk, so
wie auch manche Formulierungen (&quot;Geisteshelden&quot; ?). Abenteuerlich sind
einige Schreibfehler wie &quot;Gauckler&quot; (Gaukler) oder &quot;Nahmen&quot; (Namen) -
auch hier h&auml;tte also ein Korrekturlesen geholfen.</P>

<P>Inhaltlich erscheint das Konzept unausgegoren. Die Einf&uuml;hrungen wirken
irgendwie saft- und kraftlos - undetailliert und unspektakul&auml;r, was auch
an der Pr&auml;sentation liegen mag, aber gerade diejenigen, die sich mittels
des neuen Mediums von der Faszination &uuml;berzeugen lassen wollen, die
Geschichte aus&uuml;ben kann, werden hier nicht bei der Stange gehalten und
sie sind, vom dargebotenen Inhalt her, die Hauptzielgruppe. Die Texte zu
den Bildern sind gelegentlich interessant, aber die Auswahl der Grafiken,
die einen Text nach sich ziehen, erscheint zuf&auml;llig und es entsteht so
nur ein kaleidoskophaftes Bild der Zeit. Es kommt einem vor, wie
auflockernde Abbildungen in einem Geschichtsbuch mit Untertiteln,
nur der Text, in den diese Abbildungen eingebettet sind, fehlt.</P>

<h3>Technisches</h3>

<P>Technisch ist das Ganze, wie beschrieben, nicht zu loben: die Musik ist
auch nicht auszustellen, man kommt nicht autmonatisch in die n&auml;chste
Epoche (zumindest habe ich keine Methode gefunden - eine Anleitung gibt
es ja nicht) und der Eindruck einer zusammengestoppelten Pr&auml;sentation,
mit Hilfe eines der daf&uuml;r &uuml;blichen Programmpakete erstellt, dr&auml;ngte sich
mir auf. Tats&auml;chlich wird durch die Icon-Files der Kapitel jeweils der
InfoPlayer von Scala aufgerufen und die eigentlichen Dateien enhalten
nur ein paar wenige Kommandos.</P>

<P>Daran w&auml;re nichts auszusetzen, wenn es nicht oder kaum auffallen w&uuml;rde,
denn damit sind sicherlich auch gute Pr&auml;sentationen machbar.</P>

<h3>Schade</h3>
<P>
In diesem Fall hat es leider nicht geklappt. Die M&uuml;he, die die Erstellung
zweifelsohne gekostet hat, h&auml;tte mit mehr Sorgfalt vielleicht mehr Fr&uuml;chte
tragen k&ouml;nnen, so aber ist DEKUBI f&uuml;r diesen Preis f&uuml;r niemanden
empfehlenswert. Gerade der Amiga h&auml;tte sicherlich Bedarf f&uuml;r ein
Produkt dieser Art. </P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>DEKUBI</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.chiemgau.com/apc&tcp/">APC&amp;TCP</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Edutainment-CD</TD>
    <TD><B>Version:</B></TD>
    <TD>-</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>39,95 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>APC&amp;TCP</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>5</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note6.gif" WIDTH="56" HEIGHT="82"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>5</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>6</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>6</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>6</TD></TR>
</TABLE></P>
APC&amp;TCP, Postfach 59, D-83236 &Uuml;bersee<BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903dbp.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903env3.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


