<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - The Scene Archive</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>The Scene Archive</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Die CD &quot;The Scene Archive&quot; des APC&amp;TCP enth&auml;lt eine Auswahl von Demos der
Jahre 1988 bis 1998. Das <B>Design</B> der H&uuml;lle ist diesmal sehr gut gelungen,
der englischsprachige Text auf der R&uuml;ckseite l&auml;&szlig;t erwarten, da&szlig; auch
der Inhalt Kenntnis dieser Sprache voraussetzt.</P>

<P>Dies erweist sich als richtig - die gesamte <B>Dokumentation</B> ist Englisch.
Eine &Uuml;berraschung ist aber, da&szlig; es sich bei der CD eigentlich gar nicht
um &quot;The Scene Archive&quot; handelt, sondern um eine `Best of` desselben, das
aus 7 CD`s besteht und beim Ersteller, dem Australier Tony Hasselbacher,
f&uuml;r ganze 105 US-Dollar bestellt werden kann.</P>

<P>Wichtiger Bestandteil der CD, ist der <B>Archive-Guide</B>, der, neben allgemeinen
Infos, Danksagungen und &auml;hnlichem, insbesondere ein Verzeichnis der
enthaltenen Demos birgt, geordnet nach Erscheinungsjahr, Gruppe und Name.</P>

<P>Wenn man in einer dieser Listen eine Demo angew&auml;hlt hat, erscheint eine
Seite mit Angaben zu ihr, wie dem Pfad auf der CD, dem Erscheinungsjahr
und den Spezifikationen, also unter welchen Bedingungen die Demo
lauff&auml;hig ist. Hier werden also schon wichtige Hinweise gegeben, ob
zum Beispiel unter AGA Schwierigkeiten zu erwarten sind.</P>

<P>H&auml;ufig wird auch ein Knopf angeboten, hinter dem man eine <B>Beurteilung</B>
aus dem Scene-Guide findet, der dann aufgerufen wird. Hier gibt es neben
einer Wertung, auch einen erl&auml;uternden Text, der den Inhalt und die
Effekte beschreibt.</P>

<P>Wieder zur&uuml;ck im Archive-Guide stehen auf der Demo-Seite noch die Release-
Notizen, mit denen die Demo ver&ouml;ffentlicht wurde. <B>Der Clou</B> ist, da&szlig; die
Demos per Extra-Kn&ouml;pfen auch in den meisten F&auml;llen direkt gestartet oder
entpackt (wenn es sich um DMS-Archive handelt) werden k&ouml;nnen. In letzterem
Fall kann man zwischen den unterschiedelichen Floppy-Laufwerken und der
RAD-Disk als Zeil w&auml;hlen, ansonsten werden bei angebotenen &quot;RUN&quot;-Kn&ouml;pfen
die evtl. notwendigen Befehle, wie z.B. Assigns, zwar auch im Klartext
angezeigt, aber auch mit ausgef&uuml;hrt.</P>

<P>Integriert wurden auch einige sp&auml;ter ver&ouml;ffentlichte <B>Patches</B>, mit denen
sich manche &auml;ltere Demos, die urspr&uuml;nglich nur von Diskette liefen, auch
direkt von CD starten lassen.</P>

<P>Ansonsten braucht man eigentlich nur gelegentlich direkt auf der CD
herumzusuchen, z.B. wenn mal trotzdem eine Demo nicht aus dem Guide
heraus direkt zum Laufen zu bringen ist. Der Archive-Guide &uuml;bernimmt aber
die Aufgabe, als Kommandozentrale bzw. als Browser der CD zu fungieren,
was man sich in der Qualit&auml;t vom Ansatz her von so vielen CD`s w&uuml;nschen
w&uuml;rde, und was &auml;hnlich z.B. von den Aminet-CD`s praktiziert wird.</P>

<P>Allerdings gibt es hier und da einige Fehler im Guide, die z.B. das
direkte Ausf&uuml;hren doch scheitern lassen. Viele Demos lassen sich
au&szlig;erdem nicht beenden und so ist nach dem Start erst einmal Schlu&szlig; mit
jeder Komfortabilit&auml;t und oft ein Reset notwendig, so da&szlig; man nur hoffen
kann, da&szlig; die Demo den Versuch auch wert war. Dieses Problem ist nat&uuml;rlich
nicht l&ouml;sbar.</P>

<P>Die <B>Bedienung</B> &uuml;berzeugt also insgesamt und auch der <B>Inhalt</B> kann den Demo-
Fan &uuml;berzeugen, denn sehr viele Demos, von mittelpr&auml;chtig bis sehr gut,
werden ihm geboten. Von den Klassikern wie &quot;Odyssey&quot; (Alcatraz), der
legend&auml;ren &quot;RSI Megademo&quot; (RSI) und der &quot;World of Commodore&quot;-Demo (Sanity),
bis zu originellen St&uuml;cken, wie &quot;In a World of ASCII&quot; (Impact DK), die
bekannte Demoeffekte auf ordin&auml;re ASCII-Zeichen anwendet (sehr witzig!)
oder &quot;Nexus 7&quot; (Andromeda) aus dem Jahre 94, bis hin zu den aktuelleren
des Jahres 1998 reicht die Palette.</P>

<P>Wie schon aus dem Fakt ersichtlich ist, da&szlig; die komplette Sammlung 7 CD`s
umfa&szlig;t, fehlen nat&uuml;rlich auch einige Demos und es besteht kein Anspruch
auf Vollst&auml;ndigkeit.</P>

<P><B>Positiv</B> ist also die Zusammenstellung, die Bedienung und Dokumentation.
<B>Negativ</B> f&auml;llt die rein englische Benutzerf&uuml;hrung, gelegentliche Fehler
im Browserguide und der, trotz der positiven Punkte, etwas zu hohe Preis
auf. Echte Demo-Fans werden schon viele der Perlen dieser CD besitzen,
andere aber von diesem Preis wahrscheinlich etwas abgeschreckt werden.
Daher schrammt &quot;The Scene Archive&quot; an einer guten Wertung vorbei.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>The Scene Archive</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.chiemgau.com/apc&tcp/">APC&amp;TCP</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Daten-CD</TD>
    <TD><B>Version:</B></TD>
    <TD>-</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>39,95 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>APC&amp;TCP</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD ALIGN=CENTER>3</TD><TD align=center><IMG SRC="../images/note3.gif" WIDTH="32" HEIGHT="52"></TD></TR>
</TABLE></P>
APC&amp;TCP, Postfach 59, D-83236 &Uuml;bersee<BR>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903cd.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903cd2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


