<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Games Attack</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Games Attack</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Nachdem der <B>APC&amp;TCP</B> mit seinen CD`s gleichen Namens Nummero 3 und 4 schon
Versuche der Zusammenstellung von PD-Spielsammlungen unternommen hat und
in beiden F&auml;llen verheerende Testurteile in unseren Tests erhielt, probiert
er es noch ein weiteres Mal, diesmal unter der Bezeichnung &quot;<B>Games Attack</B>&quot;.
Ein Vol.1 k&ouml;nnte weitere Fortsetzungen bedeuten.</P>

<P>Das CD-Design ist dieses Mal im Verh&auml;ltnis recht gut gelungen. Eine ganze
Menge, auch neben den eigentlichen Spielen, soll die CD enthalten <B>&quot;...und
das alles ist bereits fix und fertig installiert und wartet nur darauf von
Ihnen erkundet zu werden!&quot;</B> verspricht der Text auf der H&uuml;lle. Warten wir
es ab.</P>

<p><b>Das Hauptverzeichnis</b></p>

<P>Das CD-Icon ist zwar ganz nett `designt`, aber leider riesengro&szlig;. Im
Hauptverzeichnis erwarten einen neben einem <B>Readme-Guide</B>, der bis auf
den Covertext aber nur Danksagungen und Kontaktadressen enth&auml;lt - dies
allerdings auf Englisch und Deutsch, zwei klickbare Icons. Eine kleine
Erl&auml;uterung des Inhaltes h&auml;tte sich hier angeboten, ebenso wie die
Aufkl&auml;rung von Anf&auml;ngern &uuml;ber die Funktion der beiden Icons &quot;<B>Palette</B>&quot;
und &quot;<B>KlickMe</B>&quot;, die Farb- und Assigneinstellungen vornehmen und bei
zweiter Bet&auml;tigung auch wieder r&uuml;ckg&auml;ngig machen. Ein Blick in den
zugeh&ouml;rigen Text zu &quot;Klickme&quot; offenbart aber eine erschreckend geringe
Anzahl an vorhandenen Assigns zu Spielen, n&auml;mlich genau zw&ouml;lf werden
lediglich ber&uuml;cksichtigt. Das l&auml;&szlig;t Probleme erwarten.</P>

<p><b>Das Verzeichnis &quot;Club-Infos&quot;</b></p>

<P>F&uuml;nf Directories werden angeboten. Zum ersten &quot;Club-Infos&quot;, in dem es
lediglich ein paar Informationen und Aufnahmeformulare des APC&amp;TCP zu
bestaunen gibt.</P>

<p><b>Das Verzeichnis &quot;SuchTool&quot;</b></p>

<P>&quot;SuchTool&quot; enth&auml;lt eine lizensierte Version, des schon auf einigen anderen
APC&amp;TCP-CD`s eingesetzten CDCat, welches das Aufsp&uuml;ren von bestimmten
Programmen innerhalb der vorhandenen vorgefertigten Listen erm&ouml;glicht.
Au&szlig;er der Game Attack-Liste, werden hier die der APC-CD`s 2, 4, 5 und 6
geboten. Zur Benutzung dieses n&uuml;tzlichen Tools ist es allerdings
erforderlich zu wissen, wonach man sucht.</P>

<p><b>Das Verzeichnis &quot;Tools&quot;</b></p>

<P>Als sehr reichhaltig erweist sich &quot;Tools&quot;. Hier gibt es weitere diverse
Unterverzeichnisse. &quot;<B>Editor</B>&quot; enth&auml;lt elf verschiedene Editoren f&uuml;r
bekannte Spiele, wie Civilisation, F1 Grand Prix oder Sensible Soccer.</P>

<P>&quot;<B>HD-Install</B>&quot;: Hier sind insbesondere die Zusammenstellungen &quot;JST&quot; und
&quot;WHD&quot; bemerkenswert, die eine gro&szlig;e Anzahl verschiedener HD-Installer
zu vielen Diskettenspielen bieten.</P>

<P>&quot;<B>Hint</B>&quot;: Enth&auml;lt neben Cheatkollektionen u.a. AdventureSolutions, also
englischsprachige L&ouml;sungen f&uuml;r eine ganze Menge Adventure-Klassiker.</P>

<P>&quot;<B>Misc</B>&quot;: Die unvermeidlichen hilfreichen Degrader sind hier zu finden,
ebenso wie die Tools SnoopDos bzw. Scout, die u.a. zeigen, was auf der
Festplatte konkret abl&auml;uft.</P>

<P>&quot;<B>Patch-Update</B>&quot;: Die von vielen Firmen nach Ver&ouml;ffentlichung ihrer Spiele
nachgereichten Patches, die Fehler beheben oder zus&auml;tzliche Features
bieten, sind in diesem Verzeichnis enthalten - und zwar 30 St&uuml;ck.</P>

<P>&quot;<B>System</B>&quot;: Ein gro&szlig;er Teil der Software-Pakete, die nicht nur der Spieler
f&uuml;r ein leistungsf&auml;higes System braucht, sind hier enthalten. Dazu z&auml;hlen
das Soundsystem AHI, CyberGfx, Picasso96, MUI, AmiCDFS.</P>

<P>&quot;<B>Trainer-Cheater</B>&quot;: Weitere Trainer und Cheater f&uuml;r 21 Spiele.</P>

<p><b>Das Verzeichnis &quot;Spielst&auml;nde&quot;</b></p>

<P>Im n&auml;chsten Hauptverzeichnis &quot;Spielst&auml;nde&quot; sind dieselben f&uuml;r 23
kommerzielle Spiele enthalten, z.B. von SimCity, Frontier, Nemac
oder diversen Rollenspielen.</P>

<p><b>Das Verzeichnis &quot;Demos&quot;</b></p>

<P>Bei &quot;Demos&quot; dringen wir langsam an den Kern der CD vor. 55 verschiedene
sind hier zu finden, haupts&auml;chlich zu relativ aktuellen Spielen, manche
sind auch noch nicht erschienen und manche werden es wohl auch nie.</P>

<p><b>Das Verzeichnis &quot;PD&quot;</b></p>

<P>Das eigentliche Herz der Sammlung stellt nat&uuml;rlich &quot;PD&quot; dar. Hier ist,
im Gegensatz zu den vorherigen APC-Spielkollektionen, eine weitere
sinnvolle Unterteilung vorgenommen worden.</P>

<p><b>Hier ein &Uuml;berblick:</b></p>

<P>&quot;<B>Action</B>&quot; enth&auml;lt 30 Spiele - erw&auml;hnenswert: Deluxe Pacman, MegaBall,
Snakes. &quot;<B>Board-Card</B>&quot; enth&auml;lt 17 Brett- und Kartenspiele - erw&auml;hnenswert:
AMonopoly, ASokoban, Stratego. &quot;<B>Jump`n`Run</B>&quot; enth&auml;lt 20 Spiele -
erw&auml;hnenswert: Boderunner, JetSetWilly, Werner. &quot;Role-Adventure&quot;
enth&auml;lt 20 Spiele - erw&auml;hnenswert: ChildMurder. &quot;<B>Shoot`Em`Up</B>&quot; enth&auml;lt
31 verschiedene Spiele - erw&auml;hnenswert: Transplant, Assimilation,
Rocketz. &quot;<B>Think</B>&quot; enth&auml;lt 33 Spiele - erw&auml;hnenswert: Reversi, Atomic,
Mines. &quot;<B>WB</B>&quot; enth&auml;lt 21 Spiele - erw&auml;hnenswert: MiniArcanoid, 5inRow,
Kniffel, WBSteroids.</P>

<P>Die Spiele sind Beispiele, die die Art der Eintr&auml;ge verdeutlichen,
teilweise sind sie aber auch die herausragenden Vertreter ihrer Sparte.</P>

<P>Viele sind nat&uuml;rlich nicht sauber programmiert, lassen sich nicht beenden
oder sind von amateurhafter Qualit&auml;t. Darauf mu&szlig; man sich auf jeden Fall
gefa&szlig;t machen - ein paar Goldst&uuml;cke sind nat&uuml;rlich darunter.</P>

<p><b>Die Auswahl</b></p>

<P>Das die Auswahl begrenzt ist, nicht nur auf Masse gesetzt wurde, um mit
Angaben wie &quot;1.000 Spiele enthalten&quot; gl&auml;nzen zu k&ouml;nnen, ist einerseits
positiv, da viel Schrott herausgefiltert wurde. Andererseits fallen auch
ein paar wichtige L&uuml;cken auf, da ich gute Spiele, wie Dr.Mario,
Trailblazer, Cybernetix, HyperDrive oder SpeedRacerFX vermi&szlig;t habe.</P>

<P>Die Sammlung ist also begrenzt und sortiert, viele Fehler der Vorg&auml;nger
wurden nicht mehr gemacht. Die Demos sind sicher f&uuml;r viele interessant,
bleiben aber, was sie sind, n&auml;mlich kostenlose Werbung der Firmen zum
Anleckern potentieller Kunden. Das ist nicht anzukreiden, aber sie
sind halt nur Beiwerk.</P>

<P>Das oben erw&auml;hnte Zitat von CD-H&uuml;lle, da&szlig; alles problemslos startbar w&auml;re,
gilt f&uuml;r einige Spiele nicht. Diverse Assignabfragen tauchten auch bei
manchen, die sich direkt starten lassen w&uuml;rden, auf. Aber das ist ein
Problem, das bei wahrscheinlich keiner dieser Sammlungen jemals in den
Griff zu bekommen sein wird. Vor solchen Aussagen sollte man sich
allerdings h&uuml;ten - man k&ouml;nnte daran gemessen werden.</P>

<P>Die Zusammenstellung von Spielst&auml;nden wird sicher nur in sehr speziellen
F&auml;llen von Interesse sein, aber insbesondere das Tools-Verzeichnis mit
vielen Spiel-Zus&auml;tzen und Hilfsmitteln, sowie den wichtigsten gr&ouml;&szlig;eren
Software-Paketen kann &uuml;berzeugen.</P>

<p><b>Fazit</b></p>

<P>Leider geh&ouml;rt dies alles aber zum Beiwerk. Bei den Spielen selbst bleiben
zu gro&szlig;e L&uuml;cken in der Sammlung, was zusammen, insbesondere mit dem, auch
gegen&uuml;ber den anderen Sammlungen, stark erh&ouml;hten Preis, keine wirklich
gute Bewertung zul&auml;&szlig;t. Trotz des unleugbaren Qualit&auml;tssprungs wirft das
verhei&szlig;ungsvolle &quot;Vol. 1&quot; unweigerlich die Frage auf: Brauchen wir
wirklich noch mehr solcher Sammlungen?</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Games Attack</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.chiemgau.com/apc&tcp/">APC</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Daten-CD</TD>
    <TD><B>Version:</B></TD>
    <TD>-</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>39,95 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>APC&amp;TCP</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD ALIGN=CENTER>3</TD><TD align=center><IMG SRC="../images/note3.gif" WIDTH="32" HEIGHT="52"></TD></TR>
</TABLE></P>
APC&amp;TCP, Postfach 59, D-83236 &Uuml;bersee<BR>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903scen.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903m2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


