<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Envoy 3</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Envoy 3</H1>von<BR><A HREF="mailto:wammann@spectraweb.ch">Werner Ammann</A></DIV>

<P>Envoy ist eine Netzwerksoftware f&uuml;r den Amiga. Sie wurde <B>speziell</B> f&uuml;r den
Amiga programmiert und unterst&uuml;tzt dessen F&auml;higkeiten. Allerdings l&auml;sst
sich damit kein Netzwerk mit einem Amiga und z.B. einem PC einrichten, es
k&ouml;nnen nur Amigas verwendet werden.</P>

<P>Envoy 3 <B>l&auml;uft ab</B> OS 2.04 oder h&ouml;her, braucht mindestens 1 MB Ram und eine
Netzwerk-Hardware, z.B. eine Ariadne, Hydra, ConneXion oder A2065 Ethernet-
Karte. Mindestens eine Festplatte sollte im Netzwerk vorhanden sein, Envoy
belegt darauf etwa 2,5 MB Speicherplatz. Alle Ger&auml;tetreiber nach dem SANA-
II Standard werden unterst&uuml;tzt.</P>

<P>Ich habe hier einen A4000T mit Ariadne und einen A2000 mit Hydra-
Netzwerkkarte verbunden. Envoy wird <B>auf einer CD</B> ausgeliefert, obwohl nur
ca. 1 MB Daten drauf sind. Anscheinend ist eine CD mittlerweile billiger
als eine Diskette oder dies wird wegen der Datensicherheit so ausgeliefert.
Allerdings h&auml;tten auf der CD die zahlreichen Envoy-Tools aus dem Aminet
auch Platz gehabt.</P>

<P>Eine <B>deutsche Anleitung</B> liegt als AmigaGuide-Dokument auf der CD, sie ist
mit 112 KB recht umfangreich und detailliert. Das Kapitel 'F&uuml;r Einsteiger'
bietet dem Neuling einfache Informationen, darauf bauen dann weitere
Kapitel auf. F&uuml;r Besitzer der &auml;lteren Version 2 ist sicher auch das
Kapitel '&Auml;nderungen' interessant. Ich h&auml;tte mir gerne noch ein gedrucktes
Handbuch gew&uuml;nscht, bei einem Preis von 99 DM f&uuml;r diese Software w&auml;re das
meiner Meinung nach machbar.</P>

<P>Die <B>Installation und Konfiguration</B> war recht einfach. Die Anleitung bietet
hier eine gute Hilfestellung bei Problemen oder Unsicherheiten. Schon nach
kurzer Zeit konnte ich die Festplatten und CD-ROM's im A4000T auch auf dem
A2000 nutzen und umgekehrt. Die gew&uuml;nschten Datentr&auml;ger m&uuml;ssen auf einem
Rechner erst mal exportiert und auf dem anderen Rechner importiert werden.</P>

<P>Dabei kann gew&auml;hlt werden, ob die Verbindung permanent (DEVS/DOSDRIVERS),
unter storage (STORAGE/DOSDRIVERS) oder nur tempor&auml;r eingerichtet werden
soll. Dann erscheinen die Laufwerke des anderen Rechners auf der WB-
Oberfl&auml;che als Disk-Icons. Beim Exportieren kann man noch verschiedene
Optionen ausw&auml;hlen, u.a. ob Datentr&auml;ger fixiert oder Piktogramme
ausgelagert werden d&uuml;rfen. Auch hat man die M&ouml;glichkeit, ein Laufwerk
als read-only zu mounten. Es werden auch Wechselmedien unterst&uuml;tzt.</P>

<P>Ein <B>Drucker im Netzwerk</B> reicht, alle anderen Computer k&ouml;nnen darauf
zugreifen. Ebenfalls k&ouml;nnen die logischen Devices PRT: PAR: und SER:
umgeleitet werden.</P>

<P>F&uuml;r Benutzer selbst gibt's auch einige <B>Einstellungen</B>. Es k&ouml;nnen Benutzer-
Gruppen angelegt werden, was ich aber als so ziemlich der einzige Benutzer
des Netzwerk's wohl kaum brauchen werde. Ebenfalls k&ouml;nnen Verwalter-Rechte,
Namen und Passw&ouml;rter ge&auml;ndert werden. Auf Wunsch kann man auch die
Passwortabfrage abschalten. F&uuml;r meinen pers&ouml;nlichen Anwendungszweck finde
ich es schade, dass man hier nicht auch gleich noch die Userabfrage ebenso
abschalten kann. Dann k&ouml;nnte man das Netzwerk konfigurieren, ohne jedesmal
den Usernamen eingeben zu m&uuml;ssen. Aber da das Netzwerk selbst ohne
spezielle Eingaben l&auml;uft, ist dies kein grosses Manko. Einmal konfiguriert,
l&auml;uft Envoy dann problemlos.</P>

<P>Ob sich die <B>Geschwindigkeit</B> gegen&uuml;ber Envoy 2 ver&auml;ndert hat, kann ich nicht
feststellen, da ich diese bis jetzt noch nie gemessen habe. Probeweise
wurde nun aber ein 60 MB grosses File &uuml;ber das Netz geschickt und die Zeit
gemessen. Dabei kam ich auf einen Datentransfer von etwa 250 KB/sec vom
A4000/060 zum A2000/030. Die Geschwindigkeit kann sich nat&uuml;rlich ver&auml;ndern
bei Verwendung von anderen Netzwerkkarten. Auch spielt wohl die
Prozessorbelastung des SCSI-Adapters und der Festplatte eine Rolle.</P>

<P>Versuche mit einem zweiten A4000 und einer Ariadne brachten einen
Datentransfer von mehr als 500 KB/sec. Leider kann ich hier keine
weiteren Vergleiche anstellen, da ich keine andere Netzwerksoftware
installiert habe. Beim DirectoryOpus kam es es beim Auflisten der
Laufwerke manchmal zu deutlich sp&uuml;rbaren Verz&ouml;gerungen bei Envoy 2.
Hier ist Envoy 3 mit Sicherheit schneller geworden, die Laufwerke
sind sofort da.</P>

<P>Im <B>Gegensatz</B> zu Envoy 2 sind nun alle Fenster fontsensitiv und die
Programme sind deutsch lokalisiert. Das Konzept wurde beibehalten, ein
Anwender von Envoy 2 kommt auch mit Envoy 3 sofort zurecht. Die neue
Version bietet eine gute Online-Hilfe. &Auml;nderungen bei der Konfiguration
werden auch ohne Neustart wirksam. Zu erw&auml;hnen ist vielleicht noch, dass
Envoy 3 nicht kompatibel ist mit Envoy 2, es d&uuml;rfen also nur dieselben
Envoy-Versionen im Netz verwendet werden.</P>

<P>Im Aminet gibt es recht viele <B>Tools</B> zu Envoy. Erw&auml;hnenswert ist hier vor
allem <B>Ventriloquist</B>, damit kann man beide Amigas mit einer Tastatur und
einer Maus bedienen.</P>

<P><B>Fazit</B></P>

<P>Envoy 3 l&auml;uft zuverl&auml;ssig, die Installation und Konfiguration macht auch
dem Anf&auml;nger wohl kaum Probleme. Dass mit Envoy kein PC ins Netzwerk
eingebunden werden kann, ist f&uuml;r manche vielleicht eine Einschr&auml;nkung.
Envoy kann nur Amigas vernetzen, macht diesen Job allerdings sehr gut
und zuverl&auml;ssig. Die Online-Hilfe ist gut und praktisch. Ich h&auml;tte mir
aber trotzdem ein gedrucktes Handbuch zum Programm gew&uuml;nscht.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Envoy 3</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.schatztruhe.de">Schatztruhe</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Netzwerksoftware</TD>
    <TD><B>Version:</B></TD>
    <TD>3.0</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>99,- DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>2</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE></P>

Hersteller und Vertrieb:<br>
Stefan Ossowski Schatztruhe, Veronikastrasse 33, 45131 Essen<br>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903dek.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903cd.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


