<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - DigiBooster Professional</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>DigiBooster Professional</H1>von<BR><A HREF="mailto:T.Heinrich@amzeiger.de">Thomas Heinrich</A><br><br>

<a href="../amz0399/images/digiboo.gif">Screenshot</a>
</DIV>

<h3>Musik</h3>

<P>DigiBooster Professional ist ein <B>Sound- und Songeditor</B>, mit dem man diese
netten Musikmodule erstellen kann, die den Aminet-CDs immer die gro&szlig;e
Datenmenge bescheren. Das Grundmuster dieser Module besteht darin, da&szlig; man
Soundsamples nimmt und diese dann in einer bestimmten Tonh&ouml;he nach einem
bestimmten Rhythmus abspielt. Was dabei herauskommt, ist Musik - wenn alles
glatt ging.</P>

<P>DigiBooster kann nun genau das, und noch mehr. Zum einen kann es selbst
<B>Samples aufnehmen</B>, was ich leider nicht testen konnte, da mir ein Sampler
fehlt, zum anderen kann es diese auch noch <B>nachbearbeiten</B> und mit diversen
Effekten versehen, wie z.B. transponieren, also die Tonh&ouml;he &auml;ndern, ohne
da&szlig; dabei die Geschwindigkeit ver&auml;ndert wird, wie bei zu schnell/langsam
abgespielten Schallplatten (falls die noch jemand kennt...).</P>

<h3>Technik</h3>

<P>Die <B>Soundausgabe</B> erfolgt ausschlie&szlig;lich &uuml;ber das AHI-Device, einem im
Aminet frei erh&auml;ltlichen Soundausgabesystem, da&szlig; auch Soundkarten
unterst&uuml;tzt.</P>

<P>Praktischerweise ist das Device auch gleich auf der einzigen
<B>Installationsdiskette</B> enthalten, die in einer CD-H&uuml;lle steckt. Als
Mogelpackung m&ouml;chte ich das nicht bezeichnen, denn schlie&szlig;lich hat sogar
einmal das Bundesministerium f&uuml;r Verteidigung (kurz: Bundeswehr) eine
solche Verpackung f&uuml;r ihr Promo-Spiel &quot;Helicopter Mission&quot; benutzt. </P>

<P>Auf der R&uuml;ckseite der Verpackung findet man eine Aufz&auml;hlung der Features
von DigiBooster, leider auf <B>Englisch</B>. Ganz unten steht noch ein
unmotiviertes &quot;Deutsch und English&quot; ohne jeden Bezug. Das einzige
deutsche, das sich findet, ist eine mehr schlecht als recht &uuml;bersetzte
Anleitung, die &uuml;brigens nicht mitinstalliert wird. Weiter deutsche
Fragmente findet man in manchen Requestern. Das Inlay bietet au&szlig;er
ein paar unkommentierten Screenshots gar keine Informationen.</P>

<P>Die <B>Systemvoraussetzungen</B> sind moderat: MC68020, Kickstart 2.0, mehr ist
nicht n&ouml;tig. Empfohlen wird jedoch ein MC68030 mit 50 MHz, 4 MB RAM und
eine Soundkarte.</P>

<P>Auch ein Kopierschutz ist vorhanden, der jedoch ziemlich sinnlos ist. Bei
der Installation wird der Programmpfad fest einkodiert, so da&szlig; jedes
umbenennen oder verschieben eine Fehlfunktion des Programms zur Folge hat.
Die Auswirkungen reichten bei mir von &quot;keine Folgen&quot; bis &quot;Deadlock beim
&ouml;ffnen des Config-Fensters&quot;. Aber auf keinen Fall das, was die Anleitung
androht, n&auml;mlich ein Beenden des Programms nach f&uuml;nf Minuten.</P>

<h3>Installation</h3>

<P>Auf der Diskette finden sich sage und schreibe drei <B>Installationsskripte</B>,
die alle ausgef&uuml;hrt werden wollen, am besten in der Reihenfolge
&quot;InstallAHI&quot;, &quot;InstallFonts&quot; und &quot;InstallDBPro&quot;. Obwohl mit den
Installericons versehen, ist nur &quot;<B>InstallAHI</B>&quot; ein echtes Installerskript.</P>

<P>&quot;<B>InstallFonts</B>&quot; kopiert den Font nur per DOS-Skript und &quot;<B>InstallDBPro</B>&quot; ist
sogar ein ganzes Programm, das auch den Kopierschutz realisiert. Hier w&auml;hlt
man eine Schublade, in der das Programm erzeugt wird, das war's. Will man
eine Unterschublade f&uuml;r DigiBooster, mu&szlig; man die vorher erzeugen,
umbenennen und verschieben geht ja nicht. Sp&auml;testens hier entsteht
doch ein gr&ouml;&szlig;erer Zweifel am Produkt.</P>

<P>Die <B>Anleitung</B> sucht man, wie erw&auml;hnt, auch vergebens. Wenn man sie braucht,
sollte man sie sich gleich von Hand von der Diskette kopieren. Und als
unbedarfter Einsteiger wird man sie brauchen. </P>

<h3>Start</h3>

<P>Startet man DigiBooster, wird zuerst der Workbench-Screen geklont und
DigiBooster darauf gestartet. Soweit keine schlechte L&ouml;sung, nur hat man
dann eine Oberfl&auml;che vor sich, die einen erstmal das <B>Grausen</B> ins Gesicht
treibt. Kn&ouml;pfe, Schalter, Eingabefelder soweit das Auge reicht. Auf den
ersten Blick ist keine logische und optische Unterteilung zu erkennen,
auf den zweiten auch nicht. Erst wenn man auf manche Kn&ouml;pfe klicken will,
merkt man, da&szlig; es eigentlich nur Beschriftungen sind.</P>

<P>Nimmt man dann eine h&ouml;here Bildschirmaufl&ouml;sung, kommt der n&auml;chste Effekt:
Die Breite des Layouts ist fest, so da&szlig; zwar das Notendisplay h&ouml;her wird,
aber rechts ein unsch&ouml;ner, ungenutzter Rand entsteht. Zudem werden die
Kn&ouml;pfe so klein, da&szlig; sie immer schwerer zu entziffern sind.</P>

<P>Es kommt noch schlimmer. Manche Kn&ouml;pfe &uuml;berschreiben wieder andere, so
da&szlig; Mehrfachbelegungen herauskommen, je nachdem, welche Funktionalit&auml;t
man gerade gew&auml;hlt hat. Eine Eingew&ouml;hnung an immer wiederkehrende
Arbeitsabl&auml;ufe wird so wirksam erschwert.</P>

<P>Da ist es eigentlich nicht mehr erw&auml;hnenswert, da&szlig; das Ganze sch&ouml;n bunt
ist, mit Hintergrundmustern hinterlegt, die grausam gedithert sind. Sicher
ist der <B>Style-Guide</B> manchmal streng, aber an diesem abschreckenden Beispiel
sieht man auch, warum.</P>

<h3>Arbeit</h3>

<P>Jetzt m&ouml;chte ich auch mal etwas positives berichten. Man kann tats&auml;chlich
Samples und Songs laden und abspielen, wenn man die Bedienkn&ouml;pfe dazu
gefunden hat. Auch bearbeiten kann man sie, wenn man wei&szlig;, was welcher
Knopf tut. Dazu braucht man aber ein immenses <B>Vorwissen</B> zur Erstellung
von Musikmodulen, denn die Anleitung erkl&auml;rt anhand von Fachbegriffen die
mit Fachbegriffen bezeichneten Kn&ouml;pfe und Schalter... Sie ist also nicht
hilfreich. Eine Einf&uuml;hrung oder ein simples Beispiel zum Nachvollziehen
ist nicht vorhanden.</P>

<P>So blieb es auch bei mir immer dem <B>Zufall</B> &uuml;berlassen, ob eine Manipulation an
eines Songs letztlich auch gl&uuml;ckte, oder ob ich frustriert die drei
meistbenutzten Tasten eines jeden Rechners gedr&uuml;ckt habe. Nicht, weil das
Programm hing, sondern aus reinem &Auml;rger, sozusagen als Strafe, weil es
mich so qu&auml;lte.</P>

<P>Immerhin kennt DigiBooster einige <B>Formate</B> (XM, S3M, Octamed, MOD, Oktalyzer
und DIGI) und kann XM und MOD exportieren. Profis werden die DSP-Effekte zu
sch&auml;tzen wissen, au&szlig;erdem die Unterst&uuml;tzung von Sound- und Grafikkarten.</P>

<h3>Empfehlung</h3>

<P>Wollen Sie einfach mal so reinschnuppern, in die Welt der
computerunterst&uuml;tzten Musik, sparen Sie sich Ihr Geld und sehen Sie sich
erstmal im Aminet nach Demo- und Freewareversionen &auml;hnlicher Programme um.</P>

<P>Schreckt Sie eine grausame Bedienung und eine un&uuml;bersichtliche Oberfl&auml;che
nicht ab, und es geht Ihnen nur um Funktionalit&auml;t, bietet DigiBooster
bestimmt genug, um auch Profis zufriedenzustellen.</P>

<h3 align=center>Wertung</h3>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>DigiBooster Pro</TD>
    <TD><B>Hersteller:</B></TD>
    <TD>T. &amp; W. Piesta</TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Soundmodul-Editor</TD>
    <TD><B>Version:</B></TD>
    <TD>2.18</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>99,- DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>APC &amp; TCP</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>2</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note4.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>6</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>5</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>4</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>4</TD></TR>
</TABLE></P>
Support:  <A HREF="http://www.amigaworld.com/support/digibooster/index.html">http://www.amigaworld.com/support/digibooster/index.html</A><BR>
Vertrieb: APC&amp;TCP, Postfach 59, 83236 &Uuml;bersee<br>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../amz0399/iv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903dek.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


