<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - AmigaTimes-CD</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>AmigaTimes-CD</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Die <B>AmigaTimes</B>, ebenfalls ein Online-Magazin f&uuml;r den Amiga, hat eine
eigene CD-ROM herausgebracht, die vom APC&amp;TCP produziert und vertrieben
wird.</P>

<P>Das Cover-Motiv wirkt gelungen. Der erl&auml;uternde Text auf der R&uuml;ckseite
ist leider mit einigen vermeidbaren Fehlern versehen, insbesondere
fehlende Leerzeichen zwischen manchen W&ouml;rtern fallen auf, und wirkt arg
in eine Ecke gequetscht, da er nur etwa ein Viertel der zur Verf&uuml;gung
stehenden Fl&auml;che nutzt.</P>

<P>Aber das sind Kleinigkeiten. Wichtiger vielmehr ist <B>der Inhalt</B>.</P>

<P>Neben einem <B>Hallo-Guide</B>, der einen begr&uuml;&szlig;t, die Macher vorstellt und einen
Einblick in die Entstehungsgeschichte des Magazins vermittelt, gibt es
das obligatorische Icon, welches einige wichtige Assigns erstellt und
mehrere Verzeichnisse auf der gut gef&uuml;llten Scheibe, die ich nachstehend
beschreiben werde.</P>

<P><B>&quot;AmigaTimes&quot;</B> enth&auml;lt nat&uuml;rlich die gesammelten, bis zum Zeitpunkt der
Entstehung der CD erschienenen Ausgaben des Magazins, entpackt und gepackt
in den vorhandenen AmigaGuide- und HTML-Varianten.</P>

<P>Hinter <B>&quot;Vollversion&quot;</B> verbirgt sich AmiAtlas 2.0 (inkl. Keyfile), mit dem
es u.a. m&ouml;glich ist, innerhalb Deutschlands &uuml;berregionale Autofahrten zu
planen und sich den Verlauf der Strecke anzeigen zu lassen. Das Programm,
das mehr als 10.000 Eintr&auml;ge (Orte und Stra&szlig;en) enth&auml;lt, ist mit einem
Stand vom September 1995 zwar nicht mehr taufrisch aber doch recht
n&uuml;tzlich.</P>

<P><B>&quot;Demos&quot;</B> enth&auml;lt zwei Unterverzeichnisse und ein Readme, welches einen
darauf aufmerksam macht, da&szlig; eine Vorinstallation der Programme schlecht
m&ouml;glich sei, da man ja z.B. nicht wisse, ob der User nun &uuml;ber eine FPU
verf&uuml;ge oder nicht und man mehrere Versionen installieren m&uuml;&szlig;te.
Sicherlich ist dies ein Problem, gerade bei Anwendersoft, aber wenn
man von einer Konfiguratin mit dem kleinsten m&ouml;glichen Nenner ausgehen
w&uuml;rde, k&ouml;nnte man die Demos trotzdem erst einmal anschauen.</P>

<P>Auf jeden Fall ist man also in den meisten F&auml;llen gezwungen, die Software
individuell zu installieren, um sie testen zu k&ouml;nnen. In <B>&quot;Demos/Programme&quot;</B>
finden sich eine ganze Reihe bekannter Vertreter dieser Gattung, n&auml;mlich
AmigaWriter, ArtEffect 2.6, ArtStudio Pro, BurnIt, Elastic Dreams, PPaint
7.1, ScanQuix 3, StormC, TurboCalc 5d, VideoFX, WarpUp, Wildfire PPC und
ein paar mehr.</P>

<P><B>&quot;Spiele&quot;</B> enth&auml;lt u.a. Demoversionen von Foundation, Flyin'High, Myst,
Napalm, Odyssey und OnEscapee, um die wichtigeren zu nennen.</P>

<P>Das n&auml;chste Hauptverzeichnis ist <B>&quot;Internet&quot;</B>. Hier gibt es Demoversionen
der wichtigsten Web-Browser (IBrowse, AWeb und Voyager), sowie des
bekannten Internet-Klients Miami. Nat&uuml;rlich sind auch FTP-, IRC- und
Mailprogramme enthalten, nicht zu vergessen Term. Gerade f&uuml;r Internet-
und DF&Uuml;-Einsteiger eine hilfreiche Basis-Sammlung.</P>

<P>In <B>&quot;Module&quot;</B> sind ca. 200 verschiedene Module enthalten, die von sehr
unterschiedlicher Qualit&auml;t sind, aber sicher ist fast f&uuml;r jeden etwas
dabei. Sicher positiv, da&szlig; DeliTracker2 hier, zum Abspielen bereit,
installiert ist - in einem eigenen Ordner w&auml;re er aber sicher besser
aufgehoben gewesen, da seine Programmbestandteile teilweise zwischen
den Musikmodulen verstreut sind.</P>

<P>Was aber verbirgt sich hinter dem schwammigen Begriff <B>&quot;Sonstiges&quot;</B>?
Mehrere Unterverzeichnisse! Namentlich: <B>&quot;APC&amp;TCP&quot;</B>, mit dem Clubantrag;
<B>&quot;Bilder&quot;</B>, mit kaum bemerkenswertem Inhalt; <B>&quot;Texte&quot;</B>, von dem die meisten
Eintr&auml;ge auch eher dem Mantel des Vergessens anheim fallen sollten,
immerhin ist hier aber auch ein kleines `Backbuch` zu finden.</P>

<P>Das letzte der Subdirectories hier in diesem Ordner, enth&auml;lt <B>&quot;Tools&quot;</B>. Auch
hier sind wieder einige der bekannten und bew&auml;hrten Vertreter dieser Sparte
zu finden, wie Toolmanager, MagicMenu, NewIcons und MCP.</P>

<P><B>&quot;Programme&quot;</B> - hier gibt es einige gr&ouml;&szlig;eren Softwaretitel, vielfach aus dem
PD-Bereich, wie GoldED, AmiCDFS, MUI, MagicWB, IDE-fix, STFax usw.. Einige
sind als Shareware ebenfalls eingeschr&auml;nkt.</P>

<P>14 verschiedene, meist gute PD-<B>&quot;Spiele&quot;</B> sind im Verzeichnis gleichen Namens
enthalten, z.B. BlitzBombers, FreeCiv und BoulderD&auml;sh.</P>

<P>Das zum Inhalt. <B>Wie lautet das Fazit?</B></P>

<P>Schwierig zu sagen: die Zusammenstellung der Tools, Programme und Demos
ist durchaus sorgf&auml;ltig erfolgt. F&uuml;r eine Archiv-Funktion ist die Auswahl
aber etwas zu gering und ausgesucht. Die nicht mehr frische Vollversion
von AmiAtlas ist zwar eine nette Zugabe, rechtfertigt aber f&uuml;r viele
Leser sicher nicht den Kauf.</P>

<P>F&uuml;r Leute mit DF&Uuml;- und/oder Internet-Zugriff (also die Mehrzahl) bietet
die CD wenig, was sie nicht auch auf anderem Wege schon bekommen h&auml;tten
oder leicht bekommen k&ouml;nnten. Wer Downloads sparen will greift auf die
aktuelleren Aminet-CDs zur&uuml;ck.</P>

<P>Gerade f&uuml;r Einsteiger eventuell eine Alternative, bietet diese CD
insgesamt aber zu wenig eigenes Profil, um aus der Anzahl &auml;hnlich
gestrickter Produkte herausragen zu k&ouml;nnen.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>AmigaTimes-CD</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.chiemgau.com/apc&tcp/">APC</A> / Niffi</TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Daten-CD</TD>
    <TD><B>Version:</B></TD>
    <TD>-</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>24,95 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>APC&amp;TCP</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD ALIGN=CENTER>3</TD><TD align=center><IMG SRC="../images/note3.gif" WIDTH="32" HEIGHT="52"></TD></TR>
</TABLE></P>
APC&amp;TCP, Postfach 59, D-83236 &Uuml;bersee<BR>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903env3.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903scen.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


