
<HTML>

<HEAD>
<TITLE>Barra</TITLE>
<META NAME="webmaster" CONTENT="lanzidei@tin.it">
</HEAD>

<BODY BACKGROUND="" BGCOLOR="#000000" TEXT="#ffffff" LINK="#ff8000" VLINK="#ffaa55" ALINK="#ff8000">

<center>
<img src="img/racconti.jpg" hspace=0 WIDTH=200 height=30 border=0><br><br>
<font face="comic sans ms" size=2><b>
BIG TITS<br>
di <i>Daniele Patrioli</i></b>
<br><br>

<table width="90%"><td><font face="comic sans ms" size=2>
<p align="justify">
<I><P ALIGN="JUSTIFY">E vorrei trovare, adesso, tutto quanto perduto. </P>
<P ALIGN="JUSTIFY">&quot;Cosa?&quot;</P>
<P ALIGN="JUSTIFY">Ma quello che ho aspettato per anni e che non avevo mai visto con sguardo terso.</P>
<P ALIGN="JUSTIFY">&quot;Quando &egrave; successo la prima volta?&quot;</P>
<P ALIGN="JUSTIFY">Alla fine. Alla fine meno un respiro.</P>
</I><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">E’ quando sento una pulsione che sale, forte, e non posso fare altro che. La sedia girevole porta su di s&eacute; qualche alone pi&ugrave; scuro, ormai.  Ha la forma del mio sedere. </P>
<P ALIGN="JUSTIFY">Mi siedo, il braccio corre in basso, preme, un ronzio, spengo le casse, aspetto, clicco sull’icona col telefono giallo, aspetto ancora, verifica nome utente e password attendere prego, scompare l’avviso e io ci sono, nella rete, apro Netscape, poi da Finestra vado a Cronologia, trovo qualche sito precedentemente apprezzato, lo apro.</P>
<P ALIGN="JUSTIFY">Tette, mega tette, meloni, nipples, fottimenti e avvinghiamenti per&ograve; solo se con grandi bocce, altrimenti no, non mi interessano. Quando le immagini sgocciolano troppo lente mi innervosisco. Stoppo e ricarico, come se servisse a qualcosa. Aspetto che i puntini colorati diventino rosei, e rotondi, e se la tetta non mi piace vado oltre. Coi thumbnails &egrave; meglio.</P>
<P ALIGN="JUSTIFY">Per&ograve; quando sono tanti la pagina non si carica mai, e mentre aspetto sudo, e sono irritanti quelle attese, e che cazzo tutta questa pubblicit&agrave;. Idioti.</P>
<P ALIGN="JUSTIFY">Cambio sito. Di nuovo la trafila legale, enter or exit, fanculo, e poi ti prendono in giro questi siti free che ci trovi quasi solo i banners di quelli a pagamento, &egrave; una specie di caccia al tesoro trovare dove diavolo hanno messo il link per le foto. </P>
<P ALIGN="JUSTIFY">Pics, eccolo. </P>
<P ALIGN="JUSTIFY">800 bytes al secondo, pu&ograve; andare. Questo non &egrave; male. Ce ne sono 30 per pagina, e quante pagine: natural boobs, heavy hangers, big boobs, titanic boobs, boob fucking, lesbian boobs, cum shot, blow job. </P>
<P ALIGN="JUSTIFY">Quelli che preferisco sono gli hardcore boobs. Non disdegno neanche il sesso orale, e la spagnola, sempre che l’angolazione fotografica non stringa troppo sul dettaglio. Anche le facce, voglio.</P>
<P ALIGN="JUSTIFY">I peli delle mie gambe sono completamente bagnati, la fronte pure, e sento anche i capelli dietro la testa un po’ umidi. Da dove viene tutto questo caldo? Ogni tanto lascio scivolare i miei occhi dallo schermo verso il basso, non indugio troppo, per&ograve; sono gonfio, gonfio, gonfio. Esplosioni controllate, artificieri un po’ esteti un po’ bambini, perch&eacute; non &egrave; ancora perfetto, non basta mai, ci pu&ograve; essere di meglio, ci deve essere di meglio, perch&eacute; lo sai quanti ce ne sono di siti cos&igrave;, e le tette svedesi fatichi a trovarle per&ograve; esistono, da qualche parte, da qualche parte le voglio trovare, e chiudo, e riapro altre porte, e le sbatto, e mi ci lascio sfilare in mezzo, e salgo salgo di tono, poi ancora una pausa, un ingorgo. Daccapo, non pu&ograve; essere solo questo, oggi, non basta</P>
<P ALIGN="JUSTIFY">E daccapo. Daccapo col mouse, daccapo, col sangue, daccapo a sudare e vibrare, daccapo a spazientirsi febbrile, la febbre sale, poi ridiscende, adesso sento che &egrave; quasi il massimo, anzi lo &egrave; forse, dove le trovo due tette cos&igrave;, altrove altrove no, e allora s&igrave; s&igrave; s&igrave; s&igrave; s-&igrave; s-&igrave; s - - -----i- -  -   -     -             -.  </P>
<P ALIGN="JUSTIFY">Chiudo il collegamento. Provo disgusto a farlo. Provo disgusto anche ad aprire il cache – vorrei chiudere tutto cos&igrave; e basta per sempre e andarmene, presto – per&ograve; lo faccio, e seleziono tutto, e cestino, ancora in un ultimo assalto lui mi richiede sei sicuro, e s&igrave;, </P>
<P ALIGN="JUSTIFY">s&igrave; maledizione, sono sicuro, nessuna traccia, dimentica tutto, almeno tu.</P>
<P ALIGN="JUSTIFY">Mi alzo, vado verso il bagno e butto l’asciugamano a lavare. Stavolta l’imbottitura rossa della sedia girevole &egrave; intonsa, niente macchie, nulla. </P>
<P ALIGN="JUSTIFY">Che schifo. E sono una merda. E sul tavolino davanti al mio letto ci sono decine di crocette cancellate, a matita, ogni volta, adesso basta, basta perdio, di questo realizzarsi attraverso l’erotismo, ossessioni che pesano, e se mi piacciano le tette grandi perch&eacute; non disegnarle da solo o pensarle e basta. Basta, una vita a lasciarsi bastare, e invece non basta mai. </P>
<P ALIGN="JUSTIFY">Se lei lo sapesse, forse cambierebbe opinione, o almeno direbbe che faccio un po’… </P>
<P ALIGN="JUSTIFY">No, magari &egrave; normale, autoflagellazione a perdere, stupidi complessi di colpa, retaggi cattolici, conosco il mio corpo, ed &egrave; meglio. Ho una forte carica erotica. E’ quanto.</P>
<B><P ALIGN="JUSTIFY"></P>
</B><I><P ALIGN="JUSTIFY">&quot;E questo che significa?&quot;</P>
<P ALIGN="JUSTIFY">Significa che ho cercato la morte perch&eacute; solo lei mi poteva dare un po’ di vita.</P>
<P ALIGN="JUSTIFY">&quot;Ma cosa c’entra la morte con le tette di cui hai raccontato?&quot;</P>
<P ALIGN="JUSTIFY">Loro permettevano che io non ci fossi. Me ne andavo, e quando tornavo ero vuoto, azzerato, dovevo ricominciare e riedificare un’identit&agrave;. Tra le macerie mi ci muovevo bene, e la disarmonia era come una luce addosso che – straniandomi – mi faceva osservare come fossi a me stesso sconosciuto. Senza quelle piccole morti, mi sarei appiattito su me stesso, e sarebbe finita l&igrave;, per me. Invece cos&igrave; sono andato avanti, a scosse ma sono andato avanti.</P>
<P ALIGN="JUSTIFY">&quot;E allora, perch&eacute; sei qui?&quot;</P>
<P ALIGN="JUSTIFY">Perch&eacute; morire fa anche male. Non pu&ograve; durare.</P>
<P ALIGN="JUSTIFY">&quot;Ti piacciono ancora le tette?&quot;</P>
<P ALIGN="JUSTIFY">Non posso farne a meno.</P>
<P ALIGN="JUSTIFY">&quot;Ti potrai sbizzarrire, qui&quot;</P>
<P ALIGN="JUSTIFY">Lo so, e infatti sono venuto anche per questo</P>
<P ALIGN="JUSTIFY">&quot;Toglimi una curiosit&agrave;: quando hai deciso di venire da noi?&quot;</P>
<P ALIGN="JUSTIFY">Quando ho capito che quelle piccole morti non erano pi&ugrave; sufficienti, e che ne dovevo trovare una pi&ugrave; grande, una che durava, una che mi assorbisse tutto, e sempre.</P>
<P ALIGN="JUSTIFY">&quot;Da domani si comincia. Spero riuscirai a inserirti. Buona fortuna&quot;</P>
</I></td></table>
</BODY>

</HTML>
