
<HTML>

<HEAD>
<TITLE>Barra</TITLE>
<META NAME="webmaster" CONTENT="lanzidei@tin.it">
</HEAD>

<BODY BACKGROUND="" BGCOLOR="#000000" TEXT="#ffffff" LINK="#ff8000" VLINK="#ffaa55" ALINK="#ff8000">

<center>
<img src="img/racconti.jpg" hspace=0 WIDTH=200 height=30 border=0><br><br>
<font face="comic sans ms" size=2><b>
IL NO<br>
di <i>Daniela Manzini</i></b>
<br><br>

<table width="90%"><td><font face="comic sans ms" size=2>
<P align="justify">Il fumo della sigaretta si snodava in un filo leggero davanti alla sua
mano. Bianco e sottile. E poi si sfaceva in niente. Distolse lo sguardo.
mosse la mano. Scener&ograve; nel posacenere di vetro, imitazione cristallo
(ipermercato, L. 3 200). Si concentr&ograve; su pensieri in fuga nell' aria a
spirali tondeggianti, e cerc&ograve; di fermarne uno. Acchiapparne uno e legarcisi
strettamente, pareva fondamentale. Magari era soltanto un passo avanti.
Suon&ograve; il telefono. Allung&ograve; la mano. Esit&ograve; un attimo. Poteva non rispondere.<br>
Ma avrebbe richiamato. Di sicuro.<br>
Sollev&ograve; il ricevitore. Disse: "Pronto."<br>
"Tu devi capire......" Ecco, dunque. La mente era gi&agrave; bloccata su quelle
tre parole, lunghe come una vita passata sotto un acquazzone. E come sempre
era aggrovigliata, un intreccio di fili di ferro, duro e rugginoso.
Capitava sempre cos&igrave;. Tu devi capire. O le varianti. Tu devi fare, Tu devi
andare, Tu devi pensare. Devi. La parla chiave.<br>
Intanto aveva scostato il ricevitore dall' orecchio. Perch&egrave; aveva
acchiappato, non un pensiero, per quello avrebbe dovuto arrampicarsi su per
i muri, ma un' immagine, fluida e senza tempo. Di sole e d' alberi verdi.
Di terra profumata. Di una casa bianca con il tetto a tegole rosse e fiori
al balcone e aiuole davanti. Ma era passato troppo tempo. Non si torna
indietro. A volte si riesce a cambiare l' oggi, ma a riguadagnare il
passato, no. La voce schizzava fuori dal ricevitore, sbavature di parole
friggevano nell' aria.
Lo appoggi&ograve;, piano, sulla mensola, si alz&ograve; dalla sedia e and&ograve; in cucina. Si
vers&ograve; da bere, si sentivava la gola gonfia e stretta, sfil&ograve; un' altra
sigaretta dal pacchetto sul tavolo, l' accese. La voce continuava. La sua
mente era diventata un intrico di rovi. Non ci si passava l&igrave; in mezzo. Una
lucertola, forse. S&igrave;, una lucertola ce l' avrebbe fatta.
S' avvicin&ograve; alla finestra, guard&ograve; attraverso la tenda di pizzo bianco. Non
c' era niente da vedere, se non il muro della casa di fronte, come sempre.
Eppure era gi&agrave; qualcosa: come buttare un occhio su altra gente, dare una
sbirciata al fatto che altri erano l&igrave;, vicini. Da morir dal ridere. Vicini?<br>
Come se fossero su un altro pianeta. Si allontan&ograve; dalla finestra e sent&igrave; lo
sfrigolio della voce, acuta. Sent&igrave; una fitta, la solita fregatura, il senso
di colpa. Bisognava esser stronzi per comportarsi cos&igrave;. O vigliacchi. No,
non era vigliaccheria. Se avesse detto quello che voleva, avrebbe sentito
lo stesso, identico senso di colpa. Per un altro motivo, chiaro, perch&egrave;
aveva parlato, chiaro. Tanto valeva allora continuare quella finta.
Suonarono alla porta. Chiese al citofono: " Chi &egrave;? "
"Pubblicit&agrave; in buca. Mi d&agrave; il tiro? "
"No." Ecco. Cos&igrave; semplice.<br>
No. Altra parola chiave.<br>
No.<br>
E l' aveva sprecata per un ragazzo che come gli altri che portavano le
stampe, finiva per suonare sempre al suo campanello, tanto trovavano sempre
qualcuno che apriva. C' era sempre qualcuno in casa. Stavolta quel qualcuno
non avrebbe aperto, per&ograve;.
No. Se lo rigir&ograve; in bocca quel monosillabo, no, no, no, suonava bene, era
appena nato, sapeva di verde e di fresco, profumava di nuovo.
Riprese il ricevitore in mano. "......... non &egrave; che io abbia l' intenzione
di perdere il pomeriggio a parlarti, tu devi capire che ho altre cose da
fare e sono tutte pi&ugrave; interessanti che stare a a ripetere le stesse cose a
chi non vuol capire....... Tu devi renderti conto che finora ho portato
pazienza, ma se mi costringi, posso perderla e allora voglio vedere che
cosa farai....... Tu devi ragionare una volta per tutte e devi, dico devi,
adeguarti.............."<br>
"No. " disse e piano riappese il ricevitore. Cambi&ograve; idea, lo sollev&ograve; e lo
lasci&ograve; sulla mensola, staccato.<br>
Ci aveva ragionato, oh, se ci aveva ragionato! Per tanto di quel tempo da
perderne il ricordo e non aveva trovato niente, mai niente di adeguato. In
ultimo che cos' era, lei? Una che non sapeva giocare a bridge. Una che non
amava far shopping, una che non ne voleva sapere di riprendere la vita di
sempre, adesso che era rimasta sola, senza l' unica persona che aveva
saputo farla ridere delle sciocchezze di cui la vita &egrave; piena e che
diventano tragedie se solo ti provi a guardarle fisso fisso con il volto
serio e la fronte corrugata. Di uno a cui non fregava niente che lei fosse
elegante e tirata, di uno a cui piaceva andare per i campi fra il fango d'
inverno e l' erba alta di primavera e che se si trovava una zecca sul palmo
della mano, sorrideva e diceva: " Guarda, ci son gi&agrave; "
Ma adesso, che era libera da quel suo nessuno, lei era una da guidare
prendendola per mano, perch&egrave; imparasse tutte le belle cose che la vita
offre a chi sa godersela, un' inetta di ex qualcosa, a cui bisognava dire
come era opportuno che si vestisse, dove era opportuno che andasse, chi era
logico che frequentasse. Ma s&igrave;. Una cos&igrave;. Docile. Non discuteva. Accese un'
altra sigaretta. Accese la televisione, la spense, mise su un cd, il primo
che le capit&ograve; e la colonna sonora del titanic lav&ograve; i muri bianco avorio
della stanza, si diffuse lentamente fino negli angoli impolverati della
mente, spruzz&ograve; acqua salata sui pensieri, ne fece precipatare alcuni sul
fondo e altri port&ograve; a galla e sensazioni dimenticate esplosero in mille
colori come fuochi artificiali, la sensazione di come ci si sente a fare
uno sberleffo e poi correre via, dando la mano ai ricordi, per rifarsi una
vita a modo proprio.
Si fiss&ograve; dritta negli occhi nello specchio, arricci&ograve; le labbra, arrontond&ograve;
i contorni, disse: no. Che magia. Era come aver imparato a parlare.
Prese le forbici dal cassetto in cucina. Torn&ograve; allo specchio: si
fronteggi&ograve;. Con calma, a gesti decisi e pensati, ciocca dopo ciocca si
tagli&ograve; i capelli che in quegli ultimi mesi ogni settimana, dico, ogni
settimana s' era lasciata fare da uno coiffeur che qualcuno aveva deciso
andava bene per lei. Perch&egrave; era ora, adesso che lui non c' era pi&ugrave;, che
reimparasse a stare al suo posto, a presentarsi come ci si aspettava.
"Vero, cara? " S&igrave;. Certo.
Vuota dentro come un astuccio rovesciato. S&igrave;. Aveva detto. S&igrave;.
" Non &egrave; un bell' uomo, cara? " S&igrave;. Certo.
" E' vedovo, sai, anche lui. Ti trova.....cos&igrave;....fine. Sei contenta, cara?
" S&igrave;. Come no.<br>
Disarmata. Imbelle. Timorosa.<br>
Sapeva che dall' altra parte della linea, qualcuno fissava il no che lei
aveva impostato via etere, scuotendo la testa, con incredulit&agrave;. Che poi
sarebbe diventato orrore, poi sarebbe naufragato nel non mi puoi trattare
cos&igrave;, il ribaltamento del devi trattarmi cos&igrave;.......di l&agrave; dalla linea c'
era, lo sentiva, la convinzione che ci sarebbe caduta di nuovo nel solito
ricatto del ......con quello che ho fatto per te........insieme alla
convinzione che si sarebbe sentita in colpa. Gi&agrave;. Le venne da ridere. Dal
profondo di tutta la sua indifesa docilit&agrave;.
S&igrave;, era nell' aria, si stava concretizzando, probabilmente stava gi&agrave;
rifacendo il numero, per incominciare, anzi riprendere con pi&ugrave; fervore il
discorso. Avrebbe trovato occupato. No. Che chiamasse. Prese con due dita
il ricevitore, lo fiss&ograve; un momento, poi, con uno svolazzo lo pos&ograve; al suo
posto. Che chiamasse. E che fosse breve. Lei aveva un monte di cose da
fare. Non aveva tempo per stare a ascoltare la lista dei suoi nuovi doveri,
lei aveva da uscire a comprarsi un film in cassetta, e una cena cinese con
cui condire il film e poi voleva farsi una doccia megagalattica e ascoltare
lo stereo fino a notte fonda e poi domani......Dio, quanti no voleva dire,
domani!
</FONT></td></tr></table>
</BODY>

</HTML>
