
<HTML>

<HEAD>
<TITLE>Barra</TITLE>
<META NAME="webmaster" CONTENT="lanzidei@tin.it">
</HEAD>

<BODY BACKGROUND="" BGCOLOR="#000000" TEXT="#ffffff" LINK="#ff8000" VLINK="#ffaa55" ALINK="#ff8000">

<center>
<img src="img/racconti.jpg" hspace=0 WIDTH=200 height=30 border=0><br><br>
<font face="comic sans ms" size=2><b>
RUMORI D’ASSESTAMENTO (Bukowsky non l’avrebbe mai fatto)<br>
di <i>Antonio Zucconi</i></b>
<br><br>

<table width="90%"><tr><td><font face="comic sans ms" size=2>
<P ALIGN="JUSTIFY">Tommy scese le scale ancora in pigiama, con i capelli che gli coprivano la faccia e uno scoiattolo putrefatto che gli penzolava dalla bocca. Era Domenica, e in casa non c’era nessuno, perch&egrave; tutti quanti se n’erano andati alla santa messa, per la solita riunione settaria, dove tutti sacrificavano un’ora della propria vita per quel pezzetto di paradiso che ci hanno offerto tanto tempo fa, e che ci spetta di diritto. Tommy si ferm&ograve; sull’ultimo gradino, e scost&ograve; le tendine per vedere che giorno era.</P>
<P ALIGN="JUSTIFY">La Domenica &egrave; un giorno strano, perch&egrave; tutto se ne sta sotto un quintale di silenzio, e a prima vista pare che tutto debba rimanere com’&egrave; per un secolo o due. Ma non &egrave; mai cos&igrave;, alla fin fine. Si tratta solo di un’errata impressione, un presentimento che se ne va sempre a vuoto. Per&ograve; &egrave; tanto per farvi capire come si pu&ograve; sentire un diciottenne pieno d’ormoni, quando il mondo stacca il telefono e dopo pranzo tutti vanno a dormire. Un vero schifo, in preda alla noia ed alle care vecchie abitudini.</P>
<P ALIGN="JUSTIFY">Per prima cosa and&ograve; in cucina a cercarsi la colazione, e neanche da dire che vi trov&ograve; la solita lattina di coca, come sempre fuori dal frigo perch&egrave; fredda fa male, e quindi calda come il piscio di un pensionato con le vene varicose. O gi&ugrave; di l&igrave;.</P>
<P ALIGN="JUSTIFY">Trov&ograve; anche dei biscotti secchi, che tre giorni prima dovevano essere dei frollini, ma adesso andavano bene per piastrellarci il pavimento del cesso, o per raschiare la vernice dai muri. Prov&ograve; a intingerli nella coca, dando il via ad una reazione psicochimica che avrebbe potuto fargli esplodere lo stomaco, ma tanto non succedeva mai niente, anche se i libri sono pieni di avvertimenti su quello che si fa e quello che non si fa. Sono tutte fregnacce, buone solo se sei ipocondriaco, perch&egrave; le congestioni non esistono, le ulcere nemmeno e le caghette non parliamone. Sono tutte invenzioni delle mamme del mondo, buone solo se ci credi davvero. La cosa davvero ridicola &egrave; che c’&egrave; gente che vive con il terrore di morire di cancro a quarant’anni, e poi succede che muore sul serio, ma per un ossicino di pollo, e quando non ha nemmeno passato i trenta. La vita va cos&igrave;. Se ti chiudi in una campana di vetro, non fai in tempo a sentirti al sicuro che un aereo ti precipita proprio sulla zucca, e se mangi mezzo chilo di colesterolo per cena, l’infarto viene al padrone del macrobiotico che ti vive accanto. Un mondo pazzerello, cos&igrave; si dice.</P>
<P ALIGN="JUSTIFY">Mentre faceva la sua immonda zuppetta, Tommy sent&igrave; un rumore in cantina. Ora, i rumori sono tanti, sono frequenti, e pur spaventando non fanno mai del male a nessuno. Ma siccome ci abbiamo il cervello in balia delle onde elettromagnetiche, pensiamo sempre che il maniaco di turno sia pronto a colpire, e gi&agrave; ci immaginiamo il titolo del giornale che ci epitaffia come gli pare. Epitaffia, e vi risparmio ogni inciso. Ma anche qui, ci sarebbero due cose da dire. Io sono pronto a scommettere che il giorno che un pazzo meteopatico mi frantuma il cranio con un apriscatole tedesco, quel giorno sar&ograve; sotto la doccia a cantare, oppure sar&agrave; il giorno pi&ugrave; silenzioso e privo di scricchiolii che si ricordi a memoria d’uomo. Ma Tommy non pensava a queste cose, e se dobbiamo dirla tutta, non aveva nemmeno paura. Il suo sentire era un poco diverso. Lui fremeva. Fremeva perch&egrave; era da anni che aspettava un ladruncolo oppure un suo amico in vena di scherzi. I ragazzi d’oggi sono pervasi da un qual certo sadismo, e non vi sembri strano che molti vanno in cerca d’insetti per vedere cosa succede quando gli strappi le alette o le zampine, quando li fai arrostire con una candela e quando li imbottisci di benzina per poi dargli fuoco mentre cercano di salvarsi. Non mi stupirei se il gran capo fosse un panarotto. E Tommy si adeguava.</P>
<P ALIGN="JUSTIFY">Prese dal cassetto della cucina un coltello per bistecche. Poi lo gett&ograve; per uno che si usa per il pane, ma ancora non era soddisfatto. Cerc&ograve; meglio, in profondit&agrave;, ed alla fine non trov&ograve; un cazzo. Allora torn&ograve; su quello da tavola, e si accontent&ograve;. Sapeva di rischiare molto, perch&egrave; quel robino andava bene per togliersi il nero da sotto le unghie, e se volevi farci del male, allora dovevi mirare agli occhi, o alle palle. Lui non aveva ancora scelto, ma pensava di lasciarsi guidare dall’ispirazione. Trangugi&ograve; l’ultimo sorso di coca , e le bricioline dei biscotti che si staccavano dai denti gli provocarono un urto di vomito. Ma non vomit&ograve;, perch&egrave; gi&agrave; sentiva gli squilli di trombe, e vedeva i titoli del giornale. Ma non parlavano della sua tragica fine. Parlavano di come un giovane adolescente ha difeso la sua casa, sprezzante del pericolo, sprezzante di qualsiasi cosa possa costituire una valida scusa per non andare a controllare quando si sente un rumore.</P>
<P ALIGN="JUSTIFY">Tommy and&ograve; verso la scala che portava in cantina, armato di quel coltellino misero misero, ma anche di un fegato grosso cos&igrave;. Non saprei dire cosa gli passava esattamente per la testa, e forse tutto il merito di quell’ardire va attribuito alle ore di sonno non ancora smaltite, perch&egrave; quale persona sana di mente affronterebbe un temibile bandito con quel ridicolo pistolino? E’ pur vero che il ragazzo non c’&egrave; mai stato tutto, con la testa. Ma tant’&egrave;...</P>
<P ALIGN="JUSTIFY">Prima di cominciare la discesa sent&igrave; ancora quel rumore, come se qualcuno stesse rovistando fra gli scaffali. Si chiedeva che cazzo si credesse di trovare, in mezzo agli scaffali. E’ pur vero che qualcosa c’era, perch&egrave; l’argenteria dei nonni stava tutta l&igrave;, in attesa di una sistemazione migliore. Suo padre aveva detto a nonno Ronald che quella era solo una posizione provvisoria, in attesa che arrivasse il mobile Luigiqualchecosa che avevano ordinato dalla Svizzera. Ora, che il nonno avesse un numero alquanto ridotto di neuroni per via di tutte le botte e le pallottole che s’era beccato in guerra, lo si sapeva gi&agrave;. Ma che si facesse abbindolare in questa patetica maniera, davvero non lo avremmo sospettato. Quel &quot;dalla Svizzera&quot; era un gran tocco di classe. Bravo p&agrave;.</P>
<P ALIGN="JUSTIFY">Ci fosse stata ancora nonna Margaret, le cose sarebbero andate diversamente, e su quegli scaffali polverosi e preda dei topi ci sarebbe finito qualcos’altro, ad esempio lo scroto del babbo.</P>
<P ALIGN="JUSTIFY">Tommy cominci&ograve; ad andar gi&ugrave;. Teneva l’arnese puntato in avanti, ma ad ogni gradino quello diventava sempre pi&ugrave; piccolo, e quando i suoi piedi toccarono il pavimento, ormai si era ridotto ad un uncinetto col tappo di gomma. Ma il ragazzo non si perse d’animo, e prosegu&igrave; senza troppe remore.</P>
<P ALIGN="JUSTIFY">Per prima cosa venne alle mani con un ragno grosso come una palla da baseball e la sua dimora aerea, tanto spessa che quasi ci si strozzava. L’animale emise un grugnito e se ne and&ograve;. Quell’episodio gli aveva messo addosso la sensazione d’essere scoperto, vulnerabile. Azion&ograve; la vista stroboscopica a tutto piano, ma in quel buio fottuto non ci scorgeva un cazzo di niente. Quasi gli venne l’istinto di lasciar perdere, ma poi sent&igrave; di nuovo del movimento, e appena cap&igrave; donde provenisse, si avvent&ograve; sulla sua sciocca preda. L&igrave; per l&igrave; vide soltanto un uomo che si confondeva nell’ombra, ma fu abbastanza abile da capire la distanza che li separava, e quando gli fu a tiro brand&igrave; il suo coltello.</P>
<P ALIGN="JUSTIFY">&quot;Ciao, ciao...stronzone...&quot;</P>
<P ALIGN="JUSTIFY">L’uomo si gir&ograve;, senza un fiato, e si prese due coltellate piene di rabbia ed orgoglio, inflitte con una forza inumana. La prima non gli cav&ograve; manco un gridolino. Tommy sent&igrave; che la lama era entrata a fatica, come se avesse colpito del compensato. La seconda la inferse pi&ugrave; in alto, all’altezza della testa. Anche qui trov&ograve; qualcosa di duro. Poco dopo si sent&igrave; il rumore come di un bicchiere che cade per terra, senza rompersi. Tommy fece roteare le palle degli occhi, e sbuff&ograve;.</P>
<P ALIGN="JUSTIFY">&quot;Che cazzo ci fai qui, nonno? Non dovevi stare alla messa?&quot;</P>
<P ALIGN="JUSTIFY">&quot;Cristo benedetto, Tommy...mi hai fatto prendere un colpo.&quot;</P>
<P ALIGN="JUSTIFY">&quot;E devo anche averti cavato un occhio, razza d’un babbeo. Aspetta che cerco la luce.&quot;</P>
<P ALIGN="JUSTIFY">Tommy and&ograve; a cercare l’interruttore, e la cantina prese magicamente forma. Vicino agli scaffali di ferro stava un vecchio pisellone senza un occhio, con un rivolo di sangue che gli correva sulla guancia. Doveva averlo graffiato dopo aver colpito la palla di vetro. Probabilmente nonno Ronald non si era accorto di un cazzo, anche se ora cominciava a rendersi conto che gli mancava qualcosa. I due si misero a cercare per terra, per vedere fin dove fosse rotolato l’occhio di vetro del vecchio. Riguardo alla prima coltellata, sicuramente gli aveva preso la gamba di noce, e non vi credete che le protesi di Ronald Hogan finivano qui. Quell’uomo era fatto di tanti di quei materiali, che per i pezzi di ricambio c’era da mobilitare gli artigiani di tutta quanta la nazione. Non era un eroe di guerra, non aveva fatto nulla di eroico e nemmeno la sua mamma l’aveva cagato storpio. Soltanto che nell’arco di una strana vita, il fato ha voluto fargliene passare di tutti i colori, o forse ha provato in tutti i modi a toglierlo di mezzo, solo che un uomo del genere non lo fai fuori neanche a pallettoni. Sono quegli invulnerabili figli di puttana che la scampano sempre, che magari finiscono sotto un treno e ne escono con un dito rotto. Nonno Ronald era immortale, con ogni probabilit&agrave;. Questo lo pensavano tutti, nel quartiere dove viveva.</P>
<P ALIGN="JUSTIFY">Ad ogni modo, l’occhio non lo si trov&ograve; pi&ugrave;, cos&igrave; dovettero far senza, aspettando il ritorno della famiglia. Una volta di sopra, mentre nonno Ronald si stuccava la gamba, Tommy prese del disinfettante, mise il boccettino sul tavolo e and&ograve; a cercare del cotone. Quando torn&ograve;, fece per mettere l’alcool sul batuffolo, ma il boccettino era vuoto. Nonno Ronald aveva la faccia paonazza.</P>
<P ALIGN="JUSTIFY">&quot;Ma che cazzo hai combinato?&quot;</P>
<P ALIGN="JUSTIFY">Nonno Ronald rimase impassibile.</P>
<P ALIGN="JUSTIFY">&quot;Ti sei bevuto il disinfettante? Ma che razza di rincoglionito sei, nonno?&quot;</P>
<P ALIGN="JUSTIFY">&quot;Me ne sono accorto dopo.&quot;</P>
<P ALIGN="JUSTIFY">&quot;Beh, adesso ne faremo a meno. E ti tieni quel cazzo di taglio cos&igrave; com’&egrave;.&quot;</P>
<P ALIGN="JUSTIFY">Tommy guard&ograve; il vecchio con un po’ di compassione, poi vide il buco che stava di fianco al naso, e a pensare che prima ci stava l’occhio con tutto il bulbo gli venne da vomitare. Decise che bisognava tappare la falla, in un modo o nell’altro. Alla fine ci piazz&ograve; dentr&ograve; il batufolo, e lo fiss&ograve; con un poco di nastro adesivo. Nonno Ronald non fece una mossa, ma probabilmente se lo sarebbe stuccato, se Tommy lo avesse lasciato fare.</P>
<P ALIGN="JUSTIFY">Alla fine si sedettero in soggiorno, entrambi sul divano, entrambi senza ambizione alcuna. Eccoli l&agrave;, due tipi che ci fanno capire come funzionano le cose qui da noi, anche se non &egrave; che potrebbe cambiare qualcosa, nel caso fossero giusto un pelo pi&ugrave; determinati. Ma le cose stavano in quel modo, e i due si lasciavano morire ripensando a come era bello, o a come la sarebbe stato.</P>
<P ALIGN="JUSTIFY">Nonno Ronald si sfregava la gamba di legno, Tommy gli guardava l’occhio buco. Tommy sapeva che quel povero vecchio aveva il cervello in palla ormai da qualche anno, e la sua personale teoria era che durante uno dei mille interventi subiti dal pippaiolo, qualche medico distratto avesse asportato pi&ugrave; di quanto andasse fatto, lasciando cos&igrave; al signor Ronald Hogan una dose minima di materia grigia e neuroni, tanto da fargli assumere le sembianze di un organismo ancora in vita, anche se in realt&agrave; la cosa andava putrefacendosi ormai da tempo.</P>
<P ALIGN="JUSTIFY">Quando il nonno si addorment&ograve;, Tommy gli port&ograve; le gambe sul divano, gli tolse le scarpe, gli mise addosso una coperta, ed infine gli sfil&ograve; dal portafogli tutto quello che aveva, anche se non era poi molto. Prima del ritorno dei suoi, il ragazzo era gi&agrave; in sala giochi che sperperava tutto il suo avere, e lo fece cos&igrave; in fretta, che quando rincas&ograve; la sua famiglia stava ancora fuori. A quel punto, prese una banconota del monopoli e la mise dove prima c’era quella buona, confidando nel rincoglionimento del proprio progenitore.</P></td></tr></table>
</BODY>

</HTML>
