<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Interview mit AMIGA-Pr&auml;sident Bill McEwen (von Christoph Dietz)</H2>
<P>
Das folgende Interview wurde von unserem Partner amiga-news.de
ver&ouml;ffentlicht:
</P>
<P>
&raquo;<B>Amiga-News: In Ihrem letzten Executive Update haben Sie bekannt gegeben,
dass die CES (Consumer Electronics Show) ein gro&szlig;er Spa&szlig; f&uuml;r die
Amiga-Gemeinschaft werden w&uuml;rde. Aber wie konnte sie Spa&szlig; machen, wenn
Amiga Inc. dort nicht ausgestellt hat?</B>
</P>
<P>
Bill McEwen: Wir waren dort. Zwei Firmen haben f&uuml;r Amiga-unterst&uuml;tzte
Ger&auml;te auf der Show gezeigt. Diese Treffen waren privat, aber wir waren
dort :-)
</P>
<P>
<B>AN: K&ouml;nnen Sie uns Details &uuml;ber diese Ger&auml;te und die Firmen, die hinter
ihnen stehen nennen?</B>
</P>
<P>
BME: Nein. In beiden F&auml;llen unterliegen wir NDAs. Ank&uuml;ndigungen werden bald
folgen.
</P>
<P>
<B>AN: In einem Interview mit Corinna Cohn haben Sie der Gemeinschaft gesagt,
dass Amiga Inc. das Geld ausgeht und unsere Leser fragen sich nun, ob dies
hei&szlig;t, dass Amiga schlie&szlig;en wird. Warum also geht Ihnen das Geld aus?</B>
</P>
<P>
BME: Wir sind weit davon entfernt zu schlie&szlig;en. Man braucht Geld, um dieses
Gesch&auml;ft zu f&uuml;hren, und wir planten letzten Sommer Kapital aufzustocken.
Unser Timing stimmte nicht, und der Markt hatte starken R&uuml;ckgang. Zurzeit
der Diskussion hatten wir noch kein weiteres Kapital gesichert.
</P>
<P>
<B>AN: Also kann ich annehmen, dass es keine finanziellen Engp&auml;sse mehr gibt?</B>
</P>
<P>
BME: Wir werden weiterhin jeden Pfennig zweimal umdrehen, das ist nicht der
Markt, um verschwenderisch mit seinem Geld umzugehen.
</P>
<P>
<B>AN: K&ouml;nnen Sie uns die Namen der Investoren von Amiga Inc. nennen?</B>
</P>
<P>
BME: Die &quot;Invisible Hand Corporation, LLC&quot;, und &quot;Net Ventures, BV&quot;.
</P>
<P><B>AN: Was erwarten diese Investoren von Amiga?</B></P>
<P>
BME: Geld zu machen.
</P>
<P>
<B>AN: Sie sind nicht daran interessiert, Amiga-Produkte in ihren eigenen
Produkten zu nutzen?</B>
</P>
<P>
BME: Es sind Investoren, keine Hersteller (OEMs).
</P>
<P>
<B>AN: Ist die B&ouml;rse eine M&ouml;glichkeit f&uuml;r Amiga Inc.? K&ouml;nnen wir in naher
Zukunft erwarten, Aktien kaufen zu k&ouml;nnen?</B>
</P>
<P>
BME: Das ist derzeit nicht m&ouml;glich. Aber Sie k&ouml;nnen in Zukunft erwarten,
M&ouml;glichkeiten zur Investition in Amiga zu bekommen.
</P>
<P>
<B>AN: Francis Charig sagte mir (wie auf amiga-news.de ver&ouml;ffentlicht), dass
das AmigaDE in der ersten H&auml;lfte dieses Jahres fertig wird. Stimmen Sie
dem zu?</B>
</P>
<P>
BME: Ja. Das ist der Plan.
</P>
<P>
<B>AN: Wie und wann (genau) wird das AmigaDE auf den Markt kommen?</B>
</P>
<P>
BME: Zun&auml;chst in einigen OEM-Hardwareplattformen, dann wird es mehr
Funktionalit&auml;t bekommen und f&uuml;r andere Hardware mit Software verf&uuml;gbar
sein.
</P>
<P>
<B>AN: MeterNet sagt, sie warten nur noch auf das AmigaDE f&uuml;r ihre Set-Top-
Box. Wann bekommen sie das AmigaDE, und wird diese Version dieselbe sein,
die in der OEM-Hardware erscheinen soll?</B>
</P>
<P>
BME: Ja, die erste Ver&ouml;ffentlichung ist f&uuml;r diese Art von Hardware-OEM.
</P>
<P>
<B>AN: Ebenso sprach Francis &uuml;ber Speicherschutz und warum TAO keine Pl&auml;ne
hat, Speicherschutz in das Betriebssystem zu integrieren. Aber Sie haben
schon bekanntgegeben, dass Amiga Speicherschutz ins AmigaDE integrieren
will. Ist das immer noch geplant?</B>
</P>
<P>
BME: Tao wird es nicht tun, und sie wollten es nie tun. Das entspricht dem,
was sie schon immer gesagt haben. Speicherschutz ist bei Amiga in Arbeit.
Der Plan ist also noch derselbe, wie von Anfang an gesagt.
</P>
<P>
<B>AN: K&ouml;nnen wir erwarten, dass die ersten Versionen des AmigaDE schon
Speicherschutz haben?</B>
</P>
<P>
BME: Nein, nicht in der ersten Version. Das ist f&uuml;r sp&auml;ter geplant.
</P>
<P><B>AN: Warum denken Sie, dass Speicherschutz notwendig ist?</B></P>
<P>
BME: Ich pers&ouml;nlich denke, dass es sich f&uuml;r den Desktop- und Server-Markt
besser eignet.
</P>
<P>
<B>AN: Was k&ouml;nnen AmigaDE-Entwickler f&uuml;r das n&auml;chste SDK-Update erwarten?</B>
</P>
<P>
BME: Sound, 3D, und zahlreiche andere neue Tools und Verbesserungen.
</P>
<P><B>AN: Wann k&ouml;nnen sie das n&auml;chste Update erwarten?</B></P>
<P>
BME: Geplant f&uuml;r Ende Februar - Mitte M&auml;rz.
</P>
<P>
<B>AN: Mehr als 15.000 Exemplare des SDK wurden verkauft. Wieviele Entwickler
sind registriert? Und wieviele davon steuern Software bei?</B>
</P>
<P>
BME: Ein wenig &uuml;ber 2.000 sind arbeiten aktiv.
</P>
<P>
<B>AN: Das hei&szlig;t, dass mindestens 13.000 Leute das SDK nur gekauft haben, um
Amiga Inc. mit etwas Geld zu unterst&uuml;tzen, oder um es in ihre Sammlung
aufzunehmen?</B>
</P>
<P>
BME: Sie fragten wieviele sich registriert haben. Wir haben Tausende, die
arbeiten und sich nicht registriert haben.
</P>
<P>
<B>AN: Wissen Sie, warum diese sich nicht registriert haben?</B>
</P>
<P>
BME: Nein. Das liegt in ihrer Entscheidung. Wir haben auch zwei Webseiten
aufgesp&uuml;rt, die Raubkopien des SDK erstellten. Ich denke, dass wir sie
geschlossen haben, aber wir wissen, dass einige Kopien heruntergeladen
wurden, bevor wir sie gestoppt haben.
</P>
<P>
<B>AN: Was ist die erstaunlichste Software, die bislang beigesteuert wurde?</B>
</P>
<P>
BME: Da gibt es so viel, ich wei&szlig; nicht, wo ich anfangen soll. Ich m&ouml;chte
die Leute ermutigen, einen Blick in den Entwicklerbereich der Webseite zu
werfen, und die vielen Titel zu sehen, an denen gearbeitet wird.
</P>
<P>
<B>AN: W&auml;hrend der &quot;World of Amiga 2000&quot; in K&ouml;ln gab Fleecy bekannt, dass
bereits 1.5 Mio Einheiten des AmigaDE verkauft wurden. In welchem Markt,
und wann wird es auf AmigaDE basierende Produkte geben?</B>
</P>
<P>
BME: Produkte werden ab M&auml;rz diesen Jahres erscheinen.
</P>
<P>
<B>AN: Gerade kam eine Pressemitteilung von &quot;Thendic Electronic Components&quot;
die besagt, dass &quot;Thendic im September 2001 einen modifizierten Handheld-PC
f&uuml;r den Verbrauchermarkt unter dem Label 'Amiga(TM)' ver&ouml;ffentlichen
will.&quot; Lizensiert Thendic nur den Namen &quot;Amiga&quot;? Oder werden sie das
AmigaDE benutzen?</B>
</P>
<P>
BME: Es gibt nur EINEN Besitzer des Namens und Warenzeichens Amiga, Amiga
Inc. Wir besitzen die weltweiten Exklusivrechte an Allem rund um Amiga,
die einst Gateway besa&szlig;. Thendic hat das AmigaDE f&uuml;r ihre Ger&auml;te
lizenziert. Wir sollten bis n&auml;chsten Monat noch nichts sagen, aber da sie
es bekannt gegeben haben, ja, sie sind einer von den vielen Lizenznehmern
des AmigaDE.
</P>
<P><B>AN: Und gibt es auch andere Produkte?</B></P>
<P>
BME: Verschiedene sind an mehreren Stellen in Arbeit.
</P>
<P>
<B>AN: Wie viele Exemplare des AmigaOS 3.9 sind verkauft? Wie nah sind wir an
einer PPC-Version des AmigaOS 4.0?</B>
</P>
<P>
BME: Ich wei&szlig; es momentan nicht. Wir hatten mehrere tausend vor Weihnachten
verkauft, und ich habe seitdem keine Berichte &uuml;ber Verkaufszahlen mehr
gesehen. Wir sollten bald ein paar Zahlen auf der Webseite haben. Was
allerdings das Erreichen der Mindestverkaufszahl f&uuml;r die AmigaOS 4.0
PPC-Version angeht, so sind wir noch weit davon entfernt. Wir sch&auml;tzen
noch den Marktbedarf f&uuml;r dieses Produkt ab, und ich hoffe, dass wir zeigen
k&ouml;nnen, dass es einen echten Markt und ein Gesch&auml;ft f&uuml;r 4.0 gibt, und sogar
weitere Versionen in der Zukunft.
</P>
<P><B>AN: Wann k&ouml;nnen wir eine Entscheidung erwarten?</B></P>
<P>
BME: Wir arbeiten derzeit daran.
</P>
<P>
<B>AN: Welche Verbesserungen im klassischen AmigaOS w&uuml;rden einen
Versionssprung auf 4.x rechtfertigen?</B>
</P>
<P>
BME: Wenn die Entscheidung gefallen ist, werden Sie eine Liste der
angestrebten Features sehen und dann werden wir es alle wissen.
</P>
<P>
<B>AN: Kennen Sie den Entwicklungsstatus von Eyetech und bPlan?</B>
</P>
<P>
BME: Mein Augenmerk war mehr auf Kapitalangelegenheiten gerichtet, Fleecy
hat sich n&auml;her mit diesen Entwicklungen besch&auml;ftigt.
</P>
<P>
<B>AN: Wird der AmigaOne im 3. Quartal 2001 verf&uuml;gbar sein?</B>
</P>
<P>
BME: So ist es geplant.
</P>
<P>
<B>AN: Wie kann die Amiga-Gemeinschaft Amiga Inc. am besten unterst&uuml;tzen?</B>
</P>
<P>
BME: Der beste Weg, um direkt zu helfen, ist der Kauf des SDK und anderer
Produkte. Und je mehr Leute Produkte f&uuml;r Amiga erstellen, um so besser.
Wir haben k&uuml;rzlich einige neue Spiele f&uuml;r das AmigaDE erhalten, und sie
sind toll. Es ist wirklich ermutigend, die Bem&uuml;hungen der Entwickler zu
sehen und je mehr Entwickler wir haben, um so besser.
</P>
<P>
<B>AN: Sind diese Spiele von anderen Plattformen konvertiert oder sind sie
neu? Sind sie beispielhaft, was Grafik, Sound und Idee angeht?</B>
</P>
<P>
BME: Alles dies.
</P>
<P><B>AN: Bill, danke f&uuml;r dieses Interview!</B></P>
Kontaktinformation Amiga Inc.<BR>
World Headquarter<BR>
AMIGA, Inc.<BR>
34935 SE Douglas Street<BR>
Suite 210<BR>
Snoqualmie, WA 98065 (USA)<BR>
Telefon +1-425-396-5660<BR>
Fax. +1-425-396-5671<BR>
<P>
email: <A HREF="mailto:bill@amiga.com">bill@amiga.com</A> WWW: <A HREF="http://www.amiga.com" TARGET="_top">http://www.amiga.com</A>
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Interview:&nbsp;</TD><TD VALIGN="TOP">Christoph Dietz &lt;<A HREF="mailto:cd@amiga-news.de">cd@amiga-news.de</A>&gt;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&Uuml;bersetzung:&nbsp;</TD><TD VALIGN="TOP">R&uuml;diger Hanke &lt;<A HREF="mailto:tomjoad@muenster.de">tomjoad@muenster.de</A>&gt;&nbsp;&#171;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P ALIGN="RIGHT">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
