<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Leserbrief zu &raquo;Abschlie&szlig;end&laquo; in Ausgabe 01/2001 (von Steffen H&auml;user)</H2>
<P>
Ich kann zu Martin Bautes Schl&uuml;ssen in &quot;Abschlie&szlig;end&quot; in keinster Weise
zustimmen, dass &quot;OS 4.0 PPC&quot; eine &quot;bescheuerte Idee&quot; w&auml;re.
</P>
<P>
AmigaDE ist leider auf lange Sicht (= voraussichtlich Ende 2001) nicht
verf&uuml;gbar. Software-Firmen brauchen etwas, wof&uuml;r sie Software verkaufen
k&ouml;nnen. Eine Erkl&auml;rung &quot;Wir machen OS4.0 PPC&quot; w&auml;re ein Signal f&uuml;r den Markt
&quot;Es geht noch was auf dem Classic, ihr k&ouml;nnt ruhig noch Classic-Software
kaufen&quot; und damit ein direkter Support von im Classic-Markt aktiven Firmen.
Letzten Endes w&uuml;rde eine Stabilisierung des Marktes auch Amiga selbst
wieder zugute kommen, f&uuml;r den AmigaDE (u.a. auch durch Erh&ouml;hung der
Verkaufszahlen neuer Hardware, die sowohl f&uuml;r den Classic-Amiga als auch
den DE verwendbar ist, ebenso w&uuml;rde IMHO Amiga davon profitieren, wenn noch
eine &quot;aktive Community&quot; vorhanden ist, und hierauf w&uuml;rde sich eine
Ank&uuml;ndigung von OS 4.0 PPC sicher positiv auswirken).
</P>
<P>
Ein OS 4.0 PPC k&ouml;nnte ich mir etwa so vorstellen:
</P>
<UL>
<LI> 68k-Emulator (der ja im Prinzip schon fertig ist)
</LI>
<BR><LI> PPC-native-Versionen von exec, dos, graphics, intuition
</LI>
<BR><LI> Neues Filesystem, das beim Seek nicht mehr so lahm ist (f&uuml;r 68k- und PPC-
  Systeme)
</LI>
<BR><LI> PPC-native-Filesystem f&uuml;r zumindest die wichtigsten Devices (= CS PPC UW
  SCSI, Blizzard PPC SCSI, A1200/A4000 IDE)
</LI>
<BR><LI> Neues Kickstart-ROM (f&uuml;r 68k- und PPC-Systeme)
</LI>
<BR><LI> Eine WB-Emulation, die vollst&auml;ndig ins System integriert ist, voll PPC-
  native
</LI>
<BR><LI> Ein komplett PPC-nativer Sound-Standard, voll ins System integriert
</LI>
<BR><LI> Erweiterung von WarpOS: Einbindung von virtuellem Speicher, zumindest
  applikationsbasiert
</LI>
<BR><LI> Erweiterte lowlevel.library mit PPC-native-Funktionen
</LI>
<BR><LI> PCI-Treiber f&uuml;r die wichtigsten Dinge im OS enthalten
</LI>
</UL>
<P>
Eine Erweiterung auf einen Emulations-Layer des Classic-OS auf AmigaDE kann
man ja sp&auml;ter immer noch machen, ist meiner Meinung nach auf lange Sicht
sogar sinnvoll, aber die PPC-OS-Portierung w&auml;re der erste Schritt.
</P>
<P>
Es mu&szlig; ja nicht eine komplette Portierung des OS sein. Wie man an diesem
&quot;Vorschlag&quot; sieht, m&uuml;sste &quot;OS 4.0&quot; nicht nur f&uuml;r PPC sein. Gerade die
Verbesserung des Filesystems und ein neues Kickstart-ROM (und Integration
von Treibern f&uuml;r aufkommende PCI-L&ouml;sungen) w&uuml;rden sicher auch 68k-K&auml;ufer
ansprechen.
</P>
<P>
Kurzum: Ich halte ein OS 4.0 f&uuml;r eine sehr gute Idee.
</P>
<P><B>Steffen H&auml;user &lt;<A HREF="mailto:MagicSN@Birdland.es.bawue.de">MagicSN@Birdland.es.bawue.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Forum3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
