<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
Am Gewinnspiel der letzten Ausgabe nahmen 79 Leser teil - das ist
erfreulicherweise ein deutlicher Anstieg im Vergleich zum Vormonat.
Bitte denkt diesmal wieder an die Teilnahme. Ihr wisst ja, dass ihr bereits
mit zwei Antworten gewinnen k&ouml;nnt.
</P>
<P><B>Jetzt zur Aufl&ouml;sung:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Standard-Frage:&nbsp;</TD><TD VALIGN="TOP">Vor kurzem ist eine neue Version des AmigaOS erschienen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Welche Versionsnummer tr&auml;gt sie?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Die gesuchte Versionsnummer lautet 3.9. Die interne Version der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Workbench 3.9, v45.1, haben wir aber ebenfalls akzeptiert.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<BR><BR>
<TR><TD VALIGN="TOP">Master-Frage:&nbsp;</TD><TD VALIGN="TOP">Welches Unternehmen hatte die Projektleitung zur Entwicklung&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">der gesuchten AmigaOS-Version inne?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Die richtige Antwort lautete &raquo;Haage &amp; Partner&laquo;.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<BR><BR>
<TR><TD VALIGN="TOP">Meinungsfrage:&nbsp;</TD><TD VALIGN="TOP">Hast du dir die neue AmigaOS-Version gekauft?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 (Ja, und ich bin mit dem Produkt zufrieden.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">37&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Ja, aber ich bin mit dem Produkt nicht zufrieden.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">6&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3 (Nein, aber ich werde es mir noch kaufen.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">14&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">4 (Nein, und ich werde es mir auch nicht kaufen.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">16&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
Zwei Teilnehmer konnten sich nicht zwischen den Antworten 1 und 2
entscheiden, ein weiterer nicht zwischen den Antworten 3 und 4. Ferner
haben zwei Einsender das OS 3.9 bestellt, aber noch nicht erhalten, und ein
Leser betrachtet seinen Kauf als Spende.
<BR><BR>
<P>
Einige Einsender hatten zu ihrer Beantwortung der Meinungsfrage Stellung
bezogen:
</P>
<P>
Krister S. Skrtic antwortet auf die Frage, ob er sich das OS 3.9 gekauft
hat mit &raquo;Ja, nat&uuml;rlich. Solange ich meinen Amiga benutze, werde ich mir
neue OS-Versionen kaufen.
</P>
<P>
Ich besitze zwar die meisten Dritthersteller-Programme des OS 3.9, wie etwa
Moovid, AWeb, etc., bereits, aber ich unterst&uuml;tze das Produkt trotzdem. Es
ist schlie&szlig;lich ein Update f&uuml;r das System, das ich mag. Und ich hoffe,
eines Tages OS 4 in PPC-Code kaufen zu k&ouml;nnen. WarpUp w&auml;re nett. :)&laquo;
</P>
<P>
Johan Svensson will sich die neue Betriebssystemversion in K&uuml;rze zulegen:
&raquo;Ich habe mir das AmigaOS 3.9 noch nicht gekauft, aber ein Freund von mir
besitzt es. Ich durfte es auf meinem A4000 testen und stellte fest: &quot;It
rulez! :-)&quot;. Ich werde es mir sehr bald zulegen!&laquo;
</P>
<P>
Michael Moritz ist mit dem OS 3.9 zufrieden und f&uuml;gt hinzu: &raquo;Hoffentlich
kommt bald das BoingBag mit dem WB-Multitasking, ich vermisse auch einen
ins System eingebundenen PDF-Viewer, der auch farbige(!) PDF-Seiten drucken
kann!!! Das AmiDock ist jedenfalls super! Ich hatte mehrere Docks in rund 5
Minuten konfiguriert...&laquo;
</P>
<P>
Gerhard Schmid meint &uuml;ber das OS 3.9: &raquo;Zu wenig Neues, viele Fehler, zu
teuer&laquo;.
</P>
<P>
Jan Grabenhorst hat vor, gleich etwas mehr Geld zu investieren: &raquo;Ich hab's
noch nicht gekauft, plane es aber zusammen mit einer BlizzardPPC zu kaufen,
dann habe ich die aktuellen Treiber gleich dabei...&laquo;
</P>
<P>
Kai Stegemann blickt in die Zukunft: &raquo;Hoffen wir, dass AmigaOS 4.0 =
AmigaDE ist, ohne Abstriche, egal ob auf Classic-Seite (Look&amp;Feel...) oder
bez&uuml;glich der Ank&uuml;ndigungen zum neuen OS.&laquo;
</P>
<P>
Andreas Orth hat sich das OS 3.9 nicht zugelegt und f&uuml;hrt weiter aus: &raquo;Ich
werde es mir auch nur kaufen, wenn ich die Tools, die darin enthalten sind,
gebrauchen kann, oder wenn sich sich wider Erwarten herausstellt, dass es
(im Gegensatz zur Version 3.5) bei mir l&auml;uft.&laquo;
</P>
<P>
Peter Dorn ist vom OS 3.9 &uuml;berzeugt: &raquo;Das System ist stabiler und
handlicher geworden. Viele kleine n&uuml;tzliche Features.&laquo;
</P>
<P>
Eine vorl&auml;ufige Bilanz zieht Klaus Moddemann: &raquo;Ich habe mir OS 3.9 gekauft,
weil ich noch 3.0 hatte und 3.5 damals nicht in Frage kam, da ich zu der
Zeit nicht auch noch das Geld f&uuml;r die 3.1-ROMs ausgeben wollte. Mein
Eindruck zum OS 3.9: Es l&auml;uft stabiler und einen Tick schneller als das
alte. Ich habe leider noch nicht alle Features austesten k&ouml;nnen, aber was
ich bisher gesehen habe, lag noch nicht ganz im Rahmen meiner Erwartungen.&laquo;
</P>
<P>
Stephan Kolbe sieht das OS 3.9 positiv: &raquo;Ja, ich bin zufrieden, obwohl ich
immer noch nicht wei&szlig;, warum seitdem MagicMenu abst&uuml;rzt. Nein, jetzt mal
ehrlich, durch das neue OS sind wieder einmal ein paar Standards gesetzt
worden, was ja nicht schlecht ist. Ansonsten ist es eine gute Sammlung an
Tools und Apps, die, wenn man sie einzeln erworben h&auml;tte, garantiert teurer
gekommen w&auml;ren.&laquo;
</P>
<P>
Kai Eckardt hat die Frage sehr ausf&uuml;hrlich beantwortet: &raquo;Ja, ich habe das
OS 3.9 gekauft. Allerdings nur, weil ich versuchen will, Genesis als Router
einzusetzen. Den Rest kann man sich ja schenken. AmiDock hat etwa 2 Minuten
auf meiner WB verbracht, bis ich es ausschalten konnte. :) Ich verstehe den
Wirbel darum nicht. Schlie&szlig;lich hat man doch den gesamten Desktop, um Icons
darauf abzulegen, warum dann so ein Stuss? DefIcons ist 'ne ganz nette
Sache, bei VincEd bin ich mir da noch nicht so sicher. Sch&ouml;n, man kann den
Text wieder nach oben scrollen, wie man die Icons im Fenster in den
Sichtbereich bringen kann, aber vielleicht ist ja schon dem ein oder
anderen aufgefallen, da&szlig; man eine Ausgabe eines langen Verzeichnisses mit
&quot;dir&quot; nicht mehr mit der Leertaste stoppen kann. Das hei&szlig;t man ist
gezwungen, die Scrollfunktion auch zu benutzen! Vielleicht gibt es ja eine
Option, den Leertastenstop wieder einzustellen, die ich bislang noch nicht
gesehen habe.
</P>
<P>
Also, da eine Antwort vorgegeben ist, w&uuml;rde ich wohl Nr. 2 nehmen. Also ja,
habe es gekauft, bin aber nicht zufrieden damit. Wusste das allerdings auch
schon vorher, der Grund war Genesis.&laquo;
</P>
<P>
Rudolf Rager schreibt: &raquo;Ja, ich hab mir OS 3.9 auf der Messe gekauft und
bin zu 99 % zufrieden damit. Besonders die Installation verl&auml;uft
unkompliziert, und Fehler sind bisher auch keine aufgetreten. :))
Noch ein Nachtrag zur letzten Umfrage bez&uuml;glich des Messestandortes: Ich
bin mit 2 Kollegen aus dem sch&ouml;nen Salzkammergut acht lange Stunden mit dem
Auto angereist, die n&auml;chste Amiga-Messe geh&ouml;rt also gef&auml;lligst nach
&Ouml;sterreich. ;)&laquo;
</P>
<P>
Mario Orth will sich das Betriebssystemupdate nicht kaufen: &raquo;Ich habe mir
im Oktober 99 das OS 3.5 zugelegt. Deshalb kaufe ich mir doch jetzt nicht
schon wieder ein neues OS.&laquo;
</P>
<P>
Andreas Wolf h&auml;tte ein verg&uuml;nstigtes Upgrade von OS 3.5 begr&uuml;&szlig;t: &raquo;Noch habe
ich mir das OS 3.9 nicht zugelegt, denn ich geh&ouml;re eher zu denen, die erst
mal Tests und Bugreports abwarten, sich also nicht irgendetwas aus Prinzip
kaufen und hinterher vom Produkt entt&auml;uscht sind. In der jetzigen Form
erscheint mir das OS 3.9 f&uuml;r seinen Preis nicht attraktiv. Hoffentlich
werden die BoingBags etwas daran &auml;ndern. Einen Upgrade-Preis von 3.5 auf
3.9 h&auml;tte ich eigentlich f&uuml;r obligatorisch gehalten.&laquo;
</P>
<P>
Eine interessante Begr&uuml;ndung f&uuml;r den Kauf liefert Denis Zwornarz: &raquo;Nicht,
weil ich es br&auml;uchte (meine Scalos-WB reicht mir). Ich sehe es eher als
eine Art &quot;Spende&quot; an (ist nicht negativ gemeint).&laquo;
</P>
<P>
Karl-Heinz Bader ist nur teilweise zufrieden. Er lobt das Tool UnArc,
bem&auml;ngelt jedoch das Installationsskript und die Dokumentation.
</P>
<P>
Diese Kritikpunkte f&uuml;hrt auch Uwe Eichhorn an: &raquo;Das OS3.9-Produkt
(Verkaufs-CD) wurde offensichtlich nicht ordentlich getestet. Die
Installations- und Programmfehler w&auml;ren vermeidbar gewesen. Die enthaltene
Dokumentation ist ein schlechter Witz.&laquo;
</P>
<P>
Carsten Krahl ist im Allgemeinen zufrieden, vermisst jedoch &raquo;PPC-
Applikationen bzw. OS-Unterst&uuml;tzung.&laquo;
</P>
<P>
Andreas Schauml&ouml;ffel kommt auf das Thema &raquo;PowerPC-AmigaOS&laquo; zu sprechen: &raquo;Es
gibt f&uuml;r den Preis einfach zu wenig grundlegende bzw. &quot;lohnende&quot;
&Auml;nderungen. Vor allem sollte &quot;H&amp;P&quot; sich doch mal zur&uuml;ckziehen und
&uuml;berlegen, in welchen Teilen eine ECHTE PPC-Unterst&uuml;tzung Sinn macht.&laquo;
</P>
<P>
David Sondermann hat sich das Betriebssystemupdate nicht gekauft und hat es
auch nicht vor: &raquo;Ich werde die Amiga-Classic-Linie nicht weiter
unterst&uuml;tzen, sondern lieber auf ein neues Amiga-System warten.&laquo;
</P>
<P>
Genauso verf&auml;hrt auch André Beer: &raquo;Ich habe bereits im letzten Jahr OS 3.5
gekauft, werde also wahrscheinlich vorerst nicht noch einmal in ein OS-
Update investieren. Ich warte einzig und allein auf den neuen Amiga...&laquo;
</P>
<P>
Stephan Karnasch will sich das Betriebssystemupdate aus Kostengr&uuml;nden nicht
besorgen.
</P>
<P>
Gernod Schomberg ist vom OS 3.9 entt&auml;uscht: &raquo;Ich bin mit dem Produkt nicht
zufrieden, weil es f&uuml;r mich nur geringf&uuml;gige Verbesserungen brachte. Meine
Meinung dazu habe ich sehr ausf&uuml;hrlich in der letzten Amiga aktuell
ge&auml;u&szlig;ert. Zudem kam kurz darauf der Boingbag 2 heraus, der einige der
&Auml;nderungen des OS3.9 enthielt! So kann man die treuen User auch ver&auml;rgern!&laquo;
</P>
<P><B>Fazit:</B></P>
<P>
Mehr als die H&auml;lfte der Teilnehmer hat sich das OS 3.9 bereits gekauft,
wobei eine &uuml;berw&auml;ltigende Mehrheit von ihnen mit dem Produkt zufrieden ist.
Dass sich bei den Kommentaren dennoch Pro und Contra in etwa die Waage
halten, d&uuml;rfte an dem Umstand liegen, dass der Mensch im Allgemeinen
Unzufriedenheit &uuml;ber etwas eher &auml;u&szlig;ert als Zufriedenheit. Letztere wird oft
als &quot;selbstverst&auml;ndlich&quot; hingenommen.
</P>
<P><B>Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:</B></P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;CDCat&quot;: Mattias Karlsson&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;ArtEffect 4&quot;: Nicolas Negretti&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;Maxon C++ 4.0 Pro&quot;: David Sondermann&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Herzlichen Gl&uuml;ckwunsch!</B></P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
