<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P><B>Es wird spannend!</B></P>
<P>
Ich wei&szlig;, ich wei&szlig;: Das habe ich in den letzten Jahren schon mehrmals
angek&uuml;ndigt, und am Ende gab es immer eine riesige Entt&auml;uschung f&uuml;r die
Amiga-User.
</P>
<P>
Doch diesmal besteht mehr Hoffnung auf den neuen Amiga als je zuvor: Schon
auf der CeBIT soll das erste Handheld-Ger&auml;t auf Basis des neuen
Betriebssystems pr&auml;sentiert werden.
</P>
<P>
Was aber bringt dies einem Anwender, der nicht mehr und nicht weniger als
einen Desktop-Rechner erwerben m&ouml;chte? Auf den ersten Blick gar nichts, auf
den zweiten jedoch sehr viel: Sowie die ersten AmigaDE-Produkte auf den
Markt kommen, seien es nun eben Handheld-Ger&auml;te, Set-Top-Boxen oder auch
Handies, erzielt AMIGA dadurch Einnahmen, also wichtige Ressourcen, um die
zweifellos aufwendigeren Computer-Versionen des Betriebssystems
fertigzustellen. Dar&uuml;ber hinaus sind qualitativ hochwertige AmigaDE-Ger&auml;te
beste Werbung f&uuml;r die kommende Generation von Amiga-Rechnern - genauso, wie
auf diesem Weg bereits im Vorfeld neue Softwareentwickler au&szlig;erhalb des
heutigen Amiga-Bereichs gewonnen werden k&ouml;nnen, darunter vielleicht sogar
einige &quot;Bekannte&quot;, die unser System vor Jahren verlassen hatten.
</P>
<P>
Unklar ist zum jetzigen Zeitpunkt noch, wann etwa die erste Desktop-Version
des AmigaDE erscheinen soll. Laut Eyetech wohl erst im Sommer; AMIGA selbst
sieht offenbar einen fr&uuml;heren Zeitpunkt im Bereich des M&ouml;glichen, will sich
jedoch nicht auf einen konkreten Termin festlegen. Das sollte uns aber gar
nicht st&ouml;ren, denn zu oft sind die Amiga-Anwender in den letzten Jahren von
Firmen und deren ambitionierten Zeitpl&auml;nen erst positiv, und als das
jeweilige Produkt dann erst sehr viel sp&auml;ter oder - meistens - &uuml;berhaupt
nicht erschien, negativ &uuml;berrascht worden.
</P>
<P>
Hoffen wir also bez&uuml;glich des AmigaDE auf einen m&ouml;glichst fr&uuml;hen Termin,
allerdings: Besser etwas sp&auml;ter und daf&uuml;r eine von vornherein ausgereifte
Version, als ein fehlerbehafteter Schnellschuss. Denn das kann den
potentiellen Erfolg des AmigaDE mit einem Schlag mindern oder im
schlimmsten Fall ganz zunichte machen.
</P>
<P><B>Bis n&auml;chsten Monat,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
