<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. News</H2>
<UL>
<LI> Quake Deathmatch
<P>
  'The Spirit of AMIGA' veranstaltet am 26.01. zum ersten Mal ein Quake-
  Deathmatch. Falls gen&uuml;gend Interesse besteht, wird ein Clan gegr&uuml;ndet
  und/oder ein eigener Server zum Spielen eingerichtet.
</P>
</LI>
<BR><LI> 'Ermentrud'
<P>
  Das Grafikadventure (Preview siehe letzte AA) macht Fortschritte. So ist
  nun die Spiel-Engine fast fertig. Es wurden ein Inventar hinzugef&uuml;gt
  und Multiple Choice Gespr&auml;che sind nun m&ouml;glich. Wahrscheinlich gibt es
  bald eine neue Demoversion. Auch die Dreharbeiten zu dem Film
  'Ermentrud' kommen voran.
</P>
</LI>
<BR><LI> Neudesignte Homepages
<P>
  Blittersoft hat seine Homepage neu designt und eine eigene Amiga
  Abteilung im Online-Shop eingerichtet.
  Auch Alternative-Games.de hat ein neues Layout.
</P>
</LI>
<BR><LI> 'Tales of Tamar'
<P>
  Es gibt mal wieder News zu ToT. So wurde ein deutsches FAQ geschrieben
  und die Chronik zum Jahre 60 erstellt.
</P>
</LI>
<BR><LI> Amiga Future in &Ouml;sterreich g&uuml;nstiger?
<P>
  Falls sich mindestens 20 Abonnenten in &Ouml;sterreich finden, kann die Amiga
  Future dort zum deutlich g&uuml;nstigeren deutschen Abo-Preis bezogen werden.
  Au&szlig;erdem sucht die Redaktion noch einige ehrenamtliche Schreiber.
</P>
</LI>
<BR><LI> Amiga Flame Top 10
<P>
  Auf der Seite von www.AmigaFlame.co.uk wurden die Top Ten Amigaspiele des
  Jahres 2000 gew&auml;hlt. Die ersten drei Pl&auml;tze belegen 'Herectic II',
  'Nightlong' und 'Earth2140' (in der Reihenfolge).
</P>
</LI>
<BR><LI> Neues Adventure von X-Team Software
<P>
  X-Team Software plant ein neues GrafikAdventure. Bis jetzt sind nur ein
  paar Screenshots ver&ouml;ffentlicht, die interessant aussehen.
</P>
</LI>
<BR><LI> Trogladite sucht Entwickler
<P>
  Trogladite Software sucht Entwickler f&uuml;r ihre Projekte. Au&szlig;erdem brauchen
  sie Leute f&uuml;r die Gestaltung der Homepage: <A HREF="http://www.trogsoft.org" TARGET="_top">http://www.trogsoft.org</A>
</P>
</LI>
<BR><LI> 'Another Commander' wurde Freeware
<P>
  'Another Commander' von Ragonsoft wurde eingestellt und als Freeware
  ver&ouml;ffentlicht. Das Weltraum-Strategiespiel kann man sich kostenlos
  herunterladen unter <A HREF="http://www.ragonsoft.org" TARGET="_top">http://www.ragonsoft.org</A>
</P>
</LI>
<BR><LI> PlayAmiga.de vom Netz
<P>
  PlayAmiga.de, eine bekannte Seite rund um die Welt der Amigaspiele,
  geht f&uuml;r kurze Zeit vom Netz, um sich einer Runderneuerung zu
  unterziehen. Nach dem ReDesign wird es nun Play!Amiga hei&szlig;en.
</P>
</LI>
<BR><LI> Start von 'Star Empire II'
<P>
  Am 31.1. startete das Spiel 'Star Empire II'. Das textbasierende Spiel
  wird &uuml;bers Netz gespielt. Doch im Gegensatz zu anderen Internetspielen
  wird bei 'Star Empire II' der Spielzug per E-Mail &uuml;bermittelt. Somit ist
  das Mitspielen auch Usern ohne Flatrate kosteng&uuml;nstig m&ouml;glich.
</P>
</LI>
<BR><LI> 'Ultra Violent Worlds' erschienen
<P>
  Mit 'UVW' erscheint bei Blittersoft die erste von mehreren versprochenen
  Hybrid-CDs, die sowohl die Amiga- als auch die PC- oder Mac-Version eines
  Spiels enthalten. Der Vorteil hierbei ist, dass man die Spiele auch in
  PC-Gesch&auml;ften kaufen kann.
</P>
<P>
  'Ultra Violent Worlds' wurde von Vorlan entwickelt und ist ein 2D-
  Shoot'em'Up mit vertikalem Parallaxscrolling f&uuml;r bis zu 2 Spieler.
  Eigentlich ist 'UVW' schon '98 erschienen, in der damaligen Version waren
  jedoch mehrere Bugs enthalten, die nun entfernt wurden.
</P>
</LI>
<BR><LI> Neue kostenlose kommerzielle Spiele
<P>
  Auf den Seiten von Back 2 the Roots und Ami Sector One gibt es neue
  Uploads:
</P>
<P>
  <A HREF="http://www.back2roots.org:" TARGET="_top">http://www.back2roots.org:</A> Unter anderem Championship Manager, Emerald
  Mine, Second Samurai
</P>
<P>
  <A HREF="http://www.amiga.emucamp.com:" TARGET="_top">http://www.amiga.emucamp.com:</A> Unter anderem alle Spiele von Craftgold
  (Fire&amp;Ice), Seek&amp;Destroy, Mayhem
</P>
</LI>
<BR><LI> Neuer Crusader-Clone
<P>
  Extraterestrial Developing hat einen neuen Crusader-Clone namens
  'Silencer' angek&uuml;ndigt. Es gibt bereits eine Demo in der Version 0.2b
  Diese l&auml;uft auf einem 640*480-Screen bei 256 Farben. Ben&ouml;tigt werden
  mindestens 16 MB RAM sowie 15 MB Platz auf der Festplatte.
</P>
</LI>
</UL>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
