<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerPC3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Der Zwischenruf
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Der Zwischenruf (von Ralf Driesner)</H1>
<P><B>Brust oder Keule.......?</B></P>
<P>
Und wieder einmal mu&szlig; ich feststellen: Die Welt ist gemein. In einem
M&uuml;nchner Radiosender konnten die H&ouml;rer k&uuml;rzlich ein spektakul&auml;res Ereignis
live miterleben. Im Zeitalter der &quot;Well&quot;-ness-Euphorie mu&szlig;te eine neue
Sportart her. So erfand man das &quot;Extrem-Mikrowelling&quot;. Sportlich, sportlich
....aber, wie zum Henker funktioniert das?
</P>
<P>
Man nehme ein kleines Kind, oder besser gesagt das Spielzeugauto eines
kleinen Kindes. Desweiteren nehme man die Schwester des kleinen Knirpses,
die schon seit einiger Zeit von einem fr&ouml;hlich-nervenden Sound aus genau
diesem Spielzeugauto traktiert wird.
</P>
<P>
Die arme Schwester, mit der wir alle mitf&uuml;hlen k&ouml;nnen, hatte nun also
diesen teuflischen Plan, das Spielzeugauto in der Mikrowelle zu &quot;garen&quot;.
Jedoch sollte ganz M&uuml;nchen von diesem Befreiungsschlag erfahren, und so
ging das ganze &quot;On-Air&quot;.
</P>
<P>
Sekundi&ouml;s schilderte die Schwester, wie sich das Nerv-Monstrum innerhalb
von drei Minuten in eine kleine erschlagene Plastikpf&uuml;tze aus verlaufenen
Farben verwandelte. Am Ende dieser Zeremonie war f&ouml;rmlich die Erleichterung
der Spielzeug-Terroristin zu vernehmen, als sie best&auml;tigte, dass in der
Plastikpf&uuml;tze keine Batterie mehr angeschlossen werden kann, die das
vermeintliche Ger&auml;usch (von Musik zu sprechen w&auml;re wohl &uuml;bertrieben) zu
erzeugen vermag.
</P>
<P>
&quot;Na gut&quot; spricht der Leser. &quot;Ein bi&szlig;chen Elektronik weniger auf diesem
Planeten. aber wo ist der Kick?&quot;
Nun, sarkastisch wie ich bin, h&auml;tte ich das Kind auch noch an der Zeremonie
teilnehmen lassen. Durch das sicherlich laute Weinen des Kindes h&auml;tte sich
die entschlossene Handlungsweise der Schwester bestimmt noch unterstreichen
lassen.
</P>
<P>
Bevor jetzt aber reihenweise Beschwerden vom deutschen Kinderschutzbund auf
mich hernieder prasseln, versuche ich, den eleganten Bogen zum Amiga zu
wagen.
</P>
<P>
Eines der gr&ouml;&szlig;ten Probleme heutiger Elektronik ist eindeutig der mangelnde
&quot;L&auml;rmschutz&quot;. L&uuml;fter und Laufwerke, Motoren und Signale toben sich an
unserem Geh&ouml;r t&auml;glich aus. In einer Gro&szlig;stadt wie M&uuml;nchen wirkt sich das
zwangsweise auf die Psyche aus. Wer hat nicht schon mal heimlich den
Nachbarn oder den Computer in die Mikrowelle gew&uuml;nscht?!
</P>
<P>
Eine Bitte nach Snoqualmie: Hoffentlich bleiben uns solche Situationen und
Erlebnisse wenigstens bei unserer &quot;Freundin&quot; erspart. Ich w&uuml;rde nur
ungern.....
</P>
<P><B>Lebt lang und erfolgreich</B></P>
<P><B>Euer</B></P>
<P><B>Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;</B></P>
<P>
P.S.: Nat&uuml;rlich ist der Clou mit der Mikrowelle nicht zur Nachahmung
empfohlen. Wo sollen sich sonst die Ravioli sonnen?
</P>
<P ALIGN="RIGHT">
<A HREF="PowerPC3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
