<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Audio-DIGISERVICE</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="apc0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="apc.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#000080">
	<TR>
	    <TD><IMG SRC="apc.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#apc0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
	    <BR>
	    <H1 ALIGN="CENTER"><B><FONT COLOR="#FFFF00">Audio-DIGISERVICE</FONT></B></H1>
	    <BR>
	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#FF00FF">
	    <TR>
		<TD>
		<BR>
		<P ALIGN="CENTER"><B><U>Audio-DIGISERVICE f&uuml;r APC&amp;TCP Club, von Christian
		Heitzer</U></B></P>

		<H3><B><U>I) M&ouml;glichkeiten:</U></B></H3>

		<H3><B>1) Komplette Songs auf <I>Longplaydisks</I> sampeln.</B></H3>

		<P>
		Longplaydisks sind, wie der Name schon sagt,
		Langspieldisketten. Es handelt sich hierbei um ganz normale 3.5
		Zoll, 2DD Disketten f&uuml;r den Amiga. Diese Disketten
		hei&szlig;en so, weil sich auf ihnen ein komplettes Lieg
		befindet, welches, wie bei einer LP abgespielt wird. Es werden
		einfach die Daten, die sich auf der Disk befinden, Track
		f&uuml;r Track und Sector f&uuml;r Sector gelesen.<BR>
		<BR>
		Solche Disks werden mit dem Programm "Recordmaker" von Hagenau
		Computer erstellt. Es besteht hierbei die M&ouml;glichkeit,
		verschiedene Sampelraten zu benutzen, und au&szlig;erdem
		<B>2Bit-, 4Bit- oder 8Bit-Sampling</B>, wobei 2Bit sehr
		schlechte Qualit&auml;t aufweist,da die Aufnahme sehr, sehr
		stark rauscht. 4Bit weist eine gute Qualit&auml;t auf, und 8Bit
		die beste, ben&ouml;tigt um gegensatz zu 4Bit jedoch den
		doppelten Speicherplatz auf
		der Diskette.<BR>
		<BR>
		In der Besten Qualit&auml;t (8Bit, 15625 Herz passen "nur" 57
		Sekunden Musik, Sprache, ... auf eine Diskette. Mit 4MBit und
		28603 Herz passen 1.30 Minuten auf eine Disk, wobei die
		Qualit&auml;t hierbei wirklich ebenfalls sehr gut ist. Es sind
		Sampleraten von 5545 Herz bis 28603 Herz bei 2Bit oder 4Bit und
		5545 Herz bis 15625 Herz bei 8Bit m&ouml;glich. Im
		g&uuml;nstigsten Fall passen auf eine Disk mit 4Bit-Sampling ca.
		4:40 Min, bei 5545 Herz. Die Qualit&auml;t kann je nach Art des
		Aufnahmematerials (CD, Cass, LP; Techno, Heavy Metal, Rock, ...)
		sehr unterschiedlich sein. <B>4Bit-Sampling reicht so gut wie
		immer, da 8Bit nur unn&ouml;tig Speicher verbraucht.</B><BR></P>

		<H3><B>Und so wird vorgegangen, wenn man sich Songs auf Disks
		sampeln lassen m&ouml;chte:</B></H3>

		<P>
		Damit die Songs auf Disk gut verst&auml;ndlich sind, ist
		bitte folgendes zu beachten:<BR>
		<BR>

		<B>Pro 2 Minuten Musik, Sprache, ... nehme man 1 Disk</B>, bei
		welcher es sich am besten um eine Markendisk handelt, da bei
		einem Fehler auf der Disk der Song "h&uuml;pft" (wie auf einer
		verkratzten LP die Nadel, so h&uuml;pft hier der Schreib-/Lese-
		kopf des Laufwerks). F&uuml;r einen 4 Minutensong br&auml;uchte
		man also 2 Disk, f&uuml;r einen 6 Minutensong 3 Disketten.<BR>
		<BR>
		Bei 3 Disk ist jedoch zu beachten, da&szlig; die Disks
		gewechselt werden m&uuml;ssen. W&auml;rend der Computer Disk 2
		in Laufwerk 2 liest, mu&szlig; Disk 1 in Drive 1 durch Disk 3
		ersetzt werden.<BR>
		<BR>
		Wer sich also einen 6 Minutensong samplen lassen
		m&ouml;chte, der schicke mir bitte 3 Disks. Nat&uuml;rlich
		ben&ouml;tige ich noch den Song, am besten auf CD, da bei vielen
		Cassetten ein Pfeifen oder ein starkes Rauschen vorhanden ist,
		bei einer LP ist dies oft noch schlimmer (BITTE KEINE LPs
		SCHICKEN!). ICH MACHTE DIE CD/CASS SICHERLICH NICHT KAPUTT!! Ich
		werde jedoch versuchen, die bestm&ouml;gliche Qualit&auml;t bei
		m&ouml;glichst geringem Speicherverbrauch zu nutzen und
		versuchen, den 6 Minutensong auf 2 Disk unterzubringen. Ich habe
		dies schon oft und sehr erfolgreich mit vielen Songs versucht,
		und die Qualit&auml;t war in den meisten F&auml;llen meiner
		Meinung nach noch gut bis sehr gut.<BR>
		<BR>
		<B>Nicht ben&ouml;tigte Disks schicke ich wieder mit
		zur&uuml;ck!</B><BR>

		<BR>
		Wer will, kann sich auch selbstgezeichnetes, oder
		eingescanntes Bild auf die Disk packen lassen, das, w&auml;hrend
		der Song von Disk gespielt wird, angezeigt wird.<BR>
		Das Bild darf eine maximale Aufl&ouml;sung von 320x256 Pixel
		(LoRes) und h&ouml;chsten 16 Farben besitzen. Das Bild mu&szlig;
		mir auf Disk geschickt werden.<BR>
		Wer kein Bild hat, aber gerne wissen m&ouml;chte, welcher Song
		gespielt wird, f&uuml;r den kann ich meinetwegen, einen
		Textscreen mit DPaint anfertigen, der dann angezeigt wird.</P>

		<TABLE BORDER="0" WIDTH="100%" SUMMARY="">
		<TR>
		    <TD VALIGN="TOP">ACHTUNG:</TD>
		    <TD>Soll ein Bild angezeigt werden, so ist die Disk nur noch
			mit Kickstart 1.3 lauff&auml;hig, bei OS 2.0 oder OS 3.0
			st&uuml;rzt der Amiga nach dem Einlegen der Disk ab!!
			Abhilfe schafft hier z.B. das Programm "KICKSWITCH", welches
			unter anderem bei mir erh&auml;ltlich ist. Einfach zwei
			Leerdisks schicken und einen frankierten R&uuml;ckumschlag.
			KOSTENLOS!!!!!!!!!!!!!!!!!</TD>
		</TR>
		</TABLE>
		<BR>
		<H3><B>2) Ger&auml;usche oder kurze</B> Samples auf normale
		DOS-Disks sampeln.</H3>

		<P>
		Ich kann mittels des Programms "Deluxe Sound V3.1" und des
		gleichnamigen Audiodigitizers Ger&auml;usche und Samples
		digitalisieren. Hier spielt es eine weniger gro&szlig;e Rolle,
		auf welchem Tontr&auml;ger die Ger&auml;usche/Songs vorhanden
		sind, da die meisten St&ouml;rger&auml;usche herausgefiltert
		werden.<BR>
		<BR>
		Ein Sample kann momentan <B>maximal 810 bzw. 860 KByte</B>
		gro&szlig; sein, damit es auf eine einzelne Disketten passt
		(830000 Bytes bei OFS-Disketten, die noch mit Kick 1.2/1.3
		laufen sollen und 880000 Bytes bei FFS-Disketten, die nur mit OS
		2.0 oder h&ouml;her verwendet werden k&ouml;nnen.)<BR>
		<BR>
		Wer also Samples/Ger&auml;usche digitalisiert haben m&ouml;chte,
		der schicke mir bitte den Tontr&auml;ger, auf welchem sich der
		zu digitalisierende Song, etc. befindet und einige Disks. Evtl.
		w&auml;re eine Angabe, wieviel Speicher das Sample auf Disk
		maximal belgen darf, notwendig, falls die Samples f&uuml;r
		bestimmte Anwendungen ben&ouml;tigt werden.<BR>
		<BR>
		Evtl. w&auml;re auch eine Angabe der <B>Sampelrate</B>
		n&ouml;tig, die zwischen <B>5545 Herz</B> und <B>28603 Hz</B>
		liegen darf.<BR>
		<BR>
		Samples k&ouml;nnen in folgenden <B>Formaten</B> abgespeichert
		werden:</P>

		<UL>
		    <LI>DUMP
		    <LI>IFF-8SVX
		    <LI>Soundtracker
		    <LI>Sonix
		</UL>

		<P>
		Bitte evtl. noch die Anzahl der Octaven angeben (1-4), falls
		diese ben&ouml;tigt werden. ACHTUNG: Samples mit mehr Octaven
		ben&ouml;tigen auch mehr Speicher auf der Disk. Octaven werden
		meines Wissens nach nur von Sonix verwendet, oder ?<BR>
		Normale Samples, bzw. so gut wie alle Samples benutzen nur 1
		Octave.<BR>
		<BR>
		<B>AUF JEDEN FALL ANGEBEN, OB ES SICH UM EIN LOOP-SAMPEL HANDELN
		SOLL, ODER NICHT. (LOOP=WIEDERHOLUNGSSAMPEL, DAS IMMER WIEDER
		OHNE UNTERBRECHUNG VON VORNE ANF&Auml;NGT!)</B></P>

		<H3><B><U>IIa) Es besteht die M&ouml;glichkeit, folgendes/von
		folgendem zu samplen:</U></B></H3>

		<UL>
		    <LI><B>Audiocassetten</B> (Maxi, Long)
		    <LI><B>CDs</B> (Maxi, Single, Long)
		    <LI><B>Schallplatten</B> (Single, LP)
		    <LI><B>Videocassetten</B> (Filme, Musicvideos, ...) (NUR
			SYSTEM VHS!) Wer die Musik eines Films, etc. auf Disk
			gesampelt oder nur ein k&uuml;rzeres Sampel haben
			m&ouml;chte, der gehe genauso vor, wie bei Cass, LP, CDs,
			nur, da&szlig; er mir bitte die Videocassette zuschicken
			sollte.
		    <LI><B>Schallfolien</B>
		    <LI><B>Super Nintendo Games-Musik</B> Hierzu ben&ouml;tige
			ich das Super Nintendo Spiel, um die Musik oder
			Ger&auml;usche zu sampeln. (Falls n&ouml;tig, auch den
			entsprechenden Adapter, da ich leider keinen solchen
			f&uuml;r amerikanische oder japanische Module be- sitze.
		    <LI><B>Game Boy Games-Musik</B> Hierzu ben&ouml;tige ich das
			Game Boy Spiel, um die Musik oder Ger&auml;usche zu sampeln.
		</UL>

		<H3><B><U>IIb) DIE SAMPELS UND SONGS K&Ouml;NNEN LEIDER "NUR" MONO
		GESAMPELT.</U></B></H3>

		<H3><B><U>III) ALLGEMEINES:</U></B></H3>

		<UL>
		    <LI>Auf den Disks, die Ihr mir schickt, MU&szlig; sich
			irgendwelche PD-Soft (Demos, Musik, Spiele, ...) befinden,
			da&szlig; war's auch schon.<BR>
			<BR>
			Sollte mir lieber jemand Geld schicken, dann bitte 2 DM
			pro zu samplenden Song auf Longplaydisks, oder Sample
			bis maximal 860 KByte. F&uuml;r Ger&auml;usche/sehr
			kurze Samples bitte 1 DM. Sollte es sich bei den Samples
			um LOOP-Samples handeln, so bitte nochmals 1 DM
			dazuz&auml;hlen, da es oft eines l&auml;ngeren
			Zeitaufwandes bedarf, eine gute LOOP-Position im Sample
			herauszufinden.
		    <LI>Bitte einen R&uuml;ckumschlag beilegen (am besten
			gepolstert, damit weder Tontr&auml;ger noch Disks
			besch&auml;digt werden. (Ich bekam schon mal eine
			zerbrochene Disk per Post, weil man die Briefmarken
			anscheinden so fest abstempelte, da&szlig; die Diskette
			zerbrach. Also lieber gleich einen gepolsterten Umschlag
			ben&uuml;tzen!)
		    <LI>Gen&uuml;gend R&uuml;ckporto beilegen, damit ich die
			Disks wieder zur&uuml;ckschicken kann. Es besteht auch die
			M&ouml;glichkeit, da&szlig; ich einen Vermerk f&uuml;r die
			Post auf den R&uuml;ckumschlag schreibe ("PORTO ZAHLT
			EMPF&Auml;NGER!"), wodurch dann der Empf&auml;nger das Porto
			bezahlen darf, allerdings PLUS STRAFPORTO!!!!!!
			Au&szlig;erdem geht dies nur innerhalb von Deutschland.
			Darum lieber gleich genug R&uuml;ckporto beilegen. Sollte
			sich der Absender innerhalb Deutschlands befinden,
			allerdings kein R&uuml;ckporto beigelegt sein, so bleibt mir
			leider nichts anderes &Uuml;brig, als es, wie bereits
			erw&auml;hnt, mit "PORTO ZAHLT EMPF&Auml;NGER!" zu
			verschicken. Ist kein R&uuml;ckporto beigelegt, und der
			Absender befindet sich au&szlig;erhalb Deutschlands, so tut
			es mir schrecklich leid, aber ich kann die Sachen nicht mehr
			zur&uuml;ckschicken.<BR>
			<BR>
			Es w&auml;re besser, mehr R&uuml;ckporto
			beizulegen, nicht ben&ouml;tigtes R&uuml;ckporto schicke
			ich wieder mit zur&uuml;ck!
		    <LI>Wer noch Fragen hat, der schreibe einfach an meine Adresse!
		</UL>

		<P ALIGN="CENTER"><B><U>MEINE ADRESSE:</U></B><BR><BR>
		Christian Heitzer<BR>
		Rehwinkl 3<BR>
		93480 Hohenwarth<BR><BR>
		Bitte NICHT anrufen - KEIN TELEFON!</P>

		<P ALIGN="CENTER">ENDE DES TEXTES - Stand: 21.04.1994</P>
		<HR SIZE="4">

		<H3><B>Ricardo Blank:</B></H3>

		<P>
		Sampelt mit "Technosound Turbo II". Kostenlos gegen Disk UND
		R&uuml;ckporto. Auf der Disk sollte nat&uuml;rlich irgendwelche
		n&uuml;tzliche PD drauf sein. Allerdings kann er nur max. 25
		Sekunden sampeln, also nur kurze Teile oder einzelne
		Ger&auml;usche. M&ouml;glich von Casette und/oder von CD!<BR>
		<BR>
		Ricardo Blank<BR>
		Kastanienallee 8<BR>
		D-15344 Strausberg</P>
		<BR>
		</TD>
	    </TR>
	    </TABLE>
	    <BR>
	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="apc.gif" aLT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#apc0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
